{
  "author": "Blue_Cheer",
  "original_created_utc": 1656834780,
  "title": "The Bitcoin Supply Cap: Or How I learned to Stop Worrying and Trust the Math",
  "created_utc": 1656866764,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;h1&gt;Introduction&lt;/h1&gt;\n\n&lt;p&gt;You&amp;#39;ve probably heard over and over that Bitcoin has a 21 million supply cap. But where does that number come from? As is always the case with blockchain and cryptocurrencies it&amp;#39;s important to understand how they work so when you decide to go all in, you can be confident that you at least understand something about where you put your money, so you can hold on for dear life as your savings dwindle to nothing before the return of the bull market (it&amp;#39;s going to be a cold winter).&lt;/p&gt;\n\n&lt;p&gt;So as we all know, bitcoin has a halving cycle that has happened approximately every four years, since its inception in 2009. The original block reward being 50 bitcoin, which was cut in half every 210,000 blocks produced. We call this the four year cycle because at 10 blocks per minute, 6 blocks are added every hour, 144 every day, and 52,560 every year. And 210,000 divided by 52,560 is 3.99 or about 4 years.&lt;/p&gt;\n\n&lt;p&gt;But that&amp;#39;s not what I want to focus on here. I want to demonstrate how using some simple mathematical techniques we can calculate the sum total of all bitcoin produced, just knowing the halving cycle and the payout from the first block. We are going to do what is called finding the limit of an infinite series.&lt;/p&gt;\n\n&lt;h1&gt;Adding the Infinite with Zeno&lt;/h1&gt;\n\n&lt;p&gt;The most common way people are introduced to infinite series is some form of Zeno&amp;#39;s paradox, which I&amp;#39;m going to butcher here so that I don&amp;#39;t have to look up exactly what he said. Zeno claimed that it was impossible to walk between two points. He insisted that to do this you must first walk half the distance between the points, and then half again, and then half again, and so on. And at no point would you ever reach the end because you always had a little bit more to go. It may be easier to see this in this image I stole from google:&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/6zkbhzqopa991.jpg?width=420&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=dca72e9f5f885c4b38688025085b078164628f81\"&gt;Figure 1: NFT I Stole From Some Poor Soul.jpg&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;So to see how far we have traveled we have to add up the segments we have walked thus far, and we hope to god that this equals 1 or we may never reach the end of this hell. I added a little question mark above the equals sign, and some dots because we are really adding up an infinite list of numbers, and we don&amp;#39;t actually have a way to figure out what this is equal to yet.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/cdr1ax78qa991.png?width=667&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=4b6a3b968aa51712efe424f1bf613fe6bc7cc16f\"&gt;Figure 2: My own handmade NFT this time.jpg&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;And it was thousands of years before anyone could figure out how to actually find the answer to this problem. Newton, the famous inventor of calculus came along and just assumed that infinite sequences and series like this &lt;em&gt;just worked&lt;/em&gt; and used them to build calculus. But it wasn&amp;#39;t until a mathematician by the name of  Augustin-Louis Cauchy (that&amp;#39;s coshie not couchie) showed up in the early 19th century that we found a way to answer to this question. And yes, I promise I&amp;#39;ll get back to the bitcoin supply cap.&lt;/p&gt;\n\n&lt;p&gt;So Cauchy came along and said that under specific circumstances there will be a number that this sequence is equal to. Here I&amp;#39;ll call it &lt;strong&gt;L&lt;/strong&gt;. And this only happens when the numbers we are adding together get smaller and smaller as we go along in the sequence (like in Zeno&amp;#39;s paradox), until what we are adding is so small that it doesn&amp;#39;t change the final answer. Basically, we have pretty much walked to the end and can just step over the finish line.&lt;/p&gt;\n\n&lt;p&gt;So to put this in more mathematical terms, a &lt;strong&gt;sequence&lt;/strong&gt; will &lt;strong&gt;converge&lt;/strong&gt; to a &lt;strong&gt;limit&lt;/strong&gt;, &lt;strong&gt;L&lt;/strong&gt;, if and only if we go far enough in the sequence for the following to be true:&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/ukhe6298rb991.png?width=453&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=a09f4c1e634bec7e87f5efd8f1b35203ebde2462\"&gt;Figure 3: Sell this as an NFT, I dare you&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;All this is saying is that if we go a number, &lt;strong&gt;N&lt;/strong&gt; out in the sequence, then any sum &lt;strong&gt;n&lt;/strong&gt; and &lt;strong&gt;m,&lt;/strong&gt; farther then that, then the two sums become so close together that they are smaller than any number you could imagine (that is represented by the Greek symbol epsilon, thanks Zeno!)  So if this is the case for our series (which it is), then we can find the limit, L, to our series and find out exactly how far we&amp;#39;ve gone. Also, those little bars (called the absolute value) mean that if the answer is negative, just make it positive. For example, if we set n equal to 6 we would get:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/t0sgbi3x3b991.png?width=551&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=1539d8a749598bbc06e056bdcb275e461f691fac\"&gt;Figure 4: Quick Maths&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;So our little epsilon is 0.01562, a &lt;em&gt;very&lt;/em&gt; small number and we are starting to feel like this series might converge after all. I won&amp;#39;t bore you with every little detail but to show this we first must write our series in a way that shows what exactly is happening with each step. To see how we do this notice that each value in the denominator of our fractions is a power of 2.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/tsfa2iv1va991.png?width=840&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=12ec8fe1859b61c4d68e6cc8fd436042e1b82081\"&gt;Figure 5: Uh-oh things are starting to get complicated&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Now we can write this more compactly with a Greek symbol called sigma, which is just telling us to sum (add together), and we can use the letter n like we did before, to represent the power that 2 is raised to:&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/zxe1umwiwa991.png?width=677&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=cf12379aed8b32c567bd3824eb91c9f2f163a434\"&gt;Figure 6: Even more complicated but stick with me, we&amp;#39;re almost there!&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;And while this looks pretty confusing, it&amp;#39;s actually very simple. For example if we set n equal to 5, and write this out, it looks like this:&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/z43sy3xqwa991.png?width=983&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=d6354030af13bbad0141ee9259e1e03d1019209b\"&gt;Figure 7: Zeno BTFO&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;And look! We have only added 5 terms in the sequence and we&amp;#39;re getting close to 1. So what we have here is called a &lt;strong&gt;geometric series,&lt;/strong&gt; which is one very well understood type of infinite series, that goes to 1 (L=1) as the number of terms goes to infinity.&lt;/p&gt;\n\n&lt;h1&gt;The Bitcoin Supply Cap (or why bitcoin is backed by math)&lt;/h1&gt;\n\n&lt;p&gt;Now we want to do this same thing but with the bitcoin supply. We know that every 210,000 blocks the number of bitcoin produced per block gets cut in half, starting with 50 bitcoin. This looks something like:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/ik748l1oya991.png?width=1066&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=49b90a262ff0a092dd8d7dc3efdee493eb7b8e0b\"&gt;Figure 8: Printing BTC&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Where the ... represents the other 209,996 times that each number appeared before the getting cut in half at the halvening. But because we know how many times each number appears we can write this as:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/771jc95jza991.png?width=1157&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=9a20fbe7a69db41cc9d316e113019e3769a2a9ce\"&gt;Figure 9: How&amp;#39;s your algebra?&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Because adding 50, 210,000 times is 50 times 210,000. And look at the sequence of numbers in the parenthesis on the right hand side. They are cutting in half each time. So with a little more algebra we can work some magic to get&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/0yn0ksda0b991.png?width=997&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=4a71b644cbe73edd56ab7003fd6cbd68376f0f46\"&gt;Figure 10: Seriously, how is it?&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;And look at this. We have Zeno&amp;#39;s sequence appearing before our very eyes! Now we can rewrite this once more in a more compact form and hopefully for the last time as:&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/9uhmv4e75b991.png?width=431&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=a3e1e2d1486fe0422a06bd741c32299118590cfe\"&gt;Figure 11: Almost there&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Now we are almost there. We just have to resolve one issue that the savy among you may have already noticed. This series starts at 0 instead of 1 like Zeno&amp;#39;s. Fixing this is actually really easy. We just write out the first term in the sequence to remove it from the sum like this:&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/m2ss8lal5b991.png?width=846&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=edad8d9bb11f05cdc85c27cecca57754c14e5eb4\"&gt;Figure 12: I realize now that the comma was distracting&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Notice how we just took the first term out where n is zero, and then just wrote the rest but started it at 1. Now noting that 2 raised to 0 is 1, the first term is just 210000*50. And because we recognize that the series is Zeno&amp;#39;s series, we know that it is equal to 1. So we can multiply and add all this up to get our supply cap:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/7p4h199e2b991.png?width=969&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=647de851a03aa6d6a0ae624320cb6263e5e56f77\"&gt;Figure 12: Calculators out&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;And that&amp;#39;s how we get 21,000,000 bitcoin. We could actually do the same procedure to figure out how many years it would take to reach this number, but I wont do that here as this post is long enough.&lt;/p&gt;\n\n&lt;p&gt;So if you&amp;#39;ve made it this far thanks for reading! I honestly have no idea how easy this is to follow because I don&amp;#39;t know how much math the average cryptocurrency subreddit user knows. But if you&amp;#39;ve ever wondered why people like Michael Saylor say bitcoin is backed by math, this is it.&lt;/p&gt;\n\n&lt;p&gt;TLDR: The supply cap of Bitcoin is 21,000,000 bitcoin.&lt;/p&gt;\n\n&lt;p&gt;Edit: Fixed the definition of convergence. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 305,
  "permalink": "/r/CryptoCurrency/comments/vqcg3n/the_bitcoin_supply_cap_or_how_i_learned_to_stop/",
  "subreddit": "CryptoCurrency",
  "id": "vqcg3n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "INTRODUCTION\n\nYou've probably heard over and over that Bitcoin has a 21 million supply cap.\nBut where does that number come from? As is always the case with blockchain and\ncryptocurrencies it's important to understand how they work so when you decide\nto go all in, you can be confident that you at…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "イントロダクション\n\nビットコインの供給上限は2100万枚と何度も聞いたことがあると思います。\nしかし、その数字はどこから来ているのでしょうか。ブロックチェーンや暗号通貨でいつもそうであるように\n暗号通貨は、その仕組みを理解することが重要です。\nを確信することができます。",
      "title": "ビットコインの供給上限 あるいは、私はいかにして心配するのをやめ、数学を信頼することを学んだか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "简介\n\n你可能已经反复听说过，比特币有2100万的供应上限。\n但这个数字是怎么来的呢？就像区块链和\n的情况下，了解它们的工作原理是很重要的，所以当你决定\n全力以赴时，你可以确信你在...",
      "title": "比特币供应上限。或我如何学会停止担心并相信数学"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "簡介\n\n你可能已經反覆聽說過，比特幣有2100萬的供應上限。\n但這個數字是怎麼來的呢？就像區塊鏈和\n的情況下，瞭解它們的工作原理是很重要的，所以當你決定\n全力以赴時，你可以確信你在...",
      "title": "比特幣供應上限。或我如何學會停止擔心並相信數學"
    }
  ]
}