{
  "author": "fbaker",
  "original_created_utc": 1635296801,
  "title": "Don't ditch your alts if they haven't pumped yet",
  "created_utc": 1635317312,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I think it&#39;s easier said than done, but if you&#39;re holding an alts that has been moving sideways for awhile and you start to see other alts pump, that is the worst possible time to jump ship and try to catch the ride up. Coins will pump at different times, and if you&#39;re holding a quality coin, or anything really in the top 10-20, odds are that it will have its day so just be patient and hodl on. Try looking for quality projects that are below their ath versus chasing ones creating new ath&#39;s every day.</p>\n</div><!-- SC_ON -->",
  "score": 218,
  "permalink": "/r/CryptoCurrency/comments/qgkym5/dont_ditch_your_alts_if_they_havent_pumped_yet/",
  "subreddit": "CryptoCurrency",
  "id": "qgkym5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I think it's easier said than done, but if you're holding an alts that has been\nmoving sideways for awhile and you start to see other alts pump, that is the\nworst possible time to jump ship and try to catch the ride up. Coins will pump\nat different times, and if you're holding a quality coin, or…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "言うは易く行うは難しだと思いますが、もしあなたがしばらく横に動いていたアルトを持っていて\n他のアルトがパンプしているのを見たら、それは最悪のタイミングです。\nそれは最悪のタイミングであり、船に乗って上昇気流に乗ろうとすることです。コインのパンプ\nもしあなたが質の高いコインを持っているなら、あるいは...",
      "title": "まだパンプしていないアルトを見捨てないでください"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我认为说起来容易做起来难，但如果你持有的盟友已经横盘了一段时间，而你开始看到其他盟友在抽水，那就是你的问题。\n如果你持有的盟友已经横盘了一段时间，而你开始看到其他盟友的抽水，这就是\n这是最糟糕的时候，你可以跳槽，并试图赶上这趟旅程。钱币会在不同的时间被抽走\n在不同的时间，如果你持有一个高质量的硬币，或...",
      "title": "如果你的盟友还没有被抽中，就不要抛弃他们。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我認爲說起來容易做起來難，但如果你持有的盟友已經橫盤了一段時間，而你開始看到其他盟友在抽水，那就是你的問題。\n如果你持有的盟友已經橫盤了一段時間，而你開始看到其他盟友的抽水，這就是\n這是最糟糕的時候，你可以跳槽，並試圖趕上這趟旅程。錢幣會在不同的時間被抽走\n在不同的時間，如果你持有一個高質量的硬幣，或...",
      "title": "如果你的盟友還沒有被抽中，就不要拋棄他們。"
    }
  ]
}