{
  "author": "jetmax25",
  "original_created_utc": 1642745576,
  "title": "Don't Listen To Anyone Telling You To Brave It Out, They Are Only Trying To Convince Themselves. If You Need To Pull Go For It, Just Remember Never Put In What You Can't Afford To Lose",
  "created_utc": 1642833472,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The staggering number of posts saying that to be a millionaire you need to brave it out stinks of MLM schemes. Half these posts sound like they want to sell me a time share. Everyone should do what is best for them and not listen to others trying to protect their own stack. If those people actually cared they would be gleeful others are leaving so they could buy cheaper. &lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;If you need the money or are getting overly emotional then by all means cash out. Sometimes its better to have an unknown loss than live in anxiety. Next time just think carefully about your boundaries and where investing becomes gambling.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;I think its important to use the &lt;strong&gt;&amp;quot;3 Year Rule&amp;quot;&lt;/strong&gt; in crypto. (to my knowledge) On every date Bitcoin has always been worth more than it was three years prior. Thus, if you cannot live without your funds for the next three years you are investing too much.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 310,
  "permalink": "/r/CryptoCurrency/comments/s9421n/dont_listen_to_anyone_telling_you_to_brave_it_out/",
  "subreddit": "CryptoCurrency",
  "id": "s9421n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The staggering number of posts saying that to be a millionaire you need to brave\nit out stinks of MLM schemes. Half these posts sound like they want to sell me a\ntime share. Everyone should do what is best for them and not listen to others\ntrying to protect their own stack. If those people actually…"
}