{
  "author": "BigRed323",
  "the_new_excerpt": "AMD is up 3% this morning because of this deal. Does this allow the stock to\nretrace all time highs or are chip shortages and a high multiple still a\nconcern? I own $90 LEAPS for next year and while they are currently in the red,\nI'm still bullish on the company.\n\n> June 17 (Reuters) - Advanced…",
  "original_created_utc": 1623938546,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "AMDはこの取引のおかげで今朝3％上昇しました。これで株価は\nそれとも、チップの不足や高い倍率がまだ懸念されるのでしょうか？\n懸念されますか？私は来年に向けて90ドルのLEAPSを所有していますが、現在は赤字です。\n私はまだこの会社に強気です。\n\n> 6月17日（ロイター） - アドバンスト...",
      "title": "GoogleのクラウドがAMDを採用した新サービスでチップ競争が激化"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因为这项交易，AMD今早上涨了3%。这是否允许该股\n还是芯片短缺和高倍数仍然是一个问题？\n担忧？我拥有明年90美元的LEAPS，虽然他们目前处于亏损状态。\n我仍然看涨该公司。\n\n> 6月17日（路透社）--先进...",
      "title": "芯片大战升温，谷歌云计算为AMD提供新服务"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因爲這項交易，AMD今早上漲了3%。這是否允許該股\n還是芯片短缺和高倍數仍然是一個問題？\n擔憂？我擁有明年90美元的LEAPS，雖然他們目前處於虧損狀態。\n我仍然看漲該公司。\n\n> 6月17日（路透社）--先進...",
      "title": "芯片大戰升溫，谷歌雲計算爲AMD提供新服務"
    }
  ],
  "title": "Google's cloud taps AMD for new service as chip wars heat up",
  "created_utc": 1623948122,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>AMD is up 3% this morning because of this deal. Does this allow the stock to retrace all time highs or are chip shortages and a high multiple still a concern?  I own $90 LEAPS for next year and while they are currently in the red, I&#39;m still bullish on the company.</p>\n\n<blockquote>\n<p>June 17 (Reuters) - Advanced Micro Devices Inc (AMD.O) and Alphabet Inc&#39;s (GOOGL.O) Google Cloud on Thursday said Google will offer cloud computing services based on AMD&#39;s newest data center chip, a move likely to intensify AMD&#39;s push to grab market share from rival Intel Corp (INTC.O).</p>\n\n<p>Cloud computing providers such as Google, Amazon.com Inc (AMZN.O) and Microsoft Corp (MSFT.O) are some of the biggest buyers of data center chips. They build services on top of the chips to rent the computing power out to millions of customers.</p>\n\n<p>Google said on Thursday it will start offering services based on AMD&#39;s &quot;Milan&quot; server chip, which AMD released in March. Google said customers such as Snap Inc (SNAP.N) and Twitter Inc (TWTR.N) are testing the new AMD-based services.</p>\n\n<p>AMD has been gaining market share against Intel, which was long the dominant player in data center chips but whose offerings have inferior performance on some measures because of years of stumbles in Intel&#39;s manufacturing operations.</p>\n\n<p>Intel in April announced its &quot;Ice Lake&quot; chip competitor to AMD&#39;s &quot;Milan&quot; chip and said all major cloud providers would support it, but Intel has not said when Google will start offering services based on its latest chip.</p>\n</blockquote>\n\n<p><a href=\"https://www.reuters.com/technology/googles-cloud-taps-amd-new-service-chip-wars-heat-up-2021-06-17/\">https://www.reuters.com/technology/googles-cloud-taps-amd-new-service-chip-wars-heat-up-2021-06-17/</a></p>\n</div><!-- SC_ON -->",
  "score": 1151,
  "permalink": "/r/stocks/comments/o1xzmd/googles_cloud_taps_amd_for_new_service_as_chip/",
  "subreddit": "stocks",
  "id": "o1xzmd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009745347
}