{
  "author": "Gnarseph",
  "original_created_utc": 1640055545,
  "title": "How did you wish your parents handled you having sex as a teen (if they knew or found out)?",
  "created_utc": 1640086617,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Look, I’m a dad. I get it. I was a very promiscuous teen. In fact, I had a child at 17. Welp, that child is now active. &lt;/p&gt;\n\n&lt;p&gt;Only difference here is that I didn’t have parents. No one to guide me. I needed to find people to love me. &lt;/p&gt;\n\n&lt;p&gt;She has (what I’d like to think) very loving and understanding parents. We’re not naive. We discuss this stuff. But I’m losing my mind. &lt;/p&gt;\n\n&lt;p&gt;“No your boyfriend cannot be in your room” &lt;/p&gt;\n\n&lt;p&gt;“No your boyfriend cannot spend the night” &lt;/p&gt;\n\n&lt;p&gt;This evening she replied with “if you make this harder, it’s just more fun” &lt;/p&gt;\n\n&lt;p&gt;Like…. Wtf… parenting is hard.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/rl4gg6/how_did_you_wish_your_parents_handled_you_having/",
  "subreddit": "TooAfraidToAsk",
  "id": "rl4gg6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Look, I’m a dad. I get it. I was a very promiscuous teen. In fact, I had a child\nat 17. Welp, that child is now active.\n\nOnly difference here is that I didn’t have parents. No one to guide me. I needed\nto find people to love me.\n\nShe has (what I’d like to think) very loving and understanding…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "いいか、俺は父親なんだ。分かるよ 私は乱暴な10代だった 実際、私は子供を産みました\n17歳のとき。まあ、その子も今は現役です。\n\nただ一つ違うのは、私には親がいなかったということです。私を導いてくれる人は誰もいない。必要なのは\n愛してくれる人を見つけること。\n\n彼女は（私が思うに）とても愛情深く、理解ある人たちを持っている...",
      "title": "10代の頃のあなたのセックスについて、ご両親にどのように対応してほしかったですか（知っていた場合、知った場合）？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "听着，我是一个父亲。我明白了。我是一个非常淫乱的青少年。事实上，我有一个孩子\n在17岁时。好吧，那个孩子现在很活跃。\n\n唯一不同的是，我没有父母。没有人指导我。我需要\n要找到爱我的人。\n\n她有（我想是）非常有爱心和理解力的...",
      "title": "你希望你的父母如何处理你在青少年时期的性行为（如果他们知道或发现）？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "聽着，我是一個父親。我明白了。我是一個非常淫亂的青少年。事實上，我有一個孩子\n在17歲時。好吧，那個孩子現在很活躍。\n\n唯一不同的是，我沒有父母。沒有人指導我。我需要\n要找到愛我的人。\n\n她有（我想是）非常有愛心和理解力的...",
      "title": "你希望你的父母如何處理你在青少年時期的性行爲（如果他們知道或發現）？"
    }
  ]
}