{
  "author": "BillyBabel",
  "original_created_utc": 1629639580,
  "title": "If you are an unattractive person, how are you supposed to reconcile between \"you don't choose who you're attracted to\" and \"lower your standards\"?",
  "created_utc": 1629653344,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Let&#39;s not beat around the bush here, people can say beauty is in the eye of the beholder or whatever, but the overwhelming amount of evidence we have says that beauty and who someone will date is pretty predictable, and that attractiveness has some objective elements to it. If someone is on a scale of 1-10 is a 5, then they will date someone who is a 5 and maybe a 4 or 6. A 10 will date another 10 or a 9, and a 1 will date another 1 or 2. And it is unfortunate, but finding someone physically attractive is an important part of a relationship, no happy relationship will be one where the other person says &quot;yes I find them physically revolting but he is so sweet&quot; </p>\n\n<p>So if you can&#39;t choose who you&#39;re attracted to, how do you find happiness in your life if you are a 4 who is attracted to 8s? I hear people say to lower your standards and stuff like that, but how do you just simply change what you find attractive to be happier?</p>\n</div><!-- SC_ON -->",
  "score": 155,
  "permalink": "/r/NoStupidQuestions/comments/p9cn0l/if_you_are_an_unattractive_person_how_are_you/",
  "subreddit": "NoStupidQuestions",
  "id": "p9cn0l",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Let's not beat around the bush here, people can say beauty is in the eye of the\nbeholder or whatever, but the overwhelming amount of evidence we have says that\nbeauty and who someone will date is pretty predictable, and that attractiveness\nhas some objective elements to it. If someone is on a scale…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "誤解を恐れずに言えば、「美しさは見る人の目の中にある」などと言われることもありますが\nしかし、圧倒的な証拠によると、美しさと誰がデートするかはかなり予測可能であり\n美しさと誰と付き合うかは、かなり予測可能であり、魅力的であることは\n魅力には客観的な要素があります。もし誰かのスケールが...",
      "title": "もしあなたが魅力的でない人だったら、「惹かれる人を選ぶことはできない」と「基準を下げる」の間をどうやって折り合いをつければいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "让我们不要在这里绕弯子，人们可以说美是在眼睛里的\n但我们有大量的证据表明，美貌和一个人的约会对象是可以预测的。\n美貌和某人将与谁约会是相当可预测的，而且吸引力\n有一些客观因素。如果一个人在一个尺度上...",
      "title": "如果你是一个没有吸引力的人，你应该如何在 \"你不能选择你所吸引的人 \"和 \"降低你的标准 \"之间进行调和？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "讓我們不要在這裏繞彎子，人們可以說美是在眼睛裏的\n但我們有大量的證據表明，美貌和一個人的約會對象是可以預測的。\n美貌和某人將與誰約會是相當可預測的，而且吸引力\n有一些客觀因素。如果一個人在一個尺度上...",
      "title": "如果你是一個沒有吸引力的人，你應該如何在 \"你不能選擇你所吸引的人 \"和 \"降低你的標準 \"之間進行調和？"
    }
  ]
}