{
  "author": "Chicky_Nuggy",
  "original_created_utc": 1638962364,
  "title": "47.9% of people believe that cryptocurrencies are not a safe investment",
  "created_utc": 1638970560,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Overall, nearly half (47.9%) of people believe that cryptocurrencies are not a safe investment, and a further 37.1% are unsure about the safety of investing in cryptos.   &lt;/p&gt;\n\n&lt;p&gt;Just 13.8% of people regard cryptocurrencies as a safe investment product.&lt;/p&gt;\n\n&lt;p&gt;When the data is split by age, it’s clear that it’s mainly young adults who feel that cryptos are a safe investment. Almost a third (27.5%) of those aged between 18 and 34 feel their money is safe when investing in cryptocurrencies, and this figure drops significantly within the older age groups.  &lt;/p&gt;\n\n&lt;p&gt;Just 9.7% of adults aged 35 and over view cryptocurrencies as a safe investment, and the figure drops substantially to just 2.9%  when we look at those aged 45 and above.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;People’s attitudes towards the safety of cryptos as an investment, by age&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/fpa52nxcya481.png?width=2436&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=b76b11fa47b92a0e5aed71f66d0b6b51f4dddca8\"&gt;https://preview.redd.it/fpa52nxcya481.png?width=2436&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=b76b11fa47b92a0e5aed71f66d0b6b51f4dddca8&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;The original cryptocurrency, Bitcoin, originated in 2009, making the whole concept of online currency a relatively recent invention. Given that it’s only been around for a decade it’s not surprising that younger people are more at ease with the concept as they have grown up with it. However for older generations there is significantly less trust in something that they still regard as a new development.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Cryptocurrencies form a part of wider investment strategies&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;As cryptocurrencies become more and more mainstream, many people are starting to include cryptos as part of their wider investment strategies.  &lt;/p&gt;\n\n&lt;p&gt;Out of those who have invested in cryptocurrencies, a large percentage (85.7%) also have other investments and savings.&lt;/p&gt;\n\n&lt;p&gt;This trend is the same across every age group, however, the percentage of people who only have cryptocurrencies, and no other investments, does increase slightly with age.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Percentage of those who do not have any investments other than cryptocurrencies, by age&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/8knwpwpjya481.png?width=1908&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=39b5c6720f7b13704e7f474eafa436133670c8de\"&gt;https://preview.redd.it/8knwpwpjya481.png?width=1908&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=39b5c6720f7b13704e7f474eafa436133670c8de&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Only half of crypto investors are getting financial advice&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Although cryptocurrencies are volatile and can see people lose their whole investment in a short space of time, only half (56.1%) of investors received professional financial advice before buying cryptos.&lt;/p&gt;\n\n&lt;p&gt;But, what’s surprising is that it’s actually the younger age groups who are more likely to take the additional step of getting advice before investing.&lt;/p&gt;\n\n&lt;p&gt;Over two thirds (65%) of 18-24 year olds got financial advice before making their investment, and this percentage decreases gradually with age.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Percentage of those who received professional financial advice before investing, by age&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/0hwekkdrya481.png?width=1918&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=43aba30be813833e86a829c6a1d21080e2c236b5\"&gt;It is positive to see that so many young adults are taking their finances seriously and getting proper advice before making investments.&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;All figures, unless otherwise stated, are from a survey conducted with The Leadership Factor. The total sample size was 2,000. Fieldwork was undertaken between 9th September 2021 and 15th September 2021. The survey was carried out online.&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 358,
  "permalink": "/r/CryptoCurrency/comments/rbp5ri/479_of_people_believe_that_cryptocurrencies_are/",
  "subreddit": "CryptoCurrency",
  "id": "rbp5ri",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Overall, nearly half (47.9%) of people believe that cryptocurrencies are not a\nsafe investment, and a further 37.1% are unsure about the safety of investing in\ncryptos.   \n\nJust 13.8% of people regard cryptocurrencies as a safe investment product.\n\nWhen the data is split by age, it’s clear that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "全体として、半数近く（47.9％）の人が「暗号通貨は使えない」と考えている。\nまた、37.1％の人が「安全な投資かどうかわからない」と回答しています。\nクリプト   \n\n暗号通貨を安全な投資商品と見なしている人は、わずか13.8％です。\n\nデータを年齢別に分けると、明らかに...",
      "title": "47.9%の人が「暗号通貨は安全な投資ではない」と考えています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "总体而言，近一半（47.9%）的人认为，加密货币不是一种\n的安全投资，还有37.1%的人不确定投资加密货币的安全性。\n加密货币的安全性。  \n\n只有13.8%的人认为加密货币是一种安全的投资产品。\n\n当数据按年龄划分时，很明显，...",
      "title": "47.9%的人认为加密货币不是一项安全的投资"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "總體而言，近一半（47.9%）的人認爲，加密貨幣不是一種\n的安全投資，還有37.1%的人不確定投資加密貨幣的安全性。\n加密貨幣的安全性。  \n\n只有13.8%的人認爲加密貨幣是一種安全的投資產品。\n\n當數據按年齡劃分時，很明顯，...",
      "title": "47.9%的人認爲加密貨幣不是一項安全的投資"
    }
  ]
}