{
  "author": "kissing_the_beehive",
  "the_new_excerpt": "This is something I recently learned through trial and error, so figured I'd\nshare what I found to be the best and easiest process. Disclaimer: there are\nmany different wallets and marketplaces, this is just what worked for me. I have\nno affiliation with any of these companies beyond being a user.\n\n…",
  "original_created_utc": 1616169137,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这是我最近通过试验和错误了解到的，所以我想我会\n分享我觉得最好最简单的过程。声明：有\n许多不同的钱包和市场，这只是对我来说是什么工作。我有\n除了作为用户之外，与这些公司没有任何关系。\n\n…",
      "title": "创建和上市NFT的快速入门指南"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是我最近通過試驗和錯誤瞭解到的，所以我想我會\n分享我覺得最好最簡單的過程。聲明：有\n許多不同的錢包和市場，這只是對我來說是什麼工作。我有\n除了作爲用戶之外，與這些公司沒有任何關係。\n\n…",
      "title": "創建和上市NFT的快速入門指南"
    }
  ],
  "title": "Quick Beginner's Guide for Creating and Listing NFTs",
  "created_utc": 1616211885,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is something I recently learned through trial and error, so figured I&#39;d share what I found to be the best and easiest process. Disclaimer: there are many different wallets and marketplaces, this is just what worked for me. I have no affiliation with any of these companies beyond being a user.</p>\n\n<ol>\n<li><strong>Create a free web3 crypto wallet.</strong> There are many out there and for these purposes web3 = integrated with your web browser. I use MetaMask.</li>\n<li><strong>Set up your wallet, connect to your browser</strong>. Create a password, store your recovery phrase somewhere, etc. If you use MetaMask, you can manage it as an extension in Chrome, Brave, etc.</li>\n<li><strong>Join a marketplace.</strong> I use Mintable because there are no gas fees. I first tried Rarible which charged about $7 USD to mint an NFT. For this reason, I think Mintable is best for beginners.</li>\n<li><strong>Connect your wallet to the marketplace.</strong> Simple click and accept within your browser.</li>\n<li><strong>List an item and mint your NFT.</strong> Listing creation is similar to eBay and Facebook MP - just add a title, description, category, and upload your file. When you post, you will sign within your wallet to authorize the blockchain transaction and an NFT is born!</li>\n</ol>\n\n<p>Hope this helpful. For those already selling NFTs, let us know what&#39;s working well for you.</p>\n</div><!-- SC_ON -->",
  "score": 192,
  "permalink": "/r/CryptoCurrency/comments/m8k8ug/quick_beginners_guide_for_creating_and_listing/",
  "subreddit": "CryptoCurrency",
  "id": "m8k8ug",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752815287
}