{
  "author": "throw_away1301413",
  "original_created_utc": 1656352539,
  "title": "Should straight people attend pride parades?",
  "created_utc": 1656367217,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I recently got into a heated argument with someone (bisexual cis female) who stated I (straight cis male) should not attend pride because I would be invading a gay space.&lt;/p&gt;\n\n&lt;p&gt;I have heard and agree with the argument around gay bars, as that is a social gathering and straight people can make it an unsafe gay space with their presence, but I simply wanted to attend the pride parade to show support and see the floats.&lt;/p&gt;\n\n&lt;p&gt;If I being a bad ally by going to the parade, can someone tell me? I feel like an asshole but I also argued with her and she said it’s borderline homophobic to not support her opinion and i wasn’t allowed to have one on the topic?&lt;/p&gt;\n\n&lt;p&gt;I am coming from a place of ignorance, im sorry if i’m offending anyone with the question.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 111,
  "permalink": "/r/TooAfraidToAsk/comments/vm1jwo/should_straight_people_attend_pride_parades/",
  "subreddit": "TooAfraidToAsk",
  "id": "vm1jwo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I recently got into a heated argument with someone (bisexual cis female) who\nstated I (straight cis male) should not attend pride because I would be invading\na gay space.\n\nI have heard and agree with the argument around gay bars, as that is a social\ngathering and straight people can make it an…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、ある人（バイセクシュアル・シス・女性）と激しい口論になり\nというのも、ゲイの空間に侵入することになるからです。\nを侵すことになるから。\n\n私は、ゲイバーでの議論を聞いたことがあり、同意します。\nというのも、ゲイバーは社交場であり、ストレートの人たちはそれを...",
      "title": "プライドパレードにストレートの人は参加すべき？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近和一个人（双性恋的阴性女性）发生了激烈的争吵，他说\n他说我（直男）不应该参加骄傲节，因为我将会侵犯\n同性恋空间。\n\n我听说过并同意关于同性恋酒吧的争论，因为那是一个社交聚会。\n因为那是一个社交聚会，直人可以把它作为一个社交场所。",
      "title": "异性恋者应该参加自豪游行吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近和一個人（雙性戀的陰性女性）發生了激烈的爭吵，他說\n他說我（直男）不應該參加驕傲節，因爲我將會侵犯\n同性戀空間。\n\n我聽說過並同意關於同性戀酒吧的爭論，因爲那是一個社交聚會。\n因爲那是一個社交聚會，直人可以把它作爲一個社交場所。",
      "title": "異性戀者應該參加自豪遊行嗎？"
    }
  ]
}