{
  "author": "rtowne",
  "original_created_utc": 1642952854,
  "title": "Is \"ethnic\" code for non-white? Saw my local store has an ethnic hair section and that seems weird to have as separate in 2022.",
  "created_utc": 1642967474,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In a 95% white community. My understanding is that ethnicities are usually broken down as white, black, asian, latino, and native American. If there is a section of products means for black hair why not say black hair instead of ethnic? Or better yet, why not just call it hair and put all the products together and just sort by hair type like straight, wavy, curly, textured, etc?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 110,
  "permalink": "/r/NoStupidQuestions/comments/sawgk5/is_ethnic_code_for_nonwhite_saw_my_local_store/",
  "subreddit": "NoStupidQuestions",
  "id": "sawgk5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In a 95% white community. My understanding is that ethnicities are usually\nbroken down as white, black, asian, latino, and native American. If there is a\nsection of products means for black hair why not say black hair instead of\nethnic? Or better yet, why not just call it hair and put all the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "95％が白人のコミュニティで 私の理解では、民族は通常\n白人、黒人、アジア人、ラテンアメリカ人、ネイティブ・アメリカンに分けられる。もし、その中に\n黒髪用製品のセクションで、なぜ黒髪と言わないのか？\nエスニック？というか、なぜヘアと呼ばず、すべて...",
      "title": "エスニック」は非白人の意味？私の地元の店にはエスニックヘアーのコーナーがあるのですが、2022年にそれが別にあるのはおかしいと思いました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在一个95%的白人社区。我的理解是，种族通常是指\n归类为白人、黑人、亚洲人、拉美人和美国本土人。如果有一个\n产品的一部分，为什么不说黑发而说\n族裔？或者更好的是，为什么不直接叫它头发，而把所有的...",
      "title": "种族 \"是指非白人吗？我看到我的当地商店有一个民族发型区，这似乎很奇怪，在2022年有一个单独的部分。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在一個95%的白人社區。我的理解是，種族通常是指\n歸類爲白人、黑人、亞洲人、拉美人和美國本土人。如果有一個\n產品的一部分，爲什麼不說黑髮而說\n族裔？或者更好的是，爲什麼不直接叫它頭髮，而把所有的...",
      "title": "種族 \"是指非白人嗎？我看到我的當地商店有一個民族髮型區，這似乎很奇怪，在2022年有一個單獨的部分。"
    }
  ]
}