{
  "author": "Lukeract",
  "original_created_utc": 1637471794,
  "title": "Did parents send their children to orphanages often in the 50s?",
  "created_utc": 1637553098,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is probably a weird question, but both of my grandfathers, with all of their brothers, were sent to an orphanage around 6-8 years old while the girls stayed. They were allowed to return to their houses when they were old enough to work, both of them ended up abusive and emotionally unstable. This is a very strange co-occurance, and I wonder if this was a common or uncommon occurance then. And besides the fact that my great grandfathers were kind of awful.</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/TrueAskReddit/comments/qyntlu/did_parents_send_their_children_to_orphanages/",
  "subreddit": "TrueAskReddit",
  "id": "qyntlu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is probably a weird question, but both of my grandfathers, with all of\ntheir brothers, were sent to an orphanage around 6-8 years old while the girls\nstayed. They were allowed to return to their houses when they were old enough to\nwork, both of them ended up abusive and emotionally unstable.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "変な質問かもしれませんが、私の両方の祖父は、すべての\n6～8歳の頃に孤児院に送られましたが、女の子はそのままでした。\n残っていました。働ける年齢になると家に戻ることが許されました。\n働ける年齢になると家に戻されたのですが、二人とも虐待を受けて情緒不安定になってしまいました....",
      "title": "50年代は親が子供を孤児院に送ることが多かったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这可能是一个奇怪的问题，但我的两个祖父，以及他们所有的兄弟，都被送到附近的孤儿院。\n他们的兄弟在6-8岁左右被送到孤儿院，而女孩们则留在那里。\n留了下来。当他们到了可以工作的年龄时，他们被允许回到自己的家里。\n工作时，他们都被允许回到自己的家里，但他们最后都被虐待了，而且情绪不稳定....。",
      "title": "在50年代，父母是否经常将他们的孩子送到孤儿院？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這可能是一個奇怪的問題，但我的兩個祖父，以及他們所有的兄弟，都被送到附近的孤兒院。\n他們的兄弟在6-8歲左右被送到孤兒院，而女孩們則留在那裏。\n留了下來。當他們到了可以工作的年齡時，他們被允許回到自己的家裏。\n工作時，他們都被允許回到自己的家裏，但他們最後都被虐待了，而且情緒不穩定....。",
      "title": "在50年代，父母是否經常將他們的孩子送到孤兒院？"
    }
  ]
}