{
  "author": "AXdssd5as",
  "the_new_excerpt": "I was wondering what Jack Bogle specifically recommended in terms of bond types.\nI know he was in favor of not less than 25% of your portfolio in bonds, and\nusually kept something 50% of his in bonds, but what did he actually think about\nan aggregate bond index/ETF like BND? Did he support it, or…",
  "original_created_utc": 1623579511,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ジャック・ボーグルが具体的にどのような債券の種類を推奨しているのか気になりました。\n彼がポートフォリオの25％以上を債券にすることを支持していたことは知っています。\nしかし、BNDのような総合的な債券インデックス/ETFについてはどう思われましたか？\nしかし、BNDのような総合的な債券インデックス/ETFについてはどう思われますか？彼はそれを支持していたのでしょうか、それとも...。",
      "title": "ジャック・ボーグルは、アグリゲート・ボンド・ファンドを推奨していたのでしょうか、それとも単に債券全般を保有することを推奨していたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想知道在债券类型方面，杰克-博格尔具体推荐什么。\n我知道他赞成在你的投资组合中不少于25%的债券，并且\n他通常把50%的资金放在债券上，但他究竟是怎么想的呢？\n像BND这样的综合债券指数/ETF？他是否支持它，或者...",
      "title": "杰克-博格尔推荐的是综合债券基金，还是只持有一般的债券？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想知道在債券類型方面，傑克-博格爾具體推薦什麼。\n我知道他贊成在你的投資組合中不少於25%的債券，並且\n他通常把50%的資金放在債券上，但他究竟是怎麼想的呢？\n像BND這樣的綜合債券指數/ETF？他是否支持它，或者...",
      "title": "傑克-博格爾推薦的是綜合債券基金，還是隻持有一般的債券？"
    }
  ],
  "title": "Did Jack Bogle recommend an aggregate bond fund, or just to hold bonds in general?",
  "created_utc": 1623601429,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was wondering what Jack Bogle specifically recommended in terms of bond types. I know he was in favor of not less than 25% of your portfolio in bonds, and usually kept something 50% of his in bonds, but what did he actually think about an aggregate bond index/ETF like BND? Did he support it, or did he give some other advice about what bonds to hold and why?</p>\n</div><!-- SC_ON -->",
  "score": 68,
  "permalink": "/r/Bogleheads/comments/nytcq1/did_jack_bogle_recommend_an_aggregate_bond_fund/",
  "subreddit": "Bogleheads",
  "id": "nytcq1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009741228
}