{
  "author": "Biden2016",
  "original_created_utc": 1630101656,
  "title": "As a liege lord why would I wall in my daughter in my own castle",
  "created_utc": 1630146970,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Having visited two castles in Italy and Denmark, I was struck by two remarkably similar stories spanning a century and across europe. A young beautiful wilful daughter of the regional strongman refuses a politically arranged marriage. For she is in love with the stable boy and perhaps pregnant.</p>\n\n<p>When discovering the young couple, the father is blinded by rage and kills the stable boy. So far none of the actions or motivations seems too out of character for medieval europe. But what is the motivation for what the father does next?</p>\n\n<p>The daughter is walled up in the castle right next to the living quarters, in a small enclosure. Over the next couple of days she dies amidst screams of panic, desperation and agony heard throughout the castle. One can only imagine. A punishment so severe that it is remembered 400 years later as a primary entry in the castle history and in both cases form the basis of ghost stories.</p>\n\n<p>BUT the punishment is not only sentencing your own daughter to one of the worst possible ways to die. It is also an extreme self-inflicting punishment. I cannot imagine a worse fate than hearing my child die inside the walls and be able to do nothing. Whereafter I would have to spend the rest of my life living right next to the remains, to the memories of screaming and the burial place.</p>\n\n<p>The sad, disturbing resting places of Celestine (Dragsholm castle, died 1540) and Bianca Malaspina (Malaspina castle, died mid 17th century) have both been found during renovation projects, so the stories are obviously not made up.</p>\n\n<p>Since this is not an isolated story of a lone mad man, but repeated throughout Europe. What is the primary motivation for such an extreme display of power and cruelty? Why does it seem so designed to inflict pain on the household and myself?</p>\n\n<p>I can only guess.</p>\n\n<ul>\n<li>Statuary example for the household and region</li>\n<li>Showing no-ill for an broken arranged marriage/alliance</li>\n<li>Law, Tradition, Religion</li>\n<li>Breaking the defiance of a daughter (Particular a woman)</li>\n<li>Medieval carelessness of human lives, though in this case your own children, you have seen growing up.</li>\n<li>Rage / embarrassment</li>\n</ul>\n\n<p>The castles themselves provide very little background information, and it seems as speculative as my guesses. So I was hoping for a more in-depth answer of medieval psychology. Why would I do such a thing?</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/pcx5fr/as_a_liege_lord_why_would_i_wall_in_my_daughter/",
  "subreddit": "AskHistorians",
  "id": "pcx5fr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Having visited two castles in Italy and Denmark, I was struck by two remarkably\nsimilar stories spanning a century and across europe. A young beautiful wilful\ndaughter of the regional strongman refuses a politically arranged marriage. For\nshe is in love with the stable boy and perhaps…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "イタリアとデンマークの2つの城を訪れた私は、世紀を超えてヨーロッパを横断する2つの驚くほど似通った\n100年以上の時を経て、ヨーロッパを横断する、驚くほど似通った2つの物語に感動しました。地方の有力者の若く美しい意志の強い娘が\n地域の有力者の娘が、政治的に決められた結婚を拒否します。それは\n彼女は馬小屋の少年に恋をしており、おそらく...",
      "title": "領主として、なぜ娘を自分の城に囲い込むのか"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在参观了意大利和丹麦的两座城堡后，我被两个非常相似的故事所震撼。\n惊人的相似故事，跨越一个世纪，横跨欧洲。一个年轻美丽而任性的\n的女儿拒绝了政治上安排的婚姻。因为\n她爱上了马厩里的男孩，也许...",
      "title": "作为一个领主，我为什么要把我的女儿关在自己的城堡里？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在參觀了意大利和丹麥的兩座城堡後，我被兩個非常相似的故事所震撼。\n驚人的相似故事，跨越一個世紀，橫跨歐洲。一個年輕美麗而任性的\n的女兒拒絕了政治上安排的婚姻。因爲\n她愛上了馬廄裏的男孩，也許...",
      "title": "作爲一個領主，我爲什麼要把我的女兒關在自己的城堡裏？"
    }
  ]
}