{
  "author": "AskScienceModerator",
  "original_created_utc": 1647860461,
  "title": "AskScience AMA Series: We've discovered that pancreatic cancer is detectable based on microbes in stool, with the potential for earlier screening in the future. AUA!",
  "created_utc": 1647864724,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi Reddit! We are Ece Kartal (&lt;a href=\"/u/psecekartal\"&gt;u/psecekartal&lt;/a&gt;), Sebastian Schmidt (&lt;a href=\"/u/TSBSchm\"&gt;u/TSBSchm&lt;/a&gt;) and Esther Molina-Montes (&lt;a href=\"/u/memmontes\"&gt;u/memmontes&lt;/a&gt;). We are lead authors on a recently published study showing that non-invasive (and early) detection of pancreatic cancer may be possible using stool samples. Ask Us Anything!&lt;/p&gt;\n\n&lt;p&gt;Pancreatic cancer is a horrible disease: although few people develop this form of cancer, only around 1 in 20 patients survive for 5 years or longer after diagnosis. This is in part due to late detection: symptoms are unspecific and often occur only when the disease has already progressed to advanced stages, so that diagnosis if often too late for therapeutic intervention (surgery and/or chemotherapy). This makes the earlier detection of pancreatic cancer an important goal in mitigating the disease, yet no approved non-invasive or minimally invasive, inexpensive tests currently exist.&lt;/p&gt;\n\n&lt;p&gt;We studied a Spanish population of patients diagnosed with pancreatic ductal adenocarcinoma (PDAC, the most common form of pancreatic cancer) and clinically matched controls that were either pancreas-healthy or suffered from chronic pancreatitis (inflammation of the pancreas, an important risk factor for the development for PDAC). We found that a set of 27 microbial species detected in feces provide a very specific signature for PDAC patients, even in early stages. When combined with a blood serum-based cancer progression (not diagnostic) marker, prediction accuracy increased even further. We confirmed this finding in an independent German cohort, and also made sure that this microbiome signature did not falsely predict PDAC among thousands of subjects that were either healthy or suffered from other diseases. Moreover, we were able to trace some of these signature microbes between mouth, pancreatic healthy tissue, pancreatic tumors, and the gut which suggests that they may be more than just indicators.&lt;/p&gt;\n\n&lt;p&gt;Our study is freely available online in the journal GUT (Kartal, Schmidt, Molina-Montes, et al; 2022): &lt;a href=\"https://gut.bmj.com/content/early/2022/01/26/gutjnl-2021-324755\"&gt;https://gut.bmj.com/content/early/2022/01/26/gutjnl-2021-324755&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;A commentary by R. Newsome and C. Jobin in the same issue puts our work into context: &lt;a href=\"https://gut.bmj.com/content/early/2022/02/21/gutjnl-2021-326710\"&gt;https://gut.bmj.com/content/early/2022/02/21/gutjnl-2021-326710&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;For less formal introductions, check the press releases by one of our funding bodies (&lt;a href=\"https://www.worldwidecancerresearch.org/news-opinion/2022/march/microorganisms-in-stool-samples-could-offer-new-way-to-detect-pancreatic-cancer-early/\"&gt;Worldwide Cancer Research&lt;/a&gt;) or the lead institutions &lt;a href=\"https://www.embl.org/news/science/an-international-study-proposes-stool-analysis-for-early-detection-of-pancreatic-cancer/\"&gt;EMBL Heidelberg, Germany&lt;/a&gt; and &lt;a href=\"https://www.cnio.es/noticias/una-colaboracion-internacional-propone-un-analisis-de-heces-para-la-deteccion-temprana-del-cancer-de-pancreas/\"&gt;CNIO Madrid, Spain (text in Spanish)&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;Our work is an early proof of principle and will need to be further validated on larger and independent cohorts. Yet our findings hold some promise for a future inexpensive, non-invasive screening method for pancreatic cancer. Such a screen could initially target risk groups, e.g. above a certain age or with a family history of PDAC. Ideally, with further development and in combination with other biomarkers, our approach might be developed into an actionable diagnosis method in the future. That said, none of us is a medical doctor; we cannot and will not provide any medical advice, and none of what we post here should be construed as such.&lt;/p&gt;\n\n&lt;p&gt;We will be on at Noon Eastern (16 UT), and are looking forward to your questions, AUA!&lt;/p&gt;\n\n&lt;p&gt;Who we are:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Dr. Ece Kartal (&lt;a href=\"/u/psecekartal\"&gt;u/psecekartal&lt;/a&gt;, Twitter: &lt;a href=\"https://twitter.com/ps_ecekartal\"&gt;@ps_ecekartal&lt;/a&gt;) is a former PhD student at the European Molecular Biology Laboratory (EMBL) in Heidelberg, Germany and currently a postdoctoral researcher at the University of Heidelberg.&lt;/li&gt;\n&lt;li&gt;Dr. (Thomas) Sebastian Schmidt (&lt;a href=\"/u/TSBSchm\"&gt;u/TSBSchm&lt;/a&gt;, Twitter: &lt;a href=\"https://twitter.com/TSBSchm\"&gt;@TSBSchm&lt;/a&gt;) is a research scientist at the EMBL in Heidelberg.&lt;/li&gt;\n&lt;li&gt;Dr. Esther Molina-Montes (&lt;a href=\"/u/memmontes\"&gt;u/memmontes&lt;/a&gt;) is a former postdoctoral researcher at the Spanish National Cancer Research Center (CNIO) in Madrid, Spain and currently an Assistant Professor at the University of Granada, Spain.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/askscience/comments/tj95w3/askscience_ama_series_weve_discovered_that/",
  "subreddit": "askscience",
  "id": "tj95w3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hi Reddit! We are Ece Kartal (u/psecekartal [/u/psecekartal]), Sebastian Schmidt\n(u/TSBSchm [/u/TSBSchm]) and Esther Molina-Montes (u/memmontes [/u/memmontes]).\nWe are lead authors on a recently published study showing that non-invasive (and\nearly) detection of pancreatic cancer may be possible…"
}