{
  "author": "Techvarius",
  "original_created_utc": 1639672584,
  "title": "Paying millions for \"digital lands\" in a PC game similar to Minecraft will be remembered as one of the most dumbass investment decisions in the history.",
  "created_utc": 1639705216,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I mean this games can be somehow related to metaverse but they aren&amp;#39;t even part of it. You are being tricked to spend your fiat to nonsense called digital land in a centralized laggy game full of bugs because of the hype triggered by Facebook.  I don&amp;#39;t try to lecturing me that years before there were people thinking about bitcoin, ethereum etc same way, digital lands in a centralized copycat of the Minecraft has no benefit and real use case at all. No seriously, I can understand whales and big investors throwing money left and right as gambling, but seeing average joe spending 60% of portfolio into game tokens hoping to drive a lambo after few years drives me mad.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 204,
  "permalink": "/r/CryptoCurrency/comments/rhugph/paying_millions_for_digital_lands_in_a_pc_game/",
  "subreddit": "CryptoCurrency",
  "id": "rhugph",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I mean this games can be somehow related to metaverse but they aren't even part\nof it. You are being tricked to spend your fiat to nonsense called digital land\nin a centralized laggy game full of bugs because of the hype triggered by\nFacebook. I don't try to lecturing me that years before there…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "つまり、このゲームはメタバースと何らかの関係があっても、その一部ですらないのです。\nのです。あなたは、デジタルランドと呼ばれる無意味なものにフィアットを使うよう、だまされているのです。\nによって引き起こされた誇大広告のために、バグだらけの中央集権的なラグゲームの中で\nフェイスブック その何年か前に...」と説教するつもりはない。",
      "title": "Minecraftに似たPCゲームの「デジタルランド」のために何百万も支払うことは、歴史上最も愚かな投資判断の一つとして記憶されるだろう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的意思是，这些游戏可能与元老会有某种联系，但它们甚至不是元老会的一部分。\n它的一部分。你被骗了，把你的法币花在所谓的数字土地上。\n在一个充满错误的集中式滞后游戏中，因为Facebook的炒作而引发的\n脸书。我不会试图对我说，在那之前的几年里...",
      "title": "为类似于《Minecraft》的PC游戏中的 \"数字土地 \"支付数百万美元，将作为历史上最愚蠢的投资决定之一被记住。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的意思是，這些遊戲可能與元老會有某種聯繫，但它們甚至不是元老會的一部分。\n它的一部分。你被騙了，把你的法幣花在所謂的數字土地上。\n在一個充滿錯誤的集中式滯後遊戲中，因爲Facebook的炒作而引發的\n臉書。我不會試圖對我說，在那之前的幾年裏...",
      "title": "爲類似於《Minecraft》的PC遊戲中的 \"數字土地 \"支付數百萬美元，將作爲歷史上最愚蠢的投資決定之一被記住。"
    }
  ]
}