{
  "author": "fraqaq",
  "the_new_excerpt": "He’s in the Nic Carter Twitter chat room right now!!! And they’re about to pass\nthe bill any minute!!\n\nWill update, developing story….\n\nEdit 1: 100% chance it will pass they have 64 out of 84 votes\n\nEdit 2: Bill will go into full effect in 90 days\n\nEdit 3: “Every business must accept Bitcoin” -…",
  "original_created_utc": 1623214183,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "彼は今、Nic CarterのTwitterのチャットルームにいます!!! そして彼らは今にも法案を通過させようとしている\n今にも法案が可決されそうです!!!\n\n更新します、発展途上の話です....\n\n編集1：100％の確率で法案は可決されます。\n\n編集2：法案は90日後に完全施行される\n\n編集3：「すべてのビジネスはビットコインを受け入れなければならない」 -...",
      "title": "エルサルバドルの大統領は、米国政府とIMFがビットコインの法定通貨化について接触してきたことを確認したばかりです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "他现在就在尼克-卡特的推特聊天室里！！。而且他们即将通过\n法案的任何一分钟！!\n\n将更新，发展中的故事....\n\n编辑1：100%会通过，他们有84票中的64票\n\n编辑2：法案将在90天内全面生效\n\n编辑3: \"每个企业必须接受比特币\" -...",
      "title": "萨尔瓦多总统刚刚证实，美国政府和国际货币基金组织已经与他联系，讨论让比特币成为法定货币的问题"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "他現在就在尼克-卡特的推特聊天室裏！！。而且他們即將通過\n法案的任何一分鐘！!\n\n將更新，發展中的故事....\n\n編輯1：100%會通過，他們有84票中的64票\n\n編輯2：法案將在90天內全面生效\n\n編輯3: \"每個企業必須接受比特幣\" -...",
      "title": "薩爾瓦多總統剛剛證實，美國政府和國際貨幣基金組織已經與他聯繫，討論讓比特幣成爲法定貨幣的問題"
    }
  ],
  "title": "The president of El Salvador just confirmed that the United States Government and the IMF have contacted him about making Bitcoin legal tender!",
  "created_utc": 1623228249,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>He’s in the Nic Carter Twitter chat room right now!!! And they’re about to pass the bill any minute!!</p>\n\n<p>Will update, developing story….</p>\n\n<p>Edit 1: 100% chance it will pass they have 64 out of 84 votes</p>\n\n<p>Edit 2: Bill will go into full effect in 90 days</p>\n\n<p>Edit 3: “Every business must accept Bitcoin” - President</p>\n\n<p>Edit 4: “we want people to get familiar with bitcoin as a unit of account, 1 bitcoin=1 bitcoin” (in order to establish residency, need to invest 3 bitcoins into El Salvador, regardless of US dollar value)</p>\n\n<p>Edit 5:  The president is meeting with IMF on Thursday.</p>\n\n<p>Edit 6: “We adopted the dollar in 2001 for investment reasons, we’re doing that on steroids with Bitcoin”</p>\n\n<p>Edit 7: “This is one of the things, that we all have to get behind, for the future of humanity, this is a game changer for the world, people might laugh about the size of our country, it doesn’t matter, we’re dreaming for the future”</p>\n\n<p>Edit 8: “You can use any wallet you want” there will be a government wallet/app developed by strike but not required. It will be as free as it gets.</p>\n\n<p>Edit 9: Jack Dorsey CEO of Twitter and Square has entered the room!!</p>\n\n<p>Edit 10: The dollars come to El Salvador from the Fed. The convertibility of dollars into bitcoin will be handled by the El Salvador government  fund. El Salvador will buy the bitcoins from those who don’t want to take the volatility risk. Government will absorb the risk and hold the bitcoin.</p>\n\n<p>Edit 11: Government of El Salvador uses lots of geothermal energy. They lose energy by transporting that energy to cities. They want to promote mining bitcoin with the renewable geothermal energy to reduce loss of energy and create monetary value. HUGE! HE GETS IT!</p>\n\n<p>Edit 12: “I’m going to focus on making this succeed, that will create a domino effect”</p>\n\n<p>Edit 13: Mark Cuban not allowed to speak</p>\n\n<p>Edit 14: CHEERS THE BILL HAS PASSED!!!!</p>\n\n<p>Edit 15: $150,000,000 Bitcoin will be held in the trust fund</p>\n\n<p>Edit 16: THIS WILL ONLY BE BITCOIN, NO ALT-COINS</p>\n\n<p>Edit 17: El Salvador trending on Twitter, lots of headline names in the chat. Eric weinstein (Thiel Capital), mark Cuban, Charlie Lee, Tom Anderson (MySpace), jack dorsey, ambassadors to nations.</p>\n\n<p>Edit 18: The presidents brother is almost in tears. “People on the floor are clapping, this is hope for our country, our country needed this”</p>\n</div><!-- SC_ON -->",
  "score": 1105,
  "permalink": "/r/Bitcoin/comments/nvnj35/the_president_of_el_salvador_just_confirmed_that/",
  "subreddit": "Bitcoin",
  "id": "nvnj35",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404878625
}