{
  "author": "xcryptogurux",
  "original_created_utc": 1627721866,
  "title": "Bitcoin critic Elizabeth Warren is a virtue-signaling political chameleon and a barefaced hypocrite",
  "created_utc": 1627734954,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Every single line of Bitcoin code written by &quot;shadowy super coders&quot;, who contribute their precious time and inspired efforts voluntarily without a guaranteed salary, is open for the whole world to access, scrutinize and propose changes to.</p>\n\n<p>However, whose tax dollars keep paying for champagne tree-hugger Elizabeth Warren&#39;s shadowy private jet excursions remains shrouded in mystery.</p>\n\n<p><a href=\"https://i.redd.it/4kisp696gie71.gif\">Warren hides behind staffer after being caught on camera getting off a private jet</a></p>\n\n<p>Now if we were to pay our taxes in Bitcoin, through a public blockchain, we would be able to tell exactly whose tax money is paying for Warren&#39;s climate-destroying charter flights.</p>\n\n<p><a href=\"https://preview.redd.it/tp0rwr4agie71.jpg?width=850&amp;format=pjpg&amp;auto=webp&amp;s=530d6c2016989c5bb0448be2dde65e1ca3ef7486\">Corrupt politicians? Bitcoin fixes this.</a></p>\n\n<p>Warren grew up a dyed-in-the-wool Republican. She was registered as a Republican until 1996. Sure, people are allowed to change their minds, even at 50, or perhaps, she recognized that she&#39;d have more political attention and a better political career by preying on populist working-class sensibilities.</p>\n\n<p>Throughout her political career, Warren has been funded primarily by big tech, owned by billionaires and beneficiaries of the banking system she continually purports to rail against, although curiously, you will find, to little ultimate effect.</p>\n\n<p>During her 2020 presidential campaign, Warren vowed to shun high-dollar fundraising events after transferring $10 million in high-dollar contributions from her 2018 Senate campaign to fund her presidential campaign. She also reversed her position on rejecting super PAC support after realizing that it was hurting her campaign.</p>\n\n<p>The Bitcoin code enables humanity to take our economic fate away from the hands of a powerful few and leverage blockchain as an open, trustless, permissionless, decentralized monetary network to democratically create, distribute and exchange value.</p>\n\n<p>Bitcoin liberates every man from other men.</p>\n\n<p>If Warren had a legitimate interest, as she claims, in dismantling a system that consolidates wealth and power in the hands of a few, she&#39;d be all over Bitcoin.</p>\n\n<p>But it&#39;s all pretentious parasitism. A ruthless Janus-faced ruse to raise political support from the majority by feigning support for their cause, all the while aided and abetted by the powerful few.</p>\n\n<p>The carefully crafted perception that Warren fights for the common man allows her a position of authority she exploits to keep the common man intellectually and rationally credulous to disinformation, furthering furtively the interests of the beneficiaries of the fiat pyramid scheme.</p>\n\n<p><a href=\"https://preview.redd.it/4d6ieikegie71.jpg?width=2048&amp;format=pjpg&amp;auto=webp&amp;s=7d04e9afa6008034efb5fe5b4e207f7a5e1dc987\">Whose hands do we entrust with the fate of our financial system? (H/T Lina Seiche)</a></p>\n</div><!-- SC_ON -->",
  "score": 178,
  "permalink": "/r/CryptoCurrency/comments/ov3uli/bitcoin_critic_elizabeth_warren_is_a/",
  "subreddit": "CryptoCurrency",
  "id": "ov3uli",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Every single line of Bitcoin code written by \"shadowy super coders\", who\ncontribute their precious time and inspired efforts voluntarily without a\nguaranteed salary, is open for the whole world to access, scrutinize and propose\nchanges to.\n\nHowever, whose tax dollars keep paying for champagne tree…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコインのコードの一行一行は、「影のスーパーコーダー」によって書かれています。\n貴重な時間と努力を無償で提供している\n世界中の人々がアクセスし、精査し、変更を提案することができます。\n変更することができます。\n\nしかし、誰の税金でシャンパンツリーが作られているのか...。",
      "title": "ビットコイン評論家のエリザベス・ウォーレンは、美徳を振りまく政治的カメレオンであり、素顔の偽善者である。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "每一行比特币代码都是由 \"阴暗的超级编码员 \"编写的，他们\n他们自愿贡献他们宝贵的时间和灵感的努力，没有任何担保。\n他们自愿贡献他们宝贵的时间和灵感的努力，却没有得到保证的工资，他们的每一行代码都是开放的，供全世界的人访问、审查和提出修改意见。\n变化。\n\n然而，谁的税款一直在支付香槟树...",
      "title": "比特币评论家伊丽莎白-沃伦是一个发出美德信号的政治变色龙和一个赤裸裸的伪君子"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "每一行比特幣代碼都是由 \"陰暗的超級編碼員 \"編寫的，他們\n他們自願貢獻他們寶貴的時間和靈感的努力，沒有任何擔保。\n他們自願貢獻他們寶貴的時間和靈感的努力，卻沒有得到保證的工資，他們的每一行代碼都是開放的，供全世界的人訪問、審查和提出修改意見。\n變化。\n\n然而，誰的稅款一直在支付香檳樹...",
      "title": "比特幣評論家伊麗莎白-沃倫是一個發出美德信號的政治變色龍和一個赤裸裸的僞君子"
    }
  ]
}