{
  "author": "Easy_Elevator",
  "original_created_utc": 1641204888,
  "title": "What is one coin you'll never turn your back on despite the hate?",
  "created_utc": 1641238384,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;What&amp;#39;s a coin or token that bears a rather negative connotation in the crypto space, but you believe in its future despite the controversy surrounding it? &lt;/p&gt;\n\n&lt;p&gt;Mine wouldn&amp;#39;t exactly be a specific crypto but more of a category - memecoins.&lt;/p&gt;\n\n&lt;p&gt;Everyone always hates on memecoins because of how &amp;quot;disgraceful&amp;quot; they are to the crypto game. &amp;quot;Its not a serious project, it doesn&amp;#39;t have a future it&amp;#39;l die out in a couple months...&amp;quot; yeah, I get and partially agree with that, but why does it have to?&lt;/p&gt;\n\n&lt;p&gt;As long as it&amp;#39;s not a scam/rugpull, I don&amp;#39;t see why a couple thousand people can&amp;#39;t come together and form a small community out of a token, develop games for it, mint a couple NFT&amp;#39;s, etc...&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s not really hirting anybody so I don&amp;#39;t see the problem.&lt;/p&gt;\n\n&lt;p&gt;Now on the other hand, people that keep pressuring others to FOMO into a cryptocurrency that clearly doesnt have the capacities to become big, but they pretend it does, that is a problem.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 390,
  "permalink": "/r/CryptoCurrency/comments/ruyhge/what_is_one_coin_youll_never_turn_your_back_on/",
  "subreddit": "CryptoCurrency",
  "id": "ruyhge",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "What's a coin or token that bears a rather negative connotation in the crypto\nspace, but you believe in its future despite the controversy surrounding it?\n\nMine wouldn't exactly be a specific crypto but more of a category - memecoins.\n\nEveryone always hates on memecoins because of how \"disgraceful\"…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号の中でもかなりネガティブな意味合いを持つコインやトークンは何ですか？\nしかし、あなたはそれを取り巻く論争にもかかわらず、その将来性を信じていますか？\n\n特定の暗号というよりは、カテゴリーに属しますね。\n\nミメコインは、「みっともない」という理由でいつも嫌われています。",
      "title": "嫌われても絶対に背を向けないワンコインとは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "什么是在加密货币领域具有相当负面含义的硬币或代币？\n但你相信它的未来，尽管围绕它有争议？\n\n我的不完全是一个具体的加密货币，而更像是一个类别--memecoins。\n\n每个人总是讨厌memecoins，因为它是多么 \"可耻\"。",
      "title": "有哪一种硬币是你不顾憎恨而永远不会背弃的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "什麼是在加密貨幣領域具有相當負面含義的硬幣或代幣？\n但你相信它的未來，儘管圍繞它有爭議？\n\n我的不完全是一個具體的加密貨幣，而更像是一個類別--memecoins。\n\n每個人總是討厭memecoins，因爲它是多麼 \"可恥\"。",
      "title": "有哪一種硬幣是你不顧憎恨而永遠不會背棄的？"
    }
  ]
}