{
  "author": "AskScienceModerator",
  "the_new_excerpt": "We're a group of scientists from around the globe that came together to work\ntoward the common cause of imaging nearby planets that could potentially support\nlife. You might have seen our work\n(https://www.nature.com/articles/s41467-021-21176-6#Sec3) in the headlines\nrecently, in which we reported…",
  "original_created_utc": 1613476842,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我们是一群来自全球各地的科学家，他们聚集在一起工作。\n向着可能支持附近行星成像的共同事业发展。\n的生活。你可能已经看到我们的工作\n(https://www.nature.com/articles/s41467-021-21176-6#Sec3)上头条\n最近，我们在其中报道了...",
      "title": "AskScience AMA系列。我们是一个由天文学家和工程师组成的国际团队 致力于对附近恒星的宜居区的行星进行直接成像。问我们任何问题"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們是一羣來自全球各地的科學家，他們聚集在一起工作。\n向着可能支持附近行星成像的共同事業發展。\n的生活。你可能已經看到我們的工作\n(https://www.nature.com/articles/s41467-021-21176-6#Sec3)上頭條\n最近，我們在其中報道了...",
      "title": "AskScience AMA系列。我們是一個由天文學家和工程師組成的國際團隊 致力於對附近恆星的宜居區的行星進行直接成像。問我們任何問題"
    }
  ],
  "title": "AskScience AMA Series: We're an international team of astronomers and engineers working to directly image planets in the habitable zones of nearby stars. Ask Us Anything!",
  "created_utc": 1613482880,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We&#39;re a group of scientists from around the globe that came together to work toward the common cause of imaging nearby planets that could potentially support life. You might have seen our work (<a href=\"https://www.nature.com/articles/s41467-021-21176-6#Sec3\">https://www.nature.com/articles/s41467-021-21176-6#Sec3</a>) in the headlines recently, in which we reported the first sensitivity to sub-Saturn sized planets in the habitable zone of Alpha Centauri along with a possible candidate planet. We&#39;ll be on around 2 PM ET (19 UT) and we&#39;re looking forward to your questions!</p>\n\n<p>Username: <a href=\"/u/k-wagner\">/u/k-wagner</a></p>\n</div><!-- SC_ON -->",
  "score": 130,
  "permalink": "/r/askscience/comments/ll2dms/askscience_ama_series_were_an_international_team/",
  "subreddit": "askscience",
  "id": "ll2dms",
  "is_self": true,
  "media": null,
  "is_video": false
}