{
  "author": "interestingstuff6",
  "the_new_excerpt": "Q. Have you heard the term \"pay for hold\"? \n\nA. Yes. \n\nQ. What's your understanding of what that \n\nis in relation to locates? \n\nA. I think it's borderline illegal, but \n\nallegedly some firms would try to preborrow the \n\nstock before they actually did it so if they wanted \n\nto short the stock the…",
  "original_created_utc": 1613352826,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "Q. 您是否听说过 \"持币待购 \"这个词？ \n\nA. 听说过。 \n\nQ. 你对这个词的理解是什么？ \n\n是与定位的关系？ \n\nA. 我认为这是边缘非法的，但。 \n\n据称，一些公司会试图预借。 \n\n在他们实际做之前，股票，所以如果他们想 \n\n做空股票的...",
      "title": "Robinhood、Too-Big-To-Fail和赤裸裸的空头交易。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Q. 您是否聽說過 \"持幣待購 \"這個詞？ \n\nA. 聽說過。 \n\nQ. 你對這個詞的理解是什麼？ \n\n是與定位的關係？ \n\nA. 我認爲這是邊緣非法的，但。 \n\n據稱，一些公司會試圖預借。 \n\n在他們實際做之前，股票，所以如果他們想 \n\n做空股票的...",
      "title": "Robinhood、Too-Big-To-Fail和赤裸裸的空頭交易。"
    }
  ],
  "title": "Robinhood, Too-Big-To-Fail, and Naked Short Selling",
  "created_utc": 1613380666,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Q. Have you heard the term &quot;pay for hold&quot;? </p>\n\n<p>A. Yes. </p>\n\n<p>Q. What&#39;s your understanding of what that </p>\n\n<p>is in relation to locates? </p>\n\n<p>A. I think it&#39;s borderline illegal, but </p>\n\n<p>allegedly some firms would try to preborrow the </p>\n\n<p>stock before they actually did it so if they wanted </p>\n\n<p>to short the stock the borrow would be there.”</p>\n\n<p><strong>—Marc Cohodes Highly Confidential - Attorneys&#39; Eyes Only,  Friday, November 18, 2011 11:09 a.m.</strong></p>\n\n<p><a href=\"https://archive.org/stream/328064-transcript-of-depositions-in-case/328064-transcript-of-depositions-in-case_djvu.txt\"><strong>https://archive.org/stream/328064-transcript-of-depositions-in-case/328064-transcript-of-depositions-in-case_djvu.txt</strong></a></p>\n\n<p><strong>Linked below is the brokerage industry by market share</strong></p>\n\n<p><a href=\"https://www.reddit.com/r/business/comments/jh9zrs/six_brokers_control_roughly_70_of_the_prime/\">https://www.reddit.com/r/business/comments/jh9zrs/six_brokers_control_roughly_70_of_the_prime/</a>  </p>\n\n<p>As you can see, 50% of the industry is controlled by only three massive corporations, all of which that have access to the federal social safety net.</p>\n\n<p><strong>Richard Fisher&#39;s remarks before the Committee for the Republic, Washington, D.C., January 16, 2013.</strong></p>\n\n<blockquote>\n<p>“This TBTF subsidy is quite large and has risen following the financial crisis. Recent estimates by the Bank for International Settlements, for example, suggest that the implicit government guarantee provides the largest U.S. BHCs with an average credit rating uplift of more than two notches, thereby lowering average funding costs a full percentage point relative to their smaller competitors. Our aforementioned friend from the Bank of England, Andrew Haldane, estimates <strong>the current implicit TBTF global subsidy to be roughly $300 billion per year for the 29 global institutions identified by the Financial Stability Board (2011) as “systemically important.”</strong>  </p>\n\n<p>To put that $300 billion estimated annual subsidy in perspective, all the U.S. BHCs summed together reported 2011 earnings of $108 billion.”  </p>\n\n<p><a href=\"https://www.reddit.com/r/finance/comments/j661av/the_implicit_government_bank_bailout_subsidy_was/\">https://www.reddit.com/r/finance/comments/j661av/the_implicit_government_bank_bailout_subsidy_was/</a></p>\n</blockquote>\n\n<p>Definitely not the kind of business environment that favors bright young start ups..</p>\n\n<p>To make matters worse, the CEO of one of Robinhood’s biggest competitors, Morgan Stanley, CURRENTLY occupies one of the top board seats at the New York Fed, representing the interests of the large capitalization group. </p>\n\n<p>Out of the three classes of directors, two are chosen by industry — Class A and Class B.  </p>\n\n<p><a href=\"https://www.reddit.com/user/interestingstuff6/comments/je436n/_/\">https://www.reddit.com/user/interestingstuff6/comments/je436n/_/</a></p>\n\n<p>Occupying the Class B position is the standing CEO of the Nasdaq.</p>\n\n<p>Brokers and traders sitting on the board of the New York Fed is a relatively new phenomenon—the result of rule changes legislated in response to the carnage inflicted by the 2008 global financial crisis.</p>\n\n<p>But with the cards stacked so high against Robinhood, one is left to question why this small, up and coming discount brokerage is being made a spectacle of by the MSM business news media.  Many of the biggest players in the industry have histories going back as far as the roaring 20’s. They manage portfolios with AUM in the trillions. Their boards of directors consist of some of the most powerful people in the world. Compared to them, Robinhood is but a feather in the wind.</p>\n\n<h1>The Industry</h1>\n\n<p>Did you know that as an investor, when you purchase shares through one of the primary brokerage houses, that you are not actually <strong>purchasing</strong> <strong>legal title to the equity interests</strong> in the company, but only to an <strong><em>entitlement?</em></strong></p>\n\n<p>That’s right, just like Robinhood, when you buy shares, you don’t actually show up on the company’s list of recordholders, and you don’t truly own title to the shares — the brokers do.</p>\n\n<blockquote>\n<p>“Under Article 8, the beneficial owner of the shares held in a custodial account with an intermediary (such as a broker) is considered to be the holder of a <strong>“securities entitlement”</strong> in a “financial asset” which is ultimately held by a depository”,   </p>\n\n<p>—Marcel Kahan, The Georgetown Law Journal</p>\n</blockquote>\n\n<p>This system of ownership is characterized in the industry as “<a href=\"https://archive.is/T1d0Y#selection-1291.0-1294.0\">street name</a>” ownership, and most shares held in brokerage accounts are held in book-entry form (<em>electronically</em>) at the DTCC, with the banks and brokers acting as the <em>registered holders</em> on the company’s books.</p>\n\n<p><strong>Securities and Exchange Commission, Investor Publications</strong></p>\n\n<blockquote>\n<p>“Under street name registration, your firm will keep records showing you as the real or “beneficial” owner, but <strong><em>you will not be listed directly on the issuer’s books. Instead, your brokerage firm will appear as the owner on the issuer’s books</em></strong></p>\n</blockquote>\n\n<p>But why is this important, you might be wondering?  </p>\n\n<p>Well, it shows that Robinhood’s too-big-to-fail competitors are just as guilty as them when it comes to the act of selling fictitious entitlements to securities that they either do not have, or worse, don’t actually exist.</p>\n\n<h1>Naked Short Selling</h1>\n\n<p>Over the past 20 years, the Primary Dealers have been caught counterfeiting equities so many times that it‘s almost become institutionalized into the ETF market.</p>\n\n<p>Industry experts have called this “operational short selling”, but in examples below, you will see that the ownership discrepancy can sometimes reach a ratio that goes as high as 7:1 (<strong>owners to real shares).</strong></p>\n\n<p>In 2018, ETF’s represented 78% of failure-to-delivers.</p>\n\n<p>(Aug.13th, 2015) <strong>Response to SEC Questions Regarding Exchange Traded Products File Number S7-11-15</strong></p>\n\n<blockquote>\n<p>“It appears instead, some <strong>ETFs have become a mechanism designed to siphon investors’ money for the benefit of the short selling</strong>, which at times reaches 2 of every 3 shares sold.”  </p>\n\n<p>“For example the XRT, which at times during the last 5 years had 7 reporting 13F institutional owners for each share outstanding.”  </p>\n\n<p>“For at least four years, institutional owners have claimed ownership of more than all of the XRT shares outstanding (exceeding 600% at times). At the same time, 70% or nearly 3 of every 4 shares have been sold short daily on reporting markets/SROs, 35 with no sustained net increase in shares outstanding to support the short selling and excess ownership claims.”  </p>\n\n<p>“Moreover, locates (affirmative determinations in order to sell short) are and have been provided daily for millions of shares sold short when the data shows no sophisticated clearing firm could have reasonable grounds to believe shares could be located/borrowed/delivered for legal settlement of large amounts of short sales.”  </p>\n\n<p><strong>“Due to the combined price decrease in the underlying asset (gold) and the net redemptions in the GLD, the value of assets under management</strong> <strong><em>dropped by $33 billion or 52%</em></strong> <strong>during the period. Simply put, the price of gold and the GLD declined by 24% and the value of the GLD assets fell by 52%”</strong>  </p>\n\n<p><a href=\"https://archive.is/Ko5TF\">https://archive.is/Ko5TF</a></p>\n</blockquote>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>“ETFs constitute 10% of U.S. equity market capitalization but over 20% of short interest and <strong>78% of failures- to-deliver</strong>.”</p>\n</blockquote>\n\n<p><a href=\"https://jacobslevycenter.wharton.upenn.edu/wp-content/uploads/2018/08/ETF-Short-Interest-and-Failures-to-Deliver.pdf\">https://jacobslevycenter.wharton.upenn.edu/wp-content/uploads/2018/08/ETF-Short-Interest-and-Failures-to-Deliver.pdf</a></p>\n\n<p>How is that possible, you might be wondering?</p>\n\n<p>Well first, let’s take a step back for a second.  </p>\n\n<p>Before we venture any further, it‘s important to understand how the industry has evolved into what we know today, so let‘s quickly break it all down.</p>\n\n<p>&#x200B;</p>\n\n<h1>A Short History Lesson..</h1>\n\n<p>Over the past 3 decades, the financial services industry has undergone an incredible transformation.  </p>\n\n<p>Once coined “the urge to merge” by the CEO of Chase Manhattan during the <a href=\"https://www.c-span.org/video/?67566-1/chase-chemical-bank-merger\">Chemical Bank merger</a> in 1995, a worldwide push to consolidate was driven by the fear of becoming obsolete in an increasingly globalized market.  </p>\n\n<p>It was this belief that was the primary basis for the repeal of the 66 year old Glass-Steagal Act, later enabling the combination of Salomon Brothers, Smith Barney, Citicorp and Travelers Insurance—considered the <a href=\"https://money.cnn.com/1998/04/06/deals/travelers/\">largest corporate merger in history</a> at that time.  </p>\n\n<p>And although Citigroup’s entire trading division would eventually be met with complete destruction following the attacks of September.11th, it nevertheless ushered in a new millennium of U.S. corporate dominance in a world that would soon be revolutionized by the wonders of the World-Wide-Web.</p>\n\n<p><a href=\"https://archive.is/o/3HRk4/https://www.reddit.com/r/StockMarket/comments/jb44rb/salomon_brothers_who_were_they/\">https://www.reddit.com/r/StockMarket/comments/jb44rb/salomon_brothers_who_were_they/</a></p>\n\n<p>This trend of mergers and acquisitions was only accelerated by the financial crisis.  </p>\n\n<p>Now that we got that out of the way, let’s get back on track.</p>\n\n<h1>The DTCC</h1>\n\n<p>First and foremost, the DTCC is <strong>100% owned, and controlled</strong> by the mega-banks and brokers that dominate the industry..</p>\n\n<blockquote>\n<p>“Just like any company, we’re here to serve our clients, but the fact is that we’re not just like any other company . Because <strong>we’re industry-owned and governed</strong>, we’re your company. <strong>That means DTCC is an extension of your firm, that our infrastructure is an extension of yours and that our priorities are inlockstep with yours.</strong> Our ownership structure and governance are rare in financial services, and it’s a powerful differentiator because, unlike our competitors, we don’t have to choose between what’s best for our shareholders and what’s best for our clients — <strong><em>you’re one and the same</em></strong>.”  </p>\n\n<p>—DTCC 2018 Annual Report  </p>\n\n<p><a href=\"https://archive.is/DNjpO\">https://archive.li/DNjpO</a></p>\n</blockquote>\n\n<p>In fact, it’s even been alleged in court documents that they will use the DTCC as a mechanism to block new entrants that pose a threat to the status quo..</p>\n\n<blockquote>\n<p>“Similarly, Murray Pozmanter—the DTCC Managing Director who served as the Gatekeeper for DTCC’s clearing business—admitted to SL-x that <strong>the DTCC could not offer SL-X central stock loan clearing without the approval of Goldman Sachs</strong> and other Prime Broker Defendants.”  </p>\n\n<p><a href=\"https://archive.is/c0Qt6#selection-18717.0-18729.10\">https://archive.is/c0Qt6#selection-18717.0-18729.10</a>  </p>\n\n<p><strong>”To ensure their agreements to boycott and squash the new platforms would be effective, Goldman Sachs and Morgan Stanley recruited the other Prime Broker Defendants to join their scheme, including certain banks that were initially receptive to the new platforms. Goldman Sachs and Morgan Stanley recruited the other Prime Broker Defendants primarily through Defendant EquiLend, which is a “dealer consortium” that gave the Prime BrokerDefendants a convenient excuse for meeting and coordinating their conduct”..</strong>  </p>\n\n<p><strong>“Prime Broker Defendants’ conduct was primarily driven by Defendants Goldman Sachs and Morgan Stanley. These are the two largest prime brokers in the market, with the most to lose if the market becomes more open and transparent. As detailed below, from time to time, senior personnel from these two banks met in person, one-on-one, to reach agreement on how to protect their dominant market position as the “gatekeepers” of all stockloan trading. This complaint details the dates and attendees of some of these meetings, along with the subject matter of the agreements reached at these meetings. To be clear, the fact of these illicit meetings is not a matter of inference. They are known to have actually occurred”</strong>  </p>\n\n<p><a href=\"https://archive.is/c0Qt6#selection-34.1-2197.17\">https://archive.is/c0Qt6#selection-34.1-2197.17</a></p>\n</blockquote>\n\n<p>Quite the set of allegations when you consider that without their services, it would be virtually impossible to operate as a business in the equities trading and brokerage industry..</p>\n\n<p>(also sounds eerily similar to what Big Tech just did to Parler, but we digress..)</p>\n\n<p>&#x200B;</p>\n\n<h1>What is Ex-Clearing?</h1>\n\n<p>How is one to trust a clearing organization that allows up to 7 different people to claim ownership of the exact same ETF?</p>\n\n<blockquote>\n<p>“For example the XRT, which at times during the last 5 years had 7 reporting 13F institutional owners for each share outstanding.”</p>\n</blockquote>\n\n<p>According to that report, this was documented to have occurred in a variety of popular Exchange Traded Funds, and over a period of several years.</p>\n\n<p>Well, as it turns out, most of this naked short selling isn’t actually happening at the DTCC level, but at the broker level, where dealers—or their clients—will use a variety of tactics that act to disguise this naked short selling activity so they can bypass forced close out requirements which obligate the clearinghouse to demand delivery of naked short  sold securities after 13 days, regardless of the price one would have to pay at that particular time.   </p>\n\n<blockquote>\n<p>“Ex–clearing counterfeiting—The second tier of counterfeiting occurs at the broker dealer level. This is called ex–clearing. Multiple tricks are utilized for the purpose of disguising naked shorts that are fails–to–deliver as disclosed shorts, which means that a share has been borrowed. They also <strong>make naked shorts “invisible” to the system so they don&#39;t become fails–to–deliver, which is the only thing the SEC tracks“</strong>  </p>\n\n<p><a href=\"https://archive.is/GUNsa#selection-287.0-288.0\">https://archive.is/GUNsa#selection-287.0-288.0</a>  </p>\n\n<p>“<strong>Internalized and ex-cleared fails</strong>, including offshore re-hypothecated securities and hypothecation by clearing firms and custodians, are not reflected in data produced by the NSCC.“  </p>\n\n<p><a href=\"https://archive.is/Ko5TF\">https://archive.is/Ko5TF</a></p>\n</blockquote>\n\n<p>Just as a refresher, due to short selling regulations, brokers are forced to deliver on naked short sales within a 13 day period. If they do not, their clearinghouse will forcefully close them out.  This, of course, could be catastrophic in the event of a short squeeze; stocks like GameStop or Hertz being the most recent examples that come to mind. </p>\n\n<p>But many of the industries largest brokers operate their own internal clearing divisions, some of which with origins that stem as far back as the Great Depression; a notable example being Spear Leeds &amp; Kellogg, purchased by Goldman Sachs in the year 2000 for $6.5 billion. </p>\n\n<blockquote>\n<p>(<a href=\"https://archive.is/1AE1R#selection-2167.0-2183.13\">Wall Street Journal</a>) “In addition, <strong>Spear claims to run</strong> <strong>the country’s largest clearing business</strong> <strong>by number of stock and options trades cleared.</strong> Acquiring Spear vaults Goldman into the leading ranks of clearing brokers alongside Bear Stearns Cos ., Merrill Lynch, and Donaldson Lufkin &amp; Jenrette (now being acquired by Credit Suisse First Boston“.  </p>\n\n<p><em>(</em><a href=\"https://archive.is/PsoPk#selection-1925.0-1928.0\"><em>Bloomberg</em></a><em>) “Although trading firms are often shunned by investors because of volatile earnings, Paulson called Spear Leeds a profit machine that would smooth out Goldman’s results. He said the firm has earned money every month for the last nine years, and that</em> ***clearing–settling trades for other firms for a fee–***<strong><em>is its biggest profit center”.</em></strong></p>\n</blockquote>\n\n<p>These broker operated clearing divisions have been shown to facilitate transactions for their clients that theoretically enable a trader to maintain a naked short sale for an indefinite period of time.  </p>\n\n<p>Lawsuits have revealed that naked short sellers can enter into swap agreements, utilizing a “<em>partner”</em> that will temporarily loan out new shares, which are then used by the naked short seller to reset the <a href=\"https://archive.is/o/diDWY/https://ibkr.info/article/240+&amp;cd=4&amp;hl=en&amp;ct=clnk&amp;gl=ca\">13 day forced buy-in</a> period back to day #1.  In essence, each person in the swap agreement is creating a new naked short position, which they then cycle back and forth—like a hot potato.  There are no real shares being sold in the transaction.</p>\n\n<p>So again, one person is loaning the other person fake shares until the forced buy-in date is reset back to day #1, then the other person who received the day loan is repeating the favor down the road.</p>\n\n<p>The lawsuit then goes on to explain how the traders were alerted to their obligation to deliver via an email from their clearinghouse.  A clearinghouse is the middleman that sits between a trade, guaranteeing both the buyer and the seller receives their cash or securities by promising to make up for any delivery failures with its own money.  </p>\n\n<h1>Leaked Testimony</h1>\n\n<p>Separately, another important example of equities counterfeiting can be seen in the Overstock, Mark Cohodes fiasco, where it came out in secret court documents that Goldman had refused to allow a third party to back Cohodes margin on his short sales, even though it should have relieved Goldman of liability.  </p>\n\n<p>It was even said that Goldman took full control of Cohodes account, covering all of his shorts completely against his will, all in the middle of the worst financial cataclysm since the crash of 1929, putting him and his partners out of business after 24 years of operations.  </p>\n\n<p>At the time, Copper Rivers Partners—Cohodes fund—was considered one of the most sophisticated short selling hedge funds in America. </p>\n\n<blockquote>\n<p><strong>Question: And the way the markets were acting in the stocks that you were investing in, in this week of the Lehman Brothers bankruptcy and then the following week, had you in your life, either before or since, ever seen a market that acted the way the stock market acted during those weeks?</strong>  </p>\n\n<p><strong>Answer, Marc Cohodes: was actually working part-time at Merrill Lynch in college and that was when you had the Bunker Hunt silver margin fiacso where they almost bankrupted Bache and a whole bunch of other guys. That was the closest thing I ever saw to it. But basically the world was coming to an end. I mean, totally it was coming to an end. But we were short so much, it was exactly what I had been waiting for. It’s exactly what I thought was going to happen.</strong></p>\n</blockquote>\n\n<p>Many who have analyzed the story believe that Goldman was reacting to recent changes in naked short selling laws, which if were true, could indicate that the shares which had been lent to Cohodes were, unbeknownst to him, “naked short”.   </p>\n\n<p>These are very serious allegations when you consider that Cohodes was paying up to $100 million in stock borrow fees per year..</p>\n\n<blockquote>\n<p><strong>A. Well, again, life-changing events you never forget, which this was. And the market, the stock market, was literally falling apart, going straight down. And our short positions would have benefited hugely by the market falling apart and melting down. But the stocks that we had to cover were all going straight up in violent fashions in a straight down market . So someone was running in front of these trades, someone was. So the fact that the ***** prop desk knew about this is not a surprise to me because</strong> <strong>I think the guys at **** are common criminals, just common criminals.</strong>  </p>\n\n<p><strong>Q. Do you recall mentioning that you — your firm had paid hundreds of millions of dollars to ***** a few minutes ago?</strong>  </p>\n\n<p><strong>A. Yes.</strong>  </p>\n\n<p><strong>Q. And by paying hundreds of millions of dollars,</strong> <strong>did you mean paying hundreds of millions of dollars in borrow fees for short stock?</strong>  </p>\n\n<p><strong>A.</strong> <strong>Yes.</strong>  </p>\n\n<p><strong>Q. So was that the most severe such volatile and — you described it as “world coming to an end” market that you had ever seen?</strong>  </p>\n\n<p><strong>A. Yes.</strong>  </p>\n\n<p><strong>Q. And how many days really was it from the beginning of this problem to the end of it with the problem with the margin call from Goldman &amp; Co. was your firm — did your firm and its funds lose most of their money?</strong>  </p>\n\n<p><strong>A. Eight days, something like that. But the problem was we were off the house call and we were still salvageable. Sure, we had one fund which was up eighty percent and even with all the damage that was done still closed it up 35, so they couldn’t kill that one as hard as they tried. But it’s when we got off the house call, they wouldn’t let us go. And as I recall, to answer your other thing about infusing money,</strong> <strong>BNP was prepared to take all our positions and they wouldn’t release them</strong>**. So I scrambled to find, you know, someone to back us since** <strong>they wouldn’t, and I arranged for BNP to take them and they refused to release them</strong></p>\n</blockquote>\n\n<p>Before these rule changes, options market makers were allowed to naked short if engaged in legitimate hedging activity.</p>\n\n<p><strong>This was known as “The Madoff Exception”.</strong></p>\n\n<blockquote>\n<p>(Reuters) “Madoff’s name was so well known around the SEC’s offices that his efforts to give market-makers a broad reprieve from short selling restrictions led SEC officials to call the measure the “Madoff Exemption.”</p>\n</blockquote>\n\n<p><a href=\"https://archive.is/Ptbfb\">https://archive.is/Ptbfb</a></p>\n\n<p>“The funny thing is that Prime Brokers didn’t even need to fudge the rules. They could counterfeit stocks legally, <strong>thanks to yet another loophole</strong> — this one involving key players known as “market makers.”</p>\n\n<p><a href=\"https://www.rollingstone.com/politics/politics-news/wall-streets-naked-swindle-194908/\">https://www.rollingstone.com/politics/politics-news/wall-streets-naked-swindle-194908/</a></p>\n\n<p>“For market makers, Regulation SHO contained an exception to the locate and close out requirements for short sales. Specifically, the rule allowed, “...[an] exception from the uniform ‘‘locate’’ requirement, as Rule 203(b)(2)(iii), for short sales executed by market makers... including specialists and options market makers, but only in connection with bona-fide market making activities.” This rule was intended to mean that all market makers were permitted to sell stock short without locating that stock”</p>\n\n<p><a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=1675234\">https://papers.ssrn.com/sol3/papers.cfm?abstract_id=1675234</a></p>\n\n<h1>How Banks Can Profit</h1>\n\n<p>Once the shares have been credited to a customer’s account, real or fake, they are still considered an asset.</p>\n\n<p>Assets can collect interest.  Assets can be rehypothicated; used as leverage for short term, equity based repo loans, or even as a collateral component for the issuance of promissory notes.</p>\n\n<blockquote>\n<p>“And then as time went on and/or a position got bigger, the rate would get jacked up on us…… So our <strong>cost of doing business in a particular name would go from not costing us anything to costing us tens of millions of dollars</strong>”…</p>\n</blockquote>\n\n<p>—Marc Cohodes, Copper River Partners</p>\n\n<p>Stock loans can also be used to manipulate the price of public companies in the secondary markets. </p>\n\n<p>This can be achieved through a variety of methods—most notably by restricting access to hard to borrow securities, a manipulative practice mentioned by Cohodes in that very same leaked testimony.  </p>\n\n<p>“Q. Why do you say you think that&#39;s borderline illegal? </p>\n\n<blockquote>\n<p>A. Well, because if you&#39;re a big hedge fund, big, you could be long the stock. You could be long half a million shares. You could also then go to your prime broker and say, I want to borrow 600,000 shares to orchestrate a short squeeze. So you pull 600,000 legitimately borrowable shares off the market and pay to hold them, you long the stock. <strong>You can create a short squeeze through buying more, other people buying more, and you basically shrink the available pool that people can actually borrow. Or you pay to hold.</strong> You pay at five percent thinking you can get the stock tight, and then turn around three months later and then loan out that stock at 21 percent and make an arbitrage. You can do that, which should be illegal. Whatever it is has to do with making a flat pond not flat. </p>\n</blockquote>\n\n<p>Q. What do you mean by &quot;a flat pond not flat&quot;? </p>\n\n<blockquote>\n<p>A. You should have an efficient market that&#39;s fair for all players. You shouldn&#39;t be able at that make an arbitrage in security lending or stock manipulation by either squeezing shorts or borrowing from David at five to lend it to you at 21 because you&#39;re the first mover to a pot of stock. So I always thought it was fringe -- fringy.   </p>\n\n<p>Q. Well, do you know how — do you have any view as to whether the securities lending market is actually efficient or inefficient?  </p>\n\n<p> <strong><em>A. I think the securities lending market is just like the mob. I think it&#39;s completely rigged. It&#39;s a completely manipulated black hole, non- transparent market.”</em></strong></p>\n</blockquote>\n\n<h1>Stock loans</h1>\n\n<p>With the stock loan sector estimated to produce roughly $9 billion in annual revenue, rules embedded within the regulations that are meant to prevent naked short selling also incentivize brokers to cover up this activity.  This is because brokers are blocked from conducting future short sales in a listed security if they show a failure to deliver within that security for 6 consecutive days.  </p>\n\n<blockquote>\n<p>“If the position is not closed out, the broker or dealer and any broker or dealer for which it clears transactions (for example, an introducing broker) may not effect further short sales in that security without borrowing or entering into a bona fide agreement to borrow the security (known as the “pre-borrowing” requirement) until the broker or dealer purchases shares to close out the position and the purchase clears and settles.”  </p>\n\n<p><a href=\"https://archive.is/CD8NI\">https://archive.is/CD8NI</a></p>\n</blockquote>\n\n<p>“a naked short seller who fails to deliver stock benefits by not posting collateral and perhaps avoids paying negative rebates. <strong>Naked short selling is virtually impossible without some involvement by broker-dealers who execute and clear trades for clients such as market makers and short sellers.”</strong></p>\n\n<p><a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=1675234\">https://papers.ssrn.com/sol3/papers.cfm?abstract_id=1675234</a></p>\n\n<p>All a conspiracy you say? Well, not really.</p>\n\n<p>The last nail in the coffin was the recent Dole Foods litigation, which exposed, beyond any shadow of a doubt, how fatally flawed and outdated our security clearance system has become.</p>\n\n<p>The largest bank by assets in America is also a 5 time felon, and the CEO that headed the bank through all 5 of these indictments wasn’t even forced to step down.</p>\n\n<p>That is unprecedented..</p>\n\n<h1>Robinhood</h1>\n\n<p>So to end, the next time you try to blame Robinhood for all the markets problems, try to remember what they&#39;re up against.</p>\n\n<p>The standing CEO&#39;s of Morgan Stanley -- their largest competitor -- and the NASD — in essence, a broker and a trader—both occupy the top two board positions at the nations defacto central bank, the New York Fed -- representing 55% of all Reserve Bank Assets in the United States, permanent member of the FOMC, and the only institution in the world legally sanctioned to manipulate the daily interest rate of a U.S. government treasury bond.  </p>\n\n<p>One of these companies was even alleged to have colluded with Robinhood’s other largest competitor to block new entrants from utilizing the DTCC because it threatened the status quo.  </p>\n\n<p>On top of all of this, most of Robinhoods largest competitors, for reasons unknown, can quite literally access the federal <a href=\"https://www.c-span.org/video/standalone/?c4840115/user-clip-fund-cheaper-safety-net\">social safety net</a>.</p>\n\n<p>Goldman Sachs and Morgan Stanley are obviously not banking institutions. They can pretend all they want, but everybody knows.  They even tried arguing this in court, if you can believe that, and this was after, and not before, they were given membership to the New York Fed.</p>\n\n<blockquote>\n<p>“Defendants continue to say Goldman is not a depository institution when there has been no discovery and no stipulation regarding how or why Goldman came to be examined by the New York Federal Reserve Bank.”</p>\n</blockquote>\n\n<p><a href=\"https://archive.is/sFmxG#selection-253.0-256.0\">https://archive.is/sFmxG#selection-253.0-256.0</a></p>\n\n<p>That’s all everyone.</p>\n\n<p>If you’d like to learn more about naked short selling, feel free to visit the links below.</p>\n\n<p><a href=\"https://archive.is/Ko5TF\">https://archive.is/Ko5TF</a></p>\n\n<p>“Due to the combined price decrease in the underlying asset (gold) and the net redemptions in the GLD, the value of assets under management dropped by $33 billion or 52% during the period. Simply put, <strong>the price of gold and the GLD declined by 24% and the value of the GLD assets fell by 52%”</strong></p>\n\n<p>“A clearing firm is responsible to provide or accept locates for shares to be legitimately borrowed and delivered for settlement of short sales. Moreover, the locate process as otherwise described, is an ‘affirmative determination that shares can be borrowed and delivered for legal settlement’. <strong>When so much more than all of the shares outstanding are reported owned by institutions, how can large locates from any sources be valid?”</strong></p>\n\n<p>(<a href=\"https://archive.is/jZdC1#selection-681.0-684.0\">Financial Times</a>) “However, in the past two years (at the end of 2017 and 2018), <strong>the amount</strong> of pledged collateral received by the major banks <strong>that could be</strong> <strong>repledged onwards was $8.1tn</strong>, up 33 per cent from 2016’s end…. there has been an increase in pledged collateral to almost all global banks (adjusting for conversion to US $). The <strong>source of primary collateral was $3.7tn</strong> of underlying securities, implying a velocity of about 2.2*”.</p>\n\n<p>—<a href=\"https://archive.is/o/l0lOY/https://www.risk.net/collateral-and-financial-plumbing/5474166/collateral-and-the-otc-derivatives-market\">Manmohan Singh, Senior Economist with the International Monetary Fund</a></p>\n\n<p>(<strong>December.3rd, 1976</strong>) “Final Report of the SEC into the Practice of Recording the Ownership of Securities in the Records of the Issuer in Other than the Name of the Beneficial Owner“</p>\n\n<p><a href=\"https://ia803200.us.archive.org/22/items/fsec00unit/fsec00unit.pdf\">https://ia803200.us.archive.org/22/items/fsec00unit/fsec00unit.pdf</a></p>\n\n<p>“ETFs constitute 10% of U.S. equity market capitalization but over 20% of short interest and 78% of failures- to-deliver.”</p>\n\n<p><a href=\"https://jacobslevycenter.wharton.upenn.edu/wp-content/uploads/2018/08/ETF-Short-Interest-and-Failures-to-Deliver.pdf\">https://jacobslevycenter.wharton.upenn.edu/wp-content/uploads/2018/08/ETF-Short-Interest-and-Failures-to-Deliver.pdf</a></p>\n\n<p>“ETF investors can potentially earn additional income by lending their ETF units through a lending agent. The ETF securities lending debate has largely revolved around the former, “inside” lending, where ETF issuers lend out the assets purchased to replicate their chosen benchmark.“</p>\n\n<p><a href=\"https://archive.is/o/NS12A/https://cdn.ihs.com/www/pdf/Why-it-pays-to-lend-ETFs-brochure.pdf\">https://archive.is/o/NS12A/https://cdn.ihs.com/www/pdf/Why-it-pays-to-lend-ETFs-brochure.pdf</a></p>\n\n<p><a href=\"https://web.archive.org/web/20071013023049/http://www.cnn.com/SPECIALS/2001/trade.center/tenants7.html\">https://web.archive.org/web/20071013023049/http://www.cnn.com/SPECIALS/2001/trade.center/tenants7.html</a></p>\n\n<p>(Reuters) “Re-hypothecation occurs when a bank or broker re-uses collateral posted by clients, such as hedge funds, to back the broker’s own trades and borrowings. The practice of re-hypothecation runs into the trillions of dollars and is perfectly legal. It is justified by brokers on the basis that it is a capital efficient way of financing their operations much to the chagrin of hedge funds.”</p>\n\n<p>“By 2007, re-hypothecation had grown so large that it accounted for half of the activity of the shadow banking system. Prior to Lehman Brothers collapse, the <a href=\"https://archive.is/o/NZiM/currents.westlawbusiness.com/Redirect.aspx?cid=&amp;src=&amp;sp=&amp;RS=ZDNB0210&amp;url=http://www.imf.org/external/index.htm\">International Monetary Fund</a> (IMF) calculated that U.S. banks were receiving $4 trillion worth of funding by re-hypothecation, much of which was sourced from the UK. With assets being re-hypothecated many times over (known as “churn”), the original collateral being used may have been as little as $1 trillion – a quarter of the financial footprint created through re-hypothecation.“</p>\n\n<p><a href=\"https://archive.is/NZiM#selection-538.0-538.2\">https://archive.is/NZiM#selection-538.0-538.2</a></p>\n\n<p>“For example, a short seller borrows $100,000 worth of XYZ stock from a prime broker and posts $102,000 cash as collateral. This collateral is placed in an overnight account that earns 5% or something close to the risk-free Federal Funds Rate. In an easy to borrow stock, the rebate “spread” might be 20 basis points; 4.8% of the 5% would be rebated to the short seller. Thus, 20 basis points, or .20%, is the rebate rate spread. In hard to borrow stocks, the rebate rate may be negative, perhaps negative 200 basis points, or -2%.  <strong>Thus, in this example, the prime broker would keep 5% and ask for an additional 2%.”</strong></p>\n\n<p><a href=\"https://archive.vn/o/j6Ust/https://papers.ssrn.com/sol3/papers.cfm?abstract_id=1675234\">https://papers.ssrn.com/sol3/papers.cfm?abstract_id=1675234</a></p>\n</div><!-- SC_ON -->",
  "score": 130,
  "permalink": "/r/stocks/comments/lk2jj9/robinhood_toobigtofail_and_naked_short_selling/",
  "subreddit": "stocks",
  "id": "lk2jj9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728624068
}