{
  "author": "ReachCave",
  "original_created_utc": 1647287757,
  "title": "Why were men and, mainly, women in Victorian Britain prone to what is described as 'madness'? Was this due to a misunderstanding of mental illness at the time? Why does this diagnosis no longer seem as common today?",
  "created_utc": 1647328553,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have just finished Rosemary Ashton&amp;#39;s &lt;em&gt;One Hot Summer: Dickens, Darwin, Disraeli and the Great Stink of 1858&lt;/em&gt;, which does a fantastic job of painting a picture of that particularly steaming summer. &lt;/p&gt;\n\n&lt;p&gt;Throughout, she mentions quite a number of public personas, such as Rosina Bulwer Lytton, Edwin James and Catherine Dickens, among others, who were all at one point or another either accused of being mad or fully committed to an asylum.&lt;/p&gt;\n\n&lt;p&gt;It occurred to me that this &amp;#39;industry&amp;#39; must have been fairly widespread during the Victorian period, but I know very little about what it actually was. What characterized &amp;#39;madness&amp;#39; at this time? How was it that it seemingly was a fact of life during the Victorian period?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/te684e/why_were_men_and_mainly_women_in_victorian/",
  "subreddit": "AskHistorians",
  "id": "te684e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I have just finished Rosemary Ashton's One Hot Summer: Dickens, Darwin, Disraeli\nand the Great Stink of 1858, which does a fantastic job of painting a picture of\nthat particularly steaming summer.\n\nThroughout, she mentions quite a number of public personas, such as Rosina\nBulwer Lytton, Edwin James…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ローズマリー・アシュトンの「ある暑い夏」を読み終えたところです。ディケンズ、ダーウィン、ディズレーリ\nと1858年の大悪臭を描いた素晴らしい本です。\n特に蒸し暑い夏のことである。\n\n彼女は、この夏、特に蒸し暑い夏を過ごしたロジーナ、アシュタンガヨーロッパのアシュタンガヨガなど、多くの著名な人物に言及した。\nブルワー・リットン、エドウィン・ジェームス...。",
      "title": "ヴィクトリア朝のイギリスでは、なぜ男性、そして主に女性が「狂気」と表現されるものにかかりやすかったのだろうか。これは、当時の精神病に対する誤解によるものなのでしょうか？なぜ今日、このような診断が一般的でなくなったのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我刚刚读完罗斯玛丽-阿什顿的《一个炎热的夏天》。Dickens, Darwin, Disraeli\n和1858年的大恶臭，该书出色地描绘了\n描绘了那个特别热的夏天。\n\n在整个过程中，她提到了相当多的公众人物，如罗西娜\n布鲁尔-莱顿、埃德温-詹姆斯...",
      "title": "为什么在维多利亚时代的英国，男人，主要是女人，容易出现被描述为 \"疯狂 \"的情况？这是否由于当时对精神疾病的误解？为什么这种诊断在今天看来不再那么普遍？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我剛剛讀完羅斯瑪麗-阿什頓的《一個炎熱的夏天》。Dickens, Darwin, Disraeli\n和1858年的大惡臭，該書出色地描繪了\n描繪了那個特別熱的夏天。\n\n在整個過程中，她提到了相當多的公衆人物，如羅西娜\n布魯爾-萊頓、埃德溫-詹姆斯...",
      "title": "爲什麼在維多利亞時代的英國，男人，主要是女人，容易出現被描述爲 \"瘋狂 \"的情況？這是否由於當時對精神疾病的誤解？爲什麼這種診斷在今天看來不再那麼普遍？"
    }
  ]
}