{
  "author": "votedog",
  "original_created_utc": 1637176237,
  "title": "Getting Fired for Refusing the Vaccine Does Not Qualify as AntiWork",
  "created_utc": 1637216135,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve seen a few posts here from people saying they&#39;re going to lose their jobs because they won&#39;t get the vaccine. </p>\n\n<p><strong>Your decision not to get vaccinated has nothing to do with anti-work.</strong></p>\n\n<p>You&#39;re getting fired because you could be carrying a virus that has killed <del>hundreds of thousands</del> of people and you can&#39;t see past yourself. I won&#39;t shed a tear for you losing your job and not being able to collect unemployment either. (Edit - Changed Hundreds of Thousands to Millions! Sorry at first I was just using US numbers but I should have included all countries in my number)</p>\n\n<p>Don&#39;t try to lump yourself in with the rest of the anti-work community because the issue here isn&#39;t a big corporation or a slew of terrible managers - it&#39;s you. </p>\n\n<p>Get vaccinated - it saves lives!! </p>\n\n<p>Edited to add: Thanks for the awards!</p>\n\n<p>One more edit to add: My intent for this post was never to divide the sub. Those who lose their jobs due to refusing the vaccine are suffering consequences to their own actions. AntiWork is about people who have no control over their work hours, their pay or how shitty they are treated by employers.</p>\n\n<p>One last edit to those who said the vaccinated can carry the virus too. Yes, I know. I didn&#39;t think I needed to add that but apparently I did. </p>\n</div><!-- SC_ON -->",
  "score": 75312,
  "permalink": "/r/antiwork/comments/qw6jlz/getting_fired_for_refusing_the_vaccine_does_not/",
  "subreddit": "antiwork",
  "id": "qw6jlz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've seen a few posts here from people saying they're going to lose their jobs\nbecause they won't get the vaccine. \n\nYour decision not to get vaccinated has nothing to do with anti-work.\n\nYou're getting fired because you could be carrying a virus that has killed\nhundreds of thousands of people and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサイトでは、地理的条件を満たさないために仕事を失うという人の書き込みをいくつか見ました。\nワクチンを打たないことで、仕事を失うと言っている人の投稿をいくつか見ました。 \n\nワクチンを打たないというあなたの決断は、アンチワークとは何の関係もありません。\n\nあなたが解雇されるのは、何十万人もの人を殺したウイルスをあなたが持っている可能性があるからです。\nあなたが解雇されるのは、何十万人もの人々を殺してきたウイルスをあなたが持っている可能性があるからです。",
      "title": "ワクチンを拒否して解雇されてもアンチワークには該当しない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在这里看到一些人的帖子，说他们将失去工作\n因为他们不接种疫苗。 \n\n你决定不接种疫苗与反工作没有关系。\n\n你被解雇是因为你可能携带一种已经杀死数十万人的病毒。\n数十万人死亡的病毒，并且...",
      "title": "拒绝接种疫苗而被解雇并不符合反工作的要求"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在這裏看到一些人的帖子，說他們將失去工作\n因爲他們不接種疫苗。 \n\n你決定不接種疫苗與反工作沒有關係。\n\n你被解僱是因爲你可能攜帶一種已經殺死數十萬人的病毒。\n數十萬人死亡的病毒，並且...",
      "title": "拒絕接種疫苗而被解僱並不符合反工作的要求"
    }
  ]
}