{
  "author": "Mattelambo",
  "original_created_utc": 1636191919,
  "title": "If the biggest worry you have in life is what altcoin to buy next or that you missed o a 5 or 10x, you are not doing too badly in life... trust me, reality check!",
  "created_utc": 1636198244,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi guys,   </p>\n\n<p>I just wanted to write this hat how grateful and what a huge privilege is it to even have money to participate in the crypto market. We tend to forget this often and a reality check is needed ..It causes us to become very dillusioned when we start comparing to everyone and seeing everyone is getting rich, everyone except for you. Don&#39;t compare yourself to anyone, its one of the largest causes of unhappiness, focus on your own respective journeys!!  </p>\n\n<p>Enjoy the process! I am so happy to see each one of you in this community and wish each one of you nothing more than success and happiness!!</p>\n</div><!-- SC_ON -->",
  "score": 210,
  "permalink": "/r/CryptoCurrency/comments/qnx0ng/if_the_biggest_worry_you_have_in_life_is_what/",
  "subreddit": "CryptoCurrency",
  "id": "qnx0ng",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi guys,\n\nI just wanted to write this hat how grateful and what a huge privilege is it to\neven have money to participate in the crypto market. We tend to forget this\noften and a reality check is needed ..It causes us to become very dillusioned\nwhen we start comparing to everyone and seeing everyone…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。\n\n私はこの帽子を書きたかったのですが、暗号市場に参加するためのお金を持っていることがどれほどありがたく、大きな特権だと思います。\n私たちはこのことを忘れがちです。私たちはこのことを忘れがちです。\n現実を確認する必要があります。\nみんなと比較したり、みんなを見たりすると、とても幻滅してしまいます。",
      "title": "もしあなたが人生で一番心配していることが、次にどのアルトコインを買うか、5倍や10倍を逃したことだとしたら、あなたは人生であまり悪いことをしていないことになります...信じてください、現実を見てください"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。\n\n我只是想写下这顶帽子，我很感激，能有资金参与加密货币市场是多么大的荣幸。\n甚至有钱参与加密货币市场。我们往往会忘记这一点\n我们经常忘记这一点，需要进行现实检查。\n当我们开始与每个人进行比较，看到每个人......",
      "title": "如果你生活中最大的担忧是下一步买什么altcoin，或者你错过了5倍或10倍，那么你的生活就不会太糟糕......相信我，现实是残酷的"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。\n\n我只是想寫下這頂帽子，我很感激，能有資金參與加密貨幣市場是多麼大的榮幸。\n甚至有錢參與加密貨幣市場。我們往往會忘記這一點\n我們經常忘記這一點，需要進行現實檢查。\n當我們開始與每個人進行比較，看到每個人......",
      "title": "如果你生活中最大的擔憂是下一步買什麼altcoin，或者你錯過了5倍或10倍，那麼你的生活就不會太糟糕......相信我，現實是殘酷的"
    }
  ]
}