{
  "author": "sadlittlewaffle",
  "original_created_utc": 1629313067,
  "title": "Is it normal for a 15 yr old guy to cry?",
  "created_utc": 1629326072,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Ok, I know this sounds stupid, but all my life all of the males I know and lookup to  have never cried in front of me or anyone else. I have school coming up on Monday and I just lost my sister a month ago. I feel like I shouldn’t cry because it wasn’t normalized in my house hold. I’m trying to watch a lot of TV and I’ve been remodeling furniture to try and take my mind off of the stuff, but anytime I’m scrolling through Reddit or right before bed I feel like I just wanna bawl my eyes out for 10 minutes. I feel like I have a pit in my stomach a lot of the day. </p>\n\n<p>Is this just my house hold and family that makes it like this? Or is this normal?</p>\n</div><!-- SC_ON -->",
  "score": 132,
  "permalink": "/r/NoStupidQuestions/comments/p6xorn/is_it_normal_for_a_15_yr_old_guy_to_cry/",
  "subreddit": "NoStupidQuestions",
  "id": "p6xorn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Ok, I know this sounds stupid, but all my life all of the males I know and\nlookup to have never cried in front of me or anyone else. I have school coming\nup on Monday and I just lost my sister a month ago. I feel like I shouldn’t cry\nbecause it wasn’t normalized in my house hold. I’m trying to watch…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "バカげていると思うかもしれませんが、私が知っている尊敬する男性たちは皆、私や他の人の前で泣いたことがありません。\n尊敬している男性は、私や他の人の前で泣いたことがありません。私は月曜日に学校があります。\nヶ月前に妹を亡くしたばかりなんです。私は泣いてはいけないような気がします。\n涙を流してはいけないような気がします。私の家では普通ではなかったからです。",
      "title": "15歳の男が泣くのは普通なのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，我知道这听起来很愚蠢，但在我的生活中，我认识的所有男性\n都没有在我或其他任何人面前哭过。我周一就要上学了\n而我一个月前刚刚失去了我的妹妹。我觉得我不应该哭\n因为这在我的家庭中是不正常的。我正在努力观察...",
      "title": "一个15岁的小伙子哭了，这正常吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，我知道這聽起來很愚蠢，但在我的生活中，我認識的所有男性\n都沒有在我或其他任何人面前哭過。我週一就要上學了\n而我一個月前剛剛失去了我的妹妹。我覺得我不應該哭\n因爲這在我的家庭中是不正常的。我正在努力觀察...",
      "title": "一個15歲的小夥子哭了，這正常嗎？"
    }
  ]
}