{
  "author": "bofadeesnuts",
  "original_created_utc": 1644994840,
  "title": "What's wrong with this picture?",
  "created_utc": 1645015589,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So like 30 years ago, my white ass cousin dressed like his idol, Michael Jordan, for Halloween. Black face, black arms, and black legs. It was a project. He spent hours getting ready. And he did it to honor the great Jordan. We all thought it was cool as hell. After all, we played basketball at my house every day after school and he pretended to be Jordan, and I was Pippen. (He never let me be Jordan - he was a year older) He felt cool all night in his hand painted #23 jersey and shorts, cuz in his tiny 8 year old brain, he was the legend himself.&lt;/p&gt;\n\n&lt;p&gt;He stayed over that night. And he cried when it came time to wash off the paint. He &lt;em&gt;loved&lt;/em&gt; Jordan. &lt;/p&gt;\n\n&lt;p&gt;I think it&amp;#39;s really sweet. You didn&amp;#39;t know my cousin. He felt like a king all night. I know I&amp;#39;m supposed to be disgusted or whatever, but we were super sweet kids. Nobody was racist. I don&amp;#39;t think anyone did anything wrong even to this day. He was obsessed with Jordan for years. The kid loved the man. He was his only hero. Had 3 Jordan posters in his bedroom. I don&amp;#39;t understand why I&amp;#39;m supposed to think it&amp;#39;s wrong. I still don&amp;#39;t get it. I really don&amp;#39;t. Looking at the old pictures it&amp;#39;s even funnier than my dorky sister dressed like Punky Brewster. I would like to understand why everyone gets so pissy about this. He wasn&amp;#39;t making fun of black people. &lt;em&gt;He was honoring his hero.&lt;/em&gt; Does that not matter? Why is he not allowed? It doesn&amp;#39;t make sense to me at all.&lt;/p&gt;\n\n&lt;p&gt;Why would you take that away from an 8 year old kid and call it racist? &amp;quot;You know, Johnny, it would be ok if your black neighbor wanted to paint his body white to look like Eddie Van Halen, but it&amp;#39;s not ok for you to paint your body black to look like Michael Jordan.&amp;quot; That&amp;#39;s crushing and super confusing to a kid. Why rob him of that joy? Why confuse him? I don&amp;#39;t understand why it&amp;#39;s racist to notice our differences. I don&amp;#39;t see an innocent kid wanting to look like his idol by painting his skin any different than wearing a wig or clothes he wouldn&amp;#39;t normally wear. He wanted to look just like him. It was the most elaborate, most time consuming costume the kid ever wore. He did it for his hero. To honor him.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m told I&amp;#39;m supposed to understand why it is racist and disrespectful. But I don&amp;#39;t see it. And when I ask, no one ever really gives me a definitive answer. They just say generic shit like, &amp;quot;It&amp;#39;s insensitive and racist.&amp;quot; But I don&amp;#39;t see why it is either of those things. I&amp;#39;m still left not understanding it. With this Halloween costume, I just see a kid who loved another man with a different skin color. So what? Isn&amp;#39;t that a &lt;em&gt;good&lt;/em&gt; thing? Doesn&amp;#39;t that show human unity, that a white kid loves a black man?&lt;/p&gt;\n\n&lt;p&gt;Look, I know I&amp;#39;m probably just gonna get yelled at and everybody&amp;#39;s gonna crucify me. But maybe instead of being a bunch of internet assholes someone can actually give me a real answer instead of some generic guilt infused horseshit about horseshitty horseshit. Isn&amp;#39;t that what this sub is for? I&amp;#39;m too afraid to ask, because people are assholes about this topic. But here i am, asking. Appreciate the open mindedness and love.&lt;/p&gt;\n\n&lt;p&gt;My question is... why is this not ok? What&amp;#39;s insensitive about it? What&amp;#39;s racist about it? What&amp;#39;s wrong with this picture?&lt;/p&gt;\n\n&lt;p&gt;PS: please forgive me for the way I phrased the question in the subject. I made the post once before and people wouldn&amp;#39;t even read the body of the text and just down voted me and called me names. I genuinely want to understand what I am missing. I am trying to grow. If I&amp;#39;m wrong, I want to know. And I want to know why. Thank you. 🙏&lt;/p&gt;\n\n&lt;p&gt;Edit: forgot to mention: he buzzed his head just to do this - cut &lt;em&gt;all&lt;/em&gt; his hair off to go all the way.&lt;/p&gt;\n\n&lt;p&gt;Edit edit: if you could please &lt;em&gt;not&lt;/em&gt; down vote this so I can actually engage with a wide variety of people, I&amp;#39;d really appreciate it. I spent a long time typing this out and it is kind of annoying that it&amp;#39;s getting down voted. The algorithm will not serve this post to others if it just sits at zero. Thanks for helping me understand by not leaving it at zero. Here&amp;#39;s to personal growth!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 118,
  "permalink": "/r/TooAfraidToAsk/comments/stpjvs/whats_wrong_with_this_picture/",
  "subreddit": "TooAfraidToAsk",
  "id": "stpjvs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So like 30 years ago, my white ass cousin dressed like his idol, Michael Jordan,\nfor Halloween. Black face, black arms, and black legs. It was a project. He\nspent hours getting ready. And he did it to honor the great Jordan. We all\nthought it was cool as hell. After all, we played basketball at my…"
}