{
  "author": "steavus",
  "the_new_excerpt": "We all like to speculate, especially with price predictions. I dont do this very\noften, but seeing some questions in the daily about what is different this time,\netc, etc, i thought i would be fun to do some research. So lets compare the\ncurrent bullrun VS the last bullrun. To be real, i am just a…",
  "original_created_utc": 1615376375,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我们都喜欢投机，尤其是价格预测。我不经常这样做\n常，但在日常中看到一些关于这次有什么不同的问题。\n等等，等等，我想我将是有趣的做一些研究。所以，让我们比较一下\n目前的牛市VS上次的牛市。说实话，我只是一个...",
      "title": "2017/2018年牛散VS2020/2021年牛散及猜想"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們都喜歡投機，尤其是價格預測。我不經常這樣做\n常，但在日常中看到一些關於這次有什麼不同的問題。\n等等，等等，我想我將是有趣的做一些研究。所以，讓我們比較一下\n目前的牛市VS上次的牛市。說實話，我只是一個...",
      "title": "2017/2018年牛散VS2020/2021年牛散及猜想"
    }
  ],
  "title": "2017/2018 Bullrun VS 2020/2021 Bullrun and speculation",
  "created_utc": 1615386936,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We all like to speculate, especially with price predictions. I dont do this very often, but seeing some questions in the daily about what is different this time, etc, etc, i thought i would be fun to do some research. So lets compare the current bullrun VS the last bullrun. To be real, i am just a nobb, all i do is gather info and try to understand it. Thats it. I like to investigate and learn. So feedback is always welcome. I do apologize for spelling errors. </p>\n\n<p>If we look at the last bullrun vs the current bullrun than there are similarities. I will look in to the similarities and whats different from the last time. My main focus is BTC. Ofcourse <strong>a lot of this is hopium, but its fun to speculate and to research.</strong> As all redditposter say, not financial advice tho. </p>\n\n<p><strong>Current chart vs 2017 chart</strong></p>\n\n<p>If we look at the current status of the last three months, the dips that have been happening and now there recovery, it looks quite simular to the last bullrun. If we look at how much BTC gained during the Bullrun from 2018, and history would repeat itself, than we will see some massive gains in the upcoming months. </p>\n\n<p><a href=\"https://preview.redd.it/1wcsocufh6m61.jpg?width=1761&amp;format=pjpg&amp;auto=webp&amp;s=b8ab6fca3d7491b9c1c40b1633ec302bb4397cf0\">https://preview.redd.it/1wcsocufh6m61.jpg?width=1761&amp;format=pjpg&amp;auto=webp&amp;s=b8ab6fca3d7491b9c1c40b1633ec302bb4397cf0</a></p>\n\n<p>This would mean BTC will hit 100k  in the upcoming months. This is just based on the similarities of the last bullrun, so cant take much from it. We all know what happend next, so would prefer a steady grow up. The massive growth was caused by retailinvestors after cryptocurrency went all over the media. </p>\n\n<p><strong>Pisu666 comparison and formula</strong></p>\n\n<p>I did some research and came across the medium of Pisu666.  He proposes a different approach to predicting the bitcoin price’s short-term progress in the growth phase after the halving in comparison to the S2F PlanB theory. </p>\n\n<p>His goal is to develop an understanding of the Bitcoin price course and check new approaches to explain the price fluctuations and the prediction.</p>\n\n<p><em>So I got all the historical bitcoin values since 2014 and looked at the phase in which bitcoin’s value increased. Then I looked for the beginning of the new growth phase from 2018 and compared these values with those from 4 years ago. With a factor of 17.5 for the old values and a shift of exactly 1399 days, both value trends could be superimposed well. The 1399 days correspond precisely to the time distance of the two halvings, which took place in the respective period.</em> </p>\n\n<p><em>Source:</em> <a href=\"https://medium.com/coinmonks/a-little-math-and-a-bitcoin-forecast-bcaddc17d252\">https://medium.com/coinmonks/a-little-math-and-a-bitcoin-forecast-bcaddc17d252</a></p>\n\n<p><a href=\"https://preview.redd.it/276swpmtj6m61.png?width=1948&amp;format=png&amp;auto=webp&amp;s=6658f828903e70e1463fd90b45b83fba36745248\">https://preview.redd.it/276swpmtj6m61.png?width=1948&amp;format=png&amp;auto=webp&amp;s=6658f828903e70e1463fd90b45b83fba36745248</a></p>\n\n<p><strong>Stock to flow theory</strong></p>\n\n<p>The Stock to Flow model measures the relationship between the currently available stock of a resource and its production rate. It&#39;s typically applied to precious metals and other commodities, but some argue it may be applicable to Bitcoin as well. In this sense, Bitcoin may be viewed as a scarce digital resource. </p>\n\n<p>Pisu666: &quot;There is almost always a mathematical formula behind it with such a regular shape, using which you can extrapolate future values. You only have to find it and justify it. Precisely this was made possible by the S2F theory. If you look at the calculations of the S2F theory, these values magically match the actual Bitcoin prices achieved over the entire period of its trading on the exchanges. It has also been repeatedly adjusted and extended to increase its accuracy&quot;</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/sgqsglf2m6m61.jpg?width=1248&amp;format=pjpg&amp;auto=webp&amp;s=419d9bacceada495f2686d4b725f5898b6cee4b9\"> S2F chart by Rob Wolfram (Twitter u/hamal03)</a></p>\n\n<p>&quot;All in all, however, there is probably no other theory that can make reliable predictions over so many orders of magnitude.&quot;</p>\n\n<p><strong>The difference from 2017/2018</strong></p>\n\n<p>2017 was the first time that the public had a real exposure to crypto  and when it happened, it went absolutely crazy. </p>\n\n<p>At this point (2020 - 2021) people are buying crypto to hold and get more over time. Mostly isnt used for trading but for holding. This is for both institutions as retail investors. As we all can remember, the 2017 bullrun was lead by retail investors and not institutions. This shift happend the last year. The retailinvestor percentage could go a bit higher due the stimulus checks, but institutions will have the upper hand. </p>\n\n<p>Massive institutional players including JPMorgan Chase &amp; Co., Deutsche Bank, Citibank and Guggenheim Partners have publicly come out in support of bitcoin. Grayscale now owns more than 630,000 bitcoin (3 percent of the total bitcoin supply), mainly on behalf of accredited and institutional investors.</p>\n\n<p>Last time (2017), even if a company wanted to buy $500 million worth of bitcoin, there wasn&#39;t a easy way to do it. This is no longer the case. MicroStrategy was able to buy about 38,000 bitcoin with minimal slippage and market participants didn&#39;t notice. </p>\n\n<p>Here is a screenshot about the companys know that has BTC:  <a href=\"https://bitcointreasuries.org/\">https://bitcointreasuries.org/</a> </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/0zdppb4qn6m61.jpg?width=1571&amp;format=pjpg&amp;auto=webp&amp;s=e10820032b278456f40332556a9698a378810f1c\">https://preview.redd.it/0zdppb4qn6m61.jpg?width=1571&amp;format=pjpg&amp;auto=webp&amp;s=e10820032b278456f40332556a9698a378810f1c</a></p>\n\n<p>There’s still a long way to go in mainstream support for digital currencies, but this rally is broader and with greater support than for the 2017 run.</p>\n\n<p>Still, this doesnt mean that BTC wont or cant crash. But with institutions and the retailinvestors who want to hold instead of trade, the changes are it will be less extreme as the last time. </p>\n\n<p>Stay safe :)</p>\n</div><!-- SC_ON -->",
  "score": 748,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/WlB_y-HN9xA2pXlZH4Cmu9_sQMUJ7w0XMqEgtDMIWDU.jpg?auto=webp&s=5c140b0958a8fa34a9497a9a73d02eae9e10bc55",
          "width": 1200,
          "height": 745
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/WlB_y-HN9xA2pXlZH4Cmu9_sQMUJ7w0XMqEgtDMIWDU.jpg?width=108&crop=smart&auto=webp&s=77d1e2fccddfe7a6708ed856216a9a982c9fe347",
            "width": 108,
            "height": 67
          },
          {
            "url": "https://external-preview.redd.it/WlB_y-HN9xA2pXlZH4Cmu9_sQMUJ7w0XMqEgtDMIWDU.jpg?width=216&crop=smart&auto=webp&s=6c31b9a7d1bbcc6dcc6394db19d055a048d36bd1",
            "width": 216,
            "height": 134
          },
          {
            "url": "https://external-preview.redd.it/WlB_y-HN9xA2pXlZH4Cmu9_sQMUJ7w0XMqEgtDMIWDU.jpg?width=320&crop=smart&auto=webp&s=e596a2f44620bf5874182c5efd322512beb3ffc6",
            "width": 320,
            "height": 198
          },
          {
            "url": "https://external-preview.redd.it/WlB_y-HN9xA2pXlZH4Cmu9_sQMUJ7w0XMqEgtDMIWDU.jpg?width=640&crop=smart&auto=webp&s=2cb2a5963ce9170e81ac1317a2ccac5735335c6b",
            "width": 640,
            "height": 397
          },
          {
            "url": "https://external-preview.redd.it/WlB_y-HN9xA2pXlZH4Cmu9_sQMUJ7w0XMqEgtDMIWDU.jpg?width=960&crop=smart&auto=webp&s=95d14c646f619c2dd6026d7679ded931e762b6fb",
            "width": 960,
            "height": 596
          },
          {
            "url": "https://external-preview.redd.it/WlB_y-HN9xA2pXlZH4Cmu9_sQMUJ7w0XMqEgtDMIWDU.jpg?width=1080&crop=smart&auto=webp&s=37cfcc1bc8204733f55b61c376d817a16e513e70",
            "width": 1080,
            "height": 670
          }
        ],
        "variants": {},
        "id": "My870whftuIFnwWaf9sC1crsUac24tnYFcOzxPEaZzs"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/m1vn0a/20172018_bullrun_vs_20202021_bullrun_and/",
  "subreddit": "CryptoCurrency",
  "id": "m1vn0a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542573529
}