{
  "author": "Chooky47",
  "original_created_utc": 1635080921,
  "title": "If you’re throwing more money into the market now than you have been for the last few months, you’re succumbing to fomo.",
  "created_utc": 1635154459,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is a simple post. The market is heating up, ATH’s are being cracked by blue chips and shit coins alike, and people are excited and with every reason to be - we all knew that eventually we’d be back but I’m sure most of us didn’t anticipate this soon. </p>\n\n<p>But if you’re throwing in more money now than when things were crabbing, you’re subconsciously already in the grips of fomo investing. </p>\n\n<p>There isn’t anything wrong with continuing to contribute and buy in, however putting more money in now than when it was cheap indicates the hype has got you hooked and you should probably reevaluate why you’re happy to buy more now than when we got juicy discounts. </p>\n\n<p>Stick to the plan and if you feel you need to load up, consider why first and not just <em>it’s on the top gainers for the day</em>. </p>\n\n<p>Enjoy the ride everyone, we’ve earned it!</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/CryptoCurrency/comments/qeruej/if_youre_throwing_more_money_into_the_market_now/",
  "subreddit": "CryptoCurrency",
  "id": "qeruej",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is a simple post. The market is heating up, ATH’s are being cracked by blue\nchips and shit coins alike, and people are excited and with every reason to be -\nwe all knew that eventually we’d be back but I’m sure most of us didn’t\nanticipate this soon.\n\nBut if you’re throwing in more money now…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これはシンプルな投稿です。市場は熱を帯びてきており、ATHはブルーチップからクソコインまで同様にクラックされています。\n人々は興奮しており、それには理由があります。\n最終的には戻ってくるだろうと誰もが思っていましたが、ほとんどの人がこんなに早く戻ってくるとは思っていなかったでしょう。\nこんなに早く戻ってくるとは思いませんでした。\n\nしかし、もしあなたが今より多くのお金を投じるのであれば...。",
      "title": "ここ数ヶ月よりも今の方が市場に資金を投入しているなら、フォモに屈していることになる。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是个简单的帖子。市场正在升温，ATH正在被蓝筹股和垃圾币破解。\n人们都很兴奋，而且有充分的理由兴奋--我们都知道最终我们会回来，但我相信大多数人都不知道。\n我们都知道，最终我们会回来，但我相信我们中的大多数人都没有料到\n预计会这么快。\n\n但是，如果你现在投入更多的钱...",
      "title": "如果你现在比过去几个月更多地把钱扔进市场，你就会屈服于fomo。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是個簡單的帖子。市場正在升溫，ATH正在被藍籌股和垃圾幣破解。\n人們都很興奮，而且有充分的理由興奮--我們都知道最終我們會回來，但我相信大多數人都不知道。\n我們都知道，最終我們會回來，但我相信我們中的大多數人都沒有料到\n預計會這麼快。\n\n但是，如果你現在投入更多的錢...",
      "title": "如果你現在比過去幾個月更多地把錢扔進市場，你就會屈服於fomo。"
    }
  ]
}