{
  "author": "sgtmattie",
  "original_created_utc": 1660057742,
  "title": "Is referring to a group of people (with women included) as \"guys\" really something that people are trying to stop?",
  "created_utc": 1660069595,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Just a disclaimer that I&amp;#39;m not opposed to stopping the use of guys; I&amp;#39;m just a little confused. No transphobia/homophobia will be tolerated.&lt;/p&gt;\n\n&lt;p&gt;My boss at work referred to our team as guys, and then corrected herself with a ramble about how she knows she should be using more gender neutral terms. Now there are a few people on my team making the same mistake and correcting themselves, and one (woman) colleague (annoyingly) piping in every time saying &amp;quot;you can call me whatever you want, I don&amp;#39;t care.&amp;quot; It&amp;#39;s always an awkward interaction.&lt;/p&gt;\n\n&lt;p&gt;I understand not wanting to be individually referred to as a &amp;quot;guy,&amp;quot; but I thought it was pretty settled that referring to a group as guys was gender neutral. &lt;/p&gt;\n\n&lt;p&gt;Is this something people are actually trying to change, or is this just my boss overthinking things?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 118,
  "permalink": "/r/NoStupidQuestions/comments/wk5qyp/is_referring_to_a_group_of_people_with_women/",
  "subreddit": "NoStupidQuestions",
  "id": "wk5qyp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Just a disclaimer that I'm not opposed to stopping the use of guys; I'm just a\nlittle confused. No transphobia/homophobia will be tolerated.\n\nMy boss at work referred to our team as guys, and then corrected herself with a\nramble about how she knows she should be using more gender neutral terms.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ただ、私は男の使用を止めることに反対しているわけではなく、ただ、少し混乱しているだけだということをお断りしておきます。\n少し混乱しているだけです。トランスフォビア/ホモフォビアは許さない。\n\n私の職場の上司が、私たちのチームのことを「男たち」と言い、その後、自分のことを「男たち」と訂正しました。\nもっと性別にとらわれない言葉を使うべきだとわかっているのに・・・。",
      "title": "女性を含む）集団のことを「男」と呼ぶのは、本当に人々がやめさせようとしていることなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我要声明的是，我并不反对停止使用这些家伙；我只是\n有点迷惑。不容许有跨性别恐惧症/憎恶症。\n\n我的老板在工作中把我们的团队称为男人，然后用一句话纠正了自己\n她知道她应该使用更多的中性术语....。",
      "title": "把一群人（包括女性）称为 \"家伙\"，真的是人们要阻止的事情吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我要聲明的是，我並不反對停止使用這些傢伙；我只是\n有點迷惑。不容許有跨性別恐懼症/憎惡症。\n\n我的老闆在工作中把我們的團隊稱爲男人，然後用一句話糾正了自己\n她知道她應該使用更多的中性術語....。",
      "title": "把一羣人（包括女性）稱爲 \"傢伙\"，真的是人們要阻止的事情嗎？"
    }
  ]
}