{
  "author": "caroline_xplr",
  "original_created_utc": 1642905258,
  "title": "How do I stop appearing creepy and awkward?",
  "created_utc": 1642960538,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In public, I am a hot mess. I get really anxious around people and like to keep my distance. I try to avoid talking to avoid making a fool out of myself to obsess about later. I will often avoid sections of shelves in the grocery store if someone is already there. I do better around my close friends. &lt;/p&gt;\n\n&lt;p&gt;As a result, I come off as creepy. It’s almost like I’ve lost all natural ability to communicate socially during the pandemic. When I say “excuse me” or “hello” it always comes out squeaky and awkward. I’d consider myself a kind person, and I’m certainly not trying to be this way. How do I stop? &lt;/p&gt;\n\n&lt;p&gt;Any advice would be greatly appreciated.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/saizht/how_do_i_stop_appearing_creepy_and_awkward/",
  "subreddit": "TooAfraidToAsk",
  "id": "saizht",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In public, I am a hot mess. I get really anxious around people and like to keep\nmy distance. I try to avoid talking to avoid making a fool out of myself to\nobsess about later. I will often avoid sections of shelves in the grocery store\nif someone is already there. I do better around my close…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "人前では、熱血漢です。人の前では本当に不安になってしまい\n距離を置く。私は、自分自身を馬鹿にしないように、話をしないようにしています。\n後で悩むことになる。スーパーでは、棚のコーナーを避けることがよくあります。\n誰かがそこにいれば 私は、親しい人のそばのほうがうまくいく...",
      "title": "不気味で気まずい印象を与えないようにするにはどうしたらいいですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在公共场合，我是一个热的混乱。我在人前非常焦虑，喜欢与人保持距离。\n我的距离。我尽量避免说话，以避免让自己出丑。\n我尽量避免说话，以免自己出丑，以后再纠缠不休。在杂货店里，如果有人在那里，我常常会避开货架的某些部分。\n如果有人已经在那里了。在我的亲密朋友身边，我做得更好...",
      "title": "我怎样才能不显得猥琐和尴尬呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在公共場合，我是一個熱的混亂。我在人前非常焦慮，喜歡與人保持距離。\n我的距離。我儘量避免說話，以避免讓自己出醜。\n我儘量避免說話，以免自己出醜，以後再糾纏不休。在雜貨店裏，如果有人在那裏，我常常會避開貨架的某些部分。\n如果有人已經在那裏了。在我的親密朋友身邊，我做得更好...",
      "title": "我怎樣才能不顯得猥瑣和尷尬呢？"
    }
  ]
}