{
  "author": "question-asker-4678",
  "original_created_utc": 1646167479,
  "title": "What american cultural practices might have shocked a Chinese immigrant in 1800s San Francisco?",
  "created_utc": 1646224446,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have read a lot of english language sources about early Chinese immigration. Reading many of these you inevitably come across descriptions of how various, often mundane Chinese cultural practices were viewed with shock and horror by white people. How about the reverse?&lt;/p&gt;\n\n&lt;p&gt;What are some american social, cultural, or even political traditions common to early white settlers in California that might have shocked or even appalled their early Chinese neighbors? &lt;/p&gt;\n\n&lt;p&gt;How might this response have been different for someone who came over as a relatively well-off merchant versus a laborer from a poorer background relying on family or other loans? &lt;/p&gt;\n\n&lt;p&gt;How might this be different for Chinese immigrants growing up in earlier in the century and immigrating in, say, the 1850s versus later on? &lt;/p&gt;\n\n&lt;p&gt;I know most early Chinese immigrants came from coastal Guangdong and Fujian so answers relating to perceptions by immigrants from those regions are preferred, but what might looking at broader regional references bring?&lt;/p&gt;\n\n&lt;p&gt;Any broader context or direction towards secondary literature is welcome, even if all of those specific questions can&amp;#39;t be answered!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/t4hupo/what_american_cultural_practices_might_have/",
  "subreddit": "AskHistorians",
  "id": "t4hupo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I have read a lot of english language sources about early Chinese immigration.\nReading many of these you inevitably come across descriptions of how various,\noften mundane Chinese cultural practices were viewed with shock and horror by\nwhite people. How about the reverse?\n\nWhat are some american…"
}