{
  "author": "King_Vercingetorix",
  "original_created_utc": 1637418976,
  "title": "According to Bruce Riedel (former head of CIA), 3 days after 9/11 Bush seemed convinced that Iraq must be behind it. Do we now know why?",
  "created_utc": 1637428602,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><blockquote>\n<p>On September 14, I was with Bush when he had his first phone call after 9/11 with British Prime Minister Tony Blair. Bush immediately said he was planning to “hit” Iraq soon. Blair was audibly taken aback. He pressed Bush for evidence of Iraq’s connection to the 9/11 attack and to al-Qaida. Of course, there was none, which British intelligence knew. On September 18, a week after 9/11, Saudi Ambassador Prince Bandar bin Sultan came to the White House to see Bush. The meeting took place on the Truman Balcony. Vice President Richard Cheney and Rice were there as well. My note says the president “clearly thinks Iraq must be behind this. His questions to Bandar show his bias.” Bandar was visibly perplexed. He told Bush that the Saudis had no evidence of any collaboration between Osama bin Laden and Iraq. Indeed their history was of being antagonists.</p>\n</blockquote>\n\n<p>The quote in question. I mean, it seems like everyone told Bush that there was no evidence behind the „Iraq had a hand in 9/11 theory“ but according to Riedel, Bush seemed dead set on this conspiracy. Why? (Also, apologies if this isn&#39;t covered by the 20 year rule, I thought it was but if isn&#39;t, I&#39;ll try to reword the question).</p>\n\n<p><a href=\"https://www.brookings.edu/blog/order-from-chaos/2021/09/17/9-11-and-iraq-the-making-of-a-tragedy/\">https://www.brookings.edu/blog/order-from-chaos/2021/09/17/9-11-and-iraq-the-making-of-a-tragedy/</a></p>\n</div><!-- SC_ON -->",
  "score": 123,
  "permalink": "/r/AskHistorians/comments/qy6u09/according_to_bruce_riedel_former_head_of_cia_3/",
  "subreddit": "AskHistorians",
  "id": "qy6u09",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "> On September 14, I was with Bush when he had his first phone call after 9/11\n> with British Prime Minister Tony Blair. Bush immediately said he was planning\n> to “hit” Iraq soon. Blair was audibly taken aback. He pressed Bush for\n> evidence of Iraq’s connection to the 9/11 attack and to al-Qaida.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "> 9月14日、ブッシュが9.11以降初めて電話をしたとき、私はブッシュと一緒にいました。\n> ブッシュがトニー・ブレア英国首相と最初の電話会談をしたとき、私はブッシュと一緒にいました。ブッシュはすぐに、イラクをすぐに「攻撃」するつもりだと言った。\n> ブッシュはすぐに、イラクをすぐに「攻撃」するつもりだと言った。ブレアは声を上げて驚いた。彼はブッシュに\n> イラクが9.11テロやアルカイダと関係があるという証拠を出せとブッシュに迫った....",
      "title": "ブルース・リーデル（元CIA長官）によると、9.11の3日後、ブッシュは「イラクが裏で糸を引いているに違いない」と確信していたらしい。その理由がわかったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "> 9月14日，当布什在9/11之后第一次通电话时，我和他在一起。\n> 与英国首相托尼-布莱尔的电话。布什立即说他正计划\n> 很快 \"打击 \"伊拉克。布莱尔明显吃了一惊。他向布什追问\n> 伊拉克与9/11袭击事件和基地组织有关的证据....",
      "title": "根据Bruce Riedel（前中央情报局局长）的说法，在911事件发生3天后，布什似乎确信伊拉克一定是幕后黑手。我们现在知道原因了吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "> 9月14日，當布什在9/11之後第一次通電話時，我和他在一起。\n> 與英國首相托尼-布萊爾的電話。布什立即說他正計劃\n> 很快 \"打擊 \"伊拉克。布萊爾明顯吃了一驚。他向布什追問\n> 伊拉克與9/11襲擊事件和基地組織有關的證據....",
      "title": "根據Bruce Riedel（前中央情報局局長）的說法，在911事件發生3天后，布什似乎確信伊拉克一定是幕後黑手。我們現在知道原因了嗎？"
    }
  ]
}