{
  "author": "bloomalicious_162",
  "original_created_utc": 1649671050,
  "title": "Why are some people so bothered by cultural appropriation?",
  "created_utc": 1649679558,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’ve seen posts on the internet of white guys wearing dreads and getting attacked and doxxed on twitter, someone wearing a native american war bonnet and getting harassed, etc. I’m Croatian, and I personally would be overjoyed if someone who isn’t Croatian wore a traditional dress/suit. To me it’s a compliment and that they admire our culture. But maybe that’s just me? I’m interested in knowing more about this from other people’s perspectives.&lt;/p&gt;\n\n&lt;p&gt;edit: please don’t argue. i was only wanting to educate myself more&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 292,
  "permalink": "/r/NoStupidQuestions/comments/u1441g/why_are_some_people_so_bothered_by_cultural/",
  "subreddit": "NoStupidQuestions",
  "id": "u1441g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’ve seen posts on the internet of white guys wearing dreads and getting\nattacked and doxxed on twitter, someone wearing a native american war bonnet and\ngetting harassed, etc. I’m Croatian, and I personally would be overjoyed if\nsomeone who isn’t Croatian wore a traditional dress/suit. To me it’s…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ネット上では、白人がドレッドをかぶっている投稿を見たことがあります。\nツイッターで攻撃されたり、Doxされたり、ネイティブアメリカンのボンネットをかぶった人がいて\n嫌がらせを受けるなど 私はクロアチア人です。\nクロアチア人でない人が伝統的なドレスやスーツを着ている。私にとっては...",
      "title": "なぜ、文化の流用に悩む人がいるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在互联网上看到一些帖子，说白人戴着辫子，在twitter上被攻击和挖苦。\n我在互联网上看到过这样的帖子：白人戴着辫子，在微博上被攻击和挖苦；有人戴着美国本土的战争帽，被骚扰。\n遭到骚扰，等等。我是克罗地亚人，我个人会非常高兴，如果\n我是克罗地亚人，如果不是克罗地亚人的人穿上传统服装/套装，我个人会非常高兴。对我来说，这就是...",
      "title": "为什么有些人对文化盗用如此烦恼？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在互聯網上看到一些帖子，說白人戴着辮子，在twitter上被攻擊和挖苦。\n我在互聯網上看到過這樣的帖子：白人戴着辮子，在微博上被攻擊和挖苦；有人戴着美國本土的戰爭帽，被騷擾。\n遭到騷擾，等等。我是克羅地亞人，我個人會非常高興，如果\n我是克羅地亞人，如果不是克羅地亞人的人穿上傳統服裝/套裝，我個人會非常高興。對我來說，這就是...",
      "title": "爲什麼有些人對文化盜用如此煩惱？"
    }
  ]
}