{
  "author": "deathtolucky",
  "original_created_utc": 1638678911,
  "title": "To all of you who keep chasing that 100x coin for f*ck you money; if today’s dip shook you, you would never HODL to get those gains",
  "created_utc": 1638700826,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;There’s a reason that people get excited about stories of people who struck it Lambo rich from putting $50 into crypto; it doesn’t happen often. If it did, you would be as tired of hearing about it as you are of today’s “buy the dip” posts&lt;/p&gt;\n\n&lt;p&gt;For every person you hear of striking gold on an unknown alt, there are hundreds or thousands of others who jumped ship on their original coin during times of trouble. Today just shows that even if you did manage to find the golden ticket, you need an iron clad mindset to hodl that bitch through thick and thin. &lt;/p&gt;\n\n&lt;p&gt;This is why it’s so crucial to invest money you can afford to lose and pick a project you believe passionately in. It gives you the opportunity to ride that mofo into the sunset since you &lt;em&gt;really don’t&lt;/em&gt; give a fuck if it goes to zero or not. Your options aren’t limited and you can ride that wave alllllllllll the way to the top or the bottom. &lt;/p&gt;\n\n&lt;p&gt;Or you’re Keith Gill and you hang the fuck in there no matter what.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 155,
  "permalink": "/r/CryptoCurrency/comments/r97m2c/to_all_of_you_who_keep_chasing_that_100x_coin_for/",
  "subreddit": "CryptoCurrency",
  "id": "r97m2c",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "There’s a reason that people get excited about stories of people who struck it\nLambo rich from putting $50 into crypto; it doesn’t happen often. If it did, you\nwould be as tired of hearing about it as you are of today’s “buy the dip” posts\n\nFor every person you hear of striking gold on an unknown…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "成功者の物語に人々が熱狂するのには理由がある\n暗号に50ドル投入してランボが一攫千金、そんなことは滅多にない。もしそうなら、あなたは\n今日の「ディップを買え」という記事と同じように、聞き飽きただろう。\n\n未知の惑星で金鉱を発見した人の話を聞くたびに...。",
      "title": "100倍のコインを追い続けている皆さん、今日のディップで揺らいだら、その利益を得るためにHODLすることはないでしょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "人们对那些通过投资50美元就能致富的人的故事感到兴奋是有原因的。\n兰博发财的故事；这并不经常发生。如果它发生了，你\n你就会像对今天的 \"买跌 \"帖子一样厌烦听到这种事。\n\n对于你听到的每一个人在一个未知的地方淘金......",
      "title": "对于所有为了***钱而不断追逐那100倍硬币的人来说，如果今天的下跌让你感到震撼，你就不会为了获得这些收益而进行HODL。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "人們對那些通過投資50美元就能致富的人的故事感到興奮是有原因的。\n蘭博發財的故事；這並不經常發生。如果它發生了，你\n你就會像對今天的 \"買跌 \"帖子一樣厭煩聽到這種事。\n\n對於你聽到的每一個人在一個未知的地方淘金......",
      "title": "對於所有爲了***錢而不斷追逐那100倍硬幣的人來說，如果今天的下跌讓你感到震撼，你就不會爲了獲得這些收益而進行HODL。"
    }
  ]
}