{
  "author": "Soggy-Drink-2528",
  "original_created_utc": 1634003576,
  "title": "When talking about racial problems in America, why do people focus on such trivial things?",
  "created_utc": 1634043832,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As a young black man, it pisses me off when a white person feels like they&#39;re doing the work of Christ by focusing on such trivial things when it comes to racial issues such as white people using the n word or white people having dreads or white people using black emojis. These aren&#39;t real issues. These things are not killing innocent black people. Why do we spend so much time focusing on such trivial things that aren&#39;t affecting the lives of black people? I&#39;ll be fair, it is black people as well focusing on stupid shit like this, but I gotta be honest, anytime I hear somebody bitching about these stupid things, it&#39;s almost always from young white college kids who think they are making a difference in the world. Instead of talking about pointless shit like this, why aren&#39;t we talking about redlining, gentrification, police, inner city public schooling?</p>\n</div><!-- SC_ON -->",
  "score": 113,
  "permalink": "/r/TooAfraidToAsk/comments/q6bbz2/when_talking_about_racial_problems_in_america_why/",
  "subreddit": "TooAfraidToAsk",
  "id": "q6bbz2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As a young black man, it pisses me off when a white person feels like they're\ndoing the work of Christ by focusing on such trivial things when it comes to\nracial issues such as white people using the n word or white people having\ndreads or white people using black emojis. These aren't real issues.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "若い黒人男性としては、白人が自分たちの仕事をしているように感じるのは腹立たしいことです。\n白人がNワードを使っているとか、白人に子供がいるとか、人種問題に関しては些細なことに\n白人がNワードを使うとか、白人がドレッドヘアにするとか、白人が黒人の絵文字を使うとか\n白人がNワードを使っているとか、白人がドレッドをしているとか、白人が黒人の絵文字を使っているとか。これらは本当の問題ではありません....",
      "title": "アメリカの人種問題を語るとき、なぜ人はそんな些細なことにこだわるのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "作为一个年轻的黑人，当一个白人觉得他们是在做基督的工作时，让我很生气。\n当涉及到种族问题时，白人觉得他们在做基督的工作，关注这些微不足道的事情，比如白人使用大麻。\n种族问题，如白人使用 \"N \"字，或白人有辫子，或白人使用黑人表情符号。\n辫子或白人使用黑人表情符号。这些都不是真正的问题....",
      "title": "在谈论美国的种族问题时，为什么人们会关注这些琐碎的事情？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "作爲一個年輕的黑人，當一個白人覺得他們是在做基督的工作時，讓我很生氣。\n當涉及到種族問題時，白人覺得他們在做基督的工作，關注這些微不足道的事情，比如白人使用大麻。\n種族問題，如白人使用 \"N \"字，或白人有辮子，或白人使用黑人表情符號。\n辮子或白人使用黑人表情符號。這些都不是真正的問題....",
      "title": "在談論美國的種族問題時，爲什麼人們會關注這些瑣碎的事情？"
    }
  ]
}