{
  "author": "Jaded_Quiet_4508",
  "original_created_utc": 1628383485,
  "title": "New Website that Posts Cash Prices for Healthcare Services!",
  "created_utc": 1628438307,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi everyone! I&#39;m an intern for HEALTHdrum, and we&#39;re a company starting out in South Florida, that is focusing on cost transparency for healthcare services. Health insurance inflates your healthcare costs, and it might even cost you less money to pay for some of these services upfront with cash prices without health insurance. Here&#39;s our elevator pitch below! Don&#39;t be afraid to reach out! :) </p>\n\n<p><strong>Startup Name/ URL:</strong> HEALTHdrum/<a href=\"http://healthdrum.com/?utm_source=reddit&amp;utm_medium=post&amp;utm_campaign=startup\">https://healthdrum.com/</a></p>\n\n<p><strong>Location of Your Headquarters:</strong> Boca Raton, FL, United States</p>\n\n<p><strong>Elevator Pitch/Explainer Video:</strong></p>\n\n<p>HEALTHdrum is a cost-transparent healthcare marketplace platform for routine care. While most medical services in the U.S. are routine office-based or outpatient and generally affordable, the unnecessary insurance-based coverage of day-to-day healthcare leads to inconvenience and inflated pricing. Our platform posts the cash prices of healthcare services provided by physicians so that you get lower costs. And, since insurances have you paying for routine care anyway through copays, deductibles, pre-existing and non-covered services you can move towards plans with even higher deductibles to cover unlikely catastrophic events. Not only does a direct patient-doctor connection save you money but you save even more by increasing your health plan deductible. Your body, your rules. Watch our <a href=\"https://www.youtube.com/watch?v=Rey5X0OJ87k\">video </a>here!</p>\n\n<p><strong>More details:</strong></p>\n\n<ul>\n<li>We are in the validation phase to connect with consumers. Particularly in South Florida where we are starting. We are targeting employers, small business employers, human resource personnel, recruiters, trade groups and those without health benefits such as part-time staff and gig workers or anyone else who desires an alternative to costly, rule-based health plans.</li>\n<li>Your role - Partnership facilitator</li>\n</ul>\n\n<p><strong>Looking for:</strong> We are currently free but anyone (consumers, employers and providers) can sign up for an account. We want to help those who want lower healthcare costs and more freedom of choice. You can follow us on social media (<a href=\"https://www.instagram.com/healthdrum_app/\">Instagram</a>, <a href=\"https://www.facebook.com/HEALTHdrum-103735818167546\">Facebook</a>, <a href=\"https://www.linkedin.com/company/healthdrum\">LinkedIn</a>, <a href=\"https://twitter.com/healthdrumapp?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Eauthor\">Twitter</a>). We’d love to hear any thoughts or feedback you might have so feel free to reach out. See our contact information on HEALTHdrum.com</p>\n</div><!-- SC_ON -->",
  "score": 5,
  "permalink": "/r/SideProject/comments/p04yk6/new_website_that_posts_cash_prices_for_healthcare/",
  "subreddit": "SideProject",
  "id": "p04yk6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi everyone! I'm an intern for HEALTHdrum, and we're a company starting out in\nSouth Florida, that is focusing on cost transparency for healthcare services.\nHealth insurance inflates your healthcare costs, and it might even cost you less\nmoney to pay for some of these services upfront with cash…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。私はHEALTHDRUMでインターンをしていますが、HEALTHDRUMは南フロリダでスタートした会社です。\n南フロリダでスタートした会社で、医療サービスのコストの透明性に焦点を当てています。\n健康保険は医療費を膨らませますが、現金で前払いした方が医療費が安く済む場合もあります。\n現金で前払いした方がコストを抑えられるかもしれません...",
      "title": "医療サービスの現金価格を掲載する新サイトが登場"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好! 我是HEALTHdrum的实习生，我们是一家在南佛罗里达州起步的公司。\n我们是一家在南佛罗里达州成立的公司，专注于医疗保健服务的成本透明度。\n健康保险夸大了你的医疗费用，而用现金预付一些服务的费用甚至可能更少。\n用现金预先支付这些服务的费用......",
      "title": "新网站发布医疗服务的现金价格!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好! 我是HEALTHdrum的實習生，我們是一家在南佛羅里達州起步的公司。\n我們是一家在南佛羅里達州成立的公司，專注於醫療保健服務的成本透明度。\n健康保險誇大了你的醫療費用，而用現金預付一些服務的費用甚至可能更少。\n用現金預先支付這些服務的費用......",
      "title": "新網站發佈醫療服務的現金價格!"
    }
  ]
}