{
  "author": "Gobershmat",
  "original_created_utc": 1631701431,
  "title": "Isn’t the Bible heresy technically?",
  "created_utc": 1631715369,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As far as I know Christians “follow the word of god” and the Bible was the word of Jesus written down 2000 years ago. But now we have the New Testament, which I don’t recall hearing about Jesus coming back down to spell check his work. Didn’t people look at the word of god, say “no I don’t think I agree with that”, made their own Bible, and kept calling it the word of god? Many Christians don’t agree with almost anything in the old and only care about the new. Keep in mind I am pulling all of this from what I heard from the backround of history classes and a Christian friend I used to have.</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/pondob/isnt_the_bible_heresy_technically/",
  "subreddit": "TooAfraidToAsk",
  "id": "pondob",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As far as I know Christians “follow the word of god” and the Bible was the word\nof Jesus written down 2000 years ago. But now we have the New Testament, which I\ndon’t recall hearing about Jesus coming back down to spell check his work.\nDidn’t people look at the word of god, say “no I don’t think I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の知る限り、キリスト教徒は「神の言葉に従う」ものであり、聖書は2000年前にイエスの言葉を\n2000年前に書き留められたイエスの言葉です。しかし、現在は新約聖書があります。\nイエスが自分の作品をチェックするために降りてきたという話は聞いたことがありません。\n人々は神の言葉を見て、「いや、私はそうは思わない...」と言ったのではないでしょうか。",
      "title": "技術的には聖書は異端ではないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "据我所知，基督徒 \"遵循上帝的话语\"，而《圣经》是2000年前耶稣写下的话语。\n是耶稣在2000年前写下的。但现在我们有了《新约》，而我\n我不记得听说过耶稣会回来检查他的工作。\n难道人们没有看着神的话语，说 \"不，我不认为我...",
      "title": "严格来说，圣经不是异端吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "據我所知，基督徒 \"遵循上帝的話語\"，而《聖經》是2000年前耶穌寫下的話語。\n是耶穌在2000年前寫下的。但現在我們有了《新約》，而我\n我不記得聽說過耶穌會回來檢查他的工作。\n難道人們沒有看着神的話語，說 \"不，我不認爲我...",
      "title": "嚴格來說，聖經不是異端嗎？"
    }
  ]
}