{
  "author": "cue-anon",
  "original_created_utc": 1629544461,
  "title": "At what point do we just let survival of the fittest take over?",
  "created_utc": 1629567391,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In regards to getting vaccinated. People have had more than enough time now to get the COVID shot. Many polls show that people are less sympathetic towards people who get COVID and could have received the shot, but chose not to. </p>\n\n<p>So at which point do we just lift all restrictions, get back to a normal life and let nature take its course? \nIs there any other situation where we shut everything down and waited for mass vaccination to occur?</p>\n\n<p><strong>EDIT</strong> </p>\n\n<p>Whoa thanks for all the legit responses!! I didn’t realize that an unchecked virus is what causes mutations, I thought the virus just either mutates or it doesn’t. As much as it sucks I guess we just have to kind of ride this out and hope enough people are vaccinated to make a difference.</p>\n</div><!-- SC_ON -->",
  "score": 114,
  "permalink": "/r/TooAfraidToAsk/comments/p8pnmq/at_what_point_do_we_just_let_survival_of_the/",
  "subreddit": "TooAfraidToAsk",
  "id": "p8pnmq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In regards to getting vaccinated. People have had more than enough time now to\nget the COVID shot. Many polls show that people are less sympathetic towards\npeople who get COVID and could have received the shot, but chose not to.\n\nSo at which point do we just lift all restrictions, get back to a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ワクチン接種に関しては COVIDの予防接種を受けるのに十分な時間がありました。\nCOVIDの予防接種を受けてください。多くの世論調査によると、COVIDを接種した人への同情度は低いようです。\n多くの世論調査では、COVIDに感染し、予防接種を受けることができたにもかかわらず、それを選択しなかった人々に同情的でないという結果が出ています。\n\nでは、どの時点ですべての制限を解除して、元の生活に戻るのでしょうか？",
      "title": "どの時点で適者生存に委ねるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "关于接种疫苗的问题。人们现在已经有足够的时间来\n接种COVID疫苗。许多民意调查显示，人们对那些得了COVID而选择不接种的人的同情心较低。\n得了COVID的人，本可以打针，但却选择不打。\n\n那么，在什么时候，我们应该取消所有的限制，回到一个...",
      "title": "在什么时候，我们才会让适者生存占据主导地位？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "關於接種疫苗的問題。人們現在已經有足夠的時間來\n接種COVID疫苗。許多民意調查顯示，人們對那些得了COVID而選擇不接種的人的同情心較低。\n得了COVID的人，本可以打針，但卻選擇不打。\n\n那麼，在什麼時候，我們應該取消所有的限制，回到一個...",
      "title": "在什麼時候，我們纔會讓適者生存佔據主導地位？"
    }
  ]
}