{
  "author": "babyapetard",
  "original_created_utc": 1635785457,
  "title": "LRC - Where GME meets crypto.",
  "created_utc": 1635798686,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Longtime GME holder and crypto enthusiast here. For those that aren&#39;t aware, last week there was a leak on Github that seems to prove that GME and Loopring are indeed working together to launch an NFT exchange.</p>\n\n<p>For those that aren&#39;t in the loop (pun intended), LRC is currently exploding in price. I suspect it&#39;s a wave of people who, like myself, have just recently connected the dots in understanding what a NFT platform hosted by Loopring in partnership with GameStop would mean for LRC.</p>\n\n<p>It looks like loopring can&#39;t make any official announcements until GameStop does, but they&#39;ve told their followers to expect an announcement in Q4 of this year, so it should definitely happen sometime soon.</p>\n</div><!-- SC_ON -->",
  "score": 245,
  "permalink": "/r/CryptoCurrency/comments/qki6sx/lrc_where_gme_meets_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "qki6sx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Longtime GME holder and crypto enthusiast here. For those that aren't aware,\nlast week there was a leak on Github that seems to prove that GME and Loopring\nare indeed working together to launch an NFT exchange.\n\nFor those that aren't in the loop (pun intended), LRC is currently exploding in\nprice. I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "長年のGMEホルダーであり、暗号愛好家でもあります。気づいていない人のために。\n先週、Githubにリークがあり、GMEとLoopringが実際にNFT取引所を立ち上げるために協力していることが証明されたようです。\nが実際にNFT取引所を立ち上げるために協力していることを証明するようなリーク情報がGithubに掲載されました。\n\nご存知でない方のために（ダジャレですが）、LRCは現在爆発的に値上がりしています。\n価格になっています。I...",
      "title": "LRC - GMEとcryptoの出会い。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是GME的长期持有者和加密货币的爱好者。对于那些不知道的人来说。\n上周，Github上有一个泄漏，似乎证明GME和Loopring\n的确在合作推出一个NFT交易所。\n\n对于那些不了解情况的人来说（双关语），LRC目前的价格正在爆炸性增长。\n价格。I...",
      "title": "LRC - GME与加密货币的结合。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是GME的長期持有者和加密貨幣的愛好者。對於那些不知道的人來說。\n上週，Github上有一個泄漏，似乎證明GME和Loopring\n的確在合作推出一個NFT交易所。\n\n對於那些不瞭解情況的人來說（雙關語），LRC目前的價格正在爆炸性增長。\n價格。I...",
      "title": "LRC - GME與加密貨幣的結合。"
    }
  ]
}