{
  "author": "MiRQd",
  "the_new_excerpt": "Hi Guys,\n\nI've been frustrated to see that stock analyses on non-meme stocks aren't really\nhappening right now so I thought I would talk about one of my favorite stocks at\nthe moment.\n\nSun Communities, Inc. ($SUI) - owns and operates 432 manufactured housing and RV\ncommunities in 32 states and…",
  "original_created_utc": 1611958307,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "嗨，伙计们。\n\n我一直沮丧地看到，对非萌股的股票分析并不是真正的\n现在发生的事情，所以我想我会谈谈我最喜欢的股票之一，在\n当下。\n\nSun Communities, Inc. ($SUI)--拥有并经营着432套成品房和房车。\n32个州的社区和...",
      "title": "[罕见]尽职尽责的股票选择，是不是一个备忘录。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嗨，夥計們。\n\n我一直沮喪地看到，對非萌股的股票分析並不是真正的\n現在發生的事情，所以我想我會談談我最喜歡的股票之一，在\n當下。\n\nSun Communities, Inc. ($SUI)--擁有並經營着432套成品房和房車。\n32個州的社區和...",
      "title": "[罕見]盡職盡責的股票選擇，是不是一個備忘錄。"
    }
  ],
  "title": "[RARE] Due Diligence on a Stock Pick That Isn't a Meme",
  "created_utc": 1611979319,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi Guys,</p>\n\n<p>I&#39;ve been frustrated to see that stock analyses on non-meme stocks aren&#39;t really happening right now so I thought I would talk about one of my favorite stocks at the moment. </p>\n\n<p>Sun Communities, Inc. ($SUI) - owns and operates 432 manufactured housing and RV communities in 32 states and Ontario.  In November they acquired Safe Harbor Marina (formerly owned by the Koch Brothers) adding  99 marinas across 22 states.</p>\n\n<p>Sun is a REIT collecting rent from over 146,000 mobile home sites each month.  And they collect it all; even during the worst months of the pandemic, Sun was collecting 97% or more of their rental payments. They also increased occupancy during Q32020 bringing them to over 97% occupancy. The Safe Harbor acquisition added the recurring revenue from 40,000 slips as well as the highly profitable dry storage business.</p>\n\n<p>Here are a few other factors that make Sun one of the best REITs out there.</p>\n\n<ul>\n<li>Annual move-out rates at Sun&#39;s parks are less than 1%</li>\n<li>The average stay in a Sun mobile home community is 15 years.</li>\n<li>In terms of providing affordable rental housing, Sun&#39;s communities cost 53% less per square foot compared to apartments in similar areas.</li>\n<li>The average cost of a mobile home is about 72% less than the average cost of a single-family home. </li>\n<li>They&#39;re a REIT that owns a lot of acreage (waterfront at that).  As land starts to become more and more valuable, those rents are going to start climbing.</li>\n</ul>\n\n<p>There are way more ways that Sun crushes other REITs <a href=\"https://suncommunities.gcs-web.com/static-files/f6553a93-8b26-436c-89bf-9e165f15f81a\">here</a> </p>\n\n<p>SUI announces earnings in a couple of weeks and it is currently trading about $30 below its 52 week high. Last quarter&#39;s earnings were about $0.40 higher than Q12020 and that doesn&#39;t even count the revenue from Safe Harbors.   The kicker is that Sun&#39;s business has only improved since last year.  The stock&#39;s price is where it is, in my opinion, due to lack of interest and therefore low volume.  It is currently following all of the other REITs out there that are rightfully not returning to their early 2020 highs due to exposure in offices and retail.</p>\n\n<p>Positions: 23.645 shares of SUI, 0 shares of GME.</p>\n</div><!-- SC_ON -->",
  "score": 208,
  "permalink": "/r/stocks/comments/l85tyt/rare_due_diligence_on_a_stock_pick_that_isnt_a/",
  "subreddit": "stocks",
  "id": "l85tyt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518537967
}