{
  "author": "YOLOQuant",
  "the_new_excerpt": "I've seen a lot of misunderstanding across about the effect of rates on\nequities, so I figure I'd hop off of WSB to give an explainer about the\nrelationship between stocks and interest rates, and show why the current sell\noff makes sense.\n\nWhere do interest rates come from?\n\nMoney has time value.…",
  "original_created_utc": 1614884008,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我在各地看到了很多关于利率的影响的误解。\n股票，所以我想我应该从WSB上跳下来，给大家解释一下关于\n股票和利率之间的关系，并说明为什么目前的卖出。\n关是有意义的。\n\n利率从何而来？\n\n钱是有时间价值的....",
      "title": "股票与利率的关系"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在各地看到了很多關於利率的影響的誤解。\n股票，所以我想我應該從WSB上跳下來，給大家解釋一下關於\n股票和利率之間的關係，並說明爲什麼目前的賣出。\n關是有意義的。\n\n利率從何而來？\n\n錢是有時間價值的....",
      "title": "股票與利率的關係"
    }
  ],
  "title": "The Relationship between Stocks and Interest Rates",
  "created_utc": 1614890730,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve seen a lot of misunderstanding across about the effect of rates on equities, so I figure I&#39;d hop off of WSB to give an explainer about the relationship between stocks and interest rates, and show why the current sell off makes sense.</p>\n\n<p><strong>Where do interest rates come from?</strong></p>\n\n<p>Money has time value. Money today is usually worth more today than money tomorrow. How do we measure the time value of money? Interest! When we loan money out, we demand a return. What goes into an interest rate? There are 3 primary factors:</p>\n\n<ol>\n<li><em>What do I think inflation is going to be?</em><br/>\nSay you estimate inflation to be 3% and rising, you&#39;ll demand a far higher interest rate to protect yourself.</li>\n<li><em>How risky is this loan?</em><br/>\nYour lend to a group of risky businesses, you might jack up interest rates to make sure if one goes under, you&#39;ll make your money back from the rest</li>\n<li><em>How much is everyone else willing to lend for?</em><br/>\nYou&#39;ll need to compete with other lenders which helps determine the final interest rate.</li>\n</ol>\n\n<p><strong>US Treasuries: King of Bonds</strong></p>\n\n<p>So US government debt is considered primo with near 0 risk of default. The rates on US government debt determines whats known as the <em>risk free rate</em>.</p>\n\n<p>The US issues debt at several different maturities from weeks, to months, to years. If we line up these interest rates, we get what is known as the <a href=\"https://www.gurufocus.com/yield_curve.php\">yield curve</a>.</p>\n\n<p>To reiterate, these rates are determined by the market and are manipulated by the Federal Reserve, which attempts to intervene in the market to get rates to its targets. When the Fed comes out and says it wants rates to stay near zero, this one of the ways they do it.</p>\n\n<p>And this is exactly what happened during the corona crash, interest rates went to zero across the curve.</p>\n\n<p><strong>How to Value a Company</strong></p>\n\n<p>Let&#39;s say we have two companies. $BRR and $GRO. Let&#39;s say we&#39;re certain of their future cash flows.</p>\n\n<ul>\n<li> BRR is runs a money printer and makes $10M a year.</li>\n<li>GRO is a growth stock that&#39;s expected to make $100M a year in a decade.</li>\n</ul>\n\n<p>How do we value these two companies based on cash flow alone? For simplicity, let&#39;s only look at the first 10 years. We need to determine the present value of the money the company makes in the future.</p>\n\n<p>What is money from n years from now worth today?  money / (1 + risk_free_rate)^n. So we can represent todays value for 10 years of cash flow like this:</p>\n\n<p>Discounted Cash Flow = ($$$ Year 1) / (1 + r) + ... + ($$$ Year 10) / (1 + r)^10</p>\n\n<p>This is one of the ways to come to an intrinsic valuation of a company.</p>\n\n<p><strong>How Rates Affect Value</strong></p>\n\n<p>So which company do you think is worth more? BRR or GRO.</p>\n\n<p>Well that depends on the interest rate! Let&#39;s say interest rates are at 0 or near zero. Their valuations taking no other factors into account are nearly the same: $100M.</p>\n\n<p>Now let&#39;s start cranking up the interest rate slowly to see what the current valuation is.</p>\n\n<p>&#x200B;</p>\n\n<table><thead>\n<tr>\n<th align=\"left\">r</th>\n<th align=\"left\">BRR</th>\n<th align=\"left\">GRO</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">0.0%</td>\n<td align=\"left\">100M</td>\n<td align=\"left\">100M</td>\n</tr>\n<tr>\n<td align=\"left\">0.5%</td>\n<td align=\"left\">97M</td>\n<td align=\"left\">95M</td>\n</tr>\n<tr>\n<td align=\"left\">1.0%</td>\n<td align=\"left\">94M</td>\n<td align=\"left\">90M</td>\n</tr>\n<tr>\n<td align=\"left\">2.0%</td>\n<td align=\"left\">90M</td>\n<td align=\"left\">82M</td>\n</tr>\n<tr>\n<td align=\"left\">4.0%</td>\n<td align=\"left\">81M</td>\n<td align=\"left\">67M</td>\n</tr>\n</tbody></table>\n\n<p><strong><em>As interest rates go up, the company that depends more on future earnings (GRO) is getting whacked. A move 0% to 2% knocks off almost 20% in one shot.</em></strong></p>\n\n<p><strong>So why the fuss all of a sudden?</strong></p>\n\n<p>Stocks went flying higher under the assumption that the fed would remain dovish, work to keep interest rates low, and would not be able to produce inflation over 2% if it wanted to. For a lot of reasons, people were betting that if that inflation would appear any were it would happen farther out in time near the 30Y. Given they figured the 5Y would stay low, and the 30Y would go high they shorted the 30Y bonds and went long 5Y. However, 5Y and 10Y treasury yields suddenly spiked making everyone ask whether inflation would come sooner and faster. People hoped the fed wold say something to alleviate this, but instead Powell reiterated that there will be some inflation, and the fed is not going to do anything about it in the short run. Hence, yields are still rising and equities are continuing to fall.  At to this all the froth and speculation, a 20-30% correction makes a lot of sense.</p>\n</div><!-- SC_ON -->",
  "score": 1362,
  "permalink": "/r/investing/comments/lxs4ue/the_relationship_between_stocks_and_interest_rates/",
  "subreddit": "investing",
  "id": "lxs4ue",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542574781
}