{
  "author": "mstzbootman",
  "the_new_excerpt": "Today was nuts. Everything was up. ETH was hitting record highs and everyone was\ncelebrating, and then we get news about the potential insane tax hikes.\n\nNext thing you know, stocks AND crypto tank.\n\nI’m not going to get into the nuances of the tax bill, but here’s why you\nshouldn’t be worried:\n\n 1.…",
  "original_created_utc": 1619125927,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Today was nuts. すべてが上昇しました。ETHは史上最高値を更新し、誰もが\n祝っていましたが、その後、非常識な増税の可能性についてのニュースがありました。\n\n次の瞬間、株も暗号も大暴落。\n\n税制法案のニュアンスを説明するつもりはありませんが、心配すべきでない理由は以下の通りです。\n心配する必要はありません。\n\n 1....",
      "title": "こんなに怖い税金のニュースを見ても、心配しなくていい理由"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今天很疯狂。一切都在上涨。ETH正创下历史新高，每个人都在庆祝。\n庆祝，然后我们得到关于潜在的疯狂加税的消息。\n\n接下来你知道的是，股票和加密货币都下跌。\n\n我不打算讨论税收法案的细微差别，但以下是你为什么\n不应该担心。\n\n 1....",
      "title": "为什么你不应该担心这个可怕的税收消息？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天很瘋狂。一切都在上漲。ETH正創下歷史新高，每個人都在慶祝。\n慶祝，然後我們得到關於潛在的瘋狂加稅的消息。\n\n接下來你知道的是，股票和加密貨幣都下跌。\n\n我不打算討論稅收法案的細微差別，但以下是你爲什麼\n不應該擔心。\n\n 1....",
      "title": "爲什麼你不應該擔心這個可怕的稅收消息？"
    }
  ],
  "title": "Why you shouldn’t be worried about this scary tax news",
  "created_utc": 1619145878,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Today was nuts. Everything was up. ETH was hitting record highs and everyone was celebrating, and then we get news about the potential insane tax hikes. </p>\n\n<p>Next thing you know, stocks AND crypto tank. </p>\n\n<p>I’m not going to get into the nuances of the tax bill, but here’s why you shouldn’t be worried:</p>\n\n<ol>\n<li><p>It’s not even based off a press conference or anything. Just a rumor Bloomberg published. Yes, I know Biden said he wanted 38%, but he’s a puss and also said “he’s open to negotiation”</p></li>\n<li><p>We haven’t even seen the details (again, because it was a rumor)</p></li>\n<li><p>If it IS true, it’d have to pass the house. There’s a decent chance it’d pass the house IMO, but there’s also a chance the super progressive members would want more from the bill.</p></li>\n<li><p>EVEN IF it passes the house, do you think Joe Manchin will go for it? The guy who just turned town a minimum wage increase for the whole counter? LOL</p></li>\n</ol>\n\n<p>Listen, the progressive in me hopes the tax thing goes through IF they’re going to actually use the money properly.</p>\n\n<p>But the realist and investor in me knows that this country runs on capitalism, and that’s where the power is. </p>\n\n<p>As someone from Las Vegas, I give this whole fiasco a 3% probability of actually happening. There’s a 97% chance everyone is freaking out over nothing.</p>\n\n<p>This isn’t financial advice, but all I know is that I got some cheap ass coins today.</p>\n\n<p>Edit: some people think I should have mentioned the tax hike only affects millionaires. I didn’t find that necessary for this post because my point is that it’s probably not going to pass anyways because the millionaires are in control.</p>\n</div><!-- SC_ON -->",
  "score": 401,
  "permalink": "/r/CryptoCurrency/comments/mweyfp/why_you_shouldnt_be_worried_about_this_scary_tax/",
  "subreddit": "CryptoCurrency",
  "id": "mweyfp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776207025
}