{
  "author": "delpratvh",
  "original_created_utc": 1637397354,
  "title": "Hillary Clinton declaration, might just mark the second leg of this bull run.",
  "created_utc": 1637422589,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hillary Clinton just said on a recent interview, one of the most bullish statements that I have ever heard about Cryptocurrencies especially Bitcoin</p>\n\n<p><em>Quote:</em> &quot;One more area that I hope nation-states start paying greater attention to is the rise of cryptocurrencies – because what looks like a very interesting and somewhat exotic effort to literally mine new coins in order to trade with them has the potential for undermining currencies, for undermining the role of the dollar as the reserve currency, <strong>for destabilizing nations</strong>, perhaps starting with small ones but going much larger.&quot;</p>\n\n<p><a href=\"https://thecryptobasic.com/2021/11/19/hillary-clinton-says-crypto-could-devastate-many-country-economies-and-undermine-dollar-as-worlds-reserve-currency/\">Source of the Quote.</a></p>\n\n<p><a href=\"https://twitter.com/i/status/1461677237091115008\">Video of the Interview.</a></p>\n\n<p>What does this mean, at least from my point of view. This it&#39;s just proof that crypto, it&#39;s putting the Fiat system to the test, and it&#39;s making noise to the people who have a huge stake at the current status quo of the financial structure that societies have been under, over decades now. Adam tracy also explains how the infrastructure bill is going to impact the crypto space here:<br/>\n<a href=\"https://youtu.be/I2989kkXfUQ\">https://youtu.be/I2989kkXfUQ</a></p>\n\n<p>And why is that? Why does crypto, and in my opinion specially Bitcoin, can disrupt so abruptly. It&#39;s mainly for the 5 services that money needs to provide to society in order to exist, and work for us as a medium of exchange.</p>\n\n<p>What are those 5 services that something has to have in order to become a currency?</p>\n\n<p>1.- Divisibility: Money needs to be divisible, it&#39;s a pretty obvious one, if you wan&#39;t to buy something expensive you won be carrying 2 trucks full of coins with you, you can just make bigger measures of money or smaller ones for cheap things like a can of soda.</p>\n\n<p>2.- Durability: It needs to be stand the proof of time, and I&#39;m not talking about the agreement on a certain Fiat currency such as USD or EUR, I mean, if you store 5 apples in a bank they&#39;re going to be worth nothing in a few days (if you use apples for exchanging goods), but if you put coins, paper, or gold it will be there for a long, long time.</p>\n\n<p>3.- Recognizability: Each trading party can verify the authenticity of the money. Meaning that every transaction that I&#39;m giving you money, you can be secure if it is real, by putting in into that light that reflects certain materials that they put into money, if it would be gold there are other ways to verify if it&#39;s real.</p>\n\n<p>4.- Portability: Pretty obvious one, you must be able to move it across time and space without problem.</p>\n\n<p>5.- Scarcity: This is the most important thing about money, and one of the best ways that crypto it&#39;s better than Fiat money ruled by Goverments. Scarcity occurs when the demand outstrips supply, so when there is a demand of a certain currency there will be a supply of that currency.</p>\n\n<p>Crypto, just makes the checkmark over these 5 services, and specially Scarcity. Why? Governments and the people who control the flow of currencies, <strong>ALWAYS</strong> takes advantage of the position where they are in, and just print more of that currency in order to have more for them, and less for everybody else, this is just human nature, and you can study a little bit of history and you will notice that this repeats over time on every society.</p>\n\n<p>In the case of Bitcoin, we just have supply of 21,000,000 coins, and no one can make more out of tin air like governments do, when they please. So Scarcity, it&#39;s the main advantage that crypto and bitcoin has over Fiat currencies.</p>\n\n<p>So if you ask me, for the reasons that I just gave, Hillary Clinton, just point out the fact that Crypto, it&#39;s making the work that we all expect it to be making over time, and it&#39;s doing it fast.</p>\n\n<p>Ps: This post was remake by myself, last one got deleted, for having no source.</p>\n\n<p>Also, In no shape or form this is a political attack on Hillary, it&#39;s just a perspective and speculation around the main reason on why Crypto was created.</p>\n</div><!-- SC_ON -->",
  "score": 226,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/ZVm8OMX58Dx2bL2EsV_TKj_u1Z1DSzp25vNPgBW-2yo.jpg?auto=webp&s=94d00b18ed781a47a3e280197f7ada3bad31d654",
          "width": 338,
          "height": 429
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/ZVm8OMX58Dx2bL2EsV_TKj_u1Z1DSzp25vNPgBW-2yo.jpg?width=108&crop=smart&auto=webp&s=28cd3d61d467c3188501b9196dfedddd6bf987ec",
            "width": 108,
            "height": 137
          },
          {
            "url": "https://external-preview.redd.it/ZVm8OMX58Dx2bL2EsV_TKj_u1Z1DSzp25vNPgBW-2yo.jpg?width=216&crop=smart&auto=webp&s=512c418cc5832658e7e3f5431d43141ae6eeba66",
            "width": 216,
            "height": 274
          },
          {
            "url": "https://external-preview.redd.it/ZVm8OMX58Dx2bL2EsV_TKj_u1Z1DSzp25vNPgBW-2yo.jpg?width=320&crop=smart&auto=webp&s=ca9de6c6335c2d2448587692bf7ddcde5d2e819e",
            "width": 320,
            "height": 406
          }
        ],
        "variants": {},
        "id": "m4tWD6wt6lYVpWgjm9E0mfnzAdPBAjRn_5pT-TFhO1E"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/Bitcoin/comments/qy1dt2/hillary_clinton_declaration_might_just_mark_the/",
  "subreddit": "Bitcoin",
  "id": "qy1dt2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hillary Clinton just said on a recent interview, one of the most bullish\nstatements that I have ever heard about Cryptocurrencies especially Bitcoin\n\nQuote: \"One more area that I hope nation-states start paying greater attention\nto is the rise of cryptocurrencies – because what looks like a very…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ヒラリー・クリントンは、最近のインタビューで、暗号通貨、特にビットコインについて、これまで聞いた中で最も強気な発言をしました。\n暗号通貨、特にビットコインについて、私がこれまで聞いた中で最も強気な発言をしました。\n\n引用しています。「国家がもっと注意を払うようになってほしい分野のひとつが、暗号通貨の台頭です。\n私が国家に期待しているのは、暗号通貨の台頭です。",
      "title": "ヒラリー・クリントン宣言は、この強気の走りの第2の脚を示すものかもしれません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "希拉里-克林顿在最近的一次采访中说，这是我听到的关于加密货币特别是比特币的最乐观的说法之一。\n我所听到的关于加密货币尤其是比特币的声明之一\n\n引用一下。\"我希望各国开始更加关注的另一个领域是加密货币的崛起。\n是加密货币的崛起--因为这看起来是一个非常...",
      "title": "希拉里-克林顿的声明，可能只是标志着这轮牛市的第二站。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "希拉里-克林頓在最近的一次採訪中說，這是我聽到的關於加密貨幣特別是比特幣的最樂觀的說法之一。\n我所聽到的關於加密貨幣尤其是比特幣的聲明之一\n\n引用一下。\"我希望各國開始更加關注的另一個領域是加密貨幣的崛起。\n是加密貨幣的崛起--因爲這看起來是一個非常...",
      "title": "希拉里-克林頓的聲明，可能只是標誌着這輪牛市的第二站。"
    }
  ]
}