{
  "author": "mobby123",
  "original_created_utc": 1631960800,
  "title": "The Irish Potato Famine (1845-1852), while often viewed as a tragedy, largely escapes being labelled as a genocide by the academic community. In contrast to this, the Holodomor/Soviet Famine (1932-1933) is actively labelled as a genocide by 16 countries. What are the causes behind this difference?",
  "created_utc": 1631971569,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>From cursory overview, the events share a large amount of similarities. Both countries were victim to failed economic policies instituted by their occupiers, whether it be Britain&#39;s strict adherence to <em>laissez faire</em> capitalism or Stalin&#39;s rush to modernisation. </p>\n\n<p>The Irish potato famine, though an atrocity, is generally not referred to as a genocide due to a lack of proof of genocidal intent and is rather categorised as an act of historical neglect and incompetence. The general trend is that although the British both contributed to the circumstances that led to the famine, and did a terrible job responding to it, the famine wasn&#39;t a deliberate act of mass-murder with the extinction of Catholic Irish as its goal. A tragedy of apathy and economics rather than one of hatred. </p>\n\n<p>Meanwhile the Ukranian Holodomor&#39;s &quot;genocide question&quot; seems to be far more heated and readily discussed. What were the core differences in the two situations? Is there much more substantial proof of genocidal intent in the Soviet regime? Or is it more of a historiographical issue that&#39;s still conflated with charged Cold War era rhetoric?</p>\n\n<p>Much appreciated! This is a question genuinely borne out of good faith, I&#39;m on a bit of a &quot;Genocide Studies&quot; binge at the moment. The difference in classifications and arguments used are fascinating.</p>\n</div><!-- SC_ON -->",
  "score": 113,
  "permalink": "/r/AskHistorians/comments/pqjz96/the_irish_potato_famine_18451852_while_often/",
  "subreddit": "AskHistorians",
  "id": "pqjz96",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "From cursory overview, the events share a large amount of similarities. Both\ncountries were victim to failed economic policies instituted by their occupiers,\nwhether it be Britain's strict adherence to laissez faire capitalism or Stalin's\nrush to modernisation.\n\nThe Irish potato famine, though an…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ざっと見たところ、この2つのイベントには多くの共通点があります。両国とも\n両国とも、占領者による経済政策の失敗の犠牲となった。\n英国のレッセフェール（自由放任）資本主義への徹底したこだわりや、スターリンの近代化への突進など\n近代化を急いだスターリンのように。\n\nアイルランドのジャガイモ飢饉は、日本では考えられないことです。",
      "title": "アイルランドのジャガイモ飢饉（1845-1852）は、悲劇として捉えられることが多いものの、学界ではジェノサイドのレッテルを貼られることはほとんどありません。これに対して、ホロドモール／ソビエトの大飢饉（1932-1933）は、16カ国でジェノサイドと認定されています。この違いの原因は何なのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "从粗略的概述来看，这些事件有大量的相似之处。这两个国家\n两国都是其占领者制定的失败经济政策的受害者。\n无论是英国对自由放任的资本主义的严格遵守，还是斯大林的\n急于实现现代化。\n\n爱尔兰的马铃薯饥荒，虽然是一个很好的例子。",
      "title": "爱尔兰马铃薯大饥荒（1845-1852）虽然经常被视为一场悲剧，但基本上没有被学术界贴上种族灭绝的标签。与此相反，大饥荒/苏联大饥荒（1932-1933年）却被16个国家主动贴上了种族灭绝的标签。这种差异背后的原因是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "從粗略的概述來看，這些事件有大量的相似之處。這兩個國家\n兩國都是其佔領者制定的失敗經濟政策的受害者。\n無論是英國對自由放任的資本主義的嚴格遵守，還是斯大林的\n急於實現現代化。\n\n愛爾蘭的馬鈴薯饑荒，雖然是一個很好的例子。",
      "title": "愛爾蘭馬鈴薯大饑荒（1845-1852）雖然經常被視爲一場悲劇，但基本上沒有被學術界貼上種族滅絕的標籤。與此相反，大饑荒/蘇聯大饑荒（1932-1933年）卻被16個國家主動貼上了種族滅絕的標籤。這種差異背後的原因是什麼？"
    }
  ]
}