{
  "author": "Science_421",
  "original_created_utc": 1649392785,
  "title": "Is it normal to leave philosophy more confused than when I started?",
  "created_utc": 1649447720,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have studied many philosophy topics in epistemology, philosophy of mind, and philosophy of math. I started my investigations to find the correct answers. Now I have completed my studies and left more confused about the correct answers than when I started. Admittedly, I have learned a lot about the different positions and where their disagreements are so I am more knowledgeable. However, once I learned about how complicated the subjects are in reality, I just realized that I&amp;#39;m more confused and unsure of my position.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/askphilosophy/comments/tyvix4/is_it_normal_to_leave_philosophy_more_confused/",
  "subreddit": "askphilosophy",
  "id": "tyvix4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I have studied many philosophy topics in epistemology, philosophy of mind, and\nphilosophy of math. I started my investigations to find the correct answers. Now\nI have completed my studies and left more confused about the correct answers\nthan when I started. Admittedly, I have learned a lot about…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、認識論、心の哲学、そして多くの哲学のトピックを研究してきました。\n数学の哲学 正解を見つけるために調査を開始しました。今\n勉強を終えて、正解がわからなくなった。\n始めたときよりも 確かに、私は多くのことを学びました...",
      "title": "哲学を始めたときよりも混乱したままにしておくのが普通なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在认识论、心灵哲学和数学哲学方面研究过许多哲学课题。\n数学哲学。我开始了我的调查，以寻找正确的答案。现在\n我完成了我的研究，离开时对正确答案的困惑比我开始时更多。\n比我开始的时候更加困惑。不可否认的是，我已经学到了很多关于...",
      "title": "离开哲学时比我开始时更困惑，这正常吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在認識論、心靈哲學和數學哲學方面研究過許多哲學課題。\n數學哲學。我開始了我的調查，以尋找正確的答案。現在\n我完成了我的研究，離開時對正確答案的困惑比我開始時更多。\n比我開始的時候更加困惑。不可否認的是，我已經學到了很多關於...",
      "title": "離開哲學時比我開始時更困惑，這正常嗎？"
    }
  ]
}