{
  "author": "MonstarGaming",
  "the_new_excerpt": "> The Consumer Price Index for All Urban Consumers (CPI-U) increased 0.6 percent\n> in May on a seasonally adjusted basis after rising 0.8 percent in April, the\n> U.S. Bureau of Labor Statistics reported today. Over the last 12 months, the\n> all items index increased 5.0 percent before seasonal…",
  "original_created_utc": 1623329100,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "> 都市部全消費者向け消費者物価指数（CPI-U）は、0.6％上昇しました。\n> 4月に0.8％上昇した後、5月には季節調整済みベースで0.6％上昇しました。\n> 米国労働統計局が本日発表しました。過去12ヵ月間では\n> 全品目指数は、季節調整前で5.0％上昇しました。",
      "title": "消費者物価指数の概要"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "> 所有城市消费者的消费价格指数（CPI-U）上升了0.6%。\n> 经季节性调整后，5月份增长了0.6%，而4月份增长了0.8%。\n> 美国劳工统计局今天报告说。在过去的12个月中，>所有项目指数增长了5.0\n> 所有项目指数在季节性调整前增长了5.0%。",
      "title": "消费者价格指数摘要"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "> 所有城市消費者的消費價格指數（CPI-U）上升了0.6%。\n> 經季節性調整後，5月份增長了0.6%，而4月份增長了0.8%。\n> 美國勞工統計局今天報告說。在過去的12個月中，>所有項目指數增長了5.0\n> 所有項目指數在季節性調整前增長了5.0%。",
      "title": "消費者價格指數摘要"
    }
  ],
  "title": "Consumer Price Index Summary",
  "created_utc": 1623356547,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><blockquote>\n<p>The Consumer Price Index for All Urban Consumers (CPI-U) increased 0.6 percent in May on a seasonally adjusted basis after rising 0.8 percent in April, the U.S. Bureau of Labor Statistics reported today. Over the last 12 months, the all items index increased 5.0 percent before seasonal adjustment; this was the largest 12-month increase since a 5.4-percent increase for the period ending August 2008. </p>\n\n<p>The index for used cars and trucks continued to rise sharply, increasing 7.3 percent in May. This increase accounted for about one-third of the seasonally adjusted all items increase. The food index increased 0.4 percent in May, the same increase as in April. The energy index was unchanged in May, with a decline in the gasoline index again offsetting increases in the electricity and natural gas indexes. </p>\n\n<p>The index for all items less food and energy rose 0.7 percent in May after increasing 0.9 percent in April. Many of the same indexes continued to increase, including used cars and trucks, household furnishings and operations, new vehicles, airline fares, and apparel. The index for medical care fell slightly, one of the few major component indexes to decline in May. </p>\n\n<p>The all items index rose 5.0 percent for the 12 months ending May; it has been trending up every month since January, when the 12-month change was 1.4 percent. The index for all items less food and energy rose 3.8 percent over the last 12-months, the largest 12-month increase since the period ending June 1992. The energy index rose 28.5 percent over the last 12-months, and the food index increased 2.2 percent.</p>\n</blockquote>\n\n<p>Source: <a href=\"https://www.bls.gov/news.release/cpi.nr0.htm\">https://www.bls.gov/news.release/cpi.nr0.htm</a></p>\n</div><!-- SC_ON -->",
  "score": 39,
  "permalink": "/r/stocks/comments/nwmq0k/consumer_price_index_summary/",
  "subreddit": "stocks",
  "id": "nwmq0k",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009743442
}