{
  "author": "veryeducatedinvestor",
  "the_new_excerpt": "If there's anything I've learned about this sub, it's that posting anything\nbearish or related to selling will be downvoted into oblivion.\n\nI've made several \"caution\" type posts that are meant to advise keeping a level\nhead during this volatility, but none could ever be successful.\n\nEvery comment I…",
  "original_created_utc": 1621444640,
  "title": "This sub, and other crypto subs, are dangerous echo chambers where most bearish posts are downvoted into oblivion.",
  "created_utc": 1621452633,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If there&#39;s anything I&#39;ve learned about this sub, it&#39;s that posting anything bearish or related to selling will be downvoted into oblivion.</p>\n\n<p>I&#39;ve made several &quot;caution&quot; type posts that are meant to advise keeping a level head during this volatility, but none could ever be successful.</p>\n\n<p>Every comment I post in the daily about a position I had to cut is heavily downvoted. </p>\n\n<p>On the flip side, posting anything bullish will get you a ton of upvotes.</p>\n\n<p><strong>This sub and many others are dangerous echo chambers where being belligerently bullish is rewarded, and being level-headed is a controversial approach.</strong></p>\n\n<p>Please be cautious and try to keep a clear head when consuming all the content that is flying around right now.</p>\n</div><!-- SC_ON -->",
  "score": 14163,
  "permalink": "/r/CryptoCurrency/comments/ngbj84/this_sub_and_other_crypto_subs_are_dangerous_echo/",
  "subreddit": "CryptoCurrency",
  "id": "ngbj84",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590801371,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブで学んだことがあるとすれば、それは、何でも投稿することです。\n弱気や売りに関連するものは、忘却の彼方へとダウンボーティングされます。\n\n私は、「注意」タイプの投稿を何度かしました。\nしかし、この不安定な状況の中で、成功したものはありません。\n\nどのコメントも...",
      "title": "このサブや他の暗号サブは、ほとんどの弱気な投稿がdownvotedされ、忘却の彼方へ向かう危険なエコーチェンバーである。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果说我在这个子网站上学到了什么，那就是发布任何\n熊市或与卖出有关的帖子都会被降权遗忘。\n\n我已经发了几个 \"警告 \"类型的帖子，目的是建议大家在这种波动中保持冷静的头脑。\n脑袋，但没有一个能成功。\n\n我的每一条评论...",
      "title": "这个子频道和其他加密货币子频道是危险的回音室，大多数看跌的帖子都被降权到遗忘了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果說我在這個子網站上學到了什麼，那就是發佈任何\n熊市或與賣出有關的帖子都會被降權遺忘。\n\n我已經發了幾個 \"警告 \"類型的帖子，目的是建議大家在這種波動中保持冷靜的頭腦。\n腦袋，但沒有一個能成功。\n\n我的每一條評論...",
      "title": "這個子頻道和其他加密貨幣子頻道是危險的迴音室，大多數看跌的帖子都被降權到遺忘了。"
    }
  ]
}