{
  "author": "ANAL-Inverter-2000",
  "the_new_excerpt": "People here turn completely brain dead during every bull run. Usually there is a\nstrong consensus here on taking loans for buying bitcoin: ARE YOU A FUCKING\nIDIOT? But during the bull runs, you'll have a whole army of noobs trying to\nturn a Warren buffet on you saying shit like \"wHy sHouLdnT I tAkE…",
  "original_created_utc": 1622229973,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここの人々は、強気の動きのたびに完全に脳死状態になります。通常は\nビットコインを買うためにローンを組むことについて、ここでは強いコンセンサスが得られます。\nIDIOT？しかし、強気の相場の時には、ウォーレン・ビュッフェをあなたに向けようとする無知な人たちの軍団がいるでしょう。\nウォーレン・ビュッフェのようなことを言おうとする無名の人たちがいます。",
      "title": "慎重にお願いします。融資を受けてビットコインを購入しないでください。失ってもよいものだけを投資してください。noobに警告してください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这里的人在每一次牛市中都会变成完全的脑残。通常情况下，这里有一个\n这里对贷款购买比特币有一个强烈的共识：你是个该死的\n白痴吗？但在牛市期间，你会有一大群无知的人试图\n说什么 \"我为什么要买... \"之类的话。",
      "title": "请谨慎行事。请不要贷款购买比特币。请只投资你能承受的损失。请警告那些无名小卒。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這裏的人在每一次牛市中都會變成完全的腦殘。通常情況下，這裏有一個\n這裏對貸款購買比特幣有一個強烈的共識：你是個該死的\n白癡嗎？但在牛市期間，你會有一大羣無知的人試圖\n說什麼 \"我爲什麼要買... \"之類的話。",
      "title": "請謹慎行事。請不要貸款購買比特幣。請只投資你能承受的損失。請警告那些無名小卒。"
    }
  ],
  "title": "Please be cautious. Please do not take a loan to buy Bitcoin. Please only invest what you can afford to lose. Please warn the noobs.",
  "created_utc": 1622242539,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>People here turn completely brain dead during every bull run. Usually there is a strong consensus here on taking loans for buying bitcoin: <strong>ARE YOU A FUCKING IDIOT?</strong> But during the bull runs, you&#39;ll have a whole army of noobs trying to turn a Warren buffet on you saying shit like &quot;wHy sHouLdnT I tAkE A LoAN nUmBeR oNlY gO UP!&quot;</p>\n\n<p>Remember people. We are not <a href=\"/r/wsb\">/r/wsb</a>. We are not retards, we don&#39;t celebrate loss porn. Bitcoin is about financial freedom and debt is the fucking opposite of that. If you&#39;re stupid enough to buy the most volatile asset in the universe on leverage (which is what borrowing money is) you seriously need some help. We don&#39;t need you here, we don&#39;t need you to encourage others to follow your stupidity.</p>\n\n<p>Please everyone, educate the noobs and tell them not to play with fire. Bitcoin is an almost safe bet, if your time horizon is very long. If you spend what you CAN&#39;T afford to lose, you&#39;re gambling and you&#39;ll probably be REKT soon anyway. </p>\n\n<p>/rant</p>\n</div><!-- SC_ON -->",
  "score": 3035,
  "permalink": "/r/Bitcoin/comments/nn5ijm/please_be_cautious_please_do_not_take_a_loan_to/",
  "subreddit": "Bitcoin",
  "id": "nn5ijm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804293696
}