{
  "author": "reddash669",
  "original_created_utc": 1628475488,
  "title": "Why does my girlfriend's dad keep disrespecting me?",
  "created_utc": 1628483507,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>First, I&#39;m 17. Been with my girlfriend for almost a year. Each time I go to her dad&#39;s house, I get at least 3 jokes that are about my masculinity basically him trying to call me a pussy. One night it was just rapid fire and got really annoying. </p>\n\n<p>For example my girl was going upstairs to get something and said &quot;Stay here &#39;John&#39;&quot; to indicate she would be back quick. Her dad, from the other room, said &quot;Sit John. Lay down. Bark. Good boy&quot;. Later I was getting up and my girlfriend said &quot;put my phone on the couch for me?&quot; and her dad replied &quot;Who&#39;s the man in this relationship?&quot;.. Even though I was doing my girlfriend a simple favor like anyone would. </p>\n\n<p>There&#39;s more stuff, like asking &quot;what are you made of?&quot; if I say I don&#39;t like wasabi, pinching my arm between two fingers when my girl says I&#39;m getting stronger at the gym, etc. I usually just ignore but I&#39;d rather he just act with me like he would with anyone else. That kind of thing is annoying to me.</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/p0s8z5/why_does_my_girlfriends_dad_keep_disrespecting_me/",
  "subreddit": "NoStupidQuestions",
  "id": "p0s8z5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "First, I'm 17. Been with my girlfriend for almost a year. Each time I go to her\ndad's house, I get at least 3 jokes that are about my masculinity basically him\ntrying to call me a pussy. One night it was just rapid fire and got really\nannoying.\n\nFor example my girl was going upstairs to get…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "まず、私は17歳です。彼女と付き合ってもうすぐ1年になります。彼女の父親の家に行くたびに\nるたびに、少なくとも3つのジョークを言われます。\n俺のことを女々しいと言ってくる。ある夜、それが連発されて、本当に腹が立ちました。\nイライラした。\n\n例えば、僕の彼女が2階に上がって...",
      "title": "なぜガールフレンドのお父さんは私を見下し続けるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "首先，我是17岁。和我的女朋友在一起快一年了。每次我去她\n我每次去她爸爸家，都会收到至少3个关于我的阳刚之气的笑话，基本上他都会说我是个娘们。\n试图叫我 \"娘娘腔\"。有一天晚上，它只是快速发射，并得到了真正的\n烦人的。\n\n例如，我的女孩要上楼去拿...",
      "title": "为什么我女朋友的爸爸总是不尊重我？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，我是17歲。和我的女朋友在一起快一年了。每次我去她\n我每次去她爸爸家，都會收到至少3個關於我的陽剛之氣的笑話，基本上他都會說我是個娘們。\n試圖叫我 \"娘娘腔\"。有一天晚上，它只是快速發射，並得到了真正的\n煩人的。\n\n例如，我的女孩要上樓去拿...",
      "title": "爲什麼我女朋友的爸爸總是不尊重我？"
    }
  ]
}