{
  "author": "zenoblade",
  "the_new_excerpt": "I have what is probably a unique situation. I work as a faculty member at a\nuniversity on the first floor of the business school. Although I’m not in\nbusiness or finance, my office is about a few doors down from a few Bloomberg\nterminals. Recently, they opened up a Bloomberg certification program…",
  "original_created_utc": 1621135544,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私には、おそらくユニークな状況があります。私はある大学で教員として働いています。\n大学のビジネススクールの1階で教員をしています。私はビジネスや金融の分野ではありませんが\n私はビジネスや金融の仕事をしているわけではありませんが、私のオフィスの数軒隣にはブルームバーグの端末があります。\n端末があります。最近、ブルームバーグの認定プログラムが開設されました...",
      "title": "個人投資家にとって、ブルームバーグの端末はどのように役立つのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我有一个可能是独特的情况。我作为一名教师在一所大学的商学院一楼工作。\n在大学的商学院一楼工作。虽然我不是从事\n虽然我不是从事商业或金融工作，但我的办公室离几个彭博社的终端机只有几步之遥。\n终端。最近，他们开设了一个彭博认证项目...",
      "title": "彭博终端对个人投资者有多大作用？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我有一個可能是獨特的情況。我作爲一名教師在一所大學的商學院一樓工作。\n在大學的商學院一樓工作。雖然我不是從事\n雖然我不是從事商業或金融工作，但我的辦公室離幾個彭博社的終端機只有幾步之遙。\n終端。最近，他們開設了一個彭博認證項目...",
      "title": "彭博終端對個人投資者有多大作用？"
    }
  ],
  "title": "How useful is a Bloomberg terminal for an individual investor?",
  "created_utc": 1621168637,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have what is probably a unique situation. I work as a faculty member at a university on the first floor of the business school. Although I’m not in business or finance, my office is about a few doors down from a few Bloomberg terminals. Recently, they opened up a Bloomberg certification program for free to the faculty. </p>\n\n<p>I am wondering if this is actually useful training for an individual investor? I don’t manage too many individual stocks but do have some. Is the information provided worth taking the time to complete the training?</p>\n</div><!-- SC_ON -->",
  "score": 119,
  "permalink": "/r/stocks/comments/ndfeng/how_useful_is_a_bloomberg_terminal_for_an/",
  "subreddit": "stocks",
  "id": "ndfeng",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590804455
}