{
  "author": "JacobWedderburn",
  "original_created_utc": 1626429426,
  "title": "Covid decimated our multi-million $ startup...so we built a side project social enterprise in no-code and got it to $5k MRR during lockdown, here's how. It's second on product hunt at time of posting!",
  "created_utc": 1626434401,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Treepoints is live on ProductHunt today: <a href=\"https://www.producthunt.com/posts/treepoints\">https://www.producthunt.com/posts/treepoints</a></p>\n\n<p>The TL;DR is pretty much as the title says, read on to find out more! Curious how other founders who&#39;ve been crushed by covid have coped, do share your stories!</p>\n\n<p><strong>PRE-COVID -</strong> <a href=\"https://stasher.com/\"><strong>STASHER</strong></a></p>\n\n<p>I am the co-founder of a business called Stasher, having started it with my college roommate just after graduating. It&#39;s a travel platform that connects people with local businesses who can store their luggage for the day. The typical use-case is when you&#39;ve stayed at an Airbnb in a major city and got kicked out at 10am but have no where to leave your stuff. You can book with a nearby hotel through us and leave your bags, fully insured :)</p>\n\n<p>There were ups and downs along the way, as any startup, but overall things were going pretty swimmingly in 2019 going into 2020. We&#39;d turned over &gt;$2m in 2019 and the first months of 2020 were more than 2x on the previous year, so we were hoping to hit $5m. We&#39;d also just brought in $2m of equity financing and grown the team to 20ish.</p>\n\n<p>Then covid struck.</p>\n\n<p>As a business that:<br/>\n1 - primarily serviced urban leisure travellers<br/>\n2 - primarily worked with local hospitality/retail businesses as our hosts<br/>\n...<br/>\nthis was pretty much the worst imaginable situation for our business. Not only did demand plummet, but most of our hosts were forced to close by lockdowns (and we feared many wouldn&#39;t come back). Revenues went from $150k in Feb 2020 to literal $0 in April 2020 (so I guess decimated is technically an understatement). We were also named in the Forbes 30u30 for Europe in March/April. That was pretty ironic timing...</p>\n\n<p>As the endless optimists you need to be, to be founders, we remained hopeful. Our business had genuine product market fit pre-pandemic, we luckily had money in the bank and there was a ton of government salary-support in the UK that ideally suited an asset light business model like ours. Initially, this looked like a few months for us to work through some tech debt before getting back on track by late summer...after all the mantra we kept hearing was &#39;a few weeks of lockdown to flatten the curve&#39;. We saw some gradual return over the summer which took us to about 10% of previous year&#39;s performance, and we started getting hopeful that 2021 would be a return to normal...</p>\n\n<p>Then September hit, cases started rising and all the headlines of &#39;2nd waves&#39; started landing. Our presumed return stalled and we dipped from our lowly 10% back down to single digit %&#39;s of 2019. I said before there were ups and downs, but this was probably the most frustrated I&#39;d ever felt. We&#39;d given so much to build this company, all banking on the equity value, and it was just slipping away. 4 years felt wasted and the impostor syndrome we&#39;d only just got over set back in. Also, we were deeply jealous and resentful of all the ecommerce and tele-communications businesses who were enjoying this situation all so much - being the type extroverted person who thrived off our office culture really was just the cherry on top.</p>\n\n<p><strong>LAUNCHING A SOCIAL ENTERPRISE DURING LOCKDOWNS</strong></p>\n\n<p>At this point, my co-founder and I sat down to think. We&#39;d of course discussed whether there was a pivot available before and decided there was nothing worthwhile. People love idolizing pivots within startups but the truth is that, at the stage we were at having raised a few rounds, a pivot just didn&#39;t make much sense. There was no pivot-idea that we felt confident our existing assets could give us a disproportionate advantage in and if we were going to make a very distant pivot then we would have been better off starting a new corporate structure rather than start out diluted. On top of this, we still felt confident that on a 5-year horizon Stasher was a super solid business, so giving up what we had at hand was a serious consideration.</p>\n\n<p>However, for the sake of both of our mental health, we decided that we needed something to work on that wasn&#39;t dependent on covid lifting to succeed. We&#39;d always fancied the idea of following the classic entrepreneurs path. Step 1 - financial security, Step 2 - maximize doing good through your work. We&#39;d missed Step 1...but screw it, time for Step 2!</p>\n\n<p>We did some brainstorming on the 2 topics we cared about: financial inequity and climate change. Eventually we got to the idea for <a href=\"https://treepoints.green/\">Treepoints</a>. To get to this idea (and explore a few others) we basically did a bunch of research on the topics that interested us. We realized that there are great planet-positive initiatives around the world (tree planting, carbon offsetting, plastic recycling), but it&#39;s hard to simply contribute to all of these while seeing your impact. Also, aggregating demand and purchasing at scale meant that we could access much better prices for individuals. Finally, we thought that adding a rewards functionality would help to incentive doing good and be a great way to generate partnerships with major brands who want to be more sustainable.</p>\n\n<p>How would we square this with <a href=\"http://stasher.com/\">Stasher.com</a>? We resolved to speak with our investors, who&#39;d been great and understanding throughout, and explain that we wanted to set this up as a separate corporate entity, a social enterprise (at least 50% of profits support the same causes), and focus our attention on it until Stasher&#39;s demand returned. Stasher itself would be a shareholder to keep everyone aligned. Given the circumstances, everyone was happy for us to do this. The only concern was if both businesses ended up doing well, but we resolved that this would be a good problem to have.</p>\n\n<p>We had the idea, we had support and the time...now just one problem. How do 2 non-technical founders make this product?</p>\n\n<p><strong>DISCOVERING THE WORLD OF NO-CODE</strong></p>\n\n<p>We&#39;d both always wanted to learn more web development. We have the coding basics down and can hack together a scraper and other useful scripts, but couldn&#39;t create whole websites. Neither of us wanted to be full time developers, just good enough to bring our ideas to life. While exploring how we&#39;d learn to build this platform sufficiently, we came across <a href=\"http://bubble.io/\">Bubble.io</a> and our minds were blown. It was addictive, simple and fast and ideally filled the gap that we always wanted coding to fill for us, just getting our ideas out into the world in their earliest forms.</p>\n\n<p>We spent 2 weeks locked together in an apartment working from morning to evening to get the first version of the website live and, along with our closest friends and family, set up our first subscriptions...but wow was it ever ugly. Through gradual improvement over that first month, we managed to get MRR up to just under $1k by Dec 2020!</p>\n\n<p><strong>LAUNCHING PAINS</strong></p>\n\n<p>We did realize some difficulties at this point though (and it was just the pain of the early days of launching a startup all over). Building trust with our crappy website was hard and, new to us, selling an aspirational product like this was very different to our experience trying to sell a utility product like luggage storage through <a href=\"http://stasher.com/\">Stasher.com</a>. Customer subscription MRR growth trundled along slowly and we resolved to do 3 things.</p>\n\n<p>Firstly, we thought we had enough validation to talk to the Stasher investors about using some money to get the website rebuilt by an agency. We found <a href=\"https://www.ideable.co/\">ideable.co</a> and decided to partner to release the new version of our website. WOW did it look better once it was launched (the current state you&#39;ll see, which hopefully you agree is acceptably pro looking).</p>\n\n<p>Secondly, we realized that many businesses were interested in integrating our service via API and direct invoices, so we built a simple backend to facilitate this, as well as shopify app (still pending on the public store, but in many cases integrated directly). This ended up being an excellent product addition and was much easier to sell! Revenue jumped significantly since launch and several integrations going live, including a launch with a FTSE 250 company: <a href=\"https://www.bigyellow.co.uk/treeplanting/\">Big Yellow Storage - tree planting</a>! This isn&#39;t billed via stripe so doesn&#39;t appear in the graph above.</p>\n\n<p>Finally, we started to lean into our rewards ecosystem to try and grow our user subscriptions. By pre-purchasing gift cards from relevant partners (like Brewdog) in exchange for social shares through their large accounts, and gifting these vouchers as sign up rewards to new users we managed to run small campaigns that quickly returned &gt;$1k ARR in single day launches. That&#39;s what causes that big spike in the customer subscriptions graph above around May time.</p>\n\n<p>In all this has brought us to where we are now. To date, we&#39;ve offset more than 1000 tonnes of CO2 and counting, as well as having planted over 20k trees (well over half of which were in the last month). Between subscriptions, direct invoices and API integrations, we also managed to to surpass $5k in revenue for the last 2 months (some bills are quarterly or annual, so it&#39;s a little variable).</p>\n\n<p>To top things all off, with the vaccine leading to things reopening, we&#39;re finally seeing Stasher have meaningful returns to form with close to 20% of 2019 revenues being achieved. We believe that 2022 will finally be the year that we ACTUALLY return to normal on that front :)</p>\n\n<p>It seems we&#39;ve now got the difficult position of having 2 business going well in the end...maybe covid wasn&#39;t all bad. At least we were pushed to do something we otherwise may not have...but don&#39;t get me wrong I&#39;d have been glad for Stasher to just be turning over $10m+ right now!</p>\n\n<p>Hopefully you can learn something from this story, or just found it interesting! Feel free to share your thoughts and experiences below :) Feel free to reach me at [<a href=\"mailto:jacob@treepoints.green\">jacob@treepoints.green</a>](mailto:<a href=\"mailto:jacob@treepoints.green\">jacob@treepoints.green</a>) if you&#39;re interested in the API, a business or personal subscription and have any further questions!</p>\n</div><!-- SC_ON -->",
  "score": 8,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/0G0G8A9lS58GjAdkCFwCC9DGquoSUnhr6hSECZK1XXQ.jpg?auto=webp&s=c246c91db978a6ffee98cdc5996467893d3828f7",
          "width": 1024,
          "height": 512
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/0G0G8A9lS58GjAdkCFwCC9DGquoSUnhr6hSECZK1XXQ.jpg?width=108&crop=smart&auto=webp&s=8a16fb2d5768fd0f249f6427056945cfb20c8aa3",
            "width": 108,
            "height": 54
          },
          {
            "url": "https://external-preview.redd.it/0G0G8A9lS58GjAdkCFwCC9DGquoSUnhr6hSECZK1XXQ.jpg?width=216&crop=smart&auto=webp&s=a11e3313388e61ad94145c37af9285cdf030ecec",
            "width": 216,
            "height": 108
          },
          {
            "url": "https://external-preview.redd.it/0G0G8A9lS58GjAdkCFwCC9DGquoSUnhr6hSECZK1XXQ.jpg?width=320&crop=smart&auto=webp&s=724b6eb843017146917ee95544be6ba6e94458c8",
            "width": 320,
            "height": 160
          },
          {
            "url": "https://external-preview.redd.it/0G0G8A9lS58GjAdkCFwCC9DGquoSUnhr6hSECZK1XXQ.jpg?width=640&crop=smart&auto=webp&s=49d348c41b805737f86b091ab054c97223d0fdab",
            "width": 640,
            "height": 320
          },
          {
            "url": "https://external-preview.redd.it/0G0G8A9lS58GjAdkCFwCC9DGquoSUnhr6hSECZK1XXQ.jpg?width=960&crop=smart&auto=webp&s=d67fce8f208727e3cafb619510197251a9188aaf",
            "width": 960,
            "height": 480
          }
        ],
        "variants": {},
        "id": "l8HcKJ1WO2_uX1G2t3-sUbuHf9YiSGsrnl6Lbs4T5bw"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/SideProject/comments/oldrse/covid_decimated_our_multimillion_startupso_we/",
  "subreddit": "SideProject",
  "id": "oldrse",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Treepoints is live on ProductHunt today:\nhttps://www.producthunt.com/posts/treepoints\n\nThe TL;DR is pretty much as the title says, read on to find out more! Curious\nhow other founders who've been crushed by covid have coped, do share your\nstories!\n\nPRE-COVID - STASHER [https://stasher.com/]\n\nI am…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Treepointsは本日、ProductHuntでライブ配信されました。\nhttps://www.producthunt.com/posts/treepoints\n\nTL;DRはタイトル通りですが、詳細はこちらをご覧ください。好奇心\nCovidに潰された他の創業者がどのように対処したか興味がありますか？\n話を聞かせてください。\n\nCovid導入前 - Stasher [https://stasher.com/]\n\n私は...",
      "title": "Covidは、数百万ドル規模のスタートアップ企業を壊滅させました...だから私たちは、サイドプロジェクトの社会的企業をノーコードで構築し、ロックダウン中にMRRを5千ドルにまで引き上げました。この記事を投稿した時点では、製品検索で2位になっています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Treepoints今天在ProductHunt上线。\nhttps://www.producthunt.com/posts/treepoints\n\nTL;DR就像标题所说的那样，请继续阅读以了解更多信息。好奇心\n其他被Covid压垮的创始人是如何应对的，请分享你的\n故事!\n\nCovid之前--Stasher [https://stasher.com/]\n\n我是...",
      "title": "Covid摧毁了我们价值数百万美元的创业公司......所以我们在没有代码的情况下建立了一个副业社会企业，并在封锁期间使其达到了5千美元的MRR，以下是方法。在发帖时，它在产品搜索中排名第二!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Treepoints今天在ProductHunt上線。\nhttps://www.producthunt.com/posts/treepoints\n\nTL;DR就像標題所說的那樣，請繼續閱讀以瞭解更多信息。好奇心\n其他被Covid壓垮的創始人是如何應對的，請分享你的\n故事!\n\nCovid之前--Stasher [https://stasher.com/]\n\n我是...",
      "title": "Covid摧毀了我們價值數百萬美元的創業公司......所以我們在沒有代碼的情況下建立了一個副業社會企業，並在封鎖期間使其達到了5千美元的MRR，以下是方法。在發帖時，它在產品搜索中排名第二!"
    }
  ]
}