{
  "author": "ipetgoat1984",
  "original_created_utc": 1645882297,
  "title": "You can’t cry for decentralization and then cry that Russia is leaning on crypto to bypass sanctions.",
  "created_utc": 1645890195,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It just doesn’t work like that. It’s either decentralized or it’s not. You don’t get to pick and choose when or why it’s decentralized just because you don’t agree with the use case. &lt;/p&gt;\n\n&lt;p&gt;Obviously, it sucks that psychopaths take to crypto to hide illicit activity, and that it gets publicized in a way that paints crypto in a bad light. But if we want crypto to maintain its autonomous decentralization, we have to accept all of its shortcomings. &lt;/p&gt;\n\n&lt;p&gt;Crypto scares the shit out of the powers that be for all the reasons we love it. It gives power back to the people, unfortunately there&amp;#39;s bad people out there and fear sells, so the media likes to focus on it.&lt;/p&gt;\n\n&lt;p&gt;I don’t agree with anything that’s going on in Russia right now, but I do believe in crypto maintaining its decentralization.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 467,
  "permalink": "/r/CryptoCurrency/comments/t1x698/you_cant_cry_for_decentralization_and_then_cry/",
  "subreddit": "CryptoCurrency",
  "id": "t1x698",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "It just doesn’t work like that. It’s either decentralized or it’s not. You don’t\nget to pick and choose when or why it’s decentralized just because you don’t\nagree with the use case.\n\nObviously, it sucks that psychopaths take to crypto to hide illicit activity,\nand that it gets publicized in a way…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そういうわけにはいかないんです。分散型かそうでないか、どちらかです。そうではなく\nを選択することができます。\n使用例に同意する。\n\n明らかに、サイコパスが不正な活動を隠すために暗号を利用するのは最悪です。\nそして、それがある意味で公表されること...。",
      "title": "非中央集権を叫びながら、ロシアが制裁を回避するために暗号に傾倒していると叫ぶのは無理な話です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "它只是没有像那样工作。它要么是分散的，要么是不分散的。你不能\n你不能因为你不同意，就去选择什么时候或为什么是分散的。\n你不能因为你不同意这个用例而选择什么时候或为什么是分散的。\n\n显然，精神病患者利用加密货币来隐藏非法活动，这很糟糕。\n而且，它被公开的方式...",
      "title": "你不能一边喊着去中心化，一边喊着俄罗斯靠加密货币来绕过制裁。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "它只是沒有像那樣工作。它要麼是分散的，要麼是不分散的。你不能\n你不能因爲你不同意，就去選擇什麼時候或爲什麼是分散的。\n你不能因爲你不同意這個用例而選擇什麼時候或爲什麼是分散的。\n\n顯然，精神病患者利用加密貨幣來隱藏非法活動，這很糟糕。\n而且，它被公開的方式...",
      "title": "你不能一邊喊着去中心化，一邊喊着俄羅斯靠加密貨幣來繞過制裁。"
    }
  ]
}