{
  "author": "Thecoolestguyyoukno",
  "the_new_excerpt": "Anyone ever have people happy when the crypto market takes a dip? When I arrived\nat work today there was a couple guys standing there with big smiles on their\nface. \"Did you see what happened to your bitcoin over the weekend?\" I sold my\nbitcoin awhile back but they don't know that. I just said \"I…",
  "original_created_utc": 1618835790,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号市場が下落したときに、人々が喜んだことがある人はいますか？今日、会社に到着すると\n笑顔で立っているカップルがいました。\n顔をしていました。\"週末に自分のビットコインがどうなったか見たか？\" 私はしばらく前にビットコインを売りました。\n私はしばらく前にビットコインを売ったのですが、彼らはそれを知りませんでした。私はただ「私...",
      "title": "同僚が私の暗号化の損失を喜んでいる"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有谁在加密市场出现下滑时，有人高兴过？当我来到\n在今天的工作中有一对夫妇的家伙站在那里，他们的大笑。\n脸。\"你看到周末你的比特币发生了什么吗？\" 我把我的\n比特币前段时间，但他们不知道。我只是说 \"我...",
      "title": "同事为我的加密亏损感到高兴"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有誰在加密市場出現下滑時，有人高興過？當我來到\n在今天的工作中有一對夫婦的傢伙站在那裏，他們的大笑。\n臉。\"你看到週末你的比特幣發生了什麼嗎？\" 我把我的\n比特幣前段時間，但他們不知道。我只是說 \"我...",
      "title": "同事爲我的加密虧損感到高興"
    }
  ],
  "title": "Coworkers happy for my crypto losses",
  "created_utc": 1618846229,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Anyone ever have people happy when the crypto market takes a dip? When I arrived at work today there was a couple guys standing there with big smiles on their face. &quot;Did you see what happened to your bitcoin over the weekend?&quot;  I sold my bitcoin awhile back but they don&#39;t know that. I just said &quot;I sold all mine on Friday and bought back on Sunday&quot; Which was true just not bitcoin but that was beside the point. Made my freaking day to see their smiles fade and hear their voices go monotone as they congratulated me. Why in the world would you be so happy if you thought someone lost a lot of money? It&#39;s not like I brag about it either they ask I answer that&#39;s it.</p>\n</div><!-- SC_ON -->",
  "score": 2186,
  "permalink": "/r/CryptoCurrency/comments/mtzng0/coworkers_happy_for_my_crypto_losses/",
  "subreddit": "CryptoCurrency",
  "id": "mtzng0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171521482
}