{
  "author": "ottolouis",
  "original_created_utc": 1629551451,
  "title": "In WWI, France held on for four years, and wound up winning. In WWII, France could barely hold on for four weeks, and wound up losing. What was the difference?",
  "created_utc": 1629604009,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I understand that in WWII, the Germans made a bold move to push five panzer divisions through the Ardennes Forest. This push was successful and wound up breaking through the French line. The line was unable to reform, hence there was the retreat to Dunkirk, and the remaining French forces were too meager to hold off the rest of the Germans. Does the push through the Ardennes basically describe the entire failure of the French in WWII? Could one say that advancements in the speed and armor of tanks made the Ardennes maneuver possible, and it would have been implausible in WWI? Is technology ultimately the difference between French success and failure in the World Wars?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/p8r700/in_wwi_france_held_on_for_four_years_and_wound_up/",
  "subreddit": "AskHistorians",
  "id": "p8r700",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I understand that in WWII, the Germans made a bold move to push five panzer\ndivisions through the Ardennes Forest. This push was successful and wound up\nbreaking through the French line. The line was unable to reform, hence there was\nthe retreat to Dunkirk, and the remaining French forces were too…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "第二次世界大戦では、ドイツ軍は思い切って5つのパンツァー師団をアルデンヌの森に押し込んだそうですね。\nアルデンヌの森に5個のパンツァーを投入しました。この作戦は成功し、フランス軍の戦線を突破しました。\nフランス軍の前線を突破しました。ラインは再編成できず、そのために\nダンケルクへの退却が行われ、残ったフランス軍も...。",
      "title": "第一次世界大戦では、フランスが4年間持ちこたえて勝利を収めた。第二次世界大戦では、フランスは4週間持ちこたえるのがやっとで、結局負けてしまいました。その違いは何だったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "据我所知，在第二次世界大战中，德国人做了一个大胆的举动，将五个装甲师推过阿登森林。\n逼迫五个装甲师通过阿登森林。这次推进是成功的，最终\n突破了法国的防线。这条防线无法重整，因此出现了\n撤退到敦刻尔克，而剩余的法国部队也被...",
      "title": "在一战中，法国坚持了四年，并最终取得了胜利。在二战中，法国勉强坚持了四个星期，最后输了。两者的区别是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "據我所知，在第二次世界大戰中，德國人做了一個大膽的舉動，將五個裝甲師推過阿登森林。\n逼迫五個裝甲師通過阿登森林。這次推進是成功的，最終\n突破了法國的防線。這條防線無法重整，因此出現了\n撤退到敦刻爾克，而剩餘的法國部隊也被...",
      "title": "在一戰中，法國堅持了四年，並最終取得了勝利。在二戰中，法國勉強堅持了四個星期，最後輸了。兩者的區別是什麼？"
    }
  ]
}