{
  "author": "sgtslaughterTV",
  "the_new_excerpt": "I feel as though it is only necessary to compliment that top thread in\n/r/bitcoin.\n\nWe try to create quality discussion. This sub has rules that we don't want to\nmake increasingly stringent, but may have no choice but to make increasingly\nstringent. The last thing we want to do is allow discussion…",
  "original_created_utc": 1615946879,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我觉得好像只需要赞美一下那条最上面的线就可以了。\n/r/bitcoin.\n\n我们努力创造高质量的讨论。这个分论坛有我们不希望看到的规则。\n越来越严格，但可能别无选择，只能做出越来越多的\n严格的。我们最不希望做的就是允许讨论... The last thing we want to do is allow discussion...",
      "title": "/r/cryptocurrency不是/r/wallstreetbets或/biz/。我们的目标是在这里创造高质量的讨论。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我覺得好像只需要讚美一下那條最上面的線就可以了。\n/r/bitcoin.\n\n我們努力創造高質量的討論。這個分論壇有我們不希望看到的規則。\n越來越嚴格，但可能別無選擇，只能做出越來越多的\n嚴格的。我們最不希望做的就是允許討論... The last thing we want to do is allow discussion...",
      "title": "/r/cryptocurrency不是/r/wallstreetbets或/biz/。我們的目標是在這裏創造高質量的討論。"
    }
  ],
  "title": "/r/cryptocurrency is NOT /r/wallstreetbets or /biz/. We aim to create quality discussion here.",
  "created_utc": 1615973945,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I feel as though it is only necessary to compliment that top thread in <a href=\"/r/bitcoin\">/r/bitcoin</a>. </p>\n\n<p>We try to create quality discussion. This sub has rules that we don&#39;t want to make increasingly stringent, but may have no choice but to make increasingly stringent. The last thing we want to do is allow discussion that would result in this sub becoming quarantined, if not outright banned.                </p>\n\n<p>Some commonly overlooked reasons why we might remove threads in this sub, for clarity&#39;s sake:<br/>\n1) repost.<br/>\n2) If the coin in your post is not BTC or ETH, but is in the top 50, we only allow 2 posts about it on the front page.<br/>\n3) listing posts are prohibited. Imagine every day when a new coin hits uniswap...<br/>\n4) referral codes are strictly forbidden.<br/>\n5) All other reasons why we might remove threads can be found in our <a href=\"https://www.reddit.com/r/Cryptocurrency/wiki/expanded_rules\">expanded rules</a>.                 </p>\n\n<p>EDIT: The awards are appreciated as always, guys.             </p>\n\n<p>EDIT 2: I feel like the sub is slightly becoming a hivemind of conflicting ideologies, &quot;I made so much money that ____ event happened in my life&quot; types of posts, and little else. While there is nothing wrong with these posts I feel like if that&#39;s the only content we&#39;re seeing on the front page, then we could be neglecting important info that is relative to any crypto projects out there. Imagine the next polkadot or cardano is up and coming on coingecko, but there are some users that only browse CMC and this sub - which has a few of those posts I just mentioned in this edit.                  </p>\n\n<p>EDIT 3: We are always open to suggestions and healthy discussion about how to run this sub. Your feedback is welcome.</p>\n</div><!-- SC_ON -->",
  "score": 381,
  "permalink": "/r/CryptoCurrency/comments/m6pke3/rcryptocurrency_is_not_rwallstreetbets_or_biz_we/",
  "subreddit": "CryptoCurrency",
  "id": "m6pke3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147378437
}