{
  "author": "ReinhardtEichenvalde",
  "the_new_excerpt": "Ok, as just a causual observer who has been subbed to a bunch of different stock\nrelating subs including securityanalysis, investing, stocks, stockmarket, and\nyes even wallstreetbets. I always had a wide range of posts on my feed with\ndifferent quality posts. Before the whole GME ordeal I actually…",
  "original_created_utc": 1613008635,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，作为一个被分到一堆不同股票的偶然观察者来说\n相关子包括证券分析，投资，股票，股市，和。\n是的，甚至华尔街日报。我总是有一个广泛的帖子在我的饲料与\n不同质量的职位。在整个GME的考验之前，我其实... ...",
      "title": "这个子的质量已经下滑了一段时间了，但是双倍的数据，我觉得版主需要开始做一些重大的改革了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，作爲一個被分到一堆不同股票的偶然觀察者來說\n相關子包括證券分析，投資，股票，股市，和。\n是的，甚至華爾街日報。我總是有一個廣泛的帖子在我的飼料與\n不同質量的職位。在整個GME的考驗之前，我其實... ...",
      "title": "這個子的質量已經下滑了一段時間了，但是雙倍的數據，我覺得版主需要開始做一些重大的改革了。"
    }
  ],
  "title": "This sub has been dipping in quality for a while, but with double the numbers I think the mods need to start doing some major reforms.",
  "created_utc": 1613018701,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Ok, as just a causual observer who has been subbed to a bunch of different stock relating subs including securityanalysis, investing, stocks, stockmarket, and yes even wallstreetbets. I always had a wide range of posts on my feed with different quality posts. Before the whole GME ordeal I actually found most of the subs to be at least 30 percent quality posts on an average day, with stocks being more close to around 60 percent. These are based on the top threads I would look at when browsing the subreddit. </p>\n\n<p>Nowadays stocks seems to be going through a &quot;DD renassaince&quot; where people are posting DD about any company that catches their eye. My problem is a lot of them aren&#39;t actually due diligence and mostly akin to affiliate marketing. You can tell who is just trying to pump up their stock  so they can get a bunch of new investors before they can move on to their next play. </p>\n\n<p>I have a few suggestions for the mods but of course they aren&#39;t perfect, I&#39;m just brainstorming. </p>\n\n<ol>\n<li>Several flairs will require character limits. We don&#39;t need three paragraph DD&#39;s, or constant speculation without discussion. I think any flair relating to a company or industry should have a minimum of 10,000 characters. Mods can play around with the character limits but if someone can&#39;t even make up that much which in alll honestly is a 5 min read on an average blog page, then they aren&#39;t looking for a discussion. They are creating an ad. </li>\n<li>There should be a new rule that every DD, must include at least ONE negative thing about the company in which they are talking about, whether it be debt, competition etc. Perfect unicorn companies are once in a blue moon. EVERY company has faults, the point is how they deal with those faults and overcome them. </li>\n<li>There should be weekly megathreads to contain discussion of whatever stock of the week there is. </li>\n</ol>\n\n<p>These of course are all just suggestions, and I invite anyone to offer their own suggestions as I want to see this sub grow properly and not turn into a wallstreetbets or pumpandump.</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/stocks/comments/lha319/this_sub_has_been_dipping_in_quality_for_a_while/",
  "subreddit": "stocks",
  "id": "lha319",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123205009
}