{
  "author": "AttilatheHawn",
  "original_created_utc": 1642774706,
  "title": "Why don’t all/most young men freeze their sperm and then get a vasectomy?",
  "created_utc": 1642783835,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As a young dude, freezing my sperm and then getting a vasectomy seems like an obvious choice. I’d never have to worry about pregnancy or contraceptives again, and if/when I want kids, I’ve got my sperm on-hand. And even then vasectomies are usually reversible, so it seems extremely low risk. That being said, I never hear about dudes going through this process, which makes me think I must be missing something. Why doesn’t everyone do this/ Is it as straight forward as it seems?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 182,
  "permalink": "/r/TooAfraidToAsk/comments/s9bqte/why_dont_allmost_young_men_freeze_their_sperm_and/",
  "subreddit": "TooAfraidToAsk",
  "id": "s9bqte",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "As a young dude, freezing my sperm and then getting a vasectomy seems like an\nobvious choice. I’d never have to worry about pregnancy or contraceptives again,\nand if/when I want kids, I’ve got my sperm on-hand. And even then vasectomies\nare usually reversible, so it seems extremely low risk. That…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "若い男としては、精子を凍らせてからパイプカットをするのがいいようです。\n当然の選択です。もう妊娠や避妊の心配をする必要はないのだから。\nそして、いつ子供が欲しくなっても、私の精子は手元にあるのです。それでも精管切除は\nは通常、元に戻すことができるので、極めてリスクが低いと思われます。それは...",
      "title": "なぜ、すべての／ほとんどの若い男性は、精子を凍結してからパイプカットをしないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "作为一个年轻的男人，冷冻我的精子，然后做输精管切除术似乎是一个明显的选择。\n明显的选择。我再也不用担心怀孕或避孕药具的问题了。\n如果/当我想要孩子的时候，我有我的精子在手。即使如此，输精管切除术\n通常是可逆的，所以它看起来风险极低。那...",
      "title": "为什么所有/大多数年轻男子不冷冻他们的精子，然后进行输精管结扎？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "作爲一個年輕的男人，冷凍我的精子，然後做輸精管切除術似乎是一個明顯的選擇。\n明顯的選擇。我再也不用擔心懷孕或避孕藥具的問題了。\n如果/當我想要孩子的時候，我有我的精子在手。即使如此，輸精管切除術\n通常是可逆的，所以它看起來風險極低。那...",
      "title": "爲什麼所有/大多數年輕男子不冷凍他們的精子，然後進行輸精管結紮？"
    }
  ]
}