{
  "author": "thetechdoc",
  "original_created_utc": 1637670232,
  "title": "How does one remove live cockroaches from a coffee machine?",
  "created_utc": 1637677272,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So this morning I went to empty my coffee machine tray of excess water and saw 2 big ones and a few small babies run back up into the machine, after 20 minutes of screaming and fear I got the dam thing and put it outside, pulled out the tray and sprayed some bug spray in the tray I saw them in, now the machine is outside and I have no idea what to do.</p>\n\n<p>Now I&#39;m an it tech and I&#39;ve seen my fair share of cockroaches inside laptops and desktops etc from customers, but that&#39;s easy to deal with, you bomb it with bug spray, bag it and clean out the results, but like...this is a food irem, I can&#39;t just open it up and bomb it cus I don&#39;t think it&#39;s possible to clean it well enough to be food safe again, </p>\n\n<p>What can I do to get them out of there? Is there some sort of bait I can give them that they&#39;ll bring back to their nest or something ?? </p>\n\n<p>I&#39;m disgusted this has happened and I blame the god dam bins being so close to my apartment, even though I&#39;ve told the landlord so many times that it causes us all issues.</p>\n\n<p>Any solution??</p>\n\n<p>Thanks!</p>\n</div><!-- SC_ON -->",
  "score": 305,
  "permalink": "/r/NoStupidQuestions/comments/r0c1u9/how_does_one_remove_live_cockroaches_from_a/",
  "subreddit": "NoStupidQuestions",
  "id": "r0c1u9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So this morning I went to empty my coffee machine tray of excess water and saw 2\nbig ones and a few small babies run back up into the machine, after 20 minutes\nof screaming and fear I got the dam thing and put it outside, pulled out the\ntray and sprayed some bug spray in the tray I saw them in, now…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今朝、コーヒーメーカーのトレイに溜まった水を捨てに行くと、2匹の大きな子と数匹の小さな子が\n20分後、悲鳴と恐怖に包まれながら、私はコーヒーメーカーを外に出しました。\n悲鳴と恐怖の20分後、私は機械を外に出し、トレイを取り出して虫除けスプレーをかけました。\nトレイを取り出して、彼らがいたトレイに虫よけスプレーを吹きかけました。",
      "title": "コーヒーメーカーから生きたゴキブリを除去する方法は？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以今天早上我去清空咖啡机托盘上多余的水，看到两只大的和几只小的跑回机器里。\n两只大的和几只小的又跑进了机器里。\n尖叫和恐惧之后，我把那该死的东西拿出来放在外面，把盘子拉出来，在我看到的盘子里喷了一些杀虫剂。\n盘，并在我看到它们的盘里喷了一些杀虫剂，现在......",
      "title": "如何清除咖啡机中的活蟑螂？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以今天早上我去清空咖啡機托盤上多餘的水，看到兩隻大的和幾隻小的跑回機器裏。\n兩隻大的和幾隻小的又跑進了機器裏。\n尖叫和恐懼之後，我把那該死的東西拿出來放在外面，把盤子拉出來，在我看到的盤子裏噴了一些殺蟲劑。\n盤，並在我看到它們的盤裏噴了一些殺蟲劑，現在......",
      "title": "如何清除咖啡機中的活蟑螂？"
    }
  ]
}