{
  "author": "AskScienceModerator",
  "the_new_excerpt": "Hi! I am Tel Aviv University cancer biologist, Prof. Neta Erez. I study the\ntumor metastasis microenvironment.\n\nTumors are more than just a bunch of cancer cells. They are better described as\nmulticellular organisms. In each tumor there are complex interactions with\nimmune cells, which cause…",
  "original_created_utc": 1614772805,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "你好！我是特拉维夫大学的癌症生物学家，内塔-埃雷兹教授。我研究的是\n肿瘤转移的微环境。\n\n肿瘤不仅仅是一堆癌细胞。它们最好被描述为\n多细胞生物体。在每一个肿瘤中，都有复杂的相互作用与\n免疫细胞，导致...",
      "title": "AskScience AMA系列。你好！ 我是特拉维夫大学的癌症生物学家 我是特拉维夫大学癌症生物学家Neta Erez教授。我正在开发一种治疗乳腺癌的新方法。问我任何事情!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好！我是特拉維夫大學的癌症生物學家，內塔-埃雷茲教授。我研究的是\n腫瘤轉移的微環境。\n\n腫瘤不僅僅是一堆癌細胞。它們最好被描述爲\n多細胞生物體。在每一個腫瘤中，都有複雜的相互作用與\n免疫細胞，導致...",
      "title": "AskScience AMA系列。你好！ 我是特拉維夫大學的癌症生物學家 我是特拉維夫大學癌症生物學家Neta Erez教授。我正在開發一種治療乳腺癌的新方法。問我任何事情!"
    }
  ],
  "title": "AskScience AMA Series: Hi! I am Tel Aviv University cancer biologist, Prof. Neta Erez. I'm developing a novel approach to treating breast cancer. Ask Me Anything!",
  "created_utc": 1614844031,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi! I am Tel Aviv University cancer biologist, Prof. Neta Erez. I study the tumor metastasis microenvironment.</p>\n\n<p>Tumors are more than just a bunch of cancer cells. They are better described as multicellular organisms. In each tumor there are complex interactions with immune cells, which cause inflammation processes in the connective tissue and blood vessels.</p>\n\n<p>In my lab, we study these interactions to understand how tumor cells &quot;hijack&quot; physiological pathways and use them to support their growth. Additionally, we also study the link between cancer and inflammation,specifically how cancer cells metastasize and grow in distant organs from their original host.</p>\n\n<p>Prof. Erez studies the biology of tumor metastasis, focusing on the metastatic microenvironment, cancer-related inflammation and the role of stromal and immune cells in facilitating the early and late stages of metastasis. Prof. Erez&#39;s work focuses on these crucial aspects of cancer. She uses mouse models of carcinogenesis and metastasis of melanoma, breast, and ovarian carcinoma. The main goal of her research is to identify and characterize key molecular pathways in the communication between tumor cells and their microenvironment that can be targeted by novel therapeutics.</p>\n\n<p>Prof. Erez began her academic career at the Weizmann Institute of Science. She obtained her PhD in the field of molecular cell biology under the guidance of Prof. Varda Rotter.  Supported by a fellowship from the Cancer Research Institute (CRI), Prof. Erez carried out her postdoctoral research in the laboratory of Prof. Doug Hanahan at UCSF, working in the field of tumor biology (2005-2010). During her postdoctoral fellowship she demonstrated a novel role for cancer-associated fibroblasts in mediating tumor-promoting inflammation. Following her postdoctoral work, she joined the Department of Pathology at the Sackler Faculty of Medicine in October 2010, and currently serves as the Department Chair.</p>\n\n<p>I will be on at 10am PT (1 PM ET, 18 UT), Ask Me Anything!</p>\n\n<p>Learn more about my lab: <a href=\"https://www.netaerezlab.sites.tau.ac.il/\">https://www.netaerezlab.sites.tau.ac.il/</a></p>\n\n<p>Username: <a href=\"/u/IsraelinSF\">/u/IsraelinSF</a></p>\n\n<hr/>\n\n<p>EDIT: Please note the correction in time.</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/askscience/comments/lws8ge/askscience_ama_series_hi_i_am_tel_aviv_university/",
  "subreddit": "askscience",
  "id": "lws8ge",
  "is_self": true,
  "media": null,
  "is_video": false
}