{
  "author": "MspMickey",
  "the_new_excerpt": "> For decades, the story of American steel had been one of job losses, mill\n> closures and the bruising effects of foreign competition. But now, the\n> industry is experiencing a comeback that few would have predicted even months\n> ago.\n> \n> Steel prices are at record highs and demand is surging, as…",
  "original_created_utc": 1621614139,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "> 何十年にもわたって、アメリカの鉄鋼業界は、雇用の喪失、工場の閉鎖、外国との競争の激化といった問題を抱えてきました。\n> アメリカの鉄鋼の話は、何十年もの間、雇用の喪失、工場の閉鎖、外国との競争による打撃の話でした。しかし今、米国の鉄鋼業界は\n> しかし今、アメリカの鉄鋼業界は、数ヶ月前にはほとんど予測できなかったような復活を遂げています。\n> 数ヶ月前には予測できなかったことです。\n> \n> 鋼材の価格は過去最高で、需要は急増しており、...",
      "title": "NYT: \"Soaring Prices Herald Boom Time for Steel Makers\""
    },
    {
      "locale": "zh",
      "the_new_excerpt": "> 几十年来，美国钢铁业的故事一直是失业、工厂关闭和外国竞争的影响。\n> 关闭和外国竞争的破坏性影响。但现在，这个\n> 该行业正在经历一场甚至在几个月前都没有人预料到的卷土重来。\n> 的。\n> \n> 钢铁价格处于历史高位，需求激增，因为...",
      "title": "纽约时报》。\"飙升的价格预示着钢铁制造商的繁荣时代\""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "> 幾十年來，美國鋼鐵業的故事一直是失業、工廠關閉和外國競爭的影響。\n> 關閉和外國競爭的破壞性影響。但現在，這個\n> 該行業正在經歷一場甚至在幾個月前都沒有人預料到的捲土重來。\n> 的。\n> \n> 鋼鐵價格處於歷史高位，需求激增，因爲...",
      "title": "紐約時報》。\"飆升的價格預示着鋼鐵製造商的繁榮時代\""
    }
  ],
  "title": "NYT: \"Soaring Prices Herald Boom Time for Steel Makers\"",
  "created_utc": 1621625766,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><blockquote>\n<p>For decades, the story of American steel had been one of job losses, mill closures and the bruising effects of foreign competition. But now, the industry is experiencing a comeback that few would have predicted even months ago.  </p>\n\n<p>Steel prices are at record highs and demand is surging, as businesses step up production amid an easing of pandemic restrictions. Steel makers have consolidated in the past year, allowing them to exert more control over supply. <a href=\"https://www.nytimes.com/2020/01/27/business/economy/trump-steel-tariffs.html\">Tariffs on foreign steel</a> imposed by the <a href=\"https://www.nytimes.com/2018/02/16/us/politics/trump-administration-recommends-stiff-penalties-on-steel-and-aluminum-imports.html?searchResultPosition=1\">Trump administration</a> have kept cheaper imports out. And steel companies are hiring again.</p>\n</blockquote>\n\n<p><a href=\"https://www.nytimes.com/2021/05/21/business/steel-prices-boom.html\">https://www.nytimes.com/2021/05/21/business/steel-prices-boom.html</a></p>\n</div><!-- SC_ON -->",
  "score": 661,
  "permalink": "/r/investing/comments/nhwhxu/nyt_soaring_prices_herald_boom_time_for_steel/",
  "subreddit": "investing",
  "id": "nhwhxu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197388311
}