{
  "author": "leninsjuicycock",
  "original_created_utc": 1638150487,
  "title": "Men, is it a dealbreaker if she doesn’t give blowjobs?",
  "created_utc": 1638161387,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve been in a few relationships and hookups in my time, and I’ve always HATED giving blowjobs. I have a terrible gag reflex, I throw up after like an inch or two. I would always try with past partners because they seemed to be into it but it always really turned me off bc I had to try so hard not to throw up and I would often gag and have actually thrown up on penises before, [GROSS WARNING] but they never noticed cuz when there’s something blocking it just goes back in where it came from, fucking nasty stuff. Totally ruins the whole experience for me, but every guy seems to want blow jobs. Am I SOL?</p>\n</div><!-- SC_ON -->",
  "score": 123,
  "permalink": "/r/TooAfraidToAsk/comments/r4kasd/men_is_it_a_dealbreaker_if_she_doesnt_give/",
  "subreddit": "TooAfraidToAsk",
  "id": "r4kasd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’ve been in a few relationships and hookups in my time, and I’ve always HATED\ngiving blowjobs. I have a terrible gag reflex, I throw up after like an inch or\ntwo. I would always try with past partners because they seemed to be into it but\nit always really turned me off bc I had to try so hard not…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は今まで何度か恋愛や交際をしてきましたが、昔からフェラチオが嫌いでした。\nフェラが嫌いなんです。咽頭反射がひどくて、1～2センチで吐いてしまうんです。\n吐いてしまいます。過去に付き合っていた相手はフェラチオが好きそうだったのでいつも試していましたが\nでも、それは私の気を悪くするだけで、私は必死に努力しなければならなかった...",
      "title": "男性の皆さん、彼女がフェラチオをしてくれないと破局してしまうのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在我的时间里，我有过几次恋爱和勾搭，我一直讨厌\n给人吹箫。我有一个可怕的吞咽反射，我在一两英寸后就会吐出来。\n就会吐出来。我总是和过去的伴侣一起尝试，因为他们似乎很喜欢，但是\n但这总是让我很反感，因为我不得不努力不...",
      "title": "男人们，如果她不给人吹箫，是不是就会破坏交易？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在我的時間裏，我有過幾次戀愛和勾搭，我一直討厭\n給人吹簫。我有一個可怕的吞嚥反射，我在一兩英寸後就會吐出來。\n就會吐出來。我總是和過去的伴侶一起嘗試，因爲他們似乎很喜歡，但是\n但這總是讓我很反感，因爲我不得不努力不...",
      "title": "男人們，如果她不給人吹簫，是不是就會破壞交易？"
    }
  ]
}