{
  "author": "BtcAnonymouse",
  "original_created_utc": 1627463023,
  "title": "8 straight green days for Bitcoin for the first time in more than 2 years",
  "created_utc": 1627479405,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Bitcoin price has been rising every day for the past 8 days.</p>\n\n<p>The last time Bitcoin had 8 straight days of green candles was in June 2019 when Bitcoin woke up from 1 year of bear market.</p>\n\n<p>The last time Bitcoin had 9 straight days of green candles was in October 2015 when Bitcoin woke up from 2 years of bear market.</p>\n\n<p>Bitcoin has never had 10 straight days of green candles. 2 more days of green will make an all-time record.</p>\n\n<p>*Edit. In December 2020 there was one small difference. One of the days was a doji (means open and close price was the same).</p>\n</div><!-- SC_ON -->",
  "score": 171,
  "permalink": "/r/CryptoCurrency/comments/ot667w/8_straight_green_days_for_bitcoin_for_the_first/",
  "subreddit": "CryptoCurrency",
  "id": "ot667w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Bitcoin price has been rising every day for the past 8 days.\n\nThe last time Bitcoin had 8 straight days of green candles was in June 2019 when\nBitcoin woke up from 1 year of bear market.\n\nThe last time Bitcoin had 9 straight days of green candles was in October 2015\nwhen Bitcoin woke up from 2 years…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコイン価格は過去8日間、毎日上昇している。\n\nビットコインが8日連続で緑のローソクを持っていた最後の時は、2019年6月の時でした。\nビットコインが1年間の弱気相場から目覚めた時です。\n\nビットコインが9日連続で緑のキャンドルを持っていた最後の時間は、2015年10月にあった\nビットコインが2年間の...から目を覚ました時。",
      "title": "ビットコインが2年以上ぶりに8連続グリーンデーを迎える"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "过去8天，比特币价格每天都在上涨。\n\n上一次比特币连续8天出现绿色蜡烛是在2019年6月，当时\n比特币从1年的熊市中苏醒过来。\n\n上一次比特币连续9天的绿色蜡烛是在2015年10月\n当比特币从2年的熊市中苏醒过来时...",
      "title": "比特币两年多来首次出现连续8个绿日"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "過去8天，比特幣價格每天都在上漲。\n\n上一次比特幣連續8天出現綠色蠟燭是在2019年6月，當時\n比特幣從1年的熊市中甦醒過來。\n\n上一次比特幣連續9天的綠色蠟燭是在2015年10月\n當比特幣從2年的熊市中甦醒過來時...",
      "title": "比特幣兩年多來首次出現連續8個綠日"
    }
  ]
}