{
  "author": "Most_Cap_9668",
  "original_created_utc": 1646077982,
  "title": "Am I the weird one for wanting to live a simple life by myself?",
  "created_utc": 1646097429,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;OK so this is not exactly a &amp;#39;too afraid to ask&amp;#39; thing. It&amp;#39;s more of a &amp;#39;I have no one I can talk to about these stuff&amp;#39; thing.\nRight now, I&amp;#39;m doing my honors in botany and honestly I&amp;#39;m really liking everything. My family expects me to be a researcher and i dont think it&amp;#39;s a bad idea. But there&amp;#39;s something I want way more that somehow always seems weird to people whenever I tell them.\nI love gardening and baking. So one day, I dream of having a small cafe. I want to live alone in a single bedroom house with a small garden where I can plant all sorts of plants. I don&amp;#39;t want to stay too close to my family, some 2hrs driving distance is perfect.\nI want to be able to wake up in the morning, go to my cafe, prepare everything for the day, and have a cup of coffee for myself. I&amp;#39;ll serve good food, but I want business to be slow. Ideally 20 people a day. And then, I&amp;#39;d go back to my house in the evening.\nI&amp;#39;ll have three cats and maybe a dog. I also love knitting so I&amp;#39;ll do those as well.\nIt&amp;#39;s the perfect life according to me. Because i prefer my own company over having actual company and i prefer taking things slow and at my own pace.\nI know this wouldn&amp;#39;t make me make rich or successful, but it just sounds so good. The peace and solitude is really tempting.\nBut it&amp;#39;s not possible. I&amp;#39;ve tried bringing up the topic of a cafe to my family, and well, safe to say, they&amp;#39;ll never accept a family member like that.\nMy family is quite accomplished and academically well known in my town, so they feel like I&amp;#39;ll be even more of a disgrace to my family.\nNo one gets the life I&amp;#39;m talking about. I&amp;#39;ve told some of my friends as well but everyone&amp;#39;s reactions are the same. They either laugh at me saying I want to retired life before starting my life or say that I&amp;#39;m just trying to romanticise life.\nSo at this point I&amp;#39;m just wondering, anyone else out there who wants to live this life as well? 😂 Or am I in over my head?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/t3o85p/am_i_the_weird_one_for_wanting_to_live_a_simple/",
  "subreddit": "TooAfraidToAsk",
  "id": "t3o85p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "OK so this is not exactly a 'too afraid to ask' thing. It's more of a 'I have no\none I can talk to about these stuff' thing. Right now, I'm doing my honors in\nbotany and honestly I'm really liking everything. My family expects me to be a\nresearcher and i dont think it's a bad idea. But there's…"
}