{
  "author": "i_love_scrabble",
  "the_new_excerpt": "It's been a really weird journey. I made money and then lost all of it. Please\nbe careful, don't make mistakes like me and put in all your life savings. I was\ndesperate and thought this was my silver lining for a better tomorrow. I did\neverything, study up on projects, charts, online tutorials etc…",
  "original_created_utc": 1624072510,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "本当に奇妙な旅でした。お金を稼いでは、すべてを失った。どうか\n私のような失敗をして、全財産を投入しないように気をつけてください。私は必死でした。\n私は自暴自棄になっていて、これはより良い明日のための私の光明だと思っていました。私はあらゆることをしました。\nプロジェクト、チャート、オンラインチュートリアルなど、あらゆることを勉強しました。",
      "title": "みんな、気をつけて、私のようにお金を失わないようにね。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是一个非常奇怪的旅程。我赚了钱，然后又失去了所有的钱。请\n要小心，不要像我一样犯错，把你一生的积蓄都投进去。我当时\n绝望，认为这是我的一线生机，可以让我的明天更美好。我做了\n我做了一切，研究项目、图表、在线教程等等。",
      "title": "伙计们在外面要注意安全，不要像我一样失去你的钱。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是一個非常奇怪的旅程。我賺了錢，然後又失去了所有的錢。請\n要小心，不要像我一樣犯錯，把你一生的積蓄都投進去。我當時\n絕望，認爲這是我的一線生機，可以讓我的明天更美好。我做了\n我做了一切，研究項目、圖表、在線教程等等。",
      "title": "夥計們在外面要注意安全，不要像我一樣失去你的錢。"
    }
  ],
  "title": "Guys be safe out there and don't lose your money like I did.",
  "created_utc": 1624102374,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It&#39;s been a really weird journey. I made money and then lost all of it. Please be careful, don&#39;t make mistakes like me and put in all your life savings. I was desperate and thought this was my silver lining for a better tomorrow. I did everything, study up on projects, charts, online tutorials etc etc yet it all failed. I was obsessed with it, I lost my social life, my peace of mind and my sanity as well, so be careful. This space isn&#39;t for everyone. Take care</p>\n\n<p>Edit- Edit- Thanks for your support everyone. A few general answers I lost all my money in futures and margin trades. \nI lost around 2500$, might not seem a lot but in a third world country it&#39;s what we make in a year.\nAbout my other post which a lot of you referenced. I got some great advice and was consoled by a good person who helped me realise what I was doing is wrong. And that post is deleted. I&#39;m still not in a good frame of mind. I&#39;ll try to get my mind off things. Again thank you everyone for you kind support</p>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/CryptoCurrency/comments/o36w14/guys_be_safe_out_there_and_dont_lose_your_money/",
  "subreddit": "CryptoCurrency",
  "id": "o36w14",
  "is_self": true,
  "media": null,
  "is_video": false
}