{
  "author": "RegisterHistorical44",
  "original_created_utc": 1654260819,
  "title": "Am I going crazy? - spouse of 13 years keeps insisting I am mentally compromised.",
  "created_utc": 1654277570,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Background - \nMy wife and I have been together since Jr. High. We are both in our 30&amp;#39;s at this point. \nWe started off very poor, but agreed prior to getting married that we wanted a large family, that she wanted to be a stay at home mom, and that I wanted to provide for us financially. \nOur first year married I made $17,000 gross and we had our first child. \nSecond baby came 17 months later. \nAt this point I was making maybe $22,000. \nThis was during the 2008 global financial crisis and things were very tough. I worked as much as 3 jobs simultaneously to make ends meet. We had a stint on food stamps, ect. &lt;/p&gt;\n\n&lt;p&gt;At time time I would get angry when I came home between jobs and the house was a mess. We are not talking toys in the living room - more like dirty dishes everywhere, smashed food on the carpet/couch, drawing on the walls, ect. \nI would start cleaning and complain about the state of things. She would get annoyed and or upset - insisting she HAD cleaned, but because our kids were there all day, those efforts got swallowed in the sheet capability they have of making messes (they do male alot of mess.) \nAt one point she found out I was watching porn. She flipped out and left with the kids for several weeks, put our back several hundred into the negative getting to her parents house, and said she was not coming back tell I &amp;quot;got help&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;For context - the porn she found was still images of Emma Watson (Harry potter) and a YouTube video of women oil wrestling. Nothing even close to illegal, crazy or indicative of some issue - just standard &amp;quot;I like women and endorphin rushes&amp;quot; porn. &lt;/p&gt;\n\n&lt;p&gt;Fast forward 10 years - I now make alot of money. Like my signon bonus for my current R&amp;amp;D job was $75,000 so they could poach me from another company kind of money. \nWe own our house, which is in a nice part of town (small town but housing here is insanely priced)&lt;br/&gt;\nWe have a brand new van we ordered so we can fit our family. \nYadda yadda yadda. Things are about as good as they can be. &lt;/p&gt;\n\n&lt;p&gt;We fight alot. Usually about really stupid stuff. Every time we get into an argument she says I am being an asshole. She screams and calls me names, repeats what I say in mocking voices and emotive gestures and typically treats me like I&amp;#39;m a clueless idiot. \nShe insists that I emotionally abuse her and have for years. \nShe has repeatedly told me &amp;quot;I wish you would just kill yourself&amp;quot; \nRepeatedly told me we are getting a divorce. \nRepeatedly threatened and given ultimatums. \nShe insists that in every argument, in every scenario I am wrong, and my perspective is the problem and I owe her an apology for my treatment of her. &lt;/p&gt;\n\n&lt;p&gt;Now that you are sure I&amp;#39;m a scumbag - &lt;/p&gt;\n\n&lt;p&gt;I have Never called her names. \nI have never touched her in any negative way. Not a single even a single pinch. \nI don&amp;#39;t raise my voice at her\nI refuse to say anything negative about her infront of our kids. Infact I try very hard to steer our arguments behind closed doors. \nBasically I don&amp;#39;t think I have ever emotionally, physically or psychologically abused her in any way shape or from. &lt;/p&gt;\n\n&lt;p&gt;Ok.. context out of the way... &lt;/p&gt;\n\n&lt;p&gt;About a year ago I starter anti-depressants  and ADD medication. I am Dyslexic, and on the autistic spectrum - however I am high functioning. But I am bad with social interactions and protocol and tend to follow the traditional &amp;quot;really good at one thing&amp;quot; kind of story - my one thing being what makes all the money that provides for my family from a single income. \nIn our last two arguments she has insisted that I am \nA.) Having a &amp;quot;mental break&amp;quot; brought on as a side effect of my medication\nB.) Having disassociative episodes in which I think that I have said something she says I did not. Or think I replied to her when she says I did not. \nC.)  Full in psychosis with memory lapses and hallucinations. &lt;/p&gt;\n\n&lt;p&gt;All of these insinuations have been met with a series of questions in return.. namely\n1.) If in not holding it together - how am I able to perform my day job? \n1.b) why are these lapses in memory only convenient to her arguments and positions? Why are they never random or benign or again never seem to effect anything outside of my interactions with her. \n2.) Why is each scenario far more easily explained by her  not listening and or not hearing something? \n3.) Why has she not insisted I go to the hospital or even outpatient treatments? \n4.) Why does she still let me drive everywhere and with everyone? \n5.) Why don&amp;#39;t I feel like nothing is wrong or out of place? \n6.) Why have our children (who we homeschool, and I work from home) not noticed of commented on any of this? &lt;/p&gt;\n\n&lt;p&gt;Thanks for sticking with me this far. Finally to the point.. &lt;/p&gt;\n\n&lt;p&gt;Is this behavior gas lighting? \nI feel like she has been manipulating and gas lighting me for a decade and essentially using me for my stable income and dependability despite her almost 0 effort into anything. \nWith the medication I am able to focus long enough to make actual arguments to her name shouting onslaught and rapid fire question style of arguing.\nAnd the reduction in anxiety had led to me pushing back on her BS and calling her out for it - which she tries to subvert by calling me abusive and insisting that me standing up to her is &amp;quot;being an asshole&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/TooAfraidToAsk/comments/v3yrfu/am_i_going_crazy_spouse_of_13_years_keeps/",
  "subreddit": "TooAfraidToAsk",
  "id": "v3yrfu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Background - My wife and I have been together since Jr. High. We are both in our\n30's at this point. We started off very poor, but agreed prior to getting\nmarried that we wanted a large family, that she wanted to be a stay at home mom,\nand that I wanted to provide for us financially. Our first year…"
}