{
  "author": "throwaway93725284",
  "original_created_utc": 1629303244,
  "title": "The argument I often hear against “Tax the rich” is that “The rich will move away, and your economy will suffer”. Are there any historical occurrences that can back this?",
  "created_utc": 1629338384,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Like the title says, the only argument I often hear against taxing the rich is that they will “leave” and their departure will negatively impact the state/country. </p>\n\n<p>Are there any historical occurrences through all of history in which a ruler/head of state increased taxes on the rich, which resulted in a departure of the rich, which then resulted in the decline of the state/nation?</p>\n\n<p>Just curious.</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/p6ue5f/the_argument_i_often_hear_against_tax_the_rich_is/",
  "subreddit": "AskHistorians",
  "id": "p6ue5f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Like the title says, the only argument I often hear against taxing the rich is\nthat they will “leave” and their departure will negatively impact the\nstate/country.\n\nAre there any historical occurrences through all of history in which a\nruler/head of state increased taxes on the rich, which resulted…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルにもあるように、金持ちへの課税に反対する意見としてよく聞くのは\n金持ちが「出て行って」しまい、その出て行った金持ちが国に悪い影響を与えるというものです。\n州や国に悪影響を与えるというものです。\n\n歴史上、支配者や国家元首が金持ちへの課税を強化し、その結果...という出来事はありますか？\n統治者や国家元首が金持ちへの課税を強化し、その結果、...",
      "title": "金持ちに税金をかける」ことに対してよく聞くのが、「金持ちが離れていって、経済が苦しくなる」という議論です。これを裏付けるような歴史的な出来事はありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "正如标题所说，我经常听到的反对向富人征税的唯一理由是\n他们会 \"离开\"，他们的离开会对国家产生负面影响。\n州/国家产生负面影响。\n\n在历史上是否有这样的情况？\n统治者/国家元首增加对富人的税收，从而导致...",
      "title": "我经常听到的反对 \"对富人征税 \"的论点是：\"富人会搬走，你们的经济会受到影响\"。是否有任何历史事件可以证明这一点？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "正如標題所說，我經常聽到的反對向富人徵稅的唯一理由是\n他們會 \"離開\"，他們的離開會對國家產生負面影響。\n州/國家產生負面影響。\n\n在歷史上是否有這樣的情況？\n統治者/國家元首增加對富人的稅收，從而導致...",
      "title": "我經常聽到的反對 \"對富人徵稅 \"的論點是：\"富人會搬走，你們的經濟會受到影響\"。是否有任何歷史事件可以證明這一點？"
    }
  ]
}