{
  "author": "Frigorifico",
  "the_new_excerpt": "There used to be a lot of shows in the 80s and 70s in which the butt of the joke\nwas often the husband and the wife hating each other\n\nThis contrasts with earlier comedies like I love Lucy or Bewitched where the\ncouple loved each other dearly, and with more current shows which also tend to\nhave…",
  "original_created_utc": 1618157148,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "80年代や70年代には、夫と妻が憎み合っていることをネタにした番組がよくありました。\n夫と妻がお互いに憎み合っていることが多かった。\n\nこれは、「I love Lucy」や「Bewitched」のように、夫婦がお互いに愛し合っていた初期のコメディとは対照的です。\nこれは、「I love Lucy」や「Bewitched」のような初期のコメディでは、夫婦がお互いに心から愛し合っていたのとは対照的です。\n傾向があります。",
      "title": "団塊の世代はなぜ妻を嫌うのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在80、70年代，有很多节目中的笑话的屁股。\n常常是夫妻相见恨晚。\n\n这与早期的喜剧片形成了鲜明的对比，比如《我爱露西》或《迷魂记》。\n夫妻俩深爱着对方，而随着时下更多的节目也趋向于。\n有...",
      "title": "为什么潮人恨自己的妻子？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在80、70年代，有很多節目中的笑話的屁股。\n常常是夫妻相見恨晚。\n\n這與早期的喜劇片形成了鮮明的對比，比如《我愛露西》或《迷魂記》。\n夫妻倆深愛着對方，而隨着時下更多的節目也趨向於。\n有...",
      "title": "爲什麼潮人恨自己的妻子？"
    }
  ],
  "title": "Why do boomers hate their wives?",
  "created_utc": 1618167027,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There used to be a lot of shows in the 80s and 70s in which the butt of the joke was often the husband and the wife hating each other</p>\n\n<p>This contrasts with earlier comedies like I love Lucy or Bewitched where the couple loved each other dearly, and with more current shows which also tend to have healthier relationships, even in Malcom in the Middle the parents loved each other despite how disfunctional they were in other senses </p>\n\n<p>The &quot;I hate my wife&quot; comedies seem to have been made for and by baby boomers</p>\n\n<p>Did baby boomers have worse marriage lives than other generations?, did they just find the idea specially funny for some reason?</p>\n</div><!-- SC_ON -->",
  "score": 199,
  "permalink": "/r/AskHistorians/comments/motghu/why_do_boomers_hate_their_wives/",
  "subreddit": "AskHistorians",
  "id": "motghu",
  "is_self": true,
  "media": null,
  "is_video": false
}