{
  "author": "totalcryptonewbie",
  "the_new_excerpt": "So, I posted about how important it was now that we are going sideways in a bear\nmarket to remember the reasons bitcoin was founded after 2008, and one of the\ninteresting things from the replies to the post was a few People commenting how\nthis wasn't a bear market, was still a bull market.\n\nThe…",
  "original_created_utc": 1624195987,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そこで私は、ベアマーケットで横ばいの状態が続いている今、2008年以降にビットコインが設立された理由を思い出すことが重要であると投稿しました。\n2008年以降にビットコインが設立された理由を思い出すことが重要だと投稿しました。\nこの投稿への返信の中で興味深かったのは、何人かの人が、この記事がいかに\nこれは弱気の市場ではなく、まだ強気の市場だった。\n\nその...",
      "title": "これがまだブル・マーケットであることを説明してください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以，我在帖子中说，现在我们在熊市中横冲直撞是多么的重要\n我发了一个帖子，说现在我们正在熊市中横盘，记住比特币在2008年后成立的原因是非常重要的，其中一个\n有意思的是，一些人在回帖中评论说\n这不是一个熊市，仍然是一个牛市。\n\n这个...",
      "title": "向我解释一下，这仍然是一个牛市。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以，我在帖子中說，現在我們在熊市中橫衝直撞是多麼的重要\n我發了一個帖子，說現在我們正在熊市中橫盤，記住比特幣在2008年後成立的原因是非常重要的，其中一個\n有意思的是，一些人在回帖中評論說\n這不是一個熊市，仍然是一個牛市。\n\n這個...",
      "title": "向我解釋一下，這仍然是一個牛市。"
    }
  ],
  "title": "Explain to me how this is still a Bull market",
  "created_utc": 1624228748,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So, I posted about how important it was now that we are going sideways in a bear market to remember the reasons bitcoin was founded after 2008, and one of the interesting things from the replies to the post was a few People commenting how this wasn&#39;t a bear market, was still a bull market.</p>\n\n<p>The market is more than 40% down over the last month. Bitcoin has been coming down from a high of 60k+ since April.</p>\n\n<p>So which is it - bear or bull?</p>\n\n<p>Btw this isnt meant to be FUD, I encourage people.to buy the dip if they are able to, and to hold on rather than sell at a loss. I just want to understand how people still consider this a bull market in the face of current metrics</p>\n\n<p>Edit: to whoever was offended enough to downvote - it&#39;s just a question buddy lighten up</p>\n</div><!-- SC_ON -->",
  "score": 159,
  "permalink": "/r/CryptoCurrency/comments/o45r4x/explain_to_me_how_this_is_still_a_bull_market/",
  "subreddit": "CryptoCurrency",
  "id": "o45r4x",
  "is_self": true,
  "media": null,
  "is_video": false
}