{
  "author": "Many_Scratch2269",
  "original_created_utc": 1628812180,
  "title": "Crypto is the best thing that has happened to people living in third world countries",
  "created_utc": 1628832636,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I live in Bangladesh and I just turned 16, before coming across cryptocurrency a few months ago, I wasn&#39;t able to make online purchases, invest in anything online nor was I able to play paid games from steam. It is the only internationally recognized currency where even minors have the same rights as adults and can not only make purchases, but also invest and contribute to the global economy.</p>\n\n<p>My country considers investing in other currencies as &quot;money laundering&quot;. So much so that they haven&#39;t even let paypal or gift cards in the country. The only way a teenager could contribute is by doing hard labor, which is common in a third world country.</p>\n\n<p>Crypto is a lifeline for those in Venezuela, Lebanon, Syria and even Yemen. You can donate to people instantly with zero fees with the click of a button using crypto. There are apps like WeNano where you don&#39;t need to pay anything, yet you play a role in helping. Crypto is the way I made my first buck online, and so did many others in a situation like me. </p>\n\n<p>People often look at crypto as something that is used to buy drugs or do illegal things, they overlook the best aspects of crypto, and how it&#39;s helping millions of people. If you hold crypto or promote it in any way, you are helping a lot of people in the present, and especially by selflessly promoting it, you are helping their future.</p>\n</div><!-- SC_ON -->",
  "score": 184,
  "permalink": "/r/CryptoCurrency/comments/p3bwed/crypto_is_the_best_thing_that_has_happened_to/",
  "subreddit": "CryptoCurrency",
  "id": "p3bwed",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I live in Bangladesh and I just turned 16, before coming across cryptocurrency a\nfew months ago, I wasn't able to make online purchases, invest in anything\nonline nor was I able to play paid games from steam. It is the only\ninternationally recognized currency where even minors have the same rights…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はバングラデシュに住んでいて、16歳になったばかりですが、数ヶ月前に暗号通貨に出会うまでは\n数ヶ月前に暗号通貨に出会うまでは、オンラインで買い物をすることも、オンラインで投資をすることもできませんでした。\nオンラインで購入したり、投資したり、steamの有料ゲームをプレイしたりすることができませんでした。暗号通貨は、未成年でも利用できる唯一の国際通貨です。\n国際的に認められた唯一の通貨で、未成年者でも同じ権利を持つことができます。",
      "title": "暗号は第三国に住む人々に起こった最高の出来事である"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我住在孟加拉国，我刚满16岁，在接触到加密货币之前，我就已经知道了。\n几个月前，我还不能进行网上购物，不能在网上投资任何东西，也不能从steam上玩付费游戏。\n也不能玩steam上的付费游戏。它是唯一\n国际公认的货币，即使是未成年人也有同样的权利......",
      "title": "加密货币是生活在第三世界国家的人们所遇到的最好的事情"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我住在孟加拉國，我剛滿16歲，在接觸到加密貨幣之前，我就已經知道了。\n幾個月前，我還不能進行網上購物，不能在網上投資任何東西，也不能從steam上玩付費遊戲。\n也不能玩steam上的付費遊戲。它是唯一\n國際公認的貨幣，即使是未成年人也有同樣的權利......",
      "title": "加密貨幣是生活在第三世界國家的人們所遇到的最好的事情"
    }
  ]
}