{
  "author": "skydiveguy",
  "original_created_utc": 1631544025,
  "title": "My work here is done....",
  "created_utc": 1631565360,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I work IT for a local bank since 2014. Ive been into crypto since 2013.</p>\n\n<p>I just gave my notice as I am going to work IT in a different industry (no more banking) so I am a lame duck in my final 2 weeks of employment.</p>\n\n<p>Today I just got an email about a meeting with our core provider (FIS NYDIG) about how we will be handling cryptocurrency in the near future.</p>\n\n<p>My job here is officially done. I went from getting stupid looks and laughed at back when I started here to leaving knowing that this place will soon be using crypto as a standard.</p>\n</div><!-- SC_ON -->",
  "score": 171,
  "permalink": "/r/Bitcoin/comments/pngsp4/my_work_here_is_done/",
  "subreddit": "Bitcoin",
  "id": "pngsp4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I work IT for a local bank since 2014. Ive been into crypto since 2013.\n\nI just gave my notice as I am going to work IT in a different industry (no more\nbanking) so I am a lame duck in my final 2 weeks of employment.\n\nToday I just got an email about a meeting with our core provider (FIS NYDIG)\nabout…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2014年から地方銀行のIT部門で働いています。2013年から暗号に興味を持っています。\n\n私はちょうど私の通知を与えたので、私は別の業界（もう銀行ではない）でITを働くつもりです。\n銀行はもうない）ので、私は雇用の最後の2週間の間にレームダックになっています。\n\n今日、コア・プロバイダー（FIS NYDIG）とのミーティングについてのメールを受け取りました。\nについてですが...",
      "title": "私のここでの仕事は終わりました...."
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我从2014年起在一家本地银行从事IT工作。我从2013年开始接触加密货币。\n\n我刚刚给我的通知，因为我将在一个不同的行业中从事IT工作（不再是银行业）。\n银行业），所以我是一个跛脚鸭，在我最后两周的工作。\n\n今天我刚刚收到一封电子邮件，关于与我们的核心供应商（FIS NYDIG）的会议\n关于...",
      "title": "我在这里的工作已经完成...."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我從2014年起在一家本地銀行從事IT工作。我從2013年開始接觸加密貨幣。\n\n我剛剛給我的通知，因爲我將在一個不同的行業中從事IT工作（不再是銀行業）。\n銀行業），所以我是一個跛腳鴨，在我最後兩週的工作。\n\n今天我剛剛收到一封電子郵件，關於與我們的核心供應商（FIS NYDIG）的會議\n關於...",
      "title": "我在這裏的工作已經完成...."
    }
  ]
}