{
  "author": "TheWaylandCycle",
  "original_created_utc": 1655832587,
  "title": "How would ancient Greeks have understood the myth of Persephone?",
  "created_utc": 1655895375,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve often seen people online claiming that the myth of Persephone has been misinterpreted by modern audiences as a non-consensual abduction, and that the &amp;quot;original&amp;quot; myth portrayed a more loving relationship that did not involve abduction or deception (I&amp;#39;ve seen some people suggesting that her abduction should be interpreted as part of a courtship/marriage ritual?), or otherwise was not in line with this modern perception.&lt;/p&gt;\n\n&lt;p&gt;However, from glancing at &lt;a href=\"https://www.perseus.tufts.edu/hopper/text?doc=HH+2+4\"&gt;these&lt;/a&gt; &lt;a href=\"https://www.perseus.tufts.edu/hopper/text?doc=HH+2+4\"&gt;sections&lt;/a&gt; of the Homeric Hymn to Demeter, which pretty explicitly describe Persephone as being reluctant or unwilling to go with Hades, I&amp;#39;m curious as to which interpretation of the source material is more convincing, and if there are other accounts of the myth which offer a different story to the Homeric Hymn. So hopefully someone here will be able to give me a better sense of where these modern interpretations stand in relation to how the ancient Greeks would likely have understood the story of Persephone.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/vhinok/how_would_ancient_greeks_have_understood_the_myth/",
  "subreddit": "AskHistorians",
  "id": "vhinok",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've often seen people online claiming that the myth of Persephone has been\nmisinterpreted by modern audiences as a non-consensual abduction, and that the\n\"original\" myth portrayed a more loving relationship that did not involve\nabduction or deception (I've seen some people suggesting that her…"
}