{
  "author": "tiiilted",
  "original_created_utc": 1647448497,
  "title": "Is it wrong to want more sex from your girlfriend?",
  "created_utc": 1647465703,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My gf and I used to have lots of sex. We were so attracted to each other. A couple years passed, she got on birth control, then got off, and she just seems to have grown out of wanting sex. It went from every other day, to once a week, to every other week, and now its been a month. Whenever we do, it seems like she wants us both to cum as fast as possible. She says she still loves me, shows me affection and shows me she cares about me but there is no sex. Every time I try, she shuts it down and says she’s not in the mood. Or she will deny until she has to go somewhere and makes excuses like “oh i was in the mood but i just got a little sick” or “I dont have time”. I’ve tried so many different ways, found all the things she likes/doesnt like, but it still doesnt work out. I’ve tried talking to her about it many times but she always finds a way to make me feel awful about it. It makes me feel so unwanted, unattractive, and really fucks with my head. At the same time, I feel like a scumbag for wanting sex so much all the time, but she’s my gf, who else would I want it from? I feel stuck. I love her so much and I dont want to move on but this is so so hard for me. Am I wrong for feeling this way?&lt;/p&gt;\n\n&lt;p&gt;Edit: i have spoken with her multiple times about this but cant seem to get anywhere.&lt;/p&gt;\n\n&lt;p&gt;Edit pt 2: l just want to thank everyone here for offering me some insight into this. Im beginning to see the ugly truth and while it is painful, its a relief to know that I’m not alone and there is a way out.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 119,
  "permalink": "/r/TooAfraidToAsk/comments/tfm58i/is_it_wrong_to_want_more_sex_from_your_girlfriend/",
  "subreddit": "TooAfraidToAsk",
  "id": "tfm58i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "My gf and I used to have lots of sex. We were so attracted to each other. A\ncouple years passed, she got on birth control, then got off, and she just seems\nto have grown out of wanting sex. It went from every other day, to once a week,\nto every other week, and now its been a month. Whenever we do,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昔、彼女とたくさんセックスしたんだ。私たちはお互いにとても惹かれあっていました。A\n数年後、彼女は避妊具をつけ、そしてやめました。\nを求めるようになった。一日おきだったのが、週に一回になった。\nに、隔週に、そして今は一ヶ月に一度です。私たちがするときはいつも、...",
      "title": "恋人にもっとセックスをしたいと思うのはいけないことなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的女友和我曾经有很多性行为。我们是如此的吸引对方。A\n几年过去了，她采取了节育措施，然后又取消了，她似乎只是\n她似乎已经不再想做爱了。从每隔一天一次，到一周一次。\n到每隔一周一次，现在已经一个月了。每当我们做的时候，...",
      "title": "想从你的女朋友那里得到更多的性爱有错吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的女友和我曾經有很多性行爲。我們是如此的吸引對方。A\n幾年過去了，她採取了節育措施，然後又取消了，她似乎只是\n她似乎已經不再想做愛了。從每隔一天一次，到一週一次。\n到每隔一週一次，現在已經一個月了。每當我們做的時候，...",
      "title": "想從你的女朋友那裏得到更多的性愛有錯嗎？"
    }
  ]
}