{
  "author": "cleisthenes-alpha",
  "the_new_excerpt": "At the risk of this aging unbelievably poorly a few days from now, I just caught\na local peak for one of my first-ever crypto purchases in 2017 (which is\ncurrently swinging around wildly) and sold off just a little bit of my overall\nposition to reduce my exposure. If things keep going up, I'll DCA…",
  "original_created_utc": 1621092638,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今から数日後、この記事が信じられないほど悪くなってしまうかもしれませんが、私はちょうど\n2017年に初めて購入した暗号の1つがローカルピークを迎え（現在、大きく揺れています）、ちょうど売り抜けました。\n現在、大きく揺れ動いている）の局所的なピークを捉え、全体のポジションをほんの少しだけ売却してエクスポージャーを減らしました。\nのポジションを少しだけ売って、エクスポージャーを減らしました。このまま上昇するようであれば、私はDCA...",
      "title": "2017年に購入して以来、初めて少しだけ利益を出しました。数週間後には後悔するかもしれませんが、今はとてもいい気分です。10/10でお勧めします。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "冒着几天后这篇文章老化得令人难以置信的风险，我刚刚抓住了\n我在2017年有史以来第一次购买的加密货币之一的局部峰值（目前正在疯狂摆动\n目前正在疯狂地摇摆），并卖掉了我整体头寸中的一小部分。\n仓位，以减少我的风险。如果事情继续上升，我将DCA...",
      "title": "自2017年买入以来，刚赚了点利润，这是第一次。也许几周后我会后悔，但该死的是，现在感觉很好。10/10会推荐。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "冒着幾天後這篇文章老化得令人難以置信的風險，我剛剛抓住了\n我在2017年有史以來第一次購買的加密貨幣之一的局部峯值（目前正在瘋狂擺動\n目前正在瘋狂地搖擺），並賣掉了我整體頭寸中的一小部分。\n倉位，以減少我的風險。如果事情繼續上升，我將DCA...",
      "title": "自2017年買入以來，剛賺了點利潤，這是第一次。也許幾周後我會後悔，但該死的是，現在感覺很好。10/10會推薦。"
    }
  ],
  "title": "Just took a bit of profits for the first time since buying-in in 2017. Maybe I'll regret this in a few weeks, but god damn does it feel good right now. 10/10 would recommend.",
  "created_utc": 1621168635,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>At the risk of this aging unbelievably poorly a few days from now, I just caught a local peak for one of my first-ever crypto purchases in 2017 (which is currently swinging around wildly) and sold off just a little bit of my overall position to reduce my exposure. If things keep going up, I&#39;ll DCA out to recover my initial investment and be in &quot;for free&quot; on the rest of my holdings within a few months.</p>\n\n<p>Locked it in at 80x its original purchase price. Fuckin A&#39;, after riding out the unbelievable lows of 2018-2019, it feels good to lock in even a bit of the wins from this bullrun for sure. To know that I have at least <strong><em>something</em></strong> to show for all of this crypto trading the past four years. Woof.</p>\n\n<p>Definitely don&#39;t sell out everything -- I&#39;m still in crypto for the long haul -- but I really recommend people take <em>some</em> profits. At least for me, I know I&#39;m going to sleep and hold so much easier right now than I have been in this bull run.</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/CryptoCurrency/comments/nd1fk7/just_took_a_bit_of_profits_for_the_first_time/",
  "subreddit": "CryptoCurrency",
  "id": "nd1fk7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590798341
}