{
  "author": "BigLongFootDoctor",
  "the_new_excerpt": "I was just poking around my vault and saw my 10 moons were actually from tips!\nSince I don't know how to thank these individuals personally I wanted to say\nthank you to everyone who tips moons.\n\nIn my country the dollar feels like it's x20 more powerful, so while 10 moons\nmay not seem like anything…",
  "original_created_utc": 1619898201,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の金庫を覗いてみたら、私の10個の月は実はチップからのものだったのです。\n個人的にどうお礼を言えばいいのかわからないので、ムーンにチップをくれた皆さんに\n月にチップを入れてくれる皆さんに感謝しています。\n\n私の国では、ドルは20倍の価値があるように感じられます。\nとはいえ、10ムーンは何の意味もないかもしれませんが",
      "title": "月にチップをくれた人に感謝"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我只是在我的金库里翻了翻，看到我的10个月亮实际上是来自于小费！因为我不知道如何亲自感谢这些人，所以我想说，我的10个月亮来自于小费。\n由于我不知道如何亲自感谢这些人，我想说\n感谢所有给我小费的人。\n\n在我的国家，美元给人的感觉就像它有20倍的威力，所以虽然10个月亮\n可能看起来并不像什么...",
      "title": "感谢那些给月球的人"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我只是在我的金庫裏翻了翻，看到我的10個月亮實際上是來自於小費！因爲我不知道如何親自感謝這些人，所以我想說，我的10個月亮來自於小費。\n由於我不知道如何親自感謝這些人，我想說\n感謝所有給我小費的人。\n\n在我的國家，美元給人的感覺就像它有20倍的威力，所以雖然10個月亮\n可能看起來並不像什麼...",
      "title": "感謝那些給月球的人"
    }
  ],
  "title": "Thank You to Those Who Tip Moons",
  "created_utc": 1619922953,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was just poking around my vault and saw my 10 moons were actually from tips! Since I don&#39;t know how to thank these individuals personally I wanted to say thank you to everyone who tips moons.</p>\n\n<p>In my country the dollar feels like it&#39;s x20 more powerful, so while 10 moons may not seem like anything in great countries like the United States or Canada, here these 10 moons are sufficient for a dinner for one. Dinner from strangers is unheard of here and many are hungry. I have to say thank you so much!</p>\n\n<p>To everyone who&#39;s ever tipped a moons thank you, you never know who&#39;s on the receiving end or how much those moons can help given the location they live and how powerful dollars are in comparison. This community is amazing! Thank you so much for letting me be here!! =)</p>\n</div><!-- SC_ON -->",
  "score": 345,
  "permalink": "/r/CryptoCurrency/comments/n2prwt/thank_you_to_those_who_tip_moons/",
  "subreddit": "CryptoCurrency",
  "id": "n2prwt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380962679
}