{
  "author": "Good-Cloud3829",
  "original_created_utc": 1643584723,
  "title": "What established philosophical concepts might be most relevant to the issues being brought up by Antiwork?",
  "created_utc": 1643651841,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Beyond the summarized versions some of the most prolific theories in philosophy, I&amp;#39;m largely ignorant of philosophical literature. I&amp;#39;ve been lurking &lt;a href=\"/r/Antiwork\"&gt;r/Antiwork&lt;/a&gt;, and I&amp;#39;ve been growing more interested in understanding the scenarios that are playing out; but, I&amp;#39;d like to understand it through ideas which have been better established, and in a way that might acknowledge the greater complexity of the issues being brought up. &lt;/p&gt;\n\n&lt;p&gt;Personally, I&amp;#39;m probably more inclined to side with some aspects of Antiwork. But for example, of the concepts I&amp;#39;m at least superficially familiar with, &lt;em&gt;Social Contract Theory&lt;/em&gt;, &lt;em&gt;State of Nature&lt;/em&gt;, and &lt;em&gt;Ressentiment&lt;/em&gt; are among some of the ideas which seem at least partially attributable to many of the attitudes that seem to be representative of the current movement. As I said, I acknowledge that I&amp;#39;m not extremely well-versed in these ideas, so I&amp;#39;d rather not go in length about the associations I&amp;#39;ve been making; I&amp;#39;m more interested in the connections that might be made by someone with a greater depth of knowledge here. &lt;/p&gt;\n\n&lt;p&gt;Anyway, as in the title, what concepts, terms, or books come to mind when thinking about the deeper causes behind the Antiwork movement, the outcomes it may incite, or potential events it might precede?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/askphilosophy/comments/sglvpq/what_established_philosophical_concepts_might_be/",
  "subreddit": "askphilosophy",
  "id": "sglvpq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Beyond the summarized versions some of the most prolific theories in philosophy,\nI'm largely ignorant of philosophical literature. I've been lurking r/Antiwork\n[/r/Antiwork], and I've been growing more interested in understanding the\nscenarios that are playing out; but, I'd like to understand it…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "要約版の向こうには、哲学の中で最も多作な理論のいくつかがあります。\n私は哲学的な文献にはほとんど無知なんです。r/Antiworkに潜り込んでいます。\n[を理解することに興味が湧いてきました。\nというシナリオが展開されている。でも、理解したい...。",
      "title": "アンチワークが提起している問題に対して、どのような哲学的な既成概念が最も適していると思われますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在总结的版本之外，还有一些哲学中最多产的理论。\n我对哲学文献基本上一无所知。我一直在潜伏在r/Antiwork\n[/r/Antiwork]，而且我越来越有兴趣去了解\n正在上演的情景；但是，我想了解它...",
      "title": "哪些既定的哲学概念可能与Antiwork所提出的问题最相关？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在總結的版本之外，還有一些哲學中最多產的理論。\n我對哲學文獻基本上一無所知。我一直在潛伏在r/Antiwork\n[/r/Antiwork]，而且我越來越有興趣去了解\n正在上演的情景；但是，我想了解它...",
      "title": "哪些既定的哲學概念可能與Antiwork所提出的問題最相關？"
    }
  ]
}