{
  "author": "illestMFKAalive",
  "the_new_excerpt": "Uber announced Tuesday it is acquiring alcohol-delivery service Drizly for $1.1\nbillion in stock and cash.\n\nFollowing the completion of the transaction, Drizly’s marketplace will be\nintegrated with the Uber Eats app. The company will keep the standalone Drizly\napp as well, it said.\n\nFounded in 2012,…",
  "original_created_utc": 1612282819,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "Uber周二宣布以11亿美元的股票和现金收购酒类配送服务Drizly。\n亿美元的股票和现金。\n\n交易完成后，Drizly的市场将被\n与Uber Eats应用集成。该公司将保留独立的Drizly\n应用以及，它说。\n\n成立于2012年，。",
      "title": "Uber同意以11亿美元收购酒类配送服务Drizly。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Uber週二宣佈以11億美元的股票和現金收購酒類配送服務Drizly。\n億美元的股票和現金。\n\n交易完成後，Drizly的市場將被\n與Uber Eats應用集成。該公司將保留獨立的Drizly\n應用以及，它說。\n\n成立於2012年，。",
      "title": "Uber同意以11億美元收購酒類配送服務Drizly。"
    }
  ],
  "title": "Uber agrees to buy alcohol delivery service Drizly for $1.1 billion",
  "created_utc": 1612289004,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Uber announced Tuesday it is acquiring alcohol-delivery service Drizly for $1.1 billion in stock and cash.</p>\n\n<p>Following the completion of the transaction, Drizly’s marketplace will be integrated with the Uber Eats app. The company will keep the standalone Drizly app as well, it said.</p>\n\n<p>Founded in 2012, Drizly has become the leading on-demand alcohol delivery service in the U.S. and is available in 1,400 cities. The purchase could help drive people to use Uber’s app more often.</p>\n\n<p>Uber Eats has been a key segment to Uber’s business amid the Covid-19 pandemic, which has dramatically reduced the number of people leaving their homes.</p>\n\n<p>“During this time our delivery business as been growing at extraordinary rates,” Uber CEO Dara Khosrowshahi told CNBC on Tuesday. Drizly said it had more than 300% growth in the past year.</p>\n\n<p>The deal is expected to close within the first half of 2021. Uber said that it anticipates that more than 90% of the consideration to be paid to Drizly shareholders will consist of shares of Uber common stock, and the balance will be paid in cash.</p>\n\n<p>Uber stock was up more than 7% in the morning.</p>\n\n<p>Uber has focused its acquisition efforts on its Eats segment during the coronavirus pandemic. After talks failed to acquire food delivery service GrubHub, Uber acquired Postmates last July.</p>\n\n<p>At the same time, Uber has offloaded some of its more cost-eating transportation segments. The company last May transferred its electric bike and scooter business, Jump, to Lime. Uber also sold its self-driving unit, Advanced Technologies Group, to its start-up competitor Aurora Innovation on December 7, valuing ATG at approximately $4 billion at the time. Just a day later, it announced it was selling its flying taxi business, called Uber Elevate.</p>\n\n<p><a href=\"https://www.cnbc.com/2021/02/02/uber-agrees-to-buy-alcohol-delivery-service-drizly-for-1point1-billion.html\">https://www.cnbc.com/2021/02/02/uber-agrees-to-buy-alcohol-delivery-service-drizly-for-1point1-billion.html</a></p>\n</div><!-- SC_ON -->",
  "score": 747,
  "permalink": "/r/investing/comments/lazhet/uber_agrees_to_buy_alcohol_delivery_service/",
  "subreddit": "investing",
  "id": "lazhet",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518534789
}