{
  "author": "EatBranflakes",
  "the_new_excerpt": "I'm sure my experience isn't super novel, but back when I was in college Bitcoin\nalmost hit 20k. I put in $100 at the beginning of that spike and sold when it\nstarting dipping for $122 ($22 profit!). I did zero research and I was in it\nbecause I thought I could make a quick buck. I decided I…",
  "original_created_utc": 1614829093,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我相信我的经历并不是很新奇，但是在我上大学的时候，比特币\n几乎达到了2万。我在那轮暴涨的初期投入了100元，在暴涨时卖出了\n开始浸淫122元（利润22元！）。我做了零研究，我是在它\n因为我认为我可以赚快钱。我决定...",
      "title": "给我以前的同事"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我相信我的經歷並不是很新奇，但是在我上大學的時候，比特幣\n幾乎達到了2萬。我在那輪暴漲的初期投入了100元，在暴漲時賣出了\n開始浸淫122元（利潤22元！）。我做了零研究，我是在它\n因爲我認爲我可以賺快錢。我決定...",
      "title": "給我以前的同事"
    }
  ],
  "title": "To the guy I used to work with",
  "created_utc": 1614857955,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m sure my experience isn&#39;t super novel, but back when I was in college Bitcoin almost hit 20k. I put in $100 at the beginning of that spike and sold when it starting dipping for $122 ($22 profit!). I did zero research and I was in it because I thought I could make a quick buck. I decided I shouldn&#39;t be investing in something I don&#39;t know about, especially while I was paying for an education.</p>\n\n<p>Less than a year later, I started my first job after graduation which had an open office format. I distinctly remember a coworker saying Bitcoin was a good investment and we would regret not buying in. The response was pretty brutal as everyone was laughing at him and saying it would die out. It finally sparked me to do my own research and I hopped on board this wild ride. That week I put in $1000 which isn&#39;t a lot for some of you, but as a recent college graduate it was a big deal. Ever since then I have been trying to reach the milestone of accumulating 1 BTC and I&#39;m almost halfway there!</p>\n\n<p>Anyway, I just want to thank that guy I used to work with and hope you&#39;re still HODLing. I sometimes feel like the crazy guy you were painted as, but I think people just haven&#39;t opened their eyes yet!</p>\n</div><!-- SC_ON -->",
  "score": 292,
  "permalink": "/r/Bitcoin/comments/lxbqbn/to_the_guy_i_used_to_work_with/",
  "subreddit": "Bitcoin",
  "id": "lxbqbn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542567855
}