{
  "author": "Prof__JRR_Tolkien",
  "the_new_excerpt": "My dearest Christopher,\n\nIt has been far too long since I have last written you—about a week—but\nsomething has been mulling in my mind for quite a while, and I would like to\nknow your thoughts on the matter. I can’t seem to recall having any discussion\nabout ‘Star Trek’, with you or anyone, but…",
  "original_created_utc": 1617310224,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我最亲爱的克里斯托弗\n\n我已经很久没有给你写信了--大约一个星期了--但是... ...\n有件事在我脑海里盘桓了很久，我想说\n知道你对这件事的想法。我似乎不记得有任何讨论。\n关于 \"星际迷航\"，与你或任何人，但... ...",
      "title": "[看幕后]我很难认同《星际迷航》是如何去制作他们的克林贡语的（虽然这让我还是很兴奋！）。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最親愛的克里斯托弗\n\n我已經很久沒有給你寫信了--大約一個星期了--但是... ...\n有件事在我腦海裏盤桓了很久，我想說\n知道你對這件事的想法。我似乎不記得有任何討論。\n關於 \"星際迷航\"，與你或任何人，但... ...",
      "title": "[看幕後]我很難認同《星際迷航》是如何去製作他們的克林貢語的（雖然這讓我還是很興奮！）。"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "親愛なるクリストファー。\n\n最後にあなたに手紙を書いてからずいぶんと時間が経ってしまいました-約1週間-でも\n私の心の中でずっと考えていたことがあり、そのことについてあなたの考えを知りたいのです。\nあなたの考えを知りたいのです。あなたと『スター・トレック』の話をした記憶がありません。\nスター・トレック」について、あなたや他の人と議論した記憶はないのですが...。",
      "title": "舞台裏】スタートレックがクリンゴン語を作ったことを認めるのに苦労しました（それでも興奮しました！）。"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "親愛なるクリストファー。\n\n最後にあなたに手紙を書いてからずいぶんと時間が経ってしまいました-約1週間-でも\n私の心の中でずっと考えていたことがあり、そのことについてあなたの考えを知りたいのです。\nあなたの考えを知りたいのです。あなたと『スター・トレック』の話をした記憶がありません。\nスター・トレック」について、あなたや他の人と議論した記憶はないのですが...。",
      "title": "舞台裏】スタートレックがクリンゴン語を作ったことを認めるのに苦労しました（それでも興奮しました！）。"
    }
  ],
  "title": "[Looking Behind The Scenes] I struggle to approve of how Star Trek went about making their Klingon language (though it excites me still!)",
  "created_utc": 1617331845,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My dearest Christopher,</p>\n\n<p>It has been far too long since I have last written you—about a week—but something has been mulling in my mind for quite a while, and I would like to know your thoughts on the matter. I can’t seem to recall having any discussion about ‘Star Trek’, with you or anyone, but there is a facet of the original films, starting in 1979 with ‘The Motion Picture’, that has been intriguing me: the creation of languages for their fictional races.</p>\n\n<p>Of course, I am no stranger to this matter—you know better than practically anyone else—but the <em>way</em> they did it strikes me as peculiar. It’s far different than how I would have approached the matter.</p>\n\n<p>While the Klingon had appeared in the television show plenty of times, the first mention of a ‘Klingonese’ was in the 1967 episode ‘The Trouble With Tribbles’ (a rather famous episode for several reasons; it seems but a pure coincidence that such a known episode is also relevant to this story), but it was never spoken on screen until TMP over a decade later. It seems that then, it was a merely a batch of grunts and groans, developed by actor James Doohan and associate producer Jon Povill. They just made the sounds you would expect a warlike people to make, and let subtitles convey the meaning.</p>\n\n<p>No organisation, no intentional grammar, no <em>meaning</em> embedded into the sounds. Can you imagine? But they did turn those sounds into a full language for the third movie—and this, Christopher, is where my heart both soars and plummets.</p>\n\n<p>A linguist named Marc Okrand was hired to invent a Klingon language. This was not his first time working with ‘Star Trek’ to create language. His first responsibility was to make up dialogue spoken in the fictional language ‘Vulcan’ in a scene in the second movie: originally, the actors had spoken in English, but the producers wanted to change that to an alien language, and sought Mr Okrand’s help to determine syllables that would match the lip movements they had already recorded but would sound entirely different, so that the actors may record new dialogue without re-filming the scene. Mr Okrand was later tasked with developing the Klingon language, with only the gibberish spoken in the first movie to base it on, as well as character names and the direction to make it sound ‘guttural.’</p>\n\n<p>‘What does “guttural” <em>mean</em>?’ Mr Okrand asked himself. While he had a small basis of sounds and names to work with, ultimately he had to figure out the language for himself. His decision was, since he was making a language for an alien, non-human species, the language it self should be as non-human as possible. Mr Okrand looked at rules in phonology and morphology and syntax in human languages, and picked the least common occurrences of these rules. For example (as he often will tell people), in many human languages sentences start with the subject, then followed by the object and then the verb (though it is still very common, as in our English and some of my own languages, for it to be spoken <em>subject-verb-object</em>), while very rarely do languages start with the <em>object</em>. Because of this relative infrequency, Mr Okrand chose the queer sentence structure of <em>object-verb-subject</em> as a reflection of the Klingon’s non-humanity. He also made a point to incorporate phonological combinations that are not common in human languages.</p>\n\n<p>This frustrates me, as you can imagine, because this process is so <em>backwards</em> from what I am used to. As you are quite aware, Christopher, I invented my languages first, and built my world and stories around it. I did not seek to make languages for my fictional peoples based simply on how common they were in real human languages; I did not seek to make my fictional races’ languages be a polar opposite of our race’s languages. I simply sought to capture aesthetics of sound and syntax, ideal to my aesthetic interests. I built new languages that worked <em>because</em> I had studied how so many languages in our world work and have changed and been used, so I knew how to make a language in such a mold while still being unique to their own world. (Quenya, of course, was inspired by the Finnish language.) And <em>this</em> allowed me to build cultures who spoke the languages, and tell the stories of those cultures.</p>\n\n<p>The difference between me and Mr Okrand, you see, is that I started from the ground up, while he was thrust into the role well after the world had been constructed (albeit that is not <em>his</em> fault). Mr Okrand only created enough of a language to satisfy the needs of the dialogue in the film (though he went on to expand the vocabulary over the years), whereas my goal was to create a world where <em>elen síla lúmenn&#39; omentieimo</em> would be a common greeting, since &#39;A star shines on the hour of our meeting’ is a bit verbose in our world. The creators of ‘Star Trek’ had not given thought to the language of the Klingons before inventing the culture, so they had not created a properly fleshed out people, and only sought to rectify that after the fact. A language, as I have said many times before, needs a mythology, while a mythology needs a language; neither can be successful without the other. (Consider, of course, that the ‘international auxiliary language’ movement <em>still</em> has failed to produce a universal language, despite Esperanto’s relative popularity.)</p>\n\n<p>And while I made changes to my languages, those were reflected in the languages themselves. Earlier drafts of Quenya became in fact older versions of said ‘Elven’ language, for I wrote the language’s history alongside its speakers’ history. (Or, in some instances, I justified in-universe discrepancies by saying that the characters had misspoken.) Mr Okrand, meanwhile, needed to modify his language because of the mistakes of the cast and crew, since they would not reshoot. For example, Christopher Lloyd (playing Klingon Commander Kruge) has a line in Klingon which subtitles say mean ‘Kill one of them. I don’t care which one.’ Mr Okrand intended this to be said <em>Ha’ yIHoH! Vay’ jISaHbe’.</em> (Transliteration of this language is rather silly, so don’t fret if you struggle: a capital ‘H’ should be pronounced as the <em>ch</em> sound you hear in Hebrew, while a capital ’S’ represents our ‘sh’ sound.) This translation (as intended) breaks down as:</p>\n\n<p>&#x200B;</p>\n\n<table><thead>\n<tr>\n<th align=\"left\"><strong>Klingon</strong></th>\n<th align=\"left\"><strong>English</strong></th>\n<th align=\"left\"><strong>Grammatical role/form</strong></th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">Ha’</td>\n<td align=\"left\">one</td>\n<td align=\"left\">Object</td>\n</tr>\n<tr>\n<td align=\"left\">HoH</td>\n<td align=\"left\">To kill</td>\n<td align=\"left\">verb</td>\n</tr>\n<tr>\n<td align=\"left\">yI-</td>\n<td align=\"left\"></td>\n<td align=\"left\">Prefix indicating imperative</td>\n</tr>\n<tr>\n<td align=\"left\">vay’</td>\n<td align=\"left\">Anyone</td>\n<td align=\"left\">Object</td>\n</tr>\n<tr>\n<td align=\"left\">jISaHbe</td>\n<td align=\"left\">[indicates disinterest or lack of concern]</td>\n<td align=\"left\">Modifier</td>\n</tr>\n</tbody></table>\n\n<p>However, Mr Lloyd left out key parts of the sentence, and only declared <em>YIHoH! jISaHbe’!</em> leaving out the words for ‘one’ and ‘anyone&#39;. Mr Lloyd realized he’d made a mistake, but Mr Okrand didn’t want to make them shoot again, so he modified the rules of his language. He decided to change the meaning of <em>yI-</em> to only refer to singular objects, so that the “one” and “anyone” would be implied (and therefore unnecessary to speak).</p>\n\n<p>Perhaps I’m being too critical, though. While he did at times intend to violate common patterns in human languages <em>because</em> they were common, Mr Okrand still creatively approached the task in a way to make it more than just making it antithetical to human languages, and sometimes modeled features off of real languages, such as some found in the Himalayas. He found a way to build a language with features that <em>are</em> in human languages but in a combination that <em>isn’t</em> found in human languages, letting him make a language fit an alien culture that had already been developed, which is an impressive accomplishment no matter what. (And besides, I myself was not immune to drawing inspiration from real languages: I got the idea for the root of <em>Gondor</em> from the fact that when I was little, I read a book saying that there was a primitive language of which we know no words other than that <em>ond</em> meant &#39;stone&#39;, and I felt it fitting for the meaning.)</p>\n\n<p>Not everyone has to follow the same path in designing languages and worlds, and maybe I ought not be so set in my own ways. And in fact, I greatly rejoice at how people are so publicly speaking about language invention, and incorporating them into their projects, similar yet different to how I did. You may recall when I was younger, I told people about my ‘secret vice’—not so secret anymore—but now it seems there is little shame in such a hobby. It seems that today, many people are still making languages, be it for building their own fictional worlds, mere hobbies, or any other of many reasons.</p>\n\n<p>I find it interesting, Christopher, reflecting on my role in this history. It seems today that people consider me the ‘godfather’ of the modern ‘conlang’ movement. Since the publishing of the L.R. in 1955—as well as my posthumous publishing of <em>The Silmarillion</em>, thanks to your efforts—there have been plenty of works in television, film, and literature where the creators hire someone to invent the language(s) early in the development of the project. Mr Okrand went on to write the language Atlantean for Disney 2001 film ‘Atlantis: The Lost Empire’, while a David J. Peterson has made a career out of inventing languages for science fiction and fantasy projects, most famously the Dothraki and Valyrian languages for a series titled ‘Game of Thrones’ (based on a series of books which I hear are considered a sort of ‘spiritual successor’ to mine). And yet before beginning this journey, Mr Peterson didn’t even know about my work inventing languages <em>or</em> Mr Okrand’s (who, as far as I can tell, also drew no influence from me). So, how much of an influence did I actually have in this world of ‘conlanging’?</p>\n\n<p>If I had to guess, I would say Mr Okrand’s contributions to ‘Star Trek’ helped pilot a push toward invented languages in fiction, more so than my work, though I may have helped set the stage. There were others between us, who couldn’t be influenced by Mr Okrand, but there is certainly an uptick in the years and decades that follow the publication of Klingon, such that it is nearly expected in major works nowadays. Eagle-eyed fans are on the lookout for these details, so creators know they have to work harder to make their worlds realistic, in order to satisfy audiences. What a wonderful trend to see!</p>\n\n<p>Let me know what you think, when next you write me or next we speak. I have attached some materials for you to learn about this, so you may consider these facts and more. As always, I would love to hear your thoughts.</p>\n\n<p>It is an interesting future that the world has developed. How fascinating to think we helped shape it.</p>\n\n<pre><code>Your own father.\n</code></pre>\n\n<hr/>\n\n<p>For more on the development of Klingon and other new languages, Mr Okrand has done several lectures and interviews that can be found on the You Tube, <a href=\"https://www.youtube.com/watch?v=e5Did-eVQDc\">such as this video</a>. Additionally, he and Mr Peterson once gave <a href=\"https://www.youtube.com/watch?v=jZTnrF1G498\">an excellent presentation about their works</a>. They also co-hosted a few &#39;Reddit AMAs&#39; with some other conlangers: here is <a href=\"https://www.reddit.com/r/IAmA/comments/4xehwa/mathnuqtx%C3%ACtan_we_are_marc_okrand_creator_of/\">one from 2016</a>, and <a href=\"https://www.reddit.com/r/IAmA/comments/6vsigd/we_are_david_j_peterson_creator_of_dothraki_and/\">another one from 2017</a>.</p>\n\n<p>I also might recommend going through <a href=\"https://books.google.com/books/about/The_Letters_of_J_R_R_Tolkien.html?id=9eLCAgAAQBAJ\">the book of my letters that you published</a> to reacquaint yourself with some of my thoughts on these matters. I would pay special attention to letters 144, 180, 205, 257, 297, 324, and 347. You may also enjoy re-reading my lecture &#39;A Secret Vice&#39;, which you have published in the book <a href=\"https://books.google.com/books/about/The_Monsters_and_the_Critics.html?id=C1MAfDVCsRMC\"><em>The Monster and the Critics</em></a>.</p>\n\n<p>And for more on conlangs, perhaps you&#39;ll find helpful the book <a href=\"https://www.google.com/books/edition/In_the_Land_of_Invented_Languages/F9I3OJNx0hMC?hl=en&amp;gbpv=0\"><em>In the Land of Invented Languages</em></a> by Arika Okrent.</p>\n</div><!-- SC_ON -->",
  "score": 116,
  "permalink": "/r/AskHistorians/comments/mi4pma/looking_behind_the_scenes_i_struggle_to_approve/",
  "subreddit": "AskHistorians",
  "id": "mi4pma",
  "is_self": true,
  "media": null,
  "is_video": false
}