{
  "author": "futureIsYes",
  "the_new_excerpt": "https://www.bloomberg.com/news/articles/2021-03-24/tesla-tsla-and-elon-musk-s-dominance-is-threatened-by-volkswagen\n\nSummary:\n\n- Most of the article is about VW (maybe sponsored by VW? :-) )\n\n- VW become the #1 EV maker in EU last year\n\n----EV cars sales in EU: Dec 2019: TSLA: 110K , VW 46K; Dec…",
  "original_created_utc": 1616575837,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "https://www.bloomberg.com/news/articles/2021-03-24/tesla-tsla-and-elon-musk-s-dominance-is-threatened-by-volkswagen\n\n小结。\n\n- 文章的大部分内容都是关于大众的(也许是大众赞助的?:-) )\n\n- 大众去年成为欧盟第一大电动车制造商\n\n----EV汽车在欧盟的销量。2019年12月：TSLA：11万 ，大众4.6万；12月...",
      "title": "特斯拉主导地位的终结可能比表面上看起来更接近（彭博社"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "https://www.bloomberg.com/news/articles/2021-03-24/tesla-tsla-and-elon-musk-s-dominance-is-threatened-by-volkswagen\n\n小結。\n\n- 文章的大部分內容都是關於大衆的(也許是大衆贊助的?:-) )\n\n- 大衆去年成爲歐盟第一大電動車製造商\n\n----EV汽車在歐盟的銷量。2019年12月：TSLA：11萬 ，大衆4.6萬；12月...",
      "title": "特斯拉主導地位的終結可能比表面上看起來更接近（彭博社"
    }
  ],
  "title": "The End of Tesla’s Dominance May Be Closer Than It Appears (Bloomberg)",
  "created_utc": 1616590904,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.bloomberg.com/news/articles/2021-03-24/tesla-tsla-and-elon-musk-s-dominance-is-threatened-by-volkswagen\">https://www.bloomberg.com/news/articles/2021-03-24/tesla-tsla-and-elon-musk-s-dominance-is-threatened-by-volkswagen</a></p>\n\n<p>Summary:</p>\n\n<p>- Most of the article is about VW (maybe sponsored by VW? :-) )</p>\n\n<p>- VW become the #1 EV maker in EU last year</p>\n\n<p>----EV cars sales in EU: Dec 2019: TSLA: 110K , VW 46K;  Dec 2020: TSLA: 96K, VW: 174K</p>\n\n<p>- VW CEO (Diess) using the same strategy as Musk (creating media hype, &quot;power day&quot; similar to &quot;battery day, etc), stock has gone up 80% ytd, meme stock potential</p>\n\n<p>- This year, VW plans to deliver 1 million plug-in hybrid and fully electric vehicles, and Diess aims to surpass Tesla in EV sales no later than 2025. Some analysts predict it will happen much sooner.</p>\n\n<p>- VW can exploit something Tesla doesn’t have much of yet: scale. Dozens of brands that fill every nook and cranny of the auto market—and sales last year of 9.3 million vehicles (compared to TSLA&#39;s 0.5 million).</p>\n\n<p>- By 2025, VW and its partners will have more than 35,000 public chargers around the world, and planning half a dozen battery factories in EU.</p>\n\n<p>- VW aims to sell 26 million EVs  in the next 10 years</p>\n\n<p>- Other legacy auto makers following suit (e.g. GM planning to phase out diesel cars by 2035, Hyundai planning almost two dozen new models, Renualt having a super hit in EU with model Zoe, Ford&#39;s Mustang Mach-E)</p>\n\n<p>- Chinese companies rolling out budget EV models</p>\n\n<p>- Tons of new companies/SPACs (Rivian, Lucid, etc)</p>\n\n<p>- Just like netflix that paved the way for streaming video is now facing great competition from &quot;legacy&quot; companies like disney, HBO, amazon, etc, TSLA will also face the same struggle with the EV market, specially when the giants like Apple, Amazon, Google have EV ambitions of themselves</p>\n\n<p>- (maybe positive for TSLA) the biggest automaker in the world Toyota, still not fully committed to EV, and some major automakers like BMW do not think &quot;only EV after year xxxx&quot; is a good strategy because there are like 160 countries/markets to consider</p>\n\n<p>&#x200B;</p>\n\n<p>Opinion:</p>\n\n<p>- would have been nice to get some analysis about the software/AI aspect, as that is one of the main thing that TSLA is way ahead of others and legacy car makers seem to be struggling with</p>\n\n<p>- Chinese companies barely mentioned (and also aspects such as the recent Chinese rule of not using TSLA cars in military sensitive areas due to the cameras, which may give acceleration to LADAR based cars rather than camera based Evs, and I doubt TSLA will shift to that one..)</p>\n\n<p>&#x200B;</p>\n\n<p>What do you think?</p>\n\n<p>I thin the EV pie is very big and there is room for many. TSLA will be dominant for at least the next few years (maybe until 2025) and then maybe others will catch up if they play their cards right and some politics (like China) plays in their favour.</p>\n\n<p>PS: I don&#39;t have a position in TSLA (wanted to get in when it dipped but was waiting for sub 550 which didn&#39;t happen). I have small position in VW and Nio.</p>\n\n<p>EDIT 1: Just for the heck of it, I just bought a couple of TSLA at 655.</p>\n\n<p>EDIT 2: added 2 more TSLA at 638. </p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->",
  "score": 385,
  "permalink": "/r/stocks/comments/mc11i8/the_end_of_teslas_dominance_may_be_closer_than_it/",
  "subreddit": "stocks",
  "id": "mc11i8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752822100
}