{
  "author": "Nostalg33k",
  "original_created_utc": 1644060899,
  "title": "Congrats to beginners who survived the dive under 40K ! Bravo Bravo Bravo !",
  "created_utc": 1644082481,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey, to all who didn&amp;#39;t sell under 40K, congrats!&lt;/p&gt;\n\n&lt;p&gt;We are still far away from ATH BUT you are not one of those who sold at a loss in order to swing trade. The climb is not yet achieved and we may dive further but you have shown your balls of steel and deserve recognition.&lt;/p&gt;\n\n&lt;p&gt;Bonus points if you bought the dip under 40K ! You may even already be back in profit depending on how much your poured into the dip.&lt;/p&gt;\n\n&lt;p&gt;Honestly be proud of you, crypto is wild and can grind your nerves but in the long run you may make good money !&lt;/p&gt;\n\n&lt;p&gt;TLDR: Congrats to those who didn&amp;#39;t sell at a loss in the hope to swing trade.TLDR2: Obvious WOW congrats to those who were able to swing trade and successfully did it !&lt;/p&gt;\n\n&lt;p&gt;Let&amp;#39;s keep calm and continue to DCA/ buy dips/ but stay steady !&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 334,
  "permalink": "/r/CryptoCurrency/comments/sl4zki/congrats_to_beginners_who_survived_the_dive_under/",
  "subreddit": "CryptoCurrency",
  "id": "sl4zki",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hey, to all who didn't sell under 40K, congrats!\n\nWe are still far away from ATH BUT you are not one of those who sold at a loss\nin order to swing trade. The climb is not yet achieved and we may dive further\nbut you have shown your balls of steel and deserve recognition.\n\nBonus points if you bought…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "おいおい、40K以下で売れなかった皆さん、おめでとうございます。\n\nATHはまだ遠いけど、損切りした人はいないよね？\nスイングトレードをするために。まだ上昇を達成したわけではなく、さらに急降下する可能性があります。\nしかし、あなたは鋼鉄の玉を見せたのだから、評価に値する。\n\nもし、あなたが買ったなら、ボーナスポイント...",
      "title": "40K以下で潜った初心者の方、おめでとうございます。ブラボー、ブラボー、ブラボー"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嘿，对所有没有卖到4万以下的人来说，祝贺你们！我们离ATH还很远。\n\n我们离ATH还很远，但你不属于那些亏本卖出的人。\n以便进行波段交易。攀升还没有实现，我们可能会进一步下探\n但你已经展示了你的钢铁般的胆量，值得肯定。\n\n如果你买了...",
      "title": "祝贺那些在40K以下的潜水中幸存下来的初学者们 ! 好样的！好样的！好样的"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嘿，對所有沒有賣到4萬以下的人來說，祝賀你們！我們離ATH還很遠。\n\n我們離ATH還很遠，但你不屬於那些虧本賣出的人。\n以便進行波段交易。攀升還沒有實現，我們可能會進一步下探\n但你已經展示了你的鋼鐵般的膽量，值得肯定。\n\n如果你買了...",
      "title": "祝賀那些在40K以下的潛水中倖存下來的初學者們 ! 好樣的！好樣的！好樣的"
    }
  ]
}