{
  "author": "anyawu",
  "the_new_excerpt": "https://imgur.com/a/ruIvZu6\n\nAs you can see in the screenshot BitPay is now forcing us customers to register,\nidentify ourselves and set up a wallet on BitPays website to increase their user\nbase --- in order to pay with bitcoins for a pizza. This is some NSA bullshit.\nUs customers whom they are…",
  "original_created_utc": 1610667737,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "https://imgur.com/a/ruIvZu6\n\n从截图中可以看到，BitPay现在正在强迫我们客户注册。\n在BitPays网站上建立一个钱包，以增加他们的用户量。\n为了用比特币支付一个披萨。这是一些国家安全局的废话。\n我们这些顾客他们...",
      "title": "警告!!!: BitPay现在强迫每一个用户在使用比特币支付时都要注册并确认自己的身份。不要支持BitPay! 给你最喜欢的网上商店发邮件，告诉他们尽快改变。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "https://imgur.com/a/ruIvZu6\n\n從截圖中可以看到，BitPay現在正在強迫我們客戶註冊。\n在BitPays網站上建立一個錢包，以增加他們的用戶量。\n爲了用比特幣支付一個披薩。這是一些國家安全局的廢話。\n我們這些顧客他們...",
      "title": "警告!!!: BitPay現在強迫每一個用戶在使用比特幣支付時都要註冊並確認自己的身份。不要支持BitPay! 給你最喜歡的網上商店發郵件，告訴他們儘快改變。"
    }
  ],
  "title": "WARNING!!!: BitPay is now forcing EVERY user to both register and identify themselves when paying with bitcoin. DO NOT SUPPORT BitPay! Email your favorite online stores and tell them to change ASAP",
  "created_utc": 1610694219,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://imgur.com/a/ruIvZu6\">https://imgur.com/a/ruIvZu6</a></p>\n\n<p>As you can see in the screenshot BitPay is now forcing us customers to register, identify ourselves and set up a wallet on BitPays website to increase their user base --- in order to pay with bitcoins for a pizza. This is some NSA bullshit. Us customers whom they are siphoning out from all online stores where BitPays payment gateway have been implemented into. Online store owners who most likely thought BitPay was a smooth and easy way to implement another payment gateway/bitcoin. Now they will be losing customers instead.</p>\n\n<p>This is extremely shitty for bitcoin and what bitcoin stands for. We are supposed to be able to send bitcoin freely to an address without being forced to register anywhere. That is exactly what a p2p bitcoin payment / transaction is: from one address to another.</p>\n\n<p>I therefore suggest that all of us:</p>\n\n<h1>STOP USING BITPAY - NEVER pay an invoice with them again. NEVER!!!</h1>\n\n<p>Email all your favorite online stores who uses BitPay and ask them to immediately gateway to any of the following (in no particular order):</p>\n\n<ul>\n<li>BTCPay: <a href=\"https://en.bitcoin.it/wiki/BTCPay\">https://en.bitcoin.it/wiki/BTCPay</a> and <a href=\"https://btcpayserver.org/\">https://btcpayserver.org/</a></li>\n<li>CoinPayments: <a href=\"https://www.coinpayments.net/\">https://www.coinpayments.net/</a></li>\n<li>CoinGate: <a href=\"https://coingate.com/\">https://coingate.com/</a></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p><strong>I will be emailng something like this:</strong></p>\n\n<p>&quot;Dear online store,</p>\n\n<p>BitPay, i.e. the company you are using for bitcoin payments, have now started to force us customers to register an account on their website and will ask us for a scan of ID, passport, selfie with passport, video recording saying random words and a proof of address in order to let us pay with bitcoins in YOUR online store.  Neither I nor my friends support this and will therefore never shop here until this is changed. Would you be interested in using a payment method where you are asked to submit all of those requirements? Most definitely not. So why force us?</p>\n\n<p>I kindly ask you to immediately change your bitcoin payment gateway to any of the following:</p>\n\n<ul>\n<li>CoinPayments: <a href=\"https://www.coinpayments.net/\">https://www.coinpayments.net/</a></li>\n<li>CoinGate: <a href=\"https://coingate.com/\">https://coingate.com/</a></li>\n<li>BTCPay: <a href=\"https://en.bitcoin.it/wiki/BTCPay\">https://en.bitcoin.it/wiki/BTCPay</a> and <a href=\"https://btcpayserver.org/\">https://btcpayserver.org/</a></li>\n</ul>\n\n<p>They are cheaper, better, has better support, offers EUR/USD withdrawals, and likeable by all in the  bitcoin community. The only reason BitPay is &quot;the biggest&quot; is because they were first.</p>\n\n<p>There is an ongoing BitPay boycott in the whole bitcoin community. Your website will guaranteed be blacklisted on lots of bitcoin websites (with millions of users..) and marked as potential fraud in case you keep using BitPay. I can guarantee you will lose all bitcoin customers.</p>\n\n<p>Best regards&quot;</p>\n\n<h1>This is a real serious threat. Please spread the information and upvote for visibility. The biggest bitcoin gateway is going in the wrong direction. Lets kick them out of this community for good. Last thing we want to is a company stopping the adoption and making it harder to use bitcoin.</h1>\n</div><!-- SC_ON -->",
  "score": 555,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/NaYjaEVMeH5Exxg-szU_TtMSeUSAysFOEKiODssKezU.jpg?auto=webp&s=1cefe8e898ba890f55b73dd7690380ba0f9466b7",
          "width": 800,
          "height": 576
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/NaYjaEVMeH5Exxg-szU_TtMSeUSAysFOEKiODssKezU.jpg?width=108&crop=smart&auto=webp&s=ce6ea3f122919bff7d4ff05617b5e5ed165fe803",
            "width": 108,
            "height": 77
          },
          {
            "url": "https://external-preview.redd.it/NaYjaEVMeH5Exxg-szU_TtMSeUSAysFOEKiODssKezU.jpg?width=216&crop=smart&auto=webp&s=507a23b7b1f0f338490656ca7cc60105449d1e5b",
            "width": 216,
            "height": 155
          },
          {
            "url": "https://external-preview.redd.it/NaYjaEVMeH5Exxg-szU_TtMSeUSAysFOEKiODssKezU.jpg?width=320&crop=smart&auto=webp&s=4d218f77edc6c105eea2737999e75bfbdfb709c4",
            "width": 320,
            "height": 230
          },
          {
            "url": "https://external-preview.redd.it/NaYjaEVMeH5Exxg-szU_TtMSeUSAysFOEKiODssKezU.jpg?width=640&crop=smart&auto=webp&s=689bf8ad23f6d7b6cc44fde05e8c5bdf637dc2e6",
            "width": 640,
            "height": 460
          }
        ],
        "variants": {},
        "id": "i6MDqyWEFW9y3wA3xNb6QI_ImczYY_TD4J3NRB1oVvc"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/Bitcoin/comments/kxhxv7/warning_bitpay_is_now_forcing_every_user_to_both/",
  "subreddit": "Bitcoin",
  "id": "kxhxv7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1611311212242
}