{
  "author": "psychoticworm",
  "the_new_excerpt": "This is not financial advice\n\nIf you FOMO'd at the top, its ok. It might take awhile to recover, but it will\neventually recover, and then some. DO NOT SELL FOR A LOSS. Crypto isn't dead, in\nfact its growing faster in just the last 4 months than anytime in its history.\n\nYou will need to DCA over the…",
  "original_created_utc": 1621784681,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは財務上のアドバイスではありません\n\nこのページのトップへ戻ることができなかったとしても、それは大丈夫です。回復するのに時間がかかるかもしれませんが、いずれは回復します。\nして、さらに回復するでしょう。損失を出しても売らないでください。暗号は死んでいません。\n実際、この4ヶ月間で、これまでの歴史の中で最も急速に成長しています。\n\nあなたは、この先DCAを回す必要があります...",
      "title": "いいえ、暗号は死んでいません。これは暴落です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这不是财务建议\n\n如果你在顶部的时候被吓坏了，那也没关系。它可能需要一段时间来恢复，但它会\n最终会恢复，然后再恢复一些。不要在亏损的情况下出售。加密货币并没有死，事实上\n事实上，它在过去4个月的增长速度比历史上任何时候都快。\n\n你将需要DCA超过...",
      "title": "不，加密货币没有死，但这是一次崩溃，接下来该怎么做？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這不是財務建議\n\n如果你在頂部的時候被嚇壞了，那也沒關係。它可能需要一段時間來恢復，但它會\n最終會恢復，然後再恢復一些。不要在虧損的情況下出售。加密貨幣並沒有死，事實上\n事實上，它在過去4個月的增長速度比歷史上任何時候都快。\n\n你將需要DCA超過...",
      "title": "不，加密貨幣沒有死，但這是一次崩潰，接下來該怎麼做？"
    }
  ],
  "title": "NO, Crypto isn't dead, this is a crash though, and heres what to do next",
  "created_utc": 1621821514,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><em>This is not financial advice</em></p>\n\n<p>If you FOMO&#39;d at the top, its ok. It might take awhile to recover, but it will eventually recover, and then some. DO NOT SELL FOR A LOSS. Crypto isn&#39;t dead, in fact its growing faster in just the last 4 months than anytime in its history.</p>\n\n<p>You will need to DCA over the next few months though. Last crash took 1 year to hit bottom, and 2 years to see green (from the last ATH).  If you DCA, you will see green sooner than anyone who bought at the top and is just hodling.</p>\n\n<p>Right now what is happening is whales that bought into crypto at the bottom in 2018-2019 after the first historical crash, are selling their positions.They are selling them to YOU and calling it a dip. They are telling you to buy this dip. You can if you want, it will help lower your overall average, but theres no telling where the bottom is. Personally I think BTC will hit bottom around 10k-15k, And ETH around 400-700, but I could be wrong, which is why its not a terrible idea to DCA anyway. But just be aware that the &#39;dips&#39; you&#39;re buying are actually what the whales are selling to you. They plan on buying back in at some point.</p>\n\n<p>Which brings me to my next point. This may take a few months to a couple years to recover from, but don&#39;t worry, its only temporary. This is a good and necessary process in markets to shake off the paper hands and see who is really in it for the long run. Don&#39;t listen to the news about China or whatever other FUD is being created to get you to sell and think its the end of crypto. Crypto is just beginning.</p>\n</div><!-- SC_ON -->",
  "score": 762,
  "permalink": "/r/CryptoCurrency/comments/njack2/no_crypto_isnt_dead_this_is_a_crash_though_and/",
  "subreddit": "CryptoCurrency",
  "id": "njack2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197385270
}