{
  "author": "Gilgameshbrah",
  "original_created_utc": 1636391786,
  "title": "How can the 'sexuality debate' even exist?",
  "created_utc": 1636420382,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I really don&#39;t understand it. I can&#39;t imagine a scenario where I&#39;d be even mildly interested in someone else&#39;s sexuality (if I&#39;m not trying to get with them).</p>\n\n<p>How anyone can have enough energy or time to not only think about, but dislike other people for their sexual preferences is beyond me.</p>\n\n<p>How it came to be a discussion is beyond my imagination, the fact that anyone is interested in the topic just baffles my mind.</p>\n\n<p>And I mean this with all due respect - Who the f*ck cares? How can anyone care? (apart from maybe the scientific community, sociological studies and so on - purely in an objective way). Because it tells me nothing about that person. Not a single thing. </p>\n\n<p>I acknowledge the struggle, but I don&#39;t see how it even got far enough to be a struggle. Not a single rational scenario comes to mind where this information would be important to me in judging another person. Not once did I ever even feel compelled to ask a person about their sexual preferences, and I&#39;m closing in on 30. Not even my closest friends...</p>\n\n<p>So why is it such a huge debate?</p>\n</div><!-- SC_ON -->",
  "score": 116,
  "permalink": "/r/TooAfraidToAsk/comments/qpi7iy/how_can_the_sexuality_debate_even_exist/",
  "subreddit": "TooAfraidToAsk",
  "id": "qpi7iy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I really don't understand it. I can't imagine a scenario where I'd be even\nmildly interested in someone else's sexuality (if I'm not trying to get with\nthem).\n\nHow anyone can have enough energy or time to not only think about, but dislike\nother people for their sexual preferences is beyond me.\n\nHow…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "本当に理解できません。私は、他人のセクシュアリティに少しでも興味を持つようなシナリオを想像できません。\n他人のセクシュアリティに少しでも興味を持つようなシナリオは想像できません（相手と付き合おうとしていない場合）。\nなくても）。\n\n他人の性的嗜好について考えるだけでなく、それを嫌うだけのエネルギーや時間がある人がいるなんて\n考えるだけでなく、他人の性的嗜好を嫌うほどのエネルギーや時間を持てるのか、私には理解できません。\n\nどのように...",
      "title": "セクシュアリティの議論」はどうして存在するのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我真的不明白。我无法想象我在什么情况下会对别人的性行为产生哪怕是轻微的兴趣。\n对别人的性行为有轻微的兴趣（如果我不是想和他们在一起）。\n他们）。\n\n怎么会有人有足够的精力或时间，不仅考虑，而且不喜欢\n其他人的性偏好，我无法理解。\n\n如何...",
      "title": "性辩论 \"怎么可能存在？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我真的不明白。我無法想象我在什麼情況下會對別人的性行爲產生哪怕是輕微的興趣。\n對別人的性行爲有輕微的興趣（如果我不是想和他們在一起）。\n他們）。\n\n怎麼會有人有足夠的精力或時間，不僅考慮，而且不喜歡\n其他人的性偏好，我無法理解。\n\n如何...",
      "title": "性辯論 \"怎麼可能存在？"
    }
  ]
}