{
  "author": "roiseeker",
  "original_created_utc": 1655823776,
  "title": "Are claims that the electromagnetic field of the heart is 100 times stronger than that of the brain true? Is it even capable of emiting such large fields?",
  "created_utc": 1655850577,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I&amp;#39;ve been trying to investigate these New Age claims that say our heart is basically an EMF transmitter but didn&amp;#39;t find any convincing proof that this is actually true.&lt;/p&gt;\n\n&lt;p&gt;Obviously the heart operates through all sorts of phenomena, electricity being involved as well. Where there is current, there are electromagnetic fields. So it&amp;#39;s obvious that SOME field could be detected if we would have a sensitive enough device.&lt;/p&gt;\n\n&lt;p&gt;But the problem is their claims seem especially outlandish. The research linked below argues that this EMF can even be detected several feet away, which sounds a bit crazy. If the heart would&amp;#39;ve had such a strong EMF, it would&amp;#39;ve been more common knowledge in our society. I mean, maybe they are kind of right. After all, they aren&amp;#39;t mentioning any concrete values, they just say it&amp;#39;s 100 times stronger than the brain&amp;#39;s field (which I also doubt).&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.researchgate.net/figure/The-hearts-magnetic-field-which-is-the-strongest-rhythmic-field-produced-by-the-human_fig11_293944391\"&gt;https://www.researchgate.net/figure/The-hearts-magnetic-field-which-is-the-strongest-rhythmic-field-produced-by-the-human_fig11_293944391&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;I first heard about this claim here: &lt;a href=\"https://youtu.be/ta4w28IlzPE?t=1410\"&gt;https://youtu.be/ta4w28IlzPE?t=1410&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;This man named Joe Dispenza was making a lot of sense up to the timestamp I&amp;#39;ve selected.&lt;br/&gt;\nWhen he said the heart produces something similar to a WiFi signal, 3 meters wide, that&amp;#39;s when my &amp;quot;quack alarm&amp;quot; started going off.&lt;/p&gt;\n\n&lt;p&gt;What&amp;#39;s your opinion? Is all of this pseudoscience or is there any truth to it?&lt;br/&gt;\nDo you have any research to back up these claims?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/askscience/comments/vhfduv/are_claims_that_the_electromagnetic_field_of_the/",
  "subreddit": "askscience",
  "id": "vhfduv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So I've been trying to investigate these New Age claims that say our heart is\nbasically an EMF transmitter but didn't find any convincing proof that this is\nactually true.\n\nObviously the heart operates through all sorts of phenomena, electricity being\ninvolved as well. Where there is current, there…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "だから私は、私たちの心臓は基本的に電磁波発信器であるというニューエイジの主張を調査しようとしてきた。\nしかし、それが事実であるという説得力のある証拠を見つけることはできませんでした。\n実際に真実であることを納得させる証拠を見つけることができませんでした。\n\n明らかに心臓はあらゆる種類の現象を通じて作動し、電気も関与している。\n関与している。電流があるところ、そこに...",
      "title": "心臓の電磁場は脳の電磁場の100倍も強いという話は本当なのか？また、そのような大きな磁場を出すことができるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我一直试图调查这些新时代的主张，说我们的心是\n基本上是一个电磁场发射器，但没有找到任何令人信服的证据，证明这是\n实际上是真的。\n\n很明显，心脏是通过各种现象来运作的，电也是如此。\n也参与其中。哪里有电流，哪里就有...",
      "title": "关于心脏的电磁场比大脑的电磁场强100倍的说法是真的吗？它甚至能够发出如此大的场吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我一直試圖調查這些新時代的主張，說我們的心是\n基本上是一個電磁場發射器，但沒有找到任何令人信服的證據，證明這是\n實際上是真的。\n\n很明顯，心臟是通過各種現象來運作的，電也是如此。\n也參與其中。哪裏有電流，哪裏就有...",
      "title": "關於心臟的電磁場比大腦的電磁場強100倍的說法是真的嗎？它甚至能夠發出如此大的場嗎？"
    }
  ]
}