{
  "author": "ToesyToeNails",
  "original_created_utc": 1655887614,
  "title": "Why are dress codes allowed to be sexist?",
  "created_utc": 1655926696,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My local bank for example. All women have to wear skirts. No getting around that. Women in a managerial position can wear slacks, but wage slaves, they have to wear skirts. Women are encouraged to wear makeup. It&amp;#39;s viewed as unprofessional for them to not wear makeup to work. Flip this into men, I wouldn&amp;#39;t be surprised if a man got disciplined for wearing makeup to work regardless of how flawlessly done or neutral looking it is. I&amp;#39;ve also heard in some jobs women have to wear heels as part of their dress code. I have an ex who had to wear heels to work and all she did was wait tables and polish silverware. Idk how heels come into that?&lt;/p&gt;\n\n&lt;p&gt;The sexism is blatant, but why is it okay? Why is it allowed?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/NoStupidQuestions/comments/vi0imk/why_are_dress_codes_allowed_to_be_sexist/",
  "subreddit": "NoStupidQuestions",
  "id": "vi0imk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "My local bank for example. All women have to wear skirts. No getting around\nthat. Women in a managerial position can wear slacks, but wage slaves, they have\nto wear skirts. Women are encouraged to wear makeup. It's viewed as\nunprofessional for them to not wear makeup to work. Flip this into men,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "例えば、私の地元の銀行。女性は全員スカートを履かなければなりません。それを回避することは\nということです。管理職の女性はスラックスを履くことができますが 賃金奴隷の女性はスカートを履かなければなりません\nスカートを履かなければならないのです。女性は化粧をすることが奨励されています。化粧をしないのは\n化粧をしないのはプロ失格とみなされる。これを男性に当てはめると...",
      "title": "なぜドレスコードは性差別が許されるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "例如，我的当地银行。所有妇女都必须穿裙子。绕不开的\n这一点。担任管理职位的妇女可以穿休闲裤，但工资奴隶，他们必须\n必须穿裙子。人们鼓励妇女化妆。不化妆上班被认为是\n她们不化妆上班是不专业的。把这一点换成男人，...",
      "title": "为什么允许着装规范有性别歧视？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "例如，我的當地銀行。所有婦女都必須穿裙子。繞不開的\n這一點。擔任管理職位的婦女可以穿休閒褲，但工資奴隸，他們必須\n必須穿裙子。人們鼓勵婦女化妝。不化妝上班被認爲是\n她們不化妝上班是不專業的。把這一點換成男人，...",
      "title": "爲什麼允許着裝規範有性別歧視？"
    }
  ]
}