{
  "author": "divertss",
  "original_created_utc": 1626313024,
  "title": "I feel like this is an unpopular opinion, we are not in a bull run anymore. Not for now at least.",
  "created_utc": 1626327215,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The definition of a bull run is a period of time in which asset prices are rising. Bear run is when assets are declining in value.</p>\n\n<p>We have crashed 50%. Bitcoins been in the 30k range since May. 2 months at down 50% is the opposite of a bull run. I see so many posts saying “at the end of this bull run” and hear tons of youtubers saying it too. We aren’t in a bull run, this is bear territory. When we start seeing serious increases we can say we are on a bull run. </p>\n\n<p>There’s nothing wrong with going bull to bear and back to bull. It’s just the way it goes. A 2 month lull that’s down 50% is called a bear run, not just another part of a bull run. Can’t call everything a bull run lol.</p>\n\n<p>I feel like this is an unpopular opinion cause I see so many people saying we are still in a bull run and it’s going to last til next year or whatever. February to May was the bull run. May to current is a bear run. More bull runs on the way. But this is not it.</p>\n</div><!-- SC_ON -->",
  "score": 184,
  "permalink": "/r/CryptoCurrency/comments/okiltr/i_feel_like_this_is_an_unpopular_opinion_we_are/",
  "subreddit": "CryptoCurrency",
  "id": "okiltr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The definition of a bull run is a period of time in which asset prices are\nrising. Bear run is when assets are declining in value.\n\nWe have crashed 50%. Bitcoins been in the 30k range since May. 2 months at down\n50% is the opposite of a bull run. I see so many posts saying “at the end of\nthis bull…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ブルランの定義は、資産価格が上昇している期間である。\n上昇することです。ベアランとは、資産の価値が下がっているときのこと。\n\n50％暴落しました。ビットコインは5月以降、30k台で推移。ダウンで2ヶ月\n50%というのはブルランの逆です。私は多くの投稿を見てきましたが、その中には「今年の終わりには\nこのブル...",
      "title": "これは不人気な意見のような気がしますが、もうブルランではありません。少なくとも、今はそうではありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "牛市运行的定义是资产价格上涨的时期。\n上升。熊市运行是指资产价值下降的时候。\n\n我们已经崩溃了50%。比特币自5月以来一直在30K的范围内。2个月的下跌\n50%是牛市运行的反面。我看到很多帖子说 \"在这轮牛市结束时\n这个牛市...",
      "title": "我觉得这是一个不受欢迎的观点，我们已经不在牛市中了。至少现在不是。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "牛市運行的定義是資產價格上漲的時期。\n上升。熊市運行是指資產價值下降的時候。\n\n我們已經崩潰了50%。比特幣自5月以來一直在30K的範圍內。2個月的下跌\n50%是牛市運行的反面。我看到很多帖子說 \"在這輪牛市結束時\n這個牛市...",
      "title": "我覺得這是一個不受歡迎的觀點，我們已經不在牛市中了。至少現在不是。"
    }
  ]
}