{
  "author": "Cryptodragonnz",
  "the_new_excerpt": "This came up on one of my crypto telegram alerts, it happened in two transfers.\nSo far CZ hasn’t said anything.\n\nPotential reasons are that whales are scooping up large amounts of coins (or an\ninstitutional investor along the lines of Microstrategy). There is also the\npossibility of a hack, but in…",
  "original_created_utc": 1618800475,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは私のcrypto telegramのアラートの1つに出てきたもので、2回の転送で起こりました。\n今のところCZは何も言っていません。\n\n考えられる理由は、クジラが大量のコインをすくい上げていることです（あるいはマイクロストラテジーのような機関投資家）。\nマイクロストラテジーのような機関投資家）。) また、ハッキングの可能性もあります。\nハッキングの可能性もありますが、それは...",
      "title": "たった1時間で50億ドルのBTCがBinanceから引き出された模様、潜在的には1つの企業によるもの"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是在我的一个加密电报提醒中出现的，它发生在两次转账中。\n到目前为止，CZ还没有说什么。\n\n潜在的原因是，鲸鱼正在挖走大量的币（或一个\n微策略》一线的机构投资者）。) 还有\n黑客的可能性，但在。",
      "title": "50亿美元的BTC似乎在短短一个小时内从Binance撤出，可能是由一个实体撤出的"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是在我的一個加密電報提醒中出現的，它發生在兩次轉賬中。\n到目前爲止，CZ還沒有說什麼。\n\n潛在的原因是，鯨魚正在挖走大量的幣（或一個\n微策略》一線的機構投資者）。) 還有\n黑客的可能性，但在。",
      "title": "50億美元的BTC似乎在短短一個小時內從Binance撤出，可能是由一個實體撤出的"
    }
  ],
  "title": "$5 Billion in BTC appears to have been withdrawn from Binance in just one hour, potentially by one entity",
  "created_utc": 1618828564,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This came up on one of my crypto telegram alerts, it happened in two transfers.  So far CZ hasn’t said anything.</p>\n\n<p>Potential reasons are that whales are scooping up large amounts of coins (or an institutional investor along the lines of Microstrategy). There is also the possibility of a hack, but in that case I think we’d know by know already.</p>\n\n<p>Also likely is binance setting up some kind of new wallet, say to bolster its wrapped BTC platform on BSC (although if so it would be a new wallet as this is an address with no previous interactions)</p>\n\n<p>Leaving aside the (unlikely) chance of a binance hack, I’d say this is pretty bullish regardless. That adds up to nearly 90k bitcoins, around the same amount that Michael Saylor is hodling.</p>\n\n<p>So pretty damn bullish now we have that many bitcoins which have either been transferred to (hopefully) a strong hodler, or alternatively it will be wrapped and put into a custodial wallet, reducing sell pressure. And well timed, just as the markets are about to flip green on the daily.   (Also recall that in the 1-3 days before our correction yesterday we saw the opposite - lots of coins going ONTO binance)</p>\n\n<p>By the way, the app is called CryptoQuant Alerts (Beta) – its one of the apps I mentioned on a previous post about telegram.  They appear to be examining the data and I’ll update as news comes in.  </p>\n\n<p>EDIT:  11k bitcoins has indeed gone into a wrapped B-BTC contract it seems so they are expanding the amount of wrapped bitcoins.  Quite bullish for BNB generally (i.e. more people using it) and I saw BNB pumped soon after.  The other coins have gone to a new storage wallet, perhaps waiting in case it needs to be allocated later?  </p>\n\n<p>Kind of strange though that Binance &quot;owns&quot; that much crypto in its own treasury.  Perhaps they did an OTC deal and bought BTC from some of their whales who use the exchange </p>\n</div><!-- SC_ON -->",
  "score": 305,
  "permalink": "/r/CryptoCurrency/comments/mtrgzv/5_billion_in_btc_appears_to_have_been_withdrawn/",
  "subreddit": "CryptoCurrency",
  "id": "mtrgzv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171521468
}