{
  "author": "cefpodoxime",
  "the_new_excerpt": "https://www.barrons.com/articles/stock-market-hawkish-fed-51624052659\n\nThe Federal Open Market Committee’s latest policy communications raised more\nquestions than answers. Perhaps the biggest one: Can the Fed ever really raise\ninterest rates?\n\n\n\nAt face value, and with a big dose of relativity, this…",
  "original_created_utc": 1624153501,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "https://www.barrons.com/articles/stock-market-hawkish-fed-51624052659\n\n米連邦公開市場委員会（FOMC）の最新の政策コミュニケーションは、答えよりも疑問を投げかけた。\n答えよりも疑問の方が多かった。おそらく最大のものは FRBは本当に金利を上げることができるのか？\n利率を本当に上げることができるのか？\n\n\n\n額面通りに、そして相対性を大いに考慮した上で、この...",
      "title": "バロンズ 投資家は連邦準備制度理事会のはったりを聞いている。\"先物市場は事実上、FRBに「あなたを信じていません」と言っている。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "https://www.barrons.com/articles/stock-market-hawkish-fed-51624052659\n\n联邦公开市场委员会的最新政策沟通提出了更多的\n问题多于答案。也许最大的问题是。美联储是否能真正提高\n利率吗？\n\n\n\n从表面上看，加上相对性的大剂量，这...",
      "title": "巴伦周刊》。投资者正在对美联储的虚张声势提出质疑。\"我们不相信你\"，期货市场正在有效地告诉美联储。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "https://www.barrons.com/articles/stock-market-hawkish-fed-51624052659\n\n聯邦公開市場委員會的最新政策溝通提出了更多的\n問題多於答案。也許最大的問題是。美聯儲是否能真正提高\n利率嗎？\n\n\n\n從表面上看，加上相對性的大劑量，這...",
      "title": "巴倫週刊》。投資者正在對美聯儲的虛張聲勢提出質疑。\"我們不相信你\"，期貨市場正在有效地告訴美聯儲。"
    }
  ],
  "title": "Barron's: Investors are calling the Federal Reserve’s bluff. “We don’t believe you,” the futures market is effectively telling the Fed",
  "created_utc": 1624167572,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.barrons.com/articles/stock-market-hawkish-fed-51624052659\">https://www.barrons.com/articles/stock-market-hawkish-fed-51624052659</a></p>\n\n<p>The Federal Open Market Committee’s latest policy communications raised more questions than answers. Perhaps the biggest one: Can the Fed ever really raise interest rates?</p>\n\n<p>&#x200B;</p>\n\n<p>At face value, and with a big dose of relativity, this past week’s updated summary of economic projections and commentary from Chairman Jerome Powell marks a hawkish turn. Officials signaled rates could rise in 2023, earlier than previously telegraphed. And during his press conference, Powell acknowledged for the first time that inflation may turn out to be hotter and more persistent than the Fed has projected—no small change for a person who has pushed the idea of transitory inflation, says Tom Porcelli, chief U.S. economist at RBC Capital Markets.</p>\n\n<p>&#x200B;</p>\n\n<p>But when you take a step back, the Fed remains about as dovish as ever. When the consumer-price index is running at 5%, it’s hardly hawkish to say there is a chance price acceleration is faster and lasts longer than anticipated. It already is, and it already has.</p>\n\n<p>&#x200B;</p>\n\n<p>Powell, like past Fed chiefs, told investors to take the so-called dot plot of officials’ economic projections with a big grain of salt. But to the extent the dots are useful for reading the internal debate, they still show that only three members changed their view for raising rates in 2022, not enough to lift the median forecast from 0.125%. How hawkish can this all really be if, all told, the most skeptical members are thinking about raising rates by 0.5% in 2023? Moreover, the dots’ 2023 message runs counter to the Fed’s own updated economic forecasts. It still sees inflation hardly above 2% in 2022 and 2023, despite the new tolerance for above-target inflation, and it predicts a meaningful slowdown in growth after this year. </p>\n\n<p>&#x200B;</p>\n\n<p>Stocks and bonds initially sold off on Wednesday after the Fed’s policy meeting but quickly recovered. The Nasdaq Composite index, full of expensive growth stocks, closed just off a record high on Thursday and bore the lightest brunt of Friday’s selloff after St. Louis Fed President James Bullard said he expects the first increase in late 2022 (Bullard is a voting member next year). Still, Friday’s declines are hardly a tantrum and the yield on the 10-year Treasury note was lower Friday than where it was before the Fed news. More interesting still is how the 5-year/5-year overnight indexed swap has traded.</p>\n\n<p>&#x200B;</p>\n\n<p>The 5-year/5-year OIS captures investors’ expectations for the peak fed-funds rate in the business cycle, says Joe LaVorgna, chief economist for the Americas at Natixis. When long rates were selling off earlier this year, the gauge rose to about 2.40%, he says, suggesting traders assumed that the next tightening cycle would look broadly like the last one. After the Fed’s meeting on Wednesday, the gauge was yielding 1.94%. At press time on Friday, it was at 1.71%—the lowest yield since early February.</p>\n\n<p>&#x200B;</p>\n\n<p>“We don’t believe you,” the futures market is effectively telling the Fed, “and saying it loud and clear with a megaphone,” LaVorgna says.</p>\n\n<p>&#x200B;</p>\n\n<p>Recent history has sided with the market, not policy makers, he says. He points to the long-run equilibrium funds rate, which the Fed had to keep revising lower amid a falling 5-year/5-year OIS. Once thought to be around 4%, the Fed’s long-run rate estimate is now between 2% and 3%. The high end of that range still appears far too high if the 5-year/5-year OIS is a guide.</p>\n\n<p>&#x200B;</p>\n\n<p>It makes sense. Financial markets’ sensitivity to monetary policy has never been higher. The Fed’s balance sheet has doubled since the end of the 2008 financial crisis, now 40% of gross domestic product. By buying massive amounts of bonds, the Fed has lowered rates and used asset prices—especially stocks—as a primary tool for monetary policy. That’s through the wealth effect, or the tendency for consumers (which make up two-thirds of gross domestic product) to spend more as their assets grow. Any correction in stock prices would negatively affect economic growth and thus limit the Fed’s ability to tighten, the logic goes.</p>\n\n<p>&#x200B;</p>\n\n<p>Less discussed: the prospect of further fiscal spending would itself make tapering bond purchases a tall order. The Fed has become such a dominant force in the bond market and would presumably need to keep buying the additional debt as the Treasury incurs it. (The Biden administration has proposed a $6 trillion budget for 2022).</p>\n\n<p>&#x200B;</p>\n\n<p>That’s one piece of the argument that the Fed won’t be able to meaningfully tighten. Another is the debt side of the economy. If the Fed was unable to lift rates above 2.5% during the last tightening cycle, and had to cut rates in several meetings before the pandemic prompted its emergency actions early last year, why would it be able to raise now? Since then, U.S. households, businesses, and the federal government have grown only more indebted.</p>\n\n<p>&#x200B;</p>\n\n<p>“When an economy is running a debt-to-GDP ratio at 100% or more and growth is debt-driven, it’s very hard to raise rates,” LaVorgna says. “The Fed is in a box and I don’t think it can get out of it.”</p>\n\n<p>&#x200B;</p>\n\n<p>The upshot? Easy money is likely to be flowing well beyond 2023. For now, that would translate into continuing stock-market gains, especially in rate-sensitive areas like technology. What that means for the U.S. economy is another question, and what it means for markets longer term is yet another.</p>\n\n<p>&#x200B;</p>\n\n<p>To LaVorgna, it probably all leads to what he calls secular stagnation. A euphemism, perhaps, for stagflation.</p>\n\n<p>&#x200B;</p>\n\n<p>Investors worried about inflation remain no less concerned. The Fed tiptoed toward acknowledging that current policy doesn’t square with reality, but it didn’t really move the needle, says Peter Boockvar, chief investment officer at Bleakley Advisory Group. “I’m someone who thinks the Fed has been doing 200 miles per hour in a 50 mph speed zone. I saw Powell slow down to 175.”</p>\n\n<p>&#x200B;</p>\n\n<p>Boockvar remains long areas that hold up best during periods of rising inflation, including energy and agriculture stocks, precious metals, and Asian and European equities. “Inflation is now a Main Street story,” he says. “I’m gritting my teeth and sticking to it.”</p>\n\n<p>&#x200B;</p>\n\n<p>So too, it seems, will the Fed. It may have no other choice.</p>\n</div><!-- SC_ON -->",
  "score": 47,
  "permalink": "/r/investing/comments/o3uuy3/barrons_investors_are_calling_the_federal/",
  "subreddit": "investing",
  "id": "o3uuy3",
  "is_self": true,
  "media": null,
  "is_video": false
}