{
  "approved_at_utc": null,
  "subreddit": "wallstreetbets",
  "selftext": "Hello everyone. I know most of you are idiots who managed to lose money during the greatest bull run in the history, but I have the need to share my thoughts, help the community and at least get you to start thinking about what if scenarios. Let me get straight to the point.\n\n# I think we will experience some headwinds over the next 12 months.\n\nThere. I said it. Now for those of you with higher IQ, let me explain why I think that.\n\n**1. Inflation is at the highest level it has been in the past 13 years (since 2008)**\n\nDespite what some of you may think, we cannot print money forever. Printer cannot go brrrr always. We had fun with the printer since March 2020, but the effects are starting to show. Food, gas, real estate, stocks, digital currencies, wage subsidies, unemployment benefits - the society is flooded with cash. We are literally swimming in it. Sure it's fun when SPY goes up **31.6%** over the past 12 months, but this leads to inflation and inflation is bad. Why? Because high inflation puts pressure on a government to increase the value of the state pension and unemployment benefits and other welfare payments as the cost of living climbs higher. Inflation expectations -> wage demands -> rise labour costs -> lower  profits for businesses. This is why at some point, our saviour J Pow will need to address this. In fact, he already announced it, which leads to my second point.\n\n**2. FED announced tapering will start in November**\n\nTapering means the gradual slowing down of purchases of securities and bonds. Simply put - printer will slow down. Most of you have never seen the stock market without the printer. You think 31.6% a year for SPY is normal. You are not aware that SPY was flat for 13 years (*0% between Mar 2000 and Jan 2013*). Most of you are not reading the news. You did not read the news in Jan 2020. You thought corona was a Chinese problem. You did not read the news in Mar 2020. You were buying puts, when J Pow publicly said he's going to turn on the printer. Even if you read that, you had no clue what that meant. You held your puts and watched them melt as printer did its thing. Now, we are in a similar situation. J Pow announced he will slow down the printer, you don't know what that means, you are still holding calls and looking to buy more because \"stocks always go up\".\n\nIn conclusion:  \nprinter brrrrrrrrrrrrrrr -> stocks brrrrrrrrrrrrrrr  \nprinter brrr -> stocks brrr\n\n**3. Interest rates will need to go up**\n\nOne way to curb inflation is to raise interest rates. Higher interest rates means it'll be harder to borrow money. Less borrowing, leads to less liquidity to buy houses and stocks. Less buying, prices cool down. I'm not calling for a crash, but a 10-20% cool-down will be enough to wipe out most of you with your clueless strategies, if we can even call them strategies.\n\n**4. China is slowing down**\n\nI know Evergrande paid its bills this month, but they did it by waiting until the last day before announcing bankruptcy. This is not normal. If they had so much trouble this month, who can guarantee they'll be able to pay them next month? On top of that, an average Chinese citizen realized that real estate does not always go up. This change in mindset will cause slight fear, which leads to lower demand for real estate which will eventually show who is over-leveraged. (*hint: It's Evergrande*) You might wonder, how would a slowdown in Chinese real estate affect us in North America? American corporations generate significant profits by selling stuff to Chinese people. If Chinese people are not happy about their houses and apartments going up in value, the last thing on their minds would be to buy new iPhones, purchase Teslas, and buy commodities to build more real estate. We are more connected than you think. When something happens in China, it affects everyone. Don't believe me? Go back to January 2020.\n\n**What should you do?**\n\nSlow down a bit. Relax. Think. Take it easy with calls. Take the foot of the gas pedal. I'm not calling for a crash. I'm not telling you to short the market. Just don't be caught off guard, when big boys cash their chips and go home. You don't want to be the last one to leave the casino. That's all.",
  "author_fullname": "t2_52n324hk",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 1,
  "clicked": false,
  "title": "Why I think next 12 months won't be playing on easy mode",
  "link_flair_richtext": [
    {
      "e": "text",
      "t": "Discussion"
    }
  ],
  "subreddit_name_prefixed": "r/wallstreetbets",
  "hidden": false,
  "pwls": 7,
  "link_flair_css_class": "question",
  "downs": 0,
  "thumbnail_height": null,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_qdaci1",
  "quarantine": false,
  "link_flair_text_color": "light",
  "upvote_ratio": 0.93,
  "author_flair_background_color": "",
  "subreddit_type": "public",
  "ups": 1586,
  "total_awards_received": 33,
  "media_embed": {},
  "thumbnail_width": null,
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Discussion",
  "can_mod_post": false,
  "score": 1586,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": true,
  "thumbnail": "self",
  "edited": 1634887929,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {
    "gid_1": 6,
    "gid_2": 1
  },
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1634881608,
  "link_flair_type": "richtext",
  "wls": 7,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.wallstreetbets",
  "allow_live_comments": true,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello everyone. I know most of you are idiots who managed to lose money during the greatest bull run in the history, but I have the need to share my thoughts, help the community and at least get you to start thinking about what if scenarios. Let me get straight to the point.</p>\n\n<h1>I think we will experience some headwinds over the next 12 months.</h1>\n\n<p>There. I said it. Now for those of you with higher IQ, let me explain why I think that.</p>\n\n<p><strong>1. Inflation is at the highest level it has been in the past 13 years (since 2008)</strong></p>\n\n<p>Despite what some of you may think, we cannot print money forever. Printer cannot go brrrr always. We had fun with the printer since March 2020, but the effects are starting to show. Food, gas, real estate, stocks, digital currencies, wage subsidies, unemployment benefits - the society is flooded with cash. We are literally swimming in it. Sure it&#39;s fun when SPY goes up <strong>31.6%</strong> over the past 12 months, but this leads to inflation and inflation is bad. Why? Because high inflation puts pressure on a government to increase the value of the state pension and unemployment benefits and other welfare payments as the cost of living climbs higher. Inflation expectations -&gt; wage demands -&gt; rise labour costs -&gt; lower  profits for businesses. This is why at some point, our saviour J Pow will need to address this. In fact, he already announced it, which leads to my second point.</p>\n\n<p><strong>2. FED announced tapering will start in November</strong></p>\n\n<p>Tapering means the gradual slowing down of purchases of securities and bonds. Simply put - printer will slow down. Most of you have never seen the stock market without the printer. You think 31.6% a year for SPY is normal. You are not aware that SPY was flat for 13 years (<em>0% between Mar 2000 and Jan 2013</em>). Most of you are not reading the news. You did not read the news in Jan 2020. You thought corona was a Chinese problem. You did not read the news in Mar 2020. You were buying puts, when J Pow publicly said he&#39;s going to turn on the printer. Even if you read that, you had no clue what that meant. You held your puts and watched them melt as printer did its thing. Now, we are in a similar situation. J Pow announced he will slow down the printer, you don&#39;t know what that means, you are still holding calls and looking to buy more because &quot;stocks always go up&quot;.</p>\n\n<p>In conclusion:<br/>\nprinter brrrrrrrrrrrrrrr -&gt; stocks brrrrrrrrrrrrrrr<br/>\nprinter brrr -&gt; stocks brrr</p>\n\n<p><strong>3. Interest rates will need to go up</strong></p>\n\n<p>One way to curb inflation is to raise interest rates. Higher interest rates means it&#39;ll be harder to borrow money. Less borrowing, leads to less liquidity to buy houses and stocks. Less buying, prices cool down. I&#39;m not calling for a crash, but a 10-20% cool-down will be enough to wipe out most of you with your clueless strategies, if we can even call them strategies.</p>\n\n<p><strong>4. China is slowing down</strong></p>\n\n<p>I know Evergrande paid its bills this month, but they did it by waiting until the last day before announcing bankruptcy. This is not normal. If they had so much trouble this month, who can guarantee they&#39;ll be able to pay them next month? On top of that, an average Chinese citizen realized that real estate does not always go up. This change in mindset will cause slight fear, which leads to lower demand for real estate which will eventually show who is over-leveraged. (<em>hint: It&#39;s Evergrande</em>) You might wonder, how would a slowdown in Chinese real estate affect us in North America? American corporations generate significant profits by selling stuff to Chinese people. If Chinese people are not happy about their houses and apartments going up in value, the last thing on their minds would be to buy new iPhones, purchase Teslas, and buy commodities to build more real estate. We are more connected than you think. When something happens in China, it affects everyone. Don&#39;t believe me? Go back to January 2020.</p>\n\n<p><strong>What should you do?</strong></p>\n\n<p>Slow down a bit. Relax. Think. Take it easy with calls. Take the foot of the gas pedal. I&#39;m not calling for a crash. I&#39;m not telling you to short the market. Just don&#39;t be caught off guard, when big boys cash their chips and go home. You don&#39;t want to be the last one to leave the casino. That&#39;s all.</p>\n</div><!-- SC_ON -->",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "96f6c79e-b853-11e5-a4cb-0ebdf030e05d",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": "",
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2th52",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#800080",
  "id": "qdaci1",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "SilbergleitJunior",
  "discussion_type": null,
  "num_comments": 290,
  "send_replies": true,
  "whitelist_status": "some_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": "",
  "permalink": "/r/wallstreetbets/comments/qdaci1/why_i_think_next_12_months_wont_be_playing_on/",
  "parent_whitelist_status": "some_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/wallstreetbets/comments/qdaci1/why_i_think_next_12_months_wont_be_playing_on/",
  "subreddit_subscribers": 10985649,
  "created_utc": 1634922141,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1634881608,
  "the_new_excerpt": "Hello everyone. I know most of you are idiots who managed to lose money during\nthe greatest bull run in the history, but I have the need to share my thoughts,\nhelp the community and at least get you to start thinking about what if\nscenarios. Let me get straight to the point.\n\n\nI THINK WE WILL…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。皆さんの多くは、歴史上最大の強気相場の中で損をしたバカだと思います。\nしかし、私は自分の考えを共有する必要があります。\nコミュニティを助け、少なくとも皆さんに「もしも」のシナリオを考えてもらうために、私の考えを共有する必要があります。\nのシナリオを考えてもらう必要があります。本題に入ります。\n\n\n私は、私たちは...",
      "title": "次の12ヶ月はイージーモードで遊べないと思う理由"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。我知道你们中的大多数人都是白痴，他们在历史上最伟大的牛市中设法失去了金钱。\n但我有必要分享我的想法。\n帮助社区，至少让你们开始思考如果\n情形。让我直奔主题。\n\n\n我认为我们将...",
      "title": "为什么我认为未来12个月不会在简单模式下进行游戏？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。我知道你們中的大多數人都是白癡，他們在歷史上最偉大的牛市中設法失去了金錢。\n但我有必要分享我的想法。\n幫助社區，至少讓你們開始思考如果\n情形。讓我直奔主題。\n\n\n我認爲我們將...",
      "title": "爲什麼我認爲未來12個月不會在簡單模式下進行遊戲？"
    }
  ],
  "source_updated_at": 1635500437413
}