{
  "author": "Upbeat-Purple2965",
  "original_created_utc": 1657140628,
  "title": "It's often said that wars in the past had very few casualities compared to modern wars and many on the losing side could escape battles alive, but what exactly happened next for them?",
  "created_utc": 1657179575,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Like if I&amp;#39;m a medieval soldier and my side has just lost the battle but I managed to escape, what would I do next? &lt;/p&gt;\n\n&lt;p&gt;Can I simply go home or would I be seen as a deserter and be punished or shunned or similar?&lt;/p&gt;\n\n&lt;p&gt;Would the winners of the battle be looking for me? Would the population be hostile or would they let me pass?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/vt07pe/its_often_said_that_wars_in_the_past_had_very_few/",
  "subreddit": "AskHistorians",
  "id": "vt07pe",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Like if I'm a medieval soldier and my side has just lost the battle but I\nmanaged to escape, what would I do next?\n\nCan I simply go home or would I be seen as a deserter and be punished or shunned\nor similar?\n\nWould the winners of the battle be looking for me? Would the population be\nhostile or…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "例えば、私が中世の兵士で、味方は戦いに負けたが、私は何とか脱出することができたとする。\n次に何をすればいいのでしょう？\n\n単純に家に帰れるのか、それとも脱走兵とみなされて罰せられたり、疎まれたりするのか。\nなどと言われるのでしょうか？\n\n戦いの勝者は私を探しているのでしょうか？住民たちは\n敵対するのだろうか...",
      "title": "昔の戦争は現代の戦争に比べて犠牲者が少なく、負けた側の多くは生きて戦場から逃げ出すことができたとよく言われますが、彼らのその後には一体何があったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "就像我是一个中世纪的士兵，我的一方刚刚输掉战斗，但我\n成功逃脱，我接下来会怎么做？\n\n我可以简单地回家，还是会被视为逃兵而受到惩罚或回避\n或类似的情况？\n\n战斗的胜利者会找我吗？人们会不会\n敌视或...",
      "title": "人们常说，与现代战争相比，过去的战争伤亡很少，许多战败方可以活着逃离战斗，但他们接下来到底发生了什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "就像我是一箇中世紀的士兵，我的一方剛剛輸掉戰鬥，但我\n成功逃脫，我接下來會怎麼做？\n\n我可以簡單地回家，還是會被視爲逃兵而受到懲罰或迴避\n或類似的情況？\n\n戰鬥的勝利者會找我嗎？人們會不會\n敵視或...",
      "title": "人們常說，與現代戰爭相比，過去的戰爭傷亡很少，許多戰敗方可以活着逃離戰鬥，但他們接下來到底發生了什麼？"
    }
  ]
}