{
  "author": "LeakyVaccine94",
  "original_created_utc": 1636465655,
  "title": "Reddit makes it nearly impossible for you to find coins early",
  "created_utc": 1636471854,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve seen a lot of posts complaining about how <a href=\"/r/cryptocurrency\">r/cryptocurrency</a> only shills stagnant coins that have already pumped. And coins like SHIB, LRC, KDA, and SOL are never mentioned until after they explode. </p>\n\n<p>This is entirely by design. Your exposure to posts on reddit is a function of how many upvotes those posts have received. And the more bagholders a particular coin has, the more upvotes. Which is why the front page is a billboard for ADA, ETH, ALGO, VET, and a handful of others. By definition, the coins you repeatedly see here already have large numbers of holders. You don&#39;t get rich buying something that everyone else already owns. Hence why projects start to stagnate when they become popular. Popularity on <a href=\"/r/cryptocurrency\">r/cryptocurrency</a> is actually a great indicator for when growth can be expected to taper. Cardano is perhaps a prime example. </p>\n\n<p>By contrast, posts about undiscovered projects will almost universally be buried. There may well have been a post shilling SOL at $1 or SHIB in 2020, but they never would have made it past the last page.</p>\n</div><!-- SC_ON -->",
  "score": 391,
  "permalink": "/r/CryptoCurrency/comments/qq41ei/reddit_makes_it_nearly_impossible_for_you_to_find/",
  "subreddit": "CryptoCurrency",
  "id": "qq41ei",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've seen a lot of posts complaining about how r/cryptocurrency\n[/r/cryptocurrency] only shills stagnant coins that have already pumped. And\ncoins like SHIB, LRC, KDA, and SOL are never mentioned until after they explode.\n\nThis is entirely by design. Your exposure to posts on reddit is a function…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "r/cryptocurrencyがどうのこうのと文句を言っている投稿をたくさん見てきました。\n[/r/cryptocurrency]は、すでにポンピングされた停滞したコインをシリングするだけです。そして\nSHIB、LRC、KDA、SOLのようなコインは、爆発するまで言及されません。\n\nこれは完全にデザインされたものです。あなたがredditの投稿に触れるのは、機能...",
      "title": "Redditでは、早期にコインを見つけることはほぼ不可能です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我看到很多帖子都在抱怨r/cryptocurrency\n[/r/cryptocurrency]只对已经抽水的停滞币进行兜售。而\n像SHIB、LRC、KDA和SOL这样的币，直到它们爆炸之后才被提及。\n\n这完全是设计好的。你在reddit上接触到的帖子是一种功能...",
      "title": "Reddit让你几乎不可能提前找到硬币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到很多帖子都在抱怨r/cryptocurrency\n[/r/cryptocurrency]只對已經抽水的停滯幣進行兜售。而\n像SHIB、LRC、KDA和SOL這樣的幣，直到它們爆炸之後才被提及。\n\n這完全是設計好的。你在reddit上接觸到的帖子是一種功能...",
      "title": "Reddit讓你幾乎不可能提前找到硬幣"
    }
  ]
}