{
  "author": "liquidbrowndelight",
  "original_created_utc": 1624987435,
  "title": "Is it rude to feed someone 'weed laced' brownies without their consent in your opinion?",
  "created_utc": 1625001434,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Basically a while ago, my cousin told me an instance where he fed his parents a bit (obviously not an insane dosage, but still) of &#39;weed brownies&#39; without their knowing.  They aren&#39;t weed smokers at all, so it&#39;s not like your every day prank.  Even though weed is harmless, would you consider this rude, in a way?  Or basically a harmless joke since weed itself doesn&#39;t necessarily cause any harm? I have my own opinion, but just curious to see what others might think (and if you&#39;re curious what I think, I think it&#39;s a tiny bit fucked up, considering they may or may not have had their own moral beliefs towards the plant, but worse things can definitely be done)</p>\n</div><!-- SC_ON -->",
  "score": 432,
  "permalink": "/r/NoStupidQuestions/comments/oacwo1/is_it_rude_to_feed_someone_weed_laced_brownies/",
  "subreddit": "NoStupidQuestions",
  "id": "oacwo1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Basically a while ago, my cousin told me an instance where he fed his parents a\nbit (obviously not an insane dosage, but still) of 'weed brownies' without their\nknowing. They aren't weed smokers at all, so it's not like your every day prank.\nEven though weed is harmless, would you consider this…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "基本的には、少し前に私のいとこが、自分の両親に少しだけ食べさせた例を話してくれました。\n両親に知られないように「ウィード・ブラウニー」を少し（明らかに異常な量ではありませんが）食べさせたという話です。\n知らなかった。両親は全く葉っぱを吸わないので、日常的なイタズラとは違いますよね。\nたとえ葉っぱが無害であっても、あなたはこれを考えるでしょうか...。",
      "title": "あなたの考えでは、相手の同意なしに「大麻入り」のブラウニーを食べさせることは失礼にあたるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "基本上不久前，我的表弟告诉我一个例子，他给他的父母吃了一点\n一点（显然不是一个疯狂的剂量，但仍然）\"杂草布朗尼\"，而他们并不知道。\n知道。他们根本就不是吸食大麻的人，所以这不像是你每天的恶作剧。\n尽管大麻是无害的，但你是否认为这...",
      "title": "在你看来，不经别人同意就给他吃 \"带大麻 \"的布朗尼蛋糕是不礼貌的吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "基本上不久前，我的表弟告訴我一個例子，他給他的父母吃了一點\n一點（顯然不是一個瘋狂的劑量，但仍然）\"雜草布朗尼\"，而他們並不知道。\n知道。他們根本就不是吸食大麻的人，所以這不像是你每天的惡作劇。\n儘管大麻是無害的，但你是否認爲這...",
      "title": "在你看來，不經別人同意就給他喫 \"帶大麻 \"的布朗尼蛋糕是不禮貌的嗎？"
    }
  ]
}