{
  "author": "FractalImagination",
  "original_created_utc": 1635454296,
  "title": "Nothing sucks more than not having money to invest in a crypto that you knew would pump.. and watching it pump.",
  "created_utc": 1635460438,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I knew for a while that a certain crypto would pump and have tried finding money to invest but I am currently paying off money from an unforseen event. \nSo today I watch the charts and it&#39;s pumping... </p>\n\n<p>No money to put in and tears to my eyes.. </p>\n\n<p>Some people are very fortunate and have thousands to throw in and we all know that most of those people will make it big in this game.. sucks knowing you may never be that person.. </p>\n\n<p>I guess it&#39;s hard not feeling jealous. So I guess I&#39;m writing this to preach solidarity with people like me who feel like shit watching coins you wanted to invest in pump before your eyes and there&#39;s nothing you can do about it.</p>\n\n<p>I hope we stumble on a bag full of money that fell out of a plane tomorrow!</p>\n</div><!-- SC_ON -->",
  "score": 373,
  "permalink": "/r/CryptoCurrency/comments/qhwb76/nothing_sucks_more_than_not_having_money_to/",
  "subreddit": "CryptoCurrency",
  "id": "qhwb76",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I knew for a while that a certain crypto would pump and have tried finding money\nto invest but I am currently paying off money from an unforseen event. So today\nI watch the charts and it's pumping...\n\nNo money to put in and tears to my eyes..\n\nSome people are very fortunate and have thousands to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "以前からある暗号が流行ることを知っていて、投資資金を探そうとしました。\nしていましたが、不測の事態でお金を返済しているところです。それで今日\nチャートを見てみると、ポンピングしている...。\n\n投入するお金もなく、涙が出てきました。\n\nある人はとても幸運で、何千ものお金を持っています。",
      "title": "高騰するとわかっていた暗号に投資する資金がなく、高騰するのを見ることほどつらいことはありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道有一段时间，某种加密货币将被抽走，并试图找到钱来投资。\n投资，但我目前正在偿还一个不可预见的事件带来的资金。所以今天\n我看了看图表，它正在抽水......\n\n没有钱投入，我的眼泪流了下来。\n\n有些人非常幸运，有成千上万的钱。",
      "title": "没有什么比没有钱投资于你知道会抽水的加密货币更糟糕的了......并且看着它抽水。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道有一段時間，某種加密貨幣將被抽走，並試圖找到錢來投資。\n投資，但我目前正在償還一個不可預見的事件帶來的資金。所以今天\n我看了看圖表，它正在抽水......\n\n沒有錢投入，我的眼淚流了下來。\n\n有些人非常幸運，有成千上萬的錢。",
      "title": "沒有什麼比沒有錢投資於你知道會抽水的加密貨幣更糟糕的了......並且看着它抽水。"
    }
  ]
}