{
  "author": "x5p4rtan",
  "original_created_utc": 1628390377,
  "title": "My entire life I couldn’t save $1000 in spare money without spending it, today my crypto holdings hit the 5 figure mark.",
  "created_utc": 1628397044,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>After 28 years of stupid spending and not being able to save any kind of money today was an incredible milestone of my life. I started investing in crypto fall of last year, since then Iv done nothing but HODL and accumulate. I kept a 10 year picture mentality, I never freaked out during bad dips and FOMO’d on get rich quick BS moonshots. I just DCA’d bought heavily on dips and believed and today finally proved that I can DCA and not crack under pressure of temptation. To the guy just starting out with $20 I’m here to say that you can do it if you simply believe. Onward to 6 now.</p>\n\n<p>Edit: Thank you all for the love this community has been nothing but amazing, due to security reasons I’d rather not publicize my assets. PM or otherwise</p>\n</div><!-- SC_ON -->",
  "score": 461,
  "permalink": "/r/CryptoCurrency/comments/p06mqr/my_entire_life_i_couldnt_save_1000_in_spare_money/",
  "subreddit": "CryptoCurrency",
  "id": "p06mqr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "After 28 years of stupid spending and not being able to save any kind of money\ntoday was an incredible milestone of my life. I started investing in crypto fall\nof last year, since then Iv done nothing but HODL and accumulate. I kept a 10\nyear picture mentality, I never freaked out during bad dips…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "28年間、馬鹿げた浪費を続け、お金を貯めることができなかったが\n今日は私の人生の中で信じられないような節目となりました。私は昨年の秋に暗号化投資を始めました。\nそれ以来、HODLとアキュムレーションだけをしてきました。私は10年単位で考えていました。\n10年先を見据えた考え方をしていて、悪いディップの時も決して怖がらなかった...。",
      "title": "これまでの人生では、1000ドルの予備費を貯めても使うことができませんでしたが、今では私の保有する暗号は5桁に達しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在经历了28年的愚蠢消费和无法储蓄任何形式的钱之后\n今天是我生命中的一个不可思议的里程碑。我在去年秋天开始投资加密货币\n去年秋天，从那时起，我只做了HODL和积累。我保持了一个10\n年的心态，我从来没有在糟糕的下跌中被吓到过......",
      "title": "我的一生中，我无法存下1000美元的闲钱而不花掉，今天我的加密货币持有量达到了5位数。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在經歷了28年的愚蠢消費和無法儲蓄任何形式的錢之後\n今天是我生命中的一個不可思議的里程碑。我在去年秋天開始投資加密貨幣\n去年秋天，從那時起，我只做了HODL和積累。我保持了一個10\n年的心態，我從來沒有在糟糕的下跌中被嚇到過......",
      "title": "我的一生中，我無法存下1000美元的閒錢而不花掉，今天我的加密貨幣持有量達到了5位數。"
    }
  ]
}