{
  "author": "goodgoodgo",
  "original_created_utc": 1658108152,
  "title": "Two of the most positive people I know come from bad home lives and trauma. Where does that positivity come from?",
  "created_utc": 1658181650,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I grew up in a home where everything was stable, my parents rarely fight and if they do it’s over pretty quickly (but I’ve struggled with depression most of my adult life).&lt;/p&gt;\n\n&lt;p&gt;Two of my friends who are both very positive people have both talked about their bad childhoods, like emotionally abusive father or mother an alcoholic parent.&lt;/p&gt;\n\n&lt;p&gt;And it’s clear they’ve both been through a lot of pain. &lt;/p&gt;\n\n&lt;p&gt;But they still manage to see good in the world and have a positive outlook in life.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/w1n4qt/two_of_the_most_positive_people_i_know_come_from/",
  "subreddit": "NoStupidQuestions",
  "id": "w1n4qt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I grew up in a home where everything was stable, my parents rarely fight and if\nthey do it’s over pretty quickly (but I’ve struggled with depression most of my\nadult life).\n\nTwo of my friends who are both very positive people have both talked about their\nbad childhoods, like emotionally abusive…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はすべてが安定した家庭で育ちました。両親はほとんど喧嘩をせず、もし\nてもすぐに終わってしまうような、安定した家庭で育ちました。\n大人になってからは鬱病に悩まされています）。\n\n私の友人でとても前向きな二人は、二人とも自分の子供時代について話しています。\n子供時代の話です。",
      "title": "私が知っている最もポジティブな2人は、悪い家庭環境とトラウマの出身です。そのポジティブさはどこから来るのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在一个一切都很稳定的家庭中长大，我的父母很少吵架，而且如果我的父母不在了，我也不会再去找他们。\n我的父母很少吵架，即使吵架也会很快结束（但我成年后大部分时间都在与抑郁症作斗争）。\n但我成年后大部分时间都在与抑郁症作斗争）。\n\n我的两个朋友都是非常积极的人，他们都谈到了自己的\n糟糕的童年，比如在情感上受到虐待......",
      "title": "我认识的两个最积极的人都来自糟糕的家庭生活和创伤。这种积极性从何而来？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在一個一切都很穩定的家庭中長大，我的父母很少吵架，而且如果我的父母不在了，我也不會再去找他們。\n我的父母很少吵架，即使吵架也會很快結束（但我成年後大部分時間都在與抑鬱症作鬥爭）。\n但我成年後大部分時間都在與抑鬱症作鬥爭）。\n\n我的兩個朋友都是非常積極的人，他們都談到了自己的\n糟糕的童年，比如在情感上受到虐待......",
      "title": "我認識的兩個最積極的人都來自糟糕的家庭生活和創傷。這種積極性從何而來？"
    }
  ]
}