{
  "author": "notidunna",
  "original_created_utc": 1636814594,
  "title": "Grandma died but grandpa doesn't know. Should we tell him?",
  "created_utc": 1636823990,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My grandma died 2 days ago, she was 74. Her funeral was yesterday. My grandpa, who is 89 and her husband, is immobilised in bed and also very sick.</p>\n\n<p>My mum (their daughter) thinks she shouldn&#39;t tell my grandpa that his wife died, because that would break him and it would accelerate his death. My grandpa had a stroke many years ago and now he complains of &#39;a constant pain in the chest&#39;. He also has a very bad cough.</p>\n\n<p>However, I feel like it is his right to know his wife of so many years died. Do you think we should tell him?</p>\n</div><!-- SC_ON -->",
  "score": 350,
  "permalink": "/r/NoStupidQuestions/comments/qt2ntb/grandma_died_but_grandpa_doesnt_know_should_we/",
  "subreddit": "NoStupidQuestions",
  "id": "qt2ntb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My grandma died 2 days ago, she was 74. Her funeral was yesterday. My grandpa,\nwho is 89 and her husband, is immobilised in bed and also very sick.\n\nMy mum (their daughter) thinks she shouldn't tell my grandpa that his wife died,\nbecause that would break him and it would accelerate his death. My…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の祖母は2日前に亡くなりました、彼女は74歳でした。葬儀は昨日行われました。私のおじいちゃんは\n89歳のおじいちゃんとその旦那さんは、ベッドで動けなくなっていて、しかも重病です。\n\n私のママ（彼らの娘）は、おじいちゃんに奥さんが亡くなったことを伝えてはいけないと思っています。\nなぜなら、それはおじいちゃんの心を傷つけ、死を早めることになるからです。私の...",
      "title": "おばあちゃんは死んだけど、おじいちゃんは知らない。おじいちゃんに教えてあげるべき？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的祖母两天前去世了，她是74岁。她的葬礼在昨天举行。我的外公\n89岁，她的丈夫在床上不能动，也病得很重。\n\n我妈妈（他们的女儿）认为她不应该告诉我爷爷，他的妻子去世了。\n因为那会让他崩溃，会加速他的死亡。我的...",
      "title": "奶奶去世了，但爷爷不知道。我们应该告诉他吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的祖母兩天前去世了，她是74歲。她的葬禮在昨天舉行。我的外公\n89歲，她的丈夫在牀上不能動，也病得很重。\n\n我媽媽（他們的女兒）認爲她不應該告訴我爺爺，他的妻子去世了。\n因爲那會讓他崩潰，會加速他的死亡。我的...",
      "title": "奶奶去世了，但爺爺不知道。我們應該告訴他嗎？"
    }
  ]
}