{
  "author": "The-_Captain",
  "the_new_excerpt": "If I just stop and think about the fact that I need to keep paying rent to stay\ninside and that I need to work on Monday to do that I start almost\nhyperventilating. I start worrying about losing my job and I start realizing how\nlong I need to do this for, another like 50-60 years of working to make…",
  "original_created_utc": 1622952306,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "家賃を払わないと家にいられない、そのためには月曜日に仕事をしないといけない、ということを考えると、ちょっと立ち止まってみたくなる。\nそのためには月曜日に仕事をしなければならないことを考えると、過呼吸になりそうになる。\n過呼吸のようになってしまいます。仕事を失うことを心配し始め、どれくらいの期間これを続けなければならないのかを考え始めます。\nあと50年から60年は働かないといけないんじゃないかと思い始めました。",
      "title": "自分の人生について考え始めた途端、怖くなって圧倒されてしまう人はいませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果我停下来想一想，我需要继续支付租金，以便留在里面，而我需要在星期一工作来做到这一点。\n而我需要在周一工作来做到这一点，我几乎开始\n喘不过气来。我开始担心会失去工作，我开始意识到我需要这样做多久？\n我需要这样做多长时间，再工作50-60年，才能使...",
      "title": "是否有其他人一开始思考自己的生活就感到害怕和不知所措？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果我停下來想一想，我需要繼續支付租金，以便留在裏面，而我需要在星期一工作來做到這一點。\n而我需要在週一工作來做到這一點，我幾乎開始\n喘不過氣來。我開始擔心會失去工作，我開始意識到我需要這樣做多久？\n我需要這樣做多長時間，再工作50-60年，才能使...",
      "title": "是否有其他人一開始思考自己的生活就感到害怕和不知所措？"
    }
  ],
  "title": "Does anyone else feel scared and overwhelmed as soon as they start thinking about their lives?",
  "created_utc": 1622959387,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If I just stop and think about the fact that I need to keep paying rent to stay inside and that I need to work on Monday to do that I start almost hyperventilating. I start worrying about losing my job and I start realizing how long I need to do this for, another like 50-60 years of working to make sure I am housed, fed, and clothed. </p>\n\n<p>I don’t even have it rough. I have a well paying job and I save a lot of money every month. But as soon as I stop and think about my fragile reality I get terrified.</p>\n</div><!-- SC_ON -->",
  "score": 116,
  "permalink": "/r/TooAfraidToAsk/comments/ntd4l2/does_anyone_else_feel_scared_and_overwhelmed_as/",
  "subreddit": "TooAfraidToAsk",
  "id": "ntd4l2",
  "is_self": true,
  "media": null,
  "is_video": false
}