{
  "author": "Luizz__",
  "original_created_utc": 1634114000,
  "title": "What if I found a big Bitcoin address?",
  "created_utc": 1634129427,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Let’s assume I randomly generate private keys and just happen to get the same key as some 1000 BTC whale and getting access to them (I know the odds). Then I transfer them to another address, and go to any exchange to cash out. What would happen? Would I get arrested for theft? Would the officials assume this is illegal money, as I cannot explain where I got them? What about taxes?</p>\n\n<p>Little mind game, what do you think? Of course it’s just hypothetical, as the chance of actually brute forcing such an address is like nonexistent</p>\n\n<p>Edit: Guys I know how statistically impossible it is, I even calculated it myself in the comments (and compared it to billion monkeys each with a billion typewriters). I was just wondering if it would be legal to „steal“ the coins. I could also just steal the private key backup in the physical world, and then steal the coins. Same thing</p>\n</div><!-- SC_ON -->",
  "score": 249,
  "permalink": "/r/CryptoCurrency/comments/q76sk4/what_if_i_found_a_big_bitcoin_address/",
  "subreddit": "CryptoCurrency",
  "id": "q76sk4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Let’s assume I randomly generate private keys and just happen to get the same\nkey as some 1000 BTC whale and getting access to them (I know the odds). Then I\ntransfer them to another address, and go to any exchange to cash out. What would\nhappen? Would I get arrested for theft? Would the officials…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私がランダムに秘密鍵を生成し、たまたま1000BTCのクジラと同じ鍵を手に入れてアクセスしたとします。\nたまたま1000BTCのクジラと同じ鍵を手に入れてアクセスしたとします（確率は知っています）。そして私は\nそれを別のアドレスに転送し、どこかの取引所に行ってキャッシュアウトする。するとどうでしょう？\nどうなるでしょう？窃盗で逮捕されるだろうか？役所の人は・・・。",
      "title": "大きなビットコインアドレスを見つけた場合は？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "让我们假设我随机生成私钥，并恰好得到与某个1000比特币的鲸鱼相同的密钥，并获得他们的访问权（我知道几率）。\n和一些1000BTC的鲸鱼一样的钥匙，并得到了他们的访问权（我知道这个几率）。然后我\n把它们转移到另一个地址，然后去任何交易所兑现。会发生什么\n会发生什么？我会因为偷窃而被逮捕吗？官员们会不会...",
      "title": "如果我发现一个大的比特币地址怎么办？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "讓我們假設我隨機生成私鑰，並恰好得到與某個1000比特幣的鯨魚相同的密鑰，並獲得他們的訪問權（我知道機率）。\n和一些1000BTC的鯨魚一樣的鑰匙，並得到了他們的訪問權（我知道這個機率）。然後我\n把它們轉移到另一個地址，然後去任何交易所兌現。會發生什麼\n會發生什麼？我會因爲偷竊而被逮捕嗎？官員們會不會...",
      "title": "如果我發現一個大的比特幣地址怎麼辦？"
    }
  ]
}