{
  "author": "Dgb_iii",
  "the_new_excerpt": "Edit: Thanks to everyone who is still reading or contributing. A few posts\naccused me of being a shill? I'm just a historically traditional investor who is\nreally becoming more interested in blockchain than cryptocurrency. I intend to\nthoroughly research any negative points made as part of my DD…",
  "original_created_utc": 1620573716,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "編集：まだ読んでくださっている方、投稿してくださっている方、ありがとうございます。いくつかの投稿\nは私を詐欺師だと非難しましたか？私は、歴史的に伝統的な投資家で、ブロックチェーンに興味を持っているだけです。\n暗号通貨よりもブロックチェーンに興味を持っているだけです。私は\n否定的な指摘を受けた場合は、DDの一環として徹底的に調査するつもりです...",
      "title": "ALGOの感想をお聞かせください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "编辑：感谢仍在阅读或贡献的所有人。有几个帖子\n指责我是个骗子？我只是一个历史上的传统投资者，他正在\n真正对区块链比加密货币更感兴趣。我打算\n彻底研究作为我的DD的一部分的任何负面观点......",
      "title": "您对ALGO有什么看法？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "編輯：感謝仍在閱讀或貢獻的所有人。有幾個帖子\n指責我是個騙子？我只是一個歷史上的傳統投資者，他正在\n真正對區塊鏈比加密貨幣更感興趣。我打算\n徹底研究作爲我的DD的一部分的任何負面觀點......",
      "title": "您對ALGO有什麼看法？"
    }
  ],
  "title": "What are your thoughts on ALGO?",
  "created_utc": 1620618162,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Edit: Thanks to everyone who is still reading or contributing. A few posts accused me of being a shill? I&#39;m just a historically traditional investor who is really becoming more interested in <em>blockchain</em> than crypto<em>currency</em>. I intend to thoroughly research any negative points made as part of my DD which I will post in the future.</p>\n\n<p>Good Morning Everyone:</p>\n\n<p>I&#39;m looking for a discussion on the Algorand blockchain. </p>\n\n<p>My initial research has me feeling that this could be a solid long-term play. But, I&#39;m more of an investor than a day trader or bag chaser and am unsure if my long time horizon mentality fits into the crypto space. </p>\n\n<p>Nonetheless, I intend to make regular weekly purchases of ALGO in the hopes that in the future ( 5 - 10 years?) Algorand will overwhelmingly be the blockchain of choice for developers.</p>\n\n<p>Why do I feel this way?</p>\n\n<p>The entire premise of the Algorand blockchain is solving the &quot;Trilemma&quot; of blockchain technology. The trilemma states that you can pick 2 of 3 options [scalability, security, decentralization] but not all 3. The term was coined by Ethereum founder Vitalik Buterin.</p>\n\n<p>Speaking of founders? Algorand was founded by MIT Computer Scientist Silvio Micali. I believe that Mr. Micali and those around him have the highest probability of solving the Trilemma problem. If that issue is solved (if the blockchain can be shown to be decentralized, scalable, and still secure), then I believe that developers will prefer this blockchain.</p>\n\n<p>And finally (and perhaps in my opinion, most interestingly):</p>\n\n<p>Algorand is the first Pure Proof of Stake blockchain - which may solve the Trilemma. I&#39;ll quote them here:</p>\n\n<p>&quot;Algorand proposes an alternative that can satisfy all three requirements. We call it Pure Proof of Stake (PPoS), and it might be one of the most significant breakthrough inventions in the blockchain industry.&quot;</p>\n\n<p><a href=\"https://www.algorand.com/resources/blog/proof-of-stake-vs-pure-proof-of-stake-consensus\">https://www.algorand.com/resources/blog/proof-of-stake-vs-pure-proof-of-stake-consensus</a></p>\n\n<p>&quot;The PPoS protocol is also built on Byzantine consensus, and each token holder’s influence depends on its stake in the system. The trick is that the protocol selects users randomly, irrespective of their stake.&quot;</p>\n\n<p>&quot;Staking&quot; in this context refers to the amount of ALGO token that you are holding. The &quot;validators&quot; of transactions are still chosen randomly, regardless of their stake. However, bad actors are weeded out, since anyone holding a large stake is less likely to approve a nefarious transaction as it would devalue their own stake.</p>\n\n<p>Anyway, anyone have ALGO thoughts? My crypto strategy until this point had been &quot;ignore all of the crazy people and just keep buying BTC.&quot; In my opinion, BTC is the best cryptocurrency at acting like money. But I believe that the Algorand blockchain will dominate in the coming years.</p>\n</div><!-- SC_ON -->",
  "score": 191,
  "permalink": "/r/CryptoCurrency/comments/n8gdod/what_are_your_thoughts_on_algo/",
  "subreddit": "CryptoCurrency",
  "id": "n8gdod",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985990908
}