{
  "author": "Sjors22-",
  "original_created_utc": 1651505734,
  "title": "Staked for obsidian 2 weeks ago, i have never felt this disgusted thanks to CDC",
  "created_utc": 1651520291,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So yes after starting at icy White about a year ago i grew my CRO holding and kept investing into it. Saw the ads on F1 and other big events. Saw the great earn rates which i have been using for months now to generate interest since in the EU the interest is negative. So after saving up for a long time and watching my bag increase i finally thought about a week ago, Lets Just get this obsidian card for the Sweet interest i Will get on my CRO since the earn rates on USDC were too bad. Now i Just found this out today and feel disgusted. How can a company actually see this as a great strategy Both long term and short term? Kris you did me dirty and many others. Now i know that in 170 days ill be home from you CDC. You Just ended your exchange for many. But well atleast you got your own F1 circuit and a Arena! Great enjoy!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 354,
  "permalink": "/r/CryptoCurrency/comments/ugscd0/staked_for_obsidian_2_weeks_ago_i_have_never_felt/",
  "subreddit": "CryptoCurrency",
  "id": "ugscd0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So yes after starting at icy White about a year ago i grew my CRO holding and\nkept investing into it. Saw the ads on F1 and other big events. Saw the great\nearn rates which i have been using for months now to generate interest since in\nthe EU the interest is negative. So after saving up for a long…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そうそう、1年前にアイシーホワイトを始めてから、CROの持ち株を増やし、投資を続けました。\n投資し続けました。F1やその他の大きなイベントでの広告を見ました。を見た。\nを獲得し、それを数ヶ月間利子として使ってきました。\nを生み出すために使っています。だから、長い間貯めた後...",
      "title": "2週間前に黒曜石のために杭を打ちましたが、CDCのおかげでこんなに嫌な思いをしたのは初めてです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以，是的，在大约一年前开始在冰白公司工作后，我增加了我的CRO控股和\n继续投资于它。看到F1和其他大型活动的广告。看到了巨大的\n赚率，我已经用了几个月的时间来产生利息，因为在欧盟，利息是负的。\n欧盟的利息是负的。因此，在攒了很久的钱之后，我就开始投资了。",
      "title": "2周前为黑曜石下注，我从未感到如此厌恶，感谢CDC。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以，是的，在大約一年前開始在冰白公司工作後，我增加了我的CRO控股和\n繼續投資於它。看到F1和其他大型活動的廣告。看到了巨大的\n賺率，我已經用了幾個月的時間來產生利息，因爲在歐盟，利息是負的。\n歐盟的利息是負的。因此，在攢了很久的錢之後，我就開始投資了。",
      "title": "2周前爲黑曜石下注，我從未感到如此厭惡，感謝CDC。"
    }
  ]
}