{
  "author": "rickycrayons",
  "the_new_excerpt": "I was sharing this in a comment but thought this deserved its own post. There is\na long running truth that ETF’s are more tax efficient than mutual funds. While\nthat is true, it is not true at Vanguard.\n\nVanguard has patented this technology with the 14 index mutual funds being a\nshare class of the…",
  "original_created_utc": 1621562846,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "コメントで紹介していたのですが、これは独立した記事にすべきだと思いました。ここでは\nETFはミューチュアル・ファンドよりも税効率が良いというのは昔から言われていることです。しかし\nしかし、Vanguardではそうではありません。\n\nバンガードはこの技術の特許を取得しており、14本のインデックス投資信託が\nのシェアクラスです。",
      "title": "バンガード・ミューチュアル・ファンドは、ETFのように税効率が良いのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在评论中分享了这一点，但认为这值得自己发表。有\n一个长期存在的事实是，ETF比共同基金更省税。虽然\n这是事实，但在Vanguard却并非如此。\n\nVanguard已经为这项技术申请了专利，14个指数共同基金是一个\n的股份类别。",
      "title": "Vanguard共同基金是省税的，就像ETF一样。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在評論中分享了這一點，但認爲這值得自己發表。有\n一個長期存在的事實是，ETF比共同基金更省稅。雖然\n這是事實，但在Vanguard卻並非如此。\n\nVanguard已經爲這項技術申請了專利，14個指數共同基金是一個\n的股份類別。",
      "title": "Vanguard共同基金是省稅的，就像ETF一樣。"
    }
  ],
  "title": "Vanguard Mutual Funds ARE tax efficient, like ETF’s.",
  "created_utc": 1621568960,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was sharing this in a comment but thought this deserved its own post.  There is a long running truth that ETF’s are more tax efficient than mutual funds.  While that is true, it is not true at Vanguard. </p>\n\n<p>Vanguard has patented this technology with the 14 index mutual funds being a share class of the ETF.  This allows them to do things that only they can do until the patent expires in 2023.  To be clear the tax efficiency complaint still applies to other companies mutual funds and actively managed Vanguard funds.</p>\n\n<p>This article explains it better than I will, but just wanted to bring this to this to the communities attention and hear your thoughts. </p>\n\n<p><a href=\"https://www.bloomberg.com/graphics/2019-vanguard-mutual-fund-tax-dodge/\">https://www.bloomberg.com/graphics/2019-vanguard-mutual-fund-tax-dodge/</a></p>\n</div><!-- SC_ON -->",
  "score": 238,
  "permalink": "/r/Bogleheads/comments/nhhj3l/vanguard_mutual_funds_are_tax_efficient_like_etfs/",
  "subreddit": "Bogleheads",
  "id": "nhhj3l",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197387106
}