{
  "author": "spaceraptorbutt",
  "original_created_utc": 1635541664,
  "title": "What do you do if you have a family secret about an historical figure?",
  "created_utc": 1635569209,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m not sure if this is the best place to ask this question, but since it is about how we record history, historians seem like the right people to ask. </p>\n\n<p>My grandmother’s parents were artists. Most people won’t know their names, but would recognize one of my great-grandfather’s works. They do both have Wikipedia pages. My local university has a small exhibit about my great-grandmother. There have been a handful of books written about them. Someone recently made a documentary about my great-grandmother that I doubt anyone watched. Basically, there’s a little bit of academic interest in them, but not a ton. </p>\n\n<p>My great-grandfather was a known philanderer. Biographies usually touch on this and his numerous famous affair partners and subsequent wives. This is important for my family secret. </p>\n\n<p>My grandmother recently revealed to my cousin that the woman everyone assumes to be her birth mother is not actually her birth mother. Apparently great-grandmother couldn’t have children. When they were living in London, great-grandfather had an affair with the live-in maid. The maid became pregnant and great-grandmother saw her chance to be a mother. Great-grandfather left for a job in New York City (unclear if before or after they found out the maid was pregnant). About a year later, great-grandmother showed up in NYC with a baby and her own name on the birth certificate as the mother. I have no idea how consenting the maid was to any of this or anything about the maid’s identity. </p>\n\n<p>My question basically is 1) is this something important for art historians who study my great-grandparents to know and 2) how do I share this information with historians? I certainly don’t want to do anything until after my grandmother passes on (she’s deeply embarrassed about the whole thing), but it also doesn’t seem like something that should die with her.</p>\n</div><!-- SC_ON -->",
  "score": 108,
  "permalink": "/r/AskHistorians/comments/qimffo/what_do_you_do_if_you_have_a_family_secret_about/",
  "subreddit": "AskHistorians",
  "id": "qimffo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m not sure if this is the best place to ask this question, but since it is\nabout how we record history, historians seem like the right people to ask.\n\nMy grandmother’s parents were artists. Most people won’t know their names, but\nwould recognize one of my great-grandfather’s works. They do both…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この質問をするのに最適な場所かどうかわかりませんが、歴史をどのように記録するかということなので\n歴史をどのように記録するかということなので、歴史家に聞くのが適切だと思います。\n\n私の祖母の両親は芸術家でした。ほとんどの人は彼らの名前を知らないでしょうが\n曾祖父の作品は知っています。彼らは両方とも...",
      "title": "歴史上の人物にまつわる家族の秘密がある場合、どうしますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不确定这是否是问这个问题的最佳地点，但由于它是关于我们如何记录历史的问题。\n关于我们如何记录历史的问题，历史学家似乎是最适合问的人。\n\n我祖母的父母是艺术家。大多数人不知道他们的名字，但是\n会认出我曾祖父的一件作品。他们既做...",
      "title": "如果你有一个关于历史人物的家庭秘密，你该怎么做？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不確定這是否是問這個問題的最佳地點，但由於它是關於我們如何記錄歷史的問題。\n關於我們如何記錄歷史的問題，歷史學家似乎是最適合問的人。\n\n我祖母的父母是藝術家。大多數人不知道他們的名字，但是\n會認出我曾祖父的一件作品。他們既做...",
      "title": "如果你有一個關於歷史人物的家庭祕密，你該怎麼做？"
    }
  ]
}