{
  "author": "KeyPractical",
  "original_created_utc": 1650210373,
  "title": "Why don't men compliment each other?",
  "created_utc": 1650252806,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I often see highly upvoted comments/posts about men who were complimented once 10 years ago and remembering it vividly because they never receive compliments and they wish it was more normal. But often this is aimed at women and wanting women to compliment men the way they compliment each other. Then you&amp;#39;ll see women&amp;#39;s replies saying that men will take it as an advance/hitting on them and they don&amp;#39;t want to cause misunderstanding.&lt;/p&gt;\n\n&lt;p&gt;So my question is, if women are unwilling to compliment men (for valid reasons) and men are generally attention starved, why don&amp;#39;t they compliment each other? From what I gather from these reddit comments, &amp;quot;hey that&amp;#39;s a really nice shirt man&amp;quot; might go a long way and be remembered years later.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/u5ppr9/why_dont_men_compliment_each_other/",
  "subreddit": "TooAfraidToAsk",
  "id": "u5ppr9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I often see highly upvoted comments/posts about men who were complimented once\n10 years ago and remembering it vividly because they never receive compliments\nand they wish it was more normal. But often this is aimed at women and wanting\nwomen to compliment men the way they compliment each other.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "一度褒められた男性のコメント・投稿で、アップボーティングの高いものをよく見かけますが\n10年前のことを鮮明に覚えているのは、普段褒められないから。\nもっと普通になればいいのにと思う。しかし、多くの場合、これは女性に向けられたもので、「もっと普通になればいいのに」と\n女性が男性を褒めるのと同じように、女性も男性を褒めてほしい......。",
      "title": "なぜ男は褒めないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我经常看到一些高票数的评论/帖子，说的是那些在10年前被赞美过一次的男人。\n10年前被赞美过一次，并且记忆犹新，因为他们从未接受过赞美\n而他们希望这更正常。但这往往是针对女性的，希望\n女性要像赞美对方那样赞美男性....。",
      "title": "为什么男人不互相恭维？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我經常看到一些高票數的評論/帖子，說的是那些在10年前被讚美過一次的男人。\n10年前被讚美過一次，並且記憶猶新，因爲他們從未接受過讚美\n而他們希望這更正常。但這往往是針對女性的，希望\n女性要像贊美對方那樣讚美男性....。",
      "title": "爲什麼男人不互相恭維？"
    }
  ]
}