{
  "author": "knitknackpaddywhack",
  "original_created_utc": 1645425566,
  "title": "Is it weird to go grocery shopping with a parent as an adult?",
  "created_utc": 1645451503,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;At the moment I don’t live with my mother, but I do go grocery shopping with her when she goes. We live close by, and she never knows what to buy since she’s not too big of a cook and I help her think of ideas or just help her out with the how too-s. &lt;/p&gt;\n\n&lt;p&gt;I was told by some friends that that’s a little weird that I go with her to go shopping. Even when living with her I would go shopping with her, and to me none of it is odd. They said all of it was kinda weird and that they think they would think it’s weird seeing a mom-adult daughter pair shopping. I think they’re overanalyzing and nosey.&lt;/p&gt;\n\n&lt;p&gt;Edit: ‘their’ to ‘they’re’ it was bugging me&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 117,
  "permalink": "/r/NoStupidQuestions/comments/sxmu9r/is_it_weird_to_go_grocery_shopping_with_a_parent/",
  "subreddit": "NoStupidQuestions",
  "id": "sxmu9r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "At the moment I don’t live with my mother, but I do go grocery shopping with her\nwhen she goes. We live close by, and she never knows what to buy since she’s not\ntoo big of a cook and I help her think of ideas or just help her out with the\nhow too-s.\n\nI was told by some friends that that’s a little…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "現在、母とは一緒に住んでいませんが、一緒に買い物に行ったりしています。\nということです。近所に住んでいるのですが、彼女は何を買えばいいのかわからないんです。\n料理はあまり得意ではないので、アイデアを出したり、手伝ったりしています。\nハウツー\n\n友人たちから「それはちょっと...」と言われました。",
      "title": "大人になってから親と一緒にスーパーに買い物に行くのは変ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "目前，我不和我母亲住在一起，但我和她一起去买菜。\n当她去的时候。我们住得很近，她从来不知道要买什么，因为她不太擅长烹饪。\n我帮她想点子，或者只是帮她想办法。\n如何做。\n\n一些朋友告诉我，这有点...",
      "title": "作为一个成年人，和父母一起去买菜是不是很奇怪？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "目前，我不和我母親住在一起，但我和她一起去買菜。\n當她去的時候。我們住得很近，她從來不知道要買什麼，因爲她不太擅長烹飪。\n我幫她想點子，或者只是幫她想辦法。\n如何做。\n\n一些朋友告訴我，這有點...",
      "title": "作爲一個成年人，和父母一起去買菜是不是很奇怪？"
    }
  ]
}