{
  "author": "catsx3",
  "original_created_utc": 1626816466,
  "title": "Update to the situation in which I sent $5000 in btc to the wrong address. I got the money back! (Original story linked inside)",
  "created_utc": 1626833284,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is a follow up to </p>\n\n<p><a href=\"https://www.reddit.com/r/Bitcoin/comments/oda6uf/accidentally_sent_btc_to_an_input_address_from_a\">https://www.reddit.com/r/Bitcoin/comments/oda6uf/accidentally_sent_btc_to_an_input_address_from_a</a></p>\n\n<p>This all began on July 3rd.</p>\n\n<p>After I noticed the wallet I sent it to was an output address used by Kraken I immediately emailed them asking for help and what my options were. </p>\n\n<p>Over the course of the next week I sent many emails back and forth explaining the situation and how I meant to send it to a Coinbase wallet but accidentally long-pressed on an output address used in the transaction from Kraken to my Electrum wallet.</p>\n\n<p>Finally they send me an email saying they&#39;ve identified the owner of the account and would be emailing them to ask if they would allow their email to be shared with me so we could actually speak and resolve the situation.</p>\n\n<p>The guy ended up being from Brazil and when he received the money he moved it to an online Casino where he proceeded to lose $2000 before seeing the email from Kraken.</p>\n\n<p>After seeing the email from Kraken, he actually emailed me! It took a lot of convincing that this wasn&#39;t some sort of elaborate scam and I explained that the $2k &quot;lost&quot; wouldnt be a problem if he returned the rest of the money.</p>\n\n<p>He wanted me to sign some sort of contract stating what happened, we both signed it and this morning I woke up to .10 in my Electrum wallet.</p>\n\n<p>Holy. Fucking. Shit.</p>\n\n<p>I just want to send a huge shout-out to Kraken for helping me navigate this ridiculous situation I put myself in.</p>\n\n<p>I want to send an even bigger shout-out to the man that received the coin and was willing to send what was remaining back.</p>\n\n<p>I don&#39;t even care about the $2k and I&#39;m honestly hoping he just made that story about the casino up so he could keep the $2k because he deserves it and I know $2k goes a long fuckin way in Brazil so I honestly feel like really good about it. How could I not?</p>\n\n<p>I&#39;ve never heard a story like this in the btc world. Ive been trading since 2013 and never made the mistake of sending money to the wrong address and the stories I&#39;ve heard of people who have, I&#39;ve never heard of a story of that btc being recovered in such a fashion.</p>\n\n<p>I am beside myself with joy. It looks like I&#39;ll be able to buy the car I want after all.</p>\n\n<p>I&#39;ve always said I&#39;m simultaneously the luckiest/unluckiest person I know and this is solid fuckin evidence right here.</p>\n\n<p>THANK YOU KRAKEN!</p>\n\n<p>THANK YOU UNNAMED BRAZILIAN GUY!</p>\n\n<p>I quite literally thought I lost that money for good and this whole ordeal has been such a whirlwind. I&#39;m so glad it&#39;s been resolved but it wouldn&#39;t have been if I didn&#39;t study the Blockchain and followed the money, and even then 99.9% you won&#39;t get your money back but I actually fuckin did. </p>\n\n<p>I&#39;m agnostic and this nearly made me believe in God lol</p>\n\n<p>This community is amazing and it was thanks to your help in my initial post, here I am, issue resolved ,15 days later, but resolved.</p>\n\n<p>Happy hodling!</p>\n</div><!-- SC_ON -->",
  "score": 367,
  "permalink": "/r/Bitcoin/comments/oobjqa/update_to_the_situation_in_which_i_sent_5000_in/",
  "subreddit": "Bitcoin",
  "id": "oobjqa",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is a follow up to\n\nhttps://www.reddit.com/r/Bitcoin/comments/oda6uf/accidentally_sent_btc_to_an_input_address_from_a\n\nThis all began on July 3rd.\n\nAfter I noticed the wallet I sent it to was an output address used by Kraken I\nimmediately emailed them asking for help and what my options…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "に続くものです。\n\nhttps://www.reddit.com/r/Bitcoin/comments/oda6uf/accidentally_sent_btc_to_an_input_address_from_a\n\n事の発端は、7月3日。\n\n送信先のウォレットがKrakenが使用している出力アドレスであることに気付いた後、すぐに\nすぐにメールで助けを求め、選択肢を考えました。",
      "title": "5000ドルのbtcを間違ったアドレスに送ってしまった状況のアップデート。お金が戻ってきました! (オリジナルストーリーは内部にリンクされています)"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是对以下内容的跟进\n\nhttps://www.reddit.com/r/Bitcoin/comments/oda6uf/accidentally_sent_btc_to_an_input_address_from_a\n\n这一切始于7月3日。\n\n在我注意到我发送的钱包是Kraken使用的输出地址后，我\n立即给他们发电子邮件，请求帮助，并询问我有什么选择...",
      "title": "我向错误的地址发送了5000美元的btc，这个情况的更新。我把钱拿回来了! (原故事链接在里面)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是對以下內容的跟進\n\nhttps://www.reddit.com/r/Bitcoin/comments/oda6uf/accidentally_sent_btc_to_an_input_address_from_a\n\n這一切始於7月3日。\n\n在我注意到我發送的錢包是Kraken使用的輸出地址後，我\n立即給他們發電子郵件，請求幫助，並詢問我有什麼選擇...",
      "title": "我向錯誤的地址發送了5000美元的btc，這個情況的更新。我把錢拿回來了! (原故事鏈接在裏面)"
    }
  ]
}