{
  "author": "Principle-Normal",
  "the_new_excerpt": "I invested about $300 into AMD my freshman year at $2 and $4, respectively, and\nam now needing this money to meet tuition this semester. I will only be needing\na few thousand. I have a few thousand in other stocks (I guess I have been lucky\nin my choices), but the bulk of my money is in AMD. I am…",
  "original_created_utc": 1615743267,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我在大一的时候分别以2美元和4美元的价格向AMD投资了300美元左右，并。\n我现在需要这笔钱来支付这个学期的学费。我只需要\n几千块钱。我还有几千块钱的其他股票（我想我的运气很好吧\n在我的选择中），但我的大部分资金是在AMD。我是...",
      "title": "我高中时投入AMD的几百块钱大概有一万块钱，需要一些钱来支付大学的学费。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在大一的時候分別以2美元和4美元的價格向AMD投資了300美元左右，並。\n我現在需要這筆錢來支付這個學期的學費。我只需要\n幾千塊錢。我還有幾千塊錢的其他股票（我想我的運氣很好吧\n在我的選擇中），但我的大部分資金是在AMD。我是...",
      "title": "我高中時投入AMD的幾百塊錢大概有一萬塊錢，需要一些錢來支付大學的學費。"
    }
  ],
  "title": "I have about 10k from a few hundred I put into AMD in high school, need some of it to pay for college.",
  "created_utc": 1615753556,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I invested about $300 into AMD my freshman year at $2 and $4, respectively, and am now needing this money to meet tuition this semester. I will only be needing a few thousand. I have a few thousand in other stocks (I guess I have been lucky in my choices), but the bulk of my money is in AMD. I am not sure whether I should sell AMD, or these other holdings. If I should sell my other holdings, then I need to decide which ones. Basically I am financially illiterate and got lucky with the small amount of money I had.</p>\n\n<p>I am wondering what I should do to become more financially literate so that I can make the best decisions regarding these stocks. I have not touched this account for over 7 years, and this is close to the most money I have ever had in any bank account (being a student whose account is drained each semester). I feel a heavy burden to get this right. I do not want to become an active investor, I am just at a point where I need to do a bit of activity.</p>\n\n<p>If anyone has any readings they could recommend specifically on Ford or AMD, that would be very helpful. Some more general, introductory recommendations would be helpful too. I like to think of myself as a quick learner, so I wouldn&#39;t mind more intermediate or advanced texts either. This would help give me a greater picture of the depth of knowledge in the field as well.</p>\n\n<p>Thank you.</p>\n</div><!-- SC_ON -->",
  "score": 61,
  "permalink": "/r/stocks/comments/m4zo63/i_have_about_10k_from_a_few_hundred_i_put_into/",
  "subreddit": "stocks",
  "id": "m4zo63",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147382526
}