{
  "author": "shardplugged",
  "original_created_utc": 1630752789,
  "title": "I couldn't believe my ears when I heard the minimum wages all around the world - a cashier's minimum wage in the US is 16 times more than that of a teacher in underdeveloped countries",
  "created_utc": 1630765831,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m from one, trust me with the data. I was listening to Futura Free by Frank Ocean for the first time and he was like I&#39;m working on my feet for $7 an hour which is the minimum wage, and I was like... Hold up!</p>\n\n<p>I knew people were &quot;rich&quot; in other countries but man I couldn&#39;t even guess the ratio. I get $0.5 an hour as a goddamn teacher who is expected to reform the future of his thousands of students (not trying to belittle a cashier&#39;s job at all, every job and status is needed in the society. Just comparing these two).</p>\n\n<p>The sad thing is, the essential products that we purchase are just as expensive as they are in advanced countries.</p>\n\n<p>Malicious governments are trying their best to keep the people poor but ever since I connected to the wider society, making friends overseas, playing around with DeFi, etc. I&#39;ve realized it&#39;s literally like we&#39;ve been living in a cage for decades.</p>\n\n<p>May the crypto gods be with us. Peace.</p>\n\n<p>Edit: For all of you trying to minimize the amount of hardship we have to endure, here goes the PPP of my country compared to the USA: 11400 to 60500</p>\n</div><!-- SC_ON -->",
  "score": 442,
  "permalink": "/r/CryptoCurrency/comments/phpe9y/i_couldnt_believe_my_ears_when_i_heard_the/",
  "subreddit": "CryptoCurrency",
  "id": "phpe9y",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm from one, trust me with the data. I was listening to Futura Free by Frank\nOcean for the first time and he was like I'm working on my feet for $7 an hour\nwhich is the minimum wage, and I was like... Hold up!\n\nI knew people were \"rich\" in other countries but man I couldn't even guess the\nratio. I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の出身地ですから、データを信じてください。フランク・オーシャンのFutura Freeを聴いていました。\nオーシャンの「Futura Free」を初めて聴いたんだけど、彼は「俺は最低賃金の時給7ドルで働いている\nこれは最低賃金です。ちょっと待って！」と思いました。\n\n他の国でも「お金持ち」がいることは知っていましたが、その比率は想像もつきませんでした。\n割合です。I...",
      "title": "世界の最低賃金を聞いて耳を疑いました。アメリカのレジ係の最低賃金は、発展途上国の教師の16倍もあります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我来自一个，相信我的数据。我第一次听弗兰克-海洋的《Futura Free》时\n他说：\"我用脚工作，每小时7美元。\n这是最低工资，而我当时想... 等一下！\"。\n\n我知道其他国家的人很 \"富有\"，但我甚至无法猜测其比例。\n比例。I...",
      "title": "当我听到世界各地的最低工资时，我简直不敢相信自己的耳朵--美国一个收银员的最低工资是不发达国家教师的16倍。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我來自一個，相信我的數據。我第一次聽弗蘭克-海洋的《Futura Free》時\n他說：\"我用腳工作，每小時7美元。\n這是最低工資，而我當時想... 等一下！\"。\n\n我知道其他國家的人很 \"富有\"，但我甚至無法猜測其比例。\n比例。I...",
      "title": "當我聽到世界各地的最低工資時，我簡直不敢相信自己的耳朵--美國一個收銀員的最低工資是不發達國家教師的16倍。"
    }
  ]
}