{
  "author": "DontMicrowaveCats",
  "original_created_utc": 1637621709,
  "title": "I've been digging into the GWEN/POWR Coinbase situation. It seems a glitch caused Coinbase to issue/sell millions (possibly Billions) of coins they don't actually have. They froze every holder's account, and now are desperately trying to fix every transaction. It appears they're deep in the hole.",
  "created_utc": 1637633241,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Admitted crypto skeptic and <a href=\"/r/Buttcoin\">/r/Buttcoin</a> -er here. I&#39;ve been monitoring the issue with Coinbase GYEN/POWR situation you probably caught wind of, and I figured people here could appreciate some objective news without calling it FUD.</p>\n\n<p><strong>What happened?</strong></p>\n\n<p>On 11/15 &amp; 11/16, Coinbase issued 2 new coin trading pairs, GYEN/USD and POWR/USD.</p>\n\n<p><strong>What is GYEN?</strong> GYEN was supposed to be a &quot;regulated&quot; stablecoin , pegged to the Japanese Yen. As a stablecoin, the price should never really gone above $0.0087 (the conversion rate from a Yen to USD)</p>\n\n<p>But as soon as they listed the coin, people started actively trading it (because of course people try to trade a stablecoin). For whatever reason the &quot;stablecoin&quot;&#39;s stability function did not work correctly, causing the price to immediately skyrocket. Of course, this caused more people to swarm in and buy up GYEN, shooting it up 10x, before immediately crashing.</p>\n\n<p>Then the bigger screw up. At some point, it seems that a technical glitch caused COINBASE to put a 100x-1000x multiplier on the total amount of GYEN in many users wallets. <a href=\"https://www.reddit.com/r/CoinBase/comments/qzkffi/comment/hlnaw7i/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">np.reddit.com/r/CoinBase/comments/qzkffi/comment/hlnaw7i/</a> . This user reported he paid $50, and was given 50 Million GYEN, rather than the 5000 he shouldve had. Many other users in <a href=\"/r/GYEN\">/r/GYEN</a> and Twitter are reporting similar situation.</p>\n\n<p>On 11/19, Coinbase mysteriously locked out all user accounts who held any POWR or GYEN. They also manually cancelled every pending order.  Since then, the user accounts have remained locked, and Coinbase has given no real update... other than tweeting &quot;To Th3 Moon&quot; on the main Twitter account, and &quot;There was a technical glitch, we&#39;re working on it&quot; on Coinbase PRO Twitter.</p>\n\n<p>What appears to be happening now is Coinbase is going through trying to manually  correct every account to adjust the 100x error. Thing is, it seems some users may have sold or moved their coins before the error was fixed.</p>\n\n<p>At this point (presumably) thousands of users are stilled locked out of trading and super pissed off, and Coinbase isn&#39;t giving really any info. If the above scenario panned out, Coinbase could be on the hook for tens (or hundreds) of millions of over-alloted coins.</p>\n\n<p>As maybe some evidence of the scale, if you look at the CMC volume chart for GYEN, it shows just a few million $ in trade volume on those days. But if you look at the Tradingview chart for Coinbase GYEN/USD pair, it shows Billions in GYEN trade volume (Tens of millions of $USD)</p>\n\n<p>Interestingly, user <a href=\"/u/swag-er\">/u/swag-er</a> warned and predicted this exact situation would happen a day before, as pretty much the exact same thing happened on Binance 6 months ago when they listed GYEN. <a href=\"https://np.reddit.com/r/CryptoCurrency/comments/qvpvvy/gyen_is_a_stablecoin_dont_get_finessed/\">np.reddit.com/r/CryptoCurrency/comments/qvpvvy/gyen_is_a_stablecoin_dont_get_finessed/</a></p>\n\n<p>Unfortunately, the top posts of this sub were filled with crap about memecoins mooning and El Salvador doing sketchy stuff with Bitfinex, so his post wasn&#39;t seen by many.</p>\n\n<p>As far as POWR, I have no idea on that one. I&#39;m assuming they were also affected by the x100 bonus coin glitch or it was frozen as a precaution.</p>\n\n<p><strong>Tl;dr</strong> - Coinbase screwed up big time. Now they&#39;re deep in the hole and desperately trying to dig themselves out.</p>\n\n<p>Anyway, thats your buttcoin news of the day.</p>\n</div><!-- SC_ON -->",
  "score": 180,
  "permalink": "/r/CryptoCurrency/comments/qzybet/ive_been_digging_into_the_gwenpowr_coinbase/",
  "subreddit": "CryptoCurrency",
  "id": "qzybet",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Admitted crypto skeptic and /r/Buttcoin -er here. I've been monitoring the issue\nwith Coinbase GYEN/POWR situation you probably caught wind of, and I figured\npeople here could appreciate some objective news without calling it FUD.\n\nWhat happened?\n\nOn 11/15 & 11/16, Coinbase issued 2 new coin trading…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "自他共に認める暗号懐疑論者であり、/r/Buttcoin-erです。私はこの問題を監視していました。\nコインベースのGYEN/POWRの問題を監視しています。\nここの人たちはFUDと呼ばずに客観的なニュースを評価してくれると思ったんです。\n\n何が起こったのですか？\n\n11/15と11/16に、Coinbaseは2つの新しいコイン取引...",
      "title": "GWEN/POWRのCoinbaseの状況を調べてみました。Coinbaseの不具合により、実際には持っていない数百万（おそらく数十億）のコインを発行・販売してしまったようです。彼らはすべての保有者の口座を凍結し、現在はすべての取引を修復しようと必死になっています。どうやら彼らは深い穴の中にいるようです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是加密货币怀疑论者和/r/Buttcoin-er。我一直在关注这个问题\n我一直在关注Coinbase GYEN/POWR的情况，你可能已经知道了，而且我认为\n这里的人可以欣赏一些客观的新闻，而不是说它是FUD。\n\n发生了什么？\n\n11月15日和11月16日，Coinbase发布了两个新的硬币交易...",
      "title": "我一直在研究GWEN/POWR Coinbase的情况。似乎一个故障导致Coinbase发行/出售了数百万（可能是数十亿）他们实际上没有的硬币。他们冻结了每个持有人的账户，现在正拼命修复每笔交易。看来他们已经深陷泥潭了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是加密貨幣懷疑論者和/r/Buttcoin-er。我一直在關注這個問題\n我一直在關注Coinbase GYEN/POWR的情況，你可能已經知道了，而且我認爲\n這裏的人可以欣賞一些客觀的新聞，而不是說它是FUD。\n\n發生了什麼？\n\n11月15日和11月16日，Coinbase發佈了兩個新的硬幣交易...",
      "title": "我一直在研究GWEN/POWR Coinbase的情況。似乎一個故障導致Coinbase發行/出售了數百萬（可能是數十億）他們實際上沒有的硬幣。他們凍結了每個持有人的賬戶，現在正拼命修復每筆交易。看來他們已經深陷泥潭了。"
    }
  ]
}