{
  "author": "Obvious-Ad-438",
  "original_created_utc": 1648635813,
  "title": "Long term investing is not a get rich quick scheme. But not Investing AT ALL?? that's a get poor slow scheme.",
  "created_utc": 1648672351,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In case you haven’t realized, the value of your dollar is falling off a cliff…&lt;/p&gt;\n\n&lt;p&gt;Inflation is running rampant and recently crossed a whopping 7%... Worse than we’ve had in about 40 years.&lt;/p&gt;\n\n&lt;p&gt;If you’re interested in going anywhere, it’ll cost you about 40% more than this time last year just to fill up your gas tank. And that’s only the tip of the iceberg…&lt;/p&gt;\n\n&lt;p&gt;If you grasp what’s going on, you’ll know that a 3% raise isn’t helping you at all when you’re losing 7%...&lt;/p&gt;\n\n&lt;p&gt;In order to counter this, storing money in an appreciating investment vehicle is an absolute MUST.&lt;/p&gt;\n\n&lt;p&gt;Otherwise, the value of your dollar will continue going down as the AMOUNT of dollar you have stays the same…&lt;/p&gt;\n\n&lt;p&gt;Even if you’re not great at math, I think you can see where that’s headed.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 318,
  "permalink": "/r/CryptoCurrency/comments/ts3a3t/long_term_investing_is_not_a_get_rich_quick/",
  "subreddit": "CryptoCurrency",
  "id": "ts3a3t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In case you haven’t realized, the value of your dollar is falling off a cliff…\n\nInflation is running rampant and recently crossed a whopping 7%... Worse than\nwe’ve had in about 40 years.\n\nIf you’re interested in going anywhere, it’ll cost you about 40% more than this\ntime last year just to fill up…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "因みに、ドルの価値は崖っぷちに落ちている...。\n\nインフレは猛威を振るい、最近ではなんと7％を超えたとか...。これは\n約40年ぶりのことです。\n\nどこへ行くにも、今より約40％高い費用がかかります。\n去年の今頃は、満タンにするだけでも...。",
      "title": "長期投資は一攫千金を狙うものではありません。しかし、全く投資しないのですか？それは、貧乏くじを引くようなものです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你还没有意识到，你的美元价值正在跌落悬崖......。\n\n通货膨胀正在肆虐，最近跨越了高达7%的水平... 这比\n比我们40年来的情况还要糟糕。\n\n如果你有兴趣去任何地方，你的花费将比现在多出40%。\n比去年这个时候多出40%。",
      "title": "长期投资不是一个快速致富的计划。但完全不投资，那是一个缓慢致贫的计划。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你還沒有意識到，你的美元價值正在跌落懸崖......。\n\n通貨膨脹正在肆虐，最近跨越了高達7%的水平... 這比\n比我們40年來的情況還要糟糕。\n\n如果你有興趣去任何地方，你的花費將比現在多出40%。\n比去年這個時候多出40%。",
      "title": "長期投資不是一個快速致富的計劃。但完全不投資，那是一個緩慢致貧的計劃。"
    }
  ]
}