{
  "author": "uganda-unlucki",
  "original_created_utc": 1646780621,
  "title": "Are 50% of Reddit users literal children?",
  "created_utc": 1646792856,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is a slightly hyperbolic framed question, but I get the impression that a lot of Redditors are just a bunch of Russian trolls and kids who haven&amp;#39;t finished high school yet. I don&amp;#39;t mind trolling/goofing around for the sake of being funny, but in EVERY comment section there&amp;#39;s toxic behavior, no mutual respect, and zero attempts at having a normal interaction. I&amp;#39;m genuinely surprised when I see something wholesome in the comments, like a normal conversation between people.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 109,
  "permalink": "/r/TooAfraidToAsk/comments/t9tehc/are_50_of_reddit_users_literal_children/",
  "subreddit": "TooAfraidToAsk",
  "id": "t9tehc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "This is a slightly hyperbolic framed question, but I get the impression that a\nlot of Redditors are just a bunch of Russian trolls and kids who haven't\nfinished high school yet. I don't mind trolling/goofing around for the sake of\nbeing funny, but in EVERY comment section there's toxic behavior, no…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは少し大げさなフレームワークの質問ですが、私は、このような印象を受けます。\nRedditorの多くは、ロシアの荒らしや未就学児の集まりです。\nまだ高校を卒業していない。のために荒らし・グチを言うのは構わないのですが。\nでも、どこのコメント欄でも有害な行為がある、いや...。",
      "title": "Redditユーザーの50％は文字どおりの子ども？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是个略显夸张的问题，但我的印象是，很多Redditors只是一群俄罗斯巨头和没有见过面的孩子。\n很多Redditors只是一群俄罗斯巨魔和没有完成高中学业的孩子。\n儿还没上完高中。我并不介意为了搞笑而进行嘲弄/恶搞。\n但在每一个评论区，都有有毒的行为，不...",
      "title": "50%的Reddit用户是字面意义上的儿童吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是個略顯誇張的問題，但我的印象是，很多Redditors只是一羣俄羅斯巨頭和沒有見過面的孩子。\n很多Redditors只是一羣俄羅斯巨魔和沒有完成高中學業的孩子。\n兒還沒上完高中。我並不介意爲了搞笑而進行嘲弄/惡搞。\n但在每一個評論區，都有有毒的行爲，不...",
      "title": "50%的Reddit用戶是字面意義上的兒童嗎？"
    }
  ]
}