{
  "author": "Skiddley-",
  "original_created_utc": 1633935578,
  "title": "In a single sentence describe your entire portfolio",
  "created_utc": 1633956699,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As the title says describe your entire portfolio in a single sentence, I may comment and try to guess what coins you’re holding as well. Bonus points if your comment is funny I’ll tip you a moon. </p>\n\n<p>I have no other words to say and this 500 character limit is really annoying so here is some filler text that holds no value or relevant information to the post.</p>\n\n<p><strong>please don’t disclose the value of your portfolio that’s never a good idea, and I don’t want this thread to be a target for scammers</strong></p>\n\n<p>I’ll start: Boating Accident</p>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/CryptoCurrency/comments/q5q8xr/in_a_single_sentence_describe_your_entire/",
  "subreddit": "CryptoCurrency",
  "id": "q5q8xr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As the title says describe your entire portfolio in a single sentence, I may\ncomment and try to guess what coins you’re holding as well. Bonus points if your\ncomment is funny I’ll tip you a moon.\n\nI have no other words to say and this 500 character limit is really annoying so\nhere is some filler…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルにあるように、あなたのポートフォリオ全体を一文で表現してください。\nコメントして、どんなコインを持っているのかを推測してみるのもいいかもしれませんね。あなたのコメントが面白かったらボーナスポイント\nコメントが面白かったら、月のチップをあげるよ。\n\n他に言いたいこともないし、この500文字という制限は本当にうっとうしいので\nここにいくつかのフィラーがあります...",
      "title": "あなたのポートフォリオ全体を一文で表現してください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "正如标题所说，用一句话描述你的整个投资组合，我可以\n评论并试图猜测你持有什么硬币。如果你的\n如果你的评论很有趣，我就给你一个月的小费。\n\n我没有别的话可说，而且这个500字的限制真的很烦人，所以\n这里有一些填充物...",
      "title": "用一句话来描述你的整个投资组合"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "正如標題所說，用一句話描述你的整個投資組合，我可以\n評論並試圖猜測你持有什麼硬幣。如果你的\n如果你的評論很有趣，我就給你一個月的小費。\n\n我沒有別的話可說，而且這個500字的限制真的很煩人，所以\n這裏有一些填充物...",
      "title": "用一句話來描述你的整個投資組合"
    }
  ]
}