{
  "author": "FreakingOutTheNGHBRD",
  "the_new_excerpt": "Well guys, I lost 90k today on SPY calls which was basically all of my account.\nI started in 2017 with like 30k of my own money and over the course of 3 years,\nspent probably a couple hundred hours learning about stocks, options, doing\n\"research\" etc. Today, I am down 8k since i started in…",
  "original_created_utc": 1611272878,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "好了各位，我今天在SPY看涨上亏了9万，基本上是我账户的全部资金。\n我从2017年开始，用自己的钱大概有3万，在3年的时间里。\n花了大概几百个小时学习股票，期权，做\n\"研究 \"等。今天，我下降了8千，因为我开始在...",
      "title": "今天我是如何炸掉自己的账户，损失9万元的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好了各位，我今天在SPY看漲上虧了9萬，基本上是我賬戶的全部資金。\n我從2017年開始，用自己的錢大概有3萬，在3年的時間裏。\n花了大概幾百個小時學習股票，期權，做\n\"研究 \"等。今天，我下降了8千，因爲我開始在...",
      "title": "今天我是如何炸掉自己的賬戶，損失9萬元的？"
    }
  ],
  "title": "How I Blew Up My Account Today and Lost $90,000",
  "created_utc": 1611353762,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Well guys, I lost 90k today on SPY calls which was basically all of my account. I started in 2017 with like 30k of my own money and over the course of 3 years, spent probably a couple hundred hours learning about stocks, options, doing &quot;research&quot; etc. Today, I am down 8k since i started in 2017.</p>\n\n<p>Proof: <a href=\"https://imgur.com/8zoihg7\">https://imgur.com/8zoihg7</a></p>\n\n<p>(shows -60k but I was down -30k yesterday already on the calls)</p>\n\n<p>That was money I planned on using for a downpayment on a house, and for paying my taxes on gains from last year. So once February comes around, the 20k I have left is basically going to taxes on gains from last year which are now gone. I am effectively broke :-)</p>\n\n<p>Im not that upset because I have a decent paying job.. but god damn, I was literally just contacting real estate agents last week because I was planning on buying a house. I could still buy one, but it will probably take me years to get back to 100k in savings.</p>\n\n<p>I should have just stuck to selling puts like I was doing for the past couple months. The gains aren&#39;t huge, but selling 100k worth of puts every week is enough to make you a couple G&#39;s every month with not a ton of risk. I could have made my future mortgage payments just selling puts.</p>\n\n<p>I am trying to look on the bright side. Having 100k made me spend somewhat frivolously. Like eating out twice a day, buying clothes i didn&#39;t need, etc. Now I have to go back to scrimping and scraping, which is good I think. I was getting a little ridiculous.</p>\n\n<p>Also, I have been finishing up my degree online but have had no motivation since I already have a decent job and decent money saved. Im feeling the pressure now to hurry up and finish my degree so I can get a better job (100k+ a year).</p>\n\n<p>I went all in on $390 1/22 SPY calls yesterday. I did the math; if we would have had a 1.5% day today, I would have made about 500k.. but it was pretty flat so at open, I was already down a shit ton. Figuring there was no chance left, I pulled out what was left, about 47k. I saw ford was going up crazy and figured that was pretty much my only chance to get back to where I was. Basically bought calls expiring tomorrow at the top, started going down, I pushed out and sold. So now I have 20k.</p>\n\n<p>I&#39;m not super depressed about it or anything because I know ill be fine, but I already miss the coziness of having 100k stored away. Knowing that if I lost my job or something, id be okay. But like I said, Im looking on the bright side.</p>\n\n<p>My goal at the moment is to just save as much money as possible, pay my taxes in February, and then start over.\nNot even gonna lie, if I didn&#39;t need the 20k to pay taxes on last years gains, Id probably yolo it into something crazy. It&#39;s better to feel like this than nothing at all. Kinda fucked but whatever man, life is just boring.</p>\n\n<p><strong><em>EDIT</em></strong> Honestly guys, I could go all in GME shares but even if it goes up 100% this year, I will only be at 40k.. which is already far fetched. Do any of you seriously believe GME is going up 500% this year? Maybe. Maybe you&#39;re right.. Maybe I need to go all in shares, defer paying my taxes for as long as possible, and hope for the best. God you guys give me hope.</p>\n\n<p><strong><em>EDIT 2</em></strong> </p>\n\n<p><strong>ALRIGHT, so im going all in shares on something and just holding long. Half of you faggies are saying GME, half are saying BB. Which fucking one is it? I can&#39;t risk any options plays at the moment</strong>.</p>\n\n<p><strong><em>EDIT: Went all in GME this morning, already up 50% to 30k. There is hope!</em></strong></p>\n</div><!-- SC_ON -->",
  "score": 1682,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/GbsoI9PIEBMOoX4aIBKJAr8PnUXtkuCm4JDjd8WO6hw.jpg?auto=webp&s=e4880a3caa38dcba742db056b908453499974900",
          "width": 600,
          "height": 315
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/GbsoI9PIEBMOoX4aIBKJAr8PnUXtkuCm4JDjd8WO6hw.jpg?width=108&crop=smart&auto=webp&s=eb692a536cdb68505bf7fb567e03e6ad8c33e2da",
            "width": 108,
            "height": 56
          },
          {
            "url": "https://external-preview.redd.it/GbsoI9PIEBMOoX4aIBKJAr8PnUXtkuCm4JDjd8WO6hw.jpg?width=216&crop=smart&auto=webp&s=29b8ef089f999ad15f8631a648d99797e13e462e",
            "width": 216,
            "height": 113
          },
          {
            "url": "https://external-preview.redd.it/GbsoI9PIEBMOoX4aIBKJAr8PnUXtkuCm4JDjd8WO6hw.jpg?width=320&crop=smart&auto=webp&s=59d082ed44255997e18c4526f058217e8bf865f9",
            "width": 320,
            "height": 168
          }
        ],
        "variants": {},
        "id": "VvoM28X65qYXVS74zinRsPEY66JsOR0ADbeI8wH-Qks"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/wallstreetbets/comments/l2b0no/how_i_blew_up_my_account_today_and_lost_90000/",
  "subreddit": "wallstreetbets",
  "id": "l2b0no",
  "is_self": true,
  "media": null,
  "is_video": false
}