{
  "author": "A_sexy_black_man",
  "original_created_utc": 1625706733,
  "title": "ShibaSwap does not offer staking , they are minting and burning 2 tokens at a 1:1 ratio which results in you getting nothing",
  "created_utc": 1625733582,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Shiba Inu token has launched their own swap similar to uniswap. It now offers staking but not in a traditional sense, instead users deposit Shiba Inu tokens which are then locked, and those users are given newly minted tokens named xShib, which they can later come back and use to redeem their original tokens. The site claims they earn rewards for staking but based on my findings this is not the case at all.  </p>\n\n<p>I am not here to to spread fud, but the lack of transparency with this is a big red flag for me. There is  no Certik audit as they have claimed is underway for over 2 months now, there is no documentation site, no faces on the project, and no links to any of the contracts which people are using. Through some deep digging I was able to find <a href=\"https://etherscan.io/address/0xb4a81261b16b92af0b9f7c4a83f1e885132d81e4\">this live contract for xShib</a> . Click &#39;contract&#39; on the page and then the code tab and you will see the functions I am about to highlight:<br/>\n<strong>function 1:</strong> <strong><em>Enter</em></strong> <strong>- This is the &#39;Bury Shib&#39; under BURY on ShibaSwap.com , hence the contract name being BuryShib on the link above. It&#39;s also worth noting I looked at all 3 for &#39;Bury Shib&#39; , &#39;Bury Bone&#39; , and &#39;Bury Leash&#39; they are all the same code:</strong></p>\n\n<p><code>// Enter the doghouse. Pay some SHIBs. Earn some shares.</code></p>\n\n<p><code>// Locks Shib and mints xShib</code></p>\n\n<p><code>function enter(uint256 _amount) public {</code></p>\n\n<p><code>// Gets the amount of Shib locked in the contract</code></p>\n\n<p><code>uint256 totalShib = shib.balanceOf(address(this));</code></p>\n\n<p><code>// Gets the amount of xShib in existence</code></p>\n\n<p><code>uint256 totalShares = totalSupply();</code></p>\n\n<p><code>// If no xShib exists, mint it 1:1 to the amount put in</code></p>\n\n<p><code>if (totalShares == 0 || totalShib == 0) {</code></p>\n\n<p><code>_mint(msg.sender, _amount);</code></p>\n\n<p><code>}</code> </p>\n\n<p>&#x200B;</p>\n\n<p>So this part of the function is taking the amount of Shiba inu token you want to deposit as an argument, then it gets the total amount of xShib already in existence as well as Shiba Inu locked in the contract, which at the time of this post is around $380 Million dollars and around 45 trillion tokens. It then does the following:</p>\n\n<p>&#x200B;</p>\n\n<p><code>// Calculate and mint the amount of xShib the Shib is worth. The ratio will change overtime, as xShib is burned/minted and Shib deposited + gained from fees / withdrawn.</code></p>\n\n<p><code>else {</code></p>\n\n<p><strong>uint256 what = _amount.mul(totalShares).div(totalShib);</strong></p>\n\n<p><code>//100*1000/1000</code></p>\n\n<p><code>_mint(msg.sender, what);</code></p>\n\n<p><code>}</code></p>\n\n<p><code>// Lock the Shib in the contract</code></p>\n\n<p><code>shib.transferFrom(msg.sender, address(this), _amount);</code></p>\n\n<p><code>}</code></p>\n\n<p>Take note of the variable &#39;what&#39; I highlighted bold. Now take a look at <a href=\"https://etherscan.io/token/0xb4a81261b16b92af0b9f7c4a83f1e885132d81e4\">this page of the contract</a> , specifically the total supply of xShib in the top left , its around 45 trillion, the almost exact same amount locked in the contract. You can verify first link I provided again, and click the drop down in the top left where it shows the value in the contract and check how many ShibaInu are in the xShib contract, its almost identical. (Also RIP to whoever sent .72 LEASH to this address, thats around $1800 to never be seen again)  </p>\n\n<p>The section in bold is the important part, the function is taking the amount you want to deposit, multiplying that by the total supply of xShib, and then dividing that by the total Shiba Inu in the contract. Since its minting the amount someone deposits you&#39;ll only be getting back what you put in. This is obvious once you get to the next function for when you want to withdraw: </p>\n\n<p><strong>Method 2 -</strong> <strong><em>Leave</em></strong> <strong>- return your xShib tokens and redeem your Shiba tokens.</strong><br/>\n<code>// Leave the doghouse. Claim back your SHIBs.</code></p>\n\n<p><code>// Unclocks the staked + gained Shib and burns xShib</code></p>\n\n<p><code>function leave(uint256 _share) public {</code></p>\n\n<p><code>// Gets the amount of xShib in existence</code></p>\n\n<p><code>uint256 totalShares = totalSupply();</code></p>\n\n<p><code>// Calculates the amount of Shib the xShib is worth</code></p>\n\n<p><strong>uint256 what = _share.mul(shib.balanceOf(address(this))).div(totalShares);</strong></p>\n\n<p><code>_burn(msg.sender, _share);</code></p>\n\n<p><code>shib.transfer(msg.sender, what);</code></p>\n\n<p><code>}</code></p>\n\n<p>Again the important part of the code is in bold, this function is passed a parameter which is _share , share represents how many xShiba tokens you are depositing back into the contract as you call Leave. It then does a calculation of your return in the  &#39;what&#39; variable which can be simplified as followed:<br/>\nProfitReturn = your xShib shares multiplied by their their wallets ShibaInu balance divided by the total number of xShib tokens in existence. </p>\n\n<p><strong>Analysis</strong>:<br/>\nCurrently the <a href=\"https://etherscan.io/address/0xb4a81261b16b92af0b9f7c4a83f1e885132d81e4#code\">xShiba main net</a> wallet holds $380 million dollars worth of Shiba in less than 24 hours since launch. The total max supply (which is constantly being minted or burned) is currently around 44 trillion xShiba.<br/>\nShiba Inu Tokens in wallet: 44,xxx,xxx,xxx,xxx (44 trillion)<br/>\nIf I deposited $38,000,000 or 10% of the Shiba Inu in the contract, then I would receive 4,xxx,xxx,xxx,xxx (4 trillion) xShiba coins which again is around 10% of the total 44 trillion coins in the wallet.<br/>\nBased on the ‘what’ variable in the ‘Leave’ function above we can assume the following using our simplified explanation:<br/>\nProfitReturn = 4 trillion xShiba * 44 trillion Shiba Inu divided by 44 trillion total xShiba = 4 trillion.   </p>\n\n<p>After the calculation the leave function calls  <code>_burn(msg.sender, _share);</code>and literally nothing has happened. I&#39;ve verified this by going through transactions on the contract and finding wallets that have called the &#39;leave&#39; function , I went through a few accounts and looked at how much they initially &#39;entered&#39; vs how much they received when they &#39;left&#39; and nothing happens in terms of value gained. The contract is literally taking what you put in and giving you that much back. If this is incorrect then it comes down to lack of transparency of how this entire swap is working. Again this is an open invite for the devs/founders to come in and provide some clarity.</p>\n\n<p>Edit: Seeing a couple comments asking for the code, <a href=\"https://etherscan.io/address/0xb4a81261b16b92af0b9f7c4a83f1e885132d81e4#code#F1#L45\">here it is</a></p>\n\n<p>There are 55 total lines in the buryShib contract , and 4 other files which are OpenZeppelin libraries (standard for most tokens).</p>\n</div><!-- SC_ON -->",
  "score": 160,
  "permalink": "/r/CryptoCurrency/comments/ofwnfz/shibaswap_does_not_offer_staking_they_are_minting/",
  "subreddit": "CryptoCurrency",
  "id": "ofwnfz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Shiba Inu token has launched their own swap similar to uniswap. It now offers\nstaking but not in a traditional sense, instead users deposit Shiba Inu tokens\nwhich are then locked, and those users are given newly minted tokens named\nxShib, which they can later come back and use to redeem their…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Shiba Inu tokenは、uniswapのような独自のスワップを開始しました。このスワップでは\n杭打ちができるようになりましたが、伝統的な意味での杭打ちではなく、ユーザーはShiba Inuトークンを預けると\nがロックされ、そのユーザーにはxShibという新しいトークンが与えられます。\nxShibと呼ばれる新たなトークンが与えられ、後で戻ってきてそのトークンを使って...",
      "title": "ShibaSwapはステークスを提供していません。彼らは2つのトークンを1:1の割合で鋳造・燃焼させており、結果としてあなたは何も得られません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Shiba Inu token已经推出了他们自己的交换方案，类似于uniswap。它现在提供\n但不是传统意义上的赌注，而是用户存入Shiba Inu token\n然后被锁定，这些用户会得到新铸造的代币，名为\nxShib，他们以后可以回来用它来赎回他们的...",
      "title": "ShibaSwap不提供赌注，他们以1:1的比例铸造和燃烧2个代币，结果是你什么都得不到。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Shiba Inu token已經推出了他們自己的交換方案，類似於uniswap。它現在提供\n但不是傳統意義上的賭注，而是用戶存入Shiba Inu token\n然後被鎖定，這些用戶會得到新鑄造的代幣，名爲\nxShib，他們以後可以回來用它來贖回他們的...",
      "title": "ShibaSwap不提供賭注，他們以1:1的比例鑄造和燃燒2個代幣，結果是你什麼都得不到。"
    }
  ]
}