{
  "author": "itskayyuhvin",
  "the_new_excerpt": "https://finance.yahoo.com/news/plug-power-restate-previously-issued-210000037.html\n\nPLUG power down hard after hours due to news that there are some small\naccounting errors. I believe this is a great buy in and been meaning to release\nsome DD on it that it is a very underrated stock. Why? They're a…",
  "original_created_utc": 1615931048,
  "localize": [
    {
      "locale": "zh",
      "title": "PLUG Power Down AH | 购买机会和原因",
      "the_new_excerpt": "https://finance.yahoo.com/news/plug-power-restate-previously-issued-210000037.html\n\nPLUG断电难后，由于有消息称，有一些小。\n会计错误。我相信这是个很好的买点，一直想放出\n一些DD上，它是一个非常被低估的股票。为什么这么说？他们是一个..."
    },
    {
      "locale": "zh-Hant",
      "title": "PLUG Power Down AH | 購買機會和原因",
      "the_new_excerpt": "https://finance.yahoo.com/news/plug-power-restate-previously-issued-210000037.html\n\nPLUG斷電難後，由於有消息稱，有一些小。\n會計錯誤。我相信這是個很好的買點，一直想放出\n一些DD上，它是一個非常被低估的股票。爲什麼這麼說？他們是一個..."
    }
  ],
  "title": "PLUG Power Down AH | Buying Opportunity and Why",
  "created_utc": 1615956275,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://finance.yahoo.com/news/plug-power-restate-previously-issued-210000037.html\">https://finance.yahoo.com/news/plug-power-restate-previously-issued-210000037.html</a></p>\n\n<p>PLUG power down hard after hours due to news that there are some small accounting errors. I believe this is a great buy in and been meaning to release some DD on it that it is a very underrated stock. Why? They&#39;re a legit company and the better of the fuel cell stocks (FuelCell for example which was waay overpriced) with contracts in Europe and Korea.</p>\n\n<p>- Korea recently invested in them at <strong>30$ a share</strong>. Should be a floor.</p>\n\n<p>- Energy pull back recent weeks. This is easily a 100$ stock by next year end</p>\n\n<p>- Partnerships with Amazon, Walmart, Nike, Home Depot, etc. Their battery product is real it&#39;s already being used on forklifts. The question is when it&#39;ll be moved to more products.</p>\n\n<p>- Legit company, not like Nikola. Their glassdoor even has a hiring <em>SURGE</em>:</p>\n\n<p><a href=\"https://www.glassdoor.com/Reviews/Plug-Power-Reviews-E9782.htm\">https://www.glassdoor.com/Reviews/Plug-Power-Reviews-E9782.htm</a></p>\n\n<p>- CEO statement on this:</p>\n\n<p>Andy Marsh, CEO of Plug Power, said, “Since our founding nearly 25 years ago, Plug Power has prided itself on operating <strong><em>with transparency and integrity, and we are working to resolve this matter quickly. Importantly, there is no expected impact to our cash position, business operations or economics of commercial arrangements</em></strong>. We continue to execute on our mission to provide customers with state-of-the-art fuel cell and green hydrogen solutions. We remain confident in our ability to leverage our strong business momentum and market leading technologies, independently and alongside our joint venture partners, to capture the significant business opportunities in this rapidly growing industry.”</p>\n</div><!-- SC_ON -->",
  "score": 58,
  "permalink": "/r/stocks/comments/m6k9e7/plug_power_down_ah_buying_opportunity_and_why/",
  "subreddit": "stocks",
  "id": "m6k9e7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147382538
}