{
  "author": "Jq4000",
  "the_new_excerpt": "I'm seeing a lot of posts comparing this to the 2000 dot-com bubble. Here's a\nbreakdown of why we're likely not anywhere close to 2000 levels of craziness.\n\nFirst: During the dot-com era, the Nasdaq Composite's price-to-earnings\nvaluation ran up as high as 200. By comparison, the index's P/E today…",
  "original_created_utc": 1609651162,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我看到很多帖子把它与2000年的网络泡沫相提并论。这是一个\n为什么我们不可能达到接近2000的疯狂水平。\n\n第一：在互联网时代，纳斯达克综合指数的市盈率\n估值高达200英镑。相比之下，该指数今天的市盈率为…",
      "title": "我们可能不会进入泡沫的原因"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到很多帖子把它與2000年的網絡泡沫相提並論。這是一個\n爲什麼我們不可能達到接近2000的瘋狂水平。\n\n第一：在互聯網時代，納斯達克綜合指數的市盈率\n估值高達200英鎊。相比之下，該指數今天的市盈率爲…",
      "title": "我們可能不會進入泡沫的原因"
    }
  ],
  "title": "Reasons We May Not Be in a Bubble",
  "created_utc": 1609655960,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m seeing a lot of posts comparing this to the 2000 dot-com bubble. Here&#39;s a breakdown of why we&#39;re likely not anywhere close to 2000 levels of craziness.</p>\n\n<p><strong>First:</strong>  During the dot-com era, the Nasdaq Composite&#39;s price-to-earnings valuation ran up as high as 200. By comparison, the index&#39;s P/E today is a relatively tame 28, only modestly higher from 23 at the end of 2019. </p>\n\n<p><strong>Second:</strong> Interest rates were a very attractive 6% which provided a strong alternative to stocks. No such outlet exists today unless you trust bitcoin, or want to invest in paper gold.</p>\n\n<p><strong>Third:</strong> Much of the value gains we&#39;re seeing in the market can be tied directly to the fact that people who invest are making similar or better money this year, and spending significantly less causing them to save more and invest more:</p>\n\n<p><a href=\"https://www.nytimes.com/2021/01/01/upshot/why-markets-boomed-2020.html\">https://www.nytimes.com/2021/01/01/upshot/why-markets-boomed-2020.html</a></p>\n\n<p><strong>Fourth:</strong> The rest of the growth can largely be attributed to increased liquidity from all of the money printing. Stocks tend to mirror an increase in the money supply with their value making them a great hedge against inflation. The valuations of the 2000s weren&#39;t backstopped by QE or increased savings, making them much shakier.</p>\n\n<p><strong>Fifth:</strong> The money printing will likely go on for a while. People mistakenly assume we&#39;re printing against our 22T dollar economy when we&#39;re really printing against the 80-100T global economy for which are the reserve currency. A weak dollar benefits the global economy, and benefits us because we are the trading floor for the global economy.</p>\n\n<p>This is a long but very illuminating read on why QE is necessary and actually helpful:</p>\n\n<p><a href=\"https://www.lynalden.com/fraying-petrodollar-system/\">https://www.lynalden.com/fraying-petrodollar-system/</a></p>\n\n<p><strong>My Take:</strong> There are a few stocks that are out of control with their valuations (Hi TSLA!), and a few sectors that are overvalued, but overall the market looks to be on sturdy ground with the increased savings, and the increased liquidity. There will be peaks and valleys, but I think there&#39;s a lot of room to grow, especially once the vaccine is widespread.</p>\n</div><!-- SC_ON -->",
  "score": 2949,
  "permalink": "/r/investing/comments/kpeffw/reasons_we_may_not_be_in_a_bubble/",
  "subreddit": "investing",
  "id": "kpeffw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610100747519
}