{
  "author": "Odlavso",
  "original_created_utc": 1645579226,
  "title": "The market is red, your investments are down so get your mind off of the losses and come enjoy a game of Gods Unchained.",
  "created_utc": 1645601481,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Gods Unchained is a blockchain trading card game that &lt;strong&gt;takes some of the best features from&lt;/strong&gt; &lt;strong&gt;&lt;em&gt;Hearthstone,&lt;/em&gt;&lt;/strong&gt; &lt;strong&gt;but has a unique mana system and an original favor feature&lt;/strong&gt;. It allows you to earn cards and trinkets, which you can then sell on the marketplace. NFTs are stored on the &lt;strong&gt;Ethereum&lt;/strong&gt; and &lt;strong&gt;Immutable-X&lt;/strong&gt; blockchains. The game is available only for &lt;strong&gt;Windows.&lt;/strong&gt; &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Take this time to earn some NFT&amp;#39;s in the form of Trading cards that are going up in value and at the same time enjoy playing a game to distract yourself from the crypto winter before us.&lt;/p&gt;\n\n&lt;p&gt;Gods Unchained is a play to earn game, completely free to play and advance at your own pace.&lt;/p&gt;\n\n&lt;p&gt;I know some of you think NFT&amp;#39;s are stupid but they work great for a trading card games, you actually own your cards and can easily sell, trade and buy cards on the Immutable-X market place.&lt;/p&gt;\n\n&lt;p&gt;you can start playing today and start earning cards today.&lt;/p&gt;\n\n&lt;h1&gt;Roadmap&lt;/h1&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/4iy9twlufhj81.png?width=1110&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=4449f6206dba529b220cf9e58eaf927e40f2fd04\"&gt;https://trello.com/b/GpDgnYPZ/gods-unchained-roadmap&lt;/a&gt;&lt;/p&gt;\n\n&lt;h1&gt;Mobile coming soon&lt;/h1&gt;\n\n&lt;h3&gt;What can we expect to see from the game?&lt;/h3&gt;\n\n&lt;p&gt;There’s a lot to come with the game, but in order not to ruin the gaming experience achieved through the likes of future expansion sets (e.g. new NFT card sets, we can’t disclose many details. But here’s a high-level overview of what we’re working on.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Mobile game release:&lt;/strong&gt; We have an internal team designing and building out a mobile version of Gods Unchained to ease the barrier of entry by allowing the game to be played on the go. Our first touchstone is to get a playable alpha out this year. Our hope is to deliver the first access to our players in the first half of next year, with a wider alpha sometime in the second half of the year.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Expanding the game:&lt;/strong&gt; We have a heap of new cards coming out early this year with a refresh of our main card set: the Core set (a set is a collection of cards). We also have brand new NFT expansion sets in the works, alongside new game functionalities, items, and modes. To tie these developments all together, the team is also hard at work improving the new player onboarding experience. This will make it easier for anyone and everyone to join Gods Unchained and get playing.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/0aoaq5tahhj81.png?width=603&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=8563d6d8e0cc6727bcd944d6647cb6d572ece69e\"&gt;https://preview.redd.it/0aoaq5tahhj81.png?width=603&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=8563d6d8e0cc6727bcd944d6647cb6d572ece69e&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/akyq6d7chhj81.jpg?width=289&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=3e0c731f0a722a7e70c7db92818608ac9ec5553f\"&gt;https://godsunchained.com/&lt;/a&gt;&lt;/p&gt;\n\n&lt;h1&gt;It&amp;#39;s Time to Duel!&lt;/h1&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://i.redd.it/r746l1aphhj81.gif\"&gt;https://i.redd.it/r746l1aphhj81.gif&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;If any of you decide to play and are up for a challenge let me know, Direct challenges are available and it would be fun to play some of you on this sub.&lt;/p&gt;\n\n&lt;p&gt;TLDR: play Gods Unchained to distract yourself during crypto winter.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 321,
  "permalink": "/r/CryptoCurrency/comments/sz48hw/the_market_is_red_your_investments_are_down_so/",
  "subreddit": "CryptoCurrency",
  "id": "sz48hw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "> Gods Unchained is a blockchain trading card game that takes some of the best\n> features from Hearthstone, but has a unique mana system and an original favor\n> feature. It allows you to earn cards and trinkets, which you can then sell on\n> the marketplace. NFTs are stored on the Ethereum and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "> ゴッズ・アンチェインド』は、ブロックチェーントレーディングカードゲームで、その優れた点をいくつか取り入れたものです。\n> ハースストーンの特徴を生かしつつ、独自のマナシステムと独自のフェイバリットも搭載しています。\n> 機能です。カードや装身具を獲得し、それを販売することができます。\n> マーケットプレイス NFTはイーサリアムに格納され...",
      "title": "マーケットは赤、あなたの投資は減少しています。損失を気にせず、Gods Unchainedのゲームを楽しんでください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "> Gods Unchained是一款区块链交易卡牌游戏，它采用了《炉石传说》的一些最佳功能。\n> 炉石传说》的特点，但有一个独特的法力系统和一个原创的青睐\n> 的功能。它允许你赚取卡片和饰品，然后你可以在\n>市场上出售。NFTs存储在以太坊和...",
      "title": "市场是红色的，你的投资是下降的，所以把你的注意力从损失上移开，来享受一局神之解锁。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "> Gods Unchained是一款區塊鏈交易卡牌遊戲，它採用了《爐石傳說》的一些最佳功能。\n> 爐石傳說》的特點，但有一個獨特的法力系統和一個原創的青睞\n> 的功能。它允許你賺取卡片和飾品，然後你可以在\n>市場上出售。NFTs存儲在以太坊和...",
      "title": "市場是紅色的，你的投資是下降的，所以把你的注意力從損失上移開，來享受一局神之解鎖。"
    }
  ]
}