{
  "author": "Many_Scratch2269",
  "original_created_utc": 1633621894,
  "title": "Do NOT buy SHIB right now",
  "created_utc": 1633632289,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>A whale bought more than 6 Trillion SHIB</strong> causing the price to go up. If you are having some FOMO about SHIB, please ignore it. Do not buy it. Because when the whale sells, it is guaranteed that SHIB will crash. This is just a ploy to get people to invest more into SHIB. Right after the whale bought SHIB, the price has kept going up.</p>\n\n<p>If you buy SHIB right now, this is exactly what the whale wants you to do. They will certainly cash out on all their SHIB once this hype starts to lose momentum. Plus this is just the only whale that we know of, there are probably more whales that bought SHIB earlier ready to sell.</p>\n\n<p>Remember, SHIB is a hype coin with no real motive other than to get people to invest before the creators can rugpull. Do yourself a favor and DO NOT invest. This coin has absolutely nothing unique about it other than hype. When the hype dies down, so will the coin.</p>\n</div><!-- SC_ON -->",
  "score": 276,
  "permalink": "/r/CryptoCurrency/comments/q3c1fi/do_not_buy_shib_right_now/",
  "subreddit": "CryptoCurrency",
  "id": "q3c1fi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "A whale bought more than 6 Trillion SHIB causing the price to go up. If you are\nhaving some FOMO about SHIB, please ignore it. Do not buy it. Because when the\nwhale sells, it is guaranteed that SHIB will crash. This is just a ploy to get\npeople to invest more into SHIB. Right after the whale bought…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "クジラが6兆円以上のSHIBを購入したため、価格が上昇しました。もし、あなたが\n買ってはいけません。買ってはいけません。なぜなら、クジラが\n鯨が売れば、SHIBが暴落するのは確実だからです。これは、人を集めるための策略です。\nこれは、SHIBにもっと投資してもらうための策略です。クジラが買った直後に・・・。",
      "title": "今、SHIBを買ってはいけない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "一头鲸鱼买了超过6万亿SHIB，导致价格上涨。如果你是\n如果你对SHIB有一些恐惧心理，请忽略它。不要买它。因为当\n鲸鱼卖出时，保证SHIB会崩溃。这只是一个策略，让人们\n人们对SHIB进行更多的投资。就在鲸鱼买入后...",
      "title": "现在不要买SHIB"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "一頭鯨魚買了超過6萬億SHIB，導致價格上漲。如果你是\n如果你對SHIB有一些恐懼心理，請忽略它。不要買它。因爲當\n鯨魚賣出時，保證SHIB會崩潰。這只是一個策略，讓人們\n人們對SHIB進行更多的投資。就在鯨魚買入後...",
      "title": "現在不要買SHIB"
    }
  ]
}