{
  "author": "inaqu3estion",
  "original_created_utc": 1651316597,
  "title": "How did upper class women watch games at the Colosseum?",
  "created_utc": 1651379047,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Looking at a diagram of who sat where in the event of a game at the Colosseum, save for the Vestal Virgins who sat at the bottom along with the upper echelons of society, women of all classes had to sit at the very top, along with the poor, foreigners, non-citizens, and slaves. Apparently this was even true if they were part of the elite class and wives of senators, equestrians, magistrates, etc. I can&amp;#39;t imagine upper class women wanting to sit with such characters, so how did this work in practice? Did they bring bodyguards with them? Did they attend at all?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/uf8uly/how_did_upper_class_women_watch_games_at_the/",
  "subreddit": "AskHistorians",
  "id": "uf8uly",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Looking at a diagram of who sat where in the event of a game at the Colosseum,\nsave for the Vestal Virgins who sat at the bottom along with the upper echelons\nof society, women of all classes had to sit at the very top, along with the\npoor, foreigners, non-citizens, and slaves. Apparently this was…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "コロッセオでの試合の際、誰がどこに座ったかの図を見ながら。\n一番下に座っていたヴェスタルの処女を除けば、上流階級の人々とともに\nを除いて、すべての階級の女性が一番上に座らなければならなかった。\n貧乏人、外国人、非国民、奴隷とともに。どうやら、これは...",
      "title": "上流階級の女性は、コロッセオでどのように観戦していたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "看一下在斗兽场进行比赛时，谁坐在哪里的图示。\n除了坐在底层的圣母玛利亚和社会上层人士外，所有阶层的妇女都必须坐在最上层。\n所有阶层的妇女都必须坐在最上面，还有穷人、外国人、非公民。\n穷人、外国人、非公民和奴隶。显然，这是...",
      "title": "上层社会的女性是如何在斗兽场观看比赛的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "看一下在鬥獸場進行比賽時，誰坐在哪裏的圖示。\n除了坐在底層的聖母瑪利亞和社會上層人士外，所有階層的婦女都必須坐在最上層。\n所有階層的婦女都必須坐在最上面，還有窮人、外國人、非公民。\n窮人、外國人、非公民和奴隸。顯然，這是...",
      "title": "上層社會的女性是如何在鬥獸場觀看比賽的？"
    }
  ]
}