{
  "author": "dont_drop_dat_phone",
  "original_created_utc": 1637559938,
  "title": "Is it weird to go to a house/apartment where you used to live, knock on the door, and ask the current tenants if you can walk around for nostalgia's sake?",
  "created_utc": 1637567794,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Even if it&#39;s just for 5 minutes. In and out. I&#39;ve always thought about doing this in my childhood home, and my first apartment. Just a quick in/out. I always thought if somebody knocked on my door I&#39;d totally let them have their nostalgic moment. </p>\n\n<p>Is this too weird or is this a thing that sometimes happens?</p>\n</div><!-- SC_ON -->",
  "score": 119,
  "permalink": "/r/TooAfraidToAsk/comments/qzeayc/is_it_weird_to_go_to_a_houseapartment_where_you/",
  "subreddit": "TooAfraidToAsk",
  "id": "qzeayc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Even if it's just for 5 minutes. In and out. I've always thought about doing\nthis in my childhood home, and my first apartment. Just a quick in/out. I always\nthought if somebody knocked on my door I'd totally let them have their nostalgic\nmoment.\n\nIs this too weird or is this a thing that sometimes…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "たとえ5分でもいい。出たり入ったり。子供の頃に住んでいた家や\n子供の頃に住んでいた家でも、最初に住んだアパートでも。ちょっとした出入りです。私はいつも\nもし誰かが私の家のドアをノックしたら、その人にノスタルジックな瞬間を見せてあげたいと思っていました。\nと思っていました。\n\nあまりにも奇妙なことですが、これは時々...。",
      "title": "昔住んでいた家やマンションに行って、ドアをノックして、今の住人に「懐かしさのために歩いてもいいですか」と聞くのは変ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "即使只是5分钟。进和出。我一直在想，在我童年的家做这件事\n在我童年的家和我的第一间公寓里这样做。只是一个快速的进出。我总是\n我总是想，如果有人敲我的门，我一定会让他们拥有他们的怀旧的\n的时刻。\n\n这是不是太奇怪了，还是说这是一件有时...",
      "title": "去你曾经住过的房子/公寓，敲敲门，问现在的房客是否可以为了怀旧而四处走走，这很奇怪吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "即使只是5分鐘。進和出。我一直在想，在我童年的家做這件事\n在我童年的家和我的第一間公寓裏這樣做。只是一個快速的進出。我總是\n我總是想，如果有人敲我的門，我一定會讓他們擁有他們的懷舊的\n的時刻。\n\n這是不是太奇怪了，還是說這是一件有時...",
      "title": "去你曾經住過的房子/公寓，敲敲門，問現在的房客是否可以爲了懷舊而四處走走，這很奇怪嗎？"
    }
  ]
}