{
  "author": "The_Manchurian",
  "original_created_utc": 1652549969,
  "title": "Peter, John, James, Nathaniel, Andrew, Thomas, Matthew, Mark, Elizabeth, Mary are all Jewish names. Yet they don't seem popular amongst Jews today. Why not?",
  "created_utc": 1652566814,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Is this because they are too associated with Christianity, and so Jews stopped using them over time? Or were they even banned from using them by Christians?&lt;/p&gt;\n\n&lt;p&gt;Or is it that the Anglicised versions of these names are ones popular in Britain and America, while there are non-Anglicised versions more popular in Israel and amongst the Jewish diaspora? (Like Simeon/Shimon)&lt;/p&gt;\n\n&lt;p&gt;Am I wrong about the Jewish nature of some of these names? The apostle Philip, for example, I&amp;#39;ve not listed as that&amp;#39;s actually a Greek name. Same with Paul (Saul is of course a fairly common Jewish name).&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/upmaum/peter_john_james_nathaniel_andrew_thomas_matthew/",
  "subreddit": "AskHistorians",
  "id": "upmaum",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Is this because they are too associated with Christianity, and so Jews stopped\nusing them over time? Or were they even banned from using them by Christians?\n\nOr is it that the Anglicised versions of these names are ones popular in Britain\nand America, while there are non-Anglicised versions more…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは、キリスト教との結びつきが強すぎるため、ユダヤ人が使わなくなったからなのか\nを使わなくなったのでしょうか？それともキリスト教徒に使用を禁止されたのだろうか？\n\nそれとも、イギリスやアメリカでは、これらの名前のアングリカイズド・バージョンが人気なのでしょうか？\nということなのでしょうか。",
      "title": "ペテロ、ヨハネ、ヤコブ、ナサニエル、アンドリュー、トーマス、マタイ、マルコ、エリザベス、マリアはすべてユダヤ人の名前である。しかし、今日のユダヤ人の間では人気がないようだ。なぜだろう？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是否因为它们与基督教有太多联系，所以犹太人不再使用它们？\n随着时间的推移，犹太人不再使用它们？或者他们甚至被基督教徒禁止使用它们？\n\n还是因为这些名字的英文版本在英国和美国很流行？\n和美国流行的名字，而有一些非英文版本的名字则更...",
      "title": "彼得、约翰、雅各、拿撒勒、安德鲁、托马斯、马太、马可、伊丽莎白、马利亚都是犹太人的名字。然而，他们在今天的犹太人中似乎并不受欢迎。为什么不呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是否因爲它們與基督教有太多聯繫，所以猶太人不再使用它們？\n隨着時間的推移，猶太人不再使用它們？或者他們甚至被基督教徒禁止使用它們？\n\n還是因爲這些名字的英文版本在英國和美國很流行？\n和美國流行的名字，而有一些非英文版本的名字則更...",
      "title": "彼得、約翰、雅各、拿撒勒、安德魯、托馬斯、馬太、馬可、伊麗莎白、馬利亞都是猶太人的名字。然而，他們在今天的猶太人中似乎並不受歡迎。爲什麼不呢？"
    }
  ]
}