{
  "author": "mumhestolemynuggets",
  "original_created_utc": 1645166791,
  "title": "Do you also get paranoid that people can read your mind or is that just a me think?",
  "created_utc": 1645209789,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Thing*&lt;/p&gt;\n\n&lt;p&gt;ETA: It’s not all the time. For example, you start randomly thinking about something really embarrassing or inappropriate and right after you’re kinda like “Gee that would be really embarrassing if somebody could tell what I was thinking…” and then you just kinda ponder on if somebody could tell what you were thinking in the first place.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/svbddi/do_you_also_get_paranoid_that_people_can_read/",
  "subreddit": "TooAfraidToAsk",
  "id": "svbddi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Thing*\n\nETA: It’s not all the time. For example, you start randomly thinking about\nsomething really embarrassing or inappropriate and right after you’re kinda like\n“Gee that would be really embarrassing if somebody could tell what I was\nthinking…” and then you just kinda ponder on if somebody could…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "シング＊。\n\nETA: いつもというわけではありません。例えば、ランダムに考え始めると\n本当に恥ずかしいこと、不適切なことをした直後に、なんとなく\n「というのも、このことを誰かに知られると、とても恥ずかしいからです。\nそして、「もし、誰かが考えていたら...」と、ちょっとだけ考えてみるのです。",
      "title": "また、人に心を読まれるのではないかと被害妄想に陥ることもありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "事*\n\nETA：这不是所有的时间。例如，你开始随机地想到\n一些非常尴尬或不合适的事情，然后你就会有点像\n\"哎呀，如果有人能知道我在想什么，那就真的很尴尬了\n然后你就有点想，如果有人能知道我在想什么......\" 然后你就有点想，如果有人能......。",
      "title": "你是否也会偏执地认为别人能读懂你的心思，还是这只是我的想法？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "事*\n\nETA：這不是所有的時間。例如，你開始隨機地想到\n一些非常尷尬或不合適的事情，然後你就會有點像\n\"哎呀，如果有人能知道我在想什麼，那就真的很尷尬了\n然後你就有點想，如果有人能知道我在想什麼......\" 然後你就有點想，如果有人能......。",
      "title": "你是否也會偏執地認爲別人能讀懂你的心思，還是這只是我的想法？"
    }
  ]
}