{
  "author": "sylsau",
  "original_created_utc": 1643191739,
  "title": "The IMF's behavior towards El Salvador only further justifies the very existence and absolute necessity of Bitcoin for the world",
  "created_utc": 1643211274,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;El Salvador is a sovereign country that has the full right to choose how it wants to act to build a better future for its people.&lt;/p&gt;\n\n&lt;p&gt;Nayib Bukele chose Bitcoin to try to change the future of his country. Under the current system, El Salvador was condemned to survive by begging for aid from the IMF or the World Bank.&lt;/p&gt;\n\n&lt;p&gt;Nayib Bukele understood the why of Bitcoin and decided to seize this opportunity to change the future of El Salvador and its people. The people of El Salvador overwhelmingly support Nayib Bukele in what he is trying to do for the country.&lt;/p&gt;\n\n&lt;p&gt;El Salvador&amp;#39;s bold choice has already changed the way the country is seen around the world. Everyone is talking about El Salvador and more and more entrepreneurs will be coming to El Salvador to participate in this experiment of building the first Bitcoin Nation.&lt;/p&gt;\n\n&lt;p&gt;Who knew where El Salvador was before Nayib Bukele made this choice? Very few people. No one was talking about El Salvador. Bitcoin is already a game-changer for El Salvador and this is clearly just the beginning.&lt;/p&gt;\n\n&lt;p&gt;While the IMF or the World Bank scoffed at Bitcoin a few years ago, now these institutions are getting scared by the growing possibility that the Bitcoin experiment will succeed in El Salvador and motivate other countries to follow Nayib Bukele&amp;#39;s path.&lt;/p&gt;\n\n&lt;p&gt;Tonga is talking about adopting Bitcoin by the end of 2022, as are other countries in South and Central America. In short, something is happening and the IMF feels the danger mounting for its obsolete system.&lt;/p&gt;\n\n&lt;p&gt;Rather than letting the people determine for themselves, the IMF is threatening El Salvador saying the country must abandon Bitcoin. The IMF&amp;#39;s threats only justify, in my opinion, the very existence of Bitcoin and the absolute necessity for the world to have this alternative system available.&lt;/p&gt;\n\n&lt;p&gt;Since El Salvador will logically refuse to obey the IMF, what&amp;#39;s next? Will America eventually orchestrate a coup in El Salvador to overthrow the government and end the Bitcoin experiment? How far are the powerful people in the current system willing to go to prevent countries from expressing their free will in monetary and financial matters?&lt;/p&gt;\n\n&lt;p&gt;El Salvador must continue to resist outside pressure, and other countries that will join the Bitcoin adventure in 2022 must do the same. The world is changing, and the first countries to adopt Bitcoin will be the ones to benefit the most in the future.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 380,
  "permalink": "/r/Bitcoin/comments/sd2mor/the_imfs_behavior_towards_el_salvador_only/",
  "subreddit": "Bitcoin",
  "id": "sd2mor",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "El Salvador is a sovereign country that has the full right to choose how it\nwants to act to build a better future for its people.\n\nNayib Bukele chose Bitcoin to try to change the future of his country. Under the\ncurrent system, El Salvador was condemned to survive by begging for aid from the\nIMF or…"
}