{
  "author": "KFC_waster",
  "original_created_utc": 1653802567,
  "title": "I think I messed up, does this girl like me??",
  "created_utc": 1653824379,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I (15m) was in a somewhat heated argument yesterday with a acquaintance (15f) about whether it is possible to have a meaningless kiss. She was heavily arguing that it was impossible to kiss someone without it meaning anything (even if it was really small) and I argued otherwise. After a few minutes of back and forth, she randomly grabs my face and pecks me on the lips.&lt;/p&gt;\n\n&lt;p&gt;She then said, &amp;quot;Was that meaningless???&amp;quot;. I shrugged my shoulders and said yes. She then burst into tears and ran away. My best friend said I was an idiot because it was &amp;#39;obvious&amp;#39; that she liked me. I am a bit slow to make sense of all of this, but is my friend right?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 117,
  "permalink": "/r/NoStupidQuestions/comments/v04kpw/i_think_i_messed_up_does_this_girl_like_me/",
  "subreddit": "NoStupidQuestions",
  "id": "v04kpw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I (15m) was in a somewhat heated argument yesterday with a acquaintance (15f)\nabout whether it is possible to have a meaningless kiss. She was heavily arguing\nthat it was impossible to kiss someone without it meaning anything (even if it\nwas really small) and I argued otherwise. After a few minutes…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私(15m)は昨日、知人(15f)とやや激しい口論になった。\n意味のないキスをすることは可能かどうかについて、昨日知人(15f)とやや激しい議論をした。彼女は激しく\nをすることは不可能であると激しく主張した。\nと激しく主張し、私はそうではないと主張した。数分後・・・。",
      "title": "失敗しちゃったかな、この子は私のことが好きなのかな？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我（15岁）昨天和一个熟人（15岁）发生了有点激烈的争吵。\n关于是否可能有一个无意义的吻。她激烈地争辩说\n她认为不可能在没有任何意义的情况下亲吻某人（即使是非常小的吻\n而我则持相反意见。几分钟后...",
      "title": "我想我搞砸了，这个女孩喜欢我吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我（15歲）昨天和一個熟人（15歲）發生了有點激烈的爭吵。\n關於是否可能有一個無意義的吻。她激烈地爭辯說\n她認爲不可能在沒有任何意義的情況下親吻某人（即使是非常小的吻\n而我則持相反意見。幾分鐘後...",
      "title": "我想我搞砸了，這個女孩喜歡我嗎？"
    }
  ]
}