{
  "author": "psychotrader00",
  "the_new_excerpt": "PsychoMarket Recap - Friday, April 16, 2021\n\nStocks traded higher on Friday, continuing momentum from yesterday’s\nrecord-setting close, with a batch of better-than-expected economic and\ncorporate earnings results fueling the recent rally. The S&P 500 (SPY) and Dow\nJones (DIA) set fresh intraday…",
  "original_created_utc": 1618604922,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "PsychoMarket Recap - 2021年4月16日（金\n\n2021年4月16日(金)の株式市場は、昨日の記録的な大引けからの勢いのままに上昇しました。\n昨日の記録的な大引けの勢いそのままに、予想を上回る経済指標や企業決算が相次ぎ、株価は上昇しました。\n株は、昨日の記録的な大引け後の勢いそのままに、予想を上回る経済・企業業績の発表を受けて上昇しました。S&P 500 (SPY)とダウ\nジョーンズ(DIA)は、日中に新...",
      "title": "本日2021年4月16日（金）のマーケット・リカップをご紹介します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "心理市场回顾--2021年4月16日，星期五。\n\n周五股市走高，延续了昨天的势头。\n创纪录的收盘价，一批好于预期的经济和社会发展数据。\n企业财报助推近期涨势。标准普尔500指数（SPY）和道琼斯指数（Dow\n琼斯(DIA)刷新日内...",
      "title": "以下是2021年4月16日（星期五）今天的市场回顾。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "心理市場回顧--2021年4月16日，星期五。\n\n週五股市走高，延續了昨天的勢頭。\n創紀錄的收盤價，一批好於預期的經濟和社會發展數據。\n企業財報助推近期漲勢。標準普爾500指數（SPY）和道瓊斯指數（Dow\n瓊斯(DIA)刷新日內...",
      "title": "以下是2021年4月16日（星期五）今天的市場回顧。"
    }
  ],
  "title": "Here is a Market Recap for today Friday, April 16, 2021",
  "created_utc": 1618653550,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>PsychoMarket Recap - Friday, April 16, 2021</strong></p>\n\n<p>Stocks traded higher on Friday, continuing momentum from yesterday’s record-setting close, with a batch of better-than-expected economic and corporate earnings results fueling the recent rally. The S&amp;P 500 (SPY) and Dow Jones (DIA) set fresh intraday records while the tech-heavy Nasdaq (QQQ) traded mostly flat. </p>\n\n<p>According to a report by the US Department of Commerce, retail sales boomed 9.8% higher in the month of March as the economy continues to gradually reopen as more vaccines are distributed. Moreover, the Weekly Unemployment report showed first-time unemployment claims plunged far below analyst estimates. The Labor Department reported 576,000 new jobless claims for the week ending April 10. This represents the lowest total first-time unemployment claims filed since August 2020 and a sharp decline from both the previous week’s total of 769,000 and analyst expectations of 710,000. </p>\n\n<p>This is great news on two fronts. First, consumer spending represents 70% of US GDP (<a href=\"https://www.thebalance.com/components-of-gdp-explanation-formula-and-chart-3306015#:%7E:text=Consumer%20spending%20comprises%2070%25%20of,components%20of%20the%20U.S.%20economy.\">more info here</a>) and is a key driver of economic growth. GDP is now expected to increase 6.5% in 2021 according to the Federal Open Market Committee, the central bank&#39;s monetary policy-making group. That is sharply higher than the 4.2% forecast made in December of 2020. Second, Jerome Powell and other FOMC members have reiterated that recovery in the labor market “remains uneven and far from complete”. To see a report blow so far past analyst expectation is a great sign the labor market is recovering in tandem with the surge in consumer spending. </p>\n\n<p>Michael Pearce, senior US economist for Capital Economics said of the consumer report, “What caught our eye was the 13.4% surge in spending on food and drink services, while clothing store sales were up by 18.1%. Relative to pre-pandemic levels, food and drink services sales are down just 5.1%, while clothing store sales are now higher than they were in February 2020. That suggests a combination of loosening restrictions and easing of virus fears linked to the vaccine rollout are driving a rapid return to normalcy.” </p>\n\n<p>Distribution of the Johnson and Johnson (JNJ) coronavirus vaccine remains paused in the US following reports of rare blood clots in people who received the vaccine. The agencies are reviewing data over six reported U.S. cases of a severe blood clot in individuals after receiving the vaccine, and have recommended the pause &quot;out of an abundance of caution,&quot; the FDA said in a Twitter post. To date, roughly 6.8 million doses of the single-dose JNJ vaccine have been administered. </p>\n\n<p><strong>Highlights</strong></p>\n\n<ul>\n<li>General Motors (GM) and joint-venture partner LG Chem Ltd. plan to invest $2.3 billion to construct a second battery-cell plant as the automaker continues investing in electric vehicles.</li>\n<li>Morgan Stanley (MS) posted better-than-expected earnings but revealed the company lost $911 million when Archegos Capital Management, Bill Hwang’s family office, imploded last month.</li>\n<li>NIO is likely to make an official announcement concerning its European expansion plan on May 7 or 8 according to multiple reports. </li>\n<li>Daimler AG unveiled a new high-tech and luxury all-electric Mercedes called the EQS</li>\n<li>**<strong>Please note that current stock price was written in the morning and does not reflect intraday changes*\\</strong>*</li>\n<li>Applied Materials (AMAT) target raised by Deutsche Bank from $150 to $160 at Buy. Stock currently around $135</li>\n<li>Amazon (AMZN) target raised by Credit Suisse from $3940 to $3950 at Outperform. Stock currently around $3379</li>\n<li>ASML target raised by Wells Fargo from $610 to $750 at Overweight. Stock currently around $642</li>\n<li>Bank of America (BAC) with two target raises. Stock currently around $39\n\n<ul>\n<li>Robert W. Baird from $38 to $42 at Outperform</li>\n<li>Royal Bank of Canada from $37 to $44 at Outperform</li>\n</ul></li>\n<li>Blackrock (BLK) target raised by Deutsche Bank from $847 to $912 at Buy. Stock currently around $818</li>\n<li>Boyd Gaming (BYD) target raised by Deutsche Bank from $67 to $71 at Buy. Stock currently around $65</li>\n<li>Chipotle (CMG) target raised by KeyCorp from $1625 to $1725 at Overweight. Stock currently around $1542</li>\n<li>Cisco (CSCO) target raised by Morgan Stanley (MS) from $54 to $57 at Overweight. Stock currently around $51.60</li>\n<li>Goldman Sachs (GS) target raised by BMO Capital Markets from $409 to $432 at Outperform. Stock currently around $338</li>\n<li>Lam Research (LRCX) with two target raises. Stock currently around $650\n\n<ul>\n<li>Deutsche Bank from $575 to $680 at Hold</li>\n<li>Credit Suisse from $650 to $750 at Outperform</li>\n</ul></li>\n<li>Red Rock Resorts (RRR) target raised by Deutsche Bank from $34 to $41 at Buy. Stock currently around $34</li>\n<li>Twitter (TWTR) target raised by Arhus from $72 to $82 at Buy. Stock currently around $72</li>\n<li>UnitedHealth Group (UNH) with a host of target raises after handily beating earnings estimates. Consensus price target $420 at Outperform. Stock currently around $390</li>\n</ul>\n\n<p><em>&quot;The future belongs to those who believe in the beauty of their dreams.&quot;</em> -Eleanor Roosevelt</p>\n</div><!-- SC_ON -->",
  "score": 46,
  "permalink": "/r/stocks/comments/msbrms/here_is_a_market_recap_for_today_friday_april_16/",
  "subreddit": "stocks",
  "id": "msbrms",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171526128
}