{
  "author": "LordTewksberry",
  "the_new_excerpt": "A lot of new investors have flooded the stock market recently and both new and\nold have been swooped up into the short squeeze bets.\n\nTo whoever needs to hear this.. your losses are pennies on the dollar in\ncomparison to your future financial successes. Whether this be the right stock\npicks, working…",
  "original_created_utc": 1612901311,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "最近有很多新的投资者涌入股市，新的和\n老的已经被扑倒在空头压注中。\n\n不管是谁需要听到这句话... 你的损失是一分钱一分货在\n与你未来的财务成功相比。无论这是对的股票\n挑选，工作...",
      "title": "对任何一个倒下的人，抬起头来"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近有很多新的投資者湧入股市，新的和\n老的已經被撲倒在空頭壓注中。\n\n不管是誰需要聽到這句話... 你的損失是一分錢一分貨在\n與你未來的財務成功相比。無論這是對的股票\n挑選，工作...",
      "title": "對任何一個倒下的人，擡起頭來"
    }
  ],
  "title": "To anyone down, look up",
  "created_utc": 1612905674,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A lot of new investors have flooded the stock market recently and both new and old have been swooped up into the short squeeze bets. </p>\n\n<p>To whoever needs to hear this.. your losses are pennies on the dollar in comparison to your future financial successes. Whether this be the right stock picks, working hard at a new job, or even working hard in college for a promising career. Don&#39;t give up. The only way to be successful is to work hard for it. </p>\n\n<p>I&#39;ve been reading posts here and there about people becoming mentally unstable, suicidal, etc over losses. Please talk to a close friend or family member, call a mental health provider, hell message me even if you really need to. </p>\n\n<p>For those of you who are successful, please keep an eye out for those in need of help. </p>\n\n<p>We can make money AND support our communities. </p>\n\n<p>Love,</p>\n\n<p>&quot;Just another guy who lost a fuck ton on the squeeze&quot;</p>\n</div><!-- SC_ON -->",
  "score": 929,
  "permalink": "/r/stocks/comments/lgc6km/to_anyone_down_look_up/",
  "subreddit": "stocks",
  "id": "lgc6km",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123204951
}