{
  "author": "KAX1107",
  "original_created_utc": 1631521297,
  "title": "Wall Street Journal's O'Grady writes \"El Salvador runs a Bitcoin scam\" because \"it undermines dollarization\" by evading the banking system. Disgusting journalism.",
  "created_utc": 1631561439,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.wsj.com/articles/el-salvadors-bitcoin-scam-dollar-crypto-currency-monetary-policy-11631470517\">https://www.wsj.com/articles/el-salvadors-bitcoin-scam-dollar-crypto-currency-monetary-policy-11631470517</a></p>\n\n<p>This article is such pretentious bullshit like you&#39;ve never seen. It shows how stupid MSM thinks average person is and tries to control the way they are allowed to think.</p>\n\n<p>First of all she lies that El Salvador adopted US dollar in 2001 because of hyperinflation. There was no hyperinflation. El Salvador actually adopted dollar due to low net international reserves caused by corruption. Salvadoran people hated dollarization when it was adopted.</p>\n\n<p>The main reason some people were against BTC adoption last week was actually nothing to do with BTC. Many people don&#39;t even understand BTC yet. Their fear was caused by how badly dollarization affected their economy since 2001. Dollarization only benefited banks but it was terrible for the people.</p>\n\n<p><a href=\"https://www.latimes.com/archives/la-xpm-2007-aug-04-fi-dollarize4-story.html\">2007 article about bad effects of dollarization on El Salvador</a></p>\n\n<p>The article clearly states El Salvador didn&#39;t need to adopt dollar in 2001 because there was no hyperinflation. It was done by a corrupt government to benefit banks.</p>\n\n<p>Using BTC can actually solve many problems of dollarization. Mainly it gives 70% unbanked population of El Salvador inclusivity in economy and removes remittance costs which will add half a billion per year to El Salvador&#39;s GDP. </p>\n\n<p>Why does US media have such a problem with adoption of neutral currency but they have no problem with countries adopting US dollar which is currency of foreign country?</p>\n\n<p>Bukele has said clearly that adopting dollar was only a benefit for banks. Adopting BTC was done to benefit the people.</p>\n\n<p>O&#39;Grady&#39;s reasons for why this BTC adoption is a scam are absolutely evil.</p>\n\n<ul>\n<li><p>BTC makes it difficult for US to sanction El Salvador by giving an option to still trade internationally without using dollar. (Because one country having that type of control over other countries and forcing its will like a global dictator is cool as long as you are that dominant country)</p></li>\n<li><p>El Salvador will have option to totally abandon US dollar and return to their own fiat currency which will work together with BTC. (Apparently this is bad because El Salvador will be able to print their own fiat currency as they like instead of using a foreign currency another country keeps printing as they like. WTF!?)</p></li>\n<li><p>If Bukele thought Bitcoin could work better than dollar as medium of exchange and store of value he got an education on the day of launch. (Because BTC crashed from 52k to 46k after rising 80% in the past month. She seems to have no idea that BTC can be instantly converted to USD without any loss)</p></li>\n</ul>\n\n<p>It really made my blood boil reading a privileged American journalist acting like she gives a shit about El Salvador. The real intention of this type of article is controlling how Americans are allowed to think. MSM is basically weapon of mass information manipulation for banking mafia.</p>\n\n<p><a href=\"https://youtu.be/P_Zqbg6QThg\">They&#39;ve got you by the balls</a> - George Carlin (RIP legend)</p>\n</div><!-- SC_ON -->",
  "score": 155,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/tjyycMQuGGB5KahcyCChI1QKvE0tE_sJ3TyMF_4FVv8.jpg?auto=webp&s=bda85624867bbca63f4cc1b80ef55a8465269d6d",
          "width": 1280,
          "height": 640
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/tjyycMQuGGB5KahcyCChI1QKvE0tE_sJ3TyMF_4FVv8.jpg?width=108&crop=smart&auto=webp&s=53bf23e94158e066a6f836f0c46c6b6f1fed6090",
            "width": 108,
            "height": 54
          },
          {
            "url": "https://external-preview.redd.it/tjyycMQuGGB5KahcyCChI1QKvE0tE_sJ3TyMF_4FVv8.jpg?width=216&crop=smart&auto=webp&s=12f6937c85c0c76aa2bbafc4580585bc9f652a9c",
            "width": 216,
            "height": 108
          },
          {
            "url": "https://external-preview.redd.it/tjyycMQuGGB5KahcyCChI1QKvE0tE_sJ3TyMF_4FVv8.jpg?width=320&crop=smart&auto=webp&s=3dccba2f6309e538e6bfc5ecc0e40938314c5889",
            "width": 320,
            "height": 160
          },
          {
            "url": "https://external-preview.redd.it/tjyycMQuGGB5KahcyCChI1QKvE0tE_sJ3TyMF_4FVv8.jpg?width=640&crop=smart&auto=webp&s=f8d705e85a40fe02204f8bcdf3177decaa82fd52",
            "width": 640,
            "height": 320
          },
          {
            "url": "https://external-preview.redd.it/tjyycMQuGGB5KahcyCChI1QKvE0tE_sJ3TyMF_4FVv8.jpg?width=960&crop=smart&auto=webp&s=f8eb204fa73151ccc47865cacd53edd03f0e056b",
            "width": 960,
            "height": 480
          },
          {
            "url": "https://external-preview.redd.it/tjyycMQuGGB5KahcyCChI1QKvE0tE_sJ3TyMF_4FVv8.jpg?width=1080&crop=smart&auto=webp&s=a76428fe61ffad652e7d43111b48ee7455f82951",
            "width": 1080,
            "height": 540
          }
        ],
        "variants": {},
        "id": "Bz4xkkJFqgJLzH_GTdoBzGvFQrC3AdKKEPQpdC6Cz9g"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/pnbaqt/wall_street_journals_ogrady_writes_el_salvador/",
  "subreddit": "CryptoCurrency",
  "id": "pnbaqt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "https://www.wsj.com/articles/el-salvadors-bitcoin-scam-dollar-crypto-currency-monetary-policy-11631470517\n\nThis article is such pretentious bullshit like you've never seen. It shows how\nstupid MSM thinks average person is and tries to control the way they are\nallowed to think.\n\nFirst of all she lies…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "https://www.wsj.com/articles/el-salvadors-bitcoin-scam-dollar-crypto-currency-monetary-policy-11631470517\n\nこの記事は、あなたが見たこともないような気取ったデタラメです。この記事は、MSMがいかに\nこの記事は、MSMがいかに愚かな人間だと考えているかを示しており、彼らが考えることを許される方法をコントロールしようとしています。\nコントロールしようとしています。\n\nまず第一に、彼女は嘘をついています...",
      "title": "Wall Street JournalのO'Gradyは、「エルサルバドルがビットコイン詐欺を行っている」と書いていますが、その理由は、銀行システムを回避することで「ドル化を弱体化させる」からだそうです。うんざりするようなジャーナリズムだ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "https://www.wsj.com/articles/el-salvadors-bitcoin-scam-dollar-crypto-currency-monetary-policy-11631470517\n\n这篇文章是你从未见过的自命不凡的废话。它显示了\nMSM认为普通人是多么愚蠢，并试图控制他们被允许的方式\n允许他们思考。\n\n首先，她撒谎...",
      "title": "华尔街日报》的O'Grady写道：\"萨尔瓦多运行一个比特币骗局\"，因为它通过逃避银行系统而 \"破坏了美元化\"。令人作呕的新闻报道。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "https://www.wsj.com/articles/el-salvadors-bitcoin-scam-dollar-crypto-currency-monetary-policy-11631470517\n\n這篇文章是你從未見過的自命不凡的廢話。它顯示了\nMSM認爲普通人是多麼愚蠢，並試圖控制他們被允許的方式\n允許他們思考。\n\n首先，她撒謊...",
      "title": "華爾街日報》的O'Grady寫道：\"薩爾瓦多運行一個比特幣騙局\"，因爲它通過逃避銀行系統而 \"破壞了美元化\"。令人作嘔的新聞報道。"
    }
  ]
}