{
  "author": "berriesandcreamxo",
  "original_created_utc": 1646832444,
  "title": "My mom is level 10 abusive. My dad didn’t answer yes to being asked if he was happily married. She just accused me of wanting to ‘fuck my father’. What is the appropriate response to this from me and my father?",
  "created_utc": 1646836715,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;(Mind you my mom has/is physically, emotionally, sexually, and psychologically abusive)&lt;/p&gt;\n\n&lt;p&gt;I recently lost weight and MUCH look more attractive. I wear nicer clothing, hair, the whole 9 yards. She always comments on my look, “who are you dressing up for?”, giving me the side eye, doesn’t like when I don’t wear a bra around the house, etc.&lt;/p&gt;\n\n&lt;p&gt;My mother believed that me and my dad were up to something “shady” (I didn’t tell her about my weight loss surgery so she wouldn’t distract me) and then once followed me and my father and stalked us… but it didn’t occur to me until now that it probably was because she thought I wanted him or we were doing something…&lt;/p&gt;\n\n&lt;p&gt;I told my dad and he’s said nothing… (&lt;em&gt;I think he feels powerless and just wants me to escape&lt;/em&gt;)&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;What does one do in this situation? My dad WONT leave her until I graduate and have a stable job. How do I navigate life until then?&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 159,
  "permalink": "/r/TooAfraidToAsk/comments/ta7rgm/my_mom_is_level_10_abusive_my_dad_didnt_answer/",
  "subreddit": "TooAfraidToAsk",
  "id": "ta7rgm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "(Mind you my mom has/is physically, emotionally, sexually, and psychologically\nabusive)\n\nI recently lost weight and MUCH look more attractive. I wear nicer clothing,\nhair, the whole 9 yards. She always comments on my look, “who are you dressing\nup for?”, giving me the side eye, doesn’t like when I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "(私の母は、肉体的、精神的、性的、そして心理的な問題を抱えています。\n虐待している)\n\n最近、体重を減らし、見た目がとても魅力的になりました。より素敵な服を着ています。\n髪も、全部。彼女はいつも私の外見について、「誰の格好をしてるんだい？\nと横目で見たり、私が...するのが嫌なんです。",
      "title": "私の母はレベル10の虐待をしています。父は「幸せな結婚をしているのか」と聞かれても「はい」と答えませんでした。私が「お父さんとヤリたい」と思っていることを非難しているだけです。これに対して、私や父はどのような対応が適切なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "(提醒你，我妈妈在身体上、情感上、性上和心理上都有/正在受到虐待。\n虐待）。\n\n我最近减肥了，看起来更有吸引力。我穿上了更漂亮的衣服。\n头发，整个9码。她总是评论我的样子，\"你在为谁打扮？\n她总是评论我的外表，\"你为谁而打扮？\"，给我侧目，不喜欢我...。",
      "title": "我妈妈是10级虐待者。我爸爸在被问到他是否有幸福的婚姻时没有回答是。她只是指责我想'干我爸'。我和我父亲对此有什么适当的反应？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "(提醒你，我媽媽在身體上、情感上、性上和心理上都有/正在受到虐待。\n虐待）。\n\n我最近減肥了，看起來更有吸引力。我穿上了更漂亮的衣服。\n頭髮，整個9碼。她總是評論我的樣子，\"你在爲誰打扮？\n她總是評論我的外表，\"你爲誰而打扮？\"，給我側目，不喜歡我...。",
      "title": "我媽媽是10級虐待者。我爸爸在被問到他是否有幸福的婚姻時沒有回答是。她只是指責我想'幹我爸'。我和我父親對此有什麼適當的反應？"
    }
  ]
}