{
  "author": "ducks_09",
  "original_created_utc": 1641184596,
  "title": "The more research I do the more it seems like peoples analysis’s are just confirmation bias.",
  "created_utc": 1641261282,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Pretty new to this space but seeing TAs on places like here, YouTube or Tradingview, just makes me think people are analyzing in a way that supports what they want. Youtube seems like the worst as it is just people with ridiculous thumbnails predicting crypto crash or BTC to $1,000,000! Also, on this sub seems like there is a fair amount of shilling that occurs on altcoins.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Is there any truth to these analysis’s? I feel I should just be investing for the long term and DCA. Let me know if I have the wrong idea about these as i continue to research.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 304,
  "permalink": "/r/CryptoCurrency/comments/rut2f5/the_more_research_i_do_the_more_it_seems_like/",
  "subreddit": "CryptoCurrency",
  "id": "rut2f5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Pretty new to this space but seeing TAs on places like here, YouTube or\nTradingview, just makes me think people are analyzing in a way that supports\nwhat they want. Youtube seems like the worst as it is just people with\nridiculous thumbnails predicting crypto crash or BTC to $1,000,000! Also,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この分野ではかなり新しいですが、ここやYouTube、またはそのような場所でTAを見ること\nTradingviewを見ると、人々はそれをサポートするような方法で分析しているように思います。\nということです。Youtubeは、ただ単に、「この人たちは、こういうことをやっているんだ。\n暗号の暴落やBTCが100万ドルになることを予測する馬鹿げたサムネイル！？また、...",
      "title": "調べれば調べるほど、人々の分析が確証バイアスに過ぎないように思えてくる。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是这个领域的新手，但在这里、YouTube或Tradingview等地方看到TA，只是让我觉得人们在分析时是以支持的方式。\nTradingview，只是让我觉得人们正在以一种支持他们想要的方式进行分析。\n他们想要的东西。Youtube似乎是最糟糕的，因为它只是人们用\n荒谬的缩略图，预测加密货币崩溃或BTC达到100万美元！这是最糟糕的。此外，...",
      "title": "我做的研究越多，就越觉得人们的分析只是确认偏见。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是這個領域的新手，但在這裏、YouTube或Tradingview等地方看到TA，只是讓我覺得人們在分析時是以支持的方式。\nTradingview，只是讓我覺得人們正在以一種支持他們想要的方式進行分析。\n他們想要的東西。Youtube似乎是最糟糕的，因爲它只是人們用\n荒謬的縮略圖，預測加密貨幣崩潰或BTC達到100萬美元！這是最糟糕的。此外，...",
      "title": "我做的研究越多，就越覺得人們的分析只是確認偏見。"
    }
  ]
}