{
  "author": "busterrulezzz",
  "original_created_utc": 1644707234,
  "title": "Be honest: if you had the chance to do a 10x, but with a token that is clearly a cash grab/scam, would you do it?",
  "created_utc": 1644748292,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;After a discussion with a friend, I recently found myself asking a somewhat philosophical question about crypto. I like to think I&amp;#39;m in it for the tech, and I think most of my investments reflect that (I&amp;#39;m pretty much all in on ETH at this point), but of course I&amp;#39;d like to make money. And as everyone knows, the best way to make a quick buck in crypto is to flip sh*tcoins. &lt;/p&gt;\n\n&lt;p&gt;So here&amp;#39;s my question: if I had the chance to make a 10x, but in order to do so I had to buy a token that is clearly a ponzi, would I do it?&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not talking about a project with utility that could fail ; I&amp;#39;m talking about a genuine cash grab.&lt;/p&gt;\n\n&lt;p&gt;On one hand, I wouldn&amp;#39;t feel so good about participating in this kind of operation. It&amp;#39;s the kind of things that gives the entire ecosystem a bad reputation. But on the other hand... This is a free market, and if people want to throw their money at me without DYOR, then that&amp;#39;d be their fault.&lt;/p&gt;\n\n&lt;p&gt;All things considered, I think I would not do it. But I&amp;#39;ve never been tested, so it&amp;#39;s easy for me to say this.&lt;/p&gt;\n\n&lt;p&gt;I was wondering what do you think about this. Would you sleep well doing a 10x knowing other people got scammed? Would you simply refuse to participate?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 312,
  "permalink": "/r/CryptoCurrency/comments/sr3udv/be_honest_if_you_had_the_chance_to_do_a_10x_but/",
  "subreddit": "CryptoCurrency",
  "id": "sr3udv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "After a discussion with a friend, I recently found myself asking a somewhat\nphilosophical question about crypto. I like to think I'm in it for the tech, and\nI think most of my investments reflect that (I'm pretty much all in on ETH at\nthis point), but of course I'd like to make money. And as…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "友人と議論した後、私は最近、ある疑問を抱きました。\n暗号に関する哲学的な質問です。私は技術のために暗号を利用していると考えています。\n私の投資のほとんどはそれを反映していると思います（現在はETHにほぼ全力投球しています）。\nでも、もちろん儲けたい。そして...",
      "title": "正直なところ、もし10倍をするチャンスがあったとして、明らかに現金強奪・詐欺であるトークンを使って、それをやりますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在与一位朋友讨论之后，我最近发现自己问了一个有点像\n关于加密货币的哲学问题。我喜欢认为我是为了技术而加入的，并且\n我认为我的大部分投资都反映了这一点（我现在几乎全部投资于ETH\n但我当然希望能赚钱。而作为...",
      "title": "说实话：如果你有机会做10倍，但用一个明显是抢钱/骗钱的代币，你会做吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在與一位朋友討論之後，我最近發現自己問了一個有點像\n關於加密貨幣的哲學問題。我喜歡認爲我是爲了技術而加入的，並且\n我認爲我的大部分投資都反映了這一點（我現在幾乎全部投資於ETH\n但我當然希望能賺錢。而作爲...",
      "title": "說實話：如果你有機會做10倍，但用一個明顯是搶錢/騙錢的代幣，你會做嗎？"
    }
  ]
}