{
  "author": "StartThings",
  "the_new_excerpt": "Preface to IOTA\n*This is not about price, this is not about investments or trading. This is\nabout a discussion of what really matters and what really matters is the VALUE\nthat is brought and created by those amazing technologies. This is\nWorld-changing, this is bigger than \"your pocket\". We are…",
  "original_created_utc": 1616682123,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "IOTA序言\n*这与价格无关，与投资或交易无关。这是\n关于讨论什么是真正重要的，而真正重要的是VALUE\n是由这些神奇的技术带来和创造的。这就是\n改变世界，这比 \"你的口袋 \"更大。我们是...",
      "title": "更新回顾](MIOTA)IOTA的菊花迁移，它是什么，为什么它很重要。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "IOTA序言\n*這與價格無關，與投資或交易無關。這是\n關於討論什麼是真正重要的，而真正重要的是VALUE\n是由這些神奇的技術帶來和創造的。這就是\n改變世界，這比 \"你的口袋 \"更大。我們是...",
      "title": "更新回顧](MIOTA)IOTA的菊花遷移，它是什麼，爲什麼它很重要。"
    }
  ],
  "title": "[Update review] (MIOTA)IOTA's Chrysalis Migration, what is it, and why it matters.",
  "created_utc": 1616720408,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Preface to IOTA</strong><br/>\n*This is not about price, this is not about investments or trading. This is about a discussion of what really matters and what really matters is the VALUE that is brought and created by those amazing technologies. This is World-changing, this is bigger than &quot;your pocket&quot;. We are living the most exciting times ever and if we just Look  at how awesome we all are and how astonishing are the currently built infrastructure of the future is, we&#39;d be overwhelmed by the perception of technological magic*</p>\n\n<p>To those out of the picture, IOTA much like Nano is a DAG that is effective for quick transactions. IOTA is the leading* crypto IoT solution based on the current size and in accordance with standing up to the standards team. You could say that VeChain is a bigger benefiter IOT but IOTA is made for a variety of IoT solutions which makes it technologically wise the leading IoT.</p>\n\n<p>&quot; In time, IOTA’s goal is to become the de-facto platform for executing transactions between IoT devices.&quot; - This is their goal, a realistic scenario given what they have shown to be until now, and as for *my personal Opinion* the likely truth. With foreseen increased implementation and implications of IoT, this could mean an industry leader of the next stage of the internet  </p>\n\n<p><strong>Introduction to the update: Chrysalis Migration</strong><br/>\n&quot; Over the last year, we have been working to transition the IOTA protocol towards production readiness, taking the real-world needs and requests of our ecosystem into account. We have successfully removed some of the exotic aspects of the IOTA protocol and replaced them with industry standards. The first phase of Chrysalis deployed on the IOTA network in August 2020. We are now in the final phase of the <a href=\"https://blog.iota.org/iota-chrysalis-a-new-dawn/\">biggest upgrade in IOTA’s history</a>. &quot;<br/>\nThe final phase is due 21 of April 2021.</p>\n\n<p>We could look at this update as the fruits of a hard decision the dev made which was to abandon their past, unfit decisions and move forward in accordance with their high goal which they have proven to follow like a thermostat which drew enterprise attention and other developers in.</p>\n\n<p><strong>So what does it all mean?</strong><br/>\nFirst, let&#39;s examine (A portion of) the bullets:<br/>\n*Improved speed to match expected use cases<br/>\n*&quot;White-flag approach&quot; - Abolish conflicts and protect against network attacks. This also serves as a  subbase for enhanced features that enjoy a more inviting environment.<br/>\n*Increase in confirmed TPS and computational efficiency(Speed per transaction is slightly different than an increase in the withholding potential to large traffic and those two issues are addressed separately before they are merged into a new swift and solid network)<br/>\n*Simpler atomic transaction - This improvement means the simplifaction of the atomic transaction increasing the efficiency of the procedures that are crucial and fundamental in a reliable exchange of information/value.</p>\n\n<p>*&quot;Internal Binary Representation&quot; - Simply put, instead of dealing with a heavier form of transaction to validate a binary value (True/False thus on/off, yes/no, done/undone... etc) there is a smart quicker mechanism that allows binary transactions(Which may be very common with IoT devices noting about their flags) which drastically reduces network bandwidth and processing time</p>\n\n<p>*Improved API for developers and client libraries - Being already very attractive to developers the IOTA team further improved their cooperative productivity to invite new developers and make the current accelerate the already rather quick advancement pace. In addition to client libraries which means easier integration into other projects.</p>\n\n<p>This is the largest step of the IOTA development so far, being so far proven at the testnet level and implying the blooming of a minimum viable product for real-world implementation.<br/>\nThis update is an intermediate stage to the next biggest step of the project known as &quot;Coordicide&quot; which basically takes the Chrysalis Migration to the next level improving all aspects of the network.<br/>\nThe Chrysalis Migration is meant to provide the many clients and internal developers to have a ready-to-go application for the Coordicide stage and a smooth transaction. So the upcoming migration signals both the meeting of the roadmap targets and an express route to Coordicide.<br/>\n Coordinate means ready-to-go smart cities solutions, smart mobility, Electronic health care, digital identification, trade and supply chains, and of course the bottomless hole of possible IoT products.</p>\n\n<p>The above text might seem a little boring, but if we just take a moment to perceive as children with the awareness of an adult we&#39;d see a new world emerging under our nose. A new more abundant world for everyone. A new exciting world that gives faith in humanity and shows us how far we&#39;ve come. This is ASTRONOMICALLY more interesting than &quot;Dip this dip that, brrr here brrr there. Lambo, Bambo&quot;<br/>\nFor a moment forget about all the noise and nonsense around and see the real substance which is that History is being made. We&#39;d still learn and teach about the wars they brought us down, but all of those &quot;cool&quot; history incidents are far less impressive than what is going on right here, right now. What your grandparents/parents felt about how the world have changed in the light of the smartphone revolution is but a glimpse of how much we(The so-called &quot;technologic&quot; generations) are going to be thrown off guard when we meat the beautiful future being created. A point will come when the realization falls on all of us and even with a telescope we wouldn&#39;t manage to see how far we have come.</p>\n\n<p>I hope this was interesting! I really hope this sub will be more informational, summarising and informing of the always coming exciting changes and news. I hope the discussion here grows to be more from a user/developer point of view. You know... actually talk about crypto. Thank you for your time.</p>\n</div><!-- SC_ON -->",
  "score": 217,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/86Pe14DVqF-aUgMJu6-Y7iqbKTpSp8nTRySwzZQ2KNA.jpg?auto=webp&s=87a0bfd4901c71d74f751bd4eafad2514f492df4",
          "width": 2000,
          "height": 900
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/86Pe14DVqF-aUgMJu6-Y7iqbKTpSp8nTRySwzZQ2KNA.jpg?width=108&crop=smart&auto=webp&s=333d8bf2205788a140ff6ff89f599168cd6b9c99",
            "width": 108,
            "height": 48
          },
          {
            "url": "https://external-preview.redd.it/86Pe14DVqF-aUgMJu6-Y7iqbKTpSp8nTRySwzZQ2KNA.jpg?width=216&crop=smart&auto=webp&s=972c0361dd96c7d1043efb5ea1e37adde37b8826",
            "width": 216,
            "height": 97
          },
          {
            "url": "https://external-preview.redd.it/86Pe14DVqF-aUgMJu6-Y7iqbKTpSp8nTRySwzZQ2KNA.jpg?width=320&crop=smart&auto=webp&s=407be51c9ea9543cfec3da75e5034dfc0c97b398",
            "width": 320,
            "height": 144
          },
          {
            "url": "https://external-preview.redd.it/86Pe14DVqF-aUgMJu6-Y7iqbKTpSp8nTRySwzZQ2KNA.jpg?width=640&crop=smart&auto=webp&s=b37876c4c2f4bc087b123a94d6ce3ca263d6c05b",
            "width": 640,
            "height": 288
          },
          {
            "url": "https://external-preview.redd.it/86Pe14DVqF-aUgMJu6-Y7iqbKTpSp8nTRySwzZQ2KNA.jpg?width=960&crop=smart&auto=webp&s=076b5db1ca33394c3502ed55a13039403e5b843d",
            "width": 960,
            "height": 432
          },
          {
            "url": "https://external-preview.redd.it/86Pe14DVqF-aUgMJu6-Y7iqbKTpSp8nTRySwzZQ2KNA.jpg?width=1080&crop=smart&auto=webp&s=b9deac77188b3ab2b07181ad13abc86181964b2e",
            "width": 1080,
            "height": 486
          }
        ],
        "variants": {},
        "id": "1udRa4h1vZLNkQU8D1dua22fHUWAx754LoSnQz-kSlY"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/mczdl3/update_review_miotaiotas_chrysalis_migration_what/",
  "subreddit": "CryptoCurrency",
  "id": "mczdl3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357135574
}