{
  "author": "Georgy_K_Zhukov",
  "the_new_excerpt": "2020 is in the rear view mirror, and I think few are sad to see it go, but the\nyear wasn't a total wash! We saw hundreds upon hundreds of amazing answers\nwritten on the subreddit, not to mention the multitude of insightful questions\nasked. All of them are worthy of recognition, as it is the…",
  "original_created_utc": 1610719226,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "2020年已是后知后觉，我想很少有人对它的离去感到惋惜，但。\n这一年并不是一帆风顺的！我们看到了数以百计的惊人答案。我们看到了数以百计的惊人答案\n写在subreddit上，更不用说众多有见地的问题了。\n问。都是值得肯定的，因为这是...",
      "title": "他们来了，\"AskHistorians 2020 \"大赛的获奖者们!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "2020年已是後知後覺，我想很少有人對它的離去感到惋惜，但。\n這一年並不是一帆風順的！我們看到了數以百計的驚人答案。我們看到了數以百計的驚人答案\n寫在subreddit上，更不用說衆多有見地的問題了。\n問。都是值得肯定的，因爲這是...",
      "title": "他們來了，\"AskHistorians 2020 \"大賽的獲獎者們!"
    }
  ],
  "title": "Here They Are, The Winners of the 'Best of AskHistorians 2020' Contest!",
  "created_utc": 1610726330,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>2020 is in the rear view mirror, and I think few are sad to see it go, but the year wasn&#39;t a total wash! We saw hundreds upon hundreds of amazing answers written on the subreddit, not to mention the multitude of insightful questions asked. All of them are worthy of recognition, as it is the collective contributions of everyone, from the most overactive flairs to the quietest of lurkers, who make this community the amazing place that it is, but nevertheless it is always a pleasant way to cap off each year by showing a little extra recognition to a few of them with our yearly contest.</p>\n\n<p>As always, the winners receive some snazzy AskHistorians swag, joining the exclusive <a href=\"https://preview.redd.it/kerxlv59zja41.jpg?width=750&amp;format=pjpg&amp;auto=webp&amp;s=4ab3c90fee48a1d9cd252c4033b61d6f6650f6c1\">AskHistorians Mug Club</a>, and <em>everyone</em> nominated for an award is also going to get some limited edition [Removed] stickers!</p>\n\n<p>But enough of my babbling. It was, as always, <a href=\"https://www.reddit.com/r/AskHistorians/comments/kuf4vg/2020_is_a_wrap_please_take_a_moment_to_vote_for/\">an amazing field of candidates to narrow down</a> from, and without further ado, I present you the 2020 Awardees!</p>\n\n<p><strong>Users&#39; Choice Award:</strong> Voted on by the subreddit as a whole.</p>\n\n<ul>\n<li><strong>1st Place:</strong> <a href=\"/u/BullsLawDan\">/u/BullsLawDan</a> for the answer to <a href=\"https://www.reddit.com/r/AskHistorians/comments/ggozng/in_the_sitcom_married_with_children_protagonist/?utm_source=amp&amp;utm_medium=&amp;utm_content=post_title\">“In the sitcom Married... with Children, protagonist Al Bundy is able to support himself, his homemaker wife, and two children on the income he earns as a shoe salesman in a strip mall in the suburbs of Chicago. Was this at all realistic for the late 1980s/early 1990s?”</a></li>\n<li><strong>2nd Place:</strong> <a href=\"/u/thefeckamIdoing\">/u/thefeckamIdoing</a> for the answer to <a href=\"https://www.reddit.com/r/AskHistorians/comments/eowc5o/can_someone_explain_the_troubles_to_me/few87c1/\">&quot;Can someone explain the Troubles to me?&quot;</a></li>\n<li><strong>3rd Place:</strong> <a href=\"/u/undercoverclassicist\">/u/undercoverclassicist</a> for the answer to <a href=\"https://www.reddit.com/r/AskHistorians/comments/gu1tj5/did_people_realize_they_were_part_of_a/ftb9pet/?context=3\">&quot;Did people realize they were part of a civilizational collapse during the bronze age collapse?&quot;</a></li>\n<li><strong>Dark Horse Award:</strong> <a href=\"/u/yourlocaltitanicguy\">/u/yourlocaltitanicguy</a> for the answer to <a href=\"https://www.reddit.com/r/AskHistorians/comments/ki70q7/until_the_wreck_was_found_it_was_uncertain_if_the/ggqqrpb/?context=3\">&quot;Until the wreck was found, it was uncertain if the Titanic went down in one piece or split into two. What did the splitting look and sound like to eyewitnesses and why was it uncertain it really happened?&quot;</a></li>\n</ul>\n\n<p><strong>Flairs&#39; Choice Award:</strong> Voted on exclusively by the Flaired User community.</p>\n\n<ul>\n<li><strong>1st Place:</strong> <a href=\"/u/coeurdelionne\">/u/coeurdelionne</a> and <a href=\"/u/J-Force\">/u/J-Force</a> share a <em>double</em> award for their collective contributions to <a href=\"https://www.reddit.com/r/AskHistorians/comments/i08fzf/how_did_richard_i_come_to_be_so_fondly_lionized/\">&quot;How did Richard I come to be so fondly lionized in British cultural memory given how marginal of a King he seems to have actually been?&quot;</a>, combining to offer some excellent dueling perspectives on the question.</li>\n<li><strong>2nd Place:</strong> <a href=\"/u/asinus_docent\">/u/asinus_docent</a> for the answer to <a href=\"https://www.reddit.com/r/AskHistorians/comments/gr6j3b/richard_ii_revoked_londons_charter_and_the_city/frxbfpg/?context=3\">&quot;Richard II revoked London&#39;s charter and the city tried to convince him to give it back with a big party. What was Richard&#39;s beef with London and how did the feasting and merrymaking work out as a political strategy?&quot;</a></li>\n<li><strong>3rd Place:</strong> <a href=\"/u/KiwiHellenist\">/u/KiwiHellenist</a> for the answer to <a href=\"https://www.reddit.com/r/AskHistorians/comments/jl08ko/over_1000_manuscripts_of_iliad_exists_which_is/gancsv6/?context=3\">&quot;Over 1000 manuscripts of Iliad exists which is more than of any other ancient works. How close are these manuscripts to each other, are there significant differences? Which are considered &quot;canon&quot;?&quot;</a></li>\n<li><strong>Dark Horse Award:</strong> <a href=\"/u/funkyedwardgibbon\">/u/funkyedwardgibbon</a> for the answer to <a href=\"https://www.reddit.com/r/AskHistorians/comments/fkaa59/why_isnt_new_zealand_a_part_of_australia/fkskoca/\">&quot;Why isn’t New Zealand a part of Australia?&quot;</a></li>\n</ul>\n\n<p><strong>Greatest Question:</strong> Chosen in a vote by the Moderators of the subreddit.</p>\n\n<ul>\n<li><strong>1st Place:</strong> <a href=\"https://www.reddit.com/r/AskHistorians/comments/ifvv73/how_accurate_is_monty_pythons_anarchosyndicalist/\">How accurate is Monty Python&#39;s &#39;Anarcho-Syndicalist Peasant&#39; scene? Were small medieval villages de-facto self governing and autonomous from their noble lord and wider nation?</a>, asked by <a href=\"/u/wifi-knight\">/u/wifi-knight</a>, with answer by <a href=\"/u/mikedash\">/u/mikedash</a>.</li>\n<li><strong>2nd Place:</strong> <a href=\"https://www.reddit.com/r/AskHistorians/comments/k2ob9w/how_did_deaf_people_react_to_the_introduction_of/\">How did deaf people react to the introduction of sound in motion pictures?</a>, asked by <a href=\"/u/Klesk_vs_Xaero\">/u/Klesk_vs_Xaero</a>, with answer by <a href=\"/u/woofiegrrl\">/u/woofiegrrl</a></li>\n<li><strong>3rd Place:</strong> <a href=\"https://www.reddit.com/r/AskHistorians/comments/etdmj9/im_an_african_man_who_was_invited_to_go_to_school/\">I&#39;m an African man who was invited to go to school in the Soviet Union. What&#39;s my daily life like? How am I treated? Am I touted around like a piece of propaganda?</a>, asked by <a href=\"/u/J2quared\">/u/J2quared</a>. <del><em>So far</em> unanswered.</del> <a href=\"https://www.reddit.com/r/AskHistorians/comments/kxzsez/im_an_african_man_who_was_invited_to_go_to_school/\">Re-asked today! Check it out!</a></li>\n</ul>\n\n<p><strong>Excellence in Flair:</strong> Finally, one more award needs to be handed out. My original draft for this was going to mention a conspicuous absence, but of course, in the final voting, <a href=\"/u/mikedash\">/u/mikedash</a> nevertheless made an appearance for his fantastic answer to our &#39;GQ&#39; winner, which in the end is why we&#39;re singling him out. After winning one of the yearly awards three times running and amassing, quite literally, an AskHistorians tea-set, the mod team decided to use a massive abuse of our power this year and exclude him from the year end voting, and instead highlight him for higher honors as the winner of our year end <strong>Excellence in Flair</strong> award, which is something we give out to recognize not merely good answers, but exceptional contributions to the AskHistorians community. Mike&#39;s breadth of knowledge is surpassed by few here, nor is his talent for the engaging and insightful way in which he communicates it.  So on behalf of the Mod team, and the community as a whole, thank you so very much, Mike, for all you do to make this such an incredible place.</p>\n\n<p>Once again, a warm congratulations to all the winners, and a thank you to <em>everyone</em> who worked over the past year to contribute in their own way to this community.</p>\n</div><!-- SC_ON -->",
  "score": 2914,
  "permalink": "/r/AskHistorians/comments/kxv2ig/here_they_are_the_winners_of_the_best_of/",
  "subreddit": "AskHistorians",
  "id": "kxv2ig",
  "is_self": true,
  "media": null,
  "is_video": false
}