{
  "author": "Iiau_",
  "the_new_excerpt": "I'll be honest, when I was a beginner, I believed all the wild claims and \"must\nbuy 100x moonshots\", until I found this sub.\n\nNow I look at all these videos and feel intense scorn for them. Especially\nbitboy crypto, who is making wild fucking claims like \"btc drop to 17k\",\n\"cheapest altcoins to make…",
  "original_created_utc": 1616593354,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "说实话，当我还是个初学者的时候，我相信所有的狂妄的说法和 \"一定要\n买100倍的月饼\"，直到我找到这个子。\n\n现在我看着这些视频，对它们感到强烈的鄙视。尤其是\nbitboy crypto，谁在做疯狂的他妈的说法，如 \"btc降到17k\"。\n\"最便宜的altcoins，让...",
      "title": "致Bitboy加密和相关的YouTube点赞者：去你妈的，为了赚快钱而玩弄加密初学者。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "說實話，當我還是個初學者的時候，我相信所有的狂妄的說法和 \"一定要\n買100倍的月餅\"，直到我找到這個子。\n\n現在我看着這些視頻，對它們感到強烈的鄙視。尤其是\nbitboy crypto，誰在做瘋狂的他媽的說法，如 \"btc降到17k\"。\n\"最便宜的altcoins，讓...",
      "title": "致Bitboy加密和相關的YouTube點贊者：去你媽的，爲了賺快錢而玩弄加密初學者。"
    }
  ],
  "title": "To Bitboy crypto and related YouTube clickbaiters: f*ck you for toying with crypto beginners to make a quick buck.",
  "created_utc": 1616612315,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ll be honest, when I was a beginner, I believed all the wild claims and &quot;must buy 100x moonshots&quot;, until I found this sub.</p>\n\n<p>Now I look at all these videos and feel intense scorn for them. Especially bitboy crypto, who is making wild fucking claims like &quot;btc drop to 17k&quot;, &quot;cheapest altcoins to make you rich&quot;, &quot;insane breakout to $300k&quot;. Thank god everyone in this sub says no one knows anything, I immediately got the message and massive FUD came in.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/1kcm5f6ybzo61.png?width=1143&amp;format=png&amp;auto=webp&amp;s=45b7c1f8d36286386f37d2a6c62022785db25881\">https://preview.redd.it/1kcm5f6ybzo61.png?width=1143&amp;format=png&amp;auto=webp&amp;s=45b7c1f8d36286386f37d2a6c62022785db25881</a></p>\n\n<p>Literally, the two popular uploads in the same fucking page is &quot;ETH to 0&quot; and &quot;Ethereum: Your Best Chance To Be A Millionaire in 2021&quot;.</p>\n\n<p>I know this sub has been talking about this a ton, a few top page posts saying what an unreliable source these guys are. But this guy yet continues to be racking up millions of views for pump and dumps on shitcoins he promotes and makes a fortune from manipulating the market from it, and clickbait videos on the youtube platform, and still have people revere him like some kind of god; we have to keep regularly exposing this guy and other Youtubers and drive them out of business. We will win the fight.</p>\n</div><!-- SC_ON -->",
  "score": 7684,
  "permalink": "/r/CryptoCurrency/comments/mc60c0/to_bitboy_crypto_and_related_youtube_clickbaiters/",
  "subreddit": "CryptoCurrency",
  "id": "mc60c0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752818305
}