{
  "author": "RichmondRay",
  "original_created_utc": 1639065782,
  "title": "I heard an expert suggest that the Battle of Trafalgar was not of great military significance in the Napoleonic Wars. How accurate is this?",
  "created_utc": 1639099960,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I was listening &lt;a href=\"https://www.bbc.co.uk/sounds/play/m0012141\"&gt;to an episode of the BBC Radio 4 show &amp;quot;In Our Time,&amp;quot;&lt;/a&gt; and I heard this from James Davey, a lecturer on naval and maritime history. He&amp;#39;s comparing the reaction to the victory from the British public (sorrow over Nelson&amp;#39;s death, displays of patriotism) with the government&amp;#39;s (cynicism), and he says this:&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I think the (British) government knows full well that Trafalgar has done very little to shape the course of the war. As reports come back, as Vice-Admiral Collingwood&amp;#39;s dispatches arrive, it&amp;#39;s pretty clear that whilst Britain has captured and sunk a number of enemy ships, a lot have escaped. And of course the admiralty and the British government would have known that there were plenty of other French fleets stationed around Europe.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;This surprised me, as it contradicts my own conception of Trafalgar as a major turning point not only in the Napoleonic Wars, but also in world history. Is my impression the result of a successful British propaganda campaign around Trafalgar? Was it really not that materially consequential?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/rckpo7/i_heard_an_expert_suggest_that_the_battle_of/",
  "subreddit": "AskHistorians",
  "id": "rckpo7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was listening to an episode of the BBC Radio 4 show \"In Our Time,\"\n[https://www.bbc.co.uk/sounds/play/m0012141] and I heard this from James Davey,\na lecturer on naval and maritime history. He's comparing the reaction to the\nvictory from the British public (sorrow over Nelson's death, displays…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "BBCラジオ4の番組 \"In Our Time \"のエピソードを聴いていました。\n[https://www.bbc.co.uk/sounds/play/m0012141]そして、ジェームス・デイヴィーからこんな話を聞きました。\n海軍と海事史の講師。彼は\nイギリス国民の勝利（ネルソンの死に対する悲しみ、ディスプレイ......）。",
      "title": "ある専門家が、ナポレオン戦争においてトラファルガーの戦いは軍事的に大きな意味を持たなかったと言っているのを聞きました。これはどの程度正確なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在听英国广播公司第四台的一集节目 \"在我们的时代\"。\n[https://www.bbc.co.uk/sounds/play/m0012141]我听到了詹姆斯-戴维的这段话。\n他是一位海军和海洋历史的讲师。他比较了英国公众对胜利的反应\n他比较了英国公众对胜利的反应（对纳尔逊之死的悲痛，显示...",
      "title": "我听到一位专家建议，特拉法尔加战役在拿破仑战争中并不具有重大的军事意义。这有多准确呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在聽英國廣播公司第四臺的一集節目 \"在我們的時代\"。\n[https://www.bbc.co.uk/sounds/play/m0012141]我聽到了詹姆斯-戴維的這段話。\n他是一位海軍和海洋歷史的講師。他比較了英國公衆對勝利的反應\n他比較了英國公衆對勝利的反應（對納爾遜之死的悲痛，顯示...",
      "title": "我聽到一位專家建議，特拉法爾加戰役在拿破崙戰爭中並不具有重大的軍事意義。這有多準確呢？"
    }
  ]
}