{
  "author": "Neuvalent",
  "original_created_utc": 1641715543,
  "title": "Crypto has a major problem, and that's poor user experience design",
  "created_utc": 1641745995,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I see great potential in crypto to be the next paradigm shift that transforms the global economy. Though, as a UI Designer and UX Researcher, most crypto products make no sense to the average user—they&amp;#39;re complex, cumbersome, and require a ton of focused knowledge to not lose money.&lt;/p&gt;\n\n&lt;p&gt;Many of my colleagues, friends and others alike have told me they&amp;#39;ve tried a ton of different apps to get into crypto and it&amp;#39;s been difficult. The apps ask for a lot of info, there&amp;#39;s a ton of charts, random numbers, obscure percentages, plenty of colorful logos... Even though I know exactly what they&amp;#39;re referring to, it&amp;#39;s overwhelming for them to hear me explain the fundamentals of private keys, public keys, liquidity pools, volatility, yield, hodling, DeFi, staking, gas fees, minting, tokens—among many others. We simply cannot expect wide-scale adoption for even one billion people if they need to know what all these mean.&lt;/p&gt;\n\n&lt;p&gt;Product designers in crypto have done a good job at translating the needs of the software engineers and the needs of their respective organizations, but only a few companies have focused on effortless user-friendly experiences. Some have come close ((which I do applaud them!)), but compare the design of popular crypto apps to that of popular apps in other categories; eg. Instagram, Twitter, YouTube, Messenger. These companies have honed their experience design to accommodate all types of people globally (regardless of their differences). Those who have no knowledge of how a story works, or how a message is sent, or how to find an album, can easily hop on to these apps and figure it out in seconds. This experience design has developed so strongly over the years that they&amp;#39;ve found ways to keep user&amp;#39;s eyes glued to their screens for hours on end. Some design aspects even become part of popular culture, like Tinder&amp;#39;s swipe left or swipe right.&lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;re currently at peak &amp;#39;hype&amp;#39; levels with Web3 and DeFi. Even though I love the idea of it taking over, I don&amp;#39;t believe it&amp;#39;s ready for the scale we want it to be. We&amp;#39;re going to need top-tier design strategies. Do consider that there are still people in the present day that struggle to do basic tasks on their computer or phone—and I&amp;#39;m pretty sure we&amp;#39;ve all met plenty before—we need to design for people like this in mind. I&amp;#39;m an Android guy personally, but Apple has done exceptionally well in product design that flows throughout its ecosystem of apps and devices. It&amp;#39;s straightforward and gets the job done. Yes there are questionable hiccups here and there, but for the most part, it&amp;#39;s pretty seamless and it works for the masses. These are models we should follow.&lt;/p&gt;\n\n&lt;p&gt;Good design is beautiful but &lt;em&gt;great&lt;/em&gt; design is invisible.\nThe moment a person has to pause &amp;amp; search up how to do something in an app, that immediately decreases their interest &amp;amp; their long-term retention. Invisible design shows that a user can get their tasks done without having to focus in on individual elements.&lt;/p&gt;\n\n&lt;p&gt;Essentially, I want to get to the point where I can suggest a friend, colleague or a family member a crypto app and I don&amp;#39;t have to explain anything to them, they&amp;#39;ll be able to figure everything out within minutes after downloading. &lt;/p&gt;\n\n&lt;h2&gt;&lt;/h2&gt;\n\n&lt;p&gt;And for the note I like the simplified approach of Strike. It&amp;#39;s visually bland but it succeeds its goal. It&amp;#39;s had extreme success in El Salvador, where less fortunate communities use Bitcoin for daily transactions. Truly an app where no special prior knowledge is needed. &lt;/p&gt;\n\n&lt;h2&gt;&lt;/h2&gt;\n\n&lt;p&gt;Open to your thoughts, please let me know if there&amp;#39;s anything I missed or touched on in an odd way.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 327,
  "permalink": "/r/CryptoCurrency/comments/rzmssf/crypto_has_a_major_problem_and_thats_poor_user/",
  "subreddit": "CryptoCurrency",
  "id": "rzmssf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I see great potential in crypto to be the next paradigm shift that transforms\nthe global economy. Though, as a UI Designer and UX Researcher, most crypto\nproducts make no sense to the average user—they're complex, cumbersome, and\nrequire a ton of focused knowledge to not lose money.\n\nMany of my…"
}