{
  "author": "StillWantTheCabin",
  "original_created_utc": 1649730169,
  "title": "My kid correctly told his teacher that his dad yells a lot, should I reach out to her?",
  "created_utc": 1649761670,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My child and I are not in danger. My husband gets unreasonably loud when upset or frustrated and it&amp;#39;s not fun. I try to protect my son, who is smart, sensitive, and very observant. My husband is actively trying to be more patient and less yelly. I&amp;#39;m not looking for judgment on my marriage. &lt;/p&gt;\n\n&lt;p&gt;So, my kiddo&amp;#39;s kindergarten class did a project on being brave. My son told his teacher that his dad yells and it&amp;#39;s scary, but the teacher helped my son write out his answer in a much more neutral way.  I found out what was said by talking to him about his answer. The truth is, he&amp;#39;s right. But he&amp;#39;s also safe.&lt;/p&gt;\n\n&lt;p&gt;Should I reach out to the teacher and let her know I spoke to my son about this, and I&amp;#39;m addressing the situation? Or does that make it sound like I&amp;#39;m getting defensive and she should call CPS? This teacher is amazing, passionate, and loves her students deeply - I don&amp;#39;t want her worrying. I&amp;#39;m embarrassed and worried, but I&amp;#39;m planning to talk to my husband about this as soon as possible. It&amp;#39;s going to kill him.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/u1obe9/my_kid_correctly_told_his_teacher_that_his_dad/",
  "subreddit": "TooAfraidToAsk",
  "id": "u1obe9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "My child and I are not in danger. My husband gets unreasonably loud when upset\nor frustrated and it's not fun. I try to protect my son, who is smart,\nsensitive, and very observant. My husband is actively trying to be more patient\nand less yelly. I'm not looking for judgment on my marriage.\n\nSo, my…"
}