{
  "author": "StillWantTheCabin",
  "original_created_utc": 1649730169,
  "title": "My kid correctly told his teacher that his dad yells a lot, should I reach out to her?",
  "created_utc": 1649761670,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My child and I are not in danger. My husband gets unreasonably loud when upset or frustrated and it&amp;#39;s not fun. I try to protect my son, who is smart, sensitive, and very observant. My husband is actively trying to be more patient and less yelly. I&amp;#39;m not looking for judgment on my marriage. &lt;/p&gt;\n\n&lt;p&gt;So, my kiddo&amp;#39;s kindergarten class did a project on being brave. My son told his teacher that his dad yells and it&amp;#39;s scary, but the teacher helped my son write out his answer in a much more neutral way.  I found out what was said by talking to him about his answer. The truth is, he&amp;#39;s right. But he&amp;#39;s also safe.&lt;/p&gt;\n\n&lt;p&gt;Should I reach out to the teacher and let her know I spoke to my son about this, and I&amp;#39;m addressing the situation? Or does that make it sound like I&amp;#39;m getting defensive and she should call CPS? This teacher is amazing, passionate, and loves her students deeply - I don&amp;#39;t want her worrying. I&amp;#39;m embarrassed and worried, but I&amp;#39;m planning to talk to my husband about this as soon as possible. It&amp;#39;s going to kill him.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/u1obe9/my_kid_correctly_told_his_teacher_that_his_dad/",
  "subreddit": "TooAfraidToAsk",
  "id": "u1obe9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "My child and I are not in danger. My husband gets unreasonably loud when upset\nor frustrated and it's not fun. I try to protect my son, who is smart,\nsensitive, and very observant. My husband is actively trying to be more patient\nand less yelly. I'm not looking for judgment on my marriage.\n\nSo, my…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "子供と私に危険はない。夫は怒ると理不尽なほど大声を出す\nとか、イライラして面白くない。頭のいい息子を守りたい。\n観察力が鋭く、繊細である。夫はもっと我慢するよう積極的に努力しています。\nと怒らない。私は自分の結婚に判断を求めているわけではありません。\n\nだから、私の...",
      "title": "子供が先生に「お父さんはよく怒鳴る」と正しく伝えているのですが、手を差し伸べるべきでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的孩子和我都没有危险。我的丈夫在生气或沮丧时，会无理地大声喧哗\n或沮丧时，就会无理地大喊大叫，这很不好玩。我试图保护我的儿子，他很聪明。\n敏感，而且观察力很强。我的丈夫正在积极努力，使自己更有耐心\n而不那么好说话。我不希望别人对我的婚姻进行评判。\n\n所以，我的...",
      "title": "我的孩子正确地告诉他的老师，他的爸爸经常大喊大叫，我应该联系她吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的孩子和我都沒有危險。我的丈夫在生氣或沮喪時，會無理地大聲喧譁\n或沮喪時，就會無理地大喊大叫，這很不好玩。我試圖保護我的兒子，他很聰明。\n敏感，而且觀察力很強。我的丈夫正在積極努力，使自己更有耐心\n而不那麼好說話。我不希望別人對我的婚姻進行評判。\n\n所以，我的...",
      "title": "我的孩子正確地告訴他的老師，他的爸爸經常大喊大叫，我應該聯繫她嗎？"
    }
  ]
}