{
  "author": "imdurian",
  "the_new_excerpt": "Hey guys, yesterday Branson's SPAC (trading as $VGAC) announced their deal with\n23andme.\n\n23andme is a consumer DNA-testing company. They were founded in 2006 and seems\nto have a huge market share for d2c DNA testing.\n\nGoing into the future, I believe that many people will definitely have their…",
  "original_created_utc": 1612533524,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "嘿，昨天，布兰森的SPAC（交易代码为$VGAC）宣布他们的交易与\n23andme。\n\n23andme是一家消费者DNA检测公司。他们成立于2006年，似乎\n来拥有巨大的d2c DNA检测市场份额。\n\n进入未来，相信很多人一定会有自己的...",
      "title": "为什么你应该关注VGAC/23andme（DNA检测）的合并？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嘿，昨天，布蘭森的SPAC（交易代碼爲$VGAC）宣佈他們的交易與\n23andme。\n\n23andme是一家消費者DNA檢測公司。他們成立於2006年，似乎\n來擁有巨大的d2c DNA檢測市場份額。\n\n進入未來，相信很多人一定會有自己的...",
      "title": "爲什麼你應該關注VGAC/23andme（DNA檢測）的合併？"
    }
  ],
  "title": "Why you should be watching the VGAC/23andme (DNA testing) merger",
  "created_utc": 1612568517,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey guys, yesterday Branson&#39;s SPAC (trading as $VGAC) announced their deal with 23andme.</p>\n\n<p><strong>23andme is a consumer DNA-testing company. They were founded in 2006 and seems to have a huge market share for d2c DNA testing.</strong></p>\n\n<p>Going into the future, I believe that many people will definitely have their DNA sequenced. This is not a fad or a gimmick. Sure, some people might buy a DNA test for novelty purposes to find out their ancestry, but by sequencing your DNA, you would be able to identify a HUGE array of potential health issues. Wanna have a kid? You&#39;d want to know what potential diseases you may pass on. Cancer risk? You can find your risk factor early and keep tabs on it. I am almost certain that doctors will soon recommend this as a standard health practice.</p>\n\n<p>Now on to the quick financials: the merger deal puts the company at a $3.5bn valuation and they&#39;d end up with <strong>$900m in cash.</strong></p>\n\n<p><strong>That&#39;s a cash ratio of just over 3:1. If that isn&#39;t insane value, you tell me what is.</strong></p>\n\n<p>&#x200B;</p>\n\n<p>It is also worth noting the following:</p>\n\n<p>They recently entered into a deal with GlaxoSmithKlein for drug development using the gene data from the 10 MILLION users they currently have</p>\n\n<ul>\n<li>Their app is apparently quite nice to use and miles ahead of the competition. I could envision that in the near future when you open the app you would be able to buy tailor-made supplements to improve your health, specific to your genetics</li>\n<li>They&#39;d also be able to use your gene data for specific diseases to develop drugs to treat them. H U G E</li>\n<li>Predictive abilities will improve as their dataset grows. Eg. they have a tool that tells you whether you would get severe symptoms in the event that you do catch COVID-19. This tech will improve and become a necessity to a modern healthcare plan</li>\n<li>Usually IPOs are first offered to institutional investors, by the time it hits the market, normal retail investors like you and me end up paying the highest prices for the shares. But with a SPAC like $VGAC, we&#39;re getting in on the ground level.</li>\n<li>&#x200B;</li>\n</ul>\n\n<p><strong>I can see this doubling or tripling in value in the near future just based off of how cheap the prices are right now.</strong></p>\n\n<p>Other biotech stocks typically trade at 30-40 PE ratio. If we use that multiple on their $220M current revenue, the company would be worth between $6.6bn - $8.8bn....</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>Disclaimer: Not financial advice, I just like the stock. Hold 4700 shares</p>\n</div><!-- SC_ON -->",
  "score": 60,
  "permalink": "/r/investing/comments/ld7ni6/why_you_should_be_watching_the_vgac23andme_dna/",
  "subreddit": "investing",
  "id": "ld7ni6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123198813
}