{
  "author": "dende5416",
  "original_created_utc": 1660345799,
  "title": "Did \"survivors\" of the Hawaiian Royal Family have a separate response to the bombing of Pearl Harbor?",
  "created_utc": 1660392479,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In the late 1800&amp;#39;s, the monarchy of Liliʻuokalani was overthrown leading ultimately to the Annexation of Hawaii by the United States of America. Within 50 years of the overthrow of the monarchy and annexation of Hawaii, the bombing of Pearl Harbor and the entry of the United States of America into World War 2 happened. I know from some other reading that members of the Royal family bother survived the Annexation and, in fact, are still alive today. Did any members of the Royal Family have any type of official response to the bombing or the US joining the War in general? How did native Hawaiians respond to the bombing?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/wmyujw/did_survivors_of_the_hawaiian_royal_family_have_a/",
  "subreddit": "AskHistorians",
  "id": "wmyujw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In the late 1800's, the monarchy of Liliʻuokalani was overthrown leading\nultimately to the Annexation of Hawaii by the United States of America. Within\n50 years of the overthrow of the monarchy and annexation of Hawaii, the bombing\nof Pearl Harbor and the entry of the United States of America into…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1800年代後半、リリウオカラニの君主制が崩壊し、その結果、「ヴォルデモート」が誕生しました。\nアメリカ合衆国のハワイ併合につながりました。その後\n王政が崩壊し、ハワイが併合されてから50年の間に、真珠湾攻撃とアメリカ合衆国の参戦がありました。\n真珠湾攻撃、そしてアメリカ合衆国への参戦......。",
      "title": "ハワイ王室の「生き残り」たちは、真珠湾攻撃への対応を別に考えていたのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "19世纪末，利利乌卡拉尼的君主制被推翻，导致了\n最终导致了美国对夏威夷的吞并。在\n在君主制被推翻和夏威夷被吞并后的50年内，轰炸了\n珍珠港的轰炸和美利坚合众国进入夏威夷。",
      "title": "夏威夷皇室的 \"幸存者 \"对珍珠港的轰炸有单独的反应吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "19世紀末，利利烏卡拉尼的君主制被推翻，導致了\n最終導致了美國對夏威夷的吞併。在\n在君主制被推翻和夏威夷被吞併後的50年內，轟炸了\n珍珠港的轟炸和美利堅合衆國進入夏威夷。",
      "title": "夏威夷皇室的 \"倖存者 \"對珍珠港的轟炸有單獨的反應嗎？"
    }
  ]
}