{
  "author": "Inevitable-Tomato-81",
  "original_created_utc": 1628944799,
  "title": "Why do so many people on Reddit enjoy kicking people when they’re down?",
  "created_utc": 1628960584,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Honestly, I’ve seen this so many times. I’ve seen people post about suffering with depression or struggling with a situation and there’s always a douchbag in the comments saying it’s al OPs fault and they don’t try at all to help themselves. Yesterday, in a sub I posted about haing not talked to my best friend in almost two months and how it’s making me fall apart and multiple people told me it’s probably all my fault and my friend probably had been holding resentment for a while. Keep in mind, I hadn’t even explained the whole situation. So, of course I’ve just been an anxious mess the whole night. I also remember posting on specific sub about feeling insecure and some guy said I’m attention seeking and how “girls like you piss me off, thinking you deserve the world” (dont know where that came from). It just seems pathetic to go on someone’s post and make them feel bad when it’s obvious they’re already in a pit.</p>\n</div><!-- SC_ON -->",
  "score": 109,
  "permalink": "/r/TooAfraidToAsk/comments/p47agu/why_do_so_many_people_on_reddit_enjoy_kicking/",
  "subreddit": "TooAfraidToAsk",
  "id": "p47agu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Honestly, I’ve seen this so many times. I’ve seen people post about suffering\nwith depression or struggling with a situation and there’s always a douchbag in\nthe comments saying it’s al OPs fault and they don’t try at all to help\nthemselves. Yesterday, in a sub I posted about haing not talked to my…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "正直、何度も見たことがあります。落ち込んだり、悩んだりしている人の投稿を見ていると\n鬱で苦しんでいる人や、状況に悩んでいる人が投稿すると、コメント欄には必ずと言っていいほど\nコメントでは、「それはOPのせいだ」と言って、自分を助ける努力を全くしない人がいます。\n昨日のサブ記事では 昨日、私が投稿したサブ記事の中で、私は自分のことを話していないと...",
      "title": "なぜRedditでは多くの人が人が落ち込んでいるときに蹴ることを楽しんでいるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "说实话，我已经看过很多次了。我见过有人发帖说遭受了\n抑郁症或在某种情况下挣扎的人，而在评论中总是有一个蠢货。\n评论中说这都是OP的错，而他们根本就没有尝试去帮助自己。\n自己。昨天，我在一个贴子里说，我没有和我的朋友谈过。",
      "title": "为什么Reddit上有那么多人喜欢在别人倒下的时候踢他们？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "說實話，我已經看過很多次了。我見過有人發帖說遭受了\n抑鬱症或在某種情況下掙扎的人，而在評論中總是有一個蠢貨。\n評論中說這都是OP的錯，而他們根本就沒有嘗試去幫助自己。\n自己。昨天，我在一個貼子裏說，我沒有和我的朋友談過。",
      "title": "爲什麼Reddit上有那麼多人喜歡在別人倒下的時候踢他們？"
    }
  ]
}