{
  "author": "MarcioCavalcanti",
  "original_created_utc": 1639506320,
  "title": "The Bank of England could become ‘worthless’, Bitcoin warns",
  "created_utc": 1639517445,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;People investing in the corrupt Banking System should be aware of risks&amp;quot;, a local cryptoenthusiast says.&lt;/p&gt;\n\n&lt;p&gt;The Bitcoin has said that Bank Of England could be “worthless” and people investing in the money horders and launderers should be prepared to lose everything.&lt;/p&gt;\n\n&lt;p&gt;In a warning over the potential risks for investors, the cryptoapes questioned whether there was any truth in the fact that the banks are in bed with the government and although the government tells the banks to “treat people fairly,” they continue to steal your money, while greedily taking money from you (via the government and your tax dollars) at the same time.&lt;/p&gt;\n\n&lt;p&gt;That was until they found out that Banks have the power of creating billions of dollars out of thin air and lending it to us and cashing it back with interest while destroying the money created from thin air but keeping the interest on your payments, then yes understood that banks steals their money... and that indeed the Bank of England could become worthless if crypto replaced it since everyone could then have their own banks.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 231,
  "permalink": "/r/CryptoCurrency/comments/rgdrj5/the_bank_of_england_could_become_worthless/",
  "subreddit": "CryptoCurrency",
  "id": "rgdrj5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "\"People investing in the corrupt Banking System should be aware of risks\", a\nlocal cryptoenthusiast says.\n\nThe Bitcoin has said that Bank Of England could be “worthless” and people\ninvesting in the money horders and launderers should be prepared to lose\neverything.\n\nIn a warning over the potential…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "「腐敗した銀行システムに投資する人は、リスクを認識する必要がある」。\n地元の暗号マニアはこう語る。\n\nビットコインはイングランド銀行が「無価値」になる可能性があると言い、人々は\nマネーロンダリングやマネーロンダリングに投資することは、失うことを覚悟しなければならない。\nすべて\n\nその潜在的な可能性に警告を発し...",
      "title": "イングランド銀行が「無価値」になる可能性、ビットコインが警告"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "\"投资于腐败的银行系统的人应该意识到风险\"，一个\n当地加密货币爱好者说。\n\n比特币表示，英格兰银行可能 \"一文不值\"，人们\n投资于洗钱者和洗钱者应该准备好失去一切\n一切。\n\n在对潜在的警告...",
      "title": "比特币警告说，英格兰银行可能变得 \"一文不值"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "\"投資於腐敗的銀行系統的人應該意識到風險\"，一個\n當地加密貨幣愛好者說。\n\n比特幣表示，英格蘭銀行可能 \"一文不值\"，人們\n投資於洗錢者和洗錢者應該準備好失去一切\n一切。\n\n在對潛在的警告...",
      "title": "比特幣警告說，英格蘭銀行可能變得 \"一文不值"
    }
  ]
}