{
  "author": "TinktheChi",
  "original_created_utc": 1635590800,
  "title": "My husband died in 2020 and I discovered after his death that he was gay. Why after a 26 year first marriage did he marry a woman again?",
  "created_utc": 1635599357,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My husband had been married for 26 years to a woman he admittedly had a horrible relationship wirh.  They had two beautiful children.  He divorced and I met him about 6 months later.\nHe was a kind and thoughtful man.  I couldn&#39;t believe I had met someone who was so compatible.  We seemed to be so right for each other.  He professed his love for me and me for him.\nI have never been so in love in my life.  He told everyone we were so good together and so right for each other.\nWe were married 6 short years and had been together nearly 9.\nHe had no apparent health conditions.  He died of a vascular tear near his heart.  I was absolutely heartbroken.<br/>\nI learned a year after he passed that he was gay.  He had multiple affairs both while we were married and while he had been married to his first wife.\nSome were with women.  One of these women was 25 years younger.<br/>\nI discovered he had been visiting bath houses and had been having sex with men.  I also discovered this behaviour had been going on since he was first married to his first wife.\nI&#39;ve had the full panel of STD testing which thankfully came back negative.  I advised his first wife to do the same which she did.\nWe are both in a state of shock about the man we thought we knew.\nWhy on earth would he seek out a second wife, when no one would have batted an eyelash if he had remained single after a 26 year marriage.  He could have been true to himself and lived an honest life.  He could have been happy in his own skin.\nInstead he chose to find another wife and drag me into his fake life, putting my physical and mental health at risk.\n(His 30 year old girlfriend professed to be pregnant by him at Some point and I found out after he passed that much of the sex he had been having was unprotected).\nI&#39;m struggling to understand this and am starting with a new therapist next week.<br/>\nAny thoughts or insights are appreciated.</p>\n</div><!-- SC_ON -->",
  "score": 134,
  "permalink": "/r/TooAfraidToAsk/comments/qiyzf2/my_husband_died_in_2020_and_i_discovered_after/",
  "subreddit": "TooAfraidToAsk",
  "id": "qiyzf2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My husband had been married for 26 years to a woman he admittedly had a horrible\nrelationship wirh. They had two beautiful children. He divorced and I met him\nabout 6 months later. He was a kind and thoughtful man. I couldn't believe I had\nmet someone who was so compatible. We seemed to be so right…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の夫は、26年間結婚生活を送っていましたが、自分でもひどい関係だったと認める女性と\n私の夫は、26年間結婚生活を送っていました。彼らには2人の可愛い子供がいました。彼は離婚し、私はその半年後に彼と出会いました。\n半年後に出会いました。彼は親切で思いやりのある人でした。こんなに相性のいい人に出会えたなんて、信じられなかったわ。\nこんなに相性のいい人に出会えたなんて。私たちはとても合っているように思えました...。",
      "title": "私の夫は2020年に亡くなりましたが、彼がゲイであることを死後に知りました。26年の初婚の後、なぜ彼は女性と再婚したのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我丈夫与一个女人结婚26年了，他承认自己的关系很糟糕。\n的关系。他们有两个漂亮的孩子。他离了婚，我在6个月后遇到了他。\n大约6个月后。他是一个善良和体贴的人。我无法相信我遇到了\n遇到了如此相配的人。我们看起来是那么的合适...",
      "title": "我丈夫在2020年去世，我在他死后发现他是同性恋。为什么在经历了26年的第一次婚姻后，他又娶了一个女人？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我丈夫與一個女人結婚26年了，他承認自己的關係很糟糕。\n的關係。他們有兩個漂亮的孩子。他離了婚，我在6個月後遇到了他。\n大約6個月後。他是一個善良和體貼的人。我無法相信我遇到了\n遇到了如此相配的人。我們看起來是那麼的合適...",
      "title": "我丈夫在2020年去世，我在他死後發現他是同性戀。爲什麼在經歷了26年的第一次婚姻後，他又娶了一個女人？"
    }
  ]
}