{
  "author": "MilitaryAttractions",
  "the_new_excerpt": "Was watching CNBC when it was interrupted to Bidens speech. Biden said he is\ngoing to force the government to buy american made products as much as possible.\nHe talked about cars, steel and there was an emphasis on electric and\nalternative vehicles as well. Overall I was pleasantly surprised by what…",
  "original_created_utc": 1611610855,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "正在看CNBC的时候，被打断了比登的演讲。拜登说他是\n要迫使政府尽可能地购买美国制造的产品。\n他谈到了汽车，钢铁，并有 强调电动和\n也是替代车辆。总的来说，我很惊喜，什么... ...",
      "title": "比登斯 \"美国优先 \"演讲和美国制造业行政令后可买入的股票"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "正在看CNBC的時候，被打斷了比登的演講。拜登說他是\n要迫使政府儘可能地購買美國製造的產品。\n他談到了汽車，鋼鐵，並有 強調電動和\n也是替代車輛。總的來說，我很驚喜，什麼... ...",
      "title": "比登斯 \"美國優先 \"演講和美國製造業行政令後可買入的股票"
    }
  ],
  "title": "Stocks to Buy after Bidens \"America First\" Speech and US Manufacturing Executive Order",
  "created_utc": 1611637534,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Was watching CNBC when it was interrupted to Bidens speech.  Biden said he is going to force the government to buy american made products as much as possible.  He talked about cars, steel and there was an emphasis on electric and alternative vehicles as well.  Overall I was pleasantly surprised by what he said.</p>\n\n<p><a href=\"https://www.youtube.com/watch?v=OVquVGYdlg0\">https://www.youtube.com/watch?v=OVquVGYdlg0</a></p>\n\n<p>&#x200B;</p>\n\n<p>After hearing his speech I went out and purchased</p>\n\n<p>Ford</p>\n\n<p>GM</p>\n\n<p>Tesla</p>\n\n<p>United States Steel Corp</p>\n\n<p>CLEVELAND-CLIFFS INC </p>\n\n<p>Lordstown Motors</p>\n\n<p>&#x200B;</p>\n\n<p>What is <a href=\"/r/investing\">r/investing</a> buying after hearing this speech and the subsequent EO?</p>\n</div><!-- SC_ON -->",
  "score": 73,
  "permalink": "/r/investing/comments/l4ybrz/stocks_to_buy_after_bidens_america_first_speech/",
  "subreddit": "investing",
  "id": "l4ybrz",
  "is_self": true,
  "media": null,
  "is_video": false
}