{
  "author": "FunnyAggressive5781",
  "original_created_utc": 1641996981,
  "title": "How many of you are actually using bitcoin as a retirement fund? As a millennial I feel like this is the best investment for the long term!",
  "created_utc": 1642012934,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;History has shown us from time to time how great it has turned out if a dollar was invested 10 years ago. \nAn asset class coming from less than a 1c to reaching a 69K$ mark is just insane and with its halving , low supply and higher demand just makes the best investment class available for everyone out there. Keep investing&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 333,
  "permalink": "/r/Bitcoin/comments/s27apy/how_many_of_you_are_actually_using_bitcoin_as_a/",
  "subreddit": "Bitcoin",
  "id": "s27apy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "History has shown us from time to time how great it has turned out if a dollar\nwas invested 10 years ago. An asset class coming from less than a 1c to reaching\na 69K$ mark is just insane and with its halving , low supply and higher demand\njust makes the best investment class available for everyone…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "歴史は、1ドルがどれだけ素晴らしい結果をもたらしたかを、折に触れて私たちに示してきました。\n10年前に投資していた 1セント以下だった資産クラスが、10年前に投資され\n半減、低供給、高需要で、6万9000ドルというのは、まさに狂気の沙汰です。\n誰にとっても最高の投資対象であることに変わりはないのだが...。",
      "title": "実際にビットコインを老後資金として使っている人はどれくらいいるのでしょうか？ミレニアル世代としては、長期的な投資として最適な気がしています"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "历史不时向我们表明，如果一美元在10年前投资，结果会有多好？\n10年前的投资是多么的好。一个资产类别从不到1美分到达到\n6.9万美元的大关，这实在是太疯狂了，随着它的减半，低供应和高需求\n这使得每个人都可以得到最好的投资类别......",
      "title": "你们中有多少人真正在使用比特币作为退休基金？作为一个千禧一代，我觉得这是最好的长期投资!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "歷史不時向我們表明，如果一美元在10年前投資，結果會有多好？\n10年前的投資是多麼的好。一個資產類別從不到1美分到達到\n6.9萬美元的大關，這實在是太瘋狂了，隨着它的減半，低供應和高需求\n這使得每個人都可以得到最好的投資類別......",
      "title": "你們中有多少人真正在使用比特幣作爲退休基金？作爲一個千禧一代，我覺得這是最好的長期投資!"
    }
  ]
}