{
  "author": "olli_ita",
  "original_created_utc": 1633545197,
  "title": "Yesterday i got a call from my Bank",
  "created_utc": 1633559864,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My bank’s Director called me yesterday (never talked or met him before).\nHe told me they were doing some security checks and some “anomalies”popped up on my account. They noticed I was regularly moving my monthly income into exchanges and the director wanted to warn me about the risks and volatility or cryptos which btw i’m fully aware of.\nHe wanted to make sure that I wasn’t investing debt in crypto which of course i’m not (I’m not that dumb) I only invest my hard earned money and what I’m willing to lose. Im totally debt free and i owe nothing to my bank.\nSo I asked him what he knew about cryptocurrencies in general. He said : “I heard Elon mask bought a lot of it”.</p>\n\n<p>I’m from a small city in Italy (so please apologize my english) and I was not expecting to the Director of my bank to know much about crypto but also not that little.\nHe kindly asked me not to bring back the money all at once and I simply told him that i have no intention to do so and that i’m crypto for the long run and not for speculation. I also told him that I was aware of the capital gain tax in case of withdrawals.\nHe asked some fairly personal financial questions and even though we didn’t speak about numbers I knew he knew because he told me that he could see my money transfers to exchanges which I didn’t really like. On the other hand, i had the opportunity to ask him some questions and discovered that I am the only one in that particular bank that is involved with cryptocurrencies</p>\n\n<p>I’m sharing this story with you because I found very interesting that my bank noticed me. I am your average 28 yo guy with an average job and an average salary.\nI think in the future banks and governments will do their best to make it harder for the average Joe to get involved in crypto.</p>\n</div><!-- SC_ON -->",
  "score": 219,
  "permalink": "/r/Bitcoin/comments/q2qhyo/yesterday_i_got_a_call_from_my_bank/",
  "subreddit": "Bitcoin",
  "id": "q2qhyo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My bank’s Director called me yesterday (never talked or met him before). He told\nme they were doing some security checks and some “anomalies”popped up on my\naccount. They noticed I was regularly moving my monthly income into exchanges\nand the director wanted to warn me about the risks and volatility…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昨日、私の銀行のディレクターから電話がありました（話したことも会ったこともありません）。彼は私に言った。\nセキュリティチェックをしていて、私の口座にいくつかの「異常」が現れたそうです。\nした。彼らは、私が毎月の収入を定期的に為替に移していることに気づきました。\n部長はそのリスクとボラティリティーについて警告したかったようだ...",
      "title": "昨日、私は銀行から電話を受けました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的银行董事昨天给我打电话（以前从未交谈过或见过他）。他告诉我\n他告诉我，他们正在做一些安全检查，我的账户上出现了一些 \"异常\"。\n账户出现了一些 \"异常\"。他们注意到我定期将我的月收入转入交易所\n主任想提醒我注意风险和波动性......",
      "title": "昨天我接到银行的电话"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的銀行董事昨天給我打電話（以前從未交談過或見過他）。他告訴我\n他告訴我，他們正在做一些安全檢查，我的賬戶上出現了一些 \"異常\"。\n賬戶出現了一些 \"異常\"。他們注意到我定期將我的月收入轉入交易所\n主任想提醒我注意風險和波動性......",
      "title": "昨天我接到銀行的電話"
    }
  ]
}