{
  "author": "jam-hay",
  "original_created_utc": 1636510951,
  "title": "Crypto market is in a bubble, property market is in a bubble, stock market is in a bubble, inflation is high.... here's a thought.. maybe everything is fine and it's just that governments have printed the fuck out of fiat.",
  "created_utc": 1636525845,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>All over the news... Bubble here, bubble there... Bubbles everywhere.</p>\n\n<p>Not really sure what some people expected after governments keeping interest rates at historic lows while printing trillions of fiat stimulus.</p>\n\n<p>What else was going to happen? </p>\n\n<p>What&#39;s the chances that everythings in a bubble Vs just the fiat money supply being in a bubble.</p>\n\n<p>Moral of the story.. don&#39;t keep any of your net worth in fiat cash for any significant period of time. </p>\n\n<p>The shits toxic, end of story.</p>\n</div><!-- SC_ON -->",
  "score": 158,
  "permalink": "/r/Bitcoin/comments/qqjqzh/crypto_market_is_in_a_bubble_property_market_is/",
  "subreddit": "Bitcoin",
  "id": "qqjqzh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "All over the news... Bubble here, bubble there... Bubbles everywhere.\n\nNot really sure what some people expected after governments keeping interest\nrates at historic lows while printing trillions of fiat stimulus.\n\nWhat else was going to happen?\n\nWhat's the chances that everythings in a bubble Vs…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "話題のニュースばかり...。ここにバブル、あそこにバブル...。どこもかしこもバブルだ。\n\n政府が歴史的な低金利を維持しながら、何兆ドルもの不換刺激策を印刷した後に\n政府が歴史的な低金利を維持しながら、何兆もの不換紙幣による刺激を印刷した後に、人々が何を期待していたのかよくわからない。\n\n他に何が起こるというのだろう？\n\nすべてがバブルになる可能性はあるのだろうか...",
      "title": "暗号市場はバブル、不動産市場はバブル、株式市場はバブル、インフレ率は高い.... ここで考えてみたのですが、もしかしたらすべてが順調で、政府が不換紙幣を刷りまくっているだけなのかもしれません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所有的新闻都在报道... 这里有泡沫，那里有泡沫... 泡沫无处不在。\n\n真的不知道有些人在政府保持利息后的预期是什么\n利率保持在历史低点，同时印制数万亿的法币刺激措施。\n\n还有什么会发生呢？\n\n每个人都在泡沫中的机会有多大？",
      "title": "加密货币市场处于泡沫之中，房地产市场处于泡沫之中，股票市场处于泡沫之中，通货膨胀率很高....，这里有一个想法。也许一切都很好，只是政府印制了他妈的法币而已。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所有的新聞都在報道... 這裏有泡沫，那裏有泡沫... 泡沫無處不在。\n\n真的不知道有些人在政府保持利息後的預期是什麼\n利率保持在歷史低點，同時印製數萬億的法幣刺激措施。\n\n還有什麼會發生呢？\n\n每個人都在泡沫中的機會有多大？",
      "title": "加密貨幣市場處於泡沫之中，房地產市場處於泡沫之中，股票市場處於泡沫之中，通貨膨脹率很高....，這裏有一個想法。也許一切都很好，只是政府印製了他媽的法幣而已。"
    }
  ]
}