{
  "author": "IIIBryGuyIII",
  "the_new_excerpt": "Listen I get it.\n\nYou have bought everything in the FIAT of your choice.....for the remainder of\nthis I’m just going to call it the dollar.(I know that is not what everyone\nuses)\n\nBitcoin is simply the means of exchanging your dollar for a digital store of\nvalue asset.\n\nPeriod.\n\nOnce you exchange…",
  "original_created_utc": 1621366633,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "聞いてください......わかりました。\n\nあなたは自分が選んだFIATのすべてを買いました.....。\nここでは「ドル」と呼ぶことにします。\n使っていません。)\n\nビットコインは、あなたのドルをデジタルの価値ある資産に交換する手段です。\n価値のある資産に交換する手段です。\n\n期間限定です。\n\n一度交換すると...",
      "title": "難しいことはわかっている。精神的には、BTCを米ドルや自分の好きな通貨と直接関連付けるのをやめる必要があります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "听着，我明白了。\n\n你已经买了你所选择的FIAT的所有东西，.....，在剩下的时间里，我就把它叫做美元。\n我就叫它美元吧。（我知道这不是每个人都用的\n用的）。)\n\n比特币只是将你的美元换成数字价值储存的手段。\n价值资产。\n\n句号。\n\n一旦你交换...",
      "title": "我知道这很难。在心理上，你需要停止将BTC与美元或你喜欢的货币直接联系起来。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "聽着，我明白了。\n\n你已經買了你所選擇的FIAT的所有東西，.....，在剩下的時間裏，我就把它叫做美元。\n我就叫它美元吧。（我知道這不是每個人都用的\n用的）。)\n\n比特幣只是將你的美元換成數字價值儲存的手段。\n價值資產。\n\n句號。\n\n一旦你交換...",
      "title": "我知道這很難。在心理上，你需要停止將BTC與美元或你喜歡的貨幣直接聯繫起來。"
    }
  ],
  "title": "I know it is hard. Mentally you need to stop directly correlating BTC with USD or the currency of your preference.",
  "created_utc": 1621402793,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Listen I get it.</p>\n\n<p>You have bought everything in the FIAT of your choice.....for the remainder of this I’m just going to call it the dollar.(I know that is not what everyone uses) </p>\n\n<p>Bitcoin is simply the means of exchanging your dollar for a digital store of value asset.  </p>\n\n<p>Period.</p>\n\n<p>Once you exchange that dollar you should think it burned and reborn as a superior asset.</p>\n\n<p>The ONLY thing that changes in market fluctuations is the buying power of that dollar.</p>\n\n<p>When Bitcoin and other cryptocurrency are on top of Everest then...yes....sorely you get less bang for you buck but it feels good cause it’s actively growing.</p>\n\n<p>When it’s dipped though you get more firepower.  If your not interested in this asset during a dip then....sorry.....you need a little more exposure.</p>\n\n<p>Dip or peak you are still getting the single fastest growing asset that human kind has ever seen during our digital era.</p>\n\n<p>This is not a traditional investment that pays dividends or has a near guaranteed yield like say an SP500 fund.</p>\n\n<p>I’m going to say something corny.</p>\n\n<p>This is the future. </p>\n\n<p>If you have found yourself on this crypto path with some archaic traditional investment mind set...well your a bit behind the eight ball.</p>\n\n<p>Remember when you were riding the 60,000$’s high and you said “I hope it dips! I’m going to buy even more!”</p>\n\n<p>This. Is. A. Dip.</p>\n\n<p>Might not even be “The Dip”.</p>\n\n<p>I’m going to go now.  </p>\n\n<p>HODL.</p>\n</div><!-- SC_ON -->",
  "score": 190,
  "permalink": "/r/Bitcoin/comments/nfk0ft/i_know_it_is_hard_mentally_you_need_to_stop/",
  "subreddit": "Bitcoin",
  "id": "nfk0ft",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590795291
}