{
  "author": "northwesternsamurai",
  "original_created_utc": 1634194462,
  "title": "I hope everything you hold does a 10x.",
  "created_utc": 1634207470,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If I could describe so much of the worlds pain and division today I would put it into one word: Tribalism. Tribalism is the idea that “my tribe” is better than yours because of xyz. Going into the crypto space I thought it’d be different but people are people I guess. So to you reading this right now…</p>\n\n<p>I hope every coin you hold does a 10x</p>\n\n<p>I hope you buy that Lamborghini or Tesla or just the car of your dreams </p>\n\n<p>I hope you pay off all your debt- every single damn one </p>\n\n<p>I hope you buy the perfect house for your family- all in cash</p>\n\n<p>I hope your gains pay for that family members medical bill or that much needed car repair </p>\n\n<p>I hope you launch your dream career or open your dream business </p>\n\n<p>I hope you find financial freedom</p>\n\n<p>I hope you bless that charity</p>\n\n<p>I hope you can finally pay the legal fees to adopt that child </p>\n\n<p>I hope you send your kids off to college for a life better than the one you had</p>\n\n<p>I hope you thank those who believed in you</p>\n\n<p>I hope the HODLing and the ups and downs are worth it all </p>\n\n<p>I hope everything you own does a 10x and more</p>\n\n<p>I hope the absolute best for you</p>\n\n<p>Good night!</p>\n</div><!-- SC_ON -->",
  "score": 349,
  "permalink": "/r/CryptoCurrency/comments/q7uc3c/i_hope_everything_you_hold_does_a_10x/",
  "subreddit": "CryptoCurrency",
  "id": "q7uc3c",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "If I could describe so much of the worlds pain and division today I would put it\ninto one word: Tribalism. Tribalism is the idea that “my tribe” is better than\nyours because of xyz. Going into the crypto space I thought it’d be different\nbut people are people I guess. So to you reading this right…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日の世界の痛みと分裂を一言で表すとしたら\n部族主義」という言葉です。部族主義とは、「私の部族」は「あなたの部族」よりも優れているという考えです。\n部族主義とは、「私の部族」は「あなたの部族」よりも優れているという考え方です。暗号の世界に入ったとき、それは違うだろうと思いました。\nしかし、人は人だと思います。だから、これを読んでいるあなたには...",
      "title": "持っているものすべてが10倍になるといいですね。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果我可以描述今天世界上这么多的痛苦和分裂，我会把它归结为一个词：部落主义。\n一个词：部落主义。部落主义是一种想法，即 \"我的部落 \"比你的部落更好，因为\n因为你的部落。在进入加密货币领域时，我以为会有所不同\n但人就是人，我想。因此，对正在阅读这篇文章的你来说...",
      "title": "我希望你持有的所有东西都能达到10倍。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果我可以描述今天世界上這麼多的痛苦和分裂，我會把它歸結爲一個詞：部落主義。\n一個詞：部落主義。部落主義是一種想法，即 \"我的部落 \"比你的部落更好，因爲\n因爲你的部落。在進入加密貨幣領域時，我以爲會有所不同\n但人就是人，我想。因此，對正在閱讀這篇文章的你來說...",
      "title": "我希望你持有的所有東西都能達到10倍。"
    }
  ]
}