{
  "author": "leo13mg",
  "original_created_utc": 1629832704,
  "title": "Bullish ADA Analysis, will we reach 3$? Correction incoming! See the graph and analysis!",
  "created_utc": 1629862236,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Ada has been in a strong bullish tendency, we had little correction until now, Price went from 1 to 2 usd very quick after the MACD turned to buyer, something like this only happened before at May and we can say the price went up fast. we are seeing the same scenario now, the price is going high fast, being supported by a great and continuous Buy Volume and a strong MACD, got to say that thing are looking much better now than in May. Here is the graph:  </p>\n\n<p><a href=\"https://preview.redd.it/u4bpqh6ducj71.png?width=1637&amp;format=png&amp;auto=webp&amp;s=654c3199522d1088d785d23bde5a35114563b62e\">Bullish tendency supported by MACD and Volume similarly as May</a></p>\n\n<p>I use a Fibonacci project to find the targets, we already past most of them and can expect a huge fight for the price between buyers and sellers now, we reached 80% of fibo which is satisfactory zone where many will sell to earn after the bull run, but we can expect it to reach 100% of Fibonacci easily. At 50% fibo (2.48$)  we saw a little fight for the price, players indeed took a breath before continuing the movement and now at 80% (2.82$) we saw a bigger fight for the price. In my opinion we can expect the price to reach the zone of 3.088$ this week before a stronger correction, but remember everything about this coin is bullish based on this graph, the MACD is still very buyer and the volume is consistent positively. Prepare your diamond hands for a correction once it reaches 3$~3.1$. If you like my analysis drop an Upvote, I need those beautiful moons, and if you want a correction analysis when it reaches 3$ tell me!</p>\n</div><!-- SC_ON -->",
  "score": 161,
  "permalink": "/r/CryptoCurrency/comments/pau6i0/bullish_ada_analysis_will_we_reach_3_correction/",
  "subreddit": "CryptoCurrency",
  "id": "pau6i0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Ada has been in a strong bullish tendency, we had little correction until now,\nPrice went from 1 to 2 usd very quick after the MACD turned to buyer, something\nlike this only happened before at May and we can say the price went up fast. we\nare seeing the same scenario now, the price is going high…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "エイダは強い強気の傾向にあり、これまでほとんど修正がありませんでした。\nMACDが買いに転じた後、価格は1米ドルから2米ドルへとあっという間に変化した。\nこのようなことは5月にもあったが、その時は価格が急速に上昇したと言える。\n今、同じシナリオを見ている、価格は高くなっている...。",
      "title": "強気のADA分析、3ドルに届くか？修正が入る! グラフと分析を見る"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Ada一直处于强劲的看涨趋势中，直到现在我们都没有什么修正。\n在MACD转为买方后，价格很快从1美元涨到了2美元，这样的事情只在5月份发生过，我们可以说价格涨得很快。\n这样的事情以前只在5月份发生过，我们可以说价格上升很快。\n我们现在看到了同样的情况，价格正在走高......",
      "title": "看涨的ADA分析，我们将达到3美元？纠正即将来临! 请看图表和分析!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Ada一直處於強勁的看漲趨勢中，直到現在我們都沒有什麼修正。\n在MACD轉爲買方後，價格很快從1美元漲到了2美元，這樣的事情只在5月份發生過，我們可以說價格漲得很快。\n這樣的事情以前只在5月份發生過，我們可以說價格上升很快。\n我們現在看到了同樣的情況，價格正在走高......",
      "title": "看漲的ADA分析，我們將達到3美元？糾正即將來臨! 請看圖表和分析!"
    }
  ]
}