{
  "author": "samuth",
  "original_created_utc": 1627556996,
  "title": "Laughed at for buying my niece BTC... last summer.",
  "created_utc": 1627565751,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Laughed at for buying my Niece bitcoin for her first birthday...Last summer.</p>\n\n<p>So I was trying to decide what to get my niece for her first birthday last July.  I figured she&#39;s probably gonna get loads of crappy toys that she will quickly grow out of . I had just started buying BTC earlier that year so I thought I will get her some, I only bought £50.00 worth for her when it was worth $8000ish dollars. When my brother and his wife the parents of my niece opened the card to a message that said &quot; You now own 0.0066 Bitcoin&quot; they seemed a bit confused, my brother in law then laughed out loud and said&#39; Who buys a baby Bitcoin&#39;. I have to admit I felt pretty bad... It&#39;s now worth almost £300.00 and counting. I said she can withdraw when she&#39;s 18.</p>\n\n<p>Edit: I did post this in the BTC subreddit so apologies if you’ve seen it. I just really loved the responses the post got and how it was inspiring people to do similar things, so I thought I’d reach out into this sub.</p>\n</div><!-- SC_ON -->",
  "score": 477,
  "permalink": "/r/CryptoCurrency/comments/otveoq/laughed_at_for_buying_my_niece_btc_last_summer/",
  "subreddit": "CryptoCurrency",
  "id": "otveoq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Laughed at for buying my Niece bitcoin for her first birthday...Last summer.\n\nSo I was trying to decide what to get my niece for her first birthday last July.\nI figured she's probably gonna get loads of crappy toys that she will quickly\ngrow out of . I had just started buying BTC earlier that year…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "姪っ子の1歳の誕生日にビットコインを買って笑われた...昨年の夏。\n\n去年の7月、姪っ子の1歳の誕生日に何を贈ろうか悩んでいました。\nおそらく、すぐに飽きてしまうようなくだらないおもちゃをたくさんもらうんだろうなと思っていました。\n私はその年の初めにBTCを買い始めたばかりでした...。",
      "title": "去年の夏、姪っ子にBTCを買ってあげたことで笑われました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "去年夏天为我侄女的第一个生日买比特币而被嘲笑。\n\n去年七月，我正试图决定给我侄女的第一个生日送什么。\n我想她可能会得到很多蹩脚的玩具，她很快就会长大。\n那年早些时候，我刚刚开始购买BTC......",
      "title": "去年夏天因为给我侄女买BTC而被嘲笑。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "去年夏天爲我侄女的第一個生日買比特幣而被嘲笑。\n\n去年七月，我正試圖決定給我侄女的第一個生日送什麼。\n我想她可能會得到很多蹩腳的玩具，她很快就會長大。\n那年早些時候，我剛剛開始購買BTC......",
      "title": "去年夏天因爲給我侄女買BTC而被嘲笑。"
    }
  ]
}