{
  "author": "Skilhgt",
  "original_created_utc": 1655086611,
  "title": "Celsius network has frozen all withdrawals, swaps and transfers",
  "created_utc": 1655091153,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;“We are writing with a very important message for our community.&lt;/p&gt;\n\n&lt;p&gt;Due to extreme market conditions, today we are announcing that Celsius is pausing all withdrawals, Swap, and transfers between accounts. We are taking this action today to put Celsius in a better position to honor, over time, its withdrawal obligations. &lt;/p&gt;\n\n&lt;p&gt;Acting in the interest of our community is our top priority. In service of that commitment and to adhere to our risk management framework, we have activated a clause in our Terms of Use that will allow for this process to take place. Celsius has valuable assets and we are working diligently to meet our obligations. &lt;/p&gt;\n\n&lt;p&gt;We are taking this necessary action for the benefit of our entire community in order to stabilize liquidity and operations while we take steps to preserve and protect assets. Furthermore, customers will continue to accrue rewards during the pause in line with our commitment to our customers.&lt;/p&gt;\n\n&lt;p&gt;We understand that this news is difficult, but we believe that our decision to pause withdrawals, Swap, and transfers between accounts is the most responsible action we can take to protect our community. We are working with a singular focus: to protect and preserve assets to meet our obligations to customers. Our ultimate objective is stabilizing liquidity and restoring withdrawals, Swap, and transfers between accounts as quickly as possible. There is a lot of work ahead as we consider various options, this process will take time, and there may be delays.&lt;/p&gt;\n\n&lt;p&gt;We thank the incredible Celsius community for your support today. It is our pleasure to serve you. Our operations continue and we will continue to share information with the community as it becomes available. &lt;/p&gt;\n\n&lt;p&gt;Sincerely,\nThe Celsius team”&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 370,
  "permalink": "/r/CryptoCurrency/comments/vb1il2/celsius_network_has_frozen_all_withdrawals_swaps/",
  "subreddit": "CryptoCurrency",
  "id": "vb1il2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "“We are writing with a very important message for our community.\n\nDue to extreme market conditions, today we are announcing that Celsius is\npausing all withdrawals, Swap, and transfers between accounts. We are taking\nthis action today to put Celsius in a better position to honor, over time,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "\"私たちは、地域社会のために非常に重要なメッセージを書いています。\n\n極端な市場環境のため、本日、セルシオは、すべての出金、スワップ取引を一時停止することを発表します。\nすべての出金、スワップ、および口座間の移動を一時停止することを発表します。この措置は\nこの措置は、セルシオをより良い状態に保つためであり、長期的に...",
      "title": "セルシオのネットワークは、すべての出金、スワップ、転送を凍結しました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "\"我们为我们的社区写了一个非常重要的信息。\n\n由于极端的市场条件，今天我们宣布，Celsius正在\n暂停所有提款、掉期和账户之间的转账。我们今天采取\n今天采取这一行动是为了使Celsius能够更好地履行，随着时间的推移，...",
      "title": "Celsius网络已经冻结了所有的提款、掉期和转账业务"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "\"我們爲我們的社區寫了一個非常重要的信息。\n\n由於極端的市場條件，今天我們宣佈，Celsius正在\n暫停所有提款、掉期和賬戶之間的轉賬。我們今天採取\n今天採取這一行動是爲了使Celsius能夠更好地履行，隨着時間的推移，...",
      "title": "Celsius網絡已經凍結了所有的提款、掉期和轉賬業務"
    }
  ]
}