{
  "author": "smohyee",
  "the_new_excerpt": "Special shoutout to /u/UnempRetardaddy, who inspired me to write up this\nexplanation. Unfortunately, WSB investors have picked up some half-truths with\nlimited information, and are reaching a whole bunch of incorrect conclusions\nwhich they're using to justify advice to other traders. BAD…",
  "original_created_utc": 1612567105,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "特别向/u/UnempRetardaddy致敬，是他激励我写出了这篇报道。\n解释。遗憾的是，WSB的投资者们已经听出了一些半真半假的信息。\n信息有限，却得出一大堆不正确的结论。\n他们用它来证明对其他交易者的建议。坏的...",
      "title": "LESSON时间。GME今天被限制卖空。这到底意味着什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "特別向/u/UnempRetardaddy致敬，是他激勵我寫出了這篇報道。\n解釋。遺憾的是，WSB的投資者們已經聽出了一些半真半假的信息。\n信息有限，卻得出一大堆不正確的結論。\n他們用它來證明對其他交易者的建議。壞的...",
      "title": "LESSON時間。GME今天被限制賣空。這到底意味着什麼？"
    }
  ],
  "title": "LESSON TIME: GME was short-sale restricted today. Here's what that really means.",
  "created_utc": 1612600789,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Special shoutout to <a href=\"/u/UnempRetardaddy\">/u/UnempRetardaddy</a>, who inspired me to write up this explanation. Unfortunately, WSB investors have picked up some half-truths with limited information, and are reaching a whole bunch of incorrect conclusions which they&#39;re using to justify advice to other traders. BAD MONKEYS.</p>\n\n<p>&#x200B;</p>\n\n<p>TL;DR:</p>\n\n<ul>\n<li>Short attacks are real</li>\n<li>Short ladder attacks are not</li>\n<li>Any stock that falls 10% in one day is placed on a short-sale restriction for the next day</li>\n<li>Short-sale restriction <em>doesn&#39;t</em> prevent short selling</li>\n<li>It <em>does</em> effectively prevent short attacks</li>\n<li>GME was short-sale restricted today, which is why no short attacks could take place to drive the price down. All downward price movement was caused by shareholders.</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p>Let&#39;s go into detail:</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Are Short Attacks real, and what are they?</strong></p>\n\n<p>Yes. A short attack is simply selling so many shares short that you drive the market price down due to oversupply vs demand. <em>This works the exact same way as if a shareholder was selling their actual shares, and not borrowed ones.</em></p>\n\n<p>Let&#39;s imagine that a bunch of shares are all sold at market price at once. What happens?</p>\n\n<p>Since they are sold at market price, they automatically meet the bid price offered by the highest bidder in the marketplace, then the next highest bidder, etc. As long as more shares are being sold than there are orders at the highest bid price, then the sale will continue to the next highest bid price, which drops the market price of the stock (market price simply being the last price the stock was sold at).</p>\n\n<p>If the current highest bid is $100 a share for 100 shares,and the next highest bid on the books is for $99 a share at 1000 shares...Then to drop the market price down $99, I need to sell 100 shares at market price.And if I want to drop the market price down past $99 (to whatever the next highest bid is), I need to sell 1100 shares.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>What are the risks of launching a short attack?</strong></p>\n\n<p>When a hedge fund tries a short attack, they are taking a risk that there is more demand to buy shares at current market price than there is supply of shares they are willing to short sell.</p>\n\n<p>If Melvin tries to short 1 million shares at $100 market price, but 10M shares worth of market price buy orders are immediately placed because people see the price dropping and want to buy the dip, then due to high demand vs supply the share price will go <em>above</em> $100, and now Melvin is in the red on their short position. For a real world example of this happening, see TSLA throughout 2020.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>What makes a short attack successful?</strong></p>\n\n<ul>\n<li>Low trading volume - if there aren&#39;t a lot of buy orders on the books, there are fewer orders to meet at each price point, and fewer shares need to be sold to drive the price down.<em>For example: Thurs 1/28, when brokerages halted buying and artificially reduced demand</em></li>\n<li>Large supply of shortable shares - there are only so many shares for a company, and only so many of those that shareholders are willing to lend out for short selling. A short seller needs a large enough supply to (temporarily)  overwhelm demand.<em>For example: Despite shorts available for GME being at or near 0, MMs were (legally) allowed to &#39;naked short&#39;, creating artificial supply which allowed hedge funds to short sell at the $500 peak on Thurs (and yes, its as unfair as it sounds)</em></li>\n<li>Paper-handed bitches - This is the real key to success. If actual shareholders notice the price dropping and decide to sell as well, it creates a compounding effect, where supply increases even more, and price drops even more, and even more people decide to sell. This can also be caused by price drops triggering stop orders, as well as triggering margin calls by driving accounts below margin maintenance.</li>\n<li>Psychological manipulation - This is a corollary to the previous point. If every shareholder had a sense that the price drop was only due to a short attack, they&#39;d probably hold. But if they see news stories saying shorters closed their positions, that everyone is switching to buying silver, that brokers are halting buying and no one can help drive the price up... well, it makes it a lot easier to justify selling.</li>\n</ul>\n\n<p>For the greatest example of all four of these elements at work, see GME between last Thursday and this Monday, between the brokerage restrictions (and the Market Maker margin reqs behind them), the media misinformation campaigns, the incredible abuse of naked shorting in the name of &#39;market liquidity&#39;, and the reality of the bull side being a lot of retail investors without deep pockets who overextended at high prices and didn&#39;t have enough collective reserves to buy the dips, so they ended up selling.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Are Short</strong> <strong><em>Ladder</em></strong> <strong>Attacks real?</strong></p>\n\n<p>The claim behind a short ladder attack is similar to the Short Attack described above, with the added flavoring that colluding hedge funds are just selling back and forth to each other. This is impossible.</p>\n\n<p>Note, per above, that <em>short attacks</em> are quite real. What makes a short ladder attack nonsense is the belief that hedge funds can direct who their sell orders go to, or that it&#39;s possible to constantly bid a price down in an open market place, where anyone can place a market &#39;buy&#39; order and prevent the price from dropping till their order is met.</p>\n\n<p>The closest we came to this notion was last Thursday, where the big players just straight up cheated and shut down much of the buy side of the market, so that, in effect, hedge funds may very well have just been short selling to each other. But that is more due to the environment created by those (hopefully unique) events.</p>\n\n<p>Shoutout to <a href=\"/u/EmptySet2\">/u/EmptySet2</a> for his further breakdown of why it&#39;s not a real thing, here:<a href=\"https://www.reddit.com/r/investing/comments/lbib0x/the_myth_of_the_short_ladder_attack/\">https://www.reddit.com/r/investing/comments/lbib0x/the_myth_of_the_short_ladder_attack/</a></p>\n\n<p>&#x200B;</p>\n\n<p><strong>What is the Short Sale Rule (aka &#39;Alternative Uptick Rule&#39; aka &#39;Rule 201&#39; aka &#39;Short-Sale Restriction&#39;)?</strong></p>\n\n<p>There&#39;s a bit of history here, with some changes to the rules over time. I&#39;ll talk about most recent version of this restriction, which was implemented in 2010:</p>\n\n<ol>\n<li>If any security falls more than 10% within a single trading day, it triggers the &#39;Alternative Uptick Rule&#39; for the remainder of that day, and for the duration of the next trading day.</li>\n<li>While that rule is in place, short selling is only permitted if the price of the security is above the current national best bid (aka on the uptick).</li>\n</ol>\n\n<p>This is required to be enforced by the system as a whole. For this rule to be broken, everyone would have to be in on it, from brokers to clearing entities to market makers. It would be a big fucking deal.</p>\n\n<p>Source: <a href=\"https://www.sec.gov/news/press/2010/2010-26.htm\">https://www.sec.gov/news/press/2010/2010-26.htm</a></p>\n\n<p>Source for monkeys: <a href=\"https://www.investopedia.com/terms/s/shortsalerule.asp\">https://www.investopedia.com/terms/s/shortsalerule.asp</a></p>\n\n<p>&#x200B;</p>\n\n<p><strong>How does this stop a short attack?</strong></p>\n\n<p>Recall from earlier that a short attack is just selling a bunch of shares at market price, driving the price down as you meet each next highest bid.</p>\n\n<p>Well, quite simply, while GME is short-sale restricted, short sellers <em>cannot</em> sell their shorted shares to the current highest bidder. They have to set their own ask price above that highest bid price, and wait for a buyer to meet it.</p>\n\n<p>What does this mean? It means that on a day like today, a short attack by its very nature isn&#39;t permitted to happen. <em>All short selling can do on a day like today is suppress the price from going up</em>. If the current share price is $60, a hedgie could short sell 10 million shares at an ask of $60.01, and thus the price wouldn&#39;t go past that until all 10 mil are bought out.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>What does this mean about current stay of play of GME?</strong></p>\n\n<p>Broadly put, for the past week there have been alternating days of massive short attacks, followed by lulls or even upward price movement during the short-sale restricted days.</p>\n\n<p>Yesterday there was a whole lot of shorting and/or shareholders exiting positions, driving the price down more than 10%. Today, we saw a relatively stable price as only shareholders could sell at market price.</p>\n\n<p>Put 2 and 2 together and take a wild guess what&#39;s coming Monday.</p>\n\n<p>(Edit: a short attack. That&#39;s what&#39;s coming. Or maybe it isn&#39;t, it&#39;s just going to be possible again. Just be aware of the possibility that wasnt there today. ) </p>\n\n<p>&#x200B;</p>\n\n<p>Position: 1000 shares and 5 calls</p>\n</div><!-- SC_ON -->",
  "score": 3439,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/kH2iQ31btJiTsG-u_FBJrKtOva3i0NxL-8PYNEjC7EU.jpg?auto=webp&s=9709b0f266e9a09af42065cc2e1fbe8524ca88c8",
          "width": 170,
          "height": 128
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/kH2iQ31btJiTsG-u_FBJrKtOva3i0NxL-8PYNEjC7EU.jpg?width=108&crop=smart&auto=webp&s=51569d8ee5f2277f7f1a83e69e5148049574a5b8",
            "width": 108,
            "height": 81
          }
        ],
        "variants": {},
        "id": "TD1toYAk8bD1txvmGydLLN78SAoWHkLP8CtZDiR7XnU"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/wallstreetbets/comments/ldk5o3/lesson_time_gme_was_shortsale_restricted_today/",
  "subreddit": "wallstreetbets",
  "id": "ldk5o3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123213438
}