{
  "author": "DetroitMotorShow",
  "original_created_utc": 1635105284,
  "title": "VCs are getting into projects at 22c, and then dumping it to the public at $27 in a \"public sale\". This is just a big fraud, and will end with a 98% correction like we saw in 2018.",
  "created_utc": 1635140093,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A lot of projects are just once again following the same pattern from 2017 when it comes to raising funds. Allocate an initial big % of funds to VCs, key backers at a ridiculously cheap valuation while the project is not even in the public eye, then build some of the features of the project (usually a website, a DEX or couple of pools/farms) and then create a big marketing hyped launch event, where around 10% of the project&#39;s tokens can be bought by the public. Meanwhile, 90% of the tokens are controlled by insiders and VCs who entered at 1/100th the price. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/uily92gf9gv71.jpg?width=1125&amp;format=pjpg&amp;auto=webp&amp;s=12a1516e1496dc9524064c4a49ed13484300e700\">Price during deposit perion: $27. Price for VCs: 22c</a></p>\n\n<p>This is nothing short of a scam, but this market always drags in the next sucker who thinks they can profit by becoming a &quot;long term investor&quot; in these projects, and get in &quot;early&quot;</p>\n\n<p>The only way this ends is with the early investors slowly but surely dumping their tokens that were acquired at a very cheap valuation on exchanges, while the price corrects 90-98%. </p>\n\n<p>Many times, terminology like &quot;vesting schedule&quot; or locked tokens is used just to confound the retail participants, to make them believe they wont get dumped on. There is a vesting schedule, so the early investors will baghold through a 90% correction right? Lol</p>\n\n<p>There is not one single reason any long term investor must look at these projects. There are several distribution mechanisms in existence today that are much more fair, including stake drops, farm distributions etc where one can acquire tokens of new projects without donating their funds away to the team at a terrible valuation. </p>\n\n<p>Most of the VCs in the crypto space are pure predators. They give zero fucks if the project even survives or not, as long as they exit their investment with a ton of cheese on top. They can hardly be fussed about the late investors or users. This is the rather sombre reality of an unregulated market - the ones making the rules do it predominantly to enrich themselves.</p>\n</div><!-- SC_ON -->",
  "score": 168,
  "permalink": "/r/CryptoCurrency/comments/qezru0/vcs_are_getting_into_projects_at_22c_and_then/",
  "subreddit": "CryptoCurrency",
  "id": "qezru0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "A lot of projects are just once again following the same pattern from 2017 when\nit comes to raising funds. Allocate an initial big % of funds to VCs, key\nbackers at a ridiculously cheap valuation while the project is not even in the\npublic eye, then build some of the features of the project (usually…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "の時の2017年と同じパターンをもう一度踏襲しているだけのプロジェクトが多いです。\n資金調達のために 最初に大きな割合の資金をVCや主要な支援者に割り当てます。\nプロジェクトがまだ公開されていない段階で、とんでもなく安い評価額で、最初の大きな割合の資金をVCや主要な支援者に割り当てます。\nそして、プロジェクトの機能の一部を構築します（通常は...）。",
      "title": "VCは22cでプロジェクトに参加し、「パブリック・セール」で27ドルで一般大衆に投売りしている。これはただの大きな詐欺であり、2018年に見られたような98％の修正で終わるだろう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "很多项目只是再次遵循2017年的相同模式，当\n筹集资金。将最初的大比例资金分配给风险投资公司、关键的\n在项目还没有进入公众视线的时候，以低得离谱的估值向风险投资公司、关键支持者分配了最初的大笔资金。\n公众视野，然后建立项目的一些功能（通常...",
      "title": "风险投资公司正在以22美分的价格进入项目，然后以27美元的价格 \"公开出售 \"甩给公众。这只是一个大骗局，并将以像我们在2018年看到的98%的修正结束。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "很多項目只是再次遵循2017年的相同模式，當\n籌集資金。將最初的大比例資金分配給風險投資公司、關鍵的\n在項目還沒有進入公衆視線的時候，以低得離譜的估值向風險投資公司、關鍵支持者分配了最初的大筆資金。\n公衆視野，然後建立項目的一些功能（通常...",
      "title": "風險投資公司正在以22美分的價格進入項目，然後以27美元的價格 \"公開出售 \"甩給公衆。這只是一個大騙局，並將以像我們在2018年看到的98%的修正結束。"
    }
  ]
}