{
  "author": "flufftobuff16",
  "the_new_excerpt": "With the upcoming Nasdaq listing\n[https://mindmed.co/news/press-release/mindmed-to-commence-trading-on-nasdaq/]\nof Mindmed(MNMD), I'm sure a lot of you are ready for the first ever \"shroom\nboom\" on the North american stock exchange. While tendies are definitely an\noutcome of this, there's more to it…",
  "original_created_utc": 1619290717,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ナスダック上場を控えて\n[https://mindmed.co/news/press-release/mindmed-to-commence-trading-on-nasdaq/]\nMindmed(MNMD)のNasdaq上場を控え、多くの方が北米証券取引所での第一次「シュルームブーム」に備えていることと思います。\n北米証券取引所での第一次「シュルーム・ブーム」に備えている方も多いのではないでしょうか。傾向は間違いなくこの結果ですが\nテンディは間違いなくこの結果をもたらしますが、それだけではありません...。",
      "title": "Mindmedを買い持ちするケース $MNMD"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "随着纳斯达克即将上市\n[https://mindmed.co/news/press-release/mindmed-to-commence-trading-on-nasdaq/]\nMindmed(MNMD)即将在纳斯达克上市，我相信你们中的很多人已经准备好迎接北方有史以来第一次 \"蘑菇热\"。\n在北美证券交易所的繁荣。虽然大麻肯定是一个结果\n蘑菇是一个结果，但还有更多的东西......",
      "title": "买入并持有Mindmed的案例 $MNMD"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "隨着納斯達克即將上市\n[https://mindmed.co/news/press-release/mindmed-to-commence-trading-on-nasdaq/]\nMindmed(MNMD)即將在納斯達克上市，我相信你們中的很多人已經準備好迎接北方有史以來第一次 \"蘑菇熱\"。\n在北美證券交易所的繁榮。雖然大麻肯定是一個結果\n蘑菇是一個結果，但還有更多的東西......",
      "title": "買入並持有Mindmed的案例 $MNMD"
    }
  ],
  "title": "A case for buying and holding Mindmed $MNMD",
  "created_utc": 1619308021,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>With the upcoming <a href=\"https://mindmed.co/news/press-release/mindmed-to-commence-trading-on-nasdaq/\">Nasdaq listing</a> of Mindmed(MNMD), I&#39;m sure a lot of you are ready for the first ever &quot;shroom boom&quot; on the North american stock exchange. While tendies are definitely an outcome of this, there&#39;s more to it than that. I discovered Mindmed after seeing my dad live with PTSD/depression his whole life as well as having a good friend pass away because of an overdose, and have been behind their mission of combating mental health issues and ending the opioid addiction problem ever since.</p>\n\n<p>A few statistics:</p>\n\n<p>-<strong>92 Million people use opioids globally</strong></p>\n\n<p>-<strong>$500 Billion spent on opioids in the US alone</strong></p>\n\n<p>-<a href=\"https://www.drugabuse.gov/drug-topics/trends-statistics/overdose-death-rates\">There has been an 844% in benzodiazepine overdose deaths since 1999</a></p>\n\n<p>-<strong>284 Million globally suffer from anxiety</strong></p>\n\n<p><strong>-$4.7 Billion is spent on anxiety medication annually</strong></p>\n\n<p>Anxiety is growing as social media usage skyrockets. <strong>Since widespread social media adoption in 2009, there has been a 189%  increase in self-harm</strong>. And now COVID-19 is causing job loss, isolation, and overall fear. <strong>Anxiety medications have increased 34.1% month-over-month in the first few months of COVID-19.</strong></p>\n\n<p><strong>21 million Americans have at least one addiction</strong>, yet despite focused efforts in the space, which are saving lives on a daily basis, only 10% of those individuals receive treatment.  Addiction is a brain disease, driven by a set of disease processes including the dysregulation of dopamine, a potent neurotransmitter, in the brain’s reward/pleasure center located in the midbrain.</p>\n\n<p>Mindmed has plenty of catalysts down the pipeline that will bring tendies, but more importantly, it&#39;ll bring peace of mind to both those suffering from mental health disorders and those who have to sit on the sideline and watch their loved one go through it</p>\n\n<p><strong>A few projects currently on their timeline:</strong></p>\n\n<p><a href=\"https://mindmed.co/experiential-therapies/#anxiety\">- Project Lucy</a><strong>:</strong>  Project Lucy involves a hallucinogenic dosing of LSD to treat anxiety, administered by a therapist. LSD increases brain communication and supports talk therapy by expanding the mind and minimizing inhibitions. <strong>MindMed is currently preparing to initiate our Phase 2b human efficacy trial for experiential doses of LSD.</strong></p>\n\n<p><a href=\"https://mindmed.co/psychedelic-inspired/#scroll_section-1\">-18-MC</a><strong>:</strong>  &quot;We are developing 18-MC to treat the cause of the brain disease that is addiction, rather than solely the symptoms. Sustained mental healing requires addressing a root cause and a comprehensive approach for the entire patient journey. Cue-induced reinstatement, or relapse,  is when an individual with a substance use disorder is prompted by their surroundings to consume a harmful substance (example: The clink of a wine glass at a dinner party for a person with an alcohol use disorder).&quot; <strong>Currently in phase 1B FDA trials.</strong></p>\n\n<p>While this is still a very new form of pharma, this has potential to be the new wave of mental health treatment. With <a href=\"https://www.psychcongress.com/article/biden-pledges-assertive-action-address-opioid-crisis-0\">Biden pushing heavy for the end of opioid addiction</a>, Mindmed is armed and ready to take on that task.</p>\n\n<p>Buying and holding this will put MindMed on the map for more people who are unfamiliar with this revolutionary treatment. We all saw what a bunch of degenerates could do to multi-billion dollar Hedge funds. Now lets see what we can do to deadly mental &quot;diseases&quot; and Big pharma who&#39;s making profit from the chaos.</p>\n\n<p>tl;dr:</p>\n\n<p>Addiction/depression is one of the leading causes of death in the US, Mindmed is creating safe ways to combat these. Medication for these alone pulls in over $500B annually</p>\n\n<p>Huge tendie potential as Mindmed is the first to pioneer psychedelic medication/therapy</p>\n\n<p>Huge to potential to save friends and family from suffering from addiction/depression.</p>\n\n<p>Position- 1000 shares @ $2.03</p>\n\n<p>Edit: spelling</p>\n\n<p>Edit 2: nasdaq trading begins Tuesday</p>\n\n<p>Edit 3: I am not a financial advisor. This may have momentum as it hits the nasdaq, it also may pull back shortly after. No one can tell. But, this is a medium/long term hold for me! Pharmaceuticals can be volatile, but passed FDA trials have more often than not proven very well for these companies. The sky is the limit with their innovative medicine. I believe in the shroomboom and the good it can do for the world and I hope you do too. Diamond hands is the name of the game</p>\n</div><!-- SC_ON -->",
  "score": 1355,
  "permalink": "/r/wallstreetbets/comments/mxqflk/a_case_for_buying_and_holding_mindmed_mnmd/",
  "subreddit": "wallstreetbets",
  "id": "mxqflk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776218100
}