{
  "author": "EthanGibson2",
  "original_created_utc": 1637453131,
  "title": "Anyone else think the idea of the Metaverse sucks?",
  "created_utc": 1637462905,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Is it just me who thinks the Metaverse can flop?</p>\n\n<p>Don&#39;t get it it twisted, I love games but I think the Metaverse can and most likely will flop. Virtual worlds do not appeal to me, especially to the extent that it sounds like it is going to. Some people are referring it to the &quot;new reality&quot; and the &quot;next internet&quot; but I just see it as a go at a overpriced VR game that nobody will pay for.</p>\n\n<p>The amount of money that will have to come out of this will have to be insane. With the amount of money put into this they would end up having to resort to selling thousand dollar gear and equipment used just to play in the Metaverse. And most likely along with a chunk of Crypto needed to start. The lack of need for a Metaverse will prove in people not paying the thousands of dollars to play this.</p>\n\n<p>I can also see a hard sell/dump in the &#39;Metaverse Cryptocurrencies&#39;  as the majority have been going up with hype, and I feel the Metaverse will be a lengthier process than the average holder thinks, which will possibly result in them becoming inpatient and maybe selling.</p>\n\n<p>And if it does succeed, fair enough. I guess I&#39;m just a normal guy and not a multi billionaire and may not see the potential of this project.</p>\n</div><!-- SC_ON -->",
  "score": 168,
  "permalink": "/r/CryptoCurrency/comments/qyicgx/anyone_else_think_the_idea_of_the_metaverse_sucks/",
  "subreddit": "CryptoCurrency",
  "id": "qyicgx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Is it just me who thinks the Metaverse can flop?\n\nDon't get it it twisted, I love games but I think the Metaverse can and most\nlikely will flop. Virtual worlds do not appeal to me, especially to the extent\nthat it sounds like it is going to. Some people are referring it to the \"new\nreality\" and the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "メタヴァースは失敗すると思うのは私だけでしょうか？\n\n誤解を恐れずに言えば、私はゲームが大好きですが、Metaverseは失敗する可能性が高いと思います。\n倒れる可能性が高いと思います。仮想世界は私にとって魅力的ではありません。\n特にそれが起こりそうな範囲で。一部の人々はそれを「新しい現実」と呼んでいます。\n新しい現実」と言っている人もいますし、...",
      "title": "メタヴァースのアイデアが最悪だと思う人はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "只有我认为Metaverse会翻车吗？\n\n别误会，我喜欢游戏，但我认为Metaverse可以而且很可能会失败。\n可能会失败。虚拟世界对我没有吸引力，尤其是在它听起来要达到的程度上。\n这听起来就像它将会这样。有些人把它称为 \"新\n现实 \"和 \"新\"。",
      "title": "还有谁认为Metaverse的想法很糟糕？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "只有我認爲Metaverse會翻車嗎？\n\n別誤會，我喜歡遊戲，但我認爲Metaverse可以而且很可能會失敗。\n可能會失敗。虛擬世界對我沒有吸引力，尤其是在它聽起來要達到的程度上。\n這聽起來就像它將會這樣。有些人把它稱爲 \"新\n現實 \"和 \"新\"。",
      "title": "還有誰認爲Metaverse的想法很糟糕？"
    }
  ]
}