{
  "author": "RasheenHyuga",
  "original_created_utc": 1635701509,
  "title": "Why is relationship advice on Reddit disproportionately negative?",
  "created_utc": 1635730467,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m not talking about obvious cases of abuse, yes leave if you can. I’m talking about situations where people got into one argument about not going on a date that was planned, the comment section will be like, “oh well they obviously don’t care about you at all so you should leave them, it’s clear they hate your guts”. </p>\n\n<p>Like the advice on here is skips all the rational steps and nuance and goes right to shaming and leaving.</p>\n\n<p>Don’t get me wrong there are instances where I’ve seen good advice, but I do think that it disproportionately tends to lean negative. Like someone asked advice about being in an open relationship, the entire comment section was filled with people say “well I couldn’t be in one, and I don’t understand”, that’s not answering the question or contributing at all. No ones asking for you cultural norms.</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/TooAfraidToAsk/comments/qjuehh/why_is_relationship_advice_on_reddit/",
  "subreddit": "TooAfraidToAsk",
  "id": "qjuehh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m not talking about obvious cases of abuse, yes leave if you can. I’m talking\nabout situations where people got into one argument about not going on a date\nthat was planned, the comment section will be like, “oh well they obviously\ndon’t care about you at all so you should leave them, it’s clear…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "明らかな虐待の場合は論外ですが、そうですね、可能であればお帰りください。私が言っているのは\nデートに行かないということで一悶着あったような状況について\nコメント欄は、「ああ、彼らは明らかに \"li \"である。\nということです。",
      "title": "なぜRedditでの恋愛相談は不釣り合いにネガティブなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我说的不是明显的虐待案件，是的，如果你能离开的话。我指的是\n在这种情况下，人们因为不去约会而发生了争执\n我指的是这样的情况：人们因为不去约会而发生争执，而评论区会说：\"哦，他们显然不关心你。\n他们显然根本不关心你，所以你应该离开他们，这很明显......",
      "title": "为什么Reddit上的关系建议不成比例地消极？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我說的不是明顯的虐待案件，是的，如果你能離開的話。我指的是\n在這種情況下，人們因爲不去約會而發生了爭執\n我指的是這樣的情況：人們因爲不去約會而發生爭執，而評論區會說：\"哦，他們顯然不關心你。\n他們顯然根本不關心你，所以你應該離開他們，這很明顯......",
      "title": "爲什麼Reddit上的關係建議不成比例地消極？"
    }
  ]
}