{
  "author": "MarketSeacow",
  "the_new_excerpt": "As we await confirmation of the stimulus bill, it's hard to imagine how much\nroom the market has to run without some kind of correction. It's days like today\nwhere we continue to see the stimulus bill get steadily price in and once the\ngavel hits in Washington I suspect much of it will already be…",
  "original_created_utc": 1608258675,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在我们等待经济刺激法案确认的同时，很难想象会有多少\n市场必须在没有任何调整的情况下运行。就像今天一样\n我们继续看到刺激法案得到稳定的定价，一旦\n小木槌在华盛顿热播我怀疑其中大部分已经是…了",
      "title": "这个股票市场泡沫越来越大，永远不要为获利了结而道歉。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在我們等待經濟刺激法案確認的同時，很難想象會有多少\n市場必須在沒有任何調整的情況下運行。就像今天一樣\n我們繼續看到刺激法案得到穩定的定價，一旦\n小木槌在華盛頓熱播我懷疑其中大部分已經是…了",
      "title": "這個股票市場泡沫越來越大，永遠不要爲獲利了結而道歉。"
    }
  ],
  "title": "This stock market is getting frothy, Never apologize for taking profits",
  "created_utc": 1608269434,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As we await confirmation of the stimulus bill, it&#39;s hard to imagine how much room the market has to run without some kind of correction. It&#39;s days like today where we continue to see the stimulus bill get steadily price in and once the gavel hits in Washington I suspect much of it will already be reflected in the market. Now the one thing that could bolster this rally forward is additional positive vaccine news, whether that be improved distribution or another candidate coming forward with an additional vaccine. My top 5 holdings are Shopify, Salesforce, Pinterest, Apple, and Nvidia so I am not feeling guilty shaving profits off the top, albeit gently. I continue to remain a very longer term investor and am always hesitate to sell but raising 5-10% cash is what&#39;s called risk management, the market doesn&#39;t always go up. I&#39;m always risk on but you&#39;ll never make money if you don&#39;t take profits and have cash on hand waiting for that market correction. I never claim or try to time market moves but we should all live by the philosophy of buy low and sell high, and right now we are high.</p>\n\n<p>&#x200B;</p>\n\n<p>Seacow</p>\n</div><!-- SC_ON -->",
  "score": 475,
  "permalink": "/r/investing/comments/kfc5ts/this_stock_market_is_getting_frothy_never/",
  "subreddit": "investing",
  "id": "kfc5ts",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609260493078
}