{
  "author": "dreadful_name",
  "original_created_utc": 1636200616,
  "title": "Martin Luther writes the 95 theses in 1517. Less than 100 years later the gunpowder plot is planned by rebel Catholics in a majority Protestant England. How can there be such a huge religious shift across Europe in only a few lifetimes?",
  "created_utc": 1636226308,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Religious beliefs are strongly felt and key to people’s every day lives. How could it be that this shift was so large even among the general population?</p>\n\n<p>And of course why was this change so large in England and Scotland but not in Ireland? If the argument is one of brute force, the monarchy was never shy of using that across the Irish Sea.</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/AskHistorians/comments/qnyy9j/martin_luther_writes_the_95_theses_in_1517_less/",
  "subreddit": "AskHistorians",
  "id": "qnyy9j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Religious beliefs are strongly felt and key to people’s every day lives. How\ncould it be that this shift was so large even among the general population?\n\nAnd of course why was this change so large in England and Scotland but not in\nIreland? If the argument is one of brute force, the monarchy was…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "宗教的な信念は強く感じられ、人々の日々の生活の鍵となっています。どうして\n一般の人々の間でも、このような変化があったのでしょうか。\n\nもちろん、イングランドとスコットランドではこれほど大きな変化があったのに、アイルランドではなかったのはなぜでしょう？\nアイルランドではないのか？もし、力ずくの議論であれば、王政は...",
      "title": "1517年、マルティン・ルターが「95ヶ条の論題」を執筆。それから100年も経たないうちに、プロテスタントが多数を占めるイギリスで、反乱を起こしたカトリック教徒が火薬事件を計画します。わずか数年の間に、ヨーロッパ中でこれほどまでに大きな宗教的変化が起きたのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "宗教信仰是人们强烈感受到的，是人们每天生活的关键。为什么\n为什么这种转变在普通民众中也如此之大？\n\n当然，为什么这种变化在英格兰和苏格兰如此之大，而在中国却没有？\n爱尔兰却没有？如果以蛮力为论据，君主制是...",
      "title": "马丁-路德在1517年写下了95条论纲。不到100年后，反叛的天主教徒在新教占多数的英国策划了火药阴谋。在短短几辈子的时间里，整个欧洲怎么会有如此巨大的宗教转变？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "宗教信仰是人們強烈感受到的，是人們每天生活的關鍵。爲什麼\n爲什麼這種轉變在普通民衆中也如此之大？\n\n當然，爲什麼這種變化在英格蘭和蘇格蘭如此之大，而在中國卻沒有？\n愛爾蘭卻沒有？如果以蠻力爲論據，君主制是...",
      "title": "馬丁-路德在1517年寫下了95條論綱。不到100年後，反叛的天主教徒在新教佔多數的英國策劃了火藥陰謀。在短短几輩子的時間裏，整個歐洲怎麼會有如此巨大的宗教轉變？"
    }
  ]
}