{
  "author": "inverseyourself",
  "the_new_excerpt": "Thesis: GME short interest may stand at minimum 107% since January 27th. Only\n35% of pre-squeeze shorts may have been covered since January 27th.\n\n------\n\nI) The Short Interest Numbers\n\nShort interest (\"SI\") is calculated by shares shorted over total outstanding\nshares. See…",
  "original_created_utc": 1613239724,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "论文。自1月27日以来，GME的空头利息可能最低为107%。只有\n自1月27日以来，35%的前期空头可能已被套牢。\n\n------\n\n一）空仓数字\n\n空头利息（\"SI\"）是按做空的股份数除以总流通股数计算的。\n股份。看...",
      "title": "GME的空头权益可能超过了100%--问题不在于它是否被过度透支，而在于它可能被透支到哪一个>100%。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "論文。自1月27日以來，GME的空頭利息可能最低爲107%。只有\n自1月27日以來，35%的前期空頭可能已被套牢。\n\n------\n\n一）空倉數字\n\n空頭利息（\"SI\"）是按做空的股份數除以總流通股數計算的。\n股份。看...",
      "title": "GME的空頭權益可能超過了100%--問題不在於它是否被過度透支，而在於它可能被透支到哪一個>100%。"
    }
  ],
  "title": "GME short interest may be over >100% - the question appears NOT IF it is over-shorted, but WHICH >100% it may be",
  "created_utc": 1613249043,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Thesis: GME short interest may stand at minimum 107% since January 27th. Only 35% of pre-squeeze shorts may have been covered since January 27th.</strong></p>\n\n<p><strong>------</strong></p>\n\n<p><strong>I) The Short Interest Numbers</strong></p>\n\n<p>Short interest (&quot;SI&quot;) is calculated by shares shorted over total outstanding shares. <em>See</em> <a href=\"https://www.investopedia.com/terms/s/shortinterest.asp\"><em>https://www.investopedia.com/terms/s/shortinterest.asp</em></a>. Apparently other firms have used different versions of float. All other forms of float are likely incorrect, and not likely used by Finra. <strong>This is an important assumption</strong> - if I am wrong here, then fuck.</p>\n\n<p>Edit (to above): Some people are suggesting my float is wrong. That is exactly my point. I am using float as outstanding shares b.c we don&#39;t know what it is. If someone actually knows the float used by FINRA, post it; this post is then useless.</p>\n\n<p>Total outstanding shares of GME is 69.75 million. <em>See</em> <a href=\"https://finance.yahoo.com/quote/GME/key-statistics/\">https://finance.yahoo.com/quote/GME/key-statistics/</a>.</p>\n\n<p>Finra SI of GME is .78 as of January 27th. <em>See</em> <a href=\"http://finra-markets.morningstar.com/MarketData/EquityOptions/detail.jsp?query=126%3A0P000002CH&amp;sdkVersion=2.58.0\"><em>http://finra-markets.morningstar.com/MarketData/EquityOptions/detail.jsp?query=126%3A0P000002CH&amp;sdkVersion=2.58.0</em></a>.</p>\n\n<p>.78*69.75 million = 54.405m. Thus, 54.045m million shares are short GME of January 27th.</p>\n\n<p>To calculate real SI, we remove insider ownership. <strong>Another big assumption</strong>. Insider ownership stands at 19.06m. <em>See</em> <a href=\"https://finance.yahoo.com/quote/GME/insider-transactions/\">https://finance.yahoo.com/quote/GME/insider-transactions/</a>.</p>\n\n<p>Thus, free float is outstanding shares <em>less</em> insider ownership shares. 50,750,000 shares.</p>\n\n<p><strong>Real SI appears, at minimum, 1.07 (54.405m/50.750m).</strong></p>\n\n<p>----</p>\n\n<p><strong>II) The Shorts Remaining and Covered</strong></p>\n\n<p>On January 15th, GME SI stood at 121%. <em>See</em> <a href=\"https://www.nasdaq.com/articles/are-these-the-best-heavily-shorted-stocks-to-buy-right-now-5-names-to-watch-2021-01-31\">https://www.nasdaq.com/articles/are-these-the-best-heavily-shorted-stocks-to-buy-right-now-5-names-to-watch-2021-01-31</a>.</p>\n\n<p>Thus, from January 15th to the 27th, we know at least 84.397m shares were shorted. (1.21*outstanding shares).</p>\n\n<p>By January 27th, 54.405m shorts remained (previous short amounts minus current shorts remaining as of 1.27). The number of shorts that covered from Jan. 15th to the 27th was was 29.992m. 29.992m/84.397m shares = ~35%. Thus, 65% of shorts pre-squeeze remain, owing APR.</p>\n\n<p>Around ~35% of covering resulted in a 1,600% rise. Thus, a 65% cover rate (conservative) can yield a 2,971% rise. Let’s apply this math to now. From $50, this is a $1,485.50 GME price result. Could this happen? No idea. Notice the problem with this: I&#39;m assuming <em>only</em> covering led to this rise. So this is simply a demonstrative point.</p>\n\n<p><strong>New shorts from Jan. 27th to present likely opened at higher prices. 65% of those from $5, $10, $20, etc., probably remain. This is bad news for HF&#39;s.</strong></p>\n\n<p><strong>III) The Effect</strong></p>\n\n<p>Based on estimated remaining covers, price stagnation at $50 could result in further covering and collateral calls. This burden is reduced if HF&#39;s opened new shorts at the peak and they are substantially ITM. This part is unclear. We know it&#39;s very likely that HF&#39;s opened new shorts at the peak--- what isn&#39;t clear is that it was within their risk department&#39;s policy to open new shorts during a fucking squeeze. In my opinion, it wasn&#39;t until drops below &lt;$200 the HF&#39;s felt safe opening up new shorts. This is a substantial point: if the new shorts are at much lower price points than thought, then the pain points for HF&#39;s are far lower. It&#39;s just unclear. Nonetheless, HF&#39;s may be bleeding substantially every week because of those remaining shorts.</p>\n\n<p>A good counter is that borrow rates currently seem low. <em>See</em> <a href=\"https://iborrowdesk.com/report/GME\">https://iborrowdesk.com/report/GME</a>. You&#39;d think these are correlated markets, so the most shorted stock on the market would have higher borrow rates. Borrow rates could be low because it&#39;s no longer shorted. Or because there is no volume on the stock. I don&#39;t know more beyond this. Feel free to debate.</p>\n\n<p>Moreover, consider the current liquidity and volume of $GME. It appears that retail buying power is spent. People either cashed out or are holding. So, they are unlikely to trigger the next squeeze - or a gamma one for that matter. Thus, the fighting grounds has likely gone institutional. Not all hedge funds are short $GME - nor are all financial whales. In my view, this has become an institutional fight, with both sides pointing the gun at each other, waiting who&#39;s going to pull the trigger first. Retail is simply on the sidelines, holding the clips in for both their guns (smirking, of course). How long until every chump with a few million bucks laying around realizes this is still the most shorted stock on the market before they infuse substantial buying pressure? My reservations in these predictions is that HF&#39;s are smart, they can&#39;t be fooled twice, etc, and all of that non-sense. But before intelligence comes greed. And I know greed and desperation has always governed the financial system.</p>\n\n<p><strong>IV) Parting Thoughts</strong></p>\n\n<p>It would take a half-brained monkey 45 seconds to crunch the short interest numbers. Yet Finra was late (posted after hours I think). This is the most shorted stock on the market according to my numbers - yet, again, <strong>dead silence</strong> from the mainstream media. Sources are using various version of float to calculate SI, as if suddenly short interest is something that be manipulated based on our interests. Americans with $2,000 in their checkings account are being investigated for stock fraud.</p>\n\n<p>The Big Short is illustrative. It depicts how corruption and fraud has always been the building blocks of our financial institutions. Put differently, fraud doesn&#39;t just pervade the system - nay, it <strong><em>is</em></strong> the system. Everything I&#39;ve seen <em>just doesn&#39;t feel right</em>. Understand at this point I&#39;m speculating. But I trust my gut.</p>\n\n<p>There are also posts suggesting OTM/ITM options are encouraging institutional price manipulations of $GME. This is beyond my knowledge span. However, if you looked at the bid-ask spreads this week of $GME, they were at times pennies apart for days. I&#39;ve never seen that before. Seriously, <strong>what the fuck.</strong></p>\n\n<p>DFV is testifying alongside the CEO&#39;s of Robinhood, Citadel, and Melvin Capital. Next Thursday is a day to watch for me. Again $GME will be the most discussed and watched stock in America - and, arguably, the globe. Americans <em>and the world</em> will be reminded why their holdings in $GME tanked 50-90%. For many, their life savings. No, it wasn&#39;t a result of imprudent investments -- to invest money into a squeezing stock is a <em>good</em> idea short-term. It was the clearing houses pulling the plugs because <em>the financial system was never designed for working people to make that much money. So when the risk of you getting that rich increased, they stopped the game (pun intended)</em>. We don&#39;t even need to get into whether there was intentional collusion - that&#39;s just speculation, and it doesn&#39;t even matter to establish how messed up this is. But think of how this plays out: these institutions either bullshit their way through the hearing and everyone and their moms sees past it. Or they tell you the truth that, based on risk management and capital models, they never thought retail would get that rich that fast. Either way, I don&#39;t think it&#39;ll play out well for them other than DFV on national television. A key element here: AOC grilling the hell out of these folks.</p>\n\n<p>And to set the record straight, I don&#39;t think retail is propping $GME at $50 because they have diamond hands -- middle America is holding because <em>they have nothing to lose</em> after the clearing houses and Robinhood tanked their portfolios by over half. <strong>So their plan to kill off retail interest backfired.</strong> In the process of stunting buying pressure, they inadvertently made all of working America diamond holders. Poetic justice - and fucking hilarious.</p>\n\n<p>Look, I&#39;m not demonizing rich people. We all want financial freedom. I&#39;m demonizing cheating the game. However this ends one thing is clear: The Big Squeeze is going to be an epic movie.</p>\n\n<p><strong>TLDR: it&#39;s in the damn title.</strong></p>\n\n<p>--</p>\n\n<p><strong>Disclaimer because working people are vilified when the financial system is exposed - does this sound familiar? It should because it&#39;s a reoccurring pattern. When rich people lose, poor people are blamed and we foot the bill:</strong> I&#39;m a random guy on the internet stating my opinions so if you take my advice to do anything without your own research, you are dumb. If you disagree with anything I&#39;ve said, comment below and counter me. I don&#39;t want an echo chamber. Not a GME promotion, just more DD.</p>\n</div><!-- SC_ON -->",
  "score": 5489,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/n_t58JjBdsBeItiZjIgq7lQbKBPO2D2EmPQCMvkhKvs.jpg?auto=webp&s=a138c5c9fc5dd2337a3bbdf146670cda2d397691",
          "width": 205,
          "height": 136
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/n_t58JjBdsBeItiZjIgq7lQbKBPO2D2EmPQCMvkhKvs.jpg?width=108&crop=smart&auto=webp&s=3a69c5d85bfccfa4a2eb951d23a941f08255234e",
            "width": 108,
            "height": 71
          }
        ],
        "variants": {},
        "id": "ZAxlKr6mU8VSUMjDi9u08vxnkyGMK_eS7qGrDUrzlyk"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/wallstreetbets/comments/lj5op8/gme_short_interest_may_be_over_100_the_question/",
  "subreddit": "wallstreetbets",
  "id": "lj5op8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728630014
}