{
  "author": "Lemons_for_Sale",
  "original_created_utc": 1655708168,
  "title": "I Am 66% Slave",
  "created_utc": 1655771504,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I recently read Knut Svanholm’s “Bitcoin: Everything Divided by 21 Million” and within the book there is a section that discusses all of the various ways we are taxed on our time.&lt;/p&gt;\n\n&lt;p&gt;There are explicit taxes that impact me and my earning potential such as income taxes, property taxes, sales taxes, payroll taxes, state and local taxes. There are also implicit taxes that affect me in ways that are a bit more difficult to quantify like inflation (an invisible tax that diminishes the purchasing power for the dollars I keep) and corporate taxes (revenue that could have all or in part gone into employee salaries). &lt;/p&gt;\n\n&lt;p&gt;Months prior I listened to a podcast with Robert Breedlove where he discussed the idea that one’s effective tax rate is a representation of how much a slave one is to the state. A statement I felt was bold, but the argument was interesting: what is slavery if not a 100% tax on your time and energy? &lt;/p&gt;\n\n&lt;p&gt;I decided to take the challenge and determine how much a &amp;quot;slave&amp;quot; I really am. I reviewed my paycheck, my property tax bill, my monthly purchases and my state tax rate. The result surprised me to say the least. &lt;/p&gt;\n\n&lt;p&gt;Here are the numbers represented as a percentage of my gross income: &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Federal Income Tax: 26.16% &lt;/li&gt;\n&lt;li&gt;State Income Tax: 10.66% &lt;/li&gt;\n&lt;li&gt;Medicare Tax: 2.16% &lt;/li&gt;\n&lt;li&gt;Disability Tax: 1.64% &lt;/li&gt;\n&lt;li&gt;Social Security Tax: 9.25% &lt;/li&gt;\n&lt;li&gt;Property Tax: 4.94% &lt;/li&gt;\n&lt;li&gt;Monthly Expense Sales Tax (@ 7.75% rate): 2.71% &lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Total Tax: 57.52%&lt;/strong&gt; &lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;And that’s just explicit taxes. The latest Consumer Price Inflation print for June 2022 was 8.6%. Simply adding the CPI figure into the sum puts me at a 66.12% total tax rate. &lt;/p&gt;\n\n&lt;p&gt;For every 3 hours of work, the value created by 2 is taken from me and given to the government. &lt;/p&gt;\n\n&lt;p&gt;I am 66% slave. How about you?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 331,
  "permalink": "/r/Bitcoin/comments/vgf8sy/i_am_66_slave/",
  "subreddit": "Bitcoin",
  "id": "vgf8sy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I recently read Knut Svanholm’s “Bitcoin: Everything Divided by 21 Million” and\nwithin the book there is a section that discusses all of the various ways we are\ntaxed on our time.\n\nThere are explicit taxes that impact me and my earning potential such as income\ntaxes, property taxes, sales taxes,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、Knut Svanholmの「Bitcoin: Everything Divided by 21 Million」を読みました。\nこの本の中で、私たちが時間に対して課税されている様々な方法について論じている部分があります。\nこの本の中で、私たちが時間に対して課税されるさまざまな方法について論じている部分があります。\n\nこの本の中で、私たちの時間に対して課されるさまざまな税金について説明しています。\n税金、固定資産税、消費税...。",
      "title": "アイ・アム・66%・スレイブ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近读了Knut Svanholm的《比特币：一切除以2100万》。\n书中有一节讨论了我们被征收时间税的各种方式。\n对我们的时间征税。\n\n有一些明确的税收影响到我和我的收入潜力，如所得税\n税、财产税、销售税......",
      "title": "我是66%的奴隶"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近讀了Knut Svanholm的《比特幣：一切除以2100萬》。\n書中有一節討論了我們被徵收時間稅的各種方式。\n對我們的時間徵稅。\n\n有一些明確的稅收影響到我和我的收入潛力，如所得稅\n稅、財產稅、銷售稅......",
      "title": "我是66%的奴隸"
    }
  ]
}