{
  "author": "daemonboy19",
  "original_created_utc": 1644490812,
  "title": "Do people visually check toilet paper to know when to stop wiping?",
  "created_utc": 1644512295,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I (UK M 31) read something the other day that went like this; &amp;quot;How do blind people know when to stop wiping?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;It really threw me, and I didn&amp;#39;t get it until I looked at the comments and figured out what people were talking about.&lt;/p&gt;\n\n&lt;p&gt;Is this something that everybody does? Visually check that the paper is clean so they can stop wiping? Growing up I was never taught this, so I never knew about it until recently - I&amp;#39;ve just always known when I&amp;#39;m clean and can get on with my day.&lt;/p&gt;\n\n&lt;p&gt;I wipe front-to-back, reaching from behind, but maybe that is why I never see the TP as it goes straight in the loo.&lt;/p&gt;\n\n&lt;p&gt;Please tell me I&amp;#39;m not the only one!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 154,
  "permalink": "/r/TooAfraidToAsk/comments/sp413f/do_people_visually_check_toilet_paper_to_know/",
  "subreddit": "TooAfraidToAsk",
  "id": "sp413f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I (UK M 31) read something the other day that went like this; \"How do blind\npeople know when to stop wiping?\"\n\nIt really threw me, and I didn't get it until I looked at the comments and\nfigured out what people were talking about.\n\nIs this something that everybody does? Visually check that the paper…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私（UK M 31）は先日、「目の見えない人はどうやっているのか」というようなことを読みました。\nを、いつ拭き取るのをやめるか知っていますか？\n\n本当にびっくりして、コメントを見て初めて理解できたんです。\nということです。\n\nこれは誰もがやっていることなのでしょうか？目視で紙を確認する...",
      "title": "トイレットペーパーは、拭くのをやめるタイミングを目視で確認しているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我（英国M31）有一天读到这样的内容；\"盲人如何\n人如何知道何时停止擦拭？\"\n\n这真的让我很困惑，直到我看了评论才明白。\n直到我看了看评论，弄明白了人们在谈论什么。\n\n这是每个人都会做的事情吗？视觉上检查纸张是否...",
      "title": "人们会目测卫生纸以知道何时停止擦拭吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我（英國M31）有一天讀到這樣的內容；\"盲人如何\n人如何知道何時停止擦拭？\"\n\n這真的讓我很困惑，直到我看了評論才明白。\n直到我看了看評論，弄明白了人們在談論什麼。\n\n這是每個人都會做的事情嗎？視覺上檢查紙張是否...",
      "title": "人們會目測衛生紙以知道何時停止擦拭嗎？"
    }
  ]
}