{
  "author": "Tricky_Troll",
  "original_created_utc": 1625637408,
  "title": "Let's clear up the facts around EIP-1559, the merge/triple halving and ЕТН becoming a deflationary asset.",
  "created_utc": 1625650514,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m finding it incredible just how many people in crypto are confusing the triple halvening/cliffening which comes with the merge and EIP-1559. I have seen multiple YouTubers (and not the shitty bybit link shilling, shitcoin pumping kind) and many people on Reddit thinking that the cliffening is happening in the next month with EIP-1559. The amount of misinformation is frustrating. People are going to look at EIP-1559&#39;s respectable change to ETH supply (but not dramatic like the merge) and claim &quot;oOh, LoOk, EIP-1559 diDn&#39;T MaKe eThEReuM DefLaTioNaRy!&quot; When in reality, EIP-1559 was never going to make ETH deflationary except for when gas fees were well into the hundreds of Gwei, something which is unlikely to last now that layer twos are taking off.</p>\n\n<p>Anyway, let me clarify for anyone who is still unsure:</p>\n\n<ul>\n<li><p><strong>EIP-1559</strong> will reduce the ETH going to miners by an estimated 30% and burn most of the transaction fees going forwards (it will also make gas fees <em>a lot</em> more stable. No more guessing what to pay to get into the next block!). This means ~30% less constant selling pressure from miners and anywhere between 0.5 and 5% of the ETH supply being burned each year. Most likely about 1-2% of supply per year based on gas fees over the last year. This would still leave ETH with a net inflation rate of about 1.5-3%.</p></li>\n<li><p><strong>The Merge/The triple halvening/the cliffening</strong> or whatever you want to call it is the move from Proof of Work to Proof of Stake. To do this, we will be merging the ETH 1 PoW blockchain with the ETH 2.0 PoS blockchain (which currently is running in parallel and has no transactional functionality, just staking, so if you stake your ETH, you&#39;re moving it to ETH 2 and waiting for a future update to allow for full transactional functionality on ETH 2.0). This upgrade will result in a reduction of annual ETH issuance from 4.5%pa to 0.5%pa since miners no longer need to be paid for all of the electricity they waste when securing the network It is also worth noting that after the merge, Ethereum will be the most secure and most decentralised blockchain with its over 150,000 validators and greater security guarantees from Proof of Stake due to the ability to slash (punish) bad actors. When combined with EIP-1559, this will result in ETH becoming deflationary or &quot;ultra sound money&quot; since the fees burned through EIP-1559 will be greater in value than new ETH given to validators/stakers. This upgrade is currently looking like it will go live in Q1 2022.</p></li>\n</ul>\n\n<p>Finally, I would like to give my own 2 wei on the effects of these upgrades. For over a decade now the crypto market cycles have revolved around the Bitcoin halvings when the supply of new coins going to miners halves. This is important because miners are majority sellers. They have electricity bills to pay and so the inflation from new coins is almost always being dumped on the market. If halving this amount can consistently create a parabolic run, then what do you think will happen when Ethereum gets rid of it entirely? There will be no automatic sellers and what little ETH is given to validators will be less likely to be sold as stakers by nature are ETH holders and don&#39;t have electricity costs to offset. Meanwhile, ETH is still sitting at a middle ground ETH/BTC ratio compared to the low and its 2017 highs set in a time when ETH had no apps, no DeFi, barely any NFTs except crypto punks, ETH 2.0 and PoS were still a pipe dream and there were no layer 2 scaling solutions. At some point the market will realise the significance of this supply shock and the price will adjust accordingly. Until then, I will keep on stacking ETH.</p>\n</div><!-- SC_ON -->",
  "score": 198,
  "permalink": "/r/CryptoCurrency/comments/ofcxrn/lets_clear_up_the_facts_around_eip1559_the/",
  "subreddit": "CryptoCurrency",
  "id": "ofcxrn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm finding it incredible just how many people in crypto are confusing the\ntriple halvening/cliffening which comes with the merge and EIP-1559. I have seen\nmultiple YouTubers (and not the shitty bybit link shilling, shitcoin pumping\nkind) and many people on Reddit thinking that the cliffening is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号関係者の多くが、マージとEIP-1559に伴うトリプルハルベン/クリフニングを混同しているのは信じられないことです。\nマージとEIP-1559のトリプルハルベニング/クリフニングを混同している暗号関係者の多さに驚かされます。私が見たのは\n複数のYouTuber（bybitのリンクを押し売りするようなクソみたいなものではなく、クソコインを押し売りするようなもの）やRedditの多くの人たちが、トリプルフランベンを混同しているのを見ました。\nまた、Redditでは、クリフニングは...と考えている人が多いようです。",
      "title": "EIP-1559、マージ/トリプルハーフ化、ЕТНのデフレ資産化について、事実を整理してみましょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我发现令人难以置信的是，有多少人在加密货币中混淆了\n伴随着合并和EIP-1559的三重减弱/裂解。我已经看到\n多名优酷网友（不是那种低劣的bybit链接推销，拉屎币的人\n的那种）和Reddit上的许多人都认为悬崖效应是...",
      "title": "让我们围绕EIP-1559、合并/三倍减半和ЕТН成为通缩资产的事实进行澄清。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我發現令人難以置信的是，有多少人在加密貨幣中混淆了\n伴隨着合併和EIP-1559的三重減弱/裂解。我已經看到\n多名優酷網友（不是那種低劣的bybit鏈接推銷，拉屎幣的人\n的那種）和Reddit上的許多人都認爲懸崖效應是...",
      "title": "讓我們圍繞EIP-1559、合併/三倍減半和ЕТН成爲通縮資產的事實進行澄清。"
    }
  ]
}