{
  "author": "barbkisser",
  "the_new_excerpt": "Even if it was in high school, but it was the first ever serious relationship.\nIs it relatively true that men have a hard time moving on from their first love?\nI believe and I hope I am the first love lol. But do men ever just move on from\ntheir first ever girlfriend? If so, how long does it…",
  "original_created_utc": 1611162296,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "即使是在高中，但那是有史以来第一次认真的恋爱。\n相对来说，男人很难从初恋中走出来，这是真的吗？\n我相信，也希望自己是初恋，我。但是，男人有没有从\n他们的第一个女朋友？如果是这样，多久... ...",
      "title": "对于大多数男人都没有完全摆脱初恋的说法，你怎么看？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "即使是在高中，但那是有史以來第一次認真的戀愛。\n相對來說，男人很難從初戀中走出來，這是真的嗎？\n我相信，也希望自己是初戀，我。但是，男人有沒有從\n他們的第一個女朋友？如果是這樣，多久... ...",
      "title": "對於大多數男人都沒有完全擺脫初戀的說法，你怎麼看？"
    }
  ],
  "title": "What do you think about the saying that most men don’t ever fully move on from their first love?",
  "created_utc": 1611241148,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Even if it was in high school, but it was the first ever serious relationship. Is it relatively true that men have a hard time moving on from their first love? I believe and I hope I am the first love lol. But do men ever just move on from their first ever girlfriend? If so, how long does it normally take? Or if not, do you constantly compare your first love to current lovers?</p>\n\n<p>EDIT: a lot of you have said that you haven’t heard of this saying, well that isn’t very surprising but I have heard it in movies and sometimes posts were it got at least 100k likes. <a href=\"https://youtu.be/rfxlUZpLEPA\">Here are some insights</a> </p>\n\n<p>EDIT (1): Some of you have pointed out why I decided to ask this question while I am the first love. I don’t know really. The quote just got to my mind and it’s stuck. I am the first love and long term (3 years now). A lot of things have changed and I figured if we ever break up, I’m gonna have a very hard time moving on since this relationship took a lot from me. I was just wondering if the general opposite sex also felt this way. Turns out no, lel.</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskMen/comments/l1dbca/what_do_you_think_about_the_saying_that_most_men/",
  "subreddit": "AskMen",
  "id": "l1dbca",
  "is_self": true,
  "media": null,
  "is_video": false
}