{
  "author": "E-renter",
  "original_created_utc": 1635666118,
  "title": "Exactly 4 years aka 1 halving cycle in Bitcoin and what I've learned",
  "created_utc": 1635708660,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>On Halloween Day 2017 I purchased my first ever Bitcoin, literally the same day the announcement of CME futures came, which finally convinced my stubborn old brain that Bitcoin was a serious financial instrument. I eventually came to learn that Bitcoin is the hardest money on Earth. I continued to purchase Bitcoin over the next 3 years or so. My average purchase price was approximately $10,000 Canadian per Bitcoin. </p>\n\n<p>During the last 4 years aka 1 having cycle, I also did a lot of trading of shitcoins as well as attempting some ETH mining. Overall this was not profitable as measured in Bitcoin. When I divide my total 4-year costs in CAD by the average price per Bitcoin I paid, I calculate that I only have 75.3% of the Bitcoin I could have had if I just put all that money on Bitcoin and held it. I do hold one other coin which I&#39;m bullish on long-term, but I&#39;m not going to shill that here. When you account for the current value of that other coin I currently have 80.8% of the Bitcoin value that I would have had if I would have simply put all of the money onto Bitcoin and held it.</p>\n\n<p>I am actually fortunate that I hold 75.3% of my would-be Bitcoin stack, and 80.8% if you account for my only other major crypto holding. It could have been much worse. I&#39;m hopeful over the next 4 years that my other holding will grow vs. BTC to allow me to get back to 100% of my would-be stack, which is all I&#39;m looking for. I have no intention of drawing down any of my remaining Bitcoin to try to accelerate that effort. My remaining Bitcoin is in full hodl mode.</p>\n\n<p>The lesson for me in retrospect is buy Bitcoin, full stop. Attempts to mine or trade shitcoins are very likely going to take away from rather than add to your stack as measured in Bitcoin. Bottom line? People who are new purchasers of Bitcoin this year might consider just buying and hodling. But then again a lot of us have to learn things the hard way.</p>\n\n<p>That&#39;s all for now friends, see you in 4 more years, and Happy Halloween!</p>\n</div><!-- SC_ON -->",
  "score": 162,
  "permalink": "/r/Bitcoin/comments/qjkn9k/exactly_4_years_aka_1_halving_cycle_in_bitcoin/",
  "subreddit": "Bitcoin",
  "id": "qjkn9k",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "On Halloween Day 2017 I purchased my first ever Bitcoin, literally the same day\nthe announcement of CME futures came, which finally convinced my stubborn old\nbrain that Bitcoin was a serious financial instrument. I eventually came to\nlearn that Bitcoin is the hardest money on Earth. I continued to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2017年のハロウィンの日に、私は初めてビットコインを購入しましたが、文字通り同じ日に\nCME先物の発表があり、私の頑固な古い脳をようやく納得させることができました。\n頑固な私の脳に、ビットコインが真面目な金融商品であると確信させてくれました。私は最終的には\nビットコインは地球上で最も難しいお金であることを知りました。私はその後も...",
      "title": "ビットコインのちょうど4年目、別名1回の半減サイクルと私が学んだこと"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在2017年万圣节那天，我购买了我的第一个比特币，实际上是在同一天\n宣布了CME期货的消息，这终于说服了我这个顽固的老家伙\n的大脑，认为比特币是一种严肃的金融工具。我最终了解到\n了解到比特币是地球上最硬的货币。我继续...",
      "title": "整整4年，也就是比特币的1个减半周期，我学到了什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在2017年萬聖節那天，我購買了我的第一個比特幣，實際上是在同一天\n宣佈了CME期貨的消息，這終於說服了我這個頑固的老傢伙\n的大腦，認爲比特幣是一種嚴肅的金融工具。我最終了解到\n瞭解到比特幣是地球上最硬的貨幣。我繼續...",
      "title": "整整4年，也就是比特幣的1個減半週期，我學到了什麼？"
    }
  ]
}