{
  "author": "orangered77",
  "original_created_utc": 1637112759,
  "title": "Is there such thing as paying someone to \"cuddle\" and/or have physical intimacy with you without having sex and/or intercourse?",
  "created_utc": 1637127066,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was just wondering if there is such thing as a person you can pay to have physical intimacy with you and talk  that would involve getting close to each other (like sitting on lap , hugging or touching of only certain body parts) but have no sex or any intercourse of any kind.</p>\n\n<p>Would this be considered any kind of a hooker or a prostitute or it is something different?</p>\n\n<p>Not sure.</p>\n</div><!-- SC_ON -->",
  "score": 130,
  "permalink": "/r/TooAfraidToAsk/comments/qvno5z/is_there_such_thing_as_paying_someone_to_cuddle/",
  "subreddit": "TooAfraidToAsk",
  "id": "qvno5z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was just wondering if there is such thing as a person you can pay to have\nphysical intimacy with you and talk that would involve getting close to each\nother (like sitting on lap , hugging or touching of only certain body parts) but\nhave no sex or any intercourse of any kind.\n\nWould this be…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "お金を払えば肉体関係を持ってくれて、話もしてくれる人っているのかなと思っていました。\nお金を払って肉体的な親密さを得ることができる人はいるのだろうか？\n膝に座ったり、ハグをしたり、体の一部だけを触ったりするような）肉体的な親密さはあっても、セックスや性交はしない。\nしかし、セックスやいかなる種類の性交はありません。\n\nこれは...",
      "title": "セックスや性交をせずに、お金を払って \"cuddle \"や肉体的な親密さを得ることはありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我只是想知道是否有这样的人，你可以花钱让他与你进行身体上的亲密接触，并与你交谈。\n与你进行身体上的亲密接触，并与你交谈，这将涉及到接近对方\n彼此亲近（如坐在腿上，拥抱或只触摸某些身体部位），但没有性或任何形式的性交。\n没有性行为或任何形式的性交。\n\n这是否是...",
      "title": "有没有这样的事情，即花钱让人 \"拥抱 \"和/或与你进行身体亲密接触而不发生性关系和/或性交？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我只是想知道是否有這樣的人，你可以花錢讓他與你進行身體上的親密接觸，並與你交談。\n與你進行身體上的親密接觸，並與你交談，這將涉及到接近對方\n彼此親近（如坐在腿上，擁抱或只觸摸某些身體部位），但沒有性或任何形式的性交。\n沒有性行爲或任何形式的性交。\n\n這是否是...",
      "title": "有沒有這樣的事情，即花錢讓人 \"擁抱 \"和/或與你進行身體親密接觸而不發生性關係和/或性交？"
    }
  ]
}