{
  "author": "podcastquestions",
  "original_created_utc": 1642001803,
  "title": "I've been getting paid $80k a year for the last 5 years doing absolutely no work and I don't plan on changing a thing",
  "created_utc": 1642027694,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;throwaway - I am an account manager for a telecom company that provides VOIP phones to companies. There are about 20 of us and our job is primarily to answer any questions about the phones, the service, billing, etc. We have hundreds of clients. &lt;/p&gt;\n\n&lt;p&gt;What the boss does is assign clients to each of us based on a rating of how challenging and difficult they believe the end users are. Each client gets a score of 1-10. 1 meaning these are employees at microsoft who are all very techy and will never have to call us asking where they should plug in the ethernet port, and 10 because the client is an old age home and we will get five calls a day from each resident asking how to get a dial tone.&lt;/p&gt;\n\n&lt;p&gt;So one account manager may be assigned a client who has 5,000 employees, but they are rated a 1, so it provides them just enough work for 40 hours a week, while another account manager may get a client who only has 100 employees, but they are all tech idiots and call in constantly.&lt;/p&gt;\n\n&lt;p&gt;Well when I started, I got assigned a  client with a few hundred employees who were rated a 10, so their &amp;quot;algorithm&amp;quot; predicated that it would be just the right amount of work to keep me busy. As it turns out, the client is a highly skilled tech company that actually writes the software for the phones we support, and their rating should have been a 1, not a 10 &lt;/p&gt;\n\n&lt;p&gt;I get 1-2 calls a week and literally nothing else. When it first was clear that they messed up the rating system, I was a good little employee and notified my manager that they may have not allocated the proper amount of work. I was told that their rating system is near perfect and I should not stir the pot.&lt;/p&gt;\n\n&lt;p&gt;So I have not stirred the pot for 5 years. My last call for support was 9 days ago and I literally browse the web all day and attend the occasional meeting. I get my 5% annual raise and full benefits. I will continue until I get caught or something better comes along. Oh, I am work from home full time.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;edit&lt;/em&gt; - a lot of comments telling me to delete this post but I changed enough about the technology and rating system that I am not worried. Having said that, I have been getting very threatening DMs from some very angry people threatening to do everything in their power to DOX and report me, so this post will be deleted shortly.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 75163,
  "permalink": "/r/antiwork/comments/s294dh/ive_been_getting_paid_80k_a_year_for_the_last_5/",
  "subreddit": "antiwork",
  "id": "s294dh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "throwaway - I am an account manager for a telecom company that provides VOIP\nphones to companies. There are about 20 of us and our job is primarily to answer\nany questions about the phones, the service, billing, etc. We have hundreds of\nclients.\n\nWhat the boss does is assign clients to each of us…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "throwaway - 私はVOIPを提供する通信会社のアカウントマネージャーです。\nの電話機は、企業向けのものです。私たちは20人ほどで、私たちの仕事は主に回答することです。\n電話機、サービス、請求書などに関するあらゆる質問。私たちは、数百の\nのクライアントです。\n\nボスは何をするかというと、各自にクライアントを割り当てるのです...。",
      "title": "私はこの5年間、全く仕事をせずに年間8万ドルの給料をもらってきたが、何も変えるつもりはない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "扔掉 - 我是一家电信公司的客户经理，为公司提供VOIP\n电话的电信公司的客户经理。我们有大约20人，我们的工作主要是回答\n任何关于电话、服务、计费等问题。我们有数以百计的\n客户。\n\n老板的做法是将客户分配给我们每个人...",
      "title": "在过去的5年中，我一直拿着8万美元的年薪，完全不做任何工作，我不打算改变任何事情。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "扔掉 - 我是一家電信公司的客戶經理，爲公司提供VOIP\n電話的電信公司的客戶經理。我們有大約20人，我們的工作主要是回答\n任何關於電話、服務、計費等問題。我們有數以百計的\n客戶。\n\n老闆的做法是將客戶分配給我們每個人...",
      "title": "在過去的5年中，我一直拿着8萬美元的年薪，完全不做任何工作，我不打算改變任何事情。"
    }
  ]
}