{
  "author": "AmruthPillai",
  "original_created_utc": 1647059554,
  "title": "Reactive Resume - A free and open source resume builder, now on v3!",
  "created_utc": 1647068872,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello, &lt;a href=\"/r/SideProject\"&gt;r/SideProject&lt;/a&gt;!&lt;/p&gt;\n\n&lt;p&gt;The free and open-source resume builder app you all know and love is now on version 3.0, almost two years since its initial release, and it&amp;#39;s out there!&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Without dwelling into the details too much at once, here are the links of interest:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://rxresu.me/\"&gt;&lt;strong&gt;https://rxresu.me&lt;/strong&gt;&lt;/a&gt; &lt;strong&gt;/&lt;/strong&gt; &lt;a href=\"https://docs.rxresu.me\"&gt;Docs&lt;/a&gt; &lt;strong&gt;/&lt;/strong&gt; &lt;a href=\"https://github.com/AmruthPillai/Reactive-Resume\"&gt;GitHub&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;This new update comes with a lot of new features:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Multiple Pages and Easy Layout Management&lt;/li&gt;\n&lt;li&gt;Import data from LinkedIn, JSON Resume&lt;/li&gt;\n&lt;li&gt;Refreshed UI with a more natural UX&lt;/li&gt;\n&lt;li&gt;Export a PDF within 5 seconds&lt;/li&gt;\n&lt;li&gt;Get customized links to your resume for easy access/sharing&lt;/li&gt;\n&lt;li&gt;Custom-made backend, no more connections to Google/Firebase. Your data is safe, as it has always been.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;The purpose and mission of Reactive Resume has always been to help those who can&amp;#39;t depend on expensive builders or online websites to be able to whip up a neat-looking resume for themselves, gain some confidence and apply to the companies that they aspire to be in.&lt;/p&gt;\n\n&lt;p&gt;As of today, the app had a total of 75,000+ users, with a bit more than 83,000+ resumes generated. This is not data that was tracked, but merely a count of the number of documents. I&amp;#39;ve gotten a couple of donations as well, a bit over $100 in two years, which I&amp;#39;m extremely grateful for. The docker images to self-host Reactive Resume had a whopping 2.4M+ pulls, and finally, the number of stars on GitHub has been a shining 3.5k+ since the past week now.&lt;/p&gt;\n\n&lt;p&gt;These numbers are all great, and for a project that started off as just a little idea for me, I do feel good about it. But nothing makes me feel happier than the thousands of folks who reached out to me through email, GitHub, and LinkedIn to tell me how they loved the app, how it helped them land their first job, and how it gave them the confidence in a competitive world.&lt;/p&gt;\n\n&lt;p&gt;My only wish is that this little project I created reaches the folks who really need it the most, and that can only happen with your help. If your friend is looking for a resume builder, don&amp;#39;t make them use MS Word or pay for an expensive service, suggest Reactive Resume. They, and I, will be thankful to you.&lt;/p&gt;\n\n&lt;p&gt;Thank you for all the love and support. Please try out the new version and let me know what you think about it and if there&amp;#39;s anything I can do to make it better. Always happy to hear from the community.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 6,
  "permalink": "/r/SideProject/comments/tc8gj0/reactive_resume_a_free_and_open_source_resume/",
  "subreddit": "SideProject",
  "id": "tc8gj0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hello, r/SideProject [/r/SideProject]!\n\nThe free and open-source resume builder app you all know and love is now on\nversion 3.0, almost two years since its initial release, and it's out there!\n\nWithout dwelling into the details too much at once, here are the links of\ninterest:\n\nhttps://rxresu.me…"
}