{
  "author": "nDreCoelho",
  "original_created_utc": 1630262288,
  "title": "Popular Opinion: ETH gas fees are delaying the global adoption of crypto",
  "created_utc": 1630294402,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Everyday I see many posts regarding opinions that claim being unpopular while being popular. Therefore I decided to share an opinion I have about ETH that I believe is popular, but not often worded like this.</p>\n\n<p>We all know that ETH as high fees associated with their transactions and the ones on the dapps in the ecosystem. I won&#39;t be dabble too much on this topic as everybody is well versed in it.</p>\n\n<p>What I want to discuss here is my opinion, which I believe most of us have, of ETH gas fees delaying global adoption of crypto. Ethereum is the biggest ecosystem for smart contracts there is. No one can deny that. There are many dapps with great use cases that could be used by the usual retail investor.</p>\n\n<p>However, most small retail investors don&#39;t even try to move their ETH out of the exchanges/wallets due to losing a great percentage of their value on the transaction itself.</p>\n\n<p>Therefore, whenever fees are reduced on the Ethereum roadmap, we&#39;ll see a way more significant inflow of people in dApps (knowing that a lot of them are in the Ethereum ecosystem) and a global adoption of their technology.</p>\n\n<p>What do you guys think?</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/pe0xt3/popular_opinion_eth_gas_fees_are_delaying_the/",
  "subreddit": "CryptoCurrency",
  "id": "pe0xt3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Everyday I see many posts regarding opinions that claim being unpopular while\nbeing popular. Therefore I decided to share an opinion I have about ETH that I\nbelieve is popular, but not often worded like this.\n\nWe all know that ETH as high fees associated with their transactions and the\nones on the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "毎日のように、人気があるのに人気がないと主張する意見の投稿を多く見かけます。\n人気があるのに人気がないと主張する意見の投稿を毎日のように目にします。そこで、私がETHについて持っている意見を紹介することにしました。\nこのような言い方はあまりありません。\n\nETHの取引には高い手数料がかかることは誰もが知っています。\nにあるものは...",
      "title": "人気のある意見。ETHのガス料金が世界的な暗号の普及を遅らせている"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我每天都会看到许多关于声称不受欢迎的意见的帖子，而\n而又很受欢迎。因此，我决定分享我对ETH的看法。\n我认为它是受欢迎的，但不经常这样措辞。\n\n我们都知道，ETH的交易费用很高，而\n的。",
      "title": "大众意见。ETH气体费用推迟了全球对加密货币的采用"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我每天都會看到許多關於聲稱不受歡迎的意見的帖子，而\n而又很受歡迎。因此，我決定分享我對ETH的看法。\n我認爲它是受歡迎的，但不經常這樣措辭。\n\n我們都知道，ETH的交易費用很高，而\n的。",
      "title": "大衆意見。ETH氣體費用推遲了全球對加密貨幣的採用"
    }
  ]
}