{
  "author": "RussianRadium",
  "the_new_excerpt": "Hello, I'm from El Salvador so I'd like to give you all some information that\nmight help you clarify things. I posted this in another thread and made some\nslight edits.\n\nFirst some info of the current zeitgeist in El Salvador:\n\nThe president's party, Nuevas Ideas (New Ideas), was formed in 2018-2019…",
  "original_created_utc": 1622936353,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは、私はエルサルバドルから来ましたので、皆さんに情報を提供したいと思います。\n皆さんに情報を提供したいと思います。別のスレッドに投稿したものを、少し編集してみました。\n少し編集しました。\n\nまず最初に、エルサルバドルの現在の時流に関する情報をお伝えします。\n\n大統領の政党「Nuevas Ideas（新しい考え）」は、2018年～2019年に結成された...",
      "title": "私はエルサルバドル出身で、最近発表されたBTC採用についていくつかの点を明らかにするために来ました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好，我来自萨尔瓦多，所以我想给大家一些信息，可能会帮助你们澄清一些事情。\n可能会帮助你澄清一些事情。我在另一个主题中发布了这个信息，并做了一些\n略作编辑。\n\n首先是萨尔瓦多目前的潮流的一些信息。\n\n总统的政党，Nuevas Ideas（新思想），成立于2018-2019年...",
      "title": "我来自萨尔瓦多，我在这里要澄清关于最近宣布的BTC采用的一些事情。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好，我來自薩爾瓦多，所以我想給大家一些信息，可能會幫助你們澄清一些事情。\n可能會幫助你澄清一些事情。我在另一個主題中發佈了這個信息，並做了一些\n略作編輯。\n\n首先是薩爾瓦多目前的潮流的一些信息。\n\n總統的政黨，Nuevas Ideas（新思想），成立於2018-2019年...",
      "title": "我來自薩爾瓦多，我在這裏要澄清關於最近宣佈的BTC採用的一些事情。"
    }
  ],
  "title": "I'm from El Salvador and I'm here to clarify some things about the BTC adoption recently announced.",
  "created_utc": 1622944514,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello, I&#39;m from El Salvador so I&#39;d like to give you all some information that might help you clarify things. I posted this in another thread and made some slight edits.</p>\n\n<p>First some info of the current zeitgeist in El Salvador:</p>\n\n<p>The president&#39;s party, Nuevas Ideas (New Ideas), was formed in 2018-2019 as a new alternative to the old bipartisan, marxist-left (FMLN) and ultranationalist right (ARENA) system that had controlled the government since the end of the Civil War in 1992. He won the presidential elections in 2019 with 52% of the vote (overwhelming majority) and just recently won the legislative elections in 2021 by a landslide (73% of the vote). That means that his party controls the Congress with 2/3 of the legislators, which are enought to pass any bill that they want, and in fact that&#39;s what they&#39;ve been doing.</p>\n\n<p>His party is made up of mostly young professionals tired of the corrupt system that has kept the country poor and underdeveloped for the past 30 years. In just their first day in office they fired the Attorney General (who had been protecting other corrupt politicians) and 5 other magistrates, accused of being bought by the oligarchy to protect their economic interests. In just a month, the new Congress has approved unprecedented financing for education and infrastructure and has passed bills that make sure that the predatory economic elites that used to buy politicians in the past are kept in check. Many big infraestructure projects are expected to be approved by Congress soon, including the construction of a high-speed railway and a new international airport.</p>\n\n<p>One of the biggest projects that the government is building is called Surf City, which is basically road, electricity and communications infrastructure along the coastline to help small businesses. In fact, for this very reason, the ISA decided to hold the World Surfing Games (which are happening until tomorrow) to qualify for the Tokyo 2021 Olympics in El Salvador. Bitcoin is already used by small businesses in this area, especially in El Zonte, which is one of the more popular beaches that gets a lot of international tourists.</p>\n\n<p>I know most people used to have the notion that El Salvador was a dumpster fire, because we were. However, the country is going through huge change. Just yesterday the ex-mayor of San Salvador (the capital) was captured by the police and is awaiting trial for corruption and gang financing and also the ex-first lady was sentenced to 10 years in prison for money laundering. El Salvador is no longer on the top 10 list of most violents countries in the world (the muder rate used to be 12-15 homicides daily and has decreased to nearly 3-4 daily since Bukele took office) and our economy is expected to grow steadily too.</p>\n\n<p>Bukele (39 years old) is extremely popular, with an approval rating of over 90% during his second year in office. Mostly due to this forward thinking. You can see this with the data related to the pandemic. El Salvador is the Central American country with the lowest mortality rate (due to a massive revamp of our healthcare system), the lowest number of COVID-19 cases and the fastest rate of vaccine applications, having just surpassed the 2 million mark. The government also just launched a project to give laptops to 100% of the students of the public school system. The country still has massive challenges to overcome but I&#39;m confident we are on a very good path.</p>\n\n<p>The adoption of Bitcoin as legal tender is HUGE news for this country. I assure you that Congress will pass this bill. I couldn&#39;t give you an exact date, but the economics commission will probably receive all the papers this week.</p>\n\n<p>I&#39;ll try to answer any questions that you guys might have.</p>\n\n<p>UPDATE: Most legislators have come forward saying they will back the bill. </p>\n\n<p>Some useful links:</p>\n\n<p>Bitcoin in El Salvador as of today:<a href=\"https://www.youtube.com/watch?v=-G9cmff81fc\">https://www.youtube.com/watch?v=-G9cmff81fc</a> (Spanish)</p>\n\n<p><a href=\"https://www.youtube.com/watch?v=7VV0A_favrk\">https://www.youtube.com/watch?v=7VV0A_favrk</a> (Spanish)</p>\n\n<p><a href=\"https://www.youtube.com/watch?v=95tNWXADX14\">https://www.youtube.com/watch?v=95tNWXADX14</a> (English)</p>\n\n<p><a href=\"https://www.youtube.com/watch?v=W4XcHi_NXl8\">https://www.youtube.com/watch?v=W4XcHi_NXl8</a> (Spanish)</p>\n\n<p>The Surf City project (which is where Bitcoin will most likely flourish):</p>\n\n<p><a href=\"https://www.latimes.com/sports/olympics/story/2021-06-04/el-salvador-is-riding-the-waves-as-global-surfings-newest-mecca\">https://www.latimes.com/sports/olympics/story/2021-06-04/el-salvador-is-riding-the-waves-as-global-surfings-newest-mecca</a></p>\n\n<p><a href=\"https://www.youtube.com/watch?v=Wna7x7O25lA\">https://www.youtube.com/watch?v=Wna7x7O25lA</a> (English)</p>\n\n<p><a href=\"https://www.youtube.com/watch?v=aznk1VSpqHA\">https://www.youtube.com/watch?v=aznk1VSpqHA</a> (English)</p>\n</div><!-- SC_ON -->",
  "score": 2458,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/dcg8xD-rl3DSVM2y3iNvfSUA1f_IxJ-QpFLEazXfzvc.jpg?auto=webp&s=ae7b458c88d7544b01fe482e4bd4eeab7f0995c8",
          "width": 480,
          "height": 360
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/dcg8xD-rl3DSVM2y3iNvfSUA1f_IxJ-QpFLEazXfzvc.jpg?width=108&crop=smart&auto=webp&s=fd2ea47bf132f574cddfff49fc40d323decb4ed1",
            "width": 108,
            "height": 81
          },
          {
            "url": "https://external-preview.redd.it/dcg8xD-rl3DSVM2y3iNvfSUA1f_IxJ-QpFLEazXfzvc.jpg?width=216&crop=smart&auto=webp&s=aeb51784f389bd00e401e7675307dbca7adf4a72",
            "width": 216,
            "height": 162
          },
          {
            "url": "https://external-preview.redd.it/dcg8xD-rl3DSVM2y3iNvfSUA1f_IxJ-QpFLEazXfzvc.jpg?width=320&crop=smart&auto=webp&s=37826f51a25071474d0bd274ce7bcfbec0895a16",
            "width": 320,
            "height": 240
          }
        ],
        "variants": {},
        "id": "Bw_TTxKgfLubCyAiu48qX24eglpIkxiMS-QFcVDMNaw"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/Bitcoin/comments/nt8hi6/im_from_el_salvador_and_im_here_to_clarify_some/",
  "subreddit": "Bitcoin",
  "id": "nt8hi6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404878611
}