{
  "author": "leonelritchie",
  "original_created_utc": 1649664907,
  "title": "Average man in Crypto! Lessons I've learned",
  "created_utc": 1649719842,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;3 years in crypto, i would like to share my experience as a curious user of crypto.&lt;/p&gt;\n\n&lt;p&gt;My first experience with Crypto was when someone from a different country sent me $100 fund to support for a business i proposed. &lt;/p&gt;\n\n&lt;pre&gt;&lt;code&gt;LESN 1. Crypto closes the location gap for funding useful projects.\n&lt;/code&gt;&lt;/pre&gt;\n\n&lt;p&gt;Few months after my first exposure, Bitcoin dropped from 10k to 4k. It took some time, but it came back up, now around 40k+&lt;/p&gt;\n\n&lt;pre&gt;&lt;code&gt;LESN 2. The market is very volatile, have faith or go home safely.\n&lt;/code&gt;&lt;/pre&gt;\n\n&lt;p&gt;Later on, I decided to invest in Alt coins, i asked a knowledgeable friend for suggestions, and he suggested &amp;quot;Coin X&amp;quot; (name undisclosed).&lt;/p&gt;\n\n&lt;p&gt;I invested in Coin X a little and it showed signs of growth in the first few weeks. Not so long Coin X dipped, came back up then dipped again. &lt;/p&gt;\n\n&lt;pre&gt;&lt;code&gt;LESN 3. Spare money is your safety net.\n&lt;/code&gt;&lt;/pre&gt;\n\n&lt;p&gt;A few times, i tried swapping my initial investment between markets to Chase my losses. Ultimately lost on them too.&lt;/p&gt;\n\n&lt;pre&gt;&lt;code&gt;LESN 4. You can&amp;#39;t time the market, switching in between investments/markets can dip you into more losses than your initial.\n\nLESN 5. It&amp;#39;s just money, don&amp;#39;t get attached to coins, it&amp;#39;s not your religion and its not saving the world. if you lose your money there wouldn&amp;#39;t be pity for you by the creators.\n&lt;/code&gt;&lt;/pre&gt;\n\n&lt;p&gt;So i started receiving crypto payment for my freelance while looking for a day job. I hedl as an alternative to cashing out. The crash came and my assets are worth about 30% of the actual amount i got paid. Reminded me of LESN 3 and&lt;/p&gt;\n\n&lt;pre&gt;&lt;code&gt;LESN 6. DYOR doesn&amp;#39;t mean you will not lose your money.\n&lt;/code&gt;&lt;/pre&gt;\n\n&lt;p&gt;Finally.  Work in real life with your value skills, budget some of your savings for crypto. That way, losses hit you less and you&amp;#39;d have the strength to continue (if you have to). That&amp;#39;s one of the ways to the Financial Independence you want from crypto&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 301,
  "permalink": "/r/CryptoCurrency/comments/u12obw/average_man_in_crypto_lessons_ive_learned/",
  "subreddit": "CryptoCurrency",
  "id": "u12obw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "3 years in crypto, i would like to share my experience as a curious user of\ncrypto.\n\nMy first experience with Crypto was when someone from a different country sent\nme $100 fund to support for a business i proposed.\n\nLESN 1. Crypto closes the location gap for funding useful projects.\n\n\nFew months…"
}