{
  "author": "Beeker93",
  "original_created_utc": 1642936099,
  "title": "Is trusting what the scientific community has to say about a topic without fully understanding it count as the appeal to authority fallacy?",
  "created_utc": 1642980824,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Assuming you aren&amp;#39;t quoting what 1 person has to say and using their credentials as proof, and instead taking the consensus of the entire scientific community which is peer reviewed and tested. Would that fall under an appeal to authority? I think it is always better to understand the science and data behind something, but we can&amp;#39;t all be experts in every field. If a Biologist were to argue against biblical creationism and use proof of evolution as evidence, could they also use evidence from geologists and astronomers to prove the world is older than 5000 years even if they don&amp;#39;t entirely understand how they came to that conclusion? Or is that an appeal to authority from saying &amp;quot;the consensus of the geological community is that the Earth is 4.5 billion years old&amp;quot;. Would trusting the results from an instrument without fully understanding how the instrument works, just how to use it be an argument from authority, the authority being the company that made the instrument and the initial inventor?&lt;/p&gt;\n\n&lt;p&gt;Sorry if this question is way off. I may be totally misunderstanding what an appeal to authority is, as philosophy is not my strength. I just figure much of our understanding of the world is based on previous information we may never know fully. In a sense, we are standing on the shoulders of giants. The scientific method delivers results, but textbooks have been rewritten before.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/askphilosophy/comments/sard9s/is_trusting_what_the_scientific_community_has_to/",
  "subreddit": "askphilosophy",
  "id": "sard9s",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Assuming you aren't quoting what 1 person has to say and using their credentials\nas proof, and instead taking the consensus of the entire scientific community\nwhich is peer reviewed and tested. Would that fall under an appeal to authority?\nI think it is always better to understand the science and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "一人の発言を引用して、その資格を利用しているのではないと仮定すると\n科学界全体のコンセンサスを証拠として採用するのではなく\n専門家によるレビューとテストが行われたものです。それは権威へのアピールに該当するのでしょうか？\n私は、科学を理解することは常に良いことだと思いますし...",
      "title": "あるテーマについて、それを十分に理解することなく、科学界が言っていることを信用することは、権威への訴えの誤謬とみなされるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "假设你不是引用一个人的话，用他们的资历作为证据\n作为证据，而采用整个科学界的共识\n这是经同行评审和测试的。这是否属于对权威的呼吁？\n我认为最好是了解科学和...",
      "title": "在没有充分了解的情况下，相信科学界对某一主题的说法，算不算是向权威申诉的谬误？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "假設你不是引用一個人的話，用他們的資歷作爲證據\n作爲證據，而採用整個科學界的共識\n這是經同行評審和測試的。這是否屬於對權威的呼籲？\n我認爲最好是瞭解科學和...",
      "title": "在沒有充分了解的情況下，相信科學界對某一主題的說法，算不算是向權威申訴的謬誤？"
    }
  ]
}