{
  "author": "ticklemytaint340",
  "original_created_utc": 1625595266,
  "title": "How significant was the US’s role in the overthrow of left- leaning South American leaders?",
  "created_utc": 1625606882,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m from Argentina, and it’s a pretty well establish fact the military Junta that terrorized our country in the 70’s had US support. I also read a little about Operation Condor and the US’s involvement in Chile. Some sources argue that US involvement was inconsequential and simply sped up a process that was already going to happen, while others make it seem like the US is the sole cause for many right wing dictatorships in Latin America. I was wondering if somebody here could clarify what happened, wether for a specific country or in the region as a whole. Thanks!</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/AskHistorians/comments/of0nk3/how_significant_was_the_uss_role_in_the_overthrow/",
  "subreddit": "AskHistorians",
  "id": "of0nk3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m from Argentina, and it’s a pretty well establish fact the military Junta\nthat terrorized our country in the 70’s had US support. I also read a little\nabout Operation Condor and the US’s involvement in Chile. Some sources argue\nthat US involvement was inconsequential and simply sped up a process…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はアルゼンチン出身ですが、70年代に我が国を恐怖に陥れた軍事政権が米国の支援を受けていたことはよく知られた事実です。\n70年代に我が国を恐怖に陥れた軍事政権は、アメリカの支援を受けていました。また、コンドル作戦と米国のチリへの関与についても少し読みました。\nまた、コンドル作戦とアメリカのチリへの関与についても少し読みました。ある資料によると\nアメリカの関与は取るに足らないもので、単にプロセスを早めただけだとする情報もあります。",
      "title": "南米の左派指導者の転覆にアメリカが果たした役割は大きいのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我来自阿根廷，70年代恐吓我国的军政府得到了美国的支持，这是一个公认的事实。\n在70年代恐吓我们国家的军政府得到了美国的支持。我也读过一些\n关于秃鹰行动和美国在智利的参与。有些资料认为\n美国的参与无关紧要，只是加快了一个进程......",
      "title": "美国在推翻南美左倾领导人中的作用有多大？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我來自阿根廷，70年代恐嚇我國的軍政府得到了美國的支持，這是一個公認的事實。\n在70年代恐嚇我們國家的軍政府得到了美國的支持。我也讀過一些\n關於禿鷹行動和美國在智利的參與。有些資料認爲\n美國的參與無關緊要，只是加快了一個進程......",
      "title": "美國在推翻南美左傾領導人中的作用有多大？"
    }
  ]
}