{
  "author": "xavierwest888",
  "original_created_utc": 1647357759,
  "title": "Anyone else just completely dead to the idea of any new coin that enters the market now?",
  "created_utc": 1647387307,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I used to be excited a few years back at the prospect of new coins and their possibilities. Each new entry was a potential chance to get in on the ground level of some new venture into the unknown.&lt;/p&gt;\n\n&lt;p&gt;Yet nowadays crypto looks like Netflix, for every actually well known, successful piece of media it&amp;#39;s just pages and pages of &amp;#39;originals&amp;#39; to the point where the little notification that Netflix has released a new item fills me with the same level of excitement as the cooking instructions on my tin of soup.&lt;/p&gt;\n\n&lt;p&gt;Every new coin just seems to be either one of the following categories:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;A rug pull or some other type of scam, often pumped by some influencer or celebrity that will be dead before it even hit the ground.&lt;/li&gt;\n&lt;li&gt;Promise the moon but will never go beyond initial development, often involving laser eyes with a price history that will resemble a playground slide as it creates a perfect first half of a parabola.&lt;/li&gt;\n&lt;li&gt;Some tokenomitry that is just pure maths cringe with about two dozen zeros to the right of the period before you hit an actual number and a supply that extends another couple of down zeros to the left.&lt;/li&gt;\n&lt;li&gt;Elon Dodge trash tier coin&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Personally, I&amp;#39;m not even looking at anything that isn&amp;#39;t in the top spots anymore, and almost half of those are rejects anyway. It&amp;#39;s sad that the discovery phase of crypto is basically dead and it&amp;#39;s now just stick to what exists and be a bag holder.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 327,
  "permalink": "/r/CryptoCurrency/comments/terfuu/anyone_else_just_completely_dead_to_the_idea_of/",
  "subreddit": "CryptoCurrency",
  "id": "terfuu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I used to be excited a few years back at the prospect of new coins and their\npossibilities. Each new entry was a potential chance to get in on the ground\nlevel of some new venture into the unknown.\n\nYet nowadays crypto looks like Netflix, for every actually well known,\nsuccessful piece of media…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "数年前までは、新しいコインとその期待に胸を膨らませていました。\n可能性がある。新しい作品が出るたびに、その土俵に上がれる可能性がある。\n未知への新しいベンチャーが生まれる。\n\nしかし、最近の暗号はまるでNetflixのように、実際によく知られているものにはすべて\n成功したメディアは...",
      "title": "今、市場に参入してくる新しいコインに対して、完全に死守している人はいないの？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "几年前，我曾经对新硬币的前景和它们的可能性感到兴奋。\n的可能性。每一个新的项目都是一个潜在的机会，让我有机会参与到一些未知的新冒险中去。\n的机会。\n\n然而，如今的加密货币看起来就像Netflix，对于每一个真正知名的。\n成功的媒体作品...",
      "title": "还有人对现在进入市场的任何新币完全死心吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "幾年前，我曾經對新硬幣的前景和它們的可能性感到興奮。\n的可能性。每一個新的項目都是一個潛在的機會，讓我有機會參與到一些未知的新冒險中去。\n的機會。\n\n然而，如今的加密貨幣看起來就像Netflix，對於每一個真正知名的。\n成功的媒體作品...",
      "title": "還有人對現在進入市場的任何新幣完全死心嗎？"
    }
  ]
}