{
  "author": "aramtas",
  "the_new_excerpt": "Hello.\n\nSilly question, but how do you stop checking your brokerage account every hour?\n\nMy portfolio is pretty solid, and I may not touch it even for 10 years. 80% in\nstocks and 20% in bonds, 70% US and 30% international, with some small-cap and\nvalue tilt, index funds only. Basically, I have…",
  "original_created_utc": 1623291139,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは。\n\n愚問ですが、1時間ごとに証券口座をチェックするのをやめるにはどうしたらいいでしょうか？\n\n私のポートフォリオはかなりしっかりしていて、10年でも触らないかもしれません。株が80％、債券が20％。\n株式が80％、債券が20％、米国が70％、海外が30％で、小型株とバリュー株の比率があります。\nインデックスファンドのみです。基本的に、私は...",
      "title": "1時間おきに証券会社の口座をチェックしたいという衝動を抑えるには？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好。\n\n愚蠢的问题，但你如何停止每小时检查你的经纪账户？\n\n我的投资组合相当稳健，甚至10年内都可能不碰它。80%在\n80%的股票和20%的债券，70%的美国股票和30%的国际股票，还有一些小盘股和大盘股。\n价值倾斜，仅有指数基金。基本上，我有...",
      "title": "如何克服每小时检查经纪账户的持久性冲动？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好。\n\n愚蠢的問題，但你如何停止每小時檢查你的經紀賬戶？\n\n我的投資組合相當穩健，甚至10年內都可能不碰它。80%在\n80%的股票和20%的債券，70%的美國股票和30%的國際股票，還有一些小盤股和大盤股。\n價值傾斜，僅有指數基金。基本上，我有...",
      "title": "如何克服每小時檢查經紀賬戶的持久性衝動？"
    }
  ],
  "title": "How to overcome persistent urge to check your brokerage account every hour?",
  "created_utc": 1623295014,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello.</p>\n\n<p>Silly question, but how do you stop checking your brokerage account every hour?</p>\n\n<p>My portfolio is pretty solid, and I may not touch it even for 10 years. 80% in stocks and 20% in bonds, 70% US and 30% international, with some small-cap and value tilt, index funds only.  Basically, I have nothing to worry about, but I still check my brokerage account many times a day.</p>\n\n<p>I&#39;m sure many of us have had or are having the same problem.  How do you deal with it?</p>\n</div><!-- SC_ON -->",
  "score": 132,
  "permalink": "/r/Bogleheads/comments/nwcj9y/how_to_overcome_persistent_urge_to_check_your/",
  "subreddit": "Bogleheads",
  "id": "nwcj9y",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404885450
}