{
  "author": "msnf",
  "the_new_excerpt": "I started investing in late 2013 and TWTR was the hot IPO at the time. I\ndistinctly remember buying a few shares at $57 figuring I'd get in on the ground\nfloor of what was already a culturally-significant company.\n\nAmazingly, over 7 years later the stock is trading lower than where I bought it\nall…",
  "original_created_utc": 1619970274,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が投資を始めたのは2013年末で、当時TWTRは注目のIPOでした。I\n私は57ドルで数株を購入し、すでに文化的に重要な存在となっていたTWTRの最初の一歩を踏み出すことができると考えたことを覚えています。\n私は57ドルで数株を購入し、すでに文化的に重要な企業となっていたTWTRの最初の一歩を踏み出すことができると考えました。\n\n驚くべきことに、7年以上経った今、株価は私が購入した時よりも低く取引されています。\nすべて...",
      "title": "ツイッター（TWTR）は、上場している全歴史の中で、基本的に何もしていない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在2013年底开始投资，TWTR是当时的热门IPO。I\n我清楚地记得，我在57美元的时候买了几股，以为可以在当时已经很火爆的市场上获得\n这已经是一家具有文化意义的公司的底层。\n\n令人惊讶的是，7年多后，该股的交易价格比我买入时还低\n所有...",
      "title": "推特（TWTR）在其整个公开交易的历史中基本上什么都没做过"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在2013年底開始投資，TWTR是當時的熱門IPO。I\n我清楚地記得，我在57美元的時候買了幾股，以爲可以在當時已經很火爆的市場上獲得\n這已經是一傢俱有文化意義的公司的底層。\n\n令人驚訝的是，7年多後，該股的交易價格比我買入時還低\n所有...",
      "title": "推特（TWTR）在其整個公開交易的歷史中基本上什麼都沒做過"
    }
  ],
  "title": "Twitter (TWTR) has done basically nothing in its entire publically-traded history",
  "created_utc": 1619974083,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I started investing in late 2013 and TWTR was the hot IPO at the time. I distinctly remember buying a few shares at $57 figuring I&#39;d get in on the ground floor of what was already a culturally-significant company. </p>\n\n<p>Amazingly, over 7 years later the stock is trading lower than where I bought it all those years ago. TWTR has never paid a dividend or split their stock, so in effect they&#39;ve created zero wealth for the general public over their entire public existence. I sold my shares for a wash in 2014, but I&#39;d have been shocked to hear they&#39;d still be kicking around the same spot in 2021. In an era of social media, digital advertising and general tech dominance, it&#39;s a remarkable failure.</p>\n\n<p>On the one hand it provides a valuable lesson that a company still has to succeed financially, and not just have a compelling narrative. Pay attention to the bottom line - hype alone does not a business make. On the other hand, what the hell? Twitter has created verbs. It&#39;s among the most-visited websites in the world. We&#39;ve just had 4 years of a Twitter presidency. Yet Twitter has seen its younger brother (SQ) lap it in terms of value. How has this company <em>not</em> managed to get off the ground as a profitable business?</p>\n</div><!-- SC_ON -->",
  "score": 7754,
  "permalink": "/r/stocks/comments/n392a4/twitter_twtr_has_done_basically_nothing_in_its/",
  "subreddit": "stocks",
  "id": "n392a4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380968350
}