{
  "author": "JDP-Phoenix",
  "original_created_utc": 1629674062,
  "title": "[Question] Does anyone else spend way too much time day dreaming of what they'll do when cryptocurrencies take off?",
  "created_utc": 1629696640,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I work a miserable 80 hours per week in a job I can barely stand — and I&#39;m only in my twenties. So lately I&#39;ve found myself spending too much time gazing out the window imagining what life will be like when I can finally submit my resignation letter and pursue my passion projects full time. This, of course, won&#39;t happen anytime soon as I need my portfolio to return a 2000% profit before I can retire with the quality of life I want. Until then I&#39;ll continue mining this fiat, but it&#39;s nice being able to day dream about a happier future. I now finally understand why people waste their money on lottery tickets.</p>\n\n<p>Edit: I can&#39;t quit my job, unfortunately. My parents sacrificed everything—including immigrating to a foreign country—to get me to where I am today. And until I earn enough so that my parents can comfortably retire, I have no choice but to continue mining this fiat. I just hope crypto gets me to my goals a little earlier.</p>\n</div><!-- SC_ON -->",
  "score": 166,
  "permalink": "/r/CryptoCurrency/comments/p9n9z6/question_does_anyone_else_spend_way_too_much_time/",
  "subreddit": "CryptoCurrency",
  "id": "p9n9z6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I work a miserable 80 hours per week in a job I can barely stand — and I'm only\nin my twenties. So lately I've found myself spending too much time gazing out\nthe window imagining what life will be like when I can finally submit my\nresignation letter and pursue my passion projects full time. This, of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は20代の若さで、とても耐えられないような仕事を週に80時間もしています。\nまだ20代なのに。最近、私は窓の外を眺めることに時間を費やしていました。\n窓の外を眺めながら、辞表を提出したときの生活を想像している自分がいます。\n辞表を出して、自分の情熱的なプロジェクトをフルタイムで追求できるようになったら、どんな生活になるのだろうと、窓の外を眺めていることが多いです。これは、もちろん...",
      "title": "[質問】暗号通貨が軌道に乗ったら何をしようかと夢想することに時間をかけすぎている人はいませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我每周工作80个小时，工作内容悲惨，我几乎无法忍受--而我只有20多岁。\n二十多岁。所以最近我发现自己花了太多的时间凝视窗外\n想象着当我最终可以提交辞呈时生活会是什么样子。\n辞职信并全职追求我的激情项目时的生活。这一点，是...",
      "title": "[问题]还有人花了太多的时间去幻想当加密货币起飞时他们会做什么吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我每週工作80個小時，工作內容悲慘，我幾乎無法忍受--而我只有20多歲。\n二十多歲。所以最近我發現自己花了太多的時間凝視窗外\n想象着當我最終可以提交辭呈時生活會是什麼樣子。\n辭職信並全職追求我的激情項目時的生活。這一點，是...",
      "title": "[問題]還有人花了太多的時間去幻想當加密貨幣起飛時他們會做什麼嗎？"
    }
  ]
}