{
  "author": "Cool-Might7913",
  "the_new_excerpt": "Now, before the downvotes come, hear me out. Often times, we label Bitcoin as\n\"the internet of money\" or \"digital gold\", but I believe that Bitcoin as money\nis pretty much broken and the digital gold is not a fitting one.\n\n * Point 1, \"the internet of money\".\n   * Per the whitepaper, Bitcoin is…",
  "original_created_utc": 1619368668,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "さて、下馬評が出る前に、私の話を聞いてください。よく、ビットコインを「お金のインターネット」や「デジタルゴールド」と表現しますが\n\"貨幣のインターネット」や「デジタルゴールド」と呼ばれていますが、私は、貨幣としてのビットコインはかなり壊れていて\nはかなり壊れているし、デジタルゴールドもふさわしいものではないと思っています。\n\n * ポイント1、「お金のインターネット」。\n   * ホワイトペーパーによると、Bitcoinは...",
      "title": "不人気な意見】ビットコインはかなり悪いコインで、「ファンダメンタルズ」の話をすれば、非常に割高である。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "现在，在负面评价到来之前，请听我说完。很多时候，我们把比特币称为\n\"货币的互联网 \"或 \"数字黄金\"，但我认为，作为货币的比特币\n是相当崩溃的，而且数字黄金也不是一个合适的说法。\n\n *第1点，\"货币的互联网\"。\n   * 根据白皮书，比特币是...",
      "title": "不受欢迎的观点] 比特币是一个相当糟糕的硬币，如果我们谈论 \"基本面\"，它的价格是非常高的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "現在，在負面評價到來之前，請聽我說完。很多時候，我們把比特幣稱爲\n\"貨幣的互聯網 \"或 \"數字黃金\"，但我認爲，作爲貨幣的比特幣\n是相當崩潰的，而且數字黃金也不是一個合適的說法。\n\n *第1點，\"貨幣的互聯網\"。\n   * 根據白皮書，比特幣是...",
      "title": "不受歡迎的觀點] 比特幣是一個相當糟糕的硬幣，如果我們談論 \"基本面\"，它的價格是非常高的。"
    }
  ],
  "title": "[Unpopular Opinion] Bitcoin is a pretty bad coin and if we talk about \"fundamentals\" it is highly overpriced",
  "created_utc": 1619382631,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Now, before the downvotes come, hear me out. Often times, we label Bitcoin as &quot;the internet of money&quot; or &quot;digital gold&quot;, but I believe that Bitcoin as money is pretty much broken and the digital gold is not a fitting one.</p>\n\n<ul>\n<li>Point 1, &quot;the internet of money&quot;. \n\n<ul>\n<li>Per the whitepaper, Bitcoin is implied to be a &quot;A purely peer-to-peer version of electronic cash&quot; and in the whitepaper it&#39;s mentioned that one of the downsides of traditional electronic payments is that &quot;the cost of mediation increases transaction costs, limiting the minimum practical transaction size and cutting off the possibility for small casual transactions&quot;. </li>\n<li>I know this paper was published in 2008, but let&#39;s fast forward to today. We have widely used systems like Apple Pay and Venmo which allow us to transfer money without fees, while the average Bitcoin transaction fees are $29 today, and reached all time highs of $61 in April 21st. This shows us that Bitcoin is no better than traditional payments for &quot;small casual transactions&quot; and thus unusable to be called peer-to-peer cash</li>\n</ul></li>\n<li>Point 2, &quot;digital gold&quot;\n\n<ul>\n<li>In 2008, during one of the worst economic periods ever, gold &quot;only&quot; dropped 27%, while we have seen Bitcoin drop multiple times over 50% during bear markets.</li>\n<li>During the covid pandemic:\n\n<ul>\n<li>Gold went from 1570 in February 11th 2020 to 1487 in March 16th 2020 (lowest in this time period), a 6% drop.</li>\n<li>BTC dropped from 10.2k in February 11th 2020 to 5200 in March 17th 2020, a 49% drop. Bitcoin&#39;s volatility definitely does not make it a store of value, though it is true that based on historical performance, Bitcoin is orders of magnitude better as an investment than gold</li>\n</ul></li>\n<li>I have made a post about this <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/mf5or1/unpopular_opinion_bitcoin_is_a_hypergrowth_tech/\">before</a>, but I believe that instead of &quot;digital gold&quot; bitcoin should just be called what it is a hypergrowth digital asset. </li>\n<li>Now, what made Bitcoin rise in popularity and demand since its inception? Its usability as digital money. Nowadays, people are buying it just to speculate, and I believe that usability over time beats speculation. As long as Bitcoin keeps being unusable as money, I believe that in the long term other coins will outperform it.</li>\n</ul></li>\n</ul>\n\n<p>So Bitcoin is slow and expensive to transfer, and as we have recently seen with the hashrate drops in China, it is highly centralized for a decentralized system. The only benefit that Bitcoin really has is first mover&#39;s advantage and brand name, which I believe that over time isn&#39;t really a real advantage.</p>\n\n<p>(Other point that I believe are worth mentioning that are not often mentioned in this sub)</p>\n\n<ul>\n<li>Point 3, contamination\n\n<ul>\n<li>It is no secret that Bitcoin is extremely power hungry, consuming 129 TWh, 60% of which does not come from renewable energies. All of the world&#39;s data centers consume 205 TWh, and I don&#39;t believe that Bitcoin is even remotely close to be as necessary as all of the data centers combined, which shows how massively inefficient Bitcoin is in terms of electricity (<a href=\"https://www.visualcapitalist.com/visualizing-the-power-consumption-of-bitcoin-mining/\">source</a>). The worst part in all of this is that power usage will just increase with time if Bitcoin becomes more and more popular due to increases in difficulty. Quite frankly from an environmental perspective, Bitcoin&#39;s power usage is simply not worth it, and something should be done about it.</li>\n</ul></li>\n</ul>\n\n<p>It makes me a bit sad, since when I first heard about Bitcoin in the summer of 2016 I was really excited about it, since it mixed 2 of my big interests (Computer Science and money). But nowadays I&#39;m more passionate about other projects that I don&#39;t want to mention in this post because I don&#39;t want this to be a shill post. Unfortunately, I think Bitcoin has deviated from what I believe is its best use case, being decentralized money, and since there seem to be no signs of going  back to that path Bitcoin will just become a coin for speculation which I believe will lead it to failure in the long term</p>\n</div><!-- SC_ON -->",
  "score": 1385,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/VcYDUbgnC6Vro5aer9A6npcNEGeA9csSx7YPyTgxDpE.jpg?auto=webp&s=a5d7cbe277e4af61aaf336586b0c7e4981be9f03",
          "width": 1200,
          "height": 628
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/VcYDUbgnC6Vro5aer9A6npcNEGeA9csSx7YPyTgxDpE.jpg?width=108&crop=smart&auto=webp&s=12ff9cf7fd19a8dfd9c5908f7aa3a42168122ed2",
            "width": 108,
            "height": 56
          },
          {
            "url": "https://external-preview.redd.it/VcYDUbgnC6Vro5aer9A6npcNEGeA9csSx7YPyTgxDpE.jpg?width=216&crop=smart&auto=webp&s=a2c61921e619cb33721e0e65c84946d41af9ec19",
            "width": 216,
            "height": 113
          },
          {
            "url": "https://external-preview.redd.it/VcYDUbgnC6Vro5aer9A6npcNEGeA9csSx7YPyTgxDpE.jpg?width=320&crop=smart&auto=webp&s=ed199f91ac745e176a7f5704c8801c0251b2ff82",
            "width": 320,
            "height": 167
          },
          {
            "url": "https://external-preview.redd.it/VcYDUbgnC6Vro5aer9A6npcNEGeA9csSx7YPyTgxDpE.jpg?width=640&crop=smart&auto=webp&s=41c348d3075fa801bc67feec2c721ae1461b125a",
            "width": 640,
            "height": 334
          },
          {
            "url": "https://external-preview.redd.it/VcYDUbgnC6Vro5aer9A6npcNEGeA9csSx7YPyTgxDpE.jpg?width=960&crop=smart&auto=webp&s=4f520e1da2fe2632a932a7067ed9555287090661",
            "width": 960,
            "height": 502
          },
          {
            "url": "https://external-preview.redd.it/VcYDUbgnC6Vro5aer9A6npcNEGeA9csSx7YPyTgxDpE.jpg?width=1080&crop=smart&auto=webp&s=e8fcf0b5d1cd47bcabdeae2eb2c63b72d87af0fc",
            "width": 1080,
            "height": 565
          }
        ],
        "variants": {},
        "id": "CP_OQZ5KbJbJftuMywMm2vgzTEXd2EcMQrgV18DT_p4"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/mybyx4/unpopular_opinion_bitcoin_is_a_pretty_bad_coin/",
  "subreddit": "CryptoCurrency",
  "id": "mybyx4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776210455
}