{
  "author": "ooodlydoodlyboodle",
  "the_new_excerpt": "I am hoping that wording makes sense.\n\nThere are a few reasons I don’t want to have kids but the overarching one is\nthat life is tough. I don’t feel like I should bring a new soul in the world to\ndeal with all of the bullshit that previous generations have left behind.\n\nI understand the negativity…",
  "original_created_utc": 1624087261,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、その言葉遣いが意味をなすことを望んでいます。\n\n私が子供を持ちたくない理由はいくつかありますが、包括的なものは\n人生は厳しいということです。新しい魂をこの世に送り出して、これまでの人生であったような面倒なことをさせるべきではないと思っています。\n新しい魂をこの世に送り出して、前の世代が残していったくだらないものに対処させるべきではないと思っています。\n\n否定的な意見もわかりますが...。",
      "title": "他の人は、自分の可能性のある子供を人生の困難から救うために子供を産みたくないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我希望这个措辞有意义。\n\n我不想生孩子的原因有几个，但最主要的原因是\n生活很艰难。我不觉得我应该在这个世界上带来一个新的灵魂，以应对\n处理前几代人留下的所有狗屁问题。\n\n我理解那些负面情绪...",
      "title": "还有人不想生孩子，让他们可能的孩子免于生活的困难吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我希望這個措辭有意義。\n\n我不想生孩子的原因有幾個，但最主要的原因是\n生活很艱難。我不覺得我應該在這個世界上帶來一個新的靈魂，以應對\n處理前幾代人留下的所有狗屁問題。\n\n我理解那些負面情緒...",
      "title": "還有人不想生孩子，讓他們可能的孩子免於生活的困難嗎？"
    }
  ],
  "title": "Does anyone else not want to have children to spare their possible kids from the difficulty of life?",
  "created_utc": 1624094405,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am hoping that wording makes sense. </p>\n\n<p>There are a few reasons I don’t want to have kids but the overarching one is that life is tough. I don’t feel like I should bring a new soul in the world to deal with all of the bullshit that previous generations have left behind. </p>\n\n<p>I understand the negativity of this perspective and I do not mean to discount the beauty of life. There are so many amazing things to experience. However, I am not convinced this is enough to bring new people into the world. I know we all experience life differently day to day so this may be my limited viewpoint, but curious if others share this thought process.</p>\n\n<p>Edit: By have children I should clarify that I mean give birth, not raise children.</p>\n</div><!-- SC_ON -->",
  "score": 114,
  "permalink": "/r/TooAfraidToAsk/comments/o3aiux/does_anyone_else_not_want_to_have_children_to/",
  "subreddit": "TooAfraidToAsk",
  "id": "o3aiux",
  "is_self": true,
  "media": null,
  "is_video": false
}