{
  "author": "-tHe_Alchemist",
  "original_created_utc": 1633708553,
  "title": "I created a concept app merging productivity with physical movement and mindfulness",
  "created_utc": 1633744307,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi there! I&#39;m the creator of ThinkFit (<a href=\"https://www.thinkfit.app/\">https://www.thinkfit.app/</a>), the last-minute solution for getting things done, instilling healthy habits, fighting sedentary behaviour and keeping energy levels up the entire day! (bold.... ;-)</p>\n\n<p>Recently I added the gamification feature so Users can move more and gain FitPoints, to be exchanged for discounts/coupons etc. I did create a store as well...<a href=\"https://store.thinkfit.app/\">https://store.thinkfit.app/</a>  :-) </p>\n\n<p>I would love to have some interested beta testers, I can invite you to a special community as well for free (there are resources to build business etc), and the app is free as well...</p>\n\n<p>Would like to know if you feel better and more productive while using the app, including energy levels, what kind of features you would like to see next (everything bootstrapped....money to be used carefully). Please let me know! thanks in advance for your precious advice!!!</p>\n\n<p><a href=\"https://preview.redd.it/038umnw019s71.png?width=375&amp;format=png&amp;auto=webp&amp;s=2ae088d332a95c46b1829a63116d9bddd4148a3b\">https://preview.redd.it/038umnw019s71.png?width=375&amp;format=png&amp;auto=webp&amp;s=2ae088d332a95c46b1829a63116d9bddd4148a3b</a></p>\n</div><!-- SC_ON -->",
  "score": 5,
  "permalink": "/r/SideProject/comments/q40lgf/i_created_a_concept_app_merging_productivity_with/",
  "subreddit": "SideProject",
  "id": "q40lgf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi there! I'm the creator of ThinkFit (https://www.thinkfit.app/), the\nlast-minute solution for getting things done, instilling healthy habits,\nfighting sedentary behaviour and keeping energy levels up the entire day!\n(bold.... ;-)\n\nRecently I added the gamification feature so Users can move more…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは。私はThinkFit(https://www.thinkfit.app/)のクリエーターです。\n物事を成し遂げ、健康的な習慣を身につけ、座りっぱなしの行動と戦い、一日中エネルギーレベルを維持するための最後のソリューションです。\n健康的な習慣を身につけ、座りっぱなしの行動と戦い、一日中エネルギーレベルを維持するための最後のソリューションです。\n(bold.... ;-)\n\n最近では、ユーザーがもっと動けるように、ゲーミフィケーション機能を追加しました...",
      "title": "生産性と体の動き、マインドフルネスを融合させたコンセプトアプリを作った"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嗨，你们好! 我是ThinkFit (https://www.thinkfit.app/)的创建者。\n最后一分钟完成工作的解决方案，灌输健康的习惯。\n我是ThinkFit()的创造者，它是完成工作、灌输健康习惯、对抗久坐行为和保持全天能量水平的最后一分钟解决方案！\n(bold....;-)\n\n最近，我增加了游戏化功能，以便用户能够更多的移动...",
      "title": "我创建了一个概念应用程序，将生产力与身体运动和正念相融合。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嗨，你們好! 我是ThinkFit (https://www.thinkfit.app/)的創建者。\n最後一分鐘完成工作的解決方案，灌輸健康的習慣。\n我是ThinkFit()的創造者，它是完成工作、灌輸健康習慣、對抗久坐行爲和保持全天能量水平的最後一分鐘解決方案！\n(bold....;-)\n\n最近，我增加了遊戲化功能，以便用戶能夠更多的移動...",
      "title": "我創建了一個概念應用程序，將生產力與身體運動和正念相融合。"
    }
  ]
}