{
  "author": "cryptodgn",
  "the_new_excerpt": "I will just sum up the facts:\n\n 1. Tesla has problems with Chinese Gov (where most bitcoin miners are located).\n 2. Tesla shares have been falling for months.\n 3. Coinbase was the most downloaded app in the AppStore a couple of weeks ago.\n 4. Drukenmiller questioned the central banks actions, said…",
  "original_created_utc": 1621198894,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "事実をまとめてみます。\n\n 1. Teslaは中国政府との間に問題を抱えている（ほとんどのビットコイン採掘者がいる場所）。\n 2. Teslaの株は何ヶ月も下がり続けている。\n 3. Coinbaseは数週間前、AppStoreで最もダウンロードされたアプリだった。\n 4. Drukenmiller氏は、中央銀行の行動に疑問を呈し、...",
      "title": "イーロンがビットコインをゴミ箱に捨てた理由は、素晴らしいニュースです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我只总结一下事实。\n\n 1. 特斯拉与中国政府（大多数比特币矿工所在的地方）有问题。\n 2. 特斯拉的股价已经连续数月下跌。\n 3. 3.几周前，Coinbase是AppStore中下载最多的应用程序。\n 4. 德鲁肯米勒质疑央行的行动，称...",
      "title": "为什么埃隆扔掉比特币是个大新闻？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我只總結一下事實。\n\n 1. 特斯拉與中國政府（大多數比特幣礦工所在的地方）有問題。\n 2. 特斯拉的股價已經連續數月下跌。\n 3. 3.幾周前，Coinbase是AppStore中下載最多的應用程序。\n 4. 德魯肯米勒質疑央行的行動，稱...",
      "title": "爲什麼埃隆扔掉比特幣是個大新聞？"
    }
  ],
  "title": "Why Elon trashing Bitcoin is great news",
  "created_utc": 1621227690,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I will just sum up the facts:</p>\n\n<ol>\n<li>Tesla has problems with Chinese Gov (where most bitcoin miners are located).</li>\n<li>Tesla shares have been falling for months.</li>\n<li>Coinbase was the most downloaded app in the AppStore a couple of weeks ago.</li>\n<li>Drukenmiller questioned the central banks actions, said the US dollar was going to lose the status reserve in less than 15 years and crypto was the answer for such irresponsible policies.</li>\n<li>Investment banks (GS, JPM) are going to begin to commercialize crypto investment products to their clients but these products won&#39;t be available until Q3-Q4 2021.</li>\n</ol>\n\n<p>So now, why would Elon Musk changed his tune about bitcoin? Well I bet there could be several reasons:</p>\n\n<ul>\n<li>US Gov using him to scare the shit out of new unexperienced investors given that FUD tactics haven&#39;t worked until now because they want to prevent crypto adoption as a means of payment as they would lose control of money.</li>\n<li>Corporate investors and investment banking using him to sink the price so that they can buy low and the sell high once they have their products ready, in exchange tesla gets included in all kind of investment funds.</li>\n<li>Musk pumping un dumping for the fun and making tons of money of his delusional fans.</li>\n</ul>\n\n<p>Honestly I don&#39;t care which of these reasons could be true, I am just speculating about potential reasons that could lead Elon Musk to do this, because one thing is clear, he has some kind of incentive to trash bitcoin and shake out retail investors. </p>\n\n<p>He knew very well how mining works, he event answered to a tweet from Jack Dorsey that bitcoin incentivized renewable energies, only to change his tune 3 weeks later. Of course, his space X rockets, his litium mines in Africa and his gigafactory in Texas and China where most energy comes from fossil fuels don&#39;t pollute.</p>\n\n<p>So please use your head and not your emotions when deciding if you buy, sell or hold. For me, it is clear what to do.</p>\n</div><!-- SC_ON -->",
  "score": 301,
  "permalink": "/r/Bitcoin/comments/ndxvmr/why_elon_trashing_bitcoin_is_great_news/",
  "subreddit": "Bitcoin",
  "id": "ndxvmr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590794224
}