{
  "author": "sickoelizabeth",
  "original_created_utc": 1647030229,
  "title": "Have I been unknowingly jerking off my cat?",
  "created_utc": 1647033652,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Yes, I know how the title looks. I&amp;#39;m even using my spare account because I&amp;#39;m embarrassed to even be asking this. Anyways. &lt;/p&gt;\n\n&lt;p&gt;My cat (8ish m/o male, not neutered) loves attention, especially belly rubs. He runs up to me and gets in my lap any chance he gets. Well, when it comes to belly rubs, he even lifts up his leg like a dog would. I thought it was so cute!! &lt;/p&gt;\n\n&lt;p&gt;Today he gets in my lap per usual, and gets on his back, basically telling me it was time for belly rubs, so I happy obliged. Well, I look down and his little red rocket is not only sticking out....but MOVING AROUND. If that thing had eyes it would be looking me up and down, maybe even fucking whistle at me. &lt;/p&gt;\n\n&lt;p&gt;This isn&amp;#39;t the first time his little friend has come out. But I figured that like other animals, this meant that they are relaxed, so I didn&amp;#39;t see it as an issue. But like....he gets this fucking look in his eye. And his genital area was...wet. &lt;/p&gt;\n\n&lt;p&gt;...Reddit, have I been fucking jerking off my cat this whole time??&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 123,
  "permalink": "/r/TooAfraidToAsk/comments/tbz7ng/have_i_been_unknowingly_jerking_off_my_cat/",
  "subreddit": "TooAfraidToAsk",
  "id": "tbz7ng",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Yes, I know how the title looks. I'm even using my spare account because I'm\nembarrassed to even be asking this. Anyways.\n\nMy cat (8ish m/o male, not neutered) loves attention, especially belly rubs. He\nruns up to me and gets in my lap any chance he gets. Well, when it comes to\nbelly rubs, he even…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "はい、タイトルの感じはわかります。恥ずかしいので、予備のアカウントも使っています。\nこんなこと聞くのも恥ずかしいのですが とにかく\n\n私の猫（8歳くらいのオス、去勢していない）は注目されるのが大好きで、特にお腹を揉まれるのが好きです。彼は\n私のところに駆け寄ってきて、膝の上に乗ってきます。まあ、その時は\nお腹を揉むと、さらに...",
      "title": "私は知らず知らずのうちに猫をコキ使っていたのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "是的，我知道这个标题看起来如何。我甚至用了我的备用账户，因为我很不好意思问这个问题。\n我甚至用了我的备用账户，因为我很尴尬地问这个问题。不管怎么说。\n\n我的猫（8岁左右的雄性，未绝育）喜欢被关注，尤其是揉肚子。他\n只要有机会，它就会跑到我身边，坐在我的腿上。好吧，当涉及到\n揉肚皮时，他甚至...",
      "title": "我是不是一直在不知不觉中给我的猫打飞机？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "是的，我知道這個標題看起來如何。我甚至用了我的備用賬戶，因爲我很不好意思問這個問題。\n我甚至用了我的備用賬戶，因爲我很尷尬地問這個問題。不管怎麼說。\n\n我的貓（8歲左右的雄性，未絕育）喜歡被關注，尤其是揉肚子。他\n只要有機會，它就會跑到我身邊，坐在我的腿上。好吧，當涉及到\n揉肚皮時，他甚至...",
      "title": "我是不是一直在不知不覺中給我的貓打飛機？"
    }
  ]
}