{
  "author": "NuInvestor",
  "the_new_excerpt": "Im sick of seeing all these Fool articles. So i've written how I DD a stock,\nhopefully, new investors won't get fooled into pump-and-dumps. Just want to\nstress this is how I do it, there's obviously a lot of ways to do your due\ndiligence on a stock, I think the most important thing is having a…",
  "original_created_utc": 1623494532,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このような愚劣な記事を見るのはうんざりです。そこで、私がどのように銘柄をDDするかを書いてみました。\n願わくば、新しい投資家がパンプアンドダンプに騙されないように。強調したいのは\n強調したいのは、これは私がやっている方法です。\n株のデューデリジェンスをする方法はたくさんありますが、最も重要なことは、株のデューデリジェンスをすることだと思っています。",
      "title": "株式のDD・分析方法"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我厌倦了看到所有这些愚人的文章。所以我写下了我是如何对一只股票进行DD的。\n希望新的投资者不会被忽悠到抽水和倾倒。只是想\n强调这是我的做法，显然有很多方法来做你的尽职调查\n我认为最重要的是要有一个 \"好的 \"投资理念。",
      "title": "如何DD/分析股票"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我厭倦了看到所有這些愚人的文章。所以我寫下了我是如何對一隻股票進行DD的。\n希望新的投資者不會被忽悠到抽水和傾倒。只是想\n強調這是我的做法，顯然有很多方法來做你的盡職調查\n我認爲最重要的是要有一個 \"好的 \"投資理念。",
      "title": "如何DD/分析股票"
    }
  ],
  "title": "How to DD/Analyse Stocks",
  "created_utc": 1623498122,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Im sick of seeing all these Fool articles. So i&#39;ve written how I DD a stock, hopefully, new investors won&#39;t get fooled into pump-and-dumps. Just want to stress this is how I do it, there&#39;s obviously a lot of ways to do your due diligence on a stock, I think the most important thing is having a process and not relying on trash articles. I hope yall enjoy</p>\n\n<h1>My Stock DD Checklist</h1>\n\n<p>Are you sick of getting <em>Fooled</em> into terrible stocks? Stock DD or Due Diligence is arguably the most important step in investing. We all know the golden rule: <strong>You shouldn’t invest in something you don’t understand</strong>.</p>\n\n<p>Stock DD: Due Diligence is defined as an investigation of a potential investment (such as a stock) or product to confirm all facts.</p>\n\n<p>Pump-And-Dump Stonks:</p>\n\n<p>A pump and dump is a scheme that attempts to boost the price of a stock or security through fake recommendations.Small Cap companies are often targeted as their share price is easier to manipulate.</p>\n\n<p>A proper DD strategy is a good way to avoid a P&amp;D and terrible stocks and really its just common sense. This is even recommended by <a href=\"https://www.investor.gov/protect-your-investments/fraud/types-fraud/pump-and-dump-schemes\">SEC</a>.</p>\n\n<p><strong>Step One: Identify the Stock</strong></p>\n\n<p>The first step to a stock DD is obviously finding a stock to DD. This could be a recommendation from a mate, or maybe you got <em>Fooled</em> into a trash stock<em>.</em> The important thing to note here is <strong>the intent of the source</strong> that is mentioning the stock. Do they have a vested interest? What is their motive behind mentioning the stock?</p>\n\n<p>For these reasons, it may be a good idea to identify your own stock. Have a think about companies that you interact with and see if they are publicly traded. Or browse through the listings. Although these strategies are likely not ideal you can be sure there’s no altera motive.</p>\n\n<p><strong>Step Two: Understand the Company</strong></p>\n\n<p>This is an extension on the phrase don’t invest in something you don’t understand. The same goes for individual stocks, it’s probably not a good idea to invest in a company if you don’t even know what they do.</p>\n\n<ol>\n<li>Search the Businesses ‘About Us’ Section</li>\n</ol>\n\n<p>Pretty much all listed companies will have a webpage with an ‘about us’ section browsing this and their website can be a good starting point to understanding their business, and a good start to a stock DD.</p>\n\n<ol>\n<li>Use Simply wall Street and Read the Company Profile</li>\n</ol>\n\n<p><a href=\"https://simplywall.st/dashboard\">SWS</a> <strong>is a decent for listed stocks</strong>, it features a ‘Company Overview’ section for every stock which gives a quick synopsis about the business and what they do.</p>\n\n<p>How Much Do I Need To know?</p>\n\n<p>Peter Lynch “Never invest in an idea you can’t illustrate with a crayon.” As a starting point you should be able to answer at least these four questions;</p>\n\n<ol>\n<li>What sector is the company in?</li>\n<li>What does the company do?</li>\n<li>How does the company make money?</li>\n<li>How long has the company been around?</li>\n</ol>\n\n<p><strong>Step Three: What is their Market Capitalization?</strong></p>\n\n<p>A company’s market cap or market Capitalization is how much the stock market determines a company is worth. it is calculated by the total market value of all outstanding shares. Companies are often categories in terms of market cap as: Large, mid and small cap.</p>\n\n<p>Each category can be a good investment strategy it&#39;s just important to note that each group has different companies at varying levels of maturity. You shouldn&#39;t buy a micro-cap and be surprised if it gets delisted instead of paying dividends. Likewise, you probably shouldn&#39;t buy a Large Cap Bluechip and hope their share price goes to the moon overnight.</p>\n\n<p><strong>Step Four: Screening Software for Stock Analysis</strong></p>\n\n<p>There are a lot of websites and tools available to screen the selected stocks, Here&#39;s what i use:</p>\n\n<p><a href=\"https://www.tradingview.com/\"><strong>Trading View</strong></a> great</p>\n\n<p><a href=\"https://au.finance.yahoo.com/\"><strong>Yahoo Finance</strong></a> ehhh</p>\n\n<p><a href=\"https://simplywall.st/about\"><strong>Simply Wall St</strong></a> decent</p>\n\n<p><strong>What are we looking for?</strong></p>\n\n<p>After picking one (or more) of these tools that works well for you, perform a basic fundamental analysis on the stock. Looking for any red flags:</p>\n\n<p><strong>Earnings Per Share (EPS):</strong> Postivie? Growing over time?</p>\n\n<p><strong>Price to Earnings Ratio (PE):</strong></p>\n\n<p>PE 0/NA: <em>The company has no earnings</em></p>\n\n<ul>\n<li>PE 1-14: <em>The company is undervalues/has low investor sentiment regarding growth</em></li>\n<li>PE 15-20: <em>Average</em></li>\n<li>PE 20+: <em>The company is overvalued/has high investor sentiment regarding growth</em></li>\n</ul>\n\n<p><strong>Book Value:</strong> The book value is the net assets of a business divided by the number of shares on issue.</p>\n\n<p><strong>Debt:</strong> A company should have more assets than liabilities to avoid bankruptcy. We like companies with low-to-no debt. If a company has debt, ensure it is well covered by assets and earnings</p>\n\n<p><strong>Return on Equity (ROE):</strong></p>\n\n<p>Higher ROE = The better the company are at making money from equity and vice versa.</p>\n\n<p>We like companies with consistently higher ROE over 10. A low ROE means low growth potential.</p>\n\n<p><strong>Past Performance:</strong> We all know &#39;past performance is not indicative of future returns&#39; but it can pay to have a quick look at the stock chart</p>\n\n<p><strong>Step Five: Financials</strong></p>\n\n<p>find the companies latest Yearly or Half-Yearly report. Analyse its Income Statement, Balance Sheet and Cash flow statement.</p>\n\n<p><strong>Step Six: Cap Raise! Dilution Probabilities</strong></p>\n\n<p>As a new investor there can be nothing more frustrating than seeing your share getting hit with Cap Raise after Cap Raise and seeing your shares diluted to nothing. One easy sign that a company is constantly raising capital is through looking at it&#39;s share price and number of shares on issue.</p>\n\n<p>We can also use the financials we read before to try and predict if the company is adequately capitalised.</p>\n\n<p>A capital raise is not necessarily a red flag, but be wary</p>\n\n<p><strong>Step Seven: Buy Sell Ratios and Volume</strong></p>\n\n<p>See if there are a healthy number of buyers and sellers and decent trading volumes. The best way to do this is using your trading platforms</p>\n\n<p><strong>Step Eight: Prospects</strong></p>\n\n<p>When examining a company for your stock DD we should consider its macro and microeconomic factors. Notably regulation and future industry outlook and disruption.</p>\n\n<p><strong>Step Nine: Competition</strong></p>\n\n<p>compare the stock to it&#39;s direct competitors to see how they compare. To do this we are going to go back to step four and compare the company&#39;s fundamentals against its competitors. If the competitors are better then why not consider investing in them instead?</p>\n\n<p>Do they have an economic moat?</p>\n\n<p><strong>Step Ten: Insider Ownership and Management</strong></p>\n\n<p><strong>Insider Ownership:</strong> We generally like companies with large insider ownership. This is big for small cap companies. Skin in the game helps ensure the management&#39;s motives are in line with ours. So we use <a href=\"https://www.marketindex.com.au/\">Simple wall St</a> which shows Insider Ownership and Trading very clearly. We like small cap stocks with ~30% insider ownership and history of owners buying on market. For large cap companies&#39; insider ownership will be lower, 3-5% would be decent in this case.</p>\n\n<p><strong>Are management buying or selling large amounts of shares?</strong> Sudden large selling by management for no apparent reason may hint that management believes the company is overvalued or peaked at that point in time.</p>\n\n<p><strong>Management Experience:</strong> Consider educational and professional backgrounds. One of the most important factors is their experience in the industry. Their reputation is also key. What goals has the management set out for the company? Have the leaders had successful projects in the past, or did they fail?</p>\n\n<p><strong>Bonus Step: Speccies are Sentiment and Hype</strong></p>\n\n<p>After going through every step and doing a thorough DD, it&#39;s important to mention that the market is unpredictable. Even with the most advanced analyses, speccies are just sentiment and hype. By every stretch of fundamental analysis, they are terrible companies, that doesn&#39;t mean you can&#39;t make money off them. Just be ready for the pump-and-dump!</p>\n\n<p><a href=\"https://prophet-invest.com/stock-dd-checklist-for-beginners\">Full analysis if interested</a></p>\n\n<p>Cheers for reading. Hopefully this saves at least someone from getting Motely Fooled into terrible stocks</p>\n</div><!-- SC_ON -->",
  "score": 248,
  "permalink": "/r/stocks/comments/ny3y4l/how_to_ddanalyse_stocks/",
  "subreddit": "stocks",
  "id": "ny3y4l",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009743456
}