{
  "author": "The_Vigilante20",
  "original_created_utc": 1642054574,
  "title": "Why is everyone so oddly judgmental of people wearing pajamas in public?",
  "created_utc": 1642065846,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I work 40 hours a week. I&amp;#39;m depressed. It&amp;#39;s my day off. I need to go to Walmart. I&amp;#39;m not getting dressed up because I don&amp;#39;t have the energy and frankly I don&amp;#39;t care how I look. But so many people on Reddit think it&amp;#39;s &amp;quot;trashy&amp;quot; and have many other often classiest complaints about people who wear pajamas in public. It&amp;#39;s a grocery store, not a job interview. Who cares? Just go about your day and I&amp;#39;ll go about mine.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/s2seo5/why_is_everyone_so_oddly_judgmental_of_people/",
  "subreddit": "TooAfraidToAsk",
  "id": "s2seo5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I work 40 hours a week. I'm depressed. It's my day off. I need to go to Walmart.\nI'm not getting dressed up because I don't have the energy and frankly I don't\ncare how I look. But so many people on Reddit think it's \"trashy\" and have many\nother often classiest complaints about people who wear…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "週40時間働いています。憂鬱だ。今日は休日です。ウォルマートに行きたいんだけど\nオシャレをする気力もないし、正直言って\nどう見えてもいいんです。しかし、Redditでは多くの人がそれを「くだらない」と思い、また多くの\nという不満があります。",
      "title": "どうしてみんな人前でパジャマを着ている人を異様に批判するんだろう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我每周工作40个小时。我很郁闷。今天是我的休息日。我需要去沃尔玛。\n我不打扮，因为我没有精力，坦率地说，我不关心我的样子。\n坦白说，我不关心我看起来如何。但是Reddit上有很多人认为这是 \"垃圾\"，并且有很多\n其他往往是最经典的抱怨，对那些穿...",
      "title": "为什么每个人都对在公共场合穿睡衣的人有如此奇怪的判断？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我每週工作40個小時。我很鬱悶。今天是我的休息日。我需要去沃爾瑪。\n我不打扮，因爲我沒有精力，坦率地說，我不關心我的樣子。\n坦白說，我不關心我看起來如何。但是Reddit上有很多人認爲這是 \"垃圾\"，並且有很多\n其他往往是最經典的抱怨，對那些穿...",
      "title": "爲什麼每個人都對在公共場合穿睡衣的人有如此奇怪的判斷？"
    }
  ]
}