{
  "author": "Impossible-Ad7389",
  "original_created_utc": 1637739504,
  "title": "Unwritten Rules of Crypto",
  "created_utc": 1637768356,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>1: Never marry your bags</p>\n\n<p>No matter how good your coin/token your holding is, it will eventually fall. Instead of being attached to one crypto, take your profit and rotate to the next one. There is always more opportunities out there</p>\n\n<p>2: If your portfolio is over 4 figures, it&#39;s best to get a hardware wallet.</p>\n\n<p>Anything works, Ledge, Trezor, just make sure to buy straight from the official sources and don&#39;t buy off third party services like Amazon</p>\n\n<p>3: Never keep more than 20% of your funds on CEX</p>\n\n<p>Understandable if it&#39;s a ERC20 token, but you should always try to avoid holding most of your coins on a CEX. Even KuCoin, was hacked last year.</p>\n\n<p>4: Don&#39;t be afraid to rotate your assets</p>\n\n<p>If your coin isn&#39;t doing much, it might be better to just sell that crypto (leave a small moonbag) and rotate to something that is doing better</p>\n\n<p>5: Confirmation bias will get you rekt</p>\n\n<p>Stop listening to the good sides of a crypto, and start learning about the downsides of it. For example when you tell a newbie about Ethereum, usually you would talk about all the dApps, ecosystem, etc. Always mention the downside of it for example gas fees</p>\n\n<p>6: Start learning more about DeFi, yield farming, lending borrowing on AAVE, how to swap on Uniswap.</p>\n\n<p>This is great to introduce you to DeFi where you can earn up to 20% a year on stable coins. Yield farming is a great way of making money passively</p>\n\n<p>7: Never reply to DM&#39;s </p>\n\n<p>Reddit, Telegram, Discord, I guarantee you 99% of them are all scams wanting to take your money. Don&#39;t fall for it</p>\n\n<p>8: Don&#39;t click random links</p>\n\n<p>Should be pretty obvious. One wrong mistake and your wallet is gone</p>\n\n<p>9: Always have a exit strategy</p>\n\n<p>Yes we love all our crypto pumping, but have a exit strategy. No one ended up broke taking profits</p>\n\n<p>10: Avoid holding USDT</p>\n\n<p>USDT has been really sketchy lately, hold something decentralized preferably UST or DAI</p>\n\n<p>&#x200B;</p>\n\n<p>There is a lot more to cover, but these are 10 basic rules that is great to start following.</p>\n\n<p>&#x200B;</p>\n\n<p>Part 2 coming</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/CryptoCurrency/comments/r0zmay/unwritten_rules_of_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "r0zmay",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "1: Never marry your bags\n\nNo matter how good your coin/token your holding is, it will eventually fall.\nInstead of being attached to one crypto, take your profit and rotate to the next\none. There is always more opportunities out there\n\n2: If your portfolio is over 4 figures, it's best to get a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1：バッグを結婚しない\n\nあなたが持っているコイン・トークンがどんなに優れていても、いずれは下落してしまいます。\n1つの暗号に固執するのではなく、利益を得て次の暗号へと回転させましょう。\nしましょう。そこには常により多くのチャンスがあります\n\n2: ポートフォリオが4桁以上の場合は...",
      "title": "暗号の不文律"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "1: 永远不要和你的袋子结婚\n\n无论你持有的硬币/代币有多好，它最终都会下跌。\n与其依附于一个加密货币，不如拿着你的利润轮换到下一个\n一个。外面总是有更多的机会\n\n2: 如果你的投资组合超过4位数，最好是找一个...",
      "title": "隐蔽的加密货币规则"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "1: 永遠不要和你的袋子結婚\n\n無論你持有的硬幣/代幣有多好，它最終都會下跌。\n與其依附於一個加密貨幣，不如拿着你的利潤輪換到下一個\n一個。外面總是有更多的機會\n\n2: 如果你的投資組合超過4位數，最好是找一個...",
      "title": "隱蔽的加密貨幣規則"
    }
  ]
}