{
  "author": "hhh888hhhh",
  "the_new_excerpt": "Activist hedge fund Third Point LLC is pushing Intel Corp to explore strategic\nalternatives, including whether it should remain an integrated device\nmanufacturer, according to a letter it sent to the chipmaker's chairman on\nTuesday that was reviewed by Reuters.\n\nThird Point CEO Daniel Loeb wrote to…",
  "original_created_utc": 1609265234,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "维权对冲基金Third Point LLC正在推动英特尔(Intel Corp)探索战略\n替代方案，包括它是否应该保留为集成设备\n制造商，根据它在周四发给这家芯片制造商董事长的一封信\n周二，路透社对此进行了评论。\n\nThird Point首席执行官丹尼尔·勒布致信…",
      "title": "激进的对冲基金正在推动英特尔公司探索战略替代方案"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "維權對沖基金Third Point LLC正在推動英特爾(Intel Corp)探索戰略\n替代方案，包括它是否應該保留爲集成設備\n製造商，根據它在週四發給這家芯片製造商董事長的一封信\n週二，路透社對此進行了評論。\n\nThird Point首席執行官丹尼爾·勒布致信…",
      "title": "激進的對沖基金正在推動英特爾公司探索戰略替代方案"
    }
  ],
  "title": "Activist hedge fund is pushing Intel Corp to explore strategic alternatives",
  "created_utc": 1609281022,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Activist hedge fund Third Point LLC is pushing Intel Corp to explore strategic alternatives, including whether it should remain an integrated device manufacturer, according to a letter it sent to the chipmaker&#39;s chairman on Tuesday that was reviewed by Reuters.</p>\n\n<p>Third Point CEO Daniel Loeb wrote to Intel chairman Omar Ishrak calling for immediate action to boost the company&#39;s position as a major provider of processor chips for PCs and data centers. The New York-based fund has amassed a nearly $1 billion stake in Intel. </p>\n\n<p>&quot;Without immediate change at Intel, we fear that America&#39;s access to leading-edge semiconductor supply will erode, forcing the U.S. to rely more heavily on a geopolitically unstable East Asia to power everything from PCs to data centers to critical infrastructure and more,&quot; Loeb wrote.</p>\n\n<p><a href=\"https://finance.yahoo.com/news/exclusive-hedge-fund-third-point-173310034.html\">Exclusive: Hedge fund Third Point urges Intel to explore deal options</a></p>\n</div><!-- SC_ON -->",
  "score": 904,
  "permalink": "/r/investing/comments/kmjg3d/activist_hedge_fund_is_pushing_intel_corp_to/",
  "subreddit": "investing",
  "id": "kmjg3d",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609495334773
}