{
  "author": "3STmotivation",
  "the_new_excerpt": "A little over a month ago, I wrote a post about why I believe commodities and\ncommodity related equities would provide a better return on invested capital\ncompared to other sectors in the market (tech, consumer goods, healthcare etc.)\nin the coming decade. Why I believe this is the case, is simply a…",
  "original_created_utc": 1609181141,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "一个多月前，我写了一篇关于我为什么相信大宗商品和\n与商品相关的股票将提供更好的投资资本回报。\n与市场中的其他行业(科技、消费品、医疗保健等)相比\n在接下来的十年里。为什么我相信是这样的呢，就是一个简单的…",
      "title": "商品投资第二部分：新一轮周期的开始及其带来的巨大机遇"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "一個多月前，我寫了一篇關於我爲什麼相信大宗商品和\n與商品相關的股票將提供更好的投資資本回報。\n與市場中的其他行業(科技、消費品、醫療保健等)相比\n在接下來的十年裏。爲什麼我相信是這樣的呢，就是一個簡單的…",
      "title": "商品投資第二部分：新一輪週期的開始及其帶來的巨大機遇"
    }
  ],
  "title": "Commodity investing part 2: the start of a new cycle and the great opportunities it will bring",
  "created_utc": 1609227409,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A little over a month ago, I wrote a post about why I believe commodities and commodity related equities would provide a better return on invested capital compared to other sectors in the market (tech, consumer goods, healthcare etc.) in the coming decade. Why I believe this is the case, is simply a factor of how markets work and how they have worked for the past hundreds of years. The past decade has seen an incredible run in the general equities market and most notably the tech giants (and subsequently the Nasdaq). However, recency bias can be a blinding mistake for many investors. Thinking something will keep going up because it has done so in recent times, is not always the case and even if it will, chances are the subsequent run up won’t be nearly as big.</p>\n\n<p>So while this part of the market has run up, commodities staggered and lagged behind. Years of underinvestment followed the end of the previous commodity bull market and as these things go, as was shown time and again throughout history, the cycle is about to turn. When there is severe underinvestment in a sector, supply gets constrained because things like exploration and development of new sources gets cut. This results in a situation with one of two outcomes. Either we replace the commodity in questions in its entirety and it ceases to exit (extremely unlikely with the commodities I covered) or the price goes up, because now there is not enough supply to meet ever growing demand. As these companies are heavily leveraged to the price of the respective underlying commodity, operating margin increases and so does free cash flow, allowing the share prices of these companies to go up exponentially. At high prices, more and more new projects will be explored for, developed and brough into production, after which we will get more supply and the price will drop.</p>\n\n<p>These cycles have been in place ever since the concept of the stock market has been in place and there is no reason for that to change now. We are standing at the start of another major commodity bull market which will take us back into this upcycle. Uranium and copper have run up significantly and after a period of consolidation since August, I fully believe gold and silver stocks will perform amazingly from the start of the year into Q2 of 2021. Those who participate stand to profit greatly off of playing this new cycle. I am not saying to position your entire portfolio into this part of the market, but having no significant exposure will in my view be a foolish decision.</p>\n\n<p>To add to my list of commodities I am bullish on for the coming decade, I will add Cobalt, Nickel, Oil&amp;Gas and Potash. There are several other and opportunities can be found for those willing to do the work. Best of luck out there and always make sure to do your own due diligence.  </p>\n\n<p>In my previous post, I covered the following sectors and companies, this is how they performed in the time between that post and this one:</p>\n\n<p>Uranium:</p>\n\n<p>Cameco +43%<br/>\n Energy Fuels +147%<br/>\n Denison Mines +105%  </p>\n\n<p>Silver:<br/>\n Pan American Silver +2%<br/>\n First Majestic Silver  +19%<br/>\n SSR Mining +2%  </p>\n\n<p>Copper:<br/>\n Freeport Mcmoran +17%<br/>\n Rio Tinto +18%<br/>\n Lundin Mining +20%  </p>\n\n<p>Gold:<br/>\n Barrick Gold -10%<br/>\n Agnico-Eagle Mines -3%<br/>\n B2Gold -9%  </p>\n\n<p>Lithium:</p>\n\n<p>Albemarle +17%<br/>\n SQM +7%<br/>\n Livent +22%  </p>\n\n<p>In the same period, the three major US indexes are up:<br/>\n S&amp;P 500 +3%<br/>\n Nasdaq +8%<br/>\n Dow Jones +2%  </p>\n\n<p>Some popular stocks on this subreddit in that time:<br/>\n Tesla +64%<br/>\n Amazon +5%<br/>\n Apple +13%<br/>\n NIO -3%<br/>\n Microsoft +4%</p>\n\n<p>TLDR: we are at the beginning of another upcycle in commodities and this bull market will create great returns on investment for those who choose to participate. I believe having a significant allocation of your portfolio in this part of the market is most definitely worth it, as in my view it will outperform other sectors and the general market.</p>\n</div><!-- SC_ON -->",
  "score": 66,
  "permalink": "/r/investing/comments/klw9jz/commodity_investing_part_2_the_start_of_a_new/",
  "subreddit": "investing",
  "id": "klw9jz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609495334771
}