{
  "approved_at_utc": null,
  "subreddit": "Bogleheads",
  "selftext": "Something I've seen often on this sub is people advocating for buying REITs in addition to VTI, which is about 3% REITs. This seems to come from the (not unreasonable) conventional wisdom that owning real estate provides good returns that diversify you from the risks of the market. The thinking then goes that buying REITs is a good option for those who may not have enough to own a whole property, or for wealthy people who are lazy and don't want to deal with tenants.\n\nI'm not here to say you should never buy an REIT or an REIT index, but I think there's a lot of misconceptions surrounding them that I think buyers should be aware of. You should watch [this excellent Ben Felix video on the subject](https://www.youtube.com/watch?v=IzK5x3LlsUU), but for the lazy, here are some points to consider.\n\n\\- \"While stock and bond factors explain the returns of real estate (REITs), the risk of real estate is primarily driven by the idiosyncratic risk of the real estate sector.\" Watch the Ben Felix video for more explanation, but the gist is that there's **lots of unique risks to real estate** (2008, anyone?), no expected positive return relative to stocks/bonds, and because the **gains are explained by stocks/bond factors**, there's **not a diversification benefit**. Hence \"REITs are not adding any expected return in excess of what could be achieved through stocks and bonds, but they are adding additional uncompensated risk.\"\n\n\\- Because REIT returns are driven by stocks/bonds with uncompensated risk, REITs are **probably not a separate asset class**. This means that overweighting them is similar to overweighting something like healthcare, technology, consumer staples, or energy, which most people on this sub would probably agree does not belong in a \"boglehead\" portfolio\n\n\\-  **Many REIT indices**, especially VNQ, **are probably not what a layperson would expect**. You are not buying a fraction of ownership of the residential real estate market, rather, you are buying a fraction of companies which Vanguard (in the case of VNQ) classifies as REITs. **VNQ's largest holding is a cell phone tower company (7%)**, and it has major holdings in companies that work on underground storage centers, data centers, malls, highway signs, casino properties, hospitals, personal storage facilities, and other things that probably don't come to mind when you think of \"real estate\". 13% of VNQ is just 3 different cell phone tower companies, which starts to explain why REITs behave much more like stocks than real estate. **Only 15% of VNQ is in residential REITs.**\n\n\\- If you own a home, or plan on owning a home, **a massive amount of your net worth is probably already tied up in real estate.** Why would you want to further expose yourself to something we know has quite a lot of risk?\n\n\\- REITs are very tax inefficient in a brokerage account.\n\nThis is not to say you should never buy property. Literally **owning property is** a **different** conversation **than investing in companies that own property**, and may be more justified depending on your particular life circumstances.",
  "author_fullname": "t2_taoqa",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "So you want to add REITs to your portfolio....",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/Bogleheads",
  "hidden": false,
  "pwls": 7,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": true,
  "name": "t3_pcw1ly",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.95,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 65,
  "total_awards_received": 1,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 65,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": 1630102336,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {
    "gid_1": 1
  },
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1630098130,
  "link_flair_type": "text",
  "wls": 7,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.Bogleheads",
  "allow_live_comments": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Something I&#39;ve seen often on this sub is people advocating for buying REITs in addition to VTI, which is about 3% REITs. This seems to come from the (not unreasonable) conventional wisdom that owning real estate provides good returns that diversify you from the risks of the market. The thinking then goes that buying REITs is a good option for those who may not have enough to own a whole property, or for wealthy people who are lazy and don&#39;t want to deal with tenants.</p>\n\n<p>I&#39;m not here to say you should never buy an REIT or an REIT index, but I think there&#39;s a lot of misconceptions surrounding them that I think buyers should be aware of. You should watch <a href=\"https://www.youtube.com/watch?v=IzK5x3LlsUU\">this excellent Ben Felix video on the subject</a>, but for the lazy, here are some points to consider.</p>\n\n<p>- &quot;While stock and bond factors explain the returns of real estate (REITs), the risk of real estate is primarily driven by the idiosyncratic risk of the real estate sector.&quot; Watch the Ben Felix video for more explanation, but the gist is that there&#39;s <strong>lots of unique risks to real estate</strong> (2008, anyone?), no expected positive return relative to stocks/bonds, and because the <strong>gains are explained by stocks/bond factors</strong>, there&#39;s <strong>not a diversification benefit</strong>. Hence &quot;REITs are not adding any expected return in excess of what could be achieved through stocks and bonds, but they are adding additional uncompensated risk.&quot;</p>\n\n<p>- Because REIT returns are driven by stocks/bonds with uncompensated risk, REITs are <strong>probably not a separate asset class</strong>. This means that overweighting them is similar to overweighting something like healthcare, technology, consumer staples, or energy, which most people on this sub would probably agree does not belong in a &quot;boglehead&quot; portfolio</p>\n\n<p>-  <strong>Many REIT indices</strong>, especially VNQ, <strong>are probably not what a layperson would expect</strong>. You are not buying a fraction of ownership of the residential real estate market, rather, you are buying a fraction of companies which Vanguard (in the case of VNQ) classifies as REITs. <strong>VNQ&#39;s largest holding is a cell phone tower company (7%)</strong>, and it has major holdings in companies that work on underground storage centers, data centers, malls, highway signs, casino properties, hospitals, personal storage facilities, and other things that probably don&#39;t come to mind when you think of &quot;real estate&quot;. 13% of VNQ is just 3 different cell phone tower companies, which starts to explain why REITs behave much more like stocks than real estate. <strong>Only 15% of VNQ is in residential REITs.</strong></p>\n\n<p>- If you own a home, or plan on owning a home, <strong>a massive amount of your net worth is probably already tied up in real estate.</strong> Why would you want to further expose yourself to something we know has quite a lot of risk?</p>\n\n<p>- REITs are very tax inefficient in a brokerage account.</p>\n\n<p>This is not to say you should never buy property. Literally <strong>owning property is</strong> a <strong>different</strong> conversation <strong>than investing in companies that own property</strong>, and may be more justified depending on your particular life circumstances.</p>\n</div><!-- SC_ON -->",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2shb7",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "pcw1ly",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "JohnRusty",
  "discussion_type": null,
  "num_comments": 3,
  "send_replies": true,
  "whitelist_status": "some_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/Bogleheads/comments/pcw1ly/so_you_want_to_add_reits_to_your_portfolio/",
  "parent_whitelist_status": "some_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/Bogleheads/comments/pcw1ly/so_you_want_to_add_reits_to_your_portfolio/",
  "subreddit_subscribers": 89642,
  "created_utc": 1630103888,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1630098130,
  "the_new_excerpt": "Something I've seen often on this sub is people advocating for buying REITs in\naddition to VTI, which is about 3% REITs. This seems to come from the (not\nunreasonable) conventional wisdom that owning real estate provides good returns\nthat diversify you from the risks of the market. The thinking then…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブでよく見かけるのは、VTIに加えてREITを買うことを提唱している人です。\nVTIに加えて、REITを買うことを勧めています。これは、不動産を所有すると良いリターンが得られるという（不合理ではない）常識から来ているようです。\nこれは、不動産を所有することで良いリターンが得られ、それを分散することで\n市場のリスクから分散させることができます。その時の考え方は...",
      "title": "ポートフォリオにREITを加えたいとお考えですか？...."
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在这个子网站上经常看到一些人主张在VTI之外购买REITs。\n除了VTI之外，还有3%的REITs。这似乎是来自于一个（并非不合理的\n的传统智慧，即拥有房地产可以提供良好的回报\n将你从市场的风险中分散出来。那么，这种想法...",
      "title": "所以你想把房地产投资信托基金加入你的投资组合...."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在這個子網站上經常看到一些人主張在VTI之外購買REITs。\n除了VTI之外，還有3%的REITs。這似乎是來自於一個（並非不合理的\n的傳統智慧，即擁有房地產可以提供良好的回報\n將你從市場的風險中分散出來。那麼，這種想法...",
      "title": "所以你想把房地產投資信託基金加入你的投資組合...."
    }
  ],
  "source_updated_at": 1630662022669
}