{
  "author": "KAX1107",
  "original_created_utc": 1627400076,
  "title": "Fake News: Amazon did not deny interest in crypto. They just officially confirmed it",
  "created_utc": 1627428639,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>&quot;Notwithstanding our interest in the space, the speculation that has ensued around our specific plans for cryptocurrencies is not true. We remain focused on exploring what this could look like for customers shopping on Amazon&quot;</p>\n\n<p>This was the exact official statement from Amazon. What does this mean?</p>\n\n<p>Notwithstanding means &quot;in spite of&quot;. So in simple words,</p>\n\n<p>&quot;In spite of our interest in crypto space, the insider speculation is not true. We are focused on exploring how crypto payments can help our customers&quot;</p>\n\n<p>Amazon just officially confirmed that they are exploring crypto payments without giving any specific timeline.</p>\n</div><!-- SC_ON -->",
  "score": 158,
  "permalink": "/r/CryptoCurrency/comments/osp6v6/fake_news_amazon_did_not_deny_interest_in_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "osp6v6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "\"Notwithstanding our interest in the space, the speculation that has ensued\naround our specific plans for cryptocurrencies is not true. We remain focused on\nexploring what this could look like for customers shopping on Amazon\"\n\nThis was the exact official statement from Amazon. What does this…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "「この分野に興味を持っているにもかかわらず、私たちの具体的な計画にまつわる憶測が広まっています。\n暗号通貨に対する当社の具体的な計画に関する憶測は事実ではありません。私たちは引き続き\nアマゾンでお買い物をされるお客様にとってどのようなものになるのかを検討することに集中しています」。\n\nこれがAmazonの正確な公式声明でした。これは何を意味しているのでしょうか。",
      "title": "フェイクニュース。アマゾンは暗号への関心を否定していない。公式に確認しただけです"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "\"尽管我们对这一领域感兴趣，但随之而来的关于我们对加密货币的具体计划的猜测并不真实。\n围绕我们对加密货币的具体计划的猜测是不真实的。我们仍然专注于\n探讨这对在亚马逊上购物的客户来说可能是什么样子的\"\n\n这是亚马逊的确切官方声明。这有什么...",
      "title": "虚假的新闻。亚马逊并没有否认对加密货币的兴趣。他们只是正式确认了这一点"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "\"儘管我們對這一領域感興趣，但隨之而來的關於我們對加密貨幣的具體計劃的猜測並不真實。\n圍繞我們對加密貨幣的具體計劃的猜測是不真實的。我們仍然專注於\n探討這對在亞馬遜上購物的客戶來說可能是什麼樣子的\"\n\n這是亞馬遜的確切官方聲明。這有什麼...",
      "title": "虛假的新聞。亞馬遜並沒有否認對加密貨幣的興趣。他們只是正式確認了這一點"
    }
  ]
}