{
  "author": "sevensimons",
  "original_created_utc": 1642628654,
  "title": "Why did massive massive cannibalism occur in the Guangxi Massacre (1967–1976) in China if there was no famine?",
  "created_utc": 1642663941,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I understand why there was torture of intellectuals and group violence but it seems odd that this is one of the only times in History I&amp;#39;ve heard of where a country&amp;#39;s population eat each other without a need for sustenance . &lt;/p&gt;\n\n&lt;p&gt;Were there specific officials ordering this? &lt;/p&gt;\n\n&lt;p&gt;Were people going hungry in the country at the time?&lt;/p&gt;\n\n&lt;p&gt;Are there more instances of nation wide cannibalism  without famine across history?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/s81fmu/why_did_massive_massive_cannibalism_occur_in_the/",
  "subreddit": "AskHistorians",
  "id": "s81fmu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I understand why there was torture of intellectuals and group violence but it\nseems odd that this is one of the only times in History I've heard of where a\ncountry's population eat each other without a need for sustenance .\n\nWere there specific officials ordering this?\n\nWere people going hungry in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "知識人への拷問や集団暴力があったことは理解できるが、それよりも\nこれは、私が聞いたことのある歴史の中で唯一の出来事であり、そのような事態が起こるのは奇妙に思えます。\nその国の国民は、糧を必要とせずにお互いを食べ合っている。\n\nこれを命令する特定の役人がいたのだろうか？\n\n国民が飢えていたのか...",
      "title": "飢饉がなかったのに、なぜ中国の広西大虐殺（1967-1976）で大規模な人肉食が起こったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我理解为什么会出现对知识分子的酷刑和群体暴力，但这似乎很奇怪，这是历史上我所听说的唯一一次对知识分子的酷刑。\n但奇怪的是，这是我所听说的历史上唯一的一次，一个国家的人民互相残杀。\n一个国家的人民在不需要养活自己的情况下互相残杀。\n\n是否有具体的官员下令这样做？\n\n人们在饥饿中...",
      "title": "如果没有饥荒，为什么在中国的广西大屠杀（1967-1976）中会出现大规模的吃人现象？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我理解爲什麼會出現對知識分子的酷刑和羣體暴力，但這似乎很奇怪，這是歷史上我所聽說的唯一一次對知識分子的酷刑。\n但奇怪的是，這是我所聽說的歷史上唯一的一次，一個國家的人民互相殘殺。\n一個國家的人民在不需要養活自己的情況下互相殘殺。\n\n是否有具體的官員下令這樣做？\n\n人們在飢餓中...",
      "title": "如果沒有饑荒，爲什麼在中國的廣西大屠殺（1967-1976）中會出現大規模的喫人現象？"
    }
  ]
}