{
  "author": "MathematicianNo1596",
  "original_created_utc": 1634353316,
  "title": "Why don’t we call countries what they call themselves?",
  "created_utc": 1634374318,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If Germany calls itself Deutschland, why do we call it “Germany” in English and “Alemania” in Spanish, for example? </p>\n\n<p>If Spain calls itself España, why do we have an anglicized name? And I get the ñ doesn’t exist in the English alphabet, but we could easily say Espanya or something similar. </p>\n\n<p>I think someone once told me that the Armenian name for Armenia is pronounced like Hayastan… so where on earth did “Armenia” come from? (Side note- same person also told me it came from the fact that Armen is a super common name there.  Idk whether that’s actually where it came from.)</p>\n\n<p>Why is this a thing?</p>\n</div><!-- SC_ON -->",
  "score": 108,
  "permalink": "/r/NoStupidQuestions/comments/q93k04/why_dont_we_call_countries_what_they_call/",
  "subreddit": "NoStupidQuestions",
  "id": "q93k04",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "If Germany calls itself Deutschland, why do we call it “Germany” in English and\n“Alemania” in Spanish, for example?\n\nIf Spain calls itself España, why do we have an anglicized name? And I get the ñ\ndoesn’t exist in the English alphabet, but we could easily say Espanya or\nsomething similar.\n\nI think…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ドイツがドイッチュラントを名乗るなら、なぜ英語では「Germany」、スペイン語では\nスペイン語では \"Alemania \"などと呼ぶのでしょうか？\n\nスペインがEspañaを名乗るなら、なぜ英語化された名前を持っているのか？また、英語のアルファベットにはñ\nは英語のアルファベットには存在しませんが、Espanyaなどと簡単に言えますよね。\n似たようなものです。\n\nと思うのですが・・・。",
      "title": "なぜ、私たちは国を自分たちの名前で呼ばないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果德国称自己为德国，为什么我们在英语中称它为 \"Germany\"，而在西班牙语中称它为\n例如，在西班牙语中叫 \"Alemania\"？\n\n如果西班牙称自己为España，为什么我们会有一个英语化的名字？而且我知道，ñ\n不存在于英语字母表中，但我们可以很容易地说Espanya或\n类似的东西。\n\n我想...",
      "title": "我们为什么不把国家称为他们自己的名字呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果德國稱自己爲德國，爲什麼我們在英語中稱它爲 \"Germany\"，而在西班牙語中稱它爲\n例如，在西班牙語中叫 \"Alemania\"？\n\n如果西班牙稱自己爲España，爲什麼我們會有一個英語化的名字？而且我知道，ñ\n不存在於英語字母表中，但我們可以很容易地說Espanya或\n類似的東西。\n\n我想...",
      "title": "我們爲什麼不把國家稱爲他們自己的名字呢？"
    }
  ]
}