{
  "author": "Washedout_turtle",
  "original_created_utc": 1641667277,
  "title": "Why did President Bush call Senator Biden during the September 11th attack?",
  "created_utc": 1641675916,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I just finished a tour of the George W. Bush Presidential Center. One exhibit is about the September 11th attack, and you can read the minutes of President Bush during that day.&lt;/p&gt;\n\n&lt;p&gt;While going through the minutes, they have reported that President Bush called and talked to Senator Biden, but it doesn’t appear that he called any other Senators. &lt;/p&gt;\n\n&lt;p&gt;Is there a reason why President Bush called a Senator from Delaware during that hectic day? What was talked about during that call? Has President Bush or President Biden talked about that call publicly?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/rz6o5u/why_did_president_bush_call_senator_biden_during/",
  "subreddit": "AskHistorians",
  "id": "rz6o5u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I just finished a tour of the George W. Bush Presidential Center. One exhibit is\nabout the September 11th attack, and you can read the minutes of President Bush\nduring that day.\n\nWhile going through the minutes, they have reported that President Bush called\nand talked to Senator Biden, but it…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ジョージ・W・ブッシュ大統領センターの見学を終えたところです。展示のひとつは\n9月11日のテロについて、ブッシュ大統領の議事録を読むことができます。\nその日のうちに\n\nその議事録を見ていると、ブッシュ大統領から電話があったという報告があります。\nバイデン上院議員と話をしたが、それは...。",
      "title": "9.11テロの時、ブッシュ大統領はなぜバイデン上院議員に電話をかけたのですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我刚刚结束了对乔治-W-布什总统中心的参观。其中一个展览是\n关于9月11日的袭击，你可以阅读布什总统在那一天的会议记录\n在那一天的记录。\n\n在翻阅会议记录时，他们曾报道说，布什总统打电话给\n并与拜登参议员交谈，但它...",
      "title": "为什么布什总统在9月11日袭击期间给拜登参议员打电话？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我剛剛結束了對喬治-W-布什總統中心的參觀。其中一個展覽是\n關於9月11日的襲擊，你可以閱讀布什總統在那一天的會議記錄\n在那一天的記錄。\n\n在翻閱會議記錄時，他們曾報道說，布什總統打電話給\n並與拜登參議員交談，但它...",
      "title": "爲什麼布什總統在9月11日襲擊期間給拜登參議員打電話？"
    }
  ]
}