{
  "author": "Non-ducor_duco",
  "the_new_excerpt": "Hi all,\n\nAfter another nick this morning with my fancy five-blade, factory-manufactured\nrazor resulting in a surprisingly garish torrent of blood pouring down my neck,\nI found myself wondering -- would this have been a much less trivial occurrence\nin ancient Rome (or indeed anywhere else on the…",
  "original_created_utc": 1611143651,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "大家好\n\n今天早上，我的花哨的五片刀片，工厂制造的，又有了一个缺口。\n剃刀的结果是，令人惊讶的华丽的血流倾泻在我的脖子上。\n\n在古罗马（或其他任何地方）。",
      "title": "为什么在古代世界中，剃须划痕（和其他琐碎的伤口）相对来说不会经常导致死亡？或者，如果有的话，为什么有些文化继续强调刮胡子的时尚，比如共和制的罗马？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好\n\n今天早上，我的花哨的五片刀片，工廠製造的，又有了一個缺口。\n剃刀的結果是，令人驚訝的華麗的血流傾瀉在我的脖子上。\n\n在古羅馬（或其他任何地方）。",
      "title": "爲什麼在古代世界中，剃鬚劃痕（和其他瑣碎的傷口）相對來說不會經常導致死亡？或者，如果有的話，爲什麼有些文化繼續強調刮鬍子的時尚，比如共和制的羅馬？"
    }
  ],
  "title": "Why did shaving nicks (and other trivial wounds) not relatively frequently result in death in the ancient world? Or, if it did, why did some cultures continue to place an emphasis on clean-shaven fashion, like republican Rome?",
  "created_utc": 1611160374,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi all,</p>\n\n<p>After another nick this morning with my fancy five-blade, factory-manufactured razor resulting in a surprisingly garish torrent of blood pouring down my neck, I found myself wondering -- would this have been a much less trivial occurrence in ancient Rome (or indeed anywhere else on the planet pre-Alexander Fleming)?</p>\n\n<p>Before the advent of antibiotics and effective infection control, any wound could become infected and progress to gangrene or septicemia with, in my understanding, relatively few options available to the wounded person to staunch the progress of the infection. We hear plenty about this in early-modern warfare -- took a musket ball to the pinky toe, cut off the leg to ward off gangrene (perhaps a slight embellishment) -- but I realized I don&#39;t hear very much about male Roman citizens dying en masse from shaving.</p>\n\n<p>Yet, with unclean water, no antibiotics, and razors that almost certainly were less gentle, uniform and delicate (and less clean) than my factory-mass-produced Gillettes, it&#39;d seem to me rather likely that minor shaving wounds would occur often, and that they might well become infected with ease and progress to death (especially as you can&#39;t amputate the head as easily as you can a limb -- or at least not without causing unintended side effects such as death). </p>\n\n<p>I know republican and early imperial Rome had a particular stylistic emphasis on clean-shaven males, to the point of wearing a moustache being seen (if I understand correctly) as a clear political/ethnic statement on Gallic/Germanic heritage. So let&#39;s take them as an example. What gives? Were they really dropping like flies from shaving, quaking in fear at the thought of their bathroom in the morning?</p>\n\n<p>Put another way, why would any culture with even the most basic understanding of wound infection (which the Romans certainly had -- get wound, starts going all smelly, bad news) promote a stylistic motif like shaving that would kill significant amounts of its adherents?</p>\n\n<p>Or, perhaps I&#39;ve missed something, and the reason I don&#39;t hear about the tragic shaving death of 35% of Rome&#39;s emperors is because it didn&#39;t happen, and my initial premise is faulty -- shaving and other trivial wounds didn&#39;t result in infection, perhaps, or they knew how to combat minor infections of that variety. I don&#39;t know.</p>\n\n<p>But I&#39;m very curious! Hope someone knows the answer! </p>\n\n<p>Thanks, as ever, <a href=\"/r/AskHistorians\">r/AskHistorians</a>, you are (though it&#39;s oft-said) the best community on Reddit by a country mile.</p>\n</div><!-- SC_ON -->",
  "score": 121,
  "permalink": "/r/AskHistorians/comments/l17qq7/why_did_shaving_nicks_and_other_trivial_wounds/",
  "subreddit": "AskHistorians",
  "id": "l17qq7",
  "is_self": true,
  "media": null,
  "is_video": false
}