{
  "author": "helplessdelta",
  "original_created_utc": 1640300334,
  "title": "I seem to almost exclusively attract and am attracted to women with mental health and/or housing security issues. Should this pattern be concerning?",
  "created_utc": 1640327282,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It’s not that I’m particularly attracted to women that have mental health issues, but it seems that my “type”, which I guess I could vaguely describe as alternative, is more likely to have mental health issues and problems with housing security.&lt;/p&gt;\n\n&lt;p&gt;For example, of the last 5 people I’ve slept with, 2 of them have had dissociative or schizoeffective disorders and 2 were essentially homeless and crashing at my place.&lt;/p&gt;\n\n&lt;p&gt;It makes me wonder if this is indicative of an issue on my end and if there’s a deeper answer as to why I seem to be attracted to “broken” (for lack of a better term) women and why they’re attracted to me.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/rn7qpy/i_seem_to_almost_exclusively_attract_and_am/",
  "subreddit": "TooAfraidToAsk",
  "id": "rn7qpy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It’s not that I’m particularly attracted to women that have mental health\nissues, but it seems that my “type”, which I guess I could vaguely describe as\nalternative, is more likely to have mental health issues and problems with\nhousing security.\n\nFor example, of the last 5 people I’ve slept with, 2…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "特にメンタルヘルスの女性に惹かれるわけではありません。\nしかし、私の「タイプ」は、漠然とした表現になりますが、どうやら\nを持つ人が多く、精神的な問題を抱えることが多いようです。\n住宅確保\n\n例えば、過去に寝た5人のうち、2人は...",
      "title": "私は、精神衛生上、あるいは住宅保障上の問題を抱えた女性にしか惹かれないし、惹かれないようだ。このパターンを気にする必要があるでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这并不是说我特别喜欢有心理健康问题的女性。\n但似乎我的 \"类型\"，我想我可以模糊地描述为\n另类，更有可能有心理健康问题和住房安全问题。\n住房安全问题。\n\n例如，在过去和我睡过的5个人中，有2个...",
      "title": "我似乎几乎只吸引和被吸引到有心理健康和/或住房安全问题的女性。这种模式应该引起注意吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這並不是說我特別喜歡有心理健康問題的女性。\n但似乎我的 \"類型\"，我想我可以模糊地描述爲\n另類，更有可能有心理健康問題和住房安全問題。\n住房安全問題。\n\n例如，在過去和我睡過的5個人中，有2個...",
      "title": "我似乎幾乎只吸引和被吸引到有心理健康和/或住房安全問題的女性。這種模式應該引起注意嗎？"
    }
  ]
}