{
  "author": "SpacedSkaterBoy",
  "original_created_utc": 1641841885,
  "title": "Does anyone else want to move to a small village somewhere in the middle of nowhere, far away from modern society and just live without internet?",
  "created_utc": 1641877230,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Long ago I had a panic attack and since then I have been living with a lot of stress and panic in my life. When I got the panic attack I didn&amp;#39;t know what it was and I literally thought that I was about to get a heart attack and die in my bed. Since then the idea of death has been dwelling on me, and while learning about it and coming to peace with the idea of it, I still think a lot about what I want to do with my life before it inevitably comes to an end.&lt;/p&gt;\n\n&lt;p&gt;I really really wish to just live in a village with like 200 inhabitants in a nice beautiful place in the middle of nowhere, where there is no internet and anything like that. Just living the rest of my life as the owner of a small farm growing my own crops and living off my own food.&lt;/p&gt;\n\n&lt;p&gt;I have, especially since covid, been starting to look down on modern society, it just makes me sad. I started to see how fake everything is. Everything is an ad, or a fight for popularity. People are becoming more and more possessed by social media and it just sucks to see.&lt;/p&gt;\n\n&lt;p&gt;I talked to my parents and they told me they understood what I meant. So after I finish university I will look into all the possibilities I have. Of course I wont be able to achieve my &amp;quot;my neighbor totoro&amp;quot;-type dream life (or stardew valley), I really want to move somewhere without internet and people.&lt;/p&gt;\n\n&lt;p&gt;Does anyone know a place on reddit where there&amp;#39;s other people like me who I can talk to?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 108,
  "permalink": "/r/NoStupidQuestions/comments/s0ruea/does_anyone_else_want_to_move_to_a_small_village/",
  "subreddit": "NoStupidQuestions",
  "id": "s0ruea",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Long ago I had a panic attack and since then I have been living with a lot of\nstress and panic in my life. When I got the panic attack I didn't know what it\nwas and I literally thought that I was about to get a heart attack and die in my\nbed. Since then the idea of death has been dwelling on me,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昔、パニック発作になり、それ以来、いろいろなことを考えながら生活しています。\nストレスやパニックを感じながら生活しています。パニック発作が起きたとき、私はそれが何なのかわかりませんでした。\nこのまま心臓発作を起こして死んでしまうのではと思ったほどです。\nのベッドに寝ます。それ以来、死の観念が私の中に宿っているのです、、、。",
      "title": "現代社会から遠く離れたどこかの小さな村に移住して、ただひたすらインターネットのない生活を送りたいと思う人はいないだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "很久以前，我有一次恐慌症发作，从那时起，我就一直生活在大量的\n压力和恐慌的生活。当我的恐慌症发作时，我不知道那是什么。\n我真的以为我即将心脏病发作，死在我的床上。\n床上死去。从那时起，死亡的想法就一直在我身上徘徊，...",
      "title": "还有人想搬到偏远地区的某个小村庄，远离现代社会，只过没有网络的生活吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "很久以前，我有一次恐慌症發作，從那時起，我就一直生活在大量的\n壓力和恐慌的生活。當我的恐慌症發作時，我不知道那是什麼。\n我真的以爲我即將心臟病發作，死在我的牀上。\n牀上死去。從那時起，死亡的想法就一直在我身上徘徊，...",
      "title": "還有人想搬到偏遠地區的某個小村莊，遠離現代社會，只過沒有網絡的生活嗎？"
    }
  ]
}