{
  "author": "realdisgrace",
  "original_created_utc": 1640012094,
  "title": "I live in an area that was hit bad by the tornado (Kentucky). I’ve been without electricity since December 10. My utility company sent me this message yesterday and I’m not exactly sure what all of this means:",
  "created_utc": 1640024313,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;From utility company: &lt;/p&gt;\n\n&lt;p&gt;“Your service is an old direct buried service (not in conduit) that was installed years ago. It was damaged by the tornado. You will need to contact an electrician and have it replaced to code (with conduit) before we can restore power to your home. I believe the guys attempted to make contact this morning and could not reach anyone to speak to or they would have explained it to you at that time (that is coming in second hand from the field). You can call in the morning and speak to an engineer or go ahead and procure an electrician and they will know what to do.”&lt;/p&gt;\n\n&lt;p&gt;Is this going to cost an arm and a leg? Will I likely be displaced for longer?\nOr is this relatively easy? Why wouldn’t the utility company do this/put me in conduit? What is conduit?!&lt;/p&gt;\n\n&lt;p&gt;Any feedback would be great. I’m calling an electrician shortly. &lt;/p&gt;\n\n&lt;p&gt;Extra info: I am on my own transformer. This is in Bowling Green, KY.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 111,
  "permalink": "/r/NoStupidQuestions/comments/rkp277/i_live_in_an_area_that_was_hit_bad_by_the_tornado/",
  "subreddit": "NoStupidQuestions",
  "id": "rkp277",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "From utility company:\n\n“Your service is an old direct buried service (not in conduit) that was\ninstalled years ago. It was damaged by the tornado. You will need to contact an\nelectrician and have it replaced to code (with conduit) before we can restore\npower to your home. I believe the guys…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "電力会社から\n\n「あなたのサービスは、古い直埋設サービス（電線管ではない）です。\n年前に設置されました。竜巻で被害を受けました。竜巻で破損したため、業者に依頼する必要があります。\n電気技師に依頼し、規格に沿った（電線管を使った）交換を行った上で、復旧させることができます。\nを供給しています。確か、あの人たちは...",
      "title": "私は、竜巻の被害が大きかった地域（ケンタッキー州）に住んでいます。12月10日から電気が使えなくなりました。昨日、電力会社からこのメッセージが送られてきたのですが、このすべてが何を意味するのか、よくわかりません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "来自公用事业公司。\n\n\"您的服务是多年前安装的旧的直埋式服务（非管道式）。\n几年前安装的。它被龙卷风损坏了。你需要联系一个\n在我们恢复供电之前，你需要联系电工，将其更换为符合标准的（管道）。\n电力供应给你的家。我相信这些人...",
      "title": "我住在一个被龙卷风严重打击的地区（肯塔基州）。我从12月10日开始就一直没有电。我的公用事业公司昨天给我发了这条信息，我不太清楚这一切意味着什么。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "來自公用事業公司。\n\n\"您的服務是多年前安裝的舊的直埋式服務（非管道式）。\n幾年前安裝的。它被龍捲風損壞了。你需要聯繫一個\n在我們恢復供電之前，你需要聯繫電工，將其更換爲符合標準的（管道）。\n電力供應給你的家。我相信這些人...",
      "title": "我住在一個被龍捲風嚴重打擊的地區（肯塔基州）。我從12月10日開始就一直沒有電。我的公用事業公司昨天給我發了這條信息，我不太清楚這一切意味着什麼。"
    }
  ]
}