{
  "author": "amandamichelle90",
  "original_created_utc": 1627682709,
  "title": "A thread of *just fucking don’t*",
  "created_utc": 1627692802,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><ul>\n<li>Don’t take a screenshot of your seeds. Can’t believe I need to say that. </li>\n<li>Don’t write it somewhere casually and <em>get to it eventually</em> </li>\n<li>Don’t tell anyone it, even if they’re in a support chat and you’re sure they work for Binance. </li>\n<li>Don’t leverage, I know you think you’re smart, but don’t do that. </li>\n<li>Don’t go ass to pussy, once you’ve moved on to butt hole — you’ve committed. UTI’s kill. </li>\n<li>Don’t click links in your DM’s, I trust you to talk to people but don’t lose your mind and fall for dumb shit. </li>\n<li>If you get an email from an exchange asking you to do something or telling you about something, open your exchange independently, clicking links and signing in is reckless</li>\n<li>Don’t take out a loan to buy crypto, it’s risky enough without involving payday loans. It’s why we don’t skydive holding alligators. Risk quota achieved already.</li>\n<li>Don’t do your crypto research all in one place, especially coin specific subs or apps meant for preteen girl’s to learn choreography. </li>\n</ul>\n\n<p>There’s more but these are the absolute basics, if I get too in depth we’ll end up in a debate about the few times it can pan out.</p>\n</div><!-- SC_ON -->",
  "score": 298,
  "permalink": "/r/CryptoCurrency/comments/ouuzrs/a_thread_of_just_fucking_dont/",
  "subreddit": "CryptoCurrency",
  "id": "ouuzrs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": " * Don’t take a screenshot of your seeds. Can’t believe I need to say that.\n * Don’t write it somewhere casually and get to it eventually\n * Don’t tell anyone it, even if they’re in a support chat and you’re sure they\n   work for Binance.\n * Don’t leverage, I know you think you’re smart, but don’t…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": " * 種子のスクリーンショットを撮らないでください。こんなことを言う必要があるなんて信じられません。\n * 何気なくどこかに書いておいて、そのうち手をつけるのはやめましょう。\n * 誰にも言わないでください。たとえ彼らがサポートチャットにいて、あなたが彼らがBinanceのために働いていると確信していてもです。\n   Binanceのために働いていると確信していてもです。\n * Don't leverage, I know you think you're intelligent, but don't...",
      "title": "Just fucking don't*のスレッドです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": " *不要对你的种子进行截图。不敢相信我需要这么说。\n * 不要把它随便写在什么地方，最后再去找它。\n * 不要告诉任何人，即使他们是在支持聊天中，而且你确定他们是为Binance工作的。\n   为Binance工作。\n * 不要加杠杆，我知道你认为自己很聪明，但不要...",
      "title": "一条 \"他妈的不要 \"的线"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": " *不要對你的種子進行截圖。不敢相信我需要這麼說。\n * 不要把它隨便寫在什麼地方，最後再去找它。\n * 不要告訴任何人，即使他們是在支持聊天中，而且你確定他們是爲Binance工作的。\n   爲Binance工作。\n * 不要加槓桿，我知道你認爲自己很聰明，但不要...",
      "title": "一條 \"他媽的不要 \"的線"
    }
  ]
}