{
  "author": "inevitable_username",
  "original_created_utc": 1651579414,
  "title": "\"If you're 70% down, why not invest now - you can only go down 30%?\" — beware of this false narrative",
  "created_utc": 1651592482,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;We&amp;#39;re all probably more or less in the red by now. That&amp;#39;s why now more than ever its crusial to stick to your strategy, make rational decisions and NOT fall for mind tricks and fallacies. And it&amp;#39;s certainly not the time to abandon simple math!&lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;ve all heard of sunk cost fallacy, gambler&amp;#39;s fallacy, survivorship bias, confirmation bias and the like.&lt;/p&gt;\n\n&lt;p&gt;Now after seeing a bunch of bullshit twitter posts, \nI wanted to bring this one to your attention.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;DOT is 70% down from its ATH. Buy now it&amp;#39;s the best risk/reward ratio you&amp;#39;ll get — can go only 30% down.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t have a problem with the DOT-buying part, I have a problem with this reasoning.&lt;/p&gt;\n\n&lt;p&gt;1) No cryptocurrency is guaranteed to return to its all time high. It happened before. It may or may not happen in the future.&lt;/p&gt;\n\n&lt;p&gt;2) There is always equal upside and downside potential. Always. From the moment you invest (even if the asset was one valued 3 times or 50 times more), the dollar value of your investment can go 30%, 70% or 90% up or down. &lt;strong&gt;So whenever you invest, it is still possible your $100 will turn into $50 or $10.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;3) Twitter and other social media is NOT where you seek financial advice.&lt;/p&gt;\n\n&lt;p&gt;Anyway, I hope you&amp;#39;re doing fine. Buy, sell, do whatever you choose. Just make sure the decisions you make aren&amp;#39;t based on false logic.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 308,
  "permalink": "/r/CryptoCurrency/comments/uhej7x/if_youre_70_down_why_not_invest_now_you_can_only/",
  "subreddit": "CryptoCurrency",
  "id": "uhej7x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "We're all probably more or less in the red by now. That's why now more than ever\nits crusial to stick to your strategy, make rational decisions and NOT fall for\nmind tricks and fallacies. And it's certainly not the time to abandon simple\nmath!\n\nWe've all heard of sunk cost fallacy, gambler's…"
}