{
  "author": "chancletazo_es",
  "original_created_utc": 1633685784,
  "title": "What is your biggest regret in your crypto experience?",
  "created_utc": 1633703492,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>When it comes to investing in crypto, we do many operations, most of them positive. \nThe problem is, could everything have been so much better? People selling and seeing their coin pump some time later, or not buying some coin that you have been considering and miss a x5 or x10.</p>\n\n<p>My biggest regret has been to sell part of my ROSE at $0.09, having bought at $0.06. </p>\n\n<p>It&#39;s not a big deal or anything comparable to people who sold BTC at $100 or bought ICP at $600. </p>\n\n<p>What has been the worst operation or the one that you regret the most?</p>\n</div><!-- SC_ON -->",
  "score": 164,
  "permalink": "/r/CryptoCurrency/comments/q3ucri/what_is_your_biggest_regret_in_your_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "q3ucri",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "When it comes to investing in crypto, we do many operations, most of them\npositive. The problem is, could everything have been so much better? People\nselling and seeing their coin pump some time later, or not buying some coin that\nyou have been considering and miss a x5 or x10.\n\nMy biggest regret…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号への投資に関しては、多くの操作を行いますが、そのほとんどが\nのポジティブなものです。問題は、すべてがもっとうまくいったのではないかということです。人々\n売って、しばらくしてからコインが上昇するのを見たり、検討していたコインを買わずに、5倍や10倍を逃したり。\nまた、検討していたコインを買わずに、5倍や10倍の利益を逃してしまうこともあります。\n\n私の最大の後悔は...。",
      "title": "暗号の経験で一番後悔していることは何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "谈到投资加密货币，我们做了很多操作，其中大部分是\n是积极的。问题是，一切都可以好得多吗？人们\n卖出并在一段时间后看到他们的币被抽走，或者不买你一直考虑的一些币\n你一直在考虑的硬币，而错过了一个X5或X10。\n\n我最大的遗憾是...",
      "title": "在你的加密货币经历中，你最大的遗憾是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "談到投資加密貨幣，我們做了很多操作，其中大部分是\n是積極的。問題是，一切都可以好得多嗎？人們\n賣出並在一段時間後看到他們的幣被抽走，或者不買你一直考慮的一些幣\n你一直在考慮的硬幣，而錯過了一個X5或X10。\n\n我最大的遺憾是...",
      "title": "在你的加密貨幣經歷中，你最大的遺憾是什麼？"
    }
  ]
}