{
  "author": "Swipey_McSwiper",
  "original_created_utc": 1631885773,
  "title": "This week, I offered my employees the option to receive a portion of their salary in bitcoin. Crickets.",
  "created_utc": 1631918349,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I can confirm the cliche that we are indeed very early in this space.</p>\n\n<p>Having come to understand crypto in the last couple of years, I figured it was possible there might be some other closet crypto bugs out there who just hadn’t made their presence known yet. So in our weekly staff meeting (11 people, located in a major eastern US city) I asked if there was any interest in exploring the possibility of receiving some portion of pay in bitcoin on an opt-in basis. I threw out the possibility of 1-10% of salary payable in bitcoin.</p>\n\n<p>Needless to say, there were no takers. And one person’s face can only be described as a mixture of shock, confusion, and horror. </p>\n\n<p>My full plan probably would have included paying a premium—that is I’d be willing to pay an amount in bitcoin that is, say, 2% higher than the fiat equivalent salary. But I didn’t mention that part, as I am very sensitive to looking like I’m trying to entice anyone into anything. I just wanted to see if there would be any genuine interest. There was not.</p>\n\n<p>The benefit of the proposed offer is that, like any salary, the bitcoin-denominated amount would be settled and would not fluctuate. This is to your advantage if you think that bitcoin is a structurally appreciating asset, which historically it has been. So, for example, let’s say you agree to be paid .0025 BTC per week along with the remainder in fiat. If you think the market is going up, then over time your weekly .0025 BTC becomes more and more valuable. I think many of us can easily imagine it being worth considerably more into the future. Yes, there would be pull-backs, but historically the overall direction of bitcoin is up relative to fiat over time. The salary would be adjusted yearly for deflation, just as fiat salaries are adjusted yearly for inflation.</p>\n\n<p>In terms of getting in and out of the system, I’d probably do something similar to the way health insurance works in some countries, including the US. There would be an open period where anybody could opt in. Then you could opt out at any time, but you couldn’t opt back in until the open period the following year.</p>\n\n<p>Anyway, we didn’t get that far because when I asked, all I heard were crickets. So it won’t go any further.</p>\n</div><!-- SC_ON -->",
  "score": 159,
  "permalink": "/r/CryptoCurrency/comments/pq0ad7/this_week_i_offered_my_employees_the_option_to/",
  "subreddit": "CryptoCurrency",
  "id": "pq0ad7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I can confirm the cliche that we are indeed very early in this space.\n\nHaving come to understand crypto in the last couple of years, I figured it was\npossible there might be some other closet crypto bugs out there who just hadn’t\nmade their presence known yet. So in our weekly staff meeting (11…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この分野では、私たちは確かに非常に早い段階にいるという決まり文句を確認することができます。\n\nここ2、3年で暗号を理解するようになった私は、他にも暗号を知らない虫がいるかもしれないと思いました。\n他の暗号バグがいるかもしれないと思いました。\nまだ存在を知られていない暗号バグがいるかもしれないと思いました。そこで、毎週行われるスタッフミーティング（11...",
      "title": "今週、私は従業員に給与の一部をビットコインで受け取るというオプションを提供しました。コオロギですね。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我可以证实这句老生常谈的话，我们在这个领域确实很早。\n\n在过去的几年里，我逐渐了解了加密货币，我想有可能\n有可能还有一些不为人知的加密货币虫子，只是还没有\n他们的存在还不为人所知。因此，在我们每周的员工会议（11...",
      "title": "本周，我向我的员工提供了以比特币领取部分工资的选择。蟋蟀。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我可以證實這句老生常談的話，我們在這個領域確實很早。\n\n在過去的幾年裏，我逐漸瞭解了加密貨幣，我想有可能\n有可能還有一些不爲人知的加密貨幣蟲子，只是還沒有\n他們的存在還不爲人所知。因此，在我們每週的員工會議（11...",
      "title": "本週，我向我的員工提供了以比特幣領取部分工資的選擇。蟋蟀。"
    }
  ]
}