{
  "author": "buuhhu1",
  "original_created_utc": 1638010893,
  "title": "Any other Degens like me, all in on altcoins?",
  "created_utc": 1638027513,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So hear me out, i know BTC and ETH are probably the smarter and safer choices but to some people like me, a 3rd worlder with a very limited amount of fiat, lower market cap coins are our only chance to make some gains that could really mean something.  </p>\n\n<p>I&#39;m personally all in on altcoins, if i lose money well at least i tried, but if i win some it would really mean the world to me, when you can only put 40 to 50 bucks a month into crypto you really have to risk it and go for possibles 5x-10x potential altcoins, being aware of the risks of course.  </p>\n\n<p>This is not financial advice whatsoever and i&#39;ll probably stay broke lol, but if any of my alt moon someday it would really help a lot :)</p>\n</div><!-- SC_ON -->",
  "score": 188,
  "permalink": "/r/CryptoCurrency/comments/r3bc4m/any_other_degens_like_me_all_in_on_altcoins/",
  "subreddit": "CryptoCurrency",
  "id": "r3bc4m",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So hear me out, i know BTC and ETH are probably the smarter and safer choices\nbut to some people like me, a 3rd worlder with a very limited amount of fiat,\nlower market cap coins are our only chance to make some gains that could really\nmean something.\n\nI'm personally all in on altcoins, if i lose…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "BTCやETHがより賢く安全な選択であることはわかっています。\nしかし、私のように限られた額のフィアットしか持っていない第三世界の人間にとっては、時価総額の低いコインが唯一のチャンスなのです。\n市場規模の小さいコインは、本当に意味のある利益を得るための唯一のチャンスです。\nしかし、私のような第3世界の人々は、限られた量のフィアットしか持っていません。\n\n私は個人的にアルトコインに全てを注ぎ込んでいますが、もし負けたら...。",
      "title": "私のようにアルトコインに全力投球しているDegensはいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以听我说，我知道BTC和ETH可能是更聪明和更安全的选择\n但对于像我这样的第三世界国家的人来说，他们的法币数量非常有限。\n低市值币是我们取得一些收益的唯一机会，这可能真的\n意义。\n\n我个人对altcoins全情投入，如果我输了...",
      "title": "有其他像我这样的Degens，全身心投入到altcoins中吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以聽我說，我知道BTC和ETH可能是更聰明和更安全的選擇\n但對於像我這樣的第三世界國家的人來說，他們的法幣數量非常有限。\n低市值幣是我們取得一些收益的唯一機會，這可能真的\n意義。\n\n我個人對altcoins全情投入，如果我輸了...",
      "title": "有其他像我這樣的Degens，全身心投入到altcoins中嗎？"
    }
  ]
}