{
  "author": "bananainbeijing",
  "original_created_utc": 1635995542,
  "title": "A word of caution about Solana (SOL)",
  "created_utc": 1636022237,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I just wanted to remind everyone that SOL suffered a DOS attack back in September, only less than 2 months ago. One of the main criticisms at the time was that they just shut down the network, showing how centralized their project was.</p>\n\n<p>Now, it&#39;s at an ATH, with no slowdown in sight. </p>\n\n<p>Just because a coin is rising doesn&#39;t mean it&#39;s necessarily a good project. Yes, it could eventually make a case to be a competitor to ETH. But there are still a lot of risks along the way.</p>\n\n<p>Just to give a small history lesson. Last bull run, do you guys remember the project TRON (TRX)? Led by Justin Sun (who <a href=\"/r/cc\">r/cc</a> seems to hate), they were in the top 10 coins by market cap during the last bull run. People made money! But now? They&#39;re #29, and the project hasn&#39;t really gone anywhere.</p>\n\n<p>I&#39;m not saying SOL will follow this path exactly, but just wanted to warn everyone that there are definitely risks with this project, and taking profits on it is never a bad idea.</p>\n</div><!-- SC_ON -->",
  "score": 208,
  "permalink": "/r/CryptoCurrency/comments/qmbidk/a_word_of_caution_about_solana_sol/",
  "subreddit": "CryptoCurrency",
  "id": "qmbidk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I just wanted to remind everyone that SOL suffered a DOS attack back in\nSeptember, only less than 2 months ago. One of the main criticisms at the time\nwas that they just shut down the network, showing how centralized their project\nwas.\n\nNow, it's at an ATH, with no slowdown in sight.\n\nJust because a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "SOLがDOS攻撃を受けたのは、わずか2ヶ月前の9月だったことを皆さんにお知らせしたいと思います。\n9月にDOS攻撃を受けました。当時の主な批判の1つは\n彼らのプロジェクトがいかに中央集権的であるかを示していた。\nでした。\n\n今ではATHになっていて、スピードが落ちることはありません。\n\nただ、...",
      "title": "ソラナ（SOL）についての注意点"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我只是想提醒大家，SOL在9月份遭受了一次DOS攻击。\n9月，只有不到两个月的时间。当时的主要批评之一是，他们只是关闭了网络。\n他们只是关闭了网络，这表明他们的项目是多么集中。\n是多么的集中。\n\n现在，它正处于ATH状态，没有减速的迹象。\n\n只是因为一个...",
      "title": "关于索拉纳(SOL)的一个忠告"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我只是想提醒大家，SOL在9月份遭受了一次DOS攻擊。\n9月，只有不到兩個月的時間。當時的主要批評之一是，他們只是關閉了網絡。\n他們只是關閉了網絡，這表明他們的項目是多麼集中。\n是多麼的集中。\n\n現在，它正處於ATH狀態，沒有減速的跡象。\n\n只是因爲一個...",
      "title": "關於索拉納(SOL)的一個忠告"
    }
  ]
}