{
  "author": "PurplerRain",
  "original_created_utc": 1624235156,
  "title": "500 BTCs or wife",
  "created_utc": 1624307839,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>After dinner my wife and I were hanging out on our deck just enjoy the weather and some wine. At some point while relaxing I picked up my phone and checked my crypto. I am degen. This act ultimately led to...&quot;i&#39;m curious&quot;....then she hit me with this....</p>\n\n<p><em>If someone offered you 500 BTCs and the only condition in exchange would be that you had to divorce me and we wouldn&#39;t talk ever again....what would you say</em>?</p>\n\n<p>We don&#39;t have kids. Nor, do we want kids. I won&#39;t tell you my answer, but we had a good laugh. Interesting question though. I hope all you spouses out there would answer it honestly. And if you can&#39;t answer it honestly then that in and of itself is a problem. Lol.</p>\n</div><!-- SC_ON -->",
  "score": 233,
  "permalink": "/r/CryptoCurrency/comments/o4iv7i/500_btcs_or_wife/",
  "subreddit": "CryptoCurrency",
  "id": "o4iv7i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "After dinner my wife and I were hanging out on our deck just enjoy the weather\nand some wine. At some point while relaxing I picked up my phone and checked my\ncrypto. I am degen. This act ultimately led to...\"i'm curious\"....then she hit\nme with this....\n\nIf someone offered you 500 BTCs and the only…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "夕食後、妻と私は天気を楽しむためにデッキでくつろいでいました。\nワインを飲んでいました。リラックスしている時に、私は携帯電話を手に取り、自分の暗号をチェックしました。\n暗号を確認しました。私はデゲンです。この行為は最終的に... \"I'm curious\"....、彼女は次のように言ってきました。\nと言われました。....\n\nもし誰かがあなたに500BTCを提供し、唯一の...",
      "title": "500BTCまたは妻"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "晚饭后，我和我的妻子在甲板上闲逛，享受天气。\n和一些葡萄酒。在放松的时候，我拿起手机，查看我的\n密码器。我是Degen。这一行为最终导致了...... \"我很好奇\"....，然后她用这个打了我一下。\n我这个....\n\n如果有人给你500个BTC，而唯一...",
      "title": "500 BTCs或妻子"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "晚飯後，我和我的妻子在甲板上閒逛，享受天氣。\n和一些葡萄酒。在放鬆的時候，我拿起手機，查看我的\n密碼器。我是Degen。這一行爲最終導致了...... \"我很好奇\"....，然後她用這個打了我一下。\n我這個....\n\n如果有人給你500個BTC，而唯一...",
      "title": "500 BTCs或妻子"
    }
  ]
}