{
  "author": "CoolCoolPapaOldSkool",
  "original_created_utc": 1635602198,
  "title": "Let’s talk about BAT - Basic Attention token",
  "created_utc": 1635626129,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Let’s talk about BAT - Basic Attention token</p>\n\n<p>I am bored with all the latest posts about a new shitcoin or missing opportunities to buy another shitcoin. So, why not talk about something usable, having potential and could become big with more and more adoption. I am talking about BAT - Basic Attention token</p>\n\n<p>Q: What is BAT?</p>\n\n<p>A: BAT was created by the co-founder of Mozilla and Firefox -  Brendan Eich and Brian Bondy, formerly of Khan Academy and Mozilla.. BAT is an Ethereum token and is a native token of Brave Software&#39;s blockchain-based digital advertising platform. </p>\n\n<p>Q: How can you earn BAT?</p>\n\n<p>A: Download Brave browser and opt into Brave Rewards. Users earn BAT for their attention by viewing ads. Creators are rewarded according to their content and the attention it gets. Advertisers can also buy ad spaces using BAT. So basically, one gets paid for providing their private metadata.</p>\n\n<p>Q: So why BAT has vast growth potential?</p>\n\n<p>A: Brave browser has more than 38.9 Million monthly active users and 13.4 Million daily active users. BAT use cases include:- \n1. Users earn BAT for their attention and also get privacy using Brave browser.\n2. Content creators get paid for making great content\n3. Advertisers get better returns by targeting the audience. \n4. Brave recently launched its search engine, replacing Google.</p>\n\n<p>Thus, I am batting for the BAT.</p>\n</div><!-- SC_ON -->",
  "score": 174,
  "permalink": "/r/CryptoCurrency/comments/qj1zza/lets_talk_about_bat_basic_attention_token/",
  "subreddit": "CryptoCurrency",
  "id": "qj1zza",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Let’s talk about BAT - Basic Attention token\n\nI am bored with all the latest posts about a new shitcoin or missing\nopportunities to buy another shitcoin. So, why not talk about something usable,\nhaving potential and could become big with more and more adoption. I am talking\nabout BAT - Basic…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "BAT（Basic Attention token）について語ろう\n\n新しいシットコインや行方不明者に関する最新の投稿には飽き飽きしています。\n他のクソコインを購入する機会を逃したりすることに飽きています。そこで、何か使えるものについて話してみましょう。\n可能性があり、採用が増えれば大きくなる可能性があります。私が話しているのは\nBAT - Basic...",
      "title": "BAT（Basic Attention token）について説明します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "让我们来谈谈BAT--基本注意力令牌\n\n我对所有关于新的狗屎币的最新帖子感到厌烦，或错过了\n买另一个狗屎币的机会。所以，为什么不谈谈一些可用的东西呢？\n有潜力的东西，而且随着越来越多的人采用，它可以变得很大。我正在谈论\n关于BAT--基本货币。",
      "title": "让我们来谈谈BAT--基本注意标志。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "讓我們來談談BAT--基本注意力令牌\n\n我對所有關於新的狗屎幣的最新帖子感到厭煩，或錯過了\n買另一個狗屎幣的機會。所以，爲什麼不談談一些可用的東西呢？\n有潛力的東西，而且隨着越來越多的人採用，它可以變得很大。我正在談論\n關於BAT--基本貨幣。",
      "title": "讓我們來談談BAT--基本注意標誌。"
    }
  ]
}