{
  "author": "MrMontage",
  "the_new_excerpt": "Years ago in college I read an essay by Nietzsche, \"On the Use and Abuse of\nHistory for Life\" as part of an introduction to Foucault. One of my take aways\nfrom that was how the past serves as a warehouse of stories and that what most\npeople think of as \"history\" is often a selective curation of the…",
  "original_created_utc": 1622205653,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昔、大学でニーチェのエッセイ「歴史の使用と乱用について」を読みました。\nというニーチェのエッセイを読みましたが、これはフーコーの入門書の一部でした。そこから私が得たものの一つは\nその中で私が感じたことの一つは、過去は物語の倉庫としての役割を果たしており、多くの人が「歴史」と考えているものは\nそして、多くの人が「歴史」と考えているものは、多くの場合、選択的にキュレーションされた...",
      "title": "漢というアイデンティティが、中国の大衆一般意識の中で意味のある自己同一性を持つようになったのはいつのことだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "几年前在大学里，我读到了尼采的一篇文章《论生活中对历史的利用和滥用》。\n作为福柯介绍的一部分。我从中得到的一个收获是\n我的一个收获是，过去是如何作为一个故事的仓库，而大多数人所认为的 \"历史 \"是什么？\n大多数人认为的 \"历史 \"往往是对历史的有选择的整理。",
      "title": "汉族的身份何时在中国的大众普遍意识中成为一种有意义的自我认同？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "幾年前在大學裏，我讀到了尼采的一篇文章《論生活中對歷史的利用和濫用》。\n作爲福柯介紹的一部分。我從中得到的一個收穫是\n我的一個收穫是，過去是如何作爲一個故事的倉庫，而大多數人所認爲的 \"歷史 \"是什麼？\n大多數人認爲的 \"歷史 \"往往是對歷史的有選擇的整理。",
      "title": "漢族的身份何時在中國的大衆普遍意識中成爲一種有意義的自我認同？"
    }
  ],
  "title": "When did the identity of Han become a meaningful self-identity in the mass general consciousness in China?",
  "created_utc": 1622230939,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Years ago in college I read an essay by Nietzsche, &quot;On the Use and Abuse of History for Life&quot; as part of an introduction to Foucault. One of my take aways from that was how the past serves as a warehouse of stories and that what most people think of as &quot;history&quot; is often a selective curation of the past to legitimize something politically in the present. Lately I&#39;ve been studying the history of the Italian unification because through some peculiar italian interpretation of jure sanguinis I was able to become a dual citizen. I really enjoyed this quote by Massimo d&#39;Azeglio, Prime Minister of Sardinia who said  &quot;L&#39;Italia è fatta. Restano da fare gli italiani&quot;, translated as &quot;We have made Italy. Now we must make Italians.&quot; I found it interesting to realize that my American identity was actually older than the Italian identity. In my studies I noticed how romantic italian nationalist invoked Battle of Legnano and how the fascists saw themselves as heirs of Rome all as parts of trying to construct and influence italianness.</p>\n\n<p>This made me wonder to what extent is Chinese &quot;history&quot; a selective curation as part of CCP efforts to legitimize their political vision? When did Han chinese start calling themselves Han, and when did that actually become a meaningful identity to an average Han person?</p>\n</div><!-- SC_ON -->",
  "score": 109,
  "permalink": "/r/AskHistorians/comments/nmwz7u/when_did_the_identity_of_han_become_a_meaningful/",
  "subreddit": "AskHistorians",
  "id": "nmwz7u",
  "is_self": true,
  "media": null,
  "is_video": false
}