{
  "author": "UnexperiencedIT",
  "original_created_utc": 1641926591,
  "title": "People don't want to hear this, but we're investing in crypto so we can have more money in traditional currencies",
  "created_utc": 1641944646,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As much as you love the technology behind cryptocurrencies and various projects, 99% of people are here for money.&lt;/p&gt;\n\n&lt;p&gt;And as much as they are supporters of cryptocurrencies, 99% of people do it to have more money in fiat currencies so they can achieve their goals.&lt;/p&gt;\n\n&lt;p&gt;When trading with cryptocurrencies, we compare their value with the euro, dollar, pound, etc.  Currently we are comparing the value of everything to our current fiat price.&lt;/p&gt;\n\n&lt;p&gt;An international financial system such as crypto takes time to adapt and I can only imagine what awaits us in the future, but I belive that even then we will still compare value with traditional currencies.&lt;/p&gt;\n\n&lt;p&gt;The main goal of crypto is decentralization. We all want it, yet when we take profit we take it from centralized place. Stablecoins are backed by traditional currencies, which are again centralized.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 380,
  "permalink": "/r/CryptoCurrency/comments/s1k62t/people_dont_want_to_hear_this_but_were_investing/",
  "subreddit": "CryptoCurrency",
  "id": "s1k62t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "As much as you love the technology behind cryptocurrencies and various projects,\n99% of people are here for money.\n\nAnd as much as they are supporters of cryptocurrencies, 99% of people do it to\nhave more money in fiat currencies so they can achieve their goals.\n\nWhen trading with cryptocurrencies,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号通貨や様々なプロジェクトの背景にある技術が好きなのはもちろんですが\n99％の人はお金のためにいる。\n\nそして暗号通貨の支持者であるのと同様に 99％の人はそれをするために\nを持つことで、自分の目標を達成することができます。\n\n暗号通貨で取引する場合、...",
      "title": "人々はこれを聞きたがりませんが、私たちは暗号に投資しているので、伝統的な通貨でより多くのお金を持つことができるのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "尽管你喜欢加密货币和各种项目背后的技术。\n99%的人都是为了钱而来。\n\n而且，尽管他们是加密货币的支持者，但99%的人都是为了\n拥有更多的法定货币资金，以便他们能够实现自己的目标。\n\n在使用加密货币交易时，...",
      "title": "人们不想听到这个，但我们正在投资加密货币，以便我们可以有更多的传统货币资金"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "儘管你喜歡加密貨幣和各種項目背後的技術。\n99%的人都是爲了錢而來。\n\n而且，儘管他們是加密貨幣的支持者，但99%的人都是爲了\n擁有更多的法定貨幣資金，以便他們能夠實現自己的目標。\n\n在使用加密貨幣交易時，...",
      "title": "人們不想聽到這個，但我們正在投資加密貨幣，以便我們可以有更多的傳統貨幣資金"
    }
  ]
}