{
  "author": "aquerraventus",
  "original_created_utc": 1646340744,
  "title": "Is r/tooafraidtoask just becoming the new r/unpopularopinion?",
  "created_utc": 1646357733,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I joined this sub a few months ago, and I have seen a noticeable uptick recently of a specific type of post.&lt;/p&gt;\n\n&lt;p&gt;It seems like every single day someone comes in asking something along the lines of “Is it bad that I don’t like queer people? And (supposedly) citing one bad experience they had with a queer person where someone probably aggressively demanded their pronouns or such-and-such.&lt;/p&gt;\n\n&lt;p&gt;I will also note that I very often just see most of the comment section either tip-toeing around some very obvious answer (like telling people &lt;em&gt;yes&lt;/em&gt;, you are homophobic, transphobic, etc or being deeply sympathetic to the person and basically validating their feelings.&lt;/p&gt;\n\n&lt;p&gt;Basically my point is that a while back it feels like &lt;a href=\"/r/unpopularopinions\"&gt;r/unpopularopinions&lt;/a&gt; just became a place to be openly bigoted without pushback, and this sub has sort of been feeling like it’s slowly slipping in this direction. I see posts like this all the time now, and as a queer person existing on this sub it’s exhausting. I just wanted to see some rediculous questions that people had when I came here and now it feels like it’s just slipping into different territory.&lt;/p&gt;\n\n&lt;p&gt;So my actual question is, am I crazy? Have other people been noticing this?? I literally just saw a post on this Subreddit today where someone was like (paraphrasing) “I have concluded that I don’t like black Americans, does that make me racist?” And basically the entire comment section was trying to “logic” their way around OP being… racist? When it seems like a fairly cut and dry question to me.&lt;/p&gt;\n\n&lt;p&gt;Let me know what y’all think! Open to any and all answers obviously.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 178,
  "permalink": "/r/TooAfraidToAsk/comments/t61eux/is_rtooafraidtoask_just_becoming_the_new/",
  "subreddit": "TooAfraidToAsk",
  "id": "t61eux",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I joined this sub a few months ago, and I have seen a noticeable uptick recently\nof a specific type of post.\n\nIt seems like every single day someone comes in asking something along the lines\nof “Is it bad that I don’t like queer people? And (supposedly) citing one bad\nexperience they had with a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "数ヶ月前にこのサブに参加したのですが、最近顕著に増えているのを見かけました。\nある特定のタイプの投稿の\n\n毎日毎日、誰かがこんなことを聞きに来るようです。\nとか、「同性愛者が嫌いなのは悪いことですか？そして、（おそらく）1つの嫌なことを引き合いに出して\nとの経験。",
      "title": "r/tooafraidtoaskは新しいr/unpopularopinionになりつつあるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在几个月前加入了这个分会，最近我看到一个明显的上升趋势\n的一个特定类型的帖子。\n\n似乎每天都有人来问一些类似的问题\n\"我不喜欢同性恋者，这很糟糕吗？并（据说）列举了他们与一个\n他们有一个不愉快的经历...",
      "title": "r/tooafraidtoask是否正成为新的r/unpopularopinion？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在幾個月前加入了這個分會，最近我看到一個明顯的上升趨勢\n的一個特定類型的帖子。\n\n似乎每天都有人來問一些類似的問題\n\"我不喜歡同性戀者，這很糟糕嗎？並（據說）列舉了他們與一個\n他們有一個不愉快的經歷...",
      "title": "r/tooafraidtoask是否正成爲新的r/unpopularopinion？"
    }
  ]
}