{
  "author": "TNGSystems",
  "original_created_utc": 1632091838,
  "title": "Like rats fleeing a sinking ship, Safemoon's core developers peel away one by one as the price plummets and one single question remains unanswered - WHERE IS THE MONEY GOING?",
  "created_utc": 1632162961,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h3>This will be part four of my exciting Safemoon Saga, much reviled by Safemooners. Please see below to catch up</h3>\n\n<p><strong>///////Part 1:</strong> <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/p0i6kr/safemoons_performance_of_mental_gymnastics_in_the/\">Safemoon&#39;s performance of Mental Gymnastics in the Tokyo 2020 Olympics has been simply stunning. They deserve every Gold they&#39;ve been given.</a>  </p>\n\n<p><strong>///////Part 2 &amp;<sup>1/2:</sup></strong> <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/pdjxnb/safemoon_has_been_exploited_from_day_1_and/\">Safemoon has been exploited from day 1 and $68,460,000 have been siphoned out of the liquidity pool. This gets auto-deleted from their sub. Explanation in comments</a></p>\n\n<p><strong>///////Part 33 &amp;<sup>1/3:</sup></strong> <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/plait6/last_call_for_safemoon_the_curtains_are_drawing/\">Last call for Safemoon. The curtains are drawing on this omnishambles of a project.</a>  </p>\n\n<hr/>\n\n<p>What in the hell has been going on in the last week or so? Well, first, we find out that Safemoon Hank will be departing following the immense cock-up of the Safemoon wallet launch. Not one to shy away from the juicy details, we find out from leaked Discord audio that Hank and Thomas Smith (AKA, <em><sup>shudder</sup></em>, &quot;&quot;&quot;papa&quot;&quot;&quot;), disgruntled at their roles at Safemoon, are in fact only spending a few hours per week working on Safemoon related projects and instead spending a significant proportion of their time coding their own projects.  </p>\n\n<p>One of these, we find out, is called &quot;Piggy Token&quot; - which has suffered the typical BSC fate of a rude rug-pull (<a href=\"https://www.coingecko.com/en/coins/piggy-bank-token\">oof, that 30-day chart</a>)  </p>\n\n<p>If you look at the transcript linked above, you might find some interesting tidbits, but for the lazy I&#39;ve done the honors of removing much of the sleuthing for your pleasure:  </p>\n\n<p><strong>Safemoon Hank</strong></p>\n\n<blockquote>\n<p>But yeah ah, so the goal is: Piggy will make you wealthy. Our next project will make all of you and all of your families filthy rich  </p>\n</blockquote>\n\n<blockquote>\n<p>So Thomas and I are going to work on our own project a lot</p>\n\n<p>And since Thomas is scaled back and he only has to work 15 hours a week, we&#39;re going to put 80 hours into our project.  </p>\n</blockquote>\n\n<p>Nice thought, huh? Just a product to enrich the developers and friends of the developers via a pre-sale, can&#39;t think where I&#39;ve heard that one before...   </p>\n\n<p>The other thing we find out is that Hank &amp; Thomas seem really pissed off at Braden &#39;John&#39; Karony - CEO of Safemoon. Trouble in paradise it seems.  </p>\n\n<p>So Hank announces his departure to much &quot;Good riddance!&quot; and then the above audio leaks out. Blood is out for Hank, but also for Mr. Jack Haines, Chief Operations Officer at Safemoon who slams his notice of departure down <em>on the same day!</em>  </p>\n\n<p><a href=\"https://pbs.twimg.com/media/E-7IElAXoAI6HhC?format=jpg&amp;name=large\">The footnote here is interesting...</a>  </p>\n\n<p>So that&#39;s two for two core team members bailing out to start their own projects...  </p>\n\n<p><a href=\"https://preview.redd.it/qiivupw826o71.jpg?width=354&amp;auto=webp&amp;s=d78e9d490f84dff972e2c90c6907713634e5997a\">Next up, SafeMoonDev - yes, the original developer for Safemoon has just upped and fucked off</a>, transferring his millions of dollars of tokens to wallets in preparation to sell.  </p>\n\n<p><a href=\"https://twitter.com/realsafemoondev?lang=en\">Selling your bags and deleting your twitter after a pseudo-cryptic message is <em>so</em> 2018.</a></p>\n\n<p><em>(PS - does anyone else find these blue laser eyes the Safemoon community has are just peak cringe?)</em>  </p>\n\n<hr/>\n\n<p>This is an awful lot of churning for a company, even a startup, where the Chief Technology Officer (Hank) quits a couple months after a discord call took place where he gloats about creating a new Crypto to make everyone who takes part in the pre-sale rich (Piggy, which launched and then rugged)  </p>\n\n<p>The Chief Blockchain Officer (Thomas) is on the ropes to quit, and though he is hero-worshipped by the cult, he&#39;s actually spent his time working on Piggy &amp; a new token called &quot;NFA Token&quot; (Not Financial Advice Token....)  </p>\n\n<p>And the Chief Operations Officer (Jack) who often appears alongside the CEO in the Safemoon Sunday&#39;s segment just leaves almost on a whim, citing personal issues (I guess I would cite personal issues if I yeeted millions of dollars out of a Cryptocurrency contract but here we are)  </p>\n\n<hr/>\n\n<p>A new piece of audio is released, this one from the former lead Safemoon moderator &quot;Ginger&quot;, the audio is between himself, plenty of other former Safemoon moderators and some skeptical community members. Once again, some juicy transcripts:  </p>\n\n<p><strong>Ginger</strong></p>\n\n<blockquote>\n<p>I would argue that, what&#39;s been seen in the blockchain? There are unknown amounts of LP extracted from SafeMoon that have disappeared. There isn&#39;t a justified business expense. And it&#39;s not a misappropriation, it&#39;s simply missing! That&#39;s the problem!  </p>\n</blockquote>\n\n<blockquote>\n<p>The “Fuck SafeMoon” was directed at corporate and then the cult army, were the nazis. I was told that if I went public with what we found, it would be worse for us than for the people it&#39;s regarding. And when I asked what they meant, because I took that as a threat. Their clarification was, haven&#39;t you seen the effectiveness? And how crazy the SafeMoon cult is?  </p>\n</blockquote>\n\n<p><strong>It appears the audio from Ginger corroborates the leaked audio from Hank - that Hank &amp; Thomas were creating their own token instead of working on Safemoon, which explains why the wallet launch was such a complete fiasco and obviously cobbled together by a team of yoo-ha&#39;s from Fiverr</strong>  </p>\n\n<hr/>\n\n<h3>BUT WHERE IS THE MONEY GOING?!</h3>\n\n<p>This one is really interesting and similar to my DoxxLocker post. We&#39;re gonna follow a chain of transactions, all nicely linked and annotated to understand what the fuck is going on with money that is supposed to be kept in a Safemoon liquidity pool. <a href=\"https://twitter.com/ScammoonR/status/1438471312746303490\">Credit to ScamMoon on Twitter.</a>  </p>\n\n<p><a href=\"https://np.reddit.com/r/SafeMoon/comments/mlnc3i/millions_of_liquidity_removed_from_main_safemoon/gtmms7t/\">But first, an explanation from Thomas Smith the last time this happened</a>  </p>\n\n<blockquote>\n<p>What you&#39;re seeing between the pancake router and the safemoon contract is a normal contract interaction. Transactions that happen from the safemoon contract address: 0x8076C74C5e3F5852037F31Ff0093Eeb8c8ADd8D3 to the pancakeswap router: 0x05fF2B0DB69458A0750badebc4f9e13aDd608C7F is automated and has happened hundreds of times. It is not initiated by the contract deployer address. The safemoon contract regularly swaps with pancakeswap, I encourage people to check the timestamps and understand that we do not have the contract functions to initiate swaps like that.</p>\n\n<p>Please know there is a difference between a deployed contract and a wallet address. While a contract can hold and potentially use a balance, it does not have a private key. The functions we have available are the only ones we have available, everyone is free to verify this with the source and explorer verified code. </p>\n</blockquote>\n\n<p>...</p>\n\n<p><strong><em>PRICES ARE LISTED AT TIME OF TRANSACTION, HENCE FLUCTUATION</em></strong></p>\n\n<p><a href=\"https://bscscan.com/tx/0x822b8f4f94405aa2ee3a91e25e203e79f39b1730eab98c9762e7f2c3abb90d08\">TX1 - Liquidity is removed from the deployer wallet</a>\nIn TX1, 5 Trillion Safemoon ($7.9m) are removed from the LiquidityPool and sent to wallet ending FE88 (Iron88)  </p>\n\n<p><a href=\"https://bscscan.com/tx/0x9643793db66d87344ed5e8d159c45fc65e93941ec9be923c7774992bc046723f\">TX2 - Approx Half sent to another wallet</a>\nIn TX2, 2.7 Trillion Safemoon ($4.3m) are removed from wallet Iron88 and sent to wallet ending a0e5 (Age of Empires 5)  </p>\n\n<p><a href=\"https://bscscan.com/tx/0xeef7a66ebfb475dead92104195019963c6b00b295e7bed7e4630b9c534caa985\">TX3 - Sold for 11,200+ BNB</a>\nIn TX3, 2.1 Trillion Safemoon in wallet Age of Empires 5 is sold for over 11,200 BNB.  </p>\n\n<p><a href=\"https://bscscan.com/tx/0x8765d9f3e6e46a066dad68c9bd9719a6b3da4b8c9dcc7492c837bc3d6c308a19\">TX4 - Converted to 1,650+ ETH</a>\nIn TX4, 11,200+ BNB in wallet Age of Empires 5 is sold for over 1,650 ETH.  </p>\n\n<p><a href=\"https://bscscan.com/tx/0x3a8692157f7c6963716a8acf8b7a97efd88a7586fc81c1f52ac332e244f81fee\">TX5 - ETH Sent to new wallet</a>\nIn TX5, 1,900+ ETH in wallet Age of Empires 5 is sent to new wallet ending in dc23 (Direct Current 23)  </p>\n\n<p><a href=\"https://bscscan.com/tx/0x7f155737ef606b3742daeaa40742a4dc21323cb15184ffa4ae776204dff5c0b8\">TX6 &amp; 7 - ETH Sent to 1 new wallet in 2 txs</a>\nIn TX6, 500 ETH in wallet Direct Current 23 is sent to new wallet ending in f333 (Fart 333)  </p>\n\n<p><a href=\"https://bscscan.com/tx/0xab140e35562261a665965198ab35463bf84eac27a6c3ddb38fb2e6a46dde2a6a\">TX6 &amp; 7 - ETH Sent to 1 new wallet in 2 txs</a>\nIn TX7, 1,303 ETH in wallet Direct Current 23 is sent to new wallet ending in f333 (Fart 333)  </p>\n\n<p><a href=\"https://bscscan.com/tx/0xfa5ed034c5f425170d51dab310e5fe71cd0f10d94841557571c874215e9be66e\">TX8 - ETH transferred and sold off on Binance</a>\nIn TX8, 1,800+ ETH in wallet Fart 333 is transferred to a wallet owned by someone with an account on Binance.  </p>\n\n<h3>What Thomas &amp; Safemoon team and cultists would have you believe is that these are normal movements to and from a liquidity pool. They are not.</h3>\n\n<p>This is clearly money being taken from the Liquidity Pool, washed through a few wallets and then cashed out. And not just a few dollars, the final transaction into the Binance wallet came in at nearly <strong>FOUR MILLION DOLLARS</strong>  </p>\n\n<p>And this is just one of many transactions like it - the DoxxLocker report has more. And all these transactions were highlighted as <em>possible</em> in the Certik Audit which found that the code to perform functions for the liquidity pool could allow for funds to be diverted elsewhere.  </p>\n\n<hr/>\n\n<p>So you remember that Ginger guy from earlier? Well he stumbled onto this sort of wallet funds fuckery, in combination with the devs sending money around to fund launches of their other scam shitcoins (Piggy, NFA, Nobility) and <a href=\"https://miro.com/app/board/o9J_lx5kv5k=/\">created an amazing mind-map of all the transactions with his own notes on them.</a>  </p>\n\n<p>That&#39;s definitely worth a look at, if you want to see more evidence of misappropriation of funds.  </p>\n\n<hr/>\n\n<p>And there you have it, another chapter in the trainwreck of the shitcoin that gained a cult following based on absolutely nothing.  </p>\n\n<p><strong><em>DISCLAIMER- WHILE WE WELCOME DISCUSSION AND DEBATE FROM ACCOUNTS INVESTED IN SAFEMOON, PERSONAL ATTACKS &amp; INSULTS ARE NOT ALLOWED. PLEASE KEEP IT CIVIL</em></strong></p>\n</div><!-- SC_ON -->",
  "score": 162,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/-bjkDxm2tDK3lHCEp7UVn-qu5lHXvrRjLdRZk68p6zM.jpg?auto=webp&s=e9cac9cf7aa0731a3df8dab1023ca2a7e596843b",
          "width": 354,
          "height": 766
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/-bjkDxm2tDK3lHCEp7UVn-qu5lHXvrRjLdRZk68p6zM.jpg?width=108&crop=smart&auto=webp&s=a584e7e6d73a605e04c7daa25a8dce80a5647301",
            "width": 108,
            "height": 216
          },
          {
            "url": "https://external-preview.redd.it/-bjkDxm2tDK3lHCEp7UVn-qu5lHXvrRjLdRZk68p6zM.jpg?width=216&crop=smart&auto=webp&s=a5075c0a485594bf6ef243e40522ecc5b2203a01",
            "width": 216,
            "height": 432
          },
          {
            "url": "https://external-preview.redd.it/-bjkDxm2tDK3lHCEp7UVn-qu5lHXvrRjLdRZk68p6zM.jpg?width=320&crop=smart&auto=webp&s=e54c0d8405917253f29e17b59e3abfc26e27cc94",
            "width": 320,
            "height": 640
          }
        ],
        "variants": {},
        "id": "XN8LaeTUgcKK3jQJvqAVKWPywUWZq_Y51OP1l7qL0Ks"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/pridd2/like_rats_fleeing_a_sinking_ship_safemoons_core/",
  "subreddit": "CryptoCurrency",
  "id": "pridd2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "THIS WILL BE PART FOUR OF MY EXCITING SAFEMOON SAGA, MUCH REVILED BY\nSAFEMOONERS. PLEASE SEE BELOW TO CATCH UP\n\n///////Part 1: Safemoon's performance of Mental Gymnastics in the Tokyo 2020\nOlympics has been simply stunning. They deserve every Gold they've been…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは、私のエキサイティングなセーフムーン・サーガのパート4です。\nサフェムナー 以下を参照してください。\n\n/////// 第1部：セーフムーンの東京2020オリンピックでの「こころの体操」の演技は、まさに圧巻でした。\nオリンピックでのセーフィムーンの演技は、まさに圧巻でした。彼らはすべての金メダルに値する...",
      "title": "沈みゆく船から逃げ出すネズミのように、Safemoonの中核となる開発者たちは、価格が急落する中、一人また一人と消えていきました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这将是我激动人心的 \"安全月 \"传奇的第四部分，受到很多人的谩骂。\n安全员。请看下面的内容来了解。\n\n///////第1部分：萨菲姆在2020年东京奥运会上的心理体操表演\n奥运会上的表现简直令人震惊。他们配得上他们的每一个金牌...",
      "title": "就像老鼠逃离沉船一样，Safemoon的核心开发人员一个接一个地离开，因为价格暴跌，有一个问题没有得到回答--钱去哪儿了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這將是我激動人心的 \"安全月 \"傳奇的第四部分，受到很多人的謾罵。\n安全員。請看下面的內容來了解。\n\n///////第1部分：薩菲姆在2020年東京奧運會上的心理體操表演\n奧運會上的表現簡直令人震驚。他們配得上他們的每一個金牌...",
      "title": "就像老鼠逃離沉船一樣，Safemoon的核心開發人員一個接一個地離開，因爲價格暴跌，有一個問題沒有得到回答--錢去哪兒了？"
    }
  ]
}