{
  "author": "xuanzo",
  "original_created_utc": 1638106406,
  "title": "Was i raped? My post has been removed multiple times. So I've decided to use my main account. Please don't remove... :(",
  "created_utc": 1638114749,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I think my post got removed.. I&#39;m trying to repost again.</p>\n\n<p>Hi. I&#39;ve posted this on another subreddit somewhere. But I&#39;ve been told by a few commenters that i was raped. I just want to ask here, hoping that the answer is no</p>\n\n<p>This is a little explicit, but bear with me. </p>\n\n<p>So i met person X via a dating app and we agreed to have some cuddling time and light sex. Before we met up, i did emphasized that i do not want penetrative sex/ no penetration and X agreed. </p>\n\n<p>After we met at place Z, we cuddled and stuff, then X started asking me if i had tried anal. I said no and im not ready for it, while X started to kiss and finger my ass. I retaliated and said no repeatedly and X continued for a while until i hit X hard on the face. So we went back to light stuff and i thought that was it.</p>\n\n<p>After some time, X pulled me over aggressively, put on a condom and penetrated me. I told X to stop as it was very painful, while X continues to push it in harder and explained that it was an attempt to prepare my ass for anal sex. I screamed NO, it is painful. As i was scared, i said... &quot;Use ur finger first&quot; (knowing that X might not give up). </p>\n\n<p>Slowly, i got used to it. Then we had anal sex.. At that point, it wasnt painful, but i didnt want it..(but i didnt verbalized) and i ignored X thrusting me. Except that it felt great and i was kinda moaning?? It felt like my body was dominated and wanted it, so i went along. I was confused. </p>\n\n<p>After we finished, i was kinda relieved that it was over? So we climaxed, cleaned and part ways.</p>\n\n<p>Idk if that is considered rape...? Just want to hear some thoughts on this...</p>\n\n<p>Here comes the weird part. When X texted and asked if the session was okay. I said it was great. I mean i said that cos i just didnt want any trouble or further complications. Ngl, it felt good, but i feel like burying this whole incident cos it felt &quot;good&quot;, although i didnt explicitly gave any consent.</p>\n\n<p>My thoughts are like, since i kinda &quot;enjoyed&quot; it, maybe it wasn&#39;t rape? Idk..?</p>\n</div><!-- SC_ON -->",
  "score": 118,
  "permalink": "/r/TooAfraidToAsk/comments/r44erx/was_i_raped_my_post_has_been_removed_multiple/",
  "subreddit": "TooAfraidToAsk",
  "id": "r44erx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I think my post got removed.. I'm trying to repost again.\n\nHi. I've posted this on another subreddit somewhere. But I've been told by a few\ncommenters that i was raped. I just want to ask here, hoping that the answer is\nno\n\nThis is a little explicit, but bear with me.\n\nSo i met person X via a dating…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の投稿は削除されてしまったようです。もう一度投稿しようとしています。\n\nこの記事は他のサブレディットのどこかに投稿しました。でも、何人かのコメント欄で、私はレイプされたと言われました。\n私はレイプされたと言われました。私はここで質問したいのですが、答えが「ノー」であることを願っています。\nいいえ\n\nこれは少し露骨ですが、我慢してください。\n\n私は出会い系サイトでXさんと知り合いました・・・。",
      "title": "私はレイプされましたか？私の投稿は何度も削除されています。だからメインアカウントを使うことにしました。削除しないでください... :("
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想我的帖子被删除了。我试着再发一次。\n\n嗨，我在另一个subreddit的某个地方发过这个帖子。但有几个人告诉我\n评论者说我被强奸了。我只是想在这里问一下，希望答案是\n没有\n\n这有点露骨，但请容忍我。\n\n我通过一个交友网站认识了X人。",
      "title": "我被强奸了吗？我的帖子已被删除多次。所以我决定使用我的主账户。请不要删除... :("
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想我的帖子被刪除了。我試着再發一次。\n\n嗨，我在另一個subreddit的某個地方發過這個帖子。但有幾個人告訴我\n評論者說我被強姦了。我只是想在這裏問一下，希望答案是\n沒有\n\n這有點露骨，但請容忍我。\n\n我通過一個交友網站認識了X人。",
      "title": "我被強姦了嗎？我的帖子已被刪除多次。所以我決定使用我的主賬戶。請不要刪除... :("
    }
  ]
}