{
  "author": "wiptheman",
  "the_new_excerpt": "First of all let me underline the fact that I am not a financial advisor and\nthis is not financial advice. This is merely the result of some of my due\ndiligence that I am sharing with you because I believe that if we succeed\ntogether as a community the future of crypto will be even brighter. I’m…",
  "original_created_utc": 1612957024,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "首先让我强调一个事实，我不是理财顾问，也不是\n这不是财务建议。这只是我的一些适当的结果。\n我与你们分享的勤奋，因为我相信，如果我们成功了。\n作为一个社区，加密的未来将更加光明。我...",
      "title": "为什么巴菲特指标可以成为加密货币投资的最重要指标!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先讓我強調一個事實，我不是理財顧問，也不是\n這不是財務建議。這只是我的一些適當的結果。\n我與你們分享的勤奮，因爲我相信，如果我們成功了。\n作爲一個社區，加密的未來將更加光明。我...",
      "title": "爲什麼巴菲特指標可以成爲加密貨幣投資的最重要指標!"
    }
  ],
  "title": "Why the Warren Buffet indicator could be the most important indicator for cryptos investments!",
  "created_utc": 1612982052,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p>First of all let me underline the fact that I am not a financial advisor and this is not financial advice. This is merely the result of some of my due diligence that I am sharing with you because I believe that if we succeed together as a community the future of crypto will be even brighter. I’m simply looking at the number and trying to apply common sense. I also look forward to reading your constructive opinions.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/vpwq835pzmg61.jpg?width=784&amp;format=pjpg&amp;auto=webp&amp;s=85b73faaa79805b26caa9587067c7b018151c052\">https://preview.redd.it/vpwq835pzmg61.jpg?width=784&amp;format=pjpg&amp;auto=webp&amp;s=85b73faaa79805b26caa9587067c7b018151c052</a></p>\n\n<p><strong>The Buffet indicator (above)</strong></p>\n\n<p>Will show the disconnection between the Market Cap (stock market) and the GPD (economy) in the USA. When at 100% it means the Market and the GDP are in Balance. Above, the market it&#39;s overvalued and under the market is undervalued. As you can see from the graph’s last update in Q3 -2020 we are were then at 160.3% the biggest disconnection since this charts exists or since 1970… This does not factor in Q4 -2020 and the stimulus of Biden. We could well be at 170 or 180% at the time of this post.</p>\n\n<p>Now as the graph shows with the internet bubble of 2001 when the disconnection between the Stock Market and the Economy is too important it eventually has to reconnect. And this can happen in two ways:</p>\n\n<ul>\n<li>The GPD (economy) growth has to outpace that of the sock market to gently close the gap to something more sustainable. But this requires a strong economy not hampered by a pandemic.</li>\n<li>The stock market corrects more or less brutally.</li>\n</ul>\n\n<p><strong>But what is the link with Crypto?</strong></p>\n\n<p>Well as most of us have experienced in March 2020 if the stock market corrects too fast it takes down crypto in its fall even more brutally.</p>\n\n<p><strong>But it will just rebound like in March 2020 right after the crash!</strong></p>\n\n<p>Two of the mean reasons why the market rebounded in March 2020 so quickly is because of the strong moves from the FED with interest rates back to zero and all the money printing. Eventually the US will have to stop printing money at this rate (the US has printed 30% of the total volume of USD in just 2020 alone) and interest can’t go much lower than zero (although there are talks about negative interest rates).</p>\n\n<p><strong>So here is what I think could happen:</strong></p>\n\n<p>When the US stops printing money and the stock market’s rally loses strength we will be walking on very thin ice. Note this could take months if not most of 2021. But at that point we’ll be at risk of a serious market correction that is very likely to take the crypto market down in its fall.</p>\n\n<p><strong>What will trigger the stock market correction?</strong></p>\n\n<p>This is the one million BTC question. Nobody knows when or what could trigger the correction.</p>\n\n<p><strong>Great so what should we do?</strong></p>\n\n<p>Enters a bit of risk management and DCA (Dollar Cost Averaging):</p>\n\n<ul>\n<li>Take some profits</li>\n<li>Progressively DCA out when your coins create new all-time highs</li>\n<li>Keep an eye on intertest rates and money printing in the USA</li>\n<li>Keep an eye on the above Warren Buffet Indicator</li>\n<li>Don’t invest money you can’t afford to lose</li>\n</ul>\n\n<p>Last but certainly not least, don’t get me wrong, I’m very bullish on the future of Cryptos, I truly believe it’s the future and that DeFi and DeEx will change the financial markets as we know them. But I also want to have a bit of cash at my disposal should a correction come so that I can double down on my positions. A bit of risk management when we create all those new ATHs would allow that.</p>\n\n<p>Good luck with your investments and may we all thrive together!</p>\n\n<p><strong>TLDR;</strong></p>\n\n<p>The US stock market is more disconnected from the US GDP than ever. When the FED stops printing money it could reconnect quite brutally. When it does it will take the crypto market in its fall. Apply caution, have an exit strategy DCA out and take profits. </p>\n</div><!-- SC_ON -->",
  "score": 286,
  "permalink": "/r/CryptoCurrency/comments/lgrumg/why_the_warren_buffet_indicator_could_be_the_most/",
  "subreddit": "CryptoCurrency",
  "id": "lgrumg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123197366
}