{
  "author": "imbadthough",
  "the_new_excerpt": "So my Mum doesn't even know how to text properly or use more than 2 fingers on a\nkeyboard at one time. Yet, she listened to me and believed me through my years\nof crypto ramble from 2015 till now.\n\"it can't not be the future\", \"halving is real\", \"buy when it's down 70%, here\ncoincap shows you…",
  "original_created_utc": 1616909798,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "所以，我的妈妈甚至不知道如何正确的文字 或使用超过两个手指在一个。\n曾经的键盘。然而，她却听我的，相信我的，在我多年的\n从2015年到现在，加密漫游的。\n\"它不可能不是未来\"、\"减半是真的\"、\"跌了70%就买，在这里\ncoincap向你展示...",
      "title": "我妈妈比我还厉害..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以，我的媽媽甚至不知道如何正確的文字 或使用超過兩個手指在一個。\n曾經的鍵盤。然而，她卻聽我的，相信我的，在我多年的\n從2015年到現在，加密漫遊的。\n\"它不可能不是未來\"、\"減半是真的\"、\"跌了70%就買，在這裏\ncoincap向你展示...",
      "title": "我媽媽比我還厲害..."
    }
  ],
  "title": "My Mom outdid me...",
  "created_utc": 1616923835,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So my Mum doesn&#39;t even know how to text properly or use more than 2 fingers on a keyboard at one time. Yet, she listened to me and believed me through my years of crypto ramble from 2015 till now.<br/>\n&quot;it can&#39;t not be the future&quot;, &quot;halving is real&quot;, &quot;buy when it&#39;s down 70%, here coincap shows you when&quot;.  </p>\n\n<p>I found out today, she&#39;s turned $500 into $10,000 since 2018. I told her &quot;just gamble on whatever is in the top 20, better than those scratch it tickets.&quot; She listened and did so and she has not seen a loss on any investment, an entire green portfolio. Meanwhile I troll news/pages daily looking for my next quick earn and I can assure you I&#39;ve never profited in the way she &#39;accidently&#39; has...   </p>\n\n<p>Crypto is bizarre, beautiful and confusing. I love it and need to learn to listen to myself more often.<br/>\nWhilst I margin trade my silly coins chasing immediate wins, she diamond handed my original sentiment and idea. Congrats Mum, this is just the beginning.</p>\n</div><!-- SC_ON -->",
  "score": 1077,
  "permalink": "/r/CryptoCurrency/comments/meve6b/my_mom_outdid_me/",
  "subreddit": "CryptoCurrency",
  "id": "meve6b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357137111
}