{
  "author": "Rameh_al-faleh",
  "original_created_utc": 1628381077,
  "title": "As a non US citizen ! what can i do to fight against the upcoming infrastructure bill",
  "created_utc": 1628415233,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Expanding the US government surveillance on crypto is very bad idea especially in this decade ! </p>\n\n<p>And I think it won&#39;t just affect US citizens ,  it will have an impact on the whole market and also more goverment around the world will do the same </p>\n\n<p>So for a US citizen you can call your senators and directly engage with them but for the rest of us what can we do except spreading the message ?</p>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/Bitcoin/comments/p04dbe/as_a_non_us_citizen_what_can_i_do_to_fight/",
  "subreddit": "Bitcoin",
  "id": "p04dbe",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Expanding the US government surveillance on crypto is very bad idea especially\nin this decade !\n\nAnd I think it won't just affect US citizens , it will have an impact on the\nwhole market and also more goverment around the world will do the same\n\nSo for a US citizen you can call your senators and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "米国政府による暗号監視を拡大することは、特にこの10年では非常に悪い考えです。\nこの10年間では特にそうです。\n\nまた、米国市民だけでなく、市場全体に影響を与えると思います。\n市場全体に影響を与え、さらに世界中の政府が同じことをするでしょう。\n\nですから、米国市民は上院議員に電話したり...。",
      "title": "米国外の市民として、今度のインフラ法案に対抗するために何ができるでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "扩大美国政府对加密货币的监控是非常糟糕的想法，特别是在这十年里!\n特别是在这个十年里!\n\n我认为这不仅会影响美国公民，还会影响到整个市场。\n整个市场，而且世界上更多的政府也会这样做。\n\n所以对于美国公民来说，你可以打电话给你的参议员和...",
      "title": "作为一个非美国公民！我可以做什么来反对即将到来的基础设施法案？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "擴大美國政府對加密貨幣的監控是非常糟糕的想法，特別是在這十年裏!\n特別是在這個十年裏!\n\n我認爲這不僅會影響美國公民，還會影響到整個市場。\n整個市場，而且世界上更多的政府也會這樣做。\n\n所以對於美國公民來說，你可以打電話給你的參議員和...",
      "title": "作爲一個非美國公民！我可以做什麼來反對即將到來的基礎設施法案？"
    }
  ]
}