{
  "author": "graytleapforward",
  "original_created_utc": 1625579478,
  "title": "Any Boomers out there stacking Crypto for retirement?",
  "created_utc": 1625592735,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m 60 years old, broke ass bartender for 40 years. Been in Crypto, buying what I can afford on my shit wage and tips for 3 years. Haven&#39;t sold any but occasionally swing trade some alts for BTC. Got an OK bag now, although I&#39;ve taken a haircut like most lately...but it has basically doubled my compulsory Superannuation savings ( Australia). My plan is not to cash out but set up a crypto based pension by staking with a reputable platform like Blockfi etc. and then move to a cheaper country with a good lifestyle to offer.\nAny other Boomers out there with similar  ideas, plans or advice?</p>\n</div><!-- SC_ON -->",
  "score": 275,
  "permalink": "/r/CryptoCurrency/comments/oevc89/any_boomers_out_there_stacking_crypto_for/",
  "subreddit": "CryptoCurrency",
  "id": "oevc89",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm 60 years old, broke ass bartender for 40 years. Been in Crypto, buying what\nI can afford on my shit wage and tips for 3 years. Haven't sold any but\noccasionally swing trade some alts for BTC. Got an OK bag now, although I've\ntaken a haircut like most lately...but it has basically doubled my…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は60歳で、40年間バーテンダーをしていました。3年前から暗号化されたものを買っています\n安い給料とチップで買える分だけ買って3年。一度も売ったことはありませんが\nたまにアルトをBTCに交換したりしています。最近は髪を切ったが、今はいいバッグを持っている。\n最近のように髪を切ったが...基本的には2倍になった...",
      "title": "老後のために暗号を貯めている団塊の世代はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我已经60岁了，做了40年的破产酒保。我从事加密货币，用我的工资和小费购买\n我的工资和小费能买得起的，已经3年了。我没有卖掉任何东西，但\n偶尔会用一些代理币换取BTC。现在有一个不错的包，虽然我已经\n但它基本上使我的收入翻了一番。",
      "title": "有哪个潮汕人在为退休而堆积加密货币吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我已經60歲了，做了40年的破產酒保。我從事加密貨幣，用我的工資和小費購買\n我的工資和小費能買得起的，已經3年了。我沒有賣掉任何東西，但\n偶爾會用一些代理幣換取BTC。現在有一個不錯的包，雖然我已經\n但它基本上使我的收入翻了一番。",
      "title": "有哪個潮汕人在爲退休而堆積加密貨幣嗎？"
    }
  ]
}