{
  "author": "Bumblebeejay",
  "the_new_excerpt": "The thought of doing that for however many hours a day, for 5 days a week for\nthe rest of my life just makes me not look forward to the future at all. I know\nit has to be done to make a living for myself, and if I have kiddies in the\nfuture, but damn does it make the future less exciting.",
  "original_created_utc": 1617238934,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "想到每天做多少个小时，每周做5天，为的是什么？\n余生只是让我对未来一点都不期待。我知道...\n它必须为我自己的生活，如果我有孩子在。\n未来，但该死的是它使未来不那么令人兴奋。",
      "title": "这种朝九晚五，每周工作5天的狗屁生活，让我对未来没有期待，是不是很糟糕？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "想到每天做多少個小時，每週做5天，爲的是什麼？\n餘生只是讓我對未來一點都不期待。我知道...\n它必須爲我自己的生活，如果我有孩子在。\n未來，但該死的是它使未來不那麼令人興奮。",
      "title": "這種朝九晚五，每週工作5天的狗屁生活，讓我對未來沒有期待，是不是很糟糕？"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "それを1日何時間、週5日、一生続けていくことを考えると\n考えると、将来が全く楽しみではなくなります。しかし\n自分の生活のためにも、将来子供ができたときのためにも、やらなければならないことはわかっています。\nしかし、これでは将来が楽しみでなりません。",
      "title": "9時から5時まで、週5日の仕事が一生続くなんて、将来が楽しみでならないというのは悪いことでしょうか？"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "それを1日何時間、週5日、一生続けていくことを考えると\n考えると、将来が全く楽しみではなくなります。しかし\n自分の生活のためにも、将来子供ができたときのためにも、やらなければならないことはわかっています。\nしかし、これでは将来が楽しみでなりません。",
      "title": "9時から5時まで、週5日の仕事が一生続くなんて、将来が楽しみでならないというのは悪いことでしょうか？"
    }
  ],
  "title": "Is it bad that this whole 9-5, working 5 days a week bullshit for the rest of my life makes me not look forward to the future?",
  "created_utc": 1617251110,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The thought of doing that for however many hours a day, for 5 days a week for the rest of my life just makes me not look forward to the future at all. I know it has to be done to make a living for myself, and if I have kiddies in the future, but damn does it make the future less exciting.</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/NoStupidQuestions/comments/mhk5ok/is_it_bad_that_this_whole_95_working_5_days_a/",
  "subreddit": "NoStupidQuestions",
  "id": "mhk5ok",
  "is_self": true,
  "media": null,
  "is_video": false
}