{
  "author": "GrandMasterGush",
  "original_created_utc": 1657214676,
  "title": "In the HBO series The Gilded Age one of the old money characters quips that well brought up women don't hang out at Delmonicos. But I'd always read that the original Delmonicos was one of old New York's premiere fine dining establishments. So what exactly was this famous restaurant's reputation?",
  "created_utc": 1657235044,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In the HBO series, set in NYC in the early 1880s, one of the old money characters remarks that well brought up young women &amp;quot;aren&amp;#39;t the girls lighting the cigars of their escorts at Delmonicos&amp;quot;. This seems to imply that someone of good standing in high society (or at least a woman of good standing)  wouldn&amp;#39;t want to be seen there. And the show does imply that most of the wealthy families in New York had their own cooks and would regularly host others for meals at their homes.&lt;/p&gt;\n\n&lt;p&gt;But whenever I&amp;#39;ve read about Delmonicos during that period (the gilded age) it always comes across as being a prestigious fine dining restaurant that catered to the wealthy and powerful. Was there something about Delmonicos in particular that &amp;quot;old society&amp;quot; didn&amp;#39;t like? Was it the kind of place where married men brought their mistresses? Or were private restaurants part of a broader cultural shift between old money and new money?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 120,
  "permalink": "/r/AskHistorians/comments/vtny4a/in_the_hbo_series_the_gilded_age_one_of_the_old/",
  "subreddit": "AskHistorians",
  "id": "vtny4a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In the HBO series, set in NYC in the early 1880s, one of the old money\ncharacters remarks that well brought up young women \"aren't the girls lighting\nthe cigars of their escorts at Delmonicos\". This seems to imply that someone of\ngood standing in high society (or at least a woman of good standing)…"
}