{
  "author": "GrandMasterGush",
  "original_created_utc": 1657214676,
  "title": "In the HBO series The Gilded Age one of the old money characters quips that well brought up women don't hang out at Delmonicos. But I'd always read that the original Delmonicos was one of old New York's premiere fine dining establishments. So what exactly was this famous restaurant's reputation?",
  "created_utc": 1657235044,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In the HBO series, set in NYC in the early 1880s, one of the old money characters remarks that well brought up young women &amp;quot;aren&amp;#39;t the girls lighting the cigars of their escorts at Delmonicos&amp;quot;. This seems to imply that someone of good standing in high society (or at least a woman of good standing)  wouldn&amp;#39;t want to be seen there. And the show does imply that most of the wealthy families in New York had their own cooks and would regularly host others for meals at their homes.&lt;/p&gt;\n\n&lt;p&gt;But whenever I&amp;#39;ve read about Delmonicos during that period (the gilded age) it always comes across as being a prestigious fine dining restaurant that catered to the wealthy and powerful. Was there something about Delmonicos in particular that &amp;quot;old society&amp;quot; didn&amp;#39;t like? Was it the kind of place where married men brought their mistresses? Or were private restaurants part of a broader cultural shift between old money and new money?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 120,
  "permalink": "/r/AskHistorians/comments/vtny4a/in_the_hbo_series_the_gilded_age_one_of_the_old/",
  "subreddit": "AskHistorians",
  "id": "vtny4a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In the HBO series, set in NYC in the early 1880s, one of the old money\ncharacters remarks that well brought up young women \"aren't the girls lighting\nthe cigars of their escorts at Delmonicos\". This seems to imply that someone of\ngood standing in high society (or at least a woman of good standing)…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1880年代初頭のNYを舞台にしたHBOシリーズでは、あるオールドマネーの\nは、「デルモニコでエスコートの葉巻に火をつけるような女たちではない」と発言しています。\nデルモニコでエスコート役の葉巻に火をつけているのは彼女たちではない」と発言している。これは、以下のようなことを暗示しているようです。\n上流社会でそれなりの地位のある人（少なくともそれなりの女性）...",
      "title": "HBOの「The Gilded Age」シリーズで、昔のお金持ちの登場人物が、「育ちのいい女性はデルモニコには寄りつかない」と言い放ちました。しかし、私はいつも、デルモニコスはニューヨークの高級レストランの一つであると読んでいた。では、この名店の評判は一体どうだったのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在以19世纪80年代初的纽约市为背景的HBO剧集中，其中一个老财主\n角色说，受过良好教育的年轻女性 \"不是在德尔莫尼科斯为她们的陪同人员点雪茄的女孩\"。\n在德尔莫尼科斯（Delmonicos）为她们的陪同者点雪茄\"。这似乎是在暗示，在上流社会有地位的人\n在上流社会有良好地位的人（或至少是有良好地位的女人）......",
      "title": "在HBO剧集《镀金时代》中，一个老财主打趣说，有教养的女人不会在德尔莫尼科斯玩耍。但我一直读到，最初的德尔莫尼克斯是老纽约首屈一指的高级餐厅之一。那么，这家著名的餐厅到底有什么名气呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在以19世紀80年代初的紐約市爲背景的HBO劇集中，其中一個老財主\n角色說，受過良好教育的年輕女性 \"不是在德爾莫尼科斯爲她們的陪同人員點雪茄的女孩\"。\n在德爾莫尼科斯（Delmonicos）爲她們的陪同者點雪茄\"。這似乎是在暗示，在上流社會有地位的人\n在上流社會有良好地位的人（或至少是有良好地位的女人）......",
      "title": "在HBO劇集《鍍金時代》中，一個老財主打趣說，有教養的女人不會在德爾莫尼科斯玩耍。但我一直讀到，最初的德爾莫尼克斯是老紐約首屈一指的高級餐廳之一。那麼，這家著名的餐廳到底有什麼名氣呢？"
    }
  ]
}