{
  "author": "GeAlltidUpp",
  "original_created_utc": 1639939305,
  "title": "Did people in Medieval Europe really practice \"Genital Parenting\"",
  "created_utc": 1639947121,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;According to &amp;quot;Growing Up Sexually World Reference Atlas&amp;quot;, a secondary source which I haven&amp;#39;t been able to find evaluations of, historical data points towards the possibility that: &amp;quot;Genital soothing may well have been widespread in Medieval Europe&amp;quot;. In other words, that adults would stimulate the genitalia of children, as a way of calming or controlling them (&lt;a href=\"http://www.sexarchive.info/GESUND/ARCHIV/GUS/HISTORYCHHS.HTM\"&gt;Janssen, D. F. (2002/10) &amp;quot;Growing Up Sexually. Volume I: World Reference Atlas. Interim report. Amsterdam, The Netherlands - Europe, Historical Generalia&amp;quot;&lt;/a&gt;).  &lt;/p&gt;\n\n&lt;p&gt;To back this up, the archive references a lot of sources that I haven&amp;#39;t taken the time to go through, and which seem hard for me to estimate the reliability of. I&amp;#39;ve noticed that one of the main sources is written by Lloyd Demause, whose work I generally view skeptically. To me, the original claim seems almost too sensational to be taken seriously, which is partly why I suspect it of being a fabrication.   &lt;/p&gt;\n\n&lt;p&gt;Is there any truth to the proposition?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 110,
  "permalink": "/r/AskHistorians/comments/rk2tvq/did_people_in_medieval_europe_really_practice/",
  "subreddit": "AskHistorians",
  "id": "rk2tvq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "According to \"Growing Up Sexually World Reference Atlas\", a secondary source\nwhich I haven't been able to find evaluations of, historical data points towards\nthe possibility that: \"Genital soothing may well have been widespread in\nMedieval Europe\". In other words, that adults would stimulate the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "二次資料である「Growing Up Sexually World Reference Atlas」によると\n歴史的なデータが示しているのは、私が評価を見つけられなかったことです。\nという可能性があります。「生殖器への癒しが広く行われていた可能性がある。\n中世ヨーロッパ」。つまり、大人が刺激することで、...",
      "title": "中世ヨーロッパの人々は、本当に \"性器育児 \"をしていたのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "根据 \"性成长世界参考图集\"，一个二手资料来源\n我没能找到对它的评价，历史数据表明\n的可能性。\"在中世纪的欧洲，生殖器抚摸很可能已经很普遍了。\n中世纪的欧洲\"。换句话说，成年人会刺激...",
      "title": "中世纪欧洲的人们真的实行 \"生殖器养育 \"吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "根據 \"性成長世界參考圖集\"，一個二手資料來源\n我沒能找到對它的評價，歷史數據表明\n的可能性。\"在中世紀的歐洲，生殖器撫摸很可能已經很普遍了。\n中世紀的歐洲\"。換句話說，成年人會刺激...",
      "title": "中世紀歐洲的人們真的實行 \"生殖器養育 \"嗎？"
    }
  ]
}