{
  "author": "leothefox314",
  "original_created_utc": 1648433499,
  "title": "Is it a double standard that Regina Hall felt up a bunch of men at the Oscars, but that joke would've faced more backlash if the roles had been gender-reversed?",
  "created_utc": 1648447046,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I feel like when women objectify men in this manner, everyone laughs it off, but when MEN have any desire to do the same, it&amp;#39;s sexual harrassment and the metooers feel they must intervene and weinstein his ass.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not saying male sexual harrassment is okay, I&amp;#39;m just saying that that joke was messed up as fuck, and DON&amp;#39;T YOU DARE say I&amp;#39;m buzzkill OR a misogynist!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/tpyvao/is_it_a_double_standard_that_regina_hall_felt_up/",
  "subreddit": "TooAfraidToAsk",
  "id": "tpyvao",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I feel like when women objectify men in this manner, everyone laughs it off, but\nwhen MEN have any desire to do the same, it's sexual harrassment and the\nmetooers feel they must intervene and weinstein his ass.\n\nI'm not saying male sexual harrassment is okay, I'm just saying that that joke\nwas…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "女性がこうやって男性を客観視すると、みんな笑い飛ばすような気がするけど\n男性が同じことをしようとすると、セクハラとなり\nmetooersは、彼らが介入し、彼のお尻をワインスタインしなければならないと感じています。\n\n男性のセクハラがいいとは言いませんが、あのジョークがいいと言っているだけです。\nは...",
      "title": "レジーナ・ホールがアカデミー賞で大勢の男性にフェラをしたのはダブルスタンダードだが、そのジョークが男女の役割を逆転させていたら、もっと反発を受けただろう？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我觉得当女性以这种方式物化男性时，每个人都会一笑置之，但当男性有任何想要做同样的事情时，就会成为性骚扰，并被视为性骚扰。\n但当男人有任何欲望做同样的事情时，这就是性骚扰和\nmetooers觉得他们必须介入，并对他的屁股进行干预。\n\n我不是说男性性骚扰是可以的，我只是说那个笑话\n是...",
      "title": "雷吉娜-霍尔在奥斯卡颁奖典礼上感受到了一群男人，但如果角色反转，这个笑话会面临更多的反击，这是不是双重标准？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我覺得當女性以這種方式物化男性時，每個人都會一笑置之，但當男性有任何想要做同樣的事情時，就會成爲性騷擾，並被視爲性騷擾。\n但當男人有任何慾望做同樣的事情時，這就是性騷擾和\nmetooers覺得他們必須介入，並對他的屁股進行干預。\n\n我不是說男性性騷擾是可以的，我只是說那個笑話\n是...",
      "title": "雷吉娜-霍爾在奧斯卡頒獎典禮上感受到了一羣男人，但如果角色反轉，這個笑話會面臨更多的反擊，這是不是雙重標準？"
    }
  ]
}