{
  "author": "seanyseanerson",
  "original_created_utc": 1632996646,
  "title": "So many clothes made for women; pants, trousers, shorts, leggings, swimming costumes etc, are designed go right up inbetween the bumcheeks. Is that not incredibly uncomfortable!? How do you put up with it!?",
  "created_utc": 1633010144,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If my boxers ride up even slightly I will stop and pull them out and I don&#39;t care who is watching. How do you cope!? If that&#39;s not the worst clothing nightmare you have to put up with, what is!?</p>\n\n<p>Edit* TIL a lot aren&#39;t designed that way and people just wear stuff that&#39;s too small and pull them right up! Thanks Reddit.</p>\n</div><!-- SC_ON -->",
  "score": 116,
  "permalink": "/r/AskWomen/comments/pygrpz/so_many_clothes_made_for_women_pants_trousers/",
  "subreddit": "AskWomen",
  "id": "pygrpz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "If my boxers ride up even slightly I will stop and pull them out and I don't\ncare who is watching. How do you cope!? If that's not the worst clothing\nnightmare you have to put up with, what is!?\n\nEdit* TIL a lot aren't designed that way and people just wear stuff that's too\nsmall and pull them right…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ボクサーが少しでも上がってきたら、立ち止まって引っ張り出します。\n誰が見ていようと気にしません。どうやって対処していますか？もしこれが、あなたが我慢しなければならない最悪の服\n我慢しなければならない最悪の服の悪夢でなければ、何を我慢すればいいのでしょうか？\n\n編集* 多くはそのようにデザインされていないので、人々はただ小さすぎたり、大きすぎたりするものを着ています。\n小さすぎるものを着て、それを引きずる...。",
      "title": "パンツ、ズボン、ショートパンツ、レギンス、水着など、女性のために作られた多くの服は、お尻のお尻の間に入るようにデザインされています。それはとても不快なことではありませんか？皆さんはどうやって我慢していますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果我的四角裤哪怕是稍稍往上搭，我就会停下来把它们拉出来，我不在乎谁在看。\n我不关心谁在看。你是如何应对的！？如果这还不是最糟糕的服装\n如果这不是你必须忍受的最糟糕的衣服，那是什么呢？\n\n编辑：很多衣服都不是这样设计的，人们只是穿了太小的东西。\n小的东西，然后把它们拉到右边...",
      "title": "许多为女性制作的衣服；裤子、长裤、短裤、紧身裤、游泳衣等，都是设计在臀部之间的。这不是令人难以置信的不舒服吗？你是如何忍受的呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果我的四角褲哪怕是稍稍往上搭，我就會停下來把它們拉出來，我不在乎誰在看。\n我不關心誰在看。你是如何應對的！？如果這還不是最糟糕的服裝\n如果這不是你必須忍受的最糟糕的衣服，那是什麼呢？\n\n編輯：很多衣服都不是這樣設計的，人們只是穿了太小的東西。\n小的東西，然後把它們拉到右邊...",
      "title": "許多爲女性製作的衣服；褲子、長褲、短褲、緊身褲、游泳衣等，都是設計在臀部之間的。這不是令人難以置信的不舒服嗎？你是如何忍受的呢？"
    }
  ]
}