{
  "author": "fakenamebobcarter",
  "the_new_excerpt": "Bill Hwang the ultimate degen, retard who was guilty of insider trading more\nthan 10 years ago blow up 15 Billion of his own money (some friends too) and 2\nBillion dollars at Japanese broker Nomura (stock down 16 percent), unknown for\nGoldman and MS (they sold more than 10 billion in block trade…",
  "original_created_utc": 1617000526,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "黄晓明，一个内幕交易的终极堕落者，弱智者 更多\n比10年前爆出150亿的自己的钱（有些朋友也是）和2。\n亿美元在日本券商野村(股价下跌16%)，不明原因。\n高盛和MS（他们在大宗交易中卖出了100多亿... ...",
      "title": "黄标，最大的一个投资人损失色情片150亿+MM的几十亿。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "黃曉明，一個內幕交易的終極墮落者，弱智者 更多\n比10年前爆出150億的自己的錢（有些朋友也是）和2。\n億美元在日本券商野村(股價下跌16%)，不明原因。\n高盛和MS（他們在大宗交易中賣出了100多億... ...",
      "title": "黃標，最大的一個投資人損失色情片150億+MM的幾十億。"
    }
  ],
  "title": "Bill Hwang, Biggest 15B lost porn from a single investor + Billions from MM",
  "created_utc": 1617022526,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Bill Hwang the ultimate degen, retard who was guilty of insider trading more than 10 years ago blow up 15 Billion of his own money (some friends too) and 2 Billion dollars at Japanese broker Nomura (stock down 16 percent), unknown for Goldman and MS (they sold more than 10 billion in block trade last week in BIDU, TME, DISC etc) and many other MM because he was leveraged to the tits (3-4 times) and it went tits up.</p>\n\n<p>Archegos (one of bill&#39;s fund) blow up first (Nomura was the broker for this fund) when 1. ViacomSBS announcing share dilution 2. China limiting tutoring classes and vape both of which our boi bill was big on. 3. Chinese companies delisting news</p>\n\n<p>RLX (vape) down more than 70 percent</p>\n\n<p>GSX (tutoring) down from 150 to 30 at the lowest on Friday.</p>\n\n<p>BIDU, TME, DISC etc all down around 50 percent in 3 days</p>\n\n<p>&#x200B;</p>\n\n<p>Bill was also rumored to use an SEC loophole with equity swap to get around disclosing owning more than 5 percent of companies and he basically took loans from MM in NA, EU and japan.</p>\n\n<p>He first started working for Julien Robertson who give him 25 million to start his own fund back in 2001, he averaged 40 percent return until 2008 and was charged with insider trading later. He then started he&#39;s own fund with his own money and quickly grow it to 15 billions and then --&gt; GUH</p>\n</div><!-- SC_ON -->",
  "score": 2895,
  "permalink": "/r/wallstreetbets/comments/mfjkf8/bill_hwang_biggest_15b_lost_porn_from_a_single/",
  "subreddit": "wallstreetbets",
  "id": "mfjkf8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357149296
}