{
  "author": "GONZOFOOT",
  "the_new_excerpt": "I was reflecting at how a close friend I met through skateboarding has\nprogressed since we met (10 years ago) and I made the comment while we were\nskating one day that I “really wished I had stuck with it like he has.” Not in a\njealous way, just in admiration of how far he’s gotten with it. His…",
  "original_created_utc": 1614391124,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我在反思，一个通过滑板认识的好友是如何做到的。\n进展（10年前），而我的评论，当我们\n有一天滑冰，我 \"真的希望自己能像他一样坚持下去\"。不是在一个\n嫉妒的方式，只是在钦佩 他得到了多远与它。他的...",
      "title": "有没有人觉得自己年轻的时候兴趣爱好太多，结果觉得自己在很多事情上都 \"还行\"，但因为把时间都分散在这些事情上，所以对任何一件事情都不是特别擅长？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在反思，一個通過滑板認識的好友是如何做到的。\n進展（10年前），而我的評論，當我們\n有一天滑冰，我 \"真的希望自己能像他一樣堅持下去\"。不是在一個\n嫉妒的方式，只是在欽佩 他得到了多遠與它。他的...",
      "title": "有沒有人覺得自己年輕的時候興趣愛好太多，結果覺得自己在很多事情上都 \"還行\"，但因爲把時間都分散在這些事情上，所以對任何一件事情都不是特別擅長？"
    }
  ],
  "title": "Does anyone else feel like they had too many interests when they were younger, and as a result feel like you are “okay” at a lot of things, but not particularly great at any of them because of spreading the time between them all?",
  "created_utc": 1614415252,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was reflecting at how a close friend I met through skateboarding has progressed since we met (10 years ago) and I made the comment  while we were skating one day that I “really wished I had stuck with it like he has.” Not in a jealous way, just in admiration of how far he’s gotten with it. His response really surprised me, although he is an absolute madman on a skateboard he said that in a way he always thought that he wished he had some the other hobbies I picked up like, art and music.</p>\n\n<p>/\nI feel like i regret spreading my time between hobbies because I haven’t really “excelled” at any of them and am too afraid to ask immediate friends out of risk of sounding depressed</p>\n\n<p>/\nFriend that excels at one of said hobbies I’ve known for 10+ years says he would trade prowess in his skill for the experiences I had </p>\n\n<p>Is my perspective wrong? Do you relate?</p>\n</div><!-- SC_ON -->",
  "score": 118,
  "permalink": "/r/TooAfraidToAsk/comments/ltdjyo/does_anyone_else_feel_like_they_had_too_many/",
  "subreddit": "TooAfraidToAsk",
  "id": "ltdjyo",
  "is_self": true,
  "media": null,
  "is_video": false
}