{
  "author": "Beautiful_Bid_7111",
  "original_created_utc": 1642255503,
  "title": "Is life really about working 40-hour weeks to enjoy those precious weekends over and over again until you die?",
  "created_utc": 1642265555,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I just turned 18, and as I understand it, being an adult means: working a meaningless and exhausting job 5 days a week to have enough money to pay my rent, and at the same time I have practically no time for relationships, hobbies or something else that makes life worth living. And weekends are just two days of stress when you try to get as much done as you can because you don&amp;#39;t have time during the week.&lt;/p&gt;\n\n&lt;p&gt;Is it like that for everyone? Is there a way to NOT do this? What&amp;#39;s the point?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 109,
  "permalink": "/r/NoStupidQuestions/comments/s4l0b4/is_life_really_about_working_40hour_weeks_to/",
  "subreddit": "NoStupidQuestions",
  "id": "s4l0b4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I just turned 18, and as I understand it, being an adult means: working a\nmeaningless and exhausting job 5 days a week to have enough money to pay my\nrent, and at the same time I have practically no time for relationships, hobbies\nor something else that makes life worth living. And weekends are…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は18歳になったばかりですが、私の理解では、大人になるということは、「働く」ということです。\n週5日、意味のない、疲れる仕事をして、生活費を稼ぐ。\nその一方で、人間関係や趣味に費やす時間はほとんどない。\nとか、生き甲斐みたいなものがあるんですよね。そして週末は...",
      "title": "人生とは、週40時間働いて、貴重な週末を死ぬまで何度も楽しむことなのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我刚满18岁，根据我的理解，成为一个成年人意味着：从事一份无意义的、令人筋疲力尽的工作。\n一周工作5天，毫无意义且令人疲惫的工作，以获得足够的钱来支付我的房租。\n同时，我几乎没有时间去处理关系、爱好\n或其他使生活有意义的事情。而周末是...",
      "title": "生活真的是为了每周工作40小时，一次又一次地享受那些宝贵的周末，直到你死去吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我剛滿18歲，根據我的理解，成爲一個成年人意味着：從事一份無意義的、令人筋疲力盡的工作。\n一週工作5天，毫無意義且令人疲憊的工作，以獲得足夠的錢來支付我的房租。\n同時，我幾乎沒有時間去處理關係、愛好\n或其他使生活有意義的事情。而週末是...",
      "title": "生活真的是爲了每週工作40小時，一次又一次地享受那些寶貴的週末，直到你死去嗎？"
    }
  ]
}