{
  "author": "BadAssPleb",
  "the_new_excerpt": "“How can you have money,” demanded Ford, “if none of you actually produces\nanything? It doesn't grow on trees you know.”\n\n“If you would allow me to continue.. .” Ford nodded dejectedly. “Thank you.\nSince we decided a few weeks ago to adopt the leaf as legal tender, we have, of\ncourse, all become…",
  "original_created_utc": 1621012741,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "\"フォードは「誰も実際に生産していないのに、どうしてお金があるの？\n何も生み出さないのに、どうしてお金があるの？木では育たないのだから」。\n\n\"もし、あなたが私に続けさせてくれるなら・・・\" フォードは意気消沈してうなずいた。\"「ありがとうございます。\n数週間前にリーフを法定通貨として採用することを決定して以来、私たちはもちろん、全員が...\n数週間前に葉っぱを法定通貨として採用することを決めてから、私たちはもちろん全員が...",
      "title": "銀河ヒッチハイカーズガイドを読み返していると、今回の暗号のブルランを思わせるような台詞が出てきました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "\"你们怎么会有钱呢？\"福特问道，\"如果你们没有一个人真正生产\n什么？你知道，它不是长在树上的。\"\n\n\"如果你能允许我继续......\"。福特沮丧地点点头。\"谢谢你。\n自从几周前我们决定采用树叶作为法定货币后，我们，当然，都成了......。\n当然，我们都成了...",
      "title": "再次阅读《银河系的搭车指南》时，看到了一段对话，让我想到了这次加密货币的牛市。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "\"你們怎麼會有錢呢？\"福特問道，\"如果你們沒有一個人真正生產\n什麼？你知道，它不是長在樹上的。\"\n\n\"如果你能允許我繼續......\"。福特沮喪地點點頭。\"謝謝你。\n自從幾周前我們決定採用樹葉作爲法定貨幣後，我們，當然，都成了......。\n當然，我們都成了...",
      "title": "再次閱讀《銀河系的搭車指南》時，看到了一段對話，讓我想到了這次加密貨幣的牛市。"
    }
  ],
  "title": "Reading Hitchhikers guide to the galaxy again, came through a dialogue that made me think of this crypto bull run.",
  "created_utc": 1621044008,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>“How can you have money,” demanded Ford, “if none of you actually produces anything? It doesn&#39;t grow on trees you know.”</p>\n\n<p>“If you would allow me to continue.. .”\nFord nodded dejectedly.\n“Thank you. Since we decided a few weeks ago to adopt the leaf as legal tender, we have, of course, all become immensely rich.”</p>\n\n<p>Ford stared in disbelief at the crowd who were murmuring appreciatively at this and greedily fingering the wads of leaves with which their track suits were stuffed.</p>\n\n<p>“But we have also,” continued the management consultant, “run into a small inflation problem on account of the high level of leaf availability, which means that, I gather, the current going rate has something like three deciduous forests buying one ship’s peanut.&quot;</p>\n\n<p>Murmurs of alarm came from the crowd. The management consultant waved them down.\n“So in order to obviate this problem,” he continued, “and effectively revalue the leaf, we are about to embark on a massive defoliation campaign, and. . .er, burn down all the forests. I think you&#39;ll all agree that&#39;s a sensible move under the circumstances.&quot;</p>\n\n<p>The crowd seemed a little uncertain about this for a second or two until someone pointed out how much this would increase the value of the leaves in their pockets whereupon they let out whoops of delight and gave the management consultant a standing ovation. The accountants among them looked forward to a profitable autumn aloft and it got an appreciative round from the crowd.</p>\n\n<p>Gotta love Douglas Adams imagination.</p>\n</div><!-- SC_ON -->",
  "score": 295,
  "permalink": "/r/CryptoCurrency/comments/ncduzy/reading_hitchhikers_guide_to_the_galaxy_again/",
  "subreddit": "CryptoCurrency",
  "id": "ncduzy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590798336
}