{
  "author": "KrishaCZ",
  "original_created_utc": 1652569413,
  "title": "The Marvel show Moon Knight features multiple incantations in Egyptian/Coptic. Are they genuine or just gippberish? How much do we know about the sound of Ancient Egyptian?",
  "created_utc": 1652626360,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;(Spoilers for the finale coming up I guess)&lt;/p&gt;\n\n&lt;p&gt;The one usage that comes to mind is in the finale, when Steven/Marc, Layla and Khonshu are imprisoning Ammit within Harrow. It certainly sounded foreign to my uneducated european ears but I have no idea if it was genuine language or just some vaguely coptic sounding syllables.&lt;/p&gt;\n\n&lt;p&gt;The Hieroglyphics have been decoded and understood, and if I&amp;#39;m not mistaken they are basically a more complicated alphabet (every image representing one sound)&lt;/p&gt;\n\n&lt;p&gt;so how much do we know about the phonetics, grammar and vocabulary of the language? Can the writings on different buildings across time show us a development?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/upslhu/the_marvel_show_moon_knight_features_multiple/",
  "subreddit": "AskHistorians",
  "id": "upslhu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "(Spoilers for the finale coming up I guess)\n\nThe one usage that comes to mind is in the finale, when Steven/Marc, Layla and\nKhonshu are imprisoning Ammit within Harrow. It certainly sounded foreign to my\nuneducated european ears but I have no idea if it was genuine language or just\nsome vaguely…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "(フィナーレのネタバレはこれからだと思います)\n\n思い当たる使い方は、フィナーレでスティーブン／マーク、レイラ、そして\nKhonshuがHarrowの中でAmmitを幽閉しているところです。確かに、私のような無教養な人間には、外国語のように聞こえました。\nけど、それが本物の言葉なのか、それともただ何となく...なのか、私にはわかりません。\n漠然としたものなのか...。",
      "title": "マーベルの番組「ムーンナイト」では、エジプト語/コプト語の呪文が何度も登場します。それらは本物なのか、それともただのギップベリッシュなのか？古代エジプト語の音について、私たちはどの程度知っているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "(大结局的剧透即将到来，我猜)\n\n我想到的一个用法是在结局中，当史蒂芬/马克、莱拉和\nKhonshu将Ammit囚禁在哈罗镇。对于我这个没有受过教育的欧洲人来说，这听起来当然很陌生。\n但我不知道这是否是真正的语言，或者只是一些模糊的......。\n一些隐约的...",
      "title": "漫威剧《月亮骑士》中出现了多个埃及/科普特语的咒语。这些咒语是真的吗，还是只是胡言乱语？我们对古埃及语的声音了解多少？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "(大結局的劇透即將到來，我猜)\n\n我想到的一個用法是在結局中，當史蒂芬/馬克、萊拉和\nKhonshu將Ammit囚禁在哈羅鎮。對於我這個沒有受過教育的歐洲人來說，這聽起來當然很陌生。\n但我不知道這是否是真正的語言，或者只是一些模糊的......。\n一些隱約的...",
      "title": "漫威劇《月亮騎士》中出現了多個埃及/科普特語的咒語。這些咒語是真的嗎，還是隻是胡言亂語？我們對古埃及語的聲音瞭解多少？"
    }
  ]
}