{
  "author": "Tlr321",
  "the_new_excerpt": "So I’ve been smoking off and on since 2015. The last year though I’ve been\nsmoking nonstop, basically smoking outside of home and vaping at home. I also\nchew gum. A lot. My mom always had a pack of trident in her purse so as I grew\nup, I would be chewing trident. I chewed trident more than I smoked,…",
  "original_created_utc": 1618253456,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は2015年から喫煙しています。ここ1年はノンストップで吸っています。\n基本的には家の外で吸って、家ではVAPEで吸うというノンストップ喫煙です。また\nガムを噛んでいます。たくさんね。母はいつも財布にトライデントを入れていたので、私が成長するにつれ\n大人になってからもトライデントを噛んでいました。タバコを吸うよりもトライデントを噛んでいましたね。",
      "title": "タバコをやめるためにパブロフの犬になった？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我从2015年开始就断断续续的抽烟。不过去年我已经\n不停的抽烟，基本上是在外面抽，在家里抽。我还\n嚼口香糖。很多。我妈妈的包里总是有一包三叉戟，所以当我长大后\n我就会去嚼三叉戟了 我嚼三叉戟比抽烟还多...",
      "title": "我巴甫洛夫的狗自己戒烟了吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我從2015年開始就斷斷續續的抽菸。不過去年我已經\n不停的抽菸，基本上是在外面抽，在家裏抽。我還\n嚼口香糖。很多。我媽媽的包裏總是有一包三叉戟，所以當我長大後\n我就會去嚼三叉戟了 我嚼三叉戟比抽菸還多...",
      "title": "我巴甫洛夫的狗自己戒菸了嗎？"
    }
  ],
  "title": "Did I Pavlov’s Dog myself to quit smoking cigarettes?",
  "created_utc": 1618270291,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I’ve been smoking off and on since 2015. The last year though I’ve been smoking nonstop, basically smoking outside of home and vaping at home. I also chew gum. A lot. My mom always had a pack of trident in her purse so as I grew up, I would be chewing trident. I chewed trident more than I smoked, and usually chewed it as I smoked.</p>\n\n<p>Last week, I decided to quit cold turkey on the cigarettes. I noticed as I was chewing gum, I felt a head rush similar to what I get when I smoke a cigarette for the first time in a few hours.</p>\n\n<p>Did I accidentally Pavlov my brain to give itself a dopamine rush when I chew gum because it associated the gum with the nicotine? I’m not even sure if that’s a thing or not. For one thing, it’s made quitting nicotine way easier than I thought.</p>\n</div><!-- SC_ON -->",
  "score": 112,
  "permalink": "/r/NoStupidQuestions/comments/mpkiwk/did_i_pavlovs_dog_myself_to_quit_smoking/",
  "subreddit": "NoStupidQuestions",
  "id": "mpkiwk",
  "is_self": true,
  "media": null,
  "is_video": false
}