{
  "author": "colingiam",
  "original_created_utc": 1635505441,
  "title": "ALGO - Why you should buy",
  "created_utc": 1635525357,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>El Salvador just approved Bitcoin as legal money. As part of that announcement, Algorand was chosen as the project&#39;s official blockchain platform. Furthermore, according to the Cointelegraph magazine, the ALGO crypto was chosen as the blockchain to aid El Salvador in developing its own blockchain infrastructure.</p>\n\n<p>In fact, on August 31, a Latin American corporation, Koibanx, inked a &quot;cooperation agreement&quot; with El Salvador. A nationwide blockchain Covid certification program will be one of the project&#39;s activities. A point-of-sale credit issuance system and numerous smart contract finance platforms are also part of the project&#39;s activities. Here&#39;s why the agreement proves Algorand&#39;s worth.</p>\n\n<p>Algo crypto offers &quot;the performance, scalability, security, and functionality required to implement large scale projects around the world,&quot; according to the statement.</p>\n\n<p>Furthermore, Algorand&#39;s &quot;public, open source blockchain infrastructure enables interoperability and capacity to manage the volume of transactions required for defi, financial institutions, and governments to successfully migrate towards FutureFi,&quot; according to the statement.</p>\n\n<p>The Foundation announced two separate $5 million &quot;Supagrants&quot; on September 10. One is for the use of Algorand to create &quot;oracle&quot; networks with related price feeds. The other is for proposals to create bidirectional bridges between Ethereum and other chains.</p>\n\n<p>This is exactly what you want from a development group like the Algorand Foundation. It will eventually result in a greater price for the Algo cryptocurrency token.</p>\n\n<p>TLDR;</p>\n\n<p>buy ALGO</p>\n</div><!-- SC_ON -->",
  "score": 174,
  "permalink": "/r/CryptoCurrency/comments/qiaate/algo_why_you_should_buy/",
  "subreddit": "CryptoCurrency",
  "id": "qiaate",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "El Salvador just approved Bitcoin as legal money. As part of that announcement,\nAlgorand was chosen as the project's official blockchain platform. Furthermore,\naccording to the Cointelegraph magazine, the ALGO crypto was chosen as the\nblockchain to aid El Salvador in developing its own blockchain…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "エルサルバドルは、ビットコインを合法的な貨幣として承認しました。その発表の一環として\nこのプロジェクトの公式ブロックチェーン・プラットフォームとしてAlgorandが選ばれました。さらに。\nさらに、Cointelegraph誌によると、エルサルバドルが独自のブロックチェーンを開発するためのブロックチェーンとして、ALGO暗号が選ばれました。\nエルサルバドルが独自のブロックチェーンを開発するのを支援するブロックチェーン...",
      "title": "ALGO - なぜ買うべきなのか"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "萨尔瓦多刚刚批准比特币为合法货币。作为该公告的一部分。\nAlgorand被选为该项目官方区块链平台。此外。\n据Cointelegraph杂志报道，ALGO加密货币被选为\n区块链来帮助萨尔瓦多开发其自己的区块链...",
      "title": "ALGO - 你为什么要买"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "薩爾瓦多剛剛批准比特幣爲合法貨幣。作爲該公告的一部分。\nAlgorand被選爲該項目官方區塊鏈平臺。此外。\n據Cointelegraph雜誌報道，ALGO加密貨幣被選爲\n區塊鏈來幫助薩爾瓦多開發其自己的區塊鏈...",
      "title": "ALGO - 你爲什麼要買"
    }
  ]
}