{
  "author": "TheRealMossBall",
  "the_new_excerpt": "Tl;dr I want to buy stocks but everything has a P/E ratio double that of what is\nhistorically normal, what is going on and why are value ETFs long on so many\novervalued positions?\n\nHey all, newbie question here:\n\nI’m new to investing and learning the basics of stock valuation. The way I\nunderstand…",
  "original_created_utc": 1619527799,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Tl;dr 私は株を買いたいのですが、すべての銘柄のPERが歴史的に見て通常の2倍になっています。\n何が起こっているのでしょうか？また、なぜバリューETFはこれほど多くの過大評価されたポジションを持っているのでしょうか？\nなぜバリューETFはこんなに多くの過大評価されたポジションをロングしているのでしょうか？\n\n皆さん、初心者の質問です。\n\n私は投資を始めたばかりで、株式評価の基礎を学んでいます。私が理解している方法は\n理解しているのは...",
      "title": "今、株価の評価はどうなっているのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想买股票，但所有股票的市盈率都比历史上的正常水平高出一倍。\n我想买股票，但所有股票的市盈率都是历史上正常水平的两倍，这是怎么回事？\n高估的头寸？\n\n大家好，我是新手。\n\n我是投资新手，正在学习股票估值的基本知识。我的方法是\n我的理解是...",
      "title": "现在的股票估值是怎么回事？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想買股票，但所有股票的市盈率都比歷史上的正常水平高出一倍。\n我想買股票，但所有股票的市盈率都是歷史上正常水平的兩倍，這是怎麼回事？\n高估的頭寸？\n\n大家好，我是新手。\n\n我是投資新手，正在學習股票估值的基本知識。我的方法是\n我的理解是...",
      "title": "現在的股票估值是怎麼回事？"
    }
  ],
  "title": "What is going on with stock valuation right now?",
  "created_utc": 1619560061,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Tl;dr I want to buy stocks but everything has a P/E ratio double that of what is historically normal, what is going on and why are value ETFs long on so many overvalued positions?</p>\n\n<p>Hey all, newbie question here:</p>\n\n<p>I’m new to investing and learning the basics of stock valuation. The way I understand it, you start by looking at a company’s price to earnings ratio, or P/E. From moneychimp.com:</p>\n\n<blockquote>\n<p>Although discounted cash flows is the correct way to value a company, people naturally like to use simpler rules of thumb. The P/E ratio is the most popular because it&#39;s easy to understand. <strong>If you buy stock at a P/E ratio of 15, say, then it will take 15 years for the company&#39;s earnings to add up to your original purchase price - 15 years to &quot;pay you back&quot;.</strong> That&#39;s assuming that the company is already in its &quot;mature&quot; stage, where earnings are constant.</p>\n</blockquote>\n\n<p>It goes on to say that you may want to buy at a high PE ratio if you expect earnings to keep increasing. </p>\n\n<p>My understanding is also that the average P/E ratio historically has been somewhere in the ballpark of 13-15. Anything below that, all other fundamentals being equal, is considered a healthy buy.</p>\n\n<p>Now I’m looking into large cap ETFs (I don’t have any positions yet) and checking the valuation of their top holdings and.... I’m seeing P/E ratios <em>way above</em> the historical average. Just some examples from this morning:</p>\n\n<p>AAPL: 36.42</p>\n\n<p>GOOG: 37.20</p>\n\n<p>MSFT: 38.96</p>\n\n<p>WMT: 29.06</p>\n\n<p>JNJ: 28.99</p>\n\n<p>AMZN: 81.51 ?!!</p>\n\n<p>TSLA: 1,158.65 ??!!?!</p>\n\n<p>I get that the highest values here are tech, which may have a strong expectation to keep growing, but Tesla with a P/E ratio in the thousands? Is this normal? Is this the result of massive money printing going straight to Wall Street and inflated stock prices relative to consumer goods (and thus relative to earnings)? What is going on? Thanks in advance.</p>\n</div><!-- SC_ON -->",
  "score": 57,
  "permalink": "/r/stocks/comments/mznq3x/what_is_going_on_with_stock_valuation_right_now/",
  "subreddit": "stocks",
  "id": "mznq3x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776216009
}