{
  "author": "AutoModerator",
  "the_new_excerpt": "Good morning investors & traders! Our Schedule will be:\n\n * 7am to 10am - Discuss Common Stocks\n * 10am to 1pm - Discuss Overlooked Stocks (automod will remove meme stocks if\n   mentioned)\n * 1pm and onward - The usual Daily Discussion & themed post\n\nWe're going to make this text shorter soon but…",
  "original_created_utc": 1613563224,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "投资者和交易员早上好! 我们的日程安排是： * 上午7时至10时 - 讨论常见的股票\n\n * 上午7点至10点，讨论常见股票。\n * 上午10点至下午1点--讨论被忽视的股票（如果自动控制，将删除记忆股）。\n   (提及)\n * 下午1点及以后 -- -- 通常的每日讨论和主题帖。\n\n我们很快就会把这段文字变短，但是...",
      "title": "r/Stocks讨论普通股票周三--2021年2月17日。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "投資者和交易員早上好! 我們的日程安排是： * 上午7時至10時 - 討論常見的股票\n\n * 上午7點至10點，討論常見股票。\n * 上午10點至下午1點--討論被忽視的股票（如果自動控制，將刪除記憶股）。\n   (提及)\n * 下午1點及以後 -- -- 通常的每日討論和主題帖。\n\n我們很快就會把這段文字變短，但是...",
      "title": "r/Stocks討論普通股票週三--2021年2月17日。"
    }
  ],
  "title": "r/Stocks Discuss Common Stocks Wednesday - Feb 17, 2021",
  "created_utc": 1613581123,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Good morning investors &amp; traders!  Our Schedule will be:</p>\n\n<ul>\n<li>7am to 10am - Discuss Common Stocks</li>\n<li>10am to 1pm - Discuss Overlooked Stocks (automod will remove meme stocks if mentioned)</li>\n<li>1pm and onward - The usual Daily Discussion &amp; themed post</li>\n</ul>\n\n<p><strong>We&#39;re going to make this text shorter soon</strong> but for now please read the following from our mod <a href=\"/u/TCGYT\">u/TCGYT</a>:</p>\n\n<hr/>\n\n<p>Over the past few weeks, <a href=\"/r/stocks\">/r/stocks</a> has been inundated by posts about meme stocks.  These stocks, at certain times, offer/offered traders an opportunity to make quick gains far beyond the norm of normal investing.  When they take off, it can be tempting to wish to join the crowd – after all, nobody wants to be the one that sees their friend make 200% gains off of a company while your money “dithers” away in safe index funds or large established companies.  However, given recent events, it is important to note the risks of buying such stocks – while some make off with a great deal of money, others destroy their portfolios in ways that can take years to recover from, setting them back greatly.  Money is important in our society, and the allure of something that will get you rich quick – or the possibility that gains from such stocks can quickly change your life – can be incredibly enticing.  <strong>Sometimes however, by the time you see the posts on here or other finance subreddits it is too late and the potential to lose money very real.</strong></p>\n\n<p>Identifying what qualifies as a meme stock can be difficult.  In a way, all of us probably know one when we see one.  Let’s put it this way:  If you see a stock that is constantly being posted on reddit, twitter, or stocktwits, etc. without any true due diligence, and/or with questionable financials, then buying could put you at risk of financial setback.  Even if there is a solid investment thesis, seeing gains of over 100% in mere days or weeks is not normal market behavior, and could signal a correction is imminent on that security, that it has become a meme.</p>\n\n<p>Meme stocks often come from some real catalyst – for example having Ryan Cohen join the GameStop board, or the Tilray merger – but quickly spiral out of control, becoming viral sensations in their own right that create risks for those that partake.</p>\n\n<p>One of the problems with meme stocks is they will often come with manipulators and promoters who have a financial interest in you buying the stock, further bolstering their position.  When you read a post about a security, try to envision if the poster has a financial reason for what they are saying.  If they are linking to an outside website, or an app, or a YouTube channel, it is possible they are attempting to pump the security without merit for their own financial gain, or that their true interest lies not in the stock but in gaining you as a viewer/customer.  They may post something about a meme stock that appears on face value to be relevant news, but when you explore further contains links to their personal platforms.</p>\n\n<p>Naturally, this isn’t always the case. But at all times, especially when considering meme stocks, it is important to be aware and ask yourself about the goals of the poster.</p>\n\n<p>Manipulation is especially possible on penny stocks, those that normally trade under 5 dollars or with a market cap of under 300M. Given the sheer number of readers on these subreddits, forums like reddit or twitter can have an impact on the price of the stock in question. This is why we have long opted to ban discussions of penny stocks and <a href=\"https://www.reddit.com/r/stocks/wiki/pennystocks\">raised the bar with our rule 7 criteria</a> – the risk of manipulation is too great.</p>\n\n<p>Everyone has the right to invest or trade how they see fit.  However, when attempting to pick a stock to buy there are certain considerations you can entertain to avoid the potential pitfalls of meme stocks.  Reading the SEC 10K or 10Q filings from a company can be a good place to start, as well as exploring the companies financials on sites like Yahoo Finance.  If you read DD from someone on reddit, consider whether you think they have given a full view of the company, or if they are merely cheerleading without looking at things like moats, competitors or possible downsides.  The devil is always in the details.</p>\n\n<p>Forums like this can be powerful resources in doing ones research and crowdsourcing views on a stock, that may teach you new things about companies.  When things blow up to memes however, tread carefully.  There may be people who bought at a higher level trying to convince others to join the fray, or those who take advantage of the popularity to push their own platforms.  Choosing good stocks isn’t easy – if it were, we would all be millionaires.  Meme stocks are not always bad short-term plays.  But they carry with them greater risk of loss and manipulation that should be considered before any purchase order is made.</p>\n</div><!-- SC_ON -->",
  "score": 50,
  "permalink": "/r/stocks/comments/llsxyu/rstocks_discuss_common_stocks_wednesday_feb_17/",
  "subreddit": "stocks",
  "id": "llsxyu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728625102
}