{
  "author": "EasyPete58",
  "original_created_utc": 1629751758,
  "title": "What Is The Worst Financial Advise You Have Ever Gotten?",
  "created_utc": 1629776555,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Title already says it. And I don&#39;t just mean from this sub but in general.\nFor me it was from my family. I come from a middle class family nothing special both parents working and we got along good. \nWhen I got interested in stocks and also crypto (I was 16 at the time) they just told me that &quot;trading was for rich and criminal people only&quot; and that if I wanted to make money I have to go to university and study since everything banking related was &quot;evil&quot;. Now, 5 years later I finished at my University, sit in debt and wonder what would have been if I had just invested and not listened to their advise. </p>\n\n<p>Anyone got any similar stories? Share em so I feel better.</p>\n</div><!-- SC_ON -->",
  "score": 160,
  "permalink": "/r/CryptoCurrency/comments/pa8j08/what_is_the_worst_financial_advise_you_have_ever/",
  "subreddit": "CryptoCurrency",
  "id": "pa8j08",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Title already says it. And I don't just mean from this sub but in general. For\nme it was from my family. I come from a middle class family nothing special both\nparents working and we got along good. When I got interested in stocks and also\ncrypto (I was 16 at the time) they just told me that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルからしてそうですよね。また、このサブからだけではなく、一般的な意味でもあります。私の場合は\n私の場合は、家族からでした。私は中流階級の家庭に生まれ、特別なことはありません。\n両親は働いていて仲が良かったのですが 私が株や暗号に興味を持ったのは\n株や暗号に興味を持ったとき（当時16歳）、彼らは私に「...",
      "title": "今までに受けた最悪の金融アドバイスは何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "标题已经说明了这一点。我不只是指这个子，而是指一般情况下。对我来说\n我是来自我的家庭。我来自一个中产阶级家庭，没有什么特别之处。\n父母都在工作，我们相处得很好。当我开始对股票和\n他们只是告诉我，...",
      "title": "你得到过的最糟糕的财务建议是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "標題已經說明了這一點。我不只是指這個子，而是指一般情況下。對我來說\n我是來自我的家庭。我來自一箇中產階級家庭，沒有什麼特別之處。\n父母都在工作，我們相處得很好。當我開始對股票和\n他們只是告訴我，...",
      "title": "你得到過的最糟糕的財務建議是什麼？"
    }
  ]
}