{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "SoFi has been a very popular retail stock and I underestimated the amount of information that was available for it. It took me quite some time to differentiate what is important and what isn't and this post is a summary of my findings and it includes valuation at the very end.\n\n**What is SoFi?**\n\nSoFi is a Fintech company that aspires to be a one-stop-shop for financial services, that allows members to borrow, save, spend, invest and protect their money.\n\nNow, the main question is, well, **how is this different than a bank?** The management provides 4 differentiation points:\n\n1. Speed - being faster than the competitors when it comes to approval of loans, opening accounts, buying/selling stock through their platform, payments, etc. - In my opinion, although this industry has been around for hundreds of years, there's no doubt that certain parts of it have to be disrupted. However, my question is, assuming this is an advantage that SoFi has, is it sustainable for the next 5, 10, or 15 years? I don't think so.\n\n2. Selection of products - More products related to borrowing, saving, investing, and protecting money. I personally don't buy this differentiation point. I do believe cost-cutting is possible, but coming up with something new and innovative that's significantly different than the current offerings, I doubt it.\n\n3. Content - Financial education, research, insights - Even if SoFi has a platform that offers more financial education and research, this is something that is easily replicable. I don't see this as a huge long-term advantage.\n\n4. Convenience - Instead of having opening times between 9 and 5 from Monday to Friday, they want to offer the services 24/7. The company has an only online presence so they can cut some costs as they don't have to lease buildings for this purpose.\n\n&amp;#x200B;\n\n**The 3 segments**\n\nThe company has 3 segments and it is worth spending time understanding each one:\n\n1. The lending segment - self-explanatory - accounts for 75% of the total revenue\n2. The technology segment - which is related to Galileo - accounts for 19% of the total revenue\n3. The financial services segment - is related to all the products such as debit/credit cards, budgeting tools, investing, etc. - accounts for 6% of the total revenue\n\nAll 3 sectors have been growing fast, but we need more information to understand the second one.\n\nThe technology segment is related to an acquisition the company made back in 2020 (Galileo) and the purchase price was roughly $1.2b. At the time, that was almost 15% of the company's market cap. What SoFi got from the acquisition was a payment processing platform that uses AI for fraud detection, which is more efficient than the industry average. On top of that, it has an API that allows for app development. The revenue for SoFi will come in the form of platform fees and program management fees. This is one of their big bets and the management refers to this segment as the AWS of Fintech. The same way a business can be started on Amazon within a day, well, that's what they're aiming for, except for companies in the financial industry.\n\n&amp;#x200B;\n\n**The growth story, the metrics, and the confusion**\n\nThe company provides two key metrics for its growth in its annual report.\n\n1. The # of users - This has significantly grown from 1m back in 2019, to almost 2m in 2020 to almost 3.5m in 2021. However, it is worth mentioning that every one that is registered on the platform is a member and remains one unless the terms of service are violated. So, if there's an inactive member for 3 years, it doesn't matter, that person will be considered a member. However, what I'm missing here is the revenue per user. Having users is good, but if they're not being monetized, the metric is useless.\n2. The # of products - If the first metric is not that useful, maybe this one serves a better job. If you as a member have a personal loan, well, that's one product. If you have a credit card, that's another one. If you are using their platform to invest, that's another one. The idea of the company to build a good relationship with its members and sell many of its products is great. Well, the number of products reported in 2021 was 5m. That translates to roughly 1.5 products per person. It did increase from 1.21 in 2019, but it isn't that impressive (yet). Although it sounds as if this could be a great metric, well, there's another trap here, not every product has the same value. 1m of these 5m products are related to the lending segment, which as mentioned above, accounts for 75% of the total revenue! The remaining 4m products bring in only 6% of the revenue as they're related to the financial services.\n\nSo, we have metrics that are not that reliable. What's next?\n\n&amp;#x200B;\n\n**The company's performance and what can we expect?**\n\nIf we look at the company's performance, it is a money-losing company with a negative net margin of -48% for 2021 on its roughly $1b in revenue.\n\nA **mature** company in this industry has:\n\n\\- a net margin that's between 10-15% \n\n\\- high leverage (debt on the balance sheet being over 80% of the total passive)\n\n\\- RoE around 16%\n\nCurrently, the debt is around 50% of the balance sheet, so there's still a lot of room to grow.\n\nThese numbers should serve as a sanity check later on for my valuation as if I forecast anything that's significantly above that, it might be unreasonable.\n\n&amp;#x200B;\n\n**What's next?**\n\nThe company made one large acquisition (Galileo) in 2020 for $1.2b. At the beginning of 2022, they announced the large acquisition of Technisys for $1.1b, which is a company that will serve as their core banking system. Both of these acquired companies have some presence in LATAM, so SoFi is acquiring new companies that have a presence in other geographical regions as well.\n\nThe analysts forecast about 50% revenue growth in 2022, followed by 41% revenue growth in 2023. Great growth, but slightly declining. At the same time, the net margin is expected to improve, from -48% in 2021, to :\n\n\\-21% in 2022\n\n\\-6% in 2023\n\n\\+5% in 2024\n\n&amp;#x200B;\n\n**The risks**\n\nDue to the actions being taken, there are two large risks that I see:\n\n1. **Execution** risk - Their big bet (The technology segment), currently accounts for less than 20% of the revenue and hasn't yet proven as successful.\n2. **Integration** risk - Combining SoFi with Galileo and Technisys might sound great and there's always the amazing word synergy being used, but that's yet to be seen in the financials. There's an integration risk here that needs to be addressed.\n\n&amp;#x200B;\n\n**The valuation**\n\nTaking into account all the information above, I used a DCF model to estimate the company's value.\n\n**Revenue growth** \\- 898% in the next 10 years (following analysts' estimates for the next 2 years, then slowly declining). From $1b in 2020 to $10b in 2030.\n\n**Net margin** \\- From -48% in 2021 to 13.5% in 2030 - Close to industry average\n\n**Discount rate** \\- 12.8% (Based on cost of equity)\n\n**RoE** \\- Based on the assumptions above and the development of equity, the RoE is roughly 15%, which is close to the industry's average.\n\n&amp;#x200B;\n\nPutting all the numbers together, and adjusting for the equity options and the preferred shares, the value of the company is **$8.8b** (almost $8/share). The current market cap is $6.5b.\n\nIt is worth mentioning that at the moment, I am looking at SoFi as a company that's not significantly different than the current ones in this industry.  I am aware that I could be significantly wrong in my assumptions and if I see a better performance from their technology segment, my storyline would significantly change.\n\nI'd like to get your view on the company and I am sure there are plenty of pieces in this puzzle that I have to learn more about.",
  "author_fullname": "t2_5406jb4v",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "SoFi company analysis and valuation - Big story and many risks ($SOFI)",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": "",
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_u02410",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.85,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 46,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Company Analysis",
  "can_mod_post": false,
  "score": 46,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1649537792,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;SoFi has been a very popular retail stock and I underestimated the amount of information that was available for it. It took me quite some time to differentiate what is important and what isn&amp;#39;t and this post is a summary of my findings and it includes valuation at the very end.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;What is SoFi?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;SoFi is a Fintech company that aspires to be a one-stop-shop for financial services, that allows members to borrow, save, spend, invest and protect their money.&lt;/p&gt;\n\n&lt;p&gt;Now, the main question is, well, &lt;strong&gt;how is this different than a bank?&lt;/strong&gt; The management provides 4 differentiation points:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Speed - being faster than the competitors when it comes to approval of loans, opening accounts, buying/selling stock through their platform, payments, etc. - In my opinion, although this industry has been around for hundreds of years, there&amp;#39;s no doubt that certain parts of it have to be disrupted. However, my question is, assuming this is an advantage that SoFi has, is it sustainable for the next 5, 10, or 15 years? I don&amp;#39;t think so.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Selection of products - More products related to borrowing, saving, investing, and protecting money. I personally don&amp;#39;t buy this differentiation point. I do believe cost-cutting is possible, but coming up with something new and innovative that&amp;#39;s significantly different than the current offerings, I doubt it.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Content - Financial education, research, insights - Even if SoFi has a platform that offers more financial education and research, this is something that is easily replicable. I don&amp;#39;t see this as a huge long-term advantage.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Convenience - Instead of having opening times between 9 and 5 from Monday to Friday, they want to offer the services 24/7. The company has an only online presence so they can cut some costs as they don&amp;#39;t have to lease buildings for this purpose.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The 3 segments&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;The company has 3 segments and it is worth spending time understanding each one:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;The lending segment - self-explanatory - accounts for 75% of the total revenue&lt;/li&gt;\n&lt;li&gt;The technology segment - which is related to Galileo - accounts for 19% of the total revenue&lt;/li&gt;\n&lt;li&gt;The financial services segment - is related to all the products such as debit/credit cards, budgeting tools, investing, etc. - accounts for 6% of the total revenue&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;All 3 sectors have been growing fast, but we need more information to understand the second one.&lt;/p&gt;\n\n&lt;p&gt;The technology segment is related to an acquisition the company made back in 2020 (Galileo) and the purchase price was roughly $1.2b. At the time, that was almost 15% of the company&amp;#39;s market cap. What SoFi got from the acquisition was a payment processing platform that uses AI for fraud detection, which is more efficient than the industry average. On top of that, it has an API that allows for app development. The revenue for SoFi will come in the form of platform fees and program management fees. This is one of their big bets and the management refers to this segment as the AWS of Fintech. The same way a business can be started on Amazon within a day, well, that&amp;#39;s what they&amp;#39;re aiming for, except for companies in the financial industry.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The growth story, the metrics, and the confusion&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;The company provides two key metrics for its growth in its annual report.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;The # of users - This has significantly grown from 1m back in 2019, to almost 2m in 2020 to almost 3.5m in 2021. However, it is worth mentioning that every one that is registered on the platform is a member and remains one unless the terms of service are violated. So, if there&amp;#39;s an inactive member for 3 years, it doesn&amp;#39;t matter, that person will be considered a member. However, what I&amp;#39;m missing here is the revenue per user. Having users is good, but if they&amp;#39;re not being monetized, the metric is useless.&lt;/li&gt;\n&lt;li&gt;The # of products - If the first metric is not that useful, maybe this one serves a better job. If you as a member have a personal loan, well, that&amp;#39;s one product. If you have a credit card, that&amp;#39;s another one. If you are using their platform to invest, that&amp;#39;s another one. The idea of the company to build a good relationship with its members and sell many of its products is great. Well, the number of products reported in 2021 was 5m. That translates to roughly 1.5 products per person. It did increase from 1.21 in 2019, but it isn&amp;#39;t that impressive (yet). Although it sounds as if this could be a great metric, well, there&amp;#39;s another trap here, not every product has the same value. 1m of these 5m products are related to the lending segment, which as mentioned above, accounts for 75% of the total revenue! The remaining 4m products bring in only 6% of the revenue as they&amp;#39;re related to the financial services.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;So, we have metrics that are not that reliable. What&amp;#39;s next?&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The company&amp;#39;s performance and what can we expect?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;If we look at the company&amp;#39;s performance, it is a money-losing company with a negative net margin of -48% for 2021 on its roughly $1b in revenue.&lt;/p&gt;\n\n&lt;p&gt;A &lt;strong&gt;mature&lt;/strong&gt; company in this industry has:&lt;/p&gt;\n\n&lt;p&gt;- a net margin that&amp;#39;s between 10-15% &lt;/p&gt;\n\n&lt;p&gt;- high leverage (debt on the balance sheet being over 80% of the total passive)&lt;/p&gt;\n\n&lt;p&gt;- RoE around 16%&lt;/p&gt;\n\n&lt;p&gt;Currently, the debt is around 50% of the balance sheet, so there&amp;#39;s still a lot of room to grow.&lt;/p&gt;\n\n&lt;p&gt;These numbers should serve as a sanity check later on for my valuation as if I forecast anything that&amp;#39;s significantly above that, it might be unreasonable.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;What&amp;#39;s next?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;The company made one large acquisition (Galileo) in 2020 for $1.2b. At the beginning of 2022, they announced the large acquisition of Technisys for $1.1b, which is a company that will serve as their core banking system. Both of these acquired companies have some presence in LATAM, so SoFi is acquiring new companies that have a presence in other geographical regions as well.&lt;/p&gt;\n\n&lt;p&gt;The analysts forecast about 50% revenue growth in 2022, followed by 41% revenue growth in 2023. Great growth, but slightly declining. At the same time, the net margin is expected to improve, from -48% in 2021, to :&lt;/p&gt;\n\n&lt;p&gt;-21% in 2022&lt;/p&gt;\n\n&lt;p&gt;-6% in 2023&lt;/p&gt;\n\n&lt;p&gt;+5% in 2024&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The risks&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Due to the actions being taken, there are two large risks that I see:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;strong&gt;Execution&lt;/strong&gt; risk - Their big bet (The technology segment), currently accounts for less than 20% of the revenue and hasn&amp;#39;t yet proven as successful.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Integration&lt;/strong&gt; risk - Combining SoFi with Galileo and Technisys might sound great and there&amp;#39;s always the amazing word synergy being used, but that&amp;#39;s yet to be seen in the financials. There&amp;#39;s an integration risk here that needs to be addressed.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The valuation&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Taking into account all the information above, I used a DCF model to estimate the company&amp;#39;s value.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Revenue growth&lt;/strong&gt; - 898% in the next 10 years (following analysts&amp;#39; estimates for the next 2 years, then slowly declining). From $1b in 2020 to $10b in 2030.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Net margin&lt;/strong&gt; - From -48% in 2021 to 13.5% in 2030 - Close to industry average&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Discount rate&lt;/strong&gt; - 12.8% (Based on cost of equity)&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;RoE&lt;/strong&gt; - Based on the assumptions above and the development of equity, the RoE is roughly 15%, which is close to the industry&amp;#39;s average.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Putting all the numbers together, and adjusting for the equity options and the preferred shares, the value of the company is &lt;strong&gt;$8.8b&lt;/strong&gt; (almost $8/share). The current market cap is $6.5b.&lt;/p&gt;\n\n&lt;p&gt;It is worth mentioning that at the moment, I am looking at SoFi as a company that&amp;#39;s not significantly different than the current ones in this industry.  I am aware that I could be significantly wrong in my assumptions and if I see a better performance from their technology segment, my storyline would significantly change.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d like to get your view on the company and I am sure there are plenty of pieces in this puzzle that I have to learn more about.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "1235582c-6848-11eb-96e8-0e132357f477",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#d6890a",
  "id": "u02410",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "k_ristovski",
  "discussion_type": null,
  "num_comments": 37,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/u02410/sofi_company_analysis_and_valuation_big_story_and/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/u02410/sofi_company_analysis_and_valuation_big_story_and/",
  "subreddit_subscribers": 3871549,
  "created_utc": 1649555772,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1649537792,
  "the_new_excerpt": "SoFi has been a very popular retail stock and I underestimated the amount of\ninformation that was available for it. It took me quite some time to\ndifferentiate what is important and what isn't and this post is a summary of my\nfindings and it includes valuation at the very end.\n\nWhat is SoFi?\n\nSoFi…"
}