{
  "author": "just_lick_my_ass",
  "the_new_excerpt": "This stock has been bleeding every day it seems. Worst of all, the past month\nthat QQQ was pushing ATH, it still bled. Now when the market is red, it falls\neven harder than the market. So basically, red on green and flat days, deeper\nred on red days. This stock is the biggest mistake I’ve made, and…",
  "original_created_utc": 1618964634,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この株は、毎日出血しているようだ。最悪なのは、この1ヶ月間\nQQQがATHを押していたこの1ヶ月間、まだ出血していました。今、市場が赤になると、この株は市場よりも\n市場が赤ければ、市場よりもさらに激しく下落します。つまり、基本的には、緑の日と横ばいの日には赤、赤の日にはより深く\n赤の日にはより深い赤になります。この株は私が犯した最大の失敗であり、...",
      "title": "BBより悪い銘柄は考えられない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这只股票似乎每天都在流血。最糟糕的是，在过去的一个月里\nQQQ在推动ATH，它仍然在流血。现在，当市场出现红色时，它的下跌\n甚至比市场更难。所以基本上，在绿色和平坦的日子里是红色的，在红色的日子里是更深的\n红色的日子里红色更深。这只股票是我犯的最大错误，而且...",
      "title": "我想不出有什么比BB更糟糕的股票了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這隻股票似乎每天都在流血。最糟糕的是，在過去的一個月裏\nQQQ在推動ATH，它仍然在流血。現在，當市場出現紅色時，它的下跌\n甚至比市場更難。所以基本上，在綠色和平坦的日子裏是紅色的，在紅色的日子裏是更深的\n紅色的日子裏紅色更深。這隻股票是我犯的最大錯誤，而且...",
      "title": "我想不出有什麼比BB更糟糕的股票了"
    }
  ],
  "title": "I can’t think of a worse stock than BB",
  "created_utc": 1618981257,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This stock has been bleeding every day it seems. Worst of all, the past month that QQQ was pushing ATH, it still bled. Now when the market is red, it falls even harder than the market. So basically, red on green and flat days, deeper red on red days. This stock is the biggest mistake I’ve made, and I’ve made plenty. </p>\n\n<p>I get it— “there’s no revenue.” I don’t see why that rule seems to only apply to BB. There are plenty of companies with low revenue that are overvalued; why can’t BB be that way? </p>\n\n<p>You would think that AMZN partnership only would carry some weight. But no, it keeps sinking. </p>\n\n<p>Position: 5,450 shares @ $11.77</p>\n</div><!-- SC_ON -->",
  "score": 213,
  "permalink": "/r/stocks/comments/mv4axq/i_cant_think_of_a_worse_stock_than_bb/",
  "subreddit": "stocks",
  "id": "mv4axq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171527442
}