{
  "author": "100problemss",
  "original_created_utc": 1630003200,
  "title": "This Subs Top 10 Most Loved Crypto",
  "created_utc": 1630028501,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve been on this sub for a bit and saw a lot of love to specific coins. So here we are, let’s do the top 10 most loved coins on <a href=\"/r/cryptocurrency\">r/cryptocurrency</a> </p>\n\n<ol>\n<li>Moons - Anything that’s free and has value will always be at the top. Redditors farm this token more than they work at their actual jobs.<br/></li>\n<li>ETH - Ethereum has always been a crowd favorite here, but it’s taken a seat to Moon’s hot streak.<br/></li>\n<li>ADA - With the recent news and pumps, ADA finds itself in the top three. If you want to argue this ranking, be prepared for downvotes to be ADA on your karma.<br/>\n\n<ol>\n<li>Bitcoin - Has always been at the top, but lately it’s getting a bit boring. Bitcoin is like the old guy at pickleball, he may not look good but he hits his spots every time.<br/></li>\n</ol></li>\n<li>ALGO - Tokenomics suck on this gem but this sub don’t care. Algo has been a favorite for years.<br/></li>\n<li>VET - Vet has been a staple in many a portfolio. And it’s actually being used in real world applications.<br/></li>\n<li>Tezos - Mentioned often as a go to for holding and staking. Tezos has been a hit for fellow crypto traders.<br/></li>\n<li>Polygon - Anything that helps Ethereum is an autoMATIC interest for all on this forum.<br/></li>\n<li>Solana - After a huge pump, redditors love this token because when you receive money, you give love.<br/></li>\n<li>ERG - The fastest riser, it’s market cap is 122nd but people are jumping on board like silver carp in a disturbed river.<br/></li>\n</ol>\n\n<p>Let me know if I missed out on any. Hope this helped newbs know what this sub pumps.</p>\n\n<p>Edit: Due to popular demand, moons move up to numero uno. And ethereum and ADA swap.</p>\n</div><!-- SC_ON -->",
  "score": 178,
  "permalink": "/r/CryptoCurrency/comments/pc5o1k/this_subs_top_10_most_loved_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "pc5o1k",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’ve been on this sub for a bit and saw a lot of love to specific coins. So here\nwe are, let’s do the top 10 most loved coins on r/cryptocurrency\n[/r/cryptocurrency]\n\n 1. Moons - Anything that’s free and has value will always be at the top.\n    Redditors farm this token more than they work at their…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はこのサブを少し見ていて、特定のコインへの愛をたくさん見ました。そこで\nr/cryptocurrencyで最も愛されているコイントップ10をやってみましょう。\n[/r/cryptocurrency]\n\n 1. ムーン - 無料で価値があるものは常にトップになります。\n    Redditersはこのトークンを自分が働く以上にファームしています。",
      "title": "This Subs Top 10 Most Loved Crypto"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在这个子上呆了一段时间，看到很多对特定硬币的爱。所以在这里\n我们来做一下r/cryptocurrency上最受欢迎的10个币的评选\n[/r/cryptocurrency]\n\n 1. 月球--任何免费且有价值的东西都会排在首位。\n    Redditors耕种这种代币比他们在其...",
      "title": "本子十大最受喜爱的加密货币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在這個子上呆了一段時間，看到很多對特定硬幣的愛。所以在這裏\n我們來做一下r/cryptocurrency上最受歡迎的10個幣的評選\n[/r/cryptocurrency]\n\n 1. 月球--任何免費且有價值的東西都會排在首位。\n    Redditors耕種這種代幣比他們在其...",
      "title": "本子十大最受喜愛的加密貨幣"
    }
  ]
}