{
  "author": "Hospitalities",
  "original_created_utc": 1626363064,
  "title": "Anyone else tired of reading every title here with \"Does Anyone Else\" or Am I The Only One?",
  "created_utc": 1626370547,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>7/9 of the top posts right now are just &quot;does anyone else&quot; titles. It&#39;s lazy, it&#39;s boring to read and the answer is almost unequivocally &quot;NO, you&#39;re not the only one.&quot;</p>\n\n<p>Starting today, these statements in titles are blanket banned. This doesn&#39;t mean that your question is not welcome, it simply means you&#39;ll need to put a little more effort into your title to post it here. If that sounds like too much work, there are better communities for such titles (<a href=\"/r/DoesAnybodyElse\">/r/DoesAnybodyElse</a>)</p>\n\n<p>All current posts at the time of this uploading will be grandfathered in for the old (lack-of) restrictions. Going forward, we hope this&#39;ll create more diversity in titles and better communication of what exactly the OP of these threads wants to discuss/ask.</p>\n\n<p>Thanks.</p>\n</div><!-- SC_ON -->",
  "score": 167,
  "permalink": "/r/TooAfraidToAsk/comments/okv7m9/anyone_else_tired_of_reading_every_title_here/",
  "subreddit": "TooAfraidToAsk",
  "id": "okv7m9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "7/9 of the top posts right now are just \"does anyone else\" titles. It's lazy,\nit's boring to read and the answer is almost unequivocally \"NO, you're not the\nonly one.\"\n\nStarting today, these statements in titles are blanket banned. This doesn't mean\nthat your question is not welcome, it simply means…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今のトップ記事の7/9は「誰かいないか」というタイトルばかりです。怠慢です。\n怠慢だし、読んでいて退屈だし、答えはほとんど明確に \"NO, you're not the only one\n\"NO, you're not a only one.\" です。\n\n今日からこのようなタイトルの発言は全面的に禁止します。これは、あなたの質問を歓迎しないという意味ではありません。\nあなたの質問が歓迎されないということではなく、単に...",
      "title": "ここのすべてのタイトルを「Does Anyone Else」や「Am I The Only One」で読むのに疲れた人はいませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "现在有7/9的热门帖子只是 \"是否有其他人 \"的标题。这是很懒的。\n而且答案几乎是明确的：\"不，你不是唯一的。\n唯一的一个。\"\n\n从今天开始，这些标题中的陈述被全面禁止。这并不意味着\n你的问题不受欢迎，这只是意味着...",
      "title": "有没有人厌倦了在这里读到的每一个标题都是 \"有没有人 \"或 \"我是唯一\"？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "現在有7/9的熱門帖子只是 \"是否有其他人 \"的標題。這是很懶的。\n而且答案几乎是明確的：\"不，你不是唯一的。\n唯一的一個。\"\n\n從今天開始，這些標題中的陳述被全面禁止。這並不意味着\n你的問題不受歡迎，這只是意味着...",
      "title": "有沒有人厭倦了在這裏讀到的每一個標題都是 \"有沒有人 \"或 \"我是唯一\"？"
    }
  ]
}