{
  "author": "ilikelucy1",
  "the_new_excerpt": "VIAC is massively undervalued following a hedge fund selloff and even after an\namazing earnings report.\n\nAs of right now, VIAC has a PE ratio of about 10.5, in a market where all of its\ncompetitors in the industry have an average of 44. VIAC's quarterly report just\ncame in today, and earning were…",
  "original_created_utc": 1620320311,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "VIACは、ヘッジファンドが暴落した後も、また、米国での投資を終えた後も、大幅に過小評価されています。\n驚くべき収益報告の後でさえ、大幅に過小評価されています。\n\n現在のところ、VIACのPEレシオは約10.5で、業界のすべての競合他社の平均的なPEレシオは10.5です。\n現在、VIACのPEレシオは約10.5で、業界の競合他社の平均は44です。VIACの四半期報告書は本日\n本日発表されたVIACの四半期報告書では、収益は...",
      "title": "VIACは過大評価された市場の中で非常に過小評価されており、ちょうど素晴らしい業績報告があった。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在对冲基金抛售之后，VIAC的价值被严重低估，甚至在一份惊人的收益报告之后也是如此。\n惊人的收益报告。\n\n截至目前，VIAC的市盈率约为10.5，而在这个市场上，其所有竞争对手的平均市盈率为44。\n竞争对手的平均市盈率为44。VIAC的季度报告今天刚刚发布\n今天的季度报告，收入是...",
      "title": "在一个被高估的市场中，VIAC的价值被严重低估，而且刚刚发布了一份惊人的收益报告。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在對沖基金拋售之後，VIAC的價值被嚴重低估，甚至在一份驚人的收益報告之後也是如此。\n驚人的收益報告。\n\n截至目前，VIAC的市盈率約爲10.5，而在這個市場上，其所有競爭對手的平均市盈率爲44。\n競爭對手的平均市盈率爲44。VIAC的季度報告今天剛剛發佈\n今天的季度報告，收入是...",
      "title": "在一個被高估的市場中，VIAC的價值被嚴重低估，而且剛剛發佈了一份驚人的收益報告。"
    }
  ],
  "title": "VIAC is very undervalued in an overvalued market and just had an amazing earnings report",
  "created_utc": 1620354759,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>VIAC is massively undervalued following a hedge fund selloff and even after an amazing earnings report. </p>\n\n<p>As of right now, VIAC has a PE ratio of about 10.5, in a market where all of its competitors in the industry have an average of 44. VIAC&#39;s quarterly report just came in today, and earning were beat by a huge 25%. Professional analysts projected and EPS of $1.22, and in their earnings report this morning, VIAC brought in a non-GAAP EPS of $1.52, and a GAAP EPS of $1.42, beating the professional estimates by a lot. It&#39;s not just this quarter, VIAC has beat every earnings estimate in the last year. The earnings were driven mostly by their fairly new streaming service, Paramount+, which had a growth of a nice 69% since last year. More and more people are starting to recognize and buy their Paramount+ subscription. Many of the shows they have are geared towards children (or the man childs like me still watching them) such a Spongebob and Avatar, as well as sports, many shows from comedy central, and others. I can honestly see Paramount+ becoming a pretty major competitor with Netflix, Disney+, and Hulu in the future, the rates at which their subs are growing is pretty impressive.\nVIAC also has a decent dividend payout of 2.4% and it should be coming soon following the earnings report, but I do not know the exact date. They are also undervalued based on their price to book ratio, which is 1.6 compared to the industry average of 2.1.</p>\n\n<p>The most amazing part of VIAC is that the value of VIAC&#39;s assets is worth less than the market cap of the company, meaning that if VIAC sold all the assets they own right now and liquidated the company, it would worth more than the stock value of the company itself. VIAC currently has a market cap of $24 billion, and their assets alone dwarf the market cap. Their long term assets alone are worth $39 billion, they have another $7 billion in receivables, and an additional $3.6 billion in physical assets, plus $3 billion o liquid cash on hand right now, which adds up to a total of $52 billion in assets, yet the market cap of VIAC is less that half of that. The one off thing that takes this down is VIAC&#39;s $19 billion debt, but  VIAC&#39;s value of assets-liabilities ($52B-$19B) brings it to around $33 billion, which makes it 28% undervalued based on assets alone.</p>\n\n<p>The only reason VIAC is as low as it is right now is because of the massive hedge fund selloff from Archegos, which single handedly drove the share price down from $100 to $40. Knowing the selloff is coming, many investors took short positions on the company, some still are, but in the last month, the short interest on VIAC has dropped almost 40%. Even the shorts know it&#39;s undervalued and they&#39;re all exiting their positions. VIAC is having the fire sale of a lifetime, in a time where the majority of other stocks are overvalued. My price target for VIAC is $60 short term, and I can see it going back up to $100 by the end of the year. Positions: 20 shares @$41 each</p>\n\n<p>TL;DR: VIAC is on sale and massively undervalued, and dropped so much because of  large hedge fund selloff. Huge growth of earning from streaming service Paramount+, and subscribers are only growing, and debt is dropping.</p>\n</div><!-- SC_ON -->",
  "score": 50,
  "permalink": "/r/stocks/comments/n6byd0/viac_is_very_undervalued_in_an_overvalued_market/",
  "subreddit": "stocks",
  "id": "n6byd0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985995610
}