{
  "author": "PM_something_German",
  "original_created_utc": 1630515983,
  "title": "How is beastiality generally considered bad but eating meat okay? The latter seems to be definitely more harmful to animals. Does ethics have an answer?",
  "created_utc": 1630554273,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Saw this question in a Big Joel YouTube video the other day. (<a href=\"https://youtu.be/DGwiyyZhNpM\">https://youtu.be/DGwiyyZhNpM</a>) The uploader says that beastiality is bad because the person draws pleasure out of the pain of the animal, while for the meat eater it&#39;s just a byproduct of their desire to eat.</p>\n\n<p>I think this answer is very dissatisfying because I disagree with the premise that people practicing beastiality do it for sadistic reasons, I sadly actually know that most feel genuine connections to the animal or do it because they lack other sex opportunities.</p>\n\n<p>I also think the main reason beastiality is almost universally illegal and very much looked down upon is because of religious reasons and because it&#39;s considered disgusting, rather than ethical reasons.</p>\n\n<p>I think the biggest ethical problem is obviously that animals can&#39;t give consent. But they can&#39;t consent to being killed for meat either. And the latter is more cruel. So how is one bad but the other not?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/askphilosophy/comments/pfy8j7/how_is_beastiality_generally_considered_bad_but/",
  "subreddit": "askphilosophy",
  "id": "pfy8j7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Saw this question in a Big Joel YouTube video the other day.\n(https://youtu.be/DGwiyyZhNpM) The uploader says that beastiality is bad because\nthe person draws pleasure out of the pain of the animal, while for the meat\neater it's just a byproduct of their desire to eat.\n\nI think this answer is very…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "先日、Big JoelのYouTube動画でこの質問を見ました。\n(https://youtu.be/DGwiyyZhNpM) アップロード者は、獣姦が悪いと言っています。\n動物の痛みから喜びを得るから悪いと言っていますが、肉を食べる人にとっては\n食べる人にとっては、食べたいという欲求の副産物でしかないからです。\n\nこの答えはとても...と思います。",
      "title": "一般的に獣姦はダメで、肉食はいいとされていますが？後者の方が確実に動物を傷つけているように思うのですが。倫理学的に答えはあるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "前几天在大乔尔的YouTube视频中看到这个问题。\n(https://youtu.be/DGwiyyZhNpM) 上传者说，兽行是坏的，因为\n人从动物的痛苦中获得快乐，而对于吃肉的人来说，这只是他们吃东西的欲望的副产品。\n而对于吃肉的人来说，这只是他们吃的欲望的副产品。\n\n我认为这个答案是非常...",
      "title": "为什么一般认为兽行是坏事，而吃肉却可以？后者似乎肯定对动物更有害。伦理学有答案吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "前幾天在大喬爾的YouTube視頻中看到這個問題。\n(https://youtu.be/DGwiyyZhNpM) 上傳者說，獸行是壞的，因爲\n人從動物的痛苦中獲得快樂，而對於喫肉的人來說，這只是他們喫東西的慾望的副產品。\n而對於喫肉的人來說，這只是他們喫的慾望的副產品。\n\n我認爲這個答案是非常...",
      "title": "爲什麼一般認爲獸行是壞事，而喫肉卻可以？後者似乎肯定對動物更有害。倫理學有答案嗎？"
    }
  ]
}