{
  "author": "Catfishbandit999",
  "original_created_utc": 1626702988,
  "title": "A common question on this sub asks \"who was history's Big Bad before Hitler?\" That's interesting and all, but I want to know the inverse: who was history's Good Guy before Dr. King, Ghandi, or Mother Theresa?",
  "created_utc": 1626751646,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Obviously those three are way more complex than the best parts of their legacy, but what they stood for was selflessness, freedom, equality, and nonviolence.  Who embodied those ideals up to say, the early 20th century? Jesus? St. Francis of Assissi?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/onejoj/a_common_question_on_this_sub_asks_who_was/",
  "subreddit": "AskHistorians",
  "id": "onejoj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Obviously those three are way more complex than the best parts of their legacy,\nbut what they stood for was selflessness, freedom, equality, and nonviolence.\nWho embodied those ideals up to say, the early 20th century? Jesus? St. Francis\nof Assissi?",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "明らかにこの3つは、彼らが残した遺産の最良の部分よりもはるかに複雑なものです。\nしかし、彼らが支持したのは、無私、自由、平等、非暴力でした。\n20世紀初頭までにそのような理想を体現していたのは誰でしょうか？イエス？アッシジの聖フランシス\nof Assissi？",
      "title": "このサブサイトでよくある質問は、\"ヒトラー以前の歴史上の大悪党は誰か？\"というものです。それは興味深いことですが、私はその逆を知りたいのです：キング牧師、ガンジー、マザーテレサ以前の歴史上の善人は誰ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "显然，这三个人比他们遗产中最好的部分要复杂得多。\n但他们所代表的是无私、自由、平等和非暴力。\n谁体现了这些理想，直到说，20世纪初？耶稣吗？圣弗朗西斯\n阿西西的圣弗朗西斯？",
      "title": "在这个子上有一个常见的问题问：\"在希特勒之前，谁是历史上的大坏蛋？\" 这很有趣，但我想知道相反的情况：在金博士、甘地或特蕾莎修女之前，谁是历史上的好男人？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "顯然，這三個人比他們遺產中最好的部分要複雜得多。\n但他們所代表的是無私、自由、平等和非暴力。\n誰體現了這些理想，直到說，20世紀初？耶穌嗎？聖弗朗西斯\n阿西西的聖弗朗西斯？",
      "title": "在這個子上有一個常見的問題問：\"在希特勒之前，誰是歷史上的大壞蛋？\" 這很有趣，但我想知道相反的情況：在金博士、甘地或特蕾莎修女之前，誰是歷史上的好男人？"
    }
  ]
}