{
  "author": "NewMachine001",
  "original_created_utc": 1636203161,
  "title": "Adultery changed from being one of the most serious crimes in the past to being non-prosecutable in the vast majority of nations around the world. What caused this shift?",
  "created_utc": 1636216429,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Flog the adulteress and the adulterer, each one of them, with a hundred lashes. Let no pity for them cause you to disobey God, if you truly believe in God and the Last Day; and let their punishment be witnessed by a number of believers. [Quran 24:2]</p>\n\n<p>&#x200B;</p>\n\n<p>Thou shalt not commit adultery [Exodus 20:14]</p>\n\n<p>&#x200B;</p>\n\n<ol>\n<li>If the wife of a man is caught lying with another man, they shall bind them and throw them into the water. [Hammurabi&#39;s Code] </li>\n</ol>\n\n<p>&#x200B;</p>\n\n<p>Hellenistic and Romanic jurisprudence both prescribed death for female adulterers.</p>\n\n<p>&#x200B;</p>\n\n<p>However, today, Taiwan and the Philippines are the only counties which punish adulterers. A few Islamic States are the only countries that treat it as a major crime. In Europe and the Americas, it is not a crime in a single country.</p>\n\n<p>&#x200B;</p>\n\n<p>Seeing that most of our legal culture developed around Greco-Romanic law, and the huge influence the above mentioned religions had globally, how/why did adultery change from a serious, major offense that warranted death to one which most nations do not punish, and which people are seemingly desensitized towards?</p>\n</div><!-- SC_ON -->",
  "score": 175,
  "permalink": "/r/AskHistorians/comments/qnzluv/adultery_changed_from_being_one_of_the_most/",
  "subreddit": "AskHistorians",
  "id": "qnzluv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Flog the adulteress and the adulterer, each one of them, with a hundred lashes.\nLet no pity for them cause you to disobey God, if you truly believe in God and\nthe Last Day; and let their punishment be witnessed by a number of believers.\n[Quran 24:2]\n\n\n\nThou shalt not commit adultery [Exodus…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "姦淫した女と姦淫した者を、それぞれ100回の鞭打ちで打て。\n彼らへの同情が原因で神に背くことのないように、もしあなたが本当に神を信じていて\n彼らの処罰を多くの信者に見てもらうのである。\n[コーラン24:2]\n\n\n\n姦淫してはならない【出エジプト記...",
      "title": "姦通は、過去には最も重い犯罪の一つであったが、世界の大多数の国では起訴されないものに変わった。その原因は何でしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "鞭打淫妇和奸夫，各人都要鞭打一百下。\n如果你们真的相信真主和末日，就不要因为怜悯他们而违抗真主的命令。\n他们的刑罚应由许多信士见证。\n[古兰经》24:2)\n\n\n\n你不可通奸[出埃及记...",
      "title": "通奸在过去是最严重的罪行之一，而在全世界绝大多数国家都是不被起诉的。是什么造成了这种转变？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "鞭打淫婦和姦夫，各人都要鞭打一百下。\n如果你們真的相信真主和末日，就不要因爲憐憫他們而違抗真主的命令。\n他們的刑罰應由許多信士見證。\n[古蘭經》24:2)\n\n\n\n你不可通姦[出埃及記...",
      "title": "通姦在過去是最嚴重的罪行之一，而在全世界絕大多數國家都是不被起訴的。是什麼造成了這種轉變？"
    }
  ]
}