{
  "author": "e1icz",
  "the_new_excerpt": "Introduction. DeFi is the future of finance with equal opportunities. Despite\nbeing at its inception, with currently more than $40 billion in total value\nlocked (TVL) [1], there exist already plenty of opportunities for you to make\nyour idle crypto tokens do the hard work for you to earn some…",
  "original_created_utc": 1615903272,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "导语：DeFi是机会均等的未来金融。DeFi是机会均等的未来金融。尽管\n正在成立之初，目前总价值超过400亿美元的\n锁定(TVL)[1]，已经存在大量的机会让你使。\n你闲置的加密代币为你做辛苦的工作，赚取一些... ...",
      "title": "赚取策略和Ethereum生态系统中DeFi协议的广泛清单。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "導語：DeFi是機會均等的未來金融。DeFi是機會均等的未來金融。儘管\n正在成立之初，目前總價值超過400億美元的\n鎖定(TVL)[1]，已經存在大量的機會讓你使。\n你閒置的加密代幣爲你做辛苦的工作，賺取一些... ...",
      "title": "賺取策略和Ethereum生態系統中DeFi協議的廣泛清單。"
    }
  ],
  "title": "An extensive list of earning strategies and DeFi protocols in the Ethereum ecosystem",
  "created_utc": 1615919427,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Introduction.</strong> DeFi is the future of finance with equal opportunities. Despite being at its inception, with currently more than $40 billion in total value locked (TVL) [1], there exist already plenty of opportunities for you to make your idle crypto tokens do the hard work for you to earn some interest. Some of the strategies offer a high risk-reward ratio, whereas some are rather safer. Many people do not know where to start with DeFi because the term itself is a buzzword (e.g., similar to the term BigData) with ambiguous meanings that get people easily lost. DeFi encapsulates various decentralized financial services whose functionality is immutable and persisted on (Ethereum) blockchain, which simply means these services are <em>accessible to anyone under the same rules and conditions</em>, which is a huge difference from traditional financial (tradFi) services. DeFi offers various strategies and this extensive guide should outline and uncover the most common earning strategies—including advantages and disadvantages—in the Ethereum ecosystem. The strategies proceed from the more mainstream and community-approved ones to more advanced ones, concluding with inspiring platforms and trends.</p>\n\n<p><strong>CONTENTS</strong></p>\n\n<ol>\n<li>Staking\n\n<ol>\n<li>Staking ETH 2.0</li>\n<li>Staking ERC-20 tokens</li>\n</ol></li>\n<li>Lending\n\n<ol>\n<li>Stablecoin lending</li>\n<li>wETH and wBTC lending</li>\n</ol></li>\n<li>Liquidity providing</li>\n<li>Yield and reward farming</li>\n<li>Miscellaneous: yield-bearing NTF´s, synthetic assets, future yield markets, self-paying loans</li>\n<li>Links and resources</li>\n</ol>\n\n<p><strong>1 STAKING</strong></p>\n\n<p>This is not DeFi per se, but to make the list complete, I will start with this, as ETH 2.0 staking is the <em>most important strategy</em> that can not only grant you passive income but also helps <em>keep the network decentralized and safe</em>. Also, the rewards compared to traditional finance are very appealing.</p>\n\n<p><strong>1.1 ETH 2.0 staking</strong></p>\n\n<pre><code>rewards: ~8% APR\n</code></pre>\n\n<p>There has been written a lot about staking already, for those who are interested to read more, the best start is Etehreum official website [2]. Several variants exist (self, validator-as-a-service, stake pools, custody, exchange) each of which suits better for people at different skill levels or involvement.</p>\n\n<table><thead>\n<tr>\n<th align=\"left\">[+] Ultimate HODL strategy</th>\n<th align=\"left\">[-] Tokens are locked indefinitely</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">[+] Low-risk strategy as this functionality is supported natively in the ETH protocol</td>\n<td align=\"left\">[-] Inactivity penalties (rather low) for offline time, risk of slashing for misconfiguration</td>\n</tr>\n</tbody></table>\n\n<p><strong>1.2 Staking ERC-20 tokens</strong></p>\n\n<p>Tokens: <em>Aave (LEND) [3], Synthetix (SNX) [4], Sushi [5], Curve (CRV) [6], Badger [7], The Graph (GRT) [8], and many others...)</em></p>\n\n<pre><code>rewards: various, ranging from 3% APR\n</code></pre>\n\n<p>There exist many tokens on Ethereum that incentivize users to lock their tokens to earn staking rewards for various activities: computation (e.g., verifying transactions), asset collateralization, governance—or no activity at all (~reward distribution tokens).</p>\n\n<table><thead>\n<tr>\n<th align=\"left\">[+] Earning interest on your favorite coins</th>\n<th align=\"left\">[-] Risk of token price depreciation in projects that are not mainstream or that have a long-term token issuance scheme</th>\n</tr>\n</thead><tbody>\n</tbody></table>\n\n<p><strong>2 LENDING</strong></p>\n\n<p>dApps: <em>Compound [9], Aave[10]</em></p>\n\n<p>You can provide your tokens to be lent to borrowers at (usually variable) interest rates. Some exchanges and centralized services offer these services as well. Lending rewards are typically low for leading crypto projects (ETH, wBTC) but are very interesting for stablecoins.</p>\n\n<p><strong>2.1 Stablecoin lending</strong></p>\n\n<pre><code>rewards: 3–20% APR, up to 30% APY\n</code></pre>\n\n<p>You lock your stablecoins into a vault. All the tokens in the vault earn the same reward. The interest rate fluctuates depending on the demand. Usually, in bull markets, the APR is higher than in bear markets. The reward is around 3-20% APR but compounding these rewards can slightly improve the rates, supposing the provider offers in-built compounding solutions (otherwise it does not pay-off to pay the high TX fees to claim rewards repeatedly).</p>\n\n<table><thead>\n<tr>\n<th align=\"left\">[+] Better rates compared to tradFi, but essentially on the same asset (dollars)</th>\n<th align=\"left\">[+] Low-risk strategy only depending on external factors (stablecoin losing peg)</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">[+/-] Stablecoins keep their price (disadvantage in bull markets, advantage in bear markets)</td>\n<td align=\"left\"></td>\n</tr>\n</tbody></table>\n\n<p><strong>2.2 ETH, wETH, wBTC lending</strong></p>\n\n<pre><code>rewards: 0.15–3% APR\n</code></pre>\n\n<p>Wrapped ETH (ETH is not ERC-20 token) and wrapped BTC (wBTC, renBTC) can be lend or staked to provide a yield that is in general rather low, but for holders with bigger stacks, it can be a very effective way to earn stable income on the two most mainstream cryptocurrencies.</p>\n\n<table><thead>\n<tr>\n<th align=\"left\">[+] You HODL your crypto and you get a small additional income</th>\n</tr>\n</thead><tbody>\n</tbody></table>\n\n<p><strong>3 LIQUIDITY PROVIDING</strong></p>\n\n<p>dApps: <em>uniswap[11], sushi[12], 1inch[13], Loopring[14] (L2)</em></p>\n\n<pre><code>rewards: up to 100%´s APR (with rewards)\n</code></pre>\n\n<p>Decentralized exchanges (DEX) run automated liquidity pools in order to facilitate the swaps (i.e., exchange trades). Users can provide liquidity for a DEX-traded pair by locking both assets to the pool, at 1:1 volume at their current corresponding price ratio. By locking the assets, you are eligible to earn the fixed fees (around 0.3%) of every trade, proportional to your stake in the liquidity pool. It makes sense to lock assets that you want to hold anyways and in the long-term, e.g., ETH/stablecoin pairs. New pairs are very often incentivized in providing liquidity by offering rewards schemes.</p>\n\n<table><thead>\n<tr>\n<th align=\"left\">[+] Acquiring a reasonable proportion of the pool that has high trading volume can generate interesting profits</th>\n<th align=\"left\">[-] Inter-pair token price fluctuations or decline to $0 lead to permanent and impermanent losses</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">[+] Many liquidity pools are incentivized by token providers or DEXes by additional token rewards that might severely boost the interest</td>\n<td align=\"left\">[-] Pools with low or no liquidity provide unstable ratios</td>\n</tr>\n</tbody></table>\n\n<p><strong>4 YIELD FARMING</strong></p>\n\n<p>dApps: <em>yearn[15], curve[6], badger[16], harvest.finance[17], alphahomora[18] (leveraged farming), and many others...</em></p>\n\n<pre><code>rewards: up to 100%´s APY\n</code></pre>\n\n<p>In typical staking, lending, or liquidity-providing scenarios, there is no compounding. In other words, you have to claim your rewards manually to earn them and re-stake them to compound your interests.  Some of the farming protocols collect the rewards for you. Yield farming basically removes or socializes the transaction fees to claim the rewards, which means that your earned interest is continuously compounding which increases the APR (to APY) without the need of repeatedly interacting with the smart contract which is expensive. Some aggressive yield farming strategies focus on harvesting both yields AND rewards from various protocols and compound all of them, which can make them very profitable in short term.</p>\n\n<table><thead>\n<tr>\n<th align=\"left\">[+] Very high rewards (100+% APY is not problem)</th>\n<th align=\"left\">[-] Some farmed assets cease to exist leaving you with permanent losses</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">[+] Farming aggregators (e.g., harvest.finance) offer multiple strategies and additionally offer interesting reward tokenomics</td>\n<td align=\"left\">[-] Many strategies are short term only and are not worth paying high TX fees</td>\n</tr>\n</tbody></table>\n\n<p><strong>5 MISCELLANEOUS</strong></p>\n\n<p>There are many wonderful projects around that attract and deserve attention and offer plausible earning strategies.</p>\n\n<p><strong>a) Yield farming on non-fungible tokens (NFT)</strong></p>\n\n<p>dApps: <em>Syncbonds[19], VeryNifty[20]</em></p>\n\n<p>Reward generating NFT tokens. Cryptobonds[19] are tradable reward-generating NFTs that lock up interest-bearing liquidity tokens. You can emit your own bond, participate in emitting one with others, or buy already emitted bonds on the open market.</p>\n\n<p>With VeryNifty[20], you can wrap your NFTS and turn them into vNFTs that earn you interest in the MUSE token. Careful, conditions apply that might burn your NTFs. There is a <a href=\"https://app.uniswap.org/#/add/0xc2BdE1A2fA26890c8E6AcB10C91CC6D9c11F4a73/0xc02aaa39b223fe8d0a0e5c4f27ead9083c756cc2\">uniswap pool</a> to stake and generate yields and trade HashMasks.</p>\n\n<p><strong>b) Synthetic assets</strong></p>\n\n<p>dApps: <em>Synthetix [21], Mirror[22]</em></p>\n\n<p>Synthetic assets are derivatives that are incentivized to hold the price peg to the underlying asset (stock, fund, commodity). The main advantage of &quot;synths&quot; is that anyone can get immutable exposure to any asset at any time (looking at you Robinhood traders). The disadvantage is that you do not really own the stock so you can not partake in ongoing short squeeze (looking at you GME apes). Ensuring the collateral to back up the synthetic asset pair with stablecoin can earn you good rewards while exposing you to the stock at the same time. The leading projects are Synthetix[21] and Mirror.finance[22] that uses its Terra UST cross-chain stablecoin.</p>\n\n<p><strong>c) Future yield tokenization</strong></p>\n\n<p>dApps: <em>APwine[23], Syncbonds[19]</em></p>\n\n<p>Imagine you can stake your tokens to gain future yields without locking the tokens and imagine you can sell these interest-bearing tokens INCLUDING its future yield in advance (for some discount, or even premium if you are lucky or smart). Sounds like a Matrix loophole. The markets are so far rather small, but the APwine[23] project is worth keeping eye on.</p>\n\n<p><strong>d) Self-paying loans - alchemix</strong></p>\n\n<p>dApps: <em>Alchemix[24]</em></p>\n\n<p>Alchemix[24] lets you take loans that do not generate debt for you but yield. You deposit a certain amount of crypto as collateral and you are able to withdraw up to its half as &quot;a loan to yourself&quot;. The other half is getting paid automatically by farming strategies.</p>\n\n<p><strong>6 LINKS AND RESOURCES</strong></p>\n\n<ul>\n<li>[1] <a href=\"https://defipulse.com/\">https://defipulse.com/</a> - total value locked overview</li>\n<li>[2] <a href=\"https://ethereum.org/en/eth2/staking/\">https://ethereum.org/en/eth2/staking/</a> - ETH 2.0 staking</li>\n<li>[3] <a href=\"https://aave.com/\">https://aave.com/</a> - lending platform, governance and reward token</li>\n<li>[4] <a href=\"https://synthetix.io/\">https://synthetix.io/</a> - synthetic assets, collateral and value peg token</li>\n<li>[5] <a href=\"https://www.sushi.com/\">https://www.sushi.com/</a> - decentralized exchange with farming and reward strategies</li>\n<li>[6] <a href=\"https://curve.fi/\">https://curve.fi/</a> - yield farming including BTC strategies</li>\n<li>[7] <a href=\"https://badger.finance/\">https://badger.finance/</a> - BTC strategies on Ethereum</li>\n<li>[8] <a href=\"https://thegraph.com/\">https://thegraph.com/</a> - Blockchain analytical data computation and providing platform</li>\n<li>[9] <a href=\"https://app.compound.finance/\">https://app.compound.finance/</a> - lending platform</li>\n<li>[10] <a href=\"https://app.aave.com/\">https://app.aave.com/</a> - lending platform</li>\n<li>[11] <a href=\"https://app.uniswap.org/\">https://app.uniswap.org/</a> - decentralized exchange</li>\n<li>[12] <a href=\"https://app.sushi.com/\">https://app.sushi.com/</a> - decentralized exchange</li>\n<li>[13] <a href=\"https://1inch.exchange/#/\">https://1inch.exchange/</a> - decentralized exchange</li>\n<li>14] <a href=\"https://exchange.loopring.io/swap\">https://exchange.loopring.io/swap</a> - decentralized exchange</li>\n<li>[15] <a href=\"https://yearn.finance/vaults/\">https://yearn.finance/vaults/</a> - yield farming</li>\n<li>[16] <a href=\"https://app.badger.finance/\">https://app.badger.finance/</a> - yield farming (BTC strategies)</li>\n<li>[17] <a href=\"https://harvest.finance/\">https://harvest.finance/</a> - yield farming aggregator</li>\n<li>[18] <a href=\"https://homora.alphafinance.io/\">https://homora.alphafinance.io/</a> - leveraged yield farming</li>\n<li>[19] <a href=\"https://app.syncbond.com/\">https://app.syncbond.com/</a> - tradeable yield-bearing NFT bonds</li>\n<li>[20] <a href=\"https://gallery.verynifty.io/\">https://gallery.verynifty.io/</a> - farming NFTs</li>\n<li>[21] <a href=\"https://staking.synthetix.io/staking\">https://staking.synthetix.io/staking</a> - collateral, liquidity, and trading of synthetic assets</li>\n<li>[22] <a href=\"https://eth.mirror.finance/\">https://eth.mirror.finance/</a> - collateral, liquidity, and trading of synthetic assets</li>\n<li>[23] <a href=\"https://app.apwine.fi/\">https://app.apwine.fi/</a> - trading yield-baring tokens with future interest</li>\n<li>[24] <a href=\"https://app.alchemix.fi/\">https://app.alchemix.fi/</a> - self-paying loans</li>\n</ul>\n\n<p><strong>DISCLAIMER</strong></p>\n\n<p>To earn interest in most cases does not mean buying the project&#39;s native token but using their platform/dApp.</p>\n\n<p>I am not anyhow related to, paid by, or involved with development in any of the mentioned projects or protocols.</p>\n\n<p>This is the 1st version (16. 3. 2021). I am aware that it is by far not completely exhaustive. If you feel something should be added/removed/changed let me know, I plan to keep it updated.</p>\n\n<p>This is not financial advice, and I am not responsible for your losses equally as well as I am not participating on your future gains :-).</p>\n\n<p>&#x200B;</p>\n\n<p>EDIT: Some typos and fixed slashing mistake in section 1.1. Slashing occurs when the validator acts provably wrong, either with malicious intents or by misconfiguration. I confused it with inactivity penalties that pose much lower risks.</p>\n</div><!-- SC_ON -->",
  "score": 436,
  "permalink": "/r/CryptoCurrency/comments/m69psa/an_extensive_list_of_earning_strategies_and_defi/",
  "subreddit": "CryptoCurrency",
  "id": "m69psa",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147378431
}