{
  "author": "MuchHold6421",
  "original_created_utc": 1634292733,
  "title": "I'm done smelling disinfectants.",
  "created_utc": 1634308685,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m a physician. I work 60/h a week. A little over a month into the job, I decided that I&#39;m unemployable for reasons I&#39;ll keep to myself. I needed a way out. I get paid very well but it&#39;s not what I want to do for the rest of my life. I see doctors in their late 60s coming to ER at midnight to evaluate critical cases. While we need people like this, I&#39;m not fit to be. </p>\n\n<p>&#x200B;</p>\n\n<p>Learned about bitcoin during the bull of 2017, got in August 2018.  I forgot all about it and got worked up with my job. Then COVID happens, thought nothing of it, then March 2020 happens. That&#39;s when I started learning more about Bitcoin and what it has to offer in a time of economic hiccups. I got hooked, Sold my apartment, and went in for the 2nd time.</p>\n\n<p>&#x200B;</p>\n\n<p>At today&#39;s price, I&#39;ve made from Bitcoin 10 years&#39; worth of salaries. I&#39;m close to hitting my target. I&#39;ll retire early, maybe not rich, but I&#39;ll own my time and focus on my passions. I&#39;m done smelling disinfectants.</p>\n</div><!-- SC_ON -->",
  "score": 165,
  "permalink": "/r/Bitcoin/comments/q8ldgg/im_done_smelling_disinfectants/",
  "subreddit": "Bitcoin",
  "id": "q8ldgg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm a physician. I work 60/h a week. A little over a month into the job, I\ndecided that I'm unemployable for reasons I'll keep to myself. I needed a way\nout. I get paid very well but it's not what I want to do for the rest of my\nlife. I see doctors in their late 60s coming to ER at midnight to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は医師です。週に60/h働いています。仕事を始めて1ヶ月ちょっとで\n理由は伏せておきますが、私は無職だと判断しました。脱出する方法が必要でした。\n出口が必要でした。給料はとても高いですが、残りの人生でやりたいことではありません。\n人生をかけてやりたいことではありません。私は、60代後半の医師が真夜中にERに来て、...",
      "title": "消毒液の匂いはもういいです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一名医生。我每周工作60/小时。开始工作一个多月后，我\n我决定我不能再工作了，原因我自己不说。我需要一条路\n出路。我的工资很高，但这不是我想在余生做的事。\n的工作。我看到年过六旬的医生在午夜时分来到急诊室，以...",
      "title": "我已经闻够了消毒剂的味道。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一名醫生。我每週工作60/小時。開始工作一個多月後，我\n我決定我不能再工作了，原因我自己不說。我需要一條路\n出路。我的工資很高，但這不是我想在餘生做的事。\n的工作。我看到年過六旬的醫生在午夜時分來到急診室，以...",
      "title": "我已經聞夠了消毒劑的味道。"
    }
  ]
}