{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "https://www.nytimes.com/2021/07/11/science/richard-branson-virgin-galactic-space.html?smid=url-share\n\nSPACEPORT AMERICA, N.M. — Soaring more than 50 miles into the hot, glaringly bright skies above New Mexico, Richard Branson at last fulfilled a dream that took decades to realize: He can now call himself an astronaut.\n\nOn Sunday morning, a small rocket plane operated by Virgin Galactic, which Mr. Branson founded in 2004, carried him and five other people to the edge of space and back.\n\nMore than an hour later, a Mr. Branson took the stage to celebrate. “The whole thing was magical,” he said.\n\nMr. Branson’s flight reinforces the hopes of space enthusiasts that routine travel to the final frontier may soon be available to private citizens, not just the professional astronauts of NASA and other space agencies. Another billionaire with his own rocket company — Jeff Bezos, the founder of Amazon — has plans to make a similar jaunt to the edge of space in nine days.\n\nIn each case, billionaire entrepreneurs are risking injury or death to fulfill their childhood aspirations — and advance the goal of making human spaceflight unexceptional.\n\n“They’re putting their money where their mouth is, and they’re putting their body where their money is,” said Eric Anderson, chairman of Space Adventures Limited, a company that charters launches to orbit. “That’s impressive, frankly.”\n\nAt 8:40 a.m. Mountain time, a carrier aircraft, with the rocket plane, named V.S.S. Unity, tucked underneath, rose off the runway and headed to an altitude of about 45,000 feet. There, Unity was released, and a few moments later, its rocket motor ignited, accelerating the space plane on an upward arc.\n\nAlthough Unity had made three previous trips to space, this was its first launch that resembled a full commercial flight of the sort that Virgin Galactic has promised to offer the general public, with two pilots — David Mackay and Michael Masucci — and four more crew members including Mr. Branson.\n\nThis flight resembled a party for Virgin Galactic and the nascent space tourism business. Guests included Elon Musk, the founder of SpaceX; Michelle Lujan Grisham, the governor of New Mexico; and about 60 customers who have paid for future Virgin Galactic flights.\n\nStephen Colbert of the CBS program “The Late Show” introduced segments of the webcast that included some live video from inside the spaceship. After the landing, Khalid performed a new song.\n\nWhen the fuel was spent, Unity continued to coast upward to an altitude of 53.5 miles. The four people in back unbuckled and experienced about four minutes of floating before returning to their seats.\n\nMr. Branson was accompanied in the cabin by Beth Moses, the company’s chief astronaut instructor; Colin Bennett, lead operations engineer; and Sirisha Bandla, vice president of government affairs and research operations.\n\nAs the space plane re-entered the atmosphere, the downward pull of gravity resumed. Unity glided to a landing back at the spaceport.\n\nFor well over a decade, Mr. Branson, the irreverent 70-year-old British billionaire who runs a galaxy of Virgin companies, has said he believes that commercial flights will soon begin. So did the 600 or so customers of Virgin Galactic who have paid $200,000 or more for their tickets to space and are still waiting. So did the taxpayers of New Mexico who paid $220 million to build Spaceport America, a futuristic vision in the middle of the desert, in order to attract Mr. Branson’s company.\n\nAfter years and years of unmet promises, Virgin Galactic may begin flying the first paying passengers next year after two more test flights. But with tickets costing hundreds of thousands of dollars, this experience will, for now, remain out of financial reach for most people.\n\nFounding a space exploration company was perhaps an unsurprising step for Mr. Branson, who has made a career — and a fortune estimated at $6 billion — building flashy upstart businesses that he promotes with a showman’s flair.\n\nWhat became his Virgin business empire began with a small record shop in central London in the 1970s before Mr. Branson parlayed it into Virgin Records, the home of acts like the Sex Pistols, Peter Gabriel and more. In 1984, he was a co-founder of what became Virgin Atlantic, to challenge British Airways.\n\nThe Virgin Group branched out into a mobile-phone service, a passenger railway and a line of hotels. Not all have performed flawlessly. Two of his airlines filed for insolvency during the pandemic last year, while few today remember his ventures into soft drinks, cosmetics or lingerie.\n\nThe spaceflight company was of a piece with Mr. Branson’s penchant for highflying pursuits like skydiving and hot-air ballooning. And unlike many of the Virgin Group’s businesses, Virgin Galactic has been a major focus of Mr. Branson’s.\n\nVirgin Galactic joined the New York Stock Exchange in 2019 after merging with a publicly traded investment fund, giving it a potent source of new funds to compete with deep-pocket competitors — and publicity, with Mr. Branson marking its trading debut at the exchange in one of the company’s flight suits.\n\nThe Virgin Group retains a 24 percent stake in Virgin Galactic.\n\nVirgin Galactic’s space plane is a scaled-up version of SpaceShipOne, which in 2004 captured the $10 million Ansari X Prize as the first reusable crewed spacecraft built by a nongovernmental organization to make it to space twice in two weeks.\n\nMr. Branson initially predicted commercial flights would begin by 2007. But development of the larger craft, SpaceShipTwo, stretched out.\n\nThe first SpaceShipTwo vehicle, V.S.S. Enterprise, crashed during a test flight in 2014, killing one of the pilots. Virgin Galactic was then grounded until Unity was completed a year and a half later.\n\nIn 2019, Virgin Galactic came close to another catastrophe when a seal on a rear horizontal stabilizer ruptured because a new thermal protection film had been improperly installed.\nThe mishap was revealed this year in the book “Test Gods: Virgin Galactic and the Making of a Modern Astronaut” by Nicholas Schmidle, a staff writer at The New Yorker. The book quotes Todd Ericson, then the vice president for safety and test at Virgin Galactic, saying, “I don’t know how we didn’t lose the vehicle and kill three people.”\n\nMr. Bezos’ flight is to take place about 200 miles to the southeast of Spaceport America in Van Horn, Texas, where his rocket company, Blue Origin, launches its New Shepard rocket and capsule.\n\nAlthough Blue Origin has yet to fly any people on New Shepard, 15 successful uncrewed tests of the fully automated system convinced the company it would be safe to put Mr. Bezos on the first flight with people aboard.\n\nHe will be joined by his brother, Mark, and Mary Wallace Funk, an 82-year-old pilot. In the 1960s, she was among a group of women who passed the same rigorous criteria that NASA used for selecting astronauts, but the space agency at the time had no interest in selecting women as astronauts. A fourth unnamed passenger paid $28 million in an auction for one of the seats.\n\nNeither Blue Origin nor Virgin Galactic flights go high enough or fast enough to enter orbit around Earth. Rather, these suborbital flights are more like giant roller coaster rides that allow passengers to float for a few minutes while admiring a view of Earth against the black backdrop of space.\n\nMr. Bezos’ company emphasized the rivalry with Virgin Galactic for space tourism passengers in a tweet on Friday. Blue Origin highlighted differences between its New Shepard rocket and Virgin Galactic’s SpaceShipTwo including the fact that New Shepard flies higher, above the altitude of 100 kilometers, or about 62 miles, that is often regarded as the boundary of space. However, the United States Air Force and the Federal Aviation Administration set the boundary at 50 miles.\n\nThe company also noted the size of the New Shepard capsule’s windows, and called Virgin Galactic’s Unity “a high-altitude plane” in contrast to New Shepard’s rocket.\nMr. Bezos on Sunday congratulated Mr. Branson and his fellow crew on their flight. “Can’t wait to join the club!” he added in an Instagram post.\n\nBlue Origin has not yet announced a ticket price, and Virgin Galactic’s earlier quoted fare of $250,000 may rise. But on Sunday after his trip, Mr. Branson announced a sweepstakes that will give away two seats on a future Virgin Galactic flight.\n\nJoy-riding tourists will not be the only passengers on future suborbital flights. Both companies are selling flights to organizations including the Italian Air Force where scientists will conduct experiments that take advantage of the minutes of microgravity.\n\nThe era of nonprofessional astronauts regularly heading to orbit may also begin in the coming year. Jared Isaacman, a 38-year-old billionaire, is essentially chartering a rocket and spacecraft from SpaceX for a three-day trip to orbit that is scheduled for September.\n\nIn December, Space Adventures has arranged for a Japanese fashion entrepreneur, Yusaku Maezawa, and Yozo Hirano, a production assistant, to launch on a Russian Soyuz rocket on a 12-day mission that will go to the International Space Station.\n\nAnother company, Axiom Space in Houston, is arranging a separate trip to the space station that will launch as soon as January.\n\nThe orbital trips are too expensive for anyone except the superwealthy — Axiom’s three customers are paying $55 million each — while suborbital flights might be affordable to those who are merely well off.\n\nBut how many people are willing to spend as much as some houses cost for a few minutes of space travel?\n\nCarissa Christensen, founder and chief executive of Bryce Space and Technology, an aerospace consulting firm, thinks there will be plenty. “Based on previous ticket sales, surveys and interviews,” she said in an email, “we see strong demand signals for multiple hundreds of passengers a year at current prices, with potential for thousands if prices drop significantly.”\n\nMr. Anderson of Space Adventures is less certain.\n\n“Per minute, it’s like a thousand times more expensive than an orbital flight,” he said. “It’s crazy.”\n\nTwo decades ago, Space Adventures did sell suborbital flights including a ticket to Ms. Funk, who goes by Wally. “Wally Funk was one of our first customers,” Mr. Anderson said. “That would have been like 1998.”\n\nThe ticket price then was $98,000.\n\nAt one point, about 200 people signed up for suborbital flights, but none of the promised suborbital rocket companies was able to get their space planes close to flight. Space Adventures returned the money to Ms. Funk and the others.\n\nNow this unproven suborbital market has whittled down to a battle of billionaires — Mr. Branson and Mr. Bezos.\n\n“If anybody can make money and make the market work for suborbital, it’s Branson and Bezos,” Mr. Anderson said. “They have the reach and the cachet.”",
  "author_fullname": "t2_zpr4o",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Branson Completes Virgin Galactic Flight, Aiming to Open Up Space Tourism",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": "news",
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": true,
  "name": "t3_oibdub",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.82,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 2273,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Industry News",
  "can_mod_post": false,
  "score": 2273,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1626062123,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": true,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.nytimes.com/2021/07/11/science/richard-branson-virgin-galactic-space.html?smid=url-share\">https://www.nytimes.com/2021/07/11/science/richard-branson-virgin-galactic-space.html?smid=url-share</a></p>\n\n<p>SPACEPORT AMERICA, N.M. — Soaring more than 50 miles into the hot, glaringly bright skies above New Mexico, Richard Branson at last fulfilled a dream that took decades to realize: He can now call himself an astronaut.</p>\n\n<p>On Sunday morning, a small rocket plane operated by Virgin Galactic, which Mr. Branson founded in 2004, carried him and five other people to the edge of space and back.</p>\n\n<p>More than an hour later, a Mr. Branson took the stage to celebrate. “The whole thing was magical,” he said.</p>\n\n<p>Mr. Branson’s flight reinforces the hopes of space enthusiasts that routine travel to the final frontier may soon be available to private citizens, not just the professional astronauts of NASA and other space agencies. Another billionaire with his own rocket company — Jeff Bezos, the founder of Amazon — has plans to make a similar jaunt to the edge of space in nine days.</p>\n\n<p>In each case, billionaire entrepreneurs are risking injury or death to fulfill their childhood aspirations — and advance the goal of making human spaceflight unexceptional.</p>\n\n<p>“They’re putting their money where their mouth is, and they’re putting their body where their money is,” said Eric Anderson, chairman of Space Adventures Limited, a company that charters launches to orbit. “That’s impressive, frankly.”</p>\n\n<p>At 8:40 a.m. Mountain time, a carrier aircraft, with the rocket plane, named V.S.S. Unity, tucked underneath, rose off the runway and headed to an altitude of about 45,000 feet. There, Unity was released, and a few moments later, its rocket motor ignited, accelerating the space plane on an upward arc.</p>\n\n<p>Although Unity had made three previous trips to space, this was its first launch that resembled a full commercial flight of the sort that Virgin Galactic has promised to offer the general public, with two pilots — David Mackay and Michael Masucci — and four more crew members including Mr. Branson.</p>\n\n<p>This flight resembled a party for Virgin Galactic and the nascent space tourism business. Guests included Elon Musk, the founder of SpaceX; Michelle Lujan Grisham, the governor of New Mexico; and about 60 customers who have paid for future Virgin Galactic flights.</p>\n\n<p>Stephen Colbert of the CBS program “The Late Show” introduced segments of the webcast that included some live video from inside the spaceship. After the landing, Khalid performed a new song.</p>\n\n<p>When the fuel was spent, Unity continued to coast upward to an altitude of 53.5 miles. The four people in back unbuckled and experienced about four minutes of floating before returning to their seats.</p>\n\n<p>Mr. Branson was accompanied in the cabin by Beth Moses, the company’s chief astronaut instructor; Colin Bennett, lead operations engineer; and Sirisha Bandla, vice president of government affairs and research operations.</p>\n\n<p>As the space plane re-entered the atmosphere, the downward pull of gravity resumed. Unity glided to a landing back at the spaceport.</p>\n\n<p>For well over a decade, Mr. Branson, the irreverent 70-year-old British billionaire who runs a galaxy of Virgin companies, has said he believes that commercial flights will soon begin. So did the 600 or so customers of Virgin Galactic who have paid $200,000 or more for their tickets to space and are still waiting. So did the taxpayers of New Mexico who paid $220 million to build Spaceport America, a futuristic vision in the middle of the desert, in order to attract Mr. Branson’s company.</p>\n\n<p>After years and years of unmet promises, Virgin Galactic may begin flying the first paying passengers next year after two more test flights. But with tickets costing hundreds of thousands of dollars, this experience will, for now, remain out of financial reach for most people.</p>\n\n<p>Founding a space exploration company was perhaps an unsurprising step for Mr. Branson, who has made a career — and a fortune estimated at $6 billion — building flashy upstart businesses that he promotes with a showman’s flair.</p>\n\n<p>What became his Virgin business empire began with a small record shop in central London in the 1970s before Mr. Branson parlayed it into Virgin Records, the home of acts like the Sex Pistols, Peter Gabriel and more. In 1984, he was a co-founder of what became Virgin Atlantic, to challenge British Airways.</p>\n\n<p>The Virgin Group branched out into a mobile-phone service, a passenger railway and a line of hotels. Not all have performed flawlessly. Two of his airlines filed for insolvency during the pandemic last year, while few today remember his ventures into soft drinks, cosmetics or lingerie.</p>\n\n<p>The spaceflight company was of a piece with Mr. Branson’s penchant for highflying pursuits like skydiving and hot-air ballooning. And unlike many of the Virgin Group’s businesses, Virgin Galactic has been a major focus of Mr. Branson’s.</p>\n\n<p>Virgin Galactic joined the New York Stock Exchange in 2019 after merging with a publicly traded investment fund, giving it a potent source of new funds to compete with deep-pocket competitors — and publicity, with Mr. Branson marking its trading debut at the exchange in one of the company’s flight suits.</p>\n\n<p>The Virgin Group retains a 24 percent stake in Virgin Galactic.</p>\n\n<p>Virgin Galactic’s space plane is a scaled-up version of SpaceShipOne, which in 2004 captured the $10 million Ansari X Prize as the first reusable crewed spacecraft built by a nongovernmental organization to make it to space twice in two weeks.</p>\n\n<p>Mr. Branson initially predicted commercial flights would begin by 2007. But development of the larger craft, SpaceShipTwo, stretched out.</p>\n\n<p>The first SpaceShipTwo vehicle, V.S.S. Enterprise, crashed during a test flight in 2014, killing one of the pilots. Virgin Galactic was then grounded until Unity was completed a year and a half later.</p>\n\n<p>In 2019, Virgin Galactic came close to another catastrophe when a seal on a rear horizontal stabilizer ruptured because a new thermal protection film had been improperly installed.\nThe mishap was revealed this year in the book “Test Gods: Virgin Galactic and the Making of a Modern Astronaut” by Nicholas Schmidle, a staff writer at The New Yorker. The book quotes Todd Ericson, then the vice president for safety and test at Virgin Galactic, saying, “I don’t know how we didn’t lose the vehicle and kill three people.”</p>\n\n<p>Mr. Bezos’ flight is to take place about 200 miles to the southeast of Spaceport America in Van Horn, Texas, where his rocket company, Blue Origin, launches its New Shepard rocket and capsule.</p>\n\n<p>Although Blue Origin has yet to fly any people on New Shepard, 15 successful uncrewed tests of the fully automated system convinced the company it would be safe to put Mr. Bezos on the first flight with people aboard.</p>\n\n<p>He will be joined by his brother, Mark, and Mary Wallace Funk, an 82-year-old pilot. In the 1960s, she was among a group of women who passed the same rigorous criteria that NASA used for selecting astronauts, but the space agency at the time had no interest in selecting women as astronauts. A fourth unnamed passenger paid $28 million in an auction for one of the seats.</p>\n\n<p>Neither Blue Origin nor Virgin Galactic flights go high enough or fast enough to enter orbit around Earth. Rather, these suborbital flights are more like giant roller coaster rides that allow passengers to float for a few minutes while admiring a view of Earth against the black backdrop of space.</p>\n\n<p>Mr. Bezos’ company emphasized the rivalry with Virgin Galactic for space tourism passengers in a tweet on Friday. Blue Origin highlighted differences between its New Shepard rocket and Virgin Galactic’s SpaceShipTwo including the fact that New Shepard flies higher, above the altitude of 100 kilometers, or about 62 miles, that is often regarded as the boundary of space. However, the United States Air Force and the Federal Aviation Administration set the boundary at 50 miles.</p>\n\n<p>The company also noted the size of the New Shepard capsule’s windows, and called Virgin Galactic’s Unity “a high-altitude plane” in contrast to New Shepard’s rocket.\nMr. Bezos on Sunday congratulated Mr. Branson and his fellow crew on their flight. “Can’t wait to join the club!” he added in an Instagram post.</p>\n\n<p>Blue Origin has not yet announced a ticket price, and Virgin Galactic’s earlier quoted fare of $250,000 may rise. But on Sunday after his trip, Mr. Branson announced a sweepstakes that will give away two seats on a future Virgin Galactic flight.</p>\n\n<p>Joy-riding tourists will not be the only passengers on future suborbital flights. Both companies are selling flights to organizations including the Italian Air Force where scientists will conduct experiments that take advantage of the minutes of microgravity.</p>\n\n<p>The era of nonprofessional astronauts regularly heading to orbit may also begin in the coming year. Jared Isaacman, a 38-year-old billionaire, is essentially chartering a rocket and spacecraft from SpaceX for a three-day trip to orbit that is scheduled for September.</p>\n\n<p>In December, Space Adventures has arranged for a Japanese fashion entrepreneur, Yusaku Maezawa, and Yozo Hirano, a production assistant, to launch on a Russian Soyuz rocket on a 12-day mission that will go to the International Space Station.</p>\n\n<p>Another company, Axiom Space in Houston, is arranging a separate trip to the space station that will launch as soon as January.</p>\n\n<p>The orbital trips are too expensive for anyone except the superwealthy — Axiom’s three customers are paying $55 million each — while suborbital flights might be affordable to those who are merely well off.</p>\n\n<p>But how many people are willing to spend as much as some houses cost for a few minutes of space travel?</p>\n\n<p>Carissa Christensen, founder and chief executive of Bryce Space and Technology, an aerospace consulting firm, thinks there will be plenty. “Based on previous ticket sales, surveys and interviews,” she said in an email, “we see strong demand signals for multiple hundreds of passengers a year at current prices, with potential for thousands if prices drop significantly.”</p>\n\n<p>Mr. Anderson of Space Adventures is less certain.</p>\n\n<p>“Per minute, it’s like a thousand times more expensive than an orbital flight,” he said. “It’s crazy.”</p>\n\n<p>Two decades ago, Space Adventures did sell suborbital flights including a ticket to Ms. Funk, who goes by Wally. “Wally Funk was one of our first customers,” Mr. Anderson said. “That would have been like 1998.”</p>\n\n<p>The ticket price then was $98,000.</p>\n\n<p>At one point, about 200 people signed up for suborbital flights, but none of the promised suborbital rocket companies was able to get their space planes close to flight. Space Adventures returned the money to Ms. Funk and the others.</p>\n\n<p>Now this unproven suborbital market has whittled down to a battle of billionaires — Mr. Branson and Mr. Bezos.</p>\n\n<p>“If anybody can make money and make the market work for suborbital, it’s Branson and Bezos,” Mr. Anderson said. “They have the reach and the cachet.”</p>\n</div><!-- SC_ON -->",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "866eb162-65e6-11e5-a903-1252b640afe9",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#80adf9",
  "id": "oibdub",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "deevee12",
  "discussion_type": null,
  "num_comments": 28,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/oibdub/branson_completes_virgin_galactic_flight_aiming/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/oibdub/branson_completes_virgin_galactic_flight_aiming/",
  "subreddit_subscribers": 2886786,
  "created_utc": 1626039255,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1626033323,
  "the_new_excerpt": "https://www.nytimes.com/2021/07/11/science/richard-branson-virgin-galactic-space.html?smid=url-share\n\nSPACEPORT AMERICA, N.M. — Soaring more than 50 miles into the hot, glaringly\nbright skies above New Mexico, Richard Branson at last fulfilled a dream that\ntook decades to realize: He can now call…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "https://www.nytimes.com/2021/07/11/science/richard-branson-virgin-galactic-space.html?smid=url-share\n\nノースカロライナ州のスペースポート・アメリカ - 暑くてまぶしい空に向かって50マイル以上も飛び立った。\nリチャード・ブランソンは、ニューメキシコ州の暑くて明るい空に向かって50マイル以上も飛び立ち、何十年もかかった夢をついに実現しました。\nリチャード・ブランソンは、何十年もかけて実現した夢をついに叶えたのです：今、彼は...",
      "title": "ブランソン、ヴァージン・ギャラクティック社のフライトを終え、宇宙旅行の開放を目指す"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "https://www.nytimes.com/2021/07/11/science/richard-branson-virgin-galactic-space.html?smid=url-share\n\n美国新墨西哥州太空堡垒--在新墨西哥州炎热、耀眼的天空中翱翔50多英里。\n理查德-布兰森（Richard Branson）终于实现了他花了几十年时间才实现的一个梦想：他现在可以在新墨西哥州的炎热、明亮的天空中飞行了。\n理查德-布兰森终于实现了他花了几十年时间才实现的梦想：他现在可以叫...",
      "title": "布兰森完成维珍银河公司的飞行，旨在开放太空旅游"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "https://www.nytimes.com/2021/07/11/science/richard-branson-virgin-galactic-space.html?smid=url-share\n\n美國新墨西哥州太空堡壘--在新墨西哥州炎熱、耀眼的天空中翱翔50多英里。\n理查德-布蘭森（Richard Branson）終於實現了他花了幾十年時間才實現的一個夢想：他現在可以在新墨西哥州的炎熱、明亮的天空中飛行了。\n理查德-布蘭森終於實現了他花了幾十年時間才實現的夢想：他現在可以叫...",
      "title": "布蘭森完成維珍銀河公司的飛行，旨在開放太空旅遊"
    }
  ],
  "source_updated_at": 1626428571654
}