{
  "author": "xavierwest888",
  "original_created_utc": 1642073260,
  "title": "I do believe that CRO has finally delivered what the average person needs to get into crypto which is simple, real world usage",
  "created_utc": 1642088615,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I want to point out that I&amp;#39;m not shilling CRO, I have a tiny bag of it, not even enough to get the first tier of their debit card. I also want to add that they are far from perfect, their app is so ridiculously slow and I hate that I have to use a mobile phone instead of a desktop, both drive me mad. Also I know it&amp;#39;s not decentralised so a lot of the crypto &amp;#39;purists&amp;#39; are not going to like it (even though no crypto coin where you can just buy a controlling quantity with the only limitation being having enough money was never truly decentralised in my opinion).&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;That said I think they have structured their business model perfectly towards the average person:&lt;/p&gt;\n\n&lt;p&gt;1) You need to have almost zero knowledge to buy CRO and stake it.&lt;/p&gt;\n\n&lt;p&gt;2) Their pre paid debit card is the best bridge I&amp;#39;ve seen so far between fiat and crypto, you just spend your fiat and get crypto in return. It doesn&amp;#39;t require all the world&amp;#39;s companies to change their payment systems and pricing structure. Everything stays in fiat and the user gets the reward. Also it looks super cool and makes people want to show it off.&lt;/p&gt;\n\n&lt;p&gt;3) Their daily missions encourage a repeating $20 daily DCA which is perfect for teaching new investors to put in gradually and repeatedly rather than dumping a 4/5 digit lump sum all in on one price point, often near ATHs.&lt;/p&gt;\n\n&lt;p&gt;4) They offer decent staking rewards although you do need a large bag of CRO to access it which I feel is a bit off-putting.&lt;/p&gt;\n\n&lt;p&gt;5) They are doing real marketing, buying stadiums and paying Matt Damon to be in their adverts. Compare that to someone like LRC who also have a fait on ramp and wallet system and their marketing consists of a guy posting laser eye memes on twitter and discord and saying things like &amp;quot;WAGMI&amp;quot;. I know Matt Damon was just paid to be in an advert but I still trust any company that can actually afford to hire him far more than a company that cannot / will not spend that money.  &lt;/p&gt;\n\n&lt;p&gt;6) The coin price point is something that retail can understand, it&amp;#39;s not a scary large number like BTC but it&amp;#39;s also not 6 0s after a decimal like a lot of shitcoins.&lt;/p&gt;\n\n&lt;p&gt;7) Their model is built around buying and holding their coin for other rewards which is, again, great at teaching retail to HODL rather than the only means of value to try and sell at a higher price point that pretty much the rest of the crypto market exists on.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 335,
  "permalink": "/r/CryptoCurrency/comments/s2xcou/i_do_believe_that_cro_has_finally_delivered_what/",
  "subreddit": "CryptoCurrency",
  "id": "s2xcou",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I want to point out that I'm not shilling CRO, I have a tiny bag of it, not even\nenough to get the first tier of their debit card. I also want to add that they\nare far from perfect, their app is so ridiculously slow and I hate that I have\nto use a mobile phone instead of a desktop, both drive me…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はCROをシリングしているわけではなく、小さな袋を持っていることを指摘しておきたいと思います。\nデビットカードの1等級を取得するのに十分な量です。また、彼らは\nアプリはとんでもなく遅いですし、私はそのようなアプリがあることが嫌です。\nデスクトップではなく、携帯電話を使用するため、どちらも私を駆り立てる...",
      "title": "CROは、一般の人が暗号を使いこなすために必要な、シンプルで現実的な使い方をついに実現したと思います。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想指出的是，我不是在推销CRO，我有一袋很小的CRO，甚至不够他们的借记卡的第一层。\n甚至不足以获得他们借记卡的第一层。我还想补充的是，他们\n他们远非完美，他们的应用程序慢得令人发指，我讨厌我不得不用手机而不是电脑。\n用手机而不是台式机，这两件事都让我......",
      "title": "我相信，CRO终于提供了普通人进入加密货币所需要的东西，即简单、真实的使用方法。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想指出的是，我不是在推銷CRO，我有一袋很小的CRO，甚至不夠他們的借記卡的第一層。\n甚至不足以獲得他們借記卡的第一層。我還想補充的是，他們\n他們遠非完美，他們的應用程序慢得令人髮指，我討厭我不得不用手機而不是電腦。\n用手機而不是臺式機，這兩件事都讓我......",
      "title": "我相信，CRO終於提供了普通人進入加密貨幣所需要的東西，即簡單、真實的使用方法。"
    }
  ]
}