{
  "author": "volkeregpt",
  "original_created_utc": 1636104345,
  "title": "Is it weird to feel mentally younger than you actually are? I'm 29, but mentally I've felt like I'm somewhere between 16-21 my entire adult life.",
  "created_utc": 1636138129,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Edit: I&#39;ve read quite a few comments that suggested that I&#39;m dating underage girls or something... Why would some of you assume such a horrendous thing?</p>\n\n<p>I said 16 and not 18 because the last two years of high school I had easy classes (took all my hardest classes my first two years of high school) so my last two years of high school (when I was 16-18) I stayed up late at night playing video games and now as an adult I stay up late at night playing video games.</p>\n\n<p>Sheesh.</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/qn7a82/is_it_weird_to_feel_mentally_younger_than_you/",
  "subreddit": "NoStupidQuestions",
  "id": "qn7a82",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Edit: I've read quite a few comments that suggested that I'm dating underage\ngirls or something... Why would some of you assume such a horrendous thing?\n\nI said 16 and not 18 because the last two years of high school I had easy\nclasses (took all my hardest classes my first two years of high school)…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "編集部：私が未成年の女の子と付き合っているのではないかというコメントをかなり読みました。\nというコメントをいくつか読みましたが...。なぜそんな恐ろしいことを決めつける人がいるのでしょうか？\n\n私が18歳ではなく16歳と言ったのは、高校の最後の2年間は簡単な授業を受けていたからです。\n18歳ではなく16歳と言ったのは、高校の最後の2年間は簡単な授業を受けていたからです（高校の最初の2年間は難しい授業ばかり受けていました）。",
      "title": "実際の年齢よりも精神的に若く感じるのは変ですか？私は29歳ですが、精神的には大人になってからずっと16歳から21歳の間のように感じています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "编辑：我读到不少评论，认为我在和未成年少女约会\n女孩或什么的... 为什么你们中的一些人要假设这样一件可怕的事情？\n\n我说16岁而不是18岁，是因为在高中的最后两年，我有轻松的\n我说16岁而不是18岁是因为高中的最后两年我的课程很简单（在高中的前两年我上了所有最难的课程）...",
      "title": "感觉精神上比实际年龄小，这很奇怪吗？我今年29岁，但在整个成年生活中，我感觉自己的年龄在16-21岁之间。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "編輯：我讀到不少評論，認爲我在和未成年少女約會\n女孩或什麼的... 爲什麼你們中的一些人要假設這樣一件可怕的事情？\n\n我說16歲而不是18歲，是因爲在高中的最後兩年，我有輕鬆的\n我說16歲而不是18歲是因爲高中的最後兩年我的課程很簡單（在高中的前兩年我上了所有最難的課程）...",
      "title": "感覺精神上比實際年齡小，這很奇怪嗎？我今年29歲，但在整個成年生活中，我感覺自己的年齡在16-21歲之間。"
    }
  ]
}