{
  "author": "King_Vercingetorix",
  "original_created_utc": 1653658461,
  "title": "In Don Quixote, Cervantes claims that even if the 'insane' Don Quixote commits murder, he would not be held accountable. Was this actually the case for the Spanish legal system in the early 1600s?",
  "created_utc": 1653681701,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For context, in case anyone is curious, “The landlord shouted to them to leave him alone, for he had already told them that he was mad, and as a madman he would not be accountable even if he killed them all” (p. 31). And similar sentences are written throughout the novel.&lt;/p&gt;\n\n&lt;p&gt;I just find it remarkable that (if this is indeed true) in the early 1600s, the Spanish legal system not only recognizes mentally not alright people but also find that even in serious cases such as murder, that they may not be culpable in their actions. Or is this a case of Cervantes employing some sort of satire/joke/exaggeration that just flew over my head and this isn&amp;#39;t actually the case?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/uyycvg/in_don_quixote_cervantes_claims_that_even_if_the/",
  "subreddit": "AskHistorians",
  "id": "uyycvg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "For context, in case anyone is curious, “The landlord shouted to them to leave\nhim alone, for he had already told them that he was mad, and as a madman he\nwould not be accountable even if he killed them all” (p. 31). And similar\nsentences are written throughout the novel.\n\nI just find it remarkable…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "文脈から、気になる人のために説明すると、「大家は彼らに出て行けと叫んだ」。\nなぜなら、彼はすでに気が狂っていると言っていたからだ。\nと叫んだ」（p.31）。そして、同様の文章が\nの文章が、この小説の随所に書かれている。\n\nただ、驚くべきことに......。",
      "title": "ドン・キホーテ』の中でセルバンテスは、「正気を失った」ドン・キホーテが殺人を犯しても、責任を問われることはないと主張している。1600年代初頭のスペインの法制度は、実際にそうだったのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果有人好奇的话，请看上下文：\"房东大叫着让他们不要管他\n因为他已经告诉他们，他是个疯子，而且作为一个疯子，他不会\n即使他把他们都杀了，也不会被追究责任\"（第31页）。而类似的\n的句子写在整个小说中。\n\n我只是觉得这很了不起...",
      "title": "在《堂吉诃德》中，塞万提斯声称，即使 \"精神错乱 \"的堂吉诃德犯下谋杀罪，他也不会被追究责任。16世纪初的西班牙法律体系实际上是这样的吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果有人好奇的話，請看上下文：\"房東大叫着讓他們不要管他\n因爲他已經告訴他們，他是個瘋子，而且作爲一個瘋子，他不會\n即使他把他們都殺了，也不會被追究責任\"（第31頁）。而類似的\n的句子寫在整個小說中。\n\n我只是覺得這很了不起...",
      "title": "在《堂吉訶德》中，塞萬提斯聲稱，即使 \"精神錯亂 \"的堂吉訶德犯下謀殺罪，他也不會被追究責任。16世紀初的西班牙法律體系實際上是這樣的嗎？"
    }
  ]
}