{
  "author": "CarSuperFast",
  "original_created_utc": 1630080848,
  "title": "I am 23, I finally made my first $10k month, I work 60 hours a week, is this what life really is? Work, Paid, Spend, Repeat.",
  "created_utc": 1630144449,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is my first time in my life ever that I made this much money in one month, but at the same time it is also the most I have worked in my life. 60 hour work weeks, 240 hours a month. </p>\n\n<p>I see my friends, who also make good money 70K a year, but they are all working 9-5, every day. There is more to life than this right? Yeah the money is good, but this can&#39;t be it. Work, spend money, sleep, Repeat....</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/pcqh1u/i_am_23_i_finally_made_my_first_10k_month_i_work/",
  "subreddit": "TooAfraidToAsk",
  "id": "pcqh1u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is my first time in my life ever that I made this much money in one month,\nbut at the same time it is also the most I have worked in my life. 60 hour work\nweeks, 240 hours a month.\n\nI see my friends, who also make good money 70K a year, but they are all working\n9-5, every day. There is more to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1ヶ月でこれだけの金額を稼いだのは、私の人生で初めてのことです。\n同時に、これまでの人生で最も多く働いたことにもなります。60時間労働\n週に60時間、月に240時間。\n\n年収7万円の友人を見ても、彼らは毎日9時から5時まで働いているんだ。\n毎日、9時から5時まで働いています。それ以外にも...。",
      "title": "私は23歳で、ようやく最初の1万ドルを稼いだ月があります。週に60時間働いていますが、これが人生の本当の姿なのでしょうか？働いて、払って、使って、の繰り返し。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是我有生以来第一次在一个月内赚这么多钱。\n但与此同时，这也是我一生中工作最多的一次。每周工作60小时\n周，一个月240个小时。\n\n我看到我的朋友们，他们也赚了不少钱，一年7万，但他们都在工作\n每天朝九晚五。还有更多...",
      "title": "我今年23岁，我终于赚到了我的第一个1万美元，我每周工作60个小时，这就是生活的真实写照吗？工作，支付，消费，重复。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是我有生以來第一次在一個月內賺這麼多錢。\n但與此同時，這也是我一生中工作最多的一次。每週工作60小時\n周，一個月240個小時。\n\n我看到我的朋友們，他們也賺了不少錢，一年7萬，但他們都在工作\n每天朝九晚五。還有更多...",
      "title": "我今年23歲，我終於賺到了我的第一個1萬美元，我每週工作60個小時，這就是生活的真實寫照嗎？工作，支付，消費，重複。"
    }
  ]
}