{
  "author": "dmack080288",
  "original_created_utc": 1633555685,
  "title": "Hold on to your (market) caps! BTC hits $1,000,000,000,000",
  "created_utc": 1633581117,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We&#39;re back guys and gals. Bitcoin hit that 1 trillion... Yes ONE TRILLION... Market cap today. We&#39;re back in business. Great start to Q4. Long may this run continue.</p>\n\n<p>We&#39;ve seen Shib rightly or wrongly go on a crazy run, dropping zero&#39;s like they&#39;re going out of fashion. DOGE making steady gains. It won&#39;t be long till the other alts start on this run.</p>\n\n<p>Excited to see what ETH does this quarter along with the guys down at ALGO.</p>\n\n<p>Bullish mood today. Good look everyone, hold on to your caps, it about to get real crazy.</p>\n\n<p>EDIT: A positive post about BTC hitting $1T market cap and it gets down voted. Enjoy your extra 0.00001 moon it gets you</p>\n</div><!-- SC_ON -->",
  "score": 184,
  "permalink": "/r/CryptoCurrency/comments/q2tycn/hold_on_to_your_market_caps_btc_hits_1000000000000/",
  "subreddit": "CryptoCurrency",
  "id": "q2tycn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "We're back guys and gals. Bitcoin hit that 1 trillion... Yes ONE TRILLION...\nMarket cap today. We're back in business. Great start to Q4. Long may this run\ncontinue.\n\nWe've seen Shib rightly or wrongly go on a crazy run, dropping zero's like\nthey're going out of fashion. DOGE making steady gains. It…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私たちは戻ってきました、男と女 ビットコインが1兆円を突破した...。そう1兆円...\n今日の時価総額です。我々はビジネスに戻った。第4四半期の素晴らしいスタートです。この勢いが続くように\n続くよ\n\n我々はShibが正しいか間違っているかに関わらず、狂ったように0を落としているのを見てきた。\n流行遅れのように0を落とすのを見てきました。DOGEは着実に利益を上げています。それは...",
      "title": "マーケット）キャップにしがみついてください BTCが1,000,000,000ドルに到達"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们回来了，伙计们，女士们。比特币达到了1万亿... 是的，一万亿...\n今天的市值。我们又开始营业了。第四季度的良好开端。愿这种运行\n继续下去。\n\n我们已经看到Shib正确地或错误地进行了一次疯狂的运行，下降了零，就像\n他们要过时了。DOGE取得了稳定的收益。它...",
      "title": "坚守你的（市场）上限! BTC达到1,000,000,000美元"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們回來了，夥計們，女士們。比特幣達到了1萬億... 是的，一萬億...\n今天的市值。我們又開始營業了。第四季度的良好開端。願這種運行\n繼續下去。\n\n我們已經看到Shib正確地或錯誤地進行了一次瘋狂的運行，下降了零，就像\n他們要過時了。DOGE取得了穩定的收益。它...",
      "title": "堅守你的（市場）上限! BTC達到1,000,000,000美元"
    }
  ]
}