{
  "author": "sssinc",
  "original_created_utc": 1635149726,
  "title": "What is the meaning when people say “99.99% the speed of light” instead of just speed of light?",
  "created_utc": 1635183154,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I hear this phrase a lot and it doesn’t make much sense to me.</p>\n\n<p>Since the speed of light is a big number, I know a lot can change in that last 0.01%, does something else significant happen when that transition is made?</p>\n\n<p>Also I know that in order to accelerate anything with mass to speed c, it would require infinite energy, but to accelerate to 0.9999c would that require finite energy?</p>\n</div><!-- SC_ON -->",
  "score": 122,
  "permalink": "/r/askscience/comments/qfbzwh/what_is_the_meaning_when_people_say_9999_the/",
  "subreddit": "askscience",
  "id": "qfbzwh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I hear this phrase a lot and it doesn’t make much sense to me.\n\nSince the speed of light is a big number, I know a lot can change in that last\n0.01%, does something else significant happen when that transition is made?\n\nAlso I know that in order to accelerate anything with mass to speed c, it…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この言葉はよく耳にしますが、私にはあまり意味がありません。\n\n光の速度は大きな数字なので、その最後の0.01%で多くのことが変わると思います。\n光速は大きな数字ですから、その最後の0.01%の間に多くのことが変化すると思いますが、その変化が起こるときに何か他の重要なことが起こるのでしょうか？\n\nまた、質量のあるものを速度cまで加速させるためには、...",
      "title": "ただの光速ではなく、「99.99%の光速」と言われるのはどういう意味ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我经常听到这句话，它对我来说没有什么意义。\n\n既然光速是一个大数字，我知道在这最后的0.01%里可以有很多变化。\n0.01%，那么在这一转变过程中是否会有其他重要的事情发生？\n\n我还知道，为了将任何有质量的东西加速到c速度，它...",
      "title": "当人们说 \"99.99%的光速 \"而不只是光速的时候，是什么意思？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我經常聽到這句話，它對我來說沒有什麼意義。\n\n既然光速是一個大數字，我知道在這最後的0.01%裏可以有很多變化。\n0.01%，那麼在這一轉變過程中是否會有其他重要的事情發生？\n\n我還知道，爲了將任何有質量的東西加速到c速度，它...",
      "title": "當人們說 \"99.99%的光速 \"而不只是光速的時候，是什麼意思？"
    }
  ]
}