{
  "author": "wpeironnet",
  "original_created_utc": 1645678645,
  "title": "Russia started bombing all over Ukraine | double digit dips all around crypto",
  "created_utc": 1645688162,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Russia started bombing weak spots all around Ukraine during sunrise. So that means there is a full scale war now in the country. That also means worldwide economic tensions caused by further supply chain shortages, war effort, and overall volatility from the unknown.&lt;/p&gt;\n\n&lt;p&gt;A reminder for crypto new comers who are getting absolutely pantsed and turned around right now. &lt;/p&gt;\n\n&lt;p&gt;Selling at a loss historically makes no sense. Overtime crypto and the overall stock market and real estate. It all bounces back.&lt;/p&gt;\n\n&lt;p&gt;Time in the market over timing it. Instead of thinking you know what’s gonna happen. Just buy some here and there. And in 2025 maybe we we all be better off for it.&lt;/p&gt;\n\n&lt;p&gt;All of that being said I’m so sorry if you live in Ukraine I cannot even imagine being a smaller country being brutally attacked by a large and vicious neighbor with no remorse.&lt;/p&gt;\n\n&lt;p&gt;Fight if you want, escape if you can. Russia kills civilians and supporters of anything western. Just a week ago the US exposed a list of Ukrainians Russians were to kill and put in camps after an invasion.&lt;/p&gt;\n\n&lt;p&gt;Please don’t think it cannot happen. Be safe and be smart. Fight hard the Russians are just people.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 327,
  "permalink": "/r/CryptoCurrency/comments/t02blf/russia_started_bombing_all_over_ukraine_double/",
  "subreddit": "CryptoCurrency",
  "id": "t02blf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Russia started bombing weak spots all around Ukraine during sunrise. So that\nmeans there is a full scale war now in the country. That also means worldwide\neconomic tensions caused by further supply chain shortages, war effort, and\noverall volatility from the unknown.\n\nA reminder for crypto new…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ロシアは日の出とともに、ウクライナ全土の弱点を爆撃し始めた。ということは\nつまり、今、国内では本格的な戦争が始まっているのです。それはまた、世界中で\nサプライチェーンの不足、戦時中の努力、そして経済的な緊張。\n未知による全体的なボラティリティ。\n\n暗号初心者のための備忘録...",
      "title": "ロシアがウクライナ全土で空爆を開始｜暗号は軒並み2桁台の下落に"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "俄罗斯在日出时开始轰炸乌克兰各地的薄弱点。所以这\n这意味着现在在该国有一场全面的战争。这也意味着全世界\n供应链的进一步短缺、战争的努力，以及未知的整体波动所造成的经济紧张。\n未知因素造成的整体波动。\n\n提醒加密货币新...",
      "title": "俄罗斯开始轰炸乌克兰全境"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "俄羅斯在日出時開始轟炸烏克蘭各地的薄弱點。所以這\n這意味着現在在該國有一場全面的戰爭。這也意味着全世界\n供應鏈的進一步短缺、戰爭的努力，以及未知的整體波動所造成的經濟緊張。\n未知因素造成的整體波動。\n\n提醒加密貨幣新...",
      "title": "俄羅斯開始轟炸烏克蘭全境"
    }
  ]
}