{
  "author": "SoupaSoka",
  "original_created_utc": 1629584886,
  "title": "I graphed whether the top 100 coins from 2016 increased/decreased in value and break down what happened if you invested in the top 5/10/25/50/100 or bottom 50 coins [Graphs + Data + Discussion + tl;dr]",
  "created_utc": 1629642735,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My other recent graph/data crypto posts:</p>\n\n<ol>\n<li><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/p8ao8r/i_graphed_how_many_bricks_and_moons_you_would/\">How many Bricks/Moons you&#39;d need to spend to buy lunch</a></li>\n<li><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/p6cvf8/this_is_what_1000_invested_5_years_ago_would_be/\">Comparing a 5-year investment in the top 5 crypto versus traditional investments</a></li>\n<li><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/p4ltdj/i_compared_the_change_in_value_of_the_top_10/\">YTD changes in top 10 coin market cap versus subreddit subscriber counts.</a></li>\n</ol>\n\n<p>Please check these posts out if you want some easy to read graphs and data; I plan to continue making these for the foreseeable future. Without further ado:</p>\n\n<h1>What did the top 100 cryptocurrencies by market cap look like in 2016?</h1>\n\n<p>As a note, I collected these data/rankings from a CoinMarketCap historical snapshot, and I found these coin&#39;s current prices on CMC first, or CoinGecko if I couldn&#39;t find them on CMC. If they showed up on neither website, I assumed the coin was worthless.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/7y35crbeesi71.jpg?width=347&amp;format=pjpg&amp;auto=webp&amp;s=ed6fc4c563ea9d9825edc6a9286004a2f16d69e6\">Fig. 1 - Top 100 coins by market cap in 2016.</a></p>\n\n<p><strong>Have you even heard of most of these coins?</strong> For real, I recognize maybe 25% of them, and I have been in the crypto realm since 2017.</p>\n\n<p>Bitcoin, at the top, had a market cap of around $10 B, while the #100 coin, Infinitecoin, had a market cap of around $420,000. For reference, a coin with a market cap of $420,000 today would be roughly rank #1,950 (BEER is that coin, if you&#39;re curious).</p>\n\n<p>Now, let&#39;s see how many coins lost value and how many coins gained value in the last five years.</p>\n\n<p><a href=\"https://preview.redd.it/mkdrbx8d1si71.jpg?width=808&amp;format=pjpg&amp;auto=webp&amp;s=2c4409518959004b186c13061971512128df8f28\">Fig. 2 - How many of the top 100 coins from 2016 increased or decreased in value in 2021.</a></p>\n\n<p>I really like this second figure, as it illustrates your odds of being profitable if you had only bought a single coin in 2016 and didn&#39;t sell it until today. You had a 53% chance of picking a coin that went up in value and a 46% chance of picking a coin that went down in value. Also, a 1% chance to pick Tether. So, a single pick would have been risky. I didn&#39;t graph these data, but I&#39;ll note that 9 of the top 10 coins from 2016 went up in value by today, with only STEEM losing 60% of its value.</p>\n\n<p>Now, let&#39;s look at how many coins increased in value in bins. This will give us a better idea of how much you&#39;d increase your investment depending on if you had a profitable coin or not.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/ewqi00n4csi71.jpg?width=900&amp;format=pjpg&amp;auto=webp&amp;s=49e10c0b8b0526fa6cb8841cece9b458d721b932\">Fig. 3 - A histogram showing \\&quot;bins\\&quot; of the top 100 coins, grouped by how much their value changed from 2016 to 2021.</a></p>\n\n<p>So, the first bin, ranging from 0% to 100%, had 47 coins. This is the same as the orange slice of the pie chart above plus Tether (which was flat, having exactly 100% of its value from 2016 in 2021). The other 46 coins in that first bin lost anywhere from 1% to 100% of their value in the last five years.</p>\n\n<p>To write out the above: 7 coins increased in value by 1%-100%, 6 coins increased in value by 101-200%, 1 coin increased in value by 300-400% (Peercoin, 311%, for those curious)... and what&#39;s really interesting is that 39 coins increased by at least 400%.</p>\n\n<p>What this means is that if you bought only one coin in 2016 and sold it today, you had a 47% chance to breakeven or lose money, you had a 14% chance to make a 1% to 300% profit, and you had a 39% chance to gain at least a 400% profit. This is basically a massive example of feast or famine, where you either lost your money or you made a 4x or greater gain with very little in-between.</p>\n\n<p>Now, let&#39;s say you&#39;re a wise person that doesn&#39;t YOLO into a single coin, but rather, divides up your investment based on arbitrary cutoffs and not emotional decisions. How would your money look today?</p>\n\n<p><a href=\"https://preview.redd.it/cr0bas3bdsi71.jpg?width=1017&amp;format=pjpg&amp;auto=webp&amp;s=9f0e0b1602f9d6436ebd0b3a3813389965314964\">Fig. 4 - How much would you gain if you had invested in subsets of the top 100 coins from 2016 and sold today?</a></p>\n\n<p>This is my favorite figure. Imagine this: you had X number of dollars in 2016 and you decided to split all that money up evenly across the top 5 coins only... you would be up 12,726% today.</p>\n\n<p>Top 10 only? 8,448% gain</p>\n\n<p>Top 25? 11,027% gain</p>\n\n<p>The BOTTOM 50 coins? You&#39;d <strong>still be up 2,133%</strong>. That&#39;s more than a 20x increase if you&#39;d evenly invested into the bottom 50 coins and didn&#39;t sell until today.</p>\n\n<p>For comparison, I added an S&amp;P500 index fund investment over the same 5 years - you&#39;d be up a very respectable (by stock market standards) 105% in only 5 years... which very, very much beats the average rate of return for the S&amp;P500 on a long-term historical basis. That still pales in comparison to even the worst-case investment of throwing money at the 50 bottom coins in my above example, returning less than 5% of what you would get with that bottom 50 investment plan.</p>\n\n<p><strong>Keep in mind:</strong> past performance neither guarantees or predicts future returns. If you invested in any of the above subsets right now and held for 5 years, you may or may not see similar results - I would only recommend people never invest more than they can afford to lose when it comes to cryptocurrencies.</p>\n\n<p>tl;dr: the top 100 coins on average did quite well, especially if you invested in more of them evenly rather than trying to pick 1-2 (although 9 of the top 10 increased dramatically).</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/CryptoCurrency/comments/p90ole/i_graphed_whether_the_top_100_coins_from_2016/",
  "subreddit": "CryptoCurrency",
  "id": "p90ole",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My other recent graph/data crypto posts:\n\n 1. How many Bricks/Moons you'd need to spend to buy lunch\n    [https://www.reddit.com/r/CryptoCurrency/comments/p8ao8r/i_graphed_how_many_bricks_and_moons_you_would/]\n 2. Comparing a 5-year investment in the top 5 crypto versus traditional\n    investments\n …",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の最近のグラフ/データ暗号の投稿を紹介します。\n\n 1. ランチを買うのにどれだけのレンガ/ムーンを使う必要があるか\n    [https://www.reddit.com/r/CryptoCurrency/comments/p8ao8r/i_graphed_how_many_bricks_and_moons_you_would/]\n 2. 上位5つの暗号への5年間の投資と伝統的な投資との比較\n    投資\n ...",
      "title": "2016年の上位100枚のコインの価値が上がったのか下がったのかをグラフ化し、上位5/10/25/50/100や下位50枚のコインに投資するとどうなるのかを分解してみた【グラフ＋データ＋ディスカッション＋tl;dr】。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近的其他图表/数据加密帖子。\n\n 1. 你需要花多少砖块/摩纳哥来买午餐？\n    [https://www.reddit.com/r/CryptoCurrency/comments/p8ao8r/i_graphed_how_many_bricks_and_moons_you_would/]\n 2. 2.比较前5名加密货币与传统货币的5年投资。\n    投资\n ...",
      "title": "我绘制了2016年前100名硬币的价值是否增加/减少的图表，并分解了如果你投资前5/10/25/50/100或后50名硬币的情况[图表+数据+讨论+tl;dr] 。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近的其他圖表/數據加密帖子。\n\n 1. 你需要花多少磚塊/摩納哥來買午餐？\n    [https://www.reddit.com/r/CryptoCurrency/comments/p8ao8r/i_graphed_how_many_bricks_and_moons_you_would/]\n 2. 2.比較前5名加密貨幣與傳統貨幣的5年投資。\n    投資\n ...",
      "title": "我繪製了2016年前100名硬幣的價值是否增加/減少的圖表，並分解了如果你投資前5/10/25/50/100或後50名硬幣的情況[圖表+數據+討論+tl;dr] 。"
    }
  ]
}