{
  "author": "HotRabbit999",
  "original_created_utc": 1626937718,
  "title": "Where did office workers in the 19th Century go to the bathroom?",
  "created_utc": 1626962766,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I&#39;m reading a lot of Dickens at the moment, and one thing that stands out is the amount of office work that is done by main characters. However, one thing that&#39;s bugging me is the lack of toilets or commentary on sanitary habits. Did office workers in the 19th Century just go &quot;excuse me boss I need to urinate&quot; and go into the street to do it?   </p>\n\n<p>As my office bathrooms are like 30 seconds from my desk I would hate to have to go down a few flights of stairs to the street or ground level to take a leak - seems massively inefficient to me and a waste of the working day.</p>\n</div><!-- SC_ON -->",
  "score": 109,
  "permalink": "/r/AskHistorians/comments/op8s2m/where_did_office_workers_in_the_19th_century_go/",
  "subreddit": "AskHistorians",
  "id": "op8s2m",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So I'm reading a lot of Dickens at the moment, and one thing that stands out is\nthe amount of office work that is done by main characters. However, one thing\nthat's bugging me is the lack of toilets or commentary on sanitary habits. Did\noffice workers in the 19th Century just go \"excuse me boss I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今、ディケンズの本をたくさん読んでいるのですが、その中でも特に目につくのが\n主人公たちのオフィスワークの多さですね。しかし、ひとつ気になることがあります。\nトイレがないこと、衛生的な習慣についてのコメントがないことが気になっています。19世紀のオフィスワーカーは\n19世紀のオフィスワーカーは、「すみません、ボス......」という感じだったのでしょうか。",
      "title": "19世紀のオフィスワーカーはどこでトイレに行っていたのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，我目前正在阅读大量的狄更斯作品，其中一个突出的问题是\n主要人物所做的大量办公室工作。然而，有一件事\n困扰我的是缺乏厕所或对卫生习惯的评论。难道\n19世纪的上班族只是说 \"对不起，老板，我......\"。",
      "title": "19世纪的上班族在哪里上厕所？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，我目前正在閱讀大量的狄更斯作品，其中一個突出的問題是\n主要人物所做的大量辦公室工作。然而，有一件事\n困擾我的是缺乏廁所或對衛生習慣的評論。難道\n19世紀的上班族只是說 \"對不起，老闆，我......\"。",
      "title": "19世紀的上班族在哪裏上廁所？"
    }
  ]
}