{
  "author": "a-s-q",
  "the_new_excerpt": "Hey everyone. Everyone's got their eyes on meme stocks, but I have been working\non this long thesis for a while and I wanted to share it as this company's\nearnings are on Feb 4. With that being said:\n\nTl;dr: Propane demand is at a multi-year high due to outdoor dining and\nhoarding. Suburban Propane…",
  "original_created_utc": 1611938487,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "嘿，大家好。每个人都把目光投向了追忆股，但我一直在研究\n在这篇长篇论文上，我想分享一下，作为这家公司的\n盈利是在2月4日。说了这么多。\n\n丙烷需求量处于多年来的高位，因为户外餐饮和...\n囤积。郊区丙烷...",
      "title": "丙烷是新的卫生纸，你可以用$SPH来换。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嘿，大家好。每個人都把目光投向了追憶股，但我一直在研究\n在這篇長篇論文上，我想分享一下，作爲這家公司的\n盈利是在2月4日。說了這麼多。\n\n丙烷需求量處於多年來的高位，因爲戶外餐飲和...\n囤積。郊區丙烷...",
      "title": "丙烷是新的衛生紙，你可以用$SPH來換。"
    }
  ],
  "title": "Propane is the new toilet paper and you can trade it with $SPH",
  "created_utc": 1611946599,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey everyone. Everyone&#39;s got their eyes on meme stocks, but I have been working on this long thesis for a while and I wanted to share it as this company&#39;s earnings are on Feb 4. With that being said:</p>\n\n<p><strong>Tl;dr: Propane demand is at a multi-year high due to outdoor dining and hoarding. Suburban Propane Partners ($SPH) represents a massive opportunity as the stock price has stayed flat among the rapid hike in demand. This is a sleepy company and Wall Street has overlooked these developments. The company reports earnings on Feb 4 before market open. I believe call options represent the best risk/reward for this overlooked stock.</strong></p>\n\n<p><em>Disclosure: I am bullish on SPH and hold a large position in call options. This trade thesis is for entertainment purposes only! I am not an investment advisor. Please do your own research and seek professional investment advice for your portfolio. None of the following statements should be interpreted as financial advice or investment recommendations.</em></p>\n\n<p>In August of 2020, I released a document outlining a propane consumption trend, following the outbreak of COVID-19 in the U.S as well as the record natural disasters in 2020. I highlighted Suburban Propane Partners as the most effective trade in the space. I bought call options and sold several months later for 16x my original investment, moving on to new trading opportunities.</p>\n\n<p>Last time I released research on this trade, a lot of people requested more detailed information on what specific trades I made. I hold no shares, however, I&#39;ve included the six options contracts that I am purchasing. I am playing the February and May earnings reports. Please do not follow my trades. Again, do your own research. I am not a financial advisor and this is not financial advice!</p>\n\n<p><strong>Last Quarter&#39;s Earnings</strong>  </p>\n\n<p><em>$17.50 Calls for Feb. 19th</em></p>\n\n<p><em>$20 Calls for Feb. 19th</em>*</p>\n\n<p><strong>This Quarter&#39;s Earnings</strong></p>\n\n<p><em>$17.5 Calls for May 21st</em></p>\n\n<p><em>$20 Calls for May 21st</em></p>\n\n<p><em>$22.5 Calls for May 21st</em></p>\n\n<p><em>$25 Calls for May 21st</em></p>\n\n<p>This stock has a low float and low daily volumes which influenced my decision to play this with calls.</p>\n\n<p>Due to COVID, <strong>outdoor dining has caused an explosive demand for propane patio heaters and fire pits,</strong> which are still backordered with many retailers for the next month and have been extremely difficult to get since September. This has created a panic in the propane market and has many businesses and home owners desperately attempting to <strong>buy and store as much propane as they can</strong>. After experiencing shortages of toilet paper, hand sanitizer, masks, meat, and other goods last year, it appears that consumers are afraid of going without heat this winter. This is adding to the panic and creating a self-fulfilling prophecy, <strong>as a normal supply of propane meets an abnormally high demand.</strong></p>\n\n<p>Here we can see that <a href=\"https://tradingeconomics.com/commodity/propane\">propane prices ramped up this winter</a>, but Suburban&#39;s <a href=\"https://i.imgur.com/DenAOXe.png\">share price has stayed put around $15.00</a>.</p>\n\n<p><strong>Residential consumers in a number of areas have been experiencing a propane shortage</strong>, even when their tanks are on an auto-refill schedule with their distributor. As a result, complaints are skyrocketing and in some states legislators have even been forced to get involved. However, this <strong>crisis is only being reported on by local and regional news outlets</strong>. The mainstream media is ignoring this crisis in the propane market. They are most likely trying to avoid another hoarding situation, like the toilet paper, hand sanitizer, and mask crises last year, by keeping the shortage as quiet as possible. <strong>As a result, this crisis is currently flying under Wall Street&#39;s radar. I believe that will change when SPH reports earnings on Feb 4th.</strong></p>\n\n<p>Let&#39;s take a quick look at the facts. <strong>Wall Street projects earnings for SPH will be 14% lower than the same quarter last year and the stock price is 33% lower than the same time in January 2020.</strong> However, Suburban Propane has <strong>beat analyst projections in both of the last two quarters.</strong> The next two earnings reports are usually the best two quarters because of the <strong>cold weather</strong>. However, I believe the outdoor dining trend has created an unusually large demand for commercial propane this year, which is fueling the panic causing a shortage, so these two winter quarters could do exceptionally well. Wall Street analysts place the fair value of the stock at $19.33, which is 21% above the current stock price of $15.00.</p>\n\n<p>All the social data I have collected indicates consumers are buying propane at record levels. Earnings for the months of October-December will be released on Feb 4th. Based on my research, I am expecting <strong>earnings to outperform Wall Street&#39;s projections for the 3rd time in the last year.</strong> If <strong>earnings merely equal last year&#39;s results for this same quarter, they will beat projections by 14%!</strong> But, all signs are pointing to a much <strong>stronger propane market</strong> than last year (just look at the price of propane), so I am <strong>expecting earnings to beat projections</strong> by much more than 14%. Furthermore, I see no signs of these trends changing any time soon. I am predicting the price will return to the 2020 price levels in the mid $20&#39;s range, by or before May 2021. I am ALL IN on call options for February and May!</p>\n\n<p>Suburban Propane is rapidly becoming the market leader in <strong>clean propane</strong>. While propane is the cleanest fossil fuel, it does still produce some emissions. However, a chemical called rDME can reduce propane emissions to almost nothing because rDME actually has a net negative carbon footprint! Last fall, Suburban Propane purchased a 39% stake in Oberon Fuels, which is a large producer of rDME. In light of the <strong>clean energy agenda of the new administration, I believe this is a hugely significant development for SPH that will position it as perhaps the only fossil fuel company with a clean energy focus.</strong> In addition, on January 26th, Suburban Propane registered a <strong>new logo</strong> with the US Patent Office, using a green leaf instead of their former red logo. <a href=\"https://imgur.com/ae0d502d-8835-49de-8771-ffe6d3856fb0\">Along with the slogan &quot;Go green with Suburban Propane.&quot;</a> Clearly, this is one fossil fuel company that takes the clean energy agenda very seriously. I believe this bodes well for SPH over the next few years.</p>\n\n<p>As you will see from the samples below, I have surfaced quite a bit of chatter from various social sites, proving there is a very <strong>real nationwide shortage of propane</strong>. Over the past five years, google searches for propane have been in a steady uptrend, but COVID has rapidly accelerated this trend and certain propane related search terms are showing extremely high search volume.</p>\n\n<p><a href=\"https://www.notion.so/image/https%3A%2F%2Fs3-us-west-2.amazonaws.com%2Fsecure.notion-static.com%2F386dd41c-862a-4c14-8dde-1c1e3bf5ba24%2FUntitled.png?table=block&amp;id=29479a39-e5f8-4e1e-827e-5a9d4a8c1e58&amp;spaceId=8441ab4b-6bb2-44cf-8103-5b55007fc65a&amp;width=2910&amp;userId=0f4b53ea-8b14-4c7b-9003-18e09e653c4b&amp;cache=v2\">Google Trends &quot;propane near me&quot;</a></p>\n\n<p><a href=\"https://www.notion.so/image/https%3A%2F%2Fs3-us-west-2.amazonaws.com%2Fsecure.notion-static.com%2F31f14aa6-49e7-4d26-afe7-c92088d2ffc9%2FUntitled.png?table=block&amp;id=978eb3cc-41be-42b9-8359-e3eb1de318d6&amp;spaceId=8441ab4b-6bb2-44cf-8103-5b55007fc65a&amp;width=2910&amp;userId=0f4b53ea-8b14-4c7b-9003-18e09e653c4b&amp;cache=v2\">Google Trends &quot;suburban propane&quot;</a></p>\n\n<p><a href=\"https://www.notion.so/image/https%3A%2F%2Fs3-us-west-2.amazonaws.com%2Fsecure.notion-static.com%2F4adf5eac-24be-43ec-9678-d06450592405%2FUntitled.png?table=block&amp;id=f3415002-e702-4d25-a492-30ffce0c90b2&amp;spaceId=8441ab4b-6bb2-44cf-8103-5b55007fc65a&amp;width=2910&amp;userId=0f4b53ea-8b14-4c7b-9003-18e09e653c4b&amp;cache=v2\">Google Trends &quot;propane supply&quot;</a></p>\n\n<p><a href=\"https://www.notion.so/image/https%3A%2F%2Fs3-us-west-2.amazonaws.com%2Fsecure.notion-static.com%2F2cab00e3-6920-437d-9e6c-5912e7890f08%2FUntitled.png?table=block&amp;id=066d4524-d9d2-4524-81bd-d56eb1bc9823&amp;spaceId=8441ab4b-6bb2-44cf-8103-5b55007fc65a&amp;width=1510&amp;userId=0f4b53ea-8b14-4c7b-9003-18e09e653c4b&amp;cache=v2\">Tweets referencing propane shortages</a> and <a href=\"https://imgur.com/9ae1902d-63d6-40e2-afd1-67c441582c53\">more</a> (see the notion document for more)</p>\n\n<p><a href=\"https://www.notion.so/image/https%3A%2F%2Fs3-us-west-2.amazonaws.com%2Fsecure.notion-static.com%2Fdecbe6e1-3db2-401e-8e57-45ee7b613da2%2FUntitled.png?table=block&amp;id=1dd6060d-371d-4cc2-af69-12411f051a45&amp;spaceId=8441ab4b-6bb2-44cf-8103-5b55007fc65a&amp;width=1520&amp;userId=0f4b53ea-8b14-4c7b-9003-18e09e653c4b&amp;cache=v2\">Evidence of hoarding</a></p>\n\n<p>I could go on and on (<a href=\"https://i.imgur.com/YKXa8ye.png\">seriously</a>), but if you are interested please check out the full trade thesis below which includes all of the sources and more evidence related to the propane shortage happening today. Please ask questions and let me know what you all think, it helps everyone build a better thesis.</p>\n\n<hr/>\n\n<p><strong>The full thesis and sources:</strong></p>\n\n<p><a href=\"https://www.notion.so/Propane-Is-The-New-Toilet-Paper-caf185ada9fe4199a08f610a1be68238\">https://www.notion.so/Propane-Is-The-New-Toilet-Paper-caf185ada9fe4199a08f610a1be68238</a></p>\n</div><!-- SC_ON -->",
  "score": 654,
  "permalink": "/r/investing/comments/l7x71g/propane_is_the_new_toilet_paper_and_you_can_trade/",
  "subreddit": "investing",
  "id": "l7x71g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518532618
}