{
  "author": "Pheer777",
  "the_new_excerpt": "Lately I've been having a bit of an existential crisis/rut and so I've been\ntrying to seek concrete answers to moral/legal questions that I've been\nwondering about (mostly in regard to politics)\n\nEven though science and mathematics use language and visual symbolism that is\ncreated by man, it seems…",
  "original_created_utc": 1618009770,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、私はちょっとした実存的な危機/わだかまりを抱えていて、そのため、私がこれまでに経験した道徳的/法的な疑問に対する具体的な答えを求めようとしています。\n疑問に思っていた道徳的・法的な問題に具体的な答えを求めようとしています。\n疑問に思っていた道徳的・法律的な問題に具体的な答えを求めようとしています（主に政治に関して）。\n\n科学や数学は人間が作った言語や視覚的な記号を使っているのに\n科学や数学は人間が作った言語や視覚的な記号を使っていますが、どうも",
      "title": "哲学は、科学のように、正しい単一の「グランド・セオリー」を構築するものなのか、それとも思考の枝分かれを競うものなのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近我一直有点生存危机/困境，所以我一直在\n试图为我一直以来的道德/法律问题寻求具体答案。\n想不通\n\n尽管科学和数学使用的语言和视觉符号是\n人类创造的",
      "title": "哲学和科学一样，是建立在任何正确的、单一的 \"大理论 \"上，还是只是思想的竞争分支？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近我一直有點生存危機/困境，所以我一直在\n試圖爲我一直以來的道德/法律問題尋求具體答案。\n想不通\n\n儘管科學和數學使用的語言和視覺符號是\n人類創造的",
      "title": "哲學和科學一樣，是建立在任何正確的、單一的 \"大理論 \"上，還是隻是思想的競爭分支？"
    }
  ],
  "title": "Is philosophy, like science, building up to any correct, singular \"grand theory\" or is it just competing branches of thought?",
  "created_utc": 1618055002,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Lately I&#39;ve been having a bit of an existential crisis/rut and so I&#39;ve been trying to seek concrete answers to moral/legal questions that I&#39;ve been wondering about (mostly in regard to politics)</p>\n\n<p>Even though science and mathematics use language and visual symbolism that is created by man, it seems like there are pretty objective, verifiable elements of reality that are &quot;uncovered&quot; in the study of mathematics and various fields of hard sciences.</p>\n\n<p>Does philosophy, be it political or moral, have any sort of identifiable progress in which various lines of thought reach a &quot;dead end&quot; in terms of their logical validity and are eliminated, like Lamarckian vs. Darwinian evolution, and others continue? Will the &quot;Book of Philosophy&quot; ever been closed and done?</p>\n\n<p>Part of why I ask is honestly fairly selfish and stems from my aforementioned existential rut - I tend to lean pretty libertarian/pro business and for whatever reason, my mind has just been unable to stop thinking about the concept of theft and stealing being wrong or not. The Lockean Proviso isn&#39;t particularly convincing to me, so I&#39;m inclined to believe that property and/or human rights in general are more an emergent phenomenon of social development - so If killing people is socially permissible in some faraway culture, it becomes a fundamental part of their moral framework, as morality can&#39;t really exist outside of the web of social relations people form.</p>\n\n<p>Anyway, the above is just one example of the thought process I&#39;ve been having. As it stands, from a philosophical standpoint, it really just looks like to me that whatever moral/political viewpoint someone takes is basically just a personality choice, and philosophy is used retroactively to justify their opinion - I&#39;d love for someone to convince me otherwise.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/askphilosophy/comments/mnszju/is_philosophy_like_science_building_up_to_any/",
  "subreddit": "askphilosophy",
  "id": "mnszju",
  "is_self": true,
  "media": null,
  "is_video": false
}