{
  "author": "Watchfrogg1",
  "the_new_excerpt": "If Bitcoin is ever going to be adopted into the mainstream, there needs to be an\neasier way to store it safely and with peace of mind. We on this subreddit love\nto hate the exchanges, and the not-your-keys-not-your-bitcoin sentiment is\nexactly right, but it's also discouraging to newcomers. And if…",
  "original_created_utc": 1610492595,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "如果比特币要进入主流市场，需要有一个。\n更容易的方式来安全和安心地存储它。我们在这个子reddit爱\n来痛恨交易所，而不是你的钥匙不是你的比特币的情绪是\n完全正确，但这也让新人望而却步。而如果...",
      "title": "需要有一种更简单的方式来存储比特币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果比特幣要進入主流市場，需要有一個。\n更容易的方式來安全和安心地存儲它。我們在這個子reddit愛\n來痛恨交易所，而不是你的鑰匙不是你的比特幣的情緒是\n完全正確，但這也讓新人望而卻步。而如果...",
      "title": "需要有一種更簡單的方式來存儲比特幣。"
    }
  ],
  "title": "There needs to be an easier way to store Bitcoin",
  "created_utc": 1610549827,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If Bitcoin is ever going to be adopted into the mainstream, there needs to be an easier way to store it safely and with peace of mind. We on this subreddit love to hate the exchanges, and the not-your-keys-not-your-bitcoin sentiment is exactly right, but it&#39;s also discouraging to newcomers. And if we want adaptation, and a value proposition via supply and demand, we want newcomers. I&#39;m a millennial keeping my crypto in cold storage, but every time I make a transfer I am terrified of making a typo and of points of failure. I use an authenticator key. I&#39;m doing everything right and I still don&#39;t have peace of mind, a lot of that is in fear of my own human error, as well as points of failure even though I don&#39;t have a single one. To newcomers, terms like seeds, 24 word phrases, cold storage, hot wallets, entropy, the list goes on... that&#39;s all super daunting. </p>\n\n<p>When we make transactions with equity trades, bank transfers, and credit and debt purchases we have no fear because regulation gives us the confidence that any attacks will be reimbursed. </p>\n\n<p>I don&#39;t have the solutions to the problems I am pointing out here, but wondering what everyone else thinks. We want to retail investors for our own sake, and because we believe its genuinely good for them to get into crypto to, but we have to acknowledge that it is not at all easy once you get passed the volatility and risk of the markets.</p>\n\n<p>What needs to happen? More regulation? More faith in the exchanges? New exchanges? Longterm proven success of Blockfi?</p>\n</div><!-- SC_ON -->",
  "score": 206,
  "permalink": "/r/Bitcoin/comments/kw33x2/there_needs_to_be_an_easier_way_to_store_bitcoin/",
  "subreddit": "Bitcoin",
  "id": "kw33x2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706373031
}