{
  "author": "JuicySpark",
  "original_created_utc": 1624766345,
  "title": "I treat my Cryptos like I treat my wife.",
  "created_utc": 1624797304,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I hold onto that shit. </p>\n\n<p>It&#39;s always there for me when I need it.  I just open my wallet and bam!  Always there.  No shady business either.  I don&#39;t see anyone sneaking in trying to get a piece of that.   </p>\n\n<p>The exact amount is there.  My cryptos are loyal as FK.     So I treat them like I treat my wife.     </p>\n\n<ul>\n<li>I check up to see how they are doing.</li>\n<li>If they need some more money, I give out a little</li>\n<li>I don&#39;t cheat, and sell off for other cryptos</li>\n</ul>\n\n<p>I love my cryptos.   </p>\n\n<p>If they moon past my wife&#39;s net worth then they can be my wife too.   I don&#39;t see why not.</p>\n</div><!-- SC_ON -->",
  "score": 169,
  "permalink": "/r/CryptoCurrency/comments/o8pmwi/i_treat_my_cryptos_like_i_treat_my_wife/",
  "subreddit": "CryptoCurrency",
  "id": "o8pmwi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I hold onto that shit.\n\nIt's always there for me when I need it. I just open my wallet and bam! Always\nthere. No shady business either. I don't see anyone sneaking in trying to get a\npiece of that.\n\nThe exact amount is there. My cryptos are loyal as FK. So I treat them like I\ntreat my wife.\n\n * I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はそのクソを保持しています。\n\n必要な時にはいつもそばにいてくれる。財布を開けると、バーン！いつも\nある。怪しいビジネスもない。誰かがこっそりと、この商品を手に入れようとしているのを見たことがありません。\n密かに手に入れようとする人はいません。\n\n正確な金額がそこにある。私のクリプトはFKとして忠実です。だから、私は彼らを妻に接するように\n私の妻を扱うように。\n\n * I...",
      "title": "私は自分の妻に接するように、自分のクリプトを扱っています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我紧紧抓住这些东西。\n\n当我需要的时候，它总是在我身边。我只是打开我的钱包，砰！总是在那里。\n在那里。也没有阴暗的生意。我没有看到任何人偷偷摸摸地试图得到一个\n一块的。\n\n确切的数额就在那里。我的加密货币像FK一样忠诚。所以我对待他们就像我\n对待我的妻子。\n\n * I...",
      "title": "我对待我的加密货币就像对待我的妻子一样。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我緊緊抓住這些東西。\n\n當我需要的時候，它總是在我身邊。我只是打開我的錢包，砰！總是在那裏。\n在那裏。也沒有陰暗的生意。我沒有看到任何人偷偷摸摸地試圖得到一個\n一塊的。\n\n確切的數額就在那裏。我的加密貨幣像FK一樣忠誠。所以我對待他們就像我\n對待我的妻子。\n\n * I...",
      "title": "我對待我的加密貨幣就像對待我的妻子一樣。"
    }
  ]
}