{
  "author": "IntellectualFerret",
  "original_created_utc": 1625272970,
  "title": "When and why did the general political tone of American country music shift from left-wing to right-wing?",
  "created_utc": 1625281605,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m not sure if this is even objectively true, but I listen to a lot of country music and I’ve noticed in the latter half of the 20th century, any political notes usually were left leaning. Steve Earle, Johnny Cash, Willie Nelson, John Prine, all were considered pioneers of progressivism and at least one was a self-declared socialist. However modern country music seems to be overwhelmed by the “America fuck yeah” type of country, thinking Luke Bryan, Florida Georgia Line, etc. While left-leaning country still exists (Jason Isbell and Steve Earle for example), it seems like there’s been a tone shift between 1960 and today. Why is that, and when did the shift occur? If I had to guess I’d say around 9/11 so I don’t think this violates rule 8.</p>\n</div><!-- SC_ON -->",
  "score": 167,
  "permalink": "/r/AskHistorians/comments/ocnhum/when_and_why_did_the_general_political_tone_of/",
  "subreddit": "AskHistorians",
  "id": "ocnhum",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m not sure if this is even objectively true, but I listen to a lot of country\nmusic and I’ve noticed in the latter half of the 20th century, any political\nnotes usually were left leaning. Steve Earle, Johnny Cash, Willie Nelson, John\nPrine, all were considered pioneers of progressivism and at…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これが客観的に正しいかどうかはわかりませんが、私はカントリーミュージックをよく聴きます。\n20世紀後半には、政治的な内容の曲はたいてい左寄りだったと思います。\nの音はたいてい左に傾いていました。スティーブ・アール、ジョニー・キャッシュ、ウィリー・ネルソン、ジョン・プリン......。\nPrineなどが進歩主義の先駆者とされていますが、これらはすべて...",
      "title": "アメリカのカントリーミュージックの政治色が左翼から右翼へと変化したのはいつ、なぜでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不确定这是否是客观事实，但我听过很多乡村音乐。\n我注意到，在20世纪后半叶，任何政治音符都是左倾的。\n笔记通常都是左倾的。史蒂夫-厄尔、约翰尼-卡什、威利-尼尔森、约翰\n普林，都被认为是进步主义的先驱者，而且在...",
      "title": "美国乡村音乐的总体政治基调何时以及为何从左翼转变为右翼？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不確定這是否是客觀事實，但我聽過很多鄉村音樂。\n我注意到，在20世紀後半葉，任何政治音符都是左傾的。\n筆記通常都是左傾的。史蒂夫-厄爾、約翰尼-卡什、威利-尼爾森、約翰\n普林，都被認爲是進步主義的先驅者，而且在...",
      "title": "美國鄉村音樂的總體政治基調何時以及爲何從左翼轉變爲右翼？"
    }
  ]
}