{
  "author": "appolomustdie",
  "the_new_excerpt": "If you ever met CANCER you must know how tough it is, tough to fight with it,\ntough to watch how your beloved struggle and sometimes the only thing that can\nhelp is chemo!\n\nBut chemo also not easy to go through, thats why you need to know about G1\nTherapeutics and Cosela!\n$GTHX - G1 Therapeutics\n\n *…",
  "original_created_utc": 1620124199,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もしあなたが癌に出会ったことがあれば、それがどれほど過酷なものか知っているはずです。\n最愛の人が苦しんでいるのを見るのも辛く、時には助けになるのが化学療法だけということもあります。\n化学療法です。\n\nしかし、化学療法も簡単ではありません。だからこそ、G1セラピューティクスとCoselaを知る必要があるのです。\nセラピューティクスとコセラを知ってください\nGTHX - G1セラピューティクス\n\n *...",
      "title": "オンコロジーの未来を担うG1セラピューティクス!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你遇到过癌症，你一定知道它是多么艰难，与它斗争的艰难。\n艰难地看着你所爱的人如何挣扎，有时唯一能帮助的就是\n是化疗!\n\n但化疗也不是那么容易经历的，这就是为什么你需要了解G1\nTherapeutics和Cosela!\n$GTHX - G1 Therapeutics\n\n *...",
      "title": "G1治疗法是肿瘤学的未来!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你遇到過癌症，你一定知道它是多麼艱難，與它鬥爭的艱難。\n艱難地看着你所愛的人如何掙扎，有時唯一能幫助的就是\n是化療!\n\n但化療也不是那麼容易經歷的，這就是爲什麼你需要了解G1\nTherapeutics和Cosela!\n$GTHX - G1 Therapeutics\n\n *...",
      "title": "G1治療法是腫瘤學的未來!"
    }
  ],
  "title": "G1 Therapeutics as a future of oncology!",
  "created_utc": 1620127324,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If you ever met CANCER you must know how tough it is, tough to fight with it, tough to watch how your beloved struggle and sometimes the only thing that can help is chemo!</p>\n\n<p>But chemo also not easy to go through, thats why you need to know about G1 Therapeutics  and Cosela!<br/>\n$GTHX - G1 Therapeutics </p>\n\n<ul>\n<li><strong>G1 Therapeutics&#39; first in class drug Cosela against most common side effect of chemotherapy - myelosuppression was recently approved by FDA and, no doubt, has a blockbuster potential.</strong></li>\n<li><strong>Management has positioned the company to succeed in their commercialization efforts - researches, clinical trials and approval process passed smoothly.</strong></li>\n<li><strong>On March 2021 COSELA was Added to Both the NCCN Treatment Guidelines for Small Cell Lung Cancer and the NCCN Supportive Care Guidelines for Hematopoietic Growth Factors it will definitely boost it&#39;s sales.</strong></li>\n<li><strong>Massive sell-off after FDA approval has created a buying opportunity in the stock.</strong></li>\n</ul>\n\n<p>Investing in a start-up biotech company is an absolute roller coaster -clinical trials can both bring highs and lows but not in G1 Therapeutics case, beacuse it&#39;s key drug COSELA™ (trilaciclib) has been approved by FDA at 02.12.2021. Simple profit taking has snowballed into a huge sell-off, with the stock dropping more than 40%.So, <em>COSELA is the only FDA-approved therapy that helps proactively deliver multilineage myeloprotection to patients with</em> <strong><em>extensive-stage small cell lung cancer</em></strong> <em>being treated with chemotherapy. Myeloprotective efficacy of COSELA resulted in reductions in the incidence and duration of severe neutropenia, and impacted anemia and the need for rescue interventions such as growth factors and red blood cell transfusions. M</em>yelosuppression is the most serious and life-threatening side effect of chemotherapy, or damage to the bone marrow, resulting in reduced white blood cells, red blood cells and platelets. Chemotherapy-induced myelosuppression may lead to increased risks of infection, severe anemia, and/or bleeding. These complications impact patients’ quality of life and may also result in chemotherapy dose reductions and delays. To date, approaches have included the use of growth factor agents to accelerate blood cell recovery after the bone marrow injury has occurred, along with antibiotics and transfusions as needed.</p>\n\n<p>By contrast, trilaciclib provides the first proactive approach to myelosuppression through a unique mechanism of action that helps protect the bone marrow from damage by chemotherapy. In the U.S., approximately 30,000 small cell lung cancer patients are treated annually.Cosela’s price has been set at $1,417 per vial. G1 estimates that treatment will average roughly $34,000 per patient. Running the numbers by management’s estimates of treatable patients gets us to peak sales estimates of around $1 billion per year.</p>\n\n<p>On June 2020, G1 announced a three-year co-promotion agreement with Boehringer Ingelheim (biggest private owned pharmaceutical company) for COSELA in small cell lung cancer in the U.S. and Puerto Rico. G1 will lead marketing, market access and medical engagement initiatives for COSELA. The Boehringer Ingelheim oncology commercial team, well-established in lung cancer, will lead sales force engagement initiatives. First sales data will be released on 5 may. G1 consensus price target is about 50$ per share (as of April 30, 2021, the price is 21,07$), at 04.09.21 Needham &amp; Company LLC sticked to their buy rating with p.t. of 68$, which is three-times higher, than the current price.</p>\n\n<p><strong><em>However, the stock is currently undervalued against peak sales for only one of its usages, and I feel that commercial success in the next few quarters will bring a revaluation in the stock price. Management has itself positioned right and has the right group of leaders to really make a name for Cosela, as well as make G1 a market darling over the next few years.The Company expects its current financial position to be sufficient to fund its operations and capital expenditures into 2023.</em></strong></p>\n\n<p>The company is also not a one trick pony, as Cosela is undergoing multiple other clinical trials in different cancers with larger addressable markets. G1 also has another compound in clinical trials called Rintodestrant, an oral SERD that it expects phase 2 data on in the second quarter of 2021.</p>\n\n<p>And the latests news:</p>\n\n<p>BCBSNC will provide coverage for trilaciclib(Cosela)when it is determined to be medically necessary because the medical criteria and guidelines noted below are met![<a href=\"https://www.bluecrossnc.com/sites/default/files/document/attachment/services/public/pdfs/medicalpolicy/trilaciclib%5C_cosela.pdf%5D(https://www.bluecrossnc.com/sites/default/files/document/attachment/services/public/pdfs/medicalpolicy/trilaciclib_cosela.pdf)\">https://www.bluecrossnc.com/sites/default/files/document/attachment/services/public/pdfs/medicalpolicy/trilaciclib\\_cosela.pdf](https://www.bluecrossnc.com/sites/default/files/document/attachment/services/public/pdfs/medicalpolicy/trilaciclib_cosela.pdf)</a></p>\n\n<p>Anthem California insurance plans to use Cosela <a href=\"https://www.anthem.com/ca/ms/pharmacyinformation/Cosela.pdf\">https://www.anthem.com/ca/ms/pharmacyinformation/Cosela.pdf</a></p>\n\n<p>National Comprehensive Cancer Network guidelines for SCLC - Cosela included <a href=\"https://www.nccn.org/guidelines/guidelines-detail?category=1&amp;id=1462\">https://www.nccn.org/guidelines/guidelines-detail?category=1&amp;id=1462</a></p>\n\n<p>Oregon Health Authority approves Cosela with recomendation from NCCN guidelines<a href=\"https://www.oregon.gov/oha/HSD/OHP/Tools/Oregon%20Medicaid%20PA%20Criteria,%20May%201,%202021.pdf\">https://www.oregon.gov/oha/HSD/OHP/Tools/Oregon%20Medicaid%20PA%20Criteria,%20May%201,%202021.pdf</a></p>\n\n<p>Memorial Sloan Kettering Cancer Center recommends Cosela as cancer care treatment<a href=\"https://www.mskcc.org/cancer-care/patient-education/trilaciclib\">https://www.mskcc.org/cancer-care/patient-education/trilaciclib</a></p>\n\n<p>News from ChinaMain partner of G1 Therapeutics in China - Simcere plans to focus on oncology sector![<a href=\"http://www.thebambooworks.com/drug-maker-simcere-ditches-cell-therapy-to-focus-on-oncology/%5D(http://www.thebambooworks.com/drug-maker-simcere-ditches-cell-therapy-to-focus-on-oncology/)\">http://www.thebambooworks.com/drug-maker-simcere-ditches-cell-therapy-to-focus-on-oncology/](http://www.thebambooworks.com/drug-maker-simcere-ditches-cell-therapy-to-focus-on-oncology/)</a></p>\n</div><!-- SC_ON -->",
  "score": 119,
  "permalink": "/r/investing/comments/n4l1ye/g1_therapeutics_as_a_future_of_oncology/",
  "subreddit": "investing",
  "id": "n4l1ye",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380966987
}