{
  "author": "pieceofshitzo",
  "the_new_excerpt": "Are all able to be used for both buying and selling?\n\nFrom what I know, limit pricing for buying means you set a price and if the\nmarket price falls to ur limit price or below, it will help you to buy the\nstock. As for selling, if the market price rises to ur limit price or above, it\nwill help you…",
  "original_created_utc": 1618975557,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "買いと売りの両方に使用できるものですか？\n\n私が知っている限りでは、買いの指値とは、価格を設定し、市場価格が指値以下になったら\n買いの指値とは、価格を設定し、市場価格が指値以下になったら、その株を買うことができるというものです。\n株を買うことができます。売りの場合は、市場価格が指値以上に上昇すれば\nとなります。",
      "title": "Limit Price, Stop-Limit Price, Stop-Loss Priceの違いは何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "是否都能用于购买和出售？\n\n据我所知，买入的限价是指你设定一个价格，如果市场价格跌到你的限价或低于你的限价，它将帮助你买入。\n市场价格下降到你的限价或低于限价，它将帮助你买入股票。\n股票。至于卖出，如果市场价格上升到你的限价或以上，它将帮助你\n将帮助你...",
      "title": "限价、限价、止损价的区别是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "是否都能用於購買和出售？\n\n據我所知，買入的限價是指你設定一個價格，如果市場價格跌到你的限價或低於你的限價，它將幫助你買入。\n市場價格下降到你的限價或低於限價，它將幫助你買入股票。\n股票。至於賣出，如果市場價格上升到你的限價或以上，它將幫助你\n將幫助你...",
      "title": "限價、限價、止損價的區別是什麼？"
    }
  ],
  "title": "Whats the difference between Limit Price, Stop-Limit Price,Stop-Loss Price?",
  "created_utc": 1619012542,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Are all able to be used for both buying and selling?</p>\n\n<p>From what I know, limit pricing for buying means you set a price and if the market price falls to ur limit price or below, it will help you to buy the stock. As for selling, if the market price rises to ur limit price or above, it will help you to sell the stock? Assuming there is enough liquidity in the market.</p>\n\n<p>Stop-Loss Price is to set a price whereby if the market price drops to that level, you will want to sell the stock no matter what. So let say I set it at $90, and the market price plummeted to $85, and there is only liquidity at $85 but no one wants to buy at $90, it will help me to sell at $85? Does this mean no matter how much the market plummet to, as long as the market price drops below $90, at a price with enough liquidity, it will help me sell? How does Stop-Loss Price apply when buying?</p>\n\n<p>Stop-Limit Price is just Stop-Loss Price with a limit pricing? So if I set my Stop-Loss Price at $90, at any price below or at $90, it will trigger the Stop-Loss Price? But can I put my Limit Price both higher or lower than my Stop-Loss Price? So if I put my Limit Price at $92, once the market rises back to $92 or above from $90 and below when the Stop-Loss Price was triggered, it will help me sell my shares? What if the price never goes back up to $90 and above? Does my stock never get sold? So shouldnt I set my Limit Price at $88, whereby once the Stop-Loss Price is triggered at $90, it will help me sell my shares at $88 and above? Also, how does this apply to the context of buying?</p>\n\n<p>Thank you!</p>\n</div><!-- SC_ON -->",
  "score": 47,
  "permalink": "/r/stocks/comments/mv79ir/whats_the_difference_between_limit_price/",
  "subreddit": "stocks",
  "id": "mv79ir",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171527443
}