{
  "author": "deep_sea2",
  "original_created_utc": 1650581008,
  "title": "Were the Rosenburgs actually guilty of espionage?",
  "created_utc": 1650618731,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;When reading various history overviews of the Cold War, I often stumble upon snippets of the execution of Julius and Ethel Rosenburg. They were executed in a time of high paranoia in the USA, and the books somewhat leave the impression that their conviction and execution might have more a product of the hysteria as opposed to them being actual Soviet spies and seems to imply that their execution was a miscarriage of justice. So, how guilty were the Rosenburgs? Was their trial more of kangaroo court or was their conviction legally sound?&lt;/p&gt;\n\n&lt;p&gt;I suppose my question comes in two parts.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;What is the historical consensus of the investigation/trial as it took place. By the standards of the time period, where they found guilty in proper court of law with proper evidence to prove guilt beyond reasonable doubt? Did the state respect their legal rights as per the law in the 1950s.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;In the seventy or so years since their trial, how much more do we know to support or refute what those in the 1950s knew.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/u8zmop/were_the_rosenburgs_actually_guilty_of_espionage/",
  "subreddit": "AskHistorians",
  "id": "u8zmop",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "When reading various history overviews of the Cold War, I often stumble upon\nsnippets of the execution of Julius and Ethel Rosenburg. They were executed in a\ntime of high paranoia in the USA, and the books somewhat leave the impression\nthat their conviction and execution might have more a product…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "冷戦に関する様々な歴史的概観を読んでいると、しばしばユリウス・ローゼンブルグとエセル・ローゼンブルグの処刑に関する断片に出くわす。\nユリウス・ローゼンバーグとエセル・ローゼンバーグの処刑についての断片を目にすることがある。この二人が処刑されたのは\nアメリカではパラノイアが蔓延していた時代で、この二人の有罪判決や処刑は、むしろその産物だったのではないかという印象が、この本には多少なりとも残っている。\n彼らの有罪判決や処刑は、むしろその産物であったかもしれない、という印象を与える。",
      "title": "ローゼンブルグ家は本当にスパイ行為をしていたのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在阅读有关冷战的各种历史综述时，我经常无意中发现\n关于朱利叶斯和埃塞尔-罗森堡被处决的片段。他们是在一个\n他们是在美国高度偏执的时期被处决的，而这些书多少给人留下了这样的印象\n他们的定罪和处决可能更多的是一种产物......",
      "title": "罗森伯格家族是否真的犯有间谍罪？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在閱讀有關冷戰的各種歷史綜述時，我經常無意中發現\n關於朱利葉斯和埃塞爾-羅森堡被處決的片段。他們是在一個\n他們是在美國高度偏執的時期被處決的，而這些書多少給人留下了這樣的印象\n他們的定罪和處決可能更多的是一種產物......",
      "title": "羅森伯格家族是否真的犯有間諜罪？"
    }
  ]
}