{
  "author": "Important_Jump4681",
  "original_created_utc": 1653937163,
  "title": "Why do so many guys use absolutely cringy/ emberassing sexual language (as dirty talk)?",
  "created_utc": 1653955927,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am also bi-sexual, and the gays are probably even worse.&lt;/p&gt;\n\n&lt;p&gt;Can y&amp;#39;all just stop saying things like &amp;quot;cumtoilet&amp;quot;, &amp;quot;milkers&amp;quot;, &amp;quot;boypussy&amp;quot;, &amp;quot;Beef/ meat curtain&amp;quot;, &amp;quot;breeding rod&amp;quot;\nAlso I&amp;#39;m from Germany and the guys here are probably on a whole other level too. To all the German speakers, Just fucking read this crap:\n&amp;quot;Spermaklo&amp;quot;, &amp;quot;Jungfotze&amp;quot;, &amp;quot;Arschfotze&amp;quot;, &amp;quot;Abmelken&amp;quot;, &amp;quot;Hab Bock zu sexeln&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Who unironically talks like that?\nAnd yes, this is all Shit I have seen myself first or second hand.\nY&amp;#39;all make fun of Indians with the whole &amp;quot;Show Bobs and vagene&amp;quot; shit, but guys here are not better&lt;/p&gt;\n\n&lt;p&gt;I have not witnessed one time where a woman talks like that. Even If they do it for Money it&amp;#39;s rare.&lt;/p&gt;\n\n&lt;p&gt;Edit: To those who downvote me or don&amp;#39;t believe me: Just go spent some time on gay hook-ups Apps. Or ask your female Friends If you can take a peek into their DMs.\nI honestly feel like some of y&amp;#39;all are just feeling exposed.\nAnd it makes perfect Sense. I totally expect people who say this unironically to chill out at reddit.\nSo to all you downvoters: suck my dick&lt;/p&gt;\n\n&lt;p&gt;Also on a another note: Just because YOU don&amp;#39;t hear stuff Like this, doesn&amp;#39;t mean it&amp;#39;s not happening.\nFucking reddit is such a pile of crap man.&lt;/p&gt;\n\n&lt;p&gt;Oh and on a third note: Why the fuck you take everything the wrong way? These are just some random ass examples I could remember. These are neither the &amp;quot;top&amp;quot; expressions, nor does everybody say all of them. It&amp;#39;s just some fucking examples. Of course they&amp;#39;re oddly specific. This is part of why it&amp;#39;s so stupid.\nI can&amp;#39;t believe that I have to explain this. Fuck man, redditors are so dumb holy shit. &lt;/p&gt;\n\n&lt;p&gt;Aight imma head out now, this is getting to stupid.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 110,
  "permalink": "/r/TooAfraidToAsk/comments/v177d1/why_do_so_many_guys_use_absolutely_cringy/",
  "subreddit": "TooAfraidToAsk",
  "id": "v177d1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "I am also bi-sexual, and the gays are probably even worse.\n\nCan y'all just stop saying things like \"cumtoilet\", \"milkers\", \"boypussy\",\n\"Beef/ meat curtain\", \"breeding rod\" Also I'm from Germany and the guys here are\nprobably on a whole other level too. To all the German speakers, Just fucking\nread…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私もバイセクシャルですが、ゲイはもっとひどいでしょう。\n\n私もバイセクシュアルですが、ゲイはもっとひどいでしょう。「cumtoilet」、「milkers」、「boypussy」などというのはやめてくれませんか。\n「また、僕はドイツ出身なんだけど、ここの人たちはまた別の次元の人たちなんだ。\nおそらく全く別の次元のものだろう。ドイツ語圏の皆さん、ちょっとクソ\n読むんだ...",
      "title": "なぜ多くの男は、絶対的に陳腐な／卑猥な性的言葉を（汚い言葉として）使うのだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我也是双性恋，而同性恋者可能更糟糕。\n\n你们能不能不说 \"精液厕所\"、\"挤奶器\"、\"男孩阴部 \"之类的话。\n\"牛肉/肉帘\"，\"育种棒\"，而且我来自德国，这里的人可能也是另一个层次。\n可能也在一个完全不同的水平上。对所有讲德语的人来说，只要他妈的\n阅读...",
      "title": "为什么这么多男人使用绝对粗俗/令人厌恶的性语言（作为肮脏的谈话）？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我也是雙性戀，而同性戀者可能更糟糕。\n\n你們能不能不說 \"精液廁所\"、\"擠奶器\"、\"男孩陰部 \"之類的話。\n\"牛肉/肉簾\"，\"育種棒\"，而且我來自德國，這裏的人可能也是另一個層次。\n可能也在一個完全不同的水平上。對所有講德語的人來說，只要他媽的\n閱讀...",
      "title": "爲什麼這麼多男人使用絕對粗俗/令人厭惡的性語言（作爲骯髒的談話）？"
    }
  ]
}