{
  "author": "YoutubeEverything",
  "the_new_excerpt": "Palantir has signed a new two-year contract worth up to $31.5M with the UK’s\nNational Health Service (NHS England and NHS Improvement).\n\nPalantir Foundry will provide the NHS with a software platform for the secure,\nreliable, and timely processing of data – while protecting the privacy of\npatients –…",
  "original_created_utc": 1608727881,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "Palantir与英国的Palantir签署了一份价值高达3150万美元的新的两年合同\n国家卫生服务(NHS英格兰和NHS改进)。\n\nPalantir Foundry将为NHS提供一个软件平台，\n可靠、及时地处理数据，同时保护\n患者-…",
      "title": "Palantir与NHS签订了价值3150万美元的合同，继续开展至关重要的工作"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Palantir與英國的Palantir簽署了一份價值高達3150萬美元的新的兩年合同\n國家衛生服務(NHS英格蘭和NHS改進)。\n\nPalantir Foundry將爲NHS提供一個軟件平臺，\n可靠、及時地處理數據，同時保護\n患者-…",
      "title": "Palantir與NHS簽訂了價值3150萬美元的合同，繼續開展至關重要的工作"
    }
  ],
  "title": "Palantir Continues Vital NHS Work With $31.5M Contract",
  "created_utc": 1608734442,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Palantir has signed a new two-year contract worth up to $31.5M with the UK’s National Health Service (NHS England and NHS Improvement).</p>\n\n<p>Palantir Foundry will provide the NHS with a software platform for the secure, reliable, and timely processing of data – while protecting the privacy of patients – to enable NHS decision makers to best plan use of resources and improve patient care.</p>\n\n<p>“Palantir is very proud to continue supporting the NHS, and this contract underlines our deep commitment to the UK,” said Louis Mosley, Head of Palantir UK. “We look forward to supporting the NHS deliver its critical, life-saving work for patients.”</p>\n\n<p>NHS personnel will use Palantir Foundry to understand how COVID-19 is spreading, identify risks to particularly vulnerable populations, proactively increase health and care resources in emerging hot spots, ensure critical equipment is supplied to the facilities with the greatest need, and divert patients and service users to the facilities that are best able to care for them.</p>\n\n<p>The NHS will continue to use Palantir Foundry as part of its COVID-19 response, including the planning and operational roll-out of the UK’s vaccine program.</p>\n\n<p><a href=\"https://www.businesswire.com/news/home/20201223005018/en/Palantir-Continues-Vital-NHS-Work-With-31.5M-Contract\">https://www.businesswire.com/news/home/20201223005018/en/Palantir-Continues-Vital-NHS-Work-With-31.5M-Contract</a></p>\n</div><!-- SC_ON -->",
  "score": 202,
  "permalink": "/r/stocks/comments/kisiow/palantir_continues_vital_nhs_work_with_315m/",
  "subreddit": "stocks",
  "id": "kisiow",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609271717003
}