{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "Basically I decided to finally learn about investing by having \"some skin in the game.\" I've made some, I've lost some, I've dabbled in options, nothing too crazy. Started of course by buying calls, then dabbled in selling calls and puts, and basically I feel really comfortable selling calls. My strike price is always a decent bit above my average cost, so if it gets assigned, then oh well, I'm forced to take some profit (and paid a little premium for it!) I try to sell calls when the stock is on a rise, and either let them expire or buy them back at 50%+, if I think I can sell another call soon. \n\nI feel like I'm missing what the downside of this strategy is? I kind of love it, and wish I had been doing this all along. I don't have the capital to sell puts but if I did, I think selling puts (and possibly having to buy stock at a discount, then selling calls on it) and calls would be pretty much exclusively what I do. \n\nI have about 600 shares of 23AndMe $ME, and though the stock hasn't soared, I'm till positive on it (*edit*: I think this isn't true haha. I'm about 18% down on commons, but I've made some back in selling calls, and got assigned on another couple hundred shares earlier at a profit, and feel pretty good about its future) and have taken quite a bit of premium just for holding the stock! $RKLB (only 104 shares) and Cleveland-Cliffs ($CLF), which I had a large position in, but did get assigned from a call (at a profit, so I'm not complaining?) And some various things, $MSFT, etc. But just thinking about stocks I can accumulate with my meager portfolio/income.\n\nAny insight into downsides I'm missing, or tickers to look at, or if you want to educate me a little on what to look at with The Greeks, I would appreciate any of it! Thanks!",
  "author_fullname": "t2_4hsyzvlv",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "First year investing. Just a 10k (well... 7k-15k, depending on the month!) portfolio, I've realized I really like selling calls",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": "advicerequest",
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_rn8x3j",
  "quarantine": false,
  "link_flair_text_color": "light",
  "upvote_ratio": 0.82,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 42,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Advice Request",
  "can_mod_post": false,
  "score": 42,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": 1640304307,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1640303817,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Basically I decided to finally learn about investing by having &amp;quot;some skin in the game.&amp;quot; I&amp;#39;ve made some, I&amp;#39;ve lost some, I&amp;#39;ve dabbled in options, nothing too crazy. Started of course by buying calls, then dabbled in selling calls and puts, and basically I feel really comfortable selling calls. My strike price is always a decent bit above my average cost, so if it gets assigned, then oh well, I&amp;#39;m forced to take some profit (and paid a little premium for it!) I try to sell calls when the stock is on a rise, and either let them expire or buy them back at 50%+, if I think I can sell another call soon. &lt;/p&gt;\n\n&lt;p&gt;I feel like I&amp;#39;m missing what the downside of this strategy is? I kind of love it, and wish I had been doing this all along. I don&amp;#39;t have the capital to sell puts but if I did, I think selling puts (and possibly having to buy stock at a discount, then selling calls on it) and calls would be pretty much exclusively what I do. &lt;/p&gt;\n\n&lt;p&gt;I have about 600 shares of 23AndMe $ME, and though the stock hasn&amp;#39;t soared, I&amp;#39;m till positive on it (&lt;em&gt;edit&lt;/em&gt;: I think this isn&amp;#39;t true haha. I&amp;#39;m about 18% down on commons, but I&amp;#39;ve made some back in selling calls, and got assigned on another couple hundred shares earlier at a profit, and feel pretty good about its future) and have taken quite a bit of premium just for holding the stock! $RKLB (only 104 shares) and Cleveland-Cliffs ($CLF), which I had a large position in, but did get assigned from a call (at a profit, so I&amp;#39;m not complaining?) And some various things, $MSFT, etc. But just thinking about stocks I can accumulate with my meager portfolio/income.&lt;/p&gt;\n\n&lt;p&gt;Any insight into downsides I&amp;#39;m missing, or tickers to look at, or if you want to educate me a little on what to look at with The Greeks, I would appreciate any of it! Thanks!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "75a227ec-65e6-11e5-96ee-12d48f46797b",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#f7644f",
  "id": "rn8x3j",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "salfkvoje",
  "discussion_type": null,
  "num_comments": 41,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/rn8x3j/first_year_investing_just_a_10k_well_7k15k/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/rn8x3j/first_year_investing_just_a_10k_well_7k15k/",
  "subreddit_subscribers": 3415420,
  "created_utc": 1640324724,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1640303817,
  "the_new_excerpt": "Basically I decided to finally learn about investing by having \"some skin in the\ngame.\" I've made some, I've lost some, I've dabbled in options, nothing too\ncrazy. Started of course by buying calls, then dabbled in selling calls and\nputs, and basically I feel really comfortable selling calls. My…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "基本的に、私は最終的に「肌で感じる」ことで投資について学ぼうと思いました。\nゲーム」です。少し稼いだり、失ったり、オプションに手を出したりしましたが、あまり大したことは\nクレイジー もちろん、コールを買うことから始めて、コールや売りにも手を出しました。\nプット、そして基本的にはコールを売るのが一番しっくりきます。私の...",
      "title": "1年目の投資 10k（まあ...月によって7k-15k！）のポートフォリオだけで、コールを売るのが本当に好きなことに気づいた。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "基本上，我决定最终通过 \"在游戏中拥有一些皮肤 \"来学习投资。\n游戏\"。我赚了一些，也亏了一些，我还涉足了期权，没有太多\n疯。当然是从买入看涨期权开始，然后涉足卖出看涨期权和看跌期权。\n卖出看涨期权，基本上我觉得卖出看涨期权非常舒服。我的...",
      "title": "第一年的投资。只是一个1万（嗯......7千-1万5千，取决于月度！）的投资组合，我发现我真的很喜欢卖出看涨期权"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "基本上，我決定最終通過 \"在遊戲中擁有一些皮膚 \"來學習投資。\n遊戲\"。我賺了一些，也虧了一些，我還涉足了期權，沒有太多\n瘋。當然是從買入看漲期權開始，然後涉足賣出看漲期權和看跌期權。\n賣出看漲期權，基本上我覺得賣出看漲期權非常舒服。我的...",
      "title": "第一年的投資。只是一個1萬（嗯......7千-1萬5千，取決於月度！）的投資組合，我發現我真的很喜歡賣出看漲期權"
    }
  ]
}