{
  "author": "randfyld",
  "original_created_utc": 1627236472,
  "title": "Unpopular opinion: Leaving crypto in an exchange is safer than using a wallet (for most people)",
  "created_utc": 1627263489,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In my opinion leaving your crypto in an exchange or a lending platform is way safer for most people. Especially for beginners and &quot;casual investors&quot;. </p>\n\n<p>How many times how you heard of a popular exchange like Kraken, Coinbase, Gemini etc getting hacked? Probably not many. But how many times have you heard of someone losing his seed phrase? Millions of cryptocoins are lost because of that reason! I know that the whole &quot;not your keys, not your crypto&quot; might sound appealing and nice but I feel much safer having my crypto on an exchange and an lending platform than having a piece of paper than can get lost, burned or stolen!</p>\n</div><!-- SC_ON -->",
  "score": 193,
  "permalink": "/r/CryptoCurrency/comments/orglsh/unpopular_opinion_leaving_crypto_in_an_exchange/",
  "subreddit": "CryptoCurrency",
  "id": "orglsh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In my opinion leaving your crypto in an exchange or a lending platform is way\nsafer for most people. Especially for beginners and \"casual investors\".\n\nHow many times how you heard of a popular exchange like Kraken, Coinbase, Gemini\netc getting hacked? Probably not many. But how many times have you…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の意見では、自分の暗号を取引所や貸付プラットフォームに置いておくことは、ほとんどの人にとってより安全です。\nの方が安全だと思います。特に、初心者や「カジュアルな投資家」にとっては。\n\nKraken、Coinbase、Geminiなどの人気のある取引所では、何度もこのような事態が発生しています。\nなどの人気のある取引所がハッキングされたという話を何度聞きましたか？おそらくそれほど多くはないでしょう。しかし、あなたは何回...",
      "title": "不評な意見 暗号を取引所に預けることは、ウォレットを使うよりも安全である（ほとんどの人にとって）。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在我看来，把你的加密货币留在交易所或借贷平台上，对大多数人来说是比较安全的。\n对大多数人来说更安全。特别是对于初学者和 \"临时投资者\"。\n\n你听说过多少次像Kraken、Coinbase、Gemini等流行的交易所被黑？\n等被黑了？可能不多。但是你有多少次...",
      "title": "不受欢迎的意见。将加密货币留在交易所比使用钱包更安全（对大多数人来说）。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在我看來，把你的加密貨幣留在交易所或借貸平臺上，對大多數人來說是比較安全的。\n對大多數人來說更安全。特別是對於初學者和 \"臨時投資者\"。\n\n你聽說過多少次像Kraken、Coinbase、Gemini等流行的交易所被黑？\n等被黑了？可能不多。但是你有多少次...",
      "title": "不受歡迎的意見。將加密貨幣留在交易所比使用錢包更安全（對大多數人來說）。"
    }
  ]
}