{
  "author": "Valandomar",
  "original_created_utc": 1624841581,
  "title": "My dad hates crypto and pretends to know what it is.",
  "created_utc": 1624900924,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Very sorry for the repost. This post got removed on my new account because it’s not 60 days old.</strong></p>\n\n<p>Last year I got into crypto and I decided to not tell anyone except my mom about it because I know she’s open and interested. </p>\n\n<p>Today was the first day I told my dad about Crypto, I did not tell him to invest or anything but he was talking about someone who doesn’t know what to do with his money, and I said maybe he could invest in some crypto or something?</p>\n\n<p>My dad said “You don’t have money in that bullshit, do you?” I said that I do and I knew what was coming, half an hour of calling me an irresponsible idiot and nonsense about “Wow they know how to find idiots like you” and how this isn’t regulated by anyone and it could be hacked etc etc (clearly he knows nothing). </p>\n\n<p>I did not argue back, never did actually since I turned 20. Knowing my dad, he can’t be convinced that I might know something beneficial that he does not know about, but if one of his friends told him about Crypto he’d listen lol. I decided to say I don’t own any crypto and don’t plan on buying any, just so I can never hear him talk about it again lol. If he does not act like that, I wouldn’t have to lie.</p>\n\n<p>Anyone experienced something similar?</p>\n\n<p>Edit: It kinda hurts more now, knowing that I probably experienced this alone, but I am also glad that people in general got parents who are normal people.</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/CryptoCurrency/comments/o99ki2/my_dad_hates_crypto_and_pretends_to_know_what_it/",
  "subreddit": "CryptoCurrency",
  "id": "o99ki2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Very sorry for the repost. This post got removed on my new account because it’s\nnot 60 days old.\n\nLast year I got into crypto and I decided to not tell anyone except my mom about\nit because I know she’s open and interested.\n\nToday was the first day I told my dad about Crypto, I did not tell him to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "再投稿で大変申し訳ありません。この投稿は私の新しいアカウントで削除されました。\n60日経っていないからです。\n\n去年、私は暗号に興味を持ち、母以外には誰にも言わないことにしました。\n母がオープンで興味を持っていることを知っていたからです。\n\n今日は父に初めて暗号の話をしましたが、父には言っていませんでした。",
      "title": "父は暗号を嫌っていて、知っているふりをしています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "非常抱歉重发了这个帖子。这个帖子在我的新账户上被删除了，因为它是\n不到60天的时间。\n\n去年我开始接触加密货币，我决定不告诉任何人，除了我妈妈。\n因为我知道她很开放，很感兴趣。\n\n今天是我告诉我爸爸关于加密货币的第一天，我没有告诉他...",
      "title": "我爸爸讨厌加密货币，并假装知道它是什么。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "非常抱歉重發了這個帖子。這個帖子在我的新賬戶上被刪除了，因爲它是\n不到60天的時間。\n\n去年我開始接觸加密貨幣，我決定不告訴任何人，除了我媽媽。\n因爲我知道她很開放，很感興趣。\n\n今天是我告訴我爸爸關於加密貨幣的第一天，我沒有告訴他...",
      "title": "我爸爸討厭加密貨幣，並假裝知道它是什麼。"
    }
  ]
}