{
  "author": "ubercj",
  "original_created_utc": 1650653242,
  "title": "Are “cargo cults” a genuine spiritual movement? To what extent - if any - is the discourse surrounding cargo cults a reflection of patronizing attitudes towards indigenous peoples?",
  "created_utc": 1650675818,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I recently heard about &lt;a href=\"https://en.wikipedia.org/wiki/Cargo_cult\"&gt;cargo cults&lt;/a&gt; for the first time, and I must admit I was immediately skeptical. The idea of indigenous islanders “performing parade ground drills with wooden or salvaged rifles” and “[waving] landing signals while standing on runways” in a genuine belief that such behaviors would cause supplies to fall to them by parachute beggars belief. Most alarming to me is how conveniently these supposed cult behaviors reinforce the image of naive, “backwards” native people who were so isolated that they could not conceive of modern technology as anything other than gifts sent from a deity. &lt;/p&gt;\n\n&lt;p&gt;Wikipedia says these cults largely cropped up in Melanesia in the period following WWII. I am aware that some cargo cults, such as the John Frum cult and Prince Philip Movement are still around today, but I’m much more interested in the period immediately following WWII.&lt;/p&gt;\n\n&lt;p&gt;Do we know how legitimately “spiritual” these cults were? How seriously do modern historians take the discourse surrounding cargo cults?&lt;/p&gt;\n\n&lt;p&gt;P.S. I didn’t see a pre-existing answer in the FAQ, although I may have missed it. I did find some similar questions asked here in the past, but they are mostly from 6+ years ago and don’t appear to have the sort of answer I&amp;#39;m seeking&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/AskHistorians/comments/2cwl9l/what_happened_to_cargo_cults_after_wwii_was_over/\"&gt;https://www.reddit.com/r/AskHistorians/comments/2cwl9l/what_happened_to_cargo_cults_after_wwii_was_over/&lt;/a&gt;\n&lt;a href=\"https://www.reddit.com/r/AskHistorians/comments/4jjz51/how_did_contemporary_westerners_view_cargo_cults/\"&gt;https://www.reddit.com/r/AskHistorians/comments/4jjz51/how_did_contemporary_westerners_view_cargo_cults/&lt;/a&gt;\n&lt;a href=\"https://old.reddit.com/r/AskHistorians/comments/1gq1aw/did_john_frum_exist/\"&gt;https://old.reddit.com/r/AskHistorians/comments/1gq1aw/did_john_frum_exist/&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 110,
  "permalink": "/r/AskHistorians/comments/u9lp9n/are_cargo_cults_a_genuine_spiritual_movement_to/",
  "subreddit": "AskHistorians",
  "id": "u9lp9n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I recently heard about cargo cults [https://en.wikipedia.org/wiki/Cargo_cult]\nfor the first time, and I must admit I was immediately skeptical. The idea of\nindigenous islanders “performing parade ground drills with wooden or salvaged\nrifles” and “[waving] landing signals while standing on runways”…"
}