{
  "author": "ubercj",
  "original_created_utc": 1650653242,
  "title": "Are “cargo cults” a genuine spiritual movement? To what extent - if any - is the discourse surrounding cargo cults a reflection of patronizing attitudes towards indigenous peoples?",
  "created_utc": 1650675818,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I recently heard about &lt;a href=\"https://en.wikipedia.org/wiki/Cargo_cult\"&gt;cargo cults&lt;/a&gt; for the first time, and I must admit I was immediately skeptical. The idea of indigenous islanders “performing parade ground drills with wooden or salvaged rifles” and “[waving] landing signals while standing on runways” in a genuine belief that such behaviors would cause supplies to fall to them by parachute beggars belief. Most alarming to me is how conveniently these supposed cult behaviors reinforce the image of naive, “backwards” native people who were so isolated that they could not conceive of modern technology as anything other than gifts sent from a deity. &lt;/p&gt;\n\n&lt;p&gt;Wikipedia says these cults largely cropped up in Melanesia in the period following WWII. I am aware that some cargo cults, such as the John Frum cult and Prince Philip Movement are still around today, but I’m much more interested in the period immediately following WWII.&lt;/p&gt;\n\n&lt;p&gt;Do we know how legitimately “spiritual” these cults were? How seriously do modern historians take the discourse surrounding cargo cults?&lt;/p&gt;\n\n&lt;p&gt;P.S. I didn’t see a pre-existing answer in the FAQ, although I may have missed it. I did find some similar questions asked here in the past, but they are mostly from 6+ years ago and don’t appear to have the sort of answer I&amp;#39;m seeking&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/AskHistorians/comments/2cwl9l/what_happened_to_cargo_cults_after_wwii_was_over/\"&gt;https://www.reddit.com/r/AskHistorians/comments/2cwl9l/what_happened_to_cargo_cults_after_wwii_was_over/&lt;/a&gt;\n&lt;a href=\"https://www.reddit.com/r/AskHistorians/comments/4jjz51/how_did_contemporary_westerners_view_cargo_cults/\"&gt;https://www.reddit.com/r/AskHistorians/comments/4jjz51/how_did_contemporary_westerners_view_cargo_cults/&lt;/a&gt;\n&lt;a href=\"https://old.reddit.com/r/AskHistorians/comments/1gq1aw/did_john_frum_exist/\"&gt;https://old.reddit.com/r/AskHistorians/comments/1gq1aw/did_john_frum_exist/&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 110,
  "permalink": "/r/AskHistorians/comments/u9lp9n/are_cargo_cults_a_genuine_spiritual_movement_to/",
  "subreddit": "AskHistorians",
  "id": "u9lp9n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I recently heard about cargo cults [https://en.wikipedia.org/wiki/Cargo_cult]\nfor the first time, and I must admit I was immediately skeptical. The idea of\nindigenous islanders “performing parade ground drills with wooden or salvaged\nrifles” and “[waving] landing signals while standing on runways”…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、貨物カルト[https://en.wikipedia.org/wiki/Cargo_cult]のことを初めて知りました。\nを初めて聞き、正直言ってすぐに懐疑的な気持ちになりました。その考えは\n島民が「木製の銃や引き揚げた銃でパレードのような訓練をする」「上陸の合図を振りながら\nをする」「滑走路に立ちながら着陸信号を振る」......。",
      "title": "貨物カルト」は本物のスピリチュアル・ムーブメントなのか？カーゴ・カルトをめぐる言説は、どの程度（もしあるとすれば）、先住民に対する愛国心の反映なのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近第一次听说货物邪教[https://en.wikipedia.org/wiki/Cargo_cult]\n第一次听说，我必须承认，我立刻就产生了怀疑。关于\n土著岛民 \"用木头或打捞上来的东西进行阅兵式演习 \"和 \"站在跑道上挥舞着登陆信号 \"的想法。\n步枪 \"和 \"站在跑道上[挥舞]着陆信号\"......",
      "title": "货物邪教 \"是一种真正的精神运动吗？如果有的话，围绕货物邪教的论述在多大程度上反映了对原住民的袒护态度？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近第一次聽說貨物邪教[https://en.wikipedia.org/wiki/Cargo_cult]\n第一次聽說，我必須承認，我立刻就產生了懷疑。關於\n土著島民 \"用木頭或打撈上來的東西進行閱兵式演習 \"和 \"站在跑道上揮舞着登陸信號 \"的想法。\n步槍 \"和 \"站在跑道上[揮舞]着陸信號\"......",
      "title": "貨物邪教 \"是一種真正的精神運動嗎？如果有的話，圍繞貨物邪教的論述在多大程度上反映了對原住民的袒護態度？"
    }
  ]
}