{
  "author": "King_Vercingetorix",
  "original_created_utc": 1624404650,
  "title": "How did abolitionist like Frederick Douglass react to the exception within the 13th Amendment allowing for slavery in the prison System? Did they foresee its abuse by white Americans in the Justice System?",
  "created_utc": 1624423946,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>And were there different reactions along racial lines? IE white abolitionists believed that the Justice System would be fair and that slavery as a criminal punishment is appropriate while black abolitionists were understandably more hesitant?</p>\n</div><!-- SC_ON -->",
  "score": 136,
  "permalink": "/r/AskHistorians/comments/o608i7/how_did_abolitionist_like_frederick_douglass/",
  "subreddit": "AskHistorians",
  "id": "o608i7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "And were there different reactions along racial lines? IE white abolitionists\nbelieved that the Justice System would be fair and that slavery as a criminal\npunishment is appropriate while black abolitionists were understandably more\nhesitant?",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "また、人種による反応の違いはあったのでしょうか？白人の奴隷制廃止論者は\n白人の奴隷廃止論者は、司法制度は公正であり、刑事罰としての奴隷制度は適切であると信じていました。\n罰としての奴隷制度は適切であると考えていました。\n白人の奴隷廃止論者は、司法制度は公正であり、刑事罰としての奴隷制度は適切であると信じていたのに対し、黒人の奴隷廃止論者は当然ながら躊躇していたのでしょうか？",
      "title": "フレデリック・ダグラスのような奴隷制廃止論者は、憲法修正第13条の中に刑務所内での奴隷制を認める例外規定があることにどう反応したのでしょうか？彼らは、白人のアメリカ人が司法制度の中で奴隷制を乱用することを予見していたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "是否有种族方面的不同反应？IE白人废奴主义者\n相信司法系统会是公平的，奴隶制作为一种刑事处罚是适当的。\n而黑人废奴主义者则可以理解为更多的\n迟疑不决？",
      "title": "像弗雷德里克-道格拉斯这样的废奴主义者对第13条修正案中允许在监狱系统中实行奴隶制的例外情况有什么反应？他们是否预见到美国白人在司法系统中的滥用？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "是否有種族方面的不同反應？IE白人廢奴主義者\n相信司法系統會是公平的，奴隸制作爲一種刑事處罰是適當的。\n而黑人廢奴主義者則可以理解爲更多的\n遲疑不決？",
      "title": "像弗雷德裏克-道格拉斯這樣的廢奴主義者對第13條修正案中允許在監獄系統中實行奴隸制的例外情況有什麼反應？他們是否預見到美國白人在司法系統中的濫用？"
    }
  ]
}