{
  "author": "globalWarmingCowFart",
  "the_new_excerpt": "I'm not a smoker or drinker, but cigs and stuff cost a ton of money to fuel a\ndrug addiction.\n\nFor me, my bad habit was spending stuff I never use. I had a video game console\nI bought years back and never really played stuff on it much. Now I look at\nstuff I'm enticed to impulse buy and say to…",
  "original_created_utc": 1619932776,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は喫煙者でも飲酒者でもありませんが、葉巻やその他のものは、燃料として大量のお金がかかります。\n私の悪い癖は、使わないものを使うことです。\n\n私の場合は、使わないものを使うのが悪い癖でした。何年も前に買ったゲーム機がありました。\n何年も前に買ったゲーム機がありましたが、あまり遊んだことがありませんでした。今、私が見るのは\n衝動買いしてしまいそうなものを見ては、こう言っています。",
      "title": "暗号のために悪い習慣をやめようとしている人はいませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不抽烟也不喝酒，但香烟和其他东西要花一大笔钱来助长毒瘾。\n瘾。\n\n对我来说，我的坏习惯是花钱买我从来不用的东西。我有一个视频游戏机\n几年前买的，但从未真正在上面玩过东西。现在我看着\n诱使我冲动购买的东西，然后说......",
      "title": "还有人发现自己为了加密货币而戒掉坏习惯吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不抽菸也不喝酒，但香菸和其他東西要花一大筆錢來助長毒癮。\n癮。\n\n對我來說，我的壞習慣是花錢買我從來不用的東西。我有一個視頻遊戲機\n幾年前買的，但從未真正在上面玩過東西。現在我看着\n誘使我衝動購買的東西，然後說......",
      "title": "還有人發現自己爲了加密貨幣而戒掉壞習慣嗎？"
    }
  ],
  "title": "Anyone else finding themselves quitting bad habits for crypto?",
  "created_utc": 1619955563,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m not a smoker or drinker, but cigs and stuff cost a ton of money to fuel a drug addiction.</p>\n\n<p>For me, my bad habit was spending stuff I never use. I had a video game console I bought years back and never really played stuff on it much. Now I look at stuff I&#39;m enticed to impulse buy and say to myself, &quot;if I had invested in bitcoin instead, how much will I have in the future?&quot; and that does the trick to stop myself.</p>\n</div><!-- SC_ON -->",
  "score": 345,
  "permalink": "/r/CryptoCurrency/comments/n2zrcw/anyone_else_finding_themselves_quitting_bad/",
  "subreddit": "CryptoCurrency",
  "id": "n2zrcw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380962692
}