{
  "author": "purple_iam1",
  "the_new_excerpt": "I feel kinda bad to feel like this...but we would be having a conversation about\nthis something, sometimes important and they would all of a sudden would be so\ninto a show (they would be flipping the channel) or their phone. They would just\nleave me hanging, if i try to get their attention, they…",
  "original_created_utc": 1622628478,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんな気持ちになるのはちょっと嫌だな...と思いながらも、この何か大事なことについて会話をしていると\n時には重要な話をしていても、彼らは突然、番組や携帯電話に夢中になってしまうのです。\n番組に夢中になったり（チャンネルを変えたり）、携帯電話に夢中になったりします。彼らはただ\n私の注意を引こうとすると、彼らは...。",
      "title": "その人と会話をしているときに、その人がスマホやテレビに夢中になっているせいで、完全に無視されてイライラする人はいませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我觉得这样的感觉有点不好......但我们正在谈论\n这个东西，有时是很重要的，他们会突然间变得如此\n进入一个节目（他们会翻转频道）或他们的手机。他们就会\n如果我试图引起他们的注意，他们...",
      "title": "是否有人在与某人谈话时，由于对方全神贯注于手机或电视而完全无视你，而感到恼火？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我覺得這樣的感覺有點不好......但我們正在談論\n這個東西，有時是很重要的，他們會突然間變得如此\n進入一個節目（他們會翻轉頻道）或他們的手機。他們就會\n如果我試圖引起他們的注意，他們...",
      "title": "是否有人在與某人談話時，由於對方全神貫注於手機或電視而完全無視你，而感到惱火？"
    }
  ],
  "title": "Do anyone else get annoyed at someone who completely ignores you while having a conversation with that person due to that person being engrossed on their phone or tv?",
  "created_utc": 1622643708,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I feel kinda bad to feel like this...but we would be having a conversation about this something, sometimes important and they would all of a sudden would be so into a show (they would be flipping the channel) or their phone. They would just leave me hanging, if i try to get their attention, they would look at me for a sec and try to continue what they’re saying but the next sec back to what they are watching. I know sometimes we wanna concentrate on a show or something on our phones, totally get it but why bother having a conversation when you’re gonna be doing something else. Also should note, the conversation is not something that can offend anyone, sometimes it’s about helping the other person fill something or search something online, replying to something they have asked me etc</p>\n</div><!-- SC_ON -->",
  "score": 455,
  "permalink": "/r/TooAfraidToAsk/comments/nqidvx/do_anyone_else_get_annoyed_at_someone_who/",
  "subreddit": "TooAfraidToAsk",
  "id": "nqidvx",
  "is_self": true,
  "media": null,
  "is_video": false
}