{
  "author": "rexfordays",
  "original_created_utc": 1632330879,
  "title": "Don't be fooled by Robinhood's wallet announcement",
  "created_utc": 1632378658,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Robinhood screwed over investors during the original GME hype. They are in bed with big money and <em>do NOT care about you</em>.</p>\n\n<p>This is a smart play for their business model, because they make money on the transaction, like any exchange, and this added feature will give them more functional credibility in the crypto space. It should drive adoption for their platform. </p>\n\n<p>But don&#39;t forget about their history, and how they are the antithesis to what they claim to be.</p>\n\n<p>Fuck Robinhood. As soon as this wallet feature opens up, if you have any coin with them, do yourself a favor and move your coins to literally anywhere else. Do yourself, the cryptocurrency space, and everyone else a favor and dump Robinhood.</p>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/CryptoCurrency/comments/ptc73p/dont_be_fooled_by_robinhoods_wallet_announcement/",
  "subreddit": "CryptoCurrency",
  "id": "ptc73p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Robinhood screwed over investors during the original GME hype. They are in bed\nwith big money and do NOT care about you.\n\nThis is a smart play for their business model, because they make money on the\ntransaction, like any exchange, and this added feature will give them more\nfunctional credibility in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ロビンフッドは、最初のGMEの宣伝の際に投資家を騙した。彼らは大金持ちと手を組んでおり\n彼らは大金持ちと手を組んでいて、あなたのことは気にしていません。\n\nこれは彼らのビジネスモデルにとってスマートなプレイです。なぜなら、彼らは他の取引所のように取引でお金を稼ぐからです。\n他の取引所のように取引でお金を稼ぎ、この追加機能は彼らにもっと機能的な信頼性を与えるでしょう。\nこの追加機能は、彼らのビジネスモデルにとって賢い選択です。",
      "title": "ロビンフッドのウォレット発表に惑わされるな"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在最初的GME炒作中，Robinhood坑害了投资者。他们与大公司同流合污\n他们与大公司合作，并不关心你。\n\n对于他们的商业模式来说，这是一个聪明的做法，因为他们在交易中赚钱，就像其他交易所一样。\n因为他们在交易中赚钱，就像任何交易所一样，而这一新增功能将给他们带来更多的\n功能上的可信度，在...",
      "title": "不要被Robinhood的钱包公告所迷惑"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在最初的GME炒作中，Robinhood坑害了投資者。他們與大公司同流合污\n他們與大公司合作，並不關心你。\n\n對於他們的商業模式來說，這是一個聰明的做法，因爲他們在交易中賺錢，就像其他交易所一樣。\n因爲他們在交易中賺錢，就像任何交易所一樣，而這一新增功能將給他們帶來更多的\n功能上的可信度，在...",
      "title": "不要被Robinhood的錢包公告所迷惑"
    }
  ]
}