{
  "author": "gen66",
  "original_created_utc": 1641757527,
  "title": "So we have an upcoming eventual mega market crash - stocks/sp500/nasdaq composite index which will simply obliterate BTC and on the other hand we have Jeff Booth, Greg Foss, Michael Saylor and the rest of the mega bulls saying it's pure math and a matter of time before BTC 200-300k+! Let's discuss!",
  "created_utc": 1641814283,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So US Government decides to increase yield on bonds , reduce reckless money printing and a bunch of other decisions that will eventually make stock investors move a lot of their money from stocks to bonds. Basically stocks become kind of a risky and uncertain assets while bonds become the opposite, safe haven, almost zero risk and guaranteed yield. That will eventually crash stocks/sp500 and so on. Understandably this means all huge institutional investors will take their money out of BTC. At best we are expecting another 2-3 to 4 year bear market before markets start to recover. BTC may as well go 10k under easily and stay there for a long time.&lt;/p&gt;\n\n&lt;p&gt;On the other hand Jeff Booth and  Greg Floss may say that government can reduce money printing and improve bonds yields but that&amp;#39;s just  temporary and eventually they will have to start printing lots of money again to avoid stock markets to crash because nobody wants that. Also they may say inflation is going to get worse and worse due to the money printing and the best bet against inflation is Bitcoin.&lt;/p&gt;\n\n&lt;p&gt;But my opinion is that Bitcoin is not dependant on reddit users/bitcoin forums/youtube gurus etc. It&amp;#39;s dependant on the big money! And big money is controlled mostly by people who consider BTC a very risky asset! (of course with the exceptions of Saylor, Cathie Wood and the early BTC Whales who have diamond hands for lifetime)&lt;/p&gt;\n\n&lt;p&gt;So I&amp;#39;m thinking who exactly is going to put a lot of money in Bitcoin in a market crisis where stock are going down by 50% and more in a couple of weeks/months. Who is going to risk it? Also is US Government really able to prevent another mega stock market crash? Nasdaq Composite Index is currently at all time highs up around 600% from 2010!&lt;/p&gt;\n\n&lt;p&gt;Let&amp;#39;s discuss this topic until we figure out every possible scenario!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 308,
  "permalink": "/r/Bitcoin/comments/rzzq32/so_we_have_an_upcoming_eventual_mega_market_crash/",
  "subreddit": "Bitcoin",
  "id": "rzzq32",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So US Government decides to increase yield on bonds , reduce reckless money\nprinting and a bunch of other decisions that will eventually make stock\ninvestors move a lot of their money from stocks to bonds. Basically stocks\nbecome kind of a risky and uncertain assets while bonds become the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そこで、米国政府は、国債の利回りを上げることを決定し、無謀なマネーを削減する\nを印刷し、他の多くの決定は、最終的に株式を取得することになります。\n投資家の資金が株式から債券に大量に移動する。基本的に株式は\n債券は、ある種のリスクと不確実性の高い資産となる。",
      "title": "BTCが消滅するような株式/SP500/ナスダック総合指数の大暴落が来る一方で、ジェフ・ブース、グレッグ・フォス、マイケル・セイラーなどのメガブルたちが、BTCが20-30万ドル以上になるのは純粋な数学であり時間の問題だと言っているわけです。議論しましょう!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，美国政府决定提高债券的收益率，减少不计后果的印钞机，以及其他一系列将导致美国经济增长的决定。\n和一系列其他决定，最终将使股票投资者的资金从股票转向债券。\n投资者将大量资金从股票转向债券。基本上股票\n变成了一种风险和不确定的资产，而债券则成为了一种风险和不确定的资产。",
      "title": "因此，我们有一个即将到来的大型市场崩溃--股票/SP500/纳斯达克综合指数，这将简单地抹去BTC，而另一方面，我们有杰夫-布斯，格雷格-福斯，迈克尔-赛勒和其他大型牛市说，这纯粹是数学，BTC 20-30万+是一个时间问题！。我们来讨论一下!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，美國政府決定提高債券的收益率，減少不計後果的印鈔機，以及其他一系列將導致美國經濟增長的決定。\n和一系列其他決定，最終將使股票投資者的資金從股票轉向債券。\n投資者將大量資金從股票轉向債券。基本上股票\n變成了一種風險和不確定的資產，而債券則成爲了一種風險和不確定的資產。",
      "title": "因此，我們有一個即將到來的大型市場崩潰--股票/SP500/納斯達克綜合指數，這將簡單地抹去BTC，而另一方面，我們有傑夫-布斯，格雷格-福斯，邁克爾-賽勒和其他大型牛市說，這純粹是數學，BTC 20-30萬+是一個時間問題！。我們來討論一下!"
    }
  ]
}