{
  "author": "Mottita23",
  "original_created_utc": 1660192931,
  "title": "If a colorblind person who sees different colors than a non colorblind person get taught the names of colors the way they see them… how will they ever know they are colorblind?",
  "created_utc": 1660241968,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This might be a VERY stupid question hahaha but i’ve always wondered. &lt;/p&gt;\n\n&lt;p&gt;So if you have person A who is colorblind and person B who is not, they are both looking at the color red, person A however sees brown, person B teaches person A that that color which they are seeing is called “red”, then whenever person A sees what would be brown for them, they would call it “red”. If this happened for all colors or most, both people would say the same color name but would be seeing a different perception of the color. So how does person A ever realize that they are colorblind?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/NoStupidQuestions/comments/wlijv6/if_a_colorblind_person_who_sees_different_colors/",
  "subreddit": "NoStupidQuestions",
  "id": "wlijv6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "This might be a VERY stupid question hahaha but i’ve always wondered.\n\nSo if you have person A who is colorblind and person B who is not, they are both\nlooking at the color red, person A however sees brown, person B teaches person A\nthat that color which they are seeing is called “red”, then…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは非常に愚かな質問かもしれませんが、私はいつも不思議に思っています。\n\n色弱の人Aと色弱でない人Bがいたとして、二人が赤色を見たとき\n赤色を見て、Aさんは茶色を見ます。\nその色が「赤」であることをAさんに教えたとします。",
      "title": "色盲の人が、色盲でない人と違う色を見ているとして、その人が見ている色の名前を教えてもらっても、自分が色盲であることをどうやって知ることができるでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这可能是一个非常愚蠢的问题，哈哈哈，但我一直想知道。\n\n所以，如果你有一个色盲的人A和一个非色盲的人B，他们都在\n都在看红色，但A看到的是棕色，而B则是在教A。\n他们看到的颜色被称为 \"红色\"，那么......",
      "title": "如果一个色盲者看到的颜色与非色盲者看到的颜色不同，就会被教导他们看到的颜色名称......他们怎么会知道自己是色盲？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這可能是一個非常愚蠢的問題，哈哈哈，但我一直想知道。\n\n所以，如果你有一個色盲的人A和一個非色盲的人B，他們都在\n都在看紅色，但A看到的是棕色，而B則是在教A。\n他們看到的顏色被稱爲 \"紅色\"，那麼......",
      "title": "如果一個色盲者看到的顏色與非色盲者看到的顏色不同，就會被教導他們看到的顏色名稱......他們怎麼會知道自己是色盲？"
    }
  ]
}