{
  "author": "NYKNYb",
  "original_created_utc": 1651149007,
  "title": "\"Tyranny is when the government knows everything about you. Democracy is when you know everything about your government.\"",
  "created_utc": 1651177905,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I was reading comments on some french newspaper article basically saying that Bitcoin adoption in Central African Republic will lead to even more corruption and money laundering from the government.&lt;/p&gt;\n\n&lt;p&gt;We all know that this is absolutely not true, and it got me thinking about a very exciting second order effect of Bitcoin nation state adoption.&lt;/p&gt;\n\n&lt;p&gt;Basically, it becomes much harder for governments to launder money and be corrupt because of the public nature of the Bitcoin ledger of transactions. Government spending, donations, foreign aid can be tracked on the blockchain.&lt;/p&gt;\n\n&lt;p&gt;On the other hand, citizens now enjoy more financial freedom, and can have a good level of pricacy using the Lightning Network.&lt;/p&gt;\n\n&lt;p&gt;The government isn&amp;#39;t going to be able to track millions of average people&amp;#39;s transactions on Lightning. This offers a level of privacy comparable to cash. But millions of people can now have their eyes on their government, who&amp;#39;s not going to be able to move millions around unnoticed.&lt;/p&gt;\n\n&lt;p&gt;More privacy for the individuals, more transparency for governments. Win-win.&lt;/p&gt;\n\n&lt;p&gt;What do you guys think?&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Edit: I chose that title because it is a well known quote. I do not support coercive governments, elected or not, but if we&amp;#39;re going to have governments I&amp;#39;d rather have the balance of power tilted more towards people and I think Bitcoin will do just that. &amp;quot;Democracy&amp;quot; definitely isn&amp;#39;t the end game for freedom as far as I&amp;#39;m concerned. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 365,
  "permalink": "/r/Bitcoin/comments/udtvkl/tyranny_is_when_the_government_knows_everything/",
  "subreddit": "Bitcoin",
  "id": "udtvkl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I was reading comments on some french newspaper article basically saying that\nBitcoin adoption in Central African Republic will lead to even more corruption\nand money laundering from the government.\n\nWe all know that this is absolutely not true, and it got me thinking about a\nvery exciting second…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "あるフランスの新聞記事のコメントを読んでいたら、基本的に次のようなことが書かれていました。\n中央アフリカ共和国でのビットコインの導入は、さらに汚職やマネーロンダリングを招くと\nマネーロンダリングにつながるというものでした。\n\n私たちは皆、これが絶対に真実ではないことを知っていますが、私はこのことについて考えさせられました。\nとてもエキサイティングな第二の...",
      "title": "\"専制政治とは、政府があなたのことをすべて知っていること。民主主義とは、あなたが政府のことを全て知っていることです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在读一些法国报纸文章的评论时，基本上是这样说的\n中非共和国采用比特币将导致更多的腐败\n和政府的洗钱行为。\n\n我们都知道，这绝对不是真的，这让我想到了一个\n非常激动人心的第二个问题...",
      "title": "\"暴政是政府知道你的一切。民主是你对你的政府了如指掌\"。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在讀一些法國報紙文章的評論時，基本上是這樣說的\n中非共和國採用比特幣將導致更多的腐敗\n和政府的洗錢行爲。\n\n我們都知道，這絕對不是真的，這讓我想到了一個\n非常激動人心的第二個問題...",
      "title": "\"暴政是政府知道你的一切。民主是你對你的政府瞭如指掌\"。"
    }
  ]
}