{
  "author": "Stankoman",
  "original_created_utc": 1638629915,
  "title": "Recent dip shows that no one on youtube, twitter, IG or tik knows what the f* they are doing",
  "created_utc": 1638641949,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Pumping out content on the daily, doing TA, modeling, theories, risk factor analysis, hyping news did not anticipate this dip.\nNothing on the news extraordinary, not politics, not SEC, not Congress, China, India, Elon or anyone else.&lt;/p&gt;\n\n&lt;p&gt;We dipped. Dipped hard. Just goes to show that whoever is saying on socials they know shit about crypto, just means they are using open sentences to describe the daily outlook. And we are consumers, we consume this garbage on the daily.&lt;/p&gt;\n\n&lt;p&gt;Consuming content, news, tweets, memes, brain farts and everything else these crypto tech geniuses are spitting out. For what?&lt;/p&gt;\n\n&lt;p&gt;In the end as long as market is expanding we are profiting.&lt;/p&gt;\n\n&lt;p&gt;Have a nice weekend frens and enjoy other things...&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 1110,
  "permalink": "/r/CryptoCurrency/comments/r8rcs1/recent_dip_shows_that_no_one_on_youtube_twitter/",
  "subreddit": "CryptoCurrency",
  "id": "r8rcs1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Pumping out content on the daily, doing TA, modeling, theories, risk factor\nanalysis, hyping news did not anticipate this dip. Nothing on the news\nextraordinary, not politics, not SEC, not Congress, China, India, Elon or anyone\nelse.\n\nWe dipped. Dipped hard. Just goes to show that whoever is saying…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "日々コンテンツを発信し、TA、モデリング、理論、リスクファクターを行う\n分析、ニュースの宣伝は、この落ち込みを予期していなかった。ニュースでは何も\n政治もSECも議会も中国もインドもイーロンも、誰も彼も。\n他の人。\n\n私たちは浸かった。激しく凹んだ。つまり、誰が何と言おうと...",
      "title": "最近のdipでは、youtube、twitter、IG、tikの誰も自分が何をしているのか分かっていないことが分かりました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "每天抽出内容，做TA，建模，理论，风险因素\n分析，炒作新闻，都没有预料到这次下跌。新闻中没有任何内容\n非凡，不是政治，不是SEC，不是国会，不是中国，印度，Elon或任何人\n其他任何人。\n\n我们下跌了。跌得很厉害。这恰恰说明，不管谁在说...",
      "title": "最近的调查显示，YouTube、Twitter、IG或Tik上没有人知道他们在做什么。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "每天抽出內容，做TA，建模，理論，風險因素\n分析，炒作新聞，都沒有預料到這次下跌。新聞中沒有任何內容\n非凡，不是政治，不是SEC，不是國會，不是中國，印度，Elon或任何人\n其他任何人。\n\n我們下跌了。跌得很厲害。這恰恰說明，不管誰在說...",
      "title": "最近的調查顯示，YouTube、Twitter、IG或Tik上沒有人知道他們在做什麼。"
    }
  ]
}