{
  "author": "yarpen_z",
  "original_created_utc": 1648138206,
  "title": "Was Warsaw Pact the first military alliance to only attack its own members?",
  "created_utc": 1648173613,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Many serious and humorous claims appeared in the heated debate after Russia invaded Ukraine. One that I have seen recently stated that\nRussia/Soviet Union invented the first military alliance used not to fight with an enemy but to invade and control its members. The second part of the claim is true - the only military action of the Warsaw Pact was the invasion of Czechoslovakia. Furthermore, the Brezhnev Doctrine made this intent clear and explicit, and the communist government of Poland justified the introduction of martial law with the threat of invasion by allied forces to reestablish &amp;quot;stability&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;However, is it true that this was the first example of such a multi-nation alliance? Are there any other examples in history of a military alliance that never fought against an external enemy but instead was used primarily to bully its members?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/tmk5iw/was_warsaw_pact_the_first_military_alliance_to/",
  "subreddit": "AskHistorians",
  "id": "tmk5iw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Many serious and humorous claims appeared in the heated debate after Russia\ninvaded Ukraine. One that I have seen recently stated that Russia/Soviet Union\ninvented the first military alliance used not to fight with an enemy but to\ninvade and control its members. The second part of the claim is true…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ロシアをめぐる議論には、深刻なものからユーモラスなものまで、多くの主張が登場する。\nウクライナに侵攻した。最近見たものでは、ロシア・ソビエト連邦は、以下のように述べています。\n敵との戦いではなく、敵との戦いのために使用される最初の軍事同盟を発明した。\nを侵略し、支配する。この主張の後半部分は正しいのだが...。",
      "title": "ワルシャワ条約は、自国のメンバーだけを攻撃する最初の軍事同盟だったのですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在俄罗斯的激烈辩论中出现了许多严肃和幽默的说法。\n入侵乌克兰。我最近看到的一个说法是，俄罗斯/苏联\n发明了第一个军事联盟，不是用来与敌人作战，而是用来\n侵略和控制其成员。该说法的第二部分是真实的...",
      "title": "华沙条约组织是第一个只攻击自己成员的军事联盟吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在俄羅斯的激烈辯論中出現了許多嚴肅和幽默的說法。\n入侵烏克蘭。我最近看到的一個說法是，俄羅斯/蘇聯\n發明了第一個軍事聯盟，不是用來與敵人作戰，而是用來\n侵略和控制其成員。該說法的第二部分是真實的...",
      "title": "華沙條約組織是第一個只攻擊自己成員的軍事聯盟嗎？"
    }
  ]
}