{
  "author": "MedicalWood",
  "the_new_excerpt": "I'm gonna min/max this shit with 100x leverage and stick my balls in the hard\ndrive as collateral\n\nAny and all corrections only make me more committed to the masochistic shit\nstorm that is crypto. I genuinely can't get enough of this volatility, there's\nso much volatility that people are having…",
  "original_created_utc": 1611225955,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我要用100倍的杠杆作用，把我的蛋蛋插到硬邦邦的东西里去\n驱使\n\n任何修正都只会让我更加投入到受虐狂的粪便中。\n风暴，是加密技术。我真的是受够了这种波动性，有\n这么多的波动，人们有... ...",
      "title": "r/wallstreetbets让我学会了个人在加密市场的风险承受能力"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我要用100倍的槓桿作用，把我的蛋蛋插到硬邦邦的東西里去\n驅使\n\n任何修正都只會讓我更加投入到受虐狂的糞便中。\n風暴，是加密技術。我真的是受夠了這種波動性，有\n這麼多的波動，人們有... ...",
      "title": "r/wallstreetbets讓我學會了個人在加密市場的風險承受能力"
    }
  ],
  "title": "r/wallstreetbets taught me about personal risk tolerance in crypto markets",
  "created_utc": 1611250150,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m gonna min/max this shit with 100x leverage and stick my balls in the hard drive as collateral</p>\n\n<p>Any and all corrections only make me more committed to the masochistic shit storm that is crypto. I genuinely can&#39;t get enough of this volatility, there&#39;s so much volatility that people are having daily nervous breakdowns - questioning every single one of their decisions like the future of the world depends on it</p>\n\n<p>To put this in perspective: we are on a rock spinning in infinity and we are all going to be dead in 100 years time. Long live the chaos of crypto and let our gains be ripe aplenty</p>\n\n<p>N.B. If any of you would like further advice about the <a href=\"/r/wallstreetbets\">r/wallstreetbets</a> approach then I advise you start off by rectally inserting a 12&quot; cucumber up your rectum covered in hot sauce</p>\n\n<p>(this will harden you to the markets and how hard they will fuck you)</p>\n</div><!-- SC_ON -->",
  "score": 306,
  "permalink": "/r/CryptoCurrency/comments/l1w4vz/rwallstreetbets_taught_me_about_personal_risk/",
  "subreddit": "CryptoCurrency",
  "id": "l1w4vz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1611311216179
}