{
  "author": "giddyup281",
  "original_created_utc": 1634287051,
  "title": "For the last time - a DUMP is not the same as a RUG PULL",
  "created_utc": 1634308685,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Not sure what&#39;s so difficult to understand.</p>\n\n<p>Dump means the price is falling. Usually rapidly.</p>\n\n<p>Rug pull means the devs/team had access to liquidity pools and they&#39;ve drained it, meaning you cannot sell at all, bcs there is no &quot;pool&quot; or money from which your order will be fulfilled. It happens on DeFi.</p>\n\n<p>&#x200B;</p>\n\n<p>I believe I don&#39;t need to go into explaining why SHIB is a shitcoin. But to say it&#39;s being rugged is flawed. The liquidity is still there. There&#39;s buy and sell orders left and right. Volume is $3B. You will be able to sell. If you bought in the last 7 days, there&#39;s 50% chance you&#39;re still in profit. But please, for the love of Satoshi, zoom the f out. It&#39;s price is still above where it was 7 days ago. 1 month chart looks pretty amazing, even for the most volatile of crypto.</p>\n\n<p>&#x200B;</p>\n\n<p>Is this a dump? Who the f knows?? It most likely is. It could also be a normal correction from the wild pump it had the previous month. We don&#39;t know. Sensationalist articles and posts here how it&#39;s getting sold left and right are not looking at the number. 16% fall today is a lot. That said, we didn&#39;t blink an eye in any other situation where a top 100 coin fell 16% in a day. Or are you forgetting this is crypto?</p>\n\n<p>&#x200B;</p>\n\n<p>EDIT: the serial downvoting happening in comments is atrocious.</p>\n\n<p>EDIT #2: some people are advocating calling a rug pull when team/dev deliberate actions cause the price to sharply fall down (by underdelivering or not working on the project at all, or by holding a large portion of the supply then selling it all at once etc). I would tend to agree, as the crypto language/dictionary is young and is still developing (or is not properly defined). </p>\n\n<p>I still remain with the point that not all dumps, scams, hacks or code flaws are rug pulls. All thumbs are fingers, not all fingers are thumbs type of thing, if you will. </p>\n</div><!-- SC_ON -->",
  "score": 155,
  "permalink": "/r/CryptoCurrency/comments/q8k4ok/for_the_last_time_a_dump_is_not_the_same_as_a_rug/",
  "subreddit": "CryptoCurrency",
  "id": "q8k4ok",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Not sure what's so difficult to understand.\n\nDump means the price is falling. Usually rapidly.\n\nRug pull means the devs/team had access to liquidity pools and they've drained\nit, meaning you cannot sell at all, bcs there is no \"pool\" or money from which\nyour order will be fulfilled. It happens on…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "何がそんなに難しいのかよくわからない。\n\nダンプは価格が下がっていることを意味します。通常、急速に。\n\nラグプルとは、開発者やチームが流動性プールにアクセスしていたが、彼らが排出してしまったことを意味する。\nつまり、あなたの注文が実行される「プール」やお金がないので、あなたは全く売ることができないのです。\nつまり、あなたの注文が実行される「プール」やお金がないからです。これが起こるのは...",
      "title": "最後に、DUMPとRUG PULLは違います。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "不知道有什么难懂的。\n\n倾销意味着价格在下降。通常是迅速的。\n\nRug pull 意味着开发者/团队有机会进入流动性池子，他们已经耗尽了\n意味着你根本无法卖出，因为没有 \"池子 \"或钱来满足你的订单。\n你的订单将被履行。这发生在...",
      "title": "最后一次，DUMP与RUG PULL不一样。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不知道有什麼難懂的。\n\n傾銷意味着價格在下降。通常是迅速的。\n\nRug pull 意味着開發者/團隊有機會進入流動性池子，他們已經耗盡了\n意味着你根本無法賣出，因爲沒有 \"池子 \"或錢來滿足你的訂單。\n你的訂單將被履行。這發生在...",
      "title": "最後一次，DUMP與RUG PULL不一樣。"
    }
  ]
}