{
  "author": "TakeMyBoomerMoney",
  "original_created_utc": 1639223793,
  "title": "Still can't believe somebody is actually giving me their Bitcoin in exchange for USD",
  "created_utc": 1639265508,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Every time I buy (daily DCA, for years), I keep getting surprised that anybody is actually willing to sell me their BTC, the rarest form of money on the planet, in exchange for government currency which is the most abundant and easily produced form of money on the planet, USD or whatever.&lt;/p&gt;\n\n&lt;p&gt;Is there something I&amp;#39;m missing?&lt;/p&gt;\n\n&lt;p&gt;Who is selling these satoshis?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 165,
  "permalink": "/r/Bitcoin/comments/rdyaur/still_cant_believe_somebody_is_actually_giving_me/",
  "subreddit": "Bitcoin",
  "id": "rdyaur",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Every time I buy (daily DCA, for years), I keep getting surprised that anybody\nis actually willing to sell me their BTC, the rarest form of money on the\nplanet, in exchange for government currency which is the most abundant and\neasily produced form of money on the planet, USD or whatever.\n\nIs there…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が買うたびに（何年も毎日DCAを）、誰かが買うことに驚かされ続けています。\nは、世界で最も希少な貨幣であるBTCを私に売ってくれるのです。\n最も多く存在する政府通貨と交換する。\n米ドルであれ何であれ、地球上で簡単に生産できるお金の形です。\n\nそこで...",
      "title": "米ドルと引き換えにビットコインをくれる人がいるなんて、まだ信じられません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "每次我买东西的时候（多年来每天都买DCA），我都会惊讶于有人\n我一直很惊讶，居然有人愿意把他们的BTC--地球上最稀有的货币形式--卖给我。\n以换取政府的货币，而政府的货币是地球上最丰富和最容易生产的货币形式。\n而政府货币是地球上最丰富和最容易生产的货币形式，美元或其他。\n\n是否有...",
      "title": "仍然无法相信有人真的把他们的比特币给我换成了美元"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "每次我買東西的時候（多年來每天都買DCA），我都會驚訝於有人\n我一直很驚訝，居然有人願意把他們的BTC--地球上最稀有的貨幣形式--賣給我。\n以換取政府的貨幣，而政府的貨幣是地球上最豐富和最容易生產的貨幣形式。\n而政府貨幣是地球上最豐富和最容易生產的貨幣形式，美元或其他。\n\n是否有...",
      "title": "仍然無法相信有人真的把他們的比特幣給我換成了美元"
    }
  ]
}