{
  "author": "Ding123456",
  "the_new_excerpt": "I’ve been following the surge in lumber for a while now and after seeing the\ntalking heads offer dogshit advice on how to play lumber, I got riled up and\nfelt the need to chime in for those looking to invest in companies that actually\nwill be riding this wave. I’m not here to recommend any…",
  "original_created_utc": 1614466883,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我关注木材的暴涨已经有一段时间了，在看到了。\n说话的人提供狗屁建议 如何玩木材，我被激怒了，并。\n感到有必要为那些希望投资于真正的公司的人提供帮助。\n将乘着这股浪潮。我不是来推荐任何... ...",
      "title": "忽略那些说三道四的人；如何真正投资于木材价格的暴涨。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我關注木材的暴漲已經有一段時間了，在看到了。\n說話的人提供狗屁建議 如何玩木材，我被激怒了，並。\n感到有必要爲那些希望投資於真正的公司的人提供幫助。\n將乘着這股浪潮。我不是來推薦任何... ...",
      "title": "忽略那些說三道四的人；如何真正投資於木材價格的暴漲。"
    }
  ],
  "title": "Ignore the Talking Heads; How to Actually Invest in the Surge in Lumber Prices",
  "created_utc": 1614495521,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve been following the surge in lumber for a while now and after seeing the talking heads offer dogshit advice on how to play lumber, I got riled up and felt the need to chime in for those looking to invest in companies that <em>actually</em> will be riding this wave.  I’m not here to recommend any particular stock.  I just want to post on why there’s a surge and what type of companies are most likely to benefit from it because I don’t see any good discussions on this topic in the mainstream financial media.</p>\n\n<p><strong>Understanding the Surge in Lumber:</strong></p>\n\n<p>The price of lumber is at a historical high right now and may continue to grow because of a confluence of factors that have led to very low supply and a concurrent very high demand.  When we talk about a surge in lumber prices, we are talking about cut and prepared wood.  We are not talking about the logs that are initially harvested prior to being processed into lumber.  It is an important distinction because the price of logs is not soaring along with the price of lumber due to a glut of supply. </p>\n\n<p>After the crash in ‘08, homebuilding was slow to recover and has not kept with pace with demand.  In 2020, demand for more housing surged when homeowners began looking to move out of the cities into homes with more space which in conjunction with the pandemic’s surge in home improvement projects created a massive demand for lumber.  </p>\n\n<p>On the supply side, temporary mill closures from Covid, as well as some permanent mill closures from lumber’s crash in price in 2019-2020, closures in British Columbia due to the pine beetle crisis as well as other random reasons, have resulted in a decrease in the supply of lumber in the US and Canada.  There are only so many sawmills in North America and those limited number of open and running mills has created a supply chain bottleneck.</p>\n\n<p>Despite these surging prices, because of how low interest rates are, home building so far has continued to surge and this will likely prevent the price of lumber from having any hard crashes for the near future.  </p>\n\n<p>Also, despite these high prices, homebuilders are still making money.  Case in point, Toll Brothers still blew away analyst expectations in their Q1 earnings through increased sales and home deliveries despite this surge in lumber prices eating into their bottom line.   </p>\n\n<p>Now, the “analysts” in click bait articles like to point to January’s 12% drop in single family housing starts in January as evidence of decrease volume, but they are leaving critical information out. (I.e. CNBC).  </p>\n\n<p>First, TOTAL private housing starts only dropped 6.1%.  </p>\n\n<p>Second, while housing starts declined in from December 2020 to January 2021, housing permits shot up almost 10%.  For those new to this, permits typically occur 1-2 months before the start of construction of a home.  </p>\n\n<p>Third, January/February are always the worst months for homebuilding for a very obvious reason: winter weather.<br/>\nLastly, a comparison of total housing starts from January 2020 to January 2021 shows only a 2.3% decrease in January 2021, but when you compare the difference in housing permits for those two months, January 2021 shows a 10.4% increase in permits compared to January 2020.  </p>\n\n<p>So, right now we are on track for a significant jump in housing construction, and thus even more demand for lumber, that will be realized in the next couples months; important considerations that are noticeably absent from talking-heads clickbait.  So while there was a small blip in housing starts in January 2021—and February will also likely be rough—come March/April, housing is on track to take off even further, despite these high prices.  </p>\n\n<p><strong>How to Invest in the Surge:</strong></p>\n\n<p>Will lumber come back down? Absolutely.  The billion dollar question is are when and how far. But because of how long it takes to build new production capacity and the fact that the demand for news homes is not going away any time soon, the entities who actually produce lumber will probably have a great year this year, maybe even next year as well, depending on demand.</p>\n\n<p>There may be many good reasons to invest in companies like Home Depot, Lowes, and lumber liquidators, but those are not the companies that are going to actually benefit from a surge in lumber prices.  Why? Because they have to pay for those elevated lumber prices since they don’t produce their own lumber.<br/>\nAdditionally, companies with tree farms that sell logs to lumber companies are also not going to be seeing much price improvement from a surge in lumber prices because there is a massive glut of supply, particularly in the south right now.  The sawmills are already mostly running at 100% capacity already.<br/>\nIf you want to invest in companies that may benefit from this historic surge in lumber prices, then you should invest in companies that actually make lumber.  You would think it is obvious but apparently it isn’t to CNBC’s analysts.  </p>\n\n<p>Many lumber companies are privately owned, but there are some publicly traded companies as well, such as West Fraser Group (WFG), Weyerhaeuser (WY), Canfor (CFPZF), Interfor (IFSPS), and Resolute Forest Products (RFP), to name a few.  Each has their own pros and cons, but all of them are already seeing benefits from the surge in lumber in 2020 which was much lower than current prices.    </p>\n\n<p>That being said, these companies’ earnings will also be affected by the operations costs related to the other wood products they make such as wood pulp (which was low in 2020 but surging now), tissue, and newsprint/paper (which tanked in 2020 due to the pandemic).  Some of these companies may also have some of their earnings weighed down by other costs, from debt they accrued during 2019 and 2020 when lumber was historically low or depreciating assets (common for the industry) which can be a big drag on non-adjusted earnings even though these actually don’t result in any lost cash flow.  </p>\n\n<p>Also, some of these companies are not traded on NYSE so you have to buy OTC shares if you want to invest in them in the US exchanges.  So you need to do your DD in deciding which, if any, of these companies are worthwhile, undervalued or fit your investment strategy.  </p>\n\n<p>While I have my own guesses on which may be the better value play for 2021, that’s not the purpose of this post.  I’m not here to pump and dump.  I am just tired of seeing talking heads/shills in mainstream financial media promote the same stocks that actually have no ability to benefit from lumber’s surge.  If anyone’s interested, I’ll share my position and the reasons for it.  I don’t trade options so I have no clue how these companies would fit into various option strategies.  Also, I am not an industry insider or financial analyst.</p>\n\n<p>Note: I had a bunch links so you could easily verify all of this but the auto-moderator kept blocking the post and I’m over it.</p>\n</div><!-- SC_ON -->",
  "score": 134,
  "permalink": "/r/investing/comments/ltzj6a/ignore_the_talking_heads_how_to_actually_invest/",
  "subreddit": "investing",
  "id": "ltzj6a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937740753
}