{
  "author": "tanmay1010",
  "original_created_utc": 1639044738,
  "title": "Asset forfeitures has surpassed that of Burglary and then they wonder why decentralization in authority is required.",
  "created_utc": 1639081919,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;On 2nd December, officers confiscated $100,000 in cash without charging the owner (a 25 year old woman) of any crime or wrong doing. She had not committed any crime which was known to the officers and yet the money was taken from her. That is what stealing is- but if it is done by a centralized and regulated authority, it&amp;#39;s confiscation to prevent wrong-doings. &lt;/p&gt;\n\n&lt;p&gt;In poorer areas in the US, cops makes cash seizures of as low as a few 100 dollars. &lt;/p&gt;\n\n&lt;p&gt;And this is precisely why we need cryptocurrencies like Bitcoin. Nobody can just knock your doors and ask you to submit all your possessions to them in the name of prevention. You don&amp;#39;t have to prove yourself to be innocent to get back your seized assets. &lt;/p&gt;\n\n&lt;p&gt;This graph illustrates the issue at hand. Ofcourse not all of these seizures were unwarranted but many/most of them were and that is exactly the crux of this whole issue.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/t5dg236ynh481.png?width=1100&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=8ce82ae544c36bdd77931d8a8696a2b3d6bb84c5\"&gt;https://preview.redd.it/t5dg236ynh481.png?width=1100&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=8ce82ae544c36bdd77931d8a8696a2b3d6bb84c5&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 159,
  "permalink": "/r/CryptoCurrency/comments/rcepjp/asset_forfeitures_has_surpassed_that_of_burglary/",
  "subreddit": "CryptoCurrency",
  "id": "rcepjp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "On 2nd December, officers confiscated $100,000 in cash without charging the\nowner (a 25 year old woman) of any crime or wrong doing. She had not committed\nany crime which was known to the officers and yet the money was taken from her.\nThat is what stealing is- but if it is done by a centralized and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "12月2日、警察官が現金10万ドルを押収したのですが、起訴されませんでした。\n持ち主（25歳女性）には何の罪も悪さもありません。彼女は犯罪を犯していません。\nしかし、その金は奪われた。\nそれが窃盗というものだが、もしそれが中央集権的なものであれば......。",
      "title": "資産の没収は強盗のそれを上回っているのに、なぜ権限の分散が必要なのかと考える。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "12月2日，警官没收了10万美元的现金，但没有指控失主（一名25岁的妇女）有任何犯罪或不法行为。\n负责人（一名25岁的女性）的任何罪行或不法行为。她没有犯过\n官员知道的任何罪行，但钱却从她那里被拿走了。\n这就是偷窃，但如果它是由一个集中的和...",
      "title": "资产没收已经超过了盗窃罪，然后他们想知道为什么需要权力下放。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "12月2日，警官沒收了10萬美元的現金，但沒有指控失主（一名25歲的婦女）有任何犯罪或不法行爲。\n負責人（一名25歲的女性）的任何罪行或不法行爲。她沒有犯過\n官員知道的任何罪行，但錢卻從她那裏被拿走了。\n這就是偷竊，但如果它是由一個集中的和...",
      "title": "資產沒收已經超過了盜竊罪，然後他們想知道爲什麼需要權力下放。"
    }
  ]
}