{
  "author": "lamntien",
  "the_new_excerpt": "This is a tough game. Even the pros get slayed. This fund manager took his own\nlife earlier this week. From $20B down to $1B. He was a hardcore value investor\nin a world that currently favors growth stocks (and rotating back into value).\n\nHere's a piece on his fund from…",
  "original_created_utc": 1619711473,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これはタフなゲームだ。プロでもやられてしまう。このファンドマネージャーは、今週初めに自ら命を絶ちました。\n命を絶ちました。200億ドルを10億ドルに減らしました。彼は筋金入りのバリュー投資家でした。\n筋金入りのバリュー投資家で、現在は成長株が好まれています（そしてバリューに回帰しつつあります）。\n\nここでは、彼のファンドについての記事を紹介します。",
      "title": "伝説のウォールストリーター、シャルル・ド・ヴォーリクスが自殺とみられる死を遂げる"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是个艰难的游戏。即使是专家也会被杀。这位基金经理自杀了\n本周早些时候自杀。从200亿美元下降到10亿美元。他是一个铁杆的价值投资者\n在一个目前倾向于增长型股票的世界中（正在轮流回到价值型）。\n\n这里有一篇关于他的基金的文章，来自...",
      "title": "传说中的墙头堡查尔斯-德-沃克斯显然是自杀身亡的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是個艱難的遊戲。即使是專家也會被殺。這位基金經理自殺了\n本週早些時候自殺。從200億美元下降到10億美元。他是一個鐵桿的價值投資者\n在一個目前傾向於增長型股票的世界中（正在輪流回到價值型）。\n\n這裏有一篇關於他的基金的文章，來自...",
      "title": "傳說中的牆頭堡查爾斯-德-沃克斯顯然是自殺身亡的。"
    }
  ],
  "title": "Legendary Wall Streeter Charles De Vaulx Dies Of Apparent Suicide",
  "created_utc": 1619717130,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is a tough game. Even the pros get slayed. This fund manager took his own life earlier this week. From $20B down to $1B. He was a hardcore value investor in a world that currently favors growth stocks (and rotating back into value). </p>\n\n<p>Here&#39;s a piece on his fund from MS.</p>\n\n<p><a href=\"https://www.morningstar.com/articles/708457/behind-the-rise-and-fall-of-an-esteemed-value-shop\">https://www.morningstar.com/.../behind-the-rise-and-fall...</a></p>\n\n<p>What I took away from this:</p>\n\n<ol>\n<li>you don&#39;t need to be a professional wall street guy to be a good investor</li>\n<li>don&#39;t over subscribe to any investing ideology (eg. growth, value, small cap, etc.). be able to be pivot and be flexible to adapt.</li>\n</ol>\n</div><!-- SC_ON -->",
  "score": 1751,
  "permalink": "/r/investing/comments/n17cea/legendary_wall_streeter_charles_de_vaulx_dies_of/",
  "subreddit": "investing",
  "id": "n17cea",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380965862
}