{
  "author": "GreatJobKeepitUp",
  "the_new_excerpt": "Everywhere I go people put down crypto for its energy consumption. I'm fucking\nsick of it. Every day people sit at home, run their heat or their a/c. Watch\nvideos of stupid shit. Ride their car around. They do all these things which\nburn energy. 90% of it is completely for themselves, their survival…",
  "original_created_utc": 1622473517,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "どこに行っても、エネルギーを消費するという理由で暗号を否定する人がいます。私はそれに\nウンザリです。毎日、人々は家に座り、暖房や冷房をかけています。見て\nくだらないビデオを見たり 車に乗って移動する。このようなことをしていると\nエネルギーを消費します。その90％は完全に自分のため、生存のためです。",
      "title": "エネルギー論にはうんざりしている"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我所到之处，人们都因其能源消耗而贬低加密货币。我他妈的\n厌恶它。每天人们坐在家里，开着他们的暖气或空调。看\n看一些愚蠢的视频。骑着他们的车到处跑。他们做所有这些事情\n燃烧能量。90%的能量完全是为了他们自己，他们的生存...",
      "title": "我非常厌恶能源方面的争论"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我所到之處，人們都因其能源消耗而貶低加密貨幣。我他媽的\n厭惡它。每天人們坐在家裏，開着他們的暖氣或空調。看\n看一些愚蠢的視頻。騎着他們的車到處跑。他們做所有這些事情\n燃燒能量。90%的能量完全是爲了他們自己，他們的生存...",
      "title": "我非常厭惡能源方面的爭論"
    }
  ],
  "title": "I'm so sick of the energy argument",
  "created_utc": 1622491843,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Everywhere I go people put down crypto for its energy consumption. I&#39;m fucking sick of it. Every day people sit at home, run their heat or their a/c. Watch videos of stupid shit. Ride their car around. They do all these things which burn energy. 90% of it is completely for themselves, their survival and most of all their pleasure and comfort. AndI&#39;m fine with that, I do it too. But I hate that all of that is just taken for granted, no questions needed. </p>\n\n<p>Why in the name of sweet fuck is bitcoin the one thing people care about the consumption of? Nobody ever questions the intrinsic value of energy until needs start creating coins? Nobody ever breaks down the energy consumption of their daily life because they would reveal the fact they are wasteful.</p>\n\n<p>We&#39;ve never heard anyone question how much energy the financial system uses until bitcoin started getting shit on. Ive never heard someone question the consumption of Twitter and whether or not that is a necessary service in this age of climate change. My theory is that the fact that a miner makes money makes people jealous so they paint them as selfish world killers.</p>\n\n<p>Further wtf. There are oil and coal barrons spending their whole selves on keeping this dirty fuel in our society as long as they can. Why the fuck are we fighting with people about which technology should have to be banned when these pieces of shit are still poking holes in the ground. Let&#39;s ban them instead of the tools we want to use. </p>\n\n<p>I&#39;m hoping going forward people see the benefit of fully democratized trust and truth and start evaluating energy consumption based on utility and not just megawatts.</p>\n</div><!-- SC_ON -->",
  "score": 342,
  "permalink": "/r/Bitcoin/comments/np5he9/im_so_sick_of_the_energy_argument/",
  "subreddit": "Bitcoin",
  "id": "np5he9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804295035
}