{
  "author": "roberthonker",
  "original_created_utc": 1632078242,
  "title": "Realistic Opinion: You will do better if you only invest in Bitcoin and Ethereum than if you buy altcoins",
  "created_utc": 1632119437,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I full expect to get downvoted to oblivion because this Sub loves altcoins.</p>\n\n<p>Out of the top 100 coins from 2017, only 32 are in the top 100 now. Around 10 of them don’t even exist anymore.</p>\n\n<p>My point here is that it is easy to get excited about the next big altcoin, when in reality most of them won’t go anywhere, and will probably be lower in the next bull run than they are now.</p>\n\n<p>If you invest in SOL for example, you’re just asking for trouble. EOS is essentially the same project and it had the exact same hype last time around. Now it’s a ghost chain. (SOL fanboys, I’m happy to bet moons on this)</p>\n\n<p>To be realistic, you are better off investing 90% of your money into Bitcoin and Ethereum.</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/CryptoCurrency/comments/pre6ws/realistic_opinion_you_will_do_better_if_you_only/",
  "subreddit": "CryptoCurrency",
  "id": "pre6ws",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I full expect to get downvoted to oblivion because this Sub loves altcoins.\n\nOut of the top 100 coins from 2017, only 32 are in the top 100 now. Around 10 of\nthem don’t even exist anymore.\n\nMy point here is that it is easy to get excited about the next big altcoin, when\nin reality most of them won’t…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このSubはアルトコインが大好きなので、忘却の彼方までダウンボートされることが予想されます。\n\n2017年のトップ100コインのうち、今のトップ100には32個しか入っていません。そのうち約10\nそのうちの約10個はもう存在していません。\n\n私がここで言いたいのは、次の大きなアルトコインに興奮するのは簡単だが、実際にはそのほとんどが存在しないということだ。\n実際には、そのほとんどが存在しないということです。",
      "title": "現実的な意見。アルトコインを買うよりも、ビットコインとイーサリアムだけに投資した方が良い結果が得られます"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我完全期待着被降权到遗忘，因为这个子爱着altcoins。\n\n在2017年的前100个币中，现在只有32个在前100名中。其中大约10个\n他们甚至不存在了。\n\n我想说的是，人们很容易对下一个大的altcoin感到兴奋，但实际上大多数altcoin都不会存在。\n实际上，它们中的大多数不会...",
      "title": "现实的意见。如果你只投资于比特币和以太坊，你会比购买替代币做得更好"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我完全期待着被降權到遺忘，因爲這個子愛着altcoins。\n\n在2017年的前100個幣中，現在只有32個在前100名中。其中大約10個\n他們甚至不存在了。\n\n我想說的是，人們很容易對下一個大的altcoin感到興奮，但實際上大多數altcoin都不會存在。\n實際上，它們中的大多數不會...",
      "title": "現實的意見。如果你只投資於比特幣和以太坊，你會比購買替代幣做得更好"
    }
  ]
}