{
  "author": "Xaqaree",
  "original_created_utc": 1632247064,
  "title": "You Bitcoin fuckers do not understand money. I'm here to drop some knowledge on you",
  "created_utc": 1632260193,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been listening to Bitcoin podcasts and reading posts on here and I&#39;ve noticed a lot of you Bitcoiners are falling into the same logical error that I would expect a Keynesian economist or a particularly smooth-brained chimp to fall into.  Fortunately I&#39;m here to educate you guys.</p>\n\n<p>Money is <strong><em>NOT</em></strong> a tool primarily for spending.  This is <strong><em>NOT</em></strong> the most important feature nor primary purpose of money and is <strong><em>NOT</em></strong> why money has value.  You do <strong><em>NOT</em></strong> use money when you spend it on a ham sandwich.</p>\n\n<p>Money is a tool primarily for saving.  This is the most important feature and primary purpose of money and is why money has value.  You begin using money when you save in it and you cease using money when you exchange it for a ham sandwich.</p>\n\n<p>This is why Keynesians and midwits with limited cognitive ability do not and will never see the value of Bitcoin.  In their limited minds spending is what is important and this is why they go on and on about nonsense metrics like GDP.  Bitcoin is not especially well suited for transacting, certainly no more so than existing monetary options.  This is a problem Bitcoin does not solve better than its currently available competitors. So when I listen to a podcast where someone is talking about how they bought an Egg McMuffin in El Salvador with Bitcoin and it &quot;worked very well&quot; it becomes clear they are blind to the real value proposition of Bitcoin.  This is not a problem Bitcoin solves.</p>\n\n<p>Bitcoin&#39;s strength aligns with the true though often overlooked primary purpose of money--saving.  Instead of saying &quot;I used Bitcoin to buy some McNuggets and it worked really well!&quot; a Bitcoiner with a correct understanding of money would say &quot;I used Bitcoin as a savings vehicle for the past 5 years and didn&#39;t get rekt by the inflation that hit everyone else.  Bitcoin worked really well!&quot;  Home prices have doubled in the last 5 years?  That&#39;s a problem for people saving in an inferior money but it is not a problem for Bitcoin savers.  Housing prices have dropped by about 90% for those saving in Bitcoin.</p>\n\n<p>It is only when you realize the important function of money is to save that you will realize Bitcoin will <em>inevitably</em> replace every other form of money because it meets this need better and more efficiently than any other market option.  The other stuff people are focusing on simply do not matter.  If Bitcoin had a bug in its code that caused an interdimensional portal to open where by a leprechaun came out and punched anyone in the face every time they made an on-chain transaction, then Bitcoin would <em>still</em> be the best money and would <em>still</em> supplant the world&#39;s existing inefficient monetary systems.</p>\n\n<p>You&#39;re welcome</p>\n\n<p>-X</p>\n</div><!-- SC_ON -->",
  "score": 181,
  "permalink": "/r/Bitcoin/comments/pso5rg/you_bitcoin_fuckers_do_not_understand_money_im/",
  "subreddit": "Bitcoin",
  "id": "pso5rg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've been listening to Bitcoin podcasts and reading posts on here and I've\nnoticed a lot of you Bitcoiners are falling into the same logical error that I\nwould expect a Keynesian economist or a particularly smooth-brained chimp to\nfall into. Fortunately I'm here to educate you guys.\n\nMoney is NOT a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコインのポッドキャストを聴いたり、ここの記事を読んだりしていると\n多くのビットコイナーが、ケインズ経済学者や頭の良いチンパンジーが陥るような論理的エラーに陥っていることに気づきました。\nケインズ主義の経済学者や、特に頭の良いチンパンジーが陥るであろう論理的エラーに陥っています。\n陥っています。幸いなことに、私はあなた方を教育するためにここにいます。\n\nお金は決して...",
      "title": "ビットコインのクソ野郎どもは金を理解していない。私はあなたに知識を与えるためにここにいる"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直在听比特币播客和阅读这里的帖子，我注意到你们中的很多人都是比特币爱好者。\n我注意到你们很多比特币持有者都陷入了同样的逻辑错误，而我\n我希望凯恩斯主义的经济学家或脑子特别灵活的黑猩猩也会陷入同样的逻辑错误。\n陷入的逻辑错误。幸运的是，我是来教育你们的。\n\n金钱不是一种...",
      "title": "你们这些比特币的混蛋根本不懂钱。我在这里给你们传授一些知识"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直在聽比特幣播客和閱讀這裏的帖子，我注意到你們中的很多人都是比特幣愛好者。\n我注意到你們很多比特幣持有者都陷入了同樣的邏輯錯誤，而我\n我希望凱恩斯主義的經濟學家或腦子特別靈活的黑猩猩也會陷入同樣的邏輯錯誤。\n陷入的邏輯錯誤。幸運的是，我是來教育你們的。\n\n金錢不是一種...",
      "title": "你們這些比特幣的混蛋根本不懂錢。我在這裏給你們傳授一些知識"
    }
  ]
}