{
  "author": "Hospitalities",
  "the_new_excerpt": "It does not matter how \"correct\" you are, if you start insulting people, you\nwill be banned as explained very clearly under our rules. People who tell others\nto kill themselves or WHATEVER VARIANT will be permanently banned with or\nwithout prior ban history.\n\n\nIT IS NOT THE JOB OF ANY OF THE…",
  "original_created_utc": 1616002053,
  "localize": [
    {
      "locale": "zh",
      "title": "在发帖前熟悉我们的规则是你的责任，而不是我们的责任，事后教育你哪里违反了规则。",
      "the_new_excerpt": "不管你有多 \"正确\"，如果你开始侮辱别人，你就会\n将被禁止，正如我们的规则所解释的那样。告知他人的人\n自杀或任何变量将被永久禁止与或\n没有先前的禁令历史。\n\n\n这不是任何人的工作... ..."
    },
    {
      "locale": "zh-Hant",
      "title": "在發帖前熟悉我們的規則是你的責任，而不是我們的責任，事後教育你哪裏違反了規則。",
      "the_new_excerpt": "不管你有多 \"正確\"，如果你開始侮辱別人，你就會\n將被禁止，正如我們的規則所解釋的那樣。告知他人的人\n自殺或任何變量將被永久禁止與或\n沒有先前的禁令歷史。\n\n\n這不是任何人的工作... ..."
    }
  ],
  "title": "It is your responsibility to familiarize yourself with our rules before posting, not our responsibility to educate you where you broke them after the fact.",
  "created_utc": 1616013016,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It does not matter how &quot;correct&quot; you are, if you start insulting people, you will be banned as explained very clearly under our rules. People who tell others to kill themselves or WHATEVER VARIANT will be permanently banned with or without prior ban history.</p>\n\n<h1><strong>It is not the job of any of the moderators here to educate you on our rules. It is your job to know our rules before posting.</strong></h1>\n\n<p><a href=\"https://www.reddit.com/r/TooAfraidToAsk/wiki/index\">Familiarize yourself.</a></p>\n\n<p>Writing in politely will accomplish much more, and can even shorten / remove your ban. We frequently reverse permanent bans after some time has passed for polite messages regarding the ban or discussion about what went wrong / what you can change. Writing in aggressively to escalate / insult us will accomplish nothing other than extending your ban / resulting in your loss of ability to message us. If you cannot write a message calmly TO ANYBODY, it is not the time to write a message at all.</p>\n\n<p>The vast majority of you do not have run-ins with the mod team, and we thank you for doing the <strong>bare minimum</strong> that is required of you to engage in any community, which is to <em>read the rules before posting</em>.</p>\n\n<p>Thank you.</p>\n</div><!-- SC_ON -->",
  "score": 126,
  "permalink": "/r/TooAfraidToAsk/comments/m75nhy/it_is_your_responsibility_to_familiarize_yourself/",
  "subreddit": "TooAfraidToAsk",
  "id": "m75nhy",
  "is_self": true,
  "media": null,
  "is_video": false
}