{
  "author": "throwaway93820739",
  "original_created_utc": 1649169930,
  "title": "I don’t understand the argument for being born as a certain sexuality?",
  "created_utc": 1649188427,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’ve heard people say that they were “born gay” or something along those lines and they take the nature vs. nurture argument to be 100% nature and that societal influences didn’t effect their decision to come out and “if I were born in the 1300s Middle East I still would have been gay just closeted” but speaking for a biological standpoint I don’t understand how that’s possible. If you I born a certain way then it must come from a gene from your parents, and if it comes from a gene from your parents then one of your parents must have been gay, but if they aren’t attracted to the opposite sex their likelihood of having a child is significantly decreased therefore any “gay gene” (I’m not a biologist I don’t understand the argument for it so bare with me) would essentially die out. The only two arguments I could come up for this is either people have always been gay but they still had children because society didn’t allow them to open up about it, in which case as the world becomes more progressive and everyone can be open about their sexuality then the gene would die out, or the “gay gene” is recessive but in that case I find it hard to believe they a recessive gene can be so present in the population, the best example for this I found is that a recessive trait (green eyes) is present in 2% of the population, where as in America (chosen because if I did the world average it would have been skewed heavily by closeted people so I chose America because it’s more progressive) I have studies claiming 5-8% of the population identifies as LGTBQ+. That seems like a very high percentage for a recessive trait.&lt;/p&gt;\n\n&lt;p&gt;I don’t want to sound like this is coming off as bigoted, I just genuinely don’t understand if people can actually be “born gay” or if it’s more environment/nurture elements.&lt;/p&gt;\n\n&lt;p&gt;Edit: I’m getting downvoted in a lot of my responses and I’m genuinely trying to understand a concept I’m not familiar with. To all the people who took the time to write me a response - thank you I genuinely appreciate it and although we don’t see exactly eye to eye I want to understand your viewpoint. To all the people who downvoted me because they disagree with me, I’m trying to learn and you’re doing anything but impeding that.&lt;/p&gt;\n\n&lt;p&gt;Edit 2: Again, thank you everyone for all the answers I’ve gotten a lot of good explanations that do make a lot of sense, particularly the recessive gene arguments and the hormonal arguments, although I am not completely on board it definitely makes a lot more sense now. I’ve been procrastinating for about an hour and a half reading and responding to everyone and I actually need to do work now so thank you.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 111,
  "permalink": "/r/TooAfraidToAsk/comments/twwlzs/i_dont_understand_the_argument_for_being_born_as/",
  "subreddit": "TooAfraidToAsk",
  "id": "twwlzs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’ve heard people say that they were “born gay” or something along those lines\nand they take the nature vs. nurture argument to be 100% nature and that\nsocietal influences didn’t effect their decision to come out and “if I were born\nin the 1300s Middle East I still would have been gay just…"
}