{
  "author": "straydogindc",
  "the_new_excerpt": "Hey all, my first post\n[https://www.reddit.com/r/Bogleheads/comments/myloqh/how_to_set_up_a_great_boglehead_portfolio_in_5/]\nprompted a good discussion so I thought I'd write up a second one.\n\nMy first article was a walk through on how to set up a low-cost, globally\ndiversified stock portfolio with…",
  "original_created_utc": 1620698480,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、初めての投稿です。\n[https://www.reddit.com/r/Bogleheads/comments/myloqh/how_to_set_up_a_great_boglehead_portfolio_in_5/]\nが良い議論を呼んだので、2回目の記事を書こうと思いました。\n\n私の最初の記事は、低コストで世界的に分散された株式ポートフォリオを構築する方法を説明しました。\nグローバルに分散した株式ポートフォリオを構築する方法を説明しました。",
      "title": "ストックピッカーが答えられるべき3つの質問"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好，我的第一个帖子\n[https://www.reddit.com/r/Bogleheads/comments/myloqh/how_to_set_up_a_great_boglehead_portfolio_in_5/]\n引起了很好的讨论，所以我想我要写第二篇。\n\n我的第一篇文章是关于如何建立一个低成本、全球性的\n构建一个低成本、全球多元化的股票投资组合。",
      "title": "每个选股者都应该能够回答的3个问题。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好，我的第一個帖子\n[https://www.reddit.com/r/Bogleheads/comments/myloqh/how_to_set_up_a_great_boglehead_portfolio_in_5/]\n引起了很好的討論，所以我想我要寫第二篇。\n\n我的第一篇文章是關於如何建立一個低成本、全球性的\n構建一個低成本、全球多元化的股票投資組合。",
      "title": "每個選股者都應該能夠回答的3個問題。"
    }
  ],
  "title": "3 questions every stock picker should be able to answer.",
  "created_utc": 1620754153,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey all, <a href=\"https://www.reddit.com/r/Bogleheads/comments/myloqh/how_to_set_up_a_great_boglehead_portfolio_in_5/\">my first post</a> prompted a good discussion so I thought I&#39;d write up a second one.</p>\n\n<p>My first article was a walk through on how to set up a low-cost, globally diversified stock portfolio with as few as 1 single fund.</p>\n\n<p>This article covers a similar territory. How have active managers fared vs index funds? And should you pick individual stocks? I end with 3 questions I think any stock picker should be able to answer.</p>\n\n<p><strong>What are index funds? How are they different from actively managed funds?</strong></p>\n\n<p>The best way to distinguish between different kinds of funds is whether they are actively managed or whether they use some kind of rule based (sometimes called passively managed) approach.</p>\n\n<p>Active</p>\n\n<ul>\n<li>Actively managed mutual funds</li>\n<li>Actively managed ETF&#39;s</li>\n</ul>\n\n<p>&quot;Passive&quot; (people call these passive since they&#39;re not actively managed by people, but they&#39;re not actually passive since they buy and sell too)</p>\n\n<ul>\n<li>Index funds track an entire market for a low cost.</li>\n<li>ETF equivalents to index funds</li>\n</ul>\n\n<p>Mutual funds are groups of people that make decisions about which individual stocks to buy and sell within a certain investment strategy. If you invest in a mutual fund, they decide what to do with your money, and you as the investor pay them a fee. Today most mutual fund fees are about 1%.</p>\n\n<p>ETF&#39;s are basically just a more modern form of mutual fund that is more liquid, meaning it can be bought/sold through out the day. There are both ETF versions of popular index funds (VOO is the ETF form of VFINX for example) and actively managed funds (ARKK is a popular one but be careful with that one since it could be crashing).</p>\n\n<p>There are also index funds / ETF equivalents that focus on a certain part of the market. For example VTV is US value stocks, VUG is US growth stocks, VBR is small value, VBK is small growth, etc.</p>\n\n<p><strong>How do I choose between index funds &amp; actively managed mutual funds?</strong></p>\n\n<p>It helps to understand the historical context. Historically investors had to choose between investing in stocks or investing in actively-managed mutual funds.</p>\n\n<p>Then a couple decades ago this guy Jack Bogle who this group is named after pointed out that investors were paying way too much in fees. Market pricing is decided by active managers, so it&#39;s mathematically certain that on average investors who pay high fees will underperform the average of the market. So Bogle created index funds with Vanguard, which are the lowest cost way to own the entire market. At this point we have over 2 decades of index fund dominance to point to (on an after-fee basis), but many people remain unconvinced about them.</p>\n\n<p>&quot;Settling for average&quot; just doesn&#39;t *sound* convincing. And the industry isn&#39;t really incentivized to educate people since mutual funds are a higher margin business.</p>\n\n<p>The thing is, getting the &quot;market average&quot; actually means outperforming something in the ballpark of 80% of other investors. On an after fee basis, a vast majority of actively managed mutual funds underperform their benchmarks. And a vast majority of retail investors who pick stocks underperform the market. Compared to these alternatives, the just owning the entire market is a smart way to invest.</p>\n\n<p>There&#39;s a lot of research on this subject. The best study I follow is Morningstar&#39;s &quot;active/passive barometer&quot;, which compares the &quot;success rate&quot; of actively managed mutual funds vs their corresponding index over time.</p>\n\n<p>Check it out. <a href=\"https://www.morningstar.com/articles/999669/busting-the-myth-that-active-funds-do-better-in-bear-markets\">https://www.morningstar.com/articles/999669/busting-the-myth-that-active-funds-do-better-in-bear-markets</a></p>\n\n<p>This Morningstar study breaks mutual funds out by fees - most expensive vs least expensive. Pretty big difference. The lowest cost mutual funds still lose to index funds but it&#39;s closer.</p>\n\n<p>The study also breaks out mutual funds by categories (Emerging Markets vs US, Small vs Large cap, etc). Index funds do well everywhere, but relatively speaking Emerging Markets are the best place for lower cost active management. This suggests that stocks in emerging markets are less well understood in general, compared to the US where stocks are very well understood. If you&#39;d like to have active management in your portfolio, Emerging Markets are a good place for it relatively speaking.</p>\n\n<p><strong>Why is it so hard for active managers to beat the market?</strong></p>\n\n<p>Partially because stock picking is hard and partially because fees really matter.</p>\n\n<p>On the first point, something like ~90% of market pricing is hedge funds, mutual funds, and other institutions that are incentivized to exploit mispricing. How much pricing is determined by institutions depends on the security and on the level of retail active participation in the market, but the point is that pricing is primarily set by big players in the market.</p>\n\n<p>As for fees... if you&#39;re investing you&#39;re probably familiar with the concept of compounding interest. Now think of that concept in reverse. If you lose 1% to fees every year, after 10 years you didn&#39;t just lose 10% - you also lost out on the interest your $ could have accrued over that time. For a mutual fund with a 1% expense ratio to outperform, it has to outperform by &gt;1%, which in practice is difficult to do consistently.</p>\n\n<p><strong>What about picking individual stocks? Should I do that?</strong></p>\n\n<p>I think anyone who picks individual stocks should be able to answer a few questions.</p>\n\n<p><strong>Question 1: First, &quot;Why do you think you have an edge?&quot;</strong></p>\n\n<p><strong>Question 2: Or to flip the question on its head, &quot;Who in the market are you taking advantage of?&quot;</strong></p>\n\n<p>There&#39;s a quote that goes if you&#39;re at the poker table and you don&#39;t know who the chump is then you&#39;re the chump. That very much applies to investing.</p>\n\n<p>The most enduring investment strategies typically take advantage of common psychological biases like over-exuberance and greed.</p>\n\n<p>I&#39;m currently reading &quot;Richer, Wiser, Happier&quot; by the great interviewer William Green about commonalities among many of the best investors of all time. To quote Green, &quot;The market is a wonderful mechanism for transferring money from people who are irrational, impatient, and over-emotional to people who are rational, patient, and dispassionate, and who know how to value businesses.&quot;</p>\n\n<p>In the long-term, all successful investing strategies are consistently rational, patient, and dispassionate.</p>\n\n<p><strong>Question 3: So for retail investors who stock pick, the third question is,</strong> <strong>&quot;Do you have enough conviction in your process to stick with it through multiple years of underperformance?&quot;</strong></p>\n\n<p>If you look any of the best investors over the last 2-3 decades, they&#39;ve all spent multiple years in the worst performing decile. To outperform in the long-term you have to be willing to underperform over 2, 3, or 5+ year periods.</p>\n\n<p>If you look at stock pickers with the worst records, a common theme is that they began by picking stocks that have done well recently and bailed on the approach when it stopped working.</p>\n\n<p>If you don&#39;t have high conviction answers to these three questions, stock picking will likely lose you money. If you&#39;re okay with that, I&#39;d suggest using a low-cost globally diversified portfolio for most of your savings. Just set aside a portion of your $ for individual stocks.</p>\n</div><!-- SC_ON -->",
  "score": 15,
  "permalink": "/r/Bogleheads/comments/n9m856/3_questions_every_stock_picker_should_be_able_to/",
  "subreddit": "Bogleheads",
  "id": "n9m856",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985994589
}