{
  "author": "astockstonk",
  "the_new_excerpt": "KEY POINTS For the first time, customers of some U.S. banks will soon be able to\nbuy, hold and sell bitcoin through their existing accounts, according to crypto\ncustody firm NYDIG.\n\nBanks are asking for bitcoin because they can see their customers sending\ndollars to Coinbase and other crypto…",
  "original_created_utc": 1620214739,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "キーポイント 米国のいくつかの銀行の顧客が、既存の口座を通じて初めて\n既存の口座でビットコインを購入・保有・売却できるようになるとのこと。\nカストディアン企業であるNYDIGによると\n\n銀行がビットコインを求めているのは、顧客がCoinbaseやその他の暗号にドルを送っているのを見て\n銀行がビットコインを求めているのは、顧客がCoinbaseなどの暗号サービスにドルを送金しているのを見られるからです。",
      "title": "ビットコインは今年、米国の何百もの銀行に導入される"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "要点 美国一些银行的客户将首次能够在短期内\n购买、持有和出售比特币，根据加密货币托管公司NYDIG的说法。\n托管公司NYDIG称。\n\n银行要求提供比特币，因为他们可以看到他们的客户将美元发送到\n美元到Coinbase和其他加密货币...",
      "title": "比特币今年将进入数百家美国银行"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "要點 美國一些銀行的客戶將首次能夠在短期內\n購買、持有和出售比特幣，根據加密貨幣託管公司NYDIG的說法。\n託管公司NYDIG稱。\n\n銀行要求提供比特幣，因爲他們可以看到他們的客戶將美元發送到\n美元到Coinbase和其他加密貨幣...",
      "title": "比特幣今年將進入數百家美國銀行"
    }
  ],
  "title": "Bitcoin is Coming to Hundreds of US Banks This Year",
  "created_utc": 1620243693,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>KEY POINTS\nFor the first time, customers of some U.S. banks will soon be able to buy, hold and sell bitcoin through their existing accounts, according to crypto custody firm NYDIG.</p>\n\n<p>Banks are asking for bitcoin because they can see their customers sending dollars to Coinbase and other crypto exchanges, according to Yan Zhao, president of NYDIG.\n———-\nAfter rolling out the initial bitcoin product, NYDIG plans on other services, including debit card rewards paid in bitcoin, and a new type of bank account that is FDIC insured, but pays interest in bitcoin, he said.</p>\n\n<p>For the first time, customers of some U.S. banks will soon be able to buy, hold and sell bitcoin through their existing accounts, according to crypto custody firm NYDIG.</p>\n\n<p>The company, a subsidiary of $10 billion New York-based asset manager Stone Ridge, has partnered with fintech giant Fidelity National Information Services (FIS) to enable U.S. banks to offer bitcoin in the coming months, according to the two firms.</p>\n\n<p>Hundreds of banks are already enrolled in the program, according to Patrick Sells, head of bank solutions at NYDIG. While the firm is in discussions with some of the biggest U.S. banks, many of the lenders that have agreed to participate are smaller institutions like Suncrest, a California-based community bank with seven branches.</p>\n\n<p>“What we’re doing is making it simple for everyday Americans and corporations to be able to buy bitcoin through their existing bank relationships,” Sells said. “If I’m using my mobile application to do all of my banking, now I have the ability to buy, sell and hold bitcoin.”</p>\n\n<p>Until now, bitcoin adopters have relied on apps from a new generation of fintech players like free trading brokerage Robinhood, payments giants PayPal and Square, or crypto-centric firms like Coinbase. Banks, on the other hand, have steered clear of bitcoin for retail customers, only recently announcing plans to allow rich wealth management clients to be able to wager on the cryptocurrency.</p>\n\n<p>But banks are now asking for bitcoin because they can see their customers sending dollars to Coinbase and other crypto exchanges, according to Yan Zhao, president of NYDIG.</p>\n\n<p>“This is not just the banks thinking that their clients want bitcoin, they’re saying `We need to do this, because we see the data,’” Zhao said. “They’re seeing deposits going to the Coinbases and Galaxies and Krakens of the world.”</p>\n\n<p>Peer pressure</p>\n\n<p>As hundreds of smaller banks sign on, giants like JPMorgan Chase and Bank of America could face pressure to offer crypto to their retail banking customers, according to Rob Lee, head of digital banking at FIS.</p>\n\n<p>In March, Morgan Stanley was first among banks to offer bitcoin funds to its clients, CNBC reported last month. Goldman Sachs quickly followed with an announcement of its own, and JPMorgan is reportedly looking at its own product in conjunction with NYDIG.</p>\n\n<p>But in those cases, banks have relegated bitcoin to ultra-high net worth individuals and family offices with tens of millions of dollars.</p>\n\n<p>“Most people can’t invest in things that institutional investors get to invest in,” Zhao said. “With bitcoin available through your bank to be purchased with as little as $1, now you have an attractive asset that’s available to be owned by anyone in any amount. We think that’s huge for economic empowerment.”</p>\n\n<p>While FIS, which is a vendor to banks with nearly 300 million checking accounts, will handle the link to lenders, NYDIG will take care of bitcoin custody and trade execution. Disclosures will make it clear that it is NYDIG, and not the banks, that handles the bitcoin, and the cryptocurrency won’t be FDIC-insured, according to Zhao.</p>\n\n<p>FIS, based in Jacksonville, Florida, caters to banks, providing access to services like chatbots or Apple Pay. It’s also a heavyweight in the payments industry, and two years ago bought processor Worldpay for $35 billion in the sector’s biggest acquisition to date.</p>\n\n<p>Banks will determine how much to charge their customers for bitcoin trades and will retain most of that fee revenue, according to Sells. After rolling out the initial bitcoin product, NYDIG plans on other services, including debit card rewards paid in bitcoin, and a new type of bank account that is FDIC insured, but pays interest in bitcoin, he said.</p>\n\n<p>More people would own bitcoin if they could do so through their existing banks, according to a survey commissioned by NYDIG. That allows them a single view of their financial assets and avoids the need to sign up with another institution and fund the account with a money transfer that typically takes three to five business days.</p>\n\n<p><a href=\"https://www.cnbc.com/2021/05/05/bitcoin-is-coming-to-hundreds-of-us-banks-says-crypto-firm-nydig-.html\">https://www.cnbc.com/2021/05/05/bitcoin-is-coming-to-hundreds-of-us-banks-says-crypto-firm-nydig-.html</a></p>\n</div><!-- SC_ON -->",
  "score": 259,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/Lo4Aa2jS5S46RBzGcOz75f6JBD3RhlQL-5O5z5R3By8.jpg?auto=webp&s=9cc708c80e0e4191b4568d5625e0c39132ab2610",
          "width": 3543,
          "height": 2319
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/Lo4Aa2jS5S46RBzGcOz75f6JBD3RhlQL-5O5z5R3By8.jpg?width=108&crop=smart&auto=webp&s=61ba68a69ed552ac8039a5a98b013a42ac893736",
            "width": 108,
            "height": 70
          },
          {
            "url": "https://external-preview.redd.it/Lo4Aa2jS5S46RBzGcOz75f6JBD3RhlQL-5O5z5R3By8.jpg?width=216&crop=smart&auto=webp&s=d4342518e78fa58af03f705adc860f35be78b0fc",
            "width": 216,
            "height": 141
          },
          {
            "url": "https://external-preview.redd.it/Lo4Aa2jS5S46RBzGcOz75f6JBD3RhlQL-5O5z5R3By8.jpg?width=320&crop=smart&auto=webp&s=ce6e99811d98ad168d8ae7d3fd089bd3828df03a",
            "width": 320,
            "height": 209
          },
          {
            "url": "https://external-preview.redd.it/Lo4Aa2jS5S46RBzGcOz75f6JBD3RhlQL-5O5z5R3By8.jpg?width=640&crop=smart&auto=webp&s=b30947b9c2394cba6bab4dc14e654a798c4a16e7",
            "width": 640,
            "height": 418
          },
          {
            "url": "https://external-preview.redd.it/Lo4Aa2jS5S46RBzGcOz75f6JBD3RhlQL-5O5z5R3By8.jpg?width=960&crop=smart&auto=webp&s=1f93fb0766b5aa8a50e2756ab686d21303f3f717",
            "width": 960,
            "height": 628
          },
          {
            "url": "https://external-preview.redd.it/Lo4Aa2jS5S46RBzGcOz75f6JBD3RhlQL-5O5z5R3By8.jpg?width=1080&crop=smart&auto=webp&s=19d802f753656a86c1087d18abaaf351e5c2df14",
            "width": 1080,
            "height": 706
          }
        ],
        "variants": {},
        "id": "mMuqbUVUehYqKbCffefrWbcQ_AkareMPkqYT2SnSXBM"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/Bitcoin/comments/n5duww/bitcoin_is_coming_to_hundreds_of_us_banks_this/",
  "subreddit": "Bitcoin",
  "id": "n5duww",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380959883
}