{
  "author": "creeptree",
  "original_created_utc": 1632241384,
  "title": "I bought ETH for 5$ in 2016, rode it up to 1,400$ and back to 85$ in 2018",
  "created_utc": 1632267196,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Crypto is a roller-coaster. I was a passenger that had no clue what was gonna happen back in February 2016, when I first bought ETH. After my portfolio 100 x&#39;ed for the first time in 2017 greed took over. Can it do it again? A cuple of weeks later, in early 2018 it did. Of course I was sure it was gonna do the same once again soon. Then came the bear and winter was coming. On the way down I sold a good portion of my bags and felt like the biggest loser ever. Taking profits far away from the peak really did hurt, although I was still above the 100x area. When ETH reached 85$ I felt good for having sold at least a part of my holdings way above that price and at the same time I was sure the rest would slowly but steadily die off to zero. But I hodled.</p>\n\n<p>Now, with all that uncertainty on the short term horizon, I&#39;ll do the same.</p>\n\n<p>Edit: I was asked to prove it. Here&#39;s my first ever Ethereum transaction, that I made a cuple of days after I bought my ETH bag: <a href=\"https://etherscan.io/tx/0xcd108fe7e03f1c57328f0e1c1258c17b5cab1b7b1ae5e3a1cc0c69caed83297e\">https://etherscan.io/tx/0xcd108fe7e03f1c57328f0e1c1258c17b5cab1b7b1ae5e3a1cc0c69caed83297e</a> I can&#39;t remember what for, but I sent a cuple of eth off of poloniex. Probably a test transaction.</p>\n</div><!-- SC_ON -->",
  "score": 182,
  "permalink": "/r/CryptoCurrency/comments/psm6wy/i_bought_eth_for_5_in_2016_rode_it_up_to_1400_and/",
  "subreddit": "CryptoCurrency",
  "id": "psm6wy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Crypto is a roller-coaster. I was a passenger that had no clue what was gonna\nhappen back in February 2016, when I first bought ETH. After my portfolio 100\nx'ed for the first time in 2017 greed took over. Can it do it again? A cuple of\nweeks later, in early 2018 it did. Of course I was sure it was…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号はジェットコースターのようなものです。私は何が起こるかわからない乗客でした。\nETHを初めて買った2016年2月には、何が起こるかわからない乗客でした。私のポートフォリオが100\nx'edになった後、欲に支配されてしまいました。また同じことができるでしょうか？数週間後の2018年初頭には\nその数週間後、2018年の初めにそれは起こりました。もちろん、私はそれが...",
      "title": "2016年にETHを5ドルで購入し、1,400ドルまで上昇し、2018年には85ドルまで戻りました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "晶体管是一个过山车。我是一名乘客，不知道会发生什么。\n在2016年2月，当我第一次买入ETH的时候，我是一个不知道会发生什么的乘客。在我的投资组合100\n在2017年第一次出现，贪婪占据了上风。它能再做一次吗？几周后，在2018年初，ETH确实达到了\n周后，在2018年初，它做到了。当然，我确信它是...",
      "title": "我在2016年以5美元买入ETH，骑到1400美元，在2018年又回到了85美元"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "晶體管是一個過山車。我是一名乘客，不知道會發生什麼。\n在2016年2月，當我第一次買入ETH的時候，我是一個不知道會發生什麼的乘客。在我的投資組合100\n在2017年第一次出現，貪婪佔據了上風。它能再做一次嗎？幾周後，在2018年初，ETH確實達到了\n周後，在2018年初，它做到了。當然，我確信它是...",
      "title": "我在2016年以5美元買入ETH，騎到1400美元，在2018年又回到了85美元"
    }
  ]
}