{
  "author": "Always_Question",
  "original_created_utc": 1625936335,
  "title": "We are at or near The End of the Chinese Communist Government's ability to FUD Bitcoin",
  "created_utc": 1625964469,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Some elements within the Chinese government have opened major short positions on Bitcoin right before announcing major FUD. They have done this at least three times since 2013. I think this last one in May will be the last effective one. Not only because people are catching on to the scam, but also because they have now driven out most miners from the country and banned all transactions. This was perfectly timed with Elon&#39;s flip-flop. Elon was then immediately awarded by the Chinese government (where he had previously been struggling with red tape and bad press). The only arrow the Chinese Communist Party have left in their quiver is to ban possession, but that would be impossible to enforce, and would only make the CCP appear weak (the thing they fear the most) due to their inability to effectively enforce. So I think we are at or near the end of the Chinese short-crypto-then-FUD scam.</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/Bitcoin/comments/ohme5t/we_are_at_or_near_the_end_of_the_chinese/",
  "subreddit": "Bitcoin",
  "id": "ohme5t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Some elements within the Chinese government have opened major short positions on\nBitcoin right before announcing major FUD. They have done this at least three\ntimes since 2013. I think this last one in May will be the last effective one.\nNot only because people are catching on to the scam, but also…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "中国政府内の一部の要素は、大規模なFUDを発表する直前に、ビットコインの大規模なショートポジションを開設しました。\n大規模なFUDを発表する直前に、ビットコインの大規模なショートポジションを開設しています。2013年以降、このようなことを少なくとも3回\n2013年以降、少なくとも3回行われています。私はこの5月のものが最後の効果的なものになると思います。\n人々がこの詐欺に気づいているからだけではなく、...",
      "title": "私たちは、中国共産党政府がビットコインをFUDする能力の終わりに近づいています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "中国政府中的一些人在宣布重大恐惧症之前，已经对比特币建立了主要的空头头寸。\n在宣布重大恐惧症之前，比特币的主要空头。自2013年以来，他们至少有三次这样做\n自2013年以来，他们至少做过三次。我认为5月份的这最后一次将是最后一次有效的做法。\n这不仅是因为人们正在发现这个骗局，而且...",
      "title": "我们正处于或接近中共政府对比特币的恐惧能力的尽头"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "中國政府中的一些人在宣佈重大恐懼症之前，已經對比特幣建立了主要的空頭頭寸。\n在宣佈重大恐懼症之前，比特幣的主要空頭。自2013年以來，他們至少有三次這樣做\n自2013年以來，他們至少做過三次。我認爲5月份的這最後一次將是最後一次有效的做法。\n這不僅是因爲人們正在發現這個騙局，而且...",
      "title": "我們正處於或接近中共政府對比特幣的恐懼能力的盡頭"
    }
  ]
}