{
  "author": "hannahstohelit",
  "original_created_utc": 1648771727,
  "title": "APRIL FOOLS ALERT- AskHistoricalFiguresAnything, aka r/HistoricalAMA, is up and running!",
  "created_utc": 1648802189,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi everyone!&lt;/p&gt;\n\n&lt;p&gt;As is tradition, for April Fools we let our hair down a bit and allow some frivolity to infest the subreddit. This year we are doing  &lt;a href=\"/r/HistoricalAMA\"&gt;r/HistoricalAMA&lt;/a&gt;, inviting historical figures from throughout the centuries to answer questions from their legions of fans.&lt;/p&gt;\n\n&lt;p&gt;Until 23:59, we are allowing AMA style submissions to be made by the &lt;em&gt;approved alt accounts&lt;/em&gt; of the Flaired Users of the subreddit, but are relaxing the rules for commenting (especially asking questions) in all threads with the &amp;#39;April Fools&amp;#39; Flair for all users. Please, ask the historical figures anything!&lt;/p&gt;\n\n&lt;p&gt;The only rules in effect are those concerning civility, and as long as it is done in a joking manner towards the flaired alts, we even have some leeway there. Please just avoid racial, misogynistic, and other bigoted slurs, and please keep the questions relatively tasteful.&lt;/p&gt;\n\n&lt;p&gt;You are welcome to make your own alts to comment with, although we won&amp;#39;t be flairing them, but please &lt;em&gt;only&lt;/em&gt; use them in April Fools threads. We will ban novelty accounts if they post in character elsewhere.&lt;/p&gt;\n\n&lt;p&gt;Particularly for this event, we highly recommend saving threads that you find interesting and checking on them later after asking a question- all of our posters will be on their own schedules so they may not answer your questions right away, but they will do their best!&lt;/p&gt;\n\n&lt;p&gt;Have fun!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/ttdhdm/april_fools_alert_askhistoricalfiguresanything/",
  "subreddit": "AskHistorians",
  "id": "ttdhdm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hi everyone!\n\nAs is tradition, for April Fools we let our hair down a bit and allow some\nfrivolity to infest the subreddit. This year we are doing r/HistoricalAMA\n[/r/HistoricalAMA], inviting historical figures from throughout the centuries to\nanswer questions from their legions of fans.\n\nUntil…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "みなさん、こんにちは。\n\nエイプリルフールでは、恒例として、少し髪を緩めて、いくつかの\nサブレディットにはびこる悪ふざけ。今年はr/HistoricalAMAをやります。\n[歴史上の人物を招き、その人物の生涯を語ってもらうというものです。\n多くのファンからの質問に答える。\n\nそれまでは...",
      "title": "APRIL FOOLS ALERT- AskHistoricalFiguresAnything, aka r/HistoricalAMA が稼働中です!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好!\n\n按照传统，对于愚人节，我们将头发放下来一点，允许一些\n愚人节的时候，我们把头发放下来，让一些轻浮的东西充斥着这个子目录。今年我们要做的是r/HistoricalAMA\n[/r/HistoricalAMA]，邀请几个世纪以来的历史人物来\n回答他们的粉丝团提出的问题。\n\n直到...",
      "title": "APRIL FOOLS ALERT- AskHistoricalFiguresAnything, aka r/HistoricalAMA, is up and running!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好!\n\n按照傳統，對於愚人節，我們將頭髮放下來一點，允許一些\n愚人節的時候，我們把頭髮放下來，讓一些輕浮的東西充斥着這個子目錄。今年我們要做的是r/HistoricalAMA\n[/r/HistoricalAMA]，邀請幾個世紀以來的歷史人物來\n回答他們的粉絲團提出的問題。\n\n直到...",
      "title": "APRIL FOOLS ALERT- AskHistoricalFiguresAnything, aka r/HistoricalAMA, is up and running!"
    }
  ]
}