{
  "author": "hannahstohelit",
  "original_created_utc": 1648771727,
  "title": "APRIL FOOLS ALERT- AskHistoricalFiguresAnything, aka r/HistoricalAMA, is up and running!",
  "created_utc": 1648802189,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi everyone!&lt;/p&gt;\n\n&lt;p&gt;As is tradition, for April Fools we let our hair down a bit and allow some frivolity to infest the subreddit. This year we are doing  &lt;a href=\"/r/HistoricalAMA\"&gt;r/HistoricalAMA&lt;/a&gt;, inviting historical figures from throughout the centuries to answer questions from their legions of fans.&lt;/p&gt;\n\n&lt;p&gt;Until 23:59, we are allowing AMA style submissions to be made by the &lt;em&gt;approved alt accounts&lt;/em&gt; of the Flaired Users of the subreddit, but are relaxing the rules for commenting (especially asking questions) in all threads with the &amp;#39;April Fools&amp;#39; Flair for all users. Please, ask the historical figures anything!&lt;/p&gt;\n\n&lt;p&gt;The only rules in effect are those concerning civility, and as long as it is done in a joking manner towards the flaired alts, we even have some leeway there. Please just avoid racial, misogynistic, and other bigoted slurs, and please keep the questions relatively tasteful.&lt;/p&gt;\n\n&lt;p&gt;You are welcome to make your own alts to comment with, although we won&amp;#39;t be flairing them, but please &lt;em&gt;only&lt;/em&gt; use them in April Fools threads. We will ban novelty accounts if they post in character elsewhere.&lt;/p&gt;\n\n&lt;p&gt;Particularly for this event, we highly recommend saving threads that you find interesting and checking on them later after asking a question- all of our posters will be on their own schedules so they may not answer your questions right away, but they will do their best!&lt;/p&gt;\n\n&lt;p&gt;Have fun!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/ttdhdm/april_fools_alert_askhistoricalfiguresanything/",
  "subreddit": "AskHistorians",
  "id": "ttdhdm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hi everyone!\n\nAs is tradition, for April Fools we let our hair down a bit and allow some\nfrivolity to infest the subreddit. This year we are doing r/HistoricalAMA\n[/r/HistoricalAMA], inviting historical figures from throughout the centuries to\nanswer questions from their legions of fans.\n\nUntil…"
}