{
  "author": "MyHousePlantIsWasted",
  "the_new_excerpt": "In short, like I'm sure most people reading this, I am of the opinion that war\nis bad. So much can be said about the human suffering that is caused by war, and\nwhile it's inevitability can be debated until the cows come home, I will never\nnot be humbled by the utter awfulness that it has…",
  "original_created_utc": 1620429919,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "要するに、これを読んでいるほとんどの人がそうであるように、私も戦争は悪いものだと考えています。\nは悪いものだと思っています。戦争によって引き起こされる人間の苦しみについては、多くのことが語られています。\nその必然性については牛が家に帰るまで議論されるでしょうが、私は絶対に\nしかし、私は戦争の持つ恐ろしさには決して屈することはありません...",
      "title": "戦争や暴力は根本的に嫌いだけど、戦争のための乗り物や機械、物流は最高にクールだと思う人はいませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "简而言之，就像我相信大多数人在读这篇文章时一样，我认为战争\n是不好的。关于战争所造成的人类痛苦，可以说有很多，而且\n虽然它的不可避免性可以被辩论，直到奶牛回家，我将永远不会\n我永远不会对战争的可怕性感到惭愧......",
      "title": "是否有人从根本上讨厌战争和暴力，但仍然觉得战争的车辆、机械和后勤是最酷的东西？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "簡而言之，就像我相信大多數人在讀這篇文章時一樣，我認爲戰爭\n是不好的。關於戰爭所造成的人類痛苦，可以說有很多，而且\n雖然它的不可避免性可以被辯論，直到奶牛回家，我將永遠不會\n我永遠不會對戰爭的可怕性感到慚愧......",
      "title": "是否有人從根本上討厭戰爭和暴力，但仍然覺得戰爭的車輛、機械和後勤是最酷的東西？"
    }
  ],
  "title": "Does anyone else hate war and violence in general on a fundamental level, but still find the vehicles, machinery, and logistics of war to be just the coolest sh*t?",
  "created_utc": 1620456611,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In short, like I&#39;m sure most people reading this, I am of the opinion that war is bad. So much can be said about the human suffering that is caused by war, and while it&#39;s inevitability can be debated until the cows come home, I will never not be humbled by the utter awfulness that it has historically put people through and caused people to do to each other. Even on a personal level I am a pacifist, and always seek to make friends first and always challenge my negative opinions of and gestures towards others.</p>\n\n<p>However... </p>\n\n<p>God damn dude tanks, guns, warships, jet fighters, WWII planes, artillery, large scale battles, guerilla warfare, bombs, it&#39;s all just the coolest shit ever... knowing that it is all designed specifically to cause death and destruction sometimes plays on my mind... but I dunno man, it&#39;s all just so goddamn cool.</p>\n\n<p>Anyone else feel this way?</p>\n</div><!-- SC_ON -->",
  "score": 125,
  "permalink": "/r/TooAfraidToAsk/comments/n7bz0i/does_anyone_else_hate_war_and_violence_in_general/",
  "subreddit": "TooAfraidToAsk",
  "id": "n7bz0i",
  "is_self": true,
  "media": null,
  "is_video": false
}