{
  "author": "MySubjectiveFacts",
  "original_created_utc": 1656887152,
  "title": "YouTube crypto influencers are 21st century snake oil salesmen",
  "created_utc": 1656906968,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It has to be said: an overwhelming amount of crypto “influencers”  are no better than used car salesmen or snake oil salesmen.&lt;/p&gt;\n\n&lt;p&gt;Their enthusiasm during bull runs is almost never curbed by the principles of sound investing practices.  &lt;/p&gt;\n\n&lt;p&gt;Guys like James from Investanswers try to sound responsible by advocating for diversification within the Crypto world, while at the same time publishing hour long videos “analyzing” data which proves how one can retire by 2035 on “X” coin because “charts.”&lt;/p&gt;\n\n&lt;p&gt;These are the people who pump coins (Terra Luna), claiming future price points of $80k while not being able to identify even a single red flag.&lt;/p&gt;\n\n&lt;p&gt;These are the same people who advocate for giving up your keys to companies like Celsius to earn a nearly risk free yield.&lt;/p&gt;\n\n&lt;p&gt;But they aren’t culpable of anything because they start their videos with “this isn’t investment advice.”  What they should say is “this isn’t good investing advice.”&lt;/p&gt;\n\n&lt;p&gt;It’s easy to look smart in a bull market, but it’s when the tide goes back out when we find out who was swimming naked.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 487,
  "permalink": "/r/CryptoCurrency/comments/vqspcr/youtube_crypto_influencers_are_21st_century_snake/",
  "subreddit": "CryptoCurrency",
  "id": "vqspcr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "It has to be said: an overwhelming amount of crypto “influencers” are no better\nthan used car salesmen or snake oil salesmen.\n\nTheir enthusiasm during bull runs is almost never curbed by the principles of\nsound investing practices.\n\nGuys like James from Investanswers try to sound responsible by…"
}