{
  "author": "HiCarumba",
  "original_created_utc": 1626518151,
  "title": "This is why the Markets dipping and when it will stop",
  "created_utc": 1626554189,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The reason for the Market Dip is clear and simple.<br/>\nThe Stochastic indicator didn&#39;t show a Head and shoulder pattern and this was mainly because the Difficulty Ribbon Compression was in front of Moving Average Convergence Divergence and not behind the Bollinger Band which meant the Relative Strength Indicator (RSI) resulted in a Death Cross. So, obviously, when the Alpha-Beta Trend Channel crosses the Arms ease of Movement which allows an increase or decrease in the Chaikin Oscillator then the market will stop dipping.<br/>\nCouldn&#39;t be any clearer really.</p>\n\n<p>Click subscribe for more tips!</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/om1tom/this_is_why_the_markets_dipping_and_when_it_will/",
  "subreddit": "CryptoCurrency",
  "id": "om1tom",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The reason for the Market Dip is clear and simple.\nThe Stochastic indicator didn't show a Head and shoulder pattern and this was\nmainly because the Difficulty Ribbon Compression was in front of Moving Average\nConvergence Divergence and not behind the Bollinger Band which meant the\nRelative Strength…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今回のマーケットディップの理由は明確でシンプルです。\nストキャスティクスがヘッドアンドショルダーのパターンを示さなかったからです。\n難易度リボン圧縮が移動平均線の前にあり、ボリンジャーバンドの後ろになかったからです。\nコンバージェンス・ダイバージェンスが移動平均線の前にあり、ボリンジャー・バンドの後ろになかったからです。\nRelative Strength...",
      "title": "これが、市場が低迷する理由であり、いつ止まるのかということです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "市场下跌的原因很清楚也很简单。\n随机指标没有显示出头肩顶模式，这主要是因为困难带压制在前面。\n这主要是因为困难带压制在移动平均线的前面，而不是在布林带的后面。\n收敛背离，而不是在布林带后面，这意味着\n相对强度...",
      "title": "这就是市场下跌的原因以及何时会停止的原因"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "市場下跌的原因很清楚也很簡單。\n隨機指標沒有顯示出頭肩頂模式，這主要是因爲困難帶壓制在前面。\n這主要是因爲困難帶壓制在移動平均線的前面，而不是在布林帶的後面。\n收斂背離，而不是在布林帶後面，這意味着\n相對強度...",
      "title": "這就是市場下跌的原因以及何時會停止的原因"
    }
  ]
}