{
  "author": "IWannaDoBadThingswU",
  "original_created_utc": 1658755911,
  "title": "Was the short haired and clean shaved ancient Roman man peculiar for his time?",
  "created_utc": 1658777310,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I was thinking that most depictions of ancient Romans show them with a short haircut and a clean shaven face whereas other people have long hair or beards or mustaches.&lt;/p&gt;\n\n&lt;p&gt;The Gauls, depictions of Vercingetorix show him with long hair and mustache. The Germanic tribes are described by Romans as having long hair that they only cut when they lost a battle. The ancient Greeks, most of them seem to have had bushy beards (notable exception being Alexander the Great). Whereas Caesar, Octavian, Scipio, Marc Anthony, Trajan are all clean shaven and have short haircuts.&lt;/p&gt;\n\n&lt;p&gt;Later on, Huns, Mongols, Turks have either long hair or those thin long mustaches. Even people Europeans met later, like Native Americans or Polinesians are also depicted as having long hair.&lt;/p&gt;\n\n&lt;p&gt;So, were the Romans peculiar in this regard or is there a bias involved? Maybe only those images stuck in my head and there are other depictions I&amp;#39;m not thinking of. Maybe they didn&amp;#39;t wear their hair like that, but were depicted as such by Europeans because long hair = barbarian.&lt;/p&gt;\n\n&lt;p&gt;Also, a sort of follow up question if my previous assumption is correct. Is this why nowadays a short haircut and a clean shave is considered &amp;quot;proper&amp;quot; and long hair and beards are considered &amp;quot;unkempt&amp;quot;? Is this a vestige of Roman civilisation unconsciously transmitted to this day?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/w7p2hf/was_the_short_haired_and_clean_shaved_ancient/",
  "subreddit": "AskHistorians",
  "id": "w7p2hf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I was thinking that most depictions of ancient Romans show them with a short\nhaircut and a clean shaven face whereas other people have long hair or beards or\nmustaches.\n\nThe Gauls, depictions of Vercingetorix show him with long hair and mustache. The\nGermanic tribes are described by Romans as…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "古代ローマ人の描写は、ほとんどが短髪で描かれていると考えていました。\nているのに対して、他の人々は長髪やひげを生やしている。\n口ひげを生やしている。\n\nガリア人は、ヴェルシンゲトリクスは長髪で口ひげを生やしている。その\nゲルマン民族はローマ人によって次のように描写されている。",
      "title": "短髪で髭を剃った古代ローマ人は、当時としては特殊な存在だったのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在想，大多数对古罗马人的描写都是短发，脸部刮得干干净净的。\n而其他人则是长发、胡须或胡子。\n胡子。\n\n高卢人，对Vercingetorix的描述显示他是长发和胡须。日耳曼人\n日耳曼部落被罗马人描述为...",
      "title": "短发和剃光头的古罗马人在他的时代是很特别的吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在想，大多數對古羅馬人的描寫都是短髮，臉部颳得乾乾淨淨的。\n而其他人則是長髮、鬍鬚或鬍子。\n鬍子。\n\n高盧人，對Vercingetorix的描述顯示他是長髮和鬍鬚。日耳曼人\n日耳曼部落被羅馬人描述爲...",
      "title": "短髮和剃光頭的古羅馬人在他的時代是很特別的嗎？"
    }
  ]
}