{
  "author": "spartan0746",
  "the_new_excerpt": "Many of us here have been around crypto for quite a long time, particularly a\nlarge bunch will have joined in 2017.\n\nI am not going to say this feels similar to last time or make any predictions on\nprices, I am far too incompetent to make any judgements like that, as I will\nshortly point out; but I…",
  "original_created_utc": 1618995679,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここにいる私たちの多くは、かなり長い間クリプトに関わっており、特に\n大勢が2017年に参加しているでしょう。\n\n私は、前回と同じような感じだと言ったり、価格の予測をしたりするつもりはありません。\n私はそのような判断をするにはあまりにも無能なので、すぐに指摘します。\nしかし、私は...",
      "title": "なぜ私が机の上に「-99.82%」の写真を置いているのかという話。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们这里的许多人已经在加密货币周围工作了相当长的时间，特别是一大批人将在2017年加入。\n大批人将在2017年加入。\n\n我不会说现在的感觉和上次差不多，也不会对价格做出任何预测。\n价格，我太无能了，无法做出这样的判断，正如我将会\n很快指出；但我...",
      "title": "一个关于我为什么把-99.82%的照片放在桌上的故事。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們這裏的許多人已經在加密貨幣周圍工作了相當長的時間，特別是一大批人將在2017年加入。\n大批人將在2017年加入。\n\n我不會說現在的感覺和上次差不多，也不會對價格做出任何預測。\n價格，我太無能了，無法做出這樣的判斷，正如我將會\n很快指出；但我...",
      "title": "一個關於我爲什麼把-99.82%的照片放在桌上的故事。"
    }
  ],
  "title": "A tale of why I keep a picture on my desk of -99.82%.",
  "created_utc": 1619015874,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Many of us here have been around crypto for quite a long time, particularly a large bunch will have joined in 2017. </p>\n\n<p>I am not going to say this feels similar to last time or make any predictions on prices, I am far too incompetent to make any judgements like that, as I will shortly point out; but I will make some observations that I hope can put a perspective on the current market, from someone that has gone through this. </p>\n\n<ul>\n<li>  During the last bull run, crypto was everywhere. It got to the stage where the average person became interested, I even had family members who didn’t own a PC asking if they should buy those ‘<em>computer coins</em>’ and recently the same thing has happened again. </li>\n<li>  Those same people that got burnt last time are coming back and flooding the market with more investment, which is great, but they are also much more conservative and risk averse. </li>\n<li>  Alongside that we are once again at the point of ALT season with every coin pumping for no reason. </li>\n</ul>\n\n<p>This last point is the reason for this post. 4 years ago I like everyone else got caught up in believing I was a genius, every trade I made went up and I could see no downside. </p>\n\n<p>Along comes DBC. Many here will see this coin and shudder; it was heavily shilled at the time as a new technology that will move the AI revolution going forward, <em>it could not lose</em>, until it did. </p>\n\n<p>During the downturn it crashed HARD and unlike other coins it never recovered. </p>\n\n<p>I now use a printout of my Blockfolio losses related to DBC as a reminder to play the long game, purchase a coin with good following and good potential and just wait. </p>\n\n<p>And that was a short story of why I keep a printout of <strong>-99.82%</strong> on my desk.</p>\n</div><!-- SC_ON -->",
  "score": 484,
  "permalink": "/r/CryptoCurrency/comments/mvblzy/a_tale_of_why_i_keep_a_picture_on_my_desk_of_9982/",
  "subreddit": "CryptoCurrency",
  "id": "mvblzy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171523336
}