{
  "approved_at_utc": null,
  "subreddit": "wallstreetbets",
  "selftext": " \n\nWhether you agree with what I said, I hope you have the patience to read all this article I wrote. I think the financial crisis in the United States may be simmering and preparing to break out. Compared with inflation in the United States and the Fed's shrinking balance sheet. I'm more concerned about U.S. corporate debt. Due to the Fed's unlimited quantitative easing policy, low-interest rate loans, and financial easing conditions in recent years. This happen has led to false prosperity in the financial market in the United States in recent years. Many companies have a lot of \"leveraged loans\" behind these fake financial bubbles.\n\nClear regulations in the United States do not regulate these leveraged loans. Leveraged loans are not subject to a standard exchange market. Under normal circumstances, the bonds issued by American companies are issued in accordance with the management and supervision stipulated by the government to issue bonds according to the credit equality given by the bond credit rating agency. However, companies can directly borrow money from financial institutions to obtain leveraged loans in terms. In a sense, leveraged loans are shadow banks that the U.S. government cannot effectively regulate. The survey in the U.S. Federal Reserve report does not know precisely how large these leveraged loans are now and how catastrophic the impact on financial markets will be. Because these leveraged loans are not effectively regulated, this means that many companies can expand and borrow as much as they want. In the past two years, the big bull market in the U.S. financial market, including the stock market. Since the market interest rate at that time was very cheap, I believe that many companies (including zombie companies) took out leveraged loans to buy back their own company shares, possibly to company pay interest dividends or invest in other stocks, or do other things. The unprecedented rapid growth of the bull market in the past two years is not necessarily caused by unlimited Q.E. but may also be caused by the use of leveraged loans by these companies. These corporate actions have created a serious potential bubble in U.S. financial markets. Because the Federal Reserve has raised interest rates seriously this year, the scope of interest rate hikes is believed to be far beyond the market and many people's expectations. This rate hike by the Federal Reserve puts a lot of repayment pressure on companies that take advantage of leveraged loans. Because leveraged loans are floating interest rates, not fixed interest rates, therefore, these leveraged loan interest rates will soar with market interest rates. A recession in the U.S. is now evident. In the current period of economic recession and high inflation, the consumption power of many people is significantly reduced, which will also lead to the operation of many enterprises will become worse. This means that the repayment ability of many companies that have borrowed leveraged loans, coupled with the sharp rise in floating interest rates, makes many companies unable to repay these leveraged loans and interest. Therefore, this may also cause the company's capital chain to break, a large number of loan defaults, and corporate bankruptcy. Once the company goes bankrupt, it will further form a large wave of unemployment and bring a more serious blow to the U.S. economy. And the Fed will be caught in a dilemma at this time. So is the Fed going to continue raising interest rates and shrinking its balance sheet to curb inflation, or does it choose to cut interest rates and quantify indefinitely to save the market at this time (but this will further increase inflation).\n\nAnother issue worthy of attention is that the scale of leveraged loans in the United States is large enough to trigger a global financial crisis. It's bigger than all the combined high-yield (junk bonds) in the U.S. That is, how big is it? This leveraged loan may add up to more than 10% of the debt of all non-financial corporations in the United States. So what is the concept of over 10%? We can now think of the subprime mortgage crisis of 2008. That crisis was a financial crisis caused by subprime lending. If I remember correctly, the size of real estate subprime loans at that time was about 600 billion U.S. dollars. The entire U.S. real estate loan was about 9.3 trillion U.S. dollars at that time. As I recall, such a scale only accounts for about 6% of real estate loans. And this leveraged loan scale is as large as more than 10% of all corporate debt. So from this loan situation, you can see that it is worse than the subprime mortgage crisis in the United States in 2008. And the scariest thing, and what worries me the most, is that its history repeats the same behavior that triggered the subprime mortgage crisis in 2008. \n\nFinancial institutions package these leveraged corporate loans as an asset Securitization financial product called \"(Collateralized Loan Obligations)\" to be sold to investors around the world. To me, it's no different from the \"(Collateralized debt obligation\") that sparked the 2008 subprime mortgage crisis. One is from real estate, and the other is from companies. They all pass the risk on to the investor in the same way. Due to the Fed's unlimited quantitative easing and low-interest rates in recent years, I think the scale of these leveraged loans may have exceeded 2 trillion. 50% of them are packaged and sold to investment institutions around the world, and the other 50% are packaged and sold to retail investors across the globe. The Federal Reserve has been actively raising interest rates and shrinking its balance sheet, coupled with the severe recession in the US local economy, including rising inflation and a decline in people's purchasing power. This will inevitably result in many companies being unable to repay these leveraged loans. Then it will cause a butterfly effect similar to the subprime mortgage crisis in 2008; it is most likely to be the same as the CDO at that time, a more global severe crisis caused by the CLO.\n\nIn 2020 when Fed starts QE to save the market. I calculated and think that the Fed should begin raising interest rates and shrinking its balance sheet at the beginning of 2021. Because at that time, I felt that if the Fed did not start growing interest rates and shrinking its balance sheet, then the next year would inevitably lead to irreversible and completely out-of-control inflation so that the country would experience an economic recession. Because I understand the industrial structure of the United States very well, and I know very well that the new coronavirus, an RNA virus, mutates very fast, and it is difficult for humans to control these extremely fast mutating viruses effectively. Therefore, these viruses will affect the efficiency of industries and supply chains worldwide. Once there is a problem with the supply chain, it is difficult to solve the problem of the country's employment rate. Especially for a country like the United States that relies on imports, once there is a problem with the supply chain around the world, the goods in the United States cannot keep up with the printed money, which will further cause inflation. Even if the government stops issuing relief funds, it will not solve the problem of people's employment because the virus's substantial spread and mutation speed has fundamentally hindered the normal development of the country's supply chain and production efficiency. However, if printing money indefinitely and the supply chain cannot keep up, it will inevitably lead to unprecedented severe inflation. \n\nTo solve this kind of inflation, aggressive interest rate hikes and balance sheet reductions are likely to be ineffective, which will only further aggravate the country's economic recession and face difficulties for a large number of companies. Now raising interest rates and shrinking the balance sheet will trigger the Great Depression; not raising interest rates and choosing quantitative easing and low-interest rates will continue to fuel inflation. If we want to solve this kind of problem, we can only have a major world war, transfer all domestic economic contradictions, and let all countries' wealth be redistributed to our own country. This may solve the various recessions and inflation in the United States this time. But I believe that in the atomic bomb era, I don't think any country would dare to take this road. So I thought then that the Fed wasn't unaware of this kind of thing and it is impossible not to consider these issues. Because I was too confident in my judgment, I also tried to start shorting the entire US stock market at the 2021 position. But it turned out that I was too naive and too overestimated the Fed's decision-making and responsiveness. I didn't expect that the Fed not only did not start raising interest rates and shrinking its balance sheet at that time but instead printed trillions more. This shocked me a lot and let me lose some money from shorting. But when the Fed did this, I realized that the Fed was going to ruin the country again.\n\nIn 2008, the Federal Reserve almost destroyed the country at that time. Because of the too-loose housing market and financial supervision, plus the Fed's indecisive response to the bailout. Many Americans blamed Wall Street, believing that it was all Wall Street's fault. But I think Wall Street has a lot of responsibility for this sort of thing, but the Fed and the SEC have more considerable responsibility. This time, the Fed and SEC have one thing in common that happened in 2008. That is, the Fed did not choose to rescue the market earlier at that time, and its indecision there led to the bankruptcy of Lehman, which led to a global financial crisis. This time, the Fed did not choose to do so when it was supposed to raise interest rates and shrink its balance sheet in early 2021, and it continued to increase unlimited quantitative easing. As a result, it will lead to more giant bubbles in financial markets and inflation that will spiral out of control. Once inflation is out of control, it will be accompanied by an economic recession, which will be accompanied by a decline in the consumption power of the masses and a decline in corporate earnings, even to the brink of bankruptcy. Coupled with the fact that the Federal Reserve chose to aggressively raise interest rates and shrink its balance sheet at this time, it has left companies unable to pay interest on loans and have no ability to repay their loans. Then it is very likely that the default on those leveraged loans will lead to a global financial crisis caused by the CLO. In addition, this time, the SEC did not supervise effectively where it should be, as it caused the subprime mortgage crisis, but today they do not supervise leveraged loans. So I believe that CLO will definitely cause a worldwide financial crisis due to leveraged loans. From now on, the credit risk spread of CCC-rated companies is soaring rapidly, and I believe that the interest of leveraged loans is soaring rapidly with the aggressive rate hike by the Fed rate hike.\n\nAs these conditions continue to get worse and worse, I estimate that the bubble will burst as soon as next year, 2023, and no more than 2024. I was hoping you could discover the investigation of leveraged loan bubbles to verify what I have written here is probably true and whether it may happen in the future. If anyone finds it possible, please go to the investment bank to short these leveraged loans to bet with the investment bank to build a similar CDS. I'm not a fund manager; I'm just a small retail trader and don't have the money to make a bet with an investment bank. So, unfortunately, this idea could not be realized. But I hope the people who could read this will fulfill this opportunity.  **All of this I write is not investment advice.** Maybe I'm overthinking what's in there. But I don't want to give up either possibility. I'm not an institutional investment manager, and I have no way of intervening through the connections and privileges of an institution to get some detailed data that I can't find online. Because not all information can be found online, especially the data that financial institutions deliberately conceal. Therefore, it is necessary to conduct an on-the-spot investigation and some data that can only be obtained from this related industry to determine whether this bubble is real. I hope you can use all your contacts and abilities to investigate whether the bubbles I am talking about are possible.",
  "author_fullname": "t2_joid0c2m",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "The financial crisis in the United States is about to happen! ! ! ! ! !",
  "link_flair_richtext": [
    {
      "e": "text",
      "t": "Discussion"
    }
  ],
  "subreddit_name_prefixed": "r/wallstreetbets",
  "hidden": false,
  "pwls": 7,
  "link_flair_css_class": "question",
  "downs": 0,
  "thumbnail_height": null,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_vrp4do",
  "quarantine": false,
  "link_flair_text_color": "light",
  "upvote_ratio": 0.79,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 1115,
  "total_awards_received": 11,
  "media_embed": {},
  "thumbnail_width": null,
  "author_flair_template_id": null,
  "is_original_content": true,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Discussion",
  "can_mod_post": false,
  "score": 1115,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": true,
  "thumbnail": "nsfw",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {
    "gid_1": 4,
    "gid_3": 1
  },
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1656993734,
  "link_flair_type": "richtext",
  "wls": 3,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.wallstreetbets",
  "allow_live_comments": true,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Whether you agree with what I said, I hope you have the patience to read all this article I wrote. I think the financial crisis in the United States may be simmering and preparing to break out. Compared with inflation in the United States and the Fed&amp;#39;s shrinking balance sheet. I&amp;#39;m more concerned about U.S. corporate debt. Due to the Fed&amp;#39;s unlimited quantitative easing policy, low-interest rate loans, and financial easing conditions in recent years. This happen has led to false prosperity in the financial market in the United States in recent years. Many companies have a lot of &amp;quot;leveraged loans&amp;quot; behind these fake financial bubbles.&lt;/p&gt;\n\n&lt;p&gt;Clear regulations in the United States do not regulate these leveraged loans. Leveraged loans are not subject to a standard exchange market. Under normal circumstances, the bonds issued by American companies are issued in accordance with the management and supervision stipulated by the government to issue bonds according to the credit equality given by the bond credit rating agency. However, companies can directly borrow money from financial institutions to obtain leveraged loans in terms. In a sense, leveraged loans are shadow banks that the U.S. government cannot effectively regulate. The survey in the U.S. Federal Reserve report does not know precisely how large these leveraged loans are now and how catastrophic the impact on financial markets will be. Because these leveraged loans are not effectively regulated, this means that many companies can expand and borrow as much as they want. In the past two years, the big bull market in the U.S. financial market, including the stock market. Since the market interest rate at that time was very cheap, I believe that many companies (including zombie companies) took out leveraged loans to buy back their own company shares, possibly to company pay interest dividends or invest in other stocks, or do other things. The unprecedented rapid growth of the bull market in the past two years is not necessarily caused by unlimited Q.E. but may also be caused by the use of leveraged loans by these companies. These corporate actions have created a serious potential bubble in U.S. financial markets. Because the Federal Reserve has raised interest rates seriously this year, the scope of interest rate hikes is believed to be far beyond the market and many people&amp;#39;s expectations. This rate hike by the Federal Reserve puts a lot of repayment pressure on companies that take advantage of leveraged loans. Because leveraged loans are floating interest rates, not fixed interest rates, therefore, these leveraged loan interest rates will soar with market interest rates. A recession in the U.S. is now evident. In the current period of economic recession and high inflation, the consumption power of many people is significantly reduced, which will also lead to the operation of many enterprises will become worse. This means that the repayment ability of many companies that have borrowed leveraged loans, coupled with the sharp rise in floating interest rates, makes many companies unable to repay these leveraged loans and interest. Therefore, this may also cause the company&amp;#39;s capital chain to break, a large number of loan defaults, and corporate bankruptcy. Once the company goes bankrupt, it will further form a large wave of unemployment and bring a more serious blow to the U.S. economy. And the Fed will be caught in a dilemma at this time. So is the Fed going to continue raising interest rates and shrinking its balance sheet to curb inflation, or does it choose to cut interest rates and quantify indefinitely to save the market at this time (but this will further increase inflation).&lt;/p&gt;\n\n&lt;p&gt;Another issue worthy of attention is that the scale of leveraged loans in the United States is large enough to trigger a global financial crisis. It&amp;#39;s bigger than all the combined high-yield (junk bonds) in the U.S. That is, how big is it? This leveraged loan may add up to more than 10% of the debt of all non-financial corporations in the United States. So what is the concept of over 10%? We can now think of the subprime mortgage crisis of 2008. That crisis was a financial crisis caused by subprime lending. If I remember correctly, the size of real estate subprime loans at that time was about 600 billion U.S. dollars. The entire U.S. real estate loan was about 9.3 trillion U.S. dollars at that time. As I recall, such a scale only accounts for about 6% of real estate loans. And this leveraged loan scale is as large as more than 10% of all corporate debt. So from this loan situation, you can see that it is worse than the subprime mortgage crisis in the United States in 2008. And the scariest thing, and what worries me the most, is that its history repeats the same behavior that triggered the subprime mortgage crisis in 2008. &lt;/p&gt;\n\n&lt;p&gt;Financial institutions package these leveraged corporate loans as an asset Securitization financial product called &amp;quot;(Collateralized Loan Obligations)&amp;quot; to be sold to investors around the world. To me, it&amp;#39;s no different from the &amp;quot;(Collateralized debt obligation&amp;quot;) that sparked the 2008 subprime mortgage crisis. One is from real estate, and the other is from companies. They all pass the risk on to the investor in the same way. Due to the Fed&amp;#39;s unlimited quantitative easing and low-interest rates in recent years, I think the scale of these leveraged loans may have exceeded 2 trillion. 50% of them are packaged and sold to investment institutions around the world, and the other 50% are packaged and sold to retail investors across the globe. The Federal Reserve has been actively raising interest rates and shrinking its balance sheet, coupled with the severe recession in the US local economy, including rising inflation and a decline in people&amp;#39;s purchasing power. This will inevitably result in many companies being unable to repay these leveraged loans. Then it will cause a butterfly effect similar to the subprime mortgage crisis in 2008; it is most likely to be the same as the CDO at that time, a more global severe crisis caused by the CLO.&lt;/p&gt;\n\n&lt;p&gt;In 2020 when Fed starts QE to save the market. I calculated and think that the Fed should begin raising interest rates and shrinking its balance sheet at the beginning of 2021. Because at that time, I felt that if the Fed did not start growing interest rates and shrinking its balance sheet, then the next year would inevitably lead to irreversible and completely out-of-control inflation so that the country would experience an economic recession. Because I understand the industrial structure of the United States very well, and I know very well that the new coronavirus, an RNA virus, mutates very fast, and it is difficult for humans to control these extremely fast mutating viruses effectively. Therefore, these viruses will affect the efficiency of industries and supply chains worldwide. Once there is a problem with the supply chain, it is difficult to solve the problem of the country&amp;#39;s employment rate. Especially for a country like the United States that relies on imports, once there is a problem with the supply chain around the world, the goods in the United States cannot keep up with the printed money, which will further cause inflation. Even if the government stops issuing relief funds, it will not solve the problem of people&amp;#39;s employment because the virus&amp;#39;s substantial spread and mutation speed has fundamentally hindered the normal development of the country&amp;#39;s supply chain and production efficiency. However, if printing money indefinitely and the supply chain cannot keep up, it will inevitably lead to unprecedented severe inflation. &lt;/p&gt;\n\n&lt;p&gt;To solve this kind of inflation, aggressive interest rate hikes and balance sheet reductions are likely to be ineffective, which will only further aggravate the country&amp;#39;s economic recession and face difficulties for a large number of companies. Now raising interest rates and shrinking the balance sheet will trigger the Great Depression; not raising interest rates and choosing quantitative easing and low-interest rates will continue to fuel inflation. If we want to solve this kind of problem, we can only have a major world war, transfer all domestic economic contradictions, and let all countries&amp;#39; wealth be redistributed to our own country. This may solve the various recessions and inflation in the United States this time. But I believe that in the atomic bomb era, I don&amp;#39;t think any country would dare to take this road. So I thought then that the Fed wasn&amp;#39;t unaware of this kind of thing and it is impossible not to consider these issues. Because I was too confident in my judgment, I also tried to start shorting the entire US stock market at the 2021 position. But it turned out that I was too naive and too overestimated the Fed&amp;#39;s decision-making and responsiveness. I didn&amp;#39;t expect that the Fed not only did not start raising interest rates and shrinking its balance sheet at that time but instead printed trillions more. This shocked me a lot and let me lose some money from shorting. But when the Fed did this, I realized that the Fed was going to ruin the country again.&lt;/p&gt;\n\n&lt;p&gt;In 2008, the Federal Reserve almost destroyed the country at that time. Because of the too-loose housing market and financial supervision, plus the Fed&amp;#39;s indecisive response to the bailout. Many Americans blamed Wall Street, believing that it was all Wall Street&amp;#39;s fault. But I think Wall Street has a lot of responsibility for this sort of thing, but the Fed and the SEC have more considerable responsibility. This time, the Fed and SEC have one thing in common that happened in 2008. That is, the Fed did not choose to rescue the market earlier at that time, and its indecision there led to the bankruptcy of Lehman, which led to a global financial crisis. This time, the Fed did not choose to do so when it was supposed to raise interest rates and shrink its balance sheet in early 2021, and it continued to increase unlimited quantitative easing. As a result, it will lead to more giant bubbles in financial markets and inflation that will spiral out of control. Once inflation is out of control, it will be accompanied by an economic recession, which will be accompanied by a decline in the consumption power of the masses and a decline in corporate earnings, even to the brink of bankruptcy. Coupled with the fact that the Federal Reserve chose to aggressively raise interest rates and shrink its balance sheet at this time, it has left companies unable to pay interest on loans and have no ability to repay their loans. Then it is very likely that the default on those leveraged loans will lead to a global financial crisis caused by the CLO. In addition, this time, the SEC did not supervise effectively where it should be, as it caused the subprime mortgage crisis, but today they do not supervise leveraged loans. So I believe that CLO will definitely cause a worldwide financial crisis due to leveraged loans. From now on, the credit risk spread of CCC-rated companies is soaring rapidly, and I believe that the interest of leveraged loans is soaring rapidly with the aggressive rate hike by the Fed rate hike.&lt;/p&gt;\n\n&lt;p&gt;As these conditions continue to get worse and worse, I estimate that the bubble will burst as soon as next year, 2023, and no more than 2024. I was hoping you could discover the investigation of leveraged loan bubbles to verify what I have written here is probably true and whether it may happen in the future. If anyone finds it possible, please go to the investment bank to short these leveraged loans to bet with the investment bank to build a similar CDS. I&amp;#39;m not a fund manager; I&amp;#39;m just a small retail trader and don&amp;#39;t have the money to make a bet with an investment bank. So, unfortunately, this idea could not be realized. But I hope the people who could read this will fulfill this opportunity.  &lt;strong&gt;All of this I write is not investment advice.&lt;/strong&gt; Maybe I&amp;#39;m overthinking what&amp;#39;s in there. But I don&amp;#39;t want to give up either possibility. I&amp;#39;m not an institutional investment manager, and I have no way of intervening through the connections and privileges of an institution to get some detailed data that I can&amp;#39;t find online. Because not all information can be found online, especially the data that financial institutions deliberately conceal. Therefore, it is necessary to conduct an on-the-spot investigation and some data that can only be obtained from this related industry to determine whether this bubble is real. I hope you can use all your contacts and abilities to investigate whether the bubbles I am talking about are possible.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": true,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "96f6c79e-b853-11e5-a4cb-0ebdf030e05d",
  "can_gild": false,
  "spoiler": true,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2th52",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#800080",
  "id": "vrp4do",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "Ok-Prompt2593",
  "discussion_type": null,
  "num_comments": 611,
  "send_replies": true,
  "whitelist_status": "promo_adult_nsfw",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/wallstreetbets/comments/vrp4do/the_financial_crisis_in_the_united_states_is/",
  "parent_whitelist_status": "some_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/wallstreetbets/comments/vrp4do/the_financial_crisis_in_the_united_states_is/",
  "subreddit_subscribers": 12301466,
  "created_utc": 1657006324,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1656993734,
  "the_new_excerpt": "Whether you agree with what I said, I hope you have the patience to read all\nthis article I wrote. I think the financial crisis in the United States may be\nsimmering and preparing to break out. Compared with inflation in the United\nStates and the Fed's shrinking balance sheet. I'm more concerned…"
}