{
  "author": "LukeMoonwalker101",
  "original_created_utc": 1651401008,
  "title": "As a man, should I be prioritizing my partner's orgasm, or just physical pleasure without orgasm necessary?",
  "created_utc": 1651431749,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I know the common answer will probably be, &amp;quot;just talk to your partner&amp;quot;. I don&amp;#39;t have one right now, but I&amp;#39;d like some input or understanding on this, since I see a lot of discrepancy regarding this.&lt;/p&gt;\n\n&lt;p&gt;I have a small penis, and suffer poor body image because of the shaming of it. The one refrain I see a lot on reddit to help men like me is:&amp;quot;Most women don&amp;#39;t orgasm from PiV anyways, regardless of size&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;But then I read on the askwomen sub that most women prefer PiV to oral or manual sex, because they get more pleasure from it. None of them mentioned wanting orgasms from PiV, just the pleasure it gives. Meaning orgasms are not the priority for them, just the pleasure from PiV&lt;/p&gt;\n\n&lt;p&gt;I know women are different, so maybe it&amp;#39;s just a case of some women want orgasms, while others don&amp;#39;t care about them. But as a man, what should my aim be? Should I prioritize giving a woman orgasms? Because a lot of the advice for men with small penises seems to be telling us to focus on giving women orgasms via oral, manual, clitoral and g-spot stimulation.&lt;/p&gt;\n\n&lt;p&gt;Is that a mistake if women don&amp;#39;t really care about getting orgasms and just want pleasurable PiV from penises that are average and above? And where does that leave men with penises below average? Is it a mistake to focus on giving a woman orgasms?&lt;/p&gt;\n\n&lt;p&gt;Please help me understand. No joke answers if that&amp;#39;s possible.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/ufx32n/as_a_man_should_i_be_prioritizing_my_partners/",
  "subreddit": "TooAfraidToAsk",
  "id": "ufx32n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "I know the common answer will probably be, \"just talk to your partner\". I don't\nhave one right now, but I'd like some input or understanding on this, since I\nsee a lot of discrepancy regarding this.\n\nI have a small penis, and suffer poor body image because of the shaming of it.\nThe one refrain I…"
}