{
  "author": "jesusvsaquaman",
  "original_created_utc": 1630534306,
  "title": "I moved to another country and taught my parents how to receive crypto from me. Now I barely pay any fees compared to bank transfers.",
  "created_utc": 1630553468,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My parents live in Lebanon and the economy there is sh*t. A mere $200 can feed a man and his family for a whole month. I started working in another country a while ago and kept sending my parents money through banks. However I quickly started to see than bank transfer fees are adding up quick. And they were NOT cheap by any means.</p>\n\n<p>I eventually got on a video call with them and patiently started teaching them how to operate a wallet. And better yet I started using a platform called e-Money to send them money. This platform charges almost zero fees so thats added benefit to my parents cause even $10 can mean a whole 2 days worth of expenses. So yeah, thanks crypto !</p>\n</div><!-- SC_ON -->",
  "score": 222,
  "permalink": "/r/CryptoCurrency/comments/pg4cfp/i_moved_to_another_country_and_taught_my_parents/",
  "subreddit": "CryptoCurrency",
  "id": "pg4cfp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My parents live in Lebanon and the economy there is sh*t. A mere $200 can feed a\nman and his family for a whole month. I started working in another country a\nwhile ago and kept sending my parents money through banks. However I quickly\nstarted to see than bank transfer fees are adding up quick. And…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の両親はレバノンに住んでいますが、そこの経済は最悪です。たった200ドルで、男性とその家族を1ヶ月間\n家族を1ヶ月間養うことができます。私が他の国で働き始めたのは\n私はしばらく前に別の国で働き始め、銀行を通して両親にお金を送り続けていました。しかし、すぐに\nしかし、銀行の送金手数料がすぐに加算されていくのを目の当たりにしました。そして...。",
      "title": "私は別の国に移り住み、両親に私から暗号を受け取る方法を教えました。今では、銀行送金に比べて手数料をほとんど払っていません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的父母住在黎巴嫩，那里的经济很糟糕。仅仅200美元就可以养活一个\n足够养活一个人和他的家人一整个月了。我不久前开始在另一个国家工作\n不久前，我开始在另一个国家工作，并不断通过银行给我父母寄钱。然而，我很快\n开始发现，银行转账费用很快就会增加。而且...",
      "title": "我搬到另一个国家，教我的父母如何从我这里接收加密货币。现在，与银行转账相比，我几乎没有支付任何费用。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的父母住在黎巴嫩，那裏的經濟很糟糕。僅僅200美元就可以養活一個\n足夠養活一個人和他的家人一整個月了。我不久前開始在另一個國家工作\n不久前，我開始在另一個國家工作，並不斷通過銀行給我父母寄錢。然而，我很快\n開始發現，銀行轉賬費用很快就會增加。而且...",
      "title": "我搬到另一個國家，教我的父母如何從我這裏接收加密貨幣。現在，與銀行轉賬相比，我幾乎沒有支付任何費用。"
    }
  ]
}