{
  "author": "-CatFunt",
  "original_created_utc": 1650222513,
  "title": "So I’ve finally taken the step to accept BTC at my business.",
  "created_utc": 1650249584,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;And no one really cares. &lt;/p&gt;\n\n&lt;p&gt;I run a motorcycle workshop dealing with usually fairly large job such as race bike conversions, crash damage etc and I recently took the jump to accepting BTC payments. &lt;/p&gt;\n\n&lt;p&gt;I launched this on my website along with the Facebook and Twitter pages. I also have added it to my invoices and even mention it as a payment mention to anyway who asks over the phone/in person. I have a 10% discount for any invoice paid in Bitcoin for the first 10 customers. &lt;/p&gt;\n\n&lt;p&gt;It’s been 6 months now and every time without fail it is “I’ll pay by card please”. Not one person has shown any interest in Bitcoin or cryptocurrency in general. &lt;/p&gt;\n\n&lt;p&gt;It’s strange because in the circles I’m in (including this sub), crypto is a part of every day life and it’s easy to think this carries over to the general public.  &lt;/p&gt;\n\n&lt;p&gt;For now at least I think we are still so far away from mainstream adoption. Especially with my usual customer stereotype - 40’s and somewhat successful. &lt;/p&gt;\n\n&lt;p&gt;I’ll keep trying and see how it goes. &lt;/p&gt;\n\n&lt;p&gt;Maybe I need to start accepting doge and get to work fixing scooters instead!&lt;/p&gt;\n\n&lt;p&gt;Edit: doge not dodge - autocorrect but it’s not far wrong.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 320,
  "permalink": "/r/CryptoCurrency/comments/u5tv72/so_ive_finally_taken_the_step_to_accept_btc_at_my/",
  "subreddit": "CryptoCurrency",
  "id": "u5tv72",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "And no one really cares.\n\nI run a motorcycle workshop dealing with usually fairly large job such as race\nbike conversions, crash damage etc and I recently took the jump to accepting BTC\npayments.\n\nI launched this on my website along with the Facebook and Twitter pages. I also\nhave added it to my…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そして、誰も本当に気にしていない。\n\n私はオートバイの整備工場を経営しており、通常はレース用車両など、かなり大きな仕事を扱っています。\nバイクの改造、クラッシュダメージなど、最近BTCを受け入れるようになりました。\nを支払います。\n\nFacebookとTwitterのページと一緒に、私のウェブサイトでもこのサービスを開始しました。また\nを追加しました。",
      "title": "そこで、ついに私のビジネスでBTCを受け入れることに踏み切りました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "而且没有人真正关心。\n\n我经营一家摩托车修理厂，通常处理相当大的工作，如赛车改装、碰撞损坏等。\n我最近开始接受BTC付款。\n支付。\n\n我在我的网站以及Facebook和Twitter页面上推出了这项服务。我还\n我还把它添加到了我的...",
      "title": "所以我终于迈出了这一步，在我的企业中接受BTC。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "而且沒有人真正關心。\n\n我經營一家摩托車修理廠，通常處理相當大的工作，如賽車改裝、碰撞損壞等。\n我最近開始接受BTC付款。\n支付。\n\n我在我的網站以及Facebook和Twitter頁面上推出了這項服務。我還\n我還把它添加到了我的...",
      "title": "所以我終於邁出了這一步，在我的企業中接受BTC。"
    }
  ]
}