{
  "author": "damence",
  "original_created_utc": 1639518781,
  "title": "PSA: Don’t take screenshots of your portfolio to show off your billions due to the price bug happening right now, you’re exposing your exact holdings online which is a terrible idea",
  "created_utc": 1639528518,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Like the title states, some of you are screenshotting and posting that you have made billions in the recent price bug on CoinMarketCap, CDC or TrustWallet, while i know it’s cool to feel like a trillionare for at least a couple of minutes, it is very unwise to share your exact holdings online, especially in reddit. The numbers are inflated, but when this gets resolved people will know exactly how much crypto you have and maybe take advantage of it. &lt;/p&gt;\n\n&lt;p&gt;My advice, have fun with this bug while it lasts, but keep it private and keep your holdings private to avoid any unwanted attention.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 208,
  "permalink": "/r/CryptoCurrency/comments/rgib64/psa_dont_take_screenshots_of_your_portfolio_to/",
  "subreddit": "CryptoCurrency",
  "id": "rgib64",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Like the title states, some of you are screenshotting and posting that you have\nmade billions in the recent price bug on CoinMarketCap, CDC or TrustWallet,\nwhile i know it’s cool to feel like a trillionare for at least a couple of\nminutes, it is very unwise to share your exact holdings online,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルにあるように、スクリーンショットを撮って、「自分はこうだ」と投稿している人がいます。\nCoinMarketCap、CDC、TrustWalletの最近の価格バグで数十億を稼いだ。\n少なくとも数分間は1兆円の金持ちになったような気分になるのはカッコいいとは思いますが\nしかし、オンラインで正確な保有量を共有することは非常に賢明ではありません...。",
      "title": "PSA：今起こっている価格のバグのためにあなたの億を誇示するためにあなたのポートフォリオのスクリーンショットを取るしないでください、あなたはひどいアイデアをオンラインで正確な保有を公開することになります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "就像标题所说的那样，你们中的一些人正在截图并发布你们已经\n在最近的CoinMarketCap、CDC或TrustWallet上的价格错误中赚取了数十亿美元。\n虽然我知道感觉自己像个万亿富翁是件很酷的事，至少有几分钟的时间。\n但在网上分享你的确切持有量是非常不明智的，...",
      "title": "PSA：由于现在发生的价格错误，不要把你的投资组合截图来炫耀你的亿万财富，你会把你的确切持有量暴露在网上，这是一个糟糕的想法。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "就像標題所說的那樣，你們中的一些人正在截圖併發布你們已經\n在最近的CoinMarketCap、CDC或TrustWallet上的價格錯誤中賺取了數十億美元。\n雖然我知道感覺自己像個萬億富翁是件很酷的事，至少有幾分鐘的時間。\n但在網上分享你的確切持有量是非常不明智的，...",
      "title": "PSA：由於現在發生的價格錯誤，不要把你的投資組合截圖來炫耀你的億萬財富，你會把你的確切持有量暴露在網上，這是一個糟糕的想法。"
    }
  ]
}