{
  "author": "GMEgotmehere",
  "the_new_excerpt": "The GameStop drama got me to Reddit. It made me rethink the investing strategies\nI had for years. I started following too many subs. Too many opinions were\ncirculating in my brain at all hours. The potential to make 20% returns tomorrow\nleft me in a manic high. FOMO was eating me alive. I eventually…",
  "original_created_utc": 1622759496,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "GameStopのドラマがきっかけでRedditに参加しました。長年続けてきた投資戦略を見直すきっかけになりました。\n何年もかけて行ってきた投資戦略を考え直しました。あまりにも多くのサブリーダーをフォローするようになりました。沢山の意見が四六時中\n頭の中を四六時中駆け巡っていました。明日にでも20％のリターンを得られる可能性がある\n狂喜乱舞していました。FOMOは私を食い物にしていました。私は結局...",
      "title": "新しい」市場は疲れる。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "GameStop的剧情让我来到Reddit。它让我重新思考多年来的投资策略\n我多年来的投资策略。我开始关注太多的子。太多的意见\n在我的大脑中不停地循环着。明天有可能获得20%的回报\n让我处于狂热的状态。FOMO正在生吞活剥我。我最终...",
      "title": "新 \"市场令人疲惫不堪。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "GameStop的劇情讓我來到Reddit。它讓我重新思考多年來的投資策略\n我多年來的投資策略。我開始關注太多的子。太多的意見\n在我的大腦中不停地循環着。明天有可能獲得20%的回報\n讓我處於狂熱的狀態。FOMO正在生吞活剝我。我最終...",
      "title": "新 \"市場令人疲憊不堪。"
    }
  ],
  "title": "The \"new\" market is exhausting.",
  "created_utc": 1622762958,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The GameStop drama got me to Reddit. It made me rethink the investing strategies I had for years. I started following too many subs. Too many opinions were circulating in my brain at all hours. The potential to make 20% returns tomorrow left me in a manic high. FOMO was eating me alive. I eventually dropped individual stocks and sat on index funds and ETFs. Shut it down for a couple of weeks. Felt freeing. Then the meme storm happened this week and all the noise in my head came back again. In summary: &quot;Everyone is making tons of money except you.&quot;</p>\n\n<p>Trying to keep up with the next &quot;Short Squeeze&quot; or the recovery flavor of the week is truly exhausting. Which again, is why I fell back to index funds. </p>\n\n<p>I never thought I&#39;d be wishing for a chance to just get a CD with 3% yield again to get through all this post covid volatility.</p>\n</div><!-- SC_ON -->",
  "score": 1449,
  "permalink": "/r/stocks/comments/nrpw0o/the_new_market_is_exhausting/",
  "subreddit": "stocks",
  "id": "nrpw0o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404886630
}