{
  "author": "bobbyo23",
  "the_new_excerpt": "I just contributed $6,000 to a new Roth IRA account with Vanguard after doing a\nlot of research. Just trying to figure out how to best allocate these funds.\n\nSome context: I’m 30 years old, I have about $27,000 in my Roth 401K, I have\nzero debt, my gross pay is $105,000, and I have about $25,000…",
  "original_created_utc": 1621836204,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "いろいろと調べた結果、Vanguard社の新しいRoth IRA口座に6,000ドルを拠出しました。\nいろいろと調べてみました。ただ、この資金をどのように配分するのがベストなのかを考えています。\n\n背景を説明します。私は30歳で、Roth 401Kには約27,000ドルあります。\n借金はゼロで、総収入は10万5000ドル、そして約2万5000ドルを持っています。",
      "title": "Vanguard社のRoth IRAに6000ドルを投入しました。次はどうする？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在做了大量的研究之后，我刚刚向Vanguard的一个新的Roth IRA账户存入了6000美元。\n大量的研究。只是想弄清楚如何最好地分配这些资金。\n\n一些背景。我今年30岁，我的罗斯401K里有大约27,000美元，我没有债务。\n零债务，我的总工资是105,000美元，我有大约25,000美元......",
      "title": "刚把6000美元存入Vanguard的Roth IRA。下一步是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在做了大量的研究之後，我剛剛向Vanguard的一個新的Roth IRA賬戶存入了6000美元。\n大量的研究。只是想弄清楚如何最好地分配這些資金。\n\n一些背景。我今年30歲，我的羅斯401K裏有大約27,000美元，我沒有債務。\n零債務，我的總工資是105,000美元，我有大約25,000美元......",
      "title": "剛把6000美元存入Vanguard的Roth IRA。下一步是什麼？"
    }
  ],
  "title": "Just put $6000 into a Roth IRA with Vanguard. What’s next?",
  "created_utc": 1621870394,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I just contributed $6,000 to a new Roth IRA account with Vanguard after doing a lot of research. Just trying to figure out how to best allocate these funds.</p>\n\n<p>Some context: I’m 30 years old, I have about $27,000 in my Roth 401K, I have zero debt, my gross pay is $105,000, and I have about $25,000 cash on hand. I own a property with my family as well. I’m engaged and getting married next year. We are planning to start trying for a child late next year. My expenses tend to be about half my paycheck so I’ve been saving about half my pay for many many months now. </p>\n\n<p>That being said, I’m trying to set myself and my future family up for success. To continue on this path I basically concluded I need to put the max contribution to a Roth IRA ASAP. After reading, I felt that Vanguard’s brokerage account made the most sense as I want to set it and forget it (unless I need to rebalance the account). I plan on contributing $6,000 every year if possible. My question is related to how to best invest. I am aware of the 3 fund portfolio, 2 fund portfolio, and other funds that combine both international and domestic stocks. Currently, I’m looking at doing 80% in VTSAX and 20% in VTIAX. From what I understand, bonds is not something I should really invest in right now due to my age and how many more years I have to retire. To decrease the volatility in domestic stocks, I thought 20% in international would be helpful. Both of these also have pretty low expense ratios and seem like a good pair for the long run.</p>\n\n<p>Any thoughts or recommendations would be appreciated. I still have time to decide as the funds are being processed with my bank and such. </p>\n\n<p>One other question I have is what would make sense to invest in a personal investment account that is taxed? Do you get taxes on unrealized gains every year even if you don’t sell your stocks? I’m trying to also have a portfolio that I could liquidate in case I needed funds, but most likely won’t have to outside my 401K and IRA. Any recommendations on particular ETFs or ways to diversify outside of my tax-benefited accounts is also appreciated. Planning to use M1 finance for my personal investment account.</p>\n\n<p>Thanks for the help and all the information this subreddit has provided!</p>\n</div><!-- SC_ON -->",
  "score": 19,
  "permalink": "/r/Bogleheads/comments/njqz8z/just_put_6000_into_a_roth_ira_with_vanguard_whats/",
  "subreddit": "Bogleheads",
  "id": "njqz8z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197388304
}