{
  "author": "SkolWolves97",
  "the_new_excerpt": "So of course we know Iceland was entirely uninhabited until the late 9th\ncentury, but after it was discovered and settled, did it have much contact with\nthe rest of Europe?\n\nAs a follow-up question, Icelanders surely knew about Greenland, so did any of\nthe rest of Europe know about it? And if so…",
  "original_created_utc": 1623959402,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アイスランドは、9世紀後半まで全くの無人島だったことはもちろん知っています。\n発見され、定住された後は、他のヨーロッパ諸国との交流はあったのでしょうか？\nヨーロッパの他の地域との交流はあったのでしょうか？\n\nまた、アイスランド人はグリーンランドのことを知っていたと思いますが、他のヨーロッパ人はグリーンランドのことを知っていたのでしょうか？\nアイスランド人はグリーンランドのことを知っていたでしょうが、他のヨーロッパ人はグリーンランドのことを知っていたのでしょうか？もしそうなら...。",
      "title": "中世のヨーロッパとアイスランドはどのくらい交流があったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，我们当然知道冰岛在9世纪末之前是完全无人居住的。\n但在它被发现和定居之后，它是否与欧洲其他地方有很多联系？\n与欧洲其他国家有多少联系？\n\n作为一个后续问题，冰岛人肯定知道格陵兰岛，那么欧洲其他地方有没有人知道呢？\n欧洲其他国家知道它吗？如果有的话...",
      "title": "中世纪的欧洲与冰岛有多少联系？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，我們當然知道冰島在9世紀末之前是完全無人居住的。\n但在它被發現和定居之後，它是否與歐洲其他地方有很多聯繫？\n與歐洲其他國家有多少聯繫？\n\n作爲一個後續問題，冰島人肯定知道格陵蘭島，那麼歐洲其他地方有沒有人知道呢？\n歐洲其他國家知道它嗎？如果有的話...",
      "title": "中世紀的歐洲與冰島有多少聯繫？"
    }
  ],
  "title": "How much contact did medieval Europe have with Iceland?",
  "created_utc": 1624005304,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So of course we know Iceland was entirely uninhabited until the late 9th century, but after it was discovered and settled, did it have much contact with the rest of Europe?</p>\n\n<p>As a follow-up question, Icelanders surely knew about Greenland, so did any of the rest of Europe know about it? And if so wouldn&#39;t they have known that, at the very least, there were some lands to the west (or, at least, the northwest) of Europe?</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/o261sa/how_much_contact_did_medieval_europe_have_with/",
  "subreddit": "AskHistorians",
  "id": "o261sa",
  "is_self": true,
  "media": null,
  "is_video": false
}