{
  "author": "Chasing4snow",
  "original_created_utc": 1635050817,
  "title": "What’s with all these “take profits” posts everywhere?",
  "created_utc": 1635071618,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Let me tell you a story. Back in 2017, i bought $10k worth of xrp when it was $0.10. Held onto it for almost a year (xrp seemed like it was the last coin to take off but it REALLY took off) and it kept going up and up. When it went up to $0.80 (8x my original investment) i said this is enough, im gonna take this profit and i pressed the sell button. Guess what… it kept going up and up. It was up EVERYTIME i pressed the refresh button for like two weeks. At the end, it went up to nearly $4.00!!!! And let me tell you, seeing something take off like that AFTER i sold was the most painful thing i have ever experienced. It was worst than losing 99% on my other shit coins during the bear market. So let it be known, seeing your holdings skyrocket after you take some profits is the most painful thing you’ll ever experience.</p>\n\n<p>Now down vote me, I don’t care.</p>\n</div><!-- SC_ON -->",
  "score": 167,
  "permalink": "/r/CryptoCurrency/comments/qel5qy/whats_with_all_these_take_profits_posts_everywhere/",
  "subreddit": "CryptoCurrency",
  "id": "qel5qy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Let me tell you a story. Back in 2017, i bought $10k worth of xrp when it was\n$0.10. Held onto it for almost a year (xrp seemed like it was the last coin to\ntake off but it REALLY took off) and it kept going up and up. When it went up to\n$0.80 (8x my original investment) i said this is enough, im…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ある話をしましょう。2017年のことですが、私は10kドル分のxrpを買ったのですが、それが\n$0.10. 約1年間持ち続け（xrpは最後に離陸するコインのように思えたが、実際に離陸した）、上昇し続けた。\nxrpは最後のコインのように思われましたが、実際に離陸しました）そして、どんどん上昇していきました。0.80ドルになったとき\n0.80ドル（当初の投資額の8倍）になったとき、私はもう十分だと思い、...",
      "title": "儲けよう」という記事があちこちにあるのはなぜ？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "让我告诉你一个故事。早在2017年，我买了价值1万美元的XRP，当时它是\n$0.10. 坚守了近一年（XRP似乎是最后一个起飞的硬币\n但它真的起飞了），它一直在上升，上升。当它涨到\n0.80美元（是我最初投资的8倍）时，我说这就够了，我...",
      "title": "这些到处都是的 \"获利 \"帖子是怎么回事？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "讓我告訴你一個故事。早在2017年，我買了價值1萬美元的XRP，當時它是\n$0.10. 堅守了近一年（XRP似乎是最後一個起飛的硬幣\n但它真的起飛了），它一直在上升，上升。當它漲到\n0.80美元（是我最初投資的8倍）時，我說這就夠了，我...",
      "title": "這些到處都是的 \"獲利 \"帖子是怎麼回事？"
    }
  ]
}