{
  "author": "Top_Replacement_562",
  "original_created_utc": 1642939236,
  "title": "Could pregnancy possibly delay menopause?",
  "created_utc": 1642969761,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I have a question that there may not even be an answer to. I doubt there would be any scientific studies on this as there would be too many variables to be able to control the study. But I am curious about what other think.&lt;/p&gt;\n\n&lt;p&gt;But let me explain a little better what I mean before answering.&lt;/p&gt;\n\n&lt;p&gt;There are a few scientific facts first:\n1. When a woman is born she already has all the eggs she will ever have. Women do not produce more so that&amp;#39;s it.\n2. When a woman is pregnant she (typically) will stop ovulating for the duration of the pregnancy, and may not start again for up to a year after giving birth.&lt;/p&gt;\n\n&lt;p&gt;So let&amp;#39;s say a woman has 10 healthy to term pregnancies. We can average that out to 18m per pregnancy where she does not ovulate. Over those 10 pregnancies that adds up to 15 years of not ovulating.&lt;/p&gt;\n\n&lt;p&gt;So theoretically could that delay her from starting menopause for up to 15 years?&lt;/p&gt;\n\n&lt;p&gt;Also please don&amp;#39;t come at me over this question. I am being genuine in my curiosity here and just wondering what others opinions might be. And by no means am I planning on having a whole heap of children to try and delay my own menopause. I have 3 children and that is enough for me. This is just a question.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/askscience/comments/sas6ch/could_pregnancy_possibly_delay_menopause/",
  "subreddit": "askscience",
  "id": "sas6ch",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So I have a question that there may not even be an answer to. I doubt there\nwould be any scientific studies on this as there would be too many variables to\nbe able to control the study. But I am curious about what other think.\n\nBut let me explain a little better what I mean before answering.\n\nThere…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そこで、答えのないような質問をしてみました。私は疑問に思っています\nこれに関する科学的な研究は、変数が多すぎて不可能でしょう。\nをコントロールすることはできません。しかし、私は他の人がどう考えているのか気になります。\n\nしかし、答える前に私が言いたいことをもう少し説明させてください。\n\nそこで...",
      "title": "妊娠すると、閉経を遅らせることができるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我有一个问题，可能根本没有答案。我怀疑是否有\n会有任何关于这个问题的科学研究，因为会有太多的变量来控制研究。\n能够控制的研究。但我很好奇其他人的想法。\n\n但在回答之前，让我更好地解释一下我的意思。\n\n那里...",
      "title": "怀孕可能推迟绝经吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我有一個問題，可能根本沒有答案。我懷疑是否有\n會有任何關於這個問題的科學研究，因爲會有太多的變量來控制研究。\n能夠控制的研究。但我很好奇其他人的想法。\n\n但在回答之前，讓我更好地解釋一下我的意思。\n\n那裏...",
      "title": "懷孕可能推遲絕經嗎？"
    }
  ]
}