{
  "author": "Top_Replacement_562",
  "original_created_utc": 1642939236,
  "title": "Could pregnancy possibly delay menopause?",
  "created_utc": 1642969761,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I have a question that there may not even be an answer to. I doubt there would be any scientific studies on this as there would be too many variables to be able to control the study. But I am curious about what other think.&lt;/p&gt;\n\n&lt;p&gt;But let me explain a little better what I mean before answering.&lt;/p&gt;\n\n&lt;p&gt;There are a few scientific facts first:\n1. When a woman is born she already has all the eggs she will ever have. Women do not produce more so that&amp;#39;s it.\n2. When a woman is pregnant she (typically) will stop ovulating for the duration of the pregnancy, and may not start again for up to a year after giving birth.&lt;/p&gt;\n\n&lt;p&gt;So let&amp;#39;s say a woman has 10 healthy to term pregnancies. We can average that out to 18m per pregnancy where she does not ovulate. Over those 10 pregnancies that adds up to 15 years of not ovulating.&lt;/p&gt;\n\n&lt;p&gt;So theoretically could that delay her from starting menopause for up to 15 years?&lt;/p&gt;\n\n&lt;p&gt;Also please don&amp;#39;t come at me over this question. I am being genuine in my curiosity here and just wondering what others opinions might be. And by no means am I planning on having a whole heap of children to try and delay my own menopause. I have 3 children and that is enough for me. This is just a question.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/askscience/comments/sas6ch/could_pregnancy_possibly_delay_menopause/",
  "subreddit": "askscience",
  "id": "sas6ch",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So I have a question that there may not even be an answer to. I doubt there\nwould be any scientific studies on this as there would be too many variables to\nbe able to control the study. But I am curious about what other think.\n\nBut let me explain a little better what I mean before answering.\n\nThere…"
}