{
  "author": "haseown",
  "original_created_utc": 1651090888,
  "title": "I have a genuine question about race.",
  "created_utc": 1651121820,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I really would like to educate myself on a term I heard today. This is not bait. I’m an older white male and had to go to the Apple store at the mall for a return of a purchase I made online. ( I HATE THE MALL ) I haven’t been in years. While I was standing outside there was this ridiculously beautiful woman and this very older white couple referred to her as mulatto. I google the term and the definition was a person of both white and black parents but then followed with “this is known as a derogatory term”. I personally felt like this word was beautiful and a nice way of saying mixed. I’ve never liked the term mixed cause to me if a human has a child with a human then they had a human child and nothing is mixed. So what is the history behind the word mulatto and why is it derogatory?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 122,
  "permalink": "/r/NoStupidQuestions/comments/udcvfe/i_have_a_genuine_question_about_race/",
  "subreddit": "NoStupidQuestions",
  "id": "udcvfe",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I really would like to educate myself on a term I heard today. This is not bait.\nI’m an older white male and had to go to the Apple store at the mall for a\nreturn of a purchase I made online. ( I HATE THE MALL ) I haven’t been in years.\nWhile I was standing outside there was this ridiculously…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日聞いた言葉について、どうしても教育しておきたい。これは餌ではありません。\n私は年配の白人男性で、ネットで購入した商品を返品するためにショッピングモールのアップルストアに行かなければなりませんでした。\nモールにあるアップルストアに行ってきました。(モールは大嫌いです）何年も行っていません。\n私が外に立っている間、このとんでもない...",
      "title": "人種について純粋な疑問があります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我真的想对我今天听到的一个术语进行教育。这不是诱饵。\n我是一个年长的白人男性，不得不去商场的苹果店买一个\n我是一个年长的白人男性，不得不去商场的苹果商店，为我在网上购买的一个产品进行退货。(我讨厌商场)我已经很多年没有去过了。\n当我站在外面时，有一个可笑的...",
      "title": "我有一个关于种族的真正问题。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我真的想對我今天聽到的一個術語進行教育。這不是誘餌。\n我是一個年長的白人男性，不得不去商場的蘋果店買一個\n我是一個年長的白人男性，不得不去商場的蘋果商店，爲我在網上購買的一個產品進行退貨。(我討厭商場)我已經很多年沒有去過了。\n當我站在外面時，有一個可笑的...",
      "title": "我有一個關於種族的真正問題。"
    }
  ]
}