{
  "author": "Traditional_Fee_8828",
  "the_new_excerpt": "A lot of you have looked at the numbers, but how many of you have actually\nlooked INTO the numbers? I'm going to break down the numbers, and tell you why\nyou're worrying your heads off over nothing. Precursor: Things haven't\nsignificantly changed, inflation is no more than it was last month.\n\n\nTHE…",
  "original_created_utc": 1620847246,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "数字を見たことがある人は多いと思いますが、実際に数字の中を見たことがある人はどれくらいいるでしょうか？\n数字の中を見たことがある人はどれくらいいるでしょうか？私は数字を分解して、なぜあなたが無意味な心配をしているのかを教えます。\n無駄な心配をしているのかをお伝えします。前兆。状況は大きく変わっていない。\nインフレ率は先月と変わらない。\n\n\nTHE...",
      "title": "最新のCPIの数字は、木材や半導体の不足で説明できる。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你们中的很多人都看了数字，但有多少人真正看过\n看过这些数字？我将对这些数字进行分解，并告诉你们为什么\n你们为什么要杞人忧天呢？前兆。事情并没有\n没有明显变化，通货膨胀率没有超过上个月。\n\n\n前兆：情况没有明显变化，通货膨胀率没有超过上个月。",
      "title": "最新的CPI数字可以用木材和半导体的短缺来解释"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你們中的很多人都看了數字，但有多少人真正看過\n看過這些數字？我將對這些數字進行分解，並告訴你們爲什麼\n你們爲什麼要杞人憂天呢？前兆。事情並沒有\n沒有明顯變化，通貨膨脹率沒有超過上個月。\n\n\n前兆：情況沒有明顯變化，通貨膨脹率沒有超過上個月。",
      "title": "最新的CPI數字可以用木材和半導體的短缺來解釋"
    }
  ],
  "title": "The Latest CPI numbers can be explained by the Lumber and Semiconductor shortage",
  "created_utc": 1620858368,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A lot of you have looked at the numbers, but how many of you have actually looked INTO the numbers? I&#39;m going to break down the numbers, and tell you why you&#39;re worrying your heads off over nothing. Precursor: Things haven&#39;t significantly changed, inflation is no more than it was last month.</p>\n\n<h1>The month on month data:</h1>\n\n<p>There&#39;s a lot of information to take in, so I&#39;ll do my best to explain it in the comments, to anyone confused by what I&#39;m saying. A lot of the explanations are very simple but here goes:</p>\n\n<ul>\n<li><p>All items less food and energy account for 79.125 weighting on the whole CPI. Digging into the data, the more heavily weighted portions is commodities less food and energy commodities (which carrys 20 weight). Furniture and bedding increased 2.1% (0.94 Weight). Living room, kitchen and dining furniture accounted for most of this (2.8% change), which can be attributed to the increasingly high lumber prices. </p></li>\n<li><p>Transport commodities less motor fuel was helped push this number up quite a bit, seeing a 4.3% change, which is a 7 weighting. These include new and used vehicles, of which used vehicles sales solely drived up, with a change of 10% which can be attributed to the semiconductor shortage.</p></li>\n<li><p>Recreation commodities were up 1.2%, with a weighting of 1.9, with video and audio products essentially carrying this number above average with the help of recreational reading material (1.5%), toys (2.7%), information technology commodities (3.6%), and miscellaneous personal goods (2.1%).</p></li>\n</ul>\n\n<p>As you can see, a lot of these either involved lumber, or semiconductors. These were all the sectors above the average, and a couple below, the rest managed to pull the full percentage of commodities less energy and food commodities down to a 2%.</p>\n\n<p>The next sector we need to look into is Services less energy services (59 weighting).</p>\n\n<ul>\n<li>No big increases here in heavily weighted areas. Notable changes were a 7.6% change in Lodging away from home (0.9 weighting), a 10.2% change in Airline fares (0.59 weighting), and a 3.4% change in admissions (0.664 weighting) </li>\n</ul>\n\n<p>As you can see, this CPI didn&#39;t give any clear indiction of inflation. Each significant rise that significantly affected the CPI could be explained by the lumber and semiconductor shortage. There is so much fearmongering going around right now, that I felt like I had to put this out there, because clearly people aren&#39;t too willing to look deep into this. </p>\n\n<h1>The Year on Year CPI data:</h1>\n\n<p>If you really think this is evidence of inflation, you&#39;re not thinking straight. You&#39;re measuring from the bottom of the market, just after the pandemic became real, to where we stand now. </p>\n\n<p>Anyways, throw any questions my way, or you can find the CPI data if you think I&#39;ve made all these numbers up. </p>\n\n<p>TLDR: No inflation (Well there is inflation, obviously, but you get what I mean), lumber and semiconductor shortage help to explain everything.</p>\n</div><!-- SC_ON -->",
  "score": 117,
  "permalink": "/r/investing/comments/nawyv7/the_latest_cpi_numbers_can_be_explained_by_the/",
  "subreddit": "investing",
  "id": "nawyv7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985994601
}