{
  "author": "skiny_boy_james",
  "original_created_utc": 1651046786,
  "title": "Why is everyone so scared or mad about sharing culture?",
  "created_utc": 1651051769,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am a Hispanic male and I’ve grown up in the Mexican culture my whole life with me I have never been offended by someone eating a taco or a tamale, a white or black person celebrating cinco de mayo or wearing a sombrero. I actually encourage it! I love to see other adopting the culture! Why don’t black people, Jewish, ect like to see others using their culture or doing the same things? This is from what I’ve seen, people get mad at a white guy for having dreads. Why can’t he have them? Can someone help me understand? I love to share my culture and I feel like it might just be me but I feel like everyone just wants their culture to themselves and there no sharing going on. I get people calling me a cultural appropriator for liking the Jewish culture I don’t want to be a Jew I’m not pretending to be one but they treat me like the devil for wanting to learn about and be more in touch with the Jewish roots of my faith.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 151,
  "permalink": "/r/TooAfraidToAsk/comments/ucygym/why_is_everyone_so_scared_or_mad_about_sharing/",
  "subreddit": "TooAfraidToAsk",
  "id": "ucygym",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I am a Hispanic male and I’ve grown up in the Mexican culture my whole life with\nme I have never been offended by someone eating a taco or a tamale, a white or\nblack person celebrating cinco de mayo or wearing a sombrero. I actually\nencourage it! I love to see other adopting the culture! Why don’t…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はヒスパニック系の男性で、メキシコの文化の中でずっと育ってきました。\nタコスやタマーレを食べる人、シンコデマヨを祝う白人や黒人、ソンブレロをかぶった\nがシンコデマヨを祝ったり、ソンブレロをかぶったりするのを不快に思ったことはありません。私は実際に\n奨励します。他の人がその文化を取り入れるのを見るのが好きなんです。なぜ...",
      "title": "なぜ、みんな文化の共有に怯えたり、怒ったりするんだろう？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一名西班牙裔男性，我一生都在墨西哥文化中成长。\n我从来没有因为有人吃玉米卷或玉米饼而被冒犯过，无论是白人还是黑人。\n我从来没有因为有人吃墨西哥卷饼或玉米饼，白人或黑人庆祝五月节或戴着墨西哥帽而感到不快。实际上，我\n鼓励它! 我喜欢看到其他人采用这种文化! 为什么不...",
      "title": "为什么每个人都对分享文化如此恐惧或疯狂？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一名西班牙裔男性，我一生都在墨西哥文化中成長。\n我從來沒有因爲有人喫玉米卷或玉米餅而被冒犯過，無論是白人還是黑人。\n我從來沒有因爲有人喫墨西哥捲餅或玉米餅，白人或黑人慶祝五月節或戴着墨西哥帽而感到不快。實際上，我\n鼓勵它! 我喜歡看到其他人採用這種文化! 爲什麼不...",
      "title": "爲什麼每個人都對分享文化如此恐懼或瘋狂？"
    }
  ]
}