{
  "author": "ttv_CitrusBros",
  "original_created_utc": 1644894695,
  "title": "Canadian Gov is the reason why you shouldn't hold your crypto in exchanges",
  "created_utc": 1644910328,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So recently the gov of Canada enforced emergency powers and is telling banks to freeze assets of people involved in the convoy. The banks of course will comply and can freeze assets without any court order. Im not sure if its the people donating as well or if its donations over a certain sum but the point stands. The gov has the power to take your money as they see fit without any warning, and it wont be just the evil Russian/China governments doing so but the friendly Canadian one as well.&lt;/p&gt;\n\n&lt;p&gt;They are also trying to prevent crypto transactions. They can tell exchanges operating in Canada to freeze peoples accounts and of course the exchanges will have to comply just like the banks.&lt;/p&gt;\n\n&lt;p&gt;This is why you never keep your money on the exchange, because tomorrow the gov could decide to freeze your money.&lt;/p&gt;\n\n&lt;p&gt;Also a good reason to buy privacy coins like monero, although its going through a hiccup right now. But thats a different topic&lt;/p&gt;\n\n&lt;p&gt;Not your keys not your coin&lt;/p&gt;\n\n&lt;p&gt;Also Im not for/against the protestors. Thats a political debate, Im pointing out the fact that the gov can just freeze peoples assets as they deem necessary. Maybe WW3 breaks out with Russia and the gov needs money to fund the military so they say 10% from everyone&amp;#39;s account will be taken or whatever. Keep your coins safe.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 365,
  "permalink": "/r/CryptoCurrency/comments/sssvpq/canadian_gov_is_the_reason_why_you_shouldnt_hold/",
  "subreddit": "CryptoCurrency",
  "id": "sssvpq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So recently the gov of Canada enforced emergency powers and is telling banks to\nfreeze assets of people involved in the convoy. The banks of course will comply\nand can freeze assets without any court order. Im not sure if its the people\ndonating as well or if its donations over a certain sum but…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、カナダ政府は緊急事態の権限を行使し、銀行に指示を出しています。\n輸送船団に関わった人たちの資産を凍結する。もちろん銀行はそれに応じるでしょう\n裁判所の命令なしに資産を凍結することができます。その人たちが\nを寄付しているのか、それとも一定額以上の寄付なのか......。",
      "title": "カナダ政府こそ、暗号を取引所で保有すべきではない理由である"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，最近加拿大政府实施了紧急权力，并告诉银行要冻结参与车队的人的资产。\n冻结参与车队的人的资产。银行当然会遵守\n并可以在没有任何法院命令的情况下冻结资产。我不确定这些人是否\n捐赠，还是超过一定数额的捐赠，但是......",
      "title": "加拿大政府是你不应该在交易所持有你的加密货币的原因"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，最近加拿大政府實施了緊急權力，並告訴銀行要凍結參與車隊的人的資產。\n凍結參與車隊的人的資產。銀行當然會遵守\n並可以在沒有任何法院命令的情況下凍結資產。我不確定這些人是否\n捐贈，還是超過一定數額的捐贈，但是......",
      "title": "加拿大政府是你不應該在交易所持有你的加密貨幣的原因"
    }
  ]
}