{
  "author": "Kuiperdolin",
  "original_created_utc": 1631454643,
  "title": "At he time of its publication (1924), was the twist in \"The Most Dangerous Game\" considered shocking/surprising?",
  "created_utc": 1631464987,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Spoilers I guess although I&#39;ll momentarily state why it does not matter.</p>\n\n<p>&quot;The Most dangerous Game&quot; is a short story by Richard Connell where a big white hunter, Sanger Rainsford, washes up on the shore of a private island after a boating accident and meets its owner, General Zaroff. The general is a shifty  but polite character who introduces himself as a fellow hunter and claims to be after the titular &quot;most dangerous game&quot;. After a lot of dialog it is finally revealed that he is actually hunting human beings, and Rainsford gets picked to be the next prey. The hunt itself takes only a few pages, during which Rainsford outsmarts his pursuers, confronts Zaroff, and kills him.</p>\n\n<p>It&#39;s a relatively famous story (especially as short stories from the 20s go) and has had  several acknowledged and unacknowledged adaptations, although many of them focus more on the hunt and less on the mystery.</p>\n\n<p>This means the modern reader probably knows what it&#39;s about before reading it, or can guess it fairly easily. This makes the bulk of the story, where Connell beats around the bush of what Zaroff is hunting, while dropping several fairly obvious hints, seem weird or even comical.</p>\n\n<p>My question is how presentist is that view? Did the readers at the time find the revelation legitimately surprising, like, say, more recent audiences were mostly blindsided by the end of &quot;The Usual Suspects&quot; or some of the events in &quot;A Song of Ice and Fire&quot; ? Or did people immediately get the human hunt angle, and enjoy seeing Rainsford bumble around as a kind of dramatic irony ?</p>\n</div><!-- SC_ON -->",
  "score": 194,
  "permalink": "/r/AskHistorians/comments/pmt11j/at_he_time_of_its_publication_1924_was_the_twist/",
  "subreddit": "AskHistorians",
  "id": "pmt11j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Spoilers I guess although I'll momentarily state why it does not matter.\n\n\"The Most dangerous Game\" is a short story by Richard Connell where a big white\nhunter, Sanger Rainsford, washes up on the shore of a private island after a\nboating accident and meets its owner, General Zaroff. The general is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ネタバレになりますが、なぜそれが問題にならないかを一瞬述べます。\n\n\"The Most dangerous Game \"は、リチャード・コーネルの短編小説で、大きな白人ハンターのサンガー・レインズフォードが、プライベートな島の海岸に流れ着く。\n猟師のサンガー・レインズフォードは、ボート事故で私有地の島に流れ着き、島の所有者ザロフ将軍と出会う。\n島の所有者であるザロフ将軍と出会う。将軍は...。",
      "title": "出版当時（1924年）、「The Most Dangerous Game」のどんでん返しは、衝撃的／意外なものだったでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想，虽然我将暂时说明为什么这并不重要，但还是要有剧透。\n\n\"最危险的游戏 \"是理查德-康奈尔的一个短篇小说。\n猎人桑格-兰斯福德在一次划船事故后被冲到了一个私人岛屿的岸边。\n在一次划船事故后，他被冲到一个私人岛屿的岸边，并见到了岛屿的主人扎罗夫将军。这位将军是...",
      "title": "在其出版时（1924年），《最危险的游戏》中的转折被认为是令人震惊/意外的吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想，雖然我將暫時說明爲什麼這並不重要，但還是要有劇透。\n\n\"最危險的遊戲 \"是理查德-康奈爾的一個短篇小說。\n獵人桑格-蘭斯福德在一次划船事故後被衝到了一個私人島嶼的岸邊。\n在一次划船事故後，他被衝到一個私人島嶼的岸邊，並見到了島嶼的主人扎羅夫將軍。這位將軍是...",
      "title": "在其出版時（1924年），《最危險的遊戲》中的轉折被認爲是令人震驚/意外的嗎？"
    }
  ]
}