{
  "author": "smallstreetgains",
  "the_new_excerpt": "1) INVESCO NASDAQ NEXT GEN 100 ETF (QQQJ)\n\nThe Invesco NASDAQ Next Gen 100 ETF (QQQJ) follows the immensely well known\nInvesco QQQ Trust (QQQ) by investing in the 101st to the 200th largest NASDAQ\nlisted companies. These companies are less mature than those in the NASDAQ 100\nbut with high growth…",
  "original_created_utc": 1610338208,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "1)景顺纳斯达克新一代100 ETF(QQQJ)\n\n景顺纳斯达克下一代100 ETF(QQQJ)遵循非常著名的\n景顺QQQ 相信(QQQ)通过投资第101至第200大纳斯达克\n上市公司。这些公司不如纳斯达克100指数成份股公司成熟。\n但随着…的高增长",
      "title": "我对2021年增长的5大选择"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "1)景順納斯達克新一代100 ETF(QQQJ)\n\n景順納斯達克下一代100 ETF(QQQJ)遵循非常著名的\n景順QQQ 相信(QQQ)通過投資第101至第200大納斯達克\n上市公司。這些公司不如納斯達克100指數成份股公司成熟。\n但隨着…的高增長",
      "title": "我對2021年增長的5大選擇"
    }
  ],
  "title": "My Top 5 Growth Picks for 2021",
  "created_utc": 1610385271,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h1>1) Invesco NASDAQ Next Gen 100 ETF (QQQJ)</h1>\n\n<p>The Invesco NASDAQ Next Gen 100 ETF (QQQJ) follows the immensely well known Invesco QQQ Trust (QQQ) by investing in the 101st to the 200th largest NASDAQ listed companies. These companies are less mature than those in the NASDAQ 100 but with high growth potential.</p>\n\n<p>The top holdings of QQQJ include Roku Inc (ROKU), Crowdstrike Holdings Inc (CRWD), The Trade Desk Inc (TTD), Zscaler Inc (ZS), Enphase Energy Inc (ENPH), AstraZeneca PLC (AZN), Take-Two Interactive Software Inc (TTWO), Old Dominion Freight Line Inc (ODFL), Fortinet Inc (FTNT), and Coupa Software Inc (COUP). Many of the most popular growth companies are included in this new ETF.</p>\n\n<h1>2) VanEck Vectors Semiconductor ETF (SMH)</h1>\n\n<p>The VanEck Vectors Semiconductor ETF tracks the semiconductor industry--one of the hottest industries of 2020. It isn’t hard to be bullish on semiconductors when they are required by virtually all companies. Electric vehicles have put the spotlight on many semiconductor companies in the race for autonomous driving.</p>\n\n<p>The VanEck Vectors Semiconductor ETF (SMH) has top holdings including: Taiwan Semiconductor Manufacturing Company (TSM), Nvidia Corp (NVDA), ASML Holding (ASML), Broadcom Inc (AVGO), Advanced Micro Devices Inc (AMD), Texas Instruments Inc (TXN), Intel Corp (INTC), Qualcomm Inc (QCOM), Micron Technology Inc (MU), and Analog Devices Inc (ADI). Semiconductors have had a killer year and the outperformance will likely continue in the future as demand for semiconductors increases.</p>\n\n<h1>3) Salesforce.com, Inc (CRM)</h1>\n\n<p>Salesforce.com, Inc (CRM) develops cloud computing solutions for customer relationship management (hence the ticker “CRM”). Salesforce recently announced it was acquiring Slack Technologies (WORK) for over $27 billion. This deal was one of the largest acquisitions announced in 2020. Salesforce has fallen almost 15% since the acquisition announcement on fears it is overpaying in the Slack acquisition.</p>\n\n<p>However, Salesforce has continued to crush earnings estimates in the last quarters of 2020 with analyst consensus that this growth can continue. Salesforce operates in a growing market and continues to be the number one choice for customer relationship management.</p>\n\n<h1>4) Array Technologies, Inc. (ARRY)</h1>\n\n<p>Array Technologies, Inc. (ARRY) is in the business of solar tracking solutions and services. The Company currently provides the DuraTrack solar tracking system and SmarTrack which is software that automatically adjusts module angles to compensate for environment changes.</p>\n\n<p>Array is quickly growing revenues with earnings and free cash flow remaining positive since 2019. The Company has stated its plans for continued growth and its willingness to make acquisitions. Array Technologies is a direct bet on the future of solar energy which will likely benefit under a democratic Whitehouse. This Company allows investors to invest in the future of solar without investing directly into solar panels.</p>\n\n<h1>5) Vertex Pharmaceuticals Incorporated (VRTX)</h1>\n\n<p>Vertex Pharmaceuticals Incorporated (VRTX) focuses on the treatment of cystic fibrosis through several drugs and has several ongoing clinical trials for the treatment of other diseases. Vertex collaborates with an impressive list of companies, including CRISPR Therapeutics (CRSP), Moderna (MRNA), and Merck &amp; Co. (MRK).</p>\n\n<p>Vertex Pharmaceuticals has proven itself to be competent in developing market-leading drugs and securing lengthy patents on its treatments. The Company will continue to dominate the cystic fibrosis space in the future due to limited competition.</p>\n\n<p><strong>Honorable mentions:</strong> CSIQ, AMZN, MSFT, PENN, ABBV, AZN, FUSE</p>\n\n<hr/>\n\n<p><strong>Note:</strong> I hold positions in all of the mentioned companies and exchange traded funds. Many of these companies are valued at high multiples due to their growth potential. This is not financial advice; invest at your own risk.</p>\n</div><!-- SC_ON -->",
  "score": 61,
  "permalink": "/r/stocks/comments/kuuvbf/my_top_5_growth_picks_for_2021/",
  "subreddit": "stocks",
  "id": "kuuvbf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706381136
}