{
  "author": "shlammyjohnson",
  "original_created_utc": 1636563792,
  "title": "$69,420 will unironically become a resistance and support line and there's nothing we can do to stop it",
  "created_utc": 1636580462,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Meme culture has proven time and time again that all you need is the power of widespread hype to push projects to ATH&#39;s and lows.</p>\n\n<p>The train has already left the station people. I for one can&#39;t wait for multiple mainstream media articles to mention bitcoin at a &quot;nice&quot; level just to throw the boomers and no-coiners for an extra loop.</p>\n\n<p>Is it healthy for the space? Probably not.</p>\n\n<p>Is it going to cause media and retail interest? You bet your sweet bell-bottoms it will.</p>\n\n<p>A couple years ago this was an impossible joke but now, on the edges of greatness here we sit at an inevitability.</p>\n\n<p>Some very intelligent people may even be able to make a couple extra bucks off knowing this level is going to cause some chaos, but I am not a smart man. I simply set my portfolio to Wumbo and watch the charts go bonkers.</p>\n\n<p>Trust me. Once we hit the level, check Google trends and I guarantee there will be a massive spike in interest.</p>\n</div><!-- SC_ON -->",
  "score": 213,
  "permalink": "/r/CryptoCurrency/comments/qqyxts/69420_will_unironically_become_a_resistance_and/",
  "subreddit": "CryptoCurrency",
  "id": "qqyxts",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Meme culture has proven time and time again that all you need is the power of\nwidespread hype to push projects to ATH's and lows.\n\nThe train has already left the station people. I for one can't wait for multiple\nmainstream media articles to mention bitcoin at a \"nice\" level just to throw the\nboomers…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ミームカルチャーは、プロジェクトをATHやLOWに押し上げるために必要なのは、広まったハイプの力であることを何度も証明してきました。\nプロジェクトをATHやLOWに押し上げるのに必要なのは、広まったハイプの力だということを、ミーム文化が何度も証明してきました。\n\nこの列車はすでに駅を出発しています。私としては、複数の主要メディアが\n団塊の世代に向けて、ビットコインの「いいね！」レベルに言及する主流メディアの記事が待ち遠しいです。\n団塊の世代に...",
      "title": "69,420ドルは皮肉にも抵抗線と支持線になり、それを止めることはできません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "记忆文化一次又一次地证明，你所需要的只是广泛炒作的力量。\n炒作的力量，将项目推到ATH和低点。\n\n火车已经离开了车站，人们。我已经迫不及待地想看到多个\n主流媒体的文章提到比特币在一个 \"不错 \"的水平上，只是为了让那些\n潮人...",
      "title": "69,420美元将不折不扣地成为阻力和支撑线，我们无法阻止它的发生"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "記憶文化一次又一次地證明，你所需要的只是廣泛炒作的力量。\n炒作的力量，將項目推到ATH和低點。\n\n火車已經離開了車站，人們。我已經迫不及待地想看到多個\n主流媒體的文章提到比特幣在一個 \"不錯 \"的水平上，只是爲了讓那些\n潮人...",
      "title": "69,420美元將不折不扣地成爲阻力和支撐線，我們無法阻止它的發生"
    }
  ]
}