{
  "author": "Twilight_Aristocrat",
  "original_created_utc": 1638038056,
  "title": "To what extent was FDR supportive of Eleanor's love of lesbian women?",
  "created_utc": 1638055954,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was surprised when I learned Eleanor had at least one long term sexual relationship with another woman, Lorena Hickok, during her open marriage to FDR. </p>\n\n<p>She also had a number of intense friendships (at least) with lesbian couples, including two she lived with at Val Kill, an estate FDR built so the three could live together.</p>\n\n<p>To what extent was FDR aware of her relationship with lesbians and to what extent was he supportive of them?</p>\n</div><!-- SC_ON -->",
  "score": 757,
  "permalink": "/r/AskHistorians/comments/r3jpwt/to_what_extent_was_fdr_supportive_of_eleanors/",
  "subreddit": "AskHistorians",
  "id": "r3jpwt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was surprised when I learned Eleanor had at least one long term sexual\nrelationship with another woman, Lorena Hickok, during her open marriage to FDR.\n\nShe also had a number of intense friendships (at least) with lesbian couples,\nincluding two she lived with at Val Kill, an estate FDR built so…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "エレノアがFDRとの公開結婚中に、少なくとも一人の女性（ロレーナ・ヒコック）と長期にわたる性的関係を持っていたことを知ったときは驚きました。\nFDRとの公開結婚中に、ロレーナ・ヒコックという別の女性と少なくとも一度は長期にわたる性的関係を持っていたことを知って驚きました。\n\n彼女はまた、レズビアンのカップルと（少なくとも）多くの親密な友人関係を築いていました。\nその中には、FDRが建設した邸宅「ヴァルキル」で一緒に暮らしていた2人も含まれています。",
      "title": "FDRは、エレノアがレズビアンの女性を愛していることをどの程度支持していたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当我得知埃莉诺至少有一次长期的性关系时，我感到很惊讶。\n在她与FDR的公开婚姻期间，与另一个女人Lorena Hickok发生了关系。\n\n她还与女同性恋夫妇有许多密切的友谊（至少是）。\n包括与她一起住在瓦尔克尔（Val Kill）的两位女同性恋者，这是FDR建造的一个庄园，所以......",
      "title": "FDR在多大程度上支持埃莉诺对女同性恋者的爱？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當我得知埃莉諾至少有一次長期的性關係時，我感到很驚訝。\n在她與FDR的公開婚姻期間，與另一個女人Lorena Hickok發生了關係。\n\n她還與女同性戀夫婦有許多密切的友誼（至少是）。\n包括與她一起住在瓦爾克爾（Val Kill）的兩位女同性戀者，這是FDR建造的一個莊園，所以......",
      "title": "FDR在多大程度上支持埃莉諾對女同性戀者的愛？"
    }
  ]
}