{
  "author": "perry470",
  "the_new_excerpt": "I used Fintel to gauge the short interest of any given stock because I thought\nthey were reliable. However, with the latest round of orchestrated \"flash\ncrashes\" being done on meme stocks, and Fintel actually reporting lower \"Short\nVolume Ratio\" afterwards, I set out to find out just what the hell…",
  "original_created_utc": 1616475590,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我用Fintel来衡量任何一只股票的空头兴趣，因为我认为。\n它们是可靠的。然而，随着最新一轮精心策划的 \"闪电 \"事件的发生。\n崩溃 \"正在做的备忘录股票，和Fintel实际上报告较低的 \"短\"。\n容积率 \"之后，我开始寻找到底是什么... ...",
      "title": "美国金融业监管局报告不准确的总交易量"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我用Fintel來衡量任何一隻股票的空頭興趣，因爲我認爲。\n它們是可靠的。然而，隨着最新一輪精心策劃的 \"閃電 \"事件的發生。\n崩潰 \"正在做的備忘錄股票，和Fintel實際上報告較低的 \"短\"。\n容積率 \"之後，我開始尋找到底是什麼... ...",
      "title": "美國金融業監管局報告不準確的總交易量"
    }
  ],
  "title": "FINRA Reporting Inaccurate Total Trade Volume",
  "created_utc": 1616497065,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I used Fintel to gauge the short interest of any given stock because I thought they were reliable. However, with the latest round of orchestrated &quot;flash crashes&quot; being done on meme stocks, and Fintel actually reporting lower &quot;Short Volume Ratio&quot; afterwards, I set out to find out just what the hell is going on.</p>\n\n<p>Turns out, Fintel gets their Short Volume figure from FINRA&#39;s <a href=\"http://regsho.finra.org/regsho-Index.html\">Daily Short Sale Volume Files</a>. Through that webpage, you can find short volume data for any stock for any given day. For example, today 2021-03-22, FINRA maintains that GME had a <strong>short volume of 2,358,752</strong> with a <strong>total volume of 3,843,634</strong>. And according to FINRA, Total Volume is defined as &quot;<strong>share volume of all executed trades during regular trading hours</strong>.&quot;</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/l45d11be6po61.png?width=774&amp;format=png&amp;auto=webp&amp;s=2a4298fe454531bedf29690f7db0bb901785a0c3\">FINRA Daily Short Sale Volume File Format Legend</a></p>\n\n<p>Alright, that&#39;s cool and all but what is wrong? Well, the problem is the Total Volume figure reported by FINRA is completely off and the fact that services like Fintel uses FINRA&#39;s short volume data to calculate short volume ratio presents inaccurate data to the public.</p>\n\n<p>For example, Fintel is currently reporting a <strong>23%</strong> Short Volume Ratio for GME as of 2021-03-22. The way they calculate Short Volume Ratio is simply take the Short Volume figure from FINRA (<strong>2,358,752</strong>) divided by the Total Volume. Whao, but Fintel is showing <strong>10,054,700</strong> as the Total Volume for GME, what?</p>\n\n<p><a href=\"https://preview.redd.it/5g4lhepc7po61.png?width=821&amp;format=png&amp;auto=webp&amp;s=8f5c94c82d5a01181d73667ebeeb7feed416e25e\">Fintel uses the Short Volume figure from FINRA. Example: 2021-03-22, Short Volume for GME: 2,358,752. However, Fintel disagrees with FINRA in that Fintel uses 10,054,700 as the total volume whereas FINRA maintains GME only had 3,843,634 total volume.</a></p>\n\n<p>Okay, let see then..</p>\n\n<p><a href=\"https://preview.redd.it/m3483d888po61.png?width=514&amp;format=png&amp;auto=webp&amp;s=401ab28bc0b80a29c43d0ec4d358566bb035dae3\"> Yahoo Finance shows GME had a volume of 9,573,686 on 2021-03-22.</a></p>\n\n<p><a href=\"https://preview.redd.it/8v5abi8g8po61.png?width=980&amp;format=png&amp;auto=webp&amp;s=8f2cab05661faa8c6c1d132baa7eae18f7ebf79b\"> WeBull shows GME had a volume of 10,060,000 on 2021-03-22.</a></p>\n\n<p><a href=\"https://preview.redd.it/fp0t9tkn8po61.png?width=796&amp;format=png&amp;auto=webp&amp;s=3c3eacd125e70226892e147187be9189558a4084\"> Robinhood shows GME had a volume of 10,060,000 on 2021-03-22.</a></p>\n\n<p><a href=\"https://preview.redd.it/nrkys7cv8po61.png?width=1012&amp;format=png&amp;auto=webp&amp;s=aee32b3251553ab514d1835f9fa0b540e5d9bb27\"> Fidelity shows GME had a volume of 10,061,505 on 2021-03-22.</a></p>\n\n<p>You get the picture. Four sources confirmed that GME had a total volume of ~10M on 2021-03-22. Why the hell is FINRA reporting only 3.8M as the total volume? YES, I am aware that FINRA breaks down their report by markets. I specifically did the analysis based on their &quot;consolidated&quot; data across markets B <em>(NASDAQ TRF Chicago)</em>, Q <em>(NASDAQ TRF Carteret)</em> and N <em>(NYSE TRF)</em> So, what the hell?</p>\n\n<p>Once I start questioning that, I had to check FINRA&#39;s short volume report for a longer time span for GME. Turns out, FINRA has been under-reporting total volume for all tickers since.. ever. Here I compare what FINRA is reporting vs what Yahoo and Fidelity are reporting. (Blue: FINRA, Red: Yahoo and Yellow: Fidelity)</p>\n\n<p><a href=\"https://preview.redd.it/wj18e4vpcpo61.png?width=1554&amp;format=png&amp;auto=webp&amp;s=ecf1121443100b84f7e78e92b7c9c9ceafe96f44\"> GME Total Trading Volume as reported by FINRA, Yahoo &amp; Fidelity (2021-01-01 to 2021-03-22) [Check sources below raw data]</a></p>\n\n<p>As you can see, Yahoo and Fidelity pretty much align 100% on what the total volume is, but FINRA <strong><em>_never_</em></strong> reported even remotely close to what others are reporting. Again, keep in mind the FINRA data I used in this analysis is consolidated across markets.</p>\n\n<p>The ramification of using FINRA&#39;s short volume and the total volume of what everyone else is reporting is underestimating the short volume ratio. If we go by the total volume reported by FINRA, we actually get 2358752 / 3843634= <strong>61.4%</strong> Short Volume Ratio. However, sites like Fintel uses that 2358752 short volume figure and the total volume ~10M figure, that gives a low <strong>23%</strong> Short Volume Ratio. The difference is dramatic.</p>\n\n<p><strong>The questions that need to be answered are: what is FINRA reporting? Why do the total volume they report so different than everybody else&#39;s? How confident and reliable are their Short Volume data then? If their consolidated data turns out to be not consolidated, are they deceiving the public in that services like Fintel report a fraction of the real Short Volume Ratio as a result?</strong></p>\n\n<p>For the record, I did check other stocks <em>(blue chips, meme stocks, EV.. etc.)</em> FINRA <strong><em>_always_</em></strong> under-report the total volume.</p>\n\n<p>&#x200B;</p>\n\n<p>TL;DR: FINRA allegedly report inaccurate total volume in their Short Sale Volume daily report and services like Fintel uses them and as a result gives inaccurate short volume ratio.</p>\n\n<p>Special thanks to amcstock Discord for helping the research.</p>\n\n<p>&#x200B;</p>\n\n<p>Sources:</p>\n\n<ul>\n<li>(added) <a href=\"https://drive.google.com/file/d/13mRd23Z7V5yeprNr8qPgi16QPLGygwHe/view?usp=sharing\">GME Volume FINRA vs Yahoo vs Fidelity (Google Drive)</a></li>\n<li><a href=\"https://fintel.io/ss/us/gme\">Fintel - GME Short Interest - GameStop Corp.</a></li>\n<li><a href=\"http://regsho.finra.org/DailyShortSaleVolumeFileLayout.pdf\">Regulation SHO Daily Short Sale Volume File Layout</a></li>\n<li><a href=\"http://regsho.finra.org/regsho-Index.html\">March 2021 Daily Short Sale Volume Files</a></li>\n<li><a href=\"http://regsho.finra.org/CNMSshvol20210319.txt\">FINRA Consolidated NMS Friday 19th March 2021 (TXT file 317 KB)</a></li>\n<li><a href=\"https://www.finra.org/finra-data/short-sale-volume-daily\">Short Sale Volume Daily | FINRA.org</a></li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 3666,
  "permalink": "/r/wallstreetbets/comments/mb72z0/finra_reporting_inaccurate_total_trade_volume/",
  "subreddit": "wallstreetbets",
  "id": "mb72z0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752832228
}