{
  "author": "sgtslaughterTV",
  "the_new_excerpt": "More facts: if you were to divide the total number of bitcoin that will ever\nexist (21 million) and divide it by 7 billion (the number of people on earth),\nthen you would get 0.003 BTC, or roughly 300,000 satoshis per person.\n\nIn reality we know that anywhere from 2 million to 6 million are lost…",
  "original_created_utc": 1618557797,
  "localize": [
    {
      "locale": "ja",
      "title": "ここには約18,000人の新規ユーザーがいますが、そのうちの90％はこのことを知らないと思います。0.28BTCを所有すれば、ビットコイン保有者の上位1％に入ることができます。",
      "the_new_excerpt": "ビットコインの総数で割ると、1,000万枚を超えます。\n2100万人を70億人で割ったものです。\nとすると、0.003BTC、つまり一人当たり約30万サトシになります。\n\n実際には、200万から600万が失われていることが分かっています...。"
    },
    {
      "locale": "zh",
      "title": "我们这里大约有18000名新用户，我很确定他们中90%的人不知道这个。你不需要买一整个比特币, 拥有0. 28 BTC就能让你成为比特币持有者中的前1%...",
      "the_new_excerpt": "更多的事实是：如果你把永远存在的比特币总数（2100万）除以70亿（数字）。\n2100万）除以70亿（地球上的人口数量）。\n那么你会得到0.003个BTC，或者大约每人300,000个沙特币。\n\n在现实中，我们知道有200万到600万的损失..."
    },
    {
      "locale": "zh-Hant",
      "title": "我們這裏大約有18000名新用戶，我很確定他們中90%的人不知道這個。你不需要買一整個比特幣, 擁有0. 28 BTC就能讓你成爲比特幣持有者中的前1%...",
      "the_new_excerpt": "更多的事實是：如果你把永遠存在的比特幣總數（2100萬）除以70億（數字）。\n2100萬）除以70億（地球上的人口數量）。\n那麼你會得到0.003個BTC，或者大約每人300,000個沙特幣。\n\n在現實中，我們知道有200萬到600萬的損失..."
    }
  ],
  "title": "We have approximately 18,000 new users here and I'm pretty sure 90% of them don't know this: You don't *HAVE TO* buy a whole bitcoin, and owning 0.28 BTC puts you in the top 1% of bitcoin holders...",
  "created_utc": 1618605900,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>More facts: if you were to divide the total number of bitcoin that will ever exist (21 million) and divide it by 7 billion (the number of people on earth), then you would get 0.003 BTC, or roughly 300,000 satoshis per person.</p>\n\n<p>In reality we know that anywhere from 2 million to 6 million are lost forever and that scarcity should go even higher.</p>\n\n<p>And the best part? Holding any amount of bitcoin for several years is likely to multiply the amount of money you put in to it because it becomes more scarce over time.</p>\n</div><!-- SC_ON -->",
  "score": 178,
  "permalink": "/r/CryptoCurrency/comments/mry2yj/we_have_approximately_18000_new_users_here_and_im/",
  "subreddit": "CryptoCurrency",
  "id": "mry2yj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171517801
}