{
  "author": "WaitForItTheMongols",
  "original_created_utc": 1658972244,
  "title": "A commonly reposted internet claim is that during Prohibition, dissolvable bricks of grape juice came with a warning \"Do not store in darkness for 20 days, because then it would turn into wine\". Is this accurate? I can't find a simple photo of one.",
  "created_utc": 1658982746,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;There are many web pages I can find (random example here: &lt;a href=\"https://grapecollective.com/articles/prohibitions-grape-bricks-how-to-not-make-wine\"&gt;https://grapecollective.com/articles/prohibitions-grape-bricks-how-to-not-make-wine&lt;/a&gt;) which post images of these bricks, indicating that the bricks existed, but not the specifics that there were direct prohibition-dodging instructions attached. It says you can add &amp;quot;Benzoate of soda&amp;quot; (Today we would call it sodium benzoate) to prevent fermentation, but it doesn&amp;#39;t give the instructions which are obviously meant to encourage fermentation.&lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t find a single photo of one of these bricks with the claimed phrase.&lt;/p&gt;\n\n&lt;p&gt;There are of course images people have put together, like this one: &lt;a href=\"https://pics.me.me/source-is-mentioned-in-our-blog-www-unbelievablefactsblog-com-during-prohibition-grape-4225356.png\"&gt;https://pics.me.me/source-is-mentioned-in-our-blog-www-unbelievablefactsblog-com-during-prohibition-grape-4225356.png&lt;/a&gt; but obviously anyone can put that together in 5 minutes.&lt;/p&gt;\n\n&lt;p&gt;Was the specific disclaimer about not leaving the grape juice to ferment a real thing? I don&amp;#39;t see why they would have both this disclaimer, AND the &amp;quot;add sodium benzoate&amp;quot; disclaimer to both avoid fermentation. Is it possible to debunk this? The ideal resolution to this would, of course, be to have a picture of the packaging of one of these bricks proving that it was real, but failing that, it would be nice if the origin of this myth could be identified.&lt;/p&gt;\n\n&lt;p&gt;Thank you!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 195,
  "permalink": "/r/AskHistorians/comments/w9wd59/a_commonly_reposted_internet_claim_is_that_during/",
  "subreddit": "AskHistorians",
  "id": "w9wd59",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "There are many web pages I can find (random example here:\nhttps://grapecollective.com/articles/prohibitions-grape-bricks-how-to-not-make-wine)\nwhich post images of these bricks, indicating that the bricks existed, but not\nthe specifics that there were direct prohibition-dodging instructions…"
}