{
  "author": "IlliterateGF",
  "original_created_utc": 1655490891,
  "title": "Is it possible that my adult girlfriend doesn’t know how to read?",
  "created_utc": 1655498868,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m 21/M, she’s 19/F.&lt;/p&gt;\n\n&lt;p&gt;I feel like I’m going crazy, but I’m pretty sure that my girlfriend has been hiding the fact that she’s illiterate. We’ve been dating for about six months, and here are the things I’ve noticed in that time:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;She never texts me, she only ever wants to talk on the phone. Any time I’ve ever texted her, she’s either called me in response or else just doesn’t respond to it at all. She claims that this is because she just hates texting.&lt;/li&gt;\n&lt;li&gt;She works as a barista; she told me a story about how they changed the Point of Sale system they use and she was screwing up orders for a week because she used to just “have it memorized where everything was in the system”.&lt;/li&gt;\n&lt;li&gt;Whenever we go to a restaurant, she always says she’s not sure what she wants and asks me what I think she should try. 90% of the time she also asks me to order for her. I’m not sure if she actually really looks at the menu.&lt;/li&gt;\n&lt;li&gt;She rarely captions photos on her IG, usually just emojis. Also this is the only social media that she has.&lt;/li&gt;\n&lt;li&gt;She was in the foster care system and moved around a lot as a child, which could explain disrupted schooling.&lt;/li&gt;\n&lt;li&gt;She isn’t in college and has no interest in going, she said because she always struggled in school and sees no reason to subject herself to it as an adult.&lt;/li&gt;\n&lt;li&gt;I’ve never seen her read a book or even a magazine, and when I see her on her phone she’s usually on IG or playing Match 3 games but never reading an article that I can remember.&lt;/li&gt;\n&lt;li&gt;I once let her borrow my copy of the book that her favorite movie is based on, because she mentioned that she’d never read it. She gave it back to me a few weeks later claiming that she never found time to read it and felt bad that she was holding it hostage.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Am I crazy, or does it sound like I’m onto something here? And should I ask her about it? I can’t imagine anything more insulting than asking someone if they’re illiterate, especially because I sometimes get the feeling that she feels like I’m “smarter than her” because I’m in college and she isn’t. (I don’t think I’ve done anything to make her feel that way, but she’s mentioned it in passing.)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 158,
  "permalink": "/r/NoStupidQuestions/comments/vemu2i/is_it_possible_that_my_adult_girlfriend_doesnt/",
  "subreddit": "NoStupidQuestions",
  "id": "vemu2i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m 21/M, she’s 19/F.\n\nI feel like I’m going crazy, but I’m pretty sure that my girlfriend has been\nhiding the fact that she’s illiterate. We’ve been dating for about six months,\nand here are the things I’ve noticed in that time:\n\n * She never texts me, she only ever wants to talk on the phone. Any…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は21/Mで、彼女は19/Fです。\n\n自分でもおかしいと思うのですが、私の彼女がイラついていることを隠しているのは間違いないようです。\n文盲であることを隠している。付き合って半年くらいです。\n以下はその間に気づいたことです。\n\n * 彼女は決して私にメールを送らない、彼女は今まで電話で話をしたいと思います。どんな...",
      "title": "大人の彼女が字を読めないなんてありえるの？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是21岁/M，她是19岁/F。\n\n我觉得我快疯了，但我很确定我的女朋友一直在隐瞒她是文盲的事实。\n隐瞒了她是文盲的事实。我们已经约会了大约6个月。\n以下是我在这段时间里注意到的事情。\n\n * 她从不给我发短信，她只想在电话里说话。任何...",
      "title": "我的成年女友有可能不知道如何阅读吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是21歲/M，她是19歲/F。\n\n我覺得我快瘋了，但我很確定我的女朋友一直在隱瞞她是文盲的事實。\n隱瞞了她是文盲的事實。我們已經約會了大約6個月。\n以下是我在這段時間裏注意到的事情。\n\n * 她從不給我發短信，她只想在電話裏說話。任何...",
      "title": "我的成年女友有可能不知道如何閱讀嗎？"
    }
  ]
}