{
  "author": "altranger9000",
  "original_created_utc": 1652641215,
  "title": "Is crypto actually useful?",
  "created_utc": 1652657491,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll try to keep it simple : try to think about crypto from the perspective of a no-coiner, you know, an everyday average Joe.&lt;/p&gt;\n\n&lt;p&gt;Apple makes phones, Spotify gives you music streaming, Chase keeps your money safe, KFC serves you chicken wings, Zoom helps employees communicate, but what the fuck does Solana do for you? Currently valued at 18 billion, but why?&lt;/p&gt;\n\n&lt;p&gt;How can my mom benefit from Solana for example? How can a company benefit from Solana? And how is it different from Avalance, Aave, Matic &amp;amp; the hundreds of other projects?&lt;/p&gt;\n\n&lt;p&gt;Remember, try to reply to me as if you were talking to a no-coiner, use real world example preferably.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Edit :&lt;/strong&gt; I&amp;#39;m aware of the very obvious money transfer aspect, which is actually great yes, but there are thousands of cryptos offering exactly that.&lt;/p&gt;\n\n&lt;p&gt;I know there are many phone, banks and clothing companies too, but designer clothing doesn&amp;#39;t serve the same consumers as kids clothing, just like with premium phones/cheap android phones or islamic banks/off-shore banks. Variety is necessary, but when it comes to money transfer, you just want it done as cheap and fast as possible.&lt;/p&gt;\n\n&lt;p&gt;So what does justify the existence of thousands of projects serving the same purpose (p2p transfers) more than 10 years after the invention of Bitcoin, some with billions in market cap?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 327,
  "permalink": "/r/CryptoCurrency/comments/uqcwaf/is_crypto_actually_useful/",
  "subreddit": "CryptoCurrency",
  "id": "uqcwaf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'll try to keep it simple : try to think about crypto from the perspective of a\nno-coiner, you know, an everyday average Joe.\n\nApple makes phones, Spotify gives you music streaming, Chase keeps your money\nsafe, KFC serves you chicken wings, Zoom helps employees communicate, but what\nthe fuck does…"
}