{
  "author": "Supercharmeleon",
  "original_created_utc": 1639418331,
  "title": "It's funny how the mood kind of deflates when we're a couple weeks into the red.",
  "created_utc": 1639434961,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;But not funny in a bad way I guess. We&amp;#39;re all here super pumped and writing a million essays about the trajectory of the bull run and how exactly it&amp;#39;ll go and how we&amp;#39;re all geniuses for investing into LRC and stuff, and then we get a couple days of red and everything muffles a little bit.&lt;/p&gt;\n\n&lt;p&gt;But it&amp;#39;s just a few weeks, thankfully. Now we just gotta wait for the next bounce and we&amp;#39;ll all be genuises again! It&amp;#39;s a pretty good deal. Most people aren&amp;#39;t genuises ever in their whole life, so it&amp;#39;s not that bad all things considered.&lt;/p&gt;\n\n&lt;p&gt;And besides, it&amp;#39;s good to take a breather from all that excitement and shitcoin shilling. &lt;/p&gt;\n\n&lt;p&gt;Good luck in these red days and hope we&amp;#39;ll see plenty of green soon!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 177,
  "permalink": "/r/CryptoCurrency/comments/rflqtv/its_funny_how_the_mood_kind_of_deflates_when_were/",
  "subreddit": "CryptoCurrency",
  "id": "rflqtv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "But not funny in a bad way I guess. We're all here super pumped and writing a\nmillion essays about the trajectory of the bull run and how exactly it'll go and\nhow we're all geniuses for investing into LRC and stuff, and then we get a\ncouple days of red and everything muffles a little bit.\n\nBut it's…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "でも、悪い意味で面白くはない......と思う。私たちは皆、ここで超気持ちよく、そして\n強気な展開の軌跡と、それがどのように進むかについて、100万ものエッセイを書き\nLRCに投資した私たちは天才だ、とか。\n数日赤が続くと、すべてが少し消えます。\n\nでも、それは...",
      "title": "赤字になってから2週間も経つと、なんだか気分が萎えてくるのが不思議です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "但我想这并不是不好笑的方式。我们都在这里超级兴奋，写了一百万篇关于牛市轨迹的文章。\n写了无数篇关于牛市运行轨迹的文章，以及它到底会如何发展，以及我们都是投资LRC的天才之类的。\n我们都是投资于LRC的天才，然后我们得到一个\n然后我们得到了几天的红色，一切都变得有点闷。\n\n但这是...",
      "title": "有趣的是，当我们进入红色的几个星期时，心情有点放空了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "但我想這並不是不好笑的方式。我們都在這裏超級興奮，寫了一百萬篇關於牛市軌跡的文章。\n寫了無數篇關於牛市運行軌跡的文章，以及它到底會如何發展，以及我們都是投資LRC的天才之類的。\n我們都是投資於LRC的天才，然後我們得到一個\n然後我們得到了幾天的紅色，一切都變得有點悶。\n\n但這是...",
      "title": "有趣的是，當我們進入紅色的幾個星期時，心情有點放空了。"
    }
  ]
}