{
  "author": "ailbhe-caterina",
  "original_created_utc": 1642547121,
  "title": "How do I cope with seeing my therapist on nights out and finding out that we have mutual friends?",
  "created_utc": 1642579648,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I feel very awkward and I’m overthinking everything I have ever told my therapist. My therapist (been working with her for two years now and she is the only one that is working well for me) she is the same age as me. At first that worried me as it made me feel self conscious but soon I forgot about it as we worked well together. However,  a few weeks ago I started seeing her on nights out and actually hanging with people i used to be friends with. This is all making me very uncomfortable and self conscious because she knows ALL of my personal deepest and darkest things along with all my struggles. I am worried she will tell some people and we live in a very small town so word gets around fast. I don’t know if I should find another therapist or not because it’s too late she knows everything about me already and maybe she would tell people if she wasn’t my therapist anymore and stuff would get out then. I have tried numerous therapists over the years but she is the only one I have found to work well with me. What should I do?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/NoStupidQuestions/comments/s7ao16/how_do_i_cope_with_seeing_my_therapist_on_nights/",
  "subreddit": "NoStupidQuestions",
  "id": "s7ao16",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I feel very awkward and I’m overthinking everything I have ever told my\ntherapist. My therapist (been working with her for two years now and she is the\nonly one that is working well for me) she is the same age as me. At first that\nworried me as it made me feel self conscious but soon I forgot about…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "とても気まずく、今まで話したことをすべて考えすぎてしまいます。\nセラピスト 私のセラピスト（2年前からお世話になっています。\n唯一、私に合っているのは）彼女は私と同い年です。最初はそのことが\nでも、すぐに忘れました。",
      "title": "夜、セラピストに会って、共通の友人がいることを知ったとき、どう対処すればいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我感到非常尴尬，我在反复思考我曾经告诉我的所有事情\n治疗师。我的治疗师（已经和她一起工作了两年，她是唯一一个对我有帮助的治疗师），她和我同龄。\n她是唯一对我有帮助的人），她和我同龄。起初，这\n我很担心，因为这让我感到很自觉，但很快我就忘记了。",
      "title": "我如何应对在晚上看到我的治疗师，发现我们有共同的朋友？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我感到非常尷尬，我在反覆思考我曾經告訴我的所有事情\n治療師。我的治療師（已經和她一起工作了兩年，她是唯一一個對我有幫助的治療師），她和我同齡。\n她是唯一對我有幫助的人），她和我同齡。起初，這\n我很擔心，因爲這讓我感到很自覺，但很快我就忘記了。",
      "title": "我如何應對在晚上看到我的治療師，發現我們有共同的朋友？"
    }
  ]
}