{
  "author": "nick83487",
  "original_created_utc": 1640574365,
  "title": "How do you stay on top of all relevant crypto news without it consuming your life?",
  "created_utc": 1640608959,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I go through phases where I hardly think about my crypto, generally because life gets super busy but I also go through phases where I&amp;#39;m very involved in managing my crypto and staying on top of news. &lt;/p&gt;\n\n&lt;p&gt;What I&amp;#39;m trying to do is find a healthy balance between the two in which I&amp;#39;m able to stay on top of all relevant news to the space as a whole as well as news specific to my investments without it taking excessive amounts of time and consuming my life. &lt;/p&gt;\n\n&lt;p&gt;I like reading through this sub and watching news videos on youtube but when I do this, I find myself getting sucked into the crypto-rabbit-hole and spending more time than I wanted to on it. &lt;/p&gt;\n\n&lt;p&gt;If anyone has any ideas or methods I would love to hear them.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 383,
  "permalink": "/r/CryptoCurrency/comments/rpd2tp/how_do_you_stay_on_top_of_all_relevant_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "rpd2tp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I go through phases where I hardly think about my crypto, generally because life\ngets super busy but I also go through phases where I'm very involved in managing\nmy crypto and staying on top of news.\n\nWhat I'm trying to do is find a healthy balance between the two in which I'm\nable to stay on top…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、暗号のことをほとんど考えない時期があります。\nをする時期もありますが、その一方で、管理業務に没頭する時期もあります。\n私の暗号は、常に最新のニュースをキャッチしています。\n\n私が心がけているのは、この2つの間で健康的なバランスを保つことです。\nトップでいられるように...。",
      "title": "暗号に関するあらゆるニュースを、生活に支障をきたすことなく把握するにはどうすればよいのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我经历过几乎不考虑我的加密货币的阶段，通常是因为生活变得超级繁忙。\n但我也会经历一些阶段，在这些阶段，我非常投入地管理我的加密货币，并保持对新闻的关注。\n我的加密货币，并保持对新闻的关注。\n\n我想做的是在这两者之间找到一个健康的平衡，使我能够\n能够保持在最高水平...",
      "title": "你如何掌握所有相关的加密货币新闻，而不被它消耗掉你的生活？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我經歷過幾乎不考慮我的加密貨幣的階段，通常是因爲生活變得超級繁忙。\n但我也會經歷一些階段，在這些階段，我非常投入地管理我的加密貨幣，並保持對新聞的關注。\n我的加密貨幣，並保持對新聞的關注。\n\n我想做的是在這兩者之間找到一個健康的平衡，使我能夠\n能夠保持在最高水平...",
      "title": "你如何掌握所有相關的加密貨幣新聞，而不被它消耗掉你的生活？"
    }
  ]
}