{
  "author": "GodlordHerus",
  "original_created_utc": 1637084265,
  "title": "Advice to Bears in 48hrs your going to regret your life choices",
  "created_utc": 1637114014,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As a person who sometimes plays the bear game. This is a trap </p>\n\n<p>I know it looks tempting BTC at a major support; 50 daily MA. With previous support the 21 Daily EMA now as possible resistance. But don&#39;t! </p>\n\n<p>This is the exact same setup we had in July. The Daily RSI going below 50 and the 50 looking like it will break. A classic 50/50 sell signal with a proof down to the Weekly 20 MA at $52,000.00 </p>\n\n<p>Easy money right? </p>\n\n<p>Load up a 10x short? </p>\n\n<p>No it&#39;s not it&#39;s a trap. I see your shorts open on ETH. I see the Put wall on BTC. It&#39;s a repeat of July. You are going to get liquidated and be used as rocket fuel for the King. </p>\n\n<p>If you are going to do it at least cover with 50% of the base asset so that your ass is protected from the big green candles</p>\n</div><!-- SC_ON -->",
  "score": 204,
  "permalink": "/r/CryptoCurrency/comments/qvda3v/advice_to_bears_in_48hrs_your_going_to_regret/",
  "subreddit": "CryptoCurrency",
  "id": "qvda3v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As a person who sometimes plays the bear game. This is a trap\n\nI know it looks tempting BTC at a major support; 50 daily MA. With previous\nsupport the 21 Daily EMA now as possible resistance. But don't!\n\nThis is the exact same setup we had in July. The Daily RSI going below 50 and\nthe 50 looking…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "たまにクマのゲームをする人としては これは罠である\n\nBTCが主要なサポート；50日MAにいるのは魅力的に見えますよね。以前のサポートと\n日足21本EMAが抵抗となる可能性があります。しかし、いけません!\n\nこれは7月に起きたのと全く同じ設定だ。日足RSIが50を下回っており\n日足RSIが50を下回り、50は...",
      "title": "ベアーズへのアドバイス 48時間後には自分の人生の選択を後悔することになる。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "作为一个有时玩熊游戏的人。这是个陷阱\n\n我知道它看起来很诱人BTC在一个主要的支持；50日线MA。与之前的\n支撑的21日均线现在是可能的阻力。但是，不要!\n\n这与我们在7月份的设置完全相同。日线RSI低于50，并且\n50看起来...",
      "title": "给熊孩子的建议 在48小时内你会后悔你的生活选择"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "作爲一個有時玩熊遊戲的人。這是個陷阱\n\n我知道它看起來很誘人BTC在一個主要的支持；50日線MA。與之前的\n支撐的21日均線現在是可能的阻力。但是，不要!\n\n這與我們在7月份的設置完全相同。日線RSI低於50，並且\n50看起來...",
      "title": "給熊孩子的建議 在48小時內你會後悔你的生活選擇"
    }
  ]
}