{
  "author": "timelin9",
  "the_new_excerpt": "Backstory: I don't trust Plaid's privacy policy. At the end of the day, they own\nyour data. So I decided to approach the problem from a different perspective. No\nusernames, no passwords to surrender. You only provide a token from your bank\naccount's API and I take care of the rest. 100% data-owned…",
  "original_created_utc": 1623253104,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "バックストーリー Plaid社のプライバシーポリシーを信用していない。一日の終わりに、彼らはあなたのデータを\nデータを所有しています。そこで私は、別の視点からこの問題に取り組むことにしました。いいえ\nユーザー名もパスワードも明かさない。あなたは銀行口座のAPIからトークンを提供するだけで\nあとは私にお任せください。100％データ所有の...",
      "title": "私のサイドプロジェクトは、100％プライバシーに特化したパーソナルファイナンスを目指します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "背景故事。我不相信Plaid的隐私政策。在一天结束时，他们拥有\n你的数据。所以我决定从不同的角度来处理这个问题。没有\n用户名，不需要交出密码。你只需从你的银行账户API中提供一个令牌\n帐户的API，其余的由我来处理。100%的数据所有权...",
      "title": "我的副业将是一个100%以隐私为重点的个人金融项目"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "背景故事。我不相信Plaid的隱私政策。在一天結束時，他們擁有\n你的數據。所以我決定從不同的角度來處理這個問題。沒有\n用戶名，不需要交出密碼。你只需從你的銀行賬戶API中提供一個令牌\n帳戶的API，其餘的由我來處理。100%的數據所有權...",
      "title": "我的副業將是一個100%以隱私爲重點的個人金融項目"
    }
  ],
  "title": "My Side Project Will Be a 100% Privacy-Focused Personal Finance",
  "created_utc": 1623304611,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Backstory: I don&#39;t trust Plaid&#39;s privacy policy. At the end of the day, they own your data. So I decided to approach the problem from a different perspective. No usernames, no passwords to surrender. You only provide a token from your bank account&#39;s API and I take care of the rest. 100% data-owned and 100% anonymity using the Bitcoin blockchain. That simple.   </p>\n\n<p>At this point, I just want this for myself because I have too many accounts to be checking multiple apps ( I also forget to check these apps).</p>\n</div><!-- SC_ON -->",
  "score": 11,
  "permalink": "/r/SideProject/comments/nvyt6n/my_side_project_will_be_a_100_privacyfocused/",
  "subreddit": "SideProject",
  "id": "nvyt6n",
  "is_self": true,
  "media": null,
  "is_video": false
}