{
  "author": "UnexperiencedIT",
  "original_created_utc": 1631926023,
  "title": "Let’s be honest, most of us have no idea what we’re doing",
  "created_utc": 1631936015,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So we all know that too many people are buying blind without knowing what they’re doing and they are being influenced to invest thinking the price will rise and other people are encouraging them to have a go. </p>\n\n<p>My friend invested around $ 5000 in a meme coin. Do you think he knows what he&#39;s doing?  He is not researching the facts, dollar cost averaging, and diversifying into other assets. </p>\n\n<p>And viewing charts and youtube tips? Will the price go up, down or sideways? can charts really predict the future?  They can help you a little bit maybe but for example, can you by looking at the chart predict a law that America or China will pass that can have a great impact on crypto? Also, how many of us went in just because of fear of missing out, driven by emotions.</p>\n\n<p>I think that I read that at least a quarter or a third of us have very little knowledge about the coins in which we invest money.</p>\n\n<p>I will be the first to admit that when I started I was not even remotely interested in the tech of most crypto. Now I am interested but its still hard to understand lol.  The point of the story is that I don&#39;t know sh * t about f * ck genereally lol.</p>\n</div><!-- SC_ON -->",
  "score": 194,
  "permalink": "/r/CryptoCurrency/comments/pqciq9/lets_be_honest_most_of_us_have_no_idea_what_were/",
  "subreddit": "CryptoCurrency",
  "id": "pqciq9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So we all know that too many people are buying blind without knowing what\nthey’re doing and they are being influenced to invest thinking the price will\nrise and other people are encouraging them to have a go.\n\nMy friend invested around $ 5000 in a meme coin. Do you think he knows what he's\ndoing? He…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "多くの人が何も知らずに盲目的に購入していることは周知の事実です。\nまた、価格が上がると思って投資したり、他の人に勧められて投資したりしている人もいます。\n価格が上がると思って投資したり、他の人に勧められて投資したりしています。\n\n私の友人は、ミームコインに約5000ドルを投資しました。彼は自分が何をしているか分かっていると思いますか？\nしていると思いますか？彼は...",
      "title": "正直なところ、ほとんどの人は自分が何をしているのかわからないと思います。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我们都知道，有太多的人在不知道自己在做什么的情况下盲目购买\n他们被影响到投资，认为价格会上涨。\n而其他人也在鼓励他们放手一搏。\n\n我的朋友在一个纪念币上投资了大约5000美元。你认为他知道自己在做什么吗？\n在做什么？他...",
      "title": "老实说，我们大多数人都不知道自己在做什么。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我們都知道，有太多的人在不知道自己在做什麼的情況下盲目購買\n他們被影響到投資，認爲價格會上漲。\n而其他人也在鼓勵他們放手一搏。\n\n我的朋友在一個紀念幣上投資了大約5000美元。你認爲他知道自己在做什麼嗎？\n在做什麼？他...",
      "title": "老實說，我們大多數人都不知道自己在做什麼。"
    }
  ]
}