{
  "author": "VictorPumpenstein",
  "original_created_utc": 1655861938,
  "title": "Why does the pull out method not work?",
  "created_utc": 1655869152,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In perfect conditions, i.e. the penis fully exits the vagina prior to ejaculation and the semen launches elsewhere, is there still significant risk of pregnancy? &lt;/p&gt;\n\n&lt;p&gt;When people say the method doesn’t work is the assumption that you won’t pull out perfectly every time, or that there is something else happening that makes it a high risk maneuver?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/vht9jv/why_does_the_pull_out_method_not_work/",
  "subreddit": "TooAfraidToAsk",
  "id": "vht9jv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "In perfect conditions, i.e. the penis fully exits the vagina prior to\nejaculation and the semen launches elsewhere, is there still significant risk of\npregnancy?\n\nWhen people say the method doesn’t work is the assumption that you won’t pull\nout perfectly every time, or that there is something else…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "完璧な状態、つまり射精前にペニスが膣から完全に抜け出し、精液が別の場所に発射される状態でも\n射精の前にペニスが膣から完全に出て、精液が別の場所に発射されるような完璧な状態でも、妊娠のリスクはかなりあるのでしょうか？\n妊娠のリスクはあるのでしょうか？\n\nこの方法がうまくいかないと言われるのは、毎回完璧に抜けないという前提があるからです。\n毎回完璧に抜けないとか、他に何かあるのでは...？",
      "title": "なぜ引き抜き方式はうまくいかないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在完美的条件下，即在射精之前，阴茎完全离开阴道，而在射精之前，阴茎完全离开阴道。\n在完美的条件下，即阴茎在射精前完全离开阴道，精液发射到其他地方，是否仍有很大的风险\n怀孕的风险吗？\n\n当人们说这种方法不起作用时，是假设你不会每次都完美地拔出\n拔出来，或者有其他原因......",
      "title": "为什么拉出法不起作用？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在完美的條件下，即在射精之前，陰莖完全離開陰道，而在射精之前，陰莖完全離開陰道。\n在完美的條件下，即陰莖在射精前完全離開陰道，精液發射到其他地方，是否仍有很大的風險\n懷孕的風險嗎？\n\n當人們說這種方法不起作用時，是假設你不會每次都完美地拔出\n拔出來，或者有其他原因......",
      "title": "爲什麼拉出法不起作用？"
    }
  ]
}