{
  "author": "crazunggoy47",
  "original_created_utc": 1642682494,
  "title": "Why is the speed of sound higher in warmer air?",
  "created_utc": 1642687345,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My understanding is that sound travels faster through solids and liquids than through gases because the former states are denser. In other words, molecules would collide with less delay between neighbors when passing along a pressure wave if the density is higher.&lt;/p&gt;\n\n&lt;p&gt;But it seems that &lt;a href=\"https://www.engineeringtoolbox.com/air-speed-sound-d_603.html\"&gt;the speed of sound is higher in hotter air.&lt;/a&gt; Hotter air is less dense than cooler air (e.g., hot air balloon).&lt;/p&gt;\n\n&lt;p&gt;Can someone please explain what causes the speed of sound to increase in warm air, but also increase when gases are turned to liquids or solids?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 133,
  "permalink": "/r/askscience/comments/s8i3v8/why_is_the_speed_of_sound_higher_in_warmer_air/",
  "subreddit": "askscience",
  "id": "s8i3v8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "My understanding is that sound travels faster through solids and liquids than\nthrough gases because the former states are denser. In other words, molecules\nwould collide with less delay between neighbors when passing along a pressure\nwave if the density is higher.\n\nBut it seems that the speed of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の理解では、音は固体や液体の中を通る方が速く伝わります。\n気体は密度が高いので、気体を通過します。I",
      "title": "なぜ、暖かい空気の方が音速が速くなるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的理解是，声音在固体和液体中传播的速度比\n因为前者的密度大。换言之，分子\n碰撞时，如果密度较高，相邻的分子之间的延迟就会减少。\n如果密度较高，分子之间的碰撞延迟就会减少。\n\n但是，似乎声音的速度...",
      "title": "为什么在较温暖的空气中音速会更高？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的理解是，聲音在固體和液體中傳播的速度比\n因爲前者的密度大。換言之，分子\n碰撞時，如果密度較高，相鄰的分子之間的延遲就會減少。\n如果密度較高，分子之間的碰撞延遲就會減少。\n\n但是，似乎聲音的速度...",
      "title": "爲什麼在較溫暖的空氣中音速會更高？"
    }
  ]
}