{
  "author": "Edgarjosue1",
  "original_created_utc": 1631420026,
  "title": "With smart contracts on Cardano literally hours away I wanna know, what stops ADA from exploding like SOLANA did? *serious*",
  "created_utc": 1631431833,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>And I am seriously asking, I’m a 2020 baby, not that expert, I really want to know what stops it, is it the market cap? Is it totally posible or is it delusional, what I wonder tho is Can it pump a la SOLANA?</p>\n\n<p>Now with smart contracts ADA will have a real use and let’s be honest Cardano has one of if not the best teams in any crypto project if not the best, yes I used to make memes of ADA for not being useful for shit, <em>but</em> is this a BIG opportunity?</p>\n\n<p>Im really asking for educational purposes please don’t shit on me, I’m sorry if this post is stupid hahahahaha, love you guys and thanks in advance for educating me.</p>\n\n<p>Also I hope you get that bag!</p>\n</div><!-- SC_ON -->",
  "score": 194,
  "permalink": "/r/CryptoCurrency/comments/pmlv6e/with_smart_contracts_on_cardano_literally_hours/",
  "subreddit": "CryptoCurrency",
  "id": "pmlv6e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "And I am seriously asking, I’m a 2020 baby, not that expert, I really want to\nknow what stops it, is it the market cap? Is it totally posible or is it\ndelusional, what I wonder tho is Can it pump a la SOLANA?\n\nNow with smart contracts ADA will have a real use and let’s be honest Cardano\nhas one of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は2020年生まれで専門家ではありませんが、本気で聞きたいと思っています。\n何を止めるのか、それはマーケットキャップなのか？それは完全に可能なのか、それとも妄想なのか。\n私が疑問に思うのは、SOLANAのようなパンプができるのかということです。\n\nスマートコントラクトでADAは実際に使用されるでしょうし、正直に言うと、Cardanoには1つの...\nはその一つだと思います。",
      "title": "Cardanoのスマートコントラクトが文字通り数時間後に迫っている中、SOLANAのようにADAが爆発しないようにするにはどうしたらいいのか知りたいです。*笑"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我认真地问，我是2020年的婴儿，不是那个专家，我真的想知道\n知道是什么阻止了它，是市值吗？它是完全可能的还是\n我想知道的是，它能不能像SOLANA那样抽水？\n\n现在有了智能合约，ADA将有真正的用途，说实话，Cardano\n有一个...",
      "title": "我想知道，在Cardano上的智能合约离我们只有几个小时的路程，是什么阻止了ADA像SOLANA那样的爆炸？*严肃的*。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我認真地問，我是2020年的嬰兒，不是那個專家，我真的想知道\n知道是什麼阻止了它，是市值嗎？它是完全可能的還是\n我想知道的是，它能不能像SOLANA那樣抽水？\n\n現在有了智能合約，ADA將有真正的用途，說實話，Cardano\n有一個...",
      "title": "我想知道，在Cardano上的智能合約離我們只有幾個小時的路程，是什麼阻止了ADA像SOLANA那樣的爆炸？*嚴肅的*。"
    }
  ]
}