{
  "author": "roberthonker",
  "the_new_excerpt": "One comment upvote is worth one karma, which is 0.48 moons. (at least this month\nwith double comment karma) moons are 8 cents so one upvote is 4 cents. One\nsingle click, which can be initiated by anyone with a free account and access to\ninternet is worth almost 4 cents. This is higher than the…",
  "original_created_utc": 1621828351,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1つのコメントのupvoteは1karmaの価値があり、これは0.48ムーンです。(少なくとも今月は\nムーンは8セントなので、1upvoteは4セントです。ワン\n無料のアカウントとインターネットへのアクセスがあれば、誰でも始められるワンクリックが\nインターネットにアクセスできる無料のアカウントがあれば誰でも始められるワンクリックは、ほぼ4セントの価値があります。これは...より高い。",
      "title": "こんなクソみたいな時代に、気を紛らわせるものがあります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "一条评论的最高票值是一个因果，也就是0.48个月。(至少在这个月\n有双倍的评论业力）月亮是8美分，所以一个最高票数是4美分。一个\n一次点击，可以由任何拥有免费账户和访问互联网的人发起。\n互联网的人都可以点击，价值近4美分。这要高于...",
      "title": "在这些糟糕的时期，这里有一些东西可以让你的注意力从图表上移开。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "一條評論的最高票值是一個因果，也就是0.48個月。(至少在這個月\n有雙倍的評論業力）月亮是8美分，所以一個最高票數是4美分。一個\n一次點擊，可以由任何擁有免費賬戶和訪問互聯網的人發起。\n互聯網的人都可以點擊，價值近4美分。這要高於...",
      "title": "在這些糟糕的時期，這裏有一些東西可以讓你的注意力從圖表上移開。"
    }
  ],
  "title": "During these shitty times, here's something to take your mind off the charts.",
  "created_utc": 1621842003,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>One comment upvote is worth one karma, which is 0.48 moons. (at least this month with double comment karma) moons are 8 cents so one upvote is 4 cents. One single click, which can be initiated by anyone with a free account and access to internet is worth almost 4 cents. <strong>This is higher than the minimum hourly wage in some countries.</strong> Sierra Leone for example has a minimum wage of 3 cents. It really puts things in perspective.</p>\n\n<p>I hope this gave you something to think about!</p>\n\n<p>edit: my bad on the inadvertently sexual title </p>\n</div><!-- SC_ON -->",
  "score": 2422,
  "permalink": "/r/CryptoCurrency/comments/njown1/during_these_shitty_times_heres_something_to_take/",
  "subreddit": "CryptoCurrency",
  "id": "njown1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197385279
}