{
  "author": "fpsoneone",
  "the_new_excerpt": "> What actually occurs in these cases is wealth transfer, often on a massive\n> scale. By shamelessly merchandising birdless bushes, promoters have in recent\n> years moved billions of dollars from the pockets of the public to their own\n> purses (and to those of their friends and associates). The fact…",
  "original_created_utc": 1613773468,
  "title": "Warren Buffet's thoughts from pg 14 of 2000 shareholder letter",
  "created_utc": 1613802157,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><blockquote>\n<p>What actually occurs in these cases is wealth transfer, often on a massive scale. By shamelessly merchandising birdless bushes, promoters have in recent years moved billions of dollars from the pockets of the public to their own purses (and to those of their friends and associates). The fact is that a bubble market has allowed the creation of bubble companies, entities designed more with an eye to making money off investors rather than for them. Too often, an IPO, not profits, was the primary goal of a company’s promoters. At bottom, the “business model” for these companies has been the old-fashioned chain letter, for which many fee-hungry investment bankers acted as eager postmen.  </p>\n\n<p>But a pin lies in wait for every bubble. And when the two eventually meet, a new wave of investors learns some very old lessons: First, many in Wall Street ¾ a community in which quality control is not prized ¾ will sell investors anything they will buy. Second, speculation is most dangerous when it looks easiest.</p>\n</blockquote>\n\n<p>Warren Buffet wrote this in his year 2000 shareholder letter, which I read for the first time today. It was interesting as it might be something to consider and think about as we continue to fly high. I don&#39;t profess to knowing anything about valuations, but clearly we have been doing quite well for quite some time. I, for one, am not intelligent enough to try and beat the market so I just DCA into boring ETFs and funds and am satisfied doing so, but nonetheless, these paragraphs were interesting to me as it seemed to be potentially relevant to all of the news that has been coming out lately.  </p>\n\n<p>With so many new traders and so much more ease of access to the world of finance, hopefully, we see even more transparency and ease of access to information, as well. As I continue to learn and understand more I find there is an increased need for the great input and sharing of ideas that a community like this can provide.   </p>\n\n<p>I am interested to know if you all think we are at risk of, yet again, replicating what Buffet spoke of in 2000.</p>\n</div><!-- SC_ON -->",
  "score": 65,
  "permalink": "/r/stocks/comments/lns27w/warren_buffets_thoughts_from_pg_14_of_2000/",
  "subreddit": "stocks",
  "id": "lns27w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332885063,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "> 在这些情况下实际发生的是财富转移，往往是大规模的\n> 规模。通过无耻地推销无鸟的灌木丛，推广者近年来\n> 近年来，推广者通过无耻地推销无鸟的灌木，将数十亿美元从公众的口袋里转移到他们自己的\n>钱包（以及他们的朋友和同事的钱包）。事实是...",
      "title": "沃伦-巴菲特在2000年股东信第14页中的想法"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "> 在這些情況下實際發生的是財富轉移，往往是大規模的\n> 規模。通過無恥地推銷無鳥的灌木叢，推廣者近年來\n> 近年來，推廣者通過無恥地推銷無鳥的灌木，將數十億美元從公衆的口袋裏轉移到他們自己的\n>錢包（以及他們的朋友和同事的錢包）。事實是...",
      "title": "沃倫-巴菲特在2000年股東信第14頁中的想法"
    }
  ]
}