{
  "author": "thurn",
  "original_created_utc": 1631506507,
  "title": "The meaning of one of the words in the Lord's Prayer (ἐπιούσιος) was unknown less than 300 years after it was written. Was this a unique occurrence or a common problem with preserving the meaning of the Bible?",
  "created_utc": 1631543812,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://en.wikipedia.org/wiki/Epiousios\">Wikipedia</a> reports that St Jerome struggled with identifying the meaning of this word in the Lord&#39;s Prayer in 382 AD -- it&#39;s astonishing to me that that the meaning of a word in one of the most well-known parts of the Gospels could be such a mystery a few centuries later. Was this some kind of unique situation, or was it already such a struggle to interpret Biblical Greek?</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/pn86l4/the_meaning_of_one_of_the_words_in_the_lords/",
  "subreddit": "AskHistorians",
  "id": "pn86l4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Wikipedia [https://en.wikipedia.org/wiki/Epiousios] reports that St Jerome\nstruggled with identifying the meaning of this word in the Lord's Prayer in 382\nAD -- it's astonishing to me that that the meaning of a word in one of the most\nwell-known parts of the Gospels could be such a mystery a few…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ウィキペディア[https://en.wikipedia.org/wiki/Epiousios]によると、St Jeromeが\n西暦382年に主の祈りの中でこの言葉の意味を特定するのに苦労したと報告しています。\n福音書の中でも最もよく知られている部分の一つにある単語の意味が、数人の人間にとってこれほどまでに謎であったとは、私には驚きです。\n福音書の中でも最もよく知られている部分の一つであるこの単語の意味が、数年前にはこのような謎になっていたとは驚きです。",
      "title": "主の祈り(ἐπιούσιος)の言葉の一つの意味は、書かれてから300年も経たないうちに不明になってしまいました。これは特殊な出来事だったのか、それとも聖書の意味を保存する上での共通の問題だったのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "维基百科[https://en.wikipedia.org/wiki/Epiousios]报道说，圣杰罗姆\n在公元382年的主祷文中为确定这个词的含义而挣扎。\n公元382年 -- 我很惊讶，福音书中最知名的部分之一的一个词的含义竟然是如此神秘。\n我很惊讶，福音书中最知名的部分之一中的一个词的含义竟然如此神秘，而这只是几个...",
      "title": "主祷文中的一个词（ἐπιούσιος）的含义在写完后不到300年就被人知道了。这是一个独特的现象，还是保存圣经意义的一个常见问题？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "維基百科[https://en.wikipedia.org/wiki/Epiousios]報道說，聖傑羅姆\n在公元382年的主禱文中爲確定這個詞的含義而掙扎。\n公元382年 -- 我很驚訝，福音書中最知名的部分之一的一個詞的含義竟然是如此神祕。\n我很驚訝，福音書中最知名的部分之一中的一個詞的含義竟然如此神祕，而這只是幾個...",
      "title": "主禱文中的一個詞（ἐπιούσιος）的含義在寫完後不到300年就被人知道了。這是一個獨特的現象，還是保存聖經意義的一個常見問題？"
    }
  ]
}