{
  "author": "The-eff",
  "original_created_utc": 1628695100,
  "title": "What is gravitational potential always negative except when it is 0 at infinity?",
  "created_utc": 1628713221,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I understand that gravitational potential at infinity is 0 because the intensity of a gravitational field is 0 at infinity. What I do not understand is why does the gravitational potential not increase when an object approaches the source mass. The gravitational potential energy increases but the gravitational potential decreases. So, I think what my question really is about how gravitational potential is defined. ( i know the book definition,But I don’t understand how ....it works exactly)</p>\n\n<p>Edit: </p>\n\n<p>so as far as I understand now, it is that using 0 potential for infinite distance from the source mass is just a matter of convention as gravitational potential at any point is in reference to the gravitational potential at another point( its comparative) and hence it can be negative. If I am still not right, please help me improve my understanding</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/askscience/comments/p2f4ht/what_is_gravitational_potential_always_negative/",
  "subreddit": "askscience",
  "id": "p2f4ht",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So I understand that gravitational potential at infinity is 0 because the\nintensity of a gravitational field is 0 at infinity. What I do not understand is\nwhy does the gravitational potential not increase when an object approaches the\nsource mass. The gravitational potential energy increases but the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "なので、無限大の重力ポテンシャルが0になるのは、理解しています。\n重力場の強度が無限大で0になるからです。分からないのは\nなぜ物体が元の質量に近づいても重力ポテンシャルが大きくならないのか？\n源の質量 重力ポテンシャルのエネルギーは増加しますが、...",
      "title": "重力ポテンシャルは、無限大で0の時以外は常にマイナスであるとは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我理解，无限大时的引力势是0，因为\n因为引力场的强度在无限远处为0。我不明白的是\n为什么当一个物体接近源质量时，引力势不会增加？\n源质量时，重力势能不会增加。引力势能会增加，但...",
      "title": "除了在无限大时为0外，引力势总是负的，是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我理解，無限大時的引力勢是0，因爲\n因爲引力場的強度在無限遠處爲0。我不明白的是\n爲什麼當一個物體接近源質量時，引力勢不會增加？\n源質量時，重力勢能不會增加。引力勢能會增加，但...",
      "title": "除了在無限大時爲0外，引力勢總是負的，是什麼？"
    }
  ]
}