{
  "author": "cidadefalcao",
  "original_created_utc": 1631563567,
  "title": "If you want bitcoin prices to rise, stop leaving bitcoin on exchanges.",
  "created_utc": 1631575828,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>TLDR: Leaving bitcoin on exchanges helps their clients (mainly institutional) to take short positions on bitcoin (depressing its price) as your bitcoins act as collateral for their trades. If they eventually go bust hard, you will/may pay for their loss.</strong> </p>\n\n<p>Many people are wondering why the bitcoin price is not going up despite massive institutional buying and increased adoption.  An important reason for that is that bitcoin seems to be suffering from a similar phenomenon (although in a much lower scale at this point) that gold suffers:  The reason why gold is stagnated for years is because there are massive short positions kept by a few key players, which are “subsidized” by a vast amount of “paper gold” in the markets. With bitcoin, this happens through the exchanges.</p>\n\n<p><strong>People that care about the bitcoin price should stop using exchanges as wallets immediately.</strong> It does not matter that they are safe. They can be 100% safe, insured if you would like, just like your bank deposits. Bitcoins in exchanges aren’t “bitcoin”, they are “paper bitcoin”.  They are a liability for the exchange and an asset for you, but a different asset than if you had the bitcoin in a personal wallet. What you have is a promise from the exchange to have that bitcoins deposited in an address you give should you request a withdraw.  Under normal circumstances, this works well. Under distress situations, it does not. What the exchange has is a promise to pay you back, but only if they can. In many instances, they will not be able to. And that’s fine, they are limited liability companies.  I am confident that the open short interest in bitcoin is substantially large, potentially much bigger than the number of existing bitcoins, or the bitcoin &quot;free float&quot;.  These short positions are collateralized by bitcoins left in exchanges, regardless if the exchange mentions it explicit or not. Some exchanges are honest and mention it clearly in their terms that in the situation where their insurance fund is depleted, losses will be socialized among winning traders. Others don’t. The bitcoins that you leave in exchanges are used as collateral, explicitly or implicitly, by them to finance short positions of their clients. Even if an exchange does not allow margin trading for retail clients, they very likely do for institutional clients, which is even worse. Notice also that it does not matter if the balance of clients matches what these exchanges have in their wallets. It is practically invisible to outsiders how much institutional clients are leveraged through these exchanges, and a way of estimating or getting a sense of it must be urgently developed for a better understanding of the market. If all those keeping bitcoins at exchanges withdraw them to a private wallet, the exchanges will have to increase their margin requirements for leveraged clients (or reduce the leverage limits), which will force these clients to close their positions or buy more bitcoin. There is no other way, and this of course is good for bitcoin. If people however keep using exchanges as wallets, then we run the risk of bitcoin being constantly manipulated by players who are able to leverage short positions at levels that we cannot even assess.</p>\n\n<p>My recommendation is that those interested in higher bitcoin prices to move their bitcoin to addresses that they, and only they, have control of. This includes those likely making use of custodial services, particularly when custody is made by an exchange. It is quite ironic that many of these investors that buy bitcoin instead of gold because “gold price is manipulated by the banks” do exactly the same gold investors do. If you buy bitcoin to leave it deposited somewhere else under a custodian,  particularly if this custodian has clients that can short bitcoin, you are very likely doing a disservice for bitcoin. Move your bitcoins immediately somewhere else, buy insurance if necessary, or leave them with a custodian that performs only custody and nothing else. The reason by the way why custodian services are usually cheaper than insurance is precisely because the custodian can profit on you (by having your precious bitcoins in custody) in other ways.</p>\n\n<p>As long as we have bitcoins being left in exchanges or in the hands of custodians that fill very much the role of the same banks that bitcoin holders aim to be disconnected from, we will have bitcoin moving sideways and fighting hard for higher price levels.</p>\n\n<p>In the end, inevitably, bitcoin prices will grow. But this process can be much faster if each bitcoin holder takes care of its own bitcoins or leave them with true custodians, not exchanges.</p>\n</div><!-- SC_ON -->",
  "score": 168,
  "permalink": "/r/Bitcoin/comments/pnn9c5/if_you_want_bitcoin_prices_to_rise_stop_leaving/",
  "subreddit": "Bitcoin",
  "id": "pnn9c5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "TLDR: Leaving bitcoin on exchanges helps their clients (mainly institutional) to\ntake short positions on bitcoin (depressing its price) as your bitcoins act as\ncollateral for their trades. If they eventually go bust hard, you will/may pay\nfor their loss.\n\nMany people are wondering why the bitcoin…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "TLDR: ビットコインを取引所に残すことで、彼らの顧客（主に機関投資家）が\nビットコインを取引所に置いておくと、顧客（主に機関投資家）がビットコインのショートポジションを取るのに役立つ（価格が下がる）。\n彼らの取引の担保になるからです。彼らが最終的に破綻した場合、あなたはその損失を支払うことになるでしょう。\n損失を被ることになります。\n\n多くの人は、なぜビットコインが...",
      "title": "ビットコインの価格を上昇させたいのであれば、取引所にビットコインを置いておくのをやめましょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "TLDR: 将比特币留在交易所有助于他们的客户（主要是机构）对比特币进行\n做空比特币（压低其价格），因为你的比特币可以作为\n作为他们交易的抵押品。如果他们最终严重破产，你将/可能会支付\n为他们的损失买单。\n\n很多人都在想，为什么比特币...",
      "title": "如果你想让比特币价格上涨，就不要把比特币留在交易所了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "TLDR: 將比特幣留在交易所有助於他們的客戶（主要是機構）對比特幣進行\n做空比特幣（壓低其價格），因爲你的比特幣可以作爲\n作爲他們交易的抵押品。如果他們最終嚴重破產，你將/可能會支付\n爲他們的損失買單。\n\n很多人都在想，爲什麼比特幣...",
      "title": "如果你想讓比特幣價格上漲，就不要把比特幣留在交易所了。"
    }
  ]
}