{
  "author": "Vladith",
  "the_new_excerpt": "I know this is a huge question. I'm curious if there is any consensus, or at\nleast competing theories, about whether the inhabitants of Britain during the\nLate Bronze Age would have spoken an \"Old European\" language like Basque or\nEtruscan, or an unattested Indo-European language potentially…",
  "original_created_utc": 1619982065,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは大きな質問だと思いますが 私が気になっているのは、この時代のイギリスの住人が、何をしていたのかということについて、何かコンセンサスがあるのか、少なくとも\n後期青銅器時代のイギリスの住民が\n後期青銅器時代のイギリスの住民は、バスク語やエトルリア語のような「旧ヨーロッパ」の言語を話していたのか\nエトルリア語のような \"古ヨーロッパ \"の言語を話していたのか、それとも未確認のインド・ヨーロッパ語を話していたのかについて、何かコンセンサスがあるのでしょうか。",
      "title": "ケルト語の方言が伝わってくる前のイギリスでは、どのような言語が話されていたのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道这是一个巨大的问题。我很好奇，是否有任何共识，或者至少有相互竞争的理论。\n至少是相互竞争的理论，关于英国的居民在青铜器晚期是否\n青铜时代晚期的英国居民是否会说一种 \"旧欧洲 \"语言，如巴斯克语或\n埃特鲁里亚语，或一种未被证实的印欧语。",
      "title": "在凯尔特人的方言到来之前，英国可能使用什么语言？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道這是一個巨大的問題。我很好奇，是否有任何共識，或者至少有相互競爭的理論。\n至少是相互競爭的理論，關於英國的居民在青銅器晚期是否\n青銅時代晚期的英國居民是否會說一種 \"舊歐洲 \"語言，如巴斯克語或\n埃特魯里亞語，或一種未被證實的印歐語。",
      "title": "在凱爾特人的方言到來之前，英國可能使用什麼語言？"
    }
  ],
  "title": "What languages might have been spoken in Britain prior to the arrival of Celtic dialects?",
  "created_utc": 1619998590,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I know this is a huge question. I&#39;m curious if there is any consensus, or at least competing theories, about whether the inhabitants of Britain during the Late Bronze Age would have spoken an &quot;Old European&quot; language like Basque or Etruscan, or an unattested Indo-European language potentially associated with the Beaker culture. </p>\n\n<p>Do place-names or archeology give us any hint about about what language might have been spoken before the introduction of Brittonic?</p>\n</div><!-- SC_ON -->",
  "score": 130,
  "permalink": "/r/AskHistorians/comments/n3d8tj/what_languages_might_have_been_spoken_in_britain/",
  "subreddit": "AskHistorians",
  "id": "n3d8tj",
  "is_self": true,
  "media": null,
  "is_video": false
}