{
  "author": "giddyup281",
  "original_created_utc": 1641291488,
  "title": "What is THAT one coin that you'll never buy despite the hype around it?",
  "created_utc": 1641321524,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So, what is that one coin or token that everyone loves and you think there&amp;#39;s something horribly wrong with it?&lt;/p&gt;\n\n&lt;p&gt;What is the coin that rustles your jimmies?&lt;/p&gt;\n\n&lt;p&gt;What is your crypto principle that this coin so blatantly breaks, that you&amp;#39;re fine with missing 20x on possible profits, just to maintain your integrity? What is that principle - code is law? No scams/Ponzies? No meme coins? Decentralization is a must? &lt;/p&gt;\n\n&lt;p&gt;What is the coin that makes you say &amp;quot;this is where I draw the line&amp;quot; or &amp;quot;I&amp;#39;m really in it for the tech&amp;quot; so you absolutely will not buy it?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 332,
  "permalink": "/r/CryptoCurrency/comments/rvr52s/what_is_that_one_coin_that_youll_never_buy/",
  "subreddit": "CryptoCurrency",
  "id": "rvr52s",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So, what is that one coin or token that everyone loves and you think there's\nsomething horribly wrong with it?\n\nWhat is the coin that rustles your jimmies?\n\nWhat is your crypto principle that this coin so blatantly breaks, that you're\nfine with missing 20x on possible profits, just to maintain your…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "では、みんなが大好きなコインやトークンで、あなたが「これだ！」と思うものは何でしょう？\n何か恐ろしいほど間違っているのでしょうか？\n\nあなたの心をざわつかせるコインとは何でしょうか？\n\nこのコインがあからさまに破っている暗号の原則は何でしょうか。\n20倍の利益が出ても、それを維持するためなら平気だ...。",
      "title": "大々的に宣伝されているにもかかわらず、絶対に買わないコインは何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "那么，有什么是大家都喜欢的硬币或代币，而你却认为它有什么可怕的问题？\n它有什么可怕的问题？\n\n什么是让你心动的硬币？\n\n什么是你的加密货币原则，这个硬币如此明目张胆地破坏，以至于你可以\n错过20倍的可能利润也无所谓，只是为了维持你的...",
      "title": "什么是那个尽管被炒得沸沸扬扬但你永远不会买的硬币？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "那麼，有什麼是大家都喜歡的硬幣或代幣，而你卻認爲它有什麼可怕的問題？\n它有什麼可怕的問題？\n\n什麼是讓你心動的硬幣？\n\n什麼是你的加密貨幣原則，這個硬幣如此明目張膽地破壞，以至於你可以\n錯過20倍的可能利潤也無所謂，只是爲了維持你的...",
      "title": "什麼是那個儘管被炒得沸沸揚揚但你永遠不會買的硬幣？"
    }
  ]
}