{
  "author": "sikeig",
  "original_created_utc": 1629915037,
  "title": "You are ahead of 99.8% of all Crypto users by following these steps",
  "created_utc": 1629923975,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h1><strong>Wallets</strong></h1>\n\n<p>The most secure way to access your cryptocurrencies will always be a hardware wallet. It should be a common practice to have control over your own private keys and not leaving funds on an exchange. — The most used and trusted hardware wallets are:</p>\n\n<ul>\n<li><p><strong>Ledger</strong> <em>(for all cryptocurrencies)</em></p></li>\n<li><p><strong>Trezor</strong> <em>(for all cryptocurrencies)</em></p></li>\n<li><p><strong>BitBox02</strong> <em>(for Bitcoin only)</em></p></li>\n<li><p><strong>Coldcard</strong> <em>(for Bitcoin only)</em></p></li>\n</ul>\n\n<h1><strong>Seed Backup</strong></h1>\n\n<p>The 24 words that are the password to your funds should always be backed up somewhere. Don’t rely on hardware completely it can and will fail at some point. Make sure to keep the backup completely offline. — The most common seed backup methods are:</p>\n\n<ul>\n<li><p><strong>A simple piece of paper</strong> (Don’t print, use a pencil/pen)</p></li>\n<li><p><strong>A metal plate</strong> (It’s the safer method since it’s resistent to fire, water and earthquakes. Engrave the words yourself manually.)</p></li>\n</ul>\n\n<h1><strong>Data Leaks</strong></h1>\n\n<p>Database breaches will always happen and it’s not even your fault. The best you can do is protect yourself against it by using the most secure tools on all ends.</p>\n\n<ul>\n<li><p><strong>2FA</strong>, avoid using your phone number, use Authenticator apps instead. Sim swap attacks are more common than you think. — There are countless authenticator apps out there: <strong>Google Authenticator</strong>, <strong>Microsoft Authenticator</strong>, <strong>OTP Auth</strong> etc.</p></li>\n<li><p><strong>Mobile Provider</strong>, you can request to set up additional security steps to prevent sim swaps. You shouldn’t rely on it, social engineering can still exploit the extra steps.</p></li>\n<li><p><strong>Password Manager</strong>, unique and strong passwords for all accounts are essential. — The safest and recommended providers are: <strong>Bitwarden</strong>, <strong>KeePass</strong> and <strong>LessPass</strong></p></li>\n<li><p><strong>Request Data Deletion</strong>, request the deletion of your data from crypto companies. Especially from the hardware wallet companies. Leaks of personal information, addresses and phone numbers happened in the past before.</p></li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 317,
  "permalink": "/r/CryptoCurrency/comments/pbgux5/you_are_ahead_of_998_of_all_crypto_users_by/",
  "subreddit": "CryptoCurrency",
  "id": "pbgux5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "WALLETS\n\nThe most secure way to access your cryptocurrencies will always be a hardware\nwallet. It should be a common practice to have control over your own private\nkeys and not leaving funds on an exchange. — The most used and trusted hardware\nwallets are:\n\n * Ledger (for all cryptocurrencies)\n\n *…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ウォレット\n\n暗号通貨にアクセスする最も安全な方法は、常にハードウェア・ウォレットです。\nウォレットです。自分の秘密鍵を管理し、資金を取引所に預けないことは、一般的に行われるべきことです。\n鍵を管理し、取引所に資金を残さないことが一般的です。- 最も使用され、信頼されているハードウェア\nウォレットは以下の通りです。\n\n * Ledger (すべての暗号通貨用)\n\n *...",
      "title": "以下の手順を踏むことで、99.8%のCryptoユーザーの先を行くことができます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "钱包\n\n访问你的加密货币的最安全方式将永远是一个硬件\n钱包。控制你自己的私钥应该是一种常见的做法。\n钥匙，而不是把资金留在交易所。- 最常用和最值得信赖的硬件\n的钱包是。\n\n * Ledger（适用于所有加密货币\n\n *...",
      "title": "遵循这些步骤，你将领先于99.8%的所有加密货币用户"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "錢包\n\n訪問你的加密貨幣的最安全方式將永遠是一個硬件\n錢包。控制你自己的私鑰應該是一種常見的做法。\n鑰匙，而不是把資金留在交易所。- 最常用和最值得信賴的硬件\n的錢包是。\n\n * Ledger（適用於所有加密貨幣\n\n *...",
      "title": "遵循這些步驟，你將領先於99.8%的所有加密貨幣用戶"
    }
  ]
}