{
  "author": "Nuewim",
  "original_created_utc": 1641154015,
  "title": "Most successful people in this sub don't tell truth about their profits or investments. They stay quiet or lower their numbers.",
  "created_utc": 1641216998,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Why people in this sub don&amp;#39;t tell truth about their portfolios? Because many members are average or terrible investors so  success trigger them. And of course  a lot of scammers too. Everyone else need to lower the bar if  they want to be treated equally and don&amp;#39;t have spam in DMs.&lt;/p&gt;\n\n&lt;p&gt;People are jealous creatures. Sorry to say but crypto, even this sub is full of losers that will downvote your every comment if they will see you as &amp;quot;lucky bastard&amp;quot;. They think more money other people make, less for them. Some people downote everyone for whole month  to earn  literally like 0.00001 moons more so don&amp;#39;t act suprised  top members don&amp;#39;t want to talk about big profits. They gain nothing from it, only risk and problems.&lt;/p&gt;\n\n&lt;p&gt;Just check comments under any post  about profits. Main one always is &amp;quot;I don&amp;#39;t have profits&amp;quot;, it is half joke and half sad truth that many people  wants to feel better. Comments about big profits get less upvotes and positive reactions that comments about little or no profits.&lt;/p&gt;\n\n&lt;p&gt;Also no one would believe someone that tell  about really big profits. If guy that invested $8k into Shiba and earned billions or even &amp;quot;average whale&amp;quot; that have few millions in BTC would came here they would be ignored. Rich people have reddit too, but since it is internet unless they  doxxed themselves they have no chance to prove it.&lt;/p&gt;\n\n&lt;p&gt;Tl;dr: Most people in this sub do much better than they describe.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 301,
  "permalink": "/r/CryptoCurrency/comments/rui2wl/most_successful_people_in_this_sub_dont_tell/",
  "subreddit": "CryptoCurrency",
  "id": "rui2wl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Why people in this sub don't tell truth about their portfolios? Because many\nmembers are average or terrible investors so success trigger them. And of course\na lot of scammers too. Everyone else need to lower the bar if they want to be\ntreated equally and don't have spam in DMs.\n\nPeople are jealous…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "なぜ、このサブの人たちは、自分のポートフォリオについて真実を語らないのだろう？なぜなら、多くの\nメンバーは平均的な、あるいはひどい投資家なので、成功が引き金になるのです。そしてもちろん\n詐欺師も多い。他のみんなはハードルを下げる必要がある。\nDMにスパムが来ることもなく、平等に扱われています。\n\nみんな嫉妬してるんだな・・・。",
      "title": "この分野の成功者の多くは、自分の利益や投資について真実を語らない。黙っているか、数字を下げている。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "为什么这个子里的人不说出他们投资组合的真相？因为许多\n成员是普通或糟糕的投资者，所以成功触发了他们。当然，还有\n也有很多骗子。其他所有人都需要降低标准，如果他们想得到\n平等对待，不要在DMs中出现垃圾邮件。\n\n人们是嫉妒的...",
      "title": "在这个子里，大多数成功人士都不说出他们的利润或投资的真相。他们保持沉默或降低他们的数字。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "爲什麼這個子裏的人不說出他們投資組合的真相？因爲許多\n成員是普通或糟糕的投資者，所以成功觸發了他們。當然，還有\n也有很多騙子。其他所有人都需要降低標準，如果他們想得到\n平等對待，不要在DMs中出現垃圾郵件。\n\n人們是嫉妒的...",
      "title": "在這個子裏，大多數成功人士都不說出他們的利潤或投資的真相。他們保持沉默或降低他們的數字。"
    }
  ]
}