{
  "author": "Last_Dragon89",
  "original_created_utc": 1658363136,
  "title": "Why was there a lack of criminality among German And Scandinavian immigrants compared to the gangs in the Irish and Jewish communities and the Mafia in the Italian community in the 19th/20th century?",
  "created_utc": 1658393983,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I never hear of a “German mob” in America or Scandinavian crime lords in the diaspora. I have seen individual Germans and Scandinavians involved in crime historically but no organized mob-like group. What was it about their immigration stories that differed?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/AskHistorians/comments/w425hz/why_was_there_a_lack_of_criminality_among_german/",
  "subreddit": "AskHistorians",
  "id": "w425hz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I never hear of a “German mob” in America or Scandinavian crime lords in the\ndiaspora. I have seen individual Germans and Scandinavians involved in crime\nhistorically but no organized mob-like group. What was it about their\nimmigration stories that differed?",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アメリカの \"ドイツ・マフィア \"やスカンジナビアの犯罪王は聞いたことがない。\n聞いたことがありません。個々のドイツ人やスカンジナビア人が犯罪に関与しているのは見たことがありますが\n組織化されたマフィアのような集団はありません。彼らの移民はどうだったのだろう。\n何が違うのでしょうか？",
      "title": "19世紀から20世紀にかけて、アイルランドやユダヤのギャング、イタリアのマフィアと比較して、ドイツやスカンジナビアからの移民の犯罪性が低かったのはなぜでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我从来没有听说过美国有 \"德国黑帮\"，也没有听说过斯堪的纳维亚的犯罪头目。\n散居各地的人。我见过个别德国人和斯堪的纳维亚人在历史上参与犯罪。\n历史上，我见过个别德国人和斯堪的纳维亚人参与犯罪，但没有有组织的暴徒式团体。是什么让他们的\n移民故事的不同之处？",
      "title": "与19/20世纪爱尔兰和犹太社区的帮派以及意大利社区的黑手党相比，为什么德国和斯堪的纳维亚移民中缺乏犯罪行为？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我從來沒有聽說過美國有 \"德國黑幫\"，也沒有聽說過斯堪的納維亞的犯罪頭目。\n散居各地的人。我見過個別德國人和斯堪的納維亞人在歷史上參與犯罪。\n歷史上，我見過個別德國人和斯堪的納維亞人蔘與犯罪，但沒有有組織的暴徒式團體。是什麼讓他們的\n移民故事的不同之處？",
      "title": "與19/20世紀愛爾蘭和猶太社區的幫派以及意大利社區的黑手黨相比，爲什麼德國和斯堪的納維亞移民中缺乏犯罪行爲？"
    }
  ]
}