{
  "author": "tonybarnaby",
  "original_created_utc": 1631812071,
  "title": "Your weekly dose of CKB Nervos Network knowledge. Why is this coin being talked about so much now?",
  "created_utc": 1631840784,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is an original post from symbolic_human. He lacks the karma to post here</p>\n\n<p>I see many ckb shills lately, why is it a good coin?</p>\n\n<p>I responded to the above question on Daily Discussion at <a href=\"/r/CryptoCurrency\">r/CryptoCurrency</a>. Someone there suggested that the response was worth it&#39;s own post, so here it is: </p>\n\n<p>....</p>\n\n<p>The reason you are hearing so much about CKB (being the native token of NervOS) is that they have proposed and are building a very unique blockchain which, if successfully built, may likely form part of the critical infrastructure of all blockchains (the interchain), the metaverse and web 3.0. It will do this by providing a place to store valuable data.</p>\n\n<p>At the outset it’s important to mention that Nervos is not a “blockchain killer”. They seek to facilitate chains by providing them with a Common Knowledge Base, by sheltering chains from consensus failures, by ensuring that they fully secured and decentralized. Nervos provides a full stack solution to long term security, sustainability, interoperability, decentralization, and multi asset value capture. And it provides this with a very unique L1.</p>\n\n<p>In short, it is an L1 built for any L2. The L1 is described as a universal hub or a Rosetta Stone. The L1 also acts as an “anchor”. An anchor which provides security, sustainability, interoperability, decentralization, and multi asset value capture.</p>\n\n<p>Nervos say a blockchain can’t do everything at once, you need to separate into layers. This seems to be fairly acknowledged by the entire blockchain community and the focus for some years has been on L2. L2 solutions have been partly successful in scalability and interoperability but they have come at the expense of security and decentralization. Furthermore, insofar as L2 has given birth to interoperability, it has done so only for the eco-systems that have adopted that standard.</p>\n\n<p>So in short, there has been a lot of focus on L2 but not a lot on L1 and this is where Nervos comes in.</p>\n\n<p>Nervos say the focus of L1 is decentralisation and security. These things cannot be compromised. And then like Lego blocks you build any L2 on top of this L1 or direct any L2 to the “anchor”.</p>\n\n<p>This is a very unique architecture and it requires the L1 to be built in a way that accepts every type of L2 protocol. Hence the reference to “universal hub”.</p>\n\n<p>The L1 on Nervos is like a world computer where you can store value and data. And then it can be assessable by anyone. Not just participants within the Nervos eco-system, but everyone. End-users can continue to use whatever blockchain they want to use, and keeping their assets on the applications that they prefer, but anchoring its sovereignty and security into Nervos value store.</p>\n\n<p>So to take a step back. Nervos is a store of value, L1 chain which is designed to interact with every L2 solution. It also acts as an anchor for chain or dapp to have maximum security, sustainability, interoperability and decentralization.</p>\n\n<p>In order to understand the potential value of such a network one needs to consider what is actually meant by “store of value”. This was a concept introduced by BTC but Nervos have abstracted the model.</p>\n\n<p>The first and obvious store of value is monetary store of value. But now consider the value of all stock certificates, the value of all real estate, the value of all digital currencies and any other financial instruments. Now consider the value of all intellectual property and the value of all digital assets. Consider the value of virtual realities and the metaverse. Now consider that the future will be tokenized. What yesterday seemed like science fiction is now almost a forgone conclusion.</p>\n\n<p>What Nervos is building, is equipped to store all that value and it need only capture a small part of it to succeed.</p>\n</div><!-- SC_ON -->",
  "score": 164,
  "permalink": "/r/CryptoCurrency/comments/pphh4q/your_weekly_dose_of_ckb_nervos_network_knowledge/",
  "subreddit": "CryptoCurrency",
  "id": "pphh4q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is an original post from symbolic_human. He lacks the karma to post here\n\nI see many ckb shills lately, why is it a good coin?\n\nI responded to the above question on Daily Discussion at r/CryptoCurrency\n[/r/CryptoCurrency]. Someone there suggested that the response was worth it's\nown post, so…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これはsymbolic_humanのオリジナル投稿です。彼はここに投稿するためのカルマを欠いています\n\n最近、ckbのshillsをよく見かけるのですが、なぜ良いコインなのでしょうか？\n\n上記の質問には、r/CryptoCurrencyのDaily Discussionで回答しました。\n[/r/CryptoCurrency]に投稿しました。そこにいた誰かが、この回答は自分の記事にする価値があると提案してくれました。\n示唆してくれましたので...。",
      "title": "CKB Nervos Networkの知識を毎週お届けします。なぜ今、このコインが話題になっているのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是一个来自symbolic_human的原创帖子。他缺乏在这里发帖的因果关系\n\n我最近看到很多ckb的骗子，为什么它是一个好币？\n\n我在r/CryptoCurrency的每日讨论中回答了上述问题\n[/r/CryptoCurrency]。那里有人建议，这个回答值得\n自己的帖子，所以...",
      "title": "您的每周CKB Nervos网络知识剂量。为什么这枚硬币现在被谈论得如此之多？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是一個來自symbolic_human的原創帖子。他缺乏在這裏發帖的因果關係\n\n我最近看到很多ckb的騙子，爲什麼它是一個好幣？\n\n我在r/CryptoCurrency的每日討論中回答了上述問題\n[/r/CryptoCurrency]。那裏有人建議，這個回答值得\n自己的帖子，所以...",
      "title": "您的每週CKB Nervos網絡知識劑量。爲什麼這枚硬幣現在被談論得如此之多？"
    }
  ]
}