{
  "author": "frozenlemonpies",
  "original_created_utc": 1659974437,
  "title": "Are HeLa calls any different from other cancer cells?",
  "created_utc": 1659995140,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I remember from a university class I took about a year ago that most cancer cells have the enzyme telomerase activated which allows cancer cells to be immortal and divide forever. Right now I’m reading the immortal life of Henrietta lacks and in the book, it talks about how many samples of cervical cancer were taken from different women and tested but only Henrietta’s cells continued to grow and divide. Why was it that only Henriettas cells continued to divide even though most cells have the enzyme telomeres activated?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 107,
  "permalink": "/r/askscience/comments/wjcijr/are_hela_calls_any_different_from_other_cancer/",
  "subreddit": "askscience",
  "id": "wjcijr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I remember from a university class I took about a year ago that most cancer\ncells have the enzyme telomerase activated which allows cancer cells to be\nimmortal and divide forever. Right now I’m reading the immortal life of\nHenrietta lacks and in the book, it talks about how many samples of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1年ほど前に受けた大学の授業で思い出したのですが、ほとんどのがんは\nテロメラーゼという酵素が活性化され、がん細胞は不死身になり、永遠に分裂することができる。\n不死身で、永遠に分裂し続けることができるのです。今、私が読んでいるのは「不老不死\nヘンリエッタ・ラックスの不滅の人生を読んでいるのですが、その本の中で、どれだけのサンプルの...",
      "title": "HeLaコールと他のがん細胞は違うのですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我记得我在一年前上的一堂大学课上说，大多数癌症\n细胞都有激活的端粒酶，这使得癌细胞可以不死不灭，永远分裂。\n不死之身，永远分裂。现在我正在读《亨丽埃塔的不朽生命》。\n亨丽埃塔的不朽生命，在书中，它谈到了有多少个样本的...",
      "title": "HeLa叫与其他癌细胞有什么不同吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我記得我在一年前上的一堂大學課上說，大多數癌症\n細胞都有激活的端粒酶，這使得癌細胞可以不死不滅，永遠分裂。\n不死之身，永遠分裂。現在我正在讀《亨麗埃塔的不朽生命》。\n亨麗埃塔的不朽生命，在書中，它談到了有多少個樣本的...",
      "title": "HeLa叫與其他癌細胞有什麼不同嗎？"
    }
  ]
}