{
  "author": "kelri1875",
  "the_new_excerpt": "As the title suggested, the historical description of the battle of ChangPing\nsays that both Qin and Zhao sent an army in the size of about 500000 men. And\nafter Zhao lost the battle, Qin buried 400000 Zhao soldiers alive.\n\nI find such figures very difficult to believe. For comparison, the army…",
  "original_created_utc": 1622559170,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルの通り、長平の戦いの歴史的な描写は\n秦・趙ともに約50万人の規模の軍を送ったとあります。そして\n趙が敗れた後、秦は趙の兵士40万人を生き埋めにしたという。\n\nこのような数字はとても信じられません。比べてみると、軍隊は...",
      "title": "秦と趙は長平に100万人もの兵を動員し、戦いの犠牲者は交戦した軍の規模の50％を超えていました。紀元前260年の生産レベルと物流が、このような規模の戦いを支えることができるのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "正如标题所暗示的，关于长平之战的历史描述\n说，秦国和赵国都派出了规模约为50万人的军队。而\n赵国战败后，秦国活埋了40万赵国士兵。\n\n我觉得这样的数字很难让人相信。作为比较，军队...",
      "title": "秦国和赵国在长平动员了多达一百万人的兵力，战役结束时，伤亡人数超过参战军队规模的50%。公元前260年的生产水平和后勤保障怎么可能支持如此规模的战斗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "正如標題所暗示的，關於長平之戰的歷史描述\n說，秦國和趙國都派出了規模約爲50萬人的軍隊。而\n趙國戰敗後，秦國活埋了40萬趙國士兵。\n\n我覺得這樣的數字很難讓人相信。作爲比較，軍隊...",
      "title": "秦國和趙國在長平動員了多達一百萬人的兵力，戰役結束時，傷亡人數超過參戰軍隊規模的50%。公元前260年的生產水平和後勤保障怎麼可能支持如此規模的戰鬥？"
    }
  ],
  "title": "Qin and Zhao mobilised up to a million men in ChangPing, and the battle ended with a casualty exceeding 50% of the size of the armies engaged. How is it possible that the production level and logistics in 260BC could support a battle in such scale?",
  "created_utc": 1622607486,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As the title suggested, the historical description of the battle of ChangPing says that both Qin and Zhao sent an army in the size of about 500000 men. And after Zhao lost the battle, Qin buried 400000 Zhao soldiers alive. </p>\n\n<p>I find such figures very difficult to believe. For comparison, the army of Alexander the Great was estimated to consist of ~50000 soldiers. I&#39;ve read some sources that suggest the population of Qin and Zhao were about a few millions, how is it possible that they could support an army of this size with this population? How could they produce enough food and equipments to keep it supplied? Even if they had surrendered, how could Qin restraint and bury 400000 men alive? That would take a lot of time and work and surely once they had realised what Qin has planned for them they would resist and fight back?</p>\n\n<p>After a brief search on the internet it seems to me that such figures were not heavily challenged. There&#39;re two similar questions asked on this sub but one of the answers was deleted, and the other one doesn&#39;t include a lot of credible sources (the author only included a link to baidu which imho is not a credible source).</p>\n\n<p>Many battles in the Warring States and Han period seem to have involved armies in sizes that are hard to believe. My question is, how historically accurate is the description of the battle of ChangPing? Is it exaggerated, if so what is the modern estimations? What is the academic consensus on this?</p>\n</div><!-- SC_ON -->",
  "score": 113,
  "permalink": "/r/AskHistorians/comments/npvtx2/qin_and_zhao_mobilised_up_to_a_million_men_in/",
  "subreddit": "AskHistorians",
  "id": "npvtx2",
  "is_self": true,
  "media": null,
  "is_video": false
}