{
  "author": "0toHeroInvesting",
  "the_new_excerpt": "Nikola saw another stock crash yesterday, while Alibaba’s stock plunges\nafter-hours with increased pressure from the regulators. Some news about DKNG,\nPENN and other stock market news for today.\n\n~Very Long Post~\n\nHello everyone and Good Morning! First of all, I wanted to wish to everyone\nhappiness,…",
  "original_created_utc": 1608814732,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "尼古拉昨天再次出现股灾，而阿里巴巴的股价暴跌\n在监管机构压力加大的情况下，下班后。关于DKNG的一些消息，\n今天的宾夕法尼亚和其他股市消息。\n\n~很长的帖子~\n\n大家好，早上好！首先，我想祝大家\n快乐，…",
      "title": "尼古拉股灾|阿里巴巴股灾|DKNG&Penn|今日股市新闻[12-24]"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "尼古拉昨天再次出現股災，而阿里巴巴的股價暴跌\n在監管機構壓力加大的情況下，下班後。關於DKNG的一些消息，\n今天的賓夕法尼亞和其他股市消息。\n\n~很長的帖子~\n\n大家好，早上好！首先，我想祝大家\n快樂，…",
      "title": "尼古拉股災|阿里巴巴股災|DKNG&Penn|今日股市新聞[12-24]"
    }
  ],
  "title": "Nikola Stock Crash | Alibaba Stock Plunges | DKNG & PENN | Stock Market News for Today [12-24]",
  "created_utc": 1608824435,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Nikola saw another stock crash yesterday, while Alibaba’s stock plunges after-hours with increased pressure from the regulators. Some news about  DKNG, PENN and other stock market news for today.</strong></p>\n\n<p><strong>~Very Long Post~</strong></p>\n\n<p>Hello everyone and Good Morning! First of all, I wanted to wish to everyone happiness, peace and prosperity this upcoming Christmas, hope you are all doing well, Merry Christmas everyone.</p>\n\n<p>And let’s start with the recap of yesterday as we saw the <a href=\"https://ibb.co/syhtLB9\">Dow Jones</a> leading the way, finishing up .38%, with the broad market <a href=\"https://ibb.co/p4bcpsq\">SP500</a> also barely finishing in the green for the day up .07% and the <a href=\"https://ibb.co/XtPLRkZ\">Nasdaq Composite</a> finishing in the red .29%.</p>\n\n<p>We also saw the <a href=\"https://ibb.co/1MHj5jB\">VIX</a> dropping again today by 3.8% despite being even lower but seeing a pop in the last hours of trading with a spike of more than 4% with more uncertainty being created in the Congress after Trump <a href=\"https://ibb.co/7RpRq4W\">vetoed</a> the defense bill, as he continued to distract the attention from the big number of <a href=\"https://ibb.co/pn5ZGcn\">pardons</a> he keeps giving out, with the latest round bringing the total to almost 50 in the past week.</p>\n\n<p>More than 60% of the companies were gaining <a href=\"https://ibb.co/wB1W5gZ\">yesterday</a> with over 200 new highs, but the volume was relatively low in this shortened trading week, as 8 of the 11 SP <a href=\"https://ibb.co/tDMkjKc\">sectors</a> were gaining yesterday with Energy and Financials gaining more than 1.6% with Financials gaining a boost as the <a href=\"https://ibb.co/XFcwxzV\">Treasury</a> yields pushed up and the curve continues to steepen, while the laggards were Real Estate, Technology and Utilities as value plays especially small and mid-caps outperformed <a href=\"https://ibb.co/J3LB8fZ\">yesterday</a>, with the large-cap growth companies finishing the day down by more than half a percent.</p>\n\n<p>You can see this exact thing in this <a href=\"https://ibb.co/QJ78SkH\">HEAT MAP</a> as the 3 biggest companies in the world, Apple, Amazon &amp; Microsoft, finished the day down more than 0.6%. You can also see that most of the gains were concentrated in the banks and oil &amp; gas industry while the rest of the market was pretty much mixed with companies like Tesla, Google, Facebook having small gains, while others like Zoom, Netflix, Airbnb and many more suffered.</p>\n\n<p>Yesterday we also got the AAII <a href=\"https://ibb.co/phzNq0d\">SURVEY</a> that shows how investors were feeling last week. This time we don’t get any good news as this is a contrarian indicator, as people started to move from a bearish sentiment to a more neutral sentiment with more than 4% of investors moving from a bearish view to a neutral view, with only a .1% increase in bullish investors last week, as the stimulus bill seemed to be finally agreed on before Trump making new headlines this week again with the Veto of the NDAA.</p>\n\n<p>Meanwhile we also got tons of economic data yesterday starting with initial and continuing <a href=\"https://ibb.co/bg8K6Dt\">jobless</a> claims as initial claims came in way <a href=\"https://ibb.co/n81QxT6\">lower</a> than expected just over 800K, down almost 90K from the previous week and falling to a 3-week low, with the continuing jobless claims also dropping to 5.3M, lower than last week and what was expected from the analysts.</p>\n\n<p>We also saw the durable goods <a href=\"https://ibb.co/DYN5hkb\">number</a> coming in better than expected with a .9% increase, up for the 7th straight month, while house <a href=\"https://ibb.co/DKms26p\">PRICES</a> rose nationwide by 1.5% in October from the previous month, which continued to push house prices higher by more than 10% since last year, with home <a href=\"https://ibb.co/xhLcYy5\">SALES</a> falling in November but are still up over 20% year over year as the median sales price of new houses continued to trend up.</p>\n\n<p>Alongside this we saw the final consumer sentiment read slipping in <a href=\"https://ibb.co/GV1yS3f\">December</a> to 80.7, lower than expected but higher than the 76.9 in November, with the November Personal <a href=\"https://ibb.co/0QCHRdN\">INCOME</a> coming worse than expected, losing 1.1% from the previous month.</p>\n\n<p>In contrast, <a href=\"https://ibb.co/74kjcZD\">today</a> we don’t really get any critical economic data and the stock market closes early.</p>\n\n<p>So, we saw Nikola take another stumble <a href=\"https://ibb.co/319S2TR\">yesterday</a>, after the whole Apple &amp; Tesla <a href=\"https://ibb.co/n897DvD\">disruption</a> as we saw the stocks drop more than 10% again yesterday and is down more than 26% since I made my prediction and just hit my first price target, here is the link to that <a href=\"https://www.reddit.com/r/stocks/comments/k4l6x3/tesla_news_nio_sales_nikola_stock_crash_stock/\">post</a>.</p>\n\n<p>Nikola shares skid <a href=\"https://ibb.co/zhjQhMq\">yesterday</a> again after another deal for the company fell, as that meant the termination of the deal with Republic Services to develop an electric garbage truck for them. The deal was expected to have Nikola produce over 2500 trucks for the company. So, I would trim my sell position on Nikola here, while leaving some for my next target, with that target being a drop in the single digits in the future for the company.</p>\n\n<p>In some other stock market <a href=\"https://ibb.co/V3JdsFX\">news</a>, we saw Alibaba shares plummeting again more than 8% on the Hong Kong exchange and more than 7% in pre-market in the US by <a href=\"https://ibb.co/7VXxMCC\">now</a>, after more pressure has been put on the company as the Chinese authorities are continuing to pursue anti-monopolistic investigations on the company while also continuing the investigation on Ant Group which is an affiliate of Alibaba as they hold more than 1/3 of the company. I think these investigations are very likely to come out with fines and structural changes on how the company will work with its subsidiaries and affiliates, and that the high flying, record-breaking, Ant Group IPO will likely be postponed for a longer period until they meet regulators requirements as it is expected that Ant Group will be given some guidelines to follow by the <a href=\"https://ibb.co/kBm5431\">regulators</a>. My personal belief is that Alibaba is a great company and it should trade higher than this, but until this whole mess with the authorities clears, anything can happen as you can see in this <a href=\"https://ibb.co/ssR3Ld6\">CHART</a>, as the stock has underperformed since Ant Group canceled the IPO, with my long-term price target for Alibaba being 300$, but I wouldn’t go to heavy on this trade right now.</p>\n\n<p>Enough of Alibaba, meanwhile we also saw XL Fleet jumping huge <a href=\"https://ibb.co/MP9XBv2\">yesterday</a> after the usual short-seller Citron, indicated that there is still more upside for this company.</p>\n\n<p>And one final piece of <a href=\"https://ibb.co/6Zp3qMw\">news</a> is that Colorado set another record for wagers in November, this is another confirmation of the gambling tailwinds that will skyrocket companies like DraftKings &amp; PENN Gaming higher in the next years.</p>\n\n<p>Let’s hope for a good day in the market as the <a href=\"https://ibb.co/QvL0MV4\">FUTURES</a> seem to be pointing at a good open, with the Nasdaq Composite leading the way, while the European Union and UK are finally nearing a deal for <a href=\"https://ibb.co/M9pkZxY\">Brexit</a>, and remember there are only 5 trading sessions left in 2020 with today also being a short-day of trading.</p>\n\n<p>Also, don’t forget this is usually when one of the best 7-day period for gains happens, with an <a href=\"https://ibb.co/QbcDDrh\">average</a> return of 1.33% and a 77% chance of that happening since 1950. But be careful, not every year is a winner, you can see <a href=\"https://ibb.co/16STGsc\">here</a> some examples, with 1999 being a very bad year as the dot com bubble approached, with another bad year coinciding with the start of the financial crisis. Hopefully this will be the 5th straight year with a positive return in this period.</p>\n\n<p>Thank you everyone for reading! Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market!</p>\n\n<p>Have a great day and see you next time!</p>\n</div><!-- SC_ON -->",
  "score": 618,
  "permalink": "/r/stocks/comments/kjf1bj/nikola_stock_crash_alibaba_stock_plunges_dkng/",
  "subreddit": "stocks",
  "id": "kjf1bj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609495334780
}