{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "Good Sunday afternoon to all of you here on r/stocks! I hope everyone on this sub made out pretty nicely in the market this past week, and are ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning December 27th, 2021.\n\n# **It looks like Santa Claus is on his way to stock investors in the week ahead - [(Source)](https://www.cnbc.com/2021/12/23/santa-claus-may-be-on-his-way-to-stock-investors-in-the-week-ahead.html)**\n*****\n&gt; After a period of turbulence, the decks may be cleared for a good old-fashioned Santa Claus rally in the week ahead.\n*****\n&gt; Stocks were higher in the past week, after a rough stretch that continued into Monday. The S&amp;P 500 recovered and is up about 3.5% for December as of Thursday.\n*****\n&gt; “I think all the things we’ve been concerned about for the month of December to a certain extent, are in the rearview mirror,” said Art Hogan, chief market strategist at National Securities. “We know what the [Federal Reserve] is going to do. We know while this new variant spreads faster, it’s not as dangerous, and we know Build Back Better legislation is now 2022′s business... I think the market can find a path of least resistance to the upside as we wrap things up.”\n*****\n&gt; The market has a lot of history on its side that trading days before the year-end are positive for stocks. According to the “Stock Trader’s Almanac,” the Santa Claus rally period — the final five trading days of the current year and first two of the new year — is mostly a time when the stock market gains. The S&amp;P 500 has been positive nearly 79% of the time on those days since 1928 and has gained an average of about 1.7% per rally.\n*****\n&gt; Add to that the fact that when the market has had a strong year, the momentum historically has carried into the final trading sessions. In that regard, the S&amp;P 500 is up about 25% for the year.\n*****\n&gt; According to Bank of America, when the S&amp;P 500 has already seen such solid gains, the final six sessions are positive. Since 1980, there have been 10 instances where the S&amp;P 500 was up 20% or more going into the last stretch of trading and in nine of those years, it ended the final six days higher.\n*****\n&gt; # A notably rocky December\n&gt; Stocks head into the final sessions of the year with a tailwind, after several weeks of choppiness.\n*****\n&gt; “This has been the fourth rockiest December since 1987. The average daily move for the S&amp;P 500 has been 1.1%,” said Hogan. “That’s a lot of action.” The most volatile Decembers were in 2000, 2008 and 2018.\n*****\n&gt; Hogan said volume in the last week of the year is typically 20% to 30% lower than normal. “In a low-volume environment, when the market picks a direction, it tends to move in that direction in a robust fashion,” he said.\n*****\n&gt; Paul Hickey, co-founder of Bespoke Investment Group, said positive news on the Covid omicron variant this week was the catalyst that reversed the market’s sell-off. There were studies showing omicron to be milder than other variants of the coronavirus. Further, the Food and Drug Administration approved pills from Pfizer and Merck for the treatment of Covid-19.\n*****\n&gt; “Whereas the market was focusing on everything that could go wrong since Thanksgiving, people are now just taking a sunnier view,” Hickey said. He expects that view will likely prevail in the coming week.\n*****\n&gt; “As we get toward the beginning of January, we’ll see how markets are positioning themselves,” Hickey said. He said investors will start to turn their attention toward the upcoming earnings season; they do not seem to be overly optimistic, which could spell some upside surprises.\n*****\n&gt; “Going into the last earnings season, there was a ton of negative sentiment based on supply chains, inflation and labor shortages. We ended up having a decent earnings season. It’s more mixed this time,” Hickey said.\n*****\n&gt; # High-growth stocks hit\n&gt; The selling in November and December dented stocks. Some high-growth stocks and ETFs were down sharply as investors moved into safety plays. Funds that took their lumps in December include the Ark Innovation ETF and iShares Expanded Tech Software Sector ETF.\n*****\n&gt; “I think some of these growth areas that have gotten hit hard will do a little better. They could see a bounce early in the year,” Hickey said. “They sold off for a number of reasons. One was concerns over the Fed. Also people had made so much money, and the feeling was taxes are going up. People were selling stocks ahead of higher taxes. That’s more of a question now with a divided Congress.”\n*****\n&gt; In the past week, the fate of President Joe Biden’s Build Back Better stimulus legislation was put in doubt when West Virginia Sen. Joe Manchin said he would not support it. Analysts expect to see further versions of the spending plan.\n*****\n&gt; Bespoke’s Hickey said January could be positive for stocks, and with opportunities for some stocks to bounce if stung by tax-loss selling. “The January effect is a positive. All those tax-loss sellers that compressed multiples are buyers,” he said.\n*****\n&gt; One of the stocks he’s watching is Boeing. “It’s one of the few big cap stocks that was down a lot. I think you can see that,” he said. The airplane maker has gained more than 6% in the past week, but it’s still down 16% over the past six months.\n*****\n&gt; # Rate hikes and housing data\nWith the Fed forecasting three interest rate hikes for next year, economic data of all sorts is front and center for the markets.\n*****\n&gt; The housing market has been a huge beneficiary of the near-zero rate policy, so all data on housing will be closely watched. On Tuesday, home prices data will be released. Pending home sales are to be reported Wednesday.\n*****\n&gt; David Petrosinelli, senior trader at InspereX, said the next big data point for the market will be December jobs in early January. He expects markets to be relatively quiet next week.\n*****\n&gt; “Next week is generally a snoozer, the week before New Year’s,” he said. “All the action’s going to come in the first week in January.”\n\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/xfNHTOI.png))**\n\n# **S&amp;P Sectors for this past week:**\n###### **([CLICK HERE FOR THE S&amp;P SECTORS FOR THE PAST WEEK!](https://i.imgur.com/4lr1dqG.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/l68AVkA.png))**\n\n# **Major Futures Markets as of Thursday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF THURSDAY!](https://i.imgur.com/jNTVqcM.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/8MxbgrN.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/BJhOzd7.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/srdM8I7.png))**\n\n# **Major Indices Pullback/Correction Levels as of Thursday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/MvIyhGR.png))**\n\n# **Major Indices Rally Levels as of Thursday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/YIALqvZ.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/EdymJh0.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/gfxbtYi.png))**\n\n# **Thursday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/vtbZJDC.png))**\n\n*****\n\n&gt; # Do You Believe In The Santa Claus Rally?\n\n&gt; “If Santa should fail to call, bears may come to Broad and Wall.” —Yale Hirsh\n\n&gt; December is widely known as one of the best months of the year for stocks, but most don’t realize that the majority of the gains happen in the second half of the month.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/12/chart-12.22.21.jpg?ssl=1))**\n\n&gt; Equity strength at this time of the year is widely known as the Santa Claus Rally, but the term is somewhat misunderstood. Discovered in 1972 by Yale Hirsch, creator of the Stock Trader’s Almanac (carried on now by his son Jeff Hirsch), the real Santa Claus Rally is the final five trading days of the year and first two trading days of the following year, not just December. In other words, the official Santa Claus Rally is set to begin Monday, December 27. Fun trivia this is the latest any Santa Claus Rally can start and latest it has started in 11 years.\n\n&gt; So how likely are these seven trading days to be higher? Well, there isn’t a single seven-day combo out of the full year that is more likely to be higher than the 78.9% of the time higher we’ve seen previously during the Santa Claus Rally. Additionally, these seven days are up an average of 1.33%, which is the third-best seven-day combo of the year. Do you believe yet?\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/12/Blog-12.22.21-2.png?ssl=1))**\n\n&gt; Taking a bigger picture view, here is the win rate of any single day. We are in the middle of an incredible 11 day streak with each day having a greater than 50% chance of being higher.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/12/Blog-12.22.21-3.jpg?ssl=1))**\n\n&gt; “Why are these seven days so strong?” asked LPL Financial Chief Market Strategist Ryan Detrick. “Whether optimism over a coming new year, holiday spending, traders on vacation, institutions squaring up their books—or the holiday spirit—the bottom line is that bulls tend to believe in Santa.”\n\n&gt; The LPL Chart of the Day illustrates how the Santa Claus Rally has performed since 2000. Usually these seven days are higher, which leads to strength in January and beyond. But what stands out to us is that the times Santa didn’t come, January was lower each time. Now do you believe?\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/12/chart-12.22.21-4.png?ssl=1))**\n\n&gt; Let’s take a closer look at what happens when things don’t go according to plan. Remember, Yale Hirsch told us, “If Santa should fail to call, bears may come to Broad and Wall.” This is because the New York Stock Exchange is at the corner of Broad and Wall Streets.\n\n&gt; Going back to the mid-1990s, there have been only six times Santa failed to show in December. January was lower five of those six times, and the full year had a solid gain only once (in 2016, but a mini-bear market early in the year). “Considering the bear markets of 2000 and 2008 both took place after one of the rare instances that Santa failed to show makes believers out of us. Should this seasonally strong period miss the mark, it could be a warning sign,” explained Santa Claus believer Detrick.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/12/Blog-12.22.21-5.png?ssl=1))**\n\n&gt; We wish everyone a great end to 2021 and happy holidays!\n\n*****\n\n&gt; # NASDAQ &amp; Russell 2000 Most Bullish Day After Christmas\n\n&gt; This year the day after Christmas is also the beginning of the Santa Claus Rally. The Santa Claus Rally was discovered and named by Yale Hirsch in 1972 and published in our 1973 Stock Trader’s Almanac as the last five trading days of the year and the first two trading days of the New Year. This short, sweet rally is usually good for about 1.3% on the S&amp;P 500, but the real significance of the SCR is as an indicator.\n\n&gt; It is our first seasonal indicator of the year ahead. Years when there was no Santa Claus Rally tended to precede bear markets or times when stocks hit significantly lower prices later in the year. As Yale’s famous line states (2021 Almanac page 116 and 2022 Almanac page 118): “If Santa Claus Should Fail To Call, Bears May Come to Broad and Wall.”\n\n&gt; Since 1988, NASDAQ and Russell 2000 have enjoyed the greatest frequency of gains and average gain on the day after Christmas. NASDAQ has advanced 72.7% of the time with an average move of +0.39%. Small-caps have also advanced 72.7% of the time with an average advance of +0.39%. DJIA and S&amp;P 500 have slightly softer records, but bullish nonetheless. Two days after Christmas, the market remains bullish however, the frequency and magnitude of gains does ease with NASDAQ bringing up the rear.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/8392acb61c17f5b49af8d8e71d12a121/916f356a13a0415c-14/s1280x1920/b57a534048db23aa6f6a743ec7586ce8de6fb2ec.jpg))**\n\n*****\n\n&gt; # S&amp;P 500 Performance Around Christmas\n\n&gt; With Christmas just two days away and markets closed tomorrow, many investors are on the watch for a 'Santa Claus' rally. In all periods in the post-WWII era, the average S&amp;P 500 performance in the week leading up to Christmas is a gain of 0.5% with positive returns just over two-thirds of the time. The average performance in the week after Christmas is slightly higher at 0.7%, but the consistency of positive returns is the same. This year, the S&amp;P 500 has performed considerably better than its pre-Christmas average gaining 2.25% through midday Thursday. Since 1945, the S&amp;P 500 has traded up more than 1% in the week leading up to Christmas 23 times (30.3%), and in those prior 23 years, the average week after Christmas performance was actually a bit weaker than normal with an average gain of 0.3% and positive returns just over 60% of the time. That compares to an average gain of 0.7% in the same week for all years since 1945.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/12/Avg-perf-based-on-week-before-xmas-122021-3.png))**\n\n&gt; The table below lists each year since 1945 that the S&amp;P 500 was up over 1% in the week leading up to Christmas along with how it performed in the final week of the year. Of those 23 prior years, there were actually 14 where the S&amp;P 500 rallied 2% or more in the week leading up to Christmas with the last occurrence seven years ago back in 2014. While those types of gains may have put investors in a good mood for the Christmas holiday, it didn't leave much powder left for the last week of the year as the median gain was just 0.05% with positive returns half of the time.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/12/SPX-after-1-pct-gain-before-xmas-122321-2.png))**\n\n*****\n\n&gt; # Best and Worst Performers Since Thanksgiving\n\n&gt; Although the Russell 1000 is now pretty much right back in line with its pre-Thanksgiving level, certain stocks have seen dramatic moves during that same span. Of the 25 stocks that have experienced the largest gains since 11/25, 19 were down on the year leading up to Thanksgiving, and the average stock had declined by 20.0%. Since then, those 25 stocks have gained an average of 13.1%, with Smartsheet (SMAR) and Chegg (CHGG) leading the group with gains of 22.2% and 20.4%, respectively.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/12/Best-perf-since-122221-2.png))**\n\n&gt; Of the Russell 1000 members that have performed the worst since Thanksgiving, their average YTD performance leading up to Thanksgiving was a gain of 85.7% while the median performance was much less but still an impressive +25.6%. Of these 25 stocks, 18 were positive YTD through Thanksgiving, and the average decline since then is 23.6%. Everbridge (EVBG) and DocuSign (DOCU) topped this list with declines of 37.2% and 36.6% since Thanksgiving, respectively.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/12/Worst-perf-since-122221.png))**\n\n&gt; Based on the data above, it appears as if there was some rotation in the Russell 1000 as investors shifted from leaders to laggards. Essentially, the worse a stock performed between the start of the year and Thanksgiving, the better it has performed since, at least for the top 25 movers to the upside. For the 25 stocks that have declined the most since Thanksgiving, there seems to be very little correlation between the size of the move to the upside before Thanksgiving and performance since then. In the charts below, GameStop (GME) Upstart (UPST) were omitted from the chart but included in the R squared calculation due to visual distortion.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/12/r-squared-charts-12221-4.png))**\n\n*****\n\n&gt; # December Volatility Spike\n\n&gt; December typically tends to be a month of lower stock market volatility following a period in late October and early November when volatility tends to peak. This year, however, has been quite different. As of yesterday's close, the one-month rolling average of one-day absolute moves for the S&amp;P 500 was 1.06%. (This means the S&amp;P 500 has been averaging a daily change of +/-1%+ over the last month.) As shown in the dark blue line below, this has actually been the most volatile one-month period for all of 2021. As the light blue line shows, daily volatility for the S&amp;P 500 is usually plummeting at this time of year as traders typically slow down dramatically around the holidays.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/12/rolling-vol-122121.png))**\n\n&gt; Since the 5-day trading week was established back in September 1952, December has historically been the least volatile month of the year, averaging an absolute daily change of 0.61%. This year, the average daily change since the start of December has been 1.07%, which is far above the next closest level seen in March 2021 (+/-0.83%). October, the month that has historically been the most volatile month of the year, ranked 6th in 2021.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/12/Avg-daily-chg-by-month-122121.png))**\n\n&gt; So what tends to occur when volatility inverses its seasonal trend in December? Since 1953, there have been five prior years where December was the most volatile month of the year: 1973, 1978, 1985, 1995, and 2018. Below we show how the S&amp;P 500 performed in January following the five prior years listed, and we also show the full next-year change. As shown, January was positive in four of five instances, and the one January that saw a decline was in 1974 when it fell only 1%. In the most recent occurrence, the 9.2% decline in December of 2018 was followed by a 7.9% move higher in January of 2019. In the following year, the median performance of the S&amp;P 500 was +14.6%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/12/Table-when-dec-most-2-122121.png))**\n\n*****\n\n&gt; # Bears Still Outnumber Bulls Despite Rally\n\n&gt; The S&amp;P 500 is currently at record highs, but recent sentiment readings are still relatively bearish. However, this isn't necessarily negative for markets, as it gives the opportunity for bears to shift their position, which would likely be accompanied by an increase in equity purchases. AAII's reading on bullish sentiment moved from 25.2% last week to 29.6% this week. This week's reading is still 6.7 percentage points below the average since 2009.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/12/AAII-bullish-122321.png))**\n\n&gt; In turn, bearish sentiment dropped from 39.3% down to 33.9%, which is only 1.8 percentage points higher than the historical average level. This week's reading was also the second-largest week-over-week decline in bearish sentiment since September 9th.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/12/AAII-bearish-122321.png))**\n\n&gt; Neutral sentiment ticked higher by 1.2 percentage points, resulting in 36.6% of respondents reporting a neutral view of the market. This is the lowest absolute change in a month and is 5.0 percentage points higher than the average level.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/12/AAII-neutral-122321.png))**\n\n&gt; The NAAIM Exposure Index moved higher this week alongside bullish sentiment. The index ranges from +200 (levered long) to -200 (levered short) and this week the index moved from 52.2 to 67.0, essentially erasing last week's significant drop. That indicates reporting investment managers' exposure to US equities is roughly 67%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/12/NAAIM-exposure-index-122321-2.png))**\n\n*****\n\nHere are the most notable companies reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * (**N/A.**)\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/EdymJh0.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/TkkU0IY.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 12.27.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n&gt; # ***Monday 12.27.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # ***Tuesday  12.28.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n&gt; # ***Tuesday 12.28.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/CHRsiO8.png))\n\n*****\n\n&gt; # ***Wednesday 12.29.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/5lZfaZS.png))\n\n&gt; # ***Wednesday 12.29.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # ***Thursday 12.30.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n&gt; # ***Thursday 12.30.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # ***Friday 12.31.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK!]())\n(NONE.)\n\n*****\n\n&gt; # ***Friday 12.31.21 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # (T.B.A. THIS WEEKEND.)\n&gt; **(T.B.A. THIS WEEKEND.)** (T.B.A. THIS WEEKEND.).\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=SPY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great final trading week of 2021 ahead r/stocks. :)",
  "author_fullname": "t2_eaak0",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Wall Street Week Ahead for the trading week beginning December 27th, 2021",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_rp1pzo",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.85,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 42,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 42,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1640540466,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Good Sunday afternoon to all of you here on &lt;a href=\"/r/stocks\"&gt;r/stocks&lt;/a&gt;! I hope everyone on this sub made out pretty nicely in the market this past week, and are ready for the new trading week ahead.&lt;/p&gt;\n\n&lt;p&gt;Here is everything you need to know to get you ready for the trading week beginning December 27th, 2021.&lt;/p&gt;\n\n&lt;h1&gt;&lt;strong&gt;It looks like Santa Claus is on his way to stock investors in the week ahead - &lt;a href=\"https://www.cnbc.com/2021/12/23/santa-claus-may-be-on-his-way-to-stock-investors-in-the-week-ahead.html\"&gt;(Source)&lt;/a&gt;&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;hr/&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;After a period of turbulence, the decks may be cleared for a good old-fashioned Santa Claus rally in the week ahead.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Stocks were higher in the past week, after a rough stretch that continued into Monday. The S&amp;amp;P 500 recovered and is up about 3.5% for December as of Thursday.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;“I think all the things we’ve been concerned about for the month of December to a certain extent, are in the rearview mirror,” said Art Hogan, chief market strategist at National Securities. “We know what the [Federal Reserve] is going to do. We know while this new variant spreads faster, it’s not as dangerous, and we know Build Back Better legislation is now 2022′s business... I think the market can find a path of least resistance to the upside as we wrap things up.”&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;The market has a lot of history on its side that trading days before the year-end are positive for stocks. According to the “Stock Trader’s Almanac,” the Santa Claus rally period — the final five trading days of the current year and first two of the new year — is mostly a time when the stock market gains. The S&amp;amp;P 500 has been positive nearly 79% of the time on those days since 1928 and has gained an average of about 1.7% per rally.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Add to that the fact that when the market has had a strong year, the momentum historically has carried into the final trading sessions. In that regard, the S&amp;amp;P 500 is up about 25% for the year.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;According to Bank of America, when the S&amp;amp;P 500 has already seen such solid gains, the final six sessions are positive. Since 1980, there have been 10 instances where the S&amp;amp;P 500 was up 20% or more going into the last stretch of trading and in nine of those years, it ended the final six days higher.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;h1&gt;A notably rocky December&lt;/h1&gt;\n\n&lt;p&gt;Stocks head into the final sessions of the year with a tailwind, after several weeks of choppiness.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;“This has been the fourth rockiest December since 1987. The average daily move for the S&amp;amp;P 500 has been 1.1%,” said Hogan. “That’s a lot of action.” The most volatile Decembers were in 2000, 2008 and 2018.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Hogan said volume in the last week of the year is typically 20% to 30% lower than normal. “In a low-volume environment, when the market picks a direction, it tends to move in that direction in a robust fashion,” he said.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Paul Hickey, co-founder of Bespoke Investment Group, said positive news on the Covid omicron variant this week was the catalyst that reversed the market’s sell-off. There were studies showing omicron to be milder than other variants of the coronavirus. Further, the Food and Drug Administration approved pills from Pfizer and Merck for the treatment of Covid-19.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;“Whereas the market was focusing on everything that could go wrong since Thanksgiving, people are now just taking a sunnier view,” Hickey said. He expects that view will likely prevail in the coming week.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;“As we get toward the beginning of January, we’ll see how markets are positioning themselves,” Hickey said. He said investors will start to turn their attention toward the upcoming earnings season; they do not seem to be overly optimistic, which could spell some upside surprises.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;“Going into the last earnings season, there was a ton of negative sentiment based on supply chains, inflation and labor shortages. We ended up having a decent earnings season. It’s more mixed this time,” Hickey said.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;h1&gt;High-growth stocks hit&lt;/h1&gt;\n\n&lt;p&gt;The selling in November and December dented stocks. Some high-growth stocks and ETFs were down sharply as investors moved into safety plays. Funds that took their lumps in December include the Ark Innovation ETF and iShares Expanded Tech Software Sector ETF.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;“I think some of these growth areas that have gotten hit hard will do a little better. They could see a bounce early in the year,” Hickey said. “They sold off for a number of reasons. One was concerns over the Fed. Also people had made so much money, and the feeling was taxes are going up. People were selling stocks ahead of higher taxes. That’s more of a question now with a divided Congress.”&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;In the past week, the fate of President Joe Biden’s Build Back Better stimulus legislation was put in doubt when West Virginia Sen. Joe Manchin said he would not support it. Analysts expect to see further versions of the spending plan.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Bespoke’s Hickey said January could be positive for stocks, and with opportunities for some stocks to bounce if stung by tax-loss selling. “The January effect is a positive. All those tax-loss sellers that compressed multiples are buyers,” he said.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;One of the stocks he’s watching is Boeing. “It’s one of the few big cap stocks that was down a lot. I think you can see that,” he said. The airplane maker has gained more than 6% in the past week, but it’s still down 16% over the past six months.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;h1&gt;Rate hikes and housing data&lt;/h1&gt;\n\n&lt;p&gt;With the Fed forecasting three interest rate hikes for next year, economic data of all sorts is front and center for the markets.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;The housing market has been a huge beneficiary of the near-zero rate policy, so all data on housing will be closely watched. On Tuesday, home prices data will be released. Pending home sales are to be reported Wednesday.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;David Petrosinelli, senior trader at InspereX, said the next big data point for the market will be December jobs in early January. He expects markets to be relatively quiet next week.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;“Next week is generally a snoozer, the week before New Year’s,” he said. “All the action’s going to come in the first week in January.”&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;hr/&gt;\n\n&lt;h1&gt;&lt;strong&gt;This past week saw the following moves in the S&amp;amp;P:&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://i.imgur.com/xfNHTOI.png\"&gt;CLICK HERE FOR THE FULL S&amp;amp;P TREE MAP FOR THE PAST WEEK!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;h1&gt;&lt;strong&gt;S&amp;amp;P Sectors for this past week:&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://i.imgur.com/4lr1dqG.png\"&gt;CLICK HERE FOR THE S&amp;amp;P SECTORS FOR THE PAST WEEK!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;h1&gt;&lt;strong&gt;Major Indices for this past week:&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://i.imgur.com/l68AVkA.png\"&gt;CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;h1&gt;&lt;strong&gt;Major Futures Markets as of Thursday&amp;#39;s close:&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://i.imgur.com/jNTVqcM.png\"&gt;CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF THURSDAY!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;h1&gt;&lt;strong&gt;Economic Calendar for the Week Ahead:&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://i.imgur.com/8MxbgrN.png\"&gt;CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;h1&gt;&lt;strong&gt;Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday&amp;#39;s close:&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://i.imgur.com/BJhOzd7.png\"&gt;CLICK HERE FOR THE CHART!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;h1&gt;&lt;strong&gt;S&amp;amp;P Sectors for the Past Week:&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://i.imgur.com/srdM8I7.png\"&gt;CLICK HERE FOR THE CHART!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;h1&gt;&lt;strong&gt;Major Indices Pullback/Correction Levels as of Thursday&amp;#39;s close:&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://i.imgur.com/MvIyhGR.png\"&gt;CLICK HERE FOR THE CHART!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;h1&gt;&lt;strong&gt;Major Indices Rally Levels as of Thursday&amp;#39;s close:&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://i.imgur.com/YIALqvZ.png\"&gt;CLICK HERE FOR THE CHART!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;h1&gt;&lt;strong&gt;Most Anticipated Earnings Releases for this week:&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://i.imgur.com/EdymJh0.png\"&gt;CLICK HERE FOR THE CHART!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;h1&gt;&lt;strong&gt;Here are the upcoming IPO&amp;#39;s for this week:&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://i.imgur.com/gfxbtYi.png\"&gt;CLICK HERE FOR THE CHART!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;h1&gt;&lt;strong&gt;Thursday&amp;#39;s Stock Analyst Upgrades &amp;amp; Downgrades:&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://i.imgur.com/vtbZJDC.png\"&gt;CLICK HERE FOR THE CHART LINK #1!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;hr/&gt;\n\n&lt;blockquote&gt;\n&lt;h1&gt;Do You Believe In The Santa Claus Rally?&lt;/h1&gt;\n\n&lt;p&gt;“If Santa should fail to call, bears may come to Broad and Wall.” —Yale Hirsh&lt;/p&gt;\n\n&lt;p&gt;December is widely known as one of the best months of the year for stocks, but most don’t realize that the majority of the gains happen in the second half of the month.&lt;/p&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/12/chart-12.22.21.jpg?ssl=1\"&gt;CLICK HERE FOR THE CHART!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;p&gt;Equity strength at this time of the year is widely known as the Santa Claus Rally, but the term is somewhat misunderstood. Discovered in 1972 by Yale Hirsch, creator of the Stock Trader’s Almanac (carried on now by his son Jeff Hirsch), the real Santa Claus Rally is the final five trading days of the year and first two trading days of the following year, not just December. In other words, the official Santa Claus Rally is set to begin Monday, December 27. Fun trivia this is the latest any Santa Claus Rally can start and latest it has started in 11 years.&lt;/p&gt;\n\n&lt;p&gt;So how likely are these seven trading days to be higher? Well, there isn’t a single seven-day combo out of the full year that is more likely to be higher than the 78.9% of the time higher we’ve seen previously during the Santa Claus Rally. Additionally, these seven days are up an average of 1.33%, which is the third-best seven-day combo of the year. Do you believe yet?&lt;/p&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/12/Blog-12.22.21-2.png?ssl=1\"&gt;CLICK HERE FOR THE CHART!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;p&gt;Taking a bigger picture view, here is the win rate of any single day. We are in the middle of an incredible 11 day streak with each day having a greater than 50% chance of being higher.&lt;/p&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/12/Blog-12.22.21-3.jpg?ssl=1\"&gt;CLICK HERE FOR THE CHART!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;p&gt;“Why are these seven days so strong?” asked LPL Financial Chief Market Strategist Ryan Detrick. “Whether optimism over a coming new year, holiday spending, traders on vacation, institutions squaring up their books—or the holiday spirit—the bottom line is that bulls tend to believe in Santa.”&lt;/p&gt;\n\n&lt;p&gt;The LPL Chart of the Day illustrates how the Santa Claus Rally has performed since 2000. Usually these seven days are higher, which leads to strength in January and beyond. But what stands out to us is that the times Santa didn’t come, January was lower each time. Now do you believe?&lt;/p&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/12/chart-12.22.21-4.png?ssl=1\"&gt;CLICK HERE FOR THE CHART!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;p&gt;Let’s take a closer look at what happens when things don’t go according to plan. Remember, Yale Hirsch told us, “If Santa should fail to call, bears may come to Broad and Wall.” This is because the New York Stock Exchange is at the corner of Broad and Wall Streets.&lt;/p&gt;\n\n&lt;p&gt;Going back to the mid-1990s, there have been only six times Santa failed to show in December. January was lower five of those six times, and the full year had a solid gain only once (in 2016, but a mini-bear market early in the year). “Considering the bear markets of 2000 and 2008 both took place after one of the rare instances that Santa failed to show makes believers out of us. Should this seasonally strong period miss the mark, it could be a warning sign,” explained Santa Claus believer Detrick.&lt;/p&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/12/Blog-12.22.21-5.png?ssl=1\"&gt;CLICK HERE FOR THE CHART!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;p&gt;We wish everyone a great end to 2021 and happy holidays!&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;hr/&gt;\n\n&lt;blockquote&gt;\n&lt;h1&gt;NASDAQ &amp;amp; Russell 2000 Most Bullish Day After Christmas&lt;/h1&gt;\n\n&lt;p&gt;This year the day after Christmas is also the beginning of the Santa Claus Rally. The Santa Claus Rally was discovered and named by Yale Hirsch in 1972 and published in our 1973 Stock Trader’s Almanac as the last five trading days of the year and the first two trading days of the New Year. This short, sweet rally is usually good for about 1.3% on the S&amp;amp;P 500, but the real significance of the SCR is as an indicator.&lt;/p&gt;\n\n&lt;p&gt;It is our first seasonal indicator of the year ahead. Years when there was no Santa Claus Rally tended to precede bear markets or times when stocks hit significantly lower prices later in the year. As Yale’s famous line states (2021 Almanac page 116 and 2022 Almanac page 118): “If Santa Claus Should Fail To Call, Bears May Come to Broad and Wall.”&lt;/p&gt;\n\n&lt;p&gt;Since 1988, NASDAQ and Russell 2000 have enjoyed the greatest frequency of gains and average gain on the day after Christmas. NASDAQ has advanced 72.7% of the time with an average move of +0.39%. Small-caps have also advanced 72.7% of the time with an average advance of +0.39%. DJIA and S&amp;amp;P 500 have slightly softer records, but bullish nonetheless. Two days after Christmas, the market remains bullish however, the frequency and magnitude of gains does ease with NASDAQ bringing up the rear.&lt;/p&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://64.media.tumblr.com/8392acb61c17f5b49af8d8e71d12a121/916f356a13a0415c-14/s1280x1920/b57a534048db23aa6f6a743ec7586ce8de6fb2ec.jpg\"&gt;CLICK HERE FOR THE CHART!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n&lt;/blockquote&gt;\n\n&lt;hr/&gt;\n\n&lt;blockquote&gt;\n&lt;h1&gt;S&amp;amp;P 500 Performance Around Christmas&lt;/h1&gt;\n\n&lt;p&gt;With Christmas just two days away and markets closed tomorrow, many investors are on the watch for a &amp;#39;Santa Claus&amp;#39; rally. In all periods in the post-WWII era, the average S&amp;amp;P 500 performance in the week leading up to Christmas is a gain of 0.5% with positive returns just over two-thirds of the time. The average performance in the week after Christmas is slightly higher at 0.7%, but the consistency of positive returns is the same. This year, the S&amp;amp;P 500 has performed considerably better than its pre-Christmas average gaining 2.25% through midday Thursday. Since 1945, the S&amp;amp;P 500 has traded up more than 1% in the week leading up to Christmas 23 times (30.3%), and in those prior 23 years, the average week after Christmas performance was actually a bit weaker than normal with an average gain of 0.3% and positive returns just over 60% of the time. That compares to an average gain of 0.7% in the same week for all years since 1945.&lt;/p&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://media.bespokepremium.com/uploads/2021/12/Avg-perf-based-on-week-before-xmas-122021-3.png\"&gt;CLICK HERE FOR THE CHART!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;p&gt;The table below lists each year since 1945 that the S&amp;amp;P 500 was up over 1% in the week leading up to Christmas along with how it performed in the final week of the year. Of those 23 prior years, there were actually 14 where the S&amp;amp;P 500 rallied 2% or more in the week leading up to Christmas with the last occurrence seven years ago back in 2014. While those types of gains may have put investors in a good mood for the Christmas holiday, it didn&amp;#39;t leave much powder left for the last week of the year as the median gain was just 0.05% with positive returns half of the time.&lt;/p&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://media.bespokepremium.com/uploads/2021/12/SPX-after-1-pct-gain-before-xmas-122321-2.png\"&gt;CLICK HERE FOR THE CHART!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n&lt;/blockquote&gt;\n\n&lt;hr/&gt;\n\n&lt;blockquote&gt;\n&lt;h1&gt;Best and Worst Performers Since Thanksgiving&lt;/h1&gt;\n\n&lt;p&gt;Although the Russell 1000 is now pretty much right back in line with its pre-Thanksgiving level, certain stocks have seen dramatic moves during that same span. Of the 25 stocks that have experienced the largest gains since 11/25, 19 were down on the year leading up to Thanksgiving, and the average stock had declined by 20.0%. Since then, those 25 stocks have gained an average of 13.1%, with Smartsheet (SMAR) and Chegg (CHGG) leading the group with gains of 22.2% and 20.4%, respectively.&lt;/p&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://media.bespokepremium.com/uploads/2021/12/Best-perf-since-122221-2.png\"&gt;CLICK HERE FOR THE CHART!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;p&gt;Of the Russell 1000 members that have performed the worst since Thanksgiving, their average YTD performance leading up to Thanksgiving was a gain of 85.7% while the median performance was much less but still an impressive +25.6%. Of these 25 stocks, 18 were positive YTD through Thanksgiving, and the average decline since then is 23.6%. Everbridge (EVBG) and DocuSign (DOCU) topped this list with declines of 37.2% and 36.6% since Thanksgiving, respectively.&lt;/p&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://media.bespokepremium.com/uploads/2021/12/Worst-perf-since-122221.png\"&gt;CLICK HERE FOR THE CHART!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;p&gt;Based on the data above, it appears as if there was some rotation in the Russell 1000 as investors shifted from leaders to laggards. Essentially, the worse a stock performed between the start of the year and Thanksgiving, the better it has performed since, at least for the top 25 movers to the upside. For the 25 stocks that have declined the most since Thanksgiving, there seems to be very little correlation between the size of the move to the upside before Thanksgiving and performance since then. In the charts below, GameStop (GME) Upstart (UPST) were omitted from the chart but included in the R squared calculation due to visual distortion.&lt;/p&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://media.bespokepremium.com/uploads/2021/12/r-squared-charts-12221-4.png\"&gt;CLICK HERE FOR THE CHART!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n&lt;/blockquote&gt;\n\n&lt;hr/&gt;\n\n&lt;blockquote&gt;\n&lt;h1&gt;December Volatility Spike&lt;/h1&gt;\n\n&lt;p&gt;December typically tends to be a month of lower stock market volatility following a period in late October and early November when volatility tends to peak. This year, however, has been quite different. As of yesterday&amp;#39;s close, the one-month rolling average of one-day absolute moves for the S&amp;amp;P 500 was 1.06%. (This means the S&amp;amp;P 500 has been averaging a daily change of +/-1%+ over the last month.) As shown in the dark blue line below, this has actually been the most volatile one-month period for all of 2021. As the light blue line shows, daily volatility for the S&amp;amp;P 500 is usually plummeting at this time of year as traders typically slow down dramatically around the holidays.&lt;/p&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://media.bespokepremium.com/uploads/2021/12/rolling-vol-122121.png\"&gt;CLICK HERE FOR THE CHART!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;p&gt;Since the 5-day trading week was established back in September 1952, December has historically been the least volatile month of the year, averaging an absolute daily change of 0.61%. This year, the average daily change since the start of December has been 1.07%, which is far above the next closest level seen in March 2021 (+/-0.83%). October, the month that has historically been the most volatile month of the year, ranked 6th in 2021.&lt;/p&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://media.bespokepremium.com/uploads/2021/12/Avg-daily-chg-by-month-122121.png\"&gt;CLICK HERE FOR THE CHART!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;p&gt;So what tends to occur when volatility inverses its seasonal trend in December? Since 1953, there have been five prior years where December was the most volatile month of the year: 1973, 1978, 1985, 1995, and 2018. Below we show how the S&amp;amp;P 500 performed in January following the five prior years listed, and we also show the full next-year change. As shown, January was positive in four of five instances, and the one January that saw a decline was in 1974 when it fell only 1%. In the most recent occurrence, the 9.2% decline in December of 2018 was followed by a 7.9% move higher in January of 2019. In the following year, the median performance of the S&amp;amp;P 500 was +14.6%.&lt;/p&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://media.bespokepremium.com/uploads/2021/12/Table-when-dec-most-2-122121.png\"&gt;CLICK HERE FOR THE CHART!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n&lt;/blockquote&gt;\n\n&lt;hr/&gt;\n\n&lt;blockquote&gt;\n&lt;h1&gt;Bears Still Outnumber Bulls Despite Rally&lt;/h1&gt;\n\n&lt;p&gt;The S&amp;amp;P 500 is currently at record highs, but recent sentiment readings are still relatively bearish. However, this isn&amp;#39;t necessarily negative for markets, as it gives the opportunity for bears to shift their position, which would likely be accompanied by an increase in equity purchases. AAII&amp;#39;s reading on bullish sentiment moved from 25.2% last week to 29.6% this week. This week&amp;#39;s reading is still 6.7 percentage points below the average since 2009.&lt;/p&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://media.bespokepremium.com/uploads/2021/12/AAII-bullish-122321.png\"&gt;CLICK HERE FOR THE CHART!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;p&gt;In turn, bearish sentiment dropped from 39.3% down to 33.9%, which is only 1.8 percentage points higher than the historical average level. This week&amp;#39;s reading was also the second-largest week-over-week decline in bearish sentiment since September 9th.&lt;/p&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://media.bespokepremium.com/uploads/2021/12/AAII-bearish-122321.png\"&gt;CLICK HERE FOR THE CHART!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;p&gt;Neutral sentiment ticked higher by 1.2 percentage points, resulting in 36.6% of respondents reporting a neutral view of the market. This is the lowest absolute change in a month and is 5.0 percentage points higher than the average level.&lt;/p&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://media.bespokepremium.com/uploads/2021/12/AAII-neutral-122321.png\"&gt;CLICK HERE FOR THE CHART!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;p&gt;The NAAIM Exposure Index moved higher this week alongside bullish sentiment. The index ranges from +200 (levered long) to -200 (levered short) and this week the index moved from 52.2 to 67.0, essentially erasing last week&amp;#39;s significant drop. That indicates reporting investment managers&amp;#39; exposure to US equities is roughly 67%.&lt;/p&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://media.bespokepremium.com/uploads/2021/12/NAAIM-exposure-index-122321-2.png\"&gt;CLICK HERE FOR THE CHART!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n&lt;/blockquote&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Here are the most notable companies reporting earnings in this upcoming trading week ahead-&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;blockquote&gt;\n&lt;ul&gt;\n&lt;li&gt;(&lt;strong&gt;N/A.&lt;/strong&gt;)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/blockquote&gt;\n\n&lt;hr/&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://i.imgur.com/EdymJh0.png\"&gt;CLICK HERE FOR NEXT WEEK&amp;#39;S MOST NOTABLE EARNINGS RELEASES!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://i.imgur.com/TkkU0IY.png\"&gt;CLICK HERE FOR NEXT WEEK&amp;#39;S HIGHEST VOLATILITY EARNINGS RELEASES!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Below are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp;amp; consensus estimates courtesy of Earnings Whispers:&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;blockquote&gt;\n&lt;h1&gt;&lt;strong&gt;&lt;em&gt;Monday 12.27.21 Before Market Open:&lt;/em&gt;&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;h6&gt;([CLICK HERE FOR MONDAY&amp;#39;S PRE-MARKET EARNINGS TIME &amp;amp; ESTIMATES!]())&lt;/h6&gt;\n\n&lt;p&gt;(NONE.)&lt;/p&gt;\n\n&lt;h1&gt;&lt;strong&gt;&lt;em&gt;Monday 12.27.21 After Market Close:&lt;/em&gt;&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;h6&gt;([CLICK HERE FOR MONDAY&amp;#39;S AFTER-MARKET EARNINGS TIME &amp;amp; ESTIMATES!]())&lt;/h6&gt;\n\n&lt;p&gt;(NONE.)&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;hr/&gt;\n\n&lt;blockquote&gt;\n&lt;h1&gt;&lt;strong&gt;&lt;em&gt;Tuesday  12.28.21 Before Market Open:&lt;/em&gt;&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;h6&gt;([CLICK HERE FOR TUESDAY&amp;#39;S PRE-MARKET EARNINGS TIME &amp;amp; ESTIMATES!]())&lt;/h6&gt;\n\n&lt;p&gt;(NONE.)&lt;/p&gt;\n\n&lt;h1&gt;&lt;strong&gt;&lt;em&gt;Tuesday 12.28.21 After Market Close:&lt;/em&gt;&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;h6&gt;(&lt;a href=\"https://i.imgur.com/CHRsiO8.png\"&gt;CLICK HERE FOR TUESDAY&amp;#39;S AFTER-MARKET EARNINGS TIME &amp;amp; ESTIMATES!&lt;/a&gt;)&lt;/h6&gt;\n&lt;/blockquote&gt;\n\n&lt;hr/&gt;\n\n&lt;blockquote&gt;\n&lt;h1&gt;&lt;strong&gt;&lt;em&gt;Wednesday 12.29.21 Before Market Open:&lt;/em&gt;&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;h6&gt;(&lt;a href=\"https://i.imgur.com/5lZfaZS.png\"&gt;CLICK HERE FOR WEDNESDAY&amp;#39;S PRE-MARKET EARNINGS TIME &amp;amp; ESTIMATES!&lt;/a&gt;)&lt;/h6&gt;\n\n&lt;h1&gt;&lt;strong&gt;&lt;em&gt;Wednesday 12.29.21 After Market Close:&lt;/em&gt;&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;h6&gt;([CLICK HERE FOR WEDNESDAY&amp;#39;S AFTER-MARKET EARNINGS TIME &amp;amp; ESTIMATES!]())&lt;/h6&gt;\n\n&lt;p&gt;(NONE.)&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;hr/&gt;\n\n&lt;blockquote&gt;\n&lt;h1&gt;&lt;strong&gt;&lt;em&gt;Thursday 12.30.21 Before Market Open:&lt;/em&gt;&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;h6&gt;([CLICK HERE FOR THURSDAY&amp;#39;S PRE-MARKET EARNINGS TIME &amp;amp; ESTIMATES!]())&lt;/h6&gt;\n\n&lt;p&gt;(NONE.)&lt;/p&gt;\n\n&lt;h1&gt;&lt;strong&gt;&lt;em&gt;Thursday 12.30.21 After Market Close:&lt;/em&gt;&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;h6&gt;([CLICK HERE FOR THURSDAY&amp;#39;S AFTER-MARKET EARNINGS TIME &amp;amp; ESTIMATES!]())&lt;/h6&gt;\n\n&lt;p&gt;(NONE.)&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;hr/&gt;\n\n&lt;blockquote&gt;\n&lt;h1&gt;&lt;strong&gt;&lt;em&gt;Friday 12.31.21 Before Market Open:&lt;/em&gt;&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;h6&gt;([CLICK HERE FOR FRIDAY&amp;#39;S PRE-MARKET EARNINGS TIME &amp;amp; ESTIMATES LINK!]())&lt;/h6&gt;\n\n&lt;p&gt;(NONE.)&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;hr/&gt;\n\n&lt;blockquote&gt;\n&lt;h1&gt;&lt;strong&gt;&lt;em&gt;Friday 12.31.21 After Market Close:&lt;/em&gt;&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;h6&gt;([CLICK HERE FOR FRIDAY&amp;#39;S AFTER-MARKET EARNINGS TIME &amp;amp; ESTIMATES!]())&lt;/h6&gt;\n\n&lt;p&gt;(NONE.)&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;hr/&gt;\n\n&lt;blockquote&gt;\n&lt;h1&gt;(T.B.A. THIS WEEKEND.)&lt;/h1&gt;\n\n&lt;p&gt;&lt;strong&gt;(T.B.A. THIS WEEKEND.)&lt;/strong&gt; (T.B.A. THIS WEEKEND.).&lt;/p&gt;\n\n&lt;h1&gt;(&lt;a href=\"https://charts.finviz.com/chart.ashx?t=SPY&amp;amp;ty=c&amp;amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;amp;p=d&amp;amp;s=l\"&gt;CLICK HERE FOR THE CHART!&lt;/a&gt;)&lt;/h1&gt;\n&lt;/blockquote&gt;\n\n&lt;hr/&gt;\n\n&lt;h1&gt;DISCUSS!&lt;/h1&gt;\n\n&lt;p&gt;What are you all watching for in this upcoming trading week?&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;I hope you all have a wonderful weekend and a great final trading week of 2021 ahead &lt;a href=\"/r/stocks\"&gt;r/stocks&lt;/a&gt;. :)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "rp1pzo",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "bigbear0083",
  "discussion_type": null,
  "num_comments": 12,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/rp1pzo/wall_street_week_ahead_for_the_trading_week/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/rp1pzo/wall_street_week_ahead_for_the_trading_week/",
  "subreddit_subscribers": 3425845,
  "created_utc": 1640571865,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1640540466,
  "the_new_excerpt": "Good Sunday afternoon to all of you here on r/stocks [/r/stocks]! I hope\neveryone on this sub made out pretty nicely in the market this past week, and\nare ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week\nbeginning December 27th,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "r/stocks [/r/stocks]の皆さん、日曜日の午後はいかがお過ごしですか？私は\nこのサブの皆さんは、先週のマーケットでかなり良い成績を収められました。\n新しい取引週を迎える準備ができています。\n\n以下は、取引週に備えるために知っておくべきすべてのことです。\n12月27日から...",
      "title": "2021年12月27日から始まる取引週のウォール街ウィークアヘッド"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在r/stocks [/r/stocks]上的各位朋友，周日下午好！我在这里向大家介绍一下我的工作。我希望\n在过去的一周里，每个人都在市场上取得了相当不错的成绩，并且\n准备好迎接新的交易周的到来。\n\n以下是你需要知道的一切，让你为本周的交易做好准备\n从12月27日开始，...",
      "title": "2021年12月27日开始的交易周，华尔街一周前瞻"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在r/stocks [/r/stocks]上的各位朋友，週日下午好！我在這裏向大家介紹一下我的工作。我希望\n在過去的一週裏，每個人都在市場上取得了相當不錯的成績，並且\n準備好迎接新的交易周的到來。\n\n以下是你需要知道的一切，讓你爲本週的交易做好準備\n從12月27日開始，...",
      "title": "2021年12月27日開始的交易周，華爾街一週前瞻"
    }
  ]
}