{
  "author": "EdHistory101",
  "original_created_utc": 1651587299,
  "title": "Megathread: Abortion in America",
  "created_utc": 1651594588,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Late last night, the website &lt;em&gt;Politico&lt;/em&gt; announced they had a draft copy of the ruling in the &lt;em&gt;Thomas E. Dobbs, State Health Officer Of The Mississippi Department Of Health, Et Al, Petitioners V. Jackson Women&amp;#39;s Health Organization&lt;/em&gt;. The draft is attributed to Justice Alito and &lt;a href=\"https://www.vox.com/2022/5/3/23054543/supreme-court-roe-wade-abortion-samuel-alito-overruled-draft-politico\"&gt;court watchers&lt;/a&gt;, including SCOTUS Blog, have confirmed that it matches his writing style and appears to be authentic but likely reflects an early draft that hasn’t yet been tempered down or revised for clarity. (Update: &lt;a href=\"https://twitter.com/WestWingReport/status/1521511753238073357?t=gH5FNluWGZTGsfcfkbNCMA&amp;amp;s=19\"&gt;Justice Roberts has confirmed that it is a legitimate draft ruling.&lt;/a&gt;) It’s dated from early February; the court heard arguments related to the case on December 1st. The timing of the ruling, the author, and the decision suggest it was drafted following an informal vote among the Justices after the arguments and Chief Justice Roberts felt there were enough votes to move forward with the majority opinion. This draft seemingly reflects that opinion and contains the line, “We hold that &lt;em&gt;Roe&lt;/em&gt; and &lt;em&gt;Casey&lt;/em&gt; must be overruled.” This decision will be the first instance in American history when a Supreme Court decision will pull back rights from half the population previously affirmed as Constitutionally protected. &lt;/p&gt;\n\n&lt;p&gt;When the December arguments were announced in November 2021, we published a post on the history of abortion in America. We’re sharing it again to give people one place to ask their questions about the history of abortion in America and to acknowledge how profound and unjust this decision is. We’ve updated and clarified some of the history in the text and have provided additional resources and recommendations. Just like previous megathreads, we welcome top-level questions about the topic, which in this case is the legal and social history of abortion in America. While we do not have any flairs with this particular specialty, there are members of the community who can speak to different aspects of the history. Anyone is welcome to ask or answer questions, provided the comment meets our standards (&lt;a href=\"https://www.reddit.com/r/AskHistorians/wiki/rules\"&gt;an explanation of our rules&lt;/a&gt;). Please note that comments that are nothing more than a user’s opinion on abortion or people who seek out or provide them, will be removed. Users who break our rules around civility will be banned. Many thanks to &lt;a href=\"/u/ghostofherzl\"&gt;u/ghostofherzl&lt;/a&gt;, &lt;a href=\"/u/PhiloSpo\"&gt;u/PhiloSpo&lt;/a&gt;, &lt;a href=\"/u/HillSonghood\"&gt;u/HillSonghood&lt;/a&gt;, &lt;a href=\"/u/aquatermain\"&gt;u/aquatermain&lt;/a&gt;, &lt;a href=\"/u/SarahAGilbert\"&gt;u/SarahAGilbert&lt;/a&gt;, and the other mods and flairs who gave their time and feedback to earlier drafts of this post.&lt;/p&gt;\n\n&lt;p&gt;It’s important to note that while it is accurate to say that overturning &lt;em&gt;Roe&lt;/em&gt; simply returns abortion to the states - and the draft ruling makes that case - such a claim misrepresents the current landscape related to limitations on abortion and reproductive justice. 20 states have anti-abortion &lt;em&gt;trigger&lt;/em&gt; bans (bans that take effect when &lt;em&gt;Roe v. Wade&lt;/em&gt; is overturned) or &lt;em&gt;zombie&lt;/em&gt; laws (anti-abortion laws that were never repealed following &lt;em&gt;Roe&lt;/em&gt;, meaning when &lt;em&gt;Roe&lt;/em&gt; is overturned, the state will revert to laws that were in place in 1973). Some of these laws would penalize the person performing the abortion, others would subject the person getting the abortion - regardless of the reason for the abortion or their health status - to criminal prosecution. (More on these laws &lt;a href=\"https://scholarship.shu.edu/cgi/viewcontent.cgi?article=2283&amp;amp;context=student_scholarship\"&gt;here&lt;/a&gt;.) In anticipation of this ruling, in the same vein as networks in the 1960s, reproductive justice groups are working on educating people who can get pregnant about &lt;a href=\"https://nwhn.org/safe-online-delivered-how-to-get-the-abortion-pill-by-mail/\"&gt;safe means of self-inducing an abortion early in the pregnancy&lt;/a&gt; or fundraising in order to provide people who want or need an abortion later in the pregnancy with the funds needed to &lt;a href=\"https://states.guttmacher.org/\"&gt;travel out of state&lt;/a&gt;. There are a lot of takes about the document on social media today and while it&amp;#39;s impossible to cover the full complexity of abortion in a single post - we&amp;#39;ve skimmed over religion, it’s our hope this thread provides some clarity. &lt;/p&gt;\n\n&lt;p&gt;If you’re interested in a history of abortion outside the United States, &lt;a href=\"https://www.reddit.com/r/AskHistorians/comments/o316vw/in_philip_freemans_collection_of_irish_legends/h2d6gea/?context=3\"&gt;this post&lt;/a&gt; by &lt;a href=\"/u/Kelpie-cat\"&gt;u/Kelpie-cat&lt;/a&gt; provides a recounting of abortion in Ireland. &lt;a href=\"https://www.reddit.com/r/AskHistorians/comments/5lvsv1/how_were_people_not_constantly_impregnated_during/\"&gt;This post&lt;/a&gt; by &lt;a href=\"/u/Sunagainstgold\"&gt;u/Sunagainstgold&lt;/a&gt; gets into abortion in Europe during the Middle and early modern Ages. Likewise, &lt;a href=\"https://old.reddit.com/r/AskHistorians/comments/brdb9e/i_keep_hearing_prochoice_people_say_harsh/\"&gt;this response&lt;/a&gt; also gets into abortion in the Middle Ages. &lt;a href=\"https://old.reddit.com/r/AskHistorians/comments/7yv55h/why_were_the_assyrians_so_opposed_to_abortion/\"&gt;This question&lt;/a&gt; about Assyrians and abortion got several answers. Finally, &lt;a href=\"https://www.reddit.com/r/AskHistorians/comments/635p76/did_the_ussr_suffer_from_a_reverse_baby_boom_a/dfrmlo2/\"&gt;this answer&lt;/a&gt; from u/ Georgy_K_Zhukov focuses on abortion in the Soviet Union.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;On June 8th, 1964, an employee at the Norwich Motel in Norwich, Connecticut opened the door to one of the rooms and discovered an unresponsive woman kneeling on the floor, her cheek pressed to the carpet, bloody sheets and towels between her legs. When the police and ambulance arrived, they declared the woman dead and began collecting evidence, including medical equipment and a textbook. Geraldine &amp;quot;Gerri&amp;quot; Santoro’s daughters would be told that she died in a car accident, not knowing until they were older their mother had recently left their father and was pregnant at the time of her death. Much later, her daughters and sister would learn Gerri had been worried how her husband would react if he found out she was pregnant and had rented the hotel room with her boyfriend, Clyde Dixon, intending to self-induce an abortion. According to his testimony during his trial for manslaughter, Dixon used the textbook to teach himself the procedure and panicked when Gerri began to hemorrhage. He fled. He would eventually serve a year in prison for manslaughter. The man who provided him with the textbook was charged with “conspiring to commit an abortion.” Almost ten years later, in April 1973, just months after the ruling in the affirmative for Roe, Ms. magazine published a photograph of Gerri taken by the police, showing her just as the maid found her. The article with the photograph was titled simply, &amp;quot;Never Again.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;When we look at the history of abortion in America, there are generally three groups of people who are part of the historical record: people who can and did get pregnant, medical care providers (midwives, healers, doctors, etc.), and lawmakers (judges, police, legislatures, etc. - almost exclusively cis white men until the modern era.)  Before getting into how these groups interacted, it’s helpful to start with language. First, as panel members during the AH conference session &lt;a href=\"https://old.reddit.com/r/AskHistorians/comments/qbdy27/the_lie_became_the_truth_locating_trans/\"&gt;The Lie Became the Truth: Locating Trans Narratives in Queer History&lt;/a&gt; demonstrated, trans and non-binary people have always existed. The history of abortion in America includes them; they are a part of the history. Not only have trans, non-binary, and Two-Spirit people needed and sought out abortions, using only the word women to describe those who got abortions ignores or disregards the girls who have gotten pregnant and needed or wanted an abortion. As such, it’s not only more inclusive but also more precise and historically accurate to talk about people who can get or have been pregnant. For more on the queering of abortion rights, see this 2018 article from Barbara Sutton and Elizabeth Borland, &lt;a href=\"https://www.tandfohnline.com/doi/abs/10.1080/13691058.2018.1437221\"&gt;Queering abortion rights: notes from Argentina&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Next is the word &lt;em&gt;abortion&lt;/em&gt; itself. Historian Sara Dubow, author of &lt;a href=\"https://amzn.to/2XZPSiO\"&gt;Ourselves Unborn: A History of the Fetus in Modern America&lt;/a&gt; begins her book by explaining to the reader that a “fetus in 1870 is not the same thing as a fetus in 1970, which is not the same thing as a fetus in 2010. Although multiple and competing fetuses have always coexisted, particular historical circumstances have generated and valorized different stories about the fetus.” (p. 3) Similarly, and to be sure the boundaries are not clean and discrete, it’s important to recognize there are multiple histories of abortion in America; that the social and legal history related to enslaved people’s bodily autonomy, access to contraception and abortion, and infanticide is different than the histories of abortion in Indigenous communities. In addition, the cultural and social norms around abortion varied between and among Indigenous communities and before and after colonization. These different definitions shape the meaning of the word and how the concept itself is viewed by a community or a particular group of people. In most histories of abortion in America, the focus is on white women. Yet, even for them, the meaning of the word, and the act itself, varied based on class, geographical location, and time period. (Historian Rickie Solinger describes these different yet interrelated histories and experiences as “reproductive politics.” Her book, Pregnancy and Power speaks to the question, “Who has power over matters of pregnancy and its consequences?”) So, while a reader in 2022 may think of a particular thing upon hearing the word, it’s important to stress that what we call an abortion hasn’t always been considered an abortion.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Abortion in Early America&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;One of the claims in the draft decision is that there is no Constitutional right to abortion because access to abortion is not part of American history. The draft goes as far as to say, “The inescapable conclusion is that a right to abortion is not deeply rooted in the Nation&amp;#39;s history and traditions.” (p. 24.) While it is beyond the scope of this post to argue that the right to an abortion is part of America history, there is overwhelming evidence in the historical record that abortion was a part of people’s lives, going back to before America was America. It’s likely that the dissenting opinions will speak to that history. Meanwhile, it is noteworthy that the draft opinion had to pull on English law to make a claim regarding the nature of abortion (“Sir Matthew Hale likewise described abortion of a quick child who died in the womb as a ‘great crime’ and a ‘great misprision.’ See M. Hale, Pleas of the Crown: Or, A Methodical Summary of the Principal Matters Relating to that Subject 53 (1673)” p. 17.) The name Michael Hale is well known among women’s historians as he laid the foundation for what’s known as the “marital rape exception”; a provision that claimed a husband could legally rape his wife as she’d given up her right to refuse sex upon marriage. (More on Hale and his rulings &lt;a href=\"https://digitalcommons.law.ggu.edu/cgi/viewcontent.cgi?referer=&amp;amp;httpsredir=1&amp;amp;article=1248&amp;amp;context=ggulrev\"&gt;here&lt;/a&gt;. &lt;/p&gt;\n\n&lt;p&gt;It’s helpful for the purpose of understanding the history to focus not on the law itself, but on the experiences of those who could get pregnant. Let us take, for example, the scenario of an American woman in 1780 who realizes that more weeks have passed since the last time her uterus shed its lining (or as we might think of it today, since her last period) than usual. (&lt;a href=\"https://amzn.to/3EsQ35O\"&gt;Revolutionary Conceptions: Women, Fertility and Family Limitations in America, 1760-1820&lt;/a&gt; by Susan E. Klepp provides an in-depth look at what that woman may have been feeling and thinking upon that realization.) The most pressing problem at hand is her health, not if she’s pregnant. More specifically, she would be concerned that her body was out of balance. The prevailing thinking at the time – from laypeople, midwives, and leading medical professionals – was that a late or delayed period could indicate an illness that needed to be treated. At this point, she had two options: wait or treat the illness. For the sake of clarifying the meaning of the term abortion as it was used during that era, let’s say this woman sought out a local midwife or healer to fix the problem of “blocked menses.” She may have also consulted one of the many available medical or household guides which would recommend a variety of ways to bring on one’s period, including warnings about quantity and side effects. What she would want is known as an emmenagogues, an herb that stimulates bleeding or contractions in the uterus, which would, in effect, restart her period. While there were a number of wild and cultivated herbs with varying side effects for the person taking them, one of the most common means of inducing an abortion was savin, created from drying and powdering the leaves or extracting oil from a juniper plant. (According to James C. Mohr, author of Abortion in America: The Origins and Evolution of National Policy, accidental overdoses of savin were common throughout American history. His findings remind us that abortion has always been a part of health care.)&lt;/p&gt;\n\n&lt;p&gt;If the woman ingested the savin and her period started, all was well – her health had been restored, her menses unblocked. Even though she’d taken something classified today as an abortifacient, she had not gotten an abortion – even if she had been pregnant. In other words, doing something to bring on one’s period was not considered an abortion in the way Hale or the draft document describe it. (There were some religious exemptions to this but that’s outside the scope of this post. Cornelia Hughes Dayton’s 1991 article, &lt;a href=\"https://www.jstor.org/stable/2937996\"&gt;Taking the Trade: Abortion and Gender Relations in an Eighteenth-Century New England Village&lt;/a&gt; is a very detailed look at the death of one particular woman following a botched surgical abortion and explores the religious implications in more depth. “Taking the trade” was the most common phrase for taking something to unblock one’s menses.) However, let’s say instead she waited until the next month. If her period restarted with no intervention, she had evidence her body was back in balance.&lt;/p&gt;\n\n&lt;p&gt;Let’s say she waits one more month and nothing happens. Her body is still out of balance and she may still elect to seek out ways to unblock her menses. However, if she waited a bit longer, somewhere around four or five months after the first missed period, she might receive her confirmation that she wasn’t ill, but pregnant (it’s estimated that 20% of pregnancies end due to spontaneous abortion, or miscarriage - &lt;a href=\"https://amzn.to/2ZCcaHI\"&gt;The Myth of the Perfect Pregnancy: A History of Miscarriage in America&lt;/a&gt; by Lara Freidenfelds is a fantastic read on the topic). This confirmation was known as quickening, when the pregnant person reported feeling fetal movement. She may have had other indicators of pregnancy – nausea, fatigue, swollen breasts, etc. but it was generally recognized that the quickening was the moment at which the pregnancy was officially confirmed. If at this point, she sought out the same midwife and asked for something to bring on her flow, she would then be, as defined at the time, seeking out an abortion. However, getting an abortion or terminating a pregnancy after the quickening was not necessarily illegal and for most white people who could get pregnant, was seen as a form of birth control with social implications more in line with other forms reducing the number of children a person has and less like it was framed by the pro-life movement in 20th century, as the “murder of an unborn child.” &lt;/p&gt;\n\n&lt;p&gt;In many ways, the sentiment around abortion in white communities for most of American history was very different than it is today. Obtaining or providing an abortion happened in public; ads for abortion providers were common in newspapers in the 1800s and early 1900s. Perhaps the most significant difference was the disconnect from partisanship. That is, positions on abortion laws were not a proxy for political parties and prevailing sentiments around miscarriage and abortion were more complex and more nuanced than they are today. As a reminder, despite the use of “we the people” in the Constitution, nearly all people who were not white men were excluded from the spaces that determined the laws and policies around American life until well into the 20th century. Which is to say, as we move into a discussion of laws banning abortion, it’s important to remember that the discussions and lawmaking structures were designed, driven, dominated, and shaped by men and their understanding of pregnancy. This is not to say white women were not instrumental in anti-abortion advocacy and the work of historians such as Elizabeth Gillespie McRae in &lt;a href=\"https://amzn.to/3brvuu8\"&gt;Mothers of Massive Resistance: White Women and the Politics of White Supremacy&lt;/a&gt;, Daniel K. Williams in &lt;a href=\"https://amzn.to/3pWi9SX\"&gt;Defenders of the Unborn: The Pro-Life Movement before Roe v. Wade&lt;/a&gt;, and &lt;a href=\"https://amzn.to/3wdzwQx\"&gt;The Lie that Binds&lt;/a&gt; by Ellie Langford and Ilyse Hogue explore their role in more depth. &lt;/p&gt;\n\n&lt;p&gt;One of the reasons it’s important we distinguish between the history of abortion among white women and women of color is that for most enslaved people who could get pregnant, their status as a parent or a potential parent often came down to how their enslaver thought of the children they might bear. &lt;a href=\"https://amzn.to/3bnlAtz\"&gt;Killing the Black Body&lt;/a&gt; by Dorothy Roberts offers a detailed look at enslaved women and their reproductive decisions, including the different ways courts handled infanticide and the essay &lt;a href=\"https://www.ncbi.nlm.nih.gov/books/NBK425854/\"&gt;Native American Health: Historical and Legal Context&lt;/a&gt; provides more context on the factors that impacted Indigenous people. For more on white women’s sense of identity related to motherhood, Barbara Welter’s &lt;a href=\"https://www.jstor.org/stable/2711179\"&gt;The Cult of True Womanhood: 1820-1860&lt;/a&gt; makes for an interesting read. Finally, Nicola Beisel and Tamara Kay’s article &lt;a href=\"https://journals.sagepub.com/doi/10.1177/000312240406900402\"&gt;Abortion, Race, and Gender in Nineteenth-Century America&lt;/a&gt; provides even more context on the topic.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;1850s - 1960s&lt;/strong&gt; &lt;/p&gt;\n\n&lt;p&gt;While there were communities where abortion was treated as a punishable event, it’s generally recognized that the first meaningful laws related to abortion emerged in the mid-1800s as abortifacients became increasingly commercialized. In effect, the early laws were about poison control. Just as general medicine was moving into a snake oil phase, so did medicines related to menstruation, abortion, and childbirth. One common sentiment at the time was the worse a person’s reaction to a medicine, the better the cure was working. Manufacturers added ingredients that increased the side effects experienced by the person taking the treatment, often eliminating the abortifacients themselves and basically poisoning the person taking the “trade.” These early laws were primarily focused on protecting those who sought out an abortion; they did not seek to punish the pregnant person. In addition, they did not outlaw or ban particular plants or herbs themselves. Midwives and healers could still grow, harvest, and administer plants that could induce an abortion. As these plants could also help ease delivery or resolve an incomplete miscarriage, they were an essential part of maternal health. It’s also worth stating explicitly that these early laws did not seek to overrule a pregnant person’s autonomy or limit other means of completing or resolving an abortion, only those that were known to poison the pregnant person if taken in incorrectly or in the wrong dosage. This would no longer be the case by the end of the 19th century.&lt;/p&gt;\n\n&lt;p&gt;By 1867, every state had a law making some aspect of obtaining or providing an abortion illegal. However, as previously mentioned, these public acts did not eliminate them from people’s private lives. Historians estimate that between 1867 and 1973, the period of time abortion was a crime, upwards of 25% of pregnancies ended through abortion. Or as legal historian Karissa Haugeberg puts it, “it was a commonly practiced procedure, even though practiced criminally.” Yet, not all of the laws fully banned abortion. Lawmakers in Oregon held that an “unnecessary” abortion only became a crime when it, “results in the death of the mother, or of a quick foetus [a fetus after the point at which the pregnant person reports movement.].” Alabama had a similar law and Nebraska’s law was focused on cracking down on entrepreneurs selling abortion cures that were actually poison. Meanwhile, the degree to which states acted on these laws, even lawmakers within the same state, varied wildly, especially during the Great Depression when many parents were struggling to care for the children they already had. &lt;/p&gt;\n\n&lt;p&gt;However, the public sentiment shifted in the 1950s as America experienced a baby boom and lawmakers began to crack down on abortion providers. Before World War II, a pregnant person with social connections could typically obtain a legal, safe abortion provided their doctor agreed it was medically necessary. As reproductive health services became less personalized, more clinical, it became harder for pregnant people to find a medical professional who was willing to certify their abortion was necessary. A pregnant person could plead their case in front of a panel at a hospital but it would require going public with the pregnancy. As safe and legal abortions became harder and harder to obtain, many communities created whisper networks and collectives, such as the Jane Collective in Chicago, that could connect pregnant people with a safe abortion provider. It also meant an increase in abortion providers who were more interested in any perceived financial benefits than reproductive health. It’s worth noting that many of these networks were led or otherwise supported by members of the clergy who were most likely to see the consequences of unsafe abortions on a community or family. During this period, those most likely to die from botched abortions were women and girls of color. In some cities, hospitals had to establish sepsis wards to treat those who contracted life-threatening infections following an unsafe abortion.&lt;/p&gt;\n\n&lt;p&gt;In terms of the thinking behind outlawing abortion despite its presence in society and its role in healthcare, historians offer a variety of reasons. First, the American Medical Association expressed a strong desire to move maternal and all healthcare related to pregnancy away from midwives, who were typically women trained through social networks and traditional apprenticeships, under a medical model they could control. Banning all abortions except those deemed “medically necessary” meant doctors, not midwives or the pregnant person, could control who got or performed - and who got paid for - an abortion. Second, according to historians including Beisel and Kay, white Americans in positions of power were worried about birth rates. In effect, they saw laws against abortion as a way to ensure the right (native-born, non-immigrant) kind of white babies were born and concurrent laws that allowed for the forced sterilization of Black and Indigenous women, white women deemed unworthy of raising children, as a way to ensure fewer undesirable babies were born. Third, it was about controlling women at a time when there was a sense they were “out” of control as seen in efforts to obtain the vote for women and coeducational higher education. When male legislatures passed laws outlawing abortion, it provided a way for them to control what was seen as the most fundamental purpose of womanhood: bearing children. From Kathryn Kolbert and Julie Kay, “at its core, the abortion debate is an embodiment of the conflict between traditional and more modern concepts of gender roles. In its darkest corners, the abortion debate is about controlling when and with whom sex is appropriate, and when and with whom one has babies. A woman is unfairly branded by the sexual and procreative decisions she makes: married or spinster, saint or sinner, madonna or whore, selfless mother or welfare queen.” (p. 9) In the 1950s and 60s, historians estimate that 200 people a year died from unsafe, usually self-induced, abortions. More &lt;a href=\"https://www.reddit.com/r/AskHistorians/comments/s8tr7p/were_coat_hangers_ever_really_used_for_athome/\"&gt;here&lt;/a&gt; on the history of the wire hanger in the abortion rights movement. &lt;/p&gt;\n\n&lt;p&gt;States did create carve outs, known as &lt;em&gt;therapeutic abortions&lt;/em&gt;, meaning the abortion was necessary for the woman&amp;#39;s health. However, as this was a matter of opinion, abortion providers could use their discretion as they saw fit. And rape and incest were seen by many as a justifiable argument for using that discretion. The foundation for this thinking in America was generally based on a 1938 British court decision, &lt;em&gt;Rex v. Bourne&lt;/em&gt;, which held that a pregnant person&amp;#39;s mental well-being mattered. (The case involved a 14-year-old who was sexually assaulted, got pregnant, and was given the abortion she asked for. The doctor was charged with providing an illegal abortion and the judge ruled that the doctor had actually saved the girl&amp;#39;s life by giving her the abortion and not forcing her to stay pregnant and give birth.)&lt;/p&gt;\n\n&lt;p&gt;Safe, legal abortion providers were more than willing to provide (and be paid for) an abortion for a married woman who&amp;#39;d been assaulted by a stranger but not necessarily to an unmarried woman who had multiple sexual partners and reported domestic violence. In &amp;quot;When Abortion was a Crime,&amp;quot; Regan writes about a series of Chicago hospital hypothetical case studies in the 1970s and what can best be described as &amp;quot;wild inconsistency&amp;quot; regarding if a person could get an abortion. In one hypothetical, the presenting patient was a minister&amp;#39;s daughter who had been raped by a member of her father&amp;#39;s church. Six out of six hospitals said they would provide an abortion. The studies found that the best way for a pregnant person to be approved for an abortion was to claim she was raped, attempt suicide or grievous self-harm, and claim financial hardship. When these factors were present, pregnant people were almost always given the safe, legal abortion they sought. However, beyond hypothetical cases, an individual intake worker&amp;#39;s or hospital social worker&amp;#39;s personal beliefs around abortion would determine the person&amp;#39;s odds of getting an abortion. For example, if the social worker thought a baby could help a married woman&amp;#39;s marriage, she wouldn&amp;#39;t let the woman go any further. Some social workers were firmly anti-abortion and whisper networks knew not to recommend people to that hospital and other hospital social workers, who were often clergy, helped every pregnant person who showed up. This &amp;quot;rape or incest&amp;quot; loophole, as it were, and the willingness of medical providers to provide safe and legal abortions for those who sought one under that umbrella meant that there were cases where a pregnant person said they had been raped, even though they hadn&amp;#39;t. When originally seeking an abortion, Norma McCorvey (Roe) had considered reporting she&amp;#39;d been assaulted as friends had told her that was how they safely acquired an abortion. She changed her mind and did not pursue that option.&lt;/p&gt;\n\n&lt;p&gt;While the death toll from botched abortions did go down as antibiotics became more readily available, efforts to decriminalize abortion began in the mid-1960 in states such as Colorado and New York State. Most notably, the AMA which had previously pushed to outlaw abortion changed its position and began to advocate for legal, safe abortion as a part of maternal health care. In the late-60s, a team of lawyers, including Sarah Weddington, connected with a Texas woman named Norma McCorvey who wanted an abortion. Weddington would go on to argue on behalf of her client McCorvey, then known by the pseudonym, Jane Roe, that there was a constitutional right to an abortion. Weddington was only 29 years old at the time, making her the youngest person to ever argue a case in front of the Supreme Court.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Roe v. Wade (1973)&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;The legal decision in &lt;em&gt;Roe v. Wade&lt;/em&gt; took place against a backdrop of contentious debate, and a shift in public opinion favoring abortion. While the Court agreed to hear Roe in 1970, it was almost two years before the Court heard arguments in the case, and it took 27 months from the filing of the case to the decision being issued. Justice Blackmun, the author of the opinion, was heavily influenced by his attempts to conduct medical research during this period, as well as discussions with his law clerks and other justices. Blackmun was also clearly aware of the shift in public opinion and medical advocacy, as his Roe files contained a Washington Post article that reported on one such poll. The poll, conducted in June 1972, found that 66% of Americans believed abortion should be “a matter for decision solely between a woman and her physician.&amp;quot; He collected articles representing a variety of viewpoints, including from the* American Journal of Public Health* depicting abortion as inevitable as well as dissenting articles from practicing obstetricians and gynecologists. Nevertheless, the sharpening of public opinion and medical opinion on the issue seems to have added to Justice Blackmun’s thinking, and no doubt weighed on the Court. Abortions done without the care of an attending physician and without the cover of state law killed hundreds, and in some years, thousands of people. While such deaths became less common with time due to improved care, they still formed a large percentage of childbirth-related deaths, and hospitalizations remained high. The Court was navigating a shift in public opinion and a continuing public health question, which influenced Justice Blackmun’s ultimate analysis. In fact, Justice Blackmun explicitly referenced these shifts in medical, public, historical, and legal understanding when announcing the decision in Roe from the bench. The other Justices were no less interested in the backdrop for the case, and some credit Justice Brennan with significant influence over the final opinion. There are suggestions in Blackmun’s papers and other records that Brennan and Justice Marshall were influential in pushing the trimester framework to its final result, whereby state regulation before viability but after the first trimester would be restrained to only specific areas, rather than leaving states completely free to regulate abortion after the first trimester. They, along with Justice Powell, wrote to Justice Blackmun about the proper points at which regulation could begin, and thus ended up creating the trimester framework. All were to some extent aware of, and conscious of, public opinion and medical opinion on abortion procedures at various points during pregnancy. (The recent Broadway show, &lt;em&gt;What the Constitution Means to Me&lt;/em&gt; from Heidi Schreck provides more background on the judges, as well as audio of them debating the question. &lt;em&gt;Becoming Justice Blackmun&lt;/em&gt; by Linda Greenhouse is a compelled read on his life and decision-making process.) &lt;/p&gt;\n\n&lt;p&gt;That analysis focused on whether a right to privacy, grounded in the due process clause of the Fourteenth Amendment, could be the basis for the right to an abortion. The right to privacy was not a new idea. It had been a key part of the decision in Griswold v. Connecticut over 7 years earlier, ruling ultimately that barring the use of contraceptives was unconstitutional. However, finding the right in the Fourteenth Amendment’s guarantee of liberty was new, and legal commentators of all opinions have expressed both support and disappointment in Justice Blackmun’s analysis. The opinion reasoned that the right to privacy could only be overcome by a “compelling” government interest if the state wished to regulate under the authority of its interest in health. Roe thus created the “trimester” framework that many are familiar with, albeit one that would shift subtly over time: during the first trimester, a pregnant person’s privacy right outweighed the state’s interest in regulating health but during the second trimester and onwards, the state’s interest could outweigh the pregnant person’s if legitimately tied to its regulation of health. Roe also made clear that beyond viability, which the Court believed was at 26 or 27 weeks (approximately when quickening occurred), a state could outlaw abortion because the interest in the “potentiality” of life outweighed the pregnant person&amp;#39;s right to privacy.&lt;/p&gt;\n\n&lt;p&gt;What Roe did not do, however, was affirm that the state had to facilitate or ensure pregnant people had access to abortion. By not affirming the right to abortion beyond the right to privacy or the state’s interest, by not affirming what we think of as bodily autonomy of pregnant people in the modern era, the ruling left space for a new approach to laws. The Hyde Amendment, which banned the use of federal dollars in funding or providing abortion services, took advantage of that lack of affirmation. In 1992, the Rehnquist court created via Casey v. Planned Parenthood a new litmus test for anti-abortion laws known as an &amp;quot;undue burden&amp;quot; defined as a &amp;quot;substantial obstacle in the path of a woman seeking an abortion before the fetus attains viability.&amp;quot; This allowed states to mandate wait times before an abortion, parental notification, and in some cases, required doctors to share misinformation with people seeking an abortion about the consequences of getting the service. States began to push the limits of anti-abortion laws until 2016 when Whole Woman’s Health v. Hellerstedt ended most of the so-called TRAP (targeted restrictions on abortion providers) laws such as requiring abortion-service providers be located in buildings that meet building requirements for ambulatory surgical centers or that doctors who work at the clinics have admitting privileges at a nearby hospital. Although Hellerstedt ruling was seen as an affirmation of Roe v. Wade, conservative lawmakers went back to the drawing board to find new ways to make abortion harder to get. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Implications&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Abortion is still legal(ish) in all 50 states. People who have appointments for abortions today or in the near future should keep them. It is still legal to receive and send the pills needed for a medical abortion. While it’s impossible to know what will happen when the final ruling is released, the early responses to the draft from historians and legal scholars have expressed concern regarding the central argument in the draft which is basically, there is no Constitutional right to abortion because abortion isn’t mentioned in the Constitution. (Scholars refer to those rights, those explicitly mentioned, as &lt;em&gt;enumerated rights.&lt;/em&gt; Abortion is, as of today, an unenumerated right.) Other unenumerated rights include the right to marry someone of the same gender (&lt;em&gt;Obergefell v. Hodges&lt;/em&gt;), the right to access birth control &lt;em&gt;(Griswold v. Connecticut&lt;/em&gt;), the right to join a union (&lt;em&gt;Lochner v. New York&lt;/em&gt;) among others we take for granted in 2022.  &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Resources and Recommendations&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;In addition to the references cited in this post, we also recommend:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;The Now &amp;amp; Then podcast with historians Heather Cox Richardson and Joanne Freeman on &lt;a href=\"https://podcasts.apple.com/us/podcast/abortion-whose-choice/id1567665859?i=1000535263849\"&gt;Abortion: Whose Choice?&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;&lt;a href=\"https://twitter.com/jackiantonovich/status/1521428632069185536\"&gt;A collection of essays&lt;/a&gt; on abortion in global history from Nursing Clio, edited by a historian of gender, medicine, and politics, Jacqueline Antonovich&lt;/li&gt;\n&lt;li&gt;A &lt;a href=\"https://twitter.com/1gillianfrank1/status/1298376469647949825\"&gt;curated list of resources&lt;/a&gt; from a historian of abortion, sexuality, and religion, Gillian Frank&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 120,
  "permalink": "/r/AskHistorians/comments/uhh2j1/megathread_abortion_in_america/",
  "subreddit": "AskHistorians",
  "id": "uhh2j1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "Late last night, the website Politico announced they had a draft copy of the\nruling in the Thomas E. Dobbs, State Health Officer Of The Mississippi\nDepartment Of Health, Et Al, Petitioners V. Jackson Women's Health Organization.\nThe draft is attributed to Justice Alito and court…"
}