{
  "author": "operator139",
  "original_created_utc": 1631767302,
  "title": "Does anyone else feel like after discovering Cryptocurrency they are part of a secret club now?",
  "created_utc": 1631785153,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I did really well cashing out some profits once when we were at 53k roughly a week ago and man, it&#39;s been sending me chills.</p>\n\n<p>I know lots of friends who are struggling with debt, and I feel bad for them. It&#39;s weird having to keep the reality of knowing I doubled my profits from buying at 29k Bitcoin, and some other alts were way more than that.</p>\n\n<p>I can&#39;t tell the girls I&#39;m dating I&#39;m into some weird crytocurrency stuff, they don&#39;t understand it or get it. My family thinks I&#39;m a fool. I have ONE friend I trust telling at least I am in it.</p>\n\n<p>The rest of my friends are this subreddit. We&#39;re over here dreaming about Lambos and talking about those gains. This is the best community and the only community, it&#39;s like a secret club where you actually know how to make money. There&#39;s all these get rich quick schemes, and even though crypto isn&#39;t that, it&#39;s a promising place that helps people become financially free. </p>\n\n<p>I feel really bad for people who fall for scams. Just invest in Crypto. I want to help but I don&#39;t think I am the one for the job. I enjoy it here and feeling like you are part of the Crypto community is very rewarding in of itself.</p>\n</div><!-- SC_ON -->",
  "score": 184,
  "permalink": "/r/CryptoCurrency/comments/pp6k0e/does_anyone_else_feel_like_after_discovering/",
  "subreddit": "CryptoCurrency",
  "id": "pp6k0e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I did really well cashing out some profits once when we were at 53k roughly a\nweek ago and man, it's been sending me chills.\n\nI know lots of friends who are struggling with debt, and I feel bad for them.\nIt's weird having to keep the reality of knowing I doubled my profits from\nbuying at 29k…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1週間ほど前に53万円になった時に、一度利益をキャッシュアウトしたのがとても良かった。\n一週間前のことだけど、寒気がしてきたよ。\n\n借金に苦しんでいる友人をたくさん知っていて、彼らには申し訳ないと思っているんだ。\n29Kで買った時の倍の利益を出したという現実を維持しなければならないのは変な感じです。\n29Kで買った時の利益を倍にしたことを現実にしなければならないのは変な話だ。",
      "title": "暗号通貨を知ってから、自分が秘密のクラブの一員になったように感じた人はいませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我做得非常好，在大约一周前我们处于5.3万的时候把一些利润兑现了。\n一周前，伙计，这让我感到心寒。\n\n我知道有很多朋友正在与债务作斗争，我为他们感到难过。\n要知道我的利润翻了一番，这很奇怪，我不得不保持现实，从\n在29K买入的时候，我知道我的利润翻了一番，这很奇怪。",
      "title": "还有人觉得在发现加密货币后，他们现在是一个秘密俱乐部的成员吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我做得非常好，在大約一週前我們處於5.3萬的時候把一些利潤兌現了。\n一週前，夥計，這讓我感到心寒。\n\n我知道有很多朋友正在與債務作鬥爭，我爲他們感到難過。\n要知道我的利潤翻了一番，這很奇怪，我不得不保持現實，從\n在29K買入的時候，我知道我的利潤翻了一番，這很奇怪。",
      "title": "還有人覺得在發現加密貨幣後，他們現在是一個祕密俱樂部的成員嗎？"
    }
  ]
}