{
  "author": "charleston_cheww",
  "original_created_utc": 1624832382,
  "title": "What’s the point of keeping up to date and aware of world issues when nobody else seems to care and it’s all just depressing?",
  "created_utc": 1624854544,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>From Amazon’s abhorrent treatment of its warehouse workers, to the giant trash pile in the pacific, to cutting down rainforests for palm oil to make chocolate nice and smooth, to political corruption… you read the news and listen to the podcasts and it’s all so depressing. Then I try to talk to other people about it and either get made fun of for trying to be so ‘woke’ or that the tiny choices I make each day aren’t really going to make a difference, or people just don’t want to know because they’re already so stressed out about their own lives they can’t handle the mental load of caring about these major global issues as well. How can we care about the big issues and raise awareness and try to make a difference?</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/NoStupidQuestions/comments/o970a9/whats_the_point_of_keeping_up_to_date_and_aware/",
  "subreddit": "NoStupidQuestions",
  "id": "o970a9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "From Amazon’s abhorrent treatment of its warehouse workers, to the giant trash\npile in the pacific, to cutting down rainforests for palm oil to make chocolate\nnice and smooth, to political corruption… you read the news and listen to the\npodcasts and it’s all so depressing. Then I try to talk to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アマゾンの倉庫労働者に対する忌まわしい扱いから、太平洋の巨大なゴミの山、熱帯雨林の伐採まで。\n太平洋の巨大なゴミの山、チョコレートを美味しく滑らかにするためのパーム油のために熱帯雨林を伐採すること、政治的腐敗...。\n滑らかなチョコレートを作るためのパーム油のために熱帯雨林を伐採したり、政治的な腐敗があったり...。\nニュースを読んだり、ポッドキャストを聞いたりすると、すべてが憂鬱になります。そんなとき、私は...",
      "title": "誰も気にしていないような、気が滅入るようなことばかりなのに、世界の問題に関心を持ち続けることに何の意味があるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "从亚马逊对其仓库工人的可恶待遇，到太平洋上的巨大垃圾\n到太平洋的巨大垃圾堆，到砍伐雨林以获取棕榈油来制作巧克力\n到政治腐败......你读新闻，听播客，这一切都让人感到沮丧。\n你读新闻，听播客，这一切都如此令人沮丧。然后我试着和...",
      "title": "如果其他人似乎都不关心，而这一切只是令人沮丧，那么保持对世界问题的最新认识和了解又有什么意义？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "從亞馬遜對其倉庫工人的可惡待遇，到太平洋上的巨大垃圾\n到太平洋的巨大垃圾堆，到砍伐雨林以獲取棕櫚油來製作巧克力\n到政治腐敗......你讀新聞，聽播客，這一切都讓人感到沮喪。\n你讀新聞，聽播客，這一切都如此令人沮喪。然後我試着和...",
      "title": "如果其他人似乎都不關心，而這一切只是令人沮喪，那麼保持對世界問題的最新認識和了解又有什麼意義？"
    }
  ]
}