{
  "author": "roberthonker",
  "original_created_utc": 1631377342,
  "title": "Not everything is FUD.",
  "created_utc": 1631388828,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This community is jacked to the tits with confirmation bias. Anything that doesn&#39;t give you guys that sweet sweet hit of hopium is instantly downvoted to oblivion, and proclaimed FUD by all. Prepare to be attacked for posting anything slightly negative about one of this subs favorite coins. In general stay away from ETH, ADA, ALGO, VET and MOON&#39;s as those will cause the most outrage.</p>\n\n<p>ALGO is centralized? FUD.</p>\n\n<p>BTC is slow? FUD.</p>\n\n<p>ETH gas fees are too high? FUD.</p>\n\n<p>Y&#39;all need to chill out with the FUD. Not everything is FUD. This post isn&#39;t FUD.</p>\n\n<p>Thank you for coming to my ted talk.</p>\n</div><!-- SC_ON -->",
  "score": 155,
  "permalink": "/r/CryptoCurrency/comments/pmadt1/not_everything_is_fud/",
  "subreddit": "CryptoCurrency",
  "id": "pmadt1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This community is jacked to the tits with confirmation bias. Anything that\ndoesn't give you guys that sweet sweet hit of hopium is instantly downvoted to\noblivion, and proclaimed FUD by all. Prepare to be attacked for posting anything\nslightly negative about one of this subs favorite coins. In…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このコミュニティは、確証バイアスで頭がいっぱいです。なんでもかんでも\nホイップの甘い甘いヒットを与えないものは、即座に削除されます。\n抹消され、全員がFUDと宣言します。このサブスクのお気に入りの一つについて少しでも否定的なことを投稿すると攻撃されることを覚悟して\n少しでも否定的なことを投稿すると攻撃されます。で...",
      "title": "すべてがFUDではありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这个社区被确认偏见搞得焦头烂额。任何\n不给你们带来甜美的希望，就会立刻被降级到\n遗忘，并被所有人宣布为疑虑。准备好被攻击，因为发布任何\n币的负面信息都会受到攻击。在...",
      "title": "不是所有东西都是FUD。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個社區被確認偏見搞得焦頭爛額。任何\n不給你們帶來甜美的希望，就會立刻被降級到\n遺忘，並被所有人宣佈爲疑慮。準備好被攻擊，因爲發佈任何\n幣的負面信息都會受到攻擊。在...",
      "title": "不是所有東西都是FUD。"
    }
  ]
}