{
  "author": "TOXICCARBY",
  "original_created_utc": 1632249003,
  "title": "The Evergrande Crisis isn’t FUD; Get ready for big dips in the next week",
  "created_utc": 1632260193,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The Evergrande crash has so far caused a decline of 10-15% in the cryptocurrency market, and while many might buy the dip right now I’d suggest waiting for tomorrow’s even bigger crash</p>\n\n<p>Why crypto (and other markets) will crash tomorrow -</p>\n\n<p>1) The Chinese stock market will open after 2 days of holiday. Everyone is expecting a major crash here</p>\n\n<p>2) Evergrande is expected to default on its loan payment, the same debt which Blackrock owns quite a big bag of, sending out a potential ripple effect</p>\n\n<p>3) Sources out of Beijing say that the CCP are unlikely to bail Evergrande out (this point is just speculation)</p>\n\n<p>So in conclusion, there are bigger dips coming.</p>\n\n<p>Edit: When I wrote this, BTC was at $42k and ETH was at $3k, they’ve now dipped to 40K and 2.7K.</p>\n</div><!-- SC_ON -->",
  "score": 653,
  "permalink": "/r/CryptoCurrency/comments/psoty7/the_evergrande_crisis_isnt_fud_get_ready_for_big/",
  "subreddit": "CryptoCurrency",
  "id": "psoty7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The Evergrande crash has so far caused a decline of 10-15% in the cryptocurrency\nmarket, and while many might buy the dip right now I’d suggest waiting for\ntomorrow’s even bigger crash\n\nWhy crypto (and other markets) will crash tomorrow -\n\n1) The Chinese stock market will open after 2 days of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Evergrandeのクラッシュは、これまでに暗号通貨市場で10～15％の下落を引き起こしました。\n多くの人が今すぐに購入するかもしれませんが、私は、このような状況になるのを待つことをお勧めします。\n明日のさらに大きな暴落を待つことをお勧めします\n\n明日、暗号（およびその他の市場）が暴落する理由-。\n\n1) 中国の株式市場は2日ぶりに開かれます...",
      "title": "エバーグランデ・クライシスはFUDではない、来週の大きなディップに備えよう"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "到目前为止，恒大崩盘已经导致加密货币下跌了10-15%。\n市场，虽然许多人可能现在就买入下跌的股票，但我建议等待明天更大的暴跌。\n明天更大规模的崩溃\n\n\n\n1）中国股市将在2天后开...",
      "title": "恒大危机不是FUD，下周准备好大跌吧"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "到目前爲止，恆大崩盤已經導致加密貨幣下跌了10-15%。\n市場，雖然許多人可能現在就買入下跌的股票，但我建議等待明天更大的暴跌。\n明天更大規模的崩潰\n\n\n\n1）中國股市將在2天后開...",
      "title": "恆大危機不是FUD，下週準備好大跌吧"
    }
  ]
}