{
  "author": "Jlg5314",
  "the_new_excerpt": "I've noticed Josh Hawley in the news as the lone vote against a couple of widely\nsupported bipartisan bills like the Hate Crimes Bill which passed 94-1, him\nbeing the only nay vote.\n\nI've heard the rumors of Hawley running for President in 2024, so I get that\nhe's trying to be an outlier in the…",
  "original_created_utc": 1619445610,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、Josh Hawleyが、94対1で可決されたヘイトクライム法案のような、広く支持された超党派の法案に反対した唯一の投票者としてニュースに登場したことに注目しました。\n例えば、94対1で可決された「ヘイトクライム法案」のように、広く支持されている超党派の法案に反対した一人として、ニュースに取り上げられています。\n彼は唯一の反対票でした。\n\n2024年の大統領選にHawley氏が出馬するという噂を聞いたことがありますが、それはわかります。\n彼はこの業界では異例の存在になろうとしています。",
      "title": "Josh Hawley氏のような共和党員がオーバルオフィスを目指す背景には、どのような政治的戦略があるのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我注意到新闻中的乔什-霍利是唯一一个投票反对几项广泛支持的两党法案的人。\n在新闻中，乔希-霍利是唯一一个反对两党共同支持的法案的人，如仇恨犯罪法案，该法案以94:1通过，他是唯一的反对票。\n他是唯一的反对票。\n\n我听说过霍利将于2024年竞选总统的传闻，所以我明白\n他想成为一个异类，在......",
      "title": "像乔什-霍利这样的共和党人瞄准椭圆办公室的政治策略是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我注意到新聞中的喬什-霍利是唯一一個投票反對幾項廣泛支持的兩黨法案的人。\n在新聞中，喬希-霍利是唯一一個反對兩黨共同支持的法案的人，如仇恨犯罪法案，該法案以94:1通過，他是唯一的反對票。\n他是唯一的反對票。\n\n我聽說過霍利將於2024年競選總統的傳聞，所以我明白\n他想成爲一個異類，在......",
      "title": "像喬什-霍利這樣的共和黨人瞄準橢圓辦公室的政治策略是什麼？"
    }
  ],
  "title": "What is the political strategy behind Republicans like Josh Hawley aiming for the Oval Office?",
  "created_utc": 1619531344,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve noticed Josh Hawley in the news as the lone vote against a couple of widely supported bipartisan bills like the Hate Crimes Bill which passed 94-1, him being the only nay vote.</p>\n\n<p>I&#39;ve heard the rumors of Hawley running for President in 2024, so I get that he&#39;s trying to be an outlier in the Republican Party-something Trump supporters like. However, it seems like a double-edged sword trying to drum up support from Trump voters, which, in turn, will only be seen as a re-election threat by Trump. Trump will then attack accordingly, turning his base against his republican opponents.</p>\n\n<p>It is the Trump party now, so why even think about challenging the leader himself? Do these republicans really think they&#39;ll be able to step into his shoes and take over his entire base? What is their end game here?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/Ask_Politics/comments/myybff/what_is_the_political_strategy_behind_republicans/",
  "subreddit": "Ask_Politics",
  "id": "myybff",
  "is_self": true,
  "media": null,
  "is_video": false
}