{
  "author": "foreverexistential96",
  "the_new_excerpt": "Please realize that no amount of money is worth losing your life over. If you’re\nfeeling stuck, I promise you there’s a way out. Ask yourself: what do you like\nto do? Do you like people? Look for a sales job and work your way up. Do you\nlike traveling? Try and save some money, move to Latin America…",
  "original_created_utc": 1614860644,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "请意识到，没有多少钱是值得你为之丧命的。如果你是\n感觉被卡住了，我向你保证有一条出路。问问自己：你喜欢什么\n做什么？你喜欢人吗？找一份销售的工作，然后努力往上爬。你是否\n喜欢旅游吗？试着省点钱，去拉丁美洲... ...",
      "title": "致刚刚发帖说有自杀念头的人（或其他感到沮丧的人）。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "請意識到，沒有多少錢是值得你爲之喪命的。如果你是\n感覺被卡住了，我向你保證有一條出路。問問自己：你喜歡什麼\n做什麼？你喜歡人嗎？找一份銷售的工作，然後努力往上爬。你是否\n喜歡旅遊嗎？試着省點錢，去拉丁美洲... ...",
      "title": "致剛剛發帖說有自殺念頭的人（或其他感到沮喪的人）。"
    }
  ],
  "title": "To whoever just posted about having suicidal thoughts (or to anyone else feeling down)",
  "created_utc": 1614864313,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Please realize that no amount of money is worth losing your life over. If you’re feeling stuck, I promise you there’s a way out. Ask yourself: what do you like to do? Do you like people? Look for a sales job and work your way up. Do you like traveling? Try and save some money, move to Latin America and teach kids English while living in a much more affordable tropical place. Feeling isolated? Reach out to one person who you would be happy to talk to. There are always solutions. </p>\n\n<p>I know it’s easy to feel isolated, especially now. But I love each and every one of you, and I don’t even have to know you personally because you are all my brothers and sisters from a cosmic perspective. </p>\n\n<p>If anyone is feeling down, please DM me and id be happy to chat. No one should suffer alone.</p>\n</div><!-- SC_ON -->",
  "score": 14438,
  "permalink": "/r/stocks/comments/lxjb9x/to_whoever_just_posted_about_having_suicidal/",
  "subreddit": "stocks",
  "id": "lxjb9x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542575854
}