{
  "author": "Wishy_washy_Though",
  "original_created_utc": 1629946189,
  "title": "In regards to all the hacking that's happening with Coinbase accounts.",
  "created_utc": 1629974488,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m sure everyone has read about all the lawsuits and complaints about Coinbase customers being hacked for everything they have. This is absolutely horrible and I&#39;m sure it&#39;s a worst nightmare scenario for everyone reading this, myself included. Unlike a bank account, these transactions are not reversible and there is literally nothing you can do to recoup your crypto. I read one story tonight, where a lady lost 160k in Bitcoin and Eth.\nI figured I would write this to inform some of the newer investors whom might not realize there are additional steps you can take to secure your Coinbase account and insure this never happens to you. The feature is address whistling, I know many think this feature is a pain, especially those who frequently send crypto to different address, but for those of you that don&#39;t, I would definitely enable it on Coinbase. Once enabled, you can only send crypto to addresses you&#39;ve OKed and it takes 72 hours to add a new address, this stops bad guys from draining your account in seconds. This way, if they try to add an address, you&#39;ll be notified and have 72 hours to completely disable and secure your account.</p>\n\n<p>Here&#39;s some of the safety features address whistling adds to your account...</p>\n\n<p>There are two hold periods: one for enabling Whitelisting, and one for disabling Whitelisting. This is to add security to your account and to guard against unauthorized activity</p>\n\n<p>When you first enable Whitelisting:</p>\n\n<p>All addresses already saved in your Address Book will be immediately whitelisted</p>\n\n<p>You will have an 8-hour window after first enabling the feature in which you can add new addresses to your Address Book that you can use immediately</p>\n\n<p>During the initial 8-hour window, you can also disable whitelisting instantly</p>\n\n<p>After the initial 8 hour window:</p>\n\n<p>Any new address you want to add to your Address Book must go through a 48-hour hold period for security before it is fully whitelisted and available for withdrawals</p>\n\n<p>To disable Whitelisting:</p>\n\n<p>Switch the toggle to disable whitelisting</p>\n\n<p>There will be a 48-hour hold period before Whitelisting is disabled in which Whitelisting is still enabled </p>\n\n<p>Important Note: The 48-hour hold period only applies to address use and does not apply to your cryptocurrency. You can still buy, sell, or withdraw fiat to addresses already whitelisted.</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/CryptoCurrency/comments/pbqnag/in_regards_to_all_the_hacking_thats_happening/",
  "subreddit": "CryptoCurrency",
  "id": "pbqnag",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm sure everyone has read about all the lawsuits and complaints about Coinbase\ncustomers being hacked for everything they have. This is absolutely horrible and\nI'm sure it's a worst nightmare scenario for everyone reading this, myself\nincluded. Unlike a bank account, these transactions are not…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "誰もがCoinbaseに関するすべての訴訟や苦情について読んだことがあると思います。\nのお客さまがハッキングされているという訴訟や苦情を読んだことがあると思います。これは絶対に恐ろしいことですし\n私も含め、これを読んでいる皆さんにとっては最悪の悪夢のようなシナリオだと思います。\n私も含めて。銀行口座とは異なり、これらの取引は、...",
      "title": "コインベースのアカウントで起きているハッキングについて。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我相信每个人都读过关于Coinbase的所有诉讼和投诉。\n的客户被黑客攻击，他们拥有的一切。这绝对是可怕的，而且\n我相信这对每一个读到这篇文章的人来说都是最糟糕的噩梦，包括我自己。\n包括我自己。与银行账户不同，这些交易是不...",
      "title": "关于所有发生在Coinbase账户上的黑客行为。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我相信每個人都讀過關於Coinbase的所有訴訟和投訴。\n的客戶被黑客攻擊，他們擁有的一切。這絕對是可怕的，而且\n我相信這對每一個讀到這篇文章的人來說都是最糟糕的噩夢，包括我自己。\n包括我自己。與銀行賬戶不同，這些交易是不...",
      "title": "關於所有發生在Coinbase賬戶上的黑客行爲。"
    }
  ]
}