{
  "author": "wanderingwomensitems",
  "original_created_utc": 1638811814,
  "title": "Looking to try DeFi? Let me share my experience.",
  "created_utc": 1638845527,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey guys, last month I set out with about 500$ and wanted to try out a bunch of defi options to learn and experience first hand what’s out there. It’s easier for me to feel comfortable putting real buying power behind something I have used and understand. I’m going to outline how it went for me personally. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;im not here to hate on your beloved coin or ecosystem just an honest account of my experience&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;BNB / ETH / Pancake swap&lt;/strong&gt; I started here. To be honest I have to take in account it was my first and had a large learning curve. I first had to set up a wallet, move crypto around and swap tokens to get into a pool and farm. I managed to do it but the fees felt high to me for a small guy. Returns are still there apy is still very high in financial standards. Wasn’t my favorite but it was my launch point. Fees are difficult to recommend them as a good learning option. This is better for bigger money. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Algo / Yieldly&lt;/strong&gt; this was my second. Let me be clear, I have a large bag in both algo and yieldly now, that being said wow! If you want to learn DeFi please take this tiny bit of advice and start here even if it’s 2$ worth. The ease of the ecosystem, the speed, the looks and feel everything felt seamless. Not messing with custom nets just easy. Set up a algo wallet, swap some coins on tinyman and set them in yieldly. The no loss lottery, the automatic staking in the wallet plus governance. Lots to do and easy to do it. It’s my morning routine now to compound my yieldly stake. Guys love them or hate them Algo is the place to learn how it all works! &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;one/bnb / Mochi&lt;/strong&gt; this was a fun little gamble just to start out the wild apy chasing. Got in with relative ease and learned a good amount doing it. Would I recommend it absolutely not haha. Was it fun and a learning opportunity yes! These kinds of projects taught me to watch the coin closely look for when they started and beware of the start up pump and dumps. Overall decent experience. This did teach me Lp tokens and custom nets. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Sol / raydium&lt;/strong&gt; I had some sol sitting and thought I would give some one a go. The raydium / phantom looked sleek enough and prices looked stable(ish) overall I found the phantom system easy to use and I’ve been happy with the system. I would say comparable to algo in some ways but lacking the added bonuses algo has. Recommend giving it a look. I also believe they were likely the better option for learning lp tokens. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;one / viper&lt;/strong&gt; again I had some one and also wanted to get a little Roy. I’ve been ok with the viper system but honestly they can be very confusing. It’s difficult to keep track of things and I am weary of a rug pull vibe. Idk if I would recommend the defi options but they are useful in the swap options. I’m still in but not even sure I’m fully understanding everything going on. It’s a “meh” from me.  &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;one / wagmi&lt;/strong&gt; guys this one is out there. All I can say is 800,000+% apy I threw 20$ in. I’m happy. It was easy. But deff not something I could feasibly “recommend” &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;one / harmony one&lt;/strong&gt; staking directly. I would say moderately easy. Platform is wildly just ok. I have some connectivity issues here and there. Is it doing what it says sure. Am I stoked not wildly. It’s there and it works. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Ada / Yoroi&lt;/strong&gt; I would same very similar to above. It’s there, it works, it does what it says. Nothing to really say other than that. Relatively easy.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;VVS&lt;/strong&gt; ok I have a large bag of CRO. My plan was to take some early yield profits on this guy. Relatively easy. Goofy names and graphics takes a lot of hate for early roller coaster but honestly turned out more stable than I expected. Would I recommend nah I think the risk is massive. Easy to use kinda. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Cro / CDC defi wallet&lt;/strong&gt; if you have extra CRO I would cautiously use it. 13% isn’t bad! Decently easy, it’s ability to link with cdc account makes ease of use up there with algo. They do however have lots of options. It would be wise to learn how to pick good staking services before getting caught in a Defi scam somehow. Don’t love the unbonding time but accepted it. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Atom / keplr&lt;/strong&gt; short and sweet very similar to how cdc defi wallet is. I don’t love it I don’t hate it. Does what it says. Fees are there not outrageous. Don’t love the look. Decently easy. Don’t love the unbonding times. Accept them. &lt;/p&gt;\n\n&lt;p&gt;TLDR; honest opinion, if your looking to learn how to navigate the DeFi world I highly highly recommend you use algo first. It will set you up with an easy key to success in learning how they work. Know one you can figure out the rest. Do your self a favor, start with the easiest one first. Even if you leave! They are the least overwhelming option I have found! &lt;/p&gt;\n\n&lt;p&gt;No I’m not elegant, just wanted to share my experiences. &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;obligatory safety tips&lt;/em&gt; always secure seeds, always use 2fa app. Use crypto specific emails. No sms! Only invest what you are comfortable to loose.&lt;/p&gt;\n\n&lt;p&gt;Edit: added platform to underlying token was not specific at first.&lt;/p&gt;\n\n&lt;p&gt;Edit2: this is about where I think is a good place to learn and take the first step not who I think you should invest in. We all had to learn the foundation of setting up wallets. Connecting those wallets to dapps. Swaping tokens. Staking. Yieldly does this, best,  the least overwhelming. Want to go further check out others learn making lp tokens. Lending and so on. This is about fundamentals past custodial hold.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 152,
  "permalink": "/r/CryptoCurrency/comments/raco7l/looking_to_try_defi_let_me_share_my_experience/",
  "subreddit": "CryptoCurrency",
  "id": "raco7l",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hey guys, last month I set out with about 500$ and wanted to try out a bunch of\ndefi options to learn and experience first hand what’s out there. It’s easier\nfor me to feel comfortable putting real buying power behind something I have\nused and understand. I’m going to outline how it went for me…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "先月、500ドルほど持って、いろいろと試してみようと思い立ちました。\nデフィのオプションは、どんなものがあるのか、実際に体験して学ぶことができます。その方が\nを買ったことがあるものであれば、安心して購入することができます。\n使用し、理解している。私の場合、どうだったかというと...。",
      "title": "DeFiを試してみませんか？私の経験をシェアさせてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嘿，伙计们，上个月我带了大约500美元，想尝试一些防卫方案。\n的选择，以学习和亲身体验那里的情况。这更容易\n对我来说，把真正的购买力放在我已经用过和了解的东西后面更容易感到舒服。\n使用和理解的东西。我将概述一下我的情况......",
      "title": "想试试DeFi吗？让我分享我的经验。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嘿，夥計們，上個月我帶了大約500美元，想嘗試一些防衛方案。\n的選擇，以學習和親身體驗那裏的情況。這更容易\n對我來說，把真正的購買力放在我已經用過和了解的東西后面更容易感到舒服。\n使用和理解的東西。我將概述一下我的情況......",
      "title": "想試試DeFi嗎？讓我分享我的經驗。"
    }
  ]
}