{
  "author": "SeonM",
  "the_new_excerpt": "I live in Ireland and the British media has been known to cover up what happens\nhere on news to other countries. Growing up here I have experienced a lot of\nstuff that the Normal person wouldn’t. Most people don’t know that Northern\nIreland is the terrorist capitol of Europe and I never hear anyone…",
  "original_created_utc": 1618792116,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はアイルランドに住んでいますが、イギリスのメディアはここで起こったことを隠蔽して他国にニュースを流すことで知られています。\nイギリスのメディアは、アイルランドで起こったことを隠蔽して他国に伝えることで知られています。ここで育った私は、普通の人では経験できないようなことをたくさん経験してきました。\nここで育った私は、普通の人が経験しないようなことをたくさん経験してきました。ほとんどの人は、北アイルランドがテロの中心地であることを知りません。\n北アイルランドがヨーロッパのテロの中心地であることをほとんどの人は知りませんし、私は誰も聞いたことがありません。",
      "title": "私はアイルランドに住んでいますが、世界の他の国々はここで起こっていることに気づかないのではないかと思っています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我住在爱尔兰，英国媒体一直都在掩盖发生的事情。\n这里对其他国家的新闻。在这里长大的我，经历了很多。\n的东西，正常人不会。大多数人不知道，北\n爱尔兰是欧洲的恐怖分子之都，但我从来没有听到有人...",
      "title": "我住在爱尔兰，我想知道世界其他地方是否对这里发生的事情视而不见。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我住在愛爾蘭，英國媒體一直都在掩蓋發生的事情。\n這裏對其他國家的新聞。在這裏長大的我，經歷了很多。\n的東西，正常人不會。大多數人不知道，北\n愛爾蘭是歐洲的恐怖分子之都，但我從來沒有聽到有人...",
      "title": "我住在愛爾蘭，我想知道世界其他地方是否對這裏發生的事情視而不見。"
    }
  ],
  "title": "I live in Ireland and am wondering if the rest of the world is oblivious to what goes on here",
  "created_utc": 1618802047,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I live in Ireland and the British media has been known to cover up what happens here on news to other countries. Growing up here I have experienced a lot of stuff that the Normal person wouldn’t. Most people don’t know that Northern Ireland is the terrorist capitol of Europe and I never hear anyone talking about the stuff going on here except on local news. For anyone outside here, does the media silence this or am I just unaware of this?</p>\n</div><!-- SC_ON -->",
  "score": 170,
  "permalink": "/r/NoStupidQuestions/comments/mtp6w0/i_live_in_ireland_and_am_wondering_if_the_rest_of/",
  "subreddit": "NoStupidQuestions",
  "id": "mtp6w0",
  "is_self": true,
  "media": null,
  "is_video": false
}