{
  "author": "Main-Feature1533",
  "the_new_excerpt": "Introduction\n\nHi everyone. I wanted to do this writeup to talk about an exciting stock I’m\nheavily invested in. First, a disclaimer: I’m not an expert, I have a position\nand may add or sell, and you should do your own DD! With that out of the way\nlet’s talk about Agrify.\n\nMany successful stocks take…",
  "original_created_utc": 1620996603,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "はじめに\n\n皆さん、こんにちは。この記事では、私が多額の投資をしているエキサイティングな銘柄についてお話したいと思いました。\nこの記事では、私が多額の投資をしているエキサイティングな銘柄についてお話したいと思います。まず免責事項：私は専門家ではなく、ポジションを持っています。\n私は専門家ではなく、ポジションを持っており、追加や売却をする可能性があります。それはさておき\nAgrifyについて話しましょう。\n\n多くの成功した銘柄は...",
      "title": "$AGFY DD: セクター全体の弱さが、大麻株を風呂敷で覆ってしまった。マルチバガーの可能性あり（DD参照"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "简介\n\n大家好。我想写这篇报道，谈谈我正在大力投资的一只令人兴奋的股票。\n重金投资的股票。首先，免责声明：我不是一个专家，我有一个位置\n并可能增加或卖出，你应该做你自己的DD! 既然如此\n让我们来谈谈Agrify。\n\n许多成功的股票都需要...",
      "title": "$AGFY DD：整个行业的疲软已经把一只拿着铲子的大麻股票和洗澡水一起扔了出去。潜在的多重投资机会（见DD）。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "簡介\n\n大家好。我想寫這篇報道，談談我正在大力投資的一隻令人興奮的股票。\n重金投資的股票。首先，免責聲明：我不是一個專家，我有一個位置\n並可能增加或賣出，你應該做你自己的DD! 既然如此\n讓我們來談談Agrify。\n\n許多成功的股票都需要...",
      "title": "$AGFY DD：整個行業的疲軟已經把一隻拿着鏟子的大麻股票和洗澡水一起扔了出去。潛在的多重投資機會（見DD）。"
    }
  ],
  "title": "$AGFY DD: Sector-wide weakness has tossed a pick-and-shovel cannabis stock out with the bathwater. Multi-bagger potential (see DD)",
  "created_utc": 1621000391,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Introduction</strong></p>\n\n<p>Hi everyone. I wanted to do this writeup to talk about an exciting stock I’m heavily invested in. First, a disclaimer: I’m not an expert, I have a position and may add or sell, and you should do your own DD! With that out of the way let’s talk about Agrify.</p>\n\n<p>Many successful stocks take a “picks and shovels” approach. The term comes from the 1849 California gold rush, where the most successful entrepreneurs were not miners (too much competition), but rather those supplying miners with the tools they needed to be successful. </p>\n\n<p>For the recreational and medicinal cannabis gold rush, similar tools are needed. Agrify supplies them. Agrify develops precision hardware and proprietary software for the indoor agriculture industry—which predominantly refers to growing cannabis. Here are examples of the sorts of products it produces (<a href=\"https://www.bamsec.com/filing/121390021019992?cik=1800637\">taken from the 10-K</a>).</p>\n\n<p><strong>Problem Solved</strong></p>\n\n<p>The value proposition of these products is not just that they are high quality, but that they create an extremely controlled and productive environment for growing cannabis. This is important for two reasons:</p>\n\n<ol>\n<li>Cannabis products vary wildly in quality, creating bad batches and uncertain doses\n\n<ol>\n<li>Analysis shows wide variations in THC <a href=\"https://www.analyticalcannabis.com/articles/cannabis-infused-edibles-analysis-reveals-inaccurate-unreliable-labeling-305359\">content</a></li>\n<li>Labeling requirements vary by <a href=\"https://www.leafly.com/news/industry/a-state-by-state-guide-to-cannabis-packaging-and-labeling-laws#:%7E:text=Labeling%20of%20Medical%20Marijuana%20Infused,information%20required%20by%20this%20rule.\">state</a></li>\n</ol></li>\n<li>Cannabis companies need to maximize every inch of available space in order to achieve maximum economic success</li>\n</ol>\n\n<p>Please note that I don’t introduce the above factors to knock the promise of cannabis. Rather, I’m trying to demonstrate that this is still an emerging industry, with opportunities for those who are able to commoditize and regularize production. To hear more, listen to the CEO of Agrify in <a href=\"https://www.youtube.com/watch?v=ToF7RdL5S4A\">this</a> recent interview around 2:40. He more eloquently summarizes the above issues and discusses how Agrify solves them. </p>\n\n<p>Of course, none of this matters if the economic incentive doesn’t exist to utilize the Agrify insights and hardware platform. But the numbers are quite telling. I can&#39;t link them cus <a href=\"/r/investing\">r/investing</a> rules, but essentially they allow for a 30-50% reduction in investment payback period, depending on who you compare to.</p>\n\n<p>Essentially, the improved productivity from Agrify systems allows for a short payback period for cannabis start-ups, or expansion from existing players. This is why the company is so cool—they aren’t just selling picks and shovels, they’re <em>financing</em> the gold expeditions. Agrify will, of course, simply sell products or work with you to install them, but they’ll also operate as financiers, knowing that they’re dollars are going to be repaid through superior production and quality.</p>\n\n<p>There’s a lot more to talk about, but I’d encourage you to watch the CEO interviews to get a better idea. Now, let’s look at the financials of the company.</p>\n\n<p><strong>Financials</strong></p>\n\n<p>Obviously, none of the above matters if the company isn’t solid financially. In the case of a high-growth early stage company like Agrify, the main concerns for me are 1) can they continue operations and 2) what is their cash burn? Taken together, a lot of the potential value for shareholders can be understood.</p>\n\n<p>When a company cannot continue operating because they’re burning too much cash, they eventually have to conduct an equity offering to fund operations, diluting shareholders and cheapening the stock. In Agrify’s case, I don’t expect we’ll see this for a long time. Recently, the company conducted a <a href=\"https://www.bamsec.com/filing/121390021010582?cik=1800637\">$75 million equity raise</a>, which is in addition to an upsize of <a href=\"https://www.globenewswire.com/news-release/2021/01/28/2165444/0/en/Agrify-Corporation-Announces-Pricing-of-Upsized-54-Million-Initial-Public-Offering.html\">$54 million</a> from an over allotment at IPO. </p>\n\n<p>The thesis is extremely simple. Basically, the company is sitting at $135 <em>million</em> in cash at a market cap of $140 million. The market is implicitly saying that the company is “worth” less than the value of their debt + equity value ex cash, which equates to around $35 million. I find that absolutely comical, given the following:</p>\n\n<ol>\n<li><a href=\"https://www.globenewswire.com/news-release/2021/04/05/2204180/0/en/Agrify-Announces-Receipt-of-3-5M-Purchase-Contract-Expanding-Customer-Relationship-with-WhiteCloud-Botanicals.html\">$3.5 million contract</a></li>\n<li><a href=\"https://www.globenewswire.com/news-release/2021/05/13/2228985/0/en/Agrify-Announces-Definitive-Agreement-with-Current-Customer-Greenstone-to-Complete-Construction-of-Colorado-Facility.html\">$11 million contract with potential to upsize to $37 million</a></li>\n<li><a href=\"https://www.yahoo.com/lifestyle/agrify-announces-first-total-turn-110000464.html\">$28 million (est.) PER ANNUM contract</a></li>\n</ol>\n\n<p>These were announced in the last two months alone. These alone far surpass any revenue estimates, and revenue already is growing 140%+ YoY. The company is absurdly cheap in my opinion. Assuming the numbers are somewhat correct, you’re looking at a P/S ratio of around 6! </p>\n\n<p>Before the sector got hit, $AGFY traded at a market cap of $400 million at one point. It’s decline has been drastic and seems unrelated to the actual performance of the business (more on that later).</p>\n\n<p><strong>Management</strong></p>\n\n<p>I’m mostly familiar with the CEO, but other management seem competent. You can check them out <a href=\"https://ir.agrify.com/corporate-governance/management\">here</a>. But really, CEO Raymond Chang is the star here. Just look at his LinkedIn page which is searchable, it’s ridiculous. He&#39;s founded over 3 $150 million + companies, sold one for $160 million, and been the CEO of <em>another</em> company with a current market cap of $700 million plus.</p>\n\n<p><strong>Market Conditions / Catalysts</strong></p>\n\n<p>So why hasn’t the stock price appreciated with all of the above developments? Largely for two reasons. First, the entire sector has undergone a drastic decline in what essentially seems to be a “buy the rumor, sell the news” event post-election. This wasn’t helped by an association with cannabis stocks and “speculative” stocks; speculative stocks have been getting crushed since early March.</p>\n\n<p>Of course, there have been upticks here and there, largely when something seems favorable for national legalization. But largely, everythings declining, as can be seen by looking at the chart for THCX, a cannabis ETF.</p>\n\n<p>But while THCX has halved, AGFY has gone down around 66% since peak! This brings me to the other reason it’s so disfavored: there’s simply very little knowledge about the company. The company has a mere 805 followers on ST, and is barely discussed on Twitter. I’ve never really seen a post on <a href=\"/r/weedstocks\">r/weedstocks</a> about it. Further, analysts also don’t seem concerned with the stock, so the market as a whole doesn’t pay much attention to it. </p>\n\n<p>However, this brings us to the catalysts for the stock:</p>\n\n<ol>\n<li>Earnings. The company reports earnings on 5/17, and I expect them to be quite excellent. Keep in mind that $HYFM, a comparable company, reported strong earnings today and popped 8% (at time of writing). </li>\n<li>Market sentiment reversal. This could occur through a general bull-run, or, more likely, through a cannabis specific catalyst, like federal focus on legalization, banking changes, etc.</li>\n<li>As Michael Burry says, sheer outrageous value. The stock has become so undervalued, at some point sentiment may change.</li>\n<li>Market recognition. The main reason that the stock is so cheap, in my opinion, is that no one pays attention to it. </li>\n<li>Given the potentially favorable r/R, I could anticipate large insider buying post IPO lock-up period, which will draw more eyes and support the stock price.</li>\n</ol>\n\n<p>While not necessarily a catalyst, I’d also like to point out the universal institutional buying. I don’t think we’ve seen a sale yet! You can scroll through the Whalewisdom page to see more of the same.</p>\n\n<p><strong>Risk Factors</strong></p>\n\n<p>Now, there are several risk factors. First, the market can remain irrational longer than you can remain solvent. Weed stocks <em>are</em> out of favor, and have been absolutely tanking, even on great news. This is compounded by a lack of discrete, dated catalysts on the horizon. I don’t know—and I don’t know if anyone <em>can</em> know—when this will change.</p>\n\n<p>Second, some of the practices of the company worry me. The PR is quite awful; it seems that the CEO only recently has really started getting out and about and giving interviews. This is an area that the company must improve. Further, the fact that the company filed late for 2020 is a bad look. It’s not necessarily a bright red flag to me, given the market craziness and the recency of the IPO, but seeing such behavior again would give me pause.</p>\n\n<p>Finally, the company could undergo further market cap depreciation, causing a drop below $100 million. This is bad, since it limits the type of investor who can purchase shares. For instance, if the company becomes too small for institutions, then it’ll be even more out of favor. </p>\n\n<p>Finally, there are competitors like GrowGen, HYFM, etc. Personally, I think the AGFY tech and value prop. compares favorably, especially considering these other companies haven’t been as hard-hit by the sector-wide decline. But who knows—you should do the research yourself! At least watch a CEO interview.</p>\n\n<p><strong>Summary</strong></p>\n\n<p>Agrify or $AGFY is undervalued. They’ve recently announced contracts that in theory blow sales estimates out of the water. Through an offering and an IPO over allotment they have something like $130 million in cash on the balance sheet with a market cap of $140 million, down from a peak of $400 million. </p>\n\n<p>All this has occurred largely because of sector wide weakness. This seems unfair to me. Earnings are upcoming and I hope that will change the story.</p>\n\n<p>Long.</p>\n</div><!-- SC_ON -->",
  "score": 226,
  "permalink": "/r/investing/comments/nc7ui9/agfy_dd_sectorwide_weakness_has_tossed_a/",
  "subreddit": "investing",
  "id": "nc7ui9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590802237
}