{
  "author": "Responsible_Pen_8804",
  "original_created_utc": 1652962233,
  "title": "Is it okay to want a housewife?",
  "created_utc": 1652977421,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I just want a wife that has no ambitions beyond being a good mother and wife. Now I understand how this might be construed as me trying to undermine womens progress but I promise I DO NOT think all women should be like this. Everyone regardless of gender should be able to chase whatever ambitions they have. I just want a woman that WANTS to be like this. I just want her to take care of the house and children, to be at home everyday after work so we can hangout all day and raise our kids. Everytime I say this is what I want women get really infuriated and tell me I’m just a sexist pig that wants a handmaiden. This simply isn’t true. Am I still wrong for wanting this future?&lt;/p&gt;\n\n&lt;p&gt;Edit: to all who commented or dmed with great advice, perspective and stories of their experiences wether they were good or bad thank you. I really mean it. As to all of you who have shamed others or trying to push an agenda on both sides should go to bed tonight with great shame. This is obviously a big hot button topic that intersects with religion, culture, sexuality and very personal events. I won’t comment on here anymore because I feel like I’m in a echo chamber but you can look at my other comments to see more details. I look forward to reading every single comment as I have been and will continue to, this has been eye opening and honestly a bit of fun listening to different stories and perspectives and for that I thank you. Dms are still open if you don’t feel comfortable commenting here but I won’t guarantee a reply.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 136,
  "permalink": "/r/TooAfraidToAsk/comments/ut20fn/is_it_okay_to_want_a_housewife/",
  "subreddit": "TooAfraidToAsk",
  "id": "ut20fn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I just want a wife that has no ambitions beyond being a good mother and wife.\nNow I understand how this might be construed as me trying to undermine womens\nprogress but I promise I DO NOT think all women should be like this. Everyone\nregardless of gender should be able to chase whatever ambitions…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "良き母、良き妻であること以上の野望を持たない妻が欲しいだけだ。\n私が女性の進歩を阻害していると解釈されるかもしれないことは理解しています。\nしかし、私はすべての女性がこうであるべきだとは思っていないことを約束します。誰もが\n性別に関係なく、誰もがどんな野望でも追い求めることができるはずです...",
      "title": "専業主婦を希望するのはいいのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我只是想要一个没有野心的妻子，除了做一个好母亲和好妻子。\n现在我明白这可能被理解为我试图破坏妇女的进步。\n但我保证，我不认为所有女性都应该这样。每个人\n无论性别如何，都应该能够追逐任何雄心壮志......",
      "title": "想要一个家庭主妇可以吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我只是想要一個沒有野心的妻子，除了做一個好母親和好妻子。\n現在我明白這可能被理解爲我試圖破壞婦女的進步。\n但我保證，我不認爲所有女性都應該這樣。每個人\n無論性別如何，都應該能夠追逐任何雄心壯志......",
      "title": "想要一個家庭主婦可以嗎？"
    }
  ]
}