{
  "author": "TonyLiberty",
  "the_new_excerpt": "I feel this post was necessary due to all the people I saw on here recently\ntalking about money they lost.\n\n\n\nMy Guide on HOW TO ANALYZE & RESEARCH A STOCK/ How to do a thorough due\ndiligence/ DD [Due Diligence 101]:\n\n\n\nHere are the things I look at when evaluating a stock. (This is my…",
  "original_created_utc": 1613266253,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我觉得这个帖子很有必要，因为最近我在这里看到的所有的人。\n谈论他们失去的钱。\n\n\n\n我的指南：如何分析和研究一只股票/如何做一个彻底的应有之义。\n尽职调查/ DD [Due Diligence 101]。\n\n\n\n以下是我在评估股票时看的东西。(这是我的...",
      "title": "必须知道如何研究，分析和执行尽职调查的股票[尽职调查101]。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我覺得這個帖子很有必要，因爲最近我在這裏看到的所有的人。\n談論他們失去的錢。\n\n\n\n我的指南：如何分析和研究一隻股票/如何做一個徹底的應有之義。\n盡職調查/ DD [Due Diligence 101]。\n\n\n\n以下是我在評估股票時看的東西。(這是我的...",
      "title": "必須知道如何研究，分析和執行盡職調查的股票[盡職調查101]。"
    }
  ],
  "title": "MUST KNOW on how to research, analyze & perform due diligence on a stock [Due Diligence 101]:",
  "created_utc": 1613269749,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I feel this post was necessary due to all the people I saw on here recently talking about money they lost. </p>\n\n<p>&#x200B;</p>\n\n<p><strong>My Guide on HOW TO ANALYZE &amp; RESEARCH A STOCK/ How to do a thorough due diligence/ DD [Due Diligence 101]:</strong></p>\n\n<p>&#x200B;</p>\n\n<p>Here are the things I look at when evaluating a stock. (This is my checklist just build from years of wins &amp; losses, things I learned from Pace University and Goldman Sachs). Usually a good due diligence (DD)/ research can take anywhere from 30 minutes to 3 hours. If I am investing large amounts of cash, I want to research thoroughly, so if the stock drops I can stick to my convictions, and forget about emotion.</p>\n\n<p>&#x200B;</p>\n\n<p>Before I use my time to research a stock, and read up about it into detail, and dig into the financials, news, 10-Q/ 10-K, etc., I:</p>\n\n<ol>\n<li>I look at <strong>price upside</strong>. I look to see what the analysts covering it, have to say about the price targets. (Money is a tool, and you want it to work for you). MarketBeat.com can show you this: <a href=\"https://www.marketbeat.com/stocks/NASDAQ/AAPL/price-target\">https://www.marketbeat.com/stocks/NASDAQ/AAPL/price-targe</a>t/</li>\n</ol>\n\n<p>&#x200B;</p>\n\n<ol>\n<li>I look at the <strong>charts and the technicals</strong>. I try to read and interpret the charts to see what previous trading patterns can predict. What are the short-term, mid-term and long-term predictions? A site you can use to interpret the charts for you is BarChart.com and TradingView.com.</li>\n</ol>\n\n<p><a href=\"https://www.barchart.com/stocks/quotes/AAPL/opinion\">https://www.barchart.com/stocks/quotes/AAPL/opinion</a></p>\n\n<p><a href=\"https://www.tradingview.com/symbols/NASDAQ-AAPL/technicals/\">https://www.tradingview.com/symbols/NASDAQ-AAPL/technicals/</a></p>\n\n<p>&#x200B;</p>\n\n<p><strong>If it passes these, then I dig deeper.</strong></p>\n\n<p>&#x200B;</p>\n\n<p><strong>Other things I look at:</strong></p>\n\n<ol>\n<li>I dig deeper into <strong>technical analysis and the charts.</strong> I look at RSI, moving averages, MACD, Stochastic Oscillator, etc.</li>\n<li><strong>Sentiment &amp; News</strong>. What are people saying? Google the company.</li>\n<li><strong>Earnings &amp; revenue history.</strong> Is there growth? Is there potential? I look at the financials and the projections</li>\n<li><strong>Growth</strong>. I look into the financials to look at past growth. I look into news, 10Q&#39;s, 10Ks, investor presentations, and statements to look for future growth.</li>\n<li><strong>Financial health</strong>. Are the financials strong? (Quick ratio, Profit margin, EPS, Income Statement Trend, Cashflow).</li>\n<li><strong>Valuations</strong>. How is this valuated? (PEG ratio, P/E ratio)</li>\n<li><strong>Short selling.</strong> How much of this stock is sold short? Are people betting against it?</li>\n<li><strong>What is the put/call ratio?</strong> Are people betting against this stock?</li>\n<li><strong>Peers &amp; competition</strong>. How does this company stack up against its competitors and peers? How do the financials compare? How to the products compare? Is there a moat?</li>\n<li><strong>Institutional Sponsorship.</strong> Are big banks and wall street holding this? How much or this companys stock do they hold?</li>\n<li><strong>Insider Trading</strong>. Is the CEO buying or selling shares?</li>\n<li>The amount of <strong>ETFs</strong> that hold this stock. Will they continue to buy it up and drive price?</li>\n<li><strong>Average volume</strong> traded. Is this stock liquid? Would I be able to get my money back? How easy can I trade it.</li>\n<li><strong>Social sentiment</strong>. I check what people are saying on twitter and google search trends.</li>\n<li><strong>News moves a stock.</strong> So I also use google to find out as much as a company as possible.</li>\n</ol>\n\n<p>&#x200B;</p>\n\n<p>There are many sites you can use to dig into a stock such as (1) Yahoo Finance, (2) MarketBeat.com, (3) MacroTrends.com, (4) MarketWatch.com, (5) CNNMoney.com, (6) <a href=\"https://CNBC.com\">CNBC.com</a></p>\n\n<p>&#x200B;</p>\n\n<p>I use an excel spreadsheet to organize my research.</p>\n\n<p>&#x200B;</p>\n\n<p>As you see, good research and due diligence can take anywhere from 1 to 3 hours. But this is your money, and noone cares more about it than you do.</p>\n\n<p>&#x200B;</p>\n\n<p>I created a facebook group, discord, tiktok, instagram and youtube to share more things like this. Feel free to follow:</p>\n\n<p><a href=\"https://www.flowcode.com/page/fluentinfinance\">https://www.flowcode.com/page/fluentinfinance</a></p>\n</div><!-- SC_ON -->",
  "score": 545,
  "permalink": "/r/investing/comments/lje9qi/must_know_on_how_to_research_analyze_perform_due/",
  "subreddit": "investing",
  "id": "lje9qi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728621139
}