{
  "author": "industriousness",
  "the_new_excerpt": "Disclaimer: I'm relatively new to crypto, only getting into it around\nOctober/November of 2020. I was too young to get into it in 2009, 2013 or 2017.\nBut ever since I learned about dollar cost averaging, my life has profoundly\nchanged. I had worked different jobs before, sometimes part time,…",
  "original_created_utc": 1615338788,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "声明：我对加密技术比较陌生，只是在周围进入了\n2020年10月/11月。2009年、2013年、2017年，我都太年轻了，没能入手。\n但自从我了解了美元成本平均法后，我的生活就深刻地\n改变了。我以前做过不同的工作，有时是兼职，...",
      "title": "还有人发现，加密货币实际上帮助他们变得更有财务知识吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "聲明：我對加密技術比較陌生，只是在周圍進入了\n2020年10月/11月。2009年、2013年、2017年，我都太年輕了，沒能入手。\n但自從我瞭解了美元成本平均法後，我的生活就深刻地\n改變了。我以前做過不同的工作，有時是兼職，...",
      "title": "還有人發現，加密貨幣實際上幫助他們變得更有財務知識嗎？"
    }
  ],
  "title": "Does anyone else find that cryptocurrencies have actually helped them become more financially literate?",
  "created_utc": 1615351017,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Disclaimer: I&#39;m relatively new to crypto, only getting into it around October/November of 2020. I was too young to get into it in 2009, 2013 or 2017. But ever since I learned about dollar cost averaging, my life has profoundly changed. I had worked different jobs before, sometimes part time, sometimes full time, but last October I started a new job and with the money I earned from that I was able to invest in crypto. </p>\n\n<p>I realised today that not only has this money that I invested in BTC, ETH and then a few of the more dominant altcoins led to profits from me [albeit as of yet unrealised], but the money that I have dollar cost averaged this entire time, almost six months ago, is money that, prior to getting into cryptocurrency, when I was working other jobs and stuff, I would have simply spent on alcohol or clothes or whatever. For the first time in my life, this is the most money I have ever had to my name. And don&#39;t get me wrong, it&#39;s not a lot of money by most standards, but it&#39;s life changing or me to be able to see that discipline and restraint can lead to a fund that I can fall back on. Not only is crypto an investment for me, but it&#39;s also causing me to save money I would otherwise spend, and is making me more financially secure because of it.</p>\n\n<p>Just wondering if any of you have experienced the same thing?</p>\n</div><!-- SC_ON -->",
  "score": 1888,
  "permalink": "/r/CryptoCurrency/comments/m1llqx/does_anyone_else_find_that_cryptocurrencies_have/",
  "subreddit": "CryptoCurrency",
  "id": "m1llqx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542573521
}