{
  "author": "mrsbrownX",
  "the_new_excerpt": "Recently I was given a wake up call. My fiancé (whom I am marrying at the end of\nthis year) told me that he’s having second thoughts about whether he feels like\nI will be a good partner forever. The words hit me like a freight train. I have\nbeen so blind to how shitty of a partner I’ve been. On…",
  "original_created_utc": 1623151539,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、私は目を覚まされました。私の婚約者（今年の年末に結婚します）が\n今年の年末に結婚する）が、私が永遠に良いパートナーであると感じられるかどうか、考え直していると言ったのです。\n私は永遠に良いパートナーであり続けることができるのだろうか？その言葉は、貨物列車のように私を襲いました。私は今まで\n自分がどれだけひどいパートナーであったか、あまりにも見えていませんでした。それは...",
      "title": "人間関係の中で自分が毒になっていることに気づいたとき、どうしますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近我被叫醒了。我的未婚夫（我将在今年年底与他结婚）告诉我，他对自己是否觉得自己喜欢这个人有了新的想法。\n今年年底结婚）告诉我，他对自己是否觉得\n我是否会永远是个好伙伴。这句话像一列货运列车一样击中了我。我已经\n我对自己是一个多么糟糕的伴侣一直视而不见。在...",
      "title": "当你意识到自己是关系中的有毒者时，你会怎么做？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近我被叫醒了。我的未婚夫（我將在今年年底與他結婚）告訴我，他對自己是否覺得自己喜歡這個人有了新的想法。\n今年年底結婚）告訴我，他對自己是否覺得\n我是否會永遠是個好夥伴。這句話像一列貨運列車一樣擊中了我。我已經\n我對自己是一個多麼糟糕的伴侶一直視而不見。在...",
      "title": "當你意識到自己是關係中的有毒者時，你會怎麼做？"
    }
  ],
  "title": "What do you do when you realize you are the toxic one in the relationship?",
  "created_utc": 1623163451,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Recently I was given a wake up call. My fiancé (whom I am marrying at the end of this year) told me that he’s having second thoughts about whether he feels like I will be a good partner forever. The words hit me like a freight train. I have been so blind to how shitty of a partner I’ve been. On paper we seem perfect, and 75% of the time we truly are. But that other 25% of me being a mean drunk, impossibly stubborn, always on the defensive, never considering if I may actually be wrong in an argument, belittling and disrespecting him, unable to take criticism, and using a harsh tone towards my partner has built up and caused major fear and hesitation in the man I’m supposed to be marrying. And I’ve been blind to it all. Luckily and thankfully he is not saying he’s going to leave me (yet), but the fact that I’ve let it get this bad is terrifying and I am at a loss as to how to even begin fixing this. I’ve been told I gas light him and others, that I’m condescending and manipulative.... I am disgusted with myself and I need advice for how to fix this. Thank you for your time and support.</p>\n</div><!-- SC_ON -->",
  "score": 212,
  "permalink": "/r/TooAfraidToAsk/comments/nv1slj/what_do_you_do_when_you_realize_you_are_the_toxic/",
  "subreddit": "TooAfraidToAsk",
  "id": "nv1slj",
  "is_self": true,
  "media": null,
  "is_video": false
}