{
  "author": "Tattle_Tayler",
  "the_new_excerpt": "Obviously I'm American, most democratic countries at least pretend murder is\nbad. It's not that I don't care, it's that I'm aware nothing will be done about\nit in the foreseeable future, so every mass shooting is just \"oh, the deaths\naren't even double digits, that's not that bad. What should I have…",
  "original_created_utc": 1624196038,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "明らかに私はアメリカ人ですが、ほとんどの民主主義国では少なくとも殺人は悪いことだと思っています。\n悪いことだと思っています。私は気にしないのではなく、予見可能な未来に何もできないことを知っているのです。\n予測可能な未来には何もできないことを知っているから、大量殺人のたびに「ああ、死者は二桁にもなっていない。\n犠牲者は二桁にもなっていないし、そんなに悪いことではない。何をすればいいんだろう...。",
      "title": "最近のマス・シューティングは、恐ろしいというよりも疲れるという人が多いのではないでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "很明显，我是美国人，大多数民主国家至少会假装谋杀是\n坏。不是我不关心，而是我知道在可预见的未来不会有任何行动。\n所以每次大规模的枪击事件都是 \"哦，死亡人数还不到两位数。\n所以每次大规模枪击事件都只是 \"哦，死亡人数还不到两位数，这还不算太糟。我应该有什么...",
      "title": "还有人觉得这些天的大规模枪击事件比可怕的事情更令人疲惫吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "很明顯，我是美國人，大多數民主國家至少會假裝謀殺是\n壞。不是我不關心，而是我知道在可預見的未來不會有任何行動。\n所以每次大規模的槍擊事件都是 \"哦，死亡人數還不到兩位數。\n所以每次大規模槍擊事件都只是 \"哦，死亡人數還不到兩位數，這還不算太糟。我應該有什麼...",
      "title": "還有人覺得這些天的大規模槍擊事件比可怕的事情更令人疲憊嗎？"
    }
  ],
  "title": "Does anyone else find mass shooting more exhausting than horrifying these days?",
  "created_utc": 1624228738,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Obviously I&#39;m American, most democratic countries at least pretend murder is bad. It&#39;s not that I don&#39;t care, it&#39;s that I&#39;m aware nothing will be done about it in the foreseeable future, so every mass shooting is just &quot;oh, the deaths aren&#39;t even double digits, that&#39;s not that bad. What should I have for dinner,?&quot; It&#39;s like I&#39;m burnt out on caring. If we&#39;re not going to do anything for the issue, why cover it for more than 5 minutes on the news? Why discuss it?</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/TooAfraidToAsk/comments/o45ror/does_anyone_else_find_mass_shooting_more/",
  "subreddit": "TooAfraidToAsk",
  "id": "o45ror",
  "is_self": true,
  "media": null,
  "is_video": false
}