{
  "author": "AintNothinbutaGFring",
  "the_new_excerpt": "I haven't experienced this myself, but people are talking about having ADA\nwithdrawals blocked towards the end of the epoch. Binance is motivated to do\nthis because a 'snapshot' of staking wallet balances is taken at the end of the\nepoch, and staking rewards are calculated based on that. This is…",
  "original_created_utc": 1617227035,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我自己没有经历过，但人们都在说有ADA\n取款在纪元末被封锁。Binance的动机是做\n这是因为押注钱包余额的 \"快照 \"是在结束时进行的。\n纪元，并以此为基础计算出赌注奖励。这就是...",
      "title": "Binance在每个5天的 \"纪元\"（赌注回报周期）结束时阻止ADA提款。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我自己沒有經歷過，但人們都在說有ADA\n取款在紀元末被封鎖。Binance的動機是做\n這是因爲押注錢包餘額的 \"快照 \"是在結束時進行的。\n紀元，並以此爲基礎計算出賭注獎勵。這就是...",
      "title": "Binance在每個5天的 \"紀元\"（賭注回報週期）結束時阻止ADA提款。"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "私自身は経験していないのですが、ADAの\nエポック終了間際に引き出しがブロックされた。バイナンスのモチベーションは\nこれは、ステーキングウォレットの残高の「スナップショット」が年末に取得されるためです。\nそれをもとにステーク報酬が計算されます。これは...",
      "title": "バイナンスは、各5日間の「エポック」（ステーク報酬サイクル）の終わりに向かってADAの引き出しをブロックしています。"
    }
  ],
  "title": "Binance is blocking ADA withdrawals towards the end of each 5-day 'epoch' (staking reward cycle)",
  "created_utc": 1617244244,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I haven&#39;t experienced this myself, but people are talking about having ADA withdrawals blocked towards the end of the epoch. Binance is motivated to do this because a &#39;snapshot&#39; of staking wallet balances is taken at the end of the epoch, and staking rewards are calculated based on that. This is highly unethical however , because it means Binance is staking other people&#39;s ADA, collecting those staking rewards, and making the ADA unavailable to the owners when it suits them. Supposedly the hold on withdrawals can be as long as a full day before the end of the epoch, but typically happens at least an hour before the end of the epoch.  </p>\n\n<p>I think this shows a very blatant disrespect for their users&#39; crypto which they&#39;re supposedly holding in custody (I know, NYK NYC), and the greater crypto community should be aware of this</p>\n</div><!-- SC_ON -->",
  "score": 793,
  "permalink": "/r/CryptoCurrency/comments/mhgiqf/binance_is_blocking_ada_withdrawals_towards_the/",
  "subreddit": "CryptoCurrency",
  "id": "mhgiqf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357138681
}