{
  "author": "Homelander619",
  "the_new_excerpt": "I am 23 year old male. My first love was \"self imposed isolation\". It feels so\nmuch better. Since 16, I have isolated myself in my own room watching TV, video\ngames, maladaptive Daydreaming and eating.\n\nI genuinely love isolating myself and love to eat alone. I love being abandoned\nand always find…",
  "original_created_utc": 1614925842,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我是23岁的男性。我的初恋是 \"自我封闭\"。感觉很\n好多了。从16岁开始，我就把自己隔离在自己的房间里，看电视、看录像。\n游戏，不良的白日梦和饮食。\n\n我真心喜欢把自己孤立起来，喜欢一个人吃饭。我喜欢被人抛弃\n并总是发现...",
      "title": "我并不抑郁、孤独，也不渴望与人接触。我只是喜欢独处，一生中与人的接触最少。这里有人有同样的感觉吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是23歲的男性。我的初戀是 \"自我封閉\"。感覺很\n好多了。從16歲開始，我就把自己隔離在自己的房間裏，看電視、看錄像。\n遊戲，不良的白日夢和飲食。\n\n我真心喜歡把自己孤立起來，喜歡一個人喫飯。我喜歡被人拋棄\n並總是發現...",
      "title": "我並不抑鬱、孤獨，也不渴望與人接觸。我只是喜歡獨處，一生中與人的接觸最少。這裏有人有同樣的感覺嗎？"
    }
  ],
  "title": "I am not depressed, lonely or crave human contact. I just love being alone and spent my whole life with minimum human contact. Does anyone here feel the same?",
  "created_utc": 1614937791,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am 23 year old male. My first love was &quot;self imposed isolation&quot;. It feels so much better. Since 16, I have isolated myself in my own room watching TV, video games, maladaptive Daydreaming and eating.</p>\n\n<p>I genuinely love isolating myself and love to eat alone. I love being abandoned and always find it bizarre when I see people cry for being lonely.</p>\n\n<p>Why people cry or feel sad for being lonely? Why people crave human attention? Why people want new friends? Why people want to date, have a family and be successful or rich?</p>\n\n<p>MY GOAL IN LIFE\nMy goal in life isn&#39;t to be rich, successful or have a career. I just want a one room apartment, a normal job, eat and die alone. </p>\n\n<p>I don&#39;t want to get married, live with a family or have friends.</p>\n\n<p>FAMILY nd FRIENDS\nI don&#39;t need anyone to love me or crave their attention. Even on my birthday, I don&#39;t celebrate it and just love to eat alone. I never made a friend, since 2014. </p>\n\n<p>I avoid my school friends, when they call. I never felt lonely or depressed because of being alone. </p>\n\n<p>SEX LIFE\nI don&#39;t crave romantic partner or even have the personality or desire to have a girlfriend. </p>\n\n<p>I have been Daydreaming, since childhood. I create my own porn in my head and masturbate.\nFor me, &quot;masturbation is much better, than sex&quot;. </p>\n\n<p>So I don&#39;t need any partner. </p>\n\n<p>HUMAN CONTACT\nI engage in maladaptive Daydreaming and create characters in my head just to maintain my social skills.</p>\n\n<p>I have a girlfriend, mother, father and own a company. I talk to them and play their roles.</p>\n\n<p>It helped me in real life, to atleast communicate or survive by communication.</p>\n</div><!-- SC_ON -->",
  "score": 117,
  "permalink": "/r/TooAfraidToAsk/comments/ly5w89/i_am_not_depressed_lonely_or_crave_human_contact/",
  "subreddit": "TooAfraidToAsk",
  "id": "ly5w89",
  "is_self": true,
  "media": null,
  "is_video": false
}