{
  "author": "Huckleberry_Ginn",
  "the_new_excerpt": "This sub is incredible. There are incredible ideas and ideas that are so dumb\nthat a monkey throwing darts would pick better stocks (oops). Fortunately, or\nunfortunately, it seems both types of ideas can make you money.\n\nTo the people buying travel stock during a global pandemic when airliners…",
  "original_created_utc": 1611512194,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这个子是不可思议的。有一些不可思议的想法和想法是如此的愚蠢。\n猴子扔飞镖会选择更好的股票（哎呀）。幸运的是，或者\n不幸的是，似乎这两种类型的想法都能让你赚钱。\n\n对在全球大流行期间买入旅游股票的人来说，当客机... ...",
      "title": "这里每赚一元钱，就损失两元钱"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個子是不可思議的。有一些不可思議的想法和想法是如此的愚蠢。\n猴子扔飛鏢會選擇更好的股票（哎呀）。幸運的是，或者\n不幸的是，似乎這兩種類型的想法都能讓你賺錢。\n\n對在全球大流行期間買入旅遊股票的人來說，當客機... ...",
      "title": "這裏每賺一元錢，就損失兩元錢"
    }
  ],
  "title": "For every dollar that is made here, two dollars are lost",
  "created_utc": 1611535998,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This sub is incredible. There are incredible ideas and ideas that are so dumb that a monkey throwing darts would pick better stocks (oops). Fortunately, or unfortunately, it seems both types of ideas can make you money. </p>\n\n<p>To the people buying travel stock during a global pandemic when airliners are flying at 20% capacity (or less) or Hertz... it’s gambling. I support people doing what they want with their money, but following blind idiots who are maxing a credit card for a trade is fucking moronic. At times, it’s like watching a retiree throw away hundreds of dollars a day at a slot machine. </p>\n\n<p>I believe for every dollar made here, two dollars are lost. Seeing someone, such as DFV, make $11m off $50k is the greatest advertisement ever. Many will see it and ask, how did he do it? They will “learn,” aka have no fucking idea, what an option is and proceed to lose thousands with the hope of making millions and quitting their job all while simultaneously getting revenge on their wife’s boyfriend. </p>\n\n<p>Again, there is great advice here and truly smart people. There are also addicts who will say anything about a stock because they own $100 in an option. I’ve messaged with people who didn’t know the difference between a put and a call while holding 5+ figures of contracts and making less than $20 an hour. </p>\n\n<p>My message? Please throw amounts of money at ideas that you’re willing to walk away from. Do not jeopardize your retirement, wife’s boyfriend’s new boat, or your children’s education on a DD from some 16 year old who has $50 in Victoria secret because boobs are getting bigger. On the other side of these trades there are likely people with drones monitoring Victoria secret factories and how many kids walk in and out of the manufacturing plant a day.</p>\n</div><!-- SC_ON -->",
  "score": 2937,
  "permalink": "/r/wallstreetbets/comments/l44nrx/for_every_dollar_that_is_made_here_two_dollars/",
  "subreddit": "wallstreetbets",
  "id": "l44nrx",
  "is_self": true,
  "media": null,
  "is_video": false
}