{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "I'm a short-term degenerate options trader(mostly intra-day, max few weeks), usually just an occasional lurker on this sub. This is a long post, so if you want skip to the meat of it jump to, **Feedback Loops.**\n\nGiven the recent market volatility and all the theorizing around causes/possible outcomes(omicron, fed, etc.) and discussions around stocks/indices being \"cheap\"/\"overvalued\"/etc. I thought I'd share some info on how options activity might be the primary driver of the erratic stock price movements recently (and in the near future). As a result even if you only trade stocks, it might be worth your while to learn how options impact the game.\n\nOptions trading activity is at an all-time high as of November(in last 2 years, on some days, options volume is higher than underlying stock volume!) and this leads to very large buying/selling flows of the underlying stocks from market makers who are hedging their risk. Depending on how close we are to large options expiration dates the behavior of these flows can change drastically setting off large market movements in either direction.\n\nLast monthly OPEX(options expiration) occurred on 11/19, next large OPEX will be on 12/17. I think 11/19 OPEX is what paved the way for the subsequent drop the following week in markets due to large shift in market maker hedges after OPEX. I also think if there's a bounce in the market for a Santa Rally it will likely be near/shortly after the next OPEX on 12/17. Below I explain in detail how market maker hedging of stock options can drive price flow in the underlying stocks. I've attempted to keep it simple enough for people of any experience level to follow.\n\n**Basics**\n\n**Price and Order Book**\n\nEvery trade made in the market has 2 sides to it. A buyer and a seller. \"Price\" as we see on a chart is a real-time negotiation occurring between a group of buyers and a group of sellers. The results of these negotiations are entered into a ledger called an order book. We typically visualize that order book as stock charts, tickers, etc.\n\nThe amount of real buyers/sellers that will want to negotiate at any given time determines how easy it will be for you to buy/sell a stock (a.k.a liquidity). If you don't have enough buyers/sellers at a price, then price will have to move up or down in order to entice more buyer/sellers. Less buyers/sellers or an imbalance of buyers/sellers -&gt; more price movement. \n\n**Futures/Options**\n\nFutures can be thought of as a trade that's added to the order book for a future date instead of for now. \n\nWhy do this? Buyers/sellers can lock in prices for a future date to allow for longer-term stability/planning rather than be forced to speculate on what prices might be at that date.\n\nOptions can be thought of as the option to add a trade to the order book for a future date.\n\n**Market Makers**\n\nMarket makers are players(usually banks/financial institutions) who make money by providing liquidity (a.k.a make it easier for you to buy/sell a stock). They do this by adding artificial buyers and sellers on both sides of the order book with a slight price difference (a.k.a spread). \n\nGenerally their goal is to make profit only from the spread, rather than speculate in the market by actually buying/selling the stock like investors/traders(a.k.a you) are. This way their profits are tied to how many people are trading, not how the market does.\n\nE.g\n\nMarket maker adds an artificial buy and artificial sell order on the book.\n\nAsk $101\n\nBid $99\n\nReal seller comes in and sells the stock for $99 to market maker. Real buyer comes in and buys the same stock for $101 from the market maker. Market maker keeps $2 profit.\n\n**Tail Wagging The Dog**\n\n**Hedging Options**\n\nAs mentioned earlier the primarily goal of market makers is to be unaffected by market movements, while profiting off spread. They do this by making sure they have an equal amount of bets up and down(a.k.a hedging).\n\nThe below table shows how they initially hedge based on what bet the trader places. As the options get closer to expiration their value will decrease and the market maker will reduce their hedge as the value of the option decreases.  E.g. As a call option loses value the market maker will sell stock to reduce their hedge to match the reduced value of the call option.\n\n&amp;#x200B;\n\n|Trader Bet|Market Maker Bet|Market Maker Initial Hedge|Market Maker Hedge as OPEX nears|\n|:-|:-|:-|:-|\n|Buy Call|Sell Call|Buy Stock|Sell Stock|\n|Sell Call|Buy Call|Sell Stock|Buy Stock|\n|Buy Put|Sell Put|Sell Stock|Buy Stock|\n|Sell Put|Buy Put|Buy Stock|Sell Stock|\n\n&amp;#x200B;\n\nThe end result here is a range of outcomes. We will only discuss the two extremes, but any mixture of these and transition between these is possible:\n\n1. Market maker is hedging with the market flow in the underlying stock.\n\n2. Market maker is hedging against the market flow in the underlying stock.\n\nOutcome 1 can result in what's typically referred to as a \"gamma squeeze\". \n\n\\- Traders buy a large number of call/put options. \n\n\\- Market maker buys/sells a large amount of underlying stock causing the price to shift up/down.\n\n\\- Traders options are \"in-the-money\", so traders take profits and buy more call/put options which causes further hedging which further accelerates the up/down movement in the underlying causing a feedback loop.\n\n\\- Market makers see the increased demand for call/put options and increase the price of the high-demand options. This reduces the number of options purchases and the feedback loop eventually loses momentum and stops and then typically reverses in the other direction.\n\nOutcome 2 results in the market makers having a balancing effect on markets by reducing price movement in either direction. \n\n\\- This typically either looks like the prices pinning to a certain level (e.g. SPX pinned to 4700, which on avg had the largest open interest for contracts going into 11/19 OPEX) \n\n\\- Or a long slow gradual melt-up as the hedging flows provide a steady support for the market. (Generally we don't see slow gradual melt-downs b/c price movements tend to increase more quickly in drops. a.k.a generally market takes the stairs up and the elevator down).\n\n**Feedback Loops**\n\n1. Change in market maker hedges impacts underlying stock price.\n\n2. Underlying stock price impacts options prices.\n\n3. Options prices impact market maker hedge.\n\n4. Repeat\n\nThis basic feedback loop here is what's referred to when people talk about \"the tail wagging the dog.\" in relation to the options market. As we can see above that analogy is not quite accurate, it'd be more accurate to say \"the tail and dog are wagging each other in a feedback loop.\"\n\nThe main impact of these kinds of feedback loops is that when volumes are large enough, they will overpower more traditional methods of pricing stocks (e.g. fundamentals, macro, etc.). This is not to say that those factors are not playing a role in the price, but rather that they are playing a role within the broader context of these feedback loops. \n\nIf you ignore these feedback loops and use only your traditional methods, you run the risk of getting burned when a feedback loop is exerting pressures in the other direction. This will cause you to look at market and say it's acting \"crazy\" by your traditional methods which may certainly be true, but anytime you and the market disagree on a trend/price just remember: Do you want to be right or do you want to make money?\n\n**In Practice**\n\nOk ok enough theory, how to use these ideas in your investing/trading?\n\nYou can think of options contracts as having gravity on a stock's price. The more contracts at a given price, the more the feedback loop we discussed above will \"pull\" the stock to that price. You can use this as additional info in determining support/resistance/pivots etc.\n\nSince it's impossible to hedge continuously, market makers do it in batches which can cause large buy/sell orders to be entered on the underlying as a hedge shortly after large options prices shifts. When you see large buy/sell volume on an index/equity always ask yourself if it's real volume or if it's hedging volume. If it's hedging volume then it will be rolled back as OPEX(options expiration) nears and the price hasn't shifted much. These hedge rollbacks can be potential reversal opportunities on the underlying.\n\nThe above hedging primarily impacts high-volume options like SPX, AAPL, TESLA, etc. Even if your stock doesn't have large options volume, due to the correlation between equities, price moves triggered by SPX options can still indirectly affect your equities if it triggers larger market moves.\n\nFlows are most pronounced near monthly OPEX b/c options price vary much more highly as they get closer to expiration. These causes the hedging flows to also increase as any options price movement requires a change in the underlying hedge. This makes feedback loop effects stronger near OPEX.\n\nLast but not least, since gamma squeezes occur in both directions there is always the risk of a regular pullback/dip turning into a full on rout depending on how options activity behaves at the same time and how stable the underlying market structure is. (e.g. sp bull market with 450/500 climbing stocks much more stable structure than sp bull market with with 250/500 sp climbing stocks, even though both tickers show the number going up.)\n\n**Market Next 2 Weeks**\n\nI think based on the mentioned feedback loops and current options activity the market will continue to drop for the next week(12/6) with the potential for reversal coming the week after (12/13). \n\n**Week of 12/6**\n\nThere is a huge amount of PUTs that have been bought recently causing market makers to sell the underlying as a hedge, and I suspect in that broader context(news on fed taper, omicron, debt ceiling, evergrande default, crypto drop/tether fud, potential bad cpi, etc.) will be enough to increase this feedback loop downward early this week. Based on PUT positioning and the feedback loops pulling price towards large open options positions, I suspect if spy break below 4500 it will drop fast. Best case support holds at 4400. Absolute worst case down to 4000, but I doubt it will get there. \n\nIt's possible we get a small bounce again on Monday before dropping below 4500, but I do expect us to break below this upcoming week.\n\nI am not going to comment on actual real-life risks of those news events I mentioned b/c I don't know. Only that within the fragile context of current options positioning it wouldn't take much bad news to increase the downward momentum and there seem to be a lot of different potential catalysts that could spark fear causing selling given how fewer and fewer crowded stocks currently hold up the major indices.\n\n**Week of 12/13**\n\nThis will be a very key week to determine whether a Santa Rally will happen. Ideal scenario for that would be traders overextend on PUTs. Market holds the line and those PUTs expire worthless. Market makers unwind their hedges by buying the underlying stock sling-shotting us back for another rally.\n\nIt's also possible we trade sideways here and don't slingshot back. This would be a wait-and-see kind of scenario. \n\nEither way I think it's unlikely that the market will still be dropping by 12/17 unless one of the aforementioned events results in some more bad news (e.g. omicron being worse than expected, faster fed taper, US institutions holding a bunch of Chinese property debt, Tether finally collapses, etc.) Not saying those are likely, but always good to be aware of worst-case scenarios when managing risk.\n\n**My related positions**\n\nAs my positions show I'm quite bearish at the moment.\n\nSPY and QQQ Puts w/ multiple expiries: now - 12/17 w/ multiple strikes: 440 - 460\n\nUVXY calls, strike: 75 expiry: 1/21 (This position is highly speculative on my part and I've had it for a couple of months, not saying we're going to see a crash of this magnitude, but I do personally believe it's in the range of possibility.)\n\nI will likely turn bullish near 12/17 for Santa Rally, will play it by ear as we get closer to decide exactly when.\n\n**Disclaimer/Final Thoughts** \n\nI'm just some guy on the internet who bets on whether lines go up or down and have 0 formal or otherwise training in any of this. I just happen to play the game. No one(on the internet or otherwise) knows what the market is going to do. Ever. Go look at the finance \"news\" from 11/22/21 on JPow announcement. Same papers give his appointment credit for the market rally in morning and then few hours later blame his appointment for the drop in the afternoon. Absolute clown stuff. They don't know what's going to happen anymore than you or I do. Their job is only to give you \"plausible\" sounding answers you want to hear. Same with reddit/twitter/fb/etc. So they will just take the most recent major event assign it credit/blame and then spin into whichever bull/bear narrative they think you want to hear. For profit market \"commentary\" is the stock market equivalent of selling pickaxes in a gold rush.\n\nIf you take nothing else away from this post at least remember this. Markets are chaotic and unpredictable. You can't analyze or research your way out of that basic fact. All you can do in the face of that is accept the uncertainty and play this game accordingly. Uncertain scenarios are both full of risk, but also full of opportunity. Best of luck in the coming weeks, I have no idea what will happen, but at the very least it should be interesting! Cheers.",
  "author_fullname": "t2_gvq29",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Tail Wagging The Dog: A case for how options hedging activity has recently been driving stock market prices more than fundamentals or macro.",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_r9u46e",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.94,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 207,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 207,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1638751474,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a short-term degenerate options trader(mostly intra-day, max few weeks), usually just an occasional lurker on this sub. This is a long post, so if you want skip to the meat of it jump to, &lt;strong&gt;Feedback Loops.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Given the recent market volatility and all the theorizing around causes/possible outcomes(omicron, fed, etc.) and discussions around stocks/indices being &amp;quot;cheap&amp;quot;/&amp;quot;overvalued&amp;quot;/etc. I thought I&amp;#39;d share some info on how options activity might be the primary driver of the erratic stock price movements recently (and in the near future). As a result even if you only trade stocks, it might be worth your while to learn how options impact the game.&lt;/p&gt;\n\n&lt;p&gt;Options trading activity is at an all-time high as of November(in last 2 years, on some days, options volume is higher than underlying stock volume!) and this leads to very large buying/selling flows of the underlying stocks from market makers who are hedging their risk. Depending on how close we are to large options expiration dates the behavior of these flows can change drastically setting off large market movements in either direction.&lt;/p&gt;\n\n&lt;p&gt;Last monthly OPEX(options expiration) occurred on 11/19, next large OPEX will be on 12/17. I think 11/19 OPEX is what paved the way for the subsequent drop the following week in markets due to large shift in market maker hedges after OPEX. I also think if there&amp;#39;s a bounce in the market for a Santa Rally it will likely be near/shortly after the next OPEX on 12/17. Below I explain in detail how market maker hedging of stock options can drive price flow in the underlying stocks. I&amp;#39;ve attempted to keep it simple enough for people of any experience level to follow.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Basics&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Price and Order Book&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Every trade made in the market has 2 sides to it. A buyer and a seller. &amp;quot;Price&amp;quot; as we see on a chart is a real-time negotiation occurring between a group of buyers and a group of sellers. The results of these negotiations are entered into a ledger called an order book. We typically visualize that order book as stock charts, tickers, etc.&lt;/p&gt;\n\n&lt;p&gt;The amount of real buyers/sellers that will want to negotiate at any given time determines how easy it will be for you to buy/sell a stock (a.k.a liquidity). If you don&amp;#39;t have enough buyers/sellers at a price, then price will have to move up or down in order to entice more buyer/sellers. Less buyers/sellers or an imbalance of buyers/sellers -&amp;gt; more price movement. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Futures/Options&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Futures can be thought of as a trade that&amp;#39;s added to the order book for a future date instead of for now. &lt;/p&gt;\n\n&lt;p&gt;Why do this? Buyers/sellers can lock in prices for a future date to allow for longer-term stability/planning rather than be forced to speculate on what prices might be at that date.&lt;/p&gt;\n\n&lt;p&gt;Options can be thought of as the option to add a trade to the order book for a future date.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Market Makers&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Market makers are players(usually banks/financial institutions) who make money by providing liquidity (a.k.a make it easier for you to buy/sell a stock). They do this by adding artificial buyers and sellers on both sides of the order book with a slight price difference (a.k.a spread). &lt;/p&gt;\n\n&lt;p&gt;Generally their goal is to make profit only from the spread, rather than speculate in the market by actually buying/selling the stock like investors/traders(a.k.a you) are. This way their profits are tied to how many people are trading, not how the market does.&lt;/p&gt;\n\n&lt;p&gt;E.g&lt;/p&gt;\n\n&lt;p&gt;Market maker adds an artificial buy and artificial sell order on the book.&lt;/p&gt;\n\n&lt;p&gt;Ask $101&lt;/p&gt;\n\n&lt;p&gt;Bid $99&lt;/p&gt;\n\n&lt;p&gt;Real seller comes in and sells the stock for $99 to market maker. Real buyer comes in and buys the same stock for $101 from the market maker. Market maker keeps $2 profit.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Tail Wagging The Dog&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Hedging Options&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;As mentioned earlier the primarily goal of market makers is to be unaffected by market movements, while profiting off spread. They do this by making sure they have an equal amount of bets up and down(a.k.a hedging).&lt;/p&gt;\n\n&lt;p&gt;The below table shows how they initially hedge based on what bet the trader places. As the options get closer to expiration their value will decrease and the market maker will reduce their hedge as the value of the option decreases.  E.g. As a call option loses value the market maker will sell stock to reduce their hedge to match the reduced value of the call option.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;table&gt;&lt;thead&gt;\n&lt;tr&gt;\n&lt;th align=\"left\"&gt;Trader Bet&lt;/th&gt;\n&lt;th align=\"left\"&gt;Market Maker Bet&lt;/th&gt;\n&lt;th align=\"left\"&gt;Market Maker Initial Hedge&lt;/th&gt;\n&lt;th align=\"left\"&gt;Market Maker Hedge as OPEX nears&lt;/th&gt;\n&lt;/tr&gt;\n&lt;/thead&gt;&lt;tbody&gt;\n&lt;tr&gt;\n&lt;td align=\"left\"&gt;Buy Call&lt;/td&gt;\n&lt;td align=\"left\"&gt;Sell Call&lt;/td&gt;\n&lt;td align=\"left\"&gt;Buy Stock&lt;/td&gt;\n&lt;td align=\"left\"&gt;Sell Stock&lt;/td&gt;\n&lt;/tr&gt;\n&lt;tr&gt;\n&lt;td align=\"left\"&gt;Sell Call&lt;/td&gt;\n&lt;td align=\"left\"&gt;Buy Call&lt;/td&gt;\n&lt;td align=\"left\"&gt;Sell Stock&lt;/td&gt;\n&lt;td align=\"left\"&gt;Buy Stock&lt;/td&gt;\n&lt;/tr&gt;\n&lt;tr&gt;\n&lt;td align=\"left\"&gt;Buy Put&lt;/td&gt;\n&lt;td align=\"left\"&gt;Sell Put&lt;/td&gt;\n&lt;td align=\"left\"&gt;Sell Stock&lt;/td&gt;\n&lt;td align=\"left\"&gt;Buy Stock&lt;/td&gt;\n&lt;/tr&gt;\n&lt;tr&gt;\n&lt;td align=\"left\"&gt;Sell Put&lt;/td&gt;\n&lt;td align=\"left\"&gt;Buy Put&lt;/td&gt;\n&lt;td align=\"left\"&gt;Buy Stock&lt;/td&gt;\n&lt;td align=\"left\"&gt;Sell Stock&lt;/td&gt;\n&lt;/tr&gt;\n&lt;/tbody&gt;&lt;/table&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;The end result here is a range of outcomes. We will only discuss the two extremes, but any mixture of these and transition between these is possible:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Market maker is hedging with the market flow in the underlying stock.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Market maker is hedging against the market flow in the underlying stock.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Outcome 1 can result in what&amp;#39;s typically referred to as a &amp;quot;gamma squeeze&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;- Traders buy a large number of call/put options. &lt;/p&gt;\n\n&lt;p&gt;- Market maker buys/sells a large amount of underlying stock causing the price to shift up/down.&lt;/p&gt;\n\n&lt;p&gt;- Traders options are &amp;quot;in-the-money&amp;quot;, so traders take profits and buy more call/put options which causes further hedging which further accelerates the up/down movement in the underlying causing a feedback loop.&lt;/p&gt;\n\n&lt;p&gt;- Market makers see the increased demand for call/put options and increase the price of the high-demand options. This reduces the number of options purchases and the feedback loop eventually loses momentum and stops and then typically reverses in the other direction.&lt;/p&gt;\n\n&lt;p&gt;Outcome 2 results in the market makers having a balancing effect on markets by reducing price movement in either direction. &lt;/p&gt;\n\n&lt;p&gt;- This typically either looks like the prices pinning to a certain level (e.g. SPX pinned to 4700, which on avg had the largest open interest for contracts going into 11/19 OPEX) &lt;/p&gt;\n\n&lt;p&gt;- Or a long slow gradual melt-up as the hedging flows provide a steady support for the market. (Generally we don&amp;#39;t see slow gradual melt-downs b/c price movements tend to increase more quickly in drops. a.k.a generally market takes the stairs up and the elevator down).&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Feedback Loops&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Change in market maker hedges impacts underlying stock price.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Underlying stock price impacts options prices.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Options prices impact market maker hedge.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Repeat&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;This basic feedback loop here is what&amp;#39;s referred to when people talk about &amp;quot;the tail wagging the dog.&amp;quot; in relation to the options market. As we can see above that analogy is not quite accurate, it&amp;#39;d be more accurate to say &amp;quot;the tail and dog are wagging each other in a feedback loop.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;The main impact of these kinds of feedback loops is that when volumes are large enough, they will overpower more traditional methods of pricing stocks (e.g. fundamentals, macro, etc.). This is not to say that those factors are not playing a role in the price, but rather that they are playing a role within the broader context of these feedback loops. &lt;/p&gt;\n\n&lt;p&gt;If you ignore these feedback loops and use only your traditional methods, you run the risk of getting burned when a feedback loop is exerting pressures in the other direction. This will cause you to look at market and say it&amp;#39;s acting &amp;quot;crazy&amp;quot; by your traditional methods which may certainly be true, but anytime you and the market disagree on a trend/price just remember: Do you want to be right or do you want to make money?&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;In Practice&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Ok ok enough theory, how to use these ideas in your investing/trading?&lt;/p&gt;\n\n&lt;p&gt;You can think of options contracts as having gravity on a stock&amp;#39;s price. The more contracts at a given price, the more the feedback loop we discussed above will &amp;quot;pull&amp;quot; the stock to that price. You can use this as additional info in determining support/resistance/pivots etc.&lt;/p&gt;\n\n&lt;p&gt;Since it&amp;#39;s impossible to hedge continuously, market makers do it in batches which can cause large buy/sell orders to be entered on the underlying as a hedge shortly after large options prices shifts. When you see large buy/sell volume on an index/equity always ask yourself if it&amp;#39;s real volume or if it&amp;#39;s hedging volume. If it&amp;#39;s hedging volume then it will be rolled back as OPEX(options expiration) nears and the price hasn&amp;#39;t shifted much. These hedge rollbacks can be potential reversal opportunities on the underlying.&lt;/p&gt;\n\n&lt;p&gt;The above hedging primarily impacts high-volume options like SPX, AAPL, TESLA, etc. Even if your stock doesn&amp;#39;t have large options volume, due to the correlation between equities, price moves triggered by SPX options can still indirectly affect your equities if it triggers larger market moves.&lt;/p&gt;\n\n&lt;p&gt;Flows are most pronounced near monthly OPEX b/c options price vary much more highly as they get closer to expiration. These causes the hedging flows to also increase as any options price movement requires a change in the underlying hedge. This makes feedback loop effects stronger near OPEX.&lt;/p&gt;\n\n&lt;p&gt;Last but not least, since gamma squeezes occur in both directions there is always the risk of a regular pullback/dip turning into a full on rout depending on how options activity behaves at the same time and how stable the underlying market structure is. (e.g. sp bull market with 450/500 climbing stocks much more stable structure than sp bull market with with 250/500 sp climbing stocks, even though both tickers show the number going up.)&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Market Next 2 Weeks&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I think based on the mentioned feedback loops and current options activity the market will continue to drop for the next week(12/6) with the potential for reversal coming the week after (12/13). &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Week of 12/6&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;There is a huge amount of PUTs that have been bought recently causing market makers to sell the underlying as a hedge, and I suspect in that broader context(news on fed taper, omicron, debt ceiling, evergrande default, crypto drop/tether fud, potential bad cpi, etc.) will be enough to increase this feedback loop downward early this week. Based on PUT positioning and the feedback loops pulling price towards large open options positions, I suspect if spy break below 4500 it will drop fast. Best case support holds at 4400. Absolute worst case down to 4000, but I doubt it will get there. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s possible we get a small bounce again on Monday before dropping below 4500, but I do expect us to break below this upcoming week.&lt;/p&gt;\n\n&lt;p&gt;I am not going to comment on actual real-life risks of those news events I mentioned b/c I don&amp;#39;t know. Only that within the fragile context of current options positioning it wouldn&amp;#39;t take much bad news to increase the downward momentum and there seem to be a lot of different potential catalysts that could spark fear causing selling given how fewer and fewer crowded stocks currently hold up the major indices.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Week of 12/13&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;This will be a very key week to determine whether a Santa Rally will happen. Ideal scenario for that would be traders overextend on PUTs. Market holds the line and those PUTs expire worthless. Market makers unwind their hedges by buying the underlying stock sling-shotting us back for another rally.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s also possible we trade sideways here and don&amp;#39;t slingshot back. This would be a wait-and-see kind of scenario. &lt;/p&gt;\n\n&lt;p&gt;Either way I think it&amp;#39;s unlikely that the market will still be dropping by 12/17 unless one of the aforementioned events results in some more bad news (e.g. omicron being worse than expected, faster fed taper, US institutions holding a bunch of Chinese property debt, Tether finally collapses, etc.) Not saying those are likely, but always good to be aware of worst-case scenarios when managing risk.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;My related positions&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;As my positions show I&amp;#39;m quite bearish at the moment.&lt;/p&gt;\n\n&lt;p&gt;SPY and QQQ Puts w/ multiple expiries: now - 12/17 w/ multiple strikes: 440 - 460&lt;/p&gt;\n\n&lt;p&gt;UVXY calls, strike: 75 expiry: 1/21 (This position is highly speculative on my part and I&amp;#39;ve had it for a couple of months, not saying we&amp;#39;re going to see a crash of this magnitude, but I do personally believe it&amp;#39;s in the range of possibility.)&lt;/p&gt;\n\n&lt;p&gt;I will likely turn bullish near 12/17 for Santa Rally, will play it by ear as we get closer to decide exactly when.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Disclaimer/Final Thoughts&lt;/strong&gt; &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m just some guy on the internet who bets on whether lines go up or down and have 0 formal or otherwise training in any of this. I just happen to play the game. No one(on the internet or otherwise) knows what the market is going to do. Ever. Go look at the finance &amp;quot;news&amp;quot; from 11/22/21 on JPow announcement. Same papers give his appointment credit for the market rally in morning and then few hours later blame his appointment for the drop in the afternoon. Absolute clown stuff. They don&amp;#39;t know what&amp;#39;s going to happen anymore than you or I do. Their job is only to give you &amp;quot;plausible&amp;quot; sounding answers you want to hear. Same with reddit/twitter/fb/etc. So they will just take the most recent major event assign it credit/blame and then spin into whichever bull/bear narrative they think you want to hear. For profit market &amp;quot;commentary&amp;quot; is the stock market equivalent of selling pickaxes in a gold rush.&lt;/p&gt;\n\n&lt;p&gt;If you take nothing else away from this post at least remember this. Markets are chaotic and unpredictable. You can&amp;#39;t analyze or research your way out of that basic fact. All you can do in the face of that is accept the uncertainty and play this game accordingly. Uncertain scenarios are both full of risk, but also full of opportunity. Best of luck in the coming weeks, I have no idea what will happen, but at the very least it should be interesting! Cheers.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "r9u46e",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "foobar1000",
  "discussion_type": null,
  "num_comments": 5,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/r9u46e/tail_wagging_the_dog_a_case_for_how_options/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/r9u46e/tail_wagging_the_dog_a_case_for_how_options/",
  "subreddit_subscribers": 3349294,
  "created_utc": 1638762211,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1638751474,
  "the_new_excerpt": "I'm a short-term degenerate options trader(mostly intra-day, max few weeks),\nusually just an occasional lurker on this sub. This is a long post, so if you\nwant skip to the meat of it jump to, Feedback Loops.\n\nGiven the recent market volatility and all the theorizing around…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "オプションの短期堕落トレーダー（主にイントラデイ、最大数週間）です。\n普段はこのサブサイトで時々潜伏しているだけです。この記事は長いので、もしあなたが\n本題に入りたい方は、フィードバックループへジャンプしてください。\n\nこのところ、市場の変動が激しく、いろいろな説が飛び交っていますが...。",
      "title": "Tail Wagging The Dog」です。最近では、オプションのヘッジ活動が、ファンダメンタルズやマクロよりも株式市場の価格を動かしているというケースがあります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个短期堕落的期权交易员（主要是日内交易，最长几周）。\n通常只是偶尔会在这个子网站上潜伏。这是一个长帖子，所以如果你\n想跳到它的主要内容，请跳到 \"反馈循环\"。\n\n鉴于最近的市场波动和所有的理论研究都是围绕...",
      "title": "尾巴摇晃着狗。关于最近期权对冲活动如何比基本面或宏观面更能推动股市价格的案例。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個短期墮落的期權交易員（主要是日內交易，最長几周）。\n通常只是偶爾會在這個子網站上潛伏。這是一個長帖子，所以如果你\n想跳到它的主要內容，請跳到 \"反饋循環\"。\n\n鑑於最近的市場波動和所有的理論研究都是圍繞...",
      "title": "尾巴搖晃着狗。關於最近期權對沖活動如何比基本面或宏觀面更能推動股市價格的案例。"
    }
  ],
  "source_updated_at": 1639129312594
}