{
  "author": "mra137",
  "original_created_utc": 1658152134,
  "title": "despite popular believe, crypto is not the best way to secure your financial future, getting a good job is",
  "created_utc": 1658158837,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Users in this sub and other crypto subs have this mentality that crypto is the best and only opportunity they have to get ahead financially. This is ridiculous, getting a good job would be far more beneficial, especially if you have a shitty job and can&amp;#39;t afford to buy much crypto in the first place. And if you are making 25-40k a year you shouldn&amp;#39;t be spending huge chunks of your time looking into or researching crypto. There are people here that claim to have spent hundreds or even thousands of hours on research. And they admit they are also poor... &lt;/p&gt;\n\n&lt;p&gt;Firstly, if you are poor it doesn&amp;#39;t matter how much research you do, if you cant even afford to invest a grand you will never see returns that will even support you for one year. You are far better off spending the hundreds or thousands of hours learning tech that pays, like getting your ccna, or learning how to program or something like that. If you are really that into tech why haven&amp;#39;t you done this? &lt;/p&gt;\n\n&lt;p&gt;Secondly let&amp;#39;s say you make 35k a year and decide to learn new skills and net a job that pays 75k a year. Your effort has awarded you an extra 40k a year. Crypto will never bring you those kinds of annual returns (unless you are a big player, but big players have good jobs), especially if you are poor (refer to previous paragraph). &lt;/p&gt;\n\n&lt;p&gt;So for those of you that believe this is the ticket to financial freedom and hate your sub 40k a year job stop looking into crypto right now, get some skills and go get a better job. Then come back.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 441,
  "permalink": "/r/CryptoCurrency/comments/w1ztmf/despite_popular_believe_crypto_is_not_the_best/",
  "subreddit": "CryptoCurrency",
  "id": "w1ztmf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Users in this sub and other crypto subs have this mentality that crypto is the\nbest and only opportunity they have to get ahead financially. This is\nridiculous, getting a good job would be far more beneficial, especially if you\nhave a shitty job and can't afford to buy much crypto in the first…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブや他のクリプトサブのユーザーは、クリプトはこのようなメンタリティを持っています。\n経済的に成功するための最良の、そして唯一の機会だと考えています。これは馬鹿馬鹿しいことです。\n良い仕事に就く方がはるかに有益です。\n特に、クソみたいな仕事をしていて、最初に多くの暗号を買う余裕がない場合は、良い仕事に就く方がはるかに有益です...",
      "title": "一般的に信じられていることですが、暗号はあなたの経済的な将来を確保するための最良の方法ではなく、良い仕事を得ることです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "本子和其他加密子的用户有这种心态，认为加密是\n他们有最好的和唯一的机会在经济上取得进展。这真是\n这很荒谬，找一份好工作会更有好处，特别是如果你\n特别是如果你有一份糟糕的工作，而且一开始就买不起很多加密货币......",
      "title": "尽管人们普遍认为，加密货币并不是保障你财务未来的最佳方式，找到一份好工作才是最重要的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "本子和其他加密子的用戶有這種心態，認爲加密是\n他們有最好的和唯一的機會在經濟上取得進展。這真是\n這很荒謬，找一份好工作會更有好處，特別是如果你\n特別是如果你有一份糟糕的工作，而且一開始就買不起很多加密貨幣......",
      "title": "儘管人們普遍認爲，加密貨幣並不是保障你財務未來的最佳方式，找到一份好工作纔是最重要的。"
    }
  ]
}