{
  "author": "SasukeUchiha248",
  "original_created_utc": 1657521188,
  "title": "The terror of LUNA goes on (part 1)",
  "created_utc": 1657531853,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As you can see by the title, you must already know what this post is about.  &lt;/p&gt;\n\n&lt;p&gt;Although the issue with LUNA have been stated over and over again, it still affects families and individuals today.&lt;/p&gt;\n\n&lt;p&gt;As a korean living in korea, I get to see news reports of people who are affected by LUNA crash.&lt;/p&gt;\n\n&lt;p&gt;And recently there was a whole family in korea who committed suicide. The father had apparently invested his life savings on LUNA, and went bankrupt. He went on a fake vacation, deceiving his child and drugged her. Then there were reports of them missing, and the police department scouted the family, trying to track them down with CCTVs. In the end, they found their car in the bottom of the ocean, it was presumed that they committed suicide by purposefully driving their car into the ocean.&lt;br/&gt;\nArticle about this will be posted in the comment section  &lt;/p&gt;\n\n&lt;p&gt;There should be something done to Do Kwon and prevent rugpulls like this to happen. As of right now,  Do Kwon and LUNA employees are forbidden to leave the country.&lt;br/&gt;\nSo everyone, as a member of one of the biggest crypto community, help people out by posting warnings about scam projects.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 305,
  "permalink": "/r/CryptoCurrency/comments/vwbt26/the_terror_of_luna_goes_on_part_1/",
  "subreddit": "CryptoCurrency",
  "id": "vwbt26",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "As you can see by the title, you must already know what this post is about.\n\nAlthough the issue with LUNA have been stated over and over again, it still\naffects families and individuals today.\n\nAs a korean living in korea, I get to see news reports of people who are\naffected by LUNA crash.\n\nAnd…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルでお分かりのように、この記事の内容はもうお分かりのはずです。\n\nLUNAの問題は、何度も何度も言われていることではありますが、いまだに\n家族、個人に影響を及ぼしています。\n\n韓国に住む韓国人として、LUNAの墜落事故の影響を受けた人々の報道を目にすることがあります。\nLUNAの事故によって影響を受けた人々のニュースを見ることができます。\n\nそして...",
      "title": "LUNAの恐怖は続く（前編）"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "从标题可以看出，你一定已经知道这篇文章是关于什么的。\n\n虽然LUNA的问题已经被反复提及，但它仍然\n影响到今天的家庭和个人。\n\n作为一个生活在韩国的韩国人，我看到新闻报道中那些受到影响的人\n受LUNA事故影响的人。\n\n而且...",
      "title": "LUNA的恐怖继续下去（第一部分）"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "從標題可以看出，你一定已經知道這篇文章是關於什麼的。\n\n雖然LUNA的問題已經被反覆提及，但它仍然\n影響到今天的家庭和個人。\n\n作爲一個生活在韓國的韓國人，我看到新聞報道中那些受到影響的人\n受LUNA事故影響的人。\n\n而且...",
      "title": "LUNA的恐怖繼續下去（第一部分）"
    }
  ]
}