{
  "author": "YayPeopleAreAwesome",
  "original_created_utc": 1656546393,
  "title": "Why are credit card companies allowed to call me 10+ times a day? I know I'm late...",
  "created_utc": 1656580981,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m struggling financially at the moment.  I know when my bills are due, I know when I&amp;#39;m late.  It&amp;#39;s something that I constantly worry about.  &lt;/p&gt;\n\n&lt;p&gt;Why are credit card companies allowed to call me like a loan shark that is about to break my knee caps?  I know I&amp;#39;m late and their constant calling is nothing but a drain on me.   You want more money that I don&amp;#39;t have?  I&amp;#39;ll add you to the list.  Maybe at some point I can stop constantly stressing about losing the housing for my two kids.  I&amp;#39;d be fine losing my housing if it was just me, I would actually prefer it.  I&amp;#39;ve done it before and as soon as they move out I will do again, I hate renting.  &lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t do it.  I already struggling with life and then this.  I&amp;#39;m not doing it by choice, jesus.  &lt;/p&gt;\n\n&lt;p&gt;Do they think that (unnecessary)constant reminders are going to make me pay something I can&amp;#39;t?  I don&amp;#39;t know, I just can&amp;#39;t...  Life sucks.&lt;/p&gt;\n\n&lt;p&gt;Edit:  I&amp;#39;ve tried blocking them, but they keep coming.  They have an endless list of numbers to ghost?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 107,
  "permalink": "/r/TooAfraidToAsk/comments/vntwle/why_are_credit_card_companies_allowed_to_call_me/",
  "subreddit": "TooAfraidToAsk",
  "id": "vntwle",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm struggling financially at the moment. I know when my bills are due, I know\nwhen I'm late. It's something that I constantly worry about.\n\nWhy are credit card companies allowed to call me like a loan shark that is about\nto break my knee caps? I know I'm late and their constant calling is nothing…"
}