{
  "author": "YayPeopleAreAwesome",
  "original_created_utc": 1656546393,
  "title": "Why are credit card companies allowed to call me 10+ times a day? I know I'm late...",
  "created_utc": 1656580981,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m struggling financially at the moment.  I know when my bills are due, I know when I&amp;#39;m late.  It&amp;#39;s something that I constantly worry about.  &lt;/p&gt;\n\n&lt;p&gt;Why are credit card companies allowed to call me like a loan shark that is about to break my knee caps?  I know I&amp;#39;m late and their constant calling is nothing but a drain on me.   You want more money that I don&amp;#39;t have?  I&amp;#39;ll add you to the list.  Maybe at some point I can stop constantly stressing about losing the housing for my two kids.  I&amp;#39;d be fine losing my housing if it was just me, I would actually prefer it.  I&amp;#39;ve done it before and as soon as they move out I will do again, I hate renting.  &lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t do it.  I already struggling with life and then this.  I&amp;#39;m not doing it by choice, jesus.  &lt;/p&gt;\n\n&lt;p&gt;Do they think that (unnecessary)constant reminders are going to make me pay something I can&amp;#39;t?  I don&amp;#39;t know, I just can&amp;#39;t...  Life sucks.&lt;/p&gt;\n\n&lt;p&gt;Edit:  I&amp;#39;ve tried blocking them, but they keep coming.  They have an endless list of numbers to ghost?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 107,
  "permalink": "/r/TooAfraidToAsk/comments/vntwle/why_are_credit_card_companies_allowed_to_call_me/",
  "subreddit": "TooAfraidToAsk",
  "id": "vntwle",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm struggling financially at the moment. I know when my bills are due, I know\nwhen I'm late. It's something that I constantly worry about.\n\nWhy are credit card companies allowed to call me like a loan shark that is about\nto break my knee caps? I know I'm late and their constant calling is nothing…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今、経済的に苦しいんです。請求書がいつ届くかは知っているし、いつ遅れるかも知っている。\nいつ遅れるかもわかっています。常に心配していることがある。\n\nなぜカード会社は、私の膝頭を砕く高利貸しのような電話をかけてくることが許されるのでしょうか。\nなぜクレジットカード会社は、私の膝頭を砕く高利貸しのような電話をかけてくるのでしょうか。私は自分が遅れていることを知っているし、彼らの絶え間ない電話は何の意味もない...。",
      "title": "なぜカード会社は1日に10回以上も電話をかけてきていいのですか？遅れているのは分かっているのですが・・・。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我目前在经济上很挣扎。我知道我的账单何时到期，我知道\n我知道我什么时候会迟到。这是我一直担心的事情。\n\n为什么信用卡公司可以像放高利贷一样给我打电话，要把我的膝盖骨打断？\n要打破我的膝盖盖？我知道我迟到了，而他们不断地打电话也没什么...",
      "title": "为什么信用卡公司可以每天给我打电话10多次？我知道我已经迟到了..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我目前在經濟上很掙扎。我知道我的賬單何時到期，我知道\n我知道我什麼時候會遲到。這是我一直擔心的事情。\n\n爲什麼信用卡公司可以像放高利貸一樣給我打電話，要把我的膝蓋骨打斷？\n要打破我的膝蓋蓋？我知道我遲到了，而他們不斷地打電話也沒什麼...",
      "title": "爲什麼信用卡公司可以每天給我打電話10多次？我知道我已經遲到了..."
    }
  ]
}