{
  "author": "TxDrumsticks",
  "original_created_utc": 1630975539,
  "title": "At what point in history did the idea of a “chain” (i.e. restaurants, taverns, stores, etc.) develop?",
  "created_utc": 1631007997,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For example, could a roman drop in on a standardized tavern setting that was present in multiple places across Rome? Could a medieval worker find the same set of tools in multiple places across the city nearest them? Could a victorian aristocrat find the same quality equipment for sports or horseback riding in multiple places? Etc. etc. I imagine the logistical requirements would limit how big such a chain could get in the old world, but when did the effort to develop a standard experience across multiple business places first start to become commonplace?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/pjcd6o/at_what_point_in_history_did_the_idea_of_a_chain/",
  "subreddit": "AskHistorians",
  "id": "pjcd6o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "For example, could a roman drop in on a standardized tavern setting that was\npresent in multiple places across Rome? Could a medieval worker find the same\nset of tools in multiple places across the city nearest them? Could a victorian\naristocrat find the same quality equipment for sports or…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "例えば、ローマの複数の場所に存在する標準化された酒場の設定に、ローマ人が立ち寄ることができるでしょうか？\n例えば、ローマの複数の場所に存在する標準的な居酒屋の設定に、ローマ人が立ち寄ることができるでしょうか？中世の労働者は、自分の近くの都市の複数の場所で同じ\n中世の労働者は、同じ道具を最寄りの都市の複数の場所で見つけることができたでしょうか？ヴィクトリア朝の貴族が\nヴィクトリア朝の貴族は、スポーツや......同じ品質の道具を見つけることができるでしょうか？",
      "title": "レストラン、居酒屋、店舗などの「チェーン」という考え方は、歴史上のどの時点で生まれたのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "例如，一个罗马人可以在一个标准化的酒馆环境中落脚吗？\n在整个罗马的多个地方出现？一个中世纪的工人能不能在穆尔西姆找到同样的\n在离他们最近的城市的多个地方找到同一套工具？一个维多利亚时代的\n一个维多利亚时代的贵族能不能找到同样质量的运动器材或......",
      "title": "在历史上什么时候形成了 \"连锁 \"的概念（即餐馆、酒馆、商店等）？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "例如，一個羅馬人可以在一個標準化的酒館環境中落腳嗎？\n在整個羅馬的多個地方出現？一箇中世紀的工人能不能在穆爾西姆找到同樣的\n在離他們最近的城市的多個地方找到同一套工具？一個維多利亞時代的\n一個維多利亞時代的貴族能不能找到同樣質量的運動器材或......",
      "title": "在歷史上什麼時候形成了 \"連鎖 \"的概念（即餐館、酒館、商店等）？"
    }
  ]
}