{
  "author": "Basilikon",
  "original_created_utc": 1638316406,
  "title": "Of the twenty-five Einsatzgruppe commanders, a shocking fifteen of them had Ph.Ds. Why did the SS insist on having their Death Squads run by credentialed academics?",
  "created_utc": 1638394000,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;From Chapter 4 of Timothy Snyder&amp;#39;s &lt;em&gt;Bloodlands&lt;/em&gt;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Einsatzgruppen had been deployed in Austria and Czechoslovakia, but met little resistance in these countries and had no special mission to kill selected groups. It was in Poland that the Einsatzgruppen were to fulfill their mission as “ideological soldiers” by eliminating the educated classes of a defeated enemy. (&lt;strong&gt;They were in some sense killing their peers: fifteen of the twenty-five Einsatzgruppe and Einsatzkommando commanders had doctorates.&lt;/strong&gt;)&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Snyder is citing Browning&amp;#39;s &lt;em&gt;Origins of the Final Solution&lt;/em&gt;, which says:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;As in Poland, Heydrich did not hesitate to draw from his stable of highly\neducated Nazis. Of the four Einsatzgruppen commanders, three held a total of\nfour doctorates: Dr. Dr. Otto Rasch of EG C, Dr. Franz Walter Stahlecker of EG A,\nand Dr. Otto Ohlendorf of EG D. &lt;/p&gt;\n\n&lt;p&gt;Of the seventeen sk, ek, and Vorkommando\nchiefs, a further seven held the doctorate: Dr. Martin Sandberger (sk 1a), Dr.\nErich Ehrlinger (sk 1b), Dr. Walter Blume (sk 7a), Dr. Erhard Kroeger (ek 6),\nDr. Otto Bradfisch (ek 8), Dr. Alfred Filbert (ek 9), and Prof. Dr. Franz Six\n(Vorkommando Moscow). Some were taken from the upper ranks of the rsha in\nBerlin: Nebe, Ohlendorf, Six, Sandberger, Filbert, Blume, and Erwin Schulz\n(ek 5). Rasch and Stahlecker commanded the Security Police headquarters in\nKönigsberg and Prague. Many others were branch Office Security Police and\nGestapo chiefs: Rudolf Batz (ek 2) from Hanover, Günther Hermann (sk 4b)\nfrom Brünn, Heinz Seetzen (sk 10a) from Hamburg, and Gustav Nosske (ek 12)\nfrom Aachen.&lt;/p&gt;\n\n&lt;p&gt;Whatever their immediate previous postings, most of these officers had risen\nthrough Heydrich’s SD. They virtually all shared the same ideological outlook\nconcerning Jews, Bolsheviks, and Slavs and Germany’s imperial future in the\neast as well as attitudes and dispositions of ‘‘energetic ruthlessness,’’ initiative,\nand activism that were the common characteristics of the SS intellectual elite. If\nthe top officers were handpicked, there is no indication that ideological reliability was ever seen as a necessary distinguishing criterion among the candidates under consideration&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Browning is citing here:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Krausnick and Wilhelm, Die Truppe des Weltanschauungskrieges, p. 148; Ogorreck,\n‘‘Die Einsatzgruppen der Sicherheitspolizei,’’ p. 152.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Which, well, I can&amp;#39;t read.  &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not sure if I&amp;#39;m misreading this, but Browning seems to state, contra Snyder, that it was actually 11/21 commanders/subcommanders that had doctorates (one had &lt;em&gt;two&lt;/em&gt;!)&lt;/p&gt;\n\n&lt;p&gt;In any case, what on earth is going on here?  Is this maybe some quirk of the German academic system, and these people actually had the equivalent of Juris Doctors, with lawyers overrepresented in the elite police circles Himmler was pulling from? How common was a doctorate among Nazi officers?  What did these people tend to have their doctorates in?  Were they &amp;quot;STEM&amp;quot;, like how contemporary terrorists commonly have graduate education in engineering?  Or humanities scholars radicalized in the academy?  Why were they chosen for these jobs over mere ideological fanatics with a taste for blood, like you&amp;#39;d usually envision running a death squad?  How and why did a bunch of trained academics end up getting charged with murdering all the Jews in eastern europe?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 1747,
  "permalink": "/r/AskHistorians/comments/r610yn/of_the_twentyfive_einsatzgruppe_commanders_a/",
  "subreddit": "AskHistorians",
  "id": "r610yn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "From Chapter 4 of Timothy Snyder's Bloodlands\n\n> Einsatzgruppen had been deployed in Austria and Czechoslovakia, but met little\n> resistance in these countries and had no special mission to kill selected\n> groups. It was in Poland that the Einsatzgruppen were to fulfill their mission\n> as…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ティモシー・スナイダー著「ブラッドランズ」第4章より\n\n> アインザッツグルッペンはオーストリアとチェコスロバキアに配備されていたが、ほとんど出会わなかった。\n> これらの国では抵抗はなく、選ばれた人を殺すという特別な使命はなかった。\n> グループ アインザッツグルッペンがその使命を果たすことになったのはポーランドであった。\n> ということです。",
      "title": "アインザッツグルッペの指揮官25人のうち、博士号を持つ者は15人という衝撃的な数字だった。なぜSSは死の部隊の運営に学識経験者にこだわったのだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "摘自蒂莫西-斯奈德《血域》第四章\n\n> 在奥地利和捷克斯洛伐克部署了恩萨茨克虏伯部队，但在这些国家几乎没有遇到抵抗，也没有什么特殊的任务。\n> 但在这些国家几乎没有遇到抵抗，也没有执行杀害特定群体的特殊任务。\n> 群体。在波兰，纳粹党卫军要完成他们的任务。\n> 作为...",
      "title": "在二十五名死亡小组指挥官中，有十五人拥有博士学位，令人震惊。为什么党卫军坚持让他们的行刑队由有资历的学者管理？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "摘自蒂莫西-斯奈德《血域》第四章\n\n> 在奧地利和捷克斯洛伐克部署了恩薩茨克虜伯部隊，但在這些國家幾乎沒有遇到抵抗，也沒有什麼特殊的任務。\n> 但在這些國家幾乎沒有遇到抵抗，也沒有執行殺害特定羣體的特殊任務。\n> 羣體。在波蘭，納粹黨衛軍要完成他們的任務。\n> 作爲...",
      "title": "在二十五名死亡小組指揮官中，有十五人擁有博士學位，令人震驚。爲什麼黨衛軍堅持讓他們的行刑隊由有資歷的學者管理？"
    }
  ]
}