{
  "author": "DN-BBY",
  "the_new_excerpt": "AppHarvest is a publicly traded Indoor Farming based in the US. While there are\nseveral other in door farming companies like Gotham Greens and AeroFarms, APPH\nis the only one of the bunch that is publicly traded. Indoor farming, IMO is the\nfuture, and there currently is no dominant company like…",
  "original_created_utc": 1613772160,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "AppHarvest是一家总部位于美国的室内养殖上市公司。虽然有\n其他几家门内养殖公司，如Gotham Greens和AeroFarms、APPH。\n是这群人中唯一一个公开交易的。室内养殖，我认为是\n未来，而目前还没有一家主导公司像...",
      "title": "$APPH - AppHarvest - 美国室内农业的未来，位于肯塔基州的Aggtech公司"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "AppHarvest是一家總部位於美國的室內養殖上市公司。雖然有\n其他幾家門內養殖公司，如Gotham Greens和AeroFarms、APPH。\n是這羣人中唯一一個公開交易的。室內養殖，我認爲是\n未來，而目前還沒有一家主導公司像...",
      "title": "$APPH - AppHarvest - 美國室內農業的未來，位於肯塔基州的Aggtech公司"
    }
  ],
  "title": "$APPH - AppHarvest - Future of US Indoor Farming, Aggtech Company Based In Kentucky",
  "created_utc": 1613785013,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>AppHarvest is a publicly traded Indoor Farming based in the US. While there are several other in door farming companies like Gotham Greens and AeroFarms, APPH is the only one of the bunch that is publicly traded. Indoor farming, IMO is the future, and there currently is no dominant company like Tesla, Amazon, Apple in the AggTech Space. APPH only has a market cap of $4B. <strong>Investing in APPH will not only position you for the future, but also allow you to capitalize on the sustainability movement</strong>.</p>\n\n<p>The market share of indoor farms in the total aggriculture market is very small, giving lots of room for growth. Indoor farming only produces  roughly 14B of goods compared to 400b of production in US.  <strong>At a market cap of 4B, I bought APPH for the growth potential and my belief that there will one day be a dominant Aggtech player and that indoor farms will take over farming in the future</strong>.  In comparison, Tesla has a 750B market cap.</p>\n\n<p>APPH is based in Kentucky. The founder, Jonathan Webb grew up in Kentucky and went to University of Kentucky. It makes me feel like he&#39;s in this for the long haul and wants to give back to the community there. Webb has aspirations to make Kentucky the Aggtech capital of USA. Kentucky is also a strategic location in that it has cheap land and access to rain water.</p>\n\n<p>So why indoor farming:</p>\n\n<p>------------------------------------------------------------------------------------------------------------------------------------------------</p>\n\n<p><strong>Benefits Of Indoor Farming</strong>: This is pretty self explanatory but I will name a few</p>\n\n<ul>\n<li><strong>Less use of water</strong>: APPH and other indoor farms claim to use 90% less water than conventional farms. <a href=\"https://www.appharvest.com/\">https://www.appharvest.com/</a></li>\n<li><strong>Can grow year round</strong></li>\n<li><strong>Not dependent on climate</strong></li>\n<li><strong>Can be done vertically to take up less space</strong></li>\n<li><strong>Can be grown without the use of pesticides</strong> - decreasing chemicals released</li>\n</ul>\n\n<p>In a nutshell, Indoor Farming is the way of the future. With climate change, outdoor farming has become unpredictable. Much of US farming is only able to sell their goods for so cheap due to subsidies. Fresh water is also decreasing and desalination is expensive. <a href=\"https://www.bbc.com/future/article/20170412-is-the-world-running-out-of-fresh-water\">https://www.bbc.com/future/article/20170412-is-the-world-running-out-of-fresh-water</a> The human population continues to grow and food shortages is a legitimate problem - hence some companies are looking into bugs as the protein of the future. <a href=\"https://www.nytimes.com/2019/08/08/climate/climate-change-food-supply.html\">https://www.nytimes.com/2019/08/08/climate/climate-change-food-supply.html</a> , <a href=\"https://www.cnbc.com/2020/02/14/bug-protein-how-entrepreneurs-are-persuading-americans-to-eat-insects.html\">https://www.cnbc.com/2020/02/14/bug-protein-how-entrepreneurs-are-persuading-americans-to-eat-insects.html</a> No matter what the solution is, the fact is, <strong>we need to feed humans and we need to do it in a more efficient way</strong>.</p>\n\n<p>---------------------------------------------------------------------------------------------------------------------------------------------</p>\n\n<p><strong>Indoor Farming vs. Conventional Farming</strong>:</p>\n\n<p>Currently, indoor farming is still a bit more expensive than conventional farming. APPH is selling it&#39;s tomatoes as &#39;organic&#39; which allows it to price it higher. However, the trend is reversing. While outdoor farming continues to face increasing costs due to use of pesticides, climate change, and water costs, indoor farming faces the opposite problem. Many US outdoor farms are only able to sell at cheap prices due to subsidies. Advancements in technology well continue to decrease the costs for indoor farming. Conventional farms also usually are located far from populous areas and will have additional supply chain costs. Indoor farms can be located wherever it makes sense to be located. For more info: <a href=\"https://www.growcomputer.io/blog/2020/3/9/change-in-agriculture\">https://www.growcomputer.io/blog/2020/3/9/change-in-agriculture</a></p>\n\n<p>Costs of indoor farming include the initial investment cost of building the facility. After that, the main repeat cost is electricity to power the led lamps. However, it is still sustainable after electric costs: <a href=\"https://www.eitfood.eu/blog/post/is-vertical-farming-really-sustainable\">https://www.eitfood.eu/blog/post/is-vertical-farming-really-sustainable</a> Indoor farms as mentioned see vast reduction in needs for water, pesticides, land area, supply chain, and other costs that traditional farms see.</p>\n\n<p><strong>Indoor farming is already very successful</strong>. Believe it or not, tiny Neterhlands is the SECOND largest exporter of food, after the US - all due to the their ability to farm indoors. National Geographic did an excerpt here: <a href=\"https://investinholland.com/wp-content/uploads/2019/06/NFIA-National-Geographic-Article_final-A4.pdf\">https://investinholland.com/wp-content/uploads/2019/06/NFIA-National-Geographic-Article_final-A4.pdf</a> In door farm technology can be used to grow crops anywhere, even in the Sahara.</p>\n\n<p>-------------------------------------------------------------------------------------------------------------------------------------------------</p>\n\n<p><strong>Indoor Farming Has ALOT of Potential</strong>: Besides what&#39;s listed above, indoor farming can leverage AI in making farms automated and increase yield. Tech companies have been investing in indoor farms due to the potential to use technology and AI to increase yield and produce crops. <a href=\"http://economyleague.org/providing-insight/regional-direction/2018/08/10/the-promise-and-peril-of-vertical-farming\">http://economyleague.org/providing-insight/regional-direction/2018/08/10/the-promise-and-peril-of-vertical-farming</a> Additionally, the US governemnt has been eyeing ways to support indoor farming: <a href=\"https://www.usda.gov/media/blog/2018/08/14/vertical-farming-future\">https://www.usda.gov/media/blog/2018/08/14/vertical-farming-future</a></p>\n\n<p>I truely believe, whether or not people like to think in those terms, that water and food will become a scarcer resource in the future. I also truly believe that indoor farming is the future, especially as we as humans look to become more sustainable.</p>\n\n<p>I&#39;m not usually big on celebrity endorsers, but Martha Stewart is firmly behind APPH. <a href=\"https://www.greenhousegrower.com/crops/martha-stewart-among-big-names-joining-appharvest-team/\">https://www.greenhousegrower.com/crops/martha-stewart-among-big-names-joining-appharvest-team/</a></p>\n\n<p>Like any budding industry, the market is currently pretty fragmented, but APPH is the one I am backing due to strategic location, tech, and company CEO. They also have David Lee on the team, who was the CFO of Impossible Foods.  This means it&#39;s ripe for a dominant player to show up. All indoor farms should grow and capture some market share from traditional farms, regardless who you back.  More on APPH views: <a href=\"https://www.foodnavigator-usa.com/Article/2021/01/19/AppHarvest-releases-first-tomato-harvest-to-mass-retail\">https://www.foodnavigator-usa.com/Article/2021/01/19/AppHarvest-releases-first-tomato-harvest-to-mass-retail</a></p>\n\n<p>-------------</p>\n\n<p>Disclaimer: I am long APPH. Investors should carefully consider the investment objectives and risks before investing. Opinions and statements of financial market trends that are based on current market conditions constitute my judgment and are subject to change without notice. My bullish sentiment is my opinion and was reached after doing due diligence on the industry and company.</p>\n</div><!-- SC_ON -->",
  "score": 385,
  "permalink": "/r/investing/comments/lnrl28/apph_appharvest_future_of_us_indoor_farming/",
  "subreddit": "investing",
  "id": "lnrl28",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332881982
}