{
  "approved_at_utc": null,
  "subreddit": "investing",
  "selftext": "Original article at Seeking Alpha (non-paywall link): [https://archive.is/CUIAS](https://archive.is/CUIAS)\n\n## Intel Drops A Bomb On The Robotaxi Industry\n\n## Summary\n\n* Despite  most investors focusing on Tesla for robotaxis, Intel’s Mobileye is  currently in volume production of its camera-only L2+ autonomous driving  SuperVision system, beating all competitors to the punch.\n* Moreover,  Mobileye announced the world’s first L4 consumer vehicle, launching in  early 2024. Mobileye has a substantial technology and first-mover  advantage.\n* If  Tesla bulls can attribute a $1T market cap to their company’s  non-existent robotaxis, then initiating Mobileye at a $1T price target  (representing 20x upside) seems reasonable.\n* Mobileye could hence become one of the greatest investments of the coming decades.\n\n## Investment Thesis\n\nIn a significant bit of news that likely went largely unnoticed by the investment community, not Tesla ([TSLA](https://archive.is/o/CUIAS/https://seekingalpha.com/symbol/TSLA?source=content_type:react|section:main_content|button:body_link)), Nvidia ([NVDA](https://archive.is/o/CUIAS/https://seekingalpha.com/symbol/NVDA?source=content_type:react|section:main_content|button:body_link)) or anyone else, but actually Intel ([INTC](https://archive.is/o/CUIAS/https://seekingalpha.com/symbol/INTC?source=content_type:react|section:main_content|button:body_link))  Mobileye achieved a major milestone in late 2021 by going into volume  production of its camera-only SuperVision autonomous driving system.  Combined with Mobileye's robotaxi business that will start operating in  two international cities in 2022 (based on a camera-based system  combined with a lidar and radar-system), this means autonomous driving  has finally gone from the lab to the fab, and is poised to contribute  billions or even trillions in value to the economy as the technology  gains scale in the coming years and decade(s).\n\nIn addition, perhaps the most significant news from CES this week was the [announcement](https://archive.is/o/CUIAS/https://www.mobileye.com/ces-2022/) of the world's first L4 consumer AV, slated for an early 2024 launch, yet again beating others such as Tesla to the punch.\n\nAs  such, Mobileye could become one of the new Big Tech companies as the  backbone of the 21st century autonomous transportation system. Hence, I  initiate Mobileye (which will IPO in mid-2022) at a $1T market cap  target, which could represent 20x upside from its suggested $50B IPO.\n\n## Background\n\nWhen  people talk about autonomous driving, there is one myth that is often  discussed: the need for compute (measured in TOPS). For that reason,  many investors have pointed to Nvidia as a beneficiary of autonomous  driving. For example, NIO ([NIO](https://archive.is/o/CUIAS/https://seekingalpha.com/symbol/NIO?source=content_type:react|section:main_content|button:body_link))  uses 4x Nvidia Orin SoCs in its upcoming ET7 NIO Autonomous Driving  System, for a grand total of 1 POPS (1000 TOPS), combined with over 30  sensors including lidar.\n\nI provide this comparison to give the  reader an impression of just how impressive Mobileye's approach is:  Mobileye's SuperVision, which has gone into production in late 2021 in  the Geely Zeekr 001, leverages just two EyeQ5 SoCs for a grand total of  30 TOPS. Nevertheless, despite having over 30x less compute resources,  Mobileye achieves pretty much exactly the same (or even more advanced)  capabilities as any other car currently in production. Mobileye's system  also uses about 3x less sensors since, similar to Tesla, SuperVision is  completely camera-only (using seven cameras and four parking cameras).\n\nTo  be specific, the SuperVision allows for completely hands-free driving  (like a robotaxi or \"full self-driving\"). (The reason the system is  nevertheless classified as L2+ is because it isn't validated for the  safety requirements for L4.)\n\nIn other words, it really matters  what one does with the compute resources available (the software), and  Mobileye has proven for years that it can do more with less. What this  means is simply that Mobileye's software is much smarter since it can  more effectively make use of the available compute. Mobileye's CTO has  recently [provided a deep dive into the SuperVision system](https://archive.is/o/CUIAS/https://www.youtube.com/watch?v=ViGL0z1BULs),  which is worth watching to see the system in action in cities like  Paris and New York City. Note that no other company in the world has  been testing its autonomous driving system in as many locations as  Mobileye, another testament and proof point of Mobileye's ability to  scale its system, which I further detailed previously: [Waymo May Be Disrupted By Its Inability To Scale (NASDAQ:](https://archive.is/o/CUIAS/https://seekingalpha.com/article/4432226-waymo-may-be-disrupted-by-its-inability-to-scale?source=content_type:react|section:main_content|button:body_link)[GOOG](https://archive.is/o/CUIAS/https://seekingalpha.com/symbol/GOOG?source=content_type:react|section:main_content|button:body_link)).\n\n## Consumer AVs\n\nSuperVision  is still just a L2+ system: despite being fully capable of autonomous  driving, it has not been validated for the reliability requirements for  the \"holy grail\" L4. So admittedly, it will still take a few years for  autonomous driving to become a reality for consumer: Mobileye is  targeting 2024.\n\nIn its L4 system, in order to reach the required  reliability, Mobileye will combine the camera-only SuperVision system  with a second system based on lidar and radar (similar to its approach  in robotaxis). Mobileye has even suggested perhaps there could even be  three subsystems if the lidar and radar are further split into separate  systems, which will become possible due to Mobileye's in-house lidar  (based on Intel's industry-leading silicon photonics) and innovative  high-resolution in-house software-defined radar. Mobileye especially  sees the high-res radar as promising to reduce the cost for affordable  AVs since radar is inherently 5-10x less expensive than lidar.\n\nSo  although it could be debated if and to what extent the recent  SuperVision system counts as \"full self-driving\", it nevertheless serves  as a first proof point that autonomous driving has finally gone from  something that perpetually seems five years away, to a tangible  commercial reality.\n\nIn any case, Mobileye's grand [announcement](https://archive.is/o/CUIAS/https://www.intel.com/content/www/us/en/newsroom/news/zeekr-mobileye-working-together.html%23gs.ld0ya8)  at CES was its very first L4 design win with Geely Zeekr, slated for  early 2024. This system will be based on 8x EyeQ5 SoCs (or about 120  TOPS).\n\nMobileye further [announced its next-gen SoC](https://archive.is/o/CUIAS/https://www.intel.com/content/www/us/en/newsroom/news/mobileye-ces-2022-tech-news.html%23gs.kr10jb)  for widespread adoption of AVs starting in 2025. The EyeQ Ultra is  touted as Mobileye's AV-on-a-Chip, providing all compute resources in a  single chip. It is one of the most heterogenous chips ever created,  containing CPUs, GPUs, NPUs, FPGAs, VPUs and more.\n\n&gt;At  a mere 176 TOPS, the EyeQ Ultra is much more efficient than other AV  solutions, delivering the necessary performance and price-point required  for consumer-level AVs.\n\n## Robotaxis\n\nIn  addition to extending its current industry-leading position in ADAS into  AVs, Mobileye saw several years ago that autonomous driving would first  start with robotaxis, and has likewise been investing to lead this new  industry (as evidenced by the [2020 Moovit acquisition](https://archive.is/o/CUIAS/https://seekingalpha.com/article/4346405-intel-distances-from-autonomous-vehicle-competition-1-billion-acquisition?source=content_type:react|section:main_content|button:body_link)  for example). Mobileye has been testing its robotaxis for many years in  Israel, expanded its testing to Munich/Germany in late 2020, and  further expended testing to many other cities in 2021, including in  Detroit, Paris, Asia, Tokyo and New York City.\n\nThis will  culminate in the initial robotaxi launch in Tel Aviv and Munich in  mid-2022, which is on schedule to what Mobileye has been saying since  2018 (!). This can't be emphasized enough since in the same time frame,  virtually all of Mobileye's competitors including Google ([GOOG](https://archive.is/o/CUIAS/https://seekingalpha.com/symbol/GOOG?source=content_type:react|section:main_content|button:body_link)) ([GOOGL](https://archive.is/o/CUIAS/https://seekingalpha.com/symbol/GOOGL?source=content_type:react|section:main_content|button:body_link)) Waymo, Tesla and GM ([GM](https://archive.is/o/CUIAS/https://seekingalpha.com/symbol/GM?source=content_type:react|section:main_content|button:body_link))  Cruise have seen delays to their programs. Mobileye is on track to what  it said four years ago, and is targeting an international rollout from  the start (made possible due to Mobileye's unique global mapping  approach as opposed to the legacy geofenced approach).\n\n## ADAS\n\nMobileye also [announced](https://archive.is/o/CUIAS/https://www.intel.com/content/www/us/en/newsroom/news/mobileye-ces-2022-partner-news.html%23gs.ld14rg) several extended ADAS partnerships at CES, including ones to bring its REM mapping for lane-centering ADAS to Volkswagen ([OTCPK:VWAGY](https://archive.is/o/CUIAS/https://seekingalpha.com/symbol/VWAGY?source=content_type:react|section:main_content|button:body_link)) and Ford ([F](https://archive.is/o/CUIAS/https://seekingalpha.com/symbol/F?source=content_type:react|section:main_content|button:body_link)).\n\nMobileye  further announced that it had achieved 41 design wins totalling 50M  units in 2021. For comparison, Mobileye shipped its 100 millionth EyeQ  in late 2021.\n\n## 200PB of data\n\nOne oft-heard argument is that supposedly only Tesla has the data and has the Dojo supercomputers. This is false, as [Intel detailed](https://archive.is/o/CUIAS/https://www.intel.com/content/www/us/en/newsroom/news/mobileye-ces-2022-self-driving-secret-data.html?utm_source=twitter&amp;utm_medium=social&amp;CID=iosm&amp;icid=100002810424702%257Calways-on&amp;linkId=100000101282322%23gs.lg2vve) Mobileye has 200PB of data and 500k CPU cores:\n\n&gt;Mobileye  has spent 25 years collecting and analyzing what we believe to be the  industry's leading database of real-world and simulated driving  experience\n\n## Valuation\n\nGiven Mobileye's  nearly flawless execution to its comprehensive vision and strategy,  Mobileye is quickly establishing a tangible leadership position in both  robotaxis and consumer AVs. As such, I would argue that Mobileye  deserves a premium valuation as one of the upcoming new Big Tech  companies.\n\nAs such, the sky is the limit. For example, Tesla  investors for years have attributed trillion-dollar valuations to the  company based on the promised (but never delivered) 1 million robotaxis  in 2020. Clearly, not Tesla but Mobileye is now making this premise a  reality.\n\nInvestors should note that robotaxis are inherently  poised to be very profitable since they remove virtually all opex costs,  by removing many thousands (if not millions) of drivers from the  (transportation) economy. This will make robotaxis both cheaper and more  profitable than legacy ride-hailing services like Uber ([UBER](https://archive.is/o/CUIAS/https://seekingalpha.com/symbol/UBER?source=content_type:react|section:main_content|button:body_link)), Lyft ([LYFT](https://archive.is/o/CUIAS/https://seekingalpha.com/symbol/LYFT?source=content_type:react|section:main_content|button:body_link)) and DiDi ([DIDI](https://archive.is/o/CUIAS/https://seekingalpha.com/symbol/DIDI?source=content_type:react|section:main_content|button:body_link)).\n\nAs  such, there is indeed no reason why Mobileye shouldn't be able to  aspire to this $1 trillion market cap target, which is indeed the target  I initiate Mobileye coverage at.\n\n## Risks\n\nGiven Mobileye's  progress on the technology side, which as detailed is now being  translated into numerous commercial deals, the main risk now is  regulation. However, Mobileye has already [said](https://archive.is/o/CUIAS/https://www.timesofisrael.com/mobileye-to-launch-autonomous-taxi-pilot-in-tel-aviv-munich-in-2022/) it is on track to operate its robotaxis in Germany and Israel without safety driver by the end of 2022.\n\n## Investor Takeaway\n\nAlthough  the Geely Zeekr 001 launch with Mobileye's camera-only autonomous  driving system went largely unnoticed, it represents a significant first  milestone towards the ultimate blue sky vision of an economy based on  driverless transportation, freeing up potentially many millions of jobs.  The value this creates will be immense, and hence Mobileye, as the  leader in driving this revolution, should be valued exactly as such.\n\nThe  next milestone is slated in the next few months already with the start  of Mobileye's international robotaxi business. The next milestone after  that will be the completion of Intel's in-house lidar and radar, which  will bring the cost down to levels suitable for mass production in  consumer vehicles. This is targeted for early 2024 (also in partnership  with Geely Zeekr), and will likely be the world's first commercial L4  consumer AV.\n\nHence, autonomous driving is quickly becoming a  commercial (and profitable) reality, for which the mid-2022 Mobileye IPO  provides investors with potentially one of the best investments for the  coming decades.\n\n**Disclosure:** I/we have a beneficial long position in the shares of INTC either through stock ownership, options, or other derivatives. I  wrote this article myself, and it expresses my own opinions. I am not  receiving compensation for it (other than from Seeking Alpha). I have no  business relationship with any company whose stock is mentioned in this  article.",
  "author_fullname": "t2_62fsc95g",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Intel Drops A Bomb On The Robotaxi Industry",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/investing",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_s0ncv2",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.7,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 41,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 41,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1641830554,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.investing",
  "allow_live_comments": true,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Original article at Seeking Alpha (non-paywall link): &lt;a href=\"https://archive.is/CUIAS\"&gt;https://archive.is/CUIAS&lt;/a&gt;&lt;/p&gt;\n\n&lt;h2&gt;Intel Drops A Bomb On The Robotaxi Industry&lt;/h2&gt;\n\n&lt;h2&gt;Summary&lt;/h2&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Despite  most investors focusing on Tesla for robotaxis, Intel’s Mobileye is  currently in volume production of its camera-only L2+ autonomous driving  SuperVision system, beating all competitors to the punch.&lt;/li&gt;\n&lt;li&gt;Moreover,  Mobileye announced the world’s first L4 consumer vehicle, launching in  early 2024. Mobileye has a substantial technology and first-mover  advantage.&lt;/li&gt;\n&lt;li&gt;If  Tesla bulls can attribute a $1T market cap to their company’s  non-existent robotaxis, then initiating Mobileye at a $1T price target  (representing 20x upside) seems reasonable.&lt;/li&gt;\n&lt;li&gt;Mobileye could hence become one of the greatest investments of the coming decades.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;h2&gt;Investment Thesis&lt;/h2&gt;\n\n&lt;p&gt;In a significant bit of news that likely went largely unnoticed by the investment community, not Tesla (&lt;a href=\"https://archive.is/o/CUIAS/https://seekingalpha.com/symbol/TSLA?source=content_type:react%7Csection:main_content%7Cbutton:body_link\"&gt;TSLA&lt;/a&gt;), Nvidia (&lt;a href=\"https://archive.is/o/CUIAS/https://seekingalpha.com/symbol/NVDA?source=content_type:react%7Csection:main_content%7Cbutton:body_link\"&gt;NVDA&lt;/a&gt;) or anyone else, but actually Intel (&lt;a href=\"https://archive.is/o/CUIAS/https://seekingalpha.com/symbol/INTC?source=content_type:react%7Csection:main_content%7Cbutton:body_link\"&gt;INTC&lt;/a&gt;)  Mobileye achieved a major milestone in late 2021 by going into volume  production of its camera-only SuperVision autonomous driving system.  Combined with Mobileye&amp;#39;s robotaxi business that will start operating in  two international cities in 2022 (based on a camera-based system  combined with a lidar and radar-system), this means autonomous driving  has finally gone from the lab to the fab, and is poised to contribute  billions or even trillions in value to the economy as the technology  gains scale in the coming years and decade(s).&lt;/p&gt;\n\n&lt;p&gt;In addition, perhaps the most significant news from CES this week was the &lt;a href=\"https://archive.is/o/CUIAS/https://www.mobileye.com/ces-2022/\"&gt;announcement&lt;/a&gt; of the world&amp;#39;s first L4 consumer AV, slated for an early 2024 launch, yet again beating others such as Tesla to the punch.&lt;/p&gt;\n\n&lt;p&gt;As  such, Mobileye could become one of the new Big Tech companies as the  backbone of the 21st century autonomous transportation system. Hence, I  initiate Mobileye (which will IPO in mid-2022) at a $1T market cap  target, which could represent 20x upside from its suggested $50B IPO.&lt;/p&gt;\n\n&lt;h2&gt;Background&lt;/h2&gt;\n\n&lt;p&gt;When  people talk about autonomous driving, there is one myth that is often  discussed: the need for compute (measured in TOPS). For that reason,  many investors have pointed to Nvidia as a beneficiary of autonomous  driving. For example, NIO (&lt;a href=\"https://archive.is/o/CUIAS/https://seekingalpha.com/symbol/NIO?source=content_type:react%7Csection:main_content%7Cbutton:body_link\"&gt;NIO&lt;/a&gt;)  uses 4x Nvidia Orin SoCs in its upcoming ET7 NIO Autonomous Driving  System, for a grand total of 1 POPS (1000 TOPS), combined with over 30  sensors including lidar.&lt;/p&gt;\n\n&lt;p&gt;I provide this comparison to give the  reader an impression of just how impressive Mobileye&amp;#39;s approach is:  Mobileye&amp;#39;s SuperVision, which has gone into production in late 2021 in  the Geely Zeekr 001, leverages just two EyeQ5 SoCs for a grand total of  30 TOPS. Nevertheless, despite having over 30x less compute resources,  Mobileye achieves pretty much exactly the same (or even more advanced)  capabilities as any other car currently in production. Mobileye&amp;#39;s system  also uses about 3x less sensors since, similar to Tesla, SuperVision is  completely camera-only (using seven cameras and four parking cameras).&lt;/p&gt;\n\n&lt;p&gt;To  be specific, the SuperVision allows for completely hands-free driving  (like a robotaxi or &amp;quot;full self-driving&amp;quot;). (The reason the system is  nevertheless classified as L2+ is because it isn&amp;#39;t validated for the  safety requirements for L4.)&lt;/p&gt;\n\n&lt;p&gt;In other words, it really matters  what one does with the compute resources available (the software), and  Mobileye has proven for years that it can do more with less. What this  means is simply that Mobileye&amp;#39;s software is much smarter since it can  more effectively make use of the available compute. Mobileye&amp;#39;s CTO has  recently &lt;a href=\"https://archive.is/o/CUIAS/https://www.youtube.com/watch?v=ViGL0z1BULs\"&gt;provided a deep dive into the SuperVision system&lt;/a&gt;,  which is worth watching to see the system in action in cities like  Paris and New York City. Note that no other company in the world has  been testing its autonomous driving system in as many locations as  Mobileye, another testament and proof point of Mobileye&amp;#39;s ability to  scale its system, which I further detailed previously: &lt;a href=\"https://archive.is/o/CUIAS/https://seekingalpha.com/article/4432226-waymo-may-be-disrupted-by-its-inability-to-scale?source=content_type:react%7Csection:main_content%7Cbutton:body_link\"&gt;Waymo May Be Disrupted By Its Inability To Scale (NASDAQ:&lt;/a&gt;&lt;a href=\"https://archive.is/o/CUIAS/https://seekingalpha.com/symbol/GOOG?source=content_type:react%7Csection:main_content%7Cbutton:body_link\"&gt;GOOG&lt;/a&gt;).&lt;/p&gt;\n\n&lt;h2&gt;Consumer AVs&lt;/h2&gt;\n\n&lt;p&gt;SuperVision  is still just a L2+ system: despite being fully capable of autonomous  driving, it has not been validated for the reliability requirements for  the &amp;quot;holy grail&amp;quot; L4. So admittedly, it will still take a few years for  autonomous driving to become a reality for consumer: Mobileye is  targeting 2024.&lt;/p&gt;\n\n&lt;p&gt;In its L4 system, in order to reach the required  reliability, Mobileye will combine the camera-only SuperVision system  with a second system based on lidar and radar (similar to its approach  in robotaxis). Mobileye has even suggested perhaps there could even be  three subsystems if the lidar and radar are further split into separate  systems, which will become possible due to Mobileye&amp;#39;s in-house lidar  (based on Intel&amp;#39;s industry-leading silicon photonics) and innovative  high-resolution in-house software-defined radar. Mobileye especially  sees the high-res radar as promising to reduce the cost for affordable  AVs since radar is inherently 5-10x less expensive than lidar.&lt;/p&gt;\n\n&lt;p&gt;So  although it could be debated if and to what extent the recent  SuperVision system counts as &amp;quot;full self-driving&amp;quot;, it nevertheless serves  as a first proof point that autonomous driving has finally gone from  something that perpetually seems five years away, to a tangible  commercial reality.&lt;/p&gt;\n\n&lt;p&gt;In any case, Mobileye&amp;#39;s grand &lt;a href=\"https://archive.is/o/CUIAS/https://www.intel.com/content/www/us/en/newsroom/news/zeekr-mobileye-working-together.html%23gs.ld0ya8\"&gt;announcement&lt;/a&gt;  at CES was its very first L4 design win with Geely Zeekr, slated for  early 2024. This system will be based on 8x EyeQ5 SoCs (or about 120  TOPS).&lt;/p&gt;\n\n&lt;p&gt;Mobileye further &lt;a href=\"https://archive.is/o/CUIAS/https://www.intel.com/content/www/us/en/newsroom/news/mobileye-ces-2022-tech-news.html%23gs.kr10jb\"&gt;announced its next-gen SoC&lt;/a&gt;  for widespread adoption of AVs starting in 2025. The EyeQ Ultra is  touted as Mobileye&amp;#39;s AV-on-a-Chip, providing all compute resources in a  single chip. It is one of the most heterogenous chips ever created,  containing CPUs, GPUs, NPUs, FPGAs, VPUs and more.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;At  a mere 176 TOPS, the EyeQ Ultra is much more efficient than other AV  solutions, delivering the necessary performance and price-point required  for consumer-level AVs.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;h2&gt;Robotaxis&lt;/h2&gt;\n\n&lt;p&gt;In  addition to extending its current industry-leading position in ADAS into  AVs, Mobileye saw several years ago that autonomous driving would first  start with robotaxis, and has likewise been investing to lead this new  industry (as evidenced by the &lt;a href=\"https://archive.is/o/CUIAS/https://seekingalpha.com/article/4346405-intel-distances-from-autonomous-vehicle-competition-1-billion-acquisition?source=content_type:react%7Csection:main_content%7Cbutton:body_link\"&gt;2020 Moovit acquisition&lt;/a&gt;  for example). Mobileye has been testing its robotaxis for many years in  Israel, expanded its testing to Munich/Germany in late 2020, and  further expended testing to many other cities in 2021, including in  Detroit, Paris, Asia, Tokyo and New York City.&lt;/p&gt;\n\n&lt;p&gt;This will  culminate in the initial robotaxi launch in Tel Aviv and Munich in  mid-2022, which is on schedule to what Mobileye has been saying since  2018 (!). This can&amp;#39;t be emphasized enough since in the same time frame,  virtually all of Mobileye&amp;#39;s competitors including Google (&lt;a href=\"https://archive.is/o/CUIAS/https://seekingalpha.com/symbol/GOOG?source=content_type:react%7Csection:main_content%7Cbutton:body_link\"&gt;GOOG&lt;/a&gt;) (&lt;a href=\"https://archive.is/o/CUIAS/https://seekingalpha.com/symbol/GOOGL?source=content_type:react%7Csection:main_content%7Cbutton:body_link\"&gt;GOOGL&lt;/a&gt;) Waymo, Tesla and GM (&lt;a href=\"https://archive.is/o/CUIAS/https://seekingalpha.com/symbol/GM?source=content_type:react%7Csection:main_content%7Cbutton:body_link\"&gt;GM&lt;/a&gt;)  Cruise have seen delays to their programs. Mobileye is on track to what  it said four years ago, and is targeting an international rollout from  the start (made possible due to Mobileye&amp;#39;s unique global mapping  approach as opposed to the legacy geofenced approach).&lt;/p&gt;\n\n&lt;h2&gt;ADAS&lt;/h2&gt;\n\n&lt;p&gt;Mobileye also &lt;a href=\"https://archive.is/o/CUIAS/https://www.intel.com/content/www/us/en/newsroom/news/mobileye-ces-2022-partner-news.html%23gs.ld14rg\"&gt;announced&lt;/a&gt; several extended ADAS partnerships at CES, including ones to bring its REM mapping for lane-centering ADAS to Volkswagen (&lt;a href=\"https://archive.is/o/CUIAS/https://seekingalpha.com/symbol/VWAGY?source=content_type:react%7Csection:main_content%7Cbutton:body_link\"&gt;OTCPK:VWAGY&lt;/a&gt;) and Ford (&lt;a href=\"https://archive.is/o/CUIAS/https://seekingalpha.com/symbol/F?source=content_type:react%7Csection:main_content%7Cbutton:body_link\"&gt;F&lt;/a&gt;).&lt;/p&gt;\n\n&lt;p&gt;Mobileye  further announced that it had achieved 41 design wins totalling 50M  units in 2021. For comparison, Mobileye shipped its 100 millionth EyeQ  in late 2021.&lt;/p&gt;\n\n&lt;h2&gt;200PB of data&lt;/h2&gt;\n\n&lt;p&gt;One oft-heard argument is that supposedly only Tesla has the data and has the Dojo supercomputers. This is false, as &lt;a href=\"https://archive.is/o/CUIAS/https://www.intel.com/content/www/us/en/newsroom/news/mobileye-ces-2022-self-driving-secret-data.html?utm_source=twitter&amp;amp;utm_medium=social&amp;amp;CID=iosm&amp;amp;icid=100002810424702%257Calways-on&amp;amp;linkId=100000101282322%23gs.lg2vve\"&gt;Intel detailed&lt;/a&gt; Mobileye has 200PB of data and 500k CPU cores:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Mobileye  has spent 25 years collecting and analyzing what we believe to be the  industry&amp;#39;s leading database of real-world and simulated driving  experience&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;h2&gt;Valuation&lt;/h2&gt;\n\n&lt;p&gt;Given Mobileye&amp;#39;s  nearly flawless execution to its comprehensive vision and strategy,  Mobileye is quickly establishing a tangible leadership position in both  robotaxis and consumer AVs. As such, I would argue that Mobileye  deserves a premium valuation as one of the upcoming new Big Tech  companies.&lt;/p&gt;\n\n&lt;p&gt;As such, the sky is the limit. For example, Tesla  investors for years have attributed trillion-dollar valuations to the  company based on the promised (but never delivered) 1 million robotaxis  in 2020. Clearly, not Tesla but Mobileye is now making this premise a  reality.&lt;/p&gt;\n\n&lt;p&gt;Investors should note that robotaxis are inherently  poised to be very profitable since they remove virtually all opex costs,  by removing many thousands (if not millions) of drivers from the  (transportation) economy. This will make robotaxis both cheaper and more  profitable than legacy ride-hailing services like Uber (&lt;a href=\"https://archive.is/o/CUIAS/https://seekingalpha.com/symbol/UBER?source=content_type:react%7Csection:main_content%7Cbutton:body_link\"&gt;UBER&lt;/a&gt;), Lyft (&lt;a href=\"https://archive.is/o/CUIAS/https://seekingalpha.com/symbol/LYFT?source=content_type:react%7Csection:main_content%7Cbutton:body_link\"&gt;LYFT&lt;/a&gt;) and DiDi (&lt;a href=\"https://archive.is/o/CUIAS/https://seekingalpha.com/symbol/DIDI?source=content_type:react%7Csection:main_content%7Cbutton:body_link\"&gt;DIDI&lt;/a&gt;).&lt;/p&gt;\n\n&lt;p&gt;As  such, there is indeed no reason why Mobileye shouldn&amp;#39;t be able to  aspire to this $1 trillion market cap target, which is indeed the target  I initiate Mobileye coverage at.&lt;/p&gt;\n\n&lt;h2&gt;Risks&lt;/h2&gt;\n\n&lt;p&gt;Given Mobileye&amp;#39;s  progress on the technology side, which as detailed is now being  translated into numerous commercial deals, the main risk now is  regulation. However, Mobileye has already &lt;a href=\"https://archive.is/o/CUIAS/https://www.timesofisrael.com/mobileye-to-launch-autonomous-taxi-pilot-in-tel-aviv-munich-in-2022/\"&gt;said&lt;/a&gt; it is on track to operate its robotaxis in Germany and Israel without safety driver by the end of 2022.&lt;/p&gt;\n\n&lt;h2&gt;Investor Takeaway&lt;/h2&gt;\n\n&lt;p&gt;Although  the Geely Zeekr 001 launch with Mobileye&amp;#39;s camera-only autonomous  driving system went largely unnoticed, it represents a significant first  milestone towards the ultimate blue sky vision of an economy based on  driverless transportation, freeing up potentially many millions of jobs.  The value this creates will be immense, and hence Mobileye, as the  leader in driving this revolution, should be valued exactly as such.&lt;/p&gt;\n\n&lt;p&gt;The  next milestone is slated in the next few months already with the start  of Mobileye&amp;#39;s international robotaxi business. The next milestone after  that will be the completion of Intel&amp;#39;s in-house lidar and radar, which  will bring the cost down to levels suitable for mass production in  consumer vehicles. This is targeted for early 2024 (also in partnership  with Geely Zeekr), and will likely be the world&amp;#39;s first commercial L4  consumer AV.&lt;/p&gt;\n\n&lt;p&gt;Hence, autonomous driving is quickly becoming a  commercial (and profitable) reality, for which the mid-2022 Mobileye IPO  provides investors with potentially one of the best investments for the  coming decades.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Disclosure:&lt;/strong&gt; I/we have a beneficial long position in the shares of INTC either through stock ownership, options, or other derivatives. I  wrote this article myself, and it expresses my own opinions. I am not  receiving compensation for it (other than from Seeking Alpha). I have no  business relationship with any company whose stock is mentioned in this  article.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qhhq",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "s0ncv2",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "polloponzi",
  "discussion_type": null,
  "num_comments": 35,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/investing/comments/s0ncv2/intel_drops_a_bomb_on_the_robotaxi_industry/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/investing/comments/s0ncv2/intel_drops_a_bomb_on_the_robotaxi_industry/",
  "subreddit_subscribers": 1980930,
  "created_utc": 1641849313,
  "num_crossposts": 1,
  "media": null,
  "is_video": false,
  "original_created_utc": 1641830554,
  "the_new_excerpt": "Original article at Seeking Alpha (non-paywall link): https://archive.is/CUIAS\n\n\nINTEL DROPS A BOMB ON THE ROBOTAXI INDUSTRY\n\n\nSUMMARY\n\n * Despite most investors focusing on Tesla for robotaxis, Intel’s Mobileye is\n   currently in volume production of its camera-only L2+ autonomous driving\n  …",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "元記事はSeeking Alpha（非ペイウォールリンク）：https://archive.is/CUIAS。\n\n\nインテルがロボットタクシー業界に爆弾を落とす\n\n\nSUMMARY\n\n * ほとんどの投資家がロボタクシーのテスラに注目しているにもかかわらず、インテルのモービルアイは\n   現在、カメラのみのL2+自律走行装置の量産が始まっています。\n  ...",
      "title": "インテル、ロボットタクシー業界に爆弾を落とす"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "原文见Seeking Alpha（非付费链接）：https://archive.is/CUIAS\n\n\n英特尔向机器人出租车行业投下一枚炸弹\n\n\n摘要\n\n * 尽管大多数投资者关注特斯拉的机器人车，但英特尔的Mobileye是\n   目前正在批量生产其仅有摄像头的L2+自动驾驶技术。\n  ...",
      "title": "英特尔向机器人出租车行业投下一枚炸弹"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "原文見Seeking Alpha（非付費鏈接）：https://archive.is/CUIAS\n\n\n英特爾向機器人出租車行業投下一枚炸彈\n\n\n摘要\n\n * 儘管大多數投資者關注特斯拉的機器人車，但英特爾的Mobileye是\n   目前正在批量生產其僅有攝像頭的L2+自動駕駛技術。\n  ...",
      "title": "英特爾向機器人出租車行業投下一枚炸彈"
    }
  ]
}