{
  "author": "Libertymark",
  "original_created_utc": 1636818693,
  "title": "All assets but a few are in a massive hyper bubbles",
  "created_utc": 1636854408,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am very concerned in general</p>\n\n<p>It seems humanity never learns and continues to create speculative bubbles even at the point of several years after crash in said asset class:</p>\n\n<p>All time high housing prices</p>\n\n<p>All time high stock prices</p>\n\n<p>All time high crypto prices</p>\n\n<p>All time high in folks out of labor force</p>\n\n<p>30 year high in inflation in cpi</p>\n\n<p>All time high gas prices</p>\n\n<p>Ribeye steak 100% more than year ago</p>\n\n<p>Something has to give folks and it wont be pretty</p>\n\n<p>Regarding crypto everyone on main st is talking about it. Confirmed it in real life with multiple age ranges</p>\n\n<p>Also insane dumb magical money printing schemes in crypto have attracted billions of dollars in defi</p>\n\n<p>When any of these bubbles above finally go bust or thru one simple bear painful market (90% of crypto projects are a zero) it will make the 98-2000 internet bubble look like childs play and the 2017 crypto bear a walk in the park</p>\n\n<p>Prepare folks</p>\n\n<p>Ps silver and gold look about to have a multi year BO. I am looking for a major top in most asset prices in next few months as last dumb money plows into speculative fever ala\nMarch 2000</p>\n\n<p>Ps2 - that doesnt mean specific crypto or stocks or industries dont outperform. I see lots of smaller cap stocks or\nStuff like algo as undervalued. I see eth as undervalued if it solves gas issue</p>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/CryptoCurrency/comments/qt3yo4/all_assets_but_a_few_are_in_a_massive_hyper/",
  "subreddit": "CryptoCurrency",
  "id": "qt3yo4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I am very concerned in general\n\nIt seems humanity never learns and continues to create speculative bubbles even\nat the point of several years after crash in said asset class:\n\nAll time high housing prices\n\nAll time high stock prices\n\nAll time high crypto prices\n\nAll time high in folks out of labor…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "一般的には非常に心配ですが\n\n人類は懲りずに投機バブルを作り続けているようです。\n数年経っても投機的なバブルを作り続けるようです。\n\n史上最高の住宅価格\n\n株価の史上最高値\n\n暗号価格の史上最高値\n\n過去最高の労働人口...",
      "title": "一部を除くすべての資産が大規模なハイパーバブルに陥っている。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我总体上非常担心\n\n人类似乎从未学会，并继续创造投机性泡沫，甚至在\n在上述资产类别崩溃数年后，仍在继续制造投机泡沫。\n\n房价创历史新高\n\n历史上最高的股票价格\n\n有史以来最高的加密货币价格\n\n有史以来最高的失业者人数...",
      "title": "除少数资产外，所有的资产都处于大规模的超级泡沫中"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我總體上非常擔心\n\n人類似乎從未學會，並繼續創造投機性泡沫，甚至在\n在上述資產類別崩潰數年後，仍在繼續製造投機泡沫。\n\n房價創歷史新高\n\n歷史上最高的股票價格\n\n有史以來最高的加密貨幣價格\n\n有史以來最高的失業者人數...",
      "title": "除少數資產外，所有的資產都處於大規模的超級泡沫中"
    }
  ]
}