{
  "author": "yvcn",
  "original_created_utc": 1652749221,
  "title": "My story as a freelancer and how I got this new business idea",
  "created_utc": 1652779389,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;After many years of freelancing, I realized that the hardest and most time-consuming task is prospecting and lead generation.&lt;/p&gt;\n\n&lt;p&gt;Of course there are many tools and strategies to generate leads, but most of them help you generate cold leads that aren&amp;#39;t always interested in your services as a freelancer or agency.&lt;/p&gt;\n\n&lt;p&gt;One day I have had enough, and started looking for a solution. I searched a bit on the web and I found different strategies that could work for me.&lt;/p&gt;\n\n&lt;p&gt;I selected three strategies and started exploring and testing them.&lt;/p&gt;\n\n&lt;p&gt;The first idea is to search and apply for Requests For Proposals (RFPs); it&amp;#39;s a business document that announces a project, describes it, and solicits bids from qualified contractors to complete it.\nThe second one is to look for startups that have recently raised funding and pitch my services to them.\nThe last idea is to look for companies that have an open job position and try to convince them that working with me as a contractor is better for their business.\nYou may ask why those three strategies would work for me, right ? It&amp;#39;s simple, I don&amp;#39;t want to waste time with cold leads because at the end of the day I&amp;#39;m not sure that they need my services, so I need to spend my time only with warm leads that are 100% looking for someone like me. This approach will significantly increase my chances of closing more clients.&lt;/p&gt;\n\n&lt;p&gt;And guess what ? It actually works. I spent less time and I closed more clients.&lt;/p&gt;\n\n&lt;p&gt;Ok, but how and where do you find them ? You just need to know how and where to search, on job boards, search engines, social media... with the right keywords and filters. Then you need to carefully read every RFP, job position, and startup news.. Then you select those that match your criteria.&lt;/p&gt;\n\n&lt;p&gt;Unfortunately, I didn&amp;#39;t find any tool that does that for me in an effective way, so I decided to do it manually.&lt;/p&gt;\n\n&lt;p&gt;And recently I decided to launch weekleads.com, a service that helps other freelancers/agencies to get access to a new list of this type of leads each week via email so they can concentrate on their billable work instead of prospecting for hours or days!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 5,
  "permalink": "/r/SideProject/comments/urar8n/my_story_as_a_freelancer_and_how_i_got_this_new/",
  "subreddit": "SideProject",
  "id": "urar8n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "After many years of freelancing, I realized that the hardest and most\ntime-consuming task is prospecting and lead generation.\n\nOf course there are many tools and strategies to generate leads, but most of\nthem help you generate cold leads that aren't always interested in your services\nas a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "長年フリーランスをやってきて、一番大変で、一番\nリードを生み出すことが最も難しく、時間のかかる仕事であることに気づきました。\n\nもちろん、リードを生成するためのツールや戦略はたくさんありますが、そのほとんどは、自分のサービスに必ずしも興味を持っていない冷たいリードを生成するのに役立ちます。\nとして、あなたのサービスに常に興味を持っていない冷たいリードを生成するのに役立ちます。\nとして",
      "title": "フリーランスとしての私の物語と、この新しいビジネスのアイデアを得た理由"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "经过多年的自由职业，我意识到最困难和最耗时的工作是寻找潜在客户和创造线索。\n的任务是寻找潜在客户和创造线索。\n\n当然，有许多工具和策略来产生线索，但大多数\n他们帮助你产生冷的线索，而这些线索并不总是对你的服务感兴趣。\n作为一个...",
      "title": "我作为自由职业者的故事以及我如何得到这个新的商业理念"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "經過多年的自由職業，我意識到最困難和最耗時的工作是尋找潛在客戶和創造線索。\n的任務是尋找潛在客戶和創造線索。\n\n當然，有許多工具和策略來產生線索，但大多數\n他們幫助你產生冷的線索，而這些線索並不總是對你的服務感興趣。\n作爲一個...",
      "title": "我作爲自由職業者的故事以及我如何得到這個新的商業理念"
    }
  ]
}