{
  "author": "bologna_radley",
  "original_created_utc": 1640714064,
  "title": "After going to the gym for years, intense therapy for years, and learning a few hobbies (Guitar, music, skateboarding) I find myself still scaring away women. Anyone have experiences of pushing away possible suitors because of something they don't realize they're doing?",
  "created_utc": 1640730282,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I dunno, just putting feelers out there. I&amp;#39;m turning 30 and it kinda sucks I still haven&amp;#39;t dated. Not the end of the world, there&amp;#39;s a lot of upsides. Just some downsides that kinda become grating after a while. Women will come up and talk to me in public, or message me on here, but always seem to ghost. I blame it on my double texting, but I think there&amp;#39;s another thing. I wonder if I&amp;#39;m not interesting enough, or maybe one dimensional.   &lt;/p&gt;\n\n&lt;p&gt;Maybe it&amp;#39;s just my insecurities, but everyone has those? I have no clue what to do.&lt;/p&gt;\n\n&lt;p&gt;EDIT: Think I&amp;#39;ve received enough advice and have a lot to think about, thank ya&amp;#39;ll.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 109,
  "permalink": "/r/TooAfraidToAsk/comments/rqlhel/after_going_to_the_gym_for_years_intense_therapy/",
  "subreddit": "TooAfraidToAsk",
  "id": "rqlhel",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I dunno, just putting feelers out there. I'm turning 30 and it kinda sucks I\nstill haven't dated. Not the end of the world, there's a lot of upsides. Just\nsome downsides that kinda become grating after a while. Women will come up and\ntalk to me in public, or message me on here, but always seem to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "どうだろう、ちょっとだけ感触を味わってみたい。私は30歳になるのですが、ちょっと残念です。\nまだデートしてません。この世の終わりじゃない、いいこともたくさんあるんだ。ただ\nしばらくすると耳障りになる欠点がある。女性が近寄ってきて\n人前で話しかけたり、ここにメッセージをくれたりするけど、いつも...。",
      "title": "何年もジムに通い、何年も集中治療を受け、いくつかの趣味（ギター、音楽、スケートボード）を覚えても、まだ女性を怖がらせてしまう自分がいるのです。どなたか、自分では気づいていないことが原因で、意中の人を押し退けてしまった経験をお持ちの方はいらっしゃいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不知道，只是把感觉放在那里。我快30岁了，有点糟糕，我\n仍然没有约会。这不是世界末日，有很多好处。只是\n只是有些缺点在一段时间后变得令人厌烦。女人会走过来\n在公共场合与我交谈，或在这里给我留言，但似乎总是...",
      "title": "在去健身房锻炼了多年，接受了多年的高强度治疗，并学习了一些爱好（吉他、音乐、滑板）之后，我发现自己仍然在吓跑女人。有没有人有过因为不知道自己在做什么而推开可能的追求者的经历？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不知道，只是把感覺放在那裏。我快30歲了，有點糟糕，我\n仍然沒有約會。這不是世界末日，有很多好處。只是\n只是有些缺點在一段時間後變得令人厭煩。女人會走過來\n在公共場合與我交談，或在這裏給我留言，但似乎總是...",
      "title": "在去健身房鍛鍊了多年，接受了多年的高強度治療，並學習了一些愛好（吉他、音樂、滑板）之後，我發現自己仍然在嚇跑女人。有沒有人有過因爲不知道自己在做什麼而推開可能的追求者的經歷？"
    }
  ]
}