{
  "author": "random_guy_somewhere",
  "original_created_utc": 1641167369,
  "title": "Are we just waiting out Covid at this point?",
  "created_utc": 1641207255,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;If you’re going to respond about how covid is fake or vaccines are about control, don’t bother responding. &lt;/p&gt;\n\n&lt;p&gt;But at this point, most everyone is eligible to get vaccinated. While the vaccine does not prevent the spread of Covid, it does reduce risk of hospitalization. People who do not get vaccinated for non-health reasons probably won’t at this point. &lt;/p&gt;\n\n&lt;p&gt;So what’s the endgame here? I don’t expect life to go back pre-Covid, but I have yet to hear what the definition of realistic “success” is from any official.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 510,
  "permalink": "/r/TooAfraidToAsk/comments/run3n9/are_we_just_waiting_out_covid_at_this_point/",
  "subreddit": "TooAfraidToAsk",
  "id": "run3n9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "If you’re going to respond about how covid is fake or vaccines are about\ncontrol, don’t bother responding.\n\nBut at this point, most everyone is eligible to get vaccinated. While the\nvaccine does not prevent the spread of Covid, it does reduce risk of\nhospitalization. People who do not get…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "コビットが捏造だとか、ワクチンがどうのこうのとかレスするなら\nコントロールすることで、わざわざ反応する必要はありません。\n\nしかし、現時点では、ほとんどの人がワクチン接種の対象になっています。が、その一方で\nワクチンはコビッドの蔓延を防ぐことはできませんが、コビッドのリスクを軽減することができます。\n入院となります。受けなかった人は...",
      "title": "このままCovidを待つしかないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你要回应说covid是假的，或者疫苗是关于控制的，那就不用回应了。\n控制，那就不用回应了。\n\n但在这一点上，大多数人都有资格接种疫苗。虽然\n疫苗并不能防止Covid的传播，但它确实减少了住院的风险。\n住院的风险。没有接种的人...",
      "title": "在这一点上，我们只是在等待Covid的到来吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你要回應說covid是假的，或者疫苗是關於控制的，那就不用回應了。\n控制，那就不用回應了。\n\n但在這一點上，大多數人都有資格接種疫苗。雖然\n疫苗並不能防止Covid的傳播，但它確實減少了住院的風險。\n住院的風險。沒有接種的人...",
      "title": "在這一點上，我們只是在等待Covid的到來嗎？"
    }
  ]
}