{
  "author": "ElvenNeko",
  "the_new_excerpt": "I notice that other people often take age into consideration when they interact\nwith others. It would be more understandable if they only looked for romance\npartners, since a lot of humans mostly attracted to their own age, but why\npeople find that criteria important when they searching for someone…",
  "original_created_utc": 1615464635,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我注意到，别人在交往时，往往会考虑到年龄的因素\n与他人。如果他们只是为了寻找浪漫，那就更容易理解了。\n伙伴，因为很多人类大都喜欢和自己年龄相仿的人，但为什么？\n人们在找人的时候会发现这个标准很重要... ...",
      "title": "为什么年龄对人际交往如此重要？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我注意到，別人在交往時，往往會考慮到年齡的因素\n與他人。如果他們只是爲了尋找浪漫，那就更容易理解了。\n夥伴，因爲很多人類大都喜歡和自己年齡相仿的人，但爲什麼？\n人們在找人的時候會發現這個標準很重要... ...",
      "title": "爲什麼年齡對人際交往如此重要？"
    }
  ],
  "title": "Why age is so important for human interaction?",
  "created_utc": 1615528326,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I notice that other people often take age into consideration when they interact with others. It would be more understandable if they only looked for romance partners, since a lot of humans mostly attracted to their own age, but why people find that criteria important when they searching for someone to talk with online without ever meeting? </p>\n\n<p>Most common argument for that i see is &quot;expirience&quot;. They say &quot;no, that person is so much younger, lack of expirience does not interest me&quot; or &quot;that person so much older, having too much expirience scares me&quot;, even if age gap is rather small, like 5-10 years only. </p>\n\n<p>But what does it mean? Each people have their own unique life and types of expirience. For example, i mostly play video games and watch movies, so majority of my expirience comes from fiction. So difference between me 20yo and me 30yo is amount of tales i saw\\was part of. How exactly having this kind of expirience changes me in a way that older or younger people would not want to deal with me just because of my age? </p>\n\n<p>The only thing that&#39;s guaranteed in human life - is birth and death. Other kind of expiriences will vary from person to person. So why do people treat age like some kind of measuring tool? What kind of &quot;expirience&quot; they expect to see or not see from people younger\\older than they are? </p>\n\n<p>I just lived most of my life without even realizing how many people around care about the age of the others. Always thought that age is the thing people remember only when doctors asking them about it. Can people who find it important explain me their thought process behind it, please?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TrueAskReddit/comments/m2oq73/why_age_is_so_important_for_human_interaction/",
  "subreddit": "TrueAskReddit",
  "id": "m2oq73",
  "is_self": true,
  "media": null,
  "is_video": false
}