{
  "author": "DrewMac380",
  "the_new_excerpt": "I bought shares of AMC when it was $10. I could have sold at $20, but chose not\nto. When purchasing, I chose an amount that I was comfortable with losing, but\nalso an amount that could provide me with significant returns if it went up a\nlot like everyone thought.\n\nFew things I've learned from…",
  "original_created_utc": 1612463904,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我买AMC的股票时，它是10美元。我本可以在20美元时卖出，但我选择了不卖。\n到。在购买时，我选择了一个自己能承受损失的金额，但。\n也是一个可以为我提供可观回报的金额，如果它上升了一个。\n和大家想的一样\n\n我从中学到的一些东西... ...",
      "title": "吸取了我买入炒作的教训，但仍会长期持有。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我買AMC的股票時，它是10美元。我本可以在20美元時賣出，但我選擇了不賣。\n到。在購買時，我選擇了一個自己能承受損失的金額，但。\n也是一個可以爲我提供可觀回報的金額，如果它上升了一個。\n和大家想的一樣\n\n我從中學到的一些東西... ...",
      "title": "吸取了我買入炒作的教訓，但仍會長期持有。"
    }
  ],
  "title": "Learned my Lesson with Buying into the Hype, but Will Still Hold Long Term",
  "created_utc": 1612474425,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I bought shares of AMC when it was $10. I could have sold at $20, but chose not to. When purchasing, I chose an amount that I was comfortable with losing, but also an amount that could provide me with significant returns if it went up a lot like everyone thought.</p>\n\n<p>Few things I&#39;ve learned from this... Don&#39;t buy into something just because everyone is doing it. Sounds easy, but evidently for many of us it&#39;s not. Whether you want to call it FOMO or peer pressure, you need to understand what you are getting into and the ramifications if it goes south. I bought in because of the hype and I think this has been a good learning moment for me. One of the biggest things I&#39;ve seen is the fact that there&#39;s so much false information going around that it&#39;s crazy. I can&#39;t count how many posts that say if we hold to this day and keep the price above X amount, it will go to the moon the next day. Truthfully, it seems majority of the people sharing these things know nothing about stocks. I have student loans that need to be paid off. My hope was that I&#39;d be a little closer to paying those off more quickly than previously planned.</p>\n\n<p>I am happy that I didn&#39;t purchase GME as I almost did when it was at $300. The great news is that AMC was at $10 for me and I still believe it will go higher than that. I don&#39;t think it&#39;s going to the moon. But, I do think we can eventually get to $20-$40 in the next few years. Millions of people have been stuck in their homes for about a year now. Once we get past Covid/many have the vaccination, people will go to AMC to watch the movies. There will be many amazing box office movies coming out in the next few years due them being delayed by Covid. So, AMC hasn&#39;t popped off like I had hoped for, but there is absolutely no reason to sell right now in my opinion because this is a long term play that can make me some money in the future. </p>\n\n<p>Who knows... Maybe it will still go to the moon. I&#39;d be thrilled! But, until then I will hold and be excited for the future when going to the movies is a popular thing to do again. </p>\n\n<p>I&#39;ll probably get down voted for this post, but I think this is the truth for many of us here. Be careful with investments. I still hope for momentum to shift and make massive gains, but I also want to be realistic. I won&#39;t advise anyone here to buy or sell off these stocks. Ultimately, we have to make our own decisions. </p>\n\n<p>I started investing about a month and a half ago before the meme stocks. I was actually doing very well in that little time. This sets me back, but I will not make the same mistake again in the future. I&#39;ll stick with making smart choices and not complete risks.</p>\n\n<p>TLDR: I bought into a meme stock. I learned my lesson. Don&#39;t fall for FOMO/Peer pressure. Make the best decision possible for yourself knowing the risks. A lot of people will lose money due to this. While I was in for a quick dollar, I will hold long-term now.</p>\n</div><!-- SC_ON -->",
  "score": 731,
  "permalink": "/r/stocks/comments/lcmk2r/learned_my_lesson_with_buying_into_the_hype_but/",
  "subreddit": "stocks",
  "id": "lcmk2r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123200918
}