{
  "author": "WiLjjam",
  "the_new_excerpt": "I started investing right when I turned 18 in the summer of 2020. I'm talking\nindex funds and ETFs, the boring but good stuff. Ended 2020 with a 34% return\nthanks to the raging bull market which made me pour even more money into it. I\nbought into the GME hype at $34 dollars but eventually dca'd my…",
  "original_created_utc": 1612303024,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "2020年夏天，我18岁的时候就开始投资了。我说的是\n指数基金和ETF，枯燥无味却又是好东西。2020年年底，回报率34%。\n感谢汹涌的牛市，让我投入了更多的资金。I\n买进GME炒作34美元，但最终DCA'D我的... ...",
      "title": "GME教会了我独立的重要性"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "2020年夏天，我18歲的時候就開始投資了。我說的是\n指數基金和ETF，枯燥無味卻又是好東西。2020年年底，回報率34%。\n感謝洶湧的牛市，讓我投入了更多的資金。I\n買進GME炒作34美元，但最終DCA'D我的... ...",
      "title": "GME教會了我獨立的重要性"
    }
  ],
  "title": "GME taught me the importance of being independent",
  "created_utc": 1612312791,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I started investing right when I turned 18 in the summer of 2020. I&#39;m talking index funds and ETFs, the boring but good stuff. Ended 2020 with a 34% return thanks to the raging bull market which made me pour even more money into it. I bought into the GME hype at $34 dollars but eventually dca&#39;d my way to a solid $64 average cost. I got caught up in the bullish GME echo chamber that <a href=\"https://www.reddit.com/r/wallstreetbets/\">r/wallstreetbets</a> now is - I was just lucky to get in and out early compared to others.</p>\n\n<p>As WSB&#39;s member count went through the roof, more and more users commented price targets and abusing people into not selling. By going to these users&#39; history, a lot - and I mean A LOT - had comments from 2 days ago along the lines of &quot;where to buy stocks?&quot;. It just made the echo chamber even clearer. These people, who had no idea, were commenting advice and about the future of GME. I&#39;m a beginner too but I wouldn&#39;t even think of pretending like I have a clue. The quote “If shoe shine boys are giving stock tips, then it&#39;s time to get out of the market&quot; have always stuck with me, but I never put much credibility into it, until now.</p>\n\n<p>I eventually dca&#39;d my way out at an average cost of $206 after reading about the conspiracy theories about why the reported 53% short interest was false. Maybe it is false and maybe these hedge have pulled off a great move in suppressing this % without actually covering in order to mislead investors, but I would never bet on that. Took $3.1k profit which was cool, but this whole situation has made me realize the importance of being independent.</p>\n\n<p>It has motivated me to actually learn how to read a balance sheet, do my own due diligence and come to my own conclusions - not depend on others. Reddit, Seeking Alpha and Twitter are great resources to take inspiration from, but I&#39;ll never invest through someone else&#39;s thesis again even though it worked out this time. The only thing that separates me from the guy who bought at $400 is that I picked up on the information earlier. We were both &quot;promised&quot; $1000, which I always saw as ridiculous but hey, &quot;everyone is spamming it so it must be true&quot;. No, that echo chamber mentality is dangerous and a lot of people have lost a lot of money as a product of it. You never know who&#39;s on the other side spamming their thesis. Might be Warren Buffet or a guy who downloaded *insert controversial broker here* 2 days ago - I won&#39;t blindly follow their advice either way.</p>\n</div><!-- SC_ON -->",
  "score": 889,
  "permalink": "/r/stocks/comments/lb7r9n/gme_taught_me_the_importance_of_being_independent/",
  "subreddit": "stocks",
  "id": "lb7r9n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518541057
}