{
  "author": "Longjumping-Quiet-77",
  "the_new_excerpt": "I think there’s a popular misconception among no-coiners that you need to buy a\nfull bitcoin to be part of the bitcoin club - You can own a fraction of bitcoin\nwhich are called, ‘Satoshis’. They look at the price and think, “Damn! I have to\ninvest 58k to buy bitcoin, I’m too late – it’s too…",
  "original_created_utc": 1617933676,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコインクラブに参加するためには、完全なビットコインを購入する必要があるというのが、ノーコイナーの間では一般的な誤解だと思います。\nビットコインクラブの一員になるためには、完全なビットコインを購入しなければならないというのが、ノーコイン派の間では一般的な誤解だと思います。\nこれは「サトシ」と呼ばれるものです。彼らは価格を見て、「ちくしょう！」と思います。ビットコインを買うためには\nビットコインを買うために5万8,000円も投資しなければならないなんて、遅すぎだよ。",
      "title": "フルビットコインを購入しなくても、ビットコインクラブの一員になることができます"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想在无币者中普遍存在一个误区，就是你需要买一个\n完整的比特币是比特币俱乐部的一部分 - 你可以拥有一小部分比特币。\n这就是所谓的 \"萨托什\"。他们看了看价格，心想：\"妈的！我这是在做梦！\"。我必须...\n投资5.8万买比特币，我已经来不及了--太...",
      "title": "你不需要购买一个完整的比特币就可以成为比特币俱乐部的一员!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想在無幣者中普遍存在一個誤區，就是你需要買一個\n完整的比特幣是比特幣俱樂部的一部分 - 你可以擁有一小部分比特幣。\n這就是所謂的 \"薩託什\"。他們看了看價格，心想：\"媽的！我這是在做夢！\"。我必須...\n投資5.8萬買比特幣，我已經來不及了--太...",
      "title": "你不需要購買一個完整的比特幣就可以成爲比特幣俱樂部的一員!"
    }
  ],
  "title": "You don't need to buy a full bitcoin to be a part of the bitcoin club!",
  "created_utc": 1617950797,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I think there’s a popular misconception among no-coiners that you need to buy a full bitcoin to be part of the bitcoin club - You can own a fraction of bitcoin which are called, ‘Satoshis’. They look at the price and think, “Damn! I have to invest 58k to buy bitcoin, I’m too late – it’s too expensive!!” No! You’re still early – the reason why the price of bitcoin is so high is mainly because of the market cap and the total supply – 21 million which is a lot more scarce than most crypto coins.</p>\n\n<p>I think a common mistake among newbies to crypto is they just look at the price. “Wow, this coin is so much cheaper than bitcoin! I’m going to be rich when it reaches $10k” This brings us back to total supply and market cap. Those “cheap” coins that you’re looking at have billions of coins in circulation, compare to bitcoin’s 21 million.</p>\n\n<p>To give yourself a realistic idea of potential gains of a coin is to check out <a href=\"https://thecoinperspective.com/\">https://thecoinperspective.com/</a>Just pick a coin that you’re interested in and it will automatically compare that coin to the top 20 coins – For example, just for the laughs, lets compare dogecoin to bitcoin. You’ll occasionally hear people say dogecoin will reach $100 someday, get in while you can! First off, dogecoin is a meme and shouldn’t be taken seriously. But if dogecoin had the equivalent market cap of Bitcoin, which is $1.1 Trillion - which is A LOT! Dogecoin would only be $8.38!</p>\n\n<p>Also don’t just think about the market cap or supply, do some research about the project! Is it active? what problems are they trying to solve? What’s the developing team’s background – do they have the experience and knowledge? Is it a copy of another coin that does the same thing? Do you understand the purpose or reason why Cryptocurrencies exist?</p>\n\n<p>Another thing I would suggest is to NOT follow hype, don’t participate in Pump n Dumps, don’t listen to youtubers that shill a coin, instead look for videos that are informative and don’t panic sell when there’s a minor (10%-25%) dip – This is just the norm of crypto.</p>\n\n<p>Hopefully, this post helped some new comers and welcome to the future!</p>\n</div><!-- SC_ON -->",
  "score": 524,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/zX8nEjTKNEBis1EuHXrvl64Nr9YLpKvhgJipSIHMxVI.jpg?auto=webp&s=035dfa0c7266c01c49767637444adc99a91e37aa",
          "width": 610,
          "height": 333
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/zX8nEjTKNEBis1EuHXrvl64Nr9YLpKvhgJipSIHMxVI.jpg?width=108&crop=smart&auto=webp&s=db3064608e11e3203f6737fc3c20de911568a188",
            "width": 108,
            "height": 58
          },
          {
            "url": "https://external-preview.redd.it/zX8nEjTKNEBis1EuHXrvl64Nr9YLpKvhgJipSIHMxVI.jpg?width=216&crop=smart&auto=webp&s=c6a20809e1f08dd8cd8948c5659bd4368eb4c09d",
            "width": 216,
            "height": 117
          },
          {
            "url": "https://external-preview.redd.it/zX8nEjTKNEBis1EuHXrvl64Nr9YLpKvhgJipSIHMxVI.jpg?width=320&crop=smart&auto=webp&s=aa11682238e80452247199da350c06f647323dde",
            "width": 320,
            "height": 174
          }
        ],
        "variants": {},
        "id": "K_gemtlQZbBgtG_Z3jGjnSTECMktYCv8J_RM-ildtMc"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/mn73xt/you_dont_need_to_buy_a_full_bitcoin_to_be_a_part/",
  "subreddit": "CryptoCurrency",
  "id": "mn73xt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566612883
}