{
  "author": "Mcfinley",
  "the_new_excerpt": "She was at the forefront of the modernist art and literature movement for\ndecades, was a Jewish lesbian in her private life, and openly expressed her\nadmiration for the liberal ideals of immigration, multiculturalism, and\ndemocracy. How did she wind up supporting Petain and arguing that…",
  "original_created_utc": 1621870070,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "彼女は、何十年にもわたってモダニズムの芸術・文学運動の最前線にいました。\n私生活ではユダヤ人のレズビアンであり、移民や多文化主義などのリベラルな理想を率直に表現していた。\n移民、多文化主義、民主主義といったリベラルな理想を公然と表明した。\n移民、多文化主義、民主主義といったリベラルな思想を公然と表明していた。そんな彼女が、なぜペタンを支持し、...",
      "title": "モダニズムの庇護者として有名なユダヤ系レズビアンのガートルード・スタインは、いったいどのようにしてヴィシーの協力者になったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "她站在现代主义艺术和文学运动的最前沿达数十年之久。\n在她的私人生活中，她是一个犹太女同性恋者，并公开表达了她对移民、多元文化和自由主义理想的崇拜。\n她公开表达了对移民、多元文化和民主等自由主义理想的钦佩。\n民主。她是如何支持贝当并主张...",
      "title": "著名的现代主义犹太女同性恋赞助人格特鲁德-斯坦因究竟是如何沦为维希的合作者的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "她站在現代主義藝術和文學運動的最前沿達數十年之久。\n在她的私人生活中，她是一個猶太女同性戀者，並公開表達了她對移民、多元文化和自由主義理想的崇拜。\n她公開表達了對移民、多元文化和民主等自由主義理想的欽佩。\n民主。她是如何支持貝當並主張...",
      "title": "著名的現代主義猶太女同性戀贊助人格特魯德-斯坦因究竟是如何淪爲維希的合作者的？"
    }
  ],
  "title": "How on Earth did Gertrude Stein, the famous Jewish lesbian patron of modernism, end up a Vichy collaborator?",
  "created_utc": 1621893293,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>She was at the forefront of the modernist art and literature movement for decades, was a Jewish lesbian in her private life, and openly expressed her admiration for the liberal ideals of immigration, multiculturalism, and democracy. How did she wind up supporting Petain and arguing that Hitler deserved the Nobel Peace Prize?</p>\n</div><!-- SC_ON -->",
  "score": 108,
  "permalink": "/r/AskHistorians/comments/nk0kat/how_on_earth_did_gertrude_stein_the_famous_jewish/",
  "subreddit": "AskHistorians",
  "id": "nk0kat",
  "is_self": true,
  "media": null,
  "is_video": false
}