{
  "author": "Walms82",
  "original_created_utc": 1631278432,
  "title": "Crypto has become my new hobby!",
  "created_utc": 1631324615,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I got into crypto about 3 months ago after investing in stocks. I figured I would just buy a bit to diversify but ever since I&#39;ve just got more and more interested in everything crypto.</p>\n\n<p>Where I used to watch useless TV in an evening or play ps4, I&#39;m now researching crypto on YouTube and leaning more about the technology and advancements being made. I never imagined it would be so much fun! I&#39;m in this sub reddit an awful lot as its fascinating (and yes we also get moons, how cool is that!)</p>\n\n<p>6 months ago I would have dismissed crypto altogether and now I&#39;m so excited for its future.</p>\n\n<p>Do you guys feel the same? Would you consider crypto a hobby as well as an investment?</p>\n</div><!-- SC_ON -->",
  "score": 168,
  "permalink": "/r/CryptoCurrency/comments/plkg5q/crypto_has_become_my_new_hobby/",
  "subreddit": "CryptoCurrency",
  "id": "plkg5q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I got into crypto about 3 months ago after investing in stocks. I figured I\nwould just buy a bit to diversify but ever since I've just got more and more\ninterested in everything crypto.\n\nWhere I used to watch useless TV in an evening or play ps4, I'm now researching\ncrypto on YouTube and leaning…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "株への投資を経て、3ヶ月ほど前に暗号に手を出しました。分散のために少しだけ購入しようと思っていましたが\nしていましたが、それ以来、ますます暗号に興味を持つようになりました。\nますます暗号に興味を持つようになりました。\n\n以前は夕方に無駄なテレビを見たり、PS4をプレイしたりしていましたが、今ではYouTubeで暗号を調べたりしています。\n今ではYouTubeで暗号について調べたりしています...",
      "title": "暗号は私の新しい趣味になりました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在投资股票后，我大约3个月前开始接触加密货币。我想我\n但从那时起，我就对所有加密货币越来越感兴趣了。\n对所有加密货币感兴趣。\n\n以前我在晚上看无用的电视或玩PS4，现在我在YouTube上研究\n我现在在YouTube上研究加密货币，并靠...",
      "title": "Crypto已经成为我的新爱好!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在投資股票後，我大約3個月前開始接觸加密貨幣。我想我\n但從那時起，我就對所有加密貨幣越來越感興趣了。\n對所有加密貨幣感興趣。\n\n以前我在晚上看無用的電視或玩PS4，現在我在YouTube上研究\n我現在在YouTube上研究加密貨幣，並靠...",
      "title": "Crypto已經成爲我的新愛好!"
    }
  ]
}