{
  "author": "recycled_notthrown",
  "the_new_excerpt": "Throwaway because this is a sensitive topic for me.\n\n\n\nMy great aunt lives far away from me but has always been a very close and\nimportant presence in my life. She got me into music when I was a kid, and now\nI'm a professional musician. Without going into too much detail, I love her to\nbits and so…",
  "original_created_utc": 1623678763,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私にとってはデリケートな話題なので、投げやりに。\n\n\n\n私の大叔母は遠くに住んでいますが、いつも私の人生の中でとても身近で大切な存在でした。\n私の人生にとって大切な存在です。子供の頃、彼女は私に音楽を教えてくれました。\n私はプロのミュージシャンとして活躍しています。あまり詳しいことは言えませんが、私は彼女をとても愛しています。\nだから...",
      "title": "叔母が最近アルツハイマー病と診断されましたが、彼女のメールにどのように対応したらよいでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "抛砖引玉，因为这对我来说是个敏感话题。\n\n\n\n我的大姨妈住在离我很远的地方，但一直是我生命中非常亲密和重要的存在。\n在我的生活中非常重要的存在。在我小时候，她让我接触到了音乐，而现在\n我是一名职业音乐家。我不想说得太详细，我爱她到\n位，所以...",
      "title": "姨妈最近被诊断出患有阿尔茨海默症，我应该如何回复她的邮件？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "拋磚引玉，因爲這對我來說是個敏感話題。\n\n\n\n我的大姨媽住在離我很遠的地方，但一直是我生命中非常親密和重要的存在。\n在我的生活中非常重要的存在。在我小時候，她讓我接觸到了音樂，而現在\n我是一名職業音樂家。我不想說得太詳細，我愛她到\n位，所以...",
      "title": "姨媽最近被診斷出患有阿爾茨海默症，我應該如何回覆她的郵件？"
    }
  ],
  "title": "Aunt recently diagnosed with Alzheimers, how do I respond to her emails?",
  "created_utc": 1623695599,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Throwaway because this is a sensitive topic for me.</p>\n\n<p>&#x200B;</p>\n\n<p>My great aunt lives far away from me but has always been a very close and important presence in my life. She got me into music when I was a kid, and now I&#39;m a professional musician. Without going into too much detail, I love her to bits and so does my whole family.</p>\n\n<p>She would frequently (2-3 times a year) come to visit us, but that became impossible due to covid. Unfortunately, at the age of 89 after a life of independence, travel and work, she has been diagnosed with Alzheimers and has to live in a care home. I don&#39;t know if and when I&#39;ll be able to see her again.</p>\n\n<p>The relatives who live close to her say that she has good days and bad days, talking on the phone is difficult, sometimes she is her usual (or old) self, clear and focused, but other times she says things which are just absurd or wrong. She recently sent me an email where she says her life feels different each day and that she feels her mental capabilities are much worse, but what&#39;s left is still interesting and full of richness.</p>\n\n<p>Is there any &quot;right&quot; way to communicate in writing to a person with Alzheimers? Should I consider visiting her in person when possible? Of course I&#39;d love to see her and do that, but I&#39;m scared she wouldn&#39;t recognize me, or that she&#39;d be embarassed by her mental state. In short, I don&#39;t want to do anything that might harm or further confuse her.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/NoStupidQuestions/comments/nzna5b/aunt_recently_diagnosed_with_alzheimers_how_do_i/",
  "subreddit": "NoStupidQuestions",
  "id": "nzna5b",
  "is_self": true,
  "media": null,
  "is_video": false
}