{
  "author": "FU_money_pharm17",
  "original_created_utc": 1630081396,
  "title": "NEVER SELL",
  "created_utc": 1630093135,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Over the last 6 months, I have begun acquiring long-term rental real estate at a pretty fast rate. After a seller accepted a recent offer of mine, I naturally took the contract to the bank.</p>\n\n<p>After reviewing my personal financial statement and given my largely new real estate portfolio value relative to my equity position, the bank required a much larger down payment to finance this property than past loans. The loan officer commented that I had more than enough liquid assets to make this down payment if I would sell some of my Bitcoin. Rather than sell Bitcoin to fund this downpayment for cashflowing real estate, I exercised the financing contingency in the sales contract and backed out of the deal due to inability to obtain financing.</p>\n\n<p>I tell you all this because I believe that the Bitcoin position in my portfolio is far more valuable than anything else I could reasonably buy. The thought of selling even a single sat to purchase anything else just seems foolish.</p>\n\n<p>Keep stacking!</p>\n</div><!-- SC_ON -->",
  "score": 159,
  "permalink": "/r/Bitcoin/comments/pcqnlk/never_sell/",
  "subreddit": "Bitcoin",
  "id": "pcqnlk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Over the last 6 months, I have begun acquiring long-term rental real estate at a\npretty fast rate. After a seller accepted a recent offer of mine, I naturally\ntook the contract to the bank.\n\nAfter reviewing my personal financial statement and given my largely new real\nestate portfolio value relative…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この半年間、私は長期の賃貸不動産を取得し始めました。\nかなりのスピードで 先日、私が出したオファーを売り手が受け入れてくれたので、当然ながら\n契約書を銀行に持っていきました。\n\n私の個人的な財務報告書を確認した後、私の新しい不動産ポートフォリオの価値を考えてみました。\n不動産ポートフォリオの価値を考えてみると",
      "title": "NEVER SELL"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在过去6个月中，我开始以相当快的速度收购长期租赁的房地产。\n的速度相当快。在一个卖家接受了我最近的报价后，我自然地\n把合同交给了银行。\n\n在审查了我的个人财务报表后，考虑到我基本上新的房地产\n我的房地产投资组合价值相对于...",
      "title": "永不出售"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在過去6個月中，我開始以相當快的速度收購長期租賃的房地產。\n的速度相當快。在一個賣家接受了我最近的報價後，我自然地\n把合同交給了銀行。\n\n在審查了我的個人財務報表後，考慮到我基本上新的房地產\n我的房地產投資組合價值相對於...",
      "title": "永不出售"
    }
  ]
}