{
  "author": "Reserve2021",
  "original_created_utc": 1651830877,
  "title": "A friend of mine passed away recently, and now his Spotify account name shows a series of digits instead of his name. Are his playlists going to be lost soon?",
  "created_utc": 1651847746,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A dear friend of mine (and of so many others) recently passed away. I&amp;#39;ve been coping by listening to his Spotify playlists. I know this sounds dumb, but his username is now just a series of numbers, rather than his name. I want to be sure this isn&amp;#39;t some indication his account is going to be deleted? If it is, I just want to be sure I preserve the playlists he made. I can figure that part out unless anyone in the community has some advice on doing this. Sorry if this comes off like tech support or something dumb, I just haven&amp;#39;t found much through internet searches on the topic and want to gather the experience of this community if you guys have anything to input!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 108,
  "permalink": "/r/NoStupidQuestions/comments/ujjwid/a_friend_of_mine_passed_away_recently_and_now_his/",
  "subreddit": "NoStupidQuestions",
  "id": "ujjwid",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "A dear friend of mine (and of so many others) recently passed away. I've been\ncoping by listening to his Spotify playlists. I know this sounds dumb, but his\nusername is now just a series of numbers, rather than his name. I want to be\nsure this isn't some indication his account is going to be…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、私の大切な友人（そして多くの人の友人）が亡くなりました。私はずっと\n彼のSpotifyのプレイリストを聴いて対処しています。馬鹿みたいな話ですが、彼の\nのユーザーネームは、彼の名前ではなく、ただの数字の羅列になっています。私は\nこれは彼のアカウントが...される兆候ではないことを確かめたい",
      "title": "先日友人が亡くなったのですが、彼のSpotifyのアカウント名が名前の代わりに数字の羅列で表示されるようになりました。彼のプレイリストはもうすぐ消えてしまうのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的一位亲爱的朋友（以及许多人的朋友）最近去世了。我一直在\n通过听他的Spotify播放列表来应对。我知道这听起来很蠢，但他的\n的用户名现在只是一串数字，而不是他的名字。我想确定\n我想确定这是不是表明他的账户将被...",
      "title": "我的一个朋友最近去世了，现在他的Spotify账户名称显示的是一串数字而不是他的名字。他的播放列表是否很快就会丢失？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的一位親愛的朋友（以及許多人的朋友）最近去世了。我一直在\n通過聽他的Spotify播放列表來應對。我知道這聽起來很蠢，但他的\n的用戶名現在只是一串數字，而不是他的名字。我想確定\n我想確定這是不是表明他的賬戶將被...",
      "title": "我的一個朋友最近去世了，現在他的Spotify賬戶名稱顯示的是一串數字而不是他的名字。他的播放列表是否很快就會丟失？"
    }
  ]
}