{
  "author": "kurkyturkey",
  "original_created_utc": 1657919742,
  "title": "Should I be upset over not being invited to weddings that my partner is invited to?",
  "created_utc": 1657946527,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I (25F) met my partner (26M) two years ago. We live in a neighboring state to most of his high school/college friends (1-3 hours away). We bought a house together, and we have intentions of getting engaged within the year. I’ve met all of his friends and hung out with most of them more than twice. I’ve never had a negative experience with these friends, and many treat me as if they’ve known me for just as long. That being said, since we started dating, he’s received 3 wedding invites that I have not been included in. &lt;/p&gt;\n\n&lt;p&gt;I understand there is a budget, and it’s hard to accommodate for everyone. Plus, I understand that it is not my day to have a feeling over. I understood leaving me out in the first year of our relationship because these are college buddies that I didn’t meet at the same time as him. But at this point, I’ve been friends with most of these people for over a year, we interact on social media, and keep in touch just as much as my partner keeps in touch with them. It feels personal, so I’m here to ask… is it?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 121,
  "permalink": "/r/TooAfraidToAsk/comments/vzze5s/should_i_be_upset_over_not_being_invited_to/",
  "subreddit": "TooAfraidToAsk",
  "id": "vzze5s",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I (25F) met my partner (26M) two years ago. We live in a neighboring state to\nmost of his high school/college friends (1-3 hours away). We bought a house\ntogether, and we have intentions of getting engaged within the year. I’ve met\nall of his friends and hung out with most of them more than twice.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私(25F)は2年前にパートナー(26M)と出会いました。私たちは隣の州に住んでいて\n高校・大学時代の友人のほとんど（1〜3時間の距離）の隣の州に住んでいます。私たちは家を買いました。\nを購入し、1年以内に婚約するつもりです。私が会ったことのある\n彼の友人には全員会っていて、そのほとんどと2回以上一緒に遊んでいます...。",
      "title": "パートナーが招待されている結婚式に招待されないことに腹を立てるべきでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我（25岁）两年前遇到我的伴侣（26岁）。我们住在邻近的一个州，与他的大多数高中/大学朋友（1-3小时的路程）相邻。\n大多数他的高中/大学朋友（1-3小时的路程）。我们一起买了一套房子\n我们一起买了房子，并且我们打算在一年内订婚。我已经认识了\n他所有的朋友，并与他们中的大多数人一起玩了两次以上....",
      "title": "我应该为没有被邀请参加我伴侣邀请的婚礼而感到不安吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我（25歲）兩年前遇到我的伴侶（26歲）。我們住在鄰近的一個州，與他的大多數高中/大學朋友（1-3小時的路程）相鄰。\n大多數他的高中/大學朋友（1-3小時的路程）。我們一起買了一套房子\n我們一起買了房子，並且我們打算在一年內訂婚。我已經認識了\n他所有的朋友，並與他們中的大多數人一起玩了兩次以上....",
      "title": "我應該爲沒有被邀請參加我伴侶邀請的婚禮而感到不安嗎？"
    }
  ]
}