{
  "author": "Lemounge",
  "original_created_utc": 1640492884,
  "title": "Is it ok that I really dislike my brother?",
  "created_utc": 1640529951,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My brother is 13 and autistic. I usually avoid saying that because he and my mom use it as a scape goat for his behaviour. &lt;/p&gt;\n\n&lt;p&gt;He is actually a manipulative spoilt brat and I cannot stand being around him. I came home for the Christmas holidays and ended up staying because I landed temp work nearby and I fucking hate being here. My brother manipulates us by saying he wants to kill himself whenever anything minor happens. He screams kicks and shouts when he doesn&amp;#39;t get what he wants and if I have any opinion of him other than pleasent then I get in major trouble. At 13 my mom would smack me for swearing or playing M rated games but my brother swears to her face and played R rated games as he pleases. &lt;/p&gt;\n\n&lt;p&gt;Today we bought everyone a chocolate thickshake because it&amp;#39;s so hot and when the straw was jammed he screamed and cried that he wanted kill himself and then threw away the entire thickshake. He screamed at mom that he &amp;#39;fucking hates his life&amp;#39; due to the straw being jammed.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m tired of everyone using mental health as a scape goat for him. If I even show I have any form of depression and anxiety my mom tells me to grow up (despite being depressed and anxious herself). I am routinely used as the &amp;#39;bag guy&amp;#39; complex. &amp;#39;oh it&amp;#39;s all OPs fault&amp;#39; all because of my brother.&lt;/p&gt;\n\n&lt;p&gt;I genuinely dislike him as a person but I&amp;#39;m scared to tell anyone that because he is just a kid. If he continues this behaviour I&amp;#39;m definitely never going to interact with him as an adult. He is a spoilt, disgusting, manipulative, narcissistic young teenager and I cant stand being around him.&lt;/p&gt;\n\n&lt;p&gt;I wanted to post on &lt;a href=\"/r/AmITheAsshole\"&gt;r/AmITheAsshole&lt;/a&gt; but I feel like I might get a response from here. I really hate living at home for this temp work and I miss my apartment in the city&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 111,
  "permalink": "/r/TooAfraidToAsk/comments/rop8ma/is_it_ok_that_i_really_dislike_my_brother/",
  "subreddit": "TooAfraidToAsk",
  "id": "rop8ma",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My brother is 13 and autistic. I usually avoid saying that because he and my mom\nuse it as a scape goat for his behaviour.\n\nHe is actually a manipulative spoilt brat and I cannot stand being around him. I\ncame home for the Christmas holidays and ended up staying because I landed temp\nwork nearby…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の弟は13歳で自閉症です。普段はそう言わないようにしています なぜなら兄と母は\nは、彼の行動のためのスケープゴートとして使用します。\n\n実際、彼は人を巧みに操る甘えん坊で、私は彼のそばにいるのが耐えられません。I\nクリスマス休暇に帰省したのですが、派遣社員として働くことになったので、結局滞在することになりました。\n近くで仕事をする...",
      "title": "私が兄のことを本当に嫌いになってもいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的弟弟今年13岁，有自闭症。我通常避免这么说，因为他和我妈妈\n把它作为他行为的替罪羊。\n\n他实际上是一个操纵性强的娇生惯养的孩子，我无法忍受与他相处。I\n我回家过圣诞假期，最后留在这里，因为我在附近找到了临时工作。\n附近的工作...",
      "title": "我真的不喜欢我的弟弟，这可以吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的弟弟今年13歲，有自閉症。我通常避免這麼說，因爲他和我媽媽\n把它作爲他行爲的替罪羊。\n\n他實際上是一個操縱性強的嬌生慣養的孩子，我無法忍受與他相處。I\n我回家過聖誕假期，最後留在這裏，因爲我在附近找到了臨時工作。\n附近的工作...",
      "title": "我真的不喜歡我的弟弟，這可以嗎？"
    }
  ]
}