{
  "author": "sailorsaturnobsessed",
  "original_created_utc": 1641229629,
  "title": "Why do old people stand in everyone’s way in the aisles at the store and seem oblivious to people around them?",
  "created_utc": 1641237100,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I ask this not to be rude, but out of genuine curiosity. There has been many a time where I’ve been at the grocery store, and old people are standing in the middle of the aisle with their carts either talking to someone or shopping, and they make no effort to move out of the way, and appear completely oblivious to people around them.&lt;/p&gt;\n\n&lt;p&gt;Is it an age thing, like cognitive decline? Is it a generational thing, like maybe they were taught that people will go around you? Or do they just not care?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/NoStupidQuestions/comments/rv6hwv/why_do_old_people_stand_in_everyones_way_in_the/",
  "subreddit": "NoStupidQuestions",
  "id": "rv6hwv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I ask this not to be rude, but out of genuine curiosity. There has been many a\ntime where I’ve been at the grocery store, and old people are standing in the\nmiddle of the aisle with their carts either talking to someone or shopping, and\nthey make no effort to move out of the way, and appear…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "失礼を承知でお聞きしますが、純粋な好奇心でお聞きします。これまで何度も\nスーパーで買い物をしていると、老人が立っていることがあります。\n通路の真ん中にカートを置いて、誰かと話しているか、買い物をしているか。\n邪魔になるようなことは一切せず、...。",
      "title": "なぜ、お年寄りはお店の通路でみんなの邪魔をして、周りの人に気づかれないようにするのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我问这个问题不是为了无礼，而是出于真正的好奇心。有许多次\n有很多时候，我在杂货店里看到老人站在过道中间\n他们站在过道中间，推着购物车，要么是在和别人说话，要么是在购物。\n他们不遗余力地让开道路，而且看起来......",
      "title": "为什么老人在商店的过道上站在所有人的面前，似乎对周围的人视而不见？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我問這個問題不是爲了無禮，而是出於真正的好奇心。有許多次\n有很多時候，我在雜貨店裏看到老人站在過道中間\n他們站在過道中間，推着購物車，要麼是在和別人說話，要麼是在購物。\n他們不遺餘力地讓開道路，而且看起來......",
      "title": "爲什麼老人在商店的過道上站在所有人的面前，似乎對周圍的人視而不見？"
    }
  ]
}