{
  "author": "noonoonomore",
  "original_created_utc": 1637351796,
  "title": "Do men really like boobs? I mean not just looking at their curvy shape or kissing them. Like liking them so much to suck on them for minutes?",
  "created_utc": 1637370627,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>And by minutes I mean for 10-15 minutes or more?</p>\n\n<p>I&#39;m really sensitive on my boobs, sucking on them is more pleasurable for me than the actual sex, so my boyfriend sucks on them sometimes for half an hour, and he says he likes it, but sometimes I feel guilty that maybe he is doing it to satisfy me and tolerates his mouth going sore or numb for my sake. He really liked sucking on my boobs from the start, but ever since he found out I enjoy the act more than any other intimacy act, he does it way more and I suspect if it&#39;s only for my pleasure.</p>\n\n<p>So I wanna know if it is possible that he actuallye enjoys doing it himself?</p>\n</div><!-- SC_ON -->",
  "score": 196,
  "permalink": "/r/TooAfraidToAsk/comments/qxo5r7/do_men_really_like_boobs_i_mean_not_just_looking/",
  "subreddit": "TooAfraidToAsk",
  "id": "qxo5r7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "And by minutes I mean for 10-15 minutes or more?\n\nI'm really sensitive on my boobs, sucking on them is more pleasurable for me\nthan the actual sex, so my boyfriend sucks on them sometimes for half an hour,\nand he says he likes it, but sometimes I feel guilty that maybe he is doing it\nto satisfy me…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "分というのは、10～15分以上ということですか？\n\n私はオッパイにとても敏感で、オッパイを吸うことが実際のセックスよりも快感なんです。\nだから彼氏は30分くらいおっぱいを吸うこともあります。\n彼はそれが好きだと言っていますが、時々、もしかしたら彼は私を満足させるためにやっているのかもしれないと罪悪感を感じます。\n私を満足させるためにやっているのかも...と罪悪感を感じることがあります。",
      "title": "男性は本当におっぱいが好きなのでしょうか？曲線的な形を見たり、キスしたりするだけではなくて。何分も吸い続けるほど好きなの？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我说的几分钟是指10-15分钟或更长时间？\n\n我对我的胸部非常敏感，吸吮它们对我来说更有快感\n所以我的男朋友有时会吸吮它们半小时。\n他说他喜欢这样，但有时我感到内疚，也许他这样做是为了满足我\n来满足我......。",
      "title": "男人真的喜欢巨乳吗？我的意思是不只是看它们的曲线形状或亲吻它们。就像非常喜欢它们以至于吸吮它们几分钟？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我說的幾分鐘是指10-15分鐘或更長時間？\n\n我對我的胸部非常敏感，吸吮它們對我來說更有快感\n所以我的男朋友有時會吸吮它們半小時。\n他說他喜歡這樣，但有時我感到內疚，也許他這樣做是爲了滿足我\n來滿足我......。",
      "title": "男人真的喜歡巨乳嗎？我的意思是不只是看它們的曲線形狀或親吻它們。就像非常喜歡它們以至於吸吮它們幾分鐘？"
    }
  ]
}