{
  "author": "hnnng_booba",
  "original_created_utc": 1650167859,
  "title": "As someone who is nonreligious, I find it unlikely that Jesus Christ came back from the dead. I imagine many secular historians feel the same way. With this in mind, are there any theories as to what happened between his death and the formation of Christianity to make people think he did?",
  "created_utc": 1650173952,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Sorry for the long title. Also, I’m not trying to talk down on anyone’s religious beliefs. If you believe that Jesus really was resurrected, I won’t argue with you. &lt;/p&gt;\n\n&lt;p&gt;That being said, I want to explore an alternate view. My understanding is that the consensus among historians is that Jesus was a real person, who probably had some teachings that challenged the religious establishment at that time, and was probably put to death at some point.&lt;/p&gt;\n\n&lt;p&gt;So what happens after? If Jesus dies and stays dead, how/why do so many people become part of this explosive new religion, under the impression that he was indeed raised up? Was it a coordinated lie/coverup? By who? The apostles? If they were real, it had to have been them, because they wouldn’t have been fooled by a lookalike or by tall tales. But then, why would they subject themselves to the kind of persecution and martyrdom that was common in the early days of Christianity over something they knew they made up? &lt;/p&gt;\n\n&lt;p&gt;This leads me to a lot of other questions. As far as I know from my Christian upbringing, when it comes to authors of the New Testament, Matthew, Mark, Luke, John, James, Jude and Peter all supposedly knew Jesus intimately for years. Paul never met him but was a contemporary of the other seven. But &lt;em&gt;is that true&lt;/em&gt;? Is there any historical or archaeological reason to believe that they really existed and wrote the gospels?&lt;/p&gt;\n\n&lt;p&gt;Once again, I’m sorry for the length. I know I’ve probably asked a very controversial question. I have probably asked a lot of additional questions that merit a response of their own. But if someone could at least point me in the right direction, I would be very grateful.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/u5etoh/as_someone_who_is_nonreligious_i_find_it_unlikely/",
  "subreddit": "AskHistorians",
  "id": "u5etoh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Sorry for the long title. Also, I’m not trying to talk down on anyone’s\nreligious beliefs. If you believe that Jesus really was resurrected, I won’t\nargue with you.\n\nThat being said, I want to explore an alternate view. My understanding is that\nthe consensus among historians is that Jesus was a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "長いタイトルで申し訳ありません。また、私は誰かのことを悪く言うつもりはありません。\n宗教的な信念がある。もし、あなたがイエスが本当に復活したと信じているのなら、わたしは\nと議論する。\n\nとはいえ、私は別の見方を探ってみたいのです。私の理解では\n歴史家のコンセンサスは、イエスは...",
      "title": "無宗教の私としては、イエス・キリストが死からよみがえったというのはありえないことだと思います。多くの世俗的な歴史家も同じように感じているのではないでしょうか。では、イエス・キリストの死からキリスト教成立までの間に、人々がイエス・キリストが復活したと考えるような出来事があったという説はあるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对不起，标题太长了。另外，我并不是要贬低任何人的\n宗教信仰。如果你相信耶稣真的复活了，我不会\n与你争论。\n\n既然如此，我想探讨一下另一种观点。我的理解是\n历史学家的共识是，耶稣是一个...",
      "title": "作为一个没有宗教信仰的人，我觉得耶稣基督从死里复活是不可能的。我想许多世俗历史学家也有同样的感觉。考虑到这一点，有什么理论可以说明在他去世和基督教形成之间发生了什么，使人们认为他确实回来了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對不起，標題太長了。另外，我並不是要貶低任何人的\n宗教信仰。如果你相信耶穌真的復活了，我不會\n與你爭論。\n\n既然如此，我想探討一下另一種觀點。我的理解是\n歷史學家的共識是，耶穌是一個...",
      "title": "作爲一個沒有宗教信仰的人，我覺得耶穌基督從死裏復活是不可能的。我想許多世俗歷史學家也有同樣的感覺。考慮到這一點，有什麼理論可以說明在他去世和基督教形成之間發生了什麼，使人們認爲他確實回來了？"
    }
  ]
}