{
  "author": "27purplecookies",
  "the_new_excerpt": "I am a college student stuck in a life decision conundrum\n\nI know I’m young and have my whole life ahead of me. I’m currently majoring in\nEnvironmental Policy and was considering law school for it.\n\nBut I know truly what I’m most passionate about is sticking up for those who\ncannot stand up for…",
  "original_created_utc": 1616053444,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个陷入人生抉择难题的大学生\n\n我知道我还年轻，我的人生还有很长的路要走。我现在主修的是\n环境政策，并在考虑为此读法学院。\n\n但我知道真正的我最热衷的是坚持为那些\n架不住",
      "title": "我希望能够保护那些无法保护自己的人。最好的办法是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個陷入人生抉擇難題的大學生\n\n我知道我還年輕，我的人生還有很長的路要走。我現在主修的是\n環境政策，並在考慮爲此讀法學院。\n\n但我知道真正的我最熱衷的是堅持爲那些\n架不住",
      "title": "我希望能夠保護那些無法保護自己的人。最好的辦法是什麼？"
    }
  ],
  "title": "I want to be able to defend those who cannot defend themselves. What’s the best way to go about this?",
  "created_utc": 1616073995,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am a college student stuck in a life decision conundrum </p>\n\n<p>I know I’m young and have my whole life ahead of me. I’m currently majoring in Environmental Policy and was considering law school for it.</p>\n\n<p>But I know truly what I’m most passionate about is sticking up for those who cannot stand up for themselves. That’s what I want to dedicate my life to. Is law still the right path for that? If so what kind of law is best? What other careers for this mindset? I want to feel fulfilled in my life and I know for a fact this is the path I want to take, I’m just not sure how to get to it. Thank you for any advice, I just feel lost and frustrated right now and any sense of direction would be greatly appreciated</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/NoStupidQuestions/comments/m7lrf7/i_want_to_be_able_to_defend_those_who_cannot/",
  "subreddit": "NoStupidQuestions",
  "id": "m7lrf7",
  "is_self": true,
  "media": null,
  "is_video": false
}