{
  "author": "Trying-Not-To-Die",
  "original_created_utc": 1640675283,
  "title": "Am I weird for thinking most/all marvel superhero movies are very boring?",
  "created_utc": 1640690607,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It’s just the same story arc with a different superhero skin placed on top. There’s nothing interesting about the story or the cringe edgy teenage humour or the CGI action scenes. &lt;/p&gt;\n\n&lt;p&gt;I mean the first Captain America the first avenger was cool asf mainly because of the aesthetic and story. &lt;/p&gt;\n\n&lt;p&gt;Maybe I’m just being negative, but it just a very boring story repeated over several movies.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 108,
  "permalink": "/r/NoStupidQuestions/comments/rq9ofl/am_i_weird_for_thinking_mostall_marvel_superhero/",
  "subreddit": "NoStupidQuestions",
  "id": "rq9ofl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It’s just the same story arc with a different superhero skin placed on top.\nThere’s nothing interesting about the story or the cringe edgy teenage humour or\nthe CGI action scenes.\n\nI mean the first Captain America the first avenger was cool asf mainly because\nof the aesthetic and story.\n\nMaybe I’m…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "同じストーリーの上に、別のスーパーヒーローの皮をかぶせただけ。\nストーリーにも、エッジの効いたティーンエイジャーのユーモアにも、何一つ面白みがない。\nCGIによるアクションシーン。\n\n初代キャプテン・アメリカや初代アベンジャーズがカッコよかったのは、主に\n美的感覚とストーリーで。\n\n多分、私は...",
      "title": "マーベルのスーパーヒーロー映画はほとんど、あるいはすべて、とても退屈だと思う私は変でしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这只是同样的故事弧线，上面放了一个不同的超级英雄的皮肤。\n这个故事没有任何有趣之处，也没有令人厌恶的前卫的青少年幽默或\nCGI动作场面。\n\n我的意思是，第一部《美国队长》和《复仇者联盟》非常酷，主要是因为它的美学和故事。\n的美学和故事。\n\n也许我是...",
      "title": "我认为大多数/所有漫威超级英雄电影都非常无聊，我是不是很奇怪？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這只是同樣的故事弧線，上面放了一個不同的超級英雄的皮膚。\n這個故事沒有任何有趣之處，也沒有令人厭惡的前衛的青少年幽默或\nCGI動作場面。\n\n我的意思是，第一部《美國隊長》和《復仇者聯盟》非常酷，主要是因爲它的美學和故事。\n的美學和故事。\n\n也許我是...",
      "title": "我認爲大多數/所有漫威超級英雄電影都非常無聊，我是不是很奇怪？"
    }
  ]
}