{
  "author": "NorthStarZero",
  "original_created_utc": 1654692092,
  "title": "\"I Was Born on a Pirate Ship\" - What's the origin of this pre-Internet meme?",
  "created_utc": 1654702450,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;When I was a kid in the 1980s - call it 1982 as a rough estimate - a popular schoolyard trick was to convince someone to inset their fingers into their mouth, pull their lips sideways, and attempt to say &amp;quot;I was born on a pirate ship&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;This comes out as &amp;quot;I was born on a pile of shit&amp;quot; - peak elementary school comedy!&lt;/p&gt;\n\n&lt;p&gt;I was discussing this with my wife, and she too remembered this from her school, even though our schools were separated by 5600 km at the time - and neither school was in a major urban area that could be considered a hub of pop culture.&lt;/p&gt;\n\n&lt;p&gt;So somehow, pre-Internet, this meme was so pervasive that children in rural areas thousands of km apart were taking part in it.&lt;/p&gt;\n\n&lt;p&gt;How?&lt;/p&gt;\n\n&lt;p&gt;Where did this originate, and how did it spread?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 134,
  "permalink": "/r/AskHistorians/comments/v7oq25/i_was_born_on_a_pirate_ship_whats_the_origin_of/",
  "subreddit": "AskHistorians",
  "id": "v7oq25",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "When I was a kid in the 1980s - call it 1982 as a rough estimate - a popular\nschoolyard trick was to convince someone to inset their fingers into their\nmouth, pull their lips sideways, and attempt to say \"I was born on a pirate\nship\".\n\nThis comes out as \"I was born on a pile of shit\" - peak…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が子供だった1980年代、大雑把に言って1982年頃、学校の校庭で流行っていた手品があります。\n指を口の中に入れて唇を横に引き、「私は海賊の家に生まれました。\n私は海賊船で生まれました」と言うのです。\n海賊船で生まれた」と言うのです。\n\nこれは、「I was born on a pile of shit（私は糞の山の中で生まれた）」というピーク...",
      "title": "\"I Was Born on a Pirate Ship\" - インターネット以前のこのミームの起源は？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当我在20世纪80年代还是个孩子的时候--粗略估计是1982年--一个流行的\n学校操场上流行的把戏是说服别人把手指插入他们的嘴里，把他们的嘴唇拉到嘴里。\n嘴里，把他们的嘴唇拉向一边，并试图说 \"我出生在一艘海盗船上\n船\"。\n\n这就变成了 \"我出生在一堆狗屎上\"--峰值...",
      "title": "\"我出生在一艘海盗船上\"--这个互联网之前的备忘录的起源是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當我在20世紀80年代還是個孩子的時候--粗略估計是1982年--一個流行的\n學校操場上流行的把戲是說服別人把手指插入他們的嘴裏，把他們的嘴脣拉到嘴裏。\n嘴裏，把他們的嘴脣拉向一邊，並試圖說 \"我出生在一艘海盜船上\n船\"。\n\n這就變成了 \"我出生在一堆狗屎上\"--峯值...",
      "title": "\"我出生在一艘海盜船上\"--這個互聯網之前的備忘錄的起源是什麼？"
    }
  ]
}