{
  "author": "jimstark55",
  "original_created_utc": 1636914913,
  "title": "How on Earth do you ask people if they want to have sex with you?",
  "created_utc": 1636921615,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Okay so I’m an 18 year old, bisexual student in the UK and wouldn’t mind having a lil bit of casual sex now and then. Now the real question is, is there any way that you can ask someone ‘hey do you want to have sex with me/fwb?’ and have it not be awkward? I met a girl who I’ve gotten to know a bit in the last month or so who is cute but I don’t want to compromise the friendship by asking if they want to have casual sex with me lol and just don’t have a clue how to even ask in the first place.</p>\n</div><!-- SC_ON -->",
  "score": 187,
  "permalink": "/r/TooAfraidToAsk/comments/qtw64p/how_on_earth_do_you_ask_people_if_they_want_to/",
  "subreddit": "TooAfraidToAsk",
  "id": "qtw64p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Okay so I’m an 18 year old, bisexual student in the UK and wouldn’t mind having\na lil bit of casual sex now and then. Now the real question is, is there any way\nthat you can ask someone ‘hey do you want to have sex with me/fwb?’ and have it\nnot be awkward? I met a girl who I’ve gotten to know a bit…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は18歳のバイセクシャルの学生で、イギリスに住んでいます。\nたまにはカジュアルなセックスをしてもいいと思っています。さて、実際の質問ですが、何か方法はありますか？\n誰かに「ねえ、私/双子とセックスしたい？」と聞いて、気まずくならない方法はありますか？\n気まずくならない方法はありますか？私は、少しだけ知り合いになった女の子に会いました...。",
      "title": "いったいどのようにして、人に「セックスしたいか」と聞くのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，我是一个18岁的双性恋学生，在英国，我不会介意有\n偶尔也会有一些随意的性行为。现在真正的问题是，是否有任何办法\n有什么方法可以让你问别人 \"嘿，你想和我/Fwb做爱吗\"，并让它\n不尴尬？我遇到一个女孩，我已经有点了解她了。",
      "title": "你到底是怎么问别人是否想和你做爱的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，我是一個18歲的雙性戀學生，在英國，我不會介意有\n偶爾也會有一些隨意的性行爲。現在真正的問題是，是否有任何辦法\n有什麼方法可以讓你問別人 \"嘿，你想和我/Fwb做愛嗎\"，並讓它\n不尷尬？我遇到一個女孩，我已經有點了解她了。",
      "title": "你到底是怎麼問別人是否想和你做愛的？"
    }
  ]
}