{
  "author": "emperator_eggman",
  "original_created_utc": 1645565245,
  "title": "Is it true that Mary II of England was able to walk essentially topless during her time according to VICE? Or is it fabricated?",
  "created_utc": 1645592335,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;According to this VICE article on the History of Toplessness &lt;a href=\"https://www.vice.com/en/article/43gy7n/the-history-of-toplessness\"&gt;https://www.vice.com/en/article/43gy7n/the-history-of-toplessness&lt;/a&gt;, it reports that Mary II allegedly walked out in public with both of her breasts exposed, as an example of toplessness being socially acceptable in pre-Enlightenment Europe. So I was wondering, did this actually occur, or is the account fabricated? A quick Google search has led me to nothing, therefore I came here to this subreddit to ask this question.&lt;/p&gt;\n\n&lt;p&gt;Direct quote from the VICE article: &lt;em&gt;&amp;quot;Although royal nipples were rarely depicted in paintings, court ladies were sometimes painted with one breast exposed—showing both breasts in a painting probably meant you were a &amp;quot;mistress&amp;quot;—and many women (including Queen Mary II of William and Mary University) walked around with one or both breasts out of their bodices.&amp;quot;&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/syyusu/is_it_true_that_mary_ii_of_england_was_able_to/",
  "subreddit": "AskHistorians",
  "id": "syyusu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "According to this VICE article on the History of Toplessness\nhttps://www.vice.com/en/article/43gy7n/the-history-of-toplessness, it reports\nthat Mary II allegedly walked out in public with both of her breasts exposed, as\nan example of toplessness being socially acceptable in pre-Enlightenment…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "トップレスの歴史に関するVICEの記事によると\nhttps://www.vice.com/en/article/43gy7n/the-history-of-toplessness、次のように報告されています。\nメアリー2世が両胸を露出して人前を歩いたとされるのは、そのためです。\n啓蒙主義以前の社会でトップレスが受け入れられていた例として...。",
      "title": "VICEによると、イギリスのメアリー2世は、その時代、基本的にトップレスで歩くことができたというのは本当でしょうか？それとも捏造でしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "根据VICE的这篇关于无上装的历史的文章\nhttps://www.vice.com/en/article/43gy7n/the-history-of-toplessness，它报道了\n据称，玛丽二世在公开场合走出去时，她的两个乳房都暴露在外面，作为\n在启蒙运动之前，裸露上身是可以被社会接受的一个例子...",
      "title": "据VICE报道，英国的玛丽二世在她的时代基本上可以赤裸上身行走，这是真的吗？还是说这是捏造的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "根據VICE的這篇關於無上裝的歷史的文章\nhttps://www.vice.com/en/article/43gy7n/the-history-of-toplessness，它報道了\n據稱，瑪麗二世在公開場合走出去時，她的兩個乳房都暴露在外面，作爲\n在啓蒙運動之前，裸露上身是可以被社會接受的一個例子...",
      "title": "據VICE報道，英國的瑪麗二世在她的時代基本上可以赤裸上身行走，這是真的嗎？還是說這是捏造的？"
    }
  ]
}