{
  "author": "froggfingers",
  "original_created_utc": 1629633451,
  "title": "Bitboy Crypto is a fraud who just regurgitates information he steals from smaller youtubers",
  "created_utc": 1629650051,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>When I started learning about Crypto last year he was very helpful and added some enthusiasm and excitement about what where some otherwise confusing and daunting decisions.</p>\n\n<p>After watching him proclaim to be the #1 Ethereum channel over and over again, even though I had been subbed to many other channels which provided far more, far better and regular information on Eth, I began to question his motives. Who was he to make such proclaimations in a sea of other Eth content providers online.</p>\n\n<p>Then when XRP hit the headlines for the SEC case ut was Bull and Lambo who kept me going, they kept me positive and holding throughout. All the while Bitboy was saying XRP was going to zero and it was a joke and anyone holding it was a joke. And now that his &quot;team&quot; has finally got up off their asses and researched XRP and realized its potential regardless of the SEC case, all of a sudden he is the &quot;number 1 XRP channel on youtube&quot;.</p>\n\n<p>What I have learned is Bitboy Crypto is a business, not a person. It is a group of maybe 15 or 20 people who watch everybody elses youtube videos and then create their own using other peoples already published information, with Ben as the charismstic presenter. There is nothing bitboy has posted in the last 2 months that I havent heard on smaller youtube channels a week before him. </p>\n\n<p>Bitboy Crypto is probably a good channel to get started and maybe learn bits and pieces about the cryptospace. But there are far better channels out there, Sheldon Evons for instsnce, in my opinion, deserves more subs than Bitboy. Even Stock Moe has been coming up the sidelines with some good stuff recently. BearableBull is great too...Martin Valk has a new channel which is very good... there are just so many small channels out there who do the ground work and research and then Bitboy shows up regurgitating their info, its beginning to annoy me if im honest.....</p>\n\n<p>tldr; Im losing interest in bitboy pretty fast. Hes not original, hes just regurgitating other peoples information.</p>\n</div><!-- SC_ON -->",
  "score": 176,
  "permalink": "/r/CryptoCurrency/comments/p9b6pg/bitboy_crypto_is_a_fraud_who_just_regurgitates/",
  "subreddit": "CryptoCurrency",
  "id": "p9b6pg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "When I started learning about Crypto last year he was very helpful and added\nsome enthusiasm and excitement about what where some otherwise confusing and\ndaunting decisions.\n\nAfter watching him proclaim to be the #1 Ethereum channel over and over again,\neven though I had been subbed to many other…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "去年、私が暗号について学び始めたとき、彼はとても親切にしてくれて、他の方法では混乱するようなことにも熱意と興奮を与えてくれました。\n混乱した困難な決断に熱意と興奮を与えてくれました。\n情熱と興奮を与えてくれました。\n\n彼がイーサリアムのチャンネルでNo.1になると何度も宣言しているのを見た後、私は他の多くのチャンネルを購読していました。\n私は他の多くのチャンネルに登録していたにもかかわらず",
      "title": "Bitboy Cryptoは、小さなユーチューバーから盗んだ情報を再利用しているだけの詐欺師である。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当我去年开始学习加密货币时，他非常有帮助，并增加了一些热情。\n一些热情和兴奋，让我了解到一些本来令人困惑和畏惧的决定。\n令人生畏的决定。\n\n在看到他一次又一次地宣称自己是以太坊频道的第一名。\n尽管我已经订阅了许多其他频道。",
      "title": "Bitboy Crypto是一个骗子，他只是转述了他从小型优酷网友那里偷来的信息"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當我去年開始學習加密貨幣時，他非常有幫助，並增加了一些熱情。\n一些熱情和興奮，讓我瞭解到一些本來令人困惑和畏懼的決定。\n令人生畏的決定。\n\n在看到他一次又一次地宣稱自己是以太坊頻道的第一名。\n儘管我已經訂閱了許多其他頻道。",
      "title": "Bitboy Crypto是一個騙子，他只是轉述了他從小型優酷網友那裏偷來的信息"
    }
  ]
}