{
  "author": "Truffle_Shuffle_85",
  "the_new_excerpt": "Stick to your plan do not let influencers waiver your convictions in the\nprojects you've invested your money in. Every market cycle is always held\ntogether by narratives (ICOs and new platforms in 2017-18) and now DeFi and\npotentially NFT enabling technologies this go around. Take advantage of the…",
  "original_created_utc": 1620909632,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "自分が投資したプロジェクトへの確信をインフルエンサーに奪われないように、計画を貫きましょう。\n確信を失ってはいけません。すべての市場サイクルは、常に物語によって支えられています。\n物語によって支えられています（2017-18年のICOと新しいプラットフォーム）。そして今回は、DeFiとNFTを実現する可能性のある技術が登場します。\nNFTを実現する可能性のある技術が登場しました。活用する...",
      "title": "もし、ツイートの後でパニックになって売ってしまったら、自分が市場で弱い手だと認識してください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "坚持你的计划，不要让有影响力的人动摇你对你投资的项目的信念。\n你所投资的项目。每一个市场周期都是由叙事（ICOs和R&D）维系的。\n叙事（2017-18年的ICO和新平台），现在的DeFi和\n潜在的NFT使能技术这一轮。利用好...",
      "title": "如果你在一条推文后恐慌性卖出，那么请承认你是市场上的弱手。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "堅持你的計劃，不要讓有影響力的人動搖你對你投資的項目的信念。\n你所投資的項目。每一個市場週期都是由敘事（ICOs和R&D）維繫的。\n敘事（2017-18年的ICO和新平臺），現在的DeFi和\n潛在的NFT使能技術這一輪。利用好...",
      "title": "如果你在一條推文後恐慌性賣出，那麼請承認你是市場上的弱手。"
    }
  ],
  "title": "If you panic sold after a tweet then recognize that you are the weak hands in the market.",
  "created_utc": 1620925753,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Stick to your plan do not let influencers waiver your convictions in the projects you&#39;ve invested your money in. Every market cycle is always held together by narratives (ICOs and new platforms in 2017-18) and now DeFi and potentially NFT enabling technologies this go around. Take advantage of the dips that occur with the inevitable FUD that will be introduced into the market. New investors worry about losing money and flee out of the market, experienced investors are looking for juicy entries to buy up your cheap coins. If you believed in your investment pre-dip then you sure as hell should be liking a 20-30% discount on it.</p>\n</div><!-- SC_ON -->",
  "score": 3293,
  "permalink": "/r/CryptoCurrency/comments/nbfpa0/if_you_panic_sold_after_a_tweet_then_recognize/",
  "subreddit": "CryptoCurrency",
  "id": "nbfpa0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590796939
}