{
  "author": "Too_Tired_Too_Obtuse",
  "original_created_utc": 1632036605,
  "title": "Using Coinbase card to purchase reusable VISA gift card to reap rewards.",
  "created_utc": 1632051035,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Ok. I want to make an actual discussion on this, and also be told why I’m an idiot. </p>\n\n<p>Today I attended a bachelor party, and on the way I purchased a 100$ gift card. Using the Coinbase card, I immediately got 4$ back. This has got me thinking all day; why can’t I use the Coinbase card to purchase a large amount of VISA gift card currency?</p>\n\n<p>Hear me out. I know that there is KYC involvement with Coinbase, so it would probably flag me immediately once I purchased the max amount of a VISA gift card (15,000$). </p>\n\n<p>I have purchased on Coinbase and Coinbase PRO using a prepaid VISA in the past. I don’t know if it’s still a thing. </p>\n\n<p>My theory is, if I used my Coinbase card to purchase 15k$ worth of a VISA gift card, collected the 4% cash back in crypto (600$), then turned around and put that 15k back into Coinbase using the 15k VISA prepaid card to buy USDC coin which is has no fee, shouldn’t that work?</p>\n\n<p>I’m not a lawyer myself or a financial advisor, so I’m not sure what rules that would break. I also know that if there’s an easy way to exploit and make money, you won’t get away with it unless you have a lot of money to begin with. </p>\n\n<p>I AM going to test it tomorrow with a smaller amount, I just want to know what problems I may face?</p>\n\n<p>Edit:  another option is to transfer VISA prepaid gift card to PayPal account. Transfer PayPal to my bank. Continue purchasing from ACH.</p>\n\n<p>Edit 2:  I’m going to sleep and see what happens. I hope I didn’t get flagged by the FBI and have all my assets seized and be left with some moons from some upvotes.</p>\n</div><!-- SC_ON -->",
  "score": 159,
  "permalink": "/r/CryptoCurrency/comments/pr3gpi/using_coinbase_card_to_purchase_reusable_visa/",
  "subreddit": "CryptoCurrency",
  "id": "pr3gpi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Ok. I want to make an actual discussion on this, and also be told why I’m an\nidiot.\n\nToday I attended a bachelor party, and on the way I purchased a 100$ gift card.\nUsing the Coinbase card, I immediately got 4$ back. This has got me thinking all\nday; why can’t I use the Coinbase card to purchase a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "OK、これについて実際の議論をしたいし、また、私がなぜ\nばかだと言われたいです。\n\n今日、私はバチェラー・パーティーに参加し、その途中で100ドルのギフトカードを購入しました。\nコインベースのカードを使うと、すぐに4ドルが戻ってきました。これで一日中考えていました。\nなぜCoinbaseカードを使ってギフトカードを購入できないのか？",
      "title": "Coinbaseカードを使って、再利用可能なVISAギフトカードを購入し、報酬を得る。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，我想就这个问题进行真正的讨论，同时也想知道为什么我是一个\n白痴。\n\n今天我参加了一个单身派对，在路上我购买了一张100美元的礼品卡。\n使用Coinbase卡，我立即得到了4美元的回报。这让我想了一整天\n为什么我不能用Coinbase的卡来购买一张100美元的礼品卡呢？",
      "title": "使用Coinbase卡购买可重复使用的VISA礼品卡以获得奖励。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，我想就這個問題進行真正的討論，同時也想知道爲什麼我是一個\n白癡。\n\n今天我參加了一個單身派對，在路上我購買了一張100美元的禮品卡。\n使用Coinbase卡，我立即得到了4美元的回報。這讓我想了一整天\n爲什麼我不能用Coinbase的卡來購買一張100美元的禮品卡呢？",
      "title": "使用Coinbase卡購買可重複使用的VISA禮品卡以獲得獎勵。"
    }
  ]
}