{
  "author": "shittygovtemployee",
  "the_new_excerpt": "Ok. I have a serious question for you all. I'm invested in a publicly traded\ncompany which isn't doing very well, so I emailed the CEO because he is also the\npoint of contact for IR. They previously disclosed that they lost 20k worth of\ninventory because they were unable to collect payment due to a…",
  "original_created_utc": 1623804547,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "さて、皆さんに真面目な質問があります。私はある上場企業に投資しています。\nあまりうまくいっていないので、CEOにメールしました。\nCEOにメールしました。彼らは以前、2万円相当の在庫を失ったことを公表しました。\n在庫を2万円分失ったことを公表しましたが、その理由は...",
      "title": "不正行為を発見しましたか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，我有一个严肃的问题要问大家。我投资的一家上市公司\n这家公司的业绩不是很好，所以我给首席执行官发了电子邮件，因为他也是IR的联系人。\n因为他也是投资者关系的联系人。他们之前披露，他们损失了价值2万的\n因为他们无法收取货款，因为......。",
      "title": "我是否发现有欺诈行为发生？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，我有一個嚴肅的問題要問大家。我投資的一家上市公司\n這家公司的業績不是很好，所以我給首席執行官發了電子郵件，因爲他也是IR的聯繫人。\n因爲他也是投資者關係的聯繫人。他們之前披露，他們損失了價值2萬的\n因爲他們無法收取貨款，因爲......。",
      "title": "我是否發現有欺詐行爲發生？"
    }
  ],
  "title": "Did I Discover a Fraud Taking Place?",
  "created_utc": 1623811974,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Ok. I have a serious question for you all. I&#39;m invested in a publicly traded company which isn&#39;t doing very well, so I emailed the CEO because he is also the point of contact for IR. They previously disclosed that they lost 20k worth of inventory because they were unable to collect payment due to a various factors. I went into their filings and press releases and the numbers didn&#39;t match up - I found out they shipped out closer to 400k that wasn&#39;t collected. So I asked the CEO this and he admitted, probably without remembering that they disclosed 25k, that they lost the 400k. When I pressed him on this he said &quot;our collection issues are well documented&quot; and stopped speaking to me. Now, I&#39;m pretty resentful by nature and I don&#39;t appreciate being lied to and fucked around. So, I&#39;m wondering if this failure to disclose/minimizing losses in official filings is fraud. If so, can I sue this company? </p>\n\n<p>Disclosure, I still hold shares, so I&#39;m torn as to what I should do. </p>\n\n<p>Thanks</p>\n</div><!-- SC_ON -->",
  "score": 1779,
  "permalink": "/r/stocks/comments/o0svx7/did_i_discover_a_fraud_taking_place/",
  "subreddit": "stocks",
  "id": "o0svx7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009745212
}