{
  "author": "brownnn_",
  "the_new_excerpt": "Hello guys! I'm a complete novice in this, just getting started, and I think I\nwould need an insightful opinion on this.\n\nI bought AMC at 10 some 2 weeks ago, and now it seems the price is getting\nskyrocketed (now at 26) by pretty much the same type of operation than for\nGameStop, which I understand…",
  "original_created_utc": 1622166334,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。私はこの分野では全くの素人で、始めたばかりなのですが、この件に関しては\n洞察力のある意見が必要だと思います。\n\n私は2週間ほど前にAMCを10で購入しましたが、今では価格が高騰しているようです。\n2週間ほど前にAMCを10で購入したのですが、GameStopとほぼ同じ手口で価格が急騰しているようです（現在26）。\nGameStopの時と同じような動きをしているようです。",
      "title": "今、AMCで何が起こっているのか」ということを、初心者の立場で聞いてみる。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好! 我在这方面完全是个新手，刚刚开始，我想我\n我想我需要一个有见地的意见。\n\n两周前，我在10美元买了AMC，现在看来，价格正在被\n现在看来，价格正在飞涨（现在是26），与GameStop相比，几乎是同类型的操作。\nGameStop，我理解...",
      "title": "作为一个新手问：AMC现在发生了什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好! 我在這方面完全是個新手，剛剛開始，我想我\n我想我需要一個有見地的意見。\n\n兩週前，我在10美元買了AMC，現在看來，價格正在被\n現在看來，價格正在飛漲（現在是26），與GameStop相比，幾乎是同類型的操作。\nGameStop，我理解...",
      "title": "作爲一個新手問：AMC現在發生了什麼？"
    }
  ],
  "title": "Asking as a novice: what is happening with AMC now?",
  "created_utc": 1622213422,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello guys! I&#39;m a complete novice in this, just getting started, and I think I would need an insightful opinion on this.</p>\n\n<p>I bought AMC at 10 some 2 weeks ago, and now it seems the price is getting skyrocketed (now at 26) by pretty much the same type of operation than for GameStop, which I understand is &#39;&#39;Meme stock&#39;&#39;.</p>\n\n<p>I&#39;m seeing this as very good, of course, but I feel like this whole GameStop situation was a one-time thing, so who knows. With that, what should I wait and look for? Is it possible to see those stocks skyrock? Is the general consensus is that it&#39;s going to fail?</p>\n\n<p>Like I said, TOTAL novice, and pretty much lucked my way with those shares.</p>\n</div><!-- SC_ON -->",
  "score": 83,
  "permalink": "/r/stocks/comments/nmmz3r/asking_as_a_novice_what_is_happening_with_amc_now/",
  "subreddit": "stocks",
  "id": "nmmz3r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804300246
}