{
  "author": "get_reddit_1",
  "the_new_excerpt": "EVs will make up less than 10% of the U.S. market by 2025. US still will need a\nlot of EV charging stations. Biden's plan outlines 500,000 new EV plugs across\nthe U.S by the end of this decade. With Biden's EV push, it is not surprising\nthat investors have a very rosy expectation about EV charging…",
  "original_created_utc": 1613008192,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "到2025年，电动汽车将占美国市场不到10%的份额。美国仍将需要\n很多电动车充电站。拜登的计划概述了50万个新的电动车插头，遍布全国各地。\n到本十年末，美国。随着拜登对电动车的推动，这并不奇怪\n投资者对电动车充电的预期非常乐观......",
      "title": "石油公司与电动汽车充电基础设施"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "到2025年，電動汽車將佔美國市場不到10%的份額。美國仍將需要\n很多電動車充電站。拜登的計劃概述了50萬個新的電動車插頭，遍佈全國各地。\n到本十年末，美國。隨着拜登對電動車的推動，這並不奇怪\n投資者對電動車充電的預期非常樂觀......",
      "title": "石油公司與電動汽車充電基礎設施"
    }
  ],
  "title": "Oil companies and EV charging infrastructure",
  "created_utc": 1613054394,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>EVs will make up less than 10% of the U.S. market by 2025. US still will need a lot of EV charging stations. Biden&#39;s plan outlines 500,000 new EV plugs across the U.S by the end of this decade. With Biden&#39;s EV push, it is not surprising that investors have a very rosy expectation about EV charging business. As a result, a flourish of EV charging companies were brought to the market through SPAC mergers. </p>\n\n<p>I don&#39;t know what is the profit margin for EV charging stations, but one operating company Blink claimed to operate over 20,000 charging stations around the country, but that translated into less than $5 million in revenue over the past year. It currently has a market cap over 2 Billion dollars. Another EV charging company is offering Level 2 charging for free, and make their money from ads posted at their charge station.</p>\n\n<p>Oil companies have a lot of experience in operating gas stations, so they have a good understanding of the kind of profit margins you can get from &quot;charging&quot; stations. For many gas stations, 75 percent of their profits comes from the sale of other products, such as food, medicine and accessories. I don&#39;t expect the stand-alone EV charge stations can have a high profit margin.</p>\n\n<p>Oil companies and EV charging: Oil companies have started their carbon zero move. However, they are waiting in the wings milking their gas station infrastructure, until there are sufficient demand. Oil companies are not just sitting there waiting. Most of the European Oil companies have started their transition because Europe have a lot more EVs on the road today (Norway has more than 50%). In the US, Chevron has tried to convert a few gas stations in California to have EV charging stations, most likely to gain some experience and to gather market and profit margin data. Exxon is &quot;considering&quot;, but has not moved yet.</p>\n</div><!-- SC_ON -->",
  "score": 59,
  "permalink": "/r/investing/comments/lh9xgy/oil_companies_and_ev_charging_infrastructure/",
  "subreddit": "investing",
  "id": "lh9xgy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728620234
}