{
  "author": "mybitcoinstory",
  "the_new_excerpt": "Posting on a throwaway for obvious reasons.\n\nIn dollar terms, I’m almost a bitcoin millionaire. It feels good, but not\nbecause I can brag about the accumulated wealth, it’s more that the people who I\ntold to invest whatever money they could afford to lose, back in early 2013, all\ntold me I was an…",
  "original_created_utc": 1609507334,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "出于显而易见的原因贴在一次性的帖子上。\n\n以美元计算，我几乎是比特币百万富翁。感觉很好，但不是\n因为我可以吹嘘积累的财富，它比我的人更多\n早在2013年初，他们就被告知投资他们能承受的任何损失的钱，所有的\n告诉我我是…",
      "title": "我的比特币故事，从2012年末开始。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "出於顯而易見的原因貼在一次性的帖子上。\n\n以美元計算，我幾乎是比特幣百萬富翁。感覺很好，但不是\n因爲我可以吹噓積累的財富，它比我的人更多\n早在2013年初，他們就被告知投資他們能承受的任何損失的錢，所有的\n告訴我我是…",
      "title": "我的比特幣故事，從2012年末開始。"
    }
  ],
  "title": "My bitcoin story, beginning in late 2012.",
  "created_utc": 1609520843,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Posting on a throwaway for obvious reasons.</p>\n\n<p>In dollar terms, I’m almost a bitcoin millionaire. It feels good, but not because I can brag about the accumulated wealth, it’s more that the people who I told to invest whatever money they could afford to lose, back in early 2013, all told me I was an idiot. Those same people have now been humbled.</p>\n\n<p>The story starts back in late 2012. A guy I was on head-nodding terms with at the gym, got talking to me in the changing room about one of the podcasts he was listening to. He was talking about how he loved his weed and had heard about the Silk Road and how the only way to buy drugs on it was using this new “virtual” currency called bitcoin. It was in November 2012 and the price was hovering around $10-$11. I thought to myself, I love my weed - and I remember from years and years ago, a company in Canada called bud mail, used to operate an online weed store. That’s where my thinking stopped - and I didn’t bother looking into it any further.</p>\n\n<p><strong>Acquiring my first coins</strong><br/>\nIn early Jan 2013 my mate had mentioned bitcoin to me, again - a big weed smoker and thought it’d be a good idea to grab a few coins and try it out for ourselves. We’re in the UK, and Coinbase wasn’t open for UK residents yet. The only way we could purchase bitcoins were on localbitcoins.com or bitstamp. We chose the latter, but had no idea what a SEPA transfer was. To be frank, there were a lot of hurdles to overcome in order to acquire bitcoin back then.</p>\n\n<p>We had to use TransferWise to send our money to some bank in Estonia (I think?). The money arrived a few days later, and bam - we were able to purchase our first coins in March 2013 at $57 a pop. The next few days, the price continued to rise - until it got to about $230. This was heavily fuelled by the Cyprus Haircut. The other two mates who I’d bought these coins with, and who I shared the bitstamp account with wanted to sell. I didn’t. We decided that I would take my coins off the exchange, and they’d keep theirs together at bitstamp. It was at this stage that I was looking into bitcoin security.</p>\n\n<p><strong>Paper Wallets</strong><br/>\nTrusty bitcoinpaperwallet.com taught me all I needed to know. I ran a few tests first with very small amounts. Sending some to paper wallets, and then sweeping those paper wallets so that I could trust that it all worked. It did.</p>\n\n<p><strong>Acquiring more knowledge, then more coins</strong><br/>\nBy now, I was deep into the rabbit hole, but I always felt it was important to invest as much (if not more) of my time into learning how bitcoin worked, and how to skill up on my bitcoin opsec. I should state, with bitcoin - you never stop learning. The beauty of this thing is it constantly evolves. As I got more comfortable with my knowledge, I bought more coins, still only ploughing in what I could afford to lose and not care about. </p>\n\n<p><strong>2013 High</strong><br/>\nIt was December 2013, and the price had reached ~$1200. The friends and family I’d told about it were all screaming at me to sell - “you’ve made more than 20x your investment”.</p>\n\n<p>I told them the same thing then as I tell them now - that they didn’t understand that this was a new paradigm. This thing is going to change the world, and yes the price is volatile, but if you understand the fundamentals of bitcoin, and have even a tiny grasp of macro economics and how messed up the system was, it was obvious that bitcoin was born to absorb all of the endless money printing etc. Back then, money printing was nowhere near the scale we’ve seen in the past 12 months.</p>\n\n<p><strong>Bear market until late 2017</strong><br/>\nI had everyone telling me how stupid I was for not selling. After the 2013 high, we wouldn’t see the price exceed it’s previous ATH for another 4 years. Whilst everyone was telling me how stupid I was, I was continuing to buy. I was continuing to extol the fantastic qualities of bitcoin, and how it had previously had bull and bear cycles that was heavily influenced by the halved supply of coins every 4 years. They looked at me like I was talking a different language. They didn’t want to invest their time understanding how things worked. All they knew was that every single news outlet was saying that Bitcoin was for terrorists and criminals. I continued going to as many bitcoin meetups as I could. Listening to some of the bitcoin veterans live on stage. It was still very fringe back then, but I was lucky to speak to people such as Andreas Antonopolous, Gavin Andresen, Mike Hearn, Jeremy Allaire, Jameson Lopp, and others. Some of these people will be remembered for the wrong reasons, but at the time - it seemed all of them had good intentions for bitcoin. I still follow Andreas and Jameson, and genuinely think they&#39;re some of the most intelligent and visionary minds out there.</p>\n\n<p><strong>Christmas 2017</strong><br/>\nI remember it well. I was with my family out for dinner and the price was close to $20k. “I can’t believe you still haven’t sold”, they said. I blurted out the same mantra that I did back in 2013. I didn&#39;t sell.</p>\n\n<p><strong>2018</strong><br/>\nWe all know how this year went. It wasn’t pretty, the few people who knew I had bitcoin thought I was silly for not selling. I knew in my heart of hearts I wasn’t. I stuck to the plan, and continued accumulating.</p>\n\n<p><strong>2019 - IVF</strong><br/>\nMe and my wife had struggled trying to conceive. I won’t go into all the details but suffice to say, I don’t come from a particularly wealthy background. That’s not to say that I was a deprived kid - I wasn’t, but I certainly didn’t come from a wealthy background. In order for me and my wife to have our first child, it was becoming obvious that the only option left to us at this point was IVF. IVF was going to cost the best part of £30-£40k. </p>\n\n<p>I’m a true hodler, but I felt that I had been extremely lucky to find bitcoin at the time I did, and so I’d sold a decent amount of coins to fund the IVF. Yes, I could have sold some in late 2017, and liquidated fewer coins to get to the amount I needed - but I didn’t know back then that we’d go down the IVF route.</p>\n\n<p><strong>2020 - No regrets</strong><br/>\nIn January 2020, our little baby boy was born. Our bitcoin baby. A baby, that I honestly don’t think we would have been able to have, had it not been for me stumbling across bitcoin and disregarding all of the naysayers along the way. He’s the light of our lives, and if bitcoin went to zero, I’d still be an absolute winner! At this point, I&#39;ve cashed out about 3x of all the money I&#39;ve put into bitcoin, and still have a sizeable portion of my coins left.</p>\n\n<p><strong>2021</strong><br/>\nIt’s the first day of 2021, and whilst I’m not quite at $1m in terms of my btc holdings, I’m not far off, but better than that, the friends and family that told me to sell are no longer saying &quot;why don’t you sell?&quot;, but asking how they can buy. I could be an arsehole about it, but that’s just not me. I continue to help anyone and everyone that shows any kind of interest in this.</p>\n\n<p><strong>The Future</strong><br/>\nI think the next 24 months are going to be extremely exciting. I’m hoping to get to a point whereby me, my wife and my son can move into our forever home. I have plans for a 50% equity payment, leaving the rest of my coins to hopefully accumulate more value so that at a later stage, I can pay the rest of the mortgage off, and live a debt free life. </p>\n\n<p><strong>To conclude</strong><br/>\nI never thought I’d accumulate the wealth I currently have. It’s still peanuts in terms of what some people in this world have gained (looking at you Bezos), but if it means that I can quit my job, to spend more time with my family, and putting my precious time into learning new things, being more charitable with my time and generally living life to the max - then I’ll be a very happy man.</p>\n\n<p>Peace, love and good luck to all of you in the future.</p>\n</div><!-- SC_ON -->",
  "score": 782,
  "permalink": "/r/Bitcoin/comments/kob79c/my_bitcoin_story_beginning_in_late_2012/",
  "subreddit": "Bitcoin",
  "id": "kob79c",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610100739505
}