{
  "author": "AbjectOffice",
  "original_created_utc": 1629470914,
  "title": "Why did the Ottoman Sultans use kidnapped Christians to make up the Janissaries? Why risk using forced converted ex-slaves as a personal guard?",
  "created_utc": 1629519437,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m asking the question admittedly knowing little about Ottoman history (and Janissary history), certainly less than I&#39;d like.</p>\n\n<p>Why were the Janissaries formed specifically of kidnapped Christian slaves? I&#39;d initially thought it was a loophole thing, like medieval Jews being shoehorned into money lending since Christians couldn&#39;t take loans from each other, but they converted the kidnapped children to Islam, so clearly there&#39;s no loophole they&#39;re trying to get around.</p>\n\n<p>(As a p.s., the only thing I remember from what little reading on the Janissaries I&#39;ve done is a primary source from a European who ate with them, and reported how because for them drinking was a sin, every time they&#39;d drink they&#39;d get extremely drunk since they were already sinning, and I&#39;ve never felt so closely connected to a group in my life)</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/p86q3v/why_did_the_ottoman_sultans_use_kidnapped/",
  "subreddit": "AskHistorians",
  "id": "p86q3v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm asking the question admittedly knowing little about Ottoman history (and\nJanissary history), certainly less than I'd like.\n\nWhy were the Janissaries formed specifically of kidnapped Christian slaves? I'd\ninitially thought it was a loophole thing, like medieval Jews being shoehorned\ninto money…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はオスマン帝国の歴史（およびイェニチェリの歴史）をほとんど知らずにこの質問をしています。\n私はオスマン帝国の歴史（そしてイェニチェリの歴史）をほとんど知らずに質問しています。\n\nイェニチェリはなぜ誘拐されたキリスト教の奴隷から結成されたのでしょうか？私は最初\n最初は、中世のユダヤ人がお金に紛れ込んだような、抜け道的なものだと思っていました。\nと思っていたのですが",
      "title": "なぜオスマン・スルタンは誘拐したキリスト教徒を使ってヤニサーを構成したのか？なぜ、強制改宗させられた元奴隷を身辺警護に使うというリスクを冒すのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在问这个问题时承认对奥斯曼帝国的历史（和\n简易军历史），当然比我想的要少。\n\n为什么杰尼斯军是专门由被绑架的基督教奴隶组成的？我\n起初我以为这是一个漏洞，就像中世纪的犹太人被塞进钱里一样\n纳入货币...",
      "title": "为什么奥斯曼帝国的苏丹用被绑架的基督徒来组成贾尼沙尔军团？为什么要冒险使用被迫改变信仰的前奴隶作为亲卫队？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在問這個問題時承認對奧斯曼帝國的歷史（和\n簡易軍歷史），當然比我想的要少。\n\n爲什麼傑尼斯軍是專門由被綁架的基督教奴隸組成的？我\n起初我以爲這是一個漏洞，就像中世紀的猶太人被塞進錢裏一樣\n納入貨幣...",
      "title": "爲什麼奧斯曼帝國的蘇丹用被綁架的基督徒來組成賈尼沙爾軍團？爲什麼要冒險使用被迫改變信仰的前奴隸作爲親衛隊？"
    }
  ]
}