{
  "author": "biepboep",
  "the_new_excerpt": "I am terminally ill and will probably not be here anymore before the market\nrecovers. This is very sudden and my family do not know about this. Unless a\nmiracle happens, I could be gone this week. My portfolio is mostly coins bought\non Uniswap and PCS so my family won't have a clue on how and when…",
  "original_created_utc": 1623588461,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は末期的な病気で、市場が回復する前にもうここにはいないでしょう。\nしています。これはとても突然のことで、家族はこのことを知りません。奇跡が起きない限り\n奇跡が起こらない限り、私は今週中にはいなくなるかもしれません。私のポートフォリオは、ほとんどがコインです。\n私のポートフォリオはほとんどがUniswapとPCSで購入したコインなので、家族はいつ、どのようにして購入したのか分からないでしょう...。",
      "title": "自分のUniswapとBSCのポートフォリオを家族に残すにはどうしたらいいですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我得了绝症，在市场恢复之前可能不会再来这里了。\n恢复。这非常突然，我的家人不知道这件事。除非有\n除非有奇迹发生，否则我可能会在本周离开。我的投资组合大部分是在\n我的投资组合主要是在Uniswap和PCS上购买的硬币，所以我的家人不会知道如何和何时......",
      "title": "将我的Uniswap和BSC投资组合留给家人的最佳方式是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我得了絕症，在市場恢復之前可能不會再來這裏了。\n恢復。這非常突然，我的家人不知道這件事。除非有\n除非有奇蹟發生，否則我可能會在本週離開。我的投資組合大部分是在\n我的投資組合主要是在Uniswap和PCS上購買的硬幣，所以我的家人不會知道如何和何時......",
      "title": "將我的Uniswap和BSC投資組合留給家人的最佳方式是什麼？"
    }
  ],
  "title": "What's the best way to leave my Uniswap and BSC portfolio to my family?",
  "created_utc": 1623612709,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am terminally ill and will probably not be here anymore before the market recovers. This is very sudden and my family do not know about this. Unless a miracle happens, I could be gone this week. My portfolio is mostly coins bought on Uniswap and PCS so my family won&#39;t have a clue on how and when to cash out. Converting right now is not something I want to do because I believe the coins will be worth a lot more in the future. Is there anything I can do in this situation? Simply giving them my ledger won&#39;t work because it takes digging through etherscan to even know the full extent of this portfolio.</p>\n\n<p>&#x200B;</p>\n\n<p>What are my options?</p>\n\n<p>&#x200B;</p>\n\n<p>Edit for some more detail: since I still have a student debt and it&#39;s for my mom, leaving a will would not help her. The government would liquidate it. Also, most coins are memecoins that I bought before the market crash while overall market sentiment was peaking. This was life changing money at that point but I was an idiot and neglected to cash out.</p>\n</div><!-- SC_ON -->",
  "score": 273,
  "permalink": "/r/CryptoCurrency/comments/nyvl34/whats_the_best_way_to_leave_my_uniswap_and_bsc/",
  "subreddit": "CryptoCurrency",
  "id": "nyvl34",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009738582
}