{
  "author": "Pupulikjan",
  "original_created_utc": 1639458104,
  "title": "That’s it. It’s over!",
  "created_utc": 1639488722,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Is what people thought when bitcoin crashed to 3K during the Covid-19 crash. What did I do? I doubled down. And guess what? I’m killing myself over not buying more because I thought “I’ll just wait and buy more if it goes lower”&lt;/p&gt;\n\n&lt;p&gt;Remember when hitting $30k was impossible to believe? Heck remember when $100 was just a dream? We are literally at 44-47k and people are acting like it’s all over. Investing is the transfer of wealth from inpatient to the patient. Sentiments change every day. Don’t be a fool. If you truly believe in the power of Bitcoin long term, these are the days you buy in. &lt;/p&gt;\n\n&lt;p&gt;There is no such thing as easy money, or gaining wealth quick. Those who become millionaires over some shit coin that pumps \nFrom hype are just a few lucky individuals who got lucky gambling. Wealth build up takes time. &lt;/p&gt;\n\n&lt;p&gt;If you are stressed over the current price action, you do not believe in what you invest, you have little to no understanding what you invested in, you are in too deep, or invested money you need for bills to make a quick flip. &lt;/p&gt;\n\n&lt;p&gt;I’m not telling you to buy the dip. I’m telling you that I’m definitely buying the dip. Only time will tell if it was the right decision. When it comes to Bitcoin I am willing to take that risk.  Don’t leverage trade, don’t panic sell, don’t doubt yourself. &lt;/p&gt;\n\n&lt;p&gt;Markets are like a heart beat on the EKG if it’s not going up and down then it’s dead, if it ONLY goes up or ONLY GOES down it’s abnormal. Remember, Amazon stock dropped by 90% on multiple occasions. There wasn’t a single moment where selling it back then was a good idea. &lt;/p&gt;\n\n&lt;p&gt;I’m not here to say Bitcoin will go up. I’m not psychic. The markets decide what the price will do. I’m saying I believe in this protocol to do well over a long period of time. Just like your high school grades don’t define your intelligence, prices don’t define the true value of an asset. &lt;/p&gt;\n\n&lt;p&gt;I wish you all the best. Hope this helped. &lt;/p&gt;\n\n&lt;p&gt;We are all Satoshi!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 155,
  "permalink": "/r/Bitcoin/comments/rfzris/thats_it_its_over/",
  "subreddit": "Bitcoin",
  "id": "rfzris",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Is what people thought when bitcoin crashed to 3K during the Covid-19 crash.\nWhat did I do? I doubled down. And guess what? I’m killing myself over not\nbuying more because I thought “I’ll just wait and buy more if it goes lower”\n\nRemember when hitting $30k was impossible to believe? Heck remember…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Covid-19の暴落時にビットコインが3Kまで暴落した時に人々が考えたことです。\n私は何をしたのでしょうか？2倍にしました。そしてどうなったと思う？私は自分を殺しています。\nもっと下がったら買えばいいや \"と思って買い増しした。\n\n3万ドルを達成することが不可能だった頃を覚えていますか？覚えているか...",
      "title": "それでいい。もう終わり！"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "是人们在Covid-19暴跌期间比特币暴跌到3K时的想法。\n我做了什么？我加倍了。你猜怎么着？我正在为我没有\n因为我想 \"如果它再跌，我就等着买更多\"。\n\n还记得当冲击3万美元是不可能相信的吗？糟糕的是，记得...",
      "title": "就这样了。结束了!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "是人們在Covid-19暴跌期間比特幣暴跌到3K時的想法。\n我做了什麼？我加倍了。你猜怎麼着？我正在爲我沒有\n因爲我想 \"如果它再跌，我就等着買更多\"。\n\n還記得當衝擊3萬美元是不可能相信的嗎？糟糕的是，記得...",
      "title": "就這樣了。結束了!"
    }
  ]
}