{
  "author": "DarkAmaterasu58",
  "original_created_utc": 1639322384,
  "title": "Do other people sometimes have extremely romantic or sexual dreams about some random person you know and then wake up the next day with a subconscious infatuation with them that slowly goes away throughout the day?",
  "created_utc": 1639332792,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This probably sounds like an oddly specific question, but this happens to me sometimes. I’m a 25-year-old male, if that really matters, in the dreams can be about pretty much any girl that I know or am even somewhat aware of. Does this happen to anyone else?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/TooAfraidToAsk/comments/rer2ys/do_other_people_sometimes_have_extremely_romantic/",
  "subreddit": "TooAfraidToAsk",
  "id": "rer2ys",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This probably sounds like an oddly specific question, but this happens to me\nsometimes. I’m a 25-year-old male, if that really matters, in the dreams can be\nabout pretty much any girl that I know or am even somewhat aware of. Does this\nhappen to anyone else?",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "妙に具体的な質問に聞こえるかもしれませんが、こんなことがあるんです。\nが時々あります。私は25歳の男性です。\n知っている、あるいは多少なりとも意識している女の子なら、ほとんど誰でもいいのです。これは\n他の人にも起こるのでしょうか？",
      "title": "他の人は、時々、ランダムに知っている人の非常にロマンチックな、または性的な夢を見て、次の日に目を覚ますと、その人に潜在的に夢中になっていて、それが一日中ゆっくりと消えていくということはありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这听起来可能是一个奇怪的具体问题，但这种情况发生在我身上\n有时会这样。我是一个25岁的男性，如果这真的很重要的话，在梦中可以是\n梦到的几乎是我认识的、甚至有点了解的任何女孩。这是否\n发生在其他人身上吗？",
      "title": "其他人是否有时会对你认识的某个随机的人做极其浪漫或性的梦，然后第二天醒来，潜意识里对他们的迷恋会在一天中慢慢消失？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這聽起來可能是一個奇怪的具體問題，但這種情況發生在我身上\n有時會這樣。我是一個25歲的男性，如果這真的很重要的話，在夢中可以是\n夢到的幾乎是我認識的、甚至有點了解的任何女孩。這是否\n發生在其他人身上嗎？",
      "title": "其他人是否有時會對你認識的某個隨機的人做極其浪漫或性的夢，然後第二天醒來，潛意識裏對他們的迷戀會在一天中慢慢消失？"
    }
  ]
}