{
  "author": "Hubarruby",
  "the_new_excerpt": "I was recently having a discussion/lighthearted debate with some friends, and I\nargued (by Ockham's razor) that my position was more likely to be correct\nbecause it involved fewer assumptions and variables. Then my friend (certainly\nmore well-versed in philosophy than myself) said that I \"should be…",
  "original_created_utc": 1620782447,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、何人かの友人と議論や軽い討論をしていたときのことです。\n私は（オッカムの剃刀で）自分の立場が正しい可能性が高いと主張しました。\n仮定や変数が少ないので、自分の立場が正しい可能性が高いと主張しました。すると、友人は（確かに\n私よりも哲学に精通している）は、私が「...すべきだ」と言いました。",
      "title": "オッカムの剃刀を正しく使うには？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近我与一些朋友进行了讨论/轻松的辩论，我\n我认为（根据奥卡姆剃刀），我的立场更可能是正确的\n因为它涉及较少的假设和变量。然后我的朋友（当然\n比我更精通哲学）说我 \"应该...",
      "title": "如何正确使用奥卡姆剃刀？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近我與一些朋友進行了討論/輕鬆的辯論，我\n我認爲（根據奧卡姆剃刀），我的立場更可能是正確的\n因爲它涉及較少的假設和變量。然後我的朋友（當然\n比我更精通哲學）說我 \"應該...",
      "title": "如何正確使用奧卡姆剃刀？"
    }
  ],
  "title": "How does one use Ockham's Razor properly?",
  "created_utc": 1620836014,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was recently having a discussion/lighthearted debate with some friends, and I argued (by Ockham&#39;s razor) that my position was more likely to be correct because it involved fewer assumptions and variables. Then my friend (certainly more well-versed in philosophy than myself) said that I &quot;should be wary how I use Ockham&#39;s Razor, lest I cut myself&quot;, showing me this article (<a href=\"https://fs.blog/2019/10/occams-razor/\">https://fs.blog/2019/10/occams-razor/</a>). I can&#39;t really see how I was using Ockham&#39;s Razor incorrectly, or what the idea of &quot;cutting oneself&quot; with Ockham&#39;s Razor would really mean. If Ockham&#39;s Razor isn&#39;t summarized by &quot;the simplest answer is most likely correct&quot;, then what is a more accurate description?</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/askphilosophy/comments/nad12f/how_does_one_use_ockhams_razor_properly/",
  "subreddit": "askphilosophy",
  "id": "nad12f",
  "is_self": true,
  "media": null,
  "is_video": false
}