{
  "author": "_s79",
  "original_created_utc": 1631984366,
  "title": "How would you sum up crypto in one word?",
  "created_utc": 1632001194,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>TL:DR - Mine would be “volatile”. </p>\n\n<p>If I had to use just one word to describe crypto, then mine would have to be volatile. </p>\n\n<p>A day in the life of crypto is like a year in traditional investments like the stock markets, they’re just so boring in comparison. In crypto land, it’s 24/7 and you just never know what’s coming next. Your favourite project might crash, get hacked, rug pulled or, hopefully it might even…. moon. </p>\n\n<p>It’s what we’re here for and it’s why most of us can’t stop checking the charts all day (and night).</p>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/CryptoCurrency/comments/pqq4w4/how_would_you_sum_up_crypto_in_one_word/",
  "subreddit": "CryptoCurrency",
  "id": "pqq4w4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "TL:DR - Mine would be “volatile”.\n\nIf I had to use just one word to describe crypto, then mine would have to be\nvolatile.\n\nA day in the life of crypto is like a year in traditional investments like the\nstock markets, they’re just so boring in comparison. In crypto land, it’s 24/7\nand you just never…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "TL:DR - 私の場合は「volatile」です。\n\n暗号を一言で表すとしたら、私は「揮発性」だと思います。\n揮発性です。\n\n暗号の1日は、株式市場のような伝統的な投資の1年に相当します。\n株式市場のような伝統的な投資の1年のようなもので、それに比べるととても退屈です。暗号の世界では、24時間365日\nそして、決して...",
      "title": "Cryptoを一言で言うとどうなりますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "TL:DR - 我的将是 \"不稳定\"。\n\n如果我不得不用一个词来描述加密货币，那么我的词将不得不是\n不稳定。\n\n在加密货币的生活中，一天就像在传统投资中的一年，比如股票市场。\n股票市场，相比之下，它们实在是太无聊了。在加密货币领域，它是24/7的\n而且你永远不会...",
      "title": "你会如何用一个词来概括加密货币？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "TL:DR - 我的將是 \"不穩定\"。\n\n如果我不得不用一個詞來描述加密貨幣，那麼我的詞將不得不是\n不穩定。\n\n在加密貨幣的生活中，一天就像在傳統投資中的一年，比如股票市場。\n股票市場，相比之下，它們實在是太無聊了。在加密貨幣領域，它是24/7的\n而且你永遠不會...",
      "title": "你會如何用一個詞來概括加密貨幣？"
    }
  ]
}