{
  "author": "epictreasure1",
  "the_new_excerpt": "You know, in all the popular and scary AI science fiction out there; from Black\nMirror to I, Robot, there often is something that is forgotten before things\nreach a state of mass dystopia. And that’s the world right before everything\ncompletely hits the fan.\n\nYes, there is this beautiful world…",
  "original_created_utc": 1618603308,
  "localize": [
    {
      "locale": "ja",
      "title": "VAIOTの仲介サービスは、ブロックチェーンが商取引に実際に影響を与える未来を象徴しています",
      "the_new_excerpt": "世間で話題の怖いAIサイエンスフィクション、「Black」（ブラック）、「Mr.\nミラーからI, Robotまで、物事が起こる前に忘れ去られることがよくあります。\n集団ディストピアの状態になる。そしてそれは、すべてが崩壊する直前の世界\n完全にファンになってしまう。\n\nそう、この美しい世界があるのだ...。"
    },
    {
      "locale": "zh",
      "title": "VAIOT的经纪服务代表了未来区块链对商业的实际影响。",
      "the_new_excerpt": "你知道，在所有流行的和可怕的人工智能科幻小说中；从《黑镜》到《我，机器人》，经常有一些东西被遗忘。\n从《黑镜》到《我，机器人》，常常有一些东西在事情发展到大规模乌托邦之前就被遗忘了。\n达到大规模乌托邦的状态。那就是在一切都完全崩溃之前的世界\n彻底崩溃之前的世界。\n\n是的，有这样一个美丽的世界..."
    },
    {
      "locale": "zh-Hant",
      "title": "VAIOT的經紀服務代表了未來區塊鏈對商業的實際影響。",
      "the_new_excerpt": "你知道，在所有流行的和可怕的人工智能科幻小說中；從《黑鏡》到《我，機器人》，經常有一些東西被遺忘。\n從《黑鏡》到《我，機器人》，常常有一些東西在事情發展到大規模烏托邦之前就被遺忘了。\n達到大規模烏托邦的狀態。那就是在一切都完全崩潰之前的世界\n徹底崩潰之前的世界。\n\n是的，有這樣一個美麗的世界..."
    }
  ],
  "title": "VAIOT’s brokerage services represent the future of blockchain’s real-world impact on commerce",
  "created_utc": 1618612296,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>You know, in all the popular and scary AI science fiction out there; from Black Mirror to I, Robot, there often is something that is forgotten before things reach a state of mass dystopia. And that’s the world right before everything completely hits the fan. </p>\n\n<p>Yes, there is this beautiful world before Skynet rains fire down on us in which AI makes our lives simpler and radically transforms all of the analytical data available into a series of streamlined processes making our lives uniquely simple. </p>\n\n<p>Not to say our world will ever be perfect regardless of where technology is. Complications in implementation and a constantly shifting landscape will always prevent mass adoption from being a monolithic experience. But machine learning is our first step into the next level of automation and it will be the firms leading the charge, taking the risks, that both make our lives easier and their investors’ wallets fatter.</p>\n\n<p><strong>With that in mind, VAIOT is developing AI assistants in cooperation with IBM Watson to serve commercial applications ranging anywhere from legal, to brokerage, and even direct marketplace sales.</strong> Having received a number of questions about how VAIOT integrates such a major piece of technology, the team explores that in great detail in a recent Medium post. By explaining just how IBM Watson works and how it fits in the puzzle of automating marketplaces, VAIOT makes the promise of AI clearer to see with just how seriously it can impact our daily interactions.</p>\n\n<p>Their mobile app, available in beta, has already demonstrated their viability as a legal assistant, churning out binding contracts through seamlessly interacting with a digital agent. But even as impressive as that alone seems, the brokerage services they’re adding could prove to have even more promise.</p>\n\n<p>After all, as we’ve seen the success of Expedia and TD Ameritrade reach massive valuations as brokerages in their respective industries of travel and finance, we understand that success in the digital age lies in connecting people with the best deals quickly and efficiently. In a lot of ways, that’s what made Amazon the dominant presence it is today.</p>\n\n<p>With the power of blockchain and AI, VAIOT is able to more efficiently source sets of data through the real-time price feeds of oracles such as Chainlink, weighing it quickly to make personalized suggestions that best suit the users needs.</p>\n\n<p>That’s right, no different than how VAIOT’s voice assistant begins to learn your tone, dialect, and casual phrases, <strong>VAIOT’s broker will be your agent, one that will eventually know you better than you know yourself</strong>, tailoring your selection so that you only spend time shopping for what makes sense to you.</p>\n\n<p>You can imagine how this would appeal to not only consumers who don’t want their time wasted with irrelevant offers, but to businesses looking to reach their target audience. Because of this, VAIOT’s multiple business lines gives them several paths to reap <strong>first-movers advantage</strong> in a variety of fields. This is not as simple as one product or one application, VAIOT can be what links the future of blockchain and AI in all of commerce through their solutions.</p>\n\n<p>Currently running just over a $10M market cap, VAIOT has the vision, the resources, and plenty of room to grow with all of the positive momentum they have been seeing. It’s situations like this that offer the best buy opportunities as you can plainly see and invest in the foundation for success without having to pay for all the attention that comes with established history.</p>\n\n<p>But if you want to wait, that’s perfectly fine too. With the trajectory of this bull run and the utility of these services regardless of the market, I expect VAIOT to be presenting good value as a buy for quite a while. Just know this might be the last stop before we start discussing the next comma.</p>\n</div><!-- SC_ON -->",
  "score": 404,
  "permalink": "/r/CryptoCurrency/comments/msb7uf/vaiots_brokerage_services_represent_the_future_of/",
  "subreddit": "CryptoCurrency",
  "id": "msb7uf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171519536
}