{
  "author": "durika",
  "original_created_utc": 1637385945,
  "title": "Which toilet do I go to with my daughter?",
  "created_utc": 1637414725,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi, so yesterday in a mall, my 4 yo wanted to go pee so I took her to the bathroom, she used mens bathroom no problem. Today she refused that and demanded to go to ladies so I took her there. Noone was there at the start but while she was doing her business some girls came, stopped and gave me questioning looks. So I explained I just wait for my kid and proceeded to continue staring at my phone. The were like &quot;ah yeah ok&quot; and continued tending to their business. My daughter then announced she is done and we continued our day.\nNo problem. \nBut it left me wondering what people think is right thing to do and maybe I could even get in trouble in some parts of the world...?</p>\n</div><!-- SC_ON -->",
  "score": 120,
  "permalink": "/r/NoStupidQuestions/comments/qxyo5k/which_toilet_do_i_go_to_with_my_daughter/",
  "subreddit": "NoStupidQuestions",
  "id": "qxyo5k",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi, so yesterday in a mall, my 4 yo wanted to go pee so I took her to the\nbathroom, she used mens bathroom no problem. Today she refused that and demanded\nto go to ladies so I took her there. Noone was there at the start but while she\nwas doing her business some girls came, stopped and gave me…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは、昨日ショッピングモールで4歳の子供がおしっこをしたいと言ったので、トイレに連れて行きました。\nトイレに連れて行きました。彼女は男性用トイレを問題なく使いました。今日、彼女はそれを拒否し、要求しました\n女性用トイレに行きたいと言うので連れて行きました。最初は誰もいませんでしたが、彼女が用を足している間に何人かの女の子がやってきて\nしかし、彼女が用を足している間に何人かの女の子がやってきて、立ち止まり、私に...",
      "title": "娘と一緒にどのトイレに行けばいいの？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好，昨天在一个商场里，我的4岁孩子想去小便，所以我带她去了洗手间。\n厕所，她用了男厕所，没有问题。今天她拒绝了，并要求\n我就带她去了女厕所。开始的时候没有人，但是当她在做事情的时候\n她在做她的事情时，一些女孩来了，停下来，给我...",
      "title": "我和我女儿去哪个厕所？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好，昨天在一個商場裏，我的4歲孩子想去小便，所以我帶她去了洗手間。\n廁所，她用了男廁所，沒有問題。今天她拒絕了，並要求\n我就帶她去了女廁所。開始的時候沒有人，但是當她在做事情的時候\n她在做她的事情時，一些女孩來了，停下來，給我...",
      "title": "我和我女兒去哪個廁所？"
    }
  ]
}