{
  "author": "esqandar",
  "the_new_excerpt": "BTW, I lost 60% of my initial investment in Bitcoin and some other altcoins 1\nweek after I made my first time purchase. I felt like throwing up, but after\nthat dump, I started to do research more about Bitcoin. It's the future. And\nthen I started to HODL and DCA my purchase. I felt nothing about…",
  "original_created_utc": 1610458851,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "另外，我在比特币和其他一些altcoins上损失了60%的初始投资1。\n在我第一次购买后的一周。我觉得想吐，但在\n那个垃圾桶，我开始对比特币做更多的研究。这是未来的趋势. 而且\n然后我开始HODL和DCA我的购买。我觉得没什么...",
      "title": "我所有的朋友都开始对比特币30%的抛售感到恐慌。看在上帝的份上! 比特币的第一条规则就是HODL. 如果你不能HODL过30%的dump，你就不配30000%的泵。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "另外，我在比特幣和其他一些altcoins上損失了60%的初始投資1。\n在我第一次購買後的一週。我覺得想吐，但在\n那個垃圾桶，我開始對比特幣做更多的研究。這是未來的趨勢. 而且\n然後我開始HODL和DCA我的購買。我覺得沒什麼...",
      "title": "我所有的朋友都開始對比特幣30%的拋售感到恐慌。看在上帝的份上! 比特幣的第一條規則就是HODL. 如果你不能HODL過30%的dump，你就不配30000%的泵。"
    }
  ],
  "title": "All My friends started to freak out about Bitcoin 30% dump. For the love of god! First rule of Bitcoin is to HODL. If you can't HODL through 30% dump, you don't deserve 30000% pump.",
  "created_utc": 1610502909,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>BTW, I lost 60% of my initial investment in Bitcoin and some other altcoins 1 week after I made my first time purchase. I felt like throwing up, but after that dump, I started to do research more about Bitcoin. It&#39;s the future. And then I started to HODL and DCA my purchase. I felt nothing about yesterday&#39;s dump because I was still in huge profit even when Bitcoin correct 50%</p>\n\n<p>Remember, </p>\n\n<p>1)the government are printing unlimited amount of Fiat currencies </p>\n\n<p>2) Smart Money (Whales) number are growing rapidly</p>\n\n<p>3) The retail investor FOMO hasn&#39;t really started yet</p>\n\n<p>4) Time in the market will beat timing the market </p>\n\n<p>So, stop freaking out, and start HODL the fuck up!</p>\n</div><!-- SC_ON -->",
  "score": 1214,
  "permalink": "/r/Bitcoin/comments/kvrua1/all_my_friends_started_to_freak_out_about_bitcoin/",
  "subreddit": "Bitcoin",
  "id": "kvrua1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706373020
}