{
  "author": "Motor_Cup6806",
  "original_created_utc": 1624892686,
  "title": "Is it normal for a man to get slightly physical towards his partner during arguments?",
  "created_utc": 1624909557,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I (female) have been in a relationship for six years now. My one and only relationship so nothing for me to compare to. (I’m in my mid twenties.) We got engaged earlier this year. Everything’s great between us except that occasionally when we fight he loses his temper and tries to manhandle me. Usually that just involves pinning me with a firm grip on my limbs to a wall/bed so I have to listen to him. His grip is painful but not really hard enough to leave a bruise. I think I’ve only been bruised twice (in these six years) and the one outlier occasion was when he tried to throw me onto the bed a few years ago and grip my throat and throttle me to stop me from speaking. But he apologised immediately and stopped himself because he recognised that was too much. </p>\n\n<p>I know it’s clearly not ideal behaviour but is it actually not uncommon?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/o9m3mq/is_it_normal_for_a_man_to_get_slightly_physical/",
  "subreddit": "TooAfraidToAsk",
  "id": "o9m3mq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I (female) have been in a relationship for six years now. My one and only\nrelationship so nothing for me to compare to. (I’m in my mid twenties.) We got\nengaged earlier this year. Everything’s great between us except that\noccasionally when we fight he loses his temper and tries to manhandle…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私（女性）は、交際を始めて6年になります。私の唯一無二の\n比べられるものがありません。(20代半ばです。) 今年の初めに婚約しました。\n今年の初めに婚約しました。私たちの間ではすべてが素晴らしいのですが\nたまに喧嘩をすると、彼はカッとなって手を出そうとします...",
      "title": "議論の際に、男性がパートナーに対して少し肉体的になるのは普通のことですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我（女性）已经有六年的关系了。我唯一的一次\n的关系，所以我没有什么可以比较的。(我20多岁)。\n今年年初订婚。我们之间一切都很好，除了\n偶尔我们吵架的时候，他就会发脾气，并试图对我们动手动脚......",
      "title": "一个男人在争吵时对他的伴侣稍有肢体接触是正常的吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我（女性）已經有六年的關係了。我唯一的一次\n的關係，所以我沒有什麼可以比較的。(我20多歲)。\n今年年初訂婚。我們之間一切都很好，除了\n偶爾我們吵架的時候，他就會發脾氣，並試圖對我們動手動腳......",
      "title": "一個男人在爭吵時對他的伴侶稍有肢體接觸是正常的嗎？"
    }
  ]
}