{
  "author": "bernardjaubert",
  "original_created_utc": 1635464627,
  "title": "How much credit card fraud did there used to be when imprinters were used?",
  "created_utc": 1635517980,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I just finished watching Planes Trains and Automobiles, which is a fantastic movie from 1987.  Near the beginning of the film, we see Steve Martin and John Candy use their credits cards, which are imprinted with an imprinter.  I couldn&#39;t help but think that credit card fraud would have been a big issue back around this time, especially since most places didn&#39;t have cameras in them.  If there were any cameras, the video would have been of very poor quality.  How much credit card fraud took place from approximately 1960-1992?  I imagine a lot of bogus checks were written as well.  How long did it take for these imprinter slips to be manually entered and verified with credit card companies before fraud was confirmed?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/qhzngz/how_much_credit_card_fraud_did_there_used_to_be/",
  "subreddit": "AskHistorians",
  "id": "qhzngz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I just finished watching Planes Trains and Automobiles, which is a fantastic\nmovie from 1987. Near the beginning of the film, we see Steve Martin and John\nCandy use their credits cards, which are imprinted with an imprinter. I couldn't\nhelp but think that credit card fraud would have been a big…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1987年に公開された素晴らしい映画『プレーンズ・トレインズ・アンド・オートモービルズ』を見終わったところです。\n1987年の素晴らしい映画です。この映画の冒頭で、スティーブ・マーティンとジョン・キャンディがクレジットカードを使うシーンがあります。\nキャンディが、インプリンターで刷られたクレジットカードを使っています。私は思わず\n私は、クレジットカードの不正使用が大きな問題になっていたのではないかと思わずにはいられませんでした...。",
      "title": "刻印機が使われていた頃、クレジットカードの不正使用はどのくらいあったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我刚刚看完《飞机、火车和汽车》，这是一部1987年的精彩电影。\n1987年的电影。在影片的开头，我们看到史蒂夫-马丁和约翰\n坎迪使用他们的信用卡，这些信用卡是用印钞机印制的。我忍不住\n我不禁想到，信用卡欺诈将是一个大问题。",
      "title": "以前使用压印机的时候，有多少信用卡欺诈？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我剛剛看完《飛機、火車和汽車》，這是一部1987年的精彩電影。\n1987年的電影。在影片的開頭，我們看到史蒂夫-馬丁和約翰\n坎迪使用他們的信用卡，這些信用卡是用印鈔機印製的。我忍不住\n我不禁想到，信用卡欺詐將是一個大問題。",
      "title": "以前使用壓印機的時候，有多少信用卡欺詐？"
    }
  ]
}