{
  "author": "chrisdh79",
  "the_new_excerpt": "Bernard Madoff, mastermind of the biggest investment fraud in U.S. history,\nripping off tens of thousands of clients of as much as $65 billion, died early\nWednesday, The Associated Press reported. He was 82.\n\nMadoff died at the Federal Medical Center in Butner, North Carolina, apparently\nfrom…",
  "original_created_utc": 1618408598,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "米国史上最大の投資詐欺事件の首謀者であるバーナード・マドフは、何万人もの顧客から650億ドルもの金を奪った。\n数万人の顧客から650億ドルもの金を騙し取った米国史上最大の投資詐欺事件の首謀者であるバーナード・マドフ氏が、水曜日未明に死去しました。\nAP通信が伝えたところによると、マドフ氏は水曜日の未明に亡くなりました。享年82歳。\n\nマドフ氏は、ノースカロライナ州バトナーにある連邦医療センターで死亡したようです。\n原因は...",
      "title": "米国最大の投資詐欺事件の首謀者、バーニー・マドフ氏が82歳で死去、AP通信が報道"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "伯纳德-麦道夫，主谋 最大的投资欺诈 在美国历史上。\n骗取数万名客户高达650亿美元的资金，英年早逝。\n据美联社报道，周三。他是82岁。\n\n麦道夫死于北卡罗来纳州布特纳的联邦医疗中心，显然是\n从...",
      "title": "据美联社报道，全美最大投资诈骗案的主谋麦道夫去世，享年82岁。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "伯納德-麥道夫，主謀 最大的投資欺詐 在美國曆史上。\n騙取數萬名客戶高達650億美元的資金，英年早逝。\n據美聯社報道，週三。他是82歲。\n\n麥道夫死於北卡羅來納州布特納的聯邦醫療中心，顯然是\n從...",
      "title": "據美聯社報道，全美最大投資詐騙案的主謀麥道夫去世，享年82歲。"
    }
  ],
  "title": "Bernie Madoff, mastermind of the nation’s biggest investment fraud, dies at 82, AP reports",
  "created_utc": 1618413212,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Bernard Madoff, mastermind of the biggest investment fraud in U.S. history, ripping off tens of thousands of clients of as much as $65 billion, died early Wednesday, The Associated Press reported. He was 82.</p>\n\n<p>Madoff died at the Federal Medical Center in Butner, North Carolina, apparently from natural causes, the AP reported, citing an unidentified person familiar with the matter. He would have turned 83 on April 29.</p>\n\n<p>Madoff was serving a 150-year sentence at the prison, where he had been treated for what his attorney called terminal kidney disease.\n<a href=\"https://www.cnbc.com/2021/04/14/bernie-madoff-dies-mastermind-of-the-nations-biggest-investment-fraud-was-82.html\">https://www.cnbc.com/2021/04/14/bernie-madoff-dies-mastermind-of-the-nations-biggest-investment-fraud-was-82.html</a></p>\n</div><!-- SC_ON -->",
  "score": 1543,
  "permalink": "/r/stocks/comments/mqr3jo/bernie_madoff_mastermind_of_the_nations_biggest/",
  "subreddit": "stocks",
  "id": "mqr3jo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566618936
}