{
  "author": "Fauster",
  "the_new_excerpt": "I was not the one who set it to private but I made it clear that other mods do\nhave authority. Let's look at this phase as the subreddit going through a rough\npatch. We will get through, but things probably won't look the same to mods or\nusers until the admins get a handle on what is going on. If…",
  "original_created_utc": 1611796296,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "不是我把它设置为私密的，但我明确表示，其他版主也会这样做。\n有权威。让我们把这一阶段看成是子网在经历艰难的阶段\n补丁。我们会度过难关的，但事情可能不会像mods或。\n用户，直到管理员得到一个控制 是怎么回事。如果...",
      "title": "大家好，/r/stocks又开始公开了。有垃圾邮件发送者和机器人，事情是一团糟，但社区需要能够谈论他们认为发生了什么。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不是我把它設置爲私密的，但我明確表示，其他版主也會這樣做。\n有權威。讓我們把這一階段看成是子網在經歷艱難的階段\n補丁。我們會度過難關的，但事情可能不會像mods或。\n用戶，直到管理員得到一個控制 是怎麼回事。如果...",
      "title": "大家好，/r/stocks又開始公開了。有垃圾郵件發送者和機器人，事情是一團糟，但社區需要能夠談論他們認爲發生了什麼。"
    }
  ],
  "title": "Hi Everyone, /r/stocks is back to public. There are spammers and bots, things are a mess, but the community needs to be able to talk about what they think is going on.",
  "created_utc": 1611801957,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was not the one who set it to private but I made it clear that other mods do have authority. Let&#39;s look at this phase as the subreddit going through a rough patch. We will get through, but things probably won&#39;t look the same to mods or users until the admins get a handle on what is going on. If the community has tips about what they see happening, please let us know, but it will take time to respond to legitimate complaints and concerns. </p>\n\n<p>I haven&#39;t seen anything like this before. Please don&#39;t ask us to fix things immediately by blanket bans of tickers. If we close subreddits due to bots, that in and of itself could be considered capitulation or a lack of neutrality. Please do sort by top/week if you want to see something that looks more normal. Please understand that we are a little overwhelmed, but it&#39;s okay to be overwhelmed sometimes. We will figure this out, but we aren&#39;t going to change everything immediately because of the events of one day. </p>\n\n<p>Please don&#39;t spread potentially false rumors. If you do so and you have a position, it could be bad for you, personally, when those rumors turn out to be false and you close a position with a profit.</p>\n</div><!-- SC_ON -->",
  "score": 55,
  "permalink": "/r/stocks/comments/l6jzyp/hi_everyone_rstocks_is_back_to_public_there_are/",
  "subreddit": "stocks",
  "id": "l6jzyp",
  "is_self": true,
  "media": null,
  "is_video": false
}