{
  "author": "prajwalwillrule",
  "original_created_utc": 1626872051,
  "title": "Family adopting Crypto starts with the cool uncles and aunts giving you crypto instead of money.",
  "created_utc": 1626928306,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In a future not too far away, the cool uncles and aunts are giving the kids Crypto to go shopping or get something to eat. Parents saving for their kid&#39;s college would probably by a staked Crypto. \nAlso your pocket money is probably given in crypto after a certain age, say 16. \nIt&#39;s probably happening somewhere in the world right now. All I can say is change, starts from one. Adoption will happen one person at a time, one family at a time, one neighborhood at a time, one country at a time and then the world. </p>\n\n<p>So yes, do your part and while you dream of your future, dream of it with Crypto</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/CryptoCurrency/comments/oopa60/family_adopting_crypto_starts_with_the_cool/",
  "subreddit": "CryptoCurrency",
  "id": "oopa60",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In a future not too far away, the cool uncles and aunts are giving the kids\nCrypto to go shopping or get something to eat. Parents saving for their kid's\ncollege would probably by a staked Crypto. Also your pocket money is probably\ngiven in crypto after a certain age, say 16. It's probably happening…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そう遠くない未来、かっこいいおじさんやおばさんが子供たちに\n買い物や食事をするためにCryptoを渡す。子供の大学進学のためにお金を貯めている親は\n大学進学のためにお金を貯めている親御さんは、おそらくステイクされたCryptoを使うでしょう。また、お小遣いはおそらく\nお小遣いも、16歳くらいになると暗号で渡されるでしょう。これはおそらく...",
      "title": "家族がCryptoを採用するのは、かっこいいおじさんやおばさんがお金の代わりにCryptoを渡すことから始まります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在不远的将来，那些很酷的叔叔和阿姨们会给孩子们\nCrypto去购物或买东西吃。父母为他们孩子的\n可能会用一个有桩的Crypto。此外，你的零花钱可能是\n过了一定的年龄，比如说16岁，就会给你加密货币。这可能正在发生...",
      "title": "家庭采用加密货币，首先是酷叔叔和阿姨给你加密货币而不是钱。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在不遠的將來，那些很酷的叔叔和阿姨們會給孩子們\nCrypto去購物或買東西喫。父母爲他們孩子的\n可能會用一個有樁的Crypto。此外，你的零花錢可能是\n過了一定的年齡，比如說16歲，就會給你加密貨幣。這可能正在發生...",
      "title": "家庭採用加密貨幣，首先是酷叔叔和阿姨給你加密貨幣而不是錢。"
    }
  ]
}