{
  "author": "zombiep00",
  "the_new_excerpt": "There was a racket going on in the fireplace in our bedroom so I went to inspect\nwhat was making the noise.\nWhen I put my flashlight up to the glass, I saw a squirrel staring back at me,\nwho then promptly attacked the glass..\n\nThe squirrel is seemingly psychotic (though that may be normal…",
  "original_created_utc": 1617316207,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我们卧室的壁炉里有喧闹声，所以我去检查了一下\n是什么在发出声音。\n当我把手电筒对着玻璃的时候，我看到一只松鼠在后面盯着我。\n然后立即攻击玻璃... ...\n\n这只松鼠似乎是精神病（虽然这可能是正常的......",
      "title": "我的壁炉里有一只尖叫的松鼠，我怎么把它弄出来？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們臥室的壁爐裏有喧鬧聲，所以我去檢查了一下\n是什麼在發出聲音。\n當我把手電筒對着玻璃的時候，我看到一隻松鼠在後面盯着我。\n然後立即攻擊玻璃... ...\n\n這隻松鼠似乎是精神病（雖然這可能是正常的......",
      "title": "我的壁爐裏有一隻尖叫的松鼠，我怎麼把它弄出來？"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "寝室の暖炉の中で音がしていたので、何の音か調べに行きました。\n懐中電灯をガラスに近づけると\n懐中電灯をガラスに近づけてみると、リスがこちらを見つめていました。\nそしてリスはすぐにガラスを攻撃したのです。\n\nそのリスは精神的に病んでいるように見えました（それが普通かもしれませんが...）。",
      "title": "緊急】暖炉の中でリスが叫んでいるのですが、どうやって追い出せばいいでしょうか？"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "寝室の暖炉の中で音がしていたので、何の音か調べに行きました。\n懐中電灯をガラスに近づけると\n懐中電灯をガラスに近づけてみると、リスがこちらを見つめていました。\nそしてリスはすぐにガラスを攻撃したのです。\n\nそのリスは精神的に病んでいるように見えました（それが普通かもしれませんが...）。",
      "title": "緊急】暖炉の中でリスが叫んでいるのですが、どうやって追い出せばいいでしょうか？"
    }
  ],
  "title": "[URGENT] THERE IS A SCREAMING SQUIRREL IN MY FIREPLACE HOW DO I GET IT OUT",
  "created_utc": 1617344294,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There was a racket going on in the fireplace in our bedroom so I went to inspect what was making the noise.<br/>\nWhen I put my flashlight up to the glass, I saw a squirrel staring back at me, who then promptly attacked the glass..  </p>\n\n<p>The squirrel is seemingly psychotic (though that may be normal for squirrels...?). My father advised me to make a barricade of sheets to the sliding glass door in our bedroom, but I&#39;m afraid it will just run under the sheets I put up and find a cranny to hide in.   </p>\n\n<p>After talking it over with my dad, the squirrel started to squeak really loudly three or four times in a row. Hasn&#39;t done it since, though. </p>\n\n<p>How do I get the squirrel out of there without being mauled by it...? Lol.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/NoStupidQuestions/comments/mi6qgn/urgent_there_is_a_screaming_squirrel_in_my/",
  "subreddit": "NoStupidQuestions",
  "id": "mi6qgn",
  "is_self": true,
  "media": null,
  "is_video": false
}