{
  "author": "thimbelinda",
  "original_created_utc": 1658585809,
  "title": "Can men pull out before they ejaculate?",
  "created_utc": 1658590326,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;We were newlyweds and excited for sex.  I told my husband  I&amp;#39;m at my fertile time and we need a condom.  He said no, he would pull out in time. He did not pull out in time.  He didn&amp;#39;t even try to pull out.  I got pregnant.   I was upset and asked why.  He said he couldn&amp;#39;t pull out.  He said it felt so good he was incapable of pulling out.  Is this really true?   Do men lose the capacity for reason and become incapable of pulling out?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 117,
  "permalink": "/r/NoStupidQuestions/comments/w6525u/can_men_pull_out_before_they_ejaculate/",
  "subreddit": "NoStupidQuestions",
  "id": "w6525u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "We were newlyweds and excited for sex. I told my husband I'm at my fertile time\nand we need a condom. He said no, he would pull out in time. He did not pull out\nin time. He didn't even try to pull out. I got pregnant. I was upset and asked\nwhy. He said he couldn't pull out. He said it felt so good…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "新婚でセックスに興奮していた私たち。私は夫に、今が妊娠可能な時期だからコンドームが必要だと伝えました。\nコンドームが必要だと言いました。彼は「いや、そのうちに抜く」と言いました。彼は時間内に抜かなかった。\n彼は抜かなかった。彼は抜こうともしなかった。私は妊娠してしまいました。私は動揺して、「どうして？\n「なぜ？彼は「抜けなかった」と言いました。彼はとても気持ちよかったと...",
      "title": "男性は射精する前に抜くことができるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们是新婚夫妇，对性生活很兴奋。我告诉我的丈夫，我现在正处于生育期\n我们需要一个避孕套。他说不用了，他会及时拔出来的。他并没有及时拔出\n及时。他甚至没有试图拔出。我怀孕了。我很生气，问\n为什么。他说他拔不出来。他说感觉很好...",
      "title": "男人可以在射精前拔出来吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們是新婚夫婦，對性生活很興奮。我告訴我的丈夫，我現在正處於生育期\n我們需要一個避孕套。他說不用了，他會及時拔出來的。他並沒有及時拔出\n及時。他甚至沒有試圖拔出。我懷孕了。我很生氣，問\n爲什麼。他說他拔不出來。他說感覺很好...",
      "title": "男人可以在射精前拔出來嗎？"
    }
  ]
}