{
  "author": "Oh_umms_cocktails",
  "original_created_utc": 1655106335,
  "title": "Is it true that Ronald Reagan, while he was Governor of California, suddenly reversed course and supported gun control because the Black Panthers started arming themselves?",
  "created_utc": 1655128048,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve heard it several times on Reddit that Reagan was a staunch supporter of unregulated gun control until the Black Panthers started arming themselves and that at that point, Reagan pushed for stricter gun control laws. And furthermore that this was a result of his racist attitudes about Black Americans owning guns. Is this true?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 287,
  "permalink": "/r/AskHistorians/comments/vb6sf9/is_it_true_that_ronald_reagan_while_he_was/",
  "subreddit": "AskHistorians",
  "id": "vb6sf9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've heard it several times on Reddit that Reagan was a staunch supporter of\nunregulated gun control until the Black Panthers started arming themselves and\nthat at that point, Reagan pushed for stricter gun control laws. And furthermore\nthat this was a result of his racist attitudes about Black…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Redditで何度か聞いたことがあるのですが、レーガンは頑強な支持者で\nブラックパンサーが武装し始めるまでは無秩序な銃規制を支持していたそうです。\nその時点でレーガンはより厳しい銃規制法を推し進めたということです。そして、さらに\nこれは黒人に対する彼の人種差別的な態度の結果であると...",
      "title": "カリフォルニア州知事だったロナルド・レーガンが、ブラックパンサーが武装し始めたので、突然方針を転換して銃規制を支持したというのは本当でしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在Reddit上听说过几次，里根是一个坚定的支持者。\n直到 \"黑豹 \"组织开始武装自己，里根才坚定地支持不受管制的枪支控制。\n在那一刻，里根推动了更严格的枪支管制法律。此外\n这是他对黑人的种族主义态度的结果...。",
      "title": "罗纳德-里根在担任加州州长时，因为黑豹组织开始武装自己而突然扭转方向，支持枪支管制，这是真的吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在Reddit上聽說過幾次，里根是一個堅定的支持者。\n直到 \"黑豹 \"組織開始武裝自己，里根才堅定地支持不受管制的槍支控制。\n在那一刻，里根推動了更嚴格的槍支管制法律。此外\n這是他對黑人的種族主義態度的結果...。",
      "title": "羅納德-里根在擔任加州州長時，因爲黑豹組織開始武裝自己而突然扭轉方向，支持槍支管制，這是真的嗎？"
    }
  ]
}