{
  "author": "giggitygigittygoo",
  "original_created_utc": 1651924373,
  "title": "Why do westerners focus so much on “white colonialism” when every culture has been taking land from each other for centuries?",
  "created_utc": 1651932301,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It seems they all focus on how bad white people are and how these “colonizers” are evil for taking land from native Americans. But virtually every culture has done that to each other and everybody else has just left it as history and moved on.&lt;/p&gt;\n\n&lt;p&gt;Like even native Americans invaded each other for land. &lt;/p&gt;\n\n&lt;p&gt;Romans took over Jewish land. &lt;/p&gt;\n\n&lt;p&gt;Mongolians took over most of Asia. &lt;/p&gt;\n\n&lt;p&gt;Japan invaded China and killed millions. &lt;/p&gt;\n\n&lt;p&gt;Ancient Egyptians took over much of the sub Saharan Africa. &lt;/p&gt;\n\n&lt;p&gt;India used to contain other countries like Afghanistan, Nepal, etc. &lt;/p&gt;\n\n&lt;p&gt;I mean the list goes on and on and on. And yes MANY of them are no longer an issue but that can be said about western countries in the future. Every “empire” or super power will fall. Maybe next “white colonizer” will be china “Asian colonizers”&lt;/p&gt;\n\n&lt;p&gt;Like that’s just history and how times have always been. People fought over territories and resources. Many of them had BRUTAL histories and had slaves and killed thousands and thousands. &lt;/p&gt;\n\n&lt;p&gt;But why are people so focused on “white colonizers”?&lt;/p&gt;\n\n&lt;p&gt;Edit: for those of saying the system is still in place of people are still “feeing it”, it doesn’t change the fact that it’s history and we need to move on. You don’t think ALL of those ancient civilizations “felt it” or had those systems in place for centuries are being conquered? But now it’s just history. Nobody in China bitches about the mongols anymore. Hardly anyone even bitches about the Japanese invasion which happened less than 100 years ago.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 115,
  "permalink": "/r/TooAfraidToAsk/comments/ukbou3/why_do_westerners_focus_so_much_on_white/",
  "subreddit": "TooAfraidToAsk",
  "id": "ukbou3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "It seems they all focus on how bad white people are and how these “colonizers”\nare evil for taking land from native Americans. But virtually every culture has\ndone that to each other and everybody else has just left it as history and moved\non.\n\nLike even native Americans invaded each other for…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "白人がいかに悪いか、ネイティブ・アメリカンから土地を奪った「植民地支配者」がいかに悪であるかに焦点を合わせているようです。\n悪であることに焦点をあてているようです。しかし、事実上すべての文化は、お互いにそれを行ってきました。\nしてきたし、他の人々はそれを歴史として残し、前に進んできた。\nしてきました。\n\nネイティブ・アメリカンだって、お互いに侵略し合っていたわけだし......。",
      "title": "欧米人はなぜ「白人の植民地主義」にこだわるのでしょうか。どの文化も何世紀も前から互いに土地を奪い合ってきたのに。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "他们似乎都在关注白人有多坏，以及这些 \"殖民者 \"如何\n这些 \"殖民者 \"是邪恶的，因为他们从美国本土夺取了土地。但几乎每一种文化都有\n都对对方做了这样的事，而其他人只是把它当作历史，继续前进。\n矣。\n\n就像即使是美国本土的人也会互相入侵，因为...",
      "title": "为什么西方人如此关注 \"白人殖民主义\"，而几个世纪以来，每种文化都在相互夺取土地？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "他們似乎都在關注白人有多壞，以及這些 \"殖民者 \"如何\n這些 \"殖民者 \"是邪惡的，因爲他們從美國本土奪取了土地。但幾乎每一種文化都有\n都對對方做了這樣的事，而其他人只是把它當作歷史，繼續前進。\n矣。\n\n就像即使是美國本土的人也會互相入侵，因爲...",
      "title": "爲什麼西方人如此關注 \"白人殖民主義\"，而幾個世紀以來，每種文化都在相互奪取土地？"
    }
  ]
}