{
  "author": "Harold838383",
  "original_created_utc": 1633488598,
  "title": "Best coins for long term gain",
  "created_utc": 1633523721,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>What are your top picks to net you the most gains in the next 5-10 years? I’m not talking about a future project that hasn’t been invented yet, I am asking about current projects that you guys are most bullish on to increase in value the most. Personally the projects I’m most bullish on are constantly changing but the ones I currently believe show the most promise are as follows (in no particular order): -</p>\n\n<p>Bitcoin\nEthereum \nCardano\nTezos\nAlgorand\nHarmony one\nChainlink\nAmp\nVeChain\nAnd my pick outside the top 100 is LTO</p>\n\n<p>Keen to hear the thoughts of the community. My picks are mostly based on the opinions of others in this sub and the content that is shared here. Cheers</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/CryptoCurrency/comments/q2bjvh/best_coins_for_long_term_gain/",
  "subreddit": "CryptoCurrency",
  "id": "q2bjvh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "What are your top picks to net you the most gains in the next 5-10 years? I’m\nnot talking about a future project that hasn’t been invented yet, I am asking\nabout current projects that you guys are most bullish on to increase in value\nthe most. Personally the projects I’m most bullish on are…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今後5年から10年の間に最も利益を得ることができるトップピックは何ですか？私は\nまだ発明されていない未来のプロジェクトの話ではなく、皆さんが最も強気になっている現在のプロジェクトについて聞いているのです。\n現在のプロジェクトの中で、皆さんが最も価値が上がると確信しているものは何ですか？\nと聞いているのです。個人的に最も強気なプロジェクトは...。",
      "title": "長期的な利益を得るための最適なコイン"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在未来5-10年内，你有哪些首选的产品可以让你获得最大的收益？我\n我不是在谈论一个还没有被发明的未来项目，我是在问\n我问的是你们最看好的目前的项目，这些项目的价值会增加\n最多的项目。就我个人而言，我最看好的项目是...",
      "title": "长线收益的最佳钱币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在未來5-10年內，你有哪些首選的產品可以讓你獲得最大的收益？我\n我不是在談論一個還沒有被髮明的未來項目，我是在問\n我問的是你們最看好的目前的項目，這些項目的價值會增加\n最多的項目。就我個人而言，我最看好的項目是...",
      "title": "長線收益的最佳錢幣"
    }
  ]
}