{
  "author": "Teerdidkya",
  "original_created_utc": 1628088974,
  "title": "Was nationalism/patriotism really an idea that just... Appeared after the French Revolution?",
  "created_utc": 1628117628,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve heard often the notion that any sense of patriotism or what we would today call national pride is a relatively new thing.</p>\n\n<p>But hold on, ethnic labels still existed, didn&#39;t they? European kingdoms were still named after the ethnic groups or dominant tribe in them. And Saint Bede for example described the Angles, Jutes, and Saxons as &quot;English&quot;, using the term &quot;natio&quot; to describe them, while another monk, Gildas, wrote a diatribe against his fellow Britons as a people in the 6th century, and a writer by the name of Hector Boece wrote a historical account of Britain that was essentially Scottish propaganda in the 16th century.  Meanwhile in my country of Japan, the Sengoku warlords fought over &quot;uniting all under heaven&quot; (i.e. uniting Japan) all the way back in the, well, Sengoku period. Back in Europe, the Polish noble class used to claim that they were Turkic, and Italian city states also had some degree of democracy, so surely there must have been some kind of proto nationalism; and going further back, wasn&#39;t city pride extremely high in the Greek city states, and didn&#39;t the Ancient Romans have a strong culture of nationalism/Roman exceptionalism? What seems to be nationalistic rhetoric can be read in the Bible too, with the whole &quot;God&#39;s people&quot; and &quot;promised land&quot; thing. What&#39;s going on here? Hell, just before the French Revolution, the American Revolution happened, and nationalist sentiment abound in the years leading up to that one. Even ethnic stereotypes existed as far back as the middle ages at least, with things like French soldiers calling English soldiers &quot;Le Goddamns&quot;. It just doesn&#39;t add up.</p>\n\n<p>I know countries were just lands that a ruler happened to own or control for much of history, but was there really <em>nothing</em> resembling national pride or patriotism, no kind of sentimental value attached to the land and borders one lived in or one&#39;s ethnic in-group, at all, whatsoever, before the French Revolution? Or was it just that such ideas weren&#39;t <em>widespread</em> among the <em>general population</em>? I also think that belief in a certain line of rulers&#39; right to rule a certain people/land or personality cults around a ruler for example are a form of nationalism due to parallels in more modern history, so is it just that whatever existed before the Revolution doesn&#39;t fit a certain narrow definition of what patriotism/nationalism is that requires solid borders? And even if it did just sort of pop into existence during the Revolution, where did this new idealogy come from anyway? Surely it had to have come from somewhere.</p>\n\n<p>I asked the professor of a course I was taking one semester, and the response I got was &quot;it&#39;s complicated&quot;. So I&#39;m led to believe that there&#39;s more to this, and that the whole &quot;National pride is new&quot; thing is a great oversimplification, despite it often being used to contradict simplistic pop history.</p>\n</div><!-- SC_ON -->",
  "score": 126,
  "permalink": "/r/AskHistorians/comments/oxuepf/was_nationalismpatriotism_really_an_idea_that/",
  "subreddit": "AskHistorians",
  "id": "oxuepf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've heard often the notion that any sense of patriotism or what we would today\ncall national pride is a relatively new thing.\n\nBut hold on, ethnic labels still existed, didn't they? European kingdoms were\nstill named after the ethnic groups or dominant tribe in them. And Saint Bede\nfor example…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "よく耳にするのは、愛国心や今日でいうところのナショナリズムを感じさせるような考え方です。\n愛国心や民族の誇りというものは、比較的新しいものだという考え方をよく耳にします。\n\nしかし、ちょっと待ってください。民族的なレッテルはまだ存在していたのではないでしょうか。ヨーロッパの王国は\nヨーロッパの王国は、その中の民族や支配的な部族の名を冠していました。聖人ビーデも\n例えば...。",
      "title": "ナショナリズムや愛国心は、本当に... フランス革命の後に現れたものなのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我经常听到这样的观点：任何爱国主义意识或我们今天所说的\n称为民族自豪感是一个相对较新的东西。\n\n但是等一下，民族标签仍然存在，不是吗？欧洲的王国是\n仍然以其中的种族群体或主导部落命名。而圣贝德\n例如...",
      "title": "民族主义/爱国主义真的是一种思想吗，只是......。在法国大革命后出现的吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我經常聽到這樣的觀點：任何愛國主義意識或我們今天所說的\n稱爲民族自豪感是一個相對較新的東西。\n\n但是等一下，民族標籤仍然存在，不是嗎？歐洲的王國是\n仍然以其中的種族羣體或主導部落命名。而聖貝德\n例如...",
      "title": "民族主義/愛國主義真的是一種思想嗎，只是......。在法國大革命後出現的嗎？"
    }
  ]
}