{
  "author": "mapletrees1234",
  "the_new_excerpt": "I recently got into the market with this whole GME debacle (still ongoing?), but\nit has made me more interested in the market as a whole. I've spent most of the\npast two weeks reading about topics such as DD, some of the stocks that are\npopular here and on other investing-related subreddits, and the…",
  "original_created_utc": 1612693529,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我最近随着GME的这场风波入市（还在进行中？\n这让我对整个市场更加感兴趣。我已经花了大部分的时间\n在过去的两个星期里，读到的主题，如DD，一些股票，是一个很好的选择。\n在这里和其他投资相关的subreddits上很受欢迎，而...",
      "title": "你看到新手最常犯的错误是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近隨着GME的這場風波入市（還在進行中？\n這讓我對整個市場更加感興趣。我已經花了大部分的時間\n在過去的兩個星期裏，讀到的主題，如DD，一些股票，是一個很好的選擇。\n在這裏和其他投資相關的subreddits上很受歡迎，而...",
      "title": "你看到新手最常犯的錯誤是什麼？"
    }
  ],
  "title": "What are the most common mistakes you see newbies make?",
  "created_utc": 1612742001,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I recently got into the market with this whole GME debacle (still ongoing?), but it has made me more interested in the market as a whole. I&#39;ve spent most of the past two weeks reading about topics such as DD, some of the stocks that are popular here and on other investing-related subreddits, and the basics of options (CC, CSP, long calls/puts, wheel). At the same time, looking through a variety of stocks makes me feel like a lot of potential for putting some money into the market now and it feels like the majority of moves would be profitable. I recognize part of that is likely because of the current bull market. However, if you were to just stick with buying stable stocks (e.g. GOOG, AAPL) or even buying/selling options barely OTM with a decent expiration date, seems like you could make pretty easy money.</p>\n\n<p>I can foresee a couple of scenarios where there is potential for big losses:</p>\n\n<p>1) Market crashes. Certainly many posts saying we are due for a correction and we did have one in 3/2020.</p>\n\n<p>2) Meme stocks and buying in at the wrong time</p>\n\n<p>3) Options trades you don&#39;t understand</p>\n\n<p>4) Trying to make plays that are just too risky (0DTE, far OTM weeklys)</p>\n\n<p>Is it as simple as moderating risk and doing your research or are there other mistakes that you often see and I should be aware of?</p>\n</div><!-- SC_ON -->",
  "score": 57,
  "permalink": "/r/stocks/comments/lek0hf/what_are_the_most_common_mistakes_you_see_newbies/",
  "subreddit": "stocks",
  "id": "lek0hf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123203608
}