{
  "approved_at_utc": null,
  "subreddit": "investing",
  "selftext": "The next step for telecommunications around the world is 5G. In the US, the three largest providers in the field are Verizon, T-Mobile and AT&amp;T. The question here is can they offer us a good return on our investment? The obvious choice for industries like telecommunications are the biggest players in the country. Like I said, in the US those players are Verizon, T-Mobile and AT&amp;T so lets dig in and find out which one has the best bullish case.\n\n# Operations\n\nLets start with operations. The amount of wireless subscribers is probably the most important metric to look at because it gives us a good idea of whether the operations of the companies are actually expanding. Plus, it is the main and biggest source of revenue for all three of these companies. Verizon has the most subscribers, currently sitting at 121.3 million, followed by T-Mobile with 104.8 million and AT&amp;T with 97.8 million. Verizon acquired TracFone last year, which boosted their subscriber numbers, but apart from that there was no massive change in subscribers for any of the companies. Verizon has also recently broken the record for most awarded brand by JD Power for Wireless Network Quality with 27 consecutive number one awards. Good product quality is always important so that's a positive for Verizon in my books. Plus, they literally service 99% of the Fortune 500 companies and have partnerships with tech leaders like Amazon, Microsoft and Google. Right now, it seems like the main priority for all three companies is to improve their 5G network and capability. T-Mobile is the leader in 5G with best download speeds and highest coverage of 295 million having access to its 5G services, out of which 140 million people having access to its fastest service . AT&amp;T's fast 5G coverage is only half T-Mobile's and Verizon is lagging behind with only a quarter of the fast 5G coverage of T-Mobile although their total coverage is similar to T-Mobile's. However, AT&amp;T's 5G has a partnership with Microsoft Azure and Verizon's 5G has partnered with AWS. Such partnerships with major cloud providers are definitely a plus.\n\nVerizon had Verizon Media which comprised of brands like AOL and Yahoo, but Verizon sold its media assets to a private equity company called Apollo Global Management on the 1st of September. The media business was a relatively fast-growing part of Verizon so I'm personally not the biggest fan of that sale. Still, Verizon Media made up only 6.2% of Verizon's total revenue in Q2 so it is a fairly small segment, but it will affect Verizon's revenue and profit going forward. In comparison, AT&amp;T owns Warner Media so you can tell it is a much bigger chunk of its revenue at 21.2% in the third quarter of 2021. They own HBO and HBO Max which have seen an additional 12.5 million subscribers in the past year to a total of 69.4 million subscribers globally. Unfortunately, the gains there were offset by less cinema screenings over the past year although things are obviously picking back up again and we should see better results in the next quarters. Some more bad news, AT&amp;T will be spinning off Warner Media in mid-2022 so that means a big chunk of revenue will be lost next year! I think this will end up badly for AT&amp;T, especially since Warner Media is one of their more profitable segments! Putting that aside, other revenue sources include wireless equipment sales which make up 16.3% of Verizon's revenue, 12.7% of AT&amp;T's revenue and 23.8% of T-Mobile's revenue. Even though it's a big chunk of T-Mobile's revenue, the company actually saw a 5.9% decrease in wireless equipment sales while AT&amp;T saw an 11.4% increase and Verizon saw a massive 30% jump in equipment revenues, which is another plus for Verizon although the question here is whether they can actually keep that up.\n\n# Revenue and Earnings\n\nAlright, so we now have a good idea of what operations Verizon, AT&amp;T and T-Mobile have. What does their revenue and earnings look like though? AT&amp;T has the biggest revenue at $39.9 billion in Q3 of 2021, down 5.7% from last year. Their total revenue for the last 12 months stands at $173.6 billion, which is almost identical to the same period last year, meaning there was no growth. Verizon follows in second place with a $32.9 billion revenue in Q3 of 2021, up 4.3% from last year. Their total revenue for the last 12 months stands at $134.2 billion which is slightly up compared to the same period last year when they had a revenue of $128.4 billion. Finally, T-Mobile brought in a revenue of $19.6 billion in Q3 of 2021 compared to $19.3 billion last year. Last year, T-Mobile saw a massive jump in revenue which was mainly because of their merger with Sprint which closed on 1st April last year, but the growth since then has been much slower. For the last 12 months, T-Mobile's revenue was $79.7 billion up from $60 billion last year, but again that's because of the two companies merging. Overall, Verizon and AT&amp;T have seen a relatively small revenue growth over the last 5 years, less than 2% per year, and they only expect a 1% revenue increase next year. In comparison, T-Mobile's revenue has doubled since 2016, which is massive compared to Verizon and AT&amp;T, but again only a small revenue increase of under 3% is expected next year. What about their earnings though? Verizon have the best net margins at 16.4% which have doubled from an 8% in 2015. Plus, Verizon raised their EPS guidance for 2021 by almost 5%. AT&amp;T's normal margins sit at around 9% although they've had a 0.7% net margin in the past year which are due to write-offs and impairments surrounding their media business. Finally, T-Mobile have the lowest margins with 4.2% right now although their historical average is about 5 or 6%. T-Mobile also have a negative free cash flow unlike the other two, which is a bit concerning. It's not a one-off either as they haven't had a positive free cash flow since 2016! That is most likely due to their faster expansion because telecommunications is extremely capital-intensive, but it is still worrying to see that with T-Mobile. In 2022, AT&amp;T is expected to see a 4.4% drop in earnings while Verizon's earnings are expected to stay essentially flat with only a 0.3% earnings growth, but T-Mobile is looking at a 39.2% earnings growth although that follows after a drop of 32% in 2021. I personally don't think we will see such a big growth from T-Mobile and, to be fair, analysts have been reducing their expectations, too. There are just a lot of uncertainties in the market and the economy and a lot can change over the next year.\n\n# Financial Health\n\nWe can see that these companies are making a lot of cash, but how healthy are their financials? What does their debt look like? Well, surprisingly, AT&amp;T has the lowest debt-to-equity ratio with a 100%, followed by T-Mobile with 106% and finally Verizon with 191.8%! However, Verizon has the lowest effective interest rate with only 1.88% compared to 3.07% for T-Mobile and 3.31% for AT&amp;T. What that means is that even though Verizon has exactly twice the debt of AT&amp;T, their interest payments actually are not that much higher! Also, telecommunications is a very capital-intensive business so this type of debt levels are actually normal for the industry. None of the three companies has substantial cash and none of them can cover their current liabilities with their current assets. However, their quick ratios are just under 1 so the situation is not that bad.\n\n# Dividend\n\nBefore we move to the valuation, we need to look at the dividend. Telecom stocks are not typically fast growers so their dividend is important to investors. AT&amp;T has the highest dividend at 9.4%, but they are expected to cut it by almost half next year following the sale of Warner Media. Verizon follows with a 5.1% dividend while T-Mobile does not pay a dividend at all! Both AT&amp;T and Verizon pay a higher-than-average dividend. Both of them have increased their dividend every year over the last 10 years although Verizon is the company that can actually afford to pay it. Their payout ratio is 47% whereas AT&amp;T's one is massive, 1,578% although that's skewed due to the write-offs I mentioned earlier. Still, AT&amp;T has a historically higher payout ratio than Verizon so that's worth keeping in mind. Lets also take a look at share buybacks since they are another way of returning money to shareholders. Verizon and T-Mobile have not bought back any shares in the last 3 years, but AT&amp;T has actually reduced their number of outstanding shares by 2.5% since 2018.\n\n# Valuation\n\nOkay, we've covered the dividend so lets value the companies. Are they cheap right now? Looking at their current PE, we can see that Verizon is the cheapest with 9.5, followed by T-Mobile with 39.8 and AT&amp;T with 168.2. Obviously, the current PE can be misleading, but if we take a look at their forward PE, we see that AT&amp;T is the cheapest with only 7.3, followed by Verizon with 9.6 and T-Mobile with 32. In terms of the Price-to-earnings-growth ratio, T-Mobile is the cheapest with a 1.11, followed by Verizon with 2.9 and AT&amp;T with 9.6. Finally, AT&amp;T is the cheapest in terms of book value with a PB ratio of 1.04, T-Mobile follows with 2.07 and Verizon with 2.93.\n\n# Conclusion\n\nHow can we interpret all of this? Well, AT&amp;T seems to be the cheapest out of the three stocks right now, followed by Verizon. T-Mobile is massively overvalued right now, most likely by investors betting on T-Mobile dominating the 5G market. I honestly cannot see the bullish case for T-Mobile though. Even if they completely dominate the 5G market, they still have such low margins, negative free cash flow and a lot of costs related to capital expenditure. I just don't see them justifying this high price any time soon, definitely not in the next 2 or 3 years. Despite being cheap, AT&amp;T is also a no-go in my books. Why? Their main selling point is their dividend. AT&amp;T will be cutting this in half while also selling their high margin Warner Media subsidiary. Essentially, there is no point to hold them for the dividend and they will also lag behind in revenue and profits so there is no value play there either. It just seems like their best days are behind them. They currently trade for $22.2 which is half of their all-time high back in July 1999. 22 years ago! They have not been able to come close to that price and, in my opinion, they will not do that in the next 5 years. Definitely not worth the investment. You can just stick your money in an index fund and you will get much better returns without having to do more than 5 minutes of research. Plus, AT&amp;T's price is likely to drop further once the Warner Media sale is closed and their dividend drops. The only good purchase here is Verizon. They have a solid dividend, decent margins, they can provide stability during volatile markets. However, they are not expected to grow much. No growth typically equals no jump in price. We can value their free cash flow as much as we want, but if investors don't buy the stock, the price will lag behind the S&amp;P. Still, I think there is a case for Verizon if we see continued inflation or an increase in interest rates. As I said, Verizon's dividend is also solid, which is great for income portfolios or for balancing out your risk. However, if you are looking for price appreciation, a simple US index fund like SPY or VGT will probably outperform Verizon. There are some companies that can offer you a better return so check out my stock picks here if you are interested. Let me know what you think about Verizon, AT&amp;T and T-Mobile down below.\n\nP.S. This is one of the occasions where you spend a weekend researching companies only to come to the conclusion that S&amp;P500 probably offers better returns! I hope you find this useful though :)",
  "author_fullname": "t2_bo6czmb5",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "[Company Analysis] AT&amp;T vs Verizon vs T-Mobile: Are they worth the investment?",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/investing",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_ra8fiy",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.83,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 112,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 112,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1638800665,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.investing",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The next step for telecommunications around the world is 5G. In the US, the three largest providers in the field are Verizon, T-Mobile and AT&amp;amp;T. The question here is can they offer us a good return on our investment? The obvious choice for industries like telecommunications are the biggest players in the country. Like I said, in the US those players are Verizon, T-Mobile and AT&amp;amp;T so lets dig in and find out which one has the best bullish case.&lt;/p&gt;\n\n&lt;h1&gt;Operations&lt;/h1&gt;\n\n&lt;p&gt;Lets start with operations. The amount of wireless subscribers is probably the most important metric to look at because it gives us a good idea of whether the operations of the companies are actually expanding. Plus, it is the main and biggest source of revenue for all three of these companies. Verizon has the most subscribers, currently sitting at 121.3 million, followed by T-Mobile with 104.8 million and AT&amp;amp;T with 97.8 million. Verizon acquired TracFone last year, which boosted their subscriber numbers, but apart from that there was no massive change in subscribers for any of the companies. Verizon has also recently broken the record for most awarded brand by JD Power for Wireless Network Quality with 27 consecutive number one awards. Good product quality is always important so that&amp;#39;s a positive for Verizon in my books. Plus, they literally service 99% of the Fortune 500 companies and have partnerships with tech leaders like Amazon, Microsoft and Google. Right now, it seems like the main priority for all three companies is to improve their 5G network and capability. T-Mobile is the leader in 5G with best download speeds and highest coverage of 295 million having access to its 5G services, out of which 140 million people having access to its fastest service . AT&amp;amp;T&amp;#39;s fast 5G coverage is only half T-Mobile&amp;#39;s and Verizon is lagging behind with only a quarter of the fast 5G coverage of T-Mobile although their total coverage is similar to T-Mobile&amp;#39;s. However, AT&amp;amp;T&amp;#39;s 5G has a partnership with Microsoft Azure and Verizon&amp;#39;s 5G has partnered with AWS. Such partnerships with major cloud providers are definitely a plus.&lt;/p&gt;\n\n&lt;p&gt;Verizon had Verizon Media which comprised of brands like AOL and Yahoo, but Verizon sold its media assets to a private equity company called Apollo Global Management on the 1st of September. The media business was a relatively fast-growing part of Verizon so I&amp;#39;m personally not the biggest fan of that sale. Still, Verizon Media made up only 6.2% of Verizon&amp;#39;s total revenue in Q2 so it is a fairly small segment, but it will affect Verizon&amp;#39;s revenue and profit going forward. In comparison, AT&amp;amp;T owns Warner Media so you can tell it is a much bigger chunk of its revenue at 21.2% in the third quarter of 2021. They own HBO and HBO Max which have seen an additional 12.5 million subscribers in the past year to a total of 69.4 million subscribers globally. Unfortunately, the gains there were offset by less cinema screenings over the past year although things are obviously picking back up again and we should see better results in the next quarters. Some more bad news, AT&amp;amp;T will be spinning off Warner Media in mid-2022 so that means a big chunk of revenue will be lost next year! I think this will end up badly for AT&amp;amp;T, especially since Warner Media is one of their more profitable segments! Putting that aside, other revenue sources include wireless equipment sales which make up 16.3% of Verizon&amp;#39;s revenue, 12.7% of AT&amp;amp;T&amp;#39;s revenue and 23.8% of T-Mobile&amp;#39;s revenue. Even though it&amp;#39;s a big chunk of T-Mobile&amp;#39;s revenue, the company actually saw a 5.9% decrease in wireless equipment sales while AT&amp;amp;T saw an 11.4% increase and Verizon saw a massive 30% jump in equipment revenues, which is another plus for Verizon although the question here is whether they can actually keep that up.&lt;/p&gt;\n\n&lt;h1&gt;Revenue and Earnings&lt;/h1&gt;\n\n&lt;p&gt;Alright, so we now have a good idea of what operations Verizon, AT&amp;amp;T and T-Mobile have. What does their revenue and earnings look like though? AT&amp;amp;T has the biggest revenue at $39.9 billion in Q3 of 2021, down 5.7% from last year. Their total revenue for the last 12 months stands at $173.6 billion, which is almost identical to the same period last year, meaning there was no growth. Verizon follows in second place with a $32.9 billion revenue in Q3 of 2021, up 4.3% from last year. Their total revenue for the last 12 months stands at $134.2 billion which is slightly up compared to the same period last year when they had a revenue of $128.4 billion. Finally, T-Mobile brought in a revenue of $19.6 billion in Q3 of 2021 compared to $19.3 billion last year. Last year, T-Mobile saw a massive jump in revenue which was mainly because of their merger with Sprint which closed on 1st April last year, but the growth since then has been much slower. For the last 12 months, T-Mobile&amp;#39;s revenue was $79.7 billion up from $60 billion last year, but again that&amp;#39;s because of the two companies merging. Overall, Verizon and AT&amp;amp;T have seen a relatively small revenue growth over the last 5 years, less than 2% per year, and they only expect a 1% revenue increase next year. In comparison, T-Mobile&amp;#39;s revenue has doubled since 2016, which is massive compared to Verizon and AT&amp;amp;T, but again only a small revenue increase of under 3% is expected next year. What about their earnings though? Verizon have the best net margins at 16.4% which have doubled from an 8% in 2015. Plus, Verizon raised their EPS guidance for 2021 by almost 5%. AT&amp;amp;T&amp;#39;s normal margins sit at around 9% although they&amp;#39;ve had a 0.7% net margin in the past year which are due to write-offs and impairments surrounding their media business. Finally, T-Mobile have the lowest margins with 4.2% right now although their historical average is about 5 or 6%. T-Mobile also have a negative free cash flow unlike the other two, which is a bit concerning. It&amp;#39;s not a one-off either as they haven&amp;#39;t had a positive free cash flow since 2016! That is most likely due to their faster expansion because telecommunications is extremely capital-intensive, but it is still worrying to see that with T-Mobile. In 2022, AT&amp;amp;T is expected to see a 4.4% drop in earnings while Verizon&amp;#39;s earnings are expected to stay essentially flat with only a 0.3% earnings growth, but T-Mobile is looking at a 39.2% earnings growth although that follows after a drop of 32% in 2021. I personally don&amp;#39;t think we will see such a big growth from T-Mobile and, to be fair, analysts have been reducing their expectations, too. There are just a lot of uncertainties in the market and the economy and a lot can change over the next year.&lt;/p&gt;\n\n&lt;h1&gt;Financial Health&lt;/h1&gt;\n\n&lt;p&gt;We can see that these companies are making a lot of cash, but how healthy are their financials? What does their debt look like? Well, surprisingly, AT&amp;amp;T has the lowest debt-to-equity ratio with a 100%, followed by T-Mobile with 106% and finally Verizon with 191.8%! However, Verizon has the lowest effective interest rate with only 1.88% compared to 3.07% for T-Mobile and 3.31% for AT&amp;amp;T. What that means is that even though Verizon has exactly twice the debt of AT&amp;amp;T, their interest payments actually are not that much higher! Also, telecommunications is a very capital-intensive business so this type of debt levels are actually normal for the industry. None of the three companies has substantial cash and none of them can cover their current liabilities with their current assets. However, their quick ratios are just under 1 so the situation is not that bad.&lt;/p&gt;\n\n&lt;h1&gt;Dividend&lt;/h1&gt;\n\n&lt;p&gt;Before we move to the valuation, we need to look at the dividend. Telecom stocks are not typically fast growers so their dividend is important to investors. AT&amp;amp;T has the highest dividend at 9.4%, but they are expected to cut it by almost half next year following the sale of Warner Media. Verizon follows with a 5.1% dividend while T-Mobile does not pay a dividend at all! Both AT&amp;amp;T and Verizon pay a higher-than-average dividend. Both of them have increased their dividend every year over the last 10 years although Verizon is the company that can actually afford to pay it. Their payout ratio is 47% whereas AT&amp;amp;T&amp;#39;s one is massive, 1,578% although that&amp;#39;s skewed due to the write-offs I mentioned earlier. Still, AT&amp;amp;T has a historically higher payout ratio than Verizon so that&amp;#39;s worth keeping in mind. Lets also take a look at share buybacks since they are another way of returning money to shareholders. Verizon and T-Mobile have not bought back any shares in the last 3 years, but AT&amp;amp;T has actually reduced their number of outstanding shares by 2.5% since 2018.&lt;/p&gt;\n\n&lt;h1&gt;Valuation&lt;/h1&gt;\n\n&lt;p&gt;Okay, we&amp;#39;ve covered the dividend so lets value the companies. Are they cheap right now? Looking at their current PE, we can see that Verizon is the cheapest with 9.5, followed by T-Mobile with 39.8 and AT&amp;amp;T with 168.2. Obviously, the current PE can be misleading, but if we take a look at their forward PE, we see that AT&amp;amp;T is the cheapest with only 7.3, followed by Verizon with 9.6 and T-Mobile with 32. In terms of the Price-to-earnings-growth ratio, T-Mobile is the cheapest with a 1.11, followed by Verizon with 2.9 and AT&amp;amp;T with 9.6. Finally, AT&amp;amp;T is the cheapest in terms of book value with a PB ratio of 1.04, T-Mobile follows with 2.07 and Verizon with 2.93.&lt;/p&gt;\n\n&lt;h1&gt;Conclusion&lt;/h1&gt;\n\n&lt;p&gt;How can we interpret all of this? Well, AT&amp;amp;T seems to be the cheapest out of the three stocks right now, followed by Verizon. T-Mobile is massively overvalued right now, most likely by investors betting on T-Mobile dominating the 5G market. I honestly cannot see the bullish case for T-Mobile though. Even if they completely dominate the 5G market, they still have such low margins, negative free cash flow and a lot of costs related to capital expenditure. I just don&amp;#39;t see them justifying this high price any time soon, definitely not in the next 2 or 3 years. Despite being cheap, AT&amp;amp;T is also a no-go in my books. Why? Their main selling point is their dividend. AT&amp;amp;T will be cutting this in half while also selling their high margin Warner Media subsidiary. Essentially, there is no point to hold them for the dividend and they will also lag behind in revenue and profits so there is no value play there either. It just seems like their best days are behind them. They currently trade for $22.2 which is half of their all-time high back in July 1999. 22 years ago! They have not been able to come close to that price and, in my opinion, they will not do that in the next 5 years. Definitely not worth the investment. You can just stick your money in an index fund and you will get much better returns without having to do more than 5 minutes of research. Plus, AT&amp;amp;T&amp;#39;s price is likely to drop further once the Warner Media sale is closed and their dividend drops. The only good purchase here is Verizon. They have a solid dividend, decent margins, they can provide stability during volatile markets. However, they are not expected to grow much. No growth typically equals no jump in price. We can value their free cash flow as much as we want, but if investors don&amp;#39;t buy the stock, the price will lag behind the S&amp;amp;P. Still, I think there is a case for Verizon if we see continued inflation or an increase in interest rates. As I said, Verizon&amp;#39;s dividend is also solid, which is great for income portfolios or for balancing out your risk. However, if you are looking for price appreciation, a simple US index fund like SPY or VGT will probably outperform Verizon. There are some companies that can offer you a better return so check out my stock picks here if you are interested. Let me know what you think about Verizon, AT&amp;amp;T and T-Mobile down below.&lt;/p&gt;\n\n&lt;p&gt;P.S. This is one of the occasions where you spend a weekend researching companies only to come to the conclusion that S&amp;amp;P500 probably offers better returns! I hope you find this useful though :)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qhhq",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "ra8fiy",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "TheNewbieInvestor",
  "discussion_type": null,
  "num_comments": 8,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/investing/comments/ra8fiy/company_analysis_att_vs_verizon_vs_tmobile_are/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/investing/comments/ra8fiy/company_analysis_att_vs_verizon_vs_tmobile_are/",
  "subreddit_subscribers": 1960213,
  "created_utc": 1638817873,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1638800665,
  "the_new_excerpt": "The next step for telecommunications around the world is 5G. In the US, the\nthree largest providers in the field are Verizon, T-Mobile and AT&T. The\nquestion here is can they offer us a good return on our investment? The obvious\nchoice for industries like telecommunications are the biggest players…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "世界の通信の次のステップは5Gです。アメリカでは\nこの分野では、Verizon、T-Mobile、AT&Tの3大プロバイダーが存在します。その中で\nここで問題になるのは、彼らが私たちの投資に見合うだけのリターンを提供できるかということです。当然ながら\n通信のような業界では、最大手の企業が選ばれるのですが...。",
      "title": "[企業分析】AT&amp;T vs Verizon vs T-Mobile。投資の価値はあるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "世界各地电信的下一步是5G。在美国，该领域最大的三个供应商\n该领域最大的三个供应商是Verizon、T-Mobile和AT&T。现在的问题是\n这里的问题是他们能否为我们的投资提供良好的回报？很明显\n的选择是那些最大的公司...",
      "title": "[公司分析] AT&amp;T vs Verizon vs T-Mobile。它们值得投资吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "世界各地電信的下一步是5G。在美國，該領域最大的三個供應商\n該領域最大的三個供應商是Verizon、T-Mobile和AT&T。現在的問題是\n這裏的問題是他們能否爲我們的投資提供良好的回報？很明顯\n的選擇是那些最大的公司...",
      "title": "[公司分析] AT&amp;T vs Verizon vs T-Mobile。它們值得投資嗎？"
    }
  ],
  "source_updated_at": 1639129310847
}