{
  "author": "Western-Bite1759",
  "the_new_excerpt": "Hodl. DCA. These strategies always worked long term. So why the panic? BTC\nwasn't even above 10k a year ago and now we are crying because it's at 30k+.\n\nYou could sell at near all time highs for 3 months if you wanted to. What kind\nof bull run ends like this? You are all being played by the whales,…",
  "original_created_utc": 1621794276,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Hodl. DCAです。これらの戦略は常に長期的に機能していました。ではなぜパニックになったのか？BTC\nは1年前には10kを超えていませんでしたが、今は30k以上になって泣いています。\n\nその気になれば、3ヶ月間、史上最高値付近で売ることができます。どのような\nこんな風に終わってしまうブルランってあるのでしょうか？皆さんはクジラに踊らされているのではないでしょうか、、、。",
      "title": "このディップをベアマーケットと呼び続ければ、ベアマーケットになるでしょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "霍德尔 DCA。这些策略总是长期有效。那么，为什么会出现恐慌呢？BTC\n一年前甚至还没有超过10K，而现在我们却因为它在30K以上而哭泣。\n\n如果你愿意，你可以在接近历史高点的地方卖出3个月。什么样的\n的牛市运行就这样结束了？你们都被鲸鱼耍了，...",
      "title": "如果你继续称这次下跌为熊市，它将成为熊市。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "霍德爾 DCA。這些策略總是長期有效。那麼，爲什麼會出現恐慌呢？BTC\n一年前甚至還沒有超過10K，而現在我們卻因爲它在30K以上而哭泣。\n\n如果你願意，你可以在接近歷史高點的地方賣出3個月。什麼樣的\n的牛市運行就這樣結束了？你們都被鯨魚耍了，...",
      "title": "如果你繼續稱這次下跌爲熊市，它將成爲熊市。"
    }
  ],
  "title": "If you keep calling this dip a bear market, it will become one.",
  "created_utc": 1621855837,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hodl. DCA. These strategies always worked long term. So why the panic? BTC wasn&#39;t even above 10k a year ago and now we are crying because it&#39;s at 30k+. </p>\n\n<p>You could sell at near all time highs for 3 months if you wanted to. What kind of bull run ends like this? You are all being played by the whales, the media and the elites that want your bitcoin at a discount. </p>\n\n<p>The China FUD? We heard it before. Energy FUD? Check. Economists taking a crap on BTC? Always happened. </p>\n\n<p>If we keep panic selling, the bear market will happen. All of these predictions will just be self fulfilling prophecies.</p>\n</div><!-- SC_ON -->",
  "score": 180,
  "permalink": "/r/Bitcoin/comments/njdqcp/if_you_keep_calling_this_dip_a_bear_market_it/",
  "subreddit": "Bitcoin",
  "id": "njdqcp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197380039
}