{
  "author": "Faze-Cumshot",
  "original_created_utc": 1633644067,
  "title": "We're about to enter Alt season, be prepared and make sure to take some profits",
  "created_utc": 1633664146,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Most of the top 20-30 crypto coins look primed to rally soon, With Bitcoin rising to almost $55,500 yesterday and now stabilizing around mid $54k range. It&#39;s not early to say that the money will be flowing to alts, usually it flows to top caps. So if you&#39;re in these large and some mid cap coins, hold tight because things are about to get wild. BUT make sure you take some profits, now I know HODL is good because your coin may go up another 500% but try to take profits in stages. Securing profits is the best thing you can do to yourself in the alt season, at the same time letting the rest ride just in case things go wild. So sit tight and watch how things unfold in the next few weeks.</p>\n</div><!-- SC_ON -->",
  "score": 221,
  "permalink": "/r/CryptoCurrency/comments/q3jsar/were_about_to_enter_alt_season_be_prepared_and/",
  "subreddit": "CryptoCurrency",
  "id": "q3jsar",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Most of the top 20-30 crypto coins look primed to rally soon, With Bitcoin\nrising to almost $55,500 yesterday and now stabilizing around mid $54k range.\nIt's not early to say that the money will be flowing to alts, usually it flows\nto top caps. So if you're in these large and some mid cap coins,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "上位20～30位の暗号コインのほとんどは、近日中に上昇する可能性があると見られており、Bitcoin\nは昨日55,500ドル近くまで上昇し、現在は54,000ドル台半ばで安定しています。\n資金がアルトに流れると言うのは早計で、通常はトップキャップに流れる。\nトップキャップに流れるのが普通です。ですから、もしあなたがこれらの大規模なコインやいくつかの中規模なコインを持っているなら、...",
      "title": "これからAltの季節に入りますが、準備をして必ず利益を取るようにしましょう"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大多数前20-30名的加密货币看起来很快就会反弹。\n昨天升至近55,500美元，现在稳定在5.4万美元左右的范围。\n现在说资金将流向代理币还为时过早，通常情况下，资金会流向\n到顶层。因此，如果你在这些大盘和一些中盘币中，...",
      "title": "我们即将进入阿尔特季节，做好准备并确保获取一些利润"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大多數前20-30名的加密貨幣看起來很快就會反彈。\n昨天升至近55,500美元，現在穩定在5.4萬美元左右的範圍。\n現在說資金將流向代理幣還爲時過早，通常情況下，資金會流向\n到頂層。因此，如果你在這些大盤和一些中盤幣中，...",
      "title": "我們即將進入阿爾特季節，做好準備並確保獲取一些利潤"
    }
  ]
}