{
  "author": "Harsimaja",
  "original_created_utc": 1628959274,
  "title": "How common was ‘second sleep’ really in medieval Europe?",
  "created_utc": 1628982678,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A few years ago, A Roger Ekirch’s book ‘At Day’s Close: Night in Times Past’ popularised the idea that bimodal sleeping was the norm in medieval Europe, and this was repeated across much of the English-language press before becoming a popular ‘Did you know’-style tidbit. The idea is that rather than sleeping for around 8 hours straight, people back then would wake up for a couple of hours in between for various chores, prayer, sex, etc. Several references to ‘first sleep’ and ‘second sleep’ are given from medieval literature, and discussion with sleep scientists and anthropologists. </p>\n\n<p>How normal was this, and was it particular to certain times and places? Or was it a common pattern but a single ‘sleep’ was more usual? I have also come across claims that a lot of these references may have been misinterpreted. I’d be interested to know what that current conclusions in actual research might be.</p>\n</div><!-- SC_ON -->",
  "score": 110,
  "permalink": "/r/AskHistorians/comments/p4bewn/how_common_was_second_sleep_really_in_medieval/",
  "subreddit": "AskHistorians",
  "id": "p4bewn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "A few years ago, A Roger Ekirch’s book ‘At Day’s Close: Night in Times Past’\npopularised the idea that bimodal sleeping was the norm in medieval Europe, and\nthis was repeated across much of the English-language press before becoming a\npopular ‘Did you know’-style tidbit. The idea is that rather than…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "数年前、A・ロジャー・エキルヒ氏の著書『At Day's Close』が話題になった。過去の時代の夜\n中世ヨーロッパでは、二峰性の睡眠が普通だったという考えが広まりました。\nこれは多くの英字新聞に掲載され、「知ってましたか？\nこれは、英語の新聞の多くで繰り返され、「Did you know」のような人気のある豆知識となりました。考え方としては、むしろ...",
      "title": "中世のヨーロッパでは、「セカンドスリープ」は実際にどのくらい普及していたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "几年前，A Roger Ekirch的书《At Day's Close: 过去时代的夜晚\n使得 \"在中世纪的欧洲，双轨制睡眠是一种常态 \"的观点深入人心。\n这句话在许多英语媒体上被重复，然后成为一个流行的 \"你知道吗？\n在成为流行的 \"你知道吗 \"式的花边新闻之前。这个想法是，与其说...",
      "title": "在中世纪的欧洲，\"第二次睡眠 \"到底有多普遍？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "幾年前，A Roger Ekirch的書《At Day's Close: 過去時代的夜晚\n使得 \"在中世紀的歐洲，雙軌制睡眠是一種常態 \"的觀點深入人心。\n這句話在許多英語媒體上被重複，然後成爲一個流行的 \"你知道嗎？\n在成爲流行的 \"你知道嗎 \"式的花邊新聞之前。這個想法是，與其說...",
      "title": "在中世紀的歐洲，\"第二次睡眠 \"到底有多普遍？"
    }
  ]
}