{
  "author": "coopeygfvv",
  "original_created_utc": 1635956653,
  "title": "How would you prepare for a crypto winter?",
  "created_utc": 1635982248,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve only been in crypto since about April, luckily I didn’t have too much invest before the May crash or I probably wouldn’t be here now. </p>\n\n<p>I know that there’s many people in this sub that have been around crypto for awhile. So what would you recommend for someone like me or others to prepare for an 80% crash. </p>\n\n<p>I know that there’s no way of know when or if this will happen but I’ve also seen many people saying that this time will be different due to recent adoption of crypto. Do you think this cycle will be different than previous ones or will we see a similar results that we have seen in previous years?</p>\n</div><!-- SC_ON -->",
  "score": 210,
  "permalink": "/r/CryptoCurrency/comments/qly4u3/how_would_you_prepare_for_a_crypto_winter/",
  "subreddit": "CryptoCurrency",
  "id": "qly4u3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’ve only been in crypto since about April, luckily I didn’t have too much\ninvest before the May crash or I probably wouldn’t be here now.\n\nI know that there’s many people in this sub that have been around crypto for\nawhile. So what would you recommend for someone like me or others to prepare for\nan…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は4月頃から暗号化を始めたばかりですが、幸運にも5月の暴落前にあまり多くの投資をしていませんでした。\n5月の暴落の前にあまり投資していなかったので、今ここにいないかもしれません。\n\nこのサブには長い間暗号に関わってきた人がたくさんいますね。\nいます。私のような人や他の人が暗号化のために準備するには、何をお勧めしますか？\nan...",
      "title": "暗号の冬にはどのような準備が必要ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我大约从4月份才开始接触加密货币，幸运的是我在5月份的大跌之前没有太多投资。\n投资，否则我现在可能就不会在这里了。\n\n我知道，在这个子里有很多人已经在加密货币周围呆了很久了。\n一段时间了。那么，你对像我这样的人或其他人有什么建议，以准备\n我的建议",
      "title": "你将如何准备迎接加密货币的冬天？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我大約從4月份纔開始接觸加密貨幣，幸運的是我在5月份的大跌之前沒有太多投資。\n投資，否則我現在可能就不會在這裏了。\n\n我知道，在這個子裏有很多人已經在加密貨幣周圍呆了很久了。\n一段時間了。那麼，你對像我這樣的人或其他人有什麼建議，以準備\n我的建議",
      "title": "你將如何準備迎接加密貨幣的冬天？"
    }
  ]
}