{
  "author": "GroundbreakingLack78",
  "original_created_utc": 1635760750,
  "title": "Its better to ask the “dumb” questions and learn something, than to stay being ignorant. Everyone has to start somewhere.",
  "created_utc": 1635788155,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For some of you, it can be seen as common sense. But so far from what we can see, that SQUID, the biggest Ponzi rugpull crypto ever created yet just burned millions of people , it doesn’t look like people in this space understand basic fundamentals of crypto. </p>\n\n<p>We’ve just witnessed it, the lack of education.</p>\n\n<p>And it just happened, the coin went from $2800 to $0.002 in a blink of an eye. I’m really sorry that millions of people just lost their life savings, investments. I know I shouldn’t care too much about the others, but seeing newbies getting burned, not educating themselves enough, not asking “dumb” questions really triggers me.</p>\n\n<p>Everyone has to start somewhere, so measure twice, cut once. Especially in crypto, where you should measure at least 100 times and then cut. </p>\n\n<p>Peace, may your losses from this rugpull shitcoin rest in peace.</p>\n</div><!-- SC_ON -->",
  "score": 155,
  "permalink": "/r/CryptoCurrency/comments/qkamt1/its_better_to_ask_the_dumb_questions_and_learn/",
  "subreddit": "CryptoCurrency",
  "id": "qkamt1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "For some of you, it can be seen as common sense. But so far from what we can\nsee, that SQUID, the biggest Ponzi rugpull crypto ever created yet just burned\nmillions of people , it doesn’t look like people in this space understand basic\nfundamentals of crypto.\n\nWe’ve just witnessed it, the lack of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "一部の方にとっては、常識と捉えられることもあるでしょう。しかし、これまでのところ、私たちが見る限り\n史上最大のポンジー・ラグプル・クリプトであるSQUIDが、何百万人もの人々を焼いてしまったのだ。\n数百万人を焼いたSQUIDを見る限り、この業界の人々が暗号の基本を理解しているとは思えません。\nこの業界の人々は、暗号の基本を理解していないようです。\n\n私たちはそれを目の当たりにしてきましたが、その欠如は...",
      "title": "無知なままでいるよりも、「くだらない」質問をして何かを学んだ方がいい。誰もがどこかで始めなければならないのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对你们中的一些人来说，这可以被看作是常识。但到目前为止，从我们所看到的\n看，SQUID是有史以来最大的庞氏骗局加密货币，但刚刚烧毁了\n数百万人，看起来这个领域的人并不了解基本的\n基本的加密货币的基本原理。\n\n我们刚刚见证了这一点，缺乏...",
      "title": "问一些 \"愚蠢 \"的问题并学到一些东西，总比保持无知要好。每个人都必须从某个地方开始。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對你們中的一些人來說，這可以被看作是常識。但到目前爲止，從我們所看到的\n看，SQUID是有史以來最大的龐氏騙局加密貨幣，但剛剛燒燬了\n數百萬人，看起來這個領域的人並不瞭解基本的\n基本的加密貨幣的基本原理。\n\n我們剛剛見證了這一點，缺乏...",
      "title": "問一些 \"愚蠢 \"的問題並學到一些東西，總比保持無知要好。每個人都必須從某個地方開始。"
    }
  ]
}