{
  "author": "jbrandyman",
  "the_new_excerpt": "Right now, meme coins are the hottest stuff, coins based on all sorts of\ndifferent animals (usually in Japanese and usually canine), planets (most\ncommonly moon and mars), and named after wealthy individuals (Mainly Elon and\nSnoop because canine) are popping up hoping to catch the meme…",
  "original_created_utc": 1620143947,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今、最もホットなのはミームコインで、様々な動物（通常は日本語で、通常は犬）をモチーフにしたコインです。\n様々な動物（通常は日本語で、主にイヌ）、惑星（主に月と火星）、富豪の名前（主にイーロンや\n月や火星）をモチーフにしたコインや、富豪の名前を冠したコイン（主にイーロンと\nスヌープはイヌだから）をモチーフにしたコインが続々と登場しています。",
      "title": "感情的になっている人は、「強気の市場では誰もが天才だが、潮が引いて初めて誰が裸で泳いでいたのかが分かる」ということを思い出してください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "现在，纪念币是最热门的东西，以各种不同的动物（通常是日语）、行星（大多数是狗）为基础的硬币。\n不同的动物（通常是日语，通常是犬类），行星（最常见的是月球和火星），以及以富人的名字命名的硬币（主要是埃隆和卡梅伦\n最常见的是月球和火星），以及以富人的名字命名（主要是埃隆和\nSnoop，因为是犬类）的名字命名的硬币层出不穷，希望能抓住人们的回忆...",
      "title": "如果你情绪激动，请记住，在牛市中每个人都是天才，但只有当潮水退去时，你才能发现谁在裸泳。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "現在，紀念幣是最熱門的東西，以各種不同的動物（通常是日語）、行星（大多數是狗）爲基礎的硬幣。\n不同的動物（通常是日語，通常是犬類），行星（最常見的是月球和火星），以及以富人的名字命名的硬幣（主要是埃隆和卡梅倫\n最常見的是月球和火星），以及以富人的名字命名（主要是埃隆和\nSnoop，因爲是犬類）的名字命名的硬幣層出不窮，希望能抓住人們的回憶...",
      "title": "如果你情緒激動，請記住，在牛市中每個人都是天才，但只有當潮水退去時，你才能發現誰在裸泳。"
    }
  ],
  "title": "If you are getting emotional, remember that everyone is a genius in a bull market, but only when the tide recedes do you find out who was swimming naked.",
  "created_utc": 1620156977,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Right now, meme coins are the hottest stuff, coins based on all sorts of different animals (usually in Japanese and usually canine), planets (most commonly moon and mars), and named after wealthy individuals (Mainly Elon and Snoop because canine) are popping up hoping to catch the meme trend.</p>\n\n<p>&#x200B;</p>\n\n<p>It&#39;s understandable, all it takes is Cntrl + C, Cntrl + V some code, make memes and suddenly you have 500% of the money you had, and if you just keep making memes surely everything will be fine right?</p>\n\n<p>&#x200B;</p>\n\n<p>And if it goes from 0.00000001 to $1 you are now a billionaire, all easy everything great! But take a look at the coinmarketcap history.</p>\n\n<p>&#x200B;</p>\n\n<p>Many coins can easily 10x in a day, or a week, or a month during the bull market. However, not many are still around today.</p>\n\n<p>&#x200B;</p>\n\n<p>The only indicator of how well you did in this bull market is how much you have left during the bear market. Comparing earnings in a bull market is pointless because any alt can moon at any point for basically any reason.</p>\n\n<p>&#x200B;</p>\n\n<p>So stay calm, buy whatever makes you feel good, if you want quick profits, chase alts, if you like slow growth follow the top coins with a use case. Store of Value right now is BTC, ETH handles smart contract, BNB is the biggest centralized exchange coin, and UNI is the current top decentralized exchange coin.</p>\n\n<p>&#x200B;</p>\n\n<p>Smaller coins that compete with those are also available, BCH, ETC, CRO, CAKE/SUSHI etc. but they usually get counted under alt coins.</p>\n\n<p>&#x200B;</p>\n\n<p>Just remember to take money off the table so you don&#39;t get rekt during a sudden drop, which bitcoin is famous for doing.</p>\n\n<p>&#x200B;</p>\n\n<p>Hope everyone comes out wealthier than before!</p>\n</div><!-- SC_ON -->",
  "score": 1222,
  "permalink": "/r/CryptoCurrency/comments/n4rv8j/if_you_are_getting_emotional_remember_that/",
  "subreddit": "CryptoCurrency",
  "id": "n4rv8j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380964323
}