{
  "author": "ProductOfUK",
  "original_created_utc": 1649072656,
  "title": "What led the Welsh &amp; English to unite against the Vikings in Powys at the Battle of Buttington?",
  "created_utc": 1649081032,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello! As the title asks, I wish to know what led to an Anglo-Welsh alliance (Mercia, Wessex &amp;amp; The Cymru proper, I believe) against the Vikings. &lt;/p&gt;\n\n&lt;p&gt;Weren&amp;#39;t the Welsh &amp;amp; Anglo-Saxon factions historically hostile with one another also, or did the presence of the Vikings strike both groups as utterly intolerable relative to the dubious cohabitation that the Welsh &amp;amp; Anglo-Saxons had achieved?&lt;/p&gt;\n\n&lt;p&gt;Finally, I wonder what the political, cultural &amp;amp;/or religious reasons were for this Britannic Alliance against the Norsemen in Britain. &lt;/p&gt;\n\n&lt;p&gt;Thank you!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 108,
  "permalink": "/r/AskHistorians/comments/tvzz6i/what_led_the_welsh_english_to_unite_against_the/",
  "subreddit": "AskHistorians",
  "id": "tvzz6i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hello! As the title asks, I wish to know what led to an Anglo-Welsh alliance\n(Mercia, Wessex & The Cymru proper, I believe) against the Vikings.\n\nWeren't the Welsh & Anglo-Saxon factions historically hostile with one another\nalso, or did the presence of the Vikings strike both groups as…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは。タイトルの通り、アングロ・ウエルシュ同盟のきっかけを知りたいのです。\n(メルキア、ウェセックス、サイマル)がヴァイキングに対抗したのです。\n\nウェールズとアングロサクソンは歴史的に敵対していたのでは？\nそれとも、ヴァイキングの存在が両グループに影響を与えたのか...。",
      "title": "ポーイスで行われたバティントンの戦いで、ウェールズ人とイングランド人がヴァイキングに対して団結した理由は何だったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好! 正如标题所要求的，我想知道是什么导致了英国-威尔士人的联盟\n(我认为是梅西亚、威塞克斯和锡姆鲁本土)对抗维京人。\n\n威尔士和盎格鲁-撒克逊两派在历史上不是相互敌对的吗？\n还是说维京人的出现让这两个群体都觉得......",
      "title": "是什么导致威尔士人和英国人在布廷顿之战中联合起来对抗维京人？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好! 正如標題所要求的，我想知道是什麼導致了英國-威爾士人的聯盟\n(我認爲是梅西亞、威塞克斯和錫姆魯本土)對抗維京人。\n\n威爾士和盎格魯-撒克遜兩派在歷史上不是相互敵對的嗎？\n還是說維京人的出現讓這兩個羣體都覺得......",
      "title": "是什麼導致威爾士人和英國人在布廷頓之戰中聯合起來對抗維京人？"
    }
  ]
}