{
  "author": "FunkyPlaid",
  "the_new_excerpt": "Hi folks, I’m Dr Darren Scott Layne (he/him) and I’m an historian of\neighteenth-century Scotland with a specialist focus on late-era Jacobitism\n(1740-1759). I’ll be hanging around this thread 3-7pm UKT (10am-2pm ET/7am-11am\nPT) to answer your questions. Ask me anything!\n\nMuch of my work centres on…",
  "original_created_utc": 1610895386,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "大家好，我是达伦-斯科特-雷恩博士（他/他），我是一个历史学家。\n十八世纪苏格兰，专攻晚期的雅各布主义。\n(1740-1759). 我会在英国时间下午3-7点（美国东部时间上午10点-下午2点/7点-11点）挂在这个线上。\nPT）来回答你的问题。什么都可以问我！我的工作主要集中在...\n\n我的大部分工作都集中在...",
      "title": "AMA：雅各宾主义、反雅各宾主义和1745年的雅各宾派起义。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好，我是達倫-斯科特-雷恩博士（他/他），我是一個歷史學家。\n十八世紀蘇格蘭，專攻晚期的雅各布主義。\n(1740-1759). 我會在英國時間下午3-7點（美國東部時間上午10點-下午2點/7點-11點）掛在這個線上。\nPT）來回答你的問題。什麼都可以問我！我的工作主要集中在...\n\n我的大部分工作都集中在...",
      "title": "AMA：雅各賓主義、反雅各賓主義和1745年的雅各賓派起義。"
    }
  ],
  "title": "AMA: Jacobitism, Anti-Jacobitism, and the Jacobite Rising of 1745",
  "created_utc": 1610917192,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi folks, I’m Dr Darren Scott Layne (he/him) and I’m an historian of eighteenth-century Scotland with a specialist focus on late-era Jacobitism (1740-1759). I’ll be hanging around this thread 3-7pm UKT (10am-2pm ET/7am-11am PT) to answer your questions. Ask me anything!</p>\n\n<p>Much of my work centres on the Jacobite Rising of 1745-6 and I’m keenly interested in the mutable nature of the ideologies of ‘the cause’ and how the movement was expressed through its plebeian adherents, as well as the policies and prosecution against them. I received a BA from UC Berkeley, my MSc from the University of Edinburgh, and my doctorate from the University of St Andrews. I’ve been studying Jacobitism through its historiography and archival sources for over twenty years, and my pursuits have taken me to many incredible places both urban and rural. Through the years I’ve spent an inordinate amount of time at the <a href=\"https://www.nts.org.uk/visit/places/culloden\">Culloden Battlefield and Visitor Centre</a>, where I have undertaken conservation work, presented numerous lectures, and provided historical consultancy for the <a href=\"https://www.nts.org.uk/\">National Trust for Scotland</a>.</p>\n\n<p>My lifelong research project is the <a href=\"https://jdb1745.net/\">Jacobite Database of 1745</a>, a constantly developing prosopographical repository that seeks to collate as much information as we can find about the people who were involved in the last rising, regardless of what that involvement was. The idea here is to provide both public and professional scholars with a single tool to conduct their research across as many archival and printed sources as possible, which in turn stimulates engagement with libraries, archives, and private collections around the world. The platform is currently being stocked with over 30,000 records to start and, with proper funding, we hope to roll out a public alpha for trial soon afterward.</p>\n\n<p>The project’s research blog can be found over at <a href=\"https://jdb1745.net/littlerebellions/\">Little Rebellions</a>, which contains bite-sized case studies from the database, methodological and technical musings, and plenty more from news about the state of Jacobite studies to listicles of must-read books and little-known sources connected to Jacobitism.</p>\n\n<p>I presently have a regular column in <a href=\"https://www.historyscotland.com/\"><em>History Scotland</em></a> magazine called <em>Spotlight: Jacobites</em>, and I’m co-editing a collected volume on the differing cultures of Scottish Jacobitism, hopefully due out in 2023. I also serve on the council for the <a href=\"http://eshss.org.uk/\">Economic and Social History Society of Scotland</a> as its Digital Officer. I currenly reside in Portland, OR where I volunteer as a docent and educator for the <a href=\"https://www.ohs.org/\">Oregon Historical Society</a>’s outstanding museum in my spare time. My wife is a librarian and we have two cats who don’t do a thing to help me with research.</p>\n\n<p>I’m a passionate advocate of the digital humanities, data and metadata organization, and accessible research. I strongly support <a href=\"https://www.insidehighered.com/news/2019/02/20/author-discusses-new-book-how-promote-generous-thinking-higher-education\">generous thinking</a>, collegiality, and collaboration within the realms of both academia and public history. And I also love lots of other historical subjects, including WWII, Vast Early America, and the Italian Renaissance.</p>\n\n<p>Online I can be found haunting the virtual corridors of Twitter (<a href=\"https://twitter.com/FunkyPlaid\">personal</a> and <a href=\"https://twitter.com/jdb1745\">project</a>), and JDB1745 has <a href=\"https://www.facebook.com/jdb1745\">a page</a> over on Facebook, too.</p>\n\n<p>Today is the 275th anniversary of the 2nd Battle of Falkirk, the largest single battle of the Forty-five campaign. I’m excited to get to your questions and will be around for a few hours after the designated block of time to do some following up with you!</p>\n\n<p>**************</p>\n\n<p><strong>EDIT #1:</strong> <em>We&#39;re 3.5 hours in and some really fantastic questions have been posed so far. I&#39;m wading in and trying to get to each and every one, so please bear with me over the next few hours! I&#39;ll be around well after our block of time expires, so please check back if you don&#39;t hear from me immediately. Thanks!</em></p>\n\n<p><strong>EDIT #2:</strong> <em>Coming up on 5 hours now and doing my very best to catch up with you. I have every intention of answering all of your questions but would like to shore up any new ones by 2pm PT/5pm ET/10pm UKT. It might take me a day or two to get to some of these that require a bit more attention, but I promise to respond ASAP!</em></p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/kz7s88/ama_jacobitism_antijacobitism_and_the_jacobite/",
  "subreddit": "AskHistorians",
  "id": "kz7s88",
  "is_self": true,
  "media": null,
  "is_video": false
}