{
  "author": "ColossusOfChoads",
  "original_created_utc": 1630749903,
  "title": "I recently saw the classic film 'Casablanca' for the first time: was the portrayal of Sam considered progressive at the time, or was it just more of the same?",
  "created_utc": 1630779995,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Since I wasn&#39;t around in 1942, I don&#39;t know how the character of Sam would have come off relative to what was typical of African American portrayals at the time.</p>\n\n<p>On the one hand, he was second fiddle to Bogey and highly loyal, but he wasn&#39;t subservient, and often spoke up if the situation was dire (like when he dragged him onto the train as they were escaping Paris).  He was more of a &#39;right hand man&#39; or a &#39;sidekick&#39; as opposed to a servant.  <del>Marlene Dietrich&#39;s</del> Ingrid Bergman&#39;s (whoops!) character referred to him as &quot;the boy over there&quot; when she first walked in to that gin joint (out of all the other ones in the world), but then she greeted him like a dear old friend and then very nicely pleaded with him to play &#39;As Time Goes By&#39; while he made it clear he&#39;d rather not.</p>\n\n<p>There were a few other things that were a little cringey by modern standards, such as the lyrics of one of his songs referring to his hair and eyes, or the way he walked on the train platform in Paris.</p>\n\n<p>How was his portrayal received at the time, and how has it been criticized in hindsight?</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/AskHistorians/comments/photfj/i_recently_saw_the_classic_film_casablanca_for/",
  "subreddit": "AskHistorians",
  "id": "photfj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Since I wasn't around in 1942, I don't know how the character of Sam would have\ncome off relative to what was typical of African American portrayals at the\ntime.\n\nOn the one hand, he was second fiddle to Bogey and highly loyal, but he wasn't\nsubservient, and often spoke up if the situation was dire…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は1942年にはいなかったので、当時のアフリカ系アメリカ人の典型的な描写と比較して、サムのキャラクターがどのように映っていたかはわかりません。\n当時のアフリカ系アメリカ人の典型的な描写と比較して、サムのキャラクターがどのように映ったかはわかりません。\n当時のアフリカ系アメリカ人の典型的な描写と比べて、サムのキャラクターがどのように映っていたかはわかりません。\n\n一方で、彼はボギーの二枚目で、非常に忠誠心が強いのですが、従属的ではありませんでした。\nしかし、従属的ではなく、悲惨な状況ではよく発言していました...。",
      "title": "最近、名作映画「カサブランカ」を初めて見たのですが、サムの描写は当時としては先進的なものだったのでしょうか、それとも同じようなものだったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "由于我在1942年不在身边，我不知道山姆这个角色会如何\n相对于当时典型的非裔美国人的形象，我不知道萨姆这个角色会如何出现。\n当时的典型形象。\n\n一方面，他是鲍基的二把手，非常忠诚，但他并不顺从。\n但他并不顺从，而且如果情况危急，他经常大声说话......",
      "title": "我最近第一次看了经典电影《卡萨布兰卡》：在当时，山姆的形象被认为是进步的，还是只是更多的相同？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "由於我在1942年不在身邊，我不知道山姆這個角色會如何\n相對於當時典型的非裔美國人的形象，我不知道薩姆這個角色會如何出現。\n當時的典型形象。\n\n一方面，他是鮑基的二把手，非常忠誠，但他並不順從。\n但他並不順從，而且如果情況危急，他經常大聲說話......",
      "title": "我最近第一次看了經典電影《卡薩布蘭卡》：在當時，山姆的形象被認爲是進步的，還是隻是更多的相同？"
    }
  ]
}