{
  "author": "nickoskal024",
  "original_created_utc": 1629375450,
  "title": "Why are metals such good heat conductors?",
  "created_utc": 1629391094,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My poor physics knowledge tells me that metals being good <em>electrical</em> conductors make sense. In high school we were taught that metals create lattices, in which the electrons are more or less free to move around and create a current (things like carbon also create lattices eg. diamonds but those are not conductive because the electron valence shells are very stable with 4 bonds). Same idea for why some metals can be magnetized, or why they glow when heated.. but why are they such good conductors of <em>heat</em>? If heat is measured as the &#39;jiggling&#39; of atoms, then why should a solid piece of metal lattice conduct much heat at all?</p>\n</div><!-- SC_ON -->",
  "score": 112,
  "permalink": "/r/askscience/comments/p7doit/why_are_metals_such_good_heat_conductors/",
  "subreddit": "askscience",
  "id": "p7doit",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My poor physics knowledge tells me that metals being good electrical conductors\nmake sense. In high school we were taught that metals create lattices, in which\nthe electrons are more or less free to move around and create a current (things\nlike carbon also create lattices eg. diamonds but those are…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の貧弱な物理学の知識では、金属が良い電気伝導体であることは\n意味があります。高校では、金属は格子を作っていて、その中では電子が多かれ少なかれ自由に動き回り、電流を生み出すと教わりました。\n電子は多かれ少なかれ自由に動き回り、電流を発生させます。\n炭素のようなものもダイヤモンドのように格子を作りますが、それは...",
      "title": "金属はなぜ熱伝導率が高いのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我可怜的物理学知识告诉我，金属是良好的电导体\n是有道理的。在高中时，我们被告知，金属会形成晶格，其中\n电子或多或少可以自由移动，并产生电流（事情是这样的\n像碳也会形成格子，例如钻石，但那些是......",
      "title": "为什么金属是如此好的热导体？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我可憐的物理學知識告訴我，金屬是良好的電導體\n是有道理的。在高中時，我們被告知，金屬會形成晶格，其中\n電子或多或少可以自由移動，併產生電流（事情是這樣的\n像碳也會形成格子，例如鑽石，但那些是......",
      "title": "爲什麼金屬是如此好的熱導體？"
    }
  ]
}