{
  "author": "OptionsSG",
  "the_new_excerpt": "Hey all, I’m doing a series where I breakdown and simplify popular option\nstrategies while trying to be as concise yet comprehensive as possible. For\ntoday, we’ll be breaking down the Long Straddle Option Strategy as it has come\nto my attention that TSLA has been edging closer to a point where this…",
  "original_created_utc": 1621423692,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、このシリーズでは、人気のあるオプション戦略を分解・単純化しながら\nこのシリーズでは、人気のあるオプション戦略を分解・簡略化し、できるだけ簡潔かつ包括的に説明することを目指しています。今日は\n今日は、ロングストラドルオプション戦略を紹介します。\nTSLAは、私の注意を引くために、これは、ポイントに近づいている...",
      "title": "ロングストラドルを初心者向けに解説 TSLAの現状に魅力的な戦略を"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好，我正在做一个系列，对流行的期权进行分解和简化。\n策略，同时尽量做到简明而全面。对于\n今天，我们将分解多头跨式期权策略，因为我注意到，TSLA已经接近这个点。\n我注意到，TSLA已经逐渐接近一个点，在这个点上，它的价格已经达到了1美元。",
      "title": "为初学者解释的多头跨期交易。对TSLA的现状有吸引力的策略"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好，我正在做一個系列，對流行的期權進行分解和簡化。\n策略，同時儘量做到簡明而全面。對於\n今天，我們將分解多頭跨式期權策略，因爲我注意到，TSLA已經接近這個點。\n我注意到，TSLA已經逐漸接近一個點，在這個點上，它的價格已經達到了1美元。",
      "title": "爲初學者解釋的多頭跨期交易。對TSLA的現狀有吸引力的策略"
    }
  ],
  "title": "The Long Straddle Explained for beginners. An appealing strategy to the current state of TSLA",
  "created_utc": 1621429076,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey all, I’m doing a series where I breakdown and simplify popular option strategies while trying to be as concise yet comprehensive as possible. For today, we’ll be breaking down the Long Straddle Option Strategy as it has come to my attention that TSLA has been edging closer to a point where this strategy could seem increasingly favourable for those highly uncertain of its directionality. I will be covering the basics of the long straddle strategy and hence this is in NO WAY any form of investment advice to tell you to trade Tesla or to advise you to use any strategy on any underlying whatsoever. </p>\n\n<p>A long straddle is a directionally unbiased option strategy that involves the purchase of a Call option and a Put option of the same strike price. A long straddle is often set up when a trader speculates that the stock will move in a volatile manner but is uncertain as to which direction the underlying may break out from. Hence a trader would set up a straddle to be able to profit if the underlying breaks out in either direction. However if the stock remains stagnant at expiration, the trader will lose money. <a href=\"https://optionliteracy.com/?page_id=518#longstraddlediagram\">Long straddle trade diagram</a></p>\n\n<p>Long straddles are typically set up At The Money(ATM), which means buying a call and put that have the same strike price as where the stock would be trading at open of the trade. Take a look below as to how a long straddle is constructed. Stock EEE is trading at $200 at open of the trade.</p>\n\n<ul>\n<li>March 16/21 Long 200 put- $5.00</li>\n<li>March 16/21 Long 200 call- $5.00</li>\n</ul>\n\n<p><strong>Max loss</strong> </p>\n\n<p>A straddle’s max loss is the price paid for the put + the price paid for the call. This is called the total debit paid. In this example since we paid $5 for the call and $5 for the put, our total debit paid =$10/1000 which represents the maximum amount we can lose from this trade. Max loss is realised if the stock stays right at the strike price of both options at expiration as both options will expire worthless due to the fact that they will carry no intrinsic value being ATM and no extrinsic value left at expiration. </p>\n\n<p><strong>Profit</strong> </p>\n\n<p>A trader profits from a long straddle when the stock breakouts of a range that is determined by the total debit they pay. To find this range, add the total debit paid to the call options strike price and subtract the total debit paid to the put options strike price. In this example since the total debit paid =$10, by adding $10 to the 200 call and subtracting $10 from the 200 put, the range that the stock needs to breakout from in-order for a trader to profit is 190-210 at expiration. The further the stock breaks out of this range whether to the upside or to the downside, the greater the profits. To visualise this, take a look at the prices of the options at expiration after the stock had broken out of this range.</p>\n\n<p><strong>AT EXPIRATION on Feb 16 2021 the stock is trading at 220</strong></p>\n\n<ul>\n<li>March 16/21 Long 200 put- $0.00</li>\n<li>March 16/21 Long 200 call- $20.00</li>\n</ul>\n\n<p>The total debit of the straddle is now at $20. This is because as the stock moved to 220, the 200 call had gained $20 of intrinsic value by expiration. Meanwhile, the 200 put is trading for $0 because it has no intrinsic value and no extrinsic value at expiration. Since you bought the call option at $5 and sell it at $20, you make $15. Now Accounting for the put option, since you bought the put option at $5 and is now worthless at expiration, you lose $5. \n \nAs you made $15 on the call and lost $5 on the put, your total P/L is = $10/$1000. The greater the stock moves out of the range, the greater the profit.</p>\n\n<p><strong>Breakeven</strong> </p>\n\n<p>The 2 breakeven points are at the exact range points of the range. In this example, 190 and 210 are the range points. For example, this is because at 190 at expiration, the 200 put will trade for $10 and the 200 call will trade for $0. As you sell the put for a $5 profit and lose the $5 paid for the long call that expires worthless, you breakeven on the trade.</p>\n\n<p><strong>Loss (different from max loss)</strong></p>\n\n<p>At expiration, If the stock trades between the ranges but not at either breakeven points nor the strike prices, (190.01-199.99) &amp;(200.01-209.99), you will lose money on the trade (losses that are smaller than max loss)The further the stock ends up away from the strike price, the lesser the loss.</p>\n\n<p><strong>Implied Volatility (Vega)</strong>: A rise in Implied Volatility will also be profitable for a Long straddle even if there are no movements in the underlying. This is because this strategy is solely comprised of long options and thus has a positive exposure to vega. </p>\n\n<p><strong>Time Decay (Theta)</strong>: The passage of time is inherently a disadvantage for the Long straddle strategy. As this strategy is comprised of solely long options, time decay will be even more rampant than a single leg long option. This is the reason as to why you will need the underlying to move to greater extents so as to offset theta decay</p>\n\n<p><strong>Exercise and assignment</strong> </p>\n\n<p>Options are rarely recommended to be be held through expiration. However it is important to understand what happens if they do. Should the underlying trade at the straddles strike price at expiration, both options will expire worthless. If one of the options are ITM and held through expiration, exercise and assignment will take place. Only 1 of the 2 options of this strategy can be ITM at expiration. </p>\n\n<p><strong>LONG STRADDLE TRADE PROFILE</strong>\nMax profit: Undefined/unlimited \nMax loss: Defined/limited\nOptimal in low IV Environments</p>\n</div><!-- SC_ON -->",
  "score": 55,
  "permalink": "/r/investing/comments/ng39jw/the_long_straddle_explained_for_beginners_an/",
  "subreddit": "investing",
  "id": "ng39jw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590803275
}