{
  "author": "JSFlaye",
  "the_new_excerpt": "For example, we don't refer to Tatanka Iyotake by his name, but by a rough\ntranslation of it 'Sitting Bull'.\n\nWe don't call Leonards 'Lionheart', no one translates Samuel into 'God is\nlistening', and we don't listen to music by Sacred Rock (Craig David).\n\nSimilarly, Arabic, Chinese, Japanese names,…",
  "original_created_utc": 1617022993,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "比如说，我们不称呼塔坦卡-伊约特克的名字，而是粗略地称呼他的名字。\n翻译成'坐牛'。\n\n我们不称李奥纳兹为'狮心'，没有人把撒母耳译成'上帝是'。\n听'，我们不听神圣摇滚（Craig David）的音乐。\n\n同样，阿拉伯文、中文、日文的名字、...",
      "title": "为什么我们把美国土著人的名字翻译成英文，但似乎没有其他文化的名字？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "比如說，我們不稱呼塔坦卡-伊約特克的名字，而是粗略地稱呼他的名字。\n翻譯成'坐牛'。\n\n我們不稱李奧納茲爲'獅心'，沒有人把撒母耳譯成'上帝是'。\n聽'，我們不聽神聖搖滾（Craig David）的音樂。\n\n同樣，阿拉伯文、中文、日文的名字、...",
      "title": "爲什麼我們把美國土著人的名字翻譯成英文，但似乎沒有其他文化的名字？"
    }
  ],
  "title": "Why do we translate Native American names into English, but seemingly no other culture's names?",
  "created_utc": 1617027033,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For example, we don&#39;t refer to Tatanka Iyotake by his name, but by a rough translation of it &#39;Sitting Bull&#39;.</p>\n\n<p>We don&#39;t call Leonards &#39;Lionheart&#39;, no one translates Samuel into &#39;God is listening&#39;, and we don&#39;t listen to music by Sacred Rock (Craig David).</p>\n\n<p>Similarly, Arabic, Chinese, Japanese names, we don&#39;t translate, but leave in their native language.</p>\n\n<p>Any time there is a translation, it feels like a very deliberate, often politically charged move, the only example coming to my mind at this point is Battenberg to Mountbatten, with the obvious connotations of English royalty desiring a fully English name (Though Batten is still left untranslated. I&#39;m unsure but I think it means &#39;Helpful&#39;, they didn&#39;t go all the way and become the Mounthelpful family).</p>\n\n<p>So, why Sitting Bull instead of Tatanka Iyotake? Why Crazy Horse instead of Tasunke Witko? Why Little Turtle instead of Mihsihkinaahkwa? When a Japanese name, I would leave as, Eg, Okada Kazuchika, and not translate as Peaceful Reality of the Rice Paddy Ridge. You can&#39;t say the American names simply look strange and alien because that&#39;s true of any name of any naming convention that you aren&#39;t a part of. Bojana is a girl&#39;s name most people aren&#39;t familiar with, but you wouldn&#39;t translate it, and besides, you wouldn&#39;t translate Rebecca, though I am just as ignorant of the meaning of Rebecca as I am of Bojana. I wouldn&#39;t translate either, the idea of doing so would be very strange, but we all do this with Native American names. Why?</p>\n\n<p>I would assume the answer may be as simple as a lack of family names, but mononymity isn&#39;t unique to American cultures I don&#39;t think? Besides I&#39;ve never seen anyone refer to the famous Greek philosopher Best Purpose, who was a student of Broad Shoulders (Aristotle and Plato).</p>\n</div><!-- SC_ON -->",
  "score": 274,
  "permalink": "/r/AskHistorians/comments/mfp3z0/why_do_we_translate_native_american_names_into/",
  "subreddit": "AskHistorians",
  "id": "mfp3z0",
  "is_self": true,
  "media": null,
  "is_video": false
}