{
  "author": "louisab21",
  "the_new_excerpt": "I recently bought a house and this is how it went - I had to put my down payment\nof $85k into a 0.1% interest bearing savings account for two months because the\nlenders need to see evidence of where the money is coming from and where it has\nbeen for the past two months for some reason. (It’s been in…",
  "original_created_utc": 1615471707,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我最近买了一套房子，事情是这样的--我不得不把我的首期款\n8.5万元存入0.1%的有息储蓄账户两个月，因为。\n贷款人需要看到证据，证明资金的来源和去向。\n在过去的两个月里，由于某些原因，一直在。(它一直在...",
      "title": "比特币没有使用权"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近買了一套房子，事情是這樣的--我不得不把我的首期款\n8.5萬元存入0.1%的有息儲蓄賬戶兩個月，因爲。\n貸款人需要看到證據，證明資金的來源和去向。\n在過去的兩個月裏，由於某些原因，一直在。(它一直在...",
      "title": "比特幣沒有使用權"
    }
  ],
  "title": "BitCoIn HaS nO uSe CaSe",
  "created_utc": 1615524338,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I recently bought a house and this is how it went - I had to put my down payment of $85k into a 0.1% interest bearing savings account for two months because the lenders need to see evidence of where the money is coming from and where it has  been for the past two months for some reason.  (It’s been in a bitcoin wallet is not good enough). The day before the closing I had to drive 20’minutes one way to my bank branch and wire the money to the title company.  I missed the 4 pm cut off so the money didn’t transfer until the next morning at 9 am.  </p>\n\n<p>Bitcoin was $35k when I put that money in my bank account - it was $48k when I closed on the house.  I lost out on $30k in gains I could have had if I’d been able to store it on the bitcoin blockchain instead.   I spent an hour of my life driving and at the bank to do the wire transfer on a hectic day.  </p>\n\n<p>Alternatively transferring bitcoin to the title company from my wallet would have taken me 5 secs from home and they’d have had it in an hour.  </p>\n\n<p>I hate that society is so resistant to doing things a clearly easier and better way.</p>\n</div><!-- SC_ON -->",
  "score": 174,
  "permalink": "/r/Bitcoin/comments/m2qu7n/bitcoin_has_no_use_case/",
  "subreddit": "Bitcoin",
  "id": "m2qu7n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147373526
}