{
  "author": "DaddySkates",
  "original_created_utc": 1639727836,
  "title": "Want to know the ultimate power move of telling your family you are in crypto?",
  "created_utc": 1639751632,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Theres a lot of “should I discuss crypto with family?” or “siblings think Im stupid for investing in crypto” kinda posts.&lt;/p&gt;\n\n&lt;p&gt;Let me tell you the most ultimate power move you can do.\nShut your mouth about crypto. Dont tell a living soul about it. Well, technically we know but we are nobodies.&lt;/p&gt;\n\n&lt;p&gt;Wait a few years and on your next family dinner, just casually drive that Lambo down the driveway like nothing happened.\nAnd when asked “where dis you get the money for all this”, you answer them and feed upon the tears of jealousy.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 180,
  "permalink": "/r/CryptoCurrency/comments/ricgvp/want_to_know_the_ultimate_power_move_of_telling/",
  "subreddit": "CryptoCurrency",
  "id": "ricgvp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Theres a lot of “should I discuss crypto with family?” or “siblings think Im\nstupid for investing in crypto” kinda posts.\n\nLet me tell you the most ultimate power move you can do. Shut your mouth about\ncrypto. Dont tell a living soul about it. Well, technically we know but we are\nnobodies.\n\nWait a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "家族で暗号について話し合うべきか」「兄弟にImと思われる」。\n暗号に投資するのはバカだ」的な投稿がありました。\n\nあなたができる最も究極の力技をお教えしましょう。暗号について口を閉ざす\n暗号。生きとし生けるものにこのことを伝えてはいけません。まあ、技術的には知っているのですが、私たちは\n無名\n\n待てよ...",
      "title": "暗号をやっていることを家族に伝えるという究極の力技を知りたいですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有很多 \"我应该和家人讨论加密货币吗？\"或 \"兄弟姐妹认为我投资加密货币很愚蠢 \"的帖子。\n我应该和家人讨论加密货币吗？\"或 \"兄弟姐妹认为我投资加密货币是愚蠢的 \"之类的帖子。\n\n让我告诉你，你可以做的最终极的权力行动。闭上你的嘴\n低碳货币。不要告诉任何一个活人。好吧，技术上我们知道，但我们是\n无名小卒。\n\n等一下...",
      "title": "想知道告诉你的家人你从事加密货币的终极权力动作吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有很多 \"我應該和家人討論加密貨幣嗎？\"或 \"兄弟姐妹認爲我投資加密貨幣很愚蠢 \"的帖子。\n我應該和家人討論加密貨幣嗎？\"或 \"兄弟姐妹認爲我投資加密貨幣是愚蠢的 \"之類的帖子。\n\n讓我告訴你，你可以做的最終極的權力行動。閉上你的嘴\n低碳貨幣。不要告訴任何一個活人。好吧，技術上我們知道，但我們是\n無名小卒。\n\n等一下...",
      "title": "想知道告訴你的家人你從事加密貨幣的終極權力動作嗎？"
    }
  ]
}