{
  "author": "phantomimp",
  "original_created_utc": 1642597477,
  "title": "Why do people think that the ban of mining will have any significant impact on the fight against global warming?",
  "created_utc": 1642660737,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Yes it us true that mining crypto consumes a lot of energy, but so do other applications and services. Social media platforms and streaming services run on huge server networks that consume way more energy than the crypto mining farms. Yet crypto gets all the hate? \nIt&amp;#39;s especially stupid because banning the mining of crypto won&amp;#39;t have any impact on the environment at all because people with mining rigs won&amp;#39;t just pull the plug on them and call it a day. No, they will repurpose them for other uses like cloud computing, neural network training or even (cloud)gaming.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 303,
  "permalink": "/r/CryptoCurrency/comments/s7ppjp/why_do_people_think_that_the_ban_of_mining_will/",
  "subreddit": "CryptoCurrency",
  "id": "s7ppjp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Yes it us true that mining crypto consumes a lot of energy, but so do other\napplications and services. Social media platforms and streaming services run on\nhuge server networks that consume way more energy than the crypto mining farms.\nYet crypto gets all the hate? It's especially stupid because…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号の採掘が大量のエネルギーを消費するのは事実ですが、他の採掘も同じです。\nアプリケーションやサービス ソーシャルメディアプラットフォームやストリーミングサービスは\n巨大なサーバーネットワークは、暗号の採掘場よりもずっと多くのエネルギーを消費しています。\nそれでも暗号は嫌われるのか？それは、特に愚かなことだ...",
      "title": "なぜ、採掘禁止が地球温暖化対策に大きな影響を与えると考えられているのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "是的，开采加密货币确实消耗了大量的能源，但其他应用和服务也是如此。\n应用和服务。社交媒体平台和流媒体服务运行在\n巨大的服务器网络上运行，其消耗的能源远远超过加密货币采矿场。\n然而加密货币得到了所有的仇恨？这特别愚蠢，因为...",
      "title": "为什么人们认为禁止采矿会对抗击全球变暖产生任何重大影响？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "是的，開採加密貨幣確實消耗了大量的能源，但其他應用和服務也是如此。\n應用和服務。社交媒體平臺和流媒體服務運行在\n巨大的服務器網絡上運行，其消耗的能源遠遠超過加密貨幣採礦場。\n然而加密貨幣得到了所有的仇恨？這特別愚蠢，因爲...",
      "title": "爲什麼人們認爲禁止採礦會對抗擊全球變暖產生任何重大影響？"
    }
  ]
}