{
  "author": "BromarNL",
  "original_created_utc": 1640069113,
  "title": "The Crypto Market will most likely not recover until the start of next year: Two reasons why",
  "created_utc": 1640086294,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;Introduction&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;These past two months many investors have been shocked by the slow bleed of the crypto market. Many cryptos have lost substantial amounts of their value, and attempts for recovering the prices have failed. The result is a tug of war between bulls-bears in which bears are currently winning.&lt;/p&gt;\n\n&lt;p&gt;While this sounds easily understandable it&amp;#39;s actually not. Many crypto influencers made crazy claims for EOY, but they didn&amp;#39;t do this for no reason:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Q4 is generally bullish in terms of price action&lt;/li&gt;\n&lt;li&gt;BTC Hashrate after China mining ban experienced a strong recover with new all time high&lt;/li&gt;\n&lt;li&gt;Record low amount of BTC in exchanges&lt;/li&gt;\n&lt;li&gt;The successful implementation of the BTC Taproot update.&lt;/li&gt;\n&lt;li&gt;continuous buying pressure from Whales (as seen on bitinfocharts) and institutional investors for the whole crypto market&lt;/li&gt;\n&lt;li&gt;Increasing % of Long term holders while the prices are slowly bleeding&lt;/li&gt;\n&lt;li&gt;Crypto being recognized more and more by the general public&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;While it&amp;#39;s never easy to explain price-action (and actually not super relevant either), I was interested to understand what caused this unusual slow bleed without blow-off top.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Reason 1:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;While China has tried to stop crypto several times in the past, this year seems to be a permanent ban (most likely due to the creation of their CBDC). This has caused two drops this year, however these dips recovered.&lt;/p&gt;\n\n&lt;p&gt;But, some sources state that China has started to put more pressure on their crypto ban. Chinese citizens have received a deadline this year to get rid of their crypto, otherwise there will be repercussions.&lt;/p&gt;\n\n&lt;p&gt;To make this story short: The popular exchange Huobi Exchange with many Asian users is showing a reversal in available BTC on their exchange compared to other exchanged like Binance/Kraken/Coinbase etc. This trend is expected to at least continue into 2022:&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/r5r4h8apdu681.png?width=1064&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=0e56af5feaef12ee40ff844e908e4cb8b3e0a315\"&gt;Source: Glassnode&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Crypto decreasing from exchanges means two things: Either being sold or taken off exchanges to be put in personal wallets. The latter is bullish but the first is not. While Western exchanges also show a downtrend for Exchange balances, their decrease is not as steep as the Huobi Exchange is showing.&lt;/p&gt;\n\n&lt;p&gt;This strongly indicates that most of their users are actually selling.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Reason 2:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;The second reason is related to mostly institutional investors making use of a taxing loophole in the IRS regulations. This loophole has been detected already by regulations, but will be allowed for this last year. Some of you might know this already; Wash sales&lt;/p&gt;\n\n&lt;p&gt;Instead of explaining this issue, I can better explain the concept with this picture:&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/zrwqnrqsdu681.png?width=1472&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=078b8a16d94b91770d2f8ddf5d1473a12bc9b628\"&gt;Source: https://cryptotrader.tax/blog/cryptocurrency-tax-loss-harvesting&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;You might wonder: &lt;em&gt;But if wash sales were always allowed for crypto, why have previous crypto market Q4 years actually shown many gains, like last year?&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Answer: Institutional investing in the crypto market was not really present in the previous years. Yes some companies like Microstrategy have actually started earlier in the past (and probably applied Wash Sales), but they were not with enough back then. This year has shown a massive increase of institutional investing and therefore allows much more crypto capital to be sold in November/December for wash sales.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Bonus reason:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;This year saw an unusual amount of new crypto investors in exchanges by new (and young) investors. Many were influenced by Social Media and believed the (experienced) analysts with their EOY predictions. These new investors are not able to cope with this unusual price action and are easily scared. This caused them to sell (as seen in Glassnode data on their website - about short-term investors) in this market and therefore putting more pressure for a reversal&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TLDR:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;The Crypto market is bleeding because of China ban having a &amp;#39;deadline&amp;#39; for this year to sell crypto. Huobi Exchange (and a few others) show this.&lt;/li&gt;\n&lt;li&gt;Institutional investors have increased this year, this causes more effect of wash sales because they own more capital than in previous years.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;What does this mean? --&amp;gt; Retail is selling while whales are slowly adding the China sells and short-holders Western crypto to their wallets. This causes a slow bleed in the market because dips are actually being bought but not strong enough to break through the downtrend.&lt;/p&gt;\n\n&lt;p&gt;If you are debating to sell/not I suggest holding for one more month (no financial advice). This is because of the reasons stated above, and ~8B options ending this month which causes volatility.&lt;/p&gt;\n\n&lt;p&gt;EDIT: Typos&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 180,
  "permalink": "/r/CryptoCurrency/comments/rl8inp/the_crypto_market_will_most_likely_not_recover/",
  "subreddit": "CryptoCurrency",
  "id": "rl8inp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Introduction\n\nThese past two months many investors have been shocked by the slow bleed of the\ncrypto market. Many cryptos have lost substantial amounts of their value, and\nattempts for recovering the prices have failed. The result is a tug of war\nbetween bulls-bears in which bears are currently…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "はじめに\n\nこの2ヶ月間、多くの投資家は緩やかな出血にショックを受けています。\n暗号化市場 多くの暗号がその価値を大きく失い、そして\n価格回復の試みは失敗している。その結果、綱引きの様相を呈している。\n強気と弱気の間で、現在、弱気が...",
      "title": "Crypto Marketは、来年の初めまで回復しない可能性が高いです。その2つの理由"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "简介\n\n在过去的两个月里，许多投资者都被加密货币市场的缓慢失血所震惊。\n加密货币市场。许多加密货币已经失去了大量的价值，并且\n试图恢复价格的努力已经失败。其结果是一场拉锯战\n牛熊之间的拉锯战，其中熊市目前正在...",
      "title": "加密货币市场很可能要到明年年初才会恢复。两个原因"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "簡介\n\n在過去的兩個月裏，許多投資者都被加密貨幣市場的緩慢失血所震驚。\n加密貨幣市場。許多加密貨幣已經失去了大量的價值，並且\n試圖恢復價格的努力已經失敗。其結果是一場拉鋸戰\n牛熊之間的拉鋸戰，其中熊市目前正在...",
      "title": "加密貨幣市場很可能要到明年年初纔會恢復。兩個原因"
    }
  ]
}