{
  "author": "ToAsTyBoI-_-",
  "the_new_excerpt": "So not going into all the details but my mom used to hold me down and basically\ndo a cavity search if she thought I took money from her or something, and then\nsay “stop yelling it’s not like anyone would want to touch you there.”\n\nSo flash forward from that. My ex boyfriend was always trying to do…",
  "original_created_utc": 1622441358,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "詳細は省きますが、私の母は私を押さえつけて基本的には\nお金を盗んだと思われると、私を押さえつけて虫歯の検査をしました。\n叫ぶのはやめなさい、誰もあなたに触ろうとは思わないわよ」と言っていました。\n\nそこから話は変わります。私の元カレは、いつも...",
      "title": "母に身体検査をされたことによる性的トラウマがあるのでは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以，我不打算谈所有的细节，但我的母亲曾经把我按住，基本上是做空腔搜索，如果她认为我从她那里拿了钱或什么东西。\n如果她认为我从她那里拿了钱或其他东西，就会对我进行搜身，然后说\n然后说：\"别嚷嚷了，又没有人想碰你那里。\"\n\n因此，从那以后就开始了。我的前男友总是试图做...",
      "title": "我是否会因为我妈妈对我进行脱衣搜查而受到性创伤？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以，我不打算談所有的細節，但我的母親曾經把我按住，基本上是做空腔搜索，如果她認爲我從她那裏拿了錢或什麼東西。\n如果她認爲我從她那裏拿了錢或其他東西，就會對我進行搜身，然後說\n然後說：\"別嚷嚷了，又沒有人想碰你那裏。\"\n\n因此，從那以後就開始了。我的前男友總是試圖做...",
      "title": "我是否會因爲我媽媽對我進行脫衣搜查而受到性創傷？"
    }
  ],
  "title": "Could I have sexual trauma from my mom strip searching me?",
  "created_utc": 1622454105,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So not going into all the details but my mom used to hold me down and basically do a cavity search if she thought I took money from her or something, and then say “stop yelling it’s not like anyone would want to touch you there.”</p>\n\n<p>So flash forward from that. My ex boyfriend was always trying to do stuff with me, and whenever we almost did something sexual, even as small as taking my shirt off, I’d have small panic attacks and sometimes start crying. He was a major dick about it but what I’m asking is could I be uncomfortable being touched sexually because of my mom?</p>\n\n<p>Edit: for more context the stuff with my mom was happening when I was 13-14 and over lapping with when I was with me ex, 14-15. I’m 16 now</p>\n\n<p>Second edit: is it also possible my younger brother could have trauma later on because of this? Because she would do this in front of him when he was 5-6. Could he even remember that as a teenager or adult?</p>\n</div><!-- SC_ON -->",
  "score": 383,
  "permalink": "/r/TooAfraidToAsk/comments/nowb22/could_i_have_sexual_trauma_from_my_mom_strip/",
  "subreddit": "TooAfraidToAsk",
  "id": "nowb22",
  "is_self": true,
  "media": null,
  "is_video": false
}