{
  "author": "Additional-Apple-492",
  "original_created_utc": 1655375431,
  "title": "The bottom will be in when the stock market bottoms",
  "created_utc": 1655405428,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I see people making all these claims based on past cycles and weekly moving averages.  No.  Bitcoin follows the Nasdaq and alts follow bitcoin.   Worst stock market bear cycles lasted 2-3 years.  We’re about 6 months into this current one.  Coming off the biggest bull run in history, dealing with a war, pandemic, supply chain issues, quantitative tightening, rapid inflation, e.t.c.   &lt;/p&gt;\n\n&lt;p&gt;I can’t provide you a price target or a date, but I can say that things looks like they can get a lot worse before better.   Stock market will need for inflation to peak and rate hikes to be cut before we bottom.  Whenever that might be.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 330,
  "permalink": "/r/CryptoCurrency/comments/vdiv79/the_bottom_will_be_in_when_the_stock_market/",
  "subreddit": "CryptoCurrency",
  "id": "vdiv79",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I see people making all these claims based on past cycles and weekly moving\naverages. No. Bitcoin follows the Nasdaq and alts follow bitcoin. Worst stock\nmarket bear cycles lasted 2-3 years. We’re about 6 months into this current one.\nComing off the biggest bull run in history, dealing with a war,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "過去のサイクルや週足での動きをもとに、いろいろな主張をしている人を見かけますが\n主張する人がいます。いいえ、ビットコインはナスダックに追随し、アルトはビットコインに追随します。最悪な株式\n株式市場の弱気サイクルは2-3年続きました。私たちは今、このサイクルに6ヶ月ほど入っています。\n歴史上最大の強気相場から脱し、戦争に対処し、...",
      "title": "株式市場が底を打ったときが底値となる"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我看到人们根据过去的周期和每周的移动平均线提出了所有这些主张。\n平均数。不，比特币跟随纳斯达克指数，资产跟随比特币。最糟糕的股票\n市场熊市周期持续了2-3年。我们在目前这个周期中大约有6个月。\n刚从历史上最大的牛市运行中走出来，正在处理一场战争，...",
      "title": "股市见底时就会见底"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到人們根據過去的週期和每週的移動平均線提出了所有這些主張。\n平均數。不，比特幣跟隨納斯達克指數，資產跟隨比特幣。最糟糕的股票\n市場熊市週期持續了2-3年。我們在目前這個週期中大約有6個月。\n剛從歷史上最大的牛市運行中走出來，正在處理一場戰爭，...",
      "title": "股市見底時就會見底"
    }
  ]
}