{
  "author": "roberthonker",
  "original_created_utc": 1635972869,
  "title": "The bull run is about to heat up. Selling late in the bull run is your best option, despite what this sub will tell you.",
  "created_utc": 1635979086,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I know, I know, selling is against the rules of this sub. But this is truly the best thing that you can do for your portfolio.</p>\n\n<p><strong>Every Single Bull run</strong> has ended with a catastrophic -90% bear market. I don’t think this one is going to be any different. </p>\n\n<p>I predict that this bull run will really start heating up soon. We will see a 120k BTC and a 10k ETH minimum. Then things will enter the mania phase. Shitcoins with literally no purpose will start pumping thousands of percents all day long.</p>\n\n<p>Then, the inevitable crash will come. Your best option is to get out before this happens, no matter what the majority of this sub tell you. This sub has historically given horrible advice.</p>\n\n<p>Make a plan people. Get all your ducks in a row because the bull market is about to heat up and you don’t want to be left holding a bag for 3 years.</p>\n</div><!-- SC_ON -->",
  "score": 895,
  "permalink": "/r/CryptoCurrency/comments/qm403f/the_bull_run_is_about_to_heat_up_selling_late_in/",
  "subreddit": "CryptoCurrency",
  "id": "qm403f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I know, I know, selling is against the rules of this sub. But this is truly the\nbest thing that you can do for your portfolio.\n\nEvery Single Bull run has ended with a catastrophic -90% bear market. I don’t\nthink this one is going to be any different.\n\nI predict that this bull run will really start…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "分かっている、分かっている、売ることはこのサブのルールに反する。しかし、これは本当に\n自分のポートフォリオのためにできる最高のことなのです。\n\nすべての強気の動きは、壊滅的な-90％の弱気市場で終わっています。私は今回も\n今回もそうなると思います。\n\n私は、今回のブルランは本当に始まると予測しています...",
      "title": "ブル・ランはこれからが本番 このサブが何と言おうと、ブルランの後半に売ることが最良の選択です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道，我知道，销售是违反本子的规则的。但这确实是\n你可以为你的投资组合做的最好的事情。\n\n每个单一的牛市运行都以灾难性的-90%的熊市结束。我不\n我不认为这一次会有什么不同。\n\n我预测，这轮牛市将真正开始...",
      "title": "牛市运行即将升温。在牛市运行后期卖出是你最好的选择，尽管这个子会告诉你。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道，我知道，銷售是違反本子的規則的。但這確實是\n你可以爲你的投資組合做的最好的事情。\n\n每個單一的牛市運行都以災難性的-90%的熊市結束。我不\n我不認爲這一次會有什麼不同。\n\n我預測，這輪牛市將真正開始...",
      "title": "牛市運行即將升溫。在牛市運行後期賣出是你最好的選擇，儘管這個子會告訴你。"
    }
  ]
}