{
  "author": "jeeptravel",
  "the_new_excerpt": "Since buying my first tiny amount of Bitcoin in February, I have been checking\nmy crypto portfolio constantly. It's basically the first thing I do when I wake\nup, and the last thing I glance at when I sleep. I check it while I eat lunch. I\ncheck it while I take a #2. After getting stressed out about…",
  "original_created_utc": 1620734438,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2月に初めて少量のビットコインを購入して以来、私は自分の暗号ポートフォリオを常にチェックしています。\n自分の暗号ポートフォリオを常にチェックしています。基本的には、朝起きて最初にすることであり、寝るときに最後に見ることでもあります。\n起きて最初にすることであり、寝るときに最後に見ることでもあります。ランチを食べながらチェックしています。I\n2番を取りながらチェックします。ストレスが溜まった後は...。",
      "title": "暗号の旅を始めてから初めて、24時間以上、自分のポートフォリオを見ていません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "自从2月份购买了我的第一笔小额比特币后，我一直在检查\n我的加密货币投资组合。这基本上是我起床后做的第一件事。\n我起床后的第一件事，也是我睡觉时看的最后一件事。我在吃午饭的时候也会查看它。I\n我在吃午饭的时候看它，在上厕所的时候看它。当我为自己的工作感到压力时，我就会去看它...",
      "title": "自从我开始我的加密货币之旅以来，这是我第一次在超过24小时内没有看我的投资组合。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "自從2月份購買了我的第一筆小額比特幣後，我一直在檢查\n我的加密貨幣投資組合。這基本上是我起牀後做的第一件事。\n我起牀後的第一件事，也是我睡覺時看的最後一件事。我在喫午飯的時候也會查看它。I\n我在喫午飯的時候看它，在上廁所的時候看它。當我爲自己的工作感到壓力時，我就會去看它...",
      "title": "自從我開始我的加密貨幣之旅以來，這是我第一次在超過24小時內沒有看我的投資組合。"
    }
  ],
  "title": "For the first time since I started my crypto journey, I haven't looked at my portfolio on over 24 hours",
  "created_utc": 1620772235,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Since buying my first tiny amount of Bitcoin in February, I have been checking my crypto portfolio constantly. It&#39;s basically the first thing I do when I wake up, and the last thing I glance at when I sleep. I check it while I eat lunch. I check it while I take a #2. After getting stressed out about the ups and downs, I decided I have put my money in coins I believe in and I would stop constantly checking it.</p>\n\n<p>Well now it finally happened. I haven&#39;t looked at my portfolio in the last 36 hours or so(until just now), and it is SUCH a freeing feeling. The quick dip on ETH last night? No idea it dipped. And I couldn&#39;t be happier.</p>\n\n<p>Make sure to get some fresh air and take a break from checking the numbers go up and down. Mental health is just as important as your wallets balance, if not more important.</p>\n\n<p>For those that can use a break, I hope this helps just one of you.</p>\n\n<p>&#x200B;</p>\n\n<p>Edit: *in over 24 hours, just saw the title spelling mistake. My bad!</p>\n</div><!-- SC_ON -->",
  "score": 193,
  "permalink": "/r/CryptoCurrency/comments/n9vdqj/for_the_first_time_since_i_started_my_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "n9vdqj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985992427
}