{
  "author": "Kreedie_",
  "original_created_utc": 1650248735,
  "title": "Why is Satan seen as the bad guy, despite god causing children to have cancer, making people suffer and creating murderers?",
  "created_utc": 1650264319,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;EDIT:&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t believe in God, as I&amp;#39;m not religious by any means and this isn&amp;#39;t meant to be offensive, I am just genuinely curious, as to why people have this mindset that God is and should be worshipped when all of these problems occur in the world.&lt;/p&gt;\n\n&lt;p&gt;People say he accepts everybody and he&amp;#39;s even the creator of all life, so wouldn&amp;#39;t that make him responsible for all murderers and rapists that exist? For children that were born with cancer and/or other deformities? Poverty?&lt;/p&gt;\n\n&lt;p&gt;So why is Satan seen as the bad one? Doesn&amp;#39;t he punish these people?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/TooAfraidToAsk/comments/u62huw/why_is_satan_seen_as_the_bad_guy_despite_god/",
  "subreddit": "TooAfraidToAsk",
  "id": "u62huw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "EDIT:\n\nI don't believe in God, as I'm not religious by any means and this isn't meant\nto be offensive, I am just genuinely curious, as to why people have this mindset\nthat God is and should be worshipped when all of these problems occur in the\nworld.\n\nPeople say he accepts everybody and he's even…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "EDIT\n\n私は決して宗教家ではないので、神を信じているわけではありませんし、このことは\nただ純粋に不思議なのは、なぜ人々はこのような考え方をするのだろうということです。\nこのような問題が起きているのに、神は崇拝されるべき存在であると。\n世界\n\nみんなを受け入れてくれるって言うし、...",
      "title": "神は子供をがんにさせ、人々を苦しめ、殺人者を生み出したにもかかわらず、なぜサタンは悪者として見られるのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "EDIT:\n\n我不相信上帝，因为我没有任何宗教信仰，这并不是说\n冒犯，我只是真的很好奇，为什么人们有这种心态\n当所有这些问题发生在这个世界上的时候，上帝是并且应该被崇拜的。\n世界上发生的所有这些问题。\n\n人们说他接受所有人，他甚至...",
      "title": "为什么撒旦被看作是坏人，尽管上帝使儿童得了癌症，使人们受苦，创造了杀人犯？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "EDIT:\n\n我不相信上帝，因爲我沒有任何宗教信仰，這並不是說\n冒犯，我只是真的很好奇，爲什麼人們有這種心態\n當所有這些問題發生在這個世界上的時候，上帝是並且應該被崇拜的。\n世界上發生的所有這些問題。\n\n人們說他接受所有人，他甚至...",
      "title": "爲什麼撒旦被看作是壞人，儘管上帝使兒童得了癌症，使人們受苦，創造了殺人犯？"
    }
  ]
}