{
  "author": "Avery_of_Astora",
  "original_created_utc": 1633261378,
  "title": "How did Byzantine Emperor‘s i.e. Alexios Komnenos speak to his Varangian Guard?",
  "created_utc": 1633297174,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Did they use translators or did the guards learn certain words in Greek for simple commands </p>\n\n<p>I’m probably answering my own question here but I would think the latter because by Alexios time the guard was made up of Anglo-Saxons and Scandinavians and it would probably be easier than having 4-5 different translators</p>\n\n<p>Another thing what if the emperor wanted to have a conversation with one of his Varangian Guards (for whatever reason of course) how much Greek would Varangians know?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/q0g4c9/how_did_byzantine_emperors_ie_alexios_komnenos/",
  "subreddit": "AskHistorians",
  "id": "q0g4c9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Did they use translators or did the guards learn certain words in Greek for\nsimple commands\n\nI’m probably answering my own question here but I would think the latter because\nby Alexios time the guard was made up of Anglo-Saxons and Scandinavians and it\nwould probably be easier than having 4-5…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "翻訳者を使ったのか、それとも警備員が簡単な命令のためにギリシャ語で特定の言葉を覚えたのか。\n簡単なコマンド\n\n私自身の質問に答えているようですが、私は後者だと思います。\nアレクシオスの時代には、衛兵はアングロサクソンとスカンジナビア人で構成されていたからです。\n4人から5人にするよりも簡単なのではないでしょうか。",
      "title": "ビザンチン帝国の皇帝アレクシオス・コムネノスは、ヴァランガン・ガードにどのような言葉をかけたのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "他们是否使用了翻译，或者守卫们是否学习了某些希腊语的单词来表达\n简单的命令\n\n我可能是在回答我自己的问题，但我认为是后者，因为\n因为在亚历克西奥斯时代，卫兵是由盎格鲁-撒克逊人和斯堪的纳维亚人组成的，这可能比有4-5个卫兵更容易。\n这可能比有4-5个......更容易。",
      "title": "拜占庭皇帝即阿列克西奥-康奈诺斯是如何对他的瓦兰吉亚卫队说话的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "他們是否使用了翻譯，或者守衛們是否學習了某些希臘語的單詞來表達\n簡單的命令\n\n我可能是在回答我自己的問題，但我認爲是後者，因爲\n因爲在亞歷克西奧斯時代，衛兵是由盎格魯-撒克遜人和斯堪的納維亞人組成的，這可能比有4-5個衛兵更容易。\n這可能比有4-5個......更容易。",
      "title": "拜占庭皇帝即阿列克西奧-康奈諾斯是如何對他的瓦蘭吉亞衛隊說話的？"
    }
  ]
}