{
  "author": "JoacoFerna24",
  "the_new_excerpt": "Today I´m bringing you all my third D&D. There will be no technical analyzed\ninformation done by me as I´m not good at it but I like to do some information\nresearch and maybe you find it helpful.\n\nDisclaimer: I´m not even close to being a financial advisor so please do your\nresearch and make your…",
  "original_created_utc": 1615783643,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "今天我给大家带来的是我的第三次拆迁。不会有技术分析\n我不擅长做信息，但我喜欢做一些信息。\n的研究，也许你会发现它的帮助。\n\n免责声明：我根本就不是什么理财顾问，所以请您做好您的理财规划。\n研究并使你的...",
      "title": "$SESN（赛森生物）D&D巨大的进货催化剂，可能对膀胱癌产生影响。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天我給大家帶來的是我的第三次拆遷。不會有技術分析\n我不擅長做信息，但我喜歡做一些信息。\n的研究，也許你會發現它的幫助。\n\n免責聲明：我根本就不是什麼理財顧問，所以請您做好您的理財規劃。\n研究並使你的...",
      "title": "$SESN（賽森生物）D&D巨大的進貨催化劑，可能對膀胱癌產生影響。"
    }
  ],
  "title": "$SESN (Sesen Bio) D&D huge incoming catalysts with mayor impact on bladder cancer.",
  "created_utc": 1615808596,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Today I´m bringing you all my third D&amp;D. There will be no technical analyzed information done by me as I´m not good at it but I like to do some information research and maybe you find it helpful. </p>\n\n<p><em>Disclaimer: I´m not even close to being a financial advisor so please do your research and make your own decisions based on what you understand.</em></p>\n\n<p>Before you ask, I currently hold 3652 shares at an average cost of 2.32.</p>\n\n<p><strong>About the company:</strong></p>\n\n<p>Sesen Bio is a late-stage company developing fusion protein medicines. Their fusion protein approach tethers a tumor-targeting antibody fragment to a protein cytotoxic payload to form a single protein molecule designed to selectively and broadly kill cancer cells while minimizing toxicity to healthy cells and to activating the body’s innate immune response system.</p>\n\n<p><strong>What are they doing and why I think it´s important:</strong></p>\n\n<p>The company is initially focused on the treatment of non-muscle invasive bladder cancer (NMIBC).</p>\n\n<p>Their main drug is it’s called <strong>Vicineum.</strong> This is being evaluated in the <a href=\"https://clinicaltrials.gov/ct2/show/NCT02449239?term=vicinium&amp;rank=1\"><strong>Phase 3 VISTA</strong> trial</a> for the treatment of patients with non-muscle invasive bladder cancer (NMIBC) who have been previously treated with Bacillus Calmette-Guérin (BCG), which is the current standard of care for NMIBC. While BCG is effective in many patients, challenges with tolerability have been observed and many patients will experience recurrence of the disease. If BCG is not effective or a patient can no longer receive BCG, the recommended option for treatment is radical cystectomy, the complete removal of the bladder.</p>\n\n<p><em>In case you ask how many people are vaccinated with the BCG feel free to click this link:</em> <a href=\"http://www.bcgatlas.org/\"><em>http://www.bcgatlas.org/</em></a><em>.</em></p>\n\n<p>The preliminary findings are highly encouraging, demonstrating that treatment with Vicineum results in clinically meaningful efficacy and favorable safety and tolerability. In addition, the data are consistent with the results of Vicineum in their completed Phase 1 and Phase 2 clinical trials.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/5vuucec194n61.png?width=761&amp;format=png&amp;auto=webp&amp;s=ae7df58f362a0ee4bf59bbae9d1bf08955c13b77\">https://preview.redd.it/5vuucec194n61.png?width=761&amp;format=png&amp;auto=webp&amp;s=ae7df58f362a0ee4bf59bbae9d1bf08955c13b77</a></p>\n\n<p><strong>Vicineum</strong> can potentially treat <strong>head and neck cancer.</strong> They have completed Phase 1 trials for an injectable form of Vicineum for the treatment of SCCHN that have demonstrated anti-tumor activity and safety. Data from these trials also demonstrated that certain patients who were injected with Vicineum in one tumor had responses in non-injected tumors as well, suggesting that Vicineum may promote an anti-tumor immune response and combine well with immunotherapies. In addition to the Phase 1 trials, Sesen Bio completed a Phase 2 trial in the United States, which demonstrated a reduction in the bidirectional size of the principle targeted tumor observed in 71 percent (10/14) of patients evaluated in the study.</p>\n\n<p><a href=\"https://sesenbio.com/our-programs/#bladder-cancer\">https://sesenbio.com/our-programs/#bladder-cancer</a></p>\n\n<p><strong>Some important fact about Bladder Cancer:</strong></p>\n\n<p>- Bladder cancer is the 6th most common cancer according to the National Cancer Institute. If BCG is not effective one of the options is <strong>complete bladder removal.</strong> Bladder cancer is a highly prevalent cancer, but options for treatment have not changed in more than 20 years. At Sesen Bio, they want to help you save your bladder. <strong>Vicineum</strong>™, is administered in the exact same way as BCG but works differently and may offer a new option.</p>\n\n<p>- This year, an estimated 83,730 adults (64,280 men and 19,450 women) in the United States will be diagnosed with bladder cancer. Smoking accounts for 47% of all these cases.</p>\n\n<p>- Bladder cancer mostly affects older people. About 90% of people with bladder cancer are older than 55. The average age people are diagnosed with bladder cancer is 73.</p>\n\n<p>- The 5-year survival rate tells you what percent of people live at least 5 years after the cancer is found. Percent means how many out of 100. The general 5-year survival rate for people with bladder cancer is 77%. If the tumor is invasive but has not yet spread outside the bladder, the 5-year survival rate is 69%. Approximately 33% of bladders cancers are diagnosed at this stage.</p>\n\n<p><a href=\"https://www.cancer.net/cancer-types/bladder-cancer/statistics\">https://www.cancer.net/cancer-types/bladder-cancer/statistics</a></p>\n\n<p><strong>This is pretty good illustration of the diagnosis to treatment:</strong></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/5vnz2o4394n61.png?width=860&amp;format=png&amp;auto=webp&amp;s=c41a52a3a08c4dc6344b851d12f7af2c8d21ddf6\">https://sesenbio.com/patients/</a></p>\n\n<p><strong>Why I´m very bullish and this and analysts are too:</strong></p>\n\n<p>- Since 2006 the Oncology Products Reviewed by FDA that have a BLA Submission (as Vicineum has) have a Probability of Approval of 82%.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/t0mmmtw494n61.png?width=495&amp;format=png&amp;auto=webp&amp;s=70095d984765b665e8e4ac2694774cdb3605f0d5\">https://preview.redd.it/t0mmmtw494n61.png?width=495&amp;format=png&amp;auto=webp&amp;s=70095d984765b665e8e4ac2694774cdb3605f0d5</a></p>\n\n<p>- <strong>Forward-looking Timeline for Vicineum</strong></p>\n\n<p>Positive progress in the US and Europe enables a clear regulatory path forward with the following anticipated milestones:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/u414613894n61.png?width=708&amp;format=png&amp;auto=webp&amp;s=97351379e468b517ed0f766931014737dbf22050\">https://preview.redd.it/u414613894n61.png?width=708&amp;format=png&amp;auto=webp&amp;s=97351379e468b517ed0f766931014737dbf22050</a></p>\n\n<p>- <strong>Potential for Peak Revenue of $1B - $3B Globally for Vicineum</strong></p>\n\n<p>Substantial US opportunity and OUS potential of roughly two times the US.</p>\n\n<p>An anticipated virtuous cycle of advocacy across physicians, patients/caregivers, and payers to drive rapid uptake and strong growth after approval and launch.</p>\n\n<p>Compelling intent to prescribe research in the US.</p>\n\n<p>A highly concentrated US market of ~1,500 Urologists treating ~75% of BCG patients allows for efficient targeting.</p>\n\n<p>- <strong>Key partnership with leading partner in MENA (Hikma Pharmaceuticals)</strong></p>\n\n<p>A public company headquartered in London with a market cap of &gt;$6B and &gt;$2B in annual revenue.</p>\n\n<p>The fifth-largest pharma company in the MENA region trusted and leading licensing partner in the region and extensive regulatory affairs capabilities.</p>\n\n<p>- <strong>Huge Estimation on the OUS Opportunity for Vicineum</strong></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/1e4yvyx994n61.png?width=544&amp;format=png&amp;auto=webp&amp;s=f1e14495da8a7b695fae401273ac30557ec7f03e\">https://preview.redd.it/1e4yvyx994n61.png?width=544&amp;format=png&amp;auto=webp&amp;s=f1e14495da8a7b695fae401273ac30557ec7f03e</a></p>\n\n<p>- <strong>Strengthening the Balance Sheet while Minimizing Dilution</strong></p>\n\n<p>No outstanding debt</p>\n\n<p>As of 12/31/2020 $44M available on an $85 ATM facility administered by Jefferies.</p>\n\n<p><a href=\"https://ir.sesenbio.com/static-files/5b335135-ecf0-4455-9ab3-49b8613ae0e1\">https://ir.sesenbio.com/static-files/5b335135-ecf0-4455-9ab3-49b8613ae0e1</a></p>\n\n<p><strong>What are analysts saying and price prediction:</strong></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/x8snbm0b94n61.png?width=971&amp;format=png&amp;auto=webp&amp;s=46196f67c788760b3dc805e8a78ec64e056c7d4e\">https://preview.redd.it/x8snbm0b94n61.png?width=971&amp;format=png&amp;auto=webp&amp;s=46196f67c788760b3dc805e8a78ec64e056c7d4e</a></p>\n\n<p><a href=\"https://preview.redd.it/k411kdpb94n61.png?width=769&amp;format=png&amp;auto=webp&amp;s=e29177b7c2b147f94781e0d5d57a496ee397c656\">https://www.marketbeat.com/stocks/NASDAQ/SESN/price-target/</a></p>\n\n<p><strong>Short, Medium- and Long-Term Indicators:</strong></p>\n\n<p><a href=\"https://preview.redd.it/5vze83qg94n61.png?width=614&amp;format=png&amp;auto=webp&amp;s=05c2fae9c5b2136365ed125a2624ed24db20360a\">https://www.barchart.com/stocks/quotes/SESN/opinion</a></p>\n\n<p><strong>My opinion on all this:</strong></p>\n\n<p>Vicineum appears to be the new great thing around bladder cancer, numbers are showing to be great and this is close to receiving an FDA response which is expected to be positive. This is the 6th most common cancer and if the BCG fails the most common treatment is bladder removal. Sesen is trying to avoid this by providing a great solution. The company is partnered around the world to provide this once approved and is aiming beyond the USA. The balance sheet looks impeccable, no debt, 44M free, indicators look great for the short, mid, and long-range with a huge upside on a price target. </p>\n\n<p>I see this having some big news soon and driving the price very high up. </p>\n\n<p>Another important thing is that there are not many videos or spam around it so the price isn´t pumped in my opinion. </p>\n\n<p>There is a BCG shortage which might help Sesen Bio get their drug approved even faster. This shortage has been going for some years now. </p>\n\n<p>I will not buy more shares as I already own a lot but I see this as a great investment.</p>\n\n<p><a href=\"https://wchh.onlinelibrary.wiley.com/doi/10.1002/tre.783\">https://wchh.onlinelibrary.wiley.com/doi/10.1002/tre.783</a></p>\n\n<p><em>One more disclaimer: I am not a doctor, nor have I ever done any study related to medicine or pharmaceuticals.</em></p>\n\n<p><em>If you have please be polite and leave a comment for us to learn from you don´t just bash the DD. Your knowledge is very much appreciated.</em></p>\n\n<p>&#x200B;</p>\n\n<p>Hope this information helps you to know more about the company and bladder cancer.</p>\n</div><!-- SC_ON -->",
  "score": 82,
  "permalink": "/r/investing/comments/m5czmg/sesn_sesen_bio_dd_huge_incoming_catalysts_with/",
  "subreddit": "investing",
  "id": "m5czmg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147379963
}