{
  "author": "heymeit",
  "original_created_utc": 1627849640,
  "title": "1700 eth? Nah 2700 eth? FOMO",
  "created_utc": 1627860786,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A lesson for those who just joined: </p>\n\n<p>Time in the market is ALWAYS better than timing the market. If you did dca through the crash it has now started to pay off. Buying on such a high would not be advisable as we have all seen what happens.</p>\n\n<p>If you do buy in now and we see a dip please make sure to buy the dip and lower you cost per coin. When it moons again you will thank me heavily. Don’t yolo at one price. Spread out the buying. </p>\n\n<p>Downvotes coming in from all the fomo buyers. Veterans of the crypto market always know more than you so maybe listen?</p>\n</div><!-- SC_ON -->",
  "score": 220,
  "permalink": "/r/CryptoCurrency/comments/ovzn8i/1700_eth_nah_2700_eth_fomo/",
  "subreddit": "CryptoCurrency",
  "id": "ovzn8i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "A lesson for those who just joined:\n\nTime in the market is ALWAYS better than timing the market. If you did dca\nthrough the crash it has now started to pay off. Buying on such a high would not\nbe advisable as we have all seen what happens.\n\nIf you do buy in now and we see a dip please make sure to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "入会したばかりの方へのレッスンです。\n\n市場のタイミングを計るよりも、市場での時間を計る方が常に良い。もしあなたがdca\nをしていれば、それが今、報われ始めています。このような高値で買うことはお勧めできません。\n高値で買うのはお勧めできません。私たちは何が起こるかを見てきましたから。\n\nもしあなたが今買って、私たちがディップを見た場合は、必ず...",
      "title": "1700 eth？Nah 2700 eth? FOMO"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "给那些刚刚加入的人一个教训。\n\n市场中的时间永远比市场中的时机好。如果你做了DCA\n通过崩盘，现在已经开始得到回报。在这样的高位买入并不是\n是不可取的，因为我们都看到了会发生什么。\n\n如果你现在买入，而我们看到了下跌，请确保...",
      "title": "1700年的伦理？呐，2700以太网？FOMO"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "給那些剛剛加入的人一個教訓。\n\n市場中的時間永遠比市場中的時機好。如果你做了DCA\n通過崩盤，現在已經開始得到回報。在這樣的高位買入並不是\n是不可取的，因爲我們都看到了會發生什麼。\n\n如果你現在買入，而我們看到了下跌，請確保...",
      "title": "1700年的倫理？吶，2700以太網？FOMO"
    }
  ]
}