{
  "author": "tomatoketchupandbeer",
  "original_created_utc": 1630434813,
  "title": "Does anyone else ever feel like nobody actually knows what they're talking about with crypto predictions and advice? Like it's almost always wrong and is about as predictable as gambling on a game of cards?",
  "created_utc": 1630445827,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Since first investing in crypto back in march, and going off of advice from all four trillion corners of the internet, I&#39;ve realised nobody actually knows what they&#39;re talking about.</p>\n\n<p>I have a friend who pays 30 GBP a month for &#39;solid&#39; advice from crypto gurus, and after following his tips have actually lost. </p>\n\n<p>I once in the early days joined a pump n dump group only 200 members or so (having no idea that it was that at the time) and then I just made up bullshit and said ZEC was going to make massive gains that weekend. The discord group all questioned my sources and I made up a story, and lo and behold over that weekend ZEC actually climbed 30%.</p>\n\n<p>Now I know for sure that wasn&#39;t from my prediction, it wasn&#39;t from the pump and dump group pumping the coin, it was just CHANCE. But that group thought I was some big crypto predictor from that lucky guess. (Shortly after got kicked my mods because they wanted to control which coins were pumped)</p>\n\n<p>I&#39;ve read countless articles from so many different financial and investment &#39;experts&#39; and after following their &#39;predictions&#39; have ended up at a loss. </p>\n\n<p>I&#39;ve read plenty of articles using a tonne of crypto lingo that makes it sound like they know what they&#39;re talking about, and half the time it&#39;s right and half the time it&#39;s wrong.</p>\n\n<p>The majority of the serious crypto community said doge coin was a joke and then we&#39;re in uproar when it soared nearly 400% (from my 0.17 investment) in a few days/weeks to an ATH of 0.71 USD after being just 0.06 a few weeks before. </p>\n\n<p>Everyone was so sure that Elon musk&#39;s appearance on SNL would send doge coin &quot;to the moooon&quot; when it did the exact opposite. </p>\n\n<p>Just to list a few predictions I&#39;ve seen parroted all over the internet and on multiple sites in the past few months -</p>\n\n<ul>\n<li><p>there will a crypto winter around August or September where the bullrun will end and there&#39;ll be a massive crash ( this ended up happening in July)</p></li>\n<li><p>bitcoin will hit 100k towards the end of the summer (no sign of that happening any time soon)</p></li>\n<li><p>the ripple Vs sec case will end in April and xrp will shoot up to 2-3 USD (case still ongoing) </p></li>\n<li><p>shiba inu will kill doge and hit a dollar at the end of the year (bs)</p></li>\n<li><p>doge coin will die (still remains a top five crypto)</p></li>\n</ul>\n\n<p>Basically predictions either turn out to be rigt or wrong. Nobody knows what&#39;s going to happen. Yet people with a lot of influence can change (or manipulate) how the market moves. A simple tweet from Elon musk moved doge coins price a bunch of times. An article from Forbes can tell the world that ADA or ETH has a big bull run coming and that&#39;s enough to make it happen due to massive buying. A billionaire can buy 1 billion USD worth of any crypto and that sends the price skyrocketing by retail investors and then the whale sells and they&#39;ve made an easy profit in a few hours or days. </p>\n\n<p>I constantly come across people or articles who just use words that sound impressive but how many of us actually know what&#39;s going to happen? Were mostly a bunch of gamblers hoping to get rich, thinking we&#39;re ahead of the curve by investing in crypto before it becomes the global norm for finance, but really most of us are just people who heard about bitcoin seven years too late and still want to get rich quick. </p>\n\n<p>Let me demonstrate how easy it is to pretend I know what&#39;s going on with the cryptomarket using trigger words and crypto jargon that makes it sound like a legitimate prediction ....</p>\n\n<p>DOGE and XRP continue to dominate inflows to institutional crypto investment products, while demand for  DOT weakens.</p>\n\n<p>Institutional inflows to altcoin investment products have continued to increase this past week, but the same cannot be said for Ether (ETH).</p>\n\n<p>The capital flows mark the second consecutive week of inflows to altcoin funds, with investments into altcoin products increasing by 24.1% compared to last week’s $16 million.</p>\n\n<p>Binance Coin price struggled with its uptrend as it encountered a massive resistance level. Failure to stay afloat dragged BNB lower, where it currently retests a support barrier. Investors can expect a comeback from the buyers, pushing the altcoin higher. </p>\n\n<p>However, considering the big crypto’s choppy market structure, Binance Coin (BNB) could kick-start a consolidation phase if it fails to reclaim the said resistance barrier.</p>\n\n<p>BAT followed a Fibonacci retracement sequence the past quarter indicating an uptrend that will retest a support barrier, potentially creating demand for comeback investments from buyers. After a recent crash, BAT price is currently consolidating under the 50% Fibonacci retracement level at 0.76. This descent might continue to head lower and retest the high probability reversal zone ranging from 0.72 to 0.80. </p>\n\n<p>The 70.5% Fibonacci retracement level at $0.71 could be a perfect spot or reversal as it coincides with the demand zone extending from $0.69 to $0.73</p>\n\n<p>Anyway I think that&#39;s enough but i just made all of that up, and maybe 10% of you will have any idea what any of the words mean but the average person will look at it and think &quot;I should invest in BAT&quot;. </p>\n\n<p>Its basically all just gambling</p>\n\n<p>Tl;Dr - don&#39;t believe any predictions on crypto, unless you&#39;re a hedge fund manager, billionaire, politician, or a founder of a major coin, you don&#39;t know what&#39;s going to happen. </p>\n\n<p>Hopefully this post didn&#39;t come across as too negative and more of a warning to remember that this is all jut gambling and most of us have no idea what we&#39;re doing. </p>\n\n<p>Bring on the downvotes for going against the sub mentality</p>\n\n<p>Edit: I guess it&#39;s not that much against the sub mentality, my bad</p>\n</div><!-- SC_ON -->",
  "score": 185,
  "permalink": "/r/CryptoCurrency/comments/pfbv8f/does_anyone_else_ever_feel_like_nobody_actually/",
  "subreddit": "CryptoCurrency",
  "id": "pfbv8f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Since first investing in crypto back in march, and going off of advice from all\nfour trillion corners of the internet, I've realised nobody actually knows what\nthey're talking about.\n\nI have a friend who pays 30 GBP a month for 'solid' advice from crypto gurus,\nand after following his tips have…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "3月に初めて暗号に投資して以来、インターネットの4兆分の1のコーナーにあるアドバイスを参考にしてきました。\nのアドバイスを参考にしましたが、誰も自分の言っていることを実際には理解していないことに気づきました。\n誰も実際には何を言っているのかわからないことに気づきました。\n\n私の友人には、暗号の達人からの「確かな」アドバイスを得るために、月に30英ポンドを支払っている人がいます。\nそして彼のアドバイスに従った結果...",
      "title": "暗号の予測やアドバイスについて、誰も自分の言っていることを理解していないと感じたことがある人はいませんか？ほとんどいつも間違っていて、トランプゲームのギャンブルのように予測可能であるような？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "自从3月份首次投资加密货币以来，并根据来自国际上所有的建议\n我意识到，没有人真正知道他们在谈论什么。\n他们在说什么。\n\n我有一个朋友，每月支付30英镑，听取加密货币大师们的 \"可靠 \"建议。\n而在遵循他的建议后，我发现...",
      "title": "还有人曾经觉得没有人真正知道他们在谈论什么加密货币的预测和建议吗？就像它几乎总是错的，而且就像赌博牌局一样可以预测？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "自從3月份首次投資加密貨幣以來，並根據來自國際上所有的建議\n我意識到，沒有人真正知道他們在談論什麼。\n他們在說什麼。\n\n我有一個朋友，每月支付30英鎊，聽取加密貨幣大師們的 \"可靠 \"建議。\n而在遵循他的建議後，我發現...",
      "title": "還有人曾經覺得沒有人真正知道他們在談論什麼加密貨幣的預測和建議嗎？就像它幾乎總是錯的，而且就像賭博牌局一樣可以預測？"
    }
  ]
}