{
  "author": "Goontri",
  "the_new_excerpt": "Hey guys,\n\nI am fully aware that I should definitely not base my decisions on the internet\nbut I know that there are some experienced users here and maybe they would like\nto give their opinion.\n\nI was supposed to go finish my bachelor in Australia but due to the pandemic, it\nwill be delayed from 6…",
  "original_created_utc": 1609934288,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "嘿伙计们,\n\n我完全意识到我绝对不应该把我的决定建立在互联网上。\n但我知道这里有一些经验丰富的用户，也许他们想\n发表他们的意见。\n\n我本来要去澳大利亚完成我的单身汉学业的，但是由于流行病，它\n将从6…延迟",
      "title": "股票VS房地产？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嘿夥計們,\n\n我完全意識到我絕對不應該把我的決定建立在互聯網上。\n但我知道這裏有一些經驗豐富的用戶，也許他們想\n發表他們的意見。\n\n我本來要去澳大利亞完成我的單身漢學業的，但是由於流行病，它\n將從6…延遲",
      "title": "股票VS房地產？"
    }
  ],
  "title": "Stocks vs Real estate ?",
  "created_utc": 1609987411,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey guys,</p>\n\n<p>I am fully aware that I should definitely not base my decisions on the internet but I know that there are some experienced users here and maybe they would like to give their opinion.</p>\n\n<p>I was supposed to go finish my bachelor in Australia but due to the pandemic, it will be delayed from 6 months to a year. I have about 40k in my bank account since it was supposed to cost me that and I currently have a revenue of about 70k/year.</p>\n\n<p>I already started to invest in the stock market a little bit but since I am going to be staying here I want to invest much more. My two options are the following:</p>\n\n<ol>\n<li>Drop 20k in stocks and wait.</li>\n<li>Buy a condo with down payment of 20k and rent it out (I still live at my parent&#39;s place)</li>\n</ol>\n\n<p>I know it is not a very common situation but I feel like it&#39;s time for me to make some move but I don&#39;t know very much yet so any recommendations will greatly help!</p>\n</div><!-- SC_ON -->",
  "score": 48,
  "permalink": "/r/investing/comments/krmil9/stocks_vs_real_estate/",
  "subreddit": "investing",
  "id": "krmil9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610100748511
}