{
  "author": "WhenSealsAttack",
  "original_created_utc": 1629973760,
  "title": "Do you look people in the eye as you walk by them, or do you try to act like they're not there?",
  "created_utc": 1629984157,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This might be the stupidest question I&#39;ve ever asked.</p>\n\n<p>Do you meet people&#39;s gaze as you walk by? Do you try to act like they don&#39;t exist? If they meet your gaze, do you look q at immediately?</p>\n\n<p>I feel like holding the gaze can be viewed as a challenge, as it is with many of the animal kingdom. I feel like looking away can be a sign of weakness. </p>\n\n<p>The weakness and strength thing isn&#39;t me trying to be an alpha, it&#39;s the fact that I live in a foreign country (Russia) that is a lot different from where I was born and raised (US), and it can be dangerous here. I don&#39;t want to appear as an easy mark, but I don&#39;t want to challenge someone. </p>\n\n<p>I also ask this because I don&#39;t want to seem weird and I have literally no social skills.</p>\n</div><!-- SC_ON -->",
  "score": 197,
  "permalink": "/r/NoStupidQuestions/comments/pbwr2f/do_you_look_people_in_the_eye_as_you_walk_by_them/",
  "subreddit": "NoStupidQuestions",
  "id": "pbwr2f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This might be the stupidest question I've ever asked.\n\nDo you meet people's gaze as you walk by? Do you try to act like they don't\nexist? If they meet your gaze, do you look q at immediately?\n\nI feel like holding the gaze can be viewed as a challenge, as it is with many of\nthe animal kingdom. I feel…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは私が今までにした質問の中で最も愚かなものかもしれません。\n\nあなたは通り過ぎるとき、人の視線を受け止めますか？存在しないかのように振る舞っていますか？\n存在しないように振る舞いますか？視線が合ったら、すぐに目を見開きますか？\n\n視線を合わせることは、動物界の多くの人々と同じように、難しいことのように感じます。\n動物界でもそうです。私は...",
      "title": "人の目を見て歩くのか、それとも人がいないように振る舞うのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这可能是我问过的最愚蠢的问题。\n\n当你走过的时候，你会和人们的目光对视吗？你是否试图表现得像他们不\n存在吗？如果他们与你对视，你是否会立即看向q？\n\n我觉得保持目光可以被看作是一种挑战，就像对许多\n动物界都是如此。我觉得...",
      "title": "当你从人们身边走过时，你是看着他们的眼睛，还是努力装作他们不在那里？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這可能是我問過的最愚蠢的問題。\n\n當你走過的時候，你會和人們的目光對視嗎？你是否試圖表現得像他們不\n存在嗎？如果他們與你對視，你是否會立即看向q？\n\n我覺得保持目光可以被看作是一種挑戰，就像對許多\n動物界都是如此。我覺得...",
      "title": "當你從人們身邊走過時，你是看着他們的眼睛，還是努力裝作他們不在那裏？"
    }
  ]
}