{
  "author": "Mountebank",
  "original_created_utc": 1627181874,
  "title": "Was there \"fan fiction\" or off-brand knockoffs of popular works of literature in the Victorian Era? How strong were IP copyright laws with regards to creative works back then?",
  "created_utc": 1627196021,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For example, did other people write stories using Dickens&#39;s characters for either private or commercial use? Were his characters used, without his permission, as mascots for advertisements? Or what about derivative works such as stage plays? I know that illiterate people used to pay for someone else to read Dicken&#39;s stories to them; was this technically illegal as a form of copyright infringement back then?  How zealously were instances of infringement prosecuted?</p>\n\n<p>I&#39;m not asking about Dickens specifically, but this question is inspired by his character Sam Weller which was extremely popular and inspired a lot of associated merchandise. Was that merchandising authorized by Dickens or his publisher, and if not would it even be illegal under the law of the time?</p>\n</div><!-- SC_ON -->",
  "score": 113,
  "permalink": "/r/AskHistorians/comments/or3ond/was_there_fan_fiction_or_offbrand_knockoffs_of/",
  "subreddit": "AskHistorians",
  "id": "or3ond",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "For example, did other people write stories using Dickens's characters for\neither private or commercial use? Were his characters used, without his\npermission, as mascots for advertisements? Or what about derivative works such\nas stage plays? I know that illiterate people used to pay for someone else…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "例えば、ディケンズのキャラクターを使って、他の人たちが個人的に、あるいは商業的に物語を書いたかどうか。\n個人的にも商業的にも。ディケンズのキャラクターは、ディケンズの許可を得ずに\n広告のマスコットとして無断で使われたのか？また、舞台劇などの二次的著作物についてはどうでしょうか。\nまた、舞台劇のような二次創作はどうでしょうか？文盲の人が他人のためにお金を払っていたことは知っていますが...。",
      "title": "ヴィクトリア朝時代には、人気のある文学作品の「ファン・フィクション」やブランド外の模造品が存在したのでしょうか？当時の創作物に対するIP著作権法の強さは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "例如，其他人是否利用狄更斯的人物写过故事？\n私人或商业用途？他的人物是否在未经他许可的情况下被用作\n他的人物是否在未经他许可的情况下被用作广告的吉祥物？或者说，衍生作品，如\n舞台剧呢？我知道，文盲们曾经为别人...",
      "title": "在维多利亚时代，是否存在 \"粉丝小说 \"或非品牌的山寨流行文学作品？当时的知识产权版权法对创意作品的影响有多大？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "例如，其他人是否利用狄更斯的人物寫過故事？\n私人或商業用途？他的人物是否在未經他許可的情況下被用作\n他的人物是否在未經他許可的情況下被用作廣告的吉祥物？或者說，衍生作品，如\n舞臺劇呢？我知道，文盲們曾經爲別人...",
      "title": "在維多利亞時代，是否存在 \"粉絲小說 \"或非品牌的山寨流行文學作品？當時的知識產權版權法對創意作品的影響有多大？"
    }
  ]
}