{
  "author": "jumbeldor",
  "original_created_utc": 1642770469,
  "title": "Selling the Rally is just as important as Buying the Dip.",
  "created_utc": 1642790243,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;We would all be millionaires if we had a dollar each time someone told us to HODL forever. I won&amp;#39;t be surprised if some people didn&amp;#39;t take profits just for the fear of having &amp;quot;Paper hands&amp;quot;.\nI can&amp;#39;t vouch for other communities cause I just lurk around in this sub, and you will agree with me when I say that this community scorns those who even &lt;em&gt;think&lt;/em&gt; of taking profits.&lt;/p&gt;\n\n&lt;p&gt;Now, I can bet that a lot of people here regret not listening to their &lt;strong&gt;own intelligence&lt;/strong&gt; and taking some sweet profits before the big red hit us all this year. &lt;/p&gt;\n\n&lt;p&gt;We chant &amp;quot;Buy the dip&amp;quot; everyday in this sub, hell even in the entire crypto world, but never have I heard someone say &amp;quot;Sell the rally&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;So here I am, giving you all a heads up for the inevitable crypto rally this year:&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;It is OKAY to take some PROFITS !&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;It is OKAY to be able to sleep at night with no regrets.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;It is OKAY to miss some extra green because you didn&amp;#39;t want to risk it.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Honestly, everyone who has been there in the crypto market books profit every now and then, they just keep it a secret. And all the newbies fall for the trap called &amp;quot;HODL till death&amp;quot;. Just don&amp;#39;t do that. Hodl isn&amp;#39;t some holy grail you need to abide by all the time.&lt;/p&gt;\n\n&lt;p&gt;DCA and HODL is definitely a very smart strategy to invest in good projects, but don&amp;#39;t forget to get your family something nice with crypto profits. &lt;/p&gt;\n\n&lt;p&gt;In case you fear missing out on huge pumps, best hodl &lt;em&gt;some&lt;/em&gt; while booking profits on a &lt;em&gt;small&lt;/em&gt; percentage of your bag. This is a win-win situation where you minimize both risk and regrets while still HODLing.&lt;/p&gt;\n\n&lt;p&gt;Lastly, If you have extra money, Buy the Dip fellas!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 421,
  "permalink": "/r/CryptoCurrency/comments/s9ad4u/selling_the_rally_is_just_as_important_as_buying/",
  "subreddit": "CryptoCurrency",
  "id": "s9ad4u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "We would all be millionaires if we had a dollar each time someone told us to\nHODL forever. I won't be surprised if some people didn't take profits just for\nthe fear of having \"Paper hands\". I can't vouch for other communities cause I\njust lurk around in this sub, and you will agree with me when I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "と言われるたびに1ドルずつ持っていたら、みんな億万長者になっていたかもしれません。\n永遠にHODL。という理由で利食いしなかった人がいても不思議ではありません。\n紙の手」を持つことの怖さ。私は他のコミュニティーのことを保証することはできません。\nこのサブの中に潜んでいるだけで、私の言うことに同意していただけると思います。",
      "title": "ラリーを売ることは、ディップを買うことと同じくらい重要である。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果每次有人告诉我们，我们有一美元，我们都会成为百万富翁。\n永远的HODL。如果有些人因为害怕 \"纸上谈兵 \"而不获利，我也不会感到惊讶。\n害怕有 \"纸手\"。我不能为其他社区作担保，因为我\n我不能为其他社区作担保，因为我只是在这个分区潜伏着，你会同意我的看法，当我...",
      "title": "卖出反弹与买入下跌同样重要。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果每次有人告訴我們，我們有一美元，我們都會成爲百萬富翁。\n永遠的HODL。如果有些人因爲害怕 \"紙上談兵 \"而不獲利，我也不會感到驚訝。\n害怕有 \"紙手\"。我不能爲其他社區作擔保，因爲我\n我不能爲其他社區作擔保，因爲我只是在這個分區潛伏着，你會同意我的看法，當我...",
      "title": "賣出反彈與買入下跌同樣重要。"
    }
  ]
}