{
  "author": "Dry-One-8462",
  "original_created_utc": 1639795794,
  "title": "Is it ok to cut friendships that don’t bring you joy?",
  "created_utc": 1639813285,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have this group of friends where we meet once every year. Other than the yearly meet up, we don’t really talk to each other. I don’t really share my personal matters with them either.. Simply to say, I’m not happy when I hang out with them. &lt;/p&gt;\n\n&lt;p&gt;I left the group chat, but they added me back in, and the friends are privately messaging me if I’m free on that date for meet up. &lt;/p&gt;\n\n&lt;p&gt;For now, I’m just ignoring all of them. At this point, I’m wondering if what I am doing is right, or should I tell them straight that I don’t want the friendships anymore. I’m not someone that is good at confronting straight, and normally just prefer ignoring people.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/TooAfraidToAsk/comments/rixl3q/is_it_ok_to_cut_friendships_that_dont_bring_you/",
  "subreddit": "TooAfraidToAsk",
  "id": "rixl3q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I have this group of friends where we meet once every year. Other than the\nyearly meet up, we don’t really talk to each other. I don’t really share my\npersonal matters with them either.. Simply to say, I’m not happy when I hang out\nwith them.\n\nI left the group chat, but they added me back in, and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の友人たちは、毎年1回集まっています。それ以外には\n年に一度、会うだけで、あまり話をしないんです。私はあまり自分のことを\n個人的なことも含めて...。簡単に言うと、一緒にいても楽しくないんです。\nということです。\n\nグループチャットから抜けたんだけど、また追加されて...。",
      "title": "喜びを感じない友人関係は切ってもいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我有这样一群朋友，我们每年都会聚会一次。除了这个\n一年一度的聚会，我们并不真正彼此交谈。我也不怎么和他们分享我的\n我也不与他们分享我的个人事务。简单地说，当我和他们在一起时，我并不开心。\n与他们在一起时，我并不开心。\n\n我离开了群聊，但他们又把我加了进去，而且...",
      "title": "削减不能给你带来快乐的友谊可以吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我有這樣一羣朋友，我們每年都會聚會一次。除了這個\n一年一度的聚會，我們並不真正彼此交談。我也不怎麼和他們分享我的\n我也不與他們分享我的個人事務。簡單地說，當我和他們在一起時，我並不開心。\n與他們在一起時，我並不開心。\n\n我離開了羣聊，但他們又把我加了進去，而且...",
      "title": "削減不能給你帶來快樂的友誼可以嗎？"
    }
  ]
}