{
  "author": "Faze-Cumshot",
  "original_created_utc": 1637004691,
  "title": "Your gains aren't gains and your losses aren't losses until you decide to sell",
  "created_utc": 1637044253,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is the old crypto rule, I joined back in 2017 and learned this the hard way. Your gains are just paper gains until you actually realize them. Similarly your losses are paper losses until you decide to sell. Most of us learn it the hard way. Back in 2018 I had multiple x&#39;s of gains but I didn&#39;t sell and held them back to loss. I also had some coins in loss which I sold for loss and they went up few months from my selling date. So the rule is pretty simple and straightforward in crypto world. Don&#39;t just look at paper gains or losses. You haven&#39;t gained anything until you sell and you haven&#39;t lost anything until you sell. Hope this helps the new one&#39;s here. Cheers</p>\n</div><!-- SC_ON -->",
  "score": 168,
  "permalink": "/r/CryptoCurrency/comments/quocg1/your_gains_arent_gains_and_your_losses_arent/",
  "subreddit": "CryptoCurrency",
  "id": "quocg1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is the old crypto rule, I joined back in 2017 and learned this the hard\nway. Your gains are just paper gains until you actually realize them. Similarly\nyour losses are paper losses until you decide to sell. Most of us learn it the\nhard way. Back in 2018 I had multiple x's of gains but I didn't…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは古い暗号のルールで、私は2017年に参加して、これを苦労して学びました。\n方法です。あなたの利益は、実際に実現するまではただの紙の利益です。同様に\nあなたの損失は、あなたが売ることを決めるまで紙の損失です。私たちのほとんどは、それを学ぶ\n難しい方法です。2018年、私は複数の××の利益を得たが、私は...",
      "title": "あなたが売ることを決めるまで、あなたの利益は利益ではなく、あなたの損失は損失ではありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是古老的加密货币规则，我早在2017年就加入了，并以艰难的方式学到了这一点。\n方式。你的收益只是纸面上的收益，直到你真正实现它们。同样地\n你的损失是纸面上的损失，直到你决定卖出。我们大多数人都学会了\n艰难的方式。早在2018年，我有多个X的收益，但我没有...",
      "title": "你的收益不是收益，你的损失也不是损失，直到你决定卖出。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是古老的加密貨幣規則，我早在2017年就加入了，並以艱難的方式學到了這一點。\n方式。你的收益只是紙面上的收益，直到你真正實現它們。同樣地\n你的損失是紙面上的損失，直到你決定賣出。我們大多數人都學會了\n艱難的方式。早在2018年，我有多個X的收益，但我沒有...",
      "title": "你的收益不是收益，你的損失也不是損失，直到你決定賣出。"
    }
  ]
}