{
  "author": "snapekilledyomomma",
  "original_created_utc": 1631680629,
  "title": "I'm sorry but you're an idiot if you've been in crypto for a while and still get scammed.",
  "created_utc": 1631710696,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As you&#39;ve all noticed, there are tons and tons of these stories of people getting scammed. It&#39;s come to the point where I have no sympathies for the people being scammed.</p>\n\n<p>Seriously how hard is it to use some common sense? </p>\n\n<ol>\n<li>DON&#39;T OPEN SHADY LINKS</li>\n<li>DON&#39;T CONNECT YOUR WALLET TO SHADY PLATFORMS</li>\n<li>DON&#39;T SEND CRYPTO TO STRANGERS</li>\n</ol>\n\n<p>All these points have been reiterated time and time again by other members on this sub. You are getting scammed because you are stupid and greedy. No legit person or company is going to double your crypto in a day.  These scammers take advantage of people like you because you are a fool.</p>\n\n<p>So here are my new rules to stick by. Take them to heart.</p>\n\n<ol>\n<li>BUY CRYPTO</li>\n<li>TRANSFER TO A HARDWARE WALLET</li>\n<li>SHUT THE FUCK UP </li>\n<li>???</li>\n<li>PROFIT</li>\n</ol>\n</div><!-- SC_ON -->",
  "score": 165,
  "permalink": "/r/CryptoCurrency/comments/poj685/im_sorry_but_youre_an_idiot_if_youve_been_in/",
  "subreddit": "CryptoCurrency",
  "id": "poj685",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As you've all noticed, there are tons and tons of these stories of people\ngetting scammed. It's come to the point where I have no sympathies for the\npeople being scammed.\n\nSeriously how hard is it to use some common sense?\n\n 1. DON'T OPEN SHADY LINKS\n 2. DON'T CONNECT YOUR WALLET TO SHADY PLATFORMS\n…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さんもお気づきのように、このような詐欺に遭ったという話は山ほどあります。\n詐欺にあった人の話は山ほどあります。詐欺に遭った人には全く同情できないところまで来ています。\n詐欺にあった人たちに同情できないほどです。\n\n真面目な話、常識的な判断をするのは難しいのではないでしょうか？\n\n 1. 怪しいリンクを開かない\n 2. 怪しげなプラットフォームに財布を接続しない\n...",
      "title": "申し訳ありませんが、暗号をしばらくやっていても詐欺に遭うのはバカです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "正如你们都注意到的那样，有成吨成吨的这些人的故事\n被骗的故事。这已经到了我不同情被骗者的地步了。\n被骗的人。\n\n说真的，使用一些常识有多难呢？\n\n 1. 不要打开可疑的链接\n 2. 不要将你的钱包连接到不正当的平台上\n...",
      "title": "我很抱歉，但如果你已经在加密货币中呆了一段时间，仍然被骗，你就是个白痴。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "正如你們都注意到的那樣，有成噸成噸的這些人的故事\n被騙的故事。這已經到了我不同情被騙者的地步了。\n被騙的人。\n\n說真的，使用一些常識有多難呢？\n\n 1. 不要打開可疑的鏈接\n 2. 不要將你的錢包連接到不正當的平臺上\n...",
      "title": "我很抱歉，但如果你已經在加密貨幣中呆了一段時間，仍然被騙，你就是個白癡。"
    }
  ]
}