{
  "author": "stickman07738",
  "the_new_excerpt": "-- Honeywell (NASDAQ: HON) announced today that Honeywell Quantum Solutions\n(HQS) and Cambridge Quantum Computing (CQC), two world-leading quantum computing\nand quantum technology businesses, will combine to form the largest, most\nadvanced standalone quantum computing company in the world, setting…",
  "original_created_utc": 1623160583,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "-- ハネウェル（NASDAQ：HON）は本日、ハネウェルクォンタムソリューションズ\n(HQS)とケンブリッジ・クォンタム・コンピューティング(CQC)の2つの世界的な量子コンピューティング\nハネウェル・クオンタム・ソリューションズ（HQS）とケンブリッジ・クオンタム・コンピューティング（CQC）は\nハネウェル クオンタム ソリューションズ(HQS)とケンブリッジ クオンタム コンピューティング(CQC)の2社が統合し、世界最大かつ最先端の独立した量子コンピューティング企業が誕生します。",
      "title": "ハネウェル・クオンタム・ソリューションズとケンブリッジ・クオンタム・コンピューティングが合併し、世界最大かつ最先端の量子ビジネスを構築へ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "-- 霍尼韦尔（NASDAQ: HON）今天宣布，霍尼韦尔量子解决方案公司（HQS）和剑桥量子计算公司（CQC）这两家世界领先的量子计算公司将在未来几年内合作开发新的产品。\n(HQS)和剑桥量子计算公司(CQC)这两家世界领先的量子计算和\n两家世界领先的量子计算和量子技术企业将合并为全球最大、最先进的独立量子计算公司。\n霍尼韦尔量子解决方案公司（HQS）和剑桥量子计算公司（CQC）这两家世界领先的量子计算和量子技术企业将合并为全球最大、最先进的独立的量子计算公司，为...",
      "title": "霍尼韦尔量子解决方案和剑桥量子计算公司将合并，形成世界上最大、最先进的量子企业"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "-- 霍尼韋爾（NASDAQ: HON）今天宣佈，霍尼韋爾量子解決方案公司（HQS）和劍橋量子計算公司（CQC）這兩家世界領先的量子計算公司將在未來幾年內合作開發新的產品。\n(HQS)和劍橋量子計算公司(CQC)這兩家世界領先的量子計算和\n兩家世界領先的量子計算和量子技術企業將合併爲全球最大、最先進的獨立量子計算公司。\n霍尼韋爾量子解決方案公司（HQS）和劍橋量子計算公司（CQC）這兩家世界領先的量子計算和量子技術企業將合併爲全球最大、最先進的獨立的量子計算公司，爲...",
      "title": "霍尼韋爾量子解決方案和劍橋量子計算公司將合併，形成世界上最大、最先進的量子企業"
    }
  ],
  "title": "Honeywell Quantum Solutions And Cambridge Quantum Computing Will Combine To Form World's Largest, Most Advanced Quantum Business",
  "created_utc": 1623171589,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>-- Honeywell (NASDAQ: HON) announced today that Honeywell Quantum Solutions (HQS) and Cambridge Quantum Computing (CQC), two world-leading quantum computing and quantum technology businesses, will combine to form the largest, most advanced standalone quantum computing company in the world, setting the pace for what is projected to become a $1 trillion quantum computing industry over the next three decades.</p>\n\n<p>The new company will offer the world&#39;s highest performing quantum computer and a full suite of quantum software, including the first and most advanced quantum operating system. These technologies will support customer needs for improved computation in diverse areas including cyber security, drug discovery and delivery, material science, finance, and optimization across all major industrial markets. The company will also focus on the advancement of natural language processing to fully leverage the possibilities of quantum artificial intelligence.</p>\n\n<p><a href=\"https://investor.honeywell.com/financial-releases/press-release/2021/Honeywell-Quantum-Solutions-And-Cambridge-Quantum-Computing-Will-Combine-To-Form-Worlds-Largest-Most-Advanced-Quantum-Business/default.aspx\">https://investor.honeywell.com/financial-releases/press-release/2021/Honeywell-Quantum-Solutions-And-Cambridge-Quantum-Computing-Will-Combine-To-Form-Worlds-Largest-Most-Advanced-Quantum-Business/default.aspx</a></p>\n</div><!-- SC_ON -->",
  "score": 313,
  "permalink": "/r/stocks/comments/nv4lcg/honeywell_quantum_solutions_and_cambridge_quantum/",
  "subreddit": "stocks",
  "id": "nv4lcg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404888031
}