{
  "author": "KofiOlut",
  "original_created_utc": 1636921596,
  "title": "We gotta be nicer to beginners who are bit shaken up by these dips.",
  "created_utc": 1636947517,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The overall discourse in this sub is a bit schizophrenic and confusing at times. We all got into the market und this sub to learn about crypto, get advice here and there, make profits, discuss, shill some coins and just have a good laugh.</p>\n\n<p>For Newbies to get into the market when every coin is in the green is easy enough, but it&#39;s very scary to see the overall value of your investment plummet a few percent in a matter of minutes/hours, heck I remember my first time while the FUD got the better of me. </p>\n\n<p>Point Is: We need to be nicer to New Crypto Enthusiasts overall. It doesn&#39;t help anyone to scold them on their investment, telling them if you need your money back so soon, you shouldn&#39;t have invested at all. The entire idea behind decentralized finance is, that we are in this together and Newcomers will help grow the market if we don&#39;t scare them away.</p>\n</div><!-- SC_ON -->",
  "score": 165,
  "permalink": "/r/CryptoCurrency/comments/qtylos/we_gotta_be_nicer_to_beginners_who_are_bit_shaken/",
  "subreddit": "CryptoCurrency",
  "id": "qtylos",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The overall discourse in this sub is a bit schizophrenic and confusing at times.\nWe all got into the market und this sub to learn about crypto, get advice here\nand there, make profits, discuss, shill some coins and just have a good laugh.\n\nFor Newbies to get into the market when every coin is in the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブの全体的な言説は、少し分裂していて混乱しているところがあります。\n我々は皆、暗号について学び、あちこちでアドバイスを受け、利益を上げ、議論するために、このサブでマーケットに参加した。\n利益を上げたり、議論したり、いくつかのコインを売り込んだり、大笑いしたりするために、このサブに参加しています。\n\nすべてのコインが市場に出回っているときに、初心者が市場に参加するのは...",
      "title": "初心者の方にはもっと優しくしてあげないとね。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这个分项的整体论述有时有点精神分裂，令人困惑。\n我们都进入了这个市场，并在这个子里学习加密货币，在这里和那里得到建议。\n赚取利润，讨论，推销一些硬币，只是有一个良好的笑。\n\n对于新手来说，当每一个硬币都是在市场上的时候，他们就会进入市场。",
      "title": "我们必须对那些因这些下跌而受到冲击的初学者好一点。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個分項的整體論述有時有點精神分裂，令人困惑。\n我們都進入了這個市場，並在這個子裏學習加密貨幣，在這裏和那裏得到建議。\n賺取利潤，討論，推銷一些硬幣，只是有一個良好的笑。\n\n對於新手來說，當每一個硬幣都是在市場上的時候，他們就會進入市場。",
      "title": "我們必須對那些因這些下跌而受到衝擊的初學者好一點。"
    }
  ]
}