{
  "author": "SuperBoner6699",
  "original_created_utc": 1633796797,
  "title": "Never buy Crypto from Robinhood. This is Financial Advice.",
  "created_utc": 1633804564,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A warm welcome to all newcomers who are just joining this\nsubreddit.\nIf you don&#39;t use Robinhood, then Well-done to you.\nIf you still don&#39;t understand why Robinhood isn&#39;t good for\nyou, then please realize that with Robinhood you don&#39;t really\nown your Crypto, Robinhood does.\nNow I Know I&#39;m not in any position to render any Financial\nAdvice to anyone but I genuinely want the best for you so\nplease; NEVER BUY CRYPTO FROM ROBINHOOD.\nThey say personal experience is the best teacher, but I say\nlearning from the experiences of others is truly the best way\nto learn.</p>\n</div><!-- SC_ON -->",
  "score": 312,
  "permalink": "/r/CryptoCurrency/comments/q4omz8/never_buy_crypto_from_robinhood_this_is_financial/",
  "subreddit": "CryptoCurrency",
  "id": "q4omz8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "A warm welcome to all newcomers who are just joining this subreddit. If you\ndon't use Robinhood, then Well-done to you. If you still don't understand why\nRobinhood isn't good for you, then please realize that with Robinhood you don't\nreally own your Crypto, Robinhood does. Now I Know I'm not in any…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブレディットに参加したばかりの新参者の皆さんを心から歓迎します。もしあなたが\nロビンフッドを使っていない人は、よくやったと思います。もしあなたがまだ、なぜ\nRobinhoodがあなたにとって良くない理由をまだ理解していないなら、Robinhoodではあなたは実際に暗号を所有していないことを理解してください。\nロビンフッドはあなたの暗号を実際に所有していません。今、私は何もしていないことを知っています...",
      "title": "ロビンフッドから暗号を買ってはいけない。これはファイナンシャル・アドバイスです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "热烈欢迎所有刚刚加入这个子版块的新朋友。如果你\n不使用Robinhood，那么你的表现就很好了。如果你还不明白为什么\n如果你还不明白为什么Robinhood不适合你，那么请你明白，使用Robinhood你并不\n真正拥有你的加密货币，Robinhood拥有。现在我知道我没有在任何...",
      "title": "永远不要从Robinhood购买加密货币。这是金融建议。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "熱烈歡迎所有剛剛加入這個子版塊的新朋友。如果你\n不使用Robinhood，那麼你的表現就很好了。如果你還不明白爲什麼\n如果你還不明白爲什麼Robinhood不適合你，那麼請你明白，使用Robinhood你並不\n真正擁有你的加密貨幣，Robinhood擁有。現在我知道我沒有在任何...",
      "title": "永遠不要從Robinhood購買加密貨幣。這是金融建議。"
    }
  ]
}