{
  "author": "No_Weather682",
  "original_created_utc": 1655902292,
  "title": "If you stop doing DCA because you think the market will go lower, you’re not doing DCA, you’re trying to predict the market.",
  "created_utc": 1655915800,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;If you change your DCA plan according to price, you’re not doing DCA, you’re trying to predict the market. Even if the upcoming months seem very bearish, you have to stick to your DCA plan. That’s the whole purpose of dollar cost averaging. I saw a lot of people saying that it was the perfect time to DCA when BTC price was at 40K$, but now that BTC is at 20k$ the say that they will wait for the market to go lower. &lt;/p&gt;\n\n&lt;p&gt;It’s perfectly fine if you want to predict the market, or if you will wait for BTC or ETH to go lower to buy more. But be conscious that doing this defeats the whole point of DCA. Just do what you want, but don’t lie to yourself.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 503,
  "permalink": "/r/CryptoCurrency/comments/vi4jt6/if_you_stop_doing_dca_because_you_think_the/",
  "subreddit": "CryptoCurrency",
  "id": "vi4jt6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "If you change your DCA plan according to price, you’re not doing DCA, you’re\ntrying to predict the market. Even if the upcoming months seem very bearish, you\nhave to stick to your DCA plan. That’s the whole purpose of dollar cost\naveraging. I saw a lot of people saying that it was the perfect time…",
  "localize": [
    {
      "locale": "ja",
      "title": "マーケットが下がると思ってDCAをやめたら、それはDCAをやっているのではなく、マーケットを予測しようとしているのです。",
      "the_new_excerpt": "価格に応じてDCAプランを変更するのであれば、DCAをやっているのではなく\n市場を予測しようとしているのです。これからの数ヶ月がとても弱気に見えるとしても\nDCAプランに固執する必要があります。それがドルコスト平均法の目的です。\nそれがドルコスト平均法の目的です。多くの人が、今が絶好の機会だと言っているのを見ました...。"
    },
    {
      "locale": "zh",
      "title": "如果你因为认为市场会走低而停止做DCA，你就不是在做DCA，你是在试图预测市场。",
      "the_new_excerpt": "如果你根据价格来改变你的DCA计划，你就不是在做DCA，你是在预测市场。\n试图预测市场。即使未来几个月似乎非常看跌，你也\n你必须坚持你的DCA计划。这就是美元成本平均法的全部目的。\n平均值的目的。我看到很多人说，这是一个完美的时间..."
    },
    {
      "locale": "zh-Hant",
      "title": "如果你因爲認爲市場會走低而停止做DCA，你就不是在做DCA，你是在試圖預測市場。",
      "the_new_excerpt": "如果你根據價格來改變你的DCA計劃，你就不是在做DCA，你是在預測市場。\n試圖預測市場。即使未來幾個月似乎非常看跌，你也\n你必須堅持你的DCA計劃。這就是美元成本平均法的全部目的。\n平均值的目的。我看到很多人說，這是一個完美的時間..."
    }
  ]
}