{
  "author": "local_weeb_cowgirl",
  "original_created_utc": 1646934622,
  "title": "Do you think Child Obsesity is considered Child Abuse and neglectful parenting?",
  "created_utc": 1646942057,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I know people with obese children who just kind of eat whatever. It just feels messed up that they let their kids bloat up super big, and those kids don&amp;#39;t understand the future issues they&amp;#39;re going to have. It just seems like pretty bad parenting. But I&amp;#39;ve never really asked other people about it and if they feel the same. So what are your thoughts?&lt;/p&gt;\n\n&lt;p&gt;Edit: I’m sorry, I shouldn’t say abuse since most of the time it isn’t intentional. And I do know that diseases, disorders, and genes can play a HUGE part. As well as poverty and the inflation of prices. But we can’t ignore the fact there are parents that will let a kid eat chips all day and soda and not say a word. People say this is because of pure ignorance, which that’s absolutely true. But it’s also unintentionally neglectful. That’s how I see it though.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 119,
  "permalink": "/r/TooAfraidToAsk/comments/tb4ca8/do_you_think_child_obsesity_is_considered_child/",
  "subreddit": "TooAfraidToAsk",
  "id": "tb4ca8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I know people with obese children who just kind of eat whatever. It just feels\nmessed up that they let their kids bloat up super big, and those kids don't\nunderstand the future issues they're going to have. It just seems like pretty\nbad parenting. But I've never really asked other people about it…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "肥満の子供を持つ人は、何でも食べてしまうんですね。それは、ただ\n自分の子供を超大型に膨張させるなんて、とんでもない。\n将来起こるであろう問題を理解している。それは、かなり\n悪い親だ。でも、あまり他人に聞いたことがないんですよね...。",
      "title": "Child ObsityはChild Abuse、ネグレクトペアレンティングと言われるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道有的人有肥胖的孩子，他们只是有点吃什么。这只是感觉\n混乱的是，他们让自己的孩子膨胀得超级大，而这些孩子不知道\n这些孩子不明白他们将来会有的问题。这似乎是很\n糟糕的养育方式。但我从来没有真正问过其他人......",
      "title": "你认为儿童肥胖症被认为是虐待儿童和忽视父母的行为吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道有的人有肥胖的孩子，他們只是有點喫什麼。這只是感覺\n混亂的是，他們讓自己的孩子膨脹得超級大，而這些孩子不知道\n這些孩子不明白他們將來會有的問題。這似乎是很\n糟糕的養育方式。但我從來沒有真正問過其他人......",
      "title": "你認爲兒童肥胖症被認爲是虐待兒童和忽視父母的行爲嗎？"
    }
  ]
}