{
  "author": "TNGSystems",
  "original_created_utc": 1659009182,
  "title": "Binance Smart Chain is a train wreck of scams and worthless projects.",
  "created_utc": 1659065666,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Can anyone show me one good project on Binance Smart Chain that isn’t just a new way to mindlessly swap shitcoins around?  &lt;/p&gt;\n\n&lt;p&gt;It seems like every token follows the same blueprint:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;launch with a huge supply &amp;gt;1 Trillion tokens (exploit unit bias)&lt;br/&gt;&lt;/li&gt;\n&lt;li&gt;perform and market a couple manual burns (exploit scarcity theory) &lt;/li&gt;\n&lt;li&gt;create a roadmap that promises extravagant goals (exploit investor naivety) &lt;/li&gt;\n&lt;li&gt;most use tax-based reflections as a way to trap holders (exploit dopamine release) &lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;But the main issue for me is that none of these tokens actually &lt;em&gt;do anything&lt;/em&gt;.  &lt;/p&gt;\n\n&lt;p&gt;When you look at something like Ethereum, it’s a platform cryptocurrency with smart contract functionality. This is inherently valuable as it allows people to perform “If X = fulfilled then Y” contracts on the blockchain and therefore trustless transactions and countless permutations can be achieved.  &lt;/p&gt;\n\n&lt;p&gt;There is such a wide gamut of actual cryptos with their own blockchain and either niche goals or vast goals.  &lt;/p&gt;\n\n&lt;p&gt;But then you have BSC.  &lt;/p&gt;\n\n&lt;p&gt;And it’s the same shit in a different toilet.  &lt;/p&gt;\n\n&lt;p&gt;“Oh, we’re gonna do our own dex so we can swap shitcoin A for shitcoin B. Oh, we’re gonna make our own wallet, utterly indistinguishable from countless other shitcoin wallets. Oh, we’re gonna add NFT trading. Oh, we’re gonna make and sell some merch. Oh, we’re gonna try and get listed on an actual exchange.”   &lt;/p&gt;\n\n&lt;p&gt;I mean, what’s the point? &lt;strong&gt;What do any of these actually do?&lt;/strong&gt; &lt;/p&gt;\n\n&lt;p&gt;I think I know the answer:  &lt;/p&gt;\n\n&lt;h3&gt;BSC projects are just a way for disingenuous project owners to enrich themselves by exploiting new and naive Investors by promising wealth and community.&lt;/h3&gt;\n\n&lt;p&gt;I still haven’t found a single BSC project that adds real world utility, isn’t a scam and hasn’t made the developers disgustingly wealthy.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 302,
  "permalink": "/r/CryptoCurrency/comments/wa7vur/binance_smart_chain_is_a_train_wreck_of_scams_and/",
  "subreddit": "CryptoCurrency",
  "id": "wa7vur",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Can anyone show me one good project on Binance Smart Chain that isn’t just a new\nway to mindlessly swap shitcoins around?\n\nIt seems like every token follows the same blueprint:\n\n * launch with a huge supply >1 Trillion tokens (exploit unit bias)\n   \n * perform and market a couple manual burns…"
}