{
  "author": "whoopwhoopaprilfools",
  "original_created_utc": 1653543909,
  "title": "People who bike everywhere: how do you not reach your destination all sweaty and smelly?",
  "created_utc": 1653573096,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I really wanna start biking more to reduce my own personal carbon footprint, but I live in FL and if I biked to work, it’d take around 30-40 mins, it would be scorching hot, and I would get there a mess of ‘outside smell’. &lt;/p&gt;\n\n&lt;p&gt;I just don’t understand how people bike to school, work, etc., because even if you’re super fit and don’t sweat, you’ll still stink from the outside. I feel dumb asking this so I guess it’s the right sub lol. How do you people do it??&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 107,
  "permalink": "/r/NoStupidQuestions/comments/uy0nm1/people_who_bike_everywhere_how_do_you_not_reach/",
  "subreddit": "NoStupidQuestions",
  "id": "uy0nm1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I really wanna start biking more to reduce my own personal carbon footprint, but\nI live in FL and if I biked to work, it’d take around 30-40 mins, it would be\nscorching hot, and I would get there a mess of ‘outside smell’.\n\nI just don’t understand how people bike to school, work, etc., because even…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私個人の二酸化炭素排出量を減らすために、本当はもっと自転車に乗りたいのですが。\nフロリダに住んでいるのですが、自転車で通勤するとなると、30〜40分はかかるし、灼熱で\n灼熱で、\"外の臭い \"が充満しているところに行くことになる。\n\n私は、学校や職場などに自転車で通う人の気持ちが理解できないのです、だって...",
      "title": "自転車でどこへでも行く人：汗と匂いにまみれながら目的地にたどり着かない方法とは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我真的想开始多骑自行车，以减少我个人的碳足迹，但\n我住在佛罗里达州，如果我骑自行车去上班，大约需要30-40分钟，而且天气会很热。\n如果我骑自行车去上班，大约需要30-40分钟，而且会很热，我到了那里会有一股 \"外面的气味\"。\n\n我只是不明白人们是如何骑车去学校、工作等的，因为即使...",
      "title": "骑自行车到处跑的人：你如何才能不在到达目的地时浑身是汗、臭气熏天？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我真的想開始多騎自行車，以減少我個人的碳足跡，但\n我住在佛羅里達州，如果我騎自行車去上班，大約需要30-40分鐘，而且天氣會很熱。\n如果我騎自行車去上班，大約需要30-40分鐘，而且會很熱，我到了那裏會有一股 \"外面的氣味\"。\n\n我只是不明白人們是如何騎車去學校、工作等的，因爲即使...",
      "title": "騎自行車到處跑的人：你如何才能不在到達目的地時渾身是汗、臭氣熏天？"
    }
  ]
}