{
  "author": "Kumquats_indeed",
  "original_created_utc": 1656369564,
  "title": "What did the various phases of the French Revolution look like outside of Paris, in other cities like Bordeaux, Rouen, or Lyon, or in rural villages?",
  "created_utc": 1656398665,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The way the French Revolution is often presented, it seems like it took place almost entirely in Paris. I am aware of a bit of what was going outside of Paris, like counter-revolution in The Vendée and the royal family&amp;#39;s attempted escape from the country. But was the Revolution really as focused on the capital city as it seems to a layman? And what might an average person&amp;#39;s experience have been during the Revolution outside of Paris, either in another city or in the countryside?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/vm7izn/what_did_the_various_phases_of_the_french/",
  "subreddit": "AskHistorians",
  "id": "vm7izn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The way the French Revolution is often presented, it seems like it took place\nalmost entirely in Paris. I am aware of a bit of what was going outside of\nParis, like counter-revolution in The Vendée and the royal family's attempted\nescape from the country. But was the Revolution really as focused on…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "フランス革命というと、ほとんどパリで起こったように思われがちですが\nフランス革命は、ほとんどパリで起こったように思われています。私は、パリの外で何が起こっていたのか、少しは知っています。\nヴァンデの反革命や王家の国外脱出など、パリの外で起きていたことは少し知っています。\nパリの外では、ヴァンデの反革命や王室の国外脱出など、多少のことは知っています。しかし、革命は本当にパリに集中していたのでしょうか？",
      "title": "パリ以外のボルドーやルーアン、リヨンなどの都市、あるいは地方の村々では、フランス革命のさまざまな局面はどのようなものだったのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "从法国大革命经常被介绍的方式来看，它似乎是发生在\n几乎完全发生在巴黎。我知道在巴黎之外发生的一些事情。\n旺代的反革命和王室的企图。\n逃离这个国家。但是，大革命真的是以巴黎为中心吗？",
      "title": "在巴黎之外，在波尔多、鲁昂或里昂等其他城市，或者在农村，法国大革命的各个阶段是什么样子？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "從法國大革命經常被介紹的方式來看，它似乎是發生在\n幾乎完全發生在巴黎。我知道在巴黎之外發生的一些事情。\n旺代的反革命和王室的企圖。\n逃離這個國家。但是，大革命真的是以巴黎爲中心嗎？",
      "title": "在巴黎之外，在波爾多、魯昂或里昂等其他城市，或者在農村，法國大革命的各個階段是什麼樣子？"
    }
  ]
}