{
  "author": "chris2036",
  "the_new_excerpt": "This is so horrible. I could’ve had bought a car but instead I was greedy and\ngot exactly what I put in. It all started well, the stock I’m taking about is,\nyou guessed it, GME. I got in around $70, I watched it go up and up and always\nbelieved there was more to collect. If I sold at the peak of…",
  "original_created_utc": 1612336328,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这真是太可怕了。我本来可以买一辆车的，但我却贪婪地...\n得到了我投入的东西。开始都很顺利，我拿的股票是。\n你猜对了，GME。我在70美元左右进场，我看着它一直涨，一直涨，总是\n相信还有更多的收藏。如果我在高峰期卖出... ...",
      "title": "错过了五位数的收益"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這真是太可怕了。我本來可以買一輛車的，但我卻貪婪地...\n得到了我投入的東西。開始都很順利，我拿的股票是。\n你猜對了，GME。我在70美元左右進場，我看着它一直漲，一直漲，總是\n相信還有更多的收藏。如果我在高峯期賣出... ...",
      "title": "錯過了五位數的收益"
    }
  ],
  "title": "Missed out on five digits gain",
  "created_utc": 1612373188,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is so horrible. I could’ve had bought a car but instead I was greedy and got exactly what I put in. It all started well, the stock I’m taking about is, you guessed it, GME.\nI got in around $70, I watched it go up and up and always believed there was more to collect. If I sold at the peak of $480, I could’ve had the biggest gains of my life, but I didn’t. I then sold at $90, had some minor gains which were probably equal to the amount of fees I paid. Why didn’t I sell? Because I was greedy. Now I’m really regretting that. Of course, there are people who’ve lost everything on this and I shouldn’t be complaining, but it hurts being denied money because of my own stupidity. It’s not entirely my fault though, the Hedgefonds we’re pulling servere market manipulation. Anyway, I’m pretty depressed and wanted to know if anyone of you guys could offer some advice.</p>\n</div><!-- SC_ON -->",
  "score": 80,
  "permalink": "/r/stocks/comments/lbi38n/missed_out_on_five_digits_gain/",
  "subreddit": "stocks",
  "id": "lbi38n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518541066
}