{
  "author": "Aacrns",
  "the_new_excerpt": "1st Mistake\n\nI was up about 40% for the year of 2019, it was awesome, it was the first full\nyear of working as an engineer and I have put in a bit of money into my\ninvestments. It felt REALLY good to see the growth it has done. Theeeeeen came\nthe covid drop. I sold halfway down the drop, my entire…",
  "original_created_utc": 1612533873,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "第一个错误\n\n我在2019年全年涨了40%左右，太厉害了，这是第一个完整的\n年的工程师工作，我已经投入了一点资金，在我的\n投资。看到它的成长，感觉REALLY不错。Theeeeeen来了\ncovid下降。我卖了一半，我的整个... ...",
      "title": "自我问责]过去一年我犯的2个大错误，以及我从中吸取的教训。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "第一個錯誤\n\n我在2019年全年漲了40%左右，太厲害了，這是第一個完整的\n年的工程師工作，我已經投入了一點資金，在我的\n投資。看到它的成長，感覺REALLY不錯。Theeeeeen來了\ncovid下降。我賣了一半，我的整個... ...",
      "title": "自我問責]過去一年我犯的2個大錯誤，以及我從中吸取的教訓。"
    }
  ],
  "title": "[Self Accountability] 2 BIG mistakes I have made in the past year and lessons I learned from it",
  "created_utc": 1612540099,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>1st Mistake</strong></p>\n\n<p>I was up about 40% for the year of 2019, it was awesome, it was the first full year of working as an engineer and I have put in a bit of money into my investments. It felt REALLY good to see the growth it has done. Theeeeeen came the covid drop. I sold halfway down the drop, my entire brokerage portfolio and Roth IRA for about a 50% gains loss of my ENTIRE time investing. I did this because I believed that it will drop even more, which it did for a some days, but then it went back up, and back up, and back up, and kept going back up. I kept telling myself that it was a dead cat bounce and the market will drop even further than before and it never did. I tried to time the market and got rekt. I didnt even get back into investing late last year so I lost out on a good bit of money if I had just kept everything in.</p>\n\n<p><strong>Lesson:</strong> Timing the market is hard. It is SO much easier to just keep everything in and put MORE money into your positions on red days.</p>\n\n<p><strong>What I am doing now to not repeat the same mistake:</strong> I got back into the game late last year and I will not touch my investments ever again. I have also set aside a 4-ish month emergency fund that I will never touch. I believe part of the reason why I sold during the covid drop was also because I didnt have an emergency fund set aside and I got emotional with my investments. Now even my portfolio drops 50% in 1 day I still have 4 months of living expenses if I lost my job so I would still be carrying out my day to day living normally</p>\n\n<p>&#x200B;</p>\n\n<p><strong>PT 2 IN COMMENTS</strong></p>\n</div><!-- SC_ON -->",
  "score": 3293,
  "permalink": "/r/investing/comments/ld7rwx/self_accountability_2_big_mistakes_i_have_made_in/",
  "subreddit": "investing",
  "id": "ld7rwx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123198814
}