{
  "author": "Toni253",
  "the_new_excerpt": "They will constantly nag you about it, whenever they hear that BTC crashed or\nsomething. They will tell you \"told ya so\" many times. They don't understand\nwhat Crypto is and does, they only know that it is very risky. They don't see\nthe purpose or the value, they only see what their Boomer media…",
  "original_created_utc": 1621842185,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "BTCが暴落したとかいう話を聞くと、そのことをしきりに口にします。\nしてきます。何度も「だから言ったじゃないか」と言われるでしょう。彼らは暗号が何で、何をするものなのかを理解していません。\n暗号が何であるか、何をするものであるかを理解しておらず、非常に危険であることしか知らない。彼らは目的や価値を理解していません。\n目的や価値を理解せず、団塊の世代のメディアだけを見て...",
      "title": "家族や友人にはCryptoに投資したことを言わないでください。信じてください"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "他们会不断地对你唠叨，每当他们听到BTC崩溃或什么的时候。\n什么的。他们会多次告诉你 \"已经告诉你了\"。他们并不了解\nCrypto是什么，做什么，他们只知道它的风险很大。他们没有看到\n的目的或价值，他们只看到他们的潮人媒体...",
      "title": "不要告诉你的家人和朋友你投资于加密货币。相信我"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "他們會不斷地對你嘮叨，每當他們聽到BTC崩潰或什麼的時候。\n什麼的。他們會多次告訴你 \"已經告訴你了\"。他們並不瞭解\nCrypto是什麼，做什麼，他們只知道它的風險很大。他們沒有看到\n的目的或價值，他們只看到他們的潮人媒體...",
      "title": "不要告訴你的家人和朋友你投資於加密貨幣。相信我"
    }
  ],
  "title": "Don't tell your family and friends you invested in Crypto. Trust me",
  "created_utc": 1621860375,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>They will constantly nag you about it, whenever they hear that BTC crashed or something. They will tell you &quot;told ya so&quot; many times. They don&#39;t understand what Crypto is and does, they only know that it is very risky. They don&#39;t see the purpose or the value, they only see what their Boomer media tells them.</p>\n\n<p>Do yourself a favor and keep your investments for yourself, your mental health will thank you.</p>\n\n<p>Edit: I&#39;m glad some of you have a more supportive and understanding family than I do. Unfortunately, not everyone is blessed like that though.</p>\n</div><!-- SC_ON -->",
  "score": 4658,
  "permalink": "/r/CryptoCurrency/comments/njsdkv/dont_tell_your_family_and_friends_you_invested_in/",
  "subreddit": "CryptoCurrency",
  "id": "njsdkv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197385281
}