{
  "author": "lookyonderatthat",
  "original_created_utc": 1625700608,
  "title": "What was on the other side of the world when Pangea was around?",
  "created_utc": 1625716342,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So the biome of water changes as we get farther away from shore. Coastlines have different organisms than the middle of the ocean. Seemingly the farthest “out to sea” you could have ever been on this planet is while Pangea was just formed (unless there were other land masses on the other side of the planet). </p>\n\n<p>Do we know what the ocean was like at the farthest point from land back then? \nWhere would that point be now in relation to current continent placement? Or would it have long since subducted away?</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/askscience/comments/ofuvyu/what_was_on_the_other_side_of_the_world_when/",
  "subreddit": "askscience",
  "id": "ofuvyu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So the biome of water changes as we get farther away from shore. Coastlines have\ndifferent organisms than the middle of the ocean. Seemingly the farthest “out to\nsea” you could have ever been on this planet is while Pangea was just formed\n(unless there were other land masses on the other side of the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "海岸から遠くなるにつれて、水のバイオームが変化するのですね。海岸線には\n海岸線には、海の真ん中とは違う生物がいます。一見、地球上で最も遠い「海の外」にいるように見えますが\nパンゲアが形成されたばかりの頃が、この地球上で最も「海の外」にいたことになります。\nパンゲアが形成されたばかりの頃です（パンゲアの反対側に他の大陸があれば別ですが）。",
      "title": "パンゲアがあった頃、地球の反対側には何があったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，当我们远离海岸时，水的生物群落会发生变化。海岸线有\n与海洋中部的生物不同。在这个星球上，似乎最远的 \"出海 \"是在潘加群岛刚刚形成时。\n你在这个星球上最远的 \"出海 \"是在潘吉亚刚刚形成的时候。\n(除非在另一边有其他的陆块......)",
      "title": "当潘吉亚存在时，世界的另一端是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，當我們遠離海岸時，水的生物羣落會發生變化。海岸線有\n與海洋中部的生物不同。在這個星球上，似乎最遠的 \"出海 \"是在潘加羣島剛剛形成時。\n你在這個星球上最遠的 \"出海 \"是在潘吉亞剛剛形成的時候。\n(除非在另一邊有其他的陸塊......)",
      "title": "當潘吉亞存在時，世界的另一端是什麼？"
    }
  ]
}