{
  "author": "kaasutaja",
  "original_created_utc": 1641847215,
  "title": "Is lying about birth control pills comparable to lying about condoms?",
  "created_utc": 1641864000,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A few days ago there was a thread where somebody confessed he had purposefully poked a hole in his condom and ended up getting the girl pregnant. Commenters pointed out that that could legally be considered a rape since there was no consent for &lt;em&gt;unprotected&lt;/em&gt; sex. So then I started thinking what would happen in the reverse case: A girl claims she&amp;#39;s on birth control but isn&amp;#39;t and might end up pregnant against the wishes and consent of the guy. Could the girl&amp;#39;s act be considered criminal? Obviously an unwanted pregnancy is usually much more disruptive for the girl&amp;#39;s life but it could be harmful for the guy as well, both socially and financially. So how would legal systems tend to handle such cases?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 180,
  "permalink": "/r/NoStupidQuestions/comments/s0txlw/is_lying_about_birth_control_pills_comparable_to/",
  "subreddit": "NoStupidQuestions",
  "id": "s0txlw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "A few days ago there was a thread where somebody confessed he had purposefully\npoked a hole in his condom and ended up getting the girl pregnant. Commenters\npointed out that that could legally be considered a rape since there was no\nconsent for unprotected sex. So then I started thinking what would…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "数日前、あるスレッドで、ある人が、自分が故意にやったことを告白していました。\nコンドームに穴を開け、その女の子を妊娠させてしまった。コメント欄\nという指摘は、法律上、レイプとみなされる可能性があります。\n無防備なセックスに同意している。そこで私は、どうしたら...と考え始めました。",
      "title": "避妊薬に関する嘘は、コンドームに関する嘘に匹敵するのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "几天前，有一个主题，有人承认他故意在安全套上戳了一个洞，结果让女孩怀孕。\n在他的避孕套上戳了一个洞，结果让女孩怀孕了。评论者\n评论者指出，这在法律上可以被认为是强奸，因为没有\n因为没有保护措施的性行为没有得到同意。因此，我开始思考什么是...",
      "title": "关于避孕药的谎言与关于避孕套的谎言有可比性吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "幾天前，有一個主題，有人承認他故意在安全套上戳了一個洞，結果讓女孩懷孕。\n在他的避孕套上戳了一個洞，結果讓女孩懷孕了。評論者\n評論者指出，這在法律上可以被認爲是強姦，因爲沒有\n因爲沒有保護措施的性行爲沒有得到同意。因此，我開始思考什麼是...",
      "title": "關於避孕藥的謊言與關於避孕套的謊言有可比性嗎？"
    }
  ]
}