{
  "author": "ary16",
  "original_created_utc": 1633782425,
  "title": "Why were the Indo-Iranians not interested much in historiographical writing? Neither pre-Islamic Iran nor pre-Islamic India seem to have any historical chronicles unlike those in Greece or China. Why is this so? Is this a case of lost texts or peculiaristic cultural attitudes?",
  "created_utc": 1633805393,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am an Indian, so I know the India side of this debate fairly well. One of the &quot;big questions&quot; here is why we never recorded history or treated it like a science, despite being one of the oldest civilizations on Earth and being relatively very advanced in fields like Grammar/Linguistics or Mathematics or Philosophy. This was not due to a loss of material or inability to keep record, since we preserved much older texts just by oral recitation (c.f - the Rigveda dated to approximately 1200-1500 BCE~ preserved down to the last pitch accent). In fact, our preservation of the Rigveda was so good that modern linguistics relied heavily on it to reconstruct Proto-Indo-European (spoken approx in 3500-4500 BCE). Around 65% of the PIE cognates are reconstructed with the aid of Sanskrit. Now, our scribes managed to preserve enough of Classical Sanskrit literature as well, quite faithfully. It seems as if our Purāṇas combined with our dynastic vaṃśāvalī-s (pseudo historical records of kings) served a quasi-historical role but we never developed the science of historiography. Why?</p>\n\n<p>Note: There is one exception here. Kashmir is the only state in India that does have a fairly faithful historiographic tradition, (c.f - Kalhana, Jonaraja and the Rājātaraṅgini). Any thoughts on this?</p>\n\n<p>Coming to Iran, I know a small bit of Iranian history but not enough. From what I know, our Iranic cousins &amp; neighbors do not have any historical chronicles either (say from the Achaemenid Period). Why is this so? Why do we rely so heavily on Greek or Chinese or Islamic era chronicles for Indo-Iranian history? Is this possibly due to some ancestral cultural attitudes as the Indo-Iranians had almost an identical religion and language when they split apart. Possibly some common revulsion to history as too materialistic? I don&#39;t know, so I ask you all and hope I get some good answers.</p>\n\n<p>Cheers.</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/q4kbwb/why_were_the_indoiranians_not_interested_much_in/",
  "subreddit": "AskHistorians",
  "id": "q4kbwb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I am an Indian, so I know the India side of this debate fairly well. One of the\n\"big questions\" here is why we never recorded history or treated it like a\nscience, despite being one of the oldest civilizations on Earth and being\nrelatively very advanced in fields like Grammar/Linguistics or…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はインド人なので、この議論のインド側の事情をよく知っています。ここでの「大きな疑問」の1つは\nここでの「大きな疑問」の一つは、地球上で最も古い文明の一つであり、科学のように扱われてきたにもかかわらず、なぜ歴史を記録したり\n地球上で最も古い文明の一つであり、文法や言語学などの分野で比較的高度な技術を持っていたにもかかわらず\n地球上で最も古い文明の一つであり、文法や言語学などの分野で比較的高度な技術を持っていたにもかかわらず",
      "title": "なぜインド・イラン人は歴史記述にあまり関心がなかったのか？イスラム教以前のイランもイスラム教以前のインドも、ギリシャや中国のような歴史的年代記はないようです。これはなぜでしょうか？テキストが失われたのか、それとも独特の文化的態度のせいなのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个印度人，所以我对这场辩论中印度方面的情况相当了解。其中一个\n这里的一个 \"大问题 \"是，尽管我们是地球上最古老的文明之一，并且是一个 \"科学\"，但为什么我们从未记录过历史或将其作为一门科学来对待？\n科学，尽管我们是地球上最古老的文明之一，并且在语法/语言学等领域相对非常先进。\n语法/语言学等领域相对非常先进。",
      "title": "为什么印度-伊朗人对历史学写作不大感兴趣？前伊斯兰教的伊朗和前伊斯兰教的印度似乎都没有像希腊或中国那样的历史编年史。为什么会这样呢？这是文本丢失的情况还是特殊的文化态度？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個印度人，所以我對這場辯論中印度方面的情況相當瞭解。其中一個\n這裏的一個 \"大問題 \"是，儘管我們是地球上最古老的文明之一，並且是一個 \"科學\"，但爲什麼我們從未記錄過歷史或將其作爲一門科學來對待？\n科學，儘管我們是地球上最古老的文明之一，並且在語法/語言學等領域相對非常先進。\n語法/語言學等領域相對非常先進。",
      "title": "爲什麼印度-伊朗人對歷史學寫作不大感興趣？前伊斯蘭教的伊朗和前伊斯蘭教的印度似乎都沒有像希臘或中國那樣的歷史編年史。爲什麼會這樣呢？這是文本丟失的情況還是特殊的文化態度？"
    }
  ]
}