{
  "author": "LordCommanderBlack",
  "original_created_utc": 1633702073,
  "title": "Were candles a purely cottage industry in the middle ages? Did monasteries produce them for their local communities? Was there a \"Big Candle\" guild controlling all?",
  "created_utc": 1633717496,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I read about the Teutonic State that a major export was bees wax as was wax a major export of the Russian lands. </p>\n\n<p>Who was buying this raw wax and then producing candles? Were candles cheap enough that a family would buy their needs monthly or yearly or were they very precious and a peasant family would only have a few throughout the year and the majority of candles were used in monasteries or rich manor houses?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/q3yhhl/were_candles_a_purely_cottage_industry_in_the/",
  "subreddit": "AskHistorians",
  "id": "q3yhhl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I read about the Teutonic State that a major export was bees wax as was wax a\nmajor export of the Russian lands.\n\nWho was buying this raw wax and then producing candles? Were candles cheap\nenough that a family would buy their needs monthly or yearly or were they very\nprecious and a peasant family…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "帝政ロシアの主な輸出品が蜜蝋だったように、帝政ロシアの主な輸出品が蜜蝋だったという話を読みました。\nロシアの主要な輸出品であった。\n\n誰がこの生の蝋を買って、蝋燭を製造していたのか。ロウソクは、一家が自分で買うほど安かったのでしょうか？\n一家が毎月または毎年必要なものを購入できるほど安かったのか、それとも非常に貴重で農民の一家が......。\n貴重なものだったのか、それとも農民の家族が...",
      "title": "中世ではキャンドルは純粋な家内工業だった？修道院では地域のために生産していたのでしょうか？また、「大きなろうそく」のギルドがあったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在书中读到，日耳曼国家的主要出口产品是蜂蜡，就像蜡是俄罗斯的主要出口产品一样。\n俄罗斯土地的主要出口产品。\n\n谁在购买这些原蜡，然后生产蜡烛？蜡烛是否便宜\n足够便宜，一个家庭每月或每年都会购买他们所需的蜡烛，还是它们非常珍贵，一个农民家庭\n还是非常珍贵，而农民家庭...",
      "title": "在中世纪，蜡烛是一种纯粹的家庭工业吗？修道院是否为其当地社区生产蜡烛？是否有一个 \"大蜡烛 \"行会来控制所有的蜡烛？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在書中讀到，日耳曼國家的主要出口產品是蜂蠟，就像蠟是俄羅斯的主要出口產品一樣。\n俄羅斯土地的主要出口產品。\n\n誰在購買這些原蠟，然後生產蠟燭？蠟燭是否便宜\n足夠便宜，一個家庭每月或每年都會購買他們所需的蠟燭，還是它們非常珍貴，一個農民家庭\n還是非常珍貴，而農民家庭...",
      "title": "在中世紀，蠟燭是一種純粹的家庭工業嗎？修道院是否爲其當地社區生產蠟燭？是否有一個 \"大蜡燭 \"行會來控制所有的蠟燭？"
    }
  ]
}