{
  "author": "amrgunner1",
  "the_new_excerpt": "The MM probably hired an army of lobbyists to manipulate the decision-makers and\npeople reporting to the white house, telling everybody that GME is going to\ncause another crash, and this is the last thing a new administration wants. They\nfreaked out, and they probably approved what happened\n\n\n\n *…",
  "original_created_utc": 1611874553,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "MM可能雇佣了一支游说者队伍来操纵决策者和\n人报告给白宫，告诉大家GME将是\n导致另一个崩溃，这是新政府最不希望看到的事情。他们\n吓坏了，他们可能批准了发生的事情\n\n\n\n *…",
      "title": "AOC现在是我们唯一的说客了!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "MM可能僱傭了一支遊說者隊伍來操縱決策者和\n人報告給白宮，告訴大家GME將是\n導致另一個崩潰，這是新政府最不希望看到的事情。他們\n嚇壞了，他們可能批准了發生的事情\n\n\n\n *…",
      "title": "AOC現在是我們唯一的說客了!"
    }
  ],
  "title": "AOC is our only lobbyist now!",
  "created_utc": 1611885993,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The MM probably hired an army of lobbyists to manipulate the decision-makers and people reporting to the white house, telling everybody that GME is going to cause another crash, and this is the last thing a new administration wants. They freaked out, and they probably approved what happened</p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Are we harming the economy? NO.. We are building it.</strong></li>\n</ul>\n\n<ol>\n<li>GME now has an inflated valuation .. yes. They will use it to expand and acquire smaller businesses and hire people.. Real economical progress</li>\n<li>They can now pay their debts to creditors</li>\n<li>Individual investors will use their profits to pay their credit card bills, buy a house, buy something.. The money is inside the market.</li>\n<li>Individual investors from all over the world will use their profits to invest in other companies that will increase in value and expand.</li>\n</ol>\n\n<ul>\n<li><strong>We invest differently, They don&#39;t like it</strong></li>\n</ul>\n\n<ol>\n<li>We are young passionate people with our own ideas. We don&#39;t share the same investment routine and style of older generations. We invest in a better future.. We invest in clean energy, Electric vehicles. We don&#39;t invest in shorting small business and crushing peoples dreams</li>\n<li>We don&#39;t play by the wall street rules. We make our own research and our own analysis. we don&#39;t count on the analysis of biased analysts telling us how to invest. They are losing influence and that&#39;s why they are fighting us.</li>\n<li>They benefit from our greed and we also were just benefiting from theirs. They have been making money out of the greed of some of us or sometimes the poor research we do regarding certain investments. We found their greed and we took advantage of it. We are actually doing SEC a favor by exposing the weaknesses of the system.</li>\n<li>We don&#39;t need guidance on how to invest. We are mature people and we know the risk of what we are doing. They allowed retail investors to invest in companies with no products or employees.. some of these companies reached 55Bn in market cap.</li>\n</ol>\n\n<p>More to add</p>\n\n<p>&#x200B;</p>\n\n<p>Why was Blackberry included in the restrictions? Seems very weird.</p>\n\n<p>They have momentum.. not squeezed. They were featured in a lot of articles that they will grow 1000% in 2021. </p>\n\n<p>Looks like someone just added it to the list to drop and benefit from it.</p>\n</div><!-- SC_ON -->",
  "score": 608,
  "permalink": "/r/stocks/comments/l7bm24/aoc_is_our_only_lobbyist_now/",
  "subreddit": "stocks",
  "id": "l7bm24",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518537957
}