{
  "author": "busterrulezzz",
  "original_created_utc": 1642981011,
  "title": "Impermanent loss explained like you are 5 years old, with dragons, unicorns and magical fees",
  "created_utc": 1643013362,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi there, kids!&lt;/p&gt;\n\n&lt;p&gt;I hear you are scared about that bear everyone is talking about. Will it wake up, will it get eaten by a bull? I don&amp;#39;t know. But while we have nothing else to do, why not take the time to learn something new?&lt;/p&gt;\n\n&lt;p&gt;So let&amp;#39;s talk about impermanent loss before nap time.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Imagine I have a dragon, and I want to trade it for a unicorn. Both magical creatures are the same price (because they&amp;#39;re magic).&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I go to the toys store, but they don&amp;#39;t want to buy back my dragon. So I need to find someone who is willing to exchange their unicorn for my dragon. I go to the flea market, and I find a merchant with 50 dragons and 50 unicorns in his stand. &lt;strong&gt;This is the liquidity pool.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;The merchant accept to give me a unicorn if I give him my dragon. But as the merchant has to make a living, he charges me a small fee, about 2.5% of the value of the trade, to accept my proposition. I gladly accept to pay the fee, and I go home with my new unicorn.&lt;/p&gt;\n\n&lt;p&gt;But now, the merchant has a problem : he has 51 dragons and 49 unicorns. If more and more kids want to trade their dragons for unicorns, the imbalance will grow, and the merchant will eventually run out of unicorns. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The merchant needs an equal amount of dragons and unicorns on it&amp;#39;s stand to make good business.&lt;/strong&gt; So he goes to a friend and offer to sell him 1 dragon for a discount - the dragon is worth $10, so the merchant will sell it for $9.95. The friend accept (because that&amp;#39;s what friends are for), he turns around and sell the dragon at full price, netting a profit of $0.05. He then buys a unicorn on the internet for $10, then goes back to the merchant, and sell it to him for $10.05, netting another profit of $0.05 (this is called &lt;em&gt;arbitrage&lt;/em&gt;). The friend has now made $0.10 of profits, the merchant has done $0.15 (the original 2.5% fee he charged me, minus the $0.10 loss from the trades with his friend.) Everybody is happy!&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;That $0.10 loss is what is called impermanent loss. It&amp;#39;s the cost of maintaining the balance between dragons and unicorns on the stand.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Now, of course, if the merchant didn&amp;#39;t charge me that 2.5% fee, he would be losing money. But he does charge a fee, so he ends up doing profits anyway. &lt;/p&gt;\n\n&lt;p&gt;So why are people afraid of impermanent loss? Because if the price of one of the item explodes, and the other item does not, then the losses will be greater. If unicorns are now worth $20, the merchant will incur a greater loss when his friend helps him with the arbitrage. It sucks, and that&amp;#39;s why some people don&amp;#39;t want to be liquidity providers.&lt;/p&gt;\n\n&lt;p&gt;But here is the thing : &lt;strong&gt;fees are almost always more then enough to cover for impermanent loss.&lt;/strong&gt; In our example above, if the price of unicorn doubles and the price of dragons stay the same, impermanent loss will only amount to 5.72%. It doesn&amp;#39;t take much volume for fees to cover this. &lt;/p&gt;\n\n&lt;p&gt;There are a few caveats, tho. If you want to provide liquidity for shitcoins, you will absolutely get rekt if/when the shitcoins value goes to zero. That&amp;#39;s why you should provide liquidity only with tokens you are comfortable holding long-term. Another good thing to keep in mind is that it is way less risky to provide liquidity for a pair that includes a stablecoin, because it&amp;#39;s value will go unchanged. &lt;strong&gt;Some ETH/USDC pools were giving a whopping 200% APR for a few hours yesterday.&lt;/strong&gt; Even if ETH shot up to a ridiculous price tag of $50 000 USD in six months, you will have made more money then if you simply hold.&lt;/p&gt;\n\n&lt;p&gt;Another thing to keep in mind is that &lt;a href=\"https://dailydefi.org/tools/impermanent-loss-calculator/\"&gt;impermanent loss calculators&lt;/a&gt; give you the estimate difference between providing liquidity and hold-only... that is, if you were somehow able to perfectly time the bottom and top of the market. As we know it&amp;#39;s impossible to time the market, those calculators really give you an absolute worst-case scenario.&lt;/p&gt;\n\n&lt;p&gt;Oh, darn, time flies! &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s now nap time, my young friends. Hope you enjoy my story... and I hope you will dream of dragons and unicorns.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 327,
  "permalink": "/r/CryptoCurrency/comments/sb7cnx/impermanent_loss_explained_like_you_are_5_years/",
  "subreddit": "CryptoCurrency",
  "id": "sb7cnx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hi there, kids!\n\nI hear you are scared about that bear everyone is talking about. Will it wake\nup, will it get eaten by a bull? I don't know. But while we have nothing else to\ndo, why not take the time to learn something new?\n\nSo let's talk about impermanent loss before nap time.\n\nImagine I have a…"
}