{
  "author": "CuntyMcGiggles",
  "original_created_utc": 1632058634,
  "title": "As someone who first bought BTC in 2012 for $3…",
  "created_utc": 1632072642,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There’s no fucking way I would have held those coins. I never, ever would have held it until now. Shit, I wouldn’t have held it to $6. For a number of reasons. First of all, at the time bitcoin was used almost entirely for Silk Road purchases. There were exchanges (I’m looking at you Mt Gox and the 45 BTC I lost there) but anyone I knew using bitcoin was only using it to buy drugs online. Really fucking good drugs. </p>\n\n<p>If I hadn’t lost my BTC to Mt Gox and the FBI when they seized all Silk Road wallets, I would absolutely have used it to buy more hash or acid or Hulu passwords. Happily done so. Because for the first time in 15 years I could get clean acid and the idea of it being purchased and delivered to my front door anonymously was a fucking game changer </p>\n\n<p>It’s fun to look back and think “what if”, but the truth is I would have either lost my keys or spent it on something else.</p>\n</div><!-- SC_ON -->",
  "score": 225,
  "permalink": "/r/CryptoCurrency/comments/pr82wg/as_someone_who_first_bought_btc_in_2012_for_3/",
  "subreddit": "CryptoCurrency",
  "id": "pr82wg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "There’s no fucking way I would have held those coins. I never, ever would have\nheld it until now. Shit, I wouldn’t have held it to $6. For a number of reasons.\nFirst of all, at the time bitcoin was used almost entirely for Silk Road\npurchases. There were exchanges (I’m looking at you Mt Gox and the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私があのコインを持っているはずがありません。私は決して、決して持っていなかったでしょう\n今まで持っていなかった。クソ、6ドルまで持っていなかっただろう。 いくつかの理由で。\nまず第一に、当時ビットコインはほとんどシルクロードでの購入にしか使われていなかった。\n購入に使われていました。取引所もありましたが（Mt Goxと...",
      "title": "2012年に初めてBTCを3ドルで購入した者として..."
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我他妈的不可能拿着这些硬币。我从来没有，永远不会\n直到现在。妈的，我不会持有它到6美元，原因有很多。\n首先，当时的比特币几乎完全用于丝绸之路的\n购买。有一些交易所（我在看你Mt Gox和...",
      "title": "作为一个在2012年以3美元首次购买BTC的人..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我他媽的不可能拿着這些硬幣。我從來沒有，永遠不會\n直到現在。媽的，我不會持有它到6美元，原因有很多。\n首先，當時的比特幣幾乎完全用於絲綢之路的\n購買。有一些交易所（我在看你Mt Gox和...",
      "title": "作爲一個在2012年以3美元首次購買BTC的人..."
    }
  ]
}