{
  "author": "TurbulentMoon",
  "original_created_utc": 1626802183,
  "title": "Don’t blow all your money on this dip - it can get much worse.",
  "created_utc": 1626809758,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I first invested in crypto during the 2017 bull run, and I wanted to pass on a lesson I learned the hard way. When the market crashed in early 2018, my immediate response was to buy the dip because I wanted to DCA and recoup my losses. Then the market dipped again and I bought the dip again…then again…then again…then again…you get the picture. By chasing every single dip, I broke the golden rule of crypto - never invest more than you can afford to lose. I financially struggled for a while because of the position I stupidly put myself in.</p>\n\n<p>Have a game plan, space out your money, and be patient. Every time I bought the dip, I thought “Wow, these prices are insane! It can’t get much lower than this.” Well yes, it can go much, much lower.</p>\n</div><!-- SC_ON -->",
  "score": 343,
  "permalink": "/r/CryptoCurrency/comments/oo6rrz/dont_blow_all_your_money_on_this_dip_it_can_get/",
  "subreddit": "CryptoCurrency",
  "id": "oo6rrz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I first invested in crypto during the 2017 bull run, and I wanted to pass on a\nlesson I learned the hard way. When the market crashed in early 2018, my\nimmediate response was to buy the dip because I wanted to DCA and recoup my\nlosses. Then the market dipped again and I bought the dip again…then…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が初めて暗号に投資したのは2017年のブルランの時でしたが、その時に苦労して学んだ教訓を伝えたいと思いました。\n苦労して学んだ教訓を伝えたいと思います。2018年の初めに市場が暴落したとき、私の即答はディップを買うことでした。\nDCAをして自分の資金を回収したかったので、すぐにディップを買いました。\n損失を取り戻したかったからです。その後、市場は再び下落し、私は再びディップを買いました...その後...。",
      "title": "このディップに全財産をつぎ込まないでください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我第一次投资加密货币是在2017年的牛市中，我想把我学到的一个教训传给大家。\n我学到的教训。当市场在2018年初崩溃时，我的\n我的直接反应是买入跌停板，因为我想要DCA并挽回我的损失。\n损失。然后市场再次下跌，我又买入了跌停板...然后...",
      "title": "不要把你所有的钱都花在这次下跌上--情况可能会变得更糟。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我第一次投資加密貨幣是在2017年的牛市中，我想把我學到的一個教訓傳給大家。\n我學到的教訓。當市場在2018年初崩潰時，我的\n我的直接反應是買入跌停板，因爲我想要DCA並挽回我的損失。\n損失。然後市場再次下跌，我又買入了跌停板...然後...",
      "title": "不要把你所有的錢都花在這次下跌上--情況可能會變得更糟。"
    }
  ]
}