{
  "author": "elvislunchbox",
  "original_created_utc": 1635769861,
  "title": "Should I tell my significant other about my crypto gains?",
  "created_utc": 1635786390,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I can’t be the only one with this conflict. We’ve been together almost 3 years. Right before we met, I made a decent investment into crypto. By now, I’ve made good money, but it’s not like I’m rich or anywhere close. I really just want to keep holding and going to work every day as usual. </p>\n\n<p>The reason why I haven’t told her; she is the arbiter of paychecks. Her financial responsibility is similar to if you handed a 9 year old your life savings and sent them into Toys R Us unattended. Money spending and savings is just about the only issue of contention between us. If I showed her the account, I’m afraid of the “conversation” that would follow. </p>\n\n<p>I have to tell her some day, I know. Personally, I don’t think the day is quite near. We might fumble through another crypto crash, but I believe the market has a lot of growing to do. The longer I wait, the more awkward it’s going to be when I finally tell her, but, the larger the account. </p>\n\n<p>I don’t want to start spending all of this money, but I also don’t want to feel like a liar to the woman I’ve been with. I have one friend I’ve told this to. He asks if I even love her, and of course I do. </p>\n\n<p>Were you in my shoes, what would you do?</p>\n</div><!-- SC_ON -->",
  "score": 244,
  "permalink": "/r/CryptoCurrency/comments/qkcy4i/should_i_tell_my_significant_other_about_my/",
  "subreddit": "CryptoCurrency",
  "id": "qkcy4i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I can’t be the only one with this conflict. We’ve been together almost 3 years.\nRight before we met, I made a decent investment into crypto. By now, I’ve made\ngood money, but it’s not like I’m rich or anywhere close. I really just want to\nkeep holding and going to work every day as usual.\n\nThe…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この葛藤を抱えているのは、私だけではないはずです。付き合って3年近くになります。\n出会う直前、私は暗号にまともな投資をしました。今までに、私は\n儲かっていますが、お金持ちになったわけでもなく、それに近い状態でもありません。私は本当にただ\n持ち続けて、いつも通りに毎日仕事に行きたいと思っています。\n\nその...",
      "title": "大切な人に、自分の暗号化された利益を伝えるべきでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不可能是唯一有这种冲突的人。我们在一起已经快3年了。\n就在我们相遇之前，我对加密货币做了一笔体面的投资。到现在，我已经赚了\n到现在，我已经赚了不少钱，但并不是说我很有钱或接近有钱。我真的只想\n继续持有，每天照常上班。\n\n这...",
      "title": "我应该告诉我的另一半我的加密货币收益吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不可能是唯一有這種衝突的人。我們在一起已經快3年了。\n就在我們相遇之前，我對加密貨幣做了一筆體面的投資。到現在，我已經賺了\n到現在，我已經賺了不少錢，但並不是說我很有錢或接近有錢。我真的只想\n繼續持有，每天照常上班。\n\n這...",
      "title": "我應該告訴我的另一半我的加密貨幣收益嗎？"
    }
  ]
}