{
  "author": "otw",
  "the_new_excerpt": "Seeing a lot of Litecoin hate or confusion and just thought I'd give my take as\na crypto hipster.\n\nI have been in to crypto for over ten years. I remember when Litecoin was\nlaunched it was the first alt ever. I didn't really like it and thought it was\nannoying someone was making a fork already. How…",
  "original_created_utc": 1612986755,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "看到很多人对Litecoin的恨意或困惑，我就想把我的看法作为\n一个加密潮人。\n\n我加入加密技术已经超过十年了。我记得当Litecoin\n推出了它是有史以来第一个坛子。我并不喜欢它，认为它是... ...\n恼人的有人在做叉子了。怎么...",
      "title": "我觉得所有的新用户可能都没有看到Litecoin的重要性。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "看到很多人對Litecoin的恨意或困惑，我就想把我的看法作爲\n一個加密潮人。\n\n我加入加密技術已經超過十年了。我記得當Litecoin\n推出了它是有史以來第一個罈子。我並不喜歡它，認爲它是... ...\n惱人的有人在做叉子了。怎麼...",
      "title": "我覺得所有的新用戶可能都沒有看到Litecoin的重要性。"
    }
  ],
  "title": "I feel like all the new users maybe don't see the importance of Litecoin",
  "created_utc": 1613008687,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Seeing a lot of Litecoin hate or confusion and just thought I&#39;d give my take as a crypto hipster.</p>\n\n<p>I have been in to crypto for over ten years. I remember when Litecoin was launched it was the first alt ever. I didn&#39;t really like it and thought it was annoying someone was making a fork already. How would Bitcoin ever get adopted if we just kept making alts?</p>\n\n<p>In a few years I started appreciating it though and realized its similarity to Bitcoin was actually quite nice. The identical code and API meant you could very easily add Litecoin to your application that already supported Bitcoin. When Bitcoin had various issues, congestion, or uncertainty, I could still accept and develop with Litecoin. It doesn&#39;t provide anything too different but there is actually a lot of value in having a fairly similar coin as an alternative and in my opinion it became a more valuable &quot;testnet&quot; than the real testnet.</p>\n\n<p>A few more years and Bitcoin development and discussion became impossible. Barely any of the white paper code progressed because even simple code changes would be surrounded by FUD. I started spending more time talking about code and tech in Litecoin communities and basically a lot of development in Litecoin would pave the way for Bitcoin to accept it. I don&#39;t believe Bitcoin would have ever adopted SegWit without Litecoin implementing it first.</p>\n\n<p>Bitcoin and Litecoin are the only coins that have been in the top ten cryptos for roughly the last ten years. Ethereum is the next closest thing at roughly six years. I have seen literally hundreds of other coins come and go, but Litecoin is always there. As long as Bitcoin is important (which I think it will be just from a first to market and branding perspective) I think Litecoin will be pretty important too for Bitcoin&#39;s success.</p>\n\n<p>Litecoin is currently working on a lot of features I strongly believe will be very important to Bitcoin one day and possibly adopted with MWEB being a pretty big deal in my opinion. The Litecoin community is a bit quiet. They aren&#39;t really about hype pump and dumps or anything, I don&#39;t think you are gonna make a quick buck off it, but I would have some respect for it. It&#39;s a very important part of crypto history and likely its future as well. And if you are really into the tech side, I think it&#39;s a great community to explore without all the mayhem of Bitcoin development.</p>\n\n<p><strong>tl;dr You don&#39;t have to think Litecoin is a great coin or investment, but I think people should have some respect for it and keep an eye on it. It&#39;s a very important part of crypto&#39;s history and future in my opinion.</strong></p>\n\n<p>That&#39;s all, if you have any questions about Litecoin I&#39;d be happy to answering them but some common questions:</p>\n\n<blockquote>\n<p>What makes Litecoin different technically?</p>\n</blockquote>\n\n<p>Really nothing important in my opinion (despite what some pumpers will try to argue). It has what I consider to be minor configuration differences in terms of confirmations with the biggest difference being it uses Scrypt for hashing instead of SHA256. For these differences to matter something pretty drastically bad would have to happen to Bitcoin.</p>\n\n<p>A lot of the more important differences are culturally in the community and development. Litecoin is usually always a bit ahead in development compared to Bitcoin. I actually think because of this is has a lot of value in how similar it is.</p>\n\n<blockquote>\n<p>Didn&#39;t the creator sell all his Litecoin?!</p>\n</blockquote>\n\n<p>I hear this a lot as a bad thing but as someone who follow Charlie Lee pretty closely, I thought this was a really amazing move. He wanted to remove conflict of interest and still continues to develop and progress Litecoin and all crypto despite having little to no stake in it. He also gave up a pretty lucrative job at Coinbase just to focus on Litecoin. Think he&#39;s a great guy who is really one of the last remnants of crypto developers who are really trying to progress the originally message of crypto.</p>\n\n<blockquote>\n<p>Should I buy?!</p>\n</blockquote>\n\n<p>I don&#39;t know I am not really much of a trader. Litecoin has outperformed the vast majority of cryptos for a long long time but has never been too exciting. It&#39;s always just kind of lurking there. I like to put a bit into it monthly along with BTC and ETH but it performs very moderately comparatively. I use it to diversify because I don&#39;t think it will ever really go away and I like to support it since I think it&#39;s very important to Bitcoin and crypto as a whole. I mainly am just interested in the development and don&#39;t have much to say about the price, but I will say it&#39;s under its all time high by quite a bit and has some pretty impressive features coming, so I really wouldn&#39;t think it&#39;s too bad for a long hold for anyone right now.</p>\n\n<blockquote>\n<p>If you are so into development and tech why aren&#39;t you checking out [insert here] coin?</p>\n</blockquote>\n\n<p>I check out most coins that have an interesting tech appeal or angle but I have also seen most of them disappear eventually or have development die down. Litecoin has been a pretty consistent community for me and sticks very close to Bitcoin development where most newer coins differ pretty wildly.</p>\n\n<p>I still think tech oriented alts are very interesting and cool though and from a trading perspective I am sure there is quick money to be made. I am always open to new coins eventually becoming a staple to my reoccurring investments, but right now nothing is beating the staying power of BTC, LTC, and ETH.</p>\n</div><!-- SC_ON -->",
  "score": 227,
  "permalink": "/r/CryptoCurrency/comments/lh24vj/i_feel_like_all_the_new_users_maybe_dont_see_the/",
  "subreddit": "CryptoCurrency",
  "id": "lh24vj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123197398
}