{
  "author": "jeko00000",
  "original_created_utc": 1635278131,
  "title": "So what if this great crypto cycle doesn't have a huge bear market crash?",
  "created_utc": 1635297156,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>What if the bear trap a couple months ago was the end of the 4 year cycle in crypto? What if there is enough attention and users in crypto that this cycle everyone is betting on never happens, that instead we are just in unchartered territory of continuing highs and just little bear traps here and there?</p>\n\n<p>We already know that whales move the market how they want and we&#39;re just along for the ride, and previously they would crash the market to draw in more cash, but now they don&#39;t need to do that?</p>\n\n<p>I dunno. I&#39;m holding 20% cash, and don&#39;t like it, but at the same time everyone is saying bear market is coming, make sure you have cash on hand to accumulate in the bear market.</p>\n\n<p>I&#39;m going to keep up the DCA with my tiny bag, but am hopeful I can cash out or at least have enough cash to make some real gains if it does crash.</p>\n</div><!-- SC_ON -->",
  "score": 178,
  "permalink": "/r/CryptoCurrency/comments/qgeps0/so_what_if_this_great_crypto_cycle_doesnt_have_a/",
  "subreddit": "CryptoCurrency",
  "id": "qgeps0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "What if the bear trap a couple months ago was the end of the 4 year cycle in\ncrypto? What if there is enough attention and users in crypto that this cycle\neveryone is betting on never happens, that instead we are just in unchartered\nterritory of continuing highs and just little bear traps here and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "数ヶ月前のベアトラップが、暗号の4年サイクルの終わりだったとしたら？\n暗号は？もし、暗号に十分な注目とユーザーがいて、このサイクルに\n誰もが賭けているサイクルが起こらず、代わりに高値が続き、小さなベアトラップがあるだけの未知の領域にいるとしたら。\n代わりに、高値が続き、ちょっとしたベアトラップがあるだけの未知の領域にいるとしたら...。",
      "title": "では、この偉大な暗号サイクルが巨大なベアマーケットのクラッシュを起こさないとしたら？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果几个月前的熊市陷阱是加密货币4年周期的结束呢？\n的结束呢？如果加密货币有足够的注意力和用户，而这个周期\n每个人都在押注的周期永远不会发生，相反，我们只是在未知的\n而我们只是在持续的高点和小的熊市陷阱中，并且...",
      "title": "那么，如果这个伟大的加密货币周期没有出现巨大的熊市崩盘呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果幾個月前的熊市陷阱是加密貨幣4年週期的結束呢？\n的結束呢？如果加密貨幣有足夠的注意力和用戶，而這個週期\n每個人都在押注的週期永遠不會發生，相反，我們只是在未知的\n而我們只是在持續的高點和小的熊市陷阱中，並且...",
      "title": "那麼，如果這個偉大的加密貨幣週期沒有出現巨大的熊市崩盤呢？"
    }
  ]
}