{
  "author": "Artistic_Hobby",
  "the_new_excerpt": "I've worked retail for a while and I've noticed that guys are really\nuncomfortable and embarrassed to buy condoms. I'm a girl so maybe that made it\nawkward for them since it was usually the only thing they bought. Buying condoms\nis a great thing. Nothing to be embarrassed about. It means you're…",
  "original_created_utc": 1619150156,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はしばらく小売店で働いていましたが、男性はコンドームを買うのが本当に嫌で恥ずかしいということに気づきました。\nコンドームを買うのを嫌がったり、恥ずかしがったりします。私は女の子なので、もしかしたらそのせいで\n私は女の子なので、コンドームを買うのが唯一の楽しみだったのかもしれませんが、男の人にとっては気まずかったようです。コンドームを買うことは\nは素晴らしいことです。何も恥ずかしいことではありません。それは、あなたが...",
      "title": "なぜ人々はコンドームを買うのが恥ずかしいのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我做过一段时间的零售工作，我注意到男人们在购买安全套时真的是\n感到不自在，对购买安全套感到尴尬。我是个女孩，所以也许这使他们感到尴尬，因为\n尴尬，因为这通常是他们唯一买的东西。买避孕套\n是一件伟大的事情。没有什么可尴尬的。这意味着你是...",
      "title": "为什么人们对购买安全套感到尴尬？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我做過一段時間的零售工作，我注意到男人們在購買安全套時真的是\n感到不自在，對購買安全套感到尷尬。我是個女孩，所以也許這使他們感到尷尬，因爲\n尷尬，因爲這通常是他們唯一買的東西。買避孕套\n是一件偉大的事情。沒有什麼可尷尬的。這意味着你是...",
      "title": "爲什麼人們對購買安全套感到尷尬？"
    }
  ],
  "title": "Why are people embarrassed to buy condoms?",
  "created_utc": 1619161830,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve worked retail for a while and I&#39;ve noticed that guys are really uncomfortable and embarrassed to buy condoms. I&#39;m a girl so maybe that made it awkward for them since it was usually the only thing they bought. Buying condoms is a great thing. Nothing to be embarrassed about. It means you&#39;re going to have a good night and you&#39;re smart enough to protect both you and your partner. They get so awkward that it makes me feel awkward because I don&#39;t know what to say. Usually it&#39;s &quot;Have a good night&quot; when a customer leaves but that just seems like a weird thing to say.</p>\n</div><!-- SC_ON -->",
  "score": 115,
  "permalink": "/r/NoStupidQuestions/comments/mwmr69/why_are_people_embarrassed_to_buy_condoms/",
  "subreddit": "NoStupidQuestions",
  "id": "mwmr69",
  "is_self": true,
  "media": null,
  "is_video": false
}