{
  "author": "SEPE4",
  "original_created_utc": 1640325222,
  "title": "Day Two of using Bitcoin in El Salvador",
  "created_utc": 1640364813,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Shoutout to NixPhenom for replying with really helpful advice. It literally was that easy; just scan the QR code, open the link, input the price of the sale, copy the QR code by tapping, paste it into the invoice prompt on your lightning wallet and then tap &amp;#39;Send&amp;#39;.&lt;/p&gt;\n\n&lt;p&gt;However the process maybe a little different for other restaurants and shops i.e. Pelicanos Restaurante (found at the Atami Escape Resort). They use Wompi to assist them with crypto payments. You scan the QR code, which is a link to their webpage, and you input your personal information, including your passport number. Just use some random 9 digit number for the passport section (or use a fake one found in google images) and feel free to use any name. Then proceed through the process using the instructions stated above. *One thing I should mention about dining at restaurants here is that you don&amp;#39;t wait to be seated. You seat yourself* But I&amp;#39;m still not sure if I&amp;#39;m supposed to wait at my table for the check or if I&amp;#39;m supposed to walk over to the cashier.&lt;/p&gt;\n\n&lt;p&gt;Another thing to note is the fact that not all places accept Bitcoin and not all places advertise the acceptance of Bitcoin even though they do (Pelicanos Restaurante). So you&amp;#39;ll have put those spanish skills to the test and ask around. And there are a few restaurants that aren&amp;#39;t even registered on Google Maps so you&amp;#39;ll have to really search these places out. Cafe Iguana (serves breakfast/ lunch/ dinner; found at 13.4938529, -89.4268991) and some other place found here (13.4966817, -89.4234109). These two places transact on layer 1 of Bitcoin and not layer 2 (lightning), so keep that in mind when calculating fees.&lt;/p&gt;\n\n&lt;p&gt;So there are places in El Zonte and Atami that do accept Bitcoin and I have yet to find a restaurant that accept Bitcoin in El Tunco. I will keep searching and provide updates for as long as I&amp;#39;m here. Day 3 will be a rest day, so don&amp;#39;t expect me to post tomorrow.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 156,
  "permalink": "/r/Bitcoin/comments/rnfh96/day_two_of_using_bitcoin_in_el_salvador/",
  "subreddit": "Bitcoin",
  "id": "rnfh96",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Shoutout to NixPhenom for replying with really helpful advice. It literally was\nthat easy; just scan the QR code, open the link, input the price of the sale,\ncopy the QR code by tapping, paste it into the invoice prompt on your lightning\nwallet and then tap 'Send'.\n\nHowever the process maybe a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "本当に役に立つアドバイスを返信してくれたNixPhenomに喝采を送ります。それは文字通り\nQRコードをスキャンし、リンクを開き、販売価格を入力するだけです。\nQRコードをタップしてコピーし、lightningのインボイスプロンプトに貼り付けます。\nウォレットに入れ、「送信」をタップします。\n\nしかし、このプロセスはもしかしたら...。",
      "title": "エルサルバドルでビットコインを使った2日目"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "感谢NixPhenom的回复，提供了非常有用的建议。这实际上是\n就这么简单；只要扫描二维码，打开链接，输入销售价格。\n通过点击复制二维码，将其粘贴到你的闪电钱包的发票提示中。\n钱包，然后点击 \"发送\"。\n\n然而，这个过程可能是一个...",
      "title": "在萨尔瓦多使用比特币的第二天"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "感謝NixPhenom的回覆，提供了非常有用的建議。這實際上是\n就這麼簡單；只要掃描二維碼，打開鏈接，輸入銷售價格。\n通過點擊複製二維碼，將其粘貼到你的閃電錢包的發票提示中。\n錢包，然後點擊 \"發送\"。\n\n然而，這個過程可能是一個...",
      "title": "在薩爾瓦多使用比特幣的第二天"
    }
  ]
}