{
  "author": "Ditka_in_your_Butkus",
  "the_new_excerpt": "I’m currently watching the documentary World War 1 Apocalypse, which has some\nunbelievable combat footage, such as artillery barrages, “over the top” charges,\nAnzacs hitting Gallipoli beaches, etc.; however, it looks like it could be\nstaged or a reenactment. With the camera technology during that…",
  "original_created_utc": 1622113272,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今、第一次世界大戦のドキュメンタリー映画「アポカリプス」を見ています。\n砲撃や「オーバー・ザ・トップ」と呼ばれる突撃など、信じられないような戦闘映像があります。\n砲撃、オーバートップ、ガリポリの海岸を叩くアンザックスなど、信じられないような戦闘映像がありますが、これは演出や再現のようにも見えます。\n演出や再現のようにも見えます。当時のカメラの技術では...",
      "title": "第一次世界大戦の戦闘映像の中で、本物と演出の違いはどこにあるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我目前正在观看纪录片《第一次世界大战的启示》，其中有一些令人难以置信的战斗镜头。\n令人难以置信的战斗画面，如大炮轰击、\"越级 \"冲锋。\nAnzacs打到加利波利海滩等；然而，它看起来可能是\n然而，它看起来可能是上演的或重演的。以当时的摄像技术，...",
      "title": "在现有的一战战斗录像中，有多少是真实的，有多少是上演的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我目前正在觀看紀錄片《第一次世界大戰的啓示》，其中有一些令人難以置信的戰鬥鏡頭。\n令人難以置信的戰鬥畫面，如大炮轟擊、\"越級 \"衝鋒。\nAnzacs打到加利波利海灘等；然而，它看起來可能是\n然而，它看起來可能是上演的或重演的。以當時的攝像技術，...",
      "title": "在現有的一戰戰鬥錄像中，有多少是真實的，有多少是上演的？"
    }
  ],
  "title": "How much of the available World War 1 combat footage is authentic vs. staged?",
  "created_utc": 1622141059,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m currently watching the documentary World War 1 Apocalypse, which has some unbelievable combat footage, such as artillery barrages, “over the top” charges, Anzacs hitting Gallipoli beaches, etc.; however, it looks like it could be staged or a reenactment.  With the camera technology during that time, I’m wondering how feasible it would be to film combat, and if the scenes I am seeing are in fact real.</p>\n</div><!-- SC_ON -->",
  "score": 111,
  "permalink": "/r/AskHistorians/comments/nm4wcd/how_much_of_the_available_world_war_1_combat/",
  "subreddit": "AskHistorians",
  "id": "nm4wcd",
  "is_self": true,
  "media": null,
  "is_video": false
}