{
  "author": "AdmiralAkbar1",
  "original_created_utc": 1641947001,
  "title": "Many ancient polytheist religions are presented today as having a single widely accepted pantheon, mythology, etc. in their heyday like modern religions. Is this accurate, or were they more like disjointed and inconsistent local cults whose stories were merged and codified after the fact?",
  "created_utc": 1641957553,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;To clarify: A lot of ancient European and Mediterranean religions are taught like they had a consistent pantheon, in terms of the gods involved, their relations with one another, and their history. Zeus is the god of thunder, slayer of Kronos, brother-husband of Hera, and father of Heracles. Frigg is the wife of Odin and mother of Baldur. Horus is the falcon-headed son of Osiris and Isis, and the slayer of Set.&lt;/p&gt;\n\n&lt;p&gt;However, I know that in the case of many Near Eastern religions, there was never really a unified mythology, and was instead a loose collection of city cults with varying degrees of syncretism with one another. Was this ever the case too with European religions? Were there swathes of ancient Greece who had no clue who the hell the Titans were, or that Zeus and Ares were related? Did the priests of Set have a narrative for their god &lt;em&gt;sans&lt;/em&gt; duel with Horus?&lt;/p&gt;\n\n&lt;p&gt;If that is the case, then when did the modern codifications develop? Was it done by outside historians compiling all the myths? One state imposing its rule (and subsequently their own interpretation of religion) upon the rest of the people? Modern historians trying to codify a confusing subject?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/s1s4mv/many_ancient_polytheist_religions_are_presented/",
  "subreddit": "AskHistorians",
  "id": "s1s4mv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "To clarify: A lot of ancient European and Mediterranean religions are taught\nlike they had a consistent pantheon, in terms of the gods involved, their\nrelations with one another, and their history. Zeus is the god of thunder,\nslayer of Kronos, brother-husband of Hera, and father of Heracles. Frigg…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "明確にすること。古代ヨーロッパと地中海の宗教の多くは、その教えの中で\n関係する神々、その神々が一貫したパンテオンを持っていたかのような\n互いの関係や歴史など。ゼウスは雷神です。\nクロノスの殺害者、ヘラの兄・夫、ヘラクレスの父。フリッグ...",
      "title": "古代の多神教の多くは、現代宗教のように全盛期には一つのパンテオン、神話などが広く受け入れられていたと今日紹介されています。それとも、バラバラで一貫性のないローカルなカルトを、後から合体させて成文化したようなものだったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "要说明的是。很多古代欧洲和地中海的宗教都被教导说\n好像他们有一个一致的万神殿，就所涉及的神灵而言，他们的\n彼此之间的关系以及他们的历史。宙斯是雷神。\n克罗诺斯的杀手，赫拉的丈夫和兄弟，赫拉克勒斯的父亲。弗里格...",
      "title": "许多古代多神教今天被介绍为在其全盛时期像现代宗教一样拥有一个被广泛接受的万神殿、神话等。这是否准确，还是说它们更像是不连贯、不一致的地方邪教，其故事在事后被合并和编纂？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "要說明的是。很多古代歐洲和地中海的宗教都被教導說\n好像他們有一個一致的萬神殿，就所涉及的神靈而言，他們的\n彼此之間的關係以及他們的歷史。宙斯是雷神。\n克羅諾斯的殺手，赫拉的丈夫和兄弟，赫拉克勒斯的父親。弗裏格...",
      "title": "許多古代多神教今天被介紹爲在其全盛時期像現代宗教一樣擁有一個被廣泛接受的萬神殿、神話等。這是否準確，還是說它們更像是不連貫、不一致的地方邪教，其故事在事後被合併和編纂？"
    }
  ]
}