{
  "author": "AdmiralAkbar1",
  "original_created_utc": 1641947001,
  "title": "Many ancient polytheist religions are presented today as having a single widely accepted pantheon, mythology, etc. in their heyday like modern religions. Is this accurate, or were they more like disjointed and inconsistent local cults whose stories were merged and codified after the fact?",
  "created_utc": 1641957553,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;To clarify: A lot of ancient European and Mediterranean religions are taught like they had a consistent pantheon, in terms of the gods involved, their relations with one another, and their history. Zeus is the god of thunder, slayer of Kronos, brother-husband of Hera, and father of Heracles. Frigg is the wife of Odin and mother of Baldur. Horus is the falcon-headed son of Osiris and Isis, and the slayer of Set.&lt;/p&gt;\n\n&lt;p&gt;However, I know that in the case of many Near Eastern religions, there was never really a unified mythology, and was instead a loose collection of city cults with varying degrees of syncretism with one another. Was this ever the case too with European religions? Were there swathes of ancient Greece who had no clue who the hell the Titans were, or that Zeus and Ares were related? Did the priests of Set have a narrative for their god &lt;em&gt;sans&lt;/em&gt; duel with Horus?&lt;/p&gt;\n\n&lt;p&gt;If that is the case, then when did the modern codifications develop? Was it done by outside historians compiling all the myths? One state imposing its rule (and subsequently their own interpretation of religion) upon the rest of the people? Modern historians trying to codify a confusing subject?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/s1s4mv/many_ancient_polytheist_religions_are_presented/",
  "subreddit": "AskHistorians",
  "id": "s1s4mv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "To clarify: A lot of ancient European and Mediterranean religions are taught\nlike they had a consistent pantheon, in terms of the gods involved, their\nrelations with one another, and their history. Zeus is the god of thunder,\nslayer of Kronos, brother-husband of Hera, and father of Heracles. Frigg…"
}