{
  "author": "CryptoMaximalist",
  "original_created_utc": 1628180062,
  "title": "Reduce the karma value by 50% for the daily discussion threads",
  "created_utc": 1628191834,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have a few issues about daily discussion threads. I&#39;ll state those issues, the decision is up to you.</p>\n\n<p>&#x200B;</p>\n\n<ol>\n<li>They have huge effect on distributions: Daily threads receive tens  of thousands comments in a single day and approximately 750.000 comments  in a month. According to my calculations (*not certain) they receive  between 1/3 - 1/2 moons of the total distribution. <strong>Numbers are based on my calculation. They can be wrong or right and they&#39;ll be change based on the activity.</strong></li>\n<li>Issue: Upvote parties. Upvote parties occur so often in the daily  threads. Moderators do their best but it&#39;s almost impossible to moderate  a thread that receives 25-35k comments in a day. Most of those upvote  parties remain unreported, even if they get reported the report result  comes a little bit late due to volume of the sub, so even if they  comment gets removed, their upvotes still stay with them.</li>\n<li>Spam problem: This thread gets so much spam (shitcoin shills - ads -  karma farming etc.). Again, most of those spams remain unreported and  again, mods doing their best but it&#39;s almost impossible to moderate a  thread that receives 25-35k comments in a single day.  For reference, if the daily was its own subreddit, it would be in the top 5 subreddits for comments per day.</li>\n<li>Off-topic posting: Off-topic posting is against the daily thread  rules but still people keep commenting off-topic. This is also  impossible to moderate due to high volume of comments. </li>\n<li>Moon farmers: There are a lot of them. Some of them posts hundreds  of comments in a day and some of them receive hundreds of karma in a  single day from daily threads. This is a big problem. <strong>Moon farmers especially choose daily discussion threads because the comment karma gets 2x (double) karma</strong>. You can see them everyday in those threads with their hundreds of comments. Every. Single. Day.</li>\n</ol>\n\n<p>My solution: <strong>Reduce the karma by 50% for the daily threads.</strong>  This will reduce the incentives for moon farmers and the volume of comments, so moderators can moderate more effective. This also will help  balance the moons ratio. Thanks.</p>\n\n<p>&lt;Posted on behalf of the original author per their request&gt;</p>\n\n<p><a href=\"https://www.reddit.com/poll/oylpp9\">View Poll</a></p>\n</div><!-- SC_ON -->",
  "score": 521,
  "permalink": "/r/CryptoCurrency/comments/oylpp9/reduce_the_karma_value_by_50_for_the_daily/",
  "subreddit": "CryptoCurrency",
  "id": "oylpp9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I have a few issues about daily discussion threads. I'll state those issues, the\ndecision is up to you.\n\n\n\n 1. They have huge effect on distributions: Daily threads receive tens of\n    thousands comments in a single day and approximately 750.000 comments in a\n    month. According to my calculations…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "毎日のディスカッション・スレッドについて、いくつかの問題があります。その問題点を述べると、その\n判断はあなた次第です。\n\n\n\n 1. ディストリビューションに大きな影響を与える。毎日のスレッドには数万のコメントが\n    一日で数万、一ヶ月で約75万のコメントがつきます。\n    1ヶ月で約75万件のコメントがつきます。私の計算によると...",
      "title": "毎日のディスカッション・スレッドのカルマ値を50％削減"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我对每日讨论线程有一些问题。我将陈述这些问题，决定权在你。\n决定权在你们手中。\n\n\n\n 1. 他们对分配有巨大的影响。每天的主题会收到数以万计的\n    每天都有数以万计的评论，一个月大约有750.000条评论。\n    月的评论。根据我的计算...",
      "title": "将每日讨论主题的业力值减少50%。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我對每日討論線程有一些問題。我將陳述這些問題，決定權在你。\n決定權在你們手中。\n\n\n\n 1. 他們對分配有巨大的影響。每天的主題會收到數以萬計的\n    每天都有數以萬計的評論，一個月大約有750.000條評論。\n    月的評論。根據我的計算...",
      "title": "將每日討論主題的業力值減少50%。"
    }
  ]
}