{
  "author": "tehcheez",
  "the_new_excerpt": "I'm not going into any extreme detail for privacy reasons.\n\n\n\nLong story short I work at a MSP and my boss knows my background with crypto and\nmining. He got the plug on some Dell OEM RTX cards, we setup a small 6 card rig,\nlife is good. He loves it, I loved the project, and it's some spare cash…",
  "original_created_utc": 1615268035,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "出于隐私的原因，我不会说到任何极端的细节。\n\n\n\n长话短说，我在一家MSP工作，我的老板知道我的背景与加密和\n采矿。他得到了一些戴尔OEM RTX卡的插头，我们设置了一个小的6卡装备。\n生活是美好的。他喜欢，我喜欢这个项目，而且是一些闲钱... ...",
      "title": "NFT所吸引的 \"艺术 \"人士，是我所接触过的最糟糕、最愚蠢的人。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "出於隱私的原因，我不會說到任何極端的細節。\n\n\n\n長話短說，我在一家MSP工作，我的老闆知道我的背景與加密和\n採礦。他得到了一些戴爾OEM RTX卡的插頭，我們設置了一個小的6卡裝備。\n生活是美好的。他喜歡，我喜歡這個項目，而且是一些閒錢... ...",
      "title": "NFT所吸引的 \"藝術 \"人士，是我所接觸過的最糟糕、最愚蠢的人。"
    }
  ],
  "title": "The \"art\" people that NFTs have attracted are some of the worst and dumbest people I've ever interacted with.",
  "created_utc": 1615293127,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m not going into any extreme detail for privacy reasons. </p>\n\n<p>&#x200B;</p>\n\n<p>Long story short I work at a MSP and my boss knows my background with crypto and mining. He got the plug on some Dell OEM RTX cards, we setup a small 6 card rig, life is good. He loves it, I loved the project, and it&#39;s some spare cash being made. However, it&#39;s now the hot scoop in our little town that we can setup mining rigs and everyone wants one. No problem, you pay for the parts, we setup them up.</p>\n\n<p>&#x200B;</p>\n\n<p>Through all this happening one of our clients has a client that&#39;s very involved in the art and music space and wants to hit it big with NFTs. It&#39;s gotten to the point that we&#39;re having meetings with attorneys and shit to get the legal stuff worked out, they want to add me to a LLC where I get a 5% cut, etc. I just don&#39;t like any of this at all. I work a full time job at the MSP and then run an online gun shop when I get home. I barely have any time for myself as it is, I don&#39;t need another project. But this isn&#39;t the worst...</p>\n\n<p>&#x200B;</p>\n\n<p>These artists are some of the dumbest and ignorant people I&#39;ve ever met. They think that because they&#39;ve sold art for $2,000 a print they can create a $2,000 NFT and are absolutely baffled when nobody is bidding on it. We tried setting them up on WAX using AtomicHub since that seemed like the easiest to understand. Make a wallet, inside the wallet it gives you links to purchase WAX with a credit card, bid/buy NFTs with WAX, little to no gas, instant transactions. They stated that was too hard to understand and &quot;Other artists are using Rarible and OpenSea&quot;. We have a meeting with them tomorrow to show them how it works and I know it&#39;s going to be a shit show.</p>\n\n<p>&#x200B;</p>\n\n<p>TL:DR: I&#39;m ranting because I was having fun mining a little, taking some chances with shit coins, and trading some deadmau5 NFTs. Now I have to deal with dumbass art people that want to be even richer than they are that don&#39;t know jack shit about crypto but they heard NFTs are hot and want to make money now.  </p>\n\n<p>PS, I think NFTs are dumb as fuck and I&#39;m only trading them right now because WAX is fucking mooning.</p>\n</div><!-- SC_ON -->",
  "score": 207,
  "permalink": "/r/CryptoCurrency/comments/m0zsji/the_art_people_that_nfts_have_attracted_are_some/",
  "subreddit": "CryptoCurrency",
  "id": "m0zsji",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542573506
}