{
  "author": "Bize97",
  "the_new_excerpt": "I recently joined the crypto community in Reddit and I can honestly say it is\none of the most informative and helpful communities out there. This subreddit in\nparticular always brings awareness for new comers and reassurance about dips so\npeople don’t panic sell. I think this is important as it…",
  "original_created_utc": 1615037418,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我最近加入了Reddit的加密社区，我可以诚实地说，它是\n最丰富的信息和最有帮助的社区之一。这个子reddit在\n特别是总能给新来者带来认识和保证，使他们对跌倒的情况有所了解。\n人们不慌不忙地卖。我认为这很重要，因为它... ...",
      "title": "这个分红区比你意识到的更重要。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近加入了Reddit的加密社區，我可以誠實地說，它是\n最豐富的信息和最有幫助的社區之一。這個子reddit在\n特別是總能給新來者帶來認識和保證，使他們對跌倒的情況有所瞭解。\n人們不慌不忙地賣。我認爲這很重要，因爲它... ...",
      "title": "這個分紅區比你意識到的更重要。"
    }
  ],
  "title": "This subreddit is more important than you realise.",
  "created_utc": 1615059031,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I recently joined the crypto community in Reddit and I can honestly say it is one of the most informative and helpful communities out there. This subreddit in particular always brings awareness for new comers and reassurance about dips so people don’t panic sell. I think this is important as it allows people to actually understand how the markets work and genuinely decreases stress levels of individuals who may panic without this reassurance. </p>\n\n<p>Also, the information I have learned is incredible. I have found out about new technologies, new ideas, new coins with unique features and it’s like I’m learning about the future and what will eventually be common knowledge like the internet is today. </p>\n\n<p>I just want to say thank you to everyone. Even the memes are needed now and then to add laughter and jokes to what would otherwise be a very serious community. </p>\n\n<p>I spoke about crypto to some people at work and no one knew about this Reddit page or the Reddit crypto community, and I want to say if you are here and reading this you have no idea how early and ahead of the game we are. The vast majority don’t know we exist, and they definitely don’t know how much knowledge we pass on to other and that is the most valuable thing. Thanks everyone for your help you’ve given me, and no doubt will carry on giving.</p>\n</div><!-- SC_ON -->",
  "score": 243,
  "permalink": "/r/CryptoCurrency/comments/lz1m4z/this_subreddit_is_more_important_than_you_realise/",
  "subreddit": "CryptoCurrency",
  "id": "lz1m4z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542572111
}