{
  "author": "psychotrader00",
  "the_new_excerpt": "PsychoMarket Recap - Friday, May 14, 2021\n\nStocks continued yesterday’s momentum, with the S&P 500 (SPY) closing 1.51% up,\nthe tech-heavy Nasdaq (QQQ) closed 2.21% up, while the Dow Jones (DIA) closed\n1.11% up. The price action this week has been nothing short of remarkable, with\nthe market selling…",
  "original_created_utc": 1621024967,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "PsychoMarket Recap - 2021年5月14日（金\n\n株価は昨日の勢いを維持し、S&P500(SPY)は1.51%上昇して終了した。\nまた、ハイテク株の多いナスダック（QQQ）は2.21％上昇して引け、ダウ・ジョーンズ（DIA）は\n1.11%の上昇となりました。今週の値動きは目を見張るものがありました。\n市場では売りが...",
      "title": "本日、2021年5月14日(金)のマーケット・リカップをご紹介します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "心理市场回顾--2021年5月14日，星期五\n\n股市延续了昨天的势头，标普500指数（SPY）收盘上涨1.51%。\n科技股的纳斯达克指数（QQQ）收盘上涨2.21%，而道琼斯指数（DIA）收盘上涨\n1.11%的涨幅。本周的价格走势不可谓不精彩，其中\n市场销售...",
      "title": "以下是今天（2021年5月14日，星期五）的市场回顾"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "心理市場回顧--2021年5月14日，星期五\n\n股市延續了昨天的勢頭，標普500指數（SPY）收盤上漲1.51%。\n科技股的納斯達克指數（QQQ）收盤上漲2.21%，而道瓊斯指數（DIA）收盤上漲\n1.11%的漲幅。本週的價格走勢不可謂不精彩，其中\n市場銷售...",
      "title": "以下是今天（2021年5月14日，星期五）的市場回顧"
    }
  ],
  "title": "Here is a Market Recap for today Friday, May 14, 2021",
  "created_utc": 1621047051,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>PsychoMarket Recap - Friday, May 14, 2021</strong></p>\n\n<p>Stocks continued yesterday’s momentum, with the S&amp;P 500 (SPY) closing 1.51% up, the tech-heavy Nasdaq (QQQ) closed 2.21% up, while the Dow Jones (DIA) closed 1.11% up. The price action this week has been nothing short of remarkable, with the market selling off in the first three days of the week before recovering Thursday and Friday. In my view, this week was like a battle between the inflationary fears spooking market participants that the Fed will tighten rates sooner than expected while the April Job report, which greatly missed estimates and marked a sharp deceleration in job growth compared to March bolstered confidence in the Fed’s commitment to maintaining monetary policy accommodative until it sees a “string” of strong labor reports like the one in March. While I said all week that I thought the initial sell-off was an overreaction (and it seems to be that way judging from the last two days), short-term volatility may continue going into next week, too early to tell if the market is beginning a new uptrend or is just bouncing.  </p>\n\n<p>On Wednesday, the Bureau of Labor Statistics reported that the consumer price index (CPI), which measures a basket of goods as well as energy and housing costs, rose 4.2% from a year ago, compared to the Dow Jones estimate for a 3.6% increase. The monthly gain was 0.8%, against the expected 0.2%. Excluding the volatile food and energy prices, the core CPI (this is the main measure of inflation) increased 3% compared to the same period in 2020 and 0.9% on a monthly basis. The respective estimates were 2.3% and 0.3%. </p>\n\n<p>Yesterday, the producer price index (PPI), which measures the average changes in prices received by domestic producers for their output, rose 6.2% compared to April 2020 and 0.6% monthly increase. The core PPI, which excludes volatile items like food and energy rose 4.6% year over year and 0.7% in April. Economists polled by FactSet were expecting a 0.3% monthly increase in April and 3.8% year over year. This is the biggest jump since 2014. In tandem with the CPI report, this shows prices for both consumers and producers have increased more than expected. </p>\n\n<p>However, while the readings in inflation definitely are not good, it is important to note that Federal Reserve Chair Jerome Powell has consistently reiterated he expects any rise in inflation to be “transitory” as the economy continues to recover from the March and bottom and want to see a “string” of strong labor reports totaling 1 million before. Talking about the March Job report, Powell said, “We want to see a string of months like that [like in March] so we can really begin to show progress toward our goals. We just need to keep reminding ourselves that even though some parts of the economy are starting just great, there’s a very large group of people who are not.” The April Job Report bolsters Powell’s argument that large segments that the Federal Reserve will move slowly in changing policy. </p>\n\n<p>In addition, at a separate event in April, Powell said that quantitative easing would likely taper “well before” the interest rate is increased. He said, “We will reach the time at which we will taper asset purchases when we have made substantial further progress towards our goals from last December. That would in all likelihood be before, well before, the time we would consider raising interest rates. We have not voted on that order but that is the sense of the guidance.” In short, while the inflationary readings are not great, I’m fairly confident fears that the Federal Reserve will tighten policy sooner-than-expected are overblown. Just my two cents. </p>\n\n<p><strong>Highlights</strong></p>\n\n<ul>\n<li>The Labor Department Released its Weekly Unemployment Report\n\n<ul>\n<li><strong>Initial jobless claims:</strong> 473,000 vs. 490,000 expected and 507,000 the previous week</li>\n<li><strong>Continuing claims:</strong> 3.655 million vs. 3.650 million expected and 3.7 million the previous week</li>\n</ul></li>\n<li>Taiwan Semiconductor Manufacturing (TSM) is weighing plans to pump tens of billions of dollars more into cutting-edge chip factories in the U.S. state of Arizona than it had previously disclosed, according to Reuters. TSM previously announced it would invest $10 to $12 billion to build a chip factory in Phoenix. </li>\n<li>A bipartisan group of U.S. senators is expected to unveil a $52 billion proposal on Friday that would significantly boost U.S. semiconductor chip production and research over five years, sources briefed on the matter told Reuters.</li>\n<li>Nio Life, the EV maker&#39;s unit focused on lifestyle products, has opened a flagship store on Alibaba&#39;s Tmall platform. Tmall is Alibaba’s business-to-consumer eCommerce platform, where local Chinese and international businesses sell branded goods to consumers in Greater China.</li>\n<li>Disney (DIS) notably underperformed the market after the earnings report showed disappointing subscriber growth in Q1 2021</li>\n<li>AMC Entertainment Holdings Inc has raised about $428 million from a share sale, capitalizing on the retail-trading driven surge in its stock earlier this year. The company said it sold 43 million shares at an average price of $9.94 apiece in the at-the-market offering, sending the stock sharply higher.</li>\n<li>Executive Chairman of Ford (F) Bill Ford signaled that automaker plans to reinstate the dividend it suspended last year, though he gave no timeline. &quot;We will do it as soon as possible, but we also want to make sure that when we do it, that we can sustain it.”</li>\n<li><strong>**Please note that current stock price was written during the market session and may not reflect the closing price*\\</strong>*</li>\n<li>RedRock Resorts (RRR) target raised by JP Morgan from $47 to $48 at Overweight. Stock currently around $41</li>\n<li>GoodRX (GDRX) target raised by Citigroup from $53 to $70 at Buy. Stock currently around $31</li>\n<li>Airbnb (ABNB) target raised by Credit Suisse from $162 to $164 at Neutral. Stock currently around $141</li>\n<li>YETI with a host of target raises. Consensus price target $105 at Buy. Stock currently around $88.5</li>\n<li>Lowe’s (LOW) target raised by Jefferies Financial Grouyp from $200 to $247 at Buy. Stock currently around $199</li>\n<li>IQVIA (IQV) target raised by KeyCorp from $255 to $260 at Overweight. Stock currently around $234</li>\n<li>Target (TGT) target raised by Telsey Advisory Group from $215 to $235 at Outperform. Stock currently around $211</li>\n<li>Home Depot (HD) target raised by Jefferies Financial Group from $325 to $374 at Buy. Stock currently around $323</li>\n<li>Cigna (CI) target raised by the Royal Bank of Canada from $265 to $304 at Outperform. Stock currently around $264</li>\n<li>AMC target raised by B. Riley from $13 to $16 at Buy. Stock currently around $12.75</li>\n</ul>\n\n<p>“Yesterday is history, tomorrow is a mystery, but today is a gift, that’s why it’s called the present.” - Master Oogway</p>\n</div><!-- SC_ON -->",
  "score": 97,
  "permalink": "/r/stocks/comments/ncihqg/here_is_a_market_recap_for_today_friday_may_14/",
  "subreddit": "stocks",
  "id": "ncihqg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590803296
}