{
  "author": "Motherfu69erJones",
  "original_created_utc": 1628357537,
  "title": "If you bought ETH at $379 a year ago and held through $4300 chances are you'll never sell",
  "created_utc": 1628404882,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Pretty much the title. If you bought ETH at 380 bucks and didnt sell at the top I congratulate you for having balls so big you may need a trolley to carry them around the city, but chances are you&#39;ll be taking those ETH alongside you to the grave.        </p>\n\n<p>Just hope that people are objective enough to at least cash out some profit so in case things go tits up you wont be left with empty pockets and blue balls. Thx for coming to my TED talk.</p>\n</div><!-- SC_ON -->",
  "score": 196,
  "permalink": "/r/CryptoCurrency/comments/ozxkoe/if_you_bought_eth_at_379_a_year_ago_and_held/",
  "subreddit": "CryptoCurrency",
  "id": "ozxkoe",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Pretty much the title. If you bought ETH at 380 bucks and didnt sell at the top\nI congratulate you for having balls so big you may need a trolley to carry them\naround the city, but chances are you'll be taking those ETH alongside you to the\ngrave.\n\nJust hope that people are objective enough to at…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "かなりのタイトルですね。ETHを380ドルで買って、頂点で売らなかった人は\n街中で運ぶのにトロッコが必要なほど大きなボールを持っていることを祝福します。\n街中で運ぶのにトロッコが必要になるほどの大きな玉を持っていることを祝福しますが、おそらくそのETHを墓場まで持っていくことになるでしょう。\n墓場まで持っていくことになります。\n\nただ、人々が十分に客観的であることを望みます。",
      "title": "1年前にETHを379ドルで購入し、4300ドルまで保有した人は、絶対に売らないでしょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "差不多是这个题目。如果你在380美元时买入ETH而没有在顶部卖出\n我祝贺你有这么大的球，你可能需要一个手推车来携带它们\n但有可能你会带着这些ETH一起去看电影。\n坟墓。\n\n只希望人们能客观地看待这些问题，以...",
      "title": "如果你一年前在379美元买入ETH，并持有至4300美元，那么你有可能永远不会卖出。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "差不多是這個題目。如果你在380美元時買入ETH而沒有在頂部賣出\n我祝賀你有這麼大的球，你可能需要一個手推車來攜帶它們\n但有可能你會帶着這些ETH一起去看電影。\n墳墓。\n\n只希望人們能客觀地看待這些問題，以...",
      "title": "如果你一年前在379美元買入ETH，並持有至4300美元，那麼你有可能永遠不會賣出。"
    }
  ]
}