{
  "author": "nothingzisisrealz",
  "original_created_utc": 1649712807,
  "title": "Those of us who started investing and hodling last year must all be down at least ~30%",
  "created_utc": 1649719842,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Is there anyone in this sub that has actually made a ‘profit’?&lt;/p&gt;\n\n&lt;p&gt;What an utter fucking disappointment. The more I spend time in this space, the more stupid I fucking feel. I am going to wait a full year before most probably liquidating everything and just get pleasure from being able to call the rest of y’all idiots over at &lt;a href=\"/r/buttcoin\"&gt;r/buttcoin&lt;/a&gt;. &lt;/p&gt;\n\n&lt;p&gt;I so wish I was wrong, but it more and more feels like the early glory days are over and I am caught up in an elaborate scam. I can’t tell anyone to invest in crypto with a straight face. What a terrible investment, could have made more $ with a shitty savings account, and the time I wasted (and continue to waste), that’s the true tragedy.&lt;/p&gt;\n\n&lt;p&gt;cue the sycophants…&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 626,
  "permalink": "/r/CryptoCurrency/comments/u1i9ej/those_of_us_who_started_investing_and_hodling/",
  "subreddit": "CryptoCurrency",
  "id": "u1i9ej",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Is there anyone in this sub that has actually made a ‘profit’?\n\nWhat an utter fucking disappointment. The more I spend time in this space, the\nmore stupid I fucking feel. I am going to wait a full year before most probably\nliquidating everything and just get pleasure from being able to call the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブの中に、実際に「利益」を出した人はいるのでしょうか？\n\nまったくもって残念なことだ。この空間で時間を過ごせば過ごすほど\n馬鹿みたいだ このまま1年待ちます。\n全てを清算して、ただただ悦に浸りながら...",
      "title": "昨年から投資やホドリングを始めた人は、全員少なくとも〜30％ダウンしているはずです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在这个子里，有谁真正赚到了 \"利润 \"吗？\n\n真他妈的令人失望。我在这个空间花的时间越多，就越觉得\n我就越觉得自己愚蠢。我打算等上一整年，然后很可能\n清算所有的东西，并从能够打电话给......中获得快乐。",
      "title": "我们这些去年开始投资和炒股的人一定都至少下降了30%。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在這個子裏，有誰真正賺到了 \"利潤 \"嗎？\n\n真他媽的令人失望。我在這個空間花的時間越多，就越覺得\n我就越覺得自己愚蠢。我打算等上一整年，然後很可能\n清算所有的東西，並從能夠打電話給......中獲得快樂。",
      "title": "我們這些去年開始投資和炒股的人一定都至少下降了30%。"
    }
  ]
}