{
  "author": "prayingforsuperpower",
  "original_created_utc": 1658238493,
  "title": "How do I politely tell my coworker that they have told me the same story 4 times, and I do not want to hear it a fifth?",
  "created_utc": 1658270276,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Every time I have spent more than 5 minutes with this coworker recently, they complain about their leg pain, I say how sorry I am for them cause that must suck, and they tell me, almost word-for-word, the same exact story of how they hurt their leg. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t want to be rude, but I almost just told the story along with them today, and had to stop myself from doing so.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/w2t751/how_do_i_politely_tell_my_coworker_that_they_have/",
  "subreddit": "NoStupidQuestions",
  "id": "w2t751",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Every time I have spent more than 5 minutes with this coworker recently, they\ncomplain about their leg pain, I say how sorry I am for them cause that must\nsuck, and they tell me, almost word-for-word, the same exact story of how they\nhurt their leg.\n\nI don't want to be rude, but I almost just told…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、この同僚と5分以上一緒にいるたびに、彼らは\n脚の痛みを訴えるので、私は「かわいそうに」と言う。\nと言うと、彼らはほぼ一字一句同じように、足を痛めた経緯を話してくれます。\nほとんど一言一句同じ話をします。\n\n失礼かもしれないが、私はほとんど...",
      "title": "同僚に、4回も同じ話をされたので、5回目は聞きたくない、と丁寧に伝えるにはどうしたらいいですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近，每次我和这位同事相处超过5分钟，他们都会\n抱怨他们的腿疼，我都会说我很同情他们，因为这一定是他们的问题。\n他们几乎一字不差地告诉我，他们是如何\n伤了腿。\n\n我不想太无礼，但我几乎就是告诉...",
      "title": "我如何有礼貌地告诉我的同事，他们已经给我讲了4次同样的故事，而我不想再听第五次？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近，每次我和這位同事相處超過5分鐘，他們都會\n抱怨他們的腿疼，我都會說我很同情他們，因爲這一定是他們的問題。\n他們幾乎一字不差地告訴我，他們是如何\n傷了腿。\n\n我不想太無禮，但我幾乎就是告訴...",
      "title": "我如何有禮貌地告訴我的同事，他們已經給我講了4次同樣的故事，而我不想再聽第五次？"
    }
  ]
}