{
  "author": "Yes_throw_it_away",
  "original_created_utc": 1656316881,
  "title": "My year 12 prom is coming up and I don't know what to do?",
  "created_utc": 1656339335,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Throwaway just in case&lt;/p&gt;\n\n&lt;p&gt;Hello, so yesterday I (18 M) got asked to go to prom with someone (18 F) that I&amp;#39;ve really liked for a while now but didn&amp;#39;t have the confidence to make a move. Of course, I said yes which is awesome but I didn&amp;#39;t really think much about the prom beforehand. Most of my friends weren&amp;#39;t going so I just thought there was no reason to go and called it off, so there&amp;#39;s been a change in plans for the prom which will most likely take place around 4 months from now.&lt;/p&gt;\n\n&lt;p&gt;So I grew up and still am currently not in the greatest living situation, and so I&amp;#39;ve never really been to any formal event, never wore anything fancy, never been in a nice car (that my date has), and for the most part, speak with a lot of slang and can sometimes get a little bit defensive when put in an uncomfortable situation. I&amp;#39;m usually very passive it&amp;#39;s just when anxiety gets to me.&lt;/p&gt;\n\n&lt;p&gt;So with this being said I really want to try for the sake of my date having a really awesome night but I have no clue where to start or what the fuck to even do.&lt;/p&gt;\n\n&lt;p&gt;I can save up some money in the meantime with work but I&amp;#39;m definitely not rich at all. Everyone kinda talking about all the expensive shit they&amp;#39;re wearing, ladies doing their makeup, and everything, apparently there&amp;#39;s some kind of theme or something but it doesn&amp;#39;t apply to the students? It honestly just a whole lot to wrap my head around especially seen as this is something that I&amp;#39;m hugely uncomfortable with and have never done before.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve done a lot of dumb things in life, but I&amp;#39;ve never been this scared, to be honest.&lt;/p&gt;\n\n&lt;p&gt;I just really want this to go well so if anyone got any advice can you let me know? Thanks :)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 114,
  "permalink": "/r/TooAfraidToAsk/comments/vlq9nx/my_year_12_prom_is_coming_up_and_i_dont_know_what/",
  "subreddit": "TooAfraidToAsk",
  "id": "vlq9nx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Throwaway just in case\n\nHello, so yesterday I (18 M) got asked to go to prom with someone (18 F) that\nI've really liked for a while now but didn't have the confidence to make a move.\nOf course, I said yes which is awesome but I didn't really think much about the\nprom beforehand. Most of my friends…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "念のための捨て駒\n\nこんにちは、昨日私(18 M)は前からとても好きだった人(18 F)とプロムに行こうと誘われました。\n前々から好きだったんだけど、自分からアプローチする自信がなかったんだ。\nもちろん、私はイエスと答えましたが、プロムのことはあまり考えていませんでした。\nプロムについてあまり考えていなかった。私の友人のほとんどは...",
      "title": "12年目のプロムが近づいているが、どうしたらいいかわからない？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "扔掉以备不时之需\n\n你好，昨天我（18岁的男性）被邀请和一个人（18岁的女性）去参加舞会。\n我真的喜欢了一段时间，但没有信心去做一个动作。\n当然，我答应了，这很好，但我并没有真正考虑到舞会的问题。\n舞会之前。我的大多数朋友...",
      "title": "我的12年级舞会即将到来，我不知道该怎么做？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "扔掉以備不時之需\n\n你好，昨天我（18歲的男性）被邀請和一個人（18歲的女性）去參加舞會。\n我真的喜歡了一段時間，但沒有信心去做一個動作。\n當然，我答應了，這很好，但我並沒有真正考慮到舞會的問題。\n舞會之前。我的大多數朋友...",
      "title": "我的12年級舞會即將到來，我不知道該怎麼做？"
    }
  ]
}