{
  "author": "2luauplife",
  "original_created_utc": 1626510875,
  "title": "Can philosophy help me overcome my simplistic view of the world?",
  "created_utc": 1626567731,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Growing up I have never been fortunate enough to be educated by deep thinkers. I read a lot, but all of my books were shallow &quot;best-seller&quot; ones that never made me think or question anything. Therefore, most of my beliefs were constructed by simplistic general &quot;rules&quot; of life such as &quot;work hard and you will be successful&quot;, or &quot;bad people get karma&quot;, etc. I&#39;m having a crisis because lately all of my beliefs have collapsed due to various confrontations with the exceptions. What I believed to be the absolute, applied-to-everyone, truths of life were proven to be wrong because of people who are the exceptions to those rules. There are people who work hard but never succeed or some bad people who never have to face the consequences of their actions. I find it hard to accept this reality and don&#39;t know what to believe anymore. This leads me to a state of nihilism and meaninglessness, constantly asking &quot;What is the point of trying or abiding by those rules anymore if they are not absolute?&quot; Maybe my view was too simplistic and naive that made my perception of the world wrong. Can learning philosophy help me construct a more profound and stable view that explain or at least accept the reality?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/askphilosophy/comments/om0gga/can_philosophy_help_me_overcome_my_simplistic/",
  "subreddit": "askphilosophy",
  "id": "om0gga",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Growing up I have never been fortunate enough to be educated by deep thinkers. I\nread a lot, but all of my books were shallow \"best-seller\" ones that never made\nme think or question anything. Therefore, most of my beliefs were constructed by\nsimplistic general \"rules\" of life such as \"work hard and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はこれまで、深い考えを持つ人たちから教育を受けるという幸運に恵まれずに育ってきました。I\n私はよく本を読みましたが、私が読んだ本はすべて浅い「ベストセラー」のもので、私に考えさせたり、疑問を抱かせたりすることはありませんでした。\n何かを考えたり疑問に思ったりすることはありませんでした。そのため、私の信念のほとんどは、単純な人生の一般的な「ルール」によって構成されていました。\nそのため、私の信念のほとんどは、「一生懸命働いて...」というような単純な人生の一般的な「ルール」によって構成されていました。",
      "title": "哲学は、私の単純な世界観を克服するのに役立つのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在成长过程中，我从来没有幸运地接受过深刻的思想家的教育。I\n我读了很多书，但我所有的书都是浅薄的 \"畅销书\"，从未让我思考或质疑过任何问题。\n我思考或质疑任何东西。因此，我的大部分信念都是由以下因素构成的\n简单化的一般生活 \"规则\"，如 \"努力工作和...\"。",
      "title": "哲学能帮助我克服我对世界的简单化看法吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在成長過程中，我從來沒有幸運地接受過深刻的思想家的教育。I\n我讀了很多書，但我所有的書都是淺薄的 \"暢銷書\"，從未讓我思考或質疑過任何問題。\n我思考或質疑任何東西。因此，我的大部分信念都是由以下因素構成的\n簡單化的一般生活 \"規則\"，如 \"努力工作和...\"。",
      "title": "哲學能幫助我克服我對世界的簡單化看法嗎？"
    }
  ]
}