{
  "author": "nomdeplume_alias",
  "original_created_utc": 1626310173,
  "title": "I retired at age 55 but after 8 months, I had a great job offer land in my lap. My Wife wanted me to take the new job for drug benefits/life insurance/get me out of her hair. I said I would but only if they agree I can work from home 100% (which they did),and to invest my Salary into more BITCOIN.",
  "created_utc": 1626316937,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>She agreed :) She&#39;s a keeper.</p>\n\n<p>So now I&#39;m DCAing a large portion of my paycheck into more BTC every Monday morning.</p>\n\n<p>She&#39;s given me a mission to get 1 BTC to hand down for each of our 2 Daughters.</p>\n\n<p>I treat BTC as accumulating multi-generational wealth.</p>\n</div><!-- SC_ON -->",
  "score": 367,
  "permalink": "/r/CryptoCurrency/comments/okhtop/i_retired_at_age_55_but_after_8_months_i_had_a/",
  "subreddit": "CryptoCurrency",
  "id": "okhtop",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "She agreed :) She's a keeper.\n\nSo now I'm DCAing a large portion of my paycheck into more BTC every Monday\nmorning.\n\nShe's given me a mission to get 1 BTC to hand down for each of our 2 Daughters.\n\nI treat BTC as accumulating multi-generational wealth.",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "彼女は同意してくれました。) 彼女はキープしています。\n\nだから今、私は毎週月曜日の朝、給料の大部分をより多くのBTCにDCAしています。\nの朝です。\n\n彼女は、私たちの2人の娘にそれぞれ1枚のBTCを渡すというミッションを与えてくれました。\n\n私はBTCを多世代にわたる財産の蓄積と考えています。",
      "title": "私は55歳で退職しましたが、8ヶ月後には素晴らしい仕事のオファーが舞い込んできました。妻は、薬剤給付や生命保険のために、また私を邪魔しないために、私に新しい仕事をさせようとしました。私は、100％自宅で仕事ができることと、給料をもっとビットコインに投資することに同意するならば、引き受けると答えました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "她同意了 :) 她是一个保留者。\n\n因此，现在我每周一都会把我工资的一大部分兑换成更多的BTC\n早上。\n\n她给了我一个任务，让我为我们的两个女儿各准备一份BTC。\n\n我把BTC当作积累多代人的财富。",
      "title": "我在55岁时退休，但在8个月后，我有一个很好的工作机会落在我的腿上。我的妻子想让我接受这份新工作，以获得药品福利/人寿保险/让我摆脱她的束缚。我说我愿意，但前提是他们同意我可以100%在家工作（他们同意了），并将我的工资投资到更多的比特币中。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "她同意了 :) 她是一個保留者。\n\n因此，現在我每週一都會把我工資的一大部分兌換成更多的BTC\n早上。\n\n她給了我一個任務，讓我爲我們的兩個女兒各準備一份BTC。\n\n我把BTC當作積累多代人的財富。",
      "title": "我在55歲時退休，但在8個月後，我有一個很好的工作機會落在我的腿上。我的妻子想讓我接受這份新工作，以獲得藥品福利/人壽保險/讓我擺脫她的束縛。我說我願意，但前提是他們同意我可以100%在家工作（他們同意了），並將我的工資投資到更多的比特幣中。"
    }
  ]
}