{
  "author": "uptown47",
  "the_new_excerpt": "On the 12th May Sotheby's will auction a Banksy and, for the first time, allow\npayment in both Bitcoin and Ethereum. I'm interested in what effect this might\nhave on the value of Ethereum (especially as I have some of those) but also, the\neffect on other crypto currencies reputation in the general…",
  "original_created_utc": 1620716097,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "5月12日、サザビーズはバンクシーをオークションにかけ、初めてビットコインとイーサリアムの両方の支払いを可能にします。\nビットコインとイーサリアムの両方で支払いができるようになります。これがイーサリアムの価値にどのような影響を与えるのかに興味があります。\nイーサリアムの価値にどのような影響があるのか興味があります（特に私はイーサリアムをいくつか持っています）。\nまた、他の暗号通貨の評判にも影響があるのではないかと...。",
      "title": "5月12日に開催されるサザビーのバンクシー・オークションは、支払い方法としてのイーサリアムやビットコインの「正常化」にとにかく貢献すると思いますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "5月12日，苏富比拍卖行将拍卖一幅班克斯的作品，并首次允许用比特币和以太坊付款。\n并首次允许用比特币和以太坊付款。我对这可能对以太坊的价值产生什么影响感兴趣\n对以太坊的价值有什么影响（尤其是我有一些以太坊），但也对其他加密货币的影响感兴趣。\n对其他加密货币声誉的影响。",
      "title": "你认为5月12日的苏富比班克斯拍卖会是否会使以太坊和比特币作为一种支付方式 \"正常化\"？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "5月12日，蘇富比拍賣行將拍賣一幅班克斯的作品，並首次允許用比特幣和以太坊付款。\n並首次允許用比特幣和以太坊付款。我對這可能對以太坊的價值產生什麼影響感興趣\n對以太坊的價值有什麼影響（尤其是我有一些以太坊），但也對其他加密貨幣的影響感興趣。\n對其他加密貨幣聲譽的影響。",
      "title": "你認爲5月12日的蘇富比班克斯拍賣會是否會使以太坊和比特幣作爲一種支付方式 \"正常化\"？"
    }
  ],
  "title": "Do you think the Sotheby's Banksy auction on the 12th May will go anyway to \"normalising\" Ethereum and Bitcoin as a payment method?",
  "created_utc": 1620740525,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>On the 12th May Sotheby&#39;s will auction a Banksy and, for the first time, allow payment in both Bitcoin and Ethereum. I&#39;m interested in what effect this might have on the value of Ethereum (especially as I have some of those) but also, the effect on other crypto currencies reputation in the general economy as a normal means to purchase goods?</p>\n\n<p>I&#39;m curious from an investment perspective but also from an economy perspective. If this becomes the new norm then how will purchases of these kind of assets be tracked / taxed / audited etc. And what would this spell for banking in general.</p>\n\n<p>I see it as a potential paradigm shift in the way things are sold. Especially if the successful bidder actually pays for the Banksy using crypto currency.</p>\n\n<p>Really interested to hear thoughts on this? Do you think its just a stunt (Banksy is known for them) or a genuine effort to open up bids to people who hold a lot of their wealth in crypto? Or the dawn of a new era of crypto currency transactions?</p>\n</div><!-- SC_ON -->",
  "score": 170,
  "permalink": "/r/investing/comments/n9qxag/do_you_think_the_sothebys_banksy_auction_on_the/",
  "subreddit": "investing",
  "id": "n9qxag",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985994599
}