{
  "author": "Iguana_The_Wise",
  "original_created_utc": 1651444587,
  "title": "This is the way: Accumulate as much bitcoin as you can, as frequently as you can, for as long as you can. Slow down a bit during bull runs when everyone is euphoric and greedy. Go harder when everyone is fearful of the price dropping further.",
  "created_utc": 1651502168,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Never sell with the purpose of &amp;quot;locking profits&amp;quot;. This means that your end goal is more dollars instead of more bitcoin. You don&amp;#39;t get it yet.&lt;/p&gt;\n\n&lt;p&gt;Never sell with the purpose of &amp;quot;buying back lower&amp;quot;. You cannot predict the market. It is much more likely that you will do better by simply hodling long term.&lt;/p&gt;\n\n&lt;p&gt;Spend all of your fiat first before you even think about spending your bitcoin. Once you&amp;#39;re out of fiat, you can spend a small percentage of your bitcoin if you need to. Spending bitcoin is the only way it can be distributed to people around the world and become universal money.&lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re an employee, increase your income by improving your skills and climbing up the ladder (either through promotions or applying for new jobs).&lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re an entrepreneur, provide as much value as you can with your product or service. The bigger the problem you solve, the more money you&amp;#39;ll make.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 308,
  "permalink": "/r/Bitcoin/comments/ugb8gg/this_is_the_way_accumulate_as_much_bitcoin_as_you/",
  "subreddit": "Bitcoin",
  "id": "ugb8gg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Never sell with the purpose of \"locking profits\". This means that your end goal\nis more dollars instead of more bitcoin. You don't get it yet.\n\nNever sell with the purpose of \"buying back lower\". You cannot predict the\nmarket. It is much more likely that you will do better by simply hodling…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "決して「利益を確定する」ことを目的に販売してはいけません。これは、あなたの最終目標が\nビットコインを増やすことではなく、ドルを増やすことです。まだ分かっていないようですね。\n\n絶対に「安く買い戻す」目的で売らないでください。あなたは市場を予測することはできません。\nマーケットを予測することはできません。単にホドホドにした方がうまくいく可能性が高いのです...。",
      "title": "これがその方法です。できるだけ多くのビットコインを、できるだけ頻繁に、できるだけ長く蓄積する。誰もが陶酔し、貪欲になる強気な時期には少しペースを落とす。価格がさらに下がることを皆が恐れているときには、もっと頑張る。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "永远不要以 \"锁定利润 \"为目的进行销售。这意味着，你的最终目标\n是更多的美元而不是更多的比特币。你还不明白。\n\n永远不要以 \"低价买回 \"为目的而卖出。你无法预测\n市场。更有可能的是，你会通过简单的囤积做得更好...",
      "title": "这就是方法。尽可能多地积累比特币，尽可能频繁地积累，只要你能做到。在牛市期间，当每个人都很兴奋和贪婪的时候，放慢一点。当每个人都害怕价格进一步下跌的时候，就更要努力了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "永遠不要以 \"鎖定利潤 \"爲目的進行銷售。這意味着，你的最終目標\n是更多的美元而不是更多的比特幣。你還不明白。\n\n永遠不要以 \"低價買回 \"爲目的而賣出。你無法預測\n市場。更有可能的是，你會通過簡單的囤積做得更好...",
      "title": "這就是方法。儘可能多地積累比特幣，儘可能頻繁地積累，只要你能做到。在牛市期間，當每個人都很興奮和貪婪的時候，放慢一點。當每個人都害怕價格進一步下跌的時候，就更要努力了。"
    }
  ]
}