{
  "author": "millenniumpianist",
  "original_created_utc": 1627157915,
  "title": "Why does the speed of light being constant for all observers imply spacetime is non-Euclidean?",
  "created_utc": 1627177212,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m a layman when it comes to physics, so the question may be ill-formed and/or incorrectly framed. I&#39;m trying to really grasp the nature of (flat) spacetime. I&#39;m watching <a href=\"https://youtu.be/iBTez-nTKes?t=272\">this video</a>, and she says how there&#39;s no way for the speed of light to be constant for all observers if spacetime were Euclidean.</p>\n\n<p>If I take the speed of light being constant for all observes as axiomatically true, then I feel like I&#39;m close to grasping flat spacetime, but I don&#39;t really understand why this statement has to be the case. I&#39;m guessing there&#39;s a simple mathematical proof that shows why the spacetime is basically a series of hyperbolic contours -- can someone point me to that?</p>\n</div><!-- SC_ON -->",
  "score": 193,
  "permalink": "/r/askscience/comments/oqxdqo/why_does_the_speed_of_light_being_constant_for/",
  "subreddit": "askscience",
  "id": "oqxdqo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm a layman when it comes to physics, so the question may be ill-formed and/or\nincorrectly framed. I'm trying to really grasp the nature of (flat) spacetime.\nI'm watching this video [https://youtu.be/iBTez-nTKes?t=272], and she says how\nthere's no way for the speed of light to be constant for all…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は物理学に関しては素人なので、質問の仕方が間違っているかもしれません。\n誤った表現をしているかもしれません。私は、（平らな）時空の性質を本当に理解しようとしています。\nこのビデオ[https://youtu.be/iBTez-nTKes?t=272]を見ているのですが、彼女は次のように言っています。\n光の速度がすべてのものに対して一定であるということはありえない...。",
      "title": "なぜ、光の速度がすべての観測者で一定であることが、時空が非ユークリッドであることを意味するのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当涉及到物理学时，我是一个门外汉，所以这个问题可能是不完整的和/或\n不正确的框架。我正试图真正掌握（平坦）时空的本质。\n我在看这个视频[https://youtu.be/iBTez-nTKes?t=272]，她说如何\n光速不可能对所有人都是恒定的......",
      "title": "为什么光速对所有观察者都是恒定的，意味着时空是非欧几里得的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當涉及到物理學時，我是一個門外漢，所以這個問題可能是不完整的和/或\n不正確的框架。我正試圖真正掌握（平坦）時空的本質。\n我在看這個視頻[https://youtu.be/iBTez-nTKes?t=272]，她說如何\n光速不可能對所有人都是恆定的......",
      "title": "爲什麼光速對所有觀察者都是恆定的，意味着時空是非歐幾里得的？"
    }
  ]
}