{
  "author": "RecoveringFuckup",
  "original_created_utc": 1638901855,
  "title": "This halvening cycle is exactly like every other. DON’T SELL!",
  "created_utc": 1638952903,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’ve been into Bitcoin since 2016 and I rode that halvening then the following bear market like a boss. What we’re seeing right this second is no different than 4 years ago almost to the day. Halvening happened at the end of 2016 (2020). &lt;/p&gt;\n\n&lt;p&gt;Bitcoin touched a new ATH shortly after, then starts middling a little bit right before and through part of December of the next year 2017 (2021).&lt;/p&gt;\n\n&lt;p&gt;Finally, it surges to a whole new level that had only ever been speculated upon and most of the crypto market follows. &lt;/p&gt;\n\n&lt;p&gt;I’m not a Bitcoin maximalist, but I believed in BTC first and I always will believe in it as a store of value and the original founder of the financial revolution. &lt;/p&gt;\n\n&lt;p&gt;Keep HODLing and don’t you dare fucking sell!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 189,
  "permalink": "/r/Bitcoin/comments/rb5rpp/this_halvening_cycle_is_exactly_like_every_other/",
  "subreddit": "Bitcoin",
  "id": "rb5rpp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’ve been into Bitcoin since 2016 and I rode that halvening then the following\nbear market like a boss. What we’re seeing right this second is no different\nthan 4 years ago almost to the day. Halvening happened at the end of 2016\n(2020).\n\nBitcoin touched a new ATH shortly after, then starts…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は2016年からビットコインに参入し、その半値戻し→次の半値戻しに乗りました。\nボスのような弱気相場。今この瞬間、私たちが見ているものは、何ら変わりはありません。\n4年前とほぼ同じ日です。ハルベニングは2016年末に起こりました\n(2020).\n\nビットコインは直後に新しいATHにタッチし、その後スタート...",
      "title": "このハルベニングサイクルは、他のサイクルと全く同じです。売らないでください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我从2016年开始进入比特币，我骑着那辆半挂车，然后是以下的情况\n熊市，就像一个老板。我们现在看到的情况与4年前没有什么不同\n与4年前几乎一样。半衰期发生在2016年底\n(2020).\n\n比特币在不久之后触及了一个新的ATH，然后开始...",
      "title": "这个减半周期与其他周期完全一样。不要卖掉!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我從2016年開始進入比特幣，我騎着那輛半掛車，然後是以下的情況\n熊市，就像一個老闆。我們現在看到的情況與4年前沒有什麼不同\n與4年前幾乎一樣。半衰期發生在2016年底\n(2020).\n\n比特幣在不久之後觸及了一個新的ATH，然後開始...",
      "title": "這個減半週期與其他週期完全一樣。不要賣掉!"
    }
  ]
}