{
  "author": "spfffy",
  "the_new_excerpt": "As a college student I work on my weekends to save up money. I save enough for\ntuition and basic costs and the rest is dedicated to sats. I learned about\ncrypto and bitcoin this year and I fell in love with it. Since then almost\neverything I have earned has been exchanged for sats.\n\nFor most of the…",
  "original_created_utc": 1622298761,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "大学生の私は、週末に働いてお金を貯めています。学費と基本的な費用を\n学費や生活費を貯めて、残りはサットに充てています。今年は、暗号とビットコインについて\nビットコインのことを知り、好きになりました。それ以来、私が稼いだお金はほとんど\n稼いだお金はすべてサットに交換しています。\n\nほとんどの場合、...",
      "title": "私は、彼らが大きな損失を被ることになるので、笑うことしかできませんでした。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "作为一名大学生，我在周末工作以积攒资金。我存的钱足够支付\n学费和基本费用，其余的钱则用于考试。我了解到\n今年，我了解到加密货币和比特币，并爱上了它。从那时起，几乎\n我赚到的所有东西都被换成了萨特。\n\n对于大部分的...",
      "title": "我只能笑，因为他们将错过大好时机。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "作爲一名大學生，我在週末工作以積攢資金。我存的錢足夠支付\n學費和基本費用，其餘的錢則用於考試。我瞭解到\n今年，我瞭解到加密貨幣和比特幣，並愛上了它。從那時起，幾乎\n我賺到的所有東西都被換成了薩特。\n\n對於大部分的...",
      "title": "我只能笑，因爲他們將錯過大好時機。"
    }
  ],
  "title": "I could only laugh because they’re going to miss out big.",
  "created_utc": 1622318381,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As a college student I work on my weekends to save up money. I save enough for tuition and basic costs and the rest is dedicated to sats. I learned about crypto and bitcoin this year and I fell in love with it. Since then almost everything I have earned has been exchanged for sats. </p>\n\n<p>For most of the year I was at a pretty big profit until this last huge correction. I have told my “friends” about my large position in crypto and they never said a single thing to me when I was in the green. As soon as Bitcoin and the crypto world crashes, immediately they are asking me how much I’m down, telling me the risks involved, and laughing at me for believing so strongly in a “over valued online coin”. </p>\n\n<p>All I could do is just look at them and laugh. I know damn well when Bitcoin gets past this slump and to 100k+, they are going to be asking me for help buying some. Be careful who you tell about your crypto exposure as not all “friends” are deserving of your knowledge.</p>\n</div><!-- SC_ON -->",
  "score": 378,
  "permalink": "/r/Bitcoin/comments/nnoopr/i_could_only_laugh_because_theyre_going_to_miss/",
  "subreddit": "Bitcoin",
  "id": "nnoopr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804293699
}