{
  "author": "tubrok98",
  "original_created_utc": 1633620252,
  "title": "Out of all coins, I'm betting my money on ETH, MATIC and ADA",
  "created_utc": 1633632289,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>ETH doesn&#39;t need an introduction for why it&#39;s on my list. Demand will keep rising and especially after ETH 2.0 drops.Polygon Matic will follow through even after ETH 2.0 drops. They are the best commit chain on the market right now in my opinion and have great projects on t he way. Even Mark Cuban joined his NFT website with them. They also acquired Hermez roll up which will increase their transaction speeds by up to 10 fold. Overall, great projects for now.And finally Cardano because the concept is still in its infancy honestly. It won&#39;t be in full effect for years from now. I&#39;ll hold their coins and just keep staking. By that time who know how high ADA prices will be</p>\n</div><!-- SC_ON -->",
  "score": 225,
  "permalink": "/r/CryptoCurrency/comments/q3bh24/out_of_all_coins_im_betting_my_money_on_eth_matic/",
  "subreddit": "CryptoCurrency",
  "id": "q3bh24",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "ETH doesn't need an introduction for why it's on my list. Demand will keep\nrising and especially after ETH 2.0 drops.Polygon Matic will follow through even\nafter ETH 2.0 drops. They are the best commit chain on the market right now in\nmy opinion and have great projects on t he way. Even Mark Cuban…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ETHが私のリストに入っている理由は、紹介するまでもないでしょう。需要は増え続けるでしょう。\n特にETH 2.0が発売された後は、需要が増え続けるでしょう。また、ポリゴンマティック社は、ETH 2.0が発売された後も継続していくでしょう。\nポリゴンマティックはETH 2.0が落ちた後も続くでしょう。ポリゴンマティックはETH 2.0が登場した後も続くでしょう。\n私の意見では、彼らは現在市場で最高のコミットチェーンであり、素晴らしいプロジェクトが進行中です。Mark Cubanも...",
      "title": "すべてのコインのうち、ETH、MATIC、ADAにお金を賭けています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "ETH不需要介绍为什么它在我的名单上。需求将持续\n特别是在ETH 2.0下降之后。\n在ETH 2.0下降之后。在我看来，他们是目前市场上最好的提交链，并且在TNT上有很棒的项目。\n在我看来，他们是目前市场上最好的提交链，并有伟大的项目在路上。甚至马克-库班也...",
      "title": "在所有硬币中，我把钱押在ETH、MATIC和ADA上。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "ETH不需要介紹爲什麼它在我的名單上。需求將持續\n特別是在ETH 2.0下降之後。\n在ETH 2.0下降之後。在我看來，他們是目前市場上最好的提交鏈，並且在TNT上有很棒的項目。\n在我看來，他們是目前市場上最好的提交鏈，並有偉大的項目在路上。甚至馬克-庫班也...",
      "title": "在所有硬幣中，我把錢押在ETH、MATIC和ADA上。"
    }
  ]
}