{
  "author": "Toostraight69",
  "original_created_utc": 1655800891,
  "title": "What do i do?",
  "created_utc": 1655817161,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am a 22 year old male who lived his entire life as a straight person. A couple of years ago i noticed that i get turned on by femboy porn while masturbating (anything masculine is a turnoff). Then started to think that i might actually be bisexual. By nature im a very curious person and would always try to get to the bottom of everything so i started thinking of it without actually acting on it. Because The problem with acting on it is that my religion and my society are strictly homophobic, im not that religious but im also not-not religious.&lt;/p&gt;\n\n&lt;p&gt;3 days ago, This feminine guy walked up to me asked for my number. I hesitated, but i gave it to him and we started chatting. He offered me a massage and sex but i was too scared and guilt choked, so i declined and asked him to take it a little slow. Which he did and made it easier for me to balance my curiosity/guilt rollercoaster.&lt;/p&gt;\n\n&lt;p&gt;Yesterday i had my first Non-heterosexual experience. We met and i was so frustrated I couldn’t look him in the face for the whole time, But we chatted and eased into it. eventually he ended up giving me a blowjob. Its was intense because of the feeling i had that its wrong, And he is good at it. But after it i got hit with a truck of religious guilt. feeling like I abandoned my basic morals and betrayed my core beliefs. Meanwhile my curiosity is telling me to explore more and go have sex with him.&lt;/p&gt;\n\n&lt;p&gt;Im so confused, idk what to do.&lt;/p&gt;\n\n&lt;p&gt;Edit: any advice without bashing on my religion would be appreciated.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 156,
  "permalink": "/r/TooAfraidToAsk/comments/vh8mfx/what_do_i_do/",
  "subreddit": "TooAfraidToAsk",
  "id": "vh8mfx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "I am a 22 year old male who lived his entire life as a straight person. A couple\nof years ago i noticed that i get turned on by femboy porn while masturbating\n(anything masculine is a turnoff). Then started to think that i might actually\nbe bisexual. By nature im a very curious person and would…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は22歳の男性で、ずっとノンケとして生きてきました。数年前\n数年前、オナニー中にフェムボーイのポルノで興奮することに気づいた。\n(男性的なものは全てNG）。そして、自分はバイセクシャルなのではないかと考え始めた。\nバイセクシャルなのかもしれないと思い始めました。私は非常に好奇心旺盛な人であるため、...",
      "title": "どうしたらいいんだろう？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个22岁的男性，一生都作为异性恋者生活。几年前\n几年前，我注意到我在自慰的时候会被女同性恋者的色情片所吸引（任何男性化的东西都会被拒绝）。\n(任何男性化的东西都会让我感到厌恶)。然后我开始想，我可能真的\n是双性恋。从本质上讲，我是一个非常好奇的人，并且会...",
      "title": "我应该怎么做？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個22歲的男性，一生都作爲異性戀者生活。幾年前\n幾年前，我注意到我在自慰的時候會被女同性戀者的色情片所吸引（任何男性化的東西都會被拒絕）。\n(任何男性化的東西都會讓我感到厭惡)。然後我開始想，我可能真的\n是雙性戀。從本質上講，我是一個非常好奇的人，並且會...",
      "title": "我應該怎麼做？"
    }
  ]
}