{
  "author": "ThatOtherGuy254",
  "the_new_excerpt": "The time to buy is when everyone is freaking out and calling for ever lower\nprices. I know that it's difficult to buy when fear is rampant, but that's why\nit's important to maintain a long-term perspective. Many people wish that they\nwould have bought Bitcoin at $1 (or even lower), but if you are…",
  "original_created_utc": 1621108737,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "買い時は、誰もが「もっと安く」と騒いでいるときです。\n買うべき時は、みんなが怖がっている時です。恐怖が蔓延しているときに買うのは難しいと思いますが、だからこそ\nだからこそ、長期的な視点を持つことが大切なのです。多くの人が、ビットコインを1ドルで買っておけばよかったと思っています。\n多くの人が、ビットコインを1ドル（あるいはそれ以下）で買っておけばよかったと思っていますが、もしあなたが...",
      "title": "ビットコインは今が買い時"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "买入的时机是在每个人都惊慌失措并呼吁不断降低价格的时候。\n价格。我知道在恐惧横行的情况下很难购买，但这就是为什么\n保持一个长期的观点是很重要的。许多人希望他们\n会在1美元（甚至更低）的时候买入比特币，但如果你是...",
      "title": "现在是购买比特币的时候了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "買入的時機是在每個人都驚慌失措並呼籲不斷降低價格的時候。\n價格。我知道在恐懼橫行的情況下很難購買，但這就是爲什麼\n保持一個長期的觀點是很重要的。許多人希望他們\n會在1美元（甚至更低）的時候買入比特幣，但如果你是...",
      "title": "現在是購買比特幣的時候了"
    }
  ],
  "title": "Now is the time to buy Bitcoin",
  "created_utc": 1621175820,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The time to buy is when everyone is freaking out and calling for ever lower prices. I know that it&#39;s difficult to buy when fear is rampant, but that&#39;s why it&#39;s important to maintain a long-term perspective. Many people wish that they would have bought Bitcoin at $1 (or even lower), but if you are panic selling now you would have never held Bitcoin from $1 to $64,000. I have heard people wondering how other member managed to accumulate holdings that are five or six figures. The answer for some  is that they bought during times like this when everyone was fearful and they held. Like I said, it&#39;s all about perspective. Bitcoin was four figures for most of last year and Ethereum was a few hundred dollars. The price action of even months is not that important if you are planning to hold for years. Personally, I don&#39;t care what other people say. As long as Bitcoin&#39;s fundamentals are strong, I am not going to worry. Miners and whales are accumulating too, so it looks like they&#39;re not worrying either. Don&#39;t be one of those people who panic sells your Bitcoin now only to panic buy if we hit six figures in the coming months. Just be rational and patient, and you will be fine.</p>\n</div><!-- SC_ON -->",
  "score": 162,
  "permalink": "/r/CryptoCurrency/comments/nd75nd/now_is_the_time_to_buy_bitcoin/",
  "subreddit": "CryptoCurrency",
  "id": "nd75nd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590798343
}