{
  "author": "PhilipKFry95",
  "the_new_excerpt": "Reddit is full of burn/throwaway accounts. They should just have an option to\npost as anon so that way it’s easier to stay hidden. I actually have 1 other\naccount I don’t share. Everyone knows I’m an active Reddit user and I have the\nsubconscious fear someone’s gonna see a post on one of my burner…",
  "original_created_utc": 1616809695,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "Reddit上到处都是烧钱/扔钱的账号。他们应该有一个选项来\n以anon的身份发帖，这样更容易保持隐蔽。其实我还有1个\n账号我不共享。每个人都知道我是一个活跃的Reddit用户，我有一个叫\n潜意识里害怕有人会看到我的一篇文章... ...",
      "title": "你觉得reddit应该有一个选项，以匿名的方式发帖吗?"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Reddit上到處都是燒錢/扔錢的賬號。他們應該有一個選項來\n以anon的身份發帖，這樣更容易保持隱蔽。其實我還有1個\n賬號我不共享。每個人都知道我是一個活躍的Reddit用戶，我有一個叫\n潛意識裏害怕有人會看到我的一篇文章... ...",
      "title": "你覺得reddit應該有一個選項，以匿名的方式發帖嗎?"
    }
  ],
  "title": "Do you think reddit should have an option to post as an anonymous? getting tired of making burners",
  "created_utc": 1616849614,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Reddit is full of burn/throwaway accounts. They should just have an option to post as anon so that way it’s easier to stay hidden. I actually have 1 other account I don’t share. Everyone knows I’m an active Reddit user and I have the subconscious fear someone’s gonna see a post on one of my burner accounts and think “hey is that you”. I’m a very open person about anything really.</p>\n\n<p>There’s just so much burner/throwaway accounts like why not. Make it easier. I think I’ve made 3 burner accounts to ask something personal and I wanna make another one since I can’t remember my old burner account. At some point I deleted the post and logged out.</p>\n\n<p>Although ya can always argue that it doesn’t take long to make a burner LoL</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/me3xuk/do_you_think_reddit_should_have_an_option_to_post/",
  "subreddit": "TooAfraidToAsk",
  "id": "me3xuk",
  "is_self": true,
  "media": null,
  "is_video": false
}