{
  "author": "trololol_daman",
  "original_created_utc": 1646389137,
  "title": "Why is body dysmorphia considered a mental illness but gender dysphoria is not?",
  "created_utc": 1646409714,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Both definitions taken from Wikipedia:&lt;/p&gt;\n\n&lt;p&gt;Gender dysphoria (GD) is the distress a person feels due to a mismatch between their gender identity—their personal sense of their own gender—and their sex assigned at birth.&lt;/p&gt;\n\n&lt;p&gt;Body dysmorphic disorder (BDD), occasionally still called dysmorphophobia, is a mental disorder characterized by the obsessive idea that some aspect of one&amp;#39;s own body part or appearance is severely flawed and therefore warrants exceptional measures to hide or fix it.&lt;/p&gt;\n\n&lt;p&gt;It fits every definition of BDD from my knowledge&lt;/p&gt;\n\n&lt;p&gt;The body works just fine&lt;/p&gt;\n\n&lt;p&gt;Their mind says they’re not in the wrong body or they have wrong body parts that leads them to great lengths to attempt to alter them despite it not being medically necessary.&lt;/p&gt;\n\n&lt;p&gt;I am not implying that doesn’t discount medical transition being an effective treatment for some of those who have gender dysphoria just as the dysphoria can also be treated through therapy and may desist after puberty similar with BDD.&lt;/p&gt;\n\n&lt;p&gt;The thing that I don’t understand gender dysphoria seems like a class of body dysmorphia (bigorexia or anorexia) where the person is healthy yet their self image and perception of what they “want to be” are so wild it pushes them to extremes both mentally and physically. Yet the DSM-5 removed gender dysphoria from being a mental illness but kept body dysmorphic disorder.&lt;/p&gt;\n\n&lt;p&gt;EDIT: I understand gender dysphoria is still in the DSM-V but it is no longer a disorder like body dysmorphic disorder&lt;/p&gt;\n\n&lt;p&gt;I am not being antagonistic or transphobic by any means, I just want to know the justification of the difference between the two and why one is considered a mental illness and the other is not.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 110,
  "permalink": "/r/TooAfraidToAsk/comments/t6fxav/why_is_body_dysmorphia_considered_a_mental/",
  "subreddit": "TooAfraidToAsk",
  "id": "t6fxav",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Both definitions taken from Wikipedia:\n\nGender dysphoria (GD) is the distress a person feels due to a mismatch between\ntheir gender identity—their personal sense of their own gender—and their sex\nassigned at birth.\n\nBody dysmorphic disorder (BDD), occasionally still called dysmorphophobia, is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "いずれもWikipediaより抜粋\n\n性同一性障害（GD）とは、以下のような不一致によって感じる苦痛のことである。\n性自認（自分の性別に対する個人的な感覚）と、自分の性\n出生時に割り当てられた\n\n身体醜形障害（BDD）とは、今でも醜形恐怖症と呼ばれることがある...",
      "title": "なぜ身体醜形症は精神疾患とされ、性同一性障害は精神疾患ではないのですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这两个定义都取自维基百科。\n\n性别恐惧症（GD）是指一个人由于他们的性别认同--他们的个人身份不匹配而感到的痛苦。\n他们的性别认同--他们对自己性别的个人感觉--与他们出生时的性别\n他们在出生时被分配的性别。\n\n身体畸形症（BDD），有时仍被称为畸形恐惧症，是指身体畸形。",
      "title": "为什么身体畸形症被认为是一种精神疾病，而性别恐惧症却不是？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這兩個定義都取自維基百科。\n\n性別恐懼症（GD）是指一個人由於他們的性別認同--他們的個人身份不匹配而感到的痛苦。\n他們的性別認同--他們對自己性別的個人感覺--與他們出生時的性別\n他們在出生時被分配的性別。\n\n身體畸形症（BDD），有時仍被稱爲畸形恐懼症，是指身體畸形。",
      "title": "爲什麼身體畸形症被認爲是一種精神疾病，而性別恐懼症卻不是？"
    }
  ]
}