{
  "author": "IHaveQuestionsDude",
  "original_created_utc": 1654525894,
  "title": "How common is it REALLY for women to lose respect for their male partner after he opened up to her emotionally?",
  "created_utc": 1654544020,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I apologize if the question is comming across as if I don&amp;#39;t believe people when they say this, because I do, I am just wondering HOW common it is. I see this all over reddit. Anytime the topic of men showing emotion comes up, there will inevitably be a highly upvoted comment about how when they tried being open, their partner got uncomfortable, so now they don&amp;#39;t open up anymore. &lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t really picture many situations where I&amp;#39;d react aversly to someone of either gender opening up to me about their feelings. The only instances I can imagine are something like if they are clearly in the wrong and using crocodile tears to avoid accountability, but other than that, it&amp;#39;s a given I&amp;#39;d be supportive. I&amp;#39;ve comforted people of either gender whenever they seemed to need it. &lt;/p&gt;\n\n&lt;p&gt;Some people here have said that EVERY partner has lost respect for them after opening up. I get having that experience with one or 2 emotionally stunted women but EVERY partner? Is it so common that some people experience it with 10 women in a row? &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m just curious about an estimate on just how common this is because it&amp;#39;s an extremely common talking point.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 110,
  "permalink": "/r/TooAfraidToAsk/comments/v64vcy/how_common_is_it_really_for_women_to_lose_respect/",
  "subreddit": "TooAfraidToAsk",
  "id": "v64vcy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I apologize if the question is comming across as if I don't believe people when\nthey say this, because I do, I am just wondering HOW common it is. I see this\nall over reddit. Anytime the topic of men showing emotion comes up, there will\ninevitably be a highly upvoted comment about how when they…"
}