{
  "author": "bjos144",
  "original_created_utc": 1628227609,
  "title": "I recently learned COVID has a lipid membrane but I was taught in school that viruses are DNA or RNA packed inside a protein shell, so how many different virus physiologies are there and what exactly is COVID made out of?",
  "created_utc": 1628259608,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As the title said, I was taught that viruses are a protein shell with a DNA packed in that inject their DNA (or RNA) into the host cell.  Now I learn that some viruses actually have membranes and multiple membrane proteins, which is much more complex than the image I have in my mind.  Now I&#39;m wondering about how many different phenotypes of viruses there are, is it a binary thing, some are a protein shell and some are a membrane, or more of a spectrum?  Do we know?</p>\n</div><!-- SC_ON -->",
  "score": 135,
  "permalink": "/r/askscience/comments/oz0bo1/i_recently_learned_covid_has_a_lipid_membrane_but/",
  "subreddit": "askscience",
  "id": "oz0bo1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As the title said, I was taught that viruses are a protein shell with a DNA\npacked in that inject their DNA (or RNA) into the host cell. Now I learn that\nsome viruses actually have membranes and multiple membrane proteins, which is\nmuch more complex than the image I have in my mind. Now I'm…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルにあるように、ウイルスはタンパク質の殻にDNAを詰め込んだもので、宿主の細胞にDNA（またはRNA）を注入するものだと教わりました。\nが詰め込まれたタンパク質の殻で、宿主の細胞にDNA（またはRNA）を注入すると教わりました。今になってわかったことは\n膜を持ち、複数の膜タンパク質を持っているものもあるとのこと。\n私の頭の中にあるイメージよりもずっと複雑です。今の私は...",
      "title": "COVIDが脂質膜を持っていることは最近知りましたが、学校ではウイルスはタンパク質の殻の中にDNAやRNAが詰まっていると教わりましたが、ウイルスの生理機能は何種類あるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "正如标题所说，我被教导说，病毒是一个含有DNA的蛋白质外壳。\n装在里面，将其DNA（或RNA）注入宿主细胞。现在我了解到\n一些病毒实际上有膜和多种膜蛋白，这就\n这比我脑海中的印象要复杂得多。现在我...",
      "title": "我最近了解到COVID有一层脂质膜，但我在学校学到的是，病毒是DNA或RNA包装在蛋白质外壳内，那么有多少种不同的病毒生理结构，COVID到底是由什么组成的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "正如標題所說，我被教導說，病毒是一個含有DNA的蛋白質外殼。\n裝在裏面，將其DNA（或RNA）注入宿主細胞。現在我瞭解到\n一些病毒實際上有膜和多種膜蛋白，這就\n這比我腦海中的印象要複雜得多。現在我...",
      "title": "我最近了解到COVID有一層脂質膜，但我在學校學到的是，病毒是DNA或RNA包裝在蛋白質外殼內，那麼有多少種不同的病毒生理結構，COVID到底是由什麼組成的？"
    }
  ]
}