{
  "author": "Caboun6828",
  "original_created_utc": 1641623877,
  "title": "Why is ETH &amp; BTC Dropping Like it’s Hot",
  "created_utc": 1641642271,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;According to Time, the big drops this week to Ethereum and Bitcoin have followed a disappointing December jobs report, and the release of minutes from the Federal Reserve Board&amp;#39;s December meeting, which signaled the central bank would begin slowing down measures to prop up the economy as it continues to improve. &lt;/p&gt;\n\n&lt;p&gt;Also, 18% of Bitcoins hash rate comes out of Kazakstan where the power went out January 5th for several hours due to the political turmoil  which then caused an approx 12% drop in BTC price then it was downhill from there. &lt;/p&gt;\n\n&lt;p&gt;Basically, fear over interest rates and turmoil in Kazakstan is storing up a lot of crap in the crypto world. Let’s get ready to get this party started!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 316,
  "permalink": "/r/CryptoCurrency/comments/rytkcq/why_is_eth_btc_dropping_like_its_hot/",
  "subreddit": "CryptoCurrency",
  "id": "rytkcq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "According to Time, the big drops this week to Ethereum and Bitcoin have followed\na disappointing December jobs report, and the release of minutes from the\nFederal Reserve Board's December meeting, which signaled the central bank would\nbegin slowing down measures to prop up the economy as it…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Timeによると、今週のイーサリアムとビットコインの大きな下落は、次のとおりです。\n12月の雇用統計が期待外れだったこと、そして、12月1日に発表された議事録が\n米連邦準備制度理事会（FRB）の12月会合で、中央銀行が「(1)」と「(2)」に分かれることが示唆された。\nまた、「震災」「原発事故」「原発事故」「原発事故」「原発事故」「原発事故」「原発事故」「原発事故」「原発事故」「原発事故」。",
      "title": "なぜETH &amp; BTCは熱くなるように落ちているのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "据时代周报报道，本周以太坊和比特币的大跌是在12月就业报告令人失望和会议纪要发布后发生的。\n12月就业报告令人失望，以及美国联邦储备委员会12月会议记录的发布。\n联邦储备委员会12月会议记录的发布，这表明央行将\n开始放缓支撑经济的措施，因为它...",
      "title": "为什么ETH&amp;BTC像热锅上的蚂蚁一样下跌？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "據時代週報報道，本週以太坊和比特幣的大跌是在12月就業報告令人失望和會議紀要發佈後發生的。\n12月就業報告令人失望，以及美國聯邦儲備委員會12月會議記錄的發佈。\n聯邦儲備委員會12月會議記錄的發佈，這表明央行將\n開始放緩支撐經濟的措施，因爲它...",
      "title": "爲什麼ETH&amp;BTC像熱鍋上的螞蟻一樣下跌？"
    }
  ]
}