{
  "author": "BirdSetFree",
  "the_new_excerpt": "Any person who has the curiosity or the initiative of joining the crypto world\nshould be genuinely helped because this is what crypto really is about.\n\nI see serious questions being downvoted way too much than i would`ve hoped. It\ndoes not fucking matter that you`ve seen the same question 1000…",
  "original_created_utc": 1619757500,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号の世界に参加したいという好奇心やイニシアチブを持っている人は誰でも\n積極的に支援すべきだと思います。なぜなら、これこそが暗号の本質だからです。\n\n真面目な質問が、思ったよりもずっと下げられています。それは\n同じ質問を1,000回も見たことがあるかどうかは問題ではありません...",
      "title": "新規参入者に嫌な顔をすることは、コミュニティのためにも採用のためにもなりません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "任何有好奇心或主动加入加密货币世界的人\n应该得到真正的帮助，因为这才是加密货币的真谛。\n\n我看到严肃的问题被降权的情况比我希望的要多。这\n你已经看到了1000个同样的问题，这他妈的并不重要...",
      "title": "对新来的人来说，做一个混蛋并不能帮助我们的社区，也不能帮助收养。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "任何有好奇心或主動加入加密貨幣世界的人\n應該得到真正的幫助，因爲這纔是加密貨幣的真諦。\n\n我看到嚴肅的問題被降權的情況比我希望的要多。這\n你已經看到了1000個同樣的問題，這他媽的並不重要...",
      "title": "對新來的人來說，做一個混蛋並不能幫助我們的社區，也不能幫助收養。"
    }
  ],
  "title": "Being an asshole to newcomers does not help our community nor helps adoption",
  "created_utc": 1619767835,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Any person who has the curiosity or the initiative of joining the crypto world should be genuinely helped because this is what crypto really is about.</p>\n\n<p>I see serious questions being downvoted way too much than i would`ve hoped. It does not fucking matter that you`ve seen the same question 1000 times, we need to be considerate with our fellow newbies. </p>\n\n<p>We should all be happy new people join this sub, decide to move their investments to crypto and we should do all our best to keep those guys around.</p>\n\n<p>End of the rant</p>\n</div><!-- SC_ON -->",
  "score": 3338,
  "permalink": "/r/CryptoCurrency/comments/n1mevs/being_an_asshole_to_newcomers_does_not_help_our/",
  "subreddit": "CryptoCurrency",
  "id": "n1mevs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380961454
}