{
  "author": "Scat_fiend",
  "original_created_utc": 1640885871,
  "title": "Metaverses like decentraland and sandbox are gonna suck",
  "created_utc": 1640911668,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Big companies such as nike buying up land in metaverses will end up hurting the community and make a terrible user experience. There might be some awesome uses for metaverses but if all the land is owned by these big corporations then how can it be anything more than 24/7 advertising? Maybe it’ll be nice if I want to buy some shoes but otherwise it’ll just be companies trying to profit and the metaverse experience will more the most part suck.&lt;/p&gt;\n\n&lt;p&gt;Please correct my ignorance because I see that despite massive potential it will end up sucking hard.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 163,
  "permalink": "/r/CryptoCurrency/comments/rs7bq1/metaverses_like_decentraland_and_sandbox_are/",
  "subreddit": "CryptoCurrency",
  "id": "rs7bq1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Big companies such as nike buying up land in metaverses will end up hurting the\ncommunity and make a terrible user experience. There might be some awesome uses\nfor metaverses but if all the land is owned by these big corporations then how\ncan it be anything more than 24/7 advertising? Maybe it’ll…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ナイキのような大企業がメタバーズの土地を購入することは、結果的に損害を与えることになります。\nまた、地域社会への影響も大きく、ひどいユーザー体験になります。素晴らしい使い道があるかもしれません。\nが、もしすべての土地がこれらの大企業に所有されているのであれば、どのようにして\nは、24時間365日体制の広告以外の何ものでもないでしょう？もしかしたら...",
      "title": "ディセントランドやサンドボックスのようなメタヴァースはクソゲーになりそうだ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "像耐克这样的大公司在梅特韦尔斯买地，最终会伤害到社区，并使用户体验变得糟糕。\n社区，并带来糟糕的用户体验。也许有一些很棒的用途\n但如果所有的土地都被这些大公司所拥有，那么它怎么能成为一个真正的社区呢？\n它怎么可能只是24/7的广告？也许它将...",
      "title": "像decentraland和sandbox这样的Metaverses会很糟糕。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "像耐克這樣的大公司在梅特韋爾斯買地，最終會傷害到社區，並使用戶體驗變得糟糕。\n社區，並帶來糟糕的用戶體驗。也許有一些很棒的用途\n但如果所有的土地都被這些大公司所擁有，那麼它怎麼能成爲一個真正的社區呢？\n它怎麼可能只是24/7的廣告？也許它將...",
      "title": "像decentraland和sandbox這樣的Metaverses會很糟糕。"
    }
  ]
}