{
  "author": "Username-Not-A-Bot",
  "the_new_excerpt": "While working on my post I noticed u/SenatusSPQR [/u/SenatusSPQR] made a\nsimiliar post\n[https://www.reddit.com/r/CryptoCurrency/comments/mtafkq/what_is_nano_the_short_and_long_on_the/?utm_source=share&utm_medium=web2x&context=3].\nAs he is a self-declared Nano expert (love it), I asked him to take a…",
  "original_created_utc": 1618833274,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "自分の投稿をしているときに、u/SenatusSPQR [/u/SenatusSPQR] が同じような投稿をしているのに気づきました。\n似たような投稿\n[https://www.reddit.com/r/CryptoCurrency/comments/mtafkq/what_is_nano_the_short_and_long_on_the/?utm_source=share&utm_medium=web2x&context=3]を参照してください。\n彼は自称Nanoの専門家なので(笑)、私は彼に...をお願いしました。",
      "title": "初心者のためのNANO解説"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当我在写我的帖子时，我注意到u/SenatusSPQR [/u/SenatusSPQR]做了一个。\n同道中人\n[https://www.reddit.com/r/CryptoCurrency/comments/mtafkq/what_is_nano_the_short_and_long_on_the/?utm_source=share&utm_medium=web2x&context=3]。\n由于他自称是纳米专家(爱它)，我请他以...",
      "title": "为新手讲解NANO"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當我在寫我的帖子時，我注意到u/SenatusSPQR [/u/SenatusSPQR]做了一個。\n同道中人\n[https://www.reddit.com/r/CryptoCurrency/comments/mtafkq/what_is_nano_the_short_and_long_on_the/?utm_source=share&utm_medium=web2x&context=3]。\n由於他自稱是納米專家(愛它)，我請他以...",
      "title": "爲新手講解NANO"
    }
  ],
  "title": "NANO Explained for Noobs",
  "created_utc": 1618858398,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>While working on my post I noticed <a href=\"/u/SenatusSPQR\">u/SenatusSPQR</a> made a similiar <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/mtafkq/what_is_nano_the_short_and_long_on_the/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">post</a>. As he is a <em>self-declared Nano expert</em> (love it), I asked him to take a look at my post. It`s a nice addition to his post and a little more directed towards beginners as his is very detailed (while veterans might also learn a few new things).</p>\n\n<p>Long but informative read ahead:</p>\n\n<p><strong>What is Nano (NANO)?</strong></p>\n\n<p>Nano is a digital currency that aims to offer an effective, viable alternative to fiat currencies. Using a unique block-lattice structure, Nano promises several key advantages over other payment currencies, including the following:</p>\n\n<ul>\n<li><strong>Feeless transactions</strong></li>\n<li><strong>Instant transactions</strong></li>\n<li><strong>Unlimited scalability</strong></li>\n</ul>\n\n<p>This makes Nano an attractive option for peer-to-peer transactions and micropayments, and the team’s stated mission is to become a global currency. Nano has reached its maximum supply of 133,248,290 NANO, with the full complement of Nano tokens in circulation.</p>\n\n<p>When it was originally launched in 2017, Nano was known as RaiBlocks (XRB). However, on January 31, 2018, RaiBlocks became Nano as part of a comprehensive rebranding, and its ticker symbol was updated to NANO on most exchanges.</p>\n\n<p><strong>Fun fact:</strong> <em>Following the announcement of the name change, the price of NANO rose 20% in 24 hours.</em></p>\n\n<p><strong>What makes Nano unique/ how does it work?</strong></p>\n\n<p>What is unique about Nano is that it combines blockchain technology (to learn more about blockchain: <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/mt9wsa/blockchain_explained_for_beginners/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">Blockchain for Beginners</a>) with Directed Acyclic Graph (DAG), a structure which sees individual transactions directly linked to one another rather than grouped together for processing in blocks (see <a href=\"/u/SenatusSPQR\">u/SenatusSPQR</a> his <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/mtafkq/what_is_nano_the_short_and_long_on_the/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">post</a> for a more in depth explanation of DAG). This so called &#39;block lattice&#39; (a mixture of two systems) architecture is designed to offer the best of both worlds:</p>\n\n<ul>\n<li>The scalability of DAG</li>\n<li>The security of blockchain</li>\n</ul>\n\n<p>An <em>over-simplified</em> explanation:  DAG is a type of data structuring. When, for example, you perform a transaction (<em>buy, sell or simply trade</em>) with a traditional cryptocurrency, your transaction is grouped into a “<em>block</em>” with a predefined space and size - these blocks make up the blockchain. With the DAG structure, however, you would be able to see individual transactions and how they correlate in the bigger picture of the blockchain itself.</p>\n\n<p>Nano simply stores incoming and outgoing transaction data into designated, individual blocks in your own, personal blockchain. This way, your wallet balance is always kept updated and secure, while also keeping the blockchain working smoothly.</p>\n\n<p><strong>Amazing fact:</strong> <em>NANO is also the greenest coin on the market , as the redditor,</em> <a href=\"/u/CanadianVelociraptor\">u/CanadianVelociraptor</a>*, excellently explained: The entire Nano network is so efficient that, operating at 7000tps, it can be powered by a single wind turbine. The community is funding to plant a 5 acre forest which will offset the entire carbon footprint of the coin. Check out the site isnanogreenyet .org for more info.*</p>\n\n<p><strong>Proof of Work or Proof of Stake?</strong></p>\n\n<p>Most cryptocurrencies rely on one of two main consensus algorithms, proof of work or proof of stake. However, Nano relies on a hybrid model called Open Representative Voting (ORV), which doesn’t use mining.</p>\n\n<p>Every account can freely choose a representative at any time to vote on their behalf, even when the delegating account itself is offline. These representative accounts are configured on nodes that remain online and vote on the validity of transactions they see on the network.</p>\n\n<p>Because Nano accounts can freely delegate their voting weight to representatives at any time, the users have more control over who has power with consensus and how decentralized the network is. This is a key advantage to the design of Open Representative Voting (ORV). With no direct monetary incentive for nodes, this helps mitigate the natural tendency towards centralization among revenue-earning nodes.</p>\n\n<p><strong>What are the Nano use cases?</strong></p>\n\n<ul>\n<li><strong>Peer-to-peer payments:</strong> Nano lets you quickly pay friends, family and others, whether paying the rent or splitting a restaurant bill.</li>\n<li><strong>Micropayments:</strong> The fact that it has zero fees also makes Nano a suitable choice for small payments, for example paying an online subscription.</li>\n<li><strong>Trading cryptocurrency:</strong> With instant and zero-fee transactions, Nano could be extremely useful for cryptocurrency traders looking to buy and sell other digital coins and tokens.</li>\n<li><strong>Business to customer:</strong> Nano can offer fast checkout for customers and quick access to funds for businesses, and both parties can benefit from the absence of transaction fees.</li>\n</ul>\n\n<p><strong>(Not so) Fun fact:</strong> <em>In Feburary 2018, 17 million NANO (10% of the total supply) went missing from cryptocurrency exhange BitGrail.</em></p>\n\n<p><strong>What are some disadvantages of Nano?</strong></p>\n\n<ul>\n<li><strong>Security:</strong> While NANO has been safe on exchanges the network &#39;recently&#39; underwent a spam attack causing nodes to go offline. Small transactions at a fraction of cent done repeatedly may be able to spam the network causing nodes to go offline.</li>\n<li><strong>Whales:</strong> While NANO is decentralized in terms of nodes and voting power, the top 100 accounts currently hold 62% of the total value of the coin. To put this in perspective Bitcoins value for the top 100 is 19%; Ethereum is 34%, Ripple is 81%; Stellar is 95%, Litecoin is 44% (<em>at the time of writing</em>).</li>\n<li><strong>No other utility:</strong> No other utility other than being a currency, which puts it in competition with a lot of other similar projects.</li>\n</ul>\n\n<p>(Let me know what coin or crypto-related term you want me to explain and I will look into it)</p>\n\n<p>EDIT: they seem to have fixed the spam attacks: <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/msrjr5/nanos_latest_innovation_feeless_spamresistance/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf\">link</a></p>\n</div><!-- SC_ON -->",
  "score": 330,
  "permalink": "/r/CryptoCurrency/comments/mtyyas/nano_explained_for_noobs/",
  "subreddit": "CryptoCurrency",
  "id": "mtyyas",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171521481
}