{
  "author": "ICareAboutThings25",
  "original_created_utc": 1647776503,
  "title": "Do married people like being married?",
  "created_utc": 1647802738,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I feel like on the internet everything I read by married people about their spouses is negative. &lt;/p&gt;\n\n&lt;p&gt;“My husband never does any chores.” “My wife doesn’t have sex with me anymore.” “My husband never tells me he loves me anymore.” “My wife always complains.” &lt;/p&gt;\n\n&lt;p&gt;And it’s not just the internet. I once was at a party and the group I wound up talking to were all married women. They asked me if I was married. When I said I was single, the consensus was “good!” The advice I got was “stay single” and “enjoy it.” &lt;/p&gt;\n\n&lt;p&gt;They say marriage is ups and downs, but I only really hear people talking about the “downs.” I can count on one hand the times I’ve heard people say they love being married or they love their spouse so much or their spouse is their rock. &lt;/p&gt;\n\n&lt;p&gt;Is it actually as bad as married people make it seem?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 107,
  "permalink": "/r/TooAfraidToAsk/comments/tij8ks/do_married_people_like_being_married/",
  "subreddit": "TooAfraidToAsk",
  "id": "tij8ks",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I feel like on the internet everything I read by married people about their\nspouses is negative.\n\n“My husband never does any chores.” “My wife doesn’t have sex with me anymore.”\n“My husband never tells me he loves me anymore.” “My wife always complains.”\n\nAnd it’s not just the internet. I once was…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ネット上では、既婚者の方の話を読むと、すべて自分のことのように感じてしまいます。\n夫婦はネガティブなものです。\n\n\"うちの夫は家事をしない\" \"妻はもう私とセックスレス\"\n\"夫はもう愛していると言ってくれない\" \"妻はいつも文句ばかり\"\n\nそしてそれはネット上だけではありません。私もかつては...",
      "title": "既婚者は、結婚していることが好きなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我觉得在互联网上，我读到的所有已婚人士关于他们的\n配偶都是负面的。\n\n\"我丈夫从来不做任何家务。\" \"我的妻子不再和我做爱了。\"\n\"我丈夫再也不告诉我他爱我了。\" \"我的妻子总是抱怨。\"\n\n而且这不仅仅是互联网的问题。我曾经是...",
      "title": "已婚人士喜欢结婚吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我覺得在互聯網上，我讀到的所有已婚人士關於他們的\n配偶都是負面的。\n\n\"我丈夫從來不做任何家務。\" \"我的妻子不再和我做愛了。\"\n\"我丈夫再也不告訴我他愛我了。\" \"我的妻子總是抱怨。\"\n\n而且這不僅僅是互聯網的問題。我曾經是...",
      "title": "已婚人士喜歡結婚嗎？"
    }
  ]
}