{
  "author": "MasterCookSwag",
  "the_new_excerpt": "Just a quick PSA, because we are not going to leave personalized comments on the\ndozens of threads getting nuked here, things that are being taken down:\n\n * WSB mods removed a thread on XYZ\n\n * I think WSB is manipulating stocks\n\n * WSB mods are not allowing discussion of [thing I want to discuss]\n\n…",
  "original_created_utc": 1611604461,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "只是一个简单的PSA，因为我们不会留下个性化的意见，在上\n几十个线程在这里被nuked，东西被拿下。\n\n * WSB版主删除了一个关于XYZ的帖子。\n\n * 我认为WSB在操纵股票\n\n * WSB版主不允许讨论[我想讨论的事情]\n\n…",
      "title": "PSA：请不要再在这里发表关于WSB事务的帖子。我们不是一个备用的WSB子reddit。你的帖子将被删除。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "只是一個簡單的PSA，因爲我們不會留下個性化的意見，在上\n幾十個線程在這裏被nuked，東西被拿下。\n\n * WSB版主刪除了一個關於XYZ的帖子。\n\n * 我認爲WSB在操縱股票\n\n * WSB版主不允許討論[我想討論的事情]\n\n…",
      "title": "PSA：請不要再在這裏發表關於WSB事務的帖子。我們不是一個備用的WSB子reddit。你的帖子將被刪除。"
    }
  ],
  "title": "PSA: Please stop posting here about WSB affairs. We are not a backup WSB subreddit. Your post will be removed.",
  "created_utc": 1611608638,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Just a quick PSA, because we are not going to leave personalized comments on the dozens of threads getting nuked here, things that are being taken down: </p>\n\n<ul>\n<li><p>WSB mods removed a thread on XYZ</p></li>\n<li><p>I think WSB is manipulating stocks</p></li>\n<li><p>WSB mods are not allowing discussion of [thing I want to discuss]</p></li>\n<li><p>WSB mods are children and shut the sub down</p></li>\n<li><p>anyone thinking <a href=\"/r/investing\">/r/investing</a> is the right venue to air out their thoughts on how bad it is that 12 year olds are gambling on Robinhood. </p></li>\n</ul>\n\n<p>We just don&#39;t care, and we certainly are not going to be a venue for anyone to complain about the moderation of another subreddit.  If you have a disagreement with the mods of WSB then slide in to their DM and let them know (modmail, don&#39;t actually DM a mod, that&#39;s weird), or go to one of the subreddits like <a href=\"/r/subredditdrama\">/r/subredditdrama</a> that are dedicated to this sort of dumb shit, but don&#39;t post about it here because that&#39;ll be immediately removed.</p>\n\n<p>This subreddit is for discussing investing, not for airing out disagreements with other subreddits.  I think I&#39;ve nuked a dozen threads on this topic, and two people have already been banned for re-posting removed threads.</p>\n\n<p><strong>E: I don&#39;t know how but lot&#39;s of confused comments here, &quot;WSB Affairs&quot; means we don&#39;t want to see people here bitching about things that happen on that subreddit.  It does not mean we&#39;re preventing any discussion of any actual trade, investment, whatever.  &quot;GME up 70000% in premarket&quot; is a thread that get&#39;s to stay because it&#39;s an investment topic.  &quot;WSB mods did a thing I don&#39;t like&quot; is not, that&#39;s reddit drama.  Simple enough.</strong></p>\n</div><!-- SC_ON -->",
  "score": 6158,
  "permalink": "/r/investing/comments/l4vyhe/psa_please_stop_posting_here_about_wsb_affairs_we/",
  "subreddit": "investing",
  "id": "l4vyhe",
  "is_self": true,
  "media": null,
  "is_video": false
}