{
  "author": "Witty_Run7509",
  "original_created_utc": 1624442223,
  "title": "What was the reaction of the East Germans when they realized they now had to live under communism?",
  "created_utc": 1624458531,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A significant portion of the Germans who became 1st generation citizens of East Germany would have been either active supporters of the Nazi regime, or at least tacit accomplices. Considering Nazis saw communism as one of their arch-enemy and an existential threat, I&#39;d imagine that more than a few of the new citizens of the newly formed DDR shared this view.</p>\n\n<p>How did these people react to the fact that they now had to live under a socialist state backed by the Bolsheviks?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/o69pjs/what_was_the_reaction_of_the_east_germans_when/",
  "subreddit": "AskHistorians",
  "id": "o69pjs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "A significant portion of the Germans who became 1st generation citizens of East\nGermany would have been either active supporters of the Nazi regime, or at least\ntacit accomplices. Considering Nazis saw communism as one of their arch-enemy\nand an existential threat, I'd imagine that more than a few…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "東ドイツの1世となったドイツ人のかなりの部分は、ナチス政権を積極的に支持していたか、少なくとも\n積極的にナチス政権を支持していたか、少なくとも暗黙の共犯者だったでしょう。\n暗黙の共犯者であったことでしょう。ナチスが共産主義を宿敵の一つと見なしていたことを考えると......。\nナチスが共産主義を宿敵の一つとし、存亡の危機と考えていたことを考えると、少なからずの...",
      "title": "共産主義のもとで生きていかなければならないことを知った東ドイツの人々は、どのような反応を示したのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在成为东德第一代公民的德国人中，有相当一部分人要么是纳粹政权的积极支持者，要么至少是纳粹政权的支持者。\n变成东德第一代公民的德国人中，有相当一部分是纳粹政权的积极支持者，或者至少是\n默许的帮凶。考虑到纳粹将共产主义视为他们的宿敌之一\n和生存的威胁，我可以想象，不止几个...",
      "title": "当东德人意识到他们现在必须生活在共产主义下时，他们的反应是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在成爲東德第一代公民的德國人中，有相當一部分人要麼是納粹政權的積極支持者，要麼至少是納粹政權的支持者。\n變成東德第一代公民的德國人中，有相當一部分是納粹政權的積極支持者，或者至少是\n默許的幫兇。考慮到納粹將共產主義視爲他們的宿敵之一\n和生存的威脅，我可以想象，不止幾個...",
      "title": "當東德人意識到他們現在必鬚生活在共產主義下時，他們的反應是什麼？"
    }
  ]
}