{
  "author": "Same_Old_Mistakes",
  "original_created_utc": 1639989052,
  "title": "Is it weird if my ex still has my nudes in his phone?",
  "created_utc": 1640006085,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I reconnected with an ex (we’ve been apart for like 8-9 months) come to find out that he never got rid of folder/ album with my nudes (also regular pictures) that I’ve sent him while we were in a relationship. Is that weird?&lt;/p&gt;\n\n&lt;p&gt;Edit: My ex and I agreed to deleting nudes when our relationship ended. So that’s where I feel a bit alarmed to still see a whole ass album of my nudes in his phone.&lt;/p&gt;\n\n&lt;p&gt;Another edit: For those of you asking why I even had his phone in the first place. When we reconnected and took pictures together with mutual friends. He handed me the phone to look through the pictures we took earlier that day so I can airdrop those pictures to my phone… I came across that album and I wasn’t even trying to snoop or look for anything at all. Before when we were in a relationship we had our phones unlocked and free to go through at any time. So maybe it was a habit of him to just give me his phone.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 263,
  "permalink": "/r/TooAfraidToAsk/comments/rkiilk/is_it_weird_if_my_ex_still_has_my_nudes_in_his/",
  "subreddit": "TooAfraidToAsk",
  "id": "rkiilk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So I reconnected with an ex (we’ve been apart for like 8-9 months) come to find\nout that he never got rid of folder/ album with my nudes (also regular pictures)\nthat I’ve sent him while we were in a relationship. Is that weird?\n\nEdit: My ex and I agreed to deleting nudes when our relationship…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "元彼と再会して（8〜9ヶ月ぶり）、気がついたら\n彼は私のヌード（普通の写真も）の入ったフォルダ/アルバムを処分していないことがわかりました。\n交際中に彼に送ったものです。これって変ですか？\n\n編集：元彼と私は、交際中にヌードを削除することに同意しました...",
      "title": "元彼の携帯に私のヌードが残っていたら変ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我和一个前任重新联系（我们已经分开了大约8-9个月），发现\n发现他从来没有把我的裸体照片（也有普通照片）的文件夹/相册删除过\n我给他的文件夹/相册里有我的裸照（也有普通照片），而我们在一起的时候，我给他发过这些照片。这很奇怪吗？\n\n编辑：我和我的前夫同意在我们的关系中删除裸体照片...",
      "title": "如果我的前男友的手机里还有我的裸照，这很奇怪吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我和一個前任重新聯繫（我們已經分開了大約8-9個月），發現\n發現他從來沒有把我的裸體照片（也有普通照片）的文件夾/相冊刪除過\n我給他的文件夾/相冊裏有我的裸照（也有普通照片），而我們在一起的時候，我給他發過這些照片。這很奇怪嗎？\n\n編輯：我和我的前夫同意在我們的關係中刪除裸體照片...",
      "title": "如果我的前男友的手機裏還有我的裸照，這很奇怪嗎？"
    }
  ]
}