{
  "author": "etheraider",
  "the_new_excerpt": "Square, Inc. Announces Fourth Quarter and Full Year 2020 Results Square also\nannounced a $170 million purchase in bitcoin as part of its ongoing commitment\nto the cryptocurrency\n\nFebruary 23, 2021 04:00 PM Eastern Standard Time SAN FRANCISCO--(BUSINESS\nWIRE)--Square, Inc. (NYSE: SQ) has posted its…",
  "original_created_utc": 1614114734,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "Square, Inc. 公布第四季度和2020年全年业绩Square还\n宣布购买1.7亿美元的比特币，作为其持续承诺的一部分。\n到加密货币\n\n2021年2月23日东部标准时间下午04:00旧金山--（美国商业\nWIRE）--Square, Inc. (NYSE: SQ)日前公布了其...",
      "title": "SQUARE购买价值1.7亿美元的比特币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Square, Inc. 公佈第四季度和2020年全年業績Square還\n宣佈購買1.7億美元的比特幣，作爲其持續承諾的一部分。\n到加密貨幣\n\n2021年2月23日東部標準時間下午04:00舊金山--（美國商業\nWIRE）--Square, Inc. (NYSE: SQ)日前公佈了其...",
      "title": "SQUARE購買價值1.7億美元的比特幣"
    }
  ],
  "title": "SQUARE Buys $170 Million Worth of Bitcoin",
  "created_utc": 1614123740,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Square, Inc. Announces Fourth Quarter and Full Year 2020 Results\nSquare also announced a $170 million purchase in bitcoin as part of its ongoing commitment to the cryptocurrency</p>\n\n<p>February 23, 2021 04:00 PM Eastern Standard Time\nSAN FRANCISCO--(BUSINESS WIRE)--Square, Inc. (NYSE: SQ) has posted its results for the fourth quarter and full year of 2020 on the Financials section of its Investor Relations website at investors.squareup.com and filed these results with the Securities and Exchange Commission.</p>\n\n<p>Square will host a conference call and earnings webcast at 2:00 p.m. Pacific time/5:00 p.m. Eastern time today to discuss these financial results. To register to participate in the conference call, or to listen to the live audio webcast, please visit the Events &amp; Presentations section of Square’s Investor Relations website at investors.squareup.com. A replay will be available on the same website following the call.</p>\n\n<p>Square also announced today that it has purchased approximately 3,318 bitcoins at an aggregate purchase price of $170 million. Combined with Square’s previous purchase of $50 million in bitcoin, this represents approximately five percent of Square’s total cash, cash equivalents and marketable securities as of December 31, 2020.</p>\n\n<p>Aligned with the company’s purpose, Square believes that cryptocurrency is an instrument of economic empowerment, providing a way for individuals to participate in a global monetary system and secure their own financial future. The investment is part of Square’s ongoing commitment to bitcoin, and the company plans to assess its aggregate investment in bitcoin relative to its other investments on an ongoing basis.</p>\n</div><!-- SC_ON -->",
  "score": 942,
  "permalink": "/r/CryptoCurrency/comments/lqt7ea/square_buys_170_million_worth_of_bitcoin/",
  "subreddit": "CryptoCurrency",
  "id": "lqt7ea",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332880688
}