{
  "author": "joeroganthumbhead",
  "the_new_excerpt": "I ask this because if your $2 million portfolio were to make an average ish 10%\nreturn, that means you made $200K plus whatever you make for your job, which is\nawesome. Would this be like owning a business in a way except that it is\ncompletely passive in comparison to managing a business such as a…",
  "original_created_utc": 1619767899,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私がこのように尋ねたのは、もしあなたの200万ドルのポートフォリオが平均的な10％のリターンを上げたとしたら\nのリターンを得たとすると、20万ドルの利益に加えて、あなたが仕事で得た金額を加えたことになり、これは素晴らしいことです。\n素晴らしいですね。これは、完全に受動的であることを除けば、ビジネスを所有しているようなものです。\nのようなビジネスを管理するのに比べて、完全に受動的であることを除けば、ビジネスを所有するようなものでしょうか？",
      "title": "200万ドルのポートフォリオを持つことは、ビジネスを所有することよりも良いのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我问这个问题是因为如果你的200万美元投资组合的平均收益率是10%左右\n的回报，这意味着你赚了20万美元，加上你的工作收入，这是\n真棒。这在某种程度上会不会像拥有一个企业，除了它是\n与管理企业相比，完全是被动的，比如......。",
      "title": "拥有200万美元的投资组合是否比拥有一个企业更好？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我問這個問題是因爲如果你的200萬美元投資組合的平均收益率是10%左右\n的回報，這意味着你賺了20萬美元，加上你的工作收入，這是\n真棒。這在某種程度上會不會像擁有一個企業，除了它是\n與管理企業相比，完全是被動的，比如......。",
      "title": "擁有200萬美元的投資組合是否比擁有一個企業更好？"
    }
  ],
  "title": "Is have a $2 million portfolio better than owning a business?",
  "created_utc": 1619781944,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I ask this because if your $2 million portfolio were to make an average ish 10% return, that means you made $200K plus whatever you make for your job, which is awesome. Would this be like owning a business in a way except that it is completely passive in comparison to managing a business such as a owning a restaurant?</p>\n\n<p>Any restaurant owners here? How much are you taking home a year? I don’t care about revenue, I wanna know how much free cash flow and money in your pockets.</p>\n</div><!-- SC_ON -->",
  "score": 3210,
  "permalink": "/r/stocks/comments/n1os7z/is_have_a_2_million_portfolio_better_than_owning/",
  "subreddit": "stocks",
  "id": "n1os7z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380966999
}