{
  "author": "dropbaby",
  "original_created_utc": 1655404108,
  "title": "What are the sources for Ronald Reagan \"funnelling crack into black communities\"?",
  "created_utc": 1655412609,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I hear all the time about the Reagan administration putting crack into black communities, then making crack have a higher mandatory minimum than cocaine, a more white used drug, and this system is all to imprison black people. &lt;/p&gt;\n\n&lt;p&gt;I know why Nixon started the drug war, and I know Nixon and Reagan&amp;#39;s attitudes on race, but what is our proof and sources we can cite to make the &amp;quot;crack in black communities&amp;quot; claim?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 163,
  "permalink": "/r/AskHistorians/comments/vdslqe/what_are_the_sources_for_ronald_reagan_funnelling/",
  "subreddit": "AskHistorians",
  "id": "vdslqe",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I hear all the time about the Reagan administration putting crack into black\ncommunities, then making crack have a higher mandatory minimum than cocaine, a\nmore white used drug, and this system is all to imprison black people.\n\nI know why Nixon started the drug war, and I know Nixon and Reagan's…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "レーガン政権が黒人にクラックを入れたという話はよく聞きますが\nコカインよりも最低使用料が高くなり、より白人に好まれるようになりました。\nこの制度は、すべて黒人を投獄するためのものです。\n\nニクソンが麻薬戦争を始めた理由も知っているし、ニクソンとレーガンの...",
      "title": "ロナルド・レーガンが「黒人のコミュニティーにクラックを流し込んだ」というソースは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我经常听到关于里根政府将裂纹放入黑人的说法。\n我经常听到里根政府把快克放到黑人社区，然后使快克的强制性最低限额高于可卡因，这是一种更多白人使用的毒品。\n更多白人使用的毒品，而这个系统都是为了监禁黑人。\n\n我知道尼克松为什么发动毒品战争，我也知道尼克松和里根的...",
      "title": "罗纳德-里根 \"向黑人社区输送裂缝 \"的来源是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我經常聽到關於里根政府將裂紋放入黑人的說法。\n我經常聽到里根政府把快克放到黑人社區，然後使快克的強制性最低限額高於可卡因，這是一種更多白人使用的毒品。\n更多白人使用的毒品，而這個系統都是爲了監禁黑人。\n\n我知道尼克松爲什麼發動毒品戰爭，我也知道尼克松和里根的...",
      "title": "羅納德-里根 \"向黑人社區輸送裂縫 \"的來源是什麼？"
    }
  ]
}