{
  "author": "ScottSteve101",
  "original_created_utc": 1655949282,
  "title": "How are ridiculously bright headlights legal?",
  "created_utc": 1655970029,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;They cause vision impairment. You get the same affect as when a cop shines that light in your mirrors so you can&amp;#39;t see what&amp;#39;s going on back there. Why is it legal? I saw a car ad where they were showing off their bright new headlights and it was so bright it was &amp;quot;xraying&amp;quot; the deer in the headlights. I get that wouldn&amp;#39;t happen but why do we need that? Atleast have them installed differently so it shines down at the road and not into every cars rearview and side mirrors. I get it they look nice but it can cause problems.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/vili20/how_are_ridiculously_bright_headlights_legal/",
  "subreddit": "NoStupidQuestions",
  "id": "vili20",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "They cause vision impairment. You get the same affect as when a cop shines that\nlight in your mirrors so you can't see what's going on back there. Why is it\nlegal? I saw a car ad where they were showing off their bright new headlights\nand it was so bright it was \"xraying\" the deer in the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "視力障害を起こすのです。警官がミラーを照らしたときと同じ効果があります\nミラーに光を当てると 後ろが見えなくなるのと同じです。なぜ、それが\n合法なんだ？車の広告で、新しい明るいヘッドライトを見せびらかすのを見たことがあります。\nとても明るくて、鹿を \"X線 \"で照らしているようだった...",
      "title": "バカみたいに明るいヘッドライトは、どうして合法なのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "它们会导致视力受损。你得到的影响与警察在你的后视镜上照射时一样\n灯光照在你的后视镜上，使你无法看到后面发生的事情。为什么它是\n合法吗？我看到一个汽车广告，他们在炫耀他们明亮的新大灯\n它是如此明亮，以至于 \"X射线 \"鹿在...。",
      "title": "荒唐的大灯怎么会是合法的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "它們會導致視力受損。你得到的影響與警察在你的後視鏡上照射時一樣\n燈光照在你的後視鏡上，使你無法看到後面發生的事情。爲什麼它是\n合法嗎？我看到一個汽車廣告，他們在炫耀他們明亮的新大燈\n它是如此明亮，以至於 \"X射線 \"鹿在...。",
      "title": "荒唐的大燈怎麼會是合法的？"
    }
  ]
}