{
  "author": "PunPryde",
  "original_created_utc": 1628410083,
  "title": "In the last 24 hours 91,785 shorts were liquidated representing $525 Million in crypto. Bears truly got rekt.",
  "created_utc": 1628422762,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In the last 24 hours 91,785 traders who shorted crypto got liquidated. This means they could no longer support their trades due to rise in prices and were forced to close or liquidate their positions.     </p>\n\n<p>In total, $525 Million of shorts were liquidated, top 5 by coin were: $210M on BTC, $200M on ETH, $40M on DOGE, $17M on XRP and $7M on CSPR. BTC and ETH took out a whopping 78% of  total liquidations on their own. The single largest liquidation was $27.8M... That guy is not having a good day!    </p>\n\n<p>In conclusion, don&#39;t try to short in the face of a history-making bull run that&#39;s still going strong. Bears truly got rekt and are fukt.</p>\n</div><!-- SC_ON -->",
  "score": 297,
  "permalink": "/r/CryptoCurrency/comments/p0arn1/in_the_last_24_hours_91785_shorts_were_liquidated/",
  "subreddit": "CryptoCurrency",
  "id": "p0arn1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In the last 24 hours 91,785 traders who shorted crypto got liquidated. This\nmeans they could no longer support their trades due to rise in prices and were\nforced to close or liquidate their positions.\n\nIn total, $525 Million of shorts were liquidated, top 5 by coin were: $210M on\nBTC, $200M on ETH,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この24時間で、cryptoをショートした91,785人のトレーダーが清算されました。これは\nつまり、価格の上昇により取引を支えることができなくなり、ポジションを閉じるか清算することを余儀なくされたのです。\nポジションを閉じるか清算することを余儀なくされました。\n\n合計で5億2500万ドルのショートが清算され、コイン別のトップ5は以下の通り。2億1,000万ドル\nBTCで2億1000万ドル、ETHで2億ドル、...。",
      "title": "この24時間で91,785枚のショートが清算され、5億2500万ドルの暗号化が行われた。熊は本当にやられた。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在过去24小时内，有91,785名做空加密货币的交易者被清算。这\n这意味着，由于价格上涨，他们无法再支持他们的交易，并被\n被迫关闭或清算他们的头寸。\n\n总共有5.25亿美元的空头被清算，按币种划分的前5名是。2.1亿美元的\nBTC的2亿美元，ETH的2亿美元，...",
      "title": "在过去24小时内，91,785个空头被清算，代表5.25亿美元的加密货币。熊市真的被打击了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在過去24小時內，有91,785名做空加密貨幣的交易者被清算。這\n這意味着，由於價格上漲，他們無法再支持他們的交易，並被\n被迫關閉或清算他們的頭寸。\n\n總共有5.25億美元的空頭被清算，按幣種劃分的前5名是。2.1億美元的\nBTC的2億美元，ETH的2億美元，...",
      "title": "在過去24小時內，91,785個空頭被清算，代表5.25億美元的加密貨幣。熊市真的被打擊了。"
    }
  ]
}