{
  "author": "dwin31",
  "original_created_utc": 1628686496,
  "title": "Kevin O'Leary on CNBC this morning - I'm increasing my crypto allocation from 3% to 7%",
  "created_utc": 1628703387,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Thats a pretty bullish statement from a very smart and also very critical investor. Love him or hate him (most probably hate him) he does his research and knows finance.</p>\n\n<p>One thing to note is that he says compliance is a huge issue for more institutional investments getting involved in the space.</p>\n\n<p>Personally that makes me think that if the compliance hurdle is cleared that could open the flood gates. I work for a company that lives in daily fear of compliance issues so I know the freeze it can put on things.</p>\n</div><!-- SC_ON -->",
  "score": 217,
  "permalink": "/r/CryptoCurrency/comments/p2choh/kevin_oleary_on_cnbc_this_morning_im_increasing/",
  "subreddit": "CryptoCurrency",
  "id": "p2choh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Thats a pretty bullish statement from a very smart and also very critical\ninvestor. Love him or hate him (most probably hate him) he does his research and\nknows finance.\n\nOne thing to note is that he says compliance is a huge issue for more\ninstitutional investments getting involved in the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "非常に賢く、また非常に批判的な投資家が、かなり強気の発言をしています。\n投資家である。彼のことを好きでも嫌いでも（ほとんどの人は嫌いでしょうが）、彼は自分の研究をし、金融を知っています。\n金融を知っている。\n\n注目すべき点は、彼が、より多くの機関投資家が投資に参加するためには、コンプライアンスが大きな問題であると言っていることです。\nコンプライアンスが大きな問題だと言っています。",
      "title": "今朝のCNBCに出演したKevin O Leary氏 - 私は暗号の配分を3%から7%に増やしています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是一个非常聪明、也非常挑剔的投资者所做的相当看好的声明。\n投资者。不管是爱他还是恨他（很可能是恨他），他都会做研究，并且了解金融。\n了解金融。\n\n有一点需要注意的是，他说合规是一个巨大的问题，因为更多的\n机构投资介入的巨大问题。",
      "title": "Kevin O'Leary今早在CNBC上发言 - 我将把我的加密货币配置从3%增加到7%。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是一個非常聰明、也非常挑剔的投資者所做的相當看好的聲明。\n投資者。不管是愛他還是恨他（很可能是恨他），他都會做研究，並且瞭解金融。\n瞭解金融。\n\n有一點需要注意的是，他說合規是一個巨大的問題，因爲更多的\n機構投資介入的巨大問題。",
      "title": "Kevin O'Leary今早在CNBC上發言 - 我將把我的加密貨幣配置從3%增加到7%。"
    }
  ]
}