{
  "author": "Sebanimation",
  "original_created_utc": 1632045999,
  "title": "Content Theft: Some people are copy&pasting whole articles from news pages or blogs and posting them as text posts to avoid the 90% karma loss.",
  "created_utc": 1632061843,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have noticed that several times before. I won&#39;t call out any users or posts but so many posts I have seen were just 1:1 copies of articles that appeared on other news pages. Most of the time there is no credit given.</p>\n\n<p>Sometimes you can find the authors name somewhere at the end. But given the circumstance that probably 60% of all only read the titles and the first words, nearly noone notices that.</p>\n\n<p>For the ones that don&#39;t know: All posts that are just a link to an external webpage are automatically flaired &quot;media&quot;. Media posts (and comedy) only get 10% karma for moons. By converting the article into a text, it no longer counts as a media post and you can avoid the karma penalty.</p>\n\n<p>If someone cites (or completely copies) a news article  written by another author, it should be made very clear right at the beginning. Either as a note in the beginning of the text, or by simply linking the original news article!</p>\n\n<p>Otherwise, this seems like a fishy way to avoid karma rules and farm more moons! Please don&#39;t do that! Give credit when you use other people&#39;s thoughts and words.</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/CryptoCurrency/comments/pr582d/content_theft_some_people_are_copypasting_whole/",
  "subreddit": "CryptoCurrency",
  "id": "pr582d",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I have noticed that several times before. I won't call out any users or posts\nbut so many posts I have seen were just 1:1 copies of articles that appeared on\nother news pages. Most of the time there is no credit given.\n\nSometimes you can find the authors name somewhere at the end. But given…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これまでに何度か気づいたことがある。ユーザー名や投稿名は伏せておきますが\n他のニュースページに掲載されている記事を1:1でコピーしただけの記事が多く見られました。\n他のニュースページに掲載された記事を1:1でコピーしたものです。ほとんどの場合、クレジットは表示されません。\n\n時々、最後のどこかに著者の名前を見つけることができます。しかし、それは...",
      "title": "コンテンツ・セフトです。90％のカルマ低下を避けるために、ニュースページやブログから記事を丸ごとコピー＆ペーストして、テキスト記事として投稿している人がいます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我以前曾多次注意到这一点。我不会叫出任何用户或帖子\n但我所看到的许多帖子都是1:1复制出现在其他新闻网页上的文章。\n其他新闻网页上的文章。大多数时候都没有注明出处。\n\n有时你可以在结尾处找到作者的名字。但鉴于...",
      "title": "内容盗窃。有些人从新闻网页或博客上复制&粘贴整篇文章，并将其作为文本帖子发布，以避免90%的因果关系损失。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我以前曾多次注意到這一點。我不會叫出任何用戶或帖子\n但我所看到的許多帖子都是1:1複製出現在其他新聞網頁上的文章。\n其他新聞網頁上的文章。大多數時候都沒有註明出處。\n\n有時你可以在結尾處找到作者的名字。但鑑於...",
      "title": "內容盜竊。有些人從新聞網頁或博客上覆制&粘貼整篇文章，並將其作爲文本帖子發佈，以避免90%的因果關係損失。"
    }
  ]
}