{
  "author": "ludwigia_sedioides",
  "the_new_excerpt": "I was buying big buckets to grow my weed in and I noticed on the door of the\nstore that they accept bitcoin, we've truly come full circle from bitcoin being\na thing you use to buy illegal drugs online to bitcoin being an acceptable\ncurrency that you can use at a store to buy legal marijuana products…",
  "original_created_utc": 1617337627,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我买了大桶来种植我的杂草，我注意到在门上的。\n店家说他们接受比特币，我们已经真正地从比特币被\n比特币是一种可以接受的在线购买非法药物的东西。\n货币，你可以使用 在商店购买合法的大麻产品... ...",
      "title": "大麻用品店接受比特币，真是生逢其时啊"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我買了大桶來種植我的雜草，我注意到在門上的。\n店家說他們接受比特幣，我們已經真正地從比特幣被\n比特幣是一種可以接受的在線購買非法藥物的東西。\n貨幣，你可以使用 在商店購買合法的大麻產品... ...",
      "title": "大麻用品店接受比特幣，真是生逢其時啊"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "マリファナを栽培するための大きなバケツを買っていたら、その扉には\n違法薬物をオンラインで購入するために使われていたビットコインから、ビットコインが受け入れられるようになったのです。\nビットコインはオンラインで違法薬物を購入するためのものだったのが、ビットコインはお店で使える通貨として受け入れられるようになりました。\nビットコインは、オンラインで違法薬物を購入するためのものから、お店で合法的なマリファナ製品を購入するための通貨として受け入れられるようになりました。",
      "title": "ビットコインを受け入れるマリファナ供給店、生きているとは何たることか"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "マリファナを栽培するための大きなバケツを買っていたら、その扉には\n違法薬物をオンラインで購入するために使われていたビットコインから、ビットコインが受け入れられるようになったのです。\nビットコインはオンラインで違法薬物を購入するためのものだったのが、ビットコインはお店で使える通貨として受け入れられるようになりました。\nビットコインは、オンラインで違法薬物を購入するためのものから、お店で合法的なマリファナ製品を購入するための通貨として受け入れられるようになりました。",
      "title": "ビットコインを受け入れるマリファナ供給店、生きているとは何たることか"
    }
  ],
  "title": "Marijuana supply store accepting bitcoin, what a time to be alive",
  "created_utc": 1617355917,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was buying big buckets to grow my weed in and I noticed on the door of the store that they accept bitcoin, we&#39;ve truly come full circle from bitcoin being a thing you use to buy illegal drugs online to bitcoin being an acceptable currency that you can use at a store to buy legal marijuana products (Canada)</p>\n</div><!-- SC_ON -->",
  "score": 400,
  "permalink": "/r/CryptoCurrency/comments/micunl/marijuana_supply_store_accepting_bitcoin_what_a/",
  "subreddit": "CryptoCurrency",
  "id": "micunl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961875615
}