{
  "author": "spritecut",
  "original_created_utc": 1625040546,
  "title": "Cryptocurrency is in the very early stages of creation and design.",
  "created_utc": 1625085019,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h3>You’re not investing in Coins, you’re investing in Software.</h3>\n\n<p>There is no such thing as a Bitcoin, an Ethereum or any other “coin”.</p>\n\n<p>Many people are under the erroneous impression that there are such things as atomic units of ‘coins’ that are moved from address to address and can therefore be tracked on the public chain. I think this mistake has its roots in language and analogy.</p>\n\n<p>Bitcoin is a digital currency, “coin” is in its name, the White Paper describes it as electronic cash and mentions “wallets.” As a result we talk about it like we talk about physical currency; like we talk about paper bills or coins. We say things like, “She gave me a bitcoin.” As a result, people tend to quite justifiably envision bitcoins as atomic units that are passed around. Even if they understand that bitcoins are sub-divisible to eight decimal places, and that those units are called satoshis, they may still think that those are the atomic units.</p>\n\n<p>This leads people to conceptualize bitcoins like a currency, as indivisible units, with serial numbers. But the coins and wallets analogy is just that: an analogy. <em>This is not at all how Cryptocurrency works.</em> </p>\n\n<h3>What you are investing in can be described as ‘software’.</h3>\n\n<p>It’s protocols, sets of rules governing how data is transmitted between devices and systems, and distributed ledgers, systems of recording these inputs and outputs. So why is this so interesting/exciting/revolutionary? The simplest reason is because it is immutable (each block is unchangeable once created) and decentralized (no single point of weakness in which it is vulnerable to attack, fraud or corruption). </p>\n\n<p>This is why it can be said “it’s less about making money and more about changing money”. When you invest into this technology, your are investing in projects and protocols that are a part of changing how the internet (and increasingly the real world) actually functions. </p>\n\n<h3>These protocols, if the hype is to be believed, will in part, fundamentally change how everything is organised.</h3>\n\n<p>From financial systems (exchanges, savings, investments, loans), supply chains, databases, trading networks, telecommunications, medical records, insurance, and even the very infrastructure of the internet itself.</p>\n\n<p><em>Congratulations, you will probably get wealthy by investing into these projects as this is definitely in the early stages.</em> </p>\n\n<h3>Think of Bitcoin as Mercedes Benz in 1886, Ethereum as Ford in 1903, and other coins as all the other manufacturers, hot(wheels) on their heels.</h3>\n\n<p>(Doge is clearly the DeLorean of crypto). </p>\n\n<p>But more importantly in my opinion, for good and ill, it is literally going to change the world<a href=\"https://1.bp.blogspot.com/-I84Smnucv6Q/UOkgbj_oY7I/AAAAAAAAAEU/bagN3sb0OxM/s1600/207362.1-lg.jpg\">.</a></p>\n</div><!-- SC_ON -->",
  "score": 153,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/gfbgL4usNKzjVJbOjqDR7GD-iGAbEKXaLlhr7iC3FPA.jpg?auto=webp&s=e94fc3e92332ab09ea27857a8372f209adb03b3a",
          "width": 808,
          "height": 650
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/gfbgL4usNKzjVJbOjqDR7GD-iGAbEKXaLlhr7iC3FPA.jpg?width=108&crop=smart&auto=webp&s=a047433df8bf63c27b10c73e79c430af30154579",
            "width": 108,
            "height": 86
          },
          {
            "url": "https://external-preview.redd.it/gfbgL4usNKzjVJbOjqDR7GD-iGAbEKXaLlhr7iC3FPA.jpg?width=216&crop=smart&auto=webp&s=bdba560460224b9013a0b16e6c088a3bf664a4c9",
            "width": 216,
            "height": 173
          },
          {
            "url": "https://external-preview.redd.it/gfbgL4usNKzjVJbOjqDR7GD-iGAbEKXaLlhr7iC3FPA.jpg?width=320&crop=smart&auto=webp&s=10852bb9f79e04fef1a0915be3546f21ef7e72f1",
            "width": 320,
            "height": 257
          },
          {
            "url": "https://external-preview.redd.it/gfbgL4usNKzjVJbOjqDR7GD-iGAbEKXaLlhr7iC3FPA.jpg?width=640&crop=smart&auto=webp&s=597dd952c72d74a67b3ebb8f3ec69c3852a485a5",
            "width": 640,
            "height": 514
          }
        ],
        "variants": {},
        "id": "VqBEyOqCt2wEtJIqEOBttq3IAUKlfyHW7KxOaVrLHBk"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/oasnrd/cryptocurrency_is_in_the_very_early_stages_of/",
  "subreddit": "CryptoCurrency",
  "id": "oasnrd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "YOU’RE NOT INVESTING IN COINS, YOU’RE INVESTING IN SOFTWARE.\n\nThere is no such thing as a Bitcoin, an Ethereum or any other “coin”.\n\nMany people are under the erroneous impression that there are such things as\natomic units of ‘coins’ that are moved from address to address and can therefore\nbe…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "あなたはコインに投資しているのではなく、ソフトウェアに投資しているのです。\n\nビットコインやイーサリアムなどの「コイン」というものは存在しません。\n\n多くの人は、以下のような誤った印象を持っています。\n多くの人は、アドレスからアドレスへと移動する原子単位の「コイン」が存在し、それゆえに\nそのために...",
      "title": "暗号通貨は、創造と設計の非常に初期の段階にあります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你不是在投资钱币，你是在投资软件。\n\n没有比特币、以太坊或任何其他 \"硬币 \"这样的东西。\n\n许多人都有一个错误的印象，认为有这样的东西\n币的原子单位，在地址之间移动，因此可以\n是...",
      "title": "加密货币正处于创造和设计的早期阶段。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你不是在投資錢幣，你是在投資軟件。\n\n沒有比特幣、以太坊或任何其他 \"硬幣 \"這樣的東西。\n\n許多人都有一個錯誤的印象，認爲有這樣的東西\n幣的原子單位，在地址之間移動，因此可以\n是...",
      "title": "加密貨幣正處於創造和設計的早期階段。"
    }
  ]
}