{
  "author": "OElementsO",
  "original_created_utc": 1647620626,
  "title": "Am I being scammed?",
  "created_utc": 1647635510,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey, I&amp;#39;m really hoping some experts in here are able to explain/tell me if I&amp;#39;m being scammed. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m a guy and I&amp;#39;ve been speaking with a girl from another country for about 3 months now. I would say its more than a friendship. &lt;/p&gt;\n\n&lt;p&gt;Anyway, very early on in our conversations she brought up crypto mining and said that I should do it, and she would show me how.\nI did some research and thought there&amp;#39;s no way I can crypto mine, 1: I&amp;#39;m not clever enough and 2: I haven&amp;#39;t even got a computer,  let alone super computer power. &lt;/p&gt;\n\n&lt;p&gt;She then got me to download a digital wallet app and another app where I will transfer my crypto too. We are &amp;#39;mining&amp;#39; USTD, which is a stable coin. \nHowever,  I&amp;#39;m sure it&amp;#39;s not crypto mining, she&amp;#39;s basically give me a hyperlink to use on the DApps (Decentralized apps) which takes me through to a mining pool where I can claim anywhere from 1-6% interest daily (depending on my wallet balance) &lt;/p&gt;\n\n&lt;p&gt;So I started off putting 100 USDT to see if it would work,  and it sure did. I was receiving 1.5% everyday, but that&amp;#39;s hardly nothing. After 3 weeks I put 1000 USDT in and was reaping a 3% interest everyday. &lt;/p&gt;\n\n&lt;p&gt;Fast forward a couple months,  obviously I have been speaking to this girl everyday and the trust levels are building. Last week, I deposited another 8300 USDT to boost it to 10,000. That way i get 3.5% of that everyday. She tells me she has over 100,000 deposited which means she gets 4.5% daily,  she makes 4500 USDT in one day... &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve made 2,300 USTD in the last 6 days, since I increased my balance to 10,000. But it all seems way too good to be true?? Surely no one can make this much money a day, for literally doing nothing. &lt;/p&gt;\n\n&lt;p&gt;This girl I&amp;#39;m speaking to now wants me to deposit even more to take advantage of even higher interest rates,  and it&amp;#39;s making me suspicious. Could she literally take my money through the 3rd party DApp? &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve already deposited money to my bank twice before and have been successful, so withdrawing the cash isn&amp;#39;t an issue. &lt;/p&gt;\n\n&lt;p&gt;I done some research on &amp;#39;Coin Staking&amp;#39; and this sounds a lot similar to what I&amp;#39;m actually doing.  With coin staking, your essentially donating your crypto assets to contribute to the blockchain, and you get rewarded each time a transaction gets validated. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m really hoping someone can help shed some light on what I&amp;#39;m actually involved in. I&amp;#39;m happy to answer any questions. &lt;/p&gt;\n\n&lt;p&gt;Thanks so much!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 345,
  "permalink": "/r/CryptoCurrency/comments/th57jy/am_i_being_scammed/",
  "subreddit": "CryptoCurrency",
  "id": "th57jy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hey, I'm really hoping some experts in here are able to explain/tell me if I'm\nbeing scammed.\n\nI'm a guy and I've been speaking with a girl from another country for about 3\nmonths now. I would say its more than a friendship.\n\nAnyway, very early on in our conversations she brought up crypto mining…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、このサイトの専門家の方々に、私がこのような状況に置かれていることを説明し、教えていただけることを望んでいます。\n詐欺にあった\n\n僕は男で、他の国から来た女の子と3年ほど話しています。\nヶ月になります。セフレ以上と言ってもいいくらいです。\n\nとにかく、私たちの会話のごく初期に、彼女は暗号マイニングの話を持ち出しました...",
      "title": "私は詐欺に遭っているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嘿，我真的希望这里的一些专家能够解释/告诉我，如果我是\n被诈骗了。\n\n我是一个男人，我和一个来自另一个国家的女孩交谈了大约3个月。\n个月了。我想说的是，这不仅仅是一种友谊。\n\n总之，在我们谈话的早期，她提到了加密货币开采...",
      "title": "我被骗了吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嘿，我真的希望這裏的一些專家能夠解釋/告訴我，如果我是\n被詐騙了。\n\n我是一個男人，我和一個來自另一個國家的女孩交談了大約3個月。\n個月了。我想說的是，這不僅僅是一種友誼。\n\n總之，在我們談話的早期，她提到了加密貨幣開採...",
      "title": "我被騙了嗎？"
    }
  ]
}