{
  "author": "Heddron",
  "original_created_utc": 1654520019,
  "title": "When did it stop being normal for Leaders (Generals, Kings, etc) to die in battle?",
  "created_utc": 1654551316,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Lately I have been seeing lots of news stories about Generals being killed on the front lines in Eastern Europe. I know this must have been quite common before modern communication technology came into being, but when was that? Was this common in the 18th century? 19th? Did it vary by region? Or was it never really common, and this is just my modern biases?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/v62uzx/when_did_it_stop_being_normal_for_leaders/",
  "subreddit": "AskHistorians",
  "id": "v62uzx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Lately I have been seeing lots of news stories about Generals being killed on\nthe front lines in Eastern Europe. I know this must have been quite common\nbefore modern communication technology came into being, but when was that? Was\nthis common in the 18th century? 19th? Did it vary by region? Or…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、将兵が殺されるニュースをよく目にする。\n最近、東欧の最前線で戦死した将軍のニュースをよく目にします。通信技術が発達する以前にはよくあったことだと思うのですが\nたのでしょうが、それはいつのことでしょうか。18世紀？\n18世紀？19世紀？地域によって違いがあったのでしょうか？それとも...",
      "title": "リーダー（将軍、王など）が戦死することが当たり前でなくなったのはいつからか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近，我看到了很多关于将军们被杀害的新闻报道。\n在东欧的前线被杀的新闻。我知道在现代通信技术出现之前，这一定是很常见的\n在现代通信技术出现之前，这种情况一定很常见，但那是什么时候？是在18世纪吗？\n这在18世纪很常见吗？19世纪呢？它是否因地区而异？或者...",
      "title": "领导人（将军、国王等）在战斗中死亡何时不再是正常现象？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近，我看到了很多關於將軍們被殺害的新聞報道。\n在東歐的前線被殺的新聞。我知道在現代通信技術出現之前，這一定是很常見的\n在現代通信技術出現之前，這種情況一定很常見，但那是什麼時候？是在18世紀嗎？\n這在18世紀很常見嗎？19世紀呢？它是否因地區而異？或者...",
      "title": "領導人（將軍、國王等）在戰鬥中死亡何時不再是正常現象？"
    }
  ]
}