{
  "author": "smurf-this",
  "original_created_utc": 1631221951,
  "title": "Why do so many movies and TV shows have volume levels within the show that vary wildly? The scenes will be almost whisper quiet and then suddenly ear-splittingly loud. I find myself constantly having to change the volume when its too loud and then too quiet. Seems to happen with many shows/movies",
  "created_utc": 1631241536,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Edit: The answer I was looking for was probably Volume Leveling. I turned it on in the tvs audio options, and now the audio comes at a fairly even level and i dont find myself adjusting it much</p>\n\n<p>maybe dynamic range compression is the same thing? </p>\n</div><!-- SC_ON -->",
  "score": 111,
  "permalink": "/r/NoStupidQuestions/comments/pl6s0x/why_do_so_many_movies_and_tv_shows_have_volume/",
  "subreddit": "NoStupidQuestions",
  "id": "pl6s0x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Edit: The answer I was looking for was probably Volume Leveling. I turned it on\nin the tvs audio options, and now the audio comes at a fairly even level and i\ndont find myself adjusting it much\n\nmaybe dynamic range compression is the same thing?",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "編集部：私が探していた答えは、おそらく「ボリューム・レベリング」でした。私はこれをオンにして\nテレビのオーディオオプションでオンにしたところ、音声がかなり均一なレベルで来るようになり\n自分ではあまり調整しないようにしています。\n\nもしかしたら、ダイナミックレンジ圧縮も同じようなものなのでしょうか？",
      "title": "なぜ多くの映画やテレビ番組では、番組内の音量レベルが大きく変化するのでしょうか？静かなシーンがあったかと思えば、突然耳をつんざくような大音量になったりします。私は、音量が大きすぎたり小さすぎたりすると、常に音量を変えなければならないことに気づきます。多くの番組や映画でこのようなことがあります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "编辑：我正在寻找的答案可能是音量调节。我把它打开了\n在电视的音频选项中打开，现在音频的水平相当均匀，而且我\n我没有发现自己调整了很多\n\n也许动态范围压缩是同样的事情？",
      "title": "为什么这么多电影和电视节目的音量在节目中变化很大？场景几乎是悄无声息的，然后突然间大得刺耳。我发现自己在音量过大和过小时不得不不断地改变音量。似乎许多节目/电影都有这种情况。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "編輯：我正在尋找的答案可能是音量調節。我把它打開了\n在電視的音頻選項中打開，現在音頻的水平相當均勻，而且我\n我沒有發現自己調整了很多\n\n也許動態範圍壓縮是同樣的事情？",
      "title": "爲什麼這麼多電影和電視節目的音量在節目中變化很大？場景幾乎是悄無聲息的，然後突然間大得刺耳。我發現自己在音量過大和過小時不得不不斷地改變音量。似乎許多節目/電影都有這種情況。"
    }
  ]
}