{
  "author": "MrPivens",
  "the_new_excerpt": "Disclaimer: New to r/stocks [/r/stocks] but hoping this post isn't violating any\nboard rules. If it does, I am sorry and will take it to the right board. I am a\nstock market newbie who is sharing my own investment journey in order to inspire\nothers, become better at investing, and encourage healthy…",
  "original_created_utc": 1615506713,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "声明：新加入r/stocks[/r/stocks]，但希望这个帖子没有违反任何规定。\n董事会规则。如果是这样，我很抱歉，我会把它带到正确的板块。我是一个\n股市新兵，分享自己的投资历程，希望能给大家带来启发。\n别人，成为更好的投资，并鼓励健康... ...",
      "title": "100美元的挑战 - 更新1 (3/11/2011), +$14 (14%)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "聲明：新加入r/stocks[/r/stocks]，但希望這個帖子沒有違反任何規定。\n董事會規則。如果是這樣，我很抱歉，我會把它帶到正確的板塊。我是一個\n股市新兵，分享自己的投資歷程，希望能給大家帶來啓發。\n別人，成爲更好的投資，並鼓勵健康... ...",
      "title": "100美元的挑戰 - 更新1 (3/11/2011), +$14 (14%)"
    }
  ],
  "title": "$100 Challenge - Update 1 (3/11/2011), +$14 (14%)",
  "created_utc": 1615520931,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><em>Disclaimer: New to</em> <a href=\"/r/stocks\">r/stocks</a> <em>but hoping this post isn&#39;t violating any board rules. If it does, I am sorry and will take it to the right board. I am a stock market newbie who is sharing my own investment journey in order to inspire others, become better at investing, and encourage healthy discussion.</em></p>\n\n<p><strong>The Goal:</strong> Max profits off a $100 MAX initial investment. </p>\n\n<p><strong>The rules:</strong></p>\n\n<ol>\n<li><strong>Deposit $100</strong> into a non-Robinhood trading service (I used Webull)</li>\n<li><strong>Make good decisions:</strong> Calculated buying/selling decisions to increase the value of the account.</li>\n<li><strong>Don&#39;t rely on referrals:</strong> Referral bonuses are fine, but shouldn&#39;t count towards gains. </li>\n<li><strong>Post weekly updates</strong> with progress and a rundown of gains, losses, decisions, and takeaways.</li>\n</ol>\n\n<p><strong>Why am I doing this:</strong> I&#39;m a novice investor. Like many, I was swept up in the recent meme stock mania. Along the way I realized that I REALLY like diving deep into a company, making an investment, and watching that investment grow over the short term. </p>\n\n<p><strong>Starting Point: 2/26</strong></p>\n\n<ul>\n<li>Initial Investment $100</li>\n<li>Bought: 14 shares of $ARLO @ $6.99/share\n\n<ul>\n<li>Rationale: I believe personal home security as an industry will grow in popularity over the next few years. From Youtubers posting package thieves to cheaters caught on camera, I think the trend is here to stay.</li>\n</ul></li>\n</ul>\n\n<p><strong>Update 1 - 3/11/21</strong></p>\n\n<p>Sold: 14 shares of $ARLO @ $8/share (+14% gain)</p>\n\n<ul>\n<li>Rationale: Recent <a href=\"https://www.washingtonpost.com/technology/2021/03/10/verkada-hack-surveillance-risk/\">news</a> about security cam hacks has me nervous about the short term for this stock.</li>\n<li>Bought: 7 shared of $FNKO @ $15.50/share</li>\n<li>Rationale: Good market share, positive EPS in Q3 2020, and they beat estimates by a wide margin. They are also reporting earnings this afternoon. I think their products are reasonably priced, popular, and Covid is keeping people indoors, decorating their home offices with small low-priced figurines. Here&#39;s hoping...</li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/stocks/comments/m348wh/100_challenge_update_1_3112011_14_14/",
  "subreddit": "stocks",
  "id": "m348wh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147381386
}