{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "If you’re looking for a quick trade or pump, this is not it.  I wrote this to have a searchable document for future reference.  It addresses much of the false and misleading information that’s been published on Paysafe. This undervalued Fintech represents around 15% of my portfolio but I continue to drill down on it because I find it the most intriguing with significant and reliable long-term upside.\n\nIn the short term, anything is possible. Q3ER is pre-market, [November 11](https://ir.paysafe.com/news-events/press-releases/detail/118/paysafe-reschedules-third-quarter-earnings-results-to).  ForDespite beating Q2 consensus on [revenue](https://www.reddit.com/r/MillennialBets/comments/p5io00/paysafe_psfe_q2_er_meets_guidance_beats_analyst/) and [EPS](https://finance.yahoo.com/quote/PSFE), reporting a [41% gain](https://finance.yahoo.com/news/paysafe-reports-second-quarter-2021-105500808.html) in total volume and reaffirming full-year guidance, the stock price severely gapped down and continued to fall 30%, on soft [Q3 guidance](https://www.reddit.com/r/PSFE/comments/qcxsjc/paysafes_q3_guidance_pointing_to_q4/).\n\nBy any reasonable measure, the already guided Q3 miss is more than priced in at this point.\n\nI hesitated to share this because it may simply be best for those lacking conviction in PSFE’s long-term value to sell so that the upcoming trend reversal can take hold.  Still, I believe in making decisions based on accurate information. A recent [SEC filing](https://www.sec.gov/Archives/edgar/data/1833835/000156459021050428/psfe-424b3.htm) indicates that the stock’s downtrend is not the institutional selling that bears have claimed (see Parts 4 & 5), but a rotation away from retail shareholders who, like whipped dogs beat into submission, are easily shaken out by disinformation and tactical intraday short volume (there has been plenty of both). As Paysafe Chairman Bill Foley [acknowledged](https://investor.cannaeholdings.com/static-files/39080000-7cb6-4379-8650-9a10ebde608b), the stock “has been unduly punished as the inevitable shareholder rotation plays out.”\n\nSome have justifiably complained that management is not engaging the media to support share value. As the number of institutional owners has grown from 180 to 297 over the last quarter, it may simply be that management is quietly allowing a more stable investor base to take over in order to better secure long-term share value. After all, from the outset Foley did give fair warning that he’s not concerned with short-term investors (oddly cut from this [interview](https://www.cnbc.com/video/2021/03/29/bill-foley-on-why-hes-excited-to-take-paysafe-public-via-spac-merger.html)).\n\n&#x200B;\n\nTLDR: As an off-ramp from the in-depth review below, here’s a fair assessment from RBC’s 5-star analyst Daniel Perlin: “PSFE remains a complex story as the company grows over divestitures and portfolio adjustments, creating difficult comparisons, while also calibrating the Street on weaker seasonal patterns implicit in Q3/21 guidance, followed by an expected rebound in Q4. In addition, recent acquisitions push leverage to \\~5.3x net debt-to-(adj.)EBITDA, which should de-lever quickly heading into FY22, but likely pressures the stock near-term as investors peel back the layers to gain visibility into H2/21 and into FY22.”  (Perlin rates it a “Buy” w/ $15 PT and expects -$0.07 EPS for Q3.)\n\nWith that, here’s one person’s attempt to “peel back the layers” on:\n\n1. Growth\n2. Debt\n3. Profit\n4. Float\n5. Blackstone Group\n6. Insider Ownership\n7. Competition\n8. Management\n9. Lockup Expiry\n10. Valuation\n\nNote: Since there’s a lot to cover, I’ll break this up into 4 posts as I write them over the next 4 days.  (The section headings above will become links.)\n\n&#x200B;\n\n# 1. Growth\n\nPaysafe just went public 6 months ago so it’s natural to focus on very recent numbers which reflect a 12-18 month transitional slow-down due to Covid-related closures of live sporting events and brick & mortar retail along with strategic exits as part of the company’s efforts to de-risk future growth.\n\nIn the coming quarters, management expects bolstered growth from a post-Covid reopening, a lapping of legacy de-risking measures, their ongoing expansion into the US iGaming market, and their ongoing US rollout of digital wallet Skrill, which is expected to become “a second engine of growth on top of the payment processing growth.”\n\nUnlike many companies going public with lofty growth projections, Paysafe’s investor presentation offered the initial estimate of 10.4% growth, conservatively pegging it to the payments sector as a whole.  However, in a recent [conference](https://bmo.qumucloud.com/view/2021-digitalbanking-paysafe#/), Paysafe CEO, Philip McHugh quietly upgraded that projection with a revealing break down of their business mix:\n\n* 45% of business is expected to grow 8-10%\n* 55% of their business is expected to grow 15-20%.\n\nThat’s a weighted organic growth of 11.9 - 15.5%.\n\nAdd in the expected 3.9% inorganic growth from their two recent LATAM acquisitions ($60m rev@55%CAGR), and that 10.4% projection suddenly looks more like 15.8% to 19.4%.\n\nFor a mature company operating at scale with over $100 billion in transactional volume, that’s solid growth on par with PayPal’s last three-year range of 15.02% - 20.72%.\n\nAs a reference, this would put Paysafe's 2022E revenue between $1.79 to $1.87 billion, beating the consensus estimate of $1.75 billion.\n\nAdditional factors not yet included in growth projections:\n\n1. Due to that 45%/55% business mix, when over half of the business is growing twice as fast as the rest, the weighted blend shifts over time until that faster growth rate predominates.\n2. That same compounding effect on overall blend applies to the two acquisitions, PagoEfectivo and Miami-based SafetyPay, [reported](https://d1io3yog0oux5.cloudfront.net/_22bb7ead34a47affd0aaab44e42d92dc/paysafe/db/1111/9781/file/2Q21+Paysafe+Earnings+Presentation+vFinal.pdf) to be growing at a combined 55% CAGR with 80%+ bank coverage in Latin America, “one of the fastest growing eCommerce markets out there.”\n3. Moreover, forward growth estimates do not factor in several “post synergy multiples” related to these acquisitions. For example, Paysafe’s eCash and digital wallet products will be introduced to fertile markets where more than half of the population fits their “underbanked” target profile (i.e. those who primarily use cash; don’t have bank accounts or credit cards or simply want to protect their personal information but are actively moving to mobile devices and seeking ways to engage in eCommerce, iGaming and digital person to person payments). \n4. Including SafetyPay’s 20,000 new collection points in seven European countries, the two deals add a combined 320,000 collection points and 90% bank coverage over 11 new Latin American countries, giving Paysafe one of the largest Fintech footprints in the region. Management says: “These transactions are expected to be accretive to 2022 and further enhance our long-term growth as we drive multiple cross-selling opportunities across all Paysafe business units.”\n5. Also not yet factored into projections, these acquisitions lay critical groundwork in Latin America’s emerging sports betting market, [estimated](https://www.yogonet.com/international/noticias/2021/08/03/58633-online-sports-betting-grows-rapidly-in-latin-america) to be worth $7-10 billion, growing at 20% CAGR. Importantly, with Paysafe’s direct marketing and leadership in iGaming payment processing, the deals facilitate easy expansion for their many partners like Roblox, Draftkings, WynnBet, ESL Gaming, BetMGM, PointsBet, Penn, Twitch, Betfred, bet365 etc. As CEO McHugh notes, “We service Xbox, Youtube, Spotify and iGaming companies. And just being able to connect global companies to more and more markets with a single relationship was an easy synergy for us.”\n6. Additionally, SafetyPay recently tapped into 134 million new customers with the recent [rollout](https://www.qrcodepress.com/safetypay-qr-codes/8539360/) of its QR codes across Brazil enabling real-time transactions on the PIX mobile payment platform, with a [TPV of $100 billion](https://twitter.com/benedictevans/status/1452229529771122696?s=20). This new QR code offers the unique benefit of [allowing](https://www.prnewswire.com/news-releases/safetypay-launches-qr-codes-for-real-time-payments-in-brazil-301294286.html) “non-credit card holders and fraud-wary consumers” to make bank payments and engage in eCommerce without risking personal information. Brazil is expected to account for a [third](https://thefintechtimes.com/safetypay-qr-codes-and-cross-border-transactions-are-top-priority-for-payments-in-latin-america/) of the LATAM eCommerce market.\n7. Further, projections don’t yet include inorganic/organic growth or potential synergies from their third recent acquisition, [viafintech](https://www.businesswire.com/news/home/20210822005021/en/Paysafe-to-Acquire-viafintech/?feedref=JjAwJuNHiystnCoBq_hl-XEemlDQ6NgDkiei3bSxnzGlJCVVeQL8sr5Wvng8AXxRSfe41V1BKA-b6v2ZVrSSNs-dUYKiDvY7XniNSqv88QcY1Ge_vf9QIMZ4alzIf_0HE01s4RTGeX_C4TDnN9C9Cg==), which adds a network of 20,000 points of sale in six European countries. This expands their eCash business (just posted 37% YoY growth), which taps into the “underbanked” as described above (1.7 billion consumers globally). While this deal protected and gained market shares, it was also a KYC software acquisition that will provide their digital wallets with a more streamlined point-of-sale “mobile ATM” function through phone-based digital banking. Management expects this to better position Paysafe “as an essential payments partner to challenger banks around the world as consumer banking habits continue to evolve.” Direct relationships with rapidly growing branchless “challenger bank” (AKA neobanks) are a key driver in Paysafe’s growth strategy in “[open banking](https://www.digitaltransactions.net/how-paysafe-sees-its-safetypay-deal-as-a-major-move-into-open-banking/)”.\n8. The viafintech deal also includes a new strategic partnership with Glory Ltd to add Paysafe’s eCash solution, paysafecard, to its global physical presence. Glory Ltd, (11,000 employees), has physical locations in 20 countries and is used in 100 countries across Europe, Asia, N.America, S.America, the Middle East and Africa.\n9. Enhanced global eCash/digital wallet synergy: Once integrated, these three acquisitions bring Paysafe’s global eCash business to over a million distribution points in 60 countries. Along with their newly launched US advertising [campaign](https://www.businesswire.com/news/home/20210928005792/en/) for Skrill, the integration of their digital wallets and eCash platforms in these new markets greatly enhance Paysafe’s position in the large US/LATAM and EU/LATAM remittance markets. Notably, viafintech recently announced a [deal](https://ffnews.com/newsarticle/viafintech-and-n26-launch-cash26-in-spain-a-service-for-digital-banking/) in Spain with fast growing neobank N26 which, combined with Paysafe's other acquisitions, creates a direct connection in the $18 billion remittance market between Spain and South America. Overall, this is a high-margin $700 billion global market.\n10. US wagering: Paysafe is already established with 75% of all US iGaming operators and they just [reported](https://d1io3yog0oux5.cloudfront.net/_22bb7ead34a47affd0aaab44e42d92dc/paysafe/db/1111/9781/file/2Q21+Paysafe+Earnings+Presentation+vFinal.pdf) a 72% increase in year-over-year volume with a 48% YoY increase in revenue, however, their growth estimates don’t include the many US states expected to legalize sports betting going forward.\n11. Paysafe’s growth estimates also don’t include the full potential from Canada’s newly legalized betting market. This is a market where Paysafe is already positioned with 100% of all operators. Starting at roughly $1 billion, Deloitte Canada projects 94% CAGR to [$28 billion within five years](https://www2.deloitte.com/ca/en/pages/consumer-business/articles/ca-new-stakes-in-the-game.html) ($22 billion USD).\n12. Paysafe also dominates sports betting in Europe which, according to The European Business Review, is [projected](https://www.europeanbusinessreview.com/the-rise-of-sports-betting-wagering-worldwide/) to grow 30.6% CAGR, more than tripling from $24.7 billion Euros in 2020 to 94 billion Euros ($109 billion USD) by 2024.\n13. It’s important to note that, as a payment processor, Paysafe’s revenue is not made up from a fraction of iGaming operator revenue, but as a fraction of total pay-in/pay-out transactional volume (TPV). Over the next five years, the US sports betting handle (pay-in wagering) is [estimated](https://www.casino.org/news/ark-invest-sees-online-sports-betting-handle-jumping-to-180-billion/) by some to grow to as much as $180 billion. With Paysafe’s expectation of 20% US marketshare, the TPV of the US market alone has the potential to triple Paysafe’s overall revenue. This is not a prediction but an interesting reference for the implications of Paysafe’s dominant position in these many high-growth markets, all with long-term secular tailwinds.\n14. Lastly, Paysafe’s newly launched travel safeguarding [model](https://www.paysafe.com/fileadmin/content/pdf/Safeguarding-the-future-of-travel.pdf), presents another new revenue stream that should not be discounted. Demand for this unique new offering is self evident.  Almost as soon as it was [announced,](https://www.paysafe.com/en/paysafegroup/news/detail/paysafe-launches-safeguarding-model-for-the-travel-industry-globally/) they signed a [deal](https://www.paysafe.com/eu-en/paysafegroup/news/detail/paysafe-and-arc-partner-to-deliver-innovative-payments-solution-for-airlines/) with [ARC](https://www2.arccorp.com/globalassets/about-us/our-data/third-party/arc-data.pdf), who has a network of over 200 major airlines globally and processes $97 billion annually.\n\nWith their recent expansion into new untapped markets and their unquestioned dominance in existing markets estimated to ramp to 30-94% CAGR, it’s not a stretch to consider that the compounded effect of the above fourteen factors taken together, might add a modest 5-10% to overall growth (I suspect more).  Add that to the 15.8% to 19.4% growth described above, and the resulting 21-30% annual growth would practically double the growth model on which 9 analysts have based their average price target of \\~$14.\n\nTime will tell but such a growth prospect is supported their recently reported 41% increase in volume and an adjusted 23% YoY revenue growth, when excluding last year’s divestiture and discrete Direct Marketing exits (both part of their strategy to de-risk forward growth).  It also doesn’t hurt that, including that slow period, they have a long track record of 30.7% CAGR between 2011 and 2020 ([$128m](https://www.investing.com/analysis/optimal-payments:-still-at-discount-despite-ebitda-growth-137908) to [$1.43b](https://d1io3yog0oux5.cloudfront.net/_60f30e3ae06e5db5459655316a65dc97/paysafe/db/1111/9761/file/Supplemental+Financial+Information_+Paysafe+Limited_+Q1+2021.xlsx)).\n\n&#x200B;\n\nThe remaining Parts 2-10 of this article will be linked above as it’s written.",
  "author_fullname": "t2_9nlylbfc",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Peeling Back the Layers on Paysafe (PSFE)",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": "tickerdiscussion",
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_qkgndd",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.88,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 76,
  "total_awards_received": 2,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Company Discussion",
  "can_mod_post": false,
  "score": 76,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": 1635785584,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {
    "gid_1": 1
  },
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1635781115,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If you’re looking for a quick trade or pump, this is not it.  I wrote this to have a searchable document for future reference.  It addresses much of the false and misleading information that’s been published on Paysafe. This undervalued Fintech represents around 15% of my portfolio but I continue to drill down on it because I find it the most intriguing with significant and reliable long-term upside.</p>\n\n<p>In the short term, anything is possible. Q3ER is pre-market, <a href=\"https://ir.paysafe.com/news-events/press-releases/detail/118/paysafe-reschedules-third-quarter-earnings-results-to\">November 11</a>.  ForDespite beating Q2 consensus on <a href=\"https://www.reddit.com/r/MillennialBets/comments/p5io00/paysafe_psfe_q2_er_meets_guidance_beats_analyst/\">revenue</a> and <a href=\"https://finance.yahoo.com/quote/PSFE\">EPS</a>, reporting a <a href=\"https://finance.yahoo.com/news/paysafe-reports-second-quarter-2021-105500808.html\">41% gain</a> in total volume and reaffirming full-year guidance, the stock price severely gapped down and continued to fall 30%, on soft <a href=\"https://www.reddit.com/r/PSFE/comments/qcxsjc/paysafes_q3_guidance_pointing_to_q4/\">Q3 guidance</a>.</p>\n\n<p>By any reasonable measure, the already guided Q3 miss is more than priced in at this point.</p>\n\n<p>I hesitated to share this because it may simply be best for those lacking conviction in PSFE’s long-term value to sell so that the upcoming trend reversal can take hold.  Still, I believe in making decisions based on accurate information. A recent <a href=\"https://www.sec.gov/Archives/edgar/data/1833835/000156459021050428/psfe-424b3.htm\">SEC filing</a> indicates that the stock’s downtrend is not the institutional selling that bears have claimed (see Parts 4 &amp; 5), but a rotation away from retail shareholders who, like whipped dogs beat into submission, are easily shaken out by disinformation and tactical intraday short volume (there has been plenty of both). As Paysafe Chairman Bill Foley <a href=\"https://investor.cannaeholdings.com/static-files/39080000-7cb6-4379-8650-9a10ebde608b\">acknowledged</a>, the stock “has been unduly punished as the inevitable shareholder rotation plays out.”</p>\n\n<p>Some have justifiably complained that management is not engaging the media to support share value. As the number of institutional owners has grown from 180 to 297 over the last quarter, it may simply be that management is quietly allowing a more stable investor base to take over in order to better secure long-term share value. After all, from the outset Foley did give fair warning that he’s not concerned with short-term investors (oddly cut from this <a href=\"https://www.cnbc.com/video/2021/03/29/bill-foley-on-why-hes-excited-to-take-paysafe-public-via-spac-merger.html\">interview</a>).</p>\n\n<p>&#x200B;</p>\n\n<p>TLDR: As an off-ramp from the in-depth review below, here’s a fair assessment from RBC’s 5-star analyst Daniel Perlin: “PSFE remains a complex story as the company grows over divestitures and portfolio adjustments, creating difficult comparisons, while also calibrating the Street on weaker seasonal patterns implicit in Q3/21 guidance, followed by an expected rebound in Q4. In addition, recent acquisitions push leverage to ~5.3x net debt-to-(adj.)EBITDA, which should de-lever quickly heading into FY22, but likely pressures the stock near-term as investors peel back the layers to gain visibility into H2/21 and into FY22.”  (Perlin rates it a “Buy” w/ $15 PT and expects -$0.07 EPS for Q3.)</p>\n\n<p>With that, here’s one person’s attempt to “peel back the layers” on:</p>\n\n<ol>\n<li>Growth</li>\n<li>Debt</li>\n<li>Profit</li>\n<li>Float</li>\n<li>Blackstone Group</li>\n<li>Insider Ownership</li>\n<li>Competition</li>\n<li>Management</li>\n<li>Lockup Expiry</li>\n<li>Valuation</li>\n</ol>\n\n<p>Note: Since there’s a lot to cover, I’ll break this up into 4 posts as I write them over the next 4 days.  (The section headings above will become links.)</p>\n\n<p>&#x200B;</p>\n\n<h1>1. Growth</h1>\n\n<p>Paysafe just went public 6 months ago so it’s natural to focus on very recent numbers which reflect a 12-18 month transitional slow-down due to Covid-related closures of live sporting events and brick &amp; mortar retail along with strategic exits as part of the company’s efforts to de-risk future growth.</p>\n\n<p>In the coming quarters, management expects bolstered growth from a post-Covid reopening, a lapping of legacy de-risking measures, their ongoing expansion into the US iGaming market, and their ongoing US rollout of digital wallet Skrill, which is expected to become “a second engine of growth on top of the payment processing growth.”</p>\n\n<p>Unlike many companies going public with lofty growth projections, Paysafe’s investor presentation offered the initial estimate of 10.4% growth, conservatively pegging it to the payments sector as a whole.  However, in a recent <a href=\"https://bmo.qumucloud.com/view/2021-digitalbanking-paysafe#/\">conference</a>, Paysafe CEO, Philip McHugh quietly upgraded that projection with a revealing break down of their business mix:</p>\n\n<ul>\n<li>45% of business is expected to grow 8-10%</li>\n<li>55% of their business is expected to grow 15-20%.</li>\n</ul>\n\n<p>That’s a weighted organic growth of 11.9 - 15.5%.</p>\n\n<p>Add in the expected 3.9% inorganic growth from their two recent LATAM acquisitions ($60m rev@55%CAGR), and that 10.4% projection suddenly looks more like 15.8% to 19.4%.</p>\n\n<p>For a mature company operating at scale with over $100 billion in transactional volume, that’s solid growth on par with PayPal’s last three-year range of 15.02% - 20.72%.</p>\n\n<p>As a reference, this would put Paysafe&#39;s 2022E revenue between $1.79 to $1.87 billion, beating the consensus estimate of $1.75 billion.</p>\n\n<p>Additional factors not yet included in growth projections:</p>\n\n<ol>\n<li>Due to that 45%/55% business mix, when over half of the business is growing twice as fast as the rest, the weighted blend shifts over time until that faster growth rate predominates.</li>\n<li>That same compounding effect on overall blend applies to the two acquisitions, PagoEfectivo and Miami-based SafetyPay, <a href=\"https://d1io3yog0oux5.cloudfront.net/_22bb7ead34a47affd0aaab44e42d92dc/paysafe/db/1111/9781/file/2Q21+Paysafe+Earnings+Presentation+vFinal.pdf\">reported</a> to be growing at a combined 55% CAGR with 80%+ bank coverage in Latin America, “one of the fastest growing eCommerce markets out there.”</li>\n<li>Moreover, forward growth estimates do not factor in several “post synergy multiples” related to these acquisitions. For example, Paysafe’s eCash and digital wallet products will be introduced to fertile markets where more than half of the population fits their “underbanked” target profile (i.e. those who primarily use cash; don’t have bank accounts or credit cards or simply want to protect their personal information but are actively moving to mobile devices and seeking ways to engage in eCommerce, iGaming and digital person to person payments). </li>\n<li>Including SafetyPay’s 20,000 new collection points in seven European countries, the two deals add a combined 320,000 collection points and 90% bank coverage over 11 new Latin American countries, giving Paysafe one of the largest Fintech footprints in the region. Management says: “These transactions are expected to be accretive to 2022 and further enhance our long-term growth as we drive multiple cross-selling opportunities across all Paysafe business units.”</li>\n<li>Also not yet factored into projections, these acquisitions lay critical groundwork in Latin America’s emerging sports betting market, <a href=\"https://www.yogonet.com/international/noticias/2021/08/03/58633-online-sports-betting-grows-rapidly-in-latin-america\">estimated</a> to be worth $7-10 billion, growing at 20% CAGR. Importantly, with Paysafe’s direct marketing and leadership in iGaming payment processing, the deals facilitate easy expansion for their many partners like Roblox, Draftkings, WynnBet, ESL Gaming, BetMGM, PointsBet, Penn, Twitch, Betfred, bet365 etc. As CEO McHugh notes, “We service Xbox, Youtube, Spotify and iGaming companies. And just being able to connect global companies to more and more markets with a single relationship was an easy synergy for us.”</li>\n<li>Additionally, SafetyPay recently tapped into 134 million new customers with the recent <a href=\"https://www.qrcodepress.com/safetypay-qr-codes/8539360/\">rollout</a> of its QR codes across Brazil enabling real-time transactions on the PIX mobile payment platform, with a <a href=\"https://twitter.com/benedictevans/status/1452229529771122696?s=20\">TPV of $100 billion</a>. This new QR code offers the unique benefit of <a href=\"https://www.prnewswire.com/news-releases/safetypay-launches-qr-codes-for-real-time-payments-in-brazil-301294286.html\">allowing</a> “non-credit card holders and fraud-wary consumers” to make bank payments and engage in eCommerce without risking personal information. Brazil is expected to account for a <a href=\"https://thefintechtimes.com/safetypay-qr-codes-and-cross-border-transactions-are-top-priority-for-payments-in-latin-america/\">third</a> of the LATAM eCommerce market.</li>\n<li>Further, projections don’t yet include inorganic/organic growth or potential synergies from their third recent acquisition, <a href=\"https://www.businesswire.com/news/home/20210822005021/en/Paysafe-to-Acquire-viafintech/?feedref=JjAwJuNHiystnCoBq_hl-XEemlDQ6NgDkiei3bSxnzGlJCVVeQL8sr5Wvng8AXxRSfe41V1BKA-b6v2ZVrSSNs-dUYKiDvY7XniNSqv88QcY1Ge_vf9QIMZ4alzIf_0HE01s4RTGeX_C4TDnN9C9Cg==\">viafintech</a>, which adds a network of 20,000 points of sale in six European countries. This expands their eCash business (just posted 37% YoY growth), which taps into the “underbanked” as described above (1.7 billion consumers globally). While this deal protected and gained market shares, it was also a KYC software acquisition that will provide their digital wallets with a more streamlined point-of-sale “mobile ATM” function through phone-based digital banking. Management expects this to better position Paysafe “as an essential payments partner to challenger banks around the world as consumer banking habits continue to evolve.” Direct relationships with rapidly growing branchless “challenger bank” (AKA neobanks) are a key driver in Paysafe’s growth strategy in “<a href=\"https://www.digitaltransactions.net/how-paysafe-sees-its-safetypay-deal-as-a-major-move-into-open-banking/\">open banking</a>”.</li>\n<li>The viafintech deal also includes a new strategic partnership with Glory Ltd to add Paysafe’s eCash solution, paysafecard, to its global physical presence. Glory Ltd, (11,000 employees), has physical locations in 20 countries and is used in 100 countries across Europe, Asia, N.America, S.America, the Middle East and Africa.</li>\n<li>Enhanced global eCash/digital wallet synergy: Once integrated, these three acquisitions bring Paysafe’s global eCash business to over a million distribution points in 60 countries. Along with their newly launched US advertising <a href=\"https://www.businesswire.com/news/home/20210928005792/en/\">campaign</a> for Skrill, the integration of their digital wallets and eCash platforms in these new markets greatly enhance Paysafe’s position in the large US/LATAM and EU/LATAM remittance markets. Notably, viafintech recently announced a <a href=\"https://ffnews.com/newsarticle/viafintech-and-n26-launch-cash26-in-spain-a-service-for-digital-banking/\">deal</a> in Spain with fast growing neobank N26 which, combined with Paysafe&#39;s other acquisitions, creates a direct connection in the $18 billion remittance market between Spain and South America. Overall, this is a high-margin $700 billion global market.</li>\n<li>US wagering: Paysafe is already established with 75% of all US iGaming operators and they just <a href=\"https://d1io3yog0oux5.cloudfront.net/_22bb7ead34a47affd0aaab44e42d92dc/paysafe/db/1111/9781/file/2Q21+Paysafe+Earnings+Presentation+vFinal.pdf\">reported</a> a 72% increase in year-over-year volume with a 48% YoY increase in revenue, however, their growth estimates don’t include the many US states expected to legalize sports betting going forward.</li>\n<li>Paysafe’s growth estimates also don’t include the full potential from Canada’s newly legalized betting market. This is a market where Paysafe is already positioned with 100% of all operators. Starting at roughly $1 billion, Deloitte Canada projects 94% CAGR to <a href=\"https://www2.deloitte.com/ca/en/pages/consumer-business/articles/ca-new-stakes-in-the-game.html\">$28 billion within five years</a> ($22 billion USD).</li>\n<li>Paysafe also dominates sports betting in Europe which, according to The European Business Review, is <a href=\"https://www.europeanbusinessreview.com/the-rise-of-sports-betting-wagering-worldwide/\">projected</a> to grow 30.6% CAGR, more than tripling from $24.7 billion Euros in 2020 to 94 billion Euros ($109 billion USD) by 2024.</li>\n<li>It’s important to note that, as a payment processor, Paysafe’s revenue is not made up from a fraction of iGaming operator revenue, but as a fraction of total pay-in/pay-out transactional volume (TPV). Over the next five years, the US sports betting handle (pay-in wagering) is <a href=\"https://www.casino.org/news/ark-invest-sees-online-sports-betting-handle-jumping-to-180-billion/\">estimated</a> by some to grow to as much as $180 billion. With Paysafe’s expectation of 20% US marketshare, the TPV of the US market alone has the potential to triple Paysafe’s overall revenue. This is not a prediction but an interesting reference for the implications of Paysafe’s dominant position in these many high-growth markets, all with long-term secular tailwinds.</li>\n<li>Lastly, Paysafe’s newly launched travel safeguarding <a href=\"https://www.paysafe.com/fileadmin/content/pdf/Safeguarding-the-future-of-travel.pdf\">model</a>, presents another new revenue stream that should not be discounted. Demand for this unique new offering is self evident.  Almost as soon as it was <a href=\"https://www.paysafe.com/en/paysafegroup/news/detail/paysafe-launches-safeguarding-model-for-the-travel-industry-globally/\">announced,</a> they signed a <a href=\"https://www.paysafe.com/eu-en/paysafegroup/news/detail/paysafe-and-arc-partner-to-deliver-innovative-payments-solution-for-airlines/\">deal</a> with <a href=\"https://www2.arccorp.com/globalassets/about-us/our-data/third-party/arc-data.pdf\">ARC</a>, who has a network of over 200 major airlines globally and processes $97 billion annually.</li>\n</ol>\n\n<p>With their recent expansion into new untapped markets and their unquestioned dominance in existing markets estimated to ramp to 30-94% CAGR, it’s not a stretch to consider that the compounded effect of the above fourteen factors taken together, might add a modest 5-10% to overall growth (I suspect more).  Add that to the 15.8% to 19.4% growth described above, and the resulting 21-30% annual growth would practically double the growth model on which 9 analysts have based their average price target of ~$14.</p>\n\n<p>Time will tell but such a growth prospect is supported their recently reported 41% increase in volume and an adjusted 23% YoY revenue growth, when excluding last year’s divestiture and discrete Direct Marketing exits (both part of their strategy to de-risk forward growth).  It also doesn’t hurt that, including that slow period, they have a long track record of 30.7% CAGR between 2011 and 2020 (<a href=\"https://www.investing.com/analysis/optimal-payments:-still-at-discount-despite-ebitda-growth-137908\">$128m</a> to <a href=\"https://d1io3yog0oux5.cloudfront.net/_60f30e3ae06e5db5459655316a65dc97/paysafe/db/1111/9761/file/Supplemental+Financial+Information_+Paysafe+Limited_+Q1+2021.xlsx\">$1.43b</a>).</p>\n\n<p>&#x200B;</p>\n\n<p>The remaining Parts 2-10 of this article will be linked above as it’s written.</p>\n</div><!-- SC_ON -->",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "612ee368-65e6-11e5-b53f-129e4297eb59",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#f7b84f",
  "id": "qkgndd",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "greensymbiote",
  "discussion_type": null,
  "num_comments": 3,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/qkgndd/peeling_back_the_layers_on_paysafe_psfe/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/qkgndd/peeling_back_the_layers_on_paysafe_psfe/",
  "subreddit_subscribers": 3196358,
  "created_utc": 1635809160,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1635781115,
  "the_new_excerpt": "If you’re looking for a quick trade or pump, this is not it. I wrote this to\nhave a searchable document for future reference. It addresses much of the false\nand misleading information that’s been published on Paysafe. This undervalued\nFintech represents around 15% of my portfolio but I continue to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もし、あなたが迅速なトレードやポンプを探しているなら、これはありません。これを書いたのは\n将来の参考のために、検索可能なドキュメントにするために書きました。Paysafに掲載されている虚偽や誤解を招く情報の多くに対応しています。\n誤解を招くような情報が掲載されています。この過小評価された\nフィンテックは私のポートフォリオの約15％を占めていますが、私は引き続き...",
      "title": "ペイセーフ(PSFE)の層を剥がす"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你在寻找快速交易或泵，这不是它。我写这个是为了\n有一个可搜索的文件供将来参考。它解决了许多错误的\n和误导性的信息，这些信息都是在Paysafe上发布的。这个被低估的\n金融科技占我投资组合的15%左右，但我继续...",
      "title": "剥开Paysafe (PSFE)的层层面纱"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你在尋找快速交易或泵，這不是它。我寫這個是爲了\n有一個可搜索的文件供將來參考。它解決了許多錯誤的\n和誤導性的信息，這些信息都是在Paysafe上發佈的。這個被低估的\n金融科技佔我投資組合的15%左右，但我繼續...",
      "title": "剝開Paysafe (PSFE)的層層面紗"
    }
  ],
  "source_updated_at": 1636105287553
}