{
  "author": "turtleman182",
  "the_new_excerpt": "Hey everyone,\n\nSo basically I think there is a good probability that we are at the edge of an\neconomic disaster. I have been talking about the bond market, and looking into\nwhat is going on there and it is clear that the FED has their hands tied on this\nand our only path forwards are 1)…",
  "original_created_utc": 1615672644,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "嘿，大家好。\n\n所以，基本上我认为，我们很有可能处于一个边缘的边缘\n经济灾难。我一直在谈论债券市场，并研究到了\n那里发生了什么事，很明显，FED已经被束缚住了手脚。\n而我们唯一的出路是：1）......。)",
      "title": "做多商品，做空债券。防通胀，以及美国债券市场的纸牌屋。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嘿，大家好。\n\n所以，基本上我認爲，我們很有可能處於一個邊緣的邊緣\n經濟災難。我一直在談論債券市場，並研究到了\n那裏發生了什麼事，很明顯，FED已經被束縛住了手腳。\n而我們唯一的出路是：1）......。)",
      "title": "做多商品，做空債券。防通脹，以及美國債券市場的紙牌屋。"
    }
  ],
  "title": "Long commodities, short bonds. Protection against inflation, and the house of cards that is the US bond market.",
  "created_utc": 1615684930,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey everyone,</p>\n\n<p>So basically I think there is a good probability that we are at the edge of an economic disaster. I have been talking about the bond market, and looking into what is going on there and it is clear that the FED has their hands tied on this and our only path forwards are 1) hyperinflation or 2) failure in the bond market due to rising interest rates.</p>\n\n<p>In 2019, the world economy was running hot AF. In just the span of time from 2018-2019 the us median income rose 2%, poverty dropped 2%, and it all seemed very good.</p>\n\n<p>The FED saw that the economy was getting hot, and that their quantitative easing (QE) policy might be becoming less effective. They have some bank tools that are used to combat inflation and interest rates. These tools are IOER, SLR%, and YCC.</p>\n\n<p>IOER: Interest one excessive reserves. This is perhaps the most important tool because feds can manually change the interest rate on the M1 money stock. This is important because from this first money stock, every-time one passes hands there is an interest rate associated with it. So Interest rate on IOER affects the M1 money stock, M2 money stock, all banks, and almost all of the credit that we try to get, it also affects SLR%.</p>\n\n<p>SLR%: Supplementary leverage ratio %. This is basically how much loan loss reserves a banks and companies need to always keep on hand in order to meet the needs of their members. For example, the US fed can put a cap at 10% SLR% and that means that the bank can leverage 90% of its money out, while only keeping 10% on hand. This is influenced by IOER and this SLR% is the main reason we cannot raise interest rates using IOER.</p>\n\n<p>In 2019 we tried raising IOER, which increased SLR. When we did that we moved the underbelly of a beast so massive we had no idea how big it could be. When we raised IOER many banks and companies have taken out so much debt that they literally COULD NOT STAY LIQUID with increases in interest rates.</p>\n\n<p><a href=\"https://youtu.be/URvok29rf-w\">https://youtu.be/URvok29rf-w</a></p>\n\n<p>Not only did this raise in interest rates lead to a huge liquidity disaster, it also led to liquidity disasters IN OTHER COUNTRIES. That is really really really worrisome. We raise interest in the IOER and all the suddenly Turkey also is having a major fucking liquidity issue. I don&#39;t know each country but I do know that our 2019 actions were affecting Turkey and other countries.</p>\n\n<p>So what did we do in response the the 2019 liquidity disasters? WE LOWERED INTEREST RATES AND PRINTED MORE MONEY. WE KEPT THE ZOMBIE GOING.</p>\n\n<p>then the pandemic hit...</p>\n\n<p>The pandemic hit and the FED already knew we were at a knives edge with the bond market. So their plan, although they say it was to help us, was to pump up the zombie economy with a huge monumental stimulus. Then we got two more after.</p>\n\n<p>I wanted this stimulus, we all wanted this stimulus, but by pumping the stimulus in the economy and pumping up these institutions that can&#39;t stay liquid if they had high interest rates has kind of put off the inevitable. A huge falling out of people who have too much debt.</p>\n\n<p>So here we are in 2021. Government debt has not improved (it has got worse), credit ratings on many zombie companies that aren&#39;t turning a profit are going to get worse and worse credit ratings = high standards of SLR% to stay liquid. This is going to make it even MORE difficult for these companies to deal with high interest rates.</p>\n\n<p><strong>WHAT DOES THIS FIRST PART MEAN?</strong></p>\n\n<p>We have tools to deal with inflation, the most important being raised interest rates using (IOER) which influences SLR% and capital requirements of institutions. However, we have so much debt, and so much of this debt belongs to companies that don&#39;t turn a significant profit. So we can&#39;t raise interest rates if we don&#39;t want a flat out crash in the bond market and wave of bankruptcies of major corporations and possibly financial institutions.</p>\n\n<p>so if controlling for inflation by raising IOER would lead to a liquidity crisis in the bond market, how do we control for and prevent hyper inflation?</p>\n\n<p>People have been talking about Yield Curve Control (YCC) as it is a tool to control for inflation. However it is not. YCC works by the FED going into the economy and buying up as many 10y and 30yr bonds as they can (this puts more money in economy), then selling a bunch of their short term expiring bonds. This buying on the long end and selling on the short end would help keep interest rates low for companies to stay liquid, BUT LOW INTEREST RATES LEADS US TO MORE INFLATION, so this plan will not work for very long.</p>\n\n<p><strong>THE FED IS BETWEEN A ROCK AND A HARD PLACE</strong></p>\n\n<p><strong>increase IOER to control inflation</strong> = major liquidity issue and a fallout of our bond market</p>\n\n<p><strong>do YCC to avoid fall out of bond market</strong> = more inflation!</p>\n\n<p><strong>print more money</strong> i<strong>nject it into the economy</strong> = buy more time but put off inevitable.</p>\n\n<p>I have been thinking about this and I don&#39;t see that they have a way out. I have read into it and also heard people talk about this long before I got here. Below I leave some links so you can hear about this from someone else besides me.</p>\n\n<p><a href=\"https://youtu.be/CCmdmOr06pY\">https://youtu.be/CCmdmOr06pY</a> (CNBC on bond market)</p>\n\n<p><a href=\"https://www.youtube.com/user/TheMoneyGPS\">https://www.youtube.com/user/TheMoneyGPS</a> (another person who actually looks at numbers and data)</p>\n\n<p><a href=\"https://youtu.be/28VXEocPnw4\">https://youtu.be/28VXEocPnw4</a> (Peter Schiff has been saying this for a long time)</p>\n\n<p><a href=\"https://youtu.be/Y1OkOtQND8w\">https://youtu.be/Y1OkOtQND8w</a> (former banker sees same pending disaster)</p>\n\n<p><strong>Commodities</strong></p>\n\n<p>I don&#39;t want to talk about the inflation we are seeing in commodities because we have talked about steel a shit ton here and all of us know that inflationary signs are all over the economy. CPI will literally be the last indicator that inflation is here SO PLEASE INGORE THE FED WHEN THEY SAY CPI IS LOW.</p>\n\n<p>We see inflationary pressure all over the market. Especially in commodities, producer prices, import costs, housing prices, etc. The FED is only saving face with CPI cause they know controlling inflation means crashing the bond market.</p>\n\n<p><strong>My Plan</strong></p>\n\n<p><strong>Exposed myself to commodities</strong>: I have invested in a handful of commodity tickers $RFP $MT $CLF $LPX $CTT $PCH $SXC, $ADM because even if we have the catalysts of a crazy economic recovery we also have inflation. So no matter what these stocks do, they HAVE to go up. I think in 2021 any commodity stock that can produce cash is a good one to have.</p>\n\n<p><strong>Expose myself to raising interest rates</strong>: To ensure that I do not end up being a bag holder for the irresponsible lending and money printing that our government has engaged in for the last decade i am buying puts against the bond market. I have bought puts against $TLT $VGSH $HYG $VMBS $VGIT. I will keep buying them too.</p>\n\n<p><strong>interest rates stay low = more inflation = commodity stocks go up</strong></p>\n\n<p><strong>raise interest to control inflation = bond yields go up, prices of bonds go down. potential fallout of companies and institutions that can&#39;t meet SLR%</strong></p>\n\n<p>I took out positions on Monday and its like i touched a beast that just woke up. It should not be possible to be up $1500 in one day. the VGSH puts for october that I got for 10 dollars are now worth like 300.</p>\n\n<p><a href=\"https://ibb.co/DCJR0Vc\">https://ibb.co/DCJR0Vc</a> </p>\n\n<p>TLDR; If you want to protect yourself from inflation, buy commodities. If you want to protect yourself from the fucking house of cards that is the bond market, buy puts on bond ETF&#39;s against the bond market. This strategy might be VERY successful this year. Most of the puts i am buying are for the late fall or early next year.</p>\n\n<p>If this country could handle higher interest rates I think we would be okay. But the 2019 disaster did not spur confidence that we we were in a position then, and now the house of cards has only expanded and our money printing has led to enormous amounts of speculation that this world has never seen. Cryptos, SPACs, NFT&#39;s, High valuations, Cathie Wood, Chamath, etc. etc. To make this wore we are already starting to see inflation pressures hit producers and commodities. EU and AU are doing MORE MONEY PRINTING and QE. Money hasn&#39;t even started moving through the economy too. We have not even opened up.</p>\n\n<p>I sincerely wish I could believe this administration that we are in for a great economic recovery. They are completely ignoring the huge fucking problem right under their nose.</p>\n\n<p>This guy seems to agree with me: <a href=\"https://youtu.be/__eVeN8wmfQ\">https://youtu.be/__eVeN8wmfQ</a> </p>\n\n<p>My positions:</p>\n\n<p><a href=\"https://ibb.co/PTsF3Qq\">https://ibb.co/PTsF3Qq</a></p>\n\n<p><a href=\"https://ibb.co/n3Vh1XD\">https://ibb.co/n3Vh1XD</a></p>\n\n<p><a href=\"https://ibb.co/JsmDFv8\">https://ibb.co/JsmDFv8</a></p>\n</div><!-- SC_ON -->",
  "score": 301,
  "permalink": "/r/investing/comments/m4ghin/long_commodities_short_bonds_protection_against/",
  "subreddit": "investing",
  "id": "m4ghin",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147379960
}