{
  "author": "DivineEu",
  "the_new_excerpt": "AS WE ALL KNOW BY NOW ETHEREUM FOUNDATION AND REDDIT ANNOUNCED PARTNERSHIP!\n\nIn my Opinion this announcement is the Biggest adoption news I have ever seen,\nill explain why:\n\n\n\nBy brining \"Community points\" to more reddit subs people can learn more about\ncrypto from an inner drive, Finally crypto…",
  "original_created_utc": 1611785515,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我们都知道现在ETHEREUM基金会和REDDIT宣布合作!\n\n在我看来，这个公告是我见过的最大的收养新闻。\n会解释为什么。\n\n\n\n通过将 \"社区积分 \"带入更多的reddit分站 人们可以了解更多的信息。\n从内部驱动加密，终于加密...",
      "title": "Ethereum基金会和reddit合作是我见过的最大的采用新闻。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們都知道現在ETHEREUM基金會和REDDIT宣佈合作!\n\n在我看來，這個公告是我見過的最大的收養新聞。\n會解釋爲什麼。\n\n\n\n通過將 \"社區積分 \"帶入更多的reddit分站 人們可以瞭解更多的信息。\n從內部驅動加密，終於加密...",
      "title": "Ethereum基金會和reddit合作是我見過的最大的採用新聞。"
    }
  ],
  "title": "Ethereum Foundation and reddit Partnership is the Biggest Adoption news I have ever seen",
  "created_utc": 1611849238,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h1>as we all know by now Ethereum Foundation and reddit announced partnership!</h1>\n\n<p>In my Opinion this announcement is the Biggest adoption news I have ever seen, ill explain why:</p>\n\n<p>&#x200B;</p>\n\n<p>By brining &quot;Community points&quot; to more reddit subs people can learn more about crypto from an inner drive, Finally crypto will be able to reach out more people who weren&#39;t really interested in crypto before.</p>\n\n<p>One day people will comment on some reddit post, will get some upvotes and will see some crypto coins popping out in their &quot;vault&quot; Just like magic!</p>\n\n<p>it will make people want to learn more about about these &quot;Magic&quot; coins but from an inner drive and not by being talked into it.</p>\n\n<h1>That will make the difference in adoption.</h1>\n\n<p>Paying with Crypto through PayPal was pretty big news too and it enabled people <strong>That have</strong> Crypto to pay with it.</p>\n\n<p>The Difference is in the POV of the consumer:</p>\n\n<p>PayPal is like : &quot;yay I can use my Crypto to buy things&quot;</p>\n\n<p>Reddit is like: &quot;Ok that&#39;s nice first time I&#39;m meeting this Crypto thing, I wonder what it can do.&quot;</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>As Humans we are a curious species and trigging this emotion will bring Adoption!</p>\n\n<p>Thank you for coming to my TED talk, hope you enjoyed it, will love to hear your thoughts!</p>\n</div><!-- SC_ON -->",
  "score": 175,
  "permalink": "/r/CryptoCurrency/comments/l6fuhz/ethereum_foundation_and_reddit_partnership_is_the/",
  "subreddit": "CryptoCurrency",
  "id": "l6fuhz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518527066
}