{
  "author": "superlmniscate",
  "the_new_excerpt": "Thought I'd make a comprehensive list of all the ways (that I know of) to earn\ncrypto with relatively little effort, with links I've saved. This is knowledge\nI've gathered up ever since I got into crypto space a few months ago and I'm\ngiving back to the community. I'll also mention questionable…",
  "original_created_utc": 1617789121,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "比較的少ない労力でcryptoを稼ぐ方法（私が知っているもの）を、保存してあるリンクを含めて総合的にリストアップしようと思いました。\n比較的少ない労力でcryptoを稼ぐ方法（私が知っているもの）を、保存してあるリンクを使ってまとめてみました。これは、私がcrypto spaに参加して以来、集めた知識です。\n数ヶ月前に暗号の世界に入ってからずっと集めてきた知識なので、コミュニティに還元します。\nコミュニティにお返しします。また、疑問点についても触れておきます。",
      "title": "暗号に手を出すのをためらっていませんか？そんなあなたのために、初心者が作ったものです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想我要做一个全面的列表，所有的方式（我知道的），以赚取\n用相对较少的精力，用我保存下来的链接来进行加密。这就是知识\n自从几个月前进入加密领域后，我就收集了，我是\n回馈社会。我还会提到有问题的... ...",
      "title": "入手加密技术太犹豫？这是由一个新手为你做的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想我要做一個全面的列表，所有的方式（我知道的），以賺取\n用相對較少的精力，用我保存下來的鏈接來進行加密。這就是知識\n自從幾個月前進入加密領域後，我就收集了，我是\n回饋社會。我還會提到有問題的... ...",
      "title": "入手加密技術太猶豫？這是由一個新手爲你做的。"
    }
  ],
  "title": "Too hesitant to get into crypto? This is made for you by a newb.",
  "created_utc": 1617802603,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Thought I&#39;d make a comprehensive list of all the ways (that I know of) to earn crypto with relatively little effort, with links I&#39;ve saved. This is knowledge I&#39;ve gathered up ever since I got into crypto space a few months ago and I&#39;m giving back to the community. I&#39;ll also mention questionable projects with probably a false sense of hope for earnings so you don&#39;t waste your precious time on them.</p>\n\n<p>&#x200B;</p>\n\n<h1>Brave Browser</h1>\n\n<p>Yes. It had to be the first. It&#39;s simple. You use Brave Browser and earn BAT by watching/clicking on ads. BAT is the first crypto earned by many and it is popular among newbies. The only thing holding the browser back is Uphold wallet which they are planning to replace with their own. (Along with more exciting plans of a search engine you can earn from). How much BAT you earn decreases as price of BAT rises.</p>\n\n<h1>MOONs</h1>\n\n<p>This is the <a href=\"/r/CryptoCurrency\">r/CryptoCurrency</a> subreddit&#39;s favorite. It successfully unlocked the average redditor&#39;s dream of shitposting to earn money and make them closer to lambos. With a maximum cap of 250 million moons, you earn moons per Post or Comment karma you get here although the ratio is not 1:1. There are more specific rules to how karmas earn you moons so here&#39;s the <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/lwsdbg/the_great_faq_about_moons_community_polls/\">FAQ</a>. Make sure you create <a href=\"https://www.reddit.com/community-points\">your Vault</a> to receive your moons.</p>\n\n<h1>Liquidity Providing</h1>\n\n<p>If you already own some crypto and if you&#39;re hodling it anyway you can use it to provide liquidity in Uniswap, Honeyswap or Pancakeswap and earn an APY% based on how many LP tokens you have. Keep in mind it&#39;s advisable to read on <a href=\"https://blog.bancor.network/beginners-guide-to-getting-rekt-by-impermanent-loss-7c9510cb2f22\">impermanent loss</a> before you get started, and how <a href=\"https://coinmarketcap.com/headlines/news/is-it-possible-to-create-a-dex-free-from-rug-pulls/\">rugs pulls</a> can happen. Know your risks before fully diving in.</p>\n\n<h1><a href=\"https://www.coinbase.com/earn\">Coinbase Earn</a> and <a href=\"https://coinmarketcap.com/earn/\">Coinmarketcap Earn</a></h1>\n\n<p>Love the idea. You participate by learning on coins and you earn in that coin by answering questions correctly! The concept is great because what&#39;s better than an investor knowing the coins they hold and this spreads education on the multiuse of Blockchain, a relatively new tech. I&#39;ve read countless posts about how people held on to their earned coins and made gains as their prices rocketed. Here&#39;s a lil something to get you <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/lx6isr/in_case_you_havent_cashed_out_all_the_free_earn/\">started</a> ;) Although be aware that Coinbase rewards is only available in some countries and you need a Binance account to get CMC rewards.</p>\n\n<h1>Banano on F@H</h1>\n\n<p>You can use your computer power to <a href=\"https://bananominer.com/\">Fold proteins</a> and aid in biomedical research like Covid-19 and get rewarded in Banano (a similar coin to nano but more meme inclined). Institutions like <a href=\"https://stats.foldingathome.org/teams\">CERN and Intel and Nvidia</a> are top contenders for folding points (although they&#39;re not earning banano) so you&#39;re earning crypto while contributing to a great cause and the Banano community is welcoming and full of potassium.</p>\n\n<h1>Faucets</h1>\n\n<p>In short, they send you free crypto for clicking a button <a href=\"https://www.freenanofaucet.com/\">(like this nano faucet)</a>, or you <a href=\"https://faucetcrypto.com/dashboard\">do work</a> and earn bit of crypto change for it. As much as people believe its such a waste of time for a small change, well so did people back when <a href=\"https://www.reddit.com/r/Bitcoin/comments/6vsmyu/the_original_bitcoin_faucet_used_to_give_away_5/\">a faucet gave 5 BTC</a>. You never know when you hit the jackpot with the pace of crypto being accelerated compared to anything else. Or it can just be a waste of time if a coin&#39;s price plummets. It&#39;s a gamble, like crypto basically.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Things you might want to</strong> <strong><em>reconsider</em></strong>**:**</p>\n\n<h1>Mining</h1>\n\n<p>Again you dedicate computer power to earn crypto either through using CPU, GPU or ASICs. GPU and ASICs have skyrocket high prices right now and are notoriously difficult to obtain. Mining is currently profitable due to the bull market and might not be so if the market crashes. It&#39;s important to consider that profit depends on electricity costs and you should look up a <a href=\"https://www.nicehash.com/profitability-calculator\">suitable machine</a> before making a purchase, and ROI on initial investment into your mining setup, otherwise you&#39;ll lose money. And don&#39;t for the love of god mine with your laptop unless you&#39;re willing to lose it.</p>\n\n<h1>Airdrops</h1>\n\n<p>95% of them are a waste of time but there are some genuine ones. Read this experiment one redditor did on <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/kebssy/so_i_took_part_in_14_airdrops_reportedly_worth/\">airdrops worth $2827.</a></p>\n\n<h1>Pump n Dumps</h1>\n\n<p>There&#39;s a general sentiment of disgust for these schemes but for those who still think there&#39;s no harm in joining one this is a post of someone who took part and <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/lmwd1c/my_time_spent_in_a_pumpanddump_discord_and_the/\">lost everything</a>.</p>\n\n<h1>Presearch</h1>\n\n<p>One of my biggest heartbreaks. You earn tokens by using Presearch search engine. It&#39;s genius since we use google alot anyway so why not earn for doing the same thing? However you earn a max of 3.6 tokens a day and you require 1000 of them to withdraw (which would take 9-10 months). And even when you do their withdrawal process isn&#39;t straightforward with them taking <strong>+3 days</strong> to process your withdrawal. I have not been able to see a single successful withdrawal from their site (check their subreddit <a href=\"/r/Presearch\">r/Presearch</a>).</p>\n\n<h1>Pi Network</h1>\n\n<p>There are rumors that it <a href=\"https://www.reddit.com/r/PiNetwork/comments/mh2bcw/how_can_i_trust_pi_network_when_they_are_scraping/\">steals private data</a> since its not actually mining the coin on your phone. Basically stay away from it.</p>\n\n<p>&#x200B;</p>\n\n<p>I&#39;m tired now and this is probably long enough. Make of this list what you want and please provide corrections if you find any. I&#39;d love to see discussions about each method simply because I don&#39;t know everything and even if I did this post would be longer than it is. Stay informed and happy &lt;3 Now go cherish your newly earned crypto!</p>\n\n<p>I&#39;m aware that this page can be a starting point for many people too hesitant or feel unsafe to get into crypto space as was the case with me. And it&#39;s posts like this that eased me into crypto once I earned it. Now I cashed in on my funds and can call myself an investor. Ya&#39;ll can pay me back when you&#39;re millionaires ;)</p>\n\n<p>Edit: fixing links</p>\n\n<p>Edit 2: decided to make Pi section more concise to avoid misconception.</p>\n</div><!-- SC_ON -->",
  "score": 461,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/shFHoAHB4Sv_8zK0yo3A2q9jQ0Ca3ebN0xecqGizR78.jpg?auto=webp&s=244cf1deee52f1d2214ed774a7319f2426e9229b",
          "width": 1200,
          "height": 636
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/shFHoAHB4Sv_8zK0yo3A2q9jQ0Ca3ebN0xecqGizR78.jpg?width=108&crop=smart&auto=webp&s=fa87c490bfc8f18a223457243a49f0c11bc9035a",
            "width": 108,
            "height": 57
          },
          {
            "url": "https://external-preview.redd.it/shFHoAHB4Sv_8zK0yo3A2q9jQ0Ca3ebN0xecqGizR78.jpg?width=216&crop=smart&auto=webp&s=bde884d57b5590f5b2b221ef218a4d3057e0370e",
            "width": 216,
            "height": 114
          },
          {
            "url": "https://external-preview.redd.it/shFHoAHB4Sv_8zK0yo3A2q9jQ0Ca3ebN0xecqGizR78.jpg?width=320&crop=smart&auto=webp&s=5692096783f2454274da8a1b4033e3433f2f0148",
            "width": 320,
            "height": 169
          },
          {
            "url": "https://external-preview.redd.it/shFHoAHB4Sv_8zK0yo3A2q9jQ0Ca3ebN0xecqGizR78.jpg?width=640&crop=smart&auto=webp&s=2daaf42bb4314b229c79dfeb805d07cc875c376a",
            "width": 640,
            "height": 339
          },
          {
            "url": "https://external-preview.redd.it/shFHoAHB4Sv_8zK0yo3A2q9jQ0Ca3ebN0xecqGizR78.jpg?width=960&crop=smart&auto=webp&s=beea440222813db6ab0ce76ec24112adc19099f8",
            "width": 960,
            "height": 508
          },
          {
            "url": "https://external-preview.redd.it/shFHoAHB4Sv_8zK0yo3A2q9jQ0Ca3ebN0xecqGizR78.jpg?width=1080&crop=smart&auto=webp&s=59409b3e5ca930c0059a50e97213275136c1ad54",
            "width": 1080,
            "height": 572
          }
        ],
        "variants": {},
        "id": "d5fzb2Et6tvzd9ULg8i36A_5HXZPY9Z3mu5pRioVJaw"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/mlym7e/too_hesitant_to_get_into_crypto_this_is_made_for/",
  "subreddit": "CryptoCurrency",
  "id": "mlym7e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961876909
}