{
  "author": "molecular_crusade",
  "the_new_excerpt": "You might have seen a post the other day on WSB relating to KTOS from another\nuser. Well, after a bit more DD, here is what I can say for KTOS.\n\nFirst i'll repeat what the other post said. Recently ARK, Blackrock, Vanguard\nand Fidelity have bought a huge number of shares in KTOS, and there is a…",
  "original_created_utc": 1610558230,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "你可能在WSB上看到过一篇与KTOS有关的帖子，来自于另一位\n用户。好了，再经过一番丈量，下面我可以为KTOS说说。\n\n首先我重复一下其他帖子说的话。最近ARK、黑石、万科\n和富达公司大量买入KTOS的股票，有...",
      "title": "KTOS及其光明的未来"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你可能在WSB上看到過一篇與KTOS有關的帖子，來自於另一位\n用戶。好了，再經過一番丈量，下面我可以爲KTOS說說。\n\n首先我重複一下其他帖子說的話。最近ARK、黑石、萬科\n和富達公司大量買入KTOS的股票，有...",
      "title": "KTOS及其光明的未來"
    }
  ],
  "title": "KTOS and its bright future",
  "created_utc": 1610600574,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>You might have seen a post the other day on WSB relating to KTOS from another user. Well, after a bit more DD, here is what I can say for KTOS.</p>\n\n<p>First i&#39;ll repeat what the other post said. Recently ARK, Blackrock, Vanguard and Fidelity have bought a huge number of shares in KTOS, and there is a good reason why. I&#39;ll link to the original post <a href=\"https://www.reddit.com/r/wallstreetbets/comments/kvrv7b/cathie_arkbacked_tech_innovator_kratos_defense/\">here</a> as it will likely be a more interesting read and im not great at formatting. </p>\n\n<p>I thought i&#39;d look into them and I was pretty pleased with what I saw.</p>\n\n<p>I attended the presentation, and this is what I managed to jot down during the presentation. I&#39;m sure it&#39;ll look very boring, but maybe for you its worth reading. I was taking these down as I was listening, so there may be gaps or misquoted information.</p>\n\n<p>Significant invests and won a lot of contracts. Continued investment in 2021 and accelerate in 2022 as these mature to production.</p>\n\n<p><strong>Primary Areas</strong> - Target drones – very high in demand. Lots of contacts are for target drones. Leading high-performance jet target drones. Drones get shot down and then replaced, looking to expand domestically and internationally as new drone requirements are needed.</p>\n\n<p>o Skyborg contract awarded. LCAAT contract awarded, government announced the Valkyrie flew with the F22 and F35 showing they have drones performing missions.</p>\n\n<p>Next gen engines for drones and cruise missiles – important announcement made to have another contract for Kratos next gen engine for cruise missiles and drones.</p>\n\n<p><strong>Unmanned drones</strong> – Gremlin is reusable, only company with a family of these drones (low cost, 400k to 3m). Force multiplies and they’re the market leaders.</p>\n\n<p>o Gremlin – govt announced they have multiple customers for the gremlin drones for when it transitions from research team at DARPA. Likely moved to 2022/2023 due to covid and earthquake. Nothing else in the Gremlin, Valkyrie class line aside from Kratos.</p>\n\n<p><strong>Space and satellite communication</strong></p>\n\n<p>o Biggest business in kratos, leading the industry, supporting ~80% space missions.</p>\n\n<p>o Thousands of LEO and MEO satellites planned including HBTSS () and TITAN (Tactical Interface Tracking Application Node) program.</p>\n\n<p>o Microsoft partnered with musk and starlink, AND kratos. Large, new 5G GSaaS beginning. Very low latency and very integral to this. Doing military and commercial, leveraging scale of having both military and commercial, making them competitive as they drive costs down. Very high expectations. High profitability 2022/2023.</p>\n\n<p><strong>Microwave electronics</strong> </p>\n\n<p>o Largest independent microwave companies internationally, in support of C5ISR programs.</p>\n\n<p>o Industry seeing increased funding.</p>\n\n<p>o Kratos typically only provider</p>\n\n<p><strong>Strategic deterrence</strong> </p>\n\n<p>o GBSD \n 180m contract including significant development systems needed for customer.</p>\n\n<p> New facility with new equipment for this program, production multiple times larger than dev piece, so expect massive investment. 2nd half of 2021, big step up in revenue in 2022. Big growth driver.</p>\n\n<p><strong>Turbine tech and engines</strong> </p>\n\n<p>o Designed into a number of systems, only 2 publicly disclosed (Graywolf and speed racer).</p>\n\n<p>o Recently can announce additional funding at low cost cruise missiles and tactical drones. The engine is the largest bill (35%). Want to disrupt the engine market.</p>\n\n<p>o Number of agencies looking to fund.</p>\n\n<p><strong>Missile defense and hypersonic programs</strong></p>\n\n<p>o One of 2 primary providers for ballistic missile defenses. </p>\n\n<p>o Key supporter of the AEGIS programs</p>\n\n<p><strong>Financial information</strong> </p>\n\n<p>o Drone opportunity expected to transform company soon.</p>\n\n<p>o Space and satellite sector very well positioned and expecting lots of growth.</p>\n\n<p> Won a number of classified contracts.</p>\n\n<p>o 2021 will be last year of increased internal investments. Heavy investment, but lots of growth after.</p>\n\n<p>o Ground based strategic deterrent – multi hundred million contract, significant expenditure on machinery, tools and equipment. In 2021, as they won the contract in 2020, it’ll be a significant CapEx.</p>\n\n<p>o Lots of IP movements on engines.</p>\n\n<p>o Not taking govt funding for the next gen engines, they’ll eat the costs.</p>\n\n<p> Will need secure facility with classified environment. Most employees have very high security clearance.</p>\n\n<p>o 2021 solid growth year, no questions about it. Primary dial on how good this will be is going to be a recompete. If not successful in the recompete, it’s a 35m hole to fill. VERY strong if they get it. If not, the growth won’t be as strong due to this hole. 2022 and 2023 look like step function growth years with lots of contracts maturing to production.</p>\n\n<p>o LEO constellations from SpaceX will benefit Kratos. CEO isn’t sure about STARSHIP.</p>\n\n<p>o 70% federal/DoD contracts vs 30% private contracts.</p>\n</div><!-- SC_ON -->",
  "score": 43,
  "permalink": "/r/stocks/comments/kwkztn/ktos_and_its_bright_future/",
  "subreddit": "stocks",
  "id": "kwkztn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706383090
}