{
  "author": "Traditional_Fee_8828",
  "the_new_excerpt": "I'm pretty long-term bullish on a stock that's trading at about $300 per share.\nI don't know where it'll move. It has strong earnings to its name, but fell\nshort of EPS targets over the past 2 Quarters. The call would be dated for 2\nyears from now, and they've increased 30% YOY. Would it be a good…",
  "original_created_utc": 1618190800,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "一株あたり300ドル程度で取引されている株に対して、私はかなり長期的に強気です。\nどこまで動くかはわかりませんが。好調な収益を上げていますが、これまでのところ\n過去2四半期のEPS目標を下回っています。このコールは2年後の日付になります。\n2年後のコールになりますが、前年同期比で30％増加しています。それは良いことでしょうか...",
      "title": "株を3000ドル買うべきか、atmのファーデートコールを3000ドル買うべきか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我很长期看好这只股票，它的交易价格是每股300元左右。\n我不知道它会往哪里走。它有强大的收益的名字，但下降了。\n在过去的2个季度中未达到EPS目标。催收日期将为2\n年后，它们的年增长率达到30%。会不会是个好...",
      "title": "我应该买3000元的股票，还是买3000元的atm远期call？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我很長期看好這隻股票，它的交易價格是每股300元左右。\n我不知道它會往哪裏走。它有強大的收益的名字，但下降了。\n在過去的2個季度中未達到EPS目標。催收日期將爲2\n年後，它們的年增長率達到30%。會不會是個好...",
      "title": "我應該買3000元的股票，還是買3000元的atm遠期call？"
    }
  ],
  "title": "Should I buy $3000 in shares, or $3000 on atm far dated calls?",
  "created_utc": 1618198896,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m pretty long-term bullish on a stock that&#39;s trading at about $300 per share. I don&#39;t know where it&#39;ll move. It has strong earnings to its name, but fell short of EPS targets over the past 2 Quarters. The call would be dated for 2 years from now, and they&#39;ve increased 30% YOY. Would it be a good idea to buy a close to the money/itm call on the stock, and essentially hold 100 shares up until a certain date, then roll forward if still bullish, or should I buy shares? The stock carries a 2% dividend, but I think I think I would get more benefit from a far dated call, but (obviously) less stability. Thoughts?</p>\n</div><!-- SC_ON -->",
  "score": 442,
  "permalink": "/r/stocks/comments/mp3zj7/should_i_buy_3000_in_shares_or_3000_on_atm_far/",
  "subreddit": "stocks",
  "id": "mp3zj7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566618917
}