{
  "author": "harjeet_hellboy321",
  "original_created_utc": 1624869618,
  "title": "If you're young and thinking of investing in crypto, please take a second to read this.",
  "created_utc": 1624903537,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m sure this will sound pedantic but with all the excitement lately, I&#39;m seeing a lot of posts from people in their 20&#39;s and even teens talking about investing large sums in crypto. Please keep in mind that this is a high risk.</p>\n\n<p>That&#39;s not to say you shouldn&#39;t take some of your hard-earned money, do your research and get involved. This community is amazing, dynamic and there&#39;s a ton of potential to make great returns. However, high-risk investments should never be your whole portfolio. It should be the smallest part.</p>\n\n<p>Make sure that you&#39;re setting aside money in a Roth IRA, contributing to your 401k, Vanguard funds, etc. The boring stuff. The stuff that grows slowly over a lifetime. Don&#39;t just diversify your coins, diversify your whole portfolio. It&#39;s something I certainly wish I&#39;d tackled at a much younger age. Believe me, you&#39;ll thank me later.</p>\n</div><!-- SC_ON -->",
  "score": 163,
  "permalink": "/r/CryptoCurrency/comments/o9g60w/if_youre_young_and_thinking_of_investing_in/",
  "subreddit": "CryptoCurrency",
  "id": "o9g60w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm sure this will sound pedantic but with all the excitement lately, I'm seeing\na lot of posts from people in their 20's and even teens talking about investing\nlarge sums in crypto. Please keep in mind that this is a high risk.\n\nThat's not to say you shouldn't take some of your hard-earned money,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "堅苦しい言い方になりますが、最近のブームで、20代や10代の人たちが\n20代や10代の人たちが大金を暗号に投資しようと話しているのをよく目にするようになりました。\n大金を暗号に投資しようとしています。これはハイリスクであることを念頭に置いてください。\n\nそれは、あなたが稼いだお金の一部を取るべきではないということではありません、...",
      "title": "もしあなたが若くして、暗号への投資を考えているなら、少し時間をおいてこれを読んでみてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我相信这听起来会很迂腐，但随着最近所有的兴奋，我看到\n很多20多岁甚至十几岁的人都在谈论投资加密货币的问题。\n大笔资金投资于加密货币。请记住，这是一种高风险。\n\n这并不是说你不应该拿一些你辛苦挣来的钱，...",
      "title": "如果你是年轻人，并考虑投资加密货币，请花点时间阅读这个。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我相信這聽起來會很迂腐，但隨着最近所有的興奮，我看到\n很多20多歲甚至十幾歲的人都在談論投資加密貨幣的問題。\n大筆資金投資於加密貨幣。請記住，這是一種高風險。\n\n這並不是說你不應該拿一些你辛苦掙來的錢，...",
      "title": "如果你是年輕人，並考慮投資加密貨幣，請花點時間閱讀這個。"
    }
  ]
}