{
  "author": "neofagalt",
  "original_created_utc": 1658250910,
  "title": "Am I weird for liking to be alone on my lunch breaks?",
  "created_utc": 1658274275,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m at a new office and my coworkers have asked me to have lunch with them. While I’m a bit of an introvert by nature and usually appreciate these offers, I like to eat lunch in my car, alone. I vape as well, and it’s not really something I like doing around coworkers. Plus, I enjoy being on my phone to catch up on stuff I’ve missed while at work. &lt;/p&gt;\n\n&lt;p&gt;I get the feeling that I’m probably seen as a recluse for this, but even at my old office where I actually knew my coworkers well, I never enjoyed sitting with them during lunch.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 118,
  "permalink": "/r/NoStupidQuestions/comments/w2xzwu/am_i_weird_for_liking_to_be_alone_on_my_lunch/",
  "subreddit": "NoStupidQuestions",
  "id": "w2xzwu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m at a new office and my coworkers have asked me to have lunch with them.\nWhile I’m a bit of an introvert by nature and usually appreciate these offers, I\nlike to eat lunch in my car, alone. I vape as well, and it’s not really\nsomething I like doing around coworkers. Plus, I enjoy being on my…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "新しい職場に来て、同僚からランチに誘われたんだけど。\n私は元々内向的な性格なので、このような申し出はありがたいのですが、私は車の中で一人でランチを食べるのが好きです。\n車の中で一人でランチを食べるのが好きなんです。私はタバコも吸いますが、同僚と一緒に吸うのはあまり好きではありません。\n同僚と一緒にするのは好きではありません。それに、一人でいるのが好きなんだ...。",
      "title": "昼休みに一人でいるのが好きな私は変でしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在一个新的办公室，我的同事们要求我和他们一起吃午饭。\n虽然我天生有点内向，通常很感谢这些邀请，但我\n我喜欢在我的车里吃午饭，一个人。我也吸食大麻，但这并不是我喜欢在同事身边做的事情。\n我不喜欢在同事身边做这种事。此外，我喜欢在我的...",
      "title": "我喜欢在午休时独处，是不是很奇怪？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在一個新的辦公室，我的同事們要求我和他們一起喫午飯。\n雖然我天生有點內向，通常很感謝這些邀請，但我\n我喜歡在我的車裏喫午飯，一個人。我也吸食大麻，但這並不是我喜歡在同事身邊做的事情。\n我不喜歡在同事身邊做這種事。此外，我喜歡在我的...",
      "title": "我喜歡在午休時獨處，是不是很奇怪？"
    }
  ]
}