{
  "author": "SweetPie123",
  "the_new_excerpt": "Institutional adoption.\n\nAll sorts of banks and institutions rolled out crypto products to sell to their\ncustomers, to be shelved until the next run arrives. This isn't new, exactly the\nsame thing happened last run. There's no real buying pressure from institutional\ninvestors either, Grayscales'…",
  "original_created_utc": 1622812267,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "機関の採用。\n\n様々な銀行や機関が、顧客に販売するために暗号製品を開発し、次の流行が来るまで棚上げにしていた。\n次の流れが来るまで棚上げされていました。これは新しいことではなく、全く同じことが前回の\nこれは新しいことではなく、前回も全く同じことが起こっています。機関投資家からの本当の買い圧力はありません。\nGrayscalesの...",
      "title": "クリプトマーケットは、前回のブルランのように未熟なものです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "机构采用。\n\n各种银行和机构都推出了加密货币产品，以出售给他们的客户。\n搁置起来，直到下一次运行到来。这并不新鲜，上一次\n同样的事情发生在上一次。机构投资者也没有真正的购买压力\n投资者也没有真正的购买压力，Grayscales的...",
      "title": "加密市场就像上一次牛市一样不成熟。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "機構採用。\n\n各種銀行和機構都推出了加密貨幣產品，以出售給他們的客戶。\n擱置起來，直到下一次運行到來。這並不新鮮，上一次\n同樣的事情發生在上一次。機構投資者也沒有真正的購買壓力\n投資者也沒有真正的購買壓力，Grayscales的...",
      "title": "加密市場就像上一次牛市一樣不成熟。"
    }
  ],
  "title": "Cryptomarkets are just as immature as the last bullrun.",
  "created_utc": 1622858461,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Institutional adoption.</strong></p>\n\n<p>All sorts of banks and institutions rolled out crypto products to sell to their customers, to be shelved until the next run arrives. This isn&#39;t new, exactly the same thing happened last run. There&#39;s no real buying pressure from institutional investors either, Grayscales&#39; shares have traded at a negative premium for the past two months (recovered slightly on some days).  GrayScale Bitcoin Trust’s (GBTC) premium fell to -20.48% on Wednesday, May 12, according to cryptocurrency data tracker YCharts. This is the lowest ever point for Grayscale’s flagship product, and means that those investors who bought the fund’s shares in the past are suffering losses. Institutions have historically accounted for a majority of Grayscale inflows. This was especially true in Q4, 2020 as institutions accounted for 93% of capital inflows, or $3.0 billion. If there was any real buying pressure from institutions the premium wouldn&#39;t dip to -20%, let alone in a bullrun.</p>\n\n<p><strong>An immature market.</strong></p>\n\n<p>Just go to almost any crypto-specific subreddit and you&#39;ll get what I&#39;m talking about. Almost nobody cares about tech, just about &#39;&#39;filthy fiat&#39;&#39;. Celebrities with thousands of followers shilling shitty memecoins, a billionaire who manipulates the markets at its will, China FUD, making coins trending on Twitter, &#39;&#39;this time will be different&#39;&#39;, and I can go on and on. It&#39;s all focussed on the idea of sucking as many new people into their coin, to later dump onto the &#39;&#39;Greater Fool&#39;&#39;. Crypto was meant to be used, not being hoarded. Until a simple 140 character tweet won&#39;t move the market with billions of dollars I don&#39;t expect any real adoption (ofc there&#39;s some projects having some success in adoption, just very very little compared to the total crypto marketcap).</p>\n</div><!-- SC_ON -->",
  "score": 166,
  "permalink": "/r/CryptoCurrency/comments/ns4s0p/cryptomarkets_are_just_as_immature_as_the_last/",
  "subreddit": "CryptoCurrency",
  "id": "ns4s0p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404881316
}