{
  "author": "Altusgladio",
  "the_new_excerpt": "This happens to me very, very often. We will be having a convo about something\nrandom and I will say something I think is interesting or a good point and it\nseemingly goes over the other person's head. Then, that person will say the\nexact same thing or something very similar and just look at me as…",
  "original_created_utc": 1615738363,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这种情况发生在我身上非常非常频繁。我们会有一个对话的东西\n随机的，我会说一些我认为有趣的或好的点，它是\n似乎在对方的头上。然后，这个人就会说\n一模一样的东西或非常相似的东西，只是看我作为... ...",
      "title": "当我和别人谈话时，他们有时会重复我几分钟前说过的一模一样的话，甚至不承认是我先说的。这正常吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這種情況發生在我身上非常非常頻繁。我們會有一個對話的東西\n隨機的，我會說一些我認爲有趣的或好的點，它是\n似乎在對方的頭上。然後，這個人就會說\n一模一樣的東西或非常相似的東西，只是看我作爲... ...",
      "title": "當我和別人談話時，他們有時會重複我幾分鐘前說過的一模一樣的話，甚至不承認是我先說的。這正常嗎？"
    }
  ],
  "title": "When I'm having a conversation with someone, they will sometimes repeat the exact same thing I said minutes earlier and don't even acknowledge that I said it first. Is this normal?",
  "created_utc": 1615747817,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This happens to me very, very often. We will be having a convo about something random and I will say something I think is interesting or a good point and it seemingly goes over the other person&#39;s head. Then, that person will say the exact same thing or something very similar and just look at me as if awaiting my response to it. Sometimes I&#39;ll say &quot;well that&#39;s what I said&quot; but they still don&#39;t acknowledge it! It&#39;s like it entered their brain but they mistakenly think it was their own idea. I don&#39;t think anyone is doing it maliciously. Does anyone else experience this? It lowkey freaks me out.</p>\n</div><!-- SC_ON -->",
  "score": 138,
  "permalink": "/r/TooAfraidToAsk/comments/m4y0k6/when_im_having_a_conversation_with_someone_they/",
  "subreddit": "TooAfraidToAsk",
  "id": "m4y0k6",
  "is_self": true,
  "media": null,
  "is_video": false
}