{
  "author": "doctorizer",
  "original_created_utc": 1632190355,
  "title": "How can philosophers hold certain extreme beliefs (e.g., solipsism) yet live a normal life?",
  "created_utc": 1632264130,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As the title says, how can philosophers believe in certain things and yet live their lives as if those things are not true or do not apply to them personally. I guess my question is whether there is a hypocrisy involved or perhaps a kind of separation between, say, John-the-individual and John-the-philosopher?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/askphilosophy/comments/ps99i0/how_can_philosophers_hold_certain_extreme_beliefs/",
  "subreddit": "askphilosophy",
  "id": "ps99i0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As the title says, how can philosophers believe in certain things and yet live\ntheir lives as if those things are not true or do not apply to them personally.\nI guess my question is whether there is a hypocrisy involved or perhaps a kind\nof separation between, say, John-the-individual and John-the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルにもあるように、哲学者はあることを信じているにもかかわらず、そのことが真実ではないか、自分には当てはまらないかのように生きていることがあります。\n哲学者は、あることを信じながら、それが真実ではないか、自分には関係ないかのように生活することができるでしょうか。\n私の質問は、偽善が含まれているかどうかということです。\n個人としてのジョンと、個人としてのジョンとの間に、偽善があるのか、あるいは分離があるのか、ということです。",
      "title": "哲学者は、極端な信念（例えば、孤独主義）を持っていても、どうして普通の生活を送ることができるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "正如标题所说，哲学家们怎么能相信某些东西，却又把这些东西当作不真实或不适用的东西来生活？\n他们的生活，好像这些东西不是真的，或者不适用于他们个人。\n我想我的问题是，是否存在着一种虚伪，或者说是一种\n虚伪，或者说是一种分离，比如说，个人的约翰和约翰的......。",
      "title": "哲学家如何能够持有某些极端的信仰（例如，唯心主义），却又能过上正常的生活？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "正如標題所說，哲學家們怎麼能相信某些東西，卻又把這些東西當作不真實或不適用的東西來生活？\n他們的生活，好像這些東西不是真的，或者不適用於他們個人。\n我想我的問題是，是否存在着一種虛僞，或者說是一種\n虛僞，或者說是一種分離，比如說，個人的約翰和約翰的......。",
      "title": "哲學家如何能夠持有某些極端的信仰（例如，唯心主義），卻又能過上正常的生活？"
    }
  ]
}