{
  "author": "Mr_bike",
  "original_created_utc": 1638659594,
  "title": "If this \"crash\" didn't leave you starving or homeless you're fine.",
  "created_utc": 1638682295,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;What I mean is that you&amp;#39;re not over invested if that&amp;#39;s the case. Maybe you had 100k usd worth around Dec 1st or maybe you invested 100 usd. The important part is, if you just checked the charts and you still have enough to pay your rent, buy food, and live life as you were a week ago, you&amp;#39;re fine.&lt;/p&gt;\n\n&lt;p&gt;You didn&amp;#39;t over invest, you didn&amp;#39;t leverage, and you didn&amp;#39;t buy crypto with a payday loan. There have been much bigger flash crashes and if you&amp;#39;ve been here long enough, you&amp;#39;ll know that we could still drop lower at this point and still be fine if you&amp;#39;re following the above stated.&lt;/p&gt;\n\n&lt;p&gt;The prices will go back up, we&amp;#39;re still early in this. If this dip is negatively affecting your life, I hope you can get this sorted out to where you can safely invest your money next time.&lt;/p&gt;\n\n&lt;p&gt;In the meantime Holidays are upon us so call a family member or someone you care about and let them know they are important to you.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 200,
  "permalink": "/r/CryptoCurrency/comments/r91rcr/if_this_crash_didnt_leave_you_starving_or/",
  "subreddit": "CryptoCurrency",
  "id": "r91rcr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "What I mean is that you're not over invested if that's the case. Maybe you had\n100k usd worth around Dec 1st or maybe you invested 100 usd. The important part\nis, if you just checked the charts and you still have enough to pay your rent,\nbuy food, and live life as you were a week ago, you're…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "何が言いたいかというと、それなら投資しすぎじゃないのかってことです。もしかしたら、あなたは\n12月1日頃に10万usdの価値があったのか、100usdを投資したのか。重要なのは\nチャートで確認したところ、まだ家賃を払うだけの余裕があるのなら、です。\n食料を買い、1週間前と同じように生活しているあなたは",
      "title": "この「暴落」で飢えたりホームレスになったりしなければ問題ない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的意思是，如果是这样的话，你就没有过度投资。也许你有\n12月1日前后有10万美金的价值，或者你投资了10万美金。重要的是\n重要的是，如果你刚刚检查了图表，你仍然有足够的钱来支付你的租金。\n买食物，并像一周前那样生活，你就......",
      "title": "如果这次 \"崩溃 \"没有让你挨饿或无家可归，你就没事。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的意思是，如果是這樣的話，你就沒有過度投資。也許你有\n12月1日前後有10萬美金的價值，或者你投資了10萬美金。重要的是\n重要的是，如果你剛剛檢查了圖表，你仍然有足夠的錢來支付你的租金。\n買食物，並像一週前那樣生活，你就......",
      "title": "如果這次 \"崩潰 \"沒有讓你捱餓或無家可歸，你就沒事。"
    }
  ]
}