{
  "author": "littlealert1",
  "the_new_excerpt": "Recently have been considering all the speculation regarding whether we are in a\nbubble. I flip back and forth on whether or not we actually are in the midst.\nPrices are obviously high, probably overvalued in some obvious cases, but\ninterest rates are low, the Fed keeps on buying, stimulus keeps…",
  "original_created_utc": 1610156943,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "最近一直在考虑所有关于我们是否处于\n泡沫。对于我们是否真的处于其中，我来回翻来覆去。\n价格显然很高，在一些明显的情况下可能被高估了，但\n利率处于低位，美联储继续购买，刺激措施使…保持不变",
      "title": "过度的“泡沫”言论"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近一直在考慮所有關於我們是否處於\n泡沫。對於我們是否真的處於其中，我來回翻來覆去。\n價格顯然很高，在一些明顯的情況下可能被高估了，但\n利率處於低位，美聯儲繼續購買，刺激措施使…保持不變",
      "title": "過度的“泡沫”言論"
    }
  ],
  "title": "Excessive “Bubble” Talk",
  "created_utc": 1610189675,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Recently have been considering all the speculation regarding whether we are in a bubble. I flip back and forth on whether or not we actually are in the midst. Prices are obviously high, probably overvalued in some obvious cases, but interest rates are low, the Fed keeps on buying, stimulus keeps pumping, and major companies do seem to indeed be making decent piles of money. But on a purely psychological-level, when everyone is saying we are in a bubble makes me think we aren’t actually – historically bubbles happen when everyone turns a blind-eye to excessive rises in asset prices. People aren’t turning a blind-eye yet, in fact everyone keeps making claims and saying be cautious. So I think in a contrarian sense prices will continue to rise for the short- and medium- term at least until sentiment shifts and everyone begins to think that this is all normal and BAU again. We aren’t there yet. There’s possibility of external factors coming into play: shutdown risk (I personally believe this risk is low), no future stimulus (low again), etc. Then again, I may be the one making that BAU case, only time will tell...</p>\n\n<p>Good luck in 2021 everyone and stay safe.</p>\n</div><!-- SC_ON -->",
  "score": 73,
  "permalink": "/r/stocks/comments/kth7s4/excessive_bubble_talk/",
  "subreddit": "stocks",
  "id": "kth7s4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706380969
}