{
  "author": "themop1",
  "original_created_utc": 1632322617,
  "title": "The Best Investment in Crypto History is Happening Right Now with Tezos XTZ",
  "created_utc": 1632336435,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>OK so this crypto hits every check box.  It&#39;s Proof-of-Stake.  It has 25 percent of the transactions that ETH has presently.  It has a market cap 1/100th of ETH.  It costs pennies to send the crypto.  Gas fees are pennies.  Huge growth.  The market has just beaten down the price by about 40 percent to boot.  Valuation websites are saying that based on its growth it should be worth 3x its current market cap already.  </p>\n\n<p>Here&#39;s the thing about ETH that no one wants to talk about seriously.  Sure it has the most projects but those projects are put in handcuffs by the very high gas fees.  It should not cost 50 dollars to move a coin.  So if I am a new developer why would I pick ETH as a platform to host my APP or Project?  What is the only advantage it has?  Size.  It&#39;s a big elephant with a lot of people pumping money into it because they assume size means it can&#39;t be taken down.  It absolutely can be taken down.  You&#39;re going to see projects moving ERC-20 coins entirely over to Tezos soon.  Because the odds go up that their project will be usable by people looking to use it a lot.  </p>\n\n<p>For instance.  I had a token called AMP that is hosted on ETH.  I wanted to stake the coin but decided I would feel trapped if I did.  It shouldn&#39;t be expensive to stake a coin and then unstake a coin in short period of time.  Our NFT projects are all selling out on Oneof.  Tezos is going to 100 billion market cap and ETH is close to its peak market cap.  Do you want something that can do 20x or 3x?  The answer is pretty obvious.  Maybe if ETH could move to Proof of Stake immediately they would stand a chance.  But I&#39;m making a prediction that TEZOs is about to be moved up from the minors into the BIGS.</p>\n</div><!-- SC_ON -->",
  "score": 162,
  "permalink": "/r/CryptoCurrency/comments/pt99vl/the_best_investment_in_crypto_history_is/",
  "subreddit": "CryptoCurrency",
  "id": "pt99vl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "OK so this crypto hits every check box. It's Proof-of-Stake. It has 25 percent\nof the transactions that ETH has presently. It has a market cap 1/100th of ETH.\nIt costs pennies to send the crypto. Gas fees are pennies. Huge growth. The\nmarket has just beaten down the price by about 40 percent to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "さて、この暗号はすべてのチェックボックスを満たしています。Proof-of-Stakeであること。現在ETHの25%の\nETHの現在の取引量の25%に相当します。ETHの100分の1の時価総額です。\n暗号の送信には小銭がかかります。ガス料金も小銭です。巨大な成長。は、その\n市場は価格を約40％下げて、...",
      "title": "暗号史上最高の投資は、今、Tezos XTZで起こっている"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "好了，这个密码器击中了每一个复选框。这是个取证的项目。它有25%的\n它的交易量是目前ETH的25%。它的市值是ETH的1/100。\n发送加密货币只需几分钱。燃气费是几分钱。巨大的增长。市场\n市场刚刚将价格打压了约40%，达到...",
      "title": "加密货币历史上最好的投资现在正在Tezos XTZ上发生"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好了，這個密碼器擊中了每一個複選框。這是個取證的項目。它有25%的\n它的交易量是目前ETH的25%。它的市值是ETH的1/100。\n發送加密貨幣只需幾分錢。燃氣費是幾分錢。巨大的增長。市場\n市場剛剛將價格打壓了約40%，達到...",
      "title": "加密貨幣歷史上最好的投資現在正在Tezos XTZ上發生"
    }
  ]
}