{
  "author": "sheffieldasslingdoux",
  "original_created_utc": 1657944943,
  "title": "The anti-Nazi resistance group, the White Rose, wrote in one of their leaflets that Polish girls were sent to SS-run brothels in Norway. What do we know about this?",
  "created_utc": 1657976426,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Excerpt from the Leaflet II by the White Rose: &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;We don’t want to write about the Jewish Question in this leaflet, we don’t want to compose a defending speech – no, we just want to mention a fact as a short example, the fact that since the conquest of Poland &lt;em&gt;three hundred thousand&lt;/em&gt; Jews have been murdered in this country in the most bestial way. Here we see the most terrifying crime against human dignity, a crime that is unparalleled in the entire history of mankind. The Jews, too, are human beings – no matter what position one takes on the Jewish Question – and against human beings a crime of this dimension has been perpetrated. Someone might say that the Jews deserve their fate. This assertion would be a monstrous presumption; but let us assume that someone said this – what position has he then taken on the fact that the entire Polish aristocratic youth has been annihilated (May God grant that this is not yet the case!)? In what way, they would ask, did something like this happen? All male offspring of noble lineage between the ages of fifteen and twenty were transported to concentration camps in Germany and sentenced to forced labour, and &lt;strong&gt;all the girls of this age group were sent to Norway, into the brothels of the SS!&lt;/strong&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/w07svz/the_antinazi_resistance_group_the_white_rose/",
  "subreddit": "AskHistorians",
  "id": "w07svz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Excerpt from the Leaflet II by the White Rose:\n\n> We don’t want to write about the Jewish Question in this leaflet, we don’t\n> want to compose a defending speech – no, we just want to mention a fact as a\n> short example, the fact that since the conquest of Poland three hundred\n> thousand Jews have…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "白薔薇のリーフレットIIより抜粋。\n\n> このリーフレットでは、ユダヤ人問題について書きたくありませんし、書けません。\n> このビラでユダヤ人問題について書きたいわけではありませんし、弁護的な演説をしたいわけでもありません。\n> ポーランドが征服されて以来、30万人のユダヤ人たちが、このビラの中に入ってきたという事実です。\n> 30万人のユダヤ人が...",
      "title": "反ナチス抵抗組織「白バラ」は、あるビラの中で、ポーランド人の少女がノルウェーのSS経営の売春宿に送られたことを書いている。それについて私たちは何を知っているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "摘自《白玫瑰》的传单二。\n\n> 我们不想在这份传单中写到犹太人问题，我们不\n>想写一篇辩护词--不，我们只想提到一个事实作为一个\n> 一个简短的例子，即自从波兰被征服以来，有三十万犹太人\n> 犹太人已经......。",
      "title": "反纳粹抵抗组织 \"白玫瑰 \"在他们的一份传单中写道，波兰女孩被送到挪威由党卫军管理的妓院。我们对此有什么了解？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "摘自《白玫瑰》的傳單二。\n\n> 我們不想在這份傳單中寫到猶太人問題，我們不\n>想寫一篇辯護詞--不，我們只想提到一個事實作爲一個\n> 一個簡短的例子，即自從波蘭被征服以來，有三十萬猶太人\n> 猶太人已經......。",
      "title": "反納粹抵抗組織 \"白玫瑰 \"在他們的一份傳單中寫道，波蘭女孩被送到挪威由黨衛軍管理的妓院。我們對此有什麼瞭解？"
    }
  ]
}