{
  "author": "sheffieldasslingdoux",
  "original_created_utc": 1657944943,
  "title": "The anti-Nazi resistance group, the White Rose, wrote in one of their leaflets that Polish girls were sent to SS-run brothels in Norway. What do we know about this?",
  "created_utc": 1657976426,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Excerpt from the Leaflet II by the White Rose: &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;We don’t want to write about the Jewish Question in this leaflet, we don’t want to compose a defending speech – no, we just want to mention a fact as a short example, the fact that since the conquest of Poland &lt;em&gt;three hundred thousand&lt;/em&gt; Jews have been murdered in this country in the most bestial way. Here we see the most terrifying crime against human dignity, a crime that is unparalleled in the entire history of mankind. The Jews, too, are human beings – no matter what position one takes on the Jewish Question – and against human beings a crime of this dimension has been perpetrated. Someone might say that the Jews deserve their fate. This assertion would be a monstrous presumption; but let us assume that someone said this – what position has he then taken on the fact that the entire Polish aristocratic youth has been annihilated (May God grant that this is not yet the case!)? In what way, they would ask, did something like this happen? All male offspring of noble lineage between the ages of fifteen and twenty were transported to concentration camps in Germany and sentenced to forced labour, and &lt;strong&gt;all the girls of this age group were sent to Norway, into the brothels of the SS!&lt;/strong&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/w07svz/the_antinazi_resistance_group_the_white_rose/",
  "subreddit": "AskHistorians",
  "id": "w07svz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Excerpt from the Leaflet II by the White Rose:\n\n> We don’t want to write about the Jewish Question in this leaflet, we don’t\n> want to compose a defending speech – no, we just want to mention a fact as a\n> short example, the fact that since the conquest of Poland three hundred\n> thousand Jews have…"
}