{
  "author": "Rounder057",
  "the_new_excerpt": "I won’t get into the whole thing but it is about hitting that point in your life\nwhere you are too old to work and these “support systems” like social security,\n401k, Medicare are not able to support the people that need it. The people that\npaid into it.\n\nAdd into that medical costs and problems and…",
  "original_created_utc": 1619629808,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "全体を説明するつもりはありませんが、それは人生のある地点に到達することです。\n働けない年齢になって、社会保障や401k、メディケアなどの「サポートシステム」が必要な人を支えられなくなることです。\n401k、Medicareなどの「サポートシステム」が必要な人をサポートできないということです。払った人\n払ってきた人たちです。\n\nさらに、医療費や問題が発生して...。",
      "title": "私や他の多くの人々が今、暗号に投資している大きな理由を理解したいのであれば、映画「Nomadland」をご覧ください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不会谈论整个事情，但它是关于在你的生活中遇到的那个点\n你太老了，不能工作，而这些 \"支持系统\"，如社会保险，401k，医疗保险不能支持需要的人。\n401k、Medicare等 \"支持系统 \"无法支持需要它的人。这些人\n支付给它的人。\n\n加上医疗费用和问题，以及...",
      "title": "如果你想了解我和其他许多人现在投资加密货币的一个重要原因，请看电影《游牧民族》。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不會談論整個事情，但它是關於在你的生活中遇到的那個點\n你太老了，不能工作，而這些 \"支持系統\"，如社會保險，401k，醫療保險不能支持需要的人。\n401k、Medicare等 \"支持系統 \"無法支持需要它的人。這些人\n支付給它的人。\n\n加上醫療費用和問題，以及...",
      "title": "如果你想了解我和其他許多人現在投資加密貨幣的一個重要原因，請看電影《遊牧民族》。"
    }
  ],
  "title": "If you want to understand a big reason why me and so many other people are investing in crypto right now, watch the movie Nomadland",
  "created_utc": 1619671673,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I won’t get into the whole thing but it is about hitting that point in your life where you are too old to work and these “support systems” like social security, 401k, Medicare are not able to support the people that need it. The people that paid into it. </p>\n\n<p>Add into that medical costs and problems and I have no desire to be apart of it. No desire to auction off my time for money, money that is losing its value and security that is slowly eroding away. </p>\n\n<p>You are all early adopters if you are here now. Break out of the system, this is our matrix. </p>\n\n<p>I have a job to buy crypto </p>\n\n<p>I buy crypto to not have a job. </p>\n\n<p>Only you can set yourself free because these social safety nets are an illusion. Do you really want to be the person that has to forgo food for medication, medication of rent. </p>\n\n<p>You don’t.</p>\n\n<p>Money is a euphemism for time and no matter how much they pay you, it will never be enough to refund the things in life that you must miss out on just to purchase what is yours in the first place</p>\n</div><!-- SC_ON -->",
  "score": 178,
  "permalink": "/r/CryptoCurrency/comments/n0jnug/if_you_want_to_understand_a_big_reason_why_me_and/",
  "subreddit": "CryptoCurrency",
  "id": "n0jnug",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776213351
}