{
  "author": "koskadelli",
  "the_new_excerpt": "Investing in Desert Mountain Energy (DME.V, DMEHF)\n\nDue Diligence\n\nWhy Helium?\n\n * Helium is a Non-renewable, non-synthesizable element that is an irreplaceable\n   component of many growing, high tech industries - MRI magnetics, cloud\n   storage, rocketry, semiconductors, nuclear power, and fiber…",
  "original_created_utc": 1616971610,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "投资沙漠山能源(DME.V，DMEHF)\n\n尽职调查\n\n为什么是氦？\n\n * 氦是一种不可再生、不可合成的元素，是不可替代的。\n   许多成长中的高科技行业的组成部分--核磁共振成像磁学、云计算。\n   存储、火箭、半导体、核电和光纤... ...",
      "title": "投资于氦气----DMEHFDD"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "投資沙漠山能源(DME.V，DMEHF)\n\n盡職調查\n\n爲什麼是氦？\n\n * 氦是一種不可再生、不可合成的元素，是不可替代的。\n   許多成長中的高科技行業的組成部分--核磁共振成像磁學、雲計算。\n   存儲、火箭、半導體、核電和光纖... ...",
      "title": "投資於氦氣----DMEHFDD"
    }
  ],
  "title": "Investing in Helium - DMEHF DD",
  "created_utc": 1617041330,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Investing in Desert Mountain Energy (DME.V, DMEHF)</strong></p>\n\n<p>Due Diligence</p>\n\n<p><strong>Why Helium?</strong></p>\n\n<ul>\n<li>Helium is a Non-renewable, non-synthesizable element that is an irreplaceable component of many growing, high tech industries - MRI magnetics, cloud storage, rocketry, semiconductors, nuclear power, and fiber optics, just to name a few. When used as a coolant and in many manufacturing aspects, there is no substitute.</li>\n<li>Helium is rare on Earth. It is only obtainable by drilling for gas reserves in very particular parts of the world.</li>\n<li>Helium is a $10+Billion industry with a CAGR of 4% (2018 prediction) - 11% (2020 prediction) (sources conflict as the Helium industry is highly concentrated currently with little transparency). Helium overperformed 2015 future-looking estimates by 150%.</li>\n</ul>\n\n<p><strong>Why Now?</strong></p>\n\n<ul>\n<li>Demand has exceeded supply for years, and prices have continued to balloon: <a href=\"https://imgur.com/a/QgUrnCf\">https://imgur.com/a/QgUrnCf</a></li>\n<li>The United States Bureau of Land Management (BLM) has been a major player in the Helium industry, accounting for nearly 20% of the global market. However, it was directed to privatize starting in 1996 and will be ending the majority of activity in 2021 having exhausted storage that has existed since the ‘60s, leaving a void in supply. <strong>It’s not every day that a 20% player in an industry just exits the market.</strong></li>\n<li>Nearly all helium production today comes as a by-product of Natural gas extraction (constituting &lt;1% of gas extracted). The move away from carbon fuels may further constrain helium supply as a consequence.</li>\n</ul>\n\n<p><strong>Why Desert Mountain Energy (DME)?</strong></p>\n\n<ul>\n<li>DME is one of the only companies concentrating exclusively on helium production.</li>\n<li>DME operates in Arizona - the same area the US BLM found mining success in.</li>\n<li>Strong, experienced company leadership that have led multiple mining projects.</li>\n<li>Good financials (see below) and solid plan that is progressing - tens of thousands of acres procured for drilling and refining.</li>\n<li>DME is far ahead of all of the other helium-specific mining operations that are just starting to catch on (RHC, Helium One), and in a much better location.</li>\n</ul>\n\n<p><strong>Why is Arizona Important</strong></p>\n\n<ul>\n<li>Test wells have shown tremendous yields, with the first test well showing 7% He and 24,000+ mcf (thousand cubic feet) gas flow per day.</li>\n<li>DME has hit significant Helium on 3/3 test wells drilled.</li>\n<li>Shipping and selling locally is important as gaseous helium can escape storage over time. Local industries include everything from SpaceX to Intel, which recently announced a $20B project to build semiconductor factories close to DME’s property.</li>\n<li>Other major helium players globally are in less stable locations or locations that don’t have strong US relations: Algeria, Qatar, Russia.</li>\n<li>The majority of land DME holds is private, meaning less regulation and quicker time to market.</li>\n</ul>\n\n<p><strong>Financials and Plans</strong></p>\n\n<ul>\n<li>Strong cash on hand via private placement rather than private debt. $13M. Cash on hand used to procure land for both drilling and processing, and for equipment and transportation.</li>\n<li>Initial production and revenue generation starts this year. Getting 6 wells running by the end of year will cost $45M total over the lifetime of the wells, while the wells will generate this value in 18 months or less.</li>\n<li>Current market cap ~$128M, with the vast majority of retail/private ownership.</li>\n<li>Helium is extremely profitable once the operation is up and running. Analysts at Cormark expect DME to operate at 85% net of operating expenses.</li>\n<li>The first test well drilled has an overall valuation of $250M+ over a 10 year timespan based on static recent Helium prices. DME plans to drill 60 - 70 wells over this timespan. Even at conservative yields, we can expect order of magnitude increases to their revenue and market cap over the next decade.</li>\n<li>DME plans to process Helium and concentrate on high-grade Helium which has much higher yields than bulk helium (and is less or irreplaceable in its uses, such as cooling), further specializing operations.</li>\n<li>DME has other projects/holdings - namely land in OK for an oil play, but is concentrating on helium in Arizona right now.</li>\n</ul>\n\n<p><strong>What’s Next?</strong></p>\n\n<ul>\n<li>Test results from wells 4-6 coming in the next few months</li>\n<li>Revenue and contract information towards the end of year.</li>\n<li>My opinion is that It’s entirely possible DME is acquired by a high-usage player local to the Arizona area.</li>\n</ul>\n\n<p><strong>Risks?</strong></p>\n\n<ul>\n<li>Governmental effects, both nationally and locally. For example, the US leveraged helium politically by restricting exports to China in 2015, and if prices were to get out of control they could reverse course on privatization, though there are no indications of this now. (Quite the opposite, actually).</li>\n<li>Locally, the city of Flagstaff was granted a restraining order on DME to prevent drilling on one testing site due to concerns about the local water table (though misleadingly claimed they were fracking, which they are not). The vast majority of DME’s land is procured on private sources away from Flagstaff and is unaffected by this.</li>\n<li>Flow rates could be less successful at their other drill sites. I’ve been very conservative due to this in my future valuation calculations.</li>\n<li>There is barely any institutional ownership of the stock, which could be good or bad depending on which resources you consult.</li>\n<li>Other global supply coming online in the coming years. Largely in areas without close trade ties to the US, and offset by DME’s domestic concentration.</li>\n<li>A large player could ramp up supply to specifically push out the little guy. This would be difficult though. Since other helium production is a by-product of natural gas, this would mean flooding that primary market, which would have harsh consequences.</li>\n</ul>\n\n<p><strong>My position</strong></p>\n\n<ul>\n<li>2100 shares, continuing to add.</li>\n<li>IMO, this is a long term hold (3 - 5 years), not a short term flip. Expect volatility around this year’s catalyst events. Very conservatively I see this as hitting $20/share over this timeframe.</li>\n<li>Disclaimer: I do not provide personal investment advice and I am not a qualified licensed investment advisor. I am an amateur investor. All information found here, including any ideas, opinions, views, predictions, forecasts, commentaries, suggestions, or stock picks, expressed or implied herein, are for informational or educational purposes only and should not be construed as personal investment advice. While the information provided is believed to be accurate, it may include errors or inaccuracies. I will not and cannot be held liable for any actions you take as a result of anything you read here. Conduct your own due diligence.</li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 49,
  "permalink": "/r/investing/comments/mfbyli/investing_in_helium_dmehf_dd/",
  "subreddit": "investing",
  "id": "mfbyli",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357140062
}