{
  "author": "Blizzgrarg",
  "the_new_excerpt": "Rates are rising because bonds are selling off. Equities are overall selling off\nas well. Commodities dropped today too. So where is all the money going? Is\neveryone just selling everything and sitting on cash?\n\nI’m not really seeing much inflows into any other asset type. The money just\nseems to…",
  "original_created_utc": 1614930817,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "利率上升是因为债券在抛售。股票整体上在抛售\n以及。今天大宗商品也跌了。那么这些钱都去哪里了呢？是不是\n大家都在卖掉所有东西，坐拥现金？\n\n我并没有看到有多少资金流入其他资产类型。钱只是\n似乎...",
      "title": "钱都去哪了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "利率上升是因爲債券在拋售。股票整體上在拋售\n以及。今天大宗商品也跌了。那麼這些錢都去哪裏了呢？是不是\n大家都在賣掉所有東西，坐擁現金？\n\n我並沒有看到有多少資金流入其他資產類型。錢只是\n似乎...",
      "title": "錢都去哪了？"
    }
  ],
  "title": "Where's all the money going?",
  "created_utc": 1614958194,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Rates are rising because bonds are selling off. Equities are overall selling off as well. Commodities dropped today too. So where is all the money going? Is everyone just selling everything and sitting on cash?</p>\n\n<p>I’m not really seeing much inflows into any other asset type. The money just seems to be.... out of the markets. The whole “there is an alternative” theory doesn’t make sense because if people were buying bonds, rates wouldn’t be rising.</p>\n\n<p>And if inflation is the main fear driving the sell off, why are precious metals selling off?</p>\n\n<p>Honestly, I feel like everyone is just trying to find an excuse for the selloff. Everything is tanking, for no discernible reason. Even the stuff that’s doing well is just dropping less. The only question I have at the moment is where the money is going. For those of you who sold anything significant, did you do anything with the cash? If not, what are you waiting for?</p>\n</div><!-- SC_ON -->",
  "score": 159,
  "permalink": "/r/stocks/comments/ly719c/wheres_all_the_money_going/",
  "subreddit": "stocks",
  "id": "ly719c",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542576944
}