{
  "author": "fototak3r",
  "original_created_utc": 1654583287,
  "title": "“Dear crypto...” a message from a telegram hacker. (Link to OG post below). If true, this will devastate the crypto community.",
  "created_utc": 1654598096,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://twitter.com/adyingnobody/status/1534021154674966529?s=21\"&gt;https://twitter.com/adyingnobody/status/1534021154674966529?s=21&lt;/a&gt; &lt;/p&gt;\n\n&lt;p&gt;“I want to come clean, and I will likely tear a rift in the entire community while I&amp;#39;m at it and on my way out.&lt;/p&gt;\n\n&lt;p&gt;Over the course of these next few weeks I will be releasing 137.21GB of Telegram group chats and messages, of which I was not a part of. Why? This is all thanks to an exploit in October of 2019 that allowed one to access the group page with recent messages if proper permissions were not set up. At the time of writing this, the team at Telegram have been contacted about this. I&amp;#39;ve only ever seen two people mention this exploit in passing, one in person and one on Twitter, so I know I was not the only one.&lt;/p&gt;\n\n&lt;p&gt;Those who know me will know who I am very soon, for the rest of the populace it doesn&amp;#39;t matter. Due to the overwhelming amount of messages, I formally invite reputable press within the community to reach out in order to obtain sample archives from groups I&amp;#39;ve already curated. I will vet you because there is a conflict of interest as many are involved personally, whether being friends of those individuals in this archive or related financially in one way or another. You will receive the .7zip archive ahead of time but it will be password-protected until the 7th of July.&lt;/p&gt;\n\n&lt;p&gt;I have no further relationships with the people mentioned after this and will never be in contact with them in the future as of this moment.&lt;/p&gt;\n\n&lt;p&gt;Three years ago, a vulnerability on Telegram was discovered by a colleague of mine. He did not take it to its final outcome. By exploiting this, one could recreate an invite to view the overview page and recent messages of any Telegram group of an individual user without actually joining said group.&lt;/p&gt;\n\n&lt;p&gt;Between October of 2019 to May of 2022 I was collecting all messages as is in my data hoarding nature. I had written a script that downloads every message sent to any Telegram group with targetted individuals, you may know some of them as crypto influencers, while others targetted included many investors in the space. As Telegram adoption among crypto users began to grow, it began to become increasingly difficult to monitor all these group chats so I stepped away for a while and let the messages continue to download and be copied to my personal server.&lt;/p&gt;\n\n&lt;p&gt;For the most popular traders in the community, spying on them became a hobby. From personal events in their lives shared with their closest friend groups, to scams and rugpulls that were created on their way to success, financially and socially on Twitter. I felt like a part of it even though I had no method to interact with them. However, as they got rich, I got rich. I got myself into plenty of VC groups and soon my entire circle of friends and those I talked to became one and the same.&lt;/p&gt;\n\n&lt;p&gt;I did not care in the past, some of these people are looked up to in the ecosystem nowadays and the thought of these individuals commiting fraud would be dismissed in an instant. Some even moving on from their days of bygone scams under anonymous names with their groups of friends (while others continue to persist to this day).&lt;/p&gt;\n\n&lt;p&gt;Artists pretending to be developers, developers pretending to be artists. Those pretending to be rich, those pretending to be poor, pretending to be someone you&amp;#39;re not. All of that was exposed to me. All of that was this community at its core when expressing themselves to the public, usually through Twitter.&lt;/p&gt;\n\n&lt;p&gt;I do not know what it is about Telegram, but the alleged assurance of privacy and security meant that people became relaxed and let them express themselves freely.&lt;/p&gt;\n\n&lt;p&gt;It doesn&amp;#39;t matter to me anymore. I am dying from illnesses that are wreaking havoc on my body. Any money I made will just go on to my family, and I will disappear after that.&lt;/p&gt;\n\n&lt;p&gt;But not before this feeling of guilt is released from me.&lt;/p&gt;\n\n&lt;p&gt;Many of the individuals or projects I name will not survive this, either due to public backlash, financial fraud, or other obscure reasons such as embarrassment. Some may step down from their positions of power, others will likely ignore it as they can&amp;#39;t claim the messages that are archvied are fraudulent unless everyone involved in the group chats are all on the same page.&lt;/p&gt;\n\n&lt;p&gt;There will be confusion, there will be sadness, there will be anger and there will be frustration. I am intrigued to see what happens next but I let everyone else decide how to proceed forward.&lt;/p&gt;\n\n&lt;p&gt;June 15th will publish excerpts from:\n- crypto influencers, ranging from as little as 800 followers to as much as 1M followers\n- discussions pertaining to racism and homophobia, of adultery and sexual assault on members of the public and those within the crypto communities \n- those with 8-9 figures and high amounts of Twitter followers discussing rugpull projects, projects intended to scam the community and individuals, dating between Dec 2019 - Feb 2022\n- killing and stealing the crypto of an individual with a group of friends (coordinated through telegram)&lt;/p&gt;\n\n&lt;p&gt;June 30th:\n- project creators in the top 200 mcap projects, from yield-farming projects, to stablecoins, to AMM&amp;#39;s all designed from the start to siphon funds from the majority of users\n- discussions of everything included from the crypto influencers\n- invitation to orgies on private jets, in mansions, in VR settings, orgies everywhere\n- sexual assault, rape, and pedophilia including pedophilic orgies with victims as young as 8 years old\n- assassination, not once, not twice, but three times (coordinated through telegram)\n- lots of adultery and weird obsessions with ex-girlfriends by gifting them millions in dollars hoping to get them to fall back in love with you (you know who you are, just let it go)\n- asking twitter employees to personally delete and/or ban accounts relating to incriminating information&lt;/p&gt;\n\n&lt;p&gt;July 7th:\nEverything will be released.&lt;/p&gt;\n\n&lt;p&gt;e135846e2594f4ddb45abee1e27c8521329e440b9af77891a29ae54f8cd71bbc - 137.21GB .7zip titled &amp;quot;CTGHistory&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Password will be provided and all messages on June 15th, 30th and July 7th will be available through a signed transaction at the following address: 0xdC56BCccf3fa51687f339E2425E9Bc1a2acB42Ee&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t require a PGP for verification. Twitter will likely take this message down, at the end of the day, I did what I could to undo the power and success granted to those that do not deserve it.&lt;/p&gt;\n\n&lt;p&gt;To those in my life, I am sorry but this is what I decided. I hope you understand.”&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 418,
  "permalink": "/r/CryptoCurrency/comments/v6oepj/dear_crypto_a_message_from_a_telegram_hacker_link/",
  "subreddit": "CryptoCurrency",
  "id": "v6oepj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "https://twitter.com/adyingnobody/status/1534021154674966529?s=21\n\n“I want to come clean, and I will likely tear a rift in the entire community\nwhile I'm at it and on my way out.\n\nOver the course of these next few weeks I will be releasing 137.21GB of Telegram\ngroup chats and messages, of which I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "https://twitter.com/adyingnobody/status/1534021154674966529?s=21\n\n\n\nこの先数週間、私は137.21GBのTelegramをリリースする予定です。\n\n今後数週間の間に、137.21GBのTelegramグループチャットとメッセージを公開する予定です。\nグループチャットとメッセージのうち...",
      "title": "\"Dear crypto...\" 電報ハッカーからのメッセージ。(以下、OGの投稿へのリンク)。もし本当なら、これは暗号のコミュニティを荒廃させるでしょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "https://twitter.com/adyingnobody/status/1534021154674966529?s=21\n\n\"我想说清楚，我可能会在整个社区撕开一道裂缝\n在我离开的时候。\n\n在接下来的几周里，我将发布137.21GB的Telegram\n群聊天记录和信息，其中我...",
      "title": "\"亲爱的crypto... \"一封来自电报黑客的信息。(下面是OG帖子的链接)。如果是真的，这将对加密货币社区造成破坏。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "https://twitter.com/adyingnobody/status/1534021154674966529?s=21\n\n\"我想說清楚，我可能會在整個社區撕開一道裂縫\n在我離開的時候。\n\n在接下來的幾周裏，我將發佈137.21GB的Telegram\n羣聊天記錄和信息，其中我...",
      "title": "\"親愛的crypto... \"一封來自電報黑客的信息。(下面是OG帖子的鏈接)。如果是真的，這將對加密貨幣社區造成破壞。"
    }
  ]
}