{
  "author": "Logical-Beautiful66",
  "original_created_utc": 1637421743,
  "title": "Yes, staking is really worth it",
  "created_utc": 1637433282,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Welcome to my math class. Today, we&#39;ll answer the question from a post earlier asking if staking was really worth it. </p>\n\n<p>OP came to the conclusion that a 1% interest return per month wasn&#39;t looking like it was worth the hassle of locking your alts into staking rewards. </p>\n\n<p>If you plan to hodl you coins for the coming years, you HAVE to stake them to make the most of them. </p>\n\n<p>Lets do a little maths if you hodl your coins for 5 years (what&#39;s 5 years, really?) </p>\n\n<p>1% interest/months = 1.126% at the end of the years (after 12 months) </p>\n\n<p>=1.87% after 5 years. (Remember, that&#39;s only one month out of the 60 that constitute 5 years.) </p>\n\n<p>If you compound your interest monthly, you get 82% after 5 years. </p>\n\n<p>You get a 100% return (2x) after ≈ 5 years and 10 months. </p>\n\n<p>And you don&#39;t even take the price action into consideration here. If that coin does a mere 10x in the next 5 years and 10 months, just by staking it, you&#39;d do 20x on it. THAT IS HUUUGE. </p>\n\n<p>That&#39;s how 1000$ investments turns into 20 000$. </p>\n\n<p>*Staking rates may be reduced with the years and only a few selected great project will continue to perform in the next 5 years, but with the right strategy, it easily feasible.</p>\n\n<p>*Edit: changed commas for points, as others pointed me how to english</p>\n\n<p>So do you stake your coins? If not, did we convinced you?</p>\n</div><!-- SC_ON -->",
  "score": 155,
  "permalink": "/r/CryptoCurrency/comments/qy7qjh/yes_staking_is_really_worth_it/",
  "subreddit": "CryptoCurrency",
  "id": "qy7qjh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Welcome to my math class. Today, we'll answer the question from a post earlier\nasking if staking was really worth it.\n\nOP came to the conclusion that a 1% interest return per month wasn't looking\nlike it was worth the hassle of locking your alts into staking rewards.\n\nIf you plan to hodl you coins…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の数学教室へようこそ。今日は、以前の記事にあった質問に答えてみましょう\nステーキングは本当に価値があるのかという質問です。\n\nOPは、月に1％の利子を得ることは、その価値があるとは思えないという結論に達しました。\nアルトをステーキング報酬に固定する手間に見合うものではないと判断しました。\n\nもしあなたがコインをホーディングするつもりなら...。",
      "title": "そう、杭打ちは本当に価値がある"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "欢迎来到我的数学课。今天，我们将回答之前一个帖子中的问题\n问道：赌注是否真的值得。\n\nOP得出的结论是，每月1%的利息回报看起来并不像\n好像不值得把你的代理锁定在赌注奖励上。\n\n如果你打算把你的钱币卖掉...",
      "title": "是的，押注真的很值得"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "歡迎來到我的數學課。今天，我們將回答之前一個帖子中的問題\n問道：賭注是否真的值得。\n\nOP得出的結論是，每月1%的利息回報看起來並不像\n好像不值得把你的代理鎖定在賭注獎勵上。\n\n如果你打算把你的錢幣賣掉...",
      "title": "是的，押注真的很值得"
    }
  ]
}