{
  "author": "AjaxFC1900",
  "the_new_excerpt": "Elon Musk revealed that he has heard that Bill Gates had a big short position on\nTesla (TSLA), and he might have lost a lot of money on it.\n\nBillionaires Musk and Gates don’t always have good words to say about each\nother, but they do appear to share similar concerns about climate change.\n\nHowever,…",
  "original_created_utc": 1613165830,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "埃隆-马斯克透露，他听说比尔-盖茨曾大举做空。\n特斯拉(TSLA)，他可能因此损失了很多钱。\n\n亿万富翁马斯克和盖茨对彼此的评价并不总是好的。\n其他，但他们似乎对气候变化有着相似的担忧。\n\n然而，...",
      "title": "埃隆-马斯克认为比尔-盖茨曾大举做空特斯拉（TSLA），损失惨重"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "埃隆-馬斯克透露，他聽說比爾-蓋茨曾大舉做空。\n特斯拉(TSLA)，他可能因此損失了很多錢。\n\n億萬富翁馬斯克和蓋茨對彼此的評價並不總是好的。\n其他，但他們似乎對氣候變化有着相似的擔憂。\n\n然而，...",
      "title": "埃隆-馬斯克認爲比爾-蓋茨曾大舉做空特斯拉（TSLA），損失慘重"
    }
  ],
  "title": "Elon Musk believes Bill Gates had a big short position on Tesla (TSLA) and lost a lot of money",
  "created_utc": 1613177109,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Elon Musk revealed that he has heard that Bill Gates had a big short position on Tesla (TSLA), and he might have lost a lot of money on it.</p>\n\n<p>Billionaires Musk and Gates don’t always have good words to say about each other, but they do appear to share similar concerns about climate change.</p>\n\n<p>However, Gates made some strange comments about electrification last year, including that electric trucks, like the Tesla Semi, and electric airplanes will “probably never” work.</p>\n\n<p>In a new interview on the Joe Rogan Experience, Musk was asked about those comments from gates.</p>\n\n<p>Tesla’s CEO responded:</p>\n\n<p>“He didn’t know what he was talking about. Probably somebody told him that and he is just not that close to the physics of it. I don’t think he is ill-intentioned here, I just think he doesn’t know what he is talking about.”</p>\n\n<p>He added Tesla already has working prototypes of electric trucks that are transporting cargo – something that we already pointed out in our original report about Gates’ comment, including the fact that not only Tesla has working electric semi truck programs, but also other automakers like Daimler.</p>\n\n<p>But then Musk revealed that he has heard that Gates was betting against Tesla with a large short position:</p>\n\n<p>“I also heard that at one point he had a large short position. I don’t know if that’s true or not, but it seems weird. People I know who know the situation pretty well, I asked them “are you sure?” and they said “yes, he has a huge short position on Tesla”. That didn’t work out too well.”</p>\n\n<p>We have reached out to Gates’ foundation to see if we could get a comment on Musk’s claim, and we will update if we get an answer.</p>\n\n<p>Tesla has sometimes been the most shorted stock on the NASDAQ, and people who bet against the electric automaker lost $38 billion in 2020.</p>\n\n<p><a href=\"https://electrek.co/2021/02/12/elon-musk-believes-bill-gates-big-short-position-on-tesla-tsla-lost-money/\">https://electrek.co/2021/02/12/elon-musk-believes-bill-gates-big-short-position-on-tesla-tsla-lost-money/</a></p>\n</div><!-- SC_ON -->",
  "score": 644,
  "permalink": "/r/stocks/comments/lilf1s/elon_musk_believes_bill_gates_had_a_big_short/",
  "subreddit": "stocks",
  "id": "lilf1s",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728623037
}