{
  "author": "aliataya_",
  "original_created_utc": 1644043352,
  "title": "Imagine how weird it felt for an 1960s vendor to accept payments from a plastic card. Same goes with crypto now.",
  "created_utc": 1644109371,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Imagine what it felt like accepting the first credit card payments in the world. The concept of intangible money, money that can’t be physically seen, has always been a hard concept for humans to grasp.&lt;/p&gt;\n\n&lt;p&gt;Some countries and cities now like Dubai and New York use more credit cards than cash. Yet the transition from cash to credit cards took a very long time.&lt;/p&gt;\n\n&lt;p&gt;Meaning crypto will eventually become legal tender if we keep up this pace (and will most probably be adopted faster than credit cards got adopted).&lt;/p&gt;\n\n&lt;p&gt;There are even crypto credit cards that are paving the way for crypto payment adoption. They’re so easy to acquire. Platforms like Binance and Coinbase offer them. I have mine from CoinOvy.\nThese crypto credit cards will be a great way to transition from digital payments to full crypto payments.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 313,
  "permalink": "/r/CryptoCurrency/comments/sl0gz1/imagine_how_weird_it_felt_for_an_1960s_vendor_to/",
  "subreddit": "CryptoCurrency",
  "id": "sl0gz1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Imagine what it felt like accepting the first credit card payments in the world.\nThe concept of intangible money, money that can’t be physically seen, has always\nbeen a hard concept for humans to grasp.\n\nSome countries and cities now like Dubai and New York use more credit cards than\ncash. Yet the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "世界で初めてクレジットカードによる決済を受け入れた時の気持ちを想像してみてください。\n物理的に見ることができないお金、無形のお金という概念は、常に\n人間には理解しがたい概念であった。\n\n現在、ドバイやニューヨークのように、クレジットカードの使用枚数の方が多い国や都市もあります。\n現金 しかし、その...",
      "title": "1960年代のベンダーがプラスチックカードによる支払いを受け入れることが、どれほど奇妙に感じられたか、想像してみてください。今の暗号も同じです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "想象一下，接受世界上第一批信用卡付款是什么感觉。\n无形货币的概念，即看不见的钱，一直是一个难以理解的概念。\n对于人类来说，这是一个很难掌握的概念。\n\n现在一些国家和城市，如迪拜和纽约，使用的信用卡比现金还多。\n现金。然而，...",
      "title": "想象一下，一个1960年代的供应商接受塑料卡付款的感觉有多奇怪。现在的加密货币也是如此。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "想象一下，接受世界上第一批信用卡付款是什麼感覺。\n無形貨幣的概念，即看不見的錢，一直是一個難以理解的概念。\n對於人類來說，這是一個很難掌握的概念。\n\n現在一些國家和城市，如迪拜和紐約，使用的信用卡比現金還多。\n現金。然而，...",
      "title": "想象一下，一個1960年代的供應商接受塑料卡付款的感覺有多奇怪。現在的加密貨幣也是如此。"
    }
  ]
}