{
  "author": "MasterCookSwag",
  "the_new_excerpt": "https://www.guggenheimpartners.com/perspectives/macroeconomic-research/inflation-spiking-but-you-only-reopen-economy-once\n\n> Core CPI jumped to 3.0 percent year-over-year in April, the fastest pace since\n> 1996. While the base effect from low readings in April 2020 was widely\n> expected by markets,…",
  "original_created_utc": 1621526772,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "https://www.guggenheimpartners.com/perspectives/macroeconomic-research/inflation-spiking-but-you-only-reopen-economy-once\n\n> 4月のコアCPIは前年同月比3.0％に急上昇し、1996年以来最速のペースとなりました。\n> 1996. 2020年4月の低水準の数値によるベース効果は広く市場で予想されていたものの\n> 市場では予想されていたが、...",
      "title": "グッゲンハイム：インフレは急進しているが、経済を再開するのは一度だけだ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "https://www.guggenheimpartners.com/perspectives/macroeconomic-research/inflation-spiking-but-you-only-reopen-economy-once\n\n> 4月份核心CPI同比跃升至3.0%，是自1996年以来的最快速度。\n> 1996. 虽然2020年4月的低读数带来的基数效应被市场广泛预期。\n>市场预期，...",
      "title": "古根海姆：通货膨胀正在飙升，但你只能重启经济一次"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "https://www.guggenheimpartners.com/perspectives/macroeconomic-research/inflation-spiking-but-you-only-reopen-economy-once\n\n> 4月份核心CPI同比躍升至3.0%，是自1996年以來的最快速度。\n> 1996. 雖然2020年4月的低讀數帶來的基數效應被市場廣泛預期。\n>市場預期，...",
      "title": "古根海姆：通貨膨脹正在飆升，但你只能重啓經濟一次"
    }
  ],
  "title": "Guggenheim: Inflation Is Spiking, But You Only Reopen the Economy Once",
  "created_utc": 1621549899,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.guggenheimpartners.com/perspectives/macroeconomic-research/inflation-spiking-but-you-only-reopen-economy-once\">https://www.guggenheimpartners.com/perspectives/macroeconomic-research/inflation-spiking-but-you-only-reopen-economy-once</a></p>\n\n<blockquote>\n<p>Core CPI jumped to 3.0 percent year-over-year in April, the fastest pace since 1996. While the base effect from low readings in April 2020 was widely expected by markets, the monthly pace of inflation also rose notably. Core CPI increased 0.92 percent from March to April, the largest monthly gain since 1981.</p>\n\n<p>The market seems to think this may be the start of an enduring trend of higher inflation, given record fiscal stimulus, ultra-easy Federal Reserve (Fed) accommodation, and ongoing supply bottlenecks. But a closer look at the data suggests that this spike in prices is a one-time adjustment as the economy reopens.</p>\n\n<p>Spooked bond investors pulled forward Fed rate hike expectations after the CPI release, despite the Fed repeatedly emphasizing that they view this reopening-induced rise in prices as transitory. Investors should believe the Fed when they say they will look through this temporary inflation noise and fade the bond selloff.</p>\n\n<p>The month-to-month gains in the core CPI were largely driven by a few small categories related to economic reopening and temporary pandemic-induced shortages. 54 of the 92 basis point increase came from used cars, rental cars, airfares, and hotels, despite these categories having a weight of just 5 percent in the core CPI basket. The contribution was so large because the monthly price increases were so huge (e.g. 10 percent gain in used car prices). These increases are unlikely to be sustained beyond the next few months, especially once prices in depressed categories recover back to the pre-COVID trend.</p>\n\n<p>To the Fed, what matters is the trend in the larger, more durable inflation categories that influence the longer-term inflation outlook. In those categories, sequential inflation was much more muted: rents (including owners’ equivalent rent) and healthcare services contributed just 8 basis points to the monthly gain, despite making up 49 percent of the core CPI index. The Fed is more focused on the chart below than the chart above—and the bond market should be too.</p>\n</blockquote>\n\n<p>Charts in link</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/investing/comments/nh44p9/guggenheim_inflation_is_spiking_but_you_only/",
  "subreddit": "investing",
  "id": "nh44p9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197388308
}