{
  "author": "marekt14",
  "original_created_utc": 1632125445,
  "title": "Reminder: We hit BTC golden cross last week",
  "created_utc": 1632141437,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It&#39;s quite funny how popular the golden cross posts were last week and how many people need that hopium in their crypto life.</p>\n\n<p>But guess what, TA is mostly shit when it comes to crypto, and some Golden Cross is just an artificial concept to serve as a logical explanation to erratic price movement. But it&#39;s not correct, and it statistically has not been in the past. Some user mentioned that 4/7 golden crosses actually marked a bearish momentum. Fool&#39;s gold, I guess.</p>\n\n<p>Please, stop trying to give reason to every candle on the graph, because in the end, TA is usually incorrect, price predictions are as well, except when that 1 in 1000 analyst predicts somewhat correctly two times in a row and their opinions are reposted daily on this sub. </p>\n\n<p>Tl;dr - can&#39;t wait for the wooden cross to happen again, it&#39;s been like 2k years already</p>\n</div><!-- SC_ON -->",
  "score": 207,
  "permalink": "/r/CryptoCurrency/comments/prqdzn/reminder_we_hit_btc_golden_cross_last_week/",
  "subreddit": "CryptoCurrency",
  "id": "prqdzn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It's quite funny how popular the golden cross posts were last week and how many\npeople need that hopium in their crypto life.\n\nBut guess what, TA is mostly shit when it comes to crypto, and some Golden Cross\nis just an artificial concept to serve as a logical explanation to erratic price\nmovement.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "先週、ゴールデンクロスの投稿がどれほど人気があったか、そしてどれほど多くの人が暗号化された生活に希望を求めているか、非常に興味深いです。\n多くの人が暗号化された生活に希望を求めている。\n\nしかし、推測するに、暗号に関してはTAはほとんどクソであり、いくつかのゴールデンクロス\nは、不規則な価格の動きを論理的に説明するための人工的な概念に過ぎません。\n動き....",
      "title": "リマインダーです。先週、BTCのゴールデンクロスを達成しました"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "很有趣的是，上周的金叉帖子很受欢迎，有多少人在他们的加密货币生活中需要这种希望。\n有多少人在他们的加密货币生活中需要这种希望。\n\n但你猜怎么着，当涉及到加密货币时，TA大多是狗屎，而一些金叉\n只是一个人为的概念，作为对不稳定价格的逻辑解释。\nmovement....",
      "title": "提醒您。上周我们遇到了BTC的金叉"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "很有趣的是，上週的金叉帖子很受歡迎，有多少人在他們的加密貨幣生活中需要這種希望。\n有多少人在他們的加密貨幣生活中需要這種希望。\n\n但你猜怎麼着，當涉及到加密貨幣時，TA大多是狗屎，而一些金叉\n只是一個人爲的概念，作爲對不穩定價格的邏輯解釋。\nmovement....",
      "title": "提醒您。上週我們遇到了BTC的金叉"
    }
  ]
}