{
  "author": "bro8619",
  "the_new_excerpt": "This is a time to learn, breathe, watch, and plan. Not a time to act...yet. One\nsuggestion I offer to everyone, and it is something I do myself: I keep about\n15% of my portfolio in BRKB at all times. I added tremendously in last year’s\n~175 range, and have dealt with questioning and at times…",
  "original_created_utc": 1614967551,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "现在是学习、呼吸、观察和计划的时候。现在还不是行动的时候......。一...\n我提供给大家的建议，也是我自己做的事情。我保持着\n我的投资组合中始终有15%在BRKB。我在去年大幅增加了\n~175范围内，并曾处理过质疑，有时... ...",
      "title": "伯克希尔哈撒韦"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "現在是學習、呼吸、觀察和計劃的時候。現在還不是行動的時候......。一...\n我提供給大家的建議，也是我自己做的事情。我保持着\n我的投資組合中始終有15%在BRKB。我在去年大幅增加了\n~175範圍內，並曾處理過質疑，有時... ...",
      "title": "伯克希爾哈撒韋"
    }
  ],
  "title": "Berkshire Hathaway",
  "created_utc": 1615012714,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is a time to learn, breathe, watch, and plan. Not a time to act...yet. One suggestion I offer to everyone, and it is something I do myself: I keep about 15% of my portfolio in BRKB at all times. I added tremendously in last year’s ~175 range, and have dealt with questioning and at times outright ridicule as to why I would sideline a significant portion of my portfolio when it has under performed the s&amp;p500 for the last 15 years.</p>\n\n<p>I also keep 10-20% in VOO. Another 40% is spread out among ETFs, and the remainder home run swings. But I want to focus on precisely why Berkshire Hathaway is such a valuable investment vehicle so that many of you can consider it in the future.</p>\n\n<p>Now is not the time to buy. Once all of this blows over and people are back to fetishizing growth, there may be some great entry opportunities. But it should not be looked at as purchasing an individual stock—instead you are buying a mindset toward diversifying amongst value assets. It’s insurance giant that diversifies on a time-tested philosophy and acts as insurance for your portfolio. Since I added back last year it’s up 40%+ and is carrying my portfolio through the turmoil. You don’t even have to own a lot to make it a winner. But when the market acts like this it really makes things easier psychologically.</p>\n\n<p>There are concerns, of course. Warren isn’t going to live forever, and the company has been hesitant to capitalize on some major opportunities. But I imagine they may make some moves here that we will hear about later on if value presents itself. And the succession plan has been meticulously considered, just as Buffett’s investments are.</p>\n\n<p>But anyway—plug for a company that is boring and overlooked, but run by guys who get this stuff better than all of us combined.</p>\n\n<p>Edit: Oh to add—I also manage my mom’s portfolio. About 50% is in BRKB, 25% VOO, and 25% in VGT+VCR. She’s unfazed by the dip, may even be up now.</p>\n</div><!-- SC_ON -->",
  "score": 49,
  "permalink": "/r/stocks/comments/lyhye6/berkshire_hathaway/",
  "subreddit": "stocks",
  "id": "lyhye6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542576948
}