{
  "author": "abalcs81",
  "original_created_utc": 1644939052,
  "title": "That's it, I'm going all in",
  "created_utc": 1644977555,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I already had 50% of my net worth in bitcoin, soon to be 100%.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m furious and disheartened to see the Canadian government move to disband patriotic protesters fighting for basic human freedom and choice.  Now Trudeau gives them the power to seize funds from crowd-funding sites &lt;strong&gt;and banks&lt;/strong&gt; if they don&amp;#39;t like what you stand for???  HOLY SHIT.  They say it&amp;#39;s temporary, we shall see.  I know what I think about &amp;quot;temporary emergency government measures&amp;quot; based on historical context.&lt;/p&gt;\n\n&lt;p&gt;Also, the SEC ruling over BlockFi that halts new interest accounts for any American that does not have at least $3m in investible assets is insane.  This will for sure spread to Voyager, Celsius, Gemini...etc.  I believe this is being done in coordination with banks to drive assets back to legacy institutions and prevent the ordinary person from achieving financial security and remain in a perpetual state of monetary slavery.&lt;/p&gt;\n\n&lt;p&gt;We are firmly in the &amp;quot;..and then they fight you&amp;quot; stage.  The walls are beginning to close in on ordinary citizens as their fears of being made irrelevant by this digital peaceful revolution increase.&lt;/p&gt;\n\n&lt;p&gt;We need truly decentralized protocols providing these type of financial services now more than ever.  Go get yourself a home mining rig for non-KYC bitcoin, spin up a full node on TOR, stack your sats like an animal, and dig in your heels.&lt;/p&gt;\n\n&lt;p&gt;The fight is upon us and I for one will die on the hill of financial freedom, choice, and sovereignty. I suggest you also act accordingly.&lt;/p&gt;\n\n&lt;p&gt;Rant over.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 338,
  "permalink": "/r/Bitcoin/comments/st5j39/thats_it_im_going_all_in/",
  "subreddit": "Bitcoin",
  "id": "st5j39",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I already had 50% of my net worth in bitcoin, soon to be 100%.\n\nI'm furious and disheartened to see the Canadian government move to disband\npatriotic protesters fighting for basic human freedom and choice. Now Trudeau\ngives them the power to seize funds from crowd-funding sites and banks if…"
}