{
  "author": "bull_doze",
  "the_new_excerpt": "Albeit a week late, I want to share my 2021 portfolio for documentation purposes\nand for whoever is interested. I aimed to balance risk in this portfolio with\nsome growth names and legacy plays. Down to brass tacks, I am putting my money\nin the highest quality companies (in my view) across a diverse…",
  "original_created_utc": 1610062656,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "虽然晚了一周，但我想分享我的2021年投资组合，以供记录之用\n对任何感兴趣的人。我的目标是平衡这个投资组合中的风险\n一些成长型名字和传统剧目。归根结底，我要把我的钱\n在不同的…中(在我看来)最高质量的公司",
      "title": "我的2021年投资组合"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "雖然晚了一週，但我想分享我的2021年投資組合，以供記錄之用\n對任何感興趣的人。我的目標是平衡這個投資組合中的風險\n一些成長型名字和傳統劇目。歸根結底，我要把我的錢\n在不同的…中(在我看來)最高質量的公司",
      "title": "我的2021年投資組合"
    }
  ],
  "title": "My 2021 Portfolio",
  "created_utc": 1610085645,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Albeit a week late, I want to share my 2021 portfolio for documentation purposes and for whoever is interested. I aimed to balance risk in this portfolio with some growth names and legacy plays. Down to brass tacks, I am putting my money in the highest quality companies (in my view) across a diverse set of industries I find attractive. Some of these names are overvalued in the short term. However, I have realized I am not in the business of beating Wall Street’s pricing, but would rather hold high-quality companies that I believe will grow faster that the market in the long term. In other words, I am totally fine paying a short-term premium for growth and quality. Below is a summary of the portfolio and big picture reasoning behind each investment. I&#39;m definitely open to any feedback. </p>\n\n<table><thead>\n<tr>\n<th align=\"left\">Company</th>\n<th align=\"left\">Ticker</th>\n<th align=\"left\">Entry Price</th>\n<th align=\"left\">Exposure</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">ARK Genomic Revolution ETF</td>\n<td align=\"left\">ARKG</td>\n<td align=\"left\">$93.26</td>\n<td align=\"left\">6.60%</td>\n</tr>\n<tr>\n<td align=\"left\">CrowdStrike</td>\n<td align=\"left\">CRWD</td>\n<td align=\"left\">$211.82</td>\n<td align=\"left\">11.78%</td>\n</tr>\n<tr>\n<td align=\"left\">Disney</td>\n<td align=\"left\">DIS</td>\n<td align=\"left\">$181.18</td>\n<td align=\"left\">10.53%</td>\n</tr>\n<tr>\n<td align=\"left\">Enphase Energy</td>\n<td align=\"left\">ENPH</td>\n<td align=\"left\">$175.47</td>\n<td align=\"left\">7.98%</td>\n</tr>\n<tr>\n<td align=\"left\">Evolution Gaming Group</td>\n<td align=\"left\">EVVTY</td>\n<td align=\"left\">$101.02</td>\n<td align=\"left\">12.77%</td>\n</tr>\n<tr>\n<td align=\"left\">Facebook</td>\n<td align=\"left\">FB</td>\n<td align=\"left\">$273.16</td>\n<td align=\"left\">11.05%</td>\n</tr>\n<tr>\n<td align=\"left\">Redfin</td>\n<td align=\"left\">RDFN</td>\n<td align=\"left\">$68.63</td>\n<td align=\"left\">10.41%</td>\n</tr>\n<tr>\n<td align=\"left\">Teladoc</td>\n<td align=\"left\">TDOC</td>\n<td align=\"left\">$199.96</td>\n<td align=\"left\">9.60%</td>\n</tr>\n<tr>\n<td align=\"left\">Sea Ltd</td>\n<td align=\"left\">SE</td>\n<td align=\"left\">$199.05</td>\n<td align=\"left\">14.09%</td>\n</tr>\n<tr>\n<td align=\"left\">Waste Connections</td>\n<td align=\"left\">WCN</td>\n<td align=\"left\">$102.57</td>\n<td align=\"left\">5.19%</td>\n</tr>\n</tbody></table>\n\n<p><strong>ARK Genomic Revolution ETF (BATS: ARKG) -</strong> Invests in companies advancing genomics. The companies held in ARKG may develop, produce or enable: CRISPR, Targeted Therapeutics, Bioinformatics, Molecular Diagnostics, Stem Cells, Agricultural Biology.</p>\n\n<ul>\n<li>Innovative industry. Since 2003 the cost to sequence a human genome has dropped from nearly $3bn to less than $1,000. ARK believes that as costs continue to drop, genomic sequencing will become a standard of care in oncology. It will introduce more science into  healthcare decision making, enable personalized medicine, and accelerate drug discovery. ARK estimates that genomic sequencing revenues will grow 43% at an annual rate, from $3.5bn last year to $21bn in 2024.</li>\n<li>Cathie Wood. She’s a beast stock picker. Out of all the  ETFs she runs, her closest competitor trailed by 60%. Her worst ETF still  doubled investors&#39; money. Her strategy is to make investments into companies that she considers incredibly transformational and she has seen success doing it.</li>\n</ul>\n\n<p><strong>CrowdStrike (NASDAQ: CRWD) -</strong> Cybersecurity technology company that provides endpoint security, threat intelligence, and cyber attack response services. </p>\n\n<ul>\n<li>Best in class technology. Remember about a week ago a bunch of Russian hackers breached SolarWinds? The same hackers also tried to hack CrowdSrike at the same time but were unsuccessful. I’ve wandered on to a bunch of cybersecurity forums, and the general consensus is CrowdStrike has developed the best cybersecurity solution by miles. CRWD is the undisputed leader in cybersecurity. </li>\n<li>“Pick-and-shovel” investment into the world’s increasing digitization. Even in the absence of COVID, cybersecurity remains a key component of the world’s increasing digitization as cyberthreats have been an ongoing issue from the onset of the internet. In the last decade we have seen a bunch of hacks where companies have exposed sensitive customer information. It seems companies are just starting to realize the importance of cybersecurity.</li>\n</ul>\n\n<p><strong>Disney (NYSE: DIS) -</strong> Worldwide entertainment company that you all are probably familiar with.</p>\n\n<ul>\n<li>Reopening trade. In 2019, parks generated 45% of total operating income for DIS. Full reopening and attendance in parks will be slow, but certainly benefit DIS when it happens. The company has been executing on several other segments in the meantime (i.e. streaming). It has proved competitive, increasing the margin of safety if parks take longer to reopen.</li>\n<li>Fast-growing streaming division. DIS has proved agile as it successfully launched a streaming service, Disney+, that has already gained 86mn+ subscribers which was the company’s original 5 year target. This is promising as it shows management can adapt to rapidly changing technology trends.</li>\n</ul>\n\n<p><strong>Enphase Energy (NASDAQ: ENPH) -</strong> Designs and manufactures software-driven home energy solutions that span solar generation, home energy storage and web-based monitoring and control.</p>\n\n<ul>\n<li>Shift to clean energy; ENPH emerging as market leader. Going into 2021, sentiments towards solar have been at an all time high. This trend is expected to continue, especially after the Georgia run-off results. Solar firms are expected to benefit from extended tax incentives on both the consumer and producer ends.</li>\n<li>Technological advantage. ENPH has developed the industry leading solution and is rapidly taking market share from its primary competitor, SolarEdge. Pricing reflects this, but it&#39;s expected to continue. Among key competitors, Enphase has been one of the lowest cost producers. Its low-cost structure is a major contributing factor to its improving margins.</li>\n</ul>\n\n<p><strong>Evolution Gaming Group (OTC: EVVTY) -</strong> Swedish company that develops, produces, markets and licenses integrated B2B live casino solutions for gaming operators. </p>\n\n<ul>\n<li>Early mover advantage. Evolution’s lack of competition enables it to rapidly grow in new markets and create a loyal customer base, with high switching costs. The company has effectively grown EBITA margins from 41.6% in 1Q18 to 64.8% in 3Q20. Margin expansion is expected to continue.</li>\n<li>Massive untapped markets. Europe is estimated to be around $2.5bn (EVVTY has 50% market share), Asian market is ~15x the size of Europe (150% YoY growth for EVVTY in Asia). North America’s market is ~$210mn, a 42% increase YoY, with NJ and PA the only states currently operating (NY looks promising). Management thinks the US will be the largest in the long-term. </li>\n<li>Undetected from Wall Street. Evolution has almost no analyst coverage in the US and very minimal coverage in Europe, presenting opportunity for additional growth as institutional money managers recognize this opportunity and draw attention to the stock. Additionally, Evolution has a founder-led management team that is highly aligned with shareholders (mgmt owns over 30% of the stock).</li>\n</ul>\n\n<p><strong>Facebook (NASDAQ: FB) -</strong> Enables people to connect through devices. It’s products include Facebook, Instagram, Messenger, WhatsApp and Oculus. </p>\n\n<ul>\n<li>Zuck. It’s not a question of who is the next Jobs/Bezos/Gates/Zuck, because Zuck is super young. He has a history of being able to execute: IG acquisition / transition from desktop to mobile /  denying multiple acquisition opportunities in his twenties. </li>\n<li>Undervalued. FB is the cheapest among the FAANG stocks, yet has some of the highest growth rates. This is mainly because of its continuous political scandals. With Trump out of office, I think FB has a chance to stay out of trouble and start to realize higher multiples.  The antitrust lawsuit is not a threat imo, it is actually an opportunity. If the govt forces FB to break up, we would get shares in the spin-offs, which would be valued at a higher multiple than FB. For example, if Instagram spun off from FB and traded at the same multiple as SNAP, Instagram’s market cap would be larger than FB’s.</li>\n</ul>\n\n<p><strong>Redfin Corporation (NASDAQ: RDFN) -</strong> Provides residential real estate brokerage services. </p>\n\n<ul>\n<li>Digitization of Real Estate (i.e. “iBuying”). Technology in RE is moving from being informational to transactional. Redfin’s iBuying service is dubbed “RedfinNow.” The service basically buys homes from sellers looking for a quick and convenient sale (close deals within 10-30 days). This segment isn’t profitable yet as it is just getting started, but promising as the management adapts to technology trends.</li>\n<li>Inter-US Migration and housing outlook. People are moving out of the cities because of COVID / trying to avoid taxes / etc. which increases demand for Redfin’s services. With interest rates extremely low (and no expectation for them to increase), homebuying demand should continue to grow.</li>\n<li>RDFN most attractively valued compared to Z and OPEN, with the most upside potential given its market cap ~$7bn. Some are predicting RDFN might start offering rental services as well. RDFN has the best LT margin potential. </li>\n</ul>\n\n<p><strong>Teladoc Health (NYSE: TDOC) -</strong> Provides virtual healthcare services on a B2B basis to its clients and provides services to consumers directly and through channel partners.</p>\n\n<ul>\n<li>Competitive positioning in industry ripe for disruption. Healthcare is a huge market yet to be significantly disrupted. COVID has accelerated this disruption. Providers who were once opposed to telemedicine now realize its benefits and several regulatory changes are promising for telemedicines growth potential. Medicare and other government-sponsored coverage is expected to include telemedicine benefits, increasing TDOC’s TAM.</li>\n<li>Livongo acquisition. From the consumer POV, this will increase access to healthcare at a lower cost. Teladoc will have access to a larger amount of data it can interpret to refine its services and monetization strategies. </li>\n</ul>\n\n<p><strong>Sea Ltd (NYSE: SE) -</strong> Digital entertainment, electronic commerce, and digital financial services. The Company operates three business segments: Garena, Shopee, and SeaMonkey. The Company’s digital entertainment business, Garena, is a global game developer and publisher with a presence in Southeast Asia, Taiwan, and Latin America. Garena provides access to mobile and personal computer online games. Shopee provides users with a shopping environment that is supported by integrated payment, logistics, fulfillment, and other value-added services. SeaMonkey business is a digital financial services provider. SeaMonkey offers e-wallet services, payment processing, credit related digital financial offerings, and other financial products. </p>\n\n<ul>\n<li>Diversified consumer internet company with market-leading position. Sea caters to Southeast Asia and Taiwan, providing its online gaming, e-commerce, and payment platforms. Shopee has overtaken competitors, it is widening its market share lead. ESports is a rapidly growing market (15.7% YoY to $1.1bn in 2020) and Sea is outpacing market growth.</li>\n<li>Pay for quality. The best companies keep going up for years in a row, and I think Sea is in the early stages of being classified as such a company. It’s worth $100bn but has effectively proved its ability to identify opportunities and expand business lines. </li>\n<li>Still early stages of developing its consumer banking business, so we get the security of a bigger, established company with upside for an additional, lucrative business line such as fintech.</li>\n</ul>\n\n<p><strong>Waste Connections Inc. (NYSE: WCN) -</strong> Waste services company that provides non-hazardous waste collection, transfer, disposal and recycling services. </p>\n\n<ul>\n<li>Recession resilient; re-opening trade. The waste management industry is recession resilient, it will always be around. </li>\n<li>Non-hazardous waste collection. With a progressive government likely to push climate initiatives, recycling and non-hazardous waste collection are likely to benefit on the back end.</li>\n<li>WCN has a large moat; there isn’t much of a competitive threat the way the industry operates. Management’s strategy is to generally only spend what FCF is available. This enables the company to make acquisitions while handling its debt load. Great for stable growth.</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p>P.S. I have two other accounts - one with about 40 growth stocks and another with about 10 big names / ETFs. However, this portfolio has the largest allocation for 2021. My first time trying a more concentrated approach.</p>\n</div><!-- SC_ON -->",
  "score": 164,
  "permalink": "/r/investing/comments/kspxe3/my_2021_portfolio/",
  "subreddit": "investing",
  "id": "kspxe3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706378026
}