{
  "author": "0toHeroInvesting",
  "the_new_excerpt": "Are stocks going to benefit from the Santa Claus effect this year? What’s the\nlatest news in the stock market? This week earnings reports & more\n\n~Very Long Post~\n\nHello everyone and Good Morning! So, let’s start with the recap of Friday, as we\nsaw the DOW [https://ibb.co/XF2RH8q] finish in the…",
  "original_created_utc": 1607949601,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "今年股市会从圣诞老人效应中受益吗？这是什么？\n股市的最新消息是什么？本周收益报告及更多内容\n\n~很长的帖子~\n\n大家好，早上好！那么，让我们从周五的回顾开始，因为我们\n看到道琼斯指数[https://ibb.co/XF2RH8q]Finish in The…",
      "title": "股市消息|接下来是圣诞老人股票效应吗？本周股票收益报告[12-14]"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今年股市會從聖誕老人效應中受益嗎？這是什麼？\n股市的最新消息是什麼？本週收益報告及更多內容\n\n~很長的帖子~\n\n大家好，早上好！那麼，讓我們從週五的回顧開始，因爲我們\n看到道瓊斯指數[https://ibb.co/XF2RH8q]Finish in The…",
      "title": "股市消息|接下來是聖誕老人股票效應嗎？本週股票收益報告[12-14]"
    }
  ],
  "title": "Stock market news | Santa Claus stock effect up next? This Week Stock Earnings Reports [12-14]",
  "created_utc": 1608010317,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Are stocks going to benefit from the Santa Claus effect this year? What’s the latest news in the stock market? This week earnings reports &amp; more</strong></p>\n\n<p><strong>~Very Long Post~</strong></p>\n\n<p>Hello everyone and Good Morning! So, let’s start with the recap of Friday, as we saw the <a href=\"https://ibb.co/XF2RH8q\">DOW</a> finish in the green up .16% but closed the week down 0.57%, while both the <a href=\"https://ibb.co/CBm2qZQ\">SP500</a> which lost .13% on Friday and .96% for the week and the <a href=\"https://ibb.co/RbY68rn\">NADSAQ COMPOSITE</a> also down .23% on Friday and 0.69% for the week struggled to recover after a very bad start to the trading day. We also saw the <a href=\"https://ibb.co/C68dbNJ\">VIX</a> finishing the week at a new high, over the 23 levels, as the volatility index has seen a spike of over 12% in the last <a href=\"https://ibb.co/0F78Vtm\">week</a>.</p>\n\n<p>You can see that a big majority of the companies were on the decline on <a href=\"https://ibb.co/NCBm6Bg\">Friday</a>, with low volumes, as only around 10B shares traded hands compared to 11.5B shares in the last 20 trading days, as some profit-taking combined with some healthy corrections in stocks have moved the markets slightly lower.</p>\n\n<p>On a factor <a href=\"https://ibb.co/k1HTXfs\">basis</a>, value plays suffered on Friday, especially small and mid-caps, while growth was pretty flat, with only Energy and Financials lost more than 1% on Friday, as Energy was the only <a href=\"https://ibb.co/ynW3BzJ\">sector</a> to finish in the green this week, up 1,21%, while Real Estate lost almost 3% and Financials also lost almost 2% in the past week.</p>\n\n<p>Here is the <a href=\"https://ibb.co/cNCSPHk\">HEAT MAP</a> from Friday, not a lot of green to be seen, with the exception of Microsoft, Disney and Toyota.</p>\n\n<p>While for the week, pretty much the same can be seen in the <a href=\"https://ibb.co/rfcfdL6\">HEAT MAP</a>, as Disney, AT&amp;T, Elly Lilly and Toyota were the only big gainers.</p>\n\n<p><a href=\"https://ibb.co/fXLgKLc\">Here</a> is the most interesting economic data coming out this week with Wednesday and Thursday being the biggest ones, as we get a better read on what the economy is doing, while also getting the Federal Reserve latest and last decisions for this year.</p>\n\n<p><a href=\"https://ibb.co/M9GFCFf\">Today</a> we get the electoral college across state capitols formally casting their votes, while On Thursday we also get the Moderna vaccine FDA Ad Com voting process and results.</p>\n\n<p>The Fed doesn’t really have many <a href=\"https://ibb.co/p44t6C0\">options</a> at the moment, but they can still move to buy longer-term bonds or decide to buy even more than the current monthly allocated program. The Fed is not expected to cut the benchmark rates anymore, as they are already near 0.</p>\n\n<p>So, I think we might start to see some of the Santa Claus <a href=\"https://ibb.co/1KF6gJC\">effect</a> starting very soon, probably sometime between this week and the middle of next week, as you can see in this chart, the SP500 has posted very good returns in the past 70years on average in this period, but yeah, who knows after what has happened this year.</p>\n\n<p>Also, you can see in this <a href=\"https://ibb.co/2YMgNSK\">chart</a>, that the big tech stocks have underperformed the market since the start of September, as small caps have outperformed, I think we might finally see some of the big tech names start to gain some momentum once again, especially Apple &amp; Amazon.</p>\n\n<p>I think this might happen as more of the big cash flows that are sitting on the <a href=\"https://ibb.co/8dpv9gd\">sidelines</a>, might finally start to be move to the stock market.</p>\n\n<p>While on Friday we saw the consumer <a href=\"https://ibb.co/Vpc4Hfs\">sentiment</a> jumping more than expected, but is still way <a href=\"https://ibb.co/5FTD721\">down</a> from a year ago. We also got the producer price <a href=\"https://ibb.co/jDTTkgb\">index</a> for November which rose by .1% and is up .8% year over year, more than expected.</p>\n\n<p><a href=\"https://ibb.co/hLkWLYz\">Here</a> are the most interesting earnings report for next week, I am especially interested to see what Jabil, FedEx, Nike (Friday) and Blackberry report.</p>\n\n<p>I think we can see great number from Jabil which will benefit from the iPhone 12 sales, while FedEx, the largest parcel delivery service in the world is on watch, as they are considered a proxy for the global economy. With Nike also expected to report strong numbers with an increasing number of physical stores re-opening and a strong boom in direct-to-consumer business.</p>\n\n<p>Guys, <a href=\"https://ibb.co/xfB6Qxz\">Disney</a> saw a huge pop in the stock after a great investor day, but i won&#39;t go into more details as i have previously posted about them.</p>\n\n<p>I also wanted to mention this, but I guess you already know this by now, the <a href=\"https://ibb.co/8rPL1q2\">FDA</a> gave the green light very late on Friday while the <a href=\"https://ibb.co/kMkxfFf\">CDC</a> also formally signed off in the weekend.</p>\n\n<p>The first deliveries of vaccines are expected to reach more than 150 state locations <a href=\"https://ibb.co/D9XjNyR\">today</a> with another 450 locations in the next couple of days as the vaccine began to be packaged and shipped on <a href=\"https://ibb.co/84mzTwG\">Sunday</a> morning. So yeah, I guess we can keep the tradition of Vaccine Monday going. If both the Pfizer and Moderna vaccines will be available, with the US just exercising the <a href=\"https://ibb.co/QkCFhW6\">option</a> to buy another 100M doses from Moderna, the US is aiming to vaccinate 20M this month, 30M in January and another 50M in February, that would bring the total to over 100M people.</p>\n\n<p><a href=\"https://ibb.co/n6wJKvx\">Walmart</a> has started to mobilize to help with the distribution, while <a href=\"https://ibb.co/qkWYTJx\">CVS</a> also has plans to begin vaccinations starting next Monday.</p>\n\n<p>Guys, just wanted to mention that I came across this <a href=\"https://ibb.co/K5fsgxN\">tweet</a>, I think it pretty much sums up the latest IPO frenzy that we had with <a href=\"https://ibb.co/Rzq7g9F\">Doordash</a> and AirBnB, with both in my opinion starting trading at insane valuations, that aren’t really justifiable.</p>\n\n<p>The big IPOs this week, had a big influence on the markets, as investors probably had to sell a lot of stuff to buy into DASH &amp; AirBNB, this might have led to an imbalance in the markets. As people who used market orders were forced to sell stuff to fund the buying of these 2 highly overvalued stocks in my opinion.</p>\n\n<p>Just look at this <a href=\"https://ibb.co/9VpnfS7\">chart</a>, as the average first-day return for IPOs has seen a huge spike in the last year, with an average of 37% first day return this year. But, just look at the % of <a href=\"https://ibb.co/V339X8N\">IPOs</a> with negative earnings also increasing since 2010, that just doesn’t seem to bother investors, as they are looking for fast growing companies that don’t emphasize earnings.</p>\n\n<p>Just a fact, <a href=\"https://ibb.co/S3QFQ64\">AirBNB</a> became only the 3rd tech company to open with a market cap over $100B, the only others ones being Alibaba and Facebook.</p>\n\n<p>After this 2 crazy IPOs some of the next <a href=\"https://ibb.co/J5BRZ8f\">companies</a> that planned to start trading last week, Affirm and Roblox, delayed the plans, as this companies seek to determine the right price for the shares and the right company valuation with advisors, so they don’t leave money on the table like AirBnB and Doordash have done last week.</p>\n\n<p>My opinion is that if you don’t like these high-flying IPOs, don’t short them, just avoid them and buy stocks that you really like and expect to have great growth</p>\n\n<p>We also saw a <a href=\"https://ibb.co/86vpGyP\">report</a> from The Information, which is not actually doing any reporting of any specific deals, that presented their next logical M&amp;A deals, this led to the <a href=\"https://ibb.co/D1VGXwj\">stock</a> of Dropbox to spike almost 14% including after-hours trading and <a href=\"https://ibb.co/mHPQw0L\">MongoDB</a> to gain more than 6% on Friday.</p>\n\n<p>Other <a href=\"https://ibb.co/5GJBH1w\">news</a> came for videogames and video gaming consoles which saw a record $7B in sales, over 35% more than last year, bringing the total to over $44B for the year, with more than $1.4B spent on news consoles from Sony and Microsoft just in November.</p>\n\n<p>While in the EU, <a href=\"https://ibb.co/YPQRhqv\">Brexit</a> talks keep getting extended time and time again as the EU and Great Britain still are trying to figure out some sort of a deal.</p>\n\n<p>We also found out what companies are getting <a href=\"https://ibb.co/4Y74VFQ\">kicked</a> out of the SP due to the inclusion of Tesla and that the latest <a href=\"https://ibb.co/C5116dp\">shutdowns</a> for the holidays have been extended more than usual.</p>\n\n<p>Let’s hope for a great day in the market as the <a href=\"https://ibb.co/Zzf0FVN\">FUTURES</a> seem to be pointing at a good open, hopefully some green action continues after that.</p>\n\n<p>Thank you everyone for reading! Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market!</p>\n\n<p>Have a great day and see you next time!</p>\n</div><!-- SC_ON -->",
  "score": 495,
  "permalink": "/r/stocks/comments/kcwwq9/stock_market_news_santa_claus_stock_effect_up/",
  "subreddit": "stocks",
  "id": "kcwwq9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609260493108
}