{
  "author": "sadepagy",
  "the_new_excerpt": "I wake up at 5am and work my 7am-3pm shift, when I get home, I don't feel like\ndoing anything other than watch series, play video games, scroll on my phone...\n\nIt makes me feel like shit because I like to read, paint, go for walks, do yoga,\nrun, hike, go to the gym (pre-covid), but I can't seem to…",
  "original_created_utc": 1619558474,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "朝5時に起きて、7時から3時まで仕事をして、家に帰っても何もする気が起きないんです。\nシリーズ物を見たり、ゲームをしたり、携帯電話を操作したりする以外に何もする気が起きません...。\n\n本を読んだり、絵を描いたり、散歩したり、ヨガをしたりするのが好きなので、とても嫌な気分になります。\n本を読んだり、絵を描いたり、散歩をしたり、ヨガをしたり、走ったり、ハイキングをしたり、ジムに行ったりするのが好きなのに、それができないんです。",
      "title": "仕事から帰ってきて、疲れて何もできないのは普通のことなのか、それとも私が怠け者なのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我早上5点起床，7点到3点上班，当我回到家时，我不想\n除了看电视剧、玩视频游戏、玩手机之外，我什么都不想做......。\n\n这让我感觉很糟糕，因为我喜欢阅读、绘画、散步、做瑜伽。\n跑步、远足、去健身房(在服药前)，但我似乎不能...",
      "title": "下班回家后太累了，什么都不想做，这正常吗，还是说我懒得要死？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我早上5點起牀，7點到3點上班，當我回到家時，我不想\n除了看電視劇、玩視頻遊戲、玩手機之外，我什麼都不想做......。\n\n這讓我感覺很糟糕，因爲我喜歡閱讀、繪畫、散步、做瑜伽。\n跑步、遠足、去健身房(在服藥前)，但我似乎不能...",
      "title": "下班回家後太累了，什麼都不想做，這正常嗎，還是說我懶得要死？"
    }
  ],
  "title": "Is it normal to be too tired to do anything after getting home from work or am I lazy as fuck?",
  "created_utc": 1619582406,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I wake up at 5am and work my 7am-3pm shift, when I get home, I don&#39;t feel like doing anything other than watch series, play video games, scroll on my phone...</p>\n\n<p>It makes me feel like shit because I like to read, paint, go for walks, do yoga, run, hike, go to the gym (pre-covid), but I can&#39;t seem to find the energy/motivation to do those things.</p>\n\n<p>Am I being lazy? Are the internet/video games/series taking over my life? Do other people find the time and energy for their hobbies after work? Am I overthinking this?</p>\n\n<p>I feel like I could be getting more out of my life outside of work</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/NoStupidQuestions/comments/mzyydl/is_it_normal_to_be_too_tired_to_do_anything_after/",
  "subreddit": "NoStupidQuestions",
  "id": "mzyydl",
  "is_self": true,
  "media": null,
  "is_video": false
}