{
  "author": "Allusernamestaken73",
  "original_created_utc": 1625776234,
  "title": "I'm nervous but screw it.....",
  "created_utc": 1625837436,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello everyone. I am new to crypto. It all started a couple of months ago when I decided to buy a small amount of bitcoin. Since then every extra penny I get goes into buying more crypto. I dont know hardly anything but I&#39;m learning. I read and watch all the crypto content I can find. I&#39;ve been lurking on this sub for awhile. Just wanted to say thanks to everyone on here for their posts and helping me gain knowledge on what the hell I&#39;m doing. I have a long road to go but you all are helping me get there. Much appreciated!</p>\n</div><!-- SC_ON -->",
  "score": 164,
  "permalink": "/r/CryptoCurrency/comments/ogfr71/im_nervous_but_screw_it/",
  "subreddit": "CryptoCurrency",
  "id": "ogfr71",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hello everyone. I am new to crypto. It all started a couple of months ago when I\ndecided to buy a small amount of bitcoin. Since then every extra penny I get\ngoes into buying more crypto. I dont know hardly anything but I'm learning. I\nread and watch all the crypto content I can find. I've been…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。私はcryptoの初心者です。すべての始まりは、数ヶ月前に私が\n少額のビットコインを買おうと思ったのが始まりです。それ以来、余分なペニーを得るたびに\nもっと暗号を買うようになりました。ほとんど何も知りませんが、勉強中です。I\n見つけることができるすべての暗号コンテンツを読んだり見たりしています。私は今まで...",
      "title": "緊張していますが、大丈夫です。....."
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。我是加密货币的新手。这一切始于几个月前，当时我\n决定购买少量的比特币。从那时起，我得到的每一个额外的一分钱\n都会用于购买更多的加密货币。我几乎什么都不知道，但我正在学习。I\n阅读和观看所有我能找到的加密货币内容。我一直在...",
      "title": "我很紧张，但去它的....."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。我是加密貨幣的新手。這一切始於幾個月前，當時我\n決定購買少量的比特幣。從那時起，我得到的每一個額外的一分錢\n都會用於購買更多的加密貨幣。我幾乎什麼都不知道，但我正在學習。I\n閱讀和觀看所有我能找到的加密貨幣內容。我一直在...",
      "title": "我很緊張，但去它的....."
    }
  ]
}