{
  "author": "dusyahere",
  "original_created_utc": 1642168122,
  "title": "Having children is a choice, so why do so many parents expect... accommodation, assistance, \"understanding\", etc?",
  "created_utc": 1642178165,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m finding a lot of people who make choices to have children then complain that they don&amp;#39;t have sufficient support, funding, understanding neighbors, accommodating strangers, etc.  But you made a choice to have kids, why does the rest of society need to get involved?&lt;/p&gt;\n\n&lt;p&gt;Edit:. This is my 1st post and I did a bad job!  I&amp;#39;m Canadian, I believe in mandatory mat leave, social services, sick and Vacation pay, government support, etc.  These are rights beyond debate.  &lt;/p&gt;\n\n&lt;p&gt;I was talking about silly annoying things like coworkers leaving early a few times a week, neighbors barricading my street so kids can play, people feeling they shouldn&amp;#39;t have to chip in because they live on a &amp;quot;tighter&amp;quot; budget, cutting in line in the grocery store, etc.  Daily annoying things that show entitlement.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 250,
  "permalink": "/r/TooAfraidToAsk/comments/s3ssnu/having_children_is_a_choice_so_why_do_so_many/",
  "subreddit": "TooAfraidToAsk",
  "id": "s3ssnu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm finding a lot of people who make choices to have children then complain that\nthey don't have sufficient support, funding, understanding neighbors,\naccommodating strangers, etc. But you made a choice to have kids, why does the\nrest of society need to get involved?\n\nEdit:. This is my 1st post and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、子供を持つことを選択した人の多くが、次のような不満を抱いていると感じています。\n十分な支援、資金、隣人の理解などが得られない。\n赤の他人への対応など しかし、子供を持つことを選択したのはあなたです。\n社会が関与する必要があるのか？\n\n編集：。これは私の1回目の投稿と...",
      "title": "子供を持つことは選択であるのに、なぜ多くの親が、調整、援助、「理解」などを期待するのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我发现很多人选择了生孩子，然后抱怨说\n他们没有得到足够的支持、资金、理解的邻居。\n容纳陌生人，等等。但是你选择了生孩子，为什么社会上的其他人需要参与进来？\n社会的其他部分需要参与进来？\n\n编辑：。这是我的第1个帖子，而且...",
      "title": "生孩子是一种选择，那么为什么这么多父母期望......迁就、协助、\"理解 \"等等？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我發現很多人選擇了生孩子，然後抱怨說\n他們沒有得到足夠的支持、資金、理解的鄰居。\n容納陌生人，等等。但是你選擇了生孩子，爲什麼社會上的其他人需要參與進來？\n社會的其他部分需要參與進來？\n\n編輯：。這是我的第1個帖子，而且...",
      "title": "生孩子是一種選擇，那麼爲什麼這麼多父母期望......遷就、協助、\"理解 \"等等？"
    }
  ]
}