{
  "author": "RonPaulWasR1ght",
  "original_created_utc": 1641665340,
  "title": "How will strippers be tipped, in a hyperbitcoinized world?",
  "created_utc": 1641681313,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Serious question!  One of the enjoyable features of physical cash, is that you can gently place it in the stripper&amp;#39;s thong, to tip her.  The stripper enjoys it (or at least acts like she does), and you get to feel benevolent and loving.  It&amp;#39;s just, a great feature.  But, it&amp;#39;s a whole lot less sexy, to ask her for a wallet address while she&amp;#39;s pole dancing, you know?  &lt;/p&gt;\n\n&lt;p&gt;How will that industry be affected by the adoption of Bitcoin?  How will we tip strippers???&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 305,
  "permalink": "/r/Bitcoin/comments/rz5xom/how_will_strippers_be_tipped_in_a/",
  "subreddit": "Bitcoin",
  "id": "rz5xom",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Serious question! One of the enjoyable features of physical cash, is that you\ncan gently place it in the stripper's thong, to tip her. The stripper enjoys it\n(or at least acts like she does), and you get to feel benevolent and loving.\nIt's just, a great feature. But, it's a whole lot less sexy, to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "真剣に質問します! 現物の現金の楽しみのひとつは\nストリッパーのTバックの中にそっと入れて、チップを渡すことができます。ストリッパーはそれを楽しみ\n(少なくともそのように振舞っている）、そしてあなたは慈悲深く、愛に満ちた気持ちになることができます。\nまさに、素晴らしい機能です。でも、セクシーさには欠けるね...。",
      "title": "ハイパービットコイン化した世界では、ストリッパーはどのようにチップを渡すのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "严肃的问题! 实物现金的一个令人愉快的特点是，你\n可以轻轻地把它放在脱衣舞女的丁字裤里，给她小费。脱衣舞娘很享受这种感觉\n(或至少表现得像她一样），而你可以感受到仁慈和爱。\n这只是，一个伟大的功能。但是，这就不那么性感了，对...",
      "title": "在一个超比特币化的世界里，脱衣舞娘将如何获得小费？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嚴肅的問題! 實物現金的一個令人愉快的特點是，你\n可以輕輕地把它放在脫衣舞女的丁字褲裏，給她小費。脫衣舞娘很享受這種感覺\n(或至少表現得像她一樣），而你可以感受到仁慈和愛。\n這只是，一個偉大的功能。但是，這就不那麼性感了，對...",
      "title": "在一個超比特幣化的世界裏，脫衣舞娘將如何獲得小費？"
    }
  ]
}