{
  "author": "Kochevnik81",
  "original_created_utc": 1624974559,
  "title": "It's 1066 and I'm somewhere in northwestern Europe. What would I think when I look up and see Haley's Comet? What would I know of what educated thinkers have to say about it?",
  "created_utc": 1625058357,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For a little further background, what I&#39;m really asking here is how linked in to the &quot;science news&quot; of the day could I be? Would it just be some heavenly sign with no context, or would I be more like &quot;ah yes the priest said the bishop said he got a letter from Rome saying we are seeing something last seen 75 years ago&quot;? Or would my understanding be completely linked to education or class regardless of location?</p>\n\n<p>I&#39;m mostly curious how much of an elite or localized phenomenon more cutting edge ideas were in Europe at the time. It&#39;s a bit anachronistic to call it science or even &quot;natural philosophy&quot;...but that&#39;s more or less what I&#39;m getting at.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/oa8nqu/its_1066_and_im_somewhere_in_northwestern_europe/",
  "subreddit": "AskHistorians",
  "id": "oa8nqu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "For a little further background, what I'm really asking here is how linked in to\nthe \"science news\" of the day could I be? Would it just be some heavenly sign\nwith no context, or would I be more like \"ah yes the priest said the bishop said\nhe got a letter from Rome saying we are seeing something…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "少し背景を説明すると、私が実際に尋ねているのは、その日の「科学ニュース」にどれだけリンクできるかということです。\nその日の「科学ニュース」にどれだけリンクしているのか？何の脈絡もない、ただの天のお告げなのか\n脈絡のない天のお告げなのか、それとも「ああ、そうだ、司祭が言っていた、司教が言っていた、手紙をもらった」のようなものなのか。\n司教が言ってたよ、ローマから手紙が来て、何かが見えるってさ...。",
      "title": "時は1066年、私はヨーロッパ北西部のどこかにいる。上を見上げるとヘイリー彗星が見えたとき、私は何を思うだろうか。教育を受けた思想家たちがそれについて何と言っているか、私は何を知っているだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "为了进一步了解背景，我在这里真正想问的是如何与\n我与当天的 \"科学新闻 \"能有多大关联？它是否只是一些天上的标志\n还是说我更像是 \"啊，是的，牧师说，主教说\n他收到了一封来自罗马的信，说我们看到了一些东西......",
      "title": "现在是1066年，我在欧洲西北部的某个地方。当我抬头看到哈利彗星的时候，我会怎么想？我怎么会知道受过教育的思想家对它的看法呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "爲了進一步瞭解背景，我在這裏真正想問的是如何與\n我與當天的 \"科學新聞 \"能有多大關聯？它是否只是一些天上的標誌\n還是說我更像是 \"啊，是的，牧師說，主教說\n他收到了一封來自羅馬的信，說我們看到了一些東西......",
      "title": "現在是1066年，我在歐洲西北部的某個地方。當我擡頭看到哈利彗星的時候，我會怎麼想？我怎麼會知道受過教育的思想家對它的看法呢？"
    }
  ]
}