{
  "author": "7Men-In-A-Bucket",
  "original_created_utc": 1657462394,
  "title": "How do women shave so fast in the shower?",
  "created_utc": 1657495365,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not intending this as an NSFW question so please don&amp;#39;t DM me sexual enquires.&lt;br/&gt;\nBut I am genuinely curious because I tried to shave my legs entirely, cooch and whatnot today and it took ages, I don&amp;#39;t understand why it takes all my female friends a much shorter amount of time to shower AND shave.  &lt;/p&gt;\n\n&lt;p&gt;I feel like I&amp;#39;m somehow doing it wrong but I shave against the grain and I lather up with soap or something first, am I missing something??  &lt;/p&gt;\n\n&lt;p&gt;I just want to conserve time and water.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/NoStupidQuestions/comments/vvsceb/how_do_women_shave_so_fast_in_the_shower/",
  "subreddit": "NoStupidQuestions",
  "id": "vvsceb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm not intending this as an NSFW question so please don't DM me sexual\nenquires.\nBut I am genuinely curious because I tried to shave my legs entirely, cooch and\nwhatnot today and it took ages, I don't understand why it takes all my female\nfriends a much shorter amount of time to shower AND…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "NSFWの質問として意図しているわけではないので、性的なDMはご遠慮ください\nを送らないでください。\nしかし、私は純粋に好奇心が強いです。\nを剃ろうとしたんだけど、すごく時間がかかったんだ。\nをするのに時間がかかるのが理解できないのです...。",
      "title": "女性はどうしてシャワーでそんなに早く剃れるのですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我并不打算把这个问题作为一个NSFW问题，所以请不要给我发DM。\n询。\n但我真的很好奇，因为我今天想把腿上的毛全部剃光，还有阴毛什么的。\n我不明白为什么我所有的女性朋友都要花很短的时间才能完成。\n我不明白为什么我的女性朋友洗澡的时间要短得多，而且......",
      "title": "女人在洗澡时怎么会刮得这么快？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我並不打算把這個問題作爲一個NSFW問題，所以請不要給我發DM。\n詢。\n但我真的很好奇，因爲我今天想把腿上的毛全部剃光，還有陰毛什麼的。\n我不明白爲什麼我所有的女性朋友都要花很短的時間才能完成。\n我不明白爲什麼我的女性朋友洗澡的時間要短得多，而且......",
      "title": "女人在洗澡時怎麼會颳得這麼快？"
    }
  ]
}