{
  "author": "tanmay1010",
  "original_created_utc": 1639077191,
  "title": "1.26% of all circulating bitcoin is held by 85% of the total addresses while 63% Bitcoin is held by a mere 0.04% of the total wallet addresses.",
  "created_utc": 1639099979,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This latest buy from MicroStrategy (Michael Saylor&amp;#39;s Company) of Bitcoin has made this inequality very apparent to me- the big becomes bigger and the small becomes smaller. (proportionately speaking) &lt;/p&gt;\n\n&lt;p&gt;The most shocking figure for me was that the majority of people- close to 85% of the total wallet address who holds BTC- holds less than 1BTC in their account while only 0.04% of the total wallet addresses holds more than 100 BTC each accounting to the collective ownership of close to 63% circulating bitcoin. &lt;/p&gt;\n\n&lt;p&gt;I always thought that Bitcoin was a means to erase this rampant and corrupt inequality, alas, as reference to the real world- the rich will grow richer and richer by each passing day. The freedom to invest a huge sum and let that sum grow is a luxury not all of us can have.&lt;/p&gt;\n\n&lt;p&gt;Edit 1- I love Bitcoin, i love the technology, what i don&amp;#39;t love is this inequality in the ownership.&lt;/p&gt;\n\n&lt;p&gt;Edit 2- Central exchanges holding Bitcoin: Can we approximate the number of Bitcoin held by central exchange and then assume that a large chunk of it is held by small retail players because players with significant numbers of Bitcoin would migrate to their personal wallet. &lt;/p&gt;\n\n&lt;p&gt;Maximum amount held by exchange should not be more than 10-12% (according to a dated article published this year) so if we reduce that from the current number 63%, 50% is still held by 0.04% and that still is a significant amount? Does this argument hold?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 214,
  "permalink": "/r/CryptoCurrency/comments/rcosnl/126_of_all_circulating_bitcoin_is_held_by_85_of/",
  "subreddit": "CryptoCurrency",
  "id": "rcosnl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This latest buy from MicroStrategy (Michael Saylor's Company) of Bitcoin has\nmade this inequality very apparent to me- the big becomes bigger and the small\nbecomes smaller. (proportionately speaking)\n\nThe most shocking figure for me was that the majority of people- close to 85% of\nthe total wallet…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今回のマイクロストラテジー（マイケル・セイラー社）によるビットコインの買収は\n大は小を兼ね、小は大を兼ねる、この不公平感を実感しました。\n小さくなる。(割合的に)\n\n私にとって最も衝撃的だったのは、大多数の人、つまり85%近くが\nウォレットの総数...",
      "title": "流通している全ビットコインの1.26%が総アドレス数の85%で保有されているのに対し、63%のビットコインは総ウォレットアドレス数のわずか0.04%で保有されています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "微策略公司(Michael Saylor的公司)最近对比特币的收购让我看到了这种不平等。\n使得这种不平等在我看来非常明显--大的变大，小的变小\n变得更小。(从比例上讲)\n\n最让我震惊的数字是，大多数人--接近85%的\n总的钱包...",
      "title": "1.26%的流通比特币由85%的总地址持有，而63%的比特币仅由0.04%的总钱包地址持有。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "微策略公司(Michael Saylor的公司)最近對比特幣的收購讓我看到了這種不平等。\n使得這種不平等在我看來非常明顯--大的變大，小的變小\n變得更小。(從比例上講)\n\n最讓我震驚的數字是，大多數人--接近85%的\n總的錢包...",
      "title": "1.26%的流通比特幣由85%的總地址持有，而63%的比特幣僅由0.04%的總錢包地址持有。"
    }
  ]
}