{
  "author": "DownvoteMePlzzzzzzzz",
  "original_created_utc": 1628215098,
  "title": "At 20 years old is it normal to have grown apart from literally all of your old friends and acquaintances from elementary, middle, and high school?",
  "created_utc": 1628224485,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>TL;DR I unfriended everyone across all my social medias who hasn&#39;t replied to me in 6 months or more, and no one was left, just zero...it&#39;s not like I didn&#39;t try to reach out either, they just left me on read all the time, and showed no interest in continuing to be my friend. </p>\n\n<p>To be fair, I was never SUPER close to those people. </p>\n\n<p>Sometimes I&#39;d overestimate a bit how close me and a person actually were because I wasn&#39;t super popular and didn&#39;t have that many friends, but when I thought about it me and the person didn&#39;t have shit in common, they rarely replied to my texts if ever, and we almost never hung out outside of school besides once or twice. </p>\n\n<p>But social media had been stressing me out as of late...so I decided to gradually start unfriending people who haven&#39;t replied to me in 6 months or more. I began doing this as soon as I turned 18 and decided I wanted to turn my life around. </p>\n\n<p>And eventually...across Instagram, Facebook, Snapchat, Twitter, Discord, etc, literally NOBODY was left...</p>\n\n<p>It&#39;s not like I didn&#39;t try to reach out to those people several times either. They just left me on read every time, or left a one word response that left no room for actual conversation. </p>\n\n<p>Overall, it kind of sucks to know that all my &quot;friends&quot; till today were never that close to me, and that I wasn&#39;t close to them...but since graduating high school I haven&#39;t seen any of those people ONCE anyway. Not even through text, since they all just left me on read.</p>\n</div><!-- SC_ON -->",
  "score": 145,
  "permalink": "/r/NoStupidQuestions/comments/oyx3mz/at_20_years_old_is_it_normal_to_have_grown_apart/",
  "subreddit": "NoStupidQuestions",
  "id": "oyx3mz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "TL;DR I unfriended everyone across all my social medias who hasn't replied to me\nin 6 months or more, and no one was left, just zero...it's not like I didn't try\nto reach out either, they just left me on read all the time, and showed no\ninterest in continuing to be my friend.\n\nTo be fair, I was…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "TL;DR 私は、半年以上返事をくれなかったすべてのソーシャル・メディアの人を友達解除しました。\n半年以上返信のない人は誰もいなくなってしまいました。\n私も連絡を取ろうとしなかったわけではありませんが、彼らはいつも私を既読のままにして、私の友人であり続けることに興味を示さなかったのです。\n友達になる気もない。\n\n確かに、私は...",
      "title": "20歳になると、小・中・高の旧友や知人と文字通り疎遠になるのが普通なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "TL;DR 我取消了我所有社交媒体上没有回复我的所有人的好友关系\n6个月或更长时间，没有人留下，只有零......这并不是说我没有尝试过\n我也不是没有尝试过联系，但他们只是一直把我留在阅读上，并没有表现出继续做我朋友的兴趣。\n对继续做我的朋友没有兴趣。\n\n公平地说，我是...",
      "title": "在20岁的时候，你与小学、初中和高中的所有老朋友和熟人都渐渐疏远，这正常吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "TL;DR 我取消了我所有社交媒體上沒有回覆我的所有人的好友關係\n6個月或更長時間，沒有人留下，只有零......這並不是說我沒有嘗試過\n我也不是沒有嘗試過聯繫，但他們只是一直把我留在閱讀上，並沒有表現出繼續做我朋友的興趣。\n對繼續做我的朋友沒有興趣。\n\n公平地說，我是...",
      "title": "在20歲的時候，你與小學、初中和高中的所有老朋友和熟人都漸漸疏遠，這正常嗎？"
    }
  ]
}