{
  "author": "nickname432",
  "the_new_excerpt": "Russel Okung is an NFL player who signed a contract with the Carolina Panthers\nin March 2020. As part of their agreement, part of his wage is paid out in\nbitcoin.\n\nRussel Okung's comments on bitcoin are spot on:\n\n\"Money is more than currency; it's power. The way money is handled from creation\nto…",
  "original_created_utc": 1614251844,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "拉塞尔-奥康是一名NFL球员，他与卡罗莱纳黑豹队签订了一份合同。\n在2020年3月。作为他们协议的一部分，他的部分工资是以下列方式支付的\n比特币。\n\n拉塞尔-奥孔对比特币的评价很到位。\n\n\"金钱不仅仅是货币，更是一种力量. 钱的处理方式从产生开始\n到...",
      "title": "\"当我们都用比特币支付时，没有人能告诉我们该如何处理我们创造的价值......在后比特币的世界里，你不用担心你的劳动和时间会被偷走。\" - Russel Okung"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "拉塞爾-奧康是一名NFL球員，他與卡羅萊納黑豹隊簽訂了一份合同。\n在2020年3月。作爲他們協議的一部分，他的部分工資是以下列方式支付的\n比特幣。\n\n拉塞爾-奧孔對比特幣的評價很到位。\n\n\"金錢不僅僅是貨幣，更是一種力量. 錢的處理方式從產生開始\n到...",
      "title": "\"當我們都用比特幣支付時，沒有人能告訴我們該如何處理我們創造的價值......在後比特幣的世界裏，你不用擔心你的勞動和時間會被偷走。\" - Russel Okung"
    }
  ],
  "title": "\"When we are all paid in bitcoin, no one can tell us what to do with the value we create … In a post-fiat world, you won’t have to worry about your labor and time being stolen.\" - Russel Okung",
  "created_utc": 1614264068,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Russel Okung is an NFL player who signed a contract with the Carolina Panthers in March 2020. As part of their agreement, part of his wage is paid out in bitcoin.</p>\n\n<p>Russel Okung&#39;s comments on bitcoin are spot on:</p>\n\n<p>&quot;Money is more than currency; it&#39;s power. The way money is handled from creation to dissemination is part of that power. Getting paid in Bitcoin is the 1st step of opting out of the corrupt, manipulated economy we all inhabit.&quot;</p>\n\n<p>&quot;When we are all paid in bitcoin, no one can tell us what to do with the value we create … In a post-fiat world, you won’t have to worry about your labor and time being stolen.&quot;</p>\n\n<p>When you have a quarter of the broad money supply being created in less than a year, it is clear that the money printer determines what value is in the first place. If you receive constant government bailouts, either because your company is highly in debt or it secures many jobs, you&#39;re never ever going to do anything but to keep your company &quot;system-relevant&quot;. You&#39;re not going to innovate. You&#39;re not even competing anymore.</p>\n\n<p>Debt and the money printer killed capitalism.. risk of investing capital is only for the little guy now because they&#39;re not relevant enough for the system. Just give them a shitty paying job that we maintain for them at the mercy of our money printer while asset prices inflate away and out of reach.</p>\n\n<p>The money that&#39;s being printed creates more debt than actual GDP. They have to stop but they can&#39;t.</p>\n</div><!-- SC_ON -->",
  "score": 918,
  "permalink": "/r/Bitcoin/comments/ls4cvv/when_we_are_all_paid_in_bitcoin_no_one_can_tell/",
  "subreddit": "Bitcoin",
  "id": "ls4cvv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937731090
}