{
  "author": "chrisnsalem",
  "the_new_excerpt": "Hands down, r/Cryptocurrency [/r/Cryptocurrency] is the best subbredit on this\nentire site. Hell, even the automod has my love. I can’t wait to see what this\ncommunity is going to look like in 1 year, 5 years, and 10+ years. Keep doing a\ngreat job. They once said the sky was the limit, but we landed…",
  "original_created_utc": 1619504230,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "何と言っても、r/Cryptocurrency [/r/Cryptocurrency]は、このサイト全体の中でも最高のサブブレッドです。\nサイトで一番のサブブレッドです。オートモッドでさえも私は好きです。このコミュニティが1年後、5年後、6年後にどうなっているのか楽しみです。\n1年後、5年後、10年以上後にこのコミュニティがどうなっているのか楽しみです。これからも素晴らしい仕事を\n素晴らしい仕事を続けてください。彼らはかつて、空は限界だと言ったが、我々は着陸した...。",
      "title": "このサブレディットの爆発的な成長を支えてきたr/Cryptocurrency Modsに敬意を表しましょう。ありがとうございます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "毫无疑问，r/Cryptocurrency [/r/Cryptocurrency]是这个网站上最好的子信用。\n整个网站上最好的子目录。该死的，即使是automod也有我的爱。我迫不及待地想看到这个\n社区在1年、5年和10年以上会是什么样子。继续做一个\n伟大的工作。他们曾经说过，天空是极限，但我们登陆了......",
      "title": "我们能不能花点时间，把荣耀献给r/Cryptocurrency版主，他们在这个子目录的爆炸性增长中磨炼，使你可以得到免费的月亮，只是为了贡献和学习？谢谢你。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "毫無疑問，r/Cryptocurrency [/r/Cryptocurrency]是這個網站上最好的子信用。\n整個網站上最好的子目錄。該死的，即使是automod也有我的愛。我迫不及待地想看到這個\n社區在1年、5年和10年以上會是什麼樣子。繼續做一個\n偉大的工作。他們曾經說過，天空是極限，但我們登陸了......",
      "title": "我們能不能花點時間，把榮耀獻給r/Cryptocurrency版主，他們在這個子目錄的爆炸性增長中磨鍊，使你可以得到免費的月亮，只是爲了貢獻和學習？謝謝你。"
    }
  ],
  "title": "Can we all take a moment and give glory to the r/Cryptocurrency Mods who have grinded through the explosive growth of this subreddit so you can get free moons just for contributing and learning? Thank you.",
  "created_utc": 1619543595,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hands down, <a href=\"/r/Cryptocurrency\">r/Cryptocurrency</a> is the best subbredit on this entire site. Hell, even the automod has my love. I can’t wait to see what this community is going to look like in 1 year, 5 years, and 10+ years. Keep doing a great job. They once said the sky was the limit, but we landed on the damn moon.</p>\n</div><!-- SC_ON -->",
  "score": 292,
  "permalink": "/r/CryptoCurrency/comments/mzi0lx/can_we_all_take_a_moment_and_give_glory_to_the/",
  "subreddit": "CryptoCurrency",
  "id": "mzi0lx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776212020
}