{
  "author": "godisdildo",
  "the_new_excerpt": "Reading through this sub you get the feeling that everyone “knows” it but no one\nis exactly giving a single reason for why, other than “it should because of high\nvaluations”.\n\nIt reads as a lot of wishful thinking and arrogance. Where the hell do you place\nApple, the largest company in the world…",
  "original_created_utc": 1619863183,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブ記事を読んでいると、誰もがそれを「知っている」ように感じますが、誰もその理由を正確には述べていません。\nその理由は「バリュエーションが高いからだろう」ということだけで、正確には誰も言っていません。\n評価されているからそうなるだろう」という理由以外には、誰も正確な理由を述べていません。\n\nそれは多くの希望的観測と傲慢さのように読めます。いったいどこに配置するのか\n世界最大の企業であるアップル...",
      "title": "なぜ \"成長が崩れる \"のかを論じることができる人は一人もいません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "通过阅读这篇文章，你会感觉到每个人都 \"知道 \"它，但没有人\n确切地给出了一个原因，除了 \"它应该是因为高估值\"。\n估值\"。\n\n这读起来像很多一厢情愿的想法和傲慢。你到底把\n苹果，世界上最大的公司...",
      "title": "你们中没有一个人能够论证为什么 \"增长将崩溃\""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "通過閱讀這篇文章，你會感覺到每個人都 \"知道 \"它，但沒有人\n確切地給出了一個原因，除了 \"它應該是因爲高估值\"。\n估值\"。\n\n這讀起來像很多一廂情願的想法和傲慢。你到底把\n蘋果，世界上最大的公司...",
      "title": "你們中沒有一個人能夠論證爲什麼 \"增長將崩潰\""
    }
  ],
  "title": "Not a single one of you are able to argue why “growth will collapse”",
  "created_utc": 1619872789,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Reading through this sub you get the feeling that everyone “knows” it but no one is exactly giving a single reason for why, other than “it should because of high valuations”.</p>\n\n<p>It reads as a lot of wishful thinking and arrogance. Where the hell do you place Apple, the largest company in the world growing 50%?  </p>\n\n<p>Growth has outperformed value for 20 years, and the winners of the dot com crash , like Apple, Microsoft and Amazon, have outperformed everything by a huge margin in the last 30 years. </p>\n\n<p>Either the valuation methods were good to use and it’s just that the type of company that wins the future has so much higher margins and network effects that the definition of key value metrics has to change, OR (like many here seem to suggest), somehow this will all “regress to the mean” and somehow Sysco, public enterprise group, and Cincinnati Financial (great companies I also own) will eventually outperform the other ones I mention?</p>\n\n<p>It has nothing to do with finance and everything to do with business model. If you can’t understand how business has changed finance, then you will continue to underperform by relying on outdated financial discipline viewpoints.</p>\n</div><!-- SC_ON -->",
  "score": 177,
  "permalink": "/r/investing/comments/n2fchi/not_a_single_one_of_you_are_able_to_argue_why/",
  "subreddit": "investing",
  "id": "n2fchi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380965864
}