{
  "author": "AutoModerator",
  "the_new_excerpt": "Hey everyone! Hope your June is off to a fine start. We're here with some notes\nand updates about moderation policy. Without further delay:\n\n\nTHERSDAY\n\nYou suggested and we listened: you wanted a day free of motherhood, parenting,\npregnancy, and similar related posts! In response, we expanded our…",
  "original_created_utc": 1622901619,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。6月も順調にスタートしていることと思います。ここでは、モデレーションポリシーに関する\n今回は、モデレーションポリシーに関する注意点と最新情報をお届けします。早速ですが、今回は\n\n\nTHERSDAY\n\nあなたが提案し、私たちはそれに耳を傾けました：あなたは母性、子育て、妊娠、および同様の関連記事のない日を望んでいたのです。\n母性、子育て、妊娠、その他類似の関連記事がない日を望んでいました。これを受けて、私たちはこの日を拡大しました。",
      "title": "更新：Thersdayの補足ルールは今後も継続され、失礼なコメントのルールについても明確になりました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好 希望你的六月有一个好的开始。我们在这里有一些说明\n和更新有关审核政策。不再拖延。\n\n\n第四天\n\n你的建议，我们听了：你想要一个没有母性、育儿、怀孕和类似相关帖子的日子。\n怀孕，以及类似的相关帖子! 作为回应，我们扩大了我们的网站。",
      "title": "更新：\"星期四 \"的补充规则在此保留，关于我们的不敬评论规则的澄清，以及感谢你!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好 希望你的六月有一個好的開始。我們在這裏有一些說明\n和更新有關審覈政策。不再拖延。\n\n\n第四天\n\n你的建議，我們聽了：你想要一個沒有母性、育兒、懷孕和類似相關帖子的日子。\n懷孕，以及類似的相關帖子! 作爲迴應，我們擴大了我們的網站。",
      "title": "更新：\"星期四 \"的補充規則在此保留，關於我們的不敬評論規則的澄清，以及感謝你!"
    }
  ],
  "title": "Update: Supplementary rules for Thersday here to stay, a clarification regarding our disrespectful commentary rule, and a THANK YOU!",
  "created_utc": 1622923944,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey everyone! Hope your June is off to a fine start. We&#39;re here with some notes and updates about moderation policy. Without further delay:</p>\n\n<h1>Thersday</h1>\n\n<p>You suggested and we listened: you wanted a day free of motherhood, parenting, pregnancy, and similar related posts! In response, we expanded our theme day, Thersday, to limit posts only to women themselves, outside of any relationships with other people. It was initially implemented as a trial, and we are happy to announce that due to good feedback, this change is here to stay. We’re pleased with the creativity and variety of topics posted as a result of theme days, and as far as we can tell, so are you!</p>\n\n<h1>An important clarification regarding our rule against disrespectful commentary</h1>\n\n<p>At AskWomen, we strive to be an inclusive space. Statistically, approximately 1 in 5 adults will experience some form of mental illness in their lifetime. As we grow as a subreddit, we want to maintain a space where we can both include and be understanding of one another. As such, we are expanding this policy to now include pathologizing language/armchair diagnosing. We feel that, whether intentional or not, casual use of diagnostic labels to describe everyday behaviour can exclude and be harmful to people experiencing mental illness.</p>\n\n<p>It is not fair to people with mental illness to attribute every feeling or action to their condition, particularly the choice to abuse. Plenty of people living with mental illnesses are capable of living a life free of abusing others, just as some abusers who have no known psychiatric conditions make the conscious choice to abuse, every day.</p>\n\n<p>In short, we are asking our community to <strong>avoid using terms for mental health issues as judgments, slurs, or synonyms for toxic behaviour.</strong> Posts and comments will be encouraged, where possible, to use non-pathologizing/clinical adjectives to describe traits/behaviours.</p>\n\n<h1>Examples of using these terms as judgements, slurs, or careless casual use</h1>\n\n<p><strong>Usage of words/labels like:</strong></p>\n\n<ul>\n<li>“OCD” (to mean something like fastidious, particular, picky, fussy)</li>\n<li>“narcissist” (to mean something like self-absorbed, arrogant, toxic, selfish, abusive)</li>\n<li>“borderline/BPD” (to mean something like unstable, unpredictable, moody)</li>\n<li>&quot;schizo’’ (to mean something like paranoid, erratic, or eccentric)</li>\n<li>“ADHD” (to mean something like hyperactive, jittery, inattentive)</li>\n<li>“psycho(path)’’ or &quot;sociopath’’ (to mean something like angry, jealous, controlling, abusive...) and similar.</li>\n</ul>\n\n<p>If a diagnostic label can be replaced by another word, it must be used instead. In our experience, the more common synonyms might be &quot;abuser’’/’’abusive’’, &quot;toxic (of a behaviour or person)’’, or &quot;asshole’’. You always have your pick of non-gendered slurs and insults, too!</p>\n\n<p><strong>Armchair diagnostics or speculation about possible diagnoses:</strong></p>\n\n<ul>\n<li><strong>‘</strong>’That sounds like x’’,</li>\n<li>&quot;I think my ex was y&quot;</li>\n<li>‘’I think my mom has/is z’’</li>\n</ul>\n\n<p><strong>Exceptions:</strong></p>\n\n<ul>\n<li>Talking about your own, diagnosed condition and how it affects you</li>\n<li>Talking about your family member, friend, or other person with a diagnosed condition, and how it affects you, in a submission in which you are the requested demographic (eg. addressed to friends/family members of people with x, not people with x).</li>\n<li>Talking about yourself/someone in your life who is seeking a diagnosis, but does not have one yet (eg - &quot;my friend is starting the process of getting tested for ADHD&quot;)</li>\n<li>Talking about famous people and figures who have the diagnosis, if it is relevant</li>\n</ul>\n\n<p>Application of these rules is at moderator discretion. We may remove other common labels or descriptors (for instance &quot;crazy&quot;) if mods feel that they were used in a blatantly disrespectful manner. Please<a href=\"http://www.reddit.com/message/compose?to=%2Fr%2Faskwomenmods\"> send us a modmail</a> if you would like to discuss a removed comment or post.</p>\n\n<p>We know that the use of some of these labels is very common on Reddit, so it&#39;s natural that some of these terms might be used by accident. Please know that a request to edit your post does not mean that you are in trouble; fix it and we will be happy to put it back up! We process too much content to pay attention to usernames, so please be assured that it&#39;s not some kind of mark against you as a participant :)</p>\n\n<h1>You&#39;re the best!</h1>\n\n<p>With all that out of the way, we love being part of such an active, caring community. By reporting rule-breaking content, upvoting good questions, and downvoting only when content is in bad faith or does not contribute meaningfully to the community, you help out more than you can know. <strong>Please continue to do an excellent job being excellent to each other, and thank you!</strong></p>\n</div><!-- SC_ON -->",
  "score": 111,
  "permalink": "/r/AskWomen/comments/nswcxs/update_supplementary_rules_for_thersday_here_to/",
  "subreddit": "AskWomen",
  "id": "nswcxs",
  "is_self": true,
  "media": null,
  "is_video": false
}