{
  "author": "PurrPrinThom",
  "original_created_utc": 1641219177,
  "title": "Monday Methods: Why are there letters in the ogham alphabet that do not exist in the Irish language?",
  "created_utc": 1641237100,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Happy New Year to all, and a special thanks to the mods for this brief foray into some philology!&lt;/p&gt;\n\n&lt;p&gt;I have attempted to write this in a way that is accessible and comprehensible to a general reader, as well as attempting to remain relatively concise, and thus there are, of course, areas upon which I can expand or which may necessitate further discussion, and I am happy to do so in the comments. &lt;/p&gt;\n\n&lt;p&gt;Without further ado, let us begin.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;What is ogham?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Ogham is an alphabet system consisting of notches and lines across a stemline, and it serves as our first written record of the Irish (Gaelic) language, having been in use between 400-600 AD. The &lt;a href=\"https://upload.wikimedia.org/wikipedia/commons/thumb/1/11/All_Ogham_letters_including_Forfeda_-_%C3%9Cbersicht_aller_Ogham-Zeichen_einschlie%C3%9Flich_Forfeda.jpg/1024px-All_Ogham_letters_including_Forfeda_-_%C3%9Cbersicht_aller_Ogham-Zeichen_einschlie%C3%9Flich_Forfeda.jpg\"&gt;system&lt;/a&gt; consists of four groups of five letters, with two of the groups protruding out either side of the stemline, one to the left and one to the right; one crossing the stemline diagonally, and the fourth appearing either on the stemline itself, or crossing it. With regards to the image linked above, there is a fifth group that we will be discussing further below. &lt;/p&gt;\n\n&lt;p&gt;But, for those familiar with the Irish language, it is immediately apparent that the ogham alphabet provided above contains letters which do not exist in the Irish language: Q, NG, and Z. (With a caveat here that /h/ does exist in Modern Irish, but rarely, primarily as a marker of mutation and in loan words, as it did not exist in early periods of the language.) &lt;/p&gt;\n\n&lt;p&gt;This is certainly odd, as why would an alphabet contain letters that do not exist in the language? Why include them if they weren&amp;#39;t going to be used?&lt;/p&gt;\n\n&lt;p&gt;So where do they come from? &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Our sources for ogham: ogham stones&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Before answering that question, a bit of background about ogham is needed. Our earliest sources of ogham (5th-7th century) are found on &lt;a href=\"https://ogham.celt.dias.ie/resources/sites/National_Museum/118._Monataggart_I/118._Monataggart_I.jpg\"&gt;ogham stones&lt;/a&gt;. &lt;a href=\"https://ogham.celt.dias.ie/stone.php?lang=en&amp;amp;site=National_Museum&amp;amp;stone=118._Monataggart_I&amp;amp;stoneinfo=description\"&gt;Further information about the previous image.&lt;/a&gt;. \nAs you can see, the spine of the stone was frequently used as the stemline for the inscriptions, written vertically, typically from top to bottom, and following the edge of the stones. &lt;/p&gt;\n\n&lt;p&gt;The stones appear to have been used in burials, as well as for boundary markers, indicating where someone’s land ended or began. Therefore, the content of the stones is fairly simple: we typically only have proper names. Many follow the formula [X] MAQQI [Y] aka [X] mac [Y] aka [X] son of [Y]. There are occasional tribal affiliations (&amp;#39;of the people of [Z]&amp;#39;) and, as on &lt;a href=\"https://ogham.celt.dias.ie/stone.php?lang=en&amp;amp;site=Arraglen&amp;amp;stone=145._Arraglen\"&gt;CIIC 145&lt;/a&gt; the inscription includes QRIMITIR &lt;em&gt;cruimther&lt;/em&gt; ‘priest.’&lt;/p&gt;\n\n&lt;p&gt;This means that, unfortunately, we have no attestations of sentences or complex concepts. We have no verbs, no adjectives, and only a handful of nouns outside of personal names, etc. It also means that we don’t know how ogham might have been used (&lt;em&gt;if&lt;/em&gt; it was used) to handle more complex constructions eg. were different sentences written along a different stemline? Although later medieval texts refer to messages being written in ogham on trees and pieces of wood, none of these survive (if they ever existed at all, as the practice may not have been a legitimate one.) Thus, we&amp;#39;re left with relatively little by way of actual attestation.&lt;/p&gt;\n\n&lt;p&gt;That does not mean, however, that the ogham stones do not provide us with a wealth of linguistic information, because they absolutely do. We can trace changes in the language from the content of the ogham stones, from which we can extrapolate to our reconstructions of other aspects of the language. &lt;/p&gt;\n\n&lt;p&gt;The Irish language changed significantly in a relatively short period of time. The Primitive Irish period lasted only for a century (400-500 AD) and was marked by apocope, the loss of final vowels. Archaic Irish lasted between 50 to 100 years (500- either 550/600 AD, depending on your dating of Early Old Irish) and was ended with syncope – the loss of second/fourth internal vowels. (There are, of course, other changes that took place in the language during and after these periods, but these are the major changes by which we date the periods.) &lt;/p&gt;\n\n&lt;p&gt;To illustrate: &lt;a href=\"https://ogham.celt.dias.ie/stone.php?lang=en&amp;amp;site=Greenhill&amp;amp;stone=58._Greenhill_II\"&gt;CIIC 58&lt;/a&gt; gives us the Primitive Irish name CATTUBUTTAS, with its original ending (&lt;em&gt;-as&lt;/em&gt;) still intact. The same name appears, post-apocope, in the Archaic Irish inscription CAT]TABBOTT in &lt;a href=\"https://ogham.celt.dias.ie/stone.php?lang=en&amp;amp;site=National_Museum&amp;amp;stone=46._Houseland\"&gt;CIIC 46&lt;/a&gt; in which the ending has been apocopated (no more &lt;em&gt;-as&lt;/em&gt; here) but the internal vowel -a- is still retained. The name in the Early Old Irish period, once we are firmly manuscript territory, appears as Cathboth – with the internal vowel syncopated – and eventually, Cathbad, for those familiar with Early Irish mythology&lt;/p&gt;\n\n&lt;p&gt;We can also view these changes in ‘real time’ so to speak, as, for example &lt;a href=\"https://www.wikidata.org/wiki/Q70892857\"&gt;CIIC 244&lt;/a&gt; contains the inscription COILLABBOTAS MAQI CORBBI MAQI MOCOI QERAI ‘of Cóelboth, son of Corb, of the descendants of Cíarae’ while &lt;a href=\"https://www.wikidata.org/wiki/Q106680978\"&gt;CIIC 243&lt;/a&gt; has MAQI-RITTE MAQI COLABOT MAQI MOCO QERAI ‘of Mac-Rithe, son of Cóelboth, son of the descendants of Cíarae.’ Clearly, this Cóelboth is the same in both inscriptions, but in one his name is given with the pre-apocope (COILLABBOTAS) form, and in the other, the post-apocope form (COLABOT.)&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Our sources for ogham: manuscript ogham&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;As noted above, our stone sources of ogham are relatively limited in content, and you may have noticed that I made no mention of the alphabet. This is because no such guide to the alphabet exists on the stones themselves. While we do have bilingual stones that aided in translating/transliterating them, the ogham alphabet linked above has been given to us in manuscripts. &lt;/p&gt;\n\n&lt;p&gt;One of our sources for the ogham alphabet is &lt;em&gt;Auraicept na n-Éces&lt;/em&gt; ‘The Scholars’ Primer,’ which is a didactic text that discusses Irish grammar, but also ogham in some detail. You can view the manuscript pages from the Book of Ballymote thanks to the wonderful people at &lt;a href=\"https://www.isos.dias.ie/libraries/RIA/RIA_MS_23_P_12/tables/19.html\"&gt;Irish Script on Screen&lt;/a&gt;, however their website prohibits direct linking so you will have to open images 169r – 170v yourself to see the lists of the alphabets.&lt;/p&gt;\n\n&lt;p&gt;The texts in which the ogham alphabets are identified are typically dated to around the 7th century (although the manuscripts themselves are much younger,) which means they were written right around the time that ogham was no longer in use. &lt;/p&gt;\n\n&lt;p&gt;It is likely for this reason that we find discrepancies between manuscript ogham and stone ogham: ogham was either already a purely scholastic exercise, or was on the way out, meaning our scribes were less familiar with it than if it were their primary orthographic system. There are a number of discrepancies in the representation of the language, including the inclusion of mutation in the manuscripts, but for the purposes of this post we’ll focus on the alphabet itself. &lt;/p&gt;\n\n&lt;p&gt;A prime example comes in the list of the alphabet linked above: the fifth grouping of characters, the &lt;em&gt;forfeda&lt;/em&gt; or ‘supplementary letters’ are not well-attested on stones. In fact, only the first symbol – given in the alphabet there as -ea- is attested, and more commonly as ‘K,’ (cf. &lt;a href=\"https://ogham.celt.dias.ie/stone.php?lang=en&amp;amp;site=Coolmagort&amp;amp;stone=197._Coolmagort_I\"&gt;CIIC 197&lt;/a&gt;, CIIC 198,) although later appearing as a vowel, like -e- or -ea- (cf. &lt;a href=\"https://ogham.celt.dias.ie/stone.php?lang=en&amp;amp;site=Kilmalkedar&amp;amp;stone=187._Kilmalkedar\"&gt;CIIC 187&lt;/a&gt;. &lt;/p&gt;\n\n&lt;p&gt;Our manuscript ogham sources also provide a number of other ogham alphabets that are otherwise unattested: they appear in these sources, and these sources only. Whether or not they were actually in use at any stage is unknown, and they have no representation on the stones. Additionally, outside of being listed as alphabets, they are not used in the manuscripts themselves and thus many of them have yet to be decoded. The function of these alphabets is still a subject of academic debate, with some scholars believing they were legitimate alphabets that were used in particular contexts, and others believing they were invented for some academic or didactic purpose.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Letter names&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Something commonly stated about ogham is that it is a ‘tree alphabet,’ – if you Google it, or have ever encountered it in any media or pop history book, this is likely one of the first things you’ll come across, and this designation has led to a certain amount of extrapolation about the native Irish. &lt;/p&gt;\n\n&lt;p&gt;The reason the alphabet is often referred to as a ‘tree alphabet’ is because the manuscript ogham tradition provides us with the names of the letters, which are (generally) the names of trees or other plants. Unlike the English alphabet, in which the letter names are just...letter names, they have no other meaning (aside from the homonymic few,) whereas the ogham letter names given to us are also proper nouns.&lt;/p&gt;\n\n&lt;p&gt;The names were seemingly transmitted as kennings, essentially riddles, which is likely an important consideration when we finally get to our titular question. The kennings were intended to hint at the names by referring to the meaning of the name, or qualities of the name, like the types of hints used in crossword puzzles.&lt;/p&gt;\n\n&lt;p&gt;These kennings run of the gamut of being completely understandable to someone without the intellectual or cultural context in which they were created, to being entirely opaque. As example, kennings given for the letter -u-, named &lt;em&gt;úr&lt;/em&gt; ‘clay, soil, earth’ are &lt;em&gt;sílad cland&lt;/em&gt; ‘propagation of plants,’ and &lt;em&gt;forbbaid ambí&lt;/em&gt; ‘shroud of a lifeless one,’ both of which can be potentially figured out by a modern reader: earth is needed for plants to grow, dead people are shrouded in the earth, etc etc.&lt;/p&gt;\n\n&lt;p&gt;But the kennings for the first letter, -b- &lt;em&gt;beithe&lt;/em&gt; ‘birch tree’ are more puzzling: &lt;em&gt;féochos foltchaín&lt;/em&gt; ‘withered leg with fine hair,’ &lt;em&gt;glaisem cnis&lt;/em&gt; ‘greyest of skin,’ &lt;em&gt;maise malach&lt;/em&gt; ‘beauty of the eyebrow.’ Personally, I don’t know that I would ever have landed on ‘birch’ from those, without the aid of the manuscript ogham tradition. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Mystery letters&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Now, onto our titular question: why does the alphabet contain letters that did not/do not exist? How did they come to be in the ogham alphabet?\nAlthough we cannot know for certain, our best estimate is that these values represent linguistic change within the language, and an attempt to reconcile a sequential alphabet system with these changes.&lt;/p&gt;\n\n&lt;p&gt;An example that we can see is that of F, which undoubtedly represents an earlier V. The name for -f- is &lt;em&gt;fern&lt;/em&gt; &amp;lt; * u̯ernā,* ‘alder tree,’ and we have Gaulish &lt;em&gt;verno-dubrum&lt;/em&gt; ‘alder-water,&amp;#39; as a Celtic comparison. We do also have bilingual stones in which the symbol -f- is used to represent -v- in Latin: AVITTORIGES INIGENA CUNIGNI : Avitoria filia Cunigni (CIIC 362.) Based on the evidence at hand, we know that the sound /f/ was originally /v/, and the value of the letter F in the ogham alphabet likely changed to reflect those changes. (This is also why, for anyone who has looked into the ogham alphabet, you&amp;#39;ll find conflicting alphabets from some sources. Those following the stones will include V as the third letter, while those following the manuscript tradition will include F.)&lt;/p&gt;\n\n&lt;p&gt;It logically follows, therefore, that the value of the other letters changed as the language changed. The trouble with this, however, is that - with the exception of Q, which is used in nearly every inscription - there are no attestaions of H or Z on any of the ogham stones, and there are no unambiguous attestations of NG. Meaning that we have no evidence from the &amp;#39;original&amp;#39; ogham sources to help us puzzle out what they may have represented.&lt;/p&gt;\n\n&lt;p&gt;With Q, we know that it originally represented /K&lt;sup&gt;u̯&lt;/sup&gt; / based on other etymological reconstruction, such as its use in the word MAQQI in the stones, which comes from &lt;em&gt;makk&lt;sup&gt;u̯&lt;/sup&gt;&lt;/em&gt; - . The assumption that the letter Q originally represented K&lt;sup&gt;u̯&lt;/sup&gt; is perhaps validated by the fact that there is the word &lt;em&gt;cert&lt;/em&gt;  ‘bush’ &amp;lt; &lt;em&gt;k&lt;sup&gt;u̯&lt;/sup&gt; ertā&lt;/em&gt;, which seems a likely candidate for the original letter name, which is occasionally spelled &lt;em&gt;quert&lt;/em&gt; by the manuscript tradition to try and justify the inclusion of Q. But, we are also provided with the homonym ‘ceirt’ meaning ‘rag,’ as the name in the manuscripts. &lt;/p&gt;\n\n&lt;p&gt;We’re likely looking at a similar situation with NG: the kennings give the word &lt;em&gt;(n)gétal&lt;/em&gt; ‘wounding, slaying,’ which is otherwise unattested in the Old Irish corpus. It appears to be an older verbal noun of the verb &lt;em&gt;gonaid&lt;/em&gt;, meaning ‘wounds, kills’ which comes from &lt;em&gt;g&lt;sup&gt;u̯&lt;/sup&gt; en&lt;/em&gt;-. &lt;/p&gt;\n\n&lt;p&gt;As we know that both /K&lt;sup&gt;u̯&lt;/sup&gt; / and /G&lt;sup&gt;u̯&lt;/sup&gt; / existed in the Primitive Irish period, and eventually merged with /k/ and /g/ respectively, likely around the 6th century, positing them as the original values for the letters Q and NG seems fairly reasonable. As they were originally distinct sounds from /k/ and /g/, (and especially in the instance of Q, a rather common one) they would have needed their own letter in the original ogham alphabet found on stones. &lt;/p&gt;\n\n&lt;p&gt;H &amp;amp; Z, however, are more of a mystery. &lt;/p&gt;\n\n&lt;p&gt;The name given by the manuscripts for H is &lt;em&gt;húath&lt;/em&gt; ‘fear, horror,’ but the h- here is artificial: the word is &lt;em&gt;úath&lt;/em&gt;, and while attaching a cosmetic h- to words beginning with vowels was a relatively common practice of certain Old Irish scribes, it was never understood as being pronounced. The kennings certainly point to &lt;em&gt;úath&lt;/em&gt; &amp;#39;horror&amp;#39; being the correct name, but scholars are uncertain about the etymology of the form and thus, without any attestation, it is entirely unclear what the original sound here may have been, especially as we would expect a consonant sound based on its position within the alphabet structure.&lt;/p&gt;\n\n&lt;p&gt;We have a similar problem with Z in that the name given for the letter &lt;em&gt;sraiph, zraif, straif&lt;/em&gt; ‘sulphur,’ is of unknown etymological origin. If we were able to identify the origins of this word, the original value of the letter would likely become clear, but until then we can only guess. Some kind of -st-, -str- grouping or potentially even a S&lt;sup&gt;u̯&lt;/sup&gt; have all been suggested. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Inclusion in manuscript sources&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;It seems a reasonable assumption, based on the evidence of F and Q especially, but likely also NG, that these troublesome letters originally represented sounds that no longer existed by the time of their inclusion in the manuscript sources: F originally represented a /v/ but had become /f/ by the time of writing while Q originally represented K&lt;sup&gt;u̯&lt;/sup&gt; before its merger with simply /k/, which is likely also the case with NG &amp;gt; /g/. &lt;/p&gt;\n\n&lt;p&gt;But then, why were they included in the alphabet given in manuscript sources? If the sounds no longer existed, why did the scribes include them? &lt;/p&gt;\n\n&lt;p&gt;It has been suggested by McManus (1988, 166-167,) that the letter names, and their kennings, were fixed at a relatively early date (he suggests the 6th century) and that these were passed down as learned series. This leaves the scribes of our manuscript tradition with a bit of a puzzle: the kennings, and their associated letter names, now don&amp;#39;t make any sense, with some of the letters appearing to redundant (the name &lt;em&gt;ce(i)rt&lt;/em&gt; has an initial sound of /k/, the same as the letter C [&lt;em&gt;coll&lt;/em&gt;,] the word &lt;em&gt;gétal&lt;/em&gt; begins with the sound /g/ which already exists in the letter G [&lt;em&gt;gort&lt;/em&gt;].) Imagine if someone were to give you the words &amp;#39;cat&amp;#39; and &amp;#39;cot&amp;#39; and say, &amp;quot;These start with different letters, tell me which letter is which.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;But what is to be done? If we take the ogham stone tradition into consideration, Q is used in nearly every inscription, it cannot be simply ignored or erased, it needs to be included in order to avoid confusion. Perhaps even more importantly, the ogham alphabet is sequential. It would not make any sense to remove letters when they are represented by increasing linear strokes: removing both NG and Z would mean that the alphabet would have a symbol of two diagonal lines across the stemline (G) and then jump to five diagonal lines across a stemline (R.) It would upend the system. &lt;/p&gt;\n\n&lt;p&gt;The best that our scribes could do was assign cosmetic values to the sounds that no longer existed in order to keep the alphabet intact, and to distinguish them from already existing letters. In order to do so, they included letters from the Latin alphabet that were not present in Irish: as &lt;em&gt;úath&lt;/em&gt; began with a vowel, and was both redundant and in the place of an expected consonant, they prefixed a cosmetic H; as the distinction between K&lt;sup&gt;u̯&lt;/sup&gt; and K was lost (and indeed MAQQI was now &lt;em&gt;mac&lt;/em&gt;) they represented it with a close Latin equivalent, Q, which was undoubtedly the same thought process that went into Z. NG may have been influenced by mutational contexts, but we may never know for certain. &lt;/p&gt;\n\n&lt;p&gt;Basically, the TL;DR version of this is: the letters of the ogham alphabet that do not exist in the Old Irish (or Modern Irish) alphabet undoubtedly represent sounds that were present in the language when ogham was created, but that were merged with other sounds through the process of linguistic change. As ogham was passed down to subsequent generations, they grappled with the seeming redundancy of sounds in the alphabet and inserted Latin letters to try and represent the sounds that were once distinct, in order to maintain both the sequential system of the ogham alphabet, and the inherited knowledge of the kennings. &lt;/p&gt;\n\n&lt;p&gt;Some further reading: &lt;/p&gt;\n\n&lt;p&gt;R.A.S. MACALISTER, Corpus inscriptionum insularum Celticarum. 2 vols. Dublin: Stationary Office, 1945, 1949. Vol. I reprinted Dublin: Four Courts Press, 1996&lt;/p&gt;\n\n&lt;p&gt;Kim MCCONE, Towards a relative chronology of ancient and medieval Celtic sound change. Maynooth: The Department of Old Irish, St. Patrick’s College, 1996.&lt;/p&gt;\n\n&lt;p&gt;Damian MCMANUS, ‘A chronology of the Latin loan-words in Early Irish’, Ériu 34 (1983), 21–71&lt;/p&gt;\n\n&lt;p&gt;-- ‘On final syllables in the Latin loan-words in Early Irish’, Ériu 35 (1984), 137–162&lt;/p&gt;\n\n&lt;p&gt;-- ‘Ogam: Archaizing, orthography and the authenticity of the manuscript key to the alphabet’, Ériu 37 (1986), 1–31.&lt;/p&gt;\n\n&lt;p&gt;--&amp;#39;Irish Letter-Names and Their Kennings&amp;#39;, Ériu 39 (1988), 127-168&lt;/p&gt;\n\n&lt;p&gt;-- &lt;em&gt;A guide to Ogam&lt;/em&gt;. Maynooth: An Sagart, 1991.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 224,
  "permalink": "/r/AskHistorians/comments/rv2lho/monday_methods_why_are_there_letters_in_the_ogham/",
  "subreddit": "AskHistorians",
  "id": "rv2lho",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Happy New Year to all, and a special thanks to the mods for this brief foray\ninto some philology!\n\nI have attempted to write this in a way that is accessible and comprehensible to\na general reader, as well as attempting to remain relatively concise, and thus\nthere are, of course, areas upon which I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "新年あけましておめでとうございます。そして、このような短い時間ではありますが、司会者の方々に感謝いたします。\nフィロロジーの世界へ\n\n私は、この文章を、以下のような人たちが理解できるように書きました。\n一般的な読者に対して、比較的簡潔な表現を心がけました。\n勿論、至らない点もありますが...。",
      "title": "月曜日のメソッド なぜオガム文字にはアイルランド語には存在しない文字があるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "祝大家新年快乐，并特别感谢版主为我们提供的这段简短的文字资料。\n语文学的简短介绍!\n\n我试图用一种普通读者可以理解的方式来写这篇文章。\n的方式来写，同时也试图保持相对简洁，因此\n当然，有些地方我......",
      "title": "星期一的方法。为什么在奥格姆字母表中会有爱尔兰语中没有的字母？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "祝大家新年快樂，並特別感謝版主爲我們提供的這段簡短的文字資料。\n語文學的簡短介紹!\n\n我試圖用一種普通讀者可以理解的方式來寫這篇文章。\n的方式來寫，同時也試圖保持相對簡潔，因此\n當然，有些地方我......",
      "title": "星期一的方法。爲什麼在奧格姆字母表中會有愛爾蘭語中沒有的字母？"
    }
  ]
}