{
  "author": "3STmotivation",
  "the_new_excerpt": "The last few months have been quite eventful for uranium investors, with shares\nof companies all across the sector appreciating in value substantially. There\nhave been many reasons why this is the case and it feels different to just being\nstrong seasonality. Below are 15 ‘first time’ things to look…",
  "original_created_utc": 1609677177,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "过去几个月对铀投资者来说是相当多事，股票\n整个行业的公司都在大幅升值。那里\n造成这种情况的原因有很多，感觉就是不同于\n季节性很强。下面是15件“第一次”看起来像…的东西",
      "title": "2021年将是铀投资者难忘的一年(15个强大的催化剂已经到位)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "過去幾個月對鈾投資者來說是相當多事，股票\n整個行業的公司都在大幅升值。那裏\n造成這種情況的原因有很多，感覺就是不同於\n季節性很強。下面是15件“第一次”看起來像…的東西",
      "title": "2021年將是鈾投資者難忘的一年(15個強大的催化劑已經到位)"
    }
  ],
  "title": "2021 will be an unforgettable year for uranium investors (15 powerful catalyst that are in place)",
  "created_utc": 1609695691,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The last few months have been quite eventful for uranium investors, with shares of companies all across the sector appreciating in value substantially. There have been many reasons why this is the case and it feels different to just being strong seasonality. Below are 15 ‘first time’ things to look out for in this sector to start the year with, with full credit going to John Quakes (@quakes99 on Twitter), a retired earth sciences researcher, professor, analyst, writer and one of the best public sources for news about the uranium sector. I share his view that 2021 will prove to be an incredible year for the uranium sector and subsequently for anyone invested in it. Now, onto the aforementioned ‘first times’: </p>\n\n<p>First time entering a new year with uranium already in a record supply deficit, which is set to deepen further with 2 major mines permanently closing this year in Australia and Niger (~7 million pounds, gone). At the same time, demand for nuclear energy has remained strong throughout the COVID-19 pandemic and continues to grow in a global shift to decarbonize industry dependent on fossil fuels.</p>\n\n<p>First time that Cameco, the world’s 2nd largest producer, has begun a new year with every one of its uranium mines in Canada shut down. Both of the world’s 2 largest uranium mines are under care and maintenance, resulting in zero lbs being produced in Canada as we enter 2021. The US is also producing zero lbs while Kazakhstan’s production is at a multi-year low that is likely to continue thru 2022 under the nation’s current flex-down program and pandemic related mining disruptions. All uranium mines in the Ukraine have also been shut down due to the inability of the mine operator to pay the wages of 5000 mine workers.</p>\n\n<p>Fist time that at least 3 of the world’s largest uranium producers are forced into buying uranium on the spot market. Cameco is now the largest spot market buyer in the world. World’s largest producer Kazatomprom is now also a spot buyer, as is French Orano given that heir Canadian mills are suspended and their Cominak mine in Africa is heading for closure in March. Inventory held by the world’s largest uranium producers is at rock bottom levels for the first time ever and in need of replenishment this year.</p>\n\n<p>First time the US has taken steps to support its domestic uranium mining industry by establishing a strategic uranium reserve, a 10 year buying program (1.5 billion dollars total) whereby the US government will purchase, convert and potentially enrich US mined uranium to create an emergency supply for US reactors. Goal is to ensure at least 2 US uranium mining companies remain active and viable during this time when the commodity price of U3O8 is half the cost of production.</p>\n\n<p>First time in several decades that there is strong bipartisan support in the US to rebuild the existing nuclear energy industry and manufacture a new generation of advanced reactors on a global scale, which is seen as a high priority in order to catch up with Russia and China who have become the new world leaders in nuclear energy.</p>\n\n<p>First time that uranium equities have entered a bull market when there is an actual supply deficit. The last bull market saw the price of uranium skyrocket on mine floods and other events that created the ‘fear’ of a supply deficit on the horizon, at a time when the US-Russia Megatons to Megawatts program was still continuing to supply 20m lbs per year to US nuclear utilities, a program that continued until 2021 as the world’s largest virtual uranium mine.</p>\n\n<p>First time that a new year begins with spot market supplies significantly depleted. Supply accessible to carry traders has been severely reduced. Kazatomprom no longer sells any lbs into the spot market and Orano’s supply from Canada and Niger is at a record low level, pushing nuclear utilities to secure new long term contracts with producers rather than entering into shorter term contracts with carry traders. Security of supply is a top priority of utilities (whose inventories are estimated to be around 2,5 years’ worth of supply, when the guideline is to never let it drop below 2-3 years given the long time it takes to enrich and deliver the fuel to the reactors).</p>\n\n<p>First time that US and European nuclear utilities have begun a new year with inventories drawn down below usual safety margins at the same time that mines supply is in a record deficit and global uranium production is at its lowest level in 12 years. The new 2020 IAEA/NEA uranium Red Book projects that secondary supplies will fall in the future as an overdue utility inventory restocking cycle begins, due to higher levels of contracting, conversion and enrichment that will reduce underfeeding as facilities see their utilization rates rise.</p>\n\n<p>First time in several years that there are no geopolitical overhangs holding back the uranium contracting plans of US and European nuclear utilities. There are no potential section 232 actions targeting uranium imports and no sanctions likely against UUN participants (Russia, China, UK, Germany, France) in the JCPOA Iran Nuclear deal. Russia and the US have successfully negotiated a 20-year extension to the Russian Suspension Agreement that will see the US imports from Russia decline over the coming 2 decades. The incoming US administration supports keeping nuclear power plants running and plans to immediately rejoin the Paris Climate Accord, pushing for global net zero emissions by 2050, a process in which nuclear energy will play a major role.</p>\n\n<p>First time that nations around the world will be recovering from a global pandemic with massive infrastructure spending programs that include boosting nuclear capacity to achieve net zero carbon emissions goals. A new ‘nuclear renaissance’ is beginning to take shape on pandemic recovery spending to boost clean energy. The perception of nuclear energy is also changing to that of a safe, reliable, necessary baseload power source that fits with an emerging ESG investing model. Decarbonization has become a new buzz word in the global vocabulary. The ‘electrification of everything’ from cars, buses, trucks and trains to major industry is the new global target. Sustainability of so-called renewables solar and wind is now being called into question after failures by Germany and California to successfully transition to an economy powered by intermittent energy sources. Higher electricity prices, no net carbon emissions reductions and rolling blackouts have demonstrated how ‘renewables’ are not able to fulfill their early promise. This might change with new battery technology and better implementation, but we are nowhere near that point yet.</p>\n\n<p>First time that uranium stocks are entering a new year on the heels of one of their best performance years since the last bull market. The U3O8 spot price is still one-half the global average cost of production that will incentivize new mines to be built this decade. This signals to investors that we are still at the opening pitch of the first inning of a long game yet to play out. A necessary doubling of the U3O8 commodity price is yet to come.</p>\n\n<p>First time that Canada has begun a new year embarking on a small modular reactors build-out program with several provinces pledging to deploy SMR’s to power remote communities, mines and industrial heat applications in the energy industry.</p>\n\n<p>First time that nuclear is being viewed as the ideal carbon free high-temperature power source to produce clear hydrogen fuel. US, Russia, Japan and others are looking to leverage their existing nuclear power capacity to produce hydrogen and build high-temperature SMR’s to optimize the use of emissions free nuclear to produce zero emissions hydrogen.</p>\n\n<p>First time in decades that there is an emerging surge in acceptance of nuclear  of nuclear energy as necessary to achieve zero carbon emissions goals, with countries like the Netherlands looking to add more capacity after conducting studies showing nuclear is safer and cheaper than variable renewable energy.</p>\n\n<p>First time I can recall one of the leading nuclear fuel consultants UxC reporting to their subscribers that uranium is in a 57M lbs mined supply deficit, that utility and supplier inventories are “declining at a rapid rate” just as global fuel demand growth is accelerating, a clear signal that a bull market is getting underway.</p>\n\n<p>TLDR: with all the catalysts that are in place, I am of the firm believe that uranium related equities, namely the developers and explorers, will offer returns that will outperform any other broad investment asset class/sector in the market. This is a bold claim to make, but I can’t see any other opportunity that offers even close to the same risk vs reward the uranium sector offers. Read my other posts on the subject to get an idea of what companies you might want to look at and to get an answer to any question you might have. Good luck and here is to a great new year!</p>\n</div><!-- SC_ON -->",
  "score": 431,
  "permalink": "/r/investing/comments/kpjvhs/2021_will_be_an_unforgettable_year_for_uranium/",
  "subreddit": "investing",
  "id": "kpjvhs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610100747519
}