{
  "author": "Set1Less",
  "the_new_excerpt": "Why did we gate keep new users with age and karma restrictions for so long, only\nto now allow all new users to just buy their way to sub membership and post\nfreely here if they are willing to spend a few bucks? This is terrible for the\nfuture of the sub.\n\nAlso 1000 Moons ($50) vs $5 makes no sense.…",
  "original_created_utc": 1616470042,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "为什么我们门将新用户的年龄和业力限制保留了这么久，只有\n以至于现在所有新用户只需买到子会员的方式，就可以发帖了\n如果他们愿意花几块钱，就可以在这里自由地使用？这是可怕的\n子的未来。\n\n另外1000月亮(50元)与5元没有意义....。",
      "title": "用户用Moons购买特殊会员，成为免于年龄/业力限制的会员，这是一个可怕的举动!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "爲什麼我們門將新用戶的年齡和業力限制保留了這麼久，只有\n以至於現在所有新用戶只需買到子會員的方式，就可以發帖了\n如果他們願意花幾塊錢，就可以在這裏自由地使用？這是可怕的\n子的未來。\n\n另外1000月亮(50元)與5元沒有意義....。",
      "title": "用戶用Moons購買特殊會員，成爲免於年齡/業力限制的會員，這是一個可怕的舉動!"
    }
  ],
  "title": "Users buying special membership with Moons to become exempt from age/karma restrictions is a terrible move!",
  "created_utc": 1616499374,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Why did we gate keep new users with age and karma restrictions for so long, only to now allow all new users to just buy their way to sub membership and post freely here if they are willing to spend a few bucks? This is terrible for the future of the sub. </p>\n\n<p>Also 1000 Moons ($50) vs $5 makes no sense. Anyone will be willing to spend $5, spin up hundreds of accounts, purchase special membership and shill their coins here. This proposal was clearly not thought through, nor was it voted by the people here. While we are constantly voting on proposals to make the quality of the sub better, we are hit by one proposal that seeks to undo all the good stuff we have done here lately. </p>\n\n<p>Its not that hard to get some reddit karma if one contributes good stuff. But now with this special membership, any shill can post their low quality stuff just by buying their way in!</p>\n\n<p>It should be rolled back immediately and people should actually vote for such proposals if they are to pass and become the new rules.</p>\n</div><!-- SC_ON -->",
  "score": 325,
  "permalink": "/r/CryptoCurrency/comments/mb5ho4/users_buying_special_membership_with_moons_to/",
  "subreddit": "CryptoCurrency",
  "id": "mb5ho4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752816917
}