{
  "author": "MolotovCollective",
  "original_created_utc": 1635804142,
  "title": "Could your typical soldier in an 18th or early 19th century firing line do anything to increase their odds of survival in battle short of running away? Standing in a rigid line, it seems like nothing except pure luck could keep you safe from a bullet or a cannonball.",
  "created_utc": 1635829139,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Up front disclaimer: simply due to keeping the title a decent length I couldn’t specify that I’m fully aware that in most battles, the large majority or soldiers would be unhurt, and that usually a battle is won after a relatively small portion of the force is killed or wounded. I’m not suggesting that standing in a line is an instant death sentence, only that it seems like your fate is entirely in the hands of pure luck.</p>\n\n<p>All that said, I’m wondering this because I recently heard in a video saying that linear warfare would arguably be the worst era to be a soldier in, because unlike previous periods, skill made no impact on your survival. </p>\n\n<p>They explained that in earlier periods, while sure bad luck might have you get hit in the face by an unseen arrow, that at least skill with your weapon might increase your odds in a melee.</p>\n\n<p>Likewise, in later periods knowing when to use cover, when to return fire, when to bound etc. might not save you from an unlucky mortar, but it might help keep you from getting shot, or help keep that mortar team from pinpointing your location.</p>\n\n<p>But if I’m just some random line infantryman standing in my spot on the firing line, shoulder to shoulder with the guy next to me and no where to move to, it seems like there’s nothing I could do to up my chances than to run away, or somehow personally outshoot the enemy company across from me by such a margin that they can’t shoot back, but that seems impossible.</p>\n</div><!-- SC_ON -->",
  "score": 109,
  "permalink": "/r/AskHistorians/comments/qkp0es/could_your_typical_soldier_in_an_18th_or_early/",
  "subreddit": "AskHistorians",
  "id": "qkp0es",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Up front disclaimer: simply due to keeping the title a decent length I couldn’t\nspecify that I’m fully aware that in most battles, the large majority or\nsoldiers would be unhurt, and that usually a battle is won after a relatively\nsmall portion of the force is killed or wounded. I’m not suggesting…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "前置きが長くなりましたが、タイトルの長さを保つために、私は、私が完全に待ち望んでいることを明記できませんでした。\n大半の戦闘では、大多数の兵士が無傷であり、通常、戦闘に勝利するのは親密な関係の後であるということを\n大半の兵士は無傷であり、通常は比較的少数の兵士が死傷した後に戦闘に勝利するものであることを\nまた、通常、戦闘に勝利するのは、比較的少数の部隊が死傷した後であることを十分に認識しています。私が言いたいのは...",
      "title": "18世紀から19世紀初頭の銃撃戦に参加した典型的な兵士は、戦闘で生き残る確率を高めるために、逃げ出さない限り何もできなかったのでしょうか？射線上に立っていると、銃弾や大砲の弾から身を守るには、純粋な運以外には何もないように思えます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "前面的免责声明：仅仅是为了保持标题的适当长度，我不能说明\n我完全知道，在大多数战斗中，大多数士兵都不会受伤。\n士兵不会受伤，而且通常情况下，一场战斗在相对较少的士兵受伤后就会取得胜利。\n而通常情况下，一场战役的胜利是在相对较小的一部分部队伤亡后取得的。我不是在建议...",
      "title": "在18世纪或19世纪初的火线上，除了逃跑之外，你的典型士兵能做什么来增加他们在战斗中的生存几率吗？站在严格的队列中，除了纯粹的运气外，似乎没有什么能让你免受子弹或炮弹的伤害。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "前面的免責聲明：僅僅是爲了保持標題的適當長度，我不能說明\n我完全知道，在大多數戰鬥中，大多數士兵都不會受傷。\n士兵不會受傷，而且通常情況下，一場戰鬥在相對較少的士兵受傷後就會取得勝利。\n而通常情況下，一場戰役的勝利是在相對較小的一部分部隊傷亡後取得的。我不是在建議...",
      "title": "在18世紀或19世紀初的火線上，除了逃跑之外，你的典型士兵能做什麼來增加他們在戰鬥中的生存機率嗎？站在嚴格的隊列中，除了純粹的運氣外，似乎沒有什麼能讓你免受子彈或炮彈的傷害。"
    }
  ]
}