{
  "author": "premeddit",
  "original_created_utc": 1630024334,
  "title": "Before European contact, did the native Hawaiians know that the rest of the world existed?",
  "created_utc": 1630071703,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My understanding is that Hawaii was settled in one or two waves from Polynesia, and after that basically became it’s own little ecosystem until Captain Cook arrived.</p>\n\n<p>Between the original settlement and contact with Europeans, did Hawaiians still have a cultural memory of places like Asia and Polynesia? Or was this lost and they believed that Hawaii was the whole world?</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/AskHistorians/comments/pccaqc/before_european_contact_did_the_native_hawaiians/",
  "subreddit": "AskHistorians",
  "id": "pccaqc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My understanding is that Hawaii was settled in one or two waves from Polynesia,\nand after that basically became it’s own little ecosystem until Captain Cook\narrived.\n\nBetween the original settlement and contact with Europeans, did Hawaiians still\nhave a cultural memory of places like Asia and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の理解では、ハワイはポリネシアから1〜2回の波で移住してきたと考えています。\nその後、キャプテン・クックが到着するまで、ハワイは独自の小さな生態系を形成していました。\nキャプテン・クックが到着するまで、ハワイは独自の生態系を保っていたと理解しています。\n\n最初の入植からヨーロッパ人との接触までの間、ハワイの人々はアジアや......などの文化的記憶を持っていたのでしょうか？\nハワイの人々はアジアやヨーロッパの文化的な記憶を持っていたのでしょうか？",
      "title": "ヨーロッパとの接触以前、ハワイの先住民は世界の存在を知っていたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的理解是，夏威夷是由波利尼西亚分一到两波定居的。\n在那之后，夏威夷基本上成了它自己的小生态系统，直到库克船长到来。\n抵达。\n\n在最初的定居和与欧洲人接触之间，夏威夷人是否还有\n对亚洲等地的文化记忆和...",
      "title": "在与欧洲人接触之前，夏威夷本地人知道世界其他地方的存在吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的理解是，夏威夷是由波利尼西亞分一到兩波定居的。\n在那之後，夏威夷基本上成了它自己的小生態系統，直到庫克船長到來。\n抵達。\n\n在最初的定居和與歐洲人接觸之間，夏威夷人是否還有\n對亞洲等地的文化記憶和...",
      "title": "在與歐洲人接觸之前，夏威夷本地人知道世界其他地方的存在嗎？"
    }
  ]
}