{
  "author": "NobelStudios",
  "the_new_excerpt": "So, I started investing in the stock market in the beggining of this year. All\ngreat.\nUntil 28th of January, where It became fully transparent the market\nmanipulation.\n\nIm still a GME shareholder and what happened in front of my eyes, and is still\nhappening since, was what brought me to the crypto…",
  "original_created_utc": 1616102540,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "于是，我在今年年初开始投资股市。所有\n大。\n直到1月28日，它成为完全透明的市场。\n操纵。\n\n我仍然是GME的股东，发生在我眼前的事情，现在仍然是。\n发生以来，是什么让我对加密... ...",
      "title": "有人因为GameStop的市场操纵而加入加密货币吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "於是，我在今年年初開始投資股市。所有\n大。\n直到1月28日，它成爲完全透明的市場。\n操縱。\n\n我仍然是GME的股東，發生在我眼前的事情，現在仍然是。\n發生以來，是什麼讓我對加密... ...",
      "title": "有人因爲GameStop的市場操縱而加入加密貨幣嗎？"
    }
  ],
  "title": "Anyone in crypto because of GameStop's Market Manipulation?",
  "created_utc": 1616115709,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So, I started investing in the stock market in the beggining of this year. All great.<br/>\nUntil 28th of January, where It became fully transparent the market manipulation.</p>\n\n<p>Im still a GME shareholder and what happened in front of my eyes, and is still happening since, was what brought me to the crypto world. I believe many more people felt the same way I did. Blockchain seems to be able to stop this. On that day, I learned something SUPER IMPORTANT:</p>\n\n<p>&#x200B;</p>\n\n<h1>NOTHING WILL BE ABLE TO STOP DEFI AND CRYPTO</h1>\n\n<p>&#x200B;</p>\n\n<p>Since Im new here, what do you think about my portfolio?<br/>\n<strong>BTC, ETH &amp; BAT</strong> are the ones Im in already.<br/>\n<strong>BEPRO and ADA</strong> are the ones on my watchlist.</p>\n</div><!-- SC_ON -->",
  "score": 584,
  "permalink": "/r/CryptoCurrency/comments/m812ln/anyone_in_crypto_because_of_gamestops_market/",
  "subreddit": "CryptoCurrency",
  "id": "m812ln",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752815283
}