{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "It reminds me of browsing this sub exactly 2 years ago (all over again). At that time, while we were dropping during covid the overwhelming consensus was \"This is just the beginning of the mother of all crashes\" and \"Crash? The stock has only down to where it was in 2016. We're going a lot lower, like pre-financial crisis levels\"\nNow I'm seeing comments going beyond the usual \"50% drop from here\" fearmongering and some people saying utterly extreme comments like \"US will actually collapse like to Roman empire. It has to someday\". \n\nOne thing I learned in Mar. 2020 was that a lot of the bears and doomsayers also had puts. I'm not saying the market won't go down from here, but just be mindful of the agenda of people who post here and the fact they have an interest in things panning out this way. Take things with a grain of salt. Wsb was wrong before, and they'll likely be wrong again. I know this sub isn't wsb, but there's a lot of leakage. Most wsb users would also browse here obviously.\n\nThis sub also has strong herd mentality. Latching on to whatever has been going up recently (or at least hasn't going down). The new darling of the sub seems to be BRK.B for that very reason. Few months ago, it was NVDA (don't hear much about it now). Now obviously oil and commodities are what you should be in (despite having had poor returns over last decades, but yeah let's all pile in after a big spike).\n\nTruth is, this is mostly an echo chamber of what's \"cool\" right now and telling everyone what they should've been in all along.\n\nRemember, if we'd listened to the hivemind before, we'd have gone all in ARKK this time last year.\nWe'd have bought puts right before the biggest bull in run this time 2 years ago.",
  "author_fullname": "t2_ecfjlj9n",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "The current hivemind and why you should be careful",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_tc8qmg",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.81,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 42,
  "total_awards_received": 1,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 42,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": true,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {
    "gid_1": 1
  },
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1647060600,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It reminds me of browsing this sub exactly 2 years ago (all over again). At that time, while we were dropping during covid the overwhelming consensus was &amp;quot;This is just the beginning of the mother of all crashes&amp;quot; and &amp;quot;Crash? The stock has only down to where it was in 2016. We&amp;#39;re going a lot lower, like pre-financial crisis levels&amp;quot;\nNow I&amp;#39;m seeing comments going beyond the usual &amp;quot;50% drop from here&amp;quot; fearmongering and some people saying utterly extreme comments like &amp;quot;US will actually collapse like to Roman empire. It has to someday&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;One thing I learned in Mar. 2020 was that a lot of the bears and doomsayers also had puts. I&amp;#39;m not saying the market won&amp;#39;t go down from here, but just be mindful of the agenda of people who post here and the fact they have an interest in things panning out this way. Take things with a grain of salt. Wsb was wrong before, and they&amp;#39;ll likely be wrong again. I know this sub isn&amp;#39;t wsb, but there&amp;#39;s a lot of leakage. Most wsb users would also browse here obviously.&lt;/p&gt;\n\n&lt;p&gt;This sub also has strong herd mentality. Latching on to whatever has been going up recently (or at least hasn&amp;#39;t going down). The new darling of the sub seems to be BRK.B for that very reason. Few months ago, it was NVDA (don&amp;#39;t hear much about it now). Now obviously oil and commodities are what you should be in (despite having had poor returns over last decades, but yeah let&amp;#39;s all pile in after a big spike).&lt;/p&gt;\n\n&lt;p&gt;Truth is, this is mostly an echo chamber of what&amp;#39;s &amp;quot;cool&amp;quot; right now and telling everyone what they should&amp;#39;ve been in all along.&lt;/p&gt;\n\n&lt;p&gt;Remember, if we&amp;#39;d listened to the hivemind before, we&amp;#39;d have gone all in ARKK this time last year.\nWe&amp;#39;d have bought puts right before the biggest bull in run this time 2 years ago.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "tc8qmg",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "waterlimes",
  "discussion_type": null,
  "num_comments": 38,
  "send_replies": false,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/tc8qmg/the_current_hivemind_and_why_you_should_be_careful/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/tc8qmg/the_current_hivemind_and_why_you_should_be_careful/",
  "subreddit_subscribers": 3736514,
  "created_utc": 1647071807,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1647060600,
  "the_new_excerpt": "It reminds me of browsing this sub exactly 2 years ago (all over again). At that\ntime, while we were dropping during covid the overwhelming consensus was \"This\nis just the beginning of the mother of all crashes\" and \"Crash? The stock has\nonly down to where it was in 2016. We're going a lot lower,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ちょうど2年前にこのサブサイトを閲覧したことを思い出します（繰り返し）。その時\n当時、コビドを落としている最中、圧倒的なコンセンサスは「これは\nクラッシュの始まりに過ぎない」「クラッシュ？株価は\n2016年の時点までしか下がらない。もっともっと下がるんだ、、、。",
      "title": "現在のハイブマインドと注意すべき理由"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这让我想起了两年前浏览这个子网站的情景（重新开始）。在那个时候\n当时，当我们在covid期间下降时，压倒性的共识是 \"这只是所有崩溃之母的开始 \"和 \"崩溃？\n只是所有崩溃之母的开始 \"和 \"崩溃？该股已经\n只下降到2016年的水平。我们会跌得更多，...",
      "title": "当前的蜂拥而至以及为什么你应该小心翼翼"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這讓我想起了兩年前瀏覽這個子網站的情景（重新開始）。在那個時候\n當時，當我們在covid期間下降時，壓倒性的共識是 \"這只是所有崩潰之母的開始 \"和 \"崩潰？\n只是所有崩潰之母的開始 \"和 \"崩潰？該股已經\n只下降到2016年的水平。我們會跌得更多，...",
      "title": "當前的蜂擁而至以及爲什麼你應該小心翼翼"
    }
  ]
}