{
  "author": "55_jumbo",
  "original_created_utc": 1639415053,
  "title": "Metavers is nonsense if you are already poor in virtual universe",
  "created_utc": 1639438267,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I thought a virtual universe is where your dreams come true. You can be anyone and do anything you want. You can have anything you want.&lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t buy a Lamborghini in real life, fine I drive my virtual Lamborghini.&lt;/p&gt;\n\n&lt;p&gt;If I dont own a house in real world, I could have the biggest house, a Kardashian house, in the virtual universe.&lt;/p&gt;\n\n&lt;p&gt;But if I have to pay as much as a real property to buy a virtual one, then whats the benefit. If it is still too expensive, and i have to work my ass off to be able to have nice things in virtual universe then whats the fun? Then its not a game, its just another market for companies to sell their products, well virtual products.\nRight now metavers games are not fun, you have to work for every thing.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 175,
  "permalink": "/r/CryptoCurrency/comments/rfkg44/metavers_is_nonsense_if_you_are_already_poor_in/",
  "subreddit": "CryptoCurrency",
  "id": "rfkg44",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I thought a virtual universe is where your dreams come true. You can be anyone\nand do anything you want. You can have anything you want.\n\nI can't buy a Lamborghini in real life, fine I drive my virtual Lamborghini.\n\nIf I dont own a house in real world, I could have the biggest house, a\nKardashian…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "仮想宇宙は夢を叶える場所なんだと思いました。誰にでもなれる\n何でもできる。欲しいものは何でも手に入ります。\n\n現実ではランボルギーニを買えないけど、バーチャルではランボルギーニに乗れる。\n\n現実の世界で家を持てなくても、一番大きな家や\nカーダシアン...",
      "title": "仮想世界ですでに貧乏になっている人がメタバーを使うのはナンセンス"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我以为虚拟宇宙是你梦想成真的地方。你可以成为任何人\n并做任何你想做的事。你可以拥有你想要的任何东西。\n\n我不能在现实生活中买一辆兰博基尼，但我可以驾驶我的虚拟兰博基尼。\n\n如果我在现实世界中没有房子，我可以拥有最大的房子，一个\n卡戴珊...",
      "title": "如果你在虚拟世界中已经是穷人，那么Metavers就是无稽之谈。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我以爲虛擬宇宙是你夢想成真的地方。你可以成爲任何人\n並做任何你想做的事。你可以擁有你想要的任何東西。\n\n我不能在現實生活中買一輛蘭博基尼，但我可以駕駛我的虛擬蘭博基尼。\n\n如果我在現實世界中沒有房子，我可以擁有最大的房子，一個\n卡戴珊...",
      "title": "如果你在虛擬世界中已經是窮人，那麼Metavers就是無稽之談。"
    }
  ]
}