{
  "author": "joanmiro",
  "original_created_utc": 1625827526,
  "title": "I'm building a web directory called internetguzeldir.com",
  "created_utc": 1625838845,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In recent years, the Internet looks like a huge shopping mall. With pictures such as large, bright, giant, with round corners.</p>\n\n<p>The scene is beautiful, but the content is being more and more unsatisfying. We are swimming in the sea of websites that are driven by algorithms. The only purpose of these algorithms is to make us spend more time on their websites.</p>\n\n<p>Every day I find myself scrolling the Instagram homepage to the bottom of the pensive eyes.</p>\n\n<p>So I wanted to create a website with old school, human-driven, quality first link directory.</p>\n\n<p>Website at <a href=\"https://internetguzeldir.com\">https://internetguzeldir.com</a> and It&#39;s in Turkish. Probably you will not understand what&#39;s inside unless you don&#39;t use google translate but it&#39;s not important. I want to share my feelings:</p>\n\n<p>&#x200B;</p>\n\n<ol>\n<li>İnternet Güzeldir means &quot;Internet is beautiful&quot; in Turkish. I love my domain name.</li>\n<li><strong>Fuck market research</strong>, I want to build a thing that I want to.</li>\n<li><strong>Fuck the income model,</strong> I want to build a thing that I want to.</li>\n<li><strong>Fuck web2.0</strong>, I&#39;m selecting links by myself. The only option to add a link is a recommendation form.</li>\n<li><strong>Fuck fancy frontend frameworks</strong>, I&#39;m using plain HTML and CSS. Because it&#39;s more fun for me.</li>\n<li><strong>Fuck fancy design trends</strong>, I&#39;m designing it as a Dos program. Because I like that in this way.</li>\n<li><strong>Fuck fancy CMS systems</strong>, database technologies. Using a <a href=\"https://docs.google.com/spreadsheets/d/1mK5BycfvwvuPcekTKIMhPKtsRa0EXe-dGeQsvok5wz4/edit?usp=sharing\">spreadsheet</a> and a <a href=\"https://github.com/miratcan/internetguzeldir/blob/master/rebuild.py\">Python script</a> to build the whole website.</li>\n<li><strong>Fuck fancy server infrastructures,</strong> I&#39;m building a static website and hosting it on Github pages.</li>\n</ol>\n\n<p>I hope you all get the opportunity to build something you want the way you want it.</p>\n\n<p>Have a Nice Day.</p>\n</div><!-- SC_ON -->",
  "score": 6,
  "permalink": "/r/SideProject/comments/ogt0ll/im_building_a_web_directory_called/",
  "subreddit": "SideProject",
  "id": "ogt0ll",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In recent years, the Internet looks like a huge shopping mall. With pictures\nsuch as large, bright, giant, with round corners.\n\nThe scene is beautiful, but the content is being more and more unsatisfying. We\nare swimming in the sea of websites that are driven by algorithms. The only\npurpose of these…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "近年、インターネットは巨大なショッピングモールのようになっています。写真で\n大きくて、明るくて、巨大で、角が丸い。\n\nその光景は美しいですが、コンテンツはますます満足のいくものではなくなってきています。私たちは\nアルゴリズムで動くウェブサイトの海の中を泳いでいる。唯一の目的は\nこれらの目的は...",
      "title": "Internetguzeldir.comというウェブディレクトリを作っています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "近年来，互联网看起来像一个巨大的购物中心。有图片\n如大型、明亮、巨大、有圆角。\n\n场景很美，但内容却越来越不令人满意。我们\n我们正游走在由算法驱动的网站海洋中。这些网站的唯一\n这些网站的唯一目的...",
      "title": "我正在建立一个名为internetguzeldir.com的网站目录。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "近年來，互聯網看起來像一個巨大的購物中心。有圖片\n如大型、明亮、巨大、有圓角。\n\n場景很美，但內容卻越來越不令人滿意。我們\n我們正遊走在由算法驅動的網站海洋中。這些網站的唯一\n這些網站的唯一目的...",
      "title": "我正在建立一個名爲internetguzeldir.com的網站目錄。"
    }
  ]
}