{
  "author": "TroutFishingInCanada",
  "original_created_utc": 1629908969,
  "title": "“NFTs are for money laundering” is the new “Cryptocurrency is for illicit dark web transactions” - You’ve become everything you hate.",
  "created_utc": 1629945409,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It’s true that the use for NFTs is, as of now, largely confined to novelties. JPEGs of which an identical copy is available for free being bought for hundreds of thousands of dollars really does seem silly. But this attitude is just as dismissive as many had in the earlier days of cryptocurrency. </p>\n\n<p>The NFT is still new technology and social phenomenon. It’s not surprising or historically unprecedented that it is still a toy in the playground of the wealthy. Nor is it surprising or historically unprecedented that the wealthy are using new technology as a toy.</p>\n\n<p>More practical uses for NFTs are being developed and will be developed. </p>\n\n<p>Additionally, NFTs are currently inextricably linked to cryptocurrency as a whole and are, as far as I know, purchased almost exclusively with cryptocurrency. They are also making some of the biggest news in cryptocurrency lately. This “NFT = money laundering” discourse is implicitly “cryptocurrency = money laundering”, and I don’t think that’s a line of thought we want to push at this time.</p>\n</div><!-- SC_ON -->",
  "score": 191,
  "permalink": "/r/CryptoCurrency/comments/pbesw6/nfts_are_for_money_laundering_is_the_new/",
  "subreddit": "CryptoCurrency",
  "id": "pbesw6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It’s true that the use for NFTs is, as of now, largely confined to novelties.\nJPEGs of which an identical copy is available for free being bought for hundreds\nof thousands of dollars really does seem silly. But this attitude is just as\ndismissive as many had in the earlier days of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "確かにNFTの用途は、今のところ目新しいものに限られています。\n同じものがタダで手に入るJPEGが何百円で買える。\n何十万円もするものを買うのは、本当に馬鹿げていると思います。しかし、この姿勢は\nしかし、このような態度は、初期の......の頃に多くの人が抱いていた否定的な態度と同じです。",
      "title": "\"NFTはマネーロンダリングのため \"は新しい \"暗号通貨は不正なダークウェブ取引のため \"です - あなたは自分の嫌いなものすべてになってしまいました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "诚然，到目前为止，NFT的使用在很大程度上局限于新产品。\n一个完全相同的副本可以免费获得的JPEG文件被以几十万美元的价格买下\n价值几十万美元的JPEG文件似乎真的很愚蠢。但这种态度就像\n但这种态度就像许多人在早期的时候一样不屑一顾......",
      "title": "\"NFT是为了洗钱 \"是新的 \"加密货币是为了非法的暗网交易\"--你已经变成了你所讨厌的一切。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "誠然，到目前爲止，NFT的使用在很大程度上侷限於新產品。\n一個完全相同的副本可以免費獲得的JPEG文件被以幾十萬美元的價格買下\n價值幾十萬美元的JPEG文件似乎真的很愚蠢。但這種態度就像\n但這種態度就像許多人在早期的時候一樣不屑一顧......",
      "title": "\"NFT是爲了洗錢 \"是新的 \"加密貨幣是爲了非法的暗網交易\"--你已經變成了你所討厭的一切。"
    }
  ]
}