{
  "author": "LegendarySwag",
  "original_created_utc": 1658931307,
  "title": "As a scientist myself, I am constantly amused and appalled by the seeming total lack of safety in “old timey science”. How have ideas and practices regarding safety evolved over time in science?",
  "created_utc": 1658982746,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The image of an old school scientist wearing a wool suit and smoking while mouth pipetting some deadly chemical is a bit of a meme in the scientific community. Not to mention scientists strapping ampules of radium to their arms to observe the radiation burns or chemists listing “taste” among the properties of newly discovered compounds.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 107,
  "permalink": "/r/AskHistorians/comments/w9fwo8/as_a_scientist_myself_i_am_constantly_amused_and/",
  "subreddit": "AskHistorians",
  "id": "w9fwo8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The image of an old school scientist wearing a wool suit and smoking while mouth\npipetting some deadly chemical is a bit of a meme in the scientific community.\nNot to mention scientists strapping ampules of radium to their arms to observe\nthe radiation burns or chemists listing “taste” among the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ウールのスーツを着て、タバコを吸いながら、致命的な化学物質を口に含んでいる昔の科学者のイメージ。\n科学界ではちょっとしたミームになっている。\nラジウムのアンプルを腕に縛り付けて火傷を観察する科学者や、アンプルに「味」と書いてある化学者は言うまでもない。\n化学者が \"味覚 \"という言葉を並べるのも、そのためだ。",
      "title": "私自身、科学者の端くれとして、「昔の科学」には安全性がまったくないように見えることに、いつも驚きと呆れを感じています。科学における安全に関する考え方や習慣は、時代とともにどのように変化してきたのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "一个老派科学家的形象，穿着羊毛衫，一边抽烟一边嘴里念念有词。\n嘴里吸着一些致命的化学品的老派科学家的形象在科学界有点像一个备忘录。\n更不用说科学家们把镭的安瓿绑在手臂上进行观察了。\n辐射烧伤，或者化学家把 \"味道 \"列在...",
      "title": "作为一名科学家，我一直对 \"老式科学 \"中似乎完全缺乏安全感感到好笑和震惊。随着时间的推移，科学中关于安全的想法和做法是如何演变的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "一個老派科學家的形象，穿着羊毛衫，一邊抽菸一邊嘴裏唸唸有詞。\n嘴裏吸着一些致命的化學品的老派科學家的形象在科學界有點像一個備忘錄。\n更不用說科學家們把鐳的安瓿綁在手臂上進行觀察了。\n輻射燒傷，或者化學家把 \"味道 \"列在...",
      "title": "作爲一名科學家，我一直對 \"老式科學 \"中似乎完全缺乏安全感感到好笑和震驚。隨着時間的推移，科學中關於安全的想法和做法是如何演變的？"
    }
  ]
}