{
  "author": "anon8496847385",
  "the_new_excerpt": "I have lost count of the times I have seen people comment saying BTC and ETH are\ntoo expensive to invest in and it does not make financial sense to invest in\nsomething valued so high. This is generally followed up by individuals saying it\nis more worthwhile and financially sound to invest in…",
  "original_created_utc": 1620244528,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "BTCやETHは投資するには高すぎるし、経済的にも意味がないと言っている人を何度も見たことがあります。\n投資するには高すぎるし、そんなに価値のあるものに投資するのは経済的に意味がない。\nというコメントを見たことがあります。これに続いて、個人が次のように言っています。\n投資する価値があり、財務的にも健全であると言っています...",
      "title": "初心者のための暗号通貨における最大の誤解の一つ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我已经数不清有多少次看到有人评论说BTC和ETH太贵了，不适合投资。\n投资太贵了，而且投资于价值这么高的东西在经济上没有意义。\n价值如此之高的东西。这通常是由个人跟进的，说它\n投资BTC和ETH更有价值，在财务上更合理...",
      "title": "加密货币中针对新手的最大误解之一"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我已經數不清有多少次看到有人評論說BTC和ETH太貴了，不適合投資。\n投資太貴了，而且投資於價值這麼高的東西在經濟上沒有意義。\n價值如此之高的東西。這通常是由個人跟進的，說它\n投資BTC和ETH更有價值，在財務上更合理...",
      "title": "加密貨幣中針對新手的最大誤解之一"
    }
  ],
  "title": "One of the biggest misconceptions in Cryptocurrency for newbies",
  "created_utc": 1620253885,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have lost count of the times I have seen people comment saying BTC and ETH are too expensive to invest in and it does not make financial sense to invest in something valued so high. This is generally followed up by individuals saying it is more worthwhile and financially sound to invest in cryptocurrencies under $1. There is a believe that this will have a chance of doing what BTC did and 50000x in price. This is of course fundamentally flawed. </p>\n\n<p>There is only 1 area of this logic that I can agree with. It is similar to small cap stocks/penny stocks. They have MORE room to grow in the sense they are VERY early on and if it is an extremely solid project and marketed right, this has more financial reward. HOWEVER, and this is a monstrous HOWEVER, actually successfully picking this gem of a project is extremely difficult and the sheer number of these projects that are scams, shitcoins is high. Look at the number of alt coins from the 2017/2018 bull that have disappeared and they were highly regarded in the space. And even if you pick a fantastic project, it doesn&#39;t even mean it will succeed. People leave jobs, marketing fails, the public don&#39;t invest etc. </p>\n\n<p>Ultimately, it doesn&#39;t matter what the price of the cryptocurrency is. You don&#39;t have to buy a WHOLE BTC or ETH. if you have 1 BTC or 0.01 BTC, a 100% gain is still double your money. This is the same for a 100% gain in BTC valued at $57000 or VET valued at $0.20. Both would net you the same profit. And no, VET is never going to get to the same price as BTC, that would literally require astronomical amounts of investment to do. </p>\n\n<p>If you are a new investor, and actively investing in this space. Please don&#39;t make this mistake. Don&#39;t let greed and a fantasy of a better life blind you from reality. A low-price coin does not give you better odds of making better returns, more often than not, I&#39;d actually argue it will give you less.</p>\n</div><!-- SC_ON -->",
  "score": 871,
  "permalink": "/r/CryptoCurrency/comments/n5oxyp/one_of_the_biggest_misconceptions_in/",
  "subreddit": "CryptoCurrency",
  "id": "n5oxyp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380965852
}