{
  "author": "kthebakerman",
  "original_created_utc": 1630887946,
  "title": "Actual Unpopular Opinion: there is a *chance* that we are NOT early and crypto never reaches mainstream adoption",
  "created_utc": 1630895818,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m not saying I believe this will be the case. In fact I believe the chances are greatly in favor of crypto. But it’s certainly <em>possible</em> that crypto doesn’t make it.</p>\n\n<p>This sub is full of optimism and hope which is great for the hopium levels but let’s not fool ourselves into thinking that crypto adoption by the wider society is inevitable. It’s not. It’s entirely possible that it just never reaches it mainstream (like MANY technological advancements and inventions have failed to do).</p>\n\n<p>I’m still bullish, however. But I just thought this sub could us an actual unpopular opinion.</p>\n\n<p>Bring on the downvotes.</p>\n</div><!-- SC_ON -->",
  "score": 505,
  "permalink": "/r/CryptoCurrency/comments/pioogp/actual_unpopular_opinion_there_is_a_chance_that/",
  "subreddit": "CryptoCurrency",
  "id": "pioogp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m not saying I believe this will be the case. In fact I believe the chances\nare greatly in favor of crypto. But it’s certainly possible that crypto doesn’t\nmake it.\n\nThis sub is full of optimism and hope which is great for the hopium levels but\nlet’s not fool ourselves into thinking that crypto…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そうなると信じているわけではありません。実際、私はその可能性は\n確率的にはcryptoが有利だと思います。しかし、cryptoが成功しない可能性があるのは確かです。\n可能性はあります。\n\nこのサブ記事は楽観的で希望に満ちていて、それは希望レベルには最適ですが\nしかし、自分自身を騙して、cryptoが...と考えないようにしましょう。",
      "title": "実際の不評な意見：我々が早期ではなく、暗号が主流にならない可能性が*ある。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我并不是说我相信会是这样的情况。事实上，我相信机会\n是大大有利于加密货币的。但是，加密货币当然也有可能无法\n成功。\n\n这篇文章充满了乐观主义和希望，这对希望水平来说是很好的，但\n让我们不要自欺欺人地认为加密货币...",
      "title": "实际的不受欢迎的意见：有一个*的机会，我们不是早期，加密货币永远不会达到主流的采用。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我並不是說我相信會是這樣的情況。事實上，我相信機會\n是大大有利於加密貨幣的。但是，加密貨幣當然也有可能無法\n成功。\n\n這篇文章充滿了樂觀主義和希望，這對希望水平來說是很好的，但\n讓我們不要自欺欺人地認爲加密貨幣...",
      "title": "實際的不受歡迎的意見：有一個*的機會，我們不是早期，加密貨幣永遠不會達到主流的採用。"
    }
  ]
}