{
  "author": "BigTiddyOrc",
  "original_created_utc": 1645841445,
  "title": "Did boomers really have it better or do people view the era through rose tinted glasses?",
  "created_utc": 1645853695,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;There’s a general consensus that boomers grew up in the ideal post war economy where jobs were plentiful and housing was cheap. And they got to reap all the rewards while the younger generation got screwed. I was talking to my uncle about this time and he tells me about the Vietnam draft, nuclear annihilation was always right around the corner because of the Cold War, racism was rampant because of the civil rights movement, poverty was still an issue, etc.&lt;/p&gt;\n\n&lt;p&gt;Did boomers have it better or is it just a generation rivalry thing? Im not agreeing or disagreeing I’m just curious.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 123,
  "permalink": "/r/TooAfraidToAsk/comments/t1l70r/did_boomers_really_have_it_better_or_do_people/",
  "subreddit": "TooAfraidToAsk",
  "id": "t1l70r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "There’s a general consensus that boomers grew up in the ideal post war economy\nwhere jobs were plentiful and housing was cheap. And they got to reap all the\nrewards while the younger generation got screwed. I was talking to my uncle\nabout this time and he tells me about the Vietnam draft, nuclear…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "団塊の世代は、戦後の理想的な経済の中で育ったというのが一般的な見方です。\n仕事がたくさんあって、住宅も安い。そして、彼らはその恩恵をすべて受けることができました。\n若い世代がやられている間に、報酬を得ることができる。叔父と話したのですが\nこの頃、彼はベトナムの徴兵制や核兵器について話してくれたんですが...。",
      "title": "団塊の世代は本当に良かったのか、それともみんなバラ色のメガネで時代を見ているのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "人们普遍认为，婴儿潮一代是在战后的理想经济中长大的\n在那里工作机会很多，住房很便宜。他们得到了所有的回报\n奖励，而年轻一代却被坑了。我和我叔叔谈起这个时候\n他告诉我关于越南的征兵，核...",
      "title": "潮人真的有更好的东西吗？还是人们通过玫瑰色的眼镜来看待这个时代？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "人們普遍認爲，嬰兒潮一代是在戰後的理想經濟中長大的\n在那裏工作機會很多，住房很便宜。他們得到了所有的回報\n獎勵，而年輕一代卻被坑了。我和我叔叔談起這個時候\n他告訴我關於越南的徵兵，核...",
      "title": "潮人真的有更好的東西嗎？還是人們通過玫瑰色的眼鏡來看待這個時代？"
    }
  ]
}