{
  "author": "ChubbyHistorian",
  "original_created_utc": 1635703364,
  "title": "Historians rightly point out that Cortés' invasion of Mexico was incomplete and only possible thanks to native allies. Yet, can we explain the fact that Tlaxcala saw a relatively small force of foreigners as an opportunity to rebel without admitting military superiority on the part of the Spanish?",
  "created_utc": 1635741008,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I ask because I am a high school teacher and am having a hard time articulating an alternative to the simplistic story I was taught (Jared Diamond&#39;s description of the conquest of the Incan Empire showed up in not one but <em>two</em> of my K-12 history classes). I read &quot;Seven Myths of Spanish Conquest&quot; on (<a href=\"/u/400-Rabbits\">/u/400-Rabbits</a> suggestion, shout out the AskHistorians podcast) and came away with what I did not want to teach: the natives did not worship the Europeans, they did not submit as a coherent whole, and European technology was not so overwhelming that they could each slaughter 100 Aztec warriors and come out unscathed.</p>\n\n<p>Yet part of me wants to say, &quot;hey, these European states which have been competing in a military free-for-all have spent 500 years becoming very, very good at killing each other. The reasons for this does not have to do with [race/civilization/rationalism/other garbage], but with hundreds of years of massive state investment. Their armor/tactics/weapons/horses allows a couple hundred guys to act as an extremely potent shock troop in an environment where none of this has been seen before, which is why they found willing native allies.&quot; Therefore, without eliminating native agency, we can also say that an equal number of warriors from, say, a society more similar to Mesoamerica would probably not have been seen as an opportunity. Thus, the technological edge of the Europeans is necessary, but nowhere near sufficient to explain the conquest.</p>\n\n<p>But I find even this level of caveated idea of using &quot;military superiority&quot; uncomfortable, especially since I have not seen a historian explicitly endorse it. (Matthew Restall seems to hint at it, in my opinion, even as he dismantles a more extreme version). The same way excellent users like <a href=\"/u/Iphikrates\">/u/Iphikrates</a> points out (many times, but <a href=\"https://old.reddit.com/r/AskHistorians/comments/9pygz6/at_what_point_did_hoplites_in_greek_history/\">here</a> for example) we should not rank classical military technology linearly, or <a href=\"/u/The_Alaskan\">/u/The_Alaskan</a> <a href=\"https://old.reddit.com/r/AskHistorians/comments/4s49b4/why_were_native_american_civilizations_so_far/\">argues that even 19th century industrial society is not more technologically advanced than indigenous societies</a> (one of my favorite posts of all time), I want to avoid &quot;superior tech&quot; as an explanatory factor unless <em>absolutely forced to</em>.</p>\n\n<p><strong>TL;DR: So what do you all think--how problematic is it to say &quot;Europeans brought unique advantages which allowed them to seem an appealing ally, and many of these were of a military-tech nature&quot;?</strong></p>\n\n<p>(My ideal would be to present this as an open question for students to answer, but I am not a skilled enough teacher yet for that and my past several attempts have bombed hard in an environment when students have had several years of education disrupted. I hope to teach this unit more conventionally, but still propagating as few myths as possible)</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/qjv0j1/historians_rightly_point_out_that_cortés_invasion/",
  "subreddit": "AskHistorians",
  "id": "qjv0j1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I ask because I am a high school teacher and am having a hard time articulating\nan alternative to the simplistic story I was taught (Jared Diamond's description\nof the conquest of the Incan Empire showed up in not one but two of my K-12\nhistory classes). I read \"Seven Myths of Spanish Conquest\" on…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は高校の教師をしていますが、このような質問をするのは簡単ではありません。\n私が教わった単純化されたストーリー（ジャレド・ダイアモンドの記述）に代わるもの。\nインカ帝国の征服は、幼稚園から高校までの間に1回だけでなく2回出てきました。\n歴史の授業)。スペイン征服の7つの神話」を読んだのは...",
      "title": "コルテスのメキシコ侵攻が不完全なものであり、先住民の協力があったからこそ可能であったことは、歴史家が正しく指摘するところである。しかし、トラスカラがスペイン側の軍事的優位を認めることなく、比較的小さな外国人部隊を反乱の機会としてとらえたという事実を説明できるのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我问这个问题是因为我是一名高中教师，我很难表达我的观点。\n在我所学的简单化的故事（贾里德-戴蒙德描述的\n征服印加帝国的描述出现在我的K-12历史课上，而且不是一次，而是两次。\n的历史课上出现过。） 我在《西班牙征服的七个神话》一书中读到...",
      "title": "历史学家正确地指出，科尔特斯对墨西哥的入侵是不完整的，只是由于本地盟友才得以实现。然而，我们能否解释这样一个事实，即特拉斯卡拉将一支相对较小的外国人部队视为一个反叛的机会，而不承认西班牙人的军事优势？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我問這個問題是因爲我是一名高中教師，我很難表達我的觀點。\n在我所學的簡單化的故事（賈裏德-戴蒙德描述的\n征服印加帝國的描述出現在我的K-12歷史課上，而且不是一次，而是兩次。\n的歷史課上出現過。） 我在《西班牙征服的七個神話》一書中讀到...",
      "title": "歷史學家正確地指出，科爾特斯對墨西哥的入侵是不完整的，只是由於本地盟友才得以實現。然而，我們能否解釋這樣一個事實，即特拉斯卡拉將一支相對較小的外國人部隊視爲一個反叛的機會，而不承認西班牙人的軍事優勢？"
    }
  ]
}