{
  "author": "WorkingLime",
  "original_created_utc": 1635941918,
  "title": "Serious question, how do people get so many moons?",
  "created_utc": 1635950195,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi, question as title.</p>\n\n<p>I see a lot of users with more than 10k karma which this month would mean more than 2800 moons, or considering today price, more than 400 USD!</p>\n\n<p>As you probably know I live in Venezuela, where monthly minimum wage is 3 USD and considering some NGO, a 5 members family could &quot;live&quot; with that amount monthly!</p>\n\n<p>But, taking Venezuela out of the question. 400 USD is more than the monthly minimum wage of almost all latin american countries (maybe excluding Panama and Chile!), and this is considering still moons aren&#39;t in the mainnet.</p>\n\n<p>This is almost incredible hehehe!</p>\n</div><!-- SC_ON -->",
  "score": 208,
  "permalink": "/r/CryptoCurrency/comments/qlt7cf/serious_question_how_do_people_get_so_many_moons/",
  "subreddit": "CryptoCurrency",
  "id": "qlt7cf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi, question as title.\n\nI see a lot of users with more than 10k karma which this month would mean more\nthan 2800 moons, or considering today price, more than 400 USD!\n\nAs you probably know I live in Venezuela, where monthly minimum wage is 3 USD\nand considering some NGO, a 5 members family could…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは、タイトル通りの質問です。\n\n10k以上のカルマを持っているユーザーを多く見かけますが、今月だと2800ムーン以上、今日の価格だと400米ドル以上になります\n月に換算すると2800ムーン以上、今日の価格で考えると400ドル以上になります。\n\nご存知だと思いますが、私はベネズエラに住んでいて、月の最低賃金は3ドルです。\nNGOの活動を考慮すると、5人家族の場合は...",
      "title": "真面目な質問ですが、人はどうやってそんなにたくさんの月を手に入れるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好，如标题一样的问题。\n\n我看到很多用户都有超过10K的业力，这意味着这个月有超过\n2800多个月，或者考虑到今天的价格，超过400美元\n\n你可能知道我住在委内瑞拉，那里的月最低工资是3美元。\n考虑到一些非政府组织，一个5人家庭可以...",
      "title": "严肃的问题，人们怎么会有这么多的月亮？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好，如標題一樣的問題。\n\n我看到很多用戶都有超過10K的業力，這意味着這個月有超過\n2800多個月，或者考慮到今天的價格，超過400美元\n\n你可能知道我住在委內瑞拉，那裏的月最低工資是3美元。\n考慮到一些非政府組織，一個5人家庭可以...",
      "title": "嚴肅的問題，人們怎麼會有這麼多的月亮？"
    }
  ]
}