{
  "author": "SadisticArkUser",
  "original_created_utc": 1631718384,
  "title": "Wallet 101: your coins are not in your wallet.",
  "created_utc": 1631741969,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello everyone.</p>\n\n<p>After reading few comments here and there, I realized there might some confusion from time to time regarding wallets, and it&#39;s always a good idea to repeat such an important concept.</p>\n\n<p>A cryptocurrency wallet is a device, physical medium, software or a service which <strong>stores the public and/or private keys</strong> for cryptocurrency transactions. But your coins are not stored in there!</p>\n\n<p>Metamask, Trezor, Trust, Atomic, Daedalus or any of the many others out there are not actual <strong>wallets</strong> as the name suggests. <strong>Your crypto isn&#39;t physically inside</strong> your wallet, but it&#39;s logged in the digital ledger, where it can&#39;t be changed (let&#39;s not go into details here). Your wallet stores your keys and gives you the ability to access the blockchain, where your coins really are.</p>\n\n<p>This is the reason you should never share your private keys with anyone. They are the only way to access your assets on the blockchain. It seems very simple for those who are into crypto for a while, but there might be some confusion regarding this concept.</p>\n\n<p>Have a good day!</p>\n</div><!-- SC_ON -->",
  "score": 163,
  "permalink": "/r/CryptoCurrency/comments/pory5n/wallet_101_your_coins_are_not_in_your_wallet/",
  "subreddit": "CryptoCurrency",
  "id": "pory5n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hello everyone.\n\nAfter reading few comments here and there, I realized there might some confusion\nfrom time to time regarding wallets, and it's always a good idea to repeat such\nan important concept.\n\nA cryptocurrency wallet is a device, physical medium, software or a service\nwhich stores the public…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。\n\nあちこちのコメントを読んでいるうちに、ウォレットに関して時々混乱が生じることがあることに気づきました。\nこのような重要な概念を繰り返すのは常に良いことだと思います。\nこのような重要な概念を繰り返すのは良いことです。\n\n暗号通貨のウォレットとは、公開された暗号通貨を保存する装置、物理的媒体、ソフトウェア、サービスのことです。\nパブリックな...",
      "title": "ウォレット101：あなたのコインは、あなたのウォレットにはありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。\n\n在阅读了一些评论后，我意识到可能会有一些困惑\n我意识到可能会有一些关于钱包的困惑，而重复这样的问题总是一个好主意。\n一个重要的概念。\n\n加密货币钱包是一种设备、物理介质、软件或服务\n它存储了公共的...",
      "title": "钱包101：你的钱币不在你的钱包里。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。\n\n在閱讀了一些評論後，我意識到可能會有一些困惑\n我意識到可能會有一些關於錢包的困惑，而重複這樣的問題總是一個好主意。\n一個重要的概念。\n\n加密貨幣錢包是一種設備、物理介質、軟件或服務\n它存儲了公共的...",
      "title": "錢包101：你的錢幣不在你的錢包裏。"
    }
  ]
}