{
  "author": "creative_octopus",
  "original_created_utc": 1638133295,
  "title": "I built a bot that sends out 5 side project/app ideas every day",
  "created_utc": 1638148125,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I currently working on <a href=\"https://ideabot.io/?from=rsideproj\"><strong>IdeaBot</strong></a> which is a free newsletter that sends out tech product ideas daily for solopreneurs &amp; indie hackers. I hope this sub can benefit from it!</p>\n\n<p><strong>The main reason I built it</strong> is because I would&#39;ve loved something like this when I started hacking together things and didn&#39;t know what to actually create.</p>\n\n<p>I use a pretty cool AI for generating ideas, then I hand-pick the interesting ones. Of course, nowadays AIs are not as good as in the movies, so the ideas are usually more fit to inspire or to help you associate and come up with a more advanced idea.</p>\n\n<p>Today&#39;s report (#23) got sent out a few hours ago, I&#39;ll share the complete list to help you get some ideas on what to expect from the newsletter (today&#39;s ideas were focused on chrome extensions, AI &amp; apps):</p>\n\n<p>&#x200B;</p>\n\n<p>&quot;1. A chrome extension for small business owners that uses AI to write their website copy and product descriptions.&quot;  </p>\n\n<p>&quot;2. A chrome extension that recognizes bot accounts while you browse e.g Reddit, Instagram, etc.&quot;  </p>\n\n<p>&quot;3. An app that allows people to create and share their bucket lists and others (like friends) can donate with a click of a button.&quot;  </p>\n\n<p>&quot;4. An app that uses GPS to track your location and sends you a notification when you are near a place that has a high crime rate.&quot;  </p>\n\n<p>&quot;5. An app that uses AI that lets you create a list of things (e.g projects) to be done, and it automatically breaks the tasks down into smaller tasks, making them easier to complete.&quot;</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://twitter.com/octopyweb\">I also document my journey on twitter if you&#39;re interested</a></p>\n\n<p>If you have any questions or suggestions, feel free to comment below and I&#39;ll answer!</p>\n</div><!-- SC_ON -->",
  "score": 5,
  "permalink": "/r/SideProject/comments/r4e9wg/i_built_a_bot_that_sends_out_5_side_projectapp/",
  "subreddit": "SideProject",
  "id": "r4e9wg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I currently working on IdeaBot [https://ideabot.io/?from=rsideproj] which is a\nfree newsletter that sends out tech product ideas daily for solopreneurs & indie\nhackers. I hope this sub can benefit from it!\n\nThe main reason I built it is because I would've loved something like this when\nI started…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "現在、私はIdeaBot [https://ideabot.io/?from=rsideproj]を作っています。\n無料のニュースレターで、ソロプレナーやインディーハッカー向けに技術製品のアイデアを毎日配信しています。\nのための技術製品のアイデアを毎日送る無料のニュースレターです。このサブがそれによって利益を得られることを願っています\n\n私がこれを作った主な理由は、私が起業したときにこのようなものが欲しかったからです。\n始まったばかりの頃は",
      "title": "毎日5つのサイドプロジェクト/アプリのアイデアを送信するボットを作ってみた"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我目前正在研究IdeaBot[https://ideabot.io/?from=rsideproj]，它是一个\n它是一个免费的通讯，每天向独资企业和独立创客发送科技产品创意。\n黑客。我希望这个子可以从中受益!\n\n我建立它的主要原因是，当我开始工作时，我会喜欢这样的东西。\n我开始...",
      "title": "我建立了一个机器人，每天发送5个副业/应用程序的想法"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我目前正在研究IdeaBot[https://ideabot.io/?from=rsideproj]，它是一個\n它是一個免費的通訊，每天向獨資企業和獨立創客發送科技產品創意。\n黑客。我希望這個子可以從中受益!\n\n我建立它的主要原因是，當我開始工作時，我會喜歡這樣的東西。\n我開始...",
      "title": "我建立了一個機器人，每天發送5個副業/應用程序的想法"
    }
  ]
}