{
  "author": "Linu_s",
  "original_created_utc": 1628979703,
  "title": "Do people actually like Dr Pepper?",
  "created_utc": 1629053266,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Just to clarify I live in Sweden and Dr Pepper is rarely sold here.</p>\n\n<p>I was out shopping in the candy section of the store and saw some Dr Pepper that had been imported from America and was like &quot;Cool, I haven&#39;t tried one of those.&quot;\nSo I buy it and then outside the store I open it, and it was the most VICIOUS, DISGUSTING drink I&#39;ve ever had.</p>\n\n<p>So my question is: Do you all really drink this?</p>\n\n<p>Edit: Some guy was questioning my Swedish authenticity because I said y&#39;all, so I fixed it.</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/NoStupidQuestions/comments/p4hf5v/do_people_actually_like_dr_pepper/",
  "subreddit": "NoStupidQuestions",
  "id": "p4hf5v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Just to clarify I live in Sweden and Dr Pepper is rarely sold here.\n\nI was out shopping in the candy section of the store and saw some Dr Pepper that\nhad been imported from America and was like \"Cool, I haven't tried one of\nthose.\" So I buy it and then outside the store I open it, and it was the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "念のため申し上げますが、私はスウェーデンに住んでおり、ここではドクターペッパーはほとんど売られていません。\n\nお店のお菓子売り場で、アメリカから輸入されたドクターペッパーを見て\nアメリカから輸入されたDr.Pepperを見て、「かっこいい、食べたことないな\nと思って買った。で、買って、店の外で開けてみたら、それが...。",
      "title": "みんなドクターペッパーが好きなの？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "澄清一下，我住在瑞典，这里很少出售Dr Pepper。\n\n我在商店的糖果区购物时，看到了一些从美国进口的Dr Pepper。\n我在商店的糖果区购物，看到了一些从美国进口的胡椒博士，我想：\"太酷了，我还没试过这些东西呢。\n我还没试过呢。所以我买了它，然后在商店外面打开它，它是...",
      "title": "人们真的喜欢Dr Pepper吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "澄清一下，我住在瑞典，這裏很少出售Dr Pepper。\n\n我在商店的糖果區購物時，看到了一些從美國進口的Dr Pepper。\n我在商店的糖果區購物，看到了一些從美國進口的胡椒博士，我想：\"太酷了，我還沒試過這些東西呢。\n我還沒試過呢。所以我買了它，然後在商店外面打開它，它是...",
      "title": "人們真的喜歡Dr Pepper嗎？"
    }
  ]
}