{
  "author": "cahokia_98",
  "original_created_utc": 1651428514,
  "title": "The film “The Northman”(2022) has been criticized in some places for its all-white cast. Would it be historically accurate for non-white people to be living in 9th century Scandinavia and Eastern Europe?",
  "created_utc": 1651439614,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m interested in the subject of historical diversity in general. Fiction usually depicts medieval Europe as a place where only white people exist; in recent years, I’ve seen claims that this is inaccurate, and Europe was historically more diverse than we tend to imagine in pop culture.&lt;/p&gt;\n\n&lt;p&gt;“The Northman” is interesting to me because the director has insisted that it is as historically accurate as possible. It also has faced some minor &lt;a href=\"https://amp.theguardian.com/film/2022/apr/22/norse-code-white-supremacists-reading-the-northman-robert-eggers\"&gt;criticism&lt;/a&gt; that it is overly white. From the article:&lt;/p&gt;\n\n&lt;p&gt;“The Northman’s 10th-century society appears to be uniformly white and firmly divided along patriarchal lines.”&lt;/p&gt;\n\n&lt;p&gt;“These myths were largely established by 19th-century historians with nationalist agendas, but more recent research reveals that societies such as those in Viking-era Scandinavia were in fact multicultural and multiracial.”&lt;/p&gt;\n\n&lt;p&gt;I tried to ask this question in a neutral manner. I would like to differentiate the historical facts on this subject from the political controversy which tends to surround diversity.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 117,
  "permalink": "/r/AskHistorians/comments/ug5nxq/the_film_the_northman2022_has_been_criticized_in/",
  "subreddit": "AskHistorians",
  "id": "ug5nxq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m interested in the subject of historical diversity in general. Fiction\nusually depicts medieval Europe as a place where only white people exist; in\nrecent years, I’ve seen claims that this is inaccurate, and Europe was\nhistorically more diverse than we tend to imagine in pop culture.\n\n“The…"
}