{
  "author": "cahokia_98",
  "original_created_utc": 1651428514,
  "title": "The film “The Northman”(2022) has been criticized in some places for its all-white cast. Would it be historically accurate for non-white people to be living in 9th century Scandinavia and Eastern Europe?",
  "created_utc": 1651439614,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m interested in the subject of historical diversity in general. Fiction usually depicts medieval Europe as a place where only white people exist; in recent years, I’ve seen claims that this is inaccurate, and Europe was historically more diverse than we tend to imagine in pop culture.&lt;/p&gt;\n\n&lt;p&gt;“The Northman” is interesting to me because the director has insisted that it is as historically accurate as possible. It also has faced some minor &lt;a href=\"https://amp.theguardian.com/film/2022/apr/22/norse-code-white-supremacists-reading-the-northman-robert-eggers\"&gt;criticism&lt;/a&gt; that it is overly white. From the article:&lt;/p&gt;\n\n&lt;p&gt;“The Northman’s 10th-century society appears to be uniformly white and firmly divided along patriarchal lines.”&lt;/p&gt;\n\n&lt;p&gt;“These myths were largely established by 19th-century historians with nationalist agendas, but more recent research reveals that societies such as those in Viking-era Scandinavia were in fact multicultural and multiracial.”&lt;/p&gt;\n\n&lt;p&gt;I tried to ask this question in a neutral manner. I would like to differentiate the historical facts on this subject from the political controversy which tends to surround diversity.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 117,
  "permalink": "/r/AskHistorians/comments/ug5nxq/the_film_the_northman2022_has_been_criticized_in/",
  "subreddit": "AskHistorians",
  "id": "ug5nxq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m interested in the subject of historical diversity in general. Fiction\nusually depicts medieval Europe as a place where only white people exist; in\nrecent years, I’ve seen claims that this is inaccurate, and Europe was\nhistorically more diverse than we tend to imagine in pop culture.\n\n“The…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "歴史の多様性というテーマ全般に興味があります。フィクション\n中世ヨーロッパは、白人しか存在しない場所として描かれることが多いのですが、近年は、そのようなことはありません。\n近年、それは不正確であり、ヨーロッパは私たちの想像以上に歴史的に多様であったという主張を目にすることがあります。\n近年、それは不正確で、ヨーロッパは私たちがポップカルチャーで想像している以上に歴史的に多様であったという主張を目にします。\n\n\"ザ...",
      "title": "映画「北の男」(2022)は、出演者が白人ばかりであることが一部で批判されています。9世紀の北欧や東欧に非白人が住んでいたことは、歴史的に正確なのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我对一般的历史多样性主题感兴趣。小说\n通常把中世纪的欧洲描绘成一个只有白人存在的地方。\n近年来，我看到有人说这是不准确的，欧洲在历史上的多样性比我们在流行文化中想象的要多。\n欧洲在历史上的多样性比我们在流行文化中的想象要多。\n\n\"...",
      "title": "电影《北方人》（2022年）在一些地方被批评为全白演员。非白人生活在9世纪的斯堪的纳维亚半岛和东欧地区，这是否符合历史的要求？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我對一般的歷史多樣性主題感興趣。小說\n通常把中世紀的歐洲描繪成一個只有白人存在的地方。\n近年來，我看到有人說這是不準確的，歐洲在歷史上的多樣性比我們在流行文化中想象的要多。\n歐洲在歷史上的多樣性比我們在流行文化中的想象要多。\n\n\"...",
      "title": "電影《北方人》（2022年）在一些地方被批評爲全白演員。非白人生活在9世紀的斯堪的納維亞半島和東歐地區，這是否符合歷史的要求？"
    }
  ]
}