{
  "author": "Jesus_in_Valhalla",
  "original_created_utc": 1624533357,
  "title": "Ice burns make no sense to me on a molecular level. Your skin cells are damaged because they came in contact with molecules that move too slowly?",
  "created_utc": 1624545216,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>you can damage your skin via conduction on too hot and too cold objects (-5°C - 54 °C). Now i can somewhat understand how fast moving molecules can damage cells, but what causes the skin cells to be damaged after being in contact with slowly moving molecules? Does the water in cells and blood freeze? If so what happens to the frozen cell when thawing?</p>\n</div><!-- SC_ON -->",
  "score": 133,
  "permalink": "/r/askscience/comments/o6ysqw/ice_burns_make_no_sense_to_me_on_a_molecular/",
  "subreddit": "askscience",
  "id": "o6ysqw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "you can damage your skin via conduction on too hot and too cold objects (-5°C -\n54 °C). Now i can somewhat understand how fast moving molecules can damage\ncells, but what causes the skin cells to be damaged after being in contact with\nslowly moving molecules? Does the water in cells and blood…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "熱すぎるものや冷たすぎるものの上では、伝導によって肌にダメージを与える可能性があります（-5°C ～ 54°C）。\n54 °C). 速く動く分子が細胞にダメージを与えることは、なんとなく理解できます。\nしかし、ゆっくりと動く分子と接触した皮膚細胞がダメージを受ける原因は何でしょうか？\nしかし、ゆっくりと動く分子と接触した皮膚細胞がダメージを受ける原因は何でしょうか？細胞や血液中の水分は...",
      "title": "アイスバーンは、分子レベルでは意味がありません。皮膚細胞がダメージを受けるのは、動きの遅い分子に接触したから？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在太热和太冷的物体上，你可以通过传导损害你的皮肤（-5°C -\n54 °C). 现在，我多少能理解快速运动的分子如何损害\n细胞，但什么原因导致皮肤细胞在接触到缓慢移动的分子后被损坏？\n缓慢移动的分子后，是什么原因导致皮肤细胞受损？细胞和血液中的水是否...",
      "title": "在分子水平上，冰灼伤对我来说毫无意义。你的皮肤细胞受损是因为它们接触到了移动速度太慢的分子？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在太熱和太冷的物體上，你可以通過傳導損害你的皮膚（-5°C -\n54 °C). 現在，我多少能理解快速運動的分子如何損害\n細胞，但什麼原因導致皮膚細胞在接觸到緩慢移動的分子後被損壞？\n緩慢移動的分子後，是什麼原因導致皮膚細胞受損？細胞和血液中的水是否...",
      "title": "在分子水平上，冰灼傷對我來說毫無意義。你的皮膚細胞受損是因爲它們接觸到了移動速度太慢的分子？"
    }
  ]
}