{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "\" \n\n**MIAMI** (CNN) -- The chaotic mix of record fuel prices and an unending supply chain crisis have retailers considering the unthinkable: Instead of returning your unwanted items, just keep them.\n\nIn recent weeks, some of the biggest store chains, including Target, Walmart, Gap, American Eagle Outfitters and others have reported in their latest earnings calls that they have too much inventory of stuff ranging from workout clothes, spring-time jackets and hoodies to garden furniture and bulky kids' toys. It's costing them tons of money to store it.\n\nNow add on to that glut another category of product that stores have to deal with: returns.\n\nSo instead of piling returned merchandise onto this growing inventory heap, stores are considering just handing customers their money back and letting them hang onto the stuff they don't want.\n\n\"It would be a smart strategic initiative,\" said Burt Flickinger, retail expert and managing director of retail consultancy Strategic Resource Group. \"Retailers are stuck with excess inventory of unprecedented levels. They can't afford to take back even more of it.\"\n\nReturned products are handled in a number of different ways, he said. Retailers take back merchandise from the customer, evaluate it, and if it's in good condition put it back on the shelf at the same or lesser price.\n\nThey can refurbish damaged returns and sell them for less or offload them to liquidators to resell. They also can sell returned products to foreign liquidators for sale in Europe, Canada or Mexico.\n\n\"Given the situation at the ports and the container shortages, sending product overseas isn't really an option,\" said Flickinger. Lastly, retailers can hire third party firms to handle all aspect of merchandise returns for them.\n\nEach of these options, however, tack on additional costs for retailers, he said.\n\n\"For every dollar in sales, a retailer's net profit is between a cent to five cents. With returns, for every dollar in returned merchandise, it costs a retailer between 15 cents to 30 cents to handle it,\" said Flickinger.\n\nThere is one other option for retailers to address returns while avoiding more product bloat and that's to consider a 'returnless return,' said Steve Rop, chief operating officer with goTRG, a firm that processes over 100 million returned items annually for companies like Wal-Mart, Amazon and Lowe's.\n\n**Just keep it**  \nRop said his company's clients are 100% considering offering the \"keep it\" option for returns this year, although he wouldn't disclose if any of his customers have implemented the \"Keep it\" returns policy yet.\n\nIn some instances, when they determine it would be easier, some retailers advise customers to just keep or donate their return after issuing a refund. \n\n\"They're already discounting in stores to clear out products but, when there's heavy discounting, buyer's remorse goes up. People are tempted to buy a lot to only return it later,\" he said.\n\nRefunding customers while simultaneously letting them keep their returns isn't a new practice, said Rop. \"It started with Amazon several years ago,\" he said.\n\nThe offer makes sense for some types of products -- lower price-tier bulky items like furniture, kitchen appliances, home decor, baby chairs, walkers, strollers where it's costly for the retailer to cover the shipping cost for the return.\n\n\"Other products like kids' toys, footwear, towels, and bedding raise sanitary concerns when it comes to returns. It could also apply to these categories,\" he said.\n\nAnother concern with cheaper items: Stores typically discount returned products, so the amount of money they can make on an inexpensive return is miniscule -- and may not be worth the tradeoff, says Keith Daniels, partner with Carl Marks Advisors.\n\nStill, a \"keep it\" policy has its own disadvantages, namely: Companies will need to ensure that they don't become victims of fraud.\n\n\"One thing retailers need to track and ensure is that customers that become aware of the \\[Keep it\\] policy do not begin to abuse it, by seeking free merchandise over a series of orders by getting a refund but getting to keep the merchandise,\" said Daniels.\"\n\n&amp;#x200B;\n\n[https://www.cbsnews.com/miami/news/big-chain-stores-too-much-inventory-customers-keep-returns/](https://www.cbsnews.com/miami/news/big-chain-stores-too-much-inventory-customers-keep-returns/)",
  "author_fullname": "t2_30de6d",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "LOCAL NEWS Big chain stores have too much inventory, consider new way to handle returns",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_vmrrcb",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.86,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 133,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 133,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1656434933,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;MIAMI&lt;/strong&gt; (CNN) -- The chaotic mix of record fuel prices and an unending supply chain crisis have retailers considering the unthinkable: Instead of returning your unwanted items, just keep them.&lt;/p&gt;\n\n&lt;p&gt;In recent weeks, some of the biggest store chains, including Target, Walmart, Gap, American Eagle Outfitters and others have reported in their latest earnings calls that they have too much inventory of stuff ranging from workout clothes, spring-time jackets and hoodies to garden furniture and bulky kids&amp;#39; toys. It&amp;#39;s costing them tons of money to store it.&lt;/p&gt;\n\n&lt;p&gt;Now add on to that glut another category of product that stores have to deal with: returns.&lt;/p&gt;\n\n&lt;p&gt;So instead of piling returned merchandise onto this growing inventory heap, stores are considering just handing customers their money back and letting them hang onto the stuff they don&amp;#39;t want.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;It would be a smart strategic initiative,&amp;quot; said Burt Flickinger, retail expert and managing director of retail consultancy Strategic Resource Group. &amp;quot;Retailers are stuck with excess inventory of unprecedented levels. They can&amp;#39;t afford to take back even more of it.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Returned products are handled in a number of different ways, he said. Retailers take back merchandise from the customer, evaluate it, and if it&amp;#39;s in good condition put it back on the shelf at the same or lesser price.&lt;/p&gt;\n\n&lt;p&gt;They can refurbish damaged returns and sell them for less or offload them to liquidators to resell. They also can sell returned products to foreign liquidators for sale in Europe, Canada or Mexico.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Given the situation at the ports and the container shortages, sending product overseas isn&amp;#39;t really an option,&amp;quot; said Flickinger. Lastly, retailers can hire third party firms to handle all aspect of merchandise returns for them.&lt;/p&gt;\n\n&lt;p&gt;Each of these options, however, tack on additional costs for retailers, he said.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;For every dollar in sales, a retailer&amp;#39;s net profit is between a cent to five cents. With returns, for every dollar in returned merchandise, it costs a retailer between 15 cents to 30 cents to handle it,&amp;quot; said Flickinger.&lt;/p&gt;\n\n&lt;p&gt;There is one other option for retailers to address returns while avoiding more product bloat and that&amp;#39;s to consider a &amp;#39;returnless return,&amp;#39; said Steve Rop, chief operating officer with goTRG, a firm that processes over 100 million returned items annually for companies like Wal-Mart, Amazon and Lowe&amp;#39;s.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Just keep it&lt;/strong&gt;&lt;br/&gt;\nRop said his company&amp;#39;s clients are 100% considering offering the &amp;quot;keep it&amp;quot; option for returns this year, although he wouldn&amp;#39;t disclose if any of his customers have implemented the &amp;quot;Keep it&amp;quot; returns policy yet.&lt;/p&gt;\n\n&lt;p&gt;In some instances, when they determine it would be easier, some retailers advise customers to just keep or donate their return after issuing a refund. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;They&amp;#39;re already discounting in stores to clear out products but, when there&amp;#39;s heavy discounting, buyer&amp;#39;s remorse goes up. People are tempted to buy a lot to only return it later,&amp;quot; he said.&lt;/p&gt;\n\n&lt;p&gt;Refunding customers while simultaneously letting them keep their returns isn&amp;#39;t a new practice, said Rop. &amp;quot;It started with Amazon several years ago,&amp;quot; he said.&lt;/p&gt;\n\n&lt;p&gt;The offer makes sense for some types of products -- lower price-tier bulky items like furniture, kitchen appliances, home decor, baby chairs, walkers, strollers where it&amp;#39;s costly for the retailer to cover the shipping cost for the return.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Other products like kids&amp;#39; toys, footwear, towels, and bedding raise sanitary concerns when it comes to returns. It could also apply to these categories,&amp;quot; he said.&lt;/p&gt;\n\n&lt;p&gt;Another concern with cheaper items: Stores typically discount returned products, so the amount of money they can make on an inexpensive return is miniscule -- and may not be worth the tradeoff, says Keith Daniels, partner with Carl Marks Advisors.&lt;/p&gt;\n\n&lt;p&gt;Still, a &amp;quot;keep it&amp;quot; policy has its own disadvantages, namely: Companies will need to ensure that they don&amp;#39;t become victims of fraud.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;One thing retailers need to track and ensure is that customers that become aware of the [Keep it] policy do not begin to abuse it, by seeking free merchandise over a series of orders by getting a refund but getting to keep the merchandise,&amp;quot; said Daniels.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.cbsnews.com/miami/news/big-chain-stores-too-much-inventory-customers-keep-returns/\"&gt;https://www.cbsnews.com/miami/news/big-chain-stores-too-much-inventory-customers-keep-returns/&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "vmrrcb",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "ReinhardtEichenvalde",
  "discussion_type": null,
  "num_comments": 30,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/vmrrcb/local_news_big_chain_stores_have_too_much/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/vmrrcb/local_news_big_chain_stores_have_too_much/",
  "subreddit_subscribers": 4237721,
  "created_utc": 1656453203,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1656434933,
  "the_new_excerpt": "\"\n\nMIAMI (CNN) -- The chaotic mix of record fuel prices and an unending supply\nchain crisis have retailers considering the unthinkable: Instead of returning\nyour unwanted items, just keep them.\n\nIn recent weeks, some of the biggest store chains, including Target, Walmart,\nGap, American Eagle…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "\"\n\nマイアミ（CNN） -- 記録的な燃料価格と終わりの見えないサプライチェーンの危機が混在する混沌とした状況。\n小売業者は、考えられないような事態を考慮している。不要なものを返品する代わりに\n不要なものを返品する代わりに、そのまま保管すればいいのだ。\n\nここ数週間、Target、Walmart、Gap、American Eagleなどの大手チェーンが、不要になった商品を返品する代わりに、そのまま保管することを検討している。\nアメリカン・イーグル...",
      "title": "LOCAL NEWS 大手チェーン店は在庫過多、返品対応の新方式を検討"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "\"\n\n迈阿密（CNN）--创纪录的燃料价格和无休止的供应链危机的混乱组合，使零售商们考虑到不可想象的问题。\n混乱的混合体，使零售商考虑采取不可想象的措施。与其退回\n你不需要的物品，而是保留它们。\n\n最近几周，一些最大的连锁店，包括塔吉特（Target）、沃尔玛（Walmart）。\nGap, American Eagle...",
      "title": "本地新闻 大型连锁店库存太多，考虑用新方法处理退货问题"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "\"\n\n邁阿密（CNN）--創紀錄的燃料價格和無休止的供應鏈危機的混亂組合，使零售商們考慮到不可想象的問題。\n混亂的混合體，使零售商考慮採取不可想象的措施。與其退回\n你不需要的物品，而是保留它們。\n\n最近幾周，一些最大的連鎖店，包括塔吉特（Target）、沃爾瑪（Walmart）。\nGap, American Eagle...",
      "title": "本地新聞 大型連鎖店庫存太多，考慮用新方法處理退貨問題"
    }
  ],
  "source_updated_at": 1656668664013
}