{
  "author": "screwyoushadowban",
  "original_created_utc": 1643492341,
  "title": "Pop culture imagines Australian aboriginal religion, ritual, &amp; lifestyle as \"frozen in time\" for the 40,000 years of their existence. But do indigenous Australian narratives also? Do Indigenous histories &amp; stories relate ancestral peoples, their development, extinction, &amp; succession?",
  "created_utc": 1643578414,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Given how different indigenous Australian groups there are/were I wouldn&amp;#39;t even know where to begin to narrow things down. Northern Australia maybe? I remember interesting stuff come up about peoples on the northern coasts back in my linguistics studies.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/sfseud/pop_culture_imagines_australian_aboriginal/",
  "subreddit": "AskHistorians",
  "id": "sfseud",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Given how different indigenous Australian groups there are/were I wouldn't even\nknow where to begin to narrow things down. Northern Australia maybe? I remember\ninteresting stuff come up about peoples on the northern coasts back in my\nlinguistics studies.",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "オーストラリアにはさまざまな先住民族がいますが、私にもわからないほどです。\n何から絞り込めばいいのかわからない。北オーストラリアとか？そういえば\n昔、北海岸の民族について面白い話が出たことがある。\n言語学の研究をしています。",
      "title": "ポップカルチャーは、オーストラリアの原住民の宗教、儀式、生活様式を、4万年前から「時間が止まったようなもの」と想像しています。しかし、オーストラリアの先住民の物語もそうなのでしょうか。先住民の歴史や物語は、先祖の民族、その発展、絶滅、継承に関連しているのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "鉴于澳大利亚的土著群体有多么不同，我甚至不知道从哪里开始缩小范围。\n我甚至不知道该从哪里开始缩小范围。也许是澳大利亚北部？我记得\n我记得在我学习语言学的时候，出现过一些关于北部沿海地区人民的有趣的东西。\n语言学研究中出现过一些有趣的东西。",
      "title": "流行文化将澳大利亚原住民的宗教、仪式和生活方式想象成 \"凝固在时间中 \"的4万年。但澳大利亚原住民的叙事也是如此吗？原住民的历史和故事是否与祖先的民族、他们的发展、灭绝和继承有关？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "鑑於澳大利亞的土著羣體有多麼不同，我甚至不知道從哪裏開始縮小範圍。\n我甚至不知道該從哪裏開始縮小範圍。也許是澳大利亞北部？我記得\n我記得在我學習語言學的時候，出現過一些關於北部沿海地區人民的有趣的東西。\n語言學研究中出現過一些有趣的東西。",
      "title": "流行文化將澳大利亞原住民的宗教、儀式和生活方式想象成 \"凝固在時間中 \"的4萬年。但澳大利亞原住民的敘事也是如此嗎？原住民的歷史和故事是否與祖先的民族、他們的發展、滅絕和繼承有關？"
    }
  ]
}