{
  "author": "kravintsky",
  "original_created_utc": 1636520822,
  "title": "Why do people give so much value to those who aren’t in their lives, like celebrities, but give so little to those around them?",
  "created_utc": 1636562262,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m guilty of this. I’m working to be grateful and appreciate those closer to me instead of focusing my thoughts on somebody’s else life and endeavors. Well, I feel like A LOT of people spend far too much time focusing on other people lives and adoring people in extreme ways who do not know about their existence and who do not bring value back to them, no teachings, no nothing. </p>\n\n<p>Is it a default human characteristic? What makes us look out of our inner circle and seek to concentrate on other people’s lives? What do we gain by doing so? Perhaps I’m answering my own question, but I can only think: to escape our own reality. But certainly there can be a less depressing explanation.</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/TrueAskReddit/comments/qqmr8z/why_do_people_give_so_much_value_to_those_who/",
  "subreddit": "TrueAskReddit",
  "id": "qqmr8z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m guilty of this. I’m working to be grateful and appreciate those closer to me\ninstead of focusing my thoughts on somebody’s else life and endeavors. Well, I\nfeel like A LOT of people spend far too much time focusing on other people lives\nand adoring people in extreme ways who do not know about…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私にも罪があります。誰かの人生や努力に思いを馳せるのではなく、身近な人たちに感謝し、感謝されるように努力しています。\n他の人の人生や努力に思いを馳せるのではなく、身近な人に感謝しています。さて、私は\n多くの人があまりにも多くの時間を他人の人生に集中して過ごしているように感じます。\n私は、多くの人があまりにも多くの時間を他人の人生に費やし、知らない人を極端に崇拝していると感じています。",
      "title": "なぜ人は、有名人のように自分の人生に関係のない人には価値を与えるのに、自分の周りの人にはあまり価値を与えないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在这方面是有罪的。我正在努力感激和欣赏那些离我较近的人\n而不是把我的思想集中在别人的生活和努力上。嗯，我\n我觉得很多人花了太多的时间来关注别人的生活\n并以极端的方式崇拜那些不知道的人......",
      "title": "为什么人们对那些不在他们生活中的人，如名人，给予那么多的价值，但对他们周围的人却给予那么少？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在這方面是有罪的。我正在努力感激和欣賞那些離我較近的人\n而不是把我的思想集中在別人的生活和努力上。嗯，我\n我覺得很多人花了太多的時間來關注別人的生活\n並以極端的方式崇拜那些不知道的人......",
      "title": "爲什麼人們對那些不在他們生活中的人，如名人，給予那麼多的價值，但對他們周圍的人卻給予那麼少？"
    }
  ]
}