{
  "author": "Thym3Travlr",
  "original_created_utc": 1631240313,
  "title": "The moment nfts get added to pre-existing games, they’ll blow up like crazy",
  "created_utc": 1631251865,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As of right now, all games that include nfts are completely based around them, like how in axis infinity the resources and pets being nfts who are sellable/buyable are the big thing about the game. While that works, it’s extremely hard for someone to get into the game just to play the game because of the high buy in cost and the focus the game puts on nfts</p>\n\n<p>Now imagine how crazy it would be if a game like cs:go made it so that all your skins in the game became nfts, the hype would be unimaginable and he game would have a huge surge of popularity, along with it revitalizing the trading community</p>\n\n<p>While I do think cosmetics are where nfts shine the best in terms of in video games, there are still other applications for nfts in a game, like for example imagine if a game about creating your own cafe has ingredients as nfts, and you could also create them yourself using different machines and you could use the ingredients to make drinks which would bet you coins to buy more machines or ingredient.</p>\n\n<p>What’s are your thoughts on the future of nfts in gaming?</p>\n</div><!-- SC_ON -->",
  "score": 165,
  "permalink": "/r/CryptoCurrency/comments/plc08j/the_moment_nfts_get_added_to_preexisting_games/",
  "subreddit": "CryptoCurrency",
  "id": "plc08j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As of right now, all games that include nfts are completely based around them,\nlike how in axis infinity the resources and pets being nfts who are\nsellable/buyable are the big thing about the game. While that works, it’s\nextremely hard for someone to get into the game just to play the game because…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今のところ、Nftを含むゲームはすべてNftを中心としたものになっています。\n例えばaxis infinityでは資源やペットがNftであり、それが売れる／買えるというのは\n売ったり買ったりできる資源やペットがゲームの大きな特徴です。それはそれでいいのですが、それでは\nゲームをプレイするためだけにゲームに参加するのは非常に困難です。",
      "title": "既存のゲームにnftsが追加された途端に大爆死するだろうな"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "就目前而言，所有包含Nfts的游戏都是完全围绕着它们展开的。\n就像在《无限轴心》中，资源和宠物都是可以出售/购买的Nfts。\n可卖/可买的资源和宠物是游戏的重要内容。虽然这很有效，但\n虽说如此，但很难让人进入游戏只是为了玩游戏，因为......。",
      "title": "一旦Nfts被添加到已有的游戏中，它们就会疯狂地爆炸。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "就目前而言，所有包含Nfts的遊戲都是完全圍繞着它們展開的。\n就像在《無限軸心》中，資源和寵物都是可以出售/購買的Nfts。\n可賣/可買的資源和寵物是遊戲的重要內容。雖然這很有效，但\n雖說如此，但很難讓人進入遊戲只是爲了玩遊戲，因爲......。",
      "title": "一旦Nfts被添加到已有的遊戲中，它們就會瘋狂地爆炸。"
    }
  ]
}