{
  "author": "mrfilthynasty4141",
  "the_new_excerpt": "KMB - KIMBERLY CLARK / DIVIDEND 3.47%\n\n * The company's personal care segment could see a nice uptick as overall\n   awareness for hygiene and cleanliness is increased, as well as more stringent\n   requirements by services like cruise ships and airlines being implemented as\n   the world opens back…",
  "original_created_utc": 1615267052,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "KMB - KIMBERLY CLARK / DIVEND 3.47％\n\n * 该公司的个人护理部门可能会有不错的增长，因为整体上，该公司的个人护理部门可能会有不错的增长。\n   卫生和清洁意识增强，以及更加严格的管理。\n   游轮和航空公司等服务机构的要求正在实施，以满足他们的需求。\n   世界又打开了...",
      "title": "注重长期红利再投资的价值/DD股票简介"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "KMB - KIMBERLY CLARK / DIVEND 3.47％\n\n * 該公司的個人護理部門可能會有不錯的增長，因爲整體上，該公司的個人護理部門可能會有不錯的增長。\n   衛生和清潔意識增強，以及更加嚴格的管理。\n   遊輪和航空公司等服務機構的要求正在實施，以滿足他們的需求。\n   世界又打開了...",
      "title": "注重長期紅利再投資的價值/DD股票簡介"
    }
  ],
  "title": "Value with a focus on long-term dividend reinvestment / DD Stock Write-up",
  "created_utc": 1615313600,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h1>KMB - Kimberly Clark / Dividend 3.47%</h1>\n\n<ul>\n<li>The company&#39;s personal care segment could see a nice uptick as overall awareness for hygiene and cleanliness is increased, as well as more stringent requirements by services like cruise ships and airlines being implemented as the world opens back up.</li>\n<li>Their consumer tissue division also saw an increase in volume as the work-from-home trend was set into motion by covid, with a portion of these individuals working from home indefinitely.</li>\n<li>Their dividend growth has been steady for nearly 50 years with this year marking 49 straight years of dividend growth.</li>\n<li>A restructuring plan started back in 2018 should be wrapping up in 2021. This plan was meant to cut out unnecessary costs and to put the company on track for continued future growth. 2020 revenue grew by 3.7% to 19.1 billion with net income rising 9% YOY to 2.4 billion.</li>\n</ul>\n\n<h1>O - Realty Income REIT / Dividend 4.65%</h1>\n\n<ul>\n<li>Dividend is paid out monthly, designed to provide investors with reliable monthly income.</li>\n<li>Revenues and FFO per share are up YOY</li>\n<li>Very strong financials and management - they currently have a $3 billion unsecured revolving credit facility with an initial term that expires in 2023. There were no borrowings on its credit facility as of Dec 2020.</li>\n<li>Well diversified portfolio of properties and adapted to change quickly in the 2020 pandemic environment - they are expecting an acquisition volume of $3.25 billion in 2021 notably due to the company&#39;s solid financial position and investment pipeline.</li>\n</ul>\n\n<h1>MMM - 3M / Dividend 3.21%</h1>\n\n<ul>\n<li>People focused on their respirator masks and respirators as their bread and butter over the past year. This was a godsend for them, as they are now able to use their 2020 revenues from their safety/industrial segment as well as their healthcare segment to continue growth in their other segments.</li>\n<li>Their other segments include their transportation and electronics, as well as their consumer segment. Both are cyclically aligned segments and are yet to fully recover offering a very nice opportunity for growth.</li>\n<li>The stock trades on 15x its current FCF (free cash flow per share) - theoretically, they could pay over a 6% dividend with their current revenues and still be able to grow the business.</li>\n<li>A total of 56 hedge funds were holding the stock heading into Q4 of 2020, topping the all-time-highs of 52.</li>\n<li>They are &quot;restructuring management for growth&quot;.</li>\n</ul>\n\n<h1>MAIN - Main Street Capital / Dividend 6.7%</h1>\n\n<ul>\n<li>Their dividend is paid out monthly.</li>\n<li>Although their net earnings were effected by the pandemic, they demonstrated they were able to withstand market volatility via their diversified investments and high liquidity.</li>\n<li>Over 80% dividend growth since IPO with a large span of investments across a number of different sectors.</li>\n<li>If you are looking for a way to gain exposure to the financial sector but hate to mess with big banks and other sketchy financial plays, this may be a good stock for you.</li>\n</ul>\n\n<h1>KR - Kroger / Dividend 2.09%</h1>\n\n<ul>\n<li>Digital sales jumping over 100% YOY - their online grocery segment is newly developed and will be in the works for years to come. Without going on a rant about why, I believe Amazon will begin to lose steam to smaller companies as they take back market share via investing in similar methods and technologies in order to deliver their own services and products in a similar way.</li>\n<li>They are currently invested in a number of improvements from their in-store and online technology to space optimization and store remodeling.</li>\n<li>I am not going to do a huge write up on this ticker, I just like the stock.</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>Set up a DRIP by contacting investor relations for a particular company or contact your brokerage for whatever offers they may have regarding dividend reinvestment into certain securities. This is a great way to put your dividend payments to use early on as they can seem insignificant for those just starting out. Do not expect to live off of your dividend payments. Yet. Let them grow and roll profits from growth plays back into the positions you are holding. Do not worry about stock price as you will be receiving dividends on every dime of your investment, not to mention dollar cost averaging should keep your cost basis nice.</p>\n</blockquote>\n</div><!-- SC_ON -->",
  "score": 70,
  "permalink": "/r/investing/comments/m0zj8w/value_with_a_focus_on_longterm_dividend/",
  "subreddit": "investing",
  "id": "m0zj8w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542575826
}