{
  "author": "saffron1990",
  "original_created_utc": 1630706116,
  "title": "Do people not realise that there’s already quite a few block chains that have smart contacts but nobody uses them?",
  "created_utc": 1630737048,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I keep seeing comments about ADA and how smart contacts are going to change everything but I don’t think most people realise smart contacts already exist on a few block chains but nobody uses them much.</p>\n\n<p>Neo and tezos are 2 that I can think of off the top of my head. Both used to be top 10 coins at one stage until the hype died down.</p>\n\n<p>I’m not trying to shit on ADA. I’m just hoping that people realise that smart contacts aren’t really a big deal in the crypto space. </p>\n\n<p>Network effects seem to be the most important thing and at the moment it’s all with ethereum.</p>\n</div><!-- SC_ON -->",
  "score": 177,
  "permalink": "/r/CryptoCurrency/comments/pheqyb/do_people_not_realise_that_theres_already_quite_a/",
  "subreddit": "CryptoCurrency",
  "id": "pheqyb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I keep seeing comments about ADA and how smart contacts are going to change\neverything but I don’t think most people realise smart contacts already exist on\na few block chains but nobody uses them much.\n\nNeo and tezos are 2 that I can think of off the top of my head. Both used to be\ntop 10 coins at…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ADAについて、スマートコンタクトがすべてを変えるというコメントをよく目にします。\nしかし、多くの人はスマートコンタクトがすでに存在していることを知らないと思います。\nいくつかのブロックチェーンにスマートコンタクトが存在していますが、誰もあまり使っていません。\n\nNeoとTezosは私の頭の上にある2つの例です。どちらも、かつては\nトップ10のコインでしたが...",
      "title": "スマートコンタクトを搭載したブロックチェーンがすでにかなりあるのに、誰も使っていないことに気づかないのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直看到关于ADA和智能美瞳将如何改变一切的评论。\n但我认为大多数人没有意识到智能联系人已经存在于一些区块链上，但没有人使用它们。\n一些区块链已经存在，但没有人使用它们。\n\nNeo和Tezos是我能想到的两个。这两个都曾经是\n排名前十的币种...",
      "title": "人们没有意识到，已经有相当多的区块链有智能联系人，但没有人使用它们？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直看到關於ADA和智能美瞳將如何改變一切的評論。\n但我認爲大多數人沒有意識到智能聯繫人已經存在於一些區塊鏈上，但沒有人使用它們。\n一些區塊鏈已經存在，但沒有人使用它們。\n\nNeo和Tezos是我能想到的兩個。這兩個都曾經是\n排名前十的幣種...",
      "title": "人們沒有意識到，已經有相當多的區塊鏈有智能聯繫人，但沒有人使用它們？"
    }
  ]
}