{
  "author": "TraderJoe543",
  "the_new_excerpt": "So, people seemed to like my first post. Can't say I got a lot of votes for it,\nbut I did get a lot of people asking some really great questions. So... what the\nheck, I'll throw a few more out there and see if anyone cares about them and/or\ndisagrees. I don't have time to add cool charts and graphs…",
  "original_created_utc": 1618873333,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の最初の投稿をみんなが気に入ってくれたようですね。沢山の投票を得たとは言えませんが\nしかし、多くの人が本当に素晴らしい質問をしてくれました。それで...何となく\n誰かがそれを気にしたり、反対したりするかどうか見てみようと思います。\n反対する人がいないか見てみましょう。クールなチャートやグラフを追加する時間はありませんが...。",
      "title": "BTCテクニカル分析アップデート - 11pm UTC 4/19"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以，人们似乎喜欢我的第一个帖子。我不能说我得到了很多投票。\n但确实有很多人问了一些非常棒的问题。所以......不管怎样\n所以......不管怎样，我还是要再抛出几个问题，看看是否有人关心它们和/或\n不同意。我没有时间去添加很酷的图表和图形...",
      "title": "BTC技术分析更新--11pm UTC 4/19"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以，人們似乎喜歡我的第一個帖子。我不能說我得到了很多投票。\n但確實有很多人問了一些非常棒的問題。所以......不管怎樣\n所以......不管怎樣，我還是要再拋出幾個問題，看看是否有人關心它們和/或\n不同意。我沒有時間去添加很酷的圖表和圖形...",
      "title": "BTC技術分析更新--11pm UTC 4/19"
    }
  ],
  "title": "BTC Technical Analysis Update - 11pm UTC 4/19",
  "created_utc": 1618921841,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So, people seemed to like my first post.  Can&#39;t say I got a lot of votes for it, but I did get a lot of people asking some really great questions.  So... what the heck, I&#39;ll throw a few more out there and see if anyone cares about them and/or disagrees.  I don&#39;t have time to add cool charts and graphs tonight, but here are my thoughts:</p>\n\n<p>(and yes, these are specific to BTC.  I don&#39;t do altcoins.)</p>\n\n<p>The support level is $55k, for certain.  It has held support there consistently for almost one month (since 3/29), if you exclude the brief dip the other night as positions were liquidated... and then 20 minutes later, we came back to the $55k support.  20 minutes.</p>\n\n<p>That support has been tested again around 4/7, and during the crash on 4/17, and then again today around mid-day US time, and each time it dipped under $55k, it rallied back rather quickly.  (I think it was kind of a Monday hangover effect.)</p>\n\n<p>As far as resistance...</p>\n\n<p>At the moment the order stack looks tough at $57k.  Someone has a limit order out there to sell $3.5MM worth if we hit $57k.  That said, the whales often &quot;spoof&quot; the market (this market isn&#39;t as regulated as some) and I wouldn&#39;t be surprised to see that order vanish if we get close.</p>\n\n<p>But apart from that, I&#39;m seeing smooth sailing until we hit $60k-ish which is both a technical level and a psychological level.  It is technical on at least 3 things.  Doing old-school charting, something damn near $60k is about the midpoint of the trading range.  RSI using my method is still showing slightly oversold, and we are solidly under the 20-day SMA until we get close to $60k.  Obviously $60k is going to be psychological.</p>\n\n<p>So, FWIW -- (TL; DR) -- In my personal opinion (and I am NOT a financial advisor), I think the downside is quite limited to the upside right here, and might be for a while.  So get long, and hold until we get closer to that $60k wall that will surely be built.</p>\n\n<p>And if you like this stuff, let me know!  Or if you have questions, I&#39;ll try my best to reply. If you hate it, let me know as well, and I&#39;ll stop doing it.</p>\n\n<p>-TJ</p>\n\n<p>EDIT:  Unless I wasn&#39;t clear enough, we will almost certainly stall for a bit at $57k.  We have a large offer stack there, and that is also one SD under the SMA.</p>\n</div><!-- SC_ON -->",
  "score": 159,
  "permalink": "/r/CryptoCurrency/comments/mucyo7/btc_technical_analysis_update_11pm_utc_419/",
  "subreddit": "CryptoCurrency",
  "id": "mucyo7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171521492
}