{
  "author": "carloselieser",
  "original_created_utc": 1631833375,
  "title": "Vinteo - Clean and simple Youtube video downloader",
  "created_utc": 1631851132,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey all! Just wanted to share a little side project I finished recently. I was truly inspired by the amount of ad-infected, annoying, and obtrusive sites claiming to let you download Youtube videos for free, so I made one that just works. No ads or any b.s, just paste a Youtube link and it&#39;ll let you download it in all available resolutions for that video. The app also lets you download the audio for a video as well.</p>\n\n<p>For anyone interested, I&#39;m running a server with python that handles serving file content and putting high resolution streams together. Vanilla js and tailwind for the front-end.</p>\n\n<p><a href=\"https://vinteo.app\">https://vinteo.app</a></p>\n\n<p>Enjoy!</p>\n</div><!-- SC_ON -->",
  "score": 5,
  "permalink": "/r/SideProject/comments/ppo6oe/vinteo_clean_and_simple_youtube_video_downloader/",
  "subreddit": "SideProject",
  "id": "ppo6oe",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hey all! Just wanted to share a little side project I finished recently. I was\ntruly inspired by the amount of ad-infected, annoying, and obtrusive sites\nclaiming to let you download Youtube videos for free, so I made one that just\nworks. No ads or any b.s, just paste a Youtube link and it'll let…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Hey all! 最近完成した、ちょっとしたサイドプロジェクトを紹介したいと思います。私は\nYoutubeの動画を無料でダウンロードできると謳った広告付きの迷惑なサイトの多さに心を動かされたので\nYoutubeの動画を無料でダウンロードできると謳った広告付きの迷惑なサイトの多さに心を動かされたので、機能するものを作ってみました。\nしています。このサイトは、広告もなく、Youtubeのリンクを貼り付けるだけで、...",
      "title": "Vinteo - クリーンでシンプルなYoutubeビデオダウンローダー"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好! 只是想分享一下我最近完成的一个小项目。我是\n我真的被大量的广告感染、烦人的和碍眼的网站所启发\n声称让你免费下载Youtube视频，所以我做了一个只是\n的。没有广告或任何b.s，只需粘贴一个Youtube链接，它就会让...",
      "title": "Vinteo - 干净而简单的Youtube视频下载器"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好! 只是想分享一下我最近完成的一個小項目。我是\n我真的被大量的廣告感染、煩人的和礙眼的網站所啓發\n聲稱讓你免費下載Youtube視頻，所以我做了一個只是\n的。沒有廣告或任何b.s，只需粘貼一個Youtube鏈接，它就會讓...",
      "title": "Vinteo - 乾淨而簡單的Youtube視頻下載器"
    }
  ]
}