{
  "author": "Loose_with_the_truth",
  "original_created_utc": 1631049114,
  "title": "Flash crashes explained",
  "created_utc": 1631072033,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><ol>\n<li><p>Bitcoin price rises for weeks, and the fear and greed index shows extreme greed (lots of buying pressure and buying on margin). Expectations of positive news may increase F&amp;G.</p></li>\n<li><p>Bitcoin whale dumps ~2k bitcoins on a big exchange, and the price plummets. They still get a pretty good price for their bitcoins - as they were selling at the top and on the way down. But this eats up the buy wall and prices plummet. </p></li>\n<li><p>This fast dip liquidates a ton of longs (aka positions bought on margin, bitcoin bought with borrowed money), which means forced bitcoin sales, which further drops the price. Which liquidates more longs - a domino effect.</p></li>\n<li><p>The temporary bottom is reached very quickly as all those longs are shaken out. Sell pressure drops to zero, and attentive folks with money on exchanges buy the dip in a hurry, resulting in a dead cat bounce. Price recovers about halfway from where it had been before the flash crash.</p></li>\n<li><p>All those buys slowly wane, as everyone with money available has bought the dip. More buys trickle in as people move money to exchanges to take advantage of the dip but that just keeps the price fairly stable for a while (we are here right now). </p></li>\n<li><p>The dip shakes confidence and some weaker hands sell because they are afraid that the bull run is over. Whales may encourage this by dumping some more big chunks of BTC. Price continues to decline, recover a bit, and decline some more over the next week or so. </p></li>\n<li><p>Whale who sold starts buying back the bitcoin they sold (around ~$50k average this time) for a steep discount (likely low $40k&#39;s this time). They do this slowly though, not all at once, so they can keep getting it at the discount price. Meaning the price stays relatively stable but generally rises a little. </p></li>\n<li><p>Sell pressure wanes almost completely, normal buying pattern returns to the bull market norm, and prices recover. </p></li>\n<li><p>A month, month and a half go by and the bitcoin price is ~20% above the price it was at step 1. </p></li>\n<li><p>Go back to step 1.</p></li>\n</ol>\n\n<p>It&#39;s likely that the whale didn&#39;t even sell their own bitcoin to begin with, but borrowed it (shorted bitcoin, tanking the market with the bitcoin they shorted).</p>\n</div><!-- SC_ON -->",
  "score": 322,
  "permalink": "/r/CryptoCurrency/comments/pjw37h/flash_crashes_explained/",
  "subreddit": "CryptoCurrency",
  "id": "pjw37h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": " 1.  Bitcoin price rises for weeks, and the fear and greed index shows extreme\n     greed (lots of buying pressure and buying on margin). Expectations of\n     positive news may increase F&G.\n\n 2.  Bitcoin whale dumps ~2k bitcoins on a big exchange, and the price plummets.\n     They still get a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": " 1.  ビットコイン価格が何週間も上昇し、恐怖と強欲の指数が極端な\n     恐怖・強欲指数が極端な強欲さを示している（買い圧力が強く、信用買いが多い）。ポジティブなニュースへの期待感が\n     ポジティブなニュースへの期待がF&Gを高める可能性がある。\n\n 2.  Bitcoin Whaleが大手取引所に2kビットコインを投じ、価格が急落する。\n     それでも彼らは...",
      "title": "Flashのクラッシュについて"
    },
    {
      "locale": "zh",
      "the_new_excerpt": " 1.  比特币价格连续几周上涨，恐惧和贪婪指数显示出极端的\n     贪婪（大量的购买压力和保证金购买）。期待的\n     积极的消息可能会增加恐惧和贪婪。\n\n 2.  比特币鲸鱼在一个大交易所倾倒了~2k比特币，价格暴跌。\n     他们仍然得到一个...",
      "title": "Flash崩溃的解释"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": " 1.  比特幣價格連續幾週上漲，恐懼和貪婪指數顯示出極端的\n     貪婪（大量的購買壓力和保證金購買）。期待的\n     積極的消息可能會增加恐懼和貪婪。\n\n 2.  比特幣鯨魚在一個大交易所傾倒了~2k比特幣，價格暴跌。\n     他們仍然得到一個...",
      "title": "Flash崩潰的解釋"
    }
  ]
}