{
  "author": "michanik",
  "the_new_excerpt": "Gaming Market\n\nThe gaming market is a strong growing market that has been expanding for the\npast two decades and is expected to keep growing. Consumer spending in 2020 on\nPC gaming hardware and accessories reach 4.5 billion USD while accessories grew\n81% YoY and hardware grew…",
  "original_created_utc": 1623674003,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ゲーミング市場\n\nゲーミング市場は、過去20年間に渡って拡大を続け、今後も成長が見込まれる強力な成長市場です。\n過去20年間に拡大しており、今後も成長が見込まれています。2020年の消費者支出は\nPCゲーミングハードウェアおよびアクセサリーに対する2020年の消費者支出は45億米ドルに達し、アクセサリーは前年比81%増、ハードウェアは...\n前年比81%増、ハードウェアは...",
      "title": "コルセアDD、なぜ成長産業の成長企業なのか"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "游戏市场\n\n游戏市场是一个强劲增长的市场，在过去二十年里一直在扩大，并有望继续增长。\n在过去的20年里，游戏市场是一个强劲增长的市场，一直在扩大，并预计将继续增长。2020年消费者在\n个人电脑游戏硬件和配件达到45亿美元，而配件增长了\n81%，硬件增长...",
      "title": "海盗船DD以及为什么它是一个成长型行业中的成长型公司"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "遊戲市場\n\n遊戲市場是一個強勁增長的市場，在過去二十年裏一直在擴大，並有望繼續增長。\n在過去的20年裏，遊戲市場是一個強勁增長的市場，一直在擴大，並預計將繼續增長。2020年消費者在\n個人電腦遊戲硬件和配件達到45億美元，而配件增長了\n81%，硬件增長...",
      "title": "海盜船DD以及爲什麼它是一個成長型行業中的成長型公司"
    }
  ],
  "title": "Corsair DD and why it is a growth company in a growth industry",
  "created_utc": 1623688922,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Gaming Market</strong></p>\n\n<p>The gaming market is a strong growing market that has been expanding for the past two decades and is expected to keep growing. Consumer spending in 2020 on PC gaming hardware and accessories reach 4.5 billion USD while accessories <a href=\"https://www.gamesindustry.biz/articles/2021-02-16-pc-hardware-and-accessories-spending-grew-62-percent-in-the-us-in-2020\">grew 81% YoY and hardware grew 57%.</a></p>\n\n<p>Corsair manufactures hardware solutions such as fans, RAM, cooling units, PC cases and many more that have profited from the recent increase in PC hardware sales. Due to lockdowns many have been wanting to buy a PC which has shot up sales. However, this trend is not temporary as I will show.</p>\n\n<p><a href=\"https://www.statista.com/statistics/308330/number-stream-users/\">Steam users</a> a.k.a. any gamer who has a PC and play video games, have seen a very sharp growth in the past year due to the lockdown. The trend fluctuates with the lockdowns easings around the world and is always and bottom in summer months. From August 2019 to August 2020 there has been a 33% increase in steam users. August of 2020 was a time when Europe had record low covid infections (compared to winter months and beginning of pandemic) as well as America. Yet people were still playing video games at record rates. This is a clear sign that this market has grown, and the player base is hooked and not going anywhere. Since then, it had another 20% increase. Bullish af.</p>\n\n<p>The biggest nonsense I have ever heard is that now that lockdown is over, gamers are going to stop gaming. Have they ever even met a gamer? Personally, I was a hardcore gamer before lockdown, and I will definitely continue to be one. The lockdown accelerated the uptake of gaming and if anything, people will be more committed to gaming. Easing of lockdown would allow for social events (e.g. LAN parties and gaming conventions) to take place that will further encourage spending on gaming products.</p>\n\n<p>Investors who believe that gaming is going to fade out or that the hype is over are completely in the wrong here. Covid has only accelerated the trend and there might be a minor pullback in numbers as usually happens in the summer months, but the YoY numbers indicate that there has been a strong increase in gaming and this trend is likely to continue. You can buy the stock now at a lucrative price and when the investors realize that gaming is here to stay, they will have to buy the stock at a much higher price down the line.</p>\n\n<p><strong>Streaming Market</strong></p>\n\n<p>An excellent acquisition by Corsair has been buying Elgato and entering the streaming business. The streaming market was 50 billion USD in 2020 and is expected to reach 59 billion USD in 2021. It is expected to continue growing to 2028 at an <a href=\"https://www.grandviewresearch.com/industry-analysis/video-streaming-market#:%7E:text=The%20global%20video%20streaming%20market%20size%20was%20estimated%20at%20USD,USD%2059.14%20billion%20in%202021.&amp;text=The%20global%20video%20streaming%20market%20is%20expected%20to%20grow%20at,USD%20223.98%20billion%20by%202028\">annual CAGR rate of 21%!!!</a></p>\n\n<p>This is a huge market with a wonderful growth rate (not easy finding a market with such a growth rate) and corsair is perfectly positioned to take advantage of it. From buying the hardware to run your PC (also with products such as the capture card) to the elgato streaming deck that allows for easy streaming controls, Corsair is in the perfect position to take advantage of this growing market and be at the forefront of the hardware space.</p>\n\n<p><strong>Financial performance</strong></p>\n\n<p>Absolutely solid financial performance over the past year with stellar growth and very prospective in the future.</p>\n\n<p>YoY revenue and profit margins have been growing at double digit rates. Revenue grew 55% and 65% from 1,163 and 1,300 to 1,702 and 1,923 million USD from Dec 2019 and March 2020 to Dec 2020 and March 2021. Q1 is usually the worst quarter of the year but they managed to get their best ever quarter!</p>\n\n<p>EBITDA margins and Net Income margins have gone from around 6.5% and 0% to 13.5 and 7.7% from March 2020 to March 2021, respectively. This is showing stunning increase in operating margins which are very healthy and promise great further investment and growth.</p>\n\n<p>EPS this year is expected to be 1.81. However, the CFO is usually very conservative and it could be much higher by the end of the year. (I could go on more detail about earnings growth but in this case margins are more interesting because it shows better efficiency and last year they were barely doing a profit so the earnings growth is skewed). With an EPS of 1.81 a fair value PE multiple of 20 would be 36.2. However, if you consider this is a growth stock in a growth environment, then comparable growth companies trade at 30-40 PE ratio which would indicate a price target of at least 54.3-72.4!</p>\n\n<p>Additionally, they have been paying down debt from 505 million at end of the year 2019 to 321 million in 2020.</p>\n\n<p><strong>Comparing Corsair with its closest competitor: Logitech</strong></p>\n\n<p>Lets look at Logitech valuation metrics:</p>\n\n<p>&#x200B;</p>\n\n<table><thead>\n<tr>\n<th align=\"left\"></th>\n<th align=\"left\">Last 12 months</th>\n<th align=\"left\">Next 12 months</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">PE Ratio</td>\n<td align=\"left\">23.4</td>\n<td align=\"left\">30.1</td>\n</tr>\n<tr>\n<td align=\"left\">EV/Sales</td>\n<td align=\"left\">3.8</td>\n<td align=\"left\">3.8</td>\n</tr>\n<tr>\n<td align=\"left\">EV/EBITDA</td>\n<td align=\"left\">15.9</td>\n<td align=\"left\">22.6</td>\n</tr>\n</tbody></table>\n\n<p>Corsair:</p>\n\n<p>&#x200B;</p>\n\n<table><thead>\n<tr>\n<th align=\"left\"></th>\n<th align=\"left\">Last 12 months</th>\n<th align=\"left\">Next 12 months</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">PE Ratio</td>\n<td align=\"left\">20.4</td>\n<td align=\"left\">18.8</td>\n</tr>\n<tr>\n<td align=\"left\">EV/Sales</td>\n<td align=\"left\">1.71</td>\n<td align=\"left\">1.5</td>\n</tr>\n<tr>\n<td align=\"left\">EV/EBITDA</td>\n<td align=\"left\">11.5</td>\n<td align=\"left\">12.9</td>\n</tr>\n</tbody></table>\n\n<p>&#x200B;</p>\n\n<p>Now if Corsair was priced as Logitech, it would indicate a price increase between 50-100%.</p>\n\n<p>Additionally, much of Logitech’s offering has been focussed on working from home products, whereas Corsair is more focussed on gaming (Logitech too but not to the same extent). The working from home trend has peaked and many companies like JP Morgan have announced that they will want all their staff to return back to the office within the next months. There will still be people working from home but the trend will be declining from now.</p>\n\n<p><strong>Ownership</strong></p>\n\n<p>There has been negative sentiment around IPOs recently as many of them have flooded the market resulting in extreme short term price movement which has led to investors staying shy of them and believing that they are more speculative. Ownership currently sits at 62% with eagle tree capital and around 10% with other institutions.</p>\n\n<p>Short interest is currently at around 19% of the float.</p>\n\n<p>Overall, great company with excellent financial performance (actually makes a great profit and has super good growth ahead) and I am mega bullish on them. They also have super low valuation metrics which together make a rare combination.</p>\n\n<p><strong>TL;DR</strong>. Great company, great products, growing market and growing company. Super low valuations</p>\n\n<p>&#x200B;</p>\n\n<p>Edit: if you have any comments or feedback, please let me know.<br/>\nIt is currently being driven up like crazy, but this company does have excellent value in the long term. Something to consider</p>\n</div><!-- SC_ON -->",
  "score": 209,
  "permalink": "/r/stocks/comments/nzlqvg/corsair_dd_and_why_it_is_a_growth_company_in_a/",
  "subreddit": "stocks",
  "id": "nzlqvg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009743477
}