{
  "author": "movie_gremlin",
  "original_created_utc": 1642477080,
  "title": "Do other conservatives find it hard to support the GOP in todays climate?",
  "created_utc": 1642485375,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have always considered myself moderate conservative, mainly because I support more conservative centric economic/international policies, however I dont support our views on many social issues (many of the issues I dont feel should be political at all, and they never really were until the last decade or so).  &lt;/p&gt;\n\n&lt;p&gt;I feel I am level-headed and sensical when it comes to politics. I dont feed into the bickering soap opera that politics have become over the last 10-15 years.  It really bothers me how we have attracted and welcomed all these new conservatives that never had any interest in political policy. People that only became attracted because of the emotional rants, drama, and feuding that saturated social media.  &lt;/p&gt;\n\n&lt;p&gt;Politics sunk to the lows of crappy reality tv, and that audience became the new American representation and face of the GOP. its difficult to support the GOP when I see all these far-right militias and racist organizations allowed to become such vocal supporters. Why didnt we try to denounce and push away this negativity and hate? We never heard from these groups in the past, as they were anti-govt and we didnt influence and encourage them.  Why have we prioritized feuding with the left instead of focusing on the platform we used to have?&lt;/p&gt;\n\n&lt;p&gt;I am curious if other conservatives feel the same and are conflicted in their political stance?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/s6nkpx/do_other_conservatives_find_it_hard_to_support/",
  "subreddit": "NoStupidQuestions",
  "id": "s6nkpx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I have always considered myself moderate conservative, mainly because I support\nmore conservative centric economic/international policies, however I dont\nsupport our views on many social issues (many of the issues I dont feel should\nbe political at all, and they never really were until the last…"
}