{
  "author": "movie_gremlin",
  "original_created_utc": 1642477080,
  "title": "Do other conservatives find it hard to support the GOP in todays climate?",
  "created_utc": 1642485375,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have always considered myself moderate conservative, mainly because I support more conservative centric economic/international policies, however I dont support our views on many social issues (many of the issues I dont feel should be political at all, and they never really were until the last decade or so).  &lt;/p&gt;\n\n&lt;p&gt;I feel I am level-headed and sensical when it comes to politics. I dont feed into the bickering soap opera that politics have become over the last 10-15 years.  It really bothers me how we have attracted and welcomed all these new conservatives that never had any interest in political policy. People that only became attracted because of the emotional rants, drama, and feuding that saturated social media.  &lt;/p&gt;\n\n&lt;p&gt;Politics sunk to the lows of crappy reality tv, and that audience became the new American representation and face of the GOP. its difficult to support the GOP when I see all these far-right militias and racist organizations allowed to become such vocal supporters. Why didnt we try to denounce and push away this negativity and hate? We never heard from these groups in the past, as they were anti-govt and we didnt influence and encourage them.  Why have we prioritized feuding with the left instead of focusing on the platform we used to have?&lt;/p&gt;\n\n&lt;p&gt;I am curious if other conservatives feel the same and are conflicted in their political stance?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/s6nkpx/do_other_conservatives_find_it_hard_to_support/",
  "subreddit": "NoStupidQuestions",
  "id": "s6nkpx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I have always considered myself moderate conservative, mainly because I support\nmore conservative centric economic/international policies, however I dont\nsupport our views on many social issues (many of the issues I dont feel should\nbe political at all, and they never really were until the last…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は常に自分を穏健な保守派だと考えています。\nしかし、私は保守的な経済政策や国際政策には反対です。\n多くの社会問題に対する私たちの見解を支持します。\n政治的な意味合いは全くなく、前任者まではそうであった。",
      "title": "他の保守派は、今日のような情勢の中でGOPを支持するのは難しいと感じているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直认为自己是温和的保守派，主要是因为我支持\n更为保守的经济/国际政策，但我不\n支持我们在许多社会问题上的观点（许多问题我觉得根本不应该是政治问题，而且直到上个世纪末它们才真正是政治问题。\n许多问题我觉得根本不应该是政治问题，而且直到最后，它们从来没有真正成为政治问题。",
      "title": "其他保守派觉得在今天的环境中很难支持美国共和党吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直認爲自己是溫和的保守派，主要是因爲我支持\n更爲保守的經濟/國際政策，但我不\n支持我們在許多社會問題上的觀點（許多問題我覺得根本不應該是政治問題，而且直到上個世紀末它們才真正是政治問題。\n許多問題我覺得根本不應該是政治問題，而且直到最後，它們從來沒有真正成爲政治問題。",
      "title": "其他保守派覺得在今天的環境中很難支持美國共和黨嗎？"
    }
  ]
}