{
  "author": "I_731",
  "original_created_utc": 1660064632,
  "title": "Why do we look for signs of life on other planets using human parameters?",
  "created_utc": 1660091883,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I guess what I’m trying to ask is why do we looks for signs of life in space using things that humans need(oxygen and water)? The word alien literally means something completely different to us yet we look for signs of other life assuming they depend on the same things that we do. I get it rules out certain places and allows us to move on quicker but could we not be missing out on some discoveries?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/wk8mub/why_do_we_look_for_signs_of_life_on_other_planets/",
  "subreddit": "NoStupidQuestions",
  "id": "wk8mub",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I guess what I’m trying to ask is why do we looks for signs of life in space\nusing things that humans need(oxygen and water)? The word alien literally means\nsomething completely different to us yet we look for signs of other life\nassuming they depend on the same things that we do. I get it rules…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が聞きたいのは、なぜ私たちは宇宙で生命の痕跡を探すのか、ということなんです。\n宇宙で生命の痕跡を探すのか？エイリアンという言葉は、文字通り\n私たちとは全く違うものなのに、私たちは他の生命体のサインを探すのでしょうか？\n我々と同じものに依存していると仮定して。ルールはわかったが...",
      "title": "なぜ私たちは、人間のパラメータを使って他の惑星の生命の痕跡を探すのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想我想问的是，为什么我们要寻找太空中的生命迹象？\n使用人类需要的东西（氧气和水）？外星人这个词的字面意思是\n对我们来说完全不同的东西，但我们却在寻找其他生命的迹象\n假设他们依赖与我们一样的东西。我明白这个规则...",
      "title": "为什么我们要用人类的参数去寻找其他星球上的生命迹象？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想我想問的是，爲什麼我們要尋找太空中的生命跡象？\n使用人類需要的東西（氧氣和水）？外星人這個詞的字面意思是\n對我們來說完全不同的東西，但我們卻在尋找其他生命的跡象\n假設他們依賴與我們一樣的東西。我明白這個規則...",
      "title": "爲什麼我們要用人類的參數去尋找其他星球上的生命跡象？"
    }
  ]
}