{
  "author": "noodlesource",
  "the_new_excerpt": "Microsoft was a great company in 1999. It posted record revenues of $20bn,\nrecord net income of $8bn, and soared to a market cap of $615bn.\n\nWith that being said, if you had invested in Microsoft at the top of the dot com\nbubble you would not have seen a return on your investment until 2016.\n\nI…",
  "original_created_utc": 1613234945,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "1999年，微软是一家伟大的公司。它公布了创纪录的200亿美元的收入。\n80亿美元的创纪录净收入，并飙升至6150亿美元的市值。\n\n说到这里，如果你在互联网的巅峰时期投资了微软\n泡沫你要到2016年才会看到投资回报。\n\nI…",
      "title": "有些估值是荒谬的--我将做空10%。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "1999年，微軟是一家偉大的公司。它公佈了創紀錄的200億美元的收入。\n80億美元的創紀錄淨收入，並飆升至6150億美元的市值。\n\n說到這裏，如果你在互聯網的巔峯時期投資了微軟\n泡沫你要到2016年纔會看到投資回報。\n\nI…",
      "title": "有些估值是荒謬的--我將做空10%。"
    }
  ],
  "title": "Some valuations are absurd - I am going 10% short",
  "created_utc": 1613271599,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Microsoft was a great company in 1999. It posted record revenues of $20bn, record net income of $8bn, and soared to a market cap of $615bn.</strong></p>\n\n<p><strong>With that being said, if you had invested in Microsoft at the top of the dot com bubble you would not have seen a return on your investment until 2016.</strong></p>\n\n<p>I believe we are now in the midst of a similar timeline. Some valuations are through the roof without any grounding in reality. It is hard to know when it will correct but I am convinced that at some point investors will once again begin valuing companies as the value of their future free cash flows + a risk premium.</p>\n\n<p>For this reason I am adapting my personal investment strategy from 100% long to <strong>110% long and -10% short</strong> with some select picks.</p>\n\n<p>I will be diversifying my shorts and limiting their initial notional value, wary of irrationality continuing. I expect this to be an investment strategy I can stick to for at least 1 year.</p>\n\n<p><strong>I&#39;d love to hear any contrarian views to my thesis and any thoughts on my short picks or suggestions.</strong></p>\n\n<hr/>\n\n<p>My picks (each will be -1% of my portfolio):</p>\n\n<p><strong>1. TSLA</strong> Not much needed to be said. Great company, love their products and direction. $800bn valuation is ludicrous.</p>\n\n<p><strong>2. SHOP</strong> $180bn valuation for $2.5bn revenue in 2020. 70% growth rate is great but where is my risk premium for my investment today?</p>\n\n<p><strong>3. UBER</strong> $113bn valuation with a -$22bn accumulated deficit. Gave up on self driving (their roadmap to profitability?) back in December. Propped up by SoftBank.</p>\n\n<p><strong>4. ZM</strong> $126bn valuation with $2bn TTM revenue and $400m net income. Guys, this is a company who offer video communication software. 0 MOAT or risk premium.</p>\n\n<p><strong>5. SNOW</strong> $85bn market cap, $489m TTM revenue and -$400m net income. For a data cloud service (hello have you heard of AWS/Azure/etc.?)</p>\n\n<p><strong>6. DASH</strong> $65bn market cap, $2bn revenue, -$200m net income. Financials aren&#39;t the most atrocious on this list but food delivery services (like ride sharing) are too location specific. No roadmap to global domination here.</p>\n\n<p><strong>7. LMND</strong> $10bn market cap for a &quot;tech&quot; insurance company with less than $100m revenue, -$100m net income. Their S-1 is filled with talk about their AI. Their &quot;chatbot AI&quot; on their website is a web form with a photo of a woman. Seriously?</p>\n\n<hr/>\n\n<p>Picks I am less bearish on but still considering going short.</p>\n\n<p><strong>8. ABNB</strong> $128bn market cap, $5bn revenue pre-covid. This one is hard for me. I like this company and think they have potential as a global business. Also a great pick post-covid. But I think $128bn is still too insane. Could be convinced otherwise.</p>\n\n<p><strong>9. NIO</strong> $94bn for the Chinese Tesla. Close to bankruptcy pre-2020 EV hype. Now has some momentum but $94bn worth? China growth can be scary though...</p>\n\n<p><strong>10. SPCE</strong> $13bn valuation. Richard Branson&#39;s pet project run rampant with a Chamath SPAC. Space, very cool. Return on investment is where sorry?</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/investing/comments/lj4312/some_valuations_are_absurd_i_am_going_10_short/",
  "subreddit": "investing",
  "id": "lj4312",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728621134
}