{
  "author": "handful_of_prozac",
  "original_created_utc": 1643756988,
  "title": "An Addiction will ruin your crypto trading",
  "created_utc": 1643798448,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I wanted to raise awareness on this, because I think there isn&amp;#39;t much information out there on this topic (at least it hasn&amp;#39;t come across me).&lt;/p&gt;\n\n&lt;p&gt;The thing is, when it comes to addictions, the vast majority of them trigger dopamine, when you do that particular activity. That&amp;#39;s the main reason why you KEEP doing it. This will mess with your thinking, because you are chasing only that.&lt;/p&gt;\n\n&lt;p&gt;When you are trading crypto, you will definietly need to get your mind right before making any decisions. \nWe all know that good feeling when we see the gains. It triggers dopamine, just like an addiction. Now, I want to say there is nothing wrong with feeling good about the gains. However, unfortunately if you have an addiction (doesn&amp;#39;t matter what kind: drugs, porn, smoking very regularly) you are much more likely to just trade for the feeling of it. \nI experienced this myself.\nIt&amp;#39;s also dangerous to trade when you are in the process of kicking the addiction!&lt;/p&gt;\n\n&lt;p&gt;If you can&amp;#39;t get rid of it alone, get help from others and don&amp;#39;t be ashamed of it! &lt;/p&gt;\n\n&lt;p&gt;Also, if you have porn addiction, feel free to DM me if you want. I&amp;#39;m no professional but I&amp;#39;m ready to help!&lt;/p&gt;\n\n&lt;p&gt;Thanks for reading!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 315,
  "permalink": "/r/CryptoCurrency/comments/si8krl/an_addiction_will_ruin_your_crypto_trading/",
  "subreddit": "CryptoCurrency",
  "id": "si8krl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I wanted to raise awareness on this, because I think there isn't much\ninformation out there on this topic (at least it hasn't come across me).\n\nThe thing is, when it comes to addictions, the vast majority of them trigger\ndopamine, when you do that particular activity. That's the main reason why…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "あまり知られていないと思うので、啓発したいと思いました。\nこのトピックに関する情報は、世の中に出回っていません（少なくとも私には伝わっていません）。\n\nつまり、依存症について言えば、その大半は、以下のような引き金になるということです。\nドーパミンは、その特定の活動をするときに それが主な理由です...",
      "title": "中毒はあなたの暗号取引を台無しにする"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想提高对这个问题的认识，因为我认为关于这个问题的信息并不多。\n关于这个话题的信息（至少我没有遇到过）。\n\n问题是，当涉及到成瘾问题时，绝大多数的成瘾都会触发\n多巴胺，当你做那个特定的活动。这就是为什么...",
      "title": "上瘾会毁了你的加密货币交易"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想提高對這個問題的認識，因爲我認爲關於這個問題的信息並不多。\n關於這個話題的信息（至少我沒有遇到過）。\n\n問題是，當涉及到成癮問題時，絕大多數的成癮都會觸發\n多巴胺，當你做那個特定的活動。這就是爲什麼...",
      "title": "上癮會毀了你的加密貨幣交易"
    }
  ]
}