{
  "author": "futureswife",
  "original_created_utc": 1629415874,
  "title": "Why would Onlyfans ban porn?",
  "created_utc": 1629462104,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Like let&#39;s be honest, the only reason anybody knows about Onlyfans or uses it is because of the porn on there. Tbh until this moment I didn&#39;t even know that Onlyfans wasn&#39;t a dedicated porn site, and even now knowing that I still couldn&#39;t tell you what other purposes it has other than porn. This is like if Steam banned video games and turned it into a social media platform. It just doesn&#39;t make sense why you&#39;d ban the thing that made you relevant in the first place</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/NoStupidQuestions/comments/p7qbs0/why_would_onlyfans_ban_porn/",
  "subreddit": "NoStupidQuestions",
  "id": "p7qbs0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Like let's be honest, the only reason anybody knows about Onlyfans or uses it is\nbecause of the porn on there. Tbh until this moment I didn't even know that\nOnlyfans wasn't a dedicated porn site, and even now knowing that I still\ncouldn't tell you what other purposes it has other than porn. This is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "正直に言うと、Onlyfansを知っている人や使っている人がいるのは\nそこにポルノがあるからです。この瞬間まで、Onlyfansがポルノ専用サイトではないことを知らなかった。\nOnlyfansが専用のポルノサイトではないことも知らなかったし、それを知っていてもまだ\n今でもポルノ以外の目的があるとは言えません。これは...",
      "title": "なぜOnlyfansはポルノを禁止するのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "说实话，任何人知道Onlyfans或使用它的唯一原因是\n因为那里的色情内容。直到这一刻，我甚至不知道\nOnlyfans并不是一个专门的色情网站，即使现在知道了，我仍然\n即使现在知道了，我仍然无法告诉你，除了色情之外，它还有什么其他目的。这就是...",
      "title": "为什么Onlyfans会禁止色情？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "說實話，任何人知道Onlyfans或使用它的唯一原因是\n因爲那裏的色情內容。直到這一刻，我甚至不知道\nOnlyfans並不是一個專門的色情網站，即使現在知道了，我仍然\n即使現在知道了，我仍然無法告訴你，除了色情之外，它還有什麼其他目的。這就是...",
      "title": "爲什麼Onlyfans會禁止色情？"
    }
  ]
}