{
  "author": "short_circuit3",
  "the_new_excerpt": "Disclosure: I am not exposed to SMG through any means (equity, credit, options,\netc.)\n\nDisclaimer: This is not full and comprehensive due diligence. This is a long\nthesis with growth catalysts accompanied by a financial model. Do your own\nresearch before investing, and heavily consider the risks.\n\n-…",
  "original_created_utc": 1615929450,
  "localize": [
    {
      "locale": "zh",
      "title": "多頭論文 - Scotts Miracle Gro (SMG) - 較現時價格有17-20%的上升空間 - 包括估值和模型。",
      "the_new_excerpt": "披露：本人没有通过任何方式（股权、信贷、期权）接触SMG。\n等）。)\n\n声明：这并不是完整全面的尽职调查。这是一个长\n伴随着财务模型的增长催化剂的论文。自己动手\n在投资前进行研究，并大量考虑风险。\n\n-…"
    },
    {
      "locale": "zh-Hant",
      "title": "多頭論文 - Scotts Miracle Gro (SMG) - 較現時價格有17-20%的上升空間 - 包括估值和模型。",
      "the_new_excerpt": "披露：本人沒有通過任何方式（股權、信貸、期權）接觸SMG。\n等）。)\n\n聲明：這並不是完整全面的盡職調查。這是一個長\n伴隨着財務模型的增長催化劑的論文。自己動手\n在投資前進行研究，並大量考慮風險。\n\n-…"
    }
  ],
  "title": "Long Thesis - Scotts Miracle Gro (SMG) - 17-20% Upside From Current Price - Valuation and Model Included.",
  "created_utc": 1615984344,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Disclosure: I am not exposed to SMG through any means (equity, credit, options, etc.)</p>\n\n<p>Disclaimer: This is not full and comprehensive due diligence. This is a long thesis with growth catalysts accompanied by a financial model. Do your own research before investing, and heavily consider the risks.</p>\n\n<hr/>\n\n<p><strong>Recommendation: BUY SMG with a 18-24 month price target of $275 (P/E, EV/EBITDA, Perp. Growth), representing a 17% upside from the current price.</strong>\nSMG is NOT a marijuana stock, and comparisons to the regular &quot;Reddit basket&quot; of marijuana stocks is disingenuous to SMG&#39;s business model. It is a gardening and cultivation stock that recently acquired a hydroponics company that gives the company exposure to the marijuana market from a distance. Due to this, they trade at lower betas and valuation multiples than typical marijuana stocks and still source revenue from their regular gardening US Consumer Segment, currently supplemented by Hawthorne which is exploding in growth.</p>\n\n<p><strong>Two Catalyst Events:</strong> Virtual Investor Day on 4/8/21 and 2Q20 Earnings on 5/5/21. Both these days will allow the opportunity for the management to update their guidance and tone on FY21 and the future. Emphasis can be expected on Hawthorne and projections for growth.  </p>\n\n<hr/>\n\n<table><thead>\n<tr>\n<th>Summary Valuations</th>\n<th>Implied Price</th>\n<th>Upside</th>\n</tr>\n</thead><tbody>\n<tr>\n<td>Perpetual Growth</td>\n<td>$271.59</td>\n<td>16.18%</td>\n</tr>\n<tr>\n<td>EV/EBITDA</td>\n<td>$271.75</td>\n<td>16.25%</td>\n</tr>\n<tr>\n<td>P/E</td>\n<td>$281.57</td>\n<td>20.45%</td>\n</tr>\n<tr>\n<td><em>Average</em></td>\n<td><em>$274.97</em></td>\n<td><em>17.6%</em></td>\n</tr>\n</tbody></table>\n\n<hr/>\n\n<p><strong>Company Overview:</strong> The Scotts Miracle-Gro Company manufactures, markets, and sells consumer lawn and garden products in the United States and internationally. The company operates through three segments: U.S. Consumer, Hawthorne, and Other. </p>\n\n<p><strong>US Consumer:</strong> It offers lawn care products, such as lawn fertilizers, grass seed products, spreaders, other durable products, and outdoor cleaners, as well as lawn-related weed, pest, and disease control products. The company also provides gardening and landscape products, including water-soluble and continuous-release plant foods, potting mixes and garden soils, mulch and decorative ground cover products, plant-related pest and disease control products, organic garden products, and lives goods and seeding solutions. </p>\n\n<p><strong>Hawthorne:</strong> In addition, it offers hydroponic products that help users to grow plants, flowers, and vegetables using little or no soil; lighting systems and components for use in hydroponic and indoor gardening applications; and insect, rodent, and weed control products for home areas. </p>\n\n<hr/>\n\n<p><strong>Hawthorne Analysis</strong>: This is the growth portion of SMG and where this analysis is focused. Historically focused on lawn and garden products, SMG completed their acquisition of two hydroponics companies in 2015 to move into the marijuana market in 2015 operating under the name Hawthorne, which currently makes up ¼ of SMG’s revenue. </p>\n\n<ul>\n<li>With pending marijuana reform on a state and federal level, Hawthorne is primed to explode in growth over the next five years off the back of a Democratic majority in the Legislative branch in support of reform – blue wave is hot and GA runoff wins are positive for outlook. </li>\n<li>Management is extremely bullish on Hawthorne’s potential in the near and long-term (noted in 4Q20 (<a href=\"https://scottsmiraclegro.gcs-web.com/news-releases/news-release-details/scottsmiracle-gro-announces-record-fourth-quarter-and-full-year\">Release</a>/<a href=\"https://scottsmiraclegro.gcs-web.com/static-files/7ee63590-92ad-4aae-a1fe-d2a99ac12e1e\">Call</a>) and 1Q21(<a href=\"https://scottsmiraclegro.gcs-web.com/news-releases/news-release-details/scottsmiracle-gro-announces-record-first-quarter-results-us\">Release</a>/<a href=\"https://scottsmiraclegro.gcs-web.com/static-files/33c0d8bc-8fa5-4393-9532-e49494e12ad7\">Call</a>) earnings and <a href=\"https://scottsmiraclegro.gcs-web.com/static-files/05623e13-ae53-4f8c-89ac-6d4bd767db48\">Raymond James Investors Conference</a> + <a href=\"https://scottsmiraclegro.gcs-web.com/static-files/fd136668-3d44-433d-910e-16969ee69297\">Truist Consumer Symposium</a> presentations in 1Q20). Hawthorne was growing 70% YoY back to June 2019; shows the velocity of growth pre-pandemic.</li>\n<li>Markets like Michigan and Oklahoma were stifled by COVID in 2020 and are expected to rebound in 2021/2022. New markets including NY, PA, and VA are planning and implementing marijuana reform bulls and are expected to open in the coming years. These markets can potentially grow to compose a majority of future Hawthorne revenue. SMG recently completed the construction of a R&amp;D facility in British Columbia and will allow the company to push new products and methods to supplement their Hawthorne product line (notes below on facility). </li>\n</ul>\n\n<hr/>\n\n<p><strong>US Consumer Analysis:</strong> The company has performed incredibly well through COVID as consumers improve their garden and lawn in lockdowns nationwide; revenue was up 30% in FY2020. Growth is expected to continue this US Consumer segment as COVID impact falls into the summer and consumers return to retail stores with stimulus money in their pockets. </p>\n\n<ul>\n<li>Management went in depth into their US Consumer segment at the RJ Investors Conference (linked above) so more color can be found there. Mgmt called it a &quot;sticky industry&quot; where 80-90% of consumers come back the next year to buy more SMG products. Competitors are present on retail shelves, but the staying power is with SMG, not the rest.</li>\n<li>The segment found incredible revenue (especially compared to many industries) during COVID as people were stuck at home over the summer and rebuilding their gardens and lawns.</li>\n</ul>\n\n<hr/>\n\n<p><strong><a href=\"https://scottsmiraclegro.gcs-web.com/news-releases/news-release-details/\">Recent 1Q21 Earnings</a> - 02/03/21</strong></p>\n\n<ul>\n<li>Company-wide sales increased 105% to $748.6m in 1Q, driven by support in US Consumer and continued momentum in Hawthorne</li>\n<li>Reported 1Q profit: first time ever in company history (business is seasonal with strong 2Q and 3Q)</li>\n<li>1Q sales for Hawthorne increased 71% to $156m. Strong demand in all categories of Hawthorne</li>\n<li>1Q sales for US Consumer increased 147% to $408m. Purchases at retail partners increased 40%</li>\n<li>Heavy investment into marketing – Super Bowl ad, “targeted and driven” approach to social media</li>\n</ul>\n\n<p><strong>Outlook on Performance</strong></p>\n\n<ul>\n<li>Noted in the 1Q21 earnings linked above.</li>\n<li>Full company FY21 sales growth of 1%-6%</li>\n<li>US Consumer expected &quot;positive sales growth&quot; (SMG updated guidance on US Consumer on 3/1/21)</li>\n<li>Hawthorne FY21 sales growth of 20%-30%</li>\n</ul>\n\n<hr/>\n\n<p><strong>State Legalization Progress</strong></p>\n\n<ul>\n<li>New York: NY Senate Bill S854 would legalize for recreational use. Cuomo: “Not only will legalizing and regulating the adult-use cannabis market provide the opportunity to generate much-needed revenue, but it also allows us to directly support the individuals and communities that have been most harmed by decades of cannabis prohibition.”</li>\n<li>Virginia: On 02/27/2021, the VA General Assembly approved legislation that would legalize the sale and possession of recreational marijuana for adult recreational use beginning on January 1, 2024. Governor has not yet signed the legislation and may propose amendments that would speed up the effective date of the proposed law.</li>\n<li>New Jersey: On 02/22/2021, NJ Governor Murphy signed into law the New Jersey Cannabis Regulatory, Enforcement Assistance, and Marketplace Modernization Act (CREAMMA), legalizing marijuana for adult recreational use in New Jersey and prohibiting employers from taking adverse action against employees solely because they use marijuana.</li>\n<li>Pennsylvania: PA Governor has made several calls for state legalization, working on legislation.</li>\n<li>South Dakota: Voters approved a medical marijuana program in the state, but Governors and the legislature have introduced bills to delay the implementation of the program.</li>\n<li>Other states: CT, FL, HI, MD, ND, OK all have introduced bills into the legislature for marijuana reform.</li>\n</ul>\n\n<hr/>\n\n<p><strong>R&amp;D Facility in Kelowna, BC</strong></p>\n\n<ul>\n<li>Laboratories, indoor grow suites, training areas. Testing cultivation systems and techniques using lighting, fertilization and irrigation systems, growing mediums, and research protocols. </li>\n<li>Also includes research on cannabis genetics and growing systems to provide cannabis products.</li>\n<li>Innovation is the keyword for Hawthorne. Especially with LED lights, innovation will allow Scotts to push new products.</li>\n<li>Mgmt had a great point elucidated in the Raymond James Conference: Compare Hawthorne to TV. TV’s have lasted forever, but innovation is strong. You likely do not have your 20-year-old tube TV even though it may work. SMG pushing innovative products and methods to marijuana cultivation promote a sphere of influence in the cultivation industry.</li>\n</ul>\n\n<hr/>\n\n<p><strong>Model Assumptions and Valuation</strong></p>\n\n<p>I&#39;ve also created a financial model that includes a DCF valuation with three share price calculations (P/E, EV/EBITDA, and Perpetual Growth). While the confidence of each method is medium, the fact that each method implies around the same share price raises the confidence level. Excerpts of relevant sections are attached. A screenshot of the <a href=\"https://i.imgur.com/t6Wo7hL.png\">Unlevered Free Cash Flow Buildup is attached here.</a></p>\n\n<p><a href=\"https://i.imgur.com/USmgg83.png\">Revenue Growth Assumptions</a></p>\n\n<ul>\n<li>Assume 6% revenue growth in FY21, with USC, Hawthorne, and Other growing at 0.5%, 21.6% and 31.1% respectively, congruent with management&#39;s guidance above.</li>\n</ul>\n\n<p><a href=\"https://i.imgur.com/1dPFEW0.png\">General Income Statement Assumptions</a></p>\n\n<ul>\n<li>Gross Profit Margin is expected to &quot;decline 125 to 175 basis points&quot; in FY21, and the GP Margin assumptions reflect this.</li>\n<li>In connection with SMG&#39;s acquisition of Sunlight Supply in 3Q18, they announced a company-wide restructuring effort to reduce operating costs and realizing synergies from acquisitions. Operating Margin assumptions reflect this rise.</li>\n</ul>\n\n<p><a href=\"https://imgur.com/a/Qm2XNZv\">WACC was pulled directly from Bloomberg, and is 8.7%.</a></p>\n\n<hr/>\n\n<p><strong>Valuation Results</strong></p>\n\n<p><em>Perpetual Growth</em>:\nA perpetual growth rate of 2.10% was chosen for this calculation by <a href=\"https://i.imgur.com/tDa8BcY.png\">finding the sumproduct of SMG&#39;s geographical share of revenue and the respective GDP growth for each region</a>. &quot;International&quot; is defined by the G7 countries minus America. </p>\n\n<ul>\n<li>The terminal value calculation <a href=\"https://i.imgur.com/yTRXXV7.png\">is attached here</a></li>\n<li>And a sensitized analysis of WACC vs Growth rate <a href=\"https://i.imgur.com/CiA78BQ.png\">is attached here</a></li>\n<li>Implied Share Price is $271.59</li>\n</ul>\n\n<p><em>EV/EBITDA</em>: An exit multiple of 14.1x was chosen for the exit EV/EBITDA exit multiple method. Included companies in the comparables analysis to arrive at the exit multiple include CHD, CF, MOS and CTVA.</p>\n\n<ul>\n<li>The terminal value calculation <a href=\"https://i.imgur.com/HucM0qV.png\">is attached here</a></li>\n<li>And a sensitized analysis of WACC vs EV/EBITDA <a href=\"https://i.imgur.com/hxw2gQe.png\">is attached here</a></li>\n<li>Implied share price is $271.75</li>\n</ul>\n\n<p><em>Price To Earnings</em>: A simple P/E comparable was also included, but since comparables to SMG are far and few between, it is not a truly strong data point. P/E used the same comparable companies as the EV/EBTIDA calculation, and a screenshot <a href=\"https://i.imgur.com/jxipRSs.png\">is attached here</a>.</p>\n\n<ul>\n<li>Implied share price is $281.57</li>\n</ul>\n\n<hr/>\n\n<p><strong>Recap</strong>: Huge growth in Hawthorne makes SMG a prime play for returns with a 17% upside from current valuations. Hawthorne is exploding and you want to get in on the fround floor before legalization occurs with the current &quot;blue wave&quot; and cultivation becomes more common. SMG has &quot;sticky&quot; US Consumer segment that currently makes up 75% of their revenue, but Hawthorne is expected to cannibalize this revenue and result in a USC/Hawthorne revenue split of 55%/45% in the coming years. My model has forecasted the growing potential of the company and arrived at a 17% upside for SMG.\nLooking forward to discussing potential supports and counterarguments to this thesis.</p>\n</div><!-- SC_ON -->",
  "score": 45,
  "permalink": "/r/investing/comments/m6joep/long_thesis_scotts_miracle_gro_smg_1720_upside/",
  "subreddit": "investing",
  "id": "m6joep",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147379967
}