{
  "author": "Appropriate_Win_7829",
  "original_created_utc": 1643839080,
  "title": "Which coin gave you completely lost faith in?",
  "created_utc": 1643866407,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;After a few false starts, I’ve condensed my portfolio into coins I fully believe in. Time will tell if they are good choices are not, but for now I’m confident. &lt;/p&gt;\n\n&lt;p&gt;The biggest cut i’ve made is Solana, thankfully before the January crash kicked in. I didn’t make any money, but I didn’t lose any either. So could be worse. &lt;/p&gt;\n\n&lt;p&gt;Knowing my luck it will be worth like 1000 dollars a coin in a couple of years, but the rampant tech issues made me lose enough confidence to cash out my Sol.&lt;/p&gt;\n\n&lt;p&gt;Which coin have you completely lost faith in?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 354,
  "permalink": "/r/CryptoCurrency/comments/sj16yr/which_coin_gave_you_completely_lost_faith_in/",
  "subreddit": "CryptoCurrency",
  "id": "sj16yr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "After a few false starts, I’ve condensed my portfolio into coins I fully believe\nin. Time will tell if they are good choices are not, but for now I’m confident.\n\nThe biggest cut i’ve made is Solana, thankfully before the January crash kicked\nin. I didn’t make any money, but I didn’t lose any…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "何度か失敗を繰り返した後、私は自分のポートフォリオを完全に信頼できるコインに凝縮しました。\nである。それが良い選択かどうかは時間が経てば分かるが、今のところ自信はある。\n\n私が行った最大のカットはSolanaで、ありがたいことに1月の暴落が始まる前でした。\nで。儲けはなかったが、損はしなかった・・・。",
      "title": "完全に信用を失ったコインは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "经过几次错误的开始，我已经将我的投资组合浓缩为我完全相信的硬币。\n中。时间会证明它们是否是好的选择，但现在我很有信心。\n\n我所做的最大的削减是Solana，幸好是在1月的暴跌之前。\n在。我没有赚到任何钱，但我没有失去任何...",
      "title": "哪种硬币让你完全失去了信心？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "經過幾次錯誤的開始，我已經將我的投資組合濃縮爲我完全相信的硬幣。\n中。時間會證明它們是否是好的選擇，但現在我很有信心。\n\n我所做的最大的削減是Solana，幸好是在1月的暴跌之前。\n在。我沒有賺到任何錢，但我沒有失去任何...",
      "title": "哪種硬幣讓你完全失去了信心？"
    }
  ]
}