{
  "author": "mrbiggelsworth07",
  "the_new_excerpt": "I am in my mid 30s and have been lucky enough to see three major cycles-housing,\ntech, and crypto.\n\nDisclaimer-not investing advice, yada yada yada\n\nI will tell you one thing-the people I know with real money are buying bitcoin.\nThe people will kind of real money-well, they are buying bitcoin, and…",
  "original_created_utc": 1613286833,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我今年30多岁，有幸看到了三大周期--住房。\n科技，和加密技术。\n\n免责声明--不是投资建议，呀呀呀。\n\n我会告诉你一件事--我认识的人用真金白银买了比特币。\n人们会用真金白银来购买比特币，而且... ...",
      "title": "唠叨"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我今年30多歲，有幸看到了三大週期--住房。\n科技，和加密技術。\n\n免責聲明--不是投資建議，呀呀呀。\n\n我會告訴你一件事--我認識的人用真金白銀買了比特幣。\n人們會用真金白銀來購買比特幣，而且... ...",
      "title": "嘮叨"
    }
  ],
  "title": "a rant",
  "created_utc": 1613338382,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am in my mid 30s and have been lucky enough to see three major cycles-housing, tech, and crypto.</p>\n\n<p>Disclaimer-not investing advice, yada yada yada</p>\n\n<p>I will tell you one thing-the people I know with real money are buying bitcoin. The people will kind of real money-well, they are buying bitcoin, and trying to buy more. And the people without money but with good income-well, a lot of them are waiting to buy bitcoin. And, they will blame everyone but themselves when bitcoin goes to $200k, or they will not dollar cost average, yolo in at 55k, see a 2k drop, panic sell, etc.</p>\n\n<p>For the younger generation that had the guts to buy this when it crapped the bed-good for you. I wish lambos, mansions, and wealth upon you and your families. </p>\n\n<p>The real challenge is most people with a higher than average income think they are smart, that they can time markets, etc. It is the most ridiculous thing-but I am starting to realize it&#39;s very common.</p>\n\n<p>Bitcoin reminds me of housing in 2014-2015-at this point, most people turned bearish, waiting for the next crash. What they didn&#39;t understand at the time, nor did I, was why it was happening-massive debasement and lowering of rates. If you haven&#39;t figured it out, the government will go crazy trying to prevent a crash. Just wait till the REAL money printing starts. IMHO, bitcoin is about to leave orbit.</p>\n</div><!-- SC_ON -->",
  "score": 176,
  "permalink": "/r/Bitcoin/comments/ljjrby/a_rant/",
  "subreddit": "Bitcoin",
  "id": "ljjrby",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728613341
}