{
  "author": "Major_Bandicoot_3239",
  "original_created_utc": 1624751376,
  "title": "Stop hoping and waiting for BTC to dip more.",
  "created_utc": 1624808805,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It becomes a self fulfilling prophecy. The more people on here saying I’ll buy when it hits $15k, $20k, $25k, etc. are shooting themselves in the foot. We want people to buy. We want new people interested in BTC and crypto and if they all believe this is going to dip, they won’t enter the market and…. The correction/dip will continue. We need buying pressure, not selling. Wouldn’t you rather have everyone going in now, in the low-to-mid $30,000s and just keep buying as it continues to stay sideways or go up? When we start hitting all-time highs, are you really going to care that you bought at $25k vs $30k?</p>\n\n<p>$65k to $30k is the dip. Start buying and stop talking about the hypothetical lower price you’re going to buy at. Some broken record advice… DCA. Invest 1/52nd of what you want to invest in total every week. And if that dip comes that you’ve been waiting for… stop the DCA strategy and and back up the truck to buy as much as you want. </p>\n\n<p><strong><em>steps off soapbox</em></strong></p>\n</div><!-- SC_ON -->",
  "score": 164,
  "permalink": "/r/Bitcoin/comments/o8lw7j/stop_hoping_and_waiting_for_btc_to_dip_more/",
  "subreddit": "Bitcoin",
  "id": "o8lw7j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It becomes a self fulfilling prophecy. The more people on here saying I’ll buy\nwhen it hits $15k, $20k, $25k, etc. are shooting themselves in the foot. We want\npeople to buy. We want new people interested in BTC and crypto and if they all\nbelieve this is going to dip, they won’t enter the market…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "それは、自己実現のための予言となります。15,000ドル、20,000ドル、25,000ドルになったら買おうと言っている人ほど\nと言っている人ほど、自分の足を撃っているようなものです。私たちは人々に\n人々に買ってもらいたいのです。私たちはBTCや暗号に興味を持つ新しい人々を求めています。\nそして、もし彼らが皆、これがディップすると信じていたら、彼らは市場に参入しないでしょう...。",
      "title": "BTCがもっと下がるのを期待して待つのはやめよう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这成为一个自我实现的预言。越多的人在这里说我要买\n当它达到1.5万美元、2万美元、2.5万美元等时，就是在自寻死路。我们希望\n人们购买。我们希望新人们对BTC和加密货币感兴趣，如果他们都\n如果他们都认为这将会下跌，他们就不会进入这个市场......",
      "title": "不要再希望和等待BTC下跌更多。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這成爲一個自我實現的預言。越多的人在這裏說我要買\n當它達到1.5萬美元、2萬美元、2.5萬美元等時，就是在自尋死路。我們希望\n人們購買。我們希望新人們對BTC和加密貨幣感興趣，如果他們都\n如果他們都認爲這將會下跌，他們就不會進入這個市場......",
      "title": "不要再希望和等待BTC下跌更多。"
    }
  ]
}