{
  "author": "MTK67",
  "the_new_excerpt": "To narrow the question down a bit, I'm mostly asking about works of fiction\npublished in the United States. The handful of novels I have that were printed\nbetween the mid-19th century and the 1910's all have illustrated plates.\nHowever, over the next several decades, illustrations seem to have…",
  "original_created_utc": 1619577649,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "質問を少し絞ると、主にアメリカで出版されたフィクション作品について質問しています。\nアメリカで出版された小説が中心です。私が持っている小説の中で、19世紀半ばから1910年代に印刷されたものには\n19世紀半ばから1910年代に印刷されたもので、私が持っている数少ない小説には、すべてイラスト入りのプレートが付いています。\nしかし、その後の数十年の間に、挿絵は...。",
      "title": "大人向けの本で挿絵が嫌われたのはなぜですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "为了缩小问题的范围，我主要问的是在美国出版的小说作品\n在美国出版的小说。我所拥有的少数几本在19世纪中期至1910年代期间印刷的小说\n在19世纪中期和1910年代之间，都有插图版。\n然而，在接下来的几十年里，插图似乎已经...",
      "title": "为什么插图在面向成人的书籍中变得不受欢迎？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "爲了縮小問題的範圍，我主要問的是在美國出版的小說作品\n在美國出版的小說。我所擁有的少數幾本在19世紀中期至1910年代期間印刷的小說\n在19世紀中期和1910年代之間，都有插圖版。\n然而，在接下來的幾十年裏，插圖似乎已經...",
      "title": "爲什麼插圖在面向成人的書籍中變得不受歡迎？"
    }
  ],
  "title": "Why did illustrations become unpopular in books marketed to adults?",
  "created_utc": 1619614546,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>To narrow the question down a bit, I&#39;m mostly asking about works of fiction published in the United States. The handful of novels I have that were printed between the mid-19th century and the 1910&#39;s all have illustrated plates. However, over the next several decades, illustrations seem to have shifted almost exclusively to children&#39;s books (the two notable exceptions being photographic inserts for non-fiction titles, and &quot;illustrated collector&#39;s editions&quot; of popular titles). I&#39;m curious to what extent this shift was technological (e.g. changes in printing technology), commercial (e.g. the shift from mail-order catalogs to book-of-the-month club to retail chains), and/or cultural (e.g. particular pedagogical beliefs or social figures or movements).</p>\n\n<p>(N.B. I posted this question about a year ago, got a bunch of upvotes but no responses.  I didn&#39;t see a rule against reposts, but please let me know if this isn&#39;t allowed.)</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/n051ut/why_did_illustrations_become_unpopular_in_books/",
  "subreddit": "AskHistorians",
  "id": "n051ut",
  "is_self": true,
  "media": null,
  "is_video": false
}