{
  "author": "xMarinx",
  "original_created_utc": 1639162598,
  "title": "How long can extreme fear last?",
  "created_utc": 1639200703,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It has been a few days since we entered extreme fear. As far as I have seen, it has not lasted more than a few days at most (I obviously have not been in this crypto world for a long time). &lt;/p&gt;\n\n&lt;p&gt;I saw some posts and comments of people saying that the best time to buy is after a few days when the market is in extreme fear, but it does not seem like it right now.\nEven when it seems like it starts recovering and coming back up slowly, it dips again.&lt;/p&gt;\n\n&lt;p&gt;But surely we can not stay in extreme fear for much longer?&lt;/p&gt;\n\n&lt;p&gt;Can this lead to a slow starting bear market, as I said I am quite new so I have not experienced bear market and dont know how it happens? Or should the cycle keep on going like some say, e.g. Ben Cowen?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 165,
  "permalink": "/r/CryptoCurrency/comments/rdfq1j/how_long_can_extreme_fear_last/",
  "subreddit": "CryptoCurrency",
  "id": "rdfq1j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It has been a few days since we entered extreme fear. As far as I have seen, it\nhas not lasted more than a few days at most (I obviously have not been in this\ncrypto world for a long time).\n\nI saw some posts and comments of people saying that the best time to buy is\nafter a few days when the market…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "極限の恐怖に陥ってから数日が経ちました。私が見た限りでは、それは\nは、せいぜい数日しか続かなかった（私は当然ながら、この\ncryptoの世界は長い)。\n\n購入するのに最適なタイミングは、という書き込みやコメントをいくつか見かけました。\n数日後、マーケットが...",
      "title": "極度の恐怖はどのくらい続くのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们进入极度恐惧已经有几天了。就我所见，它\n最多没有持续超过几天（我显然没有在这个\n我显然没有在这个加密货币世界呆很长时间）。\n\n我看到一些人的帖子和评论说，购买的最佳时机是\n几天后，当市场...",
      "title": "极端恐惧能持续多久？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們進入極度恐懼已經有幾天了。就我所見，它\n最多沒有持續超過幾天（我顯然沒有在這個\n我顯然沒有在這個加密貨幣世界呆很長時間）。\n\n我看到一些人的帖子和評論說，購買的最佳時機是\n幾天後，當市場...",
      "title": "極端恐懼能持續多久？"
    }
  ]
}