{
  "author": "Ynwe",
  "original_created_utc": 1630654356,
  "title": "Japan is considered a full democracy. Yet since 1955, the Liberal Democratic Party has been able to de facto rule Japan (ignoring the few years they weren't). Why?",
  "created_utc": 1630678642,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Title, besides the two exceptions (one in the 90&#39;s and one in the 2000&#39;s) that I can recall, the LDP has basically ruled Japan unterrupted. This for me is some what surprising given the variance of parties that exist, and the fact that the Japanese economy hasn&#39;t been prosperous since decades now. There are also a lot of unanswered social issues in Japan, which just adds to my confusion how this party never has ever been challenged for a prolonged period of time and seems to be able to retain power without much difficulty. Granted its political system being somewhat akin to the US/UK system overrepresents the largest party a lot, but still, both of these Anglo nations have had change in government much more frequently than Japan has. Why is Japan, de facto at least, ruled by one party?</p>\n</div><!-- SC_ON -->",
  "score": 112,
  "permalink": "/r/AskHistorians/comments/ph0et5/japan_is_considered_a_full_democracy_yet_since/",
  "subreddit": "AskHistorians",
  "id": "ph0et5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Title, besides the two exceptions (one in the 90's and one in the 2000's) that I\ncan recall, the LDP has basically ruled Japan unterrupted. This for me is some\nwhat surprising given the variance of parties that exist, and the fact that the\nJapanese economy hasn't been prosperous since decades now.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルですが、私の記憶では2つの例外（90年代と2000年代）を除いては\n自民党は基本的に日本を無傷で支配してきたと思います。これは私にとっては驚きです。\nこれは、様々な政党が存在することや、日本経済が繁栄していないことを考えると、驚くべきことです。\n日本の経済はもう何十年も繁栄していません。....",
      "title": "日本は完全な民主主義国家と言われています。しかし、1955年以来、自民党は事実上、日本を支配することができました（そうでなかった数年間は無視して）。なぜだろう？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "除了两个例外（一个在90年代，一个在2000年代），我记得\n我记得，自民党基本上没有中断过对日本的统治。这对我来说是有些\n这对我来说有些令人惊讶，因为存在着各种各样的政党，而且日本的经济并不繁荣。\n日本经济从几十年前就没有繁荣过，....",
      "title": "日本被认为是一个完全的民主国家。然而，自1955年以来，自民党一直能够在事实上统治日本（忽略了他们没有统治的那几年）。为什么呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "除了兩個例外（一個在90年代，一個在2000年代），我記得\n我記得，自民黨基本上沒有中斷過對日本的統治。這對我來說是有些\n這對我來說有些令人驚訝，因爲存在着各種各樣的政黨，而且日本的經濟並不繁榮。\n日本經濟從幾十年前就沒有繁榮過，....",
      "title": "日本被認爲是一個完全的民主國家。然而，自1955年以來，自民黨一直能夠在事實上統治日本（忽略了他們沒有統治的那幾年）。爲什麼呢？"
    }
  ]
}