{
  "author": "scracer14",
  "original_created_utc": 1632895709,
  "title": "What if the US Congress was replaced with a smart contract?",
  "created_utc": 1632918646,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Think about it, every US citizen gets issued one VOTE token, and people can propose changes to governance to be voted on by the population. </p>\n\n<p>Obviousely we are decades away, but imagine a world where partisian bickering and pandering to an electorate doesn&#39;t erode the lives of the population.</p>\n\n<p>Is it possible a world could exist where politicians relinquesh control in the name of governance?</p>\n\n<p>We wouldn&#39;t even need congress to &quot;protect&quot; us from big bad banks because people would put money where it made sense for them. </p>\n\n<p>Instead of relying in investment managers to direct our funds through vehicles only viable because of dollars greasing the wheels with congress.</p>\n\n<p>The greatest Ponzi of all, the &quot;money circle of life&quot;: poor &gt; rich, rich &gt; banks, banks &gt; politicians, politicians &gt; token &quot;subsidies&quot; to poor; upended into a codified governance protocol.</p>\n\n<p>I guess it&#39;s been a while since I posted, so 500 words is an issue. I probably should have shared a link to an article posted 400 times today...</p>\n</div><!-- SC_ON -->",
  "score": 185,
  "permalink": "/r/CryptoCurrency/comments/pxpa3v/what_if_the_us_congress_was_replaced_with_a_smart/",
  "subreddit": "CryptoCurrency",
  "id": "pxpa3v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Think about it, every US citizen gets issued one VOTE token, and people can\npropose changes to governance to be voted on by the population.\n\nObviousely we are decades away, but imagine a world where partisian bickering\nand pandering to an electorate doesn't erode the lives of the population.\n\nIs it…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "考えてみてください。米国市民は全員、1つのVOTEトークンを発行され、人々は統治の変更を提案して、住民の投票を受けることができます。\n統治の変更を提案し、国民の投票で決定することができます。\n\n明らかに何十年も先の話ですが、党派間の争いや選挙民への迎合が国民の生活を破壊しない世界を想像してみてください。\n選挙民に迎合することで国民の生活が損なわれることのない世界を想像してみてください。\n\nそれは...",
      "title": "米国議会がスマートコントラクトに置き換えられたら？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "想一想，每个美国公民都会得到一个投票令牌，而人们可以\n人们可以提议改变治理，由民众投票决定。\n\n显然，我们还需要几十年的时间，但想象一下，在这个世界上，党派的争吵\n和迎合选民的做法不会侵蚀民众的生活。\n\n这是不是...",
      "title": "如果美国国会被智能合约取代会怎样？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "想一想，每個美國公民都會得到一個投票令牌，而人們可以\n人們可以提議改變治理，由民衆投票決定。\n\n顯然，我們還需要幾十年的時間，但想象一下，在這個世界上，黨派的爭吵\n和迎合選民的做法不會侵蝕民衆的生活。\n\n這是不是...",
      "title": "如果美國國會被智能合約取代會怎樣？"
    }
  ]
}