{
  "author": "cheeseburger_daddy",
  "original_created_utc": 1627602658,
  "title": "Please don’t let this place become Wall Street Bets.",
  "created_utc": 1627616442,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><em>I apologise for the rant. I know this is an Internet forum - but to many of us, this is truly a community. A community that has been around for a long time, where bonds have been made, and people, friends even, have gone through the ups and down of this wild wild crypto ride for a long long time.</em> </p>\n\n<p>Since moons, well, mooned - we’ve had a huge influx of newcomers join. And that’s great. More people means more opinions means more constructive discussions and different perspectives. If a community never grew, neither would our minds, and discussions would quickly stagnate. </p>\n\n<p>And I get it. You realise members of this sub can earn actual crypto, with real-life value. So why shouldn’t you do too? It’s free, it’s worth money - <em>what more can anyone ask for?</em> </p>\n\n<p>But please, and this goes out to all newcomers: before you start spamming low quality shitposts, the same “news” links over and over from low tier news sources, and the same self-stories that have been over-flooding other subs (I swear some of you don’t even bother paraphrasing it even the tiniest bit) - <strong>take the time to read the rules, and learn - at least the tiniest bit - the etiquette of this community.</strong> <em>Shit, at least the scope of this community.</em></p>\n\n<p>Over the last week I’ve witnessed a baffling increase of:</p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>Crappy links from bottom tier news sources predicting X price for this by eow, eom or eoy. Posted over and over again. </li>\n<li>Comment sections full of people talking about how ‘crypto is just great for buying drugs’</li>\n<li>Posts that have nothing to do with crypto. I get it - RobbingHood had their IPO and it tanked. One post is enough. If you want to discuss their stock - there are plenty of dedicated communities for that - stock discussions.</li>\n<li>Posts about “fighting the hedgies”</li>\n<li>Posts about short squeezing Bitcoin.</li>\n<li>Posts about Wall Street bad, hating Wall Street, and now Jordan Belfort says this, predicts that.</li>\n<li>Random shilling of actual shitcoins (I mean <a href=\"/r/cryptomoonshoots\">r/cryptomoonshoots</a> level shitcoins).</li>\n</ul>\n\n<p>And this is just out the top of my head. </p>\n\n<p>&#x200B;</p>\n\n<p>If you enter someone’s home, you wouldn’t shit all over their carpet? If you meet people from different backgrounds, you wouldn’t shit all over their culture? You would adapt to their ways, or at the very least take them into consideration? <em>Right?</em> </p>\n\n<p><strong>Crypto is a beautiful, fascinating and truly magical thing. There is so much to learn, so much to discover, so much to build, and so much to discuss. And this community, and its members, hold so much knowledge. If you’re interested in something very particular, don’t understand something, curious about something - just ask! If you found some cool information, made an analysis, whipped up an infographic, have some breaking news - share it!</strong> </p>\n\n<p>But at the very least, keep it focused on crypto. </p>\n\n<p>Moons are cool - and eventually, they will come to you. There is no need to spam garbage. As with anything in crypto, patience is the key. </p>\n\n<p>Take the time to learn, to inform yourself, to grow your passion and your newly found interest. Educate yourself. Inform yourself. Become a member of the community. Don’t be that guy. </p>\n\n<p>So please, let’s keep this wonderful sub just that - wonderful - together, as a community. Don’t turn this into Wall Street Bets or Satoshi Street Bets. Don&#39;t let this sub turn to shit. </p>\n\n<p>Thank you for reading. </p>\n\n<p><em>- A tired and irritated cheeseburger</em></p>\n\n<p><em>Edit</em>: I am aware I shit on my own point by using the self-story flair. But at fault of there being no other fitting flair, that&#39;s the way it will have to be :p</p>\n\n<p><em>Edit 2</em>: I am by no means shitting on WallstreetBets, or any other sub. I enjoy lurking there too. I enjoy the shittalk there too. But this is a Cryptocurrency sub, so let’s try, together, to keep it that way.</p>\n\n<p><em>Edit 3</em>: If you want to be more involved, please also head over to <a href=\"/r/CryptoCurrencyMeta\">r/CryptoCurrencyMeta</a> and vote on polls.</p>\n</div><!-- SC_ON -->",
  "score": 165,
  "permalink": "/r/CryptoCurrency/comments/ou9cd4/please_dont_let_this_place_become_wall_street_bets/",
  "subreddit": "CryptoCurrency",
  "id": "ou9cd4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I apologise for the rant. I know this is an Internet forum - but to many of us,\nthis is truly a community. A community that has been around for a long time,\nwhere bonds have been made, and people, friends even, have gone through the ups\nand down of this wild wild crypto ride for a long long…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暴言を吐いたことをお詫びします。ここはインターネットのフォーラムですが、私たちの多くにとって、ここはまさにコミュニティです。\nここはまさにコミュニティです。長い間続いているコミュニティです。\n絆が生まれ、人々が、友人が、浮き沈みを経験してきたコミュニティです。\n絆を築き、友人であっても、このワイルドな暗号の世界の浮き沈みを長い間経験してきたコミュニティです...",
      "title": "この場所がWall Street Betsにならないようにしてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我为我的咆哮感到抱歉。我知道这是一个互联网论坛--但对我们中的许多人来说。\n这确实是一个社区。一个已经存在了很长时间的社区。\n在这里建立了纽带，人们，甚至是朋友，都经历了这个疯狂的加密货币之旅的起伏。\n在这个狂野的加密货币旅程中，人们经历了大起大落，很久很久。",
      "title": "请不要让这个地方变成华尔街的投注站。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我爲我的咆哮感到抱歉。我知道這是一個互聯網論壇--但對我們中的許多人來說。\n這確實是一個社區。一個已經存在了很長時間的社區。\n在這裏建立了紐帶，人們，甚至是朋友，都經歷了這個瘋狂的加密貨幣之旅的起伏。\n在這個狂野的加密貨幣旅程中，人們經歷了大起大落，很久很久。",
      "title": "請不要讓這個地方變成華爾街的投注站。"
    }
  ]
}