{
  "author": "Carloshmerino",
  "the_new_excerpt": "\"The Bitcoin law will have 0 risk for those who don't want to take risks. The\nGovernment will guarantee the BTC conversion to the exact value in USD at the\ntime of the transaction. This will also bring financial acceptance, investment,\ntourism, innovation and economic development for our country.…",
  "original_created_utc": 1623249370,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "\"ビットコイン法は、リスクを取りたくない人にとっては、リスクが0になります。となっています。\n政府は、BTCを取引時のUSDの正確な価値に変換することを保証します。\n政府が保証します。これにより、金融面での受け入れ、投資も実現します。\n観光、イノベーション、経済発展をもたらすでしょう。....",
      "title": "ナイーブ（エルサルバドル）。\"政府は、BTCの変換を取引時のUSDでの正確な値に保証します。リスクを取りたくない人にはリスクが0になります。\" 小国とはいえ、国がバックアップしてくれるというのは、BTCにとって朗報ですね。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "\"对于那些不想承担风险的人来说，比特币法将有0风险。政府\n政府将保证在交易时将BTC转换为准确的美元价值。\n在交易的时候。这也将带来金融认可、投资。\n旅游、创新和经济发展，....",
      "title": "纳伊布（萨尔瓦多）。\"政府将保证在交易时将BTC转换为美元的准确价值。对那些不想承担风险的人来说，它将有0风险。\" 对BTC来说是个好消息，它将得到一个国家的支持，即使是一个小国家。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "\"對於那些不想承擔風險的人來說，比特幣法將有0風險。政府\n政府將保證在交易時將BTC轉換爲準確的美元價值。\n在交易的時候。這也將帶來金融認可、投資。\n旅遊、創新和經濟發展，....",
      "title": "納伊布（薩爾瓦多）。\"政府將保證在交易時將BTC轉換爲美元的準確價值。對那些不想承擔風險的人來說，它將有0風險。\" 對BTC來說是個好消息，它將得到一個國家的支持，即使是一個小國家。"
    }
  ],
  "title": "Nayib (El Salvador): \"The Government will guarantee the BTC conversion to the exact value in USD at the time of the transaction. It will have 0 risk to those who don't want to take risks.\" Good news for BTC that it will be backed by a country, even if it is a small country.",
  "created_utc": 1623282510,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>&quot;The Bitcoin law will have 0 risk for those who don&#39;t want to take risks. The Government will guarantee the BTC conversion to the exact value in USD at the time of the transaction. This will also bring financial acceptance, investment, tourism, innovation and economic development for our country. Don’t let anybody say that we are too small to be a big country.&quot;</p>\n\n<p>Loool, I just called them small country in the title. Didn&#39;t mean to offend, sorry.</p>\n</div><!-- SC_ON -->",
  "score": 226,
  "permalink": "/r/CryptoCurrency/comments/nvxfha/nayib_el_salvador_the_government_will_guarantee/",
  "subreddit": "CryptoCurrency",
  "id": "nvxfha",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404884262
}