{
  "author": "nikil1253",
  "original_created_utc": 1635170704,
  "title": "Everything they said was going to happen, is happening.",
  "created_utc": 1635209069,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been at this bitcoin thang for a while now and outlasted ridiculous amounts of over the top FUD and or uninformed stupidity over the years.</p>\n\n<p>However the reality, as proven over and over, is the bitcoin value and adaptation can not be stopped. The lightning network and taproot utility is going to eat up tons of Alt coins in the next 4 years, especially as more countries adopt bitcoin as a currency.</p>\n\n<p>My truest advice for noobs who just got here is NOBODY has ever lost money buying bitcoin. Regardless of any dips it has always went back to a new high, every time, over and over.</p>\n\n<p>IGNORE THE NEGATIVE FUD NOISE</p>\n\n<p>BUY THE DIPS</p>\n\n<p>NEVER PANIC SELL</p>\n\n<p>ACCUMLATE AND HODL</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/CryptoCurrency/comments/qfhh4v/everything_they_said_was_going_to_happen_is/",
  "subreddit": "CryptoCurrency",
  "id": "qfhh4v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've been at this bitcoin thang for a while now and outlasted ridiculous amounts\nof over the top FUD and or uninformed stupidity over the years.\n\nHowever the reality, as proven over and over, is the bitcoin value and\nadaptation can not be stopped. The lightning network and taproot utility is\ngoing…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はしばらくの間、このビットコインに取り組んできましたが、何年にもわたって馬鹿げた量のFUDや無知な愚かさを乗り越えてきました。\nしかし、現実には、何度も証明されているように、ビットコインの世界では、このようなことが起こっています。\n\nしかし、現実には、何度も証明されているように、ビットコインの価値と適応は止められません。\n適応を止めることはできません。ライトニングネットワークとタップルートユーティリティは\n行く...",
      "title": "彼らが「こうなるだろう」と言っていたことは、すべて実現している。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我已经做了一段时间的比特币工作了，并且超过了可笑的数量。\n多年来，我一直在做比特币的事情，并且经历了大量的虚假信息和不知情的愚蠢行为。\n\n然而，现实是，一次又一次的证明，比特币的价值和\n适应性是不能被阻止的。闪电网络和Taproot工具是\n将会...",
      "title": "他们说要发生的一切，正在发生。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我已經做了一段時間的比特幣工作了，並且超過了可笑的數量。\n多年來，我一直在做比特幣的事情，並且經歷了大量的虛假信息和不知情的愚蠢行爲。\n\n然而，現實是，一次又一次的證明，比特幣的價值和\n適應性是不能被阻止的。閃電網絡和Taproot工具是\n將會...",
      "title": "他們說要發生的一切，正在發生。"
    }
  ]
}