{
  "author": "back_bithces",
  "original_created_utc": 1634122705,
  "title": "Am I racist for saying that people like Cleopatra of Egypt, Hannibal of Carthage, and St. Augustine of Roman Hippo weren't Black?",
  "created_utc": 1634130895,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Yes, I get that they&#39;re in Africa but people are really acting that all of Africa was Black, like anyone living in Africa would suddenly be Black. Cleopatra was the final Pharoah of the Hellenistic/Greek Ptolomies. Hannibal was from Carthage, a colony, then nation of the Phoenecians, a semitic people living in modern Lebanon. St. Augustine lived in Modern Algeria, who had a Berber mother. None of the people groups, or the Culture they belonged to were Black or Subsaharan. </p>\n\n<p>Were they Africans? Yes. Were they Black? Probably not. Why am I racist for knowing more? It just feels weird to claim a whole group of People as Black when their literal descendants are still in the same place.</p>\n</div><!-- SC_ON -->",
  "score": 124,
  "permalink": "/r/TooAfraidToAsk/comments/q78nfi/am_i_racist_for_saying_that_people_like_cleopatra/",
  "subreddit": "TooAfraidToAsk",
  "id": "q78nfi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Yes, I get that they're in Africa but people are really acting that all of\nAfrica was Black, like anyone living in Africa would suddenly be Black.\nCleopatra was the final Pharoah of the Hellenistic/Greek Ptolomies. Hannibal was\nfrom Carthage, a colony, then nation of the Phoenecians, a semitic…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "確かに、アフリカにあるのはわかりますが、アフリカに住んでいる人がいきなり黒人になるような\nアフリカに住んでいる人が突然黒人になるような、アフリカ全土が黒人であるかのように振る舞っています。\nクレオパトラは、ヘレニズム／ギリシャの白金の最後のファロアーでした。ハンニバルは\nフェネキア人の植民地であり国家であったカルタゴ出身です。",
      "title": "エジプトのクレオパトラ、カルタゴのハンニバル、ローマのヒッポの聖アウグスティヌスのような人々が黒人ではないと言った私は人種差別者でしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "是的，我知道他们是在非洲，但人们真的是在演戏，认为所有的非洲都是黑人。\n非洲都是黑人，好像任何生活在非洲的人都会突然变成黑人。\n克娄巴特拉是希腊化/希腊铂金时代的最后一位法老。汉尼拔是\n来自迦太基，迦太基是腓尼基人的殖民地，然后是腓尼基人的国家，腓尼基人是一个半人种...",
      "title": "我说埃及的克利奥帕特拉、迦太基的汉尼拔和罗马希波的圣奥古斯丁等人不是黑人，是种族主义者吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "是的，我知道他們是在非洲，但人們真的是在演戲，認爲所有的非洲都是黑人。\n非洲都是黑人，好像任何生活在非洲的人都會突然變成黑人。\n克婁巴特拉是希臘化/希臘鉑金時代的最後一位法老。漢尼拔是\n來自迦太基，迦太基是腓尼基人的殖民地，然後是腓尼基人的國家，腓尼基人是一個半人種...",
      "title": "我說埃及的克利奧帕特拉、迦太基的漢尼拔和羅馬希波的聖奧古斯丁等人不是黑人，是種族主義者嗎？"
    }
  ]
}