{
  "author": "tojumikie",
  "the_new_excerpt": "Schwab brokerage account locked for 29 days, banned from TD Ameritrade\n\nForgive me if I am posting in the wrong sub\n\nI'll start with Charles Schwab.\n\nI had around $300 in my Schwab brokerage account. I wanted to use another\nbrokerage besides Robinhood so I made transfers from my bank account to…",
  "original_created_utc": 1611760752,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "施瓦布经纪账户被锁定29天，被禁止进入TD Ameritrade。\n\n如果我发错了子，请原谅我。\n\n我先说说Charles Schwab。\n\n我的Schwab经纪账户里有大约300美元。我想用另一个\n除了Robinhood之外的经纪公司，所以我从我的银行账户转到... ...",
      "title": "施瓦布经纪账户被锁定29天，被禁止进入TD Ameritrade。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "施瓦布經紀賬戶被鎖定29天，被禁止進入TD Ameritrade。\n\n如果我發錯了子，請原諒我。\n\n我先說說Charles Schwab。\n\n我的Schwab經紀賬戶裏有大約300美元。我想用另一個\n除了Robinhood之外的經紀公司，所以我從我的銀行賬戶轉到... ...",
      "title": "施瓦布經紀賬戶被鎖定29天，被禁止進入TD Ameritrade。"
    }
  ],
  "title": "Schwab brokerage account locked for 29 days, banned from TD Ameritrade",
  "created_utc": 1611796214,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Schwab brokerage account locked for 29 days, banned from TD Ameritrade</p>\n\n<p>Forgive me if I am posting in the wrong sub</p>\n\n<p>I&#39;ll start with Charles Schwab.</p>\n\n<p>I had around $300 in my Schwab brokerage account. I wanted to use another brokerage besides Robinhood so I made transfers from my bank account to start out. Then on December 27th, I started a transfer of $3000 from my Bank of America account to my Charles Schwab brokerage account. The Schwab account was then suspended for suspicious activity on December 29th. I called Schwab on December 30th, and they told me that the fraud department is investigating, and it can take 3-5 business days, maybe longer because it was the holiday season. I said OK, called back a week later, and they said the same thing, called another week later, they said the same thing again. Called them about 5 or 6 times, and they always say that they need 3 to 4 or 3 to 5 business days to investigate. Well, it&#39;s now January 27 and my account is still locked for suspicious activity.</p>\n\n<p>When I try to ask them what they are investigating, they will never tell me. How can I get access to my money?</p>\n\n<p>Does it usually take this long?</p>\n\n<p>If i do nothing, how long would it take to complete the investigation? months, years?</p>\n\n<p>Is it legal for them to hold my money for this long?</p>\n\n<p>&#x200B;</p>\n\n<p>TD Ameritrade</p>\n\n<p><a href=\"https://i.imgur.com/xjScClZ.jpg\">https://i.imgur.com/xjScClZ.jpg</a></p>\n\n<p>I got a letter in the mail that I have been banned from TD Ameritrade. I created an account with them on December 26th and this letter is from the 29th saying that their business relationship with me has been terminated, and they will not change this decision, and I am basically banned from using them in the future. It seemed that I was banned for an unknown reason; they won&#39;t tell me, so at this point, I have more questions than answers. The only guess I have is because Schwab bought TD Ameritrade, so they are trying to prevent me from using both? IDK</p>\n</div><!-- SC_ON -->",
  "score": 51,
  "permalink": "/r/investing/comments/l66m9e/schwab_brokerage_account_locked_for_29_days/",
  "subreddit": "investing",
  "id": "l66m9e",
  "is_self": true,
  "media": null,
  "is_video": false
}