{
  "author": "Ghostserpent",
  "the_new_excerpt": "Potassium\n\nEach BANANO contains about 422 mg of potassium in comparison to bitcoin which\nhas 0 mg. Potassium is important for staying healthy and functional. It’s highly\nunlikely that bitcoin will ever be able to upgrade itself with potassium\ncontents as that would require it to fork.\n\nSupply\n\nThere…",
  "original_created_utc": 1620333171,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "カリウム\n\nバナーノには1個あたり約422mgのカリウムが含まれており、ビットコインは0mgであるのに対し\nは0mgです。カリウムは、健康と機能性を維持するために重要です。しかし\nビットコインがカリウムの含有量をアップグレードできる可能性は低いでしょう。\n含有量をアップグレードするには、ビットコインをフォークさせる必要があるからです。\n\nサプライ\n\nそこに...",
      "title": "BANANO（BAN）がビットコインに取って代わる理由"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "钾\n\n每个BANANO含有约422毫克的钾，而比特币的钾含量为\n有0毫克。钾对保持健康和功能很重要。这是很\n比特币不太可能升级自己的钾含量。\n含量，因为这将需要它分叉。\n\n供应\n\n那里...",
      "title": "为什么BANANO（BAN）会取代比特币？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "鉀\n\n每個BANANO含有約422毫克的鉀，而比特幣的鉀含量爲\n有0毫克。鉀對保持健康和功能很重要。這是很\n比特幣不太可能升級自己的鉀含量。\n含量，因爲這將需要它分叉。\n\n供應\n\n那裏...",
      "title": "爲什麼BANANO（BAN）會取代比特幣？"
    }
  ],
  "title": "Why BANANO (BAN) will Replace Bitcoin",
  "created_utc": 1620348107,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Potassium</strong></p>\n\n<p>Each BANANO contains about 422 mg of potassium in comparison to bitcoin which has 0 mg. Potassium is important for staying healthy and functional. It’s highly unlikely that bitcoin will ever be able to upgrade itself with potassium contents as that would require it to fork.</p>\n\n<p><strong>Supply</strong></p>\n\n<p>There is currently about 1 billion BAN coins in comparison to only 18 million bitcoins. That means that over 1 billion people can experience the nutritional value of banano in comparison to only 18 million bitcoins.</p>\n\n<p><strong>Folding</strong></p>\n\n<p>New BAN coins are distributed by using computing power to donate to medical research. People who support this research are rewarded with banano coins and most importantly, high levels of potassium.</p>\n\n<p><strong>Efficiency</strong></p>\n\n<p>Banano has instant and feeless transactions. This makes it the most efficient coin, as it can deliver high levels of potassium anywhere in the world instantly.</p>\n</div><!-- SC_ON -->",
  "score": 732,
  "permalink": "/r/CryptoCurrency/comments/n6gwur/why_banano_ban_will_replace_bitcoin/",
  "subreddit": "CryptoCurrency",
  "id": "n6gwur",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985988840
}