{
  "author": "Set1Less",
  "original_created_utc": 1633702034,
  "title": "Top El Salvador post is by a butt coiner who wants Bitcoin to crash to 1K. He is not offering any \"unbiased perspective\" nor does he want crypto to succeed.",
  "created_utc": 1633712378,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The controversial top post about El Salvador&#39;s OP claims that he wants crypto to succeed, </p>\n\n<p>But if you go into his profile linked in that post, you can see that he is wishing for Bitcoin to go to 1K. Lmao</p>\n\n<p><a href=\"https://nitter.net/samsungsv19/status/1446184849971236876?s=20\">https://nitter.net/samsungsv19/status/1446184849971236876?s=20</a></p>\n\n<p>This guy literally wants crypto to burn, but yall are celebrating him because he is putting out &quot;unbiased perspectives&quot;. Lmao</p>\n\n<p><a href=\"https://nitter.net/samsungsv19/status/1446144675736399881#m\">https://nitter.net/samsungsv19/status/1446144675736399881#m</a></p>\n\n<p>Nobody who wants crypto to succeed will wish for 1K BTC and RT known fudsters. Its hilarious people even fall for this. </p>\n\n<p>The OP follows and RTs stuff like this</p>\n\n<p><a href=\"https://nitter.net/Quinnvestments/status/1446262224520105987?s=20\">https://nitter.net/Quinnvestments/status/1446262224520105987?s=20</a></p>\n\n<p>This quinn investment guy is a known fraudster who cooks up conspiracy theories, just have a look at his profile lol. </p>\n\n<p>Bullshit that has already been denied, like Tether holding Evergrande.. \nInfact this nonsense claims 78% of Tether reserves are Evergrande, which is total lies.</p>\n\n<p>And that OP RT&#39;s nonsense like this, wishing for crypto to burn, but you all are assuming he is posting his &quot;unbiased opinion&quot; on bitcoin law. Lol</p>\n\n<p>Edit:</p>\n\n<p>Some comments are pointing out that I havent deboonked what that OP has said. I did actualyl debunk him last month, but then realised he isnt having honest debates but is just putting out propaganda. Given that he isnt acting in good faith, and is a buttcoiner, kinda pointless for me to debunk moreover, he is clearly lying that he wants to see crypto succeed, and instead has a very biased agenda. He is not debating in good faith. If you check his profile, he had posted that BTC would be a failure even before the roll out. Literally, before the plan was implemented and went live, he claimed it would be a failure. Anyone really expect this guy to be unbaised at this point? </p>\n\n<p>Coming to the protests, yes there are protests, but the protests are to do with politics rather than bitcoin. You will find one or two guys carrying an anti-bitcoin banner in the entire protest. Most of the protests are purely due to political reasons, that have nothing to do with Bitcoin. All those pictures he has posted as proof are all from protests shared on twitter, they have nothing to do with bitcoin except that fact that Bitcoin is implemented by the president, against whom all the protests are targeted. </p>\n\n<p>That guy claims Bitcoin rollout is &quot;not going well&quot;. </p>\n\n<p>Stats from Google app store and IOS app store prove him wrong. </p>\n\n<p>The Chivo wallet is still #2 on ios app store, ahead of most viral apps like FB/ Whatsapp/Twitter/TikTok etc</p>\n\n<p><a href=\"https://www.similarweb.com/apps/top/apple/store-rank/sv/all/\">https://www.similarweb.com/apps/top/apple/store-rank/sv/all/</a></p>\n\n<p>And on Android play store, the wallet is the #1 app too..</p>\n\n<p><a href=\"https://www.similarweb.com/apps/top/google/store-rank/sv/all\">https://www.similarweb.com/apps/top/google/store-rank/sv/all</a></p>\n\n<p>The Chivo app is pretty much TOP on both app stores. Quite some failure huh! Definitely not doing well...</p>\n\n<p>Just because there have been some issues during rollout doesnt mean its a failure or its not going well. Many mass implementation programs have problems initially, infact even the US covid stimmy checks took a while to arrive and there was implementation delays. Later, <a href=\"https://www.washingtonpost.com/us-policy/2020/06/25/irs-stimulus-checks-dead-people-gao/\">WaPo reported that over 1 M checks went out to dead people</a>. Was that a failure too? </p>\n\n<p>Now lets look at some real stories that are success:</p>\n\n<p>Over 3 million  users have downloaded the wallet. </p>\n\n<p><a href=\"https://www.forbes.com/sites/theapothecary/2021/10/07/in-el-salvador-more-people-have-bitcoin-wallets-than-traditional-bank-accounts/?sh=7ac1bb5020b5\">More users in El Salvador are now using Chivo / have a bitcoin wallet than they have traditional bank accounts.</a> - This alone is a massive win, in a country where huge amounts of people are unbanked, they have now instantly been given access to the world&#39;s most open and fair financial network. </p>\n\n<p>Already, Brazil is considering following El Salvador adopting Bitcoin as well.</p>\n\n<p>A country implementing BTC is not a race to the finish, it is a long term program. OP knows that too, but since he is a biased propagandist, he wants to put out hit pieces on a monthly basis </p>\n\n<p>That guy is just grinding his grudge against the president who he clearly hates, and using this sub as an outlet to air his political hit posts.</p>\n</div><!-- SC_ON -->",
  "score": 1291,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/DDTDh20N4aAFQu0dDsYyq5WgXj_a_XaPTPv0sdpDwIs.jpg?auto=webp&s=877def27bfc5fabfe642b5451eed204cd83f1380",
          "width": 500,
          "height": 500
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/DDTDh20N4aAFQu0dDsYyq5WgXj_a_XaPTPv0sdpDwIs.jpg?width=108&crop=smart&auto=webp&s=0a6305391cd99abf1d4b04204e0c0185b47dbaab",
            "width": 108,
            "height": 108
          },
          {
            "url": "https://external-preview.redd.it/DDTDh20N4aAFQu0dDsYyq5WgXj_a_XaPTPv0sdpDwIs.jpg?width=216&crop=smart&auto=webp&s=9963fab1f5e17fe95bc74a8fcc6995622ece4d80",
            "width": 216,
            "height": 216
          },
          {
            "url": "https://external-preview.redd.it/DDTDh20N4aAFQu0dDsYyq5WgXj_a_XaPTPv0sdpDwIs.jpg?width=320&crop=smart&auto=webp&s=965c0d927956df05abe07e3aee2fed973e769335",
            "width": 320,
            "height": 320
          }
        ],
        "variants": {},
        "id": "WqxyYYLS2On0nHmquY_KhzJuXP3NwjKAw4CLW1iMg_o"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/q3yh1b/top_el_salvador_post_is_by_a_butt_coiner_who/",
  "subreddit": "CryptoCurrency",
  "id": "q3yh1b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The controversial top post about El Salvador's OP claims that he wants crypto to\nsucceed,\n\nBut if you go into his profile linked in that post, you can see that he is\nwishing for Bitcoin to go to 1K. Lmao\n\nhttps://nitter.net/samsungsv19/status/1446184849971236876?s=20\n\nThis guy literally wants crypto…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "エルサルバドルのOPの主張が物議を醸したトップ記事は、暗号化を望んでいるという\n成功させたいと主張しています。\n\nしかし、その投稿でリンクされている彼のプロフィールを見ると、彼が\nBitcoinが1Kになることを願っていることがわかります。Lmao\n\nhttps://nitter.net/samsungsv19/status/1446184849971236876?s=20\n\nこの人は文字通り暗号を欲しがっている...。",
      "title": "エルサルバドルのトップ記事は、ビットコインが1Kにクラッシュすることを望んでいるバットコイナーによるものです。彼は「公平な視点」を提供しているわけではなく、暗号の成功を望んでいるわけでもない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "关于萨尔瓦多OP的争议性顶帖声称，他希望加密货币能够\n成功。\n\n但是，如果你进入该帖子中链接的他的个人资料，你可以看到，他正在\n希望比特币涨到1K。Lmao\n\nhttps://nitter.net/samsungsv19/status/1446184849971236876?s=20\n\n这家伙简直是想让加密货币...",
      "title": "萨尔瓦多的顶级帖子是由一个希望比特币崩溃到1K的对接币商所发。他没有提供任何 \"公正的观点\"，也不希望加密货币成功。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "關於薩爾瓦多OP的爭議性頂帖聲稱，他希望加密貨幣能夠\n成功。\n\n但是，如果你進入該帖子中鏈接的他的個人資料，你可以看到，他正在\n希望比特幣漲到1K。Lmao\n\nhttps://nitter.net/samsungsv19/status/1446184849971236876?s=20\n\n這傢伙簡直是想讓加密貨幣...",
      "title": "薩爾瓦多的頂級帖子是由一個希望比特幣崩潰到1K的對接幣商所發。他沒有提供任何 \"公正的觀點\"，也不希望加密貨幣成功。"
    }
  ]
}