{
  "author": "Lugubrious_Lothario",
  "original_created_utc": 1650550287,
  "title": "Did WWI impact European genetics at all?",
  "created_utc": 1650583566,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve got enough of a grasp on biology to understand that if there were genetic changes driven by the war it would most likely be isolated to the Y chromosome, or perhaps in recessive genes on other chromosomes if the expressed/heterozygous allele/genotype had some effect adverse to survival in a warzone, but that would only last a generation or two, right?†&lt;/p&gt;\n\n&lt;p&gt;Maybe this is more of an &lt;a href=\"/r/askhistorians\"&gt;r/askhistorians&lt;/a&gt; question, but I&amp;#39;m trying here first since I never get my questions answered over there. I would like to know if there is any precedent for war as a selective pressure, or if even our worst wars have fallen below the threshold necessary for that.&lt;/p&gt;\n\n&lt;p&gt;ETA: To be clear, I am not asking about ethnic cleansing, pogroms, or genocides as bottleneck events; &lt;strong&gt;my interest is in humans becoming more fit for modern warfare by a mechanism of selective pressure of same&lt;/strong&gt;. &lt;/p&gt;\n\n&lt;p&gt;† Though, it seems plausible that a second world war fought by the subsequent generation could have served to further prune out those alleles if not lock in the remaining dominant ones as part of a new haplotype.&lt;/p&gt;\n\n&lt;p&gt;Thanks in advance.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/askscience/comments/u8ojy9/did_wwi_impact_european_genetics_at_all/",
  "subreddit": "askscience",
  "id": "u8ojy9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've got enough of a grasp on biology to understand that if there were genetic\nchanges driven by the war it would most likely be isolated to the Y chromosome,\nor perhaps in recessive genes on other chromosomes if the expressed/heterozygous\nallele/genotype had some effect adverse to survival in a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "生物学は十分理解しているので、もし遺伝子があれば\n戦争による遺伝的変化はY染色体に限られると思います。\nあるいは、他の染色体上の劣性遺伝子に発現したヘテロ接合型の対立遺伝子や遺伝子型があれば\nあるいは、他の染色体の劣性遺伝子に現れるかもしれない。",
      "title": "第一次世界大戦は、ヨーロッパの遺伝学に全く影響を与えなかったのですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我对生物学有足够的把握，可以理解如果有基因变化是由战争驱动的，那很可能是我自己。\n变化，它很可能被隔离在Y染色体上。\n或者也许是在其他染色体上的隐性基因中，如果表达的/杂合的\n等位基因/基因型有一些不利于生存的影响。",
      "title": "一战对欧洲的遗传学有任何影响吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我對生物學有足夠的把握，可以理解如果有基因變化是由戰爭驅動的，那很可能是我自己。\n變化，它很可能被隔離在Y染色體上。\n或者也許是在其他染色體上的隱性基因中，如果表達的/雜合的\n等位基因/基因型有一些不利於生存的影響。",
      "title": "一戰對歐洲的遺傳學有任何影響嗎？"
    }
  ]
}