{
  "author": "NaiwennFr",
  "the_new_excerpt": "I love gardening, between the moment you plant a seed and the moment you harvest\na lot of things happen. Not always very relaxing.\n\nThe more time passes, the more I see similarities between investing in crypto\nand gardening.\n\nWhen you see your seed come out, then 2 days later start to look like…",
  "original_created_utc": 1621331929,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はガーデニングが大好きです。種を植えてから収穫するまでの間には\nいろんなことが起こります。必ずしもリラックスできるものではありません。\n\n時間が経てば経つほど、暗号への投資とガーデニングの類似性が見えてきます。\nガーデニングに似ていると思います。\n\n種が出てきて、2日後には...という感じですね。",
      "title": "クリプト投資には庭師の魂が必要だ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我喜欢园艺，在你播种的那一刻和你收获的那一刻之间\n很多事情都会发生。并不总是很轻松的。\n\n时间越久，我就越觉得投资加密货币和园艺之间有相似之处。\n和园艺的相似之处。\n\n当你看到你的种子出来，然后2天后开始看起来像...",
      "title": "投资加密货币时，你必须有一个园丁的灵魂"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我喜歡園藝，在你播種的那一刻和你收穫的那一刻之間\n很多事情都會發生。並不總是很輕鬆的。\n\n時間越久，我就越覺得投資加密貨幣和園藝之間有相似之處。\n和園藝的相似之處。\n\n當你看到你的種子出來，然後2天后開始看起來像...",
      "title": "投資加密貨幣時，你必須有一個園丁的靈魂"
    }
  ],
  "title": "You must have a gardener's soul when you invest in crypto",
  "created_utc": 1621348233,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I love gardening, between the moment you plant a seed and the moment you harvest a lot of things happen. Not always very relaxing.</p>\n\n<p>The more time passes, the more I see similarities between investing in crypto and gardening.</p>\n\n<p>When you see your seed come out, then 2 days later start to look like it&#39;s rotting: don&#39;t panic. Trust your seed, it can get by.</p>\n\n<p>When you have the beginning of a plant with a few leaves sticking out, and all of a sudden it turns yellow for no apparent reason: don&#39;t panic, it can leave with the right nutrients.</p>\n\n<p>Not long ago, I had a beautiful tomato stalk that my young cat used as a scratching post: seriously, only a gaunt stalk was left. A neighbor told me &quot;it must be pulled out, it&#39;s dead&quot;, I refused. The stalk resumed, new leaves appeared and my tomato stalk got stronger.</p>\n\n<p>Plants and crypto take time, not necessarily a lot of attention, but you have to trust your plant: it wants to survive and it will do whatever it takes to get there.</p>\n</div><!-- SC_ON -->",
  "score": 879,
  "permalink": "/r/CryptoCurrency/comments/nf6nhc/you_must_have_a_gardeners_soul_when_you_invest_in/",
  "subreddit": "CryptoCurrency",
  "id": "nf6nhc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590801350
}