{
  "author": "cinjuni",
  "original_created_utc": 1634723407,
  "title": "Bots should be excluded from Moon distribution",
  "created_utc": 1634733450,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There are some bots on this sub that auto-post comments and, if I&#39;m not mistaken, become part of the moon distribution.</p>\n\n<p>The Automoderator bot is not receiving Moons as far as I can tell, but the tldr bot is. I don&#39;t know if there are other bots in this sub but they might be included in the periodic Moon distribution.</p>\n\n<p>Wouldn&#39;t it be better for everyone is this and other bots were not included in the distribution? Or is it not worth the trouble for the devs to make this change?</p>\n\n<p>Edit: Reducing their % instead of removing altogether is another option.</p>\n\n<p>That&#39;s it. That&#39;s the post.</p>\n</div><!-- SC_ON -->",
  "score": 209,
  "permalink": "/r/CryptoCurrency/comments/qbx839/bots_should_be_excluded_from_moon_distribution/",
  "subreddit": "CryptoCurrency",
  "id": "qbx839",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "There are some bots on this sub that auto-post comments and, if I'm not\nmistaken, become part of the moon distribution.\n\nThe Automoderator bot is not receiving Moons as far as I can tell, but the tldr\nbot is. I don't know if there are other bots in this sub but they might be\nincluded in the periodic…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブには、コメントを自動投稿するボットがいて、私の記憶違いでなければ\n月の配布物の一部になってしまうことがあります。\n\n私の知る限りでは、Automoderatorボットはムーンを受け取っていませんが、tldr\nボットは受け取っています。このサブのボットが他にもあるかどうかはわかりませんが、もしかしたら\n周期に含まれるかもしれません。",
      "title": "ボットは月の配布物から除外すべき"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在这个子上有一些机器人自动发布评论，如果我没有记错的话，它们会成为月亮分布的一部分。\n错了，成为月亮分布的一部分。\n\n据我所知，Automoderator机器人没有收到月球，但tldr\n机器人是。我不知道在这个子里是否还有其他的机器人，但他们可能会被列入\n包括在定期的...",
      "title": "应将机器人排除在月球分布之外"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在這個子上有一些機器人自動發佈評論，如果我沒有記錯的話，它們會成爲月亮分佈的一部分。\n錯了，成爲月亮分佈的一部分。\n\n據我所知，Automoderator機器人沒有收到月球，但tldr\n機器人是。我不知道在這個子裏是否還有其他的機器人，但他們可能會被列入\n包括在定期的...",
      "title": "應將機器人排除在月球分佈之外"
    }
  ]
}