{
  "author": "Catch44Nasdaq",
  "original_created_utc": 1624913931,
  "title": "I'm A CEO of A Small Agency in Norway and This Is Why Bitcoin Is Our Hedge Against Bad Hires",
  "created_utc": 1624934272,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello fellow hodlers. I am guessing this will be a somewhat different post, and quite the long one as well. Hope you find it interesting and a nice addition to your own confirmation bias as to why Bitcoin is and will be lifechanging. Also, thank you for reading.</p>\n\n<h1>First, a couple of caviats;</h1>\n\n<p>- I am not a Bitcoin OG. I didn&#39;t know about it in 2013. I hated it in 2017. I FOMOed in 2018. I was surprised in 2020. And I love and understand it in 2021.</p>\n\n<p>- I am not a financial advisor, and I am speaking on behalf of the company I own which employs just south of 20 people.</p>\n\n<p>- We don&#39;t have a massive treasury and are inexperienced as a company investing in assets and other instruments</p>\n\n<p>- English is not my mother tongue, so bear with me.</p>\n\n<p>- Fuck you Elon.</p>\n\n<p>In this piece I&#39;ll do my best and explain from a small corporate perspective why accumulating Bitcoin became part of the corporate strategy and unanimously accepted by the general assembly.</p>\n\n<h1>Next, some background to who we are as a company</h1>\n\n<p>I founded the marketing agency back in 2017 and we quickly hired alot of people and attracted great clients. Our work is a combination of video production, copywriting, graphic design, web, podcast and everything social media. Basically, we are a marketing department that our clients &quot;subscribe&quot; to for 12 months with certain limitations for a fixed price. Our projected revenue 2021 EOY is about 2,5 - 3M USD.</p>\n\n<p>We are known for being provacative, experimental and the &quot;go-to-place&quot; for small B2B companies to jumpstart their marketing game.</p>\n\n<p>Again, our business model is not very scalable. It&#39;s human trafficking (it&#39;s a joke!!!) - we need one guy or gal to do some work, and that work can only be done so many times in a day. If we want to do more of that work, we need to hire a new guy or gal and so on. And if you don&#39;t have BCG or McKinsey in your logo - the ability to scale on premium price is very difficult as well. The avarage profit margin in Norway in our industry is about 3-4%. Eeeew. The &quot;only&quot; way to make big buck with this kind of business model is either scale massively on people, price or both. The cost that makes up about 85% of the total, is rent for office space and labour cost, so it requires alot to make that happen. It&#39;s very risky to scale an agency business with people if you don&#39;t have alot of cash on hand - which we don&#39;t have.</p>\n\n<p>We&#39;ve been in business like I said since 2017 and so far we have not made a meaningful profit yet. We have OK salaries, but that&#39;s it. We are smart, creative and driven people - so the salary, even though it is OK, it is not extremely good. And we do want to create a company that can pay out significant dividends to make up for the struggle of building, running and owning a company. With current model, that seems to be a stretch medium-term.</p>\n\n<h1>The Pandemic Gave Perspective On Things</h1>\n\n<p>Like most other places, within a week from March 9th to March 12th of 2020, the semantics went from &quot;yeye, I don&#39;t care&quot;, to; &quot;OMFG&quot;. It literally turned most of our business upside down and was a really chaotic experience. The unthinkable paradox happened; everyone wanted to sell something, but none wanted to buy anything. Except fucking toilet paper.</p>\n\n<p>Marketing, and especially external marketing consultants, is not business critical to everyone, maybe even anyone, during a world crisis. And obviously we faced a lot of pushback from our clients. So we are grateful that most stayed with us, but some left. Leaving our business extremely volnurable as we don&#39;t have the liquidity to simply shut down.</p>\n\n<p>A few months in during the pandemic, my partner told me: &quot;Dude, Bitcoin just hit 30k&quot;. We had been speculating somewhat back in 2017 and found crypto to be somewhat interesting, but at the same time a piece of shit idea. And I remember thinking to myself that we were going to see another meltdown like never before with crypto. But, then I started reading about it. I read about Michael Saylor, Tesla&#39;s purchase, banks recruiting experts, ETF&#39;s trying to be accepted, Queen Cathie Woods, white papers, Cointelegraph, Bitcoin Magazine and so on. Not only that, but our very own Kjell Inge Røkke (one of Norway&#39;s wealthiest) just put 60 million dollars in it and started a crypto company.</p>\n\n<p>I am not the smartest guy in the crypto room, but these guys are - and now I was on my journey of juggling a struggling company during the pandemic, firing bad people and also putting in the first 1000 hours of understanding Bitcoin, the money system and how this will be adopted as a revolutionary technology 5-10 years from now.</p>\n\n<p>And then I realized...</p>\n\n<h1>Why Bitcoin Is Not A Risky Bet (for us)</h1>\n\n<p>I&#39;ve done several bad hires - actually a couple to many because of my own naivity. During the worst period of corona last year we knew that we had 4 bad hires in our organization. That is pretty significant as we were only 15 employees at the time.</p>\n\n<p>This might be a controversial line, but hiring <strong>bad</strong> people is a zero-sum game in which the employee is the winner and the employer is the loser. A bad hire is the true Rat Poison Squared as the faggot would say.</p>\n\n<p>Now, most of you I assume live in the US and I live in Norway. Two completely different hiring/firing laws. In Norway, you simply can&#39;t fire someone &quot;just because&quot;. Making the bad hire outcome even worse, since the process of firing someone that don&#39;t create any value for the company is a tedious process - time consuming, energy draining, lawyer fees and always a &quot;settlement package&quot; including minimum 3 months of salary. I know of entrepreneur peers that simply went bankrupt because of a few bad hires early on that just dragged the process so long that the company didn&#39;t have any liquidity left. And yes, I agree that the employer has a responsibility of not making those mistakes. But, come on bro.</p>\n\n<p>The point I&#39;m trying to make here is that if you have made a bad hire; it is like watching your stock go from whatever price to 0. It literally is a 100% loss. And the chances of getting even the slightest amount of value from a bad hire is also near 0%. Bad hire bad. Good hire good.</p>\n\n<p>So I thought to myself at first in winter 2021. What if we trim our agency to become a truly premium business, work on upskilling people, and invest in what we already have and add a few seniors to our team, and then re-invest the hypotethically cost of bad hires in Bitcoin? Either we double in size and go from about 20 people to 40 and making 5M revenue with 10% margin and along the way waste a shit ton of money on bad hires. Because, trust me, bad hires comes with volume in recruiting. There is no way past it.</p>\n\n<p>Or we invest and accumulate Bitcoin and dream about a 10x return within the next 4-5 years with alot less company risk, governance, stress and hazzle. I liked the latter idea so much that I wanted to pursue it as a core strategy for our company and change my role from being just a &quot;CEO&quot; to Master of Coin. A fun ego boost as well.</p>\n\n<p>I needed to convince the group of equity partners and also the small board we have. And I&#39;d like to share with you guys how I did it.</p>\n\n<h1>Maybe Some Instruments Are Better at Making Money Than All Of Us Combine</h1>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/qns9hinnk2871.png?width=1905&amp;format=png&amp;auto=webp&amp;s=2402621c3ce5ef58879e16de759ca3c5f96f8faa\">Introduction</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/d6b5qukpk2871.png?width=1854&amp;format=png&amp;auto=webp&amp;s=671881be5e90d90ec6f470d74f8faa6225fe0545\">Putting it in perspective</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/uridajvqk2871.png?width=1904&amp;format=png&amp;auto=webp&amp;s=b9d81bf2226b331040ed477468045cef48699cba\">Understanding how quickly \\&quot;things\\&quot; change. Here you see everyone travelling with horses.</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/ccqca4fsk2871.png?width=1887&amp;format=png&amp;auto=webp&amp;s=33cf6ec9aa185ffa46fffd44b61f7bca90a54870\">Fast forward only 30 years, and we already have buses and the roads are packed with cars. You don&#39;t see big change until it is mainstream.</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/1ucqvsetk2871.png?width=1919&amp;format=png&amp;auto=webp&amp;s=b3e8e317ea0387cc54a580e17140a47c53145510\">People in the mid 90&#39;s were nerds, freaks, geeks for using the internet. And those who didn&#39;t use the internet had 0 clue of what the internet was. Until they did... Sounds familiar too you? Maybe you didn&#39;t give jack shit about Bitcoin a few years ago, but now you do? Same story all over again.</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/0ulwldeuk2871.png?width=1913&amp;format=png&amp;auto=webp&amp;s=0f8d5866f04ca58c86c2be7888a76d7f594f9132\"> Same thing. You don&#39;t understand when it&#39;s mainstream before it is. How stupid was smartphones back in 2005? Yes, because we didn&#39;t have real 3G/4G, apps, internet was in the early stages and bla bla bla. Now, not anymore. </a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/q2aea6ovk2871.png?width=1913&amp;format=png&amp;auto=webp&amp;s=af0d38664832718fb00a72ea8f616f8fa343759b\"> 15 years ago, you would never believe that you were going to have a digital identity open to the entire world. But now you do. Facebook, YouTube, Snapchat, Instragram and many others. In 05-08 all you did was play Zynga poker. </a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/7au3kc59l2871.png?width=1925&amp;format=png&amp;auto=webp&amp;s=39622fd430528abab63592399569eef3f8e7389e\">I explained to my owners that this train is leaving very soon, and everything else that is revolutionary, you don&#39;t see when it is mainstream until it is. Now let&#39;s bet that we can be among the first 5&#37; in a 100&#37; game.</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/0lkuykral2871.png?width=1924&amp;format=png&amp;auto=webp&amp;s=816e0dc58064182ec88d2f24209d8d3fd1414867\">Here I gave my partners a simply explanation of how Bitcoin works. I showed them a few examples adressing each point made. Im not going to share this here, since we all know this from before.</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/v9zd91nbl2871.png?width=1930&amp;format=png&amp;auto=webp&amp;s=7dd248991601fbede3def98d34f43e02affac7d3\">Here I give them the copy &amp; paste explanation of the Stock to Flow Model.</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/qs38xylcl2871.png?width=1918&amp;format=png&amp;auto=webp&amp;s=aaf1195c6e7830dab9a65755379e2c066295fb24\">https://preview.redd.it/qs38xylcl2871.png?width=1918&amp;format=png&amp;auto=webp&amp;s=aaf1195c6e7830dab9a65755379e2c066295fb24</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/tlxz0b4el2871.png?width=1933&amp;format=png&amp;auto=webp&amp;s=91bef732f452cf92da19b812565ef7d86d182147\">https://preview.redd.it/tlxz0b4el2871.png?width=1933&amp;format=png&amp;auto=webp&amp;s=91bef732f452cf92da19b812565ef7d86d182147</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/eznjkopel2871.png?width=1924&amp;format=png&amp;auto=webp&amp;s=44744a3e2567a7482fb55971acbe97591015d524\">The S2F model doesn&#39;t account for Elon Musk tweet, China bans, FUD - nor does it account for great news. It is just purely based on supply and demand. But it is interesting when comparing the perceived value of gold and bitcoin together.</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/lb4dnu7gl2871.png?width=1914&amp;format=png&amp;auto=webp&amp;s=9c42d8385baabdb020900764d33643691819ffdf\">Here is a bad ass picture of me with a bad ass quote of why, amongst 100 other reasons, should invest in bitcoin.</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://reddit.com/link/o9tarn/video/og6loboil2871/player\">I reinforce how difficult it is to be bullish on something fundementally different that is yet not mainstream. Here is the clip from CNBC coverage of Bitcoin when it hit 100 dollars.</a></p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://reddit.com/link/o9tarn/video/mzll69vjl2871/player\">And here is the same thing with internet back in 1995.</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/t3mype9ll2871.png?width=1909&amp;format=png&amp;auto=webp&amp;s=52de47de2174e9ed2c5cc35a0a68c515f2671e14\">I start my ending by showing that crypto, even tho it has had an amazing run in 2021, is still in its infancy and it is a long way to go.</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/2zeg1axml2871.png?width=1924&amp;format=png&amp;auto=webp&amp;s=c4baacb841acdc59b1e9fb2a80ba040a743fd78c\">Yes it will put a strain on our liquidity to put money into bitcoin, but the marketing gimmick, PR and branding we can create out of it will most likely put us on the table infront of new clients. Just because it is something different and exciting. MicroStrategy has proven that this initiative infact have given them more clients.</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/bm1aan1ol2871.png?width=1931&amp;format=png&amp;auto=webp&amp;s=0cc517ac8485961d4f3aa14c7921c781b88c130c\">Here is another bad ass picture of me, and ending the presentation with my summarized proposal to the owners.</a></p>\n\n<p>Everyone voted yes, and now we are accumulating bitcoin on our balance sheet every month.</p>\n\n<p>Thanks for reading!</p>\n</div><!-- SC_ON -->",
  "score": 171,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/ublyHpIflsK456eoK28dUIxQyvZeR85IszbQuvvpSJk.png?auto=webp&s=b32ccaf1a39fef323c3612d075ae5945eae5d9a0",
          "width": 1905,
          "height": 1059
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/ublyHpIflsK456eoK28dUIxQyvZeR85IszbQuvvpSJk.png?width=108&crop=smart&auto=webp&s=21a7a8706005d38efe434b58e939f1771b67f1e6",
            "width": 108,
            "height": 60
          },
          {
            "url": "https://external-preview.redd.it/ublyHpIflsK456eoK28dUIxQyvZeR85IszbQuvvpSJk.png?width=216&crop=smart&auto=webp&s=2b22d16b2332e594282c4db6d96c397851a07ba5",
            "width": 216,
            "height": 120
          },
          {
            "url": "https://external-preview.redd.it/ublyHpIflsK456eoK28dUIxQyvZeR85IszbQuvvpSJk.png?width=320&crop=smart&auto=webp&s=eddfc247dd88ba5a245e532782f45dd9064a0921",
            "width": 320,
            "height": 177
          },
          {
            "url": "https://external-preview.redd.it/ublyHpIflsK456eoK28dUIxQyvZeR85IszbQuvvpSJk.png?width=640&crop=smart&auto=webp&s=9e2a7e7bc40c8cc7a6001e7b36e65f47ac48a2f2",
            "width": 640,
            "height": 355
          },
          {
            "url": "https://external-preview.redd.it/ublyHpIflsK456eoK28dUIxQyvZeR85IszbQuvvpSJk.png?width=960&crop=smart&auto=webp&s=5edf7bd579cbdc5855c77a3219816e6b7178fa80",
            "width": 960,
            "height": 533
          },
          {
            "url": "https://external-preview.redd.it/ublyHpIflsK456eoK28dUIxQyvZeR85IszbQuvvpSJk.png?width=1080&crop=smart&auto=webp&s=80f0f4922df559181eeb7e7a0dede01ec66779e2",
            "width": 1080,
            "height": 600
          }
        ],
        "variants": {},
        "id": "nx-uD784EIZPm3Dc0DRpxc_6-CQ-iNyuesSIHiCkf_E"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/Bitcoin/comments/o9tarn/im_a_ceo_of_a_small_agency_in_norway_and_this_is/",
  "subreddit": "Bitcoin",
  "id": "o9tarn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hello fellow hodlers. I am guessing this will be a somewhat different post, and\nquite the long one as well. Hope you find it interesting and a nice addition to\nyour own confirmation bias as to why Bitcoin is and will be lifechanging. Also,\nthank you for reading.\n\n\nFIRST, A COUPLE OF CAVIATS;\n\n- I am…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ホドラー仲間の皆さん、こんにちは。今回はちょっと変わった記事になるかと思います。\nかなりの長文になると思います。この記事を読んで、あなたが興味を持ち、あなた自身の確認作業に役立つことを願っています。\nビットコインがなぜ人生を変えるものなのか、あなた自身の確証バイアスに加えて、興味深く感じていただければ幸いです。また。\nお読みいただきありがとうございました。\n\n\nまず、キャビアをいくつか紹介します。\n\n- 私は...",
      "title": "私はノルウェーの小さな代理店のCEOですが、ビットコインが悪い雇用に対するヘッジとなる理由はこれです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好，Hodlers的朋友们。我猜想这将是一个有点不同的帖子，而且\n也是相当长的一篇。希望你能发现它的有趣之处，并对你自己的确认生物有一个很好的补充。\n你自己的确认偏见，为什么比特币正在和将要改变生活。还有。\n谢谢你的阅读。\n\n\n首先，几个鱼子酱的问题。\n\n- 我是...",
      "title": "我是挪威一家小型机构的CEO，这就是为什么比特币是我们抵御不良雇用的对冲。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好，Hodlers的朋友們。我猜想這將是一個有點不同的帖子，而且\n也是相當長的一篇。希望你能發現它的有趣之處，並對你自己的確認生物有一個很好的補充。\n你自己的確認偏見，爲什麼比特幣正在和將要改變生活。還有。\n謝謝你的閱讀。\n\n\n首先，幾個魚子醬的問題。\n\n- 我是...",
      "title": "我是挪威一家小型機構的CEO，這就是爲什麼比特幣是我們抵禦不良僱用的對沖。"
    }
  ]
}