{
  "author": "Humble_Data2727",
  "original_created_utc": 1628855680,
  "title": "Why I got into crypto? Irresponsible Wealth.",
  "created_utc": 1628872723,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am not going to hide the reason I got into crypto. My goal is to become irresponsibly wealthy. </p>\n\n<p>I want to carry a phone around raw...no phone case.\nI want to tell Geico to keep their 15% because I don&#39;t have 15 minutes to get car insurance.\nI want to go to a restaurant and tip the waiter before and after the meal. \nI want to be able to stake my wealth at a bank and not care about the .001% APY.\nI want to give my wife a credit card and tell her there is no limit.</p>\n\n<p>High on the hopium as my portfolio just turned green today. This is my first step towards my goal. </p>\n\n<p>Why did you get into crypto?</p>\n\n<p>Edit: I have been reading all your comments and honestly it makes me so happy. Regardless of why we are here we want to make a better life for ourselves, our family, even our nation. Most of us have had the deck stacked against us since birth but crypto is our ace in the hole. This is the start of a revolution!</p>\n</div><!-- SC_ON -->",
  "score": 278,
  "permalink": "/r/CryptoCurrency/comments/p3luz7/why_i_got_into_crypto_irresponsible_wealth/",
  "subreddit": "CryptoCurrency",
  "id": "p3luz7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I am not going to hide the reason I got into crypto. My goal is to become\nirresponsibly wealthy.\n\nI want to carry a phone around raw...no phone case. I want to tell Geico to keep\ntheir 15% because I don't have 15 minutes to get car insurance. I want to go to\na restaurant and tip the waiter before…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が暗号を始めた理由を隠すつもりはありません。私の目標は、無責任に裕福になることです。\n無責任に裕福になることです。\n\nスマホを生で持ち歩きたい...スマホケースなしで。Geicoには15％を維持するように言いたいですね。\n15％を維持しろと言いたい。私はレストランに行って\nレストランに行って、ウェイターにチップを渡してから...。",
      "title": "なぜ私が暗号化を始めたのか？無責任な富裕層"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不打算隐瞒我进入加密货币的原因。我的目标是要成为\n不负责任的财富。\n\n我想生生地带着手机到处走......没有手机壳。我想告诉Geico公司保留他们的15%。\n他们的15%，因为我没有15分钟去买汽车保险。我想去\n餐馆，给服务员小费，然后再......",
      "title": "我为什么进入加密货币？不负责任的财富。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不打算隱瞞我進入加密貨幣的原因。我的目標是要成爲\n不負責任的財富。\n\n我想生生地帶着手機到處走......沒有手機殼。我想告訴Geico公司保留他們的15%。\n他們的15%，因爲我沒有15分鐘去買汽車保險。我想去\n餐館，給服務員小費，然後再......",
      "title": "我爲什麼進入加密貨幣？不負責任的財富。"
    }
  ]
}