{
  "author": "LifeInPrimes",
  "original_created_utc": 1632168536,
  "title": "I feel like I'm in a Black Mirror episode.",
  "created_utc": 1632190142,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Evergrand&#39;s collapse in China and this global short-term economic pull-back shows humanity has learned nothing from the 2008 housing and financial collapse. Different reasons, same fuckery. </p>\n\n<p>Do not stay blind to the ABSOLUTE OBVIOUS FUCKERY that corporations, and banks, and governments pull on people. FIAT IS INFLATED AND DYING, but so many ignore it. All the new printed money goes first to the central banks and all the players that manipulate the game, leaving crumbs to the ordinary people and fucking the poor over even more. FEAR, DISTRACTION, and CULTURAL CONDITIONING LEAD ALL OF THIS. RIGHT NOW there&#39;s highly idiotic cryptocurrency policies placed in the US infrastructure bill that is utter nonsense. </p>\n\n<p>Major news outlets are controlled by entities that don&#39;t want a monetary network like bitcoin, that is true with integrity and transparency and honesty, because it exposes the manipulation and tactics governments and billionaires and hedge funds and etc play. Covid isn&#39;t priority. </p>\n\n<p>There&#39;s a war with monetary energy right now. Bitcoin was born to solve this, and it does. Read The Bitcoin Standard, read the original bitcoin white paper, look at the value of the dollar through history. We are in the birth of the metaverse. The rabbit hole is exposed.</p>\n\n<p>Watch how misinformed news article become, watch the countries that embrace the cryptoverse and those that stifle. Bitcoin has been tried, been banned, been manipulated, been talked down about, etc for the past 12 years, and its still leading the revolution. If you think it can be destroyed it would have been long ago. Bitcoin is being adopted faster than the internet; let that sink in. </p>\n\n<p>Bitcoin is the hardest asset ever created by mankind, nothing is more secure and integral, and can be moved and settled at the speed of light for little cost. No middleman to dip their hands in, no central authority to take away your sovereignty. This is what we are witnessing; these next 2-6 months will reveal truths to the blind.</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/Bitcoin/comments/ps2pc8/i_feel_like_im_in_a_black_mirror_episode/",
  "subreddit": "Bitcoin",
  "id": "ps2pc8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Evergrand's collapse in China and this global short-term economic pull-back\nshows humanity has learned nothing from the 2008 housing and financial collapse.\nDifferent reasons, same fuckery.\n\nDo not stay blind to the ABSOLUTE OBVIOUS FUCKERY that corporations, and banks,\nand governments pull on…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "中国でのエバーグランドの崩壊と、この世界的な短期経済の後退は\nは、人類が2008年の住宅・金融危機から何も学んでいないことを示しています。\n理由は違っても、やり方は同じだ。\n\n企業や銀行、そして政府が引っ張っている絶対的に明らかな馬鹿げたことに目をつぶってはいけません。\n企業や銀行、政府が行っている全く明らかな不正行為に目をつぶってはいけない。",
      "title": "ブラックミラーのエピソードの中にいるような気がします。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "中国恒大的倒闭和这次全球短期经济回调\n表明人类没有从2008年的住房和金融崩溃中吸取任何教训。\n不同的原因，同样的操蛋。\n\n不要对企业、银行和政府所造成的绝对的、显而易见的混乱保持盲目。\n和政府的行为...",
      "title": "我觉得我在《黑镜》的剧集中。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "中國恆大的倒閉和這次全球短期經濟回調\n表明人類沒有從2008年的住房和金融崩潰中吸取任何教訓。\n不同的原因，同樣的操蛋。\n\n不要對企業、銀行和政府所造成的絕對的、顯而易見的混亂保持盲目。\n和政府的行爲...",
      "title": "我覺得我在《黑鏡》的劇集中。"
    }
  ]
}