{
  "author": "TiyashaR",
  "original_created_utc": 1637940722,
  "title": "Have we gone too far with body positivity?",
  "created_utc": 1637985149,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Please hear me out. I just feel that in recent times there has been an unhealthy glorification of obesity. To love your body is one thing but to legitimise it to the point that you don&#39;t try to get fit is a whole different hypocritical space brands/people/influencers are owning. Everyone&#39;s favourite thing to say is, But I can dance, so I&#39;m fit. But are you dancing away the triglycerides, too? As someone who suffers from hypothyroidism,  I am a little familiar with the amount of effort it takes to not put on weight. So, I&#39;m obviously not talking about those who put on weight owing to some underlying condition. But I do think there is a huge population of plain unhealthy people with poor lifestyle who go the extra mile in the discourse of &quot;embracing your body&quot;</p>\n\n<p>I&#39;d love to hear your views, and change mine where I&#39;m wrong.</p>\n\n<p>Edit: I am not talking about pointing it out to anyone or &quot;shaming&quot; them in anway. I&#39;m simply asking is it ok to not encourage this thinking?</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/r2pyp5/have_we_gone_too_far_with_body_positivity/",
  "subreddit": "TooAfraidToAsk",
  "id": "r2pyp5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Please hear me out. I just feel that in recent times there has been an unhealthy\nglorification of obesity. To love your body is one thing but to legitimise it to\nthe point that you don't try to get fit is a whole different hypocritical space\nbrands/people/influencers are owning. Everyone's favourite…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ぜひ聞いてみてください。私は最近、不健康なまでに肥満を賛美するような\n肥満を美化しているように感じます。自分の体を愛することは一つのことですが、それを正当化するために\n自分の体を愛することは一つのことですが、体を鍛えようとしないところまで正当化するのは、全く別の偽善的な空間です。\nブランドや人々、インフルエンサーたちが所有しています。みんなの大好きな...",
      "title": "私たちはボディポジティブになりすぎたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "请听我说完。我只是觉得，最近一段时间，有一种不健康的\n对肥胖的赞美。爱惜自己的身体是一回事，但把它合法化到\n虚伪的空间是完全不同的。\n品牌/人/影响者正在拥有一个完全不同的虚伪空间。每个人都喜欢...",
      "title": "我们对身体的积极性是否走得太远了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "請聽我說完。我只是覺得，最近一段時間，有一種不健康的\n對肥胖的讚美。愛惜自己的身體是一回事，但把它合法化到\n虛僞的空間是完全不同的。\n品牌/人/影響者正在擁有一個完全不同的虛僞空間。每個人都喜歡...",
      "title": "我們對身體的積極性是否走得太遠了？"
    }
  ]
}