{
  "author": "Jeremykla",
  "the_new_excerpt": "Who could've thought we could earn money by posting about the stuff we love?\nDidn't teachers told us back the that our stupid hobby's/our wasted time wasn't\ngoing to pay bills?\n\nHeck yea, now we can by posting articles, upvoting and commenting on the things\nwe like to do.\n\n * Got some time while…",
  "original_created_utc": 1614789121,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "谁能想到我们可以通过发自己喜欢的东西来赚钱呢？\n老师不是告诉我们，我们的愚蠢爱好/我们浪费的时间并不是\n去支付账单？\n\n是的，现在我们可以通过发表文章，上传到网上，评论这些东西，来支付账单。\n我们喜欢做。\n\n *有一些时间，而...",
      "title": "没想到我(和很多人)会得到这样的报酬。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "誰能想到我們可以通過發自己喜歡的東西來賺錢呢？\n老師不是告訴我們，我們的愚蠢愛好/我們浪費的時間並不是\n去支付賬單？\n\n是的，現在我們可以通過發表文章，上傳到網上，評論這些東西，來支付賬單。\n我們喜歡做。\n\n *有一些時間，而...",
      "title": "沒想到我(和很多人)會得到這樣的報酬。"
    }
  ],
  "title": "Never thought I (and many others) would get paid this way",
  "created_utc": 1614807196,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Who could&#39;ve thought we could earn money by posting about the stuff we love? Didn&#39;t teachers told us back the  that our stupid hobby&#39;s/our wasted time wasn&#39;t going to pay bills? </p>\n\n<p>Heck yea, now we can by posting articles, upvoting and commenting on the things we like to do. </p>\n\n<ul>\n<li>Got some time while sitting on the toilet? Upvote what you like and start earning!</li>\n<li>swipping on the job, see anything you wanna share? DO IT and start earning some moons!</li>\n<li>wasting time while traveling to work (don&#39;t use your mobile phone while driving!!!)? Get browsing and upvote the articles you like! </li>\n</ul>\n\n<p>We have arrived at the future of earning passive income while reading what we love. </p>\n\n<p>Open your vault today!  Stay safe cryptofam.</p>\n</div><!-- SC_ON -->",
  "score": 964,
  "permalink": "/r/CryptoCurrency/comments/lwy068/never_thought_i_and_many_others_would_get_paid/",
  "subreddit": "CryptoCurrency",
  "id": "lwy068",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937739397
}