{
  "author": "discolia",
  "the_new_excerpt": "I understand you’re all excited about crypto (duh) and we all think it would be\nawesome to be able to actually pay for everyday stuff using crypto. But we’re\nstill a long way from being able to do that everywhere, and rooting for fiat\ncrashing is very nihilistic and not a good look. When the dollar…",
  "original_created_utc": 1617859966,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さんが暗号に興奮しているのは理解しています（当然です）。\n日常の支払いを暗号でできるようになれば最高だと思っています。しかし、私たちは\nしかし、どこでもできるようになるまでにはまだ長い道のりがあります。\n崩壊を応援するのは非常に虚無的で見苦しいです。ドルが...",
      "title": "フィアットがクラッシュすることを根に持ってはいけない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我明白你们对加密技术都很兴奋（duh），我们都认为这将是\n厉害的是能够真正使用加密技术来支付日常用品。但我们\n离到处都能这样做还有很长的路要走，并为菲亚特加油\n崩盘是非常虚无主义的，并不好看。当美元...",
      "title": "不要为菲亚特的崩溃加油"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我明白你們對加密技術都很興奮（duh），我們都認爲這將是\n厲害的是能夠真正使用加密技術來支付日常用品。但我們\n離到處都能這樣做還有很長的路要走，併爲菲亞特加油\n崩盤是非常虛無主義的，並不好看。當美元...",
      "title": "不要爲菲亞特的崩潰加油"
    }
  ],
  "title": "Don’t root for fiat crashing",
  "created_utc": 1617895874,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I understand you’re all excited about crypto (duh) and we all think it would be awesome to be able to actually pay for everyday stuff using crypto. But we’re still a long way from being able to do that everywhere, and rooting for fiat crashing is very nihilistic and not a good look. When the dollar crashes (yes I’m writing “when” not “if”, because I do believe it will crash in the next 5-10 years) it’s gonna be extremely detrimental to A LOT of people. </p>\n\n<p>I’m pretty young myself, and I’ve never had to live through extreme inflation + I live in one of the wealthiest countries per citizen in the world. But I’m still very concerned about inflation, and I can’t even imagine what terrible fates would be caused if a global financial crisis was to happen tomorrow. Don’t root for it to happen. Root for crypto to steadily be implemented into society, and for it to become a good and stable way of payments before we stop using fiat. Just my 2 Satoshis.</p>\n</div><!-- SC_ON -->",
  "score": 258,
  "permalink": "/r/CryptoCurrency/comments/mmkx0y/dont_root_for_fiat_crashing/",
  "subreddit": "CryptoCurrency",
  "id": "mmkx0y",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566612878
}