{
  "author": "DTux5249",
  "original_created_utc": 1628575519,
  "title": "Is There An Ethical Argument For Meat Consumption?",
  "created_utc": 1628635957,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>And into politics</p>\n\n<p>Mainly, The Veganosphere/Vegetarianosphere. </p>\n\n<p>When dealing with the topic, the most prevalent issue with animal product consumption (to my knowledge) is the ethics behind the slaughter of Animals.</p>\n\n<p>The sentience argument of veganism is roughly that plants aren&#39;t sentient enough to feel pain, and ergo are fine to consume. Animals, do. But, I find this generally assumes that sentience is only possible with a mammalian nervous system, despite plants reacting just as much to &quot;painful&quot; stimuli as animals (without moving, obviously)  </p>\n\n<p>There are other ways to process information that don&#39;t include nerves, eyes, ears, etc. and whenever someone says &quot;plants don&#39;t feel pain&quot;, the only accurate way I can come to interpret that is &quot;they don&#39;t feel pain in the way animals do&quot;. </p>\n\n<p>Which leads to the quandary: Is the Plant version of a &#39;pain response&#39; as valid as the Animal one?</p>\n\n<p>I don&#39;t know how heavy/sticky this topic is, especially in regards of rule 4, but I thought I&#39;d try here to start a discussion without angry arguing back and forth</p>\n</div><!-- SC_ON -->",
  "score": 115,
  "permalink": "/r/askphilosophy/comments/p1jdb7/is_there_an_ethical_argument_for_meat_consumption/",
  "subreddit": "askphilosophy",
  "id": "p1jdb7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "And into politics\n\nMainly, The Veganosphere/Vegetarianosphere.\n\nWhen dealing with the topic, the most prevalent issue with animal product\nconsumption (to my knowledge) is the ethics behind the slaughter of Animals.\n\nThe sentience argument of veganism is roughly that plants aren't sentient enough\nto…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そして政治へ\n\n主にThe Veganosphere/Vegetarianosphereです。\n\nこの話題を扱うとき、動物製品の消費に関する最も一般的な問題は\n消費に関する最も一般的な問題は、動物の屠殺にまつわる倫理観です。\n\nヴィーガニズムの感覚論は、おおよそ、植物は十分に感覚を持っていないというものです。\nとしています。",
      "title": "肉を食べることに倫理的な議論はあるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "并进入政治\n\n主要是素食圈/素食圈。\n\n在处理这个话题时，动物产品最普遍的问题是\n的问题是屠杀动物背后的伦理问题。\n\n素食主义的有意识论点大致是：植物没有足够的有意识\n以...",
      "title": "肉类消费是否有伦理上的论据？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "並進入政治\n\n主要是素食圈/素食圈。\n\n在處理這個話題時，動物產品最普遍的問題是\n的問題是屠殺動物背後的倫理問題。\n\n素食主義的有意識論點大致是：植物沒有足夠的有意識\n以...",
      "title": "肉類消費是否有倫理上的論據？"
    }
  ]
}