{
  "author": "Logan_Maddox",
  "original_created_utc": 1628128952,
  "title": "Moby Dick, Queequeg, and Homossexuality in 19th Century USA",
  "created_utc": 1628192418,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi! This question has been asked before but it never received an answer. At the beginning of Moby Dick, Ishmael&#39;s relationship to Queequeg is very close to what we today would understand as gay. Queequeg grabs Ishmael and says they&#39;re married (supposedly, in his culture, this would mean they&#39;re &#39;like brothers&#39;), they go to bed unclothed (a common practice at the time, as I understand) and spend the whole night talking, Ishmael prays with him, etc.</p>\n\n<p>Would people in the 19th century understand this as normal behaviour? Or can we say that Herman Melville might have been putting homosexual subtext in his work - whether he was or not?</p>\n\n<p>Thanks!</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/oy7rsx/moby_dick_queequeg_and_homossexuality_in_19th/",
  "subreddit": "AskHistorians",
  "id": "oy7rsx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi! This question has been asked before but it never received an answer. At the\nbeginning of Moby Dick, Ishmael's relationship to Queequeg is very close to what\nwe today would understand as gay. Queequeg grabs Ishmael and says they're\nmarried (supposedly, in his culture, this would mean they're…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは！この質問は以前にもされたことがありますが、回答はありませんでした。冒頭の\nモビーディック』の冒頭で、イシュマエルとQueequegの関係は、現代の私たちが理解するものと非常に近いものです。\n現代の私たちが同性愛者として理解するものに非常に近いものがあります。クィーケグはイシュマエルをつかみ、結婚したと言います。\n結婚したと言っています（おそらく彼の文化では、それは彼らが...という意味でしょう）。",
      "title": "モビーディック、クイークェグ、そして19世紀アメリカのホモセクシュアリティ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好！这个问题以前就有人问过，但一直没有得到答复。在\n在《白鲸》的开头，Ishmael与Queequeg的关系非常接近于我们今天所理解的同性恋。\n我们今天会理解为同性恋。Queequeg抓住Ishmael，说他们是\n他们结婚了（据说，在他的文化中，这意味着他们是......）。",
      "title": "白鲸》、Queequeg和19世纪美国的同性性行为"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好！這個問題以前就有人問過，但一直沒有得到答覆。在\n在《白鯨》的開頭，Ishmael與Queequeg的關係非常接近於我們今天所理解的同性戀。\n我們今天會理解爲同性戀。Queequeg抓住Ishmael，說他們是\n他們結婚了（據說，在他的文化中，這意味着他們是......）。",
      "title": "白鯨》、Queequeg和19世紀美國的同性性行爲"
    }
  ]
}