{
  "author": "hhh888hhhh",
  "the_new_excerpt": "\"The compromise will sweep out the $429 billion in unspent CARES Act funding for\nthe Federal Reserve’s credit lending facilities and repurpose it as an offset\nfor a new $900 billion coronavirus relief bill, GOP sources said.\n\nThe deal will close four Federal Reserve credit lending facilities created…",
  "original_created_utc": 1608440717,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "“这项妥协将扫除CARE法案中4290亿美元的未用资金，用于\n美联储的信贷贷款安排，并将其重新用于抵消\n共和党消息人士称，为一项新的9000亿美元冠状病毒救济法案。\n\n这笔交易将完成美联储创建的四项信贷贷款安排…",
      "title": "随着议员们就共和党提出的限制美联储权力的提议达成妥协，为达成刺激方案协议扫清了道路，J·鲍威尔现在的帮助没有昨天那么大。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "“這項妥協將掃除CARE法案中4290億美元的未用資金，用於\n美聯儲的信貸貸款安排，並將其重新用於抵消\n共和黨消息人士稱，爲一項新的9000億美元冠狀病毒救濟法案。\n\n這筆交易將完成美聯儲創建的四項信貸貸款安排…",
      "title": "隨着議員們就共和黨提出的限制美聯儲權力的提議達成妥協，爲達成刺激方案協議掃清了道路，J·鮑威爾現在的幫助沒有昨天那麼大。"
    }
  ],
  "title": "J. PowellL is now less helpful than yesterday as Lawmakers reach compromise over GOP proposal to rein in Fed’s powers, clearing path for a stimulus package deal.",
  "created_utc": 1608474848,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>&quot;The compromise will sweep out the $429 billion in unspent CARES Act funding for the Federal Reserve’s credit lending facilities and repurpose it as an offset for a new $900 billion coronavirus relief bill, GOP sources said.</p>\n\n<p>The deal will close four Federal Reserve credit lending facilities created by the CARES Act and will prevent the Fed from standing up replica facilities in the future without congressional approval.</p>\n\n<p>Those four programs include the primary market corporate credit facility, the secondary market corporate credit facility, the Main Street lending program and the municipal credit facility.</p>\n\n<p>The Fed will retain more flexibility over restarting the Term Asset-Backed Securities Loan Facility.&quot;</p>\n\n<p><a href=\"https://www.washingtonpost.com/us-policy/2020/12/19/stimulus-talks-race-against-government-shutddown-deadline/\">Lawmakers reach compromise over GOP proposal to rein in Fed’s powers, clearing path for a stimulus package deal</a></p>\n</div><!-- SC_ON -->",
  "score": 706,
  "permalink": "/r/investing/comments/kgo2sp/j_powelll_is_now_less_helpful_than_yesterday_as/",
  "subreddit": "investing",
  "id": "kgo2sp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609260493090
}