{
  "author": "Sqwishylumpscrossing",
  "original_created_utc": 1635775128,
  "title": "Does anyone here get anxiety when posting on social media ? Like you want to, but at the same time you are too scared to ?",
  "created_utc": 1635788146,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Im a very shy person overall but the reason why I want to be more active on social media is so I wont loose touch with the world and my friends. This came to thought after highschool, bc throughout highschool I would never post on social either but now I feel like I should now so I dont loose touch my my social life im not really sure how to explain it but ive always wanted to have the courage to post on social media, but when I do thats all I focus in all day, the thought that everyone can see it, even if they are my friends scares me. it’s almost like killing a spider when i post something. i click post as if im hitting the spider  and then run away lol it probably sounds really strange putting it that way but thats the best way i could describe it lol</p>\n</div><!-- SC_ON -->",
  "score": 117,
  "permalink": "/r/NoStupidQuestions/comments/qkeklv/does_anyone_here_get_anxiety_when_posting_on/",
  "subreddit": "NoStupidQuestions",
  "id": "qkeklv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Im a very shy person overall but the reason why I want to be more active on\nsocial media is so I wont loose touch with the world and my friends. This came\nto thought after highschool, bc throughout highschool I would never post on\nsocial either but now I feel like I should now so I dont loose touch…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は全体的にとてもシャイな人間ですが、ソーシャルメディアでもっと積極的になりたいと思う理由は\n積極的にソーシャルメディアを利用したいと思ったのは、世界や友達とのつながりを絶やさないためです。これは\n高校生になってから思ったことですが、高校生の頃はSNSに投稿することもなかったので\nでも今は、連絡を絶やさないためにも、そうすべきだと思っています...。",
      "title": "ソーシャルメディアに投稿するときに不安になる人はいますか？投稿したいけど、怖くてできない、とか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个非常害羞的人，但我想在社交媒体上更加活跃的原因是我不会与世界和我的朋友失去联系。\n的原因是我不会与世界和我的朋友失去联系。这一点是在高中毕业后才想到的。\n因为在整个高中阶段，我从来没有在社交媒体上发表过文章。\n但现在我觉得我应该这样做，这样我就不会失去联系......",
      "title": "这里有人在社交媒体上发帖时感到焦虑吗？比如你想发，但同时你又不敢发？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個非常害羞的人，但我想在社交媒體上更加活躍的原因是我不會與世界和我的朋友失去聯繫。\n的原因是我不會與世界和我的朋友失去聯繫。這一點是在高中畢業後纔想到的。\n因爲在整個高中階段，我從來沒有在社交媒體上發表過文章。\n但現在我覺得我應該這樣做，這樣我就不會失去聯繫......",
      "title": "這裏有人在社交媒體上發帖時感到焦慮嗎？比如你想發，但同時你又不敢發？"
    }
  ]
}