{
  "author": "xavierwest888",
  "original_created_utc": 1644934042,
  "title": "Before you dump your life savings into crypto on this little pump remember that the FED announcement is next month and will almost certainly dip the market again",
  "created_utc": 1644973544,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Title says it all, diplomacy in Europe was always going to be Russia&amp;#39;s end goal and the market is responding to their first obvious step towards that goal. As such crypto had a healthy pump today in line with market investors expectations.&lt;/p&gt;\n\n&lt;p&gt;However, the FED are highly like going to have to make some real steps towards taking inflation in March.&lt;/p&gt;\n\n&lt;p&gt;Although a lot of those is already proced in, the extent of the damage to the economy is highly likely to mean a correction to interest rates above what was previously expected.&lt;/p&gt;\n\n&lt;p&gt;Of course, once that is over with there is a real chance of smooth sailing right up the bull market mountain again.&lt;/p&gt;\n\n&lt;p&gt;Fingers crossed and eyes peeled!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 320,
  "permalink": "/r/CryptoCurrency/comments/st3qzp/before_you_dump_your_life_savings_into_crypto_on/",
  "subreddit": "CryptoCurrency",
  "id": "st3qzp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Title says it all, diplomacy in Europe was always going to be Russia's end goal\nand the market is responding to their first obvious step towards that goal. As\nsuch crypto had a healthy pump today in line with market investors expectations.\n\nHowever, the FED are highly like going to have to make…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルがすべてを物語っている。ヨーロッパにおける外交は、常にロシアの最終目標になるはずだった。\nそして、その目標に向けた彼らの最初の明白な一歩に、市場は反応している。そのため\nそのため、暗号は今日、市場投資家の期待に沿う形で健全な上昇を見せました。\n\nしかし、FEDは、非常に作る必要があるとしているようです...",
      "title": "この小さなポンプで暗号にあなたの人生をダンプする前に、FEDの発表は来月であり、ほぼ確実に再び市場を浸漬することを忘れないでください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "标题说明了一切，在欧洲的外交一直是俄罗斯的最终目标\n而市场正在对他们向这一目标迈出的第一个明显步骤作出反应。因此\n因此，加密货币今天有一个健康的泵，与市场投资者的预期一致。\n\n然而，FED非常像将不得不做出...",
      "title": "在你把你的毕生积蓄倾倒在这个小泵上之前，请记住，FED的公告是在下个月，几乎肯定会使市场再次下挫。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "標題說明了一切，在歐洲的外交一直是俄羅斯的最終目標\n而市場正在對他們向這一目標邁出的第一個明顯步驟作出反應。因此\n因此，加密貨幣今天有一個健康的泵，與市場投資者的預期一致。\n\n然而，FED非常像將不得不做出...",
      "title": "在你把你的畢生積蓄傾倒在這個小泵上之前，請記住，FED的公告是在下個月，幾乎肯定會使市場再次下挫。"
    }
  ]
}