{
  "author": "Adventurous-Ad6416",
  "the_new_excerpt": "Hey New here. Need to share. Can’t tell sis cause she’s a freeloader (57 and\nhasn’t worked in 20 years) and can’t tell mom cause she’d tell sis. It’s ALL I\nHAVE. I had 200k before this due to 2001 and 2008 and apartment buildings that\nwent south in a state I never should have bought into - Missouri.…",
  "original_created_utc": 1612859358,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "嘿，新来的。需要分享。不能告诉姐姐，因为她是个自由职业者（57岁，而且是个大男人）。\n已经20年没工作了），不能告诉妈妈，因为她会告诉姐姐。这是所有我\n有。在这之前我有20万，由于2001年和2008年和公寓楼，。\n在一个我根本就不应该买进的州--密苏里州....。",
      "title": "60岁的女子终于兑现了价值170万的期权。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嘿，新來的。需要分享。不能告訴姐姐，因爲她是個自由職業者（57歲，而且是個大男人）。\n已經20年沒工作了），不能告訴媽媽，因爲她會告訴姐姐。這是所有我\n有。在這之前我有20萬，由於2001年和2008年和公寓樓，。\n在一個我根本就不應該買進的州--密蘇里州....。",
      "title": "60歲的女子終於兌現了價值170萬的期權。"
    }
  ],
  "title": "60 y/o woman finally cashed in options worth 1.7m",
  "created_utc": 1612866262,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey\nNew here. Need to share. Can’t tell sis cause she’s a freeloader (57 and hasn’t worked in 20 years) and can’t tell mom cause she’d tell sis. It’s ALL I HAVE. I had 200k before this due to 2001 and 2008 and apartment buildings that went south in a state I never should have bought into - Missouri. No hubby or kids. Probably can’t tell anyone I start to date when pandemic is over. So I go from being worth little to a lot and am invested in Vanguard esg etfs using their portfolio manager at 60/40 stock and bonds and am making a fortune- but I FEEL SO ALONE. Can’t tell a SOUL but my therapist.  Also own home with 500k equity. Question. Wtf. Buying myself caviar etc from Gary Danko on Feb 14 which I deserve. Oh btw FT job at 200k year WFH. JEEZ. how can I process this largesse alone?  My therapist has zero sympathy.</p>\n</div><!-- SC_ON -->",
  "score": 702,
  "permalink": "/r/investing/comments/lfy3ad/60_yo_woman_finally_cashed_in_options_worth_17m/",
  "subreddit": "investing",
  "id": "lfy3ad",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123199876
}