{
  "author": "Pxrtables",
  "the_new_excerpt": "Previously I posted on Biocryst (BCRX)’s recently approved drug\nBerotralstat/Orladeyo and how it alone warranted a valuation of $121 for\nBiocryst’s stock, not the inexplicable current price of $8.52 that we now\nsee—that can only be possible from the public’s general ignorance of this\ncompany and its…",
  "original_created_utc": 1612158071,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "此前我曾发过一篇关于Biocryst（BCRX）最近获批药物的文章。\nBerotralstat/Orladeyo，以及它本身如何证明了121美元的估值。\nBiocryst的股票，而不是我们现在莫名其妙的8.52美元的现价。\n看--那只能从公众对这个的普遍无知中获得。\n公司及其...",
      "title": "Biocryst's BCX9930--一个能够治疗无数炎症性疾病的不可能的价值药物。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "此前我曾發過一篇關於Biocryst（BCRX）最近獲批藥物的文章。\nBerotralstat/Orladeyo，以及它本身如何證明了121美元的估值。\nBiocryst的股票，而不是我們現在莫名其妙的8.52美元的現價。\n看--那隻能從公衆對這個的普遍無知中獲得。\n公司及其...",
      "title": "Biocryst's BCX9930--一個能夠治療無數炎症性疾病的不可能的價值藥物。"
    }
  ],
  "title": "Biocryst’s BCX9930—an impossible to value drug able to treat countless inflammatory diseases",
  "created_utc": 1612161123,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Previously I posted on Biocryst (BCRX)’s recently approved drug Berotralstat/Orladeyo and how it alone warranted a valuation of $121 for Biocryst’s stock, not the inexplicable current price of $8.52 that we now see—that can only be possible from the public’s general ignorance of this company and its severe shorting that has made it the 12th most shorted stock, with a short float of 21% at last count. We are now going to look at Biocryst’s up-and-coming drug BCX9930, a Factor D inhibitor that stockholders have come to refer to as Factor D. Once anyone understands Factor D and its potential and realizes Biocryst’s undervaluation, one just stops buying other stocks, period.\nFactor D is, like Berotralstat, an oral once-a-day pill that acts against a critical and essential component of the amplification loop of the alternative complement activation pathway. Why is this important? Because numerous infectious and autoimmune diseases including COVID19 (as seen in this paper published in Blood; <a href=\"https://ashpublications.org/blood/article-\">https://ashpublications.org/blood/article-</a> pdf/136/18/2080/1779273/bloodbld2020008248.pdf), Dengue, Age-Related Macular Degeneration, Stargadt Macular Dystrophy, PNH, Hemolytic Uremic Syndrome, Catastrophic antiphospholipid antibody syndrome, Antibody-Mediated Transplant Rejection, ANCA vasculitis, C3 Glomerulopathy, Thrombotic Microangiopathy, IgA Nephropathy, Lupus, Multiple Sclerosis, ALS, Neuromyelitis Myelitica and even obesity (yes, obesity—Factor D deficient mice fed a lot of fat do not develop fatty liver disease and fibrosis. How about that for a side-effect? <a href=\"https://pubmed.ncbi.nlm.nih.gov/33067533/\">https://pubmed.ncbi.nlm.nih.gov/33067533/</a>). Countless other diseases too. You get the idea. How big are the markets for all of these diseases? No one knows...$50 billion? 100 billion? Every company is vying for them, but BCX9930 is the only one that is working well in patients so far... Hence the reason for persistent analyst questions at every single earnings release meeting and investor conference on the topic, even when Berotralstat and Galidesivir are also up for discussion. BCX9930 was highly potent, specific, and safe in preclinical studies as of 2019. On December 6th, at the American Society of Hematology meeting, those results were elaborated on more officially, with a report that the alternate complement pathway was completely blocked. In 2019, BCX9930 was further found to be safe in a human Phase I safety trial. In 2020, BCRX began treating treatment-naive PNH patients at low doses in a Phase 2 trial in South Africa. So far, the results have been spectacular and superior to all other companies’ attempts at blocking the complement pathway (which have been with IV drugs). For instance, the drug produces a hemoglobin improvement in PNH patients of 3.8 g/dL, compared to its main competitors with 2.6 and 2.7. That extra 1.2 g/dL is very important and could be the difference between sickness requiring transfusions and health for half these folks. It also makes it much more likely that it is going to be successful with all other diseases. Another example of a comparison of BCX9930 to other drugs (albeit not in full detail). Narsoplimab was given to HSCT patients for 347 days. Their patients’ LDH fell from a mean of 591 to 250. Now look at what BCX9930 did to LDH in PNH patients. In just 28 days LDH fell from 567 to 168. Why is this important? The normal LDH range is 140-280. After a whole year, Narso brought LDH down to the upper end of normal, while in 1 month, Factor D brought it to the low end of normal. Why? Because Factor D is an excellent bioavailable drug and Narsoplimab is an antibody limiting its ability to compete against a drug like Factor D.</p>\n\n<p>It’s no wonder then that the company expanded study of PNH patients to Europe in summer 2020 based on clinical trial records (148 participants expected to enroll; phase 2 to complete in mid-2021). In January clinicaltrials.gov reported that the Phase 2 trial is now listed as 200 patients. That&#39;s 10% of the whole world&#39;s PNH patients!\nWith this knowledge, is it surprising that the FDA gave it Orphan and Fast-Track status in September 2020 on news of the strong results in high dose patients? Next, perhaps this very week, we will learn of the data for Complement C5-resistant PNH patients and high dose BCX9930 patients. These are likely also to be spectacular and will lay the groundwork not only for FDA approval (remember that 200 or 10% of the whole world’s PNH patients are scheduled to be receiving the drug now or shortly) but also expansion to many new indications mentioned above. In the December earnings report conference, the company stated that it is in detailed negotiations on new clinical trials with the FDA for other indications, the most likely two new indications will be related to kidney diseases like lupus nephritis or glomerulosclerosis. Note that the CEO confirmed at the January 13th JP Morgan Healthcare conference that an announcement of a new renal disease trial was imminent. But the critical thing to realize is that BCX9930 just has to be approved for PNH, which it’s getting close to doing, then it can be expanded to every single one of these other indications (note that the company has specifically expressed interest in studying hematologic, renal and neurological diseases) quite quickly and with the completion of each trial, and some of them will be off-label. It used to be thought that complement activation would inhibit cancer but now it is realized that complement inhibition helps to kill cancer, that is one more thing to think about—killing cancer cells wouldn’t be a bad side-effect too, would it?\n[this paragraph and figure not in Reddit article] Regarding COVID-19, see the below image from a review article about COVID-19 pointing out that there is a trinity of systems causing COVID- 19 disease. Note that alternative complement activation is a critical component of it (and see where BCX9930 in red fits into that).</p>\n\n<p>As a demonstration of how big a role alternative complement activation plays in COVID-19, in a study of 88 Covid19 positive patients (<a href=\"https://www.medrxiv.org/content/10.1101/2020.12.11.20247668v1\">https://www.medrxiv.org/content/10.1101/2020.12.11.20247668v1</a>), it was found that over half had an excessive IgA response and one already had definitive IgA Nephropathy and was developing gradual renal failure. IgA Nephropathy is caused by deposition of complement in the kidney. You should now be able to see how it may be extremely relevant for this pandemic.\nThe size of the market for these indications is unparalleled in all of medicine, and so how can we possibly value such a drug? What about funding it for all of these trials? Will it produce huge dilution? NO! The company has prepared for that, partly with a huge nondilutive royalty funding announcement made on December 7th, that gives it $325 million to pursue all of these trials and maximize the uses of these drugs for future patients for all of these rare and common diseases, as well as is investors, but written in such a way that investors will profit tremendously without suffering from dilution. What about competitors like Alexion? Other Factor D drugs Lampalizumab and ACH-4471, now known as ALXN2040, previously highly valued by the market have proven inferior to BCX9930 and are now largely ignored. Achillion was bought for $1 billion just for ACH-4471 which failed for one indication and is now being tried by Alexion for others, but if it fails in one indication it will most likely fail in others too. In late July in its earnings report, as alluded to above, Alexion Pharmaceuticals (ALXN) announced the discontinuation of its oral Factor D inhibitor ALXN2040 (<a href=\"https://gmpnews.net/2020/07/alexion-discontinued-studies-of-alxn2040-in-c3-\">https://gmpnews.net/2020/07/alexion-discontinued-studies-of-alxn2040-in-c3-</a> glomerulopathy-following-disappointing-interim-data/) that it spent nearly $1B to acquire in 2019—due to a lack of clinical benefit. Alexion was then bought out for $39 billion by Astra-Zeneca, in large part for that same imperfect drug, because even if the drug doesn’t work that well, the number of possible indications for it to be tested in are so astonishingly big that it was worth the huge price tag. And yet BCX9930 has consistently shown superior</p>\n\n<p>results the whole time. No surprise now then that the FDA gave it Fast Track and Orphan Drug status. Because there is no real competitor. Maybe you will say there are the C5 drugs...? Well, so certain is the company that BCX9930 is going to be superior to all other anti- complement drugs including the C5 drugs that the CEO at the JPMorgan Healthcare Conference on January 13th said that they would become obsolete by BCX9930. Think about that. Have you ever heard such a confident CEO?\nSo how does one value a drug that is being tested on hundreds of PNH patients in a Phase 2 trial with excellent results going back already for over a year, that the FDA is so supportive that it has given its highest levels of support for, which has no true competitors, is oral, safe and effective, and which is about to be applied to first 2-3 new diseases and then to dozens, with potential annual sales in the tens of billions? It is impossible to measure, even though I have attempted all along to quantify it ... But it is not a current valuation of $1.5 billion.... You can take that to the bank (or to the hedge fund shorting this stock)!!!!</p>\n</div><!-- SC_ON -->",
  "score": 54,
  "permalink": "/r/stocks/comments/l9w06m/biocrysts_bcx9930an_impossible_to_value_drug_able/",
  "subreddit": "stocks",
  "id": "l9w06m",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518539373
}