{
  "author": "proph3tsix",
  "original_created_utc": 1651594865,
  "title": "The recent Congressional letter penned to the EPA requesting investigation into Bitcoin mining facilities was signed by 22 officials, ALL DEMOCRATS.",
  "created_utc": 1651643360,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I posted on this sub recently, imploring Bitcoiners in the United States who vote Democrat to start speaking up and clean house, because the party as it stands is going the direction of the Communist Party in China with respect to Bitcoin. I was downvoted / shouted down for the crime of suggesting Bitcoin is somehow &amp;quot;political&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Yea yea, BiTcOiN iS aPoLiTiCaL. Meanwhile, Congress is encouraging the EPA to essentially boot Bitcoin from the United States.&lt;/p&gt;\n\n&lt;p&gt;I have my coins in Cold Storage and I understand the tech. I&amp;#39;m not concerned about confiscation or my ability to spend/transfer. I am concerned about effectively living in China while not living in China at all. People on this sub keep insinuating Bitcoin is alive and well in Communist China, despite the CCP&amp;#39;s clampdown... But I haven&amp;#39;t seen many reputable sources to confirm this, so you&amp;#39;ll have to pardon my skepticism. The recent letter to the EPA makes it clear that the current Democratic Congress in the United States is flirting with a CCP style agenda with respect to Bitcoin. That scares the hell out of me, and it should scare the hell out of you.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s becoming clear that IF the United States and Europe decide to go the way of China with regards to banning Proof of Work mining, then we Americans can all thank our local Democratic congressman or congresswoman for doing their part in our &amp;quot;progress&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;PLEASE. Get out there and vote these banking-industry sluts out of office so that US citizens don&amp;#39;t have to live under the CCP by proxy.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 306,
  "permalink": "/r/Bitcoin/comments/uhjrz7/the_recent_congressional_letter_penned_to_the_epa/",
  "subreddit": "Bitcoin",
  "id": "uhjrz7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I posted on this sub recently, imploring Bitcoiners in the United States who\nvote Democrat to start speaking up and clean house, because the party as it\nstands is going the direction of the Communist Party in China with respect to\nBitcoin. I was downvoted / shouted down for the crime of suggesting…"
}