{
  "author": "Talton1",
  "original_created_utc": 1625137242,
  "title": "I mined 0.5 ETH back in 2018... and my GF made me sell it!",
  "created_utc": 1625161836,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>(Tl,dr at bottom)</p>\n\n<hr/>\n\n<p>It took around 2 weeks to mine at the time, I was actually losing money due to the electricity cost, but I didn&#39;t know it at the time.</p>\n\n<p>The whole process fascinated me, I&#39;d setup a little miner behind the TV unit with a bunch of GTX 1060s, and it was amazing, ticking away like a money printing machine, hell bent on becoming rich!</p>\n\n<p>Sadly my abusive, controlling GF at the time told me to &quot;quit fucking around and shut it down&quot; when the electricity bill came in, it had more than doubled and we couldn&#39;t afford it, told me to sell the ETH to cover the bill... so that was that, I sold to avoid the wrath of my gf, project over, boxed the parts up and put them in the cupboard.</p>\n\n<p>Around a year ago, I found out she was seeing someone behind my back, it&#39;dbeen going on awhile, we parted ways badly, house gone, dog gone, bank account almost empty, but I was finally free to do what I wanted!</p>\n\n<p>After I had settled into my new place I decided to check out my old CB account, and spotted the sale order for 0.5 ETH at $110, I was a little disappointed in myself, but free to do as I wanted, I still had my box of GPUs so decided to fire up the miner and have a bit of fun tinkering around, set myself a goal of getting back that 0.5 ETH and take my mind off of my crappy situation.</p>\n\n<p>That was around 7 months ago, I&#39;ve since then added some RTX 3070s, ROId, and today I finally mined back that sold 0.5 ETH!</p>\n\n<p>Goal achieved!</p>\n\n<p>If only I had kept mining back in 2018 until today, oh well, time to get that elusive 1 ETH I guess!</p>\n\n<hr/>\n\n<p>Tl,dr: mined 0.5 ETH in 2018, controlling gf told me to sell to cover electric, broke up a year ago, decided to mine back 0.5 ETH, got it back today.</p>\n\n<hr/>\n\n<p>I&#39;m terrible at writing, and my story is probably boring, but I&#39;ve had fun the past year with crypto, and just wanted to write it out, thanks for reading! (If you did)</p>\n</div><!-- SC_ON -->",
  "score": 169,
  "permalink": "/r/CryptoCurrency/comments/objeqw/i_mined_05_eth_back_in_2018_and_my_gf_made_me/",
  "subreddit": "CryptoCurrency",
  "id": "objeqw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "(Tl,dr at bottom)\n\n--------------------------------------------------------------------------------\n\nIt took around 2 weeks to mine at the time, I was actually losing money due to\nthe electricity cost, but I didn't know it at the time.\n\nThe whole process fascinated me, I'd setup a little miner…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "(下部にTl,dr)\n\n--------------------------------------------------------------------------------\n\n当時は採掘に2週間ほどかかっていたが、実際には電気代で赤字になっていた。\n電気代で赤字になっていましたが、その時は気付きませんでした。\n\nその過程に魅了されて、私は小さな採掘機をセットアップして...",
      "title": "2018年に0.5ETHを採掘したんだけど...GFに売らされたんだよねー。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "(Tl,dr在底部)\n\n--------------------------------------------------------------------------------\n\n当时花了大约2个星期的时间来开采，由于电费，我实际上是在亏钱。\n电费，但我当时并不知道。\n\n整个过程让我着迷，我设置了一个小矿工...",
      "title": "我早在2018年就挖到了0.5个ETH......我的GF让我卖掉它!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "(Tl,dr在底部)\n\n--------------------------------------------------------------------------------\n\n當時花了大約2個星期的時間來開採，由於電費，我實際上是在虧錢。\n電費，但我當時並不知道。\n\n整個過程讓我着迷，我設置了一個小礦工...",
      "title": "我早在2018年就挖到了0.5個ETH......我的GF讓我賣掉它!"
    }
  ]
}