{
  "author": "machuii",
  "original_created_utc": 1627786355,
  "title": "I think I’m done explaining Bitcoin",
  "created_utc": 1627810569,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I like Bitcoin and the crypto space. Met a lot of intelligent, highly calculated risk averse open minded people. We made some gains together and analyzed/speculated on some new projects. I love the curiosity of new people coming into the space. But sometimes I get tired of explaining what the crypto verse is and how revolutionary Bitcoin is to closed minded people. I’m basically done explaining it to them. Once I sense some resistance, negativity, or a response claiming how horrible the space is, I’m just going to stop all together and walk away. To each their own right. It’s energy draining trying to convince to someone how fiat is a bad idea, how government keeps printing over and over again, and how Bitcoin and crypto fixes this. Just gonna focus on my portfolio from now on and anyone else that has the passion to learn. Anyone else feel this way or am I just going mad?</p>\n</div><!-- SC_ON -->",
  "score": 155,
  "permalink": "/r/Bitcoin/comments/ovkcbr/i_think_im_done_explaining_bitcoin/",
  "subreddit": "Bitcoin",
  "id": "ovkcbr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I like Bitcoin and the crypto space. Met a lot of intelligent, highly calculated\nrisk averse open minded people. We made some gains together and\nanalyzed/speculated on some new projects. I love the curiosity of new people\ncoming into the space. But sometimes I get tired of explaining what the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はビットコインと暗号空間が好きです。多くの知的で高度に計算された\nリスクを嫌うオープンマインドの人たちに出会いました。私たちは一緒にいくつかの利益を得て\nいくつかの新しいプロジェクトを分析/推測しました。私は、この領域に入ってくる新しい人々の好奇心が大好きです。\nスペースに入ってくる好奇心が大好きです。しかし、時々、私は何を説明するのに疲れてしまいます。",
      "title": "ビットコインの説明は終わりました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我喜欢比特币和加密货币空间。遇到了很多聪明的、高度计算的\n厌恶风险的开放人士。我们一起取得了一些收益，并\n分析/猜测了一些新的项目。我喜欢新人们的好奇心\n进入这个空间。但有时我厌倦了解释什么...",
      "title": "我想我已经解释完比特币的问题了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我喜歡比特幣和加密貨幣空間。遇到了很多聰明的、高度計算的\n厭惡風險的開放人士。我們一起取得了一些收益，並\n分析/猜測了一些新的項目。我喜歡新人們的好奇心\n進入這個空間。但有時我厭倦瞭解釋什麼...",
      "title": "我想我已經解釋完比特幣的問題了"
    }
  ]
}