{
  "author": "BelgianPolitics",
  "original_created_utc": 1631074050,
  "title": "CEO of Coinbase Brian Armstrong goes on a (passive aggressive) rant against the SEC. Here's the full transcript!",
  "created_utc": 1631086279,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>1) Some really sketchy behavior coming out of the SEC recently. Story time…</p>\n\n<p>2) Millions of crypto holders have been earning yield on their assets over the last few years. It makes sense, if you want to lend out your funds, you can earn a return. Everyone seems happy.</p>\n\n<p>3) A bunch of great companies in crypto have been offering versions of this for years. Coinbase came out recently and said we would be launching our own version.</p>\n\n<p>4) We were planning to go live in a few weeks, so we reached out to the SEC to give them a friendly heads up and briefing</p>\n\n<p>5) They responded by telling us this lend feature is a security. Ok - seems strange, how can lending be a security? So we ask the SEC to help us understand and share their view. We always make an effort to work proactively with regulators, and keep an open mind.</p>\n\n<p>6) They refuse to tell us why they think it&#39;s a security, and instead subpoena a bunch of records from us (we comply), demand testimony from our employees (we comply), and then tell us they will be suing us if we proceed to launch, with zero explanation as to why.</p>\n\n<p>7) Look….we&#39;re committed to following the law. Sometimes the law is unclear. So if the SEC wants to publish guidance, we are also happy to follow that (it&#39;s nice if you actually enforce it evenly across the industry equally btw).</p>\n\n<p>8) But in this case they are refusing to offer any opinion in writing to the industry on what should be allowed and why, and instead are engaging in intimidation tactics behind closed doors. Whatever their theory is here, it feels like a reach/land grab vs other regulators.</p>\n\n<p>9) Meanwhile, plenty of other crypto companies continue to offer a lend feature, but Coinbase is somehow not allowed to.</p>\n\n<p>10) Gensler in his confirmation hearing: “It’s important for the SEC to provide guidance and clarity,” Gensler said. “Sometimes that’s a clarity that will be a thumbs up, but even if it’s thumbs down, it’s important to provide that.”  March 2, 2021</p>\n\n<p>11) If you don&#39;t want this activity, then simply publish your position, in writing, and enforce it evenly across the industry.</p>\n\n<p>12) Ostensibly the SEC&#39;s goal is to protect investors and create fair markets. So who are they protecting here and where is the harm? People seem pretty happy to be earning yield on these various products, across lots of other crypto companies.</p>\n\n<p>13) Shutting these down would arguably be harming consumers more than protecting them, and by preventing Coinbase from launching the same thing that other companies already have live, they&#39;re creating an unfair market.</p>\n\n<p>14) In May of this year I traveled to DC to meet with every regulator and branch of government I could.</p>\n\n<p>15) The SEC was the only regulator that refused to meet with me, saying &quot;we&#39;re not meeting with any crypto companies&quot;. This was right after we became the first crypto company to go public in the U.S.</p>\n\n<p>16) Gensler had been confirmed just a month prior, so I brushed it off as the SEC still getting its feet under it. Now I&#39;m not so sure.</p>\n\n<p>17) We&#39;ve always tried to be good actors in the space - leaning in to sensible regulation even when it is difficult or expensive. We try to think about what products we would want for ourselves, and what risks we would want our families to be aware of, before launching products.</p>\n\n<p>18) We will keep following this approach.</p>\n\n<p>19) Yet here, we&#39;re being threatened with legal action before a single bit of actual guidance has been given to the industry on these products.</p>\n\n<p>20) If we end up in court we may finally get the regulatory clarity the SEC refuses to provide. But regulation by litigation should be the last resort for the SEC, not the first.</p>\n\n<p>21) Our door remains open. Hopefully the SEC steps up to create the clarity this industry deserves, without harming consumers and companies in the process. America could really use us all working together to figure this out right now.</p>\n\n<p><strong>END</strong></p>\n</div><!-- SC_ON -->",
  "score": 252,
  "permalink": "/r/CryptoCurrency/comments/pk36ip/ceo_of_coinbase_brian_armstrong_goes_on_a_passive/",
  "subreddit": "CryptoCurrency",
  "id": "pk36ip",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "1) Some really sketchy behavior coming out of the SEC recently. Story time…\n\n2) Millions of crypto holders have been earning yield on their assets over the\nlast few years. It makes sense, if you want to lend out your funds, you can earn\na return. Everyone seems happy.\n\n3) A bunch of great companies…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1）最近のSECでは、本当に大雑把な行動が目立ちます。ストーリータイム...\n\n2) ここ数年、何百万人もの暗号保有者が自分の資産から利回りを得ている。\nここ数年で これは理にかなっており、もしあなたが資金を貸し出したいのであれば、あなたはリターンを得ることができます。\nリターンを得ることができます。みんな幸せそうですね。\n\n3）たくさんの素晴らしい企業が...",
      "title": "CoinbaseのCEOであるブライアン・アームストロングがSECに対して（受動的に）暴言を吐いています。その全文をお届けします。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "1）最近美国证券交易委员会出现了一些非常粗略的行为。故事时间...\n\n2) 数以百万计的加密货币持有者在过去几年中一直在为他们的资产赚取收益。\n在过去的几年里，数以百万计的加密货币持有者一直在为他们的资产赚取收益。这是有道理的，如果你想把你的资金借出去，你可以获得\n回报。每个人似乎都很高兴。\n\n3) 一批伟大的公司...",
      "title": "Coinbase首席执行官布莱恩-阿姆斯特朗（Brian Armstrong）对美国证券交易委员会进行了（消极攻击性的）咆哮。以下是完整的文字记录!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "1）最近美國證券交易委員會出現了一些非常粗略的行爲。故事時間...\n\n2) 數以百萬計的加密貨幣持有者在過去幾年中一直在爲他們的資產賺取收益。\n在過去的幾年裏，數以百萬計的加密貨幣持有者一直在爲他們的資產賺取收益。這是有道理的，如果你想把你的資金借出去，你可以獲得\n回報。每個人似乎都很高興。\n\n3) 一批偉大的公司...",
      "title": "Coinbase首席執行官布萊恩-阿姆斯特朗（Brian Armstrong）對美國證券交易委員會進行了（消極攻擊性的）咆哮。以下是完整的文字記錄!"
    }
  ]
}