{
  "author": "King_Vercingetorix",
  "original_created_utc": 1647876154,
  "title": "Today, the Taliban has banned Nowruz from being publicly celebrated due to the festival being 'pagan'. Has religious/political backlash against the Persian festival always been present or is this a more recent development?",
  "created_utc": 1647901495,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;According to NPR,&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The holiday — dating back 3,500 years and celebrated by more than 300 million people across the Middle East, Central Asia and the Caucasus — has been designated as &lt;a href=\"https://ifpnews.com/taliban-lash-against-millennial-persian-new-year-ritual/\"&gt;&amp;quot;magus,&amp;quot;&lt;/a&gt; or pagan, and abolished, exactly as it was in 1996, when the Taliban last ruled Afghanistan.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;So, presumably after the conquest of Iran by Muslim forces around the 600s or so, Iranians (Muslim and non-Muslim) have continued to celebrate the festival for the next 1400 years or so. Did religious or political figures back then disapprove of this holiday and attempt to ban it or is the backlash against the holiday more of a recent late 20th century development (around the time groups like the Taliban developed and took over)? If the latter is true, then what has prompted this backlash when previous generations seemed to be content allowing for this festival to be celebrated?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 109,
  "permalink": "/r/AskHistorians/comments/tje9pl/today_the_taliban_has_banned_nowruz_from_being/",
  "subreddit": "AskHistorians",
  "id": "tje9pl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "According to NPR,\n\n> The holiday — dating back 3,500 years and celebrated by more than 300 million\n> people across the Middle East, Central Asia and the Caucasus — has been\n> designated as \"magus,\"\n> [https://ifpnews.com/taliban-lash-against-millennial-persian-new-year-ritual/]\n> or pagan, and…"
}