{
  "author": "Nostalg33k",
  "original_created_utc": 1637831615,
  "title": "Why coins such as Banano are very important for newcomers!",
  "created_utc": 1637904956,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello! </p>\n\n<p>I&#39;m going to tell you a little story. I first met cryptocurrencies through a post on the front page of Reddit a few months ago. It was a Banano giveaway and I got 1 Banano. </p>\n\n<p>Thanks to the Banano community I was able to learn about wallets, Dag technology, make test transactions and finally about this subreddit. </p>\n\n<p>Most members in the Banano community have a tip culture in which they tip people for fun contributions. They have fun events such as poetry contest, drawing contest and other cool stuff. </p>\n\n<p>But the most striking stuff is that, contrary to some places, they are proud of members selling and taking profits. They try to promote a wholesome culture and if you have friends trying to learn crypto but don&#39;t want to put forward capital, you can really send them there. </p>\n\n<p>They use the Folding@home as a way to distribute Banano and there are multiple faucets which provide more than decent payouts. </p>\n\n<p>I think, wholesome spaces in Crypto are very important and I&#39;m glad to have found them because thanks to them I am now part of this subreddit! </p>\n\n<p>Thanks to them I got 130$ in my portfolio (which I have since sold for BTC) and I have multiple NFTs with small value (between 2 and 30$) </p>\n\n<p>Do you have projects such as this one which are very beginners friendly and are distributed in a fun and wholesome manner? </p>\n\n<p>I think Moons are also a good way to get people in Crypto but this sub, due to its very large community, is more about serious info/discussions, than memes and having fun while learning.</p>\n</div><!-- SC_ON -->",
  "score": 169,
  "permalink": "/r/CryptoCurrency/comments/r1sld2/why_coins_such_as_banano_are_very_important_for/",
  "subreddit": "CryptoCurrency",
  "id": "r1sld2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hello!\n\nI'm going to tell you a little story. I first met cryptocurrencies through a\npost on the front page of Reddit a few months ago. It was a Banano giveaway and\nI got 1 Banano.\n\nThanks to the Banano community I was able to learn about wallets, Dag\ntechnology, make test transactions and finally…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは。\n\n今回はちょっとしたお話をさせていただきます。私が暗号通貨と出会ったのは、数ヶ月前にRedditのトップページに投稿された\n数ヶ月前にRedditのトップページに投稿された それはBananoのギブアップであり\n1Bananoを手に入れました。\n\nBananoコミュニティのおかげで、私はウォレットについて学び、Dag\n技術について学び、テスト取引を行い、そしてついに...",
      "title": "バナノなどのコインが新規参入者にとって非常に重要な理由とは！？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好！我是来自北京的张先生。\n\n我要给你讲一个小故事。我第一次认识加密货币是通过几个月前Reddit首页的一个\n几个月前在Reddit头版的一个帖子中认识的。那是一个Banano的赠品，而\n我得到了1个Banano。\n\n感谢Banano社区，我得以了解到钱包、Dag\n技术，进行测试交易，最后...",
      "title": "为什么像Banano这样的硬币对新人非常重要!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好！我是來自北京的張先生。\n\n我要給你講一個小故事。我第一次認識加密貨幣是通過幾個月前Reddit首頁的一個\n幾個月前在Reddit頭版的一個帖子中認識的。那是一個Banano的贈品，而\n我得到了1個Banano。\n\n感謝Banano社區，我得以瞭解到錢包、Dag\n技術，進行測試交易，最後...",
      "title": "爲什麼像Banano這樣的硬幣對新人非常重要!"
    }
  ]
}