{
  "author": "shlammyjohnson",
  "original_created_utc": 1630543307,
  "title": "Popular opinion: people invested in crypto are the smartest people on the planet, maybe the entire universe",
  "created_utc": 1630557043,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Anyone with even a <em>penny</em> invested in the shittiest shitcoin, give yourself a pat on the back.</p>\n\n<p>You are literally the smartest person in your entire cohort.</p>\n\n<p>Don&#39;t have friends? Guess what buddy, you don&#39;t need em&#39;. It&#39;s not like they would be able to have an intelligent conversation with you anyway, right?</p>\n\n<p>I&#39;d go as far to say if you DON&#39;T have anything invested in crypto, you&#39;re a certified troglodyte in my eyes. </p>\n\n<p>There&#39;s actual real life mole people digging in the dirt looking for disgusting &quot;precious metals&quot; assuming we can&#39;t just create more of them with our pure combined intelligence.</p>\n\n<p>Fiat lovers gtfo. I wipe my ass with fiat. I&#39;ve got rolls of hundreds of different kinds of currency and they all cause mad hemorrhoid&#39;s. (Canadian dollars make my ass smell like maple though so that&#39;s a plus).</p>\n\n<p>Don&#39;t let anyone tell you you&#39;re ever wrong, you literally win any argument by default you beautiful genius.</p>\n</div><!-- SC_ON -->",
  "score": 198,
  "permalink": "/r/CryptoCurrency/comments/pg6yud/popular_opinion_people_invested_in_crypto_are_the/",
  "subreddit": "CryptoCurrency",
  "id": "pg6yud",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Anyone with even a penny invested in the shittiest shitcoin, give yourself a pat\non the back.\n\nYou are literally the smartest person in your entire cohort.\n\nDon't have friends? Guess what buddy, you don't need em'. It's not like they\nwould be able to have an intelligent conversation with you anyway,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "糞みたいな糞コインに1円でも投資している人は自分を褒めてあげてください\n褒めてあげてください。\n\nあなたは文字通り、あなたの仲間の中で最も賢い人です。\n\n友達いないの？何だと思いますか、相棒、あなたは彼らを必要としません。彼らのようなものはありません。\n彼らはあなたと知的な会話をすることはできないでしょうし...。",
      "title": "一般的な意見：暗号に投資している人は、地球上で、もしかしたら全宇宙で最も賢い人たちである。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "任何在最糟糕的狗屎币上有一分钱投资的人，都要给自己拍拍手。\n拍拍你的背。\n\n你简直是你整个群体中最聪明的人。\n\n没有朋友吗？你猜怎么着，伙计，你不需要他们。这不像是他们\n反正他们也不可能和你进行有智慧的对话，...",
      "title": "流行观点：投资于加密货币的人是地球上最聪明的人，也许是整个宇宙的人"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "任何在最糟糕的狗屎幣上有一分錢投資的人，都要給自己拍拍手。\n拍拍你的背。\n\n你簡直是你整個羣體中最聰明的人。\n\n沒有朋友嗎？你猜怎麼着，夥計，你不需要他們。這不像是他們\n反正他們也不可能和你進行有智慧的對話，...",
      "title": "流行觀點：投資於加密貨幣的人是地球上最聰明的人，也許是整個宇宙的人"
    }
  ]
}