{
  "author": "jakekick1999",
  "original_created_utc": 1652115188,
  "title": "If you aren’t buying now, you will regret your choice",
  "created_utc": 1652125216,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Let me start off by saying that a lot of us are facing an acute shortage of fiat aka money to invest and are probably balls deep.&lt;/p&gt;\n\n&lt;p&gt;Lets just look at the bloodbath right now&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/ky9skqra7hy81.png?width=1616&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=feb5d44fd0a0903353c467b27d7a6a7bd51caa54\"&gt;The market right now&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;BTC - ATH is $68,789.63 and the current price is 33,279$. When we reachieve ATH, that will be over 100% increase. Which means you are doubling the money that you are putting in by buying now.&lt;/p&gt;\n\n&lt;p&gt;Similarly with ETH. ATH is $4,891.70 and the current price is 2,413$. Again when we reach ATH, you are looking at a 2x of what you have invested.&lt;/p&gt;\n\n&lt;p&gt;But those of you who have money but haven&amp;#39;t bought BTC at this price, in the hopes that&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;The price will go even lower. That is Greed. You aren’t even taking this opportunity now to get a 2x, then trust me, every time it goes lower, you will wait for a new low. And when prices rebound, you will still wait for the “crash” only to finally fomo near the top.&lt;/li&gt;\n&lt;li&gt;The market is too volatile, I might lose my money. Well, this is crypto. You should invest what you can afford to remove maybe a year or two later. Don’t imagine Bitcoin to make you a millionaire overnight. But if you invest too much, it can make you broke in no time as well.&lt;/li&gt;\n&lt;li&gt;The potential of BTC is over. I need to find the next 1000x ultra micro cap coin. Well if you are colorblind, the market is red now. Good luck finding an alt coin that statistically might not survive the bear market.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;TLDR - Agreed that crypto is volatile as hell. But within this space, the most safest and blue chip investment are at prices which will net you double the returns.  What is stopping you from investing at least a portion of your investment money now ?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 315,
  "permalink": "/r/CryptoCurrency/comments/ulvokw/if_you_arent_buying_now_you_will_regret_your/",
  "subreddit": "CryptoCurrency",
  "id": "ulvokw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Let me start off by saying that a lot of us are facing an acute shortage of fiat\naka money to invest and are probably balls deep.\n\nLets just look at the bloodbath right now\n\nThe market right…"
}