{
  "author": "Naive_Mix9089",
  "original_created_utc": 1627655079,
  "title": "Why do people suggest killing sex offenders/pedophiles instead of offering Real solutions on how they should be handled once they get out?",
  "created_utc": 1627689244,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A lot of people always say sex offenders should be executed or spend life in prison but let’s be real here that’s not gonna happen. A lot of sex offenders and pedophiles are not going to spend life in prison and are not going to be executed. So instead of people repeating the same Old narrative over and over again why don’t people think of realistic solutions to how sex offender/pedophiles should be handled once they get out. </p>\n\n<p>For example, the government can build a community specifically for them since it is so many restrictions on where they can live. It Has to be one of the other because you don’t want sex offenders/pedophiles living in you community (understandable), but it in the same breath you are against the government building housing for them because they use taxpayer money. You don’t want to pedophiles using your taxpayer dollars  to live off of and be monitored but you don’t want them working in public areas either.</p>\n\n<p>Again it has be one of the other. Either the government uses  taxpayer money for them or they should integrate back into society like normal people to support themselves.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/oullll/why_do_people_suggest_killing_sex/",
  "subreddit": "TooAfraidToAsk",
  "id": "oullll",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "A lot of people always say sex offenders should be executed or spend life in\nprison but let’s be real here that’s not gonna happen. A lot of sex offenders\nand pedophiles are not going to spend life in prison and are not going to be\nexecuted. So instead of people repeating the same Old narrative over…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "性犯罪者は死刑か終身刑にすべきだと多くの人が言いますが、現実にはそうはなりません。\nしかし、現実的にはそれはあり得ません。多くの性犯罪者や小児性愛者は\n性犯罪者や小児性愛者の多くは終身刑になることはなく、死刑になることもありません。\n死刑にはなりません。だから、人々が同じ古い物語を繰り返すのではなく、...",
      "title": "なぜ人々は、性犯罪者や小児性愛者を殺すことを提案するのではなく、彼らが出所した後にどのように対処すべきかという現実的な解決策を提示するのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "很多人总是说性犯罪者应该被处死或在监狱中度过一生。\n但让我们现实一点，这是不可能发生的。很多性犯罪者\n和恋童癖者不会在监狱中度过一生，也不会被处决。\n被处决。因此，与其让人们重复同样的老调重弹，还不如让他们自己来做。",
      "title": "为什么人们建议杀死性犯罪者/恋童癖者，而不是就他们出狱后应如何处理提供真正的解决方案？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "很多人總是說性犯罪者應該被處死或在監獄中度過一生。\n但讓我們現實一點，這是不可能發生的。很多性犯罪者\n和戀童癖者不會在監獄中度過一生，也不會被處決。\n被處決。因此，與其讓人們重複同樣的老調重彈，還不如讓他們自己來做。",
      "title": "爲什麼人們建議殺死性犯罪者/戀童癖者，而不是就他們出獄後應如何處理提供真正的解決方案？"
    }
  ]
}