{
  "author": "AskScienceModerator",
  "original_created_utc": 1630494054,
  "title": "AskScience AMA Series: I'm a particle physicist at CERN working with the Large Hadron Collider. My new book is about the origins of the universe. AMA!",
  "created_utc": 1630505898,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m Harry Cliff - I&#39;m a particle physicist at Cambridge University and work on the LHCb Experiment at CERN&#39;s Large Hadron Collider, where I search for signs of new particles and forces that could help answer some of the biggest questions in physics. My first book <a href=\"https://www.penguinrandomhouse.com/books/612737/how-to-make-an-apple-pie-from-scratch-by-harry-cliff/\">HOW TO MAKE AN APPLE PIE FROM SCRATCH</a> has just been published - it&#39;s about the search for the origins of matter and the basic building blocks of our universe. I&#39;m on at 9:30 UT / 10:30 UK / 17:30 ET, AMA!</p>\n\n<p>Username: <a href=\"/u/Harry_V_Cliff\">/u/Harry_V_Cliff</a></p>\n</div><!-- SC_ON -->",
  "score": 116,
  "permalink": "/r/askscience/comments/pfrjtl/askscience_ama_series_im_a_particle_physicist_at/",
  "subreddit": "askscience",
  "id": "pfrjtl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm Harry Cliff - I'm a particle physicist at Cambridge University and work on\nthe LHCb Experiment at CERN's Large Hadron Collider, where I search for signs of\nnew particles and forces that could help answer some of the biggest questions in\nphysics. My first book HOW TO MAKE AN APPLE PIE FROM…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ハリー・クリフです。私はケンブリッジ大学の素粒子物理学者で、CERNの大型ハドロン衝突型加速器である\nCERNの大型ハドロン衝突型加速器のLHCb実験に従事していますが、ここでは、人類の最大の疑問に答えることができる新しい粒子や力の兆候を探しています。\n物理学の最大の疑問に答えてくれる可能性のある新しい粒子や力の兆候を探しています。\n物理学の最大の疑問に答えることができる新しい粒子や力の兆候を探しています。私の最初の著書『HOW TO MAKE AN APPLE PIE FROM...",
      "title": "AskScience AMAシリーズ。私はCERNの素粒子物理学者で、大型ハドロン衝突型加速器の研究をしています。私の新しい本は、宇宙の起源についてです。AMA!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是哈利-克里夫--我是剑桥大学的一名粒子物理学家，在欧洲核子研究中心大型强子对撞机的LHCb实验中工作。\n我在欧洲核子研究中心的大型强子对撞机上进行LHCb实验，在那里我寻找新粒子的迹象。\n我在那里寻找新粒子和新力量的迹象，这可能有助于回答物理学中的一些最大问题。\n物理学的一些最大问题。我的第一本书《如何用苹果做派》（HOW TO MAKE AN APPLE PIE FROM...",
      "title": "AskScience AMA系列。我是欧洲核子研究中心的一名粒子物理学家，在大型强子对撞机工作。我的新书是关于宇宙的起源。AMA!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是哈利-克里夫--我是劍橋大學的一名粒子物理學家，在歐洲核子研究中心大型強子對撞機的LHCb實驗中工作。\n我在歐洲核子研究中心的大型強子對撞機上進行LHCb實驗，在那裏我尋找新粒子的跡象。\n我在那裏尋找新粒子和新力量的跡象，這可能有助於回答物理學中的一些最大問題。\n物理學的一些最大問題。我的第一本書《如何用蘋果做派》（HOW TO MAKE AN APPLE PIE FROM...",
      "title": "AskScience AMA系列。我是歐洲核子研究中心的一名粒子物理學家，在大型強子對撞機工作。我的新書是關於宇宙的起源。AMA!"
    }
  ]
}