{
  "author": "bmc10p",
  "the_new_excerpt": "As the title says, what is the disadvantage, if any, in using a fund like\nvanguards NJ Long-term tax-exempt fund (VNJTX) (I happen to live in NJ) or the\nlike? Historical returns are about the same as a normal bond fund, but are tax\nexempt both at federal and state level. Seems like an obvious winner…",
  "original_created_utc": 1621696063,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルにあるように、以下のようなファンドを使用することにデメリットがあるとすれば、それは何でしょうか？\nvanguards NJ Long-term tax-exempt fund (VNJTX) (私はたまたまNJに住んでいます)のようなファンドを使うデメリットがあれば教えてください。\nのようなファンドを使うデメリットはありますか？ヒストリカルリターンは通常の債券ファンドとほぼ同じですが、税金が免除されます。\n連邦と州の両方のレベルで非課税です。明らかな勝者のように思えるが...。",
      "title": "バンガードNJ長期非課税ファンド(VNJTX)のようなファンドを利用することで、デメリットがあれば教えてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "正如标题所说，如果有的话，使用像以下的基金有什么缺点\nvanguards新泽西州长期免税基金(VNJTX)(我正好住在新泽西州)或类似的基金？\n之类的基金？历史回报与普通债券基金差不多，但在联邦和州一级都是免税的。\n但在联邦和州一级都是免税的。似乎是一个明显的赢家...",
      "title": "如果有的话，使用先锋新泽西州长期免税基金（VNJTX）这样的基金有什么缺点？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "正如標題所說，如果有的話，使用像以下的基金有什麼缺點\nvanguards新澤西州長期免稅基金(VNJTX)(我正好住在新澤西州)或類似的基金？\n之類的基金？歷史回報與普通債券基金差不多，但在聯邦和州一級都是免稅的。\n但在聯邦和州一級都是免稅的。似乎是一個明顯的贏家...",
      "title": "如果有的話，使用先鋒新澤西州長期免稅基金（VNJTX）這樣的基金有什麼缺點？"
    }
  ],
  "title": "What’s the disadvantage, if any, in using a fund like vanguards NJ Long-term tax-exempt fund (VNJTX)",
  "created_utc": 1621704978,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As the title says, what is the disadvantage, if any, in using a fund like vanguards NJ Long-term tax-exempt fund (VNJTX) (I happen to live in NJ) or the like? \nHistorical returns are about the same as a normal bond fund, but are tax exempt both at federal and state level.\nSeems like an obvious winner for cash like holdings over normal bonds, but I rarely see it talked about.\nAm I missing something that makes a fund like this no a no go?</p>\n</div><!-- SC_ON -->",
  "score": 535,
  "permalink": "/r/investing/comments/nikmbr/whats_the_disadvantage_if_any_in_using_a_fund/",
  "subreddit": "investing",
  "id": "nikmbr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197388313
}