{
  "author": "One_2_Three",
  "the_new_excerpt": "I live in a mining town. There are 2 companies here mining nickel and copper.\nOur beautiful forest landscape was decimated, people have died, union wars have\ncrippled our local economy. The acid rain was literally eating the paint off of\ncars. NASA even sent astronauts to our town because is looked…",
  "original_created_utc": 1621778917,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は鉱山の町に住んでいます。ここにはニッケルと銅を採掘する2つの会社があります。\n私たちの美しい森の風景は破壊され、人々は死に、組合の戦争は地元の経済を破壊しました。\n労組の抗争で地域経済は疲弊しました。酸性雨は文字通り車の塗装を剥がしてしまいました。\n酸性雨が車の塗装を剥がしていました。NASAは宇宙飛行士をこの町に送ったこともありますが、それはこの町が...",
      "title": "このビットコインの環境への影響は全てBSです。マイニングタウンに住んでいれば、そう思うでしょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我住在一个采矿镇。这里有两家公司在开采镍和铜。\n我们美丽的森林景观被砍伐，人们死亡，工会战争使我们的地方经济瘫痪。\n削弱了我们的地方经济。酸雨实际上是在侵蚀汽车的油漆。\n汽车的油漆。美国宇航局甚至把宇航员送到我们的小镇，因为它看起来...",
      "title": "这整个比特币的环境影响是BS。如果你住在一个矿区，你会同意。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我住在一個採礦鎮。這裏有兩家公司在開採鎳和銅。\n我們美麗的森林景觀被砍伐，人們死亡，工會戰爭使我們的地方經濟癱瘓。\n削弱了我們的地方經濟。酸雨實際上是在侵蝕汽車的油漆。\n汽車的油漆。美國宇航局甚至把宇航員送到我們的小鎮，因爲它看起來...",
      "title": "這整個比特幣的環境影響是BS。如果你住在一個礦區，你會同意。"
    }
  ],
  "title": "This entire Bitcoin environmental impact is BS. If you live in a mining town you would agree.",
  "created_utc": 1621845034,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I live in a mining town.  There are 2 companies here mining nickel and copper.  Our beautiful forest landscape was decimated, people have died, union wars have crippled our local economy.  The acid rain was literally eating the paint off of cars.  NASA even sent astronauts to our town because is looked like the moon.  Said astronaut even made a statement while on the moon that the rock there resemble our the breccia found in our town.</p>\n\n<p>Just do simple searches on mining deaths.  How about dam bursts sending toxins into the country side...  Or just read about all the diamond mines in South Africa.  Read about the controversial mining method called ‘retreat mining’ or fracking.  Have you ever been in a mine?  I have plenty, it sucks.</p>\n\n<p>I don’t know about you, but we’ve been producing electricity for 120+ years.  Sure, we need coal plants, nuclear plants, build dams, wind mills, solar panels, etc.  Did they have the same continuous destruction of the environment and population as mining did and continues to do?</p>\n\n<p>Producing electricity is getting greener by the minute.  Coal is dead, the major black mark in electricity production.  Solar is becoming the king very quickly.  There some incredible creative ways people are generation electricity today.</p>\n\n<p>From my point of view I don’t see where Bitcoin is not good for the environment.  Yes there are some  extremely irresponsible BTC mining operations out there, but entire landscapes are not being destroyed, people have not died.</p>\n\n<p>However, those GPU miners can just fuck off.</p>\n</div><!-- SC_ON -->",
  "score": 155,
  "permalink": "/r/Bitcoin/comments/nj8he9/this_entire_bitcoin_environmental_impact_is_bs_if/",
  "subreddit": "Bitcoin",
  "id": "nj8he9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197380034
}