{
  "approved_at_utc": null,
  "subreddit": "Bogleheads",
  "selftext": "# Winning the Loser&amp;#39;s Game by Charles Ellis\n\n- Investment managers are not beating the market, the market is beating them\n  - Over 1 year, 70% of professionals underperform their benchmarks\n  - Over 10 years, 80%\n  - Over 15 years, 90%\n- Yes, some professional money managers will beat the market in any given year. But most will not over the long term and there is no reliable way to figure out who would be in that 10% that outperforms ahead of time\n  - Individuals investing on their own do even worse and individuals who day trade do the worst of all on average\n- In the 1960&amp;#39;s, when active investing was a winner&amp;#39;s game, individuals did 90% of the trading and institutions did 10%.\n  - Professionals could beat the amateurs easily.\n- Professional money managers now do 95% of the trading on wall street now.\n  - They are so good as a group that they make it nearly impossible for any one of them to outperform the market. They don&amp;#39;t make enough errors for their peers to exploit.\n- Although figuring out the optimal investment policy can be difficult, the hardest part of investing is staying committed to a sound investment policy\n  - Being rational in an emotional environment is not easy\n    - Develop your plan and stick with it\n- Active investing is, at the margin, always a negative sum game\n- Just because a manger had success in the past, does not mean he will have success in the future\n- To be a long-term winner, set realistic goals and develop sensible investment polies that will achieve those objectives and then have the discipline and fortitude require to implement those policy&amp;#39;s\n- The only way active investment managers can beat the market, after adjusting for market risk, is to discover and exploit other active investors mistakes and overcome the high costs of fees\n- Active investors have 3 ways of doing this\n  - Timing\n  - Selecting specific stocks or groups of stocks\n  - Making timely changes in overall portfolio structure or strategy\n    - Market timing is a truly wicked idea, don&amp;#39;t try it\n    - The only way to beat the market is to beat the professionals who, as a group, are the market. The problem isn&amp;#39;t the research isn&amp;#39;t done well. It is that the research is done well by so many\n- Although the market isn&amp;#39;t perfectly efficient, its not longer worth the real costs of trying to beat it. If you can&amp;#39;t beat them, join them and buy index funds.\n  - Stock markets are different than they were 60 years ago (1960&amp;#39;s)\n  - Indexing outperforms active investing\n  - Index investing is low cost\n- The daily weather is comparably different than the climate. Weather is about the short run. Climate is about the long run. This applies to finance too. Ignore the short term and focus on the long term.\n- Gravity is a powerful force. A powerful force in finance is regression to the mean. This is the tendency of a series of events to become more normal or average over time\n  - As Example – Very hot or very cold days tend to be followed by less hot or cold days\n  - The same &amp;quot;back toward normal&amp;quot; occurs with P/E multiples\n    - Stocks with very high or low P/E ratios tend to move back toward normal. Causing a double whammy!\n  - The power of regression to the mean is valuable. Don&amp;#39;t get caught up in the hype either positive or negative as an investor.\n- Investing is not supposed to be fun or exciting\n  - Stick to your plan as an investor and ignore the noise is the secret to long term success\n- Indexing has lower fees, lower taxes and lower operating expenses\n  - Using an index fund allows the investors to keep pace with the market virtually without effort\n- Warren Buffett recommends most investors consider indexing\n- Indexing advantage\n  - Less Taxes\n  - Less Fees\n  - Less Costs\n  - More peace of mind\n- Study after study shows index investing works\n- Index investing &amp;quot;unfair&amp;quot; advantages\n  - Higher rates of return\n  - Lower management fees and expenses\n  - Lower taxes\n  - Lower transaction costs\n  - Lower portfolio turnover\n  - Convenience\n- The case for indexing increases as the period lengthens\n- To minimize risk relative to return or to maximize return relative to risk, investors should consider at least diversifying internationally.\n  - 50/50 US/Foreign is a good starting point\n- Investors who decide to concentrate their investments in their home country are making an implicit decision to emphasize that one country over others. Curiously, most investors do just that. British investors favor UK, Canadian investors favor Canada, Japanese investors favor Japan, American investors prefer USA.\n- The more turnover in a portfolio, the more taxes and the lower accumulated returns\n- Investors essential truth &amp;quot;We have met the enemy and he is us.&amp;quot;\n- Behavioral Economics\n  - We fail to appreciate the power of regression to the mean\n  - We ignore the normal pattern of experience\n  - We believe in &amp;quot;hot hands&amp;quot;\n  - We overreact to first impressions and then anchor to those views\n  - We suffer from illusion of control\n  - We rely on expert opinions and are overconfident in those opinions\n  - We overestimate out own skill and knowledge\n  - We respond to the &amp;quot;halo effect&amp;quot; of a recommendation of someone we admire, like a celebrity or athlete\n  - We are overly impressed by short term results\n  - We are &amp;quot;confirmation biased&amp;quot; looking for and then overweighting the data that supports our conclusion\n  - We anchor too much to our initial opinion\n  - We confuse familiarity with knowledge and understanding\n  - We overreact to both good and bad news\n  - We think we know more relative to what others know than we really do\n- Investors risks to avoid\n  - Trying too hard and taking too much risk\n  - Not trying hard enough, usually by having too much cash or money market accounts\n  - Being Impatient\n  - Changing mutual funds too much (holding less than 10 years)\n  - Borrowing too much\n    - 3 out of 4 fortunes that are lost got lost because borrowed money was used\n  - Being naively optimistic\n  - Being proud\n    - We overestimate our own ability\n  - Being emotional\n    - We are happy when our stocks go up and sad when they go down. And the feelings are stronger the faster the change in prices\n- Given enough time, investments that might otherwise seem unattractive become highly desirable, and vice versa.\n- The longer the time period over which an investment is held, the closer the actual returns in a portfolio will come to the expected average\n- If a time period is abundantly long, a wise investor can commit without great anxiety to investments that in the short run would appear too risky\n- The single most important dimension of your investment policy is the asset mix. Specifically, your equity and fixed income. Analysis shows repeatedly that the tradeoff between risk and reward is driven by one key factor: time.\n- If the market has been going up, investors, who curiously usually evaluate future prospects by looking into rearview mirror, will assume some further upward momentum.\n- And if the market has been going down, investors will assume further downward momentum.\n  - The wise investor will adjust for this notorious human tendency\n- History of return on investments show 3 key points\n  - Common stocks have average returns that are higher than bonds. Bonds have higher returns than short term money market instruments\n  - The fluctuations of actual returns on common stocks exceed the fluctuations on bonds, which in turn exceed the fluctuations on short term instruments\n  - The magnitude of fluctuations in rate of return increases as the measurement period is shortened and decreases as it is lengthened.\n- This means rates of return appear more normal over longer periods of time\n- Develop an investment policy for yourself and then follow it\n- Too often investment policy is too vague and is left to be resolved in haste when distressing market conditions are present. This is when it is too easy to make the wrong decision at the wrong time for the wrong reasons.\n- The best shield against the disruption of the markets short term provocations is understanding and knowledge.\n- Put your investment policy in writing so you will follow it when times are bad\n- When the market drops, we stop buying and, in fact, usually start selling. And when the market rises, we buy more and more enthusiastically.\n- We are wrong when we feel good about stocks having gone up and we are wrong when we feel bad about stocks having gone down\n- A knowledge of yourself and history prevents panic during these times\n- Every investor can be a winner\n  - Ignore the &amp;quot;beat the market&amp;quot; hype\n- Each investor must decide what are investment policies that they can and will stay with through thick and thin over the long term\n- If your investment policy is not determined through carefully developed understanding, it will be determined by improvisation\n- The markets specialty of short-term focus is the mortal enemy of long-term investment success\n- Over very long periods, the average return obtained by most actively managed mutual funds must be expected to be close to the market average minus 1.5% for various costs\n- The average mutual fund investor actually gets a return that is significantly below the average return that they invest in\n- Why? Frequent trading in and out of funds and chasing performance instead of staying the course\n- Index investing advantages\n  - Anyone trying to beat the market faces an increasingly formidable challenge\n  - Operating costs are far lower than active investments\n  - Taxes are lower due to decreased turnover\n  - Fees are much lower\n  - Easier to stay on plan\n  - More time for other activities\n- Investment professionals daily trading volume by decade\n  - 10% in the 1960&amp;#39;s to over 90% currently.\n- This is why it is so difficult for active managers to beat the market\n- Understanding the outlook for the near term is easy as J.P Morgan said, &amp;quot;It will fluctuate.&amp;quot;\n- One way to be realistic about future returns is to assume that future range of P/E multiples and corporate profits will be within their historical upper and lower limits and will appear with frequency at values close to the long-term average\n- Investors almost always project recent past market and economic behavior out into the future, somehow expecting more of the same to continue\n  - Math example – If dividends are at 1.5% and corporate earnings are growing at 4.5% (Historical Average), then a composite of 6% return is reasonable. This is the fundamental rate of return the investor can expect from the market\n  - Then you add or subtract the changes in P/E over that time frame. The average P/E in recent decades has been about 15.5. This is the speculative return component\n- Predicting the market roughly is not hard, but predicting it accurately is impossible\n  - Predicting where the market will be in the long run is not hard, but even estimating how it will move in the next few months is impossible and pointless\n- Investing must always begin with savings. No savings means no investing\n- Having a defensive saving reserve is a must. Just like a fire extinguisher\n- 10 Commandments for individual investors\n  - Save\n  - If you must &amp;quot;play&amp;quot; in the market, do it will a small portion of your money\n  - Don&amp;#39;t do anything in investing primarily for tax reasons\n  - Don&amp;#39;t think of your home as an investment\n  - Don&amp;#39;t do commodities\n  - Don&amp;#39;t get confused by stockbrokers and salespeople\n  - Don&amp;#39;t invest in novel or unusual kinds of investments\n  - Don&amp;#39;t invest in bonds just because you heard they are safe. Bond prices fluctuate and are a very poor defense against the major risk of long-term investing: inflation.\n  - Write out your long-term goals and have an investment plan in place\n  - Distrust your feelings\n- Your responsibility is to decide on your long-term investment objective and determine a reasoned and realistic set of investment policies that can achieve your objectives\n- The individual investor does not have to beat the market to be successful\n- Warren Buffett &amp;quot;Investing is simple, but it&amp;#39;s not easy.&amp;quot;\n- The real challenge is to commit to the discipline of long-term investing and avoid reacting to the short-term distractions\n- Winning the loser&amp;#39;s game of beating the market is easy: DO NOT TRY IT!!\n- Index your investments\n- The real purpose of investment management is not to beat the market; it is to do what is right for each particular investor who accepts the responsibility of defining their true and realistic investment objectives, developing sensible long-term policies, and staying with them.",
  "author_fullname": "t2_6ucr2",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Winning the Loser's Game by Charles Ellis Book Summary",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/Bogleheads",
  "hidden": false,
  "pwls": 7,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_savnly",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.92,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 17,
  "total_awards_received": 1,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 17,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1642950561,
  "link_flair_type": "text",
  "wls": 7,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.Bogleheads",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;h1&gt;Winning the Loser&amp;#39;s Game by Charles Ellis&lt;/h1&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Investment managers are not beating the market, the market is beating them\n\n&lt;ul&gt;\n&lt;li&gt;Over 1 year, 70% of professionals underperform their benchmarks&lt;/li&gt;\n&lt;li&gt;Over 10 years, 80%&lt;/li&gt;\n&lt;li&gt;Over 15 years, 90%&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Yes, some professional money managers will beat the market in any given year. But most will not over the long term and there is no reliable way to figure out who would be in that 10% that outperforms ahead of time\n\n&lt;ul&gt;\n&lt;li&gt;Individuals investing on their own do even worse and individuals who day trade do the worst of all on average&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;In the 1960&amp;#39;s, when active investing was a winner&amp;#39;s game, individuals did 90% of the trading and institutions did 10%.\n\n&lt;ul&gt;\n&lt;li&gt;Professionals could beat the amateurs easily.&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Professional money managers now do 95% of the trading on wall street now.\n\n&lt;ul&gt;\n&lt;li&gt;They are so good as a group that they make it nearly impossible for any one of them to outperform the market. They don&amp;#39;t make enough errors for their peers to exploit.&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Although figuring out the optimal investment policy can be difficult, the hardest part of investing is staying committed to a sound investment policy\n\n&lt;ul&gt;\n&lt;li&gt;Being rational in an emotional environment is not easy&lt;/li&gt;\n&lt;li&gt;Develop your plan and stick with it&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Active investing is, at the margin, always a negative sum game&lt;/li&gt;\n&lt;li&gt;Just because a manger had success in the past, does not mean he will have success in the future&lt;/li&gt;\n&lt;li&gt;To be a long-term winner, set realistic goals and develop sensible investment polies that will achieve those objectives and then have the discipline and fortitude require to implement those policy&amp;#39;s&lt;/li&gt;\n&lt;li&gt;The only way active investment managers can beat the market, after adjusting for market risk, is to discover and exploit other active investors mistakes and overcome the high costs of fees&lt;/li&gt;\n&lt;li&gt;Active investors have 3 ways of doing this\n\n&lt;ul&gt;\n&lt;li&gt;Timing&lt;/li&gt;\n&lt;li&gt;Selecting specific stocks or groups of stocks&lt;/li&gt;\n&lt;li&gt;Making timely changes in overall portfolio structure or strategy&lt;/li&gt;\n&lt;li&gt;Market timing is a truly wicked idea, don&amp;#39;t try it&lt;/li&gt;\n&lt;li&gt;The only way to beat the market is to beat the professionals who, as a group, are the market. The problem isn&amp;#39;t the research isn&amp;#39;t done well. It is that the research is done well by so many&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Although the market isn&amp;#39;t perfectly efficient, its not longer worth the real costs of trying to beat it. If you can&amp;#39;t beat them, join them and buy index funds.\n\n&lt;ul&gt;\n&lt;li&gt;Stock markets are different than they were 60 years ago (1960&amp;#39;s)&lt;/li&gt;\n&lt;li&gt;Indexing outperforms active investing&lt;/li&gt;\n&lt;li&gt;Index investing is low cost&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;The daily weather is comparably different than the climate. Weather is about the short run. Climate is about the long run. This applies to finance too. Ignore the short term and focus on the long term.&lt;/li&gt;\n&lt;li&gt;Gravity is a powerful force. A powerful force in finance is regression to the mean. This is the tendency of a series of events to become more normal or average over time\n\n&lt;ul&gt;\n&lt;li&gt;As Example – Very hot or very cold days tend to be followed by less hot or cold days&lt;/li&gt;\n&lt;li&gt;The same &amp;quot;back toward normal&amp;quot; occurs with P/E multiples&lt;/li&gt;\n&lt;li&gt;Stocks with very high or low P/E ratios tend to move back toward normal. Causing a double whammy!&lt;/li&gt;\n&lt;li&gt;The power of regression to the mean is valuable. Don&amp;#39;t get caught up in the hype either positive or negative as an investor.&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Investing is not supposed to be fun or exciting\n\n&lt;ul&gt;\n&lt;li&gt;Stick to your plan as an investor and ignore the noise is the secret to long term success&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Indexing has lower fees, lower taxes and lower operating expenses\n\n&lt;ul&gt;\n&lt;li&gt;Using an index fund allows the investors to keep pace with the market virtually without effort&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Warren Buffett recommends most investors consider indexing&lt;/li&gt;\n&lt;li&gt;Indexing advantage\n\n&lt;ul&gt;\n&lt;li&gt;Less Taxes&lt;/li&gt;\n&lt;li&gt;Less Fees&lt;/li&gt;\n&lt;li&gt;Less Costs&lt;/li&gt;\n&lt;li&gt;More peace of mind&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Study after study shows index investing works&lt;/li&gt;\n&lt;li&gt;Index investing &amp;quot;unfair&amp;quot; advantages\n\n&lt;ul&gt;\n&lt;li&gt;Higher rates of return&lt;/li&gt;\n&lt;li&gt;Lower management fees and expenses&lt;/li&gt;\n&lt;li&gt;Lower taxes&lt;/li&gt;\n&lt;li&gt;Lower transaction costs&lt;/li&gt;\n&lt;li&gt;Lower portfolio turnover&lt;/li&gt;\n&lt;li&gt;Convenience&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;The case for indexing increases as the period lengthens&lt;/li&gt;\n&lt;li&gt;To minimize risk relative to return or to maximize return relative to risk, investors should consider at least diversifying internationally.\n\n&lt;ul&gt;\n&lt;li&gt;50/50 US/Foreign is a good starting point&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Investors who decide to concentrate their investments in their home country are making an implicit decision to emphasize that one country over others. Curiously, most investors do just that. British investors favor UK, Canadian investors favor Canada, Japanese investors favor Japan, American investors prefer USA.&lt;/li&gt;\n&lt;li&gt;The more turnover in a portfolio, the more taxes and the lower accumulated returns&lt;/li&gt;\n&lt;li&gt;Investors essential truth &amp;quot;We have met the enemy and he is us.&amp;quot;&lt;/li&gt;\n&lt;li&gt;Behavioral Economics\n\n&lt;ul&gt;\n&lt;li&gt;We fail to appreciate the power of regression to the mean&lt;/li&gt;\n&lt;li&gt;We ignore the normal pattern of experience&lt;/li&gt;\n&lt;li&gt;We believe in &amp;quot;hot hands&amp;quot;&lt;/li&gt;\n&lt;li&gt;We overreact to first impressions and then anchor to those views&lt;/li&gt;\n&lt;li&gt;We suffer from illusion of control&lt;/li&gt;\n&lt;li&gt;We rely on expert opinions and are overconfident in those opinions&lt;/li&gt;\n&lt;li&gt;We overestimate out own skill and knowledge&lt;/li&gt;\n&lt;li&gt;We respond to the &amp;quot;halo effect&amp;quot; of a recommendation of someone we admire, like a celebrity or athlete&lt;/li&gt;\n&lt;li&gt;We are overly impressed by short term results&lt;/li&gt;\n&lt;li&gt;We are &amp;quot;confirmation biased&amp;quot; looking for and then overweighting the data that supports our conclusion&lt;/li&gt;\n&lt;li&gt;We anchor too much to our initial opinion&lt;/li&gt;\n&lt;li&gt;We confuse familiarity with knowledge and understanding&lt;/li&gt;\n&lt;li&gt;We overreact to both good and bad news&lt;/li&gt;\n&lt;li&gt;We think we know more relative to what others know than we really do&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Investors risks to avoid\n\n&lt;ul&gt;\n&lt;li&gt;Trying too hard and taking too much risk&lt;/li&gt;\n&lt;li&gt;Not trying hard enough, usually by having too much cash or money market accounts&lt;/li&gt;\n&lt;li&gt;Being Impatient&lt;/li&gt;\n&lt;li&gt;Changing mutual funds too much (holding less than 10 years)&lt;/li&gt;\n&lt;li&gt;Borrowing too much&lt;/li&gt;\n&lt;li&gt;3 out of 4 fortunes that are lost got lost because borrowed money was used&lt;/li&gt;\n&lt;li&gt;Being naively optimistic&lt;/li&gt;\n&lt;li&gt;Being proud&lt;/li&gt;\n&lt;li&gt;We overestimate our own ability&lt;/li&gt;\n&lt;li&gt;Being emotional&lt;/li&gt;\n&lt;li&gt;We are happy when our stocks go up and sad when they go down. And the feelings are stronger the faster the change in prices&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Given enough time, investments that might otherwise seem unattractive become highly desirable, and vice versa.&lt;/li&gt;\n&lt;li&gt;The longer the time period over which an investment is held, the closer the actual returns in a portfolio will come to the expected average&lt;/li&gt;\n&lt;li&gt;If a time period is abundantly long, a wise investor can commit without great anxiety to investments that in the short run would appear too risky&lt;/li&gt;\n&lt;li&gt;The single most important dimension of your investment policy is the asset mix. Specifically, your equity and fixed income. Analysis shows repeatedly that the tradeoff between risk and reward is driven by one key factor: time.&lt;/li&gt;\n&lt;li&gt;If the market has been going up, investors, who curiously usually evaluate future prospects by looking into rearview mirror, will assume some further upward momentum.&lt;/li&gt;\n&lt;li&gt;And if the market has been going down, investors will assume further downward momentum.\n\n&lt;ul&gt;\n&lt;li&gt;The wise investor will adjust for this notorious human tendency&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;History of return on investments show 3 key points\n\n&lt;ul&gt;\n&lt;li&gt;Common stocks have average returns that are higher than bonds. Bonds have higher returns than short term money market instruments&lt;/li&gt;\n&lt;li&gt;The fluctuations of actual returns on common stocks exceed the fluctuations on bonds, which in turn exceed the fluctuations on short term instruments&lt;/li&gt;\n&lt;li&gt;The magnitude of fluctuations in rate of return increases as the measurement period is shortened and decreases as it is lengthened.&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;This means rates of return appear more normal over longer periods of time&lt;/li&gt;\n&lt;li&gt;Develop an investment policy for yourself and then follow it&lt;/li&gt;\n&lt;li&gt;Too often investment policy is too vague and is left to be resolved in haste when distressing market conditions are present. This is when it is too easy to make the wrong decision at the wrong time for the wrong reasons.&lt;/li&gt;\n&lt;li&gt;The best shield against the disruption of the markets short term provocations is understanding and knowledge.&lt;/li&gt;\n&lt;li&gt;Put your investment policy in writing so you will follow it when times are bad&lt;/li&gt;\n&lt;li&gt;When the market drops, we stop buying and, in fact, usually start selling. And when the market rises, we buy more and more enthusiastically.&lt;/li&gt;\n&lt;li&gt;We are wrong when we feel good about stocks having gone up and we are wrong when we feel bad about stocks having gone down&lt;/li&gt;\n&lt;li&gt;A knowledge of yourself and history prevents panic during these times&lt;/li&gt;\n&lt;li&gt;Every investor can be a winner\n\n&lt;ul&gt;\n&lt;li&gt;Ignore the &amp;quot;beat the market&amp;quot; hype&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Each investor must decide what are investment policies that they can and will stay with through thick and thin over the long term&lt;/li&gt;\n&lt;li&gt;If your investment policy is not determined through carefully developed understanding, it will be determined by improvisation&lt;/li&gt;\n&lt;li&gt;The markets specialty of short-term focus is the mortal enemy of long-term investment success&lt;/li&gt;\n&lt;li&gt;Over very long periods, the average return obtained by most actively managed mutual funds must be expected to be close to the market average minus 1.5% for various costs&lt;/li&gt;\n&lt;li&gt;The average mutual fund investor actually gets a return that is significantly below the average return that they invest in&lt;/li&gt;\n&lt;li&gt;Why? Frequent trading in and out of funds and chasing performance instead of staying the course&lt;/li&gt;\n&lt;li&gt;Index investing advantages\n\n&lt;ul&gt;\n&lt;li&gt;Anyone trying to beat the market faces an increasingly formidable challenge&lt;/li&gt;\n&lt;li&gt;Operating costs are far lower than active investments&lt;/li&gt;\n&lt;li&gt;Taxes are lower due to decreased turnover&lt;/li&gt;\n&lt;li&gt;Fees are much lower&lt;/li&gt;\n&lt;li&gt;Easier to stay on plan&lt;/li&gt;\n&lt;li&gt;More time for other activities&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Investment professionals daily trading volume by decade\n\n&lt;ul&gt;\n&lt;li&gt;10% in the 1960&amp;#39;s to over 90% currently.&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;This is why it is so difficult for active managers to beat the market&lt;/li&gt;\n&lt;li&gt;Understanding the outlook for the near term is easy as J.P Morgan said, &amp;quot;It will fluctuate.&amp;quot;&lt;/li&gt;\n&lt;li&gt;One way to be realistic about future returns is to assume that future range of P/E multiples and corporate profits will be within their historical upper and lower limits and will appear with frequency at values close to the long-term average&lt;/li&gt;\n&lt;li&gt;Investors almost always project recent past market and economic behavior out into the future, somehow expecting more of the same to continue\n\n&lt;ul&gt;\n&lt;li&gt;Math example – If dividends are at 1.5% and corporate earnings are growing at 4.5% (Historical Average), then a composite of 6% return is reasonable. This is the fundamental rate of return the investor can expect from the market&lt;/li&gt;\n&lt;li&gt;Then you add or subtract the changes in P/E over that time frame. The average P/E in recent decades has been about 15.5. This is the speculative return component&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Predicting the market roughly is not hard, but predicting it accurately is impossible\n\n&lt;ul&gt;\n&lt;li&gt;Predicting where the market will be in the long run is not hard, but even estimating how it will move in the next few months is impossible and pointless&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Investing must always begin with savings. No savings means no investing&lt;/li&gt;\n&lt;li&gt;Having a defensive saving reserve is a must. Just like a fire extinguisher&lt;/li&gt;\n&lt;li&gt;10 Commandments for individual investors\n\n&lt;ul&gt;\n&lt;li&gt;Save&lt;/li&gt;\n&lt;li&gt;If you must &amp;quot;play&amp;quot; in the market, do it will a small portion of your money&lt;/li&gt;\n&lt;li&gt;Don&amp;#39;t do anything in investing primarily for tax reasons&lt;/li&gt;\n&lt;li&gt;Don&amp;#39;t think of your home as an investment&lt;/li&gt;\n&lt;li&gt;Don&amp;#39;t do commodities&lt;/li&gt;\n&lt;li&gt;Don&amp;#39;t get confused by stockbrokers and salespeople&lt;/li&gt;\n&lt;li&gt;Don&amp;#39;t invest in novel or unusual kinds of investments&lt;/li&gt;\n&lt;li&gt;Don&amp;#39;t invest in bonds just because you heard they are safe. Bond prices fluctuate and are a very poor defense against the major risk of long-term investing: inflation.&lt;/li&gt;\n&lt;li&gt;Write out your long-term goals and have an investment plan in place&lt;/li&gt;\n&lt;li&gt;Distrust your feelings&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Your responsibility is to decide on your long-term investment objective and determine a reasoned and realistic set of investment policies that can achieve your objectives&lt;/li&gt;\n&lt;li&gt;The individual investor does not have to beat the market to be successful&lt;/li&gt;\n&lt;li&gt;Warren Buffett &amp;quot;Investing is simple, but it&amp;#39;s not easy.&amp;quot;&lt;/li&gt;\n&lt;li&gt;The real challenge is to commit to the discipline of long-term investing and avoid reacting to the short-term distractions&lt;/li&gt;\n&lt;li&gt;Winning the loser&amp;#39;s game of beating the market is easy: DO NOT TRY IT!!&lt;/li&gt;\n&lt;li&gt;Index your investments&lt;/li&gt;\n&lt;li&gt;The real purpose of investment management is not to beat the market; it is to do what is right for each particular investor who accepts the responsibility of defining their true and realistic investment objectives, developing sensible long-term policies, and staying with them.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2shb7",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "savnly",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "captmorgan50",
  "discussion_type": null,
  "num_comments": 15,
  "send_replies": false,
  "whitelist_status": "some_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/Bogleheads/comments/savnly/winning_the_losers_game_by_charles_ellis_book/",
  "parent_whitelist_status": "some_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/Bogleheads/comments/savnly/winning_the_losers_game_by_charles_ellis_book/",
  "subreddit_subscribers": 132918,
  "created_utc": 1642961636,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1642950561,
  "the_new_excerpt": "WINNING THE LOSER'S GAME BY CHARLES ELLIS\n\n * Investment managers are not beating the market, the market is beating them\n   * Over 1 year, 70% of professionals underperform their benchmarks\n   * Over 10 years, 80%\n   * Over 15 years, 90%\n * Yes, some professional money managers will beat the market…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "敗者のゲームに勝つ by チャールズ・エリス\n\n * 投資マネージャーは市場に勝っているのではなく、市場が勝っているのだ。\n   * 1年間で、70%のプロフェッショナルがベンチマークを下回る。\n   * 10年以上では、80%。\n   * 15年以上では、90%。\n * はい、一部のプロのマネーマネージャーは市場を打ち負かすでしょう...",
      "title": "チャールズ・エリス著『敗者のゲームに勝つ』書籍概要"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "赢得失败者的游戏 作者：查尔斯-艾利斯\n\n *投资经理没有打败市场，市场正在打败他们\n   * 在1年内，70%的专业人士的业绩低于他们的基准值\n   * 在10年内，80%的专业人员的业绩低于基准。\n   *超过15年，90%。\n *是的，一些专业的资金经理会击败市场......",
      "title": "赢得失败者的游戏》查尔斯-埃利斯著书摘要"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "贏得失敗者的遊戲 作者：查爾斯-艾利斯\n\n *投資經理沒有打敗市場，市場正在打敗他們\n   * 在1年內，70%的專業人士的業績低於他們的基準值\n   * 在10年內，80%的專業人員的業績低於基準。\n   *超過15年，90%。\n *是的，一些專業的資金經理會擊敗市場......",
      "title": "贏得失敗者的遊戲》查爾斯-埃利斯著書摘要"
    }
  ]
}