{
  "author": "pepperonimilkjuice5",
  "original_created_utc": 1632755237,
  "title": "Coinbase collects a lot of user data and that’s not OK. They are the Facebook of crypto.",
  "created_utc": 1632771050,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I can’t wrap my mind around how much data Coinbase collects from its users. In my opinion, it’s unethical and goes against everything cryptocurrency stands for.</p>\n\n<p>According to their <a href=\"https://help.coinbase.com/en/coinbase/privacy-and-security/data-privacy/what-is-the-gdpr\">Data &amp; Privacy page</a>, Coinbase may collect the following types of information:</p>\n\n<ul>\n<li>Personal Identification Information: Full legal name, date of birth, age, nationality, gender, signature, utility bills, photographs, phone number, home address, and/or email.</li>\n<li>Formal Identification Information: Government issued identity document such as Passport, Driver&#39;s License, National Identity Card, State ID Card, Tax ID number, passport number, driver&#39;s license details, national identity card details, visa information, and/or any other information deemed necessary to comply with our legal obligations under financial or anti-money laundering laws.</li>\n<li>Institutional Information: Employer Identification number (or comparable number issued by a government), proof of legal formation (e.g. Articles of Incorporation), personal identification information for all material beneficial owners.</li>\n<li>Financial Information: Bank account information, payment card primary account number (PAN), transaction history, trading data, and/or tax identification.</li>\n<li>Transaction Information: Information about the transactions you make on our Services, such as the name of the recipient, your name, the amount, and/or timestamp.</li>\n<li>Employment Information: Office location, job title, and/or description of role.</li>\n<li>Correspondence: Survey responses, information provided to our support team or user research team.</li>\n<li>Online Identifiers: Geo location/tracking details, browser fingerprint, operating system, browser name and version, and/or personal IP addresses.</li>\n<li>Usage Data: Authentication data, security questions, click-stream data, public social networking posts, and other data collected via cookies and similar technologies.</li>\n</ul>\n\n<p>If you are using iPhone, check out the <a href=\"https://apps.apple.com/app/coinbase-pro/id1446636681\">Coinbase Pro app in App Store</a> and scroll down to ‘Privacy’ to see what data Coinbase collects from you. If you are new to crypto and don’t have a crypto exchange yet, this may be an easy tool to help you decide.</p>\n\n<p><strong>Stop whining, it’s just KYC/AML</strong></p>\n\n<p>The supposed benefit of KYC/AML is preventing money laundering and financing of terrorism — commonly shortened to anti-money laundering (AML). The reason I say “supposed” is because the worldwide AML programs do little to curb any money laundering. According to a <a href=\"https://www.tandfonline.com/doi/full/10.1080/25741292.2020.1725366\">recent study</a>, AML worldwide has about a 0.1% success rate, while costing institutions a great deal of resources in compliance costs.</p>\n\n<p>But compliance isn’t the major KYC/AML cost — it’s the risk and lost opportunities that these requirements impose on ordinary people:</p>\n\n<ul>\n<li>Data leak risks: <a href=\"https://en.wikipedia.org/wiki/List_of_data_breaches\">everything leaks</a>, it’s simply inevitable;</li>\n<li>Data sharing risks: you may think you provide data to an exchange, but these data are going to be shared with third parties and government agencies;</li>\n<li>Personal risks: leaked or stolen data can be used against you in an attempt to steal your coins, both remotely (phishing) and physically (home invasion);</li>\n<li>Confiscation risks: laws change all the time and there might come a time when a <a href=\"https://en.wikipedia.org/wiki/Executive_Order_6102\">6102 type</a> of legislature is passed;</li>\n<li>Lost opportunities: people from sanctioned countries or without required documentation are ostracized from using bitcoin-related services in the same fashion as from the legacy finance industry.</li>\n</ul>\n\n<p>On top of these risks, consider the public nature of the Bitcoin blockchain. When you buy bitcoin on an exchange that has your full identity, this exchange can track your withdrawal and subsequent transactions. In fact, exchanges regularly cooperate with chain analysis companies that make it their business to track users’ transaction behavior.</p>\n\n<p>KYC’d bitcoin is surveilled bitcoin.</p>\n</div><!-- SC_ON -->",
  "score": 181,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/2pmsCo5kbKqbR3ejGHyErS51RhYZM3ReVYbgel-V6p0.jpg?auto=webp&s=72d5a2eb5aa9a9369227aa7d45ff57f9e5021155",
          "width": 180,
          "height": 180
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/2pmsCo5kbKqbR3ejGHyErS51RhYZM3ReVYbgel-V6p0.jpg?width=108&crop=smart&auto=webp&s=221d34fd7e2fd1e0a301bb54f8ccf8c1fa7db96e",
            "width": 108,
            "height": 108
          }
        ],
        "variants": {},
        "id": "UX7q_tdteJIxyQ8plTAYJ7qHpDJ4Z8efPvp5yNDomeI"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/pwj1vm/coinbase_collects_a_lot_of_user_data_and_thats/",
  "subreddit": "CryptoCurrency",
  "id": "pwj1vm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I can’t wrap my mind around how much data Coinbase collects from its users. In\nmy opinion, it’s unethical and goes against everything cryptocurrency stands\nfor.\n\nAccording to their Data & Privacy page\n[https://help.coinbase.com/en/coinbase/privacy-and-security/data-privacy/what-is-the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "コインベースがユーザーからどれだけのデータを収集しているのか、私には理解できません。私の意見では\n私の意見では、それは非倫理的であり、暗号通貨が象徴するものすべてに反しています。\nに反するものだと思います。\n\nCoinbaseのデータ＆プライバシーページによると\n[https://help.coinbase.com/en/coinbase/privacy-and-security/data-privacy/what-is-the...",
      "title": "Coinbaseは多くのユーザーデータを収集しますが、それは問題ありません。彼らは暗号のFacebookです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我无法理解Coinbase从其用户那里收集了多少数据。在我看来\n我认为，这是不道德的，违背了加密货币所代表的一切\n所代表的一切。\n\n根据他们的数据和隐私页面\n[https://help.coinbase.com/en/coinbase/privacy-and-security/data-privacy/what-is-the...",
      "title": "Coinbase收集了大量的用户数据，这是不可以的。他们是加密货币的Facebook。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我無法理解Coinbase從其用戶那裏收集了多少數據。在我看來\n我認爲，這是不道德的，違背了加密貨幣所代表的一切\n所代表的一切。\n\n根據他們的數據和隱私頁面\n[https://help.coinbase.com/en/coinbase/privacy-and-security/data-privacy/what-is-the...",
      "title": "Coinbase收集了大量的用戶數據，這是不可以的。他們是加密貨幣的Facebook。"
    }
  ]
}