{
  "author": "Excellent-Captain-93",
  "original_created_utc": 1648763332,
  "title": "Underage Sexual Assault?",
  "created_utc": 1648803397,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Tonight myself and a few friends joined a buddy of mine at a family restaurant and pub for a few drinks for his birthday. His little sister (14y/o) had come with him along with his mother.&lt;/p&gt;\n\n&lt;p&gt;Two drinks in and eventually I (24y/o M) noticed his little sister was being quite flirtatious with me and doing the cliche things teen ladies do when theyre hitting on you (laughing too much at every joke, constantly trying to touch you etc...[stereotyping im sorry]). Im engaged to the absolute love of my life and have been with her for almost a decade and besides that the fact that she is 14 I obviously blew her off and ignored her demeanor.&lt;/p&gt;\n\n&lt;p&gt;Her mother however definitely noticed what was going on and felt the need to remind me twice that she is underage to which both times i replied &amp;quot;I know I&amp;#39;m not interested in her&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Barring in mind d few years back I remember carrying her in my arms to hush her to sleep at a late night braai (bbq) because she was a little kid....&lt;/p&gt;\n\n&lt;p&gt;Tonight she not only grabbed my backside she also purposefully stroked my genitals. I downed my drink and left immediately. Could i be charged for this? What should I do?&lt;/p&gt;\n\n&lt;p&gt;Edit: i at no point gave the child any reason to believe there was any possibility of anything happening, we talked about anime for a few minutes.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 115,
  "permalink": "/r/TooAfraidToAsk/comments/ttaoc2/underage_sexual_assault/",
  "subreddit": "TooAfraidToAsk",
  "id": "ttaoc2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "Tonight myself and a few friends joined a buddy of mine at a family restaurant\nand pub for a few drinks for his birthday. His little sister (14y/o) had come\nwith him along with his mother.\n\nTwo drinks in and eventually I (24y/o M) noticed his little sister was being\nquite flirtatious with me and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今夜は、私と友人数名で友人のファミリーレストランに参加しました。\nを飲んで、彼の誕生日を祝いました。彼の妹(14歳)も来ていました。\n彼の母親と一緒に。\n\n2杯飲んだところで、私（24歳・M）は彼の妹が次のようなことをしていることに気づきました。\nというのも、私に対してかなりイチャついていて...。",
      "title": "未成年の性的暴行？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今晚我和几个朋友和我的一个朋友一起在一家家庭餐馆\n和酒吧喝了几杯，庆祝他的生日。他的小妹妹（14岁）和他的母亲一起来到这里。\n和他的母亲一起来的。\n\n喝了两杯后，我（24岁的男性）注意到他的小妹妹对我很有好感。\n对我相当挑逗，并且...",
      "title": "未成年的性侵犯？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今晚我和幾個朋友和我的一個朋友一起在一家家庭餐館\n和酒吧喝了幾杯，慶祝他的生日。他的小妹妹（14歲）和他的母親一起來到這裏。\n和他的母親一起來的。\n\n喝了兩杯後，我（24歲的男性）注意到他的小妹妹對我很有好感。\n對我相當挑逗，並且...",
      "title": "未成年的性侵犯？"
    }
  ]
}