{
  "author": "leakyanon",
  "the_new_excerpt": "I am one of the 250,000 victims of the ledger hack and now my full name, email,\nphone number and home address is out there for all the worlds worst online\ncriminals to exploit. This was completely avoidable as the idiots at ledger hard\ncoded an API key somewhere that anyone with basic web knowledge…",
  "original_created_utc": 1608994092,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我是账本被黑的25万名受害者之一，现在我的全名是电子邮件，\n电话号码和家庭住址是世界上所有最糟糕的在线产品\n可以利用的罪犯。这是完全可以避免的，因为在分类账上的白痴很难\n在某个地方编写了一个API键，任何具备基本Web知识的人都可以使用…",
      "title": "我们需要疏远任何不保护所有客户数据的公司。这是我们能够确保所有公司都超越对它们的期望的唯一方法。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是賬本被黑的25萬名受害者之一，現在我的全名是電子郵件，\n電話號碼和家庭住址是世界上所有最糟糕的在線產品\n可以利用的罪犯。這是完全可以避免的，因爲在分類賬上的白癡很難\n在某個地方編寫了一個API鍵，任何具備基本Web知識的人都可以使用…",
      "title": "我們需要疏遠任何不保護所有客戶數據的公司。這是我們能夠確保所有公司都超越對它們的期望的唯一方法。"
    }
  ],
  "title": "We need to alienate any company who does not protect all customer data. This is the only way we can ensure all companies go above and beyond what is expected of them.",
  "created_utc": 1609011498,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am one of the 250,000 victims of the ledger hack and now my full name, email, phone number and home address is out there for all the worlds worst online criminals to exploit. This was completely avoidable as the idiots at ledger hard coded an API key somewhere that anyone with basic web knowledge could copy paste to get access to their entire unencrypted customer database which they didn’t even need to keep for more than 30 days anyway. </p>\n\n<p>I think the only way we can make sure that all companies and directors and staff respect our privacy is to completely alienate them from the entire crypto community if they fuck up. This is not an attack on ledger. This is for the good and safety of the entire crypto community movement. We cannot accept or forgive companies who cut corners and make mistakes like this as other companies will continue to cut corners and think making mistakes like this is forgivable. </p>\n\n<p>There needs to be consequences and the only way we can make sure this never happens again is to threaten any business with complete isolation. No more sales. Not welcome at events. No more interaction on social media. If Ledger are at a conference or industry event, I won’t be going. I have removed the stickers from my laptop and I won’t be using their software anymore. Once I can find a suitable alternative I will be throwing away my devices. I was a proud customer and recommended them to dozens of people but now I look at my devices with disgust. </p>\n\n<p>Ledger is a “security company” who cant even secure access to their entire customer database. Companies who want to collect our private information need to know that it comes with the ultimate price. If they fuck up and our information is leaked online, it’s over. The worst that will happen is they loose their business. 250,000 of us have lost our privacy and that is immeasurably worse.</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/Bitcoin/comments/kkjnac/we_need_to_alienate_any_company_who_does_not/",
  "subreddit": "Bitcoin",
  "id": "kkjnac",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609495327980
}