{
  "author": "JuicySpark",
  "the_new_excerpt": "Guy makes sick money but normally a drinker and likes to gamble $100s $1000s at\na time. You name it, sports, racetrack. Anything for a thrill. I'm pretty\nconvinced that's what he does when he's not working. His life is just eat, shit,\nwork, gamble, drink, pass out. There's really no science to this…",
  "original_created_utc": 1612252058,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "赚的是变态的钱，但平时喜欢喝酒，喜欢赌一百元一千元的钱\n一次。你的名字，运动，赛马场。任何刺激的事情。我很\n确信这就是他不工作时的工作。他的生活就是吃饭，拉屎。\n工作，赌博，喝酒，晕倒。这真的没有科学依据... ...",
      "title": "第一次投资加密货币。我姐夫的球在墙上FOMO上doge的一天。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "賺的是變態的錢，但平時喜歡喝酒，喜歡賭一百元一千元的錢\n一次。你的名字，運動，賽馬場。任何刺激的事情。我很\n確信這就是他不工作時的工作。他的生活就是喫飯，拉屎。\n工作，賭博，喝酒，暈倒。這真的沒有科學依據... ...",
      "title": "第一次投資加密貨幣。我姐夫的球在牆上FOMO上doge的一天。"
    }
  ],
  "title": "First Time Crypto Investor: My Brother-in-law's Balls to the Wall FOMO on doge the other day.",
  "created_utc": 1612283544,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Guy makes sick money but normally a drinker and likes to gamble $100s $1000s at a time.  You name it, sports, racetrack. Anything for a thrill.  I&#39;m pretty convinced that&#39;s what he does when he&#39;s not working. His life is just eat, shit, work, gamble, drink, pass out.  There&#39;s really no science to this guy&#39;s life.   He&#39;s my age but looks double , but when he wants something he goes balls to the wall. </p>\n\n<p>He always said crypto was stupid.   </p>\n\n<p>Anyway this guy calls me out of nowhere, says &quot;IM COMING OVER, I want you to show me how I can buy doge&quot;. </p>\n\n<p>Sure.   He comes by.  First thing this guy does is slap 2 grand in fresh 100s on the table next to me and tells me to buy doge for him.   </p>\n\n<p>NO PATIENCE AT ALL.  Like I have a stash of PKs on a hard drive waiting for him. </p>\n\n<p>I&#39;m thinking most my shit is in wallets and I&#39;m not parting with my shit coins either. </p>\n\n<p>So going through the process of setting up his account, I was trying to explain to him coinbase, his account, transfers, binance. Before I could finish half of a sentence... He tells me. &quot;I don&#39;t have time for this, just buy it&quot;.</p>\n\n<p>I bought Btc for him but there was a problem with his card. Only limited $1000 so we tried bincance.   Finally evil to get him to deposit 2000 I had to transfer BTC over for doge.   He said, &quot;I want you to sell it in 8 hrs whatever the price is and I&#39;ll be over tomorrow to pick up the money&quot;  </p>\n\n<p>I said.. woo wait a minute...you need to wait for the cash to transfer back to your bank account.    </p>\n\n<p>He starts fuming and says, &quot;NAH I can&#39;t wait, And I don&#39;t want BTC don&#39;t buy me that , there saying doge will hit $1&quot;.   I told him I need btc from coinbase and he didn&#39;t understand. Just kept saying&quot; btc isn&#39;t going anywhere &quot;</p>\n\n<p>Anyway, I bought doge, sold in 8hrs when It was down 60%.  He calls me up afterwards all pissed and then tells me to keep whatever is in there that he wants nothing to do with crypto ever again.</p>\n\n<p>I don&#39;t understand how people like him make loads of money.</p>\n</div><!-- SC_ON -->",
  "score": 281,
  "permalink": "/r/CryptoCurrency/comments/laqimw/first_time_crypto_investor_my_brotherinlaws_balls/",
  "subreddit": "CryptoCurrency",
  "id": "laqimw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518530882
}