{
  "author": "dafood00",
  "the_new_excerpt": "So I've seen some posts from veteran (I assume) traders on here and other\nsubreddits complaining about all of the new investors from the GME splurge\npopping up, asking questions, being scared of 'red days', etc etc...\n\nWhich to an extent, I can understand (I am a new trader myself), as I…",
  "original_created_utc": 1613778166,
  "title": "Flood of new investors thought/discussion",
  "created_utc": 1613799206,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I&#39;ve seen some posts from veteran (I assume) traders on here and other subreddits complaining about all of the new investors from the GME splurge popping up, asking questions, being scared of &#39;red days&#39;, etc etc...</p>\n\n<p>Which to an extent, I can understand (I am a new trader myself), as I imagine some folks don&#39;t want to have to sift through all the noise on their favorite subreddits.</p>\n\n<p>But I think there&#39;s a flip side to this, and curious to hear peoples opinion on it.  Doesn&#39;t all the brand spanking new investors bode well for the long term?  My thought is: A lot of these people who got swept up in the GME YOLO wave and all that are not going to stick around, but there has to be a decent amount who have always been interested in stocks and didn&#39;t jump in before.</p>\n\n<p>Some of the latter who are sticking around to learn (I hope I am one of these) will eventually turn into knowledgeable traders who provide more money, new ideas or DD and better discussion right?</p>\n\n<p>Also, from what I understand of frozen concentrated orange juice, the market is brutal to the consistently foolish and emotional traders.  One the flip side of the coin will be people who can&#39;t handle it and get chewed up and spit out by everyone else.  I hope these kind of traders can get out without getting hurt too badly.</p>\n\n<p>Anyways, I wanted to hear from some folks on here on what they think about all of that.  Does having all these new users asking questions all the time beneficial in the long run or is it just the nuisance of newbies asking questions that can easily be looked up and who will quickly be gone?</p>\n</div><!-- SC_ON -->",
  "score": 52,
  "permalink": "/r/stocks/comments/lntqrx/flood_of_new_investors_thoughtdiscussion/",
  "subreddit": "stocks",
  "id": "lntqrx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332885064,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我在这里和其他网站上看到一些资深交易员（我想是）的帖子，他们抱怨GME大手笔的新投资者。\n抱怨所有来自GME的新投资者，问问题，害怕 \"红色\"。\n冒出来，问问题，害怕 \"红日\"，等等...。\n\n在某种程度上，我可以理解（我自己也是一个新交易员），因为我...",
      "title": "新投资者涌入的思考/讨论"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在這裏和其他網站上看到一些資深交易員（我想是）的帖子，他們抱怨GME大手筆的新投資者。\n抱怨所有來自GME的新投資者，問問題，害怕 \"紅色\"。\n冒出來，問問題，害怕 \"紅日\"，等等...。\n\n在某種程度上，我可以理解（我自己也是一個新交易員），因爲我...",
      "title": "新投資者湧入的思考/討論"
    }
  ]
}