{
  "author": "Disguustang",
  "the_new_excerpt": "I hate what is happening at the moment, and the blatant market manipulation by a\ncertain someone causing mass hysteria.\n\nPeople are treating this whole scene like it’s a game. These actions have caused\nthousands of people to lose ridiculous amounts of money. Life savings sometimes.\n\nPeople invest…",
  "original_created_utc": 1620949050,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今起きていること、そしてある人物による露骨な市場操作が集団ヒステリーを引き起こしていることが嫌なのです。\n集団ヒステリーを引き起こしているある人物による露骨な市場操作。\n\n人々はこのシーン全体をゲームのように扱っています。これらの行為によって\n何千人もの人々がとんでもない額のお金を失っています。時には人生の貯蓄も。\n\n人々は投資...",
      "title": "暗号通貨はゲームではありません...。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我讨厌目前正在发生的事情，以及某个人公然操纵市场的行为。\n某个人造成了大规模的歇斯底里。\n\n人们把这整个场面当成了一场游戏。这些行为已经造成\n成千上万的人失去了可笑的金钱。有时是一生的积蓄。\n\n人们投资...",
      "title": "加密货币不是一个游戏..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我討厭目前正在發生的事情，以及某個人公然操縱市場的行爲。\n某個人造成了大規模的歇斯底里。\n\n人們把這整個場面當成了一場遊戲。這些行爲已經造成\n成千上萬的人失去了可笑的金錢。有時是一生的積蓄。\n\n人們投資...",
      "title": "加密貨幣不是一個遊戲..."
    }
  ],
  "title": "Cryptocurrency isn’t a game…",
  "created_utc": 1620964223,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I hate what is happening at the moment, and the blatant market manipulation by a certain someone causing mass hysteria.</p>\n\n<p>People are treating this whole scene like it’s a game. These actions have caused thousands of people to lose ridiculous amounts of money. Life savings sometimes.</p>\n\n<p>People invest for a better life, people invest hoping to get out of the daily grind that we all struggle with. Gambling money on Ponzi schemes named after dogs and cats and weird mythical creatures feels really damaging to the image that cryptocurrency has been trying to curate for the last 12 years.</p>\n\n<p>We are a joke currently. I hate it.</p>\n</div><!-- SC_ON -->",
  "score": 464,
  "permalink": "/r/CryptoCurrency/comments/nbury1/cryptocurrency_isnt_a_game/",
  "subreddit": "CryptoCurrency",
  "id": "nbury1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590796941
}