{
  "author": "gdubz_39",
  "the_new_excerpt": "Almost finished and I need a new book to read. I understand bogleheads guide to\ninvesting is usually suggested however I am a little more interested in learning\nabout how to analyze graphs and trends, using fundamental/technical analysis,\nunderstanding not only the financials of a company but how…",
  "original_created_utc": 1621953212,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ほぼ完成したので、新しい本を読みたいと思っています。bogleheads guide to\nしかし、私はグラフやトレンドの分析方法について学ぶことにもう少し興味があります。\nファンダメンタル／テクニカル分析を用いて、グラフやトレンドを分析する方法について。\n会社の財務状況だけでなく、どのように...を理解する。",
      "title": "The Little Book Of Common Sense Investingの後に読むべき本は？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "快结束了，我需要一本新书来读。我了解到博格赫德的投资指南\n投资指南，但我更想了解的是\n如何使用基本面/技术面分析来分析图表和趋势。\n不仅要了解公司的财务状况，还要了解如何...",
      "title": "在《投资常识小书》之后读什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "快結束了，我需要一本新書來讀。我瞭解到博格赫德的投資指南\n投資指南，但我更想了解的是\n如何使用基本面/技術面分析來分析圖表和趨勢。\n不僅要了解公司的財務狀況，還要了解如何...",
      "title": "在《投資常識小書》之後讀什麼？"
    }
  ],
  "title": "What to read after The Little Book Of Common Sense Investing?",
  "created_utc": 1621958650,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Almost finished and I need a new book to read. I understand bogleheads guide to investing is usually suggested however I am a little more interested in learning about how to analyze graphs and trends, using fundamental/technical analysis, understanding not only the financials of a company but how they relate to other companies in the same industry and the market as a whole etc. I understand we’re all big on index funds and I’m certainly going to pour more money into them rather than individual stocks in the coming years, but I’d like to learn a bit more about analyzing them. Thought about A Behinners Guide To The Stock Market by Matthew Kratter but I’m open to suggestions.</p>\n</div><!-- SC_ON -->",
  "score": 78,
  "permalink": "/r/Bogleheads/comments/nkr5xp/what_to_read_after_the_little_book_of_common/",
  "subreddit": "Bogleheads",
  "id": "nkr5xp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197388306
}