{
  "author": "Harleychillin93",
  "original_created_utc": 1628687093,
  "title": "No bartender has ever accepted a tip from me in crypto. I know we're not super early, but we are still pretty early.",
  "created_utc": 1628699772,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I live in a big city on the central east coast. I go out for beers with friends pretty frequently. I litterally try at every new establishment I go to, or even when I&#39;m at the same place but its a different bartender, I ask them if they&#39;d accept the tip, not the bill, in btc, or any crypto of their preference. I haven&#39;t gotten a single person to accept my magic internet money yet. Millions of working class people in the U.S. still dont get it at all. I know were not early like btc for under 100 dollars early, but if this is truly an unsoverign money (which i believe it is), there is soooooo much adoption to happen yet. Billions of holders that aren&#39;t currently holding. </p>\n\n<p>My bartender last night said she would accept a stock as a tip. I said I cant send you a stock through our phones, and she rolled her eyes and shoulders and gave up. Not 1 of the 3 bartenders working last night wanted my btc. They even kinda started talking shit like is it real, what can they spend it on, and how would they tipshare it. They answered my question and I wasn&#39;t about to start lecturing in the bar about crypto so I sat back and enjoyed my beer with a smile after that. People get btc when they deserve I guess. </p>\n\n<p>I&#39;m going to say this next part, which I know can be a polarizing phrase around here lately, but this isn&#39;t an isolated incident for me. Ive been trying for 2 years now. Until my bartender accepts crypto as a tip....</p>\n\n<p>WE&#39;RE STILL EARLY!!!!!!</p>\n\n<p>Edited to clarify I still tipped the bartender 20%.</p>\n</div><!-- SC_ON -->",
  "score": 195,
  "permalink": "/r/CryptoCurrency/comments/p2cnvl/no_bartender_has_ever_accepted_a_tip_from_me_in/",
  "subreddit": "CryptoCurrency",
  "id": "p2cnvl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I live in a big city on the central east coast. I go out for beers with friends\npretty frequently. I litterally try at every new establishment I go to, or even\nwhen I'm at the same place but its a different bartender, I ask them if they'd\naccept the tip, not the bill, in btc, or any crypto of their…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は東海岸中央部の大きな都市に住んでいます。友達と一緒にビールを飲みに行ったり\n頻繁に行っています。新しい店に行くたびに試しています。\nまた、同じ店でもバーテンダーが違うと、そのバーテンダーに「このビールを飲んでもいいですか？\n勘定書ではなく、チップをビットコインやその他の暗号で受け取ってくれるか聞いてみます。",
      "title": "バーテンダーが私からのチップを暗号で受け取ったことはありません。私たちは超早期ではありませんが、それでもかなり早い段階にあると思います。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我住在东海岸中部的一个大城市。我经常和朋友出去喝啤酒\n相当频繁。我在每一个新的场所都会尝试，甚至当我在同一个地方，但它是不同的啤酒。\n当我在同一个地方，但它是一个不同的酒保，我问他们，如果他们接受小费，而不是账单，在BTC，我问他们是否接受。\n接受小费，而不是账单，用BTC或任何他们的加密货币......",
      "title": "没有一个酒保接受过我以加密货币支付的小费。我知道我们不是超级早期，但我们仍然是相当早期。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我住在東海岸中部的一個大城市。我經常和朋友出去喝啤酒\n相當頻繁。我在每一個新的場所都會嘗試，甚至當我在同一個地方，但它是不同的啤酒。\n當我在同一個地方，但它是一個不同的酒保，我問他們，如果他們接受小費，而不是賬單，在BTC，我問他們是否接受。\n接受小費，而不是賬單，用BTC或任何他們的加密貨幣......",
      "title": "沒有一個酒保接受過我以加密貨幣支付的小費。我知道我們不是超級早期，但我們仍然是相當早期。"
    }
  ]
}