{
  "author": "FlockOfMurder",
  "original_created_utc": 1646414786,
  "title": "Why are white people consider to not have culture?",
  "created_utc": 1646498181,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Just like the title says. I&amp;#39;ve (White, M, 29) seen a few &amp;quot;viral&amp;quot; videos of black students telling white student that they shouldn&amp;#39;t be in a universites cultural center because &amp;quot;white people don&amp;#39;t have culture&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;As I understand it culture is the &amp;quot;customs, arts, social institutions and achievements of a particular nation, people or social group.&amp;quot; -Oxford Languages &lt;/p&gt;\n\n&lt;p&gt;So with that definition that leads me back to my question.&lt;/p&gt;\n\n&lt;p&gt;Why are white people consider to have no culture?&lt;/p&gt;\n\n&lt;p&gt;There are a lot of things I don&amp;#39;t know or understand. So I&amp;#39;m genuinely interested to learn and understand other view points.&lt;/p&gt;\n\n&lt;p&gt;EDIT: Thank you guys for your thoughts, opinions and viewpoints. There are a lot of thoughtfull and we&amp;#39;ll written comments in this thread. I didn&amp;#39;t respond to all of them but I will continue to read them and do my best to chime in.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/NoStupidQuestions/comments/t6o3px/why_are_white_people_consider_to_not_have_culture/",
  "subreddit": "NoStupidQuestions",
  "id": "t6o3px",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Just like the title says. I've (White, M, 29) seen a few \"viral\" videos of black\nstudents telling white student that they shouldn't be in a universites cultural\ncenter because \"white people don't have culture\".\n\nAs I understand it culture is the \"customs, arts, social institutions and\nachievements…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルの通りです。私は（白人、M、29歳）、黒人の「バイラル」ビデオをいくつか見たことがあります。\n白人の学生に対して、「大学の文化施設に入るべきではない」と言う学生もいます。\n白人は文化を持っていない」のだから。\n\n私の理解では、文化とは「習慣、芸術、社会制度、そして\n成果...",
      "title": "なぜ白人は文化がないと思われているのですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "就像标题所说的那样。我（白人，男性，29岁）看过一些黑人学生的 \"病毒 \"视频\n黑人学生告诉白人学生，他们不应该在大学的文化中心\n因为 \"白人没有文化\"。\n\n根据我的理解，文化是 \"习俗、艺术、社会制度和成就\"。\n文化是 \"习俗、艺术、社会制度和成就\"。",
      "title": "为什么白人被认为是没有文化的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "就像標題所說的那樣。我（白人，男性，29歲）看過一些黑人學生的 \"病毒 \"視頻\n黑人學生告訴白人學生，他們不應該在大學的文化中心\n因爲 \"白人沒有文化\"。\n\n根據我的理解，文化是 \"習俗、藝術、社會制度和成就\"。\n文化是 \"習俗、藝術、社會制度和成就\"。",
      "title": "爲什麼白人被認爲是沒有文化的？"
    }
  ]
}