{
  "author": "FailureInvestor",
  "the_new_excerpt": "I don't really know where to start with this. I guess I will preface it with\nhaving just read someone else's story from a few years ago, which inspired me to\ntell my story as well. This was a long time coming, unfortunately.\n\nI started trading stocks roughly 10 years ago, when i was in my mid-20's,…",
  "original_created_utc": 1611084294,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我真的不知道该从何说起。我想我应该先说\n刚刚读到几年前别人的故事，这启发了我\n把我的故事也说出来。不幸的是，这是一个漫长的过程。\n\n我开始交易股票大约10年前，当我在我20多岁的时候，... ...",
      "title": "10多年，股票亏损11.4万....，叹息。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我真的不知道該從何說起。我想我應該先說\n剛剛讀到幾年前別人的故事，這啓發了我\n把我的故事也說出來。不幸的是，這是一個漫長的過程。\n\n我開始交易股票大約10年前，當我在我20多歲的時候，... ...",
      "title": "10多年，股票虧損11.4萬....，嘆息。"
    }
  ],
  "title": "10+ Years, 114k Stock Losses.... sigh",
  "created_utc": 1611090227,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I don&#39;t really know where to start with this. I guess I will preface it with having just read someone else&#39;s story from a few years ago, which inspired me to tell my story as well. This was a long time coming, unfortunately.</p>\n\n<p>I started trading stocks roughly 10 years ago, when i was in my mid-20&#39;s, when Scottrade was still around. I have placed many dumb trades over the last 10 or so years. In addition, I have not learned from my mistakes and I have made some mistakes way more then once. All of this while trading on a margin account, with margin money. That has exacerbated my wins and losses sometimes to $1000&#39;s of dollars on a single trade.</p>\n\n<p>Reflecting back on the last 10 or so years, it really blows my mind how many trades that i have made where i was on the wrong side of the trade. Its shocking and unbelievable... to say the very least. These losses pertain to stocks that are small cap, large cap.. and even some penny stocks. The level of regret that i have is way more then i could have ever of imagined, when i first started and thought about the risks.</p>\n\n<p>On the one hand - if i stop investing (gambling) now entirely, I would probably save what little money that i have left in my account. In addition, i would probably save whatever money i can make over the coming days/weeks from being lost as well. However, i would have to come to terms with never recovering all of the money that i lost.</p>\n\n<p>On the other hand - if i don&#39;t stop investing *cough* gambling.. it gives me hope that I could make back some/all of the money I lost, over the course of time. In a way, the money could be viewed as lost for now, but not forever if that makes sense. However, there is going to be a good chance that i lose more money then i already have.</p>\n\n<p>Overall, all of this eats away at me every single day. Not one day goes by where i dont think about all of the money i have lost in stocks, plus all of the other money additionally that i spent on computer games prior to my mid-20&#39;s. It&#39;s depressing and every day i have to put a smile on my face around my friends/family like as if &quot;everything is A-OK&quot;, when in reality - its not. I have roughly 55k in personal debt, with not much money in my trading account as an asset to leverage against it.</p>\n\n<p>Trying to think about any positives about my situation? What comes to my mind is that i have a roof over my head, i have food, I dont owe my stock broker money, although i lost the job that I was once proud of, i have a new &quot;contractor&quot; job that requires a lottttt of hours.. but i can make roughly $1,000 a week... and lastly i guess its a good thing that i dont have a girlfriend, wife or kids to support. God knows when i would be able to settle down and start a family one day at the rate i am going.</p>\n\n<p>&#x200B;</p>\n\n<p><em>EDIT: Some of my dumb trades involved:</em></p>\n\n<ol>\n<li>At times, having a single stock risk associated to my account</li>\n<li>Using margin money, and not respecting it</li>\n<li>Trading penny stocks (sometimes)</li>\n<li>Trading large portions of my money on FDA catalyst events</li>\n<li>Trying to time the market by shorting the broader market</li>\n<li>Looking up what the biggest percentage gainers/losers are for the day and going either long/short them for a quick day trade by trying to capitalize on the intraday volatility</li>\n<li>Not keeping my account hedged at all times</li>\n<li>Not capitalizing on the safety of ETF&#39;s</li>\n<li>Day trading more often then not</li>\n</ol>\n\n<p>&#x200B;</p>\n\n<p>Sincerely,</p>\n\n<p>One failure of an investor</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/investing/comments/l0r36h/10_years_114k_stock_losses_sigh/",
  "subreddit": "investing",
  "id": "l0r36h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1611311217232
}