{
  "author": "Good_Butterscotch_69",
  "original_created_utc": 1629717334,
  "title": "The Global economic Collapse; the hows and the why`s and what effect it may have on Crypto Part 1: Derivatives and Quantitative easing",
  "created_utc": 1629740154,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Foreword:</p>\n\n<p>A market crash comparable in scope to the great depression is almost a certainty in the next few months due to decades of over-leveraging and irresponsible fiscal policy. Holders should begin moving their coins off of exchanges and into personal wallets immediately to prevent loss in case of exchange shutdown, outage, or &quot;outage&quot;. Restrictions of Exchange and withdrawal are also a distinct possibility due to historical precedence.</p>\n\n<p><strong>Tl;Dr Take possession of your coins you are not actively using to trade or use in DeFi to prevent losing access to them during market volatility and the possibility of exchanges preventing access, going insolvent, or pretending to be having technical difficulties to prevent liquidity drain. Global economy screwed. No one can guess the effect that a market   crash of the magnitude described here will have on the wider crypto-market. As the only widely spread store of value out of the direct control of a few entities and governments Crypto may paradoxically rise as the market falls as people Fomo into it to preserve capital. Or with the new inclusion of institutional investors with large holdings it may force the Market to dump as liquidators force sell institutional holdings at a loss to cover margin tanking the market (institutions have no choice in the matter). Worst case the US dollar will collapse making Crypto sympathetically worthless. Only you can decide what to do in the events soon to come and these posts are only about providing information so you can make informed decisions.</strong></p>\n\n<p>Note:   None of this is speculation it is all based on existing facts, historical precedence, and other otherwise publicly unknown details. Sources will be cited at the beginning of each section. Some of this may be unintelligible due to terminology used. I will put long forms of Acronyms whenever possible but to explain every minute detail would detract from the message of the post. I speculate only on its effects on Crypto.</p>\n\n<p>Quick Definition:</p>\n\n<p>What is a derivative?</p>\n\n<p>“A financial product derived from another financial product” (for example, a futures contract tied to a stock index) — in practice, the term applies to a whole world of financial products that are written on a one-off basis between two entities called “counterparties,” as opposed to products that are traded on a broad, well-regulated market.</p>\n\n<p>Standard futures contracts are bought and sold on large exchanges, for example, the Chicago Board of Trade (CBOT). If I buy a futures contract — for example, I go long (contract or agree to <em>buy</em>   in  the future) a million bushels of wheat, or barrels of oil, in the expectation that the future price will rise within the time limit of the contract — there will be a counterparty on the short, or selling  side, in a well-regulated market, the  contracts are all standardized;  there are thousands of identical  contracts in pairs (one on the long or buy side, and one on the short or sell side); and as long as there are the same number of identical contracts on each side, it makes no difference  who’s on the other side of the contract. The exchange just matches up longs with shorts when they liquidate. Or at least that is how it is supposed to work. Read on to find out why it does not.</p>\n\n<p>The Margin and disproportionate Derivatives and risks of Banks.</p>\n\n<p>&quot;The Why&quot;</p>\n\n<p>Sources:</p>\n\n<p><a href=\"https://www.investopedia.com/ask/answers/050615/what-difference-between-notional-value-and-market-value.asp\">https://www.investopedia.com/ask/answers/050615/what-difference-between-notional-value-and-market-value.asp</a></p>\n\n<p><a href=\"https://www.occ.gov/publications-and-resources/publications/quarterly-report-on-bank-trading-and-derivatives-activities/files/pub-derivatives-quarterly-qtr1-2021.pdf\">https://www.occ.gov/publications-and-resources/publications/quarterly-report-on-bank-trading-and-derivatives-activities/files/pub-derivatives-quarterly-qtr1-2021.pdf</a></p>\n\n<p><a href=\"https://www.federalreserve.gov/supervisionreg/resolution-plans/goldman-sachs-1g-20210701.pdf\">https://www.federalreserve.gov/supervisionreg/resolution-plans/goldman-sachs-1g-20210701.pdf</a></p>\n\n<p><a href=\"https://finance.yahoo.com/news/buffett-drops-more-banks-adds-210000738.html\">https://finance.yahoo.com/news/buffett-drops-more-banks-adds-210000738.html</a></p>\n\n<p><a href=\"http://news.bbc.co.uk/2/hi/business/7815994.stm\">http://news.bbc.co.uk/2/hi/business/7815994.stm</a></p>\n\n<p><a href=\"https://statisticstimes.com/economy/world-gdp.php\">https://statisticstimes.com/economy/world-gdp.php</a></p>\n\n<p>(IMF &quot;International Monetary Fund&quot; is evil and only exists as a loan shark to rob 3rd world countries but I will get to that in a later post. DeFi is an existential threat to them.)</p>\n\n<p>&quot; Derivatives are &quot;financial weapons of mass destruction.&quot;&quot; - Warren Buffet</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/27t0nac2b3j71.png?width=2146&amp;format=png&amp;auto=webp&amp;s=eb5c41e3b994a5b548b6eea8fdd8684eb64ad1c0\">$1 = 1,000,000</a></p>\n\n<p><strong>Some of you have expressed disgust and fear about exchanges that allow up to 125x margin. Individuals financially ruined for life for the small chance of getting rich. Now imagine that but it is the entire financial system itself. But it is many, many times higher than 125x margin. That is the situation we face. This is not Capitalism it never was. Nothing is made. Nothing is exchanged. It is purely and simply theft. And it has gone on longer than any of us has been alive.</strong></p>\n\n<p>Banks and Bankers have long been derided throughout history for good reason, Jesus himself if you are partial to the faith committed violence against them for defiling the temple. In 2008 they were the primary cause of the global financial crisis due to bad swaps and credit. In 2008 the stick that broke the camels back was bad credit MBS`s  (Mortgage backed  securities). These loans and property acted as the collateral for these securities. What most of you are not aware of is just why this was so devastating beyond a few million people being foreclosed upon. And what does this picture above have to do with that? Everything. The reason 2008 was so devastating is that those MBS`s acted as the collateral for the securities needed to hedge margin. Without them the derivatives which the banks and other financial  institutions had became unbacked which caused a scramble for securities and collateral. The $ amount of  derivatives and leverage outnumber the  amount of $ in existence, never mind in circulation.</p>\n\n<p>For  reference  the total $ in circulation last check was approximately US  $37  trillion. In existence meaning everything held by every bank and  country  in the world due to the US reserve currency status is $93.86 trillion USD. Most of this will never see the light of day as they act  as simple  backing of currency. This caused a mad scramble to cover  debts and went  up the chain of responsibility through insurance policies. When an entity became insolvent the backing bank got  shouldered with the bill and themselves became insolvent. (They use  your money for this by the  way.) But that was unacceptable the world  economy would have been  destroyed. So what happened? Bailouts. A few individuals were designated to take the fall and the rest were bailed  out on the tax payer dime and were even richly rewarded with bonuses. This was done through a process called Quantitative Easing, (Permanent removal of Collateral in exchange for liquidity) so problem solved right?</p>\n\n<p><a href=\"https://www.youtube.com/watch?v=qxS8NhWA41Q\">https://www.youtube.com/watch?v=qxS8NhWA41Q</a></p>\n\n<p>Quantitative easing contrary to what Keynesian economics advocates (Modern Monetary Theory) believe is not the balm for the world economy. It just hid the economic crisis put it in stasis if you will and kept digging the hole deeper. It did not have to be this way, the banks and other  institutions that will be mentioned were essentially bought time to unwind their positions and unscrew the situation. Something sensible, reasonable even. Something really good for long term business health and profitability but terrible for the short term bottom line. Did they do this? No, they doubled, tripled, and quadrupled their bets and positions and they have done so for the past 10 years. Dodd Frank is not worth the paper its printed on because Gary Gensler (Then CFTC  chairman) whom was its champion at the time insisted that the loopholes being exploited be put in.</p>\n\n<p>The total amount of derivatives reported by banks from the q1 occ report is $189 Trillion. For reference the Global GDP as reported by the IMF is about $141 Trillion. These are just the Big American banks in the financial sector. This is all backed by only $20.273 Trillion in assets between all banks listed. This is only a small fraction of the full derivatives market. The full scope of which I have only seen one reference too a number in a radio interview put forward by Paul Willmot. This interview was only a  few months immediately following the financial crisis. $1.2 Quadrillion. Yes Quadrillion. But we will get  to that later.</p>\n\n<p>You might be asking, why this matters now? The economy is good right now right? Except its not.</p>\n\n<p>You may have heard of the rising inflation right? On paper inflation has risen 5% for at least 3 months in a row now. (Last time that happened was 2008 and the great recession.) But what if I told you the real number was higher because the equation used to decide it has been changed multiple times to hide the real number. How is this happening? The talking heads on television would blame retail or &quot;normal people&quot; and stimulus, but that is not what happened. Almost all of the federal stimulus has been kept out of the hands of retail. Many programs were never even rolled out with the states simply keeping the money. Only a fraction of what was meant for rent relief has been spent. So that is not it. So why the high inflation? The margin debt has gotten too big is what happened but even that could be kicked down the road for a time. Unfortunately, the Fed has had to keep the money printer on non-stop to give the economy the appearance of functioning normally. This sucks the collateral out of the market at a breakneck pace and as that  collateral is permanently removed, the purchasing power of the currency falls.</p>\n\n<p>The fed is not the only thing that needs those securities. Banks, hedgefunds, bonds, bullion banks they also need those securities. And there is a finite number of them. The government is also technically shut down right now. The debt ceiling has not been raised, meaning no more securities can be made. So what is in the market is what is available. And that will be the case  until the end of September at minimum as congress is on vacation. We do not have that long. Essentially the entire market is playing a game of musical chairs. And the instant one player, just one is unable to  secure the securities it needs margin will be called. The game will stop. There is not enough  money in the entire world to cover the margin that will come due. That will be a catastrophic event that cannot be stopped at this point you have very little time to be prepared. Its not doomsday but this will be at minimum a great depression 2.0.</p>\n\n<p>1.2   Quadrilion? I can scarcely imagine the number. Even spread over every financial sector in the world bond market (Jane Street), Stock Market (Wall Street), Bullion (London, Comex, Misc.), Commodities, and Real Estate. It is still unfathomably high to put it into perspective a million dollars (bills) would stack to your height more or less. A billion would scale a building. A trillion a sky scraper. A quadrilion would scale all the way to space and be well on its way to the moon. That was in 2009, Margin has only increased since then at a breakneck pace as quantitative easing hid its effects. No official number exists but it has at least doubled since 2009.</p>\n\n<p>Without touching on the other sectors margin of US banks being more than the entire World GDP would be dire enough so I will begin by briefing you on the biggest publicly accessible piece of evidence of whats happening.</p>\n\n<p>The Daily Reverse Repo:</p>\n\n<p>&quot;The How&quot;</p>\n\n<p><a href=\"https://www.cbo.gov/sites/default/files/112th-congress-2011-2012/reports/year-yearforecast110125.xls\">https://www.cbo.gov/sites/default/files/112th-congress-2011-2012/reports/year-yearforecast110125.xls</a></p>\n\n<p><a href=\"https://www.investopedia.com/terms/r/reverserepurchaseagreement.asp\">https://www.investopedia.com/terms/r/reverserepurchaseagreement.asp</a></p>\n\n<p>Reddit Search: (Major Signals are Flashing Code Red in the Shadow Banking System- Reverse Repo hitting $1T is just the Tip of the Iceberg)* <em>While the sub is focused on a stock, this post is entirely based on macro-economic phenomena devoted to the reverse purchase system and its role in the wider economic system and its collapse.</em> <strong><em>TL;DR We are in a collateral spiral with no way out and it will pop soon.</em></strong></p>\n\n<p><a href=\"https://www.youtube.com/watch?v=j1yyGieCC1w&amp;t=876s\">https://www.youtube.com/watch?v=j1yyGieCC1w&amp;t=876s</a></p>\n\n<p><a href=\"https://www.bea.gov/news/2021/gross-domestic-product-second-quarter-2021-advance-estimate-and-annual-update\">https://www.bea.gov/news/2021/gross-domestic-product-second-quarter-2021-advance-estimate-and-annual-update</a></p>\n\n<p>FI = Financial Institution</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/tch85ek6b3j71.png?width=1168&amp;format=png&amp;auto=webp&amp;s=879a06100b3504b30806be380c0675c707a26e72\">Taken directly from the New York Fed</a></p>\n\n<p>The What? You are possibly asking, I won`t lie I struggled to understand  it myself at first thinking it meant something else. Sparing you the history the Reverse Repo is a service provided by the Federal Reserve whereby it opens its treasury reserves  (T-Bills) to money market funds (MMF`s) and now other financial institutions. This is to ensure those funds remain solvent in the case that sufficient treasuries are not located to fill collateral requirements. MMF`s <strong>need</strong> treasuries. It is a non-negotiable requirement to keep the USD <strong>solvent.</strong> In the event they are not able to locate the required collateral even once the currency could collapse overnight. And as USD is the reserve   currency most other currencies would as well including I fear cryptocurrencies as it is still dependent on the dollar for liquidity. This is the <strong>absolute worst case scenario</strong> and also <strong>the least likely</strong> as the Fed would do literally anything to prevent that from happening. I will be grossly oversimplifying this concept due to the sheer complexity involved. If you wish to know the full nuances I have posted the title of a post on a sub that does not allow linking above.*</p>\n\n<p>The Reverse Repo works by the FED essentially loaning a portion of its own treasury supply (collateral) to the applying fund for a period of about 24 hours in exchange for US dollars (liquidity) before that treasury must be returned. However going by the musical chairs theme we seem to be seeing, that treasury is then immediately loaned back to the  borrowing institution until either the event that required the collateral has passed, indefinitely if the situation is stagnant, or until the FED can no longer supply sufficient treasuries. You can see in the image above that that at the start of the COVID-19 Pandemic regardless of what you believe about its origins and the current social state of the country the Reverse Repo immediately shot up like a  Cannon. We will get into some of the reasons why as we go on. The total  amount of funds that are being parked at the FED overnight has just passed 1.1 Trillion $.  And it will continue going up for a number of  Reasons, but  primarily there are three really big ones and we are going parabolic as the Congressional Budget Office admits inflation and the  GDP will &quot;surpass its maximum sustainable level by the end of the  year&quot;.  <a href=\"https://www.cbo.gov/publication/57263\">https://www.cbo.gov/publication/57263</a></p>\n\n<p>Meaning the game of musical chairs will get turned to 11 until when the music stops there are no more chairs.</p>\n\n<p>These reasons are as follows taken from the post referenced above.</p>\n\n<blockquote>\n<p>Loss of Faith in Primary Dealers/Repo Counterparties- Bank Credit Contraction beginning. CDS Rising.Collateral Supply Shortage- Caused by the Treasury drawing down the TGA (Treasury  General Account) and hitting the Debt Ceiling (Treasury not issuing more bills/bonds). SLR exemption expired. Massive Treasury Demand- Spawned by “flight to quality” from FIs, Fed   continues to pump  $120B a month into the banking system. The Fed is EATING the Treasury  Market.</p>\n</blockquote>\n\n<ol>\n<li>Banks   have stopped giving out new loans despite the FED printing money like crazy and giving it directly to the banks for nothing. <del>Wells Fargo has stopped personal lines of credit</del> (apparently the reinstated it<del>)</del>, JP Morgan chase is hoarding cash, and that ties directly back to the Covid-19 Stimulus. That money was meant to prop up the economy and help the average person weather this storm but none of it has been given out. Real inflation is closer to 12-14% and banks are directly hurt by inflation because it devalues loans. This is one of the arguments people use to say that inflation is good. Also credit contraction is a historical sign of an impending market crash. Banks credit risks are skyrocketing and practice something that is the center of almost all of the market corruption and &quot;growth&quot; you have seen is <strong>rehypothecation</strong> a similar process is known as fractional reserve banking. A process by   which a financial institution sells the same asset to X number of people. On paper each individual owns the same asset and they are the only owner. Imagine if you will a car salesman selling the same car to a hundred people and mandating that you cannot take possession of it and if you want to use it you have to give them notice to take it out for a   day. What happens when two people want the same day? The dealer cannot tell either driver that they cannot have the vehicle for the day. The same analogy applies to treasuries. Default happens when the paradox comes due for fruition. The MMF`s cannot afford that. So they park their money at the FED for a flat rate of interest of 0.05% because Fed treasuries cannot be rehypothecated and the FED cannot default removing counterparty risk.</li>\n<li>The Debt ceiling was not raised this past July. As the treasury is draining its general fund it only has enough to at most last 10 more days at  current average daily drain. (This is also a crash catalyst due to the precarious state of the market) And congress is on Vacation until mid  September. No more new treasuries can be made until it is or next years tax funding comes in. Which means whatever treasuries are in  the system  are whats available. And the FED is vacuuming all of them up for itself. Still pumping $120 Billion into the system monthly.</li>\n</ol>\n\n<p><em>&quot;The</em> <a href=\"https://www.risk.net/definition/supplementary-leverage-ratio-slr\"><em>SLR (Supplementary Leverage Ratio)</em></a> <em>is the U.S. version of BASEL-III capital adequacy norm and a Tier-1 leverage ratio; it varies from 3-5% common equity capital U.S. banks must maintain relative to their total leverage exposure. This is like a backstop to risk-weighted capital requirements”</em></p>\n\n<ol>\n<li>  With the SLR exemption expiring in March of this year Banks are scrambling for collateral with the expiration of a Covid-19 collateral exemption normally to back their margin they must have at least 3 to 5 % of assets compared to liabilities. This means they could have a  balance sheet of 100% liabilities. Their Margin could be unlimited. While in practice it did not go to that extreme banks did take the opportunity to ratchet up their leverage. With the expiration of the exemption banks had to scramble to find collateral to park at the FED and leave it there. It cannot be withdrawn only moved between accounts. The FED is not allowed to use this collateral, only its own so it sits there to maintain SLR but as credit defaults happen and bank margin increases more collateral must be added to the pile proportional to liabilities. This competes with the FED.</li>\n</ol>\n\n<p>What does this have to do with Crypto?</p>\n\n<p>If Fiat currency collapses crypto will too. Though that is the worst case scenario and they will simply let the banks default before they let the MMF`s. I see three scenarios; Someone more knowledgeable about the crypto market and its economics will need to chime in if I am missing   something or there was a factor I missed.</p>\n\n<ol>\n<li>Due to Asset hyperinflation and the FED needing to make the money printer go Brr to pay off all of the margin debt I can see the bull market extending to Mars due to Asset hyperinflation. Good news, you will have time to move liquidity from Crypto to hard assets that retain value faster than the numbers can lose value as inflation is not that fast.   Everyone will be scrambling to put their money in the Crypto space as assets cannot be rehypothecated. This may be a Pyhric victory.</li>\n<li>Due to institutions being so overleveraged they will be forced to liquidate their assets to cover margin obligations which will tank the market and may even destroy it. Perma bear market incoming and we are  all screwed.</li>\n<li>It  does not effect Crypto and companies are able to move their Crypto holdings to shell companies to avoid loss as they do with market crashes. Effectively continuing the current bull market or simply trade sideways. Though the effective value of the gains would cancel out at best or represent a marginal return.</li>\n</ol>\n\n<p>In any case this is not Financial Advice but I would wait until the end of august to start taking profits and begin moving coins I am holding for the long term to cold storage to avoid loss due to exchange failure.</p>\n\n<p>Part two will cover the leverage of Financial institutions and the abuse of Covid Relief funds as well as the corruption of the markets and rehypothecation.</p>\n\n<p>Edit: Copy edited post and crossed out one outdated piece of info.</p>\n\n<p>Tell me what you think.</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/DUWiXjDRp66LhOCjD0mpUWzIK55Pbm0WYEbGYSAYZAU.jpg?auto=webp&s=3428c8467a98ed63cb803bc52bd3444055d42ec4",
          "width": 3000,
          "height": 2001
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/DUWiXjDRp66LhOCjD0mpUWzIK55Pbm0WYEbGYSAYZAU.jpg?width=108&crop=smart&auto=webp&s=12f030956ac0f7c4a1622b46064b91504f50c3c4",
            "width": 108,
            "height": 72
          },
          {
            "url": "https://external-preview.redd.it/DUWiXjDRp66LhOCjD0mpUWzIK55Pbm0WYEbGYSAYZAU.jpg?width=216&crop=smart&auto=webp&s=9e3f521737d62ea0d70ddbde50ac0f0c36cde64f",
            "width": 216,
            "height": 144
          },
          {
            "url": "https://external-preview.redd.it/DUWiXjDRp66LhOCjD0mpUWzIK55Pbm0WYEbGYSAYZAU.jpg?width=320&crop=smart&auto=webp&s=57988efd0247b61cee1cc721e246e10912a2d573",
            "width": 320,
            "height": 213
          },
          {
            "url": "https://external-preview.redd.it/DUWiXjDRp66LhOCjD0mpUWzIK55Pbm0WYEbGYSAYZAU.jpg?width=640&crop=smart&auto=webp&s=353cfd33ddcfc1f0ecc8b543ac0271a488acd135",
            "width": 640,
            "height": 426
          },
          {
            "url": "https://external-preview.redd.it/DUWiXjDRp66LhOCjD0mpUWzIK55Pbm0WYEbGYSAYZAU.jpg?width=960&crop=smart&auto=webp&s=4a97076eae497df902a0f167a441921abe0c4630",
            "width": 960,
            "height": 640
          },
          {
            "url": "https://external-preview.redd.it/DUWiXjDRp66LhOCjD0mpUWzIK55Pbm0WYEbGYSAYZAU.jpg?width=1080&crop=smart&auto=webp&s=ed8414ed1826bf03b293ed953754c42c1ca1752a",
            "width": 1080,
            "height": 720
          }
        ],
        "variants": {},
        "id": "-tdAFjJmpTkLL8YrSBX9RrAPE00lxDFHz2IP3afhKw4"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/p9xoqw/the_global_economic_collapse_the_hows_and_the/",
  "subreddit": "CryptoCurrency",
  "id": "p9xoqw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Foreword:\n\nA market crash comparable in scope to the great depression is almost a certainty\nin the next few months due to decades of over-leveraging and irresponsible\nfiscal policy. Holders should begin moving their coins off of exchanges and into\npersonal wallets immediately to prevent loss in case…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "序文です。\n\n世界大恐慌に匹敵する規模の市場暴落は、今後数ヶ月のうちにほぼ確実に起こり得る。\n数十年にわたる過剰なレバレッジと無責任な財政政策のために、今後数ヶ月のうちに\n数十年にわたる過剰なレバレッジと無責任な財政政策により、今後数ヶ月のうちに大恐慌に匹敵するような市場の暴落がほぼ確実に起こります。ホルダーの皆様は、万が一の損失を防ぐために、すぐにコインを取引所から個人の財布に移してください。\n万が一の損失を防ぐために、すぐにコインを取引所から個人の財布に移してください。",
      "title": "世界経済の崩壊：その方法と理由、そして暗号への影響について Part 1: デリバティブと量的緩和"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "前言。\n\n一场规模堪比大萧条的市场崩溃几乎已成定局\n由于几十年来的过度杠杆化和不负责任的\n财政政策。持币者应立即开始将他们的硬币从交易所转移到\n个人钱包，以防止损失，以防...",
      "title": "全球经济崩溃；如何和为什么，以及它可能对加密货币产生的影响第一部分。衍生品和量化宽松"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "前言。\n\n一場規模堪比大蕭條的市場崩潰幾乎已成定局\n由於幾十年來的過度槓桿化和不負責任的\n財政政策。持幣者應立即開始將他們的硬幣從交易所轉移到\n個人錢包，以防止損失，以防...",
      "title": "全球經濟崩潰；如何和爲什麼，以及它可能對加密貨幣產生的影響第一部分。衍生品和量化寬鬆"
    }
  ]
}