{
  "author": "adamdmn",
  "original_created_utc": 1637273368,
  "title": "Moon week is approaching so don’t forget to HODL your Moons to get a +20% Moons Bonus in the next Distribution!",
  "created_utc": 1637307026,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello everyone,</p>\n\n<p>I know OGs already know that tip but many new people don’t know yet that every month, you got +20% on the distributed moons if you hodled and didn’t touch your moons during the previous month!</p>\n\n<p>And for the ones who don’t know how to get moons, you have to open your vault on the reddit app and you’ll get moons by receiving upvotes on your posts and comments in <a href=\"/r/cryptocurrency\">r/cryptocurrency</a>, it’s as simple as that! <a href=\"https://www.reddit.com/vault/\">(you can also just click here)</a></p>\n\n<p>I wish you all lots of moons, and moons to the moon!</p>\n\n<p>And remember, every day, Mainnet is closer than it’s ever been\nGod bless :)</p>\n\n<p>P.S: don’t forget the incredible moon faucet, it’s free, and available <a href=\"https://www.moonfaucet.cc/\">here</a></p>\n</div><!-- SC_ON -->",
  "score": 194,
  "permalink": "/r/CryptoCurrency/comments/qx0ys3/moon_week_is_approaching_so_dont_forget_to_hodl/",
  "subreddit": "CryptoCurrency",
  "id": "qx0ys3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hello everyone,\n\nI know OGs already know that tip but many new people don’t know yet that every\nmonth, you got +20% on the distributed moons if you hodled and didn’t touch your\nmoons during the previous month!\n\nAnd for the ones who don’t know how to get moons, you have to open your vault on\nthe…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。\n\nOGの皆さんはすでにご存知だと思いますが、まだ知らない方も多いのではないでしょうか。\n毎月、前月に自分のムーンに触れずにホーディングした場合、配布されたムーンに+20%されます。\n配布された月のうち、前月に自分の月を触らずにホーディングしていた人は、その月に配布された月に+20%されます\n\nムーンの入手方法を知らない人のために説明しますと、前月に金庫を開けて\nをしてください。",
      "title": "ムーンウィークが近づいているので、次のディストリビューションで+20%のムーンボーナスを得るために、ムーンをHODLすることをお忘れなく!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。\n\n我知道OG已经知道了这个提示，但是很多新人还不知道，每个月，如果你不碰你的月球，你就可以得到+20%的分配月球。\n月，如果你在上个月没有碰过你的月球，你就可以在分发的月球上得到+20%的奖励。\n月亮，你就可以得到20%的分配月亮。\n\n对于那些不知道如何获得月亮的人来说，你必须打开你的金库在\n在......\"。",
      "title": "月亮周即将到来，所以别忘了在下一次派发中，将你的月亮点亮，以获得+20%的月亮奖励。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。\n\n我知道OG已經知道了這個提示，但是很多新人還不知道，每個月，如果你不碰你的月球，你就可以得到+20%的分配月球。\n月，如果你在上個月沒有碰過你的月球，你就可以在分發的月球上得到+20%的獎勵。\n月亮，你就可以得到20%的分配月亮。\n\n對於那些不知道如何獲得月亮的人來說，你必須打開你的金庫在\n在......\"。",
      "title": "月亮周即將到來，所以別忘了在下一次派發中，將你的月亮點亮，以獲得+20%的月亮獎勵。"
    }
  ]
}