{
  "author": "ArticWolf12",
  "original_created_utc": 1640096066,
  "title": "Enforcing vegan food in the work place?",
  "created_utc": 1640104212,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Preface this, I just started a new job. I’m 20 and I’m in the UK, now anyways&lt;/p&gt;\n\n&lt;p&gt;Started working at this place and we’ve been told to not eat ANY food that isn’t vegan, in the middle of winter.\nI’m not a vegan and also not interested in becoming vegan it feels like this is wrong? Apparently it’s a sackable offence which baffles me as it’s the only place I’ve ever heard of that does this&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/TooAfraidToAsk/comments/rlfjo8/enforcing_vegan_food_in_the_work_place/",
  "subreddit": "TooAfraidToAsk",
  "id": "rlfjo8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Preface this, I just started a new job. I’m 20 and I’m in the UK, now anyways\n\nStarted working at this place and we’ve been told to not eat ANY food that isn’t\nvegan, in the middle of winter. I’m not a vegan and also not interested in\nbecoming vegan it feels like this is wrong? Apparently it’s a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "前置きが長くなりましたが、私は新しい仕事を始めたばかりです。私は20歳でイギリスにいます、今はとにかく\n\nこの職場で働き始めたのですが、私たちは、それ以外の食品を一切食べないように言われました。\n真冬に、ビーガン。私はヴィーガンではありませんし、また、ヴィーガンに興味があるわけでもありません。\nヴィーガンになるのは、間違っているような気がするのですが？どうやら、これは...",
      "title": "職場でビーガン食を強制する？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "前言：我刚刚开始一份新的工作。我20岁，我在英国，现在无论如何\n\n开始在这个地方工作，我们被告知不能吃任何不是素食的食物，在冬天。\n素食主义者，在冬天的时候。我不是一个素食主义者，也对成为素食主义者不感兴趣。\n我不是素食主义者，也没有兴趣成为素食主义者，但我觉得这是不对的？显然，这是一个...",
      "title": "在工作场所强制推行素食？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "前言：我剛剛開始一份新的工作。我20歲，我在英國，現在無論如何\n\n開始在這個地方工作，我們被告知不能喫任何不是素食的食物，在冬天。\n素食主義者，在冬天的時候。我不是一個素食主義者，也對成爲素食主義者不感興趣。\n我不是素食主義者，也沒有興趣成爲素食主義者，但我覺得這是不對的？顯然，這是一個...",
      "title": "在工作場所強制推行素食？"
    }
  ]
}