{
  "author": "Fuzzy-Pollution-3883",
  "the_new_excerpt": "I was mostly convinced about the media manipulation. All the stuff we've talked\nabout and seen, but there was a part of me thinking that we was just in an echo\nchamber, parroting ourselves. Until today. All day I've seen a news article on\nyahoo with the title \"Trader arrested as Gamestop soars\" . I…",
  "original_created_utc": 1615589717,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "对于媒体的操纵，我大多深信不疑。所有的东西，我们已经谈到\n但有一部分的我认为，我们只是在一个回声中。\n室，鹦鹉学舌。直到今天。一整天我都在新闻上看到了一篇关于\n雅虎的标题是 \"Gamestop飙升，交易员被捕\" 。I…",
      "title": "这一件事最能让我相信这是真的。而且我们正在赢。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對於媒體的操縱，我大多深信不疑。所有的東西，我們已經談到\n但有一部分的我認爲，我們只是在一個回聲中。\n室，鸚鵡學舌。直到今天。一整天我都在新聞上看到了一篇關於\n雅虎的標題是 \"Gamestop飆升，交易員被捕\" 。I…",
      "title": "這一件事最能讓我相信這是真的。而且我們正在贏。"
    }
  ],
  "title": "This one thing has done the most to convince me this is real. And we are winning.",
  "created_utc": 1615624171,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was mostly convinced about the media manipulation. All the stuff we&#39;ve talked about and seen, but there was a part of me thinking that we was just in an echo chamber, parroting ourselves. Until today. All day I&#39;ve seen a news article on yahoo with the title &quot;Trader arrested as Gamestop soars&quot; . I know because I clicked the article about 20 times. I was confused as it was just a story about a Japanese guy getting arrested years ago. I kept clicking the story thinking something was bugged. But now after market closes the title has changed. To how the gamestop situation echoes a situation years ago when someone was arrested. The intent is clear. Scare people away from GME. It reeks of desperation. They&#39;re grasping at straws. Apes we are winning.</p>\n</div><!-- SC_ON -->",
  "score": 6087,
  "permalink": "/r/wallstreetbets/comments/m3te37/this_one_thing_has_done_the_most_to_convince_me/",
  "subreddit": "wallstreetbets",
  "id": "m3te37",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147389883
}