{
  "author": "Abigail_grace_styles",
  "original_created_utc": 1638596905,
  "title": "Does it get better?",
  "created_utc": 1638607725,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m a 22 year old female who lives with her dog in a apartment. I work from home and probably leave the house 3 times a week. I’m single and have been for 2 years. I do the same thing over and over again. I would hangout with my friends but I have 2 and they’re both married and one has a kid. I also live paycheck to paycheck and over all my life is just pretty shitty at the moment. I’m overweight, but I have lost 35 pounds but I just don’t feel like it’s enough. I need to lose more. If it wasn’t for my dog and my family I wouldn’t be here. I also got diagnosed with border line personality disorder a month ago and I smoke weed on a daily because that’s the only thing that makes me feel some type of serotonin… so my question is; Does life get better? I’m just so lost in the world, I know nothing about me, I’m not sure of my purpose in life.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 113,
  "permalink": "/r/NoStupidQuestions/comments/r8iuak/does_it_get_better/",
  "subreddit": "NoStupidQuestions",
  "id": "r8iuak",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m a 22 year old female who lives with her dog in a apartment. I work from home\nand probably leave the house 3 times a week. I’m single and have been for 2\nyears. I do the same thing over and over again. I would hangout with my friends\nbut I have 2 and they’re both married and one has a kid. I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は22歳の女性で、犬と一緒にアパートで暮らしています。自宅で仕事をしています。\n週に3回くらいは家を出ています。私は独身で、2年間ずっと\n年です。私は同じことを何度も何度も繰り返しています。友達と遊んだり\nが、2人いるのですが、2人とも結婚していて、1人には子供がいます。I...",
      "title": "良くなるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个22岁的女性，和她的狗住在一个公寓里。我在家里工作\n可能每周离开家3次。我是单身，已经有两年\n年了。我一遍又一遍地做同样的事情。我会和我的朋友们一起玩耍\n但我有两个，他们都结婚了，其中一个有孩子。I...",
      "title": "它是否会变得更好？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個22歲的女性，和她的狗住在一個公寓裏。我在家裏工作\n可能每週離開家3次。我是單身，已經有兩年\n年了。我一遍又一遍地做同樣的事情。我會和我的朋友們一起玩耍\n但我有兩個，他們都結婚了，其中一個有孩子。I...",
      "title": "它是否會變得更好？"
    }
  ]
}