{
  "author": "DaviddavitoEats",
  "original_created_utc": 1653081728,
  "title": "I might go to prison for 5 years, I get one statement to the judge. What do I say, and how, in a last ditch to save my life?",
  "created_utc": 1653102010,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In dec 2021 I was caught with marijuana(5-10lbs), I was 19, now 20. I’m in WI, with very strict laws, very conservative DA. Yesterday was read a guilty verdict(poss with intent to distribute), with   Sentencing on June 1.&lt;/p&gt;\n\n&lt;p&gt;I grew up poor, couldn’t afford opportunity, and I made a bad decision rooted in desperation. I was offered a plea deal in pre-trial for one and a half years. I declined and took it to trial. Prosecutor is looking for max sentence because of rising drug figures in the county, presumably to make an example out of me, 5 years, with no record.&lt;/p&gt;\n\n&lt;p&gt;What are some talking points I can hit on, in my 5mins I get to speak directly to the judge? I don’t want an entire script, I just need to sound articulate, somewhat intelligent, and not appear to be a complete bottom feeder. My life hangs on it.&lt;/p&gt;\n\n&lt;p&gt;Thank you&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 206,
  "permalink": "/r/NoStupidQuestions/comments/uu82h4/i_might_go_to_prison_for_5_years_i_get_one/",
  "subreddit": "NoStupidQuestions",
  "id": "uu82h4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In dec 2021 I was caught with marijuana(5-10lbs), I was 19, now 20. I’m in WI,\nwith very strict laws, very conservative DA. Yesterday was read a guilty\nverdict(poss with intent to distribute), with Sentencing on June 1.\n\nI grew up poor, couldn’t afford opportunity, and I made a bad decision rooted…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2021年12月にマリファナ(5-10lbs)で捕まりました。私はウィスコンシン州に住んでいます。\n非常に厳しい法律で、非常に保守的な検察です。昨日、有罪の評決を読みました。\nの評決が下され、6月1日に判決が言い渡されました。\n\n私は貧しく育ち、機会に恵まれず、誤った決断をした。",
      "title": "5年間刑務所に入るかもしれないのに、裁判官に一回だけ声明が出せるんだ。命を守るための最後の切り札として、何を、どう言えばいいのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "2021年12月，我被抓到携带大麻（5-10磅），当时我19岁，现在20岁。我在威斯康星州。\n有非常严格的法律，非常保守的检察官。昨天我被宣读了一个有罪的\n判决（持有并意图分销），6月1日判刑。\n\n我从小就很穷，没有机会，我做了一个错误的决定。",
      "title": "我可能会入狱5年，我可以向法官陈述一次。我应该说些什么，如何说，以挽救我的生命的最后一搏？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "2021年12月，我被抓到攜帶大麻（5-10磅），當時我19歲，現在20歲。我在威斯康星州。\n有非常嚴格的法律，非常保守的檢察官。昨天我被宣讀了一個有罪的\n判決（持有並意圖分銷），6月1日判刑。\n\n我從小就很窮，沒有機會，我做了一個錯誤的決定。",
      "title": "我可能會入獄5年，我可以向法官陳述一次。我應該說些什麼，如何說，以挽救我的生命的最後一搏？"
    }
  ]
}