{
  "author": "Tacoless_meat",
  "original_created_utc": 1653681380,
  "title": "In a recent post about turn-offs, so many women mentioned poor hygiene. What is the worst example of this you have experienced on a date or in a relationship?",
  "created_utc": 1653706240,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Honestly I was shocked that it was mentioned so often. I thought showered, trimmed, clean clothes when not working, and tidy was common sense and should go without mention. So I am at a loss imagining an unhygienic date or partner. What has been the worst thing you have experienced in regards to hygeine?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 170,
  "permalink": "/r/AskWomen/comments/uz6drx/in_a_recent_post_about_turnoffs_so_many_women/",
  "subreddit": "AskWomen",
  "id": "uz6drx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Honestly I was shocked that it was mentioned so often. I thought showered,\ntrimmed, clean clothes when not working, and tidy was common sense and should go\nwithout mention. So I am at a loss imagining an unhygienic date or partner. What\nhas been the worst thing you have experienced in regards to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "正直、よく言われることなのでショックでした。シャワーを浴びる。\nを整え、仕事以外では清潔な服を着て、整理整頓をするのは常識だと思っていました。\nと思っていました。だから、不衛生なデートや相手を想像すると、途方に暮れてしまうのです。これまで\n今まで経験した中で一番嫌だったことは？",
      "title": "先日の嫌われ者についての記事で、多くの女性が不衛生を挙げていましたね。あなたがデートや交際中に経験した最悪の例は何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "说实话，我很震惊，它被如此频繁地提及。我以为洗澡、修剪、不工作时穿干净的衣服和整洁是常识，应该是常识。\n修剪，不工作时穿上干净的衣服，以及整洁，这些都是常识，应该不需要提及。\n不提也罢。所以我无法想象一个不讲卫生的约会对象或伴侣。你经历过的最糟糕的事情是什么？\n你所经历的最糟糕的事情是什么？",
      "title": "在最近的一篇关于拒绝的文章中，有很多女性提到了卫生状况不佳。你在约会或恋爱中遇到的最糟糕的例子是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "說實話，我很震驚，它被如此頻繁地提及。我以爲洗澡、修剪、不工作時穿乾淨的衣服和整潔是常識，應該是常識。\n修剪，不工作時穿上乾淨的衣服，以及整潔，這些都是常識，應該不需要提及。\n不提也罷。所以我無法想象一個不講衛生的約會對象或伴侶。你經歷過的最糟糕的事情是什麼？\n你所經歷的最糟糕的事情是什麼？",
      "title": "在最近的一篇關於拒絕的文章中，有很多女性提到了衛生狀況不佳。你在約會或戀愛中遇到的最糟糕的例子是什麼？"
    }
  ]
}