{
  "author": "MaxMaxMax_05",
  "the_new_excerpt": "The Romans conquered Britannia at one point in history. Britain, except for\nScotland was under Roman rule from 84 AD - 410 AD, 326 years. While a Vulgar\nLatin dialect existed, it died out 300 years after the Romans left. Why did\nBritish Latin die out while many other languages were able to…",
  "original_created_utc": 1617860479,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ローマ人がブリタニアを征服したこともあったそうです。スコットランドを除くイギリスは\nスコットランドを除くイギリスは、西暦84年から西暦410年までの326年間、ローマ帝国の支配下にありました。ヴルガー・ラテン語の方言が存在していましたが\nラテン語の方言が存在していましたが、ローマ人が去ってから300年後に消滅しました。なぜ\nブリティッシュ・ラテン語は消滅してしまったのでしょうか...",
      "title": "なぜイギリスのVulgar Latinは生き残れなかったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "罗马人在历史上曾经征服过不列颠。英国，除了\n苏格兰从公元84年--公元410年，326年处于罗马统治之下。虽然一个瓦加\n拉丁语方言是存在的，它在罗马人离开后300年就消亡了。为什么\n英国拉丁语消亡，而其他许多语言却能...",
      "title": "为什么英国的Vulgar拉丁语没有存活下来？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "羅馬人在歷史上曾經征服過不列顛。英國，除了\n蘇格蘭從公元84年--公元410年，326年處於羅馬統治之下。雖然一個瓦加\n拉丁語方言是存在的，它在羅馬人離開後300年就消亡了。爲什麼\n英國拉丁語消亡，而其他許多語言卻能...",
      "title": "爲什麼英國的Vulgar拉丁語沒有存活下來？"
    }
  ],
  "title": "Why didn’t British Vulgar Latin survive?",
  "created_utc": 1617881990,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The Romans conquered Britannia at one point in history. Britain, except for Scotland was under Roman rule from 84 AD - 410 AD, 326 years. While a Vulgar Latin dialect existed, it died out 300 years after the Romans left. Why did British Latin die out while many other languages were able to survive? </p>\n\n<p>While it was said that invasions destroyed the languages, I don&#39;t see that happening for other countries. France for example was invaded by the Franks who established a kingdom there and adopted the local dialect of the region they settled on. Even Romania, which had been under Roman rule from 106 AD - 275 AD, only 169 years spoke a Romance language.</p>\n\n<p>With such a long period of Roman rule, why didn&#39;t the people in Britain speak a Romance language? Why didn&#39;t the Anglo-Saxons adopt the culture of the Romans as the Franks did?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/mml1f2/why_didnt_british_vulgar_latin_survive/",
  "subreddit": "AskHistorians",
  "id": "mml1f2",
  "is_self": true,
  "media": null,
  "is_video": false
}