{
  "author": "GoldenChanterelle",
  "original_created_utc": 1635666460,
  "title": "Found 1.19 btc on old hdd, how to sell.",
  "created_utc": 1635680304,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello I found an old intact multibit wallet from 2014 with over 1.1 btc on it.</p>\n\n<p>I managed to open it up and resync in multibit (took a while) and then export the wallet key to an electrum 3.x wallet... from there to a newest version electrum wallet, so it now sits there safely.</p>\n\n<p>My financial situation is such that i really needed this and it came like a miracle, I want to sell it off at least 60% of it right away, but how do I sell it for the least amount of fees to my national fiat currency (Swedish kronor) without the tax authorities being on board accusing me of laundering money or something and so that i pay my cgt correctly or will that be arranged automatically?</p>\n\n<p>They are doing chain analysis or what it&#39;s called and people do get in trouble for it all the time. </p>\n\n<p>I haven&#39;t gotten it from anything illegal, but back in 2014 when i bought it from a major swedish btc trading site, i used it as a payment method for some bad personal-medical habits that I have since stopped doing, and i want to pay the capital gains tax and everything in accordance with the law. But I wonder if there is some way to get around the big fees that the well known user friendly trader platforms have? Like is there some way that maybe i could just get it direct contact with a person who wants to buy a lot of btc and give med swedish kronor and sidestepping trading platforms alltogether but making sure they are not going to rip me off somehow?</p>\n\n<p>edit: please I am not going to sell btc to some random individual that just makes contact with me online, i&#39;ve gotten several chat messegas since i posted this, just stop, I&#39;m not going to sell you my btc or &quot;validate&quot; my wallet... stop it</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/Bitcoin/comments/qjkpwo/found_119_btc_on_old_hdd_how_to_sell/",
  "subreddit": "Bitcoin",
  "id": "qjkpwo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hello I found an old intact multibit wallet from 2014 with over 1.1 btc on it.\n\nI managed to open it up and resync in multibit (took a while) and then export\nthe wallet key to an electrum 3.x wallet... from there to a newest version\nelectrum wallet, so it now sits there safely.\n\nMy financial…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは、私は1.1btc以上が入った2014年の古い無傷のマルチビットウォレットを見つけました。\n\nなんとか開封して、マルチビットで再同期して（時間がかかりました）、ウォレットキーをelectrum 3.xウォレットにエクスポートしました。\nウォレットキーをelectrum 3.xのウォレットにエクスポートして、そこから最新バージョンの\nウォレットキーをelectrum 3.xウォレットにエクスポートし、そこから最新バージョンのelectrumウォレットにエクスポートしました。\n\n私の財務...",
      "title": "古いHDDに1.19btcが入っていましたが、どうやって売るのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好，我发现一个2014年的旧的完整的multibit钱包，上面有超过1.1btc。\n\n我设法把它打开，在multibit中重新同步（花了点时间），然后导出\n钱包密钥到一个Electrum 3.x钱包...从那里到一个最新版本的\n电子钱包，所以它现在安全地躺在那里。\n\n我的财务...",
      "title": "在旧的硬盘上发现了1.19btc，如何出售。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好，我發現一個2014年的舊的完整的multibit錢包，上面有超過1.1btc。\n\n我設法把它打開，在multibit中重新同步（花了點時間），然後導出\n錢包密鑰到一個Electrum 3.x錢包...從那裏到一個最新版本的\n電子錢包，所以它現在安全地躺在那裏。\n\n我的財務...",
      "title": "在舊的硬盤上發現了1.19btc，如何出售。"
    }
  ]
}