{
  "author": "ichillonforums",
  "original_created_utc": 1658413480,
  "title": "This may be a stupid question, I have a car for the first time and have a q about gas",
  "created_utc": 1658424260,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I recently got a used car for the first time ever, I&amp;#39;m curious if there&amp;#39;s any way I can check how many gallons of gas I already have in there? Obviously I know how to look at the little meter on my dash that says if it&amp;#39;s closer to empty or full, but I mean how can I get an exact number? I ask because my car takes 12 gallons and I kind of want to fill the tank with exactly 12 gallons, but don&amp;#39;t want to accidentally go over capacity and have gasoline dripping out from everywhere, leaking, making a mess all over the gas station and my car and my shoes, and possibly making a hazard, and wasting all that money on wasted gas&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/w4i008/this_may_be_a_stupid_question_i_have_a_car_for/",
  "subreddit": "NoStupidQuestions",
  "id": "w4i008",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So I recently got a used car for the first time ever, I'm curious if there's any\nway I can check how many gallons of gas I already have in there? Obviously I\nknow how to look at the little meter on my dash that says if it's closer to\nempty or full, but I mean how can I get an exact number? I ask…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "で、最近初めて中古車を手に入れたんだけど、何か気になること\nガソリンが何ガロン入っているか確認する方法はありますか？もちろん、私は\nダッシュボードにある小さなメーターで確認することができます。\nでも、正確な数字を知るにはどうしたらいいんでしょう？という質問です。",
      "title": "これは愚かな質問かもしれませんが、私は初めて車を持ち、ガスについての質問を持っています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我最近第一次买了一辆二手车，我很好奇是否有任何\n我想知道是否有什么方法可以检查我已经有多少加仑的汽油？很显然，我\n我知道如何看仪表盘上的小表，上面写着是否接近空油或满油。\n空或满，但我的意思是我怎么能得到一个准确的数字？我问...",
      "title": "这可能是一个愚蠢的问题，我第一次有车，有一个关于汽油的问题。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我最近第一次買了一輛二手車，我很好奇是否有任何\n我想知道是否有什麼方法可以檢查我已經有多少加侖的汽油？很顯然，我\n我知道如何看儀表盤上的小表，上面寫着是否接近空油或滿油。\n空或滿，但我的意思是我怎麼能得到一個準確的數字？我問...",
      "title": "這可能是一個愚蠢的問題，我第一次有車，有一個關於汽油的問題。"
    }
  ]
}