{
  "author": "MBGLK",
  "original_created_utc": 1655349827,
  "title": "FYI Berkeley offers two free courses with free certification on Blockchain tech",
  "created_utc": 1655405428,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Originally posted over a year ago. Thought I’d repost for those new to the scene who are interested. &lt;/p&gt;\n\n&lt;p&gt;Berkeley offers 4 courses on the subject, all free to access, 2 with certificates. Berkeley has been involved with blockchain a bit longer than MIT, and having taken the MIT Sloan course and Berkeley edX courses myself I can say that Berkeley is quite a bit more informative on the cryptocurrency and the technical side of things.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://blockchain.berkeley.edu/courses/\"&gt;https://blockchain.berkeley.edu/courses/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;2 are courses are offered through edX that have optional paid certificates available.&lt;/p&gt;\n\n&lt;p&gt;2 are courses they offer through University that have publicly accessible course materials on their decal page.&lt;/p&gt;\n\n&lt;p&gt;The first two are part of a larger EdX “ Professional Certificate in Blockchain Fundamentals”.  In includes both classes and a larger “Professional” certification for $178.  Each class is available independently with individual certifications for $99.  Both classes can be “audited” for free, giving you access to the educational materials: &lt;a href=\"https://www.edx.org/professional-certificate/uc-berkeleyx-blockchain-fundamentals\"&gt;https://www.edx.org/professional-certificate/uc-berkeleyx-blockchain-fundamentals&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;The second is a couple of “student run” accredited classes on-campus with Berkley, but the educational materials are available for free for anyone.  Archives to multiple semesters available: &lt;a href=\"https://blockchain.berkeley.edu/courses/archive/\"&gt;https://blockchain.berkeley.edu/courses/archive/&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 314,
  "permalink": "/r/CryptoCurrency/comments/vdcc03/fyi_berkeley_offers_two_free_courses_with_free/",
  "subreddit": "CryptoCurrency",
  "id": "vdcc03",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Originally posted over a year ago. Thought I’d repost for those new to the scene\nwho are interested.\n\nBerkeley offers 4 courses on the subject, all free to access, 2 with\ncertificates. Berkeley has been involved with blockchain a bit longer than MIT,\nand having taken the MIT Sloan course and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "原文は1年以上前に投稿されたものです。初めて見る人のために再投稿しておこうと思った\nのために再投稿しました。\n\nバークレー校では、このテーマで4つのコースを提供しており、すべて無料でアクセスでき、2つは\n証明書を発行しています。バークレー校はMITより少し長くブロックチェーンに携わっています。\nMIT Sloanのコースを受講し、...",
      "title": "参考 バークレー校、ブロックチェーン技術に関する無料資格取得コースを2つ提供"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "原文是一年多前发布的。我想我应该为那些刚到现场的人重新张贴\n有兴趣的人。\n\n伯克利大学提供了4门关于这个主题的课程，都是免费的，其中2门有证书。\n证书。伯克利大学涉及区块链的时间比麻省理工学院长一些。\n而且在参加了麻省理工学院斯隆课程和...",
      "title": "参考消息》伯克利分校提供两门免费课程，并提供区块链技术的免费认证"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "原文是一年多前發佈的。我想我應該爲那些剛到現場的人重新張貼\n有興趣的人。\n\n伯克利大學提供了4門關於這個主題的課程，都是免費的，其中2門有證書。\n證書。伯克利大學涉及區塊鏈的時間比麻省理工學院長一些。\n而且在參加了麻省理工學院斯隆課程和...",
      "title": "參考消息》伯克利分校提供兩門免費課程，並提供區塊鏈技術的免費認證"
    }
  ]
}