{
  "author": "MBGLK",
  "original_created_utc": 1655349827,
  "title": "FYI Berkeley offers two free courses with free certification on Blockchain tech",
  "created_utc": 1655405428,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Originally posted over a year ago. Thought I’d repost for those new to the scene who are interested. &lt;/p&gt;\n\n&lt;p&gt;Berkeley offers 4 courses on the subject, all free to access, 2 with certificates. Berkeley has been involved with blockchain a bit longer than MIT, and having taken the MIT Sloan course and Berkeley edX courses myself I can say that Berkeley is quite a bit more informative on the cryptocurrency and the technical side of things.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://blockchain.berkeley.edu/courses/\"&gt;https://blockchain.berkeley.edu/courses/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;2 are courses are offered through edX that have optional paid certificates available.&lt;/p&gt;\n\n&lt;p&gt;2 are courses they offer through University that have publicly accessible course materials on their decal page.&lt;/p&gt;\n\n&lt;p&gt;The first two are part of a larger EdX “ Professional Certificate in Blockchain Fundamentals”.  In includes both classes and a larger “Professional” certification for $178.  Each class is available independently with individual certifications for $99.  Both classes can be “audited” for free, giving you access to the educational materials: &lt;a href=\"https://www.edx.org/professional-certificate/uc-berkeleyx-blockchain-fundamentals\"&gt;https://www.edx.org/professional-certificate/uc-berkeleyx-blockchain-fundamentals&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;The second is a couple of “student run” accredited classes on-campus with Berkley, but the educational materials are available for free for anyone.  Archives to multiple semesters available: &lt;a href=\"https://blockchain.berkeley.edu/courses/archive/\"&gt;https://blockchain.berkeley.edu/courses/archive/&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 314,
  "permalink": "/r/CryptoCurrency/comments/vdcc03/fyi_berkeley_offers_two_free_courses_with_free/",
  "subreddit": "CryptoCurrency",
  "id": "vdcc03",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Originally posted over a year ago. Thought I’d repost for those new to the scene\nwho are interested.\n\nBerkeley offers 4 courses on the subject, all free to access, 2 with\ncertificates. Berkeley has been involved with blockchain a bit longer than MIT,\nand having taken the MIT Sloan course and…"
}