{
  "author": "TendingTheirGarden",
  "original_created_utc": 1648993104,
  "title": "Dante's 'Divine Comedy' features 8 verses written in Occitan, while the rest is in Italian. Today, Occitan is not widely spoken and is scarcely known. What was Occitan's cultural significance at the time of Dante's writing, and why did it lose prominence in the centuries after?",
  "created_utc": 1649004332,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My question was prompted by &lt;a href=\"https://www.youtube.com/watch?v=p8qdqAE5ZKA\"&gt;this wonderful video&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;I can think of two factors:&lt;/p&gt;\n\n&lt;p&gt;1.) Occitan-speaking regions&amp;#39; absorption into France following the Albigensian Crusade and the reduction of its cultural prominence (and that of cities like Bordeaux&amp;#39;s prominence) in favor of the Kingdom of France.&lt;/p&gt;\n\n&lt;p&gt;2.) The intentional eradication of regional languages in continental France following the French Revolution, which radically reduced the prevalence of Basque, Breton, Occitan, and other regional languages once common throughout France. This was done to enable the bureaucratic streamlining and institutional modernization of France, but the result was a lot of suffering on the part of speakers of those languages that were acknowledged by the Republic but not deemed official.&lt;/p&gt;\n\n&lt;p&gt;But I imagine it goes deeper than that, if the language had enough cultural cachet to influence Dante. Thank you in advance!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 110,
  "permalink": "/r/AskHistorians/comments/tv9gz2/dantes_divine_comedy_features_8_verses_written_in/",
  "subreddit": "AskHistorians",
  "id": "tv9gz2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "My question was prompted by this wonderful video\n[https://www.youtube.com/watch?v=p8qdqAE5ZKA].\n\nI can think of two factors:\n\n1.) Occitan-speaking regions' absorption into France following the Albigensian\nCrusade and the reduction of its cultural prominence (and that of cities like\nBordeaux's…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の質問のきっかけは、この素晴らしいビデオです。\n[https://www.youtube.com/watch?v=p8qdqAE5ZKA】。］\n\n要因は2つ考えられます。\n\n1.) オクシタン語圏がアルビジェンヌ朝以降、フランスに吸収されたこと。\n十字軍とその文化的優位性の低下（そして、そのような都市の\nボルドーの...",
      "title": "ダンテの「神曲」は、8節がオック語で書かれており、残りはイタリア語である。現在、オック語はあまり使われておらず、知名度もほとんどない。ダンテが執筆した当時、オック語はどのような文化的意味を持ち、その後数世紀の間になぜ重要性を失ったのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的问题是由这个精彩的视频引发的\n[https://www.youtube.com/watch?v=p8qdqAE5ZKA]。\n\n我可以想到两个因素。\n\n1.) 奥克西坦语地区在阿尔比根十字军东征后被吸收到法国，并减少了其文化。\n十字军东征后，奥克西坦语区被吸收到法国，其文化地位下降（以及像波尔多这样的城市的文化地位下降...\n波尔多的...",
      "title": "但丁的 \"神曲 \"有8首诗是用奥克语写的，其余的是意大利语。今天，奥克语没有被广泛使用，也几乎不为人所知。在但丁写作的时候，奥克语的文化意义是什么，为什么在之后的几个世纪里它失去了突出的地位？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的問題是由這個精彩的視頻引發的\n[https://www.youtube.com/watch?v=p8qdqAE5ZKA]。\n\n我可以想到兩個因素。\n\n1.) 奧克西坦語地區在阿爾比根十字軍東征後被吸收到法國，並減少了其文化。\n十字軍東征後，奧克西坦語區被吸收到法國，其文化地位下降（以及像波爾多這樣的城市的文化地位下降...\n波爾多的...",
      "title": "但丁的 \"神曲 \"有8首詩是用奧克語寫的，其餘的是意大利語。今天，奧克語沒有被廣泛使用，也幾乎不爲人所知。在但丁寫作的時候，奧克語的文化意義是什麼，爲什麼在之後的幾個世紀裏它失去了突出的地位？"
    }
  ]
}