{
  "author": "TendingTheirGarden",
  "original_created_utc": 1648993104,
  "title": "Dante's 'Divine Comedy' features 8 verses written in Occitan, while the rest is in Italian. Today, Occitan is not widely spoken and is scarcely known. What was Occitan's cultural significance at the time of Dante's writing, and why did it lose prominence in the centuries after?",
  "created_utc": 1649004332,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My question was prompted by &lt;a href=\"https://www.youtube.com/watch?v=p8qdqAE5ZKA\"&gt;this wonderful video&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;I can think of two factors:&lt;/p&gt;\n\n&lt;p&gt;1.) Occitan-speaking regions&amp;#39; absorption into France following the Albigensian Crusade and the reduction of its cultural prominence (and that of cities like Bordeaux&amp;#39;s prominence) in favor of the Kingdom of France.&lt;/p&gt;\n\n&lt;p&gt;2.) The intentional eradication of regional languages in continental France following the French Revolution, which radically reduced the prevalence of Basque, Breton, Occitan, and other regional languages once common throughout France. This was done to enable the bureaucratic streamlining and institutional modernization of France, but the result was a lot of suffering on the part of speakers of those languages that were acknowledged by the Republic but not deemed official.&lt;/p&gt;\n\n&lt;p&gt;But I imagine it goes deeper than that, if the language had enough cultural cachet to influence Dante. Thank you in advance!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 110,
  "permalink": "/r/AskHistorians/comments/tv9gz2/dantes_divine_comedy_features_8_verses_written_in/",
  "subreddit": "AskHistorians",
  "id": "tv9gz2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "My question was prompted by this wonderful video\n[https://www.youtube.com/watch?v=p8qdqAE5ZKA].\n\nI can think of two factors:\n\n1.) Occitan-speaking regions' absorption into France following the Albigensian\nCrusade and the reduction of its cultural prominence (and that of cities like\nBordeaux's…"
}