{
  "author": "Kontikulus",
  "original_created_utc": 1645295201,
  "title": "I am sure 90% of all NFT and metaverse sales are people selling shit to themselves. 9% are morons who think they can resell a butt-ugly jpeg for more and MAYBE 1% really believes in a virtual ecosystem.",
  "created_utc": 1645310465,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It is extremely easy to inflate a price of any NFT. Create two wallets, sell with one, buy with another. You just set a price for your own NFT!&lt;/p&gt;\n\n&lt;p&gt;This alone is proof enough for me to doubt all sales on every NFT marketplace and you should too. I would stay away from all NFTs and especially the &amp;quot;established&amp;quot; and expensive ones. The prices are inflated by a couple of wealthy crypto-bros who are not wealthy enough to manipulate mid-cap coins anymore. They realized that it is incredibly easy to make idiotic Jpegs, sell them to themselves and the community will do the legwork and write articles about &amp;quot;Bored Ugly Gorilla Club for 6.000.000!!&amp;quot; and so on. This will lead to suckers buying this shit for &amp;quot;cheap&amp;quot; (bro, it&amp;#39;s only 10 ETH, bro!).&lt;/p&gt;\n\n&lt;p&gt;Is there a place for a virtual market? Undoubtedly yes, but you will not sell you ugly-ass cartoon for millions in a couple years.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 313,
  "permalink": "/r/CryptoCurrency/comments/swggxe/i_am_sure_90_of_all_nft_and_metaverse_sales_are/",
  "subreddit": "CryptoCurrency",
  "id": "swggxe",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "It is extremely easy to inflate a price of any NFT. Create two wallets, sell\nwith one, buy with another. You just set a price for your own NFT!\n\nThis alone is proof enough for me to doubt all sales on every NFT marketplace\nand you should too. I would stay away from all NFTs and especially…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "NFTの価格を吊り上げるのは至難の業です。2つのウォレットを作成し、売り\n片方で買い、もう片方で買う。自分のNFTに価格を設定するだけです\n\nこれだけで、すべてのNFTマーケットプレイスでの販売を疑うに足る証拠です。\nそして、あなたもそうすべきです。私はすべてのNFTに手を出さず、特に...",
      "title": "NFTやメタバースの売上の9割は自分自身にクソを売ってる人なんだろうな。9%は、不細工なJPEGを高く転売できると考えているバカで、1%は本当に仮想エコシステムを信じているのかもしれない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "夸大任何NFT的价格是非常容易的。创建两个钱包，卖出\n用一个，用另一个购买。你只是为你自己的NFT设定了一个价格!\n\n仅这一点就足以让我怀疑每个NFT市场上的所有销售。\n你也应该如此。我将远离所有的NFT，尤其是...",
      "title": "我确信90%的NFT和metaverse销售都是人们向自己销售的狗屎。9%的人是白痴，他们认为自己可以把一张难看的jpeg转手卖出更多，也许1%的人真的相信虚拟生态系统。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "誇大任何NFT的價格是非常容易的。創建兩個錢包，賣出\n用一個，用另一個購買。你只是爲你自己的NFT設定了一個價格!\n\n僅這一點就足以讓我懷疑每個NFT市場上的所有銷售。\n你也應該如此。我將遠離所有的NFT，尤其是...",
      "title": "我確信90%的NFT和metaverse銷售都是人們向自己銷售的狗屎。9%的人是白癡，他們認爲自己可以把一張難看的jpeg轉手賣出更多，也許1%的人真的相信虛擬生態系統。"
    }
  ]
}