{
  "author": "cata113",
  "original_created_utc": 1646129973,
  "title": "Bf called me ugly, am I overreacting?",
  "created_utc": 1646138193,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m pretty hurt. Earlier today I posted a pic of me 21 f and my bf 24m in insta and i know it’s not the best pic. I’m not wearing makeup and he is in the middle of putting his hat on. But we are both laughing and look so happy I really wanted to share the moment. After he woke up and saw it he got mad at me and said it’s such a bad photo. But what hurt me is after he said, you look ugly- look at how much you are smiling. I deleted it but I’m hurt by this. Is this justified or am I overreacting?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 225,
  "permalink": "/r/TooAfraidToAsk/comments/t44soc/bf_called_me_ugly_am_i_overreacting/",
  "subreddit": "TooAfraidToAsk",
  "id": "t44soc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m pretty hurt. Earlier today I posted a pic of me 21 f and my bf 24m in insta\nand i know it’s not the best pic. I’m not wearing makeup and he is in the middle\nof putting his hat on. But we are both laughing and look so happy I really\nwanted to share the moment. After he woke up and saw it he got…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "かなり傷つきました。今日、インスタに私21F、彼24Mの写真をアップしました。\nベストな写真ではないことは分かっています。私はメイクをしておらず、彼はメイクの途中です。\n帽子をかぶっているところ。でも、二人とも笑っていて、とても幸せそうなので、本当に\nこの瞬間を共有したかったんです。彼が起きてそれを見た後、彼は...",
      "title": "Bfにブサイクと言われましたが、私は過剰反応でしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我很受伤。今天早些时候，我在insta上发布了一张我21岁的照片，我的男朋友24岁的照片。\n我知道这不是最好的照片。我没有化妆，他在中间。\n正在戴帽子。但我们都在笑，看起来很开心，我真的\n我想分享这一刻。他醒来后看到这张照片，他就...",
      "title": "丈夫说我丑，我是不是反应过激了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我很受傷。今天早些時候，我在insta上發佈了一張我21歲的照片，我的男朋友24歲的照片。\n我知道這不是最好的照片。我沒有化妝，他在中間。\n正在戴帽子。但我們都在笑，看起來很開心，我真的\n我想分享這一刻。他醒來後看到這張照片，他就...",
      "title": "丈夫說我醜，我是不是反應過激了？"
    }
  ]
}