{
  "author": "Totally_my_real_n4me",
  "original_created_utc": 1635423662,
  "title": "A dollar on everything",
  "created_utc": 1635442398,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The surge of shiba and the post about that 6 billion wallet made me think.</p>\n\n<p>One Dollar then in shiba would be 1 million now. So, why dont i put 1 Dollar on every memecoin this month and just leave it there. One might pump hard in 1, 2, 3 years and im set for life. Sure, 99% will fail, but i only need the one percent.\nAnd it might be harder, because when they hit the usual suspects (rh, cb, binance) its most likely &quot;too late&quot;. </p>\n\n<p>Is there a flaw in my logic? </p>\n\n<p>I know its looked upon from above, but I only playing the game.</p>\n</div><!-- SC_ON -->",
  "score": 195,
  "permalink": "/r/CryptoCurrency/comments/qhls7w/a_dollar_on_everything/",
  "subreddit": "CryptoCurrency",
  "id": "qhls7w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The surge of shiba and the post about that 6 billion wallet made me think.\n\nOne Dollar then in shiba would be 1 million now. So, why dont i put 1 Dollar on\nevery memecoin this month and just leave it there. One might pump hard in 1, 2,\n3 years and im set for life. Sure, 99% will fail, but i only…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "柴の急増と60億の財布の記事を見て考えました。\n\n当時の柴の1ドルは、今では100万円になります。ならば、1ドルを電子マネーに入れてみたらどうだろう？\n今月はすべてのmemecoinに1ドルを置いて、そのままにしておきましょう。1年後、2年後、3年後には、人は一生懸命になるかもしれません。\n年後、2年後、3年後には私は一生安泰です。確かに、99％は失敗するでしょうが、私はただ...。",
      "title": "すべてに1ドル"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "芝罘区的激增和关于那个60亿钱包的帖子让我想到。\n\n当时一美元在芝罘区，现在是一百万。所以，我为什么不把1美元放在\n每个memecoin这个月，然后把它留在那里。在1年、2年、3年内，我可能会大力抽水。\n3年后，我就可以终身受益了。当然，99%会失败，但我只...",
      "title": "一美元买下所有东西"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "芝罘區的激增和關於那個60億錢包的帖子讓我想到。\n\n當時一美元在芝罘區，現在是一百萬。所以，我爲什麼不把1美元放在\n每個memecoin這個月，然後把它留在那裏。在1年、2年、3年內，我可能會大力抽水。\n3年後，我就可以終身受益了。當然，99%會失敗，但我只...",
      "title": "一美元買下所有東西"
    }
  ]
}