{
  "author": "Nostalg33k",
  "original_created_utc": 1645707245,
  "title": "People telling you to not buy the dip right now may be wrong too. It is always time to buy when the market dips, you just have to do it in a smart way.",
  "created_utc": 1645751811,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Right now the narrative set by the front page is &amp;quot;Don&amp;#39;t buy the dip, you may be catching a falling knife&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;Yeah, we are not going to wait when we have a chance to get our averages down. Yes we are not dumb, we are not going to throw everything at the market BUT we are going to buy and we may keep a bit to buy later if there is another dip. &lt;/p&gt;\n\n&lt;p&gt;Right now some of us never bought at these prices, this is an unexpected occasion to get some large bags. Your sentiment may be that the market may continue to fall but you may see institutional investors deciding to get in the market because it looks undervalued. You never know what will happen. &lt;/p&gt;\n\n&lt;p&gt;Decide for yourself but please do not miss an opportunity to get your averages down because you heard the doom and gloom spreaders. Don&amp;#39;t be burnt waiting for BTC = 20K USD, it may never happen. &lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;TLDR, I&amp;#39;m going to buy the fuck out of this dip and you should too !&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 321,
  "permalink": "/r/CryptoCurrency/comments/t0acw9/people_telling_you_to_not_buy_the_dip_right_now/",
  "subreddit": "CryptoCurrency",
  "id": "t0acw9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Right now the narrative set by the front page is \"Don't buy the dip, you may be\ncatching a falling knife\".\n\nYeah, we are not going to wait when we have a chance to get our averages down.\nYes we are not dumb, we are not going to throw everything at the market BUT we\nare going to buy and we may keep…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今、一面を飾っているのは「ディップを買ってはいけない。\n落ちるナイフをキャッチする\"。\n\nそう、私たちはアベレージを下げるチャンスがあるのに待たないのです。\nそう、我々は馬鹿ではないし、市場に全てを投じるつもりもない、しかし、我々は\n買うつもりだし、買うかもしれない。",
      "title": "今、ディップを買うなと言う人も間違っているかもしれません。マーケットがディップしたときは、いつでも買い時なのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "现在，头版的叙述是 \"不要买跌停板，你可能是在抓跌停板。\n抓住一把落下的刀\"。\n\n是的，当我们有机会让我们的平均数下降时，我们不会等待。\n是的，我们不是傻瓜，我们不会把所有东西都扔到市场上，但是我们\n我们要买，而且我们可能会继续...",
      "title": "人们告诉你现在不要买跌，可能也是错的。当市场下跌时，总是买入的时候，你只是必须以一种聪明的方式来做。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "現在，頭版的敘述是 \"不要買跌停板，你可能是在抓跌停板。\n抓住一把落下的刀\"。\n\n是的，當我們有機會讓我們的平均數下降時，我們不會等待。\n是的，我們不是傻瓜，我們不會把所有東西都扔到市場上，但是我們\n我們要買，而且我們可能會繼續...",
      "title": "人們告訴你現在不要買跌，可能也是錯的。當市場下跌時，總是買入的時候，你只是必須以一種聰明的方式來做。"
    }
  ]
}