{
  "author": "Nostalg33k",
  "original_created_utc": 1645707245,
  "title": "People telling you to not buy the dip right now may be wrong too. It is always time to buy when the market dips, you just have to do it in a smart way.",
  "created_utc": 1645751811,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Right now the narrative set by the front page is &amp;quot;Don&amp;#39;t buy the dip, you may be catching a falling knife&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;Yeah, we are not going to wait when we have a chance to get our averages down. Yes we are not dumb, we are not going to throw everything at the market BUT we are going to buy and we may keep a bit to buy later if there is another dip. &lt;/p&gt;\n\n&lt;p&gt;Right now some of us never bought at these prices, this is an unexpected occasion to get some large bags. Your sentiment may be that the market may continue to fall but you may see institutional investors deciding to get in the market because it looks undervalued. You never know what will happen. &lt;/p&gt;\n\n&lt;p&gt;Decide for yourself but please do not miss an opportunity to get your averages down because you heard the doom and gloom spreaders. Don&amp;#39;t be burnt waiting for BTC = 20K USD, it may never happen. &lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;TLDR, I&amp;#39;m going to buy the fuck out of this dip and you should too !&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 321,
  "permalink": "/r/CryptoCurrency/comments/t0acw9/people_telling_you_to_not_buy_the_dip_right_now/",
  "subreddit": "CryptoCurrency",
  "id": "t0acw9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Right now the narrative set by the front page is \"Don't buy the dip, you may be\ncatching a falling knife\".\n\nYeah, we are not going to wait when we have a chance to get our averages down.\nYes we are not dumb, we are not going to throw everything at the market BUT we\nare going to buy and we may keep…"
}