{
  "author": "Wiardv",
  "original_created_utc": 1631269359,
  "title": "Which coins will you pick up during the bear market?",
  "created_utc": 1631288623,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>&quot;Everyone is a genius in a bull market.&quot; </p>\n\n<p>You&#39;ve probably heard that during multi-year bearmarket is where you can get really rich. Which coins are you going to buy during the bear market? Just Bitcoin/Ethereum or some small marketcap coins?</p>\n\n<p>Of course a lot of people will lose their interest in crypto during the bear market, which is good for people who are willing to wait for the long term.</p>\n\n<p>And while there is a chance that there will not be a multi-year bearmarket again, we&#39;ll all have to prepare for it, in case it does come.</p>\n\n<p>So which coins do you think are the best long-term investment? </p>\n\n<p>(Or you can yolo your lifesavings into BabyDogeEloncoin and maybe become a gazillionair - or lose the house)</p>\n</div><!-- SC_ON -->",
  "score": 220,
  "permalink": "/r/CryptoCurrency/comments/pliaum/which_coins_will_you_pick_up_during_the_bear/",
  "subreddit": "CryptoCurrency",
  "id": "pliaum",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "\"Everyone is a genius in a bull market.\"\n\nYou've probably heard that during multi-year bearmarket is where you can get\nreally rich. Which coins are you going to buy during the bear market? Just\nBitcoin/Ethereum or some small marketcap coins?\n\nOf course a lot of people will lose their interest in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "\"強気の市場では誰もが天才である\"\n\n数年に一度のベアマーケットの時こそ、本当に金持ちになれると聞いたことがあるでしょう。\n金持ちになれると聞いたことがあるだろう。あなたは、ベアマーケットでどのコインを買いますか？ただ\nビットコイン/イーサリアムだけでしょうか、それともマーケットキャップの小さいコインでしょうか？\n\nもちろん、多くの人がビットコインやイーサリアムに興味を失ってしまうだろう。",
      "title": "弱気になっているときに、どのコインを手にするか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "\"在牛市中人人都是天才\"。\n\n你可能听说过，在多年的牛市中，你可以获得真正的财富。\n真正的财富。你打算在熊市中购买哪些硬币？只是\n比特币/以太坊还是一些小市值的币？\n\n当然，很多人都会失去对...",
      "title": "在熊市中你会挑选哪些硬币？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "\"在牛市中人人都是天才\"。\n\n你可能聽說過，在多年的牛市中，你可以獲得真正的財富。\n真正的財富。你打算在熊市中購買哪些硬幣？只是\n比特幣/以太坊還是一些小市值的幣？\n\n當然，很多人都會失去對...",
      "title": "在熊市中你會挑選哪些硬幣？"
    }
  ]
}