{
  "author": "amandamichelle90",
  "original_created_utc": 1626432164,
  "title": "Have you considered being able to stay in crypto long term at the rate you’re going?",
  "created_utc": 1626453703,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><em>To preface, I’ve been in crypto since my first BTC purchase in 2011. Crypto and my classes were my entire life and I’ve done well, not as well as I should have done given my entry date but I left college with no student debt and managed to get into other really strong projects very early.</em></p>\n\n<p>You’ve probably heard that crashes shake out some alternative coins, they sometimes die and don’t return but nobody seems to mention that crashes have the same effect on many new investors. Lots of you know better than to sell for a loss but a season like this can last a really long time and often people get in the mindset of <em>if by some miracle I make back my investment, I’m pulling out and never doing this again</em> </p>\n\n<p><strong>I can tell you truthfully, if the projects you’re in survive, it’s very likely after the next bull you never see red again for that coin. Shit has crashed exorbitantly and I’m only in the red on MATIC, everything I held before last bull is still in deep profits because old ceilings become new floors.</strong></p>\n\n<p>My advice is to stop letting the market control your life and start making it just a part of your lifestyle. Don’t buy when the dip tells you to, buy on your own schedule. I don’t care how often you check the markets but try and keep a semblance of a life outside of crypto. Mental health is crazy neglected everywhere but especially in volatile communities where people’s money is at stake and especially during times like these. Right now you don’t hear many 2017 investors worried, and in 2025 you won’t hear many 2021 investors worried. But I’ve been on both sides of this and though I didn’t take my life or anything the relentless stress of being so deep in the red caused me to eject far too soon and miss out on <em>my first chance at</em> multiple millions.</p>\n\n<p>TLDR: protect your sanity by forming a long term mindset and putting crypto in a sustainable slot of your lifestyle.</p>\n</div><!-- SC_ON -->",
  "score": 163,
  "permalink": "/r/CryptoCurrency/comments/oleco0/have_you_considered_being_able_to_stay_in_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "oleco0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "To preface, I’ve been in crypto since my first BTC purchase in 2011. Crypto and\nmy classes were my entire life and I’ve done well, not as well as I should have\ndone given my entry date but I left college with no student debt and managed to\nget into other really strong projects very early.\n\nYou’ve…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "前置きが長くなりましたが、私は2011年に初めてBTCを購入して以来、暗号に関わってきました。クリプトと\nクラスが私の人生のすべてであり、私はうまくやってきました。\nしかし、私は学生時代に借金をせずに大学を卒業し、いくつかの大学に入学することができました。\n他の強力なプロジェクトにも早くから参加することができました。\n\nあなたは...",
      "title": "今のペースで長期的に暗号を使い続けることができるかどうかを考えたことはありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "先说一下，从2011年我第一次购买BTC开始，我就已经进入了加密货币领域。加密货币和\n我的课程是我的全部生活，我做得很好，但考虑到我的进入日期，我没有做得那么好。\n但我在离开大学时没有任何学生债务，并设法在很早的时候就进入了其他真正强大的项目。\n很早就进入了其他真正强大的项目。\n\n你已经...",
      "title": "你有没有考虑过以你现在的速度能够长期留在加密货币中？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "先說一下，從2011年我第一次購買BTC開始，我就已經進入了加密貨幣領域。加密貨幣和\n我的課程是我的全部生活，我做得很好，但考慮到我的進入日期，我沒有做得那麼好。\n但我在離開大學時沒有任何學生債務，並設法在很早的時候就進入了其他真正強大的項目。\n很早就進入了其他真正強大的項目。\n\n你已經...",
      "title": "你有沒有考慮過以你現在的速度能夠長期留在加密貨幣中？"
    }
  ]
}