{
  "author": "Lord_Blazer",
  "the_new_excerpt": "The rise of DOGE and other coins that do not have anything to show for it is\nproof enough that Crypto is still in the early stages, moved by sentiment rather\nthan facts. This is not a bad thing. On the contrary, it is a necessary part of\nthe development of the Crypto scene, in the same way it was…",
  "original_created_utc": 1618410929,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "DOGEをはじめとする何もないコインの上昇は、Cryptoがまだ初期段階にあることを証明しています。\nは、暗号がまだ初期段階にあり、事実よりも感情に左右されることを証明しています。\n事実ではなく感情で動いているということです。これは決して悪いことではありません。それどころか、Cryptoシーンの発展のためには必要なことなのです。\nと同じように、Cryptoシーンの発展のために必要なことなのです。",
      "title": "DOGEをはじめとする「シットコイン」の台頭は、Cryptoがまだまだ発展の余地がある初期段階であることを証明しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "DOGE等币种的兴起，并没有什么值得炫耀的地方，就是\n足以证明Crypto仍处于早期阶段，受情绪的影响而动摇\n比事实。这不是一件坏事。恰恰相反，它是一个必要的组成部分。\n的发展加密场景，以同样的方式，它是... ...",
      "title": "DOGE和其他 \"屎币 \"的兴起，证明了Crypto仍处于起步阶段，有很大的发展空间。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "DOGE等幣種的興起，並沒有什麼值得炫耀的地方，就是\n足以證明Crypto仍處於早期階段，受情緒的影響而動搖\n比事實。這不是一件壞事。恰恰相反，它是一個必要的組成部分。\n的發展加密場景，以同樣的方式，它是... ...",
      "title": "DOGE和其他 \"屎幣 \"的興起，證明了Crypto仍處於起步階段，有很大的發展空間。"
    }
  ],
  "title": "The rise of DOGE and other 'shitcoins' is proof that Crypto is still in its infancy with plenty of room for development.",
  "created_utc": 1618425648,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The rise of DOGE and other coins that do not have anything to show for it is proof enough that Crypto is still in the early stages, moved by sentiment rather than facts. This is not a bad thing. On the contrary, it is a necessary part of the development of the Crypto scene, in the same way it was for the internet back in the 90&#39;s. We need to embrace this and actually feel happy that we are still early to this game. If you get lucky enough, you&#39;ll get a lot of money in a short time, but it is almost certain that you&#39;ll get there if you are consistent enough in time.</p>\n</div><!-- SC_ON -->",
  "score": 675,
  "permalink": "/r/CryptoCurrency/comments/mqrvbz/the_rise_of_doge_and_other_shitcoins_is_proof/",
  "subreddit": "CryptoCurrency",
  "id": "mqrvbz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566616773
}