{
  "author": "sylsau",
  "original_created_utc": 1641635560,
  "title": "Bitcoin Fear &amp; Greed Index is at 10 as of March 2020. The difference? The price of Bitcoin is at $42K this time, and it had touched $3.2K in March 2020. Don't panic, just zoom out.",
  "created_utc": 1641667358,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The Bitcoin Fear &amp;amp; Greed Index is at 10 today. The lowest level since March 2020. At that time, the COVID-19 pandemic had just started to spread around the world, and we had a liquidity crisis in all liquid markets.&lt;/p&gt;\n\n&lt;p&gt;This caused the price of Bitcoin to drop by more than 50% in a few hours to a low of $3.2K on some trading platforms.&lt;/p&gt;\n\n&lt;p&gt;The fear was extreme. However, a strong rebound was quickly observed thanks to the HODLers of last resort who had seen a unique opportunity to seize. What happened next proved them right.&lt;/p&gt;\n\n&lt;p&gt;Today, the price of Bitcoin is at $42K. This is almost 40% lower than the ATH of November 10, 2021, at $69K. But is it time to give in to extreme fear? I don&amp;#39;t think so. Above all, we must keep control of our emotions and take a step back. Don&amp;#39;t panic and take a step back. It&amp;#39;s as simple as that.&lt;/p&gt;\n\n&lt;p&gt;If you doubt it, ask yourself this question: would you have been in extreme fear if someone had told you two years ago that the price of Bitcoin would have been $42K in January 2022? I don&amp;#39;t think so!&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t let short-term volatility override Bitcoin&amp;#39;s long-term goals. In a few years, the current period will not even appear on the Bitcoin price chart.&lt;/p&gt;\n\n&lt;p&gt;Stay strong, Stay Bitcoin HODLers.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 326,
  "permalink": "/r/CryptoCurrency/comments/ryweqj/bitcoin_fear_greed_index_is_at_10_as_of_march/",
  "subreddit": "CryptoCurrency",
  "id": "ryweqj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The Bitcoin Fear & Greed Index is at 10 today. The lowest level since March\n2020. At that time, the COVID-19 pandemic had just started to spread around the\nworld, and we had a liquidity crisis in all liquid markets.\n\nThis caused the price of Bitcoin to drop by more than 50% in a few hours to a\nlow…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコイン恐怖・貪欲指数は本日10となりました。3月以来の低水準\n2020. その頃、COVID-19のパンデミックはちょうど世界中に広がり始めていました。\n世界的に、すべての流動性市場で流動性危機が発生したのです。\n\nこのため、ビットコインの価格は数時間で50％以上下落し\n低い...",
      "title": "Bitcoin Fear &amp; Greed Indexは2020年3月現在、10になっています。その差は？ビットコインの価格は今回42Kドルですが、2020年3月には3.2Kドルにタッチしていたのです。パニックにならずに、ズームアウトしてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "比特币恐惧和贪婪指数今天为10。是自3月以来的最低水平\n2020. 那时候，COVID-19大流行病刚刚开始在全球蔓延\n世界，我们在所有的流动市场上都出现了流动性危机。\n\n这导致比特币的价格在几个小时内下跌了50%以上，达到了\n低点...",
      "title": "截至2020年3月，比特币恐惧&amp; 贪婪指数为10。不同的是什么？这次比特币的价格是42000美元，而在2020年3月曾触及3.2千美元。不要惊慌，只是放大了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "比特幣恐懼和貪婪指數今天爲10。是自3月以來的最低水平\n2020. 那時候，COVID-19大流行病剛剛開始在全球蔓延\n世界，我們在所有的流動市場上都出現了流動性危機。\n\n這導致比特幣的價格在幾個小時內下跌了50%以上，達到了\n低點...",
      "title": "截至2020年3月，比特幣恐懼&amp; 貪婪指數爲10。不同的是什麼？這次比特幣的價格是42000美元，而在2020年3月曾觸及3.2千美元。不要驚慌，只是放大了。"
    }
  ]
}