{
  "author": "MasterCookSwag",
  "the_new_excerpt": "https://www.bloomberg.com/opinion/articles/2021-05-18/s-p-firm-forgot-to-update-the-xiv-index\n\nRelevant text:\n\n> How are things at the $2 billion deli?\n> \n> > Hometown International, the mystifying New Jersey deli company that is\n> > valued at nearly $100 million on the stock market — despite…",
  "original_created_utc": 1621358535,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "https://www.bloomberg.com/opinion/articles/2021-05-18/s-p-firm-forgot-to-update-the-xiv-index\n\n関連するテキスト\n\n> 20億円のデリの状況はどうですか？\n> \n> ホームタウン・インターナショナルは、ニュージャージー州の不思議なデリカテッセン会社です。\n> 株式市場では1億ドル近い評価を受けていますが、...",
      "title": "ニュージャージーのホームタウン・デリの最新情報"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "https://www.bloomberg.com/opinion/articles/2021-05-18/s-p-firm-forgot-to-update-the-xiv-index\n\n相关文字。\n\n> 20亿美元的熟食店的情况如何？\n> \n> > 家乡国际，这家神秘的新泽西熟食公司，其\n> > 股票市场上的估值接近1亿美元--尽管...",
      "title": "新泽西州的家乡熟食店的最新情况"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "https://www.bloomberg.com/opinion/articles/2021-05-18/s-p-firm-forgot-to-update-the-xiv-index\n\n相關文字。\n\n> 20億美元的熟食店的情況如何？\n> \n> > 家鄉國際，這家神祕的新澤西熟食公司，其\n> > 股票市場上的估值接近1億美元--儘管...",
      "title": "新澤西州的家鄉熟食店的最新情況"
    }
  ],
  "title": "Update on Your Hometown Deli in New Jersey",
  "created_utc": 1621369127,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.bloomberg.com/opinion/articles/2021-05-18/s-p-firm-forgot-to-update-the-xiv-index\">https://www.bloomberg.com/opinion/articles/2021-05-18/s-p-firm-forgot-to-update-the-xiv-index</a></p>\n\n<p>Relevant text: </p>\n\n<blockquote>\n<p>How are things at the $2 billion deli?</p>\n\n<blockquote>\n<p>Hometown International, the mystifying New Jersey deli company that is valued at nearly $100 million on the stock market — despite running just a single deli — has ousted its CEO, according to a financial filing. </p>\n\n<p>Paul Morina, a local high school principal and renowned wrestling coach in the area, was removed after a vote by majority shareholders, according to the late Friday filing.</p>\n\n<p>Morina owns about 1.5 million shares of the Paulsboro-based company, which are worth more than $18.5 million based on the company’s current stock price. </p>\n\n<p>Shareholders of the company also ousted the company’s only other executive, vice president and secretary Christine Lindenmuth, who works in her day job with Morina as an administrator at Paulsboro High School.</p>\n</blockquote>\n\n<p>Here is the filing, from last Friday. It is not quite accurate to say — as the New York Post’s headline does — that shareholders fired Morina. It’s more that they demoted him. He lost a lot of titles:</p>\n\n<blockquote>\n<p>On May 13, 2021, the Board removed Mr. Morina from all officer positions he held with the Company, including President, Chief Executive Officer, Chief Financial Officer, and Treasurer of the Corporation, effective immediately as of such date. </p>\n</blockquote>\n\n<p>But he still runs the deli:</p>\n\n<blockquote>\n<p>Mr. Morina and Ms. Lindenmuth remain principals of the Company’s operating subsidiary, Your Hometown Deli, LLC.</p>\n</blockquote>\n\n<p>See, Your Hometown Deli is a deli in Paulsboro, New Jersey, that occasionally sells sandwiches, mainly to curious financial journalists. Hometown International Inc. is a U.S. public company, with a basic market capitalization of about $100 million and a fully diluted market cap of about $2 billion, that is some sort of mechanism for taking a foreign company public in U.S. markets and that also happens to own the deli. The $2 billion public company is now run by Peter Coker Jr., a Hong Kong-based financier who was already the chairman of the board and a major investor in Hometown International, and who “intends to devote his full time to seeking a business combination for the Company,” as the company said back in March. It makes sense that the mergers guy in Hong Kong would run the $2 billion company that’s in the business of merging with an Asian company, and the wrestling coach in New Jersey would run the local deli in New Jersey. Sensible division of labor! It was always weird to have the New Jersey wrestling guy in charge of the Asian merger company! Also it’s weird that they’re the same company.</p>\n\n<p>The deli has had some other good filings recently. Yesterday it disclosed that its quarterly report will be late, “because the Registrant needs additional time to complete certain disclosures and analyses to be included in the Report.” The relevant quarter ended on March 31, before Hometown became famous, so the problem is not that they sold so many sandwiches to so many financial journalists that their accounting systems couldn’t keep up. I assume that, given their recent scrutiny, everything just needs to be lawyered a bit more carefully than it has been in the past.</p>\n\n<p>Also here is an April 30 filing in which Hometown “disavows the price of its publicly quoted stock on the OTC Markets under the trading symbol ‘HWIN.’ Management is aware of no basis to support the Company’s stock price, based upon its revenue or assets.” I am not sure I have ever seen a company “disavow” its stock price before, but I suppose it makes sense. The filing accurately notes that “there has not been, nor is there, significant trading volume in the Company’s stock,” so it’s not like anyone is particularly getting ripped off by the deli’s weird stock price. It’s just a weird artifact. Still, probably best to disavow it.</p>\n</blockquote>\n\n<p>This whole story is just top tier entertainment, also if you&#39;ve missed some of the context see the separate comment with backstory.  And I&#39;ve said this a thousand times, if you&#39;re not getting Matt&#39;s daily newsletter than you&#39;re really missing out.</p>\n</div><!-- SC_ON -->",
  "score": 163,
  "permalink": "/r/investing/comments/nfgipo/update_on_your_hometown_deli_in_new_jersey/",
  "subreddit": "investing",
  "id": "nfgipo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590803273
}