{
  "author": "Abelia_Lionheart",
  "original_created_utc": 1627760969,
  "title": "What are some examples of the bad things Trump did during presidency?",
  "created_utc": 1627782309,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><em>Please</em> don’t tear me to shreds over asking this. I’m only a teenager, and I’ve grown up in a super conservative state in a super conservative family. All of the information I’ve gotten on Trump (and politics in general) has come from Fox News, my family, or members of my church, and I want some unbiased information for once in my life. </p>\n\n<p>Can I have some information on specific things he did while president that made him so bad (preferably with sources)? I’m sorry I’m asking this, I know stuff like this should be obvious to me, but I don’t know how to feel right now, and I want some objective facts.</p>\n</div><!-- SC_ON -->",
  "score": 148,
  "permalink": "/r/TooAfraidToAsk/comments/ovdql1/what_are_some_examples_of_the_bad_things_trump/",
  "subreddit": "TooAfraidToAsk",
  "id": "ovdql1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Please don’t tear me to shreds over asking this. I’m only a teenager, and I’ve\ngrown up in a super conservative state in a super conservative family. All of\nthe information I’ve gotten on Trump (and politics in general) has come from Fox\nNews, my family, or members of my church, and I want some…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんなこと聞いてボロボロにしないでくださいよ。私はまだ10代です。\n超保守的な州で超保守的な家庭で育ちました。すべての\nトランプ（と政治全般）について私が得た情報は、Fox\nニュース、家族、教会のメンバー、そして、私は何か欲しい...",
      "title": "トランプ氏が大統領在任中に行った悪いことの例として、どのようなものがありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "请不要因为问这个问题而把我撕成碎片。我只是一个十几岁的孩子，而且我已经\n我在一个超级保守的州和一个超级保守的家庭长大。我所得到的所有\n我所得到的关于特朗普（以及一般的政治）的信息都来自福克斯\n新闻，我的家人，或我的教会成员，我想知道一些...",
      "title": "特朗普在担任总统期间做的坏事有哪些例子？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "請不要因爲問這個問題而把我撕成碎片。我只是一個十幾歲的孩子，而且我已經\n我在一個超級保守的州和一個超級保守的家庭長大。我所得到的所有\n我所得到的關於特朗普（以及一般的政治）的信息都來自福克斯\n新聞，我的家人，或我的教會成員，我想知道一些...",
      "title": "特朗普在擔任總統期間做的壞事有哪些例子？"
    }
  ]
}