{
  "author": "CicadaSalty",
  "original_created_utc": 1627471428,
  "title": "I'm pro-vax but why is it considered an a-hole move for an American to not get vaccinated? the virus will still be transmitted the same it's just that the non-vaxxed will suffer more. if it's not your life anymore, why bother? isn't it like natural selection at this stage of the pandemic?",
  "created_utc": 1627479400,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>this will get downvoted i think but this is really a too afraid to ask question for me. in America its more of a choice than it is a privilege not like other countries where vax supplies are still low. if people don&#39;t want to get vaxxed why bother? like its their own money if they get a high hospital bill and its their life if they die. as far as i know, the virus wont go away but our bodies will just get used to it once vaxxed. in other words, all of us are still spreaders of the virus, vaxxed or not vaxxed. </p>\n\n<p>so if in America, its more of a choice than a privilege to get vaxxed, why even bother if some are too bigot about it? it&#39;s like natural selection or like if someone needs help but has it all accessible to that person but that person just doesn&#39;t want to get help. why bother?</p>\n</div><!-- SC_ON -->",
  "score": 145,
  "permalink": "/r/TooAfraidToAsk/comments/ot7xjb/im_provax_but_why_is_it_considered_an_ahole_move/",
  "subreddit": "TooAfraidToAsk",
  "id": "ot7xjb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "this will get downvoted i think but this is really a too afraid to ask question\nfor me. in America its more of a choice than it is a privilege not like other\ncountries where vax supplies are still low. if people don't want to get vaxxed\nwhy bother? like its their own money if they get a high…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私にとっては、これは本当に恐ろしくて聞けない質問です。\nアメリカでは、ワクチンの供給がまだ少ない他の国とは違い、特権ではなく選択の余地があります。\nもし人々がワクチン接種をしたくないのであれば、なぜわざわざ受けるのでしょうか？\nなぜわざわざ受けるのでしょうか？高濃度のワクチンを接種しても自分のお金になるのですから・・・。",
      "title": "私は予防接種に賛成ですが、なぜアメリカ人が予防接種を受けないことが馬鹿げていると思われるのでしょうか？ウイルスの感染力は変わらないのに、予防接種を受けない人がより苦しむことになるだけです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想这个问题会被降权，但这确实是一个不敢问的问题。\n在美国，这更像是一种选择，而不是一种特权。\n如果人们不愿意接受疫苗接种，那又何必呢？\n就像他们自己的钱，如果他们得到一个高...",
      "title": "我支持接种疫苗，但为什么美国人不接种疫苗会被认为是一个混蛋的举动呢？病毒仍然会传播，只是不接种疫苗的人会遭受更多的痛苦。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想這個問題會被降權，但這確實是一個不敢問的問題。\n在美國，這更像是一種選擇，而不是一種特權。\n如果人們不願意接受疫苗接種，那又何必呢？\n就像他們自己的錢，如果他們得到一個高...",
      "title": "我支持接種疫苗，但爲什麼美國人不接種疫苗會被認爲是一個混蛋的舉動呢？病毒仍然會傳播，只是不接種疫苗的人會遭受更多的痛苦。"
    }
  ]
}