{
  "author": "willworkforpopplers",
  "original_created_utc": 1646484393,
  "title": "How do I get my cat to stop waking me at 4am for wet food?",
  "created_utc": 1646498181,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I recently moved out on my own and my cat, who previously lived with other cats, is waking me at ungodly hours for food. This is new behavior. He&amp;#39;s 14 and I&amp;#39;ve had him since kitten. &lt;/p&gt;\n\n&lt;p&gt;He gets half can of wet food in AM and PM and access to dry food all day that he doesn&amp;#39;t eat much of. I started PM hoping he&amp;#39;d leave me alone at night, but has been getting AM for several years. If I keep the door open he&amp;#39;s a walking advertisement for &lt;a href=\"/r/petthedamncat\"&gt;r/petthedamncat&lt;/a&gt;. If I close it he claws at the door and yowls until I get up.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m at my wits end. What do I do?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/NoStupidQuestions/comments/t78qkt/how_do_i_get_my_cat_to_stop_waking_me_at_4am_for/",
  "subreddit": "NoStupidQuestions",
  "id": "t78qkt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I recently moved out on my own and my cat, who previously lived with other cats,\nis waking me at ungodly hours for food. This is new behavior. He's 14 and I've\nhad him since kitten.\n\nHe gets half can of wet food in AM and PM and access to dry food all day that he\ndoesn't eat much of. I started PM…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近単身赴任して、以前他の猫と一緒に暮らしていた猫が\nは、餌のためにとんでもない時間に私を起こします。これは新しい行動です。彼は14歳で、私はこれまで\n子猫のときから飼っています。\n\n朝晩にウェットフードを半缶ずつ、一日中ドライフードを食べていますが\nあまり食べません。午後から始めたのですが・・・。",
      "title": "猫が朝4時に起きてウェットフードを食べるのをやめさせるにはどうしたらいいですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近自己搬了出去，我的猫，以前和其他猫住在一起。\n在不正常的时间里把我叫醒，要我吃东西。这是新的行为。他今年14岁，我从小猫开始\n我从小猫开始养它。\n\n他在上午和下午都有半罐湿粮，整天都能吃到干粮。\n但它并没有吃多少。我从下午开始给它吃...",
      "title": "怎样才能让我的猫咪不再在凌晨4点叫醒我吃湿食？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近自己搬了出去，我的貓，以前和其他貓住在一起。\n在不正常的時間裏把我叫醒，要我喫東西。這是新的行爲。他今年14歲，我從小貓開始\n我從小貓開始養它。\n\n他在上午和下午都有半罐溼糧，整天都能喫到乾糧。\n但它並沒有喫多少。我從下午開始給它喫...",
      "title": "怎樣才能讓我的貓咪不再在凌晨4點叫醒我喫溼食？"
    }
  ]
}