{
  "author": "Mekayv",
  "original_created_utc": 1629966754,
  "title": "How Crypto Ruined My Life (WITH PROOF) And How I Plan On Recovering",
  "created_utc": 1629992135,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello,</p>\n\n<p>You may remember me from a post I made a few weeks ago about my daughter dating an idiot that considered himself a crypto expert.</p>\n\n<p>Truth is I was devastated to see everyone having a laugh at the situation when all I was hoping for was to find some emotional support. I guess that&#39;s internet...</p>\n\n<p>This will be my last post, I just wanted to share how crypto ruined my life and how I plan on getting my life back. And since self-stories now require evidence, I will be complying with the rules. For those left wondering about my aspect, I will <em>wrap</em> it up by saying that I have a very rare skin disease so please let&#39;s skip the uncomfortable questions. Without further due, here&#39;s my story.</p>\n\n<p>Ever since my daughter was little I&#39;ve been trying to teach her the value of hard work and money. I think my first mistake was paying my daughter&#39;s allowance in crypto. I didn&#39;t know where her sudden urge to get into crypto came from at the time, because at home we never talked about it before she brought it up. Turns out she was an avid Tik-Tok user, and apparently people get their financial advice from GenZ influencers with ADHD there, in fact that&#39;s how she met the douche-bag I told you about. Anyway, I&#39;m not here to talk about that today, at least not entirely.</p>\n\n<h1>Here&#39;s a picture on our backyard the day I told her that allowance was an earned thing. Man, time sure flies, she couldn&#39;t wait to get her little hands on that FIAT.</h1>\n\n<p><a href=\"https://preview.redd.it/6vbsj302xnj71.png?width=1274&amp;format=png&amp;auto=webp&amp;s=872cefbced729c0e20014fb01dc42ebf07995848\">https://preview.redd.it/6vbsj302xnj71.png?width=1274&amp;format=png&amp;auto=webp&amp;s=872cefbced729c0e20014fb01dc42ebf07995848</a></p>\n\n<p>&#x200B;</p>\n\n<p>We have grown apart a lot in the past days, ever since her boyfriend got her into that cult it feels like I have lost my little baby. And to make things worse, that pompous Kevin O&#39;Leary publicly said that the financial middlemen were about to go jobless thanks to mass crypto adoption. What a jerk.</p>\n\n<p>Shortly after Kevin O&#39;Leary publicly announced his views on financial middlemen, the branch I was working for was closed with no further explanation and I was let go from my job along side other 50 colleagues. I immediately assumed it was due to these foolish statements. I was wrong.</p>\n\n<p>So that same day I packed my stuff, took a cab (I had to return the company car), and went home.</p>\n\n<p>All I wanted to do on the way home was reflect on what life choices left me standing where I was at that very moment, but the taxi driver noticed my suit and correctly assumed I was in the banking business, so he started yapping away about how his life was changed for the better thanks to crypto (at this point I realised crypto investors were now the new vegans), saying how he could finally leave Las Vegas and start a new life across the country. I just nodded my head at everything he said hoping he would take the hint and shut up, but he kept on going, saying stuff like, &quot;Satoshi Nakamoto was 6-7 asian guys hired by Allan Greenspan&quot; and &quot;Every crypto starting with the letter X is going to be world currency&quot;, all according to a psychic I&#39;ve never heard of. I was very close to jumping off the cab mid-drive, but I refrained from doing so and safely made it home.</p>\n\n<h1>Here&#39;s a picture of the Taxi driver:</h1>\n\n<p><a href=\"https://preview.redd.it/rnrzsfe3xnj71.jpg?width=1242&amp;format=pjpg&amp;auto=webp&amp;s=fa3462ca412dff3dc78386ec7b927af5f1ca3375\">https://preview.redd.it/rnrzsfe3xnj71.jpg?width=1242&amp;format=pjpg&amp;auto=webp&amp;s=fa3462ca412dff3dc78386ec7b927af5f1ca3375</a></p>\n\n<p>&#x200B;</p>\n\n<p>Anyway, when I finally arrived home, Biden<sup>1</sup> was furiously humping my waifu pillow<sup>2</sup> but I didn&#39;t give it much importance, my mind was too busy wondering how that prick&#39;s opinion could ultimately result in me getting fired; I needed a drink. So I poured myself a big glass of scotch on the rocks and turned on the TV to relax and catch up a with national news, only to discover the real reason I was fired. A picture of me with Congressman Brad Sherman was leaked earlier that day.</p>\n\n<p><sup>1.Biden is my french bull-dog. 2.Don&#39;t judge me.</sup></p>\n\n<h1>Here&#39;s the picture that was leaked:</h1>\n\n<p><a href=\"https://preview.redd.it/qickill4xnj71.png?width=1276&amp;format=png&amp;auto=webp&amp;s=3847d64810fd4aa62d19aa144f67bc9d952ef9f6\">https://preview.redd.it/qickill4xnj71.png?width=1276&amp;format=png&amp;auto=webp&amp;s=3847d64810fd4aa62d19aa144f67bc9d952ef9f6</a></p>\n\n<p>Ever since that day my life has turned 180º around, I lost everything in a matter of days. I had to start over and it was the hardest thing ever. I really had lost all hopes, everything looked as dark is it could get. Went from Bugattis and 5 star vacations to charity diners and shoe-shining for a living.</p>\n\n<h1>I just can&#39;t believe in just a few weeks I went from this:</h1>\n\n<p><a href=\"https://preview.redd.it/vuwz7c86xnj71.png?width=1440&amp;format=png&amp;auto=webp&amp;s=e46ea046873c2dfa73f3ba7e198e843a96be8654\">https://preview.redd.it/vuwz7c86xnj71.png?width=1440&amp;format=png&amp;auto=webp&amp;s=e46ea046873c2dfa73f3ba7e198e843a96be8654</a></p>\n\n<h1>To this:</h1>\n\n<p><a href=\"https://preview.redd.it/5srnpfm7xnj71.png?width=1440&amp;format=png&amp;auto=webp&amp;s=affb27669add45a3e4ad7e16b741a65efa4c67fb\">https://preview.redd.it/5srnpfm7xnj71.png?width=1440&amp;format=png&amp;auto=webp&amp;s=affb27669add45a3e4ad7e16b741a65efa4c67fb</a></p>\n\n<p>&#x200B;</p>\n\n<p>On a positive note, I still have hopes on climbing the social ladder to the top again. As consequence of this shit-storm I had to move to a third world country. You guys probably don&#39;t know this, but with just 2 moons I can stock on ramen noodles for a whole year over here. It&#39;s crazy!</p>\n\n<p>I started doing the math and quickly realised I had a golden opportunity to reverse things back to normal.</p>\n\n<h1>Here&#39;s me, purchasing my first lot of ramen noodles:</h1>\n\n<p><a href=\"https://preview.redd.it/yf26laf9xnj71.png?width=1272&amp;format=png&amp;auto=webp&amp;s=3beeb88863705cb11a9bd981256a286cd5f819af\">https://preview.redd.it/yf26laf9xnj71.png?width=1272&amp;format=png&amp;auto=webp&amp;s=3beeb88863705cb11a9bd981256a286cd5f819af</a></p>\n\n<h1>This is where my recovery plan kicks in:</h1>\n\n<p>Since crypto seems indeed to be the future, I thought investing on ramen noodles was really the way to go. The more people using crypto, the more people eating ramen. I also made some research on crypto population statistics; turns out most users are single males between the age of 23-38, this information made me extremely bullish on flesh-lights, so I bought some Amazon stocks with the left-over moons I had, too.</p>\n\n<p>You probably won&#39;t hear from me again because I&#39;ll be too busy building my ramen noodle empire with my earned reddit internet money, but for those who got kicked by life when you were already down and lost hope, I&#39;m here to tell you that the reality is most don&#39;t make it back from down there, so you might as well give up now on your dreams and send that resume to McDonalds before they fully integrate A.I. automated service.</p>\n\n<p>&#x200B;</p>\n\n<p>Good-bye and stay safe <a href=\"/r/CryptoCurrency\">r/CryptoCurrency</a>!</p>\n\n<p><a href=\"https://preview.redd.it/6swithqaxnj71.png?width=1444&amp;format=png&amp;auto=webp&amp;s=62dae85e7bb1e9d7d026c7d90e700ab0ddb6d3c4\">https://preview.redd.it/6swithqaxnj71.png?width=1444&amp;format=png&amp;auto=webp&amp;s=62dae85e7bb1e9d7d026c7d90e700ab0ddb6d3c4</a></p>\n</div><!-- SC_ON -->",
  "score": 161,
  "permalink": "/r/CryptoCurrency/comments/pbvbvj/how_crypto_ruined_my_life_with_proof_and_how_i/",
  "subreddit": "CryptoCurrency",
  "id": "pbvbvj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hello,\n\nYou may remember me from a post I made a few weeks ago about my daughter dating\nan idiot that considered himself a crypto expert.\n\nTruth is I was devastated to see everyone having a laugh at the situation when\nall I was hoping for was to find some emotional support. I guess…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは。\n\n数週間前に、娘が自分を暗号の専門家だと思っているバカと付き合っているという投稿をしたので、私を覚えているかもしれません。\n自分を暗号の専門家だと思っていた馬鹿者と娘が付き合っているという投稿をしたことを覚えているでしょうか。\n\n実は、私は心の支えになればと思っていたのに、皆さんがこの状況を笑い飛ばしているのを見て、とてもショックを受けました。\n私が望んでいたのは、心の支えを見つけることでした。思うに...",
      "title": "暗号がいかに私の人生を台無しにしたか（証拠あり）、そしてどのようにして回復しようとしているか"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好。\n\n你可能还记得我几周前发的一篇关于我女儿和一个白痴约会的帖子。\n一个自认为是加密货币专家的白痴。\n\n事实是，我看到每个人都在嘲笑这种情况，而我所希望的只是找到一些情感上的支持，这让我很受打击。\n我所希望的只是找到一些情感支持。我想...",
      "title": "加密货币如何毁了我的生活（有证据）以及我打算如何恢复的问题"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好。\n\n你可能還記得我幾周前發的一篇關於我女兒和一個白癡約會的帖子。\n一個自認爲是加密貨幣專家的白癡。\n\n事實是，我看到每個人都在嘲笑這種情況，而我所希望的只是找到一些情感上的支持，這讓我很受打擊。\n我所希望的只是找到一些情感支持。我想...",
      "title": "加密貨幣如何毀了我的生活（有證據）以及我打算如何恢復的問題"
    }
  ]
}