{
  "author": "maroonblood94",
  "original_created_utc": 1633131162,
  "title": "My biggest fear with Bitcoin and crypto in general.",
  "created_utc": 1633185042,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Those who are not naturally distrustful of the government or critically-minded probably will think I’m nuts, as already evidenced by some of the comments. Please keep in mind that I’m approaching this topic as a PRO-bitcoiner, not a FUD spreader. I may get downvoted to oblivion, but I don’t care. This is a topic that isn’t discussed enough, and I don’t understand why people don’t think about this more. I’m invested, and I’ll continue to invest in Bitcoin for the next few years. So here goes…</p>\n\n<p>My biggest fear is that the CIA/Government created Bitcoin and is planning an eventual rug pull that will lead to the biggest wealth transfer in world history into the hands of the elites. </p>\n\n<p>Think about it. Who would want a Central Bank Digital Currency from the government? Nobody. </p>\n\n<p>Enter Bitcoin. Built upon the hashing algorithm SHA-256 (which was originally designed by the NSA), and designed by some supposedly benevolent, anonymous creator (Satoshi Nakamoto) with a name that literally translates to “Central Intelligence” in Japanese. People flock to it with the dream that it will help them conquer the corrupt financial system by hedging against inflation and allowing them to make decentralized transactions. As it picks up adoption…celebrities, bankers, and big companies start buying it up. Enamored by promises of wealth and financial freedom, everyone ignores the uncomfortable fact that the creator of Bitcoin has 1 million coins and could easily tank the market just by activating his wallet. “He’s dead or forgot his keys” we reassure ourselves. </p>\n\n<p>By 2030, 80%-90% of the worlds population has invested their wealth and savings into this digital asset. Suddenly, Satoshi’s wallet wakes up one day and begins to sell-off massive amounts of Bitcoin. Major investors rush to sell off their holdings as the price plunges into a free-fall collapse. Within 24 hours, the value of Bitcoin is decimated. Millions across the world lose their life savings. But it’s to late. Satoshi (or the elite group who may be Satoshi) have transferred the bulk of the world’s wealth to themselves. </p>\n\n<p>At this point, the world governments and banks swoop in to offer their new traceable, trackable, controllable digital currency. </p>\n\n<p>Revelation 13:16-17: “It also forced all people, great and small, rich and poor, free and slave, to receive a mark on their right hands or on their foreheads, so that they could not buy or sell unless they had the mark, which is the name of the beast or the number of its name.”</p>\n\n<p>That’s my biggest fear. Never in history have the elites lost control of the financial system. And I think it’s short-sighted to believe they don’t have a plan for Bitcoin. I’ll still keep buying it in the short term as it’s making me money. But I’m not going to be a 10-30+ year HODLER like everyone else. In the next 5 years, I’ll be transferring all my crypto into physical assets like food, land, etc… Call it FUD, call it what you want. Nobody knows who Satoshi is though. Nobody knows why he hasn’t touched his wallets which contain a massive amount of wealth. And no, “he forgot his keys” isn’t a valid argument. You really think the man who designed Bitcoin couldn’t keep track of his own keys? </p>\n\n<p>The only possible explanation that could absolve us of any worry is that he is dead. And that’s a big gamble for the long-term. No sane human would leave that amount of wealth untouched while alive, unless they had a nefarious purpose and were waiting to sell it until a later date to facilitate the biggest wealth transfer in world history.</p>\n\n<p>EDIT: Really appreciate the constructive replies that actually address my points instead of bashing me for a Bible verse. Whether you believe in the Bible or not isn’t important, my primary arguments about Satoshi still stand regardless. The verse at the end was an added effect that I probably could have excluded without detracting from my original points. Although, based on the numerous comments accusing me of being on drugs, excluding the verse may have made no difference. Again, I genuinely appreciate the thoughtful replies, and I’m glad we can have a constructive discussion.</p>\n</div><!-- SC_ON -->",
  "score": 158,
  "permalink": "/r/Bitcoin/comments/pzjs9p/my_biggest_fear_with_bitcoin_and_crypto_in_general/",
  "subreddit": "Bitcoin",
  "id": "pzjs9p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Those who are not naturally distrustful of the government or critically-minded\nprobably will think I’m nuts, as already evidenced by some of the comments.\nPlease keep in mind that I’m approaching this topic as a PRO-bitcoiner, not a\nFUD spreader. I may get downvoted to oblivion, but I don’t care.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もともと政府に不信感を持っていたり、批判的な考えを持っていない人は\n批判的な意見をお持ちでない方は、私のことをバカにしていると思われるかもしれません。\n私はこの話題に、FUDを広める側ではなく、PRO-BITCOINERとして取り組んでいることを覚えておいてください。\nFUDを広める者ではなく、PRO-bitcoinerとしてこのトピックに取り組んでいることをご理解ください。もしかしたら、私は削除されてしまうかもしれませんが、気にしません。....",
      "title": "ビットコインや暗号全般について、私が最も恐れていることがあります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "那些不是天生不信任政府或不具备批判精神的人\n可能会认为我是疯子，一些评论已经证明了这一点。\n请记住，我是作为一个专业人员来处理这个话题的，而不是一个\nFUD的传播者。我可能会被降权，但我不在乎....。",
      "title": "我对比特币和一般的加密货币最大的恐惧。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "那些不是天生不信任政府或不具備批判精神的人\n可能會認爲我是瘋子，一些評論已經證明了這一點。\n請記住，我是作爲一個專業人員來處理這個話題的，而不是一個\nFUD的傳播者。我可能會被降權，但我不在乎....。",
      "title": "我對比特幣和一般的加密貨幣最大的恐懼。"
    }
  ]
}