{
  "author": "KeyProgram4487",
  "original_created_utc": 1642593158,
  "title": "Why did the Germans not mind that Adolf Hitler was an Austrian by birth?",
  "created_utc": 1642613546,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;What has always baffled me is why so many Germans supported Adolf Hitler who preached German nationalism but was not a German by birth, he was an Austrian who only became a German citizen in 1932 less than a year before he came to power as Chancellor of Germany in 1933. Why was it not an issue for Germans?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 121,
  "permalink": "/r/AskHistorians/comments/s7ogpy/why_did_the_germans_not_mind_that_adolf_hitler/",
  "subreddit": "AskHistorians",
  "id": "s7ogpy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "What has always baffled me is why so many Germans supported Adolf Hitler who\npreached German nationalism but was not a German by birth, he was an Austrian\nwho only became a German citizen in 1932 less than a year before he came to\npower as Chancellor of Germany in 1933. Why was it not an issue for…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私がいつも不思議に思うのは、なぜ多くのドイツ人が、アドルフ・ヒトラーを支持したのか、ということです。\nドイツ民族主義を説いたが、彼は生粋のドイツ人ではなく、オーストリア人であった。\n1932年、ドイツ国籍を取得したのは、就任の1年足らず前。\n1933年、ドイツの首相として権力を握った。なぜ、それが問題視されなかったのか...。",
      "title": "アドルフ・ヒトラーがオーストリア人であることを、なぜドイツ人は気にしなかったのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "一直让我困惑的是，为什么这么多德国人支持阿道夫-希特勒？\n他宣扬德国民族主义，但他并不是生来就是德国人，他是一个奥地利人。\n他是一个奥地利人，只是在1932年成为德国公民，在1933年他作为德国总理上台前不到一年的时间里\n他是一个奥地利人，在1932年才成为德国公民，距离他在1933年担任德国总理不到一年。为什么这不是一个问题呢？",
      "title": "为什么德国人不介意阿道夫-希特勒是奥地利人出身？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "一直讓我困惑的是，爲什麼這麼多德國人支持阿道夫-希特勒？\n他宣揚德國民族主義，但他並不是生來就是德國人，他是一個奧地利人。\n他是一個奧地利人，只是在1932年成爲德國公民，在1933年他作爲德國總理上臺前不到一年的時間裏\n他是一個奧地利人，在1932年才成爲德國公民，距離他在1933年擔任德國總理不到一年。爲什麼這不是一個問題呢？",
      "title": "爲什麼德國人不介意阿道夫-希特勒是奧地利人出身？"
    }
  ]
}