{
  "author": "crypto_grandma",
  "the_new_excerpt": "People across Myanmar have been lining up outside ATMs desperately trying to get\ntheir hands on their money as banks have closed following the coup.\n\nFor many of us who live in more stable countries, the motivation for owning\ncryptocurrencies may be no other than for speculative investment, but for…",
  "original_created_utc": 1612188332,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "缅甸各地的人们一直在ATM机外排队，拼命地想获得。\n由于政变后银行关闭，他们的手就会放在自己的钱上。\n\n对于我们许多生活在更稳定的国家的人来说，拥有的动机是：\n加密货币可能除了用于投机投资外，没有其他用途，但对于...",
      "title": "缅甸政变之际，银行纷纷关闭，这又是一个例子，说明为什么分散化货币如此重要。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "緬甸各地的人們一直在ATM機外排隊，拼命地想獲得。\n由於政變後銀行關閉，他們的手就會放在自己的錢上。\n\n對於我們許多生活在更穩定的國家的人來說，擁有的動機是：\n加密貨幣可能除了用於投機投資外，沒有其他用途，但對於...",
      "title": "緬甸政變之際，銀行紛紛關閉，這又是一個例子，說明爲什麼分散化貨幣如此重要。"
    }
  ],
  "title": "Banks closing in Myanmar as coup gets underway is another example of why a decentralised currency is so important",
  "created_utc": 1612237061,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>People across Myanmar have been lining up outside ATMs desperately trying to get their hands on their money as banks have closed following the coup. </p>\n\n<p>For many of us who live in more stable countries, the motivation for owning cryptocurrencies may be no other than for speculative investment, but for some people it really can be a matter of survival. Imagine if your bank freezes your account because you said something against the government. That can be a reality for some people, and you never know when you may be in a position similar to that yourself.</p>\n\n<p>Of course, the average person in Myanmar doesn&#39;t own any cryptocurrency, but this is an example of the kind of situations where a decentralised currency is so important. It means you&#39;re not dependent on your bank- you <em>are</em> your bank. We may still have a long way to go before we see cryptocurrencies being used by your average person for their day to day spending, but thank <del>god</del> Satoshi we now have that as an option. Hopefully we can all be a part of making that day come sooner rather than later.</p>\n</div><!-- SC_ON -->",
  "score": 168,
  "permalink": "/r/CryptoCurrency/comments/la3rsn/banks_closing_in_myanmar_as_coup_gets_underway_is/",
  "subreddit": "CryptoCurrency",
  "id": "la3rsn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518530870
}