{
  "author": "_martinshkreli_",
  "the_new_excerpt": "TITAN's crash was really absurd, I personally haven't seen anything this extreme\nyet. It crashed almost 100% in a few hours and now sits at 0.00000005% of its\nATH. That's something. I've seen many people in the past two days ask stuff\nlike: \"sure, it won't recover from that. But what if I just…",
  "original_created_utc": 1624003389,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "TITANのクラッシュは本当に無茶苦茶で、個人的にはここまで極端なものは見たことがありません。\nをまだ見たことがありません。数時間でほぼ100%の暴落をし、現在はATHの0.00000005%に留まっています。\nATH. これはすごいことです。この2日間で、多くの人が次のような質問をしています。\nのようなものを見ました。\"確かに、そこから回復することはないだろう。でも、もし私が...",
      "title": "TITANは2日前に60ドルだったのが、今は0.00000003ドルになっています。YOLOしてはいけない理由がここにあります（そう、それは時価総額です）。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "TITAN的崩溃真的很荒谬，我个人还没有见过这么极端的事情\n的情况。它在几个小时内几乎崩溃了100%，现在停留在0.00000005%的\nATH。这很了不起。在过去的两天里，我看到很多人问一些问题\n诸如。\"当然，它不会因此而恢复。但是，如果我只是...",
      "title": "两天前TITAN还在60美元，现在已经到了0.00000003美元。以下是你为什么不应该YOLO的原因（是的，这是市值）。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "TITAN的崩潰真的很荒謬，我個人還沒有見過這麼極端的事情\n的情況。它在幾個小時內幾乎崩潰了100%，現在停留在0.00000005%的\nATH。這很了不起。在過去的兩天裏，我看到很多人問一些問題\n諸如。\"當然，它不會因此而恢復。但是，如果我只是...",
      "title": "兩天前TITAN還在60美元，現在已經到了0.00000003美元。以下是你爲什麼不應該YOLO的原因（是的，這是市值）。"
    }
  ],
  "title": "TITAN was at $60 two days ago, now it's at $0.00000003. Here's why you shouldn't YOLO in (and yes it's market cap)",
  "created_utc": 1624013263,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>TITAN&#39;s crash was really absurd, I personally haven&#39;t seen anything this extreme yet. It crashed almost 100% in a few hours and now sits at 0.00000005% of its ATH. That&#39;s something. I&#39;ve seen many people in the past two days ask stuff like: &quot;sure, it won&#39;t recover from that. But what if I just invest like $10, if it goes back to even just one cent, a tiny fraction of the ATH, that would be a ton of money!&quot;</p>\n\n<p>And yes, it absolutely would be! And that alone should be enough to tell you that it can&#39;t be this easy. The thing is: because of how that whole network works, a lot of TITAN was printed when it crashed.</p>\n\n<p>10 days ago, the circulating supply was 116 million. Now it&#39;s 34 <strong>trillion</strong>, or 34,000 billion, or 34,000,000 million. Yeah, that&#39;s a lot. So let&#39;s consider the market cap, which is:</p>\n\n<p><strong>Market Cap =  Circulating Supply  X Coin Price</strong></p>\n\n<p>A coin price of 1 cent would mean a market cap of 344 billion, putting it on the #2 spot, higher than ETH. At 2 cents it would get close to BTC, at 5 cents its market cap would be higher than all other crypto combined.</p>\n\n<p>On iron.finance, the creators of the coin state &quot;WARNING: Please don&#39;t buy TITAN or IRON.&quot;. Listen to them. This coin doesn&#39;t have a chance to go up again and as always, coin price is a bad indicator, even if it used to be higher.</p>\n</div><!-- SC_ON -->",
  "score": 339,
  "permalink": "/r/CryptoCurrency/comments/o2jwc1/titan_was_at_60_two_days_ago_now_its_at_000000003/",
  "subreddit": "CryptoCurrency",
  "id": "o2jwc1",
  "is_self": true,
  "media": null,
  "is_video": false
}