{
  "author": "AskScienceModerator",
  "original_created_utc": 1636459242,
  "title": "AskScience AMA Series: Greetings, Science fans. I'm a paleontologist, science editor and author, Henry Gee. AMA about evolution, extinction, apocalyptic disaster and my latest book 'A (Very) Short History of Life on Earth'",
  "created_utc": 1636481346,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m an author and editor on the science journal <em>Nature</em>, the place where scientists like to publish their coolest finds. As <em>Nature</em>&#39;s resident fossil hound for more than 33 and a third revolutions (which must be a long playing record) I&#39;ve had the honor and privilege  of steering the first feathered dinosaurs, the fishapod <em>Tiktaalik</em> and the hobbit <em>Homo floresiensis</em> into the light. I know more secrets than the average spy. In my new book I&#39;ve poured it all on to the page and discovered a lot about evolution, extinction and climate change, both now and in the past. You can find out everything you need to know about my book here: <a href=\"http://www.averyshorthistoryoflifeonearth.com\">http://www.averyshorthistoryoflifeonearth.com</a>.</p>\n\n<p>I&#39;ll be here at 1pm ET (18 UT), AMA!</p>\n\n<p>Username: <a href=\"/u/Henry_Gee\">/u/Henry_Gee</a></p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/askscience/comments/qq25xa/askscience_ama_series_greetings_science_fans_im_a/",
  "subreddit": "askscience",
  "id": "qq25xa",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm an author and editor on the science journal Nature, the place where\nscientists like to publish their coolest finds. As Nature's resident fossil\nhound for more than 33 and a third revolutions (which must be a long playing\nrecord) I've had the honor and privilege of steering the first…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は科学雑誌「ネイチャー」の著者兼編集者です。\n科学者が最もクールな発見を発表する場所です。ネイチャーの専属化石収集家として\n私はネイチャー誌の専属化石収集家として、33.3回転以上（これは長い演奏記録に違いありません）、最初の...\n私は名誉と特権を持って、最初の...",
      "title": "AskScience AMAシリーズ。サイエンスファンの皆さん、こんにちは。古生物学者であり、科学編集者であり、作家でもあるヘンリー・ジーです。進化、絶滅、終末論的災害、そして私の最新作「A (Very) Short History of Life on Earth」についてAMAを行います。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是科学杂志《自然》的作者和编辑，在这里\n科学家喜欢在这里发表他们最酷的发现。作为《自然》杂志的常驻化石\n作为《自然》杂志的常驻化石猎手，在超过33又3次的旋转中（这一定是一个很长的游戏记录\n作为《自然》杂志的常驻化石猎手，我已经有超过33又1/3次的旋转记录（这一定是一个很长的播放记录），我很荣幸地指导了第一本《自然》杂志。",
      "title": "AskScience AMA系列。科学迷们，你们好。我是古生物学家、科学编辑和作家亨利-吉。关于进化、灭绝、世界末日灾难和我的新书《地球生命的（非常）简史》的AMA。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是科學雜誌《自然》的作者和編輯，在這裏\n科學家喜歡在這裏發表他們最酷的發現。作爲《自然》雜誌的常駐化石\n作爲《自然》雜誌的常駐化石獵手，在超過33又3次的旋轉中（這一定是一個很長的遊戲記錄\n作爲《自然》雜誌的常駐化石獵手，我已經有超過33又1/3次的旋轉記錄（這一定是一個很長的播放記錄），我很榮幸地指導了第一本《自然》雜誌。",
      "title": "AskScience AMA系列。科學迷們，你們好。我是古生物學家、科學編輯和作家亨利-吉。關於進化、滅絕、世界末日災難和我的新書《地球生命的（非常）簡史》的AMA。"
    }
  ]
}