{
  "author": "partymsl",
  "original_created_utc": 1648575658,
  "title": "Let's face it. Most of us see Crypto as a investment like stocks not a currency.",
  "created_utc": 1648600349,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;While this sub actively wants that as many countries and people as possible would use Crypto as an actually currency so that it replaces the dollar in a  more decentralized way. On the other side we all also want that Crypto just keeps doing 10x every year so that we make a lot of money.&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t know about you but having something as a world currency that occasionally does a 10x up and down, seems chaotic to say the least.&lt;/p&gt;\n\n&lt;p&gt;And I personally think it&amp;#39;s completly okay to see Crypto as a investment than a currency right now. But I would also say that at one point Crypto will be so big that it would be stabke on the price. Meaning we won&amp;#39;t see any major dips but also not any 10x or so over a short period. This may be the only way of Crypto as a currency.&lt;/p&gt;\n\n&lt;p&gt;Obviously we all want to make some money but the greater cause of Crypto wouod not fulfill that. And I&amp;#39;m ready that one day Crypto won&amp;#39;t be as fun as today but more useful to everyone.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 325,
  "permalink": "/r/CryptoCurrency/comments/trakgb/lets_face_it_most_of_us_see_crypto_as_a/",
  "subreddit": "CryptoCurrency",
  "id": "trakgb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "While this sub actively wants that as many countries and people as possible\nwould use Crypto as an actually currency so that it replaces the dollar in a\nmore decentralized way. On the other side we all also want that Crypto just\nkeeps doing 10x every year so that we make a lot of money.\n\nDon't know…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブは、一人でも多くの国や人が積極的に参加することを望んでいるが\n暗号を実際の通貨として使用することで、ドルに取って代わることができます。\nより非中央集権的な方法で。その一方で私たちは暗号が単に\n毎年10倍になり続け、大儲けできる。\n\nどうなんだろう...。",
      "title": "現実を直視しましょう。私たちの多くは、Cryptoを通貨ではなく、株式のような投資として見ています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "虽然这个子积极希望尽可能多的国家和人民\n将使用加密货币作为一种实际的货币，以便它以一种更分散的方式取代美元。\n更加分散化的方式。在另一方面，我们也希望加密货币\n每年保持10倍的增长，这样我们就能赚很多钱。\n\n我不知道...",
      "title": "让我们面对现实吧。我们大多数人把加密货币看作是一种像股票一样的投资，而不是一种货币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "雖然這個子積極希望儘可能多的國家和人民\n將使用加密貨幣作爲一種實際的貨幣，以便它以一種更分散的方式取代美元。\n更加分散化的方式。在另一方面，我們也希望加密貨幣\n每年保持10倍的增長，這樣我們就能賺很多錢。\n\n我不知道...",
      "title": "讓我們面對現實吧。我們大多數人把加密貨幣看作是一種像股票一樣的投資，而不是一種貨幣。"
    }
  ]
}