{
  "author": "partymsl",
  "original_created_utc": 1644861232,
  "title": "The coinbase ad wasn't just a QR-Code. It showed the simplicity of Crypto. That's very important, especially for Crypto.",
  "created_utc": 1644895995,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I see everyone here is having a good laugh over that coinbase ad and yeah I do also. Spending 16M for an ad and the just putting on a QR-Code for the site, something everyone had access to, seems like a meme that they made themselves. But it&amp;#39;s actually a lot more. It&amp;#39;s what crypto needs to most:&lt;/p&gt;\n\n&lt;p&gt;Simplicity.&lt;/p&gt;\n\n&lt;p&gt;Showing just a QR code on a black screen. So already an ad we all could have made in minutes. Simple. You just have to scan that ad with your fun and boom you are all ready for Crypto trading. Or even investing in general as even that is seen and complicated.&lt;/p&gt;\n\n&lt;p&gt;Crypto is seen by most people as something over the top complicated tech thing. That&amp;#39;s a reputation that at the beginning is going to help but it won&amp;#39;t let mass adoption happen. Many people don&amp;#39;t trade crypto because they think it&amp;#39;s just too complicated. &lt;/p&gt;\n\n&lt;p&gt;And in today&amp;#39;s world people will just do what&amp;#39;s fast and easy to do. Making crypto have that reputation is going to help a LOT with mass adoption.&lt;/p&gt;\n\n&lt;p&gt;But obviously that does not change that coinbase was literally not capable of setting up more servers so that their site does not crash minutes later.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 303,
  "permalink": "/r/CryptoCurrency/comments/ssgq4c/the_coinbase_ad_wasnt_just_a_qrcode_it_showed_the/",
  "subreddit": "CryptoCurrency",
  "id": "ssgq4c",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I see everyone here is having a good laugh over that coinbase ad and yeah I do\nalso. Spending 16M for an ad and the just putting on a QR-Code for the site,\nsomething everyone had access to, seems like a meme that they made themselves.\nBut it's actually a lot more. It's what crypto needs to…"
}