{
  "author": "ipartytoomuch",
  "the_new_excerpt": "https://blogs.imf.org/2021/03/03/the-evidence-is-in-on-negative-interest-rate-policies/\n\nhttps://www.imf.org/en/Publications/Departmental-Papers-Policy-Papers/Issues/2021/03/01/Negative-Interest-Rates-Taking-Stock-of-the-Experience-So-Far-50115\n\nInterest rates are low, and “lower for longer” has…",
  "original_created_utc": 1615767209,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "https://blogs.imf.org/2021/03/03/the-evidence-is-in-on-negative-interest-rate-policies/\n\nhttps://www.imf.org/en/Publications/Departmental-Papers-Policy-Papers/Issues/2021/03/01/Negative-Interest-Rates-Taking-Stock-of-the-Experience-So-Far-50115\n\n利率低了，\"低久一点 \"有...",
      "title": "负利率政策证据确凿，且基本奏效"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "https://blogs.imf.org/2021/03/03/the-evidence-is-in-on-negative-interest-rate-policies/\n\nhttps://www.imf.org/en/Publications/Departmental-Papers-Policy-Papers/Issues/2021/03/01/Negative-Interest-Rates-Taking-Stock-of-the-Experience-So-Far-50115\n\n利率低了，\"低久一點 \"有...",
      "title": "負利率政策證據確鑿，且基本奏效"
    }
  ],
  "title": "The evidence is in on negative interest rate policies, and it has largely worked",
  "created_utc": 1615776495,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://blogs.imf.org/2021/03/03/the-evidence-is-in-on-negative-interest-rate-policies/\">https://blogs.imf.org/2021/03/03/the-evidence-is-in-on-negative-interest-rate-policies/</a></p>\n\n<p><a href=\"https://www.imf.org/en/Publications/Departmental-Papers-Policy-Papers/Issues/2021/03/01/Negative-Interest-Rates-Taking-Stock-of-the-Experience-So-Far-50115\">https://www.imf.org/en/Publications/Departmental-Papers-Policy-Papers/Issues/2021/03/01/Negative-Interest-Rates-Taking-Stock-of-the-Experience-So-Far-50115</a></p>\n\n<p>Interest rates are low, and “lower for longer” has become something of a mantra among policy makers, regulators, and other market watchers. But negative interest rates raise an entirely new set of questions.</p>\n\n<p>After eight years of experience with negative interest rate policies, the initial skepticism (paying interest to borrowers rather than savers was certainly unprecedented) has proven largely misplaced. The evidence so far suggests that negative interest policies have worked.</p>\n\n<p>The evidence so far indicates negative interest rate policies have succeeded in easing financial conditions without raising significant financial stability concerns.</p>\n\n<p>Since 2012, a number of central banks introduced negative interest rate policies. Central banks in Denmark, euro area, Japan, Sweden, and Switzerland turned to such policies in response to persistently below-target inflation rates (most central banks set rates as part of their broader mandate to keep prices stable, thereby supporting jobs and economic growth). These banks were also responding to a very low “neutral real interest rate”—that is, the real interest rate at which monetary policy is neither contractionary nor expansionary. The move reflected the central banks’ struggle to boost inflation even when they had already pushed interest rates to zero.</p>\n\n<p>The effects of the COVID-19 crisis, in an environment where many central banks are constrained, have brought back negative interest rate policies to the forefront.</p>\n\n<p>Overall, these policies have eased financial conditions, and, in the process, likely supported growth and inflation. However, negative rate policies remain politically controversial, partly because they are often misunderstood.</p>\n\n<p>Unfamiliar territory</p>\n\n<p>At the time of introduction, many questioned whether negative interest rate policies would work as intended.</p>\n\n<p>There were concerns about risks, given the untested, and in many ways counterintuitive, nature of the move. Would banks, households, and firms shift massively to cash in response to the new policies, thereby weakening the link between central bank rates and other interest rates? Would banks resist cutting lending rates, or even reduce lending to prevent profits from falling? Would negative interest rate policies provide a meaningful monetary stimulus?</p>\n\n<p>Concerns about potential side effects of these novel policies also arose. Chief among the concerns were financial stability risks stemming from lowered bank profitability, and fear of disruptions in the functioning of financial markets and money market funds.</p>\n\n<p>Based on the evidence to date, these fears have largely failed to materialize. Negative interest rate policies have proven their ability to stimulate inflation and output by roughly as much as comparable conventional interest rate cuts or other unconventional monetary policies. For example, some estimate that negative interest rate policies were up to 90 percent as effective as conventional monetary policy. They also led to lower money-market rates, long-term yields, and bank rates.</p>\n\n<p>Deposit rates for corporate deposits have dropped more than those on retail deposits—because it is costlier for companies than for individuals to switch into cash. Bank lending volumes have generally increased. And since neither banks nor their customers have markedly shifted to cash, interest rates can probably become even more negative before that happens.</p>\n\n<p>So far, so good</p>\n\n<p>Any adverse effects on bank profits and financial stability have so far been limited.</p>\n\n<p>Overall, bank profits have not deteriorated, although banks that rely more on deposit funding—as well as smaller and more specialized banks—have suffered more. Larger banks have increased lending, introduced fees on deposit accounts, and benefited from capital gains. Of course, it is possible that the absence of a significant impact on bank profitability mostly reflects shorter-term effects, which could potentially be reversed over time. And side effects may still arise if policy rates go even more negative.</p>\n\n<p>Money market funds in countries that have adopted negative interest rate policies have not collapsed. And, even if the existing “low-for-long” environment does create significant financial stability concerns (as it induces a search for yield or excessive risk taking by financial institutions), negative interest rate policies per se do not appear to have compounded the problem. For example, the increase in bank risk-taking does not appear to have been excessive.</p>\n\n<p>Given this evidence, why haven’t more central banks jumped on board? The reasons are likely related to institutional and other country characteristics. Institutional and legal constraints may play a role, and some financial systems—because of their structure or interconnection with global financial markets—may be more prone to suffer adverse side effects from negative interest rate policies. For example, countries with many small banks that rely more on household deposits as a main source of funding may be more reluctant to adopt negative interest rates.</p>\n\n<p>Even the adopting central banks have moved tentatively, typically with small interest rate cuts because of the risk that negative side effects become more apparent if the negative rate policy lasts for very long, or if rates go very negative.</p>\n\n<p>In sum, the evidence so far indicates negative interest rate policies have succeeded in easing financial conditions without raising significant financial stability concerns. Thus, central banks that adopted negative rates may be able to cut them further. And those non-adopting central banks should not rule out adding a similar policy to their toolkit—even if they may be unlikely to use it.</p>\n\n<p>Ultimately, given the low level of the neutral real interest rate, many central banks may be forced to consider negative interest rate policies sooner or later.</p>\n</div><!-- SC_ON -->",
  "score": 730,
  "permalink": "/r/investing/comments/m58453/the_evidence_is_in_on_negative_interest_rate/",
  "subreddit": "investing",
  "id": "m58453",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147379962
}