{
  "author": "DangerousAd7359",
  "original_created_utc": 1631947740,
  "title": "Former tomboys who did a 180 & became totally feminine in appearance, what caused you to make such drastic change?",
  "created_utc": 1631971569,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>First let me clarify that I am not referring to women who were tomboy and then changed up a bit and are now somewhere in the middle of the feminine and masculine spectrum. I think that is pretty common in real life and many of my female friends are like that.</p>\n\n<p>I am asking about women who went from one end of the spectrum to the opposite end, specifically in appearance. For example, someone who was a total tomboy at some point of her life but who are now all girly and almost exclusively wears dresses and skirts. I have seen some women described themselves as such on the Internet but I have never seen one in real life.</p>\n\n<p>So, if you are one of these women, what were the reasons that caused you to change so drastically?</p>\n\n<p>Thanks in advance for any answer! Have a nice day!</p>\n</div><!-- SC_ON -->",
  "score": 131,
  "permalink": "/r/AskWomen/comments/pqhhs9/former_tomboys_who_did_a_180_became_totally/",
  "subreddit": "AskWomen",
  "id": "pqhhs9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "First let me clarify that I am not referring to women who were tomboy and then\nchanged up a bit and are now somewhere in the middle of the feminine and\nmasculine spectrum. I think that is pretty common in real life and many of my\nfemale friends are like that.\n\nI am asking about women who went from…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最初に断っておきますが、おてんばだった女性が少し変わって、今では何かに夢中になっているということではありません。\n女性らしさと男性らしさの中間に位置する女性のことではありません。\n男性的なものと女性的なものの中間にいる女性のことではありません。現実にはよくあることだと思いますし、私の女性の友人にもそういう人がたくさんいます。\n女性の友人の多くがそうです。\n\n私が質問しているのは、おてんば娘から少し変わって、今では女性らしさと男性らしさの中間にいる女性のことです。",
      "title": "元おてんば娘が180度変わって完全に女性的な外見になったわけですが、そのような急激な変化を起こした原因は何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "首先，让我澄清一下，我指的不是那些曾经是假小子，后来改变了一些，现在处于女性和男性中间的女性。\n我指的不是那些曾经是假小子，后来改变了一些，现在处于女性和男性的中间位置的女性。\n男性化的光谱。我认为这在现实生活中是很常见的，我的许多女性朋友都是这样。\n我的许多女性朋友都是这样的。\n\n我问的是那些从 \"假小子 \"变成 \"真小子 \"的女性。",
      "title": "曾经的假小子们做了180度的改变，在外表上变得完全女性化，是什么导致你做出如此巨大的改变？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，讓我澄清一下，我指的不是那些曾經是假小子，後來改變了一些，現在處於女性和男性中間的女性。\n我指的不是那些曾經是假小子，後來改變了一些，現在處於女性和男性的中間位置的女性。\n男性化的光譜。我認爲這在現實生活中是很常見的，我的許多女性朋友都是這樣。\n我的許多女性朋友都是這樣的。\n\n我問的是那些從 \"假小子 \"變成 \"真小子 \"的女性。",
      "title": "曾經的假小子們做了180度的改變，在外表上變得完全女性化，是什麼導致你做出如此巨大的改變？"
    }
  ]
}