{
  "approved_at_utc": null,
  "subreddit": "Bogleheads",
  "selftext": "A frequent question that comes up often in this subreddit is, \"The US has trounced Ex-US for the past decade. Why do I need to even bother investing internationally?\" With this post, I'd like to propose an answer to this question -- and to avoid having to repeat myself in comments.\n\nMy main issue with this question is that US versus Ex-US isn't an apples-to-apples comparison. In statistician-speak, you're essentially looking at a single probability distribution versus a joint probability distribution.\n\nWhy is this a problem? When you combine multiple probability distributions, the resulting joint probability distribution tends to decrease in variance and form around some common mean. (See also: [https://en.wikipedia.org/wiki/Central\\_limit\\_theorem](https://en.wikipedia.org/wiki/Central_limit_theorem))\n\nTurning to stock returns (I'm simplifying here), each country's stock market returns is in essence a single probability distribution. Generally, stock market returns are highly skewed and have high variance, with the best days for returns being concentrated in just a few instances. (This is why everyone says don't try to time the market.)\n\nNow, what do you think would happen, if we combined all these individual probability distributions representing individual countries' stock market returns together? Obviously, the resulting joint probability distribution in general would have lower skew and variance, and thereby smoothing out extreme positive or negative outcomes.\n\nTo put this in perspective, the best developed market to have invested in over the past twenty years *was not the US*. It was *Denmark*. That's right: Denmark. The Danish stock market returned 11.7%, compared to the US' paltry 7.0% over that time period. (Source: [https://www.evidenceinvestor.com/which-country-will-outperform-next-is-irrelevant/](https://www.evidenceinvestor.com/which-country-will-outperform-next-is-irrelevant/)). Had you invested $100k in 2001 in Denmark, that money would now be over $900k, compared to less than $400k in the US. (The Danish market beat the US last year and did not too badly relative to the US over the past 5 and 10 years either.)\n\nDid you notice that the Danish stock market had a such great returns for so long? Unless you were keeping close tabs on the Nasdaq Copenhagen index (which face it, very, very few of you were), you wouldn't have noticed. This is because the Danish stock market returns were blended into the overall \"ex-US\" market in your VXUS ETF or VTIAX mutual fund. We should not be surprised by seeing a highly skewed outcome with individual countries, as we are currently observing with the US stock market.\n\nAnyone can easily pick individual countries' stock markets *post hoc.* You can now buy ETFs for individual countries' stock market, if you really wanted to. (Denmark's is $EDEN.) But I personally don't have confidence in my stock or country picking abilities, so I invest globally.\n\nAnyhow, this is my proposal to answer this perennial question. Please feel free to point out anything that is wrong with my line of thinking, but do note that I'm some random person on Reddit and I've made many simplifications here.",
  "author_fullname": "t2_czze8qco",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "A Modest Proposal to Resolve the US vs Ex-US Debate: Frame it Statistically",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/Bogleheads",
  "hidden": false,
  "pwls": 7,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": true,
  "name": "t3_rfwx58",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.93,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 196,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 196,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": 1639449833,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1639449127,
  "link_flair_type": "text",
  "wls": 7,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.Bogleheads",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A frequent question that comes up often in this subreddit is, &amp;quot;The US has trounced Ex-US for the past decade. Why do I need to even bother investing internationally?&amp;quot; With this post, I&amp;#39;d like to propose an answer to this question -- and to avoid having to repeat myself in comments.&lt;/p&gt;\n\n&lt;p&gt;My main issue with this question is that US versus Ex-US isn&amp;#39;t an apples-to-apples comparison. In statistician-speak, you&amp;#39;re essentially looking at a single probability distribution versus a joint probability distribution.&lt;/p&gt;\n\n&lt;p&gt;Why is this a problem? When you combine multiple probability distributions, the resulting joint probability distribution tends to decrease in variance and form around some common mean. (See also: &lt;a href=\"https://en.wikipedia.org/wiki/Central_limit_theorem\"&gt;https://en.wikipedia.org/wiki/Central_limit_theorem&lt;/a&gt;)&lt;/p&gt;\n\n&lt;p&gt;Turning to stock returns (I&amp;#39;m simplifying here), each country&amp;#39;s stock market returns is in essence a single probability distribution. Generally, stock market returns are highly skewed and have high variance, with the best days for returns being concentrated in just a few instances. (This is why everyone says don&amp;#39;t try to time the market.)&lt;/p&gt;\n\n&lt;p&gt;Now, what do you think would happen, if we combined all these individual probability distributions representing individual countries&amp;#39; stock market returns together? Obviously, the resulting joint probability distribution in general would have lower skew and variance, and thereby smoothing out extreme positive or negative outcomes.&lt;/p&gt;\n\n&lt;p&gt;To put this in perspective, the best developed market to have invested in over the past twenty years &lt;em&gt;was not the US&lt;/em&gt;. It was &lt;em&gt;Denmark&lt;/em&gt;. That&amp;#39;s right: Denmark. The Danish stock market returned 11.7%, compared to the US&amp;#39; paltry 7.0% over that time period. (Source: &lt;a href=\"https://www.evidenceinvestor.com/which-country-will-outperform-next-is-irrelevant/\"&gt;https://www.evidenceinvestor.com/which-country-will-outperform-next-is-irrelevant/&lt;/a&gt;). Had you invested $100k in 2001 in Denmark, that money would now be over $900k, compared to less than $400k in the US. (The Danish market beat the US last year and did not too badly relative to the US over the past 5 and 10 years either.)&lt;/p&gt;\n\n&lt;p&gt;Did you notice that the Danish stock market had a such great returns for so long? Unless you were keeping close tabs on the Nasdaq Copenhagen index (which face it, very, very few of you were), you wouldn&amp;#39;t have noticed. This is because the Danish stock market returns were blended into the overall &amp;quot;ex-US&amp;quot; market in your VXUS ETF or VTIAX mutual fund. We should not be surprised by seeing a highly skewed outcome with individual countries, as we are currently observing with the US stock market.&lt;/p&gt;\n\n&lt;p&gt;Anyone can easily pick individual countries&amp;#39; stock markets &lt;em&gt;post hoc.&lt;/em&gt; You can now buy ETFs for individual countries&amp;#39; stock market, if you really wanted to. (Denmark&amp;#39;s is $EDEN.) But I personally don&amp;#39;t have confidence in my stock or country picking abilities, so I invest globally.&lt;/p&gt;\n\n&lt;p&gt;Anyhow, this is my proposal to answer this perennial question. Please feel free to point out anything that is wrong with my line of thinking, but do note that I&amp;#39;m some random person on Reddit and I&amp;#39;ve made many simplifications here.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2shb7",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "rfwx58",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "hidden-semi-markov",
  "discussion_type": null,
  "num_comments": 2,
  "send_replies": true,
  "whitelist_status": "some_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/Bogleheads/comments/rfwx58/a_modest_proposal_to_resolve_the_us_vs_exus/",
  "parent_whitelist_status": "some_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/Bogleheads/comments/rfwx58/a_modest_proposal_to_resolve_the_us_vs_exus/",
  "subreddit_subscribers": 119699,
  "created_utc": 1639451720,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1639449127,
  "the_new_excerpt": "A frequent question that comes up often in this subreddit is, \"The US has\ntrounced Ex-US for the past decade. Why do I need to even bother investing\ninternationally?\" With this post, I'd like to propose an answer to this question\n-- and to avoid having to repeat myself in comments.\n\nMy main issue…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブレディットでよく出る質問は、「米国は\n過去10年間、Ex-USに打ち勝った。なぜ、わざわざ投資する必要があるのか？\n国際的な\" 今回の投稿で、この問いに対する答えを提案したいと思います。\n-- そして、コメントで同じことを繰り返すのを避けるためです。\n\n私の主な問題は...",
      "title": "US vs Ex-US論争を解決するためのささやかな提案とは？統計的に考える"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在这个分论坛上经常出现的一个问题是，\"美国已经\n在过去的十年里，美国已经打败了前美国。为什么我还需要费心去投资\n国际投资？\" 通过这篇文章，我想对这个问题提出一个答案\n--并避免在评论中重复自己的观点。\n\n我的主要问题是...",
      "title": "解决美国与前美国之争的适度建议。从统计学的角度看问题"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在這個分論壇上經常出現的一個問題是，\"美國已經\n在過去的十年裏，美國已經打敗了前美國。爲什麼我還需要費心去投資\n國際投資？\" 通過這篇文章，我想對這個問題提出一個答案\n--並避免在評論中重複自己的觀點。\n\n我的主要問題是...",
      "title": "解決美國與前美國之爭的適度建議。從統計學的角度看問題"
    }
  ],
  "source_updated_at": 1639734116888
}