{
  "author": "exbeseven",
  "the_new_excerpt": "I’m really new to crypto and I joined this sub in order learn more about crypto\nin general and interesting new projects in particular.\n\nHowever, I have seen hardly any helpful posts like that in the past few weeks.\nInstead it seems like the same 3 topics just get reposted over and over again:\n“don’t…",
  "original_created_utc": 1621496161,
  "title": "Is this sub always like this or did I just pick the wrong time to join?",
  "created_utc": 1621525530,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m really new to crypto and I joined this sub in order learn more about crypto in general and interesting new projects in particular.</p>\n\n<p>However, I have seen hardly any helpful posts like that in the past few weeks. Instead it seems like the same 3 topics just get reposted over and over again: “don’t panic”, “I finally bought/sold” and “Elon did x”.</p>\n\n<p>Is this just a phase because of the recent market movement or did I  misjudge the purpose of this sub? If so can you recommend any places that would be more suitable for a crypto beginner to actually learn something useful?</p>\n</div><!-- SC_ON -->",
  "score": 248,
  "permalink": "/r/CryptoCurrency/comments/ngtuu4/is_this_sub_always_like_this_or_did_i_just_pick/",
  "subreddit": "CryptoCurrency",
  "id": "ngtuu4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197381653,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は暗号に本当に新しいですし、私は暗号についてもっと学ぶために、このサブに参加しました。\n一般的に、そして特に興味深い新しいプロジェクトについて。\n\nしかし、この数週間、そのような役に立つ投稿をほとんど見かけません。\nそれどころか、同じ3つのトピックが何度も何度も再投稿されているような気がします。\n\"やめろ...",
      "title": "このサブはいつもこうなのか、それとも参加するタイミングを間違えたのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我真的是加密货币的新手，我加入这个子，是为了学习更多关于加密货币的知识。\n特别是有趣的新项目。\n\n然而，在过去的几周里，我几乎没有看到任何这样的有用的帖子。\n相反，似乎同样的3个主题被重复张贴了一遍又一遍。\n\"不要...",
      "title": "这个分队总是这样吗，还是我选错了加入的时间？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我真的是加密貨幣的新手，我加入這個子，是爲了學習更多關於加密貨幣的知識。\n特別是有趣的新項目。\n\n然而，在過去的幾周裏，我幾乎沒有看到任何這樣的有用的帖子。\n相反，似乎同樣的3個主題被重複張貼了一遍又一遍。\n\"不要...",
      "title": "這個分隊總是這樣嗎，還是我選錯了加入的時間？"
    }
  ]
}