{
  "author": "ElephantsRTasty",
  "original_created_utc": 1640022785,
  "title": "At this rate, isn’t Covid now endemic worldwide? When will we treat it like the flu and move on?",
  "created_utc": 1640060147,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’d like to preface this by saying I am fully vaxxed + booster and I wear my mask out in public everywhere, and I encouraged my hesitant parents to get the vaccine, etc. I want people to make safe choices for them and everyone around them. &lt;/p&gt;\n\n&lt;p&gt;But its been two years now and 2022 will just be the same. Tons of people everywhere will always refuse the vaccine and refuse masks. Pretty much anyone who hasn’t gotten the vaccine by now will never get it. People will continue to fight against mask mandates etc. We will never get 100% cooperation at fighting covid, and especially as new variants evolve it will continue to spread.&lt;/p&gt;\n\n&lt;p&gt;Just like the flu, people with covid who do get vaxxed and boosters may have to go to the hospital. My mom had confirmed Flu and not covid last year, and even though she had gotten her flu shot, she almost needed to go to the hospital. &lt;/p&gt;\n\n&lt;p&gt;It’s awful that so many people have died from covid, and that so many of those were preventable. But are we really going to be like this 2 years from now? 5 years? At this rate aren’t we going to end up having yearly boosters just like the flu? When will the world move on?&lt;/p&gt;\n\n&lt;p&gt;Personally, as this drags out, my mental health continues to decline. People in my area are still hesitant to go out and when I go out it doesnt feel the same. It’s been extraordinarily difficult to make friends when everyone’s either at home or wearing masks, and loneliness is taking a big toll on me. Virtual calls like Zoom make me feel like im talking to an AI or something, i need a real person in front of me. I dont see local leaders taking into account mental health. &lt;/p&gt;\n\n&lt;p&gt;Part of me knows the right thing to do is be as safe as possible for the sake of everyone else. But another part of me is just exhausted and I want the world to move on….&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/rkszat/at_this_rate_isnt_covid_now_endemic_worldwide/",
  "subreddit": "TooAfraidToAsk",
  "id": "rkszat",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’d like to preface this by saying I am fully vaxxed + booster and I wear my\nmask out in public everywhere, and I encouraged my hesitant parents to get the\nvaccine, etc. I want people to make safe choices for them and everyone around\nthem.\n\nBut its been two years now and 2022 will just be the same.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "前置きが長くなりましたが、私はワクチン接種＋ブースターで完全防備しています。\nマスクはどこでも人前に出ますし、躊躇している親には受けるように勧めました。\nワクチンなど 自分にとっても、周りの人にとっても、安全な選択をしてほしい。\nを使用します。\n\nでも、もう2年経ったし、2022年も同じようになるんだろうな...。",
      "title": "この調子でいくと、コビッドはもはや世界的な流行ではないか？いつになったら、インフルエンザと同じように治療して、次のステップに進めるのだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想先说一下，我已经完全接种了疫苗+加强剂，我在公共场合都戴着我的口罩。\n我鼓励我那些犹豫不决的父母去接种疫苗。\n疫苗，等等。我希望人们能够为自己和周围的人做出安全的选择。\n他们身边的人做出安全的选择。\n\n但现在已经两年了，2022年将会是一样的....。",
      "title": "按照这个速度，Covid现在不是在全世界范围内流行了吗？我们什么时候才能像对待流感一样对待它并继续前进？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想先說一下，我已經完全接種了疫苗+加強劑，我在公共場合都戴着我的口罩。\n我鼓勵我那些猶豫不決的父母去接種疫苗。\n疫苗，等等。我希望人們能夠爲自己和周圍的人做出安全的選擇。\n他們身邊的人做出安全的選擇。\n\n但現在已經兩年了，2022年將會是一樣的....。",
      "title": "按照這個速度，Covid現在不是在全世界範圍內流行了嗎？我們什麼時候才能像對待流感一樣對待它並繼續前進？"
    }
  ]
}