{
  "author": "justmeeemo",
  "the_new_excerpt": "To give you guys a bit of context, I never met my grandfather since he passed\naway before I was born but I always had a very close relationship with his\nbrother since he was the closest to a grandfather I've ever known and a great\nman to me.\n\nHe has 3 children. The youngest being 35, the next one 41…",
  "original_created_utc": 1614206500,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "给你们说一下，自从我爷爷去世后，我就再也没见过他了\n在我出生前就离开了，但我和他的关系一直很密切。\n因为他是我所知道的最亲近的祖父，也是一个伟大的...\n男人对我。\n\n他有三个孩子。最小的35岁，其次是41岁... ...",
      "title": "我爷爷的哥哥把大部分遗产都留给了我，没有给他的孩子们，现在他们希望我把遗产给他们。我应该怎么做？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "給你們說一下，自從我爺爺去世後，我就再也沒見過他了\n在我出生前就離開了，但我和他的關係一直很密切。\n因爲他是我所知道的最親近的祖父，也是一個偉大的...\n男人對我。\n\n他有三個孩子。最小的35歲，其次是41歲... ...",
      "title": "我爺爺的哥哥把大部分遺產都留給了我，沒有給他的孩子們，現在他們希望我把遺產給他們。我應該怎麼做？"
    }
  ],
  "title": "My Grandfather's brother left me most of his inheritance, nothing to his children and now they expect me to give it to them. What should I do?",
  "created_utc": 1614223861,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>To give you guys a bit of context, I never met my grandfather since he passed away before I was born but I always had a very close relationship with his brother since he was the closest to a grandfather I&#39;ve ever known and a great man to me.</p>\n\n<p>He has 3 children. The youngest being 35, the next one 41 and the oldest 44. I&#39;ve been visiting him every week throughout my life frankly because he&#39;s like that cool uncle and very close to my father too. By the time I was about 14 years old I stopped seeing any of his children around, like ever. They slowly moved out and carried on with their lives. I&#39;d eventually ask and he&#39;d say that they&#39;re fine, doing their lives. One day he opened up and told me that they never had a great relationship, it was partly his fault and partly theirs. \nIt&#39;s a religious family so if you&#39;re living under his roof It&#39;s his rules obviously (within reason) but as he grew older and his health deteriorated (cancer) they felt more comfortable doing stuff he wouldn&#39;t allow in his house like smoking weed, bringing girls around... he got fed up and kicked them out. </p>\n\n<p>It turns out that since telling them to move elsewhere (they were adults and working already) they never stepped foot in his place or picked up his calls, neither of them. </p>\n\n<p>Over the years his health kept getting worse and worse so I&#39;d bring him food from home a few times a week and watch WWE together, play cards, ask him for advice or helping him in whatever he needed, I felt like it was a stress free place to go with someoneI liked so it was no big deal helpinghim in whatever I could...</p>\n\n<p>He recently passed away and it hit me hard, they say it was because of his health condition, it pissed me off but I&#39;m doing better.</p>\n\n<p>Now, the wife and him were separated and she passed away years ago, all the family he had alive was my father, me and my siblings and his own kids. I received a call saying that he left me something on his inheritance.</p>\n\n<p>I went there and it turns out that he left me 67k, I lost breath for a second since I never in a million years would&#39;ve thought about will or inheritance from him to me or that he even had that kind of money. He left the rest of his assets/cash from the bank to some of my siblings and parents. Gave some to charity, some to friends but nothing to his children, zero. He didn&#39;t have a vast amount of wealth, humble life, low expenses... so it caught me off guard when I found out that most of his inheritance was for me alone. The children found out obviously and they aren&#39;t happy, they say that they deserve that money and not me, so I should give it to them. The 3 of them are a mess. Not doing drugs or anything but barely ever tried to accomplish anything in life so doing anything to get by... I&#39;m 25 now and make a cool amount of money, not a lot but I live very comfortably. It makes me feel bad that their dad left them nothing and they aren&#39;t doing great financially but at the same time deep inside I know that they don&#39;t deserve it. They didn&#39;t even attend the funeral but expected money? That&#39;s below low. I understand that I&#39;ll have to pay taxes on it and I&#39;ve been spending time investigating about everything I&#39;ll have to do until I&#39;m clear. I wanted to use part of the money to pay for 2 of my sister&#39;s Uni (roughly 32k combined but not yet, they&#39;re still in high school) and keep the rest in a high interest savings account since my parents themselves got a fairly substantial amount too until I decide what to do with some of it because I have no debt.</p>\n\n<p>Do you guys think I should give them a part of what I got given by his dad or not?</p>\n\n<p>Tl;dr: my uncles want me to give them the inheritance their father gave me because he left them nothing. He left them nothing because they pretty much abandoned him.</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/TooAfraidToAsk/comments/lrp714/my_grandfathers_brother_left_me_most_of_his/",
  "subreddit": "TooAfraidToAsk",
  "id": "lrp714",
  "is_self": true,
  "media": null,
  "is_video": false
}