{
  "author": "MayonnaisedMother",
  "the_new_excerpt": "I'm sorry if I'm using a lot of incorrect terms– I'm not really familiar with\nreligion in general, but I've heard a few times that in Muslim heaven, dudes get\na lot of virgins to bang after they die.\n\nMy question is, where are these virgins coming from? Does the Muslim god just\nmake more when supply…",
  "original_created_utc": 1616456023,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "如果我使用了很多不正确的术语，我很抱歉--我并不是很熟悉。\n但我听说过几次，在穆斯林的天堂里，帅哥们会得到。\n很多处女在死后都会被人上。\n\n我的问题是，这些处女从哪里来？难道穆斯林的神只是\n供不应求",
      "title": "在穆斯林的天堂里，处女们从哪里来，失去童贞后又到哪里去？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果我使用了很多不正確的術語，我很抱歉--我並不是很熟悉。\n但我聽說過幾次，在穆斯林的天堂裏，帥哥們會得到。\n很多處女在死後都會被人上。\n\n我的問題是，這些處女從哪裏來？難道穆斯林的神只是\n供不應求",
      "title": "在穆斯林的天堂裏，處女們從哪裏來，失去童貞後又到哪裏去？"
    }
  ],
  "title": "In Muslim heaven, where are the virgins coming from and where do they go after they lose their virginity?",
  "created_utc": 1616510210,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m sorry if I&#39;m using a lot of incorrect terms– I&#39;m not really familiar with religion in general, but I&#39;ve heard a few times that in Muslim heaven, dudes get a lot of virgins to bang after they die.</p>\n\n<p>My question is, where are these virgins coming from? Does the Muslim god just make more when supply is running low? </p>\n\n<p>What happens to them after they lose their virginity? I&#39;d imagine they probably wouldn&#39;t stay in the same place as the virgins cause that kinda ruins the whole mood?? Cause over time they would build up and a virgin paradise wouldn&#39;t feel much like a virgin paradise if half the population wasn&#39;t virgin</p>\n\n<p>So if that&#39;s the case, does the Muslim god just poof them out of existence after they are done with their job? Or maybe he gives them a new vagina after every time they do it so they stay virgins forever?</p>\n\n<p>Seriously, I promise I&#39;m not trying to offend anyone or their religion but this question popped into my head a few days ago and now it won&#39;t go away</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/mb1299/in_muslim_heaven_where_are_the_virgins_coming/",
  "subreddit": "TooAfraidToAsk",
  "id": "mb1299",
  "is_self": true,
  "media": null,
  "is_video": false
}