{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "Throw all of it out.  The notion that \"stocks always go up\" is not true.  There's no rule written into the fabric of the Universe that says that.  Historically, yes, stocks have gone up.  Just look, we've had three major crises in the last 20 years (dotcom bubble, Global Financial Crisis, and Covid), and stocks have promptly recovered, right?  But I ask you: whatever could be the secret sauce that made such a miraculous recovery possible?  Do you have any notion?  I encourage you to look up \"Quantitative easing\".\n\nAnd just because something looks beautiful on the surface, does it mean that deep down it's healthy or sustainable?  Marilyn Monroe for example.  Beautiful woman, a worldwide icon.  But miserable inside.  Or all these stupid Instagram models and social media folk.  Just because they look beautiful on social media doesn't mean their lives are actually that magical.  And yeah, the drug addict who gets his hit of heroin feels like he's on cloud 9.  But it's not real.\n\nThis is what has happened thanks to monetary policy over the last two decades plus.  Stocks have done well, but has the economy?  The Fed's easing of liquidity after the dotcom bubble was identified as one major cause of the early 2000s real estate bubble.  And the world still has not fully recovered from the damage done in 2008.  The Fed could only manage to engage in quantitative tightening for less than a year before the markets had a hissy fit and they had to implement QE again.  And this was all before Covid, which scarred our economy even more.\n\nWe've been kicking the can down the road.  All you have to do is look at [historical interest rates](https://fred.stlouisfed.org/series/FEDFUNDS) and it's clear that we're running out of room to operate.  Don't forget, too, that inflation is the highest it's been in 30 years.\n\nSo the notion that \"stocks have always gone up, even in the midst of crises\" ignores the very key element of monetary policy.  It also ignores the fact that in some places, like Japan, stocks *don't* always go up.  The Nikkei still hasn't recovered its 1989 highs, over 30 years later (that bubble was also fueled by a market pumped with liquidity).\n\nI'd really encourage everyone to examine if the notion that \"no matter what, stocks go up\" is as categorically true as a statement like \"2 + 2 = 4\".  It's clear that it's not.  So I encourage people to be a little more honest.\n\nI believe there's a psychological element to all of this, and people want to believe that everything is going to work out no matter what.  Just buy VTI and chill, right? But even that is no guarantee, especially when you buy at bubble valuations.  But it's not comfortable to admit that, hey, this whole thing is very, very fucking uncertain.  I wasn't paying attention from 2000-2008, I was a bit too young, but I've read a lot about it.  From what I gather people were really sure that \"real estate always goes up\", because it always had.  And then complete disaster struck.  Very few people expected it, and those who predicted it were ignored, scorned, or even mocked.  And look at Covid.  Who could have expected Covid?  Yet this is the nature of life.  These things happen.\n\nI'm not one of those people who says \"nobody knows shit, bears or bulls\".  That's not the point of this post.  I'm also not encouraging anyone to sell all their positions.  But what I am encouraging people to do is to be a little more honest about the risks, and to make prudent decisions going forward that take into account the possibility that things aren't going to be all sunshine and roses.  You may sacrifice potential upside if things do end up working out, but you will also save yourself a lot of trouble if shit does hit the fan.  One thing I've learned from life is that shit can and will hit the fan... life is so fragile.\n\nGLTA",
  "author_fullname": "t2_t0846",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Hot take: people don't want to admit \"I don't know\".",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_uja44t",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.7,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 41,
  "total_awards_received": 1,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 41,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": 1651793196,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1651792993,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Throw all of it out.  The notion that &amp;quot;stocks always go up&amp;quot; is not true.  There&amp;#39;s no rule written into the fabric of the Universe that says that.  Historically, yes, stocks have gone up.  Just look, we&amp;#39;ve had three major crises in the last 20 years (dotcom bubble, Global Financial Crisis, and Covid), and stocks have promptly recovered, right?  But I ask you: whatever could be the secret sauce that made such a miraculous recovery possible?  Do you have any notion?  I encourage you to look up &amp;quot;Quantitative easing&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;And just because something looks beautiful on the surface, does it mean that deep down it&amp;#39;s healthy or sustainable?  Marilyn Monroe for example.  Beautiful woman, a worldwide icon.  But miserable inside.  Or all these stupid Instagram models and social media folk.  Just because they look beautiful on social media doesn&amp;#39;t mean their lives are actually that magical.  And yeah, the drug addict who gets his hit of heroin feels like he&amp;#39;s on cloud 9.  But it&amp;#39;s not real.&lt;/p&gt;\n\n&lt;p&gt;This is what has happened thanks to monetary policy over the last two decades plus.  Stocks have done well, but has the economy?  The Fed&amp;#39;s easing of liquidity after the dotcom bubble was identified as one major cause of the early 2000s real estate bubble.  And the world still has not fully recovered from the damage done in 2008.  The Fed could only manage to engage in quantitative tightening for less than a year before the markets had a hissy fit and they had to implement QE again.  And this was all before Covid, which scarred our economy even more.&lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;ve been kicking the can down the road.  All you have to do is look at &lt;a href=\"https://fred.stlouisfed.org/series/FEDFUNDS\"&gt;historical interest rates&lt;/a&gt; and it&amp;#39;s clear that we&amp;#39;re running out of room to operate.  Don&amp;#39;t forget, too, that inflation is the highest it&amp;#39;s been in 30 years.&lt;/p&gt;\n\n&lt;p&gt;So the notion that &amp;quot;stocks have always gone up, even in the midst of crises&amp;quot; ignores the very key element of monetary policy.  It also ignores the fact that in some places, like Japan, stocks &lt;em&gt;don&amp;#39;t&lt;/em&gt; always go up.  The Nikkei still hasn&amp;#39;t recovered its 1989 highs, over 30 years later (that bubble was also fueled by a market pumped with liquidity).&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d really encourage everyone to examine if the notion that &amp;quot;no matter what, stocks go up&amp;quot; is as categorically true as a statement like &amp;quot;2 + 2 = 4&amp;quot;.  It&amp;#39;s clear that it&amp;#39;s not.  So I encourage people to be a little more honest.&lt;/p&gt;\n\n&lt;p&gt;I believe there&amp;#39;s a psychological element to all of this, and people want to believe that everything is going to work out no matter what.  Just buy VTI and chill, right? But even that is no guarantee, especially when you buy at bubble valuations.  But it&amp;#39;s not comfortable to admit that, hey, this whole thing is very, very fucking uncertain.  I wasn&amp;#39;t paying attention from 2000-2008, I was a bit too young, but I&amp;#39;ve read a lot about it.  From what I gather people were really sure that &amp;quot;real estate always goes up&amp;quot;, because it always had.  And then complete disaster struck.  Very few people expected it, and those who predicted it were ignored, scorned, or even mocked.  And look at Covid.  Who could have expected Covid?  Yet this is the nature of life.  These things happen.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not one of those people who says &amp;quot;nobody knows shit, bears or bulls&amp;quot;.  That&amp;#39;s not the point of this post.  I&amp;#39;m also not encouraging anyone to sell all their positions.  But what I am encouraging people to do is to be a little more honest about the risks, and to make prudent decisions going forward that take into account the possibility that things aren&amp;#39;t going to be all sunshine and roses.  You may sacrifice potential upside if things do end up working out, but you will also save yourself a lot of trouble if shit does hit the fan.  One thing I&amp;#39;ve learned from life is that shit can and will hit the fan... life is so fragile.&lt;/p&gt;\n\n&lt;p&gt;GLTA&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "uja44t",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "shortyafter",
  "discussion_type": null,
  "num_comments": 194,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/uja44t/hot_take_people_dont_want_to_admit_i_dont_know/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/uja44t/hot_take_people_dont_want_to_admit_i_dont_know/",
  "subreddit_subscribers": 3992979,
  "created_utc": 1651812997,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1651792993,
  "the_new_excerpt": "Throw all of it out. The notion that \"stocks always go up\" is not true. There's\nno rule written into the fabric of the Universe that says that. Historically,\nyes, stocks have gone up. Just look, we've had three major crises in the last 20\nyears (dotcom bubble, Global Financial Crisis, and Covid),…"
}