{
  "author": "thejazzmaster69",
  "original_created_utc": 1638123240,
  "title": "As my grandma says \"stake it untill you make it\". What should I stake for the long run ?",
  "created_utc": 1638148124,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi fellow cryptonauts,</p>\n\n<p>I&#39;ve finally bought a cold storage device (Ledger Nano X). I&#39;m slowly learning and getting deeper into the cryptoverse.</p>\n\n<p>I plan to hodl for the long run (5-10 years).  For this reason I&#39;m interested in crypto that can be cold staked, meaning that I&#39;ll keep the custody of the coins while staking and earning rewards.</p>\n\n<p>I&#39;ve only have experience staking ADA in the Yoroi wallet. I want now to get involved in others projets with the same staking possibilities and that have real future applications.</p>\n\n<p>I&#39;m thinking in SOL. It can be staked in the Phantom wallet . </p>\n\n<p>What else would you recommend me ?</p>\n\n<p>Have any tips in the business of cold staking ?</p>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/CryptoCurrency/comments/r4ahta/as_my_grandma_says_stake_it_untill_you_make_it/",
  "subreddit": "CryptoCurrency",
  "id": "r4ahta",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi fellow cryptonauts,\n\nI've finally bought a cold storage device (Ledger Nano X). I'm slowly learning\nand getting deeper into the cryptoverse.\n\nI plan to hodl for the long run (5-10 years). For this reason I'm interested in\ncrypto that can be cold staked, meaning that I'll keep the custody of the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは、クリプトノートの皆さん。\n\n私はついにコールドストレージデバイス（Ledger Nano X）を購入しました。私はゆっくりと学んでいます。\nクリプトバースに深く入り込んでいます。\n\n私は長期的（5～10年）にホドホドにするつもりです。そのために、以下のことに興味があります。\nコールドステークが可能な暗号、つまり、私が暗号の保管を続けることができる暗号...",
      "title": "祖母が言うように「stake it untill you make it」。長い目で見ると、何を賭けたらいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嗨，各位加密爱好者。\n\n我终于买了一个冷存储设备（Ledger Nano X）。我正在慢慢学习\n并逐渐深入到加密领域。\n\n我打算长期持有（5-10年）。出于这个原因，我对\n可以冷押的加密货币，这意味着我将保持对其的保管。",
      "title": "正如我的祖母所说，\"在你成功之前，要把它作为赌注\"。从长远来看，我应该押什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嗨，各位加密愛好者。\n\n我終於買了一個冷存儲設備（Ledger Nano X）。我正在慢慢學習\n並逐漸深入到加密領域。\n\n我打算長期持有（5-10年）。出於這個原因，我對\n可以冷押的加密貨幣，這意味着我將保持對其的保管。",
      "title": "正如我的祖母所說，\"在你成功之前，要把它作爲賭注\"。從長遠來看，我應該押什麼？"
    }
  ]
}