{
  "author": "Hopeful_Bus_2815",
  "original_created_utc": 1641765918,
  "title": "What’s the best Crypto advice you’ve been given on this sub?",
  "created_utc": 1641796842,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I know it’s mentioned a lot that you shouldn’t take advice from people on this sub, and I’m a huge believer in doing your own research.&lt;/p&gt;\n\n&lt;p&gt;However, since joining this sub my Crypto portfolio is definitely performing a lot better than it was beforehand. Yes, this is largely due to this being a major hub for crypto news, but advice I’ve been given by others on here has definitely helped me out too. Here are some of the best pieces of advice I’ve been given:&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;BTC/ETH should make up around 70% of your portfolio&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Staking as a method of passive income&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Earning free BAT through the Brave browser&lt;/em&gt; &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;How to set up a hard wallet, and why I should&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Importance of understanding Tokenomics&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;2 of my top 5 gainers this year were introduced to me through this sub (won’t name as this isn’t a shill post)&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;This sub definitely isn’t all that bad, and there are some very smart people in here. What’s the best piece of advice you’ve been given on this sub?&lt;/p&gt;\n\n&lt;p&gt;EDIT: Some great mentions in the comments that I feel should be highlighted in the main body (as I know some won’t bother to read the comments)&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Don’t invest more than you can afford to lose&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Time in the market &amp;gt; timing the market&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;YouTube is generally a bad place for Crypto information&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 315,
  "permalink": "/r/CryptoCurrency/comments/s02x75/whats_the_best_crypto_advice_youve_been_given_on/",
  "subreddit": "CryptoCurrency",
  "id": "s02x75",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I know it’s mentioned a lot that you shouldn’t take advice from people on this\nsub, and I’m a huge believer in doing your own research.\n\nHowever, since joining this sub my Crypto portfolio is definitely performing a\nlot better than it was beforehand. Yes, this is largely due to this being a\nmajor…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサイトでは、人のアドバイスを鵜呑みにしてはいけないとよく言われますが\n私は、自分自身で研究することを強く信じています。\n\nしかし、このサブに参加して以来、私のCryptoポートフォリオは間違いなくパフォーマンスしている\nということです。そう、これは主に、この会社が\nメジャー...",
      "title": "このサブで一番良かったCryptoのアドバイスは何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道有很多人提到，你不应该接受这个子上的人的建议。\n子上的人的建议，而且我非常相信要做自己的研究。\n\n然而，自从加入这个子网站以来，我的加密货币投资组合的表现绝对比以前好得多。\n比之前要好得多。是的，这主要是由于这是一个\n证券市场的主要...",
      "title": "在这个子上，你得到的最好的加密货币建议是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道有很多人提到，你不應該接受這個子上的人的建議。\n子上的人的建議，而且我非常相信要做自己的研究。\n\n然而，自從加入這個子網站以來，我的加密貨幣投資組合的表現絕對比以前好得多。\n比之前要好得多。是的，這主要是由於這是一個\n證券市場的主要...",
      "title": "在這個子上，你得到的最好的加密貨幣建議是什麼？"
    }
  ]
}