{
  "author": "nzlemming",
  "original_created_utc": 1632345640,
  "title": "Why don't we feel air pressure?",
  "created_utc": 1632434862,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The standard explanation I&#39;ve seen is that this is due to the air on all sides of us pushing equally, but that&#39;s not always the case. If I place my hand flat on a table, for example, there&#39;s no air under my hand to balance the pressure pressing down from the atmosphere. </p>\n\n<p>Even apart from that aspect, I would still expect to experience the pressure even if it&#39;s balanced. I understand that our bodies don&#39;t collapse (or at least squish a bit) because they&#39;re basically incompressible (cavities excepted), but I would still expect to feel it. According to Wikipedia the air pressure at sea level is around 1kg/cm<sup>2,</sup> which is a lot, but I can pinch my arm with far less pressure than that and still feel it clearly. It&#39;s been a few years now, but I&#39;ve also dived to a depth of around 12m where the pressure is significantly greater, and I don&#39;t recall a feeling of e.g. my legs being squeezed on all sides.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/askscience/comments/ptgjsl/why_dont_we_feel_air_pressure/",
  "subreddit": "askscience",
  "id": "ptgjsl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The standard explanation I've seen is that this is due to the air on all sides\nof us pushing equally, but that's not always the case. If I place my hand flat\non a table, for example, there's no air under my hand to balance the pressure\npressing down from the atmosphere.\n\nEven apart from that aspect,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が見てきた標準的な説明では、これは私たちの両側にある空気が均等に押し出されているからだと言われています。\n均等に押しているからというのが一般的な説明ですが、必ずしもそうとは限りません。例えば、テーブルの上に平らに手を置いた場合\n机の上に手を置いた場合、手の下には大気からの圧力と釣り合う空気がありません。\n手の下には空気がないので、大気からの圧力と釣り合いません。\n\nその点を除けば、...",
      "title": "気圧を感じないのはなぜ？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我看到的标准解释是，这是由于我们四面的空气\n的推动力相同，但情况并非总是如此。如果我把我的手平放在\n例如，如果我将手平放在桌子上，我的手下面就没有空气来平衡压力了。\n从大气中压下来。\n\n即使不考虑这个方面，...",
      "title": "为什么我们感觉不到空气压力？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到的標準解釋是，這是由於我們四面的空氣\n的推動力相同，但情況並非總是如此。如果我把我的手平放在\n例如，如果我將手平放在桌子上，我的手下面就沒有空氣來平衡壓力了。\n從大氣中壓下來。\n\n即使不考慮這個方面，...",
      "title": "爲什麼我們感覺不到空氣壓力？"
    }
  ]
}