{
  "author": "BrandenKeck",
  "the_new_excerpt": "I'm a noob, and I only go off basic numbers, but it seems to me that Coinbase is\na great bet as a company. Down 33% since opening and has a decent revenue\nstream. With ETH going to proof of stake, Coinbase can make truckloads off of\nstake-mining while continuing to charge an arm and a leg in fees…",
  "original_created_utc": 1622913316,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は素人ですし、基本的な数字しか知りませんが、Coinbaseは会社としては\n会社としては素晴らしい賭けだと思います。開業以来33％の下落で、きちんとした収入源を持っています。\nストリームを持っています。ETHがプルーフオブステークになることで、Coinbaseはステークマイニングで莫大な利益を得ることができます。\nETHがproof of stakeになると、Coinbaseは手数料を取り続けながらstake-miningでトラックロードを稼ぐことができます...",
      "title": "みなさんは、Coinbase $COINをどう思いますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是个新手，而且我只根据基本的数字，但在我看来，Coinbase是一个\n作为一家公司，是一个很好的赌注。自开业以来下降了33%，并有一个体面的收入\n流。随着ETH进入股权证明阶段，Coinbase可以从股权挖矿中赚取大量的钱。\n在继续收取手续费的同时，还可以从挖矿中赚取大量的钱......",
      "title": "大家对Coinbase $COIN有什么看法？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是個新手，而且我只根據基本的數字，但在我看來，Coinbase是一個\n作爲一家公司，是一個很好的賭注。自開業以來下降了33%，並有一個體面的收入\n流。隨着ETH進入股權證明階段，Coinbase可以從股權挖礦中賺取大量的錢。\n在繼續收取手續費的同時，還可以從挖礦中賺取大量的錢......",
      "title": "大家對Coinbase $COIN有什麼看法？"
    }
  ],
  "title": "What do you all think of Coinbase $COIN?",
  "created_utc": 1622944518,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m a noob, and I only go off basic numbers, but it seems to me that Coinbase is a great bet as a company.  Down 33% since opening and has a decent revenue stream.  With ETH going to proof of stake, Coinbase can make truckloads off of stake-mining while continuing to charge an arm and a leg in fees for the ever growing group of people becoming interested in crypto.</p>\n\n<p>I read some articles that the price is still far too high because the original valuation already assumed ridiculously high profits.  And a quick Google shows P/E of 97.88 which is kind of insane.  What does everyone here think?  A bad buy?  Their business model seems to be insanely scalable.</p>\n\n<p>Edit: Thank you all for a great discussion.  A lot of good points to consider here!</p>\n</div><!-- SC_ON -->",
  "score": 56,
  "permalink": "/r/stocks/comments/nt0irn/what_do_you_all_think_of_coinbase_coin/",
  "subreddit": "stocks",
  "id": "nt0irn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404886633
}