{
  "author": "bosshax",
  "the_new_excerpt": "$CRWD - Crowdstrike: Internet services and infastructure\nMarket Cap: $53 Billion\nPrice/Sales: 70\nRevenue: $761M\nProfit: -$102M\nModel: Software as a service model protecting consumer endpoints with security\nsolutions.\n$BB - Blackberry: Communications Equipment\nMarket Cap: $6 Billion\nPrice/Sales:…",
  "original_created_utc": 1613839806,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "$CRWD - Crowdstrike。互联网服务和基础设施\n市值：530亿美元\n价格/销售：70\n收入：7.61亿美元\n利润：-1.02亿美元\n模式。软件即服务模式，以安全保护消费者端点。\n解决方案.\n$BB - 黑莓。通信设备\n市值：60亿美元\n价格/销售：...",
      "title": "$CRWD vs $BB"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "$CRWD - Crowdstrike。互聯網服務和基礎設施\n市值：530億美元\n價格/銷售：70\n收入：7.61億美元\n利潤：-1.02億美元\n模式。軟件即服務模式，以安全保護消費者端點。\n解決方案.\n$BB - 黑莓。通信設備\n市值：60億美元\n價格/銷售：...",
      "title": "$CRWD vs $BB"
    }
  ],
  "title": "$CRWD vs $BB",
  "created_utc": 1613869131,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>$CRWD - Crowdstrike: Internet services and infastructure<br/>\nMarket Cap: $53 Billion<br/>\nPrice/Sales: 70<br/>\nRevenue: $761M<br/>\nProfit: -$102M<br/>\nModel: Software as a service model protecting consumer endpoints with security solutions.<br/>\n$BB - Blackberry: Communications Equipment<br/>\nMarket Cap: $6 Billion<br/>\nPrice/Sales: 6.39<br/>\nRevenue: $965 M<br/>\nProfit: -$830M<br/>\nModel: Suite of software solutions specializing in security, data privacy, encryption etc.   </p>\n\n<p>I struggle to believe that with all the recent media attention on $BB that smarter money does not see the massive under-value that seems to be Blackberry. YES they have appreciated strongly in recent months, BUT they are still not near peers in the same industry in regard to Price/Sales. There seems to be a very limited forward looking multiple. Yes they have lots to prove, but if you look at everything they are doing, partnerships, announcements, platforms, international scope, governments and private companies... They seem to have a lot of potential in a lot of areas.   </p>\n\n<p>Thematically speaking they&#39;ve managed to transition their business into a highly scalable, growing industry. With the internet-of-things and everything increasingly digital, the solar winds hack and critical risk of ransom-ware on any business... it seems Blackberry is in the right place.  </p>\n\n<p>I think their inclusion in the meme-stock bandwagon was justified and retail investors found an under-valued opportunity...but the hype may have got ahead of itself.   </p>\n\n<p>Speaking purely from a market perspective point of view Blackberry is still described as communications equipment and this is absolutely NOT what they are about. So, can someone who knows Crowdstrike well please compare the two companies and explain the massive differing market cap valuations?  </p>\n\n<p>Maybe this is all too soon... But I strongly think this is a sleeping giant.</p>\n</div><!-- SC_ON -->",
  "score": 71,
  "permalink": "/r/stocks/comments/lob3m5/crwd_vs_bb/",
  "subreddit": "stocks",
  "id": "lob3m5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332885066
}