{
  "author": "TheRebelCatholic",
  "original_created_utc": 1650291720,
  "title": "Why are there anti-smoking campaigns but no anti-drinking campaigns?",
  "created_utc": 1650312045,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So this sounds hypocritical to ask as I do drink, but I have relatives who died from drinking. I don’t smoke at all (I never vaped but I did smoke a cigarette once when I was a kid but I was coerced to by a “friend”, suffice it to say that I stopped being friends with her after that) because I know it’s unhealthy but I could also say the same for drinking except I don’t think that I’ve ever seen an anti-drinking commercial (not including drinking while driving ones as that’s a crime anyway) when compared to all the anti-smoking commercials I’ve seen throughout my 23 years alive on Earth. So I guess I’m trying to ask if smoking is more harmful than drinking or does society just perceive smoking as more harmful than drinking?&lt;/p&gt;\n\n&lt;p&gt;EDIT: I exclude drinking while driving campaigns because it is a crime to drink under the influence. Plus, from what I could tell, they don’t want you drink until you’re 21. (I know it’s different in other countries but I am in the US, where the legal age is 21.) Also, I am aware of the 18th Amendment, but it was repealed with the 21st Amendment and I’m talking more about modern day.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/NoStupidQuestions/comments/u6ebrt/why_are_there_antismoking_campaigns_but_no/",
  "subreddit": "NoStupidQuestions",
  "id": "u6ebrt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So this sounds hypocritical to ask as I do drink, but I have relatives who died\nfrom drinking. I don’t smoke at all (I never vaped but I did smoke a cigarette\nonce when I was a kid but I was coerced to by a “friend”, suffice it to say that\nI stopped being friends with her after that) because I know…"
}