{
  "author": "TheRebelCatholic",
  "original_created_utc": 1650291720,
  "title": "Why are there anti-smoking campaigns but no anti-drinking campaigns?",
  "created_utc": 1650312045,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So this sounds hypocritical to ask as I do drink, but I have relatives who died from drinking. I don’t smoke at all (I never vaped but I did smoke a cigarette once when I was a kid but I was coerced to by a “friend”, suffice it to say that I stopped being friends with her after that) because I know it’s unhealthy but I could also say the same for drinking except I don’t think that I’ve ever seen an anti-drinking commercial (not including drinking while driving ones as that’s a crime anyway) when compared to all the anti-smoking commercials I’ve seen throughout my 23 years alive on Earth. So I guess I’m trying to ask if smoking is more harmful than drinking or does society just perceive smoking as more harmful than drinking?&lt;/p&gt;\n\n&lt;p&gt;EDIT: I exclude drinking while driving campaigns because it is a crime to drink under the influence. Plus, from what I could tell, they don’t want you drink until you’re 21. (I know it’s different in other countries but I am in the US, where the legal age is 21.) Also, I am aware of the 18th Amendment, but it was repealed with the 21st Amendment and I’m talking more about modern day.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/NoStupidQuestions/comments/u6ebrt/why_are_there_antismoking_campaigns_but_no/",
  "subreddit": "NoStupidQuestions",
  "id": "u6ebrt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So this sounds hypocritical to ask as I do drink, but I have relatives who died\nfrom drinking. I don’t smoke at all (I never vaped but I did smoke a cigarette\nonce when I was a kid but I was coerced to by a “friend”, suffice it to say that\nI stopped being friends with her after that) because I know…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はお酒を飲むので偽善的に聞こえますが、親戚に亡くなった方がいます。\n飲酒によるものです。タバコは全く吸わない（ベイプは吸ったことがないが、タバコは吸ったことがある\n子供の頃、一度だけ「友達」に無理矢理やらされたことがある。\nそれ以来、彼女とは友だちになるのをやめました）なぜなら、私は知っているから...。",
      "title": "なぜ、禁煙キャンペーンはあっても、禁酒キャンペーンはないのですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这听起来很虚伪，因为我也喝酒，但我有亲戚死于喝酒。\n死于酗酒。我完全不抽烟（我从未吸过烟，但我确实抽过一次烟，那是我小时候被一个 \"朋友 \"强迫的。\n有一次，当我还是个孩子的时候，我被一个 \"朋友 \"胁迫着抽了烟，这足以说明问题。\n从那以后我就不再和她做朋友了），因为我知道...",
      "title": "为什么有反吸烟运动而没有反饮酒运动？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這聽起來很虛僞，因爲我也喝酒，但我有親戚死於喝酒。\n死於酗酒。我完全不抽菸（我從未吸過煙，但我確實抽過一次煙，那是我小時候被一個 \"朋友 \"強迫的。\n有一次，當我還是個孩子的時候，我被一個 \"朋友 \"脅迫着抽了煙，這足以說明問題。\n從那以後我就不再和她做朋友了），因爲我知道...",
      "title": "爲什麼有反吸菸運動而沒有反飲酒運動？"
    }
  ]
}