{
  "author": "austin_bee",
  "original_created_utc": 1636407192,
  "title": "Does anybody fear a crash?",
  "created_utc": 1636423639,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Evergrande going down (and way more to come), the Fed abusing QE, 5.9 Trillion dollars of releif bills, Buffet indicator, Elon and his brother selling positions, buffet&#39;s cash position highest it&#39;s ever been, etc etc etc etc. </p>\n\n<p>To me, these seem like signs of an impending market crash like no other. The balloon has to be popped. How can anyone tell me realistically that the market can drop at around the Levels of 1930&#39;s depression, and recooperate within one year, and reach highs at the end of the year??? </p>\n\n<p>Maybe I&#39;m missing something but this does not seem as if is natural growth, rather asset inflation caused by consumers having way more cash on hand from stimulus etc etc and producing and working less than ever before. </p>\n\n<p>I&#39;d sell my position, but don&#39;t want to cause any tax implications for year 2021, so I&#39;m kind of stuck holding even if the ship falls, lol.</p>\n</div><!-- SC_ON -->",
  "score": 165,
  "permalink": "/r/Bitcoin/comments/qpnskc/does_anybody_fear_a_crash/",
  "subreddit": "Bitcoin",
  "id": "qpnskc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Evergrande going down (and way more to come), the Fed abusing QE, 5.9 Trillion\ndollars of releif bills, Buffet indicator, Elon and his brother selling\npositions, buffet's cash position highest it's ever been, etc etc etc etc.\n\nTo me, these seem like signs of an impending market crash like no other.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Evergrande going down (and much more to come), Fed abusing QE, 5.9 Trillion\nバフェットの指標、イーロンとその弟のポジション売り、バフェットのキャッシュポジションが過去最高になったことなどなど。\nバフェットのキャッシュポジションが過去最高になった、などなど。\n\n私には、これらは他に類を見ない、差し迫った市場暴落の兆候のように思えます。....",
      "title": "墜落を恐れている人はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "恒大倒下了（还有更多），美联储滥用QE，5.9万亿美元的汇票，巴菲特指标，埃隆和他的兄弟卖掉所有这些东西。\n5.9万亿美元的汇票，巴菲特的指标，伊隆和他的兄弟出售\n的头寸，自助餐的现金头寸是有史以来最高的，等等，等等。\n\n对我来说，这些似乎是即将发生的市场崩溃的迹象，没有其他....。",
      "title": "有人害怕崩溃吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "恆大倒下了（還有更多），美聯儲濫用QE，5.9萬億美元的匯票，巴菲特指標，埃隆和他的兄弟賣掉所有這些東西。\n5.9萬億美元的匯票，巴菲特的指標，伊隆和他的兄弟出售\n的頭寸，自助餐的現金頭寸是有史以來最高的，等等，等等。\n\n對我來說，這些似乎是即將發生的市場崩潰的跡象，沒有其他....。",
      "title": "有人害怕崩潰嗎？"
    }
  ]
}