{
  "author": "CookingNgaming90",
  "original_created_utc": 1626706507,
  "title": "Just found out my wife is pregnant",
  "created_utc": 1626722276,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m 30year old male, I myself have never had a father figure in my life and all I want is to give my child everything I didn&#39;t have. Does anyone have any type of advice that a majority of new parents over look? </p>\n\n<p>I&#39;ve already ordered some books to read on and mentally I even feel different. I look at everything now as how can this benefit my child and wife. I&#39;m not scared definitely nervous but that&#39;s life and I just want to do everything in my power to make sure they are both happy and healthy. \n Any opinions and tips are welcome.</p>\n</div><!-- SC_ON -->",
  "score": 112,
  "permalink": "/r/NoStupidQuestions/comments/onfnki/just_found_out_my_wife_is_pregnant/",
  "subreddit": "NoStupidQuestions",
  "id": "onfnki",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm 30year old male, I myself have never had a father figure in my life and all\nI want is to give my child everything I didn't have. Does anyone have any type\nof advice that a majority of new parents over look?\n\nI've already ordered some books to read on and mentally I even feel different. I\nlook at…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は30歳の男性です。私自身、人生で父親のような存在になったことがありません。\n自分が持っていなかったものを子供に与えたいと思っています。誰か、新米の親が見落としているような\n誰か新しい親の大半が見落としているようなアドバイスがありますか？\n\n私はすでにいくつかの本を注文して読んでいますが、精神的にも変わってきたように感じます。I\n見てください...",
      "title": "妻の妊娠がわかりました"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是30岁的男性，我自己在生活中从来没有一个父亲的形象，我所想要的是给我的孩子我没有的一切。\n我想要的是给我的孩子我没有的一切。有没有人有任何类型的\n大多数新父母都会忽略的建议？\n\n我已经订购了一些书来阅读，在精神上我甚至感觉到了不同。I\n看了...",
      "title": "刚刚发现我妻子怀孕了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是30歲的男性，我自己在生活中從來沒有一個父親的形象，我所想要的是給我的孩子我沒有的一切。\n我想要的是給我的孩子我沒有的一切。有沒有人有任何類型的\n大多數新父母都會忽略的建議？\n\n我已經訂購了一些書來閱讀，在精神上我甚至感覺到了不同。I\n看了...",
      "title": "剛剛發現我妻子懷孕了"
    }
  ]
}