{
  "author": "Mariana21bn",
  "original_created_utc": 1637097477,
  "title": "The overwhelming percentage of the users in here are short term investors, so filter everything you read carefully..",
  "created_utc": 1637116252,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Chasing the pump is not bad. I don&#39;t judge it at all! You can get enormous gains. You will need to be very lucky though. Long term.. That&#39;s the real deal. And you know why most of the users in here are not in for that?</p>\n\n<p>Because if you are long term, you simply don&#39;t care about today&#39;s dip.. You don&#39;t check the charts every five seconds to look if your coin pumped.. You don&#39;t post about your fear.. You don&#39;t ask about predictions.. You don&#39;t shill stupid coins hoping you will pump the price.. </p>\n\n<p>Not everyone invests an equal amount of money. Not everyone has the same goals as you. Not everyone&#39;s good or bad is good or bad for you too. Each advice echoes to a different kind of situation.</p>\n\n<p>So, the advice you get in here is most likely by short term investors! Capture this.. And think if that&#39;s what you need! All i am saying is absorb everything with a filter according to your standards and goals, either short or long term..</p>\n\n<p>Edit : To be clear, there is absolutely nothing wrong with selling, every situation can be different!</p>\n</div><!-- SC_ON -->",
  "score": 207,
  "permalink": "/r/CryptoCurrency/comments/qvidjf/the_overwhelming_percentage_of_the_users_in_here/",
  "subreddit": "CryptoCurrency",
  "id": "qvidjf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Chasing the pump is not bad. I don't judge it at all! You can get enormous\ngains. You will need to be very lucky though. Long term.. That's the real deal.\nAnd you know why most of the users in here are not in for that?\n\nBecause if you are long term, you simply don't care about today's dip..…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ポンプを追いかけるのも悪くない。私はそれを全く判断しません! 莫大な利益を得ることができます。\n得ることができます。ただし、よほど運が良くないと無理です。長期的には。それが本番です。\nなぜここのユーザーのほとんどがそれに参加していないかわかりますか？\n\nなぜなら、もしあなたが長期的な視点を持っているならば、今日のdip..... には関心がないからです。",
      "title": "ここのユーザーは短期的な投資家が圧倒的に多いので、読むものは慎重に吟味しましょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "追逐泵是不错的。我根本不判断它! 你可以获得巨大的\n收益。不过你需要非常幸运。长期而言... 那才是真正的交易。\n你知道为什么这里的大多数用户都不愿意做这个？\n\n因为如果你是长期的，你根本不关心今天的dip.....。",
      "title": "这里绝大多数的用户都是短期投资者，所以要仔细过滤你所读的一切。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "追逐泵是不錯的。我根本不判斷它! 你可以獲得巨大的\n收益。不過你需要非常幸運。長期而言... 那纔是真正的交易。\n你知道爲什麼這裏的大多數用戶都不願意做這個？\n\n因爲如果你是長期的，你根本不關心今天的dip.....。",
      "title": "這裏絕大多數的用戶都是短期投資者，所以要仔細過濾你所讀的一切。"
    }
  ]
}