{
  "author": "LevyShorts",
  "original_created_utc": 1645126636,
  "title": "Let's say I'm a wealthy, but otherwise average civilian in suburban California in 1955, and I, for some reason, need to generate a burst of 1.21 gigawatts of electricity. Would I have any reasonable options available to me to do this?",
  "created_utc": 1645159526,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;While not really pertinent to the historical question, for additional context, let&amp;#39;s also say that I need to transmit this burst of electricity to a vehicle moving at a relatively high rate of speed, say -- for the sake of argument -- 88 miles per hour. &lt;/p&gt;\n\n&lt;p&gt;And let&amp;#39;s leave out a bolt of lightning as solving the problem, as, unfortunately, you never know when or where it&amp;#39;s ever going to strike.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/sux9jd/lets_say_im_a_wealthy_but_otherwise_average/",
  "subreddit": "AskHistorians",
  "id": "sux9jd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "While not really pertinent to the historical question, for additional context,\nlet's also say that I need to transmit this burst of electricity to a vehicle\nmoving at a relatively high rate of speed, say -- for the sake of argument -- 88\nmiles per hour.\n\nAnd let's leave out a bolt of lightning as…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "歴史的な問題とはあまり関係ありませんが、補足しておきます。\nまた、この電気を自動車に送電する必要があるとします。\n比較的速い速度で動いている、例えば、議論のために言っておくと、88km/hで動いている。\n時速100km\n\nそして、稲妻は除外して...",
      "title": "例えば、私が1955年のカリフォルニア州郊外に住む裕福だが、それ以外は平凡な一般市民で、何らかの理由で1.21ギガワットの電力を一気に発電する必要があるとしよう。そのために、何か合理的な方法はないだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "虽然这与历史问题并不相关，但为了增加背景。\n我们还可以说，我需要将这一阵电传输给一辆以相对较高速度行驶的汽车\n以相对较高的速度行驶，比如说--为了争论起见--88\n每小时88英里。\n\n让我们把闪电排除在外，因为......",
      "title": "假设我是1955年加州郊区的一个富有但其他方面都很普通的平民，而我出于某种原因，需要突然产生1.21千兆瓦的电力。我是否有任何合理的选择可以做到这一点？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "雖然這與歷史問題並不相關，但爲了增加背景。\n我們還可以說，我需要將這一陣電傳輸給一輛以相對較高速度行駛的汽車\n以相對較高的速度行駛，比如說--爲了爭論起見--88\n每小時88英里。\n\n讓我們把閃電排除在外，因爲......",
      "title": "假設我是1955年加州郊區的一個富有但其他方面都很普通的平民，而我出於某種原因，需要突然產生1.21千兆瓦的電力。我是否有任何合理的選擇可以做到這一點？"
    }
  ]
}