{
  "author": "notdxrek",
  "original_created_utc": 1639279510,
  "title": "Did the ancient Canaanites really sacrifice their babies like the Old Testament says they did?",
  "created_utc": 1639329404,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As an amateur student of history, something I’ve discovered is that claims like &lt;strong&gt;“OUR ENEMIES LITERALLY BURN BABIES ALIVE AND WORSHIP SATAN”&lt;/strong&gt; are usually not true, or at least based on heavy exaggeration or cultural misunderstanding. How common was infant sacrifice in the Levant during this period?&lt;/p&gt;\n\n&lt;p&gt;I’ve marked NSFW just to be safe since infant death is a pretty horrible subject&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/refwjo/did_the_ancient_canaanites_really_sacrifice_their/",
  "subreddit": "AskHistorians",
  "id": "refwjo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As an amateur student of history, something I’ve discovered is that claims like\n“OUR ENEMIES LITERALLY BURN BABIES ALIVE AND WORSHIP SATAN” are usually not\ntrue, or at least based on heavy exaggeration or cultural misunderstanding. How\ncommon was infant sacrifice in the Levant during this…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "素人の歴史研究者として、私が発見したことは、次のような主張です。\n「我々の敵は文字通り赤ん坊を生きたまま焼き、サタンを崇拝している」というのは、大抵の場合、嘘です。\n少なくとも、かなりの誇張か文化的な誤解に基づいている。どのように\nレヴァント地方では、この時期、幼児の生け贄が一般的だった...",
      "title": "旧約聖書に書かれているように、古代カナン人は本当に赤ちゃんを犠牲にしていたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "作为一个业余的历史研究者，我发现，像 \"我们的敌人会活活烧死婴儿并崇拜撒旦 \"这样的说法，通常是不可能的。\n\"我们的敌人简直是在活活烧死婴儿，并崇拜撒旦 \"这样的说法通常都不是\n是不真实的，或者至少是基于严重的夸张或文化误解的。婴儿献祭在\n在这一时期，黎凡特地区的婴儿祭祀是多么普遍。",
      "title": "古代迦南人真的像《旧约》中所说的那样牺牲他们的婴儿吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "作爲一個業餘的歷史研究者，我發現，像 \"我們的敵人會活活燒死嬰兒並崇拜撒旦 \"這樣的說法，通常是不可能的。\n\"我們的敵人簡直是在活活燒死嬰兒，並崇拜撒旦 \"這樣的說法通常都不是\n是不真實的，或者至少是基於嚴重的誇張或文化誤解的。嬰兒獻祭在\n在這一時期，黎凡特地區的嬰兒祭祀是多麼普遍。",
      "title": "古代迦南人真的像《舊約》中所說的那樣犧牲他們的嬰兒嗎？"
    }
  ]
}