{
  "author": "Gilgameshbrah",
  "original_created_utc": 1639570670,
  "title": "How do you reconcile the two facts that on the one side you are litteraly the center of your reality and on the other side you are barely a speck in an unimaginably large cosmos not even worth mentioning in the grand scheme of things?",
  "created_utc": 1639587608,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Everyone precives themselves as the center of everything - not from an ego standpoint, but from a perception one. In fact it&amp;#39;s practically impossible to prove that anyone else actually exists.&lt;/p&gt;\n\n&lt;p&gt;On the other hand, according to how far our research has come, we know that the universe is vast and there are more habitable planets than sand on our own (if they are inhabited or not is a different discussion) - making humanity itself, but even more so a single person seem rather in segnificant - a fraction of a blink of an eye from a time standpoint.&lt;/p&gt;\n\n&lt;p&gt;How do you live with those seeming opposites, or do you ever even think about it?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/rgxtky/how_do_you_reconcile_the_two_facts_that_on_the/",
  "subreddit": "TooAfraidToAsk",
  "id": "rgxtky",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Everyone precives themselves as the center of everything - not from an ego\nstandpoint, but from a perception one. In fact it's practically impossible to\nprove that anyone else actually exists.\n\nOn the other hand, according to how far our research has come, we know that the\nuniverse is vast and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "誰もが、自分がすべての中心であると思い込んでいる。\nの観点ではなく、知覚の観点で。実際、このようなことをするのは不可能です。\n他の誰かが実際に存在することを証明する。\n\n一方、私たちの研究の進歩によれば、この世界には\n宇宙は広大で...",
      "title": "一方では自分が現実の中心であり、他方では想像を絶するほど大きな宇宙の中で、物事の大筋において言及する価値さえない一点に過ぎないという2つの事実をどう折り合いをつけるか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "每个人都认为自己是一切的中心--不是从自我的角度，而是从感知的角度。\n观点，而是从感知的角度。事实上，实际上不可能\n证明其他任何人的实际存在。\n\n另一方面，根据我们的研究进展情况，我们知道\n宇宙是巨大的，而且...",
      "title": "你如何调和这两个事实：一边是你是你的现实的中心，另一边是你在一个大得难以想象的宇宙中勉强是一个小点，甚至在事物的宏伟计划中不值得一提？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "每個人都認爲自己是一切的中心--不是從自我的角度，而是從感知的角度。\n觀點，而是從感知的角度。事實上，實際上不可能\n證明其他任何人的實際存在。\n\n另一方面，根據我們的研究進展情況，我們知道\n宇宙是巨大的，而且...",
      "title": "你如何調和這兩個事實：一邊是你是你的現實的中心，另一邊是你在一個大得難以想象的宇宙中勉強是一個小點，甚至在事物的宏偉計劃中不值得一提？"
    }
  ]
}