{
  "author": "yeeyeesuckinteets",
  "the_new_excerpt": "This was way back in July when BTC was around 8k a coin. I met this dude at my\nlocal medical marijuana dispensary and we got to talking about money and\ninvesting. He wouldn't shut the fuck up about Bitcoin and how we all need to\ninvest our money into it while it's low. The last thing he said before…",
  "original_created_utc": 1612769697,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这是在7月份的时候，当时BTC大约是8千块一个币。我在我的\n当地的医用大麻药房，我们得到了谈论钱和。\n投资。他不会对比特币闭口不谈，也不会对我们都需要...\n趁低价把我们的钱投进去。他之前说的最后一句话...",
      "title": "8个月前，一个大麻店的人让我买入比特币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是在7月份的時候，當時BTC大約是8千塊一個幣。我在我的\n當地的醫用大麻藥房，我們得到了談論錢和。\n投資。他不會對比特幣閉口不談，也不會對我們都需要...\n趁低價把我們的錢投進去。他之前說的最後一句話...",
      "title": "8個月前，一個大麻店的人讓我買入比特幣。"
    }
  ],
  "title": "Some guy at the weed shop told me to buy into bitcoin 8 months ago",
  "created_utc": 1612795406,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This was way back in July when BTC was around 8k a coin. I met this dude at my local medical marijuana dispensary and we got to talking about money and investing. He wouldn&#39;t shut the fuck up about Bitcoin and how we all need to invest our money into it while it&#39;s low. The last thing he said before he left was &quot;I promise you won&#39;t regret it&quot;. He spoke with alot of clarity and certainty, so that interaction stuck with me. The next few days I did my due diligence on researching Bitcoin and decided to toss around $1600 into it just to test the waters. I also called my dad, and somehow by the grace of of God, convinced him to invest into BTC. He bought 5k worth.</p>\n\n<p>Fast forward to today and my dad and I both have more than doubled our investments. We&#39;ve both since been investing more money into BTC and we follow it pretty closely. My dad is very happy with his BTC investment and I feel like a proud son for introducing him to it. And don&#39;t worry....we HODL. We see it being a retirement fund situation.</p>\n\n<p>To that guy at the weed shop who told me to invest into BTC, thank you. Your advice not only has helped double my networth, but you helped strengthen my relationship with my father.</p>\n\n<p>*<em>Edit: It just occurred to me that the guy who was raving all about Bitcoin and told me to invest in it probably has made a ton of money from BTC since. He really believes in Bitcoin and spoke of it with conviction. He opened my eyes to a whole new world of currency. I&#39;m sure he&#39;s sitting on an extremely generous profit. I&#39;m happy for that guy.</em></p>\n</div><!-- SC_ON -->",
  "score": 467,
  "permalink": "/r/Bitcoin/comments/lf6s0b/some_guy_at_the_weed_shop_told_me_to_buy_into/",
  "subreddit": "Bitcoin",
  "id": "lf6s0b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123190821
}