{
  "author": "Okmanl",
  "the_new_excerpt": "Seems there are a lot deep value investor who are thoroughly convinced that\ncommodities and energy will make a gigantic comeback.\n\nA lot of them are most bullish on the uranium sector. It looks like many uranium\ncompanies already 4-5X'd from their 6 month lows. And looking at the entire\nchart of…",
  "original_created_utc": 1612898532,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "似乎有很多深具价值的投资者，他们彻底相信\n大宗商品和能源将迎来巨大的回升。\n\n其中很多人最看好的是铀业。看起来很多铀\n公司已经从6个月的低点涨了4-5倍。而从整个\n排行榜",
      "title": "与其投资电动车企业... 投资于生产EV所需的商品"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "似乎有很多深具價值的投資者，他們徹底相信\n大宗商品和能源將迎來巨大的回升。\n\n其中很多人最看好的是鈾業。看起來很多鈾\n公司已經從6個月的低點漲了4-5倍。而從整個\n排行榜",
      "title": "與其投資電動車企業... 投資於生產EV所需的商品"
    }
  ],
  "title": "Instead of investing in EV companies... Investing in commodities needed to produce EV",
  "created_utc": 1612911188,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Seems there are a lot deep value investor who are thoroughly convinced that commodities and energy will make a gigantic comeback. </p>\n\n<p>A lot of them are most bullish on the uranium sector. It looks like many uranium companies already 4-5X&#39;d from their 6 month lows. And looking at the entire chart of various uranium companies, that&#39;s still a blip in the radar compared to how huge the uranium bull run was back in 2007.</p>\n\n<p>Anyways aside from uranium has anyone else researched other commodities? For example nickel, graphite, cobalt and so on needed to build EV and what the potential gains are from that?</p>\n\n<p>It seems like this community usually just talks about tech stocks, or companies that people claim are &quot;already overpriced&quot; (TSLA, plug, nio etc...).</p>\n</div><!-- SC_ON -->",
  "score": 186,
  "permalink": "/r/investing/comments/lgb3z3/instead_of_investing_in_ev_companies_investing_in/",
  "subreddit": "investing",
  "id": "lgb3z3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123199880
}