{
  "author": "Southern_Efficiency7",
  "the_new_excerpt": "A little back story to this: it is not about me, but my little brother (who is\nnow 19). My Dad was killed in action when I was 9, and he was 3. I love my mom\ndearly but she became a little off the rocker after that happens. Basically, I\nran away from home when I was 17 and pursued a successful life.…",
  "original_created_utc": 1616162288,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "关于这个小故事：这不是关于我的，而是我的小弟弟（他是。\n现在19岁）。) 我爸爸在我9岁的时候就阵亡了，他3岁，我爱我的妈妈。\n亲爱的，但发生那件事后，她变得有点不正常。基本上，我\n17岁离家出走，追求成功人生....。",
      "title": "如果法定监护人拒绝让孩子上学，不正式对孩子进行家庭教育（unschool），基本上因为孩子成年....，他们就完蛋了，怎么办？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "關於這個小故事：這不是關於我的，而是我的小弟弟（他是。\n現在19歲）。) 我爸爸在我9歲的時候就陣亡了，他3歲，我愛我的媽媽。\n親愛的，但發生那件事後，她變得有點不正常。基本上，我\n17歲離家出走，追求成功人生....。",
      "title": "如果法定監護人拒絕讓孩子上學，不正式對孩子進行家庭教育（unschool），基本上因爲孩子成年....，他們就完蛋了，怎麼辦？"
    }
  ],
  "title": "What happens if a legal guardian refuses to let their kid attend school, does not officially homeschool them (unschool), and basically because they reached adulthood.... and they are fucked?",
  "created_utc": 1616172352,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A little back story to this: it is not about me, but my little brother (who is now 19). My Dad was killed in action when I was 9, and he was 3. I love my mom dearly but she became a little off the rocker after that happens. Basically, I ran away from home when I was 17 and pursued a successful life. I now returned home at 25 and she never let him attend school, and did not educate him. </p>\n\n<p>I do not want to get her in trouble because I love her but obviously what she did was wrong. I feel horrible for my brother because he was dealt a bad hand and I want to help him. I just do not know how. What am I to do? It is eating me up inside, and I lost all the success I have gained through a bad divorce. I have no money to help him, and I can barely feed myself but I can’t let my brother just waste his life. He can’t get job, she didn’t let him get his license, and so on. Please, some good advice would be nice right about now.</p>\n</div><!-- SC_ON -->",
  "score": 109,
  "permalink": "/r/NoStupidQuestions/comments/m8htni/what_happens_if_a_legal_guardian_refuses_to_let/",
  "subreddit": "NoStupidQuestions",
  "id": "m8htni",
  "is_self": true,
  "media": null,
  "is_video": false
}