{
  "author": "Joshubruh",
  "the_new_excerpt": "I've noticed that older newspapers would often replace the first c in names such\nas McCarthy with an apostrophe in headlines like M'Carthy. Two specific examples\nfrom the 1860s and 1950s are of George McClellan (M'clellan) and Joe McCarthy.\nI've never seen this done in other contexts and am curious…",
  "original_created_utc": 1621732096,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "古い新聞では、McCarthyのような名前の最初のcをアポストロフィーに置き換えて、M. Carthyのような見出しにすることが多いことに気付きました。\nMcCarthyのような名前の最初のcをアポストロフィーに置き換えて、M'Carthyのような見出しにすることが多いことに気づきました。1860年代と1950年代の2つの具体例\nジョージ・マクレラン（M'clellan）とジョー・マッカーシー（Joe McCarthy）です。\n他の文脈でこのようなことをしているのを見たことがないので、興味があります...。",
      "title": "19世紀から20世紀半ばの新聞で、アイルランド人の名前を綴るのに使われたアポストロフィー。(M'Carthy, M'Clellan)"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我注意到，老式报纸在标题中经常会把名字中的第一个c替换成\nM'Carthy这样的标题中，用一撇一捺的方式来替换名字中的第一个c。两个具体的例子\n19世纪60年代和50年代的两个具体例子是：乔治-麦克莱伦（M'clellan）和乔-麦卡锡。\n我从未在其他情况下见过这种做法，我很好奇......",
      "title": "19世纪至20世纪中叶，报纸上用于拼写爱尔兰名字的撇号。(M'Carthy, M'Clellan)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我注意到，老式報紙在標題中經常會把名字中的第一個c替換成\nM'Carthy這樣的標題中，用一撇一捺的方式來替換名字中的第一個c。兩個具體的例子\n19世紀60年代和50年代的兩個具體例子是：喬治-麥克萊倫（M'clellan）和喬-麥卡錫。\n我從未在其他情況下見過這種做法，我很好奇......",
      "title": "19世紀至20世紀中葉，報紙上用於拼寫愛爾蘭名字的撇號。(M'Carthy, M'Clellan)"
    }
  ],
  "title": "Apostrophes used to spell Irish names in newspapers in the 19th to mid 20th centuries. (M'Carthy, M'Clellan)",
  "created_utc": 1621747009,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve noticed that older newspapers would often replace the first c in names such as McCarthy with an apostrophe in headlines like M&#39;Carthy. Two specific examples from the 1860s and 1950s are of George McClellan (M&#39;clellan) and Joe McCarthy. I&#39;ve never seen this done in other contexts and am curious as to what kind of typographical standard this practice would have come from and when it fell out of favor. Was it just to save type space?</p>\n\n<p>Further, was this an American style or did it originate in Britain or Ireland?</p>\n\n<p>Thanks!</p>\n</div><!-- SC_ON -->",
  "score": 117,
  "permalink": "/r/AskHistorians/comments/niwp6z/apostrophes_used_to_spell_irish_names_in/",
  "subreddit": "AskHistorians",
  "id": "niwp6z",
  "is_self": true,
  "media": null,
  "is_video": false
}