{
  "author": "sandygws",
  "original_created_utc": 1642800857,
  "title": "I read the 26 page Russian Central Bank Report on Crypto so you don't have to: 'Cryptocurrencies: trends, risks, measures'. Russia will NOT be banning Russians from buying, selling, trading, transferring or hodling crypto.",
  "created_utc": 1642833472,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Tldr: The Russia Federation is not proposing to ban Russian citizens from buying, selling, trading, transferring or hodling crypto (on exchanges outside the Russian Federation). &lt;/p&gt;\n\n&lt;p&gt;Disclaimer: &lt;em&gt;Ya ne Russki, nu ya mogu govorite i chitat Russki yazik&lt;/em&gt; (I&amp;#39;m not Russian, but I can speak and read the Russian language). &lt;/p&gt;\n\n&lt;p&gt;As usual the mass media have painted a dystopian picture of how the authoritarian Russian Federation have decided to ban crypto currencies full stop. Blah, blah.... it&amp;#39;s China all over again, blah, blah.&lt;/p&gt;\n\n&lt;p&gt;Except that isn&amp;#39;t what the report is proposing - and yes, it&amp;#39;s only a proposal at this stage - an awfully long way from ever becoming law for multiple reasons. In Russia, government is not actually dictated by the Kremlin, contrary to popular Western perception. Here is what is actually being proposed:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;A ban on the mining of cryptocurrencies on the territory of the Russian Federation. &lt;/li&gt;\n&lt;li&gt;A ban on Russian banks permitting their customers to buy, sell or trade cryptocurrencies.&lt;/li&gt;\n&lt;li&gt;A ban on crypto currency exchanges operating on the territory of the Russian Federation. &lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Most interestingly of all, the new proposals did not come from the Russian Central Bank (which did ban the use of cryptocurrency as a means of payment in 2020). These new proposals actually came from the FSB (The Federal Security Service), which has proposed:&lt;/p&gt;\n\n&lt;p&gt;&amp;#39;A complete ban of all cryptocurrency transactions in Russia, in order to undermine the financing of “foreign agent” media outlets, “undesirable” organizations, and the opposition.&amp;#39;&lt;/p&gt;\n\n&lt;p&gt;Given the security situation in Western Russia (border with Ukraine), it&amp;#39;s no great surprise that the FSB are currently influencing Russian government policy more so than typically. Yet it remains HIGHLY unlikely that these proposals will ever pass into law. Moreover we&amp;#39;ve been here before:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reuters.com/article/us-russia-cenbank-bitcoin/russia-turns-cold-on-crypto-currencies-idUSKBN1CF0RF\"&gt;https://www.reuters.com/article/us-russia-cenbank-bitcoin/russia-turns-cold-on-crypto-currencies-idUSKBN1CF0RF&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Many commentators agree:&lt;/p&gt;\n\n&lt;p&gt;John Wu, president of Ava Labs:&lt;/p&gt;\n\n&lt;p&gt;“Once again we’re seeing the crypto markets’ resilience to this kind of posturing. This is just the latest installment in a pattern of monetary authorities calling for a ban of crypto, and either seeing no further action or reversing their stance in the near future.”&lt;/p&gt;\n\n&lt;p&gt;Indeed, the Russian Finance Minister Anton Siluanov recently stated that: “There is no sense in banning them, there is a need to regulate them&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Then just yesterday, Elizaveta Danilova, the head of the Russian Central Bank&amp;#39;s Financial Stability Department, publicly stated that &amp;quot;Restrictions on owning cryptocurrencies are not envisaged&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;So what we are seeing is typical of how government operates in Russia: the usual power struggle between the security services and central government. Right now the FSB does have the upper hand, but that will only remain so as long as the threat of war with Ukraine is present.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 327,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/CJx6bhjRh835M-3PqOB4CQdb4_LIkTvfV-2renszOT0.jpg?auto=webp&amp;s=c18961760ea7792a992fc9901e502b767b58545c",
          "width": 800,
          "height": 555
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/CJx6bhjRh835M-3PqOB4CQdb4_LIkTvfV-2renszOT0.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=8c37f8f22a2aecefa61aac551ffc039c78cc6e14",
            "width": 108,
            "height": 74
          },
          {
            "url": "https://external-preview.redd.it/CJx6bhjRh835M-3PqOB4CQdb4_LIkTvfV-2renszOT0.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=77f51b54927e007c46c0ddc669af54a69298457f",
            "width": 216,
            "height": 149
          },
          {
            "url": "https://external-preview.redd.it/CJx6bhjRh835M-3PqOB4CQdb4_LIkTvfV-2renszOT0.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=e594738655c6bbaef50542e30c3f8e9030a9222b",
            "width": 320,
            "height": 222
          },
          {
            "url": "https://external-preview.redd.it/CJx6bhjRh835M-3PqOB4CQdb4_LIkTvfV-2renszOT0.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=bab581206b2cdb2aea8cd116df274e7a7f81baf3",
            "width": 640,
            "height": 444
          }
        ],
        "variants": {},
        "id": "IJliza246kj8i6MMMp2SsWYd4loPVQ9e907iM8UEVUg"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/s9ll3i/i_read_the_26_page_russian_central_bank_report_on/",
  "subreddit": "CryptoCurrency",
  "id": "s9ll3i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Tldr: The Russia Federation is not proposing to ban Russian citizens from\nbuying, selling, trading, transferring or hodling crypto (on exchanges outside\nthe Russian Federation).\n\nDisclaimer: Ya ne Russki, nu ya mogu govorite i chitat Russki yazik (I'm not\nRussian, but I can speak and read the…"
}