{
  "author": "AlreadyLiberated",
  "original_created_utc": 1624372659,
  "title": "Can we stop pretending the crash only hurts if you’re over invested?",
  "created_utc": 1624401448,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I only invested what I can afford to lose, have a maxed-out 401k in index funds, steady income, and so on. Know what? It still hurts like fuck to be down 50% since April. And I haven’t even lost anything. I’m holding for years to come.</p>\n\n<p>I see this post after post with some version of: “If you’re upset about the crash, you’re over invested.”</p>\n\n<p>But I don’t think it’s universal.</p>\n\n<p>Some of us hate to lose, even if it’s money we can afford to lose. Some of us hate to lose, even if those losses aren’t actualized because we’re holding. Some of us hate to lose a nickel or a game or Monopoly to a child. Some of us hate to lose at big stuff and small stuff alike. As adults, we learn to deal with this character trait in healthy ways. The hatred of losing drives us to excel, to do better next time. We learn to not allow it to make us depressed, or cruel, or to take it out on anyone. Especially not the child who beats us at Monopoly. </p>\n\n<p>But some of just hate to lose at anything, even for a minute. And this is not a bad thing.</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/CryptoCurrency/comments/o5omll/can_we_stop_pretending_the_crash_only_hurts_if/",
  "subreddit": "CryptoCurrency",
  "id": "o5omll",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I only invested what I can afford to lose, have a maxed-out 401k in index funds,\nsteady income, and so on. Know what? It still hurts like fuck to be down 50%\nsince April. And I haven’t even lost anything. I’m holding for years to come.\n\nI see this post after post with some version of: “If you’re…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "失う可能性のあるものだけを投資し、インデックスファンドで401kを最大限に活用している。\n安定した収入があることなどです。でもね。4月から50％も下がってしまったのは、まだすごく痛いです。\n4月から50％も下がってしまったのは、まだすごく痛いです。私は何も失っていないのに。この先何年も持ち続けるつもりです。\n\n私はこの記事を何度も目にしました。\"If you're...",
      "title": "過剰な投資をしていれば暴落の影響を受けない、というのはもうやめませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我只投资我能够承受的损失，在指数基金中拥有最大的401k。\n稳定的收入，等等。知道吗？跌了50%还是很疼的。\n自4月以来，它仍然痛得要命。而我甚至没有损失什么。我还在为未来几年而持有。\n\n我看到一个又一个的帖子，其中有一些版本是这样的。\"如果你是...",
      "title": "我们能不能不要再假装崩盘只在你过度投资时才会造成伤害？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我只投資我能夠承受的損失，在指數基金中擁有最大的401k。\n穩定的收入，等等。知道嗎？跌了50%還是很疼的。\n自4月以來，它仍然痛得要命。而我甚至沒有損失什麼。我還在爲未來幾年而持有。\n\n我看到一個又一個的帖子，其中有一些版本是這樣的。\"如果你是...",
      "title": "我們能不能不要再假裝崩盤只在你過度投資時纔會造成傷害？"
    }
  ]
}