{
  "author": "Iiau_",
  "the_new_excerpt": "When I first entered this sub, with only a pocketful, a nominal amount of\ncrypto, I generally believed most of the people here are in with tens of\nthousands of dollars. Turns out, 46% of people…",
  "original_created_utc": 1618780341,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が最初にこのサブに入ったとき、ポケットに一杯の、わずかな量の暗号しか持っていませんでした。\nここにいる人たちのほとんどが数万ドルを持っていると思っていました。\n数万ドルだと思っていましたが しかし、実際には46％の人が...",
      "title": "自分の生活の中で、少ししか暗号に投資できなくても、がっかりしないでください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当我第一次进入这个子时，只带了一口袋钱，象征性地用了\n加密，我一般相信这里的大部分人都是以几十块钱进的\n数千美元。原来，46%的人...",
      "title": "如果你的生活只允许你在加密技术上投入一点，也不要灰心。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當我第一次進入這個子時，只帶了一口袋錢，象徵性地用了\n加密，我一般相信這裏的大部分人都是以幾十塊錢進的\n數千美元。原來，46%的人...",
      "title": "如果你的生活只允許你在加密技術上投入一點，也不要灰心。"
    }
  ],
  "title": "Don't be discouraged if your life only allows you to put a little bit into crypto.",
  "created_utc": 1618842679,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>When I first entered this sub, with only a pocketful, a nominal amount of crypto, I generally believed most of the people here are in with tens of thousands of dollars. <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/mktalq/whats_the_average_holdings_of_a_rcryptocurrency/\">Turns out, 46% of people here</a> do have over 10K in crypto. It intimidated me. People are more financially qualified, and/or have been in the game longer than me, just how there are people in the game before you.</p>\n\n<p>I observe the euphoria that people are treating this bull run like it is the moment of a lifetime, and to some it is. It&#39;s bad mentality to make it seem like you have to put absolutely everything of material into something like this as if it is <em>the</em> lifetime opportunity. The future holds uncertain and there is very likely many more money making opportunities in the years and decades. Everyone should invest at their own pace.</p>\n\n<p>If you&#39;re invested in even a hundred dollars, or even have the few moons in your vault, congratulate yourself. You&#39;re in crypto. That&#39;s the point. Something valuable to you is valuable to <em>you</em> and gains are gains, no matter how small. </p>\n\n<p>And everyone&#39;s definition of reaching the moon is different. If your moon is to achieve financial independence, go for it. If your moon is to feed yourself in an impoverished country, go for it. Encourage each other.</p>\n</div><!-- SC_ON -->",
  "score": 166,
  "permalink": "/r/CryptoCurrency/comments/mtlmdn/dont_be_discouraged_if_your_life_only_allows_you/",
  "subreddit": "CryptoCurrency",
  "id": "mtlmdn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171521466
}