{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "The core issue is that inflation this time around does not have much to  do with pressures that have historically led to inflation.  If Fed  quantitative easing policy had anything substantial to do with current inflation we would  not be seeing local inflation around the world in almost every single  developed country.  The pandemic obviously has a huge role in our  current predicament.  COVID completely threw out the rule book for both  monetary or fiscal policy and the truth is our financial institutions are  not able to realistically do much to combat the core, fundamental causes of  inflation this time around (supply-chain issues).  Raising interest  rates at this point is only being done to erect a facade that the Fed is  actually in control, when in reality they are trying to control an  uncontrollable situation using old methods.  In other words, it's  nothing more than a placebo.  Worse, raising interest rates may actually  do far more harm than good in our current environment, because aside  from the FAANGs and a few other key players the US economy has not even  begun to recover from the pandemic and is actually in a far worse place  that it was three years ago.  I've got a decent background in economics  but would love to hear a counterpoint to my thinking.",
  "author_fullname": "t2_362gg",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "The Fed raising interest rates is nothing more than a monetary placebo",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_spk7xj",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.72,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 215,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 215,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": 1644536939,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1644536744,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": true,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The core issue is that inflation this time around does not have much to  do with pressures that have historically led to inflation.  If Fed  quantitative easing policy had anything substantial to do with current inflation we would  not be seeing local inflation around the world in almost every single  developed country.  The pandemic obviously has a huge role in our  current predicament.  COVID completely threw out the rule book for both  monetary or fiscal policy and the truth is our financial institutions are  not able to realistically do much to combat the core, fundamental causes of  inflation this time around (supply-chain issues).  Raising interest  rates at this point is only being done to erect a facade that the Fed is  actually in control, when in reality they are trying to control an  uncontrollable situation using old methods.  In other words, it&amp;#39;s  nothing more than a placebo.  Worse, raising interest rates may actually  do far more harm than good in our current environment, because aside  from the FAANGs and a few other key players the US economy has not even  begun to recover from the pandemic and is actually in a far worse place  that it was three years ago.  I&amp;#39;ve got a decent background in economics  but would love to hear a counterpoint to my thinking.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "spk7xj",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "frostkaiser",
  "discussion_type": null,
  "num_comments": 69,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/spk7xj/the_fed_raising_interest_rates_is_nothing_more/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/spk7xj/the_fed_raising_interest_rates_is_nothing_more/",
  "subreddit_subscribers": 3634273,
  "created_utc": 1644550556,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1644536744,
  "the_new_excerpt": "The core issue is that inflation this time around does not have much to do with\npressures that have historically led to inflation. If Fed quantitative easing\npolicy had anything substantial to do with current inflation we would not be\nseeing local inflation around the world in almost every single…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "核心的な問題は、今回のインフレがあまり関係ないことです。\n歴史的にインフレを引き起こしてきた圧力が もしFRBの量的緩和が\n現在のインフレに実質的な影響を与えるような政策であれば、このような事態にはならないでしょう。\n世界各地で局地的なインフレが起きているのは、ほとんどすべて...",
      "title": "FRBの利上げは、金融プラシーボに過ぎない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "核心问题是，这次的通货膨胀与历史上导致通货膨胀的压力没有多大关系。\n历史上导致通胀的压力。如果美联储的量化宽松\n政策与当前的通货膨胀有任何实质性的关系，我们就不会\n我们就不会在世界各地看到几乎所有的地方性通货膨胀。",
      "title": "美联储加息只不过是一种货币安慰剂"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "核心問題是，這次的通貨膨脹與歷史上導致通貨膨脹的壓力沒有多大關係。\n歷史上導致通脹的壓力。如果美聯儲的量化寬鬆\n政策與當前的通貨膨脹有任何實質性的關係，我們就不會\n我們就不會在世界各地看到幾乎所有的地方性通貨膨脹。",
      "title": "美聯儲加息只不過是一種貨幣安慰劑"
    }
  ],
  "source_updated_at": 1644572439290
}