{
  "author": "partymsl",
  "original_created_utc": 1644602039,
  "title": "Satoshi Nakamoto disappearing was the biggest masterstroke ever done and the thing that actually made crypto what it is today.",
  "created_utc": 1644622346,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;13 Years ago today Satoshi said that trust is the main problem with central banks. The centralized system needs you to trust all party&amp;#39;s included. And athst very hard to do nowadays.&lt;/p&gt;\n\n&lt;p&gt;That probably also was the reason why Satoshi Nakamoto disappeared. Crypto is about being anonymous, it&amp;#39;s about having a decentralized system where you don&amp;#39;t have to trust anyone (obviously that does even today not happen everywhere in crypto).&lt;/p&gt;\n\n&lt;p&gt;If Satoshi would have still been here and available to everyone. He would be seen as the big CEO of Crypto by some people that do not have real knowledge about crypto. And that would have been another argument for them to call it a &amp;quot;scam&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Him not being here makes crypto what it was always meant to be: decentralized. No one is up there, we just don&amp;#39;t know who made it. It&amp;#39;s anonymous.&lt;/p&gt;\n\n&lt;p&gt;Satoshi Nakamoto played the game and he set off the fire that is still burning, brighter than ever.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 574,
  "permalink": "/r/CryptoCurrency/comments/sq5b1o/satoshi_nakamoto_disappearing_was_the_biggest/",
  "subreddit": "CryptoCurrency",
  "id": "sq5b1o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "13 Years ago today Satoshi said that trust is the main problem with central\nbanks. The centralized system needs you to trust all party's included. And athst\nvery hard to do nowadays.\n\nThat probably also was the reason why Satoshi Nakamoto disappeared. Crypto is\nabout being anonymous, it's about…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "13年前の今日、サトシは中央銀行の主な問題は信頼であると言った。\n銀行 中央集権的なシステムでは、すべての関係者を信頼する必要があります。そのため\n非常に困難な時代です。\n\nサトシ・ナカモトが姿を消した理由も、おそらくそこにあるのでしょう。暗号は\n匿名であること、それは...。",
      "title": "サトシ・ナカモトが姿を消したことは、これまでで最大の傑作であり、暗号を今日のようなものにしたものです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "13年前的今天，中本聪说，信任是中央银行的主要问题。\n银行的主要问题。集中式系统需要你信任包括在内的所有各方。而这一点\n现在很难做到。\n\n这可能也是中本聪消失的原因。密码货币是\n是关于匿名的，是关于...",
      "title": "中本聪的消失是有史以来最大的大手笔，也是真正使加密货币成为今天这样的东西。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "13年前的今天，中本聰說，信任是中央銀行的主要問題。\n銀行的主要問題。集中式系統需要你信任包括在內的所有各方。而這一點\n現在很難做到。\n\n這可能也是中本聰消失的原因。密碼貨幣是\n是關於匿名的，是關於...",
      "title": "中本聰的消失是有史以來最大的大手筆，也是真正使加密貨幣成爲今天這樣的東西。"
    }
  ]
}