{
  "author": "stiviki",
  "original_created_utc": 1631662783,
  "title": "I feel Dr. Gavin Woods ROASTED a lot of top 50 coins!",
  "created_utc": 1631688076,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Dr. Gavin Woods must be the most underrated guy in cryptoverse, this legend is just the creator of ETH, DOT and KSM (this burned my CV)! Related to Solana event today, hard truths were written:</p>\n\n<p>&quot;<strong><em>Events of today in crypto just go to show that genuine decentralisation and well-designed security make a far more valuable proposition than some big tps numbers coming from an exclusive and closed set of servers. If you can&#39;t run a full-node yourself then it&#39;s just another bank.</em></strong>&quot;</p>\n\n<p>It is essential that we think about the way we want our L1 solutions to work!</p>\n\n<p>What&#39;s your opinion?</p>\n</div><!-- SC_ON -->",
  "score": 155,
  "permalink": "/r/CryptoCurrency/comments/poefmg/i_feel_dr_gavin_woods_roasted_a_lot_of_top_50/",
  "subreddit": "CryptoCurrency",
  "id": "poefmg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Dr. Gavin Woods must be the most underrated guy in cryptoverse, this legend is\njust the creator of ETH, DOT and KSM (this burned my CV)! Related to Solana\nevent today, hard truths were written:\n\n\"Events of today in crypto just go to show that genuine decentralisation and\nwell-designed security make…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Gavin Woods博士は、クリプトバースで最も過小評価されている人物に違いありません。\nETH、DOT、KSM（これは私の履歴書にも書かれています）の生みの親でもあります。ソラナに関連して\n今日のイベントでは、厳しい真実が書かれていました。\n\n\"今日の暗号の出来事は、本物の分散化とうまく設計されたセキュリティが、...\nうまく設計されたセキュリティが...",
      "title": "Dr. Gavin Woodsがたくさんのトップ50コインを焼いてくれたと感じています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Gavin Woods博士一定是加密世界中最被低估的人，这个传奇人物是\n只是ETH、DOT和KSM的创造者（这烧了我的简历）! 与索拉纳有关\n今天的事件，写下了艰难的事实。\n\n\"今天的加密货币事件表明，真正的去中心化和\n设计良好的安全性使...",
      "title": "我觉得加文-伍兹博士烤了很多前50名的硬币!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Gavin Woods博士一定是加密世界中最被低估的人，這個傳奇人物是\n只是ETH、DOT和KSM的創造者（這燒了我的簡歷）! 與索拉納有關\n今天的事件，寫下了艱難的事實。\n\n\"今天的加密貨幣事件表明，真正的去中心化和\n設計良好的安全性使...",
      "title": "我覺得加文-伍茲博士烤了很多前50名的硬幣!"
    }
  ]
}