{
  "author": "RusticBohemian",
  "original_created_utc": 1626371084,
  "title": "Hesiod tells us of Atalanta, a fast female runner who \"rejected her equals, avoided marriage with men who eat bread.\" What does this mean?",
  "created_utc": 1626385442,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>&quot;Atalanta, swift of foot, beaming eyes who rejected her equals, avoided marriage with men who eat bread&quot; — <em>Petrie Papyri (ed. Mahaffy), Pl. III. 3:</em></p>\n\n<p>I know athletes ate an unusual amount of meat in Ancient Greece and Rome. But I doubt many ate no bread. </p>\n\n<p>What did she mean about rejecting her equals? What would eating bread tell her about a potential husband?</p>\n</div><!-- SC_ON -->",
  "score": 126,
  "permalink": "/r/AskHistorians/comments/okxx12/hesiod_tells_us_of_atalanta_a_fast_female_runner/",
  "subreddit": "AskHistorians",
  "id": "okxx12",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "\"Atalanta, swift of foot, beaming eyes who rejected her equals, avoided marriage\nwith men who eat bread\" — Petrie Papyri (ed. Mahaffy), Pl. III. 3:\n\nI know athletes ate an unusual amount of meat in Ancient Greece and Rome. But I\ndoubt many ate no bread.\n\nWhat did she mean about rejecting her equals?…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "\"アタランタ、足が速く、目が輝いていて、同類を拒絶し、パンを食べる男との結婚を避けた。\nパンを食べる男たちとの結婚を避けた」 - ペトリ・パピルス (ed. Mahaffy), Pl. III. 3:\n\n古代ギリシャ・ローマでは、スポーツ選手が異常なほど肉を食べていたことは知っています。しかし、私は\nパンを食べない人も多かったのではないでしょうか。\n\n彼女が対等な人間を拒絶したのはどういうことか...。",
      "title": "ヘシオドスは、「同類を拒み、パンを食べる男との結婚を避けた」足の速い女性ランナー、アタランタについて語っている。これは何を意味しているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "\"阿塔兰特，脚步轻快，眼睛炯炯有神，拒绝接受她的平等，避免与吃面包的男人结婚\n与吃面包的男人结婚\" - Petrie Papyri (ed. Mahaffy), Pl. III. 3:\n\n我知道在古希腊和古罗马，运动员吃的肉是非常多的。但我\n我怀疑很多人不吃面包。\n\n她说拒绝她的平等人是什么意思？",
      "title": "赫西俄德告诉我们，阿塔兰特是一个快速的女性跑步者，她 \"拒绝她的平等，避免与吃面包的男人结婚\"。这意味着什么呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "\"阿塔蘭特，腳步輕快，眼睛炯炯有神，拒絕接受她的平等，避免與吃麪包的男人結婚\n與吃麪包的男人結婚\" - Petrie Papyri (ed. Mahaffy), Pl. III. 3:\n\n我知道在古希臘和古羅馬，運動員喫的肉是非常多的。但我\n我懷疑很多人不吃麪包。\n\n她說拒絕她的平等人是什麼意思？",
      "title": "赫西俄德告訴我們，阿塔蘭特是一個快速的女性跑步者，她 \"拒絕她的平等，避免與吃麪包的男人結婚\"。這意味着什麼呢？"
    }
  ]
}