{
  "author": "makeasnek",
  "original_created_utc": 1644065821,
  "title": "Have you ever heard an intelligent, well-spoken person who clearly understands blockchain technology say it's all a scam or it's going nowhere or it's not the future?",
  "created_utc": 1644079104,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Exactly. &lt;strong&gt;90% of the criticism you read about blockchain, web3, etc is written by people who&lt;/strong&gt; &lt;strong&gt;&lt;em&gt;literally do not know what it is or how it works&lt;/em&gt;&lt;/strong&gt;. Obviously, if you do not know how something works, you can&amp;#39;t see potential in it in terms of what it can do. If you think the limits of NFTs are jpegs of monkeys or in-game upgrades and Bitcoin is just internet money which takes a lot of energy to move around, you do not understand why there is all the hype around them. It would of course look like a ponzi scheme to you.&lt;/p&gt;\n\n&lt;p&gt;Low intelligence, and the lack of understanding of the world around you and the way it works lends itself to conspiratorial thinking. This is found in &lt;a href=\"https://www.psypost.org/2021/07/new-study-indicates-conspiracy-theory-believers-have-less-developed-critical-thinking-ability-61347\"&gt;study after study&lt;/a&gt;. If things around you are confusing and you don&amp;#39;t understand them, but it seems like at least &lt;em&gt;some&lt;/em&gt; people understand them, of course you would think they are in cahoots. It&amp;#39;s easier to say they must be in cahoots than to acknowledge your own intellectual failings. You are the dementia patient who won&amp;#39;t admit or lacks the awareness to know that they are just forgetting where they put things, so you instead accuse everybody around you of stealing.&lt;/p&gt;\n\n&lt;p&gt;In the same way, lack of understanding about blockchain leads you to believe it&amp;#39;s all a conspiracy, ponzi scheme, FOMO/hype nonsense, etc. Are there some conspiracies in the world? Of course. But is your average watcher of &amp;quot;Ancient aliens&amp;quot; or subscriber to the conspiracy subreddit the smartest duck in the room? No. The world is too complicated, and they seek a simple solution which makes them seem like they understand everything, they don&amp;#39;t want to be somebody who is confused all the time, they just want the world to make sense, and conspiracy gives them a simple explanation that does, even if it seems fantastical to others. It&amp;#39;s a very understandable human response to having too much information, and we all do it from time to time.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;All the intelligent, well-spoken people I know who -- understand blockchain tech --have no problem thinking creatively about many, many use cases for it&lt;/strong&gt;. People who are much smarter than me, who can explain what a zk-rollup is and why it matters. They may say that a lot of the NFT stuff is hype, or guardedly say that crypto can&amp;#39;t solve everything, or that web3 has some kinks to work out, because of course it does, it is a new technology. Intelligent people &lt;em&gt;are not afraid of nuance and complexity&lt;/em&gt; because they can keep track of it all. They don&amp;#39;t jump to the conclusion that it&amp;#39;s all or nothing, or that because they don&amp;#39;t understand it, it must not have value. They aren&amp;#39;t afraid to admit when they are wrong, or that their understanding may change in the future, they understand the world is not binary and that some things are complex enough that they lack the knowledge to fully understand them.&lt;/p&gt;\n\n&lt;p&gt;Crypto is the future. Tech geniuses see it. Major financial institutions see it. &lt;strong&gt;Your friend who thinks crypto is a scam doesn&amp;#39;t. And that&amp;#39;s ok, they don&amp;#39;t have to.&lt;/strong&gt; They would have said the same thing about the internet, and they&amp;#39;ll be using it in 20 years whether they&amp;#39;re excited about it or not.&lt;/p&gt;\n\n&lt;p&gt;But if you really want to challenge them, ask questions. Ask them &amp;quot;why?&amp;quot; and you will quickly find they have no fucking idea what they are even talking about. So don&amp;#39;t waste your time debating them.&lt;/p&gt;\n\n&lt;p&gt;PS If you are interested in learning more about how cryptocurrency works and can help the development of science please check out &lt;a href=\"http://np.reddit.com/r/cryptoforscience\"&gt;http://np.reddit.com/r/cryptoforscience&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 443,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/zaBIRZIZ32FSJm_Ds0yUbwrwnNrdNgCAJyYq-8Dl7I8.jpg?auto=webp&amp;s=53c4ea92e77e4dbd7b049ee79cb7cfafcde5ee11",
          "width": 1140,
          "height": 570
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/zaBIRZIZ32FSJm_Ds0yUbwrwnNrdNgCAJyYq-8Dl7I8.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=b331dcbda163d1c45a62f2fd2162e3ada9310d0c",
            "width": 108,
            "height": 54
          },
          {
            "url": "https://external-preview.redd.it/zaBIRZIZ32FSJm_Ds0yUbwrwnNrdNgCAJyYq-8Dl7I8.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=e69fdf26dcdcbb0de50f43859b5e3a35dcf49485",
            "width": 216,
            "height": 108
          },
          {
            "url": "https://external-preview.redd.it/zaBIRZIZ32FSJm_Ds0yUbwrwnNrdNgCAJyYq-8Dl7I8.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=6436404a7d56bdbae6aed2444d89e00edcb11be6",
            "width": 320,
            "height": 160
          },
          {
            "url": "https://external-preview.redd.it/zaBIRZIZ32FSJm_Ds0yUbwrwnNrdNgCAJyYq-8Dl7I8.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=3009ac6971c27e392e4722285c388ebb0db89649",
            "width": 640,
            "height": 320
          },
          {
            "url": "https://external-preview.redd.it/zaBIRZIZ32FSJm_Ds0yUbwrwnNrdNgCAJyYq-8Dl7I8.jpg?width=960&amp;crop=smart&amp;auto=webp&amp;s=3899d64d2bde186eb398a1fb42727879a4b74daa",
            "width": 960,
            "height": 480
          },
          {
            "url": "https://external-preview.redd.it/zaBIRZIZ32FSJm_Ds0yUbwrwnNrdNgCAJyYq-8Dl7I8.jpg?width=1080&amp;crop=smart&amp;auto=webp&amp;s=dfb19319bcd3cf9b59264dd092ca552fa622eeda",
            "width": 1080,
            "height": 540
          }
        ],
        "variants": {},
        "id": "gqLoFZItTXx_zEagVYjcHSrBTw8ORs8KurpXUNl_3Vw"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/sl6cmh/have_you_ever_heard_an_intelligent_wellspoken/",
  "subreddit": "CryptoCurrency",
  "id": "sl6cmh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Exactly. 90% of the criticism you read about blockchain, web3, etc is written by\npeople who literally do not know what it is or how it works. Obviously, if you\ndo not know how something works, you can't see potential in it in terms of what\nit can do. If you think the limits of NFTs are jpegs of…"
}