{
  "author": "xavierwest888",
  "original_created_utc": 1641912440,
  "title": "Calling everything in crypto a 'coin' is going to be this generations calling every game console a 'Nintendo'",
  "created_utc": 1641923115,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Title says it all, the 90s were dominated by a singular games console, the Nintendo to the point where they had almost the entire market share of the home video games field. It go the point where Nintendo became THE word for a games console for those that had only a passing knowledge of the subject.&lt;/p&gt;\n\n&lt;p&gt;Fast forward to today and bitcoin is the new Nintendo, it has owned and still owns the lions share of the crypto market. Most people have heard of it and probably think all crypto IS just bitcoin. Now people refer to everything as a &amp;#39;coin&amp;#39; no matter what it actually is.&lt;/p&gt;\n\n&lt;p&gt;The next generation are going to be making memes about us here in the present not knowing the difference between a v2000 utility chip and a micro contract smart tokeniser is and instead calling them both, coins while trying to tell them that back in my day we didn&amp;#39;t need any of this new age fancy stuff.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Edit: I&amp;#39;m sure it won&amp;#39;t be long before NFTs are called coins as well.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 316,
  "permalink": "/r/CryptoCurrency/comments/s1ek6i/calling_everything_in_crypto_a_coin_is_going_to/",
  "subreddit": "CryptoCurrency",
  "id": "s1ek6i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Title says it all, the 90s were dominated by a singular games console, the\nNintendo to the point where they had almost the entire market share of the home\nvideo games field. It go the point where Nintendo became THE word for a games\nconsole for those that had only a passing knowledge of the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルが全てを物語っています。90年代は、ゲーム機という特異な存在に支配されました。\n任天堂は、家庭用ゲーム機のほぼ全シェアを占めていたほどです。\nビデオゲーム分野 任天堂がゲームソフトの代名詞になったほどです\nちょっとしか知識のない人たちのためのゲーム機...",
      "title": "暗号のすべてを「コイン」と呼ぶことは、すべてのゲーム機を「任天堂」と呼ぶこの世代になりそうだ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "标题说明了一切，90年代是由一个单一的游戏机主导的，即\n任天堂，以至于他们几乎占据了家用视频游戏领域的全部市场份额。\n视频游戏领域。在这一点上，任天堂成为游戏机的代名词。\n意思是说，对于那些对游戏机只有一知半解的人来说，任天堂成为了游戏机的代名词。",
      "title": "把加密货币中的所有东西都称为'币'，将是这几代人把每台游戏机都称为'任天堂'。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "標題說明了一切，90年代是由一個單一的遊戲機主導的，即\n任天堂，以至於他們幾乎佔據了家用視頻遊戲領域的全部市場份額。\n視頻遊戲領域。在這一點上，任天堂成爲遊戲機的代名詞。\n意思是說，對於那些對遊戲機只有一知半解的人來說，任天堂成爲了遊戲機的代名詞。",
      "title": "把加密貨幣中的所有東西都稱爲'幣'，將是這幾代人把每臺遊戲機都稱爲'任天堂'。"
    }
  ]
}