{
  "author": "The-world-is-done",
  "the_new_excerpt": "Not to be the party-pooper but this shit will end up for a few of you people\nvery bad. Some tards are maxing out their credit cards just to gamble it away?\nTaking loans to ride this to Pluto without knowing what the fuck they’re doing?\nSome will end up committing suicide because they are so excited…",
  "original_created_utc": 1611542652,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我不想当个扫兴的人，但你们几个人的结局会是这样的。\n非常糟糕。有些人把信用卡刷爆了就为了赌钱？\n贷款去冥王星，却不知道自己在做什么？\n有些人会因为太兴奋而自杀...",
      "title": "GME对你们很多新手来说会有不好的结局。不，我不是石龙。只是一个警告。WSB版主不让我发这个）。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不想當個掃興的人，但你們幾個人的結局會是這樣的。\n非常糟糕。有些人把信用卡刷爆了就爲了賭錢？\n貸款去冥王星，卻不知道自己在做什麼？\n有些人會因爲太興奮而自殺...",
      "title": "GME對你們很多新手來說會有不好的結局。不，我不是石龍。只是一個警告。WSB版主不讓我發這個）。"
    }
  ],
  "title": "GME will end bad for a lot of you newbies. No I am not Shitron. Just a warning. (WSB mods won’t let me post this.)",
  "created_utc": 1611569404,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Not to be the party-pooper but this shit will end up for a few of you people very bad. Some tards are maxing out their credit cards just to gamble it away? Taking loans to ride this to Pluto without knowing what the fuck they’re doing? Some will end up committing suicide because they are so excited from others rocket posts that they don’t realize this shit is fucking irresponsible. </p>\n\n<p>Fuck some guy in desperation asked in a post when to sell since he didn’t know what he was doing and that he YOLO’d his money that his family needs and is unable to lose. </p>\n\n<p>Btw, No...I am not a boomer. And yes, I use RH. </p>\n\n<p>This will be super sad to see, tbh. Also yeah I love that for once big institutions are getting fucked, but this is just bad for all noobs.</p>\n</div><!-- SC_ON -->",
  "score": 1510,
  "permalink": "/r/investing/comments/l4e49x/gme_will_end_bad_for_a_lot_of_you_newbies_no_i_am/",
  "subreddit": "investing",
  "id": "l4e49x",
  "is_self": true,
  "media": null,
  "is_video": false
}