{
  "author": "goathen",
  "original_created_utc": 1636938927,
  "title": "Elon Musk hates cash. He now has billions of dollars sitting in cash for the first time in his life. What do you suppose he's going to do with it?",
  "created_utc": 1636957865,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Musk is selling 10% of his Tesla stake, valued at roughly $25 billion. A chunk of that will be used to pay off taxes as he executes options from his executive comp package. But that would still leave him with enough to become the world&#39;s biggest known hodler of Bitcoin—if he so chooses.</p>\n</div><!-- SC_ON -->",
  "score": 167,
  "permalink": "/r/Bitcoin/comments/qu4hg8/elon_musk_hates_cash_he_now_has_billions_of/",
  "subreddit": "Bitcoin",
  "id": "qu4hg8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Musk is selling 10% of his Tesla stake, valued at roughly $25 billion. A chunk\nof that will be used to pay off taxes as he executes options from his executive\ncomp package. But that would still leave him with enough to become the world's\nbiggest known hodler of Bitcoin—if he so chooses.",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "マスク氏は、およそ250億ドルと評価されるテスラの株式の10％を売却します。その一部は\nその一部は、彼の役員報酬に含まれるオプションの実行に伴う税金の支払いに充てられます。\nその一部は税金の支払いに充てられます。しかし、それでも彼には、世界最大のビットコイン販売者として知られるようになるための十分な資金が残されています。\nもし彼が望めば、世界最大のビットコイン・ホドラーになることができます。",
      "title": "イーロン・マスクは現金が嫌いです。彼は今、人生で初めて数十億ドルの現金を手にしています。彼はそれをどうしようとしているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "马斯克正在出售他所持有的10%的特斯拉股份，价值约为250亿美元。其中一大块\n其中一大块将用于支付税款，因为他执行了他的高管薪酬方案中的期权。\n薪酬方案。但这仍将使他有足够的资金成为世界上\n如果他愿意的话，他仍有足够的资金成为世界上最大的比特币持有者。",
      "title": "埃隆-马斯克痛恨现金。他现在有数十亿美元的现金，这是他人生中第一次坐拥现金。你认为他要用它做什么呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "馬斯克正在出售他所持有的10%的特斯拉股份，價值約爲250億美元。其中一大塊\n其中一大塊將用於支付稅款，因爲他執行了他的高管薪酬方案中的期權。\n薪酬方案。但這仍將使他有足夠的資金成爲世界上\n如果他願意的話，他仍有足夠的資金成爲世界上最大的比特幣持有者。",
      "title": "埃隆-馬斯克痛恨現金。他現在有數十億美元的現金，這是他人生中第一次坐擁現金。你認爲他要用它做什麼呢？"
    }
  ]
}