{
  "author": "The_Lord134",
  "original_created_utc": 1649435106,
  "title": "Why don't Modern women want to be housewives anymore?",
  "created_utc": 1649444898,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a 20 year male and speaking from my point of view I think it&amp;#39;s awesome that if i had the opinion I would want to be a stay at home parent. I don&amp;#39;t have to deal with stressful managers or a toxic workplace, cleaning a regular sized home is very easy and efficient with all the technology we have now a days. The only thing I can really think of that might be a pain to deal with is cooking which takes practice and patience lastly including taking care of the kids which is easier said than done but as the years go by the kids start becoming self sufficient and your involvement babysitting decrease thus giving you alot of free time.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 107,
  "permalink": "/r/TooAfraidToAsk/comments/tz7cc8/why_dont_modern_women_want_to_be_housewives/",
  "subreddit": "TooAfraidToAsk",
  "id": "tz7cc8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm a 20 year male and speaking from my point of view I think it's awesome that\nif i had the opinion I would want to be a stay at home parent. I don't have to\ndeal with stressful managers or a toxic workplace, cleaning a regular sized home\nis very easy and efficient with all the technology we have…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は20歳の男性ですが、私の立場から言うと、以下のことがすごいと思います。\nもし私が意見を言うなら、家にいる親になりたいと思います。私は\nストレスの多い管理職や有害な職場に対処し、普通の大きさの家を掃除する。\nは、あらゆるテクノロジーを駆使して、とても簡単で効率的です...。",
      "title": "なぜ現代女性は専業主婦になりたがらなくなったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个20岁的男性，从我的角度讲，我认为这很好。\n如果我有意见，我想做一个在家的父母。我不需要\n处理压力大的经理或有毒的工作场所，清洁一个普通大小的家庭\n在我们拥有的所有技术条件下，清洁一个普通大小的家庭是非常容易和有效的...",
      "title": "为什么现代女性不再愿意做家庭主妇了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個20歲的男性，從我的角度講，我認爲這很好。\n如果我有意見，我想做一個在家的父母。我不需要\n處理壓力大的經理或有毒的工作場所，清潔一個普通大小的家庭\n在我們擁有的所有技術條件下，清潔一個普通大小的家庭是非常容易和有效的...",
      "title": "爲什麼現代女性不再願意做家庭主婦了？"
    }
  ]
}