{
  "author": "ShiningConcepts",
  "original_created_utc": 1633329859,
  "title": "Doesn't releasing felonies and giving them criminal records defeat the whole point of releasing them, given how they'd have trouble getting jobs or renting apartments, thus condemning them to offend again?",
  "created_utc": 1633352533,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For the vast majority of people, employment and finding housing are essential things to do to live a remotely comfortable and law-abiding life, at least here in the US. If a felon who has served their time is released, and has complied with their probation and any other terms of their release, why are they given criminal records that landlords and employers can check?</p>\n\n<p>Assuming there are no family/friends willing to support that felon, this will make it extremely difficult for them to establish a stable life. Like, maybe I&#39;m dumb, but doesn&#39;t this defeat the whole point of releasing them? Haven&#39;t they already served their time? Aren&#39;t they basically being condemned to a life sentence, that sets them up for recidivism?</p>\n\n<p>Of course I understand why it&#39;s there for highly sensitive jobs (i.e. working with children). But for all jobs?</p>\n\n<p>How are released felons supposed to turn their lives around with this massive disadvantage on them?</p>\n</div><!-- SC_ON -->",
  "score": 114,
  "permalink": "/r/NoStupidQuestions/comments/q104tf/doesnt_releasing_felonies_and_giving_them/",
  "subreddit": "NoStupidQuestions",
  "id": "q104tf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "For the vast majority of people, employment and finding housing are essential\nthings to do to live a remotely comfortable and law-abiding life, at least here\nin the US. If a felon who has served their time is released, and has complied\nwith their probation and any other terms of their release, why…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "大多数の人にとって、就職と住居の確保は、遠隔地で快適に暮らすための\n少なくともアメリカでは、法を守って快適な生活を送るためには、雇用と住居の確保が欠かせません。\nアメリカでは 刑期を終えた重罪犯が釈放され、保護観察やその他の釈放条件に従った場合、なぜ\n刑期を終えた重罪犯が釈放され、保護観察やその他の釈放条件を遵守した場合、なぜ...",
      "title": "重罪者を釈放して前科をつけると、仕事やアパートを借りることができず、再び犯罪を犯すことになるので、釈放の意味がなくなるのではないか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对于绝大多数人来说，就业和寻找住房是必不可少的。\n至少在美国，要想过上稍微舒适和守法的生活，就业和寻找住房是必不可少的事情。\n在美国。如果一个已经服完刑的重刑犯被释放，并且遵守了缓刑和其他释放条件，为什么？\n缓刑和任何其他释放条款，为什么......",
      "title": "鉴于他们很难找到工作或租房，从而注定他们会再次犯罪，释放重罪和给予他们犯罪记录不是违背了释放他们的全部意义吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對於絕大多數人來說，就業和尋找住房是必不可少的。\n至少在美國，要想過上稍微舒適和守法的生活，就業和尋找住房是必不可少的事情。\n在美國。如果一個已經服完刑的重刑犯被釋放，並且遵守了緩刑和其他釋放條件，爲什麼？\n緩刑和任何其他釋放條款，爲什麼......",
      "title": "鑑於他們很難找到工作或租房，從而註定他們會再次犯罪，釋放重罪和給予他們犯罪記錄不是違背了釋放他們的全部意義嗎？"
    }
  ]
}