{
  "author": "xenoputtss",
  "the_new_excerpt": "I have a vacuum chamber that I use for freeze drying. It works really well.\nAside from the foods, I have done some tricks for the kids where I put water in\na clear glass and put it in the chamber. I turn the machine on and it does what\none would expect, after a few minutes as the pressure drops the…",
  "original_created_utc": 1621251226,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はフリーズドライ用に真空チャンバーを使用しています。これは本当によくできています。\n食品以外では、子供たちのために、水を入れて乾燥させるという芸当もしました。\n庫内に入れておきます。機械の電源を入れると、期待通りの働きをします。\n数分後には圧力が下がって...",
      "title": "真空中の水、なぜ沸騰が止まるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我有一个真空室，我用于冷冻干燥。它的效果非常好。\n除了食物之外，我还为孩子们做了一些小把戏，我把水放在一个透明的玻璃杯里，然后把它放在桌子上。\n一个透明的玻璃杯，并把它放在室中。我把机器打开，它就像人们所期望的那样\n人们期望的那样，几分钟后，随着压力的下降，水就会流出来。",
      "title": "真空中的水，为什么会停止沸腾？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我有一個真空室，我用於冷凍乾燥。它的效果非常好。\n除了食物之外，我還爲孩子們做了一些小把戲，我把水放在一個透明的玻璃杯裏，然後把它放在桌子上。\n一個透明的玻璃杯，並把它放在室中。我把機器打開，它就像人們所期望的那樣\n人們期望的那樣，幾分鐘後，隨着壓力的下降，水就會流出來。",
      "title": "真空中的水，爲什麼會停止沸騰？"
    }
  ],
  "title": "Water in a vacuum, why does the boiling stop?",
  "created_utc": 1621311039,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have a vacuum chamber that I use for freeze drying.  It works really well.  Aside from the foods, I have done some  tricks for the kids where I put water in a clear glass and put it in the chamber.  I turn the machine on and it does what one would expect, after a few minutes as the pressure drops the water begins boiling.</p>\n\n<p>But  then what happens after a little bit the water stops boiling.  Pressure continues to drop. The water just sits there, motionless.</p>\n\n<p>If I release the vacuum stir it (maybe it super cooled?) And then try again, I get little to no boiling.  I tried it in plastic (less of a smooth surface so perhaps there was more condensation points) but still the same thing, no boiling.</p>\n\n<p>When I replace the water with fresh tap water, it will boil again but then do the above.</p>\n\n<p>What is going on?  I expected the water to boil until gone.</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/askscience/comments/nedt9v/water_in_a_vacuum_why_does_the_boiling_stop/",
  "subreddit": "askscience",
  "id": "nedt9v",
  "is_self": true,
  "media": null,
  "is_video": false
}