{
  "author": "TrueSpins",
  "the_new_excerpt": "I ran a poll a few weeks back and whilst clearly not totally scientific, it did\nshow what many had long suspected - most people on this sub have relatively tiny\nholdings, often less than 1k and a good chunk of people less than 5k.\n\nWhen you see people advising you to hold, have diamond hands etc -…",
  "original_created_utc": 1618721792,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は数週間前に世論調査を行い、完全に科学的ではないことは明らかですが、多くの人が以前から疑っていたことが示されました。\n多くの人が長い間疑っていたことが明らかになりました。つまり、このサブサイトのほとんどの人は、比較的小さな持ち株を持っているということです。\nそれは、このブログに参加しているほとんどの人が、比較的小さな持ち株を持っているということです。\n\nそれは、このサブサイトのほとんどの人が、比較的小さな持ち株を持っているということです。",
      "title": "ここでは、ほとんどの人が5,000ドル以下の少額のお金を賭けています。hodl」や「don't sell」と叫んでいる人がいたら、このことを考えてみてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在几周前做了一个调查，虽然显然不完全科学，但它确实做到了\n显示出许多人长期以来的怀疑--这个子上的大多数人都有相对微小的。\n持股，往往不到1千，还有相当一部分人不到5千。\n\n当你看到有人劝你持有，有钻石手等------。",
      "title": "这里大多数人的资金量都很小，往往不到5千。当你听到有人喊 \"hodl \"和 \"不要卖 \"时，要考虑到这一点。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在幾周前做了一個調查，雖然顯然不完全科學，但它確實做到了\n顯示出許多人長期以來的懷疑--這個子上的大多數人都有相對微小的。\n持股，往往不到1千，還有相當一部分人不到5千。\n\n當你看到有人勸你持有，有鑽石手等------。",
      "title": "這裏大多數人的資金量都很小，往往不到5千。當你聽到有人喊 \"hodl \"和 \"不要賣 \"時，要考慮到這一點。"
    }
  ],
  "title": "Most people here have very small amounts of money on the line, often less than $5k. Consider this when you hear people screaming \"hodl\" and \"don't sell\".",
  "created_utc": 1618738229,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I ran a poll a few weeks back and whilst clearly not totally scientific, it did show what many had long suspected - most people on this sub have relatively tiny holdings, often less than 1k and a good chunk of people less than 5k.</p>\n\n<p>When you see people advising you to hold, have diamond hands etc - it&#39;s quite possible that these people have a few hundred bucks on the line.</p>\n\n<p>I&#39;m not saying they&#39;re not right - just that they may well have nothing to lose.</p>\n\n<p>Link to original poll - <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/mktalq/whats_the_average_holdings_of_a_rcryptocurrency/\">https://www.reddit.com/r/CryptoCurrency/comments/mktalq/whats_the_average_holdings_of_a_rcryptocurrency/</a></p>\n</div><!-- SC_ON -->",
  "score": 692,
  "permalink": "/r/CryptoCurrency/comments/mt6g0a/most_people_here_have_very_small_amounts_of_money/",
  "subreddit": "CryptoCurrency",
  "id": "mt6g0a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171519558
}