{
  "author": "AskScienceModerator",
  "the_new_excerpt": "Hi Reddit! We just published a study on live two-way communication with lucid\ndreamers - watch VIDEO of the experiment here\n[https://youtu.be/7M06fJxiayo?t=501]. AUA!\n\nHi! My name is Karen Konkoly and I'm a third-year PhD student in Ken Paller's\ncognitive neuroscience lab at Northwestern University.…",
  "original_created_utc": 1614945615,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "Hi Reddit! 我们刚刚发表了一项关于与清醒的现场双向交流的研究。\n梦想家--在此观看实验视频\n[https://youtu.be/7M06fJxiayo?t=501]。友达！\n\n你好！我叫Karen Konkoly，是Ken Paller的三年级博士生。\n西北大学认知神经科学实验室....。",
      "title": "AskScience AMA系列。我们是西北大学的神经科学家，他们刚刚发表了一项关于与清醒梦者双向交流的研究（实验视频与论文说明）。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Hi Reddit! 我們剛剛發表了一項關於與清醒的現場雙向交流的研究。\n夢想家--在此觀看實驗視頻\n[https://youtu.be/7M06fJxiayo?t=501]。友達！\n\n你好！我叫Karen Konkoly，是Ken Paller的三年級博士生。\n西北大學認知神經科學實驗室....。",
      "title": "AskScience AMA系列。我們是西北大學的神經科學家，他們剛剛發表了一項關於與清醒夢者雙向交流的研究（實驗視頻與論文說明）。"
    }
  ],
  "title": "AskScience AMA Series: We're neuroscientists at Northwestern who just published a study on two-way communication with lucid dreamers (video of experiment & paper in description). AUA!",
  "created_utc": 1614950657,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi Reddit! We just published a study on live two-way communication with lucid dreamers - <a href=\"https://youtu.be/7M06fJxiayo?t=501\">watch VIDEO of the experiment here</a>. AUA!</p>\n\n<p>Hi! My name is Karen Konkoly and I&#39;m a third-year PhD student in Ken Paller&#39;s cognitive neuroscience lab at Northwestern University. My projects focus on lucid dreaming and how it can be used to learn more about sleep, dreams, and consciousness more broadly.  I&#39;ve been studying lucid dreaming for 7 years - since my sophomore year of college - when I attended an 8-day lucid dreaming retreat in Hawaii to garner ideas for my undergraduate senior thesis. (I subsequently concluded that the research was awesome.) The following summer, I worked at Brown University as a William E. Dement sleep research apprentice, and I gave a TEDx talk on lucid dreaming that fall. In my senior thesis, I taught participants to lucid dream in a month-long course, and I found that participants tended to feel less stressed and more vigorous the day after they had a lucid dream. After graduating from Lehigh, I interned at the Neuroscience and Psychology of Sleep lab at Cardiff University in Wales, assisting with an overnight project on presenting sounds during REM sleep. While in Wales, I also collaborated with researchers at nearby Swansea University to develop a new method of inducing lucid dreams. This method, dubbed Targeted Lucidity Reactivation, was able to induce lucid dreams in half of the participants in a single nap session. Now at Northwestern, I&#39;m testing new methods and applications for communicating with dreamers.</p>\n\n<p>Hi there, Reddit! I&#39;m Ken Paller, a Professor at Northwestern University, where I hold the James Padilla Chair in Arts &amp; Sciences and serve as director of the training program in the neuroscience of human cognition. I&#39;m a Fellow of the Association for Psychological Science, a Senior Fellow of the Mind and Life Institute, and was awarded the Senator Mark Hatfield Award from the Alzheimer&#39;s Association. My research has focused on human memory and consciousness - using a variety of methods including electrophysiology, neuropsychology, and neuroimaging - and my findings have contributed to understanding features of conscious memory experiences as well as ways in which memory operations differ in the absence of awareness of memory retrieval, as in implicit-memory priming, intuition, and implicit social bias. I&#39;ve published nearly 200 scientific articles, reviews, and book chapters, some of which you can find on <a href=\"https://pallerlab.psych.northwestern.edu/\">my lab website</a>. Some of my research has concerned patients with memory disorders, including evidence linking memory deficits to poor sleep. Recent studies from my lab showed that memory processing during sleep can reinforce prior learning, providing novel evidence on sleep&#39;s role in memory.</p>\n\n<p>Our <a href=\"https://www.cell.com/current-biology/fulltext/S0960-9822(21\">most recent paper</a>00059-2) described innovative research on two-way communication during REM sleep. We demonstrated the feasibility of real-time dialogue between an experimenter and someone in the midst of a lucid dream. Experimenters asked questions for which the correct answer was known so that we could determine whether effective communication was achieved. When dreamers responded, their answers were given via eye movements or facial muscle twitches - and they were usually correct. The first successful two-way communication during sleep was achieved in the lab in the early morning of January 9th, 2019. Karen gave Christopher Mazurek, a research participant and now a member of the lab group, the math problem 8 minus 6, which Christopher answered correctly. (At the time, we were unaware of similar studies in Germany by Kris Appel and in France by Delphine Oudiette and colleagues. Later, we decided to publish our results together.) Further applications of this method, which NOVA PBS captured for the first time on film in a <a href=\"https://www.youtube.com/watch?v=7M06fJxiayo\">digital documentary on YouTube</a> and <a href=\"https://www.pbs.org/wgbh/nova/article/lucid-dreaming-communication/\">wrote about in an article</a>, can now probe conscious dream experiences as they happen, and who knows what else!</p>\n\n<p>We&#39;re looking forward to today - we&#39;ll be on at 4:00 p.m. EST (21 UT), AUA!</p>\n\n<p>Username: <a href=\"/u/novapbs\">/u/novapbs</a></p>\n</div><!-- SC_ON -->",
  "score": 158,
  "permalink": "/r/askscience/comments/lyab9d/askscience_ama_series_were_neuroscientists_at/",
  "subreddit": "askscience",
  "id": "lyab9d",
  "is_self": true,
  "media": null,
  "is_video": false
}