{
  "author": "naviejsason",
  "the_new_excerpt": "I’ve been trying to enter the housing market - and it’s insane! 15 years of work\nand you can barely afford a home.\n\nWhen boomers started investing in the RE market, it was a few years of work to\nget a house. They then bought a second investment property and rentals and the\nwealth ladder got easier…",
  "original_created_utc": 1618332756,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "住宅市場に参入してみました - 正気の沙汰とは思えない！？15年も働いて\n家を買うのがやっとなんです。\n\nブーマーが住宅市場に投資し始めた頃は、家を手に入れるためには数年の仕事が必要でした。\n家を手に入れることができました。その後、2つ目の投資物件や賃貸物件を購入して、富の階段を上りました。\n富の梯子はより簡単になりました...。",
      "title": "団塊世代は不動産、ミレニアル世代はBTC"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直在尝试进入房市--这很疯狂! 15年的工作\n而你几乎买不起房。\n\n当潮人开始投资RE市场的时候，经过几年的努力，要想\n得到一套房子。随后，他们又买了第二套投资性房产和出租，并在。\n财富阶梯更容易...",
      "title": "潮人有房地产，千禧一代有BTC。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直在嘗試進入房市--這很瘋狂! 15年的工作\n而你幾乎買不起房。\n\n當潮人開始投資RE市場的時候，經過幾年的努力，要想\n得到一套房子。隨後，他們又買了第二套投資性房產和出租，並在。\n財富階梯更容易...",
      "title": "潮人有房地產，千禧一代有BTC。"
    }
  ],
  "title": "Boomers have Real Estate, millennials have BTC",
  "created_utc": 1618346167,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve been trying to enter the housing market - and it’s insane! 15 years of work and you can barely afford a home.</p>\n\n<p>When boomers started investing in the RE market, it was a few years of work to get a house. They then bought a second investment property and rentals and the wealth ladder got easier to climb. Then came the restrictions- zoning restrictions based on height, neighborhood, nature reserves (which are pretty awesome), and foreign investments. They created a system that works for them, and is paid for by the new generation.</p>\n\n<p>When we buy homes, they may increase in value, but they won’t see the meteoric rise that the last 40 to 50 years that most boomers received.</p>\n\n<p>The game is changing. BTC is currently a couple of years worth of salary. And it will increase, with time. Just like the opportunity boomers had- we have a chance now to carve out our future.</p>\n\n<p>BTC is the perfect asset- it’s understood by most millennials and not so much by boomers. It is the type of asset our generation is made for: easily transferable, independent on external system, and progressive.</p>\n\n<p>Thoughts?</p>\n</div><!-- SC_ON -->",
  "score": 1432,
  "permalink": "/r/CryptoCurrency/comments/mq6co2/boomers_have_real_estate_millennials_have_btc/",
  "subreddit": "CryptoCurrency",
  "id": "mq6co2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566615668
}