{
  "author": "exportablue88",
  "original_created_utc": 1635899402,
  "title": "I just want you all to know, I do not, nor will I ever understand how NFTs hold value. With that said, stayed tuned for my new line of Cat Buttholes in Space, limited edition NFT",
  "created_utc": 1635917437,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve tried and tired again, but don’t think I will ever understand how NFTs can hold such wild values, what people do with them, and or anything else about them.  Some NFTs look like an icon made by a fifth grader.  It just can not grasp this concept.  But what I do know is Cat Buttholes in Space, and I think it’s time to merge the two ideas. Launching within the next month, Cat Butthole Productions will bring you the first collection in a line of many.  Our first collection will be Psychedelic Cat Buttholes in Space.  We estimate the value of each piece around 10 ETH, don’t miss out.</p>\n</div><!-- SC_ON -->",
  "score": 178,
  "permalink": "/r/CryptoCurrency/comments/qlig1m/i_just_want_you_all_to_know_i_do_not_nor_will_i/",
  "subreddit": "CryptoCurrency",
  "id": "qlig1m",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’ve tried and tired again, but don’t think I will ever understand how NFTs can\nhold such wild values, what people do with them, and or anything else about\nthem. Some NFTs look like an icon made by a fifth grader. It just can not grasp\nthis concept. But what I do know is Cat Buttholes in Space, and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は何度も挑戦しましたが、NFTがどのようにしてこのような野生の価値を持つことができるのか\nこんなにワイルドな価値観を持っているのか、人々は何をしているのか、そして何よりも\n私には理解できません。NFTの中には、小学5年生が作ったアイコンのようなものもあります。この概念を理解することができませんでした。\n把握できません。しかし、私が知っているのは、「宇宙の猫の穴」と「...」です。",
      "title": "皆さんに知っておいていただきたいのですが、私はNFTの価値を理解していませんし、これからも理解することはないでしょう。とはいえ、私の新しいラインであるCat Buttholes in Spaceの限定版NFTには期待していてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我已经试过了，而且又累了，但我认为我永远不会理解NFTs如何能够\n拥有如此疯狂的价值，人们用它们做什么，或者关于它们的其他事情。\n他们的其他事情。有些NFTs看起来像五年级学生做的图标。它只是不能掌握\n这个概念。但我所知道的是《太空中的猫咪屁眼》，以及...",
      "title": "我只是想让大家知道，我没有，也不会理解NFT是如何保持价值的。说到这里，请继续关注我的新系列 \"太空猫屁股\"，限量版NFT"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我已經試過了，而且又累了，但我認爲我永遠不會理解NFTs如何能夠\n擁有如此瘋狂的價值，人們用它們做什麼，或者關於它們的其他事情。\n他們的其他事情。有些NFTs看起來像五年級學生做的圖標。它只是不能掌握\n這個概念。但我所知道的是《太空中的貓咪屁眼》，以及...",
      "title": "我只是想讓大家知道，我沒有，也不會理解NFT是如何保持價值的。說到這裏，請繼續關注我的新系列 \"太空貓屁股\"，限量版NFT"
    }
  ]
}