{
  "author": "Robincapitalists",
  "the_new_excerpt": "So.\n\nUnlike a lot of naysayers who think taxes, inflation, or certain political\nparties will derail this train, I don't agree.\n\n * Personal Saving Rate | U.S. Bureau of Economic Analysis (BEA)\n   [https://www.bea.gov/data/income-saving/personal-saving-rate] , savings rate\n   has averaged 18.75%.…",
  "original_created_utc": 1620344980,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "だからね。\n\n税金やインフレ、特定の政党がこの列車を脱線させると考えている多くの否定的な人たちとは違います。\nこの列車を脱線させると考える多くの論者とは異なり、私はそうは思いません。\n\n * 個人貯蓄率｜米国経済分析局(BEA)\n   [https://www.bea.gov/data/income-saving/personal-saving-rate] 、貯蓄率\n   は平均18.75%でした....",
      "title": "轟音の2020年代（経済・株式"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以。\n\n与很多认为税收、通货膨胀或某些政党会使这列火车脱轨的反对者不同，我不同意。\n我并不同意。\n\n *个人储蓄率 | 美国经济分析局（BEA\n   [https://www.bea.gov/data/income-saving/personal-saving-rate] ，储蓄率\n   平均为18.75%....",
      "title": "咆哮的2020年代（经济/股票"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以。\n\n與很多認爲稅收、通貨膨脹或某些政黨會使這列火車脫軌的反對者不同，我不同意。\n我並不同意。\n\n *個人儲蓄率 | 美國經濟分析局（BEA\n   [https://www.bea.gov/data/income-saving/personal-saving-rate] ，儲蓄率\n   平均爲18.75%....",
      "title": "咆哮的2020年代（經濟/股票"
    }
  ],
  "title": "The Roaring 2020s (Economy/Stocks)",
  "created_utc": 1620356749,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So.</p>\n\n<p>Unlike a lot of naysayers who think taxes, inflation, or certain political parties will derail this train, I don&#39;t agree.</p>\n\n<ul>\n<li><a href=\"https://www.bea.gov/data/income-saving/personal-saving-rate\">Personal Saving Rate | U.S. Bureau of Economic Analysis (BEA)</a> , savings rate has averaged 18.75%. FYI, the highest the savings rate in the last 20 years for a 12 month period has been 7-8%.</li>\n<li><a href=\"https://fred.stlouisfed.org/series/REVOLSL\">Total Revolving Credit Owned and Securitized, Outstanding (REVOLSL) | FRED | St. Louis Fed (stlouisfed.org)</a>, people used funds to pay down their credit debt. Allowing them to take on consumer purchases into the future.</li>\n<li>$1.9 trillion COVID stimulus. Which contained much more than just $1,400 checks. It contained policies that will free people to join the workforce who otherwise would not, to start businesses, to direct capital towards areas long beaten down.</li>\n<li>~4 trillion infrastructure, part 1 and part 2. Investment in R&amp;D, Nationwide BroadBand, EV charging, Electrical Grid, Education, Renewable Energy, Childcare, Eldercare. These investments will allow for a huge increase in the number of people who can participate in the workforce.</li>\n<li>Booming Jobs growth. Expect to see sustained jobs growth over 1 million jobs a month in 2021, expect to see a long term jobs growth story of 300,000-400,000 every month for years and years.</li>\n<li><a href=\"https://www.atlantafed.org/chcs/wage-growth-tracker\">Wage Growth Tracker - Federal Reserve Bank of Atlanta (atlantafed.org)</a> above inflation wage growth.</li>\n<li><a href=\"https://www.bea.gov/data/personal-consumption-expenditures-price-index\">Personal Consumption Expenditures Price Index | U.S. Bureau of Economic Analysis (BEA)</a> It is true that there is some increasing inflation showing up, even in personal consumption, but mainly due to isolated commodity supply chains. It hasn&#39;t shown up in food, despite what anyone thinks. Not in rents (increase 1.7% YoY, negative in many places). (40% of Americans rent), it hasn&#39;t shown up in the electric bill, in electronics, in cars, the one pain point has been gas prices. Which, continue to be offset by improving efficiencies, and in context, gas prices are lower than 2010. As far as buying a house, people paying up to buy homes are making discretionary choices that they can afford to make. People in existing homes (the by far vast majority of the 60% of households who own a home) are not experiencing much inflation, they have mortgages.</li>\n<li>So no. The Fed won&#39;t be raising rates. Commodity inflation will work it&#39;s way thru the system. Ala 2010. Oil prices dropped to $20, then bounced back to $110+. And many other commodities that were low in the financial crisis, only to rise very quick in the recovery.</li>\n<li>Stocks. So, the economy and the stock market aren&#39;t directly connected anymore in the US. See the financial crisis recovery. Stocks boomed, the economy chugged along gradually. See 2020. It was a hard real economy for 10s of millions. The stock market did not care. So, will a roaring economy mean a roaring stock market? I think, in the context of creating new retail investors during COVID, and now post COVID, who will be joining the workforce with substantial growth, an exaggerated inflation prediction that never comes to fruition in the long run, meaning low rates, and trillions more in spending, it&#39;s going to be a very good stock market.</li>\n<li>Taxes. Oh get over yourselves. High taxes have never meant the economy can&#39;t grow or the stock market can&#39;t grow. People (even the wealthy) adjust to tax changes and then keep doing what they were doing. The impact is short lived, both on tax cuts and tax increases. &quot;Tax increases&quot; happened in the 90s and the 2010s. That did not stop the stock market, or the economy.</li>\n<li>And it&#39;s laughable to call them high. The United States has one of the lowest tax to GDP ratios of any advanced country. Yet trails in aggregate measures of education, healthcare, infrastructure, quality of life, environment. There&#39;s such a thing as lowering taxes for wealthy capital gains non labor earners too much. The US past that point in the 80s.</li>\n</ul>\n\n<p>Conclusion. Get in losers, were doing the roaring 2020s. And they are mad that the poors have a better chance of capturing income in this decade.</p>\n</div><!-- SC_ON -->",
  "score": 172,
  "permalink": "/r/investing/comments/n6l995/the_roaring_2020s_economystocks/",
  "subreddit": "investing",
  "id": "n6l995",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985994594
}