{
  "author": "PoorVetKid",
  "the_new_excerpt": "TL:DR ON THE BOTTOM\n\nHey everybody, this is my first time making a post like this. I'm a fairly new\ninvestor - I've been having a financial advisor do most of my investing and have\nbeen wanting to take a more active role in my investment - starting with my DD\non Chewy so here goes. If it's not…",
  "original_created_utc": 1612725490,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "TL:DR在底部\n\n大家好，这是我第一次发这样的帖子。我是一个相当新的\n投资者--我的大部分投资都是由理财顾问来做的，并且有\n一直想在我的投资中扮演更积极的角色--从我的DD开始。\n在Chewy上，所以在这里开始。如果不是...",
      "title": "Chewy DD--兽医的见解。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "TL:DR在底部\n\n大家好，這是我第一次發這樣的帖子。我是一個相當新的\n投資者--我的大部分投資都是由理財顧問來做的，並且有\n一直想在我的投資中扮演更積極的角色--從我的DD開始。\n在Chewy上，所以在這裏開始。如果不是...",
      "title": "Chewy DD--獸醫的見解。"
    }
  ],
  "title": "Chewy DD - insight from a vet.",
  "created_utc": 1612735056,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>TL:DR ON THE BOTTOM</p>\n\n<p>Hey everybody, this is my first time making a post like this. I&#39;m a fairly new investor - I&#39;ve been having a financial advisor do most of my investing and have been wanting to take a more active role in my investment - starting with my DD on Chewy so here goes. If it&#39;s not obvious enough, I&#39;m not a financial advisors and take my post as the ramblings of a person with limited knowledge trying his best, so here goes. </p>\n\n<p><strong>Overview</strong></p>\n\n<p>Chewy was an online retailer started in Florida. In 2017 chewy was acquired by PetSmart for 3.3 billion, and the ipo was offered in 2019. \nSales grew every year and by 2018 sales had reached 3.5 billion w/ 66% of sales being from automatic recurring shipments. Chewy reported its first loss in April 2019 selling of 270 million from its previous sales. \n**When Chewy first went public in June 2019 it&#39;s IPO offering was 22 per share. </p>\n\n<p>As of 2019 the company was valued at 10.2 billion.** </p>\n\n<p><strong>My insight:</strong></p>\n\n<p>Chewy has a few different areas of products to focus on that can be separated into 2 groups: basic consumer products (furniture, toys, food, etc), prescription products (medications, rx diets), and non-prescription medical products (examples - think things like supplements, medical grade shampoos, etc etc)\nI&#39;ve separated it into 3 groups for a reason and I&#39;ll get to that soon. </p>\n\n<p>I&#39;ve been a vet for the past few years, and working in the vet industry since 2012 as a vet tech until I graduated vet school in 2019. \nIn the last two years, I&#39;ve worked at several vet clinics from super low income to super high income and in between. I write prescriptions every. freakin. day. It&#39;s half of my job. And historically, most vet clinics would have an in house pharmacy holding most of the needed medications and OTC medical products (shampoos, supplements, etc) and people would buy them from us. </p>\n\n<p>Somewhere between 2015-2019 people started asking more and more for prescriptions after realizing that they could get some of their medications at regular human pharmacies. This was a big hit to vet hospitals, but we rolled with it because we still had the pet specific prescriptions that human pharmacies didn&#39;t carry, and the OTC products. </p>\n\n<p>Then in 2019 - I started seeing a massive shift where we weren&#39;t able to sell OTC products anymore. It seemed like over the course of a year, it got significantly harder to sell things like medical grade shampoos, fish oil supplements, joint supplements - all things that didnt need a prescription, but previously you could only get at the vet. Chewy came in and undercut our profits by a massive amount. I&#39;m super involved with the finances at my current clinic and saw that for us to match chewy&#39;s prices we would either have to sell for a minuscule gain or no gain at all - to the point where it ended up costing us money if you considered the man hours it took to manage inventory and the opportunity cost of losing shelf space to these products. </p>\n\n<p>Now in 2020 is where shit really started getting weird. All of a sudden, NOBODY was buying food from us either. SO MANY PEOPLE were already getting food from Chewy that once they needed a prescription food, there was no way in hell they were gonna drive down to the vet once a month to buy a bag. They would ask for a prescription and put it on autoship on Chewy. </p>\n\n<p>So now chewy has OTC foods, supplements and products that used to be found only at the vet, and prescription foods. </p>\n\n<p><strong>BUT WAIT - THERES MORE.</strong> </p>\n\n<p>In 2020, I have literally AT LEAST 50% of my clients ask &quot;is this medication on chewy? is it cheaper?&quot; and my answer is always a resounding &quot;hell yeah it is&quot; (idgaf if my hospital doesnt sell the product as long as the pet gets its medications - doesn&#39;t change my life one bit. I literally dont make any more or less money with where you get your meds). </p>\n\n<p><strong>Let me give you an example, something I deal with EVERY. FREAKIN. DAY.</strong> </p>\n\n<p>I have a dog come in w/ a real bad skin infection. I suspect its cause of environmental allergies, but we gotta treat the skin infection first. I want to prescribe marbofloxacin which is an amazing, albeit expensive antibiotic. These numbers listed below are real numbers based on my hospital in Phoenix, AZ. </p>\n\n<ul>\n<li>Exam fee = $59</li>\n<li>cone to keep from chewing = $12</li>\n</ul>\n\n<p>I prescribe marbofloxacin for the infection and apoquel for the allergies. I also prescribe a prescription strength shampoo to help clear the infection and then a sulfate free shampoo for maintenance after the infection is cleared. Lastly I recommend an omega-3 supplement for long term skin care. The client says fuck you I&#39;m gonna get this on chewy. Listed below are prices all taken from chewy. </p>\n\n<ul>\n<li>Marbofloxacin 50mg tablets - 1 tab every 24 hours for 14 days (30 lb dog dose) = $52</li>\n<li>Douxo chlorhexidine shampoo to help clear the infection = $30 </li>\n<li>Douxo calm shampoo for long term help of allergies = $34.50 </li>\n<li>Apoquel 16mg tablets - 1/2 tab every 24 hours - 60 day supply = $73 dollars. </li>\n<li>Welactin Omega 3 Supplement = $25 dollars</li>\n</ul>\n\n<p>So do the math - <strong>I spend an hour talking to this client for their dog and I make a measly $71.</strong> \nFor my 1 hour of work - <strong>chewy makes $214.50</strong> - AND THEY DIDNT DO SHIT. And $130 of those chewy purchases will be long term and for life (the shampoo, apoquel, and fish oil supplement). </p>\n\n<p>This is not a random scenario. This is something I deal with EVERY. DAY. I can give several more, literally. </p>\n\n<p>Chewy is destroying vet hospital margins - and as a vet I think the reckoning has been a long time coming. Some vet hospitals will go out of  business, and some will adapt with the times. I personally think playing both sides is the best route and it&#39;s what I plan to do. </p>\n\n<p><strong>COMPETITORS:</strong></p>\n\n<ol>\n<li><p>Vet hospitals - I think that more forward thinking vet hospitals will adapt with the times. More and more vet hospitals are partnering with companies like VetsFirstChoice - online pharmacies that are connected with the hospital. These pharmacies allow me to put in the order for the patient&#39;s prescription products, the prices are significantly closer to Chewy&#39;s price, and it&#39;s way less effort on the client. The client now doesnt have to go on chewy.com -&gt; order the medication -&gt; wait for me to approve it -&gt; wait for it to ship. Instead, I tell them we have this product in our online pharmacy and the price is the same as chewy. I order it for them and put in the directions, it automatically puts in their shipping info, and all the client has to do is check their email and pay. I think this will be a massive competitor due to convenience to the clients. Clients HATE having to wait for me to approve their medication requests from chewy (a process which will take at least 24 hours and clients are super entitled and throw a fit if they have to wait a day for anything). </p></li>\n<li><p>Walmart and Costco - Historically, these have been the largest competitors for pet medications. Over the last year, they have significantly beefed up the pet medications that they offer and their prices are ultra competitive with chewy. The benefits to these locations is clients can drive to a brick and mortar store and get their medications the same day. The biggest issue right now is low variety, they don&#39;t carry all of the pets needs (so clients will forsake the same day convenience in an effort to get everything from the same place), and currently I&#39;ve been having a lot of issues with their customer service. The pharmacy techs will not know that those medications are not carried by walmart, and will tell the clients &quot;we dont have it&quot; when I know they do and clients get super pissed off by that obviously. </p></li>\n<li><p>Other pet medication suppliers - Things like heartlandvetsupply and 1-800-PetMeds. These have been around for YEARS and have never been able to make a dent, and now with otehr competition I don&#39;t think they will either. These are only found by very price savvy clients who don&#39;t mind extra effort to get meds and oftent it&#39;s not even much cheaper. </p></li>\n</ol>\n\n<p><strong>Price prediction:</strong>\nI cant give you a price prediction - I&#39;m not experience enough to know what the price SHOULD be. But my point is that I think Chewy is still going to grow and I think it&#39;s a definite buy. </p>\n\n<p><strong>TL:DR - Chewy is here to stay, and I think it&#39;s a definite long term buy</strong></p>\n</div><!-- SC_ON -->",
  "score": 228,
  "permalink": "/r/stocks/comments/let9wd/chewy_dd_insight_from_a_vet/",
  "subreddit": "stocks",
  "id": "let9wd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123203611
}