{
  "author": "knowledgelover94",
  "the_new_excerpt": "I’m in my mid twenties talking to guys I meet about their crypto investments,\nand damn I hate to think so many people my age are in it for the wrong reasons.\nI’m hyped about crypto because it solves problems. Bitcoin stores value,\nEthereum does smart contracts, Monero is private, Stellar exchanges…",
  "original_created_utc": 1618988285,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は20代半ばで、会う人会う人に暗号化投資の話をしています。\n同年代の多くの人が間違った理由で投資をしていると思うと、とても嫌な気持ちになります。\n私が暗号に夢中になっているのは、暗号が問題を解決するからです。Bitcoinは価値を保存します。\nイーサリアムはスマートコントラクト、モネロはプライベート、ステラは交換...。",
      "title": "友人がクソコインに熱中してRobinhoodを使っているのを見るのは不愉快だ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在20多岁的时候就和我遇到的人谈论他们的加密货币投资。\n该死的是，我不愿意看到这么多同龄人因为错误的原因而参与其中。\n我热衷加密货币是因为它能解决问题。比特币储存价值。\n以太坊做智能合约，Monero是私有的，Stellar交易所...",
      "title": "看到我的朋友们热衷于狗屎币并使用Robinhood，这很让人讨厌。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在20多歲的時候就和我遇到的人談論他們的加密貨幣投資。\n該死的是，我不願意看到這麼多同齡人因爲錯誤的原因而參與其中。\n我熱衷加密貨幣是因爲它能解決問題。比特幣儲存價值。\n以太坊做智能合約，Monero是私有的，Stellar交易所...",
      "title": "看到我的朋友們熱衷於狗屎幣並使用Robinhood，這很讓人討厭。"
    }
  ],
  "title": "It’s cringy to see my friends hyped about shitcoins and use Robinhood",
  "created_utc": 1619008818,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m in my mid twenties talking to guys I meet about their crypto investments, and damn I hate to think so many people my age are in it for the wrong reasons. I’m hyped about crypto because it solves problems. Bitcoin stores value, Ethereum does smart contracts, Monero is private, Stellar exchanges fiat efficiently. What are my millennial friends into? Doge coin, safe moon, and GameStop, and they’re buying it all on Robinhood. There’s no convincing people to delete Robinhood. </p>\n\n<p>Do people think we can just pump shit for no reason infinitely? We should be using that money to solve problems. You make profit from putting money towards something that grows and fills desires. We can pump random shit for now, but there’s no telling how short the joke will last. </p>\n\n<p>It’s so cringe worthy cause all they have to do is buy top coins that aren’t pump and dump bs. I guess some people are always gonna be attracted to the get rich quick schemes. I think the doge coin hype is not good for the legitimacy of crypto in general. When the joke ends and my friends lose money, I hope they aren’t too weary of crypto. Cheers to homies in it for the right reasons!</p>\n</div><!-- SC_ON -->",
  "score": 701,
  "permalink": "/r/CryptoCurrency/comments/mva4sf/its_cringy_to_see_my_friends_hyped_about/",
  "subreddit": "CryptoCurrency",
  "id": "mva4sf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171523334
}