{
  "author": "cyclicalwand",
  "original_created_utc": 1638486240,
  "title": "If you died suddenly what would happen to your crypto?",
  "created_utc": 1638502620,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I know for sure that mine would be joining the great satoshi in the sky. My wife and children have no idea about crypto apart from the fact that Bitcoin is mentioned on some shows they watch. &lt;/p&gt;\n\n&lt;p&gt;Mine is tied up in CEX, DEX, DEFI, Staking, multiple wallets, OHM’s and everything else. How do I do possibly leave instructions on how to retrieve this? I’m not even sure how to leave them my mnemonic phase without my lawyer draining a first, let alone how to cash it out. &lt;/p&gt;\n\n&lt;p&gt;What is your plan if the worst happens?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 207,
  "permalink": "/r/CryptoCurrency/comments/r7ju7e/if_you_died_suddenly_what_would_happen_to_your/",
  "subreddit": "CryptoCurrency",
  "id": "r7ju7e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I know for sure that mine would be joining the great satoshi in the sky. My wife\nand children have no idea about crypto apart from the fact that Bitcoin is\nmentioned on some shows they watch.\n\nMine is tied up in CEX, DEX, DEFI, Staking, multiple wallets, OHM’s and\neverything else. How do I do…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私のは、きっと空の上の偉大なサトシの仲間入りをしていることでしょう。私の妻は\nと子供たちは、ビットコインがあるという事実以外、暗号について全く知りません。\n番組で紹介されたこともあります。\n\n私のは、CEX、DEX、DEFI、ステーキング、複数のウォレット、OHM、その他に縛られています。\nその他もろもろ。どうしたらいいんだろう・・・。",
      "title": "もしあなたが急死したら、あなたの暗号はどうなりますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道，我的将会加入天空中的伟大的聪慧。我的妻子\n和孩子们对加密货币一无所知，只是在他们看的一些节目中提到了比特币的事实。\n在他们看的一些节目中提到。\n\n我的钱被捆绑在CEX、DEX、DEFI、赌注、多个钱包、OHM和其他一切方面。\n其他一切。我如何做...",
      "title": "如果你突然死亡，你的加密货币会发生什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道，我的將會加入天空中的偉大的聰慧。我的妻子\n和孩子們對加密貨幣一無所知，只是在他們看的一些節目中提到了比特幣的事實。\n在他們看的一些節目中提到。\n\n我的錢被捆綁在CEX、DEX、DEFI、賭注、多個錢包、OHM和其他一切方面。\n其他一切。我如何做...",
      "title": "如果你突然死亡，你的加密貨幣會發生什麼？"
    }
  ]
}