{
  "author": "cdmayer",
  "original_created_utc": 1630292181,
  "title": "Unpopular Opinion: Algorand's decentralization is no better than Binance Smart Chain's",
  "created_utc": 1630308691,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Among the darlings of this sub is up-and-coming chain Algorand. The founder claims to have &quot;solved&quot; the Blockchain Trilemma using their revolutionary consensus algorithm. From their marketing page:</p>\n\n<blockquote>\n<p>Algorand uses cryptographic sortition to select users to propose blocks for a given round. When a block is proposed to the blockchain, a committee of voters is selected to vote on the block proposal. If a super majority of the votes are from honest participants, the block can be certified.</p>\n</blockquote>\n\n<p>What they fail to mention is the backroom selection of the validator nodes that actually run the network. Let&#39;s suppose the user proposing the block is truly random. How do they propose a block? Specifically, how does the user that owns the selected Algo token have any influence over how the block is proposed? So far as I can tell, the user has no real agency; in contrast, other delegating PoS chains like Tezos or Cardano let the user directly delegate their block proposal responsibility to a baker or stake pool, respectively. By choosing the baker/pool to whom I delegate, I do my part in ensuring the decentralization of the network. In turn, bakers/pools are incentivized to act in the best interest if the network in order to attract and retain delegators.</p>\n\n<p>The responsibility to select validators is a critical element in decentralization. The fact is, as an Algo holder I have no influence over the network. Instead, the network is run by a secret list of validators, owned and operated by &quot;early backers.&quot; What guarantees do we have that those validators hold (and will continue to hold) the health of the network as highest priority? For all we know, Algorand could be a long con with a charismatic (and qualifed) figurehead.</p>\n\n<p>This critical flaw calls into serious question the long term value of the Algorand project. I choose not to use BSC for the same reason (centralization). At least BSC doesn&#39;t lie about being decentralized - their solution to the Trilemma is to sacrifice all decentralization in favor of speed (and presumably security). Algorand claims to be decentralized, but so far as I can tell it&#39;s all smoke and mirrors.</p>\n\n<p>This sub has a lot of Algo supporters. To you I say: change my mind.</p>\n\n<p>Disclaimer: I hold some Algo, but I&#39;m much more interested and invested in decentralized chains: Ethereum, Tezos, and Cardano (and learning about more as my time permits).</p>\n</div><!-- SC_ON -->",
  "score": 158,
  "permalink": "/r/CryptoCurrency/comments/pe9kvx/unpopular_opinion_algorands_decentralization_is/",
  "subreddit": "CryptoCurrency",
  "id": "pe9kvx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Among the darlings of this sub is up-and-coming chain Algorand. The founder\nclaims to have \"solved\" the Blockchain Trilemma using their revolutionary\nconsensus algorithm. From their marketing page:\n\n> Algorand uses cryptographic sortition to select users to propose blocks for a\n> given round. When a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "その中でも、新進気鋭のチェーン店「アルゴランド」が注目を集めています。創設者は\n革命的なコンセンサスを用いて、ブロックチェーンのトリレンマを「解決」したと主張しています。\n革命的なコンセンサスアルゴリズムを用いて、ブロックチェーンのトリレンマを「解決」したと主張しています。彼らのマーケティングページより。\n\n> アルゴランドは、あるラウンドでブロックを提案するユーザーを選ぶために、暗号化されたソートを使用しています。\n> 与えられたラウンドでブロックを提案するユーザーを選択します。ユーザーが...",
      "title": "アンポピュラー・オピニオン アルゴランドの非中央集権化はBinance Smart Chainのそれと変わらない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在这个子的宠儿中，有一个新兴的连锁店Algorand。其创始人\n创始人声称已经用他们革命性的共识算法 \"解决 \"了区块链的三难问题。\n共识算法。来自他们的营销页面。\n\n> Algorand使用密码学排序来选择用户为某一轮提出区块。\n> 给定回合。当一...",
      "title": "不受欢迎的意见。Algorand的去中心化并不比Binance智能链的好"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在這個子的寵兒中，有一個新興的連鎖店Algorand。其創始人\n創始人聲稱已經用他們革命性的共識算法 \"解決 \"了區塊鏈的三難問題。\n共識算法。來自他們的營銷頁面。\n\n> Algorand使用密碼學排序來選擇用戶爲某一輪提出區塊。\n> 給定回合。當一...",
      "title": "不受歡迎的意見。Algorand的去中心化並不比Binance智能鏈的好"
    }
  ]
}