{
  "author": "Tularemia",
  "the_new_excerpt": "Am I invited to secret meetings about this weeks in advance? Am I simply\nfollowing orders on the day? Do any of my co-workers protest this coup d'état?\n\nExpanding the question further, how does it work later in the empire during the\nCrisis of the Third Century? How much notice do I as a Praetorian…",
  "original_created_utc": 1617726111,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は何週間も前からこの件に関する秘密の会議に招待されているのでしょうか？私は単に\nその日の命令に従うだけなのか？私の同僚の中で、このクーデターに抗議する人はいますか？\n\nこの質問をさらに拡大すると、後の帝国の時代にはどのようになるのでしょうか。\n3世紀の危機においてはどうでしょうか？近衛兵である私は、どのくらいの通知を受ければいいのだろうか？",
      "title": "私は41年のランダムなプラエタリアンガードです。皇帝カリグラを暗殺してクラウディウスに交代させようとしていることは、どのくらい知らされていますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是否被邀请提前几个星期参加有关这方面的秘密会议？我是否只是\n当天听命于人？有同事抗议这次政变吗？\n\n把问题进一步扩大，以后在帝国的期间，它是如何运作的？\n第三世纪的危机？我作为一个禁卫军要注意多少... ...",
      "title": "我是公元41年的一个随机的禁卫军。我有多少通知，我们即将刺杀卡里古拉皇帝 并由克劳狄斯取代他？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是否被邀請提前幾個星期參加有關這方面的祕密會議？我是否只是\n當天聽命於人？有同事抗議這次政變嗎？\n\n把問題進一步擴大，以後在帝國的期間，它是如何運作的？\n第三世紀的危機？我作爲一個禁衛軍要注意多少... ...",
      "title": "我是公元41年的一個隨機的禁衛軍。我有多少通知，我們即將刺殺卡里古拉皇帝 並由克勞狄斯取代他？"
    }
  ],
  "title": "I am a random Praetorian Guard in 41 CE. How much notice do I have that we are about to assassinate Emperor Caligula and replace him with Claudius?",
  "created_utc": 1617733313,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Am I invited to secret meetings about this weeks in advance? Am I simply following orders on the day? Do any of my co-workers protest this coup d&#39;état? </p>\n\n<p>Expanding the question further, how does it work later in the empire during the Crisis of the Third Century? How much notice do I as a Praetorian Guard generally have that we’re about to assassinate our boss?</p>\n</div><!-- SC_ON -->",
  "score": 177,
  "permalink": "/r/AskHistorians/comments/mlfg86/i_am_a_random_praetorian_guard_in_41_ce_how_much/",
  "subreddit": "AskHistorians",
  "id": "mlfg86",
  "is_self": true,
  "media": null,
  "is_video": false
}