{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "Good Friday evening to all of you here on r/stocks! I hope everyone on this sub made out pretty nicely in the market this past week, and are ready for the new trading week ahead. :)\n\nHere is everything you need to know to get you ready for the trading week beginning August 1st, 2022.\n\n# **Stocks head into August with a tailwind, as investors await jobs data and a slew of earnings - [(Source)](https://www.cnbc.com/2022/07/29/stocks-head-into-august-with-a-tailwind-as-investors-await-jobs-data-and-a-slew-of-earnings.html)**\n*****\n&gt; From Caterpillar to Amgen, dozens of large companies report earnings in the coming week, but it may be big economic data, such as Friday’s jobs report, that takes over as a major market catalyst.\n*****\n&gt; Monthly employment reports are always important, but the next few may be even more so. Federal Reserve Chair Jerome Powell made it clear at his press briefing Wednesday that the Fed’s September rate decision will depend on economic data.\n*****\n&gt; Stocks rallied in the past week, helped by better-than-expected earnings reports and a view that the Federal Reserve may not be as aggressive as it forecast when it comes to interest rate hikes.\n*****\n&gt; The major stock market indexes ended July with their best monthly performance of the year, and the S&amp;P 500 and Dow scored their best months since November 2020. The Nasdaq’s 12.3% gain was its best monthly performance since April 2020.\n*****\n&gt; The S&amp;P was up 4.3% for the week and 9.1% for the month of July. It is still down 13.3% for the year. The Nasdaq was up 4.7% for the week. The Dow was up nearly 3% for the week and 6.7% for the month.\n*****\n&gt; “Earnings stink, but they’re not as bad as they could have been,” said Sam Stovall, chief investment strategist at CFRA. “The Fed raised rates the most aggressively since 1981, but that’s good because the economy is slowing down, and that’s good because the Fed might start tapering its tone.”\n*****\n&gt; Some of the biggest names in tech delivered earnings beats in the past week, and their stocks were higher, such as Apple, Microsoft and Amazon. There have also been some big misses and negative forecasts, like from Meta Platforms and Intel. Intel was down 8.6% Friday after its earnings miss and lowered forecast.\n*****\n&gt; “Thus far the market has been able to digest it,” said Art Hogan, chief investment strategist at National Securities. “A lot of this is better than feared. If that process continues, it’s likely to help the market grind higher. The market seems to be sitting on this notion that we had priced in Armageddon and thus far, that has not been thrust upon us.”\n*****\n&gt; Hogan said many investors were caught underinvested or even short stocks during the July rally.\n“That helps throw some gasoline on the fire,” he said.\n*****\n&gt; In the week ahead, there are 148 S&amp;P 500 companies reporting earnings. Reports come from a diverse group of companies, such as health-care names Eli Lilly, Gilead Sciences and Amgen. There will also be reports from travel-related companies, such as Uber and Booking Holdings.\n*****\n&gt; Stocks enter August riding the optimism of July, but since 1995, the S&amp;P 500 has declined by an average 0.5% in the month, according to CFRA. August has also been the third most volatile month, and only three major S&amp;P sectors over that time had averaged gains for the month: real estate, technology and utilities.\n*****\n&gt; Tech’s outperformance during the month does help the Nasdaq, and the Nasdaq 100 increased an average 0.9% in August, going back to 1995, according to CFRA.\n*****\n&gt; “It’s a month that could go either way because it has among the highest single monthly advances while at the same time among the deepest single monthly decline,” said Stovall. For instance, the S&amp;P 500 gained 11.6% in August 1992, and fell 14.6% in August 1998.\n*****\n&gt; Stovall said the S&amp;P 500 could be tested early in the week. The S&amp;P ended the week at 4,130. “Around 4,150 is a very important resistance level,” he said.\n*****\n&gt; # Recession?\n&gt; Investors have been worried about the prospect that the Federal Reserve’s tightening could push the economy into a recession.\n*****\n&gt; However, Thursday’s report that second-quarter gross domestic product declined by 0.9% was taken in stride, in part because the market has been betting the Fed will have to slow down its hiking. The economy has now contracted two quarters in a row, and it is considered to be in what some economists say is a “technical recession.” But most say it is not yet a real recession because of labor market strength and other factors.\n*****\n&gt; The markets are focused on the potential for a bigger slowdown — particularly the bond market. In the past week, the closely watched 10-year yield fell to 2.64% from 2.75% the week earlier. Yields fall when prices rise, and the 10-year note was lifted by buyers who were concerned about economic weakness.\n*****\n&gt; The 10-year’s yield is important since mortgage rates and other business and consumer loans are influenced by it.\n*****\n&gt; “The top tier U.S. data is important for this recession narrative. One thing that kicked off recession talk was the ISM services data, so ISM is going to be important,” said NatWest’s John Briggs. Services ISM slowed less than expected in June, but a measure of employment within the report fell to a two-year low.\n*****\n&gt; The Institute of Supply Management’s manufacturing survey is released on Monday, and the ISM services report is due out Wednesday.\n*****\n&gt; Traders have been betting in the futures market that the Fed will have to start cutting rates next year, but the Fed’s forecast does not show that. The Fed raised its target fed funds rate by 0.75% of a percentage point Wednesday, the second hike in a row of that size. The next rate hike, expected in September, could be smaller.\n*****\n&gt; Briggs said the market’s recession worries may be overdone.\n*****\n&gt; “The jobs report has to be not bad. Powell called the labor market extremely tight, so I just think the market went a little bit overboard here,” said Briggs, “Now it just needs to be not terrible.”\n*****\n&gt; The July employment report Friday morning is expected to show the economy added 250,000 jobs, according to Dow Jones. That is down from 372,000 jobs added in June.\n*****\n&gt; “If the jobs report is bad, to me it’s not more good news. ... If the jobs report is bad, it’s more information we’re just begging this recession rather than finishing this recession,” said David Bianco, chief investment officer, Americas at DWS.\n*****\n&gt; Bianco said he expects the economy is heading for a recession but because of inflation, not the Fed’s rate hikes.\n*****\n&gt; The big issue for the stock market is tech and how it’s doing since it dominates the market, Bianco said.\n*****\n&gt; Tech stocks were slammed by rising interest rates, as the 10-year yield climbed earlier in the year. Investors pay up for growth and tech stocks because of the promise of future earnings.\n*****\n&gt; “People say if the 10-year is done going up, how bad are the technology earnings going to be?” said Bianco. “I caution with the idea that tech will be damaged by recession and a strong dollar and this [would be] from spending on the consumer side and the business side of technology. It’s not that valuations are cheap. ... This may be a shallow recession, but I’m not convinced it’s going to be a short one.”\n*****\n&gt; Bianco said he likes utilities, health care and aerospace and defense. “For those that want to take a cyclical risk, I like the big banks,” he said. He said the banks do not have the balance sheet issues they had in the financial crisis.\n*****\n&gt; “The overnight rate is going to be the driver of their net interest margins, especially at the big banks,” he said. “Banks are in a better position than they normally are in a recession.”\n\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/upZPZqS.png))**\n\n# **S&amp;P Sectors for this past week:**\n###### **([CLICK HERE FOR THE S&amp;P SECTORS FOR THE PAST WEEK!](https://i.imgur.com/tO0OuVw.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/emqmsF7.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/6wHQ5aV.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/2w4S361.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/ujdKQSz.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/qupeuoB.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/bg91G0k.png))**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/60TnMGK.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/c3XokcY.jpg))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/cUkxuvv.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/zYaK0zM.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/t1VYuyA.png))**\n\n*****\n\n&gt; # Fed Chair Powell: The Comeback Kid\n\n&gt; The S&amp;P 500 has gained more than 1% on each of the last four Fed Days going back to March. The March meeting was the first rate hike of the Fed's current tightening cycle, and every meeting since then has seen a hike of at least 50 basis points. Each time, the S&amp;P surged on the day of the hike.\n\n&gt; The recent equity market strength on Fed Days is a new trend. Market performance on Fed Days during Powell's first few years at the helm was notoriously weak. Below we show the S&amp;P 500's average intraday performance on Fed Days by Fed chair since 1994 when policy changes first started being announced on the same day as the meeting. For Chair Powell, we show the S&amp;P's average performance on Fed Days during his tenure only through July 2021. At the time a year ago, Powell Fed Days were by far the worst of any Fed chair, and the market typically plunged into the close after the 2 PM ET announcement.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2022/07/072822-Powell-1a.png))**\n\n&gt; What a difference a year makes. Below we show the S&amp;P's average intraday performance on Fed Days by Fed chair updated through the most recent FOMC meeting this week. Whereas Powell Fed Days were by far the worst for the market at this time last year, they're now the second best behind only Bernanke Fed Days.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2022/07/072822-Powell-1b.png))**\n\n&gt; To highlight the improvement in the market response to Fed Chair Powell another way, below we show the full-day percentage change of the S&amp;P 500 on Fed Days during Powell's tenure as well as how the cumulative averages have evolved for both the full-day change and performance from 2:30 PM ET through the close (encapsulating the market response to the presser, or the chair more directly).\n\n&gt; As you can see, the S&amp;P was extremely weak on Powell Fed Days early on during his tenure, but over the last year, the market has reacted extremely positively. Seven of the last eight Powell Fed Days have seen positive moves for the S&amp;P, with the last four all seeing gains of more than 1%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2022/07/072822-Powell-3.png))**\n\n*****\n\n&gt; # Typical August Trading: Usually a Tepid Month\n\n&gt; Money flows from harvesting once made August a great stock market month in the first half of the Twentieth Century. It was the best DJIA month from 1901 to 1951. However since then and even more recently, over the last 21-years, August has been a disappointing month. The first eight or nine trading days have historically been weak with the major indexes shedding around 0.4% to 1.2%. This weakness is then followed by a brief mid-month rally that typically lasts until the 13th trading day. From there until late month the indexes have tended to wander sideways to lower before springing back to life ahead of month’s end.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/19687712e5fdeaffe0added362490073/5f74726f22f8226d-43/s500x750/c7fb91dd6b08272a379551bf65cb421193033efd.jpg))**\n\n***** \n\n&gt; # August’s First Trading Day Weakest of All\n\n&gt; On page 90 of the Stock Trader’s Almanac 2022, it is shown that the first trading days of each month combined have produced an outsized share of the market’s overall gains. However, the first trading day of August does not contribute to this phenomenon ranking worst among other First Trading Days in the 2022 Almanac. In the upcoming 2023 edition of the Almanac August’s first trading day is still the worst. In the past 24 years DJIA has risen just 36.4% (up 8, down 16) of the time on the first trading day of August. Several sizable gains in those up years, have mitigated the average first day percent change, but the median performance is a more sizable loss. Over the past 11 years, DJIA and S&amp;P 500 have both declined 8 times.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/d9651da3710911c476049dd1bddf87d8/88a65bebc7052e88-38/s500x750/d68500a277cf55fdddc284130b0ceec83d4eb674.jpg))**\n\n*****\n\n&gt; # Worst Year for Sentiment On Record\n\n&gt; Bullish sentiment measured by the weekly AAII survey has been a series of back and forth moves over the past several weeks. After reaching the highest level in over a month last week, bullish sentiment fell back down to 27.7%. Even with that decline, bullish sentiment has now managed to hold above 25% for at least three weeks in a row for the first time since the start of the year. We also must note, that the AAII survey collects data from Thursday at 12:01 AM through Wednesday 11:59 PM meaning any boost to sentiment from yesterday's FOMC post-meeting rally will not necessarily be fully captured in this report.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2022/07/072822-AAII-1.png))**\n\n&gt; Whereas bullish sentiment has had its fair share of back and forth moves, bearish sentiment has more consistently fallen with this week being the third sequential decline in a row. Now at 40%, bearish sentiment is at the lowest level since the first week of June.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2022/07/072822-AAII-2.png))**\n\n&gt; Given the drop in bulls was slightly smaller than that of bears this week, the bull-bear spread continued to move in a less negative direction. However, in spite of any improvement, this week was the 17th negative reading in a row as that streak remains the third longest on record.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2022/07/072822-AAII-3.png))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2022/07/072822-AAII-3a-1.png))**\n\n&gt; Not only have bears outnumbered bulls for 17 straight weeks, but there has actually only been one week this year (the final week of March) in which that was not the case. As a result, this year is on pace to have averaged the lowest levels of bullish sentiment and the highest levels of bearish sentiment of any year in the survey's history.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2022/07/072822-AAII-3b.png))**\n\n&gt; With both bulls and bears lower in the most recent survey, neutral sentiment picked up the difference rising to 32.2%. That is the most elevated reading since April and back into the middle of the post-pandemic range.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2022/07/072822-AAII-4.png))**\n\n*****\n\n&gt; # Big Revision in Claims\n\n&gt; Initial jobless claims continue to disappoint. Although this week's release technically fell down to 256K, it was from a 10K upwardly revised number of 261K last week. Both this week and last's readings are the highest since the fall and would also mark the highest readings since the fall of 2017 outside of the historically elevated readings of the pandemic.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2022/07/072822-Claims-1.png))**\n\n&gt; The pandemic was a volatile time period for jobless claims data as readings rose into the millions. As such, revisions over the past couple of years have gotten historically large in turn, albeit less so over the past year. Although it may not sound like much, last week's 10K revision was actually sizable. It was the largest revision since the week of July 4th last year, and prior to the pandemic, the week before Christmas in 2012 was the last time there was a double-digit revision.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2022/07/072822-Claims-2a.png))**\n\n&gt; In his post meeting presser, Fed Chair Powell mentioned how the rise in initial jobless claims may be seasonal in nature. While we will provide some more in depth analysis to these comments in regards to the data in tonight's Closer, as we have noted in the past, jobless claims have been roughly following standard historical seasonal patterns this year. July typically sees a temporary seasonal spike higher, but as we noted last week, that seasonal peak appears to have been put in place a bit later than usual which is rare but not exactly an unprecedented occurrence. While claims will likely get some seasonal tailwinds in the coming weeks (including this week of the year as claims have fallen around 90% of the time historically), the actual level of claims for the current week of the year is now well above comparable weeks for the few years prior to the pandemic. In other words, before or after seasonal adjustment, claims have come off their strongest levels and revisions have not exactly made things any better.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2022/07/072822-Claims-2.png))**\n\n&gt; As for continuing claims, the latest week saw a 25K decline to 1.359 million. While that does mark some deterioration from the strongest levels, unlike initial claims, continuing claims are still well below levels from prior to the pandemic indicating a still very healthy labor market the likes of which has not been seen in decades as the insured unemployment rate (continuing claims as a percentage of the number of those covered by state insurance programs) continues to hover near 1%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2022/07/072822-Claims-3.png))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2022/07/072822-Claims-3a.png))**\n\n*****\n\n&gt; # Most Countries Remain Below Pre-COVID Highs\n\n&gt; As we do the last Wednesday of each month, today we published our latest update of the Global Macro Dashboard which provides an overview of the major economic data and financial markets of 22 major global economies. Taking a look at the US ETFs tracking these same countries shows a broad move higher in equities around the globe during the month of July. The US has led the way higher as the S&amp;P 500 ETF (SPY) has rallied just over 5%. India (INDA), Sweden (EWD), and Singapore (EWS) have seen the next strongest moves with each one rallying 4% or more. That has brought US equities, India, and Singapore back above their 50-DMAs as well.\n\n&gt; Given those moves are in the context of much larger pullbacks year to date, most country ETFs also currently remain below their pre-COVID highs (the 52-week high as of the S&amp;P 500 peak on 2/19/20). In fact, SPY, INDA, Taiwan (EWT), and Canada (EWC) are the only countries meaningfully above prior highs. Switzerland (EWL) is also technically a part of that list, but the one basis point difference is not much of a margin. At the moment, Brazil is down the most significantly from its pre-COVID high as it is still down 43%. However, unlike many other countries, the year-to-date decline has been very modest at only 1.76%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2022/07/072722-GMD-1.png))**\n\n&gt; Taking a look at the charts of the four countries that are handily above their pre-COVID highs, the trends of the past year are not exactly positive. Each one currently sits in a multi-month downtrend, and only India and the US have managed to break above their 50-DMAs. Even if those moving averages have been taken out, further progress by bulls would be required to eliminate those downtrends.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2022/07/072722-GMD-2.png))**\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * (**T.B.A. THIS WEEKEND.**)\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/c3XokcY.jpg))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/FslrPmb.png))**\n###### **([CLICK HERE FOR THE MOST NOTABLE EARNINGS RELEASES FOR THE NEXT 2 WEEKS!](https://i.imgur.com/OxtujfG.png))**\n###### **([CLICK HERE FOR MONDAY'S PRE-MARKET NOTABLE EARNINGS RELEASES!](https://i.imgur.com/pYwvYZb.jpg))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 8.1.22 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/ohuonCJ.png))\n\n&gt; # ***Monday 8.1.22 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/akrBslt.png))\n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/FqLCDAE.png))\n\n*****\n\n&gt; # ***Tuesday 8.2.22 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/s3tHvb8.png))\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/ZksH3C0.png))\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #3!](https://i.imgur.com/XychHrb.png))\n\n&gt; # ***Tuesday 8.2.22 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/YVHLsmw.png))\n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/IZuxR0C.png))\n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #3!](https://i.imgur.com/fqOlMLD.png))\n\n*****\n\n&gt; # ***Wednesday 8.3.22 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/QwsYEKy.png))\n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/hJGrppb.png))\n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #3!](https://i.imgur.com/OmlKKPb.png))\n\n&gt; # ***Wednesday 8.3.22 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/p57tIDw.png))\n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/oj2Kup4.png))\n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #3!](https://i.imgur.com/FdCIJEO.png))\n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #4!](https://i.imgur.com/XUD9aDX.png))\n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #5!](https://i.imgur.com/G5KeWSL.png))\n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #6!](https://i.imgur.com/hyUGEg2.png))\n\n*****\n\n&gt; # ***Thursday 8.4.22 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/3TIuSp1.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/mX47v3r.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #3!](https://i.imgur.com/5aeMhzv.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #4!](https://i.imgur.com/kB0x2AD.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #5!](https://i.imgur.com/9ErjmxY.png))\n\n&gt; # ***Thursday 8.4.22 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/5GmXeF5.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/HCbvKsx.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #3!](https://i.imgur.com/VjCpJNa.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #4!](https://i.imgur.com/EQ4dMpE.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #5!](https://i.imgur.com/lH202gC.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #6!](https://i.imgur.com/w1QIjDE.png))\n\n\n*****\n\n&gt; # ***Friday 8.5.22 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/6PVsZYv.png))\n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/J5yxKnl.png))\n\n*****\n\n&gt; # ***Friday 8.5.22 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/3sS4sQe.png))\n\n*****\n\n&gt; # (T.B.A. THIS WEEKEND.)\n**(T.B.A. THIS WEEKEND.)** (T.B.A. THIS WEEKEND.).\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=SPY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/stocks. :)",
  "author_fullname": "t2_eaak0",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Wall Street Week Ahead for the trading week beginning August 1st, 2022",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_wbhge3",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.94,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 43,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 43,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": true,
  "thumbnail": "",
  "edited": 1659136777,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1659133406,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Good Friday evening to all of you here on &lt;a href=\"/r/stocks\"&gt;r/stocks&lt;/a&gt;! I hope everyone on this sub made out pretty nicely in the market this past week, and are ready for the new trading week ahead. :)&lt;/p&gt;\n\n&lt;p&gt;Here is everything you need to know to get you ready for the trading week beginning August 1st, 2022.&lt;/p&gt;\n\n&lt;h1&gt;&lt;strong&gt;Stocks head into August with a tailwind, as investors await jobs data and a slew of earnings - &lt;a href=\"https://www.cnbc.com/2022/07/29/stocks-head-into-august-with-a-tailwind-as-investors-await-jobs-data-and-a-slew-of-earnings.html\"&gt;(Source)&lt;/a&gt;&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;hr/&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;From Caterpillar to Amgen, dozens of large companies report earnings in the coming week, but it may be big economic data, such as Friday’s jobs report, that takes over as a major market catalyst.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Monthly employment reports are always important, but the next few may be even more so. Federal Reserve Chair Jerome Powell made it clear at his press briefing Wednesday that the Fed’s September rate decision will depend on economic data.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Stocks rallied in the past week, helped by better-than-expected earnings reports and a view that the Federal Reserve may not be as aggressive as it forecast when it comes to interest rate hikes.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;The major stock market indexes ended July with their best monthly performance of the year, and the S&amp;amp;P 500 and Dow scored their best months since November 2020. The Nasdaq’s 12.3% gain was its best monthly performance since April 2020.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;The S&amp;amp;P was up 4.3% for the week and 9.1% for the month of July. It is still down 13.3% for the year. The Nasdaq was up 4.7% for the week. The Dow was up nearly 3% for the week and 6.7% for the month.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;“Earnings stink, but they’re not as bad as they could have been,” said Sam Stovall, chief investment strategist at CFRA. “The Fed raised rates the most aggressively since 1981, but that’s good because the economy is slowing down, and that’s good because the Fed might start tapering its tone.”&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Some of the biggest names in tech delivered earnings beats in the past week, and their stocks were higher, such as Apple, Microsoft and Amazon. There have also been some big misses and negative forecasts, like from Meta Platforms and Intel. Intel was down 8.6% Friday after its earnings miss and lowered forecast.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;“Thus far the market has been able to digest it,” said Art Hogan, chief investment strategist at National Securities. “A lot of this is better than feared. If that process continues, it’s likely to help the market grind higher. The market seems to be sitting on this notion that we had priced in Armageddon and thus far, that has not been thrust upon us.”&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Hogan said many investors were caught underinvested or even short stocks during the July rally.\n“That helps throw some gasoline on the fire,” he said.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;In the week ahead, there are 148 S&amp;amp;P 500 companies reporting earnings. Reports come from a diverse group of companies, such as health-care names Eli Lilly, Gilead Sciences and Amgen. There will also be reports from travel-related companies, such as Uber and Booking Holdings.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Stocks enter August riding the optimism of July, but since 1995, the S&amp;amp;P 500 has declined by an average 0.5% in the month, according to CFRA. August has also been the third most volatile month, and only three major S&amp;amp;P sectors over that time had averaged gains for the month: real estate, technology and utilities.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Tech’s outperformance during the month does help the Nasdaq, and the Nasdaq 100 increased an average 0.9% in August, going back to 1995, according to CFRA.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;“It’s a month that could go either way because it has among the highest single monthly advances while at the same time among the deepest single monthly decline,” said Stovall. For instance, the S&amp;amp;P 500 gained 11.6% in August 1992, and fell 14.6% in August 1998.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Stovall said the S&amp;amp;P 500 could be tested early in the week. The S&amp;amp;P ended the week at 4,130. “Around 4,150 is a very important resistance level,” he said.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;h1&gt;Recession?&lt;/h1&gt;\n\n&lt;p&gt;Investors have been worried about the prospect that the Federal Reserve’s tightening could push the economy into a recession.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;However, Thursday’s report that second-quarter gross domestic product declined by 0.9% was taken in stride, in part because the market has been betting the Fed will have to slow down its hiking. The economy has now contracted two quarters in a row, and it is considered to be in what some economists say is a “technical recession.” But most say it is not yet a real recession because of labor market strength and other factors.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;The markets are focused on the potential for a bigger slowdown — particularly the bond market. In the past week, the closely watched 10-year yield fell to 2.64% from 2.75% the week earlier. Yields fall when prices rise, and the 10-year note was lifted by buyers who were concerned about economic weakness.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;The 10-year’s yield is important since mortgage rates and other business and consumer loans are influenced by it.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;“The top tier U.S. data is important for this recession narrative. One thing that kicked off recession talk was the ISM services data, so ISM is going to be important,” said NatWest’s John Briggs. Services ISM slowed less than expected in June, but a measure of employment within the report fell to a two-year low.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;The Institute of Supply Management’s manufacturing survey is released on Monday, and the ISM services report is due out Wednesday.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Traders have been betting in the futures market that the Fed will have to start cutting rates next year, but the Fed’s forecast does not show that. The Fed raised its target fed funds rate by 0.75% of a percentage point Wednesday, the second hike in a row of that size. The next rate hike, expected in September, could be smaller.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Briggs said the market’s recession worries may be overdone.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;“The jobs report has to be not bad. Powell called the labor market extremely tight, so I just think the market went a little bit overboard here,” said Briggs, “Now it just needs to be not terrible.”&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;The July employment report Friday morning is expected to show the economy added 250,000 jobs, according to Dow Jones. That is down from 372,000 jobs added in June.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;“If the jobs report is bad, to me it’s not more good news. ... If the jobs report is bad, it’s more information we’re just begging this recession rather than finishing this recession,” said David Bianco, chief investment officer, Americas at DWS.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Bianco said he expects the economy is heading for a recession but because of inflation, not the Fed’s rate hikes.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;The big issue for the stock market is tech and how it’s doing since it dominates the market, Bianco said.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Tech stocks were slammed by rising interest rates, as the 10-year yield climbed earlier in the year. Investors pay up for growth and tech stocks because of the promise of future earnings.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;“People say if the 10-year is done going up, how bad are the technology earnings going to be?” said Bianco. “I caution with the idea that tech will be damaged by recession and a strong dollar and this [would be] from spending on the consumer side and the business side of technology. It’s not that valuations are cheap. ... This may be a shallow recession, but I’m not convinced it’s going to be a short one.”&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Bianco said he likes utilities, health care and aerospace and defense. “For those that want to take a cyclical risk, I like the big banks,” he said. He said the banks do not have the balance sheet issues they had in the financial crisis.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;“The overnight rate is going to be the driver of their net interest margins, especially at the big banks,” he said. “Banks are in a better position than they normally are in a recession.”&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;hr/&gt;\n\n&lt;h1&gt;&lt;strong&gt;This past week saw the following moves in the S&amp;amp;P:&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://i.imgur.com/upZPZqS.png\"&gt;CLICK HERE FOR THE FULL S&amp;amp;P TREE MAP FOR THE PAST WEEK!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;h1&gt;&lt;strong&gt;S&amp;amp;P Sectors for this past week:&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://i.imgur.com/tO0OuVw.png\"&gt;CLICK HERE FOR THE S&amp;amp;P SECTORS FOR THE PAST WEEK!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;h1&gt;&lt;strong&gt;Major Indices for this past week:&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://i.imgur.com/emqmsF7.png\"&gt;CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;h1&gt;&lt;strong&gt;Major Futures Markets as of Friday&amp;#39;s close:&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://i.imgur.com/6wHQ5aV.png\"&gt;CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;h1&gt;&lt;strong&gt;Economic Calendar for the Week Ahead:&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://i.imgur.com/2w4S361.png\"&gt;CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;h1&gt;&lt;strong&gt;Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday&amp;#39;s close:&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://i.imgur.com/ujdKQSz.png\"&gt;CLICK HERE FOR THE CHART!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;h1&gt;&lt;strong&gt;S&amp;amp;P Sectors for the Past Week:&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://i.imgur.com/qupeuoB.png\"&gt;CLICK HERE FOR THE CHART!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;h1&gt;&lt;strong&gt;Major Indices Pullback/Correction Levels as of Friday&amp;#39;s close:&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://i.imgur.com/bg91G0k.png\"&gt;CLICK HERE FOR THE CHART!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;h1&gt;&lt;strong&gt;Major Indices Rally Levels as of Friday&amp;#39;s close:&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://i.imgur.com/60TnMGK.png\"&gt;CLICK HERE FOR THE CHART!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;h1&gt;&lt;strong&gt;Most Anticipated Earnings Releases for this week:&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://i.imgur.com/c3XokcY.jpg\"&gt;CLICK HERE FOR THE CHART!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;h1&gt;&lt;strong&gt;Here are the upcoming IPO&amp;#39;s for this week:&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://i.imgur.com/cUkxuvv.png\"&gt;CLICK HERE FOR THE CHART!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;h1&gt;&lt;strong&gt;Friday&amp;#39;s Stock Analyst Upgrades &amp;amp; Downgrades:&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://i.imgur.com/zYaK0zM.png\"&gt;CLICK HERE FOR THE CHART LINK #1!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://i.imgur.com/t1VYuyA.png\"&gt;CLICK HERE FOR THE CHART LINK #2!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;hr/&gt;\n\n&lt;blockquote&gt;\n&lt;h1&gt;Fed Chair Powell: The Comeback Kid&lt;/h1&gt;\n\n&lt;p&gt;The S&amp;amp;P 500 has gained more than 1% on each of the last four Fed Days going back to March. The March meeting was the first rate hike of the Fed&amp;#39;s current tightening cycle, and every meeting since then has seen a hike of at least 50 basis points. Each time, the S&amp;amp;P surged on the day of the hike.&lt;/p&gt;\n\n&lt;p&gt;The recent equity market strength on Fed Days is a new trend. Market performance on Fed Days during Powell&amp;#39;s first few years at the helm was notoriously weak. Below we show the S&amp;amp;P 500&amp;#39;s average intraday performance on Fed Days by Fed chair since 1994 when policy changes first started being announced on the same day as the meeting. For Chair Powell, we show the S&amp;amp;P&amp;#39;s average performance on Fed Days during his tenure only through July 2021. At the time a year ago, Powell Fed Days were by far the worst of any Fed chair, and the market typically plunged into the close after the 2 PM ET announcement.&lt;/p&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://media.bespokepremium.com/uploads/2022/07/072822-Powell-1a.png\"&gt;CLICK HERE FOR THE CHART!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;p&gt;What a difference a year makes. Below we show the S&amp;amp;P&amp;#39;s average intraday performance on Fed Days by Fed chair updated through the most recent FOMC meeting this week. Whereas Powell Fed Days were by far the worst for the market at this time last year, they&amp;#39;re now the second best behind only Bernanke Fed Days.&lt;/p&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://media.bespokepremium.com/uploads/2022/07/072822-Powell-1b.png\"&gt;CLICK HERE FOR THE CHART!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;p&gt;To highlight the improvement in the market response to Fed Chair Powell another way, below we show the full-day percentage change of the S&amp;amp;P 500 on Fed Days during Powell&amp;#39;s tenure as well as how the cumulative averages have evolved for both the full-day change and performance from 2:30 PM ET through the close (encapsulating the market response to the presser, or the chair more directly).&lt;/p&gt;\n\n&lt;p&gt;As you can see, the S&amp;amp;P was extremely weak on Powell Fed Days early on during his tenure, but over the last year, the market has reacted extremely positively. Seven of the last eight Powell Fed Days have seen positive moves for the S&amp;amp;P, with the last four all seeing gains of more than 1%.&lt;/p&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://media.bespokepremium.com/uploads/2022/07/072822-Powell-3.png\"&gt;CLICK HERE FOR THE CHART!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n&lt;/blockquote&gt;\n\n&lt;hr/&gt;\n\n&lt;blockquote&gt;\n&lt;h1&gt;Typical August Trading: Usually a Tepid Month&lt;/h1&gt;\n\n&lt;p&gt;Money flows from harvesting once made August a great stock market month in the first half of the Twentieth Century. It was the best DJIA month from 1901 to 1951. However since then and even more recently, over the last 21-years, August has been a disappointing month. The first eight or nine trading days have historically been weak with the major indexes shedding around 0.4% to 1.2%. This weakness is then followed by a brief mid-month rally that typically lasts until the 13th trading day. From there until late month the indexes have tended to wander sideways to lower before springing back to life ahead of month’s end.&lt;/p&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://64.media.tumblr.com/19687712e5fdeaffe0added362490073/5f74726f22f8226d-43/s500x750/c7fb91dd6b08272a379551bf65cb421193033efd.jpg\"&gt;CLICK HERE FOR THE CHART!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n&lt;/blockquote&gt;\n\n&lt;hr/&gt;\n\n&lt;blockquote&gt;\n&lt;h1&gt;August’s First Trading Day Weakest of All&lt;/h1&gt;\n\n&lt;p&gt;On page 90 of the Stock Trader’s Almanac 2022, it is shown that the first trading days of each month combined have produced an outsized share of the market’s overall gains. However, the first trading day of August does not contribute to this phenomenon ranking worst among other First Trading Days in the 2022 Almanac. In the upcoming 2023 edition of the Almanac August’s first trading day is still the worst. In the past 24 years DJIA has risen just 36.4% (up 8, down 16) of the time on the first trading day of August. Several sizable gains in those up years, have mitigated the average first day percent change, but the median performance is a more sizable loss. Over the past 11 years, DJIA and S&amp;amp;P 500 have both declined 8 times.&lt;/p&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://64.media.tumblr.com/d9651da3710911c476049dd1bddf87d8/88a65bebc7052e88-38/s500x750/d68500a277cf55fdddc284130b0ceec83d4eb674.jpg\"&gt;CLICK HERE FOR THE CHART!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n&lt;/blockquote&gt;\n\n&lt;hr/&gt;\n\n&lt;blockquote&gt;\n&lt;h1&gt;Worst Year for Sentiment On Record&lt;/h1&gt;\n\n&lt;p&gt;Bullish sentiment measured by the weekly AAII survey has been a series of back and forth moves over the past several weeks. After reaching the highest level in over a month last week, bullish sentiment fell back down to 27.7%. Even with that decline, bullish sentiment has now managed to hold above 25% for at least three weeks in a row for the first time since the start of the year. We also must note, that the AAII survey collects data from Thursday at 12:01 AM through Wednesday 11:59 PM meaning any boost to sentiment from yesterday&amp;#39;s FOMC post-meeting rally will not necessarily be fully captured in this report.&lt;/p&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://media.bespokepremium.com/uploads/2022/07/072822-AAII-1.png\"&gt;CLICK HERE FOR THE CHART!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;p&gt;Whereas bullish sentiment has had its fair share of back and forth moves, bearish sentiment has more consistently fallen with this week being the third sequential decline in a row. Now at 40%, bearish sentiment is at the lowest level since the first week of June.&lt;/p&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://media.bespokepremium.com/uploads/2022/07/072822-AAII-2.png\"&gt;CLICK HERE FOR THE CHART!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;p&gt;Given the drop in bulls was slightly smaller than that of bears this week, the bull-bear spread continued to move in a less negative direction. However, in spite of any improvement, this week was the 17th negative reading in a row as that streak remains the third longest on record.&lt;/p&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://media.bespokepremium.com/uploads/2022/07/072822-AAII-3.png\"&gt;CLICK HERE FOR THE CHART!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://media.bespokepremium.com/uploads/2022/07/072822-AAII-3a-1.png\"&gt;CLICK HERE FOR THE CHART!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;p&gt;Not only have bears outnumbered bulls for 17 straight weeks, but there has actually only been one week this year (the final week of March) in which that was not the case. As a result, this year is on pace to have averaged the lowest levels of bullish sentiment and the highest levels of bearish sentiment of any year in the survey&amp;#39;s history.&lt;/p&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://media.bespokepremium.com/uploads/2022/07/072822-AAII-3b.png\"&gt;CLICK HERE FOR THE CHART!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;p&gt;With both bulls and bears lower in the most recent survey, neutral sentiment picked up the difference rising to 32.2%. That is the most elevated reading since April and back into the middle of the post-pandemic range.&lt;/p&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://media.bespokepremium.com/uploads/2022/07/072822-AAII-4.png\"&gt;CLICK HERE FOR THE CHART!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n&lt;/blockquote&gt;\n\n&lt;hr/&gt;\n\n&lt;blockquote&gt;\n&lt;h1&gt;Big Revision in Claims&lt;/h1&gt;\n\n&lt;p&gt;Initial jobless claims continue to disappoint. Although this week&amp;#39;s release technically fell down to 256K, it was from a 10K upwardly revised number of 261K last week. Both this week and last&amp;#39;s readings are the highest since the fall and would also mark the highest readings since the fall of 2017 outside of the historically elevated readings of the pandemic.&lt;/p&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://media.bespokepremium.com/uploads/2022/07/072822-Claims-1.png\"&gt;CLICK HERE FOR THE CHART!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;p&gt;The pandemic was a volatile time period for jobless claims data as readings rose into the millions. As such, revisions over the past couple of years have gotten historically large in turn, albeit less so over the past year. Although it may not sound like much, last week&amp;#39;s 10K revision was actually sizable. It was the largest revision since the week of July 4th last year, and prior to the pandemic, the week before Christmas in 2012 was the last time there was a double-digit revision.&lt;/p&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://media.bespokepremium.com/uploads/2022/07/072822-Claims-2a.png\"&gt;CLICK HERE FOR THE CHART!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;p&gt;In his post meeting presser, Fed Chair Powell mentioned how the rise in initial jobless claims may be seasonal in nature. While we will provide some more in depth analysis to these comments in regards to the data in tonight&amp;#39;s Closer, as we have noted in the past, jobless claims have been roughly following standard historical seasonal patterns this year. July typically sees a temporary seasonal spike higher, but as we noted last week, that seasonal peak appears to have been put in place a bit later than usual which is rare but not exactly an unprecedented occurrence. While claims will likely get some seasonal tailwinds in the coming weeks (including this week of the year as claims have fallen around 90% of the time historically), the actual level of claims for the current week of the year is now well above comparable weeks for the few years prior to the pandemic. In other words, before or after seasonal adjustment, claims have come off their strongest levels and revisions have not exactly made things any better.&lt;/p&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://media.bespokepremium.com/uploads/2022/07/072822-Claims-2.png\"&gt;CLICK HERE FOR THE CHART!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;p&gt;As for continuing claims, the latest week saw a 25K decline to 1.359 million. While that does mark some deterioration from the strongest levels, unlike initial claims, continuing claims are still well below levels from prior to the pandemic indicating a still very healthy labor market the likes of which has not been seen in decades as the insured unemployment rate (continuing claims as a percentage of the number of those covered by state insurance programs) continues to hover near 1%.&lt;/p&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://media.bespokepremium.com/uploads/2022/07/072822-Claims-3.png\"&gt;CLICK HERE FOR THE CHART!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://media.bespokepremium.com/uploads/2022/07/072822-Claims-3a.png\"&gt;CLICK HERE FOR THE CHART!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n&lt;/blockquote&gt;\n\n&lt;hr/&gt;\n\n&lt;blockquote&gt;\n&lt;h1&gt;Most Countries Remain Below Pre-COVID Highs&lt;/h1&gt;\n\n&lt;p&gt;As we do the last Wednesday of each month, today we published our latest update of the Global Macro Dashboard which provides an overview of the major economic data and financial markets of 22 major global economies. Taking a look at the US ETFs tracking these same countries shows a broad move higher in equities around the globe during the month of July. The US has led the way higher as the S&amp;amp;P 500 ETF (SPY) has rallied just over 5%. India (INDA), Sweden (EWD), and Singapore (EWS) have seen the next strongest moves with each one rallying 4% or more. That has brought US equities, India, and Singapore back above their 50-DMAs as well.&lt;/p&gt;\n\n&lt;p&gt;Given those moves are in the context of much larger pullbacks year to date, most country ETFs also currently remain below their pre-COVID highs (the 52-week high as of the S&amp;amp;P 500 peak on 2/19/20). In fact, SPY, INDA, Taiwan (EWT), and Canada (EWC) are the only countries meaningfully above prior highs. Switzerland (EWL) is also technically a part of that list, but the one basis point difference is not much of a margin. At the moment, Brazil is down the most significantly from its pre-COVID high as it is still down 43%. However, unlike many other countries, the year-to-date decline has been very modest at only 1.76%.&lt;/p&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://media.bespokepremium.com/uploads/2022/07/072722-GMD-1.png\"&gt;CLICK HERE FOR THE CHART!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;p&gt;Taking a look at the charts of the four countries that are handily above their pre-COVID highs, the trends of the past year are not exactly positive. Each one currently sits in a multi-month downtrend, and only India and the US have managed to break above their 50-DMAs. Even if those moving averages have been taken out, further progress by bulls would be required to eliminate those downtrends.&lt;/p&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://media.bespokepremium.com/uploads/2022/07/072722-GMD-2.png\"&gt;CLICK HERE FOR THE CHART!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n&lt;/blockquote&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Here are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;blockquote&gt;\n&lt;ul&gt;\n&lt;li&gt;(&lt;strong&gt;T.B.A. THIS WEEKEND.&lt;/strong&gt;)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/blockquote&gt;\n\n&lt;hr/&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://i.imgur.com/c3XokcY.jpg\"&gt;CLICK HERE FOR NEXT WEEK&amp;#39;S MOST NOTABLE EARNINGS RELEASES!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://i.imgur.com/FslrPmb.png\"&gt;CLICK HERE FOR NEXT WEEK&amp;#39;S HIGHEST VOLATILITY EARNINGS RELEASES!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://i.imgur.com/OxtujfG.png\"&gt;CLICK HERE FOR THE MOST NOTABLE EARNINGS RELEASES FOR THE NEXT 2 WEEKS!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;h6&gt;&lt;strong&gt;(&lt;a href=\"https://i.imgur.com/pYwvYZb.jpg\"&gt;CLICK HERE FOR MONDAY&amp;#39;S PRE-MARKET NOTABLE EARNINGS RELEASES!&lt;/a&gt;)&lt;/strong&gt;&lt;/h6&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Below are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp;amp; consensus estimates courtesy of Earnings Whispers:&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;blockquote&gt;\n&lt;h1&gt;&lt;strong&gt;&lt;em&gt;Monday 8.1.22 Before Market Open:&lt;/em&gt;&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;h6&gt;(&lt;a href=\"https://i.imgur.com/ohuonCJ.png\"&gt;CLICK HERE FOR MONDAY&amp;#39;S PRE-MARKET EARNINGS TIME &amp;amp; ESTIMATES!&lt;/a&gt;)&lt;/h6&gt;\n\n&lt;h1&gt;&lt;strong&gt;&lt;em&gt;Monday 8.1.22 After Market Close:&lt;/em&gt;&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;h6&gt;(&lt;a href=\"https://i.imgur.com/akrBslt.png\"&gt;CLICK HERE FOR MONDAY&amp;#39;S AFTER-MARKET EARNINGS TIME &amp;amp; ESTIMATES LINK #1!&lt;/a&gt;)&lt;/h6&gt;\n\n&lt;h6&gt;(&lt;a href=\"https://i.imgur.com/FqLCDAE.png\"&gt;CLICK HERE FOR MONDAY&amp;#39;S AFTER-MARKET EARNINGS TIME &amp;amp; ESTIMATES LINK #2!&lt;/a&gt;)&lt;/h6&gt;\n&lt;/blockquote&gt;\n\n&lt;hr/&gt;\n\n&lt;blockquote&gt;\n&lt;h1&gt;&lt;strong&gt;&lt;em&gt;Tuesday 8.2.22 Before Market Open:&lt;/em&gt;&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;h6&gt;(&lt;a href=\"https://i.imgur.com/s3tHvb8.png\"&gt;CLICK HERE FOR TUESDAY&amp;#39;S PRE-MARKET EARNINGS TIME &amp;amp; ESTIMATES LINK #1!&lt;/a&gt;)&lt;/h6&gt;\n\n&lt;h6&gt;(&lt;a href=\"https://i.imgur.com/ZksH3C0.png\"&gt;CLICK HERE FOR TUESDAY&amp;#39;S PRE-MARKET EARNINGS TIME &amp;amp; ESTIMATES LINK #2!&lt;/a&gt;)&lt;/h6&gt;\n\n&lt;h6&gt;(&lt;a href=\"https://i.imgur.com/XychHrb.png\"&gt;CLICK HERE FOR TUESDAY&amp;#39;S PRE-MARKET EARNINGS TIME &amp;amp; ESTIMATES LINK #3!&lt;/a&gt;)&lt;/h6&gt;\n\n&lt;h1&gt;&lt;strong&gt;&lt;em&gt;Tuesday 8.2.22 After Market Close:&lt;/em&gt;&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;h6&gt;(&lt;a href=\"https://i.imgur.com/YVHLsmw.png\"&gt;CLICK HERE FOR TUESDAY&amp;#39;S AFTER-MARKET EARNINGS TIME &amp;amp; ESTIMATES LINK #1!&lt;/a&gt;)&lt;/h6&gt;\n\n&lt;h6&gt;(&lt;a href=\"https://i.imgur.com/IZuxR0C.png\"&gt;CLICK HERE FOR TUESDAY&amp;#39;S AFTER-MARKET EARNINGS TIME &amp;amp; ESTIMATES LINK #2!&lt;/a&gt;)&lt;/h6&gt;\n\n&lt;h6&gt;(&lt;a href=\"https://i.imgur.com/fqOlMLD.png\"&gt;CLICK HERE FOR TUESDAY&amp;#39;S AFTER-MARKET EARNINGS TIME &amp;amp; ESTIMATES LINK #3!&lt;/a&gt;)&lt;/h6&gt;\n&lt;/blockquote&gt;\n\n&lt;hr/&gt;\n\n&lt;blockquote&gt;\n&lt;h1&gt;&lt;strong&gt;&lt;em&gt;Wednesday 8.3.22 Before Market Open:&lt;/em&gt;&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;h6&gt;(&lt;a href=\"https://i.imgur.com/QwsYEKy.png\"&gt;CLICK HERE FOR WEDNESDAY&amp;#39;S PRE-MARKET EARNINGS TIME &amp;amp; ESTIMATES LINK #1!&lt;/a&gt;)&lt;/h6&gt;\n\n&lt;h6&gt;(&lt;a href=\"https://i.imgur.com/hJGrppb.png\"&gt;CLICK HERE FOR WEDNESDAY&amp;#39;S PRE-MARKET EARNINGS TIME &amp;amp; ESTIMATES LINK #2!&lt;/a&gt;)&lt;/h6&gt;\n\n&lt;h6&gt;(&lt;a href=\"https://i.imgur.com/OmlKKPb.png\"&gt;CLICK HERE FOR WEDNESDAY&amp;#39;S PRE-MARKET EARNINGS TIME &amp;amp; ESTIMATES LINK #3!&lt;/a&gt;)&lt;/h6&gt;\n\n&lt;h1&gt;&lt;strong&gt;&lt;em&gt;Wednesday 8.3.22 After Market Close:&lt;/em&gt;&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;h6&gt;(&lt;a href=\"https://i.imgur.com/p57tIDw.png\"&gt;CLICK HERE FOR WEDNESDAY&amp;#39;S AFTER-MARKET EARNINGS TIME &amp;amp; ESTIMATES LINK #1!&lt;/a&gt;)&lt;/h6&gt;\n\n&lt;h6&gt;(&lt;a href=\"https://i.imgur.com/oj2Kup4.png\"&gt;CLICK HERE FOR WEDNESDAY&amp;#39;S AFTER-MARKET EARNINGS TIME &amp;amp; ESTIMATES LINK #2!&lt;/a&gt;)&lt;/h6&gt;\n\n&lt;h6&gt;(&lt;a href=\"https://i.imgur.com/FdCIJEO.png\"&gt;CLICK HERE FOR WEDNESDAY&amp;#39;S AFTER-MARKET EARNINGS TIME &amp;amp; ESTIMATES LINK #3!&lt;/a&gt;)&lt;/h6&gt;\n\n&lt;h6&gt;(&lt;a href=\"https://i.imgur.com/XUD9aDX.png\"&gt;CLICK HERE FOR WEDNESDAY&amp;#39;S AFTER-MARKET EARNINGS TIME &amp;amp; ESTIMATES LINK #4!&lt;/a&gt;)&lt;/h6&gt;\n\n&lt;h6&gt;(&lt;a href=\"https://i.imgur.com/G5KeWSL.png\"&gt;CLICK HERE FOR WEDNESDAY&amp;#39;S AFTER-MARKET EARNINGS TIME &amp;amp; ESTIMATES LINK #5!&lt;/a&gt;)&lt;/h6&gt;\n\n&lt;h6&gt;(&lt;a href=\"https://i.imgur.com/hyUGEg2.png\"&gt;CLICK HERE FOR WEDNESDAY&amp;#39;S AFTER-MARKET EARNINGS TIME &amp;amp; ESTIMATES LINK #6!&lt;/a&gt;)&lt;/h6&gt;\n&lt;/blockquote&gt;\n\n&lt;hr/&gt;\n\n&lt;blockquote&gt;\n&lt;h1&gt;&lt;strong&gt;&lt;em&gt;Thursday 8.4.22 Before Market Open:&lt;/em&gt;&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;h6&gt;(&lt;a href=\"https://i.imgur.com/3TIuSp1.png\"&gt;CLICK HERE FOR THURSDAY&amp;#39;S PRE-MARKET EARNINGS TIME &amp;amp; ESTIMATES LINK #1!&lt;/a&gt;)&lt;/h6&gt;\n\n&lt;h6&gt;(&lt;a href=\"https://i.imgur.com/mX47v3r.png\"&gt;CLICK HERE FOR THURSDAY&amp;#39;S PRE-MARKET EARNINGS TIME &amp;amp; ESTIMATES LINK #2!&lt;/a&gt;)&lt;/h6&gt;\n\n&lt;h6&gt;(&lt;a href=\"https://i.imgur.com/5aeMhzv.png\"&gt;CLICK HERE FOR THURSDAY&amp;#39;S PRE-MARKET EARNINGS TIME &amp;amp; ESTIMATES LINK #3!&lt;/a&gt;)&lt;/h6&gt;\n\n&lt;h6&gt;(&lt;a href=\"https://i.imgur.com/kB0x2AD.png\"&gt;CLICK HERE FOR THURSDAY&amp;#39;S PRE-MARKET EARNINGS TIME &amp;amp; ESTIMATES LINK #4!&lt;/a&gt;)&lt;/h6&gt;\n\n&lt;h6&gt;(&lt;a href=\"https://i.imgur.com/9ErjmxY.png\"&gt;CLICK HERE FOR THURSDAY&amp;#39;S PRE-MARKET EARNINGS TIME &amp;amp; ESTIMATES LINK #5!&lt;/a&gt;)&lt;/h6&gt;\n\n&lt;h1&gt;&lt;strong&gt;&lt;em&gt;Thursday 8.4.22 After Market Close:&lt;/em&gt;&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;h6&gt;(&lt;a href=\"https://i.imgur.com/5GmXeF5.png\"&gt;CLICK HERE FOR THURSDAY&amp;#39;S AFTER-MARKET EARNINGS TIME &amp;amp; ESTIMATES LINK #1!&lt;/a&gt;)&lt;/h6&gt;\n\n&lt;h6&gt;(&lt;a href=\"https://i.imgur.com/HCbvKsx.png\"&gt;CLICK HERE FOR THURSDAY&amp;#39;S AFTER-MARKET EARNINGS TIME &amp;amp; ESTIMATES LINK #2!&lt;/a&gt;)&lt;/h6&gt;\n\n&lt;h6&gt;(&lt;a href=\"https://i.imgur.com/VjCpJNa.png\"&gt;CLICK HERE FOR THURSDAY&amp;#39;S AFTER-MARKET EARNINGS TIME &amp;amp; ESTIMATES LINK #3!&lt;/a&gt;)&lt;/h6&gt;\n\n&lt;h6&gt;(&lt;a href=\"https://i.imgur.com/EQ4dMpE.png\"&gt;CLICK HERE FOR THURSDAY&amp;#39;S AFTER-MARKET EARNINGS TIME &amp;amp; ESTIMATES LINK #4!&lt;/a&gt;)&lt;/h6&gt;\n\n&lt;h6&gt;(&lt;a href=\"https://i.imgur.com/lH202gC.png\"&gt;CLICK HERE FOR THURSDAY&amp;#39;S AFTER-MARKET EARNINGS TIME &amp;amp; ESTIMATES LINK #5!&lt;/a&gt;)&lt;/h6&gt;\n\n&lt;h6&gt;(&lt;a href=\"https://i.imgur.com/w1QIjDE.png\"&gt;CLICK HERE FOR THURSDAY&amp;#39;S AFTER-MARKET EARNINGS TIME &amp;amp; ESTIMATES LINK #6!&lt;/a&gt;)&lt;/h6&gt;\n&lt;/blockquote&gt;\n\n&lt;hr/&gt;\n\n&lt;blockquote&gt;\n&lt;h1&gt;&lt;strong&gt;&lt;em&gt;Friday 8.5.22 Before Market Open:&lt;/em&gt;&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;h6&gt;(&lt;a href=\"https://i.imgur.com/6PVsZYv.png\"&gt;CLICK HERE FOR FRIDAY&amp;#39;S PRE-MARKET EARNINGS TIME &amp;amp; ESTIMATES LINK #1!&lt;/a&gt;)&lt;/h6&gt;\n\n&lt;h6&gt;(&lt;a href=\"https://i.imgur.com/J5yxKnl.png\"&gt;CLICK HERE FOR FRIDAY&amp;#39;S PRE-MARKET EARNINGS TIME &amp;amp; ESTIMATES LINK #2!&lt;/a&gt;)&lt;/h6&gt;\n&lt;/blockquote&gt;\n\n&lt;hr/&gt;\n\n&lt;blockquote&gt;\n&lt;h1&gt;&lt;strong&gt;&lt;em&gt;Friday 8.5.22 After Market Close:&lt;/em&gt;&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;h6&gt;(&lt;a href=\"https://i.imgur.com/3sS4sQe.png\"&gt;CLICK HERE FOR FRIDAY&amp;#39;S AFTER-MARKET EARNINGS TIME &amp;amp; ESTIMATES!&lt;/a&gt;)&lt;/h6&gt;\n&lt;/blockquote&gt;\n\n&lt;hr/&gt;\n\n&lt;blockquote&gt;\n&lt;h1&gt;(T.B.A. THIS WEEKEND.)&lt;/h1&gt;\n\n&lt;p&gt;&lt;strong&gt;(T.B.A. THIS WEEKEND.)&lt;/strong&gt; (T.B.A. THIS WEEKEND.).&lt;/p&gt;\n\n&lt;h1&gt;(&lt;a href=\"https://charts.finviz.com/chart.ashx?t=SPY&amp;amp;ty=c&amp;amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;amp;p=d&amp;amp;s=l\"&gt;CLICK HERE FOR THE CHART!&lt;/a&gt;)&lt;/h1&gt;\n&lt;/blockquote&gt;\n\n&lt;hr/&gt;\n\n&lt;h1&gt;DISCUSS!&lt;/h1&gt;\n\n&lt;p&gt;What are you all watching for in this upcoming trading week?&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;I hope you all have a wonderful weekend and a great trading week ahead &lt;a href=\"/r/stocks\"&gt;r/stocks&lt;/a&gt;. :)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "wbhge3",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "bigbear0083",
  "discussion_type": null,
  "num_comments": 1,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/wbhge3/wall_street_week_ahead_for_the_trading_week/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/wbhge3/wall_street_week_ahead_for_the_trading_week/",
  "subreddit_subscribers": 4360086,
  "created_utc": 1659157303,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1659133406,
  "the_new_excerpt": "Good Friday evening to all of you here on r/stocks [/r/stocks]! I hope everyone\non this sub made out pretty nicely in the market this past week, and are ready\nfor the new trading week ahead. :)\n\nHere is everything you need to know to get you ready for the trading week\nbeginning August 1st,…"
}