{
  "author": "Sumanta_Gurung",
  "original_created_utc": 1646225487,
  "title": "Why is it mostly men who are under 30, trading bitcoin?",
  "created_utc": 1646263995,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;According to a bitcoin-focused trading app, with tens of thousands of users, women and older investors are largely staying out of the crypto craze, leaving mainly young men to be the driving force behind crypto rallies and lows.  &lt;/p&gt;\n\n&lt;p&gt;The overwhelming majority of people using the app to trade in bitcoin are men, making up 79% of users to just 21% women. Compared with the most recent data from the U.K.’s Office for National Statistics, or ONS, this makes the gender divide among bitcoin holders even wider than with other investments.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;So, is it overconfidence?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Barber and Odean found that men trade stocks 45% more frequently than women, which is a symptom of overconfidence because overconfident investors trade excessively&lt;/p&gt;\n\n&lt;p&gt;If we see from that research study that men are, on average, more inclined to be overconfident, that overconfidence could be helping to drive the heavier representation of men in these much more speculative markets. It really takes a bit of a hope and a prayer to believe that these assets are going to be long-term, reliable investment performers.”&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 321,
  "permalink": "/r/Bitcoin/comments/t4zh3j/why_is_it_mostly_men_who_are_under_30_trading/",
  "subreddit": "Bitcoin",
  "id": "t4zh3j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "According to a bitcoin-focused trading app, with tens of thousands of users,\nwomen and older investors are largely staying out of the crypto craze, leaving\nmainly young men to be the driving force behind crypto rallies and lows.\n\nThe overwhelming majority of people using the app to trade in bitcoin…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "数万人のユーザーを持つ、ビットコインに特化した取引アプリによると。\n女性や高齢の投資家は、暗号ブームから大きく距離を置いています。\n暗号の暴騰・暴落の原動力は、主に若い男性です。\n\nアプリを使ってビットコインの取引をしている人の圧倒的多数は...。",
      "title": "ビットコインの取引をしているのは、なぜ30代以下の男性が多いのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "根据一个专注于比特币的交易应用程序，拥有数万名用户。\n女性和年长的投资者在很大程度上没有参与加密货币的热潮，留下的主要是年轻男性成为加密货币反弹和上涨的动力。\n主要是年轻男性成为加密货币上涨和下跌背后的驱动力。\n\n绝大多数使用该应用程序进行比特币交易的人...",
      "title": "为什么大多是30岁以下的男性在交易比特币？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "根據一個專注於比特幣的交易應用程序，擁有數萬名用戶。\n女性和年長的投資者在很大程度上沒有參與加密貨幣的熱潮，留下的主要是年輕男性成爲加密貨幣反彈和上漲的動力。\n主要是年輕男性成爲加密貨幣上漲和下跌背後的驅動力。\n\n絕大多數使用該應用程序進行比特幣交易的人...",
      "title": "爲什麼大多是30歲以下的男性在交易比特幣？"
    }
  ]
}