{
  "author": "Sumanta_Gurung",
  "original_created_utc": 1646225487,
  "title": "Why is it mostly men who are under 30, trading bitcoin?",
  "created_utc": 1646263995,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;According to a bitcoin-focused trading app, with tens of thousands of users, women and older investors are largely staying out of the crypto craze, leaving mainly young men to be the driving force behind crypto rallies and lows.  &lt;/p&gt;\n\n&lt;p&gt;The overwhelming majority of people using the app to trade in bitcoin are men, making up 79% of users to just 21% women. Compared with the most recent data from the U.K.’s Office for National Statistics, or ONS, this makes the gender divide among bitcoin holders even wider than with other investments.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;So, is it overconfidence?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Barber and Odean found that men trade stocks 45% more frequently than women, which is a symptom of overconfidence because overconfident investors trade excessively&lt;/p&gt;\n\n&lt;p&gt;If we see from that research study that men are, on average, more inclined to be overconfident, that overconfidence could be helping to drive the heavier representation of men in these much more speculative markets. It really takes a bit of a hope and a prayer to believe that these assets are going to be long-term, reliable investment performers.”&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 321,
  "permalink": "/r/Bitcoin/comments/t4zh3j/why_is_it_mostly_men_who_are_under_30_trading/",
  "subreddit": "Bitcoin",
  "id": "t4zh3j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "According to a bitcoin-focused trading app, with tens of thousands of users,\nwomen and older investors are largely staying out of the crypto craze, leaving\nmainly young men to be the driving force behind crypto rallies and lows.\n\nThe overwhelming majority of people using the app to trade in bitcoin…"
}