{
  "author": "crypapotamus",
  "the_new_excerpt": "You guys seem to appreciate stories of crypto changing your life. This isn’t the\ntypical crypto success story, but I’d say it’s definitely life-changing. I\ndidn’t get in on any ICOs or even buy in at an ideal time. My profits were\ndecent but not huge. I made plenty of mistakes that cost me. (Think…",
  "original_created_utc": 1612435004,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "你们似乎很欣赏加密技术改变生活的故事。这不是\n典型的加密成功故事，但我想说这绝对是改变生活的。I\n没有参与任何ICO，甚至没有在理想的时间买入。我的利润是\n不错，但不是很大。我犯了很多错误，让我付出了代价。(想想...",
      "title": "我还没退休，也买不起豪车，但加密货币支付了我的婚礼费用!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你們似乎很欣賞加密技術改變生活的故事。這不是\n典型的加密成功故事，但我想說這絕對是改變生活的。I\n沒有參與任何ICO，甚至沒有在理想的時間買入。我的利潤是\n不錯，但不是很大。我犯了很多錯誤，讓我付出了代價。(想想...",
      "title": "我還沒退休，也買不起豪車，但加密貨幣支付了我的婚禮費用!"
    }
  ],
  "title": "I’m not retired and I can’t afford a luxury car, but crypto paid for my wedding!",
  "created_utc": 1612478540,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>You guys seem to appreciate stories of crypto changing your life. This isn’t the typical crypto success story, but I’d say it’s definitely life-changing. I didn’t get in on any ICOs or even buy in at an ideal time. My profits were decent but not huge. I made plenty of mistakes that cost me. (Think twice about trying to trade!) From my investment and really just putting my extra money into crypto as savings made my wedding possible. I was actually selling most of my remaining crypto during my honeymoon to cover all of the final bills. It was bitter-sweet to say the least.</p>\n\n<p>It was an interesting journey for sure and I’ll definitely be back at some point.. Although, I think I aged at about 2x the normal rate. Good luck everybody!</p>\n</div><!-- SC_ON -->",
  "score": 230,
  "permalink": "/r/CryptoCurrency/comments/lcczo1/im_not_retired_and_i_cant_afford_a_luxury_car_but/",
  "subreddit": "CryptoCurrency",
  "id": "lcczo1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123193182
}