{
  "author": "AshaiDarkness",
  "original_created_utc": 1632160341,
  "title": "Why are men conditioned to believe that small penises are bad?",
  "created_utc": 1632171207,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve been with my fair share of men, and the ones with small dicks were honestly amazing in bed and I had a lot of fun with them. Yet I was gonna hook up with this one guy who kept making comments about how I shouldn’t expect him to have a big dick and I was turned off, but not because of the dick, it was his attitude and lack of self confidence</p>\n</div><!-- SC_ON -->",
  "score": 125,
  "permalink": "/r/NoStupidQuestions/comments/ps009b/why_are_men_conditioned_to_believe_that_small/",
  "subreddit": "NoStupidQuestions",
  "id": "ps009b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’ve been with my fair share of men, and the ones with small dicks were honestly\namazing in bed and I had a lot of fun with them. Yet I was gonna hook up with\nthis one guy who kept making comments about how I shouldn’t expect him to have a\nbig dick and I was turned off, but not because of the dick,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は今までに色々な男性と付き合ってきましたが、おちんちんが小さい人は正直、ベッドの上では素晴らしくて\nベッドの上では素晴らしく、一緒にいてとても楽しかったです。それなのに、私が付き合おうとしていたのは\nある男性と付き合うことになったのですが、その男性は「彼に大きなチンポを期待してはいけない」と発言し続けていて\nしかし、ある男性と付き合うことになり、その男性は「大きなチンポを期待してはいけない」と発言し続け、私は気が滅入ってしまいました。",
      "title": "なぜ男性は「ペニスが小さいことは悪いことだ」と思い込まされているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我曾经和我的很多男人在一起，那些小鸡鸡的男人说实话，在床上是非常棒的。\n说实话，那些小鸡巴的男人在床上很厉害，我和他们在一起有很多乐趣。然而，我打算勾搭上一个\n有一个人一直在说我不应该期望他有一个大鸡巴，我很反感。\n我被拒之门外，但不是因为他的鸡巴，而是......",
      "title": "为什么男人被调教成认为小阴茎是坏事？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我曾經和我的很多男人在一起，那些小雞雞的男人說實話，在牀上是非常棒的。\n說實話，那些小雞巴的男人在牀上很厲害，我和他們在一起有很多樂趣。然而，我打算勾搭上一個\n有一個人一直在說我不應該期望他有一個大雞巴，我很反感。\n我被拒之門外，但不是因爲他的雞巴，而是......",
      "title": "爲什麼男人被調教成認爲小陰莖是壞事？"
    }
  ]
}