{
  "author": "Reactionaryhistorian",
  "the_new_excerpt": "For those who don't know the Mulakkaram was a Tax that was apparently imposed on\nany lower caste woman in the Kingdom of Tranvancore (present day Kerala) who\nwished to cover her breasts. Apparently it came to an end when a woman chopped\nher breast off and threw it at the taxman. Apparently she is…",
  "original_created_utc": 1615514103,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "对于那些不知道的人来说，Mulakkaram是一种明显的税收，它是对以下人群征收的\n特兰万科王国（今喀拉拉邦）的任何低种姓妇女，如果她们：\n希望覆盖她的乳房。很显然，当一个女人砍了她的胸部后，这一切就结束了\n她的乳房关闭，并把它扔在税务员。显然，她是...",
      "title": "Mulakkaram（乳房税）是否存在，周围的故事是否真实？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對於那些不知道的人來說，Mulakkaram是一種明顯的稅收，它是對以下人羣徵收的\n特蘭萬科王國（今喀拉拉邦）的任何低種姓婦女，如果她們：\n希望覆蓋她的乳房。很顯然，當一個女人砍了她的胸部後，這一切就結束了\n她的乳房關閉，並把它扔在稅務員。顯然，她是...",
      "title": "Mulakkaram（乳房稅）是否存在，周圍的故事是否真實？"
    }
  ],
  "title": "Did the Mulakkaram (breast tax) ever exist and are the stories around it true?",
  "created_utc": 1615528750,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For those who don&#39;t know the Mulakkaram was a Tax that was apparently imposed on any lower caste woman in the Kingdom of Tranvancore (present day Kerala) who wished to cover her breasts. Apparently it came to an end when a woman chopped her breast off and threw it at the taxman. Apparently she is considered something of a martyr to this day. There has even been a movie made about it.</p>\n\n<p>However, I have come across sources online that claim that the tax never existed (or has been grossly taken out of context) and that even high status women in that area went bare breasted as as part of their normal dress and that the story of the protest is a complete myth. The story does seem a bit unbelievable but the sources denying it are rather nationalistic and make me wonder if they are reliable themselves. What is the truth of the matter?</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/m36qh5/did_the_mulakkaram_breast_tax_ever_exist_and_are/",
  "subreddit": "AskHistorians",
  "id": "m36qh5",
  "is_self": true,
  "media": null,
  "is_video": false
}