{
  "author": "moneytobemade8",
  "the_new_excerpt": "As many of you know, the S&P 500 Index is a great way to invest as it reduces\nall your individual stock risk also known as non-systematic risk and we have\nbeen lucky to have had some great years of a strong bull market.\n\nMost professionals don't beat the index and only a select few beat it and…",
  "original_created_utc": 1620245515,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ご存知のように、S&P500インデックスは、非システマティック・リスクとして知られる個々の株式のリスクをすべて軽減してくれるので、投資には最適な方法です。\n非システマティック・リスクとして知られる個々の銘柄のリスクをすべて軽減することができるからです。\nS&P 500インデックスは、非システマティック・リスクと呼ばれる個別銘柄のリスクを軽減する素晴らしい投資方法です。\n\nしかし、ほとんどのプロはインデックスに勝てず、ごく一部のプロだけがインデックスに勝つことができました...",
      "title": "ほとんどがS&P500指数に勝てない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "正如你们中的许多人所知，标准普尔500指数是一种伟大的投资方式，因为它减少了你的所有个人股票风险，也被称为非系统风险。\n你所有的个人股票风险，也被称为非系统性风险。\n我们很幸运地经历了一些强势牛市的大好时光。\n\n大多数专业人士并没有战胜指数，只有少数人战胜了它，并且...",
      "title": "大多数人无法战胜标准普尔500指数"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "正如你們中的許多人所知，標準普爾500指數是一種偉大的投資方式，因爲它減少了你的所有個人股票風險，也被稱爲非系統風險。\n你所有的個人股票風險，也被稱爲非系統性風險。\n我們很幸運地經歷了一些強勢牛市的大好時光。\n\n大多數專業人士並沒有戰勝指數，只有少數人戰勝了它，並且...",
      "title": "大多數人無法戰勝標準普爾500指數"
    }
  ],
  "title": "Most Don't Beat The S&P 500 Index",
  "created_utc": 1620280114,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As many of you know, the S&amp;P 500 Index is a great way to invest as it reduces all your individual stock risk also known as non-systematic risk and we have been lucky to have had some great years of a strong bull market. </p>\n\n<p>Most professionals don&#39;t beat the index and only a select few beat it and the ones who beat it usually don&#39;t beat it the following year. Why would you or me be able to beat the market? The answer is we probably won&#39;t and we are better off just investing in SPY (S&amp;P 500 ETF). </p>\n\n<p>We waste time (our most valuable resource) and money to individually pick stocks and in a lot of cases, we don&#39;t beat the index and sometimes lose money. </p>\n\n<p>One of my favorite investors/teachers  Aswath Damodaran said something along this &quot;I pick stocks because I love the process of looking at companies and analyzing them and in the end if I lose money or do worse than the index, I am fine with that because I did something I loved&quot;.</p>\n\n<p>I pick stocks because I love the process of trying to find &quot;undervalued&quot; stocks and learning more about industries and hoping to make money, but I also own an S&amp;P 500 index. I am okay if I lose money because I knew the risks beforehand. If you don&#39;t like the process of researching or spending time looking at stocks, you are probably better of investing in an index.</p>\n\n<p>Good luck investing</p>\n</div><!-- SC_ON -->",
  "score": 68,
  "permalink": "/r/stocks/comments/n5pc5x/most_dont_beat_the_sp_500_index/",
  "subreddit": "stocks",
  "id": "n5pc5x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380968361
}