{
  "author": "da_pandas",
  "the_new_excerpt": "No one today can look at NFTs today and confidently say 'this is the height of\nwhat NFTs can achieve'. It is without a doubt that the absolute sad state of the\n‘NFT markets’ is nowhere near what they will likely end up becoming, or their\npurposes will evolve into (in terms of application). I find…",
  "original_created_utc": 1615181067,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "今天，没有人可以看着今天的NFTs，并自信地说'这是一个高度的。\n非自由贸易区能够实现的目标'。毋庸置疑的是。\n'NFT市场'与他们最终可能成为的样子相去甚远，或者说他们的。\n目的将演变成（在应用方面）。我发现...",
      "title": "我觉得今天的NFT就是11多年前的BTC。[想法/讨论]"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天，沒有人可以看着今天的NFTs，並自信地說'這是一個高度的。\n非自由貿易區能夠實現的目標'。毋庸置疑的是。\n'NFT市場'與他們最終可能成爲的樣子相去甚遠，或者說他們的。\n目的將演變成（在應用方面）。我發現...",
      "title": "我覺得今天的NFT就是11多年前的BTC。[想法/討論]"
    }
  ],
  "title": "I think NFTs today are what BTC was over a 11 years ago. [Thoughts/Discussion]",
  "created_utc": 1615199541,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>No one today can look at NFTs today and confidently say &#39;this is the height of what NFTs can achieve&#39;. It is without a doubt that the absolute sad state of the ‘NFT markets’ is nowhere near what they will likely end up becoming, or their purposes will evolve into (in terms of application). I find the same parallel between NFTs and BTC in the same way that BTC was once just the way to buy drugs with funny internet money, but has now become possibly a global store of value and payment intermediary (or is at least on the precipice of becoming so). If we take a look at the absolutely sad state of some NFT markets all you will see is tokenized Pepe the Frog after tokenized Pepe the Frog with a large side of blatant intellectual property infringement. Obviously, NFTs are early and yet to find their niche or application, but I still think there are some exciting prospective NFT roads ahead, which if you&#39;re just interested in the tech or are an investor like me I think they offer a really large door for everyone to get some value from. I&#39;ve linked some traditional media articles to demonstrate even large companies are interested in NFTs. What does this mean? Really good uptake. It means that companies are going to pour money into it, get early adaption going, and it means projects can really begin to innovate in new and exciting ways.</p>\n\n<p>&#x200B;</p>\n\n<p>Mark Cuban is not necessarily a ‘crypto’ guy or a maxi but he understands business and I find it interesting how highly he talks of NFTs to the point he is even now suggesting Laker&#39;s tickets might be tokenized.</p>\n\n<p><a href=\"https://www.cnbc.com/2021/03/04/mark-cuban-nft-pricing-will-settle-down-over-time.html\">https://www.cnbc.com/2021/03/04/mark-cuban-nft-pricing-will-settle-down-over-time.html</a></p>\n\n<p>Also, a good article here by Forbes that sort of hints at where companies are going to go with NFTs that could give us some indication of the potential profits that lie ahead for some:</p>\n\n<p><a href=\"https://www.forbes.com/sites/cathyhackl/2021/03/04/four-things-brands-need-to-know-about-nfts-non-fungible-tokens/?sh=2c02d0e6222f\">https://www.forbes.com/sites/cathyhackl/2021/03/04/four-things-brands-need-to-know-about-nfts-non-fungible-tokens/?sh=2c02d0e6222f</a></p>\n\n<p>There are obviously countless projects, but here are a few that people can read about to either learn more or get interested in (from either an investing standpoint or just out of an interest of the potential of NFTs). What excites me is the diversity we are seeing allover the place, and as anyone knows a wide range of diversity and a large melting pot leads to unique and creative ways to do things, and I truly think we will see a much more larger and useful purpose for NFTs down the line that today we can&#39;t really comprehend yet.</p>\n\n<p><strong>Ecomi (OMI):</strong> Partnerships, partnerships, partnerships. If you invest in crypto, this is the day trader’s wet dream; news that is going to drive big spikes in price. And we’re not talking little ones, we’re talking Marvel and other large companies creating virtual NFTs that people can buy and use. The AR element of this is very interesting too. What I like is that they’re not just creating NFTs, or NFTs for AR, they are innovating new ways to enjoy those NFTs in a virtual space with things like showrooms, instead of just digital things you can buy—they want you to interact with and that is a big part of what is going to drive demand (and value in the token/company). I actually think this is a really fun project, and I think it&#39;s going to drive over the barrier people might have into trying to get amongst NFTs.</p>\n\n<p><strong>OpenSea:</strong> Think eBay, but NFTs. Make a custom NFT you want, or of an existing product/IP you have created, and sell it on an open market. OpenSea takes a small fee which goes back to token holders. The beauty of this is you don’t have to be a creator yourself, or if you are a creator you don’t have to be a large one. It’s perfect for people looking for new and unique NFTs from a wide range of creators, and the fact that it’s not just big names like NBA, Marvel, etc means you’re going to find a lot of weird, new and unique ideas and NFTs floating around. I like this because it presents sort&#39;ve a second-hand antique store bargain hunting opportunity where your weird NFT you purchased may just be a dud, or may one day become something immensely valuable (not likely, but who knows!).</p>\n\n<p><strong>SeedSwap:</strong> SeedSwap (SNFT or Seed N Feed Token) is based on a meme from the Simpsons TV show about a shop called Sneed’s. It’s basically a two-second clip that’s never referenced in the show ever again, but is one of the longest-lasting and most popular memes on the 4chan website (a testament to their weirdness). Why would anyone ever be interested in it? NFTs. It is a project that is going to launch an NFT marketplace like OpeanSea, but will also have some innovative staking rewards such as NFTs and NFT discounts based on farming habits which means integrating staking into consuming real products. I like this because 1: meme coins are always undervalued because they are almost always garbage. And, 2: because it is seeking to do something in it&#39;s memeness that&#39;s actually practical, like OpenSea&#39;. This means the difference between its initial ICO value and it&#39;s stable value will be much larger, and better for ROI.</p>\n\n<p>Overall, to be honest, my favourite are NFT based games where you can farm for rewards that can interact with gaming engines simply because I think this is a fun outlet for NFTs that may bring a more mainstream crowd. I think a lot of the public uptake comes from simplicity, and integration into things as simple as mobile games is going to go a long way to making crypto mainstream (and not just on reddit mainstream, I mean really integrated into the world).</p>\n\n<p>&#x200B;</p>\n\n<p>Nonetheless, it seems NFTs are very popular right now for innovation, and I think we are going to see a ton of new ideas and unique purposes for NFTs we can&#39;t even conceive right now, but will later go on to shape the market. If you have any interesting ideas, or seen any unique or interesting NFTs (or even good NFT investments let me know, or if that&#39;s against the rules feel free to PM me).</p>\n</div><!-- SC_ON -->",
  "score": 583,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/j95ksxRmePbCpToEf9fXrIerJGOmLS5ndfyqk4PY8Ro.jpg?auto=webp&s=7a9b8bb71a3d8fb57fec716d66f3c4d52aee48e9",
          "width": 3000,
          "height": 2001
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/j95ksxRmePbCpToEf9fXrIerJGOmLS5ndfyqk4PY8Ro.jpg?width=108&crop=smart&auto=webp&s=adfef1a950fbea33bee5fda076af72bc97ba2754",
            "width": 108,
            "height": 72
          },
          {
            "url": "https://external-preview.redd.it/j95ksxRmePbCpToEf9fXrIerJGOmLS5ndfyqk4PY8Ro.jpg?width=216&crop=smart&auto=webp&s=c46ae0185072c9db41c29d84d63b6b3c1f839ac2",
            "width": 216,
            "height": 144
          },
          {
            "url": "https://external-preview.redd.it/j95ksxRmePbCpToEf9fXrIerJGOmLS5ndfyqk4PY8Ro.jpg?width=320&crop=smart&auto=webp&s=2e52d4b6f9ed964e6b160327910aaba869f8b7e1",
            "width": 320,
            "height": 213
          },
          {
            "url": "https://external-preview.redd.it/j95ksxRmePbCpToEf9fXrIerJGOmLS5ndfyqk4PY8Ro.jpg?width=640&crop=smart&auto=webp&s=04e1b596164b8e8597162127832457c0d4281418",
            "width": 640,
            "height": 426
          },
          {
            "url": "https://external-preview.redd.it/j95ksxRmePbCpToEf9fXrIerJGOmLS5ndfyqk4PY8Ro.jpg?width=960&crop=smart&auto=webp&s=06471ca78e8df8fac39c66cda00b100f339beda6",
            "width": 960,
            "height": 640
          },
          {
            "url": "https://external-preview.redd.it/j95ksxRmePbCpToEf9fXrIerJGOmLS5ndfyqk4PY8Ro.jpg?width=1080&crop=smart&auto=webp&s=c1b2f347ed88f797db6d8a39ce8f3613e0768fa7",
            "width": 1080,
            "height": 720
          }
        ],
        "variants": {},
        "id": "r4BUrEUJiRv4HnMUY7yDCvV8D4hoFi-RbSE03SGPwrg"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/m08oyr/i_think_nfts_today_are_what_btc_was_over_a_11/",
  "subreddit": "CryptoCurrency",
  "id": "m08oyr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542573497
}