{
  "author": "-Taibhse-",
  "original_created_utc": 1636717576,
  "title": "How did poor/delicate health come to be associated with gentility?",
  "created_utc": 1636786421,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>European/British literature of the 1800s seems to depict poor or “delicate” health as a positive trait in upper class women, with consumption/TB in particular appearing to have been almost fashionable. Is this accurate, and if so, how did poor health come to be associated with gentility and/or femininity, and did any particular societal changes lead to it falling out of favour?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/qs9gnb/how_did_poordelicate_health_come_to_be_associated/",
  "subreddit": "AskHistorians",
  "id": "qs9gnb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "European/British literature of the 1800s seems to depict poor or “delicate”\nhealth as a positive trait in upper class women, with consumption/TB in\nparticular appearing to have been almost fashionable. Is this accurate, and if\nso, how did poor health come to be associated with gentility and/or…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1800年代のヨーロッパやイギリスの文学は、健康状態が悪いことや「デリケート」であることを、上流階級の女性のポジティブな特徴として描いているようです。\n上流階級の女性のポジティブな特徴として描かれているようで、消費/TBが\n特にTBの消費はほとんどファッショナブルだったようです。これは正確なのか、もしそうなら\nどのようにして健康状態の悪さが上流階級の女性と結びついたのか、そして...",
      "title": "どのようにして、健康状態の悪さやデリケートさが紳士的なイメージと結びついたのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "19世纪的欧洲/英国文学似乎将健康状况不佳或 \"脆弱 \"描述为上层社会妇女的积极特征。\n健康是上层阶级妇女的一个积极特征，尤其是消费/结核病，似乎是上层阶级妇女的一个积极特征。\n特别是消费/结核病，似乎几乎是一种时尚。这是否准确呢？\n如果是这样，健康状况不佳是如何与绅士风度和/或",
      "title": "糟糕/精致的健康状况是如何与绅士风度联系在一起的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "19世紀的歐洲/英國文學似乎將健康狀況不佳或 \"脆弱 \"描述爲上層社會婦女的積極特徵。\n健康是上層階級婦女的一個積極特徵，尤其是消費/結核病，似乎是上層階級婦女的一個積極特徵。\n特別是消費/結核病，似乎幾乎是一種時尚。這是否準確呢？\n如果是這樣，健康狀況不佳是如何與紳士風度和/或",
      "title": "糟糕/精緻的健康狀況是如何與紳士風度聯繫在一起的？"
    }
  ]
}