{
  "author": "OJ_Simpson420blazeit",
  "original_created_utc": 1628301002,
  "title": "Are women wary of every man when walking on the sidewalk?",
  "created_utc": 1628316801,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m not asking why women are wary and I&#39;m not criticizing them being wary. I recognize you guys go through a lot of bullshit to say the least from creepy predators.</p>\n\n<p>I&#39;m asking this because everytime I go for a walk in my neighborhood, girls seems very wary of me when we are on the same sidewalk walking toward one another. I&#39;m wondering if this is a reaction girls have with every guy or if I&#39;m just creepy looking?</p>\n\n<p>Also, is there anything I can do to look less threatening? Like should I move to the other side of the road on the other sidewalk?</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/TooAfraidToAsk/comments/ozkbda/are_women_wary_of_every_man_when_walking_on_the/",
  "subreddit": "TooAfraidToAsk",
  "id": "ozkbda",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm not asking why women are wary and I'm not criticizing them being wary. I\nrecognize you guys go through a lot of bullshit to say the least from creepy\npredators.\n\nI'm asking this because everytime I go for a walk in my neighborhood, girls\nseems very wary of me when we are on the same sidewalk…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "女性が警戒する理由を聞いているわけではありませんし、警戒することを批判しているわけでもありません。I\nあなた方が不気味な捕食者から、控えめに言っても多くのデタラメを経験していることを認識しています。\nプレデター（捕食者）から、控えめに言っても多くのデタラメを経験していることは認識しています。\n\n私がこの質問をしているのは、私が近所を散歩するたびに、女の子たちが\n私たちが同じ歩道にいるとき、女の子はとても私を警戒しているように見えます。",
      "title": "女性は歩道を歩くとき、すべての男性を警戒しているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不是在问为什么女性会有戒心，我也不是在批评她们有戒心。I\n我承认你们经历了很多废话，至少可以说是来自令人毛骨悚然的\n掠夺者。\n\n我问这个问题是因为每次我去附近散步时，女孩们\n当我们在同一条人行道上时，女孩似乎对我非常警惕......",
      "title": "女人在人行道上行走时，是否对每个男人都有戒心？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不是在問爲什麼女性會有戒心，我也不是在批評她們有戒心。I\n我承認你們經歷了很多廢話，至少可以說是來自令人毛骨悚然的\n掠奪者。\n\n我問這個問題是因爲每次我去附近散步時，女孩們\n當我們在同一條人行道上時，女孩似乎對我非常警惕......",
      "title": "女人在人行道上行走時，是否對每個男人都有戒心？"
    }
  ]
}