{
  "author": "Hunter_Cohen2",
  "the_new_excerpt": "As you probably know, the suez canal is blocked by a fucking huge shipwreck. The\nlast time it was blocked was in 1967. What happened in 1967? Ships heading to\nEurope from Asia had to go around the horn of Africa, adding up to 12,000 miles\nto their journey.\n\nThis meant that the crews had to stop…",
  "original_created_utc": 1616781339,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "你可能知道，苏伊士运河被一艘巨大的沉船堵住了。这个...\n最后一次被封锁是在1967年。1967年发生了什么？前往的船只\n欧洲从亚洲出发，要绕过非洲之角，加起来有一万两千里。\n对他们的旅程。\n\n这意味着船员们不得不停止... ...",
      "title": "那个做空南非股票的家伙就要失去他的小弟弟了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你可能知道，蘇伊士運河被一艘巨大的沉船堵住了。這個...\n最後一次被封鎖是在1967年。1967年發生了什麼？前往的船隻\n歐洲從亞洲出發，要繞過非洲之角，加起來有一萬兩千裏。\n對他們的旅程。\n\n這意味着船員們不得不停止... ...",
      "title": "那個做空南非股票的傢伙就要失去他的小弟弟了。"
    }
  ],
  "title": "That guy who shorted South Africa Stocks is about to lose his tendies",
  "created_utc": 1616807504,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As you probably know, the suez canal is blocked by a fucking huge shipwreck. The last time it was blocked was in 1967. What happened in 1967? Ships heading to Europe from Asia had to go around the horn of Africa, adding up to 12,000 miles to their journey. </p>\n\n<p>This meant that the crews had to stop along the way for fuel and provisions. They stopped at the biggest port in Africa which was in South Africa. Many companies also offloaded goods at a discount in South Africa.</p>\n\n<p>This sent the entire economy of South Africa into hyperdrive. Look at a GDP chart for south africa and you&#39;ll see the huge jump in 1967. Their stock market rallied because of it too.</p>\n\n<p>The same dynamic is playing out today. Suez canal has been blocked for 4 days. It is likely to be blocked for MONTHS. That means a lot of ships will be stopping in South Africa,  sending their economy to the moon for thhe first time since the 1960s.</p>\n\n<p>The guy who was trying to short south Africa ETFs a while back had some solid DD, but the suez canal blockage is about to suck all the money out of his brokerage account. That ship has been there for 4 days and there is no sign that it will be out soon. Most likely it will be MONTHS of losses for him.</p>\n\n<p>Oh yeah, and if I&#39;m wrong? Their stock market is one of the cheapest in the world from a value perspective. AN etf that tracks their stocks Is trading at less than 4x earnings. If youre a boomer, youll love the 5% dividends too.</p>\n\n<p>TL;DR get your south african tendies while they&#39;re hot. I just put in 10k.</p>\n</div><!-- SC_ON -->",
  "score": 5514,
  "permalink": "/r/wallstreetbets/comments/mducpo/that_guy_who_shorted_south_africa_stocks_is_about/",
  "subreddit": "wallstreetbets",
  "id": "mducpo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357147052
}