{
  "author": "cuddly_marshmallow",
  "the_new_excerpt": "I am asking this specifically in regards to skinny-shaming. I see a lot of\npeople talking about how rude it is to draw attention to someone's weight, and\nhow offensive it can be to say something like \"omg you're so skinny! Are you\neating enough? Do you have an eating disorder? Are you anorexic?\" I…",
  "original_created_utc": 1614617221,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我是专门针对瘦身羞辱的问题来问的。我看到很多\n人们谈论如何粗鲁它是如何提请注意别人的体重，和\n多么令人反感的是，它可以说像 \"OMG你是如此瘦弱！\"的东西。你\n吃得够吗？你有饮食失调吗？你有厌食症吗？\" I…",
      "title": "你在羞辱身体和表达对某人健康的关注之间的界限是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是專門針對瘦身羞辱的問題來問的。我看到很多\n人們談論如何粗魯它是如何提請注意別人的體重，和\n多麼令人反感的是，它可以說像 \"OMG你是如此瘦弱！\"的東西。你\n喫得夠嗎？你有飲食失調嗎？你有厭食症嗎？\" I…",
      "title": "你在羞辱身體和表達對某人健康的關注之間的界限是什麼？"
    }
  ],
  "title": "Where do you draw the line between body-shaming and expressing concern about someone's health?",
  "created_utc": 1614657207,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am asking this specifically in regards to skinny-shaming. I see a lot of people talking about how rude it is to draw attention to someone&#39;s weight, and how offensive it can be to say something like &quot;omg you&#39;re so skinny! Are you eating enough? Do you have an eating disorder? Are you anorexic?&quot; I can definitely see how comments like these would hurt someone&#39;s feelings, or at least make them feel very awkward/self-conscious, and often when people say things like this, they don&#39;t even realize how it could make the other person feel, and if confronted, they&#39;ll claim that they were only saying it because they&#39;re concerned about the person&#39;s health (which is often an excuse). </p>\n\n<p>HOWEVER, what if you&#39;ve noticed that someone has lost a significant amount of weight in a relatively short period of time, and you are genuinely worried about them? How do you approach this without offending them? Especially if you suspect that they might have an eating disorder? Honestly, I&#39;d rather express concern to a skinny person who doesn&#39;t actually have an eating disorder and accidentally offend them rather than not reach out to someone who DOES have an eating disorder because I&#39;m too afraid to say something. Eating disorders can be dangerous and even deadly. I&#39;d rather hurt someone&#39;s feelings than let someone die because I didn&#39;t intervene. </p>\n\n<p>I apologize in advance because i know this might be a very controversial topic, but I think it needs to be discussed. To be clear I am in NO WAY condoning body-shaming or any kind of shaming for that matter. Also, I know that some people might say &quot;you shouldn&#39;t bring it up unless they do first&quot; and my counter argument to that would be that when someone is suffering from an eating disorder, they often don&#39;t see themselves or their situation clearly, so they are unlikely to even recognize that there is a problem, let alone reach out and ask for help.</p>\n\n<p>Edit: So basically, I&#39;m not asking whether or not it should be brought up. I think it should be brought up. So rather, I&#39;m asking HOW it should be brought up-- in the healthiest, most constructive, non-offensive way possible?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/lvdxor/where_do_you_draw_the_line_between_bodyshaming/",
  "subreddit": "TooAfraidToAsk",
  "id": "lvdxor",
  "is_self": true,
  "media": null,
  "is_video": false
}