{
  "author": "Phisto1",
  "original_created_utc": 1629458251,
  "title": "Stake BAT to earn BTC – Brave partnered with Axion",
  "created_utc": 1629491925,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In case you are wondering what&#39;s going on in the Brave browser with Axion all over it:</p>\n\n<p>The <strong>B</strong>asic <strong>A</strong>ttention <strong>T</strong>oken finally got a new use case. BAT can now be staked on Axion (AXN) to earn passive income in Bitcoin dividends. The shortest staking period generates a minimum of 8% APY. The longer the staking period, the greater the bonus on the initial stake (up to 20% bonus for a max stake of 15 years) which earns up to 36% APY!</p>\n\n<p>The Bitcoin dividends can be withdrawn any time and AXN dividends are earned along the way.</p>\n\n<p>&#x200B;</p>\n\n<p>Axion is a DeFi project on the Ethereum nework. It allows you to generate passive income with AXN, which will be burnt in exchange for shares from the dividend pool. The staking period could be anything from 1 day to 5555 days. A longer stake gives more bonus shares.</p>\n\n<p>The average stake length is 2547 days with more than 80% of the supply being staked!</p>\n\n<p>&#x200B;</p>\n\n<p>With the new integration not only AXN can be staked but BAT can be used to stake too! BAT will be used to give the equivalent amound of AXN shares in the dividend pool.</p>\n\n<p>&#x200B;</p>\n\n<p>A new loophole for shitposting on CC; earn moons, BAT and BTC. And 1% of the ETH bid is used to plant trees resulting in 2.56M planted trees today</p>\n\n<p><a href=\"https://stake.axion.network/brave\">https://stake.axion.network/brave</a></p>\n</div><!-- SC_ON -->",
  "score": 229,
  "permalink": "/r/CryptoCurrency/comments/p83615/stake_bat_to_earn_btc_brave_partnered_with_axion/",
  "subreddit": "CryptoCurrency",
  "id": "p83615",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In case you are wondering what's going on in the Brave browser with Axion all\nover it:\n\nThe Basic Attention Token finally got a new use case. BAT can now be staked on\nAxion (AXN) to earn passive income in Bitcoin dividends. The shortest staking\nperiod generates a minimum of 8% APY. The longer the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Axionを搭載したBraveブラウザで何が起こっているのか気になる方のために\nを使用しています。\n\nBasic Attention Tokenがついに新しいユースケースを手に入れました。BATはAxion(AXN)に賭けられるようになりました。\nAxion (AXN)でビットコイン配当のパッシブインカムを得ることができます。最短の張り込み期間で\n最低でも8％のAPYを得ることができます。賭け期間が長いほど...",
      "title": "BATを賭けてBTCを稼ぐ-BraveがAxionと提携"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你想知道Axion在Brave浏览器中发生了什么？\n中发生了什么。\n\n基本注意力代币终于有了新的用例。BAT现在可以被押在\nAxion (AXN)来赚取比特币股息的被动收入。最短的赌注\n期产生至少8%的APY。时间越长越好。",
      "title": "投入BAT赚取BTC - Brave与Axion合作"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你想知道Axion在Brave瀏覽器中發生了什麼？\n中發生了什麼。\n\n基本注意力代幣終於有了新的用例。BAT現在可以被押在\nAxion (AXN)來賺取比特幣股息的被動收入。最短的賭注\n期產生至少8%的APY。時間越長越好。",
      "title": "投入BAT賺取BTC - Brave與Axion合作"
    }
  ]
}