{
  "author": "Nuewim",
  "original_created_utc": 1634645736,
  "title": "Investing in crypto in 2010 wasn't safe, it was very risky. Crypto was completly unknown. Most of us would think it is some scam.",
  "created_utc": 1634729616,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>People want to compare modern crypto  investing to investing back in the days when Bitcoin was only crypto, and not even popular one. Problem is that today average investor play safe, when in 2010 they risked a lot. They had no informations, no guides, yt videos or books. Almost no one heard about crypto. They invested in something that most probably could be a scam.</p>\n\n<p>People today want to be rich as early bitcoin investors, but one - they would sell their coins just after x2 x5 or x10. How many of us would wait for coin to do x1000 or x10000? Second - we are mostly investing in safe and already big projects that will never grow a lot.</p>\n\n<p>First crypto investors were nerds that spend time on niche forums. Most of society even most of internet community had no idea about Bitcoin back then. Even If they had most of them were &quot;too smart&quot; to put money in another scam. There were no difference between crypto or other scam advertisements to invest and multiply money. Even after reading whitepaper and Satoshi Nakamoto posts most of us including myself would think it is bullshit. I, like average internet users get few ads about becoming rich by investing, changing world,  getting new job or  horny women in your neighbourhood scams. It was just a luck for early investors crypto wasn&#39;t another scam. And even more luck they were in little minority that heard about it back then.</p>\n\n<p>Completly different situation than today. Now we have knowledge and experience. We can predict  what good project need to succeed. Today those that invested in crypto in 2010 would be called shitcoin investors or gamblers. They risked money on unknown thing. Like shitcoin investors today thay risked a lot. 99,99% of shitcoin investors will never be rich. 0,01% will be lucky to find early  good and solid project that will be in top 10 cryptos. Of course if they will not sell it after just x10 or x100 gains.</p>\n\n<p>To become rich on crypto you need to risk a lot. It is easy to buy Bitcoin, Ethereum or ADA now. It was terribly risky to put money in them when they were worth few cents per coins.</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/qba9hh/investing_in_crypto_in_2010_wasnt_safe_it_was/",
  "subreddit": "CryptoCurrency",
  "id": "qba9hh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "People want to compare modern crypto investing to investing back in the days\nwhen Bitcoin was only crypto, and not even popular one. Problem is that today\naverage investor play safe, when in 2010 they risked a lot. They had no\ninformations, no guides, yt videos or books. Almost no one heard about…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "現代の暗号投資と、ビットコインがただの暗号で人気もなかった時代の投資を比較したがる人がいます。\nビットコインがただの暗号で、しかも人気のあるものではなかった時代の投資と比較したがる。問題は、今日の\n平均的な投資家は安全を心がけていますが、2010年には多くのリスクを冒していました。彼らには\n情報も、ガイドも、YTビデオや本もありませんでした。ほとんど誰も聞いたことがない...",
      "title": "2010年の暗号への投資は安全ではなく、非常にリスクの高いものでした。暗号はまったく知られていませんでした。ほとんどの人が何かの詐欺だと思っていたでしょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "人们想把现代的加密货币投资与当年的投资进行比较\n当比特币只是加密货币，甚至不是流行货币的时候。问题是，今天\n普通投资者玩得很安全，而在2010年，他们冒了很大的风险。他们没有\n信息，没有指南，YT视频或书籍。几乎没有人听说过...",
      "title": "在2010年投资加密货币并不安全，风险很大。当时加密货币完全不为人所知。我们中的大多数人会认为它是一些骗局。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "人們想把現代的加密貨幣投資與當年的投資進行比較\n當比特幣只是加密貨幣，甚至不是流行貨幣的時候。問題是，今天\n普通投資者玩得很安全，而在2010年，他們冒了很大的風險。他們沒有\n信息，沒有指南，YT視頻或書籍。幾乎沒有人聽說過...",
      "title": "在2010年投資加密貨幣並不安全，風險很大。當時加密貨幣完全不爲人所知。我們中的大多數人會認爲它是一些騙局。"
    }
  ]
}