{
  "author": "mm_mk",
  "the_new_excerpt": "Just a pharmacist and casual trader so take my opinion with a lot of salt.\n\n 1. Positions 1x 2.5c 12/2021, 402 shares at 2.79\n\nSENS makes a soon to be approved 180 day implantable glucose monitor\n\nIt just had a trial that was positive and will likely gain approval later this\nyear.\n\nIn the pharmacy…",
  "original_created_utc": 1623374746,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は薬剤師であり、カジュアルなトレーダーでもあるので、私の意見は大目に見てください。\n\n 1. ポジションは1x 2.5c 12/2021、2.79で402株。\n\nSENSは、間もなく承認されるであろう180日間の埋め込み型血糖値モニターを製造している。\n\n肯定的な試験が行われたばかりで、今年の後半には承認されるだろう。\n今年後半には承認されるだろう。\n\n薬局では...",
      "title": "SENS（DD）です。潜在的な巨人の誕生"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我只是一个药剂师和临时交易员，所以对我的意见要多加注意。\n\n 1. 仓位1x 2.5c 12/2021, 402股，价格2.79\n\nSENS公司生产的180天植入式血糖监测仪即将获批。\n\n它刚刚进行了一项试验，结果是积极的，并可能在今年晚些时候获得批准。\n今年晚些时候获得批准。\n\n在药房里...",
      "title": "SENS（DD）。潜在的巨人正在形成"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我只是一個藥劑師和臨時交易員，所以對我的意見要多加註意。\n\n 1. 倉位1x 2.5c 12/2021, 402股，價格2.79\n\nSENS公司生產的180天植入式血糖監測儀即將獲批。\n\n它剛剛進行了一項試驗，結果是積極的，並可能在今年晚些時候獲得批准。\n今年晚些時候獲得批准。\n\n在藥房裏...",
      "title": "SENS（DD）。潛在的巨人正在形成"
    }
  ],
  "title": "SENS (DD). Potential giant in the making",
  "created_utc": 1623385893,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Just a pharmacist and casual trader so take my opinion with a lot of salt. </p>\n\n<ol>\n<li>Positions 1x 2.5c 12/2021, 402 shares at 2.79 </li>\n</ol>\n\n<p>SENS makes a soon to be approved 180 day implantable glucose monitor </p>\n\n<p>It just had a trial that was positive and will likely gain approval later this year. </p>\n\n<p>In the pharmacy world, we have contracts given to us by Medicare that involve contacting patients and completing tasks. </p>\n\n<p>For diabetic patients, continuous glucose monitoring is pushed for heavily in these contracts. </p>\n\n<p>Currently on market, there is freestyle libre (sensor changed every 2 weeks). Market cap 195bn... Bad comp cuz abbot does a lot of other things. </p>\n\n<p>Dexcom is the closest comp, they have a *edit 10 day continuous monitor as their main product.\nMarket cap for dexcom is 37.9 bn. Stock price is currently 398$ </p>\n\n<p>Pre approval (3/28/2018) dexcom traded at 74.16\nWithin a year it was at 119$ \nIn 2020 it was 262.96 on that day\nThis year it was at 352.73$ on march 26th.... Growth was massive once adoption started. </p>\n\n<p>SENS is currently trading at 3.78$. with a market cap at 1bn... </p>\n\n<p>SENS has an arguably superior product than either of it&#39;s 2 main competitors. It will gain FDA approval this year most likely (covid delayed it&#39;s schedule). </p>\n\n<p>180 day implantable is huge from a patient and doctor burden standpoint. Also, it fits well with medicare&#39;s appointment mandate schedule. The product is going to crush the market space it is entering. </p>\n\n<p>I don&#39;t think it&#39;s a short squeeze play, but it does have 25% short interest, which could be interesting if it starts to gain more traction pre approval. FDA approval date could trap anyone left shorting it still</p>\n\n<p>I think, as a lotto ticket in this casino it could have massive upside, with very minimal downside. Even if adoption is slow or low, it&#39;s priced so low it should be near a floor. Even if it eats up a quarter of it&#39;s competitors market cap (which it should since it&#39;s product is better), it a 10x gainer..</p>\n</div><!-- SC_ON -->",
  "score": 48,
  "permalink": "/r/stocks/comments/nx3z08/sens_dd_potential_giant_in_the_making/",
  "subreddit": "stocks",
  "id": "nx3z08",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009743447
}