{
  "author": "bowie9191",
  "original_created_utc": 1655398515,
  "title": "Why is this so profound?",
  "created_utc": 1655436237,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have been studying bitcoin for several months now trying to find any evidence or flaw in the design and history of this technology. The further you go down the rabbit hole, the more certain you become that BTC has the potential to change every facet of our current society and culture. The consequences of ingrained unquestioning of the monetary system has been all that we know. Repeated cycles of boom and bust whereas each bust is a bit worst than the previous one. Crisis after crisis, we find a way to generate more credit and kickstart the boom cycle to avoid short term pain and systemic collapse. &lt;/p&gt;\n\n&lt;p&gt;We have existed only knowing an inflationary way of doing things. More credit, more consumption, and more capital that constantly loses its purchasing power are all supposedly the signs of a healthy economy? How come we assume as truth that a 2% inflation target is what a healthy economy needs? Are we really that confident deflationary capital that incentivizes us to save rather than spend, would surely be the downfall of our global economy? &lt;/p&gt;\n\n&lt;p&gt;We cant conceive of a deflationary reality because we assume that monetary technology and systems never can or will change. &lt;/p&gt;\n\n&lt;p&gt;Modern economics has neglected the very fabric of the system in which it attempts to model and predict. This is akin to a marine biologist studying all the different ways in which fish interact and behave while never even for a fucking second asking what is water. The degenerate economist will never question money itself, it will only ever question the ways in which we distribute and allocate that money. Couldn&amp;#39;t the nature of the money be the problem? Could this nature dictate how we deal with policy and economic issues in ways we are not even fully conscious of?&lt;/p&gt;\n\n&lt;p&gt;What if money had no centralized entity that could arbitrarily decide supply, or if there was no centralized authority deciding who gets a loan and who does not?&lt;/p&gt;\n\n&lt;p&gt;BTC does not care if you are black, white, woman, man, republican, democrat, liberal, conservative. BTC represents a different future. I am still unsure of the outcome, but it must surely be better than this slow decay. Why not at least try to operate differently? Let us return to human creativity and ingenuity to propel us forward. We are explorers by nature and this pursuit is too critical to not adventure in. &lt;/p&gt;\n\n&lt;p&gt;What we are currently in is late stage fiat degenerate capitalism. What if there was a pure form of capitalism whereas it merely served as a stage for ideas to flourish and compete with one another? Without the pressures and incentives of profit but with the incentives of aesthetics and creation? &lt;/p&gt;\n\n&lt;p&gt;What if there was a way to buy more time so we as humans can focus on these ventures? What if the money we held, grew in value, and not diminished in value? Coupling this capital with the natural deflationary pressures of technological advancement could certainly propel us to a new age no? An age characterized by having more time and less things. An age characterized by incentivizing long term value creation as opposed to short term gain. Those willing to take risk and be capitalists would be able to do so without fucking someone over that chose not to take that risk. &lt;/p&gt;\n\n&lt;p&gt;If you go deep enough, you seize to be political because left and right become the same. Each side appealing to their respective pathos while ignoring the underlying systemic issue. Frank Zappa said it best: Politicians are the entertainment division of industry. When industry is placed in a system that incentivizes short time horizons and an inflationary spirit, industry and thereby its politicians will advocate for short term relief (either through social program spending or through less spending and less taxes). &lt;/p&gt;\n\n&lt;p&gt;BTC has the potential to restructure our power dynamics and greatly equalize the playing field. Will there be early winners (mostly us who &amp;quot;invested&amp;quot; in this)? Sure. But could this greatly benefit humanity in ways we cant even conceive of yet? Yes. &lt;/p&gt;\n\n&lt;p&gt;Sorry for the rambling thoughts. BTC is more than a speculative vehicle. It represents a tiny glimmer of hope in a very fucked up world&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 324,
  "permalink": "/r/Bitcoin/comments/vdqi56/why_is_this_so_profound/",
  "subreddit": "Bitcoin",
  "id": "vdqi56",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I have been studying bitcoin for several months now trying to find any evidence\nor flaw in the design and history of this technology. The further you go down\nthe rabbit hole, the more certain you become that BTC has the potential to\nchange every facet of our current society and culture. The…"
}