{
  "author": "Two_Pickachu_One_Cup",
  "original_created_utc": 1648076652,
  "title": "Russia has just announced unfriendly countries such as the US will have to pay for Russian gas in Shiba Inu",
  "created_utc": 1648114292,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As the Russian Rouble has collapsed and entered into a period of &amp;#39;unprecedented volatility&amp;#39; it is rumoured that uncle Vlad has turned to the next best thing. Shiba Inu.&lt;/p&gt;\n\n&lt;p&gt;In his official statement to the Russian press Vlad said &amp;quot;my advisers say the Rouble is basically a shitcoin at this point. Whatever that means. So i asked them to DYOR. They reported back that they found the perfect solution. Shiba Inu. Whilst they say Shiba is the true shitcoin of the crypto world, apparently it is the second most volatile currency other than the Rouble. So it&amp;#39;s basically an upgrade to the Rouble. As they say, a better shitcoin is better than a shitcoin&amp;quot;!&lt;/p&gt;\n\n&lt;p&gt;After the announcement, Shiba Inu has shot up 3000 percent finally proving 14 year old kids right that Shib has mooned to a dollar.&lt;/p&gt;\n\n&lt;p&gt;The world is now coming to terms with the fact red bull chugging 14 year olds now control 95 percent of the world&amp;#39;s wealth.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 333,
  "permalink": "/r/CryptoCurrency/comments/tljvsr/russia_has_just_announced_unfriendly_countries/",
  "subreddit": "CryptoCurrency",
  "id": "tljvsr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "As the Russian Rouble has collapsed and entered into a period of 'unprecedented\nvolatility' it is rumoured that uncle Vlad has turned to the next best thing.\nShiba Inu.\n\nIn his official statement to the Russian press Vlad said \"my advisers say the\nRouble is basically a shitcoin at this point.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ロシア・ルーブルが暴落し、「未曾有の時代」に突入したため\n揮発性」であることから、ブラドおじさんは次善の策に出たと噂されています。\n柴犬だ。\n\nロシアの報道機関に対する公式声明の中で、ウラジは「私のアドバイザーによれば\nルーブルは今、基本的にクソコインなんだ......。",
      "title": "ロシアは、米国などの非友好的な国がロシアのガスを柴犬に支払わなければならないと発表したばかりだ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "由于俄罗斯卢布已经崩溃，并进入了一个 \"前所未有的波动 \"时期。\n据传言，弗拉德叔叔已经转向下一个最好的东西。\n柴犬。\n\n在他对俄罗斯媒体的正式声明中，弗拉德说：\"我的顾问们说，卢布基本上是一个狗屎币。\n在这一点上，卢布基本上是一个狗屎币....",
      "title": "俄罗斯刚刚宣布，美国等不友好的国家将不得不为俄罗斯的天然气支付芝罘区。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "由於俄羅斯盧布已經崩潰，並進入了一個 \"前所未有的波動 \"時期。\n據傳言，弗拉德叔叔已經轉向下一個最好的東西。\n柴犬。\n\n在他對俄羅斯媒體的正式聲明中，弗拉德說：\"我的顧問們說，盧布基本上是一個狗屎幣。\n在這一點上，盧布基本上是一個狗屎幣....",
      "title": "俄羅斯剛剛宣佈，美國等不友好的國家將不得不爲俄羅斯的天然氣支付芝罘區。"
    }
  ]
}