{
  "author": "pear-a-normal",
  "the_new_excerpt": "I don't wish to be disrespectful. I've known this person pretty much all my\nlife. I know they want to \"come out\" to me officially when I'm there, so I know\nthe conversation about the transitioning will be expected.\n\nPersonally, I have zero concerns or issues with them transitioning, all power…",
  "original_created_utc": 1611058892,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我不想对你不敬。我认识这个人几乎所有我的\n的生活。我知道他们想在我去的时候正式向我 \"出柜\"，所以我知道\n关于转型的谈话将被期待。\n\n就我个人而言，我对他们的转型没有任何担忧和问题，所有的权力... ...",
      "title": "我将在几周内看到一个家庭的mtf朋友，这是他们转型以来的第一次。有什么好的技巧，第一次出来见面？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不想對你不敬。我認識這個人幾乎所有我的\n的生活。我知道他們想在我去的時候正式向我 \"出櫃\"，所以我知道\n關於轉型的談話將被期待。\n\n就我個人而言，我對他們的轉型沒有任何擔憂和問題，所有的權力... ...",
      "title": "我將在幾周內看到一個家庭的mtf朋友，這是他們轉型以來的第一次。有什麼好的技巧，第一次出來見面？"
    }
  ],
  "title": "I will be seeing a mtf friend of the family in a few weeks for the first time since they transitioned. What are some good tips for the first coming-out meet up?",
  "created_utc": 1611090223,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I don&#39;t wish to be disrespectful. I&#39;ve known this person pretty much all my life. I know they want to &quot;come out&quot; to me officially when I&#39;m there, so I know the conversation about the transitioning will be expected. </p>\n\n<p>Personally, I have zero concerns or issues with them transitioning, all power to them. However I know that there&#39;s alot of things I could potentially say that may offend them. </p>\n\n<p>Of course every person is different, and what offends one person may not offend another, but what are some good general tips to make them feel comfortable and welcomed when they come out to me?</p>\n\n<p>So far I&#39;m planning on:</p>\n\n<ul>\n<li><p>listening first and talking second</p></li>\n<li><p>asking what pronouns they prefer</p></li>\n</ul>\n\n<p>-asking their new name (I know it already but I&#39;d like to give them the opportunity to tell me themselves)</p>\n\n<p>But that only covers like twenty seconds of conversation </p>\n\n<p>Also, usually I am the kind of person to make casual jokes. Is there anything specific I should avoid?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/l0islo/i_will_be_seeing_a_mtf_friend_of_the_family_in_a/",
  "subreddit": "NoStupidQuestions",
  "id": "l0islo",
  "is_self": true,
  "media": null,
  "is_video": false
}