{
  "author": "MAGICwhiteMICE",
  "original_created_utc": 1625594182,
  "title": "Does anyone else ever get scared transferring coins from a exchange or back onto a exchange thinking your going to fuck it up and just send all your tasty cryptos into the abyss",
  "created_utc": 1625603841,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>When I send my cryptos too or from a exchange I always get scared that I have or will somehow mess it up and send all my stuff into the abyss to never be seen again. I know there are people out there who have done it and iam a pritty unlucky individual in some ways and feel like eventually this could be me. Staring at the wallet and it not turning up after a few seconds really get the paranoia going lol.</p>\n</div><!-- SC_ON -->",
  "score": 315,
  "permalink": "/r/CryptoCurrency/comments/of0a3b/does_anyone_else_ever_get_scared_transferring/",
  "subreddit": "CryptoCurrency",
  "id": "of0a3b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "When I send my cryptos too or from a exchange I always get scared that I have or\nwill somehow mess it up and send all my stuff into the abyss to never be seen\nagain. I know there are people out there who have done it and iam a pritty\nunlucky individual in some ways and feel like eventually this…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "クリプトを取引所に送ったり、取引所からクリプトを受け取ったりするとき、私はいつも自分が失敗したのではないか、あるいは失敗して自分のクリプトを奈落の底に落としてしまうのではないかと不安になる。\nしてしまうのではないかという不安に駆られ、自分の財産を奈落の底に\nと思ってしまいます。それを成し遂げた人たちがいることは知っていますが、私はいくつかの点で非常に不運な人間です。\n私はある意味では不運な人間であり、最終的にはこのように感じています...。",
      "title": "コインを取引所から移動したり、取引所に戻したりするときに、失敗してせっかくのクリプトを奈落の底に落としてしまうのではないかと怖くなったことがある人はいませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当我向交易所发送我的加密货币时，我总是害怕我有或\n会以某种方式把它弄乱，并把我所有的东西送入深渊，再也看不到了\n再也看不到了。我知道有一些人已经做到了，我是一个很好的人。\n在某些方面，我是一个非常不幸的人，感觉最终会这样......",
      "title": "有没有人在从交易所转币或转回交易所时感到害怕，认为自己会搞砸，并将你所有美味的加密货币送入深渊。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當我向交易所發送我的加密貨幣時，我總是害怕我有或\n會以某種方式把它弄亂，並把我所有的東西送入深淵，再也看不到了\n再也看不到了。我知道有一些人已經做到了，我是一個很好的人。\n在某些方面，我是一個非常不幸的人，感覺最終會這樣......",
      "title": "有沒有人在從交易所轉幣或轉回交易所時感到害怕，認爲自己會搞砸，並將你所有美味的加密貨幣送入深淵。"
    }
  ]
}