{
  "approved_at_utc": null,
  "subreddit": "wallstreetbets",
  "selftext": "This is somewhat in reaction to the loss posts I keep seeing on WSB going from 10s or 100s of thousands of dollars to nothing. I know how it feels, I've been there multiple times. It can be devastating but you can survive and thrive after it. This is not investment advice, it is simply my story and the lessons I learned so far.\n\n**The Story**\n\nI got wiped out 3 times in my trading career. The first time it happens is absolutely devastating. I'm  a loser, you think. I'm an idiot, how did I let this happen?? Maybe trading stocks is not for me... should I quit? I need to make it back before I quit! I've experience all of these thoughts.\n\n**First Wipe Out**\n\nMy first wipe out was 30K to 7K in my first year trading penny stocks. I had never traded prior to that, only held investments. I actually had 10K of my brother's money that I managed for him included in that 30K. Which I paid back in full to him without telling him about how  much I had lost. Because :\n\n1- I felt completely ashamed of my self.\n\n2- He was about to get married and I wasn't about to do this to him.\n\nSo I paid him back his 10K in full and told him that we broke even. This was akin to trading on margin, because even though I went from 30K to 7K it was similar to getting margin called and ending up owing the broker. The only difference is I owed my brother. Paying him back the 10K meant that I had to start over completely.\n\nThankfully I had enough saved up to be able to pay him back without withdrawing the 7K in my account. About 3 years later I turned that 7K to 240K also trading penny stocks, but with a different strategy. It took me 3 years to go from a significant loss to a significant win. I can't really discuss the winning positions  because it involved 3 different penny stocks, which are not allowed on WSB. Funnily enough I did post about the biggest winner of the 3,  literally one day before it broke out and ran 1500% right here on WSB and the post was taken down. ( didn't know penny stocks weren't allowed on the sub up until then )\n\n**First Wipe Out Lessons Learned**\n\n1-  Don't chase penny stocks , or any stock for the matter. If you miss an opportunity that's okay, there will literally be hundreds of other opportunities. Don't chase and you won't get burned. You will thank yourself later.\n\n2- Instead of chasing, do your DD to catch the rally before it happens. This is much much harder but is the right way to go about it.\n\n**Second Wipe Out**\n\nI  stopped following my winning strategy because we were in a bubble and everything had ran up and my strategy at the time relied on penny stock rallies and pretty much all of the penny stocks I was watching had already run up well beyond my price targets.\n\nThis  led me to alter my strategy and I did so without properly testing it,  one of the many mistakes I made at the time. This led me to making a string of bad trades, my 240K had gone down to 140K and unfortunately it was after this point that I had gotten into options.\n\nThis was during the March 2021 Nasdaq sell off. I thought surely this was the crash, we had crazy meme stocks and a massive bubble had formed and I  thought this must be the end. So I looked for ways to try and profit  off the upcoming crash that I believed was coming and that's when I  discovered using options as an alternative to shorting. Which -- referring to shorting -- I viewed to be extremely risky and downright immoral.\n\nI didn't quite understand macroeconomics very well at the time and wasn't paying attention to the fed. I was doing my technical analysis in a vacuum of the economic fundamentals and was going off gut feeling. I thought what's better than to buy puts on the most illogical rally of all time,  Gamestop and that's when I took the ill-fated trade that wiped me out.\n\nAt the time I did not consider 240K -&gt; 140K a wipe out, because  remember I had grown 7K into 140K. That was a lot of money.\n\nI put 50K toward shorting the small hypergrowth stocks that shot up during the late 2020 craze with put options and had gotten sloppy with my entries and exits and let more &amp; more emotions drive my trading, losing discipline at a critical time in the market. Most importantly, I was a brand new options trader &amp; did not understand the fundamentals of theta decay or implied volatility. I was often right about the direction of the trade but I didn't know enough about option greeks to employ the proper options strategy. Eventually the market makers slowly took my 50K through theta decay.\n\nAt the same time I was doing that I made a huge bet against Gamestop. I bought 90K worth of put options viewing this as a 2000 style bubble and was certain we were crashing. Again not realizing that this was going to be a very slow and long bleed out and yet again market makers bled me out. When all was said and done, my entire portfolio had collapsed to 10K.\n\n**Second Wipe Out Lessons Learned**\n\n1- Even if you're right on the direction and timing of a trade you can and will still lose money if you don't understand the fundamentals of options contracts and know your greeks.\n\n2- The market can remain irrational longer than you can remain solvent. We never got a 2000-style crash in most meme stocks until a year later.  Instead, it was just a slow bleed out.\n\n3- NEVER bet against the apes. Instead, become one.\n\n**Third Wipe Out**\n\nThis is a well documented one. I had posted about it here on WSB.[https://www.reddit.com/r/wallstreetbets/comments/pcuwrl/10k\\_to\\_110k\\_to\\_1k\\_in\\_35\\_days/](https://www.reddit.com/r/wallstreetbets/comments/pcuwrl/10k_to_110k_to_1k_in_35_days/)\n\nI  managed to take that 10K to 110K with a very well timed call on AMD and ended up losing all of it on a SPY put.  Going from 10K to 110K to 1K  in 35 days. I didn't quite understand how I made this mistake until I thought quite hard about it. And here's what happened.\n\nAfter the winning AMD trade I moved to COIN. I was very bullish on 'that market' and wanted to take an options position in COIN. I tried to time this trade well, and I think I did. But I still managed to lose some money. I bought leap options on COIN, so my position wouldn't get eaten way due to theta decay. COIN had earnings coming in soon and the stock pulled back after the earnings, the combination of the stock pulling back and the implied volatility dropping took my 110K position  down to 66K.\n\nI was still very  bullish on \"that market\" but I wanted to make that money back quickly so I can  double my call position. So I sold out of the position and was looking to short the SPY because at the time the market had this very obvious  mid-month decline that came in every month very consistently around the monthly options expiration date. So I bought daily puts on the $SPY the  same day it put in its monthly top and the market started moving down and my puts were making a profit.\n\nI was waiting for my position to make enough of a profit to take me back to 110K ( first mistake ). The market ended up making a u-turn after the early morning sharp sell off. The next 6 hours were the strongest performing for the market in the whole month and as the market continued to rip I continued to hold. Believing that this is a fake out. I was conditioned from my penny stock days to hold through volatility. I was psychologically adept to seeing massive losses turn into massive wins. Of course this is a great investment mindset but a deadly one for something that loses value to theta decay every second.\n\nWell,  turns out I was right and it was a fake out, because the very next day the market went on to begin its monthly mid-month slump and put on a big 3-day decline. But that didn't matter, I had bought daily options that expired the same day. I held on to those options believing it was a fake out. I held on for far too long unfortunately and did not end up closing the position until it had shrunk from 66K to 7K.\n\n**Third Wipe Out Lessons Learned &amp; Overall Takeaway**\n\n1- Don't be retarded and trade a full sized position with short-dated  options on anything. You can be 99% right on the direction and the timing but that 1% will wipe you out.\n\nI eventually made it all back and then some with a few well-timed options  \\~1000% trades on AMD, COIN &amp; NVDA in October. And my longer term, well timed AMD options trade ended up saving my ass.\n\n&amp;#x200B;\n\n**TLDR TLDR TLDR TLDR TLDR TLDR TLDR ( TLDR Stars here )**\n\n&amp;#x200B;\n\n**My lessons to myself &amp; TLDR**\n\nTLDR : I got wiped out 3 times.\n\n1-30K to -3K ( yes went negative).\n\n2- 240K to 10K.\n\n3- 110K to 1K.\n\nPeak to trough I went from 240K to 1K throughout my last 2 blow ups.\n\nI survived all of them and came out the other end with profits. These are the lessons I learned.\n\n1- It's common for great traders and entrepreneurs ( not talking about me ) to experience failure repeatedly when they start out and some get wiped out multiple times before becoming sustainably profitable. Just because you got wiped out, it doesn't mean that you can't become a profitable trader, as long as you learn from your mistakes.\n\n2- Avoid debt whenever you can and if you decide to take on debt think about the possibility of losing that entire position. If you can live with that go for it, if you can't then don't do it. ( The lesson of taking on the responsibility of investing my borther's 10K )\n\n3- Learn from every major loss to find out what led you to it and try not to repeat that mistake again. Think of it like a pro athlete! The GOATS watched their own matches, the wins and losses, to learn and improve.  Apply the same.\n\n4- Test your strategy with paper-trading before you use real money. This is what I did after my penny stock chasing led to my first wipe out. I  paper-traded 15 different penny stocks, 10 of them ended up making 300%+  profits before I actually started applying this strategy to the remaining 5 in my real account. All 15 ended up being multibaggers, so I knew I was onto something.\n\n5- Understand your risk, if you don't understand your risk your losses will  be much greater than you are willing to accept. I didn't take into account the amount of risk I was taking on trading that 0DTE SPY put. I only thought about wanting to take my 66K back to 110K, thinking it was an easy trade. If you understand  your risk, you pretty much know how much you can and will likely lose on  your trade before taking it and this will help you make  better trades  and cope with the losses and accept them.\n\n7- Finally,  don't despair. The first wipe out is always the worst. But when I got  through it and made it all back I knew I would be okay. It's like going through your first ever breakup or living through major trauma and coming out okay the other side. The first one is always the worst. Make no mistake, a wipe out is major trauma, you have to push through and persevere.\n\nIt's not the end of  your trading career. You will recover from this, be patient,  use the time to improve your understanding of the market and hone your strategies and skills.\n\nWhoever made it to the end. Thank you for reading!\n\n\\*\\***UPDATE**:\\*\\*\n\nThis post is blowing up faster than my accounts did! Thank you for taking the time to read my story!\n\nThere's some amazing advice in the comments that I would like to highlight.\n\n**My income**\n\nAt the time of the first wipe out I was making minimum wage. I'm now 30 years old and make a high 5 figure salary.\n\n**Taxes**\n\nI didn't talk about taxes because I'm not American and don't have capital gains taxes. BUT it is absolutely crucial to talk about taxes. If I had withdrawn some profits after every winning trade to cover taxes + put some money away for a rainy day that would've probably saved me so much pain.\n\n**DD**\n\nDue diligence is probably the most important thing you can do before you enter any trade. It will help you quantify your risk and your reward and will also significantly increase conviction in your position. High conviction can be a double edged sword though, because it can lead you to hold onto losing trades. So balancing high conviction with proper risk management like using stop losses, position sizing and hedging can be pertinent. You will always have to fight your emotions as a trader. The smaller your position is the easier it is to fight your emotions and stick to your rules. That's been my experience at least.",
  "author_fullname": "t2_wllmg",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "I blew up my account 3 times ( 240K to 1K ), survived &amp; became profitable - These are the lessons I learned so far",
  "link_flair_richtext": [
    {
      "e": "text",
      "t": "Discussion"
    }
  ],
  "subreddit_name_prefixed": "r/wallstreetbets",
  "hidden": false,
  "pwls": 7,
  "link_flair_css_class": "question",
  "downs": 0,
  "thumbnail_height": null,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_wnm1nr",
  "quarantine": false,
  "link_flair_text_color": "light",
  "upvote_ratio": 0.95,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 1093,
  "total_awards_received": 23,
  "media_embed": {},
  "thumbnail_width": null,
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Discussion",
  "can_mod_post": false,
  "score": 1093,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "self",
  "edited": 1660428133,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {
    "gid_1": 6
  },
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1660417495,
  "link_flair_type": "richtext",
  "wls": 7,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.wallstreetbets",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is somewhat in reaction to the loss posts I keep seeing on WSB going from 10s or 100s of thousands of dollars to nothing. I know how it feels, I&amp;#39;ve been there multiple times. It can be devastating but you can survive and thrive after it. This is not investment advice, it is simply my story and the lessons I learned so far.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The Story&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I got wiped out 3 times in my trading career. The first time it happens is absolutely devastating. I&amp;#39;m  a loser, you think. I&amp;#39;m an idiot, how did I let this happen?? Maybe trading stocks is not for me... should I quit? I need to make it back before I quit! I&amp;#39;ve experience all of these thoughts.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;First Wipe Out&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;My first wipe out was 30K to 7K in my first year trading penny stocks. I had never traded prior to that, only held investments. I actually had 10K of my brother&amp;#39;s money that I managed for him included in that 30K. Which I paid back in full to him without telling him about how  much I had lost. Because :&lt;/p&gt;\n\n&lt;p&gt;1- I felt completely ashamed of my self.&lt;/p&gt;\n\n&lt;p&gt;2- He was about to get married and I wasn&amp;#39;t about to do this to him.&lt;/p&gt;\n\n&lt;p&gt;So I paid him back his 10K in full and told him that we broke even. This was akin to trading on margin, because even though I went from 30K to 7K it was similar to getting margin called and ending up owing the broker. The only difference is I owed my brother. Paying him back the 10K meant that I had to start over completely.&lt;/p&gt;\n\n&lt;p&gt;Thankfully I had enough saved up to be able to pay him back without withdrawing the 7K in my account. About 3 years later I turned that 7K to 240K also trading penny stocks, but with a different strategy. It took me 3 years to go from a significant loss to a significant win. I can&amp;#39;t really discuss the winning positions  because it involved 3 different penny stocks, which are not allowed on WSB. Funnily enough I did post about the biggest winner of the 3,  literally one day before it broke out and ran 1500% right here on WSB and the post was taken down. ( didn&amp;#39;t know penny stocks weren&amp;#39;t allowed on the sub up until then )&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;First Wipe Out Lessons Learned&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;1-  Don&amp;#39;t chase penny stocks , or any stock for the matter. If you miss an opportunity that&amp;#39;s okay, there will literally be hundreds of other opportunities. Don&amp;#39;t chase and you won&amp;#39;t get burned. You will thank yourself later.&lt;/p&gt;\n\n&lt;p&gt;2- Instead of chasing, do your DD to catch the rally before it happens. This is much much harder but is the right way to go about it.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Second Wipe Out&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I  stopped following my winning strategy because we were in a bubble and everything had ran up and my strategy at the time relied on penny stock rallies and pretty much all of the penny stocks I was watching had already run up well beyond my price targets.&lt;/p&gt;\n\n&lt;p&gt;This  led me to alter my strategy and I did so without properly testing it,  one of the many mistakes I made at the time. This led me to making a string of bad trades, my 240K had gone down to 140K and unfortunately it was after this point that I had gotten into options.&lt;/p&gt;\n\n&lt;p&gt;This was during the March 2021 Nasdaq sell off. I thought surely this was the crash, we had crazy meme stocks and a massive bubble had formed and I  thought this must be the end. So I looked for ways to try and profit  off the upcoming crash that I believed was coming and that&amp;#39;s when I  discovered using options as an alternative to shorting. Which -- referring to shorting -- I viewed to be extremely risky and downright immoral.&lt;/p&gt;\n\n&lt;p&gt;I didn&amp;#39;t quite understand macroeconomics very well at the time and wasn&amp;#39;t paying attention to the fed. I was doing my technical analysis in a vacuum of the economic fundamentals and was going off gut feeling. I thought what&amp;#39;s better than to buy puts on the most illogical rally of all time,  Gamestop and that&amp;#39;s when I took the ill-fated trade that wiped me out.&lt;/p&gt;\n\n&lt;p&gt;At the time I did not consider 240K -&amp;gt; 140K a wipe out, because  remember I had grown 7K into 140K. That was a lot of money.&lt;/p&gt;\n\n&lt;p&gt;I put 50K toward shorting the small hypergrowth stocks that shot up during the late 2020 craze with put options and had gotten sloppy with my entries and exits and let more &amp;amp; more emotions drive my trading, losing discipline at a critical time in the market. Most importantly, I was a brand new options trader &amp;amp; did not understand the fundamentals of theta decay or implied volatility. I was often right about the direction of the trade but I didn&amp;#39;t know enough about option greeks to employ the proper options strategy. Eventually the market makers slowly took my 50K through theta decay.&lt;/p&gt;\n\n&lt;p&gt;At the same time I was doing that I made a huge bet against Gamestop. I bought 90K worth of put options viewing this as a 2000 style bubble and was certain we were crashing. Again not realizing that this was going to be a very slow and long bleed out and yet again market makers bled me out. When all was said and done, my entire portfolio had collapsed to 10K.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Second Wipe Out Lessons Learned&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;1- Even if you&amp;#39;re right on the direction and timing of a trade you can and will still lose money if you don&amp;#39;t understand the fundamentals of options contracts and know your greeks.&lt;/p&gt;\n\n&lt;p&gt;2- The market can remain irrational longer than you can remain solvent. We never got a 2000-style crash in most meme stocks until a year later.  Instead, it was just a slow bleed out.&lt;/p&gt;\n\n&lt;p&gt;3- NEVER bet against the apes. Instead, become one.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Third Wipe Out&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;This is a well documented one. I had posted about it here on WSB.&lt;a href=\"https://www.reddit.com/r/wallstreetbets/comments/pcuwrl/10k_to_110k_to_1k_in_35_days/\"&gt;https://www.reddit.com/r/wallstreetbets/comments/pcuwrl/10k_to_110k_to_1k_in_35_days/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;I  managed to take that 10K to 110K with a very well timed call on AMD and ended up losing all of it on a SPY put.  Going from 10K to 110K to 1K  in 35 days. I didn&amp;#39;t quite understand how I made this mistake until I thought quite hard about it. And here&amp;#39;s what happened.&lt;/p&gt;\n\n&lt;p&gt;After the winning AMD trade I moved to COIN. I was very bullish on &amp;#39;that market&amp;#39; and wanted to take an options position in COIN. I tried to time this trade well, and I think I did. But I still managed to lose some money. I bought leap options on COIN, so my position wouldn&amp;#39;t get eaten way due to theta decay. COIN had earnings coming in soon and the stock pulled back after the earnings, the combination of the stock pulling back and the implied volatility dropping took my 110K position  down to 66K.&lt;/p&gt;\n\n&lt;p&gt;I was still very  bullish on &amp;quot;that market&amp;quot; but I wanted to make that money back quickly so I can  double my call position. So I sold out of the position and was looking to short the SPY because at the time the market had this very obvious  mid-month decline that came in every month very consistently around the monthly options expiration date. So I bought daily puts on the $SPY the  same day it put in its monthly top and the market started moving down and my puts were making a profit.&lt;/p&gt;\n\n&lt;p&gt;I was waiting for my position to make enough of a profit to take me back to 110K ( first mistake ). The market ended up making a u-turn after the early morning sharp sell off. The next 6 hours were the strongest performing for the market in the whole month and as the market continued to rip I continued to hold. Believing that this is a fake out. I was conditioned from my penny stock days to hold through volatility. I was psychologically adept to seeing massive losses turn into massive wins. Of course this is a great investment mindset but a deadly one for something that loses value to theta decay every second.&lt;/p&gt;\n\n&lt;p&gt;Well,  turns out I was right and it was a fake out, because the very next day the market went on to begin its monthly mid-month slump and put on a big 3-day decline. But that didn&amp;#39;t matter, I had bought daily options that expired the same day. I held on to those options believing it was a fake out. I held on for far too long unfortunately and did not end up closing the position until it had shrunk from 66K to 7K.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Third Wipe Out Lessons Learned &amp;amp; Overall Takeaway&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;1- Don&amp;#39;t be retarded and trade a full sized position with short-dated  options on anything. You can be 99% right on the direction and the timing but that 1% will wipe you out.&lt;/p&gt;\n\n&lt;p&gt;I eventually made it all back and then some with a few well-timed options  ~1000% trades on AMD, COIN &amp;amp; NVDA in October. And my longer term, well timed AMD options trade ended up saving my ass.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TLDR TLDR TLDR TLDR TLDR TLDR TLDR ( TLDR Stars here )&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;My lessons to myself &amp;amp; TLDR&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;TLDR : I got wiped out 3 times.&lt;/p&gt;\n\n&lt;p&gt;1-30K to -3K ( yes went negative).&lt;/p&gt;\n\n&lt;p&gt;2- 240K to 10K.&lt;/p&gt;\n\n&lt;p&gt;3- 110K to 1K.&lt;/p&gt;\n\n&lt;p&gt;Peak to trough I went from 240K to 1K throughout my last 2 blow ups.&lt;/p&gt;\n\n&lt;p&gt;I survived all of them and came out the other end with profits. These are the lessons I learned.&lt;/p&gt;\n\n&lt;p&gt;1- It&amp;#39;s common for great traders and entrepreneurs ( not talking about me ) to experience failure repeatedly when they start out and some get wiped out multiple times before becoming sustainably profitable. Just because you got wiped out, it doesn&amp;#39;t mean that you can&amp;#39;t become a profitable trader, as long as you learn from your mistakes.&lt;/p&gt;\n\n&lt;p&gt;2- Avoid debt whenever you can and if you decide to take on debt think about the possibility of losing that entire position. If you can live with that go for it, if you can&amp;#39;t then don&amp;#39;t do it. ( The lesson of taking on the responsibility of investing my borther&amp;#39;s 10K )&lt;/p&gt;\n\n&lt;p&gt;3- Learn from every major loss to find out what led you to it and try not to repeat that mistake again. Think of it like a pro athlete! The GOATS watched their own matches, the wins and losses, to learn and improve.  Apply the same.&lt;/p&gt;\n\n&lt;p&gt;4- Test your strategy with paper-trading before you use real money. This is what I did after my penny stock chasing led to my first wipe out. I  paper-traded 15 different penny stocks, 10 of them ended up making 300%+  profits before I actually started applying this strategy to the remaining 5 in my real account. All 15 ended up being multibaggers, so I knew I was onto something.&lt;/p&gt;\n\n&lt;p&gt;5- Understand your risk, if you don&amp;#39;t understand your risk your losses will  be much greater than you are willing to accept. I didn&amp;#39;t take into account the amount of risk I was taking on trading that 0DTE SPY put. I only thought about wanting to take my 66K back to 110K, thinking it was an easy trade. If you understand  your risk, you pretty much know how much you can and will likely lose on  your trade before taking it and this will help you make  better trades  and cope with the losses and accept them.&lt;/p&gt;\n\n&lt;p&gt;7- Finally,  don&amp;#39;t despair. The first wipe out is always the worst. But when I got  through it and made it all back I knew I would be okay. It&amp;#39;s like going through your first ever breakup or living through major trauma and coming out okay the other side. The first one is always the worst. Make no mistake, a wipe out is major trauma, you have to push through and persevere.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s not the end of  your trading career. You will recover from this, be patient,  use the time to improve your understanding of the market and hone your strategies and skills.&lt;/p&gt;\n\n&lt;p&gt;Whoever made it to the end. Thank you for reading!&lt;/p&gt;\n\n&lt;p&gt;**&lt;strong&gt;UPDATE&lt;/strong&gt;:**&lt;/p&gt;\n\n&lt;p&gt;This post is blowing up faster than my accounts did! Thank you for taking the time to read my story!&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s some amazing advice in the comments that I would like to highlight.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;My income&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;At the time of the first wipe out I was making minimum wage. I&amp;#39;m now 30 years old and make a high 5 figure salary.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Taxes&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I didn&amp;#39;t talk about taxes because I&amp;#39;m not American and don&amp;#39;t have capital gains taxes. BUT it is absolutely crucial to talk about taxes. If I had withdrawn some profits after every winning trade to cover taxes + put some money away for a rainy day that would&amp;#39;ve probably saved me so much pain.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;DD&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Due diligence is probably the most important thing you can do before you enter any trade. It will help you quantify your risk and your reward and will also significantly increase conviction in your position. High conviction can be a double edged sword though, because it can lead you to hold onto losing trades. So balancing high conviction with proper risk management like using stop losses, position sizing and hedging can be pertinent. You will always have to fight your emotions as a trader. The smaller your position is the easier it is to fight your emotions and stick to your rules. That&amp;#39;s been my experience at least.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "96f6c79e-b853-11e5-a4cb-0ebdf030e05d",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2th52",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#800080",
  "id": "wnm1nr",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "CaspeanSea",
  "discussion_type": null,
  "num_comments": 216,
  "send_replies": true,
  "whitelist_status": "some_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/wallstreetbets/comments/wnm1nr/i_blew_up_my_account_3_times_240k_to_1k_survived/",
  "parent_whitelist_status": "some_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/wallstreetbets/comments/wnm1nr/i_blew_up_my_account_3_times_240k_to_1k_survived/",
  "subreddit_subscribers": 12420211,
  "created_utc": 1660430293,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1660417495,
  "the_new_excerpt": "This is somewhat in reaction to the loss posts I keep seeing on WSB going from\n10s or 100s of thousands of dollars to nothing. I know how it feels, I've been\nthere multiple times. It can be devastating but you can survive and thrive after\nit. This is not investment advice, it is simply my story and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは、WSBで見かける損失投稿への反動で、次のようになります。\n何万ドル、何十万ドルから何にもならない。私はその気持ちを知っています。\n何度も経験しています。それは壊滅的なことができますが、あなたは生き残ることができると繁栄後\nそれは壊滅的なものです。これは投資のアドバイスではなく、単なる私の体験談と...",
      "title": "私は3回（240Kから1Kまで）口座を爆破し、生き残り、利益を得ることができました - これらは私がこれまでに学んだ教訓です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这在某种程度上是对我在WSB上不断看到的损失帖子的反应，从\n10或10万美金到一无所有。我知道那是什么感觉，我也经历过\n多次。它可能是毁灭性的，但你可以在它之后生存和发展。\n它。这不是投资建议，这只是我的故事和...",
      "title": "我的账户被炸毁了3次（24万到1万），幸存下来&amp；变得有利可图--这些是我迄今为止学到的经验。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這在某種程度上是對我在WSB上不斷看到的損失帖子的反應，從\n10或10萬美金到一無所有。我知道那是什麼感覺，我也經歷過\n多次。它可能是毀滅性的，但你可以在它之後生存和發展。\n它。這不是投資建議，這只是我的故事和...",
      "title": "我的賬戶被炸燬了3次（24萬到1萬），倖存下來&amp；變得有利可圖--這些是我迄今爲止學到的經驗。"
    }
  ]
}