{
  "author": "Tbkiah",
  "the_new_excerpt": "Some people might refer to it as the dumb money, or the fomoers. But the reality\nis the only reason the value of a currency goes up is due the brave people who\ntake the risk to buy in at the riskiest points in the market.\n\nIf these people didn't exist cryptocurrency would never have taken off…",
  "original_created_utc": 1617348431,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "有人可能会把它称为 \"哑巴钱\"，或者 \"fomoers\"。但实际情况是\n货币升值的唯一原因是由于那些勇敢的人们\n冒着风险在市场最危险的点位买入。\n\n如果这些人不存在的话，加密货币永远不会起飞...",
      "title": "我要花点时间感谢在市场顶层买东西的勇敢者和勇者。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有人可能會把它稱爲 \"啞巴錢\"，或者 \"fomoers\"。但實際情況是\n貨幣升值的唯一原因是由於那些勇敢的人們\n冒着風險在市場最危險的點位買入。\n\n如果這些人不存在的話，加密貨幣永遠不會起飛...",
      "title": "我要花點時間感謝在市場頂層買東西的勇敢者和勇者。"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "人によっては、ダム・マネーとかフォモアーと呼ぶかもしれません。しかし、実際には\n通貨の価値が上がるのは、リスクを取って市場の最も危険なポイントで買った勇敢な人々のおかげです。\n勇気ある人たちが、市場の最もリスクの高いところでリスクを取って買ってくれるからです。\n\nこのような人たちがいなければ、暗号通貨は決して流行らなかったでしょう...。",
      "title": "この場を借りて、市場の頂点で購入する勇気ある勇敢な人々に感謝したいと思います。"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "人によっては、ダム・マネーとかフォモアーと呼ぶかもしれません。しかし、実際には\n通貨の価値が上がるのは、リスクを取って市場の最も危険なポイントで買った勇敢な人々のおかげです。\n勇気ある人たちが、市場の最もリスクの高いところでリスクを取って買ってくれるからです。\n\nこのような人たちがいなければ、暗号通貨は決して流行らなかったでしょう...。",
      "title": "この場を借りて、市場の頂点で購入する勇気ある勇敢な人々に感謝したいと思います。"
    }
  ],
  "title": "I want to take a moment to thank the courageous and brave people who buy at the top of the market.",
  "created_utc": 1617355917,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Some people might refer to it as the dumb money, or the fomoers. But the reality is the only reason the value of a currency goes up is due the brave people who take the risk to buy in at the riskiest points in the market.</p>\n\n<p>If these people didn&#39;t exist cryptocurrency would never have taken off the ground. And those of us who have accrued life changing monetary value in this market have these people to thanks.</p>\n\n<p>They are the heroes we need, but they are not the ones most of the market deserves.</p>\n\n<p>To the brave people who buy at the market top, we salute you, and i pledge to do my best not to let your investment lose too much value in the short term so we can all come out on top on the long term.</p>\n\n<p>Thank you and good night.</p>\n</div><!-- SC_ON -->",
  "score": 6636,
  "permalink": "/r/CryptoCurrency/comments/mifal4/i_want_to_take_a_moment_to_thank_the_courageous/",
  "subreddit": "CryptoCurrency",
  "id": "mifal4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961875616
}