{
  "author": "giantflyingspiders",
  "original_created_utc": 1645776081,
  "title": "Is it stupid for a kid learning how to read to read aloud to a pet cat or dog?",
  "created_utc": 1645796940,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So a friend of mine is a teacher and she is teacher her kids on how to read. While her kids do have older kids that buddy up with them to help them read. She urgred the parents of kids to practice and if any family has pets to have their kids practice reading aloud to the pet dog or cat or any other pet. Some parents sent her emails saying reading to pets are dumb. She told me she does not understand as reading is an important skill to learn.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 113,
  "permalink": "/r/NoStupidQuestions/comments/t0yksj/is_it_stupid_for_a_kid_learning_how_to_read_to/",
  "subreddit": "NoStupidQuestions",
  "id": "t0yksj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So a friend of mine is a teacher and she is teacher her kids on how to read.\nWhile her kids do have older kids that buddy up with them to help them read. She\nurgred the parents of kids to practice and if any family has pets to have their\nkids practice reading aloud to the pet dog or cat or any…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の友人は教師で、子供たちに読み方を教えています。\n彼女の子供たちには、年上の子供たちがいて、彼らが読むのを助けてくれるのですが、その子供たちのために、バディを組んでくれるのです。彼女は\nまた、ペットを飼っている家庭は、ペットの練習をするように、子供の親に呼びかけています。\nペットの犬や猫に読み聞かせする練習をします。",
      "title": "読み方を学んでいる子供が、ペットの猫や犬に音読するのは馬鹿なことなのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的一个朋友是一名教师，她正在教她的孩子如何阅读。\n虽然她的孩子确实有大一点的孩子和他们结伴帮助他们阅读。她\n她敦促孩子们的父母进行练习，如果任何家庭有宠物，让他们的\n孩子们练习对宠物狗或猫或任何其他动物大声朗读。",
      "title": "一个正在学习阅读的孩子给宠物猫或狗朗读是愚蠢的吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的一個朋友是一名教師，她正在教她的孩子如何閱讀。\n雖然她的孩子確實有大一點的孩子和他們結伴幫助他們閱讀。她\n她敦促孩子們的父母進行練習，如果任何家庭有寵物，讓他們的\n孩子們練習對寵物狗或貓或任何其他動物大聲朗讀。",
      "title": "一個正在學習閱讀的孩子給寵物貓或狗朗讀是愚蠢的嗎？"
    }
  ]
}