{
  "author": "Many_Scratch2269",
  "original_created_utc": 1643836313,
  "title": "The whales aren't selling. Smaller investors are.",
  "created_utc": 1643859235,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A lot of people left the Crypto market in fear of a Crypto winter. However, the people who did not leave are the ones who went through at least 2 Bitcoin bull cycles and the whales. A 45% steady price decrease is nothing but an accumulation strategy, and we can see this across the board with veteran wallets.&lt;/p&gt;\n\n&lt;h1&gt;Largest Individual Bitcoin Wallet (Accumulating)&lt;/h1&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/2n5hczi7fhf81.png?width=1512&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=0f811ada619e43b9c547d3e4f4c77dbf74f548d4\"&gt;https://preview.redd.it/2n5hczi7fhf81.png?width=1512&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=0f811ada619e43b9c547d3e4f4c77dbf74f548d4&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;The largest individual wallet has also been accumulating Bitcoin in anticipation of a continued bull cycle. This wallet seemed to have been largely correct on calculating when to start accumulating. Moreover, MicroStrategy and El Salvador are just two other examples out of hundreds of other corporations and whales that have started to accumulate cheap Bitcoin.&lt;/p&gt;\n\n&lt;h1&gt;Bitcoin Supply on Exchanges at Multi-Year Low&lt;/h1&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/6cg71z74ihf81.png?width=1434&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=2f079f70bc3009f4271694b9551eca03c25a0534\"&gt;https://preview.redd.it/6cg71z74ihf81.png?width=1434&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=2f079f70bc3009f4271694b9551eca03c25a0534&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Despite the selling pressure from people that are panicking, the exchanges are actually losing Bitcoin supply as most of it is being bought for cheap by whales. The Current supply has dropped to 13.27%, and at this rate we could see huge supply shortages by 2028-2030, or even faster as the next Bitcoin halving will have a significant effect on supply.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;TLDR: The only people who are currently selling are panicked investors or newbies who&amp;#39;d rather take a 45% loss now than reduce that loss by DCAing. Whales are not selling, and instead they&amp;#39;re buying up huge amounts of Bitcoin which has historically been a very bullish signal for the price.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 350,
  "permalink": "/r/CryptoCurrency/comments/sj013u/the_whales_arent_selling_smaller_investors_are/",
  "subreddit": "CryptoCurrency",
  "id": "sj013u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "A lot of people left the Crypto market in fear of a Crypto winter. However, the\npeople who did not leave are the ones who went through at least 2 Bitcoin bull\ncycles and the whales. A 45% steady price decrease is nothing but an\naccumulation strategy, and we can see this across the board with…"
}