{
  "author": "TheMrFerrari",
  "the_new_excerpt": "In solving equations with pen and paper, handwriting speed is a huge bottleneck.\nFrom my experience, there are times where I just change one slight thing in the\nequation and I have to rewrite it all again, to show my calculations\nstep-by-step. Even if I don't want to rewrite every single change,…",
  "original_created_utc": 1618767708,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "紙とペンで方程式を解く場合、手書きのスピードが大きなボトルネックになります。\n私の経験では、計算式のちょっとしたところを変えただけで、計算結果を示すためにもう一度全部書き直さなければならないことがあります。\n私の経験では、数式のわずかな部分を変更しただけで、計算結果を段階的に示すためにすべてを書き直さなければなりません。\n書き直すことがあります。いちいち書き直さなくてもいいのですが......。",
      "title": "手書きのスピードは、問題解決の効率をどれだけ制限するか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在用纸笔解方程时，手写速度是一个巨大的瓶颈。\n从我的经验来看，有的时候，我只要稍微改动一下，在\n等式，我必须重新写一遍，以显示我的计算结果。\n一步一步来 即使我不想重写每一个变化，... ...",
      "title": "我们的手写速度对我们解决问题的效率有多大的限制？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在用紙筆解方程時，手寫速度是一個巨大的瓶頸。\n從我的經驗來看，有的時候，我只要稍微改動一下，在\n等式，我必須重新寫一遍，以顯示我的計算結果。\n一步一步來 即使我不想重寫每一個變化，... ...",
      "title": "我們的手寫速度對我們解決問題的效率有多大的限制？"
    }
  ],
  "title": "How much does our handwriting speed limit our problem-solving efficiency?",
  "created_utc": 1618843686,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In solving equations with pen and paper, handwriting speed is a huge bottleneck. From my experience, there are times where I just change one slight thing in the equation and I have to rewrite it all again, to show my calculations step-by-step. Even if I don&#39;t want to rewrite every single change, these changes that occur as the solution goes on add up and I can&#39;t just keep them in my head, I have to write them down. If we could just imagine information and have it pop-up on a screen, mathematical analysis that takes minutes would take seconds. What are your thoughts on this? I&#39;m curious if, hypothetically, advanced civilizations would have a way to output information faster. Probably a brain implant or something similar</p>\n\n<p>This is a problem mostly for problems that require long, consistent thinking in solving, for example, mathematical equations, as opposed to problems that are solved by finding a key piece of information by using intense thinking but in a short interval. From my experience (I&#39;m still in HS), Physics problems are heavily bottlenecked by my handwriting speed, but it&#39;s not the same for Computer Science problems, where I just find a few key insights and the problem is already almost finished, because implementing the ideas in code, using a keyboard, is way faster than writing things on a piece of paper</p>\n\n<p>English is not my first language, so sorry for any mistakes</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/TrueAskReddit/comments/mthi2q/how_much_does_our_handwriting_speed_limit_our/",
  "subreddit": "TrueAskReddit",
  "id": "mthi2q",
  "is_self": true,
  "media": null,
  "is_video": false
}