{
  "author": "WittyManner0",
  "original_created_utc": 1636820833,
  "title": "Being in crypto is like being in a cult and I love it",
  "created_utc": 1636861365,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>“Crypto is essentially an economic cult that taps into very base human instincts of fear, greed and tribalism”</p>\n\n<ul>\n<li>Stephen Diehl, a crypto-sceptic software engineer</li>\n</ul>\n\n<p>Most groups identified as cults feature a single charismatic leader, something that the crypto world lacks. But many other classic hallmarks of culthood — apocalypticism, the promise of utopia for worthy believers, shunning of external critics and vitriolic denouncement of heretical insiders — are increasingly dominant.</p>\n\n<p>Crypto-cultism promises a social and financial revolution that will energise technological innovation, all the while rewarding the worthy with vast wealth. Many cults have offered such transformative promises, but few if any have posed such risks to retail investors, central banks and even the environment if they cannot live up to them.</p>\n\n<p>When I see the crypto parties I would love to take part of it! Looks fun to party with people with the same visions.</p>\n\n<p>What do you think about this ?</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/qt4obt/being_in_crypto_is_like_being_in_a_cult_and_i/",
  "subreddit": "CryptoCurrency",
  "id": "qt4obt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "“Crypto is essentially an economic cult that taps into very base human instincts\nof fear, greed and tribalism”\n\n * Stephen Diehl, a crypto-sceptic software engineer\n\nMost groups identified as cults feature a single charismatic leader, something\nthat the crypto world lacks. But many other classic…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "「暗号は本質的に人間の本能を利用した経済カルトである。\n恐怖、貪欲、部族主義といった人間の根源的な本能を利用した経済カルトである」。\n\n * 暗号に懐疑的なソフトウェアエンジニア、Stephen Diehl氏\n\nカルトと呼ばれるグループの多くは、一人のカリスマ的リーダーを特徴としているが、暗号の世界にはそれがない。\nるが、暗号の世界にはそれがない。しかし、他の多くの古典的な...",
      "title": "暗号の世界はカルト宗教のようなもので、私はそれが大好きです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "\"加密货币本质上是一种经济邪教，利用了人类最基本的本能\n恐惧、贪婪和部落主义\"\n\n *Stephen Diehl，一个怀疑加密货币的软件工程师\n\n大多数被认定为邪教的团体都有一个有魅力的领导人，这一点\n这也是加密世界所缺乏的。但许多其他经典的...",
      "title": "加入加密货币就像加入一个邪教组织，我喜欢它"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "\"加密貨幣本質上是一種經濟邪教，利用了人類最基本的本能\n恐懼、貪婪和部落主義\"\n\n *Stephen Diehl，一個懷疑加密貨幣的軟件工程師\n\n大多數被認定爲邪教的團體都有一個有魅力的領導人，這一點\n這也是加密世界所缺乏的。但許多其他經典的...",
      "title": "加入加密貨幣就像加入一個邪教組織，我喜歡它"
    }
  ]
}