{
  "author": "theTalkingMartlet",
  "original_created_utc": 1637780643,
  "title": "This sub is bipolar as fuck about Cardano right now. You can just trust what random people on the internet say about Cardano, or...you could look at the data...",
  "created_utc": 1637793401,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The posts on the front page about Cardano right now are bipolar as fuck. It&#39;s true...most people would probably agree that Cardano is one of the most divisive topics of discussion on this sub. I&#39;ll admit my bias for the project, but my opinions have not been formed based on rampant, baseless speculation. Let&#39;s look at the facts and the data. I believe I&#39;ve been able to leave my bias out of most everything below...</p>\n\n<p>&nbsp;</p>\n\n<p><a href=\"https://messari.io/screener/most-active-chains-DB01F96B\">Here is the Messari table for most active coins</a></p>\n\n<p>You can sort this table in all sorts of ways. As of today, if you sort by &quot;Real Volume&quot;, &quot;Transaction Volume&quot;, or &quot;Adjusted Transaction Volume&quot;, you&#39;d see Cardano ranked 3rd behind BTC and ETH. Now, some will refute this evidence of Cardano&#39;s utility by saying that Messari skews these numbers for UTxO platforms because of &quot;change&quot; UTxOs. Fair enough...let&#39;s sort by &quot;Active Addresses&quot; and we see Cardano ranked 4th at ~383k addresses, 80% of ETHs active addresses and about 42% of BTC...and this is without any DeFi projects having launched yet. You can see <a href=\"https://messari.io/charts/cardano/act-addr-cnt\">here</a> that is a growth of about 250% over the last week.\nTheDeFi project with the biggest reputation at this point, SundaeSwap, will most likely launch before the end of the year. People LOVE to measure the value of a chain based on TVL, which many Cardano bears will correctly state that there is currently zero TVL. Yeah, no shit...you can&#39;t measure something before it&#39;s been created. It&#39;s like trying to say somebody will be a shit athlete before they&#39;re even born, they have to at least grow to an age where they can start participating (analogies not always my strong suit, bare with me...). Anybody calling Cardano &quot;vaporware&quot; is lying, and anyone saying it &quot;has no dapps yet&quot; is not paying attention to the activity in the community and, while true at THIS VERY MOMENT, is basically ignoring the state of current DeFi projects. Ethereum took far longer than 11 weeks for good quality dapps to get going, Cardano will have them in about 4 months time from launch of smart contracts.</p>\n\n<p>&nbsp;</p>\n\n<p>Ok...so Cardano is being used A LOT right now...how is it handling the load? Well, you can see <a href=\"https://datastudio.google.com/reporting/3136c55b-635e-4f46-8e4b-b8ab54f2d460/page/p_59kxcdtwnc\">here</a> that the blockchain load has been steadily increasing since October. And you can see <a href=\"https://datastudio.google.com/reporting/3136c55b-635e-4f46-8e4b-b8ab54f2d460/page/s0XCC\">here</a> that the number of transactions is spiking greatly. (You can adjust the graphs to an earlier date to see that the trend is increasing but I can&#39;t link directly to it). Best thing about Cardano? It was built to BEND NOT BREAK!!! There are many parameters that can be adjusted on an epoch&#39;s notice to accommodate more transaction volume. In fact, <a href=\"https://iohk.io/en/blog/posts/2021/11/22/slow-and-steady-wins-the-race-network-evolution-for-network-growth/\">that is exactly what is being done</a>. At the moment this is controlled by IOG, but when we eventually get full on-chain governance we, the community, will be in control of how Cardano adapts. </p>\n\n<p>&nbsp;</p>\n\n<p>I&#39;m hoping I&#39;ve laid out the facts with evidence pretty clearly here and I think I&#39;ve avoided bias. I&#39;m not trying to convince anybody to buy or sell, I want everybody to make up their own minds based on the data. It&#39;s exactly what attracted me to the Cardano project. There are ups and downs in the market, but Cardano&#39;s design will allow it to stand the test of time because of its &quot;bend don&#39;t break&quot; approach. The demand for its use is pushing up against the flood gates and they will be opening over the next few months.</p>\n\n<p>&nbsp;</p>\n\n<p>Edits for grammar</p>\n</div><!-- SC_ON -->",
  "score": 204,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/nIBV86vLaA25uFfTkMzo3p4ZPuGD14pVyOfyFK46U88.jpg?auto=webp&s=91fb3a5c184a03489fcdbcce47ca0653c36b3a3d",
          "width": 1440,
          "height": 718
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/nIBV86vLaA25uFfTkMzo3p4ZPuGD14pVyOfyFK46U88.jpg?width=108&crop=smart&auto=webp&s=dbc0086cf8cf3e6036f41cba8f9e9b468f6a9769",
            "width": 108,
            "height": 53
          },
          {
            "url": "https://external-preview.redd.it/nIBV86vLaA25uFfTkMzo3p4ZPuGD14pVyOfyFK46U88.jpg?width=216&crop=smart&auto=webp&s=e13d42c5e5753f335ec52c58cb023dc4ad4c174d",
            "width": 216,
            "height": 107
          },
          {
            "url": "https://external-preview.redd.it/nIBV86vLaA25uFfTkMzo3p4ZPuGD14pVyOfyFK46U88.jpg?width=320&crop=smart&auto=webp&s=527d1f1cd6fe82aa7aebd964ebd62870424da586",
            "width": 320,
            "height": 159
          },
          {
            "url": "https://external-preview.redd.it/nIBV86vLaA25uFfTkMzo3p4ZPuGD14pVyOfyFK46U88.jpg?width=640&crop=smart&auto=webp&s=040d6d0bb6a51b0ad08a5b4c68db2265a1b46592",
            "width": 640,
            "height": 319
          },
          {
            "url": "https://external-preview.redd.it/nIBV86vLaA25uFfTkMzo3p4ZPuGD14pVyOfyFK46U88.jpg?width=960&crop=smart&auto=webp&s=240e1c2d1fc14c42fe69f3c8afa69b0feb9ec519",
            "width": 960,
            "height": 478
          },
          {
            "url": "https://external-preview.redd.it/nIBV86vLaA25uFfTkMzo3p4ZPuGD14pVyOfyFK46U88.jpg?width=1080&crop=smart&auto=webp&s=0fdb059c729b6cdef12d2912649bd9376d06e069",
            "width": 1080,
            "height": 538
          }
        ],
        "variants": {},
        "id": "WmDDbMsw_225nuLPPUr6c6byHgIOj3laY1jCcqxd7RA"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/r1cjk9/this_sub_is_bipolar_as_fuck_about_cardano_right/",
  "subreddit": "CryptoCurrency",
  "id": "r1cjk9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The posts on the front page about Cardano right now are bipolar as fuck. It's\ntrue...most people would probably agree that Cardano is one of the most divisive\ntopics of discussion on this sub. I'll admit my bias for the project, but my\nopinions have not been formed based on rampant, baseless…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今のCardanoに関するフロントページの投稿は、クソのように二極化している。それは\nたしかに...ほとんどの人は、Cardanoがこのサブで最も意見の分かれる話題の一つであることに同意するでしょう。\nほとんどの人が同意するでしょう。私はこのプロジェクトに偏見を持っていることは認めますが、私の意見は\nしかし、私の意見は、横行する根拠のない...に基づいて形成されたものではありません。",
      "title": "このサブは今、カルダノについてクソのように二極化している。インターネット上のランダムな人々がCardanoについて言うことを信用するか、あるいは...データを見るか...。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "现在头版上关于Cardano的帖子是两极化的。这是\n大多数人可能会同意，卡达诺是这个论坛上最有分歧的\n讨论的话题之一。我承认我对这个项目有偏见，但是我的\n我承认我对这个项目有偏见，但我的观点并不是基于猖獗的、毫无根据的......而形成的。",
      "title": "这个子现在对Cardano的看法是两极化的。你可以相信互联网上随机的人对Cardano的评价，或者...你可以看看数据..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "現在頭版上關於Cardano的帖子是兩極化的。這是\n大多數人可能會同意，卡達諾是這個論壇上最有分歧的\n討論的話題之一。我承認我對這個項目有偏見，但是我的\n我承認我對這個項目有偏見，但我的觀點並不是基於猖獗的、毫無根據的......而形成的。",
      "title": "這個子現在對Cardano的看法是兩極化的。你可以相信互聯網上隨機的人對Cardano的評價，或者...你可以看看數據..."
    }
  ]
}