{
  "author": "HavocMMA",
  "original_created_utc": 1657241463,
  "title": "An Old Timer's Tale: Segwit2x, The Block Wars: When Bitcoin Castrated the Most Powerful Players in the Ecosystem",
  "created_utc": 1657279943,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I think its time we take a moment and reflect back on the event, many years ago, that proved bitcoin is unstoppable (at least in the foreseeable future). It seems that the Segwit 2x\\bcash shills have come out of hiding due to the drop in bitcoin&amp;#39;s price, as the &amp;quot;bitcoin is terrible as a currency, its too slow&amp;quot; posts and comments have started reappearing  &lt;/p&gt;\n\n&lt;p&gt;The following is much of a repost, but its lore has since been forgot. This new post is a summary of the greatest, most complex attack on Bitcoin yet, that involved every major exchange, mining pool, reddit shilling campaigns, government agents (?)  &lt;/p&gt;\n\n&lt;p&gt;Friendships were broken, but new bonds of brotherhood were forged in the raging furnaces of crypto forums. The epicness of this event makes me laugh at every chode suite and tie commenting on Bitcoin in mainstream news  &lt;/p&gt;\n\n&lt;p&gt;Buckle up buckaroos.  &lt;/p&gt;\n\n&lt;p&gt;Segwit 2X was the equivalent of Goldman Sachs, JPMorgan, every other major bank, the oil cartel (OPEC), colluding to take over the network &lt;strong&gt;BUT FAILING MISERABLY, WITH THEIR TAIL BETWEEN THEIR LEGS, HAVING LOST A FORTUNE TO ACCOMPLISH NOTHING BUT THE RUINATION OF THEIR OWN REPUTATION&lt;/strong&gt;  &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/0zog3kopj8a91.jpg?width=797&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=c4477b5392e6950d0b9aec1b5b86f6c1880d850d\"&gt;The Darth Vader of Crypto&amp;#39;s Official War Declaration&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;This incident, and the fiasco of the centralised authorities involved (&lt;strong&gt;fuck you Brian Amstrong, you crypto cockroach&lt;/strong&gt;, the old timers haven&amp;#39;t forgotten where you stood, and have no surprise you sucked daddy government&amp;#39;s cock more than willingly: &lt;strong&gt;you deserve to be teabagged with ballsacks dripped in ink that reads &amp;quot;KYC&amp;quot;&lt;/strong&gt;)  &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/iyvgw5xwn8a91.png?width=1607&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=efbcd5016ed8d2fb7dcd6c0d41c1982ed07b9006\"&gt;https://news.ycombinator.com/item?id=15867329&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;The post below was written by a friend of mine, who was involved in Bitcoin even before I was. I took the liberty of naming and shaming, editing for grammar, linking evidence etc. To give you an idea, he saw Roger Ver shill for Mt Gox &lt;a href=\"https://www.youtube.com/watch?v=UP1YsMlrfF0&amp;amp;list=PPSV&amp;amp;ab_channel=RogerVer\"&gt;https://www.youtube.com/watch?v=UP1YsMlrfF0&amp;amp;list=PPSV&amp;amp;ab_channel=RogerVer&lt;/a&gt;  &lt;/p&gt;\n\n&lt;p&gt;Who is still fetid excuse of a human being? Who is this nerdy Chinese Darth Vader, inciting incest? All shall be revealed: grab your popcorn and let&amp;#39;s take it back to 2017 *retro 2017 music starts playing*  &lt;/p&gt;\n\n&lt;p&gt;-----------------------------------------------------------------------------------------------------------------------------------------------------  &lt;/p&gt;\n\n&lt;h1&gt;&lt;em&gt;Must read for newcomers&lt;/em&gt; My friend worked in the Bitcoin industry for a couple of years and has been involved in the crypto world since 2014. This is what he had to say about the recent politics of btc when someone asked him on our crypto trading channel&lt;/h1&gt;\n\n&lt;p&gt;(He first sent this article &lt;a href=\"https://medium.com/@StopAndDecrypt/thats-not-bitcoin-this-is-bitcoin-95f05a6fd6c2\"&gt;https://medium.com/@StopAndDecrypt/thats-not-bitcoin-this-is-bitcoin-95f05a6fd6c2&lt;/a&gt;, then followed up with this reply when someone told him he had no idea what he just read)&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;There was a big scaling debate and in the end there were two sides. &lt;strong&gt;Those that wanted to scale using bigger blocksize&lt;/strong&gt; (short term solution that doesn&amp;#39;t work long term and also causes more centralization) &lt;strong&gt;vs those who wanted to scale using changes in the code to make the network more efficient&lt;/strong&gt; aka SEGWIT+second layer scaling solutions (bitcoin becomes massive settlement layer, and second layer solutions can take care of verifying your $3.25 coffee payment).&lt;/p&gt;\n\n&lt;p&gt;On the big block side you had (most) miners because they were only able to see the short term benefits of increased blocksize and they do not care about network centralization. Also, a chinese miner, &lt;strong&gt;Jihan Wu, controlling a sizeable chunk of the network&amp;#39;s hashrate, had access to (and was in the process of patenting) this technology called ASICBOOST&lt;/strong&gt; which is an exploit in bitcoin code that allows you to &amp;quot;cheat&amp;quot; and get extra hashing power out of your miners&lt;strong&gt;. Essentially they had an unfair advantage and the KEY is that the segwit upgrade fixes this exploit.&lt;/strong&gt;   &lt;/p&gt;\n\n&lt;p&gt;Alongside these &lt;strong&gt;miners you had a couple of misguided (but incredibly wealthy because of early adoption) individuals&lt;/strong&gt; who either have a reason to see bitcoin fail (like they are heavily invested in altcoins now) or they are too pigheaded to back down when wrong (or some of them I&amp;#39;m sure are not actually intelligent enough to understand they are wrong).&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;On the Segwit side you had all the core developers&lt;/strong&gt; (the guys who worked side by side with satoshi to build all this and have been contributing to the code for years every day), &lt;strong&gt;the majority of the userbase, AND the vast majority of bitcoin companies. The two sides were basically arguing over who had control over bitcoin - was it the miners, or was it the users?&lt;/strong&gt; Was it those who chose which software to run (users) or was it those who verified transactions for that software (miners)? &lt;strong&gt;(The answer as you will see shortly is Users).&lt;/strong&gt;   &lt;/p&gt;\n\n&lt;p&gt;So basically these miners were stalling the upgrade because it would mean the end of their unfair (AND patented) advantage. &lt;strong&gt;This massive stalemate in the debate caused a community led uprising known as the User Activated Soft Fork movement (UASF).&lt;/strong&gt; These guys basically said &amp;quot;We&amp;#39;re switching our nodes to Segwit software starting Aug 1 and we will be rejecting all mined blocks that do not comply with the new code&amp;quot;. &lt;strong&gt;This forced the miners&amp;#39; hand as they realized they would either be forked off the network or have to go along with the new upgrade&lt;/strong&gt; to make sure everything continued to go smoothly (including their profits).&lt;/p&gt;\n\n&lt;p&gt;The movement gained enough support to freak out some big money bitcoin CEOs who got together in a room with the miners and made a deal behind closed doors known as the &lt;strong&gt;New York Agreement (NYA). This is where Segwit2x was born&lt;/strong&gt;. &lt;strong&gt;The key to note here is that not a single core dev was invited to this meeting&lt;/strong&gt; (in fact, not a single competent dev in general was invited). The terms of the deal were: &lt;strong&gt;You guys agree to implement Segwit now, and then we&amp;#39;ll agree to an increase in block size later.&lt;/strong&gt; Deal was made and obviously the majority of the user community was in an uproar because bitcoiners hate closed door deals (and they should for good reason).&lt;/p&gt;\n\n&lt;p&gt;That being said, it got &lt;strong&gt;Segwit activated because it gave miners an easy way to safe face and go with segwit and the community instead of seeing their profits get wrecked by a messy chainsplit&lt;/strong&gt;. However, do you remember that sneaky miner who had patented the ASICBOOST technology? Well he was part of the NYA and he decided to fork off anyway and create Bitcoin Cash. &lt;strong&gt;So stop right here and realize that the only reason we have bitcoin cash is so that some miner, Jihan Wu, with a ton of hashing power could keep his unfair advantage over the network&lt;/strong&gt; (he stills mainly mines bitcoin by the way because he would go out of business if he switched entirely to bitcoin cash). Also at this point, technically the &lt;strong&gt;NYA was broken&lt;/strong&gt; because the whole point of it was to avoid a chainsplit and go with segwit followed by a block size increase whereas bitcoin cash was a clear chainsplit.&lt;/p&gt;\n\n&lt;p&gt;So for a few months everything was ok because we had Segwit, core devs were still with us, and (supposedly) anyone who wanted bigger blocks had forked off to bitcoin cash right? &lt;strong&gt;Wrong. See it turns out that those guys who made that backroom deal with the miners also had their own interests which involve removing the current core developers from their (imagined) seat of power.&lt;/strong&gt; It is classic old school business politics - they don&amp;#39;t care that core the devs are based around principles of meritocracy and peer review. They just want to have more of a say in the direction bitcoin takes. At this point, you might be thinking, &amp;quot;Ok but its fair for companies who use a product to have a say in its development, right?&amp;quot; &lt;strong&gt;NO. Not when the &amp;quot;product&amp;quot; at stake is meant to be an incredibly secure, incorruptible ledger that can hold trillions of dollars in wealth and still be hosted online accross the world.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;The fact is that no one understands the code better than the core developers and no one has more of an interest in seeing bitcoin stay decentralized and secure than these guys do. &lt;strong&gt;These guys literally cum buckets everyday to how much they love coding bitcoin.&lt;/strong&gt; If Satoshi is Cypher Jesus then these guys are his Apostles. And on the other hand you have some &lt;strong&gt;severely misguided corporate buffoons who think they have the knowledge to negotiate a compromise with a group who has nothing but short term profit in their sights&lt;/strong&gt;. And when the core developers are like &amp;quot;wtf dude?&amp;quot; and the community stands behind them, then these guys resort to essentially trying to kick core out of bitcoin by starting a new chain. &lt;strong&gt;A new chain which was based on a compromise that no one wants or needs anymore.&lt;/strong&gt; And the excuse these CEO&amp;#39;s are hiding behind is &amp;quot;We don&amp;#39;t want to go back on our word.&amp;quot; Classic business mindset vs coding mindset.&lt;/p&gt;\n\n&lt;p&gt;ur word.&amp;quot; Classic business mindset vs coding mindset.&lt;/p&gt;\n\n&lt;p&gt;Now we come to the current situation where there are basically 4 sides&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;strong&gt;Core developers, and those supporting them&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;The (remaining) signers of the NYA and those supporting Segwit2x&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Malicious third parties who just want to see bitcoin fail (invested in altcoins/bitcoin cash or they are the Joker and just want to see shit burn)&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Innocent bystanders&lt;/strong&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;The core developers are continuing to code and improve bitcoin and they are working on second layer solutions. They haven&amp;#39;t stopped development and have actually made a TON of beneficial changes to the code since the Segwit upgrade allowed them to. Being non-political or atleast being shit politicians, these guys do not know how to handle themselves with other people and either don&amp;#39;t speak much or come off as pretentious d*bags (trust me I used to hate them before I smartened up).&lt;/p&gt;\n\n&lt;p&gt;The remaining NYA signers. I say remaining because alot of companies left when they saw the massive backlash from the community. &lt;strong&gt;The only signers left are miners and then a group of around 30 companies which all have ties to Barry Silbert&amp;#39;s holding company Digital Currency Group and suprise surprise who do you think got that NYA meeting together in the first place? Silly Silbert&lt;/strong&gt; indeed. He&amp;#39;s basically trying to do a sort of corporate take over of bitcoin where he decides who is writing the code and how they write it. Oh also I should note here that &lt;strong&gt;these guys have 1 developer working on the Segwit2x code. Yes 1, Jeff Garzik&lt;/strong&gt;. Coding ability? Mediocre at best. All he did was copy and paste the entire bitcoin core code (because its open source) and changed the one little value that dictates block size. He changed a 1 to a 2 haha! And &lt;strong&gt;when he tried to make other changes he made critical mistakes that had to be fixed by CORE DEVELOPERS&lt;/strong&gt; hahahaha! So how the f* does that even compare to an army of geeks who have been coding bitcoin for years and coding in general for decades who are all constantly trying to find mistakes in each others&amp;#39; work. SO people supporting Segwit2x are either severely misguided, hate core devs, or don&amp;#39;t have all the information to make an informed decision.&lt;/p&gt;\n\n&lt;p&gt;Now the malicious actors. These are people who have a &lt;strong&gt;vested interest in seeing bitcoin crumble. I&amp;#39;m talking about big altcoin investors and bitcoin cash supporters&lt;/strong&gt; (yes the guys who have ASICBOOST and want are the reason for this whole mess in the first place). And Segwit2x has presented them with a beautiful vector of attack. Divide and conquer. Right? And whereas with bitcoin cash there was replay protection (meaning the split was pretty clean and bitcoin was largely unaffected) this time they haven&amp;#39;t got any planned - so should things go through as planned, things could get messy.&lt;/p&gt;\n\n&lt;p&gt;Then you have all those &lt;strong&gt;innocent bystanders&lt;/strong&gt; who don&amp;#39;t really know what to think anymore. Things have gotten so convoluted and complicated that it is hard to follow who wants what anymore. These are the people who will get the most fucked by something like Segwit2x because they won&amp;#39;t understand the risks as it is happening and they won&amp;#39;t have the knowledge to know which wallets to support. &lt;strong&gt;Imagine Segwit2x happens and one wallet sticks with the core version of bitcoin and the other wallet supports the segwit2x version but they both just say &amp;quot;Bitcoin&amp;quot;.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;That is why people are soooooooooooooo strongly opposed to Segwit2x more than anything. &lt;strong&gt;It is nothing more and nothing less than a hostile takeover attempt.&lt;/strong&gt; And at this point that should be more than clear because why else would you still support the compromise made with miners who broke the compromise by creating bitcoin cash? &lt;strong&gt;No one wanted Segwit2x in the first place. People wanted bigger blocks, or segwit, not both&lt;/strong&gt;. Segwit2x was never a faction in the debate. It was a faction that was spawned by those who created the &lt;strong&gt;New York Agreement&lt;/strong&gt; because they saw an &lt;strong&gt;opportunity take control of the software development&lt;/strong&gt; from a group of developers who have been working on it for years and who strongly oppose corporate interests getting involved in bitcoin development.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;(I will name and shame the main malicious\\misguided actors and add details based on personal discussion with him and add articles for further reading)&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Barry Silbert&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;legit wants btc to succeed but he is also a corporate fool: used to be an investment banker and doesn&amp;#39;t know dick about coding&lt;/li&gt;\n&lt;li&gt;hates core developers because they are pro decentralization over ease of use for businesses&lt;/li&gt;\n&lt;li&gt;misguided&lt;/li&gt;\n&lt;li&gt;further reading: &lt;a href=\"https://medium.com/@charlescmackay/barry-silbert-and-the-cost-of-bitcoins-malfeasance-culture-f83d15ad07d1\"&gt;https://medium.com/@charlescmackay/barry-silbert-and-the-cost-of-bitcoins-malfeasance-culture-f83d15ad07d1&lt;/a&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;Erik Vorhees&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;similar situation as Barry Sillbert&lt;/li&gt;\n&lt;li&gt;misguided&lt;/li&gt;\n&lt;li&gt;&lt;a href=\"https://www.reddit.com/r/Bitcoin/comments/72x8m6/an_open_letter_to_erik_voorhees/\"&gt;https://www.reddit.com/r/Bitcoin/comments/72x8m6/an_open_letter_to_erik_voorhees/&lt;/a&gt; (check out the post and the critiques in the comments)&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;Jeff Garzik&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;already talked about in the post&lt;/li&gt;\n&lt;li&gt;misguided&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;Roger Ver&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;former &amp;quot;btc jesus&amp;quot;, early adopter, hardcore libertarian&lt;/li&gt;\n&lt;li&gt;got into altcoins and now became &amp;quot;btc antichrist&amp;quot;. uses wealth and power to try and ruin btc whenever he can&lt;/li&gt;\n&lt;li&gt;always came across as a &amp;quot;huge fake pussy&amp;quot; even before he revealed himself to be a bitcoin basher&lt;/li&gt;\n&lt;li&gt;malicious actor, &amp;quot;fraud&amp;quot;&lt;/li&gt;\n&lt;li&gt;&lt;a href=\"https://medium.com/@WhalePanda/roger-ver-from-bitcoin-jesus-to-bitcoin-antichrist-69fc7a17c622\"&gt;https://medium.com/@WhalePanda/roger-ver-from-bitcoin-jesus-to-bitcoin-antichrist-69fc7a17c622&lt;/a&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;Jihan Wu&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;only wants more money and power&lt;/li&gt;\n&lt;li&gt;controls shitload of hashing power, got all sorts of alternate agendas (conspiracy theory he is aligned with the Chinese government\\subsidized by them)&lt;/li&gt;\n&lt;li&gt;tried to exploit ASICBOOST to get unfair advantage and dominate hashrate even harder&lt;/li&gt;\n&lt;li&gt;malicious actor&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;a href=\"https://medium.com/@WhalePanda/asicboost-the-reason-why-bitmain-blocked-segwit-901fd346ee9f\"&gt;https://medium.com/@WhalePanda/asicboost-the-reason-why-bitmain-blocked-segwit-901fd346ee9f&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;there you guys have it, a comprehensive rundown of bitcoin politics from the point of view of someone who supports the original vision of Satoshi Nakamoto to the core. I hope it informs those of you who got confused by the FUD.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Bitcoin belongs to the community, always and forever&lt;/strong&gt;&lt;br/&gt;\n&lt;strong&gt;----------------------------------------------------------------------------------------------------------------------------------------------------&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Post Scriptum&lt;/em&gt;: the attack was called off in humiliation on &lt;strong&gt;&lt;em&gt;November 8th, 2017: Bitcoin&amp;#39;s Independence Day&lt;/em&gt;&lt;/strong&gt; from the centralized entities, whose equivalent in the fiat world, control the wolrd with an iron vice grip. This is why, &lt;strong&gt;even if all exchanges burn to the ground, government tries to take over miners, bla bla bli bla bla bla, Bitcoin will be fine, has always been fine, and will continue to be fine&lt;/strong&gt;  &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/ne3pangnq8a91.png?width=817&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=aa357245553e1ec271a0c72a785485b4d957fabc\"&gt;Note how the whole \\&amp;quot;movement\\&amp;quot; was called off by 6 people&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Once More: Bitcoin belongs to the community, always and forever: the USD price, the big businesses acting like they own Bitcoin, the constant FUD, can suck our collective HODLER cock&lt;/strong&gt;  &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://i.redd.it/9euyzb0tj8a91.gif\"&gt;The Fate That Awaits All Those That Think They Can Co-Opt Bitcoin&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 330,
  "permalink": "/r/Bitcoin/comments/vtxvq2/an_old_timers_tale_segwit2x_the_block_wars_when/",
  "subreddit": "Bitcoin",
  "id": "vtxvq2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I think its time we take a moment and reflect back on the event, many years ago,\nthat proved bitcoin is unstoppable (at least in the foreseeable future). It\nseems that the Segwit 2x\\bcash shills have come out of hiding due to the drop in\nbitcoin's price, as the \"bitcoin is terrible as a currency,…"
}