{
  "author": "CLYDEFR000G",
  "the_new_excerpt": "Hi, new to the investing world and new to this subreddit. Currently have been\nlooking at stocks that I feel are currently undervalued that have great\nproducts/services that I am a fan of. Costco fits this description as I shop\ntheir frequently, love their free food samples, love that they pay…",
  "original_created_utc": 1614721374,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "你好，新加入投资界，也是这个子论坛的新成员。目前已经\n在寻找我觉得目前被低估的股票，有很大的\n产品/服务，我很喜欢。好市多符合这个描述，因为我在购物时\n他们经常，爱他们的免费食品样品，爱他们支付... ...",
      "title": "$COST .... Costco目前好买吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好，新加入投資界，也是這個子論壇的新成員。目前已經\n在尋找我覺得目前被低估的股票，有很大的\n產品/服務，我很喜歡。好市多符合這個描述，因爲我在購物時\n他們經常，愛他們的免費食品樣品，愛他們支付... ...",
      "title": "$COST .... Costco目前好買嗎？"
    }
  ],
  "title": "$COST .... is Costco currently a good buy?",
  "created_utc": 1614788840,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi, new to the investing world and new to this subreddit. Currently have been looking at stocks that I feel are currently undervalued that have great products/services that I am a fan of. Costco fits this description as I shop their frequently, love their free food samples, love that they pay their employees very well, love the membership money format Costco has set up, love the cheap hot dogs and $5 chickens you can buy. I haven’t seen anything scandalous like sexual assault allegations on the CEO or full closures of every location like other business due to the pandemic, yet their stock since around December of 2020 has been falling closer and closer to their March 2020 pandemic low. (I’ve been using the pandemic low number of each stock I evaluate as their true value indicator) Was curious with the stock being 52 week low of around $280 and 52 week high of $380 if $COST currently sits near $330 is this the time to jump in? Is there some metric or type of graph analysis that I can use to try and more accurately predict the “bottom value” before their stock begins climbing again?</p>\n</div><!-- SC_ON -->",
  "score": 40,
  "permalink": "/r/stocks/comments/lwdb53/cost_is_costco_currently_a_good_buy/",
  "subreddit": "stocks",
  "id": "lwdb53",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937744915
}