{
  "author": "Real_Carl_Ramirez",
  "original_created_utc": 1659619737,
  "title": "ELI5: Why does it seem like Jon Stewart is leading the charge in getting aid for veterans?",
  "created_utc": 1659665675,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not American, so why does it seem like a comedian, and not some politician or war hero, is the main voice in favour of the aid bill for veterans? Even the opponents of this bill, &lt;a href=\"https://twitter.com/tedcruz/status/1553185980777111553?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Etweet\"&gt;such as Ted Cruz&lt;/a&gt;, direct their arguments at Jon Stewart personally, instead towards the politicians supporting the bill.&lt;/p&gt;\n\n&lt;p&gt;On a side note, is this aid bill even popular among the general public? If so, why aren&amp;#39;t Democrat politicians being as vocal as Jon Stewart in support of this bill to get some easy popularity points?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 114,
  "permalink": "/r/Ask_Politics/comments/wg1axs/eli5_why_does_it_seem_like_jon_stewart_is_leading/",
  "subreddit": "Ask_Politics",
  "id": "wg1axs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm not American, so why does it seem like a comedian, and not some politician\nor war hero, is the main voice in favour of the aid bill for veterans? Even the\nopponents of this bill, such as Ted…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はアメリカ人ではないので、なぜか政治家ではなくコメディアンのように見える\n退役軍人のための支援法案を支持する主な声は、政治家や戦争の英雄ではなく、コメディアンのように見えるのはなぜでしょうか？この法案に反対する\nこの法案の反対者、例えばテッド...",
      "title": "ELI5：Jon Stewartが退役軍人のための支援を率先して行っているように見えるのはなぜですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不是美国人，为什么看起来像个喜剧演员，而不是什么政治家呢？\n或战争英雄，是支持退伍军人援助法案的主要声音？即使是\n这个法案的反对者，如特德...",
      "title": "ELI5：为什么看起来乔恩-斯图尔特在为退伍军人争取援助方面处于领先地位？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不是美國人，爲什麼看起來像個喜劇演員，而不是什麼政治家呢？\n或戰爭英雄，是支持退伍軍人援助法案的主要聲音？即使是\n這個法案的反對者，如特德...",
      "title": "ELI5：爲什麼看起來喬恩-斯圖爾特在爲退伍軍人爭取援助方面處於領先地位？"
    }
  ]
}