{
  "author": "etheraider",
  "the_new_excerpt": "My first post was removed without warning and without any explanation, (I even\ngot several private messages and comments asking why it was removed). I\ncontacted the mods twice over the last 2 hours and have heard nothing in\nresponse. This should show you that even in this sub there is some…",
  "original_created_utc": 1616697547,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我的第一篇帖子在没有任何警告和解释的情况下被删除了，（我还\n收到了好几条私信和评论，询问为什么要删除它）。) I\n在过去的2个小时内联系了两次版主，但没有任何消息。\n响应。这应该说明，即使在这个子里，也有一些... ...",
      "title": "如果你是一个新手，你需要在购买Ethereum。这就是为什么 v2"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的第一篇帖子在沒有任何警告和解釋的情況下被刪除了，（我還\n收到了好幾條私信和評論，詢問爲什麼要刪除它）。) I\n在過去的2個小時內聯繫了兩次版主，但沒有任何消息。\n響應。這應該說明，即使在這個子裏，也有一些... ...",
      "title": "如果你是一個新手，你需要在購買Ethereum。這就是爲什麼 v2"
    }
  ],
  "title": "If you're a noob, you need to be buying Ethereum. And here's why. v2",
  "created_utc": 1616704951,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>My first post was removed without warning and without any explanation, (I even got several private messages and comments asking why it was removed). I contacted the mods twice over the last 2 hours and have heard nothing in response. This should show you that even in this sub there is some information that some don&#39;t want you to see</strong></p>\n\n<p>Reposting now, Mods if there is any legitimate reason why this would be removed please tell me and I can edit, otherwise please do not censor this information.</p>\n\n<hr/>\n\n<p>For those of you who are new, you may not know but the next 3-6 months are arguably the most SIGNIFICANT months in the 5+ year history of the Ethereum ecosystem. And here is why:</p>\n\n<p>1) EIP-1559 is confirmed to launch this summer. What this means is that &quot;issuance&quot; which means new coins minted is going to be DRAMATICALLY lowered. To put it in perspective the, the issuance rate right now is 4.5% per year, the estimates for the issuance rate after EIP 1559 is implemented are .5 - 1%. Why does this matter? So bitcoin issuance halves every 4 years right? and from that we see the bull run begin and bitcoin goes on a tear. Well an issuance drop from 4.5% is the equivalent of 3 halvenings happening at ONE time. (4.5 cut in half to 2.25 again to 1.125and again to .56). Ethereum is already at a multi year low supply on exchanges, once this happens Ethereum will become INSTANTLY scarce. People are starting to dub this the &quot;Cliffening&quot;</p>\n\n<p>2) Staking and POS - Staking means you can lock up your ETH and you get paid rewards just like miners get rewarded for buying all the equipment and running the rigs and monitoring them and then being compensated for validating the blocks. You are going to be able to do the exact same thing without any of the upfront costs, right now you can only stake on your own node which very few users are able to do or on a few exchanges, but very soon coinbase will be allowing you to stake directly on their app. It will literally be the click of a button and you will be earning rewards. This will also further &quot;Lock up&quot; MILLIONS of additional ETH and remove them from the circulating supply and therefore further increase the scarcity of ETH. The Ethereum Devs are now ALSO going to try to merge to POS (full proof of stake with NO mining) a lot sooner as early as fall, which means in 6 months time there could be NO miners dumping coins every day on markets.</p>\n\n<p>3) Scaling - the TOP 2 scaling solutions coming out in the next few WEEKS are optimism and arbitrum. They will allow DAPPS to basically copy paste their code and onboard onto a super fast highway where essentially they can do hundreds to thousands of TPS for almost no cost. This will be incredibly bullish for the ecosystem because 1. fees will substantially go down in the network, 2. MORE ETH will be locked up in protocols because a lot of the DEFI applications will once again be cheap to use for the average user. Uniswap for example which is the number one gas user on the network is going to launch with Optimism shortly after its May 5th launch (one month away). Some are saying the shortly after is one week on May 12th. Once that happens between 20-30% of the congestion is going to come off the network lowering fees SUBSTANTIALLY and increase the usage on the network. ETH will be the most used blockchain in the world by a LONG shot.</p>\n\n<p>4) Technicals/Historical patterns/Risk Reward Opportunity - ETH the last bull run outperformed Bitcoin the entire cycle. The ETH BTC ratio went over .1, which is over a 3x from its current ratio now. The ratio has also been in an ascending pattern for the last 6 months and right now we are at the bottom of that pattern and if we continue it are going to make a substantial move up in the coming months <a href=\"https://np.imgur.com/a/g8z4Nwq\">https://np.imgur.com/a/g8z4Nwq</a> The chart pattern would also coincide with all the &quot;news&quot; of the coming developments listed above, staking on coinbase, EIP 1559, scaling all of that, so we could very well see a MASSIVE bullish move on Ethereum in a &quot;perfect storm&quot; of great news, development, and technical analysis.</p>\n\n<p>Why am I telling you all of this? Because for a change, Id like to see the new guy get ahead of the curve and buy before the massive potential pump while the waters are quiet, not when every headline is screaming buy buy buy and price has already pumped. And because I am sick and tired of seeing noobs getting screwed over by all these scammy youtubers, shills and other trying to take advantage of new investor ignorance. I was once in your shoes and it sucked not knowing what to believe and seeing so many people trying to manipulate me into buying their stupid hype coin with no future.</p>\n\n<p>At the end of the day, do whatever you want, but THIS is the sort of content I joined this sub years ago for, and over the years it was posts like this that helped me understand and make better investment decisions, and so this is me just trying to give back.\nGood luck.</p>\n</div><!-- SC_ON -->",
  "score": 1205,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/V3nslGsUNfgCTu7EJbtL1DR53zCLD9o8UFROGuzdnIg.jpg?auto=webp&s=c79deecec0e88e95ed9e309840b8d4b78b07f88a",
          "width": 600,
          "height": 315
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/V3nslGsUNfgCTu7EJbtL1DR53zCLD9o8UFROGuzdnIg.jpg?width=108&crop=smart&auto=webp&s=40beeb5c8cfcca8e5cf423cc5fffd516901c2390",
            "width": 108,
            "height": 56
          },
          {
            "url": "https://external-preview.redd.it/V3nslGsUNfgCTu7EJbtL1DR53zCLD9o8UFROGuzdnIg.jpg?width=216&crop=smart&auto=webp&s=68bea9d7f9b9be8aa05084823629b9e13491eb50",
            "width": 216,
            "height": 113
          },
          {
            "url": "https://external-preview.redd.it/V3nslGsUNfgCTu7EJbtL1DR53zCLD9o8UFROGuzdnIg.jpg?width=320&crop=smart&auto=webp&s=0195af7203b0d4180ee8f571c8a8a951e8e6d0bb",
            "width": 320,
            "height": 168
          }
        ],
        "variants": {},
        "id": "kFTQUaph2MQNSNzUSTHpTrlN_yS0YvjJ1acZI71HNWo"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/md55u9/if_youre_a_noob_you_need_to_be_buying_ethereum/",
  "subreddit": "CryptoCurrency",
  "id": "md55u9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357135578
}