{
  "author": "Account-for-nut",
  "original_created_utc": 1657368107,
  "title": "Why does literally nothing in life feel as good as when someone wants to sleep with me?",
  "created_utc": 1657386644,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Getting into grad school, making deans list 3 semesters in a row, any drug I&amp;#39;ve ever tried, recently getting a 10k+ raise at work, etc. None of it holds a candle to external validation. Nothing. I recently visited another country and made out with a girl at a bar who told me she wanted to go back to my hotel and mess around. She wasn&amp;#39;t even really my type and we didn&amp;#39;t end up hooking up but that felt better than cocaine. Like one of the peaks of the entire trip. Recently I hooked up with a friend of a friend. The first time was ok, the second time was probably the worst sex of my life. But the fact that she wanted to sleep with me? Better than ecstasy, by a long shot. &lt;/p&gt;\n\n&lt;p&gt;I haven&amp;#39;t slept with a ton of people but I&amp;#39;ve been a bit more promiscuous recently. Even despite that, I crave people wanting me more than ever. For some background I was in an abusive relationship for 2 years and after it was over I went through almost a year without even kissing anyone and became really obsessed with it, thinking about it constantly and wanting someone to want me incessantly. Whenever I would express this to my friends it was basically always met with anger and annoyance, and the people who were the most insistent about how I shouldn&amp;#39;t be so upset about it and how it doesn&amp;#39;t matter were always the ones who slept around the most and had a rotating door of non-stop partners. I became really depressed and was incapable of tying my self worth to anything other than people wanting to sleep with me. After a while I figured out that I need to tell myself that I have value from other things like achievements and just inherently, but I still can&amp;#39;t help how it makes me feel. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve had another relationship and a number of hookups since the phase of obsession ended and I have a much healthier perspective on it but obviously aspects of it still linger. Now, I&amp;#39;ve been single for a while but I don&amp;#39;t even want a relationship anymore. I don&amp;#39;t want someone to be in love with me. I don&amp;#39;t want the genuine things right now. I&amp;#39;m in my early-mid 20&amp;#39;s and I want people to look at me and want to fuck me and that&amp;#39;s it. I want meaningless sex even if it sucks. Am I wrong for feeling this way? Is it wrong to just be desired? I can&amp;#39;t help it no matter what. I recently made a massive stride in my career and sure it felt good, but again probably 1/10th as good as making out with that girl at the bar. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m gonna try to stop rambling now I know most people have probably stopped reading. But is this wrong? Why do I feel this way? Should I not indulge these desires? I use condoms and get tested and don&amp;#39;t lead people on. For reference I&amp;#39;m mid 20&amp;#39;s M bisexual.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 107,
  "permalink": "/r/TooAfraidToAsk/comments/vv06y0/why_does_literally_nothing_in_life_feel_as_good/",
  "subreddit": "TooAfraidToAsk",
  "id": "vv06y0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "Getting into grad school, making deans list 3 semesters in a row, any drug I've\never tried, recently getting a 10k+ raise at work, etc. None of it holds a\ncandle to external validation. Nothing. I recently visited another country and\nmade out with a girl at a bar who told me she wanted to go back…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "大学院への進学、3学期連続の学部長賞受賞、どんな薬物も\n最近、職場で1万円以上の昇給があったなど。どれもこれも\n外部からの評価にはかなわない。何もない。最近、外国を訪れて、バーで女の子と\nバーで女の子といちゃついたんだけど、その子が「また行きたい」って...。",
      "title": "誰かが私と寝たいと言っているときほど、人生で文字通り何もいい気分にならないのはなぜだろう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "进入研究生院，连续三个学期进入院长名单，我的任何药物\n我曾经尝试过的任何药物，最近在工作中获得了1万多美元的加薪，等等。这一切都不具备\n都比不上外部验证。什么都没有。我最近访问了另一个国家，并\n在酒吧里和一个女孩亲热，她告诉我她想回去......",
      "title": "为什么生活中没有什么比有人想和我睡觉的感觉更好？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "進入研究生院，連續三個學期進入院長名單，我的任何藥物\n我曾經嘗試過的任何藥物，最近在工作中獲得了1萬多美元的加薪，等等。這一切都不具備\n都比不上外部驗證。什麼都沒有。我最近訪問了另一個國家，並\n在酒吧裏和一個女孩親熱，她告訴我她想回去......",
      "title": "爲什麼生活中沒有什麼比有人想和我睡覺的感覺更好？"
    }
  ]
}