{
  "author": "SoupNecessary7439",
  "original_created_utc": 1632077211,
  "title": "What does 1 BTC get you in your country?",
  "created_utc": 1632126945,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So many people in the whole crypto-game joke about the phrase, &quot;When Lambo?&quot;\nBut what does 1 whole BTC actually get you and where in the world is that?\nI&#39;m in South Africa. Currently, according to CoinDesk, BTC is sitting at $47 522,25 or, in my local currency  R698 101,84 (ZAR).\nDoing a quick web search, that could buy a 1 bedroom townhouse, 36sq m (388sq ft), as well as a brand new Renault Kwid.\nNot exactly a mansion and a supercar, but that&#39;s a home and a brand new car, which could be a great start for a young adult, or anyone for that matter.</p>\n\n<p>So at current rate, what could 1 BTC get wherever you are?</p>\n\n<p>Based on this, and yes, I know that 1 BTC = 1 BTC, and this is more about global currencies and cost of living, but just on this train of thought, you can get a lot more, or a lot less for your 1 BTC, depending where in the world you are.</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/Bitcoin/comments/prduwl/what_does_1_btc_get_you_in_your_country/",
  "subreddit": "Bitcoin",
  "id": "prduwl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So many people in the whole crypto-game joke about the phrase, \"When Lambo?\" But\nwhat does 1 whole BTC actually get you and where in the world is that? I'm in\nSouth Africa. Currently, according to CoinDesk, BTC is sitting at $47 522,25 or,\nin my local currency R698 101,84 (ZAR). Doing a quick web…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号ゲームでは、\"When Lambo? \"という言葉を冗談で使う人がたくさんいます。しかし\n1BTCは実際に何を得ることができ、それは世界のどこにあるのでしょうか？私は\n南アフリカ共和国です。現在、CoinDeskによると、BTCは47 522,25ドル。\n私の現地通貨ではR698 101,84（ZAR）です。ざっとウェブで調べてみると...",
      "title": "あなたの国では、1BTCはいくらになりますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在整个加密游戏中，有很多人拿 \"何时兰博？\"这句话开玩笑。但是\n1个整数的BTC究竟能给你带来什么，在这个世界上的什么地方？我在\n南非。目前，根据CoinDesk的数据，BTC的价格为47 522,25美元或。\n以我的当地货币R698 101,84 (ZAR)。做了一个快速的网络...",
      "title": "在你的国家，1个BTC能让你得到什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在整個加密遊戲中，有很多人拿 \"何時蘭博？\"這句話開玩笑。但是\n1個整數的BTC究竟能給你帶來什麼，在這個世界上的什麼地方？我在\n南非。目前，根據CoinDesk的數據，BTC的價格爲47 522,25美元或。\n以我的當地貨幣R698 101,84 (ZAR)。做了一個快速的網絡...",
      "title": "在你的國家，1個BTC能讓你得到什麼？"
    }
  ]
}