{
  "author": "northwesternsamurai",
  "original_created_utc": 1632202341,
  "title": "Evergrande: ELI5 version.",
  "created_utc": 1632260193,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><ol>\n<li>What is Evergrande?</li>\n</ol>\n\n<p>Evergrande is the second largest Chinese property developer. It is the world&#39;s 122nd largest company/group by revenue, and the world&#39;s most valuable real estate company.</p>\n\n<ol>\n<li>Context for the current situation?</li>\n</ol>\n\n<p>In recent years, China has experienced a massive housing bubble. Many Chinese people are buying second or even third homes, as a long-term investment. However, these homes are rarely actually lived in, and housing demand in China is mostly met, so these prices are kinda artificial. This means the real estate market in China is basically a $12tn ponzi scheme, balanced on a knife-edge.</p>\n\n<ol>\n<li>What&#39;s happening, and why?</li>\n</ol>\n\n<p>Evergrande is on the brink of collapse. They have over $300bn in debt (mainly to other firms and banks, including major players like HSBC) They have been in deep water for a while now, however they have a big deadline to pay almost $85mm in interest coming up on Thursday, which could send them over the edge. $300bn is almost 2% of China&#39;s GDP. This means they probably won&#39;t be bailed out (as it would theoretically devalue the Yuan, assuming the Chinese govt prints some money to handle this). As the firm will not be bailed out, they will probably default on almost all of this debt. This is, as many financial analysts would say, pretty fucking bad. Many other firms in China are also massively overleveraged, and this could cause a large domino effect collapse of first Chinese real estate companies, and then have a knock-on effect on banks. Shares in another Chinese developer, Sinic Holdings, have already fallen by 87% today, and major indexes like the S&amp;amp;P 500 (USA) and FTSE (London) are sliding by a few per cent due to the uncertainty this is causing.</p>\n\n<ol>\n<li>Should I be worried?</li>\n</ol>\n\n<p>Maybe. This isn&#39;t a Lehman-size event, but the economy is pretty weak (despite what governments would want you to believe). We are still in the recovery from Covid, and this domino falling could start a pretty ugly few months. That, coupled with huge inflation and tax hikes due to Covid could spell bad times ahead. However, the situation is still uncertain. Evergrande have been in a bad place for a while, and while the situation is worsening, I believe the true collapse/restructuring of the firm could happen in a few days, but there&#39;s no guarantees. When a firm this large is collapsing everyone around them will try prop them up, because the butterfly effect from this will fuck everyone up anyway. Creditors will try to extend loans, etc etc. HOWEVER. Many of the Evergrande creditors have said they are reluctant to give the firm more room to breathe, so who knows. Time will tell. Be cautious, but don&#39;t panic. Yet.</p>\n\n<p>EDIT 3: Apparently Chinese markets are closed until Wednesday, therefore the overall effect on the Chinese market is yet to be seen. Stay tuned.</p>\n\n<p>​TL;DR: I&#39;m too lazy to write a proper detailed TLDR. Big real estate firm on the brink of bankruptcy, not Lehman-size but could be kinda bad. Yeah. Buckle up lads.</p>\n\n<p>EDIT 1: FAQs</p>\n\n<p>Do Evergrande hold any properties/developments in the West?</p>\n\n<p>Not AFAIK.</p>\n\n<p>Edit: Some commenters have informed me that Evergrande may have some holdings in the West, not nearly as significant as their holdings in China, however I need to corroborate this. Will do tomorrow morning. For now treat as unconfirmed.</p>\n\n<p>How will this affect [stock/market/equity/good]?</p>\n\n<p>IDK. Depends on a lot of factors. DM me if you reaaaaalllly need to know. Edit 2: Stop DMing me asking about the market as a whole. Mostly bad, how bad depends on how spectacularly the Chinese economy implodes. Some good plays to profit stand out but I won&#39;t reveal them because that&#39;s a liability on my part.</p>\n\n<p>Will this cause any issues for me, living in the West?</p>\n\n<p>Best case scenario: No</p>\n\n<p>Mid scenario: Increases in prices of Chinese products, probably slight increases in costs of everything without the wage increase to match. Possibility of financial hardship in the mid-to-long term but will recover and come back as per usual.</p>\n\n<p>Worst case: Large inflation, job losses, increased prices of most goods and services. Will have to cut spending down to bare essentials, mid-to-long term. However, will still recover.</p>\n\n<p>Worst worst worst case scenario: End of civilization as we know it. (It&#39;s not gonna be this one)</p>\n\n<p>I think the best advice is to set money aside, hold off on any luxury purchases or unnecessary spending and instead slowly stock up on shit which might become more expensive, but has a long shelf life and can still be consumed even if no crash occurs, such as tinned foods and toilet paper. No reason to panic tho.</p>\n\n<p>TL;DR, Stay informed, don&#39;t make brash financial decisions without thinking about it. No frenzy/panic buying/selling/hoarding etc.</p>\n\n<p>That&#39;s it for Edit 1: If you follow my profile I can keep you updated with sitreps OR you can come back to this post and I&#39;ll edit it with news and what this means for you.</p>\n\n<p>Thanks to user <a href=\"/u/alphan1ner\">/u/alphan1ner</a> for this explanation.</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/CryptoCurrency/comments/pscd8i/evergrande_eli5_version/",
  "subreddit": "CryptoCurrency",
  "id": "pscd8i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": " 1. What is Evergrande?\n\nEvergrande is the second largest Chinese property developer. It is the world's\n122nd largest company/group by revenue, and the world's most valuable real\nestate company.\n\n 1. Context for the current situation?\n\nIn recent years, China has experienced a massive housing bubble.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": " 1. エバーグランデとは？\n\nエバーグランデは、中国第2位の不動産開発会社です。世界的に見ても\n世界第122位の売上高を誇る企業/グループであり、世界で最も価値のある不動産会社です。\n不動産会社です。\n\n 1. 現在の状況の背景は？\n\n近年、中国では大規模な住宅バブルが発生しました....",
      "title": "Evergrande: ELI5バージョン。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": " 1. 什么是恒大？\n\n恒大是中国第二大房地产开发商。它是世界上\n它是世界上按收入计算的第122大公司/集团，也是世界上最有价值的房地产公司。\n的房地产公司。\n\n 1. 当前形势的背景？\n\n近年来，中国经历了一场大规模的房地产泡沫....。",
      "title": "恒大。ELI5版本。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": " 1. 什麼是恆大？\n\n恆大是中國第二大房地產開發商。它是世界上\n它是世界上按收入計算的第122大公司/集團，也是世界上最有價值的房地產公司。\n的房地產公司。\n\n 1. 當前形勢的背景？\n\n近年來，中國經歷了一場大規模的房地產泡沫....。",
      "title": "恆大。ELI5版本。"
    }
  ]
}