{
  "author": "leonelfreak",
  "original_created_utc": 1624652733,
  "title": "Why are id's a bad thing when it comes to voting?",
  "created_utc": 1624684778,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I saw a while back thst people wanted to not require an ID when it came to voting. Why would we want that to not be a thing? In the usa of course.</p>\n\n<p>edit* so what im getting so far is that its about poor people(or one person said racism but i dont get whats racist about this). but arent some form of id really cheap(usually under 50 bucks) i thought most people at 18 would have some form of id like a passport,drivers,or just a standard ID. as a hispanic all of my relatives and family have an id and we&#39;re nowhere near middle class so i just expected everyone to have one.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/NoStupidQuestions/comments/o7vsjl/why_are_ids_a_bad_thing_when_it_comes_to_voting/",
  "subreddit": "NoStupidQuestions",
  "id": "o7vsjl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I saw a while back thst people wanted to not require an ID when it came to\nvoting. Why would we want that to not be a thing? In the usa of course.\n\nedit* so what im getting so far is that its about poor people(or one person said\nracism but i dont get whats racist about this). but arent some form of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "少し前に、投票の際に身分証明書を必要としないことを望む人たちがいると見ました。\n投票の際に身分証明書を必要としないようにしたいという意見がありました。なぜそのようなことが必要なのでしょうか？もちろん、アメリカにおいてですが。\n\n編集* 今のところ、私が得たものは、貧しい人々についてのものです（あるいは、ある人は人種差別と言いましたが、私はこれについて何が人種差別なのか分かりません）。\nしかし、何が差別的なのか私にはわかりません。",
      "title": "なぜ投票の際にIDが悪いのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我看到前一段时间，人们希望在投票时不要求出示身份证。\n投票。为什么我们希望这不是一件事呢？当然是在美国。\n\n编辑：到目前为止，我得到的信息是，它与穷人有关（或者有个人说是与种族主义有关）。\n种族主义，但我不明白这有什么可种族主义的）。但是不是某种形式的...",
      "title": "在投票方面，为什么身份证是件坏事？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到前一段時間，人們希望在投票時不要求出示身份證。\n投票。爲什麼我們希望這不是一件事呢？當然是在美國。\n\n編輯：到目前爲止，我得到的信息是，它與窮人有關（或者有個人說是與種族主義有關）。\n種族主義，但我不明白這有什麼可種族主義的）。但是不是某種形式的...",
      "title": "在投票方面，爲什麼身份證是件壞事？"
    }
  ]
}