{
  "author": "ediblepet",
  "the_new_excerpt": "There are trends that catch up like fire here. There's the \"X coin ATH\", which I\nthink is a completely useless kind of post. Little effort, insighless. As if\nmost, if not all, of the users of this sub were not already checking quotations.\nBut another trend that I have noticed recently are sob…",
  "original_created_utc": 1618412135,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここには火のように追いついてくるトレンドがある。X coin ATH」というものがあります。\nこれは全く役に立たない投稿だと思います。努力が足りない、ためにならない。あたかも\nこのサブのユーザーのほとんど、あるいは全員が、すでに引用をチェックしていないかのようです。\nしかし、私が最近気づいたもう一つの傾向は、\"sob...\" です。",
      "title": "ブラジル人のお涙ちょうだい話をupvotingするのはやめてほしい"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有趋势，在这里如火如荼的追赶。有 \"X币ATH\"，这是我\n认为是一种完全无用的帖子。小小的努力，无足轻重。仿佛\n即使不是全部，也是大部分，这个子的用户还没有检查报价。\n但我最近注意到的另一个趋势是，泣...",
      "title": "请不要再给巴西人的泣诉故事上票了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有趨勢，在這裏如火如荼的追趕。有 \"X幣ATH\"，這是我\n認爲是一種完全無用的帖子。小小的努力，無足輕重。彷彿\n即使不是全部，也是大部分，這個子的用戶還沒有檢查報價。\n但我最近注意到的另一個趨勢是，泣...",
      "title": "請不要再給巴西人的泣訴故事上票了"
    }
  ],
  "title": "Please stop upvoting Brazilian sob stories",
  "created_utc": 1618425648,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There are trends that catch up like fire here. There&#39;s the &quot;X coin ATH&quot;, which I think is a completely useless kind of post. Little effort, insighless. As if most, if not all, of the users of this sub were not already checking quotations. But another trend that I have noticed recently are sob stories. Those sob stories created by <em>allegedly</em> Brazilians. Yes, I live in Brazil and this is a shitty country. We have a president intent on opening street stores and all businesses regardless of the pandemic death rate, and it would alright if he had acquired vaccines in 2020 (he snubbed the offers instead). Yes, the closures have created an enormous economic crisis, and millions of families now face starvation. But I didn&#39;t know this were a sub where people can pan handle. If a Brazilian knows English and has money in crypto, they are part of the (Brazilian) 1%. Stop rewarding con artists. They&#39;ll just tell each other and come here for more</p>\n</div><!-- SC_ON -->",
  "score": 596,
  "permalink": "/r/CryptoCurrency/comments/mqs9wc/please_stop_upvoting_brazilian_sob_stories/",
  "subreddit": "CryptoCurrency",
  "id": "mqs9wc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566616774
}