{
  "author": "pbjclimbing",
  "original_created_utc": 1660596259,
  "title": "How to get ETH in Reddit Vault without using FTX",
  "created_utc": 1660638711,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;There are currently two easy ways to ETH on Arbitrum Nova, buying it through FTX and using the Arbitrum Nova bridge. I did not want to KYC with another exchange so I went the Arbitrum Nova bridge. I am going to talk about MetaMask, but you can use most crypto wallets for this process.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;You need ETH on Ethereum off of an exchange in a crypto wallet. This can be any wallet and does not need to be your Reddit Vault wallet. &lt;/li&gt;\n&lt;li&gt;Set your MetaMask to Ethereum Network (this is the default network)&lt;/li&gt;\n&lt;li&gt;Go to &lt;a href=\"https://bridge.arbitrum.io/\"&gt;https://bridge.arbitrum.io/&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;Toggle the receiving network from Arbitrum One to Arbitrum Nova (the orange option)&lt;/li&gt;\n&lt;li&gt;Input the amount that you want to send to Arbutrum Nova, not including gas. You will see a gas estimate on the right hand side, ignore this. Your gas will be ~$1&lt;/li&gt;\n&lt;li&gt;Click &amp;quot;Move Funds to Arbitrum Nova&amp;quot; (make sure this is orange and not Arbitrum One)&lt;/li&gt;\n&lt;li&gt;A MetaMask popup window will appear and show you the estimated gas fee, click &amp;quot;EDIT&amp;quot;&lt;/li&gt;\n&lt;li&gt;Click &amp;quot;Advanced Options&amp;quot;&lt;/li&gt;\n&lt;li&gt;Edit the bottom box that says &amp;quot;Max Fee&amp;quot; to 5-6. This changes how much you are willing to pay in gas and will likely make the bridging take between 10-90 minutes (I have done this three times with 5 GWEI and it took under 15 minutes each time). This will essentially make gas cost $1&lt;/li&gt;\n&lt;li&gt;Click the bottom &amp;quot;SAVE&amp;quot;&lt;/li&gt;\n&lt;li&gt;Click &amp;quot;Confirm&amp;quot; on MetaMask&lt;/li&gt;\n&lt;li&gt;The Arbitrum Bridge page will show you a timer saying 10 minutes, but since we are doing this for cheap and not fast it might go past the time, ignore it.&lt;/li&gt;\n&lt;li&gt;It will fill in the transactions when they are completed&lt;/li&gt;\n&lt;li&gt;Add the Arbitrum Nova network to your MetaMask, &lt;a href=\"https://chainlist.org/chain/42170\"&gt;https://chainlist.org/chain/42170&lt;/a&gt; allows you to automatically add it or you can click &amp;quot;Ethereum Mainnet&amp;quot; and scroll down to &amp;quot;Add Network&amp;quot; and do it manually&lt;/li&gt;\n&lt;li&gt;Now you can send your ETH that is Arbitrum Nova to your Reddit Vault address which you can see in the app under &amp;quot;Vault&amp;quot;&lt;/li&gt;\n&lt;li&gt;In MetaMask click the &amp;quot;Send&amp;quot; button in the middle, input the amount and address you want to send it to. Edit the gas like above to a fraction of 1 GWEI, MetaMask says to use way more than you need with Arbitrum Nova.&lt;/li&gt;\n&lt;li&gt;Send away and you can see the transaction on the blockchain explorer &lt;a href=\"https://nova-explorer.arbitrum.io/\"&gt;https://nova-explorer.arbitrum.io/&lt;/a&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;If you want to use your Reddit Vault wallet outside of Reddit to send your MOONs to send to a non vault wallet, add liquidity on SushiSwap, or swap crypto with MOONs you can follow these steps to use your recovery phrase to access your wallet outside of Reddit. I am going to use MetaMask again, but you can use any wallet that accepts a 12 word seed phrase&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;You need a fresh install of MetaMask (it can be a different browser on the same computer) since MetaMask does not allow you to input a seed phrase on an existing wallet. Get this directly from MetaMask and not the app store.&lt;/li&gt;\n&lt;li&gt;Find your seed phrase on the Reddit App under &amp;quot;Vault&amp;quot;&lt;/li&gt;\n&lt;li&gt;Choose use seed phrase and input the 12 words.&lt;/li&gt;\n&lt;li&gt;Do step 14 above to add the Arbitrum Nova network.&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 310,
  "permalink": "/r/CryptoCurrency/comments/wpadwe/how_to_get_eth_in_reddit_vault_without_using_ftx/",
  "subreddit": "CryptoCurrency",
  "id": "wpadwe",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "There are currently two easy ways to ETH on Arbitrum Nova, buying it through FTX\nand using the Arbitrum Nova bridge. I did not want to KYC with another exchange\nso I went the Arbitrum Nova bridge. I am going to talk about MetaMask, but you\ncan use most crypto wallets for this process.\n\n 1.  You…"
}