{
  "author": "Aesah",
  "the_new_excerpt": "No one can predict the future and I am just some random guy on reddit, but I\nsuspect these will be the lowest prices you'll see on some of the bigger cryptos\nfor a long time and a great time to sell some stuff so you can get more.\nPersonally I am selling my Nintendo Switch, my entire collection of…",
  "original_created_utc": 1621282009,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "誰も未来を予測することはできませんし、私はredditのランダムな男に過ぎませんが、私は\nしかし、私はこれらの価格が主要な暗号のいくつかで見られる最も低い価格になると思います。\nの最低価格になると思います。\n個人的には、Nintendo Switchと、私の全コレクション...",
      "title": "今すぐ売ることを強くお勧めします。財務上のアドバイスではありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "没有人可以预测未来，我也只是reddit上的一些随机的人，但我\n但我认为这将是你在一些大的加密货币上看到的最低价格。\n的最低价格，也是卖掉一些东西的好时机，这样你就可以得到更多。\n就我个人而言，我正在出售我的任天堂Switch，我的全部收藏品。",
      "title": "我强烈建议现在就卖掉。不是财务建议。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "沒有人可以預測未來，我也只是reddit上的一些隨機的人，但我\n但我認爲這將是你在一些大的加密貨幣上看到的最低價格。\n的最低價格，也是賣掉一些東西的好時機，這樣你就可以得到更多。\n就我個人而言，我正在出售我的任天堂Switch，我的全部收藏品。",
      "title": "我強烈建議現在就賣掉。不是財務建議。"
    }
  ],
  "title": "I strongly recommend selling right now. Not financial advice.",
  "created_utc": 1621294237,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>No one can predict the future and I am just some random guy on reddit, but I suspect these will be the lowest prices you&#39;ll see on some of the bigger cryptos for a long time and a great time to sell some stuff so you can get more. Personally I am selling my Nintendo Switch, my entire collection of Warhammer 40k minis, and my golf set and splitting the profits between BTC and ETH. It&#39;s true that my quality of life will be slightly decreased for a little bit but I think I&#39;ll be happier in the long run.</p>\n</div><!-- SC_ON -->",
  "score": 7049,
  "permalink": "/r/CryptoCurrency/comments/neqe2m/i_strongly_recommend_selling_right_now_not/",
  "subreddit": "CryptoCurrency",
  "id": "neqe2m",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590799676
}