{
  "author": "vvillehelm",
  "original_created_utc": 1639809509,
  "title": "Bitcoin is apolitical",
  "created_utc": 1639870382,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is a simple message to the community. Bitcoin is a tool that brings sovereignty back to individuals, but it is not political and should not become so.&lt;/p&gt;\n\n&lt;p&gt;People are political, but Bitcoin is apolitical, and it should be used by whoever has a use for it, not just by [insert local political party of preference].&lt;/p&gt;\n\n&lt;p&gt;It’s this kind of non-discriminating adoption that will bring us to the ultimate victory, where all kinds of people, from different cultures and religions, different politics and world views, can be afforded a sovereignty and personal autonomy that is currently under attack from all directions.&lt;/p&gt;\n\n&lt;p&gt;Bitcoin has the promise to fix an enormous amount of what is wrong in todays economic landscape, but humans are a complicated bunch and that will continue to be the case and not something that needs to be solved by this technology.&lt;/p&gt;\n\n&lt;p&gt;So I would like us, in this subreddit, to push back against some of the over-politicising of Bitcoin that is on the increase in here.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 157,
  "permalink": "/r/Bitcoin/comments/rj1hrk/bitcoin_is_apolitical/",
  "subreddit": "Bitcoin",
  "id": "rj1hrk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is a simple message to the community. Bitcoin is a tool that brings\nsovereignty back to individuals, but it is not political and should not become\nso.\n\nPeople are political, but Bitcoin is apolitical, and it should be used by\nwhoever has a use for it, not just by [insert local political party…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは、地域社会へのシンプルなメッセージです。ビットコインは\n主権は個人に戻されますが、政治的なものではありませんし、そうなるべきでもありません。\nということです。\n\n人々は政治的ですが ビットコインは非政治的です そしてそれは以下の人々によって使用されるべきです\nその用途がある人なら誰でも、[地域政党を挿入して...]だけではありません。",
      "title": "ビットコインは非政治的である"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是给社会的一个简单信息。比特币是一种工具，它把主权还给个人。\n主权回到个人手中，但它不是政治，也不应该成为政治。\n如此。\n\n人是政治的，但比特币是非政治的，它应该被任何人使用。\n谁都可以使用它，而不仅仅是[插入当地政党......]。",
      "title": "比特币是非政治性的"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是給社會的一個簡單信息。比特幣是一種工具，它把主權還給個人。\n主權回到個人手中，但它不是政治，也不應該成爲政治。\n如此。\n\n人是政治的，但比特幣是非政治的，它應該被任何人使用。\n誰都可以使用它，而不僅僅是[插入當地政黨......]。",
      "title": "比特幣是非政治性的"
    }
  ]
}