{
  "author": "Cool_Internet_Name",
  "original_created_utc": 1645004860,
  "title": "When will India be held responsible for their scam call centers?",
  "created_utc": 1645012502,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Individual people on YouTube have done more for people against India scam call centers than our own governments. &lt;/p&gt;\n\n&lt;p&gt;Scam call centers are stealing money from our most vulnerable citizens and destroying generational wealth.  &lt;/p&gt;\n\n&lt;p&gt;At this point, scam call centers are “legitimate careers” for some people in India and are essentially office buildings. &lt;/p&gt;\n\n&lt;p&gt;I’m “attacked” by scammers several times A DAY. Phone calls and text messages, all in an attempt to gain access to my life/money and destroy me financially. &lt;/p&gt;\n\n&lt;p&gt;These calls have been going on for years. YEARS!!!  In my line of work, I get called from strange numbers all the time. If I don’t pick up, I could miss an opportunity. &lt;/p&gt;\n\n&lt;p&gt;So I’m asking. When will India be held responsible for their scam call centers?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 147,
  "permalink": "/r/TooAfraidToAsk/comments/sts3cr/when_will_india_be_held_responsible_for_their/",
  "subreddit": "TooAfraidToAsk",
  "id": "sts3cr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Individual people on YouTube have done more for people against India scam call\ncenters than our own governments.\n\nScam call centers are stealing money from our most vulnerable citizens and\ndestroying generational wealth.\n\nAt this point, scam call centers are “legitimate careers” for some people…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "YouTubeの個々の人々は、インドの詐欺電話に対する人々のために、より多くのことをしてきました。\n私たちの政府よりも。\n\n詐欺のコールセンターは 最も弱い市民からお金を奪い\n世代間の富を破壊する。\n\nこの時点で、詐欺のコールセンターは一部の人々にとって「正当なキャリア」なのです...。",
      "title": "インドが詐欺のコールセンターの責任を問われるのはいつになるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "个人在YouTube上为人们反对印度诈骗电话中心所做的工作比我们自己的政府还要多。\n比我们自己的政府做得更多。\n\n诈骗电话中心正在从我们最脆弱的公民那里偷钱，并破坏了一代人的财富。\n破坏了一代人的财富。\n\n在这一点上，诈骗电话中心对一些人来说是 \"合法的职业\"...",
      "title": "印度何时才能为他们的欺诈性呼叫中心负责？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "個人在YouTube上爲人們反對印度詐騙電話中心所做的工作比我們自己的政府還要多。\n比我們自己的政府做得更多。\n\n詐騙電話中心正在從我們最脆弱的公民那裏偷錢，並破壞了一代人的財富。\n破壞了一代人的財富。\n\n在這一點上，詐騙電話中心對一些人來說是 \"合法的職業\"...",
      "title": "印度何時才能爲他們的欺詐性呼叫中心負責？"
    }
  ]
}