{
  "author": "RumIsTheMindKiller",
  "original_created_utc": 1628453407,
  "title": "I am Soviet party elite in the 1980s with first access to any domestic food products, what exactly am I eating that the general public is not?",
  "created_utc": 1628474810,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I always read that one of the reasons of the ubiquitous lines associated with late communist regimes was that whatever was produced domestically went to people with access first and never made it into stores.</p>\n\n<p>But if you were such an elite did you have access to fruits and vegetables the general public didn’t? Did they eat dishes that would have been unknown to ordinary citizens?</p>\n</div><!-- SC_ON -->",
  "score": 134,
  "permalink": "/r/AskHistorians/comments/p0lxz7/i_am_soviet_party_elite_in_the_1980s_with_first/",
  "subreddit": "AskHistorians",
  "id": "p0lxz7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I always read that one of the reasons of the ubiquitous lines associated with\nlate communist regimes was that whatever was produced domestically went to\npeople with access first and never made it into stores.\n\nBut if you were such an elite did you have access to fruits and vegetables the\ngeneral…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "いつも読んでいるのですが、レイト・コムにはどこにでもあるようなセリフの理由の一つは\n晩年の共産主義体制に伴う回線の偏在の理由のひとつは、国内で生産されたものが\n国内で生産されたものは、アクセスの良い人に先に行き、店頭には並ばなかったからだと読んだことがあります。\n\nしかし、もしあなたがそのようなエリートであったならば、一般の人々が手にする果物や野菜を手に入れることができたでしょうか？\n一般の...",
      "title": "私は1980年代のソビエト党のエリートで、国産の食品を最初に手に入れることができますが、一般の人が食べられないものは一体何でしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我总是读到，与晚期共产主义政权相关的线条无处不在的原因之一是，不管是国内生产的还是国外生产的，都会被认为是不合格的。\n晚期共产主义政权的原因之一是，无论国内生产什么，都是先给有机会的人，而不是进入商店。\n有机会的人首先使用，而不是进入商店。\n\n但是，如果你是这样一个精英，你是否有机会获得水果和蔬菜？\n一般...",
      "title": "我是80年代的苏联党内精英，可以第一时间吃到任何国内的食品，我到底吃到了什么普通人没有的东西？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我總是讀到，與晚期共產主義政權相關的線條無處不在的原因之一是，不管是國內生產的還是國外生產的，都會被認爲是不合格的。\n晚期共產主義政權的原因之一是，無論國內生產什麼，都是先給有機會的人，而不是進入商店。\n有機會的人首先使用，而不是進入商店。\n\n但是，如果你是這樣一個精英，你是否有機會獲得水果和蔬菜？\n一般...",
      "title": "我是80年代的蘇聯黨內精英，可以第一時間喫到任何國內的食品，我到底喫到了什麼普通人沒有的東西？"
    }
  ]
}