{
  "author": "sotonohito",
  "original_created_utc": 1631544186,
  "title": "Why does it cost tens of thousands of dollars up front to get a mortgage on a home which will cost **LESS** monthly than rent on an equivalent home but if you can't afford that huge up front you're too poor to pay less monthly?",
  "created_utc": 1631570422,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I don&#39;t make enough money to pay a monthly mortgage/tax/etc of about $1500. But I&#39;m rich enough to pay rent on a $1795 home. How does that make any sense at all? Why would a banker think that&#39;s reasonable?</p>\n\n<p>What is the point of a giant up front cost? It seems purely malicious to me, nothing but a way to keep poor people poor. </p>\n\n<p>But I&#39;d assume I&#39;m wrong and there&#39;s some at least supposedly good reason for it?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/pngugn/why_does_it_cost_tens_of_thousands_of_dollars_up/",
  "subreddit": "NoStupidQuestions",
  "id": "pngugn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I don't make enough money to pay a monthly mortgage/tax/etc of about $1500. But\nI'm rich enough to pay rent on a $1795 home. How does that make any sense at\nall? Why would a banker think that's reasonable?\n\nWhat is the point of a giant up front cost? It seems purely malicious to me,\nnothing but a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "毎月1500ドル程度の住宅ローン／税金／その他を払えるほどの収入はありません。しかし\n1795ドルの家の家賃を払えるだけのお金持ちです。それはどうしたら意味があるのでしょうか？\nのか？なぜ銀行員はそれが合理的だと思うのか？\n\n巨大な前払い費用に何の意味があるのか？私には純粋に悪意があるとしか思えません。\nただの...",
      "title": "なぜ、住宅ローンを組むのに何万ドルもの前金がかかり、同等の住宅の家賃よりも月々の負担が**少なくて済むのに、その莫大な前金を払えない人は月々の負担が少ないほど貧乏なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我赚的钱不够支付每月约1500美元的抵押贷款/税款/等。但是\n我很有钱，可以支付1795美元的房子的租金。这怎么会有意义呢？\n这有什么意义？为什么银行家会认为这很合理？\n\n巨大的前期成本有什么意义？在我看来，这纯粹是恶意的。\n只不过是一个...",
      "title": "为什么要先花几万块钱才能获得房屋的抵押贷款，而每月的费用比同等房屋的租金还要少**，但如果你不能负担那么巨额的预付款，你就太穷了，无法每月支付更少的费用？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我賺的錢不夠支付每月約1500美元的抵押貸款/稅款/等。但是\n我很有錢，可以支付1795美元的房子的租金。這怎麼會有意義呢？\n這有什麼意義？爲什麼銀行家會認爲這很合理？\n\n巨大的前期成本有什麼意義？在我看來，這純粹是惡意的。\n只不過是一個...",
      "title": "爲什麼要先花幾萬塊錢才能獲得房屋的抵押貸款，而每月的費用比同等房屋的租金還要少**，但如果你不能負擔那麼鉅額的預付款，你就太窮了，無法每月支付更少的費用？"
    }
  ]
}