{
  "author": "ziggyzago",
  "the_new_excerpt": "I have some friends and family who are pro crypto. I have other important people\nin my life that think crypto is a scam. (A tulipe they call it.) Last week I\nfinally convinced one of my best friends to buy bitcoin above 60K. The dump on\nSaturday effected our relationship. He is very upset with me.…",
  "original_created_utc": 1618805214,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の友人や家族の中には、暗号化に賛成の人もいます。他の重要な人たちもいます。\n先週、私は「暗号は詐欺だ」と考えている人がいました。先週、私はついに親友の一人に60K以上のビットコインを買うように説得しました。\n先週、私はついに親友の一人に6万円以上のビットコインを買うように説得しました。土曜日のダンプは\n土曜日のダンプは僕らの関係に影響を与えた。彼は僕にとても腹を立てている....",
      "title": "先週、友人にBTCを買うように言いました。ダンプの後、彼は私を相手にしなくなりました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我有一些朋友和家人是支持加密的。我有其他重要的人\n在我的生活中，认为加密是一个骗局。(他们称之为郁金香)上周我...\n终于说服了我最好的一个朋友买入6万以上的比特币。抛出的\n星期六影响了我们的关系。他对我很不满....。",
      "title": "上周我让我朋友买BTC。抛售后他就不搭理我了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我有一些朋友和家人是支持加密的。我有其他重要的人\n在我的生活中，認爲加密是一個騙局。(他們稱之爲鬱金香)上週我...\n終於說服了我最好的一個朋友買入6萬以上的比特幣。拋出的\n星期六影響了我們的關係。他對我很不滿....。",
      "title": "上週我讓我朋友買BTC。拋售後他就不搭理我了。"
    }
  ],
  "title": "I told my friend to buy BTC last week. He stopped taking to me after the dump.",
  "created_utc": 1618817431,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have some friends and family who are pro crypto. I have other important people in my life that think crypto is a scam. (A tulipe they call it.) Last week I finally convinced one of my best friends to buy bitcoin above 60K. The dump on Saturday effected our relationship. He is very upset with me. I’ve been in the crypto space for almost one year. I would recommend to everyone to avoid giving financial advice to friends and family. It’s not worth ruining a relationship.</p>\n</div><!-- SC_ON -->",
  "score": 6665,
  "permalink": "/r/CryptoCurrency/comments/mtsq3g/i_told_my_friend_to_buy_btc_last_week_he_stopped/",
  "subreddit": "CryptoCurrency",
  "id": "mtsq3g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171521468
}