{
  "author": "vasesimi",
  "the_new_excerpt": "Nano Dimension Ltd., together with its subsidiaries, provides additive\nelectronics in Israel and internationally. Its flagship product is the\nproprietary DragonFly lights-out digital manufacturing (LDM) system, a precision\nsystem that produces professional multilayer circuit-boards, radio…",
  "original_created_utc": 1621683676,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ナノ・ディメンション社は、その子会社とともに、アディティブ・エレクトロニクスを\n添加剤を用いたエレクトロニクスをイスラエル国内および海外で提供しています。主力製品は\nドラゴンフライ・ライトアウト・デジタル・マニュファクチャリング(LDM)システムは、高精度なシステムです。\nこのシステムでは、プロ仕様の多層回路基板や無線機器などを製造することができます。",
      "title": "ナノディメンションは時価総額と同額のキャッシュを持っている"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Nano Dimension有限公司，连同其子公司，在以色列和国际上提供增殖型\n在以色列和国际上提供电子技术。其旗舰产品是\n它的旗舰产品是专有的DragonFly light-out数字制造（LDM）系统。\n该系统可以生产出专业的多层电路板、无线电设备和其他产品。",
      "title": "Nano Dimension公司的现金与市值一样多"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Nano Dimension有限公司，連同其子公司，在以色列和國際上提供增殖型\n在以色列和國際上提供電子技術。其旗艦產品是\n它的旗艦產品是專有的DragonFly light-out數字製造（LDM）系統。\n該系統可以生產出專業的多層電路板、無線電設備和其他產品。",
      "title": "Nano Dimension公司的現金與市值一樣多"
    }
  ],
  "title": "Nano Dimension has as much cash as market cap",
  "created_utc": 1621699096,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Nano Dimension Ltd., together with its subsidiaries, provides additive electronics in Israel and internationally. Its flagship product is the proprietary DragonFly lights-out digital manufacturing (LDM) system, a precision system that produces professional multilayer circuit-boards, radio frequency antennas, sensors, conductive geometries, and molded connected devices for prototyping through custom additive manufacturing. The company also provides nanotechnology based conductive and dielectric inks; and DragonFly and Switch software to manage the design file and printing process. It markets and sells products and services to companies that develop products with electronic components, including companies in the defense, automotive, consumer electronics, semiconductor, aerospace, and medical industries, as well as research institutes. (description taken from Yahoo finance)</p>\n\n<p>This is a company that became a YouTube favorite last year together with Bionano genomics. Cathie Wood started buying into them and then they exploded and became super popular. Their price went from the low 1-2$ to over 15$. During this run some interesting things happened. They started doing stock offerings. When the price went up with 50% they did another offering. The price was dropping 20% and then rallying again and then another offering was coming. They did this again and again and again and at some point people just said the company is diluting too much and it’s going to be a flop. And although usually second offerings are bad in this case I think it was brilliant for the company. Their price went way over what it is supposed to be and they took the advantage to hoard cash. So much that now they have 1.47 billion in cash and their entire market cap is 1.58 billion. That means if you would buy all the shares at the current market price you could pocket the cash and have the company for 110 mil and that makes this company to seem really cheap and the risk of the price going down significantly is really low. Even if the entire manufacturing world would stop today you would basically get 93% of your investment back. Their price was away from fundamentals based on hype and the company took advantage of that which I think it’s a smart move. Now the CEO said they will not do any more dilution because they have enough cash for their planned mergers and acquisitions and also for R&amp;D.</p>\n\n<p>Since they hoarded this cash they acquired two companies: one that is expert in printing micro components (super small mechanical parts) and a machine learning company that they plan to use to improve the quality of their prints and make their 3D printers into a network of printers. I think both of these will help them make more complex PCBAs that could have studs and mechanical clips 3D printed and will reduce the time for assembly. At their last investors call they also announced that they will launch a new 3D printer in the summer. Also they are developing next-gen machines for production (expected to come in 1-2 years). And on top of this they are planning to acquire companies, including PCB manufacturers in Europe and/or US. Quick note: The CEO mentioned a few times they will not acquire companies just to acquire, they will buy someone when the price is right and it helps them to develop vertically and improve their printing tech.</p>\n\n<p>Another way they are consuming the money is R&amp;D and marketing. They need to be heard of to be able to sell and they also need to have high tech. From what I understood they are using silver ink for conductive parts which is conductive enough for anything and for dielectric what they are using now can make PCBs but not high tech ones. They mentioned they made some breakthrough in dielectric materials that they can use but it’s not published yet what it is. It seems at least 30% of R&amp;D expense goes in the materials exploration. I personally love this because if they can position as leaders in this field and have the best tech their competitiveness will make them a behemoth in this field.</p>\n\n<p>The company makes money in two distinct way: selling 3D printers for PCBAs for companies or printing PCBAs for companies as a service. Last year, due to corona their sale of 3D printers went down and that’s understandable. For their 3D printing service I think they are having an issue due to the shortage of semiconductors. Right now if you want to make a board you can print it in China and depending on how fast you want it ready it will cost you more. But if you are ok with waiting 4 weeks for your boards then they become really cheap. Due to shortages in components a lot of companies are ok with waiting because it doesn’t make sense to pay a lot to have your board fast if you need to wait either way for components. The trick is if you want to have it 3D printed by Nano Dimension it’s relatively expensive because it’s fast. Until the semiconductor shortage get’s a bit under control I see NNDM suffering in this field. I had a discussion with their sales representative and got an idea on their prices, it’s a bit high comparatively to traditional PCBAs, while the dimension of the PCBAs they can print is relatively small. Also the CEO said they do not plan to be operating cashflow positive in the next 2 years. This is because they want to expand and cash is not a problem (to put it in perspective, they have 1.4 billion in cash and the 2 new companies costed less than 200mil, R&amp;D costs for a quarter were 3.7 mil). It’s clear that the focus is growth and then switching to positive cashflow.</p>\n\n<p>At their last investor call the CEO of NNDM is mentioning that he wants to revolutionize the printing of PCBAs so that you print just what you need. This will be interesting if it’s possible but I personally doubt this will happen in the next 3-4 years because I’ve seen personally how efficient factories are now when it comes to PCBA manufacturing. What I think it will happen (take this with a chunk of salt) is that they will start printing prototypes for a lot of companies and at some point those companies will just acquire 3D printers for a more agile development in their R&amp;D. Also the space industry will probably use them more and more (they already sent some 3D printed boards to the ISS).</p>\n\n<p>Below you can see their price evolution and all the drops on the way up represent a new stock offering. You can also see that they are increasing their revenue year by year (with the exception of 2020 which is a special year). And they reduced the bleeding in cash flow in the last years. That will look worse for the next years but now they have cash to work with.</p>\n\n<p>For disclosure: I am long NNDM.</p>\n\n<p>This is just for information purposes, it is not investment advice, I am not an investing professional. Do your own due diligence before investing in anything and remember: The market can remain irrational more than you can stay solvent.</p>\n\n<p>Have a good week!</p>\n</div><!-- SC_ON -->",
  "score": 127,
  "permalink": "/r/investing/comments/nigsd4/nano_dimension_has_as_much_cash_as_market_cap/",
  "subreddit": "investing",
  "id": "nigsd4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197388312
}