{
  "author": "GarthWaylon",
  "the_new_excerpt": "I ran into a really interesting conundrum today when trying to answer whether\ncriminals deserve punishment because it's a functional deterrent, or because bad\nactions deserve retribution in like moral degree. (Inspired by the recent video\nby PhilosophyTube)\n\nI'm a believer in talionic justice, eye…",
  "original_created_utc": 1615590829,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "今天，我在试图回答是否有以下问题时遇到了一个非常有趣的难题\n罪犯应该受到惩罚，因为它是一个功能性的威慑，或者因为坏的。\n的行为应该受到同样的道德程度的报应。(灵感来自于最近的视频\n哲学台)\n\n我相信塔里昂的正义，眼睛... ...",
      "title": "好人就该有好事（坏人就该有坏事）吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天，我在試圖回答是否有以下問題時遇到了一個非常有趣的難題\n罪犯應該受到懲罰，因爲它是一個功能性的威懾，或者因爲壞的。\n的行爲應該受到同樣的道德程度的報應。(靈感來自於最近的視頻\n哲學臺)\n\n我相信塔里昂的正義，眼睛... ...",
      "title": "好人就該有好事（壞人就該有壞事）嗎？"
    }
  ],
  "title": "Do Good People Deserve Good Things (And Bad People Bad Things)",
  "created_utc": 1615649564,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I ran into a really interesting conundrum today when trying to answer whether criminals deserve punishment because it&#39;s a functional deterrent, or because bad actions deserve retribution in like moral degree. (Inspired by the recent video by PhilosophyTube)</p>\n\n<p>I&#39;m a believer in talionic justice, eye for an eye, not necessarily because it&#39;s a good way to deter crimes and mistreatment, but because I believe it&#39;s proper to respond to an action done to you in like quality and degree, within reason. Similarly, if someone does a positive action, they deserve a negotiated reward proportional to their good deed, monetary rewards for production in a market system for example.</p>\n\n<p>I realized that I don&#39;t have a reason to believe that good people deserve good things, or bad things for bad people, other than functional incentive. Does anyone deserve happiness, or suffering, independent of incentivizing them to act positively in the future by punishing negative actions and incentivizing good ones?</p>\n\n<p>Does a mass murderer deserve to suffer outright, or is suffering inflicted to them exclusively as a way to stop them from killing more people in the future, and to show to other would-be murderers what happens when you do such a crime?</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/askphilosophy/comments/m3tr0e/do_good_people_deserve_good_things_and_bad_people/",
  "subreddit": "askphilosophy",
  "id": "m3tr0e",
  "is_self": true,
  "media": null,
  "is_video": false
}