{
  "author": "SansSinn",
  "the_new_excerpt": "The following is extremely speculative. Furthermore its extreme speculation by\nsomeone not qualified to speculate. Further further more, ive been doing\ntechnical analysis for a period of 2 days so Im serious about the amateur bit.\nThis is not financial advice.\n\nCanoo ($GEOV) is an electric vehicle…",
  "original_created_utc": 1612722735,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "以下是极度的推测。此外其极度推测的\n一个没有资格去猜测的人。更进一步，我一直在做\n技术分析2天的时间，所以我认真的业余位。\n这不是财务建议。\n\nCanoo（$GEOV）是一家电动车...",
      "title": "GOEV，以及一个业余的技术分析镜头。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "以下是極度的推測。此外其極度推測的\n一個沒有資格去猜測的人。更進一步，我一直在做\n技術分析2天的時間，所以我認真的業餘位。\n這不是財務建議。\n\nCanoo（$GEOV）是一家電動車...",
      "title": "GOEV，以及一個業餘的技術分析鏡頭。"
    }
  ],
  "title": "GOEV, and an Amateur's shot at Technical Analysis",
  "created_utc": 1612733513,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The following is extremely speculative. Furthermore its extreme speculation by someone not qualified to speculate. Further further more, ive been doing technical analysis for a period of 2 days so Im serious about the amateur bit. This is not financial advice.</p>\n\n<p>Canoo ($GEOV) is an electric vehicle company focused on delivery vans and particularly ugly consumer vans. Its really hard to tell if Canoo is a good long term investment, id imagine alot of EV companies will be wiped out as the market matures over the next couple years. In the short term they have gotten some good news, but thats not what this post is about.</p>\n\n<p>$GOEV is, as far as i can tell, caught in a large Symmetric Triangle pattern. With a difference between the top and bottom of the pattern at its start  ~ $10. Given $GEOV is currently trading at 17.63, this would represent over half of the stocks total value. If the stock trends upward coming out of the pattern that would mean a target price of 27-28 dollars and nice profit on some rampant speculation. I consider this fairly risky and not recommend anyone actually attempt it.</p>\n\n<p>If anyone here is more familiar with TA, any critiques on my reasoning?</p>\n\n<p>EDIT: Image of chart here: <a href=\"https://ibb.co/wQ8Htwf\">https://ibb.co/wQ8Htwf</a></p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/investing/comments/lesa8e/goev_and_an_amateurs_shot_at_technical_analysis/",
  "subreddit": "investing",
  "id": "lesa8e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123199865
}