{
  "author": "_finalOctober_",
  "the_new_excerpt": "Hi.\n\nSome of you know me, some of you don't. If you DO, I ask that you not shill for\nme in the comments below, so we can stay within the rules of this sub.\n\nThis post is for the newbies, it is written as such, if you already know what\ndelta hedging is, this post isn't for you. If you don't, well,…",
  "original_created_utc": 1612671089,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "嗨，你们有些人认识我，有些人不认识我。\n\n你们有些人认识我，有些人不认识。如果你们认识我，我请你们不要为我卖命。\n我在下面的评论中，这样我们就可以在本子的规则内。\n\n这篇文章是写给新手的，是这样写的，如果你已经知道什么是\n三角洲对冲是，这篇文章不适合你。如果你不知道，那么... ...",
      "title": "灾难来临的解剖。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嗨，你們有些人認識我，有些人不認識我。\n\n你們有些人認識我，有些人不認識。如果你們認識我，我請你們不要爲我賣命。\n我在下面的評論中，這樣我們就可以在本子的規則內。\n\n這篇文章是寫給新手的，是這樣寫的，如果你已經知道什麼是\n三角洲對沖是，這篇文章不適合你。如果你不知道，那麼... ...",
      "title": "災難來臨的解剖。"
    }
  ],
  "title": "The Anatomy of a Coming Disaster.",
  "created_utc": 1612696917,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi.</p>\n\n<p>Some of you know me, some of you don&#39;t.  If you DO, I ask that you not shill for me in the comments below, so we can stay within the rules of this sub.</p>\n\n<p>This post is for the newbies, it is written as such, if you already know what delta hedging is, this post isn&#39;t for you.  If you <em>don&#39;t</em>, well, lads and lasses, this is for you.</p>\n\n<p>We need to understand a few basic things here, and in keeping with the spirit of this post, we&#39;re going to keep it dead simple.</p>\n\n<p>Market Makers (the big dogs behind the scenes, facilitating your yolos) DO NOT CARE if your options plays pay out for you.  They would be crazy to take on the level of risk that selling you an unhedged call or put would represent.  These guys make money in other ways.  So how can they not care?  Simple, they hedge.  Generally speaking, they buy enough shares when you buy a call so that even if you win hugely, they simply sell the shares they bought when you bought the call, and remain risk neutral.  (Edit, I&#39;ve been asked to explain that market makers make money by recouping the difference between the bid/ask spread.  While this seems small, they do a LOT of it.)</p>\n\n<p>Why does this matter?</p>\n\n<p>Well, it matters because it introduces <em>leverage</em>.  Which simply means it amplifies the effect your money has on the stock market.  </p>\n\n<p>As an example of how this works lets makes up a company.  We&#39;ll call the ticker ABC.  And we&#39;ll say the share price is 10 bucks.   You, as a degenerate yolo artiste, only have 100 bucks to play with, and you think ABC is going to the mewn.  </p>\n\n<p>Now, you could do the boomer thing and just buy 10 shares of ABC (we&#39;ll call this scenario A), but a lifetime of minimum wage and renting a closet for 5k a month has done strange things to your risk management, so you decide to buy calls instead.  You go to whatever broker isn&#39;t fucking robinhood and take a look at your options - and there you see it.  For that SAME 100 bucks you can buy ten calls and leverage a hell of a lot more shares.   (We&#39;ll call this scenario B) So you do it, you buy the calls.</p>\n\n<p>How does your choice effect the underlying stock?</p>\n\n<p>In scenario A, you bought ten shares, you increased demand for the stock by 10 shares, and this does almost but not exactly nothing to the price.</p>\n\n<p>In scenario B, you bought 10 calls, you made Mr. MM buy a lot of shares to hedge your bet, and you increased the demand for the stock by a much larger number of shares.  (This is an over simplification, but that&#39;s what we do here) Which does <em>something</em> to the share price.  Even if it&#39;s pretty small.\n(Edit, as I said, this was an over simplification but I&#39;ve been asked to address it.  Market makers use a number of metrics to determine how many shares they need to hedge your bet.  It is a lot, but it is almost never 100 times your call options)</p>\n\n<p>Now, if you&#39;re part of the &quot;We like ABC stock&quot; gang, and 20 thousand of you buy 10 calls... Well, I forgot my calculator, but suffice to say you&#39;ve just invited market makers to buy a FUCK TON of shares.  Just this, without any actual change in earnings, outlook, of fundamentals on ABC, puts tremendous bullish pressure on the stock <em>for the term of the option</em></p>\n\n<p>And THAT my friends, is the market we find ourselves in.  Talking heads on the news continue to talk about how &quot;CraZy thE p/E raTiOs haVe bEcomE!!!&quot;  Without mentioning what is actually driving this phenomenon.</p>\n\n<p>Its options.  Specifically since March.  </p>\n\n<p>So with that I&#39;ll tell you something pretty goddamn spectacular.  The stock market has become a <em>derivative</em> of the options market.  Earnings don&#39;t matter, fundamentals don&#39;t matter, past performance doesn&#39;t matter. The OPTIONS matter. </p>\n\n<p>This has happened before, in a very different way.  You know how there was a lot of noise in 08 about all the housing derivatives?  We&#39;re there again, except for instead of CDOs it&#39;s happening with with the shares of the biggest companies in the world.</p>\n\n<p>Want proof?  Go look at 10 day spy chart, right now.  Then go look at a GME chart.  Look what happens to spy, tick for tick, as GME rises and falls. When the entire options meme market is focused on one ticker.</p>\n\n<p>So what do we do about it?  Nobody knows.  I do know this, GME was only the <em>beginning</em>.  Retail knows it has the bull by the tail now.  What happens when the stock market becomes a lagging indicator of the sentiment of retail bull chads?</p>\n\n<p>I don&#39;t know, but it&#39;s going to be <em>spectacular</em>.</p>\n\n<p>Edit, much of the thinking around this post comes from months of conversation with a friend of mine.  She&#39;s pointed out since I posted this that she has written this up in a way 10 of us will understand in her latest blog post - which can be found here: <a href=\"https://nope-its-lily.medium.com/options-degenerate-marketplaces-part-1-b0ddf1c96fa6\">https://nope-its-lily.medium.com/options-degenerate-marketplaces-part-1-b0ddf1c96fa6</a></p>\n</div><!-- SC_ON -->",
  "score": 6143,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/W0FhtvUg9_37NlcrQwndgNghcKjjMCjwuFr2GLdne6M.jpg?auto=webp&s=ea897c691b35c17a9fce4399422d9bbe5cb7ef35",
          "width": 600,
          "height": 600
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/W0FhtvUg9_37NlcrQwndgNghcKjjMCjwuFr2GLdne6M.jpg?width=108&crop=smart&auto=webp&s=8972bf1d61a292f8f60db59ade22f3df14223c39",
            "width": 108,
            "height": 108
          },
          {
            "url": "https://external-preview.redd.it/W0FhtvUg9_37NlcrQwndgNghcKjjMCjwuFr2GLdne6M.jpg?width=216&crop=smart&auto=webp&s=66789d92e9d91b8c8c8f4bab4488516d343bde90",
            "width": 216,
            "height": 216
          },
          {
            "url": "https://external-preview.redd.it/W0FhtvUg9_37NlcrQwndgNghcKjjMCjwuFr2GLdne6M.jpg?width=320&crop=smart&auto=webp&s=294cc2a86ba71017c06e2ce0c7223ac3dd28ac63",
            "width": 320,
            "height": 320
          }
        ],
        "variants": {},
        "id": "NdXhJacDf-KVYi3ZJtcfygTywBvhmgjFOASU-i0YBFI"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/wallstreetbets/comments/lef1aq/the_anatomy_of_a_coming_disaster/",
  "subreddit": "wallstreetbets",
  "id": "lef1aq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123215618
}