{
  "author": "bigtony96",
  "the_new_excerpt": "My parents are everything to me. They've worked their asses off to raise me and\nmy two little siblings, starting with nothing as immigrants. They're in the\nrestaurant business and the pandemic forced them to burn through a large chunk\nof their savings, and they stress out over finances every single…",
  "original_created_utc": 1610044777,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我的父母是我的一切。他们辛辛苦苦把我养大\n我的两个小兄弟姐妹，作为移民白手起家。他们在\n餐饮业和大流行迫使他们烧毁了一大块\n他们的积蓄，他们为每一个…的财务承受着巨大的压力",
      "title": "刚卖了来还清我父母的抵押贷款"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的父母是我的一切。他們辛辛苦苦把我養大\n我的兩個小兄弟姐妹，作爲移民白手起家。他們在\n餐飲業和大流行迫使他們燒燬了一大塊\n他們的積蓄，他們爲每一個…的財務承受着巨大的壓力",
      "title": "剛賣了來還清我父母的抵押貸款"
    }
  ],
  "title": "Just sold to pay off my parents' mortgage",
  "created_utc": 1610047825,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My parents are everything to me. They&#39;ve worked their asses off to raise me and my two little siblings, starting with nothing as immigrants. They&#39;re in the restaurant business and the pandemic forced them to burn through a large chunk of their savings, and they stress out over finances every single day. My dad always told me one day he&#39;ll retire once the house is paid off, and that day is finally here.</p>\n\n<p>I started buying BTC at the 2017 frenzy and all through out the past 3 years, and today I sold all of my 6 BTC and am closing their remaining loan balance with enough to spare for taxes + maybe a new car.</p>\n\n<p>Today is the day I&#39;ve dreamt of for the past several years, and it feels so surreal.</p>\n\n<p>Thank you bitcoin community for all the memes and bullshit TA threads. I&#39;ve reached my moon.</p>\n</div><!-- SC_ON -->",
  "score": 10225,
  "permalink": "/r/Bitcoin/comments/ksjjfi/just_sold_to_pay_off_my_parents_mortgage/",
  "subreddit": "Bitcoin",
  "id": "ksjjfi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706370121
}