{
  "author": "nuriel8833",
  "the_new_excerpt": "In the past week or two I noticed the market is behaving very strange. The\nmomentum was lost and Im starting to get a feeling the market is preparing the\nground for a sharp correction anytime soon.\n\n-Physical assets prices increase, somewhat rapidly relatively\n-10 Years US bond yield increasing…",
  "original_created_utc": 1613678846,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在过去的一两周里，我注意到市场的表现非常奇怪。在过去的一两周里，我注意到市场的表现非常奇怪。\n势头失去了，我开始感觉到市场正在准备。\n迅速大幅修正的理由。\n\n-实物资产价格上涨，相对来说速度较快。\n-10年美债收益率上升...",
      "title": "我觉得这个市场有点不对劲儿。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在過去的一兩週裏，我注意到市場的表現非常奇怪。在過去的一兩週裏，我注意到市場的表現非常奇怪。\n勢頭失去了，我開始感覺到市場正在準備。\n迅速大幅修正的理由。\n\n-實物資產價格上漲，相對來說速度較快。\n-10年美債收益率上升...",
      "title": "我覺得這個市場有點不對勁兒。"
    }
  ],
  "title": "Somethingh about the market doesn't feel right to me",
  "created_utc": 1613725051,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In the past week or two I noticed the market is behaving very strange. The momentum was lost and Im starting to get a feeling the market is preparing the ground for a sharp correction anytime soon.  </p>\n\n<p>-Physical assets prices increase, somewhat rapidly relatively<br/>\n-10 Years US bond yield increasing (Dont forget it was 0.6% at the peak of the collapse a year ago, around 1.3% today)<br/>\n-Defensive stocks gain very nicely for such a red day (KHC, GIS, CLX, QSR and a few others)  </p>\n\n<p>Just to make it clear I&#39;m still long, I think my positions are pretty defensive and are well positioned for a correction, but I do think I&#39;ll start hedging.<br/>\nNot recommending anything, just copy pasting a post I posted on a related forum.</p>\n</div><!-- SC_ON -->",
  "score": 42,
  "permalink": "/r/stocks/comments/lmvw8r/somethingh_about_the_market_doesnt_feel_right_to/",
  "subreddit": "stocks",
  "id": "lmvw8r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332883620
}