{
  "author": "Tricky-Detail-6876",
  "the_new_excerpt": "I would think that having the best person for the job in a thing like government\nwould be exponentially good. Why would we want anything different? For example\nwhen you call a plumber dont you want the best plumber? If not you run the risk\nof a poor job and more damage to an already broken system.…",
  "original_created_utc": 1620156006,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "政府のようなものでは、その仕事に最適な人がいるというのは\n飛躍的に良くなると思います。なぜ違うことを望むのか？例えば\n配管工を呼ぶとき、最高の配管工を呼びたいと思いませんか？そうでなければ、下手な仕事をして\nただでさえ壊れているシステムにさらにダメージを与えることになります....",
      "title": "実力主義という考え方が、なぜネガティブな意味合いを持つようになったのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我认为，在政府这样的机构中，拥有最合适的人选是一件好事。\n会有成倍的好处。为什么我们会希望有什么不同呢？比如说\n当你打电话给水管工时，你难道不想要最好的水管工吗？如果不是这样，你就有可能\n糟糕的工作和对已经损坏的系统的更多损害....。",
      "title": "为什么 \"任人唯贤 \"的概念会有负面的含义？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我認爲，在政府這樣的機構中，擁有最合適的人選是一件好事。\n會有成倍的好處。爲什麼我們會希望有什麼不同呢？比如說\n當你打電話給水管工時，你難道不想要最好的水管工嗎？如果不是這樣，你就有可能\n糟糕的工作和對已經損壞的系統的更多損害....。",
      "title": "爲什麼 \"任人唯賢 \"的概念會有負面的含義？"
    }
  ],
  "title": "Why has the idea of a meritocracy taken on a negative connotation?",
  "created_utc": 1620237903,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I would think that having the best person for the job in a thing like government would be exponentially good. Why would we want anything different? For example when you call a plumber dont you want the best plumber? If not you run the risk of a poor job and more damage to an already broken system. Curious to see what thoughts of this are on both sides of the political spectrum.for reference I would be considered socially liberal but more of a fiscal and policy conservative.\nEdit:I find it hilarious to watch my votes go up and down in real time. That must mean Its a good question but why the downvotes for a question that encourages political debate? Isn&#39;t that how it is supposed to be? Or is political discourse only good If you agree with it?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/Ask_Politics/comments/n4vny4/why_has_the_idea_of_a_meritocracy_taken_on_a/",
  "subreddit": "Ask_Politics",
  "id": "n4vny4",
  "is_self": true,
  "media": null,
  "is_video": false
}