{
  "author": "ChocolateTsar",
  "the_new_excerpt": "> The company will no longer sell either product and is offering owners full\n> refunds\n> \n> Peloton recalled its Peloton Tread+ and Peloton Tread treadmills today,\n> according to an announcement from the Consumer Product Safety Commission\n> [https://www.cpsc.gov/Newsroom/News-Releases/2021/CPSC-and…",
  "original_created_utc": 1620231575,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "> 同社は今後、両製品の販売を中止し、所有者に全額返金を行う。\n> 返金いたします。\n> \n> ペロトン社は本日、同社のトレッドミル「Peloton Tread+」および「Peloton Tread」をリコールしました。\n> 消費者製品安全委員会からの発表によると\n> [https://www.cpsc.gov/Newsroom/News-Releases/2021/CPSC-and...",
      "title": "Peloton (PTON)、トレッドミル「Tread」および「Tread+」に重大な安全上の問題があったとしてリコールを実施。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "> 该公司将不再销售这两种产品，并向业主提供全额\n> 退款\n> \n> Peloton今天召回其Peloton Tread+和Peloton Tread跑步机。\n> 根据消费者产品安全委员会的公告\n> [https://www.cpsc.gov/Newsroom/News-Releases/2021/CPSC-and...",
      "title": "Peloton（PTON）召回其Tread和Tread+跑步机，因为它们与严重的安全隐患有关"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "> 該公司將不再銷售這兩種產品，並向業主提供全額\n> 退款\n> \n> Peloton今天召回其Peloton Tread+和Peloton Tread跑步機。\n> 根據消費者產品安全委員會的公告\n> [https://www.cpsc.gov/Newsroom/News-Releases/2021/CPSC-and...",
      "title": "Peloton（PTON）召回其Tread和Tread+跑步機，因爲它們與嚴重的安全隱患有關"
    }
  ],
  "title": "Peloton (PTON) Recalls Its Tread and Tread+ Treadmills After They Were Linked to Serious Safety Hazards",
  "created_utc": 1620235601,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><blockquote>\n<p><strong>The company will no longer sell either product and is offering owners full refunds</strong>  </p>\n\n<p>Peloton recalled its Peloton Tread+ and Peloton Tread treadmills today, according to an <a href=\"https://www.cpsc.gov/Newsroom/News-Releases/2021/CPSC-and-Peloton-Announce-Recall-of-Tread-Plus-Treadmills-After-One-Child-Death-and-70-Incidents-Recall-of-Tread-Treadmills-Due-to-Risk-of-Injury\">announcement from the Consumer Product Safety Commission</a>, the government agency that oversees most household products, citing safety hazards.  </p>\n\n<p>The Peloton Tread+ has been linked to dozens of injuries to children, including one death. The recall notice states that “Peloton has received 72 reports of adult users, children, pets and/or objects being pulled under the rear of the treadmill, including 29 reports of injuries to children such as second- and third-degree abrasions, broken bones, and lacerations.”  </p>\n\n<p><strong>The company also notified the CPSC that its newer Peloton Tread’s touch screen can detach and fall, posing a risk of injury to consumers.</strong>  </p>\n\n<p><strong>Consumers should immediately stop using the treadmills and</strong> <a href=\"https://www.onepeloton.com/\"><strong>contact Peloton for a full refund</strong></a><strong>.</strong>  </p>\n\n<p><strong>The Peloton Tread+ (previously named the Peloton Tread) has been on the market since 2018. A smaller treadmill, also named the Peloton Tread, was slated to go on sale May 27, with 1,000 units already sold in the U.S. as part of a friends-and-family presale.</strong>   </p>\n\n<p>The recall comes after the <a href=\"https://www.consumerreports.org/product-safety/peloton-plus-tread-treadmill-urgent-safety-warning-cpsc/\">CPSC, in April, took the unusual step of warning consumers</a> with small children or pets at home to immediately stop using the Peloton Tread+. The company initially refused to recall its popular $4,300 exercise machine, according to a CPSC spokesperson, stating that the product was safe as long as users followed operating instructions.  </p>\n\n<p><strong>The warning was based on reports of 39 incidents in which a person, a pet, or an object, such as an exercise ball, was sucked under the machine, leading to injuries in both children and adults, many of them serious. “These are more severe injuries than you would imagine with a treadmill,” the CPSC spokesperson told Consumer Reports at the time, adding that the agency had not seen these types of injuries with other treadmills.</strong>  </p>\n\n<p>In light of the CPSC’s warning and the severity of the injuries, <a href=\"https://www.consumerreports.org/product-safety/safety-concerns-prompt-consumer-reports-to-remove-peloton-tread-plus-from-ratings/\">CR removed the Peloton Tread+ from its ratings</a> and stopped recommending the product while the investigation was ongoing.   </p>\n\n<p>The treadmill’s safety risks first became apparent in March after <a href=\"https://support.onepeloton.com/hc/en-us/articles/360058677091-A-Note-from-Peloton-CEO-John-Foley-about-Tread-\">Peloton CEO John Foley wrote to</a> users of the exercise machines regarding an incident with the Peloton Tread+ that led to the death of a child. Foley advised consumers to “keep children and pets away from Peloton exercise equipment at all times” and to “remove the safety key and store it out of reach of children” when the treadmill was not in use.  </p>\n\n<p>The widely publicized fatality prompted the CPSC to request information from Peloton, and the company disclosed to the agency that there were additional injuries and incidents tied to the Peloton Tread+.  </p>\n\n<p><strong>As the CPSC investigated the reports, including disturbing</strong> <a href=\"https://www.youtube.com/watch?v=onXNnlCYJ4Y\"><strong>home video footage of a child being sucked underneath the Peloton Tread+</strong></a> <strong>(and escaping without serious injury), the agency asked Peloton to recall its treadmills. But Peloton refused.</strong>  </p>\n\n<p>Shortly before the CPSC’s public warning, Rep. Jan Schakowsky, D-Ill., asked for details about the CPSC’s investigation and Sen. Richard Blumenthal, D-Conn., urged Peloton to issue a recall.  </p>\n\n<p>The standoff with Peloton illustrates that the CPSC cannot force companies to issue a recall without taking them to court, even when the agency’s safety experts have tied a hazardous product to deaths or serious injuries.  </p>\n\n<p>“The CPSC took a strong and principled stance for safety, and clearly that’s what made Peloton come to the table and agree to offer a full refund,” says William Wallace, CR’s manager of safety policy. “It shouldn’t have required so much time and effort to get this product recalled. This episode underscores why we need to overhaul our outdated laws, so the CPSC has the ability to take quicker, forceful action when a product is putting people at risk.”  </p>\n\n<p>Acting CPSC chairman Bob Adler said in a statement today that he is pleased that the agency and Peloton have ultimately agreed on recall terms. He added that the recall “is the result of weeks of intense negotiation and effort, culminating in a cooperative agreement that I believe serves the best interests of Peloton and of consumers.”  </p>\n\n<p><strong>Peloton CEO Foley apologized for the company’s initial response to the safety issues, and stated that “the decision to recall both products was the right thing to do for Peloton’s Members and their families. I want to be clear, Peloton made a mistake in our initial response to the Consumer Product Safety Commission’s request that we recall the Tread+. We should have engaged more productively with them from the outset. For that, I apologize.”</strong></p>\n</blockquote>\n\n<p><a href=\"https://www.consumerreports.org/home-product-recalls/peloton-tread-tread-plus-treadmills-recalled-serious-safety-hazards/\">Source</a></p>\n\n<p><a href=\"https://finance.yahoo.com/quote/PTON?p=PTON&amp;.tsrc=fin-srch\">PTON stock price</a></p>\n</div><!-- SC_ON -->",
  "score": 1472,
  "permalink": "/r/investing/comments/n5jtkv/peloton_pton_recalls_its_tread_and_tread/",
  "subreddit": "investing",
  "id": "n5jtkv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380966991
}