{
  "author": "Nuewim",
  "original_created_utc": 1640288001,
  "title": "Just because BTC barely hit $50k, it doesn't mean it can hit $100k EOY, please don't be delusional.",
  "created_utc": 1640310458,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Few days ago everyone was sad, on main page there were post destroying  $100k EOY dreams. Now mood changed 180 degrees and people again talk about it. They never learn on their mistakes. It was known 2/3 months ago that $100k is almost impossible. Last weeks proved it by massive drop in price.&lt;/p&gt;\n\n&lt;p&gt;It is impossible to biggest crypto to double it&amp;#39;s price and market cap just in 7 days. If you think it is possible you are not different than all those memecoins investors that are over optimistic. BTC should be about rationality and good example for beginners.&lt;/p&gt;\n\n&lt;p&gt;Will BTC reach $100k? Easily but in few months,  not in a week. Don&amp;#39;t let dreams  control you. Not much will happen to BTC in next  week, better enjoy time with your family.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 189,
  "permalink": "/r/CryptoCurrency/comments/rn3e3g/just_because_btc_barely_hit_50k_it_doesnt_mean_it/",
  "subreddit": "CryptoCurrency",
  "id": "rn3e3g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Few days ago everyone was sad, on main page there were post destroying $100k EOY\ndreams. Now mood changed 180 degrees and people again talk about it. They never\nlearn on their mistakes. It was known 2/3 months ago that $100k is almost\nimpossible. Last weeks proved it by massive drop in price.\n\nIt…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "数日前、メインページで10万ドルのEOYを破壊する投稿があり、みんな悲しんでいました。\nを夢見る。今、雰囲気は180度変わり、人々は再びこの話題で盛り上がっています。彼らは決して\n失敗から学ぶことができる。10万ドルなんて、2～3ヶ月前にはほとんど分かっていたことです。\n不可能です。先週の大幅な値下がりで、それが証明されました。\n\nそれは...",
      "title": "BTCがかろうじて50kドルを達成したからといって、EOYで100kドルを達成できるわけではありません、妄想はやめて下さいね。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "几天前，每个人都很伤心，在主页上有一些破坏10万美元EOY的帖子。\n梦想。现在情绪发生了180度的变化，人们又开始谈论这个话题。他们从未\n从他们的错误中学习。2/3个月前就知道，10万美元几乎是\n不可能。上个星期的价格大跌证明了这一点。\n\n它...",
      "title": "仅仅因为BTC勉强达到5万美元，并不意味着它能在EOY达到10万美元，请不要妄想。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "幾天前，每個人都很傷心，在主頁上有一些破壞10萬美元EOY的帖子。\n夢想。現在情緒發生了180度的變化，人們又開始談論這個話題。他們從未\n從他們的錯誤中學習。2/3個月前就知道，10萬美元幾乎是\n不可能。上個星期的價格大跌證明了這一點。\n\n它...",
      "title": "僅僅因爲BTC勉強達到5萬美元，並不意味着它能在EOY達到10萬美元，請不要妄想。"
    }
  ]
}