{
  "author": "ThrowQuestionaire",
  "the_new_excerpt": "I've been reading a decent chunk of Chinese webnovels in my free time. They're\nlargely, well, terribly written power fantasies. But I've noticed a trend where\nwhen the military shows up, they often seem to be depicted as a sort of entirely\ndifferent power that's barely related to the Communist…",
  "original_created_utc": 1612052224,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我在空闲时间看了不少中国的网络小说。它们是\n很大程度上，嗯，写得很糟糕的权力幻想。但我注意到一个趋势\n当军队出现时，他们似乎经常被描绘成一种完全不同的人。\n与共产党几乎没有关系的不同权力... ...",
      "title": "为什么解放军像是国中之国？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在空閒時間看了不少中國的網絡小說。它們是\n很大程度上，嗯，寫得很糟糕的權力幻想。但我注意到一個趨勢\n當軍隊出現時，他們似乎經常被描繪成一種完全不同的人。\n與共產黨幾乎沒有關係的不同權力... ...",
      "title": "爲什麼解放軍像是國中之國？"
    }
  ],
  "title": "Why does the PLA seem like a state within a state?",
  "created_utc": 1612092503,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been reading a decent chunk of Chinese webnovels in my free time. They&#39;re largely, well, terribly written power fantasies. But I&#39;ve noticed a trend where when the military shows up, they often seem to be depicted as a sort of entirely different power that&#39;s barely related to the Communist Party. Obviously, these sort of books are going to simplify and be skewed in favor of telling a story, and will not be accurate. But with enough books painting a picture of a military with its own companies, compounds (that read different from a military base) filled with mansions for old generals and guarded by privates, and a disconnect from the general workings of normal civilian life, it makes me wonder how true it might be, and how that came about.</p>\n\n<p>&#x200B;</p>\n\n<p>To give an example, in these sort of stories, say the protagonist makes a friend with the child of a military leader or grandchild of an old veteran who fought in the Civil War. When they get into a conflict with a rich fuerdai (which seem to be a catchall for all rich sons and daughters of Chinese business elite) or a princeling (same as above, but with politicians) and are in trouble with either the police or some such, they can go to the compound and enjoy a nice dinner with their friend&#39;s family, and the police can&#39;t interfere and members of the civil service can only shrug their shoulders. The sons of PLA officers are expected to go into the military themselves where they become the next generation leaders of the PLA and establish their own separate power base.</p>\n\n<p>&#x200B;</p>\n\n<p>That sort of thinking seems pretty alien to me as an American, whose cultural experience with military kids is that of military brats who keep moving around the country, and whose parents identities as soldiers would be irrelevant in most cases.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/l8zqtz/why_does_the_pla_seem_like_a_state_within_a_state/",
  "subreddit": "AskHistorians",
  "id": "l8zqtz",
  "is_self": true,
  "media": null,
  "is_video": false
}