{
  "author": "Emergency_Lab8262",
  "original_created_utc": 1656307668,
  "title": "Are (some) male friends just waiting for u to end your current relationship?",
  "created_utc": 1656323136,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Male/female friendships are great and I as a young female enjoy having the opposite sex as friends. But I recently read that most &amp;#39;male friends&amp;#39; are sometimes into you and are only being your &amp;#39;friend&amp;#39; so they can date you once you&amp;#39;re single? That is pretty f&amp;#39;d up in my opinion. Is this a real thing? Or I should say, is this a common thing? And why? Why not just find someone single?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 127,
  "permalink": "/r/TooAfraidToAsk/comments/vlnyxm/are_some_male_friends_just_waiting_for_u_to_end/",
  "subreddit": "TooAfraidToAsk",
  "id": "vlnyxm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Male/female friendships are great and I as a young female enjoy having the\nopposite sex as friends. But I recently read that most 'male friends' are\nsometimes into you and are only being your 'friend' so they can date you once\nyou're single? That is pretty f'd up in my opinion. Is this a real…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "男女の友情は素晴らしいものであり、若い女性として、その友情を楽しむことができます。\n異性の友人となることを楽しんでいます。しかし、最近読んだ本によると、ほとんどの「男友達」は、あなたに気があって、一度デートするために「友達」になっているだけだそうです。\nっていることがあるそうです。\nという記事を読みました。それはかなりひどいと思います。これは現実なのでしょうか...",
      "title": "一部の）男友達は、あなたが今の関係を終わらせるのを待っているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "男性/女性的友谊是伟大的，我作为一个年轻的女性喜欢有异性朋友。\n作为一个年轻的女性，我喜欢和异性做朋友。但我最近读到，大多数 \"男性朋友 \"有时是喜欢你的，只是作为你的 \"朋友\"。\n有时会喜欢上你，而且只是作为你的 \"朋友\"，以便一旦你单身，他们可以和你约会。\n你是单身？在我看来，这是很糟糕的事情。这是否是一个真正的...",
      "title": "一些男性朋友是否只是在等待你结束目前的关系？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "男性/女性的友誼是偉大的，我作爲一個年輕的女性喜歡有異性朋友。\n作爲一個年輕的女性，我喜歡和異性做朋友。但我最近讀到，大多數 \"男性朋友 \"有時是喜歡你的，只是作爲你的 \"朋友\"。\n有時會喜歡上你，而且只是作爲你的 \"朋友\"，以便一旦你單身，他們可以和你約會。\n你是單身？在我看來，這是很糟糕的事情。這是否是一個真正的...",
      "title": "一些男性朋友是否只是在等待你結束目前的關係？"
    }
  ]
}