{
  "author": "unc4l1n",
  "the_new_excerpt": "Today is a sad day. I've sold half of my NANO.\n\nNano is a project I believed in - it promised so much. But the lack of\nreal-world adoption always nagged at me, I couldn't work it out.\n\nI think I've realised the reason. NANO is deflationary, so it's never going to\nbe used as a medium of exchange,…",
  "original_created_utc": 1615281926,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "今天是个悲伤的日子。我已经卖掉了一半的NANO。\n\nNano是一个我相信的项目--它承诺了很多。但由于缺乏\n现实世界中的收养问题一直困扰着我，我无法解决。\n\n我想我已经知道原因了。NANO是通缩的，所以它永远不会\n作为交换的媒介，...",
      "title": "今天是一个悲伤的日子。我卖了一半的NANO堆栈。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天是個悲傷的日子。我已經賣掉了一半的NANO。\n\nNano是一個我相信的項目--它承諾了很多。但由於缺乏\n現實世界中的收養問題一直困擾着我，我無法解決。\n\n我想我已經知道原因了。NANO是通縮的，所以它永遠不會\n作爲交換的媒介，...",
      "title": "今天是一個悲傷的日子。我賣了一半的NANO堆棧。"
    }
  ],
  "title": "Today is a sad day. I've sold half of my NANO stack.",
  "created_utc": 1615351017,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Today is a sad day. I&#39;ve sold half of my NANO.</p>\n\n<p>Nano is a project I believed in - it promised so much. But the lack of real-world adoption always nagged at me, I couldn&#39;t work it out.</p>\n\n<p>I think I&#39;ve realised the reason. NANO is deflationary, so it&#39;s never going to be used as a medium of exchange, which is its primary purpose. Instead, it&#39;s going to be used as a store of value, completely undermining its primary benefits.</p>\n\n<p>It doesn&#39;t matter if it&#39;s fast, feeless, and green, if no-one is actually going to be transmitting it. If they&#39;re hoarding it, it may as well be Bitcoin. And this is where the problem lies: it&#39;s simply a direct competitor to Bitcoin. The benefits of NANO won&#39;t be enough to displace Bitcoin, so in my mind NANO serves no purpose.</p>\n\n<p>It&#39;s a massive shame. They should have made it inflationary. Only then could it have ruled the world.</p>\n\n<p>Edit: Wow, there&#39;s a LOT of emotion surrounding this coin. I applaud those who have taken the opportunity to have a discussion. Those who have taken the opportunity to scold and mock, not so much applause.</p>\n</div><!-- SC_ON -->",
  "score": 137,
  "permalink": "/r/CryptoCurrency/comments/m12y81/today_is_a_sad_day_ive_sold_half_of_my_nano_stack/",
  "subreddit": "CryptoCurrency",
  "id": "m12y81",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542573508
}