{
  "author": "KingKaos420-",
  "original_created_utc": 1646842940,
  "title": "Was Al Bundy being able to afford an entire house and family of 4 (and a pet) on the single income a shoe salesman in 1987- 1997 ever a realistic setting?",
  "created_utc": 1646863794,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This question is mainly for people who were alive during this era and who were old enough to understand finances and the housing market. And this is in reference to the TV show “Married…with Children”&lt;/p&gt;\n\n&lt;p&gt;Was this ever a thing? Obviously the idea of a single income supporting a family of 4 and a house today would be seen as absurd, unless the job payed exceptionally well. But was this even a thing in the 90’s?&lt;/p&gt;\n\n&lt;p&gt;I know that with Friends, the idea that they were able to afford such a large apartment in NYC working as a waitress, professor, etc. was always seen as unrealistic, even in the 90’s, but this was explained away by saying the apartment was rent controlled and from an older relative.&lt;/p&gt;\n\n&lt;p&gt;Were there similar feelings towards Al Bundy and his family home during the 90’s? Was the idea that a shoe salesman could afford a house that nice on his income alone seen as unrealistic at the time? Or was it actually seen as a normal situation? Was that a thing that actually could have happened at the time? &lt;/p&gt;\n\n&lt;p&gt;Keep in mind this show was set in a Chicago suburb, and not NYC. Their house was 2 stories, in a nice neighborhood, and had a yard. His wife didn’t work and he had 2 kids and a dog to support. His shoe salesman job was at a store inside a shopping mall. &lt;/p&gt;\n\n&lt;p&gt;Was this ever seen as realistic? Or did people react the same way they did to the Friends apartment?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/tabf24/was_al_bundy_being_able_to_afford_an_entire_house/",
  "subreddit": "NoStupidQuestions",
  "id": "tabf24",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "This question is mainly for people who were alive during this era and who were\nold enough to understand finances and the housing market. And this is in\nreference to the TV show “Married…with Children”\n\nWas this ever a thing? Obviously the idea of a single income supporting a family\nof 4 and a house…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この質問は、主にこの時代に生きていた人、そして、この時代にいた人に向けてのものです。\n金融や住宅市場を理解できる年齢に達している。そして、これは\nテレビ番組「Married...with Children」についての言及です。\n\nこんなのあったんですか？明らかに、一人の収入で家族を養うという考え方は\n4人で、一軒家を建てて...。",
      "title": "1987年から1997年にかけて、アル・バンディが靴のセールスマンの収入だけで家一軒と家族4人（とペット）を持てるというのは、現実的な設定だったのだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这个问题主要是针对那些在这个时代活着的人，以及那些在这个时代足够老的人。\n他们的年龄足以理解金融和住房市场。而这是在\n指的是电视节目 \"与孩子结婚\"。\n\n这曾经是一个东西吗？很明显，一个人的收入支持一个家庭的想法\n四个人和一栋房子...",
      "title": "阿尔-邦迪在1987-1997年靠卖鞋的单一收入就能买得起整个房子和四口之家（还有一只宠物），这是否是一个现实的设定？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個問題主要是針對那些在這個時代活着的人，以及那些在這個時代足夠老的人。\n他們的年齡足以理解金融和住房市場。而這是在\n指的是電視節目 \"與孩子結婚\"。\n\n這曾經是一個東西嗎？很明顯，一個人的收入支持一個家庭的想法\n四個人和一棟房子...",
      "title": "阿爾-邦迪在1987-1997年靠賣鞋的單一收入就能買得起整個房子和四口之家（還有一隻寵物），這是否是一個現實的設定？"
    }
  ]
}