{
  "author": "KingKaos420-",
  "original_created_utc": 1646842940,
  "title": "Was Al Bundy being able to afford an entire house and family of 4 (and a pet) on the single income a shoe salesman in 1987- 1997 ever a realistic setting?",
  "created_utc": 1646863794,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This question is mainly for people who were alive during this era and who were old enough to understand finances and the housing market. And this is in reference to the TV show “Married…with Children”&lt;/p&gt;\n\n&lt;p&gt;Was this ever a thing? Obviously the idea of a single income supporting a family of 4 and a house today would be seen as absurd, unless the job payed exceptionally well. But was this even a thing in the 90’s?&lt;/p&gt;\n\n&lt;p&gt;I know that with Friends, the idea that they were able to afford such a large apartment in NYC working as a waitress, professor, etc. was always seen as unrealistic, even in the 90’s, but this was explained away by saying the apartment was rent controlled and from an older relative.&lt;/p&gt;\n\n&lt;p&gt;Were there similar feelings towards Al Bundy and his family home during the 90’s? Was the idea that a shoe salesman could afford a house that nice on his income alone seen as unrealistic at the time? Or was it actually seen as a normal situation? Was that a thing that actually could have happened at the time? &lt;/p&gt;\n\n&lt;p&gt;Keep in mind this show was set in a Chicago suburb, and not NYC. Their house was 2 stories, in a nice neighborhood, and had a yard. His wife didn’t work and he had 2 kids and a dog to support. His shoe salesman job was at a store inside a shopping mall. &lt;/p&gt;\n\n&lt;p&gt;Was this ever seen as realistic? Or did people react the same way they did to the Friends apartment?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/tabf24/was_al_bundy_being_able_to_afford_an_entire_house/",
  "subreddit": "NoStupidQuestions",
  "id": "tabf24",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "This question is mainly for people who were alive during this era and who were\nold enough to understand finances and the housing market. And this is in\nreference to the TV show “Married…with Children”\n\nWas this ever a thing? Obviously the idea of a single income supporting a family\nof 4 and a house…"
}