{
  "author": "anth1986",
  "the_new_excerpt": "I’m going to start with a very brief overview of Bonds and how they in turn\naffect stocks. Then I will pose some questions for discussion as I do not fully\nunderstand how this will affect the market.\n\nWhen you buy Bonds you are buying US Government debt. The Yield is how much\ninterest the Bond pays.…",
  "original_created_utc": 1616256048,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我先简单介绍一下债券的情况，以及它们又是如何\n影响股票。那么我将提出一些问题供大家讨论，因为我没有完全的\n了解这将如何影响市场。\n\n当你购买债券时，你购买的是美国政府的债务。收益率是多少\n债券支付的利息....",
      "title": "国债，我们为什么要关心？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我先簡單介紹一下債券的情況，以及它們又是如何\n影響股票。那麼我將提出一些問題供大家討論，因爲我沒有完全的\n瞭解這將如何影響市場。\n\n當你購買債券時，你購買的是美國政府的債務。收益率是多少\n債券支付的利息....",
      "title": "國債，我們爲什麼要關心？"
    }
  ],
  "title": "Treasury Bonds, why should we care?",
  "created_utc": 1616280059,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m going to start with a very brief overview of Bonds and how they in turn affect stocks. Then I will pose some questions for discussion as I do not fully understand how this will affect the market. </p>\n\n<p>When you buy Bonds you are buying US Government debt. The Yield is how much interest the Bond pays. Yield is determined by supply and demand of the Bonds. When the Pandemic hit people apparently flocked to Bonds because they are a safe investment and this buying drove down the Bond Yield. The Bond Yield causes other interest rates (mortgages, loans, credit cards) to follow its rise or fall. Since the Yield went down so did interest rates, this caused a boom in the stock market (along with stimulus) because business could borrow money for less. </p>\n\n<p>Currently, Bonds have been selling off which increases the Yield. This increases interest rates making businesses dependent on cheap lending, like Tech, to fall in price. Bonds are selling off because people are expecting inflation to increase with a hotter economy and it doesn’t make sense to have money tied to low yield bonds when inflation is greater than the Bond Yield. </p>\n\n<p>So now the stock market is going through a period of volatility because of the Bond sell off and uncertainty about inflation. To ease this uncertainty investors have wanted the Fed to announce Yield Curve Control (YCC). Basically, the Fed buys Bonds to keep the Yield at a desired rate. So far it looks like the Fed isn’t worried about the rates right now and want to see more sustainable economic growth before doing anything with rates. </p>\n\n<p>Questions for discussion:\nWhy would the markets react poorly to rising Yield? I get that it’s more expensive to finance debt but won’t the Bond sellers most likely move money into the stock market?</p>\n\n<p>The Fed wants inflation, and inflation fears have driven a Bond sell off. If the Fed gets their inflation target and it doesn’t go out of control than shouldn’t markets calm down? I see no reason the Fed would loose control, they have so many more tools than they ever have before. </p>\n\n<p>If the market is doomed to be stifled because of all this where is a good place to move money? Obviously all stocks won’t suck and many have already started the rotation into value and emerging markets.</p>\n</div><!-- SC_ON -->",
  "score": 70,
  "permalink": "/r/stocks/comments/m99wgz/treasury_bonds_why_should_we_care/",
  "subreddit": "stocks",
  "id": "m99wgz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752821009
}