{
  "author": "sidewalks-",
  "the_new_excerpt": "Canadian cannabis producers Aphria Inc. and Tilray Inc. are in advanced talks to\ncombine, with an announcement possible as early as this week, according to\nsources familiar with the matter.\n\nThe merged company is expected to retain the Tilray name and appoint Aphria\nChief Executive Officer Irwin…",
  "original_created_utc": 1608070303,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "加拿大大麻生产商Aphria Inc.和Tilray Inc.正在进行深入的谈判，以\n合并，最早可能在本周宣布，根据\n知情人士说。\n\n合并后的公司预计将保留Tilray的名字，并任命Aphria\n首席执行官Irwin…",
      "title": "APHA在与Tilray重磅合并的消息传出后飙升20%AH"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "加拿大大麻生產商Aphria Inc.和Tilray Inc.正在進行深入的談判，以\n合併，最早可能在本週宣佈，根據\n知情人士說。\n\n合併後的公司預計將保留Tilray的名字，並任命Aphria\n首席執行官Irwin…",
      "title": "APHA在與Tilray重磅合併的消息傳出後飆升20%AH"
    }
  ],
  "title": "APHA skyrockets 20% AH after news of blockbuster merger with Tilray",
  "created_utc": 1608091054,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Canadian cannabis producers Aphria Inc. and Tilray Inc. are in advanced talks to combine, with an announcement possible as early as this week, according to sources familiar with the matter. </p>\n\n<p>The merged company is expected to retain the Tilray name and appoint Aphria Chief Executive Officer Irwin Simon as its CEO, the sources said. Aphria is likely to emerge with a majority of the combined company’s board seats and with its shareholders owning a 60 per cent stake, although that could change, added one of the sources who has direct knowledge of the matter​.</p>\n\n<p>Negotiations between the two companies were ongoing as of Tuesday and there&#39;s no guarantee that a deal will be completed. </p>\n\n<p>The merged Aphria-Tilray company will likely move its headquarters to the United States as part of a strategy to bolster its presence in that country, the sources said. Sales of cannabis in the U.S. have increased substantially over the past year amid rising marijuana usage during the COVID-19 pandemic. Aphria is currently headquartered in Leamington, Ont.; Tilray is based in Nanaimo, B.C. </p>\n\n<p>The two companies are eyeing up to $100 million in annualized cost savings by joining forces, while Aphria would produce the bulk of the combined entity&#39;s Canadian cannabis inventory to fully utilize its 1.3 million square-foot greenhouse in Leamington, Ont., the sources said. It is unclear what will happen to Tilray&#39;s production facilities in Nanaimo, B.C. and London, Ont., but one of the sources who has indirect knowledge said they are likely to be wound down. </p>\n\n<p><strong>If Tilray and Aphria manage to finalize an agreement, the deal would create the biggest cannabis company in Canada and a major player in the global pot sector. Tilray&#39;s international operations, which include a world-class production facility in Portugal, is said to be one of the jewels of the deal, the sources said. Tilray also has substantial operations in Australia, Germany and the U.K.; meanwhile, Aphria has a German pharmaceutical distribution business.</strong></p>\n\n<p>The combined company would control a leading 19 per cent share of the Canadian recreational cannabis market and annual revenue north of $930 million, based on the two companies&#39; most recent quarterly results as well as revenue generated by Sweetwater Brewing Co., which Aphria acquired last month.</p>\n\n<p>This is the second time in recent months that Aphria is said to have had its eye on being a consolidator in Canada’s crowded cannabis sector. BNN Bloomberg reported in July that the Leamington, Ont.-based pot giant was in serious negotiations with Aurora Cannabis Inc., but talks between the two companies broke down due to differences over board composition and compensation.</p>\n\n<p>One of the key differences between Aurora and Tilray is that the latter generates roughly half of its revenue from its Manitoba Health hemp food business. That would likely appeal to Aphria given Simon&#39;s previous role running organic health food operator Hain Celestial Group Inc., and could add steady revenue to its non-cannabis subsidiaries, such as German pharmaceutical distribution business CC Pharma and Sweetwater Brewing.</p>\n</div><!-- SC_ON -->",
  "score": 100,
  "permalink": "/r/stocks/comments/kdvshi/apha_skyrockets_20_ah_after_news_of_blockbuster/",
  "subreddit": "stocks",
  "id": "kdvshi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609260495586
}