{
  "author": "bygoneghost",
  "original_created_utc": 1655279689,
  "title": "How did people percieve their identity before nationalism?",
  "created_utc": 1655326974,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve noticed that it is inevitable to strike a controversy whenever a historical figure&amp;#39;s nationality is brought up for debate (like whether William Shakespeare&amp;#39;s is French for instance)&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not looking for answers like &amp;quot;NO HE WAS ENGLISH&amp;quot;, rather, I would like to understand how one would&amp;#39;ve thought about his identity in the time before the French revolution and the nationalist movement.&lt;/p&gt;\n\n&lt;p&gt;If there&amp;#39;s some way to describe and understand this, would this also apply to some other historical figures like &amp;quot;Ibn Khaldun&amp;quot;? who were born in islamic cities, traveled, lived, and died in others? How did they think about those different cities? Did they feel similar to how an American might feel due to moving from California to New York for example? or is it more severe?&lt;/p&gt;\n\n&lt;p&gt;Maybe I don&amp;#39;t have enough information or historical context to ask the right questions, but I would like to know how identity was like without taking into consideration the new idea of nationalism, because I think it doesn&amp;#39;t apply to those historical periods.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/vcpa6z/how_did_people_percieve_their_identity_before/",
  "subreddit": "AskHistorians",
  "id": "vcpa6z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've noticed that it is inevitable to strike a controversy whenever a historical\nfigure's nationality is brought up for debate (like whether William\nShakespeare's is French for instance)\n\nI'm not looking for answers like \"NO HE WAS ENGLISH\", rather, I would like to\nunderstand how one would've…"
}