{
  "author": "Sunnydaysahead17",
  "original_created_utc": 1646834790,
  "title": "Why doesn’t Biden ask all employees who are able to work from home to reduce gas demand?",
  "created_utc": 1646847075,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Isn’t what caused the major drop in gas prices the lack of demand during the pandemic? If Biden asked, voluntarily of course, for as many businesses as are able to have their employees work from  home, wouldn’t that lower gas prices? Many companies already have experience with their employees working from home and have already worked out the kinks so the transition wouldn’t be too much of a hardship.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 138,
  "permalink": "/r/NoStupidQuestions/comments/ta8ivm/why_doesnt_biden_ask_all_employees_who_are_able/",
  "subreddit": "NoStupidQuestions",
  "id": "ta8ivm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Isn’t what caused the major drop in gas prices the lack of demand during the\npandemic? If Biden asked, voluntarily of course, for as many businesses as are\nable to have their employees work from home, wouldn’t that lower gas prices?\nMany companies already have experience with their employees…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ガソリン価格の大幅な下落は、この間の需要不足が原因ではないでしょうか？\nパンデミック？もしバイデンが、もちろん自発的に、できるだけ多くの企業にお願いすれば\n従業員に在宅勤務をさせることができれば、ガソリン代は安くなるのでは？\nすでに多くの企業が従業員との経験を積んでいる...",
      "title": "バイデンはなぜ、在宅勤務が可能な全社員にガス需要の削減を求めないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "导致汽油价格大幅下降的原因不正是在大流行期间的需求不足吗？\n大流行期间的需求不足吗？如果拜登要求，当然是自愿的，让尽可能多的企业\n能让他们的员工在家工作，这不就能降低油价吗？\n许多公司已经有经验，他们的员工...",
      "title": "拜登为什么不要求所有能够在家工作的员工减少天然气需求？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "導致汽油價格大幅下降的原因不正是在大流行期間的需求不足嗎？\n大流行期間的需求不足嗎？如果拜登要求，當然是自願的，讓儘可能多的企業\n能讓他們的員工在家工作，這不就能降低油價嗎？\n許多公司已經有經驗，他們的員工...",
      "title": "拜登爲什麼不要求所有能夠在家工作的員工減少天然氣需求？"
    }
  ]
}