{
  "author": "John_the_Fearless",
  "the_new_excerpt": "A tous ceux qui ces présentes verront, salut ! Nous, Jean de Bourgogne, dit Sans\nPeur (à juste raison !), nous proposons par cette lettre à nos féaux et dévoués\nserviteurs, de faire commentaire et glose desdites diaboliques images du Roi,\nqui se trouvoit sur l'honnie Netflix. Ayant grand soucy…",
  "original_created_utc": 1617268071,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "向所有看到这些礼物的人问好！我们，勃艮第的约翰，被称为无畏的人。\n无畏的（有充分的理由！），我们通过这封信向我们的忠诚和忠实的人提议\n仆人，来评论和美化国王的上述恶魔形象。\n这是在耻辱的网剧。非常关注...",
      "title": "[评论]让我们看这部电影 \"Le Roi\""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "向所有看到這些禮物的人問好！我們，勃艮第的約翰，被稱爲無畏的人。\n無畏的（有充分的理由！），我們通過這封信向我們的忠誠和忠實的人提議\n僕人，來評論和美化國王的上述惡魔形象。\n這是在恥辱的網劇。非常關注...",
      "title": "[評論]讓我們看這部電影 \"Le Roi\""
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "このプレゼントをご覧の皆様、ご挨拶申し上げます。 我らがジョン・オブ・ブルゴーニュ、恐れを知らぬ者と呼ばれる者。\n恐れを知らない（それには理由があります！）私たちは、この手紙によって、忠実で献身的な私たちに提案します。\n王の極悪非道なイメージにコメントをつけたり、光沢をつけたりするために、下僕たちは\nというのが、不名誉なNetflixに載っていました。とても心配しています...。",
      "title": "レビュー】この映画「Le Roi」を見てみよう。"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "このプレゼントをご覧の皆様、ご挨拶申し上げます。 我らがジョン・オブ・ブルゴーニュ、恐れを知らぬ者と呼ばれる者。\n恐れを知らない（それには理由があります！）私たちは、この手紙によって、忠実で献身的な私たちに提案します。\n王の極悪非道なイメージにコメントをつけたり、光沢をつけたりするために、下僕たちは\nというのが、不名誉なNetflixに載っていました。とても心配しています...。",
      "title": "レビュー】この映画「Le Roi」を見てみよう。"
    }
  ],
  "title": "[Review] Lets watch this movie \"Le Roi\"",
  "created_utc": 1617293397,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A tous ceux qui ces présentes verront, salut ! Nous, Jean de Bourgogne, dit Sans Peur (à juste raison !), nous proposons par cette lettre à nos féaux et dévoués serviteurs, de faire commentaire et glose desdites diaboliques images du Roi, qui se trouvoit sur l&#39;honnie Netflix. Ayant grand soucy d&#39;entente mutuelle avec nos amis Anglois, nous écriront en leur langue, par bonne charité chrestienne et amabilité de coeur. Nostre fils, bien amé Philippe, nous assistera en cette tasche pour ce qu&#39;il parloit bien icelle langue.</p>\n\n<p>Hello everyone, this is John the Fearless, duke of Burgundy. On this fine day I&#39;ll be reviewing the movie The King. Considering the need to appeal to our English neighbours, I&#39;ve been convinced by my son Pilippe that I should write such review in your language. He does have a good understanding of it, although I don&#39;t know why he&#39;s got such an interest for you Brits but hey, I&#39;ll indulge him.</p>\n\n<p>Since I&#39;m supposed to meet with the Dauphin Charles soon in Montereau to discuss a peace and reconciliation, I figured I should have a look at the movie where he appears. I did notice <strong><em>some</em></strong> innacuracies in the depiction of the whole events and I&#39;ll try to correct that. On a totally unrelated note, does anyone knows to whom this Netflix family pledges its allegiance ? I have tens of idle cannons and a good thousand knights that need some good trampling job. Just asking.</p>\n\n<p>Well first of all I must admit I had a good laugh watching that. It was quite the experience. Now, let me get this clear. The Dauphin isn&#39;t a close political ally. He&#39;s not someone I&#39;m very fond of either, for political reason. But he&#39;s still my cousin and, I fear, he&#39;ll be my king someday. I do have to defend his honour. That&#39;s why I&#39;m hereby challenging Sir David Michôt to a duel. If someone can tell me where he lives, I&#39;ll send him my gauntlet and we shall arrange a meeting to settle this matter. Charles behaves nothing like the way he&#39;s portrayed in these diabolical pictures. He&#39;s a reserved, almost shy person, hesitant and not overly courageous when it comes to battle. I&#39;ve never heard of him approaching any kind of battlefield whatsoever. Futhermore, how do you expect the heir to the throne of France to travel nearly alone toward the ennemy ? Where is the rest of the embassy ? Where is the escort ? where are his knights and the men of his Hostel ? Where is this damn Tanguy du Chastel ? I hate this man, thinking of him alone gives me a headache<sup>1</sup>. The idea of the only son of the king strolling alone in the countryside near the English army of invasion is utterly ridiculous. I&#39;ll be sure to convey my opinion on the matter to Netflix. (Again, someone knows where I could send those cannons ?)</p>\n\n<p>I noticed, too, that Netflix must be English. How else could we explain the blatant bias they demonstrate toward that gigantic pile of filth the usurper and so-called Henry V is ? I don&#39;t recall  watching anything about the dozens diplomatic gestures he made toward me. No mentions of his envoys, his letters. Nowhere is it shown that he tried to take advantage of the unfortunate civil war that rages here in France. Since I sent them off properly, it might not have been glorious enough to mention. And that would have hurted the &quot;I did nothing but got provoked&quot; narrative, too. Is there any mention that he was so utterly out of touch with military matters that he tried and used siege towers at the siege of Harfleur ? SIEGE TOWERS, could you imagine that ? I laughed for three whole days when I learned it. No one is doing that anymore. Like, this is so XIVth century dude. And he had the great idea to encamp his army in the swamps, too ! Great success ! Half of his men dead or back to England thanks to dysentery in the firt month of the campaign is quite an achievment<sup>2</sup>.</p>\n\n<p>Now, let&#39;s be honest. That Henry was, and I weight every word, &quot;fils a putain, usurpateur, faulx chevalier, mauvais chrétien et très diabolique engance&quot;<sup>3</sup>. You guessed it, we have to talk about Azincourt (not Agincourt, you damn Brits !). I don&#39;t know where this David Michôt is, but one thing is certain : he&#39;s not a knight. Far from it. He has no clue what a battle could look like, how a knight could fight and what a melee is. Never have I seen anyone so out of touch with reality, and I have had a theologian explain that me assasinating my nephew in cold blood was a christian act worthy of great praise. Let that sink in. Plenty has already been said about the battle itself and how it turned out, but something is strangely absent of Sir Michôt adaptation. I&#39;m talking about the massacre. </p>\n\n<p>Thousands of good French knights and gentilhommes were massacred on the field of battle after having given their faith to their ennemies. They were without arms and waiting peacefully and the so called &quot;Knight King&quot; had them slaughtered like pigs in a slaughterhouse. One of my brother died fighting in the battle. The other one was captured and his throat was cut off by some English low-life when he was unarmed, and un-armored even. I lost both my brothers in Azincourt, to a disgraceful man that pretends to be chivalrous. And he&#39;s a coward, too. I sent him my gauntlet, demanding reparation for this atrocity, but he sent it back with his apologies. The glorious Knight King prefered his political calculations and his miserable life over his honor. Let it be known. </p>\n\n<p>Henry is a despicable, ruthless, faithless and honorless bastard and I hereby challenge him once more to a duel to the death to avenge the honor of my fallen brothers and the thousands of gallant knights that died disgracefully in Azincourt. I declare that David Michôt is an apologist paid by the usurper Henry and that he should be happy to have lived so long unbeknownst to me, for I now will send my faithful vassal, Jean de Luxembourg, to find and bring him to me so that he shall answer for this.</p>\n\n<p>If either one has some form of honor or respectability, they shall answer my challenge. If not, I expect them to faire excuses sincères et amende honorable, à pied nus et en robe blanche, sans ornement aucun à l&#39;imitation de Nostre Seigneur. Il marcheront, tête nue et en grande repentance, tout le chemin de nos braves chevaliers en ce jour d&#39;octobre de l&#39;année 1415. Ils bailleront alors bonne sépulture et grands honneurs aux corps enterrés en icelle place, ce jour et chaque jour ensuivant jusqu&#39;à accomplissement ce ladite oeuvre. Ensuite de quoi feront bonne et ferme promesse de jamais prendre les armes contre le royaume de France et de rendre les terres qu&#39;Henry y aura prises. Ils jureront de garder bonne paix pour toute éternité et feront dire chaque jour que Nostre Seigneur fait une grande messe en leur meilleure église pour mémoire et salut de nos preux. A ces conditions, moi, Jean sans Peur, duc de Bourgogne, accepterai leurs excuses et renonceraient à ma juste vengeance<sup>4</sup>.</p>\n\n<p>Fait en notre bonne ville de Lille et signé de nostre Grand Sceau le premier jour du mois d&#39;Avril de l&#39;an de grâce quatorze cent et dix neuf.</p>\n\n<p><sup>1</sup>Tanguy du Chastel killed John the Fearless with a axe blow to the head on 10th septembre 1419.</p>\n\n<p><sup>2</sup>I have the felling my son is using some kind of &quot;youth language&quot; here. When I mentionned it he answered &quot;OK boomer&quot;. Neither of us knows what that means, but he says it felt appropriate.</p>\n\n<p><sup>3</sup>Son of a prostitute, usurper, false knight and very diabolical creature.</p>\n\n<p><sup>4</sup>Make sincere apologies and excuses, barefoot and dressed in a white robe, without any ornement in the image of Our Lord. They whall walk, without a cap and repentant, all the way our brave knights did in this day of october 1415. They shall provide good sepultures and great honors to the bodies of the fallen buried in this place, that day and every day that follows until completion of the task. After this they shall make good and firm promises never to take arm against the kingdom of France again and Henry shall give back the lands he conquered. They shall swear to keep good peace for all eternity and they shall order masses be held in their best church for the memory and salvation of our brave knights until God&#39;s good time. At this conditions, I, John the Fearless, duke of Burgundy, shall I accept their excuses and renounce my rightful vengeance.</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/AskHistorians/comments/mhrc6p/review_lets_watch_this_movie_le_roi/",
  "subreddit": "AskHistorians",
  "id": "mhrc6p",
  "is_self": true,
  "media": null,
  "is_video": false
}