{
  "author": "SphmrSlmp",
  "original_created_utc": 1652873721,
  "title": "What should I be doing when a woman sits on my face?",
  "created_utc": 1652893606,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Whenever there&amp;#39;s a woman (or image of a woman) with a nice ass, it will get flooded with guys commenting the desire for the woman to sit on his face.&lt;/p&gt;\n\n&lt;p&gt;Sure, a nice ass is nice to look at, nice to touch, and even do more than that.&lt;/p&gt;\n\n&lt;p&gt;But what the hell am I suppose to do when a woman sits on my face?&lt;/p&gt;\n\n&lt;p&gt;Sniff her? Lick her ass hole? Lick her pussy? Do I rub my face on her ass?&lt;/p&gt;\n\n&lt;p&gt;More important than my own desire...  Does the woman even get turned on by this action? Does she feel good when she sits on a man&amp;#39;s face? What does she want the man to do while she sits on his face? Is she going to grind her ass/pussy on the man&amp;#39;s face?&lt;/p&gt;\n\n&lt;p&gt;I need answers!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 115,
  "permalink": "/r/TooAfraidToAsk/comments/usarx9/what_should_i_be_doing_when_a_woman_sits_on_my/",
  "subreddit": "TooAfraidToAsk",
  "id": "usarx9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "Whenever there's a woman (or image of a woman) with a nice ass, it will get\nflooded with guys commenting the desire for the woman to sit on his face.\n\nSure, a nice ass is nice to look at, nice to touch, and even do more than that.\n\nBut what the hell am I suppose to do when a woman sits on my…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "お尻がきれいな女性（または女性のイメージ）がいると、必ずと言っていいほど\nその女性に顔の上に座ってもらいたいとコメントする男が殺到する。\n\n確かに、いいお尻は見てよし、触ってよし、それ以上でもよし。\n\nしかし、女性が私の顔の上に座ったら、一体どうしたらいいのだろう......。",
      "title": "女性が顔の上に座ったらどうしたらいい？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "每当有一个女人（或一个女人的形象）有一个漂亮的屁股时，就会有大量的男人评论说希望女人坐在他的脸上。\n淹没在男人的评论中，他们希望这个女人能坐在他的脸上。\n\n当然，一个漂亮的屁股很好看，很好摸，甚至可以做得更多。\n\n但是，当一个女人坐在我的脸上时，我到底应该怎么做？",
      "title": "当一个女人坐在我的脸上时，我应该做什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "每當有一個女人（或一個女人的形象）有一個漂亮的屁股時，就會有大量的男人評論說希望女人坐在他的臉上。\n淹沒在男人的評論中，他們希望這個女人能坐在他的臉上。\n\n當然，一個漂亮的屁股很好看，很好摸，甚至可以做得更多。\n\n但是，當一個女人坐在我的臉上時，我到底應該怎麼做？",
      "title": "當一個女人坐在我的臉上時，我應該做什麼？"
    }
  ]
}