{
  "author": "resident_of_BM",
  "original_created_utc": 1641826293,
  "title": "If you can't keep bitcoin while it's down 80%, you don't deserve it when it's up 10000%",
  "created_utc": 1641854428,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So this is one of my favourite quotes that keep my diamond hand HODLing BTC, leave yours!&lt;/p&gt;\n\n&lt;p&gt;Edit: Yo guys! Thanks for the responses, no matter showing criticism or support. I don&amp;#39;t really know why people are comparing this situation to being in a toxic relationship, so I will provide another analogy for the quotes: &lt;/p&gt;\n\n&lt;p&gt;You have a partner who you have been together for years. Although financially, he/she might not be doing very good, but you know that he/she is TRYING! That&amp;#39;s the main point, there&amp;#39;ll be a great future if u guys stay together. Leaving your partner who is struggling and when they are down is bad...&lt;/p&gt;\n\n&lt;p&gt;So one more here, you&amp;#39;re supporting a football club and you know, they can&amp;#39;t win all the games. If you leave your club and go on supporting other clubs when your old club is in a bad form, then don&amp;#39;t come back when they start winning because you simply don&amp;#39;t like the club true heartedly.&lt;/p&gt;\n\n&lt;p&gt;I admit it doesn&amp;#39;t feel good when bitcoin dips, but if u paper-handed, then u wont even have the chance to celebrate the highs. So why not have some hopium!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 340,
  "permalink": "/r/Bitcoin/comments/s0lrl4/if_you_cant_keep_bitcoin_while_its_down_80_you/",
  "subreddit": "Bitcoin",
  "id": "s0lrl4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So this is one of my favourite quotes that keep my diamond hand HODLing BTC,\nleave yours!\n\nEdit: Yo guys! Thanks for the responses, no matter showing criticism or support.\nI don't really know why people are comparing this situation to being in a toxic\nrelationship, so I will provide another analogy…"
}