{
  "author": "resident_of_BM",
  "original_created_utc": 1641826293,
  "title": "If you can't keep bitcoin while it's down 80%, you don't deserve it when it's up 10000%",
  "created_utc": 1641854428,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So this is one of my favourite quotes that keep my diamond hand HODLing BTC, leave yours!&lt;/p&gt;\n\n&lt;p&gt;Edit: Yo guys! Thanks for the responses, no matter showing criticism or support. I don&amp;#39;t really know why people are comparing this situation to being in a toxic relationship, so I will provide another analogy for the quotes: &lt;/p&gt;\n\n&lt;p&gt;You have a partner who you have been together for years. Although financially, he/she might not be doing very good, but you know that he/she is TRYING! That&amp;#39;s the main point, there&amp;#39;ll be a great future if u guys stay together. Leaving your partner who is struggling and when they are down is bad...&lt;/p&gt;\n\n&lt;p&gt;So one more here, you&amp;#39;re supporting a football club and you know, they can&amp;#39;t win all the games. If you leave your club and go on supporting other clubs when your old club is in a bad form, then don&amp;#39;t come back when they start winning because you simply don&amp;#39;t like the club true heartedly.&lt;/p&gt;\n\n&lt;p&gt;I admit it doesn&amp;#39;t feel good when bitcoin dips, but if u paper-handed, then u wont even have the chance to celebrate the highs. So why not have some hopium!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 340,
  "permalink": "/r/Bitcoin/comments/s0lrl4/if_you_cant_keep_bitcoin_while_its_down_80_you/",
  "subreddit": "Bitcoin",
  "id": "s0lrl4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So this is one of my favourite quotes that keep my diamond hand HODLing BTC,\nleave yours!\n\nEdit: Yo guys! Thanks for the responses, no matter showing criticism or support.\nI don't really know why people are comparing this situation to being in a toxic\nrelationship, so I will provide another analogy…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは、私のダイヤモンドハンドがBTCをHODLINGし続けるための、お気に入りの名言の一つです。\nお先にどうぞ\n\n編集部：Yo guys! 批判や支持を示すものでなく、反応をありがとうございます。\n私は、なぜ人々がこの状況を有毒な環境にいることと比較しているのか、本当にわかりません。\nということで、別の例えを・・・。",
      "title": "80%下がっている時にビットコインを維持できないなら、10000%上がっている時にその資格はない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以这是我最喜欢的一句话，让我的钻石之手在BTC上不断地挥舞。\n留下你的!\n\nEdit: Yo guys! 谢谢你们的回应，不管是显示批评还是支持。\n我真的不知道为什么人们把这种情况比作是在一个有毒的\n关系，所以我将提供另一个比喻......",
      "title": "如果你不能在比特币下跌80%的时候保留它，那么当它上涨10000%的时候你就不配拥有它。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以這是我最喜歡的一句話，讓我的鑽石之手在BTC上不斷地揮舞。\n留下你的!\n\nEdit: Yo guys! 謝謝你們的回應，不管是顯示批評還是支持。\n我真的不知道爲什麼人們把這種情況比作是在一個有毒的\n關係，所以我將提供另一個比喻......",
      "title": "如果你不能在比特幣下跌80%的時候保留它，那麼當它上漲10000%的時候你就不配擁有它。"
    }
  ]
}