{
  "author": "whiskeynoble",
  "original_created_utc": 1637165677,
  "title": "For those that have been involved for ~ 10 years, what has surprised you most about the development of bitcoin?",
  "created_utc": 1637206931,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi all. I&#39;ve been involved with bitcoin since 2013. While I was not involved for extended periods of time, it is something I have always been deeply passionate about. In 2014-2015, I was convinced bitcoin was going to be the future of currency. I had no interest in getting rich off of it and simply wanted to be a part of something that intrigued me. I have not posted on this subreddit since approx. 2015. At the time I believed bitcoin/blockchain tech was going to be as revolutionary as the internet. Through the years a few things have surprised me. </p>\n\n<p>- In my eyes, bitcoin would not have made it past 2015 without a hard fork, I still cannot comprehend that bitcoin is able to function (although not without flaws) in todays world with the volume we are seeing.</p>\n\n<p>- The publics perception of bitcoin as an inflationary hedge and genuine store of value</p>\n\n<p>- The continued praise of Satoshi and his vision, I believe bitcoin has mostly stayed true to its core values </p>\n\n<p>- I am astounded by the continued denial of cryptocurrencies as an asset class by institutions. Through reports I have read, institutions are only getting involved due to client demand, I firmly believe this is a failure on their end. </p>\n\n<p>&#x200B;</p>\n\n<p>Overall, I cannot put into words how bitcoin has reshaped my vision of the world, and the revolution it has introduced to finance is nothing short of incredible. I&#39;d love to hear others experiences over the years.</p>\n</div><!-- SC_ON -->",
  "score": 155,
  "permalink": "/r/Bitcoin/comments/qw2pkt/for_those_that_have_been_involved_for_10_years/",
  "subreddit": "Bitcoin",
  "id": "qw2pkt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi all. I've been involved with bitcoin since 2013. While I was not involved for\nextended periods of time, it is something I have always been deeply passionate\nabout. In 2014-2015, I was convinced bitcoin was going to be the future of\ncurrency. I had no interest in getting rich off of it and simply…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。私は2013年からビットコインに関わっています。長期間関わっていたわけではありませんが\n長期間関わっていたわけではありませんが、常に深い情熱を持って取り組んできました。\nを持っています。2014年から2015年にかけて、私はビットコインが通貨の未来になると確信していました。\n通貨になると確信していました。私はビットコインで一攫千金を得ようとは考えておらず、単に...",
      "title": "10年以上携わっている方にとって、ビットコインの開発で最も驚いたことは何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。我从2013年就开始接触比特币了。虽然我没有长期参与\n漫长的时间，但我一直对它充满激情\n的东西。在2014-2015年，我确信比特币将成为未来的\n货币的未来。我对靠它发财没有兴趣，只是...",
      "title": "对于那些已经参与了大约10年的人来说，在比特币的发展过程中，什么让你感到最惊讶？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。我從2013年就開始接觸比特幣了。雖然我沒有長期參與\n漫長的時間，但我一直對它充滿激情\n的東西。在2014-2015年，我確信比特幣將成爲未來的\n貨幣的未來。我對靠它發財沒有興趣，只是...",
      "title": "對於那些已經參與了大約10年的人來說，在比特幣的發展過程中，什麼讓你感到最驚訝？"
    }
  ]
}