{
  "author": "ohno",
  "original_created_utc": 1635960293,
  "title": "Holders, What Projects Are you Losing Faith In?",
  "created_utc": 1635968169,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Anyone starting to have second thoughts on any of your long-term holds? </p>\n\n<p>I was a VET fanboy a few months ago, but now I&#39;m wondering if real-world application will ever turn into real-world profits for my wallet. Long-term, I can see it going up with the market, albeit lagging, but I don&#39;t see any of the announced usage having any affect on price.  Same with ACH.  </p>\n\n<p>Sure, we&#39;ll make money down the road, but how much are we losing by limiting our ability to buy into more profitable assets?  Is it worth it to you to stick with a project because you want to support the technology even if it means missing out on the moonshots, or even just higher profits with a safer investment?</p>\n</div><!-- SC_ON -->",
  "score": 199,
  "permalink": "/r/CryptoCurrency/comments/qlzgyf/holders_what_projects_are_you_losing_faith_in/",
  "subreddit": "CryptoCurrency",
  "id": "qlzgyf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Anyone starting to have second thoughts on any of your long-term holds?\n\nI was a VET fanboy a few months ago, but now I'm wondering if real-world\napplication will ever turn into real-world profits for my wallet. Long-term, I\ncan see it going up with the market, albeit lagging, but I don't see any of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "どなたか、長期保有していたものを考え直してみませんか？\n\n数ヶ月前まではVETのファンボーイでしたが、今では実世界での応用が私の財布の中で実世界での利益になるかどうか疑問に思っています。\n私の財布に現実の利益をもたらすことができるのか疑問です。長期的には\n遅れをとっているとはいえ、市場とともに上昇していくのはわかりますが、私には何も見えません...。",
      "title": "ホルダーの皆さん、どんなプロジェクトに信頼を失っていますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有没有人开始对你的长期持有的任何股票有了新的想法？\n\n几个月前我还是VET的粉丝，但现在我在想，现实世界的应用是否会变成我钱包里的现实世界的利润。\n应用会不会变成我钱包里的真实利润。长期而言，我\n我可以看到它与市场一起上涨，尽管是滞后的，但我没有看到任何...",
      "title": "持有者，你对哪些项目失去了信心？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有沒有人開始對你的長期持有的任何股票有了新的想法？\n\n幾個月前我還是VET的粉絲，但現在我在想，現實世界的應用是否會變成我錢包裏的現實世界的利潤。\n應用會不會變成我錢包裏的真實利潤。長期而言，我\n我可以看到它與市場一起上漲，儘管是滯後的，但我沒有看到任何...",
      "title": "持有者，你對哪些項目失去了信心？"
    }
  ]
}