{
  "author": "41ii",
  "original_created_utc": 1655115367,
  "title": "Why can't you touch any strange woman and even most of your female family members in Islam?",
  "created_utc": 1655128048,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For those who don&amp;#39;t know: If you&amp;#39;re a boy, according to Islam rules, when you reach 15 years old you have to avoid touching any strange woman and even most of your female family members.\nI&amp;#39;m Muslim and I&amp;#39;ve grown up in a Muslim family, I love them. Now I&amp;#39;m a 22 year old guy and when I was a kid I used to hug and kiss my family members whenever I met them, but it&amp;#39;s been awhile since I couldn&amp;#39;t do it. It&amp;#39;s really annoying. You know it&amp;#39;s ok with female strangers, but when it comes to your family, it&amp;#39;s unacceptable. That&amp;#39;s all. I&amp;#39;m just curious to know what&amp;#39;s the reason for this prevention? Westerners don&amp;#39;t have such things and everything goes well. So what&amp;#39;s wrong with us?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 136,
  "permalink": "/r/TooAfraidToAsk/comments/vb8ux4/why_cant_you_touch_any_strange_woman_and_even/",
  "subreddit": "TooAfraidToAsk",
  "id": "vb8ux4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "For those who don't know: If you're a boy, according to Islam rules, when you\nreach 15 years old you have to avoid touching any strange woman and even most of\nyour female family members. I'm Muslim and I've grown up in a Muslim family, I\nlove them. Now I'm a 22 year old guy and when I was a kid I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ご存じない方のために もしあなたが男の子なら、イスラム教のルールによれば、15歳になったら、\n見知らぬ女性や、家族の女性にも触れないようにしなければなりません。\n女性の家族にも触れないようにしなければなりません。私はイスラム教徒で、イスラム教徒の家族の中で育ちました。\n愛しています。今、僕は22歳の男ですが、子供の頃、僕は...",
      "title": "なぜイスラム教では見知らぬ女性や、女性の家族のほとんどに触れることができないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对于那些不知道的人来说。如果你是一个男孩，根据伊斯兰教的规定，当你达到15岁时\n你必须避免接触任何陌生的女人，甚至是大多数的女性家庭成员。\n你的女性家庭成员。我是穆斯林，我在一个穆斯林家庭长大，我\n爱他们。现在我是一个22岁的人，当我还是个孩子时，我...",
      "title": "为什么在伊斯兰教中，你不能接触任何陌生的女人，甚至你的大多数女性家庭成员？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對於那些不知道的人來說。如果你是一個男孩，根據伊斯蘭教的規定，當你達到15歲時\n你必須避免接觸任何陌生的女人，甚至是大多數的女性家庭成員。\n你的女性家庭成員。我是穆斯林，我在一個穆斯林家庭長大，我\n愛他們。現在我是一個22歲的人，當我還是個孩子時，我...",
      "title": "爲什麼在伊斯蘭教中，你不能接觸任何陌生的女人，甚至你的大多數女性家庭成員？"
    }
  ]
}