{
  "author": "gorays21",
  "the_new_excerpt": "DraftKings and the National Football League (NFL) announced today that\nDraftKings will become an Official Sports Betting Partner of the League and\nextend its current relationship as the exclusive Official Daily Fantasy Partner.\n\n“The way fans consume sports years from now will look drastically…",
  "original_created_utc": 1618519087,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ドラフトキングスとナショナル・フットボール・リーグ（NFL）は、本日、以下を発表しました。\nDraftKingsは、NFLの公式スポーツベッティングパートナーとなります。\n現在の公式デイリーファンタジーパートナーとしての関係を延長することを発表しました。\n\n\"今から数年後、ファンがスポーツを消費する方法は、大きく変わるでしょう。",
      "title": "ドラフトキングス社がNFLの公式スポーツベッティングパートナーに決定"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "DraftKings和美国国家橄榄球联盟(NFL)今天宣布。\nDraftKings将成为联盟的官方体育博彩合作伙伴，并。\n延续其目前的合作关系，成为《天天幻想》的独家官方合作伙伴。\n\n\"多年以后，球迷们消费体育的方式将会发生翻天覆地的变化... ...",
      "title": "DraftKings成为NFL官方体育博彩合作伙伴"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "DraftKings和美國國家橄欖球聯盟(NFL)今天宣佈。\nDraftKings將成爲聯盟的官方體育博彩合作伙伴，並。\n延續其目前的合作關係，成爲《天天幻想》的獨家官方合作伙伴。\n\n\"多年以後，球迷們消費體育的方式將會發生翻天覆地的變化... ...",
      "title": "DraftKings成爲NFL官方體育博彩合作伙伴"
    }
  ],
  "title": "DraftKings Named an Official Sports Betting Partner of the NFL",
  "created_utc": 1618523500,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>DraftKings and the National Football League (NFL) announced today that DraftKings will become an Official Sports Betting Partner of the League and extend its current relationship as the exclusive Official Daily Fantasy Partner.</p>\n\n<p>“The way fans consume sports years from now will look drastically different, and it will be due in part to forward-thinking collaborations like our expanded relationship with the NFL today as an Official Sports Betting Partner and the exclusive Daily Fantasy Sports Partner,” said Jason Robins, CEO, chairman and co-founder, DraftKings. “We share the same vision as the NFL on fan engagement and believe this agreement will lead to new innovations that will ultimately enhance both the product on the field and on the screen.”</p>\n\n<p>As an Official Sports Betting Partner of the NFL, DraftKings will have the right to integrate relevant sports betting content directly into NFL Media properties including NFL.com and the NFL App. As part of the agreement, DraftKings will utilize the NFL’s official League data feed. DraftKings will also be able to enhance their fan experience with NFL highlights, footage and Next Gen States content.</p>\n\n<p><a href=\"https://www.globenewswire.com/news-release/2021/04/15/2211253/0/en/DraftKings-Named-an-Official-Sports-Betting-Partner-of-the-National-Football-League.html\">https://www.globenewswire.com/news-release/2021/04/15/2211253/0/en/DraftKings-Named-an-Official-Sports-Betting-Partner-of-the-National-Football-League.html</a></p>\n</div><!-- SC_ON -->",
  "score": 2315,
  "permalink": "/r/stocks/comments/mrnkds/draftkings_named_an_official_sports_betting/",
  "subreddit": "stocks",
  "id": "mrnkds",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171526124
}