{
  "author": "Two_Pickachu_One_Cup",
  "original_created_utc": 1656732958,
  "title": "A couple of months ago I tried to warn this sub about the risks of lending your coins and was laughed out of the room",
  "created_utc": 1656768757,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is the post where I clearly warned people about the risk of lending your coins:\n &lt;a href=\"https://www.reddit.com/r/CryptoCurrency/comments/u4j817/you_should_think_twice_before_lending_your_coins/?utm_medium=android_app&amp;amp;utm_source=share\"&gt;https://www.reddit.com/r/CryptoCurrency/comments/u4j817/you_should_think_twice_before_lending_your_coins/?utm_medium=android_app&amp;amp;utm_source=share&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;As we now know both Celsius and Voyager were engaging in high risk lending using users funds. This was working well in a bull market but when a bear market comes round the risk caught up with them. Both are now facing bankruptcy.&lt;/p&gt;\n\n&lt;p&gt;If your still thinking of lending your coins in this current environment I would strongly suggest not doing so. These lending platforms NEED liquidity to make those risky lends. They get liquidity by sucking users into the platform by offering unrealistic returns and promoting them as &amp;quot;safe&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;There are no regulations to stop the exchange from engaging in high risk lending in order to meet their promised returns.&lt;/p&gt;\n\n&lt;p&gt;So simply put, lending your coins is high risk and not worth the return due to lack of regulation around what the exchange can do with your coins.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 324,
  "permalink": "/r/CryptoCurrency/comments/vpilgs/a_couple_of_months_ago_i_tried_to_warn_this_sub/",
  "subreddit": "CryptoCurrency",
  "id": "vpilgs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "This is the post where I clearly warned people about the risk of lending your\ncoins:\nhttps://www.reddit.com/r/CryptoCurrency/comments/u4j817/you_should_think_twice_before_lending_your_coins/?utm_medium=android_app&utm_source=share\n\nAs we now know both Celsius and Voyager were engaging in high risk…"
}