{
  "author": "operator139",
  "original_created_utc": 1629735790,
  "title": "People buying Cardano right now are the equivalent of buying a video game on preorder.",
  "created_utc": 1629754502,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hear me out here. Smart contracts are not live yet. It’s just a fact. Yes, we have a launch date. Yes, it’s in two weeks. That doesn’t change the fact the launch has not happened yet, and there’s no way knowing how it’s going to go. </p>\n\n<p>I have some ADA- but am I all in? No. That’s foolish at this point before the launch. Seeing the way crypto goes and how nasty new hard forks or upgrades can go, all I’m saying is, a word of caution. Don’t fall for the hype completely.</p>\n\n<p>We could see another delay in just a week. We could see something go wrong in the upgrade and a nasty rug pull or a hack. I doubt it but if there’s on thing I’ve learned from the crypto space, don’t be surprised if something unpredictable happens. </p>\n\n<p>I find it promising what Charles is saying but the fact of the matter is we have no actual functional product yet. Simple.</p>\n</div><!-- SC_ON -->",
  "score": 172,
  "permalink": "/r/CryptoCurrency/comments/pa394v/people_buying_cardano_right_now_are_the/",
  "subreddit": "CryptoCurrency",
  "id": "pa394v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hear me out here. Smart contracts are not live yet. It’s just a fact. Yes, we\nhave a launch date. Yes, it’s in two weeks. That doesn’t change the fact the\nlaunch has not happened yet, and there’s no way knowing how it’s going to go.\n\nI have some ADA- but am I all in? No. That’s foolish at this point…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここで聞いてください。スマートコントラクトはまだ生きていない。それはただの事実です。そう、我々は\n発売日は決まっています。そう、それは2週間後です。しかし、まだ発売されていないという事実は変わりません。\nまだ発売されていないし、どうなるかなんてわからない。\n\n多少のADAを持っていますが、すべてに参加しますか？いや、今の時点でそれは愚かなことだ...。",
      "title": "今、カルダノを買っている人は、ビデオゲームを予約して買っているのと同じです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在这里听我说。智能合约还没有上线。这只是一个事实。是的，我们\n有一个启动日期。是的，它在两个星期内。但这并不能改变一个事实，那就是\n这并不改变发射还没有发生的事实，也不可能知道它将如何发展。\n\n我有一些ADA--但我是否全身心投入？不，在这一点上，那是愚蠢的...",
      "title": "现在购买Cardano的人就相当于购买预购的视频游戏。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在這裏聽我說。智能合約還沒有上線。這只是一個事實。是的，我們\n有一個啓動日期。是的，它在兩個星期內。但這並不能改變一個事實，那就是\n這並不改變發射還沒有發生的事實，也不可能知道它將如何發展。\n\n我有一些ADA--但我是否全身心投入？不，在這一點上，那是愚蠢的...",
      "title": "現在購買Cardano的人就相當於購買預購的視頻遊戲。"
    }
  ]
}