{
  "author": "Slow_Seaworthiness15",
  "the_new_excerpt": "$TM Toyota Motors\n\n**Full disclosure: I own 75k in Toyota calls. I also own a Porsche and Audi (no\nToyota products). I’m also not good with investing. So don’t listen to me.\n\nWow, some of the best plays truly are right in front of you, because Toyota is\nhilariously undervalued now that they’ve…",
  "original_created_utc": 1613020188,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "$TM 丰田汽车公司\n\n**Full disclosure: I own 75k in Toyota calls. 我还拥有一辆保时捷和奥迪(无\n丰田产品）。) 我也不擅长投资。所以不要听我说。\n\n哇，有些好戏真的就在你面前，因为丰田是\n价值被低估，现在他们已经... ...",
      "title": "对丰田汽车的粗略分析"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "$TM 豐田汽車公司\n\n**Full disclosure: I own 75k in Toyota calls. 我還擁有一輛保時捷和奧迪(無\n豐田產品）。) 我也不擅長投資。所以不要聽我說。\n\n哇，有些好戲真的就在你面前，因爲豐田是\n價值被低估，現在他們已經... ...",
      "title": "對豐田汽車的粗略分析"
    }
  ],
  "title": "A rough Analysis on Toyota Motors",
  "created_utc": 1613050412,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>$TM Toyota Motors</strong></p>\n\n<p>**Full disclosure: I own 75k in Toyota calls. I also own a Porsche and Audi (no Toyota products). I’m also not good with investing. So don’t listen to me.</p>\n\n<p>Wow, some of the best plays truly are right in front of you, because Toyota is hilariously undervalued now that they’ve decided to enter the EV market.</p>\n\n<p>Toyota, is an engineering and business legend. Nobody engineers better than Toyota, nobody optimizes businesses and Toyota.</p>\n\n<p>When I went through business school we studied Toyota in almost ever classroom. Toyota practically invented modern business practices and engineering practices.</p>\n\n<p>If you haven’t heard of Toyota as a professional in business or engineering, you should probably be fired.</p>\n\n<p>The following statements may sound like opinions, I’m pretty sure they’re facts.</p>\n\n<p>- Dominates the manufacturing supply practice. Nothing is wasted in Toyota’s business, everything runs <strong>LEAN and AGILE.</strong> During economic downturns Toyota will always come out on top simply  because they’ve <strong>perfected</strong> the art of <strong>efficiency</strong>.</p>\n\n<p>- The finest engineers work at Toyota. Everything Toyota produces is an engineering marvel. Products optimized perfectly for each single demographic to be as affordable and reliable as possible  while being practical and usable.</p>\n\n<p>Today, Toyota officially entered the EV business. The company with a perfect supply chain, the company with the highest amount of consumer trust, the company that has the finest engineers in the entire automotive industry and a practically infinite amount of wealth…has entered the room. So let’s look at their positioning.</p>\n\n<p>- Toyota is bound to be a huge recipient of the Biden’s plan to supply the federal government with EVs.</p>\n\n<p>- Fun fact, the top “American” companies are asian. The big three make most of their junk abroad.</p>\n\n<p>- Toyota is planning on being the <strong>first</strong> to deploy the <strong>SOLID STATE BATTERY.</strong></p>\n\n<p><strong>- MASSIVE Energy density</strong> compared to existing technology.</p>\n\n<p>- Solid state batteries can easily reach <strong>500+ mile range.</strong></p>\n\n<p>- <strong>Much</strong> faster charge time.</p>\n\n<p>- Have already begun the production process</p>\n\n<p>- Toyota plans on unveiling the first solid state powered EV this year with release soon after.</p>\n\n<p>- Toyota produces over 10,000,000 vehicles a year. Tesla reached 500,000 this year with a goal of 20% growth a year.</p>\n\n<p>- Toyota is the most trusted brand internationally in the automotive world.</p>\n\n<p>So Toyota, a manufacturing behemoth is switching to fully electric with aims of putting their world class engineers to produce the world’s first solid state battery commercial vehicle. Nice.</p>\n\n<p>Let’s talk about some numbers:</p>\n\n<p>- Price to book ratio of 1.137. Anything under 3 is considered undervalued. Tesla is around 40.</p>\n\n<p>- PE ratio of 17.17. Anything under 20 is undervalued, Apple is at 37 and <strong>Tesla is 1301.</strong></p>\n\n<p><strong>-</strong> Expected to increase margin from 5.5 -&gt; 7.2</p>\n\n<ul>\n<li>121% increase in operating income from China</li>\n<li>24% Increase in cash/cash equivalents since Apr 2019. Impressive considering covid</li>\n<li>Relatively stable/balanced asset/liability ratio, has barely budged since covid).</li>\n<li>Has somehow decreased cost and expenses by 16% during covid.</li>\n</ul>\n\n<p>If Tesla is the King Kong of the EV world, then Toyota is Godzilla, a nuclear powered dinosaur of a company from outer space. He’s landed and he’s gonna blow up your bubble. Yes I’m aware of the “Not just a car company” phrase, but as Burry said, “Enjoy it while it lasts”, because no company should be trading with a century of growth priced in.</p>\n\n<p><strong>Tl;dr</strong></p>\n\n<p>Toyota is here and it’s going to devour the EV market. Good long term purchase, but I have 75,000$ in calls.</p>\n\n<p>Not a Toyota fanboy( I drive a Porsche and Audi). Don&#39;t take my advice.</p>\n</div><!-- SC_ON -->",
  "score": 117,
  "permalink": "/r/investing/comments/lhdjf1/a_rough_analysis_on_toyota_motors/",
  "subreddit": "investing",
  "id": "lhdjf1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728620235
}