{
  "author": "electronic_docter",
  "original_created_utc": 1624743686,
  "title": "Why does no one seem to care that the us prison system is just slavery with extra steps?",
  "created_utc": 1624756162,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Basically the title, the us constitution directly states that people cannot be forced to do free labour..... Unless theyre imprisoned and incarceration rates have reflected this since then. theres a direct incentive for incarceration rates to remain high aslong as that statement is in the constitution and judging by how the us prison system is consistently ranked among the worst of the developed word and it seems intentional (especially since private prisons are a thing). Why do more people not talk about this?</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/TooAfraidToAsk/comments/o8jp8d/why_does_no_one_seem_to_care_that_the_us_prison/",
  "subreddit": "TooAfraidToAsk",
  "id": "o8jp8d",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Basically the title, the us constitution directly states that people cannot be\nforced to do free labour..... Unless theyre imprisoned and incarceration rates\nhave reflected this since then. theres a direct incentive for incarceration\nrates to remain high aslong as that statement is in the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "基本的にタイトルにあるように、米国憲法では、人々は自由労働を強制されることはないと直接述べられています。\n自由な労働を強制することはできません。..... 投獄されていない限り、投獄率はそれを反映しています。\nそれ以来、投獄率はこのことを反映しています。投獄率が改善される直接的なインセンティブがあります。\n憲法にその記述がある限り、投獄率は高いままです。",
      "title": "アメリカの刑務所制度が、奴隷制度に追加のステップを加えたものであることを、なぜ誰も気にしないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "基本上是这样的，美国宪法直接规定，人们不能被\n强迫做免费劳动..... 除非他们被关进监狱，而监禁率\n从那时起，监禁率就反映了这一点。\n监禁率居高不下的直接诱因，只要这句话还在......",
      "title": "为什么似乎没有人关心我们的监狱系统只是带有额外步骤的奴隶制？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "基本上是這樣的，美國憲法直接規定，人們不能被\n強迫做免費勞動..... 除非他們被關進監獄，而監禁率\n從那時起，監禁率就反映了這一點。\n監禁率居高不下的直接誘因，只要這句話還在......",
      "title": "爲什麼似乎沒有人關心我們的監獄系統只是帶有額外步驟的奴隸制？"
    }
  ]
}