{
  "author": "SuperHanssssss",
  "the_new_excerpt": "Hi guys,\n\n\n\nI woke up this morning to find my MetaMask wallet was empty. Overnight, someone\nwithdrew 22 ETH worth over $60K (My life saving pretty much, I'm 27 and was\naiming for a small apartment to live in)\n\n\n\nMy wallet (Account 1)…",
  "original_created_utc": 1619474581,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは、皆さん。\n\n\n\n今朝起きたら、MetaMaskのウォレットが空になっていました。一晩中、誰かが\n6万ドル以上の価値がある22個のETHを引き出しました(私の命をかなり救った、私は27歳で\n27歳で小さなアパートに住むことを目指していました)\n\n\n\n私のウォレット（アカウント1）...",
      "title": "今朝起きたら、私のMetaMaskから6万ドル相当の暗号が盗まれていました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。\n\n\n\n我今天早上醒来，发现我的MetaMask钱包是空的。一夜之间，有人\n提取了22个ETH，价值超过6万美元（我的救命钱，我27岁了，本来想买个小公寓住的）。\n我的目标是买个小公寓住）。)\n\n\n\n我的钱包（账户1）...",
      "title": "今早醒来发现我的MetaMask中价值6万美元的加密货币被盗。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。\n\n\n\n我今天早上醒來，發現我的MetaMask錢包是空的。一夜之間，有人\n提取了22個ETH，價值超過6萬美元（我的救命錢，我27歲了，本來想買個小公寓住的）。\n我的目標是買個小公寓住）。)\n\n\n\n我的錢包（賬戶1）...",
      "title": "今早醒來發現我的MetaMask中價值6萬美元的加密貨幣被盜。"
    }
  ],
  "title": "Woke up this morning to $60K worth of crypto stolen from my MetaMask",
  "created_utc": 1619494515,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi guys, </p>\n\n<p>&#x200B;</p>\n\n<p>I woke up this morning to find my MetaMask wallet was empty. Overnight, someone withdrew 22 ETH worth over $60K (My life saving pretty much, I&#39;m 27 and was aiming for a small apartment to live in)</p>\n\n<p>&#x200B;</p>\n\n<p>My wallet (Account 1) address <a href=\"https://etherscan.io/address/0x374d51543db6c697eed85fe7fd9fa485201f34a9\">https://etherscan.io/address/0x374d51543db6c697eed85fe7fd9fa485201f34a9</a></p>\n\n<p>&#x200B;</p>\n\n<p>It seems to end up on the an Exchange named FixedFloat, you can track the transfers and final deposit here</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://etherscan.io/address/0x4e5b2e1dc63f6b91cb6cd759936495434c7e972f\">https://etherscan.io/address/0x4e5b2e1dc63f6b91cb6cd759936495434c7e972f</a></p>\n\n<p>&#x200B;</p>\n\n<p>About 4 days ago, I downloaded a software called LimitSwap to purchase  a new token the moment it is listed. This company is run buy a man who goes by the name Crypto Gnome. His trading software requires you to input your private key so it can execute trades. I asked about this in the telegram group and a bunch of people immediately reassured me this is normal, the bot only runs on my computer and needs the key to make trades. The developers would never have access to the key. \n My computer has never been compromised before, only in the few days since I inputted my key into his software. Basically the amount of people who claimed to be fellow customers reassuring me gained my trust. Looking back, this was incredibly gullible of me. <a href=\"https://www.limitswap.com/\">https://www.limitswap.com/</a> <a href=\"https://www.youtube.com/watch?v=i5qWpyoWPMk&amp;ab_channel=LimitSwap\">https://www.youtube.com/watch?v=i5qWpyoWPMk&amp;ab_channel=LimitSwap</a></p>\n\n<p>&#x200B;</p>\n\n<p>I contacted him but he his is not very helpful at all. He is accusing me of lying and never using his software, even though you can trace the token I had to buy to use his program named $LIMIT</p>\n\n<p>Any ideas how to proceed from here would be greatly appreciated. </p>\n\n<p>&#x200B;</p>\n\n<p>For anyone reading this, please go buy a cold wallet right now. Also never share your private key with anyone, even your grandmother. I was way too relaxed about my crypto and there are people at every corner with plans already hatched on how to steal your assets. Be careful out there don&#39;t trust anyone or any software claiming to need your private key.</p>\n\n<p>I made this from nothing so I guess I&#39;ll just have to start again. Not the end of the world but a very expensive lesson.</p>\n</div><!-- SC_ON -->",
  "score": 1651,
  "permalink": "/r/CryptoCurrency/comments/mz9am8/woke_up_this_morning_to_60k_worth_of_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "mz9am8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776212017
}