{
  "author": "BaconHash",
  "original_created_utc": 1644767395,
  "title": "Is Race a real issue in your daily life?",
  "created_utc": 1644781128,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Heads up, 40 white male perspective.&lt;/p&gt;\n\n&lt;p&gt;Media makes it seem like there’s a race war, but living in the south I just don’t see it. I hold doors open for black guys, they hold doors for me. When we cross on the street or going in a store, we say what’s up or nod and keep it moving. &lt;/p&gt;\n\n&lt;p&gt;At work every gets along just fine, my friends are a mixed bunch. In fact my wife’s best friend is black and they have matching “sister” tattoos. Never “went out of the way” to make that token black friend. It just happened, she will get our kids and our house if my wife and I die early. &lt;/p&gt;\n\n&lt;p&gt;Race doesn’t seem to be a issue in my personal daily life, am I crazy? Is your life different?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 139,
  "permalink": "/r/TooAfraidToAsk/comments/srll44/is_race_a_real_issue_in_your_daily_life/",
  "subreddit": "TooAfraidToAsk",
  "id": "srll44",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Heads up, 40 white male perspective.\n\nMedia makes it seem like there’s a race war, but living in the south I just\ndon’t see it. I hold doors open for black guys, they hold doors for me. When we\ncross on the street or going in a store, we say what’s up or nod and keep it\nmoving.\n\nAt work every gets…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "気を取り直して、40歳の白人男性目線。\n\nメディアは人種間戦争があるように見せているが、南部に住んでいる私はただ\n見ていない。私は黒人のためにドアを開け、彼らは私のためにドアを開けてくれます。私たちが\n道ですれ違ったり、店に入ったりしたら、どうしたの、とか、うなずいたりして、そのまま\n移動する。\n\n仕事では、すべての人が...",
      "title": "レースは日常生活で本当に必要な問題ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "抬起头来，40岁的白人男性视角。\n\n媒体让它看起来像一场种族战争，但生活在南方的我只是\n没有看到这一点。我为黑人开门，他们也为我开门。当我们\n当我们在街上相遇或进入一家商店时，我们会说 \"你好 \"或点头，然后保持联系。\n进展。\n\n在工作中，每个人都得到...",
      "title": "在你的日常生活中，种族是一个真正的问题吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "抬起頭來，40歲的白人男性視角。\n\n媒體讓它看起來像一場種族戰爭，但生活在南方的我只是\n沒有看到這一點。我爲黑人開門，他們也爲我開門。當我們\n當我們在街上相遇或進入一家商店時，我們會說 \"你好 \"或點頭，然後保持聯繫。\n進展。\n\n在工作中，每個人都得到...",
      "title": "在你的日常生活中，種族是一個真正的問題嗎？"
    }
  ]
}