{
  "author": "crazyguy28",
  "original_created_utc": 1659456399,
  "title": "What do you do if landlord won't fix brown recluse infestation?",
  "created_utc": 1659495925,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;She thinks it&amp;#39;s not dangerous or a big deal. I&amp;#39;ve caught 10 in 3 days. I know they are recluses and not similar spiders but verified recluses. They match all the close up pictures of recluses online. Violin, 6 eyes, smooth brown yellow body and legs, each size of a quarter. Neighbors dont seem to care either. I have not even moved in yet and its only day 2 of my lease. I dont have money for a lawyer. What do I do?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 113,
  "permalink": "/r/NoStupidQuestions/comments/wefmhg/what_do_you_do_if_landlord_wont_fix_brown_recluse/",
  "subreddit": "NoStupidQuestions",
  "id": "wefmhg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "She thinks it's not dangerous or a big deal. I've caught 10 in 3 days. I know\nthey are recluses and not similar spiders but verified recluses. They match all\nthe close up pictures of recluses online. Violin, 6 eyes, smooth brown yellow\nbody and legs, each size of a quarter. Neighbors dont seem to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "危険でもなければ、大したことでもないと思っている。3日で10匹捕まえたよ。私は知っています。\n似たようなクモではなく、確認されたレキュラスです。彼らは、すべての\nネットの写真と一致した バイオリン、6つの目、滑らかな茶色の黄色\n胴体と脚はそれぞれ4分の1の大きさです。隣人には見えないが...。",
      "title": "大家がブラウン・リクリュースの蔓延を直さない場合、どうすればよいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "她认为这并不危险，也不是什么大问题。我在3天内抓了10个。我知道\n它们是孑孓，不是类似的蜘蛛，而是经过验证的孑孓。它们与网上所有\n网上关于孑孓的近距离照片。小提琴，6只眼睛，光滑的棕黄色\n身体和腿，每个都有四分之一大小。邻居们似乎并不...",
      "title": "如果房东不愿意解决棕色隐士的侵扰，你该怎么办？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "她認爲這並不危險，也不是什麼大問題。我在3天內抓了10個。我知道\n它們是孑孓，不是類似的蜘蛛，而是經過驗證的孑孓。它們與網上所有\n網上關於孑孓的近距離照片。小提琴，6隻眼睛，光滑的棕黃色\n身體和腿，每個都有四分之一大小。鄰居們似乎並不...",
      "title": "如果房東不願意解決棕色隱士的侵擾，你該怎麼辦？"
    }
  ]
}