{
  "author": "just---here",
  "original_created_utc": 1637309632,
  "title": "Monero is clearly the only privacy coin that does what it says on the tin.",
  "created_utc": 1637354438,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m sure most people have heard about kraken delisting monero in the UK and it&#39;s not the first exchange to do so. At this rate it deffinetaly wont be the last exchange to do so either but all it does is prove that in the pool of privacy coins, monero is the only one which wont bow down to regulators. You got your Zcash and Dash and other coins that claim to be private but none of them have an IRS bounty on them, they all make sure to abide by some form of regulation to stay on exchanges and they all have privacy as an opt in option which dosent make it private to me personaly. Monero does none of them things and regulators are clearly afraid of it. This delisting will probably have a small knock on effect on price in the short term but one day everyone will need 5 minutes of privacy and when they do Monero will always be there for them, a real crypto currency that gets used like cash money. Long live XMR.</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/CryptoCurrency/comments/qxbm9o/monero_is_clearly_the_only_privacy_coin_that_does/",
  "subreddit": "CryptoCurrency",
  "id": "qxbm9o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm sure most people have heard about kraken delisting monero in the UK and it's\nnot the first exchange to do so. At this rate it deffinetaly wont be the last\nexchange to do so either but all it does is prove that in the pool of privacy\ncoins, monero is the only one which wont bow down to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "イギリスでkrakenがmoneroを上場廃止にしたことは、ほとんどの人が聞いたことがあると思いますが、これは最初の取引所ではありません。\nこれは最初の取引所ではありません。このままでは最後の取引所にもならないでしょう。\nこのままでは最後の取引所にもなりませんが、プライバシーコインのプールの中で、moneroが唯一の存在であることを証明しています。\nしかし、これは、プライバシーコインの中で、moneroが唯一屈服しないことを証明しています。",
      "title": "Moneroは明らかに、その言葉通りに機能する唯一のプライバシーコインです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我相信大多数人都听说过英国Kraken将Monero退市的事情，而且它也不是第一个这样做的交易所。\n它不是第一个这样做的交易所。按照这个速度，它也不会是最后一个这样做的交易所。\n交易所，但它所做的只是证明，在所有的隐私币中，Monero是唯一的一个。\n币中，monero是唯一一个不会向...",
      "title": "Monero显然是唯一的隐私币，它做了它在锡上所说的事情。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我相信大多數人都聽說過英國Kraken將Monero退市的事情，而且它也不是第一個這樣做的交易所。\n它不是第一個這樣做的交易所。按照這個速度，它也不會是最後一個這樣做的交易所。\n交易所，但它所做的只是證明，在所有的隱私幣中，Monero是唯一的一個。\n幣中，monero是唯一一個不會向...",
      "title": "Monero顯然是唯一的隱私幣，它做了它在錫上所說的事情。"
    }
  ]
}