{
  "author": "_miia",
  "the_new_excerpt": "Disclaimer: I’m not the sharpest knife in the drawer. I’d love whatever advice\nyou have to offer, but kindness and understanding is appreciated.\n\nI got the book my profesor told me to get, “The Little Book of Common Sense\nInvesting,” a lot of it has gone completely over my head.\n\nI can’t see the big…",
  "original_created_utc": 1622956892,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "免責事項：私は引き出しの中で最も鋭いナイフではありません。アドバイスがあれば嬉しいです。\n私はあなたが提供しなければならないものがあれば何でも欲しいですが、親切心と理解があればありがたいです。\n\n私はプロフェッサーが私に言った本、\"The Little Book of Common Sense \"を手に入れました。\n投資」という本を手に入れましたが、その多くは私の頭の中を完全に覆っています。\n\n私は大きなものを見ることができません...",
      "title": "私は大学1年のパーソナルファイナンスの授業で、ボーグルの本を読んでいますが、何も理解できません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "免责声明：我不是抽屉里最锋利的刀。我很乐意接受任何建议\n我喜欢你提供的任何建议，但希望你能善意和理解。\n\n我得到了我的教授告诉我的那本书，《常识小书》。\n投资》，其中很多内容完全超出了我的想象。\n\n我无法看到大...",
      "title": "我在大学一年级上个人理财课，我正在读博格尔的书，但我什么都不明白"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "免責聲明：我不是抽屜裏最鋒利的刀。我很樂意接受任何建議\n我喜歡你提供的任何建議，但希望你能善意和理解。\n\n我得到了我的教授告訴我的那本書，《常識小書》。\n投資》，其中很多內容完全超出了我的想象。\n\n我無法看到大...",
      "title": "我在大學一年級上個人理財課，我正在讀博格爾的書，但我什麼都不明白"
    }
  ],
  "title": "I am in a personal finance class in my first year of college, I am reading Bogle’s book, and I don’t understand anything",
  "created_utc": 1622983128,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Disclaimer: I’m not the sharpest knife in the drawer. I’d love whatever advice you have to offer, but kindness and understanding is appreciated. </p>\n\n<p>I got the book my profesor told me to get, “The Little Book of Common Sense Investing,” a lot of it has gone completely over my head. </p>\n\n<p>I can’t see the big picture. I can’t visualize any of the concepts. I think I understand the Gotrock parable, to a degree,  but then when he starts to talk about Helpers and “capital gains taxes.” And I’m lost.</p>\n\n<p>Am I in the wrong class? Am I totally hopeless? I feel like I might as well be reading Chinese right now I’m so lost.  </p>\n\n<p>I guess my questions are:</p>\n\n<p>What was your introduction to this stuff? </p>\n\n<p>Do I just keep pushing forward even though I don’t get it?</p>\n\n<p>Are there any videos you recommend that can illustrate these concepts better?</p>\n</div><!-- SC_ON -->",
  "score": 110,
  "permalink": "/r/Bogleheads/comments/ntedme/i_am_in_a_personal_finance_class_in_my_first_year/",
  "subreddit": "Bogleheads",
  "id": "ntedme",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404885444
}