{
  "author": "Ildrei",
  "the_new_excerpt": "The Japanese government transmitted the ultimatum in 14 parts to the Japanese\nembassy in Washington, D.C. where they would decode and transcript it to be\ndelivered 30 minutes before the surprise attack on Pearl Harbor. But a delay in\nthe decoding meant the ambassador had to deliver it after the…",
  "original_created_utc": 1620176930,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "日本政府はこの最後通告を14回に分けて、ワシントンD.C.の日本大使館に送りました。\nワシントンD.C.の日本大使館に14回に分けて送信していました。\n真珠湾奇襲攻撃の30分前に届くように。しかし、解読が遅れたために\nしかし、解読が遅れたために、大使は真珠湾攻撃の後に最後通牒を届けなければならなくなりました。",
      "title": "Tora! Tora! トラ！トラ！」では、日本政府は真珠湾攻撃の前に宣戦布告をしたかったが、結局攻撃後に宣戦布告をすることになった。なぜ、攻撃前に宣戦布告をすることが重要だったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "日本政府将最后通牒的14个部分转交给了日本驻华盛顿特区大使馆，他们将对最后通牒进行解码和抄写，并将其转交给日本政府。\n日本政府将最后通牒分成14个部分传送到华盛顿特区的日本大使馆，在那里他们将解码和抄写它，以便在偷袭珍珠港前30分钟送达。\n在对珍珠港的突然袭击前30分钟发出。但在\n但解码的延迟意味着大使不得不在珍珠港突袭前30分钟送达。",
      "title": "在Tora! 托拉! 中，日本政府想在袭击梨港之前发表他们的战争宣言，但最后却在袭击之后发表。为什么他们在进攻前发表宣言如此重要？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "日本政府將最後通牒的14個部分轉交給了日本駐華盛頓特區大使館，他們將對最後通牒進行解碼和抄寫，並將其轉交給日本政府。\n日本政府將最後通牒分成14個部分傳送到華盛頓特區的日本大使館，在那裏他們將解碼和抄寫它，以便在偷襲珍珠港前30分鐘送達。\n在對珍珠港的突然襲擊前30分鐘發出。但在\n但解碼的延遲意味着大使不得不在珍珠港突襲前30分鐘送達。",
      "title": "在Tora! 托拉! 中，日本政府想在襲擊梨港之前發表他們的戰爭宣言，但最後卻在襲擊之後發表。爲什麼他們在進攻前發表宣言如此重要？"
    }
  ],
  "title": "In Tora! Tora! Tora! the Japanese government wanted to deliver their declaration of war before the attack on Pear Harbor, but ended up delivering it after the attack. Why was it so important that they deliver the declaration before the attack?",
  "created_utc": 1620192574,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The Japanese government transmitted the ultimatum in 14 parts to the Japanese embassy in Washington, D.C. where they would decode and transcript it to be delivered 30 minutes before the surprise attack on Pearl Harbor. But a delay in the decoding meant the ambassador had to deliver it after the attack. The movie explained that they wanted to avoid violating the Geneva Conventions, was this really a significant reason?</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/AskHistorians/comments/n53j49/in_tora_tora_tora_the_japanese_government_wanted/",
  "subreddit": "AskHistorians",
  "id": "n53j49",
  "is_self": true,
  "media": null,
  "is_video": false
}