{
  "author": "Miserable_Painting12",
  "original_created_utc": 1644634500,
  "title": "Why do people get so upset about COVID vaccines and mask requirements, but not about other vaccines, or in-store pants/shoes/shirt requirements ?",
  "created_utc": 1644648704,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Serious respectful answers only please. Just wondering how people reason about these things. Specifically, there have been vaccine requirements to attend school, etc., for a long time, so why is the COVID vaccine requirement different (more upsetting)? And why are people upset about being required to wear something on their face but not upset about being required to wear something on other parts of their bodies?&lt;/p&gt;\n\n&lt;p&gt;Edit: thanks for your responses guys! I need to get some sleep but appreciate the discourse and look forward to more in the morning&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 112,
  "permalink": "/r/TooAfraidToAsk/comments/sqh2gq/why_do_people_get_so_upset_about_covid_vaccines/",
  "subreddit": "TooAfraidToAsk",
  "id": "sqh2gq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Serious respectful answers only please. Just wondering how people reason about\nthese things. Specifically, there have been vaccine requirements to attend\nschool, etc., for a long time, so why is the COVID vaccine requirement different\n(more upsetting)? And why are people upset about being required…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "真摯で丁寧な回答のみお願いします。ただ、人々がどのような理由で\nなどがあります。具体的に言うと、これまでにも通学に必要なワクチンとして\n学校などではずっと前から、COVIDワクチンの接種が義務付けられていますが、なぜ違うのでしょうか。\n(より動揺させる）のでしょうか？また、なぜ人々は要求されることに動揺するのでしょうか...。",
      "title": "COVIDワクチンやマスクの義務化には怒るのに、他のワクチンや店内でのズボン・靴・シャツの義務化には怒らないのはなぜ？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "只请认真尊重的回答。只是想知道人们是如何推理\n这些事情。具体来说，在很长一段时间内，上学等都有疫苗要求。\n学校等的疫苗要求已经有很长时间了，那么为什么COVID疫苗的要求会有所不同呢？\n(更令人不安）？为什么人们对被要求...",
      "title": "为什么人们对COVID疫苗和口罩要求如此不满，而对其他疫苗或店内裤子/鞋子/衬衫的要求却不以为然？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "只請認真尊重的回答。只是想知道人們是如何推理\n這些事情。具體來說，在很長一段時間內，上學等都有疫苗要求。\n學校等的疫苗要求已經有很長時間了，那麼爲什麼COVID疫苗的要求會有所不同呢？\n(更令人不安）？爲什麼人們對被要求...",
      "title": "爲什麼人們對COVID疫苗和口罩要求如此不滿，而對其他疫苗或店內褲子/鞋子/襯衫的要求卻不以爲然？"
    }
  ]
}