{
  "author": "IEatYourToast",
  "the_new_excerpt": "I've seen lots of stories about retail investors liquidating their portfolios to\nparticipate in the short squeeze of gamestop. This may have started as retail vs\nhedge fund, but by now, it's definitely retail and hedge funds vs hedge funds.\nThere is incredibly smart money, willing to trade…",
  "original_created_utc": 1612043025,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我见过很多散户投资者清算投资组合的故事，以达到以下目的\n参与Gamestop的短线挤压。这可能是一开始零售与\n对冲基金，但到现在，肯定是散户和对冲基金与对冲基金。\n有不可思议的聪明资金，愿意交易...",
      "title": "投资GME不保证免费赚钱"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我見過很多散戶投資者清算投資組合的故事，以達到以下目的\n參與Gamestop的短線擠壓。這可能是一開始零售與\n對沖基金，但到現在，肯定是散戶和對沖基金與對沖基金。\n有不可思議的聰明資金，願意交易...",
      "title": "投資GME不保證免費賺錢"
    }
  ],
  "title": "Investing in GME is not guaranteed free money",
  "created_utc": 1612083402,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve seen lots of stories about retail investors liquidating their portfolios to participate in the short squeeze of gamestop. This may have started as retail vs hedge fund, but by now, it&#39;s definitely retail and hedge funds vs hedge funds. There is incredibly smart money, willing to trade emotionlessly with perfect information and bots  in a battle of timing on both sides of this trade. The fact that it closed at $200/share on Thursday means hedge funds with near infinite money were thinking it&#39;s probably not worth participating in the short squeeze for more than $200/share. The pros didn&#39;t think it was guaranteed money at $200/share and the pros never turn down guaranteed free money. That should bring great caution to anyone still looking to get in. </p>\n\n<p>What will likely happen is it will end up selling for large amounts per share for a very short amount of time, and then very rapidly crater in price. Hedge funds on the long side of the trade will be able to execute their sells near perfectly, and retail traders will likely be bag holders after it craters who don&#39;t have access to bots for perfectly executed sells. Another very real possibility is there is no pop, remember, the hedge funds didn&#39;t buy up all the shares at $200 and just wait for it to climb to $250. They didn&#39;t think it was guaranteed to go to $250, which would be well under a pop level.</p>\n\n<p>This is just my opinion, but I&#39;d exercise great caution before touching this with a 10 foot pole at these prices, and definitely not with any meaningful amount of money. I&#39;d also strongly consider cashing some out if you are already in. Ask yourself how you&#39;d feel if you lost 90% of the current value of your  gme shares, as that&#39;s a very reasonably likely outcome for the non-pros, imo.</p>\n</div><!-- SC_ON -->",
  "score": 58,
  "permalink": "/r/stocks/comments/l8wiim/investing_in_gme_is_not_guaranteed_free_money/",
  "subreddit": "stocks",
  "id": "l8wiim",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518537983
}