{
  "author": "PizzaBuoy",
  "original_created_utc": 1654395919,
  "title": "Both Do Kwon &amp; Bernie Madoff lost “investors” 60 Billion Dollars",
  "created_utc": 1654468385,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In 2009 ,[TLDR]  Bernie Madoff lost investors 60billion usd in his ponzi scheme. The ponzi slowly unravelled during the Great Recession when investors started to want to withdraw funds, he wasnt able to keep up with the withdraw requests as he was now lacking funds. He eventually told his sons. They then reported it to the feds. He was then sentenced to 150 years in prison. &lt;/p&gt;\n\n&lt;p&gt;Whereas, in 2022, Do Kwon lost investors around 60billion (Luna and UST combined market value). And instead of answering questions/investigations or serving time. He created Luna 2.0 &lt;/p&gt;\n\n&lt;p&gt;It baffles me how he has the guts/audacity to launch Lunacy two point zero. &lt;/p&gt;\n\n&lt;p&gt;For old luna bag holders / new comers thinking on “investing” on lunacy 2.0, I will leave you with a quote to think about.&lt;/p&gt;\n\n&lt;p&gt;“Fool me once , shame on you. \n                          Fool me twice, shame on me”  &lt;/p&gt;\n\n&lt;p&gt;Now I wonder if Do will ever see jail time? As south korean authorities are conducting investigations with regards to the collapse of both ust and luna. Plus allegations that Terraform Labs is being used to move/launder money.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://archives.fbi.gov/archives/newyork/press-releases/2009/nyfo062909.htm\"&gt;Madoff 150 yr sentence fbi archives link&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://cryptoslate.com/terraform-labs-caught-moving-4-8m-through-shell-company/?amp=1\"&gt;Terraform Labs moving money through shell company article&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;IMO, Luna 2.0 is a spit on the face to the unlucky ones who got duped by the “stablecoin” and a somewhat “conservative” 20% apy combo. The 20% is what I call “Good , but not that good to NOT be true” the perfect bait&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 306,
  "permalink": "/r/CryptoCurrency/comments/v53ulp/both_do_kwon_bernie_madoff_lost_investors_60/",
  "subreddit": "CryptoCurrency",
  "id": "v53ulp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In 2009 ,[TLDR] Bernie Madoff lost investors 60billion usd in his ponzi scheme.\nThe ponzi slowly unravelled during the Great Recession when investors started to\nwant to withdraw funds, he wasnt able to keep up with the withdraw requests as\nhe was now lacking funds. He eventually told his sons. They…"
}