{
  "author": "StackerNoob",
  "original_created_utc": 1637232680,
  "title": "My experience of the Crypto.com prepaid card. 1 month in.",
  "created_utc": 1637253519,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>*Not a paid shill, just a dude who wants to give his honest opinion.</p>\n\n<p>I see a lot of questions on this sub regarding crypto credit/debit cards and the like. In some countries there are many different options, but here in the UK we are far more limited. </p>\n\n<p>But one of the main options we have is the crypto.com card. </p>\n\n<p>In terms of staking platforms, I first signed up for BlockFi earlier this year, and I was drawn in by the promise of an upcoming BlockFi credit card. I put my name on the waiting list and that was that, I have heard nothing in months. </p>\n\n<p>Tired of waiting for a way to be rewarded with crypto for spending fiat, I started looking elsewhere and came across crypto.com. You would be hard pressed to have missed them as an option given their aggressive marketing strategy, inserting their brand into every major sport, for example, Formula 1. To me, this was actually the most reassuring thing about CDC. It seems highly unlikely that any company would spend hundreds of millions of dollars on advertising abs sponsorship deals if they were planning anything like a rugpull.</p>\n\n<p>So, I went for it. I transferred some gains from ETH into CRO tokens. I bought enough to stake on the “earn” section of the platform while I assessed the options for a card (5000 CRO). That was earning me 6% return in the meantime.</p>\n\n<p>I honed in on two main options. Option 1 was the Ruby Red card. For ruby, you need to lock away £300 worth of CRO (value determined at the point of confirming application). This level card gets you 2% returns on every purchased paid in CRO. It also gets you full Spotify rebate, again paid in CRO. 2% back and free Spotify is a damn site better than my bank are giving me, so this seemed a good option.</p>\n\n<p>Option 2 was the Indigo Blue/Emerald Green card. This requires a locked stake of £3000 CRO, but you get everything the ruby card offers, plus free Netflix, 3% CRO rewards AND free access to fancy airport lounges all over the world. This was very tempting to me, but ultimately, the significant extra staking requirement did not seem worth it for me at this moment.</p>\n\n<p>So a ruby it was. Once my earn staking period ended (netting me an extra 75 CRO btw) I selected the Ruby card and began the process. This was a simple 3 step process and took about 2 minutes.</p>\n\n<p>My application was approved the next day and I was immediately able to use my card virtually for online purchases. </p>\n\n<p>However, because this is a prepaid card, you must transfer funds to it before you can spend anything. Now you can use the crypto you have on the platform if you wish, but I’m a holder, so fiat was my choice.</p>\n\n<p>Now this part wasn’t so easy. UK banks can be knobbish about crypto, and mine wouldn’t allow me to top up my card directly. But there is a simple work around. You can do simple bank transfers to a “fiat wallet” on crypto.com. This sort of fools the bank into thinking it’s just a simple online purchase. The details of the account to send the money to are hidden away a little in the app, but I got there eventually and sent a small test amount to the account. The app states the minimum transfer is £20, but I did not notice this and sent less than £2 instead. </p>\n\n<p>To my surprise, the next day I received an email stating that I now had £2 in my fiat wallet. Now, we can top up the card using fiat wallet funds. Lovely. I went on and made a small online payment and, after an initial extra security screen (normal with new cards and accounts) it went through. Nice. Within a minute, I got an email confirming my purchase, and checked my app and had been given my CRO reward already.</p>\n\n<p>However, I wanted to use the physical card for out and about purchases. I was expecting to wait many weeks but again, I was surprised when just 7 days after applying, my card dropped through my letterbox. </p>\n\n<p>The card was really nice, much heavier than I was expecting (it really is all metal) and I happily trotted off to the shop. I picked up a sandwich and lucozade and went to the cashier and proudly brandished my card (I want people to notice it so I can play my part in driving adoption) but she didn’t bat an eyelid. However, when I went to use the card contactlessly, the card was declined. I was gutted, but then remembered that this is a new card, so we need to use the pin code. I logged into the app, went to the card section and revealed my pin. I inserted the card, entered the pin and boom, I was now in possession of a cheese plowmans and an orange lucozade. I walked home and  when I got there checked my app. The CRO reward was already paid.</p>\n\n<p>Ever since, I have been topping up my card and use it for every day spending as much as possible, including grocery shopping, fuel, takeaways and down the pub. With the rewards and the CRO pump, I have earned more in a month than I have in 5 years with my current account.</p>\n\n<p>In summary, the CDC card is easy to use, gives good rewards and, most importantly, looks dope. I can only see good things for the future of CDC. I’m bullish</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/CryptoCurrency/comments/qwn7hp/my_experience_of_the_cryptocom_prepaid_card_1/",
  "subreddit": "CryptoCurrency",
  "id": "qwn7hp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "*Not a paid shill, just a dude who wants to give his honest opinion.\n\nI see a lot of questions on this sub regarding crypto credit/debit cards and the\nlike. In some countries there are many different options, but here in the UK we\nare far more limited.\n\nBut one of the main options we have is the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "*お金をもらっているわけではなく、正直な意見を述べたいだけの男です。\n\nこのサブサイトでは、暗号化されたクレジットカードやデビットカードなどに関する質問が多いですね。\nのようなものです。一部の国では様々な選択肢がありますが、ここ英国では非常に限られています。\nははるかに限られています。\n\nしかし、私たちが持っている主な選択肢の1つは...",
      "title": "Crypto.comプリペイドカードの体験談。1ヶ月間"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "*不是有偿推销，只是一个想提供真实意见的人。\n\n我在这个网站上看到很多关于加密货币信用卡/借记卡等的问题。\n诸如此类的问题。在一些国家，有许多不同的选择，但在英国我们\n则受到很大限制。\n\n但是，我们的主要选择之一是...",
      "title": "我对Crypto.com预付卡的体验。1个月了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "*不是有償推銷，只是一個想提供真實意見的人。\n\n我在這個網站上看到很多關於加密貨幣信用卡/借記卡等的問題。\n諸如此類的問題。在一些國家，有許多不同的選擇，但在英國我們\n則受到很大限制。\n\n但是，我們的主要選擇之一是...",
      "title": "我對Crypto.com預付卡的體驗。1個月了。"
    }
  ]
}