{
  "author": "fakeplasticdaydream",
  "original_created_utc": 1656676419,
  "title": "Is American Democracy truly on the brink of collapse?",
  "created_utc": 1656696741,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have lived in America my whole life. I know our history, both the good and the bad. One thing that I always was taught was how strong our democracy was. Our democracy is what made us great. I cant help but feel like when a substantial portion of the country believes in a lie about an election with zero evidence, we are in trouble. I cant help but feel like this extremely radical supreme court is going to allow state legislatures to have complete control over elections. I cant help but feel like republican voters will go along with all of this because they have been so programmed to defeat the democrats at any cost. It makes me think there HAS to be something going on behind the curtain to prevent this. This is the United States Government. Does Biden/Garland/dems in congress have a plan to save our democracy? Am I being irrational?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/TooAfraidToAsk/comments/voz0ig/is_american_democracy_truly_on_the_brink_of/",
  "subreddit": "TooAfraidToAsk",
  "id": "voz0ig",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I have lived in America my whole life. I know our history, both the good and the\nbad. One thing that I always was taught was how strong our democracy was. Our\ndemocracy is what made us great. I cant help but feel like when a substantial\nportion of the country believes in a lie about an election…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はずっとアメリカに住んでいます。私たちの歴史は、良いことも悪いことも知っています。\n良いことも悪いことも。私がいつも教えられてきたことのひとつは、私たちの民主主義がいかに強いかということです。私たちの\n民主主義は私たちを偉大にしたものです。私は、国民のかなりの部分があることを信じているとき、そのような気がしてなりません。\n国のかなりの部分が選挙に関する嘘を信じている場合...",
      "title": "アメリカン・デモクラシーは本当に崩壊の危機に瀕しているのだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在美国生活了一辈子。我知道我们的历史，包括好的和坏的\n坏。我一直被教导的一件事是我们的民主是多么强大。我们的\n民主是使我们伟大的原因。我不禁觉得，当相当一部分人\n国家的很大一部分人相信关于选举的谎言......",
      "title": "美国的民主是否真的处于崩溃的边缘？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在美國生活了一輩子。我知道我們的歷史，包括好的和壞的\n壞。我一直被教導的一件事是我們的民主是多麼強大。我們的\n民主是使我們偉大的原因。我不禁覺得，當相當一部分人\n國家的很大一部分人相信關於選舉的謊言......",
      "title": "美國的民主是否真的處於崩潰的邊緣？"
    }
  ]
}