{
  "author": "Major_Bandicoot_3239",
  "original_created_utc": 1639575803,
  "title": "The last time the Federal Reserve embarked on a path of tightening monetary policy, following a period of easing, in 2015, the price of Bitcoin was $465,",
  "created_utc": 1639593625,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Title says it all. For everyone freaking out about the fed meeting today, just remember this isn’t the first time in Bitcoin’ history that this has happen. The last time was in 2015 and went into 2018. During that time period we saw Bitcoin go from $465 to $20,000. &lt;/p&gt;\n\n&lt;p&gt;What you are seeing right now is purely FUD, don’t buy into it. This won’t crush crypto. If anything, it should be a bullish sign for crypto. The fed is finally admitting that inflation is a serious problem. It is no longer transitory and it has run significantly hotter than the Fed projected.&lt;/p&gt;\n\n&lt;p&gt;Also, the news is already baked in. Unless they do something insane, we already know that they are going to likely decrease bond purchases earlier and possibly hike rates earlier. This Fed is very market friendly, always have been. Their biggest fear is shocking the market which I why I believe they will change policy less than people are forecasting.&lt;/p&gt;\n\n&lt;p&gt;If the instructions are unclear, I’ll spell it out for you. Buy.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 221,
  "permalink": "/r/Bitcoin/comments/rgzejt/the_last_time_the_federal_reserve_embarked_on_a/",
  "subreddit": "Bitcoin",
  "id": "rgzejt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Title says it all. For everyone freaking out about the fed meeting today, just\nremember this isn’t the first time in Bitcoin’ history that this has happen. The\nlast time was in 2015 and went into 2018. During that time period we saw Bitcoin\ngo from $465 to $20,000.\n\nWhat you are seeing right now is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルがすべてを物語っています。今日のFRB（連邦準備制度理事会）の会合にビクビクしている皆さん、ただただ\nビットコインの歴史上、このようなことは初めてではないことを覚えておいてください。以前は\n前回は2015年で、2018年に入りました。その間に私たちはビットコインを見ました\nは465ドルから2万ドルへ。\n\n今見ているのは...",
      "title": "前回、米連邦準備制度理事会（FRB）が緩和の時期を経て、金融引き締め路線に乗り出した2015年、ビットコインの価格は465ドルだった。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "标题说明了一切。对于每个为今天的美联储会议感到恐慌的人来说，只需\n记住这不是比特币历史上第一次发生这种情况。上一次\n上一次是在2015年，一直到2018年。在那段时间里，我们看到比特币\n从465美元涨到了20000美元。\n\n你现在看到的是...",
      "title": "上一次美联储在宽松时期之后走上收紧货币政策的道路是在2015年，当时比特币的价格是465美元。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "標題說明了一切。對於每個爲今天的美聯儲會議感到恐慌的人來說，只需\n記住這不是比特幣歷史上第一次發生這種情況。上一次\n上一次是在2015年，一直到2018年。在那段時間裏，我們看到比特幣\n從465美元漲到了20000美元。\n\n你現在看到的是...",
      "title": "上一次美聯儲在寬鬆時期之後走上收緊貨幣政策的道路是在2015年，當時比特幣的價格是465美元。"
    }
  ]
}