{
  "author": "shotsbyniel",
  "the_new_excerpt": "Honestly, let's us ETH as an example, hop on coingecko and look at the graph for\nETH, but this time, look at the 1y range and switch to logarithmic mode, it\nshows the graph scaled by percentage of increases, instead of just the raw\nincrease. There's a huge difference between going from 1 to 100 and…",
  "original_created_utc": 1620000359,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "正直なところ、ETHを例にとると、coingeckoに乗って、ETHのグラフを見てみましょう。\nETHのグラフを見てみましょう。今回は1年の範囲を見て、対数モードに切り替えてみましょう。\nグラフは生の増加だけではなく、増加の割合でスケールされて表示されます。\n上昇率 1から100になるのとでは大きな違いがあります。",
      "title": "すべての新規参入者のために - 小さなディップを待って大きな安定したコインを買おうとしている人はやめておきましょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "老实说，让我们以ETH为例，跳上coingecko，看一下ETH的图表。\nETH，但这一次，看的是1年的范围，并切换到对数模式，它\n它显示的是按百分比增长的图表，而不仅仅是原始的\n增长。从1到100有很大的区别，而...",
      "title": "对于所有的新人--如果你在等待小的跌势来购买大的稳定的硬币，不要。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "老實說，讓我們以ETH爲例，跳上coingecko，看一下ETH的圖表。\nETH，但這一次，看的是1年的範圍，並切換到對數模式，它\n它顯示的是按百分比增長的圖表，而不僅僅是原始的\n增長。從1到100有很大的區別，而...",
      "title": "對於所有的新人--如果你在等待小的跌勢來購買大的穩定的硬幣，不要。"
    }
  ],
  "title": "For all newcomers - If you're waiting for small dips to buy big stable coins, don't.",
  "created_utc": 1620041718,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Honestly, let&#39;s us ETH as an example, hop on coingecko and look at the graph for ETH, but this time, look at the 1y range and switch to logarithmic mode, it shows the graph scaled by percentage of increases, instead of just the raw increase. There&#39;s a huge difference between going from 1 to 100 and 5000 to 5100, but linear graphs don&#39;t represent it well. When ETH reaches 10k, you won&#39;t care if you invested in it at 2.9k or 2.7k. So save yourself the worry and sleepless nights of trying to find the right time to invest, and just start doing it. Your future self will thank you and you&#39;ll sleep better.</p>\n\n<p>And don&#39;t keep looking at the prices every 5 minutes. Look at news about the progress of different projects around it.</p>\n\n<p>Reposted because modbot removed the original for having ETH on the title.</p>\n\n<p>Disclaimer:<br/>\nNot financial advice, do whatever you want.</p>\n</div><!-- SC_ON -->",
  "score": 214,
  "permalink": "/r/CryptoCurrency/comments/n3jdvd/for_all_newcomers_if_youre_waiting_for_small_dips/",
  "subreddit": "CryptoCurrency",
  "id": "n3jdvd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380962704
}