{
  "author": "Elmagoencapuchado",
  "original_created_utc": 1642643450,
  "title": "I asked a guy out and he didn't seem to believe me. Is this a red flag?",
  "created_utc": 1642656521,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So there&amp;#39;s a guy(20-ish M) at my(21F) college that I like. He&amp;#39;s smart, nerdy, and funny at times. We have a class together, but we don&amp;#39;t really talk a lot so I know it&amp;#39;s unlikely that he asks me out someday. So I said &amp;quot;Fuck it, I&amp;#39;ll take iniciative&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;So I went to him when he was reading alone. We said hi to eachother, I asked him if he was busy, he said he wasn&amp;#39;t so I sat down beside him. After doing a polite short talk, the conversation went like this:&lt;/p&gt;\n\n&lt;p&gt;Me: So, uh, I don&amp;#39;t how to say this so I&amp;#39;m just gonna say it. I think you&amp;#39;re cute and that we should go out sometime.&lt;/p&gt;\n\n&lt;p&gt;Him: (After being silent for a second) wait, what?&lt;/p&gt;\n\n&lt;p&gt;Me: I said that we should go out sometime, like on a date, if you&amp;#39;re down to it.&lt;/p&gt;\n\n&lt;p&gt;Him: (another pause, this time staring at me) are you playing a prank on me? That ain&amp;#39;t funny, mate.&lt;/p&gt;\n\n&lt;p&gt;Me: (A bit confused) No. I&amp;#39;m serious.&lt;/p&gt;\n\n&lt;p&gt;Him: (He starts looking around)&lt;/p&gt;\n\n&lt;p&gt;Me: (more confused)&lt;/p&gt;\n\n&lt;p&gt;Him: You seen Encanto yet?&lt;/p&gt;\n\n&lt;p&gt;Me: Uh... No (I have, but at this point he took me off guard)&lt;/p&gt;\n\n&lt;p&gt;Him: Cool cool (Now glancing at my phone) how does saturday sound?&lt;/p&gt;\n\n&lt;p&gt;Me: Sounds good (I was starting to feel creepy vibes, so I stood up and started to walk away) at 6?&lt;/p&gt;\n\n&lt;p&gt;Him: Yeah, see you there&lt;/p&gt;\n\n&lt;p&gt;I kinda want to see where this goes, but after that conversation I feel like there&amp;#39;s something off with him. I literally told him I like him and he looked at me like he didn&amp;#39;t believe me.&lt;/p&gt;\n\n&lt;p&gt;Is this a red flag?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 188,
  "permalink": "/r/TooAfraidToAsk/comments/s86xdt/i_asked_a_guy_out_and_he_didnt_seem_to_believe_me/",
  "subreddit": "TooAfraidToAsk",
  "id": "s86xdt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So there's a guy(20-ish M) at my(21F) college that I like. He's smart, nerdy,\nand funny at times. We have a class together, but we don't really talk a lot so\nI know it's unlikely that he asks me out someday. So I said \"Fuck it, I'll take\niniciative\".\n\nSo I went to him when he was reading alone. We…"
}