{
  "author": "nthgen",
  "original_created_utc": 1629741415,
  "title": "Today, one user spammed 500+ (and counting) comments in the daily thread and there's still 6 hours left!",
  "created_utc": 1629747041,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"/u/OldEntertainment9570\">u/OldEntertainment9570</a> has spammed the daily thread today more than 500 times in 16 hours.</p>\n\n<p>They are on pace to get 800 comments in a single 24 hour period.</p>\n\n<p>These comments represent more than 1% of all comments in the daily thread for August 23rd, 2021.</p>\n\n<p>If all 10k users online did the same, that would put the daily thread at 8,000,000 comments!</p>\n\n<p>I voted no on the last daily poll to reduce the 2x karma multiplier for comments on the daily thread and I stand by that decision. However, something has to be done about this.</p>\n\n<p>I get everyone wants moons (myself included) but this is getting out of control.</p>\n\n<p>I think that just for the daily thread, we need a comment limit per user. What that limit is, or how it works I don&#39;t know, but we need something.</p>\n\n<p>Maybe it&#39;s more like:<br/>\nIF you comment in the daily 400 times, you are restricted in the following daily to 100 comments. </p>\n\n<p>What does everyone think? We have to do something, this is getting ridiculous. This user even replied to me saying:  </p>\n\n<p>&quot;I&#39;m new to crypto, I&#39;m just trying to learn.&quot;</p>\n\n<p>Meanwhile, the majority of the comments are a few words and have nothing to do with &quot;learning about crypto.&quot;</p>\n\n<p>Mods, if you&#39;re listening, help!!!!!!!!!</p>\n\n<p>Rant over.</p>\n\n<p>EDIT: this user is NOT a bot.</p>\n\n<p>EDIT 2: most of the moons I earned are from when the ratio was 10 moons for 1 karma. To compare, I&#39;ve posted in today&#39;s daily 36 times.</p>\n</div><!-- SC_ON -->",
  "score": 266,
  "permalink": "/r/CryptoCurrency/comments/pa559e/today_one_user_spammed_500_and_counting_comments/",
  "subreddit": "CryptoCurrency",
  "id": "pa559e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "u/OldEntertainment9570 [/u/OldEntertainment9570] has spammed the daily thread\ntoday more than 500 times in 16 hours.\n\nThey are on pace to get 800 comments in a single 24 hour period.\n\nThese comments represent more than 1% of all comments in the daily thread for\nAugust 23rd, 2021.\n\nIf all 10k users…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "u/OldEntertainment9570 [/u/OldEntertainment9570]は、毎日のスレッドをスパムしています。\n今日は16時間で500回以上のコメントが寄せられました。\n\n24時間のうちに800件のコメントがつくペースだという。\n\nこれらのコメントは、2021年8月23日のデイリースレッドの全コメントの1％以上を占めています。\n2021年8月23日です。\n\nもし、10Kのユーザー全員が...",
      "title": "今日、1人のユーザーが毎日のスレッドで500以上（数え）のコメントをスパムしましたが、まだ6時間残っています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "u/OldEntertainment9570 [/u/OldEntertainment9570]在16个小时内对每日话题进行了垃圾处理\n今天在16个小时内超过了500次。\n\n他们有望在一个24小时内获得800条评论。\n\n这些评论占每日话题中所有评论的1%以上。\n2021年8月23日。\n\n如果所有10k用户...",
      "title": "今天，有一个用户在每天的主题里发了500多条（还在增加）评论，而现在还剩下6个小时的时间"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "u/OldEntertainment9570 [/u/OldEntertainment9570]在16個小時內對每日話題進行了垃圾處理\n今天在16個小時內超過了500次。\n\n他們有望在一個24小時內獲得800條評論。\n\n這些評論佔每日話題中所有評論的1%以上。\n2021年8月23日。\n\n如果所有10k用戶...",
      "title": "今天，有一個用戶在每天的主題裏發了500多條（還在增加）評論，而現在還剩下6個小時的時間"
    }
  ]
}