{
  "author": "nobjos",
  "the_new_excerpt": "This post is in continuation of a series of posts I made in the previous weeks.\nThe response I received was amazing and a lot of you were asking for continued\nweekly updates. I have also added the Week-on-Week stock price change due to\npopular requests.\n\nOverall, it has been an amazing week for…",
  "original_created_utc": 1622986748,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今回の投稿は、前の週に行った一連の投稿の続きです。\nいただいた反響はとても大きく、多くの方から継続して毎週更新してほしいという声をいただきました。\n毎週更新してほしいという声を多くいただきました。ご要望にお応えして、「週ごとの株価変動」も追加しました。\n好評でした。\n\n全体的に見て、今週は素晴らしい週でした...",
      "title": "RedditやTwitterでの銘柄の言及やセンチメントを追跡するプログラムを作ってみた! 今週最も話題になった銘柄と、成長率の高い銘柄を紹介します"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这篇文章是我在前几周发表的一系列文章的延续。\n我收到的反应是惊人的，很多人要求继续每周更新。\n每周更新。由于大众的要求，我还增加了每周的股票价格变化。\n大众的要求。\n\n总的来说，这是一个令人惊讶的一周，因为...",
      "title": "我建立了一个程序，跟踪在Reddit和Twitter上提到的股票和情绪! 本周讨论最多和增长最快的股票!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這篇文章是我在前幾周發表的一系列文章的延續。\n我收到的反應是驚人的，很多人要求繼續每週更新。\n每週更新。由於大衆的要求，我還增加了每週的股票價格變化。\n大衆的要求。\n\n總的來說，這是一個令人驚訝的一週，因爲...",
      "title": "我建立了一個程序，跟蹤在Reddit和Twitter上提到的股票和情緒! 本週討論最多和增長最快的股票!"
    }
  ],
  "title": "I built a program that tracks mentions and sentiment of stocks across Reddit and Twitter! This week's most discussed and top growing stocks!",
  "created_utc": 1623006228,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This post is in continuation of a series of posts I made in the previous weeks. The response I received was amazing and a lot of you were asking for continued weekly updates. I have also added the Week-on-Week stock price change due to popular requests. </p>\n\n<p>Overall, it has been an amazing week for investors in general and all the top growing stocks that <a href=\"https://www.reddit.com/r/wallstreetbets/comments/noc6r0/i_built_a_program_that_tracks_mentions_and/\">I shared here last week</a> have ended in green with an average return of 11.7%. So, without further ado, let&#39;s dive into this week’s list! </p>\n\n<p><strong>Most Discussed Stocks of the Week</strong> </p>\n\n<p><a href=\"https://preview.redd.it/per8x892fn371.png?width=1039&amp;format=png&amp;auto=webp&amp;s=8d457b0954852cb8d3abacf10341d7dadd99e3d3\">https://preview.redd.it/per8x892fn371.png?width=1039&amp;format=png&amp;auto=webp&amp;s=8d457b0954852cb8d3abacf10341d7dadd99e3d3</a></p>\n\n<p>Both AMC and BB individually generated more discussion than the other 8 put together! This can be attributed to the possibility of the next squeeze and also the rallying stock price. Weed stocks also made a double entry into the top 10 list with SNDL coming in 4th and TLRY 5th (we will discuss why in the next section). Investors were most bullish about Tilray and Nokia’s prospects as reflected by the sentiment! Another interesting observation is that it has been a rough week for Tesla with it being the only stock in the list that ended in the red.</p>\n\n<p><strong>Top Growing Stocks of the Week</strong></p>\n\n<p><a href=\"https://preview.redd.it/ov3zes4cfn371.png?width=1208&amp;format=png&amp;auto=webp&amp;s=ca5d580ccfea58c5659a40b50afec8b78da53666\">https://preview.redd.it/ov3zes4cfn371.png?width=1208&amp;format=png&amp;auto=webp&amp;s=ca5d580ccfea58c5659a40b50afec8b78da53666</a></p>\n\n<p>Above is the list of stocks that have exploded in the number of mentions throughout social media. Almost all the stocks increased in chatter due to the rally of meme stocks and not due to any fundamental news</p>\n\n<p><strong>BlackBerry($BB):</strong> No points for guessing the top growing stock of the week. BlackBerry was also present in the <a href=\"https://www.reddit.com/r/wallstreetbets/comments/noc6r0/i_built_a_program_that_tracks_mentions_and/\">last week’s list</a> and the stock has been running up almost 80% in the last six weeks. The discussions were predominantly driven around whether BB would be the next short squeeze play. Even though the company has made some significant strides over the last year (Collaboration with AWS being an example), there are no specific news that’s driving the current rally.</p>\n\n<p><strong>Clean Energy Fuels($CLNE):</strong> There isn’t any new fundamental news out of the company for the current rally but the discussion exploded in Reddit and the stock gained as much as 20% on Thursday. The stock experienced a quadrupling of the average daily volume as Reddit investors piled on to the stock. The company is still trading at a healthy 17.6% increase over last week’s closing price.</p>\n\n<p><strong>Workhorse Group($WKHS):</strong> Even though the company did not have a good month in May with them disappointing the investors with their first-quarter results (the company only delivered six electric cargo trucks). But the shares of the company have rocketed more than 40% in June. The discussion volume as well as the trading volume has been on a consistent rise over the past week.  </p>\n\n<p><strong>Nokia($NOK):</strong> Nokia’s current rally is primarily driven by optimism over its back-to-back 5G network deployment wins with multiple telecom operators such as Net4Mobility, DITO Telecommunity Corporation, T-Mobile, and Optus. The company has also resolved a long-drawn patent licensing dispute with Daimler and has been strengthening its financials by generating strong cash flows. Investor sentiment has also been extremely bullish as we can see from the trends.</p>\n\n<p><strong>Sundial Growers($SNDL):</strong> Weed stocks are mainly moving due to a mix of fundamental news and retail trading interest. SNDL rose almost 30% this week before dropping down. The marijuana industry is consolidating and a spate of deals were announced this week. Adding to this, there has been progress in legalization efforts in the US. Tilray(TLRY) has also been on the run with the stock price increasing 12% and the chatter growing by 300% this week.</p>\n\n<p><strong>Honorable Mentions:</strong> AMC Entertainment($AMC) chatter grew by 189% (which is massive considering that the stock was already the <a href=\"https://www.reddit.com/r/wallstreetbets/comments/noc6r0/i_built_a_program_that_tracks_mentions_and/\">most discussed stock last week</a>) and Clover Health ($CLOV) discussions increased by 255% but were not high enough to make the top 5 list.</p>\n\n<p>Thank you for reading! </p>\n\n<p><em>Disclaimer: I am not a financial advisor.</em></p>\n</div><!-- SC_ON -->",
  "score": 2447,
  "permalink": "/r/wallstreetbets/comments/ntlyqy/i_built_a_program_that_tracks_mentions_and/",
  "subreddit": "wallstreetbets",
  "id": "ntlyqy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404892700
}