{
  "author": "Silas_Of_The_Lambs",
  "original_created_utc": 1641692338,
  "title": "In catch-22, Major Major's father makes a living by not growing alfalfa. He is said to be paid large sums by the government for the Alfalfa he does not grow. Is something real being parodied there?",
  "created_utc": 1641707748,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Or, in other words, was there any genuine US government policy of the 1930s that would result in anybody receiving monetary compensation for refraining from growing a crop? And was it really lucrative enough that somebody would do what the character is described doing, and buying up as many acres as he can lay his hands on in order to not grow Alfalfa on those too?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 108,
  "permalink": "/r/AskHistorians/comments/rzg2yh/in_catch22_major_majors_father_makes_a_living_by/",
  "subreddit": "AskHistorians",
  "id": "rzg2yh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Or, in other words, was there any genuine US government policy of the 1930s that\nwould result in anybody receiving monetary compensation for refraining from\ngrowing a crop? And was it really lucrative enough that somebody would do what\nthe character is described doing, and buying up as many acres…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "あるいは、1930年代のアメリカ政府の政策に、本物のものがあったのだろうか。\nを控えることで、金銭的な補償を受けることになる。\n作物を育てること？そして、そのようなことをするほど、本当に儲かることだったのだろうか。\nこのキャラクターは、何エーカーでも買い占める...と描写されています。",
      "title": "catch-22』では、少佐の父親がアルファルファを栽培しないことで生計を立てている。彼は、作らないアルファルファの分、政府から多額の報酬をもらっているという。そこでは、何か現実的なことがパロディ化されているのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "或者，换句话说，美国政府在1930年代是否有任何真正的政策\n会导致任何人因不种植大麻而获得金钱补偿\n种庄稼？而且，这是否真的有利可图，以至于有人会做出以下行为？\n角色所描述的那样，买下尽可能多的田地......。",
      "title": "在catch-22中，少校的父亲以不种植苜蓿为生。据说他不种苜蓿，政府会付给他一大笔钱。那里是否有真实的东西被模仿？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "或者，換句話說，美國政府在1930年代是否有任何真正的政策\n會導致任何人因不種植大麻而獲得金錢補償\n種莊稼？而且，這是否真的有利可圖，以至於有人會做出以下行爲？\n角色所描述的那樣，買下儘可能多的田地......。",
      "title": "在catch-22中，少校的父親以不種植苜蓿爲生。據說他不種苜蓿，政府會付給他一大筆錢。那裏是否有真實的東西被模仿？"
    }
  ]
}