{
  "author": "hot4hotz",
  "the_new_excerpt": "I've started doing my due diligence on stock investing, and I'm putting time to\nread over quarterly reports from companies. At the moment, I'm using both the\ncompany's website and Yahoo financials to look at the stock's quarterly and\nannual report.\n\nHowever, sometimes I notice that 1) companies…",
  "original_created_utc": 1613691065,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我已经开始对股票投资进行尽职调查，我把时间放在了\n翻阅公司的季报。目前，我在用这两个\n公司的网站和雅虎的财务数据，看看该股的季度和。\n年报。\n\n但是，有时我注意到，1）公司... ...",
      "title": "更有效地阅读季度报告"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我已經開始對股票投資進行盡職調查，我把時間放在了\n翻閱公司的季報。目前，我在用這兩個\n公司的網站和雅虎的財務數據，看看該股的季度和。\n年報。\n\n但是，有時我注意到，1）公司... ...",
      "title": "更有效地閱讀季度報告"
    }
  ],
  "title": "Reading Quarterly Reports More Efficiently",
  "created_utc": 1613777122,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve started doing my due diligence on stock investing, and I&#39;m putting time to read over quarterly reports from companies. At the moment, I&#39;m using both the company&#39;s website and Yahoo financials to look at the stock&#39;s quarterly and annual report.</p>\n\n<p>However, sometimes I notice that 1) companies don&#39;t post their most recent quarterly reports and 2) Yahoo sometimes (very rarely but still happens) doesn&#39;t match the numbers on the company&#39;s quarterly report. Maybe it&#39;s because I can&#39;t math, but even in the following quarterly report, it&#39;ll match the numbers exactly. </p>\n\n<p>That being said, is there a paid premium service that will give you access to most companies and their quarterly reports? I&#39;ve been trying to find some on google but nothing matches. Thanks in advance!</p>\n</div><!-- SC_ON -->",
  "score": 42,
  "permalink": "/r/investing/comments/ln0ltc/reading_quarterly_reports_more_efficiently/",
  "subreddit": "investing",
  "id": "ln0ltc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332881979
}