{
  "author": "IndubitablyPedantic",
  "original_created_utc": 1641903328,
  "title": "Why don't they teach Canadian Geography or History in the US school system?",
  "created_utc": 1641960647,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A Lot of the guys I play with online from the states and a select few I&amp;#39;ve met that are up here for hunting say they only teach about Canadas involvement in WW2 and that&amp;#39;s it.&lt;/p&gt;\n\n&lt;p&gt;None of them could name a province and frankly didn&amp;#39;t know about them. We&amp;#39;re taught about the states and their capital cities etc.. including history, when they became a country and so forth. So why no info on the neighbour&amp;#39;s to the north? Is this normal or no?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/s1bkrk/why_dont_they_teach_canadian_geography_or_history/",
  "subreddit": "NoStupidQuestions",
  "id": "s1bkrk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "A Lot of the guys I play with online from the states and a select few I've met\nthat are up here for hunting say they only teach about Canadas involvement in\nWW2 and that's it.\n\nNone of them could name a province and frankly didn't know about them. We're\ntaught about the states and their capital…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "オンラインで一緒にプレイしている多くのアメリカ人、そして私が会った一部の人たちは\n狩りに来ている人たちは、カナダの関与についてしか教えないと言います。\n第二次世界大戦とそれ以外です。\n\n州名を言える人は皆無で、正直言って知りませんでした。私たちは\n州とその首都について教わった...。",
      "title": "なぜアメリカの学校では、カナダの地理や歴史を教えないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "很多和我一起在网上玩的来自美国的人，以及我遇到的少数人\n他们说，他们只教加拿大参与二战的情况，仅此而已。\n二战，仅此而已。\n\n他们中没有人能够说出一个省的名字，坦率地说他们不知道。我们\n我们被告知各州和它们的首都......",
      "title": "为什么美国的学校系统不教加拿大的地理或历史？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "很多和我一起在網上玩的來自美國的人，以及我遇到的少數人\n他們說，他們只教加拿大參與二戰的情況，僅此而已。\n二戰，僅此而已。\n\n他們中沒有人能夠說出一個省的名字，坦率地說他們不知道。我們\n我們被告知各州和它們的首都......",
      "title": "爲什麼美國的學校系統不教加拿大的地理或歷史？"
    }
  ]
}