{
  "author": "SlappyDes",
  "original_created_utc": 1630846744,
  "title": "Should I leave a negative review exposing the toxic behavior of a tech company I used to work for even after being threatened by one of their contractors yesterday?",
  "created_utc": 1630859150,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>To keep it short and simple I used to work for a tech company started around November of 2020 and left around late January of this year  because of the way I was treated. Some of the things they said and did to me.</p>\n\n<p>-  I do not drink they would constantly tell me that I should drink and they would try to force me to drink</p>\n\n<p>-Went out to eat and they ordered me a drink I did not ask for and forced me to drink it then told me they ask the bartender to put alcohol in it and the bartender played a long and I freaked out (anxiety, they knew I had it) and they told me to don&#39;t embarrass them like that again.</p>\n\n<p>-They would constantly make fun of customers behind their back and they kept trying to hook me up with some of them</p>\n\n<p>-They would do the same to me but they would say &quot;They are just joking.&quot; They would make fun of how I look and dress and how I act and I do not care at all but when they would say something to me and I would not say anything  they would tell me I should &quot;fight back and say something back.&quot; Sometimes I did join in but over all I told them I would rather just listen because I do not care about their &quot;jokes&quot; at all. They did make fun of each other too by calling them names and saying stuff about them and would laugh it off, whatever.</p>\n\n<p>-They gave a girl my number who I later found out to be 16 ( I am 24)</p>\n\n<p>-I was working two jobs at the time and one of my co worker from my other job came in to get their phone fix and apparently one of them told them told her that I need to get laid and that she should &quot;Give me some pussy.&quot;</p>\n\n<p>- Kept saying I need to get drunk and I should go out to parties and get laid</p>\n\n<p>- Would get me to bring them food and drinks (alcohol) , they would pay most of the time</p>\n\n<p>-Late paychecks</p>\n\n<p>Eventually after around 3 or so months I got sick and tired of them and stop showing up basically quit. I didn&#39;t get my last pay check because of anxiety and the owner of the building who was the head manager, (they didn&#39;t really explain it that well to me.  there is somebody higher up than him but I never met the guy) said that the last paycheck has to be written. I didn&#39;t get it until 5 months later when I was telling one of my co workers at my other job about the place. She told me I need to go get that paycheck and I shouldn&#39;t not work for free.  I grew some balls and said screw it and tried to contact the head manager (Going to call him E from now on) about getting my paycheck. At first E said that I could come in anytime and get it and when I schedule to go get it he wasn&#39;t at the building and told me to come by another time. When I contacted him again I got no response and when I went to the tech place to pick it up his car wasn&#39;t there and told me to come by another time. I didn&#39;t get it until two weeks after that and here is the stupid part. Basically he wanted me to sign some stuff because I was terminating my contract and I read through it nothing stood out so I signed it. It was just explaining my termination. No after 20 minutes when he said that the computer was being slowhe will just send me my paycheck through Venmo (which is how I was getting my checks). Whatever, anyway while this was happening the person that mainly makes fun of customers and the one that told my co worker that I should get laid was constantly  making fun of me and tell me how we tried to improve my life by getting me to do things (party, drink, get laid ect) but apparently I was being slow and not picking up anything they was trying to teach me. Going to call him C. Note that he also got mad at me for not checking up on them after I left, and that I was being selfish by doing that. I told him that it works both ways and he said no you should check up on us.</p>\n\n<p>So after E told me he would send my paycheck through Venmo I said my goodbyes and C was still making fun of me and I jokingly told him &quot;Well C, you know I always thought you were a dick.&quot; (apparently this was a mistake which I will get to later)  I said bye, they said bye and I left it at that.</p>\n\n<p>So fast forward until yesterday I did do some computer repair on the side for my friends and for one of them I had to replace the top cover of his laptop screen. There was a piece that I could not get out and out of fear of breaking it because I wasn&#39;t sure if I needed to heat that piece up to remove it or if I could just try to pry it out I decided to take it to a tech place to get it looked at. I do understand that I could&#39;ve went to any other tech place and got it look at but this one was close by and I was heading out of town too so I figure what ever I would just go see them check up on them since C was complaining at me last time I was there, pay them and leave.  Oh boy was I wrong.</p>\n\n<p>So I got there around the time they open on Saturdays which was 10 and one of them came to open the shop. I asked her to take a look and this piece I am trying to get out of a laptop cover and she said it looked like I could just get some tweezers and get it out unless I want to wait on C and see what he said. C mainly dealt with computer stuff so I said sure I will wait for him. I left and came back.  He came around 30-40 minutes later and I told him to take a look and he said after he deals with this customer he will look at it. He then asked me how I been and if I am gonna go beg to get my other job back (I left my other job at this time) and I told him no. After he was done with that customer he got that piece out and handed me back the laptop cover and not the piece. He kept the piece and then ask &quot;So how much are you going to pay me for the work?&quot; I ask him how much does he want and I will just pay what ever. He could&#39;ve just told me a price so I could be on my way but he wanted to mess with me instead, this is how our convo went from what I remembered.</p>\n\n<p>C - &quot;So we done the work and you got to pay me now how much are you going to pay me?&quot;</p>\n\n<p>Me- &quot;I don&#39;t know, I need to head out of town after this so just tell me how much you want.&quot;</p>\n\n<p>C - &quot;I am asking you. I could charge you a diagnostic fee but how about 500?&quot;</p>\n\n<p>Me - &quot;Oh haahah sure man I am ready to pay whenever you are.&quot;</p>\n\n<p>C- &quot;See now you done fuck up I bet you wasn&#39;t expecting that give me 500.&quot;</p>\n\n<p>Me thinking this is stupid- &quot;Sure man.&quot;</p>\n\n<p>C- &quot;Ha, see I bet your not gonna pay I am going to charge you 30 for a diagnostic fee because that is how I do business.&quot;</p>\n\n<p>Me- &quot;Yeah that&#39;s fine. I then pull out my wallet to pay&quot;</p>\n\n<p>C- &quot;Oh, you&#39;re paying by card, I can charge you however much I want so now give me 30, are you ready to pay are you in a rush or something? &quot;</p>\n\n<p>Me- &quot;Cool, yeah I need to head out of town so I am going to pay you whenever you are ready to ring me up. &quot;</p>\n\n<p>C - &quot;Ok I am going to stop being a dick. He then hands me the piece, see lesson learn don&#39;t burn bridges you are planning to cross again. I could&#39;ve charged you however much I wanted but I am not a dick. You don&#39;t understand the lessons we tried to teach you about life when you were working here and you just left us. I was trying to teach you to just accept it and move on but you wanted to argue with me about the price. I could&#39;ve charged you however much I wanted.&quot;</p>\n\n<p>I was seriously confused at this. I knew he was joking anyway and to me I did not argue with him or anything. I still do not understand how he thought I was arguing when I even said that I was ready to pay him but whatever.</p>\n\n<p>Me I handed him 5 dollars and said &quot;Well lesson learn, I didn&#39;t burn down any bridges, I tried crossing that bridge and it didn&#39;t work out.&quot;</p>\n\n<p>C- &quot;See you think your cute. I don&#39;t need your money and there you go again want to argue.&quot;</p>\n\n<p>Me- &quot;How am I arguing?&quot;</p>\n\n<p>C- &quot;Let me finish, you always argue with us and don&#39;t want our help when we tried to get you to live a better life but you want to say that we are toxic and call me a dick.&quot;</p>\n\n<p>We both then raised our voice.</p>\n\n<p>Me- &quot;But I was just joking, how is it fair that you can call me names but when I jokingly call you a dick you wanna get upset over it.&quot;</p>\n\n<p>C- &quot;See there you go arguing again, your not getting what I am trying to teach you, you need to shut up and move on.&quot;</p>\n\n<p>Me- &quot;I even told you that I was going to pay how is that.&quot;</p>\n\n<p>C- &quot;Look here don&#39;t you raise your voice at me, you are in my office and I will fuck you up if you raise your voice at me.&quot;</p>\n\n<p>This did not click with me until after I calmed down.</p>\n\n<p>Me- &quot;OK but I am trying to understand from your point of view, how is constantly telling me to drink and I should be smoking&quot; ( yes they would also tell me to smoke weed). At this point both of them was ignoring me telling me how I am not getting it.</p>\n\n<p>I did not want to continue to argue so I thanked them, went out the door and yelled hypocrites. I went to my car, put the piece in my friend laptop and left. It wasn&#39;t until around 20 minutes when I realized that he threatened me and I contacted E about it and explained what happened and he asked why I was there and what he said and that he will review the cameras and get back to me later. Now me and E both know that E isn&#39;t going to do anything about it. I also have no way of contacting E higher ups. I asked some of my  friends about it and I suggested about leaving a negative review on their Facebook and google explaining what they done to me while I was working there and how C threatened me.  Some of them said give E until 12 the next day (today)  to see if he contacts me and if not go ahead and expose them.</p>\n\n<p>&#x200B;</p>\n\n<p>I do understand that I should&#39;ve just went somewhere else and I didn&#39;t mean to raise my voice. Should I leave a review exposing them?</p>\n</div><!-- SC_ON -->",
  "score": 112,
  "permalink": "/r/NoStupidQuestions/comments/picng3/should_i_leave_a_negative_review_exposing_the/",
  "subreddit": "NoStupidQuestions",
  "id": "picng3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "To keep it short and simple I used to work for a tech company started around\nNovember of 2020 and left around late January of this year because of the way I\nwas treated. Some of the things they said and did to me.\n\n- I do not drink they would constantly tell me that I should drink and they\nwould try…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "簡潔に言うと、私は以前、技術系の会社で働いていて、2020年の11月頃に入社しました。\n年11月頃に入社し、今年の1月下旬頃に退職しました。\n扱われたからです。彼らが私に言ったこと、したことの一部を紹介します。\n\n- 私はお酒を飲まないのですが、彼らは常に私にお酒を飲むべきだと言っていましたし、彼らは\nしようとしていました。",
      "title": "昨日、契約者の一人に脅された後でも、以前働いていた技術系企業の有害な行動を暴露するネガティブレビューを残すべきでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "简而言之，我曾在一家科技公司工作，大约在2020年11月开始工作，今年1月底离开，因为我的工作方式。\n2020年11月开始工作，今年1月下旬离开，因为我受到的待遇太差。\n被对待。他们对我说的和做的一些事情。\n\n- 我不喝酒，他们会不断告诉我，我应该喝酒，他们会试图...\n他们会试图...",
      "title": "我是否应该留下负面评论，揭露我曾经工作过的一家科技公司的有毒行为，即使在昨天被他们的一个承包商威胁之后？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "簡而言之，我曾在一家科技公司工作，大約在2020年11月開始工作，今年1月底離開，因爲我的工作方式。\n2020年11月開始工作，今年1月下旬離開，因爲我受到的待遇太差。\n被對待。他們對我說的和做的一些事情。\n\n- 我不喝酒，他們會不斷告訴我，我應該喝酒，他們會試圖...\n他們會試圖...",
      "title": "我是否應該留下負面評論，揭露我曾經工作過的一家科技公司的有毒行爲，即使在昨天被他們的一個承包商威脅之後？"
    }
  ]
}