{
  "author": "jakefromstat3farm23",
  "original_created_utc": 1645453810,
  "title": "I am intrigued by Biden’s executive order on crypto.",
  "created_utc": 1645491781,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As many of you know Biden is expected to sign an executive order on crypto regulation this week. I believe this is nothing but great news. Some of you right about now are probably thinking I am crazy because “regulation” is never a good thing. But in this case it is, or should I say, could be. Shining the light on crypto and providing a base set of regulations could open the door to a whole new world of investors such as major institutions and every day investors such as you and me. Crypto will never be widely accepted by the majority until there are some forms of regulation. Now saying that, I am not for overstepping the boundaries and the government going all out to try to kill crypto in general. But I am for a small set of regulations to ease the mind of those on the fence for investing or making it any option for their investors. How does everyone else feel? This is just a general discussion to go over the possible pros and cons of the executive order.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 304,
  "permalink": "/r/CryptoCurrency/comments/sxuulh/i_am_intrigued_by_bidens_executive_order_on_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "sxuulh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "As many of you know Biden is expected to sign an executive order on crypto\nregulation this week. I believe this is nothing but great news. Some of you\nright about now are probably thinking I am crazy because “regulation” is never a\ngood thing. But in this case it is, or should I say, could be.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "多くの人が知っているように、バイデンは暗号に関する大統領令に署名する見込みです。\n今週中に規制を開始します。これは素晴らしいニュース以外の何物でもないと思っています。皆さんの中には\n今頃、私のことをおかしいと思っていることでしょう。\n良いことです。しかし、この場合はそうである、いや、そうなる可能性があると言うべきだろう...。",
      "title": "暗号に関するバイデンの大統領令には興味をそそられる。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "正如你们许多人所知，拜登预计将在本周签署一项关于加密货币的行政命令。\n监管的行政命令。我相信这不过是个好消息。你们中的一些人\n现在可能认为我疯了，因为 \"监管 \"从来都不是一件好事。\n好的事情。但在这种情况下，它是，或者我应该说，可能是....。",
      "title": "我对拜登关于加密货币的行政命令很感兴趣。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "正如你們許多人所知，拜登預計將在本週簽署一項關於加密貨幣的行政命令。\n監管的行政命令。我相信這不過是個好消息。你們中的一些人\n現在可能認爲我瘋了，因爲 \"監管 \"從來都不是一件好事。\n好的事情。但在這種情況下，它是，或者我應該說，可能是....。",
      "title": "我對拜登關於加密貨幣的行政命令很感興趣。"
    }
  ]
}