{
  "author": "mike_oc23",
  "the_new_excerpt": "Hi Everyone,\n\nI have been trying to find the right balance of dividends and capital gains in a\nportfolio. I came up with 5 tickers ranging from high yield with poor\nperformance to low yield with strong performance. Would love to hear what you\nall think. My current account yields 2.5% so this will…",
  "original_created_utc": 1622517963,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。\n\n私は、ポートフォリオの中で、配当とキャピタルゲインの適切なバランスを見つけようとしています。\nポートフォリオを構築しています。高利回りでパフォーマンスが低いものから、低利回りでパフォーマンスが高いものまで、5つの銘柄を考えました。\n高利回りでパフォーマンスが低いものから、低利回りでパフォーマンスが高いものまで。皆さんの意見を聞かせてください。\n皆さんのご意見をお聞かせください。私の現在の口座の利回りは2.5%なので、これは...",
      "title": "キャピタルゲイン＋ディビデンド・インカム・アカウント"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。\n\n我一直试图在投资组合中找到股息和资本收益的正确平衡点。\n投资组合。我想出了5种股票，从表现不佳的高收益率到表现强劲的低收益率。\n到表现强劲的低收益。很想听听大家的\n大家的看法。我目前的账户收益率为2.5%，所以这将...",
      "title": "资本收益+股息收入账户"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。\n\n我一直試圖在投資組合中找到股息和資本收益的正確平衡點。\n投資組合。我想出了5種股票，從表現不佳的高收益率到表現強勁的低收益率。\n到表現強勁的低收益。很想聽聽大家的\n大家的看法。我目前的賬戶收益率爲2.5%，所以這將...",
      "title": "資本收益+股息收入賬戶"
    }
  ],
  "title": "Capital Gain + Dividend Income Account",
  "created_utc": 1622535816,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi Everyone,</p>\n\n<p>I have been trying to find the right balance of dividends and capital gains in a portfolio. I came up with 5 tickers ranging from high yield with poor performance to low yield with strong performance. Would love to hear what you all think. My current account yields 2.5% so this will increase it 2x which I’m happy about.</p>\n\n<p>VTI 25% - Dividend 1.25%, 5yr Change 102%</p>\n\n<p>QYLD 25% - Dividend 11.89%, 5yr Change 1.4%</p>\n\n<p>DIVO 20% - Dividend 5.36%, 5yr Change 43.43%</p>\n\n<p>BSTZ 15% - Dividend 5.41%, Change since inception 81.4%</p>\n\n<p>SCHD 15% - Dividend 2.69%, 5yr Change 88.7%</p>\n\n<p>This gives an overall dividend yield of 5.57%. Together the 5 tickers have had an average return of 60% for share price in the last 5 years. The exception is BSTZ which hasn’t been around for 5 years yet.</p>\n</div><!-- SC_ON -->",
  "score": 65,
  "permalink": "/r/investing/comments/npkm56/capital_gain_dividend_income_account/",
  "subreddit": "investing",
  "id": "npkm56",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804300235
}