{
  "author": "ip_address_freely",
  "the_new_excerpt": "I’ve been involved in crypto for a long time. Whenever it comes to a point where\npeople are buying and selling based on tweets, the market corrects. A year or\ntwo later, those corrections never mattered. Bitcoin is bigger than any one\nperson or company. How many posts have we made here where we…",
  "original_created_utc": 1621265360,
  "title": "We’ve seen this play out before. A year from now, we will look back on May 2021 and say “I should have bought the dip.”",
  "created_utc": 1621277659,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve been involved in crypto for a long time. Whenever it comes to a point where people are buying and selling based on tweets, the market corrects. A year or two later, those corrections never mattered. Bitcoin is bigger than any one person or company. How many posts have we made here where we “should have bought” at $200? $1000? $3000? $10000?? These dips don’t matter, either you believe in bitcoin long term or you don’t. And if you’re going to sell based on one man’s tweets, maybe you should buy something else instead. </p>\n\n<p>HODL</p>\n</div><!-- SC_ON -->",
  "score": 3022,
  "permalink": "/r/Bitcoin/comments/nej9d9/weve_seen_this_play_out_before_a_year_from_now_we/",
  "subreddit": "Bitcoin",
  "id": "nej9d9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590795287,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は長い間、暗号に携わってきました。るようになると、必ず\nツイートで売買が成立し、相場が修正される。1年か\n2年後、その補正は決して重要ではありませんでした。ビットコインは誰よりも大きく\n個人・企業 私たちはここで何回投稿したことでしょう...",
      "title": "以前にも同じようなことがありました。今から1年後、2021年5月を振り返って \"ディップを買っておけばよかった \"と言うでしょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我参与加密货币已经很长时间了。每当到了一个地步\n人们根据推文进行买卖时，市场就会进行修正。一年或两年后\n后，这些修正就不重要了。比特币比任何一个\n人或公司。我们在这里发过多少帖子，我们...",
      "title": "我们以前看到过这种情况。一年后，我们回顾2021年5月的时候，会说 \"我应该买下这个跌停板\"。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我參與加密貨幣已經很長時間了。每當到了一個地步\n人們根據推文進行買賣時，市場就會進行修正。一年或兩年後\n後，這些修正就不重要了。比特幣比任何一個\n人或公司。我們在這裏發過多少帖子，我們...",
      "title": "我們以前看到過這種情況。一年後，我們回顧2021年5月的時候，會說 \"我應該買下這個跌停板\"。"
    }
  ]
}