{
  "author": "Kaizenmz",
  "the_new_excerpt": "For me it's not about the lambos or private jets.\n\nBoth my parents have worked hard their entire lives. Working 7 day weeks and\nsacrificing a lot to give me a good education they weren't able to have so I can\nhave a better future.\n\nMy goal is to pay it forward and make their retirement as enjoyable…",
  "original_created_utc": 1619859018,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私にとっては、ランボやプライベートジェットのことではありません。\n\n私の両親はどちらも一生懸命働いてきました。週7日勤務で\n私がより良い未来を築けるように、両親が受けられなかった良い教育を私に与えるために多くの犠牲を払ってきました。\n私がより良い未来を送れるように。\n\n私の目標は、その恩返しとして、両親の老後を楽しいものにすることです...。",
      "title": "暗号の最終目標は何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对我来说，这不是关于兰博基尼或私人飞机。\n\n我的父母一生都在努力工作。每周工作7天，并且\n牺牲了很多，给我提供了他们无法得到的良好教育，以便我能够\n有一个更好的未来。\n\n我的目标是回报他们，让他们的退休生活变得更加愉快。",
      "title": "你对加密货币的最终目标是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對我來說，這不是關於蘭博基尼或私人飛機。\n\n我的父母一生都在努力工作。每週工作7天，並且\n犧牲了很多，給我提供了他們無法得到的良好教育，以便我能夠\n有一個更好的未來。\n\n我的目標是回報他們，讓他們的退休生活變得更加愉快。",
      "title": "你對加密貨幣的最終目標是什麼？"
    }
  ],
  "title": "What is you end goal for crypto?",
  "created_utc": 1619876383,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For me it&#39;s not about the lambos or private jets.</p>\n\n<p>Both my parents have worked hard their entire lives. Working 7 day weeks and sacrificing a lot to give me a good education they weren&#39;t able to have so I can have a better future. </p>\n\n<p>My goal is to pay it forward and make their retirement as enjoyable as possible. Whether their wish is to travel the world or live in a peaceful environment. They deserve it and i could not be any happier if I am able to achieve this.</p>\n</div><!-- SC_ON -->",
  "score": 763,
  "permalink": "/r/CryptoCurrency/comments/n2ei2n/what_is_you_end_goal_for_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "n2ei2n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380961467
}