{
  "author": "CriticDanger",
  "the_new_excerpt": "Hello all,\n\nLet's use this thread to discuss the GameStop situation this weekend, please\ndon't open new threads about it unless it is a unique perspective or brings very\nvaluable information.\n\nDo note, posts and comments are still restricted to users with a higher Karma\nand account age.\n\n\nIMPORTANT…",
  "original_created_utc": 1612029808,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "大家好\n\n让我们用这个话题来讨论一下这个周末的GameStop的情况吧，拜托了\n不要开新的话题，除非它是一个独特的观点，或带来很\n有价值的信息。\n\n请注意，帖子和评论仍然只限于Karma较高的用户。\n和账户年龄。\n\n\n重要的是...",
      "title": "周末金交所主题+大家的功课。让我们不要再使用停止交易的经纪商了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好\n\n讓我們用這個話題來討論一下這個週末的GameStop的情況吧，拜託了\n不要開新的話題，除非它是一個獨特的觀點，或帶來很\n有價值的信息。\n\n請注意，帖子和評論仍然只限於Karma較高的用戶。\n和賬戶年齡。\n\n\n重要的是...",
      "title": "週末金交所主題+大家的功課。讓我們不要再使用停止交易的經紀商了"
    }
  ],
  "title": "Weekend GME Thread + Homework for all: Let's stop using brokerages that halted trading",
  "created_utc": 1612036323,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello all,</p>\n\n<p>Let&#39;s use this thread to discuss the GameStop situation this weekend, please don&#39;t open new threads about it unless it is a unique perspective or brings very valuable information.</p>\n\n<p>Do note, posts and comments are still restricted to users with a higher Karma and account age.</p>\n\n<h2>Important information</h2>\n\n<p>First, let&#39;s get some things out of the way:</p>\n\n<ul>\n<li>The short squeeze has not squoze yet, short interest estimates are still extremely high, I won&#39;t post the sources and encourage you to search for it yourself.</li>\n<li>The gamma squeeze has not happened, it may happen Monday, it may happen gradually, it may not happen (if their positions have already been covered), it isn&#39;t necessary for anything to happen, however.</li>\n<li>The establishment is still lying about many things for the purpose of market manipulation (Jim Cramer, CNBC, etc.). These people are SOLD. Read Canadian news channels regarding situation, they are much less biased!</li>\n<li>Google and Apple and removing negative reviews from bad brokers from their app stores, put a calendar reminder in 2-6 weeks to add your review at that time, instead of now.</li>\n</ul>\n\n<hr/>\n\n<h2>Let&#39;s make a list of the Brokers that betrayed the Retail Investor</h2>\n\n<p>The worst thing that happened this week, was the betrayal of our Brokers, choosing instead to side with the establishment and restricting the purchase of certain stocks, tanking those tickers.</p>\n\n<p>Now, I&#39;m aware this is more complicated than that, and some clearing houses (such as Apex Clearing) forced some Brokers to do it. </p>\n\n<p><strong>Even if that was true, the Brokers should tell clients that this is the cause, and they should be pushing, as much as we are, at getting this resolved.</strong></p>\n\n<p>Here is my initial list, please comment below and let me know which ones I&#39;ve missed:</p>\n\n<h3>Bad Brokers - Restricted purchasing of certain tickets or engaged in other forms of manipulation</h3>\n\n<ul>\n<li>Robinhood - <a href=\"https://seekingalpha.com/news/3656437-robinhoods-50-stock-limit-list?mail_subject=bb-ino-robinhood-s-50-stock-limit-list-with-spacs-makes-mass-exodus-likelier-alpha-tactics&amp;utm_campaign=rta-stock-news&amp;utm_content=link-73&amp;utm_medium=email&amp;utm_source=seeking_alpha\">Now Blocking 50 Equities</a> - <a href=\"https://robinhoodgamestopclassaction.com/\">Join the lawsuit against them if you were affected</a></li>\n<li>Interactive Brokers (US/CAN) - [Admits he works for the clearing houses, not the customers] - (<a href=\"https://www.youtube.com/watch?v=7RH4XKP55fM\">https://www.youtube.com/watch?v=7RH4XKP55fM</a>)</li>\n<li>Webull - <a href=\"https://finance.yahoo.com/news/we-bull-ceo-explains-why-trading-was-restricted-amid-the-game-stop-market-mania-172539318.html\">Admitted they were forced to by clearing firm</a></li>\n<li>E-Trade</li>\n<li>E-Toro</li>\n<li>Freetrade</li>\n<li>Wells Fargo (allowed trades but banned its advisors from talking about GameStop)</li>\n<li>Ally</li>\n<li>Public.com</li>\n<li>Merrill Edge</li>\n<li>Trading212 - <a href=\"https://twitter.com/Trading212/status/1355074914202628098\">re-enabled, caused by intermediary</a></li>\n<li>IG Broker</li>\n<li>Cash App</li>\n</ul>\n\n<h3>Good Brokers - Did not restrict trading</h3>\n\n<ul>\n<li>Most Canadian Brokers (Questrade, Qtrade, Disnat, BMO, HSBC, RBC, TD, etc.)</li>\n<li>Fidelity </li>\n<li>Vanguard</li>\n<li>WealthSimple (CAN, US)</li>\n<li>Revolut</li>\n<li>TD Ameritrade (Margin requirements increased)</li>\n<li>Schwab (Margin requirements increased)</li>\n<li>You Invest (JP Morgan/Chase)</li>\n<li>Capital.com</li>\n<li>Degiro</li>\n</ul>\n\n<hr/>\n\n<p>We will keep this list on the sidebar...forever. Please help me build this list to completion. If you are using a broker in the bad list, even if you are not invested in the tickers that have been restricted, please consider moving to a better broker.</p>\n\n<p>Thank you all for your patience, we are sorry new members are not able to comment yet, we promise you will be allowed to once this is over!</p>\n</div><!-- SC_ON -->",
  "score": 33506,
  "permalink": "/r/stocks/comments/l8rhr3/weekend_gme_thread_homework_for_all_lets_stop/",
  "subreddit": "stocks",
  "id": "l8rhr3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518537979
}