{
  "author": "JR_Rahn_ismyfather",
  "the_new_excerpt": "Hello everyone. Not sure how many people are familiar with the psychedelic\nspace, but I’m here to tell you guys a bit about mindmed and the space as a\nwhole.\n\nThe basic investment thesis is this: current available mental health treatments\nsuch as adderall, Xanax, suboxone, etc simply dull out, or…",
  "original_created_utc": 1614750112,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。不知道有多少人熟知迷幻的?\n空间，但我在这里要告诉你们一些关于mindmed和空间作为一个。\n整体。\n\n基本的投资论点是：目前现有的心理健康治疗手段\n如阿德拉、Xanax、suboxone等简单枯燥，或... ...",
      "title": "MMED/MMEDF----长期10年以上装袋机。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。不知道有多少人熟知迷幻的?\n空間，但我在這裏要告訴你們一些關於mindmed和空間作爲一個。\n整體。\n\n基本的投資論點是：目前現有的心理健康治療手段\n如阿德拉、Xanax、suboxone等簡單枯燥，或... ...",
      "title": "MMED/MMEDF----長期10年以上裝袋機。"
    }
  ],
  "title": "MMED/MMEDF - long term 10+ bagger",
  "created_utc": 1614760160,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello everyone. Not sure how many people are familiar with the psychedelic space, but I’m here to tell you guys a bit about mindmed and the space as a whole. </p>\n\n<p>The basic investment thesis is this: current available mental health treatments such as adderall, Xanax, suboxone, etc simply dull out, or put a temporary bandaid on the issue. After looking at the efficacy rates for issues such as smoking cessation, PTSD, treatment resistant depression, etc, it is clear that psychedelics could turn into a massive industry that disrupts the way we treat mental health. This could lead mind medicine and other similar companies to multi billion dollar buyouts from big pharma companies. </p>\n\n<p>There are plenty of fantastic companies in the space, but mindmed is by far my favourite. For full disclosure I’m currently long ~100k warrants, already up bigly. </p>\n\n<p>Mindmed has a diverse pipeline for a multitude of issues, plenty of cash for future R&amp;D, and plenty of fantastic partnerships in academia/pharma. Additionally, this stock cannot be traded yet by anyone on robinhood due to it being on the OTC market. A nasdaq uplist (expected) would open the floodgates to a ton of new retail buyers. There is also EXTREMELY low institutional ownership, basically 0%. </p>\n\n<p>At a market cap of 1.5 billion Canadian dollars, this can easily be a 10 bagger once there is more media attention surrounding it, and more progress is made regarding clinical trials. People are not talking about the psychedelic space yet. </p>\n\n<p>Last thing before I start seeing this in the comments, this does NOT at all compare to the weed industry. There are far more barriers to entry, addresses a totally different market (recreational vs medicinal), and has the added advantage of interest from big pharma.</p>\n\n<p>I’m aware this isn’t very detailed or anything, I don’t have the patience to put together a full DD post. I’m simply encouraging everyone in this group to do consider what this company has going for it.</p>\n</div><!-- SC_ON -->",
  "score": 130,
  "permalink": "/r/investing/comments/lwmfcc/mmedmmedf_long_term_10_bagger/",
  "subreddit": "investing",
  "id": "lwmfcc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937740764
}