{
  "author": "ExiledToTerminus",
  "original_created_utc": 1627570836,
  "title": "Despite being able small minority in the U.S., Sikh-Americans are a common sight on the highway and at rest stops as long-haul truckers. Is there a historical basis for why this industry has attracted so many Sikhs, as opposed to other industries?",
  "created_utc": 1627595170,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I realize this question may be flirting with the 20-year-old rule, but I am banking on my assumption that the causes for the over-representation of Sikh-Americans in the trucking industry began at least 20 years ago.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/otz5mm/despite_being_able_small_minority_in_the_us/",
  "subreddit": "AskHistorians",
  "id": "otz5mm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I realize this question may be flirting with the 20-year-old rule, but I am\nbanking on my assumption that the causes for the over-representation of\nSikh-Americans in the trucking industry began at least 20 years ago.",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この質問は20年前のルールに触れることになるかもしれませんが、私は\nトラック業界にシーク系アメリカ人が多い原因は、少なくとも20年前に始まっていると考えています。\nしかし、トラック運送業界におけるシーク系アメリカ人の過多の原因は、少なくとも20年前から始まっていたのではないかと考えています。",
      "title": "アメリカでは少数派であるにもかかわらず、シーク教徒のアメリカ人は長距離トラック運転手として高速道路や休憩所でよく見かけます。他の産業に比べて、なぜこの産業にシーク教徒が多いのか、歴史的な根拠はあるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我意识到这个问题可能与20年前的规则相冲突，但我的假设是\n我的假设是，造成锡克族美国人在卡车运输业中比例过高的原因至少在20年前就开始了。\n锡克族美国人在卡车运输业中比例过高的原因至少在20年前就开始了。",
      "title": "尽管在美国，锡克族美国人能够成为少数人，但作为长途卡车司机，在高速公路和休息站是一个常见的景象。与其他行业相比，这个行业吸引了这么多锡克教徒，是否有历史依据？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我意識到這個問題可能與20年前的規則相沖突，但我的假設是\n我的假設是，造成錫克族美國人在卡車運輸業中比例過高的原因至少在20年前就開始了。\n錫克族美國人在卡車運輸業中比例過高的原因至少在20年前就開始了。",
      "title": "儘管在美國，錫克族美國人能夠成爲少數人，但作爲長途卡車司機，在高速公路和休息站是一個常見的景象。與其他行業相比，這個行業吸引了這麼多錫克教徒，是否有歷史依據？"
    }
  ]
}