{
  "author": "--Savathun--",
  "original_created_utc": 1648846871,
  "title": "My boss told me I was fired as soon as I got to work, laughed and walked off.",
  "created_utc": 1648890006,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I spent the next 2 hours shutting down my station, and packing my stuff. Even destroyed my client list ( mine was the largest in the branch).&lt;/p&gt;\n\n&lt;p&gt;When I got home about 3 hours later, he called me..&lt;/p&gt;\n\n&lt;p&gt;Boss- &amp;quot; Hey Z! Where are you at? I Can&amp;#39;t find you in the office.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Me-&amp;quot; you fired me. Why the hell would I be at work?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Boss-&amp;quot; it&amp;#39;s April fools! It was a joke! Get back In here.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Me-&amp;quot; no. You clearly said I am fired. I&amp;#39;ll be taking unemployment for a few months, and filing a complaint with HR.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;He lost his shit, and I just hung up on him. It&amp;#39;s not fucking funny, and I&amp;#39;m taking a vacation/riding the wrongful termination train. He has called me 10 times, and I think HR is calling me now.&lt;/p&gt;\n\n&lt;p&gt;Edit: I&amp;#39;m already getting DMs calling me a lazy parasite. Love it.&lt;/p&gt;\n\n&lt;p&gt;Edit 2: I kept my physical copy of the client list and destroyed the digital on-site copy.&lt;/p&gt;\n\n&lt;p&gt;Edit 3: RIP my DMs. This post exploded in the hour it has existed. I&amp;#39;m trying to reply to people.&lt;/p&gt;\n\n&lt;p&gt;Edit 4: Jeeze, thousands of replies and hundreds of DMs. I&amp;#39;m gonna fall asleep soon. I have a remote meeting with HR tomorrow, and I&amp;#39;ll also be talking with a few other people in the company too. I&amp;#39;ll post an update soon. Stay safe.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 75317,
  "permalink": "/r/antiwork/comments/tu1f9v/my_boss_told_me_i_was_fired_as_soon_as_i_got_to/",
  "subreddit": "antiwork",
  "id": "tu1f9v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I spent the next 2 hours shutting down my station, and packing my stuff. Even\ndestroyed my client list ( mine was the largest in the branch).\n\nWhen I got home about 3 hours later, he called me..\n\nBoss- \" Hey Z! Where are you at? I Can't find you in the office.\"\n\nMe-\" you fired me. Why the hell…"
}