{
  "author": "--Savathun--",
  "original_created_utc": 1648846871,
  "title": "My boss told me I was fired as soon as I got to work, laughed and walked off.",
  "created_utc": 1648890006,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I spent the next 2 hours shutting down my station, and packing my stuff. Even destroyed my client list ( mine was the largest in the branch).&lt;/p&gt;\n\n&lt;p&gt;When I got home about 3 hours later, he called me..&lt;/p&gt;\n\n&lt;p&gt;Boss- &amp;quot; Hey Z! Where are you at? I Can&amp;#39;t find you in the office.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Me-&amp;quot; you fired me. Why the hell would I be at work?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Boss-&amp;quot; it&amp;#39;s April fools! It was a joke! Get back In here.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Me-&amp;quot; no. You clearly said I am fired. I&amp;#39;ll be taking unemployment for a few months, and filing a complaint with HR.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;He lost his shit, and I just hung up on him. It&amp;#39;s not fucking funny, and I&amp;#39;m taking a vacation/riding the wrongful termination train. He has called me 10 times, and I think HR is calling me now.&lt;/p&gt;\n\n&lt;p&gt;Edit: I&amp;#39;m already getting DMs calling me a lazy parasite. Love it.&lt;/p&gt;\n\n&lt;p&gt;Edit 2: I kept my physical copy of the client list and destroyed the digital on-site copy.&lt;/p&gt;\n\n&lt;p&gt;Edit 3: RIP my DMs. This post exploded in the hour it has existed. I&amp;#39;m trying to reply to people.&lt;/p&gt;\n\n&lt;p&gt;Edit 4: Jeeze, thousands of replies and hundreds of DMs. I&amp;#39;m gonna fall asleep soon. I have a remote meeting with HR tomorrow, and I&amp;#39;ll also be talking with a few other people in the company too. I&amp;#39;ll post an update soon. Stay safe.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 75317,
  "permalink": "/r/antiwork/comments/tu1f9v/my_boss_told_me_i_was_fired_as_soon_as_i_got_to/",
  "subreddit": "antiwork",
  "id": "tu1f9v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I spent the next 2 hours shutting down my station, and packing my stuff. Even\ndestroyed my client list ( mine was the largest in the branch).\n\nWhen I got home about 3 hours later, he called me..\n\nBoss- \" Hey Z! Where are you at? I Can't find you in the office.\"\n\nMe-\" you fired me. Why the hell…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "それから2時間かけて、自分のステーションをシャットダウンし、荷物をまとめました。さらに\n私の顧客リストは破棄しました（私の顧客は支店で一番多かったのです）。\n\n3時間後に家に帰ると、彼から電話がありました。\n\nボス-「おい、Z! どこにいるんだ？オフィスにいないぞ」。\n\n私-\" 私をクビにしたのはあなたです。なんでだよ...",
      "title": "上司は私が出勤するとすぐにクビだと言い、笑って立ち去りました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我花了2个小时来关闭我的工作站，并收拾我的东西。甚至\n销毁了我的客户名单（我的客户名单是分公司里最大的）。\n\n3个小时后我回到家，他给我打电话。\n\n老板--\"嘿，Z! 你在哪里？我在办公室里找不到你。\"\n\n我--\"你解雇了我。这到底是为什么...",
      "title": "我的老板告诉我，我一上班就被解雇了，笑了笑就走了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我花了2個小時來關閉我的工作站，並收拾我的東西。甚至\n銷燬了我的客戶名單（我的客戶名單是分公司裏最大的）。\n\n3個小時後我回到家，他給我打電話。\n\n老闆--\"嘿，Z! 你在哪裏？我在辦公室裏找不到你。\"\n\n我--\"你解僱了我。這到底是爲什麼...",
      "title": "我的老闆告訴我，我一上班就被解僱了，笑了笑就走了。"
    }
  ]
}