{
  "author": "stateofstatic",
  "the_new_excerpt": "So Ryan Cohen originally purchased his 12.9% stake in Gamestop at $8.43 per\nshare average. Based on the current price, this is about a 2300% profit.\n\nPer his contract as a board member, he cannot own more than 20% of the company,\nleaving him with 7.1% company stake remaining he is able to purchase,…",
  "original_created_utc": 1615916009,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "所以，瑞恩-科恩最初以8.43美元/股的价格购买了他在Gamestop的12.9%的股份。\n股的平均水平。按照目前的价格计算，这大约是2300%的利润。\n\n根据他作为董事会成员的合同，他不能拥有超过20%的公司股份。\n让他剩下7.1%的公司股份，他可以购买，... ...",
      "title": "GME，有没有人考虑过这种可能性......科恩的王牌？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以，瑞恩-科恩最初以8.43美元/股的價格購買了他在Gamestop的12.9%的股份。\n股的平均水平。按照目前的價格計算，這大約是2300%的利潤。\n\n根據他作爲董事會成員的合同，他不能擁有超過20%的公司股份。\n讓他剩下7.1%的公司股份，他可以購買，... ...",
      "title": "GME，有沒有人考慮過這種可能性......科恩的王牌？"
    }
  ],
  "title": "GME, has anyone considered this possibility...Cohen ace in the hole?",
  "created_utc": 1616001384,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So Ryan Cohen originally purchased his 12.9% stake in Gamestop at $8.43 per share average.  Based on the current price, this is about a 2300% profit.  </p>\n\n<p>Per his contract as a board member, he cannot own more than 20% of the company, leaving him with 7.1% company stake remaining he is able to purchase, or roughly 3,900,000 shares.</p>\n\n<p>So let&#39;s say he sits and waits till this Friday, when MMs continue to move the price toward 155 (current calculated max pain price for options on 3/19).  He then files a 13F, and buy&#39;s up 3.9 million shares...this would still put his profit average well over 1000%, AND would blow MM&#39;s attempts to pin the price out of the water, triggering a gamma squeeze...this creates massive margin calls by Tuesday 3/23, which coincidentally happens to be when GME reports earnings.  The convergence of these two factors in addition to hype momentum <strong><em>could be enough</em></strong> to then trigger the MOASS imo.  Thoughts?</p>\n\n<p>Not financial advice, I like the stock.</p>\n</div><!-- SC_ON -->",
  "score": 2918,
  "permalink": "/r/wallstreetbets/comments/m6eixc/gme_has_anyone_considered_this_possibilitycohen/",
  "subreddit": "wallstreetbets",
  "id": "m6eixc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147394527
}