{
  "author": "GreenBottom18",
  "original_created_utc": 1625475641,
  "title": "Why was Britain seemingly reluctant to outlaw or regulate production of the various deadly fashion trends of the 19th century?",
  "created_utc": 1625507942,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Mercury soaked hats, arsenic (french green) dyed gowns, and the like all had proven to be harmful, and even deadly to wearers, but especially to workers who manufactured the garments. </p>\n\n<p>Most wealthy nations where they were made and &quot;<em>enjoyed</em>&quot; outlawed the use of these toxic chemicals in garment production (some later than others). However, Britain seems to have been reluctant to do so. Production only stopped when the items fell out of fashion, as they were seemingly never banned or regulated. </p>\n\n<p>What or who may have caused British legislators to overlook/ignore these deadly practices? Was it simply nuanced popularity of the items in British society, or could there have been other reasons for their careless inaction?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/oe3a9e/why_was_britain_seemingly_reluctant_to_outlaw_or/",
  "subreddit": "AskHistorians",
  "id": "oe3a9e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Mercury soaked hats, arsenic (french green) dyed gowns, and the like all had\nproven to be harmful, and even deadly to wearers, but especially to workers who\nmanufactured the garments.\n\nMost wealthy nations where they were made and \"enjoyed\" outlawed the use of\nthese toxic chemicals in garment…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "水銀のついた帽子、ヒ素（フレンチグリーン）で染めたガウンなどは、着用者にとって有害であり、死に至ることもあった。\n着用者はもちろんのこと、特に製造者である労働者にとっては有害であり、死に至ることもあることが証明されていた。\n衣服を製造している労働者にとっても、有害であることが証明されていました。\n\n衣服を製造して「楽しんで」いた裕福な国々のほとんどは、衣服にこれらの有害な化学物質を使用することを禁止していました。\n衣服にこれらの有害な化学物質を使用することを禁止しています。",
      "title": "なぜイギリスは、19世紀の様々な死のファッショントレンドを禁止したり、生産を規制することに消極的だったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "汞浸泡的帽子、砷（法式绿色）染色的长袍，以及类似的东西都被证明是有害的，甚至是致命的。\n事实证明，对穿着者来说是有害的，甚至是致命的，特别是对制造服装的工人来说，更是如此。\n制造这些服装的工人。\n\n大多数制造和 \"享受 \"这些服装的富裕国家都禁止在服装中使用这些有毒的化学物质。\n这些有毒化学品在服装中的使用。",
      "title": "为什么英国似乎不愿意取缔或管制19世纪各种致命的时尚潮流的生产？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "汞浸泡的帽子、砷（法式綠色）染色的長袍，以及類似的東西都被證明是有害的，甚至是致命的。\n事實證明，對穿着者來說是有害的，甚至是致命的，特別是對製造服裝的工人來說，更是如此。\n製造這些服裝的工人。\n\n大多數製造和 \"享受 \"這些服裝的富裕國家都禁止在服裝中使用這些有毒的化學物質。\n這些有毒化學品在服裝中的使用。",
      "title": "爲什麼英國似乎不願意取締或管制19世紀各種致命的時尚潮流的生產？"
    }
  ]
}