{
  "author": "Supercharmeleon",
  "original_created_utc": 1632789386,
  "title": "I have money in Crypto I can't afford to lose, but only because it's safer than my country's coin.",
  "created_utc": 1632799856,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Apologies for the bad English, it&#39;s not my first language.</p>\n\n<p>As a lot of people already know, a lot of Latin-american countries aren&#39;t exactly in the best place when it comes to their economies, more specifically because of inflation and the devaluation of their national coin. We&#39;ve seen how harsh some crashes can be. Venezuela demonstrated it plenty, and my country Argentina, though not as extreme, suffered a lot as well.</p>\n\n<p>I learned about crypto about five years ago, when the worst of our economic troubles were beginning, and it was honestly a saving grace not only for myself but also my family. And funnily enough, I have a redditor to thank for that.</p>\n\n<p>A long while ago, before Bitcoin&#39;s big boom, I made a comment on a certain subreddit, I don&#39;t even remember what it was anymore. But apparently someone thought it was funny enough to deserve an award. So he gave me a lil&#39; bit of bitcoin and told me to &quot;enjoy these couple bucks ;)&quot;. I thanked him, but completely forgot about it until a couple years later, when I saw on the news that this Bitcoin thing had gone way up.</p>\n\n<p>So I checked the account I&#39;d been sent those coins to, and apparently they&#39;d gone from a couple dollars to around 300. I was amazed. At the time 300 dollars was worth a whole month&#39;s salary for some people. So I started investigating, and after educating myself on crypto and the benefits it could have for the future, I decided to give it a shot.</p>\n\n<p>Some context. In my country, currently, it is almost impossible to save your money in foreign coins. There&#39;s a limit of around 200 dollars you can buy per month, and the government really wants you to have your savings in the national coin, which at that point had started to go waaaaaay down. Over the course of 4-5 years the Argentine peso lost 10 times its value, and now those same 300 dollars would be worth two or three salaries in pesos.</p>\n\n<p>And since I was a freelance worker doing gigs for the outside, and since at the time due to national laws my only option to save my money was paypal, which charged insane fees per transaction... I decided to turn to crypto. And it paid off.</p>\n\n<p>Without crypto, I never would&#39;ve been able to save up enough to move out and get my own apartment. Without crypto, I&#39;d have a fraction of the money I have. Without crypto, my life would be so much worse.</p>\n\n<p>Yes, it was a huge risk to put a good portion of my money in crypto, but for some people in Latin-america, it&#39;s that risk or nothing. Sometimes you have to take those risks to achieve your dreams.</p>\n\n<p>Which is why I&#39;m so grateful for crypto, and for the people that helped me out and taught me about it. And especially to the person who first gave me those 2 dollars in bitcoin at the time. That&#39;s the real champ.</p>\n\n<p>Crypto has changed my life, and I&#39;m sure it&#39;ll continue to change it.</p>\n</div><!-- SC_ON -->",
  "score": 169,
  "permalink": "/r/CryptoCurrency/comments/pwukub/i_have_money_in_crypto_i_cant_afford_to_lose_but/",
  "subreddit": "CryptoCurrency",
  "id": "pwukub",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Apologies for the bad English, it's not my first language.\n\nAs a lot of people already know, a lot of Latin-american countries aren't\nexactly in the best place when it comes to their economies, more specifically\nbecause of inflation and the devaluation of their national coin. We've seen how\nharsh…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "英語は母国語ではないので、下手な英語で申し訳ありません。\n\n多くの人が知っているように、ラテンアメリカの多くの国は、日本のように、経済的に恵まれているわけではありません。\n特に、インフレと国の通貨の切り下げのために、経済に関しては最高の状態ではありません。\nインフレと国のコインの切り下げが原因です。私たちは、これまでに\n厳しい...",
      "title": "私は失ってはならないお金をCryptoに持っていますが、それは私の国のコインよりも安全だからです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对糟糕的英语表示歉意，这不是我的第一语言。\n\n正如很多人已经知道的那样，很多拉美国家并不是\n处于最佳状态，特别是在经济方面\n因为通货膨胀和国家硬币的贬值。我们已经看到\n严厉的...",
      "title": "我在加密货币上有钱，我输不起，但只是因为它比我国家的硬币更安全。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對糟糕的英語表示歉意，這不是我的第一語言。\n\n正如很多人已經知道的那樣，很多拉美國家並不是\n處於最佳狀態，特別是在經濟方面\n因爲通貨膨脹和國家硬幣的貶值。我們已經看到\n嚴厲的...",
      "title": "我在加密貨幣上有錢，我輸不起，但只是因爲它比我國家的硬幣更安全。"
    }
  ]
}