{
  "author": "26oclock",
  "original_created_utc": 1636399680,
  "title": "Comment your coin and we will ignore you",
  "created_utc": 1636429038,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is your chance to make a random comment on this post and the community will take no action afterwards. The coin you will mention without any context will just be written there within your comment and nobody will have a clue why you have put it there. The probability why you would put it there is that you have probably invested some of your hard earned money in it and want to convince others to buy into it in order to increase the price not knowing that the others commenting on your comment either have invested in that coin as well or simply have the same low buying power as you have. In fact it will leave your comment about your coin unanswered and it will slowly but quickly move forever into the void of irrelevance. With that said I‘d like to make a proposal. What if you would not put your coin into a contextless comment underneath this post but instead collect proper substancial information about the specific coin or project and present it in a good and digestable way to us, the users and commenting cryptocurrency enthusiasts. Wouldn‘t this deepen the conversation and foster a good and deep dialogue between us?</p>\n\n<p>Let me know your thoughts in the comments.</p>\n</div><!-- SC_ON -->",
  "score": 193,
  "permalink": "/r/CryptoCurrency/comments/qpl3vt/comment_your_coin_and_we_will_ignore_you/",
  "subreddit": "CryptoCurrency",
  "id": "qpl3vt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is your chance to make a random comment on this post and the community will\ntake no action afterwards. The coin you will mention without any context will\njust be written there within your comment and nobody will have a clue why you\nhave put it there. The probability why you would put it there…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この記事にランダムなコメントをするチャンスです。\nその後、コミュニティは何もしません。あなたが何の脈絡もなく言及したコインは\nあなたが何の脈絡もなく言及したコインは、あなたのコメントの中でただそこに書き込まれ、誰もあなたがなぜそれをそこに置いたのかわからないでしょう。\n誰もその理由を知りません。あなたがそれをそこに置く確率は...。",
      "title": "あなたのコインをコメントすると、私たちはあなたを無視します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是你的机会，你可以在这个帖子上随机发表评论，而社区将不会采取任何行动。\n之后不采取任何行动。你所提到的硬币没有任何背景，将\n只是写在你的评论中，没有人会知道你为什么\n把它放在那里。你为什么把它放在那里的概率...",
      "title": "评论你的硬币，我们会忽略你的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是你的機會，你可以在這個帖子上隨機發表評論，而社區將不會採取任何行動。\n之後不採取任何行動。你所提到的硬幣沒有任何背景，將\n只是寫在你的評論中，沒有人會知道你爲什麼\n把它放在那裏。你爲什麼把它放在那裏的概率...",
      "title": "評論你的硬幣，我們會忽略你的。"
    }
  ]
}