{
  "author": "Artur_Alekseev",
  "original_created_utc": 1640183454,
  "title": "Bitfinex keeps frozen $150,000 since 2019. My loss is over $50,000! Ticket #751709.",
  "created_utc": 1640198304,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Bitfinex is removing all information regarding its awful customer service from its Reddit group and blocking users who try to write about the problems with payout of funds from the Bitfinex accounts. \nIt is the common problem and we have to inform everyone about it.&lt;/p&gt;\n\n&lt;p&gt;Moreover, if I ever knew about Bitfinex massively blocks their clients funds or conducting &amp;quot;checks&amp;quot; within months, I would never, never, never register on it to use their services.\nMy story is ordinary, read it, at least you be prepared for what awaits you when you working with Bitfinex. &lt;/p&gt;\n\n&lt;p&gt;I have a small company with my partners and in the 2017 we decided to invest some money in bitcoin. \nIn February 2018 we registered an account on the Bitfinex exchange , it was fully verified up to the maximum level. \nAll the funds were deposited from our own cold wallet and all transactions fully confirmed. \nIn 2019, due to internal corporate reasons we decided to block the account  and all outcoming\\incoming transactions of it with balance just over $15,000. So, we directly asked the exchange to execute it and, actually, the account was blocked immediately. \nAugust 15, 2021, when the account funds were valued at $200,000 due to increase in bitcoin exchange rate, we asked to unblock the account and provide us with access to deposit to withdraw our funds. Then the endless journey of &amp;quot;go there - do not know where, bring it, I do not know what&amp;quot; has begun.&lt;/p&gt;\n\n&lt;p&gt;Chronology of events in 2021:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;August 24 A Bitfinex employee asks for a notarized agreement between me and my partners;&lt;/li&gt;\n&lt;li&gt;August 27, we send the draft of the agreement for prior approval;&lt;/li&gt;\n&lt;li&gt;August 30, we send the signed and notarized agreement; &lt;/li&gt;\n&lt;li&gt;August 31 Bitfinex Employee asked to amend the text of the already executed agreement; &lt;/li&gt;\n&lt;li&gt;September 5, we send a new one draft of the agreement for approval;&lt;/li&gt;\n&lt;li&gt;September 7, Bitfinex employee replied that they are satisfied with the draft of agreement and awaited for the signed and notarized document;&lt;/li&gt;\n&lt;li&gt;September 9 we send the new one notarized agreement, with all the amendments requested by Bitfinex;&lt;/li&gt;\n&lt;li&gt;No response from Bitfinex;&lt;/li&gt;\n&lt;li&gt;September 16 we re-write to customer service about when the $200,000 account will be unlocked;&lt;/li&gt;\n&lt;li&gt;September 18 Bitfinex employee demands notarial confirmation that the account really belongs to the owner, despite the account is fully verified, KYC completed to the maximum. &lt;/li&gt;\n&lt;li&gt;On September 19 we asked to clarify what kind of legal document should proof that the account belongs to the owner?&lt;/li&gt;\n&lt;li&gt;September 21 An employee of Bitfinex replied that we have to ask our lawyers what kind of document it should be. Amazing.&lt;/li&gt;\n&lt;li&gt;On September 23 we had prepared a notary certification of the owner&amp;#39;s rights for the account and sent scans of the document as well as a link to the notary register to check its authenticity. &lt;/li&gt;\n&lt;li&gt;On September 28 we asked to clarify when the account finally be unlocked;&lt;/li&gt;\n&lt;li&gt;September 28, An employee of Bitfinex wrote that they were checking the information and contact us in the near future;&lt;/li&gt;\n&lt;li&gt;October 7, we again asked when the account be unblocked;&lt;/li&gt;\n&lt;li&gt;October 13 Bitfinex Employee answered - wait, we are checking;&lt;/li&gt;\n&lt;li&gt;October 29, we again asked when the account be unblocked;&lt;/li&gt;\n&lt;li&gt;November 3 Bitfinex Employee wrote that as he has had written to us earlier - October 13, wait;&lt;/li&gt;\n&lt;li&gt;November 3 we wrote, tell us at least how much longer to wait, we lose money! By in that time the deposit had decreased by $50,000, also because of kept opened margin positions;&lt;/li&gt;\n&lt;li&gt;November 5, an employee of Bitfinex answered - I can&amp;#39;t tell you anything about the legal verification period, we have no time limits!&lt;/li&gt;\n&lt;li&gt;November 27, we wrote again, that it has been more than two months since we sent all the documents they requested, when the verification be completed?&lt;/li&gt;\n&lt;li&gt;No response from Bitfinex;&lt;/li&gt;\n&lt;li&gt;On December 10 we again wrote to say that we have recorded but privately that the support does not respond to the client&amp;#39;s letters and ask to clarify the verification period once again;&lt;/li&gt;\n&lt;li&gt;On December 10, an employee replied that, as he had written earlier, they were checking and could not name the terms. &lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;What was the result? &lt;/p&gt;\n\n&lt;p&gt;In the end all notarized documents were sent, including their notarized translation - just over 10 pages of the very documents that Bitfinex support itself requested.  Even if you check 3 pages a month, for the past 3.5 months you could have checked them all.\n But that&amp;#39;s not the goal folks. \nIt&amp;#39;s much more complicated than that.\nThe account value during this time has decreased from $200,000 to $150,000, the margin positions were open and are still open and chargeable with all the period, because it is impossible to close it. My direct losses amounted to $50,000, hours of consulting with lawyers and billions of nerve cells. Bitfinex has made my life a living hell these three months! &lt;/p&gt;\n\n&lt;p&gt;Imagine how it feels when you look at your deposit and it decreases by 25% and you can&amp;#39;t do anything, not only withdraw, but even convert to USDT not to lose your money. And your support employee answers you every two weeks for months - wait, due diligence in progress and there are no any exact term when it will be completed.&lt;/p&gt;\n\n&lt;p&gt;I am definitely not against due legal checks and moreover, I believe that all of them are absolutely necessary in any business.\nBut in the case of Bitfinex we are not talking about document checking, we are talking about trivial abuse of rights and direct damage to their clients. How can the legal procedures be timeless? How can your due diligence be endless? How can it be that you first receives our money and then start checking of the client ? \nWhen we open an account at the bank, we first go through verification, open an account and only after that bank gets the money to the account. Bitfinex is doing exactly the opposite.&lt;/p&gt;\n\n&lt;p&gt;There are hundreds of situations like ours, they block accounts under any claim. If there are any  funds on them the exchange starts the procedure of legal verification, which according to them is not limited in time. It is not only unfair, immoral, but also illegal.&lt;/p&gt;\n\n&lt;p&gt;Their meaning is that if you have an account with aprx. $100,000, so you have to spend even more money if you claim them in the British Virgin Islands (Bitfinex jurisdiction) court. This is partly true, because lawyers in such matters and in that jurisdiction are very expensive. At the same time, those clients&amp;#39; funds are a source of enormous liquidity for Bitfinex, which uses client funds at its own will, because if my funds are effectively frozen - no one will charge me interest on the use of my money. From the other side, Bitfinex  quiet easy lends money to another client at a huge interest rate, because the exchange has no &amp;quot;liquidity&amp;quot; problems. &lt;/p&gt;\n\n&lt;p&gt;Nice &amp;quot;business&amp;quot;, right? &lt;/p&gt;\n\n&lt;p&gt;The fact that user funds are blocking “en masse” without any regulations and held indefinitely is not acceptable. I ask to help our community as much as possible in spreading this topic, my Bitfinex Ticket number is 751709, all the given information I can with screenshots or in any other legal way.  All of you who suffered in the same way, mates, please, write in the comments, let&amp;#39;s unite our efforts.&lt;/p&gt;\n\n&lt;p&gt;I will keep you informed about this situation, thank you for spending your time and reading the post to the end.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 207,
  "permalink": "/r/Bitcoin/comments/rm6djh/bitfinex_keeps_frozen_150000_since_2019_my_loss/",
  "subreddit": "Bitcoin",
  "id": "rm6djh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Bitfinex is removing all information regarding its awful customer service from\nits Reddit group and blocking users who try to write about the problems with\npayout of funds from the Bitfinex accounts. It is the common problem and we have\nto inform everyone about it.\n\nMoreover, if I ever knew about…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Bitfinexは、そのひどい顧客サービスに関する情報をすべて削除しています。\nまた、Redditのグループには、この問題について書き込もうとするユーザーをブロックしています。\nBitfinexの口座からの資金の払い戻し。これは一般的な問題であり、私たちは\nをみんなに知らせることです。\n\nさらに、もし私がこのことを知ったら...。",
      "title": "Bitfinexは2019年から15万ドルを凍結し続ける。私の損失は5万ドル以上！？チケット番号751709"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Bitfinex正在删除所有关于其糟糕的客户服务的信息。\n在其Reddit小组中删除了所有关于其糟糕的客户服务的信息，并阻止那些试图写出关于Finex的问题的用户。\n从Bitfinex账户支付资金的问题。这是一个普遍的问题，我们必须\n告知大家这个问题。\n\n此外，如果我曾经知道...",
      "title": "Bitfinex自2019年以来一直冻结15万美元。我的损失超过50,000美元! 票号：751709。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Bitfinex正在刪除所有關於其糟糕的客戶服務的信息。\n在其Reddit小組中刪除了所有關於其糟糕的客戶服務的信息，並阻止那些試圖寫出關於Finex的問題的用戶。\n從Bitfinex賬戶支付資金的問題。這是一個普遍的問題，我們必須\n告知大家這個問題。\n\n此外，如果我曾經知道...",
      "title": "Bitfinex自2019年以來一直凍結15萬美元。我的損失超過50,000美元! 票號：751709。"
    }
  ]
}