{
  "author": "crypto_grandma",
  "original_created_utc": 1625836938,
  "title": "\"If your government is fearful of individual control of money and financial privacy, you should really take a closer look at your government and its priorities.\" Andreas Antonopoulos",
  "created_utc": 1625851840,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It looks like the article about governments moving to make private crypto wallets illegal was just a case of good old FUD. But in the wake of China recently banning crypto for the 173rd time and general crypto FUD news stories circulating in mainstream media (CRYPTOCURRENCY USED TO FUND TERRORISM) it&#39;s natural that perhaps some people are worried about the possibility of increasing governmental regulations/crackdowns on cryptocurrencies in the future (i.e. &quot;Will privacy coins be made illegal?&quot;; people feeling apprehensive over the fact that an increasing number of banks in the UK are not allowing deposits to certain crypto exchanges &quot;in order to protect you&quot;- god bless the bankers and their hearts of gold!)</p>\n\n<p>With that in mind, I&#39;d like to share this quote from Andreas Antonopoulos about how thanks to crypto, an individual can now have control over their own money and financial privacy if they choose to, and what it implies if your government has a problem with that:</p>\n\n<blockquote>\n<p>Some societies will be more comfortable with the idea that individuals have ultimate control over their money and more accepting of self-determination, freedom of association, and freedom of expression. Some societies will not.</p>\n\n<p>Since the 1970’s money has become more and more digital. For many governments, this holds the promise of enabling greater levels of control and surveillance over the financial activities of the entire world; however, that dream ended with the introduction of bitcoin, as it offers an escape hatch from the surveilled and controlled straight-jacket of modern banking. Bitcoin thus becomes a litmus test.</p>\n\n<p><strong>If your government is fearful of individual control of money and financial privacy, you should really take a closer look at your government and its priorities.</strong></p>\n</blockquote>\n\n<p>-Andreas Antonopoulos</p>\n\n<p>(This was taken from an interview back in 2016. Here is the <a href=\"https://futurism.com/promise-bitcoin-interview-andreas-m-antonopoulos\">full interview</a> for anyone interested.)</p>\n</div><!-- SC_ON -->",
  "score": 179,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/U3_lcc8qPmRAgYL-c2-W0wTQusV--0_ovGn_TkHeZ8Y.jpg?auto=webp&s=19a96e159e67b99608303689c3601567ff4b53a3",
          "width": 2560,
          "height": 1536
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/U3_lcc8qPmRAgYL-c2-W0wTQusV--0_ovGn_TkHeZ8Y.jpg?width=108&crop=smart&auto=webp&s=1291139c1c8f41d50c0df32c1a52d6f21a6036b7",
            "width": 108,
            "height": 64
          },
          {
            "url": "https://external-preview.redd.it/U3_lcc8qPmRAgYL-c2-W0wTQusV--0_ovGn_TkHeZ8Y.jpg?width=216&crop=smart&auto=webp&s=502b73297fabf5d3589b9bb7e15ed11d4e6ea949",
            "width": 216,
            "height": 129
          },
          {
            "url": "https://external-preview.redd.it/U3_lcc8qPmRAgYL-c2-W0wTQusV--0_ovGn_TkHeZ8Y.jpg?width=320&crop=smart&auto=webp&s=8e94e92897979a66234771078e0431d6a6bd3edd",
            "width": 320,
            "height": 192
          },
          {
            "url": "https://external-preview.redd.it/U3_lcc8qPmRAgYL-c2-W0wTQusV--0_ovGn_TkHeZ8Y.jpg?width=640&crop=smart&auto=webp&s=73203e2e032d5a69c69fa0d773c12a06c5d0f978",
            "width": 640,
            "height": 384
          },
          {
            "url": "https://external-preview.redd.it/U3_lcc8qPmRAgYL-c2-W0wTQusV--0_ovGn_TkHeZ8Y.jpg?width=960&crop=smart&auto=webp&s=64a3d7cce1ff073cc965aecfcfc33017289a5d3f",
            "width": 960,
            "height": 576
          },
          {
            "url": "https://external-preview.redd.it/U3_lcc8qPmRAgYL-c2-W0wTQusV--0_ovGn_TkHeZ8Y.jpg?width=1080&crop=smart&auto=webp&s=afc5233bd373aeeeb42c7bf384aec1b4c2c5e13e",
            "width": 1080,
            "height": 648
          }
        ],
        "variants": {},
        "id": "cvVH_M00THsl3o3IYcI8EMEl6o3OhYUmZqjYIpf96b0"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/ogvg3c/if_your_government_is_fearful_of_individual/",
  "subreddit": "CryptoCurrency",
  "id": "ogvg3c",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It looks like the article about governments moving to make private crypto\nwallets illegal was just a case of good old FUD. But in the wake of China\nrecently banning crypto for the 173rd time and general crypto FUD news stories\ncirculating in mainstream media (CRYPTOCURRENCY USED TO FUND TERRORISM)…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "政府が民間の暗号財布を違法にしようとしているという記事は、古き良き時代のFUDに過ぎないようです。\n政府が個人の暗号財布を違法にしようとしているという記事は、単なる古き良きFUDのケースだったようです。しかし、中国では\n173回目の暗号禁止令が出され、一般的な暗号FUDのニュースが主流になっています。\n主流メディアに流れている（CRYPTOCURRENCY USED TO FUND TERRORISM）...",
      "title": "\"もし、あなたの政府が個人によるお金の管理や金融プライバシーを恐れるのであれば、あなたは本当に自分の政府とその優先順位をよく見てみるべきです。\" アンドレアス・アントノポウロス"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "看起来，关于政府将私人加密货币钱包定为非法的文章\n钱包是非法的，这只是一个好的老的恐惧症的例子。但在中国\n最近第173次禁止加密货币，以及主流媒体上流传的一般加密货币恐惧症的新闻故事\n在主流媒体上流传（CRYPTOCURRENCY被用来资助恐怖主义）...",
      "title": "\"如果你的政府害怕个人对金钱和金融隐私的控制，你真的应该仔细看看你的政府和它的优先事项。\" 安德烈亚斯-安东诺普洛斯"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "看起來，關於政府將私人加密貨幣錢包定爲非法的文章\n錢包是非法的，這只是一個好的老的恐懼症的例子。但在中國\n最近第173次禁止加密貨幣，以及主流媒體上流傳的一般加密貨幣恐懼症的新聞故事\n在主流媒體上流傳（CRYPTOCURRENCY被用來資助恐怖主義）...",
      "title": "\"如果你的政府害怕個人對金錢和金融隱私的控制，你真的應該仔細看看你的政府和它的優先事項。\" 安德烈亞斯-安東諾普洛斯"
    }
  ]
}