{
  "author": "iKidnapBabiez",
  "the_new_excerpt": "I'm not saying there are no unattractive actors but how do they advertise that?\nDo they put out an ad like \"hey I need someone butt ugly\" and people are like\n\"hey that's me!\". How do you cast someone to an ugly role without being like\n\"wow you're hideous, you're perfect for this\".\n\nBonus question:…",
  "original_created_utc": 1621271237,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "魅力のない俳優がいないとは言いませんが、それをどうやって宣伝するのでしょうか？\nお尻のブサイクな人を募集します」という広告を出して、みんなが「これは私だ！」と思うのか？\n\"それは私だ！」となるわけです。醜い役にどうやってキャスティングするか？\n\"醜いけど、これにぴったりだね」と言われないようにするにはどうしたらいいのでしょうか？\n\nボーナス質問：...",
      "title": "醜い人をどうやって探すの？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不是说没有不吸引人的演员，但他们是如何宣传的？\n他们是否发布广告说 \"嘿，我需要一个丑陋的人\"，然后人们就会说\n\"嘿，那就是我！\"。你如何让一个人扮演一个丑陋的角色而不被认为是\n\"哇，你太丑了，你很适合这个角色\"。\n\n奖励问题：...",
      "title": "他们如何为电影找到丑陋的人？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不是說沒有不吸引人的演員，但他們是如何宣傳的？\n他們是否發佈廣告說 \"嘿，我需要一個醜陋的人\"，然後人們就會說\n\"嘿，那就是我！\"。你如何讓一個人扮演一個醜陋的角色而不被認爲是\n\"哇，你太醜了，你很適合這個角色\"。\n\n獎勵問題：...",
      "title": "他們如何爲電影找到醜陋的人？"
    }
  ],
  "title": "How do they find ugly people for movies?",
  "created_utc": 1621307102,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m not saying there are no unattractive actors but how do they advertise that? Do they put out an ad like &quot;hey I need someone butt ugly&quot; and people are like &quot;hey that&#39;s me!&quot;. How do you cast someone to an ugly role without being like &quot;wow you&#39;re hideous, you&#39;re perfect for this&quot;.</p>\n\n<p>Bonus question: how do they find people in general? I&#39;ve never seen an advertisement for a movie or show. Is there a secret society specifically for actors?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/nels3k/how_do_they_find_ugly_people_for_movies/",
  "subreddit": "NoStupidQuestions",
  "id": "nels3k",
  "is_self": true,
  "media": null,
  "is_video": false
}