{
  "author": "PennyStockWorth",
  "the_new_excerpt": "I’ll keep it simple. As of now the only way Russians can buy spce is from the St\nPetersburg exchange. St Petersburg is known to buy company stocks and re-sell\nthem without the permission of the company…\n\nApril 2018: “Under Russian securities laws, a Russian stock exchange can\nunilaterally admit…",
  "original_created_utc": 1622212926,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "シンプルに考えます。今のところ、ロシア人がspceを購入できるのは、サンクトペテルブルクの取引所からのみです。\nPetersburgの取引所です。サンクトペテルブルクは会社の株を買って、会社の許可なく再販することで知られています。\n会社の許可なく再販することで知られています...。\n\n2018年4月には \"ロシアの証券法では、ロシアの証券取引所が\n一方的に認めることができる...",
      "title": "SPCE - 来週、新しい取引所で"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我就简单说说吧。到目前为止，俄罗斯人可以购买Spce的唯一途径是来自St.\n彼得堡交易所。众所周知，圣彼得堡购买公司股票并在未经公司许可的情况下重新出售\n他们没有得到公司的许可就重新出售......\n\n2018年4月。\"根据俄罗斯证券法，俄罗斯证券交易所可以\n单方面承认...",
      "title": "SPCE--下周在新的交易所"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我就簡單說說吧。到目前爲止，俄羅斯人可以購買Spce的唯一途徑是來自St.\n彼得堡交易所。衆所周知，聖彼得堡購買公司股票並在未經公司許可的情況下重新出售\n他們沒有得到公司的許可就重新出售......\n\n2018年4月。\"根據俄羅斯證券法，俄羅斯證券交易所可以\n單方面承認...",
      "title": "SPCE--下週在新的交易所"
    }
  ],
  "title": "SPCE - next week in new exchange",
  "created_utc": 1622226042,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ll keep it simple. \nAs of now the only way Russians can buy spce is from the St Petersburg exchange. St Petersburg is known to buy company stocks and re-sell them without the permission of the company… </p>\n\n<p>April 2018: \n“Under Russian securities laws, a Russian stock exchange can unilaterally admit foreign securities to trading without the consent of the issuer of such securities. In the last several years, the St. Petersburg Stock Exchange admitted securities of a number of foreign companies to trading in a similar fashion.”</p>\n\n<p>So big investors don’t trade there for that reason.. they could be forced to sell their shares, and when they buy shares they have to pay “extra” on them. Our Russian friends always complain about the stock price, when they try to buy we post one number… they see another “higher to buy” lower to sell etc… because of a “delay”.</p>\n\n<p>Anyways, if you noticed during the flight many Russian investors attended the after party of SPCE. Then days later SPCE announced they’ll officially list in the Moscow exchange. </p>\n\n<p>Is this a coincidence? No. Russian investors are interested in this company, next week we will see “fresh” money buying shares and holding them. </p>\n\n<p>We will see a difference, just watch!</p>\n</div><!-- SC_ON -->",
  "score": 82,
  "permalink": "/r/stocks/comments/nmzbs7/spce_next_week_in_new_exchange/",
  "subreddit": "stocks",
  "id": "nmzbs7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804300247
}