{
  "author": "stephend9",
  "original_created_utc": 1636155857,
  "title": "If BTC was sent to an address before it was generated, could a newly created account have BTC from the start?",
  "created_utc": 1636195228,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was daydreaming about a person 50 years from now that is gonna generate a new wallet and freak out when they realize they won the fucking jackpot!</p>\n\n<p>How likely is this to happen? Has it ever happened yet?</p>\n\n<p>Satoshi said “Lost coins only make everyone else&#39;s coins worth slightly more. Think of it as a donation to everyone.” Does that mean that when you accidentally sent bitcoin to a non-existent address you just donated to the future bitcoin billionaires lottery?</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/Bitcoin/comments/qnns0g/if_btc_was_sent_to_an_address_before_it_was/",
  "subreddit": "Bitcoin",
  "id": "qnns0g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was daydreaming about a person 50 years from now that is gonna generate a new\nwallet and freak out when they realize they won the fucking jackpot!\n\nHow likely is this to happen? Has it ever happened yet?\n\nSatoshi said “Lost coins only make everyone else's coins worth slightly more.\nThink of it as…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今から50年後の人が、新しい財布を作って、大当たりしたことに気付いて大騒ぎする姿を夢見ていました。\n50年後の人が新しい財布を作って、大当たりしたことに気づいてパニックになることを想像していました。\n\nこのようなことが起こる可能性はどのくらいありますか？今までに起こったことはありますか？\n\nサトシは「コインを失っても、他の人のコインの価値が少し上がるだけだ。\nそう考えると...。",
      "title": "BTCが生成される前にアドレスに送られた場合、新しく作られたアカウントは最初からBTCを持つことができるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在做白日梦，想象着50年后的今天，一个人将产生一个新的\n当他们意识到自己赢得了该死的大奖时，他们会抓狂！这有多大可能发生？\n\n这种情况发生的可能性有多大？它曾经发生过吗？\n\n中本聪说：\"丢失的硬币只会让其他人的硬币更有价值。\n把它看成是...",
      "title": "如果BTC在生成之前就被发送到一个地址，那么一个新创建的账户能否从一开始就拥有BTC？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在做白日夢，想象着50年後的今天，一個人將產生一個新的\n當他們意識到自己贏得了該死的大獎時，他們會抓狂！這有多大可能發生？\n\n這種情況發生的可能性有多大？它曾經發生過嗎？\n\n中本聰說：\"丟失的硬幣只會讓其他人的硬幣更有價值。\n把它看成是...",
      "title": "如果BTC在生成之前就被髮送到一個地址，那麼一個新創建的賬戶能否從一開始就擁有BTC？"
    }
  ]
}