{
  "author": "greenappletree",
  "original_created_utc": 1658938453,
  "title": "Too many rumors and fear mongering: Coinbase is a solid company.",
  "created_utc": 1658980312,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;There is just so much misinformation here and fear mongering I thought I set the record about coinbase.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Yes SEC is formally investigating alleged insider trading BUT is specific  against an ex-Coinbase product manager and two other people, NOT coinbase itself.&lt;/li&gt;\n&lt;li&gt;Yes, there are confirmed sources that SEC filed a complaint claiming that nine of the 25 tokens allegedly traded were securities BUT this is not an investigation at coinbase itself, like they are cooking the books.&lt;/li&gt;\n&lt;li&gt;coinbase in fact has historically cooperated with SEC even going so far as to withdraw their proposal for lending, and that is another point -- they do not lend assets so unlike celcius or voyager they are not leveraged.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;On to the important stuff, cash flow. This company is making money hand over fist. Here is snap shot of their revenues.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/336ifr4iw4e91.png?width=2183&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=e2b26e2d9b94623cb99a157cc1caa5b0dd0b2f25\"&gt;https://preview.redd.it/336ifr4iw4e91.png?width=2183&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=e2b26e2d9b94623cb99a157cc1caa5b0dd0b2f25&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;revenue alone in 2021 is about 8 Billion and Gross profit 6.5 Billion.  Yes revenue is expected to drop but is due in part to the entire cryptomarket at large. In fact I argue that there is a some crazy opportunity here to make money in their stock when the crypto market get back on track but that is neither here or there.&lt;/p&gt;\n\n&lt;p&gt;TLDR;&lt;/p&gt;\n\n&lt;p&gt;Bottom line is coinbase has solid billion dollar revenue streams and does not lend or trade future contracts. Historically they have complied with SEC in almost every way and is publicly traded with solid documentations.&lt;/p&gt;\n\n&lt;p&gt;Can they go copout as well, of course, but unlikely. Should you move your coins?  I personally think to at least have a big portion in a non custodial is a good idea BUT has nothing to do with coinbase.  Honestly some folks are better off with assets in a trust worthy CEX.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 315,
  "permalink": "/r/CryptoCurrency/comments/w9iv0z/too_many_rumors_and_fear_mongering_coinbase_is_a/",
  "subreddit": "CryptoCurrency",
  "id": "w9iv0z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "There is just so much misinformation here and fear mongering I thought I set the\nrecord about coinbase.\n\n\n\n * Yes SEC is formally investigating alleged insider trading BUT is specific\n   against an ex-Coinbase product manager and two other people, NOT coinbase\n   itself.\n * Yes, there are confirmed…"
}