{
  "author": "NaiwennFr",
  "the_new_excerpt": "Anyone who invests in crypto, whether an old holder or a day treader, has a\nvested interest in the democratization of crypto.\n\nThis implies that every day there will be new converts who will need to learn,\nwho will have questions answered a thousand times, who will make mistakes a\nthousand times…",
  "original_created_utc": 1618824402,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号に投資している人は、昔からの保有者であろうと日帰りの参加者であろうと、誰でも既得権を持っています。\n暗号の民主化に既得権がある。\n\nこれは、毎日、学ぶ必要のある新しい変換者が出てくることを意味します。\n質問に何度も答えてもらい、何度も間違いを犯す...。\n千回も...",
      "title": "初心者に失礼なことをしても頭が良くなるわけではなく、ただのアホになるだけです"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "任何一个投资加密货币的人，无论是老持有者还是日踩者，都有一个\n在加密技术的民主化中，既得利益。\n\n这意味着，每天都会有新的皈依者需要学习。\n千问万答，一错再错\n一千次...",
      "title": "对新手无礼并不能让你变得聪明，只会让你变成一个混蛋"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "任何一個投資加密貨幣的人，無論是老持有者還是日踩者，都有一個\n在加密技術的民主化中，既得利益。\n\n這意味着，每天都會有新的皈依者需要學習。\n千問萬答，一錯再錯\n一千次...",
      "title": "對新手無禮並不能讓你變得聰明，只會讓你變成一個混蛋"
    }
  ],
  "title": "Being rude to newbies don't make you smart, it only makes you an assh*le",
  "created_utc": 1618832072,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Anyone who invests in crypto, whether an old holder or a day treader, has a vested interest in the democratization of crypto.</p>\n\n<p>This implies that every day there will be new converts who will need to learn, who will have questions answered a thousand times, who will make mistakes a thousand times made etc.</p>\n\n<p>To treat with condescension, with rudeness, with that stinking humor of &quot;sir I know everything&quot; is not a sign of intelligence: you are just a worthless human unable to rejoice that another human is entering a field that you master.</p>\n\n<p>That you are bitter, it&#39;s sad and pathetic, but at the limit we can understand: in this case keep malicious comments for you. If what you said isn&#39;t going to help anyone, stay silent.</p>\n\n<p>Here it was a little rant because I&#39;m tired of seeing &quot;old crypto investors&quot; allowing themselves toxic comments that do nothing good to anyone, with the sole aim of satisfying their twisted egos online.</p>\n\n<p>&#x200B;</p>\n\n<p>And welcome to all NEWBIES  : D</p>\n</div><!-- SC_ON -->",
  "score": 17157,
  "permalink": "/r/CryptoCurrency/comments/mtwvax/being_rude_to_newbies_dont_make_you_smart_it_only/",
  "subreddit": "CryptoCurrency",
  "id": "mtwvax",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171521470
}