{
  "author": "jazzhands1",
  "original_created_utc": 1624369376,
  "title": "People are finally realizing what “Only invest what you can afford to lose” really means",
  "created_utc": 1624411904,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>“Only invest what you can afford to lose” is said so much that it often gets lost in the noise. </p>\n\n<p>But this is it. This point in time is where people are seeing that their initial investment is as good as gone, at least for a while. </p>\n\n<p>If you put money in crypto and you now can’t afford something you need, you put more into the market than you should have. That was a bad choice, but you can’t change the past. Instead, put your control in your future. </p>\n\n<p>What does that mean? It could mean you need to build up your emergency fund. It could mean you need to stop investing in crypto entirely. </p>\n\n<p>It likely means that you’re a gambler. You made a gamble with crypto and you’re down. Probably by a lot. </p>\n\n<p>PLEASE take this time to understand what you did (spent way too much money) and why you did it (you were dreaming of multiplying your dollars. </p>\n\n<p>Then, if you’re determined to continue investing, make a budget. Figure out how much money you need to live so that all your needs are met and your obligations are paid. Don’t forget to include those less-necessary expenses that you’re not willing to give up. </p>\n\n<p>Find extra money or make sacrifices, but DON’T EVER COUNT ON THAT INVESTED MONEY COMING BACK INTO YOUR BANK ACCOUNT.</p>\n</div><!-- SC_ON -->",
  "score": 161,
  "permalink": "/r/CryptoCurrency/comments/o5ngue/people_are_finally_realizing_what_only_invest/",
  "subreddit": "CryptoCurrency",
  "id": "o5ngue",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "“Only invest what you can afford to lose” is said so much that it often gets\nlost in the noise.\n\nBut this is it. This point in time is where people are seeing that their initial\ninvestment is as good as gone, at least for a while.\n\nIf you put money in crypto and you now can’t afford something you…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "\"Only invest what you can afford to lose \"という言葉は、あまりにも多く語られているため、しばしば雑音に紛れてしまいます。\nしかし、これは\n\nしかし、これはその通りです。この時点で、人々は初期投資がなくなったも同然であることを確認しています。\nこの時点では、少なくともしばらくの間は、最初の投資はなくなったも同然だということがわかっています。\n\nもしあなたが暗号にお金を入れて、今は何かを買う余裕がないとしたら......。",
      "title": "失う可能性のあるものだけを投資する」という意味がようやく理解されてきました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "\"只投资你能承受的损失 \"这句话说得太多了，以至于经常被淹没在喧嚣之中。\n丢失在噪音中。\n\n但现在就是这样。在这个时间点上，人们看到他们最初的\n至少在一段时间内，他们的初始投资就像消失了一样。\n\n如果你把钱放在加密货币中，而你现在买不起你的东西，那么你就会被淘汰。",
      "title": "人们终于意识到 \"只投资你能承受的损失 \"的真正含义。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "\"只投資你能承受的損失 \"這句話說得太多了，以至於經常被淹沒在喧囂之中。\n丟失在噪音中。\n\n但現在就是這樣。在這個時間點上，人們看到他們最初的\n至少在一段時間內，他們的初始投資就像消失了一樣。\n\n如果你把錢放在加密貨幣中，而你現在買不起你的東西，那麼你就會被淘汰。",
      "title": "人們終於意識到 \"只投資你能承受的損失 \"的真正含義。"
    }
  ]
}