{
  "author": "BackOnTop45",
  "original_created_utc": 1637053333,
  "title": "An ATM gave me too much money, wtf do I do, if anything?",
  "created_utc": 1637063798,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Late at night (1am) I remembered I needed to pay a friend $60 cash for some work he did, by the next morning. I figured I go hit up the ATM before I go to bed instead of having to do it in the morning. </p>\n\n<p>I go to the ATM, it&#39;s one of those outside ATMs. There&#39;s no one around, it&#39;s 1am on a Monday and dead quiet. Also cold af. I make the withdrawal for $60 and it spits out $90 (in all $10 bills too, which is strange because they usually give $20s).</p>\n\n<p>I counted it over more than twice. Yup, that&#39;s $90 all right. I check my account on my phone, and it says only $60 was withdrawn.</p>\n\n<p>......out of curiosity I do it again, to see what would happen. Same amount, $60. But the second time it gave me the correct amount.</p>\n\n<p>I went home. Now here I sit $30 richer.</p>\n\n<p>I know I&#39;m not supposed to keep it but... there was realistically nothing I could do at the moment. It was 1am, an outside ATM, the adjacent business was closed and no one around.</p>\n</div><!-- SC_ON -->",
  "score": 118,
  "permalink": "/r/NoStupidQuestions/comments/qv3nsp/an_atm_gave_me_too_much_money_wtf_do_i_do_if/",
  "subreddit": "NoStupidQuestions",
  "id": "qv3nsp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Late at night (1am) I remembered I needed to pay a friend $60 cash for some work\nhe did, by the next morning. I figured I go hit up the ATM before I go to bed\ninstead of having to do it in the morning.\n\nI go to the ATM, it's one of those outside ATMs. There's no one around, it's 1am\non a Monday and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "夜遅く（午前1時）、友人がやってくれた仕事の報酬として60ドルの現金を翌朝までに支払わなければならないことを思い出しました。\n翌日の朝までに支払わなければならないことを思い出した。朝になってからではなく、寝る前にATMに行ってみようと思いました。\n寝る前にATMに行ってみようと思いました。\n\nATMに行ってみると、そこは外にあるATMの一つでした。周りには誰もいないし、月曜日の午前1時だし\n月曜の午前1時だし...。",
      "title": "ATMでお金が多すぎて、どうしたらいいでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "深夜（凌晨1点），我想起我需要为一个朋友的工作支付60美元现金。\n他做的一些工作，到第二天早上。我想我应该在睡觉前去ATM机上取钱\n而不是在早上做这件事。\n\n我走到自动取款机前，那是一种外面的自动取款机。周围没有人，现在是星期一的凌晨一点。\n在一个星期一和...",
      "title": "自动取款机给了我太多的钱，如果有的话，我应该怎么做？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "深夜（凌晨1點），我想起我需要爲一個朋友的工作支付60美元現金。\n他做的一些工作，到第二天早上。我想我應該在睡覺前去ATM機上取錢\n而不是在早上做這件事。\n\n我走到自動取款機前，那是一種外面的自動取款機。周圍沒有人，現在是星期一的凌晨一點。\n在一個星期一和...",
      "title": "自動取款機給了我太多的錢，如果有的話，我應該怎麼做？"
    }
  ]
}