{
  "author": "SexyYear",
  "the_new_excerpt": "https://github.com/DidierRLopes/GamestonkTerminal\nHey all,\n\n2 months ago I made a terminal that I had been working on my spare time, to help\nme on my stock research, open-source.\n\nThe motto:\nGamestonk Terminal provides a modern Python-based integrated environment for\ninvestment research, that allows…",
  "original_created_utc": 1619203661,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "https://github.com/DidierRLopes/GamestonkTerminal\n皆さん、こんにちは。\n\n2ヶ月前、私は自分の株の研究を助けるために、空き時間に作業していた端末をオープンソースにしました。\nオープンソースにしました。\n\nモットーは\nGamestonk Terminalは、Pythonベースのモダンな投資研究用統合環境を提供します。\n投資調査のための近代的な統合環境を提供します...",
      "title": "Bloomberg Terminalの次は、Gamestonk Terminalです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "https://github.com/DidierRLopes/GamestonkTerminal\n大家好。\n\n两个月前，我做了一个终端，我一直在利用业余时间工作，以帮助我的股票研究。\n我的股票研究，开源的。\n\n的口号。\nGamestonk终端提供了一个基于Python的现代集成环境，用于\n投资研究，它允许...",
      "title": "挪开彭博终端，来了Gamestonk终端"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "https://github.com/DidierRLopes/GamestonkTerminal\n大家好。\n\n兩個月前，我做了一個終端，我一直在利用業餘時間工作，以幫助我的股票研究。\n我的股票研究，開源的。\n\n的口號。\nGamestonk終端提供了一個基於Python的現代集成環境，用於\n投資研究，它允許...",
      "title": "挪開彭博終端，來了Gamestonk終端"
    }
  ],
  "title": "Move over Bloomberg Terminal, here comes Gamestonk Terminal",
  "created_utc": 1619207120,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://github.com/DidierRLopes/GamestonkTerminal\">https://github.com/DidierRLopes/GamestonkTerminal</a><br/>\nHey all,</p>\n\n<p>2 months ago I made a terminal that I had been working on my spare time, to help me on my stock research, open-source.</p>\n\n<p><strong>The motto:</strong><br/>\nGamestonk Terminal provides a modern Python-based integrated environment for investment research, that allows the average joe retail trader to leverage state-of-the-art Data Science and Machine Learning technologies. As a modern Python-based environment, Gamestonk Terminal opens access to numerous Python data libraries in Data Science (Pandas, Numpy, Scipy, Jupyter), Machine Learning (Pytorch, Tensorflow, Sklearn, Flair), and Data Acquisition (Beautiful Soup, and numerous third-party APIs).</p>\n\n<p>As of today, and thanks to all your help and the traction created around it, the terminal is looking better than ever. Now it&#39;s no longer only me taking care of the repo, but also 2 other experienced devs (thanks <a href=\"/u/hbar340\">u/hbar340</a>), who are adding features on a daily basis and increasing the robustness of the codebase. Feel free to wander through the FEATURES page to see what you would get out of this tool!</p>\n\n<p>If some of you thought it was amazing 2 months ago, you won&#39;t believe what it looks like now. You can check out the ROADMAP for all the features that have been added since.</p>\n\n<p>As always feedback is appreciated, and contributions even more so!</p>\n\n<p>Let’s try to reduce the gap between the amount of information that the Hedge Funds have access to in comparison with the usual retail trader.</p>\n\n<p>Bloomberg Terminal, we’re coming for you.</p>\n</div><!-- SC_ON -->",
  "score": 1511,
  "permalink": "/r/stocks/comments/mx27u0/move_over_bloomberg_terminal_here_comes_gamestonk/",
  "subreddit": "stocks",
  "id": "mx27u0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776214689
}