{
  "author": "slvbtc",
  "original_created_utc": 1641315269,
  "title": "Many experts have started predicting two or three more countries will make Bitcoin legal tender this year in 2022. Here is why I believe Dubai and the UAE will be next.",
  "created_utc": 1641335841,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Dubai has to be the next top contender for making Bitcoin legal tender. Here are a few reasons I could think of as to why.&lt;/p&gt;\n\n&lt;p&gt;1) Their currency is stuck pegged to the US dollar which with inflation rising is horrible for them, they need an alternative to use along side their existing currency.&lt;/p&gt;\n\n&lt;p&gt;2) They have no capital gains tax or income taxes so no friction in terms of adopting Bitcoin. They are not losing any tax revenue by making it legal tender.&lt;/p&gt;\n\n&lt;p&gt;3) Dubai loves PR and marketing itself and this would be the best PR stunt they could possibly do. The entire world would be talking about them.&lt;/p&gt;\n\n&lt;p&gt;4) Their population is 95% immigrant expats, and of those expats most send remittances home to their families overseas, Bitcoin would make remitting money far easier for their residents and their residents families.&lt;/p&gt;\n\n&lt;p&gt;5) Dubai is a tourism based economy so allowing tourists to travel there without having to worry about cash or travel cards or currency exchange desks or credit cards would make life easier for tourists who would need nothing but a lightning wallet to be able to pay for everything in the country.&lt;/p&gt;\n\n&lt;p&gt;6) Dubai has proclaimed themselves as being the city of the world so they should then adopt the worlds one truly global currency.&lt;/p&gt;\n\n&lt;p&gt;7) They have an efficient government that could roll out lightning wallet support for merchants and residents extremely fast. &lt;/p&gt;\n\n&lt;p&gt;8) Dubai wants to be the worlds most futuristic city so they should therefore adopt the worlds most futuristic currency.&lt;/p&gt;\n\n&lt;p&gt;9) Making Bitcoin legal tender would attract the worlds fintech entrepreneurs and they want Dubai to become a technology hub where businesses headqarter their operations.&lt;/p&gt;\n\n&lt;p&gt;10) Their Sovereign Wealth Fund already invests in Bitcoin and the crypto ecosystem.&lt;/p&gt;\n\n&lt;p&gt;11) Solar powered miners in the middle of the desert with sun 360 days of the year could be a fantastic revenue generator for their government.&lt;/p&gt;\n\n&lt;p&gt;12) Dubai has ubiquitous usage of wifi and 4G data everywhere and every single resident has a smartphone so there&amp;#39;s no technological barrier to adoption.&lt;/p&gt;\n\n&lt;p&gt;13) Bitcoin as legal tender would attract the crypto rich crowd looking for a pro Bitcoin country to live in, and Dubai always wants more wealthy residents to move there.&lt;/p&gt;\n\n&lt;p&gt;14) Dubai has a culture that loves Gold meaning they have a culture that truly appreciates sound money principles, so bitcoin fits in perfectly with their existing cultural ideals.&lt;/p&gt;\n\n&lt;p&gt;15) Dubai has a small and extremely efficient government which they are always looking to make even more efficient and more automated. Bitcoin allows instant money flows between all government departments and staff in a programmatic manner.&lt;/p&gt;\n\n&lt;p&gt;16) They have a value added tax and VAT collection could be completely automated with Bitcoin. Merchant terminals could be programmed to automatically send VAT to the government in real time as each transaction happens, effectively automating tax collection making life far easier for both the government and businesses.&lt;/p&gt;\n\n&lt;p&gt;17) Dubai loves being the first to adopt new tech and they take pride in doing everything bigger and better than anyone else. The same will be true of Bitcoin.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think Dubai would let this opportunity pass them up while places like El Salvador and other central and south American countries take all the benefits of tourism immigration and business creation. If Dubai doesnt make Bitcoin legal tender this year they are letting other countries get a huge head start on them.&lt;/p&gt;\n\n&lt;p&gt;I believe for all these reasons and more Dubai will announce bitcoin as legal tender before the end of 2022.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 358,
  "permalink": "/r/Bitcoin/comments/rvyxw9/many_experts_have_started_predicting_two_or_three/",
  "subreddit": "Bitcoin",
  "id": "rvyxw9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Dubai has to be the next top contender for making Bitcoin legal tender. Here are\na few reasons I could think of as to why.\n\n1) Their currency is stuck pegged to the US dollar which with inflation rising\nis horrible for them, they need an alternative to use along side their existing\ncurrency.\n\n2)…"
}