{
  "author": "oneeighthirish",
  "original_created_utc": 1647018027,
  "title": "The American stereotype of the \"wildly gesticulating Italian\" is sometimes claimed to reflect the reality that Italians historically used gestures to communicate across dialects, and adapted this practice when immigrating to the USA. Is this true? Is historical body language well understood?",
  "created_utc": 1647069893,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I suppose that last question could be better phrased as &amp;quot;Is historical body language well understood in comparison to historical language?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I also forget where I&amp;#39;ve heard the claim that Italians used gestures to communicate across dialects, but I remember that this was explained as arising in the context of the many disparate Italian states of the Renaissance and Early Modern Period.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/tbuk5o/the_american_stereotype_of_the_wildly/",
  "subreddit": "AskHistorians",
  "id": "tbuk5o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I suppose that last question could be better phrased as \"Is historical body\nlanguage well understood in comparison to historical language?\"\n\nI also forget where I've heard the claim that Italians used gestures to\ncommunicate across dialects, but I remember that this was explained as arising\nin the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最後の質問は、「歴史的な身体はどうなっているのか」と言った方がいいかもしれません。\nという疑問があります。\n\nまた、イタリア人が身振り手振りを使っていたという主張をどこで聞いたか忘れてしまいましたが\n方言の違いを超えてのコミュニケーションですが、このような説明があったように記憶しています。\nで",
      "title": "アメリカでは「身振り手振りの多いイタリア人」というステレオタイプがあるが、これはイタリア人が歴史的に方言を超えてコミュニケーションをとるために身振り手振りを使っており、アメリカに移住する際にその習慣を適応させたという事実を反映していると主張されることがある。これは本当だろうか？歴史的なボディランゲージはよく理解されているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想最后一个问题可以更好地表述为：\"与历史上的身体语言相比，历史上的身体语言是否被很好地理解？\n语言与历史语言相比，是否被很好地理解？\"\n\n我也忘了我在哪里听到过意大利人用手势来交流的说法\n沟通的说法，但我记得这被解释为产生于\n在......。",
      "title": "美国人对 \"疯狂打手势的意大利人 \"的刻板印象有时被声称反映了这样一个现实：意大利人在历史上使用手势进行跨方言交流，并在移民到美国时适应了这种做法。这是真的吗？历史上的肢体语言是否被很好地理解？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想最後一個問題可以更好地表述爲：\"與歷史上的身體語言相比，歷史上的身體語言是否被很好地理解？\n語言與歷史語言相比，是否被很好地理解？\"\n\n我也忘了我在哪裏聽到過意大利人用手勢來交流的說法\n溝通的說法，但我記得這被解釋爲產生於\n在......。",
      "title": "美國人對 \"瘋狂打手勢的意大利人 \"的刻板印象有時被聲稱反映了這樣一個現實：意大利人在歷史上使用手勢進行跨方言交流，並在移民到美國時適應了這種做法。這是真的嗎？歷史上的肢體語言是否被很好地理解？"
    }
  ]
}