{
  "author": "taylortailss",
  "original_created_utc": 1659490997,
  "title": "Is it weird that, as an adult, I buy kids meals when stopping at the drive thru?",
  "created_utc": 1659536239,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello everyone, I hope you&amp;#39;re doing well. &lt;/p&gt;\n\n&lt;p&gt;I try my best to avoid hitting the drive thru as most options aren&amp;#39;t too healthy. However, due to some medical conditions, I can&amp;#39;t eat much food in one sitting. I started buying kids meals simply for the smaller portions, but now, I save the toys for my friends with kids. I always have a toy from some franchise that a kiddo loves to get, even if its just a silly plastic ball or something like that. The kids normally are thankful and like their small gift, some don&amp;#39;t seem to care either way, but I hope this whole thing isn&amp;#39;t weird or odd in any way?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 108,
  "permalink": "/r/TooAfraidToAsk/comments/wethlo/is_it_weird_that_as_an_adult_i_buy_kids_meals/",
  "subreddit": "TooAfraidToAsk",
  "id": "wethlo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hello everyone, I hope you're doing well.\n\nI try my best to avoid hitting the drive thru as most options aren't too\nhealthy. However, due to some medical conditions, I can't eat much food in one\nsitting. I started buying kids meals simply for the smaller portions, but now, I\nsave the toys for my…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さんこんにちは、お元気でしょうか。\n\nドライブスルーはあまり健康的でないものが多いので、なるべく避けようと思っています。\nドライブスルーは極力避けています。しかし、私はいくつかの病気のために、一度に多くの食べ物を食べることができません。\n一度にたくさんは食べられません。私は単に小さい部分のために子供用の食事を買い始めたが、今、私は、私のためにおもちゃを保存します。\nおもちゃは私のために取っておく...",
      "title": "ドライブスルーに立ち寄る際、大人である私が子供用の食事を買うのは変でしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好，我希望你们过得很好。\n\n我尽力避免去开车的地方，因为大多数选择都不太健康。\n健康。然而，由于一些医疗条件，我不能一次吃很多食物。\n饭。我开始购买儿童餐，只是因为其份量较少，但现在，我\n但现在，我把玩具留给了我的朋友。",
      "title": "作为一个成年人，我在开车时买儿童餐，这很奇怪吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好，我希望你們過得很好。\n\n我盡力避免去開車的地方，因爲大多數選擇都不太健康。\n健康。然而，由於一些醫療條件，我不能一次喫很多食物。\n飯。我開始購買兒童餐，只是因爲其份量較少，但現在，我\n但現在，我把玩具留給了我的朋友。",
      "title": "作爲一個成年人，我在開車時買兒童餐，這很奇怪嗎？"
    }
  ]
}