{
  "author": "jed_dowling",
  "original_created_utc": 1628343686,
  "title": "I don't care what coin - if you are making a profit, good for you",
  "created_utc": 1628362183,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Sometimes we can all be a little judgemental about what coins people have invested in when they make a profit. Can we stop that? </p>\n\n<p>The purpose of all of us investing into crypto in the first place is to make our lives easier. If someone has invested in a coin that you think is shit but manages to make profits that help them achieve this, good for them. If they lose money out of it, we shouldn&#39;t take the opportunity to rub it in - the loss of their funds will do that.</p>\n\n<p>We need to accept that their gain is not our loss. If you have done the research and invested in good projects, your portfolio will reward you in good time as well.</p>\n</div><!-- SC_ON -->",
  "score": 218,
  "permalink": "/r/CryptoCurrency/comments/oztgs1/i_dont_care_what_coin_if_you_are_making_a_profit/",
  "subreddit": "CryptoCurrency",
  "id": "oztgs1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Sometimes we can all be a little judgemental about what coins people have\ninvested in when they make a profit. Can we stop that?\n\nThe purpose of all of us investing into crypto in the first place is to make our\nlives easier. If someone has invested in a coin that you think is shit but\nmanages to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "人が利益を上げるために投資したコインについては、少し判断に迷うことがあります。\n儲かったときに、どんなコインに投資したかを判断してしまうことがあります。それを止めることはできませんか？\n\nそもそも私たちが暗号に投資する目的は、自分の生活を楽にするためです。\n生活を楽にするためです。もし誰かが、あなたがクソだと思っているコインに投資していたとしても\n儲かっていたら...",
      "title": "コインが何であろうと、利益が出ていれば良いのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有时，我们都会对人们在赚取利润时投资的硬币有一点判断力。\n当他们赚到钱的时候，我们都会对他们投资的硬币做出一些判断。我们能不能不要这样？\n\n我们所有人投资加密货币的目的首先是为了使我们的\n生活更轻松。如果有人投资了一个你认为是狗屎的币，但\n却能够...",
      "title": "我不在乎什么硬币--如果你有利润，对你有好处。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有時，我們都會對人們在賺取利潤時投資的硬幣有一點判斷力。\n當他們賺到錢的時候，我們都會對他們投資的硬幣做出一些判斷。我們能不能不要這樣？\n\n我們所有人投資加密貨幣的目的首先是爲了使我們的\n生活更輕鬆。如果有人投資了一個你認爲是狗屎的幣，但\n卻能夠...",
      "title": "我不在乎什麼硬幣--如果你有利潤，對你有好處。"
    }
  ]
}