{
  "author": "Cheese4life__",
  "original_created_utc": 1659565722,
  "title": "I was just scammed in the most sophisticated way",
  "created_utc": 1659581534,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I know I&amp;#39;m an idiot, a dumb teen falling for something so stupid, but it&amp;#39;s lesson learned, at at least losing $20 in ether wasnt the end of the world.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m taking a peek at the CoinMarketCap comment section, right under ADA. Just doing some general browsing, until I come across a comment that basically says &amp;quot;woohoo! I invested in a coin that mooned, celebrating by giving away my metamask account with $590 on it&amp;quot;, and the guy follows that with the seed phrase.&lt;/p&gt;\n\n&lt;p&gt;Intrigued, I entered the seed phrase into metamask to find an account with $130 in tether, and $118 in USDC. This seemed too good to be true, I tried to withdraw but of course you need ethereum on the account to pay the gas fees. And conveniently, there was zero ethereum. I sat there thinking about how this could possibly be a scam, I thought &amp;quot;hey maybe no one did a withdraw because there&amp;#39;s no ethereum and they don&amp;#39;t wanna deal with the troubles&amp;quot;, so I look at my KuCoin account and send over $20 in eth to pay the gas fees for tether.&lt;/p&gt;\n\n&lt;p&gt;The eth shows up, I quickly go to withdraw the tether, but as soon as I get to the confirm page, it says I don&amp;#39;t have enough eth to pay for gas fees. And to my semi surprise, the balance of eth went from my sent $20 back to zero.&lt;/p&gt;\n\n&lt;p&gt;Though it might be a bug, no way someone at that exact moment did withdraw. But a quick peek at&lt;a href=\"https://etherscan.io/address/0x103a05a16a8105b6c102bf6a7310fee763641a75\"&gt; etherscan.io&lt;/a&gt; shows that as soon as my funds arrived, they were immediately taken out, likely by a bot. In fact, I&amp;#39;m far from the first one. This account alone was used to scam $200 worth of eth from 6 different people.&lt;/p&gt;\n\n&lt;p&gt;Needless to say I&amp;#39;m sad, but at least the loss wasn&amp;#39;t too dramatic. i’m more sad about just giving the scammer free money. Wisdom is priceless I guess, I feel dumb for falling for that guys scam so easily, but I feel like this is a super next level scam from what I&amp;#39;ve seen. You literally gain access to that guys account, seeing all the funds there, thinking you&amp;#39;re a gas fee away from adding $250 in stable coins to your main trading platform&lt;/p&gt;\n\n&lt;p&gt;Is this scam new? If anyone wants the seedphrase to check out the account I can post it in the comments&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 433,
  "permalink": "/r/CryptoCurrency/comments/wfk2xl/i_was_just_scammed_in_the_most_sophisticated_way/",
  "subreddit": "CryptoCurrency",
  "id": "wfk2xl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I know I'm an idiot, a dumb teen falling for something so stupid, but it's\nlesson learned, at at least losing $20 in ether wasnt the end of the world.\n\nI'm taking a peek at the CoinMarketCap comment section, right under ADA. Just\ndoing some general browsing, until I come across a comment that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "自分が馬鹿で、馬鹿なティーンに引っかかるのは分かっている、でも、それは\n少なくともエーテルで20ドル失ったことは、世界の終わりではありませんでした。\n\nコインマーケットキャップのコメント欄、ADAのすぐ下にあるのを覗いているんだ。ただ\n一般的なブラウジングをしてる あるコメントに出くわした...",
      "title": "私は、最も洗練された方法で詐欺にあっただけです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道我是个白痴，一个傻乎乎的少年被如此愚蠢的事情所吸引，但这是\n但这是一个教训，至少损失20美元的乙醚并不是世界末日。\n\n我正在偷看CoinMarketCap的评论区，就在ADA下面。只是\n做一些一般性的浏览，直到我看到一个评论，...",
      "title": "我只是以最复杂的方式被骗了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道我是個白癡，一個傻乎乎的少年被如此愚蠢的事情所吸引，但這是\n但這是一個教訓，至少損失20美元的乙醚並不是世界末日。\n\n我正在偷看CoinMarketCap的評論區，就在ADA下面。只是\n做一些一般性的瀏覽，直到我看到一個評論，...",
      "title": "我只是以最複雜的方式被騙了"
    }
  ]
}