{
  "author": "mostly_cooperative",
  "original_created_utc": 1624289441,
  "title": "Have any of you successfully come back from being deeply misanthropic?",
  "created_utc": 1624318470,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I should start by saying I can function ok on a day to day basis in society, I don&#39;t live in a cave or never interact with people positively, but I just kind of have a growing, bitter disappointment with humans generally (myself included). Everywhere I turn it seems like I just see weakness, ignorance and selfishness.</p>\n\n<p>I find that all the things I liked about myself and others are slowly draining away. I used to be able to find humor in things, to make an easy effort to be charming and try to connect with others. But it feels like I&#39;ve slid into this hole where I just don&#39;t see anything to love about people any more, they don&#39;t seem worth the effort. I myself don&#39;t feel I&#39;m worth the effort, I don&#39;t see a point any more to &quot;putting myself out there&quot;.</p>\n\n<p>I don&#39;t want to be this jaded, but it doesn&#39;t feel like a choice, it just is how it is. The desire and instinct is there, but my experiences over the years have made me mistrustful of that desire and I guess I kind of see it like a mirage.</p>\n\n<p>Have any of you recovered from a deep hole like this? Like to the point that you genuinely don&#39;t struggle with it any more and find value in relationships again?</p>\n\n<p>EDIT: I appreciate everyone&#39;s replies and sharing their experiences, while I wasn&#39;t expecting any single be all and end all answer that is applicable to everyone, there&#39;s still some good food for thought in there and while I can&#39;t reply to everyone I wanted to show gratitude for people taking the time to answer. It&#39;s helpful to see people&#39;s varied takes and analogies on the issue, which is what I was looking for (outside perspective). Thank you, everyone.</p>\n\n<p>(Except for the guy who DMed me to try pitch Jordan Peterson, who is emblematic of the type of intellectual cowardice and hypocrisy that drove me to be misanthropic in the first place. If you can&#39;t market your beliefs out in the open with everyone else, it may be worth considering why that is.)</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TrueAskReddit/comments/o4xs8x/have_any_of_you_successfully_come_back_from_being/",
  "subreddit": "TrueAskReddit",
  "id": "o4xs8x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I should start by saying I can function ok on a day to day basis in society, I\ndon't live in a cave or never interact with people positively, but I just kind\nof have a growing, bitter disappointment with humans generally (myself\nincluded). Everywhere I turn it seems like I just see weakness,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最初に言っておきますが、私は社会の中で日常的に問題なく機能しています。\n洞窟の中に住んでいるわけでも、人と積極的に交流しないわけでもありません。\nただ、一般的な人間（自分も含めて）に対して、苦い失望感が募っています。\n含む）に苦い失望感を募らせています。) どこに行っても、ただ弱さを見ているだけのように思えて...。",
      "title": "人間嫌いから立ち直った人はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我应该先说，我可以在社会上每天正常运作，我没有住在山洞里，也没有住在家里。\n我没有住在山洞里或从不与人积极互动，但我只是有点\n但我对人类（包括我自己）有一种越来越强烈的、痛苦的失望感。\n包括我自己）。) 无论我在哪里，似乎都能看到弱点，...",
      "title": "你们中是否有人成功地从深深的厌世情绪中恢复过来？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我應該先說，我可以在社會上每天正常運作，我沒有住在山洞裏，也沒有住在家裏。\n我沒有住在山洞裏或從不與人積極互動，但我只是有點\n但我對人類（包括我自己）有一種越來越強烈的、痛苦的失望感。\n包括我自己）。) 無論我在哪裏，似乎都能看到弱點，...",
      "title": "你們中是否有人成功地從深深的厭世情緒中恢復過來？"
    }
  ]
}