{
  "author": "DerrickRoseTackoFell",
  "original_created_utc": 1628876947,
  "title": "My girlfriend’s dad is a banking exec, I told him I’m all in on crypto",
  "created_utc": 1628883251,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>He and I met yesterday. He is a kind and mild mannered guy who comes off as deeply intelligent. I asked him how he felt about decentralized finance and he said it was a risky venture (no surprise from his banking point of view) and anyone putting money into it is a fool.</p>\n\n<p>He seemed disappointed that his daughter’s boyfriend wanted to talk about crypto. For me, crypto has fundamentally changed my life - it has taught me about finance, geopolitics, and that I have the agency to live a life I wasn’t sure was possible. So, when he seemed disappointed, what did I do? I doubled down. I gave an impassioned speech about why cryptocurrency is changing the world and democratizing resources that traditionally only the wealthy had access to. It is giving poor communities a fighting chance and that it is revolutionary and something that is a big part of my investment strategy.</p>\n\n<p>I don’t know what the point of this post is, but I just, idk, he made me feel like a fool of an investor because he either just doesn’t get it or is scared of it and I feel like his view of me has become less favorable in terms of dating his daughter, but I’m going to stand up for what I believe in.</p>\n\n<p>Ramble over.</p>\n</div><!-- SC_ON -->",
  "score": 485,
  "permalink": "/r/CryptoCurrency/comments/p3qayi/my_girlfriends_dad_is_a_banking_exec_i_told_him/",
  "subreddit": "CryptoCurrency",
  "id": "p3qayi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "He and I met yesterday. He is a kind and mild mannered guy who comes off as\ndeeply intelligent. I asked him how he felt about decentralized finance and he\nsaid it was a risky venture (no surprise from his banking point of view) and\nanyone putting money into it is a fool.\n\nHe seemed disappointed that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "彼と私は昨日会った。彼は親切で温和な人で、とても知的な印象を受けました。\n深い知性の持ち主だ。私は彼に、分散型金融についてどう思うか尋ねました。\n彼は、分散型金融はリスクの高い事業であり（彼の銀行観からすれば当然のことだ）、誰もが自分の利益のために\n彼は、分散型金融についてどう思うか聞いてみました。\n\n彼は失望しているようでした。",
      "title": "ガールフレンドの父親は銀行の重役で、私は彼に暗号化に全力を尽くすと言った。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "他和我昨天见过面。他是一个和蔼可亲、举止温和的人，他表现出了\n深具智慧。我问他对去中心化的金融有什么看法，他说\n他说这是一个有风险的冒险（从他的银行观点来看，这并不奇怪）。\n任何把钱投入其中的人都是个傻瓜。\n\n他似乎很失望，因为...",
      "title": "我女朋友的父亲是一名银行执行官，我告诉他我对加密货币有兴趣。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "他和我昨天見過面。他是一個和藹可親、舉止溫和的人，他表現出了\n深具智慧。我問他對去中心化的金融有什麼看法，他說\n他說這是一個有風險的冒險（從他的銀行觀點來看，這並不奇怪）。\n任何把錢投入其中的人都是個傻瓜。\n\n他似乎很失望，因爲...",
      "title": "我女朋友的父親是一名銀行執行官，我告訴他我對加密貨幣有興趣。"
    }
  ]
}