{
  "author": "Clash_My_Clans",
  "the_new_excerpt": "I am from the northeast part of India and with the looming crypto ban i was\nworried since the wedding was to take place on 12 of feb 2021. Due to financial\nproblems at home i thought it is better i sell all my crypto to cover a part of\nthe expenses. Thanks to this bull run and to all of you guys in…",
  "original_created_utc": 1613530445,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我来自印度的东北部，随着加密禁令的逼近，我是。\n由于婚礼是在2021年2月12日举行，所以很担心。由于财政\n家里的问题，我想这是更好的，我卖掉我所有的加密货币，以支付部分的\n的费用。感谢这次牛市，感谢你们在... ...",
      "title": "卖掉了我所有的密码，并让我的妹妹结婚。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我來自印度的東北部，隨着加密禁令的逼近，我是。\n由於婚禮是在2021年2月12日舉行，所以很擔心。由於財政\n家裏的問題，我想這是更好的，我賣掉我所有的加密貨幣，以支付部分的\n的費用。感謝這次牛市，感謝你們在... ...",
      "title": "賣掉了我所有的密碼，並讓我的妹妹結婚。"
    }
  ],
  "title": "Selling all my Crypto and got my Sister married",
  "created_utc": 1613543874,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am from the northeast part of India and with the looming crypto ban i was worried since the wedding was to take place on 12 of feb 2021. Due to financial problems at home i thought it is better i sell all my crypto to cover a part of the expenses. Thanks to this bull run and to all of you guys in this sub for helping and guiding me in my crypto journey. I still have some moons as can be seen.\nThe wedding was a small one but it was an outstanding success.\nI am willing to provide the mods with the photos and date of the wedding in case somebody thinks i am lying to get upvotes. Also as can be seen in my profile i was super busy and was not active in the run up to the wedding. Again thank you crypto.</p>\n</div><!-- SC_ON -->",
  "score": 1530,
  "permalink": "/r/CryptoCurrency/comments/llkce0/selling_all_my_crypto_and_got_my_sister_married/",
  "subreddit": "CryptoCurrency",
  "id": "llkce0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728619146
}