{
  "author": "AngryPirate1033",
  "original_created_utc": 1625419275,
  "title": "The story how I made 100,000$ with a single meme.",
  "created_utc": 1625423587,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I just wanted to share this absurd story that turned my life upside down last week.</p>\n\n<p>I never had any luck with crypto. Always sold too early, bought in on the top, got 70% of my holdings stolen in an exchange hack, lost private keys, made a fat minus just because of taxes, ... God it feels so bad just to write that shit down. But from the posts here I know that the same things happened to a lot of you guys.</p>\n\n<p>&#x200B;</p>\n\n<p>2019:</p>\n\n<p>Here is where the story begins. Back in 2019 John McAfee (for Newcomers: he&#39;s the Elon Musk of 2017-2019) created a token called WHACKD. It was about the Epstein suicide or whatever. I don&#39;t really remember. All I know is that the tokenomics were really funny which grabbed my attention so I took part in the airdrop.</p>\n\n<p>A little later there was a meme contest to promote this coin. Well, and since I love memes and got some photoshop skills I took part ofc. Luckily I was one of the 10 winners who received 1,800,000 WHACKD tokens and that&#39;s about it. The coin never really took off. So I forgot about these tokens in my wallet.</p>\n\n<p>&#x200B;</p>\n\n<p>2021:</p>\n\n<p>Fast forward to June 2021. Little did I know what would happen this month. On 23 June McAfee was found dead in a spanish prison allegedly by suicide. This caused some big waves and therefore the news also reached me. I remembered that I still own these WHACKD tokens by McAfee so I did a little research. This was the moment when things seemed to unfold.</p>\n\n<p>I happened to find out that McAfee created the token to demonstrate that he would never commit suicide and if he did it would mean that powerful people wanted to see him dead. He even got himself a &quot;$WHACKD&quot; tattoo on his arm back in 2019 to demonstrate how serious he was. Furthermore, I found about that people where going totally nuts about the WHACKD token, since it would possibly be linked to McAfee&#39;s Dead man&#39;s switch of 32TB data to expose the government and countless other theories.</p>\n\n<p>I was really excited and rushed to find the token price only to be totally disappointed. It was something like 0.000001$ per token. So basically I owned a shitload of tokens but they were only worth 2$. So I once again forgot about them.</p>\n\n<p>Some days later I saw a tweet with a link to the DEXTools WHACKD price ticker on twitter and though let&#39;s quickly check that out and that was the moment I almost got an heart attack! The token price was at 6c. It turned out that the price of the WHACKD token I checked some days before was some BSC scam copy of the real token, which was of course worthless. Suddenly the 1,800,000 WHACKD tokens in my wallet were worth 100k$. I immediately began to sell 80% of my tokens over the day on Uniswap and with the recent ETH price appreciation I now got little over 100k$ ETH in my wallet.</p>\n\n<p>&#x200B;</p>\n\n<p>Honestly I don&#39;t know what to say but thank you John and may your soul rest in peace. I even might buy back a little since I still think the token is a total moonshot but I also still got 20% of my original tokens left. It would just be totally absurd to write a &quot;How I made 1,000,000$ with a single meme&quot; post. But first off I&#39;m celebrating that after all those years of failures my crypto journey finally paid off. Never give up guys, you will make it.</p>\n</div><!-- SC_ON -->",
  "score": 292,
  "permalink": "/r/CryptoCurrency/comments/odov44/the_story_how_i_made_100000_with_a_single_meme/",
  "subreddit": "CryptoCurrency",
  "id": "odov44",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I just wanted to share this absurd story that turned my life upside down last\nweek.\n\nI never had any luck with crypto. Always sold too early, bought in on the top,\ngot 70% of my holdings stolen in an exchange hack, lost private keys, made a fat\nminus just because of taxes, ... God it feels so bad…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "先週、私の人生をひっくり返したこの不条理な話を紹介したいと思います。\nのです。\n\n私は暗号には全く縁がありませんでした。いつも早く売りすぎて、トップで買っていました。\n取引所のハッキングで保有資産の70％を盗まれたり、秘密鍵を紛失したり、税金のせいで大赤字になったり\n税金のせいでマイナスになったり......。神様......とても嫌な気分です......。",
      "title": "1つのミームで10万円稼いだ話。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我只是想分享这个荒唐的故事，它在上周颠覆了我的生活。\n周颠覆了我的生活。\n\n我在加密货币方面从来没有任何运气。总是过早卖出，在顶部买入。\n在一次交易所黑客攻击中，我持有的70%的股票被盗，丢失了私钥，因为税收而赚了一大笔钱\n只是因为税收而减去了...... 天哪，这感觉太糟糕了...",
      "title": "我是如何通过一个备忘录赚取10万美元的故事。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我只是想分享這個荒唐的故事，它在上週顛覆了我的生活。\n周顛覆了我的生活。\n\n我在加密貨幣方面從來沒有任何運氣。總是過早賣出，在頂部買入。\n在一次交易所黑客攻擊中，我持有的70%的股票被盜，丟失了私鑰，因爲稅收而賺了一大筆錢\n只是因爲稅收而減去了...... 天哪，這感覺太糟糕了...",
      "title": "我是如何通過一個備忘錄賺取10萬美元的故事。"
    }
  ]
}