{
  "author": "lumtheyak",
  "the_new_excerpt": "Ancient Roman politics was dominated by certain families we see bubbling up into\npolitics, often with many branches and sub-families, as it were. What happened\nto them? Did they in any way survive? Did they die out? did they take on new\nnames? Did their political influence just peter out, with the…",
  "original_created_utc": 1617624044,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "古罗马的政治是由某些家族主导的，我们看到的是冒出的家族。\n政治，往往有很多分支和子家族，就像。发生了什么事？\n对他们来说？它们是否以任何方式存活下来？它们是否消亡了？\n名？难道他们的政治影响力就这样平淡无奇了，与...",
      "title": "罗马的贵族家庭怎么了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "古羅馬的政治是由某些家族主導的，我們看到的是冒出的家族。\n政治，往往有很多分支和子家族，就像。發生了什麼事？\n對他們來說？它們是否以任何方式存活下來？它們是否消亡了？\n名？難道他們的政治影響力就這樣平淡無奇了，與...",
      "title": "羅馬的貴族家庭怎麼了？"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "古代ローマの政治は、ある種の家系に支配されていました。\n枝分かれしていることが多いのです。彼らはどうなったか？\n彼らはどうなったのか？彼らは何らかの形で生き残ったのでしょうか？滅びたのか、新しい名前になったのか？\n新しい名前になったのか？彼らの政治的影響力は衰退してしまったのでしょうか。",
      "title": "ローマの貴族はどうなった？"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "古代ローマの政治は、ある種の家系に支配されていました。\n枝分かれしていることが多いのです。彼らはどうなったか？\n彼らはどうなったのか？彼らは何らかの形で生き残ったのでしょうか？滅びたのか、新しい名前になったのか？\n新しい名前になったのか？彼らの政治的影響力は衰退してしまったのでしょうか。",
      "title": "ローマの貴族はどうなった？"
    }
  ],
  "title": "What happened to the aristrocratic families of Rome?",
  "created_utc": 1617636599,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Ancient Roman politics was dominated by certain families we see bubbling up into politics, often with many branches and sub-families, as it were. What happened to them? Did they in any way survive? Did they die out? did they take on new names? Did their political influence just peter out, with the families becoming disolved into the general populace? Did Medieval Italian families ever claim descent from them and did they ever bear strikingly similar names? I would be grateful for any information!</p>\n</div><!-- SC_ON -->",
  "score": 135,
  "permalink": "/r/AskHistorians/comments/mkj091/what_happened_to_the_aristrocratic_families_of/",
  "subreddit": "AskHistorians",
  "id": "mkj091",
  "is_self": true,
  "media": null,
  "is_video": false
}