{
  "author": "notmymain90",
  "original_created_utc": 1650492335,
  "title": "How do I deep clean years of bad oral hygiene?",
  "created_utc": 1650513955,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m so embarrassed but I’ve dealt with depression all my life and I’ve done well with my hygiene but I just couldn’t get myself in the routine to brush my teeth. My mouth is in a bad state, my teeth aren’t bad looking but it’s over all just very dirty. Especially my tongue&lt;/p&gt;\n\n&lt;p&gt;I have a tongue scraper and special toothpaste and mouth wash but it still just isn’t doing too much. I need to just deep clean my mouth so I can get into a good routine, what else can I do? Be kind please this is a big insecurity of mine if you couldn’t tell lol&lt;/p&gt;\n\n&lt;p&gt;Edit: alright I’ll take your advice thank you, it’s embarrassing but it’s the best choice. I’ll book an appointment&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 138,
  "permalink": "/r/TooAfraidToAsk/comments/u87tm6/how_do_i_deep_clean_years_of_bad_oral_hygiene/",
  "subreddit": "TooAfraidToAsk",
  "id": "u87tm6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m so embarrassed but I’ve dealt with depression all my life and I’ve done well\nwith my hygiene but I just couldn’t get myself in the routine to brush my teeth.\nMy mouth is in a bad state, my teeth aren’t bad looking but it’s over all just\nvery dirty. Especially my tongue\n\nI have a tongue scraper…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "恥ずかしいけど、ずっとうつ病とうまく付き合ってきました\n衛生面には気をつけていたのですが、どうしても歯を磨く習慣が身につきませんでした。\n私の口の中はひどい状態で、歯並びは悪くないのですが、全体的にとても汚いです。\nとても汚れています。特に舌が\n\n舌を削る道具は持っているのですが...。",
      "title": "長年の悪い口腔内をディープクリーニングするにはどうしたらいいですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我很尴尬，但我一生都在与抑郁症打交道，我已经做得很好了\n但我就是不能让自己保持刷牙的习惯。\n我的口腔状况很差，我的牙齿看起来并不差，但总的来说就是\n非常脏。特别是我的舌头\n\n我有一个舌头刮刀...",
      "title": "如何深层清洁多年来的不良口腔卫生？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我很尷尬，但我一生都在與抑鬱症打交道，我已經做得很好了\n但我就是不能讓自己保持刷牙的習慣。\n我的口腔狀況很差，我的牙齒看起來並不差，但總的來說就是\n非常髒。特別是我的舌頭\n\n我有一個舌頭刮刀...",
      "title": "如何深層清潔多年來的不良口腔衛生？"
    }
  ]
}