{
  "author": "Odd_Meeting5216",
  "original_created_utc": 1645626282,
  "title": "Reality check: don’t go into Bitcoin expecting to become a millionaire.",
  "created_utc": 1645652284,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;We’ve all seen how the “100k EOY” influencers got rekt as we entered 2022.&lt;/p&gt;\n\n&lt;p&gt;Even still, if Bitcoin reaches 100k that’s only 2x which is super impressive don’t get me wrong, but its not enough to make you a millionaire.&lt;/p&gt;\n\n&lt;p&gt;Most people you see who made this much money in the crypto space basically got lucky investing in start ups that boomed.&lt;/p&gt;\n\n&lt;p&gt;Some end up being scams and rug pulls, other prove to be a great investment.\nA trusted launchpad like Binance or even SolanaPrime since it has insurance backing would decrease those chances of scams a lot though.&lt;/p&gt;\n\n&lt;p&gt;Bottom line is. Bitcoin is a very cool and safe investment. I love it. But if you want fast profits, you’re looking in the wrong place.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 351,
  "permalink": "/r/CryptoCurrency/comments/sziozv/reality_check_dont_go_into_bitcoin_expecting_to/",
  "subreddit": "CryptoCurrency",
  "id": "sziozv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "We’ve all seen how the “100k EOY” influencers got rekt as we entered 2022.\n\nEven still, if Bitcoin reaches 100k that’s only 2x which is super impressive\ndon’t get me wrong, but its not enough to make you a millionaire.\n\nMost people you see who made this much money in the crypto space basically…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2022年に入り、「EOY10万ドル」のインフルエンサーがどのように報われたかを私たちは見てきました。\n\nそれでも、ビットコインが10万ドルに達すると、2倍にしかなりませんが、これはとても素晴らしいことです。\nしかし、それだけでは億万長者にはなれません。\n\n暗号スペースでこれだけのお金を稼いだ人たちのほとんどは、基本的に...",
      "title": "現実の確認：億万長者になることを期待してビットコインに手を出すのはやめましょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们都看到了 \"100k EOY \"的影响者是如何在我们进入2022年时被干掉的。\n\n即使如此，如果比特币达到10万，那也只是2倍，这是非常令人印象深刻的。\n不要误会我的意思，但这还不足以让你成为百万富翁。\n\n你看到的大多数人在加密货币领域赚了这么多钱，基本上...",
      "title": "现实检查：不要指望进入比特币成为一个百万富翁。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們都看到了 \"100k EOY \"的影響者是如何在我們進入2022年時被幹掉的。\n\n即使如此，如果比特幣達到10萬，那也只是2倍，這是非常令人印象深刻的。\n不要誤會我的意思，但這還不足以讓你成爲百萬富翁。\n\n你看到的大多數人在加密貨幣領域賺了這麼多錢，基本上...",
      "title": "現實檢查：不要指望進入比特幣成爲一個百萬富翁。"
    }
  ]
}