{
  "author": "blueblarg",
  "original_created_utc": 1638209108,
  "title": "Black soldiers ordered to guard supply depot so German spies would have no way to infiltrate?",
  "created_utc": 1638234760,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Years ago I heard an anecdote about how during the Battle of the Bulge Patton fixed a problem they were having.  With German spies being about, Patton gave the order to black units to guard supply depots, with orders to shoot any white soldiers that came close.  </p>\n\n<p>A while back I made a post on here asking if anyone had heard of it.  Basically people came up with all sorts of reasons why it couldn&#39;t have happened, and no one had heard the story before, so it was deemed a myth.  </p>\n\n<p>However recently while I was reading up on the 761st tank battalion on wikipedia, a line caught my eye.  </p>\n\n<p><em>During the Battle of the Bulge, German soldiers who had raided American warehouses were reported to have</em> <a href=\"https://en.wikipedia.org/wiki/Operation_Greif\"><em>disguised themselves as Americans</em></a> <em>guarding checkpoints in order to ambush American soldiers. Patton solved this problem by ordering black soldiers, including the 761st, to guard the checkpoints, and gave the order to shoot any white soldiers at the checkpoints who acted suspiciously.</em><a href=\"https://en.wikipedia.org/wiki/761st_Tank_Battalion_(United_States\"><em>[23]</em></a>#cite_note-23)   </p>\n\n<p>Unfortunately the citation leads to a wayback machine archived website that has the beginning part of his story, however not the relevant section.  Is there anyway to find the relevant portion of the interview?  It would be great to shine some light on a small but interesting contribution of African Americans to the war effort.</p>\n</div><!-- SC_ON -->",
  "score": 1608,
  "permalink": "/r/AskHistorians/comments/r51no0/black_soldiers_ordered_to_guard_supply_depot_so/",
  "subreddit": "AskHistorians",
  "id": "r51no0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Years ago I heard an anecdote about how during the Battle of the Bulge Patton\nfixed a problem they were having. With German spies being about, Patton gave the\norder to black units to guard supply depots, with orders to shoot any white\nsoldiers that came close.\n\nA while back I made a post on here…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昔、パットンがバルジの戦いの時に、自分が持っていた問題を解決したという逸話を聞いたことがある。\n問題を解決したという話を聞いたことがあります。ドイツのスパイがいるので、パットンは黒人部隊に補給基地を守るように命令した。\n黒人部隊に補給基地の警備を命じ、近づいてきた白人兵士を撃つように命じた。\n近づいてきた白人兵士を撃てと命令したのです。\n\nしばらく前に、私はここに投稿しました...。",
      "title": "ドイツのスパイが侵入できないように、黒人兵士に補給基地の警備を命じたのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "几年前，我听到一个轶事，说在突出部战役期间，巴顿如何\n解决了他们遇到的一个问题。由于德国间谍到处都是，巴顿下令\n命令黑人部队守卫补给站，并命令他们射杀任何接近的白人士兵。\n靠近的白人士兵。\n\n不久前我在这里发了一个帖子...",
      "title": "黑人士兵被命令守卫补给站，这样德国间谍就没有办法潜入了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "幾年前，我聽到一個軼事，說在突出部戰役期間，巴頓如何\n解決了他們遇到的一個問題。由於德國間諜到處都是，巴頓下令\n命令黑人部隊守衛補給站，並命令他們射殺任何接近的白人士兵。\n靠近的白人士兵。\n\n不久前我在這裏發了一個帖子...",
      "title": "黑人士兵被命令守衛補給站，這樣德國間諜就沒有辦法潛入了？"
    }
  ]
}