{
  "author": "CalzerMalzer",
  "original_created_utc": 1627149449,
  "title": "Does anyone else feel we need more safety nets in crypto before it becomes mainstream?",
  "created_utc": 1627169877,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>By safety nets I&#39;m talking more about when it comes to moving around crypto. As I&#39;m sure a lot of you agree it is quite nerve wrecking sending crypto to different wallets even with test runs, but even myself who I consider pretty tech savvy can fuck up sometimes. Twice now have I sent crypto through wrong networks( they were both tests though) and lost the crypto into the abyss, I feel that if crypto is going to become mainstream the average person needs to be able to be able to make transfers without the risk of losing everything. Does anyone else think we need more safety nets in that regard before crypto can really take off?</p>\n</div><!-- SC_ON -->",
  "score": 158,
  "permalink": "/r/CryptoCurrency/comments/oquvs8/does_anyone_else_feel_we_need_more_safety_nets_in/",
  "subreddit": "CryptoCurrency",
  "id": "oquvs8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "By safety nets I'm talking more about when it comes to moving around crypto. As\nI'm sure a lot of you agree it is quite nerve wrecking sending crypto to\ndifferent wallets even with test runs, but even myself who I consider pretty\ntech savvy can fuck up sometimes. Twice now have I sent crypto through…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "セーフティネットというのは、暗号の移動に関しての話です。として\n多くの方が同意されると思いますが、テストランでも異なるウォレットに暗号を送るのは非常に神経を使います。\nテストをしていても、別のウォレットに暗号を送るのはかなり神経を使います。\nしかし、かなり技術に精通していると思われる私でさえ、時々失敗することがあります。今までに2回、暗号を...",
      "title": "暗号が主流になる前に、もっとセーフティーネットが必要だと思う人はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我所说的安全网更多的是指当涉及到移动加密货币时。因为\n我相信你们中的很多人都同意，将加密货币发送到不同的钱包是很伤脑筋的。\n不同的钱包，即使是测试运行，但即使是我自己，我认为是相当的\n技术专家，有时也会犯错。现在我已经两次将加密货币发送到...",
      "title": "还有人觉得在加密货币成为主流之前，我们需要更多的安全网吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我所說的安全網更多的是指當涉及到移動加密貨幣時。因爲\n我相信你們中的很多人都同意，將加密貨幣發送到不同的錢包是很傷腦筋的。\n不同的錢包，即使是測試運行，但即使是我自己，我認爲是相當的\n技術專家，有時也會犯錯。現在我已經兩次將加密貨幣發送到...",
      "title": "還有人覺得在加密貨幣成爲主流之前，我們需要更多的安全網嗎？"
    }
  ]
}