{
  "author": "apprentice-historian",
  "original_created_utc": 1644486022,
  "title": "To what extent were ethnic differences between Gaelic Highlanders and Anglophone Lowlanders motivating factors during the Highland Clearances? Can they be compared to the Ulster Plantations?",
  "created_utc": 1644535337,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Whenever I see discussion about the Highland Clearances online, the focus is usually on countering claims of English colonisation by reference to economic factors of the Clearances, and the Scot on the Scot nature of the evictions. &lt;/p&gt;\n\n&lt;p&gt;However there never seems to be reference to split between the Gaelic speaking Highlanders on the receiving end of the evictions, and English/Scots speaking Lowlanders on the delivering end, to mention nothing of the role of Scottish Lowlanders in the colonisation of Gaelic Ulster in the previous century.&lt;/p&gt;\n\n&lt;p&gt;As an Irishman, I&amp;#39;ll readily admit being both biased and uninformed on the topic. But on a purely surface level, its hard not to see similarities between Highland Clearances and the Ulster Plantations. Its hardly a coincidence that the Gaelic speaking Highlands were the only other area in Europe to suffer famine as a result of the potato blight?&lt;/p&gt;\n\n&lt;p&gt;Even if there was no overall plan to eradicate Gaelic culture in the region as there had been in Ulster, surely Scottish Lowlanders were conscious of the differences between themselves and the Gaelic Highlanders and would have seen it as their to duty to &amp;quot;civilise&amp;quot; the clan based culture of the Gaelic Highlanders.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/sp2svd/to_what_extent_were_ethnic_differences_between/",
  "subreddit": "AskHistorians",
  "id": "sp2svd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Whenever I see discussion about the Highland Clearances online, the focus is\nusually on countering claims of English colonisation by reference to economic\nfactors of the Clearances, and the Scot on the Scot nature of the evictions.\n\nHowever there never seems to be reference to split between the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ハイランド・クリアランスに関する議論をネット上で見るたびに、その焦点は\n通常、イギリスの植民地化という主張に対して、経済的な側面から反論しています。\nの要因、そしてスコットランド人による立ち退きの性質についてです。\n\nしかし、\"Scot \"と \"Scot \"の間の分裂については言及されていないようだ。",
      "title": "ハイランド・クリアランスにおいて、ゲーリック・ハイランド人とアングロフォン・ローランド人の民族的な違いは、どの程度動機づけとなったのか。それはアルスターの植林と比較することができるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "每当我在网上看到关于高地清场的讨论时，重点是\n焦点通常是通过提及清场的经济因素来反驳英国殖民化的说法。\n清理行动的经济因素，以及苏格兰人对驱逐行动的性质的看法。\n\n然而，似乎从来没有人提到过清场的分裂。",
      "title": "盖尔语高地人和英语低地人之间的种族差异在多大程度上是高地清场期间的激励因素？它们是否可以与阿尔斯特种植园进行比较？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "每當我在網上看到關於高地清場的討論時，重點是\n焦點通常是通過提及清場的經濟因素來反駁英國殖民化的說法。\n清理行動的經濟因素，以及蘇格蘭人對驅逐行動的性質的看法。\n\n然而，似乎從來沒有人提到過清場的分裂。",
      "title": "蓋爾語高地人和英語低地人之間的種族差異在多大程度上是高地清場期間的激勵因素？它們是否可以與阿爾斯特種植園進行比較？"
    }
  ]
}