{
  "author": "Minute_Confusion5879",
  "original_created_utc": 1653212229,
  "title": "Why do men get so offended if women ignore their advances?",
  "created_utc": 1653224306,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am a single 30yr (f) and consider myself average looking. When I go out with the girls I buy my own drinks I generally avoid men as I am not looking and genuinely want to spend time with who I came with. I had on more than a few occasions  men make a move on me which I nicely reject the first time and get firmer the second time. When I get firmer I am all of a sudden an ice queen or a b*tch. Do men really think calling me pretty entitles them to something?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 162,
  "permalink": "/r/NoStupidQuestions/comments/uv7kd5/why_do_men_get_so_offended_if_women_ignore_their/",
  "subreddit": "NoStupidQuestions",
  "id": "uv7kd5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I am a single 30yr (f) and consider myself average looking. When I go out with\nthe girls I buy my own drinks I generally avoid men as I am not looking and\ngenuinely want to spend time with who I came with. I had on more than a few\noccasions men make a move on me which I nicely reject the first time…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は独身30歳（女）、自分では平均的な容姿だと思っています。私は女の子と外出するとき\nると、自分の飲み物は自分で買います。\n一緒に来た人と純粋に過ごしたいからです。私は何度か、男性に言い寄られたことがあります。\n何度も男性に言い寄られましたが、最初はうまく断りました...。",
      "title": "なぜ男性は、女性が自分の誘いを無視すると、そんなに怒るのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个30岁的单身女性，认为自己长得一般。当我和女孩们出去的时候\n我一般会避开男人，因为我不喜欢看，而且真正想和我一起去的人相处。\n真心想和我一起去的人共度时光。我曾不止一次地\n有好几次，男人向我示好，我第一次就很好地拒绝了......",
      "title": "如果女人不理会他们的求爱，为什么男人会如此生气？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個30歲的單身女性，認爲自己長得一般。當我和女孩們出去的時候\n我一般會避開男人，因爲我不喜歡看，而且真正想和我一起去的人相處。\n真心想和我一起去的人共度時光。我曾不止一次地\n有好幾次，男人向我示好，我第一次就很好地拒絕了......",
      "title": "如果女人不理會他們的求愛，爲什麼男人會如此生氣？"
    }
  ]
}