{
  "author": "baniyaguy",
  "the_new_excerpt": "I hold Google since this Jan and have made 40% on it so far, which I consider\noutstanding for half a year. I know, it is not advised to sell but isn't it\nlogical to take unrealistic gains when you have them? Not unrealistic for Google\nprobably, but in general 40% gain in half a year almost always…",
  "original_created_utc": 1622839096,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は今年の1月からGoogleを保有しており、これまでに40％の利益を得ています。\nこれは半年間ではかなりの利益だと思います。売るのはお勧めできませんが、非現実的な利益を得たときには\n非現実的な利益を得ることは論理的ではありませんか？Googleにとっては非現実的ではないでしょう。\nしかし、一般的に半年で40％の利益を得ることは、ほとんどの場合...",
      "title": "グーグルのような優良株をいつ売るか（あるいはさえないか）？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我从今年1月开始持有谷歌，到目前为止已经赚了40%，我认为这在半年内是非常出色的。\n半年来一直很出色。我知道，不建议卖出，但当你有机会获得不切实际的收益时，难道不应该\n但当你有不现实的收益时，获取不现实的收益不是合乎逻辑的吗？对谷歌来说不是不现实的\n可能是，但一般来说，半年内40%的收益几乎都是......",
      "title": "你什么时候卖掉（或甚至卖掉）像谷歌这样的好股票？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我從今年1月開始持有谷歌，到目前爲止已經賺了40%，我認爲這在半年內是非常出色的。\n半年來一直很出色。我知道，不建議賣出，但當你有機會獲得不切實際的收益時，難道不應該\n但當你有不現實的收益時，獲取不現實的收益不是合乎邏輯的嗎？對谷歌來說不是不現實的\n可能是，但一般來說，半年內40%的收益幾乎都是......",
      "title": "你什麼時候賣掉（或甚至賣掉）像谷歌這樣的好股票？"
    }
  ],
  "title": "When do you sell (or do you even) a good stock like Google?",
  "created_utc": 1622858464,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I hold Google since this Jan and have made 40% on it so far, which I consider outstanding for half a year. I know, it is not advised to sell but isn&#39;t it logical to take unrealistic gains when you have them? Not unrealistic for Google probably, but in general 40% gain in half a year almost always beats the market. Is it sensible to take money out and invest in a beat down stock like Apple? AAPL had hardly moved since a few months and looks set to take off any day now. I&#39;m aware of warnings against timing the market, but I don&#39;t feel like waiting for Google to eventually be just a 20% gain at end of year makes sense.</p>\n</div><!-- SC_ON -->",
  "score": 178,
  "permalink": "/r/stocks/comments/nsewch/when_do_you_sell_or_do_you_even_a_good_stock_like/",
  "subreddit": "stocks",
  "id": "nsewch",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404886631
}