{
  "author": "wand-n-words",
  "original_created_utc": 1628528066,
  "title": "Why don't the Olympics maintain a single venue for being sustainable amidst the climate crisis?",
  "created_utc": 1628548647,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Large amount of resources need to be wasted to construct stadium and other structures for just a month long event held once.  This year too the Tokyo Olympics faced backlash for using timber, which caused deforestation in rainforests of Indonesia and sensitive orangutan habitat. (<a href=\"https://www.google.com/amp/s/www.independent.co.uk/climate-change/news/tokyo-olympics-2021-climate-change-b1885491.html%3famp\">https://www.google.com/amp/s/www.independent.co.uk/climate-change/news/tokyo-olympics-2021-climate-change-b1885491.html%3famp</a>)</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TrueAskReddit/comments/p15f3q/why_dont_the_olympics_maintain_a_single_venue_for/",
  "subreddit": "TrueAskReddit",
  "id": "p15f3q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Large amount of resources need to be wasted to construct stadium and other\nstructures for just a month long event held once. This year too the Tokyo\nOlympics faced backlash for using timber, which caused deforestation in\nrainforests of Indonesia and sensitive orangutan…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "たった一度の一ヶ月間のイベントのために、スタジアムなどを建設するためには、大量の資源が必要となります。\nたった1ヶ月のイベントのために、スタジアムなどの建造物を建設するためには、大量の資源が必要です。今年の東京オリンピックでも\n今年の東京オリンピックでも、インドネシアの熱帯雨林で森林破壊を引き起こす木材を使用したことで\n今年の東京オリンピックでも、インドネシアの熱帯雨林の森林破壊を引き起こし、オランウータンの生態系に影響を与える木材を使用したことで、反発を受けました。",
      "title": "気候危機の中で持続可能であるために、なぜオリンピックは一つの会場を維持しないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "为了举办一次为期一个月的活动，需要浪费大量的资源来建造体育场和其他\n仅仅为一次为期一个月的活动建造体育场和其他结构。今年的东京\n奥运会也面临着使用木材的反弹，因为这导致了其他地区的森林被砍伐。\n印尼的雨林和敏感的红毛猩猩......",
      "title": "为什么奥运会不在气候危机中保持一个可持续发展的单一场所？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "爲了舉辦一次爲期一個月的活動，需要浪費大量的資源來建造體育場和其他\n僅僅爲一次爲期一個月的活動建造體育場和其他結構。今年的東京\n奧運會也面臨着使用木材的反彈，因爲這導致了其他地區的森林被砍伐。\n印尼的雨林和敏感的紅毛猩猩......",
      "title": "爲什麼奧運會不在氣候危機中保持一個可持續發展的單一場所？"
    }
  ]
}