{
  "author": "youwontknw",
  "original_created_utc": 1639333570,
  "title": "To all the guys, how do you react when a girl you're attracted to tells you she likes you and would like to keep seeing you?",
  "created_utc": 1639402693,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I recently had a conversation about this with one of my girl friends. She insisted that, as a girl, you should never, ever, go ahead and admit to a guy that you like him, because the minute you show yourself too eager, he will back away. That this is some sort of reverse psychology backed up by dating coaches and all that and that guys like the thrill of the chase so you should play hard to get. The thing is, she added: especially with the guys who are unsure about what they want.&lt;/p&gt;\n\n&lt;p&gt;The context is that I&amp;#39;ve recently told a guy that I like him and would like to see him again and he effectively ended up ghosting me after. My friend said I should&amp;#39;ve never done that and I should&amp;#39;ve let him make all the moves.&lt;/p&gt;\n\n&lt;p&gt;My opinion is that a guy who is emotionally mature and who knows what he wants would not be driven away by a girl making the first move or any kind of move. He does not owe it to me to like me back, but at least have the decency to tell me you don&amp;#39;t feel the same and that&amp;#39;s that. It will suck, but I will move on.&lt;/p&gt;\n\n&lt;p&gt;However, I&amp;#39;d still like to know: is there some validity to all that reverse psychology thing? Is it really like that, are you drawn to girls who are playing hard to get and turned off by girls who show and tell you they want you too?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/TooAfraidToAsk/comments/reuxqb/to_all_the_guys_how_do_you_react_when_a_girl/",
  "subreddit": "TooAfraidToAsk",
  "id": "reuxqb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I recently had a conversation about this with one of my girl friends. She\ninsisted that, as a girl, you should never, ever, go ahead and admit to a guy\nthat you like him, because the minute you show yourself too eager, he will back\naway. That this is some sort of reverse psychology backed up by…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、ある女友達とこんな話をしたんです。彼女は\n女の子として、絶対に、絶対に、男性に告白してはいけないと主張しました。\nというのも、あなたがあまりに熱心な様子を見せた途端、彼は引き下がるからです。\n離れていく。これはある種の逆心理学に裏打ちされたものであると...",
      "title": "男性の皆さん、気になる女性から「好きだからずっと会っていたい」と言われたとき、どのように対応しますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近我和我的一个女朋友就这个问题进行了交谈。她\n她坚持认为，作为一个女孩，你不应该，永远，去承认一个男人\n你喜欢他，因为一旦你表现得太急切，他就会退缩。\n离开。这是某种反向心理学的支持。",
      "title": "对所有的人来说，当一个被你吸引的女孩告诉你她喜欢你并愿意继续和你交往时，你会有什么反应？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近我和我的一個女朋友就這個問題進行了交談。她\n她堅持認爲，作爲一個女孩，你不應該，永遠，去承認一個男人\n你喜歡他，因爲一旦你表現得太急切，他就會退縮。\n離開。這是某種反向心理學的支持。",
      "title": "對所有的人來說，當一個被你吸引的女孩告訴你她喜歡你並願意繼續和你交往時，你會有什麼反應？"
    }
  ]
}