{
  "author": "NotActuallySmart",
  "the_new_excerpt": "This is based on a conversation I had with a coworker before the pandemic. He\nwas a bit of a old boglehead and was telling us millennials that instead of\ncontributing directly to a Roth IRA, we can fill out a form with our broker to\nset aside $6k worth of a taxable account as a \"self-declared Roth…",
  "original_created_utc": 1621698756,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは、パンデミック前に同僚と交わした会話がもとになっています。彼は\n彼は少し古いタイプの人で、私たちミレニアル世代に、Roth IRAに直接拠出する代わりに\nRoth IRAに直接拠出する代わりに、ブローカーにフォームを記入して\nミレニアル世代は、Roth IRAに直接拠出するのではなく、ブローカーにフォームを記入して、課税口座から6,000ドル分を「自己申告のRoth IRA」として確保することができると言っていました。",
      "title": "課税口座からの自己申告IRA - これは本当ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是根据我在大流行之前与一位同事的谈话。他\n他是个老顽固，他告诉我们这些千禧一代，不要直接向罗斯IRA供款。\n他告诉我们这些千禧一代，与其直接向罗斯IRA捐款，不如向我们的经纪人填写一份表格，以\n从应税账户中留出价值6千美元的资金作为 \"自我声明的罗斯退休计划\"。",
      "title": "从应税账户自行申报IRA--这是真的吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是根據我在大流行之前與一位同事的談話。他\n他是個老頑固，他告訴我們這些千禧一代，不要直接向羅斯IRA供款。\n他告訴我們這些千禧一代，與其直接向羅斯IRA捐款，不如向我們的經紀人填寫一份表格，以\n從應稅賬戶中留出價值6千美元的資金作爲 \"自我聲明的羅斯退休計劃\"。",
      "title": "從應稅賬戶自行申報IRA--這是真的嗎？"
    }
  ],
  "title": "Self-declared IRA from taxable account - is this real?",
  "created_utc": 1621739628,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is based on a conversation I had with a coworker before the pandemic. He was a bit of a old boglehead and was telling us millennials that instead of contributing directly to a Roth IRA, we can fill out a form with our broker to set aside $6k worth of a taxable account as a &quot;self-declared Roth IRA&quot;. He retired a few months later so I never got a chance to get more details on this. He said this would be more efficient since you just keep contributing to VTSAX in taxable and then transform $6k of it into a Roth on January 2nd. I can&#39;t find anything online talking about this though. Is this a real thing you can do?</p>\n</div><!-- SC_ON -->",
  "score": 16,
  "permalink": "/r/Bogleheads/comments/nilk7q/selfdeclared_ira_from_taxable_account_is_this_real/",
  "subreddit": "Bogleheads",
  "id": "nilk7q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197387107
}