{
  "author": "SaltAHistory",
  "original_created_utc": 1660805403,
  "title": "Were the bodies of the 20,000 soldiers who died at Waterloo really turned into sugar?",
  "created_utc": 1660827396,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The Daily Mail today reports “bombshell” and “exclusive” new historical research. Short extract:&lt;/p&gt;\n\n&lt;p&gt;“The mystery of what happened to the bodies of more than 20,000 men who were killed at the Battle of Waterloo has dogged historians for decades. &lt;/p&gt;\n\n&lt;p&gt;Despite the passing of more than 200 years since the Duke of Wellington&amp;#39;s triumph over Napoleon&amp;#39;s forces in 1815, only two skeletons of fallen men have been found, with the most recent discovery coming last month.&lt;/p&gt;\n\n&lt;p&gt;But now, bombshell new research suggests the remains of men and tens of thousands of horses are missing because they were ground down and used to filter brown sugar beet into refined white sugar.”&lt;/p&gt;\n\n&lt;p&gt;(Full link: &lt;a href=\"https://www.dailymail.co.uk/news/article-11119607/Battle-Waterloo-dead-used-make-white-sugar.html\"&gt;https://www.dailymail.co.uk/news/article-11119607/Battle-Waterloo-dead-used-make-white-sugar.html&lt;/a&gt;)&lt;/p&gt;\n\n&lt;p&gt;This whole thing seems incredibly suspect to me. Surely 20,000 bodies can’t have disappeared to the extent that only two have been found? And the sugar thing sounds just too gruesome to be credible.&lt;/p&gt;\n\n&lt;p&gt;Also the fact it’s exclusively reported in the Daily Mail rather than, say, somewhere that historians typically publish research makes me question its accuracy, but maybe I’m just being a snob.&lt;/p&gt;\n\n&lt;p&gt;Is there any truth to any of this?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 126,
  "permalink": "/r/AskHistorians/comments/wrcfqt/were_the_bodies_of_the_20000_soldiers_who_died_at/",
  "subreddit": "AskHistorians",
  "id": "wrcfqt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The Daily Mail today reports “bombshell” and “exclusive” new historical\nresearch. Short extract:\n\n“The mystery of what happened to the bodies of more than 20,000 men who were\nkilled at the Battle of Waterloo has dogged historians for decades.\n\nDespite the passing of more than 200 years since the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "デイリー・メール紙が本日、「爆弾発言」「独占的」な新しい歴史的事実を報じる\nを報じている。簡単に抜粋する。\n\n「2万人以上の兵士の死体がどうなったか？\nワーテルローの戦いで殺された2万人以上の男性の遺体はどうなったのか、その謎は何十年にもわたって歴史家たちを苦しめてきた。\n\nワーテルローの戦いから200年以上経過しているにもかかわらず。",
      "title": "ワーテルローで死んだ2万人の兵士の死体は、本当に砂糖になったのだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "每日邮报》今天报道了 \"重磅炸弹 \"和 \"独家 \"的新史料\n研究。简要摘录。\n\n\"在滑铁卢战役中丧生的2万多人的尸体的下落之谜，一直困扰着人们。\n在滑铁卢战役中丧生的2万多人的尸体的下落，几十年来一直困扰着历史学家。\n\n尽管自滑铁卢战役以来已经过去了200多年。",
      "title": "在滑铁卢死去的两万名士兵的尸体真的变成了糖吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "每日郵報》今天報道了 \"重磅炸彈 \"和 \"獨家 \"的新史料\n研究。簡要摘錄。\n\n\"在滑鐵盧戰役中喪生的2萬多人的屍體的下落之謎，一直困擾着人們。\n在滑鐵盧戰役中喪生的2萬多人的屍體的下落，幾十年來一直困擾着歷史學家。\n\n儘管自滑鐵盧戰役以來已經過去了200多年。",
      "title": "在滑鐵盧死去的兩萬名士兵的屍體真的變成了糖嗎？"
    }
  ]
}