{
  "author": "MrSmartiePants69",
  "original_created_utc": 1641549743,
  "title": "Can we take a moment to appreciate Harmony ONE and their amazing roadmap?",
  "created_utc": 1641613204,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I sincerely dont want to sound like another shill, but their roadmap is speaking volume!&lt;/p&gt;\n\n&lt;h3&gt;Bitcoin Bridge&lt;/h3&gt;\n\n&lt;p&gt;Still planning to have the launch this month. It should be an external launch so onboarding externals for running vaults. Some minor details to take care of still, but the launch is still planned for this month.&lt;/p&gt;\n\n&lt;h3&gt;Trustless Ethereum bridge&lt;/h3&gt;\n\n&lt;p&gt;Expecting a month of work, but hoping to finish everything by the end of this month.&lt;/p&gt;\n\n&lt;h3&gt;Streaming sync and fast sync&lt;/h3&gt;\n\n&lt;p&gt;Fixing last problem before launch on Testnet. No update currently.&lt;/p&gt;\n\n&lt;h3&gt;Cross Shard Transactions&lt;/h3&gt;\n\n&lt;p&gt;Needs a few more rounds of iteration and feedback on designs. A few more weeks until start of implementation.&lt;/p&gt;\n\n&lt;h3&gt;Polygon Bridge&lt;/h3&gt;\n\n&lt;p&gt;The team is working on this currently. More updates will come on this including date of launch in a few weeks.&lt;/p&gt;\n\n&lt;h3&gt;Staking Derivatives&lt;/h3&gt;\n\n&lt;p&gt;Currently working on the consistency of the bots and this is taking longer than expected. Once this is stable, they will work on a technical plan for updates and final dates.&lt;/p&gt;\n\n&lt;p&gt;!!!Smart contract staking allows metamask users to stake!!! THATS HUGE&lt;/p&gt;\n\n&lt;h3&gt;Cross Chain API&lt;/h3&gt;\n\n&lt;p&gt;It is as far as it can go before the bots and bridge are out. Once these are up and running, it should be a generic solution and finished shortly after.&lt;/p&gt;\n\n&lt;h3&gt;Cosmos Bridge&lt;/h3&gt;\n\n&lt;p&gt;An external team is currently working on this. There should be a progress update sometime next week. The end goal is to launch in February.&lt;/p&gt;\n\n&lt;h3&gt;Secure Resharding&lt;/h3&gt;\n\n&lt;p&gt;Working with the Research DAO. Waiting on the write up adn finalizing design.&lt;/p&gt;\n\n&lt;h3&gt;1 second finality&lt;/h3&gt;\n\n&lt;p&gt;The feature is a major change so it is still under review. Increasing the gas fees slightly will help grow the block time and help with spam attacks as well, while still keeping the fees small for users.&lt;/p&gt;\n\n&lt;h3&gt;Decentralized RPC&lt;/h3&gt;\n\n&lt;p&gt;Bringing in more partners to help with this. Should be done by the end of January. Currently working on new ways to continue becoming more decentralized.&lt;/p&gt;\n\n&lt;h3&gt;Decentralized Ops&lt;/h3&gt;\n\n&lt;p&gt;This is used for onboarding teams to help with ops. Used to introduce a new Devnet.&lt;/p&gt;\n\n&lt;h3&gt;Ambassador DAO&lt;/h3&gt;\n\n&lt;p&gt;goal for 2022 is 100 meetups per month around the world. The first meeting meeting will take place this month. Establishing a way to pay governors currently.&lt;/p&gt;\n\n&lt;p&gt;Apart from that, the recent crash did barely any damage to the coins price. Harmony is going strong and it is accumulating to the new ATH. When everyone is talking about ZK rollups on ETH, maybe more people should look in ONE and their immensely cheap gas fees.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 303,
  "permalink": "/r/CryptoCurrency/comments/ry42r2/can_we_take_a_moment_to_appreciate_harmony_one/",
  "subreddit": "CryptoCurrency",
  "id": "ry42r2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I sincerely dont want to sound like another shill, but their roadmap is speaking\nvolume!\n\n\nBITCOIN BRIDGE\n\nStill planning to have the launch this month. It should be an external launch so\nonboarding externals for running vaults. Some minor details to take care of\nstill, but the launch is still…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は本当に他のサクラのように聞こえるしたくないのですが、彼らのロードマップは語っています。\nボリューム!\n\n\nビットコインブリッジ\n\nまだ今月中に発売する予定です。外部での立ち上げになるはずなので\n保管庫を運営する外部企業のオンボーディング。いくつかの細かな作業を行う必要があります。\nまだ、発売は先ですが・・・。",
      "title": "Harmony ONEとその素晴らしいロードマップに感謝する時間をとってもいいでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我真诚地不想听起来像另一个骗子，但他们的路线图是在说\n量!\n\n\n信息货币桥梁\n\n仍然计划在这个月推出。它应该是一个外部启动，所以\n为运行金库的外部人员办理入职手续。还有一些小的细节需要处理\n仍有一些小的细节需要处理，但启动仍是...",
      "title": "我们能不能花点时间来欣赏一下Harmony ONE和他们惊人的路线图？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我真誠地不想聽起來像另一個騙子，但他們的路線圖是在說\n量!\n\n\n信息貨幣橋樑\n\n仍然計劃在這個月推出。它應該是一個外部啓動，所以\n爲運行金庫的外部人員辦理入職手續。還有一些小的細節需要處理\n仍有一些小的細節需要處理，但啓動仍是...",
      "title": "我們能不能花點時間來欣賞一下Harmony ONE和他們驚人的路線圖？"
    }
  ]
}