{
  "author": "bfeyhfsjih",
  "the_new_excerpt": "Senseonics produces a blood sugar monitor that is implanted in the arm for 90\ndays compared to their main competitor, Dexcom, which is supposed to last 10\ndays. The problem with Dexcom is it usually doesn’t even last 10 days and the\nlast day’s value can be inaccurate. Senseonics is also working on a…",
  "original_created_utc": 1615519025,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "Senseonics公司生产的血糖监测仪，植入手臂90\n天，而他们的主要竞争对手Dexcom则可持续10\n天。德力西康的问题是，通常连10天都坚持不了，而且是在\n最后一天的数值可能不准确。Senseonics也在研究一...",
      "title": "为什么我长期相信SENS。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Senseonics公司生產的血糖監測儀，植入手臂90\n天，而他們的主要競爭對手Dexcom則可持續10\n天。德力西康的問題是，通常連10天都堅持不了，而且是在\n最後一天的數值可能不準確。Senseonics也在研究一...",
      "title": "爲什麼我長期相信SENS。"
    }
  ],
  "title": "Why I believe in SENS long term.",
  "created_utc": 1615534613,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Senseonics produces a blood sugar monitor that is implanted in the arm for 90 days compared to their main competitor, Dexcom, which is supposed to last 10 days. The problem with Dexcom is it usually doesn’t even last 10 days and the last day’s value can be inaccurate. Senseonics is also working on a 180 day and a full year version.</p>\n\n<p>The Senseonics sensor, eversence, can be worn during an mri but dexcom’s sensors can’t. The data is sent straight to the users phone.</p>\n\n<p>It is already used in Europe, but needs to be approved by the FDA. It has a 6 month timeline to be approved.</p>\n\n<p>Dexcom’s current sensor, the g6, is $169.99. The eversence CGM is $99.</p>\n\n<p>If you are in it short term it has a very high short interest, about 50% of float. And has 13000 calls for $3 on 2/19 and almost 17000 for $3.50 on the same day.</p>\n\n<p>The market cap is 1.25 billion and the market cap of Dexcom is 35 billion. Some anecdotal evidence is the diabetic people I have asked said they would switch to the eversence over the g6 in a heartbeat.</p>\n</div><!-- SC_ON -->",
  "score": 74,
  "permalink": "/r/stocks/comments/m38c6c/why_i_believe_in_sens_long_term/",
  "subreddit": "stocks",
  "id": "m38c6c",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147381387
}