{
  "author": "bleakvandeak",
  "original_created_utc": 1635864740,
  "title": "What are some philosophers that you can approach cold?",
  "created_utc": 1635935858,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Was learning about Kant and kept getting frustrated, so i tried to use supplementary material; but reading on, they say that to understand Kant, you have to understand Leibniz, Locke, and Hume. Reading on some more, to understand them you have to understand Bacon, Descartes, or Spinoza. And to understand them you need to understand Aristotle and the Scholastics, and so on. What philosophy/philosophies can I approach without any need of foundational material? Looking for atypical answers, so not Plato, Marcus Aurelius, or Camus.</p>\n\n<p>Sorry for the very pedestrian question, just curious.</p>\n\n<p>Edit: You guys have been awesome!! I’ve got a pretty good reading list here and a little more confidence to try and keep reading. I appreciate it. And just so it’s here, I reframed the question in the comments; what’s a philosophy where I don’t need to have a specialized taxonomy to engage with it?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/askphilosophy/comments/ql5xky/what_are_some_philosophers_that_you_can_approach/",
  "subreddit": "askphilosophy",
  "id": "ql5xky",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Was learning about Kant and kept getting frustrated, so i tried to use\nsupplementary material; but reading on, they say that to understand Kant, you\nhave to understand Leibniz, Locke, and Hume. Reading on some more, to understand\nthem you have to understand Bacon, Descartes, or Spinoza. And to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "カントについて学習していたが、フラストレーションが溜まっていたので、補助教材を使用してみた。\n読んでみると、カントを理解するためには、ライプニッツ、ロック、ヒュームを\nカントを理解するには、ライプニッツ、ロック、ヒュームを理解しなければならない。さらに読み進めていくと、彼らを理解するためには\nベーコン、デカルト、スピノザを理解しなければなりません。そして...",
      "title": "冷静にアプローチできるような哲学者はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在学习康德的过程中，我一直感到很沮丧，所以我试图使用补充材料。\n辅材料；但读到这里，他们说要理解康德，你必须理解莱布尼兹、洛克和休谟。\n必须了解莱布尼茨、洛克和休谟。再读下去，要理解\n他们必须了解培根、笛卡尔或斯宾诺莎。而要...",
      "title": "有哪些哲学家是你可以接近的冷门？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在學習康德的過程中，我一直感到很沮喪，所以我試圖使用補充材料。\n輔材料；但讀到這裏，他們說要理解康德，你必須理解萊布尼茲、洛克和休謨。\n必須瞭解萊布尼茨、洛克和休謨。再讀下去，要理解\n他們必須瞭解培根、笛卡爾或斯賓諾莎。而要...",
      "title": "有哪些哲學家是你可以接近的冷門？"
    }
  ]
}