{
  "author": "hoveflames",
  "the_new_excerpt": "CORRECTION: USD 4.200 MILLION USD\n\nThis Friday, April 30, there will be the expiration of bitcoin options (BTC)\nequivalent to USD 4.2 billion. This generates expectations in the market, since\nin previous months this date has caused an upward movement in the value of the\ncryptocurrency.\n\nBitcoin…",
  "original_created_utc": 1619633153,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "訂正：420万USドル\n\n今週の金曜日（4月30日）には、ビットコインオプション（BTC）の満期があります。\n4.2億米ドル相当の これは市場で期待されています。\nこれまでは、この日を境に暗号通貨の価値が上昇していたため、市場では期待が高まっています。\n暗号通貨である\n\nビットコインの...",
      "title": "4.2百万ドルのビットコインオプションが金曜日に期限切れになります。価格への影響は？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "更正：4.2亿美元\n\n本周五，4月30日，将有比特币期权（BTC）的到期。\n相当于4.2亿美元。这在市场上产生了预期，因为\n在过去的几个月里，这个日期已经导致比特币价值的上升运动。\n加密货币。\n\n比特币...",
      "title": "4.2百万美元的比特币期权在周五到期。它将如何影响价格？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "更正：4.2億美元\n\n本週五，4月30日，將有比特幣期權（BTC）的到期。\n相當於4.2億美元。這在市場上產生了預期，因爲\n在過去的幾個月裏，這個日期已經導致比特幣價值的上升運動。\n加密貨幣。\n\n比特幣...",
      "title": "4.2百萬美元的比特幣期權在週五到期。它將如何影響價格？"
    }
  ],
  "title": "$ 4.2 million in bitcoin options expire on Friday. How would it affect the price?",
  "created_utc": 1619652634,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h1>Correction: USD 4.200 MILLION USD</h1>\n\n<p><strong>This Friday, April 30</strong>, there will be the expiration of bitcoin options (BTC) equivalent to USD 4.2 billion. This generates expectations in the market, since in previous months this date has caused an upward movement in the value of the cryptocurrency.</p>\n\n<p>Bitcoin options are an investment tool that allows you to set the purchase or sale price of the cryptocurrency at a certain time in the future. These contracts can be executed at any time or, failing that, they will become effective when the expiration date arrives. Unlike futures, the holder is not obligated to buy or sell the asset if he chooses not to.</p>\n\n<p>The last day for monthly options to expire is the last Friday of each month. In the last expiration dates, the price of the cryptocurrency has undergone variations that report a certain trend.</p>\n\n<p>In this sense, the statistics indicate that before the options expire there is an average drop of 26% in their value; however, after expiration the price rebounds and rises to an average 65%.</p>\n\n<p><a href=\"https://preview.redd.it/wmk2ydnkeyv61.png?width=856&amp;format=png&amp;auto=webp&amp;s=9a3d1fd77f0f668cd83c1f74702f60ae2a110f78\">The blue lines indicate the expiration date of the bitcoin options, followed by increases in price.</a></p>\n\n<p>This variation in price can be seen in the figures for the last few months. Following the previous bitcoin options expiration dates - which were December 25, January 29, February 26 and March 26, 2021 - the value growth was 86%, 102%, 43% and 29% , respectively. Also, this upward movement was sustained for 14, 25, 14 and 20 days.</p>\n\n<p>However, it is also noteworthy that prior to all these expiration dates there had been a depreciation of bitcoin, which reached 31%, 26%, 19% and 27% in December, January, February and March, respectively. This downward trend had been maintained for a period of 21, 6, 12 and 10 in each of these months, respectively.</p>\n\n<p>With respect to April, this analysis places the expiration date on Friday, April 23, despite not being the last Friday of the month, at which time the &quot;official expiration&quot; will take place.</p>\n\n<p>Taking into account the trend described above, the upward wave would have already started: from Friday 23rd to Sunday 25th there was a brake on the decline in price that had been observed, which then resumed until it fell to the USD 47,499 line. From there, the increase has been almost continuous, surpassing USD 55,000 on Tuesday, April 27.</p>\n\n<p><strong>Can Bitcoin exceed its all-time high?</strong></p>\n\n<p>Despite all that has been said, the &quot;real date&quot; for expiration is Friday, April 30, which causes some uncertainty as to what may happen this time.</p>\n\n<p>Generally, before the expiration date it is sought to take it to the Max Pain Point or &quot;point of maximum suffering&quot;, which this month stands at USD 54,000 according to Deribit. This would be the most beneficial point for the sellers and the most damaging for the buyers. If the average increase reported in recent months were to be repeated (approximately 65%), by mid to late May the new value would be around USD 90,000 and would mean a new all-time high for the cryptocurrency.</p>\n\n<p><span class=\"md-spoiler-text\">Key facts:</span></p>\n\n<p><span class=\"md-spoiler-text\">After the latest option expirations, BTC had an average appreciation of 26%.</span></p>\n\n<p><span class=\"md-spoiler-text\">The maximum increase occurred after the end of January, with a 102% appreciation.</span></p>\n</div><!-- SC_ON -->",
  "score": 366,
  "permalink": "/r/CryptoCurrency/comments/n0kwc4/42_million_in_bitcoin_options_expire_on_friday/",
  "subreddit": "CryptoCurrency",
  "id": "n0kwc4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776213352
}