{
  "author": "Isiki777",
  "the_new_excerpt": "Currently I am investing in crypto in order to be able to retire in the future.\nMost of the coins I own I am able to stake and make passive income.\n\nI seen many people work into old age because their retirement is not enough to\nlive off. I seen older people have to decide which medication to buy…",
  "original_created_utc": 1619538780,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "現在、私は将来のリタイアを目指して、暗号に投資しています。\n私が所有しているコインのほとんどは、ステイクしてパッシブインカムを得ることができます。\n\n多くの人が老後まで働いているのを見てきましたが、その理由は退職金が生活に十分ではないからです。\n働かなければなりません。高齢者はどの薬を買うか決めなければなりません。",
      "title": "政府に頼れないから、老後のために暗号化する。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "目前，我正在投资加密货币，以便能够在未来退休。\n我所拥有的大多数硬币我都可以入股并赚取被动收入。\n\n我看到许多人工作到老，因为他们的退休生活不够\n生活。我看到老年人不得不决定购买哪种药物...",
      "title": "用于退休的加密货币，因为我们不能依靠政府。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "目前，我正在投資加密貨幣，以便能夠在未來退休。\n我所擁有的大多數硬幣我都可以入股並賺取被動收入。\n\n我看到許多人工作到老，因爲他們的退休生活不夠\n生活。我看到老年人不得不決定購買哪種藥物...",
      "title": "用於退休的加密貨幣，因爲我們不能依靠政府。"
    }
  ],
  "title": "Crypto for retirement because we can't rely on the government.",
  "created_utc": 1619584624,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Currently I am investing in crypto in order to be able to retire in the future. Most of the coins I own I am able to stake and make passive income. </p>\n\n<p>I seen many people work into old age because their retirement is not enough to live off. I seen older people have to decide which medication to buy because insurance doesn&#39;t cover all and they are limited on money. </p>\n\n<p>Depending on the country you live you might not be able to rely on the government for retirement. Very few countries give a pension that is a livable wage. </p>\n\n<p>With crypto you have a plan B to have money available for retirement, that way you are not depending on the government or anyone.</p>\n</div><!-- SC_ON -->",
  "score": 162,
  "permalink": "/r/CryptoCurrency/comments/mzrjoa/crypto_for_retirement_because_we_cant_rely_on_the/",
  "subreddit": "CryptoCurrency",
  "id": "mzrjoa",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776212027
}