{
  "author": "good-as-hellx",
  "the_new_excerpt": "My paycheck got in so of course in the next blink of an eye I was on the\nexchange for a new shopping session.\n\nI select the coin, enter the sum, card details, shoe size, number of fingers\netc. You get the point. Then as a child on Christmas morning I hit buy.\n\n\n\n\n\nTransaction failed.\n\n\n\n\n\nHaha, I…",
  "original_created_utc": 1615721326,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我的工资收到了，所以当然在接下来的一眨眼，我就开始了。\n兑换新的购物环节。\n\n我选择硬币，输入金额，卡的详细信息，鞋的尺寸，手指的数量\n等。你懂的。然后小时候圣诞节早上我按了买。\n\n\n\n\n\n交易失败。\n\n\n\n\n\n哈哈，我...",
      "title": "我对银行已经没有耐心了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的工資收到了，所以當然在接下來的一眨眼，我就開始了。\n兌換新的購物環節。\n\n我選擇硬幣，輸入金額，卡的詳細信息，鞋的尺寸，手指的數量\n等。你懂的。然後小時候聖誕節早上我按了買。\n\n\n\n\n\n交易失敗。\n\n\n\n\n\n哈哈，我...",
      "title": "我對銀行已經沒有耐心了。"
    }
  ],
  "title": "I'm running out of patience for banks",
  "created_utc": 1615750227,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My paycheck got in so of course in the next blink of an eye I was on the exchange for a new shopping session.</p>\n\n<p>I select the coin, enter the sum, card details, shoe size, number of fingers etc. You get the point. Then as a child on Christmas morning I hit buy.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>Transaction failed.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>Haha, I guess dumbass me misspelled something so I go again.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>Transaction failed.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>Oooooooook? I check the <del>credit</del> debit(sorry) card balance, everything correct. Exchange, correct. Account, correct. Proceed again with caution and sweat by typing one number/letter at a time like defusing a bomb.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>Transaction <del>accepted</del> failed.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>Great, now I need new pants. I&#39;m calling the bank.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>Disclaimer: no criminal record, no police encounters, no drugs, no fights. Nothing. </p>\n\n<p>I&#39;m a basic human that works a basic job, gets paid for it, buys crypto and coffee, pays some bills every month. That&#39;s it.</p>\n\n<p>I use my bank account to get my paycheck, spend it and repeat. I&#39;m cleaner than a priest on a sunday.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>I identify myself to them and and start asking questions. Some bored guy who I seem to bother with my questions and worries starts to check stuff(no hate, I understand he gotta live too, but still an important detail).</p>\n\n<p>He tells me that my account is temporarily suspended for investigation. To be honest, apart from being broke and buying crypto, my account does nothing so I ask him to explain why I need to be InVeStIgAtEd.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<h1>The Explanation</h1>\n\n<p>&quot;ExchangeName is a company that we don&#39;t know of, has no history and a suspicious activity. We can&#39;t let our customers support these types of companies or get bankrupt because of them. We are running this investigation only for your safety.&quot;</p>\n\n<p>...or at least that&#39;s what he thinks so. Yes, he literally said that. </p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>ExchangeName - one of the top 3 crypto exchanges. Everything I did was entirely legal. I bought crypto before this.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>So a guy that talks to me with disgust gets to tell me what I can do and what I can&#39;t do with <em>my money</em>. </p>\n\n<p>Having a bank decide what I can do and do not with the money that I WORK for - not them, not anyone; my time, my money - it&#39;s just insane. This is sick.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>Can&#39;t wait for banks to become ruin and history. We literally need crypto and blockchain.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>PS: enjoy your <em>gas-ride</em>, seems like I&#39;m out this one.</p>\n</div><!-- SC_ON -->",
  "score": 214,
  "permalink": "/r/CryptoCurrency/comments/m4tl2v/im_running_out_of_patience_for_banks/",
  "subreddit": "CryptoCurrency",
  "id": "m4tl2v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147377080
}