{
  "author": "thesehoesaintloyal88",
  "the_new_excerpt": "I’m close quitting the stock market. I spent a month before getting in\nresearching and reading stock books. They say “invest into ETFs” or “reinvest\ndividends” or due DD before buying a stock. Watch the news, don’t invest into\nmeme stocks.\n\nOnly to get into the market and see people making life…",
  "original_created_utc": 1611763901,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我快退出股市了。我花了一个月的时间才进入\n研究和阅读股票书籍。他们说 \"投资到ETF \"或 \"再投资\"。\n股息 \"或到期DD后再买股票。看新闻，不要投资到\n追忆股。\n\n只不过进入市场后，看到人们在做生活...",
      "title": "能给我一些鼓励的话吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我快退出股市了。我花了一個月的時間才進入\n研究和閱讀股票書籍。他們說 \"投資到ETF \"或 \"再投資\"。\n股息 \"或到期DD後再買股票。看新聞，不要投資到\n追憶股。\n\n只不過進入市場後，看到人們在做生活...",
      "title": "能給我一些鼓勵的話嗎？"
    }
  ],
  "title": "Can I get some words of encouragement?",
  "created_utc": 1611796214,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m close quitting the stock market. I spent a month before getting in researching and reading stock books. They say “invest into ETFs” or “reinvest dividends” or due DD before buying a stock. Watch the news, don’t invest into meme stocks.</p>\n\n<p>Only to get into the market and see people making life changing money in under a month off stocks, while I make chump change by listening to what these books have said. AMC was nearly bankrupt, now they’re skyrocketing even though they’re in a load of debt. DD will tell you not to invest. TSLA is valued at $247 and was $85/share this time last year. It’s now at $900. </p>\n\n<p>Why should I stick to what research and these books say about fundamentals, while others just listen to what people on Reddit say and get incredible gains? </p>\n\n<p>This goes against everything I’ve read researched and it’s frustrating to the point where I’m about to quit. Can someone give me some words of encouragement or a reason not to give up?</p>\n</div><!-- SC_ON -->",
  "score": 94,
  "permalink": "/r/stocks/comments/l67svd/can_i_get_some_words_of_encouragement/",
  "subreddit": "stocks",
  "id": "l67svd",
  "is_self": true,
  "media": null,
  "is_video": false
}