{
  "author": "crisissuit",
  "original_created_utc": 1627574718,
  "title": "My newest hobby: Reporting IG influencers for Shitcoin Scams",
  "created_utc": 1627583430,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>influencers shilling shitcoins is nothing new, but it&#39;s gotten to a point where i really just cant deal with their scumminess. i&#39;m not sure if my reports actually do anything, but every time i see someone pushing some shitcoin saying that &quot;let&#39;s go to the moon!!&quot; or &quot;growing like crazy, get on it now!&quot;, i click the extra steps on every single one of their stories to report as a scam. a bit petty, but fuck these people for contributing to rug pulls.</p>\n\n<p>not sure if it would violate any rules, but i also wouldn&#39;t be opposed to creating a list of accounts that are known to shill - there should be consequences for being a con artist.</p>\n</div><!-- SC_ON -->",
  "score": 254,
  "permalink": "/r/CryptoCurrency/comments/ou0egw/my_newest_hobby_reporting_ig_influencers_for/",
  "subreddit": "CryptoCurrency",
  "id": "ou0egw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "influencers shilling shitcoins is nothing new, but it's gotten to a point where\ni really just cant deal with their scumminess. i'm not sure if my reports\nactually do anything, but every time i see someone pushing some shitcoin saying\nthat \"let's go to the moon!!\" or \"growing like crazy, get on it…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "インフルエンサーがクソコインを売っているのは今に始まったことではありませんが、私は彼らの卑劣さに本当に対処できないところまで来ています。\n私のレポートが実際に何かをするかどうかはわかりませんが\n実際に何かするかどうかはわかりませんが、誰かがクソコインを押し売りしているのを見るたびに\n月に行こうぜ！」とか「めちゃくちゃ成長してるから乗れよ！」とか言ってクソコインを押してる人を見るたびに",
      "title": "私の最新の趣味です。IGインフルエンサーにShitcoin Scamsを報告すること"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有影响力的人兜售狗屎币已经不是什么新鲜事了，但现在已经到了一个地步，那就是\n我不知道我的报告是否有作用。\n我不知道我的报告是否真的有作用，但每次我看到有人推崇一些狗屎币说\n\"让我们去月球！！\"或 \"疯狂增长，快去吧......\"。",
      "title": "我最新的爱好。举报IG影响者的狗屎币骗局"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有影響力的人兜售狗屎幣已經不是什麼新鮮事了，但現在已經到了一個地步，那就是\n我不知道我的報告是否有作用。\n我不知道我的報告是否真的有作用，但每次我看到有人推崇一些狗屎幣說\n\"讓我們去月球！！\"或 \"瘋狂增長，快去吧......\"。",
      "title": "我最新的愛好。舉報IG影響者的狗屎幣騙局"
    }
  ]
}