{
  "author": "hannes_throw_far",
  "the_new_excerpt": "In her paper [https://philpapers.org/rec/BOBFPT], Bobzien leaves very little\ndoubt that Frege straight up plagiarized the Stoics without attributing them\nthroughout his career to a degree that goes far beyond just being influenced or\ninspired. She lists over 100 parallels in content and formulation…",
  "original_created_utc": 1612435636,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在她的论文[https://philpapers.org/rec/BOBFPT]中，Bobzien没有留下什么。\n怀疑弗莱格直接剽窃斯多葛的观点而不归功于他们。\n在他的整个职业生涯中，其程度远远超出了受影响或\n启发。她列举了100多条内容和表述上的相似之处... ...",
      "title": "在一篇新的论文中，S.Bobzien提供了压倒性的证据，证明弗雷格显著地、反复地剽窃了斯多葛派。这是否削弱了弗雷格作为最重要的哲学家之一的声誉和地位？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在她的論文[https://philpapers.org/rec/BOBFPT]中，Bobzien沒有留下什麼。\n懷疑弗萊格直接剽竊斯多葛的觀點而不歸功於他們。\n在他的整個職業生涯中，其程度遠遠超出了受影響或\n啓發。她列舉了100多條內容和表述上的相似之處... ...",
      "title": "在一篇新的論文中，S.Bobzien提供了壓倒性的證據，證明弗雷格顯著地、反覆地剽竊了斯多葛派。這是否削弱了弗雷格作爲最重要的哲學家之一的聲譽和地位？"
    }
  ],
  "title": "In a new paper, S. Bobzien provides overwhelming evidence that Frege significantly and repeatedly plagiarized the Stoics. Does this diminish Frege's reputation and standing as one of the most important philosophers?",
  "created_utc": 1612481041,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In her <a href=\"https://philpapers.org/rec/BOBFPT\">paper</a>, Bobzien leaves very little doubt that Frege straight up plagiarized the Stoics without attributing them throughout his career to a degree that goes far beyond just being influenced or inspired. She lists over 100 parallels in content and formulation and provides additional evidence and circumstantial evidence that further collaborates her observation.</p>\n\n<p>But Frege isn&#39;t just one of many philosophers, he&#39;s often credited with being one of the founding fathers, if not the most important one, of both analytic philosophy and first-order logic. He would probably appear on every &quot;The most important philosophers&quot; list. So this seems like a bombshell to me. Will this change how people look at Frege?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/askphilosophy/comments/lcd4uv/in_a_new_paper_s_bobzien_provides_overwhelming/",
  "subreddit": "askphilosophy",
  "id": "lcd4uv",
  "is_self": true,
  "media": null,
  "is_video": false
}