{
  "author": "Shinyturtle25",
  "original_created_utc": 1632730355,
  "title": "I’m Quitting my job because of crypto",
  "created_utc": 1632742443,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As title says, I started investing in crypto (and losing eventually) some money, but this happened to open my mind to what money is all about. Your wallet ( physical) can be filled with money, but someday for reasons that are not totally depending on you, the time that you spend having some of it could be all thrown to trash.  I decided to live my life, to enjoy what I was really meant to be and this inspired me to create my own business that actually makes me forgot about the charts. What I really want to say to you guys is that you should do whatever makes you feel comfortable, is never to late to start working on your dreams, live your life and,eventually, money will come to you. It’s all about being wealthy, not rich.</p>\n</div><!-- SC_ON -->",
  "score": 182,
  "permalink": "/r/CryptoCurrency/comments/pwcore/im_quitting_my_job_because_of_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "pwcore",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As title says, I started investing in crypto (and losing eventually) some money,\nbut this happened to open my mind to what money is all about. Your wallet (\nphysical) can be filled with money, but someday for reasons that are not totally\ndepending on you, the time that you spend having some of it…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルにあるように、私は暗号への投資を始めて（そして最終的には失って）いくらかのお金を手に入れました。\nしかし、このことがきっかけで、お金とは何かということを考えるようになりました。あなたのお財布(\n物理的な）財布はお金でいっぱいになりますが、いつの日か、自分次第ではない理由で、そのお金を持っている時間が\nあなたの財布（物理的なもの）はお金でいっぱいになりますが、いつの日か、あなた次第ではありますが、その一部を持つために費やす時間は...",
      "title": "暗号のせいで仕事を辞めることになった"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "正如标题所说，我开始投资加密货币（并最终失去）一些钱。\n但这恰恰让我对金钱的本质有了新的认识。你的钱包（\n实物）可以装满钱，但有一天，由于一些不完全的原因\n取决于你，你花了多少时间来拥有它......",
      "title": "我因为加密货币而辞去工作"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "正如標題所說，我開始投資加密貨幣（並最終失去）一些錢。\n但這恰恰讓我對金錢的本質有了新的認識。你的錢包（\n實物）可以裝滿錢，但有一天，由於一些不完全的原因\n取決於你，你花了多少時間來擁有它......",
      "title": "我因爲加密貨幣而辭去工作"
    }
  ]
}