{
  "author": "feelsBAR",
  "the_new_excerpt": "I am by no means a big fish in crypto but I tend to read lots of related stuff\nhere on reddit and on telegram. Since 2018 I used to buy fractions of eth since\nI could not afford to buy a whole eth at once, yeah, us who live and work in\neastern Europe doesn't earn as much as western people. Majority…",
  "original_created_utc": 1612768517,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我绝不是加密领域的大鱼，但我倾向于阅读很多相关的东西。\n这里的reddit和telegram上。自2018年以来，我曾经买过乙醇的零头，因为。\n我一下子买不起整个eth，是啊，我们这些生活和工作在。\n东欧人的收入没有西方人多。大多数人...",
      "title": "在ATH卖掉乙醇，还清了运输的债务。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我絕不是加密領域的大魚，但我傾向於閱讀很多相關的東西。\n這裏的reddit和telegram上。自2018年以來，我曾經買過乙醇的零頭，因爲。\n我一下子買不起整個eth，是啊，我們這些生活和工作在。\n東歐人的收入沒有西方人多。大多數人...",
      "title": "在ATH賣掉乙醇，還清了運輸的債務。"
    }
  ],
  "title": "Sold eth at ATH, paid off my debts for transport.",
  "created_utc": 1612777342,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am by no means a big fish in crypto but I tend to read lots of related stuff here on reddit and on telegram. Since 2018 I used to buy fractions of eth since I could not afford to buy a whole eth at once, yeah, us who live and work in eastern Europe doesn&#39;t earn as much as western people. Majority of my salary was for covering flat rent, gas and transport fees, food and the tiny bits of what&#39;s left - crypto. Just a year ago I got my motorcycle driver license and of course being this dumbfounded youngster I went for the goods that are out of my wage: I bought well kept vintage Honda motorcycle (Sabre, 1985). With the profit that I gained from eth I have finally paid off my debt and not only that but I was also able to buy a proper gear and clothes to ride safe! </p>\n\n<p>I read stories here that some people pay off they mortgage or studies, some even are able to buy realy expensive things but things here are different. I am happy with what I was able to do! A big thanks for this community.</p>\n</div><!-- SC_ON -->",
  "score": 1779,
  "permalink": "/r/CryptoCurrency/comments/lf6ii5/sold_eth_at_ath_paid_off_my_debts_for_transport/",
  "subreddit": "CryptoCurrency",
  "id": "lf6ii5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123195586
}