{
  "author": "vjeva",
  "the_new_excerpt": "It is strange, we have the power to give and receive, and a one-time opportunity\nto support other redditors to earn some Moons here. But at the same time I have\nnoticed that there are a lot of redditors giving downvotes to a lot of posts -\nand I am not speaking about posts with opinions, I speak…",
  "original_created_utc": 1614599921,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "很奇怪，我们有施与受的权力，也有一次性的机会。\n以支持其他红人在这里赚取一些Moons。但同时我也有\n注意到有很多redditors给很多帖子下注--。\n我说的不是有意见的帖子，我说的是... ...",
      "title": "不受欢迎的意见。我感觉这里的大部分红人都很争气，尤其是在给上票的时候。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "很奇怪，我們有施與受的權力，也有一次性的機會。\n以支持其他紅人在這裏賺取一些Moons。但同時我也有\n注意到有很多redditors給很多帖子下注--。\n我說的不是有意見的帖子，我說的是... ...",
      "title": "不受歡迎的意見。我感覺這裏的大部分紅人都很爭氣，尤其是在給上票的時候。"
    }
  ],
  "title": "Unpopular opinion: I have a feeling that most of the redditors here are really competitive, especially when it comes to giving upvotes",
  "created_utc": 1614623495,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It is strange, we have the power to give and receive, and a one-time opportunity to support other redditors to earn some Moons here. But at the same time I have noticed that there are a lot of redditors giving downvotes to a lot of posts - and I am not speaking about posts with opinions, I speak about all sorts of posts. </p>\n\n<p>It feels sometimes as this is a competitive game where some redditors really think that if they downvote, that this is increasing their chances of gaining more Moons or perhaps winning. It&#39;s like: &quot;I want to be rich, but I don&#39;t want you to get rich&quot; attitude. </p>\n\n<p>Perhaps I&#39;m wrong but I get this kind of impression here. </p>\n\n<p>I don&#39;t say that we should upvote everything, but in general I think that its a nice thing to support each other as we all have the possibility to make a change.</p>\n</div><!-- SC_ON -->",
  "score": 309,
  "permalink": "/r/CryptoCurrency/comments/lv7ev3/unpopular_opinion_i_have_a_feeling_that_most_of/",
  "subreddit": "CryptoCurrency",
  "id": "lv7ev3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937738002
}