{
  "author": "IHateConspiracists",
  "original_created_utc": 1658787733,
  "title": "When did midnight become the standard starting point of a new day as opposed to dawn ?",
  "created_utc": 1658836571,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Dawn seems like a more natural starting point, even today many people refer to the next morning as &amp;quot;tomorrow&amp;quot; even if it&amp;#39;s past midnight.&lt;/p&gt;\n\n&lt;p&gt;So, why isn&amp;#39;t dawn considered the start of the day ? And when did midnight take that place  ? Is it a modern development originating with clocks or does it have ancient origins ?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/w824l8/when_did_midnight_become_the_standard_starting/",
  "subreddit": "AskHistorians",
  "id": "w824l8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Dawn seems like a more natural starting point, even today many people refer to\nthe next morning as \"tomorrow\" even if it's past midnight.\n\nSo, why isn't dawn considered the start of the day ? And when did midnight take\nthat place ? Is it a modern development originating with clocks or does it…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ドーンは、より自然な出発点のように思えるが、今日でも多くの人が、このことを指している。\n今でも多くの人が、夜中の12時を過ぎても翌朝を「あした」と呼んでいます。\n\nでは、なぜ夜明けが一日の始まりとされていないのだろうか？そして、真夜中はいつから\nいつから？時計に端を発した近代的発展なのか、それとも......。",
      "title": "夜明けではなく、真夜中が新しい1日の始まりの基準になったのはいつからでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "黎明似乎是一个更自然的起点，即使在今天，许多人也会提到\n第二天早上是 \"明天\"，即使它已经过了午夜。\n\n那么，为什么黎明不被认为是一天的开始？午夜又是什么时候取代\n占据了这个位置？这是一个源于时钟的现代发展，还是它...",
      "title": "午夜何时成为新一天的标准起点，而不是黎明？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "黎明似乎是一個更自然的起點，即使在今天，許多人也會提到\n第二天早上是 \"明天\"，即使它已經過了午夜。\n\n那麼，爲什麼黎明不被認爲是一天的開始？午夜又是什麼時候取代\n佔據了這個位置？這是一個源於時鐘的現代發展，還是它...",
      "title": "午夜何時成爲新一天的標準起點，而不是黎明？"
    }
  ]
}