{
  "author": "loganpizza",
  "the_new_excerpt": "I'll keep this short and to the point, because i'm fucking sick and tired of\nscrolling through WSB this morning seeing people talking out their ass. This is\nthe stock market, not the GME market. GME is not the only stock that exist. We\nall have the same sentiment that apes together strong and we…",
  "original_created_utc": 1614780654,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我会保持这个简短和重点， 因为我生病了，厌倦了他妈的\n今天早上滚动通过WSB看到人们在说他们的屁股。这是\n股市，而不是金交所市场。GME不是唯一存在的股票。我们\n所有的人都有同样的情感，猿人一起强大，我们... ...",
      "title": "RKT与GME弱智听好了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我會保持這個簡短和重點， 因爲我生病了，厭倦了他媽的\n今天早上滾動通過WSB看到人們在說他們的屁股。這是\n股市，而不是金交所市場。GME不是唯一存在的股票。我們\n所有的人都有同樣的情感，猿人一起強大，我們... ...",
      "title": "RKT與GME弱智聽好了"
    }
  ],
  "title": "RKT vs GME retards listen up",
  "created_utc": 1614793612,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ll keep this short and to the point, because i&#39;m fucking sick and tired of scrolling through WSB this morning seeing people talking out their ass. This is the stock market, not the GME market. GME is not the only stock that exist. We all have the same sentiment that apes together strong and we will hold GME. With that being said, NOT FUCKING EVERYTHING IS A PLOY BY HEDGE FUNDS TO GET YOU OUT OF GME. This rocket squeeze was created by CEO, the CEO of rocket has done amazing things with the company, and their balance sheet is impressive. He hates shorts as much as we do, so he decided to do something about it by essentially creating a gamma squeeze. Rocket was a really good play, especially with options. We don&#39;t need to discredit good plays just because they are not Gamestop.</p>\n</div><!-- SC_ON -->",
  "score": 15162,
  "permalink": "/r/wallstreetbets/comments/lwursn/rkt_vs_gme_retards_listen_up/",
  "subreddit": "wallstreetbets",
  "id": "lwursn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937759877
}