{
  "author": "Durdel",
  "original_created_utc": 1630592382,
  "title": "Did construction technology only improve rapidly in the last centuries or why was Napoleon bragging about how his bridge building was better than Caesar's 1800 years ago?",
  "created_utc": 1630614180,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In chapter 4 of his commentary on Caesar&#39;s commentary Napoleon criticised Plutarch for calling Caesar&#39;s Rhine bridge in 55 BC a miracle and states that it is unremarkable compared to his 1809 one. I find it hilarious that he brushes away the time difference. But maybe I am taking our rapid advancement for granted?</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/pgiu9v/did_construction_technology_only_improve_rapidly/",
  "subreddit": "AskHistorians",
  "id": "pgiu9v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In chapter 4 of his commentary on Caesar's commentary Napoleon criticised\nPlutarch for calling Caesar's Rhine bridge in 55 BC a miracle and states that it\nis unremarkable compared to his 1809 one. I find it hilarious that he brushes\naway the time difference. But maybe I am taking our rapid…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "カエサルの注釈書の第4章で、ナポレオンは次のように批判している。\nプルタルクが紀元前55年のシーザーのライン橋を奇跡と呼んだことを批判し，その橋は1809年の彼の橋に比べて\n1809年の彼のものと比べても目立たないと述べている。私は彼が時間差を無視しているのが可笑しいと思う。\n時差を無視しているのが笑える。しかし、もしかしたら、私は私たちの急速な...",
      "title": "建築技術が急速に進歩したのはここ数世紀のことであり、ナポレオンが1800年前のカエサルよりも自分の橋作りの方が優れていると自慢していたのはなぜか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "拿破仑在他的《凯撒评论》的第四章中批评了\n普鲁塔克称凯撒在公元前55年建造的莱茵河桥是一个奇迹，并指出，与他1809年的桥相比，它并不引人注目。\n与他1809年的桥相比，并不引人注目。我觉得很搞笑，他把\n我觉得很可笑，因为他把时间差一笔勾销了。但也许我是把我们的快速...",
      "title": "难道建筑技术只是在过去几个世纪才迅速提高，或者为什么拿破仑在吹嘘他的桥梁建设比1800年前的凯撒更好？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "拿破崙在他的《凱撒評論》的第四章中批評了\n普魯塔克稱凱撒在公元前55年建造的萊茵河橋是一個奇蹟，並指出，與他1809年的橋相比，它並不引人注目。\n與他1809年的橋相比，並不引人注目。我覺得很搞笑，他把\n我覺得很可笑，因爲他把時間差一筆勾銷了。但也許我是把我們的快速...",
      "title": "難道建築技術只是在過去幾個世紀才迅速提高，或者爲什麼拿破崙在吹噓他的橋樑建設比1800年前的凱撒更好？"
    }
  ]
}