{
  "author": "TheVeterano_007",
  "original_created_utc": 1634113378,
  "title": "How did a Space Rocket take off again from the surface of Moon?",
  "created_utc": 1634144562,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have seen many times in movies and other documentaries that when a space shuttle gets out of our atmosphere its propellers get detached and after flying for some time, it lands somewhere safely (Consider Moon). Now the question that has been troubling me is that if the rocket has no propulsion system to take off from the surface of moon then how does the rocket escape the Surface of Moon and how does it come back to Earth?<br/>\n(btw my first language is not English, so sorry if I said anything wrong)</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/askscience/comments/q76nz6/how_did_a_space_rocket_take_off_again_from_the/",
  "subreddit": "askscience",
  "id": "q76nz6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I have seen many times in movies and other documentaries that when a space\nshuttle gets out of our atmosphere its propellers get detached and after flying\nfor some time, it lands somewhere safely (Consider Moon). Now the question that\nhas been troubling me is that if the rocket has no propulsion…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "映画などのドキュメンタリーで何度も見たことがあるのですが、宇宙では\nスペースシャトルは大気圏外に出るとプロペラが切り離され、しばらく飛行した後に\nそして、しばらく飛行した後、安全な場所（月を考えてみてください）に着陸します。今、私が悩んでいるのは\nもし、ロケットに推進力がなければ...ということです。",
      "title": "宇宙ロケットはどのようにして月面から再離陸したのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我曾多次在电影和其他纪录片中看到，当航天飞机离开大气层时\n当航天飞机离开我们的大气层时，它的螺旋桨会脱离，在飞行一段时间后\n一段时间后，它就安全降落在某个地方（考虑到月球）。现在的问题是\n一直困扰着我的问题是，如果火箭没有推进器...",
      "title": "太空火箭是如何从月球表面再次起飞的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我曾多次在電影和其他紀錄片中看到，當航天飛機離開大氣層時\n當航天飛機離開我們的大氣層時，它的螺旋槳會脫離，在飛行一段時間後\n一段時間後，它就安全降落在某個地方（考慮到月球）。現在的問題是\n一直困擾着我的問題是，如果火箭沒有推進器...",
      "title": "太空火箭是如何從月球表面再次起飛的？"
    }
  ]
}