{
  "author": "Nojaja",
  "the_new_excerpt": "Yeah that’s right, I fucking said it.\n\nI’ve noticed the FUD campaign has been shifting lately, It’s shifted towards\ncalling al you retards actually retarded for buying GME at it’s height. While\nyeah, buying high and selling low is actually retarded, I am not disputing that.\n\nBut what I’ve noticed is…",
  "original_created_utc": 1613143306,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "是的，没错，我他妈的说了。\n\n我注意到最近的FUD运动一直在转变，它转向了...\n叫你们这些弱智其实是弱智，因为在GME的最高点买入了它。而\n是啊，高买低卖其实是弱智的，我不置可否。\n\n但我注意到的是... ...",
      "title": "每日提醒，28/1之前在300买入GME是当时的好戏。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "是的，沒錯，我他媽的說了。\n\n我注意到最近的FUD運動一直在轉變，它轉向了...\n叫你們這些弱智其實是弱智，因爲在GME的最高點買入了它。而\n是啊，高買低賣其實是弱智的，我不置可否。\n\n但我注意到的是... ...",
      "title": "每日提醒，28/1之前在300買入GME是當時的好戲。"
    }
  ],
  "title": "Daily reminder that buying GME at 300 before 28/1 was a great play at the time.",
  "created_utc": 1613151375,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Yeah that’s right, I fucking said it. </p>\n\n<p>I’ve noticed the FUD campaign has been shifting lately, It’s shifted towards calling al you retards actually retarded for buying GME at it’s height. While yeah, buying high and selling low is actually retarded, I am not disputing that. </p>\n\n<p>But what I’ve noticed is that no one seems to be mentioning the fact that Robinhood (and by extension the DTC)  LITERALLY HIT THE ‘OFF’ SWITCH ON BUYS. That’s fucking right it was a great play before 28/1 even at 300 or 400. (If you bought at 300 after 28/1 you may actually be retarded)</p>\n\n<p>The FUD campaign (or general memory loss from all the weed stonks) has made most of you forget that WE WERE FUCKING ROBBED.</p>\n\n<p>Never forget that GME is not over.</p>\n\n<p>Never forget that we were ROBBED of millions of dollars, not only in evaporated gains, but in actual investments with hard earned cash.</p>\n\n<p>20@226$GME 26/1</p>\n\n<p>Edit: DTC</p>\n\n<p>Lots of people seem to be understanding this post as saying GME will go up diamond hands etc. This is not what the purpose of this post is. </p>\n\n<p>The purpose of this post is to make people remember that this was not fair play. </p>\n\n<p>If all you retards calling me retarded and delusional could learn to fucking read, that be great.</p>\n</div><!-- SC_ON -->",
  "score": 31383,
  "permalink": "/r/wallstreetbets/comments/lid5uz/daily_reminder_that_buying_gme_at_300_before_281/",
  "subreddit": "wallstreetbets",
  "id": "lid5uz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728629779
}