{
  "author": "EscapeddreamerD",
  "original_created_utc": 1641796607,
  "title": "Do people carry their social security cards with then in their wallets?",
  "created_utc": 1641808233,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m asking because I recently misplaced my wallet for like a week and my brother in law was telling me I needed to get a new social security card. My response was I don&amp;#39;t carry my social security card in wallet. I asked him does he carry his he said yes. I then asked more of  my family do they carry their cards and they all said yes. This made me think I was the odd man out. Should I be carrying my social around with me?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 110,
  "permalink": "/r/NoStupidQuestions/comments/s0de4u/do_people_carry_their_social_security_cards_with/",
  "subreddit": "NoStupidQuestions",
  "id": "s0de4u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm asking because I recently misplaced my wallet for like a week and my brother\nin law was telling me I needed to get a new social security card. My response\nwas I don't carry my social security card in wallet. I asked him does he carry\nhis he said yes. I then asked more of my family do they carry…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、財布を1週間ほど失くしてしまい、弟に相談しました。\n新しいソーシャルセキュリティーカードが必要だと言われました。私の返事は\n私は財布にソーシャルセキュリティカードを入れていません。と聞いたところ\n彼は「そうだ」と答えました。私はさらに家族に携帯しているかと尋ねました...",
      "title": "ソーシャルセキュリティカードを財布に入れて持ち歩く人はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我问这个问题是因为我最近把钱包放错了地方，好像有一个星期了，我的兄弟在法律上告诉我，我需要买一个新的钱包。\n我的兄弟告诉我，我需要得到一个新的社会安全卡。我的回答是\n我的回答是，我的钱包里没有带社会保障卡。我问他有没有带\n他的，他说有。然后我问我的家人，他们是否携带社会保障卡？",
      "title": "人们会在钱包里随身携带他们的社会保障卡吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我問這個問題是因爲我最近把錢包放錯了地方，好像有一個星期了，我的兄弟在法律上告訴我，我需要買一個新的錢包。\n我的兄弟告訴我，我需要得到一個新的社會安全卡。我的回答是\n我的回答是，我的錢包裏沒有帶社會保障卡。我問他有沒有帶\n他的，他說有。然後我問我的家人，他們是否攜帶社會保障卡？",
      "title": "人們會在錢包裏隨身攜帶他們的社會保障卡嗎？"
    }
  ]
}