{
  "author": "Tiako",
  "original_created_utc": 1640268907,
  "title": "Was there actually an \"aristocratic\" opposition to fascism in Italy and Germany? An \"old guard\" of conservatives who though Hitler or Mussolini were grubby and uncouth?",
  "created_utc": 1640292040,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It is hard to point to a specific example now, but there is something of a trope of an old aristocrat who has deeply conservative and anti-democratic views but opposes the fascists because his sense of propriety and social order is upset by the grubby populism of the fascists and that buffoon, Hitler. I believe the model for this is often Claus von Stauffenberg and the July Plot more generally, but also as I understand that plot was less about ideological anti-fascism than about particular strategic concerns.&lt;/p&gt;\n\n&lt;p&gt;Beyond that I have heard everything from the German/Italian old aristocracy being enthusiastic supporters of the new fascist movements, to their sidelining being vital to the movements&amp;#39; success.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/rmwkmr/was_there_actually_an_aristocratic_opposition_to/",
  "subreddit": "AskHistorians",
  "id": "rmwkmr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It is hard to point to a specific example now, but there is something of a trope\nof an old aristocrat who has deeply conservative and anti-democratic views but\nopposes the fascists because his sense of propriety and social order is upset by\nthe grubby populism of the fascists and that buffoon,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今、具体的な例を挙げるのは難しいのですが、ある種のトロピカルな\n保守的で反民主的な考えを深く持つが、老いた貴族のようなもの。\nファシストに反対するのは、自分の礼儀や社会秩序に対する感覚が狂っているからだ。\nファシストの薄汚いポピュリズムや、あのバカヤローは...。",
      "title": "イタリアやドイツでは、ファシズムに反対する「貴族」が実際に存在したのでしょうか。ヒトラーやムッソリーニを不潔で野暮ったい存在と考える保守派の「オールドガード」？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "现在很难指出一个具体的例子，但有一些特例\n有一个老贵族，他有非常保守和反民主的观点，但却反对法西斯，因为他的父亲是法西斯。\n他反对法西斯，因为他的礼节和社会秩序感被法西斯的肮脏的民粹主义所扰。\n法西斯分子的肮脏的民粹主义和那个小丑打乱了他的意识。",
      "title": "在意大利和德国是否真的有 \"贵族 \"反对法西斯主义？一个认为希特勒或墨索里尼是邋遢和粗野的保守派的 \"守旧派\"？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "現在很難指出一個具體的例子，但有一些特例\n有一個老貴族，他有非常保守和反民主的觀點，但卻反對法西斯，因爲他的父親是法西斯。\n他反對法西斯，因爲他的禮節和社會秩序感被法西斯的骯髒的民粹主義所擾。\n法西斯分子的骯髒的民粹主義和那個小丑打亂了他的意識。",
      "title": "在意大利和德國是否真的有 \"貴族 \"反對法西斯主義？一個認爲希特勒或墨索里尼是邋遢和粗野的保守派的 \"守舊派\"？"
    }
  ]
}