{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "I know still quite some people (particularly new investors) are itching to get into the market to buy the dip/bottom. We also see advice from people with enticing lines [like this](https://www.msn.com/en-us/money/topstocks/u-s-stock-crash-is-huge-opportunity-to-cash-in-top-investor/ar-AAYAx9J): \"U.S. stock crash could present Americans with a \"monstrous\" opportunity when looking at the economy from a long-term perspective\".\n\nNow my advice is: Don't listen to them. Instead, what you should do is two things: 1. Be patient. 2. Wait for clarity in economy and fiscal policies. Then you put your money into the market. Yes, you might miss the bottom, but you would avoid a lot of pain.\n\nIf you don't believe me, at least believe the history. In the last 22 years, Nasdaq pulled back 35% three times before this year:\n\n1. 2000. Nasdaq peaked at 5132 in early March 2000, dived 40%+ the next 2.5 months. If you had bought in then like you're considering now, even if you bought exactly at the local bottom, you'd be looking at another nearly 2.5 years of pain with a further 63% loss from your purchase before Nasdaq finally bottomed. But if you had just waited for clarity, even if you missed the bottom by 3 months, you would still be up 678% from your purchase point to now! Had you bought when Nasdaq was 40% down, your gain over the same period was 255% (edit: it's not the same period, it's actually almost 2.5 years longer with less return). Yes, a big difference.\n2. 2008. Nasdaq peaked at 2862 in Oct 2007, dived 25% the next 5 months. If you had bought in then at the local bottom, you'd be looking at another 1 year of pain with a further 41% loss from your purchase before Nasdaq finally bottomed. But if you waited for clarity and missed the bottom by 3 months, you would still be up 484% from your purchase point to now! Had you bought when Nasdaq dropped to local bottom after 5 months and 25%, your gain over the same period was 401% (edit: it's not the same period, it's actually 1 year longer but with less return), still not as good as when you had waited.\n3. 2020. Nasdaq bottomed after just a month and 35% drop. If you bought exactly at the bottom vs 3 months later, then you'd gain 62% vs 9%. This time buying the bottom won because: 1. We assumed you actually bought at the bottom. 2. We assumed that the alternative is that you missed bottom by 3 months long. 3. Most importantly, 2020 was so different than the other 3 times, namely 2000, 2008 and 2022, because in 2020 the global governments all went super easy on fiscal policies, flooding the market with liquidity, which caused the problem now. 2020 was an aberration that has less historical parallel or usefulness as a lesson.\n\nSo clearly I'm arguing again for my rules based on both reasoning and historical support:\n\n1. Be patient.\n2. Wait for clarity in economy and fiscal policies. If you watch news and sentiments, you probably can see it less than 3 months post bottom and catch most of the gains.\n3. Then you put your money into the market.\n\nThat's it. You'll make good/better money without having to endure the stress and pain for months or years first. Follow my rules and you'll thank me later. :)\n\nYes you can argue for DCA, but that's not the active investing we're talking about here. And DCA would still have been in for a long period of pain in 2000 and 2008 with quite likely a worse return.\n\nEdit: How to watch out for clarity? If you're not experienced, just watch the Feds and the market. When they pivot on the fiscal policy to clearly more dovish, it will help the economy and the stock market. They won't pivot unless there's clear signs that the worst inflation is over. Yes - economy could've been hurt then, and quite likely so. But stock market is forward looking and will react. The local bottom before the dovish fiscal policy will quite possibly be the actual bottom. Of course there's no fail safe method to absolutely catch the bottom - but it's surely better than buying too much earlier than the bottom!",
  "author_fullname": "t2_a7hiqdtz",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "A history-based advice to new (or over-confident) investors",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_vewvw3",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.8,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 43,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 43,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": 1655527056,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1655521420,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I know still quite some people (particularly new investors) are itching to get into the market to buy the dip/bottom. We also see advice from people with enticing lines &lt;a href=\"https://www.msn.com/en-us/money/topstocks/u-s-stock-crash-is-huge-opportunity-to-cash-in-top-investor/ar-AAYAx9J\"&gt;like this&lt;/a&gt;: &amp;quot;U.S. stock crash could present Americans with a &amp;quot;monstrous&amp;quot; opportunity when looking at the economy from a long-term perspective&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Now my advice is: Don&amp;#39;t listen to them. Instead, what you should do is two things: 1. Be patient. 2. Wait for clarity in economy and fiscal policies. Then you put your money into the market. Yes, you might miss the bottom, but you would avoid a lot of pain.&lt;/p&gt;\n\n&lt;p&gt;If you don&amp;#39;t believe me, at least believe the history. In the last 22 years, Nasdaq pulled back 35% three times before this year:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;2000. Nasdaq peaked at 5132 in early March 2000, dived 40%+ the next 2.5 months. If you had bought in then like you&amp;#39;re considering now, even if you bought exactly at the local bottom, you&amp;#39;d be looking at another nearly 2.5 years of pain with a further 63% loss from your purchase before Nasdaq finally bottomed. But if you had just waited for clarity, even if you missed the bottom by 3 months, you would still be up 678% from your purchase point to now! Had you bought when Nasdaq was 40% down, your gain over the same period was 255% (edit: it&amp;#39;s not the same period, it&amp;#39;s actually almost 2.5 years longer with less return). Yes, a big difference.&lt;/li&gt;\n&lt;li&gt;2008. Nasdaq peaked at 2862 in Oct 2007, dived 25% the next 5 months. If you had bought in then at the local bottom, you&amp;#39;d be looking at another 1 year of pain with a further 41% loss from your purchase before Nasdaq finally bottomed. But if you waited for clarity and missed the bottom by 3 months, you would still be up 484% from your purchase point to now! Had you bought when Nasdaq dropped to local bottom after 5 months and 25%, your gain over the same period was 401% (edit: it&amp;#39;s not the same period, it&amp;#39;s actually 1 year longer but with less return), still not as good as when you had waited.&lt;/li&gt;\n&lt;li&gt;2020. Nasdaq bottomed after just a month and 35% drop. If you bought exactly at the bottom vs 3 months later, then you&amp;#39;d gain 62% vs 9%. This time buying the bottom won because: 1. We assumed you actually bought at the bottom. 2. We assumed that the alternative is that you missed bottom by 3 months long. 3. Most importantly, 2020 was so different than the other 3 times, namely 2000, 2008 and 2022, because in 2020 the global governments all went super easy on fiscal policies, flooding the market with liquidity, which caused the problem now. 2020 was an aberration that has less historical parallel or usefulness as a lesson.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;So clearly I&amp;#39;m arguing again for my rules based on both reasoning and historical support:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Be patient.&lt;/li&gt;\n&lt;li&gt;Wait for clarity in economy and fiscal policies. If you watch news and sentiments, you probably can see it less than 3 months post bottom and catch most of the gains.&lt;/li&gt;\n&lt;li&gt;Then you put your money into the market.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;That&amp;#39;s it. You&amp;#39;ll make good/better money without having to endure the stress and pain for months or years first. Follow my rules and you&amp;#39;ll thank me later. :)&lt;/p&gt;\n\n&lt;p&gt;Yes you can argue for DCA, but that&amp;#39;s not the active investing we&amp;#39;re talking about here. And DCA would still have been in for a long period of pain in 2000 and 2008 with quite likely a worse return.&lt;/p&gt;\n\n&lt;p&gt;Edit: How to watch out for clarity? If you&amp;#39;re not experienced, just watch the Feds and the market. When they pivot on the fiscal policy to clearly more dovish, it will help the economy and the stock market. They won&amp;#39;t pivot unless there&amp;#39;s clear signs that the worst inflation is over. Yes - economy could&amp;#39;ve been hurt then, and quite likely so. But stock market is forward looking and will react. The local bottom before the dovish fiscal policy will quite possibly be the actual bottom. Of course there&amp;#39;s no fail safe method to absolutely catch the bottom - but it&amp;#39;s surely better than buying too much earlier than the bottom!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "vewvw3",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "LKlong88",
  "discussion_type": null,
  "num_comments": 40,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/vewvw3/a_historybased_advice_to_new_or_overconfident/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/vewvw3/a_historybased_advice_to_new_or_overconfident/",
  "subreddit_subscribers": 4189060,
  "created_utc": 1655537452,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1655521420,
  "the_new_excerpt": "I know still quite some people (particularly new investors) are itching to get\ninto the market to buy the dip/bottom. We also see advice from people with\nenticing lines like this\n[https://www.msn.com/en-us/money/topstocks/u-s-stock-crash-is-huge-opportunity-to-cash-in-top-investor/ar…"
}