{
  "author": "ParrotMafia",
  "the_new_excerpt": "Steel manufacturing companies are set to make record profits in the next few\nyears. Demand is up huge. The post-COVID boom is starting.\n[https://www.appraisalbuzz.com/biggest-construction-boom-since-2006-best-2-weeks-for-rates-in-a-year/]\nThe rotation out of tech is under way. And analysts are…",
  "original_created_utc": 1620309677,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "製鉄会社は今後数年間で記録的な利益を上げることになる。\n数年後には記録的な利益を上げるだろう。需要は大幅に増加している。ポストCOVIDブームの始まりです。\n[https://www.appraisalbuzz.com/biggest-construction-boom-since-2006-best-2-weeks-for-rates-in-a-year/]\n技術系からの脱却が進んでいる。アナリストも...",
      "title": "技術で落ち込んでいませんか？コモディティ、特に鉄鋼について考えてみましょう。様々な理由で。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "钢铁制造公司将在未来几年内获得创纪录的利润。\n几年的利润。需求大增。后COVID时代的繁荣正在开始。\n[https://www.appraisalbuzz.com/biggest-construction-boom-since-2006-best-2-weeks-for-rates-in-a-year/]\n科技领域的轮换正在进行中。而分析家们正在...",
      "title": "科技让你失望了吗？考虑一下大宗商品，特别是钢铁。由于各种各样的原因。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "鋼鐵製造公司將在未來幾年內獲得創紀錄的利潤。\n幾年的利潤。需求大增。後COVID時代的繁榮正在開始。\n[https://www.appraisalbuzz.com/biggest-construction-boom-since-2006-best-2-weeks-for-rates-in-a-year/]\n科技領域的輪換正在進行中。而分析家們正在...",
      "title": "科技讓你失望了嗎？考慮一下大宗商品，特別是鋼鐵。由於各種各樣的原因。"
    }
  ],
  "title": "Has tech got you down? Consider commodities, in particular, steel. For a variety of reasons:",
  "created_utc": 1620314365,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Steel manufacturing companies are set to make record profits in the next few years. Demand is up huge. <a href=\"https://www.appraisalbuzz.com/biggest-construction-boom-since-2006-best-2-weeks-for-rates-in-a-year/\">The post-COVID boom is starting.</a> The rotation out of tech is under way. And analysts are finally coming to their senses and raising estimates of steel companies, because:</p>\n\n<hr/>\n\n<p><strong>Steel prices are obscenely high</strong></p>\n\n<p>These are literally record high steel prices. This mean serious profit. Imagine if people were willing to pay Apple 2 to 3 times as much for an iPhone. <a href=\"https://i.imgur.com/2sRd8M1.png\">Price of steel 2009 – 2021</a> </p>\n\n<p>And this is not just for the moment, but for the rest of the year and beyond. There are record high steel futures as well, and they are only rising. <a href=\"https://www.cmegroup.com/trading/metals/ferrous/hrc-steel_quotes_globex.html\">Future steel futures</a> </p>\n\n<p>This means that people expect steel prices to be high in the future. They are paying these prices right now for steel months away, because they expect this locked-in price to be cheaper than the actual price of steel (however many months/years away).</p>\n\n<hr/>\n\n<p><strong>Inflation</strong></p>\n\n<p>The hot topic right now.  <a href=\"https://www.bloomberg.com/news/articles/2021-05-01/the-price-of-the-stuff-that-makes-everything-is-surging?srnd=premium\">Global economic rebound is fueling a blistering commodities rally.</a>  Will the Fed be able to control inflation? Many expect inflation to climb regardless as there has been so much money printed. During periods of high inflation, Michael Burry thinks you want to be in <a href=\"https://twitter.com/BurryArchive/status/1363909572243705859/photo/1\">real estate and commodities</a>. </p>\n\n<p>And even if inflation doesn’t cross 3%, the fear of it will drive people to hedge part of their portfolio in commodities.</p>\n\n<hr/>\n\n<p><strong>China&#39;s rebate</strong></p>\n\n<p>In 2020, China produced 56.5% of the world’s steel. This was helped by a 13% rebate on all steel exported. Sell steel for $100, get $100 from the buyer and $13 from the government.</p>\n\n<p>But now China wants to cut their steel production to deal with smog. </p>\n\n<p>Starting May 1st 2021 (6 days ago!), there is a now 0% import tariff &amp; 20-25% export tariff on materials. This is great news for vertically integrated steel companies like CLF and MT than mine their own ore. Not great news for other steel companies that need to buy iron ore- the price of ore is already high and now it’s getting a lot worse.</p>\n\n<p>Starting May 1st 2021, the Chinese rebate for exported steel will be cut from 13% to 0%. If China is cutting their steel production, they still want to grow and build, so they want to keep as much steel inside China as possible. This is amazing news for steel companies outside of China, as their major competitor’s product just got the equivalent of 13% more expensive.</p>\n\n<p>Sources (you will need to translate this):</p>\n\n<p><a href=\"http://gss.mof.gov.cn/gzdt/zhengcejiedu/202104/t20210428_3694153.htm\">zero import tariff rate for pig iron, crude steel, recycled steel raw materials... export tariffs for ferrosilicon, ferrochrome, high-purity pig iron and other products are appropriately increased, and the export tax rate of 25% and 20%...</a> </p>\n\n<p>and</p>\n\n<p><a href=\"http://m.mof.gov.cn/czxw/202104/t20210428_3694213.htm\">The announcement regarding the cancellation of export tax rebates for some steel products is hereby announced as follows: From May 1, 2021, the export tax rebate for some steel products will be cancelled. See the attachment for the specific product list. The specific execution time shall be defined by the export date indicated on the export goods declaration form.</a> </p>\n\n<hr/>\n\n<p><strong>Where in particular to invest?</strong> </p>\n\n<p>Steel in general will make a killing in 2021 and beyond. A commodities <a href=\"https://www.institutionalinvestor.com/article/b1r0r28fl471c5/are-we-witnessing-the-start-of-a-new-commodities-supercycle#:%7E:text=Commodity%20super%20cycles%20are%20decade,their%20long%2Dterm%20price%20trend.\">supercycle.</a></p>\n\n<p>There is good reason to look more closely at CLF (US company) and MT (European company). CLF recently jumped 10% a few days ago and is now consolidating. CLF is generally more of an upward pointed rollercoaster while MT is a gentler climb.</p>\n\n<p>CLF and MT are vertically integrated and mine their own ore. For the most part they have better financials than many of their competitors, and have invested more into their futures. MT is actively buying back shares while CLF&#39;s CEO LG said on his last call they will &quot;look after shareholders&quot; after aggressively paying down their debt. It won&#39;t take long, they are making a ton of money.</p>\n\n<p>CLF has the benefit of a firebrand CEO, Lourenco Goncalves, who actively looks out for investors. Additionally, the U.S. infrastructure bill is going to require an incredibly large amount of (US) steel. In the short term, speeches involving this bill and the passing of the bill will be major catalysts, and in the long term the profits from the bill will be reflected in earnings reports for years.</p>\n\n<p>As people seem to put (far too much) weight on short interest, some might want to know that CLF has short interest of 11.26% as reported by Ortex. Those shorters are hurting and are going to need to buy their way out soon. </p>\n\n<p>MT released quarterly earnings today and did amazingly, beating already sky-high estimates by an additional 20%. Their best quarter in a decade. <a href=\"https://www.bloomberg.com/news/articles/2021-05-06/arcelormittal-reports-best-quarter-in-decade-as-steel-joins-boom\">Commodities Boom Grips Steel</a> </p>\n\n<p>And these amazing Q1 numbers don&#39;t even fully account for the new record high prices. Steel&#39;s day is just beginning. This is not a buy-today and sell-tomorrow play, this is a buy-sometime-soon and hold-for-a-long-time play.</p>\n\n<p>Positions: I have shares and LEAPs in CLF and MT at a variety of strikes.</p>\n</div><!-- SC_ON -->",
  "score": 902,
  "permalink": "/r/stocks/comments/n67yep/has_tech_got_you_down_consider_commodities_in/",
  "subreddit": "stocks",
  "id": "n67yep",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985995609
}