{
  "author": "Dr_Pips_Rips_Dips",
  "the_new_excerpt": "Hey Trader Gang!\n\nToday I bring to you an introduction to one of my favorite indicators, the\nRelative Strength Index (RSI). In my opinion, RSI is perhaps one of the most\nwidely misunderstood and incorrectly applied indicators across the broader\ntrading space. Whenever you see RSI getting talked…",
  "original_created_utc": 1613602745,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "嘿，交易者帮!\n\n今天我给大家带来的是我最喜欢的一个指标，即\n相对强弱指数（RSI）。在我看来，RSI也许是最重要的一个\n被广泛误解和不正确地应用的指标。\n交易空间。每当你看到RSI被谈论...",
      "title": "技术分析系列（4）。相对强弱指数(RSI)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嘿，交易者幫!\n\n今天我給大家帶來的是我最喜歡的一個指標，即\n相對強弱指數（RSI）。在我看來，RSI也許是最重要的一個\n被廣泛誤解和不正確地應用的指標。\n交易空間。每當你看到RSI被談論...",
      "title": "技術分析系列（4）。相對強弱指數(RSI)"
    }
  ],
  "title": "Technical Analysis Series (4): Relative Strength Index (RSI)",
  "created_utc": 1613627547,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey Trader Gang!</p>\n\n<p>Today I bring to you an introduction to one of my favorite indicators, the Relative Strength Index (RSI). In my opinion, RSI is perhaps one of the most widely misunderstood and incorrectly applied indicators across the broader trading space. Whenever you see RSI getting talked about on CNBC, they usually say something along the lines of, &quot;RSI is severely overbought, so the stock must go down soon.&quot; If that&#39;s all you know about RSI, or you don&#39;t even know wtf RSI is to begin with, this post is for you!</p>\n\n<p>As I will explain in this post, technical analysis on RSI is much more nuanced than if the RSI is merely over 70 (standard overbought range) or under 30 (standard oversold range). RSI becomes truly powerful when it used in tandem with analysis of the price action of the asset to spot <strong><em>DIVERGENCE</em></strong> between the RSI and the price of the asset. In this post we will run through what RSI is, what divergence is and how to spot it, the various ranges on RSI, and a few other tips and tricks I&#39;ve learned over the years.</p>\n\n<p>So let&#39;s get into it.</p>\n\n<p><strong>What is RSI?</strong></p>\n\n<p>RSI stands for Relative Strength Index and is a <strong><em>momentum</em></strong> indicator that measures the magnitude of recent price movements to evaluate overbought or oversold conditions. RSI was developed by J. Welles Wilder Jr., and was introduced by him in 1978.</p>\n\n<p>A critical concept for new technical analysts to understand is the difference between price action trends and momentum trends. Price <strong><em>can</em></strong> <strong><em>keep going up</em></strong> as momentum drops off in strong trending markets, which results in <strong><em>divergence</em></strong> building between the price action and the momentum oscillator. Furthermore, in strong trending markets this divergence can build for a significant amount of time. So, just because momentum is dropping off does not necessarily imply that price action will immediately fall off a cliff.</p>\n\n<p><strong>The Number Crunching for the Curious</strong></p>\n\n<p>While not necessary for this post, a general explanation of how RSI is calculated is useful in understanding the indicator.</p>\n\n<p>RSI is derived through a two step calculation:</p>\n\n<p>Step 1:</p>\n\n<p><em>RSI</em> step one = 100 − [100 / 1 + average gain/average loss]</p>\n\n<p>The average gain or loss utilized for this calculation is the average percentage gain or loss during the selected <strong><em>look-back period</em></strong> (I will touch on the relevance of this look back period more when we get to covering divergences on RSI). For the math guys and gals out there it should also be noted that the formula uses a positive value for the average loss.</p>\n\n<p>The standard setting for the RSI <strong><em>look-back period</em></strong> is 14. Accordingly, on a 1 Day time frame chart, the RSI is looking at the prior 14 days of price action to determine the average gain/average loss values. I will speak more about the <strong><em>look-back period</em></strong> later and its relevance to spotting divergences in price action.</p>\n\n<p>Step 2:</p>\n\n<p>Once the data for the 14 periods is derived, step two of the calculation may take place:</p>\n\n<p><em>RSI</em> step two = 100− [100/ 1 + ((Previous Average Gain × 13) + Current Gain/ (Previous Average Loss × 13) + Current Loss)]</p>\n\n<p>Using the two-step formula approach above results in the current RSI number, lying somewhere between 100 and 0. Using this formula, RSI will only near 100 or 0 in <strong>extremely strong trending markets</strong>. This is because an integral component of the RSI formula is comparing the current gain to the previous average gains and losses, so for RSI to get close to 100 or 0 the asset really needs to be moving like a breakaway train.</p>\n\n<p><strong>RSI LOOK-BACK PERIOD AND EMA</strong></p>\n\n<p>As previously mentioned, the standard RSI look-back period is 14. This means that the RSI calculation is taking into account the prior 14 periods, and therefore divergences on price action outside of this 14 period look-back loose a significant amount of relevance. Personally, I set my look-back period for RSI at 21 because it allows for a larger data set to be analyzed when looking for divergences.</p>\n\n<p>In addition, I run an ema on my RSI as I find it useful for analysis of the indicator (14 period RSI/22 or 21 ema and 21 period RSI/9 ema).</p>\n\n<p><strong>What is Divergence</strong></p>\n\n<p>To really get into discussing RSI we also need to cover Divergence. This is a quick crash course on various types of divergence, although I could dedicate an entire post to merely this topic alone. Divergence occurs when momentum oscillators are not lining up with the price action, thereby indicating a potential incoming change in the price of the asset. Spotting divergences can take quite a bit of practice, so don&#39;t get discouraged if it doesn&#39;t immediately click. Nobody said this stuff was easy!</p>\n\n<p>Below is a little cheat sheet on divergences in relation to price action (the blue lines represent price action and the red lines represent a momentum oscillator such as RSI): <a href=\"https://imgur.com/gallery/EfcNF28\">https://imgur.com/gallery/EfcNF28</a></p>\n\n<p>The simplified rationale for what these divergences mean is as follows:</p>\n\n<p><strong>Regular Bearish Divergence</strong>: price is setting a higher high while the oscillator is setting a lower high.</p>\n\n<ul>\n<li>This divergence signifies that there is less momentum accompanying the higher high in price, therefore signaling that participation by the bulls is dwindling at these higher price levels.</li>\n<li>Here is an example of regular bearish divergence playing out on Nike on the 3 day chart: <a href=\"https://imgur.com/user/DrPipsRipsDips/posts\">https://imgur.com/user/DrPipsRipsDips/posts</a></li>\n</ul>\n\n<p><strong>Regular Bullish Divergence:</strong> price is setting a lower low while the oscillator is setting a higher low.</p>\n\n<ul>\n<li>This divergence signifies that there is less momentum accompanying the lower low in price, therefore signaling that participation by the bears is dwindling at these lower price levels.</li>\n<li>Here is an example of regular bullish divergence playing out on Nike on the 3 day chart: <a href=\"https://imgur.com/gallery/FtCFWIr\">https://imgur.com/gallery/FtCFWIr</a></li>\n</ul>\n\n<p><strong>Hidden Bearish Divergence</strong>: price is setting a lower low <strong><em>in a downtrend</em></strong>while the oscillators is setting a higher high.</p>\n\n<ul>\n<li>This divergence signifies that there is more momentum/buy pressure being put into the asset and despite that there is a resulting lower low in price.\n\n<ul>\n<li>In essence this shows that the bulls are pumping in increased momentum into the asset and that still cannot prevent a lower low from taking place.</li>\n<li>Hidden divergences can be quite tricky to spot for the new trader and my general rule of thumb is play hidden bear div in bear markets, not bull markets.</li>\n</ul></li>\n<li>Here is an example of hidden bearish divergence playing out on Nike on the 3 Day chart: <a href=\"https://imgur.com/gallery/OYTz3x0\">https://imgur.com/gallery/OYTz3x0</a></li>\n</ul>\n\n<p><strong>Hidden Bullish Divergence</strong>: price is setting a higher low <strong><em>in an uptrend</em></strong> while the oscillator is setting a lower low.</p>\n\n<ul>\n<li>This divergence signifies that there is less momentum/buy pressure being put into the asset and despite that drop in buy pressure there is a higher low in price.\n\n<ul>\n<li>In essence this shows that the bears are selling more and the bulls are buying less and yet this still cannot prevent a higher low (bears would want a lower low) from taking place.</li>\n<li>Hidden divergence can be quite tricky to spot for the new trader and my general rule of thumb is play hidden bull div in bull markets, not bear markets.</li>\n</ul></li>\n<li>Here is an example of hidden bullish divergence playing out on Nike on the 3 Day chart: <a href=\"https://imgur.com/gallery/dFaCxuw\">https://imgur.com/gallery/dFaCxuw</a></li>\n</ul>\n\n<p><strong>Elevated Divergence:</strong></p>\n\n<ul>\n<li>Elevated Divergence is driving at the same concepts explained in Regular Bull/Bear divergence, except instead of a higher or lower price, the oscillator is much higher or lower while price <strong>is the same</strong>. This also indicates a significant shift of momentum on the asset in relation to price.</li>\n</ul>\n\n<p>A <strong><em>critical element</em></strong> of the RSI formula to keep in mind is that the RSI values are calculated off of the <strong><em>closing price</em></strong> of the candle. Accordingly, candle wicks <strong><em>should not</em></strong> be used to try and spot divergence. For spotting divergences on RSI the correct methodology should be that on green candles the top of the candle body is used and on red candles the bottom of the candle body is used.</p>\n\n<p>Another <strong><em>critical element</em></strong> on divergence is that divergence will often &quot;build&quot;, especially if using a lower term time frame such as the 1 day, 4 hour, 1 hour, etc. On lower and medium term time frames it is often prudent to wait and see three &quot;strikes&quot; of divergence before looking to make a trade based upon the RSI divergence.</p>\n\n<p>See the multiple strikes of divergence present on the 4h for QQQ: <a href=\"https://imgur.com/gallery/BdgEhpB\">https://imgur.com/gallery/BdgEhpB</a></p>\n\n<p><strong>Major RSI Zones &amp; Overbought/Oversold Levels</strong></p>\n\n<p>The zone that the RSI currently finds itself within can give a strong indication of whether bulls or bears are in control. It should be noted that these zones gain more relevance on higher time frames regarding who is in control of the larger trend. In addition, how price action reacts off of the borders of these zones can be very useful for technical analysis. For example, if price is trying to break over a critical horizontal resistance level, but RSI is rejected from getting into the bull control zone (over 65), it may very well be an early indication that the breakout is going to fail, or at least stall for a bit.</p>\n\n<p><strong>ZONES</strong></p>\n\n<p>The Zones are as follows:</p>\n\n<ol>\n<li>65+ = bull control zone (bulls are regarded as being in control with RSI above this level)</li>\n<li>64-46 = neutral zone (this area is regarded as neutral, and may be dipped into on a bullish/bearish &quot;reset&#39; of the oscillators)</li>\n<li>45- = bear control zone (bears are regarded as being in control with RSI below this level)</li>\n</ol>\n\n<p>Below are some examples of RSI zones in action:</p>\n\n<ol>\n<li>Rejection of getting into bull control zone: <a href=\"https://imgur.com/gallery/f46SCR5\">https://imgur.com/gallery/f46SCR5</a></li>\n<li>Finding support along edge of bear control zone: <a href=\"https://imgur.com/gallery/YF4eIYD\">https://imgur.com/gallery/YF4eIYD</a></li>\n</ol>\n\n<p><strong>OVERBOUGHT/OVERSOLD</strong></p>\n\n<p>Due to the reasons explained in this post, blindly selling or buying an asset merely because it is overbought or oversold will often result in less than ideal results. However, whether an asset is &quot;overbought/oversold&quot; is still an important factor to consider and <strong><em>I have noticed</em></strong> that on very high time frames (1 week, 1 month) an asset will not remain overbought or oversold for a very long period of time. That being said, in strong bull markets RSI can spend more time over 80 than you&#39;d think and the same applies for strong bear markets and under 30/20. Conversely, in a strong bull market RSI on higher term time frames will often bounce extremely quickly from under 30 reflecting the strong macro trend (vice versa for over 70 in bear markets).</p>\n\n<p>Below are the criteria for overbought and oversold:</p>\n\n<ol>\n<li>Overbought = over 70 (over 80 in strong bull markets)\n\n<ol>\n<li>Here is a chart of overbought RSI on the 1 week on S&amp;P 500 futures: <a href=\"https://imgur.com/gallery/BDE4iWF\">https://imgur.com/gallery/BDE4iWF</a></li>\n</ol></li>\n<li>Oversold = below 30 (below 20 in strong bear markets, if anyone still remembers what one of those is :D)\n\n<ol>\n<li>Here is a chart of oversold RSI on the 1 week on S&amp;P 500 Futures: <a href=\"https://imgur.com/gallery/2h7RIW4\">https://imgur.com/gallery/2h7RIW4</a></li>\n</ol></li>\n</ol>\n\n<p>That covers this crash course in RSI. Now the next time you hear a suit on TV or a Youtuber talking about overbought/oversold RSI and that as a result the asset must reverse course soon, you can proudly assure yourself that the person doesn&#39;t know as much as about RSI as you do!</p>\n</div><!-- SC_ON -->",
  "score": 70,
  "permalink": "/r/stocks/comments/lm76sy/technical_analysis_series_4_relative_strength/",
  "subreddit": "stocks",
  "id": "lm76sy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728625114
}