{
  "author": "gilgamesh_20",
  "original_created_utc": 1630395220,
  "title": "Is crypto anything other than a money making scheme to you? Yes, it's only a money making scheme for me. I'm not in it for the tech.",
  "created_utc": 1630416638,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Me and all my homies buy crypto and it&#39;s nothing more than a money making scheme for us. We can&#39;t actually use crypto anywhere here and we probably won&#39;t use crypto for at least another decade.</p>\n\n<p>Crypto will never overthrow fiat, and especially in my country(developing)where cash is preferred almost everywhere,  accepting crypto is very far into the future.</p>\n\n<p>What are you guys in it for? Do you buy crypto cause you love the technology? Or you want to overthrow banks? Or like me, just want to DCA and sell off in future and become rich? \nOr all of it?</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/pf1316/is_crypto_anything_other_than_a_money_making/",
  "subreddit": "CryptoCurrency",
  "id": "pf1316",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Me and all my homies buy crypto and it's nothing more than a money making scheme\nfor us. We can't actually use crypto anywhere here and we probably won't use\ncrypto for at least another decade.\n\nCrypto will never overthrow fiat, and especially in my country(developing)where\ncash is preferred almost…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "俺も仲間も暗号を買っているが、それは金儲けの手段に過ぎない。\nているだけだ。ここでは実際に暗号を使うことはできないし、少なくともあと10年は暗号を使うことはないだろう。\n最低でもあと10年は使えないだろう\n\n暗号が不換紙幣を打倒することはないでしょうし、特に私の国（発展途上国）では\n特に私の国（発展途上国）では現金が好まれています。",
      "title": "あなたにとって、暗号はお金儲け以外の何物でもありませんか？はい、私にとっては金儲けの手段でしかありません。技術的なことが目的ではありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我和我所有的朋友都买了加密货币，这只不过是一个赚钱的计划。\n对我们来说。我们不能在任何地方实际使用加密货币，而且我们可能在至少十年内都不会使用\n至少再过十年也不会使用加密货币。\n\n加密货币永远不会推翻法定货币，特别是在我的国家（发展中国家），现金几乎是首选。\n现金几乎是首选...",
      "title": "对你来说，加密货币除了是一个赚钱的计划外，还有其他东西吗？是的，对我来说，它只是一个赚钱的计划。我不是为了技术而加入的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我和我所有的朋友都買了加密貨幣，這只不過是一個賺錢的計劃。\n對我們來說。我們不能在任何地方實際使用加密貨幣，而且我們可能在至少十年內都不會使用\n至少再過十年也不會使用加密貨幣。\n\n加密貨幣永遠不會推翻法定貨幣，特別是在我的國家（發展中國家），現金幾乎是首選。\n現金幾乎是首選...",
      "title": "對你來說，加密貨幣除了是一個賺錢的計劃外，還有其他東西嗎？是的，對我來說，它只是一個賺錢的計劃。我不是爲了技術而加入的。"
    }
  ]
}