{
  "author": "Hopeful_Bus_2815",
  "original_created_utc": 1642877981,
  "title": "I did it, I finally reached wife-changing money!!",
  "created_utc": 1642919848,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A well-renowned goal of a lot of people in the crypto world is to attain wife-changing money, and today I finally reached that goal.&lt;/p&gt;\n\n&lt;p&gt;I’ve only been into crypto since late 2020, and since then I’ve been hooked. I would check the charts constantly, always reading whitepapers, and when ever I visited the in-laws all I would do is babble on about crypto.&lt;/p&gt;\n\n&lt;p&gt;Now my wife didn’t like any of this, but she was happy to deal with it because I would always reassure her that crypto was our ticket to financial freedom and that it was important for me to invest my time.&lt;/p&gt;\n\n&lt;p&gt;When the prices first started dipping after ATHs of Q4 2021 I was sure we had reached the bottom, so being the crypto guru that I am I remortgaged our home and went all in.&lt;/p&gt;\n\n&lt;p&gt;After a couple of more months, I have seen immediate success. I got home from work to find my wife and kids gone, as well as divorce papers on the kitchen counter. &lt;/p&gt;\n\n&lt;p&gt;Most people seem to think you only get wife-changing money by being in the green, turns out seas of red can bring it about too.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 310,
  "permalink": "/r/CryptoCurrency/comments/sa9etb/i_did_it_i_finally_reached_wifechanging_money/",
  "subreddit": "CryptoCurrency",
  "id": "sa9etb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "A well-renowned goal of a lot of people in the crypto world is to attain\nwife-changing money, and today I finally reached that goal.\n\nI’ve only been into crypto since late 2020, and since then I’ve been hooked. I\nwould check the charts constantly, always reading whitepapers, and when ever I\nvisited…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号の世界で多くの人が目標としているのは、「暗号の世界を手に入れること」です。\n嫁入り道具のようなお金、今日やっとその目標に到達しました。\n\n私は2020年後半から暗号にハマったばかりですが、それ以来、夢中になっています。I\n常にチャートをチェックし、ホワイトペーパーを読み、そしていつも\nを訪れました。",
      "title": "やりました！！ついに嫁入り代に到達しました！！（笑"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在加密货币世界中，很多人的一个众所周知的目标是达到\n妻子的钱，而今天我终于达到了这个目标。\n\n我从2020年底才开始接触加密货币，从那时起我就迷上了。I\n我会不断地查看图表，总是阅读白皮书，而且当我\n访问...",
      "title": "我做到了，我终于达到了换妻的钱！!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在加密貨幣世界中，很多人的一個衆所周知的目標是達到\n妻子的錢，而今天我終於達到了這個目標。\n\n我從2020年底纔開始接觸加密貨幣，從那時起我就迷上了。I\n我會不斷地查看圖表，總是閱讀白皮書，而且當我\n訪問...",
      "title": "我做到了，我終於達到了換妻的錢！!"
    }
  ]
}