{
  "author": "Stunning-Ad1134",
  "original_created_utc": 1659619674,
  "title": "I (31m) have a huge kink/fantasy for thinking about my girlfriend (35f) being fucked by someone else - is that weird or a problem?",
  "created_utc": 1659645617,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;We’ve been dating for 2 years and it’s probably a last 6 months thing. I get really turned on by the fact she dated people before me (obviously) looking for the right person and I love imagining her letting loose and someone fucking her brains out before she knew me. I also like toying with the idea of her doing that now…&lt;/p&gt;\n\n&lt;p&gt;I’ve told her about this and she’s went along with it and played along with it during role play etc but obviously wants me to know she only ever wants me and is only doing it because it turns me on. &lt;/p&gt;\n\n&lt;p&gt;Is it weird? Is it a problem? Some of my friends who I mentioned it to think so.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 109,
  "permalink": "/r/TooAfraidToAsk/comments/wg1a4p/i_31m_have_a_huge_kinkfantasy_for_thinking_about/",
  "subreddit": "TooAfraidToAsk",
  "id": "wg1a4p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "We’ve been dating for 2 years and it’s probably a last 6 months thing. I get\nreally turned on by the fact she dated people before me (obviously) looking for\nthe right person and I love imagining her letting loose and someone fucking her\nbrains out before she knew me. I also like toying with the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "付き合って2年ですが、ここ半年くらいのことでしょうか。私は\n彼女が僕より先にデートしていたことで、本当に興奮したんだ。\nを探し、彼女が私を知る前に誰かが彼女の頭をファックしているのを想像するのが好きなんだ。\n彼女が僕を知る前に、誰かが彼女の脳みそをファックしているのを想像するのが好きなんだ。私はまた、おもちゃにするのが好き...",
      "title": "私（31m）は、自分の彼女（35f）が他の人に犯されることを考えるのが、とても好きなのですが、それは変ですか、問題ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们已经约会了2年，这可能是最后6个月的事情。我得到\n她在我之前和别人约会（很明显），寻找合适的人，这让我非常兴奋。\n我喜欢想象她放纵自己，有人把她干得死去活来。\n我喜欢想象她在认识我之前就放浪形骸，有人把她的脑子搞坏了。我还喜欢玩弄...",
      "title": "我（31岁）有一个巨大的癖好/幻想，想我的女朋友（35岁）被别人操，这很奇怪还是有问题？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們已經約會了2年，這可能是最後6個月的事情。我得到\n她在我之前和別人約會（很明顯），尋找合適的人，這讓我非常興奮。\n我喜歡想象她放縱自己，有人把她幹得死去活來。\n我喜歡想象她在認識我之前就放浪形骸，有人把她的腦子搞壞了。我還喜歡玩弄...",
      "title": "我（31歲）有一個巨大的癖好/幻想，想我的女朋友（35歲）被別人操，這很奇怪還是有問題？"
    }
  ]
}