{
  "author": "UnamazingHero",
  "original_created_utc": 1651835898,
  "title": "Why does everyone care about virtual real estate NFTs when there’s real life real estate being sold as NFTs?",
  "created_utc": 1651855030,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The hype around Yuga Labs’ Otherside mint has started a new wave of discussion around virtual real estate. Minting their “Otherdeeds” cost 305 APE and generated over $550 million in sales in the first day all on the hope that they’re going to do something interesting with virtual real estate. I don’t get why the vast majority of the hype is around virtual real estate NFTs when there are several projects already doing stuff with &lt;em&gt;real life&lt;/em&gt; real estate via NFTs.&lt;/p&gt;\n\n&lt;p&gt;I learned about these Web3 real estate projects recently and they seem so much more tangible than most metaverse projects. It’s not like Web3 real estate projects are immune to issues. Balcony DAO, Propy, CitaDAO, etc. all have their issues and I’m not going to pretend like they don’t. DeFi is the future but there are a lot of kinks that will have to be worked out. But I continue to be surprised that so much hype and money goes towards virtual real estate on the expectation that &lt;em&gt;maybe someday&lt;/em&gt; these virtual spaces will have enough users rather than going towards projects focused on real buildings that people really need to live in and can produce income from.&lt;/p&gt;\n\n&lt;p&gt;If anyone is curious, here’s some of the real estate NFT projects that seem most interesting (in alphabetical order):&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.balconydao.com/\"&gt;Balcony DAO&lt;/a&gt;: This is in the early stages but they’re one of the most interesting ones.  Their goal is to take major real estate investment opportunities (think residential skyscrapers) that are normally inaccessible to the average investor and turn them into investing opportunities for regular people via NFTs. They have a fully doxxed team with founders who are well known and respected in the real estate space.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://citadao.io/\"&gt;CitaDAO&lt;/a&gt;: They want real estate to be tokenized and transacted on chain. One of their focal points is steady rental income from their projects. They’re starting with property in England and their process involves staking USDC in a pool. Their initial fundraising effort failed to capture enough revenue, falling about 30% short of the total they needed, but still felt like a good proof of concept for the DAO. They still have future plans to pursue another IRO (Introducing Real Estate On-chain) round.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.lofty.ai/\"&gt;Lofty AI&lt;/a&gt;: They’re a startup where you can buy shares in tokenized rental properties. Shares can go as low as $50 so the ceiling for involvement is very low. They’re similar to existing projects like Fundrise and Roofstock but they have a lower bar for entry.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://propy.com/\"&gt;Propy&lt;/a&gt;: Propy is maybe the most well known player in this space. Their focus is on normal real estate transactions in the Web3 world. Instead of buying or selling your house through normal means, you can trade it like an NFT. They claim to have sold the world’s first real estate NFT.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 302,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/MS3VeSTWdGwY6fws4YgWPTz9iLGH2vTqdnora3uT9tE.jpg?auto=webp&amp;s=bd88f96edc6179a9b8ec3989a31ed0ffcae19723",
          "width": 2645,
          "height": 1080
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/MS3VeSTWdGwY6fws4YgWPTz9iLGH2vTqdnora3uT9tE.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=04085ff1396f5e0638702fea9e83e8d4699d718d",
            "width": 108,
            "height": 44
          },
          {
            "url": "https://external-preview.redd.it/MS3VeSTWdGwY6fws4YgWPTz9iLGH2vTqdnora3uT9tE.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=aec31ab281a893e18ee5ad4dfa23134b58cfce62",
            "width": 216,
            "height": 88
          },
          {
            "url": "https://external-preview.redd.it/MS3VeSTWdGwY6fws4YgWPTz9iLGH2vTqdnora3uT9tE.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=f796b9bfe342ab678215c1675fa87896cfedea6f",
            "width": 320,
            "height": 130
          },
          {
            "url": "https://external-preview.redd.it/MS3VeSTWdGwY6fws4YgWPTz9iLGH2vTqdnora3uT9tE.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=6d8f22fb76c03bd8b5809d6377acdb3fee08701d",
            "width": 640,
            "height": 261
          },
          {
            "url": "https://external-preview.redd.it/MS3VeSTWdGwY6fws4YgWPTz9iLGH2vTqdnora3uT9tE.jpg?width=960&amp;crop=smart&amp;auto=webp&amp;s=c25ae8c88632fe1e6c3612970f27f112acb5bdb1",
            "width": 960,
            "height": 391
          },
          {
            "url": "https://external-preview.redd.it/MS3VeSTWdGwY6fws4YgWPTz9iLGH2vTqdnora3uT9tE.jpg?width=1080&amp;crop=smart&amp;auto=webp&amp;s=ec586fa49bcfac20b539f5e79cdaf1732419375d",
            "width": 1080,
            "height": 440
          }
        ],
        "variants": {},
        "id": "mmSQztk0UpACwhpIjgrQphwdIuS9T27Fz8OW7pooRPU"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/ujl5tb/why_does_everyone_care_about_virtual_real_estate/",
  "subreddit": "CryptoCurrency",
  "id": "ujl5tb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The hype around Yuga Labs’ Otherside mint has started a new wave of discussion\naround virtual real estate. Minting their “Otherdeeds” cost 305 APE and\ngenerated over $550 million in sales in the first day all on the hope that\nthey’re going to do something interesting with virtual real estate. I…"
}