{
  "author": "AllenWatson23",
  "the_new_excerpt": "I'd like your thoughts on Upwork's (UPWK) long-term potential.\n\nI started my freelance career on Upwork because a family member suggested it. I\nfound a few of my biggest clients on the site. I think Upwork has the potential\nto kill it in the WFH sector in the coming years, simply because they have…",
  "original_created_utc": 1610471626,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我想知道你对Upwork（UPWK）长期潜力的看法。\n\n我在Upwork上开始了我的自由职业，因为一个家庭成员建议。I\n在网站上找到了我最大的几个客户。我认为Upwork有潜力\n在未来的几年里，他们将扼杀在WFH行业，只是因为他们有... ...",
      "title": "我是在Upwork上起家的，但我买他们的实际股票(UPWK)比我在平台上赚得更多。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想知道你對Upwork（UPWK）長期潛力的看法。\n\n我在Upwork上開始了我的自由職業，因爲一個家庭成員建議。I\n在網站上找到了我最大的幾個客戶。我認爲Upwork有潛力\n在未來的幾年裏，他們將扼殺在WFH行業，只是因爲他們有... ...",
      "title": "我是在Upwork上起家的，但我買他們的實際股票(UPWK)比我在平臺上賺得更多。"
    }
  ],
  "title": "I got my start on Upwork, but I've made more buying their actual stock (UPWK) than I have on the platform",
  "created_utc": 1610502911,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;d like your thoughts on Upwork&#39;s (UPWK) long-term potential. </p>\n\n<p>I started my freelance career on Upwork because a family member suggested it. I found a few of my biggest clients on the site. I think Upwork has the potential to kill it in the WFH sector in the coming years, simply because they have been so focused on making a platform for large companies to come and find work. I bought the company stock earlier in 2020 (well, I bought at the IPO, sold, and bought again).</p>\n\n<p>The stock has killed it since then, and I&#39;ve made more on the investment than I have on the platform (still a top-rated freelancer even though I barely use it).</p>\n\n<p>HOWEVER, I think Upwork&#39;s fatal flaw is their inability to keep people from moving off-platform for payments. There is absolutely no way for the company to know if a client or the freelancer move off-site after an initial contract is completed. From what I understand, all communication needs to stay on-site until a contract is started now. Okay, but then you can move off-platform for communication. Then there&#39;s the inevitable discussion of &quot;Hey, do you have PayPal?&quot; or &quot;Let&#39;s move you onto our company bill-pay system.&quot; All that has to be done is end the contract as a successful completion on Upwork and they&#39;re now separated and working off-site.</p>\n\n<p>This happens ALL the time, and I can see why. Even PayPal fees are less than UW&#39;s percentage, even if it moves into the 10% and 5% range.</p>\n\n<p>Of course, there are the lowest bidders driving down everyone&#39;s rates on the site. There are also scammers. I found someone on there using my entire profile bio, word-for-word (reported it, taken down).</p>\n\n<p>Even with their flaws, Upwork stock is surging and has been upgraded by most analysts. Imagine how awesome they&#39;d be if they fixed the issues.</p>\n</div><!-- SC_ON -->",
  "score": 59,
  "permalink": "/r/investing/comments/kvvv23/i_got_my_start_on_upwork_but_ive_made_more_buying/",
  "subreddit": "investing",
  "id": "kvvv23",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706379517
}