{
  "author": "dmiddy",
  "original_created_utc": 1634940852,
  "title": "Your Chosen \"Ethereum Killer\" Is Going To Be Eaten By Ethereum Layer 2s, It Just Doesn't Know It Yet",
  "created_utc": 1634953792,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This idea was recently popularize by twitter user <a href=\"https://twitter.com/epolynya\">https://twitter.com/epolynya</a></p>\n\n<p>With the launch of two Layer 2 scaling solutions, Optimism and Arbitrum, it is now a false equivalency to be comparing your chosen layer 1 blockchain to Ethereum.</p>\n\n<p>Eventually, the average Ethereum user will not interact with layer 1, therefore the layer 2s will be processing the bulk of activity on the chain.</p>\n\n<p>When you look at Solana/BSC and see amazing TPS and cheap fees, you must compare that to what Eth layer 2 scaling solutions can handle(which is much, much more than Solana).</p>\n\n<p>Once the miniscule and instant transactions of layer 2 Ethereum draw you in, you can rest easy knowing that you&#39;ve just transacted on one of the most Decentralized blockchains available today.</p>\n\n<p><strong>Solana, BSC = Monolithic blockchain = trying to do everything in one layer = centralization</strong></p>\n\n<p><strong>Ethereum = Modular blockchain = splitting up tasks into layers = preserve decentralization</strong></p>\n\n<p>&quot; <strong>Anything any monolithic blockchain (L1) can ever do, a single zkRollup can do it significantly (&gt;10x) better. And there can be hundreds or thousands of zkRs interoperating relatively seamlessly.</strong> &quot;</p>\n\n<p>A zkRollup is a technique in which transactions are batched off-chain and settled on-chain. Put more simply, it is a much more efficient usage of block space on Ethereum Layer 1.</p>\n\n<p>Instead of 1 transaction taking up 1 transaction worth of block space, Layer 2s allow for many transactions to occupy that space.</p>\n\n<p>Add on to this that there can be &quot;hundreds or thousands&quot; of rollup projects operating at the same time, and modular blockchains have solved scalability and thus have solved the <a href=\"https://www.gemini.com/cryptopedia/blockchain-trilemma-decentralization-scalability-definition\">Scalability Trilemma</a></p>\n\n<p>Ethereum, Tezos, Cardano, and others have seen that monolithic architecture is extremely limiting in the long-term, even if it provides short-term advantages.</p>\n\n<p>What&#39;s more, <em>monolithic blockchains are more likely to pivot to becoming rollups for Ethereum than they are to kill it.</em></p>\n\n<p>Once projects realize that all the users are on Ethereum, they will understand that the best decision they can make to improve their project is to pivot away from being their own monolithic chain.</p>\n\n<p>The future lies in Modular Blockchains.</p>\n\n<p>For more reading check out: <a href=\"https://polynya.medium.com/rollups-data-availability-layers-modular-blockchains-introductory-meta-post-5a1e7a60119d\">https://polynya.medium.com/rollups-data-availability-layers-modular-blockchains-introductory-meta-post-5a1e7a60119d</a></p>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/CryptoCurrency/comments/qdrmm2/your_chosen_ethereum_killer_is_going_to_be_eaten/",
  "subreddit": "CryptoCurrency",
  "id": "qdrmm2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This idea was recently popularize by twitter user https://twitter.com/epolynya\n\nWith the launch of two Layer 2 scaling solutions, Optimism and Arbitrum, it is\nnow a false equivalency to be comparing your chosen layer 1 blockchain to\nEthereum.\n\nEventually, the average Ethereum user will not interact…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この考えは、最近、Twitterユーザーのhttps://twitter.com/epolynya によって広まりました。\n\nオプティミズムとアービトラムという2つのレイヤー2スケーリングソリューションが登場したことで\n選んだレイヤー1のブロックチェーンをEthereumと比較することは、今や誤った同等性である。\nイーサリアムです。\n\n最終的には、平均的なEthereumユーザーは、Ethereumとの対話をしなくなるでしょう。",
      "title": "あなたが選んだ「Ethereum Killer」は、Ethereum Layer 2に食べられてしまうかもしれません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这个想法最近被twitter用户https://twitter.com/epolynya。\n\n随着Optimism和Arbitrum这两个第二层扩展解决方案的推出，现在的情况是\n现在将你选择的第一层区块链与以太坊进行比较是一种错误的等价交换。\n以太坊。\n\n最终，以太坊的普通用户将不会与...",
      "title": "你选择的 \"以太坊杀手 \"要被以太坊第2层吃掉了，只是它还不知道而已。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個想法最近被twitter用戶https://twitter.com/epolynya。\n\n隨着Optimism和Arbitrum這兩個第二層擴展解決方案的推出，現在的情況是\n現在將你選擇的第一層區塊鏈與以太坊進行比較是一種錯誤的等價交換。\n以太坊。\n\n最終，以太坊的普通用戶將不會與...",
      "title": "你選擇的 \"以太坊殺手 \"要被以太坊第2層喫掉了，只是它還不知道而已。"
    }
  ]
}