{
  "author": "Noba151515",
  "original_created_utc": 1647318867,
  "title": "Do you ever have intense flashes of intense self awareness where you don’t feel like yourself anymore?",
  "created_utc": 1647324223,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Had a weird moment randomly while looking at myself in the mirror today, wasn’t on drugs or anything just really tired. But I suddenly had this intense feeling that I’d stepped outside of my self and was finally viewing myself how people outside of my point of view see me. My entire self image briefly collapsed and I legit started freaking out and had to calm myself down. That’s never happened before and it really freaked me out. &lt;/p&gt;\n\n&lt;p&gt;This happen to you guys too? What causes it? I found it hard to get the feeling back once I’d settled back into my routine but I wanted to try it again. I feel like getting in that kind of headspace again while scary could help me make decisions better and not be so indecisive and defensive about my ego. It just felt so strange to randomly lose my self perception and see what I project as an individual.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 125,
  "permalink": "/r/TooAfraidToAsk/comments/tegt0q/do_you_ever_have_intense_flashes_of_intense_self/",
  "subreddit": "TooAfraidToAsk",
  "id": "tegt0q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Had a weird moment randomly while looking at myself in the mirror today, wasn’t\non drugs or anything just really tired. But I suddenly had this intense feeling\nthat I’d stepped outside of my self and was finally viewing myself how people\noutside of my point of view see me. My entire self image…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日、鏡の中の自分を見ていて、ふとした瞬間に変な気持ちになった。\n薬も何も使わず、ただ本当に疲れていた。でも、突然、この強烈な感覚に襲われました。\n自分から一歩外に出て、ようやく自分を見ることができるようになったのです。\n自分の視点以外のところから見た自分。私のセルフイメージ全体が...",
      "title": "自分が自分でなくなるような強烈なフラッシュを浴びることはないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今天在照镜子的时候，随机有了一个奇怪的时刻。\n嗑药或什么的，只是很累。但我突然有了这种强烈的感觉\n我已经走出了自我，终于看到了我自己的样子\n我的观点之外的人是如何看待我的。我的整个自我形象...",
      "title": "你是否曾有过强烈的自我意识的闪现，你觉得自己不再是自己？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天在照鏡子的時候，隨機有了一個奇怪的時刻。\n嗑藥或什麼的，只是很累。但我突然有了這種強烈的感覺\n我已經走出了自我，終於看到了我自己的樣子\n我的觀點之外的人是如何看待我的。我的整個自我形象...",
      "title": "你是否曾有過強烈的自我意識的閃現，你覺得自己不再是自己？"
    }
  ]
}