{
  "author": "Jerswar",
  "original_created_utc": 1635881613,
  "title": "Did H.H. Holmes really build a murder labyrinth, or was he just a terrible architect?",
  "created_utc": 1635890099,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The more colorful version of this 19th Century serial killer&#39;s life is that he had a &quot;murder castle&quot; created; a hotel with confusing architecture, rooms designed to kill their occupants, trapdoors to drop corpses down into the cellar, and so on. Another version I&#39;ve heard is that Holmes just wasn&#39;t much of an architect, and that he contracted one builder after another, so he could cheat them out of payment, and that this also played into the weird and messy layout. I&#39;ve also heard that he greatly exaggerated his killings.</p>\n\n<p>Was there actually a murder castle? And did Holmes actually use it to kill people?</p>\n</div><!-- SC_ON -->",
  "score": 121,
  "permalink": "/r/AskHistorians/comments/qlc7a6/did_hh_holmes_really_build_a_murder_labyrinth_or/",
  "subreddit": "AskHistorians",
  "id": "qlc7a6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The more colorful version of this 19th Century serial killer's life is that he\nhad a \"murder castle\" created; a hotel with confusing architecture, rooms\ndesigned to kill their occupants, trapdoors to drop corpses down into the\ncellar, and so on. Another version I've heard is that Holmes just wasn't…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この19世紀の連続殺人犯の人生のよりカラフルなバージョンは、彼が\n殺人城」を作らせたというものです。混乱した建築物、人を殺すために作られた部屋や\n殺すために設計された部屋、死体を地下室に落とすためのトラップドアなどの\nまた、別の説では 別の説では、ホームズはただ...",
      "title": "H.H.ホームズは本当に殺人迷宮を作ったのか、それともただの下手な建築家だったのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "关于这个19世纪连环杀手的生活，更丰富多彩的版本是他创建了一个 \"谋杀城堡\"；一个建筑风格混乱的旅馆。\n他创建了一个 \"谋杀城堡\"；一个拥有混乱的建筑、旨在杀死居住者的房间的酒店。\n这家酒店的建筑结构混乱，房间设计成可以杀死住客，有活板门可以把尸体扔到地窖里，等等。\n地窖，等等。我听到的另一个版本是，福尔摩斯只是不...",
      "title": "H.H.福尔摩斯是否真的建造了一个谋杀迷宫，还是他只是一个糟糕的建筑师？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "關於這個19世紀連環殺手的生活，更豐富多彩的版本是他創建了一個 \"謀殺城堡\"；一個建築風格混亂的旅館。\n他創建了一個 \"謀殺城堡\"；一個擁有混亂的建築、旨在殺死居住者的房間的酒店。\n這家酒店的建築結構混亂，房間設計成可以殺死住客，有活板門可以把屍體扔到地窖裏，等等。\n地窖，等等。我聽到的另一個版本是，福爾摩斯只是不...",
      "title": "H.H.福爾摩斯是否真的建造了一個謀殺迷宮，還是他只是一個糟糕的建築師？"
    }
  ]
}