{
  "author": "randomisrandomis",
  "original_created_utc": 1660293784,
  "title": "I got a refund on a bottle of whisky that I'd planned on giving as a gift. can I still give it or is that morally wrong?",
  "created_utc": 1660318288,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I bought a relatively expensive bottle of whisky for my Dad for their anniversary but the gift box was slightly damaged. I contacted the seller to replace it and they just refunded it without needing to send it back!&lt;/p&gt;\n\n&lt;p&gt;At first I thought ooh wow I got a free bottle but then the moral dilemma of it meant that I suddenly started feeling guilty about the idea of giving a free bottle as a gift. I then thought that I&amp;#39;d just buy another bottle but it seems silly seeing as I have a bottle sitting there and I won&amp;#39;t drink it.&lt;/p&gt;\n\n&lt;p&gt;Is it wrong to give it as a gift, is it silly not to give it as a gift or is there a way to do something differently here?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 123,
  "permalink": "/r/NoStupidQuestions/comments/wmg7pj/i_got_a_refund_on_a_bottle_of_whisky_that_id/",
  "subreddit": "NoStupidQuestions",
  "id": "wmg7pj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I bought a relatively expensive bottle of whisky for my Dad for their\nanniversary but the gift box was slightly damaged. I contacted the seller to\nreplace it and they just refunded it without needing to send it back!\n\nAt first I thought ooh wow I got a free bottle but then the moral dilemma of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "父へのプレゼントとして、比較的高価なウィスキーを購入しました。\nを購入したのですが、ギフトボックスが少し破損していました。販売元に連絡し\nを送り返すことなく、そのまま返金してくれました。\n\n最初は無料のボトルを手に入れたと思ったのですが、モラルのジレンマが...。",
      "title": "ギフトとして贈る予定だったウィスキーのボトルが返金されましたが、贈ることはできますか、それとも道徳的に間違っていますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我为我的父亲买了一瓶相对昂贵的威士忌，作为他们的礼物。\n纪念日，但礼品盒略有损坏。我联系了卖家，要求\n他们就把钱退给了我，而不需要我把它寄回去。\n\n起初我想，哦，哇，我得到了一瓶免费的酒，但后来我的道德困境是......",
      "title": "我得到了一瓶威士忌的退款，我本打算把它作为礼物送给别人。我还能送吗，还是说这在道德上是错误的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我爲我的父親買了一瓶相對昂貴的威士忌，作爲他們的禮物。\n紀念日，但禮品盒略有損壞。我聯繫了賣家，要求\n他們就把錢退給了我，而不需要我把它寄回去。\n\n起初我想，哦，哇，我得到了一瓶免費的酒，但後來我的道德困境是......",
      "title": "我得到了一瓶威士忌的退款，我本打算把它作爲禮物送給別人。我還能送嗎，還是說這在道德上是錯誤的？"
    }
  ]
}