{
  "author": "Farvaharr",
  "the_new_excerpt": "When people state that we are “early” it might be a good indicator to check the\nsub’s total reach. I know it’s not a perfect example as loads of people don’t\neven know that reddit exists, but it’s still fun to put in perspective!\n\nWith the current world population & current members on this sub we…",
  "original_created_utc": 1618806819,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "早い」と言われた時は、サブのトータルリーチを確認する良い指標になるかもしれません。\nサブのトータルリーチを確認する良い指標になるかもしれません。これは完璧な例ではありませんが、多くの人がreddを知らないので\n完全な例ではありませんが、視点を変えてみると楽しいですよ。\n\n現在の世界人口とこのサブの現在のメンバーでは...。",
      "title": "世界人口の0.02%だけが私たちのサブレディットのメンバーです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当人们说我们 \"早 \"的时候，这可能是一个很好的指标，检查。\n子的总范围。我知道这不是一个完美的例子，因为负载的人不\n甚至知道reddit的存在，但还是很有趣的，把眼光放得更远!\n\n以目前世界上的人口和这个子上的现有成员，我们...",
      "title": "世界上只有0.02%的人口是我们的子社区成员。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當人們說我們 \"早 \"的時候，這可能是一個很好的指標，檢查。\n子的總範圍。我知道這不是一個完美的例子，因爲負載的人不\n甚至知道reddit的存在，但還是很有趣的，把眼光放得更遠!\n\n以目前世界上的人口和這個子上的現有成員，我們...",
      "title": "世界上只有0.02%的人口是我們的子社區成員。"
    }
  ],
  "title": "ONLY 0.02% of the world population is member of our subreddit",
  "created_utc": 1618824660,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>When people state that we are “early” it might be a good indicator to check the sub’s total reach. I know it’s not a perfect example as loads of people don’t even know that reddit exists, but it’s still fun to put in perspective! </p>\n\n<p>With the current world population &amp; current members on this sub we come to the conclusion that only 0.02% of the world is member of the Cryptocurrency sub. </p>\n\n<p>0.02% makes a pretty close family if you ask me! \n“Who told you it was too late?” </p>\n\n<p>Where do we see the sub in 5 years? I would put it well above 5M+ members at this current rate</p>\n\n<p>Happy Holding fam!</p>\n</div><!-- SC_ON -->",
  "score": 462,
  "permalink": "/r/CryptoCurrency/comments/mtt431/only_002_of_the_world_population_is_member_of_our/",
  "subreddit": "CryptoCurrency",
  "id": "mtt431",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171521468
}