{
  "author": "AverageStudent1",
  "original_created_utc": 1630482019,
  "title": "Since I started investing in crypto, i've almost completely stopped spending money on everything else except for the strict neccessary stuff",
  "created_utc": 1630506721,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I used to buy new clothes very frequently. I also spent a decent amount of money on in-game purchases a well as drinks during parties etc. Out of nowhere, I stopped buying all of it and just put it straight into crypto. My issue is, I can&#39;t tell if I finally got an investors mindset, or if i&#39;m developing some sort of unhealthy pattern.   </p>\n\n<p>I use it as a long term investment so I don&#39;t look at the charts multiple times every single day like i&#39;m addicted but I just spend the &quot;spare&quot; money I have on crypto instead of other things. I have no doubt that this will benefit me in the future, but have any of you done the same thing?</p>\n</div><!-- SC_ON -->",
  "score": 315,
  "permalink": "/r/CryptoCurrency/comments/pfp1dk/since_i_started_investing_in_crypto_ive_almost/",
  "subreddit": "CryptoCurrency",
  "id": "pfp1dk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I used to buy new clothes very frequently. I also spent a decent amount of money\non in-game purchases a well as drinks during parties etc. Out of nowhere, I\nstopped buying all of it and just put it straight into crypto. My issue is, I\ncan't tell if I finally got an investors mindset, or if i'm…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "以前は頻繁に新しい服を買っていました。また、ゲーム内での購入やパーティでの飲み会にもそれなりにお金を使いました。\nゲーム内での購入やパーティでの飲み会などにもそれなりにお金を使っていました。しかし、突然\n買うのをやめて、そのまま暗号化してしまいました。私の問題は\n最終的に投資家の考えになったのか、それとも私が......ということです。",
      "title": "暗号に投資するようになってから、必要なもの以外にはほとんどお金を使わなくなりました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我曾经非常频繁地购买新衣服。我也花了相当多的钱\n在游戏中购买东西，以及在聚会中喝酒等等。不知从何而来，我\n我不再购买所有这些东西，而是直接将其投入加密货币。我的问题是，我\n我不知道我是否终于有了一个投资者的心态，或者我是否...",
      "title": "自从我开始投资加密货币，我几乎完全停止了在其他方面的消费，除了严格的必要的东西。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我曾經非常頻繁地購買新衣服。我也花了相當多的錢\n在遊戲中購買東西，以及在聚會中喝酒等等。不知從何而來，我\n我不再購買所有這些東西，而是直接將其投入加密貨幣。我的問題是，我\n我不知道我是否終於有了一個投資者的心態，或者我是否...",
      "title": "自從我開始投資加密貨幣，我幾乎完全停止了在其他方面的消費，除了嚴格的必要的東西。"
    }
  ]
}