{
  "author": "Mariana21bn",
  "original_created_utc": 1636544082,
  "title": "There are still people claiming that Cryptocurrencies are mostly used for criminal activities. Meanwhile, the UN estimates that ~$1.6 trillion in cash is laundered each year.",
  "created_utc": 1636554904,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is my first post here so take it easy on me. As a newbie investor trying to learn about the market, i was searching for articles about crypto to ensure i get to know basic fundamentals in depth. I came up to **this article from Coinbase which said some very interesting and important things to understand the propaganda against crypto by the goverments!</p>\n\n<p>To sum up so you dont have to read this.. Each year money laundering, drug trafficking etc. account for less and less of cryptocurrencies transactions (lower than half percent in 2020) while the &quot;innocent&quot; cash is used for an extremely larger amount of illicit activities.</p>\n\n<p>You hear people with power like Christine Lagarde come out and say stuff like that and it makes you angry at first place. But if you sit down and rethink, this is good for us long term. They try to dispute us with all they can, most of the times with unbelievably ignorant means which makes them look even more stupid and helpless against crypto. This is just a reminder that we are here to stay and as much as they fight us, we will come back stronger than ever.</p>\n\n<p>**Edit : I have trouble with the link so i put it in a comment below but i don&#39;t know how to pin it so it&#39;s visible if someone could do it it would be awesome, thanks!!</p>\n</div><!-- SC_ON -->",
  "score": 289,
  "permalink": "/r/CryptoCurrency/comments/qqsfic/there_are_still_people_claiming_that/",
  "subreddit": "CryptoCurrency",
  "id": "qqsfic",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is my first post here so take it easy on me. As a newbie investor trying to\nlearn about the market, i was searching for articles about crypto to ensure i\nget to know basic fundamentals in depth. I came up to **this article from\nCoinbase which said some very interesting and important things to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "初めての投稿ですので、お手柔らかにお願いします。私は、投資家としては初心者です。\n市場について学ぼうとしている初心者投資家として、基本的な基礎を深く知るために、暗号に関する記事を探していました。\n基本的なことを深く知るために、暗号に関する記事を探していました。その結果、Coinbaseのこの記事にたどり着きました。\nこの記事は、非常に興味深く、重要なことが書かれていました。",
      "title": "暗号通貨はほとんどが犯罪行為に使用されていると主張する人がまだいます。一方、国連の推計によると、毎年、～1.6兆ドルの現金がロンダリングされているそうです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是我在这里的第一篇帖子，所以对我来说很容易。作为一个新手投资者，试图\n试图了解市场，我一直在寻找关于加密货币的文章，以确保我\n深入了解基本的基本原理。我找到了**这篇文章，来自\nCoinbase说了一些非常有趣和重要的事情。",
      "title": "仍然有人声称，加密货币主要用于犯罪活动。同时，联合国估计每年有约1.6万亿美元的现金被洗掉。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是我在這裏的第一篇帖子，所以對我來說很容易。作爲一個新手投資者，試圖\n試圖瞭解市場，我一直在尋找關於加密貨幣的文章，以確保我\n深入瞭解基本的基本原理。我找到了**這篇文章，來自\nCoinbase說了一些非常有趣和重要的事情。",
      "title": "仍然有人聲稱，加密貨幣主要用於犯罪活動。同時，聯合國估計每年有約1.6萬億美元的現金被洗掉。"
    }
  ]
}