{
  "author": "delayedconfusion",
  "original_created_utc": 1646347180,
  "title": "Do birds cross breed? Is it possible for birds to cross breed like cats and dogs do? Or has evolution stopped this from occurring?",
  "created_utc": 1646396397,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Is it possible for birds to cross breed, like dogs/cats do?&lt;/p&gt;\n\n&lt;p&gt;From my observations, I don&amp;#39;t recall seeing any hybrid birds that may have been the result of cross breeding, like an owl with parrot colours.&lt;/p&gt;\n\n&lt;p&gt;Is this because of the evolutionary drive of these animals being so ingrained that they have no desire to cross breed?&lt;/p&gt;\n\n&lt;p&gt;Or are they unable to cross breed (does this make them different species)?&lt;/p&gt;\n\n&lt;p&gt;Or is there another explanation?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/askscience/comments/t63qbz/do_birds_cross_breed_is_it_possible_for_birds_to/",
  "subreddit": "askscience",
  "id": "t63qbz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Is it possible for birds to cross breed, like dogs/cats do?\n\nFrom my observations, I don't recall seeing any hybrid birds that may have been\nthe result of cross breeding, like an owl with parrot colours.\n\nIs this because of the evolutionary drive of these animals being so ingrained\nthat they have…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "犬・猫のように、鳥も交配することが可能なのでしょうか？\n\n私が観察している限りでは、雑種と思われる鳥を見た記憶がありません。\nオウムの色をしたフクロウのように、交配によって生まれたものです。\n\nこれは、これらの動物の進化の原動力が根付いているからなのでしょうか。\nというのは...。",
      "title": "鳥は交配するのか？猫や犬のように鳥が交配することは可能なのでしょうか？それとも、進化によってそのようなことは起きなくなったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "鸟类有可能像狗/猫一样进行杂交吗？\n\n根据我的观察，我不记得见过任何杂交鸟类，可能是杂交的结果。\n杂交的结果，如具有鹦鹉颜色的猫头鹰。\n\n这是否因为这些动物的进化动力是如此根深蒂固\n以至于它们有...",
      "title": "鸟类会交叉繁殖吗？鸟类有可能像猫和狗一样进行杂交吗？还是进化阻止了这种情况的发生？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "鳥類有可能像狗/貓一樣進行雜交嗎？\n\n根據我的觀察，我不記得見過任何雜交鳥類，可能是雜交的結果。\n雜交的結果，如具有鸚鵡顏色的貓頭鷹。\n\n這是否因爲這些動物的進化動力是如此根深蒂固\n以至於它們有...",
      "title": "鳥類會交叉繁殖嗎？鳥類有可能像貓和狗一樣進行雜交嗎？還是進化阻止了這種情況的發生？"
    }
  ]
}