{
  "author": "Met76",
  "original_created_utc": 1641535245,
  "title": "Downloaded WhatsApp on a new phone and after selecting yes to Restore previous Backup, 7,000 or so random photos began downloading. What should I do?",
  "created_utc": 1641551286,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I just got my new android in the mail and began setting it up. One of the apps I installed was WhatsApp. During the initial setup process, there was a screen that asked if I wanted to upload recent back-ups from my account. &lt;/p&gt;\n\n&lt;p&gt;I hit yes as I wanted to save everything from my last phone. After a looooong download session I go to my WhatsApp photos and there are literally nearly 7,000 random photos from random people I don&amp;#39;t even know. &lt;/p&gt;\n\n&lt;p&gt;Some are of family pics, and others are random pics of passports, credit cards, and birth certificates.&lt;/p&gt;\n\n&lt;p&gt;Who the hell do I go to about this? There&amp;#39;s gotta be a major error or something but I need to tell someone. I just don&amp;#39;t know who.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/ry0cnr/downloaded_whatsapp_on_a_new_phone_and_after/",
  "subreddit": "NoStupidQuestions",
  "id": "ry0cnr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I just got my new android in the mail and began setting it up. One of the apps I\ninstalled was WhatsApp. During the initial setup process, there was a screen\nthat asked if I wanted to upload recent back-ups from my account.\n\nI hit yes as I wanted to save everything from my last phone. After a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "新しいアンドロイドが届いて、セットアップを始めたところです。その際、アプリの1つとして\nインストールしたのはWhatsAppです。最初のセットアップの際に、以下の画面が表示されました。\n最近のバックアップをアップロードするかどうか聞いてきました。\n\n私は私の最後の携帯電話からすべてを保存したかったので、私は「はい」を押した。その後...",
      "title": "新しい機種で WhatsApp をダウンロードし、「前回のバックアップを復元」を選択すると、7000枚程の写真がランダムにダウンロードされるようになりました。どうすれば良いですか?"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我刚刚收到我的新安卓系统的邮件，并开始设置它。我安装的其中一个应用程序\n安装的是WhatsApp。在最初的设置过程中，有一个屏幕\n问我是否要从我的账户上传最近的备份。\n\n我按了 \"是\"，因为我想保存我上一部手机的所有内容。经过一段时间后，我发现我的手机上的所有信息都被删除了。",
      "title": "在新手机上下载了WhatsApp，在选择是恢复以前的备份后，7000多张随机照片开始下载。我应该怎么做？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我剛剛收到我的新安卓系統的郵件，並開始設置它。我安裝的其中一個應用程序\n安裝的是WhatsApp。在最初的設置過程中，有一個屏幕\n問我是否要從我的賬戶上傳最近的備份。\n\n我按了 \"是\"，因爲我想保存我上一部手機的所有內容。經過一段時間後，我發現我的手機上的所有信息都被刪除了。",
      "title": "在新手機上下載了WhatsApp，在選擇是恢復以前的備份後，7000多張隨機照片開始下載。我應該怎麼做？"
    }
  ]
}