{
  "author": "BecomingHuman101",
  "original_created_utc": 1644160908,
  "title": "My gf kissed a guy while on drugs and idk how to feel about it, a little help?",
  "created_utc": 1644168003,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;We have been together for just over one year now and we share a very good bond. Our relationship is built on communication and sharing, and we don&amp;#39;t hide anything from each other. Two days ago she was in a rave party and took ecstasy and that night she kissed a guy 3 other girls apparently. She told me this next morning. Idk how to feel about this. She expects me to talk to her about what I feel but I&amp;#39;m confused. I&amp;#39;m not jealous, i trust her but I feel somethings not right. &lt;/p&gt;\n\n&lt;p&gt;What do you think about this? And if the kiss was just a peck (on the lips), does that change anything?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 201,
  "permalink": "/r/TooAfraidToAsk/comments/slz5po/my_gf_kissed_a_guy_while_on_drugs_and_idk_how_to/",
  "subreddit": "TooAfraidToAsk",
  "id": "slz5po",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "We have been together for just over one year now and we share a very good bond.\nOur relationship is built on communication and sharing, and we don't hide\nanything from each other. Two days ago she was in a rave party and took ecstasy\nand that night she kissed a guy 3 other girls apparently. She…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "付き合って1年ちょっとになりますが、とても良い絆で結ばれています。\n私たちの関係は、コミュニケーションと共有の上に成り立っており、隠すことはありません。\nお互いに何も隠していません。2日前、彼女はレイブパーティーでエクスタシーを飲み\nその夜、彼女は他の3人の女の子とキスをしていたようです。彼女は...",
      "title": "私のガールフレンドが薬中に男とキスをして、それについてどのように感じるかidk、少し助けて？"
    },
    {
      "locale": "zh",
      "title": "我的女友在吸毒时亲吻了一个男人，我不知道该如何看待这件事，请大家帮帮忙？",
      "the_new_excerpt": "我们在一起已经有一年多了，我们有非常好的关系。\n我们的关系建立在沟通和分享的基础上，而且我们不对对方隐瞒任何事情。\n任何事情都不隐瞒对方。两天前，她参加了一个狂欢派对并服用了摇头丸\n那晚她吻了一个男人，显然还有其他三个女孩。她..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "付き合って1年ちょっとになりますが、とても良い絆で結ばれています。\n私たちの関係は、コミュニケーションと共有の上に成り立っており、隠すことはありません。\nお互いに何も隠していません。2日前、彼女はレイブパーティーでエクスタシーを飲み\nその夜、彼女は他の3人の女の子とキスをしていたようです。彼女は...",
      "title": "我的女友在吸毒時親吻了一個男人，我不知道該如何看待這件事，請大家幫幫忙？"
    }
  ]
}