{
  "author": "GhostfromTexas",
  "the_new_excerpt": "ROBLOX (RBLX) IPO FOR MARCH 10TH, 2021\n\n> Disclaimer: I am relatively new to trading and did this DD writeup to help me\n> learn. None of the information here should be used as financial advice. I am\n> mainly wanting to test my abilities and gain feedback on my assessment. Feel\n> free to let me know…",
  "original_created_utc": 1614999001,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "ROBLOX (RBLX)2021年3月10日上市。\n\n> 免责声明：我是一个比较新的交易，做这个DD写来帮助我。\n> 学习。这里的信息都不应该作为理财建议。我是\n>主要是想测试一下自己的能力，获得评估的反馈。感觉\n>自由让我知道...",
      "title": "DD：即将到来的Roblox $RBLX下周IPO（2021年3月10日）。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "ROBLOX (RBLX)2021年3月10日上市。\n\n> 免責聲明：我是一個比較新的交易，做這個DD寫來幫助我。\n> 學習。這裏的信息都不應該作爲理財建議。我是\n>主要是想測試一下自己的能力，獲得評估的反饋。感覺\n>自由讓我知道...",
      "title": "DD：即將到來的Roblox $RBLX下週IPO（2021年3月10日）。"
    }
  ],
  "title": "DD: Upcoming Roblox $RBLX IPO Next Week (March 10th, 2021)",
  "created_utc": 1615033875,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h1>Roblox (RBLX) IPO for March 10th, 2021</h1>\n\n<blockquote>\n<p><strong>Disclaimer:</strong>  I am relatively new to trading and did this DD writeup to help me learn. None of the information here should be used as financial advice. I am mainly wanting to test my abilities and gain feedback on my assessment. Feel free to let me know what information you feel is good, bad, or missing! I welcome all criticisms!</p>\n</blockquote>\n\n<h1>Info</h1>\n\n<ul>\n<li><strong>Company:</strong> Roblox Corporation - <a href=\"https://www.roblox.com/\">https://www.roblox.com</a></li>\n<li><strong>Founded/Launched:</strong> 2004/2006</li>\n<li><strong>CEO:</strong> David Baszucki - <a href=\"https://twitter.com/davidbaszucki\">https://twitter.com/davidbaszucki</a></li>\n<li><strong>HQ and Employees:</strong> San Mateo, CA - 830 Employees</li>\n<li><strong>Monthly Active Users:</strong> 150 Million as of July 2020</li>\n<li><strong>Age Range:</strong> 50% of the community under 16 years old</li>\n</ul>\n\n<h1>Summary</h1>\n\n<p>Roblox (RBLX) is a content creation gaming platform that allows users to develop a wide variety of mini-games and have other users play them through the Roblox Player. Creators can earn a virtual currency called Robux by selling various items to players which can then be converted into actual money at certain milestones.</p>\n\n<p><em>As of September 30th, 2020, Roblox had over 18 Million experiences for players.</em></p>\n\n<p>Robux can also be purchased directly from Roblox and used for various in-game items such as player customizations and game-specific power ups. Roblox offers a monthly subscription service called “Roblox Premium” where users can obtain exclusive items and a monthly supply of Robux.</p>\n\n<p><em>In 2020, Roblox was the 2nd most watched game on YouTube with 75 Billion views</em></p>\n\n<h1>Market Data</h1>\n\n<p><strong>IPO</strong> <a href=\"https://www.marketwatch.com/investing/stock/rblx/ipo\"><sup>source</sup></a></p>\n\n<ul>\n<li><strong>SEC Filing:</strong> Feb 11th, 2021\n\n<ul>\n<li><a href=\"https://www.sec.gov/Archives/edgar/data/1315098/000119312521038726/d87104ds1a.htm\">https://www.sec.gov/Archives/edgar/data/1315098/000119312521038726/d87104ds1a.htm</a></li>\n</ul></li>\n<li><strong>Exchange:</strong> NYSE</li>\n<li><strong>Ticker:</strong> RBLX</li>\n<li><strong>IPO Date:</strong> March 10th</li>\n<li><strong>Est. Opening:</strong> $45</li>\n<li><strong>Shares:</strong> 198.9M</li>\n<li><strong>Sectors:</strong> Tech</li>\n</ul>\n\n<p><strong>Financials as of Sept 30th, 2020</strong> <sup>Source: Pre-Page 6 of Sec Filing</sup></p>\n\n<ul>\n<li><strong>Revenue:</strong> $614M</li>\n<li><strong>Bookings:</strong> $1.2B</li>\n<li><strong>Operating Cash Flow:</strong> $345M</li>\n<li><strong>Net Loss:</strong> $195M</li>\n</ul>\n\n<p><strong>Valuation</strong> <a href=\"https://venturebeat.com/2021/01/06/roblox-raises-520-million-at-29-5-billion-valuation-will-go-public-through-direct-listing/\"><sup>source</sup></a></p>\n\n<ul>\n<li><strong>2018:</strong> $2.5 Billion</li>\n<li><strong>2020:</strong> $4.0 Billion (Series-G funding round $150M raised on Feb. 2020)</li>\n<li><strong>2021:</strong> $29.5 Billion (Series-H funding round $520M Raised on Jan. 2021)</li>\n</ul>\n\n<p><strong>Revenue</strong> <a href=\"https://www.businessofapps.com/data/roblox-statistics/\"><sup>source</sup></a></p>\n\n<ul>\n<li><strong>2017:</strong> $45.7M || <strong>2018:</strong> $335M || <strong>2019:</strong> $435M</li>\n<li><strong>2020:</strong> $613.9M as of Sept 30th, 2020</li>\n<li><strong>2021:</strong> Projected $1.44 Billion to $1.52 Billion</li>\n</ul>\n\n<p><strong>Shareholders as of Nov. 2020</strong> <a href=\"https://techcrunch.com/2020/11/19/roblox-files-to-go-public/\"><sup>source</sup></a></p>\n\n<ul>\n<li><strong>Altos Ventures:</strong> 21.3%</li>\n<li><strong>CEO David Baszucki:</strong> 12%</li>\n<li><strong>Meritech Capital:</strong> 10.3%</li>\n<li><strong>Index Ventures:</strong> 9.9%</li>\n<li><strong>Tiger Global:</strong> 7.3%</li>\n<li><strong>First Round Capital:</strong> 6.3%</li>\n</ul>\n\n<p><strong>Growth</strong> <sup>Source: Prospectus Summary Pages 2-4 of SEC Filing</sup></p>\n\n<ul>\n<li><strong>Revenue</strong>\n\n<ul>\n<li><strong>2018 -&gt; 2019:</strong> 325.0M -&gt; 508.4M (+56%)</li>\n<li><strong>2019 -&gt; 2020:</strong> 360.8M -&gt; 613.9M (+70%) <sup>(9 Months ended Sept 30th for both years</sup>)</li>\n</ul></li>\n<li><strong>Bookings</strong>\n\n<ul>\n<li><strong>2018 -&gt; 2019:</strong> 499.0M -&gt; 694.3M (+39%)</li>\n<li><strong>2019 -&gt; 2020:</strong> 458.0M -&gt; 1.240B (+171%) <sup>(9 Months ended Sept 30th for both years</sup>)</li>\n</ul></li>\n<li><strong>Daily Active Users</strong>\n\n<ul>\n<li><strong>2018 -&gt; 2019:</strong> 12.0M to 17.6M (+47%)</li>\n<li><strong>2019 -&gt; 2020:</strong> 17.1M to 31.1M (+81%) <sup>(9 Months ended Sept 30th for both years</sup>)</li>\n</ul></li>\n<li><strong>Engagement Hours</strong>\n\n<ul>\n<li><strong>2018 -&gt; 2019:</strong> 9.4B to 13.7B (+45%)</li>\n<li><strong>2019 -&gt; 2020:</strong> 10.0B to 22.2B (+123%) <sup>(9 Months ended Sept 30th for both years</sup>)</li>\n</ul></li>\n</ul>\n\n<p><strong>Risk Factors</strong> <sup>Source: Prospectus Summary Pages 9-10 of SEC Filing</sup></p>\n\n<ul>\n<li>Recent rapid growth may not be indicative of future growth.</li>\n<li>History of Net Losses that may not be able to achieve profitability in the future.</li>\n<li>Hard to predict financial situations quarter to quarter. Effected by seasonal demands</li>\n<li>Recent setbacks for business operations due to COVID-19 Outbreak</li>\n<li>Relies heavily on Mobile devices, hardware and networks that they do not control, and changes could affect user experience and retention</li>\n<li>Identified material weakness in internal control over financial reporting which resulted in restatement of their financial states for 2018 and 2019 and first 9 months in 2020.</li>\n<li>The public trading of the Class A common stock may be volatile and could, upon listing on the NYSE, decline significantly and rapidly.</li>\n<li>As of Jan. 2015, the executive officers, directors and holders of 5% or more of the Class A stock collectively own ~65.5% of the outstanding shares and 100% of the outstanding Class B common to maintain substantial control.</li>\n</ul>\n\n<h1>Revenue Generation</h1>\n\n<p>Roblox generates revenue in several ways. Players purchase Robux directly for prices ranging from $4.99 to $99.99. Players can spend Robux on game-specific purchases that goes to the Creators with a 30% fee taken out.</p>\n\n<p>Creators can exchange Robux for USD at a current rate $350 per 100,000 Robux as of March 4, 2020. To purchase 100,000 Robux would require 10 purchases of the $99.99 package (10k Robux each) for a total of $999.90.</p>\n\n<p>Roblox also offers three subscription tiers ranging from $4.99 to $19.99 a month, which earns a player Robux and Exclusive store items.</p>\n\n<p>Merchandise plays a role in revenue generation as well. Roblox offers clothing, figurines and gift cards which can be purchased online and in person from places like Amazon, Walmart, Target, and other retail locations.</p>\n\n<h1>Growth Potential and Catalyst</h1>\n\n<p>The current outlook for Roblox to grow is promising. There are active investments being made in expanding the age range, international reach, monetization, and technical capabilities of the platform. By continuing to employ modern technology to improve the platform, higher quality experiences and content that appeals to older age demographics can be created.</p>\n\n<p>Current international markets for Roblox include US, Canada, and the United Kingdom. Roblox is actively investing in technology that they hope will enhance their growth around the world. For example, they hope to use automated translation and built-in regional compliance tools to help scale into other global markets.</p>\n\n<p>Monetization is another key component to Roblox growing. Recently Roblox Premium which offers a monthly subscription service to its users was added. Roblox actively works with its creator and developer community to help bring them improve their monetization, which in turn increases Roblox’s monetization. Roblox expects to work with leading brands to build unique marketing opportunities to the platform.</p>\n\n<h1>Competitors and Differences</h1>\n\n<p>One of the things to keep in mind about Roblox itself is not a game, but a gaming platform and ecosystem of multiple gaming experiences. Over 18 million games can be launched from their website and played through a downloaded app on the user’s computer. Each game can be completely unique from every other game.</p>\n\n<p>Roblox as a platform would more closely related to that of Steam (by Valve) or Epic Games Launcher (by Epic) or Origin (by EA). However, instead of purchasing games through this, a user simply launches whichever one of these free experiences they want at any time. There is no purchasing of the game like there is on the other mentioned platforms.</p>\n\n<p>Roblox’s main difference is they use the underlying tools to create Roblox specific games utilizing their Software Development Kit (SDK). Other games launched on Steam or Epic are much more loosely connected to the platforms distributing it, whereas Roblox games are highly connected to the Roblox platform in general. The barrier of entry to create a Roblox gaming experience is much less difficult than to create a game to release on other distribution platforms, however the games themselves are “Roblox-centric” and have common styling, controls, and gaming mechanisms.</p>\n\n<p>Roblox does not charge for the games themselves, but a user buys virtual items and enhancements through their virtual currency called Robux (See “Revenue Generation”). A user can also be a Roblox Creator who can create virtual items that will appear on their character in all games. They can also create their own Roblox experiences and sell items unique to that game on their own store for Robux. Robux can then be turned into real money (100k Robux -&gt; $350 USD) if the creator wishes to cash out, or they can spend it for themselves within Roblox.</p>\n\n<h1>The User Experience and YouTube Scene</h1>\n\n<p>When a Roblox player wants to play a game, they navigate to the Roblox website and login. This allows them to browse a list of games and launch the experience within a downloaded application on their computer called the Roblox Player.</p>\n\n<p>Users on the website can change their avatar and browse the shop for various items such as gear, emotes, characters, and other customizations. Players can connect with their friends or join 1 or more groups of other players to form smaller communities to play together.</p>\n\n<p>Roblox is massive in the YouTube scene. The official Roblox channel has ~2.9 Million Subscribers. Some YouTube creators attempt to create their own content and promote it on their channel to earn Robux, which they can then exchange for real-life cash.</p>\n\n<p>Roblox can appeal to different age groups for different reasons. While younger age-groups are the ones playing the game, older age-groups are finding ways to make tons of money as developers and creators.</p>\n\n<p><em>In 2020, Roblox was the second most watched game on YouTube (second only to Minecraft)</em></p>\n\n<h1>Conclusion</h1>\n\n<p>Being relatively new to trading and this being my first due-diligence for a company, I hesitate to make any sort of predictions personally on where this price will go up or down. My gut tells me the $45 price doesn&#39;t feel over or under valued, but I think Roblox has a lot of growth potential over the next year.</p>\n\n<p><strong>Again, you should NOT take any of this as sound financial advice. I am very new to this.</strong></p>\n\n<p>I do welcome all criticisms and feedback you have to offer. Tell me what&#39;s good, bad and missing from this DD!</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/investing/comments/lysdir/dd_upcoming_roblox_rblx_ipo_next_week_march_10th/",
  "subreddit": "investing",
  "id": "lysdir",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542574790
}