{
  "author": "CuntyMcGiggles",
  "original_created_utc": 1636132149,
  "title": "Has anyone heard of Loopring (LRC)? I haven’t heard anyone mention it before",
  "created_utc": 1636140807,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It’s apparently owned by Mark Zuckerberg, The Rock, and Obama. I’m not sure on the details because there’s really not much information on it and no one is talking about it, but it is supposed to be able to teleport people through the blockchain like in Star Trek without any gas fees</p>\n\n<p>I read the white paper and I really believe in the tech. I’m hearing they’ve also got some really neat time travel projects on the go. Not to mention every Facebook user will get a free Loopring bandana or keychain (while supplies last)</p>\n\n<p>The market cap is only $10,000 right now and the dev team is fully doxed. They’re also the same people who created the original Palm Pilot and were instrumental  in the development of the new Root Beer flavour of Pop Tarts. I’m not kidding when I say I think it could 1000x time easily by the end of December. </p>\n\n<p>Of course, as with anything, DYOR. But I’m shocked not a single person is talking about this revolutionary coin.</p>\n</div><!-- SC_ON -->",
  "score": 226,
  "permalink": "/r/CryptoCurrency/comments/qnfpz6/has_anyone_heard_of_loopring_lrc_i_havent_heard/",
  "subreddit": "CryptoCurrency",
  "id": "qnfpz6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It’s apparently owned by Mark Zuckerberg, The Rock, and Obama. I’m not sure on\nthe details because there’s really not much information on it and no one is\ntalking about it, but it is supposed to be able to teleport people through the\nblockchain like in Star Trek without any gas fees\n\nI read the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "マーク・ザッカーバーグ、ザ・ロック、オバマの3人が所有しているらしい。詳細はわかりません。\n詳細はわかりませんが、あまり情報がなく、誰もが\n詳細はわかりませんが、スタートレックのように、ブロックチェーンを介して人々をテレポートできると言われています。\nスター・トレックのように、ブロックチェーンを介して人々をテレポートすることができるとされていますが、ガス代はかかりません\n\n私が読んだのは...",
      "title": "Loopring(LRC)をご存知の方はいらっしゃいますか？誰も言及しているのを聞いたことがありません"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "显然，它的主人是马克-扎克伯格、洛克和奥巴马。我不太清楚\n我不确定细节，因为真的没有太多的信息，没有人在谈论它。\n谈论它，但它应该能够像《星际迷航》中那样通过区块链把人传送出去，而不需\n区块链，就像《星际迷航》中那样，不需要任何汽油费。\n\n我读了...",
      "title": "有人听说过Loopring（LRC）吗？我以前没有听到有人提到过它"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "顯然，它的主人是馬克-扎克伯格、洛克和奧巴馬。我不太清楚\n我不確定細節，因爲真的沒有太多的信息，沒有人在談論它。\n談論它，但它應該能夠像《星際迷航》中那樣通過區塊鏈把人傳送出去，而不需\n區塊鏈，就像《星際迷航》中那樣，不需要任何汽油費。\n\n我讀了...",
      "title": "有人聽說過Loopring（LRC）嗎？我以前沒有聽到有人提到過它"
    }
  ]
}