{
  "author": "globalWarmingCowFart",
  "original_created_utc": 1630007881,
  "title": "How many of you heard of bitcoin before it exploded to tens of thousands of dollars, but decided to not buy because it was overpriced or you felt it didn’t have a future?",
  "created_utc": 1630035385,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Trust me, I was one of the people back in 2013 who heard about bitcoin, people were talking about it on Facebook and Twitter, but not in the capacity that it is mentioned today. People were talking about how some became millionaires because they had bought in at 2010. Nevertheless, everyone thought it was a nerdy gimmick and wanted to sell it as soon as possible if they had it as Bitcoin hit 1k for the first time.</p>\n\n<p>Now fast forward to 2021, and people are starting to regret that decision that they couldn’t have bought in earlier. I learned not to regret now because there was no way that we could’ve thought that it could’ve been this successful at this time. </p>\n\n<p>The 2013 bubble seemed like the bubble of all the bubbles and it wasn’t just that people thought it would fail, it’s just that most people don’t even know about it and you had to be an avid Internet user if you happened to stumble upon bitcoin.</p>\n\n<p>There goes a saying, “should’ve, could’ve, would’ve“. No one had a time machine and those who became millionaires from rags to riches didn’t even know they had bitcoin until now.</p>\n\n<p>So let me ask you, how was your experience when you found out about bitcoin for the first time? How do you feel today? I’m curious to hear.</p>\n</div><!-- SC_ON -->",
  "score": 163,
  "permalink": "/r/CryptoCurrency/comments/pc77hf/how_many_of_you_heard_of_bitcoin_before_it/",
  "subreddit": "CryptoCurrency",
  "id": "pc77hf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Trust me, I was one of the people back in 2013 who heard about bitcoin, people\nwere talking about it on Facebook and Twitter, but not in the capacity that it\nis mentioned today. People were talking about how some became millionaires\nbecause they had bought in at 2010. Nevertheless, everyone thought…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "信じてください、私は2013年にビットコインのことを知った一人です。\nフェイスブックやツイッターで話題になっていましたが、今のように話題になるほどではありませんでした。\n話題になっていました。2010年に購入して億万長者になった人がいるという話でした。\n2010年に購入して億万長者になった人もいるという話でした。とはいえ、誰もが思っていたのは...。",
      "title": "ビットコインが爆発的に数万ドルになる前にその存在を知ったものの、値段が高かったり、将来性がないと感じて買わないと決めた人はどれくらいいるだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "相信我，我是在2013年听到比特币的人之一，当时人们在谈论比特币。\n人们在脸书和推特上谈论它，但不是像现在这样\n但不是像今天这样被提及。人们在谈论一些人如何成为百万富翁\n因为他们在2010年就买入了。尽管如此，每个人都认为...",
      "title": "在比特币爆炸到数万美元之前，你们中有多少人听说过它，但决定不买，因为它的价格过高，或者你觉得它没有前途？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "相信我，我是在2013年聽到比特幣的人之一，當時人們在談論比特幣。\n人們在臉書和推特上談論它，但不是像現在這樣\n但不是像今天這樣被提及。人們在談論一些人如何成爲百萬富翁\n因爲他們在2010年就買入了。儘管如此，每個人都認爲...",
      "title": "在比特幣爆炸到數萬美元之前，你們中有多少人聽說過它，但決定不買，因爲它的價格過高，或者你覺得它沒有前途？"
    }
  ]
}