{
  "author": "jasomniax",
  "original_created_utc": 1638207447,
  "title": "Lets be honest, most of us don't really understand how cryptocurrency works. And barely any of us know \"exactly\" how it functions.",
  "created_utc": 1638214753,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>These past months I&#39;ve been researching how blockchains work and every day I learn something new and realize more how little I know how everything really works.</p>\n\n<p>I mean sure, most of us know the basics:</p>\n\n<ul>\n<li>BTC is a store of value</li>\n<li>ETH has a shit ton of use cases and a massive ecosystem</li>\n<li>DeFi is the future</li>\n<li>Putting money in crypto long term is better than let my money rot away in a savings account</li>\n<li>Staking is good long term</li>\n</ul>\n\n<p>But how many of us really know the IT side of how the blockchain works.</p>\n\n<p>I bet lots of us have questions like:</p>\n\n<p>¿Why am I earning APY for staking? ¿How the fuck does a validator node validate? ¿How is a block created? ¿Why are blockchains so secure and hard to hack? ¿How do you REALLY know something is decentralized?</p>\n\n<p>I&#39;ll be honest, I don&#39;t fully understand any of these concepts.</p>\n\n<p>Many of these things I don&#39;t know because of lack of research and I ain&#39;t the brightest fella of the <strong>block</strong>.</p>\n\n<p><strong>TL;DR</strong> : Am I the only one that finds how blockchains truly work hard to understand? Or am I not alone?</p>\n</div><!-- SC_ON -->",
  "score": 1247,
  "permalink": "/r/CryptoCurrency/comments/r511p0/lets_be_honest_most_of_us_dont_really_understand/",
  "subreddit": "CryptoCurrency",
  "id": "r511p0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "These past months I've been researching how blockchains work and every day I\nlearn something new and realize more how little I know how everything really\nworks.\n\nI mean sure, most of us know the basics:\n\n * BTC is a store of value\n * ETH has a shit ton of use cases and a massive ecosystem\n * DeFi is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この数ヶ月間、私はブロックチェーンの仕組みを研究してきました。\n毎日、新しいことを学び、自分がいかにすべての仕組みを知らないかを痛感しています。\nを実感しています。\n\n確かに、ほとんどの人は基本的なことを知っています。\n\n * BTCは価値のあるもの\n * ETHは膨大なユースケースと巨大なエコシステムを持つ\n * DeFiは...",
      "title": "正直なところ、私たちのほとんどは、暗号通貨の仕組みをよく理解していません。そして、その機能を「正確に」知っている人はほとんどいません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在过去的几个月里，我一直在研究区块链的工作原理，每天我都能\n我都会学到一些新东西，并意识到我对一切事物的真正\n运作。\n\n我的意思是，当然，我们大多数人都知道基础知识。\n\n * BTC是一种价值存储\n * ETH有大量的使用案例和一个庞大的生态系统\n * DeFi是...",
      "title": "说实话，我们大多数人并不真正了解加密货币的工作原理。而且我们中几乎没有人知道它的 \"确切 \"功能。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在過去的幾個月裏，我一直在研究區塊鏈的工作原理，每天我都能\n我都會學到一些新東西，並意識到我對一切事物的真正\n運作。\n\n我的意思是，當然，我們大多數人都知道基礎知識。\n\n * BTC是一種價值存儲\n * ETH有大量的使用案例和一個龐大的生態系統\n * DeFi是...",
      "title": "說實話，我們大多數人並不真正瞭解加密貨幣的工作原理。而且我們中幾乎沒有人知道它的 \"確切 \"功能。"
    }
  ]
}