{
  "author": "WhiskeyTangoTrotfox",
  "original_created_utc": 1632885811,
  "title": "Assume the worst. What would you do if the market crashes?",
  "created_utc": 1632908026,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For good reason, given recent news about government shutdown fears in the US and Evergrande/China banning crypto again, there is a lot of FUD about a massive market correction across assets classes and especially in the stock market. </p>\n\n<p>It’s easy to say, “I’ll DCA” if shit hits the fan. But would you? Assuming you have a retirement account or other accounts beyond crypto, would you confidently double down after a huge drawback to your net worth? </p>\n\n<p>Americans in 2008 and before then, during the dot com bubble, were shell shocked to see their portfolios crash over 50%, erasing the possibility of retirement for a lot of them. </p>\n\n<p>What would you do? Double down on your current investments? Try to catch something you’ve wanted on sale? Wait to see if the dip dips more? Call it quits and exit? </p>\n\n<p>It’s worth considering what you’d do when the going really <em>does</em> get tough.</p>\n</div><!-- SC_ON -->",
  "score": 192,
  "permalink": "/r/CryptoCurrency/comments/pxmt8u/assume_the_worst_what_would_you_do_if_the_market/",
  "subreddit": "CryptoCurrency",
  "id": "pxmt8u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "For good reason, given recent news about government shutdown fears in the US and\nEvergrande/China banning crypto again, there is a lot of FUD about a massive\nmarket correction across assets classes and especially in the stock market.\n\nIt’s easy to say, “I’ll DCA” if shit hits the fan. But would you?…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "それには理由があります。最近のニュースでは、米国の政府機関の閉鎖懸念や\n米国の政府機関の閉鎖懸念や、中国のEvergrandeが再び暗号を禁止したという最近のニュースを考えると、資産クラス全体、特に株式市場で大規模な市場調整が起こるのではないかという不安があるのは当然です。\n資産クラスを問わず、特に株式市場では大規模な市場調整が行われている。\n\n混乱に陥ったときに「DCAを導入する」と言うのは簡単です。しかし、あなたならどうしますか？...",
      "title": "最悪の事態を想定してください。市場が暴落したらどうしますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "鉴于最近关于美国政府关门的担忧和\n恒大/中国再次禁止加密货币的消息，有很多关于大规模\n各类资产的市场调整，特别是在股市。\n\n这很容易说，\"我将DCA\"，如果狗屎击中风扇。但是你会吗？",
      "title": "假设最坏的情况。如果市场崩溃了，你会怎么做？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "鑑於最近關於美國政府關門的擔憂和\n恆大/中國再次禁止加密貨幣的消息，有很多關於大規模\n各類資產的市場調整，特別是在股市。\n\n這很容易說，\"我將DCA\"，如果狗屎擊中風扇。但是你會嗎？",
      "title": "假設最壞的情況。如果市場崩潰了，你會怎麼做？"
    }
  ]
}