{
  "author": "seebz69",
  "the_new_excerpt": "Brand Awareness - Aphria Brands on SweetWater Brews\n\nSweetWater Brewing Company is a craft brewery founded in 1997 by Freddy Bensch\nand Kevin McNerney in Atlanta, Georgia. SweetWater's beers are unpasteurized and\ndistribution is limited to select states\n\nSweetWater recently annouced that their beer…",
  "original_created_utc": 1613622086,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "品牌意识--Aphria品牌在SweetWater Brews上的表现\n\nSweetWater Brewing Company是由Freddy Bensch于1997年创立的手工啤酒厂。\n和Kevin McNerney在佐治亚州亚特兰大市。SweetWater的啤酒是未经巴氏杀菌的，并且是在亚特兰大乔治亚州。\n只限于部分州的分布\n\nSweetWater最近宣布，他们的啤酒...",
      "title": "Aphria/SweetWater - Brews & Branding ($APHA)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "品牌意識--Aphria品牌在SweetWater Brews上的表現\n\nSweetWater Brewing Company是由Freddy Bensch於1997年創立的手工啤酒廠。\n和Kevin McNerney在佐治亞州亞特蘭大市。SweetWater的啤酒是未經巴氏殺菌的，並且是在亞特蘭大喬治亞州。\n只限於部分州的分佈\n\nSweetWater最近宣佈，他們的啤酒...",
      "title": "Aphria/SweetWater - Brews & Branding ($APHA)"
    }
  ],
  "title": "Aphria/SweetWater - Brews & Branding ($APHA)",
  "created_utc": 1613687735,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Brand Awareness - Aphria Brands on SweetWater Brews</p>\n\n<p>SweetWater Brewing Company is a craft brewery founded in 1997 by Freddy Bensch and Kevin McNerney in Atlanta, Georgia. SweetWater&#39;s beers are unpasteurized and distribution is limited to select states</p>\n\n<p>SweetWater recently annouced that their beer will <a href=\"https://www.businesswire.com/news/home/20210121005247/en/SweetWater-Brewing-Company-Reaches-New-Heights-Launching-Statewide-in-Colorado-February-1\">be available in 27 states with Western Expansion</a></p>\n\n<blockquote>\n<p>SweetWater’s expansion into the first U.S. state to legalize recreational marijuana comes shortly after its <a href=\"https://www.prnewswire.com/news-releases/aphria-inc-announces-strategic-entry-into-the-united-states-with-an-agreement-to-acquire-sweetwater-brewing-company-301166616.html\">November 2020 acquisition</a> by Aphria Inc</p>\n</blockquote>\n\n<p>Irwin simon, the CEO of Aphria, has a track record for aggressive expansion. He brings a unique background who specializes in M&amp;As. Aphria’s recent acquisition of SweetWater was a strategic play to expand into US &amp; more importantly, creating brand awareness. </p>\n\n<blockquote>\n<p>We will establish and grow our U.S. presence through SweetWater&#39;s robust, profitable platform of craft brewing innovation, manufacturing, marketing and distribution expertise. At the same time, we will build brand awareness for our adult-use cannabis brands, Broken Coast, Good Supply, Riff and Solei, through our participation in the growing $29 billion craft brew market in the U.S. ahead of potential future state or federal cannabis legalization</p>\n</blockquote>\n\n<p><strong>US Trademarks</strong></p>\n\n<p>Aphria proactively filed US Trademarks for a number of their brands:</p>\n\n<p><a href=\"https://uspto.report/TM/90383411\">Broken Coast</a></p>\n\n<p><a href=\"https://uspto.report/TM/90383302\">Riff</a>  </p>\n\n<p><a href=\"https://uspto.report/TM/90383374\">Solei</a></p>\n\n<p>Irwin is leveraging SweetWater&#39;s existing infrastructure to accelerate Aphria&#39;s entry into the U.S. ahead of federal legalization of cannabis to fuel sustainable profitable growth. Aphria will be positioning itself as a top tier brand in the US through SweetWater.</p>\n\n<p><a href=\"https://aphriainc.com/wp-content/uploads/2020/11/Aphria-Inc.-November-2020-AGM-Presentation-FINAL.pdf\">Proof of Concept</a></p>\n\n<p><strong>Broken Coast Brew</strong> - <em>The best of the bud in the best of the brews</em></p>\n\n<blockquote>\n<p>Inspired by the one and only Broken Coast, these small batch craft brews will have you saying “woah”. Packed with incredible earthy, dank and complex cannabis-inspired flavours you’ll feel the sea breeze in no-time. (Pg.25)</p>\n</blockquote>\n\n<p><strong>RIFF</strong> – <em>Loud without the cloud</em></p>\n\n<blockquote>\n<p>Not for the un-inspired, RIFF’s brew masters bring the house down. Hoppy, flavorful and aromatic our lineup brings the party to wherever you are. Join us in this joint effort and run the show with these flavour-packed brews. (Pg.26)</p>\n</blockquote>\n\n<p><strong>Solei Hard Seltzer</strong> – <em>it is always sunny with Solei</em></p>\n\n<blockquote>\n<p>There is no time to enjoy the sunshine like every time. Solei’s hard seltzers are created with the perfect combination of freshness and crisp flavours. Made with sun-kissed fruits, Solei Hard Seltzer brings the sun all year round. (Pg.27)</p>\n</blockquote>\n\n<p>I wouldn’t be surprised to see the Solei concept featured on SweetWaters newly released <a href=\"https://www.businesswire.com/news/home/20210125005211/en/SweetWater-Releases-Oasis%C2%AE-Premium-Hard-Seltzer\">Premium Hard Seltzer</a> at some point.</p>\n\n<p>In addition to its traditional distribution footprint, SweetWater 420 Extra Pale Ale and IPA are served on all Delta flights nationwide plus internationally totaling more than 50 countries across six continents which has served to extend SweetWater&#39;s brand reach on both a national and international level. The Company also hosts an annual music festival, &quot;SweetWater 420 Fest,&quot; that has evolved into one of the largest and most anticipated music festivals in the U.S., increasing brand awareness nationwide.</p>\n\n<p>This move creates a branded cannabis lifestyle Products Company with a diverse revenue base. I strongly encourage everyone to look into the management on both sides and come to your own conclusions.</p>\n\n<p>Stay safe &amp; GLTA!</p>\n\n<p><em>I am not a Financial Advisor, so please do your own DD. In my opinion, Aphria poised for significant growth</em></p>\n</div><!-- SC_ON -->",
  "score": 53,
  "permalink": "/r/investing/comments/lmdkbo/aphriasweetwater_brews_branding_apha/",
  "subreddit": "investing",
  "id": "lmdkbo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332881974
}