{
  "author": "vacalicious",
  "the_new_excerpt": "No, the upward movement in cannabis stocks is not a concerted distraction by\nWall Street to take attention away from GME. Believe it or not, but a global\nstock market can contain numerous trends all at once. The weed stocks rallied\nbecause of the belief that broader cannabis legalization is possible…",
  "original_created_utc": 1613004833,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "不，大麻股的涨势并非是以下人士的共同分心。\n华尔街将注意力从GME上转移开来。信不信由你，但全球\n股市可以同时包含众多趋势。杂草股上涨\n因为相信更广泛的大麻合法化是可能的...",
      "title": "杂草反弹与GME无关"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不，大麻股的漲勢並非是以下人士的共同分心。\n華爾街將注意力從GME上轉移開來。信不信由你，但全球\n股市可以同時包含衆多趨勢。雜草股上漲\n因爲相信更廣泛的大麻合法化是可能的...",
      "title": "雜草反彈與GME無關"
    }
  ],
  "title": "The weed rally has nothing to do with GME",
  "created_utc": 1613042437,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>No, the upward movement in cannabis stocks is not a concerted distraction by Wall Street to take attention away from GME. Believe it or not, but a global stock market can contain numerous trends all at once. The weed stocks rallied because of the belief that broader cannabis legalization is possible in the next 12-18 months under a Biden administration. Remember: the U.S. House of Representatives passed a bill decriminalizing cannabis last December, only for that legislation to die in the Senate, still controlled by the GOP. Now that Dems have control of the White House and both chambers of Congress, cannabis has a much more clear and easy path towards legalization. Obviously that would be enormous for the marijuana industry, so people are grabbing shares now, ahead of the potential explosion in growth. Also, a lot of these stocks were shorted and are now getting squeezed. None of this has anything to do with GME.</p>\n</div><!-- SC_ON -->",
  "score": 4589,
  "permalink": "/r/wallstreetbets/comments/lh8ui6/the_weed_rally_has_nothing_to_do_with_gme/",
  "subreddit": "wallstreetbets",
  "id": "lh8ui6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728625150
}