{
  "author": "Xi_jinping_x",
  "original_created_utc": 1648231817,
  "title": "Comment a coin and we will give it a Constructive Criticism",
  "created_utc": 1648305061,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So, today let&amp;#39;s do something different, instead of the comment a coin and we roast it post, lets instead do something like you will comment a coin and instead of just roasting or hating on it we will list out all the flaws of the coin you mentioned and we shall also give our opinion on what could be done to fix the flaws.&lt;/p&gt;\n\n&lt;pre&gt;&lt;code&gt;So, basically comment a coin and we shall give it constructive Criticism based on our own ideas and opinions(our opinions could be wrong though). \n\n I&amp;#39;m sure that giving a constructive criticism will help more people be aware of the coin they hold. Although if you love shitcoin no one will be able to help you.\n&lt;/code&gt;&lt;/pre&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 304,
  "permalink": "/r/CryptoCurrency/comments/tnuhr2/comment_a_coin_and_we_will_give_it_a_constructive/",
  "subreddit": "CryptoCurrency",
  "id": "tnuhr2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So, today let's do something different, instead of the comment a coin and we\nroast it post, lets instead do something like you will comment a coin and\ninstead of just roasting or hating on it we will list out all the flaws of the\ncoin you mentioned and we shall also give our opinion on what could…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "さて、今日はいつもと違うことをやってみましょう。\nその代わりに、コインにコメントをして、そのコインに\nただ焼いたり、嫌ったりするのではなく、その欠点をすべて列挙するのです。\nそして、あなたの言ったコインについて、私たちの意見を述べましょう。",
      "title": "コインをコメントすると、私たちは建設的な批評をします。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以，今天让我们做一些不同的事情，而不是评论一个硬币，我们\n烘烤它的帖子，而是让我们做一些事情，比如你将评论一个硬币并\n我们将列出你所提到的硬币的所有缺陷，而不是一味地烘烤或憎恨它。\n我们将列出你所提到的硬币的所有缺陷，我们也将给出我们的意见，说明什么是可以......",
      "title": "评论一枚硬币，我们将给它一个建设性的批评。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以，今天讓我們做一些不同的事情，而不是評論一個硬幣，我們\n烘烤它的帖子，而是讓我們做一些事情，比如你將評論一個硬幣並\n我們將列出你所提到的硬幣的所有缺陷，而不是一味地烘烤或憎恨它。\n我們將列出你所提到的硬幣的所有缺陷，我們也將給出我們的意見，說明什麼是可以......",
      "title": "評論一枚硬幣，我們將給它一個建設性的批評。"
    }
  ]
}