{
  "author": "karmaguy7",
  "original_created_utc": 1656409218,
  "title": "Changelly holding legally owned bitcoin life savings after Ledger swap. Please help",
  "created_utc": 1656434891,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I write this post in the hope that some awareness to my situation might resolve this. I really don&amp;#39;t know what to do and I am physically sick as a result of what has happened. I think I have just lost my life savings in one fatal move and I&amp;#39;m severely distraught right now.&lt;/p&gt;\n\n&lt;p&gt;I know how stupid I am and I know that I should have not done this but thinking about that over and over is literally making me vomit. I can&amp;#39;t sleep, havn&amp;#39;t eaten in days and am frozen in worry and anxiety.&lt;/p&gt;\n\n&lt;p&gt;**What happened:**I wanted to swap my BTC directly from my ledger. I have saved my BTC since 2017 on there. I was prompted to use the swap service through the ledger live app and I went ahead and did so sending  my BTC for the swap. Ledger said changelly was the service provider and since I always trusted ledger over the years I trusted their affiliation.&lt;/p&gt;\n\n&lt;p&gt;The BTC was sent and i noticed the transaction showed as &amp;#39;on hold&amp;#39; on the ledger swap details. I contacted Changelly and went through the KYC where I uploaded all my ID etc and passed it successfully. Then I received an email from Changelly asking for AML compliance.&lt;/p&gt;\n\n&lt;p&gt;I sent Changelly company dividend documents showing that the BTC was received as a dividend payment from my own company of which I was the director. I also provided them with a link to the records of my company which shows that I was the legal registered director. There is no doubt that the funds are mine and were legally obtained.&lt;/p&gt;\n\n&lt;p&gt;After no reply from them I followed up with an email asking if they had received the documents. They then sent me an email asking for the documents once more so I sent them again. They have confirmed receipt of the documents now and are telling me to wait for an indefinite amount of time while they are &amp;#39;checked&amp;#39;. Of course I was prompted to then check online for any similar issues with this company and when I started reading everyone else&amp;#39;s stories I was literally sick.&lt;/p&gt;\n\n&lt;p&gt;I have emailed them multiple times asking for return of my legally obtained funds or for a timeframe on when my documents will be checked but have had no reply. Since then I am an absolute mess and I don&amp;#39;t know what else to do.&lt;/p&gt;\n\n&lt;p&gt;I have contacted ledger support to try and raise more awareness as ledger are prompting users to use Changelly as a partner for their swap service. They are yet to get back to me&lt;/p&gt;\n\n&lt;p&gt;If anyone can help me get attention to this please reach out or share this to the community as I am unable to function in any reasonable capacity after what has happened.🙏I just want my funds back so i can sleep and I will never do anything so stupid as this again.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;UPDATE--------------------------------------------------&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;After raising hell here on Reddit , sending numerous messages to Ledger, their reps and even the ledger CEO, also with the power of the Reddit community, these charlatans have finally sent my funds back.&lt;/p&gt;\n\n&lt;p&gt;I want to say a huge thank you to you all for helping me light this fire and show them what the power of our community can do. I will surely be more careful in the future but should I be in trouble again, I know Reddit fam got my back. Thanks again guys, Reddit 1 Changelly 0&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 368,
  "permalink": "/r/Bitcoin/comments/vmj90p/changelly_holding_legally_owned_bitcoin_life/",
  "subreddit": "Bitcoin",
  "id": "vmj90p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I write this post in the hope that some awareness to my situation might resolve\nthis. I really don't know what to do and I am physically sick as a result of\nwhat has happened. I think I have just lost my life savings in one fatal move\nand I'm severely distraught right now.\n\nI know how stupid I am…"
}