{
  "author": "_DEDSEC_",
  "original_created_utc": 1632114535,
  "title": "Pro Tip: If you're using Binance, use BUSD limit orders to make feeless spot transactions",
  "created_utc": 1632141437,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I can&#39;t believe I didn&#39;t check the trade history to know this. I knew BUSD was feeless meaning you can buy any asset in the spot market and pay zero % fees. </p>\n\n<p>But I noticed many times that fees were indeed deducted for my market orders, I did some googling and noticed it was some sort of a limited time promotion. </p>\n\n<p>But today I made a limit order for the first time in months and checked the transaction history, it&#39;s fee less!</p>\n\n<p>So market orders have fees associated with them even on BUSD pair, but Limit orders are fee less.</p>\n\n<h1>TL;DR: Use BUSD+Limit orders to make feeless transactions.</h1>\n</div><!-- SC_ON -->",
  "score": 179,
  "permalink": "/r/CryptoCurrency/comments/pro5ze/pro_tip_if_youre_using_binance_use_busd_limit/",
  "subreddit": "CryptoCurrency",
  "id": "pro5ze",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I can't believe I didn't check the trade history to know this. I knew BUSD was\nfeeless meaning you can buy any asset in the spot market and pay zero % fees.\n\nBut I noticed many times that fees were indeed deducted for my market orders, I\ndid some googling and noticed it was some sort of a limited…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これを知るためにトレード履歴を確認しなかったのが信じられません。やっぱりBUSDは\nつまり、スポット市場でどのような資産でも購入でき、手数料がゼロ％であることを知っていました。\n\nしかし、私の成行注文には実際に手数料が差し引かれていることに何度も気づきました。\nググってみると、これはある種の限定的な...",
      "title": "プロのアドバイス：Binanceを使用している場合、BUSD指値注文を使用してfeelessスポット取引を行います。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我竟然没有查看交易记录就知道这一点。我知道BUSD是\n无感觉，意味着你可以在现货市场购买任何资产，并支付零%的费用。\n\n但我注意到很多时候，我的市场订单确实被扣除了费用。\n我做了一些谷歌搜索，发现这是某种有限的...",
      "title": "专业提示：如果你使用Binance，使用BUSD限价单来进行无感觉的现货交易。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我竟然沒有查看交易記錄就知道這一點。我知道BUSD是\n無感覺，意味着你可以在現貨市場購買任何資產，並支付零%的費用。\n\n但我注意到很多時候，我的市場訂單確實被扣除了費用。\n我做了一些谷歌搜索，發現這是某種有限的...",
      "title": "專業提示：如果你使用Binance，使用BUSD限價單來進行無感覺的現貨交易。"
    }
  ]
}