{
  "author": "Marchinon",
  "the_new_excerpt": "23andMe to Merge with Virgin Group’s VG Acquisition Corp. to Become\nPublicly-Traded Company Set to Revolutionize Personalized Healthcare and\nTherapeutic Development through Human Genetics\n\n23andMe is a leading consumer genetics and research company that offers a\npersonalized health and wellness…",
  "original_created_utc": 1612453109,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "23andMe将与维珍集团旗下的VG Acquisition Corp.合并，成为。\n公开上市的公司将彻底改变个性化医疗和\n通过人类遗传学进行治疗发展\n\n23andMe是一家领先的消费者遗传学和研究公司，它提供的\n个性化的健康与养生...",
      "title": "23andMe将上市"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "23andMe將與維珍集團旗下的VG Acquisition Corp.合併，成爲。\n公開上市的公司將徹底改變個性化醫療和\n通過人類遺傳學進行治療發展\n\n23andMe是一家領先的消費者遺傳學和研究公司，它提供的\n個性化的健康與養生...",
      "title": "23andMe將上市"
    }
  ],
  "title": "23andMe to go public",
  "created_utc": 1612478543,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>23andMe to Merge with Virgin Group’s VG Acquisition Corp. to Become Publicly-Traded Company Set to Revolutionize Personalized Healthcare and Therapeutic Development through Human Genetics</p>\n\n<p>23andMe is a leading consumer genetics and research company that offers a personalized health and wellness experience and has built a premier genetic database to unlock insights leading to the rapid discovery of promising new targets for drug development</p>\n\n<p>Transaction will provide the capital to fund additional investment in key growth initiatives across 23andMe’s consumer health and therapeutics businesses</p>\n\n<p>The transaction will value the outstanding shares of capital stock of 23andMe at an aggregate enterprise value of approximately $3.5 billion</p>\n\n<p>23andMe CEO and Co-Founder Anne Wojcicki and Virgin Group’s Sir Richard Branson are each investing $25 million into the $250 million PIPE and are joined by leading institutional investors including Fidelity Management &amp; Research Company LLC, Altimeter Capital, Casdin Capital, and Foresite Capital</p>\n\n<p>The pro forma cash balance of the combined company will exceed $900 million at closing\nCurrent shareholders of 23andMe will own 81% of the combined company</p>\n\n<p><strong>SUNNYVALE, CALIFORNIA &amp; NEW YORK, NY – February 4, 2021 – 23andMe, Inc., a leading consumer genetics and research company, and VG Acquisition Corp. (NYSE: VGAC), a special purpose acquisition company sponsored by Virgin Group, announced today that they have entered into a definitive merger agreement. Upon completion of the transaction, estimated in the second calendar quarter of 2021, VGAC will change its New York Stock Exchange (NYSE) ticker symbol, and the combined company’s securities will trade under the ticker symbol “ME”.</strong></p>\n\n<p>Source: <a href=\"https://mediacenter.23andme.com/press-releases/23andme-merges-with-vgac/\">https://mediacenter.23andme.com/press-releases/23andme-merges-with-vgac/</a></p>\n</div><!-- SC_ON -->",
  "score": 133,
  "permalink": "/r/stocks/comments/lciait/23andme_to_go_public/",
  "subreddit": "stocks",
  "id": "lciait",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123200916
}