{
  "author": "bladecg",
  "the_new_excerpt": "I'm going to tell you the strategy that I used to go from 2k to 15k, and that I\nwill start using again from now on since I got down to 8k from trying to do\nstupid leverage trades and using options:\n\nStep 1: find a couple coins with good projects and fundamentals that you believe\nwill be good in the…",
  "original_created_utc": 1621752715,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が2Kから15Kになった時に使った戦略をお話しします。\nくだらないレバレッジ取引やオプションの使用で8,000円になってしまったので、これからまた使い始めます。\n愚かなレバレッジ取引やオプションの使用で8,000円になってしまったからです。\n\nステップ1：良いプロジェクトとファンダメンタルズを持ち、将来的にも良いと思われるコインをいくつか見つけます。\nステップ1：良いプロジェクトとファンダメンタルズを持つコインを2、3枚見つけて、将来的には良いものになると信じる。",
      "title": "暗号でお金を稼ぐ方法はこれだ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我将告诉你我用来从2千到15千的策略，并且我将从现在开始再次使用这个策略。\n我将从现在开始再次使用这个策略，因为我因为试图做愚蠢的杠杆交易和使用期权而降到了8K。\n愚蠢的杠杆交易和使用期权。\n\n第1步：找到几个具有良好项目和基本面的硬币，你相信\n将会是好的。",
      "title": "这就是你如何利用加密货币赚钱的方法"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我將告訴你我用來從2千到15千的策略，並且我將從現在開始再次使用這個策略。\n我將從現在開始再次使用這個策略，因爲我因爲試圖做愚蠢的槓桿交易和使用期權而降到了8K。\n愚蠢的槓桿交易和使用期權。\n\n第1步：找到幾個具有良好項目和基本面的硬幣，你相信\n將會是好的。",
      "title": "這就是你如何利用加密貨幣賺錢的方法"
    }
  ],
  "title": "This is how you make money with crypto",
  "created_utc": 1621773826,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m going to tell you the strategy that I used to go from 2k to 15k, and that I will start using again from now on since I got down to 8k from trying to do stupid leverage trades and using options:</p>\n\n<p>Step 1: find a couple coins with good projects and fundamentals that you believe will be good in the furute, mines are ETH, DOT, MATIC, and SOL.</p>\n\n<p>Step 2: send them to a wallet, write down the seed phrase in a piece of paper an store it somewhere safe.</p>\n\n<p>Step 3: delete whatever trading app/website you are using, unsubscribe from al crypto news, forums and whatever, just cut all your connections with crypto and don&#39;t even look at the market.</p>\n\n<p>Step 4: live happily for a couple years without worrying about your crypto or looking at them, do shit, have fun.</p>\n\n<p>Step 5: after a couple years check how rich you are now and buy whatever the fuck you want.</p>\n\n<p>You are welcome!</p>\n</div><!-- SC_ON -->",
  "score": 17456,
  "permalink": "/r/CryptoCurrency/comments/nj234l/this_is_how_you_make_money_with_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "nj234l",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197385266
}