{
  "author": "Snowchill",
  "original_created_utc": 1645019463,
  "title": "Were there any Byzantine folklore creatures/monsters?",
  "created_utc": 1645048577,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In ancient Greece, there were tons of creatures like harpies, sirens, erinyes, cyclopes, etc. Did this tradition continue in Byzantium? Were there myths and stories involving monsters? If yes, were these monsters new or did the people reuse ancient mythological creatures?&lt;/p&gt;\n\n&lt;p&gt;The only instance of a monster I&amp;#39;ve read about in Byzantine times was a story about an emperor (I think Constantine V?) who rebuilt the aqueduct to Constantinople, and supposedly defeated a dragon to do so.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/stwdos/were_there_any_byzantine_folklore/",
  "subreddit": "AskHistorians",
  "id": "stwdos",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In ancient Greece, there were tons of creatures like harpies, sirens, erinyes,\ncyclopes, etc. Did this tradition continue in Byzantium? Were there myths and\nstories involving monsters? If yes, were these monsters new or did the people\nreuse ancient mythological creatures?\n\nThe only instance of a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "古代ギリシャには、ハーピー、セイレーン、エリニュスなど、たくさんの生き物がいました。\nサイクロプスなど この伝統はビザンティウムでも続いていたのでしょうか？神話と\nモンスターが登場する物語？もしそうなら、これらのモンスターは新しいものなのか、それとも人々は\n古代の神話に登場する生き物を再利用しているのでしょうか？\n\n唯一の例は、...",
      "title": "ビザンチンの民話に登場する生き物やモンスターはいましたか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在古希腊，有大量的生物，如女妖、海妖、Erinyes。\ncyclopes等等。这种传统在拜占庭继续吗？是否有涉及怪物的神话和\n有涉及怪物的神话和故事吗？如果有，这些怪物是新的还是人们\n重新使用古代神话中的生物？\n\n唯一的例子是...",
      "title": "是否有任何拜占庭的民间传说中的生物/怪物？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在古希臘，有大量的生物，如女妖、海妖、Erinyes。\ncyclopes等等。這種傳統在拜占庭繼續嗎？是否有涉及怪物的神話和\n有涉及怪物的神話和故事嗎？如果有，這些怪物是新的還是人們\n重新使用古代神話中的生物？\n\n唯一的例子是...",
      "title": "是否有任何拜占庭的民間傳說中的生物/怪物？"
    }
  ]
}