{
  "author": "ShounenSuki",
  "original_created_utc": 1642260059,
  "title": "Anna of Saxony was declared insane and walled into a room, where she died. To what extent was this William the Silent's doing?",
  "created_utc": 1642301076,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I was taught that William the Silent had his second wife Anna of Saxony declared insane and walled into a room as a means to get rid of her. However, when I tried to do some research into this, I found some sources saying it was her uncle August of Saxony who had her imprisoned.&lt;/p&gt;\n\n&lt;p&gt;Exactly what happened to Anna and how much was William to blame? Also, are there any clue as to what William thought of the whole ordeal? I know their marriage was apparently an unhappy one and Anna supposedly had an affair, but her being declared insane and walled in seems a bit crass, even for the 16th century.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/s4miqg/anna_of_saxony_was_declared_insane_and_walled/",
  "subreddit": "AskHistorians",
  "id": "s4miqg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I was taught that William the Silent had his second wife Anna of Saxony declared\ninsane and walled into a room as a means to get rid of her. However, when I\ntried to do some research into this, I found some sources saying it was her\nuncle August of Saxony who had her imprisoned.\n\nExactly what…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、沈黙のウィリアムは、2番目の妻アンナ・オブ・ザクセン（Anna of Saxony）を宣告させたと教えられました。\n精神異常をきたし、部屋に閉じ込めた。しかし、私が\nこのことについて調べようとしたところ、いくつかの資料で、彼女の仕業であると書かれていました。\n叔父のザクセン公アウグストが彼女を幽閉したのです。\n\n正確には...",
      "title": "アンナ・ド・ザクセン（Anna of Saxony）は精神異常とされ、部屋に閉じ込められ、そこで死んだ。これはどこまでがウィリアム1世の仕業なのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我被告知，沉默的威廉让他的第二任妻子萨克森的安娜被宣布为精神病患者，并被关在一个房间里，以摆脱她。\n疯了，并被关进一个房间，作为摆脱她的一种手段。然而，当我\n我试图对此做一些研究，我发现一些资料说是她的叔叔萨克森的奥古斯特把她关起来的。\n叔叔萨克森的奥古斯特把她关进了监狱。\n\n究竟是什么...",
      "title": "萨克森的安娜被宣布为精神病患者，并被关进一个房间，她在那里死去。这在多大程度上是沉默的威廉所为？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我被告知，沉默的威廉讓他的第二任妻子薩克森的安娜被宣佈爲精神病患者，並被關在一個房間裏，以擺脫她。\n瘋了，並被關進一個房間，作爲擺脫她的一種手段。然而，當我\n我試圖對此做一些研究，我發現一些資料說是她的叔叔薩克森的奧古斯特把她關起來的。\n叔叔薩克森的奧古斯特把她關進了監獄。\n\n究竟是什麼...",
      "title": "薩克森的安娜被宣佈爲精神病患者，並被關進一個房間，她在那裏死去。這在多大程度上是沉默的威廉所爲？"
    }
  ]
}