{
  "author": "thejazzmaster69",
  "original_created_utc": 1637336626,
  "title": "My bank is charming me way to much. They have asked me to cease any crypto activity and sell my tokkens.",
  "created_utc": 1637343147,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m fuckin tired of my bank.</p>\n\n<p>I&#39;m a international student in France. On my first day on campus I meet a salesman from the BNP Paribas who offered me a student account for 0 fees.  I needed a french account so I took it.</p>\n\n<p>I&#39;ve been using it for 3 years but now I&#39;m fucking tired of them. They are charging me 21€ per month because I&#39;m already working (not really a job but an internship that pays 650$). </p>\n\n<p>The worst is that they contacted me because I&#39;m expending MY MONEY on crypto which is a &quot;bad investment expecially for students&quot;. They told be that I should suspended activities related to crypto and that I should sell my crypto and put it back into my account.</p>\n\n<p>Like What the flying FUCK ? Who the fuck they thing they are to force me to stop investing in crypto.</p>\n\n<p>What can I do ? </p>\n\n<p>I&#39;m thinking in doing a rugpull on them and close my account. \nI&#39;m also thinking of using the debit cards from Crypto .com for all my expenses. It&#39;s possible to do this or is this stupid ? </p>\n\n<p>Sorry for the rant but I&#39;m just frustrated. Have any body ever drop the use of banks ?</p>\n\n<p>I know &quot;Not your keys not your crypto&quot; and &quot;don&#39;t pull all your eggs in one basket&quot;.</p>\n\n<p>PS: I&#39;m using Crypto . Com and CoinBase.</p>\n\n<p>Edit : Wow thanks for the replies. It&#39;s awesome to get feedback from other cryptonauts. It don&#39;t really have a lot of people which who I can discuss about banks and crypto.\nThanks for the rewards. I feel so flattered that people share them with me (I don&#39;t even know what can I do with then, lol). It&#39;s not necessary to give me awards just by knowing that people share their 2 Satoshis with me it&#39;s already enough.</p>\n</div><!-- SC_ON -->",
  "score": 347,
  "permalink": "/r/CryptoCurrency/comments/qxiwjb/my_bank_is_charming_me_way_to_much_they_have/",
  "subreddit": "CryptoCurrency",
  "id": "qxiwjb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm fuckin tired of my bank.\n\nI'm a international student in France. On my first day on campus I meet a\nsalesman from the BNP Paribas who offered me a student account for 0 fees. I\nneeded a french account so I took it.\n\nI've been using it for 3 years but now I'm fucking tired of them. They…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は銀行にうんざりしています。\n\n私はフランスの国際学生です。キャンパスに来た初日に、BNPパリバの営業マンに出会いました。\nBNPパリバの営業マンに出会い、手数料0円の学生口座を勧められました。I\nフランスの口座が必要だったので、それを利用しました。\n\n3年間使用してきましたが、もう彼らにはうんざりです。彼らは...",
      "title": "私の銀行は私を魅了しすぎている。彼らは私に暗号活動を中止し、トークンを売却するよう求めてきました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我他妈的厌倦了我的银行。\n\n我是一个在法国的国际学生。在我进入校园的第一天，我遇到了一个\n法国巴黎银行的业务员，他给我提供了一个零费用的学生账户。I\n我需要一个法国账户，所以我接受了它。\n\n我已经用了3年，但现在我已经他妈的厌倦了他们。他们...",
      "title": "我的银行对我的魅力太大了。他们已经要求我停止任何加密货币活动，并出售我的代币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我他媽的厭倦了我的銀行。\n\n我是一個在法國的國際學生。在我進入校園的第一天，我遇到了一個\n法國巴黎銀行的業務員，他給我提供了一個零費用的學生賬戶。I\n我需要一個法國賬戶，所以我接受了它。\n\n我已經用了3年，但現在我已經他媽的厭倦了他們。他們...",
      "title": "我的銀行對我的魅力太大了。他們已經要求我停止任何加密貨幣活動，並出售我的代幣。"
    }
  ]
}