{
  "author": "Zooasaurus",
  "original_created_utc": 1651067582,
  "title": "In the Ottoman Empire, there were rulings for or against human marriage with jinns. Were there similar rulings in early modern Japan regarding human marriage with youkais?",
  "created_utc": 1651089539,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;One very famous example of the Ottoman case is of Khalil al-Sarmini, whose marriage to a female jinn was tacitly approved by the Shafi&amp;#39;i mufti of Aleppo. Considering the folklore surrounding youkai and them being able to marry and breed with humans, were there similar cases happening in early modern Japan?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/ud43th/in_the_ottoman_empire_there_were_rulings_for_or/",
  "subreddit": "AskHistorians",
  "id": "ud43th",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "One very famous example of the Ottoman case is of Khalil al-Sarmini, whose\nmarriage to a female jinn was tacitly approved by the Shafi'i mufti of Aleppo.\nConsidering the folklore surrounding youkai and them being able to marry and\nbreed with humans, were there similar cases happening in early…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "オスマントルコの事例で非常に有名なのは、カリル・アル・サルミニの例である。\nアレッポのシャフィー・ムフティーが女性のジンとの結婚を黙認していた。\n妖怪にまつわる民間伝承や、妖怪が人間と結婚・交配できることを考慮すると\n妖怪にまつわる民間伝承や、妖怪が人間と結婚・繁殖することを考えると、同じような事例が初期にあったのだろうか？",
      "title": "オスマン帝国では、人間とジンの結婚に賛成、反対の裁定があった。近世の日本では、妖怪との結婚にも同様の規定があったのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "奥斯曼帝国的一个非常著名的例子是哈利勒-萨米尼，他的\n他与一个女精灵的婚姻得到了阿勒颇的沙菲伊穆夫提的默许。\n考虑到围绕鬼魂的民间传说，以及他们能够与人类结婚和繁殖，是否有类似的情况？\n他们能够与人类结婚和繁殖，是否有类似的情况发生在早期...",
      "title": "在奥斯曼帝国，有支持或反对人类与金人结婚的裁决。在现代早期的日本，对于人类与尤凯斯的婚姻是否有类似的裁决？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "奧斯曼帝國的一個非常著名的例子是哈利勒-薩米尼，他的\n他與一個女精靈的婚姻得到了阿勒頗的沙菲伊穆夫提的默許。\n考慮到圍繞鬼魂的民間傳說，以及他們能夠與人類結婚和繁殖，是否有類似的情況？\n他們能夠與人類結婚和繁殖，是否有類似的情況發生在早期...",
      "title": "在奧斯曼帝國，有支持或反對人類與金人結婚的裁決。在現代早期的日本，對於人類與尤凱斯的婚姻是否有類似的裁決？"
    }
  ]
}