{
  "author": "smithgeek",
  "original_created_utc": 1660528578,
  "title": "I made a freelance rate calculator",
  "created_utc": 1660610623,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I made a calculator to try and help freelancers figure out what they&amp;#39;re hourly rate should be if you&amp;#39;re thinking in terms of a salaried job.  I was doing some analysis on freelancing rates and decided to turn a spreadsheet I had into a simple rate calculator that others can use. No tracking, no ads, no backend harvesting data, etc. All the values are stored in the url so you can bookmark or share your rates if you want. &lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://ratecalculator.smithgeek.com\"&gt;ratecalculator.smithgeek.com&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 5,
  "permalink": "/r/SideProject/comments/won341/i_made_a_freelance_rate_calculator/",
  "subreddit": "SideProject",
  "id": "won341",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I made a calculator to try and help freelancers figure out what they're hourly\nrate should be if you're thinking in terms of a salaried job. I was doing some\nanalysis on freelancing rates and decided to turn a spreadsheet I had into a\nsimple rate calculator that others can use. No tracking, no ads,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "フリーランサーが自分の時給を把握するのに役立つ計算機を作ってみた\nフリーランスの方がサラリーマンとして働く場合の時給を計算できるようにしました。私はいくつかの\nフリーランスの料金について分析し、私が持っているスプレッドシートを他の人が使えるように\nシンプルな料金計算機にすることにしました。トラッキングも広告もなし、...",
      "title": "フリーランス料金計算機を作ってみた"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我做了一个计算器，试图帮助自由职业者算出他们的时薪。\n如果你考虑的是受薪工作，那么时薪应该是多少。我在做一些\n我在做一些关于自由职业者费率的分析，并决定把我的电子表格变成一个\n简单的费率计算器，供其他人使用。没有跟踪，没有广告，...",
      "title": "我做了一个自由职业者比率计算器"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我做了一個計算器，試圖幫助自由職業者算出他們的時薪。\n如果你考慮的是受薪工作，那麼時薪應該是多少。我在做一些\n我在做一些關於自由職業者費率的分析，並決定把我的電子表格變成一個\n簡單的費率計算器，供其他人使用。沒有跟蹤，沒有廣告，...",
      "title": "我做了一個自由職業者比率計算器"
    }
  ]
}