{
  "author": "proph3tsix",
  "original_created_utc": 1650290759,
  "title": "Why when Ted Cruz says, \"I like btc because the government can't control it\" does this community express irritation?",
  "created_utc": 1650310336,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I mean, I&amp;#39;ve been in the space for years, and I&amp;#39;ve seen a huge number of posts expressing a similar sentiment. i.e. &amp;quot;This is why we bitcoin&amp;quot;, videos showing incompetent politicians relishing their control of the money supply, or plebs like me who are devastated by their government&amp;#39;s wealth confiscation.&lt;/p&gt;\n\n&lt;p&gt;But when TED CRUZ basically says the same thing, the crypto community says he has an ulterior motive, or they worry aloud about how this transformative technology (whose original mission statement was to separate money from State) is, heaven forbid, becoming political.&lt;/p&gt;\n\n&lt;p&gt;If this community is this irritated by little ol&amp;#39; Ted Cruz, then I&amp;#39;m afraid our sense of cohesion is in for a real bumpy ride ahead...&lt;/p&gt;\n\n&lt;p&gt;[edit: As a rule, given any two parties with opinions regarding wealth redistribution, one should always expect the one who is least supportive to be the first to embrace a confiscation resistant technology like Bitcoin. So, in America, you should expect the Libertarians to support it first, followed by the Right, and eventually parts of the Left.]&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 409,
  "permalink": "/r/CryptoCurrency/comments/u6dzd2/why_when_ted_cruz_says_i_like_btc_because_the/",
  "subreddit": "CryptoCurrency",
  "id": "u6dzd2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I mean, I've been in the space for years, and I've seen a huge number of posts\nexpressing a similar sentiment. i.e. \"This is why we bitcoin\", videos showing\nincompetent politicians relishing their control of the money supply, or plebs\nlike me who are devastated by their government's wealth…"
}