{
  "author": "overmind87",
  "original_created_utc": 1637617514,
  "title": "Why haven't I heard of anyone vandalizing the homes of the ultra rich?",
  "created_utc": 1637635248,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This isn&#39;t a call to arms or whatever.  It&#39;s more of a curiosity than anything.  But I get the feeling I&#39;m going to end up in a government list if I ask...</p>\n\n<p>Anyway, with all the massive protests that have happened the last few years here in the US, all the rioting and vandalism (justified or not), I&#39;m surprised I haven&#39;t heard of, for example, someone throwing Molotov cocktails  at Jeff Bessos&#39; mansion.  Or covering the outside walls of Mark Zuckerberg&#39;s house with obscene graffiti.  Not that I condone it.  But I find it interesting that the people who were out protesting, and who are the same type of people who says things like &quot;eat the rich&quot;, are not out there blocking intersections in order to keep the super wealthy trapped  in their homes.</p>\n\n<p>We&#39;ve known for ages that most of the issues in this country stem from wealth inequality.  But I don&#39;t see anyone protesting for that.  Or maybe they are and I just don&#39;t watch the news enough?  I don&#39;t know.  But as a fairly liberal person, but not the type to go to demonstrations, it kinda sucks to say but I&#39;m starting to think that people were only going to demonstrations because it was trendy.  I get the feeling that many of them were just doing it to get views and followers, but couldn&#39;t give a shit what, or for whom, the demonstrations were for.  That&#39;s a very depressing thought.</p>\n\n<p>Because if that&#39;s the case, if most people  are pursuing activism mostly for social media brownie points, then why even bother to care about the state of our society?  because if the people that supposedly care enough to do something about it aren&#39;t doing anything that doesn&#39;t fit their individual goals, then we are already <del>dead</del> permanently fucked.  I&#39;m not sure yet how much I want to engage with anyone in this post.  Mostly because I feel that If I do, all people are going to say is why aren&#39;t I doing anything about it? I have my reasons. Mainly illness and not wanting to get even more jaded. But I&#39;m still interested in hearing different people&#39;s perspectives.  That&#39;s why I come here.</p>\n\n<p>EDIT 1: for the people claiming that they are protected by walls and security systems, you must have not heard of protestors literally vandalizing the police stations themselves.  And to the person that said they are too far away, I know people who flew across the country to go to Portland and take part in what was going on there.</p>\n\n<p>EDIT THE SECOND: Ok, many people seem to be missing the point, so maybe I did a bad job explaining it.  When I ask why aren&#39;t there people protesting wealth inequality outside the homes of the super rich, I don&#39;t mean 3 or 4 people.  I mean why aren&#39;t groups of thousands of people showing up at one place to protest?\nI keep hearing &quot;they are scared of the police/getting sued&quot;.  But if that&#39;s the case, why?  why weren&#39;t they scared of the police last year when they were LITERALLY PROTESTING AGAINST THE POLICE? why weren&#39;t they scared of being sued then but are scared now? that&#39;s what I want to know.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/qzwr2e/why_havent_i_heard_of_anyone_vandalizing_the/",
  "subreddit": "TooAfraidToAsk",
  "id": "qzwr2e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This isn't a call to arms or whatever. It's more of a curiosity than anything.\nBut I get the feeling I'm going to end up in a government list if I ask...\n\nAnyway, with all the massive protests that have happened the last few years here\nin the US, all the rioting and vandalism (justified or not), I'm…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは、呼びかけとかではありません。何よりも興味があるんだ。\nでも、聞いてしまうと政府のリストに載ってしまいそうな気がして...。\n\nとにかく、ここ数年で起こった大規模な抗議行動で\n暴動や破壊行為（正当化されているかどうかは別にして）が起きていますが、私は...",
      "title": "超金持ちの家を破壊したという話を聞いたことがないのはなぜだろう？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这并不是号召大家拿起武器或其他什么。它更像是一种好奇心，而不是什么。\n但我有种感觉，如果我问的话，我就会被列入政府名单......\n\n总之，在过去的几年里，美国发生了大量的抗议活动。\n在美国，所有的骚乱和破坏行为（无论是否有道理），我...",
      "title": "为什么我没有听说有人破坏超级富豪的家？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這並不是號召大家拿起武器或其他什麼。它更像是一種好奇心，而不是什麼。\n但我有種感覺，如果我問的話，我就會被列入政府名單......\n\n總之，在過去的幾年裏，美國發生了大量的抗議活動。\n在美國，所有的騷亂和破壞行爲（無論是否有道理），我...",
      "title": "爲什麼我沒有聽說有人破壞超級富豪的家？"
    }
  ]
}