{
  "author": "CaptnPilot",
  "original_created_utc": 1628223948,
  "title": "Last year I almost bought iPhone 11 Pro Max. Instead I bought Note 10 Lite and invested $700 in crypto. Now I can buy 3 Iphone 12's lmao don't buy stupid shit.",
  "created_utc": 1628235046,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Pretty much the title. iPhone 7 broke, which actually lasted me a long time and was a good phone. Something with the charging port fucked up and decided it was time to upgrade. Looked an at iPhone 11 but it was so god damn much money. So I decided to try Samsung out and bought one of the cheaper models. This phone has actually been amazing, and only for like $300. I took the rest of the money and invested in crypto. Now I can buy 3 iPhone 12&#39;s if I wanted to.   </p>\n\n<p>Don&#39;t buy stupid shit. Just buy what you need and invest the rest. </p>\n\n<p>Too the moon boys.</p>\n</div><!-- SC_ON -->",
  "score": 229,
  "permalink": "/r/CryptoCurrency/comments/oyzgs4/last_year_i_almost_bought_iphone_11_pro_max/",
  "subreddit": "CryptoCurrency",
  "id": "oyzgs4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Pretty much the title. iPhone 7 broke, which actually lasted me a long time and\nwas a good phone. Something with the charging port fucked up and decided it was\ntime to upgrade. Looked an at iPhone 11 but it was so god damn much money. So I\ndecided to try Samsung out and bought one of the cheaper…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルの通りです。 iPhone7が壊れてしまいましたが、実際には長く使えましたし\n良い電話でした。充電ポートの調子が悪くなったので、アップグレードすることにしました。\nアップグレードすることにしました。iPhone 11を検討しましたが、とても高価なものでした。そこで私は\nサムスンを試してみることにして、安いのを買いました。",
      "title": "昨年は、iPhone 11 Pro Maxをほぼ購入しました。代わりにNote 10 Liteを購入し、700ドルを暗号に投資しました。今ではiPhone 12を3台買えるようになりました lmao Don't buy stupid shit."
    },
    {
      "locale": "zh",
      "the_new_excerpt": "几乎是这个标题。 iPhone 7坏了，实际上我用了很长时间，是一部好手机。\n是个好手机。充电端口出了点问题，于是决定是时候升级了。\n是时候升级了。我看了看iPhone 11，但它太他妈多钱了。所以我\n决定试试三星，买了一个比较便宜的...",
      "title": "去年，我几乎买了iPhone 11 Pro Max。相反，我买了Note 10 Lite并投资了700美元的加密货币。现在我可以买3部Iphone 12了，笑死我了，别买傻逼。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "幾乎是這個標題。 iPhone 7壞了，實際上我用了很長時間，是一部好手機。\n是個好手機。充電端口出了點問題，於是決定是時候升級了。\n是時候升級了。我看了看iPhone 11，但它太他媽多錢了。所以我\n決定試試三星，買了一個比較便宜的...",
      "title": "去年，我幾乎買了iPhone 11 Pro Max。相反，我買了Note 10 Lite並投資了700美元的加密貨幣。現在我可以買3部Iphone 12了，笑死我了，別買傻逼。"
    }
  ]
}