{
  "author": "Frigorifico",
  "original_created_utc": 1637474931,
  "title": "Al-Ma'arri was an arab philosopher from the golden age of Islam who became an atheist and published several books criticising religion. Was, if any, was the impact on his work?",
  "created_utc": 1637495891,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Oddly enough Al-Ma&#39;arri doesn&#39;t have a wikipedia article in english, but he does have articles in spanish and german and that&#39;s how I learned about him</p>\n\n<p>I was very surprised to see that was able to publish texts attacking religion in the Abassid Empire, but I guess they were a lot more tolerant than muslim nations today</p>\n\n<p>However what I really want to know is what was the impact of his work?. I imagine that maybe he was like Giordano Bruno or Democritus, someone whose genius we can recognize in the present day but who wasn&#39;t very impactful on his day. Or maybe he was impactful, I don&#39;t know</p>\n\n<p>PD: I want to check out his book Fusul wa Ghayat, but I can&#39;t find it anywhere in a language I can read, does anyone have a link to an english online version?</p>\n</div><!-- SC_ON -->",
  "score": 116,
  "permalink": "/r/AskHistorians/comments/qyonde/almaarri_was_an_arab_philosopher_from_the_golden/",
  "subreddit": "AskHistorians",
  "id": "qyonde",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Oddly enough Al-Ma'arri doesn't have a wikipedia article in english, but he does\nhave articles in spanish and german and that's how I learned about him\n\nI was very surprised to see that was able to publish texts attacking religion in\nthe Abassid Empire, but I guess they were a lot more tolerant than…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "奇妙なことに、アルマーリには英語のウィキペディアの記事はありませんが、スペイン語とドイツ語の記事はあります。\nスペイン語とドイツ語の記事があり、私はそれで彼のことを知りました。\n\nアッバース帝国で宗教を攻撃する文章を発表できたことにはとても驚きました。\nアッバース朝で宗教を攻撃する文章を出版できたことにはとても驚きましたが、彼らは...よりもずっと寛容だったのでしょうね。",
      "title": "アル＝マーリーは、イスラム教の黄金時代に活躍したアラブの哲学者で、無神論者となり、宗教を批判するいくつかの著書を発表しました。彼の作品に影響があったとすれば、それはどのようなものだったのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "奇怪的是，Al-Ma'arri在维基百科上没有英文文章，但他有\n有西班牙文和德文的文章，这就是我了解他的原因。\n\n我非常惊讶地看到，他能够在阿巴斯帝国出版攻击宗教的文本。\n我非常惊讶地看到，在阿巴斯德帝国能够发表攻击宗教的文本，但我想他们比......要宽容得多。",
      "title": "Al-Ma'arri是伊斯兰教黄金时代的一位阿拉伯哲学家，他成为无神论者，并出版了几本批评宗教的书。如果有的话，对他的工作有什么影响吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "奇怪的是，Al-Ma'arri在維基百科上沒有英文文章，但他有\n有西班牙文和德文的文章，這就是我瞭解他的原因。\n\n我非常驚訝地看到，他能夠在阿巴斯帝國出版攻擊宗教的文本。\n我非常驚訝地看到，在阿巴斯德帝國能夠發表攻擊宗教的文本，但我想他們比......要寬容得多。",
      "title": "Al-Ma'arri是伊斯蘭教黃金時代的一位阿拉伯哲學家，他成爲無神論者，並出版了幾本批評宗教的書。如果有的話，對他的工作有什麼影響嗎？"
    }
  ]
}