{
  "author": "Mr_bike",
  "original_created_utc": 1644716228,
  "title": "The Super Bowl is not gonna affect the price tomorrow, next week, or next super bowl.",
  "created_utc": 1644730853,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A top post is just pure &amp;#39;trust me bro&amp;#39; hopium hypenomics at work with a a title to entice. Here&amp;#39;s a fact for you all, viewership of the superbowl has been consistently going down for more than a decade since 2010. So less people are watching the game in general. About half of those people are just there for the ads and a majority of them are gonna be sharing the ads on Facebook, a social media platform that didn&amp;#39;t grow last period and has an aging userbase to boot. So less people and mostly older that aren&amp;#39;t gonna take financial risk are watching. I doubt Auntie BJ is gonna invest in crypto because Tom Brady told them about FTX. I can see my brother who uses facebook and has no teeth left seeing the ad and wanting to FOMO in. So that&amp;#39;s the audience they&amp;#39;re mainly getting.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s also just Americans. No one in Europe is gonna be watching the game and or gives a shit about Tom Brady. No one in Brazil is gonna be watching. Americans are not the only people invested in crypto, most South Koreans have no idea how American football works or again, gives a shit about ads that they wouldn&amp;#39;t understand without subtitles and who is gonna be writing subtitles for ads for an American sporting event outside of Spanish and English?&lt;/p&gt;\n\n&lt;p&gt;Lastly, why would the news care about a crypto ad? Do you expect an interview with Tom Brady breaking it down his involvement and a full history on the past year of crypto? I&amp;#39;ll bet they will talk about how much is spent on the ads this year and how much FTX grew and paid Tom Brady and then move on with their day.&lt;/p&gt;\n\n&lt;p&gt;This idea that a single ad during an American sporting event is gonna put us into a bull run is just silly. This is Saturday Night Live or Doge day again. There&amp;#39;s no reason to think prices will go up except for hope. But they wanna cover their tracks and say it&amp;#39;ll affect the prices in future. Okay, I drank coffee this morning and so the prices will go back up &amp;#39;someday&amp;#39;, that&amp;#39;s my prediction based on nothing substantial.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 319,
  "permalink": "/r/CryptoCurrency/comments/sr6tz4/the_super_bowl_is_not_gonna_affect_the_price/",
  "subreddit": "CryptoCurrency",
  "id": "sr6tz4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "A top post is just pure 'trust me bro' hopium hypenomics at work with a a title\nto entice. Here's a fact for you all, viewership of the superbowl has been\nconsistently going down for more than a decade since 2010. So less people are\nwatching the game in general. About half of those people are just…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "トップポストとは、純粋に「私を信じてください」というホピウム・ハイペノミクスの働きで、タイトルは\nを誘う。スーパーボールの視聴率はずっと低下しています。\n2010年以降、10年以上一貫して下がり続けています。つまり、人が減っているのです。\n一般的にゲームを見る。そのうちの約半数は、まさに",
      "title": "スーパーボウルが明日、来週、次のスーパーボウルの価格に影響を与えることはないだろう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "顶尖的帖子只是纯粹的 \"相信我的兄弟 \"的希望，在工作中用一个标题\n来引诱。这里有一个事实，超级杯的收视率已经\n自2010年以来的十多年里一直在下降。因此，更少的人在\n看比赛的人普遍减少。这些人中大约有一半是...",
      "title": "超级碗不会影响明天、下周或下一个超级碗的价格。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "頂尖的帖子只是純粹的 \"相信我的兄弟 \"的希望，在工作中用一個標題\n來引誘。這裏有一個事實，超級盃的收視率已經\n自2010年以來的十多年裏一直在下降。因此，更少的人在\n看比賽的人普遍減少。這些人中大約有一半是...",
      "title": "超級碗不會影響明天、下週或下一個超級碗的價格。"
    }
  ]
}