{
  "author": "monamikonami",
  "original_created_utc": 1628317486,
  "title": "If you fall for a scam from a message in your Reddit inbox then you are dumb",
  "created_utc": 1628346720,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>All these “warning” posts about how to identify the “top” crypto scams on here are annoying me to no end. If you need someone to tell you that you should not respond (or give your personal financial info) to these scammer idiots, then you are beyond help. For two reasons:</p>\n\n<ol>\n<li><p>The scammers on here are the most blatant and un-creative scammers I’ve ever seen. They write like 12 year-olds and they promise you 5x return on your crypto investment. If you fall for that then you are dumb.</p></li>\n<li><p>Why would you EVER trust a stranger who writes you out of the blue asking about your money? Did your parents completely fail at raising you? If you accept candy from strangers, you are dumb.</p></li>\n</ol>\n\n<p>If the person PMing you is not asking you for pics of your dick or tits, or is not arguing with you about some comment you made, then it’s a scam. Have you never been on the internet before?</p>\n\n<p>I feel no sympathy for anyone who falls for a scam on this sub.</p>\n</div><!-- SC_ON -->",
  "score": 159,
  "permalink": "/r/CryptoCurrency/comments/ozo4pw/if_you_fall_for_a_scam_from_a_message_in_your/",
  "subreddit": "CryptoCurrency",
  "id": "ozo4pw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "All these “warning” posts about how to identify the “top” crypto scams on here\nare annoying me to no end. If you need someone to tell you that you should not\nrespond (or give your personal financial info) to these scammer idiots, then you\nare beyond help. For two reasons:\n\n 1. The scammers on here…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサイトでは、「トップ」の暗号詐欺を見分ける方法についての「警告」記事ばかりで\n私を悩ませています。もし誰かに「やめたほうがいい」と言われたいのであれば\nこのような詐欺師のバカに反応してはいけない（個人的な財務情報を提供してはいけない）と誰かに言われたいのであれば、それはもう救いようがありません。\n助けることはできません。理由は2つあります。\n\n 1. ここにいる詐欺師たちは...",
      "title": "もしあなたがRedditの受信箱に入っているメッセージから詐欺に引っかかったら、あなたは馬鹿です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所有这些关于如何识别这里的 \"顶级 \"加密货币骗局的 \"警告 \"帖子\n这让我非常恼火。如果你需要有人告诉你，你不应该\n响应（或提供你的个人财务信息）这些骗子的白痴，那么你\n你就无能为力了。有两个原因。\n\n 1. 这里的诈骗者...",
      "title": "如果你被Reddit收件箱中的信息骗了，那你就太笨了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所有這些關於如何識別這裏的 \"頂級 \"加密貨幣騙局的 \"警告 \"帖子\n這讓我非常惱火。如果你需要有人告訴你，你不應該\n響應（或提供你的個人財務信息）這些騙子的白癡，那麼你\n你就無能爲力了。有兩個原因。\n\n 1. 這裏的詐騙者...",
      "title": "如果你被Reddit收件箱中的信息騙了，那你就太笨了"
    }
  ]
}