{
  "author": "ogonga",
  "the_new_excerpt": "Many cryptocurrencies are decentralized, meaning they are not controlled by one\nentity, unlike a company such as Visa. The tokens are often limited, and since\nthere's no big CEO at the top controlling our ability to transfer our wealth,\nthe only person that can decide how it's used is you.\n\nAnother…",
  "original_created_utc": 1611920855,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "许多加密货币都是去中心化的，这意味着它们不受一个人控制。\n实体，不像Visa这样的公司。代币往往是有限的，由于\n最高层没有大CEO控制我们转移财富的能力。\n唯一能决定如何使用它的人是你。\n\n另一个...",
      "title": "如果像robinhood这样的单一交易实体可以限制其用户进入自由市场，那它就不是真正的自由。这就是为什么我们需要加密技术。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "許多加密貨幣都是去中心化的，這意味着它們不受一個人控制。\n實體，不像Visa這樣的公司。代幣往往是有限的，由於\n最高層沒有大CEO控制我們轉移財富的能力。\n唯一能決定如何使用它的人是你。\n\n另一個...",
      "title": "如果像robinhood這樣的單一交易實體可以限制其用戶進入自由市場，那它就不是真正的自由。這就是爲什麼我們需要加密技術。"
    }
  ],
  "title": "If a single trading entity like robinhood can restrict its users from the free market, it's not really free. This is why we need crypto.",
  "created_utc": 1611946595,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Many cryptocurrencies are decentralized, meaning they are not controlled by one entity, unlike a company such as Visa. The tokens are often limited, and since there&#39;s no big CEO at the top controlling our ability to transfer our wealth, the only person that can decide how it&#39;s used is you.</p>\n\n<p>Another benefit of decentralization is that it applies to the networks as well.</p>\n\n<p>The network is made up of nodes, so even if one node shuts down, the other nodes can still keep the network operational.</p>\n\n<p>10 years ago, the USA said we&#39;ve had enough at Occupy Wall Street, and the rich just kept laughing and watched the protests from their balconies while drinking champagne. Many of us have been silently researching in crypto and transferring wealth into it. Some of us have made it big, and others are using it as a retirement supplement.</p>\n\n<p>We can turn the tide and take back our wealth. It was being taken from us every day with shorting tactics, hedge funds, and market manipulation. We can fight back by collaborating with crypto.</p>\n</div><!-- SC_ON -->",
  "score": 264,
  "permalink": "/r/CryptoCurrency/comments/l7qmbi/if_a_single_trading_entity_like_robinhood_can/",
  "subreddit": "CryptoCurrency",
  "id": "l7qmbi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518527084
}