{
  "author": "lucinabeach10Iu",
  "the_new_excerpt": "The pandemic has changed a lot of things for good, including healthcare. Since\nthe demand for telehealth skyrocketed in 2020, it’s been a super hot sector with\nnot only a lot of investments, but a lot of new players in the arena. As I’ve\ndebated on which company to put my stake in, I’ve always had…",
  "original_created_utc": 1620418954,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "パンデミックは、医療を含む多くのものを良い方向に変えました。以来\n2020年にテレヘルスの需要が急増して以来、テレヘルスは超ホットな分野となりました。\n多くの投資が行われているだけでなく、多くの新しいプレーヤーがこの分野に参入しています。私はこれまで\nどの会社に出資しようかと悩んでいたとき、私はいつも...",
      "title": "競争が激化する遠隔医療分野"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这场大流行改变了很多事情，包括医疗保健。自从\n自从2020年对远程医疗的需求激增以来，它已经成为一个超级热门的行业，不仅有大量的投资，而且有许多新的参与者。\n不仅有大量的投资，而且有很多新的参与者在这个领域。由于我已经\n我一直在争论将我的股份投入哪家公司，我一直有...",
      "title": "远程医疗领域的竞争日趋激烈"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這場大流行改變了很多事情，包括醫療保健。自從\n自從2020年對遠程醫療的需求激增以來，它已經成爲一個超級熱門的行業，不僅有大量的投資，而且有許多新的參與者。\n不僅有大量的投資，而且有很多新的參與者在這個領域。由於我已經\n我一直在爭論將我的股份投入哪家公司，我一直有...",
      "title": "遠程醫療領域的競爭日趨激烈"
    }
  ],
  "title": "Competition is Growing in the Telehealth Sector",
  "created_utc": 1620423181,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The pandemic has changed a lot of things for good, including healthcare. Since the demand for telehealth skyrocketed in 2020, it’s been a super hot sector with not only a lot of investments, but a lot of new players in the arena. As I’ve debated on which company to put my stake in, I’ve always had an eye on Amwell. It’s consistently been under the target price since it’s IPO and I think there’s a ton of potential here.</p>\n\n<p>Fueling my logic is a recent WSJ article about how PepsiCo has switched telehealth platforms. The company stopped using Teledoc for telemedicine services and now uses LiveHealth Online, a platform connected to the company’s health plan that also happens to be powered by Amwell technology. </p>\n\n<p>I feel as though this revelation flew under the radar. If Amwell runs platforms that integrate better with company’s current health plans, it could become a serious competitor to Teledoc. Head of benefits at PepsiCo, Erik Sossa, says “Telehealth is a fantastic medium, but if it’s just late-night urgent care, it’s kind of a commodity.” This is true and I think this statement will guide the “what’s next” in the telehealth industry. With so many companies entering the market, what will set each one apart? Making it easier on employers by integrating with what already exists is a great way to gain a step-up on competitors. </p>\n\n<p>I’ll be continuing to keep a close watch on Amwell. The stock can only go up from here—and many analysts agree. Numbers look good and recent news suggests that the company is headed in a great direction. </p>\n\n<p>Article: <a href=\"https://www.wsj.com/articles/digital-health-startups-are-booming-their-customers-are-overwhelmed-11620039601\">https://www.wsj.com/articles/digital-health-startups-are-booming-their-customers-are-overwhelmed-11620039601</a></p>\n</div><!-- SC_ON -->",
  "score": 191,
  "permalink": "/r/investing/comments/n7802u/competition_is_growing_in_the_telehealth_sector/",
  "subreddit": "investing",
  "id": "n7802u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985994596
}