{
  "author": "CowAdministrative420",
  "the_new_excerpt": "Hope I don’t get downvoted to all hell, but has anyone just... not cared about\nanything covid related? Like I genuinely don’t care about the delta variant,\nmaybe because this is like the 4th variant (“the deadliest one yet”, even though\nthat was said about the Brazilian variant)\n\nI don’t care about…",
  "original_created_utc": 1624159466,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "地獄のような批判を受けないことを願っていますが、誰もが...Covid関連のことには関心がないのです。\n気にならなくなった人はいますか？私は純粋にデルタ・バリアントには興味がありません。\n多分、これが4つ目のバリエーションだからだと思います（ブラジルのバリエーションについてはそう言われていましたが、「まだ最も致命的なもの」です）。\nブラジル版でも言われていましたが）。)\n\n私が気にしないのは...",
      "title": "Covidに興味がなくなった人はいませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "希望我不会被贬得一文不值，但有没有人......不关心与Covid有关的事情？\n任何与Covid有关的东西？就像我真的不关心德尔塔变体一样。\n也许是因为这已经是第四个变种了（\"最致命的变种\"，尽管这是对巴西变种的评价。\n这句话是关于巴西变种的）。)\n\n我不关心...",
      "title": "还有人不关心Covid了吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "希望我不會被貶得一文不值，但有沒有人......不關心與Covid有關的事情？\n任何與Covid有關的東西？就像我真的不關心德爾塔變體一樣。\n也許是因爲這已經是第四個變種了（\"最致命的變種\"，儘管這是對巴西變種的評價。\n這句話是關於巴西變種的）。)\n\n我不關心...",
      "title": "還有人不關心Covid了嗎？"
    }
  ],
  "title": "Anyone else just not care about Covid anymore?",
  "created_utc": 1624168606,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hope I don’t get downvoted to all hell, but has anyone just... not cared about anything covid related? Like I genuinely don’t care about the delta variant, maybe because this is like the 4th variant (“the deadliest one yet”, even though that was said about the Brazilian variant)</p>\n\n<p>I don’t care about the unvaccinated, nor the vaccinated, nor cases, nor restrictions. Maybe it’s because I’m living in Georgia so my life has been relatively normal since November 2020. But it’s just weird seeing people <strong>still</strong> talking about covid.</p>\n\n<p>I know it’s not depression because I’m fine mentally, it’s just when people try bringing it up or when I see the topic on my social media feed, I just roll my eyes and swipe on.</p>\n\n<p>Edit: wanted to clarify my post. I’m not saying I don’t care as in “lalala the world is fine, and good, and there are no problems lalala”. No, it’s more of a “okay” “alright” “that sucks” “oh no” “I hope we can fix this” and I carry on. It may be apathetic, but it’s like the media is reporting the same thing over and over and over again.</p>\n</div><!-- SC_ON -->",
  "score": 122,
  "permalink": "/r/TooAfraidToAsk/comments/o3wh5w/anyone_else_just_not_care_about_covid_anymore/",
  "subreddit": "TooAfraidToAsk",
  "id": "o3wh5w",
  "is_self": true,
  "media": null,
  "is_video": false
}