{
  "author": "JeanBonJovi",
  "original_created_utc": 1637183245,
  "title": "Am I the only one that checks the charts far less during dips?",
  "created_utc": 1637192403,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have found that during the bull runs I&#39;m glued to the charts watching my gains but as soon as the tide turns I have zero interest and can&#39;t bear (pun not intended but welcomed) to watch my losses. </p>\n\n<p>From what I have guaged here people seem to either be glued regardless of ups or downs or they check more during bear runs.</p>\n\n<p>Even during the crabby markets over the summer I checked maybe once a day but once the markets started to take off I was refreshing throughout the day. </p>\n\n<p>Am I in the minority on this?</p>\n</div><!-- SC_ON -->",
  "score": 161,
  "permalink": "/r/CryptoCurrency/comments/qw8zss/am_i_the_only_one_that_checks_the_charts_far_less/",
  "subreddit": "CryptoCurrency",
  "id": "qw8zss",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I have found that during the bull runs I'm glued to the charts watching my gains\nbut as soon as the tide turns I have zero interest and can't bear (pun not\nintended but welcomed) to watch my losses.\n\nFrom what I have guaged here people seem to either be glued regardless of ups or\ndowns or they check…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "強気の時にはチャートに釘付けになって自分の利益を確認していますが\nしかし、潮目が変わった途端に興味がなくなり、損失を見ることに耐えられなくなります。\n意図したものではありませんが、歓迎しています）、損失を見ることに耐えられません。\n\n私がここで得た情報によると、人々は上げ下げに関係なく釘付けになっているか、あるいはチェックしているかのどちらかのようです。\nチェックしているようです。",
      "title": "ディップ時にチャートをチェックする回数が格段に減るのは私だけでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我发现，在牛市期间，我一直盯着图表看我的收益\n但一旦潮水退去，我就没有兴趣了，无法忍受（不是双关语，而是欢迎）看我的损失。\n双关语，但我欢迎）看我的损失。\n\n根据我的判断，人们似乎要么紧盯着图表，不管涨跌。\n下降，或者他们检查...",
      "title": "难道我是唯一一个在下跌期间较少查看图表的人吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我發現，在牛市期間，我一直盯着圖表看我的收益\n但一旦潮水退去，我就沒有興趣了，無法忍受（不是雙關語，而是歡迎）看我的損失。\n雙關語，但我歡迎）看我的損失。\n\n根據我的判斷，人們似乎要麼緊盯着圖表，不管漲跌。\n下降，或者他們檢查...",
      "title": "難道我是唯一一個在下跌期間較少查看圖表的人嗎？"
    }
  ]
}