{
  "author": "AxxiTheAries",
  "the_new_excerpt": "TLDR AT THE BOTTOM. SOS IS A COMPLETE SCAM, PEOPLE GETTING DUMPED ON REAL SOON.\n\nAlso check out this post for more detailed information regarding the other red\nflags\nhttps://www.reddit.com/r/StockMarket/comments/lmcvov/sos_ltd_full_dd_garbage_stock/\n\nI created this post to warn people about the…",
  "original_created_utc": 1613645226,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在底部的TLDR。SOS是一个完整的骗局，人们得到DUMPED上真正的很快。\n\n也检查出这个帖子更详细的信息，关于其他红色的。\n旗帜\nhttps://www.reddit.com/r/StockMarket/comments/lmcvov/sos_ltd_full_dd_garbage_stock/\n\n我创建这个帖子是为了警告人们... ...",
      "title": "SOS是一个骗局，这就是为什么。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在底部的TLDR。SOS是一個完整的騙局，人們得到DUMPED上真正的很快。\n\n也檢查出這個帖子更詳細的信息，關於其他紅色的。\n旗幟\nhttps://www.reddit.com/r/StockMarket/comments/lmcvov/sos_ltd_full_dd_garbage_stock/\n\n我創建這個帖子是爲了警告人們... ...",
      "title": "SOS是一個騙局，這就是爲什麼。"
    }
  ],
  "title": "$SOS IS A SCAM, HERE IS WHY.",
  "created_utc": 1613658282,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>TLDR AT THE BOTTOM. SOS IS A COMPLETE SCAM, PEOPLE GETTING DUMPED ON REAL SOON.</strong></p>\n\n<p><strong>Also check out this post for more detailed information regarding the other red flags <a href=\"https://www.reddit.com/r/StockMarket/comments/lmcvov/sos_ltd_full_dd_garbage_stock/\">https://www.reddit.com/r/StockMarket/comments/lmcvov/sos_ltd_full_dd_garbage_stock/</a></strong></p>\n\n<p>I created this post to warn people about the stock &quot;SOS Limited&quot;, ticker symbol &quot;SOS&quot; being a pump and dump, people are following each other like sheep into this complete garbage company that&#39;s essentially an empty shell.</p>\n\n<p>If you visit the company website, you&#39;ll quickly see a bunch of red flags (if you take the time to read through their news tab and check the annual reports). But the most obvious red flag is the company from which they mention buying the mining rigs from, you can find the news about at their website (<a href=\"https://service.sosyun.com/portalenglish/page/news_list_210121.html\">https://service.sosyun.com/portalenglish/page/news_list_210121.html</a>).</p>\n\n<p>The company name is &quot;HY International Group New York Inc &quot; (mentioned in above link). If you do a quick search for this company via google, you&#39;ll find their website (<a href=\"http://www.hyfth.com/\">http://www.hyfth.com/</a>). The website claims to be &quot;The world&#39;s largest mining machine matchmaker&quot;. Thats a bold claim when their website was created literally last week... that&#39;s right, LAST WEEK. You can look this up yourself with the following site (<a href=\"https://websiteage.org/\">https://websiteage.org/</a>).</p>\n\n<p>The mining website was basically created 2 weeks after the announcement from SOS, that pretty much says it all. What I think happened is that they released the mining purchase news, then noticed how their stock was gaining traction. To make it all seem legit, they create a fake mining website.</p>\n\n<p>If you compare the SOS site and the mining site, they basically have the exact same layout, even tho the mining site is supposed to be US based. They have literally cloned their website and put some mining rigs on the front page to make it seem legit. The &quot;contact us&quot; tab has a fake name (Claire Low), they added a fake phone number and a fake chineese adress just today, they even have an adress that points to trump tower ( 40 Wall St, FL2808 NewYork, NY 10005 ), great effort. Their whole news tab has articles that go back all the way to february 6th 2020, how is this even possible if the website was created last week.</p>\n\n<p>There are alot of other red flags the company signals, but i feel like this part is enough for people to feel confident about this being a scam. Get out asap.</p>\n\n<p><strong>TLDR SOS releases news about buying mining rigs from a company ( HY International Group New York Inc. ) that doesn&#39;t exist, the stock gains traction during the coming weeks and shoots up in price. They notice this and create a fake website connected to the mining company they mentioned (<a href=\"http://www.hyfth.com/\">http://www.hyfth.com/</a>). The website is cloned directly from the SOS site, with the exact same layout(even tho its supposed to be US based), except some mining rigs at the front page to make it seem legit. They even claim to be &quot;The world&#39;s largest mining machine matchmaker&quot; while being created 2 weeks ago. I repeat, the website was created 2 WEEKS AGO.</strong></p>\n\n<p><strong>The original adress points to trump tower. The phone number and the chineese adress were added today. The site has articles that date back to 2020, even tho the website was just created 2 weeks ago. Get out before it dumps.</strong></p>\n</div><!-- SC_ON -->",
  "score": 97,
  "permalink": "/r/stocks/comments/lmk0nn/sos_is_a_scam_here_is_why/",
  "subreddit": "stocks",
  "id": "lmk0nn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332883616
}