{
  "author": "oxy-mo",
  "original_created_utc": 1627709058,
  "title": "I gambled with shitcoins and lost. Hold bitcoin",
  "created_utc": 1627734954,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi everyone, I&#39;ve recently messed up and had to get off my chest. During the bear run I hit the shitcoins and started seeing some big wins (rarely cashing out). This led to me swapping my bitcoin portfolio and through a series of bad trades watching it slowly bleed down..last night I couldn&#39;t take it anymore, I firmly believe had I held my shitcoins I would&#39;ve made it back however it was the constant chart checking and stress I couldn&#39;t handle anymore.</p>\n\n<p>It was gambling. Starting at green candles and freaking out at reds. Enough was enough last night when I was sat in the cinema unable to enjoy a film because if seen one of my coins not perform as well as it did the day prior. That was it for me. If I can&#39;t sit and enjoy a film (albeit it jungle cruise) then what&#39;s the point in chasing money.</p>\n\n<p>I bought back into bitcoin with a 70% loss. \nJust a warning for anyone else, I know I&#39;m preaching to the choir hear but there maybe someone in the same situation,. current glued to their phone screen chasing that x100</p>\n</div><!-- SC_ON -->",
  "score": 169,
  "permalink": "/r/Bitcoin/comments/ov1glc/i_gambled_with_shitcoins_and_lost_hold_bitcoin/",
  "subreddit": "Bitcoin",
  "id": "ov1glc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi everyone, I've recently messed up and had to get off my chest. During the\nbear run I hit the shitcoins and started seeing some big wins (rarely cashing\nout). This led to me swapping my bitcoin portfolio and through a series of bad\ntrades watching it slowly bleed down..last night I couldn't take…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。私は最近、混乱していて、胸の内を明かさなければなりませんでした。ベアランの時期に\n私はベアランの間にシットコインをヒットし、いくつかの大きな勝利を見始めました（ほとんどキャッシュアウトしていません）。\n滅多にキャッシュアウトしない）。) これがきっかけで、ビットコインのポートフォリオを入れ替え、一連の悪い取引を経て\n昨晩は耐えられませんでした。",
      "title": "クソコインでギャンブルして負けた。ビットコインを持つ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好，我最近乱了阵脚，不得不吐露心声。在\n在熊市运行期间，我打了狗屎币，并开始看到一些大的胜利（很少兑现\n出）。) 这导致我换掉了我的比特币投资组合，并通过一系列糟糕的\n交易，看着它慢慢流血。昨晚我无法接受...",
      "title": "我用狗屎币赌博，输了。持有比特币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好，我最近亂了陣腳，不得不吐露心聲。在\n在熊市運行期間，我打了狗屎幣，並開始看到一些大的勝利（很少兌現\n出）。) 這導致我換掉了我的比特幣投資組合，並通過一系列糟糕的\n交易，看着它慢慢流血。昨晚我無法接受...",
      "title": "我用狗屎幣賭博，輸了。持有比特幣"
    }
  ]
}