{
  "author": "homrqt",
  "original_created_utc": 1637026804,
  "title": "Has anyone sold and then watched a coin proceed to moon?",
  "created_utc": 1637037796,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I imagine it&#39;s a terrible feeling. There&#39;s a couple projects I have that have been stale for a while now and I&#39;ve been considering reallocating funds, but I&#39;m terrified one of the coins I dump will just take off. Similar events have happened to me before with stocks and that has stuck with me for a while, but that was watching a stock go up like 200%. Nothing like coins doing 1000x. I&#39;m sure many of us feel we have bad luck and whenever we sell then the cosmic powers decide now is the perfect time for the investment to go up. Has anyone actually lived this nightmare before? What coin and how has it affected your strategies afterwards? It&#39;s the kind of stuff that wakes me up at night.</p>\n</div><!-- SC_ON -->",
  "score": 236,
  "permalink": "/r/CryptoCurrency/comments/quw5d2/has_anyone_sold_and_then_watched_a_coin_proceed/",
  "subreddit": "CryptoCurrency",
  "id": "quw5d2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I imagine it's a terrible feeling. There's a couple projects I have that have\nbeen stale for a while now and I've been considering reallocating funds, but I'm\nterrified one of the coins I dump will just take off. Similar events have\nhappened to me before with stocks and that has stuck with me for a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "大変な思いをされたと思います。私のプロジェクトの中には、しばらくの間\n資金の再配分を検討していますが、私は\nしかし、私が投じたコインの1つが急上昇するのではないかと恐れています。似たようなことは以前、株で起こったことがあります。\n以前、株で同じようなことがあって、それがずっと心に残っていて...。",
      "title": "売った後、コインが月に向かって進むのを見た人はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想这是一种可怕的感觉。我有几个项目已经\n已经有一段时间了，我一直在考虑重新分配资金，但我很害怕我甩掉的其中一个硬币会起飞。\n害怕我抛出的其中一个硬币会突然起飞。类似的事件有\n我以前在股票方面也发生过类似的事情，这让我一直耿耿于怀......",
      "title": "有没有人卖出后又眼睁睁地看着一枚硬币进入月球？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想這是一種可怕的感覺。我有幾個項目已經\n已經有一段時間了，我一直在考慮重新分配資金，但我很害怕我甩掉的其中一個硬幣會起飛。\n害怕我拋出的其中一個硬幣會突然起飛。類似的事件有\n我以前在股票方面也發生過類似的事情，這讓我一直耿耿於懷......",
      "title": "有沒有人賣出後又眼睜睜地看着一枚硬幣進入月球？"
    }
  ]
}