{
  "author": "ejsfsc07",
  "original_created_utc": 1635879487,
  "title": "I don't know what to do about the imaginary people I've created in my head for almost my entire life?",
  "created_utc": 1635896482,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello, a bit of a long post, so bear with me, but I could use some advise. No one knows about this in real life except for my sister but she either is weirded out or doesn&#39;t seem that interested.</p>\n\n<p>I&#39;ve daydreamed (not obsessively, ~30 mins per day) about this fictional family I created several years ago. I know what I do is called immersive daydreaming. This family is friends with me, my sister, and our parents and they live in our town. We&#39;ve gone on several adventures together but I sometimes daydream about just them alone in their house or on their own adventures. After all these years I know a ton about each of them. Before they &quot;moved&quot; to our town, they lived somewhere else, and have their own backstories. I think about these characters frequently. Obviously I know they are not real, but sometimes they do feel real to me, in the sense that they&#39;re really complex. They also interact with both real life people and other people that I created. (I swear I&#39;m not crazy lol).</p>\n\n<p>I&#39;m particularly attached to one character. Let&#39;s call him Steven (because I&#39;m too shy to reveal his real name). I have daydreamed about Steven since I was 3 or 4 years old. And it started in the stupidest way. This is kind of weird, but I still remember when my mom was telling me about how when she was a preschool teacher this one boy in her class (Steven) was the biggest troublemaker. This is one of my earliest real life memories. From that moment on, my 4 year old self became obsessed with Steven and I would imagine him doing all sorts of things. I came up with an image of what he looked like and just went from there.</p>\n\n<p>It turned into me thinking about him every night. I wish I remembered more about what I daydreamed about, but I can&#39;t. Soon my sister and I started to appear in the daydreams. He basically grew up with us. I would just think about him (even pretend to be him) more than I pretended to talk to him in my head like I would with an imaginary friend (but I did both). Sure, Steven had his flaws, but he was perfect in my eyes. He was kind to everyone, all of his siblings, his friends. He was smart. He never was afraid to speak up against others. He was also really cute and I&#39;m still really attracted to him.</p>\n\n<p>I always assumed I would stop thinking about him and his family at some point. But now I&#39;m in college and I still think about him and occasionally daydream about him and his family (most of my assignments for writing class involve him or his siblings and some plots I&#39;ve already worked through in my head). He&#39;s doing well. We don&#39;t go to the same school, but we still text a bit. He and his high school girlfriend broke up before heading off to school and I&#39;ve already imagined them reconnecting after college and possibly getting married.</p>\n\n<p>Sometimes I really do wish Steven and his family were real. A few times I&#39;ve told new friends vague harmless details about a &quot;friend&quot; (like, &#39;oh, I know someone who likes ___&#39;), when really it&#39;s just one of my characters (usually Steven or one of his siblings). I guess it helps me &quot;bring them to life.&quot;</p>\n\n<p>Otherwise, I do have a normal life - friends, school, sports, things I want to achieve in my own life. Of course, I&#39;m secretly hoping Steven exists somewhere and we can fall in love but that&#39;s looking doubtful. Every year when it&#39;s Steven&#39;s birthday I do a special private celebration.</p>\n\n<p>I don&#39;t want these characters to just fade away. The biggest thing I&#39;ve done is create a reddit for Steven&#39;s sister (who&#39;s also my friend), but then I felt bad and deleted it. I could try writing a book, but I&#39;m wondering if anyone has ideas on how I could part with these characters while bringing them to life?</p>\n\n<p>Thanks!</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/qlbeo6/i_dont_know_what_to_do_about_the_imaginary_people/",
  "subreddit": "TooAfraidToAsk",
  "id": "qlbeo6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hello, a bit of a long post, so bear with me, but I could use some advise. No\none knows about this in real life except for my sister but she either is weirded\nout or doesn't seem that interested.\n\nI've daydreamed (not obsessively, ~30 mins per day) about this fictional family\nI created several years…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは、少し長い記事になりますが、アドバイスをお願いしたいと思っています。誰も\n姉以外は誰もこのことを知りませんが、姉は気味悪がるか、それほど興味がないようです。\n興味がなさそうにしています。\n\n私は数年前に作った架空の家族のことを空想していました（執拗ではなく、1日30分程度）。\n数年前に作った架空の家族について、空想していました...",
      "title": "人生のほとんどの期間、頭の中で作り上げた空想上の人々について、どうしたらいいのかわからないのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好，这个帖子有点长，所以请忍耐一下，但我需要一些建议。在现实生活中，除了我姐姐，没有人知道这件事。\n在现实生活中，除了我的姐姐，没有人知道这件事，但她要么很奇怪\n但她要么很奇怪，要么看起来不那么感兴趣。\n\n我一直在做关于这个虚构家庭的白日梦（不是强迫性的，每天大约30分钟）。\n我创造了好几年...",
      "title": "我不知道该如何处理我脑海中几乎一生都在创造的想象中的人？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好，這個帖子有點長，所以請忍耐一下，但我需要一些建議。在現實生活中，除了我姐姐，沒有人知道這件事。\n在現實生活中，除了我的姐姐，沒有人知道這件事，但她要麼很奇怪\n但她要麼很奇怪，要麼看起來不那麼感興趣。\n\n我一直在做關於這個虛構家庭的白日夢（不是強迫性的，每天大約30分鐘）。\n我創造了好幾年...",
      "title": "我不知道該如何處理我腦海中幾乎一生都在創造的想象中的人？"
    }
  ]
}