{
  "author": "NetIncredibility",
  "original_created_utc": 1629499658,
  "title": "Yes, I’ve been in crypto for more than 5 years and I’m not rich.",
  "created_utc": 1629513794,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There is a post on the front page currently which states you should be rich from crypto if you’ve been in it for a few years. Let me tell you why you don’t understand. Some of have made many mistakes. The silver lining is that some of us learn from our mistakes. </p>\n\n<p>My diamond hands were forged in the fires of repeated failures to hodl. Us old timers can show you the way.</p>\n\n<p>?2009 - I was hearing about crypto. Seems like people were using it for darkweb stuff. Not interested. </p>\n\n<p>2014 - I have money enough to invest here and there (small amounts), looked into buying. I came to the conclusion that mining was too hard. Literally told my friend “the bitcoin ship has sailed”</p>\n\n<p>It was different back then. This is a tech thing and it didn’t really have financial people in it. Not many people understood what the market might do. Those visionaries that did were people like Vitalik. Some of us are not on that level.  </p>\n\n<p>2013 - been reading about it enough to finally invest something. Started with $1000. When I started you literally had to wire money to some shady bank account. Or meet up and swab USBs or keys with someone. It took days to get in and out sometimes. At various points, banks would close your account if they saw you sending money to exchanges. $1000 was more like $900 by the time I’d transferred to the US and then it was converted to usd was maybe 700. Enough to buy 1.5 btc roughly. </p>\n\n<p>I was buying it when a bunch of places were still calling it - from memory - XBT - naming hadn’t even been sorted out.</p>\n\n<p>2015 I sold. $500 per coin, sure, but watch bitcoin NOT move in price after a year or two. Exchanges would collapse after not long (<a href=\"https://en.m.wikipedia.org/wiki/Mt._Gox\">Mt Gox</a> - which was handling 70% of volume - imagine if binance and coinbase got hacked… yea you’d consider selling too). I went through old emails from me to friends and family after I found out about bitcoin and did my research, I told everyone. No one supported me. NO ONE. When you’re met with resistance from many different quarters from people you respect and who are themselves finically successful, who is a kid to stand up to that? I think if you’d grown up in San Francisco with flying cars and personal assistant robots maybe it would be easier to have lived and seen technology change the world, seeing saw start ups etc. </p>\n\n<p>Back to New Zealand, living in a country where no one ever spoke about this shit other than to deride it was a totally different time. Add into that you buy btc but it doesn’t appreciate in price for a year or two and you watch exchanges fail one by one… you start to say “I guess I could use the money elsewhere, like paying bills”. I wasn’t engaged with the Reddit community much then and there was a feeling you really shouldn’t trust magic internet money. </p>\n\n<p>So, after watching Mt Gox fail, seeing the US at the time taking quite a negative stance on crypto people were thinking it’s just dodgy internet money for the dark web. It was a very negative time. For those of us who were open minded enough to get in early there were many quite reasonable rationalisations as to why it would fail. </p>\n\n<p>History repeats. Come 2017 things went well for a bit, brought in just before it went crazy. Heard about Raiblocks (now called nano) and thought this tech could change the world. Then I brought Raiblocks/nano all the way up thinking it was an amazing technology. But I brought it on bitgrail. Then “we suffered a stolen”. I lost everything. Maybe not much if you’re a whale and I was investing spare money but I went in pretty aggressively. You had to buy the random tokens off some random sites as they weren’t on the main exchanges. Yes, shouldn’t have brought from that exchange - I know. Some of us lost big. Some whales were made. It hasn’t all been sunshine and roses. It’s been hard and lots of us have made many mistakes. Those who succeeded were also lucky. I just happened to avoid Mt Gox the first time.</p>\n\n<p>It’s easy to see how crypto is the future now. But you’re using the current situation to judge how it felt back then. Loads of people lost keys, the brought and sold and used it for buying random shit off Silk Road. Not many thought it would be the future of money. I thought it had a future back then but didn’t really know about investing. </p>\n\n<p>Point is: if you invest when it’s risky you win big. If you invest once it’s a sure thing you’re going to have less potential rewards and less potential risks. Stick to the rules in crypto. Only invest what you can lose. Mistakes are how you learn. Cold wallets. Not your keys not your coins. Many of us are using this path as a way to potential financial independence, we should be helping one another and enjoying the ride.</p>\n\n<p>Good luck everyone!</p>\n\n<p>Edit: one thought I had after writing this was buying crypto for me back in the day would be like buying some random altcoin right now. Just pick one randomly and put your money on it. Pretty scary! That was how unknown it seemed to me at the time when I first was reading about crypto.</p>\n\n<p>Second edit: I forgot about matic (polygon) - brought in 2019 at 2c, ran into financial difficulties with a project in the real world, had to sell, it mooned to 2.80 at one point. I’ve come to terms with it. Another one that would have made me a millionaire. Lol. Amongst my friends who invested early (started having crypto group chats 2017 or so) most of us have some horror stories like this. Nowadays, I buy and hodl. </p>\n\n<p>Tldr: hodling is hard. I’m pretty typical for those who got in early. Lots of us screwed up. Don’t worry, you have time.</p>\n\n<p>Edited a little for clarity</p>\n</div><!-- SC_ON -->",
  "score": 183,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/d9oyFuU658wRHodvDa08zdFauqoHkR9rxl2dW5Wz_f8.jpg?auto=webp&s=f54596fba3b4f48ee7a61864b4d65b22f7295a5a",
          "width": 565,
          "height": 266
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/d9oyFuU658wRHodvDa08zdFauqoHkR9rxl2dW5Wz_f8.jpg?width=108&crop=smart&auto=webp&s=629f92018eff4dd938789dcfb39f3240e6b9bed0",
            "width": 108,
            "height": 50
          },
          {
            "url": "https://external-preview.redd.it/d9oyFuU658wRHodvDa08zdFauqoHkR9rxl2dW5Wz_f8.jpg?width=216&crop=smart&auto=webp&s=5a2a22f5efc0fda2a2d765f34eec424b6d239f15",
            "width": 216,
            "height": 101
          },
          {
            "url": "https://external-preview.redd.it/d9oyFuU658wRHodvDa08zdFauqoHkR9rxl2dW5Wz_f8.jpg?width=320&crop=smart&auto=webp&s=169f3826cf8d515186687a118f9fc4e59469a564",
            "width": 320,
            "height": 150
          }
        ],
        "variants": {},
        "id": "auTMwzJzxkVHsT3VoDqvG2p8vbRKu2L-s2kJWspYhNA"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/p8fsp9/yes_ive_been_in_crypto_for_more_than_5_years_and/",
  "subreddit": "CryptoCurrency",
  "id": "p8fsp9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "There is a post on the front page currently which states you should be rich from\ncrypto if you’ve been in it for a few years. Let me tell you why you don’t\nunderstand. Some of have made many mistakes. The silver lining is that some of\nus learn from our mistakes.\n\nMy diamond hands were forged in the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "現在、フロントページには、数年前から参加していれば、暗号から金持ちになるべきだという記事があります。\n数年やっていれば、暗号から金持ちになれるはずだという記事があります。あなたが理解できない理由を教えましょう。\n理解してください。何人かは多くの失敗をしています。銀の裏地は、一部の人たちが\n失敗から学ぶ人もいます。\n\n私のダイヤモンドの手は...で鍛えられました。",
      "title": "はい、私は5年以上も暗号に携わっていますが、お金持ちではありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "目前，头版上有一个帖子说，如果你在加密货币中呆了几年，你就应该发财了。\n如果你在其中呆了几年，你就会从加密货币中致富。让我告诉你为什么你不\n理解。有些人已经犯了很多错误。一线希望是，我们中的一些人\n我们从我们的错误中学习。\n\n我的钻石之手是在...",
      "title": "是的，我从事加密货币超过5年了，我并不富有。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "目前，頭版上有一個帖子說，如果你在加密貨幣中呆了幾年，你就應該發財了。\n如果你在其中呆了幾年，你就會從加密貨幣中致富。讓我告訴你爲什麼你不\n理解。有些人已經犯了很多錯誤。一線希望是，我們中的一些人\n我們從我們的錯誤中學習。\n\n我的鑽石之手是在...",
      "title": "是的，我從事加密貨幣超過5年了，我並不富有。"
    }
  ]
}