{
  "author": "bang870",
  "the_new_excerpt": "I work in S&T at a BB. I cover some of the largest funds in the world.\n\nI went to college for this.\n\nI worked my ass off for this.\n\nI fucking hate you all. Ive been following WSB for well over 2 years at this\npoint and i cannot find the words for how much I hate you all.\n\nI'm required to hold…",
  "original_created_utc": 1611290325,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我在一家BB的S&T部门工作。我负责一些世界上最大的基金。\n\n我上大学就是为了这个\n\n我为此拼命工作\n\n我他妈的恨你们 我关注WSB已经两年多了\n我无法用言语来表达我对你们的恨。\n\n我必须持有...",
      "title": "我恨你们"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在一家BB的S&T部門工作。我負責一些世界上最大的基金。\n\n我上大學就是爲了這個\n\n我爲此拼命工作\n\n我他媽的恨你們 我關注WSB已經兩年多了\n我無法用言語來表達我對你們的恨。\n\n我必須持有...",
      "title": "我恨你們"
    }
  ],
  "title": "I hate You All",
  "created_utc": 1611323132,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I work in S&amp;T at a BB. I cover some of the largest funds in the world.</p>\n\n<p>I went to college for this.</p>\n\n<p>I worked my ass off for this.</p>\n\n<p>I fucking hate you all. Ive been following WSB for well over 2 years at this point and i cannot find the words for how much I hate you all. </p>\n\n<p>I&#39;m required to hold personal positions for 30 days at a minimum  and the list of what I can buy is extremely small. Obviously that changes my strategy around because I trade my 401k. </p>\n\n<p>I want you all to know that I read everything, every day. I&#39;ve never been more jealous and I&#39;ve never been so wrong in my life. I consistently bet against you autists and I am proven wrong EVERY single time. </p>\n\n<p>I&#39;ll never be mad about people making money. I&#39;ll never be mad at you all for being successful - but god fucking damn it if I am not jealous of what you guys have done because I can&#39;t participate.</p>\n\n<p>I wish you all the best, enjoy this shit while it lasts because i have a feeling it wont. Feel free to DM me about the market, I can be helpful in certain sectors.</p>\n\n<p>Godspeed and good gains - I wish you all keep making my colleagues and I look like fucking idiots.</p>\n</div><!-- SC_ON -->",
  "score": 3041,
  "permalink": "/r/wallstreetbets/comments/l2g6fr/i_hate_you_all/",
  "subreddit": "wallstreetbets",
  "id": "l2g6fr",
  "is_self": true,
  "media": null,
  "is_video": false
}