{
  "author": "consygiere",
  "the_new_excerpt": "This is not about $GME anymore, this is about setting terms straight:\n\nRetail does not want to be manipulated anymore.\n\nFor decades Wall Street was manipulating securities, getting away with it, and\nblaming it on others. Through the media, bullshit target prices, naked short\nselling, or other forms…",
  "original_created_utc": 1611712136,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这已经不是$GME的问题，而是要把条款说清楚。\n\n零售业不想再被操纵了。\n\n几十年来，华尔街一直在操纵证券，逍遥法外，而且。\n归咎于他人。通过媒体、扯淡的目标价、赤裸裸的空头\n销售，或其他形式的...",
      "title": "我们已经厌倦了市场操纵者和腐败的媒体。现在是采取行动的时候了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這已經不是$GME的問題，而是要把條款說清楚。\n\n零售業不想再被操縱了。\n\n幾十年來，華爾街一直在操縱證券，逍遙法外，而且。\n歸咎於他人。通過媒體、扯淡的目標價、赤裸裸的空頭\n銷售，或其他形式的...",
      "title": "我們已經厭倦了市場操縱者和腐敗的媒體。現在是採取行動的時候了"
    }
  ],
  "title": "We are tired of Market Manipulators and corrupted media. This is time to act",
  "created_utc": 1611734424,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is not about $GME anymore, this is about setting terms straight:</p>\n\n<p><strong>Retail does not want to be manipulated anymore.</strong></p>\n\n<p>For decades Wall Street was manipulating securities, getting away with it, and blaming it on others. Through the media, bullshit target prices, naked short selling, or other forms of manipulation mentioned <a href=\"https://en.wikipedia.org/wiki/Market_manipulation\">here</a> (Kenneth, <a href=\"https://www.ft.com/content/16cee174-3b7f-11ea-b232-000f4477fbca\">this one</a>&#39;s for you). Citadel and many other MMs - don&#39;t misinterpret with Market Makers, we&#39;re talking about Market Manipulators here - got away with their dirty tactics to make shitload of money and screw people over. They finally got caught in their own game and tried everything to turn it around, but Shitron didn&#39;t work, the media didn&#39;t work, more aggressive selling didn&#39;t work. Now they&#39;re calling through some random crooks for regulations.</p>\n\n<p><strong>BULLSHIT.</strong> Regulation for what? Exchange of ideas? Our own Due Diligence? Winning against you in your own game? Yeah, in most cases your buddies at the SEC would gladly do so if you tell them anyway. This time though? People finally came to the realisation what the fuck you guys are doing over there. It was known by many since 2008 but people forgot quickly, and now is the time to remind them that you are no one else&#39;s friend but your crooked buddies.</p>\n\n<p>I never thought I&#39;d say this, but this community showed more leadership and guidance than any other media network. Providing knowledge, research, answers, many of you proven that <strong>you are better people</strong> than these fuckers with billions of dollars of AUM. You should be proud of yourselves as you are leading an unprecedented event in the history of finance. <strong>Unprecedented.</strong> This is why you should still guide others and be an example. Of course, we are not an entity and we will never be - just remember that you are a part of something great, maybe something that will change the way financial world operates, in a smaller or larger way. Remember that there are sharks among us who got pissed at the dirty games as well (shoutout to you Elon &amp; Chamath). We are not alone.</p>\n\n<p>They blame us? Let&#39;s blame them. They will lose all credibility sooner than later, not to mention this incoming generation. The media is here now, you still might convince my 80-year old grandpa that the internet is something out of Pandora&#39;s Box, but soon enough you won&#39;t be able to convince a single person. We are an important source of information for many people, and I&#39;m not talking about WSB, but about the people that make it. Let&#39;s go there in the world and spread the facts.</p>\n\n<p>Hence, dear Market Manipulators:</p>\n\n<p><strong><em>Do not mislead again. Do not manipulate again. Get your facts straight. Retail matters, and you will see it.</em></strong> </p>\n</div><!-- SC_ON -->",
  "score": 23647,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/qYSF9RP4Pn4HBTAF6xbatxVrzUEym9WM-wjOXyt70X0.jpg?auto=webp&s=cbd26bc834901d85be2d0d8b705c7eee0a9fb1a8",
          "width": 48,
          "height": 40
        },
        "resolutions": [],
        "variants": {},
        "id": "w__uTNdZd2qGN7fw--yGi3Q3S-XawQlGs6veyll4zlk"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/wallstreetbets/comments/l5teyc/we_are_tired_of_market_manipulators_and_corrupted/",
  "subreddit": "wallstreetbets",
  "id": "l5teyc",
  "is_self": true,
  "media": null,
  "is_video": false
}