{
  "author": "LindleyiBlooms",
  "the_new_excerpt": "Gone are most of the moonboi posts, I see way fewer rocket emojis, and technical\ndiscussion and research is returning! Sure it's great when things are going up\nand you're making money, but it get's pretty repetitive to see the same 4-5\nposts recycled day in and day out, and I prefer to actually…",
  "original_created_utc": 1620741334,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "moonboiの投稿はほとんどなくなり、ロケットの絵文字もかなり少なくなって、技術的な\n技術的な議論や研究が戻ってきています。物事がうまくいっていて、お金を稼いでいるときは確かに素晴らしいのですが\n儲かっているときはいいのですが、同じような4～5の投稿を見るのは、かなり反復的になります。\nでも、毎日毎日、同じような4～5個の投稿が繰り返されるのは、かなり反復的です。",
      "title": "人気のない意見。浸かっている時の方が、このサブは気持ちがいい。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大多数月球人的帖子不见了，我看到的火箭表情符号也少了，而技术方面的\n讨论和研究正在回归! 当然，当事情发展到一定程度时，这是很好的，你在赚钱。\n你在赚钱，这当然很好，但如果看到同样的4-5个\n但是，如果每天都看到同样的4-5个帖子，就会变得非常重复，我更愿意真正...",
      "title": "不受欢迎的意见。当我们在浸泡时，这个子变得更加令人愉快"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大多數月球人的帖子不見了，我看到的火箭表情符號也少了，而技術方面的\n討論和研究正在迴歸! 當然，當事情發展到一定程度時，這是很好的，你在賺錢。\n你在賺錢，這當然很好，但如果看到同樣的4-5個\n但是，如果每天都看到同樣的4-5個帖子，就會變得非常重複，我更願意真正...",
      "title": "不受歡迎的意見。當我們在浸泡時，這個子變得更加令人愉快"
    }
  ],
  "title": "Unpopular Opinion: This sub becomes way more pleasant when we're dipping",
  "created_utc": 1620754239,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Gone are most of the moonboi posts, I see way fewer rocket emojis, and technical discussion and research is returning! Sure it&#39;s great when things are going up and you&#39;re making money, but it get&#39;s pretty repetitive to see the same 4-5 posts recycled day in and day out, and I prefer to actually learn more about the space than just read shitty pamp it memes all day.</p>\n</div><!-- SC_ON -->",
  "score": 505,
  "permalink": "/r/CryptoCurrency/comments/n9xjwl/unpopular_opinion_this_sub_becomes_way_more/",
  "subreddit": "CryptoCurrency",
  "id": "n9xjwl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985992427
}