{
  "author": "DuhBestRetard",
  "the_new_excerpt": "Any mentions of stonks have been replaced with XX. Don’t want this to be a\npropaganda piece just sharing my experience.\n\nSo, I woke up this morning to my wife standing over me holding my phone. She\ndoesn’t even give me time to open my eyes and she says “who the hell is Robin!”\nI’m tired, haven’t had…",
  "original_created_utc": 1624122005,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Stonksの記述はすべてXXに置き換えられています。これを宣伝文句にしたくはありません。\nこれは宣伝文句ではなく、私の経験を話しているだけです。\n\n今朝、目が覚めると妻が私の携帯電話を持って立っていました。妻は\n私が目を開けるのも忘れて「ロビンって誰よ！」と言っていました。\n私は疲れていて、何も食べていない...",
      "title": "妻は私がロビンと浮気していると思っています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "任何提到的石头都被替换成了XX。我不希望这成为一个\n宣传的文章，只是分享我的经验。\n\n所以，我今天早上醒来时，我的妻子站在我身边，拿着我的手机。她\n她甚至不给我时间睁开眼睛，就说 \"罗宾到底是谁！\"\n我很累，还没有吃...",
      "title": "我的妻子认为我和罗宾有婚外情。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "任何提到的石頭都被替換成了XX。我不希望這成爲一個\n宣傳的文章，只是分享我的經驗。\n\n所以，我今天早上醒來時，我的妻子站在我身邊，拿着我的手機。她\n她甚至不給我時間睜開眼睛，就說 \"羅賓到底是誰！\"\n我很累，還沒有喫...",
      "title": "我的妻子認爲我和羅賓有婚外情。"
    }
  ],
  "title": "My wife thinks I’m having an affair with Robin.",
  "created_utc": 1624131926,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Any mentions of stonks have been replaced with XX.  Don’t want this to be a propaganda piece just sharing my experience.  </p>\n\n<p>So, I woke up this morning to my wife standing over me holding my phone.  She doesn’t even give me time to  open my eyes and she says “who the hell is Robin!”  I’m tired, haven’t had my morning poo or my Honey Nut Cheerios so of course I’m in no state of mind to understand what she means.  I replied, “I don’t know any Robins”.  She continues yelling at me telling me that I think she’s an idiot, that I’m talking to all of my friends about her and she knew that they were looking at her funny last time we hung out.  So finally she throws the phone at me and says if you don’t want to be honest fine, I’ll just leave.  So I’m up enough to read at this point, and when I look at my phone I had texted my buddy Ray, “I’m gonna get all up in Robin Hood Monday morning, I’m a horny bull for some XX and don’t worry I’m gonna XXXX off before I get home to my wife.”  That was one of my more PG texts - as I’m sure my fellow apes can understand that I go hard on something when I believe it can make me that money (XX) - and when I believe in the company (XXXX).  Anyways, 2 hours of convincing later I’m still married.  However she now knows where all of our money is going - down the big fat drain.  Not sure if I’ll get upvotes or down votes for that last part.  Happy weekend retards, if anyone has some good loss porn please post it, I think I’ll be on the couch for a few days.</p>\n</div><!-- SC_ON -->",
  "score": 1000,
  "permalink": "/r/wallstreetbets/comments/o3kjce/my_wife_thinks_im_having_an_affair_with_robin/",
  "subreddit": "wallstreetbets",
  "id": "o3kjce",
  "is_self": true,
  "media": null,
  "is_video": false
}