{
  "author": "reach_Chris",
  "the_new_excerpt": "Hey there fellow entrepreneurs and start-up enthusiasts! For a long time I\nwondered why the way we store files in the digital space has remained unchanged\nfrom how we’ve been storing physical paper for centuries. About three years ago,\nI decided there must be a better way and, after studying an MSc…",
  "original_created_utc": 1622646693,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "起業家やスタートアップ愛好家の皆さん、こんにちは。長い間、私は\nデジタル空間でファイルを保存する方法が、何世紀にもわたって物理的な紙を保存する方法と変わらないことを不思議に思っていました。\n疑問に思っていました。3年ほど前のことです。\n私はもっと良い方法があるはずだと考え、修士号を取得した後に...",
      "title": "私は、自分のもののための個人的なGoogleのような、より良い検索を行うためのウェブサイトとアプリを作りました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嘿，各位企业家和创业爱好者们！在过去的很长一段时间里，我一直在为我的创业计划而努力。长期以来，我一直在想\n我一直在想，为什么我们在数字空间中存储文件的方式与我们几个世纪以来存储纸质文件的方式没有变化呢？\n与我们几个世纪以来存储物理纸张的方式不同。大约三年前。\n我决定一定有一个更好的方法，并且在学习了硕士课程之后，我决定将这个方法运用到我的工作中。",
      "title": "我做了一个网站和应用程序，就像你自己的东西的个人谷歌，但有更好的搜索。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嘿，各位企業家和創業愛好者們！在過去的很長一段時間裏，我一直在爲我的創業計劃而努力。長期以來，我一直在想\n我一直在想，爲什麼我們在數字空間中存儲文件的方式與我們幾個世紀以來存儲紙質文件的方式沒有變化呢？\n與我們幾個世紀以來存儲物理紙張的方式不同。大約三年前。\n我決定一定有一個更好的方法，並且在學習了碩士課程之後，我決定將這個方法運用到我的工作中。",
      "title": "我做了一個網站和應用程序，就像你自己的東西的個人谷歌，但有更好的搜索。"
    }
  ],
  "title": "I made a website and app that’s like a personal Google for your own stuff, but with better search.",
  "created_utc": 1622661936,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey there fellow entrepreneurs and start-up enthusiasts! For a long time I wondered why the way we store files in the digital space has remained unchanged from how we’ve been storing physical paper for centuries. About three years ago, I decided there must be a better way and, after studying an MSc in innovation and entrepreneurship at a top European school, I dedicated myself with a team of crazy genius engineers to the creation of a new cloud storage service that functions a whole lot like the memory of the human brain. It associates everything thrown into it with its context (what it’s about, which information it relates to, where it’s from, who created it, when it was saved, how important is it, etc.) instead of just one folder path or keywords. </p>\n\n<p>The software lets you store all your digital resources (photos, videos, docs, websites, notes, etc.) in one place and understands how they are connected – a bit like an automated version of a PI’s bulletin board, but with three dimensions instead of two. Amongst 5 ways of looking at your files, there’s even a 3D visualisation showing you how all your data is connected and stored. Our friends love it :)</p>\n\n<p>We’re online and slowly rolling out the Beta version to gather very first feedback before our big unveil at the Mobile World Congress / 4YFN in Barcelona. So here is my question to you: How do you feel about having a personal Google, but more advanced – being able to search by filters and anything you know about the item you’re looking for, not just keywords? Have you noticed any drawbacks of the standard folder-based file system that we know? Is Reach (the name of our service) something you’re willing to try out?</p>\n</div><!-- SC_ON -->",
  "score": 20,
  "permalink": "/r/SideProject/comments/nqnz8e/i_made_a_website_and_app_thats_like_a_personal/",
  "subreddit": "SideProject",
  "id": "nqnz8e",
  "is_self": true,
  "media": null,
  "is_video": false
}