{
  "author": "marnieholmes",
  "original_created_utc": 1655221761,
  "title": "Dear Americans: Do you really eat so much packaged stuff?",
  "created_utc": 1655232667,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am South American and I&amp;#39;ve seen a lot of videos from you guys making food &amp;quot;out of scratch&amp;quot; when it&amp;#39;s literally how every meal is made. I&amp;#39;ve also seen a lot of people talk about how they eat ramen, canned or bagged food every day. Is it true that processed food is cheaper than buying vegetables/meat/chicken? Processed and junk food is really expensive here so I can&amp;#39;t afford eating something like McDonald&amp;#39;s every week.&lt;/p&gt;\n\n&lt;p&gt;Sorry if this is insulting or something but I don&amp;#39;t really know any americans aside from what I see online.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 175,
  "permalink": "/r/NoStupidQuestions/comments/vc6ikv/dear_americans_do_you_really_eat_so_much_packaged/",
  "subreddit": "NoStupidQuestions",
  "id": "vc6ikv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I am South American and I've seen a lot of videos from you guys making food \"out\nof scratch\" when it's literally how every meal is made. I've also seen a lot of\npeople talk about how they eat ramen, canned or bagged food every day. Is it\ntrue that processed food is cheaper than buying…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は南米人ですが、あなた方が「ゼロから」料理を作るビデオをたくさん見てきました。\nを作るビデオをたくさん見ました。また、多くの人が\nラーメンや缶詰、袋入りの食品を毎日食べているという話もよく見かけます。果たして\n加工食品は買うより安いというのは本当ですか？",
      "title": "親愛なるアメリカ人へ。あなたは本当にたくさんのパッケージされたものを食べていますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是南美人，我看过很多你们制作食物的视频，都是 \"从头开始 \"的，而这正是每顿饭的制作方式。\n我是南美人，我看过很多你们制作食物的视频，\"从头开始\"，而这正是每顿饭的制作方法。我还看到很多\n我也看到很多人谈论他们如何每天吃拉面、罐头或袋装食品。这是不是\n加工过的食物真的比买的便宜吗？",
      "title": "亲爱的美国人。你真的吃了这么多包装的东西吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是南美人，我看過很多你們製作食物的視頻，都是 \"從頭開始 \"的，而這正是每頓飯的製作方式。\n我是南美人，我看過很多你們製作食物的視頻，\"從頭開始\"，而這正是每頓飯的製作方法。我還看到很多\n我也看到很多人談論他們如何每天喫拉麪、罐頭或袋裝食品。這是不是\n加工過的食物真的比買的便宜嗎？",
      "title": "親愛的美國人。你真的吃了這麼多包裝的東西嗎？"
    }
  ]
}