{
  "author": "Zantti",
  "original_created_utc": 1635722086,
  "title": "If this run has taught me anything, it's that most people here don't really care about decentralization and technology",
  "created_utc": 1635744651,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Feel free to downvote me, that is your right, who am I to tell you what you should do with your money?  </p>\n\n<p>But just as you have the right to do with your money whatever you want so do I have the right to express my opinion on this sub.  I am seriously dissapointed with the ammount of posts shilling shitcoins, memecoins and people supporting it.  </p>\n\n<p>Some of you will make good money on it, most of you probably won&#39;t. If you go with it for a long run I am sure you will get rekt.  </p>\n\n<p>People who put money into this just read how someone made a huge profit, avoid reading how many people lost money in the same way not even a month ago, people on this sub would recommend not gambling on shitcoins, and now I have a feeling that everyone here are for the shitcoin gamble.Where did all those people from whom I could learn disappeared?</p>\n\n<p>And yes, most of us are here for the money but also for decentralization and adoption. Is this the adoption we asked for?</p>\n</div><!-- SC_ON -->",
  "score": 158,
  "permalink": "/r/CryptoCurrency/comments/qk155m/if_this_run_has_taught_me_anything_its_that_most/",
  "subreddit": "CryptoCurrency",
  "id": "qk155m",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Feel free to downvote me, that is your right, who am I to tell you what you\nshould do with your money?\n\nBut just as you have the right to do with your money whatever you want so do I\nhave the right to express my opinion on this sub. I am seriously dissapointed\nwith the ammount of posts shilling…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、あなたにどうこう言うつもりはありません。\nあなたのお金で何をすべきか？\n\nしかし、あなたが自分のお金で好きなことをする権利があるように、私も自分のお金で好きなことをする権利があります。\nこのサブで私の意見を述べる権利があります。マジでガッカリです\nって書き込みが多くて...。",
      "title": "今回の活動で学んだことは、ここにいるほとんどの人は、分散化やテクノロジーについてあまり関心がないということです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你可以随意给我降权，这是你的权利，我有什么资格告诉你，你应该如何处理你的钱？\n应该用你的钱做什么？\n\n但是，正如你有权用你的钱做你想做的事一样，我也有权利\n我也有权利在这个子上表达我的意见。我感到非常失望的是\n我很失望，因为有那么多的帖子都是假的......。",
      "title": "如果这次运行让我学到了什么，那就是这里的大多数人并不真正关心去中心化和技术。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你可以隨意給我降權，這是你的權利，我有什麼資格告訴你，你應該如何處理你的錢？\n應該用你的錢做什麼？\n\n但是，正如你有權用你的錢做你想做的事一樣，我也有權利\n我也有權利在這個子上表達我的意見。我感到非常失望的是\n我很失望，因爲有那麼多的帖子都是假的......。",
      "title": "如果這次運行讓我學到了什麼，那就是這裏的大多數人並不真正關心去中心化和技術。"
    }
  ]
}