{
  "author": "CyKii",
  "original_created_utc": 1629567841,
  "title": "If mRNA vaccines remain proven safe, is it actually necessary to go through new trials each time when vaccinating for a new strain or another disease?",
  "created_utc": 1629579838,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Obviously it&#39;s best to be careful about these things. That said, with this new form of vaccination, a lot of the uncertainty of &#39;old school&#39; vaccines is out of the picture, right? Supposing the method of getting mRNA into the body remains the same, and the proteins produced are innocuous – is there still reason to think that there could be unforeseen side effects?</p>\n</div><!-- SC_ON -->",
  "score": 130,
  "permalink": "/r/askscience/comments/p8vtoe/if_mrna_vaccines_remain_proven_safe_is_it/",
  "subreddit": "askscience",
  "id": "p8vtoe",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Obviously it's best to be careful about these things. That said, with this new\nform of vaccination, a lot of the uncertainty of 'old school' vaccines is out of\nthe picture, right? Supposing the method of getting mRNA into the body remains\nthe same, and the proteins produced are innocuous – is there…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もちろん、これらのことに気をつけるのが一番です。とはいえ、この新しい\nこの新しい予防接種では、「旧来の」ワクチンの不確実性の多くが排除されています。\nそうですね。仮に、mRNAを体内に取り込む方法が同じで、生成されるタンパク質が\n体内にmRNAを取り込む方法が同じで、生成されるタンパク質が無害だとすると、そこには...",
      "title": "もしmRNAワクチンの安全性が証明されているのであれば、新しい株や別の病気のワクチンを接種する際に、毎回新たな試験を行う必要があるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "显然，对这些事情最好要小心。这就是说，有了这种新的\n疫苗接种的新形式，很多 \"老式 \"疫苗的不确定性就不存在了。\n的不确定性，对吗？假设让mRNA进入人体的方法保持不变\n而产生的蛋白质是无害的 - 是否有...",
      "title": "如果mRNA疫苗仍然被证明是安全的，那么在为新菌株或其他疾病接种疫苗时，是否真的有必要每次都进行新的试验？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "顯然，對這些事情最好要小心。這就是說，有了這種新的\n疫苗接種的新形式，很多 \"老式 \"疫苗的不確定性就不存在了。\n的不確定性，對嗎？假設讓mRNA進入人體的方法保持不變\n而產生的蛋白質是無害的 - 是否有...",
      "title": "如果mRNA疫苗仍然被證明是安全的，那麼在爲新菌株或其他疾病接種疫苗時，是否真的有必要每次都進行新的試驗？"
    }
  ]
}