{
  "author": "UnexperiencedIT",
  "original_created_utc": 1631551126,
  "title": "My strategy is to HOLD, not because I'm going to the moon, but because I'm not good at anything else",
  "created_utc": 1631561439,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As the title says. Im into crypto for one year but I still feel like a noob. I dont think Im stupid or anyhing else, but need more time because there is a lot to learn here.</p>\n\n<p>God knows I tried. Short trading, daily trading, medium trading. Trying to preddict the price never worked for me and in 90% of the time when I sold, I would always stay locked on my phone checking the prices every 10-15 minutes.When Im outside with my friends I would check the prices untill the battery dries out. Ofc as many of you when I sell price goes up more, when I buy prices goes down and it was like a vicious circle. </p>\n\n<p>I figured out that I should just buy, hold and rebuy if I trully believe in the coin project because that way is stress free for me. I know I should start doing the trading more often and learn how to control myaelf but at this point I feel safe in the HODL bubble.</p>\n</div><!-- SC_ON -->",
  "score": 194,
  "permalink": "/r/CryptoCurrency/comments/pnj4c6/my_strategy_is_to_hold_not_because_im_going_to/",
  "subreddit": "CryptoCurrency",
  "id": "pnj4c6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As the title says. Im into crypto for one year but I still feel like a noob. I\ndont think Im stupid or anyhing else, but need more time because there is a lot\nto learn here.\n\nGod knows I tried. Short trading, daily trading, medium trading. Trying to\npreddict the price never worked for me and in 90%…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルの通りです。暗号に参入して1年になりますが、まだ初心者のような気がします。I\n愚かだとは思いませんが、ここで学ぶことはたくさんあるのでもっと時間が必要です。\n学ぶべきことがたくさんあるからです。\n\n神は私が試したことを知っています。短い取引、毎日の取引、中程度の取引。価格を予測しようとしても\n価格を予測しようとしても、私にはうまくいかず、90％は...",
      "title": "私の戦略は、月に行くからではなく、他のことが苦手だからこそ、HOLDすることです"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "正如标题所说。我进入加密货币一年了，但我仍然觉得自己是个新手。I\n我不认为我很笨或其他什么，但需要更多时间，因为这里有很多\n要学习的东西。\n\n上帝知道我试过了。短线交易，每日交易，中线交易。试图\n预测价格对我来说从未奏效，而且在90%...",
      "title": "我的策略是坚持，不是因为我要去月球，而是因为我不擅长其他事情。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "正如標題所說。我進入加密貨幣一年了，但我仍然覺得自己是個新手。I\n我不認爲我很笨或其他什麼，但需要更多時間，因爲這裏有很多\n要學習的東西。\n\n上帝知道我試過了。短線交易，每日交易，中線交易。試圖\n預測價格對我來說從未奏效，而且在90%...",
      "title": "我的策略是堅持，不是因爲我要去月球，而是因爲我不擅長其他事情。"
    }
  ]
}