{
  "author": "nick83487",
  "original_created_utc": 1657424571,
  "title": "It's really important to have an emergency fund, especially now.",
  "created_utc": 1657452829,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Emergency funds are something I don&amp;#39;t see mentioned very much outside of &amp;quot;only invest what you can afford to lose&amp;quot;. While it is good advice, it is very possible that we experience a recession in the near future and having an emergency fund is really important right now. &lt;/p&gt;\n\n&lt;p&gt;For those who don&amp;#39;t know what an emergency fund is, it&amp;#39;s essentially a sum of money (yes, FIAT) that you set aside for large unexpected expenses such as job loss, unforeseen medical expenses, etc. I know current prices are tempting to just buy crypto but if and when we go into a recession, it&amp;#39;s better to be safe than sorry.&lt;/p&gt;\n\n&lt;p&gt;The amount that you should put into an emergency fund is different for everyone and depends on what kind of support you would have if something happened. I generally stick to having enough stashed away to support myself for at least 3 months but depending on your situation, you may want more.&lt;/p&gt;\n\n&lt;p&gt;I know it&amp;#39;s hard enough to set aside any money with prices being so high right now but having an emergency fund is more important than buying the dip.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 399,
  "permalink": "/r/CryptoCurrency/comments/vvipwu/its_really_important_to_have_an_emergency_fund/",
  "subreddit": "CryptoCurrency",
  "id": "vvipwu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Emergency funds are something I don't see mentioned very much outside of \"only\ninvest what you can afford to lose\". While it is good advice, it is very\npossible that we experience a recession in the near future and having an\nemergency fund is really important right now.\n\nFor those who don't know…"
}