{
  "author": "nick83487",
  "original_created_utc": 1657424571,
  "title": "It's really important to have an emergency fund, especially now.",
  "created_utc": 1657452829,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Emergency funds are something I don&amp;#39;t see mentioned very much outside of &amp;quot;only invest what you can afford to lose&amp;quot;. While it is good advice, it is very possible that we experience a recession in the near future and having an emergency fund is really important right now. &lt;/p&gt;\n\n&lt;p&gt;For those who don&amp;#39;t know what an emergency fund is, it&amp;#39;s essentially a sum of money (yes, FIAT) that you set aside for large unexpected expenses such as job loss, unforeseen medical expenses, etc. I know current prices are tempting to just buy crypto but if and when we go into a recession, it&amp;#39;s better to be safe than sorry.&lt;/p&gt;\n\n&lt;p&gt;The amount that you should put into an emergency fund is different for everyone and depends on what kind of support you would have if something happened. I generally stick to having enough stashed away to support myself for at least 3 months but depending on your situation, you may want more.&lt;/p&gt;\n\n&lt;p&gt;I know it&amp;#39;s hard enough to set aside any money with prices being so high right now but having an emergency fund is more important than buying the dip.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 399,
  "permalink": "/r/CryptoCurrency/comments/vvipwu/its_really_important_to_have_an_emergency_fund/",
  "subreddit": "CryptoCurrency",
  "id": "vvipwu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Emergency funds are something I don't see mentioned very much outside of \"only\ninvest what you can afford to lose\". While it is good advice, it is very\npossible that we experience a recession in the near future and having an\nemergency fund is really important right now.\n\nFor those who don't know…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "緊急時の資金については、「失ってもいいものだけを投資する」以外、あまり言及されることは\nを投資しなさい」以外にはあまり言及されていない。これは良いアドバイスですが、非常に\nを持つことは非常に重要です。\nを持つことは、今本当に重要なことです。\n\nご存じない方のために...",
      "title": "特に今は、緊急時の資金を確保することが本当に大切です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "除了 \"只投资你能承受的损失 \"之外，我很少看到有人提到应急基金。\n投资你能承受的损失 \"之外，我很少看到提及应急基金。虽然这是一个很好的建议，但很有可能\n我们有可能在不久的将来经历一次经济衰退，而拥有一笔应急资金是非常重要的。\n应急基金现在真的很重要。\n\n对于那些不知道的人来说...",
      "title": "拥有一个应急基金真的很重要，尤其是现在。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "除了 \"只投資你能承受的損失 \"之外，我很少看到有人提到應急基金。\n投資你能承受的損失 \"之外，我很少看到提及應急基金。雖然這是一個很好的建議，但很有可能\n我們有可能在不久的將來經歷一次經濟衰退，而擁有一筆應急資金是非常重要的。\n應急基金現在真的很重要。\n\n對於那些不知道的人來說...",
      "title": "擁有一個應急基金真的很重要，尤其是現在。"
    }
  ]
}