{
  "author": "xxDIxx07",
  "the_new_excerpt": "First off, this is not financial advice! We are all gambling for goodness sake\n(sir, this is a casino). It's called wallstreetBETS for a reason. This is simply\nmy personal opinion and if you read it, COOL! If not, COOL!\n\nP.S. I dove head first into the stock market for one reason and one reason…",
  "original_created_utc": 1617672818,
  "localize": [
    {
      "locale": "ja-JA",
      "the_new_excerpt": "最初に言っておきますが、これは経済的なアドバイスではありません 私たちは皆、良い意味でのギャンブル\nのです（先生、ここはカジノです）。wallstreetBETSと呼ばれているのには理由があります。これは単に\nこれは単に私の個人的な意見であり、もしあなたがそれを読んだなら、COOL! そうでなければ、COOL!\n\nP.S. 私が株式市場に真っ先に飛び込んだ理由はただ一つ、理由はただ一つ...。",
      "title": "私は、Game stopのようなボラティリティの高い銘柄は、テクニカル分析についてFLYING F*CK（スムーズな頭脳-星はUを表す）をしないということに気がつきました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "首先，这不是理财建议! 我们都是在赌博\n（先生，这是一个赌场）。这叫华尔街赌注是有原因的。这只是\n我的个人意见，如果你读它，COOL! 如果没有，cool!\n\nP.S.我一头扎进股市，原因只有一个，就是......",
      "title": "我已经意识到，一个股票有这样的波动性，游戏停止不给一个FLYING F*CK（光滑的大脑 - 星代表一个U）的技术分析!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，這不是理財建議! 我們都是在賭博\n（先生，這是一個賭場）。這叫華爾街賭注是有原因的。這只是\n我的個人意見，如果你讀它，COOL! 如果沒有，cool!\n\nP.S.我一頭扎進股市，原因只有一個，就是......",
      "title": "我已經意識到，一個股票有這樣的波動性，遊戲停止不給一個FLYING F*CK（光滑的大腦 - 星代表一個U）的技術分析!"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "最初に言っておきますが、これは経済的なアドバイスではありません 私たちは皆、良い意味でのギャンブル\nのです（先生、ここはカジノです）。wallstreetBETSと呼ばれているのには理由があります。これは単に\nこれは単に私の個人的な意見であり、もしあなたがそれを読んだなら、COOL! そうでなければ、COOL!\n\nP.S. 私が株式市場に真っ先に飛び込んだ理由はただ一つ、理由はただ一つ...。",
      "title": "私は、Game stopのようなボラティリティの高い銘柄は、テクニカル分析についてFLYING F*CK（スムーズな頭脳-星はUを表す）をしないということに気がつきました。"
    }
  ],
  "title": "I have come to the realization that a stock with this amount of volatility that Game stop has does not give a FLYING F*CK (smooth brains - the star represents a U) about Technical Analysis!",
  "created_utc": 1617696373,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>First off, this is not financial advice! We are all gambling for goodness sake (sir, this is a casino). It&#39;s called wallstreetBETS for a reason. This is simply my personal opinion and if you read it, COOL! If not, COOL!</p>\n\n<p>P.S. I dove head first into the stock market for one reason and one reason only, TO MAKE MONEY! And honestly, I haven&#39;t done that at all so I know I belong here! But without further ado:</p>\n\n<p>There are two types of people, 1) people who can effectively analyze the technicals of a stock like GME and 2) liars. There is no way any of you mother effers can account for the volatility of this stock, the amount of holders, the true short interest, and momentum. So take whatever you learned from your little youtube video or on investopedia about your cute Elliott wave theory, fibonacci retracement, and MY FAVORITE &quot;do you see that cup and handle formation,&quot; no I don&#39;t you idiot, it&#39;s like looking at the dam clouds, you can create anything with an imagination! The reason I can say this so confidently is because I was one of the retards that thought I could analyze the stock with my tools only to find out I was wrong every time! I mean I hit some targets, but where there was supposed to be support it fell, where there was supposed to be resistance it broke through, there is no telling where the thing is going (hopefully up). Rather than focusing on the technicals instead I have been paying attention to trends.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/mrajg8l1igr61.png?width=1440&amp;format=png&amp;auto=webp&amp;s=e5e0350d9dddf0ce4fc172955e2d46dc76bde047\">I even color coded this bihh for you. Shout out to kidsdoodle .net for the help!</a></p>\n\n<p><strong>12/23/20 - 1/12/21:</strong></p>\n\n<p>Price consolidated around $16 - $22 only to advance up to *<strong>$43.40!</strong></p>\n\n<p><strong>1/15/21 - 1/22/21:</strong></p>\n\n<p>Price consolidated around $35 - $45 only to advance up to $481.19!</p>\n\n<p><strong>2/4/21 - 2/24/21:</strong></p>\n\n<p>Price consolidated around <strong>*$40 - $60</strong> only to advance up to **<strong>$182.49!</strong></p>\n\n<p><strong>3/1/21 - 3/4/21:</strong></p>\n\n<p>Price consolidated around $110 - $130 only to advance up to $346.74!</p>\n\n<p><strong>Present:</strong></p>\n\n<p>Price is consolidating around **<strong>$170 - $200</strong> only to advance up to x!</p>\n\n<p>Hopefully you retards can comprehend what I am trying to illustrate here. I mean it&#39;s pretty simple, price bounces around a certain price then breaks out (up in this case), then corrects (goes down), then repeats. Notice how some of the highs tend to become support where the price consolidates (stays in a specific range). All I know is that I am pretty happy with the price hanging around the $180 - $200 range or even lower because that seems to becoming a nice support level. Who knows what could happen, let&#39;s just hope history repeats itself. I just like the stock and I get excited when bollinger bands squeeze (the white lines)! </p>\n\n<p><strong>TL;DR:</strong></p>\n\n<p>It&#39;s not even long, read it!</p>\n</div><!-- SC_ON -->",
  "score": 8182,
  "permalink": "/r/wallstreetbets/comments/ml0bsy/i_have_come_to_the_realization_that_a_stock_with/",
  "subreddit": "wallstreetbets",
  "id": "ml0bsy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961882755
}