{
  "author": "habitual_low_life",
  "original_created_utc": 1637952975,
  "title": "Put your money where your mouth is and buy the dip",
  "created_utc": 1637969450,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Just about everything is down now, people are panic selling due to the new Covid news out of South Africa and to pull money out for Black Friday sales or the Holidays. <strong>Every</strong> post here about crashes, dips, corrections, or whatever you want to call it is met with some version of &quot;buy the dip&quot; from multiple people (including myself).</p>\n\n<p>I had some thoughts about things I&#39;ve been needing to buy or gifts for other people but I don&#39;t even know if I can bring myself to buy any of them when all I want to do is double down on anything I&#39;ve gone in on recently and lower my DCAs. It might keep going down or it might be the bottom for a while. Either way, it&#39;s time for you to make good on those comments.</p>\n\n<p>Who else is buying the dip?</p>\n</div><!-- SC_ON -->",
  "score": 171,
  "permalink": "/r/CryptoCurrency/comments/r2u6df/put_your_money_where_your_mouth_is_and_buy_the_dip/",
  "subreddit": "CryptoCurrency",
  "id": "r2u6df",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Just about everything is down now, people are panic selling due to the new Covid\nnews out of South Africa and to pull money out for Black Friday sales or the\nHolidays. Every post here about crashes, dips, corrections, or whatever you want\nto call it is met with some version of \"buy the dip\" from…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "現在、ほぼすべてのものが下落しています。人々は、南アフリカで発生した新しいCovid\nのニュースでパニックになり、ブラックフライデーセールやホリデーシーズンに向けて資金を引き出そうとしています。\n祝日。暴落、ディップ、修正、あるいは何と呼んでもいいが、ここでのすべての投稿には、「ディップを買え」というバージョンがある。\nこのサイトでは、暴落、ディップ、修正、あるいは何と呼んでもいいのですが、「ディップを買え」という言葉が出てきます。",
      "title": "お金を出してディップを買おう"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "现在几乎所有东西都在下跌，人们因新的Covid而恐慌性抛售。\n的消息而恐慌性抛售，并为黑色星期五的销售或假期而拔出资金。\n假期。这里的每一个关于崩盘、下跌、修正或任何你想说的帖子\n都会遇到一些版本的 \"买入下跌\"，来自...",
      "title": "把你的钱放在你的嘴边，买下这块蛋糕。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "現在幾乎所有東西都在下跌，人們因新的Covid而恐慌性拋售。\n的消息而恐慌性拋售，併爲黑色星期五的銷售或假期而拔出資金。\n假期。這裏的每一個關於崩盤、下跌、修正或任何你想說的帖子\n都會遇到一些版本的 \"買入下跌\"，來自...",
      "title": "把你的錢放在你的嘴邊，買下這塊蛋糕。"
    }
  ]
}