{
  "author": "kadudu888",
  "original_created_utc": 1631375827,
  "title": "Would Bitcoin have prevented government funding of $2,000,000,000,000 USD on the Afgan War after 911?",
  "created_utc": 1631392711,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Thats $300 million USD, every day, for 20 years.</p>\n\n<p>I am not sure what exactly have been accomplished but if the money was spent elsewhere in area such as schooling, hospital or even scientific research, instead of waging war perhaps we all would be in a better place.</p>\n\n<p>Part of this is to do with how the Afgan war is actually a business as the public US fiscal budget is paid to numerous private contractors and mercs for war supply (eg. As explained in Dog of Wars), which ties to further R&amp;D for even more deadly weapons to be used for killing in future wars.</p>\n\n<p>Should part of the Bitcoin movement be to separate the power of money control from the government, so the financial ability to wage war is reduced, to save lives and create a better world with less military conflict?</p>\n\n<p>This needs to be put to a stop by Bitcoin, otherwise when will this ever end?</p>\n</div><!-- SC_ON -->",
  "score": 164,
  "permalink": "/r/Bitcoin/comments/pm9xap/would_bitcoin_have_prevented_government_funding/",
  "subreddit": "Bitcoin",
  "id": "pm9xap",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Thats $300 million USD, every day, for 20 years.\n\nI am not sure what exactly have been accomplished but if the money was spent\nelsewhere in area such as schooling, hospital or even scientific research,\ninstead of waging war perhaps we all would be in a better place.\n\nPart of this is to do with how…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "3億ドルを20年間、毎日使い続けることになります。\n\n具体的に何が達成されたのかはわかりませんが、もしそのお金が学校や病院、さらには科学研究など、他の分野に使われていたら\n学校教育や病院、あるいは科学研究など、他の分野に使われていたのではないでしょうか。\nもし、そのお金が戦争をする代わりに、学校や病院、あるいは科学研究などの分野に使われていたら、私たちはもっと良い場所にいたかもしれません。\n\nその理由の1つは、...",
      "title": "ビットコインがあれば、911の後、アフガン戦争に20億ドルもの政府資金が投入されるのを防げたでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "那是3亿美元，每天都有，持续20年。\n\n我不确定到底取得了什么成就，但如果这些钱花在其他地方，如学校、医院甚至是科学研究上\n在其他领域，如学校、医院或甚至科学研究。\n而不是发动战争，也许我们都会有一个更好的地方。\n\n这其中有一部分是与如何...",
      "title": "比特币会阻止政府在911事件后为阿富汗战争提供2,000,000,000美元的资金吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "那是3億美元，每天都有，持續20年。\n\n我不確定到底取得了什麼成就，但如果這些錢花在其他地方，如學校、醫院甚至是科學研究上\n在其他領域，如學校、醫院或甚至科學研究。\n而不是發動戰爭，也許我們都會有一個更好的地方。\n\n這其中有一部分是與如何...",
      "title": "比特幣會阻止政府在911事件後爲阿富汗戰爭提供2,000,000,000美元的資金嗎？"
    }
  ]
}