{
  "author": "Dwez1337",
  "original_created_utc": 1634395402,
  "title": "Bank blocks whole Account because of Crypto Transaction and Freezes All Money, Saying Crypto would not be Welcome",
  "created_utc": 1634442000,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>(This happened to <a href=\"/u/kundeistkoenig\">u/kundeistkoenig</a>, translated by me into English # Comdirect is a German bank operated by Commerzbank)</p>\n\n<p>After my EC card was unexpectedly rejected in the supermarket yesterday, there was mail from Comdirect in the mailbox today:</p>\n\n<p>Cancellation of the entire account with two months notice.</p>\n\n<p>This comes as a surprise, as I have been a customer there for six years, have never had an overdraft and have used my account and credit card very actively.</p>\n\n<p>So I called them directly and asked about it. The woman on the phone then finally admitted, after some initial phrases, that the cancellation took place because I had received transfers from a crypto exchange (Kraken) in recent weeks and this was undesirable.</p>\n\n<p>Super. It&#39;s legal, but puts everyone under general suspicion who has something to do with crypto.</p>\n\n<p>But the best was yet to come. When I wanted to transfer the credit to an account at another institution after the phone call, the transfer was rejected with the note that it was blocked, I should contact customer service.</p>\n\n<p>So I called them again, this time with much more anger. Now a man on the phone, he told me that it was strange that transfers are blocked, since the cancellation actually only takes effect at the end of December. </p>\n\n<p>He can now only arrange a check, which will take a week. The best thing for me to do is to write a letter asking him to transfer the money to an external account.</p>\n\n<p>Fantastic. I get my account cancelled without warning. I make a fool of myself at the supermarket because my card is declined. And now I have to write a letter to an online bank asking them to pay out my balance.</p>\n\n<p>I am really stunned. comdirect is holding a five-digit amount hostage and refers me to writing a letter.</p>\n\n<p>If I didn&#39;t have other accounts, I would be pretty much screwed right now. At least I can pay my rent and buy something to eat.</p>\n\n<p>Next week, I will pass the whole thing on to a lawyer, consumer protection, BaFin (Germanys top financial watchdog) and maybe a newspaper.</p>\n</div><!-- SC_ON -->",
  "score": 195,
  "permalink": "/r/CryptoCurrency/comments/q9dcz1/bank_blocks_whole_account_because_of_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "q9dcz1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "(This happened to u/kundeistkoenig [/u/kundeistkoenig], translated by me into\nEnglish # Comdirect is a German bank operated by Commerzbank)\n\nAfter my EC card was unexpectedly rejected in the supermarket yesterday, there\nwas mail from Comdirect in the mailbox today:\n\nCancellation of the entire…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "(これは、私が翻訳したu/kundeistkoenig [/u/kundeistkoenig]に起こったことです。\n英語 # Comdirect は Commerzbank が運営するドイツの銀行です)\n\n昨日、スーパーでECカードが思いがけず拒否された後、以下のようなメールがありました。\n今日のポストにはコムダイレクトからの郵便物が入っていました。\n\n全額キャンセル。",
      "title": "銀行が暗号取引を理由に口座全体をブロックし、暗号は歓迎されないと言って全資金を凍結"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "(这发生在u/kundeistkoenig [/u/kundeistkoenig]身上，由我翻译为\n英语# Comdirect是一家由德国商业银行经营的德国银行)\n\n昨天我的EC卡在超市里意外地被拒绝后，邮箱里出现了Comdirect的邮件。\n今天邮箱里收到了Comdirect公司的邮件。\n\n取消了整个...",
      "title": "银行因加密货币交易而封锁整个账户并冻结所有资金，称不欢迎加密货币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "(這發生在u/kundeistkoenig [/u/kundeistkoenig]身上，由我翻譯爲\n英語# Comdirect是一家由德國商業銀行經營的德國銀行)\n\n昨天我的EC卡在超市裏意外地被拒絕後，郵箱裏出現了Comdirect的郵件。\n今天郵箱裏收到了Comdirect公司的郵件。\n\n取消了整個...",
      "title": "銀行因加密貨幣交易而封鎖整個賬戶並凍結所有資金，稱不歡迎加密貨幣"
    }
  ]
}