{
  "author": "magiye1747",
  "original_created_utc": 1630675219,
  "title": "Stop believing all the crypto influencers, please.",
  "created_utc": 1630730646,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I work in a crypto company that deals with marketing. That&#39;s all i can say. But after working there for a few months, I just had to tell people this: take everything your favourite youtuber says with a grain of salt. Here&#39;s why:</p>\n\n<p>Crypto marketing companies have all the crypto influencer database in the world. Your favourite crypto youtuber? 100% on that list with a price tag next to his name and conditions written &quot;Can promote anything&quot;, &quot;I&#39;ll say it&#39;s unpaid promotion, I just love the brand- give me double money for that&quot;. And I only got shocked after watching how much these companies pay these guys(including crypto journalists, sites, twitter, youtuber, all platforms basically). They get how much an entry level graduate gets in a year in 1 fricking video promotion. I saw a particular youtuber&#39;s name and price and truly don&#39;t blame them for being corrupt anymore. That much money would make me question my ethics too haha(you can guess in comments, they are very popular).</p>\n\n<p>I&#39;m making this post because I&#39;ve worked for clients and these influencers who have been scummy to their audience in the past(and continue to be). And their audience still falls for it and it&#39;s truly sad to see.</p>\n\n<p>So yeah, I&#39;m not trying to say &quot;don&#39;t watch them because they&#39;re sponsored&quot; because they obviously need money. This sponsoring shit is on all social media platforms for every product but it&#39;s just more scummy in crypto because the audience instantly buys what the youtuber says. If it was something like honey or dairy products being recommended, you wont go ahead and buy it right then. But you would in crypto.</p>\n\n<p>My point is: don&#39;t watch them blindly, keep your eyes and ears sharp. This is how many scams start. Again, not saying that your favourite influencer is promoting a scam, but never fully trust someone. We&#39;re in a cryptocurrency sub after all.</p>\n\n<p>(yes, I&#39;m using an anonymous account for my protection. yes, i&#39;ve hidden my ip as well because i&#39;m a bit paranoid. yes, i just made a throwaway account and earned 1.2k karma just to post here to inform you guys. i made it a while back and wanted to post here but the karma requirement didnt allow me to)</p>\n\n<p>edit: didn&#39;t expect so many people seeing this, but thank you for the awards :) I just wanted to say that if you&#39;re doubting in your mind even for a second &quot;is abc also sponsored to shill shit projects?&quot;, you probably shouldnt be watching that person. </p>\n\n<p>And for the people saying dont watch crypto content etc, I feel like one can learn to filter out the sponsored shit out and still take in that valuable info. For eg, I watch crypto youtubers for the knowledge they provide and how easily it&#39;s understandable. I filter out their bias. When I&#39;m done watching the video, I get a rough &quot;idea&quot; what it is. I dont form my opinion on it till then. Now DYOR. Now you&#39;ll find research to be easier. </p>\n\n<p>Also try to find some negative stuff on it as well so you know everything about it. Don&#39;t be fooled by Google&#39;s algorithm, use duckduckgo or google in incognito/startpage. </p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/ph50qz/stop_believing_all_the_crypto_influencers_please/",
  "subreddit": "CryptoCurrency",
  "id": "ph50qz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I work in a crypto company that deals with marketing. That's all i can say. But\nafter working there for a few months, I just had to tell people this: take\neverything your favourite youtuber says with a grain of salt. Here's why:\n\nCrypto marketing companies have all the crypto influencer database in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はマーケティングを扱う暗号会社で働いています。私が言えるのはそれだけです。しかし\n数ヶ月間働いてみて、私は人々にこう言わざるを得ませんでした。\n好きなユーチューバーの言うことには大目に見てください。理由はこうです。\n\n暗号マーケティング会社は、すべての暗号インフルエンサーのデータベースを...",
      "title": "暗号のインフルエンサーをすべて信じるのはやめてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在一家加密货币公司工作，从事营销工作。我只能这么说。但是\n在那里工作了几个月后，我不得不告诉人们：对你最喜欢的优酷网友所说的一切\n你最喜欢的优酷网友说的每一句话都要慎之又慎。这就是原因。\n\n隐匿式营销公司拥有所有的隐匿式影响者数据库。",
      "title": "请不要再相信所有加密货币的影响者了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在一家加密貨幣公司工作，從事營銷工作。我只能這麼說。但是\n在那裏工作了幾個月後，我不得不告訴人們：對你最喜歡的優酷網友所說的一切\n你最喜歡的優酷網友說的每一句話都要慎之又慎。這就是原因。\n\n隱匿式營銷公司擁有所有的隱匿式影響者數據庫。",
      "title": "請不要再相信所有加密貨幣的影響者了。"
    }
  ]
}