{
  "author": "ChefStamos",
  "the_new_excerpt": "The year was 2019. I was convinced that in two years at the latest we'd all be\neating cockroaches. They're a good source of protein, environmentally friendly,\nthey're crunchy, you can make bread with them, and cockroaches are fuckin\nsturdy. Nuclear war? No problem. The cockroaches give zero fucks.…",
  "original_created_utc": 1621881600,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "時は2019年。遅くても2年後には、私たちは皆、ゴキブリを食べていると確信しました。\nゴキブリを食べているだろうと確信しました。ゴキブリは良質なタンパク源だし、環境にも優しい。\nカリカリしていて、パンも作れるし、ゴキブリはめちゃくちゃ頑丈だ。\n頑丈だ。核戦争？問題ありません。ゴキブリはクソの役にも立たない....",
      "title": "ゴキブリ先物のおかげで経済的に破綻し、人生が地獄になってしまった。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这一年是2019年。我相信，最迟在两年内，我们都将成为\n吃蟑螂。它们是蛋白质的良好来源，对环境友好。\n它们很脆，你可以用它们做面包，而且蟑螂还很他妈的\n坚固的。核战争？没问题。蟑螂不屑一顾....",
      "title": "由于蟑螂期货，我在经济上被毁了，我的生活是地狱。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這一年是2019年。我相信，最遲在兩年內，我們都將成爲\n喫蟑螂。它們是蛋白質的良好來源，對環境友好。\n它們很脆，你可以用它們做麪包，而且蟑螂還很他媽的\n堅固的。核戰爭？沒問題。蟑螂不屑一顧....",
      "title": "由於蟑螂期貨，我在經濟上被毀了，我的生活是地獄。"
    }
  ],
  "title": "I am financially ruined and my life is hell thanks to cockroach futures",
  "created_utc": 1621914798,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The year was 2019.  I was convinced that in two years at the latest we&#39;d all be eating cockroaches.  They&#39;re a good source of protein, environmentally friendly, they&#39;re crunchy, you can make bread with them, and cockroaches are fuckin sturdy.  Nuclear war?  No problem.  The cockroaches give zero fucks.  It&#39;s a hedge against nuclear war.  Guns, ammo, and cockroaches are what you want to have when we devolve into mad max.</p>\n\n<p>So I yolo&#39;d my life savings into cockroach futures exp. last month, and until last month I was up 400% but I didn&#39;t fuckin sell.  My wife&#39;s boyfriend told me to, and I told him that I was a human being and had dignity.  That&#39;s not strictly true and my voice cracked a little when I said it, but I think it worked cause he left me alone.  </p>\n\n<p>And then the fuckin cicadas came.  Not a problem, right?  That happens reliably on 17 year cycles, should be priced in.  Except that they came <em>early</em>.  Nobody&#39;s talking about this but everyone in the cockroach community knows.  The rats have been feasting on these things.  It only takes them three weeks to breed.  And since the rat population is already booming, you retards can do the math.  Oh christ, they&#39;re going to be everywhere.  I already see them lurking in the grass.  We&#39;re all going to die getting torn to shreds by an army of cicada-juiced rats.  </p>\n\n<p>You know what else rats eat?  Cockroaches.  So absolutely nobody would buy my futures and I had to take delivery of literal tons of cockroaches.  My wife and my wife&#39;s boyfriend left me at this point because I had not a penny to my name.  And you&#39;d think they&#39;d deliver &#39;em dead, right?  Nope!  Now I have literal tons of cockroaches crawling around my house and as a bonus they&#39;re attracting more rats cause apparently I&#39;m not the only one who thinks they&#39;re a good source of protein.  And now since I have no money to buy food, I&#39;ve been reduced to hunting my own cockroaches to eat them and I have to compete with this dumb fuckin rats.  </p>\n\n<p>Then my neighbors started to notice my little predicament and reported me to the authorities, so now my house has been condemned.  </p>\n\n<p>tl;dr I&#39;m broke, I&#39;m starving, my house is gone, and I&#39;m probably gonna get eaten by rats.  Never, ever buy cockroach futures.</p>\n</div><!-- SC_ON -->",
  "score": 3157,
  "permalink": "/r/wallstreetbets/comments/nk4z03/i_am_financially_ruined_and_my_life_is_hell/",
  "subreddit": "wallstreetbets",
  "id": "nk4z03",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197392070
}