{
  "author": "M00OSE",
  "the_new_excerpt": "The first and only rule of persuading people to invest in cryptocurrencies is\ndon’t.\n\nWe all want this community and the market to grow. I also understand that you\nwant your friends and family to catch this golden opportunity. But persuading\nthem to put their money in something they’re uncommitted…",
  "original_created_utc": 1619700831,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号通貨に投資するよう人々を説得するための最初で唯一のルールは\nしないことです。\n\n私たちは皆、このコミュニティと市場の成長を望んでいます。また、あなたが\nまた、あなたの友人や家族にこのゴールデンチャンスを掴んでもらいたいという気持ちもわかります。しかし、彼らを説得して\n説得してお金を入れてもらうのは",
      "title": "大声で友人や家族に暗号への投資を勧めるのはやめよう"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "劝说人们投资加密货币的第一条也是唯一一条规则是\n不要。\n\n我们都希望这个社区和市场能够成长。我也明白，你\n希望你的朋友和家人能抓住这个黄金机会。但是劝说\n劝说他们把钱放在他们没有承诺的东西上......",
      "title": "看在上帝的份上，不要再告诉你的朋友和家人去投资加密货币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "勸說人們投資加密貨幣的第一條也是唯一一條規則是\n不要。\n\n我們都希望這個社區和市場能夠成長。我也明白，你\n希望你的朋友和家人能抓住這個黃金機會。但是勸說\n勸說他們把錢放在他們沒有承諾的東西上......",
      "title": "看在上帝的份上，不要再告訴你的朋友和家人去投資加密貨幣。"
    }
  ],
  "title": "For the crying out loud, stop telling your friends and family to invest in crypto",
  "created_utc": 1619713831,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The first and only rule of persuading people to invest in cryptocurrencies is <strong>don’t</strong>.</p>\n\n<p>We all want this community and the market to grow. I also understand that you want your friends and family to catch this <em>golden opportunity</em>. But persuading them to put their money in something they’re uncommitted to, <strong>leads to FUD and paper hands</strong>.</p>\n\n<p>Understand that telling them, “I earned X amount in X days” translates to “[you could’ve] earned X amount in X days [but didn’t].” In their minds. <strong>You’re leveraging their fear of missing out</strong>. Trust me, I would’ve loved to take the leap of faith back in 2016 when I found out about crypto. I didn’t and I’m okay with that because, this year, I took the opportunity. Today, I live with missing out on those gains because it was the logical decision for me <em>then</em>. So let them decide what’s logical to them <em>now</em><strong>.</strong></p>\n\n<p>If you’re itching to share, then talk about it like a passion or hobby. Share the fundamentals: what it’s trying to solve; how it made an impact; what you’ve learned: what you’re excited about, share the good and the bad. Most of all, share with <strong>zero expectations</strong> that they’ll invest or even care. </p>\n\n<p>If you really believe in the value of cryptocurrency—the gains, opportunities, tech, and values—then let it speak for itself. It doesn’t need evangelists, it isn’t a religion; it’s a show, so grab your popcorn and sit the hell down!</p>\n</div><!-- SC_ON -->",
  "score": 9145,
  "permalink": "/r/CryptoCurrency/comments/n13oql/for_the_crying_out_loud_stop_telling_your_friends/",
  "subreddit": "CryptoCurrency",
  "id": "n13oql",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380959899
}