{
  "author": "kjd12345678900",
  "original_created_utc": 1628371709,
  "title": "22% of all USD that has ever existed was printed in 2020, that's why I got into crypto",
  "created_utc": 1628385048,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I got into crypto this past January when I realized that the federal reserve could casually print 9 trillion dollars in a single year. No regard for how that will effect the economy, no regard to how that will effect the prices of every day things or inflation. And the worst part is that nobody in Congress seems to give a damn because they&#39;re old enough where they&#39;re not going to live to see the consequences of their actions and effects it will have on the younger generations. </p>\n\n<p>So yes I&#39;m in it for the money, but I&#39;m also in it to try and escape a very broken system that I believe is going to collapse within my lifetime.</p>\n\n<p>*Edit: I have been informed via the comments that it was 22% of the circulating supply of USD, not all USD ever printed. However, the point I&#39;m trying to make with this post still stands, 9 trillion dollars printed in one year is completely insane and not sustainable.</p>\n</div><!-- SC_ON -->",
  "score": 174,
  "permalink": "/r/CryptoCurrency/comments/p01s3g/22_of_all_usd_that_has_ever_existed_was_printed/",
  "subreddit": "CryptoCurrency",
  "id": "p01s3g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I got into crypto this past January when I realized that the federal reserve\ncould casually print 9 trillion dollars in a single year. No regard for how that\nwill effect the economy, no regard to how that will effect the prices of every\nday things or inflation. And the worst part is that nobody in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が暗号化を始めたのは、今年の1月に連邦準備銀行が気軽に9兆ドルを印刷できることに気づいたからです。\n1年で9兆ドルを気軽に印刷できることに気づいたからです。それがどのようなものかは気にしていません。\nそれが経済にどう影響するのか、毎日の価格にどう影響するのか、そんなことはお構いなしです。\nインフレになることもありません。そして最悪なのは、誰も...",
      "title": "これまでに存在した米ドルの22％が2020年に印刷された、だから私は暗号に参加した"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今年1月，当我意识到美联储可以在一年内随意印制9万亿美元时，我开始接触加密货币。\n可以在一年内随意印制9万亿美金。没有考虑到这将如何\n不考虑这将如何影响经济，不考虑这将如何影响每天的商品价格。\n日用品的价格或通货膨胀。而最糟糕的是，没有人在...",
      "title": "有史以来所有美元的22%是在2020年印刷的，这就是我进入加密货币的原因。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今年1月，當我意識到美聯儲可以在一年內隨意印製9萬億美元時，我開始接觸加密貨幣。\n可以在一年內隨意印製9萬億美金。沒有考慮到這將如何\n不考慮這將如何影響經濟，不考慮這將如何影響每天的商品價格。\n日用品的價格或通貨膨脹。而最糟糕的是，沒有人在...",
      "title": "有史以來所有美元的22%是在2020年印刷的，這就是我進入加密貨幣的原因。"
    }
  ]
}