{
  "author": "saffron1990",
  "the_new_excerpt": "There’s a lot of mania and hype at the moment and people seem to think a crash\nis around the corner. They think we’ve peaked too quickly and a 2017 crash is\ncoming but we’re a long way away from that in my opinion.\n\nWhat people don’t understand is the mania around doge is irrelevant in relation\nto…",
  "original_created_utc": 1620651209,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "現在、多くのマニアや誇大広告があり、人々は暴落が近いと考えているようです。\nが迫っていると考えているようです。ピークを迎えるのが早すぎて、2017年に暴落が起こると考えているようです。\nしかし、私に言わせれば、それにはまだまだ時間がかかると思います。\n\n人々が理解していないのは、ドージェのマニアックさは、次のこととは無関係だということです。\nとは無関係だということです...",
      "title": "ビットコインは約3ヶ月間、50円台で固まっています。これがどれだけ強気なのか、人々は知らない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "目前有很多的狂热和炒作，人们似乎认为崩溃\n是在拐角处。他们认为我们已经达到了顶峰，2017年的崩溃即将到来\n但在我看来，我们离这个目标还有很远的距离。\n\n人们不明白的是，围绕多哥的狂热与以下方面无关\n与...",
      "title": "比特币已经在50的位置盘整了近3个月。人们不知道这有多牛逼。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "目前有很多的狂熱和炒作，人們似乎認爲崩潰\n是在拐角處。他們認爲我們已經達到了頂峯，2017年的崩潰即將到來\n但在我看來，我們離這個目標還有很遠的距離。\n\n人們不明白的是，圍繞多哥的狂熱與以下方面無關\n與...",
      "title": "比特幣已經在50的位置盤整了近3個月。人們不知道這有多牛逼。"
    }
  ],
  "title": "Bitcoin has been consolidating in the 50’s for almost 3 months. People have no idea how bullish this is.",
  "created_utc": 1620661621,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There’s a lot of mania and hype at the moment and people seem to think a crash is around the corner. They think we’ve peaked too quickly and a 2017 crash is coming but we’re a long way away from that in my opinion.</p>\n\n<p>What people don’t understand is the mania around doge is irrelevant in relation to the market. Doge has very little influence in the market. </p>\n\n<p>The only coin that really matters is bitcoin. It controls the price of all coins because they are paired together. When bitcoin crashes everything crashes. If doge crashes nothing happens. </p>\n\n<p>The only mania you have to worry about is in bitcoin. It doesn’t matter what happens with the other coins. In 2017 bitcoin tripled in a month before crashing. It basically did a doge and then crashed. </p>\n\n<p>This is why we’re not going to crash anytime soon. Bitcoin will crash after a manic phase, not after a consolidation phase. All we’ve been doing for the last 3 months is slowly building support for the next leg up. The strong hands are still buying and exchanges are still seeing large outflows or bitcoin. </p>\n\n<p>Things have really looked this bullish in bitcoins history.</p>\n</div><!-- SC_ON -->",
  "score": 4282,
  "permalink": "/r/CryptoCurrency/comments/n93qcr/bitcoin_has_been_consolidating_in_the_50s_for/",
  "subreddit": "CryptoCurrency",
  "id": "n93qcr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985992420
}