{
  "author": "cr0ne",
  "the_new_excerpt": "Having lived through a few bear markets, wanted to share how I'm positioning\nmyself for future headwinds:\n\n * The Federal reserve can no longer significantly raise rates without\n   threatening solvency of US treasuries.\n\n * Big tax increases (corporate, wealth, and estate) are now political fair…",
  "original_created_utc": 1614459185,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "经历过几次熊市，想分享一下我是如何定位的。\n我自己也是为了应对未来的逆风。\n\n *美联储不能再不经意间大幅提高利率了\n   威胁到美国国债的偿付能力。\n\n * 大幅增税（企业税、财富税和遗产税）现在是政治公平......",
      "title": "潜在的失去十年来。躲在哪里"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "經歷過幾次熊市，想分享一下我是如何定位的。\n我自己也是爲了應對未來的逆風。\n\n *美聯儲不能再不經意間大幅提高利率了\n   威脅到美國國債的償付能力。\n\n * 大幅增稅（企業稅、財富稅和遺產稅）現在是政治公平......",
      "title": "潛在的失去十年來。躲在哪裏"
    }
  ],
  "title": "Potential lose decade coming: Where to hide",
  "created_utc": 1614520558,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Having lived through a few bear markets, wanted to share how I&#39;m positioning myself for future headwinds:</p>\n\n<ul>\n<li><p>The Federal reserve can no longer significantly raise rates without threatening solvency of US treasuries.</p></li>\n<li><p>Big tax increases (corporate, wealth, and estate) are now political fair game to deal with a mountain of government debt and income inequality.</p></li>\n<li><p>A sizable portion of the S&amp;P 500 is sitting on nearly dot-com era price/sales ratios. Newbie investors do not realize that chasing after returns in early growth industries has not historically paid off for anyone other than very early investors (see what happened to Amazon, Cisco, Microsoft 1998-2002). </p></li>\n<li><p>Many new disruptive technologies are actually going to deflate &amp; shrink industry profits, rather than increase. EVs for example will kill the car maintenance business, and they are actually easier to make (lower barrier of entry) than gas-engine cars.</p></li>\n<li><p>Mutual funds are now seeing systemic outflows due to baby boomers retiring. </p></li>\n<li><p>Contrary to popular belief, index funds are not certainly guaranteed to go up. See Europe or Japanese lost decades.</p></li>\n</ul>\n\n<p>In light of this, I present where I am focusing my equity allocation: </p>\n\n<p>&nbsp;</p>\n\n<p><strong>Climate Change Value</strong></p>\n\n<p>While I would love to invest entirely in core renewables (wind, batteries, solar), I hate to say that I cannot do so due to their present valuations. Instead, I would like to point out a few sectors that are under appreciated:</p>\n\n<ul>\n<li><p>Regulated Utilities: Utilities have been beaten up over the last year, even as rates have decreased. Further, I expect that they will be given incentives to clean up their grid. Note that they will have some immunity to increases in corporate tax rates, as public utilities often pass some of these costs through to their customers.</p></li>\n<li><p>Natural gas: There is no credible math that natural gas demand will decline in the next 10-15 years. If anything, we need more as coal is replaced and EV vehicles require more electricity. Expect a double-down on investments to run natural gas with fewer carbon emissions.</p></li>\n<li><p>Property reinsurance: Climate change will bring more natural disasters...and while these will cause short term damage to insurance companies, it ultimately  will result in a bigger market as well as higher rates. </p></li>\n<li><p>Food: Look for chicken, eggs, plant products as they are significantly more climate friendly than beef/pork. Look past &#39;Beyond Meat&#39; and instead for established companies at fair valuations.</p></li>\n</ul>\n\n<p>&nbsp;</p>\n\n<p>My utility picks: AEP (top pick), AEE, AES, EXC, DTE, CMS. Avoid companies with wildfire risk or a politically unfriendly atmosphere. </p>\n\n<p>My reinsurance picks: RNR, Y</p>\n\n<p>My natural gas picks: WMB, NI</p>\n\n<p>My food picks: INGR, SAFM, CALM</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Anti-Growth</strong></p>\n\n<p>What is &quot;anti-growth&quot;? Stocks in industries that are shrinking. Why anyone would want to hold one of these, it&#39;s simply because of limited downside IF we are in fact in a valuation bubble. The game is to bleed these companies out for their last remaining dividends. Example: if a company has a half-life of 15 years, but dividend pays out 8%..you still come out decently ahead even if NAV shrinks 50% over that time. It&#39;s a bonus if the company can turn around their boat from decline to growth but not necessary.</p>\n\n<p>My picks: Tobacco industry (MO, PM, BTI), health retail (WBA, CVS), mid-stream oil transport (MMP, ENB, TRP). </p>\n\n<p>&nbsp;</p>\n\n<p><strong>Emerging Markets</strong></p>\n\n<p>This has potential to be the long term money maker. Let&#39;s face it however...emerging market and especially China accounting standards are trash. They lie, and they do not consider it cheating, they think they are being &quot;clever&quot;. This is not all too different from where the US was many years ago however. I&#39;m betting that as emerging markets continue to develop, then there should also be small yet steady improvements in their accounting standards, transparency, and valuations. This will require time and patience. </p>\n\n<p>My ETF picks: </p>\n\n<ul>\n<li><p>AVEM (instead of VWO) for a moderate tilt towards fundamentals without any major sector bets. The ETF is run by a smart group of folks (Avantis), many of them formerly from DFA advisors.</p></li>\n<li><p>DGS: By only holding small companies, this ETF is able to avoid the lofty valuations of China&#39;s big tech darlings. Small companies are more likely able to hide under the radar of government control, and are well poised to take advantage of organic domestic growth that will be happening across the Emerging sphere. Further, the dividend strategy lowers risk of fraud, as you cannot easily &quot;fake&quot; dividends.</p></li>\n</ul>\n\n<p>&nbsp;</p>\n\n<p><strong>Conflict Hedge</strong></p>\n\n<p>China represents roughly half of the Emerging Market portfolio. With Chinese exports equal to about 7% of US GDP, any conflict is extremely unlikely, yet with so much $$$ invested in non-free countries, I am obliged to hedge my bets with a few holdings that will do well in the case of a Cold War 2 or Taiwan-China conflict. My rule of thumb is $1 of conflict hedge for every $5 in China exposure. Individual stock picks are my preference of choice here.</p>\n\n<ul>\n<li><p>Arms race stocks: Stay away from IT contracting or ship building, the game here is to invest in companies that will benefit most from a high-tech arms race with China. Unmanned air/sea and hyper-sonic are the future.</p></li>\n<li><p>Domestic materials: Stocks that have been beaten down due to Chinese exports.</p></li>\n</ul>\n\n<p>My picks: LMT, NOC, LHX, EAF</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Developed Ex-US Markets</strong></p>\n\n<p>Provides some insulation from US stock valuations and future corporate tax increases. Europe in particular gets to play neutral in any future US vs China disputes.</p>\n\n<p>ETF picks: VEA as core. AVDV for a small value tilt. </p>\n\n<p>Individual picks: I&#39;ve got a few big bets on UK healthcare companies that are hurting due to Covid fallout. SNN in particular makes about 1/3 of their revenue in sports medicine and they have been reeling.</p>\n\n<p>&nbsp;</p>\n\n<hr/>\n\n<p>A special note on max draw downs and risk. When there is a market crash, EVERYTHING goes down. This portfolio will not evade that. Frankly, I don&#39;t care about another 2008 or 2020 crash event (30-60% crash) so long as it recovers within a 10 year time frame. My objective is to reduce the probability of a lost decade(s) ala Japan 1990-2010, or a loss that is not recoverable at all. All that said...no promises. I am not a financial advisor, so I must say that this is not financial advice. This is simply how I am investing my money currently, and even so it only represents my &quot;risk-on&quot; portion of my savings. I have the other half of my savings in relatively riskless assets (FDIC insured CDs, etc.) or lower risk assets (low duration bonds). Please do your own due diligence.</p>\n\n<ul>\n<li>edit: updated to fix some mistakes</li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 112,
  "permalink": "/r/investing/comments/ltx2ko/potential_lose_decade_coming_where_to_hide/",
  "subreddit": "investing",
  "id": "ltx2ko",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937740752
}