{
  "author": "Overheadsprinkler",
  "the_new_excerpt": "So you get done having sex, and now there is a cum-filled condom hanging off\nyour dick.\n\n * What is the first thing you do?\n\n * Do you keep the condom on? Do you take it off?\n\n * If you keep the condom on, do you just cuddle with that rubber, cum-filled\n   bag on your dick? That seems pretty gross…",
  "original_created_utc": 1611506010,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "所以你们做完爱后，现在有一个装满精液的避孕套挂在了上面\n你的鸡巴。\n\n * 什么是你做的第一件事？\n\n *你保持安全套上？你把它关闭？\n\n * 如果你一直戴着避孕套， 你只是拥抱 与橡胶，精液充满了，\n   袋子在你的鸡巴？这似乎是相当严重的...",
      "title": "谁能给我一步步指导一下性生活后该怎么做？如何清理？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以你們做完愛後，現在有一個裝滿精液的避孕套掛在了上面\n你的雞巴。\n\n * 什麼是你做的第一件事？\n\n *你保持安全套上？你把它關閉？\n\n * 如果你一直戴着避孕套， 你只是擁抱 與橡膠，精液充滿了，\n   袋子在你的雞巴？這似乎是相當嚴重的...",
      "title": "誰能給我一步步指導一下性生活後該怎麼做？如何清理？"
    }
  ],
  "title": "Can someone give me a step-by-step guide of what to do after sex? How do you clean up?",
  "created_utc": 1611522114,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So you get done having sex, and now there is a cum-filled condom hanging off your dick.</p>\n\n<ul>\n<li><p>What is the first thing you do?</p></li>\n<li><p>Do you keep the condom on? Do you take it off?</p></li>\n<li><p>If you keep the condom on, do you just cuddle with that rubber, cum-filled bag on your dick? That seems pretty gross to cuddle in</p></li>\n<li><p>If you take it off, do you make a joke about it while the girl lays in bed looking at you?</p></li>\n<li><p>If you take it off, where do you put it? Is there a trash can in your room or do you have to run to the bathroom with it?</p></li>\n<li><p>Do you keep tissues in your room for that sort of thing?</p></li>\n<li><p>Don’t your hands smell like latex now? Do you go wash them?</p></li>\n<li><p>If I don’t go wash them, you still have pussy juices and cum and lube and latex on your hands—isn’t that annoying when you smear it all over your phone screen?</p></li>\n<li><p>What about the girl? If she wants to stay and cuddle, doesn’t she need to clean up?</p></li>\n<li><p>What things does the girl need? Do I need to give her tissues?</p></li>\n<li><p>Don’t tissues fall apart and get fuzzies all over your hands? Would a towel be better? Wet wipes maybe?</p></li>\n<li><p>For that reason, should there be a trash can on both sides of the bed, so she doesn’t have to hand me her gross tissues/wipes?</p></li>\n<li><p>Can I go to the bathroom and wash up? (In another thread, a dude said doing this gives the impression to the girl that sex with her “was disgusting.”)</p></li>\n<li><p>What about dribbling out cum in bed?</p></li>\n<li><p>Do you keep a spare towel between you? Where do you put this towel beforehand?</p></li>\n</ul>\n\n<p>I’m serious about all of this. Everyone likes to act like they know what they’re doing, but what are you supposed to do during the awkward moments immediately after sex?</p>\n\n<p>Edit: thanks for nothing</p>\n</div><!-- SC_ON -->",
  "score": 11109,
  "permalink": "/r/AskMen/comments/l42n16/can_someone_give_me_a_stepbystep_guide_of_what_to/",
  "subreddit": "AskMen",
  "id": "l42n16",
  "is_self": true,
  "media": null,
  "is_video": false
}