{
  "author": "CryptoMods",
  "original_created_utc": 1630513261,
  "title": "Offer Custom Flairs to Users with an Active Special Membership",
  "created_utc": 1630524651,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Credit for this idea goes to <a href=\"https://old.reddit.com/u/Arghmybrain\">/u/Arghmybrain</a></p>\n\n<h1>Summary</h1>\n\n<p>Custom user flairs should be offered to users with an active Special Membership.  People enjoy personalized flairs next to their name and this adds a perk for special membership, which is good for the subreddit and Moons.</p>\n\n<p>​</p>\n\n<h1>Problem Statement</h1>\n\n<p>The <a href=\"https://www.reddit.com/r/CryptoCurrency\">r/CryptoCurrency</a>  flair bot has been overloaded since subscriber count approximately quadrupled this year.  Under-utilization of user flairs presents an opportunity to improve the subreddit by offering custom flairs and provide a use-case for Moons</p>\n\n<p>​</p>\n\n<h1>Solution</h1>\n\n<p>Users with an active special membership will be able to DM a mod bot to set a  flair for them and the bot will enact the change if it follows our flair  rules.  These will be subject to change by the mods as needed, but basically flairs will need to follow the rules of the subreddit.  No offensive flairs, attacking other users, evading filters, advertising,  links, or malicious flairs such as impersonating a verified user.  All flair requests will be logged.  We will host a wiki page with the  relevant instructions, rules, and details about custom flairs.  </p>\n\n<p>The bot will also monitor the subreddit and remove custom flairs for any users who no longer have special membership.  </p>\n\n<p>This bot is currently the only way we have to verify special  membership, and we can only see a True or False for if the membership is active, so our implementation options are pretty limited.  However,  this should be enough information for the bot to do the job and custom flairs should be fun for our subreddit</p>\n\n<p><a href=\"https://www.reddit.com/poll/pfxa4t\">View Poll</a></p>\n</div><!-- SC_ON -->",
  "score": 301,
  "permalink": "/r/CryptoCurrency/comments/pfxa4t/offer_custom_flairs_to_users_with_an_active/",
  "subreddit": "CryptoCurrency",
  "id": "pfxa4t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Credit for this idea goes to /u/Arghmybrain\n[https://old.reddit.com/u/Arghmybrain]\n\n\nSUMMARY\n\nCustom user flairs should be offered to users with an active Special Membership.\nPeople enjoy personalized flairs next to their name and this adds a perk for\nspecial membership, which is good for the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このアイデアのクレジットは、/u/Arghmybrainにあります。\n[https://old.reddit.com/u/Arghmybrain]\n\n\n概要\n\nカスタム・ユーザー・フレアは、アクティブなスペシャル・メンバーシップを持つユーザーに提供されるべきです。\nユーザーは自分の名前の横にパーソナライズされたフレアを楽しんでおり、これは次のような特典を追加します。\n特別会員の特典となります。",
      "title": "アクティブな特別会員を持つユーザーにカスタムフレアを提供"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这个想法归功于/u/Arghmybrain\n[https://old.reddit.com/u/Arghmybrain]\n\n\n摘要\n\n自定义用户标志应该提供给拥有活跃的特别会员资格的用户。\n人们喜欢在他们的名字旁边有个性化的标志，这为特别会员增加了一项福利。\n特别会员资格增加了一项福利，这对...",
      "title": "向拥有活跃的特殊会员资格的用户提供定制的花纹"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個想法歸功於/u/Arghmybrain\n[https://old.reddit.com/u/Arghmybrain]\n\n\n摘要\n\n自定義用戶標誌應該提供給擁有活躍的特別會員資格的用戶。\n人們喜歡在他們的名字旁邊有個性化的標誌，這爲特別會員增加了一項福利。\n特別會員資格增加了一項福利，這對...",
      "title": "向擁有活躍的特殊會員資格的用戶提供定製的花紋"
    }
  ]
}