{
  "author": "AnonHoodieGirl",
  "original_created_utc": 1658540200,
  "title": "Why do we not cough in sleep?",
  "created_utc": 1658566583,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello! First post here so bear with me.\nSo, ever since I recovered from covid in May 2021, I&amp;#39;ve had this long covid wheezing and coughing it&amp;#39;s not extreme just a little bit don&amp;#39;t worry, anyway I was thinking, I just woke up from a night&amp;#39;s sleep and I was coughing last night and now this morning. Why do we not cough in our sleep? Does coughing require consciousness? Or is it something else, maybe it could be related to our breathing patterns? Like when you try taking deep breaths to stop wheezing but cough bad while you exhale? Idk, I don&amp;#39;t have anything near a biology background. \nThank you in advance!\nPs:This may or may not be a stupid question so again, bear with me.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 108,
  "permalink": "/r/askscience/comments/w5rdtu/why_do_we_not_cough_in_sleep/",
  "subreddit": "askscience",
  "id": "w5rdtu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hello! First post here so bear with me. So, ever since I recovered from covid in\nMay 2021, I've had this long covid wheezing and coughing it's not extreme just a\nlittle bit don't worry, anyway I was thinking, I just woke up from a night's\nsleep and I was coughing last night and now this morning.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは。初投稿なので、ご容赦ください。で、2021年5月にコビドから回復してからずっと\n喘鳴と咳が長く続き、極端なものではありません。\nとにかく、一晩寝て起きたら、咳が止まらないんです。\n昨夜も今朝も咳が止まりません...。",
      "title": "なぜ、寝起きに咳をしないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好! 我是第一次在这里发帖，所以请忍耐一下。所以，自从我在2021年5月从卵巢癌中恢复过来后，我就有了这个长期的卵巢癌。\n2021年5月，我就有了这种长期的科维德喘息和咳嗽，这不是极端的，只是有一点，不要担心。\n总之，我在想，我刚刚从一个晚上的睡眠中醒来，我在咳嗽。\n昨天晚上我还在咳嗽，今天早上....",
      "title": "为什么我们在睡觉时不咳嗽呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好! 我是第一次在這裏發帖，所以請忍耐一下。所以，自從我在2021年5月從卵巢癌中恢復過來後，我就有了這個長期的卵巢癌。\n2021年5月，我就有了這種長期的科維德喘息和咳嗽，這不是極端的，只是有一點，不要擔心。\n總之，我在想，我剛剛從一個晚上的睡眠中醒來，我在咳嗽。\n昨天晚上我還在咳嗽，今天早上....",
      "title": "爲什麼我們在睡覺時不咳嗽呢？"
    }
  ]
}