{
  "author": "JustinLaFrance",
  "original_created_utc": 1627991673,
  "title": "Today I finally launch! This is my experience from 5 months ago till now.",
  "created_utc": 1628077045,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Today I finally launch! This is my experience from 5 months ago till now.</p>\n\n<p>I announced almost 5 months ago that I want to launch 12 startups in 12 months. Now, 5 months later, I&#39;m launching the first.</p>\n\n<p>For the past few months, I&#39;ve been mulling over whether I should adjust my goals and whether I am too ambitious. But I don&#39;t want to give in to that just yet. I just decided to move my goal of releasing 12 startups in 12 months, so the start is now!</p>\n\n<p>I have been reflecting a lot from the start (the moment I packed my things in the Netherlands and left everything behind). I also did that just before departure, when I still had my permanent job and my home in the Netherlands.</p>\n\n<p>I kept a record of everything I did in my calendar. I described my feeling at the end of the week, reflecting on the last 7 days, going from week to week. Continuous evaluation.</p>\n\n<p>Strangely enough, keeping my calendar was very easy. I think Apple&#39;s Calendar app works great, both on my iPhone and on my Macbook.</p>\n\n<p>But reflecting was time consuming. Open my calendar every time and add everything together. And that of every event in my calendar. But the results are very important to me: a clear overview of how I organize my life. This makes me very self-conscious.</p>\n\n<p>Subsequently, during my trip in Spain, in addition to the projects that I take on myself (on behalf of Varchar), I also started freelancing 1 day a week. I kept track of my hours, again in my calendar. A new month arrived, and it was time to send an invoice for the work. Again, I took out my calendar and started adding everything up. Time consuming and error prone.</p>\n\n<p>The startup I&#39;m launching this month is based on the issues I had while reflecting and sending the invoice. The app provides insights into your calendar. Your lifestyle, your good and bad habits, your freelance work, or other time registrations that are important to you. Immediately visible.</p>\n\n<p>The app “Segro”, derived from “Self Growth”, is currently only available for Apple/iOS.</p>\n\n<p>Do you have any new ideas, additions, or tips? Let me know!</p>\n\n<p>Link: <a href=\"https://segro.app\">segro.app</a></p>\n</div><!-- SC_ON -->",
  "score": 7,
  "permalink": "/r/SideProject/comments/ox1vn8/today_i_finally_launch_this_is_my_experience_from/",
  "subreddit": "SideProject",
  "id": "ox1vn8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Today I finally launch! This is my experience from 5 months ago till now.\n\nI announced almost 5 months ago that I want to launch 12 startups in 12 months.\nNow, 5 months later, I'm launching the first.\n\nFor the past few months, I've been mulling over whether I should adjust my goals\nand whether I am…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "本日、ついに発売 これは、5ヶ月前から現在までの私の経験です。\n\n私は約5ヶ月前に、12ヶ月で12のスタートアップを立ち上げたいと発表しました。\n5ヶ月後の今日、私は最初のスタートアップを立ち上げます。\n\nこの数ヶ月間、目標を調整すべきかどうか考えていました。\nそして、私は...",
      "title": "今日はいよいよ発売です。これは、5ヶ月前から現在までの私の経験です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今天我终于推出了! 这是我从5个月前到现在的经历。\n\n我在近5个月前宣布，我想在12个月内推出12家创业公司。\n现在，5个月后，我推出了第一个。\n\n在过去的几个月里，我一直在考虑是否应该调整我的目标\n以及我是否...",
      "title": "今天我终于推出了! 这是我从5个月前到现在的经验。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天我終於推出了! 這是我從5個月前到現在的經歷。\n\n我在近5個月前宣佈，我想在12個月內推出12家創業公司。\n現在，5個月後，我推出了第一個。\n\n在過去的幾個月裏，我一直在考慮是否應該調整我的目標\n以及我是否...",
      "title": "今天我終於推出了! 這是我從5個月前到現在的經驗。"
    }
  ]
}