{
  "author": "UhUhWaitForTheCream",
  "original_created_utc": 1634296958,
  "title": "When you start seeing random pumps of 600-800% on random coins.. It is time.",
  "created_utc": 1634308685,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m seeing more green dildos than I have seen for sometime. And not just ordinary green dildos but the gigantic eye sore variety. They are steeper, greener and occurring more frequently. Not 20-30% increases but Increases of hundreds to thousands of % in hours.</p>\n\n<p>As we know bitcoin and crypto is by design built by a 4 year cycle (halving). Without fail, this cycle holds true and rewards those who play to them.</p>\n\n<p>Back in October 15th 2017 when Bitcoin was $4,930 similar events were occurring. And by December Bitcoin had hit new all time highs settling eventually at $16,300 in December. </p>\n\n<p>These green events are so in step with previous bull run cycles. The spasms in random alt coins are a sign big money is suiting up.</p>\n\n<p>I hope your bags are packed. And I hope your bag is filled with many green toys.</p>\n</div><!-- SC_ON -->",
  "score": 214,
  "permalink": "/r/CryptoCurrency/comments/q8mdu1/when_you_start_seeing_random_pumps_of_600800_on/",
  "subreddit": "CryptoCurrency",
  "id": "q8mdu1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m seeing more green dildos than I have seen for sometime. And not just\nordinary green dildos but the gigantic eye sore variety. They are steeper,\ngreener and occurring more frequently. Not 20-30% increases but Increases of\nhundreds to thousands of % in hours.\n\nAs we know bitcoin and crypto is by…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "グリーンのディルドを見かけることが多くなりました。しかも、ただの\n普通の緑のディルドではなく、目を疑うような巨大なものだ。彼らはもっと急で\nもっと急で、もっと緑で、もっと頻繁に発生しています。20-30%の増加ではなく、数百から数千%の増加が時間単位で発生します。\n数時間で数百から数千％の上昇です。\n\nご存知の通り、ビットコインと暗号は...",
      "title": "ランダムなコインで600～800％のパンプが見られるようになると...。それは時間です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我看到的绿色假阳具比我一段时间以来看到的要多。而且不只是\n普通的绿色假阳具，而是巨大的、令人眼花缭乱的品种。它们更陡峭。\n更加绿色，而且出现的频率更高。不是20-30%的增长，而是数百到数千小时的增长。\n几百到几千%的增长。\n\n正如我们所知，比特币和加密货币是由...",
      "title": "当你开始在随机硬币上看到600-800%的随机泵时。这就是时间。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到的綠色假陽具比我一段時間以來看到的要多。而且不只是\n普通的綠色假陽具，而是巨大的、令人眼花繚亂的品種。它們更陡峭。\n更加綠色，而且出現的頻率更高。不是20-30%的增長，而是數百到數千小時的增長。\n幾百到幾千%的增長。\n\n正如我們所知，比特幣和加密貨幣是由...",
      "title": "當你開始在隨機硬幣上看到600-800%的隨機泵時。這就是時間。"
    }
  ]
}