{
  "author": "psykikk_streams",
  "the_new_excerpt": "If you do not want to read all this, scrol down. TLDR is down there. and sorry\nfor any mistakes, english is not my primary language.\n\nOff we go:\n\nSince the recent influx of really new guys (what is a good broker, what to do\nwith my 2k I just got?) to the world of investing , stocks and markets, I…",
  "original_created_utc": 1612884285,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "如果你不想看这些，请往下看。TLDR在下面，对不起\n对于任何错误，英语不是我的主要语言。\n\n我们走了。\n\n由于最近涌入的真正的新人 (什么是一个好的经纪人，该怎么做)\n与我的2K，我只是得到了吗？）投资的世界，股票和市场，我... ...",
      "title": "踏踏实实地给新交易者提建议。(DD的陷阱，做出正确的选择和成功与否)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你不想看這些，請往下看。TLDR在下面，對不起\n對於任何錯誤，英語不是我的主要語言。\n\n我們走了。\n\n由於最近湧入的真正的新人 (什麼是一個好的經紀人，該怎麼做)\n與我的2K，我只是得到了嗎？）投資的世界，股票和市場，我... ...",
      "title": "踏踏實實地給新交易者提建議。(DD的陷阱，做出正確的選擇和成功與否)"
    }
  ],
  "title": "Down to earth advise to new traders. (Pitfalls of DD, making the right choice and being successful or not)",
  "created_utc": 1612898630,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If you do not want to read all this, scrol down. TLDR is down there. and sorry for any mistakes, english is not my primary language.</p>\n\n<p>Off we go:</p>\n\n<p>Since the recent influx of really new guys (what is a good broker, what to do with my 2k I just got?) to the world of investing , stocks and markets, I see more posts about basic tips and tricks for investors.  which is perfect and great.</p>\n\n<p>I also like positivity and helping others out.What I do not like is blind optimisim and &quot;yeah awesome let´s all be rich&quot; posts, when it reality we should all be a bit more realistic, humble and self-conscious about what we do and how well this really all works out.</p>\n\n<p>Hence the reason I made this list of &quot;buyers beware&quot;. Think of it as kind of a fine print. the stuff nobody really bothers to tell you , yet you wish you would have cared later on.</p>\n\n<p>what exactly do I mean by that ? well, here we go.</p>\n\n<ol>\n<li><strong>Be realistic  with your expectations</strong>First off, I do hope everybody in here knows that real successful traders (meaning people trading day in day out, shifting positions regularily etc to beat the market, are not the norm. people doing this and still outperforming the market are statistical outliers.it might be that this (as other stock forums and communities) is mainly made up of those successful people, but I have my doubts.10-20% of active traders are succesful (as in beat the market / make consistent profits). the rest LOSE MONEY.</li>\n<li><strong>Beware of people telling you how easy it all is</strong>again, look back at 1. and try to put a perspective to things. It is super easy to write something on a forum on the web and claim to be really good at something. It´s also faitrly easy to come off as super smart and know what you are doing, when in fact you are not. nobody can really chack and look behind what is shown.</li>\n<li><strong>Beware of DD from others.</strong>there are formidable posts , where people have done hours and hours of datamining, listing of and compiling all kinds of information. this is all good, yet it does not mean that the conclusion all this data allows is gonna be correct.hence the name &quot;speculation&quot;. it´s all an assumption. if numbers from a company are great, we can safely ASSUME the price will go up. but it is never a give. its never 100% save.which brings me to</li>\n<li><strong>even the best DD can be wrong.</strong> this does not mean that your process of research was flawed. It does not mean the process of those people you trust (and which are much better at DD than yourself) were wrong. it just means sometimes things simply do not go as anticipated.there are plenty of great stocks out there, that simply not enough people care about. no demand -&gt; no price change. which brings me to</li>\n<li><strong>Fundamentals are great, but human psyhology is better</strong>If you know how human decision making works, you are probably much better at trading compared to someone who is great at business fundamentals, but has no clue how people think.  If something is trendy and people talk positive about it, it generates interest. Interest generates fantasy and assumptions. Which generates demand. Thats good if you want to go long.Outrage, bad press, still gets people talking, generates movement. Only this time in the negative direction. Time to go short. OR wait for the dip and then go long.There´s plenty people doing nothing else than trading off of public sentiment and hype.</li>\n<li><strong>Read up about cognitive biases,</strong>especially if doing DD and making an assumption.Usually, when we invest time and effort into company research, we fall into the trap of starting to interpret all data and info we find in a way that strengthens our own bias towards or against our already formed instinct regarding a topic. Our &quot;instinct&quot; already has made a decison. Our brain simply doesn´t know it yet.Example: Your best friend mentions a hot pick to you and makes some very good arguments.  You are intriguied, yet you do not want to follow blindly. So you start reseraching.... and who would have thought: he was right. looks awesome. you buy in, you lose money. why ? what went wrong ? MAYBE you simply got unlucky. OR you kind of ignored warning signs that were there, yet your brain convinced you that those datapoints are not as important as those stregthening youtr positive outlook on the company. Your gut was on your friends side all along. So your brain looked for info and reasons to stregthen this statement. It had nothing to do with the company. It was all the fact that it was your friend giving you that advice.</li>\n</ol>\n\n<p>&#x200B;</p>\n\n<p>Thats it.sorry for the long post</p>\n\n<p><strong>- TLDR-</strong></p>\n\n<ol>\n<li>realistic expectations</li>\n<li>beware of too much optimism</li>\n<li>beware of DD from others</li>\n<li>even the best DD can result in wrong conclusions</li>\n<li>think about human psychology</li>\n<li>inform yourself about cognitive biases</li>\n</ol>\n\n<p>&#x200B;</p>\n\n<p>thanks, have fun.</p>\n</div><!-- SC_ON -->",
  "score": 76,
  "permalink": "/r/stocks/comments/lg5md5/down_to_earth_advise_to_new_traders_pitfalls_of/",
  "subreddit": "stocks",
  "id": "lg5md5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123204858
}