{
  "author": "xcryptogurux",
  "original_created_utc": 1626245943,
  "title": "EXPOSED: Tesla lost its carbon credits market in Europe so it's trying to create a renewable credits market by attacking Bitcoin mining",
  "created_utc": 1626255622,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m going to try to explain Elon Musk&#39;s seemingly &quot;big brain&quot; but actually pretty dumb gambit with regards to Bitcoin mining. Note carefully the dates on each development in the story.</p>\n\n<p>Why did Tesla buy $1.5 billion worth of Bitcoin?</p>\n\n<p>Couple of factors - one short-term and one long-term.</p>\n\n<p><strong>Short-term play</strong> - Tesla&#39;s production was halted due to supply chain effects from the pandemic. This is why there has been a lot of delivery delays this year. This meant that Tesla&#39;s shrinking profits from selling carbon credits to other carmakers alone wasn&#39;t enough to post a profitable quarter. So Tesla decided to buy Bitcoin and then sell some of it before the end of the quarter to make up for the shortfall.</p>\n\n<p><a href=\"https://preview.redd.it/kl5io232k4b71.png?width=1200&amp;format=png&amp;auto=webp&amp;s=fd804647696cb66355c6f86813aebea7c3ffc2a5\">Bitcoin purchase made sure Tesla had a profitable Q1 2021</a></p>\n\n<p><a href=\"https://preview.redd.it/bsqm2midk4b71.png?width=1010&amp;format=png&amp;auto=webp&amp;s=143bd79e7eab0c149b3741174b1889990e530ea5\">2020 was Tesla&#39;s first-ever net-positive year thanks to carbon credits sales</a></p>\n\n<p><a href=\"https://preview.redd.it/nvqwgowhk4b71.png?width=914&amp;format=png&amp;auto=webp&amp;s=a61238f0ecfc9d394c7c0fdd580ba178ba7b224c\">But that source of revenue is shrinking (May 6)</a></p>\n\n<p><strong>Long-term play</strong> - The reason for Tesla&#39;s revenue from carbon credits sales shrinking is that European carmakers are shifting focus to EV themselves, meaning they no longer need to purchase credits from Tesla to comply with strict emissions regulations in the EU.</p>\n\n<p>So Tesla now needs to make up for this potentially permanent revenue loss. What do they do?</p>\n\n<p><strong>One day before Elon Musk tweeted that Tesla would no longer accept Bitcoin payments</strong> <em>&quot;due to</em> <em>rapidly increasing use of fossil fuels for Bitcoin mining and transactions&quot;</em><strong>, Tesla applied for renewable credits certificate from the EPA.</strong></p>\n\n<p><a href=\"https://preview.redd.it/cv3iaqtcn4b71.png?width=1025&amp;format=png&amp;auto=webp&amp;s=5965e5ed7a4dbfdf035ec32544bb09851ffe703a\"> Tesla applied for renewable credits, one day before Bitcoin mining FUD (May 12)</a></p>\n\n<p>Unlike carbon credits, which can only be sold to other carmakers, the EPA&#39;s renewable credits can be sold in the open market to ANY industry.</p>\n\n<p>Elon figured he could create a new renewable credits market out of Bitcoin mining to replace Tesla&#39;s revenue loss from selling carbon credits.</p>\n\n<p>Too bad for Elon Bitcoin mining uses 4x higher than the average share of renewables in the US (56%).</p>\n\n<p>The dumbest part of all this has to be the use of <em>&quot;and transactions&quot;</em> because no incremental energy is used for transactions. This guy frankly has zero understanding of how Bitcoin works.</p>\n\n<p>Personally, I don&#39;t think he cares to understand. Notice how he&#39;s trying to hijack dog coin and turn it into PayPal.</p>\n\n<p><strong>Bitcoin does not benefit beneficiaries of the fiat pyramid scheme. Tax-dodging billionaires who get free money from the government making the rest of our money worth less are at the top of the pyramid and they&#39;re loving it!</strong> <em>(credit iTruth84)</em></p>\n\n<p><a href=\"https://preview.redd.it/vinrxqnfs4b71.png?width=641&amp;format=png&amp;auto=webp&amp;s=7fc10359461a17813cf6823719660cfe9f1780cb\">Billionaires get all the benefits of inflation. All the ill effects are dumped on us!</a></p>\n</div><!-- SC_ON -->",
  "score": 256,
  "permalink": "/r/CryptoCurrency/comments/ojywf1/exposed_tesla_lost_its_carbon_credits_market_in/",
  "subreddit": "CryptoCurrency",
  "id": "ojywf1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm going to try to explain Elon Musk's seemingly \"big brain\" but actually\npretty dumb gambit with regards to Bitcoin mining. Note carefully the dates on\neach development in the story.\n\nWhy did Tesla buy $1.5 billion worth of Bitcoin?\n\nCouple of factors - one short-term and one long-term.\n\nShort…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今回は、イーロン・マスク氏の一見「頭脳明晰」に見えるが、実はかなり馬鹿げたビットコイン・マイニングに関する作戦を説明してみようと思う。\nビットコインのマイニングに関して、一見「頭でっかち」に見えて、実はかなり馬鹿げた策を講じています。それぞれの日付に注意してください。\n注意してください。\n\nなぜテスラは15億ドル相当のビットコインを買ったのか？\n\n短期的なものと長期的なもの、2つの要因があります。\n\n短期...",
      "title": "エクスポーズド テスラは欧州での炭素クレジット市場を失ったため、ビットコインマイニングを攻撃して再生可能クレジット市場を作ろうとしている"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我将尝试解释埃隆-马斯克看似 \"脑洞大开 \"但实际上\n关于比特币挖矿的相当愚蠢的赌博行为。仔细注意故事中的日期\n故事中的每一个发展。\n\n特斯拉为什么要购买价值15亿美元的比特币？\n\n有几个因素--一个是短期的，一个是长期的。\n\n短期的...",
      "title": "曝光了。特斯拉失去了其在欧洲的碳信用额度市场，所以它试图通过攻击比特币采矿来创造一个可再生信用额度市场"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我將嘗試解釋埃隆-馬斯克看似 \"腦洞大開 \"但實際上\n關於比特幣挖礦的相當愚蠢的賭博行爲。仔細注意故事中的日期\n故事中的每一個發展。\n\n特斯拉爲什麼要購買價值15億美元的比特幣？\n\n有幾個因素--一個是短期的，一個是長期的。\n\n短期的...",
      "title": "曝光了。特斯拉失去了其在歐洲的碳信用額度市場，所以它試圖通過攻擊比特幣採礦來創造一個可再生信用額度市場"
    }
  ]
}