{
  "author": "ludgea",
  "the_new_excerpt": "I will take a recent example by saying Cardano has become the new Ripple in term\nof price expectation.\n\nHear me out before downvoting for comparing Cardano and Ripple (I can already\nfeel the pitchfork).\n\nLately there has been a lot of new investors. They are like us when we arrived\nin this new…",
  "original_created_utc": 1616084718,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我举一个最近的例子，说Cardano已经成为新的Ripple的术语。\n的价格预期。\n\n在比较Cardano和Ripple之前，先听听我的意见（我已经可以\n摸摸叉子）。)\n\n最近有很多新的投资者。他们就像我们来时一样\n在这个新...",
      "title": "价格低不代表能达到1000元的水平"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我舉一個最近的例子，說Cardano已經成爲新的Ripple的術語。\n的價格預期。\n\n在比較Cardano和Ripple之前，先聽聽我的意見（我已經可以\n摸摸叉子）。)\n\n最近有很多新的投資者。他們就像我們來時一樣\n在這個新...",
      "title": "價格低不代表能達到1000元的水平"
    }
  ],
  "title": "Low price doesn't mean it can reach $1000",
  "created_utc": 1616103393,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I will take a recent example by saying Cardano has become the new Ripple in term of price expectation.</p>\n\n<p>Hear me out before downvoting for comparing Cardano and Ripple (I can already feel the pitchfork).</p>\n\n<p>Lately there has been a lot of new investors. They are like us when we arrived in this new promised land, feeling like we are the Christopher Colombus of crypto currencies.</p>\n\n<p>So, it&#39;s up to us to help them showing the path (there are already a ton of posts here about that, thank you again for your work).</p>\n\n<p>That being said, I see a lot of comments from these new people hoping Cardano will reach Bitcoin price and explode, targeting a +$1000.</p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Some maths (sorry)</strong></li>\n</ul>\n\n<p>To you, fellow dreamer, you have to understand it won&#39;t happen. You have to learn the meaning of market cap.</p>\n\n<p>Actually, Bitcoin has a market cap of $1.09T. Cardano is at $46.14B, for a price of $1.44 each.</p>\n\n<p>To reach the BTC market cap, you will need to do x23,62, which would put ADA to $34. Which is still pretty huge, but far from $1k each.</p>\n\n<p>To achieve this price target, ADA need a market cap of $32T, which is almost 3 times the market capitalization of gold.</p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>History repeating itself (kinda)</strong></li>\n</ul>\n\n<p>In 2017, newcomers had the same expectation about Ripple, not understanding how marketcap was working, putting a ton of money (some people took loans and gambled on this) dreaming about unreachable price.</p>\n\n<p>I just hope this post will clarify what you can / should expect about the pricing limit of one crypto currency,based on its market capitalization.</p>\n\n<p>&#x200B;</p>\n\n<p>PS: Sorry for the repost, bot deleted my  post because there were already 2 posts &quot;about ADA in the top 50&quot;, like wth</p>\n</div><!-- SC_ON -->",
  "score": 596,
  "permalink": "/r/CryptoCurrency/comments/m7ul0h/low_price_doesnt_mean_it_can_reach_1000/",
  "subreddit": "CryptoCurrency",
  "id": "m7ul0h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752815282
}