{
  "author": "Ludozius",
  "original_created_utc": 1659738745,
  "title": "Is having several layers in your mind normal?",
  "created_utc": 1659770981,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So, when I think of stuff there’s usually several layers of my thoughts, one is talking to myself in my head, one layer ”deeper” is where my thoughts kind of prepare for that first layer, and a third layer is things like music that repeats, or more subconcious thoughts, thoughts that prepare the second layer, this is rarer though. \nSometimes although rarely there is a 4th layer where it’s very close to just subconciousness, is this normal?&lt;/p&gt;\n\n&lt;p&gt;I should probably mention that I’m someone who rarely speaks in a conversation before already having thought out what I want to say&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 108,
  "permalink": "/r/TooAfraidToAsk/comments/wh8cd8/is_having_several_layers_in_your_mind_normal/",
  "subreddit": "TooAfraidToAsk",
  "id": "wh8cd8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So, when I think of stuff there’s usually several layers of my thoughts, one is\ntalking to myself in my head, one layer ”deeper” is where my thoughts kind of\nprepare for that first layer, and a third layer is things like music that\nrepeats, or more subconcious thoughts, thoughts that prepare the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "だから、私がものを考えるときは、たいてい何層かの思考があるのですが、ひとつは\n1つは頭の中で自分に語りかけているようなもので、「より深い」層は、私の思考がその最初の層の準備をするようなものです。\nそして3つ目の層は、音楽のように繰り返されるもので、よりサブコンシャスなものです。\n繰り返される音楽のようなもの、あるいはもっと潜在的な思考や、その準備のための思考...。",
      "title": "心の中にいくつものレイヤーがあるのは、普通のことなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，当我想到东西时，我的想法通常有几个层次，一个是\n在我的脑海中自言自语，\"更深 \"的一层是我的思想为第一层做准备。\n为第一层做准备，第三层是像音乐这样的东西。\n第三层是一些东西，如重复的音乐，或更多的潜意识想法，为第一层做准备的想法。",
      "title": "在你的头脑中有几个层次是正常的吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，當我想到東西時，我的想法通常有幾個層次，一個是\n在我的腦海中自言自語，\"更深 \"的一層是我的思想爲第一層做準備。\n爲第一層做準備，第三層是像音樂這樣的東西。\n第三層是一些東西，如重複的音樂，或更多的潛意識想法，爲第一層做準備的想法。",
      "title": "在你的頭腦中有幾個層次是正常的嗎？"
    }
  ]
}