{
  "author": "ChapCapFun",
  "original_created_utc": 1635540991,
  "title": "The shoeshine boy in 1929 and my co-workers today. I’m worried.",
  "created_utc": 1635558068,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We all know that old story of the shoeshine boy who was giving stock tips to people as he shined their shoes, and one man thought to himself “When the shoeshine boy starts giving stock tips, it’s time to get out.”</p>\n\n<p>Well, all of my co-workers are walking around “Buy SHIB bro!!!!” “Dude I found this one called ‘Basic Attention Token’ it’s only $0.80 but a few days ago it was $0.60! And it has a great blockchain!” </p>\n\n<p>IT HAS A GREAT BLOCKCHAIN. WUT.</p>\n\n<p>I keep my mouth shut, but it’s so annoying how crypto is becoming the ultimate Ponzi scheme and this is what it’s going to be known for. Basically names you bought online to try and get rich.</p>\n</div><!-- SC_ON -->",
  "score": 168,
  "permalink": "/r/CryptoCurrency/comments/qim755/the_shoeshine_boy_in_1929_and_my_coworkers_today/",
  "subreddit": "CryptoCurrency",
  "id": "qim755",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "We all know that old story of the shoeshine boy who was giving stock tips to\npeople as he shined their shoes, and one man thought to himself “When the\nshoeshine boy starts giving stock tips, it’s time to get out.”\n\nWell, all of my co-workers are walking around “Buy SHIB bro!!!!” “Dude I found\nthis…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "靴磨きの少年が、靴を磨きながら人々に株のアドバイスをしていたという古い話は、誰もが知っている。\n靴磨きの少年は、人々の靴を磨きながら株のヒントを与えていたが、ある男は「靴磨き少年が株のヒントを与え始めたら\n靴磨きの少年が株の情報を教え始めたら、それは退場する時だ」と思った。\n\nさて、私の同僚たちは皆、\"Buy SHIB bro!!!!\"と言って歩いています。\"Dude I found\nこれだ...",
      "title": "1929年の靴磨きの少年と、現在の同僚。心配です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们都知道那个擦鞋童的老故事，他一边擦鞋一边给人们提供股票的提示。\n有一个人心想：\"当擦鞋匠开始给人们提供股票小费时，就该离开了。\n一个人想：\"当擦鞋匠开始给人们提供股票小费时，就该走人了。\"\n\n好吧，我所有的同事都在走动，\"买SHIB bro!!!!\" \"伙计，我发现\n这个...",
      "title": "1929年的擦鞋童和今天我的同事们。我很担心。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們都知道那個擦鞋童的老故事，他一邊擦鞋一邊給人們提供股票的提示。\n有一個人心想：\"當擦鞋匠開始給人們提供股票小費時，就該離開了。\n一個人想：\"當擦鞋匠開始給人們提供股票小費時，就該走人了。\"\n\n好吧，我所有的同事都在走動，\"買SHIB bro!!!!\" \"夥計，我發現\n這個...",
      "title": "1929年的擦鞋童和今天我的同事們。我很擔心。"
    }
  ]
}