{
  "author": "cryptovist",
  "original_created_utc": 1648805184,
  "title": "EU \"Ban\" on private Wallets - Vote shows Greens and progressive Left were massively in favour - Conservatives against mostly",
  "created_utc": 1648818090,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The often so-called progressive forces from left-wing and green parties were the driving forces in sealing the fate of the DeFi sector and crypto in general in the EU. Yes, for the individual holder there will be solutions, but an industry has been massacred and the EU once more gave up the possibility to take a leading role in cutting edge technology in favour of massive over-regulation.   &lt;/p&gt;\n\n&lt;p&gt;The interesting thing is also, as many people in other threats stated that the problem would be old bas**s clinging to power or boomers not understanding crypto/blockchain. Fact is, leading politicians, in this case, were for example Paul Tang (ok he is 54), but also a renowned economist from Spain Ernest Urtasun (40) and even a POC  Assita Kanko (42). The problem here are not old white males at least, the conservative PPE voted against all together but are socialists, social democrats, left-wing liberals and greens... a sad truth but a truth nonetheless&lt;/p&gt;\n\n&lt;p&gt;Please see the table below for detailed results of the final vote for the shady compromise on the law that doomed the crypto industry in the EU:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/byvm7rbewvq81.png?width=439&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=0fa3249f0fcab37f941b07fd288adafcbf72e797\"&gt;https://preview.redd.it/byvm7rbewvq81.png?width=439&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=0fa3249f0fcab37f941b07fd288adafcbf72e797&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 489,
  "permalink": "/r/CryptoCurrency/comments/ttmlcp/eu_ban_on_private_wallets_vote_shows_greens_and/",
  "subreddit": "CryptoCurrency",
  "id": "ttmlcp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The often so-called progressive forces from left-wing and green parties were the\ndriving forces in sealing the fate of the DeFi sector and crypto in general in\nthe EU. Yes, for the individual holder there will be solutions, but an industry\nhas been massacred and the EU once more gave up the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "左翼政党や緑の党のいわゆる進歩的な勢力が多かったのは\nDeFiセクターと暗号全般の運命を決定づけた原動力となった。\nEUの そう、個々のホルダーにとっては解決策があるのでしょうが、一つの産業が\nは虐殺され、EUはまたもや...",
      "title": "EUの「財布の私物化禁止」 - 投票では緑の党と進歩的な左派が大量に賛成 - 保守党はほとんど反対"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "来自左翼和绿色政党的所谓进步力量往往是\n推动了DeFi行业和加密货币在欧盟总体上的命运。\n欧盟的命运。是的，对于个人持有人来说，会有解决方案，但一个行业\n已经被屠杀了，欧盟再一次放弃了。",
      "title": "欧盟 \"禁止 \"私人钱包--投票显示绿党和进步的左派大量赞成--保守派大多反对"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "來自左翼和綠色政黨的所謂進步力量往往是\n推動了DeFi行業和加密貨幣在歐盟總體上的命運。\n歐盟的命運。是的，對於個人持有人來說，會有解決方案，但一個行業\n已經被屠殺了，歐盟再一次放棄了。",
      "title": "歐盟 \"禁止 \"私人錢包--投票顯示綠黨和進步的左派大量贊成--保守派大多反對"
    }
  ]
}