{
  "author": "cryptovist",
  "original_created_utc": 1648805184,
  "title": "EU \"Ban\" on private Wallets - Vote shows Greens and progressive Left were massively in favour - Conservatives against mostly",
  "created_utc": 1648818090,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The often so-called progressive forces from left-wing and green parties were the driving forces in sealing the fate of the DeFi sector and crypto in general in the EU. Yes, for the individual holder there will be solutions, but an industry has been massacred and the EU once more gave up the possibility to take a leading role in cutting edge technology in favour of massive over-regulation.   &lt;/p&gt;\n\n&lt;p&gt;The interesting thing is also, as many people in other threats stated that the problem would be old bas**s clinging to power or boomers not understanding crypto/blockchain. Fact is, leading politicians, in this case, were for example Paul Tang (ok he is 54), but also a renowned economist from Spain Ernest Urtasun (40) and even a POC  Assita Kanko (42). The problem here are not old white males at least, the conservative PPE voted against all together but are socialists, social democrats, left-wing liberals and greens... a sad truth but a truth nonetheless&lt;/p&gt;\n\n&lt;p&gt;Please see the table below for detailed results of the final vote for the shady compromise on the law that doomed the crypto industry in the EU:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/byvm7rbewvq81.png?width=439&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=0fa3249f0fcab37f941b07fd288adafcbf72e797\"&gt;https://preview.redd.it/byvm7rbewvq81.png?width=439&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=0fa3249f0fcab37f941b07fd288adafcbf72e797&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 489,
  "permalink": "/r/CryptoCurrency/comments/ttmlcp/eu_ban_on_private_wallets_vote_shows_greens_and/",
  "subreddit": "CryptoCurrency",
  "id": "ttmlcp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The often so-called progressive forces from left-wing and green parties were the\ndriving forces in sealing the fate of the DeFi sector and crypto in general in\nthe EU. Yes, for the individual holder there will be solutions, but an industry\nhas been massacred and the EU once more gave up the…"
}