{
  "author": "nweb-PWNER-9000",
  "original_created_utc": 1647906598,
  "title": "I once masturbated my friend with surgical gloves as a joke, does that make me gay?",
  "created_utc": 1647917232,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m not attracted to men or manly features. But I did once masturbate my friend with a surgical glove for about 20 seconds. We were hanging out at my family’s living room and decided to watch porn. There was 5 of us and everyone was masturbating. His dick was the biggest and we all took turns stroking it with gloves. Now that I look back at that, it seems gay. But I’m definitely not attracted to him. Edit: porn was lesbian&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 354,
  "permalink": "/r/TooAfraidToAsk/comments/tjpl8e/i_once_masturbated_my_friend_with_surgical_gloves/",
  "subreddit": "TooAfraidToAsk",
  "id": "tjpl8e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m not attracted to men or manly features. But I did once masturbate my friend\nwith a surgical glove for about 20 seconds. We were hanging out at my family’s\nliving room and decided to watch porn. There was 5 of us and everyone was\nmasturbating. His dick was the biggest and we all took turns…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は男性や男らしいものに魅力を感じません。でも、友達にオナニーをさせたことがあるんです。\n手術用手袋で20秒くらい。私の実家で遊んでいた時\nリビングでAVを見ようということになったんです。5人いたんですが、みんな\nオナニーをしている。彼のペニスが一番大きかったので、みんなで交代で・・・。",
      "title": "冗談で友人に手術用手袋でオナニーさせたことがあるんですが、それってゲイになるんですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我对男人或男人的特征不感兴趣。但我曾经用手术手套给我的朋友手淫过\n用手术手套手淫了大约20秒。我们当时在我家的\n我们在我家的客厅里玩，决定看色情片。我们有五个人，每个人都在\n手淫。他的阴茎是最大的，我们都轮流...",
      "title": "我曾经用手术手套给我的朋友手淫，作为一个玩笑，这让我成为了同性恋吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我對男人或男人的特徵不感興趣。但我曾經用手術手套給我的朋友手淫過\n用手術手套手淫了大約20秒。我們當時在我家的\n我們在我家的客廳裏玩，決定看色情片。我們有五個人，每個人都在\n手淫。他的陰莖是最大的，我們都輪流...",
      "title": "我曾經用手術手套給我的朋友手淫，作爲一個玩笑，這讓我成爲了同性戀嗎？"
    }
  ]
}