{
  "author": "No_Breath7116",
  "original_created_utc": 1631731787,
  "title": "Why did Robert E. Lee continue to fight at Gettysburg on the second day?",
  "created_utc": 1631756297,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>On day one of the battle, the Confederates pushed back the Union into the hills around Gettysburg. Lee knew the hills could be used for a solid defensive position, evident by the fact he ordered his generals to take the hills if they could. So why did Lee even bother to attack the Union, rather than regroup and fight them on a more favorable battlefield?</p>\n\n<p>It&#39;s not like the Confederates were not in a position to retreat/regroup. They had just won the first day of battle, had control of Gettysburg, and could easily order a withdrawal. It wouldn&#39;t be hard to find the &quot;battle to end them all&quot; like Lee was looking for either, as he could just threaten D.C., Philly, etc. So why did Lee even fight when he knew the Union had strong positions on the hills?</p>\n</div><!-- SC_ON -->",
  "score": 117,
  "permalink": "/r/AskHistorians/comments/powcdf/why_did_robert_e_lee_continue_to_fight_at/",
  "subreddit": "AskHistorians",
  "id": "powcdf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "On day one of the battle, the Confederates pushed back the Union into the hills\naround Gettysburg. Lee knew the hills could be used for a solid defensive\nposition, evident by the fact he ordered his generals to take the hills if they\ncould. So why did Lee even bother to attack the Union, rather than…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "戦いの初日、南軍は北軍をゲティバーグ周辺の丘陵地帯に押し戻した。\nゲティスバーグ周辺の丘陵地帯に北軍を押し戻した。リーは、この丘が強固な防御陣地になることを知っていた。\nリーは、丘陵が強固な防御陣地になることを知っており、将軍たちにできるだけ丘陵を取るように命じたことからもわかるように\n取ることができるならば、その丘を取るように将軍たちに命じたことからもわかります。それなのに、なぜリーはわざわざ北軍を攻撃したのだろう...。",
      "title": "ロバート・E・リーは、なぜゲティスバーグで2日目も戦い続けたのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在战役的第一天，南军将联邦军逼退到盖茨堡周围的山头上\n葛底斯堡周围的山头。李知道这些山丘可以作为一个坚实的防御阵地。\n阵地，他命令他的将军们在可能的情况下攻占山头，这一点很明显。\n他命令他的将军们如果可以的话就攻占山头。那么，为什么李甚至不惜攻击联盟，而要...",
      "title": "为什么罗伯特-李在第二天继续在葛底斯堡作战？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在戰役的第一天，南軍將聯邦軍逼退到蓋茨堡周圍的山頭上\n葛底斯堡周圍的山頭。李知道這些山丘可以作爲一個堅實的防禦陣地。\n陣地，他命令他的將軍們在可能的情況下攻佔山頭，這一點很明顯。\n他命令他的將軍們如果可以的話就攻佔山頭。那麼，爲什麼李甚至不惜攻擊聯盟，而要...",
      "title": "爲什麼羅伯特-李在第二天繼續在葛底斯堡作戰？"
    }
  ]
}