{
  "author": "JuicySpark",
  "the_new_excerpt": "So I've been talking about Unibright to my Twitter followers for the past few\nmonths even retweeting old tweets when it was first released on IDEX . Simple\nstuff like \"UBT now available on IDEX, this has a lot of potential\". Just the\naverage shills nothing special.\n\nI know for fact when I bought it…",
  "original_created_utc": 1618076977,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はここ数ヶ月、ツイッターのフォロワーにユニブライトのことを話してきました。\nIDEXで初めて発表されたときの古いツイートをリツイートしたりしていました。単純に\nIDEXでUBTが使えるようになりました、これは大きな可能性を秘めています」というような簡単なものです。ただの\n特別なことではない、平均的なシラーです。\n\n私はそれを買ったときに事実を知っています...",
      "title": "私のようにならないように、たとえ10ドル相当の暗号しか入っていなくても、ウォレットのリカバリーフレーズはすべて大切に保管してください。なぜなら、10ドルは数年後には1000ドルの価値になる可能性があるからです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以，在过去的几个月里，我一直在和我的Twitter粉丝们谈论Unibright。\n几个月，甚至转发IDEX上首次发布时的旧推特。简单的\n像 \"UBT现在可以在IDEX上使用，这有很大的潜力 \"这样的东西。只是\n一般的小贩，没什么特别的。\n\n我买的时候就知道...",
      "title": "不要像我一样，好好保管你钱包里所有的回收短语，哪怕你的钱包里只有价值10美元的加密货币。因为10美元在几年后很容易就能值1000美元。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以，在過去的幾個月裏，我一直在和我的Twitter粉絲們談論Unibright。\n幾個月，甚至轉發IDEX上首次發佈時的舊推特。簡單的\n像 \"UBT現在可以在IDEX上使用，這有很大的潛力 \"這樣的東西。只是\n一般的小販，沒什麼特別的。\n\n我買的時候就知道...",
      "title": "不要像我一樣，好好保管你錢包裏所有的回收短語，哪怕你的錢包裏只有價值10美元的加密貨幣。因爲10美元在幾年後很容易就能值1000美元。"
    }
  ],
  "title": "Don't be like me, take good care of all of your wallet's recovery phrases even if it only has $10 worth of crypto on it. Because $10 can easily be worth $1000 in few years later.",
  "created_utc": 1618105943,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I&#39;ve been talking about Unibright to my Twitter followers for the past few months even retweeting old tweets when it was first released on IDEX .   Simple stuff like &quot;UBT now available on IDEX, this has a lot of potential&quot;.  Just the average shills nothing special. </p>\n\n<p>I know for fact when I bought it because I tend to shill the crypto on twitter whenever I buy it.  Totally normal degenerate thing to do right? </p>\n\n<p>Back then 2017/18 I would scope out super low cap coins and new releases to see if anything special is going on.   I would buy $100-$200 worth , lock it away in a wallet and forget about it.     UBT was one of them, and Hubii network was the other.  Hubii still hasn&#39;t done jack but they are connected to one of the biggest Telecommunication companies that&#39;s Telenor.    </p>\n\n<p>Those are the things I would look out for. I say to myself. &quot;That&#39;s a huge name, and they got financial and advertising backing behind it if they ever wanted to mass shill it&quot; </p>\n\n<p>Well UBT was $0.02 at the time.  Now it&#39;s $2.18.  that&#39;s 100x and I know my habits. I never invested anthing less that $100 for a long term hold except once. Lowest was $50 and I remember that one clearly. It was smart cash when it first was released. A shitcoin</p>\n\n<p>Whatever. </p>\n\n<p>Point is, I didn&#39;t take care of that recovery phrase for UBT. I moved since then. A lot of hectic shit going on. Had 2 kids since.   I literally tore apart my house. I found just about every recovery phrase from countless wallets except for my UBT.   That $100 is now worth $10,000.   </p>\n\n<p>I have a bad habit of not caring about Dust in wallets of it&#39;s only a little bit, and UBT might have been straight garbage for a while.  Either way, I didn&#39;t take good care of it.   I only took care of my main stuff, I kept it all in a safe. </p>\n\n<p>So now I&#39;m out $10K which could easily be $20K in this bull.   </p>\n\n<p>Main point here..  EVEN IF ITS only $10 in an old wallet.  TAKE CARE OF IT LIKE YOU WOULD YOUR MAIN HOLDINGS. EVEN $10 IN UBT is now $1000.   Even the $3 dust that left you 0.5 BNB is now worth $225. </p>\n\n<p>Take good care of those small dollars because you really just never know I&#39;m this space.</p>\n\n<p>And btw, I am quite upset about it. It hurts</p>\n</div><!-- SC_ON -->",
  "score": 315,
  "permalink": "/r/CryptoCurrency/comments/mo9g9g/dont_be_like_me_take_good_care_of_all_of_your/",
  "subreddit": "CryptoCurrency",
  "id": "mo9g9g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566614252
}