{
  "author": "sits_on_couch",
  "the_new_excerpt": "Hi all,\n\nI read Viktor Frankl's \"Man's Search for Meaning.\" No question, it's a powerful\nwork, and I'm appreciative to have read it.\n\nHowever, I have a challenge with his section on 'tragic optimism;' specifically\nthe part where he recounts telling suicide-prone people that even if things in\ntheir…",
  "original_created_utc": 1617072225,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "大家好\n\n我读了维克多-弗兰克尔的《人类对意义的探索》。毫无疑问，这是一个强大的\n作品，我很感激能读到它。\n\n然而，我对他的 \"悲剧性的乐观主义 \"一节有一个挑战；特别是\n他讲述了他告诉有自杀倾向的人，即使事情在。\n其",
      "title": "不顾一切地对生活说 \"是\"，因为... ... ?"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好\n\n我讀了維克多-弗蘭克爾的《人類對意義的探索》。毫無疑問，這是一個強大的\n作品，我很感激能讀到它。\n\n然而，我對他的 \"悲劇性的樂觀主義 \"一節有一個挑戰；特別是\n他講述了他告訴有自殺傾向的人，即使事情在。\n其",
      "title": "不顧一切地對生活說 \"是\"，因爲... ... ?"
    }
  ],
  "title": "Say yes to life despite everything, because... ?",
  "created_utc": 1617129474,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi all,</p>\n\n<p>I read Viktor Frankl&#39;s &quot;Man&#39;s Search for Meaning.&quot; No question, it&#39;s a powerful work, and I&#39;m appreciative to have read it. </p>\n\n<p>However, I have a challenge with his section on &#39;tragic optimism;&#39; specifically the part where he recounts telling suicide-prone people that even if things in their life had a 1/1000th chance of turning out well, it could happen to them someday, so they have to live to see that day possibly happen. To me, that argument is clearly well-intentioned, but the reasoning feels weak. I feel like, in the heat of a desperate moment, I would need something more solid to hold onto, to say yes to life, than the <em>possibility</em> that something good would happen to me in the future. </p>\n\n<p>Are there other philosophers who provide an answer with more certainty than Frankl to, &quot;Say yes to life, despite everything, because... &quot;?</p>\n\n<p>Thanks in advance!</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/askphilosophy/comments/mg6382/say_yes_to_life_despite_everything_because/",
  "subreddit": "askphilosophy",
  "id": "mg6382",
  "is_self": true,
  "media": null,
  "is_video": false
}