{
  "author": "No_Dog_7969",
  "original_created_utc": 1641634380,
  "title": "Why aren't there women sending random vagina pics?",
  "created_utc": 1641659517,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I figured if there are man willing to do this, why the fuck on earth haven&amp;#39;t I ever heard about a woman randomly sending a vagina pic to someone?? I mean bro, if women would do this instead of man, it would most likely have a success rate of 99%, yet I haven&amp;#39;t ever heard about a single woman that ever sent unsolicited vag pics. Why is that? Please don&amp;#39;t bullshit me with all men are pigs or some other shit, I want the science. Thanks in advance for clarifications.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 121,
  "permalink": "/r/TooAfraidToAsk/comments/ryw4u0/why_arent_there_women_sending_random_vagina_pics/",
  "subreddit": "TooAfraidToAsk",
  "id": "ryw4u0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I figured if there are man willing to do this, why the fuck on earth haven't I\never heard about a woman randomly sending a vagina pic to someone?? I mean bro,\nif women would do this instead of man, it would most likely have a success rate\nof 99%, yet I haven't ever heard about a single woman that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんなことをする男がいるのなら、なぜ今までいなかったんだろうと思ったんです。\n女性が誰かにヴァギナの写真を送るなんて 聞いたことないだろう？つまり、兄弟。\nもし、男ではなく女がやるのであれば、成功率は高いでしょう。\n99%の確率で...一人の女性も...",
      "title": "なぜランダムにヴァギナの写真を送る女性がいないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想，如果有男人愿意这样做，为什么我他妈的没有听说过一个女人随机发送阴道照片给别人？\n为什么我从来没有听说过一个女人随机发送阴道照片给别人？我的意思是，兄弟。\n如果是女人而不是男人做这件事，它的成功率很可能会达到\n99%，但我从来没有听说过一个女人...",
      "title": "为什么没有女人随机发送阴道照片？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想，如果有男人願意這樣做，爲什麼我他媽的沒有聽說過一個女人隨機發送陰道照片給別人？\n爲什麼我從來沒有聽說過一個女人隨機發送陰道照片給別人？我的意思是，兄弟。\n如果是女人而不是男人做這件事，它的成功率很可能會達到\n99%，但我從來沒有聽說過一個女人...",
      "title": "爲什麼沒有女人隨機發送陰道照片？"
    }
  ]
}