{
  "author": "RatherCynical",
  "original_created_utc": 1631601790,
  "title": "What's the most overvalued cryptocurrency in the cryptocurrency space today?",
  "created_utc": 1631619037,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Back in 2017, there was an explosion of ICOs. Most of them were quite frankly.... shit. I&#39;m sure a good percentage of the top 100 never even made it to the top 100 again, getting overtaken by new projects that actually do something. </p>\n\n<p>And then we have the meme coin explosion of 2021. DOGE and SAFEMOON and plenty of other coins seem to be taking top spots undeservedly.</p>\n\n<p>Which cryptocurrency projects do you despise being in the top 100 and think it&#39;s wildly overvalued? In your opinion, which projects are shitcoins?</p>\n\n<ul>\n<li>bonus points for discussing undervalued projects that deserve those top spots.</li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 214,
  "permalink": "/r/CryptoCurrency/comments/pnxjx4/whats_the_most_overvalued_cryptocurrency_in_the/",
  "subreddit": "CryptoCurrency",
  "id": "pnxjx4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Back in 2017, there was an explosion of ICOs. Most of them were quite\nfrankly.... shit. I'm sure a good percentage of the top 100 never even made it\nto the top 100 again, getting overtaken by new projects that actually do\nsomething.\n\nAnd then we have the meme coin explosion of 2021. DOGE and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2017年当時、ICOの爆発的な普及がありました。そのほとんどが、はっきり言って\n率直に言って.... 糞でした。トップ100のうちのかなりの割合が、二度とトップ100に入ることはなかったと思います。\n実際に何かをする新しいプロジェクトに追い越されて、トップ100には二度と入らなかったでしょう。\nした。\n\nそして、2021年にはミームコインが爆発的に売れました。DOGEと...",
      "title": "現在、暗号通貨の中で最も過大評価されている暗号通貨は何か？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "早在2017年，就出现了ICO的爆发。它们中的大多数都很\n坦率地说，.... 狗屎。我敢肯定，前100名中有相当一部分甚至没有再进入前100名。\n再度进入前100名，被那些真正有作为的新项目所超越。\n的新项目所取代。\n\n然后我们有了2021年的纪念币爆炸。DOGE和...",
      "title": "在今天的加密货币领域，什么是最被高估的加密货币？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "早在2017年，就出現了ICO的爆發。它們中的大多數都很\n坦率地說，.... 狗屎。我敢肯定，前100名中有相當一部分甚至沒有再進入前100名。\n再度進入前100名，被那些真正有作爲的新項目所超越。\n的新項目所取代。\n\n然後我們有了2021年的紀念幣爆炸。DOGE和...",
      "title": "在今天的加密貨幣領域，什麼是最被高估的加密貨幣？"
    }
  ]
}