{
  "author": "Misofire",
  "the_new_excerpt": "Like many of you, I thought that sometime soon our 10 year long bull market must\nend. I began hoarding cash anticipating a drop and a recession that could last\nyears and depress stock prices.\n\nUntil I sat in one of my classes and my professor, a CMT, brought up an\ninteresting point: we might only be…",
  "original_created_utc": 1613664837,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "和你们很多人一样，我也认为，不久的某一天，我们长达10年的牛市一定会出现。\n结束。我开始囤积现金，期待下跌和可能持续的经济衰退。\n年，并打压股价。\n\n直到我坐在我的一节课上，我的教授，一个CMT，提出了一个。\n有趣的是：我们可能只是...",
      "title": "有趣的观点：牛市才刚刚开始"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "和你們很多人一樣，我也認爲，不久的某一天，我們長達10年的牛市一定會出現。\n結束。我開始囤積現金，期待下跌和可能持續的經濟衰退。\n年，並打壓股價。\n\n直到我坐在我的一節課上，我的教授，一個CMT，提出了一個。\n有趣的是：我們可能只是...",
      "title": "有趣的觀點：牛市纔剛剛開始"
    }
  ],
  "title": "Interesting Take: The Bull Market is Only Beginning",
  "created_utc": 1613679209,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Like many of you, I thought that sometime soon our 10 year long bull market must end. I began hoarding cash anticipating a drop and a recession that could last years and depress stock prices.</p>\n\n<p>Until I sat in one of my classes and my professor, a CMT, brought up an interesting point: we might only be at the start of the bull market. He brought up the classic SPX chart showing the enormous returns ever since the &#39;08 recession. Then he brought out other indices such as the Russell 2000 (IWM) and various Emerging Market ETFs (VEA, IEFA, AIA, etc.) and pointed out an oddity: Between 2018 and March 2020, these markets have been stagnant/flat, essentially trading within a range. He explained that while growth in the S&amp;P might have been great the last few years, practically the rest of the world lagged behind.</p>\n\n<p>Basically his point was this: now that all of these other indices/stocks are joining the rally after being stagnant for years, the real bull market is just beginning.</p>\n\n<p>Of course, he and I could easily be wrong. But I was interested in finding out your thoughts on this, what do you guys think?</p>\n</div><!-- SC_ON -->",
  "score": 473,
  "permalink": "/r/investing/comments/lmqam9/interesting_take_the_bull_market_is_only_beginning/",
  "subreddit": "investing",
  "id": "lmqam9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332881978
}