{
  "author": "john12tucker",
  "the_new_excerpt": "It's not a meme; they're both genuinely good stocks. I have 5% in $RICK and\n1.25% in $MORT.\n\n$RICK is up 435% since last year. They manage up-scale cabarets, strip clubs,\nand nightclubs. There's no other publicly traded company like it. Until someone\ncomes up with a strip clubs and porn ETF, I'm…",
  "original_created_utc": 1621874069,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これはミームではなく、どちらも純粋に良い銘柄だと思います。私は$RICKに5%、$MORTに1.25%出資しています。\n1.25%をMORTに入れています。\n\nRICKは昨年から435％も上昇しています。この会社は、高級キャバレー、ストリップクラブ、ナイトクラブを経営しています。\nナイトクラブを経営しています。このような上場企業は他にありません。誰かが\n誰かがストリップクラブとポルノのETFを作るまでは、私は...",
      "title": "RICKとMORT"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这不是一个备忘录，它们都是真正的好股票。我有5%的$RICK和\n1.25%的MORT。\n\n自去年以来，$RICK上涨了435%。他们管理高档歌舞厅、脱衣舞俱乐部。\n和夜总会。没有其他公开交易的公司能像它一样。直到有人\n想出一个脱衣舞俱乐部和色情ETF，我...",
      "title": "RICK和MORT"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這不是一個備忘錄，它們都是真正的好股票。我有5%的$RICK和\n1.25%的MORT。\n\n自去年以來，$RICK上漲了435%。他們管理高檔歌舞廳、脫衣舞俱樂部。\n和夜總會。沒有其他公開交易的公司能像它一樣。直到有人\n想出一個脫衣舞俱樂部和色情ETF，我...",
      "title": "RICK和MORT"
    }
  ],
  "title": "$RICK and $MORT",
  "created_utc": 1621886412,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It&#39;s not a meme; they&#39;re both genuinely good stocks. I have 5% in $RICK and 1.25% in $MORT.</p>\n\n<p>$RICK is up 435% since last year. They manage up-scale cabarets, strip clubs, and nightclubs. There&#39;s no other publicly traded company like it. Until someone comes up with a strip clubs and porn ETF, I&#39;m gonna continue to allocate 5% to it -- my next-highest allocation for an individual security is $AMZN at 2%.</p>\n\n<p>$MORT is &quot;only&quot; up 61% but it&#39;s still down ~30% since its pre-pandemic high. It&#39;s a mortgages REIT. Considering 2/3 millennials don&#39;t yet own a home, if mortgage loans and payments never get back to their pre-pandemic levels, we&#39;re gonna have bigger problems than an underperforming REIT. Plus, it has a 10% dividend yield which is bananas.</p>\n\n<p>I&#39;m not a financial advisor and my DD is that I like strip clubs and over-leveraging my home equity to go to strip clubs.</p>\n</div><!-- SC_ON -->",
  "score": 193,
  "permalink": "/r/stocks/comments/nk23fu/rick_and_mort/",
  "subreddit": "stocks",
  "id": "nk23fu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197389733
}