{
  "author": "so_very_delaro",
  "the_new_excerpt": "I got into cryptocurrency back in November 2017, right before/during the bull\nrun that had BTC and many altcoins' prices jump to ATH.\n\nMaking profits was so easy a lot of people, myself included, got too confident\nand took many risks investing in random coins as if they were the \"next big\nthing\".…",
  "original_created_utc": 1619454173,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が暗号通貨に参入したのは、2017年11月、BTCや多くのアルトコインの価格がATHにまで跳ね上がったブルランの直前／最中でした。\nBTCや多くのアルトコインの価格がATHにまで跳ね上がったブルランの直前/直後に暗号通貨に参入しました。\n\n利益を上げるのがあまりにも簡単だったので、私も含めて多くの人が自信を持ちすぎてしまい\n次の大きなもの」であるかのようにランダムなコインに投資して、多くのリスクを負ってしまいました。\n....",
      "title": "私が2017-2018年のクラッシュをどのように乗り切ったか、そしてあなたが今度のクラッシュをどのように乗り切れるか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我早在2017年11月就进入了加密货币，就在牛市之前/期间\n我是在2017年11月进入加密货币的，当时正值牛市，BTC和许多altcoins的价格都跳到了ATH。\n\n赚取利润是如此容易，很多人，包括我自己，都变得太自信了\n并冒着许多风险投资于随机币，好像它们是 \"下一个大事件\"。\n....",
      "title": "我如何度过2017-2018年的崩溃，以及你如何能度过即将到来的崩溃"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我早在2017年11月就進入了加密貨幣，就在牛市之前/期間\n我是在2017年11月進入加密貨幣的，當時正值牛市，BTC和許多altcoins的價格都跳到了ATH。\n\n賺取利潤是如此容易，很多人，包括我自己，都變得太自信了\n並冒着許多風險投資於隨機幣，好像它們是 \"下一個大事件\"。\n....",
      "title": "我如何度過2017-2018年的崩潰，以及你如何能度過即將到來的崩潰"
    }
  ],
  "title": "How I got through the 2017-2018 crash and how you could get through the upcoming one",
  "created_utc": 1619480683,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I got into cryptocurrency back in November 2017, right before/during the bull run that had BTC and many altcoins&#39; prices jump to ATH.</p>\n\n<p>Making profits was so easy a lot of people, myself included, got too confident and took many risks investing in random coins as if they were the &quot;next big thing&quot;. When the crash came, I saw my portfolio go from profits to -75% of my initial investment. Here&#39;s how I dealt with it and came back into the green in 2021.</p>\n\n<p>I am sharing my story because the same situation might happen to many newcomers when a crash comes (and it will). Don&#39;t fool yourselves, BTC will not reach 500k just like that. We might enter another 3 years of bear market that will result in:\n- People selling at loss\n- Loss of public interest for cryptocurrency \n- Enforcement of the &quot;Bitcoin is a scam&quot; mentality\n- A lot of people losing money</p>\n\n<p>So here are a few tips I learned and gathered through the years which helped me get back into the green:</p>\n\n<ol>\n<li><p>&quot;You haven&#39;t loss anything until you sell&quot;. I read this advice here on <a href=\"/r/cryptocurrency\">r/cryptocurrency</a> and it really stuck with me. Even if you bought at ATH and are now facing losses, you shouldn&#39;t neglect the possibility of your investment becoming profitable once again during a future bullrun. Some of my assets took 3 years to get back into the green but still ended up being more profitable than if I had placed that money in the bank for the same amount of time.</p></li>\n<li><p>Invest MAINLY in projects you believe in and keep the &quot;get rich quick&quot; ones to a minimum. This was one of my biggest mistakes. I was seeing shitcoins take massive gains in days while my favourite projects were stagnant and FOMO got the best of me. I ended up losing A LOT in coins that were overhyped and never recovered from the crash. Don&#39;t be fooled by high % gains, they don&#39;t mean anything when a crash comes and your quick earned profit disappears never to be seen again.</p></li>\n<li><p>Don&#39;t be afraid to reorganize your portfolio even if you&#39;re in the negative. When I was down 75% from my initial investment, I started feeling like my money was already lost and didn&#39;t mind taking &quot;risks&quot; with it. I sold some assets I didn&#39;t believe in anymore and used that money to buy more of the ones I still believed in. That allowed me to buy my favourite coins at crazy low prices without injecting more fiat. That alone brought me back in the positive in 2021.</p></li>\n<li><p>TAKE SOME PROFIT OUT. I understand a lot of us are hoping for life changing gains and live by the hodl mentality. But one thing I learned in crypto is: sooner or later prices will go down. Having profits ready to be used when a crash comes is what will save your initial investment. Don&#39;t be afraid to set some profit aside in stable coins ready to buy a TRUE dip. Not a -15% but one that would bring your portfolio value to almost nothing. Knowing you have some profits ready to save your ass when a crash comes will make dips easier on your sanity and future bull runs much more profitable.</p></li>\n<li><p>Be patient. If you really believe in cryptocurrency and believe this is just the beginning, don&#39;t let dips and crashes get the best of you. BTC went from a 20k ATH to 5k in 2017-2018 only to come back to 60k in 2021. </p></li>\n</ol>\n\n<p>Once again, keep in mind that bull runs make us all too confident. It&#39;s easy to joke about hodling through the storms but it won&#39;t be once they come for real. Be ready and rational when it happens.</p>\n</div><!-- SC_ON -->",
  "score": 377,
  "permalink": "/r/CryptoCurrency/comments/mz1idx/how_i_got_through_the_20172018_crash_and_how_you/",
  "subreddit": "CryptoCurrency",
  "id": "mz1idx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776210474
}