{
  "author": "TNGSystems",
  "the_new_excerpt": "Between May 28 and the 31st, all AGI tokens in exchange wallets or held on\nLedgers etc will be converted from AGI to AGIX, so that they can run natively on\nCardanos blockchain.\n\nThis is the first project to have completed a move and I think as we have a date\nnow for Smart Contracts (end of August)…",
  "original_created_utc": 1622281029,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "5月28日から31日までの間に、取引所のウォレットやLedgerなどに保管されているすべてのAGIトークンが、AGIからAGIXに変換されます。\nLedgersなどで保有されているすべてのAGIトークンは、AGIからAGIXに変換され、Cardanosのブロックチェーン上でネイティブに動作するようになります。\nCardanosブロックチェーン上でネイティブに動作するようになります。\n\nこれは、移動を完了した最初のプロジェクトであり、スマートコントラクトの日付が決まっているように、私たちは考えています。\nスマートコントラクトの期日（8月末）も決まっていますし...。",
      "title": "昨日、EthereumからCardanoに正式に移行した最初のプロジェクトがありました。SingularityNETは、取引速度とコストを理由に、Cardanoに移行しました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在5月28日至31日期间，交易所钱包中的所有AGI代币或持有的\nLedgers等的所有AGI代币都将从AGI转换为AGIX，这样它们就可以原生运行在\nCardanos区块链上运行。\n\n这是第一个完成迁移的项目，我认为由于我们有一个日期\n现在智能合约的日期（8月底）...",
      "title": "昨天标志着第一个正式从以太坊转移到Cardano的项目。SingularityNET以交易速度和成本作为转移到Cardano的有力理由。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在5月28日至31日期間，交易所錢包中的所有AGI代幣或持有的\nLedgers等的所有AGI代幣都將從AGI轉換爲AGIX，這樣它們就可以原生運行在\nCardanos區塊鏈上運行。\n\n這是第一個完成遷移的項目，我認爲由於我們有一個日期\n現在智能合約的日期（8月底）...",
      "title": "昨天標誌着第一個正式從以太坊轉移到Cardano的項目。SingularityNET以交易速度和成本作爲轉移到Cardano的有力理由。"
    }
  ],
  "title": "Yesterday marked the first Project to officially move from Ethereum to Cardano. SingularityNET has moved citing transaction speed and cost as a compelling reason to go to Cardano.",
  "created_utc": 1622294641,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Between May 28 and the 31st, all AGI tokens in exchange wallets or held on Ledgers etc will be converted from AGI to AGIX, so that they can run natively on Cardanos blockchain.  </p>\n\n<p>This is the first project to have completed a move and I think as we have a date now for Smart Contracts (end of August) it will be the first of many.  </p>\n\n<p>While ETH 2.0 will be cheaper and faster than Ethereum is now, there’s still a compelling case for projects to use the ERC-20 converter, move over to Cardano and enjoy cheaper fees, faster transactions, energy efficient network and have their token represented natively with all the same rights and priorities on the network as ADA.  </p>\n\n<p>Charles Hoskinson claims there are just over 100 projects looking to move from Eth to Cardano as more functionality is added in the coming months. Whether that number changes due to updates in Ethereum 2.0’s development remains to be seen.</p>\n</div><!-- SC_ON -->",
  "score": 1133,
  "permalink": "/r/CryptoCurrency/comments/nnjwj0/yesterday_marked_the_first_project_to_officially/",
  "subreddit": "CryptoCurrency",
  "id": "nnjwj0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804296491
}