{
  "author": "TrueNeutrino",
  "the_new_excerpt": "I applied for options trading and margin. I asked for full Level 3 access, like\nthe big dogs. About a week later they sent me an email asking me to call them. I\nassume to laugh at me and call me an idiot because on the application I had to\nput that I have never traded options and am a moron. So I…",
  "original_created_utc": 1617223862,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我申请的是期权交易和保证金。我要求获得完整的三级权限，像\n大狗。大约一周后，他们给我发了一封电子邮件，要求我给他们打电话。I\n我以为他们会嘲笑我，说我是个白痴，因为在申请书上我必须写上我从未做过期权交易，是个白痴。\n说我从来没有交易过期权，是个白痴。所以我...",
      "title": "像我这样的白痴的期权交易"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我申請的是期權交易和保證金。我要求獲得完整的三級權限，像\n大狗。大約一週後，他們給我發了一封電子郵件，要求我給他們打電話。I\n我以爲他們會嘲笑我，說我是個白癡，因爲在申請書上我必須寫上我從未做過期權交易，是個白癡。\n說我從來沒有交易過期權，是個白癡。所以我...",
      "title": "像我這樣的白癡的期權交易"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "オプション取引と信用取引を申し込みました。レベル3のフルアクセスをお願いしました\n大物たち。約1週間後、彼らは私に電話をするようにとメールを送りました。I\nというのも、申請書には、私のことをバカだと笑うと想定しています。\n私はオプション取引をしたことがなく、バカです。だから私は...",
      "title": "私のようなバカのためのオプション取引"
    }
  ],
  "title": "Options trading for a moron like me",
  "created_utc": 1617246250,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I applied for options trading and margin. I asked for full Level 3 access, like the big dogs. About a week later they sent me an email asking me to call them. I assume to laugh at me and call me an idiot because on the application I had to put that I have never traded options and am a moron. So I called them today. The guys asked what my strategy was and my knowledge base. He asked me if I knew what a &quot;call&quot; and &quot;put&quot; were. Honestly I gotta say he was more polite and understanding than I would have been with someone as stupid as I am. I said I read books and watched videos. Actually other people read books and told me about it and I watched YouTube videos. I asked him what level access do I need to short stocks and I said it with a straight face. He said I&#39;d need a margin account, so I asked what level could I trade options without margin and he gave me level 1 access. Tbh, I&#39;m surprised he let me have that. He said for the higher level 3 access I originally asked for I would need margin and a minimum of 100k in my account.</p>\n</div><!-- SC_ON -->",
  "score": 79,
  "permalink": "/r/stocks/comments/mhfesz/options_trading_for_a_moron_like_me/",
  "subreddit": "stocks",
  "id": "mhfesz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357144748
}