{
  "author": "CanaKagan",
  "the_new_excerpt": "Remember everyone, it’s just a perception of loss atm. 1 BTC still equals 1 BTC,\nor in my case 1 Satoshi still equals 1 Satoshi.\n\nHead back to your grind, keep earning that fiat, take care of your family and\ntake care of yourselves.\n\nIf you need the funds to survive, fold and use it. If you dont…",
  "original_created_utc": 1621611217,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "みんな覚えておいて、それはただの損失の認識のatmだ。1BTCはまだ1BTCに等しい。\n私の場合は1Satoshiが1Satoshiに相当します。\n\n自分の仕事に戻り、フィアットを稼ぎ続け、家族を大切にし、自分自身を大切にしましょう。\n自分自身を大切にしましょう。\n\n生きるために資金が必要な場合は、折りたたんで使いましょう。もしそうでなければ...。",
      "title": "暗号はまだ暴落中。クール、クール、クール。私は仕事に戻って、これが終わったときのためにフィアットを稼ぎます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "请大家记住，目前只是对损失的看法。1 BTC仍然等于1 BTC。\n或者在我看来，1个中本聪仍然等于1个中本聪。\n\n回到你的工作中去，继续赚取法币，照顾好你的家人和\n照顾好你们自己。\n\n如果你需要这些资金来生存，那就折腾吧，使用它。如果你不需要...",
      "title": "Crypto仍然在崩溃。酷，酷，酷。我要回去工作了，为这一切结束后赚取一些法币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "請大家記住，目前只是對損失的看法。1 BTC仍然等於1 BTC。\n或者在我看來，1箇中本聰仍然等於1箇中本聰。\n\n回到你的工作中去，繼續賺取法幣，照顧好你的家人和\n照顧好你們自己。\n\n如果你需要這些資金來生存，那就折騰吧，使用它。如果你不需要...",
      "title": "Crypto仍然在崩潰。酷，酷，酷。我要回去工作了，爲這一切結束後賺取一些法幣。"
    }
  ],
  "title": "Crypto’s still crashing. Cool, cool, cool. I’m going back to work, earning some fiat for when this is over.",
  "created_utc": 1621625764,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Remember everyone, it’s just a perception of loss atm. 1 BTC still equals 1 BTC, or in my case 1 Satoshi still equals 1 Satoshi.</p>\n\n<p>Head back to your grind, keep earning that fiat, take care of your family and take care of yourselves. </p>\n\n<p>If you need the funds to survive, fold and use it. If you dont need it, just chill. </p>\n\n<p>tbh, this post is mostly just to talk myself into a happy place. Alright, back to the grind.</p>\n\n<p>Cheers all.</p>\n\n<p>Edit - lovin to good vibes, thanks all. Great to see folks keeping a level head, only investing what they can afford to lose, and waiting out the storm.</p>\n\n<p>Edit 2 - wow, karma farming downvoters are brutal, so many good comments at 0, updooting just to balance out the universe.</p>\n</div><!-- SC_ON -->",
  "score": 1982,
  "permalink": "/r/CryptoCurrency/comments/nhvcul/cryptos_still_crashing_cool_cool_cool_im_going/",
  "subreddit": "CryptoCurrency",
  "id": "nhvcul",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197381679
}