{
  "author": "h1way",
  "original_created_utc": 1637064104,
  "title": "Either we're in for a huge six weeks or all those EOY predictions will look absolutely foolish. What's your guess?",
  "created_utc": 1637073337,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Let me start by saying I&#39;m not bearish, I&#39;m not selling and I don&#39;t think this bull run is over or anything like that. All the same, almost all price predictions I&#39;ve stumbled upon seem unrealistic at this point in time.</p>\n\n<p>I&#39;m not judging just yet but looking at the 30days chart, the likes of ETH (+14,6%), MATIC (+6,43%), DOT (+1,14%) aren&#39;t up by much. Bitcoin is up barely more than 2% compared to October 16th and, right now, below its April ex-ATH .</p>\n\n<p>We haven&#39;t really seen this current bull run take off yet, have we? Some small caps have pumped pretty well but top50 coins haven&#39;t at all. Is BTC 100k still on the cards? Is this all a good sign and we&#39;ll see a prolonged bull run well into 2022? What are your expectations?</p>\n</div><!-- SC_ON -->",
  "score": 289,
  "permalink": "/r/CryptoCurrency/comments/qv6aem/either_were_in_for_a_huge_six_weeks_or_all_those/",
  "subreddit": "CryptoCurrency",
  "id": "qv6aem",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Let me start by saying I'm not bearish, I'm not selling and I don't think this\nbull run is over or anything like that. All the same, almost all price\npredictions I've stumbled upon seem unrealistic at this point in time.\n\nI'm not judging just yet but looking at the 30days chart, the likes of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最初に申し上げておきますが、私は弱気でもなければ、売っているわけでもなく、この強気の相場が終わったとは思っていません。\nブルランが終わったなどとは思っていません。しかし、私が偶然見つけたほとんどすべての価格\n私が偶然見つけた価格予測は、現時点では現実的ではないようです。\n\nまだ判断はしていませんが、30日のチャートを見ると、例えば...",
      "title": "6週間で大きな変化があるか、あるいはEOYの予測が全くの馬鹿げたものになるか。あなたはどう思いますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "首先，我要说的是，我不看跌，我不卖，我不认为这轮牛市行情已经结束或类似的事情。\n牛市运行已经结束或任何类似的东西。同样，几乎所有的价格\n预测，在这个时间点上，我偶然发现的几乎都是不现实的。\n\n我还没有做出判断，但从30天的图表来看，像...",
      "title": "要么我们将迎来一个巨大的六周，要么所有这些EOY的预测将看起来绝对是愚蠢的。你的猜测是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，我要說的是，我不看跌，我不賣，我不認爲這輪牛市行情已經結束或類似的事情。\n牛市運行已經結束或任何類似的東西。同樣，幾乎所有的價格\n預測，在這個時間點上，我偶然發現的幾乎都是不現實的。\n\n我還沒有做出判斷，但從30天的圖表來看，像...",
      "title": "要麼我們將迎來一個巨大的六週，要麼所有這些EOY的預測將看起來絕對是愚蠢的。你的猜測是什麼？"
    }
  ]
}