{
  "author": "gorays21",
  "the_new_excerpt": "The market is closed today so I thought to post some fun history about stock\nmarket!\n\n\n\n * Belgium had the world's first stock market(without actual stocks) back in\n   1400's.\n * The East India Company is widely recognized as the world’s first publicly\n   traded company and the reason for them…",
  "original_created_utc": 1619311466,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日は市場が休みなので、株式市場に関する楽しい歴史を投稿しようと思いました。\n市場の歴史を紹介します。\n\n\n\n * ベルギーには、1400年代に世界初の株式市場（実際の株式を持たない）がありました。\n   1400's.\n * 東インド会社は世界初の株式公開会社として広く知られています。\n   東インド会社は世界初の株式公開会社として広く知られており、その理由は...",
      "title": "株式市場の歴史を知ろう"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今天市场休市，所以我想发表一些关于股票的有趣历史\n市场的有趣历史!\n\n\n\n * 比利时早在1400年就有了世界上第一个股票市场（没有真正的股票）。\n   1400's.\n * 东印度公司被公认为是世界上第一个公开交易的公司。\n   东印度公司被公认为世界上第一家公开交易的公司，其原因是...",
      "title": "关于股票市场的历史!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天市場休市，所以我想發表一些關於股票的有趣歷史\n市場的有趣歷史!\n\n\n\n * 比利時早在1400年就有了世界上第一個股票市場（沒有真正的股票）。\n   1400's.\n * 東印度公司被公認爲是世界上第一個公開交易的公司。\n   東印度公司被公認爲世界上第一家公開交易的公司，其原因是...",
      "title": "關於股票市場的歷史!"
    }
  ],
  "title": "History about Stock Market!",
  "created_utc": 1619318199,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The market is closed today so I thought to post some fun <strong>history</strong> about stock market!</p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>Belgium had the world&#39;s first stock market(without actual stocks) back in 1400&#39;s.</li>\n<li>The East India Company is widely recognized as the world’s first publicly traded company and the reason for them publicly traded is because of <strong>risk</strong>. Sailing all over the planet was too risky for any company during that time. Ships were lost, fortunes were squandered, and financiers realized they had to do something to mitigate all that risk.</li>\n<li>Early stock trading happened at <strong>Coffee shops,</strong> and stocks were hand written in paper and inventors had to trade their stocks with other investors in coffee shops.</li>\n<li>It was tough to make out legit companies to illegitimate companies back in the day, and in many cases companies were able to make tons of money before a single ship was ever set for sail. And because of that a bubble was burst and the government of England banned the issuing of shares until 1825.</li>\n<li>And despite ban of issues shares, <strong>London Stock Exchange</strong> was established in 1801, it was very limited exchange because of the ban of issuing shares.</li>\n<li>And in 1817, <strong>New York stock exchange</strong> was established and it started trading since its very first day.</li>\n<li>And today, almost every single country has a stock market.  Every day, trillions of dollars are traded on stock markets.</li>\n</ul>\n\n<p>Here are the top 10 stock markets in the world today ranked by market capitalization:</p>\n\n<ol>\n<li>New York Stock Exchange</li>\n<li>NASDAQ</li>\n<li>Tokyo Stock Exchange</li>\n<li>London Stock Exchange Group</li>\n<li>Euronext</li>\n<li>Hong Kong Stock Exchange</li>\n<li>Shanghai Stock Exchange</li>\n<li>Toronto Stock Exchange</li>\n<li>Frankfurt Stock Exchange</li>\n<li>Australian Securities Exchange</li>\n</ol>\n</div><!-- SC_ON -->",
  "score": 2430,
  "permalink": "/r/stocks/comments/mxx2m9/history_about_stock_market/",
  "subreddit": "stocks",
  "id": "mxx2m9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776215980
}