{
  "author": "timeistheonlymoney",
  "the_new_excerpt": "So the media is chocked full of old, super rich people and politicians telling\neveryone not to invest lately. They all seem to have crawled out of their\nwoodwork/mansions like cockroaches. What's up with that?\n\nThey all speak down to the public as if we're all a bunch of simpleton,\npeasants, or…",
  "original_created_utc": 1614307398,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "所以，媒体上充斥着老牌的超级富豪和政客，他们告诉\n大家最近不要投资。他们似乎都已经爬出了自己的\n木制品/住宅像蟑螂一样。这是咋回事？\n\n他们都对公众说得很低调，好像我们都是一群单纯的人。\n农民，或...",
      "title": "那些千万富翁、亿万富翁、基金经理叫大家不要投资是怎么回事？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以，媒體上充斥着老牌的超級富豪和政客，他們告訴\n大家最近不要投資。他們似乎都已經爬出了自己的\n木製品/住宅像蟑螂一樣。這是咋回事？\n\n他們都對公衆說得很低調，好像我們都是一羣單純的人。\n農民，或...",
      "title": "那些千萬富翁、億萬富翁、基金經理叫大家不要投資是怎麼回事？"
    }
  ],
  "title": "What's up with all the multimillionaires, billionaires, and fund managers telling everyone not to invest?",
  "created_utc": 1614312537,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So the media is chocked full of old, super rich people and politicians telling everyone not to invest lately.  They all seem to have crawled out of their woodwork/mansions like cockroaches.  What&#39;s up with that?</p>\n\n<p>They all speak down to the public as if we&#39;re all a bunch of simpleton, peasants, or stupid children.  They keep parroting the same message in condescending tones that slow and steady investments are the way.  Do the 401K.  Do the ETF.  You&#39;re not going to get rich quick (or at all).  As if they became billionaires with slow and steady and honest work vs. all the other ways they&#39;ve captured most of our assets and resources, and exploited the working class.  That point isn&#39;t arguable.  The numbers don&#39;t lie.  If you&#39;re pulling in billions, capturing and retaining all the wealth this nation is creating, you&#39;re getting far far more than your fair share and the consequences are spreading like wildfire.  Anyhow, over and over this past week with almost feverish effort, they are condemning the savvy youth of today who are spreading and sharing their research and knowledge on economics, businesses, and investing.</p>\n\n<p>Sure, there are jokesters and a handful of fools who boast their losses and blather silliness about meme stocks.  We joke along, but this is serious business, and we&#39;re not simpletons or children.  You can&#39;t make an honest living, slow and steady, and earn enough with work alone these days to realistically satisfy all of your responsibilities and ease into your twilight years.  You MUST, absolutely MUST learn how the game is rigged, and play the same tactics as all those who are telling us to go back to exploitive fund managers and retirement plans.  Yes.  Do that, but do not trust that your retirement plan administrators are going to forego their multimillion dollar lifestyles in order to give you a fair return on your savings and investments.  Take charge yourself.  Do your research.</p>\n\n<p>Finally, find a new game to play, if you find it&#39;s become too corrupted. There are sharks out there, and they&#39;ve commandeered our money, our resources, and our media. I say ignore their propaganda.</p>\n</div><!-- SC_ON -->",
  "score": 90,
  "permalink": "/r/stocks/comments/lsnv8j/whats_up_with_all_the_multimillionaires/",
  "subreddit": "stocks",
  "id": "lsnv8j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937742099
}