{
  "author": "AxStream",
  "original_created_utc": 1641496838,
  "title": "MATIC brought down by some flowers?",
  "created_utc": 1641517725,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I was bullish on MATIC since I got into crypto, a few days ago I decided to actually use their network to mint some NFTs my brother and I came up with and oh man has my view on MATIC changed fast!&lt;/p&gt;\n\n&lt;p&gt;Not only was it a pain just getting into and established on the network, some damn sunflower game came along and brought the network down! We’re talking increased fees and while still cheaper then ETH I’m hear talking of tx’s costing up to a few MATIC from fractions of one per tx. &lt;/p&gt;\n\n&lt;p&gt;And now the MATIC mainnet is down so like yeaaaa gonna go ahead and not be as bullish on this one.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 309,
  "permalink": "/r/CryptoCurrency/comments/rxmjwh/matic_brought_down_by_some_flowers/",
  "subreddit": "CryptoCurrency",
  "id": "rxmjwh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I was bullish on MATIC since I got into crypto, a few days ago I decided to\nactually use their network to mint some NFTs my brother and I came up with and\noh man has my view on MATIC changed fast!\n\nNot only was it a pain just getting into and established on the network, some\ndamn sunflower game…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号に手を出したときからMATICに強気でしたが、数日前に\n弟と一緒に考えたNFTを鋳造するために、実際に彼らのネットワークを使用しました。\nMATICに対する見方が一気に変わりましたね。\n\nネットワークに入り、確立するのが面倒だっただけでなく、いくつかの\nクソひまわりゲーム...",
      "title": "MATICが花で倒された？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "自从我进入加密货币领域，我就一直看好MATIC，几天前我决定\n实际使用他们的网络来铸造一些我和我兄弟想出的NFT，结果\n哦，我对MATIC的看法迅速改变了!\n\n不仅是进入和建立网络的痛苦，一些\n该死的 \"向日葵 \"游戏...",
      "title": "MATIC被一些鲜花带坏了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "自從我進入加密貨幣領域，我就一直看好MATIC，幾天前我決定\n實際使用他們的網絡來鑄造一些我和我兄弟想出的NFT，結果\n哦，我對MATIC的看法迅速改變了!\n\n不僅是進入和建立網絡的痛苦，一些\n該死的 \"向日葵 \"遊戲...",
      "title": "MATIC被一些鮮花帶壞了？"
    }
  ]
}