{
  "author": "sewer_child123",
  "the_new_excerpt": "I'm an extremely novice trader, but something I've been thinking about that\nothers might find valuable.\n\nLet's say you are someone like me who scrolls through hoping to find that\namazing DD that is going to be the next big thing and rocket you right to the\nmoon... You think you're staying on top of…",
  "original_created_utc": 1612982972,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个极度新手的交易员，但有些事情我一直在思考，就是\n别人可能会觉得有价值。\n\n比方说，你是像我这样的人，希望通过翻阅希望发现\n惊人的DD，这将是下一个伟大的事情，并火箭你的权利\n月亮... 你以为你是住在上面的... ...",
      "title": "炒股买入不是办法"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個極度新手的交易員，但有些事情我一直在思考，就是\n別人可能會覺得有價值。\n\n比方說，你是像我這樣的人，希望通過翻閱希望發現\n驚人的DD，這將是下一個偉大的事情，併火箭你的權利\n月亮... 你以爲你是住在上面的... ...",
      "title": "炒股買入不是辦法"
    }
  ],
  "title": "Buying on stock hype is not the way",
  "created_utc": 1612988956,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m an extremely novice trader, but something I&#39;ve been thinking about that others might find valuable.</p>\n\n<p>Let&#39;s say you are someone like me who scrolls through hoping to find that amazing DD that is going to be the next big thing and rocket you right to the moon... You think you&#39;re staying on top of things by reading the posts end-to-end and finding opportunities that really make sense. You get really excited about opportunities with awesome DD but for one glaring issue....timing.</p>\n\n<p>The unfortunate reality is that this DD you found is only likely to get up-voted and become visible to you, after the stock has ALREADY popped. When the stock pops people get excited and they share it out...but it&#39;s always coming AFTER the pop. </p>\n\n<p>So, if your objective is to make a quick profit, you&#39;re setting yourself up for failure. Sure, you might get lucky, and you might still make a profit long-term, but your timing in the short-term will always be sub-optimal.</p>\n\n<p>Now...I&#39;m not knocking good DD as a way to find opportunities, but you should update your thinking and maybe taking the following steps instead of buying willy-nilly:</p>\n\n<ol>\n<li>After you see some sexy DD, check if the stock is already spiking</li>\n<li>If the stock is already spiking...then WATCH it...don&#39;t BUY it</li>\n<li>Wait for a short-term dip and buy then if you are still bullish </li>\n<li>Plan to hold for medium - long term...don&#39;t hope for a big short-term gain</li>\n</ol>\n</div><!-- SC_ON -->",
  "score": 559,
  "permalink": "/r/stocks/comments/lh0na9/buying_on_stock_hype_is_not_the_way/",
  "subreddit": "stocks",
  "id": "lh0na9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123204993
}