{
  "author": "VVaId0",
  "the_new_excerpt": "First let me educate on how options work. An option is a contract for to buy or\nsell 100 units of a stock/coin set at a certain price if the price is above\n(call) or below (put). These contracts are sold at a premium per unit.\n\nFor example Nano is 7.16 right now and lets say I own 100 coins but to…",
  "original_created_utc": 1619183003,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "まず、オプションの仕組みについて説明します。オプションとは、ある価格で設定された株式やコインを100単位買うか売るかの契約です。\nオプションとは、ある株やコインを100単位買うか売るかの契約です。\nコール）または（プット）以下の場合に、一定の価格で100単位の株式/コインを売買する契約です。この契約は、1単位あたりのプレミアムで販売されます。\n\n例えば、Nanoは現在7.16で、私が100枚のコインを持っているとします。",
      "title": "明日満期のオプションがこのディップの大きな要因となっており、税金のニュースだけではありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "首先让我介绍一下期权的工作原理。期权是一份合同，在价格高于某一价格的情况下购买或\n卖出100个单位的股票/硬币，如果该价格高于\n(看涨)或低于(看跌)。这些合同是以每单位的溢价出售的。\n\n例如，纳米现在是7.16，假设我拥有100个硬币，但为了...",
      "title": "明天到期的期权是这次下跌的一个重要因素，而不仅仅是税收消息。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先讓我介紹一下期權的工作原理。期權是一份合同，在價格高於某一價格的情況下購買或\n賣出100個單位的股票/硬幣，如果該價格高於\n(看漲)或低於(看跌)。這些合同是以每單位的溢價出售的。\n\n例如，納米現在是7.16，假設我擁有100個硬幣，但爲了...",
      "title": "明天到期的期權是這次下跌的一個重要因素，而不僅僅是稅收消息。"
    }
  ],
  "title": "Options expiring tomorrow are a big factor of this dip, not just the tax news.",
  "created_utc": 1619206239,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>First let me educate on how options work. An option is a contract for to buy or sell 100 units of a stock/coin set at a certain price if the price is above (call) or below (put). These contracts are sold at a premium per unit.</p>\n\n<p>For example Nano is 7.16 right now and lets say I own 100 coins but to protect myself in the event of it mega crashing to 0 I can buy a $6 Put. The premium to buy this might be $0.50 PER UNIT, so in this case $50 total. The person I bought the contract from for $50 is agreeing to buy all 100 of my NANO for $6 each even if it dropped to $0 by the time the contract expires. So if it doesnt drop below $6 that $50 I just paid him becomes worthless on expiration and that person just made a free $50. This person profits as long as the coin doesnt reach a price of 5.50 ($6-0.50 premium)</p>\n\n<p>This is where the game gets played, options are expiring today. As of last week we were sitting pretty around $60k so the lower price option premiums were probably absolutely dirt cheap as there is &quot;no way BTC drops by $10k in a week before expiration&quot; so the sellers of these contracts are just trying to get free money. However Whales will buy a shitload of contracts that are basically worthless due to theta decay since the expiration is so close, then they can create a huge sell off at these high prices, tank the price, then they can either excercise these options or sell them for massive gains as they had just bought them for dirt cheap just last week. Then after expiration they can just reload their bag and then some with these extra profits at a lower price. So not only do they sell high, they profit on these dirt cheap puts they buy and are able to gain a much larger position by buying more coin or flipping it over and buying calls as the price will increase throughout the next month. This process just keeps spinning like a wheel.</p>\n\n<p>This has happened at the end of the last 3 months like clockwork.</p>\n</div><!-- SC_ON -->",
  "score": 302,
  "permalink": "/r/CryptoCurrency/comments/mwury2/options_expiring_tomorrow_are_a_big_factor_of/",
  "subreddit": "CryptoCurrency",
  "id": "mwury2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776208792
}