{
  "author": "hodlonbaby",
  "the_new_excerpt": "With a lot of new people entering the market, i thought it could be helpful to\ngive a brief summary of why holding truly is the best strategy you can take.\nBear in mind there will be some exceptions, but I think this should apply to\nmost people here that are new in the space. I invite experienced…",
  "original_created_utc": 1609092832,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "随着很多新人进入这个市场，我想这可能会有帮助\n给出一个简短的总结，说明为什么真实持有是你能采取的最好策略。\n请记住，会有一些例外，但我认为这应该适用于\n这里的大多数人都是这个空间的新人。我邀请有经验的…",
      "title": "永远不要低估霍德尔的力量"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "隨着很多新人進入這個市場，我想這可能會有幫助\n給出一個簡短的總結，說明爲什麼真實持有是你能採取的最好策略。\n請記住，會有一些例外，但我認爲這應該適用於\n這裏的大多數人都是這個空間的新人。我邀請有經驗的…",
      "title": "永遠不要低估霍德爾的力量"
    }
  ],
  "title": "Never underestimate the power of Hodl",
  "created_utc": 1609127119,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p>With a lot of new people entering the market, i thought it could be helpful to give a brief summary of why holding truly is the best strategy you can take. Bear in mind there will be some exceptions, but I think this should apply to most people here that are new in the space. I invite experienced investors to share any additional pieces of advice you deem necessary to pass on to the new “generation” of entrants.</p>\n\n<p>Here a few reasons why holding truly is the best thing you can do:</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Day Traders lose money</strong> </p>\n\n<p>80% of active traders lose money, 10% break even and the last 10% make money. Im not saying there aren’t experienced traders that don’t make a fortune. They do. However, this requires A LOT of work, dedication and discipline. Sadly, most people will fall under the losing category. I think the “instagram-image” of successful investors play day trading out to be a simple thing that everyone will be able to do. Rest assured, this is not the reality. From my personal experience, I’ve also attempted to day trade and take advantage of swings, but looking back at my last 4 years in the crypto world, I most surely would have made A LOT more money by just keeping my crypto untouched and not being tempted to day trade.</p>\n\n<p>Source: <a href=\"https://www.wealthwithin.com.au/learning-centre/share-trading-tips/trading-the-stock-market\">https://www.wealthwithin.com.au/learning-centre/share-trading-tips/trading-the-stock-market</a></p>\n\n<p>&#x200B;</p>\n\n<p><strong>Taxes</strong></p>\n\n<p>This area is tricky. Every country has different rules in regards to taxes, therefore always make sure you consult with an accountant before making any decisions. Nevertheless, the general advice here is that all trades will trigger some kind of tax liability. Day trading will involve a lot of trades, some profitable, some not. Therefore keeping an eye on your taxes will be a lot more difficult when you day trade. There are countless stories I know of people making big bucks on a trade, using those profits to re-invest and then losing their money, only to find out they still owe money from the profitable trade, and not only now owe a large amount of taxes, but have also lost their money on new trades. As the saying goes, if you’re gonna sell drugs, make sure you still pay your taxes, because not paying taxes is 10x the crime of selling drugs. Whether you agree with the concept of taxes or not, you will feel the full power of the law when avoiding taxes, and therefore, holding will simplify your tax payments massively.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>FUD</strong></p>\n\n<p>Fear, uncertainty and Doubt. Take the latest ripple news as an example. Im not going to go into detail at all whether or not ripple did anything bad at all. My point here is that this market is young, markets tend to overreact massively when news comes out. Most people will panic sell, and then kick themselves when they re-enter their original positions at higher prices.Im not saying its not possible to sell high and buy low, but there is a reason people joke about things like “Buy high, sell low”. Whatever you think you know about the market, you don’t know anything. Whether you believe in technical analysis, as a beginner, FUD will cause you to want to abandon ship at any sign of negative news. Remember that time a Chinese article claimed Vitalik Buterin was killed din a car crash? The market bled more than the virgin Mary on her first period, only to regain most of the losses shortly after. Long story short, most of the FUD that exists now, you won’t even remember a year from now. Don’t get emotional, don’t overreact, don’t panic!</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Risk of exchanges</strong></p>\n\n<p>Never leave your coins on an exchange. When trying to time the market, you may be temped to keep your coins on the exchange to be able to react quickly to news, this puts your coins at risk as you are trusting the exchange with your money.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Unpredictable markets</strong></p>\n\n<p>As the name implies, markets are unpredictable. I get messages daily from new friends entering this space asking “Why is the market down 10% today????”. Nobody, i don’t care if your warren buffet or jimmy buffet, nobody knows if the stocks gonna go up down left right or in circles.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Long term thinking</strong></p>\n\n<p>I remember talking to my friend at a BTC price of 200$ if we should be buying more. My god I wish we had. What im getting at is, you need to think long term. Don’t buy crypto if you’re not willing to hold them for at least a few years. This market is so so young and we have no idea where it is going. Think of the gains we could see if only institutions invested just 1% of their capital in the crypto space. Think long term!</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Take profits</strong></p>\n\n<p>This post is not to say you shouldn’t take profits. Do! In cray times like this we all need to keep some small sense of reality in us, your bills will come, your life outside of crypto has real costs, don’t bankrupt yourself waiting for a moon. Invest what you can afford to lose and be patient. There will be bumps, but holding what you can afford to lose is the way to go.</p>\n\n<p>Ive never really made a post like this, many might see this and disregard all of it. This is a post mostly dedicated to new investors, who may be tempted to day trade or panic sell very easily as they are new to the space and are not aware of the things more experienced investors may know. This all represents just my opinion, but i think its important to share, as if it even helps just 1 person, then I will consider this post a success. </p>\n\n<p>“ A child only learns that fire is hot by burning themselves a few times” —&gt; If this post hasn’t convinced you, no problem, take a small portion of your investments and give it a go. Maybe you make a killing, and i hope you do. Maybe you lose it all and now have learnt a painful lesson. Either way, trying will let you know the truth for yourself. Thats one way to be assured you learn no matter what :) </p>\n\n<p>Good luck out there, and feel free to add or correct anything you may agree/disagree with.</p>\n</div><!-- SC_ON -->",
  "score": 168,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/_xjl22eOZdwhB1qKlkdfbE_k_9VLEonn0NvM6pJ_9sw.jpg?auto=webp&s=19e4abea60a1f2e6753813149277ba4e0d76c546",
          "width": 1200,
          "height": 1200
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/_xjl22eOZdwhB1qKlkdfbE_k_9VLEonn0NvM6pJ_9sw.jpg?width=108&crop=smart&auto=webp&s=658c8b39daf289afdb87dd6898dfdc649dd119d5",
            "width": 108,
            "height": 108
          },
          {
            "url": "https://external-preview.redd.it/_xjl22eOZdwhB1qKlkdfbE_k_9VLEonn0NvM6pJ_9sw.jpg?width=216&crop=smart&auto=webp&s=19be47040e14d6b7784e4d5ffb6d16c7cd5508d2",
            "width": 216,
            "height": 216
          },
          {
            "url": "https://external-preview.redd.it/_xjl22eOZdwhB1qKlkdfbE_k_9VLEonn0NvM6pJ_9sw.jpg?width=320&crop=smart&auto=webp&s=10f29bc570334e9bcc7caa85f44def6c342f67a0",
            "width": 320,
            "height": 320
          },
          {
            "url": "https://external-preview.redd.it/_xjl22eOZdwhB1qKlkdfbE_k_9VLEonn0NvM6pJ_9sw.jpg?width=640&crop=smart&auto=webp&s=a0557cee726d0bbb599b7bf0533ec3c5b504e32d",
            "width": 640,
            "height": 640
          },
          {
            "url": "https://external-preview.redd.it/_xjl22eOZdwhB1qKlkdfbE_k_9VLEonn0NvM6pJ_9sw.jpg?width=960&crop=smart&auto=webp&s=adc74a71eccfb6354273eb525fd6a7d3c361eaac",
            "width": 960,
            "height": 960
          },
          {
            "url": "https://external-preview.redd.it/_xjl22eOZdwhB1qKlkdfbE_k_9VLEonn0NvM6pJ_9sw.jpg?width=1080&crop=smart&auto=webp&s=6d3c0a97be329b3247eee2bd6d5daa2d57ee6754",
            "width": 1080,
            "height": 1080
          }
        ],
        "variants": {},
        "id": "4Dt1K2EX5PQER7-K3IRtvZP2eFSMCosvA3KLiffr-hs"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/kl8bd5/never_underestimate_the_power_of_hodl/",
  "subreddit": "CryptoCurrency",
  "id": "kl8bd5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609495332508
}