{
  "author": "zucchini_fries",
  "the_new_excerpt": "As tax day in the U.S (5/17) quickly crept up on me, I found myself in a\npredicament: I was crypto rich but cash poor and did not have enough dollars to\npay my taxes. This led me to doing research on how to borrow using crypto as\ncollateral for I was trying to avoid selling crypto to pay taxes,…",
  "original_created_utc": 1622725057,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "米国のタックスデイ（5/17）が目前に迫り、私はある苦境に立たされていました。\n窮地に陥りました。私は暗号化された金持ちですが、現金は乏しく、税金を支払うのに十分なドルを持っていませんでした。\n税金を払うだけのドルがないのです。そこで私は、暗号を担保にして借金をする方法を調べてみました。\n税金を払うために暗号を売らないようにしていたからです。",
      "title": "暗号を担保にした借り入れ 私の経験と所見"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "随着美国的纳税日（5月17日）迅速向我逼近，我发现自己处于一个\n困境。我是个有钱但没钱的加密货币，没有足够的美元来支付我的税款。\n支付我的税款。这使我开始研究如何使用加密货币作为借款\n抵押品，因为我试图避免卖掉加密货币来交税，...",
      "title": "使用加密货币作为抵押品进行借贷。我的经验和发现"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "隨着美國的納稅日（5月17日）迅速向我逼近，我發現自己處於一個\n困境。我是個有錢但沒錢的加密貨幣，沒有足夠的美元來支付我的稅款。\n支付我的稅款。這使我開始研究如何使用加密貨幣作爲借款\n抵押品，因爲我試圖避免賣掉加密貨幣來交稅，...",
      "title": "使用加密貨幣作爲抵押品進行借貸。我的經驗和發現"
    }
  ],
  "title": "Borrowing using Crypto as Collateral: My Experiences and Findings",
  "created_utc": 1622743440,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As tax day in the U.S (5/17) quickly crept up on me, I found myself in a predicament: I was crypto rich but cash poor and did not have enough dollars to pay my taxes. This led me to doing research on how to borrow using crypto as collateral for I was trying to avoid selling crypto to pay taxes, which in turn would trigger more taxes.  Here are my findings below:</p>\n\n<p>Since crypto is an extremely volatile asset and there is no yet established credit system in the crypto lending space, meaning crypto-backed loans are all over-collateralized. Most cases, the Loan to Value Ratio (LTV) ranges from 20%-50%. LTV = Loan Amount/Collateral Value. So to borrow 10k with a loan with LTV value at 50%, you would need to put up 20k in crypto value as collateral.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>BlockFi</strong>: Custodial crypto company which offers services including trading, borrowing and earning interest on crypto deposits.</p>\n\n<p>Loan: 10k minimum loan, acceptable forms of collateral: BTC, ETC, LTC, and PAXG, only allows monthly payments for interest (monthly payments are much lower but you will owe entire principal at the end), collateral must maintain 70% of value or will require more collateral</p>\n\n<p>Rates:</p>\n\n<p>LTV: 20%, Interest Rate: 4.50% (Only available with BTC)</p>\n\n<p>LTV: 35%; Interest Rate: 7.90%</p>\n\n<p>LTV: 50%; Interest Rate: 9.75%</p>\n\n<p>Pros:</p>\n\n<p>-Loan direct deposit into bank account</p>\n\n<p>-No protocol hack risk</p>\n\n<p>Cons:</p>\n\n<p>-Limited cryptos accepted as collateral</p>\n\n<p>-KYC</p>\n\n<p>- Legally binding contract for loan, must adhere to BlockFi’s terms</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Salt Lending</strong>: Founded in 2016, Salt was one of the first companies to introduce crypto-backed lending. Salt currently offers institutional-grade crypto custody and blockchain monitoring products as well.</p>\n\n<p>Loan: 5k minimum, 1m max; acceptable forms of collateral: BTC, ETH, BCH, LTC, SALT, Paxos, USDC, TrueUSD, PAXG, 3-12 month loan duration, option to pay interest only or principal and interest, ability to redeem SALT tokens to lower interest rates (SALT currently ~30c)</p>\n\n<p>Rates:</p>\n\n<p>LTV: 30%, Interest Rate: 2.95% - 4.95% (2.95% available if 272.1 SALT is redeemed)</p>\n\n<p>LTV: 40%, Interest Rate: 5.95% - 7.95% (5.95% available if 272.1 SALT is redeemed)</p>\n\n<p>LTV: 50%, Interest Rate: 10.95% - 12.95% (10.95% available if 272.1 SALT is redeemed)</p>\n\n<p>LTV: 60%, Interest Rate: 15.95% - 17.95% (10.95% available if 272.1 SALT is redeemed)</p>\n\n<p>Pros:</p>\n\n<p>-more reasonable rates with the SALT redemption</p>\n\n<p>-loan direct deposit into bank account</p>\n\n<p>-no protocol hack risk</p>\n\n<p>Cons:</p>\n\n<p>-availability varies (really only available in the US. Outside US, Canada, UK and Australia are business only; Brazil, HK, New Zealand, UAE and Switzerland for individuals and business)</p>\n\n<p>-KYC</p>\n\n<p>-must accept Salt’s terms and conditions</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Celsius Network</strong>: FinTech platform that offers interest-bearing savings accounts, borrowing, and payments with digital and fiat assets.</p>\n\n<p>Loan: $500 minimum to borrow stablecoins ($25k minimum for fiat except in NY and TX where min is $500); over 35 acceptable forms of collateral; 6 months to 3 year loan duration; monthly payments on interest only</p>\n\n<p>Rates:</p>\n\n<p>LTV: 25%, Interest Rate: 1.00% (.95% if you pay with CEL token)</p>\n\n<p>LTV: 33%, Interest Rate: 6.95% (6.60% if you pay with CEL token)</p>\n\n<p>LTV: 50%, Interest Rate: 8.95% (8.50% if you pay with CEL token)</p>\n\n<p>Pros:</p>\n\n<p>-wider array of collateral accepted</p>\n\n<p>-longer loan duration</p>\n\n<p>-lower min for stablecoin loan</p>\n\n<p>Cons:</p>\n\n<p>-more KYC than other platforms (Government ID, Address, Tax ID)</p>\n\n<p>-primarily a phone app (can only borrow via phone app)</p>\n\n<p>&#x200B;</p>\n\n<p><strong>MakerDAO/Oasis</strong>: Autonomous protocol built on ETH blockchain that allows anyone to open up a smart contract/vault to deposit collateral and generate DAI.</p>\n\n<p><a href=\"https://community-development.makerdao.com/en/learn/MakerDAO\">https://community-development.makerdao.com/en/learn/MakerDAO</a></p>\n\n<p>Loan: 5,000 DAI minimum (dust limit); wide range of ERC-20 tokens can be used as collateral (including LP tokens), no duration limit (in order to access collateral again, required to deposit DAI)</p>\n\n<p>Rates:</p>\n\n<p>Stability fee (interest rate) ranges depending on the token used. Balancer stability fee is 2.00%, AAVE is 3.00%, ETH is 5.00%. Most stability fees are 5.00%. Liquidation Fee is 13.00%. Non-stablecoin minimum collateralization ratio is around 150% (LTV of 66.7%) but that will risk liquidation for even slight down movement. Recommended collateralization ratio is 200%-300% (LTV of 33%-50%)</p>\n\n<p>Pros:</p>\n\n<p>-fully decentralized, No KYC, no restrictions</p>\n\n<p>-wide range of collateral including some uniswap liquidity token</p>\n\n<p>-very competitive rates, fully flexible</p>\n\n<p>Cons:</p>\n\n<p>-entirely up to the individual to understand and learn the process</p>\n\n<p>-if vault falls under liquidation ratio, it will automatically get liquidated so individual must be aware</p>\n\n<p>-gas fees on ETH network ( much more reasonable now)</p>\n\n<p>&#x200B;</p>\n\n<p>Although I did not end up borrowing, I am a fan of MakerDAO as an option. Not only are you getting very competitive rates, but also getting more flexibility and are contributing to the shift towards decentralization of finance. At its core, cryptocurrency is about financial freedom and empowerment through decentralization from traditional financial institutions, and MakerDAO encapsulates this.</p>\n\n<p>Please do not treat this as financial advice, but rather a starting grounds for your own research and DD for the best option for yourself.  Realistically, until there is some sort of credit system for wallet addresses where loans do not need to be 2-3x collateralized I do not see borrowing against crypto to be feasible for most people. I hope this gives people a good overview of borrowing using crypto as collateral.</p>\n</div><!-- SC_ON -->",
  "score": 566,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/1FIfloHStO1if_fN8VtYaRlR1qvZxUIWDinBN8oNQhI.jpg?auto=webp&s=7c0ba83b35c21c65e7987855e0281a82339b8fc1",
          "width": 1200,
          "height": 1500
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/1FIfloHStO1if_fN8VtYaRlR1qvZxUIWDinBN8oNQhI.jpg?width=108&crop=smart&auto=webp&s=44f191f7e0b5357238b9ae86ba145219ed36a301",
            "width": 108,
            "height": 135
          },
          {
            "url": "https://external-preview.redd.it/1FIfloHStO1if_fN8VtYaRlR1qvZxUIWDinBN8oNQhI.jpg?width=216&crop=smart&auto=webp&s=ea3cdd59503feacb373fef84680212366e804c9b",
            "width": 216,
            "height": 270
          },
          {
            "url": "https://external-preview.redd.it/1FIfloHStO1if_fN8VtYaRlR1qvZxUIWDinBN8oNQhI.jpg?width=320&crop=smart&auto=webp&s=54cb3036890e1578ca556222d62feaf2b39001dd",
            "width": 320,
            "height": 400
          },
          {
            "url": "https://external-preview.redd.it/1FIfloHStO1if_fN8VtYaRlR1qvZxUIWDinBN8oNQhI.jpg?width=640&crop=smart&auto=webp&s=d2070b61434bd9048bc6fddaf8408fb8447e7047",
            "width": 640,
            "height": 800
          },
          {
            "url": "https://external-preview.redd.it/1FIfloHStO1if_fN8VtYaRlR1qvZxUIWDinBN8oNQhI.jpg?width=960&crop=smart&auto=webp&s=fbe2c59ceb86677c95da744deb69c1a1ddaf5db7",
            "width": 960,
            "height": 1200
          },
          {
            "url": "https://external-preview.redd.it/1FIfloHStO1if_fN8VtYaRlR1qvZxUIWDinBN8oNQhI.jpg?width=1080&crop=smart&auto=webp&s=5654d618997c0b0f1a3db6c5adc0c95a22f47c2c",
            "width": 1080,
            "height": 1350
          }
        ],
        "variants": {},
        "id": "bEOSeI7VhDiEb75V5g7MzJ3LEyZZCCKwz8AMP1RhbII"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/nrcvog/borrowing_using_crypto_as_collateral_my/",
  "subreddit": "CryptoCurrency",
  "id": "nrcvog",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404879794
}