{
  "author": "AskScienceModerator",
  "original_created_utc": 1656586803,
  "title": "AskScience AMA Series: We're NASA asteroid experts! ¡Somos expertos en asteroides de la NASA! Ask us anything (in English and Spanish/en inglés y en español) about near-Earth objects and how we're working to protect Earth from potentially hazardous asteroids!",
  "created_utc": 1656595436,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;¡Somos expertos en asteroides de la NASA! ¡Pregúntanos cualquier cosa (en inglés y en español) sobre objetos cercanos a la Tierra y cómo trabajamos para protegerla de asteroides potencialmente peligrosos!&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Today, June 30, is International Asteroid Day-but at NASA, every day is asteroid day!&lt;/p&gt;\n\n&lt;p&gt;Asteroids are rocky, airless remnants left over from the early formation of our solar system about 4.6 billion years ago and NASA and our partners are always looking to the skies to study these ancient time capsules. From our missions &lt;a href=\"https://solarsystem.nasa.gov/missions/lucy/in-depth/\"&gt;to explore the Trojan asteroids in Jupiter&amp;#39;s orbit&lt;/a&gt; and &lt;a href=\"https://www.nasa.gov/osiris-rex\"&gt;bring a piece of an asteroid back to Earth&lt;/a&gt;, to our &lt;a href=\"https://www.nasa.gov/specials/pdco/index.html\"&gt;efforts to find, track and monitor asteroids&lt;/a&gt; and other near-Earth objects to protect our planet from potential impact hazards, we&amp;#39;re uncovering the history of our solar system while working to keep our future safe.&lt;/p&gt;\n\n&lt;p&gt;Ask our experts anything about what we&amp;#39;re learning from asteroids, how we&amp;#39;re protecting the Earth, and much more!&lt;/p&gt;\n\n&lt;p&gt;Talent:​&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Lindley Johnson, NASA Planetary Defense Officer, NASA Headquarters&lt;/li&gt;\n&lt;li&gt;L.A. Lewis, FEMA Detailee, NASA Planetary Defense Program Officer, NASA Headquarters&lt;/li&gt;\n&lt;li&gt;Dr. Shantanu Naidu, Navigation Engineer, NASA Center for Near-Earth Object Studies (CENEOS)&lt;/li&gt;\n&lt;li&gt;Dr. Joe Masiero, NEOWISE Deputy Principal Investigator &amp;amp; NEO Surveyor team member, Caltech&lt;/li&gt;\n&lt;li&gt;Dr. Carolyn Ernst, DRACO Instrument Scientist, JHU APL&lt;/li&gt;\n&lt;li&gt;Prof. Vishnu Reddy, Associate Professor, University of Arizona&lt;/li&gt;\n&lt;li&gt;Dr. Lucas Paganini, Program Scientist, NASA Headquarters - Spanish-Speaking Expert&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Hoy, 30 de junio, es el Día internacional del asteroide, pero en la NASA, ¡todos los días son días de asteroides!&lt;/p&gt;\n\n&lt;p&gt;Los asteroides son restos rocosos sin atmósfera que quedaron de la formación temprana de nuestro sistema solar hace unos 4.600 millones de años. La NASA y sus socios miran constantemente al cielo para estudiar estas antiguas cápsulas del tiempo. Desde nuestras misiones para explorar los asteroides troyanos en la órbita de Júpiter y traer un trozo de asteroide de vuelta a la Tierra, hasta nuestros esfuerzos para encontrar, rastrear y monitorear asteroides y otros objetos cercanos a la Tierra para proteger nuestro planeta de posibles peligros de impacto, estamos descubriendo la historia de nuestro sistema solar mientras trabajamos para mantener nuestro futuro seguro.&lt;/p&gt;\n\n&lt;p&gt;Pregunta a nuestros expertos cualquier cosa que quieras saber sobre lo que estamos aprendiendo de los asteroides, cómo estamos protegiendo a la Tierra y mucho más.&lt;/p&gt;\n\n&lt;p&gt;Talento:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Lindley Johnson, Oficial de Defensa Planetaria de la NASA, Sede de la NASA&lt;/li&gt;\n&lt;li&gt;L.A. Lewis, Oficial del Programa de Defensa Planetaria de la NASA, Sede de la NASA&lt;/li&gt;\n&lt;li&gt;Dr. Shantanu Naidu, Ingeniero de navegación, Centro de estudios de objetos cercanos a la Tierra de la NASA (CENEOS)&lt;/li&gt;\n&lt;li&gt;Dr. Joe Masiero, Investigador principal adjunto de NEOWISE y miembro el equipo del telescopio NEO Surveyor, Instituto de Ciencia Planetaria&lt;/li&gt;\n&lt;li&gt;Dra. Carolyn Ernst, científica del instrumento DRACO, JHU APL&lt;/li&gt;\n&lt;li&gt;Prof. Vishnu Reddy, Profesor Asociado, Universidad de Arizona&lt;/li&gt;\n&lt;li&gt;Dr. Lucas Paganini, Program Scientist, NASA Headquarters - Experto hispanohablante&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Our guests will be joining us at 12:00 - 1:30 p.m. EDT. Please forgive the moderator over formatting difficulties.&lt;/p&gt;\n\n&lt;p&gt;Nuestros invitados llegan a las 12:00 a 1:30 p.m. (UTC-4). Por favor, perdone al moderador por las dificultades de formato.&lt;/p&gt;\n\n&lt;p&gt;Username/Usuario: &lt;a href=\"/u/nasa\"&gt;/u/nasa&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 151,
  "permalink": "/r/askscience/comments/vo5n83/askscience_ama_series_were_nasa_asteroid_experts/",
  "subreddit": "askscience",
  "id": "vo5n83",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "¡Somos expertos en asteroides de la NASA! ¡Pregúntanos cualquier cosa (en inglés\ny en español) sobre objetos cercanos a la Tierra y cómo trabajamos para\nprotegerla de asteroides potencialmente peligrosos!\n\n--------------------------------------------------------------------------------\n\nToday, June…"
}