{
  "author": "Super_Currency_7544",
  "original_created_utc": 1630497033,
  "title": "After finding information that my teen daughter loves and is dating a girl, how do I go forward with this information?",
  "created_utc": 1630509849,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>While cleaning my 13y.o. daughters room I found mention of her loving and  having a girlfriend.  I want her to feel comfortable, accepted and not like she needs to hide anything but I don&#39;t want to just bring it up and have her mad at me for some reason. The information was in her journal and I swear on all that is good that it fell from her bed when I was changing her sheets. I know that this information being private makes bringing this up potentially volatile &quot;breach of trust&quot; situation that I&#39;d like to avoid if I can. Hard enough being the dad of a teen girl without the added drama! So folks, what do I do?</p>\n</div><!-- SC_ON -->",
  "score": 114,
  "permalink": "/r/TooAfraidToAsk/comments/pfs9eq/after_finding_information_that_my_teen_daughter/",
  "subreddit": "TooAfraidToAsk",
  "id": "pfs9eq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "While cleaning my 13y.o. daughters room I found mention of her loving and having\na girlfriend. I want her to feel comfortable, accepted and not like she needs to\nhide anything but I don't want to just bring it up and have her mad at me for\nsome reason. The information was in her journal and I swear…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "13歳の娘の部屋を掃除していたら、彼女が愛していて恋人がいるという話が出てきました。\n恋人がいたことが書かれていました。私は、娘が安心して受け入れられ、何かを隠す必要がないと感じて欲しいと思っています。\nしかし、この話を持ち出して、彼女が何かの理由で私を怒らせるようなことはしたくありません。\nその情報は彼女の日記にありました。その情報は彼女の日記に書かれていて、私は誓って...",
      "title": "ティーンの娘が好きで女の子と付き合っているという情報を見つけた後、どのように進めていけばいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在打扫我13岁女儿的房间时，我发现有人提到她爱上并有一个女朋友。\n一个女朋友。我想让她感到舒适，被接受，而不是像她需要\n但我也不想随便提起，让她因为某些原因而对我生气。\n某种原因。这些信息是在她的日记中，我发誓...",
      "title": "在发现我十几岁的女儿喜欢并正在和一个女孩约会的信息后，我该如何利用这些信息继续前进？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在打掃我13歲女兒的房間時，我發現有人提到她愛上並有一個女朋友。\n一個女朋友。我想讓她感到舒適，被接受，而不是像她需要\n但我也不想隨便提起，讓她因爲某些原因而對我生氣。\n某種原因。這些信息是在她的日記中，我發誓...",
      "title": "在發現我十幾歲的女兒喜歡並正在和一個女孩約會的信息後，我該如何利用這些信息繼續前進？"
    }
  ]
}