{
  "author": "YoyDunGoofd",
  "original_created_utc": 1637843573,
  "title": "Do i really need a hardware wallet?",
  "created_utc": 1637872848,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>coinbase seems to work fine, &quot;not your keys not your bitcoin&quot; but I trust coinbase more than I trust myself not to lose a hardware wallet in 10 or so years</p>\n\n<p>EDIT: Wow, this, um, attracted a lot of thoughts. Thanks for the constructive discussion - interesting to see everyone&#39;s opinions, seems to be a lot of people who don&#39;t trust exchanges, and that makes sense, but a history of losing valuable stuff leaves me with my original post.</p>\n</div><!-- SC_ON -->",
  "score": 186,
  "permalink": "/r/Bitcoin/comments/r1vley/do_i_really_need_a_hardware_wallet/",
  "subreddit": "Bitcoin",
  "id": "r1vley",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "coinbase seems to work fine, \"not your keys not your bitcoin\" but I trust\ncoinbase more than I trust myself not to lose a hardware wallet in 10 or so\nyears\n\nEDIT: Wow, this, um, attracted a lot of thoughts. Thanks for the constructive\ndiscussion - interesting to see everyone's opinions, seems to be…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "coinbaseはうまくいっているようで、「あなたの鍵ではなく、あなたのビットコインではない」と言っています。\nしかし私は、10年かそこらでハードウェアウォレットを失くさないようにすることよりも、coinbaseを信用しています。\n数年後\n\nEDIT: うーん、これはたくさんの意見を集めましたね。建設的な議論をありがとうございました。\nみんなの意見を見るのは面白いですね。",
      "title": "ハードウェアウォレットは本当に必要ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "coinbase似乎运作良好，\"不是你的钥匙，不是你的比特币\"，但我相信\n但我对coinbase的信任超过了我对自己在10年左右的时间里不会丢失一个硬件钱包的信任。\n年的时间\n\n编辑：哇，这个，嗯，吸引了很多人的思考。谢谢你的建设性的\n讨论--看到大家的意见很有意思，似乎...",
      "title": "我真的需要一个硬件钱包吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "coinbase似乎運作良好，\"不是你的鑰匙，不是你的比特幣\"，但我相信\n但我對coinbase的信任超過了我對自己在10年左右的時間裏不會丟失一個硬件錢包的信任。\n年的時間\n\n編輯：哇，這個，嗯，吸引了很多人的思考。謝謝你的建設性的\n討論--看到大家的意見很有意思，似乎...",
      "title": "我真的需要一個硬件錢包嗎？"
    }
  ]
}