{
  "author": "JuicySpark",
  "the_new_excerpt": "You also only have to buy into BTC once, unlike a 401K where most people keep\nbuying back in every pay check only to lose what you earned in interest by\npaying a penalty if you withdraw too early. Because that's the trick. The trick\nto a 401K is to get everyone to hold because if everyone sells,…",
  "original_created_utc": 1622308958,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "また、BTCを購入するのは一度だけで済みます。\nとは異なり、BTCは一度だけ購入すればよいのです。\n早めに引き出すとペナルティが課せられ、利息分を失うことになる。なぜなら、それがトリックだからです。401Kのコツは\n401Kのコツは、みんなに保有してもらうことですが、みんなが売ってしまうと",
      "title": "401Kプランを30～40年持つことができるなら、ビットコインを3～4年持つことができます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你也只需买入BTC一次，不像401K那样，大多数人在每次发工资时都要买回BTC，但到头来却失去了赚取的利息。\n大多数人在每次发工资时都会买回来，但如果你过早提取，就会失去你所赚取的利息。\n如果你过早提取，还要支付罚款。因为这就是诀窍。诀窍\n401K的诀窍是让每个人都持有，因为如果每个人都卖掉，...",
      "title": "如果你能持有401K计划30-40年，你就能持有比特币3-4年。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你也只需買入BTC一次，不像401K那樣，大多數人在每次發工資時都要買回BTC，但到頭來卻失去了賺取的利息。\n大多數人在每次發工資時都會買回來，但如果你過早提取，就會失去你所賺取的利息。\n如果你過早提取，還要支付罰款。因爲這就是訣竅。訣竅\n401K的訣竅是讓每個人都持有，因爲如果每個人都賣掉，...",
      "title": "如果你能持有401K計劃30-40年，你就能持有比特幣3-4年。"
    }
  ],
  "title": "If You Can Hold a 401K Plan for 30-40 Years, You Can Hold Bitcoin for 3-4 Years.",
  "created_utc": 1622321552,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>You also only have to buy into BTC once, unlike a 401K where most people keep buying back in every pay check only to lose what you earned in interest by paying a penalty if you withdraw too early.   Because that&#39;s the trick.  The trick to a 401K is to get everyone to hold because if everyone sells, then everyone else who didn&#39;t sell fast enough will lose money and the whole thing will crash.    That&#39;s why they charge penalities.    </p>\n\n<p>It&#39;s like investing in safemoon and they charge you penalities for selling In order to keep the current value more stable so the entirety of holders don&#39;t start panic selling it into oblivion.</p>\n\n<p>Also you can panic sell a 401K too.  It happened to many people after the housing market crash of 2008.    My mom panic sold her 401k because it went from $50K to $9K ...I don&#39;t know much about investing then but I will never forget what she said.  <em>I was afraid I would lose it all, it kept going down</em> </p>\n\n<p>What she says sounds much like what people say about Bitcoin. </p>\n\n<p>Nowadays my mom is retired, and sometimes she brings that up...<em>I should&#39;ve just kept it in...it went back up</em></p>\n\n<p>Unfortunately this is how the most powerful people work.  They shake out weak hands so they can buy up super low.   Otherwise there would be no big guy buying your shit back.  </p>\n\n<p>Rich are buying your shit cheap for a reason...not just because they are just speculating. </p>\n\n<p>So yeah, you can get serious FUD with 401K and it&#39;s not just coming from my mom. Many honest hard working people don&#39;t understand the game whales play...they get shilled into things and are convinced it&#39;s safe because their employer offers it.    All a 401K is, is investments into stocks and bonds that are stable but not always safe. </p>\n\n<p>So if you can continually dump every paycheck into something that penalizes you for withdrawing early and hold that shit for 30 years , then you can buy Bitcoin  once and hold it for 3 years without any penality for withdrawing some too early unless tax on capital gains. But that&#39;s normal. </p>\n\n<p>So stick to your original plan, and hold.</p>\n</div><!-- SC_ON -->",
  "score": 6789,
  "permalink": "/r/CryptoCurrency/comments/nns2bs/if_you_can_hold_a_401k_plan_for_3040_years_you/",
  "subreddit": "CryptoCurrency",
  "id": "nns2bs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804296495
}