{
  "author": "roberthonker",
  "original_created_utc": 1625108030,
  "title": "Disappointed that all of your crypto has fallen? Here's something to put everything into perspective.",
  "created_utc": 1625117579,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>One comment upvote is worth 0.4 moons this month, so one comment upvote is two cents at current moon prices. This is comparable to the minimum wage in countries like Sierra Leone. The minimum wage there is three cents. One click is worth almost as much as an hour of work there. </p>\n\n<p>This sure puts things into perspective for me.</p>\n</div><!-- SC_ON -->",
  "score": 314,
  "permalink": "/r/CryptoCurrency/comments/obcnx6/disappointed_that_all_of_your_crypto_has_fallen/",
  "subreddit": "CryptoCurrency",
  "id": "obcnx6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "One comment upvote is worth 0.4 moons this month, so one comment upvote is two\ncents at current moon prices. This is comparable to the minimum wage in\ncountries like Sierra Leone. The minimum wage there is three cents. One click is\nworth almost as much as an hour of work there.\n\nThis sure puts…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1つのコメントアップボーテは、今月は0.4ムーンの価値があるので、1つのコメントアップボーテは2\nセントの価値があります。これは、シエラレオネなどの国の最低賃金に匹敵します。\nシエラレオネのような国の最低賃金に匹敵します。そこでの最低賃金は3セントです。1クリックは\n1クリックの価値は、現地での1時間の労働とほぼ同じです。\n\nこれは確かに...",
      "title": "あなたが持っている暗号がすべて下落してしまってがっかりですか？ここでは、すべてを見通してみることができます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "一个评论的最高票数在本月价值0.4个月，所以一个评论的最高票数是2\n美分，以目前的月价计算。这与塞拉利昂等国的最低工资相当。\n塞拉利昂等国家的最低工资。那里的最低工资是3美分。一次点击是\n价值几乎与那里的工作一小时一样多。\n\n这肯定会使...",
      "title": "对你所有的加密货币都下跌感到失望？这里有一些东西可以让你看清一切。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "一個評論的最高票數在本月價值0.4個月，所以一個評論的最高票數是2\n美分，以目前的月價計算。這與塞拉利昂等國的最低工資相當。\n塞拉利昂等國家的最低工資。那裏的最低工資是3美分。一次點擊是\n價值幾乎與那裏的工作一小時一樣多。\n\n這肯定會使...",
      "title": "對你所有的加密貨幣都下跌感到失望？這裏有一些東西可以讓你看清一切。"
    }
  ]
}