{
  "author": "dado3",
  "original_created_utc": 1637605706,
  "title": "Is it a bear market? Is it a bull market? Neither. It's the monthly fight over options expiration",
  "created_utc": 1637620817,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/qhtqf4/whats_up_with_the_markets_its_a_fight_over_3b_in/\">I posted about this last month</a> when the markets were going a little haywire, so I thought it would be a helpful reminder that the last Friday of every month is the big options expiration.</p>\n\n<p>The guys with the rights to sell high (puts) are battling the guys with the rights to buy low (calls). Where the price ends up at on Friday morning determines which ones make money and which ones walk away with nothing.</p>\n\n<p>For those who don&#39;t remember what happened this time last month, the price dipped pretty significantly during the run-up to the October expirations....and then promptly made a new ATH within two weeks.</p>\n\n<p>So remember that, no matter what happens this week, it will likely have very little impact on the overall trajectory of the market. It&#39;s just whale games.</p>\n</div><!-- SC_ON -->",
  "score": 168,
  "permalink": "/r/CryptoCurrency/comments/qzs3mp/is_it_a_bear_market_is_it_a_bull_market_neither/",
  "subreddit": "CryptoCurrency",
  "id": "qzs3mp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I posted about this last month\n[https://www.reddit.com/r/CryptoCurrency/comments/qhtqf4/whats_up_with_the_markets_its_a_fight_over_3b_in/]\nwhen the markets were going a little haywire, so I thought it would be a helpful\nreminder that the last Friday of every month is the big options expiration.\n\nThe…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "先月、この件について投稿しました\n[https://www.reddit.com/r/CryptoCurrency/comments/qhtqf4/whats_up_with_the_markets_its_a_fight_over_3b_in/]\n市場が少しおかしくなっていた時に投稿したので、毎月最終金曜日が大\n毎月最後の金曜日は大きなオプションの満期日であることを思い出してほしいと思います。\n\nその...",
      "title": "それはベアマーケットなのか？強気の市場なのか？どちらでもない。それは、オプションの期限をめぐる毎月の戦い"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在上个月发布了关于这个问题的帖子\n[https://www.reddit.com/r/CryptoCurrency/comments/qhtqf4/whats_up_with_the_markets_its_a_fight_over_3b_in/]\n当市场有点混乱时，我认为这将是一个有益的提醒。\n提醒大家，每个月的最后一个星期五是重要的期权到期日。\n\n我认为这将有助于提醒我们，每个月的最后一个星期五是重要的期权到期日。",
      "title": "这是一个熊市吗？是牛市吗？都不是。这是每月一次的期权到期日之争"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在上個月發佈了關於這個問題的帖子\n[https://www.reddit.com/r/CryptoCurrency/comments/qhtqf4/whats_up_with_the_markets_its_a_fight_over_3b_in/]\n當市場有點混亂時，我認爲這將是一個有益的提醒。\n提醒大家，每個月的最後一個星期五是重要的期權到期日。\n\n我認爲這將有助於提醒我們，每個月的最後一個星期五是重要的期權到期日。",
      "title": "這是一個熊市嗎？是牛市嗎？都不是。這是每月一次的期權到期日之爭"
    }
  ]
}