{
  "author": "shineyumbreon",
  "the_new_excerpt": "With the recent rise of new investors, the number of “How to do research”, “how\nto find alts”, “Which coins should I buy”, \"how to get started\" posts\ndrastically increased. So, I’ve decided to write a post to help newcomers. This\npost will help you learn how to do what is IN MY OPINION proper…",
  "original_created_utc": 1618058034,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、新しい投資家が増えてきたことで、「リサーチの仕方」「アルトの見つけ方」「どのコインを買えばいいのか？\nアルトの見つけ方」「どのコインを買えばいいのか」「どうやって始めるのか」といった投稿が\nが急激に増えました。そこで、新規参入者に役立つ記事を書くことにしました。この\nこの記事では、私の考えでは適切な方法を学ぶことができます...",
      "title": "はじめに 良い研究をするための方法と、知っておきたかったこと"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "随着近期新投资者的崛起，\"如何做研究\"、\"如何\n找到alts\"，\"我应该买哪些硬币\"，\"如何开始 \"的帖子。\n急剧增加。所以，我决定写一篇文章来帮助新人。这篇\n帖子将帮助你学习如何做什么是在我的意见正确的... ...",
      "title": "开始吧。如何做好研究以及我希望我知道的事情。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "隨着近期新投資者的崛起，\"如何做研究\"、\"如何\n找到alts\"，\"我應該買哪些硬幣\"，\"如何開始 \"的帖子。\n急劇增加。所以，我決定寫一篇文章來幫助新人。這篇\n帖子將幫助你學習如何做什麼是在我的意見正確的... ...",
      "title": "開始吧。如何做好研究以及我希望我知道的事情。"
    }
  ],
  "title": "Getting started: How to do good research and what I wish I knew",
  "created_utc": 1618083026,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>With the recent rise of new investors, the number of “How to do research”, “how to find alts”, “Which coins should I buy”, &quot;how to get started&quot; posts drastically increased. So, I’ve decided to write a post to help newcomers. This post will help you learn how to do what is IN MY OPINION proper research and answer some of your questions. This post will NOT be explaining the fundamentals and technicalities of cryptocurrency. I will also not list (except for some exceptions) any articles/youtubers/podcasts. But I do appreciate community recommendations in the comments.</p>\n\n<p>This post consists of two parts. In first part I try to explain how to make good research and what to avoid. In second part I will go through things I wish I knew when I started.</p>\n\n<p>I am a “veteran” investor who has been in this space for more than 4 years now. I am also a software engineer with little experience in Blockchain. Everything I wrote is based on my experience. This means the article might be biased and some concepts and thoughts might be wrong. In no way am I saying this is objectively the best/only way to do it.</p>\n\n<p>This is not financial advice.</p>\n\n<h1>RESEARCH</h1>\n\n<p><strong>Why having realistic expectations is important ?</strong></p>\n\n<p>Have realistic expectations. Odds are you wont become a millionaire. Heck, even cashing out 10x profit is hard.</p>\n\n<p>The more unrealistic your goals are the more you worry about your investments, FOMO and FUD. I&#39;ve seen way too many people panic sell when the coin they hold drops 10%. Many investors are expecting insane gains and the second their coin loses momentum (even if its only for a day) people panic and start comparing themselves to others that are in profit and start desperately looking for new coins to make money from. This is good way to lose money. Sell when coin drops 10% FOMO into an already pumped coin and repeat the process. Do not do that!</p>\n\n<p>Try to be as reasonable as possible. Do things seem too good to be true? Why isnt every second crypto investor rich if day trading and buying hyped coins and selling for profits seems so easy?</p>\n\n<p><strong>Path to good understanding of the space.</strong></p>\n\n<p>Before you start investing I&#39;d recommend you learn about the basics. You SHOULD understand how blockchain and cryptocurrency work if you want to be a successful investor (It makes little sense to invest into something knowing nothing about it and will only build bad habits which can lose you all your money down the line). There are a ton of great resources on the internet. I&#39;d avoid crypto influencers and focus on videos that visually explain the fundamentals and basics (3blue1brown has an amazing video).</p>\n\n<p>Start with learning what blockchain is. After that I’d learn about cryptocurrency in general. Only then would I move to Bitcoin. Try to understand why people believe this is the future and why so many people are interested in cryptocurrency. It should be easy to find videos explaining why this is the case, but the hard part is coming to this conclusion by yourself. It is worth saying that understanding and considering counter arguments helps with research and might make you even more confident with your investment.</p>\n\n<p>After you have general knowledge and understand the fundamentals you should move onto Ethereum.</p>\n\n<p>And only after you understand previously mentioned things should you start researching Alt coins.</p>\n\n<p>I’m strong believer that you cant completely understand Altcoins and whether or not what they’re doing is even possible if you do not know how cryptocurrency and blockchain work.</p>\n\n<p>You need to understand that every altcoin is trying to solve a specific project in a specific field. So while researching alts you really do need to research that field as well. For example you should research IoT while researching projects trying to change that field (like IOTA).</p>\n\n<p>How much research do I need? The more, the better. You can do with only a couple of videos on every topic, but the more you learn and the more you understand, the better. Great number of investors don’t do anywhere near this amount of research and are still doing well. If you don’t want to spend months doing research you don’t have to and you’ll probably still make decent money (at least during bullmarket).</p>\n\n<p>As you can see there is endless research to be done for every single alt. I know it sounds absurd and like a waste of time, but you do need to understand that good research can lead to financial freedom. Most of investors don’t do any research so you&#39;ll quickly be better off than majority.</p>\n\n<p>It is important to add, that doing research does not guarantee good results. It is pretty common for good projects to never get into the spotlight while some trend chasing projects take all the hype. But I do believe doing good research is the most consistent.</p>\n\n<p>Some very good resources (often suggested in this sub): How To DeFi book that can be purchased or obtained by using the site on CoinGecko. Another “must read” resource is <a href=\"https://ocw.mit.edu/courses/sloan-school-of-management/15-s12-blockchain-and-money-fall-2018/video-lectures/\">MIT course</a>.</p>\n\n<p>A good reference on what (IMO) good altcoin research looks like; <a href=\"https://www.youtube.com/watch?v=Ar4kZQ5cu48&amp;t=71s\">this</a>. Note: I am in no way saying I suggest the coin in the video. I just think the way he does research is good to follow.</p>\n\n<p><strong>Crypto influencers.</strong></p>\n\n<p>There is not much you can do about influencers. They are here to make money. They are NOT here to teach you how to make money, because that would result in them losing on gains and possibly gaining competition.</p>\n\n<p>There might be some influencers that genuinely want you to succeed (Benjamin Cowen and Coin Bureau are often suggested in this sub), but MOST DONT. As easy as being spoon-fed information is, its not worth it and it may lead to bad results (if not now, after the bullrun).</p>\n\n<p>I strongly suggest AGAINST following &quot;Crypto influencers&quot;, especially on youtube. HOWEVER, this does NOT mean you shouldn’t be using youtube as a mean of research. There are a lot of UNBIASED videos explaining crypto and blockchain (3blue1brown has an excellent video).</p>\n\n<p>I’d also like to add that Youtubers are people just like you. They might know way less than you and I do. Would you take advice from somebody like this? Having 100k or more subs does not mean they understand how cryptocurrency works. ANYBODY can become crypto youtuber.</p>\n\n<p><strong>Articles and forums</strong></p>\n\n<p>I’ll keep this simple. Like with crypto influencers, articles and forums are usually very biased. People are generally doing what’s good for them. Keep this in mind when reading discussions and articles.</p>\n\n<p><strong>Scams</strong></p>\n\n<p>In terms of numbers, there are a ton of scams. In fact, most projects are a “scam”. There are more than 10k projects listed on CoinGecko and this number does not even include projects that never get listed. Based on 4chan and some telegram groups more than 5-10 rug pulls happen on a daily basis.</p>\n\n<p>There are a ton of projects that aren’t really scams but get very close. There are a TON of trend chasing, cash grab projects. It’s pretty easy to find them. Just go on their website, scroll down to their roadmap and if the project started in the last 6 months the odds are it is a trend chasing project. Most of the legit projects are in development for years before they even launch a token. Of course there are legit projects that might be HUGE in the future that are just getting started, however based on the number of new projects odds of you finding a project like this are relatively slim.</p>\n\n<p>There are a ton of clones out there. Its very easy to fork github repo, change 10% of the code and launch a project within a week. One of bigger problems today is lack of Blockchain developers (this might have changed in the recent months). There are relatively few blockchain devs in SE space and most of them are probably employed at bigger, reputable projects. So how come there are 100 new projects coming daily? Its pretty simple. A ton of them are just clones of other projects that will likely not do much else than launch a token. Even if they wanted to, it is extremely hard for unexperienced devs to do so. If the history is to repeat itself a lot of trend chasing projects will end up without a product, or with suboptimal product that’s lacking most of the promised features.</p>\n\n<p>But this definitely does NOT mean trend chasing projects are worthless. Like we’ve seen biggest gains come from projects like this and people are getting rich by flipping new projects. It is very risky though and probably not the best longterm investment.</p>\n\n<h1>WHAT I WISH I KNEW</h1>\n\n<p><strong>General thoughts to keep on top of your mind.</strong></p>\n\n<ul>\n<li>This space is full of biased articles. Take everything with a grain of salt.</li>\n<li>If its promoted by big crypto influencers its generally too late to get in early (Applies to gem hunters that want to make quick profit).</li>\n<li>If it seems too good to be true, it probably is.</li>\n<li>If it were as easy as it seems, everybody would be a millionaire.</li>\n<li>Nobody knows what is going to happen. We are all just speculating and hoping for the best.</li>\n<li>Keep open minded and try to understand arguments against your beliefs.</li>\n<li>People are generally doing whats best for them, not for you (articles, forums, youtube, twitter).</li>\n<li>Everything is a scam, until proven otherwise.</li>\n<li>I am not as smart as I often think I am (applies to other people as well).</li>\n<li>Everybody is a genius during a bullmarket. (It is impossible to find 10 coins from top 100 a year ago that are lower than they were at that time).</li>\n<li>Your mental health is more important than the money.</li>\n</ul>\n\n<p><strong>Two sides of HODL.</strong></p>\n\n<p>It is often suggested to HODL instead of day trading. I personally believe trading is dangerous and should be avoided, unless one knows what he’s doing. I learned the hard way that holding is generally better than jumping ship. My most common mistake was FOMOing into the trendy coin at the top and then selling after it drops. The worst part is seeing that coin double the price a week or two later.</p>\n\n<p>Does this mean buying an asset and holding is better? Generally, yes. At least during the bullmarket. However, it is VERY IMPORTANT to keep in mind what happened to many tokens that were popular during the last bullmarket. Most of them are down by AT LEAST 80%. This means that everybody who bought around the top and held onto them is down at least 80%. There are some projects that are up massively, but that’s the minority.</p>\n\n<p>Is this time different? Nobody knows. But it does not hurt to be careful.</p>\n\n<p><strong>Should I wait for a drop to invest?</strong></p>\n\n<p>It is extremely hard to time the market. It usually has more to do with luck than anything else. I suggest you simply DCA as often as you can. DCA or Dollar-cost averaging is the process of investing the same amount of money in a particular asset over consistent intervals of time. You do miss on potential gains of timing the dip perfectly however you also avoid buying the top. It is the safest and most consistent way of investing.</p>\n\n<p><strong>Will bullmarket ever end?</strong></p>\n\n<p>Short answer: Yes. </p>\n\n<p>Long answer: Markets are cyclic. There are four phases of a market cycle. Accumulation phase, Mark-up phase, Distribution phase and Mark-down phase. Mark-Down Phase (in other words bearmarket) is the fourth and final phase in the cycle. During this phase the market falls and many are left with positions bellow their entry point. This phase also marks the beginning of the next accumulation phase. A cycle can last anywhere from a few weeks to a number of years (like we&#39;ve experienced before).</p>\n\n<p>What will the bearmarket look like? Its anybodies guess. I personally am hoping for a shorter, less significant bearmarket.</p>\n\n<p>For more information I suggest reading through this <a href=\"https://www.investopedia.com/trading/market-cycles-key-maximum-returns/#the-presidential-cycle\">article</a>.</p>\n\n<p><strong>Make mistakes.</strong></p>\n\n<p>That is the best way to learn. At least for me. I saw countless posts on how not to get scammed, etc. I thought I knew what I was doing. However, following one’s advice is a lot harder than it seems. Especially during the bullmarket.</p>\n\n<p><strong>Do I really need a wallet?</strong></p>\n\n<p>“Not your keys, not your money”. It is often suggested to move your assets from an exchange to your private wallet. This way you are safe from potential exchange hacks. You are in complete control of your money and are essentially your own bank.</p>\n\n<p>However, the answer is not as straight forward as it seems. Owning a wallet is not as easy as it seems. Especially if you do not know what you are doing. There are countless posts of people losing seed, getting hacked/scammed, sending assets to wrong address, using the wrong network, … You get the point. You make a mistake, there is a chance you lose your money. There is nothing wrong with keeping your money on exchanges. Big exchanges like Coinbase, Binance, Kucoin, etc. are safe bets and even in the case of a hack you’ll likely get your funds back.</p>\n\n<p>A hardware wallet is a cryptocurrency wallet which stores the user&#39;s private keys in a secure hardware device. The most popular ones are Ledger and Trezor. Hardware wallets are way more secure than software wallets.  Even if your computer gets hacked or your wallet is stolen, the thief  will be unable to transfer your coins without knowing your passphrase.  If you are holding large sums of money it is generally suggested to get a hardware wallet.</p>\n\n<p><strong>Good resource to get started as a developer?</strong></p>\n\n<p>If you’re a developer and want to learn the fundamentals by build your own blockchain I strongly suggest you read this: <a href=\"http://lhartikk.github.io/\">http://lhartikk.github.io/</a></p>\n\n<p>&#x200B;</p>\n\n<p>Thank you so much for reading through the post. Please let me know if I missed anything or got something wrong, so I can change it. I appreciate your feedback. I might consider adding topics like redflags and basics (marketcap vs price, etc.) but I feel like there are enough posts already that tackle these problems. I&#39;d like to apologize for grammatical errors. English is not my first language and expressing some thoughts proved way harder than I first thought. I&#39;m sorry if some thoughts end up being misleading.</p>\n\n<p>And to every new investor. Welcome and Good Luck!</p>\n\n<p>Edit: I reposted this with a better title. Added some content (hardware wallets, market cycles).</p>\n</div><!-- SC_ON -->",
  "score": 367,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/pXXhMk-UQ8yG_XR5JumE-DSd5ktdq9dsj7gMVNXk19A.jpg?auto=webp&s=6dbe1cf165cb51829a0673930b88e6a42a4b79c4",
          "width": 320,
          "height": 266
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/pXXhMk-UQ8yG_XR5JumE-DSd5ktdq9dsj7gMVNXk19A.jpg?width=108&crop=smart&auto=webp&s=268ca3fc9b404348961e6c2fc05f3ae84059ee1f",
            "width": 108,
            "height": 89
          },
          {
            "url": "https://external-preview.redd.it/pXXhMk-UQ8yG_XR5JumE-DSd5ktdq9dsj7gMVNXk19A.jpg?width=216&crop=smart&auto=webp&s=9069b64ba9480a20810536d0e7966c1095670d39",
            "width": 216,
            "height": 179
          },
          {
            "url": "https://external-preview.redd.it/pXXhMk-UQ8yG_XR5JumE-DSd5ktdq9dsj7gMVNXk19A.jpg?width=320&crop=smart&auto=webp&s=5e316a523b7b0ae786aa3ee3168b4b3e3fccf5a8",
            "width": 320,
            "height": 266
          }
        ],
        "variants": {},
        "id": "IUjB3JXeq88oq8gowcZH0B3Mt_FDKb8d0wwsXMQ2jEk"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/mo3v2k/getting_started_how_to_do_good_research_and_what/",
  "subreddit": "CryptoCurrency",
  "id": "mo3v2k",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566614248
}