{
  "author": "all_these_moneys",
  "original_created_utc": 1637452613,
  "title": "Decided to sell my Cardano holdings to pay for Christmas; It's not always about the long game.",
  "created_utc": 1637462905,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Wasn&#39;t sure if I should post this, figured I&#39;d go for it.  Decided to sell off my Cardano holdings + gains this past year to pay for Christmas.  I&#39;m a single-income household with an 18-month old, so making ends meet isn&#39;t the easiest.  My wife and I were DINK&#39;s for 10+ years, so we&#39;ve always put the future &amp; ourselves first.  It&#39;s been rough since our daughter was born and we wanted to provide an awesome Christmas for her this year, and selling our holdings was the only way.</p>\n\n<p>I guess if there&#39;s something to &quot;learn&quot; here, is that regardless of how much we love the gains &amp; holding through the storm, don&#39;t forget about your loved ones &amp; the memories you could make with what you already have.  It&#39;s not always about the long game.</p>\n</div><!-- SC_ON -->",
  "score": 179,
  "permalink": "/r/CryptoCurrency/comments/qyi6cc/decided_to_sell_my_cardano_holdings_to_pay_for/",
  "subreddit": "CryptoCurrency",
  "id": "qyi6cc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Wasn't sure if I should post this, figured I'd go for it. Decided to sell off my\nCardano holdings + gains this past year to pay for Christmas. I'm a\nsingle-income household with an 18-month old, so making ends meet isn't the\neasiest. My wife and I were DINK's for 10+ years, so we've always put the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "投稿すべきかどうか迷ったが、思い切って投稿することにした。私の\nクリスマスの支払いのために、この一年で得たカルダノの持ち株と利益を売ることにしました。私は\n18ヶ月の子供がいる単身世帯なので、生活費を稼ぐのは簡単ではありません。\n簡単ではありません。妻と私は10数年前からDINKSだったので、私たちはいつも...",
      "title": "クリスマスの支払いのために、保有していたカルダノを売却することにしました。必ずしも長期戦ではないのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不确定我是否应该发布这个，但我想我应该去做。决定卖掉我的\nCardano持股+去年的收益，以支付圣诞节的费用。我是一个\n单一收入家庭，有一个18个月大的孩子，所以入不敷出并不容易。\n最容易的。我的妻子和我是10多年来的DINK，所以我们一直把...",
      "title": "决定卖掉我的Cardano持股以支付圣诞节的费用；这并不总是关于长期游戏。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不確定我是否應該發佈這個，但我想我應該去做。決定賣掉我的\nCardano持股+去年的收益，以支付聖誕節的費用。我是一個\n單一收入家庭，有一個18個月大的孩子，所以入不敷出並不容易。\n最容易的。我的妻子和我是10多年來的DINK，所以我們一直把...",
      "title": "決定賣掉我的Cardano持股以支付聖誕節的費用；這並不總是關於長期遊戲。"
    }
  ]
}