{
  "author": "--_--__________--_--",
  "original_created_utc": 1655529182,
  "title": "Hand-drawn electronics simulator (neural network)",
  "created_utc": 1655545254,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey all some electrical and software engineering friends and I are developing web-software that can interpret hand drawn electronic circuits, and instantly convert them into a simulated digital schematic.&lt;/p&gt;\n\n&lt;p&gt;See the video for work in progress look (not at simulation stage yet!). Btw the frontend is barebones currently, but that&amp;#39;s not the fun part.&lt;/p&gt;\n\n&lt;p&gt;There is plenty of cool PhD research on the idea, but I think we may be the only ones investigating a project of this nature currently.&lt;/p&gt;\n\n&lt;p&gt;Will be releasing a beta soon! Few problems need to be sorted out first, and currently only works with basic circuit symbols (resistors, capacitors, inductors, voltage source ... etc)&lt;/p&gt;\n\n&lt;p&gt;Our next step is to add simulations on top, to simulate your hand drawn circuits instantly.&lt;/p&gt;\n\n&lt;p&gt;One aim is to eventually get this into use in high-school curriculums as a low barrier-to-entry intro to electronics.&lt;/p&gt;\n\n&lt;p&gt;Reach out if you have any interest :)&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://reddit.com/link/veyzh4/video/8f03y4yvbb691/player\"&gt;Interpreting a live sketch&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 5,
  "permalink": "/r/SideProject/comments/veyzh4/handdrawn_electronics_simulator_neural_network/",
  "subreddit": "SideProject",
  "id": "veyzh4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hey all some electrical and software engineering friends and I are developing\nweb-software that can interpret hand drawn electronic circuits, and instantly\nconvert them into a simulated digital schematic.\n\nSee the video for work in progress look (not at simulation stage yet!). Btw the\nfrontend is…"
}