{
  "author": "pagan_psychonaut",
  "original_created_utc": 1642353475,
  "title": "Is it irresponsible to avoid social media and the “news” to protect my own mental health?",
  "created_utc": 1642371483,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Between pandemics, elections, riots, politics, and everything else going on the last couple of years I’ve reached my limit. I want to completely sever myself from all forms of social media and the “news.”&lt;/p&gt;\n\n&lt;p&gt;I simply don’t give a fuck about any of this shit anymore. I used to be very civic minded, I cared about social justice, I cared about my community. &lt;/p&gt;\n\n&lt;p&gt;All I see now is division, and hate, and deliberate ignorance. &lt;/p&gt;\n\n&lt;p&gt;Is this what they call compassion fatigue?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 110,
  "permalink": "/r/TooAfraidToAsk/comments/s5ghdf/is_it_irresponsible_to_avoid_social_media_and_the/",
  "subreddit": "TooAfraidToAsk",
  "id": "s5ghdf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Between pandemics, elections, riots, politics, and everything else going on the\nlast couple of years I’ve reached my limit. I want to completely sever myself\nfrom all forms of social media and the “news.”\n\nI simply don’t give a fuck about any of this shit anymore. I used to be very\ncivic minded, I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "パンデミック、選挙、暴動、政治、その他もろもろ、いろいろなことが起こっています。\nここ数年、私は限界に達しています。もう完全に縁を切りたい\nすべてのソーシャルメディアとニュースから。\n\nもう何もかもどうでもいいのです。以前はとても\n市民意識を持っている、私は...",
      "title": "自分の心の健康を守るために、ソーシャルメディアや「ニュース」を避けるのは無責任なことなのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在大流行病、选举、暴乱、政治和过去几年发生的其他事情之间，我已经达到了极限。\n在过去的几年里，我已经达到了我的极限。我想完全切断自己\n从所有形式的社交媒体和 \"新闻 \"中脱离出来。\n\n我根本就不关心这些该死的东西。我曾经是非常\n公民意识，我...",
      "title": "为了保护我自己的心理健康，避开社交媒体和 \"新闻 \"是不负责任的做法吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在大流行病、選舉、暴亂、政治和過去幾年發生的其他事情之間，我已經達到了極限。\n在過去的幾年裏，我已經達到了我的極限。我想完全切斷自己\n從所有形式的社交媒體和 \"新聞 \"中脫離出來。\n\n我根本就不關心這些該死的東西。我曾經是非常\n公民意識，我...",
      "title": "爲了保護我自己的心理健康，避開社交媒體和 \"新聞 \"是不負責任的做法嗎？"
    }
  ]
}