{
  "author": "SameThingHappened2Me",
  "the_new_excerpt": "Thought I'd share some personal opinions on the state of crypto from the\nperspective of someone who was deep in the dot-com boom (and bust). I see a lot\nof parallels.\n\n\nTHE DOT-COM BUBBLE (1995-2000)\n\nBack in the late nineties, I was very deep in the dot-com craziness. My reddit\naccount is…",
  "original_created_utc": 1615747724,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我想从以下几个方面分享一下个人对加密技术现状的看法\n一个深陷网络经济繁荣（和萧条）的人的视角。我看到很多\n的相似之处。\n\n\n点阵通信泡沫(1995-2000年)\n\n早在九十年代末，我就深陷在互联网的疯狂中。我的reddit\n帐户是...",
      "title": "网络繁荣给加密社区带来的教训... ..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想從以下幾個方面分享一下個人對加密技術現狀的看法\n一個深陷網絡經濟繁榮（和蕭條）的人的視角。我看到很多\n的相似之處。\n\n\n點陣通信泡沫(1995-2000年)\n\n早在九十年代末，我就深陷在互聯網的瘋狂中。我的reddit\n帳戶是...",
      "title": "網絡繁榮給加密社區帶來的教訓... ..."
    }
  ],
  "title": "Lessons from the dot-com boom for the crypto community...",
  "created_utc": 1615757879,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Thought I&#39;d share some personal opinions on the state of crypto from the perspective of someone who was deep in the dot-com boom (and bust).  I see a lot of parallels.</p>\n\n<h1>The Dot-Com Bubble (1995-2000)</h1>\n\n<p>Back in the late nineties, I was very deep in the dot-com craziness.  My reddit account is pseudonymous so I won&#39;t get into which ones, but please believe me I was around a lot of dot-coms of the era.  It was a wild and weird time.  Earning revenue was considered a bad thing for a company, because it meant you could be evaluated by traditional metrics, rather than sky-high future potential.   The argument for every dot-com was that the world was shifting business--all business--over to internet approaches and there was no theoretical limit to the upside.  FOMO among investors was completely off the rails as some of these IPOs yielded 100x returns (or more).  Venture Capital was stupidly easy to raise.  Some of the business pitches were just.. catastrophically stupid, and often, despite their stupidity, these businesses nonetheless got their funding.</p>\n\n<p>At this point you&#39;re probably guessing the parallels to crypto that I&#39;m leading toward, but please stay with me, because there are important differences.  Still, it&#39;s worth acknowledging some similarities of crypto to that time.   The thing that smells the most familiar is projects with garbage tech, pump and dump schemes, and the like.  That does not describe all crypto, but it certainly describes some of it.  Worth noting also that there&#39;s plenty of money to be be made (just like back then) even when the tech is garbage, and that creates some problematic dynamics.</p>\n\n<h1>The Dot-Com Bust (2000-2001)</h1>\n\n<p>In 2000 things changed and the narrative changed.  The bubble burst.  Analogies to the Tulip bubble abounded.  Fortunes were lost overnight.  If your company could be characterized as a &quot;dot com&quot; you were not likely to get your next round of funding, even if you had hit every goal you had promised.  It was simply a bad word in the investment community.  Everyone wanted out, as fast as possible.  The promise of the internet had failed.  Many who missed out on the bubble due to FUD, took quite a bit of pleasure watching fortunes collapse.</p>\n\n<p>Back to the present for a moment.  I suspect quite a few of the crypto minimalists (places like <a href=\"/r/buttcoin\">/r/buttcoin</a>) are people forged by this period.  Some are people who lost much (or everything) during the dot-com bust.  Some are people who were the FUD during the dot-com bubble and had their views cemented when they watched the bust.  For the most part, that&#39;s just my speculation, although there are a few examples in the media where this is objectively the case.</p>\n\n<p>For a lot of people&#39;s thinking the dot-com bust was the end of the story.  Except it wasn&#39;t.  The internet didn&#39;t disappear.  And many of the businesses that were born of the bubble didn&#39;t disappear.  Instead we led into the next period where arguments for both sides were proved right.   Maybe the world had too much exuberance at first for the internet, but also had been a little too harsh on it during the bust.  We entered a new phase:</p>\n\n<h1>Aftermath: The Internet Turns Out to Be Handy After All (2001+)</h1>\n\n<p>On the graves of many failed dot-coms, some internet companies nonetheless survived.  This period began with news stories wondering whether Amazon would ever turn a profit as they noticed it was still growing.  After a while, it became accepted wisdom that new giants had arisen.  Unlike the boom era, traditional metrics of business success mattered, but unlike the dot-bust, you couldn&#39;t be dismissive about the internet.  Industries like print media were dying.  Social media companies were booming.  It was a new normal. </p>\n\n<p>Present day analogy again.  We&#39;re obviously not in the aftermath period with crypto (a term I&#39;m using to refer to all things blockchain, distributed, etc.).  We&#39;re not even close.  But there&#39;s every reason to believe that it will come.  Crypto offers the potential to solve numerous problems with our financial systems.   Smart contracts offer the potential to eliminate the need for numerous businesses that we spend exorbitantly on.  (E.g., why pay for an escrow service which relies on third party trust, when reliable software can perform the same function?)</p>\n\n<h1>A Key Difference Between the Rise of Crypto and the Dot-Com Bubble</h1>\n\n<p>If you&#39;re an investor in the late nineties, you&#39;d obviously be making a hugely successful long-term bet if you put your money in Amazon.   But you might just as easily lose your money, believing &quot;DirectBooks4U.com&quot; (made up) is a better investment.  There will be businesses servicing the crypto industry that are hugely successful long term and many that fail completely.  The big difference between then and now is that, this time, you have the opportunity to invest in the protocol itself.  Crypto isn&#39;t just a currency--it&#39;s a protocol.  You couldn&#39;t buy &quot;the internet itself&quot; back in the 90s.</p>\n\n<p>The internet is only a few decades old, but it&#39;s become so fundamental to society that we can&#39;t imagine a world without it.  The same can happen with crypto.  </p>\n\n<p>That isn&#39;t to say it doesn&#39;t have a long way to go of course.  When I hear about someone accidentally transferring crypto to a wallet of a different crypto address it reminds me of the days explaining to people, &quot;it&#39;s HTTP colon FORWARD slash, not backward slash.&quot;  This kind of stuff will all get sorted and become invisible to the end user.  The applications for the technology are beyond our ability to foresee at this point, just like it wasn&#39;t easy to come up with more use for your website then a spinning globe back in the day.</p>\n\n<p>When I hear people ask &quot;what is your ultimate sell price point&quot; I&#39;m reminded of Neo in the Matrix.  (*Not the first to make this analogy.)  When Neo asks Morpheus if he&#39;s suggesting he can dodge bullets, and Morpheus says &quot;when you&#39;re ready, you won&#39;t need to.&quot;  When crypto is ready, you won&#39;t have to sell.</p>\n</div><!-- SC_ON -->",
  "score": 1225,
  "permalink": "/r/CryptoCurrency/comments/m519fo/lessons_from_the_dotcom_boom_for_the_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "m519fo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147377086
}