{
  "author": "CommuWhatNow",
  "original_created_utc": 1649211673,
  "title": "Are people just not interested in climate change?",
  "created_utc": 1649218937,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So the new IPCC report on climate change is out. As expected, bad news. The world has around 3 years to drastically reduce emissions to avoid the worst effects of climate change in a few decades. Sea levels rising (1-8 feet, displacing millions in just the US alone), droughts, more powerful storms, flooding, landslides. This would of course disproportionately affect the poorest people, as usual. A huge percentage of the world is already breathing polluted air on a daily basis. &lt;/p&gt;\n\n&lt;p&gt;Are people not interested in this? I would think parents would care that the lives of their children are looking like they will be very different, likely hazardous. I&amp;#39;m really curious why people aren&amp;#39;t fucking pissed at those in power. What&amp;#39;s the deal?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 153,
  "permalink": "/r/NoStupidQuestions/comments/txbl2m/are_people_just_not_interested_in_climate_change/",
  "subreddit": "NoStupidQuestions",
  "id": "txbl2m",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So the new IPCC report on climate change is out. As expected, bad news. The\nworld has around 3 years to drastically reduce emissions to avoid the worst\neffects of climate change in a few decades. Sea levels rising (1-8 feet,\ndisplacing millions in just the US alone), droughts, more powerful…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "気候変動に関するIPCCの新しい報告書が発表されましたね。予想通り、悪いニュースだ。それは\n最悪の事態を回避するためには、あと3年程度で排出量を大幅に削減する必要があります。\n数十年後の気候変動の影響 海面上昇（1～8フィート。\n米国だけでも数百万人が避難している）、干ばつ、より強力な...",
      "title": "人々は気候変動に興味がないだけなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，IPCC关于气候变化的新报告已经出来了。正如预期的那样，坏消息。世界有大约3年的时间来大幅减少排放，以避免最坏的情况发生。\n世界有大约3年的时间来大幅减少排放，以避免最坏的情况发生。\n几十年后气候变化的最坏影响。海平面上升（1-8英尺。\n仅在美国就有数百万人流离失所），干旱，更强大的......",
      "title": "人们只是对气候变化不感兴趣吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，IPCC關於氣候變化的新報告已經出來了。正如預期的那樣，壞消息。世界有大約3年的時間來大幅減少排放，以避免最壞的情況發生。\n世界有大約3年的時間來大幅減少排放，以避免最壞的情況發生。\n幾十年後氣候變化的最壞影響。海平面上升（1-8英尺。\n僅在美國就有數百萬人流離失所），乾旱，更強大的......",
      "title": "人們只是對氣候變化不感興趣嗎？"
    }
  ]
}