{
  "author": "sinveil",
  "the_new_excerpt": "Greetings,\n\n\n\nI've been doing some comparative research on christian and indian philosophies,\nand for most of them, their hypothetical responses to each other seem rather\nstraight-forward and predictable. Against christianity in general, the buddhist\nschools would likely regard God as they regard…",
  "original_created_utc": 1612962170,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "问候。\n\n\n\n我一直在做一些关于基督教和印度哲学的比较研究。\n而对他们中的大多数人来说，他们对彼此的假设性反应似乎相当的。\n直截了当，可以预见。对付基督教的一般，佛教的\n学校很可能会像看待上帝一样看待... ...",
      "title": "克尔凯郭尔会被佛教打动还是被吓坏？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "問候。\n\n\n\n我一直在做一些關於基督教和印度哲學的比較研究。\n而對他們中的大多數人來說，他們對彼此的假設性反應似乎相當的。\n直截了當，可以預見。對付基督教的一般，佛教的\n學校很可能會像看待上帝一樣看待... ...",
      "title": "克爾凱郭爾會被佛教打動還是被嚇壞？"
    }
  ],
  "title": "Would Kierkegaard be Impressed or Terrified by Buddhism?",
  "created_utc": 1612988951,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Greetings,</p>\n\n<p>&#x200B;</p>\n\n<p>I&#39;ve been doing some comparative research on christian and indian philosophies, and for most of them, their hypothetical responses to each other seem rather straight-forward and predictable. Against christianity in general, the buddhist schools would likely regard God as they regard the Brahman, and relegate him a position in the highest Deva realm, but not in a state of nirvana (since, judging by the old and new testaments, God has pretty clear interests and desires which He seems not to have overcome). The entire theistic conception, according to someone like Shantideva, would seem like a venerable but incomplete path, since theists have not &quot;emptied&quot; their notions in a sufficient manner and still believe in souls and a divine substance and a first cause (I am drawing assumptions by analogy here, where Shantideva&#39;s response would be similar to his critique of the Yogachara idea of Mind).</p>\n\n<p>However, the most difficult comparison I came across is that between Kierkegaard&#39;s philosophy and any of the buddhist worldviews. From a buddhist perspective, Kierkegaard has a decent grasp of dukkha (in his case anxiety and despair), but his reliance upon the self&#39;s relation to God would push all the wrong buddhist buttons. At the same time, Kierkegaard posits an &quot;emptiness&quot; within the self which sounds very similar to Mahayana at times, yet an essential self does exist and it avoids it&#39;s emptiness via a connection with God.</p>\n\n<p>In my understanding, a buddhist would say that Kierkegaard has an acute awareness of dukkha but his treatment of it is ineffective, because it significantly differs from the Dharma (and commits a lot of the mistakes that the Vedas did). In contrast, Kierkegaard would say that the buddhist&#39;s reliance on the self for salvation would result in both a demonic despair, and a despair of not willing to be oneself. The former because buddhists refuse to seek forgiveness and redemption from a divine entity, and the latter because that&#39;s how I think Kierkegaard would interpret the teaching of anatta/anatman.</p>\n\n<p>And here is where things get interesting, and where my interpretation begins to stumble. In my opinion (if I am understanding correctly) both philosophies come to an incompatible paradigmatic barrier at this point. Without relying on a divine entity, Kierkegaard would refuse to admit that the Buddhist teaching can absolve despair, while a buddhist like Shantideva would refuse to accept the validity of Kierkegaard&#39;s claims and might even see him as improperly enlightened (if enlightened at all).</p>\n\n<p>How would you interpret these differences? Is there any substance to the kierkegaardian claim that despite all of their efforts, without God the buddhists cannot definitively cure dukkha? Or can this be ameliorated by the concept of the Bodhisattva? And is the overarching idea of Śūnyatā - that anyone who does not realize the inessential emptiness of all existence is doomed to samsara - metaphysically and/or epistemologically fair? Or can the consequences, in your opinion, be ameliorated by a leap of faith?</p>\n\n<p>In summary - would Kierkegaard be impressed by the Buddhist idea of access to salvation without divine aid, or would he be terrified by this specifically eastern form of despair within a (non)self that refuses to acknowledge it&#39;s limitation and need of God, and instead hides behind the false promise of the cessation of dukkha (that is, would Kierkegaard claim it is false? can he conceive of forms of salvation that are different from the christian one? and in turn, would you say that buddhism can conceive of forms of enlightenment that are not apatheistic)?</p>\n\n<p>I want to thank everyone who would take part in this discussion. It is of great interest to me and I am eager to read and open to all opinions.</p>\n\n<p>Thank you and have a nice day!</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/askphilosophy/comments/lgt6d1/would_kierkegaard_be_impressed_or_terrified_by/",
  "subreddit": "askphilosophy",
  "id": "lgt6d1",
  "is_self": true,
  "media": null,
  "is_video": false
}