{
  "author": "n_yn",
  "the_new_excerpt": "What are your guys’s thoughts on BB?\n\nHello. I am looking to buy my first stocks and I was considering BB due to the\nfact that their IVY system is going to be used by many of the top car\nmanufacturers’ EV’s. Nvidia has also announced that they’ll be running their\nself driving AI on the IVY system…",
  "original_created_utc": 1612592509,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "你们对BB有什么看法？\n\n你好，请问你是怎么想的？我正在寻找购买我的第一只股票，我正在考虑BB，由于。\n事实上，他们的IVY系统将被许多顶级汽车公司使用。\n厂商的电动车。Nvidia还宣布，他们将运行他们的。\n自动驾驶人工智能在IVY系统上... ...",
      "title": "你们对BB有什么看法？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你們對BB有什麼看法？\n\n你好，請問你是怎麼想的？我正在尋找購買我的第一隻股票，我正在考慮BB，由於。\n事實上，他們的IVY系統將被許多頂級汽車公司使用。\n廠商的電動車。Nvidia還宣佈，他們將運行他們的。\n自動駕駛人工智能在IVY系統上... ...",
      "title": "你們對BB有什麼看法？"
    }
  ],
  "title": "What are your guys’s thoughts on BB?",
  "created_utc": 1612608290,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>What are your guys’s thoughts on BB?</p>\n\n<p>Hello. I am looking to buy my first stocks and I was considering BB due to the fact that their IVY system is going to be used by many of the top car manufacturers’ EV’s. Nvidia has also announced that they’ll be running their self driving AI on the IVY system which I see as very promising. I’ve also seen that Blackberry is in the cyber security business which I see as a plus on top of the IVY system. I’ve seen that Prem Watsa has been betting heavily on Blackberry since September. I don’t see this as a solid piece of evidence in convincing me, but if someone like him has high hopes for it I see that as a good sign. I think EV’s have huge potential, especially with the new president in office and just the way society is moving as a whole. I’m still doing my research but I’d like to hear your guys’s opinions on whether it would be a good idea to invest at this point.  I’m not too familiar with the numbers, in terms of what I should be looking for in Market Cap., and P/E ratio. Any explanations on those would be helpful as well. Thanks.</p>\n</div><!-- SC_ON -->",
  "score": 163,
  "permalink": "/r/stocks/comments/ldrjcl/what_are_your_guyss_thoughts_on_bb/",
  "subreddit": "stocks",
  "id": "ldrjcl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123201976
}