{
  "author": "mask45",
  "original_created_utc": 1630890239,
  "title": "Cardano community we need to talk.",
  "created_utc": 1630931755,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Yesterday I posted a thread about Twitter users experiencing some problems with early DeFi projects running on the Cardano network and since then I have been accused of being part of a “coordinated” FUD campaign aimed to damage the Cardano project by the Cardano community and the YouTube Channel ‘Altcoin Daily’.</p>\n\n<p>The thread I made yesterday was not meant in anyway to spread FUD about Cardano in anyway. It was solely to discuss the problems some Twitter users had with Cardano DeFi projects and I asked if someone more tech savvy and more  experience with Cardano  tech can further explain the problem that Twitter users reported. </p>\n\n<p>Since then, I have received hostile messages from a lot of Cardano community members and even the popular YouTuber ‘Altcoin Daily’, accusing me of spreading “coordinated FUD” against Cardano. </p>\n\n<p>There is 0 proof that this is a coordinated FUD attack on Cardano and the fact that the youtuber ‘Altcoin Daily’ is accusing me of spreading FUD and having “proofs”, which absolutely is not true, is just plain slander against me. </p>\n\n<p>I find it very toxic how hostile and aggressive the Cardano community responded to my thread and how the YouTuber ‘Altcoin Daily’ is accusing me doing a coordinated FUD attack. If he has proofs he can show them, or I will take legal action against him for accusing me of spreading misinformation in a coordinated matter.</p>\n\n<p>Edit: I tried to communicate in a civil manner and tried to address the FUD accusations. I got downvoted to hell, threatened, gaslighted, and called a lier and FUDer.</p>\n\n<p>I will clarify it once again to everyone.</p>\n\n<p>I did NOT aim to spread FUD against Cardano.\nI am NOT part of some group or a coordinated Cardano FUD attack campaign.\nI NEVER intended to damage Cardano. </p>\n\n<p>If Altcoin Daily has any proofs that  tried to FUD or that I am part of some group or coordination against Cardano then he shall present these proofs or delete the video of him calling me a FUDer, liar and manipulator and apologize.</p>\n</div><!-- SC_ON -->",
  "score": 170,
  "permalink": "/r/CryptoCurrency/comments/pip9ck/cardano_community_we_need_to_talk/",
  "subreddit": "CryptoCurrency",
  "id": "pip9ck",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Yesterday I posted a thread about Twitter users experiencing some problems with\nearly DeFi projects running on the Cardano network and since then I have been\naccused of being part of a “coordinated” FUD campaign aimed to damage the\nCardano project by the Cardano community and the YouTube Channel…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昨日、Cardanoネットワーク上で実行されている初期のDeFiプロジェクトにおいて、Twitterユーザーがいくつかの問題を経験しているというスレッドを投稿しました。\n昨日、私はCardanoネットワーク上で実行されている初期のDeFiプロジェクトに問題があるというスレッドを投稿しました。\nそれ以来、私は、Cardanoネットワークにダメージを与えることを目的とした「組織的な」FUDキャンペーンの一員であると非難されています。\nそれ以来、私は、CardanoコミュニティとYouTubeチャンネルによって、Cardanoプロジェクトにダメージを与えることを目的とした「組織的な」FUDキャンペーンの一部であると非難されました。",
      "title": "Cardanoコミュニティの皆さん、お話があります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "昨天我发布了一个关于Twitter用户在Cardano网络上运行的早期DeFi项目中遇到一些问题的话题。\n在Cardano网络上运行的早期DeFi项目遇到了一些问题，从那时起，我就被指控\n被指责为 \"协调的 \"FUD运动的一部分，旨在破坏\n卡达诺社区和YouTube频道对卡达诺项目进行的 \"协调 \"恐吓活动......",
      "title": "Cardano社区我们需要谈谈。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "昨天我發佈了一個關於Twitter用戶在Cardano網絡上運行的早期DeFi項目中遇到一些問題的話題。\n在Cardano網絡上運行的早期DeFi項目遇到了一些問題，從那時起，我就被指控\n被指責爲 \"協調的 \"FUD運動的一部分，旨在破壞\n卡達諾社區和YouTube頻道對卡達諾項目進行的 \"協調 \"恐嚇活動......",
      "title": "Cardano社區我們需要談談。"
    }
  ]
}