{
  "author": "Two_Pickachu_One_Cup",
  "original_created_utc": 1645514631,
  "title": "Why is everyone mocking the Dogecoin millionare? Shouldn't we as a community band together instead of mocking other people's success?",
  "created_utc": 1645534300,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Recent posts here have mocked outright the guy who took a risk and made a million dollars on dogecoin.&lt;/p&gt;\n\n&lt;p&gt;So what if he is down from that million? Could it hurt anyone to congratulate the guy instead of poking fun at his misfortune? I mean he is still up 250k and never sold. I don&amp;#39;t know about you, but that is more money than I have ever made in crypto and the guy has genuine balls to risk 250k early on Dogecoin.&lt;/p&gt;\n\n&lt;p&gt;And incase you didn&amp;#39;t notice, the whole damn market is down at the moment not just memecoins.&lt;/p&gt;\n\n&lt;p&gt;Yes he took a risk and yes i wouldn&amp;#39;t recommend anyone invest that much money on a memecoin, but it paid off for him and isn&amp;#39;t the whole damn point of investing in crypto to MAKE money? &lt;/p&gt;\n\n&lt;p&gt;We should be uniting people in the crypto community not dividing them by making fun at them. I for one am happy for him. If he becomes a future multi millionare doge holder I hope he sets and example by being humble back to those smug people who relentlessly poked fun at his misfortune.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 317,
  "permalink": "/r/CryptoCurrency/comments/syhh08/why_is_everyone_mocking_the_dogecoin_millionare/",
  "subreddit": "CryptoCurrency",
  "id": "syhh08",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Recent posts here have mocked outright the guy who took a risk and made a\nmillion dollars on dogecoin.\n\nSo what if he is down from that million? Could it hurt anyone to congratulate\nthe guy instead of poking fun at his misfortune? I mean he is still up 250k and\nnever sold. I don't know about you,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここ最近の投稿では、リスクを取って儲けた人を徹底的に馬鹿にしています。\ndogecoinで100万ドル。\n\nでは、その100万円から下がっていたらどうでしょう？お祝いの言葉をかけてもいいのでしょうか？\nその人の不幸をからかうのではなく、その人をからかうのですか？つまり、彼はまだ25万ドルも持っていて\nは売れなかった。どうなんだろう、、、、。",
      "title": "なぜみんなDogecoinの大富豪を馬鹿にするのか？他人の成功を馬鹿にするのではなく、コミュニティとして団結すべきではないでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近，这里的帖子直接嘲讽了那个冒着风险在狗币上赚了一百万美元的人。\n冒着风险在Dogecoin上赚了一百万美元。\n\n那么，如果他从那一百万中跌落下来又如何？祝贺他而不是嘲笑他，会对任何人造成伤害吗？\n而不是取笑他的不幸？我的意思是，他仍然有25万，而且\n从未售出。我不知道你的情况，...",
      "title": "为什么每个人都在嘲笑Dogecoin的百万富翁？作为一个社区，我们难道不应该团结起来，而不是嘲笑别人的成功吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近，這裏的帖子直接嘲諷了那個冒着風險在狗幣上賺了一百萬美元的人。\n冒着風險在Dogecoin上賺了一百萬美元。\n\n那麼，如果他從那一百萬中跌落下來又如何？祝賀他而不是嘲笑他，會對任何人造成傷害嗎？\n而不是取笑他的不幸？我的意思是，他仍然有25萬，而且\n從未售出。我不知道你的情況，...",
      "title": "爲什麼每個人都在嘲笑Dogecoin的百萬富翁？作爲一個社區，我們難道不應該團結起來，而不是嘲笑別人的成功嗎？"
    }
  ]
}