{
  "author": "Two_Pickachu_One_Cup",
  "original_created_utc": 1645514631,
  "title": "Why is everyone mocking the Dogecoin millionare? Shouldn't we as a community band together instead of mocking other people's success?",
  "created_utc": 1645534300,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Recent posts here have mocked outright the guy who took a risk and made a million dollars on dogecoin.&lt;/p&gt;\n\n&lt;p&gt;So what if he is down from that million? Could it hurt anyone to congratulate the guy instead of poking fun at his misfortune? I mean he is still up 250k and never sold. I don&amp;#39;t know about you, but that is more money than I have ever made in crypto and the guy has genuine balls to risk 250k early on Dogecoin.&lt;/p&gt;\n\n&lt;p&gt;And incase you didn&amp;#39;t notice, the whole damn market is down at the moment not just memecoins.&lt;/p&gt;\n\n&lt;p&gt;Yes he took a risk and yes i wouldn&amp;#39;t recommend anyone invest that much money on a memecoin, but it paid off for him and isn&amp;#39;t the whole damn point of investing in crypto to MAKE money? &lt;/p&gt;\n\n&lt;p&gt;We should be uniting people in the crypto community not dividing them by making fun at them. I for one am happy for him. If he becomes a future multi millionare doge holder I hope he sets and example by being humble back to those smug people who relentlessly poked fun at his misfortune.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 317,
  "permalink": "/r/CryptoCurrency/comments/syhh08/why_is_everyone_mocking_the_dogecoin_millionare/",
  "subreddit": "CryptoCurrency",
  "id": "syhh08",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Recent posts here have mocked outright the guy who took a risk and made a\nmillion dollars on dogecoin.\n\nSo what if he is down from that million? Could it hurt anyone to congratulate\nthe guy instead of poking fun at his misfortune? I mean he is still up 250k and\nnever sold. I don't know about you,…"
}