{
  "author": "Spreizbacken",
  "original_created_utc": 1636025368,
  "title": "If you are reading this, than you are already ahead in life!",
  "created_utc": 1636050680,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Seriously, do you have any idea what percentage of people in the world actually have some of their networth in crypto?  Sub 6% from what I hear lately.<br/>\nBe proud just to be here, you are witnessing a financial revolution and get to be in it!</p>\n\n<p>The majority of people do not invest any kind of money into their future, they live day by day and spend it as soon as they get it.<br/>\nAs long as you are willing to live below your means for some time in order to invest for the future and actually do something to achieve that financial freedom - you are doing better in life than most of the people you know!</p>\n\n<p>It doesn&#39;t matter if you invested $100 or $100k, if a hundred is a significant amount for you, than the gains on that would also be significant, so don&#39;t feel bad about not flexing yacht&#39;s from crypto.<br/>\nRemember, that time in the market is huge, so if you are patient those huge gains will eventually come.<br/>\nWe are still very early in this crypto journey. </p>\n\n<p>Kudos for being here and being a part of this. It wouldn&#39;t be possible without people like you.</p>\n</div><!-- SC_ON -->",
  "score": 260,
  "permalink": "/r/CryptoCurrency/comments/qmiikx/if_you_are_reading_this_than_you_are_already/",
  "subreddit": "CryptoCurrency",
  "id": "qmiikx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Seriously, do you have any idea what percentage of people in the world actually\nhave some of their networth in crypto? Sub 6% from what I hear lately.\nBe proud just to be here, you are witnessing a financial revolution and get to\nbe in it!\n\nThe majority of people do not invest any kind of money into…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "真面目な話、世界のどのくらいの割合の人が実際に自分の純資産の一部を暗号で持っているのか知っていますか？\n世界の人々が純資産の一部を暗号化していることを知っていますか？最近聞いた話では6％以下です。\nここにいることを誇りに思ってください。あなたは金融革命を目の当たりにしており、その中に\nることを誇りに思ってください。\n\n大多数の人は、どんな種類のお金でも...",
      "title": "これを読んでいる人は、すでに人生の先を行っていると言えるでしょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "说真的，你知道世界上有多大比例的人实际上\n他们的一些净资产是加密货币？从我最近听到的情况来看，低于6%。\n仅仅是在这里就应该感到自豪，你们正在见证一场金融革命，并且能够参与其中。\n融入其中!\n\n大多数人没有把任何形式的钱投资到...",
      "title": "如果你正在读这篇文章，那么你已经在生活中领先了!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "說真的，你知道世界上有多大比例的人實際上\n他們的一些淨資產是加密貨幣？從我最近聽到的情況來看，低於6%。\n僅僅是在這裏就應該感到自豪，你們正在見證一場金融革命，並且能夠參與其中。\n融入其中!\n\n大多數人沒有把任何形式的錢投資到...",
      "title": "如果你正在讀這篇文章，那麼你已經在生活中領先了!"
    }
  ]
}