{
  "author": "Ok-Camel2704",
  "original_created_utc": 1630588032,
  "title": "Is it rude to masturbate in bed when your partner is sleeping next to you?",
  "created_utc": 1630602348,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For various reasons my partner doesn&#39;t want to have sex at the moment. We&#39;ve had sex about 5 times since the beginning of 2020.</p>\n\n<p>I obviously respect them and let them initiate it, but I still want to get off. Is it rude if I masturbate (quietly, no porn) while they&#39;re sleeping next to me?</p>\n\n<p>I don&#39;t really enjoy masturbating in the shower. I&#39;ve done it a few times but it&#39;s not comfortable or nice for me, otherwise I&#39;d do it there. They never leave the house alone so I&#39;m never home alone either. \nNow I just, don&#39;t do it at all.</p>\n\n<p>Edit: I&#39;m going to ask them, my plan was always to ask them before doing anything. I&#39;m asking here first to make sure it&#39;s not a dumbass thing to even ask your partner. Sorry for not being clear about that in the first place.</p>\n</div><!-- SC_ON -->",
  "score": 209,
  "permalink": "/r/TooAfraidToAsk/comments/pghiyj/is_it_rude_to_masturbate_in_bed_when_your_partner/",
  "subreddit": "TooAfraidToAsk",
  "id": "pghiyj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "For various reasons my partner doesn't want to have sex at the moment. We've had\nsex about 5 times since the beginning of 2020.\n\nI obviously respect them and let them initiate it, but I still want to get off.\nIs it rude if I masturbate (quietly, no porn) while they're sleeping next to me?\n\nI don't…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "色々な理由でパートナーが今はセックスをしたくないと言っています。これまでに\n2020年に入ってから5回ほどセックスしています。\n\n私は明らかに相手を尊重し、相手に主導権を握らせていますが、私はまだ興奮したいのです。\n彼らが私の隣で寝ている間に私が（静かに、ポルノではなく）オナニーをしたら、失礼にあたるでしょうか？\n\n私は...",
      "title": "パートナーが隣で寝ているときに、ベッドでオナニーをするのは失礼にあたるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "由于各种原因，我的伴侣目前不想做爱。我们已经有\n自2020年年初以来，我们已经发生了大约5次性关系。\n\n我显然尊重他们，并让他们主动提出，但我仍然想得到满足。\n如果我在他们睡在我旁边的时候自慰（安静地，没有色情），是不是很不礼貌？\n\n我不...",
      "title": "当你的伴侣睡在你旁边时，在床上自慰是不礼貌的吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "由於各種原因，我的伴侶目前不想做愛。我們已經有\n自2020年年初以來，我們已經發生了大約5次性關係。\n\n我顯然尊重他們，並讓他們主動提出，但我仍然想得到滿足。\n如果我在他們睡在我旁邊的時候自慰（安靜地，沒有色情），是不是很不禮貌？\n\n我不...",
      "title": "當你的伴侶睡在你旁邊時，在牀上自慰是不禮貌的嗎？"
    }
  ]
}