{
  "author": "theaverage78",
  "original_created_utc": 1631762804,
  "title": "Sorry that this question will put you on blast, but for guys who aren’t great in bed but have successful relationships, how?",
  "created_utc": 1631774971,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi, so I’m really overthinking things a lot. I’m small compared to the average size, and while I don’t have a girlfriend now, it’s definitely a thought that I contemplate a lot especially for the future. At my age, 19-22, sex is a big thing for most people and especially in relationships, they crave that physical intimacy. I haven’t dated before and am still a virgin. So it’s a thought that I am constantly worried about, that my performance is a factor for whether or not a person of interest will or will not want to date me. I know that relationships are more than just sex but eventually it will and have to be brought up in any relationship. And I myself don’t want to be in an open relationship, but than I feel that’s me burdening my partner. \nFor people who have been in that position and have a successful relationship, how were you able to overcome it with your partner if sex is a big deal for them?</p>\n</div><!-- SC_ON -->",
  "score": 135,
  "permalink": "/r/TooAfraidToAsk/comments/pp5gbn/sorry_that_this_question_will_put_you_on_blast/",
  "subreddit": "TooAfraidToAsk",
  "id": "pp5gbn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi, so I’m really overthinking things a lot. I’m small compared to the average\nsize, and while I don’t have a girlfriend now, it’s definitely a thought that I\ncontemplate a lot especially for the future. At my age, 19-22, sex is a big\nthing for most people and especially in relationships, they crave…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは、だから私は本当にたくさんのことを考えすぎています。私は平均的な体格に比べて小さいです。\n今は彼女がいませんが、将来のことを考えると考えてしまいます。\n私は平均的な体格に比べて小さいので、今は彼女がいませんが、特に将来のことを考えるとよく考えます。私の年齢（19-22）では、ほとんどの人にとってセックスは大きな問題です。\n私の年齢（19-22）では、ほとんどの人にとってセックスは大きな問題であり、特に恋愛においては、彼らは...を切望しています。",
      "title": "この質問があなたを追い詰めることになるのは申し訳ないのですが、ベッドでは素晴らしいとは言えないけれど、人間関係がうまくいっている男性は、どのようにしているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嗨，所以我真的想得太多了。与一般人相比，我的个子很小。\n虽然我现在没有女朋友，但这绝对是我经常考虑的一个问题，尤其是对未来。\n思考了很多，尤其是对未来的思考。在我这个年龄，19-22岁，性是一件大事\n对大多数人来说，性是一件大事，特别是在关系中，他们渴望......",
      "title": "很抱歉这个问题会让你受到打击，但对于那些在床上不是很好但有成功关系的人来说，如何？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嗨，所以我真的想得太多了。與一般人相比，我的個子很小。\n雖然我現在沒有女朋友，但這絕對是我經常考慮的一個問題，尤其是對未來。\n思考了很多，尤其是對未來的思考。在我這個年齡，19-22歲，性是一件大事\n對大多數人來說，性是一件大事，特別是在關係中，他們渴望......",
      "title": "很抱歉這個問題會讓你受到打擊，但對於那些在牀上不是很好但有成功關係的人來說，如何？"
    }
  ]
}