{
  "author": "throwaway-porfavor",
  "original_created_utc": 1654964462,
  "title": "Why do so many people hate on CA?",
  "created_utc": 1655003235,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;i know this is my home state and people will say loving your home is a “given”. But I’ve traveled all over the US - even lived a bit in a couple of other states - NV and TX. And I still don’t understand how someone can irrationally hate on California? &lt;/p&gt;\n\n&lt;p&gt;No place is perfect. Ok I get that. We have our share of issues such as homelessness and high COL in our major cities. &lt;/p&gt;\n\n&lt;p&gt;I’ve met some nice people from Texas, Colorado and Nevada. Beautiful landscapes in all three of those. And great food in San Antonio for instance. &lt;/p&gt;\n\n&lt;p&gt;But - and I don’t mean this in a pissing contest sort of way - but what I don’t get is the irrational dislike when I tell people where I’m from when I travel. I’ve always been lowkey proud of my state. We have every kind of landscape - city, suburb, forest, rocky and sandy beaches, farmland (producing most likely, your fruits and veggies), dessert, I mean we have Joshua Tree National Park and lots more beautiful landscapes (not meaning to brag but i guess i lowkey am) etc. we’re not just Hollywood or whatever lots of people like to say. we’ve got a place for every walk of life. &lt;/p&gt;\n\n&lt;p&gt;But when I travel and meet people, it’s as though I can see it right away in the look in their face: “oh. You’re one of &lt;em&gt;those&lt;/em&gt; lol”. And they get distant, the conversation becomes more polite at best and starts to come to a close. ok cool, each their own. &lt;/p&gt;\n\n&lt;p&gt;Honest (hopefully not stupid?)question - but like what is there to hate about us?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 109,
  "permalink": "/r/NoStupidQuestions/comments/va0ytn/why_do_so_many_people_hate_on_ca/",
  "subreddit": "NoStupidQuestions",
  "id": "va0ytn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "i know this is my home state and people will say loving your home is a “given”.\nBut I’ve traveled all over the US - even lived a bit in a couple of other states\n- NV and TX. And I still don’t understand how someone can irrationally hate on\nCalifornia?\n\nNo place is perfect. Ok I get that. We have…"
}