{
  "author": "3kool5you",
  "original_created_utc": 1649020163,
  "title": "Why did coastal parts of West Africa never take off as vacation hubs in the same way the Caribbean has?",
  "created_utc": 1649045798,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I understand on a general level, a large part of it is probably due to the mass colonization and dicing up of African regions which led to/increased turmoil across the continent, but is there more to it than that or more specifics?&lt;/p&gt;\n\n&lt;p&gt;What I mean is, for US folks (I can’t speak to other countries), the common “island” vacation destinations are the Caribbean islands, parts of Central/South America, etc. I’m admittedly looking at this with a US bias, so maybe it’s just due to proximity that the Caribbean has the vacation reputation that it does, and maybe Europeans do take more trips to Africa. But I would think the warm climate and coastal parts of Africa, as well as their own islands, would make for some good resort areas. Yet you rarely see people take trips or honeymoons to these West African countries with the frequency of which trips are taken to the Caribbean. Is it mainly a proximity thing or due to the “reputation”?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/tvk1ad/why_did_coastal_parts_of_west_africa_never_take/",
  "subreddit": "AskHistorians",
  "id": "tvk1ad",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I understand on a general level, a large part of it is probably due to the mass\ncolonization and dicing up of African regions which led to/increased turmoil\nacross the continent, but is there more to it than that or more specifics?\n\nWhat I mean is, for US folks (I can’t speak to other countries),…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "一般的なレベルでは理解していますが、その大部分は質量に起因しているのでしょう\nアフリカの地域が植民地化され、切り刻まれ、その結果、混乱が生じた。\nしかし、それ以上に具体的なことがあるのでしょうか？\n\nつまり、アメリカの人々にとって（他の国のことは言えませんが）、...",
      "title": "西アフリカの沿岸地域は、なぜカリブ海のようにバカンスの拠点として発展しなかったのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我了解到，在一般情况下，很大一部分原因可能是由于大规模的殖民化和对非洲地区的分割，导致/增加了非洲的人口。\n殖民化和对非洲地区的分割导致/增加了整个非洲大陆的动荡。\n导致整个大陆的动荡，但是否有更多内容或更多细节？\n\n我的意思是，对于美国人来说（我不能说其他国家的情况），...",
      "title": "为什么西非的沿海地区从未像加勒比地区那样成为度假中心？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我瞭解到，在一般情況下，很大一部分原因可能是由於大規模的殖民化和對非洲地區的分割，導致/增加了非洲的人口。\n殖民化和對非洲地區的分割導致/增加了整個非洲大陸的動盪。\n導致整個大陸的動盪，但是否有更多內容或更多細節？\n\n我的意思是，對於美國人來說（我不能說其他國家的情況），...",
      "title": "爲什麼西非的沿海地區從未像加勒比地區那樣成爲度假中心？"
    }
  ]
}