{
  "author": "Soggy-Drink-2528",
  "original_created_utc": 1631998071,
  "title": "Do White people walk on eggshells when they're around Black people?",
  "created_utc": 1632009609,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m a 17 year old black kid and I ask this question because I&#39;ve got this new History teacher who seems to want to be &quot;accepted&quot; by black people by saying the most obvious things in the world like, &quot;Racism still exists&quot;. I could be wrong, but it feels like she has this underdog mentality when it comes to minorities and she feels she has to &quot;stand up for us&quot; even if that means just saying stupid shit. Nobody else in the class notices it and it is a 99.9% black school for what it&#39;s worth. I just cringe at some of the shit she says. She said she left Colorado because all of the people are &quot;white and rich&quot;. I get the rich part, but in my mind, I&#39;m thinking, &quot;Aren&#39;t you white&quot;. I would never leave my city saying everyone was &quot;black and broke&quot;. She just seems so fake woke and walks on eggshells around us and it makes me fucking cringe. Am I right about her? And do you notice other white people doing this around &quot;people of color&quot;?</p>\n</div><!-- SC_ON -->",
  "score": 119,
  "permalink": "/r/TooAfraidToAsk/comments/pqu74c/do_white_people_walk_on_eggshells_when_theyre/",
  "subreddit": "TooAfraidToAsk",
  "id": "pqu74c",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm a 17 year old black kid and I ask this question because I've got this new\nHistory teacher who seems to want to be \"accepted\" by black people by saying the\nmost obvious things in the world like, \"Racism still exists\". I could be wrong,\nbut it feels like she has this underdog mentality when it…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は17歳の黒人の子供ですが、この質問をしたのは、新しい歴史の先生ができたからです。\n歴史の先生は、「人種差別はまだ存在する」というような世界で最も明白なことを言って、黒人に「受け入れられたい」と思っているようです。\n人種差別はまだ存在する」というような、世界で最も明白なことを言って、黒人に「受け入れられたい」ようです。私は間違っているかもしれません。\n私は間違っているかもしれませんが、彼女には負け犬根性があるような気がします...",
      "title": "白人は黒人のそばにいるとき、卵の殻をかぶって歩くのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个17岁的黑人小孩，我问这个问题是因为我有一个新的\n我问这个问题是因为我有一个新的历史老师，他似乎想被黑人 \"接受\"，说了一些世界上最明显的事情，比如 \"种族主义仍然存在\"。\n世界上最明显的事情，如 \"种族主义仍然存在\"。我可能是错的。\n但我感觉她有这种劣势心态，当它...",
      "title": "白人在黑人身边时，会不会在蛋壳上行走？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個17歲的黑人小孩，我問這個問題是因爲我有一個新的\n我問這個問題是因爲我有一個新的歷史老師，他似乎想被黑人 \"接受\"，說了一些世界上最明顯的事情，比如 \"種族主義仍然存在\"。\n世界上最明顯的事情，如 \"種族主義仍然存在\"。我可能是錯的。\n但我感覺她有這種劣勢心態，當它...",
      "title": "白人在黑人身邊時，會不會在蛋殼上行走？"
    }
  ]
}