{
  "approved_at_utc": null,
  "subreddit": "Bogleheads",
  "selftext": "I'm trying to wrap my head around a need of having an emergency fund in any significant amount \"just in case\" - do I really need this when I live in Europe?\n\n\\- I have healthy income from a job in a jurisdiction where I can't be fired at will and even if I am fired due to restructuring or something I will get severance payment and unemployment benefit replacing my lost income (75% for half year). 75% of my income is way more than I spend, I actually save more than 40% of my monthly cashflows normally.\n\n\\- Also in my jurisdiction health care is free except for very manageable annual deductible (385 eur, fraction of my normal costs of living). Also, if I get sick, I get fully paid sick leave, if I'm unable to work long-term, there's long term disability insurance. House damaged? Got home-owner insurance. Caused damage to a 3rd party? I've got 3rd party liability insurance. Car issues? That's also insured, if car breaks catastrophically - well, I don't even need it I can bike anywhere or take a train, car is convenience, not necessity here.\n\n\\- on top of that I have bunch of liquid investments - some ETFs, around 2 annual salaries of worth. Even if something happens I can liquidate tiny fraction of this with a click of the button and transfer myself cash which will take 3 days to arrive to my banking accounts ready to use.\n\n\\- I have 2 credit cards with collective limit well above my 3 months salary so even if that 3 days is not enough because I need money *right now* (i.e. travel emergency, need to buy plane tickets) - that's fine, I got this covered. Also it's not as if I don't have money on my checking account - I do, just not 3 salaries but closer to half (which is more or less my monthly cost of living, I save 40% routinely, I could easily survive and keep paying bills for half)\n\nSo given all of these: what risk did I miss? Is self insuring from this risk really worth removing a quarter of my annual salary from the markets? \n\nHonestly the only thing I can think of is judicial risk - tax office arbitrarily blocking my accounts by mistake and cutting me off all electronic funds. For that reason I keep a small (very) stash of cash at home, enough to buy food for few weeks. And then - how likely is that to happen to a law-abiding citizen duly paying his due taxes.",
  "author_fullname": "t2_hfh6vuha",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Do you really need emergency fund if you're well insured and have liquid investments?",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/Bogleheads",
  "hidden": false,
  "pwls": 7,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_s70nqw",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.87,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 18,
  "total_awards_received": 1,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 18,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1642521305,
  "link_flair_type": "text",
  "wls": 7,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.Bogleheads",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m trying to wrap my head around a need of having an emergency fund in any significant amount &amp;quot;just in case&amp;quot; - do I really need this when I live in Europe?&lt;/p&gt;\n\n&lt;p&gt;- I have healthy income from a job in a jurisdiction where I can&amp;#39;t be fired at will and even if I am fired due to restructuring or something I will get severance payment and unemployment benefit replacing my lost income (75% for half year). 75% of my income is way more than I spend, I actually save more than 40% of my monthly cashflows normally.&lt;/p&gt;\n\n&lt;p&gt;- Also in my jurisdiction health care is free except for very manageable annual deductible (385 eur, fraction of my normal costs of living). Also, if I get sick, I get fully paid sick leave, if I&amp;#39;m unable to work long-term, there&amp;#39;s long term disability insurance. House damaged? Got home-owner insurance. Caused damage to a 3rd party? I&amp;#39;ve got 3rd party liability insurance. Car issues? That&amp;#39;s also insured, if car breaks catastrophically - well, I don&amp;#39;t even need it I can bike anywhere or take a train, car is convenience, not necessity here.&lt;/p&gt;\n\n&lt;p&gt;- on top of that I have bunch of liquid investments - some ETFs, around 2 annual salaries of worth. Even if something happens I can liquidate tiny fraction of this with a click of the button and transfer myself cash which will take 3 days to arrive to my banking accounts ready to use.&lt;/p&gt;\n\n&lt;p&gt;- I have 2 credit cards with collective limit well above my 3 months salary so even if that 3 days is not enough because I need money &lt;em&gt;right now&lt;/em&gt; (i.e. travel emergency, need to buy plane tickets) - that&amp;#39;s fine, I got this covered. Also it&amp;#39;s not as if I don&amp;#39;t have money on my checking account - I do, just not 3 salaries but closer to half (which is more or less my monthly cost of living, I save 40% routinely, I could easily survive and keep paying bills for half)&lt;/p&gt;\n\n&lt;p&gt;So given all of these: what risk did I miss? Is self insuring from this risk really worth removing a quarter of my annual salary from the markets? &lt;/p&gt;\n\n&lt;p&gt;Honestly the only thing I can think of is judicial risk - tax office arbitrarily blocking my accounts by mistake and cutting me off all electronic funds. For that reason I keep a small (very) stash of cash at home, enough to buy food for few weeks. And then - how likely is that to happen to a law-abiding citizen duly paying his due taxes.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2shb7",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "s70nqw",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "scodagama1",
  "discussion_type": null,
  "num_comments": 39,
  "send_replies": true,
  "whitelist_status": "some_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/Bogleheads/comments/s70nqw/do_you_really_need_emergency_fund_if_youre_well/",
  "parent_whitelist_status": "some_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/Bogleheads/comments/s70nqw/do_you_really_need_emergency_fund_if_youre_well/",
  "subreddit_subscribers": 130540,
  "created_utc": 1642542615,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1642521305,
  "the_new_excerpt": "I'm trying to wrap my head around a need of having an emergency fund in any\nsignificant amount \"just in case\" - do I really need this when I live in Europe?\n\n- I have healthy income from a job in a jurisdiction where I can't be fired at\nwill and even if I am fired due to restructuring or something…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "緊急時の資金を少しでも確保する必要性について、頭を悩ませているところです。\nヨーロッパに住んでいて、本当に必要なのでしょうか？\n\n- ヨーロッパに住んでいて、本当に必要なのでしょうか？\nまた、リストラなどで解雇されたとしても...。",
      "title": "保険に加入し、流動性のある投資をしていれば、緊急資金は本当に必要なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我正试图把我的头绕过一个需要有紧急基金的任何 \"万一\"。\n以防万一\"--当我住在欧洲时，我真的需要这样做吗？\n\n- 我有一份健康的收入，在一个不能被解雇的司法管辖区工作。\n即使我因重组或其他原因被解雇......",
      "title": "如果你有良好的保险和流动投资，你真的需要应急基金吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我正試圖把我的頭繞過一個需要有緊急基金的任何 \"萬一\"。\n以防萬一\"--當我住在歐洲時，我真的需要這樣做嗎？\n\n- 我有一份健康的收入，在一個不能被解僱的司法管轄區工作。\n即使我因重組或其他原因被解僱......",
      "title": "如果你有良好的保險和流動投資，你真的需要應急基金嗎？"
    }
  ]
}