{
  "author": "TwisTED_Ech0",
  "original_created_utc": 1643318197,
  "title": "How is it fine my coworker takes a smoke break every hour for 10 minutes, but I can’t stand around for the same amount of time?",
  "created_utc": 1643338381,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I work in a small fish store and there’s 3 employees. The manager, the other guy, and me. The other guy smokes, whatever, but he goes to his car once an hour. At the end of the each day he is getting out of over an hour of work. I don’t smoke but the moment I stop the owner who’s watching the cameras calls the store to tell the manager to get me doing something. Fucking bullshit.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 114,
  "permalink": "/r/NoStupidQuestions/comments/se8x2u/how_is_it_fine_my_coworker_takes_a_smoke_break/",
  "subreddit": "NoStupidQuestions",
  "id": "se8x2u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I work in a small fish store and there’s 3 employees. The manager, the other\nguy, and me. The other guy smokes, whatever, but he goes to his car once an\nhour. At the end of the each day he is getting out of over an hour of work. I\ndon’t smoke but the moment I stop the owner who’s watching the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は小さな魚屋で働いていますが、従業員は3人です。店長ともう一人\nと私です。もう一人の男はタバコを吸いますが、1日に1回、自分の車に乗ります。\n時間です。一日の終わりには、彼は1時間以上の仕事から解放されているのです。I\nタバコを吸わない私が立ち止まった瞬間、それを見ていたオーナーは......。",
      "title": "同僚は1時間に1回、10分間タバコを吸うのに、私は同じ時間立っていられないのはどうしてですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在一家小鱼店工作，有3名员工。经理，另一个\n和我。另一个人抽烟，不管怎样，但他每小时去一次他的车。\n一小时一次。每天结束时，他都要离开一个多小时的工作。I\n我不抽烟，但当我停下来的那一刻，正在观察的老板......。",
      "title": "为什么我的同事每小时休息10分钟就可以了，而我却不能站在那里休息同样的时间呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在一家小魚店工作，有3名員工。經理，另一個\n和我。另一個人抽菸，不管怎樣，但他每小時去一次他的車。\n一小時一次。每天結束時，他都要離開一個多小時的工作。I\n我不抽菸，但當我停下來的那一刻，正在觀察的老闆......。",
      "title": "爲什麼我的同事每小時休息10分鐘就可以了，而我卻不能站在那裏休息同樣的時間呢？"
    }
  ]
}