{
  "author": "themusicdude11",
  "original_created_utc": 1636152667,
  "title": "I experienced my first rug pull today, please be careful. Invest wisely",
  "created_utc": 1636162914,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Last night I heard about a launch on a new coin, “crypto hippies”. A lot of tiktokers were promoting it, it had a really well made website, all social media platform, telegram etc.. so it seemed promising to me. I decided to set an alarm for 9:00 AM which was the launch time. And I decided to invest a little over $3,000 into it. My hope was if I get in early I can possibly 5-10x my money and get out. Purchased the coin and watched the buy and sell orders fly in. Then, a massive amount of buys and ZERO sells. I didn’t think much of it but I go and shower for work and I come out and it goes from .07 to .0001. They dumped everything, no one was able to sell. The developers cashed out and I lost everything. I honestly am at a point in my life where my job is making me so depressed so like a lot of people I’m looking for a get rich quick method, and meme coins seem to be what the hype is all about now. But because of my irrational decisions and not enough research I am now down $3,000. Which isn’t a lot to most people but this was pretty much all of my savings. I know that’s a stupid decision to make but it made sense to me and I’m just doing my part and warning people to always do research and be cautious and never invest money you can’t loose. I am loosing my mind over this honestly, I can’t focus at work I can’t eat, and I probably won’t sleep. But lessons aren’t free in life. And I hope this can help someone out there before they make the same mistake I did. Take care!</p>\n</div><!-- SC_ON -->",
  "score": 291,
  "permalink": "/r/CryptoCurrency/comments/qnmqzs/i_experienced_my_first_rug_pull_today_please_be/",
  "subreddit": "CryptoCurrency",
  "id": "qnmqzs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Last night I heard about a launch on a new coin, “crypto hippies”. A lot of\ntiktokers were promoting it, it had a really well made website, all social media\nplatform, telegram etc.. so it seemed promising to me. I decided to set an alarm\nfor 9:00 AM which was the launch time. And I decided to invest…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昨晩、「crypto hippies」という新しいコインのローンチについて聞きました。多くの\n多くのTiktokerがこのコインを宣伝していて、とてもよくできたウェブサイト、すべてのソーシャル・メディア・プラットフォーム、テレグラムなどがありました。\nプラットフォーム、テレグラムなどがあり、私には有望に思えました。私はアラームをセットすることにしました。\n朝9時に目覚ましをかけることにしました。そして、私は投資することに決めました...",
      "title": "今日初めてラグプルを体験しましたが、気をつけてください。賢い投資"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "昨晚我听说了一个关于新币 \"加密嬉皮士 \"的发布会。很多\n很多tiktokers在宣传它，它有一个非常好的网站，所有的社会媒体\n平台，电报等等，所以对我来说似乎很有希望。我决定设置一个闹钟\n上午9:00，这是启动时间。然后我决定投资...",
      "title": "我今天经历了第一次拉地毯，请大家小心。明智的投资"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "昨晚我聽說了一個關於新幣 \"加密嬉皮士 \"的發佈會。很多\n很多tiktokers在宣傳它，它有一個非常好的網站，所有的社會媒體\n平臺，電報等等，所以對我來說似乎很有希望。我決定設置一個鬧鐘\n上午9:00，這是啓動時間。然後我決定投資...",
      "title": "我今天經歷了第一次拉地毯，請大家小心。明智的投資"
    }
  ]
}