{
  "author": "SuspiciousTurtle",
  "the_new_excerpt": "In the last scenes of JoJo Rabbit, the main character Jojo finds out from his 10\nyear old friend that Hitler had committed suicide, but this all happens even as\nhis entire town is mounting a defense against an allied invasion. My question\nis:\n\n- Is this accurate? Was there still a Nazi effort to…",
  "original_created_utc": 1611598073,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在《乔乔兔》的最后一场戏中，主人公乔乔从他的10\n年的朋友说希特勒已经自杀了，但这一切的发生，甚至是作为\n他的整个城市正在安装一个防御 对联军的入侵。我的问题是\n是。\n\n- 这是准确的吗？是否还有纳粹的努力... ...",
      "title": "在《乔乔兔》中，纳粹在希特勒自杀广为人知后，仍试图对盟军的入侵进行防御。这是否准确，如果是，他们为什么要这么做？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在《喬喬兔》的最後一場戲中，主人公喬喬從他的10\n年的朋友說希特勒已經自殺了，但這一切的發生，甚至是作爲\n他的整個城市正在安裝一個防禦 對聯軍的入侵。我的問題是\n是。\n\n- 這是準確的嗎？是否還有納粹的努力... ...",
      "title": "在《喬喬兔》中，納粹在希特勒自殺廣爲人知後，仍試圖對盟軍的入侵進行防禦。這是否準確，如果是，他們爲什麼要這麼做？"
    }
  ],
  "title": "In JoJo Rabbit, Nazis attempt to mount a defense against an allied invasion even after Hitler's suicide was widely known. Is this accurate, and if so, why did they do it?",
  "created_utc": 1611626805,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In the last scenes of JoJo Rabbit, the main character Jojo finds out from his 10 year old friend that Hitler had committed suicide, but this all happens even as his entire town is mounting a defense against an allied invasion. My question is:</p>\n\n<p>- Is this accurate? Was there still a Nazi effort to defend against allied forces even after Hitler had committed suicide?</p>\n\n<p>- If that is accurate, why? At that point the war seems clearly lost, so why did they try to put up a defense, only to lose more lives and already incredibly scarce resources?</p>\n\n<p>- Side question: In the movie, the &quot;defense&quot; is depicted as putting a gun in basically everyone&#39;s hands, and sending them towards the fire. Is that an accurate depiction of the final days of the Nazi war effort, or was there more organization than that?</p>\n</div><!-- SC_ON -->",
  "score": 128,
  "permalink": "/r/AskHistorians/comments/l4tk22/in_jojo_rabbit_nazis_attempt_to_mount_a_defense/",
  "subreddit": "AskHistorians",
  "id": "l4tk22",
  "is_self": true,
  "media": null,
  "is_video": false
}