{
  "author": "HomaRoma",
  "original_created_utc": 1635868983,
  "title": "Were the “Wildmen” of European folklore a cultural memory from the Indo Europeans?",
  "created_utc": 1635941507,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was reading about the wild men dance of a town in Bavaria that can be dated back to Celtic times. Jumping around, I saw that there is a Swiss myth about peasant farmers capturing wild men to get their knowledge which echos Roman stories also. </p>\n\n<p>It makes intuitive sense that if there stories are shared across European folklore, it dates back to a common point in time when agricultural people moving in, settling, and coming into contact with “wild people” with deep knowledge of the land.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/ql7gk5/were_the_wildmen_of_european_folklore_a_cultural/",
  "subreddit": "AskHistorians",
  "id": "ql7gk5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was reading about the wild men dance of a town in Bavaria that can be dated\nback to Celtic times. Jumping around, I saw that there is a Swiss myth about\npeasant farmers capturing wild men to get their knowledge which echos Roman\nstories also.\n\nIt makes intuitive sense that if there stories are…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ケルトの時代に遡ることができるバイエルンの町の野人の踊りについて読んでいました。\nケルト人の時代に遡ることができます。あちこち飛び回っているうちに、スイスには農民が野人を捕まえて知識を得ようとする神話があることを知りました。\n農民が野生の男を捕まえて知識を得るというスイスの神話があります。\nこれはローマ時代の話にも似ています。\n\n直感的に理解できるのは、もしそのような話が...",
      "title": "ヨーロッパの民間伝承の「ワイルドマン」は、印欧人からの文化的記憶だったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在书中读到巴伐利亚一个小镇的野人舞，可以追溯到凯尔特时代。\n可以追溯到凯尔特人时代。跳来跳去，我看到有一个关于瑞士神话的故事\n农民捕捉野人以获得他们的知识，这也是罗马人的故事的回声。\n故事也是如此。\n\n从直觉上讲，如果这些故事是...",
      "title": "欧洲民间传说中的 \"野人 \"是来自印欧人的文化记忆吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在書中讀到巴伐利亞一個小鎮的野人舞，可以追溯到凱爾特時代。\n可以追溯到凱爾特人時代。跳來跳去，我看到有一個關於瑞士神話的故事\n農民捕捉野人以獲得他們的知識，這也是羅馬人的故事的回聲。\n故事也是如此。\n\n從直覺上講，如果這些故事是...",
      "title": "歐洲民間傳說中的 \"野人 \"是來自印歐人的文化記憶嗎？"
    }
  ]
}