{
  "author": "BlazingJava",
  "original_created_utc": 1641981678,
  "title": "Fed has too much power over crypto and that was not suppose to happen",
  "created_utc": 1641998118,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been thinking about this lately.&lt;/p&gt;\n\n&lt;p&gt;Crypto was supposed to be decentralized so it would not have a single entity controlling it. We would not be bond to the whims of a single centralized government or private entity.&lt;/p&gt;\n\n&lt;p&gt;And as of late i&amp;#39;ve seen crypto being controlled by the fed. They say they will print more crypto pumps, they say they will print less crypto dumps. This is the same as the stock market and it&amp;#39;s a shame because it defeats the sole porpuse of decentralization.&lt;/p&gt;\n\n&lt;p&gt;If you think the fed will ever fight inflation think again&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/ypt6qrxr98b81.png?width=770&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=d53e7d664544a3fa7e501f82d9926a4902962655\"&gt;https://preview.redd.it/ypt6qrxr98b81.png?width=770&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=d53e7d664544a3fa7e501f82d9926a4902962655&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;1921- &amp;quot;In the 19th century, deflationary periods were the result of an increase in production, rather than a decrease in demand. During the Great Depression, deflation was the result of &lt;strong&gt;a collapsing financial sector and bank failures&lt;/strong&gt;. &amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Demand is higher and production is slower, there&amp;#39;s news everywhere of cars unable to be sold because they lack chips.&lt;/p&gt;\n\n&lt;p&gt;This pandemic hit most supply chains everywhere, and that&amp;#39;s until it&amp;#39;s normalized there will be more demand for some products than actual production.&lt;/p&gt;\n\n&lt;p&gt;Maybe in a couple of years while normalizing the supply chain we will actually produce more than demand requires and it will be 1921 all over again....&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;1930 -  &amp;quot;During the Great Depression, deflation was the &lt;strong&gt;result of a collapsing financial sector and bank failures&lt;/strong&gt;. The deflation that took place at the outset of the Great Depression was the most dramatic that the U.S. has ever experienced. Prices dropped an average of ten percent every year between the years of 1930 and 1933. &amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Prices drop 10% a year is something that won&amp;#39;t stimulate the economy, ask yourself why would you buy a car worth 10k when next year it will be 9k or a house. People would spend much less because saving was making them money.&lt;/p&gt;\n\n&lt;p&gt;This is something the economy can&amp;#39;t afford right now, many companies are barely surviving and the least they need is people to be willing to spend less money because they don&amp;#39;t want to spend their savings which are increasing in value.&lt;/p&gt;\n\n&lt;p&gt;Crypto should be an edge against inflation which is rampant and most likely never tackled with, printing is done there&amp;#39;s no way they will reverse course.&lt;/p&gt;\n\n&lt;p&gt;No matter what the fed says I doubt they will actually go for deflationary policy. They might print less.&lt;/p&gt;\n\n&lt;p&gt;Look at Obama&amp;#39;s term he started with 2008 crash the housing crash!!!&lt;/p&gt;\n\n&lt;p&gt;8 years of Obama&amp;#39;s term with good economy and yet the fed didn&amp;#39;t increase rates. Only when Trump became president did they started increasing.&lt;/p&gt;\n\n&lt;p&gt;So if we take into account the same we still have 6 years left of Joe Biden with covid crisis, if he lives that long., with no rate hike.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Resume: Crypto will always be an edge against inflation which will never be tackled, No matter what the fed says crypto should do it&amp;#39;s own thing.&lt;/p&gt;\n\n&lt;p&gt;I fear more rampant inflation and the hit on my savings than a crypto crash, because crypto proved to me it can recover, and my savings are still worth less and less.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 466,
  "permalink": "/r/CryptoCurrency/comments/s22ret/fed_has_too_much_power_over_crypto_and_that_was/",
  "subreddit": "CryptoCurrency",
  "id": "s22ret",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've been thinking about this lately.\n\nCrypto was supposed to be decentralized so it would not have a single entity\ncontrolling it. We would not be bond to the whims of a single centralized\ngovernment or private entity.\n\nAnd as of late i've seen crypto being controlled by the fed. They say they…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、思うことがあるんです。\n\n暗号は分散型であるべきでしたから 単一団体を持つことはありません\nそれをコントロールする。私たちは中央集権的な一つの気まぐれに縛られることなく\n政府または民間企業。\n\nそして最近、暗号が連邦政府によってコントロールされているのを目にしました。彼らが言うには...",
      "title": "FRBは暗号に対してあまりにも大きな力を持っており、それは起こるはずのないことだった。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近一直在思考这个问题。\n\n加密货币应该是去中心化的，所以它不会有一个单一实体\n控制它。我们不会被一个中央集权的政府或私人实体的奇思妙想所束缚。\n政府或私人实体的想法。\n\n而最近，我看到加密货币被联邦控制了。他们说他们...",
      "title": "美联储对加密货币拥有太多的权力，这是不应该发生的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近一直在思考這個問題。\n\n加密貨幣應該是去中心化的，所以它不會有一個單一實體\n控制它。我們不會被一箇中央集權的政府或私人實體的奇思妙想所束縛。\n政府或私人實體的想法。\n\n而最近，我看到加密貨幣被聯邦控制了。他們說他們...",
      "title": "美聯儲對加密貨幣擁有太多的權力，這是不應該發生的。"
    }
  ]
}