{
  "author": "ammads94",
  "original_created_utc": 1645629179,
  "title": "Why do we condemn Russians taking land but we’re okay with Israelis doing the same thing to the Palestinians?",
  "created_utc": 1645635187,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So… based on recent events of Russia and Ukraine, why do we condemn Russians taking land but we’re okay with Israelis doing the same thing to the Palestinians?&lt;/p&gt;\n\n&lt;p&gt;Like.. is it because they don’t have resources to be of any use? If that’s the case, then Ukraine is a poor and corrupted country.&lt;/p&gt;\n\n&lt;p&gt;Or is it because it’s in our backyard?&lt;/p&gt;\n\n&lt;p&gt;PS: I’m European, not Russian nor American&lt;/p&gt;\n\n&lt;p&gt;EDIT: I want to clarify that i’m talking about sanctions and whatnot, I know that people are against this. But Israel gets millions, if not billions of dollars despite what they’re doing.&lt;/p&gt;\n\n&lt;p&gt;EDIT 2: I am not supporting either side or any side, but it’s harsh to see the Palestinian and Yemeni genocide, and nothing has been done to the Saudis nor Israelis, yet the amount of support for Ukraine has been outstanding (which is great, but yeah).&lt;/p&gt;\n\n&lt;p&gt;EDIT 3: I’m not referring to the citizens of the Western nations, but to their powers. And i’m not referring only to the US, because even the EU - where i’m from - hasn’t done anything either (and has even supported several genocides across the Middle East)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 222,
  "permalink": "/r/TooAfraidToAsk/comments/szjrje/why_do_we_condemn_russians_taking_land_but_were/",
  "subreddit": "TooAfraidToAsk",
  "id": "szjrje",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So… based on recent events of Russia and Ukraine, why do we condemn Russians\ntaking land but we’re okay with Israelis doing the same thing to the\nPalestinians?\n\nLike.. is it because they don’t have resources to be of any use? If that’s the\ncase, then Ukraine is a poor and corrupted country.\n\nOr is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "では...最近のロシアとウクライナの出来事を踏まえて、なぜロシア人を非難するのか？\nイスラエル人が同じことをするのはいいのですが、土地を奪うことは\nパレスチナ人？\n\n例えば...彼らは何の役にも立たない資源を持っていないからでしょうか？もし、そうだとしたら\nということは、ウクライナは貧しく、腐敗した国なのです。\n\nそれとも...",
      "title": "なぜ、ロシア人が土地を奪うことは非難するのに、イスラエル人がパレスチナ人に同じことをするのは平気なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "那么......基于最近俄罗斯和乌克兰的事件，为什么我们谴责俄罗斯人\n夺取土地，但我们对以色列人对巴勒斯坦人做同样的事情却无所谓？\n巴勒斯坦人？\n\n比如......是不是因为他们没有资源，没有任何用处？如果是这样的话\n那么乌克兰就是一个贫穷和腐败的国家。\n\n或者是...",
      "title": "为什么我们谴责俄罗斯人夺取土地，但我们对以色列人对巴勒斯坦人做同样的事情却无动于衷？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "那麼......基於最近俄羅斯和烏克蘭的事件，爲什麼我們譴責俄羅斯人\n奪取土地，但我們對以色列人對巴勒斯坦人做同樣的事情卻無所謂？\n巴勒斯坦人？\n\n比如......是不是因爲他們沒有資源，沒有任何用處？如果是這樣的話\n那麼烏克蘭就是一個貧窮和腐敗的國家。\n\n或者是...",
      "title": "爲什麼我們譴責俄羅斯人奪取土地，但我們對以色列人對巴勒斯坦人做同樣的事情卻無動於衷？"
    }
  ]
}