{
  "author": "callebbb",
  "the_new_excerpt": "There are so many here griping about losing money. It is absurd. You’ve been\nhere 3 months? If you’ve been here since December you’re in the green. Hell\nJanuary and most of February for most coins.\n\nI have repeatedly told people that if you wanna make money, guaranteed, to HODL\nfor 4+ years. If you…",
  "original_created_utc": 1621558104,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここでは、お金がなくなったことを嘆いている人がとても多いですね。それは馬鹿げている。あなたはここに来て\n3ヶ月ですか？12月から来ている人は黒字ですよ。地獄\nほとんどのコインは、1月と2月の大半を占めています。\n\n私は何度も人々に言ってきましたが、もしあなたが確実にお金を稼ぎたければ、4年以上HODLすることです。\n4年以上 もしあなたが...",
      "title": "3ヶ月の投資で儲かるとは言っていません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这里有这么多人在抱怨亏损。这是很荒谬的。你已经在\n3个月？如果你从12月起就在这里，你就会有收入了。地狱\n1月和2月的大部分时间，大多数硬币都是如此。\n\n我已经多次告诉人们，如果你想赚钱，保证赚钱，就得做4年以上的HODL\n4年以上。如果你...",
      "title": "我们从来没有说过3个月的投资就能赚到钱。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這裏有這麼多人在抱怨虧損。這是很荒謬的。你已經在\n3個月？如果你從12月起就在這裏，你就會有收入了。地獄\n1月和2月的大部分時間，大多數硬幣都是如此。\n\n我已經多次告訴人們，如果你想賺錢，保證賺錢，就得做4年以上的HODL\n4年以上。如果你...",
      "title": "我們從來沒有說過3個月的投資就能賺到錢。"
    }
  ],
  "title": "We never said you’d make money with a 3 month investment.",
  "created_utc": 1621625764,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There are so many here griping about losing money. It is absurd. You’ve been here 3 months? If you’ve been here since December you’re in the green. Hell January and most of February for most coins. </p>\n\n<p>I have repeatedly told people that if you wanna make money, guaranteed, to HODL for 4+ years. If you lack that sorta commitment, go elsewhere. </p>\n\n<p>For that exact reason, this space is not for rent money. Not for bill money. Definitely not diaper money, or formula money.</p>\n\n<p>These markets are for the long term. Trade the volatility at your risk. Hold the value for the reward. </p>\n\n<p>Spare change only. Anyways, stack sats n’ HODL.</p>\n</div><!-- SC_ON -->",
  "score": 220,
  "permalink": "/r/CryptoCurrency/comments/nhg2tn/we_never_said_youd_make_money_with_a_3_month/",
  "subreddit": "CryptoCurrency",
  "id": "nhg2tn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197381666
}