{
  "author": "Addmeonyelp",
  "the_new_excerpt": "I've been in the crypto space for about 4 years now and having experienced the\nthe full market cycle, I want to share some advice for those of you who may be\nnew to the space and open up a dialog for any other experienced players to share\ntheir advice as well.\n\nFor the newer folks around here, build…",
  "original_created_utc": 1613970463,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我在加密领域已经有4年左右的时间了，经历了\n全市场周期，我想分享一些建议，对于那些可能是\n并为其他有经验的玩家打开对话空间，让他们分享\n他们的建议也。\n\n对于这里的新人们，建...",
      "title": "围绕坚实的项目建立您的投资组合"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在加密領域已經有4年左右的時間了，經歷了\n全市場週期，我想分享一些建議，對於那些可能是\n併爲其他有經驗的玩家打開對話空間，讓他們分享\n他們的建議也。\n\n對於這裏的新人們，建...",
      "title": "圍繞堅實的項目建立您的投資組合"
    }
  ],
  "title": "Build Your Portfolio Around Solid Projects",
  "created_utc": 1613982923,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been in the crypto space for about 4 years now and having experienced the the full market cycle, I want to share some advice for those of you who may be new to the space and open up a dialog for any other experienced players to share their advice as well.</p>\n\n<p>For the newer folks around here, <strong>build your portfolio&#39;s foundation around projects that you believe are solving a real life problems</strong>. I&#39;m not saying you can&#39;t save some money for the potential 100x&#39;s out there, but back those moonshots up with a foundation of solid projects first.</p>\n\n<p>Here&#39;s why...When the euphoria and excitement of the bull market inevitably comes to end and we find yourself returning to the days of -50%, -75%, -95% from ATHs, you will start to lose faith in those heavy ass bags of shitcoins you&#39;ve collected. Some of those coins will die, many more will never see their ATHs again. When you watch your portfolio shrivel up like testicles in a cold swimming pool, you&#39;ll ask yourself, &quot;What went wrong?&quot; &quot;Was it something I said?&quot; &quot;Will I ever financially recover from this?&quot; You might sell for a huge loss or you may chose to hold those heavy ass bags forever. <strong>But the worst case scenario is that you cut all loses and leave the crypto space only to return to buy at the next ATH</strong>.</p>\n\n<p>Anyone who&#39;s made it through the last few years will tell you, the bear market is the best time for accumulation. You don&#39;t get a $5k Bitcoin, $80 ETH, $2 LINK, or $.0001 DOGE in the middle of bull market mania. You get those prices by researching and learning when others have cut their losses and start playing scratch offs instead. Staying focused and remaining confident in your investment decisions will ensure you&#39;re still here to pack your bags for dirt cheap and letting everyone else is jump in late to buy your $200k Bitcoin.</p>\n\n<p>So how do you stay focused and confident in your investments? By finding the real fucking projects out there.</p>\n\n<p>When things start going down, you want to look at your bags and say &quot;yeah, regardless of the current price, my coins still have a lot more intrinsic value&quot;. Maintaining that confidence and excitement in the space and in your projects will keep you involved, researching, and learning about other blockchain projects during the bear market.</p>\n\n<p>What makes a good project you ask? I don&#39;t think there&#39;s any one size fits all answer but here&#39;s some factors I look for to get you started.</p>\n\n<p>&#x200B;</p>\n\n<ol>\n<li><strong>What problem do they claim they are trying to solve?</strong> Does that problem seem like a real problem, or like a problem they invented so they can solve it? Do they actually solve the problem? This on takes a bit of intuition and common sense, trust your gut, be critical, and be impartial. Don&#39;t make it something it&#39;s not. </li>\n<li><strong>Is the token actually needed to solve that problem?</strong> Sometimes a company may be solving a real problem but the coin they created is kind of just a symbolic gesture of this and doesn&#39;t actually assist in the solution. The intrinsic value in the token is directly linked to the problem it solves. </li>\n<li><strong>Do they have a working product?</strong> I think there are plenty of projects that don&#39;t have a product now but will in the future. It doesn&#39;t mean they&#39;re less valuable, I&#39;m just saying that if a bear market comes and the dev team wallet is down 90%, are they going to stay motivated to deliver on time? That I&#39;m not sure of so I factor that risk into my investment decision.</li>\n<li><strong>Is the project still being worked?</strong> Look I get it, not every project is going to be completely fielded and working right this second. Look at the roadmap and see what they have planned. Look for their Github and see if they are actively working it. If you see that&#39;s been over 6 months since anyone has worked it, that project might be dead. Join the projects telegram and ask questions about the development. </li>\n<li><strong>Do they have meaningful partnerships?</strong> Pretty much every shitcoin out there will have at least a dozen or so partnerships. If you don&#39;t know what their &quot;partner&quot; is, look it up to see if it&#39;s really any value added. If someone says they patterned with Tesla, look it up to make sure they aren&#39;t claiming that Elon tweeting &quot;I like XYZcoin&quot; is a real partnership. </li>\n<li><strong>Tokenomics.</strong> This is a broad one so I&#39;ll break down some key areas.</li>\n</ol>\n\n<ul>\n<li><em>Total Supply:</em> How many coins will ever exist? Does that make sense to you? Does a currency project with an unlimited supply sound like a good idea to you?</li>\n<li><em>Circulating Supply:</em> How many coins are released as of today? If only 10% of coins are distributed so far, I might not be eager to invest because when the new coins are released, they could flood the market and tank the price. I don&#39;t always write off a project based on shitty circulating supply, but if the allocation method or incentives don&#39;t support it, I&#39;m out.</li>\n<li><em>Token Distribution Method &amp; Allocation</em>: How were the initial tokens distributed. Does it seem fair and trustworthy to you? How do future coins get added and over what time period?</li>\n<li><em>Token usage incentives:</em> Are there incentives for having the coin? Do you get staking reward? Many projects nowadays inject supply to current holders, stakers, liquidity providers etc. This type of incentive may justify a low circulating supply if that&#39;s how they plan to distribute the remaining tokens.</li>\n<li><em>Marketcap:</em> Not really a factor in it determining if it&#39;s a good project or not but will help you gauge growth potential. </li>\n</ul>\n\n<p><strong>Conclusion:</strong> There are dozens of projects out there doing amazing things but there are also hundreds of coins that will ultimately be worthless. If you&#39;re starting out with $50, $100, or $1000 now and you&#39;re bummed you might not be rich after this bull market ends, please try to take my advice. Having coins that are solving problems and exciting to you will keep you around during the next accumulation phase and then maybe in the next bull market you can cash out and by your lambo.</p>\n\n<p>But hey, I don&#39;t know everything. I welcome those with more experience than me to share their advice for find solid projects as well.</p>\n\n<p>&#x200B;</p>\n\n<p>Disclaimer: I chose not to namedrop coins to avoid sounding like a shill or getting up voted or down voted because I did/didn&#39;t mention your favorite coin.</p>\n</div><!-- SC_ON -->",
  "score": 978,
  "permalink": "/r/CryptoCurrency/comments/lpfq2a/build_your_portfolio_around_solid_projects/",
  "subreddit": "CryptoCurrency",
  "id": "lpfq2a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332879174
}