{
  "author": "tobbelobb69",
  "original_created_utc": 1626090639,
  "title": "How about that dip, is it cheap enough yet?",
  "created_utc": 1626108082,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I love putting numbers in spreadsheets, and so I did the numbers to try and figure out if this looks like a good timing to put some money into our favourite investment, crypto. I track 38 arbitrarily selected assets, mostly top 50 market cap coins, plus some that found their way onto the list before I checked the market cap. </p>\n\n<p>First, let us have a look at Bitcoin and Ethereum, with Binance Coin for scale. Unfortunately for you folks, I keep my prices in JPY, but you can &quot;simply&quot; divide by 110 for USD. Removing 2 digits is also close enough, this isn&#39;t financial advice after all.</p>\n\n<p>The following chart simply displays the current price, some moving averages, and then the difference between those averages and the current price.</p>\n\n<p><a href=\"https://preview.redd.it/qaas9gj03ra71.png?width=1082&amp;format=png&amp;auto=webp&amp;s=355f090fb996a454f5a8e51285cfd6efeac7dbb1\">Top 3 coins. Note that the order is alphabetic.</a></p>\n\n<p>As we can see, we have made it below 20-week moving average, a bearish sign if we believe some, but we still have some margin on the 1-year moving average, a bullish sign if we believe the very same sages. My own studies indicate that buying at or below 1-Year moving average is a relatively safe bet, so we might want to wait a little while longer before we go all in. Although, Bitcoin is close, just saying.</p>\n\n<p>Next up, which coins are already below that magical 1-year average barrier?</p>\n\n<p><a href=\"https://preview.redd.it/qf3q7hmq7ra71.png?width=786&amp;format=png&amp;auto=webp&amp;s=de3ec1266a1ac660a97af59c03032aca7e5ecd62\">Bottom 10 coins, ordered by difference to 1-year moving average</a></p>\n\n<p>If you really believe in some of the coins above, now might not be the worst time to buy some more. On the other hand, which coins are still far from cheap?</p>\n\n<p><a href=\"https://preview.redd.it/tiqb2q4y8ra71.png?width=788&amp;format=png&amp;auto=webp&amp;s=08536c753d64a64e03fd910d50938fe93056bc66\">Top 10 coins, ordered by difference to 1-year moving average</a></p>\n\n<p>If you are contemplating buying some of the coins above, you might want to wait for bigger discounts. Next, let us expand our scope all the way to 4 years. The only problem here is that many of these coins did not exist 4 years ago. In that case, we simply get the longest moving average we can. </p>\n\n<p><a href=\"https://preview.redd.it/14v912w3fra71.png?width=787&amp;format=png&amp;auto=webp&amp;s=0684ae3a7b45fe6c01fbea3fdd4c727c4d364f65\">Bottom 10 coins, ordered by difference to 4-year moving average</a></p>\n\n<p>Then on the plus side:</p>\n\n<p><a href=\"https://preview.redd.it/gihwc0tzfra71.png?width=787&amp;format=png&amp;auto=webp&amp;s=8dff77dc1fb89b1394ab58ce97650206487eff40\">Top 10 coins, ordered by difference to 4-year moving average</a></p>\n\n<p>Finally, we are going back to the almost present, let us have a look at which coins are having the roughest Monday compared to how they did last week:</p>\n\n<p><a href=\"https://preview.redd.it/irehhrgkgra71.png?width=787&amp;format=png&amp;auto=webp&amp;s=78190dca9373f573d8f4b2c29e3cfabc5c0f3dab\">Bottom 10 coins, ordered by difference to 1-week moving average</a></p>\n\n<p>That&#39;s all for today folks, if this gains any traction I might do it again next week. Were you expecting some sort of conclusion here at the end? Well, I already told you I just like to put numbers in spreadsheets. Have a nice week all.</p>\n</div><!-- SC_ON -->",
  "score": 198,
  "permalink": "/r/CryptoCurrency/comments/oipntp/how_about_that_dip_is_it_cheap_enough_yet/",
  "subreddit": "CryptoCurrency",
  "id": "oipntp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I love putting numbers in spreadsheets, and so I did the numbers to try and\nfigure out if this looks like a good timing to put some money into our favourite\ninvestment, crypto. I track 38 arbitrarily selected assets, mostly top 50 market\ncap coins, plus some that found their way onto the list before…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は表計算ソフトに数字を入力するのが好きなので、今回は数字を入力して\n私たちのお気に入りの投資先に資金を投入するには、このタイミングが良いのではないかと考えました。\n私たちのお気に入りの投資対象である暗号に資金を投入するのに適したタイミングかどうかを考えてみました。私は任意に選んだ38の資産を追跡していますが、そのほとんどが時価総額トップ50のコインです。\nそのほとんどが時価総額上位50位までのコインで、それに加えて以前からリストに載っていたものもあります。",
      "title": "あのディップはどうだ！まだ安いのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我喜欢把数字放在电子表格里，所以我做了一些数字来尝试和\n所以我计算了一下，看看现在是否是一个很好的时机，把一些钱投入到我们最喜欢的\n的投资，加密货币。我跟踪了38个任意选择的资产，主要是市场上排名前50的\n币，再加上一些之前被列入名单的币......",
      "title": "那个蘸酱怎么样，够便宜吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我喜歡把數字放在電子表格裏，所以我做了一些數字來嘗試和\n所以我計算了一下，看看現在是否是一個很好的時機，把一些錢投入到我們最喜歡的\n的投資，加密貨幣。我跟蹤了38個任意選擇的資產，主要是市場上排名前50的\n幣，再加上一些之前被列入名單的幣......",
      "title": "那個蘸醬怎麼樣，夠便宜嗎？"
    }
  ]
}