{
  "author": "haleykohr",
  "the_new_excerpt": "As we all know, the most likely outcome has happened where regulators and\nboomers are now targeting anybody who looks like a convenient target.\n\nDeepfuckingvalue, who was unfortunately outed, is increasingly looking like that\nperson.\n\nHe is now in more danger than any of us. I doubt that anything…",
  "original_created_utc": 1612426957,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "众所周知，最可能发生的结果是，监管机构和。\n潮人现在的目标是任何看起来像一个方便的目标的人。\n\n不幸被揭发的Deepfuckingvalue，越来越像这样了\n的人。\n\n他现在比我们任何人都危险。我怀疑...",
      "title": "上。严肃指出：从现在开始，尊重deepfuckingvalue的决定。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "衆所周知，最可能發生的結果是，監管機構和。\n潮人現在的目標是任何看起來像一個方便的目標的人。\n\n不幸被揭發的Deepfuckingvalue，越來越像這樣了\n的人。\n\n他現在比我們任何人都危險。我懷疑...",
      "title": "上。嚴肅指出：從現在開始，尊重deepfuckingvalue的決定。"
    }
  ],
  "title": "On. Serious note: respect the decisions of deepfuckingvalue from here on out",
  "created_utc": 1612448563,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As we all know, the most likely outcome has happened where regulators and boomers are now targeting anybody who looks like a convenient target. </p>\n\n<p>Deepfuckingvalue, who was unfortunately outed, is increasingly looking like that person. </p>\n\n<p>He is now in more danger than any of us. I doubt that anything will acruallly come of this, but now real heat is coming out, as tends to when traditional power dynamics are upset. </p>\n\n<p>Not to mention; despite the fact that he was acting as a private individual and not actually acting in an official or financial position, the optics are being set up against him. </p>\n\n<p>Do not attack him if he decides to withdraw all today. He has his own life and family to protect. He’s also much more vulnerable than anyone here, and he doesn’t have the polemical connections like citadel does. Not to mention he just screams boomer bait. </p>\n\n<p>I suspect he’s feeling pressured into not selling because of the cult status he has here. But his own personal life comes first. Chances are, he may never be able to work in an official financial position again. </p>\n\n<p>I’m not crying for his financial future or anything, he’s worth 8 figures. But again, he needs that money given his position. For the rest of his life he will be a political prop. Please respect his decisions and most importantly realize he’s a fucking human being with his own life</p>\n\n<p>Edit: still holding I bought @30 in at $300 lol</p>\n</div><!-- SC_ON -->",
  "score": 44537,
  "permalink": "/r/wallstreetbets/comments/lcb614/on_serious_note_respect_the_decisions_of/",
  "subreddit": "wallstreetbets",
  "id": "lcb614",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123206819
}