{
  "author": "Fantastic-Cucumber-1",
  "the_new_excerpt": "Compared to the traditional stock market, the crypto market is extremely\nvolatile. At the time of writing, we are in a bull run. During bull runs, profit\ncan easily be made: You invest (in a coin you researched thoroughly) and wait\nfor your profit to grow. But what if the bull run turns into a bear…",
  "original_created_utc": 1619425757,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "伝統的な株式市場に比べて、暗号市場は非常に不安定です。\n揮発性があります。本稿執筆時点では、強気の動きをしています。ブルラン中は、利益\nを簡単に得ることができます。徹底的に調査したコインに）投資して、利益が増えるのを待ちます。\n利益が伸びるのを待ちます。しかし、もし強気の相場が弱気の相場に変わったら......。",
      "title": "DeFiの説明。ステーブルコイン"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "与传统的股票市场相比，加密货币市场是极其\n挥发性。在写这篇文章的时候，我们正处于牛市。在牛市运行期间，利润\n可以很容易赚到。你投资（投资于你彻底研究过的硬币），然后等待\n等待你的利润增长。但是，如果牛市运行变成了熊市......",
      "title": "DeFi的解释。稳定币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "與傳統的股票市場相比，加密貨幣市場是極其\n揮發性。在寫這篇文章的時候，我們正處於牛市。在牛市運行期間，利潤\n可以很容易賺到。你投資（投資於你徹底研究過的硬幣），然後等待\n等待你的利潤增長。但是，如果牛市運行變成了熊市......",
      "title": "DeFi的解釋。穩定幣"
    }
  ],
  "title": "DeFi Explained: Stablecoins",
  "created_utc": 1619451033,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Compared to the traditional stock market, the crypto market is extremely volatile. At the time of writing, we are in a bull run. During bull runs, profit can easily be made: You invest (in a coin you researched thoroughly) and wait for your profit to grow. But what if the bull run turns into a bear market? In what assets should you invest? This is where stablecoins come into play.</p>\n\n<h1>Why stablecoins exist</h1>\n\n<p>Stablecoins have different functions. We will discuss two of them below.</p>\n\n<h2>Hedging against the volatility of the price of crypto coins</h2>\n\n<p>One of the main arguments against cryptocurrencies is that the price is too volatile. investors who are against crypto believe that crypto coins can therefore not be used in daily life.</p>\n\n<p>Fortunately, stablecoins are here to counter that argument. Stablecoins can ensure that cryptocurrencies are accepted more quickly. It makes financial aspects like borrowing, saving and salary easier in the short term, at least that&#39;s the promise.</p>\n\n<h2>Hedging against price falls</h2>\n\n<p>Stablecoins are mainly used on cryptocurrency exchanges. It can be a way to hedge against exchange rate fluctuations. It works like this:</p>\n\n<p>Suppose the price of bitcoin is currently six thousand dollar. You expect the price to fall. At that time you can choose to exchange bitcoin for a stablecoin such as Tether. Will the exchange rate drop to five thousand dollar? Then you still have six thousand dollar in digital currency. If you expect bitcoin to rise again, you can then exchange the stablecoin for bitcoin again.</p>\n\n<h1>Types of stablecoins</h1>\n\n<p>There are many different types of stablecoins available to investors. below we discuss the most well-known stablecoins.</p>\n\n<h2>Tether</h2>\n\n<p>The first Tether tokens were released on October 6, 2014 as a layer to the bitcoin blockchain. Back then under the name RealCoin.</p>\n\n<p>Tether is a cryptocurrency that reflects the value of the US dollar. The idea was to create a stable cryptocurrency that could be used as a digital dollar. With Tether investors can benefit from the advantages of blockchain technology, without the high price fluctuations that often prevent people from using, for example, bitcoin as a means of payment.</p>\n\n<p>Many exchanges offer USDT as a trading pair, allowing investors to buy many different cryptocurrencies directly with a currency that reflects the United States dollar (USD). Tether is often used as a kind of refuge for when things are going a bit less with, for example, the bitcoin or when the price fluctuations are once again gigantic.</p>\n\n<p>However, it should be emphasized that Tether is a centralized crypto coin. Although it works on the blockchain, not everyone can access the ledger. This means that investors cannot easily verify whether everything is going as promised. Instead, everyone is asked to have faith in the company behind the coin. This is quite ironic, because the whole idea of ​​cryptocurrency was born precisely to solve the problem of centralization and trust.</p>\n\n<p>Many skeptics doubt whether Tether LTD actually has the same amount of dollars in their account as the amount tether coins that are in circulation. This doubt may have arisen due to a lack of transparency in tether. While the tether blockchain is public, Tether LTD&#39;s bank account is not.</p>\n\n<p>Tether has announced that indeed they do not only have dollars in the bank account. They say they also use bitcoin and ether as collateral.</p>\n\n<p>That doubt led to a disturbance in the force on October 15, 2018. The once so stable tether faltered because the price fell rapidly. The tether price dropped to 85 cents in a few hours and then recovered to a somewhat common price of 97 cents.</p>\n\n<h2>USDC</h2>\n\n<p>USDC, or USD Coin, is a stable coin. As the name might suggest, the digital currency is pegged to the US Dollar. One USDC is worth one dollar and vice versa. The currency is still very new: it can only be traded since the beginning of October 2018.</p>\n\n<p>When news came out that this new coin, a collaboration between Center (a crypto platform backed by Goldman Sachs, one of the largest US investment banks) and Coinbase, was available, the price rose equally significantly. On October 15, 2018, 1 USDC price was $ 1.11. The exchange rate has now stabilized again and has fluctuated around the dollar limit.</p>\n\n<p>The USDC is fully backed by Dollars. That means that for every USDC in circulation, there is a physical dollar in stock at Circle (the company behind USD Coin). This reserve is reported regularly and transparently.</p>\n\n<h2>TUSD</h2>\n\n<p>A relatively new digital currency is TUSD (TrueUSD). Simply put, this is the transparent version of USDT, at least according to the developers.</p>\n\n<p>1 TrueUSD equals 1 US dollar in this case too. However, unlike Tether (USDT), TrueUSD (TUSD) is less centralized. The platform behind the coin (the TrustToken asset tokenization platform) spreads the dollars to cover the amount of TUSD in circulation across multiple trust companies that have signed escrow agreements. Moreover, TUSD is more transparent by showing what is happening and where by means of statements. Each bill shows what is on the table, leaving no doubt about how much dollar is present.</p>\n\n<h2>DAI</h2>\n\n<p>MakerDAO (MKR), the platform behind USD stablecoind DAI, uses the Ethereum blockchain, allowing the Dai stablecoin to be fully inspected by anyone and eliminating the need for a central organization to verify transactions. Dai is therefore also seen as a decentralized alternative to the centralized Tether.</p>\n\n<p>MKR is a cryptocurrency that is built on the Ethereum blockchain. Its purpose is to stabilize the value of DAI through smart contracts called Collateralized Debt Positions (CDP). When the smart contract life ends, the MKR token is gone. MKR can be sent and received through any Ethereum account or smart contract programmed to use the MKR transfer function. It is more stable than most currencies in the market because of the way it is valued.</p>\n\n<p>Dai is pegged to the US dollar, which means that 1 DAI = US $1. The currency is managed autonomously through smart contracts that adapt and respond to market dynamics, ensuring that the currency is tied to the USD. In this way, it provides traders with stability regardless of the market condition.</p>\n\n<p>The Dai coins are therefore stable and linked to the USD. On the other hand, the MKR token is free to move in price and increases in value in accordance with an increase in usage. You can use MKR to pay for the costs incurred on CDPs that generate Dai in the Maker system, and as the demand for Dai and CDPs increases, so should the demand for MKR. In addition, when stability costs are paid with MKR, the issued MKR is permanently destroyed. This decreases the overall MKR supply, increasing its value.</p>\n\n<h2>PAXG</h2>\n\n<p>Pax Gold is the first digital asset to be backed by physical gold bars. PAX Gold is a Paxos Standard Token from the Paxos Trust Company in America.</p>\n\n<p>The design is based on the ERC-20 token protocol of the Ethereum platform. This gold-backed token combines all the benefits of a crypto asset and gold on account without any storage fees. In fact, PAX Gold resolves a contradiction in the gold market: being able to own physical and share and trade gold with ease.</p>\n\n<p>PAX Gold tokens represent 1/400 part of a numbered gold bar. It is a 400 oz tokenized gold bar certified by the LBMA (certified London Good Delivery bars). Vault storage and security is provided by Brink&#39;s in London. PAX Gold can be traded instantly and cheaply 24 × 7 on the Ethereum blockchain. It is also divisible to 18 decimal places making it accessible to everyone.</p>\n\n<h1>Finals words</h1>\n\n<p>Stablecoins offer an excellent opportunity to hedge against volatile or bear markets. It is up to the investors to choose which stablecoin they want to invest in. One thing is sure: the crypto market offers plenty of choice.</p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>Do you now the difference between Proof of Work and Proof of Stake? <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/mw05p6/defi_explained_blockchain_consensus/\">Read it here</a>.</li>\n</ul>\n\n<p>EDIT: Typos</p>\n</div><!-- SC_ON -->",
  "score": 314,
  "permalink": "/r/CryptoCurrency/comments/mysxvz/defi_explained_stablecoins/",
  "subreddit": "CryptoCurrency",
  "id": "mysxvz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776210466
}