{
  "author": "lightband101",
  "the_new_excerpt": "This community has been helpful for providing analysis, advice, and a TON of\nhelpful resources, that being said however I've noticed some toxicity in the\nsub-reddit as well. Everyone seems to think that they are all gurus in trading,\nand they have the \"right\" answer. But, the reality is that there…",
  "original_created_utc": 1614916762,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这个社区一直在提供分析、建议和大量的帮助。\n有益的资源，话虽如此，但我已经注意到了一些有毒的地方。\n子reddit以及。大家似乎都认为他们都是交易方面的大师。\n而且他们有 \"正确 \"的答案。但是，现实是，有... ...",
      "title": "有点抛砖引玉的意思，但只是一个公益广告，请记住，不是每个人的交易方式都一样。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個社區一直在提供分析、建議和大量的幫助。\n有益的資源，話雖如此，但我已經注意到了一些有毒的地方。\n子reddit以及。大家似乎都認爲他們都是交易方面的大師。\n而且他們有 \"正確 \"的答案。但是，現實是，有... ...",
      "title": "有點拋磚引玉的意思，但只是一個公益廣告，請記住，不是每個人的交易方式都一樣。"
    }
  ],
  "title": "Somewhat of a throw-away post, but just a PSA, please remember that not everyone trades the same way.",
  "created_utc": 1614950661,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This community has been helpful for providing analysis, advice, and a TON of helpful resources, that being said however I&#39;ve noticed some toxicity in the sub-reddit as well. Everyone seems to think that they are all gurus in trading, and they have the &quot;right&quot; answer. But, the reality is that there are over 1mil+ different ways to trade and be successful. It varies greatly depending on how &quot;active&quot; you are in your portfolio. Some people are in there 50 times per day, others maybe 1-2 times per month. What works for one person might not work for another, and so on.</p>\n\n<p>Just because someone has an annual target over 10% doesn&#39;t mean they&#39;re crazy. Maybe they are in the group that checks their portfolio 50 times per day, and they flip stocks rapidly in the short-term for compounded gains. You think Wall Street day-job traders would accept only a 10% gain per year? lol... Just because someone only invests in blue-chips and not micro-cap stocks &quot;going to the moon!&quot; doesn&#39;t mean they don&#39;t like money. Maybe they just prefer less risk.</p>\n\n<p>In short, it&#39;s important to remember that people all are doing very different strategies. There is no single correct answer. Perhaps before assuming anything, people should ask/clarify their approaches first. I normally try to provide my specifics at least in the body of the original post, however I still find that many people skip that part, or just don&#39;t agree with it, and then proceed to name-calling, ridiculing, and everything besides actually offering clarity or advice.</p>\n\n<p>We&#39;re a great community here, and I appreciate all of you! But please, whenever possible let&#39;s work to ask questions and ask for clarity instead of assuming things and being un-helpful.</p>\n\n<p>Happy trading!!!! (and plz stay positive because we all know the last 3 weeks haven&#39;t been fun, but they will turn around soon, haha!)</p>\n</div><!-- SC_ON -->",
  "score": 57,
  "permalink": "/r/stocks/comments/ly3gmn/somewhat_of_a_throwaway_post_but_just_a_psa/",
  "subreddit": "stocks",
  "id": "ly3gmn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542576942
}