{
  "author": "GanonR",
  "the_new_excerpt": "There are horrible things going on in the world varying from concentration camps\nin China, genocides, wars, long-standing occupations (eg Cyprus).\n\nA pragmatic or stoic approach might advise that if you can’t undo an injustice\nor put a stop to peoples suffering theres no point caring about it/…",
  "original_created_utc": 1613738047,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "世界上有很多可怕的事情发生，从集中营到... ...\n在中国，种族灭绝、战争、长期占领（如塞浦路斯）。\n\n一个务实或沉稳的方法可能会建议，如果你不能挽回不公正的现象\n或者停止人们的痛苦，没有必要关心它/......。",
      "title": "如果你不能改变世界上可怕的不公平现象，就会感到幸福，而不去关心它们，这是道德吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "世界上有很多可怕的事情發生，從集中營到... ...\n在中國，種族滅絕、戰爭、長期佔領（如塞浦路斯）。\n\n一個務實或沉穩的方法可能會建議，如果你不能挽回不公正的現象\n或者停止人們的痛苦，沒有必要關心它/......。",
      "title": "如果你不能改變世界上可怕的不公平現象，就會感到幸福，而不去關心它們，這是道德嗎？"
    }
  ],
  "title": "Is it ethical to feel happy and not to care about horrible injustices in the world if you can’t change them?",
  "created_utc": 1613771902,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There are horrible things going on in the world varying from concentration camps in China, genocides, wars, long-standing occupations (eg Cyprus). </p>\n\n<p>A pragmatic or stoic approach might advise that if you can’t undo an injustice or put a stop to peoples suffering theres no point caring about it/ allowing it to bother you  and you should just go about living a happy life as if it wasn’t happening.</p>\n\n<p>However, doing so with  full knowledge that\n        ○ Victims are suffering\n        ○ Perpetrators are getting away with it\n      seems somehow selfish and unethical. </p>\n\n<p>Can you really have a party if you know you neighbour is beating his wife and kids? (Assuming you can’t stop him/intervene).</p>\n\n<p>Note: I anticipate that people will try convince me that “you can change things”. I am not denying that you can change some things, but there are also things I think you cannot. For the purposes of this discussion please pressupose that you cannot effect the injustice.</p>\n\n<p>Edit: There will be things you cannot change and things you can. Even among the many things you can change, you have to  pick a small selection to focus on- rendering the others, in practical terms, beyond your control. </p>\n\n<p>Thanks for your help!</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/askphilosophy/comments/lnetbl/is_it_ethical_to_feel_happy_and_not_to_care_about/",
  "subreddit": "askphilosophy",
  "id": "lnetbl",
  "is_self": true,
  "media": null,
  "is_video": false
}