{
  "author": "neocamel",
  "original_created_utc": 1626120408,
  "title": "Change my mind: Mining profits shouldn't be taxed until they are converted into a fiat currency.",
  "created_utc": 1626129097,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been thinking about what my ethical opinion is regarding mining profits and taxation, particularly in the USA.</p>\n\n<p>My understanding is that the current tax law requires you to pay income tax on any crypto you earn via mining, at the current exchange rate at the time of earning the crypto. I kind of think that&#39;s bullshit.</p>\n\n<p>If you grow a carrot in your backyard, the IRS doesn&#39;t make you pay tax on that carrot based on the current market value of a carrot. It&#39;s not until you take that carrot to the farmer&#39;s market and sell it, (thus, converting it into US currency), that you have earned taxable income. </p>\n\n<p>If I use my own &#39;backyard&#39; (ie, the computer hardware), and pay for the &#39;water&#39; (electricity) to grow the carrot (mining rewards), then just hang on to the carrot, why am I being taxed on the carrot? When have I participated in the US economy besides buying the computer equipment (that I paid sales tax on), and paying for my electricity bill?</p>\n\n<p>When you buy a stock, if the price goes up, you don&#39;t pay capital gains tax on the current value of the stock at any given moment. You pay capital gains tax <em>after you sell the stock</em>. You haven&#39;t actually &#39;made money&#39; until you&#39;ve converted that stock <em>back into money.</em></p>\n\n<p>This seems really obvious to me, but I might be missing some of the finer points. For example, crypto is in fact a currency, and not a stock, but at least in my &#39;mine and hold&#39; strategy, I&#39;m certainly treating it as a stock.</p>\n</div><!-- SC_ON -->",
  "score": 201,
  "permalink": "/r/CryptoCurrency/comments/oiz8qw/change_my_mind_mining_profits_shouldnt_be_taxed/",
  "subreddit": "CryptoCurrency",
  "id": "oiz8qw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've been thinking about what my ethical opinion is regarding mining profits and\ntaxation, particularly in the USA.\n\nMy understanding is that the current tax law requires you to pay income tax on\nany crypto you earn via mining, at the current exchange rate at the time of\nearning the crypto. I kind…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、鉱山の利益と税金に関して、自分の倫理観がどうなのかを考えてきました。\n特にアメリカでは。\n\n私の理解では、現在の税法では以下のものに所得税を支払わなければなりません。\n現在の税法では、マイニングで得たクリプトに対して、そのクリプトを得た時点の為替レートで\n所得税を支払う必要があります。私の場合は...",
      "title": "気持ちを切り替える。採掘で得た利益は、不換紙幣に変換されるまで課税されるべきではない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直在思考我对采矿业利润的道德观点是什么，以及我如何看待这个问题。\n税收的问题，特别是在美国。\n\n我的理解是，目前的税法要求你对你通过挖矿获得的任何加密货币支付所得税。\n你通过挖矿赚取的任何加密货币，按赚取加密货币时的现行汇率缴纳所得税。\n赚取的加密货币。我有点...",
      "title": "改变我的想法。采矿业的利润不应该被征税，直到它们被转化为法定货币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直在思考我對採礦業利潤的道德觀點是什麼，以及我如何看待這個問題。\n稅收的問題，特別是在美國。\n\n我的理解是，目前的稅法要求你對你通過挖礦獲得的任何加密貨幣支付所得稅。\n你通過挖礦賺取的任何加密貨幣，按賺取加密貨幣時的現行匯率繳納所得稅。\n賺取的加密貨幣。我有點...",
      "title": "改變我的想法。採礦業的利潤不應該被徵稅，直到它們被轉化爲法定貨幣。"
    }
  ]
}