{
  "author": "Chowdergrrl",
  "original_created_utc": 1646127183,
  "title": "Is it okay to just be a lame/boring mom who doesn't really do anything cool in her life?",
  "created_utc": 1646141259,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I read a lot of books and watch a lot of movies. I am blown away to realize the impact one human can have. Favorite authors and actors have created things that save me from dark depression. That I watch/read over and over .&lt;/p&gt;\n\n&lt;p&gt;Yet, I will never do that. I am not looking for bullshit reassurance that I could some day achieve fame or touch the lives of strangers. I am not interested in any of that.&lt;/p&gt;\n\n&lt;p&gt;I want to know if it is okay to just work an average job, not be too pretty, and end up in a casual relationship with a pretty great friend and have a kid together, without getting married. Like should I be doing more/better at 26? I love my kiddo. Sometimes I just feel that I should be a more amazing person for my kiddo and my partner.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 115,
  "permalink": "/r/TooAfraidToAsk/comments/t444uf/is_it_okay_to_just_be_a_lameboring_mom_who_doesnt/",
  "subreddit": "TooAfraidToAsk",
  "id": "t444uf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I read a lot of books and watch a lot of movies. I am blown away to realize the\nimpact one human can have. Favorite authors and actors have created things that\nsave me from dark depression. That I watch/read over and over .\n\nYet, I will never do that. I am not looking for bullshit reassurance that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はたくさんの本を読み、たくさんの映画を見ます。その結果\n一人の人間が与える影響力。好きな作家や俳優が作ったものには\n暗い憂鬱から私を救ってくれる。何度も何度も見たり読んだりしているもの。\n\nでも、私は絶対にそんなことはしない。というデタラメな安心感を求めているわけではありません。",
      "title": "ただダサい、つまらない母親で、かっこいいことを何もしない人生でいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我读了很多书，看了很多电影。我很震惊地意识到\n一个人可以产生的影响。我喜欢的作家和演员创造的东西\n把我从黑暗的抑郁中拯救出来。我一遍又一遍地看/读这些东西。\n\n然而，我永远不会这样做。我不是在寻找狗屁保证，...",
      "title": "只做一个蹩脚/无聊的妈妈，在生活中不做任何很酷的事情，这样可以吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我讀了很多書，看了很多電影。我很震驚地意識到\n一個人可以產生的影響。我喜歡的作家和演員創造的東西\n把我從黑暗的抑鬱中拯救出來。我一遍又一遍地看/讀這些東西。\n\n然而，我永遠不會這樣做。我不是在尋找狗屁保證，...",
      "title": "只做一個蹩腳/無聊的媽媽，在生活中不做任何很酷的事情，這樣可以嗎？"
    }
  ]
}