{
  "author": "gochugrande",
  "the_new_excerpt": "Sorry if you’re tired of seeing BB on your feed, but this is definitely worth\nreading.\n\nAs u/Fairytalezz [/u/Fairytalezz] mentioned: Today 2/9/2021 BB announced its QNX\nBlack channel Communications Technology\n[https://blackberry.qnx.com/en/software-solutions/embedded-software/black-channel]\nwill be…",
  "original_created_utc": 1612899758,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "对不起，如果你厌倦了看到BB在你的饲料，但这是绝对值得的\n读。\n\n正如u/Fairytalezz[/u/Fairytalezz]提到的那样。今天2021年9月2日BB公司宣布其QNX\n黑道通信技术\n[https://blackberry.qnx.com/en/software-solutions/embedded-software/black-channel]\n会是...",
      "title": "黑莓(BB)通过Motional获得了另一个增长催化剂。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對不起，如果你厭倦了看到BB在你的飼料，但這是絕對值得的\n讀。\n\n正如u/Fairytalezz[/u/Fairytalezz]提到的那樣。今天2021年9月2日BB公司宣佈其QNX\n黑道通信技術\n[https://blackberry.qnx.com/en/software-solutions/embedded-software/black-channel]\n會是...",
      "title": "黑莓(BB)通過Motional獲得了另一個增長催化劑。"
    }
  ],
  "title": "Blackberry (BB) secured another catalyst for growth with Motional.",
  "created_utc": 1612905674,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Sorry if you’re tired of seeing BB on your feed, but this is definitely worth reading.</p>\n\n<p>As <a href=\"/u/Fairytalezz\">u/Fairytalezz</a> mentioned: Today 2/9/2021 BB announced its <a href=\"https://blackberry.qnx.com/en/software-solutions/embedded-software/black-channel\">QNX Black channel Communications Technology</a> will be used in <a href=\"https://www.prnewswire.com/news-releases/introducing-motional-the-hyundai-motor-group-and-aptiv-autonomous-driving-joint-venture-unveils-new-identity-301109904.html\">Motional’s</a> next generation driverless vehicles. </p>\n\n<p>Motional is backed by Hyundai, and coincidentally Hyundai just announced they will NOT be partnering with Apple for a self driving car. Could it be because they got meaningful progress on their own assets and don’t need Apple? Yes, this is just my speculation, but it’s big fucking news for BB.</p>\n\n<p><a href=\"https://finance.yahoo.com/news/blackberrys-qnx-black-channel-communications-130000898.html\">https://finance.yahoo.com/news/blackberrys-qnx-black-channel-communications-130000898.html</a></p>\n\n<p><a href=\"https://www.automotiveworld.com/news-releases/blackberrys-qnx-black-channel-communications-to-be-used-in-motionals-driverless-platform/\">https://www.automotiveworld.com/news-releases/blackberrys-qnx-black-channel-communications-to-be-used-in-motionals-driverless-platform/</a></p>\n\n<p>The technology enables Motional to provide safe data communication exchange within the vehicles safety system. Motional is expected to roll out self driving cars by 2023.</p>\n\n<p>Here is another <a href=\"https://techspective.net/2021/02/01/qualcomm-google-and-blackberry-the-companies-revolutionizing-the-automobile/\">article</a> that highlights why BB could be picked up by other EV plays. The highlight being:</p>\n\n<p>“Blackberry has the most secure high-volume operating system on the planet, with QNX, which is being used on car operations... The Blackberry-Google part of this effort is rather interesting because while each potentially plays on both the control and the car’s entertainment side, they are best when working together. QNX leads with security and experience with embedded systems. Still, it doesn’t have much in terms of app support, which is a plus when you talk about the systems that drive, control, and stop the car, but a minus if you are talking about cockpit entertainment. Google’s Android platform has a ton of apps and developer support, making it less secure and more likely to get hacked, tolerable for the entertainment systems in a car but unacceptable for anything to do with car safety. Working in tandem, Working together, Blackberry secures the result, ensuring the car is reliable and safe.\n——</p>\n\n<p>BB timeline in the past 3 months: Partners with Amazon. Partners with Baidu (The Chinese Google). Partners with Motional (EV). Don’t be deterred by the fluctuation due to the panic selling from the meme stock halt, this is fucking taking off again and this time it will stick without the bullshit.</p>\n\n<p>TLDR: Always do what you feel is right for yourself and only invest within your means/ risk tolerance because I am not a financial advisor. My bias opinion is pick up some BB before you miss the fucking rocket. CEO Chen even <a href=\"https://twitter.com/JohnChen/status/1358853064153784321?s=20\">tweeted</a> out some hints of the events to come.</p>\n\n<p>Keep in mind that it has multiple sources giving BB a target price of $25-$30 that were given BEFORE the partnership with Motional. Recently Zack’s upgraded stock to a “#2 Strong buy” with a target of 29.00, and Motley also ranked it a #1 buy with a target price of 30.00. <a href=\"https://www.google.com/amp/s/ca.finance.yahoo.com/amphtml/news/blackberry-tsx-bb-stock-keep-143027800.html\">Yahoo Finance</a> also looking bullish. Here is also the new CEO of Amazon’s <a href=\"https://mobile.twitter.com/ajassy/status/1334191176883191808?lang=en\">thoughts</a> as well. </p>\n\n<p>Overall BB is currently up 73% just this past month and 170% the past 3 months. This is even after surviving the storm GME brought.</p>\n\n<p>Positions: 3000 shares avg 13.17, 5 3/19 <a href=\"mailto:15c@1.67\">15c@1.67</a>, 10 3/19 <a href=\"mailto:23c@.59\">23c@.59</a>, 10c <a href=\"mailto:25c@.51\">25c@.51</a></p>\n</div><!-- SC_ON -->",
  "score": 656,
  "permalink": "/r/stocks/comments/lgbknd/blackberry_bb_secured_another_catalyst_for_growth/",
  "subreddit": "stocks",
  "id": "lgbknd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123204948
}