{
  "author": "Lenon2012",
  "original_created_utc": 1647720579,
  "title": "How is it that wrongly accusing some people of rape can ruin their lives, while other people can be accused and proven to have raped someone and still go on with their lives like nothing happened?",
  "created_utc": 1647739463,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;When it comes to accusations of rape or sexual harassment, I hear the victims are hesitant to come out due to fear of not being believed and being gaslighted or worse when they do come out, the perpetrator never faces any consequences (Brock turner come to mind, and that just the most famous one) to the point that it&amp;#39;s a wide spread phenomena among rape victims that even the Me too movement hasn&amp;#39;t fully solved. But then when  t comes to False claims of rape and sexual assault, I constantly hear how it&amp;#39;s as worse as being a rapists, that it can completely ruin the life of the accused even when it was discovered that the claims were false. It&amp;#39;s kind of confusing to me because both sides seem to contradict each other. I don&amp;#39;t know anyone who has ever been raped or sexually assaulted so I don&amp;#39;t know.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/TooAfraidToAsk/comments/ti3ny0/how_is_it_that_wrongly_accusing_some_people_of/",
  "subreddit": "TooAfraidToAsk",
  "id": "ti3ny0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "When it comes to accusations of rape or sexual harassment, I hear the victims\nare hesitant to come out due to fear of not being believed and being gaslighted\nor worse when they do come out, the perpetrator never faces any consequences\n(Brock turner come to mind, and that just the most famous one)…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "レイプやセクハラの告発になると、被害者の声を聞くことができます。\n信されないことやガス燈のように照らされることを恐れて、表に出るのをためらうのです。\nまた、加害者は何の罰も受けない。\n(ブロック・ターナーが思い浮かびますが、これは最も有名なものです）...。",
      "title": "ある人がレイプで間違って訴えられ、その人の人生を台無しにしてしまう一方で、他の人がレイプで訴えられ証明されても、何事もなかったかのように生活を続けられるのはどうしてでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当涉及到强奸或性骚扰的指控时，我听到受害者\n由于担心不被相信和被气死而犹豫不决。\n或者更糟糕的是，当他们出来时，犯罪者从未面临任何后果。\n(我想起了布洛克-特纳，这只是最有名的一个）......",
      "title": "为什么错误地指控一些人强奸会毁掉他们的生活，而另一些人被指控并被证明强奸了某人，却仍然像什么都没发生一样继续生活？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當涉及到強姦或性騷擾的指控時，我聽到受害者\n由於擔心不被相信和被氣死而猶豫不決。\n或者更糟糕的是，當他們出來時，犯罪者從未面臨任何後果。\n(我想起了布洛克-特納，這只是最有名的一個）......",
      "title": "爲什麼錯誤地指控一些人強姦會毀掉他們的生活，而另一些人被指控並被證明強姦了某人，卻仍然像什麼都沒發生一樣繼續生活？"
    }
  ]
}