{
  "author": "waughandy",
  "the_new_excerpt": "Since there is more and more cryptocurrencies and more and more big figures that\ntry to influence the market, I wanted to share what I think is the real\nimportance behind the cryptocurrencies :\n\n\"The root problem with conventional currency is all the trust that's required to\nmake it work. The…",
  "original_created_utc": 1623076197,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号通貨の数が増え、市場に影響を与えようとする大物が増えているので\n市場に影響を与えようとする大物が増えてきたので、私が思う本当の意味での暗号通貨の重要性をお伝えしたいと思います。\n暗号通貨の背後にある本当の重要性をお伝えしたいと思います。\n\n\"従来の通貨の根本的な問題は、それを機能させるために必要とされるすべての信頼です。\n従来の通貨の根本的な問題は、通貨を機能させるために必要なすべての信頼です。その...",
      "title": "サトシ・ナカモトのTHE名言"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "由于有越来越多的加密货币和越来越多的大人物试图影响市场，我想与大家分享我认为的真实情况。\n试图影响市场，我想分享一下我认为真正的\n我想与大家分享我认为加密货币背后的真正重要性。\n\n\"传统货币的根本问题是需要所有的信任来使其运作。\n使其发挥作用。我想和大家分享一下我认为加密货币背后真正的重要性。",
      "title": "中本聪的名言"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "由於有越來越多的加密貨幣和越來越多的大人物試圖影響市場，我想與大家分享我認爲的真實情況。\n試圖影響市場，我想分享一下我認爲真正的\n我想與大家分享我認爲加密貨幣背後的真正重要性。\n\n\"傳統貨幣的根本問題是需要所有的信任來使其運作。\n使其發揮作用。我想和大家分享一下我認爲加密貨幣背後真正的重要性。",
      "title": "中本聰的名言"
    }
  ],
  "title": "THE quote of Satoshi Nakamoto",
  "created_utc": 1623102299,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Since there is more and more cryptocurrencies and more and more big figures that try to influence the market, I wanted to share what I think is the real importance behind the cryptocurrencies :</p>\n\n<p>&quot;<em>The root problem with conventional currency is all the trust that&#39;s required to make it work.</em> <strong>The central bank must be trusted not to debase the currency, but the history of fiat currencies is full of breaches of that trust</strong><em>. Banks must be trusted to hold our money and transfer it electronically, but they lend it out in waves of credit bubbles with barely a fraction in reserve. We have to trust them with our privacy, trust them not to let identity thieves drain our accounts.</em>&quot;</p>\n\n<p>- Satoshi Nakamoto</p>\n\n<p>This is the quote who makes me believe in cryptocurrencies, and I really think that a better world is coming thanks to blockchain. Don&#39;t trust centralised exchanges, don&#39;t trust billionaires who want to pump or dump the price. Believe in the technology !</p>\n</div><!-- SC_ON -->",
  "score": 256,
  "permalink": "/r/CryptoCurrency/comments/nudwy1/the_quote_of_satoshi_nakamoto/",
  "subreddit": "CryptoCurrency",
  "id": "nudwy1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404882872
}