{
  "author": "Tandril91",
  "the_new_excerpt": "I’d just like to start off by saying I’m 22 and I haven’t dated ever in my life,\nnever had any sort of romantic or intimate interaction before. Years ago I told\nmyself I would wait until I was emotionally, mentally and financially mature\nenough due to seeing how dramatic high school relationships…",
  "original_created_utc": 1611638586,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我只想先说我22岁了，我这辈子没有约会过。\n从来没有任何形式的浪漫或亲密的互动之前。几年前，我告诉\n我自己会等到我的情感、精神和经济都成熟的时候再去做\n够了，由于看到多么戏剧性的高中关系... ...",
      "title": "你怎么和别人交谈过随意的礼貌？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我只想先說我22歲了，我這輩子沒有約會過。\n從來沒有任何形式的浪漫或親密的互動之前。幾年前，我告訴\n我自己會等到我的情感、精神和經濟都成熟的時候再去做\n夠了，由於看到多麼戲劇性的高中關係... ...",
      "title": "你怎麼和別人交談過隨意的禮貌？"
    }
  ],
  "title": "How do you talk to someone past casual politeness?",
  "created_utc": 1611682643,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’d just like to start off by saying I’m 22 and I haven’t dated ever in my life, never had any sort of romantic or intimate interaction before. Years ago I told myself I would wait until I was emotionally, mentally and financially mature enough due to seeing how dramatic high school relationships were. </p>\n\n<p>So I’ll sometimes find myself talking with a girl or two at work or on occasion one of my sister’s friends. I have this very stupid, chronic thought process when it comes to mind with women about what it’d be like to date them. We’ll engage in some light small talk about how our days are but that’s pretty much it. I’m a massive moron when it comes to conversation, even with family I’ve known for years. Beyond the basic, “how are you?”, “having a good day?”, and other such formalities I have trouble really just talking about anything. I’ve no clue what to ask, say or bring up at any time. </p>\n\n<p>I’d love to just let loose and feel more casual around a girl, be able to joke and have some little rapport, rather than just treating them like a stranger every time. I’ll essentially just give little polite responses when they start talking about something. “Oh yeah? That’s pretty cool!” “You did? That’s great!” “Aw I’m sorry to hear that.” “That sounds like a good idea.” </p>\n\n<p>These and other such phrases seem to be the majority of what I contribute to conversations. I don’t know how to question them in order to learn more about them. I’ll sometimes try “you go to school?”, only to realize I know nothing about college so I don’t know what sort of specific questions to ask because it’ll all go over my head and I’ll just be sitting there nodding along, trying not to seem rude. </p>\n\n<p>I’m often left thinking: am I really interested in a woman? Or just the idea of one? Or maybe I’m subconsciously an asshole and just find them pretty to look at? I don’t even know what I want anymore, I...I have no clue why I’m pursuing something like this, I know it’ll end in futility. </p>\n\n<p>Just thought I’d ask if y’all had any similar issues with this, or what you might recommend. Though I’ll probably get it wrong anyway.</p>\n</div><!-- SC_ON -->",
  "score": 123,
  "permalink": "/r/AskMen/comments/l57266/how_do_you_talk_to_someone_past_casual_politeness/",
  "subreddit": "AskMen",
  "id": "l57266",
  "is_self": true,
  "media": null,
  "is_video": false
}