{
  "author": "mosesy",
  "original_created_utc": 1626304793,
  "title": "Bought a property this week thanks to Bitcoin",
  "created_utc": 1626320426,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>24 years old at the moment. Have been wanting to get into passive investments for the last year and I found a condo in my area for around 60-70k. The goal is to rent it out for income </p>\n\n<p>I store a good amount of my Bitcoin and other cryptos with BlockFi to earn interest….they also offer the ability to get a loan through them. Instead of selling my Bitcoin to buy the property…I put my crypto up as collateral and got a cash loan equivalent (almost) wired straight into my account. Used that to buy the property! No banks involved at all In the process. Best part is after I pay off the loan (which I easily can right now) the collateralized crypto returns back to my account!</p>\n\n<p>So while I didn’t buy this property with Bitcoin itself. Bitcoin did allow me to retrieve the cash equivalent of my loan through a crypto financial firm. Times are changing and Bitcoin really is the future, I feel bad for those not keeping up with the evolution of money.</p>\n</div><!-- SC_ON -->",
  "score": 168,
  "permalink": "/r/Bitcoin/comments/okga5s/bought_a_property_this_week_thanks_to_bitcoin/",
  "subreddit": "Bitcoin",
  "id": "okga5s",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "24 years old at the moment. Have been wanting to get into passive investments\nfor the last year and I found a condo in my area for around 60-70k. The goal is\nto rent it out for income\n\nI store a good amount of my Bitcoin and other cryptos with BlockFi to earn\ninterest….they also offer the ability to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "現在、24歳。去年からパッシブ投資をしたいと思っていました。\n去年からパッシブ投資をしたいと思っていましたが、自分の住んでいる地域で6～7万円くらいのマンションを見つけました。目標は\n賃貸して収入を得ることです。\n\n私はビットコインやその他の暗号をBlockFiに保管して、利息を得るようにしています。\n利息....、彼らはまた...",
      "title": "ビットコインのおかげで今週物件を購入しました"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "此刻已经24岁了。去年，我一直想进入被动投资领域。\n去年，我在我的地区找到了一套公寓，价格在6-7万左右。我们的目标是\n把它租出去获得收入\n\n我在BlockFi存储了大量的比特币和其他加密货币，以赚取收入。\n利息....，他们还提供了一种能力，即：",
      "title": "感谢比特币，本周买了一套房产"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "此刻已經24歲了。去年，我一直想進入被動投資領域。\n去年，我在我的地區找到了一套公寓，價格在6-7萬左右。我們的目標是\n把它租出去獲得收入\n\n我在BlockFi存儲了大量的比特幣和其他加密貨幣，以賺取收入。\n利息....，他們還提供了一種能力，即：",
      "title": "感謝比特幣，本週買了一套房產"
    }
  ]
}