{
  "author": "VegetableAble405",
  "original_created_utc": 1653137765,
  "title": "Why do we only feel consciousness near our eyes/brain region but not in the rest of our body?",
  "created_utc": 1653153950,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;e.g. I don&amp;#39;t feel my consciousness in my ear/hand/foot/leg etc. These body parts feel only like extra appendages to me.&lt;/p&gt;\n\n&lt;p&gt;I might be phrasing my question incorrectly, but I hope someone will understand what I meant because I don&amp;#39;t know how else to explain it.&lt;/p&gt;\n\n&lt;p&gt;Edit: If someone asked you where you are, you would point towards your eyes/head not towards your ear/finger or any other body part. I feel like my consciousness is mainly in that area. I know this might sound weird, but I want to know if anyone else feels like this as well.&lt;/p&gt;\n\n&lt;p&gt;Edit 2: I&amp;#39;m guessing this would have to do a lot with the frontal cortex right behind the eyes where most of our thinking is done and maybe that&amp;#39;s why this is happening. But I would like some opinions on this or if you feel similarly.&lt;/p&gt;\n\n&lt;p&gt;Edit 3: Maybe because the brain has the largest concentration of neurons firing at the same time, that&amp;#39;s why I feel like this?&lt;/p&gt;\n\n&lt;p&gt;Edit 4: When I close my eyes, I don&amp;#39;t feel &amp;quot;conscious&amp;quot; in them anymore. Only in my brain. So I&amp;#39;m guessing because the eyes have so much neurons compared to all other organs when they are deprived of sensory information (hence, neurons inside the eyes fire less), then I feel my &amp;quot;consciousness&amp;quot; only in my brain area. &lt;strong&gt;So I&amp;#39;m thinking: my consciousness is wherever my neurons are MOST actively firing.&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/NoStupidQuestions/comments/uumjsn/why_do_we_only_feel_consciousness_near_our/",
  "subreddit": "NoStupidQuestions",
  "id": "uumjsn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "e.g. I don't feel my consciousness in my ear/hand/foot/leg etc. These body parts\nfeel only like extra appendages to me.\n\nI might be phrasing my question incorrectly, but I hope someone will understand\nwhat I meant because I don't know how else to explain it.\n\nEdit: If someone asked you where you…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "例：耳／手／足／脚などに意識を感じない。これらの体の部分は\n私には余分な付属物のように感じられるだけです。\n\n私の質問の言い方が悪いかもしれませんが、誰かが私の言いたいことを理解してくれるといいのですが。\nというのも、他にどう説明したらいいのかわからないからです。\n\n編集部：もし、誰かに「どこが...」と聞かれたら？",
      "title": "なぜ私たちは、目や脳の近くにだけ意識を感じ、体の他の部分には意識を感じないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "例如：我的耳朵/手/脚/腿等都感觉不到我的意识。这些身体部位\n对我来说只觉得是额外的附属物。\n\n我的问题可能措辞不正确，但我希望有人能明白\n我的意思，因为我不知道还能怎么解释。\n\n编辑：如果有人问你，你在哪里...",
      "title": "为什么我们只在眼睛/大脑区域附近感受到意识，而在身体的其他部位却没有？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "例如：我的耳朵/手/腳/腿等都感覺不到我的意識。這些身體部位\n對我來說只覺得是額外的附屬物。\n\n我的問題可能措辭不正確，但我希望有人能明白\n我的意思，因爲我不知道還能怎麼解釋。\n\n編輯：如果有人問你，你在哪裏...",
      "title": "爲什麼我們只在眼睛/大腦區域附近感受到意識，而在身體的其他部位卻沒有？"
    }
  ]
}