{
  "author": "wakeupitsadream",
  "the_new_excerpt": "I work in the academia so I spend a significant part of my days reading peer\nreviewed research papers. One of the first things I learned about crypto is that\neach project (usually) has a so called \"white paper\" where the team behind the\nproject publishes their vision for the future, main ideas, some…",
  "original_created_utc": 1620605571,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は学界で働いているので、一日の大半を査読付きの研究論文を読むことに費やしています。\n研究論文を読んでいます。暗号について最初に学んだことのひとつは、次のようなことです。\n各プロジェクト（通常）には、いわゆる「ホワイトペーパー」があり、そのプロジェクトのチームが\nここでは、プロジェクトの背後にいるチームが、将来のビジョン、主なアイデア、いくつかの...",
      "title": "なぜホワイトペーパーはプロっぽくないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在学术界工作，所以我每天花很大一部分时间阅读同行的\n评审的研究论文。我了解到的关于加密的第一件事就是\n每个项目（通常）都有一个所谓的 \"白皮书\"，其中项目背后的团队\n在那里，项目背后的团队公布了他们对未来的愿景，主要的想法，一些...",
      "title": "为什么白皮书如此不专业？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在學術界工作，所以我每天花很大一部分時間閱讀同行的\n評審的研究論文。我瞭解到的關於加密的第一件事就是\n每個項目（通常）都有一個所謂的 \"白皮書\"，其中項目背後的團隊\n在那裏，項目背後的團隊公佈了他們對未來的願景，主要的想法，一些...",
      "title": "爲什麼白皮書如此不專業？"
    }
  ],
  "title": "Why are white papers so unprofessional?",
  "created_utc": 1620636696,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I work in the academia so I spend a significant part of my days reading peer reviewed research papers. One of the first things I learned about crypto is that each project (usually) has a so called &quot;white paper&quot; where the team behind the project publishes their vision for the future, main ideas, some mathematical analysis, and how they are going to achieve their promises. While I wasn&#39;t expecting the standard to be high, I was expecting these papers to be at least decent considering that in most cases the team has multiple people working there and the projects are asking for millions of dollars.</p>\n\n<p>To my surprise, I was absolutely shocked when I started reading these papers. The vast majority of them look like utter trash, and if they were submitted as an assignment in any university they would have been a fail without question. Even projects that interest me seem to have basic formatting problems which immediately makes me less interested in putting money there.</p>\n\n<p>Just to give some balance, I like BTC&#39;s, Ethereum&#39;s and XLM&#39;s paper a lot because they feel very professional and serious, but if you compare them with the paper of most of the modern alt-coins, you are going to vomit.</p>\n</div><!-- SC_ON -->",
  "score": 367,
  "permalink": "/r/CryptoCurrency/comments/n8r8ef/why_are_white_papers_so_unprofessional/",
  "subreddit": "CryptoCurrency",
  "id": "n8r8ef",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985990911
}