{
  "author": "BigBet0",
  "the_new_excerpt": "I keep hearing constantly to just put your money into index funds because it is\nvery unlikely that YOU as an investor have the ability to outperform the market.\n\nSo why are there so many individual investors then and why doesn't everyone just\nput their money into index funds?\n\nI'm confused because…",
  "original_created_utc": 1623721209,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "投資家であるあなたが市場をアウトパフォームする能力を持っているとはとても思えないので、インデックスファンドに資金を投入するように、としきりに言われます。\nなぜなら、投資家であるあなたが市場をアウトパフォームする能力を持っているとはとても思えないからです。\n\nそれなのに、なぜ個人投資家が多いのか、なぜみんなインデックスファンドにお金を入れないのか。\nインデックスファンドに資金を投入しないのでしょうか？\n\n私が混乱しているのは...。",
      "title": "インデックスファンドが一般の投資家を80～90％上回るのであれば、なぜ誰もが自分で取引をするのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不断听到有人说，只要把你的钱放到指数基金里就可以了，因为作为投资者的你不可能有能力超越市场。\n因为你作为一个投资者不太可能有能力超越市场的表现。\n\n那么，为什么会有这么多的个人投资者呢？\n把他们的钱投入指数基金？\n\n我很疑惑，因为...",
      "title": "如果指数基金在80-90%的时间里表现优于普通投资者，为什么还有人自己进行交易？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不斷聽到有人說，只要把你的錢放到指數基金裏就可以了，因爲作爲投資者的你不可能有能力超越市場。\n因爲你作爲一個投資者不太可能有能力超越市場的表現。\n\n那麼，爲什麼會有這麼多的個人投資者呢？\n把他們的錢投入指數基金？\n\n我很疑惑，因爲...",
      "title": "如果指數基金在80-90%的時間裏表現優於普通投資者，爲什麼還有人自己進行交易？"
    }
  ],
  "title": "If index funds outperform regular investors 80-90% of the time, why does ANYONE even trade on their own?",
  "created_utc": 1623786308,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I keep hearing constantly to just put your money into index funds because it is very unlikely that YOU as an investor have the ability to outperform the market.</p>\n\n<p>So why are there so many individual investors then and why doesn&#39;t everyone just put their money into index funds? </p>\n\n<p>I&#39;m confused because yes the point is to make money, but there have to be downsides to just blindly putting your money into index funds because I see rarely if ever many people doing that strategy...</p>\n</div><!-- SC_ON -->",
  "score": 64,
  "permalink": "/r/investing/comments/o02jtq/if_index_funds_outperform_regular_investors_8090/",
  "subreddit": "investing",
  "id": "o02jtq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009742347
}