{
  "author": "notbrokemexican",
  "the_new_excerpt": "I understand that many investors are new, but I get rather annoyed by people who\ntreat stock investments like card game collections.\n\nAt one point, someone had criticized an image of a portfolio, believing that it\nwas mine. It was Berkshire Hathaway holdings.\n\nHere's the quote:\n\n\"Too much Apple. Not…",
  "original_created_utc": 1617089384,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我明白很多投资者都是新来的，但我比较讨厌的是那些\n把股票投资当成纸牌游戏收藏。\n\n曾经有人批评过一个投资组合的形象，认为它\n是我的 是伯克希尔-哈撒韦控股的。\n\n这里的报价。\n\n\"太多的苹果。不...",
      "title": "我觉得股票论坛很烦人的东西（Rant)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我明白很多投資者都是新來的，但我比較討厭的是那些\n把股票投資當成紙牌遊戲收藏。\n\n曾經有人批評過一個投資組合的形象，認爲它\n是我的 是伯克希爾-哈撒韋控股的。\n\n這裏的報價。\n\n\"太多的蘋果。不...",
      "title": "我覺得股票論壇很煩人的東西（Rant)"
    }
  ],
  "title": "Something I find really annoying about stock forums (Rant)",
  "created_utc": 1617104343,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I understand that many investors are new, but I get rather annoyed by people who treat stock investments like card game collections. </p>\n\n<p>At one point, someone had criticized an image of a portfolio, believing that it was mine. It was Berkshire Hathaway holdings.</p>\n\n<p>Here&#39;s the quote:</p>\n\n<p>&quot;Too much Apple. Not enough oil/energy sector/natural gas. No REITs? Where&#39;s the telecoms. Att/Verizon/t-mobile? Grab yourself Ford or GM.&quot;</p>\n\n<p>I don&#39;t really have much to say, but it does make reading some fair amount of posts annoying, when you realize it&#39;s just a ton of people who are afraid to lose money and make terrible choices investing in businesses or industries that they themselves do not understand, but feel like they understand.</p>\n\n<p>I would bet on the guy with 2-3 tech holdings than the guy who has, what I call, master of the universe syndrome. In the wise words or Charlie Munger:</p>\n\n<p>“It is remarkable how much long-term advantage people like us have gotten by trying to be consistently not stupid, instead of trying to be very intelligent&quot;</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/stocks/comments/mgafvy/something_i_find_really_annoying_about_stock/",
  "subreddit": "stocks",
  "id": "mgafvy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357142661
}