{
  "author": "NathanGorgeous",
  "original_created_utc": 1643082815,
  "title": "Does anyone else find it ironic that Silk Road was essentially the best use-case for what Bitcoin was always intended to be: purely peer-to-peer electronic cash.",
  "created_utc": 1643099802,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Obviously, &lt;em&gt;what&lt;/em&gt; was being bought and sold were terrible things for society, but I just find it funny that Bitcoin is now this difficult and abstract thing explain to people when the original whitepaper made its intentions so clear. Silk Road was legitimately the proper use-case for Bitcoin: pure peer-to-peer electronic cash.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know if &amp;quot;irony&amp;quot; is the right word since it&amp;#39;s not technically ironic, but there is something interesting about the fact that this was the perfect use of Bitcoin.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not sure if it&amp;#39;s exchanges, how governments have regulated those exchanges, or something else are that changed things, but this &amp;quot;store of value&amp;quot; thing is not what was intended for Bitcoin. You may love the store of value angle or you may hate it, but either way: it&amp;#39;s not what Bitcoin was intended to be.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 308,
  "permalink": "/r/CryptoCurrency/comments/sc4en1/does_anyone_else_find_it_ironic_that_silk_road/",
  "subreddit": "CryptoCurrency",
  "id": "sc4en1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Obviously, what was being bought and sold were terrible things for society, but\nI just find it funny that Bitcoin is now this difficult and abstract thing\nexplain to people when the original whitepaper made its intentions so clear.\nSilk Road was legitimately the proper use-case for Bitcoin: pure…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "明らかに売買されていたものは、社会にとって恐ろしいものでしたが\nビットコインが今、このように難しく抽象的なものになっているのはおかしいと思います。\nホワイトペーパーではその意図が明確にされていたのに、人々に説明するのは難しい。\nSilk Roadは、ビットコインの正しい使用例である純粋な...",
      "title": "Silk Roadは、ビットコインが常に意図していた、純粋なピアツーピアの電子現金という用途に最も適したものであったということを、誰か皮肉に思う人はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "显然，被买卖的东西对社会来说是可怕的东西，但\n我只是觉得很有趣，比特币现在成了这个困难和抽象的东西\n当最初的白皮书把它的意图说得很清楚的时候，比特币现在却成了一个难以解释的抽象事物。\n丝绸之路是合法的，是比特币的正确使用案例：纯粹的...",
      "title": "有没有人觉得很讽刺，丝绸之路本质上是比特币一直以来的最佳用途：纯粹的点对点电子现金。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "顯然，被買賣的東西對社會來說是可怕的東西，但\n我只是覺得很有趣，比特幣現在成了這個困難和抽象的東西\n當最初的白皮書把它的意圖說得很清楚的時候，比特幣現在卻成了一個難以解釋的抽象事物。\n絲綢之路是合法的，是比特幣的正確使用案例：純粹的...",
      "title": "有沒有人覺得很諷刺，絲綢之路本質上是比特幣一直以來的最佳用途：純粹的點對點電子現金。"
    }
  ]
}