{
  "author": "Joecracko",
  "original_created_utc": 1655434787,
  "title": "Reminder: Bitcoin was born from the tail end of a recession. It hasn't yet been tested by a recession. This is another first for Bitcoin.",
  "created_utc": 1655473530,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;You may have heard the term &amp;quot;anti-fragile&amp;quot; used to describe Bitcoin&amp;#39;s progression. Bitcoin has been through a laundry list of trials and tribulations.&lt;/p&gt;\n\n&lt;p&gt;The WikiLeaks debacle.\nThe Mt. Gox hack.\nThe 2013 bubble and crash.\nSeveral hostile hard forks.\nThe 2017 bubble and crash from the IPO mania.\nAn IRS crackdown.\nPolitical uncertainty and PR campaigns.\nBans imposed by countries.\nThe current bubble and crash from the NFT mania.\nAnd again this year from the technology sector collapse.\nCountless other things I&amp;#39;m forgetting.&lt;/p&gt;\n\n&lt;p&gt;But a true recession is something Bitcoin has not yet faced. The &amp;quot;smart money&amp;quot; is dumping their risky investments, Cryptocurrency being one of the riskiest assets. Bitcoin is going to be politically and reputationally vulnerable for quite some time. We have no idea what&amp;#39;s going to happen or how far down Bitcoin will go.&lt;/p&gt;\n\n&lt;p&gt;That being said, all these things are just another slew of trials and tribulations that will make Bitcoin even more resilient than it is now.&lt;/p&gt;\n\n&lt;p&gt;This is history in the making.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 305,
  "permalink": "/r/Bitcoin/comments/ve2z5n/reminder_bitcoin_was_born_from_the_tail_end_of_a/",
  "subreddit": "Bitcoin",
  "id": "ve2z5n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "You may have heard the term \"anti-fragile\" used to describe Bitcoin's\nprogression. Bitcoin has been through a laundry list of trials and tribulations.\n\nThe WikiLeaks debacle. The Mt. Gox hack. The 2013 bubble and crash. Several\nhostile hard forks. The 2017 bubble and crash from the IPO mania. An…"
}