{
  "author": "MockDeath",
  "original_created_utc": 1640461908,
  "title": "Happy holidays to you! And a special thanks to our Moderators, Panelists and Users.",
  "created_utc": 1640473016,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Happy holidays to all of you from &lt;a href=\"/r/AskScience\"&gt;/r/AskScience&lt;/a&gt;! All of you make this subreddit possible and I want to all know how sincerely I appreciate what you do here.&lt;/p&gt;\n\n&lt;p&gt;To every moderator who ensures that the posts are curated and the overall function of the subreddit works. You make up the framework of AskScience, without you there would be nothing to build on. With your high standards of quality and diligent work, you keep this subreddit full of quality content.&lt;/p&gt;\n\n&lt;p&gt;To every panelist, thank you for helping curate comments and answering questions. Without your answers this sub could not exist. Sharing your expertise and answering questions I truly believe you have helped raise the overall understanding of science across all of reddit. With such a wide array of experts, you always come through with a stunning level of understanding to share.&lt;/p&gt;\n\n&lt;p&gt;Finally, to the users. Thank you, driving interest and asking questions lets this subreddit fill its core function. Your curiosity helps everyone reading the posts gain a greater understanding of the universe and how it works.&lt;/p&gt;\n\n&lt;p&gt;I hope every single one of you have a fantastic end to the year and an even happier new year.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/askscience/comments/rog62g/happy_holidays_to_you_and_a_special_thanks_to_our/",
  "subreddit": "askscience",
  "id": "rog62g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Happy holidays to all of you from /r/AskScience! All of you make this subreddit\npossible and I want to all know how sincerely I appreciate what you do here.\n\nTo every moderator who ensures that the posts are curated and the overall\nfunction of the subreddit works. You make up the framework of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "r/AskScienceの皆さん、ハッピーホリデー! このサブレディットを作っているのは皆さんです。\n私はあなた方がここで行っていることに心から感謝していることを伝えたいと思います。\n\n投稿を管理し、全体的な管理を確実にするモデレーターの皆さん。\nサブレディットの機能が機能します。あなたは、サブレディットの枠組みを構成しています...",
      "title": "ハッピーホリデー・トゥ・ユー そして、モデレーター、パネリスト、ユーザーの皆様、ありがとうございました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "祝所有来自/r/AskScience的朋友们节日快乐！你们让这个分论坛变得更加丰富多彩。你们所有的人都使这个子版块\n我想让大家知道，我是多么真诚地感谢你们在这里所做的一切。\n\n对于每一位确保帖子被整理和子版块整体功能的版主\n的功能。你们构成了这个论坛的框架。",
      "title": "祝你节日快乐! 并特别感谢我们的版主、小组成员和用户。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "祝所有來自/r/AskScience的朋友們節日快樂！你們讓這個分論壇變得更加豐富多彩。你們所有的人都使這個子版塊\n我想讓大家知道，我是多麼真誠地感謝你們在這裏所做的一切。\n\n對於每一位確保帖子被整理和子版塊整體功能的版主\n的功能。你們構成了這個論壇的框架。",
      "title": "祝你節日快樂! 並特別感謝我們的版主、小組成員和用戶。"
    }
  ]
}