{
  "author": "SenatusSPQR",
  "the_new_excerpt": "Warning: longread. A sort of tl;dr at the bottom.\n\nIn this post I'll outline why I think that Nano, rather than Bitcoin, might be\nthe \"final\" store of value, because it approaches the theoretical limit of\nperfect store of value/reserve currency characteristics. Much of this is based\non Ray Dalio's…",
  "original_created_utc": 1614594927,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "警告：长期阅读。一种tl;dr在底部。\n\n在这篇文章中，我将概述为什么我认为Nano，而不是比特币，可能会是...\n价值的 \"最终 \"存储，因为它接近理论上的极限。\n完美的价值存储/储备货币特征。这在很大程度上是基于\n在雷-达利欧的...",
      "title": "讨论/CMV：Nano是比比特币更好的价值存储，可能会成为储备货币（长读）。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "警告：長期閱讀。一種tl;dr在底部。\n\n在這篇文章中，我將概述爲什麼我認爲Nano，而不是比特幣，可能會是...\n價值的 \"最終 \"存儲，因爲它接近理論上的極限。\n完美的價值存儲/儲備貨幣特徵。這在很大程度上是基於\n在雷-達利歐的...",
      "title": "討論/CMV：Nano是比比特幣更好的價值存儲，可能會成爲儲備貨幣（長讀）。"
    }
  ],
  "title": "Discussion/CMV: Nano is a better store of value than Bitcoin and might become a reserve currency (longread)",
  "created_utc": 1614609353,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Warning: longread. A sort of tl;dr at the bottom.</p>\n\n<p>In this post I&#39;ll outline why I think that Nano, rather than Bitcoin, might be the &quot;final&quot; store of value, because it approaches the theoretical limit of perfect store of value/reserve currency characteristics. Much of this is based on Ray Dalio&#39;s &quot;<a href=\"https://www.linkedin.com/pulse/changing-world-order-ray-dalio-1f/\">The Changing World Order</a>&quot; which is a very long read but is recommended reading for anyone interested in the future of fiat money, reserve currencies and stores of value. While reading his posts I felt like he was putting into words what I couldn&#39;t put into words before regarding my stance on cryptocurrencies and primarily Nano.</p>\n\n<p>To start off with - I realise that most people primarily see Nano as the cutesy cryptocurrency that&#39;s focused on being instant and feeless, and has a ton of supporters because of how easy it is to try out and demonstrate. I think that because of this, the true fundamentals of Nano are overlooked. I believe that in the long run these fundamentals are far, FAR more important than just being instant and feeless, and I believe that these fundamentals are what&#39;s going to get big investors interested in Nano soon. With that said, let me begin.</p>\n\n<h1><strong>The end of a cycle</strong></h1>\n\n<p>Luckily for us all, I am not talking about the end of a crypto cycle. I believe we are reaching the end of a cycle in which we have fiat currencies as reserve currencies. Not just the dollar - all fiat currencies. This is caused by a confluence of factors, ones that &quot;The Changing World Order&quot; describes better than I ever could. In short - too much collective debt has been built up, and this is being propped up by central banks who are running out of ammunition. This might have gone on for a bit longer, had it not been the case that the Covid crisis accelerated this process.</p>\n\n<p>Because of Covid, (potential) growth slowed further. With record debt outstanding and a slowdown in growth and consumption, there is one primary dial that central banks can turn to support the economy - they can expand the money supply to keep the system propped up. This is what has been happening on a massive scale, faster than we have experienced in our lifetimes. This rapidly expanding money supply further accelerates the decline of fiat currency value.</p>\n\n<p>This is nothing new - these cycles have happened many times before. The Dutch Empire, starting its rise roughly in 1581 by overthrowing the Spanish, peaking in power around 1650, lead to the Dutch Guilder becoming the world reserve currency. The Dutch Guilder remained the world reserve currency until roughly 1700-1750. During its slow decline, the Dutch kept increasing their debt, relying on the strength of their position as the global reserve currency to access cheap debt. Eventually the debt overhang became too much to bear, infighting over wealth increased, and the British were able to take over the role of a weakened Dutch Empire. </p>\n\n<p>The British Empire saw a similar rise and decline, holding the majority of the world&#39;s wealth, military power, and status as a world reserve currency. In the interest of brevity let me just say that the cycle was similar and that the British were eventually overtaken by the US, leading to the situation we currently find ourselves in.</p>\n\n<p>In prior cycles, the bust of the reserve currency led to a flight back into hard money. The cycle starts over, starting with gold-like assets. These assets have the advantage that they were portable, divisible, and most importantly could be settled on the spot. Using gold meant using a creditless and trustless hard currency, a very valuable commodity in a time where people lack trust in credit and promises. </p>\n\n<p>The next stage is moving to claims on hard money, since gold is risky and inconvenient to carry around, and it is far easier to have claims on gold that can be exchanged. This is followed by increasing debt as the banks and governments discover they do not need to always cover 100% of the outstanding claims. Then come debt crises, defaults and devaluations, primarily through (central) bank runs when people discover their claims aren&#39;t 100% backed. This has already happened with gold in the current cycle. This is followed by fiat money (letting go of the gold standard), a system in which hard money no longer plays a role whatsoever. As increasing amounts of money are printed, devaluing the fiat currency, we eventually finish the circle with people looking for stores of value that are not debased as the fiat currencies are. Ray Dalio believes we are currently in this stage, and I am inclined to agree. </p>\n\n<p>However, something has changed relative to prior cycles. We now have the internet, and all the possibilities it brings with it. What the internet offers us is a form of hard money that does not have the problems associated with gold, the problems that lead us to move from the first to the second stage. This leads me to the next subsection.</p>\n\n<h1><strong>Cryptocurrency or Bitcoin as hard money</strong></h1>\n\n<p>What cryptocurrency offers us is a form of hard money that is easy to carry around because it has no physical existence, that is divisible, can easily be exchanged, and most importantly is secure through decentralization. I believe we are starting to see this movement right now. Investors are fleeing into cryptocurrency as a hedge, because some are coming to the same realisation that I am and that Ray Dalio is. However, I believe that the market is still frothy, and that fundamentals are being overlooked.</p>\n\n<p>The reason I say fundamentals are being overlooked is because the cryptocurrency that is getting the most attention, Bitcoin, is the cryptocurrency where the aforementioned factors (portability, divisibility, security and trustless settlement) are doubtful. Bitcoin&#39;s lack of scaling causing slow transfers and high fees is already leading to custodial solutions, essentially leapfrogging to the second part of the debt cycle. However, far more importantly, its security through decentralization is questionable at best.</p>\n\n<p>Bitcoin&#39;s security derives from its decentralised consensus mechanism. Transactions are verified by a competitive network of miners performing Proof of Work, aiming to lay claim to the block rewards and fees associated with Bitcoin blocks. While this has worked relatively well so far (with some exceptions), the long term dynamics of this must worry anyone that looks into it. Bitcoin mining is a business with economies of scale, through access to cheap capital, scale advantages in production, and myriad other ways.</p>\n\n<p>Economies of scale lead to centralization of consensus power, which directly decreases the security and value proposition of Bitcoin. There is plenty of research that describes this trend which is already becoming apparent. Bitcoin&#39;s value proposition comes from its security, which comes from its decentralized consensus mechanism. The incentivisation of centralization through economies of scale directly impacts Bitcoin&#39;s long term value proposition.</p>\n\n<p>It should be clear that while I think cryptocurrencies offer massive potential, I believe that Bitcoin is not the answer. It&#39;s a first version, a prototype, which comes with many issues as prototypes are wont to.</p>\n\n<h1><strong>Nano as a close to perfect cryptocurrency</strong></h1>\n\n<p>As I mentioned at the very start, I believe the best hard money is Nano, and I believe that its potential is massively underappreciated. I&#39;ll explain why I believe this to be the case.</p>\n\n<p>Nano improves on gold in many ways, and approaches the theoretical limit of a perfect store of value. Its portability and transferability is unparalleled - it&#39;s a digital currency that transfers at the speed of light. I could send you some, and it would be confirmed through global consensus in the time it would take you to blink. Not a single atom is lost as might happen in gold - 1 Nano sent means 1 Nano received, forever, because there are no fees in Nano. It can be divided up to 30 decimal places - the entire world economy could run on 1 Nano and people would still be able to do microtransactions.</p>\n\n<p>This no-fee proposition leads me to the next important aspect, and I&#39;ve written about this before. In Nano, there is no centralisation over time. There is no mining, there are no fees, no inflation nor block rewards. The network itself is the reward. This might sound counterintuitive. Because Nano is feeless , the fastest value transfer in the world, and such an excellent store of value, it&#39;s an ideal solution for many businesses. As any merchant will tell you, being able to cut on fees has high value. As any exchange will tell you, people exchanging into Nano brings them lots of revenue. The value for these entities is in the network being online and staying online in a secure manner. The value is in the businesses they have built on top of it, and in the value of their own Nano holdings. The same holds true, proportionally, for each Nano holder.</p>\n\n<p>Nano has no mining. It uses Open Representative Voting. 1 Nano = 1 vote. Anyone can run a validator, and anyone can vote for any validator at any time, or change their vote at any time. Everyone that holds Nano is incentivised to help distribute votes in such a way that it is incredibly hard for a single party or group to gain a majority of consensus. In other words, every Nano holder is incentivised to contribute to decentralisation.</p>\n\n<p>This is no theoretical exercise. While the emergent centralization in Bitcoin is already apparent, this emergent decentralization can be seen in Nano through the movement of Nano votes over time.</p>\n\n<p>Additionally, there&#39;s the fixed money supply aspect of Nano. Bitcoin enthusiasts sometimes talk about the Stock to Flow (S2F) model as the roadmap to a $1 million Bitcoin. Bitcoin&#39;s S2F is about 38-54, with a higher number essentially being better as this means there is less new supply coming into the market. Halvings increase the S2F, as this decreases the supply coming into the market. Without going into the validity of this theory, it&#39;s clear how Nano&#39;s proposition offers a better S2F. Nano will never have any new Nano coming into the market. It&#39;s S2F cannot be calculated, because it&#39;s infinite.</p>\n\n<p>Finally, Nano has no limitations built in with regards to scale. It scales using whatever hardware and bandwidth is available to it. The protocol is at the limits of efficiency, and uses extremely little energy. In every sense, it pushes the boundaries of what is possible. This is why I think Nano is not just a fantastic store of value, but that it might be difficult to conceive of something that works better in the first place.</p>\n\n<h1><strong>Conclusion</strong></h1>\n\n<p>All the above is what I mean when I say that Nano is at the theoretical limit of a perfect store of value. It&#39;s almost limitlessly divisible (up to 30 decimals), limitlessly transferrable (no fees), and perfect as money since transfers are subsecond and trustless. Its security comes from decentralisation, and decentralisation is incentivised on a protocol level. Attacking Nano&#39;s consensus is difficult because it&#39;s extremely hard to acquire a large share of supply, and because once you have done so you have every incentive not to attack it.</p>\n\n<p>Nano&#39;s scalability means that the move to a 2nd stage (claims on hard money - central institutions) in Nano might not ever be needed or at least far less necessary, because Nano gives us a form of hard money that improves on gold by being globally transferrable, trustlessly, instantly, feelessly, with no loss of matter and incredible divisibility, in a scalable manner.</p>\n\n<p>In short, I believe Nano offers an orders of magnitude improvement on every prior store of value. I believe it pushes the theoretical limits of being a store of value and reserve currency, and I believe this is massively underappreciated. I see the current ending of the cycle as the time for hard money to re-emerge, and I think more and more people will find their way to Nano.</p>\n\n<p>If you&#39;ve actually read all this, thanks. Thinking all this through and trying to write it out was rather eye-opening for me, and I would love to hear what you think.</p>\n</div><!-- SC_ON -->",
  "score": 887,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/lW1Xt-pPNP_KxShmEOILjiGHcCz9gCIajBJqZQUIf2Y.jpg?auto=webp&s=dfe6e75ad58eb68aaeabb1ea9fe12a0ab934fc77",
          "width": 744,
          "height": 400
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/lW1Xt-pPNP_KxShmEOILjiGHcCz9gCIajBJqZQUIf2Y.jpg?width=108&crop=smart&auto=webp&s=223afb1198eed466350be1da9306abceca450ac0",
            "width": 108,
            "height": 58
          },
          {
            "url": "https://external-preview.redd.it/lW1Xt-pPNP_KxShmEOILjiGHcCz9gCIajBJqZQUIf2Y.jpg?width=216&crop=smart&auto=webp&s=180f584dfe3afb80d95e327261be1ee5c41e4049",
            "width": 216,
            "height": 116
          },
          {
            "url": "https://external-preview.redd.it/lW1Xt-pPNP_KxShmEOILjiGHcCz9gCIajBJqZQUIf2Y.jpg?width=320&crop=smart&auto=webp&s=20d07f5247fd68db4ff4d0273aab3b8d75b5633b",
            "width": 320,
            "height": 172
          },
          {
            "url": "https://external-preview.redd.it/lW1Xt-pPNP_KxShmEOILjiGHcCz9gCIajBJqZQUIf2Y.jpg?width=640&crop=smart&auto=webp&s=94c1955c1092e5d86f91eff97dae328f7b4c9931",
            "width": 640,
            "height": 344
          }
        ],
        "variants": {},
        "id": "ZJrJzTCs-Kp1aqV-7tpgw3VU27QPZCY4tlXl1ZofMWI"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/lv5yw0/discussioncmv_nano_is_a_better_store_of_value/",
  "subreddit": "CryptoCurrency",
  "id": "lv5yw0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937738001
}