{
  "author": "changedusernamelol",
  "the_new_excerpt": "We examine the market consequences of due diligence (DD) reports on Reddit’s\nWallstreetbets (WSB) platform. We find average ‘buy’ recommendations result in\ntwo-day announcement returns of 1.1%. Further, the returns drift upwards by 2%\nover the subsequent month and nearly 5% over the subsequent…",
  "original_created_utc": 1616536287,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我们研究了Reddit的尽职调查（DD）报告的市场后果。\nWallstreetbets（WSB）平台。我们发现平均 \"买入 \"建议的结果是\n两天公告回报率为1.1%。此外，回报率向上漂移2%。\n比随后的一个月，比随后的近5%的...",
      "title": "伙计们，这些人都说我们很聪明"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們研究了Reddit的盡職調查（DD）報告的市場後果。\nWallstreetbets（WSB）平臺。我們發現平均 \"買入 \"建議的結果是\n兩天公告回報率爲1.1%。此外，回報率向上漂移2%。\n比隨後的一個月，比隨後的近5%的...",
      "title": "夥計們，這些人都說我們很聰明"
    }
  ],
  "title": "Guys these people are saying we’re smart",
  "created_utc": 1616556568,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We examine the market consequences of due diligence (DD) reports on Reddit’s Wallstreetbets (WSB) platform. We find average ‘buy’ recommendations result in two-day announcement returns of 1.1%. Further, the returns drift upwards by 2% over the subsequent month and nearly 5% over the subsequent quarter. Retail trading increases sharply in the intraday window following publication, and retail investors are more likely to be net buyers following reports that earn larger returns. Thus, in sharp contrast to regulators concerns that WSB investment advice is harming retail traders, our findings suggest that both WSB posters and users are skilled. \n<a href=\"https://dx.doi.org/10.2139/ssrn.3806065\">https://dx.doi.org/10.2139/ssrn.3806065</a></p>\n\n<p>It’s from last week but apparently it has only 2000 views. Give it a read.</p>\n\n<p>Edit: why is it pouring with downvotes? The paper has 4000 views now and only 300 upvotes? I just want people to read it for a little confidence boost. This needs to go to <a href=\"/r/all\">r/all</a> for the world to witness</p>\n\n<p>Edit: this post got so many reports on <a href=\"/r/GME\">r/GME</a>, it’s been removed two times already.</p>\n\n<p>As soon as you see a rocket, you upvote. Also loads of shitposting from newcomers. It’s not just lols. You’re missing on actual information because good content is reported and downvoted by the shills and never makes it to 50 upvotes.</p>\n\n<p>Edit: it’s them posting the memes and shit for karma because there’s a big percentage here who will upvote. Especially between each other. Stop fucking around with these guys. This is the no fuck around gang. They ruined our parents lives and ours too. THEY ARE COMING AT US IN OUR OWN HOUSE. WHY LET YOUR GUARD DOWN WHEN WE ARE SO CLOSE?</p>\n</div><!-- SC_ON -->",
  "score": 11593,
  "permalink": "/r/wallstreetbets/comments/mbpt6j/guys_these_people_are_saying_were_smart/",
  "subreddit": "wallstreetbets",
  "id": "mbpt6j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752832261
}