{
  "author": "LiftUni",
  "the_new_excerpt": "OVERVIEW\n\nFor much of its’ history, Ford ($F) has been a boring dividend stock, yielding\nbetween 5% and 10% per year and generally languishing between $5 and $15 a\nshare. Not exactly an inspiring story of growth or innovation. In a sector that\nhosts charismatic CEOs, exciting newcomers, and glossy…",
  "original_created_utc": 1615815105,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "概述\n\n在其历史上的大部分时间里，福特($F)一直是一个无聊的股息股，收益率为\n每年在5%至10%之间，一般在5至15美元/年之间徘徊。\n分享。不完全是一个鼓舞人心的成长或创新故事。在一个行业中\n魅力四射的CEO、激动人心的新人和光鲜亮丽的...",
      "title": "福特($F) - 丑小鸭变金鹅"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "概述\n\n在其歷史上的大部分時間裏，福特($F)一直是一個無聊的股息股，收益率爲\n每年在5%至10%之間，一般在5至15美元/年之間徘徊。\n分享。不完全是一個鼓舞人心的成長或創新故事。在一個行業中\n魅力四射的CEO、激動人心的新人和光鮮亮麗的...",
      "title": "福特($F) - 醜小鴨變金鵝"
    }
  ],
  "title": "Ford ($F) - Ugly Duckling to Golden Goose",
  "created_utc": 1615819186,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h1>Overview</h1>\n\n<p>For much of its’ history, Ford ($F) has been a boring dividend stock, yielding between 5% and 10% per year and generally languishing between $5 and $15 a share. Not exactly an inspiring story of growth or innovation. In a sector that hosts charismatic CEOs, exciting newcomers, and glossy new entrants to the industry, selling people on Ford’s potential certainly seems like an uphill battle. I mean… just look at this chart, Ford hasn’t had meaningful sustained price movement since 00-01, and that was in the wrong direction.</p>\n\n<p>I would like you to forget what you think you know about Ford and begin to look at them in a new light. Ford is no longer the ugly girl at the dance or the fat kid in gym class, but rather Ryan Reynolds in <em>Just Friends</em> or Laney Boggs in <em>She’s All That</em>. To understand why I think Ford is the most compelling value opportunity in the auto sector today, we’re going to have to look at its maneuverings over the last 3-4 years.</p>\n\n<h1>New Leadership, New Vision</h1>\n\n<p><strong>$11B Restructuring Plan</strong></p>\n\n<p>In October of 2020, Ford hired its’ new <a href=\"https://media.ford.com/content/fordmedia/fna/us/en/people/james-d--farley--jr-.html\">CEO Jim Farley</a> who had previously held the title of COO within the company. Farley was the architect behind the company’s <a href=\"https://media.ford.com/content/fordmedia/fna/us/en/news/2018/11/26/ford-statement-on-business-transformation.html\">$11B restructuring plan</a> that it announced in June of 2018, and it has only accelerated its’ pace under his guidance. By most estimates Ford is about halfway through its plan to restructure the company, which primarily involves cuts to unprofitable sectors and refocusing on profitable ones, as well as investment in future technologies.</p>\n\n<p><strong>Trimming of Fat</strong></p>\n\n<p>Ford has made a few major moves to shore up losses it was incurring in unprofitable arms of the business. The first, and one which you are probably already aware of, is the discontinuation of many of its sedan lineup in North America. In the middle of 2018, Ford announced that it would be <a href=\"https://www.detroitnews.com/story/business/autos/ford/2018/04/25/ford-cutting-car-lineup-earnings/34244867/\">eliminating the Taurus, Fiesta, Fusion, C-Max, and Focus sedans</a> from their lineup moving forward. The estimated operating cost savings was $25.5B through 2022, and Ford announced that they would be focusing on their more profitable SUV and pick-up models moving forward.</p>\n\n<p>Ford also announced in 2021 that it would be largely <a href=\"https://media.ford.com/content/fordmedia/fna/us/en/news/2021/01/11/ford-advances-south-america-restructuring.html\">exiting the South American market</a>, which hadn’t turned a profit since 2012 and in fact accounted for over $5B in losses during that period. They would continue operating at small-scale producing their popular Ranger pick-up and commercial vans but with the closure of their main manufacturing facility in Brazil, Ford finally cut bait in a difficult market for most traditional automakers.</p>\n\n<p>Ford Europe had a <a href=\"https://media.ford.com/content/fordmedia/feu/en/news/2019/06/27/ford-looks-to-the-future-in-europe--business-redesigned-for-prof.html\">major redesign</a> under Farley when he was President of Global Markets, slashing underperforming models from its lineup and refocusing on its highly profitable commercial vehicles as well as increasing imports of its iconic models. They also announced a <a href=\"https://media.ford.com/content/fordmedia/feu/en/news/2021/02/17/ford-europe-goes-all-in-on-evs-on-road-to-sustainable-profitabil.html\">strong shift toward EVs</a> with the goal of selling only electric vehicles in Europe by 2030.</p>\n\n<p><strong>EV Investment</strong></p>\n\n<p>Here is the section everyone is interested in, and one which GM rightly received a lot of hype for when they announced a <a href=\"https://www.cnbc.com/2020/11/19/gm-accelerating-ev-plans-with-additional-7-billion-announces-new-pickup.html\">plan to spend $27B on developing EVs</a> and autonomous vehicles by 2025. After that announcement, GM was viewed by many as the front-runner for EVs among traditional automakers. Not to be outdone, Ford announced a <a href=\"https://media.ford.com/content/fordmedia/fna/us/en/news/2021/02/04/ford-raises-planned-investment-ev-av-leadership.html\">$29B investment in EVs</a> and autonomous vehicles to be spent by 2025. To date, that is the third largest investment in EVs in the world, only falling short of the $86B and $87B investments by the mega-conglomerates VW and HMG respectively.</p>\n\n<p><strong>Revival of Valuable IP</strong></p>\n\n<p>In the last few years, Ford has refocused much of their business on their greatest hits. They’ve cut unpopular IP from their lineup and re-released the Bronco as well as reworked the Mustang into a crossover EV. In my opinion, this demonstrates a greater understanding of their markets and how to capitalize on their most valuable asset, which is their IP. Their most profitable model, the F-150, will be released as an EV in 2022 or 2023, and I expect that the Bronco will also see an EV model in the next few years as well. I believe that Ford has become a leaner and more focused company within the last 3 years and is set to continue their dominance in pick-ups as well as siphon significant market share in the EV and SUV spaces.</p>\n\n<h1>The Power of Partnerships</h1>\n\n<p><strong>Ford, VW, and Argo</strong></p>\n\n<p>Ford, along with fellow automotive titan Volkswagen Group, have both taken <a href=\"https://media.ford.com/content/fordmedia/fna/us/en/news/2020/06/02/volkswagen-investment-argo-ai-ford-self-driving.html\">large stakes</a> in a company dedicated to autonomous driving software called Argo AI. Partnering with a company with considerable resources like VW takes some of the pressure off of Ford to develop this technology solo. While there haven’t been too many details released about this partnership or the progress being made by Argo AI, it is reassuring to know that Ford is actively invested in developing autonomous driving along with another industry leader in VW.</p>\n\n<p><strong>Ford and Google</strong></p>\n\n<p>In February of 2021, Ford and Google announced a <a href=\"https://media.ford.com/content/fordmedia/fna/us/en/news/2021/02/01/ford-google-accelerate-auto-innovation.html\">partnership</a> to place Google’s software and technology in all of Ford’s new vehicles beginning in 2023. The operating platform in these new vehicles will be based off of the Android platform and all new vehicles will come equipped with Alphabet products like Google Cloud, Google Maps, Google Assistant, and the Play Store. The addition of a familiar and established operating system like Android will give Ford vehicles a competitive edge over other automakers who try to create and implement their own subpar operating software (*cough* Toyota *cough*).</p>\n\n<p><strong>Ford and Rivian</strong></p>\n\n<p>Ford made headlines in April 2019 when they invested in Rivian for an undisclosed stake. What is clear from statements made by both CEO’s at the time is that the investment was both for equity as well as a strategic partnership. A planned vehicle by Ford, which has yet to be announced, will be built on Rivian’s unique <a href=\"https://www.forbes.com/sites/edgarsten/2019/04/24/ford-jumps-on-rivians-skateboard/?sh=215fbc2d23ef\">“skateboard”</a> platform. This platform consists of “a flat frame that contains the batteries, suspension, motors and braking” on which the cab rests, and theoretically cuts costs in the manufacturing of EVs due to fewer overall parts in assembly. I suspect that this may be the platform used in the inevitable Bronco EV release, due to the striking similarities in the size and styling of the Bronco and the Rivian R1S. It is also possible that Ford may release an entirely new model on the platform, but that is just my hunch.</p>\n\n<p>The equity stake in Rivian was undisclosed, but I expect that that stake may be worth <a href=\"https://www.cnbc.com/2019/12/23/rivian-scores-1point3-billion-investment-from-trowe-price-others.html\">between $2B and $5B</a> based on the valuation of Rivian at time of investment (~$5B-7B) and now (~$30B-$50B). This equity stake and strategic partnership will serve Ford well in their future development in the EV market.</p>\n\n<h1>Financials and Valuation</h1>\n\n<p><strong>Financial Overview</strong></p>\n\n<p>2020 was a tough year for many industries and the auto sector was no exception. Ford had 4 consecutive quarters of negative EPS, their YOY revenue fell by almost 20% when compared to 2019, and they had to eliminate their dividend in March 2020 for the first time since 2009 when it was eliminated during the Great Recession, before being reinstated in 2012. So where does this leave Ford now?</p>\n\n<p>Despite the blow to revenue in 2020, Ford is emerging leaner and better equipped to dominate the market in 2021 and beyond. Revenue decreased 20% in 2020, and Ford had to take on significant new debt to continue financing operations. However that appears to be true for most other major automakers during the pandemic, so I don’t expect this to be a major factor in determining which automakers will be most successful in the future. I expect that 2021 will be a blockbuster year for Ford as revenues increase to pre-pandemic levels (I expect higher earnings in Q3 and Q4), and they continue to develop the most profitable arms of their business.</p>\n\n<p><strong>Dividend Reinstatement</strong></p>\n\n<p>GM and Ford both eliminated their dividends to survive the pandemic in March 2020, however there is widespread expectation that they will reinstate them sometime this year as revenue begins to pick back up. I personally view this as an incentive to buy Ford before the announcement. If they reinstate their .60 yearly dividend, it would amount to a ~5% annual yield based on the current stock price of 13.37. I expect that the return of their dividend will also attract the return of investors who value dividend stocks which may push the price up further all on its own. I believe this is a mini-catalyst for short term price movement for Ford, and collecting on the dividend won’t hurt either.</p>\n\n<p><strong>Comparison to Other Traditional Automakers</strong></p>\n\n<p>Generally, I like to look at 4 different ratios to quickly judge the valuation of a company compared to their peers in the same industry. Lets compare Ford’s numbers to their closest 5 competitors (Toyota, Honda, VW, GM, Daimler) to get a sense of how fairly they are currently valued. I’m avoiding comparing Ford to newcomers like TSLA, NIO, etc. because frankly the numbers aren’t comparable. Financial data was gathered from Finviz and Yahoo Finance.</p>\n\n<p>Quick definitions of the ratios, with respect to current valuation:</p>\n\n<p>P/S = Share price/Sales per Share (Lower is better)</p>\n\n<p>Forward P/E = Share price/(Estimated net profit for next year/# of outstanding shares) (Lower is better)</p>\n\n<p>Debt-to-Equity = Total debt/shareholder equity (Lower is better)</p>\n\n<p>Current Ratio = Current assets/Current liabilities over the next year (Higher is better)</p>\n\n<p>Price to Book = Share price/Book value per share (Lower is better)</p>\n\n<table><thead>\n<tr>\n<th align=\"left\"><strong>Ratio</strong></th>\n<th align=\"left\"><strong>Ford</strong></th>\n<th align=\"left\"><strong>Toyota</strong></th>\n<th align=\"left\"><strong>Honda</strong></th>\n<th align=\"left\"><strong>VW</strong></th>\n<th align=\"left\"><strong>GM</strong></th>\n<th align=\"left\"><strong>Daimler</strong></th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">P/S</td>\n<td align=\"left\">0.39</td>\n<td align=\"left\">0.99</td>\n<td align=\"left\">0.45</td>\n<td align=\"left\">0.53</td>\n<td align=\"left\">0.66</td>\n<td align=\"left\">0.50</td>\n</tr>\n<tr>\n<td align=\"left\">Forward PE</td>\n<td align=\"left\">8.64</td>\n<td align=\"left\">12.92</td>\n<td align=\"left\">9.24</td>\n<td align=\"left\">10.67</td>\n<td align=\"left\">9.49</td>\n<td align=\"left\">8.87</td>\n</tr>\n<tr>\n<td align=\"left\">Debt/Equity</td>\n<td align=\"left\">5.27</td>\n<td align=\"left\">1.10</td>\n<td align=\"left\">0.97</td>\n<td align=\"left\">1.71</td>\n<td align=\"left\">2.44</td>\n<td align=\"left\">2.60</td>\n</tr>\n<tr>\n<td align=\"left\">Current Ratio</td>\n<td align=\"left\">1.20</td>\n<td align=\"left\">1.10</td>\n<td align=\"left\">1.30</td>\n<td align=\"left\">1.12</td>\n<td align=\"left\">1.00</td>\n<td align=\"left\">1.15</td>\n</tr>\n<tr>\n<td align=\"left\">P/B</td>\n<td align=\"left\">1.73</td>\n<td align=\"left\">1.05</td>\n<td align=\"left\">0.67</td>\n<td align=\"left\">0.80</td>\n<td align=\"left\">1.89</td>\n<td align=\"left\">1.27</td>\n</tr>\n</tbody></table>\n\n<p>&#x200B;</p>\n\n<p>As you can see, Ford has noticeable strengths and weaknesses when it comes to valuation. Strictly looking at revenue metrics like P/S and P/E, Ford is the most undervalued company on this list. They do however carry the largest debt burden of all of the listed companies, so that is something to keep in mind. I’m not particularly worried about their debt situation, as their Current Ratio at 1.20 indicates that they are in no present danger of being crushed by their debt, and I expect that strong future revenue will allow them to dig themselves out of that hole.</p>\n\n<p>Compared to GM, who I believe to be their closest competitor, they are trading at a much lower revenue multiple (0.39 vs 0.66). Even accounting for Ford’s higher debt burden, I believe they should be trading closer to a 0.50 multiple, which puts them more in line with other traditional automakers.</p>\n\n<p>My personal price target: <strong>$17.14/share</strong></p>\n\n<h1>2021 Outlook</h1>\n\n<p><strong>Massive Demand</strong></p>\n\n<p>Ford’s most recent releases the 2021 F-150, the 2021 Bronco Sport, and the 2021 Mustang Mach-E are all flying off dealer’s lots at <a href=\"https://www.fool.com/investing/2021/03/05/demand-looks-very-high-for-fords-tesla-fighting-mu/\">record pace</a>. The auto industry quantifies demand with a specific metric called Time to Turn. This is a measure of how long a vehicle sits on the lot before it is purchased. The industry average Time to Turn is somewhere <a href=\"https://www.edmunds.com/car-news/auto-industry/new-vehicle-inventory-swells-in-february.html\">around 60 or 70 days</a> for new vehicles. Anything under 20 days generally indicates that a specific model is in very high demand. I’ll list the Time to Turn for Ford’s three new models in 2021 below:</p>\n\n<p>2021 Ford F-150: 9 days</p>\n\n<p>2021 Bronco Sport: 13 days</p>\n\n<p>2021 Mustang Mach-E: 4 days (!!!)</p>\n\n<p>As you can see Ford’s recent releases have been massive successes so far, and I expect that as the economy continues to recover from the pandemic that demand will only continue to rise for these models.</p>\n\n<p><strong>7500 tax credit availability</strong></p>\n\n<p>Remember that $7500 federal tax credit that everyone was all excited about when EVs first went to market in the U.S.? Me neither. The reason you may not have heard about this tax credit in awhile is probably due to the fact that the biggest seller of EVs (Tesla) is <a href=\"https://www.cars.com/articles/tesla-tax-credit-is-expiring-heres-everything-shoppers-need-to-know-1420700959540/\">no longer eligible</a> to receive the credit for purchases of their vehicles. The second biggest seller (GM) is about to lose eligibility at the end of this month.</p>\n\n<p>The way this program works is that an auto manufacturer is eligible for the credit for their first 200,000 vehicles sold in the U.S. After that, they are only eligible for state-level tax credits which tend to be much smaller if they exist at all. To date, Ford has only sold a measly 10,000 EVs total in the U.S with around 5,000 of their largely unsuccessful Focus EV and 5,000 of their new 2021 Mach-E. That means they have an enormous 190,000 vehicles left for which their purchasers can be incentivized by the tax credit. In my opinion this gives Ford a massive advantage over their closest competitors (GM and Tesla), and in fact, we are already seeing Ford stealing market share directly from Tesla as it appears that <a href=\"https://www.cnn.com/2021/03/04/business/ford-mustang-mach-e-tesla-market-share/index.html\">nearly 100% of Tesla’s recent loss in market share is attributable to Ford</a>.</p>\n\n<p>Bear Case</p>\n\n<p><strong>Chip Shortage</strong></p>\n\n<p>As I’m sure you’ve heard by now, semiconductor shortages are projected to be a <a href=\"https://www.washingtonpost.com/technology/2021/03/01/semiconductor-shortage-halts-auto-factories/\">massive problem</a> for the auto industry as a whole. Recent estimates put nearly 1 million new vehicles affected by the shortage in Q1 2021 alone across the entire auto sector. Ford has already had to cut shifts at some of their manufacturing plants because they cannot secure enough chips to produce as many vehicles as they’d like. A few automakers like Toyota and Hyundai had the foresight to maintain their semiconductor supply, and thus their 2021 production will not be affected. The chip shortage will surely cut Ford’s top-line revenue, and it is not expected to ease until late 2021 at the earliest.</p>\n\n<p><strong>Battery Supplier Issues</strong></p>\n\n<p>In February 2021, the U.S. International Trade Commission <a href=\"https://www.reuters.com/article/us-lg-chem-sk-innovation-ford/u-s-itc-criticizes-ford-for-pursuing-sk-innovation-battery-deals-idUSKBN2AX00Z\">ruled against battery supplier SK Innovation</a> in their patent battle with competitor LG Chem. SK Innovation is the contracted supplier for batteries for the planned F-150 EV. This caused reasonable consternation among investors who were worried that the F-150 production timeline could be affected. Buried in the ruling however, was a stipulation that SK Innovation could continue to supply Ford with batteries for the F-150 through 2025, which should give Ford time to shift to a new supplier. There is always a chance that the Biden administration overrules the ITC in favor of securing greater production capability for the U.S. Nevertheless, this represents a hurdle that Ford will have to address in the future.</p>\n\n<p><strong>Debt Burden</strong></p>\n\n<p>There’s no way to sugar coat it, Ford has a ton of debt. They were a relatively debt heavy company prior to the pandemic, and that has only become worse. If you look at the company comparisons done above you can see the relatively high debt-to-equity ratio that ford carries compared to other automakers. The good news is that much of that debt isn’t due in the near future and Ford’s outlook is due to improve significantly from the disaster that was 2020.</p>\n\n<p><strong>New Competition (Tesla, Lucid, Rivian, Etc.)</strong></p>\n\n<p>This post has already become obscenely long so I’m not going to go into great detail here. You’ve all heard of these companies and how they intend to disrupt the auto sector, costing traditional automakers market share. There is no doubt that there are more players on the field these days, and Ford and GM will not have a virtual monopoly on the American market anymore. I personally only have high hopes for a few of the newcomers, but they still represent one more obstacle on Ford’s path to success.</p>\n\n<p><strong>Closing</strong></p>\n\n<p>I believe that Ford is currently undervalued and is ready to succeed as a leader in EVs in the future. This does not mean that investing in Ford is a sure thing; parts shortages, a high debt burden, and emerging competition all represent serious threats to Ford’s core business. Nonetheless, I am confident in Ford’s future prospects and consider them to be a strong buy as a long-term investment.</p>\n\n<p><em>Disclosures: I am long Ford at an average cost basis of $10.30. I am not a financial advisor, always do your own due diligence before investing in the market.</em></p>\n</div><!-- SC_ON -->",
  "score": 299,
  "permalink": "/r/stocks/comments/m5kqxa/ford_f_ugly_duckling_to_golden_goose/",
  "subreddit": "stocks",
  "id": "m5kqxa",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147382531
}