{
  "author": "Ketamix",
  "the_new_excerpt": "I wanted to provide a picture of her story, but unfortunately you cannot post\npictures in this sub. Bassically, Kim Kardashian just promotted a shitcoin\ncalled ETHMAX on her instagram story with the premise of being a good coin\nbecause half of the supply was burned recently. Frankly, I'm surprised…",
  "original_created_utc": 1623646285,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "彼女のストーリーを写真で紹介したかったのですが、残念ながらこのサブには写真を掲載できません。\nこのサブでは写真を掲載することはできません。基本的に、Kim Kardashianは自分のインスタグラムのストーリーでETHMAXというクソコインを宣伝しました。\nETHMAXというクソコインをインスタグラムのストーリーで宣伝していました。\n最近、供給量の半分が焼失したからです。率直に言って、驚きました...。",
      "title": "キム・カーダシアンがETHMAXというクソコインをインスタグラムで宣伝中"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想提供一张她的故事的图片，但不幸的是，你不能在这个子栏目中发布\n图片在这个子里。实际上，金-卡戴珊刚刚在她的Instagram故事中宣传了一个名为ETHMAX的狗屎币\n叫做ETHMAX，其前提是要成为一个好币种\n因为最近有一半的供应被烧毁了。老实说，我很惊讶...",
      "title": "金-卡戴珊在Instagram上推广名为ETHMAX的狗屎币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想提供一張她的故事的圖片，但不幸的是，你不能在這個子欄目中發佈\n圖片在這個子裏。實際上，金-卡戴珊剛剛在她的Instagram故事中宣傳了一個名爲ETHMAX的狗屎幣\n叫做ETHMAX，其前提是要成爲一個好幣種\n因爲最近有一半的供應被燒燬了。老實說，我很驚訝...",
      "title": "金-卡戴珊在Instagram上推廣名爲ETHMAX的狗屎幣"
    }
  ],
  "title": "Kim Kardashian promotting shitcoin called ETHMAX on instagram",
  "created_utc": 1623666637,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I wanted to provide a picture of her story, but unfortunately you cannot post pictures in this sub. Bassically, Kim Kardashian just promotted a shitcoin called ETHMAX on her instagram story with the premise of being a good coin because half of the supply was burned recently. Frankly, I&#39;m surprised the people behind this coin had enough money to pay her for this promotion. What do you guys think about this?</p>\n</div><!-- SC_ON -->",
  "score": 882,
  "permalink": "/r/CryptoCurrency/comments/nzey4o/kim_kardashian_promotting_shitcoin_called_ethmax/",
  "subreddit": "CryptoCurrency",
  "id": "nzey4o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009738589
}