{
  "author": "m-ton",
  "original_created_utc": 1631922747,
  "title": "When Patrick O'Brian was revealed to have fabricated his biography in the late-90s (not Irish, not a sailor, not a spy), how much controversy did it cause at the time?",
  "created_utc": 1631936778,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I, like a lot of people here I imagine, am a big fan of Patrick O&#39;Brian&#39;s Aubrey-Maturin series. All I knew of the author was the autobiographical note that was included at the back of one of the printed editions of his books. It basically sets out that (from memory, excuse me if I get this wrong):</p>\n\n<p>- He spent his childhood in Ireland as a member of the landed gentry</p>\n\n<p>- During that childhood, he sailed frequently into the Atlantic on a tall ship (a schooner I think?) so that he could &#39;hand, reef and steer without embarrassment&#39;.</p>\n\n<p>- During World War II, he worked in British intelligence, but didn&#39;t want to talk about it as &#39;the same tactics which have once worked on an enemy may work again in the future.&#39;</p>\n\n<p>I was just Wikipedia&#39;ing something from one of his books and found out that, in 1998, this was all revealed as a fiction. <a href=\"https://en.wikipedia.org/wiki/Patrick_O%27Brian#Media_exposure_and_controversy_in_his_final_years\">There was, apparently, a series of expose articles published that showed he was not from Ireland, had worked as an ambulance driver in London during the blitz and not in intelligence</a>, and that he had either <a href=\"https://en.wikipedia.org/wiki/Patrick_O%27Brian#Sailing_experience\">never sailed or knew nothing about it</a>.</p>\n\n<p>Reading this all was fairly shocking to me in 2021. I, like a lot of people I&#39;m guessing, thought the books were so &#39;accurate&#39; because they drew from a combination of lived experience and research.</p>\n\n<p>&#x200B;</p>\n\n<p>I wasn&#39;t around in 1998, but what was the reaction amongst fans, critics and the various societies that had honored him for his work when this was all made public in the press? Were naval historians of the Revolutionary/Napoleonic Wars period like &#39;Ha! We told you so!&#39; or were they also taken aback (no pun intended)?</p>\n\n<p>&#x200B;</p>\n\n<p>As a secondary question - many people treat the Aubrey/Maturin series as a kind of narrative history or mini-bachelors degree in the Royal Navy from 1800 to 1815. In the present day (noting that they are fictional) are his works highly thought of and seen to be mostly period-accurate by naval historians, or is this more an artefact of good marketing and his claims to be an authoritative source?</p>\n</div><!-- SC_ON -->",
  "score": 120,
  "permalink": "/r/AskHistorians/comments/pqboov/when_patrick_obrian_was_revealed_to_have/",
  "subreddit": "AskHistorians",
  "id": "pqboov",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I, like a lot of people here I imagine, am a big fan of Patrick O'Brian's\nAubrey-Maturin series. All I knew of the author was the autobiographical note\nthat was included at the back of one of the printed editions of his books. It\nbasically sets out that (from memory, excuse me if I get this…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、ここにいる多くの人々と同様に、Patrick O'Brian（パトリック・オブライアン）の\nAubrey-Maturinシリーズの大ファンです。私がこの作家を知っていたのは、本の後ろに付いていた自伝的なメモだけでした。\n著者について知っていたのは、彼の本の印刷版の後ろに付いていた自伝的なメモだけでした。それは\n基本的には次のようなことが書かれています（記憶に頼っていますが、間違っていたらごめんなさい...）。",
      "title": "90年代後半、パトリック・オブライアンが自分の伝記を捏造していたことが明らかになったとき（アイルランド人ではない、水兵でもない、スパイでもない）、当時はどれほどの物議を醸したのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我和这里的很多人一样，我想，我是帕特里克-奥布莱恩的大粉丝\n奥布里-马图林系列。我对作者的了解仅仅是他的自传性说明\n在他的书的一个印刷版本的后面。它\n基本上是这样写的（根据记忆，请原谅我的理解......",
      "title": "当帕特里克-奥布莱恩在90年代末被揭露编造自己的传记时（不是爱尔兰人，不是水手，不是间谍），在当时引起了多少争议？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我和這裏的很多人一樣，我想，我是帕特里克-奧布萊恩的大粉絲\n奧布里-馬圖林系列。我對作者的瞭解僅僅是他的自傳性說明\n在他的書的一個印刷版本的後面。它\n基本上是這樣寫的（根據記憶，請原諒我的理解......",
      "title": "當帕特里克-奧布萊恩在90年代末被揭露編造自己的傳記時（不是愛爾蘭人，不是水手，不是間諜），在當時引起了多少爭議？"
    }
  ]
}