{
  "author": "BigManShaggy13",
  "original_created_utc": 1659877618,
  "title": "AITA for not causing a scene when my girlfriend of 3 years told me she was cheating on me with my best friend?",
  "created_utc": 1659884272,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I (22M) was in a relationship with my now ex (22F) for 3yrs. We got together back in 2014, and she was my first girlfriend, my first kiss, my virginity. We had the best possible relationship we could imagine. We got together on December 15th 2014. About six months into the relationship i promised her i would do anything possible to make her happy. She was there for me when my father died, and was most supportive everytime i would have a hard time missing my mother (i lost my mother in 2012). I was raised that way to always treat women like princesses, and respect the like i would want someone to respect my sister. We had an amazing relationship, we would throw surprises for each other, i would organise picnics, she would organise trips, and we would do anything together. Fast forward to December 15th 2017, it was our 3 year anniversary, and i bought a ring to propose to her. We met up that day, before I went to work, talked, kissed and i left, everything was fine. When i got back from work, i showered, took the ring and met up with her. I planned out the whole night. We were gonna go to her favorite restaurant, after that to the place we first kissed and then to the place i first told her i loved her, that&amp;#39;s where i was gonna pop the question. We didn&amp;#39;t get to do any of that bc when we met up, she told me she wanted to talk to ne about something. She proceeded to tell me that she was cheating me with my best friend and that it was going on for a month now. At first i didn&amp;#39;t believe her, but then she showed me pictures of them kissing, and their texts. I was crushed, but i looked her in the eyes, and reminded her of the promise i gave her. I asked her if she was happy, and she replied that she was. Keep in mind that all of my friends knew and no one wanted to tell me. I&amp;#39;m still not speaking to them, but i say hi when i see her or him on the street. They broke up about a month later btw. She asked me to get back together with her about 2 years ago and i said no and explained to her that what she did killed me, changed me, and that i wouldn&amp;#39;t be able to trust her ever again. She then said i never cared about her because i didn&amp;#39;t rage out when she confessed about her cheating, not knowing that i spent 3 years healing, and crying over the fact that i lost her. So, AITA?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 172,
  "permalink": "/r/NoStupidQuestions/comments/wifcbj/aita_for_not_causing_a_scene_when_my_girlfriend/",
  "subreddit": "NoStupidQuestions",
  "id": "wifcbj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I (22M) was in a relationship with my now ex (22F) for 3yrs. We got together\nback in 2014, and she was my first girlfriend, my first kiss, my virginity. We\nhad the best possible relationship we could imagine. We got together on December\n15th 2014. About six months into the relationship i promised…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私（22M）は、今の元彼（22F）と3年間交際していました。私たちが付き合ったのは2014年のことで\n2014年に付き合い、初めての彼女、初めてのキス、初めての処女でした。僕たちは\n想像を絶する最高の関係でした。私たちが付き合ったのは2014年12月15日。\n2014年15日です。付き合って半年ほど経った頃、僕は約束した...。",
      "title": "3年付き合った彼女に親友と浮気していると言われても騒がなかったのはAITA？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我（22M）与我现在的前夫（22F）有3年的关系。我们早在2014年就在一起了。\n早在2014年，她是我的第一个女朋友，我的初吻，我的处女之身。我们\n我们的关系是我们能想象的最好的。我们是在2014年12月15日在一起的。\n2014年12月15日。在这段关系中，大约6个月，我答应...",
      "title": "当我三年的女友告诉我她在和我最好的朋友偷情时，AITA没有闹事？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我（22M）與我現在的前夫（22F）有3年的關係。我們早在2014年就在一起了。\n早在2014年，她是我的第一個女朋友，我的初吻，我的處女之身。我們\n我們的關係是我們能想象的最好的。我們是在2014年12月15日在一起的。\n2014年12月15日。在這段關係中，大約6個月，我答應...",
      "title": "當我三年的女友告訴我她在和我最好的朋友偷情時，AITA沒有鬧事？"
    }
  ]
}