{
  "author": "R0B0C0P33",
  "original_created_utc": 1632434094,
  "title": "In the aftermath of the 2008 financial crisis, 0 financial people went to prison. But crypto is clearly the problem.",
  "created_utc": 1632449293,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If you were old enough when the 2008 recession started and saw how quickly things were happening, you might have been surprised to hear that over a decade later, not a single person went to prison as a result of their nefarious actions.</p>\n\n<p>You might shrug and say it&#39;s always been that way, but it&#39;s really not. Back in the 1980/90s, after the savings and loans scandal, roughly 1,500 bankers actually went to prison for their actions in defrauding and costing the American public. There was a time when they were willing to hold people accountable.</p>\n\n<p>Since then, deregulation and just making bad actors pay fines has led to a situation where no one feels scared to do anything evil/illegal because no matter what they do, the chance of them personally suffering is laughably small.</p>\n\n<p>The only real thing they worry about is something new taking the place of the corrupt system, so when crypto emerges, gotta go after them. The hypocrisy is just depressing as hell.</p>\n\n<p>&#x200B;</p>\n\n<p>Edit: I stand corrected. One person: Kareem Serageldin is the one person who did go to prison for a short time. Roughly 2 years according to my Internet sleuthing. Far too light and still only one person, but not 0. Thanks for heads-up!</p>\n</div><!-- SC_ON -->",
  "score": 185,
  "permalink": "/r/CryptoCurrency/comments/pu5oer/in_the_aftermath_of_the_2008_financial_crisis_0/",
  "subreddit": "CryptoCurrency",
  "id": "pu5oer",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "If you were old enough when the 2008 recession started and saw how quickly\nthings were happening, you might have been surprised to hear that over a decade\nlater, not a single person went to prison as a result of their nefarious\nactions.\n\nYou might shrug and say it's always been that way, but it's…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2008年の不況が始まったとき、あなたが十分な年齢に達していて、事態がいかに早く進行したかを知っていたとしたら\n10年以上経っても、悪事を働いて刑務所に入った人が一人もいないと聞いて、驚いたかもしれません。\nの結果、一人も刑務所に入らなかったことに驚かれたのではないでしょうか。\n驚いたかもしれません。\n\n今までもそうだったじゃないか、と肩を落とすかもしれませんが、それは...。",
      "title": "2008年の金融危機の後、0人の金融関係者が刑務所に入りました。しかし、暗号が問題であることは明らかです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你在2008年经济衰退开始时已经足够大，并且看到事情发生得如此迅速\n事情发生的速度，你可能会惊讶地听到，超过十年后，没有一个人因为他们的邪恶行为而入狱。\n你可能会惊讶地听到，十多年后，没有一个人因为他们的邪恶行为而被关进监狱。\n行动而入狱。\n\n你可能会耸耸肩，说它一直是这样的，但它是...",
      "title": "在2008年的金融危机之后，有0名金融人士入狱。但加密货币显然是问题所在。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你在2008年經濟衰退開始時已經足夠大，並且看到事情發生得如此迅速\n事情發生的速度，你可能會驚訝地聽到，超過十年後，沒有一個人因爲他們的邪惡行爲而入獄。\n你可能會驚訝地聽到，十多年後，沒有一個人因爲他們的邪惡行爲而被關進監獄。\n行動而入獄。\n\n你可能會聳聳肩，說它一直是這樣的，但它是...",
      "title": "在2008年的金融危機之後，有0名金融人士入獄。但加密貨幣顯然是問題所在。"
    }
  ]
}