{
  "author": "GelDel12",
  "the_new_excerpt": "I could sell at a loss, but I'm not going to. Right now the plan is to basically\ntreat all of this as an extended cycle all the way to 2024, which is the next\ncycle start. All I'm doing is just chilling, accumulating, DCA-ing. If I'm not\nat my goal, I'm not selling.\n\nWeirdly enough, having this…",
  "original_created_utc": 1621915075,
  "localize": [
    {
      "locale": "ja",
      "title": "撤退はしない。すべてを内部に残しているのです。私のポートフォリオの90％は今、損失を出しています。",
      "the_new_excerpt": "損切りして売ることもできるけど、それはしない。今のところ、基本的に計画では\n次の2024年までの延長サイクルとして扱います。\nサイクルスタート。私がやっていることは、ただ冷静に、蓄積し、DCAすることです。もし私が\n目標に到達したら、売らない。\n\n不思議なことに、これを持つと..."
    },
    {
      "locale": "zh",
      "title": "我没有抽身。我把它全部留在里面。我90%的投资组合现在处于亏损状态。",
      "the_new_excerpt": "我可以亏本出售，但我不打算这样做。现在的计划是，基本上\n将所有这些作为一个延长的周期，一直到2024年，也就是下一个\n周期开始。我所做的只是冷静下来，积累，DCA-ing。如果我没有\n我的目标，我就不卖。\n\n奇怪的是，有了这个..."
    },
    {
      "locale": "zh-Hant",
      "title": "我沒有抽身。我把它全部留在裏面。我90%的投資組合現在處於虧損狀態。",
      "the_new_excerpt": "我可以虧本出售，但我不打算這樣做。現在的計劃是，基本上\n將所有這些作爲一個延長的週期，一直到2024年，也就是下一個\n週期開始。我所做的只是冷靜下來，積累，DCA-ing。如果我沒有\n我的目標，我就不賣。\n\n奇怪的是，有了這個..."
    }
  ],
  "title": "I'm not pulling out. I'm leaving it all inside. 90% of my portfolio is at a loss right now.",
  "created_utc": 1621942849,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I could sell at a loss, but I&#39;m not going to. Right now the plan is to basically treat all of this as an extended cycle all the way to 2024, which is the next cycle start. All I&#39;m doing is just chilling, accumulating, DCA-ing. If I&#39;m not at my goal, I&#39;m not selling. </p>\n\n<p>Weirdly enough, having this commitment has made it easier for me to sleep. I barely check charts anymore. </p>\n\n<p>Checking every few hours counts as &quot;barely&quot;, right?</p>\n</div><!-- SC_ON -->",
  "score": 675,
  "permalink": "/r/CryptoCurrency/comments/nkgjv5/im_not_pulling_out_im_leaving_it_all_inside_90_of/",
  "subreddit": "CryptoCurrency",
  "id": "nkgjv5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197387093
}