{
  "author": "vitaminbread",
  "the_new_excerpt": "I was thinking of the treaty of pereyaslav between the Zaporizhian Cossacks and\nMuscovy. The cossack side apparently said that Muscovy would be allied with the\ncossack state, while muscovy's translation apparently said that the cossack\nstate would become under muscoy, essentially the cossack state…",
  "original_created_utc": 1623953992,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が考えていたのは、ザポリジアン・コサックとマスコーヴィチとの間で結ばれたペレヤスラフ条約のことです。\nマスコビーとの間のペレヤスラフ条約を考えていました。コサック側はムスコヴィがコサック国と同盟を結ぶと言っていたようですが\nコサック側は「ムスコヴィがコサック国と同盟を結ぶ」と言い、ムスコヴィ側は「コサック国がムスコヴィの傘下に入る」と訳したらしい。\n国はムスコヴィの下になり、実質的にコサック国になる...と言っていたらしい。",
      "title": "誤った翻訳がひどい結果をもたらした歴史的な例はありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想到的是扎波罗热哥萨克人和莫斯科之间的佩列斯拉夫条约。\n穆斯科维。哥萨克方面显然说，穆斯科维将与哥萨克国家结盟。\n哥萨克国家，而莫斯科的翻译显然是说，哥萨克\n国家将成为Muscoy之下的国家，基本上是哥萨克国家......",
      "title": "有哪些历史上的例子是错误的翻译导致了可怕的结果？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想到的是扎波羅熱哥薩克人和莫斯科之間的佩列斯拉夫條約。\n穆斯科維。哥薩克方面顯然說，穆斯科維將與哥薩克國家結盟。\n哥薩克國家，而莫斯科的翻譯顯然是說，哥薩克\n國家將成爲Muscoy之下的國家，基本上是哥薩克國家......",
      "title": "有哪些歷史上的例子是錯誤的翻譯導致了可怕的結果？"
    }
  ],
  "title": "What are some historical examples where bad translations lead to terrible outcomes?",
  "created_utc": 1623972223,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was thinking of the treaty of pereyaslav between the Zaporizhian Cossacks and Muscovy. The cossack side apparently said that Muscovy would be allied with the cossack state, while muscovy&#39;s translation apparently said that the cossack state would become under muscoy, essentially the cossack state became a protectorate. The translations are still disputed today.</p>\n\n<p>Does anyone in this sub know any famous examples of translation errors that changed the outcome of history? Either in documents or in speech?</p>\n\n<p>Thanks!</p>\n</div><!-- SC_ON -->",
  "score": 109,
  "permalink": "/r/AskHistorians/comments/o23w6j/what_are_some_historical_examples_where_bad/",
  "subreddit": "AskHistorians",
  "id": "o23w6j",
  "is_self": true,
  "media": null,
  "is_video": false
}