{
  "author": "DaddySkates",
  "original_created_utc": 1638308395,
  "title": "How to become a millionaire you may ask? Doing the exact opposite of what this sub says is a good start!",
  "created_utc": 1638394026,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been doing this strategy for a few months now and so far and man...it&amp;#39;s working like a swiss watch.&lt;/p&gt;\n\n&lt;p&gt;Remember the hard ADA shill when it was closing on $3? Mega shills all around, ADA is best, ADA is life, buy before it goes to $5. Then it was LINK mega shill when it reached 30$. Link linking everything together and stuff like that. I still believe in LINK but with way less bullishness.Then VET, the beloved unofficial coin of this sub. It moved but mostly to the right. Or LTO which has been nose diving for a while. ERGO too. All these are super popular here and one mention against them can send you to downvote hell in a few moments.&lt;/p&gt;\n\n&lt;p&gt;If you think fanboyism is real in gaming subs, prepare to witness the knowledge of &lt;a href=\"/r/cc\"&gt;r/cc&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Seriously, I started working exactly the opposite as the sub is saying. Shilling LTO, SELL. Shilling ADA, SELL. FUD on Solana? Buy as much as possible at $60. FUD on LRC at 1$?&lt;/p&gt;\n\n&lt;p&gt;Take this sub with a big pinch of salt when you come looking for advice. It&amp;#39;s a big circlejerk and an echochamber where you really need to filter the comments out a lot in order to find good advice.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 4625,
  "permalink": "/r/CryptoCurrency/comments/r5y6lb/how_to_become_a_millionaire_you_may_ask_doing_the/",
  "subreddit": "CryptoCurrency",
  "id": "r5y6lb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've been doing this strategy for a few months now and so far and man...it's\nworking like a swiss watch.\n\nRemember the hard ADA shill when it was closing on $3? Mega shills all around,\nADA is best, ADA is life, buy before it goes to $5. Then it was LINK mega shill\nwhen it reached 30$. Link linking…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はこの戦略を数ヶ月間続けていますが、今のところ、そして、男...それは\nスイス時計のように作動しています。\n\n3ドルに迫った時のADAのハードシルを覚えていますか？メガシンカしまくり。\nADAは最高だ、ADAは命だ、5ドルになる前に買え。\n30$になったとき。リンクリンク...",
      "title": "どうすれば億万長者になれるのか、そう聞かれることがあります。このサブタイトルに書かれていることと正反対のことをするのが、良いスタートです"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我做这个策略已经有几个月了，到目前为止......它像瑞士手表一样有效。\n它像一块瑞士手表一样有效。\n\n还记得当它接近3美元的时候，ADA的硬性推手吗？巨大的骗局无处不在。\nADA是最好的，ADA是生命，在它涨到5美元之前买入。\n当它达到30美元的时候。链接链接...",
      "title": "你可能会问，如何成为一个百万富翁？做与此子所说的完全相反的事情是一个好的开始！。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我做這個策略已經有幾個月了，到目前爲止......它像瑞士手錶一樣有效。\n它像一塊瑞士手錶一樣有效。\n\n還記得當它接近3美元的時候，ADA的硬性推手嗎？巨大的騙局無處不在。\nADA是最好的，ADA是生命，在它漲到5美元之前買入。\n當它達到30美元的時候。鏈接鏈接...",
      "title": "你可能會問，如何成爲一個百萬富翁？做與此子所說的完全相反的事情是一個好的開始！。"
    }
  ]
}