{
  "author": "fan_of_hakiksexydays",
  "original_created_utc": 1627570017,
  "title": "Let me explain how the mass downvoting, bots, karma, and moon farming work, and where this sub is heading.",
  "created_utc": 1627577741,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h1>The Future:</h1>\n\n<p>If you want to see where this sub is heading. Simply look at the rest of Reddit.</p>\n\n<p>Moons haven&#39;t fundamentally changed anything. They have the same effect as karma points, maybe just more amplified and a little more greed-driven with the monetary incentive added. But the farming is not new, and it&#39;s all the same mechanism.</p>\n\n<p>If you look around Reddit, it&#39;s not always quality content that gets the most votes and visibility. It&#39;s popularity. And there&#39;s always the same handful of topics that keep getting the most votes, along with whatever meme and fad is going on at the time.</p>\n\n<p>That&#39;s the future of Moons. It&#39;s not gonna be so much a reward for quality but popularity.</p>\n\n<p>The more new people we have, the more it&#39;s gonna skew towards popularity. But don&#39;t worry, you&#39;ll still get upvotes for quality. And there will be people like me handing you awards, and downvoting populist garbage to try to even things out.</p>\n\n<h1>The karma:</h1>\n\n<p>There&#39;s a common misconception that karma = upvotes. That&#39;s not the case. We know karma is not 1:1 with votes, we just don&#39;t know the numbers. It&#39;s done with an algorithm. Reddit favors upvotes over downvotes. So downvotes don&#39;t weigh as much. Voting manipulation is also clamped down in your karma. Unbalanced users who heavily downvote, or heavily upvote, may have their votes weigh less.</p>\n\n<p>And the more votes a post gets, the less those votes weigh. So 100 upvotes may get you close to 100 karma. But 20,000 upvotes may only get you under 6,000 karma:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/5bislo6au5e71.png?width=2750&amp;format=png&amp;auto=webp&amp;s=4c946e33d4e5234351cc29821542fc127ca68efc\">https://preview.redd.it/5bislo6au5e71.png?width=2750&amp;format=png&amp;auto=webp&amp;s=4c946e33d4e5234351cc29821542fc127ca68efc</a></p>\n\n<h1>The Downvotes:</h1>\n\n<p>Because moon distribution is based on karma and not upvotes, a lot of those nasty downvote bots and mass downvoters don&#39;t actually get counted. So we are pretty safe from downvotes, even if we can&#39;t see it.</p>\n\n<p>You may see your posts get a lot of 0 and -1, but your karma may actually be well into the positives. Ever noticed distributions like the last one, where the downvoting was really heavy handed, yet got a lot more karma than expected? You can thank the Reddit algorithm for that.</p>\n\n<p>Mass downvoters weigh very little on your karma. And it works too with voting manipulation of people upvoting their own posts, or small groups of people upvoting each other.</p>\n\n<p>That&#39;s why it&#39;s not a good idea to replace the karma system for Moons, for a system that only counts upvotes, as some proposals have tried to do. Because then there&#39;s no algorithm anymore to stop voting manipulation.</p>\n\n<p><em>edit: while downvotes are probably not affecting karma as much as many people think, they are stil an issue for post visibility. That&#39;s why it&#39;s a good idea to check NEW for good quality posts, and help those with awards. Awards don&#39;t count towards Moons, but help with visibility.</em> </p>\n\n<h1>Who are the downvoters:</h1>\n\n<p>In this part I don&#39;t have a lot of facts. I&#39;m gonna get more into speculation, so take it with a pinch of salt.</p>\n\n<p>If you&#39;re wondering where the downvoting comes from, it&#39;s probably not bots. People who were here last November will probably know what bots downvoting looks like. Every single comment in the daily is in the negatives, with half of them being -5 or more. It&#39;s possible that bots may have been more discrete now. But why use a bot just to downvote in small quantities.</p>\n\n<p>The downvoting probably comes in big part from brigading. There&#39;s a lot of maximalist subs that hates this sub. Many are aware of our moons and think they can downvote them away. Safemoon has a serious grudge against us, because we keep mentioning they are a scam. And they frequently talk about us. And there have been posts on there for brigading this sub. Others like Shiba army hates us for the same reason. The increase in downvote  seem to have also coincided with the drop of Doge.</p>\n\n<p>Another source of downvoters comes from people from our sub. And for the Daily Discussion, it seems to come from a group who use mostly just the main page. Some of them have expressed a degree of contempt for the Daily. Even trying to push proposals targeting people in the Daily. Their aim is to reduce the karma earned there, so they can get a bigger share of the distribution with their posts. There is an easy way to moon farm on there by just copy and pasting links every day. And the karma earned by the big activity in the Daily gets in the way of that.</p>\n\n<h1>Moon Farming</h1>\n\n<p>Moon participation is not the same thing as moon farming. The term moon farming is now being used for anyone who is just participating a lot. When moon farming was originally designating people who use more subversive methods, like plagiarized content, even reposting other users popular posts, fake sob stories, or heavily commenting and posting links. And anything like easy moon farming techniques, like complaining about downvotes and claiming they are upvoting every posts.</p>\n\n<p>Moon farming is not gonna go away. It&#39;s part of the sub now. So it&#39;s something we&#39;ll have to accept.</p>\n\n<p>Votes aren&#39;t gonna be enough to stop them, since they are subversive about it, and will even post popular topics. There is a the 1K post limit, and the 15K karma limit that keep them from having too big of an effect on the distribution. There is probably still a need to limit number of comments, and also stop counting karma for deleted posts. It&#39;s too easy for them to repost popular links, memes, etc, that will get a lot of upvotes, and get deleted much later. But they keep the karma, and keep on spamming that stuff.</p>\n\n<p>I think in the future some degree of moon farming will be accepted. It&#39;s more of the moon farming that goes too far that will need to be dealt with.</p>\n</div><!-- SC_ON -->",
  "score": 360,
  "permalink": "/r/CryptoCurrency/comments/otyw80/let_me_explain_how_the_mass_downvoting_bots_karma/",
  "subreddit": "CryptoCurrency",
  "id": "otyw80",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "THE FUTURE:\n\nIf you want to see where this sub is heading. Simply look at the rest of Reddit.\n\nMoons haven't fundamentally changed anything. They have the same effect as karma\npoints, maybe just more amplified and a little more greed-driven with the\nmonetary incentive added. But the farming is not…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "THE FUTURE。\n\nこのサブ機の方向性を知りたいなら 単にRedditの残りの部分を見てください。\n\nムーンは根本的には何も変えていません。カルマポイントと同じ効果があります。\nカルマポイントと同じ効果がありますが、金銭的なインセンティブが加わったことで、より増幅され、より貪欲になったのかもしれません。\n金銭的なインセンティブが加わることで、より増幅され、より貪欲になります。しかし、農業は...",
      "title": "大量のダウンボーティング、ボット、カルマ、ムーンファーミングの仕組みと、このサブがどこに向かっているのかを説明しましょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "未来。\n\n如果你想看看这个子的发展方向。只需看一下Reddit的其他部分。\n\n月亮并没有从根本上改变什么。它们的效果与业力\n积分的效果是一样的，只是在金钱的刺激下被放大了，变得更加贪婪了。\n金钱激励。但耕种并不是...",
      "title": "让我来解释一下大规模降票、机器人、因果关系和月球耕作是如何运作的，以及这个子的走向。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "未來。\n\n如果你想看看這個子的發展方向。只需看一下Reddit的其他部分。\n\n月亮並沒有從根本上改變什麼。它們的效果與業力\n積分的效果是一樣的，只是在金錢的刺激下被放大了，變得更加貪婪了。\n金錢激勵。但耕種並不是...",
      "title": "讓我來解釋一下大規模降票、機器人、因果關係和月球耕作是如何運作的，以及這個子的走向。"
    }
  ]
}