{
  "author": "Stye88",
  "original_created_utc": 1633697434,
  "title": "So when will this BS with 'not financial advice' end?",
  "created_utc": 1633779043,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Why does every conversation about crypto still need this mantra is beyond me. It&#39;s repeated ad nauseam like some gag reflex, even though everyone knows this changes nothing and people will take those things as financial advice, education or whatever they want to take it as, including &#39;knowing what others&#39; perspective is&#39;. </p>\n\n<p>If you have a driving license it doesn&#39;t mean  you&#39;re a driving instructor. But nobody will hunt you down if you give driving tips, or make a youtube channel where you mention your driving technique, or just make an opinion on what your favorite car is. Same goes for every profession imaginable to men, expect interestingly the one where you get a certificate and you are told to guide people&#39;s money where it pleases the banks, elites and institutions. </p>\n\n<p>I don&#39;t know if anybody&#39;s been prosecuted for writing or talking about their favorite altcoin without saying those holy words, but can&#39;t we have some legislation that normalizes this BS? Or will the bull run end the moment some youtuber forgets to say they&#39;re not a financial advisor and they get crucified on stream for having financial thoughts without a license?</p>\n\n<p><em>Disclaimer: This post is not a financial, cooking, living, driving, hunting, religion-related advice. It&#39;s not advice on advice, nor is a claim or admission of knowing instances of financial, cooking, living, driving, hunting, religion related advice being propagated without holding necessary license to provide financial, cooking, living, driving, hunting or religion related advice.</em></p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/q3x387/so_when_will_this_bs_with_not_financial_advice_end/",
  "subreddit": "CryptoCurrency",
  "id": "q3x387",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Why does every conversation about crypto still need this mantra is beyond me.\nIt's repeated ad nauseam like some gag reflex, even though everyone knows this\nchanges nothing and people will take those things as financial advice, education\nor whatever they want to take it as, including 'knowing what…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "なぜcryptoに関するすべての会話にこのマントラが必要なのか、私には理解できません。\n誰もがこれでは何も変わらないし、人々はこれらのことを金融上のアドバイスや教育として受け取ることになると知っているにもかかわらず、ギャグ反射のように何度も繰り返されます。\n何も変わらないし、人々はこのようなことを金融上のアドバイスや教育、あるいは「知っている」ということも含めて好きなように受け止めるだろう。\nあるいは、「何を知っているか」を含めて、自分の好きなように受け止めます。",
      "title": "では、この「財務上のアドバイスではない」というBSはいつ終わるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "为什么每次关于加密货币的谈话仍然需要这个咒语，我不明白。\n这句话被反复强调，就像一些插科打诨的反射，尽管每个人都知道这\n改变不了什么，人们会把这些东西当作金融建议、教育\n或任何他们想要的东西，包括 \"知道什么......\"。",
      "title": "那么，这种 \"非财务建议 \"的废话何时才能结束？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "爲什麼每次關於加密貨幣的談話仍然需要這個咒語，我不明白。\n這句話被反覆強調，就像一些插科打諢的反射，儘管每個人都知道這\n改變不了什麼，人們會把這些東西當作金融建議、教育\n或任何他們想要的東西，包括 \"知道什麼......\"。",
      "title": "那麼，這種 \"非財務建議 \"的廢話何時才能結束？"
    }
  ]
}