{
  "author": "greensymbiote",
  "the_new_excerpt": "Paysafe offers a unique combination of fintech, crypto, iGaming, sports betting\nand banking all rolled into one stock. This is why NBC’s Cramer recently said,\n“There is something about Paysafe that may be the ultimate stock for this\nmoment.” Veteran market analyst Steve Grasso calls for $45-50…",
  "original_created_utc": 1618417918,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Paysafeは、フィンテック、暗号、iGaming、スポーツベッティングのユニークな組み合わせを提供しています。\nと銀行のすべてを一つの銘柄にまとめています。そのため、NBCのクレイマー氏は最近こう言っています。\n\"Paysafeには、この瞬間のための究極の銘柄となりうる何かがある。\n」と述べています。ベテラン市場アナリストのスティーブ・グラッソ氏は、45～50ドルと呼びかけています...。",
      "title": "更新されたPaysafe DD： 中長期的にホールド。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Paysafe提供独特的金融科技、加密技术、iGaming、体育博彩的组合。\n和银行业都卷进了一只股票。这就是为什么NBC的Cramer最近说。\n\"贝杉 \"有一些东西，可能是这只股票的终极目标。\n的时刻。\" 资深市场分析师Steve Grasso呼吁45 -50美元... ...",
      "title": "更新后的支付宝DD：中长期持有。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Paysafe提供獨特的金融科技、加密技術、iGaming、體育博彩的組合。\n和銀行業都捲進了一隻股票。這就是爲什麼NBC的Cramer最近說。\n\"貝杉 \"有一些東西，可能是這隻股票的終極目標。\n的時刻。\" 資深市場分析師Steve Grasso呼籲45 -50美元... ...",
      "title": "更新後的支付寶DD：中長期持有。"
    }
  ],
  "title": "Updated Paysafe DD: Medium to long term hold.",
  "created_utc": 1618449444,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Paysafe  offers a unique combination of fintech, crypto, iGaming, sports betting  and banking all rolled into one stock.  This is why NBC’s Cramer  recently said, “There is something about Paysafe that may be the  ultimate stock for this moment.” Veteran market analyst Steve Grasso  calls for $45-50 saying, “It’s the most excited I’ve been about a stock  in a long time.” So why is that?</p>\n\n<p>Updated DD:</p>\n\n<p>Partnered  with Coinbase, Roblox, Draftkings, Spotify, Fortnight, Amazon, Twitch,  Xbox, bet365, ApplePay, Youtube, Visa, Betfair, PayLease, ESL Gaming,  etc.</p>\n\n<p>Global electronic payment  platform with integrated cloud technology offering migration of eCash,  integration of payment methods, cross-border payments and expansion into  global banking as a service (with proprietary risk management enabling  mobile e-commerce for the 1.7 billion ”unbanked.”)</p>\n\n<p>$58  trillion TAM.  Fund manager Cathie Wood: “Fintechs are going to gut  banks.” Jackie Reses, board member of the SF Federal Reserve predicts a  “$16 trillion market cap wholesale transition” of fintechs “taking over  and revolutionizing banking”</p>\n\n<p>No. 1  global leader in iGaming eCash network. “At Paysafe, the iGaming market  volume was estimated to be $3.4 billion in 2019, and is now projected  to reach $47 billion in 2025.”</p>\n\n<p>No.  2 global digital wallet with presence in 120 countries. Owns Neteller  and Skrill, winner “Best Digital Wallet” for “best consumer take up”,  “most innovative technology” with “greatest potential to disrupt current  ecosystems.”</p>\n\n<p>No. 4 globally in integrated merchant processing</p>\n\n<p>Enabled for crypto-to-crypto trading (Bitcoin &amp; 26 other crypto-currencies)</p>\n\n<p>Winner “Best Omni-Channel Payment Solution”, “Payment Processor of the Year,” and “Best Payment Method”</p>\n\n<p>Rapidly  expanding in US with new partnerships (last 3 months: Coinbase,  Microsoft, Luckbox, Amelco, Pointsbet, Virginia Lotto) &amp; new  legalized sports betting (this month: NY, WY, NH)</p>\n\n<p>Trustpilot  in Europe (where more commonly used) rates Paysafe as “Excellent”  (4.7/5 stars) with over 24,000 reviews, and Skrill as “great” (4.2/5  stars) with over 17,000 reviews, while PayPal is rated &quot;poor&quot; (1.2/5  stars) with over 17,000 reviews.</p>\n\n<p>Bill  Foley, Paysafe&#39;s Chairman of the Board, has a proven track record in  generating rapid synergistic inorganic growth. Over the last five years  Foley has grow Ceridian 3.3X ($4.2B to $14B), Dun &amp; Bradstreet 5.6X  ($2B to $11.3B), and Black Knight 8.7X ($1.6B to $14B). He also grew FIS  from $2.5 billion to over $91 billion (36.4X). He says, “Those  characteristics of FIS are right in line with what we plan on doing with  Paysafe.”</p>\n\n<p>Foley on Paysafe: “It’s  a fortress. It’s got a moat…We have a proven strategy of winning as new  global markets open. And most importantly, we have unrivaled regulatory  risk and technical expertise…It’s going to be a land grab…I have a  vision that we should be THE digital wallet… It’s our job to be there  first and to make sure we dominate. We’re focusing on gaming,  particularly sportsbetting, in the United States as it becomes legal and  we’ve got a wide landscape we can attack. It’s pretty exciting.”</p>\n\n<p>Analyst  coverage: “We believe PSFE represents a relatively scarce asset within  the payments industry given its unique business strategy, geographical  footprint, and focus on the iGaming industry. Our forecasts imply  revenue growth at the high-end of management&#39;s guidance and we believe  there is upside to our forecasts in the event of state-level  legalization of iGaming. PSFE operates in high-growth verticals, has a  unique advantage in its consumer and merchant facing solutions, and  offers exposure to a secular growth opportunity in the potential  legalization of iGaming in the United States.&quot;</p>\n\n<p>Projected $1.5 billion revenue, $362 million free cash flow, 30-35% margins, $105 billion transactional volume</p>\n\n<p>Paysafe’s share price with average of sector peer multiples:</p>\n\n<p>EV/EBITDA ratio : $122.09</p>\n\n<p>EV/Rev ratio : $83.91</p>\n\n<p>EV/FCF ratio : $87.86</p>\n\n<p>Average: $97.95</p>\n\n<p>&#x200B;</p>\n\n<p>After eliminating outliers with highest multiples:</p>\n\n<p>EV/EBITDA ratio :$50.75</p>\n\n<p>EV/Rev ratio : $44.64</p>\n\n<p>EV/FCF ratio : $44.18</p>\n\n<p>Average :$46.52</p>\n\n<p>&#x200B;</p>\n\n<p>Valuation notes:</p>\n\n<ol>\n<li>Based on low end of Paysafe&#39;s projections</li>\n<li>From  published data on PayPal, Square, Nuvei, Repay, Shift4, Adyen, Affirm,  bill, GPN, Paysign with a collective revenue growth rate of ~12.5%.  Paysafe’s 10.6% rev growth projection (conservatively pegged to  fintech/online commerce) excludes planned inorganic growth and projected  10X iGaming growth (55% CAGR)</li>\n<li>Around half of these competitors report negative free cash flow and negative EBITDA growth, unlike Paysafe</li>\n</ol>\n\n<p>Recent signals of Blackstone/CVC’s long-term hold:</p>\n\n<p>Last  week, Blackstone Senior Managing Director Eli Nagler said “We believe  Paysafe has a long runway for further growth and look forward to  remaining part of the team and seeing their continued success as a  public company.”</p>\n\n<p>FTAC’s Board of  Directors’ Reasons for the Approval of the Business Combination:  “Commitment of Paysafe’s Owners. The FTAC Board believes that the CVC  Investors, the Blackstone Investors and other current indirect  stockholders of PGHL continuing to own a substantial percentage of the  post-combination company on a pro forma basis reflects such  stockholders’ belief in and commitment to the continued growth prospects  of Paysafe going forward.”</p>\n</div><!-- SC_ON -->",
  "score": 77,
  "permalink": "/r/investing/comments/mquayi/updated_paysafe_dd_medium_to_long_term_hold/",
  "subreddit": "investing",
  "id": "mquayi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566617808
}