{
  "author": "KungLeon99",
  "original_created_utc": 1638822570,
  "title": "Has peaceful protest lost its effectiveness in the US?",
  "created_utc": 1638852169,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know if people outside of the area realize, but there is a &amp;quot;March on Washington&amp;quot; every week. (Especially when the weather is nice.) Large crowds can get a permit and stake out the Washington Monument or Lincoln Memorial, smaller groups protest by the Capitol, White House, or some other such place.&lt;/p&gt;\n\n&lt;p&gt;Some of you may have attended the &amp;quot;Rally to Restore Sanity&amp;quot;, notice how it had little to no effect on the national discourse? None of them do.&lt;/p&gt;\n\n&lt;p&gt;Recently a man landed a gyrocoptor on the White House lawn. The media seemed more focused on his vehicle than his message. Can we honestly say that anything is likely to result from this man risking his life?&lt;/p&gt;\n\n&lt;p&gt;I theorize that the Civil Rights protests of the sixties were so effective due to the juxtaposition of nonviolent protestors and violent police reaction. But the powers that be have learned their lessons. You can express your freedom of speech in politically proper ways, get a permit, have your little protest without bothering anyone or disrupting commerce, but how much good will that really do your cause?&lt;/p&gt;\n\n&lt;p&gt;When was the last time a peaceful protest was actually instrumental in change?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 110,
  "permalink": "/r/TrueAskReddit/comments/ragvpz/has_peaceful_protest_lost_its_effectiveness_in/",
  "subreddit": "TrueAskReddit",
  "id": "ragvpz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I don't know if people outside of the area realize, but there is a \"March on\nWashington\" every week. (Especially when the weather is nice.) Large crowds can\nget a permit and stake out the Washington Monument or Lincoln Memorial, smaller\ngroups protest by the Capitol, White House, or some other such…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "地域外の方はご存知ないかもしれませんが、「マーチ・オン・ザ・イヤー」というのがあります。\n毎週「ワシントン」を開催しています。(特に天気の良い日は）大勢が集まることで\n許可を得て、ワシントン記念塔やリンカーン記念館を張り込みます。\n国会議事堂やホワイトハウスのそばで抗議するグループなど。",
      "title": "アメリカでは、平和的な抗議活動は効果を失ったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不知道该地区以外的人是否意识到，但每周都有一个 \"向华盛顿进军 \"活动。\n华盛顿\"，每周都有。(特别是在天气好的时候）。\n大的人群可以获得许可，在华盛顿纪念碑或林肯纪念堂前站岗，小的人群可以在华盛顿纪念碑前站岗。\n较小的团体在国会大厦、白宫或其他类似的地方进行抗议。",
      "title": "和平抗议在美国是否已失去效力？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不知道該地區以外的人是否意識到，但每週都有一個 \"向華盛頓進軍 \"活動。\n華盛頓\"，每週都有。(特別是在天氣好的時候）。\n大的人羣可以獲得許可，在華盛頓紀念碑或林肯紀念堂前站崗，小的人羣可以在華盛頓紀念碑前站崗。\n較小的團體在國會大廈、白宮或其他類似的地方進行抗議。",
      "title": "和平抗議在美國是否已失去效力？"
    }
  ]
}