{
  "author": "Many_Scratch2269",
  "original_created_utc": 1642763475,
  "title": "The market is crashing, and so is Crypto.",
  "created_utc": 1642775887,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The harsh truth is, the Fed is tightening its monetary policies and they&amp;#39;re going to be raising interest rates very soon. The inflation rate is now too much to ignore as the people realize that their buying power is deteriorating faster and faster with little being done about it. As money is harder to get with the Fed reducing its balance sheet, there will be less money to invest into Crypto and the market.&lt;/p&gt;\n\n&lt;h1&gt;The Crash Has Already Started&lt;/h1&gt;\n\n&lt;p&gt;When the Fed announced it was going to be raising interest rates, I warned about a market crash in a post I made just 10 days ago. Unfortunately, the crash I was talking about has already started as the stock market has started going down very intensely. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/c1prsr60x0d81.png?width=843&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=0b0b9fcffc58081d9477139f54bf4334b97e94c3\"&gt;Nasdaq Index Falling&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;The pace at which the stock market is going down can very likely cause a situation like we&amp;#39;ve seen in 2008. This is going to cause panic and sell offs among people. We can already see people cashing out their stock market gains due to recent price action.&lt;/p&gt;\n\n&lt;h1&gt;Surging Inflation and Market Crash&lt;/h1&gt;\n\n&lt;p&gt;If we see the history, every time there was high inflation, the Fed artificially triggered a market crash by aggressively increasing interest rates.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/wd2srkb9x0d81.png?width=982&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=628ff4587a8298793996352607cec9b84c928f16\"&gt;Inflation and Interest rate correlation&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;This rise in interest rate and the planned decrease of the Fed&amp;#39;s balance sheet is going to have a severe impact on the market as people start borrowing less, spending less and investments into all assets start to dwindle.&lt;/p&gt;\n\n&lt;h1&gt;Biden Approval Rating&lt;/h1&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/tbvvccadx0d81.png?width=1281&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=e10b55e73781fccb335a8fb7f7203a709023a84b\"&gt;Approval Ratings Fall Sharply Due To Inflation Concerns&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;With more and more inflation, people are losing trust in the Government and the approval rating is going down. The main reason behind this huge fall in approval rating is inflation, and the government needs to tackle inflation if they want to keep their approval rating from falling even lower as the public takes notice of their bills. The approval rating is a sign that the government needs to do tackle inflation if it wants to keep public support.&lt;/p&gt;\n\n&lt;h1&gt;The Sell-off and the Opportunity&lt;/h1&gt;\n\n&lt;p&gt;With the market crash ahead being very likely, people are taking their money out faster and faster. The Fed is no longer giving them free money very soon. The amount of people that are buying assets very low considering the current situation, and it is likely going to start going down as the interest rates are yet to be increased, which is when we will see the peak effects of the upcoming crash.&lt;/p&gt;\n\n&lt;p&gt;However, when crashes are at their peak, they leave most assets EXTREMELY undervalued. These are the times when you want to dump money into things like Crypto, which can rise extremely fast during a bullish market.&lt;/p&gt;\n\n&lt;h1&gt;Crypto&amp;#39;s Correspondence With the Stock Market&lt;/h1&gt;\n\n&lt;p&gt;The Cryptocurrency market is strongly correlated with the stock market, especially after more and more institutions have started to invest in Crypto. The Crypto market WILL react if there is a downtrend in the general economy. That is basically the reason we saw another dip in Crypto&amp;#39;s prices today.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TLDR&lt;/strong&gt;: The Fed will be tightening its monetary policies due to inflation and the stock market has started to crash. With the stock market starting to go down, we&amp;#39;re already seeing the Crypto market react today, and unfortunately if the general market continues to dip, so will Crypto.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 1891,
  "permalink": "/r/CryptoCurrency/comments/s98fhs/the_market_is_crashing_and_so_is_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "s98fhs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The harsh truth is, the Fed is tightening its monetary policies and they're\ngoing to be raising interest rates very soon. The inflation rate is now too much\nto ignore as the people realize that their buying power is deteriorating faster\nand faster with little being done about it. As money is harder…"
}