{
  "author": "Megatron_overlord",
  "the_new_excerpt": "Ok, you've been played. You didn't even read any articles, you saw a bunch of\nposts \"fuck Michael Jordan\", you googled around and found your confirmation\nbias. Michael Jordan personally shorted GME!\n\nTL DR: You didn't check the sources. Well, too bad, because the whole story is\nfake news. They are…",
  "original_created_utc": 1616851729,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，你被耍了。你甚至没有看任何文章，你看到的是一堆的\n\"他妈的迈克尔-乔丹 \"的帖子，你去谷歌周围，发现你的确认。\n的偏见。迈克尔-乔丹亲自做空GME!\n\nTL DR：你没有检查消息来源。那么，太糟糕了，因为整个故事是\n假新闻。他们是...",
      "title": "迈克尔-乔丹与GameStop的关系没有得到证实。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，你被耍了。你甚至沒有看任何文章，你看到的是一堆的\n\"他媽的邁克爾-喬丹 \"的帖子，你去谷歌周圍，發現你的確認。\n的偏見。邁克爾-喬丹親自做空GME!\n\nTL DR：你沒有檢查消息來源。那麼，太糟糕了，因爲整個故事是\n假新聞。他們是...",
      "title": "邁克爾-喬丹與GameStop的關係沒有得到證實。"
    }
  ],
  "title": "Michael Jordan has NO proven connection to GameStop",
  "created_utc": 1616887633,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Ok, you&#39;ve been played. You didn&#39;t even read any articles, you saw a bunch of posts &quot;fuck Michael Jordan&quot;, you googled around and found your confirmation bias. Michael Jordan personally shorted GME!</p>\n\n<p>TL DR: You didn&#39;t check the sources. Well, too bad, because the whole story is fake news. They are just looking for clicks and Gamestop generates clicks. Michael Jordan is a celebrity, like Kim Kardashian. That&#39;s enough. Even heard about Beyonce&#39;s divorce?</p>\n\n<p>Let&#39;s review the facts. Quote from one of the articles:</p>\n\n<p><em>&quot;Michael Jordan sold a stake in the Charlotte Hornets in 2019 to Gabe Plotkin and Daniel Sundheim&quot;.</em> </p>\n\n<p>That&#39;s it for the facts. Plotkin name. Plotkin gave Jordan some money in exchange for a stake in a sports team TWO YEARS AGO. Jordan probably doesn&#39;t even remember his face by now. Oh, and Jordan lost some money, no one knows the details because why would they know?</p>\n\n<p>Is it enough to spin a story around it? No. But we&#39;ll do it anyway by implying it indirectly and by making speculative bullshit connections and by misleading headlines, like we&#39;ve done every day with Beyonce&#39;s divorce for over a decade now.</p>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>HEADLINE: <em>Michael Jordan Is Directly Connected to the GameStop Trading War and Has Been Bleeding Money for the Last Year</em> </p>\n</blockquote>\n\n<p>Text of the article two scrolls lower: <em>While Michael Jordan himself didn’t lose any money during the GameStop trade war (that we know of anyway).</em> </p>\n\n<p>So you don&#39;t know anything. That enough, thank you. Busted.<br/>\n_______________________________________ </p>\n\n<blockquote>\n<p>HEADLINE: <em>Michael Jordan net worth: NBA legend down $500M in the last year, and GameStop stock could be part of it.</em> </p>\n</blockquote>\n\n<p>It could be, it could be, OR it could NOT be. Like Shakespeare. Can you prove it? No? Busted.<br/>\n_______________________________________ </p>\n\n<blockquote>\n<p>HEADLINE: GameStop Stocks May Have Cost Michael Jordan Half a Billion Dollars </p>\n</blockquote>\n\n<p>May have or may have not. You don&#39;t know, so please. Busted.<br/>\n_______________________________________ </p>\n\n<blockquote>\n<p>HEADLINE: Is the GameStop Saga Behind the Bizarre Net Worth Fall of Michael Jordan?</p>\n</blockquote>\n\n<p>No, it is not. Can you prove it? No? Busted.<br/>\n_______________________________________ </p>\n\n<blockquote>\n<p>HEADLINE: We’ve all heard about the Gamestop stock price shooting up. It seems to be one of the reasons why Michael Jordan is worth $500 million less </p>\n</blockquote>\n\n<p>It seems to be? Can you prove it? No? Busted.<br/>\n_______________________________________</p>\n\n<p>You get the idea. They just copy the clickbait from one another, but they know it is bullshit. Always check the source, question everything, trust no one, be on guard for bluffs, people.<br/>\nNew shit might come to light, man. But until then, that&#39;s just yellow press.</p>\n</div><!-- SC_ON -->",
  "score": 1982,
  "permalink": "/r/wallstreetbets/comments/medswq/michael_jordan_has_no_proven_connection_to/",
  "subreddit": "wallstreetbets",
  "id": "medswq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357147077
}