{
  "author": "DetroitMotorShow",
  "the_new_excerpt": "Its just not the place for NY AG's to issue a \"warning\" against an entire asset\nclass that many institutions are investing in today and giants like Fidelity\ncall digital gold and recommend their investors to have a position along with\ndebt component of their portfolio.\n\nWhats worse, the NY State…",
  "original_created_utc": 1614621684,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "它只是没有地方纽约总检察长发布一个 \"警告 \"对整个资产\n类，如今很多机构都在投资，而像富达这样的巨头企业\n称数字黄金，并建议其投资者持仓，随着\n其投资组合中的债务部分。\n\n更糟糕的是，纽约州... ...",
      "title": "纽约AG刚刚在没有任何依据的情况下，对投资加密货币发出了全面警告。她和埃隆-马斯克一样，都是操纵市场的罪人。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "它只是沒有地方紐約總檢察長髮佈一個 \"警告 \"對整個資產\n類，如今很多機構都在投資，而像富達這樣的巨頭企業\n稱數字黃金，並建議其投資者持倉，隨着\n其投資組合中的債務部分。\n\n更糟糕的是，紐約州... ...",
      "title": "紐約AG剛剛在沒有任何依據的情況下，對投資加密貨幣發出了全面警告。她和埃隆-馬斯克一樣，都是操縱市場的罪人。"
    }
  ],
  "title": "The NY AG just issued a blanket warning against investing in Cryptocurrencies, without any basis. She is just as guilty as Elon Musk for market manipulation",
  "created_utc": 1614634547,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Its just not the place for NY AG&#39;s to issue a &quot;warning&quot; against an entire asset class that many institutions are investing in today and giants like Fidelity call digital gold and recommend their investors to have a position along with debt component of their portfolio.</p>\n\n<p>Whats worse, the NY State already issues BitLicense, and NY AG&#39;s statement that investing in cryptocurrencies is dangerous contradicts the very purpose why BitLicense is issued in the first place. </p>\n\n<p>Meanwhile the State operates its own lottery ticket scheme: <a href=\"https://nylottery.ny.gov\">https://nylottery.ny.gov</a></p>\n\n<p>NY AG is not a licensed financial advisor to even issue such statements. Absolutely reprehensible action by self proclaimed &quot;saviour of investors&quot;. Multiple banks in her jurisdiction have been found to have laundered money for drug cartels and terrorists. As someone so obsessed with protecting investors, she seems rather not bothered with whats going on with these banks that launder cartel money. </p>\n\n<p>You spend 2.5 years and millions of dollars investigating Tether, for a fucking slap on the wrist fine that concluded with Tether not even having to admit they did anything wrong. </p>\n\n<p>Fuck you, Letitia James.</p>\n</div><!-- SC_ON -->",
  "score": 463,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/1GfivtpPOTwlSKMFkZTKwHno6ss8vJmilb3VGH0DeRY.jpg?auto=webp&s=86ffaa2b8c45c7c50c6e936161052cb85d845658",
          "width": 300,
          "height": 300
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/1GfivtpPOTwlSKMFkZTKwHno6ss8vJmilb3VGH0DeRY.jpg?width=108&crop=smart&auto=webp&s=3e76a1cf17382aaa746c40c35d1422224948925e",
            "width": 108,
            "height": 108
          },
          {
            "url": "https://external-preview.redd.it/1GfivtpPOTwlSKMFkZTKwHno6ss8vJmilb3VGH0DeRY.jpg?width=216&crop=smart&auto=webp&s=750ca399a0482c3d08d313325c00e84aa41f75e9",
            "width": 216,
            "height": 216
          }
        ],
        "variants": {},
        "id": "JTXd6LEBSrSNTbTYYOdRTTTIWFSugd_ONRCNKlMQ6iY"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/lvfs0v/the_ny_ag_just_issued_a_blanket_warning_against/",
  "subreddit": "CryptoCurrency",
  "id": "lvfs0v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937738009
}