{
  "author": "GMEgotmehere",
  "the_new_excerpt": "I do not claim to be a bear or a bull in this market. I am just along for the\nride but some of the feel I get from the media and the public remind me a lot of\nthe 2008 crisis. Well more so the recovery from the crisis. I was probably the\nage of the average reddit user trading today when it happened.…",
  "original_created_utc": 1616104517,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我不声称自己是这个市场的熊或牛。我只是随波逐流\n但我从媒体和公众那里得到的一些感觉，让我想起了很多。\n2008年的危机。好吧，更多的是危机后的复苏。我可能是\n今天交易的reddit用户平均年龄，当它发生....。",
      "title": "2008年 \"股灾 \"时的那些人在哪里，你还记得复苏的情绪吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不聲稱自己是這個市場的熊或牛。我只是隨波逐流\n但我從媒體和公衆那裏得到的一些感覺，讓我想起了很多。\n2008年的危機。好吧，更多的是危機後的復甦。我可能是\n今天交易的reddit用戶平均年齡，當它發生....。",
      "title": "2008年 \"股災 \"時的那些人在哪裏，你還記得復甦的情緒嗎？"
    }
  ],
  "title": "Where are those who were around for the 2008 \"crash\" and do you remember the recovery sentiment?",
  "created_utc": 1616124416,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I do not claim to be a bear or a bull in this market. I am just along for the ride but some of the feel I get from the media and the public remind me a lot of the 2008 crisis. Well more so the recovery from the crisis. I was probably the age of the average reddit user trading today when it happened. FYI it was much harder to get into trading (and expensive) back then... make sure to appreciate the time you are living in! </p>\n\n<p>What I remember was that when the fed stepped in and started handing out money everyone was dropping the word &quot;hyperinflation.&quot; It was the first time I had heard of it and I had to figure out what it meant.</p>\n\n<p>They also cut interest rates in half and the theme was &quot;it is only a matter of time before they came back.&quot; I bought a house in 2011 and my loan officer was pushing me to hurry before interest rates went higher. </p>\n\n<p>They started this &quot;quantitative easing&quot; for the stock market where the government dumped money in so it would move up &quot;artificially.&quot; This is how it was explained to me at the time and why people started talking about the bubble building that was going to &quot;pop&quot; in the stock market as it recovered to it&#39;s &quot;pre-crisis&quot; levels. </p>\n\n<p>When I think back to the &quot;sentiment&quot; of the financial crisis I see a lot of the same things today but it is all compressed into a much shorter time frame now. It also has this &quot;double down&quot; feel. Interest rates didn&#39;t ever recover and were cut in half yet again during the covid crisis. The fed is printing far more money then they did back then (though the bail outs were huge). I don&#39;t think they ever really stopped (someone else can clarify) injecting money into the economy. I also would like to note that inflation didn&#39;t &quot;get out of control&quot; but it sure seems things are much more expensive even though the numbers they follow don&#39;t show that. </p>\n\n<p>TL;DR These are the things that come to my mind from watching CNBC everyday after work during the financial crisis. The worries of then seem to be similar to the worries of today but they didn&#39;t actually play out back then. At the same time it seems we never got &quot;back to where we were&quot; when you consider the fed&#39;s involvement after 2009. They seem to be perpetually stuck injecting money and keeping rates low. Whenever they try to step away the market throws a tantrum and they come back. Can anyone else make some comparisons as to how this time is different or possibly the same? </p>\n\n<p>Bonus Question: Are any signs of a weak economy always going to be the responsibility of the fed to fix it? (More in reference to 2018-2019 than the covid crash.)</p>\n</div><!-- SC_ON -->",
  "score": 81,
  "permalink": "/r/stocks/comments/m81rlu/where_are_those_who_were_around_for_the_2008/",
  "subreddit": "stocks",
  "id": "m81rlu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752820807
}