{
  "author": "georgesadam",
  "the_new_excerpt": "I've been investing in VTI since February this year and decided to extend my\ninvestments with a new fully diversified portfolio. I also put some money every\nmonth with some of my savings and planning to do this for 10years+. I am 29\nyears old with a target to retire before 60. I live in Qatar and we…",
  "original_created_utc": 1623647820,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は今年の2月からVTIに投資していますが、新たに完全に分散されたポートフォリオで自分の投資を拡大することにしました。\nの投資を拡大することにしました。また、私の貯蓄から毎月いくらかの資金を\n10年以上続けようと思っています。私は29歳です。\n歳で、60歳までに引退することを目標にしています。私はカタールに住んでおり、私たちは...",
      "title": "ボーグルヘッドの初心者ですが、このやり方でいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我从今年2月开始投资VTI，并决定扩大我的投资范围。\n我决定扩大我的投资，建立一个新的完全多样化的投资组合。我每个月还把一些钱\n每月投入一些储蓄，并计划在10年以上的时间里这样做。我今年29岁\n今年29岁，目标是在60岁之前退休。我住在卡塔尔，我们的生活水平很高。",
      "title": "初次接触boglehead，我这样做对吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我從今年2月開始投資VTI，並決定擴大我的投資範圍。\n我決定擴大我的投資，建立一個新的完全多樣化的投資組合。我每個月還把一些錢\n每月投入一些儲蓄，並計劃在10年以上的時間裏這樣做。我今年29歲\n今年29歲，目標是在60歲之前退休。我住在卡塔爾，我們的生活水平很高。",
      "title": "初次接觸boglehead，我這樣做對嗎？"
    }
  ],
  "title": "New to boglehead , am I doing this right?",
  "created_utc": 1623666510,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been investing in VTI since February this year and decided to extend my investments with a new fully diversified portfolio. I also put some money every month with some of my savings and planning to do this for 10years+. I am 29 years old with a target to retire before 60. I live in Qatar and we don&#39;t have taxes(only my dividends are taxed).</p>\n\n<p>70% VTI</p>\n\n<p>20% VXUS</p>\n\n<p>5% stocks I like</p>\n\n<p>5% crypto</p>\n\n<p>Can you please help me with a strategy to keep my monthly new investments simple?  I know that VT can make things easier but I don&#39;t like it because of its allocations.</p>\n</div><!-- SC_ON -->",
  "score": 25,
  "permalink": "/r/Bogleheads/comments/nzfd2d/new_to_boglehead_am_i_doing_this_right/",
  "subreddit": "Bogleheads",
  "id": "nzfd2d",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009741228
}