{
  "author": "psychotrader00",
  "the_new_excerpt": "Stocks continued advancing on Thursday, with the Dow Jones (DIA) and the S&P 500\n(SPY) setting fresh intraday records. Market participants are encouraged after\nPresident Biden signed into law a new coronavirus relief package. Treasury\nyields also steadied at 1.525% at the time of writing. The tech…",
  "original_created_utc": 1615498911,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "周四股市继续走高，道琼斯指数(DIA)和标准普尔500指数。\n(SPY)刷新盘中纪录。市场参与者在受到鼓励后\n美国总统拜登签署了新的冠状病毒救助方案，使之成为法律。财政部\n写稿时，收益率也稳定在1.525%。科技...",
      "title": "以下是2021年3月11日星期四的市场回顾。请大家欣赏!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "週四股市繼續走高，道瓊斯指數(DIA)和標準普爾500指數。\n(SPY)刷新盤中紀錄。市場參與者在受到鼓勵後\n美國總統拜登簽署了新的冠狀病毒救助方案，使之成爲法律。財政部\n寫稿時，收益率也穩定在1.525%。科技...",
      "title": "以下是2021年3月11日星期四的市場回顧。請大家欣賞!"
    }
  ],
  "title": "Here is a Market Recap for today Thursday, March 11, 2021. Please enjoy!",
  "created_utc": 1615515402,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Stocks continued advancing on Thursday, with the Dow Jones (DIA) and the S&amp;P 500 (SPY) setting fresh intraday records. Market participants are encouraged after President Biden signed into law a new coronavirus relief package. Treasury yields also steadied at 1.525% at the time of writing. The tech-heavy Nasdaq (QQQ) closed 2.3% up, the SPY closed 1% up, and the Dow closed 0.62% up.</p>\n\n<p>After months of negotiation, President Biden signed into law a new $1.9 trillion coronavirus relief package after the bill passed in both houses of Congress by party-line votes. The bill includes provisions like $1,400 stimulus checks to most Americans, $300 per week in augmented unemployment benefits through early September, and $350 billion in state, local and tribal government aid. The bill comes exactly one year following the World Health Organization&#39;s formal designation of the coronavirus outbreak as a pandemic on March 11, 2020. </p>\n\n<p>Ian Shepherdson of Pantheon Macroeconomics wrote of the bill “The most immediate impact in the macroeconomic data will be in retail sales numbers, where some of the $410 billion in direct payments will appear in both the March and — especially — April reports.”</p>\n\n<p>The sharp contrast between the performance of the Dow and the Nasdaq in recent weeks underscores market participant’s increasing rotation out of high-flying tech stocks that led the markets higher in 2020 into stocks that are poised to directly benefit from the impending economic reopening. The cyclical energy and financials sectors have also been leading gains in the S&amp;P 500, extending a run of outperformance against tech and growth shares.</p>\n\n<p>The <a href=\"https://www.bls.gov/news.release/cpi.nr0.htm\">Labor Department&#39;s Consumer Price Index (CPI)</a> on Tuesday showed core consumer prices increased less than expected in February.{prices paid by consumers rose only 1.3% in February over last year, coming in below the 1.4% increase expected and slowing from the prior month. While it may not seem like a lot, the report helps quell fears that as economic activity increased and more stimulus was unleashed into the economy, inflationary pressures would begin to materialize. This also suggests the Federal Reserve can maintain its accommodative monetary policy and avoid rising interest rates for the foreseeable future. </p>\n\n<p><strong>Highlights</strong></p>\n\n<ul>\n<li>U.S. job openings increased to nearly seven million in January,<a href=\"https://www.bls.gov/news.release/jolts.nr0.htm\"> rising to the highest level since February 2020 as job postings picked up following a pandemic-induced slump.</a></li>\n<li>The Department of Labor released its weekly report on new jobless claims \n\n<ul>\n<li><strong>Initial jobless claim:</strong> 712,000 vs. 725,000 expected and a revised 754,000 during the prior week</li>\n</ul></li>\n<li><strong>Continuing claims:</strong> 4.144 million vs. 4.200 million expected and a revised 4.337 million during the prior week</li>\n<li>Antitrust regulators in China are mulling the imposition of a fine of over $975 million on Alibaba, the Wall Street Journal reported Thursday, citing people familiar with the matter.</li>\n<li>Shares of General Electric Co. took another dive Thursday, putting them on track to suffer the biggest decline in more than 11 months, as analysts gave a mixed review of the company’s Analyst Day and GECAS deal. GE announced a $30 billion deal to combine its aircraft leasing business (GECAS) with AerCap Holdings and proposing a reverse 1-8 split. </li>\n<li>Shares of Roblox Corp jumped on Thursday, building on the gaming platform&#39;s almost 55% rise on its stock market debut a day earlier after Cathie Wood bought more than 500,000 shares of Roblox for ARK Next Generation Internet ETF (ARKW).</li>\n<li>After cratering in value in recent weeks, the rally in EV stocks continues. </li>\n<li><strong>**Please note that current stock price was written premarket and does not reflect intraday movement.*\\</strong>*</li>\n<li>Abbott Labs (ABT) target raised by Raymond James from $126 to $130 at Outperform. Stock currently around $116</li>\n<li>AerCap (AER) with two target raises. Stock currently around $53\n\n<ul>\n<li>Deutsche Bank from $55 to $67 at Buy</li>\n<li>Barclays from $58 to $68 at Outperform</li>\n</ul></li>\n<li>Amgen (AMGN) target raised by Morgan Stanley (MS) from $277 to $279 at Overweight. Stock currently around $230</li>\n<li>Broadcom (AVGO) with too many target raises to list. Consensus stock price around $500 at Buy. Stock currently around $437</li>\n<li>Burlington Stores (BURL) with a host of target raises. Consensus price target of $320 at Outperform. Stock currently around $294</li>\n<li>Fulgent Genetics (FLGT) target raised by Piper Sandler from $134 to $140 at Overweight. Stock currently around $97</li>\n<li>Kemper (KMPR) target raised by Raymond James from $85 to $95 at Strong-Buy. Stock currently around $81</li>\n<li>Las Vegas Sands (LVS) target raised by Deutshce Bank from $64 to $73 at Buy. Stock currently around $62</li>\n<li>Microsoft (MSFT) target raised by Morgan Stanley (MS) from $285 to $290 at Overweight. Stock currently around $232</li>\n<li>NGM Biopharma (NGM) target raised by Raymond James from $50 to $52 at Strong-Buy. Stock currently around $28.50</li>\n<li>Nike (NKE) target raised by Morgan Stannley (MS) from $173 to $176 at overweight. Stock currently around $138</li>\n<li>Skillz (SKLZ) target raised by Canaccord Genuity from $32 to $33 at Buy. Stock currently around $25.70</li>\n<li>Stoke Therapeutics (STOK) target raised by Canaccord Genuity from $72 to $76 at Buy. Stock currently around $54</li>\n</ul>\n\n<p>“In my view, the biggest investment risk is not the volatility of prices, but whether you will suffer a permanent loss of capital. Not only is the mere drop in stock prices not risk, but it is an opportunity. Where else do you look for cheap stocks?” - Li Lu</p>\n</div><!-- SC_ON -->",
  "score": 111,
  "permalink": "/r/stocks/comments/m31j2x/here_is_a_market_recap_for_today_thursday_march/",
  "subreddit": "stocks",
  "id": "m31j2x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147381384
}