{
  "author": "lostmyinitialaccount",
  "original_created_utc": 1659548447,
  "title": "Where does the pain come from when you have a viral infection (like covid or the flu)?",
  "created_utc": 1659556252,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am currently under a viral infection and I honestly feel like I just have been hit by a train... twice. \nSo I was wondering who/what is activating all these pain receptors in my head and my muscles. Is it the virus even thought it&amp;#39;s entry way was the lungs? Is it just a side product of inflammation? But other infections don&amp;#39;t lead to this.\nThanks!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 132,
  "permalink": "/r/askscience/comments/wfcx50/where_does_the_pain_come_from_when_you_have_a/",
  "subreddit": "askscience",
  "id": "wfcx50",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I am currently under a viral infection and I honestly feel like I just have been\nhit by a train... twice. So I was wondering who/what is activating all these\npain receptors in my head and my muscles. Is it the virus even thought it's\nentry way was the lungs? Is it just a side product of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "現在、ウイルス性の感染症にかかっており、正直なところ、私は、ただ単にT字型に殴られたような気分です。\n電車に轢かれたような気分です...2回も。だから、誰が、何が、これらすべてを活性化させているのかと考えていました。\n私の頭と筋肉にある痛みの受容体を活性化させているのは誰なのでしょうか？肺から侵入したとはいえ、ウイルスが原因なのでしょうか？\n肺から侵入したのだろうか？副産物なのか...",
      "title": "ウイルス感染（コビドやインフルエンザなど）の時の痛みはどこから来るのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我目前正处于病毒感染期，说实话，我觉得我刚刚被\n被火车撞了...两次。所以我想知道是谁/什么东西激活了我脑中所有的这些\n在我的头部和肌肉中的疼痛受体。是病毒吗，甚至认为它的\n是病毒，即使它的进入方式是肺部？它是否只是一个副作用...",
      "title": "当你有病毒性感染（如covid或流感）时，疼痛来自哪里？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我目前正處於病毒感染期，說實話，我覺得我剛剛被\n被火車撞了...兩次。所以我想知道是誰/什麼東西激活了我腦中所有的這些\n在我的頭部和肌肉中的疼痛受體。是病毒嗎，甚至認爲它的\n是病毒，即使它的進入方式是肺部？它是否只是一個副作用...",
      "title": "當你有病毒性感染（如covid或流感）時，疼痛來自哪裏？"
    }
  ]
}