{
  "author": "fosuro",
  "the_new_excerpt": "Hey manipulators! The whales seem to have finished accumulating what little they\nwaned to accumulate, you can let the price go up now. Volume looks to be the\nlowest it’s been at least since the peak.\n\n(Apparently whales bought back 50 000 btc after selling 130 000. If my maths\nworks out, that means…",
  "original_created_utc": 1623012218,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "操り手の皆さん、こんにちは。クジラは少しずつ蓄積し終わったようだ。\n溜めたかったものを溜め終わったようだから、もう値を上げてもいいだろう。出来高は、少なくともピーク時から\n少なくともピーク時以降では最も少ないようだ。\n\n(クジラは13万枚売った後、5万枚買い戻したようです。私の計算では\nとすると...。",
      "title": "Ok market manipulators, Btc volume seems to be the lowest it's ever in this cycle. クジラの蓄積も止まっている。もう価格を上げてもいいんじゃないかな...。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嘿，操纵者! 鲸鱼们似乎已经完成了他们想要积累的一点东西。\n他们想积累的东西，你现在可以让价格上涨了。成交量看起来是\n至少是高峰期以来的最低值。\n\n显然，鲸鱼在卖出13万个btc后又买回了5万个。如果我的数学计算\n运作，这意味着...",
      "title": "好吧，市场操纵者，Btc的交易量看起来是这个周期以来最低的。鲸鱼们已经停止了积累。你现在可以让价格上涨了..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嘿，操縱者! 鯨魚們似乎已經完成了他們想要積累的一點東西。\n他們想積累的東西，你現在可以讓價格上漲了。成交量看起來是\n至少是高峯期以來的最低值。\n\n顯然，鯨魚在賣出13萬個btc後又買回了5萬個。如果我的數學計算\n運作，這意味着...",
      "title": "好吧，市場操縱者，Btc的交易量看起來是這個週期以來最低的。鯨魚們已經停止了積累。你現在可以讓價格上漲了..."
    }
  ],
  "title": "Ok market manipulators, Btc volume looks to be the lowest it’s been this cycle. The whales have stoped accumulating. You can let the price go up now...",
  "created_utc": 1623059159,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey manipulators! The whales seem to have finished accumulating what little they waned to accumulate, you can let the price go up now. Volume looks to be the lowest it’s been at least since the peak.</p>\n\n<p>(Apparently whales bought back 50 000 btc after selling 130 000. If my maths works out, that means the whales bought back a bit under half their bags for about 1 quarter the sell out value of their portfolios and cashed out 3 quarters of the portfolio value. solid move whales.)</p>\n\n<p>Anyway, for the rest of us, now that they have finished buying and you manipulators somehow kept the price low while they did that, can you let it go up now?</p>\n\n<p>Manipulators?\nCan you hear me?</p>\n</div><!-- SC_ON -->",
  "score": 203,
  "permalink": "/r/CryptoCurrency/comments/ntv4y9/ok_market_manipulators_btc_volume_looks_to_be_the/",
  "subreddit": "CryptoCurrency",
  "id": "ntv4y9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404882865
}