{
  "author": "JarethKingofGoblins",
  "original_created_utc": 1657422958,
  "title": "Someone managed to remotely grab my phone's SIM and drained my crypto. Stay secure, cryptobros.",
  "created_utc": 1657481529,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;honestly thought i did everything (mostly) right. use a password manager, never click on phishy shit, etc. today, someone managed to usurp my phone&amp;#39;s SIM and was able to drain my Coinbase account. &lt;/p&gt;\n\n&lt;p&gt;pretty surreal, honestly. wish i&amp;#39;d moved shit to a wallet regularly. i&amp;#39;m not super technical, but it seems more like a vulnerability of my phone provider (T-Mobile) than me personally. &lt;/p&gt;\n\n&lt;p&gt;either way, just another reason to keep your security as tight as possible. learn from my (massive fucking) mistake.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 304,
  "permalink": "/r/CryptoCurrency/comments/vvi92u/someone_managed_to_remotely_grab_my_phones_sim/",
  "subreddit": "CryptoCurrency",
  "id": "vvi92u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "honestly thought i did everything (mostly) right. use a password manager, never\nclick on phishy shit, etc. today, someone managed to usurp my phone's SIM and\nwas able to drain my Coinbase account.\n\npretty surreal, honestly. wish i'd moved shit to a wallet regularly. i'm not\nsuper technical, but it…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "正直なところ、私はすべて（ほとんど）正しく行っているつもりでした。\n今日、誰かが私の携帯のSIMを盗み、私のコインベース・アカウントを流出させました。\nコインベースの口座から金を引き出された\n\n正直言って、かなりシュールです。\n超技術者じゃないが...",
      "title": "誰かが遠隔操作で私の携帯のSIMを盗み、暗号を抜き取った。安全な場所にいて下さい 暗号解読者達よ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "老实说，我认为我所做的一切（大部分）都是正确的：使用密码管理器，从不点击虚假的东西。\n今天，有人设法篡改了我的手机SIM卡，并将我的Coinbase账户耗尽。\n今天，有人设法篡改了我的手机SIM卡，并能够耗尽我的Coinbase账户。\n\n说实话，这很不真实。希望我经常把东西转移到钱包里。\n我不是超级技术专家，但...",
      "title": "有人设法远程抓取了我的手机SIM卡，并吸干了我的加密货币。请注意安全，加密爱好者们。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "老實說，我認爲我所做的一切（大部分）都是正確的：使用密碼管理器，從不點擊虛假的東西。\n今天，有人設法篡改了我的手機SIM卡，並將我的Coinbase賬戶耗盡。\n今天，有人設法篡改了我的手機SIM卡，並能夠耗盡我的Coinbase賬戶。\n\n說實話，這很不真實。希望我經常把東西轉移到錢包裏。\n我不是超級技術專家，但...",
      "title": "有人設法遠程抓取了我的手機SIM卡，並吸乾了我的加密貨幣。請注意安全，加密愛好者們。"
    }
  ]
}