{
  "author": "md20016",
  "original_created_utc": 1624819569,
  "title": "My Great-Grandfather's sister went missing in Chicago in 1898 at the age of 14 while walking to her piano lesson. What likely happened to young children like her who were abducted during the turn of the century in large American cities like Chicago? (Her missing person's ad included!)",
  "created_utc": 1624827015,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>R5</strong>: This is the full page ad that my great-grandfather&#39;s father took out in the Chicago Tribune following his daughter&#39;s abduction. The story goes that she was walking to her piano lesson in southside Chicago (at the time a wealthier neighborhood), but never made it to the piano lesson. They searched for her for years - going to brothels, factories, the works, but never found her.</p>\n\n<p><strong>Some personal context</strong> is that my grandfather (this would have been his aunt) is currently dying (after a long wonderful life). He&#39;s always been a huge history buff and loves talking about his family history, and I would love to shed some new light on this story before he passes :)</p>\n\n<p><a href=\"https://preview.redd.it/6cng5hrjru771.jpg?width=2448&amp;format=pjpg&amp;auto=webp&amp;s=1bdc13ba3ea733aac2e05b6b3eb42c1a809dded8\">https://preview.redd.it/6cng5hrjru771.jpg?width=2448&amp;format=pjpg&amp;auto=webp&amp;s=1bdc13ba3ea733aac2e05b6b3eb42c1a809dded8</a></p>\n</div><!-- SC_ON -->",
  "score": 127,
  "permalink": "/r/AskHistorians/comments/o931b4/my_greatgrandfathers_sister_went_missing_in/",
  "subreddit": "AskHistorians",
  "id": "o931b4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "R5: This is the full page ad that my great-grandfather's father took out in the\nChicago Tribune following his daughter's abduction. The story goes that she was\nwalking to her piano lesson in southside Chicago (at the time a wealthier\nneighborhood), but never made it to the piano lesson. They…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "R5：これは、私の曾祖父の父親が、娘の誘拐後にシカゴ・トリビューン紙に出した全ページ広告です。\n娘が誘拐された後、曾祖父の父親がシカゴ・トリビューン紙に出した全面広告です。話によると、娘は\n話によると、娘はシカゴのサウスサイド（当時は裕福な地域）にあるピアノ教室に向かって歩いていました。\n歩いていたが、ピアノのレッスンには間に合わなかった。彼らは...",
      "title": "私の曾祖父の妹は、1898年にシカゴで14歳の時にピアノのレッスンに向かう途中で行方不明になりました。世紀の変わり目に、シカゴのようなアメリカの大都市で誘拐された彼女のような幼い子供たちはどうなったのでしょうか？彼女の行方不明者の広告も含まれています！）。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "R5：这是我曾祖父的父亲在女儿被绑架后在《芝加哥论坛报》上刊登的整版广告。\n他的女儿被绑架后，芝加哥论坛报刊登的整版广告。故事是这样的：她当时正在\n在芝加哥南区（当时是一个较富裕的社区）步行去上钢琴课，但却没有到达钢琴教室。\n社区），但却没能去上钢琴课。他们...",
      "title": "我曾祖父的妹妹于1898年在芝加哥失踪，当时她只有14岁，正在步行去上钢琴课。在世纪之交的美国大城市如芝加哥，像她这样被绑架的年轻孩子可能发生了什么？(包括她的失踪者广告！)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "R5：這是我曾祖父的父親在女兒被綁架後在《芝加哥論壇報》上刊登的整版廣告。\n他的女兒被綁架後，芝加哥論壇報刊登的整版廣告。故事是這樣的：她當時正在\n在芝加哥南區（當時是一個較富裕的社區）步行去上鋼琴課，但卻沒有到達鋼琴教室。\n社區），但卻沒能去上鋼琴課。他們...",
      "title": "我曾祖父的妹妹於1898年在芝加哥失蹤，當時她只有14歲，正在步行去上鋼琴課。在世紀之交的美國大城市如芝加哥，像她這樣被綁架的年輕孩子可能發生了什麼？(包括她的失蹤者廣告！)"
    }
  ]
}