{
  "author": "Aquila0000",
  "original_created_utc": 1635417416,
  "title": "We are close to ATH but Google search activity is nowhere near the top: Retail has not jumped in yet, the real bull market has yet to come!",
  "created_utc": 1635445867,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There are many mathematical models and technical indicators that are suggesting BTC will reach 100k very soon, but equally important is to take a look at the sentiment of the general public. Retail is where the money will be coming from that we need to push to these new levels.</p>\n\n<p>Here we can see the Google search activity graph for the term &#39;cryptocurrency&#39;:</p>\n\n<p><a href=\"https://preview.redd.it/w5cemev536w71.png?width=1389&amp;format=png&amp;auto=webp&amp;s=d3b6a4bcf6ff0f416e14f7aa0145912e2f8f8662\">Google search activity graph for the term &#39;cryptocurrency&#39;</a></p>\n\n<p>The explanation from Google: &#39;The values indicate the search interest relative to the highest point on the graph for the selected region in the specified time period. The value 100 stands for the highest popularity of this search term. A value of 50 means that the term is half as popular and a value of 0 means that not enough data was available for this term.&#39;</p>\n\n<p>Here is the graph for bitcoin:</p>\n\n<p><a href=\"https://preview.redd.it/68d3btn346w71.png?width=1399&amp;format=png&amp;auto=webp&amp;s=059b8b9174e3fd351e0123ee9d4ee84a749972eb\">Google search activity graph for the term &#39;bitcoin&#39;</a></p>\n\n<p>And here the graph for ethereum:</p>\n\n<p><a href=\"https://preview.redd.it/1ih38f0446w71.png?width=1400&amp;format=png&amp;auto=webp&amp;s=e29a788f30c5d36b4114d53bd176bfde14fd3f26\">Google search activity graph for the term &#39;ethereum&#39;</a></p>\n\n<p><strong>We can see that the Google search activity is roughly related to the market capitalization. However, even though we reached new ATHs just a week ago and will most likely achieve new ones soon, the search activity is nowhere near the top. Once it reaches new highs again, it should trigger a huge inflow of money into crypto and thus a push to levels never seen before.</strong></p>\n\n<p>&#x200B;</p>\n\n<p><em>Disclaimer: Nothing in this post is financial advice, you are responsible for your own decisions, this is only my personal opinion and I have no clue about anything.</em></p>\n</div><!-- SC_ON -->",
  "score": 184,
  "permalink": "/r/CryptoCurrency/comments/qhk3lm/we_are_close_to_ath_but_google_search_activity_is/",
  "subreddit": "CryptoCurrency",
  "id": "qhk3lm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "There are many mathematical models and technical indicators that are suggesting\nBTC will reach 100k very soon, but equally important is to take a look at the\nsentiment of the general public. Retail is where the money will be coming from\nthat we need to push to these new levels.\n\nHere we can see the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "多くの数学モデルやテクニカル指標が、BTCが近いうちに100kに到達することを示唆しています。\nBTCはすぐに100kに達するだろうと示唆している数理モデルやテクニカル指標はたくさんありますが、それと同じくらい重要なのは、一般の人々の感情を見てみることです。\n同じように重要なのは、一般の人々のセンチメントを見ることです。一般の人々の感情も重要です。\n私たちがこの新しいレベルに押し上げる必要があるのです。\n\nここで、私たちは...",
      "title": "ATHに近いですが、Google検索のアクティビティは今ひとつです。リテールはまだ参入していない、本当のブルマーケットはこれからだ!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有许多数学模型和技术指标都表明\nBTC将很快达到10万，但同样重要的是看一下\n普通公众的情绪。零售商是资金的来源\n我们需要将其推到这些新的水平。\n\n在这里，我们可以看到...",
      "title": "我们离ATH很近，但谷歌的搜索活动却远未达到顶峰。散户还没有跳进去，真正的牛市还没有到来!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有許多數學模型和技術指標都表明\nBTC將很快達到10萬，但同樣重要的是看一下\n普通公衆的情緒。零售商是資金的來源\n我們需要將其推到這些新的水平。\n\n在這裏，我們可以看到...",
      "title": "我們離ATH很近，但谷歌的搜索活動卻遠未達到頂峯。散戶還沒有跳進去，真正的牛市還沒有到來!"
    }
  ]
}