{
  "author": "Bashkiroff",
  "original_created_utc": 1635718330,
  "title": "How I Made a Wireless, Fast-Change Set Of Headphones On a $40,000 Prototype Budget",
  "created_utc": 1635722431,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p><a href=\"https://reddit.com/link/qk00h9/video/703wicvi0vw71/player\">https://reddit.com/link/qk00h9/video/703wicvi0vw71/player</a></p>\n\n<p>The story of modern headphone reliability and convenience is a poem of two words – it sucks. Headphones wield quite the reputation for being not only rebels in the behavior of their wire-attachments, but are also quite lousy as companions who can be relied on in times they are most needed. Wired headphones aside, their more advanced brethren are no better in that regard, as batteries run dry near-instantly and are less than adequate for any kind of trip that takes the user beyond the reach of a wall outlet.</p>\n\n<p>Everyone nowadays uses some kind of headphones. Be it teenagers for listening to music and streams, to businessmen confined to remote working environments. Such universality also comes with a few downsides, since the main problems and pain points that currently prevent users from being completely satisfied with wireless headphones are common for all audiences and device sectors.</p>\n\n<p>The insufficiency of battery life and the remote operational capabilities of headphones are the biggest problems. Not everyone has the luxury of carrying several fully charged sets of headpieces, or has access to a charger when they need it most.</p>\n\n<p>And that’s why I came up with a solution, since I too felt the pain of being left in the dark when the music suddenly ran dry together with the headphones’ battery.</p>\n\n<p>A rechargeable battery is fine, but wireless headphones with replaceable batteries that can be changed on-the-go and hassle-free are the Holy Grail of sound technologies. Add to that a stylish look and excellent sound characteristics and you have the makings of a groundbreaking product.</p>\n\n<p>Just imagine – continuing to hear that crystal clear tune and its vibrations through your entire body with just a short interlude between battery shifts on-the-fly. Glorious and true to the spirit of modern technologies.</p>\n\n<p>But it gets better, since I made the headphones waterproof, added in some noise canceling software, and a spruce of touch controls to take them to cyberpunk level. Device compatibility across markets makes the device the pinnacle of modern headphone technologies that are embodied in Relods.</p>\n\n<p>Getting there is just the start of the journey as the Indiegogo product crowdfunding campaign has already been launched for Relods, making the Relods headphones a product by the people for the people. Let the users decide what they want – to keep roaming the market in search of that one pair of nonexistent, ideal headphones, or pitch in and get a pair of Relods headphones that include all they ever wanted.</p>\n\n<p>The target of $40,000 is a drop in the ocean compared to the value Relods can bring to their users in terms of all-round convenience, prolonged battery life, pristine sound quality, and that ‘oomph’ factor in which form <em>is</em> function. Join the Relods crowdfunding campaign <a href=\"https://www.indiegogo.com/projects/relods/coming_soon\">on Indiegogo</a> and let everyone enjoy the benefits of a world of advanced sound technologies free of chargers and unexpected power mishaps.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://reddit.com/link/qk00h9/video/24h00zur0vw71/player\">https://reddit.com/link/qk00h9/video/24h00zur0vw71/player</a></p>\n</div><!-- SC_ON -->",
  "score": 9,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/06K0tVyUQS_p5hmZjYmyuEu_9mAeWdQLHoCzTr3dGUs.jpg?auto=webp&s=cb472935c8e7d18ab8b4f94b6d5df37ecb772750",
          "width": 200,
          "height": 200
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/06K0tVyUQS_p5hmZjYmyuEu_9mAeWdQLHoCzTr3dGUs.jpg?width=108&crop=smart&auto=webp&s=cf0826a264232fd91c0830c623c161c54035e67e",
            "width": 108,
            "height": 108
          }
        ],
        "variants": {},
        "id": "uw6WHHfcODcvYZCWc56cOWXztCHnk8OGRU00gHAOLBU"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/SideProject/comments/qk00h9/how_i_made_a_wireless_fastchange_set_of/",
  "subreddit": "SideProject",
  "id": "qk00h9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "https://reddit.com/link/qk00h9/video/703wicvi0vw71/player\n\nThe story of modern headphone reliability and convenience is a poem of two words\n– it sucks. Headphones wield quite the reputation for being not only rebels in\nthe behavior of their wire-attachments, but are also quite lousy as…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "https://reddit.com/link/qk00h9/video/703wicvi0vw71/player\n\n現代のヘッドフォンの信頼性と利便性の物語は、次の2つの言葉で構成される詩です。\n- it sucks. ヘッドホンの評判は、その線材の動きに反抗的であるだけでなく\nヘッドホンの評判は、線材の取り回しの悪さだけでなく、ヘッドホンとしての性能の低さにもあります。",
      "title": "4万円の試作予算で、ワイヤレスで変化の早いヘッドフォンを作るまで"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "https://reddit.com/link/qk00h9/video/703wicvi0vw71/player\n\n现代耳机的可靠性和便利性的故事是一首两个字的诗\n- 它很糟糕。耳机不仅因其线材连接的反叛行为而享有相当高的声誉。\n耳机不仅在其导线连接的行为上有很大的名声，而且也是相当糟糕的。",
      "title": "我如何用4万美元的原型预算制造出一套无线、快速变化的耳机"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "https://reddit.com/link/qk00h9/video/703wicvi0vw71/player\n\n現代耳機的可靠性和便利性的故事是一首兩個字的詩\n- 它很糟糕。耳機不僅因其線材連接的反叛行爲而享有相當高的聲譽。\n耳機不僅在其導線連接的行爲上有很大的名聲，而且也是相當糟糕的。",
      "title": "我如何用4萬美元的原型預算製造出一套無線、快速變化的耳機"
    }
  ]
}