{
  "author": "ironwolf6464",
  "original_created_utc": 1647105984,
  "title": "Why do cryptocurrency fans insist that crypto is better then cash in times of great disaster. Wouldn't the internet be the first thing to go in a global disaster?",
  "created_utc": 1647118944,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;After scrolling through far too many cryptobro forums, I realized that a good chunk of them seem to think that crypto is better then cash because it &amp;quot;cannot be taken&amp;quot; because it is non-fungible. And therefore is a viable currency in times of great strife.&lt;/p&gt;\n\n&lt;p&gt;Now, overlooking the fact that there are only a handful of businesses that accept crypto in the raw (namely bitcoin, companies like Microsoft, Tesla, and befuddlingly enough, Burger King), isn&amp;#39;t this just very inefficient?&lt;/p&gt;\n\n&lt;p&gt;Furthermore, if some sort of worldwide apocalyptic circumstance these people seem to talk about were to erupt, such as a nuclear bombing or solar flare were to erupt. It it just me, or wouldn&amp;#39;t the internet be one of the first services to grind to a halt, as infrastructure such as power plants, servers and transmission towers are compromised? &lt;/p&gt;\n\n&lt;p&gt;There is also the exchange rate issue, as even if crypto were to somehow be convertible into cash at this point, wouldn&amp;#39;t the money be essentially worthless in a dire post-disaster scenario? If such a event were to occur, wouldn&amp;#39;t people be far more interested in food water and shelter? &lt;/p&gt;\n\n&lt;p&gt;Even if the disaster wasn&amp;#39;t that bad, the economy crashing would also make the converted currency less useful? (If I am on the right page here.)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 139,
  "permalink": "/r/NoStupidQuestions/comments/tclq4j/why_do_cryptocurrency_fans_insist_that_crypto_is/",
  "subreddit": "NoStupidQuestions",
  "id": "tclq4j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "After scrolling through far too many cryptobro forums, I realized that a good\nchunk of them seem to think that crypto is better then cash because it \"cannot\nbe taken\" because it is non-fungible. And therefore is a viable currency in\ntimes of great strife.\n\nNow, overlooking the fact that there are…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "あまりにも多くのクリプトブロ・フォーラムをスクロールした後、私はかなりの数の\nその多くは、暗号は現金より優れていると考えているようです。\nを取ることができる。そのため、以下のような場合に有効な通貨となります。\n大混乱の時代。\n\n今、見過ごしているのは...",
      "title": "なぜ暗号通貨ファンは、大災害の時に暗号が現金より優れていると主張するのでしょうか。世界的な災害では、インターネットが真っ先に破壊されるのでは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在翻阅了太多的cryptobro论坛后，我意识到，他们中的很大一部分人似乎认为加密货币比现金更好，因为它 \"是\"。\n他们中的很大一部分人似乎认为加密货币比现金更好，因为它 \"不能被拿走\"，因为它是不可伪造的。\n被拿走\"，因为它是不可伪造的。因此，它是一种可行的货币，在\n因此，在巨大的纷争时期是一种可行的货币。\n\n现在，忽略了一个事实，即有...",
      "title": "为什么加密货币粉丝坚持认为，在发生巨大灾难时，加密货币比现金更好。在全球灾难中，互联网难道不是第一个消失的东西吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在翻閱了太多的cryptobro論壇後，我意識到，他們中的很大一部分人似乎認爲加密貨幣比現金更好，因爲它 \"是\"。\n他們中的很大一部分人似乎認爲加密貨幣比現金更好，因爲它 \"不能被拿走\"，因爲它是不可僞造的。\n被拿走\"，因爲它是不可僞造的。因此，它是一種可行的貨幣，在\n因此，在巨大的紛爭時期是一種可行的貨幣。\n\n現在，忽略了一個事實，即有...",
      "title": "爲什麼加密貨幣粉絲堅持認爲，在發生巨大災難時，加密貨幣比現金更好。在全球災難中，互聯網難道不是第一個消失的東西嗎？"
    }
  ]
}