{
  "author": "SirHovaOfBrooklyn",
  "original_created_utc": 1640443318,
  "title": "[NSFW] Back when pictures had to be developed and you took naked pictures of yourself, would the employees have seen them?",
  "created_utc": 1640448730,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I wasn&amp;#39;t old enough to take naked pics of myself back when film cameras were the norm so I don&amp;#39;t know how developing these would work. I just remember going to the store and handing in the roll and coming back after some time and get the pictures inside an envelope. So if I took naked pictures of myself and had them developed at the store, would the one in charge of doing this have seen my naked pictures?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 139,
  "permalink": "/r/NoStupidQuestions/comments/roay9z/nsfw_back_when_pictures_had_to_be_developed_and/",
  "subreddit": "NoStupidQuestions",
  "id": "roay9z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I wasn't old enough to take naked pics of myself back when film cameras were the\nnorm so I don't know how developing these would work. I just remember going to\nthe store and handing in the roll and coming back after some time and get the\npictures inside an envelope. So if I took naked pictures of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "フィルムカメラが主流だった頃、私は自分の裸の写真を撮れる年齢ではありませんでした。\n現像の仕上がりがどうなるかはわかりません。ただ、覚えているのは\nお店でロールを渡して、しばらくしてから戻ってくると\n封筒に入った写真。だから、もし私が裸の写真を撮ったなら...",
      "title": "[NSFW] 写真が現像されなければならなかった時代に、自分の裸の写真を撮ったら、社員はそれを見ていただろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我还没有老到可以给自己拍裸照的地步，那时胶片相机还是常态。\n所以我不知道这些照片的冲洗效果如何。我只记得我去了\n商店，把卷轴交上去，过了一段时间再回来，得到了装在信封里的照片。\n照片放在一个信封里。因此，如果我拍了裸体照片...",
      "title": "[NSFW]在照片需要冲洗的年代，你拍了自己的裸照，员工们会不会看到呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我還沒有老到可以給自己拍裸照的地步，那時膠片相機還是常態。\n所以我不知道這些照片的沖洗效果如何。我只記得我去了\n商店，把卷軸交上去，過了一段時間再回來，得到了裝在信封裏的照片。\n照片放在一個信封裏。因此，如果我拍了裸體照片...",
      "title": "[NSFW]在照片需要衝洗的年代，你拍了自己的裸照，員工們會不會看到呢？"
    }
  ]
}