{
  "author": "nothingnowherenomore",
  "original_created_utc": 1655807641,
  "title": "Why did men at arms in the 15th century decide against having any leg protection and did many people actually wear no shoes?",
  "created_utc": 1655888761,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d post some paintings but this sub doesn&amp;#39;t allow it. Many paintings from the 15th century depict people wearing colorful leggings which are essentially a baseline for my two questions, which are:&lt;/p&gt;\n\n&lt;p&gt;Why did people no longer wear longer gambesons like in the earlier centuries to protect their thighs? All of the paintings depict people either wearing leg armor or just those leggings without any protection. Was it because of fashion? &lt;/p&gt;\n\n&lt;p&gt;The second question regards shoes. In many paintings there are two things depicted at the same time. One being people wearing those leggings and shoes (which is what one would expect) and other being people not wearing any shoes and having those leggings covering their feet as well as legs. Was it a thing that people in this century just walked around in their leggings that also covered their feet? So essentially without shoes and just with some cloth on their feet? &lt;/p&gt;\n\n&lt;p&gt;(Sorry if the wording is weird, english isn&amp;#39;t my native language and I struggle with explaining things)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/vha9fo/why_did_men_at_arms_in_the_15th_century_decide/",
  "subreddit": "AskHistorians",
  "id": "vha9fo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'd post some paintings but this sub doesn't allow it. Many paintings from the\n15th century depict people wearing colorful leggings which are essentially a\nbaseline for my two questions, which are:\n\nWhy did people no longer wear longer gambesons like in the earlier centuries to\nprotect their…"
}