{
  "author": "roberthonker",
  "the_new_excerpt": "One comment upvote is worth one karma, which is 0.48 moons. (at least this month\nwith double comment karma) moons are 10 cents so one upvote is 4.8 cents. One\nsingle click, which can be initiated by anyone with a free account and access to\ninternet is worth almost 5 cents. This is higher than the…",
  "original_created_utc": 1621304206,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1つのコメントのupvoteは1karmaの価値があり、これは0.48ムーンです。(少なくとも今月は\nムーンは10セントなので、1つのupvoteは4.8セントです。ワン\n1回のクリックは、無料のアカウントとインターネットへのアクセスがあれば、誰でも始められます。\nインターネットにアクセスできる無料アカウントがあれば誰でも始められるワンクリックは、ほぼ5セントの価値があります。これは...より高いですね。",
      "title": "月を見ると、世界各地の巨大なギャップがよくわかります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "一条评论的最高票值是一个因果，也就是0.48个月。(至少在这个月\n有双倍的评论业力）月亮是10美分，所以一个最高票数是4.8美分。一个\n就可以发起一次点击，任何拥有免费账户和访问权限的人都可以这样做。\n互联网的人都可以点击，价值近5美分。这要高于...",
      "title": "月亮将世界不同地区之间的巨大差距纳入视野。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "一條評論的最高票值是一個因果，也就是0.48個月。(至少在這個月\n有雙倍的評論業力）月亮是10美分，所以一個最高票數是4.8美分。一個\n就可以發起一次點擊，任何擁有免費賬戶和訪問權限的人都可以這樣做。\n互聯網的人都可以點擊，價值近5美分。這要高於...",
      "title": "月亮將世界不同地區之間的巨大差距納入視野。"
    }
  ],
  "title": "Moons put the massive gaps between different parts of the world into perspective.",
  "created_utc": 1621333967,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>One comment upvote is worth one karma, which is 0.48 moons. (at least this month with double comment karma) moons are 10 cents so one upvote is 4.8 cents. One single click, which can be initiated by anyone with a free account and access to internet is worth almost 5 cents. This is higher than the minimum hourly wage in some countries. Sierra Leone for example has a minimum wage of 3 cents. It really puts things in perspective for me when you think of it that way.</p>\n</div><!-- SC_ON -->",
  "score": 212,
  "permalink": "/r/CryptoCurrency/comments/neyl90/moons_put_the_massive_gaps_between_different/",
  "subreddit": "CryptoCurrency",
  "id": "neyl90",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590799680
}