{
  "author": "antij0sh",
  "the_new_excerpt": "When a public company goes tits up and files bankruptcy guess who gets paid last\n? That’s right, your “partial ownership” granted you the privilege of being\ncompensated exactly fucking nothing. But wait, certainly I could show up at the\noffices and pick out a nice used IBM workstation or at least a…",
  "original_created_utc": 1619872086,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "上場企業が破綻して破産申請した場合、誰が最後に支払われるのでしょうか？\n? そうです。あなたの「部分的所有権」によって、まったく何の補償も受けられない特権が与えられたのです。\n何の報酬も得られないのです。でも待てよ、確かに僕は会社に行って\nオフィスに行って、中古のIBMワークステーションを選ぶか、少なくとも...。",
      "title": "伝統的な投資は、暗号に比べて「本物」ではありませんが、本物であるという幻想が長く続いているだけです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当一个上市公司倒闭并申请破产时，你猜谁会得到最后的报酬？\n? 没错，你的 \"部分所有权 \"给予你的特权是\n你的 \"部分所有权 \"使你有特权得到他妈的任何补偿。但是，等等，我当然可以出现在\n办公室，挑出一台漂亮的二手IBM工作站，或者至少是一台......",
      "title": "传统投资并不比加密货币更 \"真实\"，只是真实性的假象被延续了更久。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當一個上市公司倒閉並申請破產時，你猜誰會得到最後的報酬？\n? 沒錯，你的 \"部分所有權 \"給予你的特權是\n你的 \"部分所有權 \"使你有特權得到他媽的任何補償。但是，等等，我當然可以出現在\n辦公室，挑出一臺漂亮的二手IBM工作站，或者至少是一臺......",
      "title": "傳統投資並不比加密貨幣更 \"真實\"，只是真實性的假象被延續了更久。"
    }
  ],
  "title": "Traditional Investments are no more “real” than crypto, the illusion of realness has just been perpetuated longer.",
  "created_utc": 1619894743,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>When a public company goes tits up and files bankruptcy guess who gets paid last ? That’s right, your “partial ownership” granted you the privilege of being compensated exactly fucking nothing. But wait, certainly I could show up at the offices and pick out a nice used IBM workstation or at least a well broken in office chair before the liquidators come in ? After all, I was PART OWNER of GM! NOPE. Your grand pappy never actually owned a single red cent of General Motors when he felt so confident dumping his retirement into GM.  So, don’t feel dissuaded when the boomers claim crypto could “go to zero!”, they are speaking from experience from when the securities they are peddling to you instead have literally GONE TO ZERO. Growth stocks were literally the first shit coin with brand names to raise money for the real ownership of the company.</p>\n</div><!-- SC_ON -->",
  "score": 234,
  "permalink": "/r/CryptoCurrency/comments/n2hdvg/traditional_investments_are_no_more_real_than/",
  "subreddit": "CryptoCurrency",
  "id": "n2hdvg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380962676
}