{
  "author": "Regular-Inspection67",
  "the_new_excerpt": "So let's say I gather a large army and I invade Poland. I sign a peace treaty\nwith the other countries and they say they'll let me keep Poland with the\npromise that I won't advance further. Lot's of countries have my back, including\nChina, Russia and France. But other countries like The United…",
  "original_created_utc": 1613092545,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "那就说我集结大批军队，入侵波兰。我签署了一份和平条约\n他们说他们会让我把波兰和其他国家的人一起留在这里\n我保证不会再前进了 很多国家都支持我，包括：\n中国，俄罗斯和法国。但其他国家如美国...",
      "title": "我可以控制一个小国，然后把它改名为一个已经存在的国家名称吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "那就說我集結大批軍隊，入侵波蘭。我簽署了一份和平條約\n他們說他們會讓我把波蘭和其他國家的人一起留在這裏\n我保證不會再前進了 很多國家都支持我，包括：\n中國，俄羅斯和法國。但其他國家如美國...",
      "title": "我可以控制一個小國，然後把它改名爲一個已經存在的國家名稱嗎？"
    }
  ],
  "title": "Can I take control of a small country, and then rename it to a name of a country that already exists?",
  "created_utc": 1613107059,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So let&#39;s say I gather a large army and I invade Poland. I sign a peace treaty with the other countries and they say they&#39;ll let me keep Poland with the promise that I won&#39;t advance further. Lot&#39;s of countries have my back, including China, Russia and France. But other countries like The United States of America and England disagree.</p>\n\n<p>I then decide to change the name of Poland to &quot;The United States of America&quot; this name obviously already exists, but I insist. I make it formal and all, and I even use the USA flag. I do not consider USA as part of USA. USA is its own country. </p>\n\n<p>The countries that have my back agree to call my country &quot;The United States of America&quot; out of spite against actual The United States of America some leaders and people in power even think its funny and they approve of my decision.</p>\n\n<p>Is this possible? Are names of countries copyrighted or something? Ill refuse to change the name. That will USA do in a situation like this? Will they risk starting a world war over a name?</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/NoStupidQuestions/comments/li045v/can_i_take_control_of_a_small_country_and_then/",
  "subreddit": "NoStupidQuestions",
  "id": "li045v",
  "is_self": true,
  "media": null,
  "is_video": false
}