{
  "author": "shannister",
  "original_created_utc": 1647074648,
  "title": "How can people root for crypto’s valuation exploding AND wanting for it to be a method of payment at the same time? Isn’t that an inherent contradiction?",
  "created_utc": 1647146204,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have a very hard time reconciliating those two objectives:&lt;/p&gt;\n\n&lt;p&gt;1/ rooting for crypto as an investment that can buy you financial independence through fast paced growth. &lt;/p&gt;\n\n&lt;p&gt;2/ rooting for crypto as a form of payment used in everyday life. &lt;/p&gt;\n\n&lt;p&gt;I understand that the intended purpose of crypto is closer to 2/, but unless it finds ways to firmly stabilize its value, I don’t think it can ever really succeed. &lt;/p&gt;\n\n&lt;p&gt;1/ implies taxable events, holding, and risk. Using my crypto to pay for something leads me to tax exposure, potentially liquidating assets at the wrong time, and reducing potential future gains in the good times. &lt;/p&gt;\n\n&lt;p&gt;There is a reason we don’t pay for everyday things in stocks. We may reward them in shares (eg RSUs), but nobody treats stocks as a method of payment because it belongs in the investment assets class.&lt;/p&gt;\n\n&lt;p&gt;From this POV, how can anyone say they want what behaves like an investment asset with limited supply to serve as a currency?  Shouldn’t the valuation (and supply) of each token aim to be a lot more stable than what most projects offer?&lt;/p&gt;\n\n&lt;p&gt;Edit: some people are pointing out the existence of stable coins - I know, and that’s kind of the point. I’m puzzled by the constant celebration of non stablecoins being accepted as payment. I think paying for your latte with ETH is what makes zero sense (unless you’re an absolutist).&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 303,
  "permalink": "/r/CryptoCurrency/comments/tcc721/how_can_people_root_for_cryptos_valuation/",
  "subreddit": "CryptoCurrency",
  "id": "tcc721",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I have a very hard time reconciliating those two objectives:\n\n1/ rooting for crypto as an investment that can buy you financial independence\nthrough fast paced growth.\n\n2/ rooting for crypto as a form of payment used in everyday life.\n\nI understand that the intended purpose of crypto is closer to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "その2つの目的を両立させるのは、とても難しいことなんです。\n\n1/暗号は経済的な独立を買える投資として応援しています。\n速いスピードで成長することで\n\n2/ 日常生活で使用される決済手段としての暗号を支持すること。\n\n私は、暗号の意図された目的が、より近いものであることを理解しています...",
      "title": "暗号の評価額が爆発的に上がることと、暗号が決済手段であることを同時に望んでいる人たちは、どうすればいいのでしょうか？それは本質的な矛盾ではないでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我很难调和这两个目标。\n\n1/支持加密货币作为一种投资，可以通过快速增长为你购买财务独立。\n通过快节奏的增长。\n\n2/支持加密货币作为日常生活中的一种支付形式。\n\n我明白，加密货币的预期目的更接近于...",
      "title": "人们怎么能既支持加密货币的估值爆炸，又希望它成为一种支付方式？这不是一个内在的矛盾吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我很難調和這兩個目標。\n\n1/支持加密貨幣作爲一種投資，可以通過快速增長爲你購買財務獨立。\n通過快節奏的增長。\n\n2/支持加密貨幣作爲日常生活中的一種支付形式。\n\n我明白，加密貨幣的預期目的更接近於...",
      "title": "人們怎麼能既支持加密貨幣的估值爆炸，又希望它成爲一種支付方式？這不是一個內在的矛盾嗎？"
    }
  ]
}