{
  "author": "RusticBohemian",
  "original_created_utc": 1637954665,
  "title": "Athens, a small city of 250k, gave rise to a miracle in 500 BC and produced Socrates, Plato, Aristotle, Aristophanes, Xenophon, Sophocles, Archimedes, Euclid, Pythagoras, Thucydides, Herodotus, Solon, Pericles, etc — it seems so unlikely! What juice were they drinking? What birthed such brilliance?",
  "created_utc": 1637970187,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>P.S.</strong> I&#39;m aware Archimedes, Euclid, Pythagoras, and Herodotus weren’t from Athens, but they were drawn to whatever voodoo the Athenians cooked up.</p>\n\n<p>So what was the voodoo? Why did it happen, and why have such concentrations of brilliance occurred so rarely in the history of civilization?</p>\n</div><!-- SC_ON -->",
  "score": 115,
  "permalink": "/r/AskHistorians/comments/r2urd2/athens_a_small_city_of_250k_gave_rise_to_a/",
  "subreddit": "AskHistorians",
  "id": "r2urd2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "P.S. I'm aware Archimedes, Euclid, Pythagoras, and Herodotus weren’t from\nAthens, but they were drawn to whatever voodoo the Athenians cooked up.\n\nSo what was the voodoo? Why did it happen, and why have such concentrations of\nbrilliance occurred so rarely in the history of civilization?",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "P.S. アルキメデス、ユークリッド、ピタゴラス、ヘロドトスの出身ではないことは承知しています。\nアテネ出身ではありませんが、アテネ人が作ったどんなブードゥーにも惹かれていました。\n\nでは、そのブードゥーとは何だったのか？なぜこのようなことが起きたのか、そしてなぜこのような才能の集中が\n文明の歴史の中で、これほどの輝きが集中することはめったにない。",
      "title": "25万人の小都市であるアテネが、紀元前500年に奇跡を起こし、ソクラテス、プラトン、アリストテレス、アリストファネス、クセノフォン、ソフォクレス、アルキメデス、ユークリッド、ピタゴラス、トゥキディデス、ヘロドトス、ソロン、ペリクレスなどを輩出したのですから、とても信じられませんよね。彼らはどんなジュースを飲んでいたのか？何がそのような輝きを生んだのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "P.S. 我知道阿基米德、欧几里德、毕达哥拉斯和希罗多德都不是来自雅典。\n雅典人，但他们被雅典人炮制的任何巫术所吸引。\n\n那么巫术是什么？它为什么会发生，为什么会有如此集中的\n为什么在文明史上很少出现这样的辉煌？",
      "title": "雅典，一个只有25万人口的小城市，在公元前500年产生了一个奇迹，并产生了苏格拉底、柏拉图、亚里士多德、阿里斯托芬、色诺芬、索福克勒斯、阿基米德、欧几里德、毕达哥拉斯、修昔底德、希罗多德、索隆、伯里克利等等--这看起来太不可能了! 他们喝的是什么果汁？是什么孕育了这样的光辉？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "P.S. 我知道阿基米德、歐幾里德、畢達哥拉斯和希羅多德都不是來自雅典。\n雅典人，但他們被雅典人炮製的任何巫術所吸引。\n\n那麼巫術是什麼？它爲什麼會發生，爲什麼會有如此集中的\n爲什麼在文明史上很少出現這樣的輝煌？",
      "title": "雅典，一個只有25萬人口的小城市，在公元前500年產生了一個奇蹟，併產生了蘇格拉底、柏拉圖、亞里士多德、阿里斯托芬、色諾芬、索福克勒斯、阿基米德、歐幾里德、畢達哥拉斯、修昔底德、希羅多德、索隆、伯里克利等等--這看起來太不可能了! 他們喝的是什麼果汁？是什麼孕育了這樣的光輝？"
    }
  ]
}