{
  "author": "brosven7",
  "original_created_utc": 1644346805,
  "title": "Metamask should warn you if you are about to make a big F**k-up the same way your Antivirus Software or Web Browser will warn you - and that has nothing to do with centralization or decentralization.",
  "created_utc": 1644410773,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This isn&amp;#39;t a question about about decentralization or centralization. This is also more than just a simple nice-to-have feature. Imagine you browse websites that knowingly sell your I.P. address and other information to hackers and other malicious actors can openly see what you&amp;#39;re doing and your physical location on a map. Isn&amp;#39;t that dangerous? Don&amp;#39;t our Anti-virus softwares and web browsers stop us from doing these things? Don&amp;#39;t all windows machines have these installed by default?               &lt;/p&gt;\n\n&lt;p&gt;It feels like this is one of those topics that 5 or 10 years down the road, none of us will be discussing because it&amp;#39;s already been implemented for a long long time. If you guys used the first iterations of the internet where you had to memorize I.P. Addresses because there were no DNS names to get to some places online, then pretty much everyone here would agree that no one would use the internet of the late 80s and early 90s today if it were still the same way.                  &lt;/p&gt;\n\n&lt;p&gt;To the people who say, &amp;quot;If you have lots of money in ETH or BTC and you are sending it to an address by mistake, it&amp;#39;s your fuck up and you deserve to lose your money.&amp;quot; You&amp;#39;re missing the point completely. The point is that your antivirus warns you when you are about to make a massive mistake that could lead to something like ransomware, spyware, or trojans getting installed to your PC. I think it would be great to have Metamask fire off an audible warning and a message that says, &amp;quot;The wallet address you are sending funds to is a known contract address and not a hot wallet. The funds you send will not be used by any human being and will be lost forever. Do you wish to continue?&amp;quot; seems fine. Maybe stack it with, something like, &amp;quot;This address is to a known wallet address of an Exchange that suffered a security breach and has ended service to their customers. The funds you send to this wallet address will likely be lost forever.&amp;quot; Not bad...              &lt;/p&gt;\n\n&lt;p&gt;But what if we have someone whose account on an exchange was terminated and then all of the exchanges got together and said, &amp;quot;Let&amp;#39;s make a database of irrecoverable wallet addresses where terminated / irretrievable 0x addresses exist so that users don&amp;#39;t send funds to them by mistake, and let the people at Metamask know this as well.&amp;quot; Sounds like an interesting value proposition.                  &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Finally, by improving the way wallets function we are increasing adoption by eliminating one route where users can screw up simply by stopping them from making a mistake and making them double check an address they send funds to.&lt;/strong&gt;                &lt;/p&gt;\n\n&lt;h1&gt;And I almost forgot: To be clear, I am NOT advocating that wallets block transactions at all. If the user is fully aware of what they are doing, then the opus is on them.&lt;/h1&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 302,
  "permalink": "/r/CryptoCurrency/comments/snrvt9/metamask_should_warn_you_if_you_are_about_to_make/",
  "subreddit": "CryptoCurrency",
  "id": "snrvt9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "This isn't a question about about decentralization or centralization. This is\nalso more than just a simple nice-to-have feature. Imagine you browse websites\nthat knowingly sell your I.P. address and other information to hackers and other\nmalicious actors can openly see what you're doing and your…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは、分権か中央集権かという問題ではありません。これは\nまた、単に「あったらいいな」程度の機能ではありません。ウェブサイトを閲覧することを想像してみてください。\nハッカーにIPアドレスやその他の情報を故意に売っているような、その他の\n悪意ある行為者は、あなたが何をしているのか、あなたのことを公然と見ることができるのです。",
      "title": "メタマスクは、アンチウイルスソフトやウェブブラウザが警告してくれるのと同じように、大きな失敗をしそうになったら警告してくれるはずで、それは集中化とか分散化とは関係ない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这不是一个关于分权或集权的问题。这也是\n也不仅仅是一个简单的 \"好 \"的功能。想象一下，你浏览的网站\n故意将你的I.P.地址和其他信息卖给黑客和其他\n恶意行为者可以公开看到你在做什么和你的...",
      "title": "如果你要犯大错，Metamask应该警告你，就像你的反病毒软件或网络浏览器会警告你一样--这与集中化或分散化没有关系。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這不是一個關於分權或集權的問題。這也是\n也不僅僅是一個簡單的 \"好 \"的功能。想象一下，你瀏覽的網站\n故意將你的I.P.地址和其他信息賣給黑客和其他\n惡意行爲者可以公開看到你在做什麼和你的...",
      "title": "如果你要犯大錯，Metamask應該警告你，就像你的反病毒軟件或網絡瀏覽器會警告你一樣--這與集中化或分散化沒有關係。"
    }
  ]
}