{
  "author": "spicy-piefarm-er-sum",
  "original_created_utc": 1646373145,
  "title": "Instead of making trans people play on either men’s or women’s sports teams, why not have athletics for people who are trans?",
  "created_utc": 1646385877,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I see this argument a lot when people don’t want transwomen playing in women’s sports, but transpeople also deserve to feel their gender is accepted.&lt;/p&gt;\n\n&lt;p&gt;More broadly, Why does a trans person have to be labeled “woman” or “man” (i.e FTM, MTF)? Can’t they just be called a different gender, which would be transgender?&lt;/p&gt;\n\n&lt;p&gt;EDIT: Some of the words I used here were downright ignorant and I am sorry to anyone I may have hurt with my poor thought processes! Love to all ♥️&lt;/p&gt;\n\n&lt;p&gt;EDIT: there are lots of great conversations happening here and many of you have made great contributions, I appreciate the thoughts and am learning along with all who read!&lt;/p&gt;\n\n&lt;p&gt;Some of y’all are content with your ignorance, I know I was actually dumb af for thinking even for a sec that trans is a separate gender (trans women are women and trans men are men!) but I can tell some of y’all would keep the cash if you found someone’s wallet on the street just saying&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/NoStupidQuestions/comments/t6c030/instead_of_making_trans_people_play_on_either/",
  "subreddit": "NoStupidQuestions",
  "id": "t6c030",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I see this argument a lot when people don’t want transwomen playing in women’s\nsports, but transpeople also deserve to feel their gender is accepted.\n\nMore broadly, Why does a trans person have to be labeled “woman” or “man” (i.e\nFTM, MTF)? Can’t they just be called a different gender, which would…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この議論は、トランスジェンダーの女性が女子スポーツ界で活躍することを望まない人たちがよく見かける\nしかし、トランスジェンダーも自分の性別が受け入れられていると感じる資格があります。\n\nもっと広く言えば、なぜトランスの人は「女」や「男」というレッテルを貼られなければならないのか（すなわち\nFTM、MTF)なのでしょうか？別の性別で呼ぶことはできないのでしょうか？",
      "title": "トランスの人たちを男性か女性のどちらかのスポーツチームでプレーさせるのではなく、トランスの人たちのための陸上競技があってもいいのでは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当人们不希望变性人参加女性运动时，我经常看到这种说法。\n但变性人也应该感到他们的性别被接受。\n\n更广泛地说，为什么一个变性人必须被贴上 \"女人 \"或 \"男人 \"的标签（即\nFTM，MTF）？难道他们就不能被称为不同的性别，这将...",
      "title": "与其让变性人在男人或女人的运动队里打球，为什么不为变性人设立竞技体育呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當人們不希望變性人蔘加女性運動時，我經常看到這種說法。\n但變性人也應該感到他們的性別被接受。\n\n更廣泛地說，爲什麼一個變性人必須被貼上 \"女人 \"或 \"男人 \"的標籤（即\nFTM，MTF）？難道他們就不能被稱爲不同的性別，這將...",
      "title": "與其讓變性人在男人或女人的運動隊裏打球，爲什麼不爲變性人設立競技體育呢？"
    }
  ]
}