{
  "author": "CreatureWarrior",
  "the_new_excerpt": "Like, I learn new skills really fast and I get good grades in school without\nworking too much. I like math, philosophy, music and stuff like that.\n\nBut my brain just decides to shut down all common sense way too often. Just the\nother day on r/facepalm [/r/facepalm], there was this post about how…",
  "original_created_utc": 1617782290,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "例えば、新しい技術を習得するのが早いとか、あまり働かなくても学校の成績が良いとか。\n学校の成績もいい。私は数学、哲学、音楽などが好きです。\n\nしかし、私の脳は常識的な判断を頻繁にシャットダウンしてしまいます。つい先日\n先日、r/facepalm [/r/facepalm]で、どのように...という投稿がありました。",
      "title": "全体的には頭がいいのに、あまりにもバカなことが多い（突然、常識が体から離れてしまうような）と感じている人はいませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "比如，我学习新技能的速度非常快，而且我在学校里的成绩也很好，没有\n工作太多。我喜欢数学、哲学、音乐之类的东西。\n\n但我的大脑只是决定关闭 所有常识的方式太频繁。只是...\n前几天在r/facepalm [/r/facepalm]上，有这样一个帖子，关于如何... ...",
      "title": "还有人觉得自己整体上很聪明，但太笨的方式太多（比如，突然间你所有的常识都离开了你的身体）？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "比如，我學習新技能的速度非常快，而且我在學校裏的成績也很好，沒有\n工作太多。我喜歡數學、哲學、音樂之類的東西。\n\n但我的大腦只是決定關閉 所有常識的方式太頻繁。只是...\n前幾天在r/facepalm [/r/facepalm]上，有這樣一個帖子，關於如何... ...",
      "title": "還有人覺得自己整體上很聰明，但太笨的方式太多（比如，突然間你所有的常識都離開了你的身體）？"
    }
  ],
  "title": "Anyone else feel like they're smart overall, but way too stupid way too often (like, suddenly all of your common sense leaves your body)?",
  "created_utc": 1617800701,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Like, I learn new skills really fast and I get good grades in school without working too much. I like math, philosophy, music and stuff like that. </p>\n\n<p>But my brain just decides to shut down all common sense way too often. Just the other day on <a href=\"/r/facepalm\">r/facepalm</a>, there was this post about how climate change is causing sea levels to rise. </p>\n\n<p>The first guy was like &quot;my glass won&#39;t start to spill over just because the ice in it starts to melt&quot; and for a little moment, I was like &quot;yeah, very true. This checks out. So why <em>does</em> climate change cause such things?&quot; And in the very next picture, the other guy said something like &quot;did you know that there is also ice on land?&quot; and I felt so dumb. How could I forget that there is ice on land? It&#39;s literally snowing outside so that should be obvious. </p>\n\n<p>Also, when I was little and me and my mom were baking this bundt cake and the mixture was in the mold. My mom told me to put it in the oven and I was so confused because &quot;the cake mix will leak out if I put it in&quot; and she kept telling me to put it in the oven. I put it in like it&#39;s served and it started falling from the mold. It never occured to me that you can bake stuff upside down..</p>\n\n<p>Just stuff like that. I do better in school than most of my friends, but at the same time this type of shit happens so much that everyone around me thinks that I must be such a dumbass. Why is this and can anyone relate?</p>\n</div><!-- SC_ON -->",
  "score": 111,
  "permalink": "/r/TooAfraidToAsk/comments/mlx6pe/anyone_else_feel_like_theyre_smart_overall_but/",
  "subreddit": "TooAfraidToAsk",
  "id": "mlx6pe",
  "is_self": true,
  "media": null,
  "is_video": false
}