{
  "author": "SomeEpicName",
  "original_created_utc": 1658449786,
  "title": "Why do nerdy couples tend to have such a wholesome, stable energy to them?",
  "created_utc": 1658484784,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Obviously this describe every nerdy couple, but I&amp;#39;ve noticed that I&amp;#39;ve gotten &amp;quot;omg they look so sweet, wholesome, and happy together, they probably don&amp;#39;t fight much and are going to be together forever eeeeee! My heart melts for them&amp;quot; from couples (of any gender) where BOTH partners would be characterized as &amp;quot;nerdy&amp;quot; on their own.&lt;/p&gt;\n\n&lt;p&gt;By &amp;quot;nerdy&amp;quot;, I&amp;#39;m referring to a vibe -- nerds can have any profession and income. Some nerd couples I&amp;#39;ve met consist of animators, graphic designers, app designers, writers, and most commonly software or mechanical engineers. &lt;/p&gt;\n\n&lt;p&gt;The less &amp;quot;sexy&amp;quot; they look (even if they&amp;#39;re still somewhat attractive), the stronger the stable energy is. &lt;/p&gt;\n\n&lt;p&gt;I understand that couples that are more highly educated and are more financially successful tend to stay together longer/have more relational stability. However, wealthy, hot celebrity power couples tend to give me the opposite vibe: they come off as instinctively unstable and conflict-prone. &lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;ve noticed the same vibes from nerd-nerd couples, have your assumptions been right? If so, what do you think the recipe is?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 109,
  "permalink": "/r/TooAfraidToAsk/comments/w4wg3i/why_do_nerdy_couples_tend_to_have_such_a/",
  "subreddit": "TooAfraidToAsk",
  "id": "w4wg3i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Obviously this describe every nerdy couple, but I've noticed that I've gotten\n\"omg they look so sweet, wholesome, and happy together, they probably don't\nfight much and are going to be together forever eeeeee! My heart melts for them\"\nfrom couples (of any gender) where BOTH partners would be…"
}