{
  "author": "FingersX",
  "original_created_utc": 1624924618,
  "title": "Will you get detected at the airport smuggling a Ledger X inside your body ?",
  "created_utc": 1624934272,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Let&#39;s say I don&#39;t trust customs, I want to make sure my cold storage travels with me. I don&#39;t want it to be accessible under any circumstance of me being compromised.</p>\n\n<p>A Ledger X is relatively small and would fit quiet nicely.</p>\n\n<p>Will the metal detector be able to recognize that piece of hardware in my ass and if so, what would be the consequences if that were to happen?</p>\n\n<p>If anyone has any experience with carrying a cold storage device in your ass, I&#39;d be happy for any insights.</p>\n</div><!-- SC_ON -->",
  "score": 245,
  "permalink": "/r/CryptoCurrency/comments/o9wkuj/will_you_get_detected_at_the_airport_smuggling_a/",
  "subreddit": "CryptoCurrency",
  "id": "o9wkuj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Let's say I don't trust customs, I want to make sure my cold storage travels\nwith me. I don't want it to be accessible under any circumstance of me being\ncompromised.\n\nA Ledger X is relatively small and would fit quiet nicely.\n\nWill the metal detector be able to recognize that piece of hardware in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "例えば、私が税関を信用していないとしたら、私の保冷剤を確実に持ち運びたいと思います。\n携行したいと思います。私が危険な目に遭ったとしても、アクセスできないようにしたいのです。\n危害を加えられないようにしたい。\n\nLedger Xは比較的小さく、静かに収まります。\n\n金属探知機は、このハードウェアを認識することができるでしょうか？",
      "title": "空港でLedger Xを体に忍ばせていたら、見つかってしまうのでは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "比方说，我不相信海关，我想确保我的冷库和我一起旅行。\n与我同行。我不希望在任何情况下，我的冷库都能被接触到。\n妥协。\n\n一个Ledger X相对较小，可以很好地适应。\n\n金属探测器是否能够识别这块硬件？",
      "title": "在机场，你在体内偷带Ledger X会不会被发现？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "比方說，我不相信海關，我想確保我的冷庫和我一起旅行。\n與我同行。我不希望在任何情況下，我的冷庫都能被接觸到。\n妥協。\n\n一個Ledger X相對較小，可以很好地適應。\n\n金屬探測器是否能夠識別這塊硬件？",
      "title": "在機場，你在體內偷帶Ledger X會不會被發現？"
    }
  ]
}