{
  "author": "Pandasx",
  "original_created_utc": 1626290059,
  "title": "Thought I had a great idea for a service I could provide and accept crypto as payment for, didn't consider a pretty big fault in the plan...",
  "created_utc": 1626312905,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I recently bought all the materials I&#39;d need to stamp my seed phrase into small metal plates and then conveniently store it (basically a poor man&#39;s Cryptosteel). I liked the result so much that I decided I would offer this as a service to you all, and charge $5 or so (+shipping) to stamp your seed phrases. Plan was to accept ONLY crypto for this service.</p>\n\n<p>I&#39;m sure most of you have realized the fault in my plan already. If not, let me simplify: &quot;Send me your seed phrase so I can stamp it and send it to you&quot;. Not simple enough, lets just stick to step one: &quot;Send me your seed phrase&quot;.</p>\n\n<p>Based on the obvious issue with my plan I now have a bunch of circular metal plates, small shipping tubes, keychain strings, and a metal stamping kit that I have no plans for.</p>\n\n<p>Anyone have anything OTHER than a seed phrase they want stamped?  </p>\n\n<p>Here&#39;s some photos of the results/materials:</p>\n\n<p><a href=\"https://preview.redd.it/4leosyz998b71.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=30edd7f180e84134e3e57e898f4ec972f2fe9dac\">https://preview.redd.it/4leosyz998b71.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=30edd7f180e84134e3e57e898f4ec972f2fe9dac</a></p>\n\n<p><a href=\"https://preview.redd.it/xo7lxyea98b71.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=4ff091d57802d313c259937214e061838d9a9c24\">https://preview.redd.it/xo7lxyea98b71.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=4ff091d57802d313c259937214e061838d9a9c24</a></p>\n</div><!-- SC_ON -->",
  "score": 243,
  "permalink": "/r/CryptoCurrency/comments/okbe8t/thought_i_had_a_great_idea_for_a_service_i_could/",
  "subreddit": "CryptoCurrency",
  "id": "okbe8t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I recently bought all the materials I'd need to stamp my seed phrase into small\nmetal plates and then conveniently store it (basically a poor man's\nCryptosteel). I liked the result so much that I decided I would offer this as a\nservice to you all, and charge $5 or so (+shipping) to stamp your seed…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は最近、自分の種のフレーズを小さな金属板に刻印するために必要な材料をすべて購入しました。\n金属板に刻印して便利に保管するために必要な材料を買い揃えました。\nCryptosteel）を購入しました。) その結果、とても気に入ったので、これを皆さんにサービスとして提供することにしました。\n種のスタンプを押すのに5ドルほど（＋送料）を徴収することにしました。",
      "title": "自分が提供するサービスのために暗号の支払いを受け付けるという素晴らしいアイデアがあると思っていましたが、計画にかなり大きな欠陥があることを考慮していませんでした...。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近买了所有我需要的材料，把我的种子短语印在小金属板上，然后方便地储存起来。\n金属板，然后方便地储存它（基本上是穷人的\nCryptosteel）。) 我非常喜欢这个结果，所以我决定将其作为一项服务提供给你们。\n服务，并收取5美元左右的费用（+运费）为你的种子盖章......",
      "title": "我以为我有一个伟大的想法，我可以提供一个服务，并接受加密货币作为付款，没有考虑到计划中一个相当大的错误......"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近買了所有我需要的材料，把我的種子短語印在小金屬板上，然後方便地儲存起來。\n金屬板，然後方便地儲存它（基本上是窮人的\nCryptosteel）。) 我非常喜歡這個結果，所以我決定將其作爲一項服務提供給你們。\n服務，並收取5美元左右的費用（+運費）爲你的種子蓋章......",
      "title": "我以爲我有一個偉大的想法，我可以提供一個服務，並接受加密貨幣作爲付款，沒有考慮到計劃中一個相當大的錯誤......"
    }
  ]
}