{
  "author": "kkwantstobebig",
  "the_new_excerpt": "This is just the start but it is progress towards the solidification of the\ncrypto movement!\n\nThe first of the five areas mentioned by the VISA CEO is enabling consumers to\npurchase these currencies or Bitcoin, noting that they are exerting effort to\nensure that they are facilitating the use of Visa…",
  "original_created_utc": 1620118857,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これはほんの始まりに過ぎませんが、これは、このような製品の固化に向けた進歩です。\nこれは始まりに過ぎませんが、暗号化の動きを確固たるものにするための進歩です\n\nVISAのCEOが言及した5つの分野のうち最初のものは、消費者がこれらの通貨やビットコインを購入できるようにすることです。\nこれらの通貨やビットコインの購入を可能にすることで、VISAの利用を促進するために努力していると述べています。\n努力しています。",
      "title": "VISAは5つの重要な暗号分野に注力します!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这仅仅是一个开始，但它是朝着稳固加密运动的方向发展的。\n的进展。\n\nVISA首席执行官提到的五个领域中的第一个是使消费者能够\n购买这些货币或比特币，并指出他们正在努力确保他们为使用Visa...\n确保他们正在促进使用Visa...",
      "title": "VISA将专注于5个关键的加密货币领域!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這僅僅是一個開始，但它是朝着穩固加密運動的方向發展的。\n的進展。\n\nVISA首席執行官提到的五個領域中的第一個是使消費者能夠\n購買這些貨幣或比特幣，並指出他們正在努力確保他們爲使用Visa...\n確保他們正在促進使用Visa...",
      "title": "VISA將專注於5個關鍵的加密貨幣領域!"
    }
  ],
  "title": "VISA will focus on 5 key crypto areas!",
  "created_utc": 1620156977,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is just the start but it is progress towards the solidification of the crypto movement! </p>\n\n<p>The first of the five areas mentioned by the VISA CEO is enabling consumers to purchase these currencies or Bitcoin, noting that they are exerting effort to ensure that they are facilitating the use of Visa cards to buy.</p>\n\n<p>The second one is allowing digital currency cash-outs to fiat, which means converting digital currency to fiat on a Visa credential, making the funds available for shopping at any of the 70 million Visa merchants.</p>\n\n<p>The third area is enabling financial institutions and fintech partners to offer crypto options for their customers. Kelly said they have created APIs that give customers of financial institutions the ability to purchase, hold and even trade digital currencies held by the first federally charted digital asset bank in the U.S., Anchorage.</p>\n\n<p>Meanwhile, the fourth area is settlement. With this regard, Kelly said, “We’ve upgraded our infrastructure to allow a financial institution to settle with these in a digital currency with stablecoin, starting with USDC.”</p>\n\n<p>Kelly said the last area of opportunity and, perhaps one of the most challenging, in the crypto space that they are focusing on is working with central banks.</p>\n</div><!-- SC_ON -->",
  "score": 169,
  "permalink": "/r/CryptoCurrency/comments/n4jr6s/visa_will_focus_on_5_key_crypto_areas/",
  "subreddit": "CryptoCurrency",
  "id": "n4jr6s",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380964321
}