{
  "author": "E-Man-Free-Man",
  "original_created_utc": 1643797143,
  "title": "Why is being Jewish a religion as well as \"race?\"",
  "created_utc": 1643816276,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t mean this question in any sort of mean spirited way, I&amp;#39;m just confused. I see talk of Judaism as a race of people. But isn&amp;#39;t race more genetic oriented? You can&amp;#39;t &amp;quot;convert&amp;#39; to being white, black, asian, etc. But you can convert to Judaism due to change in personal philosophy. Why is Judaism considered a race as well as religion?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/sil90b/why_is_being_jewish_a_religion_as_well_as_race/",
  "subreddit": "NoStupidQuestions",
  "id": "sil90b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I don't mean this question in any sort of mean spirited way, I'm just confused.\nI see talk of Judaism as a race of people. But isn't race more genetic oriented?\nYou can't \"convert' to being white, black, asian, etc. But you can convert to\nJudaism due to change in personal philosophy. Why is Judaism…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この質問は決して意地悪な意味ではなく、ただ混乱しているのです。\nユダヤ教が人種であるという話を目にします。しかし、人種はもっと遺伝的なものではないのでしょうか？\n白人、黒人、アジア人などに「改宗」することはできません。しかし、次のように改宗することは可能です。\n個人の思想の変化によるユダヤ教。なぜユダヤ教が...",
      "title": "なぜユダヤ人であることは、\"人種 \"であると同時に \"宗教 \"なのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不是说这个问题有什么恶意，我只是感到困惑。\n我看到有人说犹太教是一个人种。但种族不是更倾向于遗传吗？\n你不能 \"转换 \"为白人、黑人、亚洲人等。但你可以因为个人的改变而转换为\n犹太教，因为个人理念的改变。为什么犹太教是...",
      "title": "为什么作为犹太人既是一种宗教，又是 \"种族\"？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不是說這個問題有什麼惡意，我只是感到困惑。\n我看到有人說猶太教是一個人種。但種族不是更傾向於遺傳嗎？\n你不能 \"轉換 \"爲白人、黑人、亞洲人等。但你可以因爲個人的改變而轉換爲\n猶太教，因爲個人理念的改變。爲什麼猶太教是...",
      "title": "爲什麼作爲猶太人既是一種宗教，又是 \"種族\"？"
    }
  ]
}