{
  "author": "Sukh6",
  "the_new_excerpt": "My research into BB lead me to Connected Cars, following is a summary of the\nreport. Reports worth reading, there are charts and diagrams in the report that\nadd value, which are not included here.\n\nWhat are Connected Cars (CC): A car that has its own connection to the internet\nallowing it to share…",
  "original_created_utc": 1613525208,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我对BB的研究让我找到了互联汽车，以下是我的总结。\n报告。报告值得一读，报告中的图表有\n增加价值，这里不包括这些。\n\n什么是互联汽车（CC）。汽车有自己的互联网连接。\n允许它分享...",
      "title": "黑莓IVY与互联汽车(McKensey&Co报告)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我對BB的研究讓我找到了互聯汽車，以下是我的總結。\n報告。報告值得一讀，報告中的圖表有\n增加價值，這裏不包括這些。\n\n什麼是互聯汽車（CC）。汽車有自己的互聯網連接。\n允許它分享...",
      "title": "黑莓IVY與互聯汽車(McKensey&Co報告)"
    }
  ],
  "title": "Blackberry IVY & Connected Cars (McKensey&Co Report)",
  "created_utc": 1613533109,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My research into BB lead me to Connected Cars, following is a summary of the report. Reports worth reading, there are charts and diagrams in the report that add value, which are not included here. </p>\n\n<p><strong>What are Connected Cars (CC):</strong>\nA car that has <em>its own connection to the internet</em> allowing it to share internet access and data with other devices inside and outside the car. Apart of the IoTs (everyday items connected to the internet).</p>\n\n<p>Per McKinsey, connected cars will provide unique customer experience + cost and revenue benefits to mobility companies (OEMs, suppliers, dealers, insurers, fleets, tech players, etc) </p>\n\n<p><strong>The Opportunity</strong>\n<em>Monetize data from connected cars</em> (currently overlooked) - Cars allow for regular and extensive interactions with end customers. In other words, CC could be the new iPhone</p>\n\n<p>7/10 most valuable companies in the world generate billions in profits from data based services</p>\n\n<p>Industries are transitioning from <em>hardware to software-as-a-service (SaaS) and subscription business</em></p>\n\n<p>37% of consumers would switch car brands to achieve improvements in ACES (Autonomous driving, Connectivity, Electrification and shared mobility), in China, 56% would switch brands</p>\n\n<p>39% of customers want additional digital features , 47% for premium OEMs</p>\n\n<p><strong>Data Monetization Should Accelerate (5 Reasons)</strong></p>\n\n<p><strong>1. OEMS are focused on ST profitability &amp; in making LT investments.</strong>\nTraditional OEMS must make their core business profitable in the ST while facing challenging tailwinds (CoVid 19 decreases in sales, ICE bans worldwide and stringent emissions regulation, potential defaults on ballooning auto loans, Chip shortage)</p>\n\n<p>Switching from ICE to EV will result in <em>lower margins</em> as aftersales revenue will decrease due to lower maintenance, <em>requiring other revenue sources</em></p>\n\n<p>Connected services require low initial investment and have faster development timelines compared to other technologies like ADAS (billions in investment required)</p>\n\n<p>CCs can therefore offer <em>ST revenue and profit opportunities higher margins and recurring revenue streams</em></p>\n\n<p><strong>2. Improving Customer Experience</strong>\nCurrently cars provide poor customer experience (complex sign-up and log in process) - few extend beyond trail and have to compete with smartphones for customer attention</p>\n\n<p>New EV OEMS are quick to provide updates to customers cars + Tech companies are developing OS that provide access to full ecosystem of internal and external applications, such as maps -&amp;gt; approach is similar to smartphones not cars</p>\n\n<p><strong>3. Using Data to respond to regulatory pressures and new security requirements.</strong>\nData regulation is becoming more strict, although new guidelines <em>provide clear framework for OEMs and data customers, rather than limiting the speed and development of data monetization</em></p>\n\n<p><em>Cybersecurity is increasingly important for connected cars</em>: UN Economic Commission for Europe <em>requires</em> OEMs to ensure cybersecurity throughout the development process and fix any software issues with OTA updates</p>\n\n<p><strong>4. Dealing with technology advances &amp;amp; new players</strong>\n a) more powerful E/E (electronic/electric) architectures that enable features such as OTA updates\n b) improved <em>sensors, including cameras and light detection and ranging (LiDAR), that collect additional data points</em>\n c) significantly increased computing power and interconnectivity</p>\n\n<p><strong>5. Increased Importance of Life Cycle monetization and new business models</strong>\nAuto industry is moving rewards life-cycle monetization, rather than focusing on revenues at point of sale and in the aftermarket, these trends will likely accelerate due to: <em>Sales shifting online &amp;amp; Subscriptions models will become more popular</em></p>\n\n<p><strong>Conclusion</strong>\nLeveraging car data and connectivity would enable use cases (9 outlined in the article), I will highlight 3:</p>\n\n<p>a) competitive in-car entertainment options that can compete with smartphones\n b) infrastructure operators lack data about condition and usage of their assets (battery chargers)\n c) fleet operators missing data that could help better manage vehicle maintenance and repair</p>\n\n<p>These use cases could generate <strong>$250 and $400 billion in annual incremental value for players across the ecosystem</strong></p>\n\n<p>By 2030, 95% of new vehicles sold globally will be connected, up from 50% today</p>\n\n<p><strong>Blackberry IVY</strong> is being developed to &quot;harness data in the car&quot;</p>\n\n<p>Disclosure: 400 Shares of BB and adding more as I continue my research</p>\n\n<p><a href=\"https://www.mckinsey.com/industries/automotive-and-assembly/our-insights/unlocking-the-full-life-cycle-value-from-connected-car-data#\">https://www.mckinsey.com/industries/automotive-and-assembly/our-insights/unlocking-the-full-life-cycle-value-from-connected-car-data#</a></p>\n</div><!-- SC_ON -->",
  "score": 241,
  "permalink": "/r/stocks/comments/llis41/blackberry_ivy_connected_cars_mckenseyco_report/",
  "subreddit": "stocks",
  "id": "llis41",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728625097
}