{
  "author": "Lewd_Topiary",
  "original_created_utc": 1655008108,
  "title": "In the Canadian Prairies, winters are very long and temps can dip into in the -40s. How did Indigenous people avoid dying from exposure in these incredibly harsh conditions?",
  "created_utc": 1655023636,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m curious specifically about Cree people who lived in places like Alberta and Saskatchewan pre-colonization. &lt;/p&gt;\n\n&lt;p&gt;Indigenous groups in Arctic regions of Canada famously use igloos, seal skin clothing etc., to survive the frigid temps, but the Prairies can often get just as cold and to my knowledge those items weren&amp;#39;t a part of traditional Cree life-- so how did they survive?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 109,
  "permalink": "/r/AskHistorians/comments/vae8qu/in_the_canadian_prairies_winters_are_very_long/",
  "subreddit": "AskHistorians",
  "id": "vae8qu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm curious specifically about Cree people who lived in places like Alberta and\nSaskatchewan pre-colonization.\n\nIndigenous groups in Arctic regions of Canada famously use igloos, seal skin\nclothing etc., to survive the frigid temps, but the Prairies can often get just\nas cold and to my knowledge…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アルバータ州などに住んでいたクリー族について、特に興味があります。\n特に、植民地化される前のアルバータ州やサスカチュワン州などに住んでいたクリー族に興味があります。\n\nカナダの北極圏に住む先住民は、イグルーやアザラシの皮の衣服などを使って極寒を乗り切っているのは有名な話ですが、プレー族の場合はどうなのでしょうか。\n衣服などを使用することで極寒の地を生き延びてきました。\nしかし、大草原は寒さが厳しく、私の知る限りでは...",
      "title": "カナダ大草原の冬はとても長く、気温はマイナス40度にもなります。このような厳しい環境の中で、先住民はどのようにして被ばくによる死亡を防いできたのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我对居住在阿尔伯塔省和萨斯喀彻温省等地的克里人特别感到好奇。\n殖民化前的萨斯喀彻温省。\n\n加拿大北极地区的土著群体以使用冰屋、海豹皮等而闻名。\n衣服等，在寒冷的气温下生存，但大草原上也经常会有\n据我所知，大草原也同样寒冷...",
      "title": "在加拿大大草原，冬天非常漫长，温度可以降到零下40度。土著人是如何在这些令人难以置信的恶劣条件下避免暴露而死亡的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我對居住在阿爾伯塔省和薩斯喀徹溫省等地的克里人特別感到好奇。\n殖民化前的薩斯喀徹溫省。\n\n加拿大北極地區的土著羣體以使用冰屋、海豹皮等而聞名。\n衣服等，在寒冷的氣溫下生存，但大草原上也經常會有\n據我所知，大草原也同樣寒冷...",
      "title": "在加拿大大草原，冬天非常漫長，溫度可以降到零下40度。土著人是如何在這些令人難以置信的惡劣條件下避免暴露而死亡的？"
    }
  ]
}