{
  "author": "DonOntario",
  "the_new_excerpt": "In The Cafe, a 1991 episode of Seinfeld's third season, Jerry befriends Babu\nBhatt, a Pakistani immigrant and restaurant-owner, and convinces Babu to change\nhis restaurant to serve exclusively food from his native Pakistan.\n\nBabu and Jerry treat this as a novel suggestion which Babu considers risky.…",
  "original_created_utc": 1612794711,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在咖啡馆，1991年的Seinfeld的第三季的情节，杰里结识巴布\n巴特，一个巴基斯坦移民和餐馆老板，并说服巴布改变。\n他的餐厅只提供来自他的家乡巴基斯坦的食物。\n\n巴布和杰瑞把这作为一个新奇的建议，巴布认为是冒险的....。",
      "title": "Jerry Seinfeld建议Babu Bhatt开一家巴基斯坦餐厅，是否真的如该节目所建议的那样，在90年代初的纽约有创新？1991年，著名的纽约人对巴基斯坦食品不熟悉吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在咖啡館，1991年的Seinfeld的第三季的情節，傑裏結識巴布\n巴特，一個巴基斯坦移民和餐館老闆，並說服巴布改變。\n他的餐廳只提供來自他的家鄉巴基斯坦的食物。\n\n巴布和傑瑞把這作爲一個新奇的建議，巴布認爲是冒險的....。",
      "title": "Jerry Seinfeld建議Babu Bhatt開一家巴基斯坦餐廳，是否真的如該節目所建議的那樣，在90年代初的紐約有創新？1991年，著名的紐約人對巴基斯坦食品不熟悉嗎？"
    }
  ],
  "title": "Was Jerry Seinfeld's suggestion that Babu Bhatt open a Pakistani restaurant actually as innovative in early 90s NYC as suggested by that show? Were famously-cosmopolitan New Yorkers unfamiliar with Pakistani food in 1991?",
  "created_utc": 1612810403,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In <em>The Cafe</em>, a 1991 episode of <em>Seinfeld</em>&#39;s third season, Jerry befriends Babu Bhatt, a Pakistani immigrant and restaurant-owner, and convinces Babu to change his restaurant to serve exclusively food from his native Pakistan.  </p>\n\n<p>Babu and Jerry treat this as a novel suggestion which Babu considers risky.  We even hear Jerry think, &quot;Of course I&#39;ve never had Pakistani food. How bad it could be?&quot;  In the show, it&#39;s suggested that the restaurant fails because of a lack of demand for this cuisine.</p>\n\n<p>New York City has and had a reputation as very cosmopolitan.  Pakistani food does not seem especially obscure or niche in North America nowadays.  Was Pakistani cuisine really that new and rare in New York City in the early &#39;90s?</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/lfcz3m/was_jerry_seinfelds_suggestion_that_babu_bhatt/",
  "subreddit": "AskHistorians",
  "id": "lfcz3m",
  "is_self": true,
  "media": null,
  "is_video": false
}