{
  "author": "Successful_Craft3076",
  "original_created_utc": 1657812556,
  "title": "Bear market is actually nice. here is why:",
  "created_utc": 1657855664,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;When I first invested in crypto around 2021 everyone was talking about buying Lambo or home. Btc was supposed to reach 100k, ADA 5$ and Doge 1$.\nInstead, by the end of the year everything has went to shit.&lt;/p&gt;\n\n&lt;p&gt;This year, story went differently:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;First of all with same amount of money you can buy much more.\nEverything is much more affordable. Just like a big sale. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Everything is already so down that even slightest uptrend means profit. \nAnd tbh most of us are not scared of some nasty nosedive anymore. Those who were scared already left. Another positive trait of bear market.  &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Expectations are much lower. So I for one learned to take out my profit and don&amp;#39;t be greedy. And it worked much better than 5$ ADA plan so far!!&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;We are much closer to bottom. So the chance of us losing money is less than 2021. Some time in future when/if market recovers which price would you rather bought btc at? 60k? 30k? Or 20k?&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;I think bear markets are underrated. They are much more enjoyable for bulls than bears. And I as a bull am having a lots of fun.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 353,
  "permalink": "/r/CryptoCurrency/comments/vyym0r/bear_market_is_actually_nice_here_is_why/",
  "subreddit": "CryptoCurrency",
  "id": "vyym0r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "When I first invested in crypto around 2021 everyone was talking about buying\nLambo or home. Btc was supposed to reach 100k, ADA 5$ and Doge 1$. Instead, by\nthe end of the year everything has went to shit.\n\nThis year, story went differently:\n\n 1. First of all with same amount of money you can buy…"
}