{
  "author": "Doctor-internet",
  "original_created_utc": 1640771195,
  "title": "Is anyone else concerned by the shift of discussion away from technology and towards price?",
  "created_utc": 1640788527,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have been lurking the crypto space 2017, and I have noticed a clear trend away from discussing the technology underpinning blockchain and cryptocurrency, and towards profits.&lt;/p&gt;\n\n&lt;p&gt;While I don&amp;#39;t think it is a bad thing to want to make money, this suggests to me we are near a crash, as when everyone wants to take money out of the system, where does the money come from?&lt;/p&gt;\n\n&lt;p&gt;I am seeing fewer and fewer of the passionate tech nerds and more ordinary people brought in by price hype. I am wondering if anyone else shares my concern?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 159,
  "permalink": "/r/CryptoCurrency/comments/rr4h4t/is_anyone_else_concerned_by_the_shift_of/",
  "subreddit": "CryptoCurrency",
  "id": "rr4h4t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I have been lurking the crypto space 2017, and I have noticed a clear trend away\nfrom discussing the technology underpinning blockchain and cryptocurrency, and\ntowards profits.\n\nWhile I don't think it is a bad thing to want to make money, this suggests to me\nwe are near a crash, as when everyone…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は暗号空間2017を潜り抜けてきましたが、明らかに離れていく傾向にあることに気づきました。\nブロックチェーンと暗号通貨を支える技術の議論から、そして\n利益を追求する。\n\n儲けたいと思うことは悪いことだとは思いませんが、このことは、私に次のことを示唆しています。\nこのままでは暴落が近い。",
      "title": "技術から価格へと議論がシフトしていることに不安を感じる人はいないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直潜伏在2017年的加密货币领域，我注意到一个明显的趋势，那就是远离\n从讨论支撑区块链和加密货币的技术，到讨论区块链和加密货币。\n趋向于利润。\n\n虽然我不认为想赚钱是件坏事，但这对我来说意味着\n我们正在接近崩溃，因为当每个人...",
      "title": "还有人对讨论从技术转向价格感到担忧吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直潛伏在2017年的加密貨幣領域，我注意到一個明顯的趨勢，那就是遠離\n從討論支撐區塊鏈和加密貨幣的技術，到討論區塊鏈和加密貨幣。\n趨向於利潤。\n\n雖然我不認爲想賺錢是件壞事，但這對我來說意味着\n我們正在接近崩潰，因爲當每個人...",
      "title": "還有人對討論從技術轉向價格感到擔憂嗎？"
    }
  ]
}