{
  "author": "jupitersalien",
  "original_created_utc": 1638681615,
  "title": "Whatever happened to \"wholesome\" celebrities, like Bob Ross or Mr. Rogers?",
  "created_utc": 1638696397,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It seems like there&amp;#39;s no such thing as &amp;quot;wholesome&amp;quot; celebrities who speak for kindness and love. Every celeb I see these days are always &amp;quot;cancelled&amp;quot; for being racist, homophobic, transphobic, sexist, etc all those gross and heartbreaking things that shouldn&amp;#39;t exist in the world. The only &amp;quot;wholesome&amp;quot; celeb I see left is Keanu Reeves. Like whatever happened to the sweet kind amazing celebrities who fought for love instead of hate and tell those that being kind and caring is the only way to go in life? &lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Where has all the &amp;quot;wholesome&amp;quot; famous people gone? &lt;/p&gt;\n\n&lt;p&gt;Sorry for sounding like a, as the Reddit community and every other mean person refer it to, &amp;quot;sensitive snowflake&amp;quot; in this. I&amp;#39;m generally confused and worried.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 116,
  "permalink": "/r/NoStupidQuestions/comments/r98ebv/whatever_happened_to_wholesome_celebrities_like/",
  "subreddit": "NoStupidQuestions",
  "id": "r98ebv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It seems like there's no such thing as \"wholesome\" celebrities who speak for\nkindness and love. Every celeb I see these days are always \"cancelled\" for being\nracist, homophobic, transphobic, sexist, etc all those gross and heartbreaking\nthings that shouldn't exist in the world. The only \"wholesome\"…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "を代弁するような「健全な」有名人など存在しないような気がします。\n優しさ、愛。私が最近目にするセレブは皆、いつも「取り消し」になっています。\n人種差別、同性愛嫌悪、トランスフォビック、性差別などなど、キモくて胸が痛くなるようなものばかり。\n世の中に存在してはならないもの。唯一の「健全な」...",
      "title": "ボブ・ロスやミスター・ロジャースのような「健全な」セレブリティはどうなったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "似乎没有所谓的 \"健康 \"的名人，他们代表着\n仁慈和爱。这些天，我看到的每个名人都因 \"被取消 \"而被取消。\n种族主义者、同性恋者、变性者、性别歧视者，等等所有这些粗暴和令人心碎的事情。\n那些不应该存在于世界上的东西。唯一 \"健康的\"...",
      "title": "像鲍勃-罗斯或罗杰斯先生这样的 \"健康 \"名人，到底发生了什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "似乎沒有所謂的 \"健康 \"的名人，他們代表着\n仁慈和愛。這些天，我看到的每個名人都因 \"被取消 \"而被取消。\n種族主義者、同性戀者、變性者、性別歧視者，等等所有這些粗暴和令人心碎的事情。\n那些不應該存在於世界上的東西。唯一 \"健康的\"...",
      "title": "像鮑勃-羅斯或羅傑斯先生這樣的 \"健康 \"名人，到底發生了什麼？"
    }
  ]
}