{
  "author": "Odysseus_Lannister",
  "original_created_utc": 1645226853,
  "title": "Crypto is not designed to be free of any law nor circumvent it to perform criminal activity.",
  "created_utc": 1645274490,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Cryptocurrency was meant to give financial power back to individuals and reduce the reliance on banks/other industries that routinely profit off of people using their money. It was designed to prevent large institutions from being “too big to fail” and being bailed out when economic hardships happen while the common people are left in the cold. &lt;/p&gt;\n\n&lt;p&gt;It is &lt;strong&gt;not&lt;/strong&gt; meant to eschew laws or take down tyrannical governments. Honestly, having an immutable ledger of where you stole something and sent it to is probably poor form anyways.  It was never intended to be a political revolution either. It was trying to be free of inflation and corruption by a single or a few entities who could determine if transactions are approved with ulterior motives. &lt;/p&gt;\n\n&lt;p&gt;For all the people who think crypto entitles you to fund criminals or be criminals yourselves, why? What makes you feel so entitled to these feelings? Have you created your own cryptocurrency?&lt;/p&gt;\n\n&lt;p&gt;Edit: didn’t know this was gonna be so controversial. If you wanna do illegal shit with crypto that’s cool, but you also have to be aware that what you’re doing is still illegal and you’re subject to penalty if caught.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 331,
  "permalink": "/r/CryptoCurrency/comments/svvkge/crypto_is_not_designed_to_be_free_of_any_law_nor/",
  "subreddit": "CryptoCurrency",
  "id": "svvkge",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Cryptocurrency was meant to give financial power back to individuals and reduce\nthe reliance on banks/other industries that routinely profit off of people using\ntheir money. It was designed to prevent large institutions from being “too big\nto fail” and being bailed out when economic hardships…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号通貨は、金融の力を個人に取り戻し、その力を弱めることを目的としています。\n銀行やその他の産業は、人々が使用することで日常的に利益を得ています。\nということです。大規模な金融機関が「大きすぎる」ことを防ぐために設計されました\n経済的苦境に陥ったときに救済される。",
      "title": "暗号は、いかなる法律からも自由であるように設計されていませんし、犯罪行為を行うために法律を回避するものでもありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "加密货币的目的是将金融权力还给个人，并减少对银行/其他行业的依赖。\n对银行/其他行业的依赖，这些行业经常利用人们的钱来获利。\n他们的钱。它的目的是防止大型机构 \"大而不倒\"，并在经济衰退时被救助。\n失败\"，并在经济困难时被拯救出来...",
      "title": "Crypto的设计不是为了不受任何法律约束，也不是为了规避法律来进行犯罪活动。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "加密貨幣的目的是將金融權力還給個人，並減少對銀行/其他行業的依賴。\n對銀行/其他行業的依賴，這些行業經常利用人們的錢來獲利。\n他們的錢。它的目的是防止大型機構 \"大而不倒\"，並在經濟衰退時被救助。\n失敗\"，並在經濟困難時被拯救出來...",
      "title": "Crypto的設計不是爲了不受任何法律約束，也不是爲了規避法律來進行犯罪活動。"
    }
  ]
}