{
  "author": "Odysseus_Lannister",
  "original_created_utc": 1645226853,
  "title": "Crypto is not designed to be free of any law nor circumvent it to perform criminal activity.",
  "created_utc": 1645274490,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Cryptocurrency was meant to give financial power back to individuals and reduce the reliance on banks/other industries that routinely profit off of people using their money. It was designed to prevent large institutions from being “too big to fail” and being bailed out when economic hardships happen while the common people are left in the cold. &lt;/p&gt;\n\n&lt;p&gt;It is &lt;strong&gt;not&lt;/strong&gt; meant to eschew laws or take down tyrannical governments. Honestly, having an immutable ledger of where you stole something and sent it to is probably poor form anyways.  It was never intended to be a political revolution either. It was trying to be free of inflation and corruption by a single or a few entities who could determine if transactions are approved with ulterior motives. &lt;/p&gt;\n\n&lt;p&gt;For all the people who think crypto entitles you to fund criminals or be criminals yourselves, why? What makes you feel so entitled to these feelings? Have you created your own cryptocurrency?&lt;/p&gt;\n\n&lt;p&gt;Edit: didn’t know this was gonna be so controversial. If you wanna do illegal shit with crypto that’s cool, but you also have to be aware that what you’re doing is still illegal and you’re subject to penalty if caught.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 331,
  "permalink": "/r/CryptoCurrency/comments/svvkge/crypto_is_not_designed_to_be_free_of_any_law_nor/",
  "subreddit": "CryptoCurrency",
  "id": "svvkge",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Cryptocurrency was meant to give financial power back to individuals and reduce\nthe reliance on banks/other industries that routinely profit off of people using\ntheir money. It was designed to prevent large institutions from being “too big\nto fail” and being bailed out when economic hardships…"
}