{
  "author": "McLarenLT",
  "the_new_excerpt": "Hey all, a few days ago, I posted a spreadsheet template with data retrieval\nscripts to help monitor your stock portfolios and compare investments.\n\nAs the documentation is somewhat ambiguous, I made a video guide on usage,\nedited the original post and added a YouTube link; the post was…",
  "original_created_utc": 1609461465,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "大家好，几天前，我发布了一个带数据检索的电子表格模板\n帮助监控您的股票投资组合和比较投资的脚本。\n\n由于文档有些模棱两可，我制作了一个关于使用的视频指南。\n编辑了原始帖子，并添加了Youtube链接；帖子是…",
      "title": "构建了两个具有自动数据检索功能的Google Sheet模板，以帮助监控您的股票/股息投资组合和观察列表*已更新*"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好，幾天前，我發佈了一個帶數據檢索的電子表格模板\n幫助監控您的股票投資組合和比較投資的腳本。\n\n由於文檔有些模棱兩可，我製作了一個關於使用的視頻指南。\n編輯了原始帖子，並添加了Youtube鏈接；帖子是…",
      "title": "構建了兩個具有自動數據檢索功能的Google Sheet模板，以幫助監控您的股票/股息投資組合和觀察列表*已更新*"
    }
  ],
  "title": "Built two Google Sheets templates with automatic data retrieval to help monitor your stock / dividend portfolios and watchlists *Updated*",
  "created_utc": 1609524468,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey all, a few days ago, I posted a spreadsheet template with data retrieval scripts to help monitor your stock portfolios and compare investments. </p>\n\n<p>As the documentation is somewhat ambiguous, I made a video guide on usage, edited the original post and added a YouTube link; the post was subsequently removed due to risk of YouTube spam (?)</p>\n\n<p>Just as well, </p>\n\n<p>I&#39;m reposting the <a href=\"https://docs.google.com/spreadsheets/d/1ofxrHbo3vqv5xHeU5kLFg_27gQGGib9tz3oku1exN6k/\">original sheet here</a> and additionally, <a href=\"https://docs.google.com/spreadsheets/d/1FXa4sQZ_IR_NrXmm7TBwZhGEuhH8k4rsstn_uqIjSoY/\">offering another template + set of scripts to help track your dividend portfolios</a>. </p>\n\n<p>Presently, the tool that retrieves future dividend estimates, ex-dividend + payment dates, and NAVs only works for Canadian stocks and ETFs; you would either have to write your own script or enter these data in manually for non-Canadian investments. Dividend history should work for all dividend-paying tickers on Yahoo Finance.   </p>\n\n<p>I recommend probably using these templates to build your own personalized sheets. You can copy formulas and such over. </p>\n\n<p>As always, feedback kindly welcomed!</p>\n</div><!-- SC_ON -->",
  "score": 45,
  "permalink": "/r/stocks/comments/ko1n6v/built_two_google_sheets_templates_with_automatic/",
  "subreddit": "stocks",
  "id": "ko1n6v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610100748517
}