{
  "author": "Big_brown_house",
  "original_created_utc": 1656515003,
  "title": "Is it wrong to use contemporary tribal cultures as case studies for past or “primitive” human societies?",
  "created_utc": 1656558231,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m reading Simone De Beauvoir’s “Second Sex.” In the first volume, she lays out a theory for the development of patriarchal societies from more egalitarian or matrilineal ones. Some of her arguments consist of using examples of modern tribes to suggest the behavior of ancient tribes in other parts of the world. Here’s one particular quote where she does that,&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;At this stage [early agricultural revolution] . . . children and crops still seem like supernatural gifts. . . Such beliefs are still alive today among numerous Indian, Australian, and Polynesian tribes&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This method seems a little off to me. Isn’t it kind of racist or colonialist to think of these tribes in the 20th century as some kind of window into tribes of the distant past? After all, the tribes have been around a long time and I’m sure their culture has developed just as much as ours over the intervening millennia, though in different ways. I hear people do this kind of thing a lot and it doesn’t seem right. Do historians still do this? Why or why not?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 111,
  "permalink": "/r/AskHistorians/comments/vnhvp7/is_it_wrong_to_use_contemporary_tribal_cultures/",
  "subreddit": "AskHistorians",
  "id": "vnhvp7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m reading Simone De Beauvoir’s “Second Sex.” In the first volume, she lays out\na theory for the development of patriarchal societies from more egalitarian or\nmatrilineal ones. Some of her arguments consist of using examples of modern\ntribes to suggest the behavior of ancient tribes in other parts…"
}