{
  "author": "Big_brown_house",
  "original_created_utc": 1656515003,
  "title": "Is it wrong to use contemporary tribal cultures as case studies for past or “primitive” human societies?",
  "created_utc": 1656558231,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m reading Simone De Beauvoir’s “Second Sex.” In the first volume, she lays out a theory for the development of patriarchal societies from more egalitarian or matrilineal ones. Some of her arguments consist of using examples of modern tribes to suggest the behavior of ancient tribes in other parts of the world. Here’s one particular quote where she does that,&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;At this stage [early agricultural revolution] . . . children and crops still seem like supernatural gifts. . . Such beliefs are still alive today among numerous Indian, Australian, and Polynesian tribes&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This method seems a little off to me. Isn’t it kind of racist or colonialist to think of these tribes in the 20th century as some kind of window into tribes of the distant past? After all, the tribes have been around a long time and I’m sure their culture has developed just as much as ours over the intervening millennia, though in different ways. I hear people do this kind of thing a lot and it doesn’t seem right. Do historians still do this? Why or why not?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 111,
  "permalink": "/r/AskHistorians/comments/vnhvp7/is_it_wrong_to_use_contemporary_tribal_cultures/",
  "subreddit": "AskHistorians",
  "id": "vnhvp7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m reading Simone De Beauvoir’s “Second Sex.” In the first volume, she lays out\na theory for the development of patriarchal societies from more egalitarian or\nmatrilineal ones. Some of her arguments consist of using examples of modern\ntribes to suggest the behavior of ancient tribes in other parts…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "シモーヌ・ド・ボーヴォワールの \"第二の性\" を読んでいます。第一巻で、彼女は\n家父長制社会が、より平等主義的な、あるいは母系制社会から発展していくための理論を、第一巻で彼女は述べています。\n家父長制社会の発展についての理論を述べている。彼女の主張のいくつかは、現代の部族の例を使って\nまた、現代の部族を例にとり、他の地域の古代部族の行動を示唆する。",
      "title": "現代の部族文化を、過去の、あるいは「原始的」な人類社会のケーススタディとして用いるのは間違っているだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我正在读西蒙娜-德-波伏娃的 \"第二性\"。在第一卷中，她提出了\n在第一卷中，她为父权制社会的发展提出了一个理论，即从更平等的或\n她在第一卷中提出了一个理论，说明父权制社会从更加平等或母权制社会发展而来。她的一些论点包括用现代部落的例子来暗示古代的行为。\n她的一些论点包括用现代部落的例子来暗示其他地区的古代部落的行为...",
      "title": "用当代部落文化作为过去或 \"原始 \"人类社会的案例研究，是否有错？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我正在讀西蒙娜-德-波伏娃的 \"第二性\"。在第一卷中，她提出了\n在第一卷中，她爲父權制社會的發展提出了一個理論，即從更平等的或\n她在第一卷中提出了一個理論，說明父權制社會從更加平等或母權制社會發展而來。她的一些論點包括用現代部落的例子來暗示古代的行爲。\n她的一些論點包括用現代部落的例子來暗示其他地區的古代部落的行爲...",
      "title": "用當代部落文化作爲過去或 \"原始 \"人類社會的案例研究，是否有錯？"
    }
  ]
}