{
  "author": "sirachah",
  "original_created_utc": 1635084287,
  "title": "I sold all my ADA for ATOM…",
  "created_utc": 1635103860,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>ADA has been a bunch of empty promises. I’ve been on the fence on Cosmos for quite some time, but following all of the recent updates to the cosmos network, it seems to be having an increase in usage in the crypto world. </p>\n\n<p>ADA has a bunch of “potential” and seems to always be the next big move but nothing ever happens. </p>\n\n<p>Did I overreact by selling all? Should I keep a small amount of ADA instead? I truly believe that this is the last time ATOM will be this low and with this potential bull run, cosmos will be in the low 100s very soon.</p>\n\n<p>I’m not wrinkled, I do my own research in these subs and I put a lot of trust in y’all’s DD. Did I do right or am I victim to FOMO?</p>\n\n<p>Edit: thank you all for taking the time to enlighten me and give me some insight. To clarify things, I bought 8 months ago and held the entire time. I don’t day trade and not looking for a quick buck. But after thinking about it, 8 months is not a proper time table and was selfish of me to say it’s not moving enough. I will DCA back into ADA next paycheck and start building it back up.</p>\n</div><!-- SC_ON -->",
  "score": 187,
  "permalink": "/r/CryptoCurrency/comments/qestid/i_sold_all_my_ada_for_atom/",
  "subreddit": "CryptoCurrency",
  "id": "qestid",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "ADA has been a bunch of empty promises. I’ve been on the fence on Cosmos for\nquite some time, but following all of the recent updates to the cosmos network,\nit seems to be having an increase in usage in the crypto world.\n\nADA has a bunch of “potential” and seems to always be the next big move…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ADAは空約束の連続だった。コスモスについてはずっと迷っていましたが\nしかし、最近のcosmosネットワークのアップデートを見ていると\n暗号の世界では利用者が増えているようです。\n\nADAにはたくさんの「可能性」があり、常に次の大きな動きがあるように思えます...。",
      "title": "ATOMのためにADAを全部売ってしまった...。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "ADA一直是一堆空洞的承诺。我对Cosmos一直持观望态度。\n但随着最近cosmos网络的所有更新。\n它在加密货币世界中的使用率似乎在增加。\n\nADA有一堆的 \"潜力\"，似乎总是下一个大动作...",
      "title": "我卖掉了我所有的ADA，换取ATOM..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "ADA一直是一堆空洞的承諾。我對Cosmos一直持觀望態度。\n但隨着最近cosmos網絡的所有更新。\n它在加密貨幣世界中的使用率似乎在增加。\n\nADA有一堆的 \"潛力\"，似乎總是下一個大動作...",
      "title": "我賣掉了我所有的ADA，換取ATOM..."
    }
  ]
}