{
  "author": "FreddieChopin",
  "original_created_utc": 1644068884,
  "title": "Between 8th and 15th of June 2021 BTC pumped from 31k to 41k, just to crash down to 29k seven days later",
  "created_utc": 1644140537,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Please keep in mind that just seven months ago we had almost the same pump, which took BTC up to EXACTLY where it is right now. This is not the only similarity - back then BTC pumped from 35k to 39k within 14 hours, while yesterday we saw a pump from 37k to 41k in 9 hours.&lt;/p&gt;\n\n&lt;p&gt;This uptrend was short lived and BTC was above 40k for just 2 days, to crash even lower than previously in the next week.&lt;/p&gt;\n\n&lt;p&gt;It is also worth noting that we are far from &amp;quot;invalidating weeks of FUD&amp;quot; (as one of the top post claims, the one about a potential short squeeze), because we are basically at the support level from just 2 weeks ago - after going below 45k in January, BTC was testing the 40k-41k support for a while, just to crash below it on 20th of January. This was just sixteen days ago!&lt;/p&gt;\n\n&lt;p&gt;The only positive aspect about current situation is that you can kind-of see a slight uptrend since hitting 33k on 24th of January when you zoom out, but this means as much as the current alignment of stars on the night sky.&lt;/p&gt;\n\n&lt;p&gt;Whether we go &amp;quot;up only&amp;quot; or continue the downtrend remains to be seen. Personally my bets are 50% on going up and 50% on going down, so as you see I have a pretty strong opinion about the current state of the market (;&lt;/p&gt;\n\n&lt;p&gt;tl;dr: 100k BTC end of month! (;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 309,
  "permalink": "/r/CryptoCurrency/comments/sl7c30/between_8th_and_15th_of_june_2021_btc_pumped_from/",
  "subreddit": "CryptoCurrency",
  "id": "sl7c30",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Please keep in mind that just seven months ago we had almost the same pump,\nwhich took BTC up to EXACTLY where it is right now. This is not the only\nsimilarity - back then BTC pumped from 35k to 39k within 14 hours, while\nyesterday we saw a pump from 37k to 41k in 9 hours.\n\nThis uptrend was short…"
}