{
  "author": "Invest07723",
  "original_created_utc": 1637945846,
  "title": "Before you ask why all the red today, check out the DOW.",
  "created_utc": 1637955293,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The DOW is down more than 950 points, and unfortunately that is negatively impacting crypto prices today IMO. Interestingly, and sadly, the DOW is down so much partly because of the latest COVID variation out of South Africa.  </p>\n\n<p>COVID led to an increase in crypto investors but news of a brand new variant that allegedly is heavily mutated is causing panic in the markets.  </p>\n\n<p>Crypto is susceptible to large price swings based on major world events, or if Elon sneezes funny. So,  I don&#39;t think we are so red because of any new sour outlook on crypto, but rather because of the new COVID variant and impact on multiple markets.  </p>\n\n<p>That said,  crypto is still red today, so I&#39;m buying, but extremely cautiously.</p>\n</div><!-- SC_ON -->",
  "score": 187,
  "permalink": "/r/CryptoCurrency/comments/r2rp3e/before_you_ask_why_all_the_red_today_check_out/",
  "subreddit": "CryptoCurrency",
  "id": "r2rp3e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The DOW is down more than 950 points, and unfortunately that is negatively\nimpacting crypto prices today IMO. Interestingly, and sadly, the DOW is down so\nmuch partly because of the latest COVID variation out of South Africa.\n\nCOVID led to an increase in crypto investors but news of a brand new…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "DOWは950ポイント以上下げており、残念ながらそれが今日の暗号化価格にマイナスの影響を与えています。\nそれが今日の暗号価格にマイナスの影響を与えていると思います。興味深いことに、そして悲しいことに、DOWはこれほどまでに下がっています。\nこれほどまでにDOWが下がっているのは、南アフリカから出た最新のCOVIDバリエーションのせいでもあります。\n\nCOVIDによって暗号投資家が増えましたが、ニュースでは新しい...",
      "title": "なぜ今日は赤なのかと聞く前に、DOWを見てみましょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "道琼斯指数下跌超过950点，不幸的是，这对今天的加密货币价格产生了负面影响。\n对今天的加密货币价格产生了负面影响。有趣的是，也是可悲的是，道琼斯指数如此下跌\n部分原因是南非的最新COVID变异。\n\nCOVID导致加密货币投资者增加，但有消息称一个全新的...",
      "title": "在你问为什么今天所有的红色，看看道琼斯指数。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "道瓊斯指數下跌超過950點，不幸的是，這對今天的加密貨幣價格產生了負面影響。\n對今天的加密貨幣價格產生了負面影響。有趣的是，也是可悲的是，道瓊斯指數如此下跌\n部分原因是南非的最新COVID變異。\n\nCOVID導致加密貨幣投資者增加，但有消息稱一個全新的...",
      "title": "在你問爲什麼今天所有的紅色，看看道瓊斯指數。"
    }
  ]
}