{
  "author": "Levitins_world",
  "original_created_utc": 1638620562,
  "title": "Yes this is a crash. Yes this when you buy.",
  "created_utc": 1638641949,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m no expert but the idea of accumulating a crypto is simple. You try to accumulate whatever it is at the lowest prices consistently or whenever you can. If you&amp;#39;re here to make quick cash then, this ain&amp;#39;t your day. But if you&amp;#39;re here because you always had no intention of selling regardless, then it&amp;#39;s just another exciting day in crypto. &lt;/p&gt;\n\n&lt;p&gt;Crashes are gift, so are impulsive waves up. That&amp;#39;s the beauty of investing. Making cash in crypto is not a no brainer like some people say. Those that research and plan are rewarded with their patience far far more.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 329,
  "permalink": "/r/CryptoCurrency/comments/r8olna/yes_this_is_a_crash_yes_this_when_you_buy/",
  "subreddit": "CryptoCurrency",
  "id": "r8olna",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm no expert but the idea of accumulating a crypto is simple. You try to\naccumulate whatever it is at the lowest prices consistently or whenever you can.\nIf you're here to make quick cash then, this ain't your day. But if you're here\nbecause you always had no intention of selling regardless, then…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は専門家ではありませんが、暗号を蓄積する考え方は簡単です。あなたは\nをコンスタントに、あるいは可能な限り最安値で蓄積していく。\nもし、あなたが手っ取り早くお金を稼ぐためにここにいるのなら、今日はあなたの日ではないでしょう。しかし、もしあなたがここにいるのなら\nもともと売る気がないのだから、そのときは",
      "title": "はい、これはクラッシュです。Yes this when you buy."
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不是专家，但积累一种加密货币的想法很简单。你试图\n在最低的价格上持续或随时积累任何东西。\n如果你在这里是为了赚取快速现金，那么，这不是你的日子。但如果你在这里\n因为你总是不打算卖掉，那么...",
      "title": "是的这是一个崩溃。是的这是当你购买。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不是專家，但積累一種加密貨幣的想法很簡單。你試圖\n在最低的價格上持續或隨時積累任何東西。\n如果你在這裏是爲了賺取快速現金，那麼，這不是你的日子。但如果你在這裏\n因爲你總是不打算賣掉，那麼...",
      "title": "是的這是一個崩潰。是的這是當你購買。"
    }
  ]
}