{
  "author": "rpoh73189",
  "the_new_excerpt": "Economy has been heating up for the last quarter or two. As economy heats up\nwith the gradual reopening we have seen in last few quarters inflation has\nslowly ticked up alongside. I’m hardly the only person that has noticed. My\nthesis is that with the additional $1.9B stimmy being injected into an…",
  "original_created_utc": 1614791546,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "最近一两个季度，经济一直在升温。随着经济的升温\n随着过去几个季度的逐步恢复开放，我们看到通货膨胀已\n旁边慢慢地滴答起来。我几乎不是唯一注意到的人。我的\n论是，随着19亿刺激的额外资金被注入到一个。",
      "title": "2021年下半年市场前景的理论--请大家戳戳看"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近一兩個季度，經濟一直在升溫。隨着經濟的升溫\n隨着過去幾個季度的逐步恢復開放，我們看到通貨膨脹已\n旁邊慢慢地滴答起來。我幾乎不是唯一注意到的人。我的\n論是，隨着19億刺激的額外資金被注入到一個。",
      "title": "2021年下半年市場前景的理論--請大家戳戳看"
    }
  ],
  "title": "Theory for Market Outlook in back half of 2021 - please poke holes",
  "created_utc": 1614800451,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Economy has been heating up for the last quarter or two. As economy heats up with the gradual reopening we have seen in last few quarters inflation has slowly ticked up alongside. I’m hardly the only person that has noticed. My thesis is that with the additional $1.9B stimmy being injected into an economy that is already running hot we will start to overheat more. Then when vaccine rollout completes the economy flips into straight nuclear growth mode with ridiculous pent up demand exploding into the market back half of the year. This makes inflation run through the fuckin roof. With runaway inflation the Fed has one real option (correct me if I’m off here) which is to raise rates. The market has priced equites with the assumption that rates stay at 0 until 2023. I see the potential for the Fed to be cornered with inflationary pressure to raise sooner and the stock market absolutely shitting itself, similar to the last taper tantrum. Only this time, Fed can’t walk it back because they have no choice. </p>\n\n<p>Please point out any blind spots in this theory. This potentially shifts my whole investment approach for the rest of this year.</p>\n</div><!-- SC_ON -->",
  "score": 109,
  "permalink": "/r/investing/comments/lwyzf7/theory_for_market_outlook_in_back_half_of_2021/",
  "subreddit": "investing",
  "id": "lwyzf7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937740767
}