{
  "author": "vbcbandr",
  "original_created_utc": 1643082651,
  "title": "Why do we lionize Tupac when his life was filled with violence, misogyny and plenty of questionable lyrics and opinions? Any regular person would be deemed a POS criminal and someone who would be ostracized from society.",
  "created_utc": 1643097479,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;American culture, in general, treats Tupac like a musical legend who deserves to have his posters hanging on bedroom walls. However, he was far from a man free from violent tendencies and questionable opinions. Here is just a brief overview of some of his non musical achievements:&lt;/p&gt;\n\n&lt;p&gt;Convicted of first-degree sexual abuse (acquitted of sodomy and gun charges), Shakur was sentenced to 120 days in jail for violating his release terms&lt;/p&gt;\n\n&lt;p&gt;On 8/22/1992 a fight broke out and Shakur pulled out his gun (he claims he dropped it and someone else picked it up and it discharged) 100 yards away Qa&amp;#39;id Walker-Teal, a boy aged 6 on his bicycle, was fatally shot in the forehead, the bullet matched Shakur&amp;#39;s gun.&lt;/p&gt;\n\n&lt;p&gt;On April 5, 1993, charged with felonious assault, Shakur allegedly threw a microphone and swung a baseball bat at rapper Chauncey Wynn. Shakur claimed it was all part of an act. Nonetheless, he pleaded down and served jail time.&lt;/p&gt;\n\n&lt;p&gt;On October 31, 1993, Shakur was arrested in Atlanta for shooting two off-duty police officers, brothers Mark Whitwell and Scott Whitwell. No one knows what exactly happened but it seems both parties were at fault. Charges were dropped for both parties though Shakur ended up paying an undisclosed amount to Mark Whitwell while his estate paid $2 million to his brother, Scott.&lt;/p&gt;\n\n&lt;p&gt;For much of his life he was an unapologetic misogynist.&lt;/p&gt;\n\n&lt;p&gt;There is no doubt he was a musical and lyrical force and had opinions and views that fluctuated (which all of us do) over the course of his career. Tupac&amp;#39;s behavior would not be tolerated by any normal person. However, as a lyricist and artist, it seems he is given a pretty wide berth when it comes to his legacy. Unlike many other musicians, actors, artists, historical figures, politicians, activists, and authors, Tupac&amp;#39;s personality and actions seems teflon and immune from any real criticism...why is this? Is he really worthy of the adoration we give him or has his murder given him warrior-poet status?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 118,
  "permalink": "/r/TooAfraidToAsk/comments/sc4csn/why_do_we_lionize_tupac_when_his_life_was_filled/",
  "subreddit": "TooAfraidToAsk",
  "id": "sc4csn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "American culture, in general, treats Tupac like a musical legend who deserves to\nhave his posters hanging on bedroom walls. However, he was far from a man free\nfrom violent tendencies and questionable opinions. Here is just a brief overview\nof some of his non musical achievements:\n\nConvicted of…"
}