{
  "author": "naterocs",
  "the_new_excerpt": "Did my own personal DD on a few companies and WMT stood out. Thought I would\nshare it here. Not really looking for comment or criticism just sharing my own\nfindings. I've been writing my own thesis statements for investments > $10,000\nfor the last few years. My last successful venture was $DIS and I…",
  "original_created_utc": 1618433140,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "いくつかの企業について個人的にDDを行ったところ、WMTが際立っていました。思ったので\nここでそれを共有しようと思いました。コメントや批判を求めているわけではなく、私自身の発見を共有したいだけです。\n発見を共有するだけです。私はここ数年、10,000ドル以上の投資について自分の論文を書いてきました。\n私はここ数年、10,000ドル以上の投資について自分の論文を書いてきました。私が最後に成功したベンチャーは$DISで、私は...",
      "title": "ウォルマートのテーゼ・ステートメント (04/07/21)"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我个人对几家公司做了丈量，WMT脱颖而出。我想我会\n在这里分享。不求评论或批评，只求分享我自己的观点\n发现。我一直在写自己投资>万元的论文陈述\n在过去的几年里。我上一次成功创业是$DIS，我...",
      "title": "沃尔玛论文陈述(04/07/21)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我個人對幾家公司做了丈量，WMT脫穎而出。我想我會\n在這裏分享。不求評論或批評，只求分享我自己的觀點\n發現。我一直在寫自己投資>萬元的論文陳述\n在過去的幾年裏。我上一次成功創業是$DIS，我...",
      "title": "沃爾瑪論文陳述(04/07/21)"
    }
  ],
  "title": "Walmart Thesis Statement (04/07/21)",
  "created_utc": 1618468414,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Did my own personal DD on a few companies and WMT stood out.  Thought I would share it here.  Not really looking for comment or criticism just sharing my own findings.  I&#39;ve been writing my own thesis statements for investments &gt; $10,000 for the last few years.  My last successful venture was $DIS and I also shared my thesis statement here around two years ago.  Full disclosure, I&#39;ve purchased 80 shares as of this morning.  Writeup was completed as of 04/07/21 and I will send my analyses via excel to anyone interested.</p>\n\n<p><strong>Walmart Thesis Statement:</strong></p>\n\n<p>Walmart Corp. is growing its eCommerce presence and maintains a dominant position in the retail industry. Walmart is able to differentiate from its competitors due to the niche market of affordable products in a brick and mortar format that is augmented by its growing online presence. Walmart maintains the highest revenue amongst its competitors (listed below) and is currently relatively undervalued due to short-term financial statements which show a negative net income growth which can be directly attributed to investments in online growth. Assuming a rational market, Walmart is undervalued relative to its direct competitors. It maintains its market capitalization as a retail corporation which will reap the benefits of a growing online economy.  In this paper, a justification for a Market Capitalization of $500B will be made with supporting fundamental and competitor analyses.</p>\n\n<p><strong>Background Information:</strong></p>\n\n<p>Price as of Wednesday, 04/07/21: $140.16</p>\n\n<p>Direct Competitors: Amazon, Target, Costco, Kmart, Kroger, ALDI, Walgreens, Tesco, Carrefour, Best Buy</p>\n\n<p>Market Capitalization: $394.78B</p>\n\n<p>P/E Ratio: 29.53 (Growth Mode)</p>\n\n<p>Div. Yield: 1.57%</p>\n\n<p>52-wk high: $153.66 (9.63% Upside) approx. December 1st 2020</p>\n\n<p><strong>Benefits:</strong></p>\n\n<p>As of Wednesday, 04/07, Walmart is the lowest risk retail conglomerate and is priced at a multiple less than its direct competitors including Target and Walmart. Walmart is currently in the midst of a transition to eCommerce which has not yet been sufficiently reflected in its Market Capitalization.</p>\n\n<p><strong>Competitor Analysis:</strong></p>\n\n<p><a href=\"https://imgur.com/a/XBizaMp\"><strong>https://imgur.com/a/XBizaMp</strong></a></p>\n\n<p><strong>Conclusion:</strong></p>\n\n<p>A conservative P/E ratio of 40 would bring Walmart in line with its three top competitors. This computes a 36% P/E ratio increase. This P/E would result in an increased EPS of $9.87/share; in line with Costco and slightly higher than Target. Adjusted Market Capitalization to offset this P/E increase can conservatively be estimated at 25%. A fair valuation for Walmart can then be computed at a Market Capitalization of $500B. Translated to cost per share, a sell price of $176.93 can be computed.</p>\n\n<p><strong>Debrief:</strong></p>\n\n<p>In the coming year, the most important metrics to watch in Walmart’s financial statements will continue to be Revenue, and P/E Ratio. Also important is Walmart’s net income which will be the star of the show as a turnaround in this financial datum will likely result in an increased price per share.</p>\n</div><!-- SC_ON -->",
  "score": 58,
  "permalink": "/r/stocks/comments/mqzmof/walmart_thesis_statement_040721/",
  "subreddit": "stocks",
  "id": "mqzmof",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566620707
}