{
  "author": "kirito_sao_441",
  "original_created_utc": 1651426967,
  "title": "I wasn't born yet, I want to know what was it like on New Years of 1999 when society was entering the 2000's?",
  "created_utc": 1651511142,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Were there a lot of headlines mentioning stuff about entering a new millennia in newspapers, were people making a lot of conversations about what might be different? Was it a talking point at get-togethers? Did people make jokes about &amp;quot;see you next millennia&amp;quot; or &amp;quot;it&amp;#39;s going to be weird not writing 19 as the first two digits of the year when writing the date&amp;quot;?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/NoStupidQuestions/comments/ug545q/i_wasnt_born_yet_i_want_to_know_what_was_it_like/",
  "subreddit": "NoStupidQuestions",
  "id": "ug545q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Were there a lot of headlines mentioning stuff about entering a new millennia in\nnewspapers, were people making a lot of conversations about what might be\ndifferent? Was it a talking point at get-togethers? Did people make jokes about\n\"see you next millennia\" or \"it's going to be weird not writing…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "新しい千年紀を迎えるというような見出しが新聞にたくさん出ていましたか？\n新聞では、新しい千年紀を迎えるという見出しがたくさん出ていましたか。\n会話をしていましたか？懇親会でも話題になりましたか？冗談で\n次の千年でまた会おう」とか「書けなくなるのは変な感じだ」とか。",
      "title": "私はまだ生まれていないのですが、社会が2000年代に突入した1999年のお正月はどんな感じだったのか知りたいです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "报纸上是否有很多标题提到关于进入一个新的千年的东西？\n报纸上是否有很多关于进入新千年的头条新闻，人们是否对可能出现的情况进行了大量的讨论\n不同？它是聚会上的一个讨论点吗？人们是否开过这样的玩笑\n\"下一个千年见 \"或 \"不写东西会很奇怪......\"。",
      "title": "我还没有出生，我想知道1999年的新年，当社会进入2000年的时候是什么样子？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "報紙上是否有很多標題提到關於進入一個新的千年的東西？\n報紙上是否有很多關於進入新千年的頭條新聞，人們是否對可能出現的情況進行了大量的討論\n不同？它是聚會上的一個討論點嗎？人們是否開過這樣的玩笑\n\"下一個千年見 \"或 \"不寫東西會很奇怪......\"。",
      "title": "我還沒有出生，我想知道1999年的新年，當社會進入2000年的時候是什麼樣子？"
    }
  ]
}