{
  "author": "Foreign-Brilliant-82",
  "original_created_utc": 1650119673,
  "title": "I'm a physically small woman. How should I defend myself if I ever get attacked by a man?",
  "created_utc": 1650127981,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Is my only option a gun? But I would rather not use a gun, as that may cause legal problems (outside of the US). I&amp;#39;m not from the US so I would rather not use the gun at all.&lt;/p&gt;\n\n&lt;p&gt;What other options do I have if I  &lt;strong&gt;ever&lt;/strong&gt; get attacked by a bigger guy? I know for sure I cant fight them off physically - I cant even fight off other women. By defend myself, I mean, how will I get away from this guy with NO physical damage to myself done by the guy?&lt;/p&gt;\n\n&lt;p&gt;I have a lot of anxiety from this thought, any advice is appreciated.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 146,
  "permalink": "/r/TooAfraidToAsk/comments/u4z31m/im_a_physically_small_woman_how_should_i_defend/",
  "subreddit": "TooAfraidToAsk",
  "id": "u4z31m",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Is my only option a gun? But I would rather not use a gun, as that may cause\nlegal problems (outside of the US). I'm not from the US so I would rather not\nuse the gun at all.\n\nWhat other options do I have if I ever get attacked by a bigger guy? I know for\nsure I cant fight them off physically - I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "銃しかないのでしょうか？でも、銃は使いたくないんです。\n法的な問題（米国外）。私はアメリカ人ではないので、むしろしないほうがいい。\n銃を使用することはありません。\n\nもし、大男に襲われるようなことがあったら、他にどんな選択肢があるのでしょうか？もちろん\n物理的に撃退できないのは確かです。",
      "title": "私は身体的に小さな女性です。万が一、男性に襲われた場合、どのように身を守ればいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我唯一的选择是用枪吗？但我宁愿不使用枪，因为这可能会导致\n法律问题（在美国之外）。我不是来自美国，所以我宁愿不\n使用枪支。\n\n如果有一天我被一个大块头攻击，我还有什么其他选择？我知道\n我知道我不可能用身体对抗他们--我...",
      "title": "我是一个身体瘦小的女人。如果我被一个男人攻击，我应该如何保护自己？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我唯一的選擇是用槍嗎？但我寧願不使用槍，因爲這可能會導致\n法律問題（在美國之外）。我不是來自美國，所以我寧願不\n使用槍支。\n\n如果有一天我被一個大塊頭攻擊，我還有什麼其他選擇？我知道\n我知道我不可能用身體對抗他們--我...",
      "title": "我是一個身體瘦小的女人。如果我被一個男人攻擊，我應該如何保護自己？"
    }
  ]
}