{
  "author": "DariusMDeV",
  "original_created_utc": 1635593470,
  "title": "When people today are lost in remote areas like mountains or state parks when lack of cell signal means an easy rescue isn't possible, is it practical to deploy \"cheap\" helicopters with no more than cell antennas to cover many square miles hovering over likely areas they could be?",
  "created_utc": 1635614852,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Or is this tech compact and cheap enough to send constellations of small drones over the area giving the ability to calculate multi-point directionality of cell pings? </p>\n\n<p>I&#39;m envisioning a low rent AWACS for search and rescue. If you deploy the net fast enough, before the phone dies, you should be able to find even an incapacitated person.</p>\n</div><!-- SC_ON -->",
  "score": 109,
  "permalink": "/r/NoStupidQuestions/comments/qizmek/when_people_today_are_lost_in_remote_areas_like/",
  "subreddit": "NoStupidQuestions",
  "id": "qizmek",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Or is this tech compact and cheap enough to send constellations of small drones\nover the area giving the ability to calculate multi-point directionality of cell\npings?\n\nI'm envisioning a low rent AWACS for search and rescue. If you deploy the net\nfast enough, before the phone dies, you should be…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "あるいは、この技術は小型で安価なので、小型のドローンをコンステレーションで飛ばして\nこの技術はコンパクトで安価なので、小型のドローンをその地域に送り、携帯電話の多点指向性を計算することができます。\nこの技術はコンパクトで安価です。\n\n捜索・救助用の低コストAWACSを想像しています。ネットを素早く展開すれば\n電話が切れる前にネットを展開すれば...",
      "title": "携帯電話の電波が届かず、簡単には救助できないような山や州立公園などの遠隔地で遭難した場合、携帯電話のアンテナ程度の機能しか持たない「安価な」ヘリコプターを配備して、何平方マイルもの範囲をカバーし、遭難しそうな場所をホバリングすることは現実的なのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "或者说，这项技术是否足够紧凑和便宜，可以将小型无人机群派往该地区，使其具有计算能力。\n在该地区，有能力计算细胞的多点方向性。\nping？\n\n我正在设想一种用于搜索和救援的低租金预警机。如果你部署网络\n足够快，在手机坏掉之前，你就应该...",
      "title": "当今天的人们在山区或州立公园等偏远地区迷路时，缺乏手机信号意味着不可能进行简单的救援，部署 \"廉价 \"的直升机，用手机天线覆盖许多平方英里，在他们可能出现的地方盘旋，这是否实际？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "或者說，這項技術是否足夠緊湊和便宜，可以將小型無人機羣派往該地區，使其具有計算能力。\n在該地區，有能力計算細胞的多點方向性。\nping？\n\n我正在設想一種用於搜索和救援的低租金預警機。如果你部署網絡\n足夠快，在手機壞掉之前，你就應該...",
      "title": "當今天的人們在山區或州立公園等偏遠地區迷路時，缺乏手機信號意味着不可能進行簡單的救援，部署 \"廉價 \"的直升機，用手機天線覆蓋許多平方英里，在他們可能出現的地方盤旋，這是否實際？"
    }
  ]
}