{
  "author": "Chooky47",
  "original_created_utc": 1638663548,
  "title": "We are roughly 20% from the absolute highest prices crypto has been at, in history, and people are in a full blown panic. You can’t have green candles all day, every day forever and people need to realise this, because we have been so fortunate this year financially in every aspect of the market.",
  "created_utc": 1638686467,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Put the charts on the 1 month option on your favourite exchange. &lt;/p&gt;\n\n&lt;p&gt;Check out your best alts, and blink a couple of times while looking at the blue chip behemoths.&lt;/p&gt;\n\n&lt;p&gt;We have seen &lt;strong&gt;incredible&lt;/strong&gt; growth this year and in the middle of a global pandemic. It’s been an amazing ride, and even this sub has exploded in members. &lt;/p&gt;\n\n&lt;p&gt;However, there is a ridiculous amount of panic regarding the latest market movement. Across the board, stocks, property, and crypto have all &lt;em&gt;rocketed&lt;/em&gt; beyond all expectations. The wealth that has been generated is insane and anyone that has invested in some capacity is likely to have done well somewhere in their choices. &lt;/p&gt;\n\n&lt;p&gt;Put in perspective, the current drop of the market is &lt;strong&gt;miniscule&lt;/strong&gt;. 20% from the absolute top. For many, market life is new, and it’s scary watching things go down. But if you’re ever uncertain about market dips and crashes, zoom out and look at the big picture; the stock market has been a money making machine for over a century, and crypto has become worth trillions within a decade. &lt;/p&gt;\n\n&lt;p&gt;Learn to accept that things can’t just stay green forever, there are pull backs, dips, and crashes. Don’t panic and despair, learn from your mistakes and think logically that moving forward, based on history, the market will eventually &lt;strong&gt;move up&lt;/strong&gt;. Don’t invest your life savings that you need, your rent money, your food expenses, and you’ll be fine. &lt;/p&gt;\n\n&lt;p&gt;Because if the market fails to ever go up again, we’ve probably got bigger things to worry about. &lt;/p&gt;\n\n&lt;p&gt;TL:DR - Markets sometimes go down, it’s okay and normal. The recent drop puts us roughly 20% from the highest prices in history, and the market has performed so well this year. Eventually, based on pages of history, all financial markets will continue to grow over time, so don’t over extend yourself and invest responsibly, and it’ll be okay.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 156,
  "permalink": "/r/CryptoCurrency/comments/r9315a/we_are_roughly_20_from_the_absolute_highest/",
  "subreddit": "CryptoCurrency",
  "id": "r9315a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Put the charts on the 1 month option on your favourite exchange.\n\nCheck out your best alts, and blink a couple of times while looking at the blue\nchip behemoths.\n\nWe have seen incredible growth this year and in the middle of a global pandemic.\nIt’s been an amazing ride, and even this sub has…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "好きな取引所の1ヶ月オプションのチャートを貼る。\n\n自分の得意なアルトをチェックし、青いアルトを見ながら何度か瞬きをする。\nチップの巨人です。\n\n今年は信じられないような成長を遂げ、世界的なパンデミックの真っ只中にいます。\nそれは素晴らしい乗り物でした、そして、このサブでも...",
      "title": "暗号の史上最高値から約20％のところで、人々は完全にパニックに陥っています。今年は市場のあらゆる面で経済的に非常に幸運だったので、毎日ずっと緑色のロウソクが出ているわけではなく、人々はこれを理解する必要があります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "把图表放在你最喜欢的交易所的1个月期权上。\n\n看看你最好的代理人，在看蓝筹巨头时眨几下眼睛。\n芯片巨头。\n\n今年我们看到了令人难以置信的增长，而且是在全球大流行的情况下。\n这是一个惊人的旅程，甚至这个子有...",
      "title": "我们距离历史上加密货币的绝对最高价格大约有20%，而人们正处于全面的恐慌之中。你不可能永远每天都有绿色的蜡烛，人们需要意识到这一点，因为我们今年在市场的各个方面都很幸运。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "把圖表放在你最喜歡的交易所的1個月期權上。\n\n看看你最好的代理人，在看藍籌巨頭時眨幾下眼睛。\n芯片巨頭。\n\n今年我們看到了令人難以置信的增長，而且是在全球大流行的情況下。\n這是一個驚人的旅程，甚至這個子有...",
      "title": "我們距離歷史上加密貨幣的絕對最高價格大約有20%，而人們正處於全面的恐慌之中。你不可能永遠每天都有綠色的蠟燭，人們需要意識到這一點，因爲我們今年在市場的各個方面都很幸運。"
    }
  ]
}