{
  "author": "reddit_notsfw_",
  "the_new_excerpt": "Im a woman and consider myself straight, I’ve only been with guys and am not at\nall interested in the idea of being sexual with a woman (personal preference and\nI totally support anyone who feels differently). But when I get myself off\noftentimes I browse images of women on the nsfw subs on Reddit.…",
  "original_created_utc": 1621526237,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は女性で、自分はストレートだと思っています。私は男の人としか付き合ったことがありません。\n私は男性としか付き合ったことがなく、女性と性的に付き合うことには全く興味がありません。\n個人的な好みで、違うと思う人を完全にサポートします）。) しかし、自分が興奮するとき\nReddit.... の nsfw サブサイトで女性の画像を見ることが多いです。",
      "title": "ノンケでも同性のAVに興奮することはあるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个女人，认为自己是异性恋，我只和男人在一起过，对与女人发生性关系的想法完全不感兴趣。\n对与女性发生性关系的想法完全不感兴趣（个人喜好和\n我完全支持任何有不同感受的人）。) 但当我感到兴奋的时候\n我经常在Reddit.... 上的nsfw子网站上浏览女人的图片。",
      "title": "一个人可以是异性恋，但仍然对同性的色情片感到兴奋吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個女人，認爲自己是異性戀，我只和男人在一起過，對與女人發生性關係的想法完全不感興趣。\n對與女性發生性關係的想法完全不感興趣（個人喜好和\n我完全支持任何有不同感受的人）。) 但當我感到興奮的時候\n我經常在Reddit.... 上的nsfw子網站上瀏覽女人的圖片。",
      "title": "一個人可以是異性戀，但仍然對同性的色情片感到興奮嗎？"
    }
  ],
  "title": "Can a person be straight and still get off to porn of the same sex?",
  "created_utc": 1621536676,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Im a woman and consider myself straight, I’ve only been with guys and am not at all interested in the idea of being sexual with a woman (personal preference and I totally support anyone who feels differently). But when I get myself off oftentimes I browse images of women on the nsfw subs on Reddit. I think it’s some aspect of their bodies being aesthetically pleasing and knowing that the images have turned guys on that works for me. What does this mean in terms of my sexuality if I don’t want to actually be sexual with a woman but the images of them help me get off?</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/NoStupidQuestions/comments/nh3wjq/can_a_person_be_straight_and_still_get_off_to/",
  "subreddit": "NoStupidQuestions",
  "id": "nh3wjq",
  "is_self": true,
  "media": null,
  "is_video": false
}