{
  "author": "carinislumpyhead97",
  "the_new_excerpt": "I’m sure this is a dumb question but it has been floating around in my head this\nmorning. Is there a reason that requires the market to open and close each day?\n\nMy thinking is that that the market opens and closes to reflex the 9-5 workday,\nwhen someone actually physically needed to execute trades.…",
  "original_created_utc": 1620390046,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "くだらない質問だと思いますが、今朝から頭の中をぐるぐる回っています。\n朝のことです。毎日、市場が開いて閉じることを必要とする理由があるのでしょうか？\n\n私の考えでは、市場は9時から5時までの労働時間を反映して開いたり閉じたりしているのではないかと思います。\n誰かが実際に物理的にトレードを実行する必要があったとき....",
      "title": "なぜマーケットは閉じたり開いたりするのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我确信这是一个愚蠢的问题，但它今天早上一直在我的脑海中漂浮。\n晨。是否有什么原因要求市场每天开盘和收盘？\n\n我的想法是，市场的开盘和收盘反映了朝九晚五的工作方式。\n当有人实际需要执行交易时....。",
      "title": "为什么市场会收盘和开盘？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我確信這是一個愚蠢的問題，但它今天早上一直在我的腦海中漂浮。\n晨。是否有什麼原因要求市場每天開盤和收盤？\n\n我的想法是，市場的開盤和收盤反映了朝九晚五的工作方式。\n當有人實際需要執行交易時....。",
      "title": "爲什麼市場會收盤和開盤？"
    }
  ],
  "title": "Why does the market close and open?",
  "created_utc": 1620415567,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m sure this is a dumb question but it has been floating around in my head this morning. Is there a reason that requires the market to open and close each day? </p>\n\n<p>My thinking is that that the market opens and closes to reflex the 9-5 workday, when someone actually physically needed to execute trades. However this is no longer the case, as trades can be made relatively instantly on a phone. </p>\n\n<p>So this brings me back to my question, why does it open/close each day? My conspiracy brain tells me it’s because the “big boys” use this time to game the market. And I can’t really come up am with any other rational. </p>\n\n<p>Thanks for reading, I’m just curious.</p>\n</div><!-- SC_ON -->",
  "score": 61,
  "permalink": "/r/stocks/comments/n6x779/why_does_the_market_close_and_open/",
  "subreddit": "stocks",
  "id": "n6x779",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985995613
}