{
  "author": "Rusty_Charm",
  "original_created_utc": 1642975572,
  "title": "You're gonna hate this",
  "created_utc": 1642988469,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m seeing a lot of posts today about buying the dip and how today is different than 2018 because of increased adoption and more advanced tech, mainly in L1s. I hate to break it to you, but none of that matters. Have a look at this:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/y9221orvlhd81.jpg?width=2786&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=e6877e80aa8975d8c8aa86f82c5f9972fc6222dc\"&gt;https://preview.redd.it/y9221orvlhd81.jpg?width=2786&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=e6877e80aa8975d8c8aa86f82c5f9972fc6222dc&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;EDIT: The chart cuts off at 2016...which is apparently making some people think there was a bear market sometime after 2016. Let&amp;#39;s have a look:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/0us34zsk3jd81.png?width=2108&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=79de6ff34018315c748a2e743caef0ca3b277c65\"&gt;https://preview.redd.it/0us34zsk3jd81.png?width=2108&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=79de6ff34018315c748a2e743caef0ca3b277c65&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;There was no bear market. There was a relatively small crash in 2020 as everyone panicked over Covid. That&amp;#39;s not a bear market. This picture also shows you that it&amp;#39;s even worse, the market has been absolutely parabolic for almost 2 years.&lt;/strong&gt; &lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s the S&amp;amp;P 500 index. Notice something? Every ten years or so there&amp;#39;s a severe downward correction which lasts 1-2 years. In the early 2000s it was the tech bubble, in 2008/9 it was the mortgage crisis. As you can see here, we&amp;#39;ve been in a sharp uptrend for over 10 years now. This uptrend has been fueled not in small part by record low interest rates. This is turn has resulted in parts of the market being hopelessly overvalued, a prime example being Tesla.&lt;/p&gt;\n\n&lt;p&gt;Now look at the crypto charts, specifically the top 50 alts. Most of them have had absolutely face melting pumps over the last 18 months. Do you think that&amp;#39;s just going to keep going up? Their valuations are now so ridiculous that &amp;#39;crypto market caps&amp;#39; are basically a meme, completely detached from reality. Of course market caps are hardly ever a true reflection of what company is worth, but they are a reflection of the amount of speculation in the current market. Just to look at a few:&lt;/p&gt;\n\n&lt;p&gt;Cardano MC $36 billion, doesn&amp;#39;t have fully functional smart contracts, lots of promises while continually underdelivering, if at all.&lt;/p&gt;\n\n&lt;p&gt;Solana: MC $30 billion, has been unusable for the last 48 hours, has suffered multiple outages over the last 6 months which lasted up to 17 hours.&lt;/p&gt;\n\n&lt;p&gt;Dogecoin: $18 billion MC....don&amp;#39;t think I need to go into more detail on this one.&lt;/p&gt;\n\n&lt;p&gt;Ethereum: $288 billion market cap, supposed to disrupt the global banking industry (along with everything else), meanwhile it costs $200 for a simple ERC20 token swap.&lt;/p&gt;\n\n&lt;p&gt;BTC: $665 billion market cap, supposed to be the future of digital store of value, meanwhile, has lost more than 50% in value over the course of 2.5 months.&lt;/p&gt;\n\n&lt;p&gt;etc....&lt;/p&gt;\n\n&lt;p&gt;The point is that these market caps aren&amp;#39;t a reflection of the current states of those projects, but rather their promised states at some future point in time. Unless that point in time is very close as in a few months away, that&amp;#39;s not sustainable. I personally don&amp;#39;t think that point in time is very close, as almost nothing in crypto currency works as advertised.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;What would a multi year global bear market mean for crypto?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;- BTC bleeds more than stock market&lt;/p&gt;\n\n&lt;p&gt;- ETH bleeds more than BTC&lt;/p&gt;\n\n&lt;p&gt;- Alts will bleed even heavier than ETH and a good number will never recover. You have to remember something very basic here: if an alt your holding loses 90% of its value in the bear market, it has to pull a 10X just to get back to its previous price.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Further complication:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;DCAing into projects is obviously the way to go in a bear market, but it becomes more difficult to predict what projects will have merit the longer the bear market continues. Will your favourite project still be relevant in 2024 or will it be replaced by something that hasn&amp;#39;t even launched and won&amp;#39;t until 2023? The longer the bear market lasts, the more likely that outcome becomes. Do lots of research, try to keep up with the tech developments in crypto. The next Solana or Luna is probably being planned as I write this. Try to find it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 641,
  "permalink": "/r/CryptoCurrency/comments/sb5avd/youre_gonna_hate_this/",
  "subreddit": "CryptoCurrency",
  "id": "sb5avd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm seeing a lot of posts today about buying the dip and how today is different\nthan 2018 because of increased adoption and more advanced tech, mainly in L1s. I\nhate to break it to you, but none of that matters. Have a look at…"
}