{
  "author": "AlreadyLiberated",
  "the_new_excerpt": "Don’t get me wrong, the highs are amazing, but the lows have become too much to\nhandle. I can no longer cling to something that is always volatile, makes me\nfeel nervous and insecure, and may ultimately cost me 50% of my savings.\n\nSo I’m leaving.\n\nLeaving my wife to spend more time studying the…",
  "original_created_utc": 1624190270,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "誤解を恐れずに言えば、最高の気分は素晴らしいものですが、最低の気分は手に負えなくなっています。\nになってしまいました。常に不安定で、自分を無気力にさせるようなものにはもう執着できません。\n最終的には貯金の50％を失ってしまうかもしれません。\n\nだから私は家を出ます。\n\n妻と別れて、より多くの時間を勉強に費やすために...。",
      "title": "出来る限り頑張ったが、もう終わりだ。私は去ります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "不要误解我的意思，高潮是惊人的，但低谷已经变得难以承受。\n处理。我不能再坚持那些总是不稳定的东西，让我感到紧张和不安全，并可能最终使我失去50%的储蓄。\n感到紧张和不安全，并可能最终使我失去50%的储蓄。\n\n所以我要离开。\n\n离开我的妻子，花更多时间研究...",
      "title": "我尽可能地坚持了很久，但一切都结束了。我要离开了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不要誤解我的意思，高潮是驚人的，但低谷已經變得難以承受。\n處理。我不能再堅持那些總是不穩定的東西，讓我感到緊張和不安全，並可能最終使我失去50%的儲蓄。\n感到緊張和不安全，並可能最終使我失去50%的儲蓄。\n\n所以我要離開。\n\n離開我的妻子，花更多時間研究...",
      "title": "我儘可能地堅持了很久，但一切都結束了。我要離開了。"
    }
  ],
  "title": "I hung in as long as I could, but it’s over. I’m leaving.",
  "created_utc": 1624206972,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Don’t get me wrong, the highs are amazing, but the lows have become too much to handle. I can no longer cling to something that is always volatile, makes me feel nervous and insecure, and may ultimately cost me 50% of my savings. </p>\n\n<p>So I’m leaving. </p>\n\n<p>Leaving my wife to spend more time studying the crypto charts.</p>\n\n<p>Edit: No, this wasn’t stolen from Superstonk. Look at the timestamps. This post is an hour older than the one over there. They stole it and changed a few words, which is fine by me since mine was the 67,000th recycling of this joke to begin with. Just wanted to set the record straight since a lot of comments have mentioned seeing this on Superstonk.</p>\n</div><!-- SC_ON -->",
  "score": 903,
  "permalink": "/r/CryptoCurrency/comments/o442ux/i_hung_in_as_long_as_i_could_but_its_over_im/",
  "subreddit": "CryptoCurrency",
  "id": "o442ux",
  "is_self": true,
  "media": null,
  "is_video": false
}