{
  "author": "TAKgod123",
  "the_new_excerpt": "As many of you are learning Vitalik was gifted 50% of the supply of SHIB and\nmany other meme (shit) coin tokens. As this meme hype cycle ramped up these\ncoins began climbing the Marketcap charts worth billions of dollars!\n\nVitalik did the right thing and swapped his shit coins for precious ETH…",
  "original_created_utc": 1620844801,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "多くの方がご存知のように、ヴィタリックはSHIBやその他多くのミーム（クソ）・コイン・トークンの供給量の50％をプレゼントされました。\n他の多くのミーム（クソ）コイン・トークンの供給の50％を与えられました。このミーム・ハイプ・サイクルが盛り上がると、これらの\nこれらのコインは数十億ドルの価値を持つMarketcapチャートを上昇し始めました。\n\nVitalikは正しいことをして、自分のクソコインを貴重なETHと交換しました...",
      "title": "ビタリックは私たちをベアマーケットから救ったかもしれない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "正如你们中的许多人所了解的那样，Vitalik被赠予了SHIB和许多其他记忆（狗屎）币的50%的供应量。\n许多其他纪念币（狗屎）代币。随着这段回忆性的炒作周期的上升，这些\n币开始在Marketcap排行榜上攀升，价值数十亿美元!\n\n维塔利克做了正确的事情，将他的狗屎币换成了珍贵的ETH...",
      "title": "维塔利克可能已将我们从熊市中拯救出来"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "正如你們中的許多人所瞭解的那樣，Vitalik被贈予了SHIB和許多其他記憶（狗屎）幣的50%的供應量。\n許多其他紀念幣（狗屎）代幣。隨着這段回憶性的炒作週期的上升，這些\n幣開始在Marketcap排行榜上攀升，價值數十億美元!\n\n維塔利克做了正確的事情，將他的狗屎幣換成了珍貴的ETH...",
      "title": "維塔利克可能已將我們從熊市中拯救出來"
    }
  ],
  "title": "Vitalik May Have Saved Us From a Bear Market",
  "created_utc": 1620851436,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As many of you are learning Vitalik was gifted 50% of the supply of SHIB and many other meme (shit) coin tokens. As this meme hype cycle ramped up these coins began climbing the Marketcap charts worth billions of dollars!</p>\n\n<p>Vitalik did the right thing and swapped his shit coins for precious ETH and donated the funds to Gitcoin Grants to enrich the Ethereum Ecosystem. This will cause a dip in the short term as panic sellers get out but in the end this will boost legit projects and hopefully people have learned a lesson.</p>\n\n<p>Tdlr: Vitalik is a legend and ETH is as bullish as ever.</p>\n</div><!-- SC_ON -->",
  "score": 1071,
  "permalink": "/r/CryptoCurrency/comments/naw0fz/vitalik_may_have_saved_us_from_a_bear_market/",
  "subreddit": "CryptoCurrency",
  "id": "naw0fz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985993625
}