{
  "author": "Fournote",
  "original_created_utc": 1637152813,
  "title": "Is it weird to identify myself more with my hobby than my career?",
  "created_utc": 1637168402,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So a bit about me, I am the sole breadwinner in the family. I&#39;m in the military with a moderately high enlisted rank and I make around $65K/year plus benefits. People in my family talk about how it&#39;s so amazing that I serve and that being in the military is &quot;a calling,&quot; and people I work with often talk about how dedicated they are to their careers and how they work hard to strengthen their skills to be the best they can be.</p>\n\n<p>Here&#39;s the thing for me - it&#39;s just a job. I joined because I didn&#39;t know what I wanted to do with my life, and the only reason I work hard at it and rise through the ranks is to provide for my family and be financially comfortable. On the side as a hobby I write music. I&#39;m not particularly successful at it (I maybe have a total of 200 views on my YouTube channel and like 13 subscribers) and I don&#39;t make any money at it, but I love doing it. I&#39;ve played live in a few places in town and was pretty well-received and my co-workers enjoy my stuff. Because of this, I consider myself a musician way more than I consider myself a member of the military. Also for security reasons I don&#39;t like telling random people that I&#39;m in the military so I usually identify myself as a freelance musician. People say it&#39;s weird that I do that, and I&#39;ve had someone tell me that &quot;there&#39;s a word for people who identify themselves by their hobbies and interests so intensely,&quot; whatever that means.</p>\n\n<p>So is that weird?</p>\n</div><!-- SC_ON -->",
  "score": 116,
  "permalink": "/r/TooAfraidToAsk/comments/qvyeue/is_it_weird_to_identify_myself_more_with_my_hobby/",
  "subreddit": "TooAfraidToAsk",
  "id": "qvyeue",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So a bit about me, I am the sole breadwinner in the family. I'm in the military\nwith a moderately high enlisted rank and I make around $65K/year plus benefits.\nPeople in my family talk about how it's so amazing that I serve and that being\nin the military is \"a calling,\" and people I work with often…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私のことを少し説明すると、私は家族の中で唯一の稼ぎ頭です。私は軍に所属しています。\n私は軍に所属していて、中程度の階級で、年収6万5,000ドルと手当をもらっています。\n私の家族は、私が軍人であることはとても素晴らしいことだと話しています。\n私の家族は、私が軍人であることはとても素晴らしいことであり、軍人であることは「天職」であると話しています。",
      "title": "自分のキャリアよりも趣味に重きを置くのは変ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "关于我，我是家里唯一的经济支柱。我在军队中\n我在军队里，有一个中等偏上的军衔，年薪约6.5万美元，外加福利。\n我家里的人都在谈论我服役是多么的了不起，而且在军队里是 \"一种召唤，一个人的力量\"。\n军队是 \"一种召唤\"，和我一起工作的人经常......",
      "title": "比起职业，我更认同自己的爱好，这很奇怪吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "關於我，我是家裏唯一的經濟支柱。我在軍隊中\n我在軍隊裏，有一箇中等偏上的軍銜，年薪約6.5萬美元，外加福利。\n我家裏的人都在談論我服役是多麼的了不起，而且在軍隊裏是 \"一種召喚，一個人的力量\"。\n軍隊是 \"一種召喚\"，和我一起工作的人經常......",
      "title": "比起職業，我更認同自己的愛好，這很奇怪嗎？"
    }
  ]
}