{
  "author": "MoistTadpoles",
  "the_new_excerpt": "So watching a lot of Gilmore girls and Seinfeld over the lockdown and as a\nBritish dude my mind is blown by how much damn coffee everyone is drinking.\n\nLike often at 9pm+ and even later people are in diners drinking coffee. How do\nAmericans ever sleep? Why not just go for a pint like we do in the…",
  "original_created_utc": 1616338443,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "所以看了很多吉尔莫女孩和Seinfeld的锁定和作为一个。\n英国老兄我的脑海里被大家喝了多少该死的咖啡而震撼。\n\n比如经常在晚上9点多甚至更晚的时候，人们都在餐厅里喝咖啡。怎么做\n美国人睡过觉吗？为什么不像我们一样去喝一杯... ...",
      "title": "美国人真的像电影里那样一天到晚都在喝咖啡吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以看了很多吉爾莫女孩和Seinfeld的鎖定和作爲一個。\n英國老兄我的腦海裏被大家喝了多少該死的咖啡而震撼。\n\n比如經常在晚上9點多甚至更晚的時候，人們都在餐廳裏喝咖啡。怎麼做\n美國人睡過覺嗎？爲什麼不像我們一樣去喝一杯... ...",
      "title": "美國人真的像電影裏那樣一天到晚都在喝咖啡嗎？"
    }
  ],
  "title": "Do Americans really drink Coffee at all times of the day like in movies?",
  "created_utc": 1616396692,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So watching a lot of Gilmore girls and Seinfeld over the lockdown and as a British dude my mind is blown by how much damn coffee everyone is drinking. </p>\n\n<p>Like often at 9pm+ and even later people are in diners drinking coffee. How do Americans ever sleep? Why not just go for a pint like we do in the UK? </p>\n\n<p>I know we drink an ungodly amount of tea in the UK but it is less caffeinated and having a cup of tea after about 6pm is a little unusual. Drinking a cup of coffee after 9pm would be seen as insanity. </p>\n\n<p>I always got confused when I’m American movies “want to come up for a coffee” when inviting someone for sex after a date would surely lead to most people going “I’m sorry it’s 1am why would I want a cup of caffeine” </p>\n\n<p>So yeah do you guys actually drink coffee at all hours of the day or is it just a thing in movies to get two characters sat somewhere to talk that isn’t a bar or one of their houses?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/NoStupidQuestions/comments/m9yb50/do_americans_really_drink_coffee_at_all_times_of/",
  "subreddit": "NoStupidQuestions",
  "id": "m9yb50",
  "is_self": true,
  "media": null,
  "is_video": false
}