{
  "author": "wsbloverrrrrr",
  "the_new_excerpt": "(Please excuse my username, it's the only account that's not doxxable but I\nswear this is an actual discussion)\n\nNewbie investor here and been in PLTR since early Nov last year. With the\ndownward trend in the stock's price action, I've been having bearish thoughts on\nPalantir like (the stock really…",
  "original_created_utc": 1616787276,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "(请原谅我的用户名，这是唯一一个不能被doxxx的账号，但我。\n发誓这是一个真正的讨论)\n\n这里是新手投资者，从去年11月初开始进入PLTR。随着\n股价走势的下跌趋势，我一直有看空的想法。\nPalantir一样（股票真...",
      "title": ""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "(請原諒我的用戶名，這是唯一一個不能被doxxx的賬號，但我。\n發誓這是一個真正的討論)\n\n這裏是新手投資者，從去年11月初開始進入PLTR。隨着\n股價走勢的下跌趨勢，我一直有看空的想法。\nPalantir一樣（股票真...",
      "title": ""
    }
  ],
  "title": "PLTR - bearish discussion to better understand the company",
  "created_utc": 1616842740,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>(Please excuse my username, it&#39;s the only account that&#39;s not doxxable but I swear this is an actual discussion)</p>\n\n<p>Newbie investor here and been in PLTR since early Nov last year. With the downward trend in the stock&#39;s price action, I&#39;ve been having bearish thoughts on Palantir like (the stock really might be overvalued in PS ratio all that shit) so I&#39;m posting this discussion post so I can get some confirmation bias.</p>\n\n<p>Will list out some bearish topics I&#39;ve been seeing on blind and other forums regarding pltr. Going to skip talking about their products as there&#39;s plenty of materials out there that show how amazingly innovative and advanced Foundry looks</p>\n\n<p><strong>Share dilution</strong></p>\n\n<p>So according to their 10-k annual report, they have <strong>1.792 billion</strong> outstanding shares and <strong>743 million</strong> outstanding options (exercisable in the period of multiple years) as of end of 2020, of which <strong>133 million</strong> of them will expire by end of 2022. According to the post I&#39;ve read, apparently most tech companies (at the time of their respective IPOs) average 10-20% share dilution, mostly in the low 10&#39;s.</p>\n\n<p>PLTR will be going through <strong>41%</strong> share dilution. I know share dilution shouldn&#39;t affect the company&#39;s outlook but this seems pretty severe. What could this mean? Could this mean they got fucked by early investors or is it management being greedy? That doesn&#39;t connect though considering they barely sold post-lock up expiry (sold 24 million shares out of 600+ million shares they hold collectively)</p>\n\n<p><strong>Business focus</strong></p>\n\n<p>In simplest terms, Palantir seems to focus only on boomer companies/organizations at the moment and don&#39;t let businesses to freely try out their products (like letting users create an account and stuff, have to contact them and wait for a response). The lack of trial makes sense, but I&#39;m a little confused on their stubbornness with &quot;only large companies&quot;. That kind of focus seems to create negatives like years of potentially wasteful sales cycles, customer concentration risks, etc.</p>\n\n<p>Most importantly, they don&#39;t advocate for use cases for tech industry (after all, they themselves are a tech company). This <a href=\"https://www.teamblind.com/post/What-makes-Palantirs-business-effective-gunhFsRL\">post</a> states what I resonate with:</p>\n\n<p>&quot;I could easily imagine ecommerce, social media, any type of tech companies leveraging Foundry to organize, analyze data without the need to dedicate a team to create lower quality internal tools&quot;</p>\n\n<p>As a software engineer myself, I agree with this statement. Arguably, tech products/apps can collect data way more easily (users are literally interacting with them) and I&#39;ve also seen at both big companies like FANG and startups where they dedicate teams to build mediocre internal tools, which btw Palantir states as their biggest competition in all their sec filings.</p>\n\n<p>Plus, it&#39;d make more sense to start top-down. If Palantir can convince tech companies, boomer companies should naturally follow right? Just like how more boomers are adopting newer apps/tools like Slack for communications, AWS for cloud, etc.</p>\n\n<p>I obviously believe that their management (Thiel, Karp, etc.) is super strong and solid but I can&#39;t blindly trust them with my hard-earned money. Seems weird that their business focus on boomers actually do sound like the opposite of a growth story, but rather, way too stubborn with their philosophical beliefs, like how they state that they will not work with China/non-western forces, work with only large companies as they create more impact than SMBs, which is subjectively great in ethical/philosophical sense but does not sound that great in terms of growth and $$$</p>\n\n<p>Am I just over-thinking? Would appreciate some discussion on the stock</p>\n\n<p><strong>TL;DR:</strong> Having some bear thoughts and I&#39;m looking for confirmation bias</p>\n</div><!-- SC_ON -->",
  "score": 47,
  "permalink": "/r/stocks/comments/mdwibp/pltr_bearish_discussion_to_better_understand_the/",
  "subreddit": "stocks",
  "id": "mdwibp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357141530
}