{
  "author": "Nish_thp",
  "the_new_excerpt": "If my understanding is correct, after being vaccinated, the body produces\nantibodies against a particular pathogen. This can offer protection to the body\nif any live pathogen were to attack the body.\n\nBut, and contextually in case of COVID-19, I have also read that, even after\nvaccination, the…",
  "original_created_utc": 1619525633,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の理解が正しければ、ワクチンを接種した後、体は特定の病原体に対する抗体を生成します。\n体内で特定の病原体に対する抗体が作られます。これにより、生きた病原体が体内に侵入しても\n生きた病原体が体を攻撃しても、体を守ることができます。\n\nしかし、COVID-19の場合には、ワクチンを接種した後でも、...\nワクチンを接種しても...",
      "title": "ワクチンを接種した後、時間が経つにつれ、ヒトの免疫系が病原体を「忘れる」ということはあり得るのでしょうか？特定の病原体の情報も免疫系に保持されていることや、病原体によって異なることを考えると、これはどのような仕組みなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果我的理解是正确的，接种疫苗后，身体会产生\n产生针对某一特定病原体的抗体。这可以为身体提供保护\n如果任何活的病原体攻击身体，这可以为身体提供保护。\n\n但是，就COVID-19而言，我还读到，即使在接种疫苗之后\n疫苗接种后，...",
      "title": "随着时间的推移，人类免疫系统是否可能在接种疫苗后 \"忘记 \"任何病原体？考虑到某些病原体的信息也会被免疫系统保留，这一点是如何做到的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果我的理解是正確的，接種疫苗後，身體會產生\n產生針對某一特定病原體的抗體。這可以爲身體提供保護\n如果任何活的病原體攻擊身體，這可以爲身體提供保護。\n\n但是，就COVID-19而言，我還讀到，即使在接種疫苗之後\n疫苗接種後，...",
      "title": "隨着時間的推移，人類免疫系統是否可能在接種疫苗後 \"忘記 \"任何病原體？考慮到某些病原體的信息也會被免疫系統保留，這一點是如何做到的？"
    }
  ],
  "title": "Is it possible for the human immune system to \"forget\" any pathogen after vaccination as time passes? How does this work considering that information on certain pathogens are also retained by the immune system and does this vary based on different pathogens?",
  "created_utc": 1619535281,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If my understanding is correct, after being vaccinated, the body produces antibodies against a particular pathogen. This can offer protection to the body if any live pathogen were to attack the body.</p>\n\n<p>But, and contextually in case of COVID-19, I have also read that, even after vaccination, the antibodies that target the virus drop in number with the passage of time. Contrary to this, I have also read that the immune system does have the ability to remember and retain information about any pathogen for extended periods of time. How do these two correlate with each other?</p>\n\n<p>Does/Can the human immune system essentially forget the information on any pathogen after a set period of time? Is this universal to all pathogens and if not, what exactly affects this?</p>\n</div><!-- SC_ON -->",
  "score": 145,
  "permalink": "/r/askscience/comments/mzn39o/is_it_possible_for_the_human_immune_system_to/",
  "subreddit": "askscience",
  "id": "mzn39o",
  "is_self": true,
  "media": null,
  "is_video": false
}