{
  "author": "Smerf_Jr",
  "original_created_utc": 1628717245,
  "title": "How much of the population is affected by herpes?",
  "created_utc": 1628792906,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>(Disclaimer: I don&#39;t know if this is the write subreddit for this question, but it felt the most appropriate. If there is somewhere else I can post this feel free to let me know.)</p>\n\n<p>So my question is quite clear, but I have had trouble finding a definite answer. I was doing a bit of digging into the subject of STI&#39;s and how they are able to be transmitted and the likelihood of someone having it. Most of them were clear cut except herpes.\nHerpes, regardless of where I looked, had a different statistic.\nWHO (world health organizations) states that in one article about 14% of the world has herpes, yet in another says that 7 billion people have herpes. The CDC (Center for Disease Control and prevention) states that only half the world has herpes.</p>\n\n<p>I would like to know if these statistics are true or not as it seems weird to me that if any of them are true that no one would see this as a pandemic. \n( I am also lumping all forms of herpes together, seeing as if it truly is this bad we should look at it like we view cancer.)</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/askscience/comments/p2mkfy/how_much_of_the_population_is_affected_by_herpes/",
  "subreddit": "askscience",
  "id": "p2mkfy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "(Disclaimer: I don't know if this is the write subreddit for this question, but\nit felt the most appropriate. If there is somewhere else I can post this feel\nfree to let me know.)\n\nSo my question is quite clear, but I have had trouble finding a definite answer.\nI was doing a bit of digging into the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "(免責事項：この質問に対する書き込みsubredditであるかどうかはわかりませんが\nここが一番適切だと思いました。もし他に投稿できる場所があれば、遠慮なく\nお気軽に教えてください)\n\n私の質問はとても明確ですが、明確な答えを見つけるのに苦労しました。\n私は少し調べてみたのですが...",
      "title": "ヘルペスに罹患している人はどのくらいいるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "(免责声明：我不知道这是否是这个问题的写作子目录，但\n它感觉最合适。如果有其他地方我可以发布这个，请告诉我。\n可以让我知道）。)\n\n所以我的问题很清楚，但我很难找到一个明确的答案。\n我在做了一些调查，了解了一些情况。",
      "title": "有多少人受到疱疹的影响？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "(免責聲明：我不知道這是否是這個問題的寫作子目錄，但\n它感覺最合適。如果有其他地方我可以發佈這個，請告訴我。\n可以讓我知道）。)\n\n所以我的問題很清楚，但我很難找到一個明確的答案。\n我在做了一些調查，瞭解了一些情況。",
      "title": "有多少人受到皰疹的影響？"
    }
  ]
}