{
  "author": "M00OSE",
  "the_new_excerpt": "I know a lot of people sell the crypto market as a \"get rich quick\". But the\ntruth is you're only going to make others rich quick with that mentality.\n\nDid you get in at the beginning of 2021? Congrats. But the truth is you've been\nin the crypto market for a few months. There is so much for you to…",
  "original_created_utc": 1622203142,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "多くの人が、暗号市場を「一攫千金」として売っているのは知っています。しかし、実際\n実際には、そのような考え方では、他人を一攫千金にすることしかできません。\n\n2021年の初めに入ったのですか？おめでとうございます。でも本当は、あなたは数年前から\n暗号市場に参入して数ヶ月。あなたがすべきことはたくさんあります...。",
      "title": "暗号市場に投資する際の正しい考え方は、月単位ではなく年単位で考えることです"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道很多人把加密货币市场当作 \"快速致富 \"来推销。但事实是\n事实是，你的这种心态只会让别人快速致富。\n\n你在2021年年初就进入了吗？祝贺你。但事实是你已经\n在加密货币市场已经有几个月了。有这么多东西等着你去...",
      "title": "投资加密货币市场的正确心态是以年而非月为单位进行思考"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道很多人把加密貨幣市場當作 \"快速致富 \"來推銷。但事實是\n事實是，你的這種心態只會讓別人快速致富。\n\n你在2021年年初就進入了嗎？祝賀你。但事實是你已經\n在加密貨幣市場已經有幾個月了。有這麼多東西等着你去...",
      "title": "投資加密貨幣市場的正確心態是以年而非月爲單位進行思考"
    }
  ],
  "title": "The correct mentality for investing in the crypto market is thinking in YEARS not MONTHS",
  "created_utc": 1622226039,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I know a lot of people sell the crypto market as a &quot;get rich quick&quot;. But the truth is you&#39;re only going to make others rich quick with that mentality.</p>\n\n<p>Did you get in at the beginning of 2021? Congrats. But the truth is you&#39;ve been in the crypto market for a few months. There is so much for you to learn; tons of theoretical models and blockchain trilemma solutions. So many financial instruments from Defi to Dexes. Learn, learn, and learn—you have a whole universe to explore. That&#39;s nothing in the grand scheme of cryptocurrencies.</p>\n\n<p>Did you hear about those stories like &quot;someone bought a pizza for 10, 000BTC,&quot; that&#39;d be worth millions now? Well, it took years for that story to become relevant. It doesn&#39;t appeal as much but <strong>you have to start thinking in terms of years.</strong></p>\n\n<p>Ask yourself, if the cryptocurrency you are holding will still be here in the long term? If yes, continue accumulating. Otherwise, chill out because you&#39;ve got confidence in what you are holding and continue doing research. And, if it&#39;s still a no-go, just sell it—you can support crypto without actually holding any.</p>\n\n<p>So much about investing is more about being able to control your emotions and having the correct risk/reward management than actually picking a project.</p>\n</div><!-- SC_ON -->",
  "score": 511,
  "permalink": "/r/CryptoCurrency/comments/nmw9hx/the_correct_mentality_for_investing_in_the_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "nmw9hx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804296473
}