{
  "author": "boatnofloat",
  "original_created_utc": 1633662318,
  "title": "So how are US taxes going to work after someone like me has made 1000 trades this last year?",
  "created_utc": 1633692826,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I know each trade or exchange is a taxable event. I know there is an 8949 form that we fill out, but I mean: how is every expenditure on a Coinbase card going to have to be listed? How am I going to write in every time I hopped into doge for an hour on a bulll run just to buy high and sell low? I have this foreboding feeling that my reckless trading has made days of work for myself. Last year I kept everything off exchanges and never reported. How fucked am I really, or is the 1099 from my exchange going to simplify this whole thing?</p>\n</div><!-- SC_ON -->",
  "score": 186,
  "permalink": "/r/CryptoCurrency/comments/q3p11h/so_how_are_us_taxes_going_to_work_after_someone/",
  "subreddit": "CryptoCurrency",
  "id": "q3p11h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So I know each trade or exchange is a taxable event. I know there is an 8949\nform that we fill out, but I mean: how is every expenditure on a Coinbase card\ngoing to have to be listed? How am I going to write in every time I hopped into\ndoge for an hour on a bulll run just to buy high and sell low? I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そのため、それぞれの取引や交換が課税対象となることは知っています。8949フォームがあることも知っています。\n記入しますが、Coinbaseカードでのすべての支出をどうやって\nしかし、Coinbaseカードでの支出をすべて記載しなければならないでしょうか？どうやって、Coinbaseカードでの支出をすべて記載するのでしょうか？\n高値で買ったり安値で売ったりするために、1時間ほどdogeに飛び込んだことをどうやって書き込めばいいんだ？I...",
      "title": "では、私のような人間がこの1年で1000回もトレードをした後、アメリカの税金はどうなるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我知道每笔交易或交换都是一个应税事件。我知道有一个8949\n但我的意思是：Coinbase卡上的每笔支出怎么会\n都要列出来？我怎么能写上我每次跳入\ndoge的一个小时，只是为了买高卖低？I...",
      "title": "那么，像我这样的人在去年做了1000笔交易之后，美国的税收要怎么算呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我知道每筆交易或交換都是一個應稅事件。我知道有一個8949\n但我的意思是：Coinbase卡上的每筆支出怎麼會\n都要列出來？我怎麼能寫上我每次跳入\ndoge的一個小時，只是爲了買高賣低？I...",
      "title": "那麼，像我這樣的人在去年做了1000筆交易之後，美國的稅收要怎麼算呢？"
    }
  ]
}