{
  "author": "mystic_swole",
  "original_created_utc": 1635484930,
  "title": "What happens if I don't pay my crypto taxes",
  "created_utc": 1635510951,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I honestly have no idea how the heck I would go about figuring out my taxes. I have a bout 40-50 different cryptos that I started heavily DCA&#39;ing into small amounts at a time, starting around February. After getting burned when Crypty.com stole 3 of my BTC and millions of DOGE and lots of LTC years ago I finally decided to get back into the market.</p>\n\n<p>All of my Crypto.com, and robin hood transactions are pretty straightforward I would just download the CVS file or look at my transactions. But my Coinbase stuff is weird because I was transferring back and forth to Coinbase Pro and making trades. I don&#39;t see where to see my transactions on Bitmart. Also I have Coinbase wallet in which I sent a lot of Eth to buy stuff on Uniswap and I don&#39;t see a record of transactions on their either. </p>\n\n<p>What happens if I just sell all my shit and don&#39;t pay any taxes, would I be fucked? I&#39;m not high income or anything and while it&#39;s 5 figures it&#39;s not a massive amount of money. I honestly just don&#39;t know where to start on the tax stuff. My grandma always does my taxes. I have sold some crypto some years in the past and never claimed taxes but it wasn&#39;t nearly this much.</p>\n</div><!-- SC_ON -->",
  "score": 168,
  "permalink": "/r/CryptoCurrency/comments/qi5hec/what_happens_if_i_dont_pay_my_crypto_taxes/",
  "subreddit": "CryptoCurrency",
  "id": "qi5hec",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So I honestly have no idea how the heck I would go about figuring out my taxes.\nI have a bout 40-50 different cryptos that I started heavily DCA'ing into small\namounts at a time, starting around February. After getting burned when\nCrypty.com stole 3 of my BTC and millions of DOGE and lots of LTC…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "だから、税金をどうやって計算したらいいのか、正直言ってわからないんです。\n私は約40～50種類の暗号を持っていて、2月頃から少量ずつ大量のDCAを始めました。\n2月頃から少量ずつ大量にDCAを回し始めました。その後\nCrypty.comが私のBTCの3つと何百万ものDOGEとたくさんのLTCを盗んだ時に燃えました...",
      "title": "暗号の税金を払わないとどうなるか"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我真的不知道该如何计算我的税收。\n我有大约40-50个不同的加密货币，我开始大量使用DCA，并在小范围内使用。\n从2月左右开始，每次都有少量的DCA。在经历了以下情况后，我被烧毁了\nCrypty.com偷走了我的3个BTC和数以百万计的DOGE以及大量的LTC......",
      "title": "如果我不支付我的加密货币税，会发生什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我真的不知道該如何計算我的稅收。\n我有大約40-50個不同的加密貨幣，我開始大量使用DCA，並在小範圍內使用。\n從2月左右開始，每次都有少量的DCA。在經歷了以下情況後，我被燒燬了\nCrypty.com偷走了我的3個BTC和數以百萬計的DOGE以及大量的LTC......",
      "title": "如果我不支付我的加密貨幣稅，會發生什麼？"
    }
  ]
}