{
  "author": "billymarkus2k",
  "original_created_utc": 1642272363,
  "title": "Stop Gatekeeping Crypto Adoption",
  "created_utc": 1642286291,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The salty, highly upvoted post mocking dogecoin being accepted at Tesla for some items - the sixth largest company in the world in market cap, and undoubtedly one of the most visible companies in the world, accepting the purchase of items with cryptocurrency - priced in cryptocurrency and not fiat - is absolutely disgraceful. It shows what this sub is - not an advocate for cryptocurrency, but a thinly veiled place to be tribal and act salty when other people’s bags do well.&lt;/p&gt;\n\n&lt;p&gt;That’s pathetic.&lt;/p&gt;\n\n&lt;p&gt;This is a win for cryptocurrency in general. I’ve been around this space since 2013. Back then, Bitcoiners were screaming for companies to accept cryptocurrency and price things in cryptocurrency. Then when it happens 8 years later, the primary attitude about it is salt just because the cryptocurrency of choice isn’t in the bag of certain people in the sub.&lt;/p&gt;\n\n&lt;p&gt;Grow up, take a step back, and recognize this as a win for cryptocurrency. We are in this together.&lt;/p&gt;\n\n&lt;p&gt;If it was your cryptocurrency of preference being accepted, you’d magically consider it a good thing. That’s the truth.&lt;/p&gt;\n\n&lt;p&gt;Note: My bad, this is a remade post - the original was closed as I shared it on my Twitter, which I have found is against this subreddit’s rules.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 403,
  "permalink": "/r/CryptoCurrency/comments/s4r422/stop_gatekeeping_crypto_adoption/",
  "subreddit": "CryptoCurrency",
  "id": "s4r422",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The salty, highly upvoted post mocking dogecoin being accepted at Tesla for some\nitems - the sixth largest company in the world in market cap, and undoubtedly\none of the most visible companies in the world, accepting the purchase of items\nwith cryptocurrency - priced in cryptocurrency and not fiat …",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "テスラでドージコインが使えるようになったことを嘲笑する、アップボーティングの多い塩辛い投稿。\n時価総額で世界第6位の企業であり、間違いなく世界最大の企業です。\n世界で最も注目されている企業の1つで、商品の購入を受け入れています。\n暗号通貨で - 価格は暗号通貨で、フィアットではありません ...",
      "title": "暗号の導入のゲートキーピングを止める"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "讽刺特斯拉接受dogecoin购买某些物品的帖子咸鱼翻身，获得了很高的投票率。\n物品--世界上市值第六大的公司，而且无疑是最引人注目的公司之一。\n世界上市值第六大的公司之一，无疑是世界上最引人注目的公司之一，接受用加密货币购买物品。\n用加密货币购买物品--以加密货币而不是法币定价 ...",
      "title": "停止对加密货币采用的把关"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "諷刺特斯拉接受dogecoin購買某些物品的帖子鹹魚翻身，獲得了很高的投票率。\n物品--世界上市值第六大的公司，而且無疑是最引人注目的公司之一。\n世界上市值第六大的公司之一，無疑是世界上最引人注目的公司之一，接受用加密貨幣購買物品。\n用加密貨幣購買物品--以加密貨幣而不是法幣定價 ...",
      "title": "停止對加密貨幣採用的把關"
    }
  ]
}