{
  "author": "OldCarWorshipper",
  "original_created_utc": 1625990964,
  "title": "How many of you have seen or heard adults compare notes, laugh, or even brag about the cruel punishments they inflicted on their children for misbehaving?",
  "created_utc": 1626061603,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was a victim of this. Until I reached junior high, my dad used to spank me on my bare bottom with a switch, leaving red bloody welts. He made a point of telling my mom and grandparents about how when I was in trouble, he&#39;d &quot;waste no time getting down to the bare facts&quot; - meaning my bony little preteen ass. Thankfully by the time I was 12, he switched to a belt through my underwear. Still degrading. </p>\n\n<p>I can&#39;t even count how many conversations I&#39;ve listened to with older folks talking about how they used to &quot;tear his / her little ass up&quot;- sometimes with a little laugh or chuckle. It still sickens me to this day.</p>\n\n<p>I realize that sometimes kids can be little shitheads sometimes, and physical discipline may be necessary. However- when it involves exposing their bare buttocks / genitals, and drawing blood or causing blisters, it&#39;s gone too far. Yet so many older adults seem  to fondly reminisce about the &quot;good old days&quot; when treating your child like a third-world political prisoner was both legal <em>and</em> socially acceptable.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/oi0irb/how_many_of_you_have_seen_or_heard_adults_compare/",
  "subreddit": "TooAfraidToAsk",
  "id": "oi0irb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was a victim of this. Until I reached junior high, my dad used to spank me on\nmy bare bottom with a switch, leaving red bloody welts. He made a point of\ntelling my mom and grandparents about how when I was in trouble, he'd \"waste no\ntime getting down to the bare facts\" - meaning my bony little…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はその被害者です。中学生になるまで、父はスイッチで私のお尻を叩きました。\nお尻をスイッチで叩いて、赤い血の跡を残していました。父は、母や祖父母に\n母や祖父母には、私が問題を起こしたときには、「すぐに事実を突きつける」と言っていました。\nつまり、私の骨ばった小さな...",
      "title": "いたずらをした子どもに与えた残酷な仕打ちについて、大人たちが比較検討したり、笑ったり、自慢したりするのを見聞きしたことがある人はどれくらいいるでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是这方面的一个受害者。在我上初中之前，我父亲经常用开关打我的屁股，留下红色的血痕。\n我的光屁股上，留下血淋淋的红色伤痕。他还特意\n他特意告诉我妈妈和祖父母，当我遇到麻烦时，他 \"不惜一切代价\n浪费时间\"--指的是我那瘦骨嶙峋的小...",
      "title": "你们有多少人见过或听到过成年人比较，嘲笑，甚至吹嘘他们对孩子的不当行为所施加的残酷惩罚？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是這方面的一個受害者。在我上初中之前，我父親經常用開關打我的屁股，留下紅色的血痕。\n我的光屁股上，留下血淋淋的紅色傷痕。他還特意\n他特意告訴我媽媽和祖父母，當我遇到麻煩時，他 \"不惜一切代價\n浪費時間\"--指的是我那瘦骨嶙峋的小...",
      "title": "你們有多少人見過或聽到過成年人比較，嘲笑，甚至吹噓他們對孩子的不當行爲所施加的殘酷懲罰？"
    }
  ]
}