{
  "author": "ZForce89",
  "original_created_utc": 1638209637,
  "title": "It is incredibly important that we encourage people to not hold Tether.",
  "created_utc": 1638234773,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We have all heard the FUD. Buttcoiners and crypto skeptics alike are quick to show graphs of Tether printing and BTC price to supposedly prove that this whole thing we have going here is a scam.</p>\n\n<p>Anyone with a basic understanding of the technology behind successful projects, especially Bitcoin, knows that is not true. Bitcoin and crypto is here to stay, and the battle has begun as to which ones will survive and how governments will adapt and respond.</p>\n\n<p>However, even though Tether is not the end of the crypto universe, it is a serious risk which should not be taken lightly. It currently sits at over 74B in market cap, which would make it one of the biggest bankruptcies of all time if it fails, and would certainly have a huge impact on the overall market.</p>\n\n<p>Tether, to my knowledge, has only around 20 employees. This is the highest employee to value ratio of any entity, ever, even the biggest ponzis like Bernie Madoff. They have not been transparent on their holdings. They have largely had no accountability for minting of coins, which makes the likelihood of fraud incredibly high. They can basically counterfeit USD with no backing to keep up with demand if they require.</p>\n\n<p>Tether is not much worse then what traditional banks have done in the past. The problem becomes that eventually the government will crack down, and these &#39;Tether dollars&#39; will not be accepted and will not have value. And unlike banks of the past, there is little chance of Tether being bailed out by US taxpayers.</p>\n\n<p>We don&#39;t need to bankrun Tether. Regulators will do their work eventually and the bandaid will be ripped off. Some might be compensated.</p>\n\n<p>We need to do two things.</p>\n\n<ol>\n<li>Actively discourage holding Tether for new users. Never recommend people continue to buy in or sell into it. The more we can reduce the damage in the future, the better it will be. And even if there is a slim chance there actually isn&#39;t anything sinister going on, there are tons of other stablecoins which serve the same purpose and have much better transparency.</li>\n<li>Make sure people understand that even if Tether is shown to be a scam, BITCOIN AND ETHEREUM are not scams. Banks will try to use the fear from a crash due to an UnTethering to prove that we need central control, insurance, and their currencies. This is NOT the case. Even if the value of BTC, ETH, or other actual projects goes down temporarily due to fear, they still work exactly as they are designed. It will be a great buying opportunity and the more we adopt actually valuable money like BTC, the safer we will be.</li>\n</ol>\n\n<p>Best wishes to all, and fuck sketchy stable coins. Mostly though, fuck the federal reserve, the sketchiest stable coin issuer out there.</p>\n</div><!-- SC_ON -->",
  "score": 164,
  "permalink": "/r/CryptoCurrency/comments/r51usn/it_is_incredibly_important_that_we_encourage/",
  "subreddit": "CryptoCurrency",
  "id": "r51usn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "We have all heard the FUD. Buttcoiners and crypto skeptics alike are quick to\nshow graphs of Tether printing and BTC price to supposedly prove that this whole\nthing we have going here is a scam.\n\nAnyone with a basic understanding of the technology behind successful projects,\nespecially Bitcoin,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私たちは皆、FUDを聞いたことがあります。Buttcoinerや暗号に懐疑的な人たちは、すぐに\nテザーの印刷とBTC価格のグラフを見せて、この全体的なことを証明していると思われます。\n詐欺であることを証明しようとします。\n\n成功しているプロジェクトの背後にある技術について基本的な理解をしている人なら誰でも、特にビットコインや..,\n特にビットコインは...",
      "title": "Tetherを持たないように勧めることは非常に重要です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们都听到了FUD的声音。屁民们和加密货币怀疑论者都会迅速地\n显示Tether打印和BTC价格的图表，以证明这整个\n我们在这里的事情是一个骗局。\n\n任何对成功项目背后的技术有基本了解的人。\n尤其是比特币，...",
      "title": "我们鼓励人们不要持有Tether，这一点极其重要。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們都聽到了FUD的聲音。屁民們和加密貨幣懷疑論者都會迅速地\n顯示Tether打印和BTC價格的圖表，以證明這整個\n我們在這裏的事情是一個騙局。\n\n任何對成功項目背後的技術有基本瞭解的人。\n尤其是比特幣，...",
      "title": "我們鼓勵人們不要持有Tether，這一點極其重要。"
    }
  ]
}