{
  "author": "suspicious_gardener",
  "the_new_excerpt": "Disclaimer: Not an economist. But, I've done some research on the current\nfinancial environment of the US dollar and the economy, and we are definitely in\nuncharted territory. Over 20% of all USD was printed last year, and a lot of it\nwent to buying stocks through quantitative easement.\n\nIn this…",
  "original_created_utc": 1609603407,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "免责声明：不是经济学家。但是，我对当前的情况做了一些研究\n美元和经济的金融环境，我们肯定是在\n未知领域。去年，超过20%的美元都是印制的，而且其中很大一部分是印制的\n通过量化地役权购买了股票。\n\n在此…中",
      "title": "在美联储向流通领域注入现金之际，还有谁将比特币用作财富储备？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "免責聲明：不是經濟學家。但是，我對當前的情況做了一些研究\n美元和經濟的金融環境，我們肯定是在\n未知領域。去年，超過20%的美元都是印製的，而且其中很大一部分是印製的\n通過量化地役權購買了股票。\n\n在此…中",
      "title": "在美聯儲向流通領域注入現金之際，還有誰將比特幣用作財富儲備？"
    }
  ],
  "title": "Anyone else using Bitcoin as a store of wealth as the Fed pumps cash into circulation?",
  "created_utc": 1609660038,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Disclaimer: Not an economist. But, I&#39;ve done some research on the current financial environment of the US dollar and the economy, and we are definitely in uncharted territory. Over 20% of all USD was printed last year, and a lot of it went to buying stocks through quantitative easement. </p>\n\n<p>In this post I break down investment vehicles into 4 main groups.</p>\n\n<ul>\n<li>Cash and bonds.</li>\n<li>Equity (stocks, real estate, anything regularly traded on the equity exchanges and has been propped up by quantitative easement.</li>\n<li>Gold. You can buy this on equity exchanges but it behaves differently, so I separated it.</li>\n<li>Alternative Investments (baseball cards, rare antiques, piles of dogshit, whatever).</li>\n</ul>\n\n<p>My understanding of what is currently happening:</p>\n\n<ol>\n<li>Interest rates are basically 0. That means bonds are not a feasible investing vehicle. So, you can&#39;t invest your cash risk free.</li>\n<li>Over 20% of all USD was printed in 2020. <a href=\"https://fred.stlouisfed.org/series/M1\">Just look at the M1 money supply</a>.</li>\n<li>This money has been used to buy all kinds of financial assets (stocks, junk bonds, real estate, ETFs, etc.) which has propped up the stock market. People are also starting to speculate that assets are rising in price as a hedge against inflation.</li>\n<li>Consumer prices (the price of a cheeseburger) has not really changed because... this money is not being spent. It sits in the stock market because there&#39;s nothing else to do with it. Do you want to open up a business right now? Go on vacation? Buy more clothes? There really isn&#39;t anything to do except pay down debt and buy assets, which is what people have been doing. But the USD is still there.</li>\n</ol>\n\n<p>I&#39;m under the impression that the price of equity has been rising because of both inflation and the fact that the FED is buying it up. The demand is artificial and can&#39;t last forever. So, shouldn&#39;t stocks be overvalued even after taking inflation into account? Shouldn&#39;t we expect a big dip when things start opening back up and people want to use their cash for something that isn&#39;t overvalued?</p>\n\n<p>Enter Bitcoin. <strong>I would like to know people&#39;s thoughts on my understanding of Bitcoin. I am not an expert.</strong> It is similar to the USD in that it has no intrinsic value. The main difference is that no government can just decide to print more of it. What is the actual value of 1 bitcoin? Unlike gold or real estate, it doesn&#39;t really have a true value. It can be mined, so if price sky-rockets to $1 billion then the number of miners will increase which helps stabilize prices, however I find it a better hedge against inflation than other assets because:</p>\n\n<ol>\n<li>Gold. Has &#39;intrinsic value&#39; in that it can be worn as a sign of wealth. It also has practical uses because of its physical properties, but that doesn&#39;t really affect the price. It can be used as a hedge against inflation, but unless people believe we are entering some apocalyptic scenario, there is only so much people are going to be willing to pay to wear gold on their wrist, unlike bitcoin, which isn&#39;t tied to something intrinsic.</li>\n<li>Cash. Governments can print more, as the Fed is doing right now. You want cash on hand if you think the price of assets are going to fall. Cash right now is obviously a terrible investment.</li>\n<li>Equity. The reasons listed above. Artificial demand + printing money means stocks are overvalued.</li>\n<li>I believe real estate, since it is seen as a traditional investment and is available on equity exchanges under the form of REIT&#39;s and others, has gone the way of stocks. The FED has been purchasing REITs and mortgage bonds as a part of QE.</li>\n<li>Alternative investments (baseball cards, piles of lumber, whatever you can think of). I find these similar to gold, but they have 1 advantage. There is only so much people are going to be willing to trade for baseball cards, however you can&#39;t really buy these on equity exchanges. The FED hasn&#39;t been propping up the price artificially, so why should I believe their prices can be inflated by QE? I would also like to know people&#39;s thoughts on this.</li>\n</ol>\n\n<p>The cons of bitcoin are that it can simply be banned. I don&#39;t have the foresight or knowledge to know what kind of havoc that may cause, or what could be used to justify it. It is also a digital asset, if the nukes fall, I guess you were better off with gold or piles of lumber weren&#39;t you.</p>\n\n<p>This is all coming from the point of view of an individual investor, which I am. I am not a hedge fund who has billions to invest. I have a few hundred thousand, and it&#39;s extremely liquid right now. I don&#39;t think the general public has caught on to the idea that maybe &#39;gold that has no intrinsic value&#39; might actually be a good investment vehicle.</p>\n\n<p>&#x200B;</p>\n\n<p>Edit: Formatting</p>\n</div><!-- SC_ON -->",
  "score": 167,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/2ZU3571EI42XIw2hd7K3Rqr95F0uMwZQqT60e8EAwfc.jpg?auto=webp&s=24067359d9414a9955713b6d2d5305184881fea7",
          "width": 880,
          "height": 460
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/2ZU3571EI42XIw2hd7K3Rqr95F0uMwZQqT60e8EAwfc.jpg?width=108&crop=smart&auto=webp&s=e6c03ca6c0fe8df26f388547863848da2e18c034",
            "width": 108,
            "height": 56
          },
          {
            "url": "https://external-preview.redd.it/2ZU3571EI42XIw2hd7K3Rqr95F0uMwZQqT60e8EAwfc.jpg?width=216&crop=smart&auto=webp&s=b9385d3259103c45d7cf672df3a867fa390b4dd8",
            "width": 216,
            "height": 112
          },
          {
            "url": "https://external-preview.redd.it/2ZU3571EI42XIw2hd7K3Rqr95F0uMwZQqT60e8EAwfc.jpg?width=320&crop=smart&auto=webp&s=78922531ba7028f7370bc9511f327a7c164ddc06",
            "width": 320,
            "height": 167
          },
          {
            "url": "https://external-preview.redd.it/2ZU3571EI42XIw2hd7K3Rqr95F0uMwZQqT60e8EAwfc.jpg?width=640&crop=smart&auto=webp&s=dbec1f6a75290b1192b9a6e1f630fe9b219e7c8a",
            "width": 640,
            "height": 334
          }
        ],
        "variants": {},
        "id": "jtPLTVfpn7gg4jdpdZ_nP56QBCsgK3EI0sKX4vZ6c0I"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/Bitcoin/comments/kozxhw/anyone_else_using_bitcoin_as_a_store_of_wealth_as/",
  "subreddit": "Bitcoin",
  "id": "kozxhw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610100740965
}