{
  "author": "King_Vercingetorix",
  "original_created_utc": 1639830757,
  "title": "When did the watering down of MLK's message began exactly? When did Dr. King, the man, became Dr. King, the American mythical hero?",
  "created_utc": 1639855360,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;By watering down, I mean stuff like the public consciousness simplifying and dumbing down his message to just a simple message about unity, anti-racism, etc. (Not mentioning much of his struggles to get a majority of Americans to care about Civil rights, not mentioning much about his anti-Vietnam protests, and almost never mentioning about his struggles for economic equality for black Americans).&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/rj6l32/when_did_the_watering_down_of_mlks_message_began/",
  "subreddit": "AskHistorians",
  "id": "rj6l32",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "By watering down, I mean stuff like the public consciousness simplifying and\ndumbing down his message to just a simple message about unity, anti-racism, etc.\n(Not mentioning much of his struggles to get a majority of Americans to care\nabout Civil rights, not mentioning much about his anti-Vietnam…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "水増しというのは、国民の意識が単純化しているようなものを指す。\n彼のメッセージは、団結や反人種主義などについてのシンプルなメッセージだけになり、ダンピングされています。\n(アメリカ人の大多数に関心を持ってもらうための彼の苦闘についてはあまり触れない）。\n市民権について、反ベトナムについて、あまり触れていない。",
      "title": "MLKのメッセージの水増しは、具体的にいつから始まったのだろうか。キング牧師は、いつからアメリカ神話のヒーローになったのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我所说的淡化，是指像公众意识简化和\n稀释他的信息，使之成为一个关于团结、反种族主义等的简单信息。\n(不提他为使大多数美国人关心民权而进行的斗争，不提他对民权的看法。\n不提他为使大多数美国人关心民权所做的斗争，不提他的反越战......",
      "title": "对MLK信息的淡化究竟是从什么时候开始的？金博士这个人什么时候变成了金博士这个美国神话中的英雄？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我所說的淡化，是指像公衆意識簡化和\n稀釋他的信息，使之成爲一個關於團結、反種族主義等的簡單信息。\n(不提他爲使大多數美國人關心民權而進行的鬥爭，不提他對民權的看法。\n不提他爲使大多數美國人關心民權所做的鬥爭，不提他的反越戰......",
      "title": "對MLK信息的淡化究竟是從什麼時候開始的？金博士這個人什麼時候變成了金博士這個美國神話中的英雄？"
    }
  ]
}