{
  "author": "royalshah10",
  "the_new_excerpt": "So I was going through twitter and I saw a post that said \" would you accept a\n12% risk free return every year\" and the replys to that amazed me. Almost\neveryone said no I couldn't believe my eyes. They all thought that they could do\nbetter than that. If they can do better then they should be…",
  "original_created_utc": 1618083297,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ツイッターを見ていたら、「毎年12％のリスクフリー・リターンを受け入れますか」という投稿がありました。\n12%のリスクフリー・リターンを受け入れますか」という投稿があり、それに対する返信に驚きました。ほとんどの人が\n私は自分の目を疑いましたが、みんな「ノー」と答えていました。彼らは皆、自分ならもっとうまくやれると\nそれ以上のことができると考えていました。もし彼らがもっとうまくやれるなら、彼らは...。",
      "title": "期待しないでください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以，我在微博上看到一个帖子说：\"你会接受一个\n每年12%的无风险收益\"，这样的回复让我很惊讶。几乎\n每个人都说不行，我简直不敢相信自己的眼睛。他们都认为他们可以做\n比这更好的。如果他们能做得更好，那么他们应该... ...",
      "title": "请降低你的期望值，它不会每年都是2020年。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以，我在微博上看到一個帖子說：\"你會接受一個\n每年12%的無風險收益\"，這樣的回覆讓我很驚訝。幾乎\n每個人都說不行，我簡直不敢相信自己的眼睛。他們都認爲他們可以做\n比這更好的。如果他們能做得更好，那麼他們應該... ...",
      "title": "請降低你的期望值，它不會每年都是2020年。"
    }
  ],
  "title": "Please lower your expectations its not going to be 2020 every year",
  "created_utc": 1618091540,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I was going through twitter and I saw a post that said &quot; would you accept a 12% risk free return every year&quot; and the replys to that amazed me. Almost everyone said no I couldn&#39;t believe my eyes. They all thought that they could do better than that. If they can do better then they should be working for JP Morgan or some big hedge funds earning millions a year.</p>\n\n<p>A 12% return every year risk free is amazing I would accept that any day but what do I know. theres people on twitter that are apparently better than warren buffet and they think they can do like 20% every year.</p>\n</div><!-- SC_ON -->",
  "score": 3432,
  "permalink": "/r/stocks/comments/mobez3/please_lower_your_expectations_its_not_going_to/",
  "subreddit": "stocks",
  "id": "mobez3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566618909
}