{
  "author": "ghostoftheuniverse",
  "original_created_utc": 1634920740,
  "title": "The extended warm period during the \"boring billion\" between 1.8 and 0.8 Gya is proposed to have been the result of atmospheric N2O being 10x higher than it is today. Where did all the N2O during that period come from?",
  "created_utc": 1634931335,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>During the boring billion global temperatures were about 4 ºC higher than today due to higher concentrations of greenhouse gases. Scientists have ruled out CO2 as the culprit due to the lack of evidence of ocean acidification. Methane has also been ruled out as it is only biogenic and methanogens are unlikely to have produced enough methane. So scientists seem to have settled on N2O as the offending greenhouse gas, with Proterozoic levels proposed to be elevated 10x over modern levels.</p>\n\n<p>Today, most N2O is either anthropogenic or biogenic, with only a small fraction being formed abiotically. If methanogens were unlikely to produce enough methane to significantly affect the climate, how would denitrifiers be able to produce enough N2O? If the elevated levels were abiogenic, why don&#39;t those processes continue today?</p>\n</div><!-- SC_ON -->",
  "score": 109,
  "permalink": "/r/askscience/comments/qdku0a/the_extended_warm_period_during_the_boring/",
  "subreddit": "askscience",
  "id": "qdku0a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "During the boring billion global temperatures were about 4 ºC higher than today\ndue to higher concentrations of greenhouse gases. Scientists have ruled out CO2\nas the culprit due to the lack of evidence of ocean acidification. Methane has\nalso been ruled out as it is only biogenic and methanogens…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "億分の1時代の地球の気温は、現在よりも約4℃高かった。\n温室効果ガスの濃度が高かったためです。科学者たちは、CO2\n海洋酸性化の証拠がないため、科学者たちはCO2を原因と断定している。メタンは\nメタンも生物起源のものであり、メタン菌によるものであることから除外されました。",
      "title": "1.8GYAから0.8GYAまでの「退屈な10億年」の間に起こった長期的な温暖化は、大気中のN2Oが現在の10倍になったことが原因であると提案されています。では、その時代のN2Oはどこから来たのだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在无聊的十亿年里，全球气温比今天高约4 ºC\n由于温室气体的浓度较高。科学家们已经排除了二氧化碳\n是罪魁祸首，因为缺乏海洋酸化的证据。甲烷也已\n也被排除了，因为它只是生物源性的，而且是甲烷菌...",
      "title": "在1.8和0.8 Gya之间的 \"无聊的十亿年 \"期间，延长的温暖期被认为是大气中的N2O比现在高10倍的结果。那一时期所有的一氧化二氮是从哪里来的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在無聊的十億年裏，全球氣溫比今天高約4 ºC\n由於溫室氣體的濃度較高。科學家們已經排除了二氧化碳\n是罪魁禍首，因爲缺乏海洋酸化的證據。甲烷也已\n也被排除了，因爲它只是生物源性的，而且是甲烷菌...",
      "title": "在1.8和0.8 Gya之間的 \"無聊的十億年 \"期間，延長的溫暖期被認爲是大氣中的N2O比現在高10倍的結果。那一時期所有的一氧化二氮是從哪裏來的？"
    }
  ]
}