{
  "author": "TheWriterinRed",
  "the_new_excerpt": "I took a single day of PTO as I was traveling back after seeing my girlfriend\nfor the weekend. When my father found out he was like \"dont ever take PTO,\nmanagers hate it.\"\n\nWhen I asked why he never gave me a straight answer, just told me not to do it\nagain.\n\nFlash forward to a couple of days ago, I…",
  "original_created_utc": 1621464302,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "恋人に会った後の旅行で、1日だけPTOを取得しました。\nしました。それを知った父は、「PTOは絶対に取るな。\n経営者はそれを嫌う」と言っていました。\n\n理由を聞いてもはっきりとした答えは返ってきませんでしたが、ただ二度とやるなと\nと言われました。\n\n数日前のことですが、私は...",
      "title": "有給休暇（PTO）の取得は、なぜ職場のタブーなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我请了一天的假，因为我在看完我女朋友的周末后要赶回去。\n周末的时候。当我父亲发现时，他说：\"永远不要拿PTO。\n经理讨厌它。\"\n\n当我问为什么时，他从来没有给我一个直接的答案，只是告诉我不要再这样做了。\n再一次。\n\n转眼到了几天前，我...",
      "title": "为什么带薪休假（PTO）是一个工作场所的禁忌？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我請了一天的假，因爲我在看完我女朋友的週末後要趕回去。\n週末的時候。當我父親發現時，他說：\"永遠不要拿PTO。\n經理討厭它。\"\n\n當我問爲什麼時，他從來沒有給我一個直接的答案，只是告訴我不要再這樣做了。\n再一次。\n\n轉眼到了幾天前，我...",
      "title": "爲什麼帶薪休假（PTO）是一個工作場所的禁忌？"
    }
  ],
  "title": "Why is taking Paid Time Off (PTO) such a work place taboo?",
  "created_utc": 1621482502,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I took a single day of PTO as I was traveling back after seeing my girlfriend for the weekend. When my father found out he was like &quot;dont ever take PTO, managers hate it.&quot;</p>\n\n<p>When I asked why he never gave me a straight answer, just told me not to do it again.</p>\n\n<p>Flash forward to a couple of days ago, I found out that some of my more veteran coworkers were gunning to get me fired cause I took that single day of PTO. I ended up transferring cause I started to notice things now that I knew they had it out for me.</p>\n\n<p>What gives? I earn PTO for each paycheck (set PTO rate that raises with years with the company) so I figured I could use my PTO. I&#39;m scared to use it now cause I don&#39;t want to piss off my new coworkers.</p>\n\n<p>Edit-spelling</p>\n</div><!-- SC_ON -->",
  "score": 118,
  "permalink": "/r/TooAfraidToAsk/comments/ngjjm3/why_is_taking_paid_time_off_pto_such_a_work_place/",
  "subreddit": "TooAfraidToAsk",
  "id": "ngjjm3",
  "is_self": true,
  "media": null,
  "is_video": false
}