{
  "author": "thadiusb",
  "original_created_utc": 1639362767,
  "title": "Finally moved my Bitcoin to a cold wallet. Feels good to get my coins off exchange!",
  "created_utc": 1639387997,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I think the most common phrase on this sub, or any related sub, is “not your keys, not your coin.”&lt;/p&gt;\n\n&lt;p&gt;I can now finally drop that phrase myself lol.&lt;/p&gt;\n\n&lt;p&gt;Took me awhile as I wanted to collect yield. But with ever increasing knowledge of the Bitcoin rabbit-hole, I increasingly become more paranoid of losing my savings to a exchange. &lt;/p&gt;\n\n&lt;p&gt;Anyways, made two $1 transfers to test. Then boom, transferred the rest. Pretty easy. Now to figure out a safe and protective way to store my passphrase and Im done.&lt;/p&gt;\n\n&lt;p&gt;Remember… NOT YOUR KEYS NOT YOUR COIN. Haha.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 154,
  "permalink": "/r/Bitcoin/comments/rf4w9e/finally_moved_my_bitcoin_to_a_cold_wallet_feels/",
  "subreddit": "Bitcoin",
  "id": "rf4w9e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I think the most common phrase on this sub, or any related sub, is “not your\nkeys, not your coin.”\n\nI can now finally drop that phrase myself lol.\n\nTook me awhile as I wanted to collect yield. But with ever increasing knowledge\nof the Bitcoin rabbit-hole, I increasingly become more paranoid of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブ、あるいは関連するサブで最もよく使われるフレーズは、「not your\n\"キー \"と \"コイン\"\n\nこれでやっと自分もそのフレーズを落とせるようになりました(笑)\n\n歩留まりを良くしたいので、しばらく時間がかかりました。でも、知識が増えれば増えるほど\nBitcoinのラビットホールを見て、ますます猜疑心が強くなりました...。",
      "title": "やっとビットコインをコールドウォレットに移しました。取引所からコインを取り除くのは気分がいいですね。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我认为在这个子上，或任何相关的子上，最常见的一句话是 \"不是你的\n钥匙，不是你的钱币\"。\n\n我现在终于可以自己放弃这句话了，笑。\n\n花了我一段时间，因为我想收集产量。但随着对比特币的认识不断加深\n对比特币兔子洞的了解，我越来越偏执地认为...",
      "title": "终于把我的比特币转移到一个冷钱包。把我的币从交易所拿出来的感觉真好!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我認爲在這個子上，或任何相關的子上，最常見的一句話是 \"不是你的\n鑰匙，不是你的錢幣\"。\n\n我現在終於可以自己放棄這句話了，笑。\n\n花了我一段時間，因爲我想收集產量。但隨着對比特幣的認識不斷加深\n對比特幣兔子洞的瞭解，我越來越偏執地認爲...",
      "title": "終於把我的比特幣轉移到一個冷錢包。把我的幣從交易所拿出來的感覺真好!"
    }
  ]
}