{
  "author": "hswilson26",
  "original_created_utc": 1636724431,
  "title": "The strong anti-crypto sentiment of the gaming subreddits is just one example of how early we are.",
  "created_utc": 1636793029,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"/r/gaming\">r/gaming</a>, <a href=\"/r/gamedev\">r/gamedev</a> and other gaming subreddits have recently been sharing and echoing anti-crypto sentiment based around Steam&#39;s banning of NFT games and a recent Kotaku article (if you want to call it that) about game developers not wanting to work on NFT games.</p>\n\n<p>&#x200B;</p>\n\n<p>Being a gamer I frequent those subreddits and it pains me to see all the comments just parroting common misconceptions or base level criticisms of blockchain tech, NFTs, and crypto. Any attempt to clear up misconceptions or pro-crypto comments are downvoted to oblivion making it impossible to have a real conversation or debate.</p>\n\n<p>&#x200B;</p>\n\n<p>If people who play videogames are anti-crypto because it is wasteful from an energy perspective we have a long way to go in terms of acceptance and mass adoption.</p>\n\n<p>&#x200B;</p>\n\n<p>Despite the downvoting brigade we should get out there and make good, coherent points to try and clear up misconceptions and provide the bull case for crypto. Even if they don&#39;t want to hear it. Crypto is going to be an important part of future virtual technology, even in videogames.</p>\n\n<p>&#x200B;</p>\n\n<p>Yes there are scummy NFT games out there, yes there is room for improvement to the energy efficiency of crypto, but no that doesn&#39;t mean all blockchain applications are bad or wasteful.  We should accept criticism, point out how technology will adapt in those areas, and put forth valid use cases for why crypto is valuable to society.</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/qsbe98/the_strong_anticrypto_sentiment_of_the_gaming/",
  "subreddit": "CryptoCurrency",
  "id": "qsbe98",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "r/gaming [/r/gaming], r/gamedev [/r/gamedev] and other gaming subreddits have\nrecently been sharing and echoing anti-crypto sentiment based around Steam's\nbanning of NFT games and a recent Kotaku article (if you want to call it that)\nabout game developers not wanting to work on NFT games.\n\n\n\nBeing a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "r/gaming [/r/gaming]、r/gamedev [/r/gamedev]などのゲーム系サブレディットでは、最近、Steamを中心とした反暗号感情が共有されています。\n最近、SteamがNFTゲームを禁止したことや、Kotakuが最近公開したアート作品に基づいた反暗号感情を共有し、反響を呼んでいます。\nNFTゲームの禁止や、ゲーム開発者がNFTの仕事をしたがらないというKotakuの最近の記事（と言っていいのかな？）\nゲーム開発者がNFTゲームの開発を望まないというKotakuの最近の記事（と言ってもいいかもしれない）に基づいて、反暗号の感情を共有している。\n\n\n\n私は...",
      "title": "ゲーム系のサブレディットに見られる強い反暗号感情は、我々がいかに早い段階にいるかを示す一例です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "r/gaming [/r/gaming]、r/gamedev [/r/gamedev]和其他游戏子版块最近都在分享和呼应反加密技术。\n最近一直在分享和呼应基于Steam的反加密货币情绪。\n禁止NFT游戏，以及最近Kotaku的一篇文章（如果你想这么称呼它的话）\n关于游戏开发者不愿意为NFT游戏工作的文章（如果你想这么说的话）。\n\n\n\n作为一个...",
      "title": "游戏子版块强烈的反加密货币情绪只是一个例子，说明我们还很早。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "r/gaming [/r/gaming]、r/gamedev [/r/gamedev]和其他遊戲子版塊最近都在分享和呼應反加密技術。\n最近一直在分享和呼應基於Steam的反加密貨幣情緒。\n禁止NFT遊戲，以及最近Kotaku的一篇文章（如果你想這麼稱呼它的話）\n關於遊戲開發者不願意爲NFT遊戲工作的文章（如果你想這麼說的話）。\n\n\n\n作爲一個...",
      "title": "遊戲子版塊強烈的反加密貨幣情緒只是一個例子，說明我們還很早。"
    }
  ]
}