{
  "author": "FancyTarsier0",
  "the_new_excerpt": "Hello reddit. I just wanted to thank you for the moons i recieved this month. I\nlive in egypt and the monthly wages are as low as 0.01 dollar an hour.\n\nBecause of covid there is no tourists which has made many small businesses go\nbroke including mine as a shopping guide. Gone are the days when i…",
  "original_created_utc": 1619345775,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは、reddit。今月届いたムーンにお礼を言いたいと思います。I\n私はエジプトに住んでいますが、月の給料は時給0.01ドルと低いです。\n\ncovidのせいで観光客がいなくなり、多くの中小企業が倒産してしまいました。\n私がやっているショッピングガイドも含めて、多くの中小企業が倒産しています。これまでのように、私が...",
      "title": "暗号が私にラクダを買ってくれた"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好reddit。我只是想感谢你这个月给我带来的月亮。I\n住在埃及，每月的工资低至每小时0.01美元。\n\n由于贪污腐败，没有游客，这使得许多小企业破产。\n包括我的购物指南。昔日我的工作是由我的家人来完成的。",
      "title": "Crypto给我买了一只骆驼"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好reddit。我只是想感謝你這個月給我帶來的月亮。I\n住在埃及，每月的工資低至每小時0.01美元。\n\n由於貪污腐敗，沒有遊客，這使得許多小企業破產。\n包括我的購物指南。昔日我的工作是由我的家人來完成的。",
      "title": "Crypto給我買了一隻駱駝"
    }
  ],
  "title": "Crypto bought me a camel",
  "created_utc": 1619355165,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello reddit. I just wanted to thank you for the moons i recieved this month. I live in egypt and the monthly wages are as low as 0.01 dollar an hour.</p>\n\n<p>Because of covid there is no tourists which has made many small businesses go broke including mine as a shopping guide. Gone are the days when i used to bring people into my grandfathers shop and make them buy quality items. However with the moons i have now i will be able to buy my first camel.</p>\n\n<p>Camels are very important in my culture for many purposes. I will use mine to get myself a wife once tourism starts coming back. </p>\n\n<p>Thank you and god bless.</p>\n</div><!-- SC_ON -->",
  "score": 638,
  "permalink": "/r/CryptoCurrency/comments/my5f6m/crypto_bought_me_a_camel/",
  "subreddit": "CryptoCurrency",
  "id": "my5f6m",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776210448
}