{
  "author": "BooOnClay",
  "the_new_excerpt": "Generally speaking, I am looking at uranium as a macro investment based on the\nsupply and demand dynamics of the market. At a high level, uranium needs to be\nin the $50+ (some say $60+) range in order to cover the cost of production.\nRight now the spot price is hovering around $30.\n\nThat being said,…",
  "original_created_utc": 1616039606,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "一般来说，我把铀作为一种宏观投资，是根据\n市场的供求动态。在高层次上，铀需\n在50多美元（有人说60多美元）的范围内，以支付生产成本。\n现在现货价格在30元左右徘徊。\n\n也就是说，...",
      "title": "铀的现状。现货价格可能很快就会出现变动"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "一般來說，我把鈾作爲一種宏觀投資，是根據\n市場的供求動態。在高層次上，鈾需\n在50多美元（有人說60多美元）的範圍內，以支付生產成本。\n現在現貨價格在30元左右徘徊。\n\n也就是說，...",
      "title": "鈾的現狀。現貨價格可能很快就會出現變動"
    }
  ],
  "title": "The Current State of Uranium. A Move In Spot Price Could Be Soon",
  "created_utc": 1616087926,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Generally speaking, I am looking at uranium as a macro investment based on the supply and demand dynamics of the market. At a high level, uranium needs to be in the $50+ (some say $60+) range in order to cover the cost of production. Right now the spot price is hovering around $30.   </p>\n\n<p>That being said, uranium is outperforming. So what then is driving this run? Are we likely to see a move in spot soon?</p>\n\n<p>Personally, I think that the equities are ahead of themselves a little bit and that we could be seeing a pull back soon. I hope not. Still, the spot price is a little bit of a question mark for me because I have seen a number of interviews saying that we are very close for a move in the uranium price. This has led me to the view that I should hold my positions and slowly build until the spot price starts to move.  It’s a risk, but my hypothesis is that the real move will far outpace where we are today.  </p>\n\n<p>Ultimately, uranium is about climate change more than anything and so I am glad we are ahead of schedule. Nuclear is the only way to achieve the carbon goals. </p>\n\n<p>I will be watching closely in the next few weeks for any movement in the uranium price. Should the spot rise as many of us expect, uranium stock prices will soar.</p>\n\n<p>As always. I am interested in how others perceive the current landscape. Any and all feedback is appreciated.</p>\n</div><!-- SC_ON -->",
  "score": 79,
  "permalink": "/r/investing/comments/m7ih59/the_current_state_of_uranium_a_move_in_spot_price/",
  "subreddit": "investing",
  "id": "m7ih59",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752818322
}