{
  "author": "Rexile",
  "the_new_excerpt": "In the past few months we had a lot of signals to sell: BTC dropping 41k > 30k\nin a matter of weeks, ETH going sub 1k, XLM dropping because of XRP lawsuit,\nthen it shot up because of Ukraine, now it pumped again this bullrun, and now\neverything's in red today. After each massive dip the coin price…",
  "original_created_utc": 1613377115,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在过去的几个月里，我们有很多卖出的信号。BTC跌了4.1万 > 3万\n在几周内，ETH要低于1k，XLM因为XRP诉讼而下跌。\n然后，它飙升，因为乌克兰，现在它再次泵这个牛市运行，而现在\n今天所有的东西都是红色的。每一次大跌之后，币价...",
      "title": "如果你是长期在这里，千万不要卖，只买入"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在過去的幾個月裏，我們有很多賣出的信號。BTC跌了4.1萬 > 3萬\n在幾周內，ETH要低於1k，XLM因爲XRP訴訟而下跌。\n然後，它飆升，因爲烏克蘭，現在它再次泵這個牛市運行，而現在\n今天所有的東西都是紅色的。每一次大跌之後，幣價...",
      "title": "如果你是長期在這裏，千萬不要賣，只買入"
    }
  ],
  "title": "If you're in here for the long term, never sell, only buy",
  "created_utc": 1613403692,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In the past few months we had a lot of signals to sell: BTC dropping 41k &gt; 30k in a matter of weeks, ETH going sub 1k, XLM dropping because of XRP lawsuit, then it shot up because of Ukraine, now it pumped again this bullrun, and now everything&#39;s in red today. After each massive dip the coin price increased further than the past normal, those who HODLed were rewarded massively. All of these dips were only there to shake out the weak hands and people full of doubt. Not only that but if you sell your coins you will get obliterated by taxes, it&#39;s double the loss.</p>\n\n<p>And once again we&#39;re seeing an usual weekend dip and many people (newbies mostly) asking &quot;what&#39;s happening?&quot;, wondering if they&#39;ve lost their money.</p>\n\n<p>Don&#39;t fear the dip, enjoy the dip.</p>\n\n<p>With the increasing institution and media interest, and many people getting into the crypto it&#39;s near impossible that crypto will fall back. Even say, we enter the bear market again, it will only be a short span of accumulation phase where you get coins at an discounted rate before we get another bullrun and profit from it. Dip is best what can happen to you, it&#39;s an opportunity to accumulate more of your coin, if it only went up you wouldn&#39;t get such good deals.</p>\n\n<p>And my most important argument is that soon we&#39;ll enter the internet coin age, and now&#39;s the best time to get as many of them as you can. You&#39;ll be the early adopter and you&#39;ll do waaay better than people who get caught with hands in their pants with their useless FIAT. If you sell the dips you will have less currency to use later!</p>\n\n<p>Never sell, only buy.</p>\n</div><!-- SC_ON -->",
  "score": 268,
  "permalink": "/r/CryptoCurrency/comments/lk97c2/if_youre_in_here_for_the_long_term_never_sell/",
  "subreddit": "CryptoCurrency",
  "id": "lk97c2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728617848
}