{
  "author": "xSpatulax",
  "original_created_utc": 1651174634,
  "title": "How do I tell my roommate to make sure all his cum goes down the shower drain after he showers?",
  "created_utc": 1651218627,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Long story short, my roommate will jerk off in the shower (who doesn’t). He moved in about 3 months ago.&lt;/p&gt;\n\n&lt;p&gt;About a month ago i took a shower and while i was washing my foot, i saw the stringy cum stuck to it. I shit you not i literally almost vomited in the shower. I let it go because i thought maybe it was a one off situation and also how do i mention that to someone.&lt;/p&gt;\n\n&lt;p&gt;Yesterday it happened again. Same exact scenario, start washing my feet and i saw the cum sticking, slightly dangling off the side of my foot. Again this was absolutely revolting i can’t emphasis this enough.&lt;/p&gt;\n\n&lt;p&gt;I don’t want to have to check and clean the shower EVERY TIME i need to take a shower. How do i ask him, in the least uncomfortable way, to make sure all of his cum is gone before he gets out?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/ue398a/how_do_i_tell_my_roommate_to_make_sure_all_his/",
  "subreddit": "TooAfraidToAsk",
  "id": "ue398a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "Long story short, my roommate will jerk off in the shower (who doesn’t). He\nmoved in about 3 months ago.\n\nAbout a month ago i took a shower and while i was washing my foot, i saw the\nstringy cum stuck to it. I shit you not i literally almost vomited in the\nshower. I let it go because i thought…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "長い話をすると、私のルームメイトはシャワーで自慰行為をします（しない人はいません）。彼は\n3ヶ月ほど前に引っ越してきました。\n\nヶ月前にシャワーを浴びて、足を洗っていたら、ザーメンがこびりついてるのが見えた。\nザーメンがこびりついていた。私は文字通り、シャワーの中で吐きそうになりました。\n吐いてしまいそうになった。でもそのままに...",
      "title": "ルームメイトがシャワーを浴びた後、彼の精液がすべてシャワーの排水口に流れるようにするには、どうしたらいいですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "长话短说，我的室友会在洗澡时打飞机（谁不打呢）。他\n大约3个月前搬来的。\n\n大约一个月前，我洗了个澡，当我在洗脚时，我看到了粘在脚上的\n粘稠的精液粘在上面。我真不敢相信，我真的差点在浴室里呕吐出来。\n洗澡。我让它过去，因为我想...",
      "title": "我如何告诉我的室友，确保他洗澡后所有的精液都流进淋浴的下水道？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "長話短說，我的室友會在洗澡時打飛機（誰不打呢）。他\n大約3個月前搬來的。\n\n大約一個月前，我洗了個澡，當我在洗腳時，我看到了粘在腳上的\n粘稠的精液粘在上面。我真不敢相信，我真的差點在浴室裏嘔吐出來。\n洗澡。我讓它過去，因爲我想...",
      "title": "我如何告訴我的室友，確保他洗澡後所有的精液都流進淋浴的下水道？"
    }
  ]
}