{
  "author": "Argentino_Feliz",
  "the_new_excerpt": "Im from Argentina. My country's goverment strongly believes in controling\nprices, limit what a person can do with their money, corruption and taxes to fix\neverything. (We have 60% aprox of public spending in comparision with private\nspending, you can see our country's economy will not recover. Not…",
  "original_created_utc": 1613661344,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我来自阿根廷。我的国家的政府坚信控制\n物价，限制一个人用自己的钱、腐败和税收来解决的问题。\n一切。(我们的公共开支与私人开支相比，大约占60%。)\n支出，你可以看到我们国家的经济不会恢复。不...",
      "title": "如果你的政府想控制加密技术，请按照这个小指南来做。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我來自阿根廷。我的國家的政府堅信控制\n物價，限制一個人用自己的錢、腐敗和稅收來解決的問題。\n一切。(我們的公共開支與私人開支相比，大約佔60%。)\n支出，你可以看到我們國家的經濟不會恢復。不...",
      "title": "如果你的政府想控制加密技術，請按照這個小指南來做。"
    }
  ],
  "title": "If your goverment wants to control crypto, follow this small guide",
  "created_utc": 1613688690,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Im from Argentina. My country&#39;s goverment strongly believes in controling prices, limit what a person can do with their money, corruption and taxes to fix everything. (We have 60% aprox of public spending in comparision with private spending, you can see our country&#39;s economy will not recover. Not even the fundamentals are done properly). To put you more in context, we have the argentinian peso, its a dead currency, they print like crazy and we have 40% ish of inflation rate per year. What would a blindfolded monkey do? Well, it will invest in other currency much more stable, and its the american dollar, most cars and most houses are sold in dollars in Argentina, which means people evade the argentinian peso and invest on the usd. What does the goverment do instead of promoting our currency? they limit to 200usd per MONTH as a maximun in how much you can invest. We are condemn on a currency like argentinian peso that only goes down.</p>\n\n<p>Solution? Cryptocurrency. Our goverment has been trying to control crypto and find ways to tax it. They cant. Not only most people here dont even know what cryptocurrency is, less alone tax it. But that wont stop them from trying. Most tax regulators, AFIP, called in Argentina, know everything about their population. Your bank account, how much you spend on ice cream, how much energy you consume in your house, whatever is needed only to take money from you. Free market doesnt exist here. Whatever you buy from a fork to a car, has 60% taxes on it. And many countries in South America, Africa, Asia, Eastern Europe, try to do the same. Crypto is the future because it means FREEDOM, it takes away the bonds of autocratic goverments on their population. BUT, big BUT, you need to follow some guidelines in order to not be caught. You cant just find your local exchange and buy crypto, or use your credit card to buy crypto, that is too obvious, and in many countries like India and China, can save your life!</p>\n\n<p>There it comes the P2P system.</p>\n\n<p><a href=\"https://www.youtube.com/watch?v=ie-qRQIQT4I&amp;ab_channel=Lisk\">https://www.youtube.com/watch?v=ie-qRQIQT4I&amp;ab_channel=Lisk</a> (video explaining the system) </p>\n\n<p>Its impossible to ban crypto with the P2P system. There&#39;s no way to track it. Argentina has been trying for years to tax Crypto (whatever doesnt work here, taxes are applied, and when it goes even worse, its fault of the previous goverment).</p>\n\n<p>Things i use in Argentina, perhaps it helps you too if you have the same problem:</p>\n\n<p>Use VPN&#39;s to hide your ip and use exchanges outside your country (Binance, or others)</p>\n\n<p>Apply the same thing to wallets. Try not to use wallets that can be tracked to you (if your goverment really goes hard con crypto), dont buy hardware wallets in your country, proably tax regulators know all you do already. Use software wallets with their server in other countries like exodus.</p>\n\n<p>Only use P2P system to deposit and withdraw money. For the bank you are only sending money to another person in the same country, then the bank sends the info to the tax regulators/goverment, its just a common transaction.</p>\n\n<p>If you want to really ban crypto, you have to ban the internet.</p>\n\n<p>&#x200B;</p>\n\n<p>TDLR: Use p2p if you live in a shitty country like me.</p>\n</div><!-- SC_ON -->",
  "score": 233,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/jLoKMaW6Cn2-w3hMZHmyKDDsfKeLxLeq77srkW7yEeE.jpg?auto=webp&s=526d6de322c93b1d621766856bcea7cea9736b5f",
          "width": 480,
          "height": 360
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/jLoKMaW6Cn2-w3hMZHmyKDDsfKeLxLeq77srkW7yEeE.jpg?width=108&crop=smart&auto=webp&s=249d1fed6da9a0d928d6850338c91c293f4d2f93",
            "width": 108,
            "height": 81
          },
          {
            "url": "https://external-preview.redd.it/jLoKMaW6Cn2-w3hMZHmyKDDsfKeLxLeq77srkW7yEeE.jpg?width=216&crop=smart&auto=webp&s=4ac454035c889f3d91542b98105fb90e699ac637",
            "width": 216,
            "height": 162
          },
          {
            "url": "https://external-preview.redd.it/jLoKMaW6Cn2-w3hMZHmyKDDsfKeLxLeq77srkW7yEeE.jpg?width=320&crop=smart&auto=webp&s=47f792d9e1ff89aabec796132a3f96599f2c7b1f",
            "width": 320,
            "height": 240
          }
        ],
        "variants": {},
        "id": "dHEkSfKBn9uIAD_t-LuHQoKh4gVfA1hgPYFSPC75UlY"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/lmoz0q/if_your_goverment_wants_to_control_crypto_follow/",
  "subreddit": "CryptoCurrency",
  "id": "lmoz0q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332875930
}