{
  "author": "manbare",
  "original_created_utc": 1635431035,
  "title": "How do historians working in one language account for work in their subfield written in another language? Is it common for historians to disagree with one another without even knowing on account of language barriers?",
  "created_utc": 1635490309,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Even though English is the de facto academic lingua franca in the West, I&#39;m sure there is still ample amounts of history written in other Western languages, let alone nonwestern ones. The vast majority of this history goes untranslated, whether its in Italian, Arabic, or Mandarin, and is therefore inaccessible for most historians who do not speak those languages. Do historians who only speak one language go out of their way to examine historiographical developments?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/qho6wz/how_do_historians_working_in_one_language_account/",
  "subreddit": "AskHistorians",
  "id": "qho6wz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Even though English is the de facto academic lingua franca in the West, I'm sure\nthere is still ample amounts of history written in other Western languages, let\nalone nonwestern ones. The vast majority of this history goes untranslated,\nwhether its in Italian, Arabic, or Mandarin, and is therefore…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "欧米では英語が学術的な共通語になっていますが、彼の言葉はまだまだたくさんあると思います。\n西洋以外の言語で書かれた歴史も十分にあります。\n西洋以外の言語で書かれた歴史も、まだまだたくさんあるはずです。しかし、その大半は翻訳されていません。\nイタリア語であれ、アラビア語であれ、中国語であれ、翻訳されずに残っています。",
      "title": "ある言語で仕事をしている歴史家は、別の言語で書かれた自分のサブフィールドの仕事をどのように説明するのでしょうか？言語の壁のために、歴史家同士が知らず知らずのうちに意見を異にすることはよくあることなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "尽管英语是西方事实上的学术通用语言，我相信\n仍然有大量的历史是用其他西方语言写成的，更不用说非西方语言了。\n更不用说非西方语言了。这些历史中的绝大多数都没有被翻译出来。\n无论是意大利语、阿拉伯语还是普通话，因此......",
      "title": "用一种语言工作的历史学家如何解释用另一种语言撰写的其子领域的工作？由于语言障碍，历史学家们在不知情的情况下彼此产生分歧，这是否很常见？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "儘管英語是西方事實上的學術通用語言，我相信\n仍然有大量的歷史是用其他西方語言寫成的，更不用說非西方語言了。\n更不用說非西方語言了。這些歷史中的絕大多數都沒有被翻譯出來。\n無論是意大利語、阿拉伯語還是普通話，因此......",
      "title": "用一種語言工作的歷史學家如何解釋用另一種語言撰寫的其子領域的工作？由於語言障礙，歷史學家們在不知情的情況下彼此產生分歧，這是否很常見？"
    }
  ]
}