{
  "author": "Dramatological",
  "the_new_excerpt": "I've recently seen a Youtube video which states that Carroll was sexually\nabusing Alice as if it were a matter of settled fact. I went looking for some\nconfirmation, and found a piece by the Smithsonian, written in 2010. It\nconcludes:\n\nHis image as a man of suspect sexuality “says more about our…",
  "original_created_utc": 1611893671,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我最近在Youtube上看到一个视频，里面说卡罗尔被性。\n虐待爱丽丝，好像这是一个既定的事实。我去寻找一些\n证实，并找到了史密森尼的一篇文章，写于2010年。它\n结论是：\"他作为一个可疑的性行为者的形象..:\n\n他作为一个可疑的性行为者的形象 \"说明了更多关于我们...",
      "title": "刘易斯-卡罗尔是否对爱丽丝进行了性虐待？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近在Youtube上看到一個視頻，裏面說卡羅爾被性。\n虐待愛麗絲，好像這是一個既定的事實。我去尋找一些\n證實，並找到了史密森尼的一篇文章，寫於2010年。它\n結論是：\"他作爲一個可疑的性行爲者的形象..:\n\n他作爲一個可疑的性行爲者的形象 \"說明了更多關於我們...",
      "title": "劉易斯-卡羅爾是否對愛麗絲進行了性虐待？"
    }
  ],
  "title": "Was Lewis Carroll sexually abusing Alice?",
  "created_utc": 1611920846,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve recently seen a Youtube video which states that Carroll was sexually abusing Alice as if it were a matter of settled fact.  I went looking for some confirmation, and found a piece by the Smithsonian, written in 2010.  It concludes:</p>\n\n<p><em>His image as a man of suspect sexuality “says more about our society and its hang-ups than it does about Dodgson himself,” Will Brooker says. We see him through the prism of contemporary culture—one that sexualizes youth, especially female youth, even as it is repulsed by pedophilia. The nature of his relationships with Alice, with other girls and with women may never be established with certainty. But then, uncertainty is a consistent theme in the Alice books.</em></p>\n\n<p>It&#39;s been 10 years, have historians settled somewhere?</p>\n</div><!-- SC_ON -->",
  "score": 109,
  "permalink": "/r/AskHistorians/comments/l7ivl2/was_lewis_carroll_sexually_abusing_alice/",
  "subreddit": "AskHistorians",
  "id": "l7ivl2",
  "is_self": true,
  "media": null,
  "is_video": false
}