{
  "author": "Set1Less",
  "original_created_utc": 1655637450,
  "title": "Solend, the largest lending market on Solana is about to have a crippling liquidation of $170m SOL that could crash the network. To prevent this, the decentralized protocol is proposing to seize the user's funds via governance",
  "created_utc": 1655643512,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;There is a large liquidation watch on Solana&amp;#39;s Solend protocol, where a whale has  deposited 5.7M SOL  ($170M and borrowed 108M USDC and USDT borrowed. This alone accounts for a huge % of borrowing on Solana, and now this position is under a liquidation threat. &lt;/p&gt;\n\n&lt;p&gt;The whale is not closing their position. In most protocols like Compound, or AAVE, Maker etc, this will result in an onchain liquidation. Infact we have seen many such large liquidations on AAVE And Maker recently, and everything has worked as expected. &lt;/p&gt;\n\n&lt;p&gt;However such a large liquidation in an illiquid market and unstable network like Solana is likely to have vastly damaging consequences. Solana network has already gone down and halted half a dozen time. &lt;/p&gt;\n\n&lt;p&gt;The Solend team explains what could happen to the network:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;This  could cause chaos, putting a strain on the Solana network. Liquidators  would be especially active and spamming the liquidate function, which  has been known to be a factor causing Solana to go down in the past.  &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Letting a liquidation of this size to happen on-chain is extremely risky.&lt;/strong&gt;  DEX liquidity isn’t deep enough to handle a sale of this size and could  cause cascading effects. Additionally, liquidators will be incentivized  to spam the network in an effort to win very lucrative liquidations.  This has been known to cause load issues for Solana in the past which  would exacerbate the problems at hand.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;So to prevent this, they are proposing to literally steal the user&amp;#39;s funds and execute OTC trades:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Grant  emergency power to Solend Labs to temporarily take over the whale’s  account so the liquidation can be executed OTC and avoid pushing Solana  to its limits. This would be done via a smart contract upgrade.  Emergency powers will be revoked once the whale’s account reaches a safe  level.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;When shit starts to implode, all the true colors of decentralization comes out. &lt;/p&gt;\n\n&lt;p&gt;These shitty protocol are run by fly by night cowboys who learnt basics of economics during the bull run. They put their users are risk by running terrible protocols that do not think about all the edge cases...because who cares about risks right?! &lt;/p&gt;\n\n&lt;p&gt;And during signs of distress, they resolve to seize user funds.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 412,
  "permalink": "/r/CryptoCurrency/comments/vfszpt/solend_the_largest_lending_market_on_solana_is/",
  "subreddit": "CryptoCurrency",
  "id": "vfszpt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "There is a large liquidation watch on Solana's Solend protocol, where a whale\nhas deposited 5.7M SOL ($170M and borrowed 108M USDC and USDT borrowed. This\nalone accounts for a huge % of borrowing on Solana, and now this position is\nunder a liquidation threat.\n\nThe whale is not closing their…"
}