{
  "author": "BookLover54321",
  "original_created_utc": 1660449501,
  "title": "How true is David Graeber and David Wengrow's claim that, given the choice between living in colonial societies or Indigenous ones, people \"almost invariably\" chose the latter?",
  "created_utc": 1660484335,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In their book &lt;em&gt;The Dawn of Everything&lt;/em&gt;, David Graeber and David Wengrow write the following:&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;The colonial history of North and South America is full of accounts of settlers, captured or adopted by indigenous societies, being given the choice of where they wished to stay and almost invariably choosing to stay with the latter.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;To support this, they cite a 1977 study by Joseph Norman Heard titled &lt;em&gt;The Assimilation of Captives on the American Frontier in the Eighteenth and Nineteenth Centuries&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;Some historians have contested this and Wengrow has defended the claim. I was wondering what AskHistorians thinks of this ?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/AskHistorians/comments/wnwvlb/how_true_is_david_graeber_and_david_wengrows/",
  "subreddit": "AskHistorians",
  "id": "wnwvlb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In their book The Dawn of Everything, David Graeber and David Wengrow write the\nfollowing:\n\n\"The colonial history of North and South America is full of accounts of\nsettlers, captured or adopted by indigenous societies, being given the choice of\nwhere they wished to stay and almost invariably…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "デイヴィッド・グレーバーとデイヴィッド・ウェングローは、その著書『The Dawn of Everything』の中で、次のように書いています。\n次のように書いている。\n\n「北米と南米の植民地時代の歴史は、捕虜になった、あるいは捕虜にされた入植者たちが\n北南米の植民地史は、先住民に捕らえられ、あるいは養子に出された入植者たちが、どこに滞在するかという選択肢を与えられたという記述で満ちている。\n北南米の植民地史は、先住民社会に捕らえられ、あるいは養子に出された入植者が、どこに滞在するかという選択肢を与えられたという記述に満ちており、ほとんど常に",
      "title": "植民地社会と先住民社会のどちらを生きるかを選択した場合、人々は「ほとんど必ず」後者を選ぶというデヴィッド・グレーバーとデヴィッド・ウェングローの主張は、どの程度正しいのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大卫-格雷伯和大卫-温格罗在他们的书《万物的黎明》中写道\n以下内容。\n\n\"南北美洲的殖民历史中充满了这样的描述\n南北美洲的殖民历史充满了这样的描述：定居者被土著社会俘虏或收养后，可以选择他们想呆的地方。\n他们希望留在哪里，几乎无一例外......",
      "title": "David Graeber和David Wengrow声称，在选择生活在殖民社会还是土著社会时，人们 \"几乎无一例外地 \"选择了后者，这种说法的真实性如何？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大衛-格雷伯和大衛-溫格羅在他們的書《萬物的黎明》中寫道\n以下內容。\n\n\"南北美洲的殖民歷史中充滿了這樣的描述\n南北美洲的殖民歷史充滿了這樣的描述：定居者被土著社會俘虜或收養後，可以選擇他們想呆的地方。\n他們希望留在哪裏，幾乎無一例外......",
      "title": "David Graeber和David Wengrow聲稱，在選擇生活在殖民社會還是土著社會時，人們 \"幾乎無一例外地 \"選擇了後者，這種說法的真實性如何？"
    }
  ]
}