{
  "author": "Set1Less",
  "original_created_utc": 1641278639,
  "title": "Solana went down again on 4th Jan morning (UTC +8) , and was fixed early morning. Now it is back up, but shows how vulnerable this system is. A system that goes down is a death knell for serious traders",
  "created_utc": 1641292697,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Another year.. and another episode of Solana going down.&lt;/p&gt;\n\n&lt;p&gt;Today it went down for a few hours in the early morning Asia time, and it took almost 4 hours to bring it back up.&lt;/p&gt;\n\n&lt;p&gt;The Solana community blames it on a DDOS attack. Lol&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/5xnds1jz9m981.jpg?width=1292&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=98c0a705d5bb19abebf46aeabed847a9d26c206a\"&gt;Solana down. &lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;As the meme goes, the D in Solana stands for decentralisation.&lt;/p&gt;\n\n&lt;p&gt;A network that goes down this often will never be able to attract serious traders.&lt;/p&gt;\n\n&lt;p&gt;Imagine you are trading on margin and get liquidated because the network was down.. this happens in centralised exchanges. Solana now natively brings this kind of user experience to the blockchain where you can experience network failure on the chain. What a wonderful innovation.&lt;/p&gt;\n\n&lt;p&gt;Blaming it on attackers is just dishonesty. A well designed blockchain is not supposed to have attackers, its supposed to keep producing blocks based on the parameters of the network, not take a break because someone spammed transactions. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 618,
  "permalink": "/r/CryptoCurrency/comments/rvnzp3/solana_went_down_again_on_4th_jan_morning_utc_8/",
  "subreddit": "CryptoCurrency",
  "id": "rvnzp3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Another year.. and another episode of Solana going down.\n\nToday it went down for a few hours in the early morning Asia time, and it took\nalmost 4 hours to bring it back up.\n\nThe Solana community blames it on a DDOS attack. Lol\n\nSolana…"
}