{
  "author": "HorrorProof9920",
  "the_new_excerpt": "Would any of you be interested in weekly updates starting next week? I plan on\nbuying calls for some health care stocks which is the only sector I believe\nhasn’t had an absurd run up. If I can’t find contracts for the desired 100 limit\nI will increase it to 150 and at maximum 200 If you have any…",
  "original_created_utc": 1621493385,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "来週から毎週更新することに興味のある方はいらっしゃいますか？私は次のことを計画しています。\nヘルスケア株のコールを買おうと思っていますが、これは私が信じている唯一のセクターです。\n不条理な上昇をしていないと思われる唯一のセクターです。もし希望する100枚のリミットで契約が見つからなければ\n150、最大で200まで増やすつもりです。",
      "title": "オプションだけで100ドルから1万ドルのチャレンジをしようと考えており、毎週更新する予定です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你们中有人对下周开始的每周更新感兴趣吗？我打算\n买入一些保健品股票的看涨期权，这是我认为唯一的部门\n还没有出现荒谬的上涨。如果我找不到所需的100个限额的合同\n我将把它增加到150，最多200 如果你有任何...",
      "title": "我正在考虑做一个只使用期权的100美元到10,000美元的挑战，并将每周更新。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你們中有人對下週開始的每週更新感興趣嗎？我打算\n買入一些保健品股票的看漲期權，這是我認爲唯一的部門\n還沒有出現荒謬的上漲。如果我找不到所需的100個限額的合同\n我將把它增加到150，最多200 如果你有任何...",
      "title": "我正在考慮做一個只使用期權的100美元到10,000美元的挑戰，並將每週更新。"
    }
  ],
  "title": "I am considering doing a $100 to $10,000 challenge using options only and will update weekly.",
  "created_utc": 1621514596,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Would any of you be interested in weekly updates starting next week?\nI plan on buying calls for some health care stocks which is the only sector I believe hasn’t had an absurd run up. If I can’t find contracts for the desired 100 limit I will increase it to 150 and at maximum 200\nIf you have any suggestions for tickers I should buy contracts for place it in the comments. </p>\n\n<p>Any feedback is appreciated</p>\n</div><!-- SC_ON -->",
  "score": 514,
  "permalink": "/r/stocks/comments/ngt4js/i_am_considering_doing_a_100_to_10000_challenge/",
  "subreddit": "stocks",
  "id": "ngt4js",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197388318
}