{
  "author": "OneSeparate9226",
  "original_created_utc": 1652263442,
  "title": "Why are you allowed to mention the illegal things you do in court?",
  "created_utc": 1652287219,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’ve always wondered this but now that the Johnny Depp and Amber Heard case has become popular it arose the question again. Why are they allowed to say things like the jar of cocaine Johnny had or that they did MDMA together on an airplane without getting in trouble for it? I don’t know/think it’s just because they’re celebrities either, but if they’re in a court of law can’t they get in trouble for the things they mention and get in legal trouble or go to jail?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 115,
  "permalink": "/r/NoStupidQuestions/comments/un6e9q/why_are_you_allowed_to_mention_the_illegal_things/",
  "subreddit": "NoStupidQuestions",
  "id": "un6e9q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’ve always wondered this but now that the Johnny Depp and Amber Heard case has\nbecome popular it arose the question again. Why are they allowed to say things\nlike the jar of cocaine Johnny had or that they did MDMA together on an airplane\nwithout getting in trouble for it? I don’t know/think it’s…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ずっと不思議に思っていたのですが、ジョニー・デップとアンバー・ハードの件があり\nという疑問が湧いてきた。なぜ、ジョニーが持っていたコカインの瓶や、飛行機で一緒にMDMAをやったというようなことを\nジョニーが持っていたコカインの瓶や、飛行機の中で一緒にMDMAをやったというようなことを\nなぜ許されるのだろう？わからない／思うに...。",
      "title": "なぜ、裁判で違法行為に言及することが許されるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直想知道这个问题，但现在约翰尼-德普和安柏-赫德的案子已经\n变得流行，它再次引起了这个问题。为什么他们可以说一些事情\n他们可以说约翰尼有一罐可卡因，或者他们在飞机上一起吸食摇头丸。\n而不会因此惹上麻烦？我不知道/认为这是...",
      "title": "为什么允许你在法庭上提及你所做的非法事情？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直想知道這個問題，但現在約翰尼-德普和安柏-赫德的案子已經\n變得流行，它再次引起了這個問題。爲什麼他們可以說一些事情\n他們可以說約翰尼有一罐可卡因，或者他們在飛機上一起吸食搖頭丸。\n而不會因此惹上麻煩？我不知道/認爲這是...",
      "title": "爲什麼允許你在法庭上提及你所做的非法事情？"
    }
  ]
}