{
  "author": "PeculiarPangolinMan",
  "original_created_utc": 1639491669,
  "title": "Was Leonardo da Vinci really the strongest man in Florence? Is his training regimen documented?",
  "created_utc": 1639528501,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve read a few references to Leonardo da Vinci&amp;#39;s great strength and physical abilities and was wondering if there were any records or history of what sort of workouts he would do. How impressive was bending a horse shoe or door knocker in his hand? What did Vasari mean when he said Leonardo was &amp;quot;physically so strong that he could withstand violence&amp;quot;?* Did Leonardo get into a lot of fist fights? &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d love to learn more about *Leonardo&amp;#39;s athletic feats but haven&amp;#39;t had much luck outside of a few quotes, so I thought this sub was a good place to try! Thanks for any thoughts!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/rg8idk/was_leonardo_da_vinci_really_the_strongest_man_in/",
  "subreddit": "AskHistorians",
  "id": "rg8idk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've read a few references to Leonardo da Vinci's great strength and physical\nabilities and was wondering if there were any records or history of what sort of\nworkouts he would do. How impressive was bending a horse shoe or door knocker in\nhis hand? What did Vasari mean when he said Leonardo was…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "レオナルド・ダ・ヴィンチの強靭な肉体について、いくつかの文献を読んだことがあります。\nどのような記録や歴史があるのでしょうか？\nをするのでしょう。馬の蹄鉄やドアノッカーなどを曲げるのはすごいことだと思います。\nを手にした。ヴァザーリが言った「レオナルドは...」とはどういう意味なのでしょうか？",
      "title": "レオナルド・ダ・ヴィンチは、本当にフィレンツェで一番強い男だったのか？彼のトレーニング方法は記録されているのだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我读过一些关于达芬奇的强大力量和体能的资料。\n我想知道是否有任何记录或历史，说明他做了什么样的锻炼。\n锻炼。弯曲马蹄铁或敲门砖在他手中的印象有多深？\n他的手有多厉害？瓦萨里说莱昂纳多是什么意思...",
      "title": "达芬奇真的是佛罗伦萨最强壮的人吗？他的训练方法有记载吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我讀過一些關於達芬奇的強大力量和體能的資料。\n我想知道是否有任何記錄或歷史，說明他做了什麼樣的鍛鍊。\n鍛鍊。彎曲馬蹄鐵或敲門磚在他手中的印象有多深？\n他的手有多厲害？瓦薩里說萊昂納多是什麼意思...",
      "title": "達芬奇真的是佛羅倫薩最強壯的人嗎？他的訓練方法有記載嗎？"
    }
  ]
}