{
  "author": "Appropriate-Form2412",
  "original_created_utc": 1629912496,
  "title": "Just a random Funfact for you Guys",
  "created_utc": 1629923975,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Did you know, that the state of Bulgaria is the second largest Bitcoin-Holder in the world?\nWell, it&#39;s true....</p>\n\n<p>The Bulgarian Government has stated that it owns some 213.519 Bitcoins, valued at approximately 18% of it&#39;s  national debt, if accessed and converted.</p>\n\n<p>The Bulgarian Government came into possession of the significant treasure after Bulgarian law enforcement authorities seized  the Bitcoins during an operation related to identifying cyber-crimes commited by an international group of hackers.</p>\n\n<p>The current value is around $10.3 billion at the moment, which is the biggest wallet after Satoshi Nakamoto.</p>\n\n<p>That&#39;s basically it, hope I made your day a little bit better with this random Funfact.</p>\n\n<p>Edit: Bulagaria</p>\n</div><!-- SC_ON -->",
  "score": 215,
  "permalink": "/r/CryptoCurrency/comments/pbfznf/just_a_random_funfact_for_you_guys/",
  "subreddit": "CryptoCurrency",
  "id": "pbfznf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Did you know, that the state of Bulgaria is the second largest Bitcoin-Holder in\nthe world? Well, it's true....\n\nThe Bulgarian Government has stated that it owns some 213.519 Bitcoins, valued\nat approximately 18% of it's national debt, if accessed and converted.\n\nThe Bulgarian Government came into…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ブルガリアは世界第2位のビットコイン保有国であることをご存知でしょうか？\nご存知ですか？それは本当です。....\n\nブルガリア政府は約213,519ビットコインを所有していると発表しました。\nブルガリア政府は、213,519ビットコインを所有していると発表しました。これは、アクセスして換算すると、ブルガリアの国家負債の約18%に相当します。\n\nブルガリア政府は...",
      "title": "みんなのためにランダムなファンファクトを"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你知道吗，保加利亚是世界上第二大比特币持有国。\n世界上第二大比特币持有国？嗯，这是真的....\n\n保加利亚政府表示，它拥有大约213.519个比特币，价值约为其国家债务的18%。\n价值约为其国家债务的18%，如果访问和转换。\n\n保加利亚政府进入了...",
      "title": "只是给你们一个随机的有趣的事实"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你知道嗎，保加利亞是世界上第二大比特幣持有國。\n世界上第二大比特幣持有國？嗯，這是真的....\n\n保加利亞政府表示，它擁有大約213.519個比特幣，價值約爲其國家債務的18%。\n價值約爲其國家債務的18%，如果訪問和轉換。\n\n保加利亞政府進入了...",
      "title": "只是給你們一個隨機的有趣的事實"
    }
  ]
}