{
  "author": "PleasureToNietzsche",
  "the_new_excerpt": "Recently the state I live in has lifted mask restrictions once again. I work out\nand about in the city driving around to different mechanic/body shops seeing\nindividual people. I’m fully vaxxed and most people that meet me with my mask on\nask if I’m vaccinated (fishing for why I’m still wearing it?)…",
  "original_created_utc": 1622577263,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、私の住んでいる州では、マスク規制が再び解除されました。私は外で働いています。\n私は街中で仕事をしていて、いろいろな整備工場やボディショップを回っています。\n人に会います。私は完全に予防接種を受けていますが、マスクをしている私に会う人のほとんどが\nワクチン接種をしているかどうか聞かれます（なぜマスクをしているかの釣り？",
      "title": "必要もないのにマスクをし続けたいと思うことが、なぜそんなに人を悩ませるのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近，我居住的州再次取消了面具限制。我在外面工作\n在城市里开车到不同的机修厂/汽车修理厂去看\n个别的人。我已经完全接种了疫苗，大多数人见到我时都戴着口罩\n问我是否接种了疫苗（问我为什么还戴着口罩）...。",
      "title": "为什么我宁愿继续戴着口罩，即使我不一定要戴口罩，却让人们如此烦恼呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近，我居住的州再次取消了面具限制。我在外面工作\n在城市裏開車到不同的機修廠/汽車修理廠去看\n個別的人。我已經完全接種了疫苗，大多數人見到我時都戴着口罩\n問我是否接種了疫苗（問我爲什麼還戴着口罩）...。",
      "title": "爲什麼我寧願繼續戴着口罩，即使我不一定要戴口罩，卻讓人們如此煩惱呢？"
    }
  ],
  "title": "Why does it bother people so much that I prefer to keep wearing my mask even though I don’t HAVE to?",
  "created_utc": 1622607486,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Recently the state I live in has lifted mask restrictions once again. I work out and about in the city driving around to different mechanic/body shops seeing individual people. I’m fully vaxxed and most people that meet me with my mask on ask if I’m vaccinated (fishing for why I’m still wearing it?) and when I say yes, they ALWAYS try to convince me to take it off and hate that I won’t. </p>\n\n<p>I kind of <em>like</em> it though. I have yellow teeth, my facial hair is abysmal for a 31 year old male, I can just lick my teeth and make faces under it and no one thinks I’m weird, and I wash it everyday so it smells good and feels nice on my face. IM GOOD, I just like to wear it, but why does that seem to bother people so much? They always really want me to take it off.</p>\n</div><!-- SC_ON -->",
  "score": 195,
  "permalink": "/r/TooAfraidToAsk/comments/nq2xrt/why_does_it_bother_people_so_much_that_i_prefer/",
  "subreddit": "TooAfraidToAsk",
  "id": "nq2xrt",
  "is_self": true,
  "media": null,
  "is_video": false
}