{
  "author": "BitcoinHolderThankU",
  "the_new_excerpt": "Back in 2011-2012 (I can’t remember exactly which year it was,) I was playing a\ngame with my friends called Dark Orbit. Within the game was this valuable\nin-game currency called Uridium that allowed you to by premium space ships and\nhigh-tier ammo and whatnot.\n\nTo get Uridium you had to actually buy…",
  "original_created_utc": 1610055837,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "回到2011-2012年(我记不清具体是哪一年了)，我在玩一场\n和我朋友玩的游戏叫黑暗轨道。在游戏中有这么值钱的东西\n游戏中的货币名为Uridium，它允许你乘坐高级太空船和\n高级弹药之类的。\n\n要得到铀矿，你必须真正买下…",
      "title": "我找到了我8-9年前丢失的127枚比特币的私钥。我说不出话来。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "回到2011-2012年(我記不清具體是哪一年了)，我在玩一場\n和我朋友玩的遊戲叫黑暗軌道。在遊戲中有這麼值錢的東西\n遊戲中的貨幣名爲Uridium，它允許你乘坐高級太空船和\n高級彈藥之類的。\n\n要得到鈾礦，你必須真正買下…",
      "title": "我找到了我8-9年前丟失的127枚比特幣的私鑰。我說不出話來。"
    }
  ],
  "title": "I found the private keys to my 127 Bitcoins I lost 8-9 years ago. I’m at a loss for words.",
  "created_utc": 1610063859,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Back in 2011-2012 (I can’t remember exactly which year it was,) I was playing a game with my friends called Dark Orbit. Within the game was this valuable in-game currency called Uridium that allowed you to by premium space ships and high-tier ammo and whatnot.</p>\n\n<p>To get Uridium you had to actually buy it with real money. Being just kids at the time, me and my friends couldn’t afford to buy it so we started looking online for sites that give you free Uridium.</p>\n\n<p>This one site (I can’t remember what it’s called it’s been so long,) lets users buy Uridium with Bitcoin. We had no idea what Bitcoin was, but we found out ways to get free Bitcoin through surveys, watching videos, and completing random online tasks.</p>\n\n<p>I managed to “earn” 127 Bitcoins by doing this but never ended up buying the Uridium. I don’t know why I didn’t buy it, but holy fucking shit I’m so glad I didn’t.</p>\n\n<p>I used to play Dark Orbit mainly at my grandpa’s house, and I was there for around a week during the holidays. While I was there I was going through his old Dell computer that I used to play the game on and came across a .txt folder that was labeled “Keys”.</p>\n\n<p>I’m at a complete loss for words. I sold all 127 Bitcoins on January 3rd for a little under $34,000 per coin and the USD just arrived to my checking account this morning. At the time I’m writing this, Bitcoin just surpassed $38,000.</p>\n\n<p>Literally took me 2 hours to write this because I’ve been constantly balling my eyes out while typing. Made a Reddit account just to share this story with you all. Thank you to all the believers of Bitcoin who made this possible.</p>\n\n<p>Hold On for Dear Life.</p>\n</div><!-- SC_ON -->",
  "score": 991,
  "permalink": "/r/Bitcoin/comments/ksnkwa/i_found_the_private_keys_to_my_127_bitcoins_i/",
  "subreddit": "Bitcoin",
  "id": "ksnkwa",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706370126
}