{
  "author": "Some1fromReddit",
  "original_created_utc": 1632015540,
  "title": "I find trading crypto while naked makes me a better trader.",
  "created_utc": 1632040541,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Because that&#39;s how I want to feel when I DCA back in.  Like I own nothing.   That way if I lose, I still have the same feeling of not even having clothes on when I did it. </p>\n\n<p>It also helps me have a better attitude.  Helps me research more.   If I&#39;m clothed..I feel protected. Like a safety net wrapped around me.     Not when I&#39;m naked.  I feel exposed to everything. Danger. Etc. </p>\n\n<p>So I make more conscious choices when choosing the right shitcoin to day trade with. </p>\n\n<p>I even lose some weight because now I can see my body and the spots I need to lose weight.  So I sold off parts of me I don&#39;t need.   Got about 20K for both nuts.      </p>\n\n<p>That&#39;s more crypto. If it brings me to the moon...I can just buy my nuts back at a discount.</p>\n</div><!-- SC_ON -->",
  "score": 161,
  "permalink": "/r/CryptoCurrency/comments/pqyv2i/i_find_trading_crypto_while_naked_makes_me_a/",
  "subreddit": "CryptoCurrency",
  "id": "pqyv2i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Because that's how I want to feel when I DCA back in. Like I own nothing. That\nway if I lose, I still have the same feeling of not even having clothes on when\nI did it.\n\nIt also helps me have a better attitude. Helps me research more. If I'm\nclothed..I feel protected. Like a safety net wrapped…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "DCAで戻ってきたときに、そういう気持ちになりたいからです。自分が何も持っていないような。そうすれば\n負けたとしても、服を着ていなかった時と同じ気持ちで\nしていたのと同じ気持ちです。\n\nまた、より良い姿勢で臨むことができます。また、研究もしやすくなります。服を着ていれば\n服を着ていると、守られている感じがします。安全ネットに包まれているような...。",
      "title": "裸で暗号を取引すると、より良いトレーダーになれると思います。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因为这就是我想在DCA回来时的感觉。就像我什么都不拥有一样。这样\n这样，如果我输了，我仍然有同样的感觉，甚至没有穿衣服的时候\n我做到了。\n\n这也有助于我有一个更好的态度。帮助我更多地研究。如果我\n衣服，我就会感到受到保护。就像一个安全网包裹着...",
      "title": "我发现在裸体时交易加密货币使我成为更好的交易者。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因爲這就是我想在DCA回來時的感覺。就像我什麼都不擁有一樣。這樣\n這樣，如果我輸了，我仍然有同樣的感覺，甚至沒有穿衣服的時候\n我做到了。\n\n這也有助於我有一個更好的態度。幫助我更多地研究。如果我\n衣服，我就會感到受到保護。就像一個安全網包裹着...",
      "title": "我發現在裸體時交易加密貨幣使我成爲更好的交易者。"
    }
  ]
}