{
  "author": "Alfredo_N",
  "original_created_utc": 1631729300,
  "title": "I'm not ready to get rich",
  "created_utc": 1631741969,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I know this might sound like a very good &quot;problem&quot; to have, but I think most people here are pretty smart and will get it. Some of you will even be in a similar situation soon if not already.</p>\n\n<p>Long story short, I feel like I&#39;m not ready to get rich.</p>\n\n<p>My crypto portfolio is now around $400K and it seems sort of inevitable that it will reach millions, if not tens of millions, in the coming years.</p>\n\n<p>On one hand I&#39;m happy about it, of course. The chance to never have to work for money again, focus 100% on creative pursuits, etc.</p>\n\n<p>On the other hand I&#39;m scared it will be sort of like a lottery win and I will do something stupid.</p>\n\n<p>I think my life might become too good for some friends and we&#39;ll grow apart / not have much in common anymore. You know, the average struggle of time, money that 90% of the world has.</p>\n\n<p>Also, I&#39;d love to spread knowledge about Bitcoin with my friends and family, but I don&#39;t know if it&#39;s wise to let them know I&#39;m hugely invested.</p>\n\n<p>Am I getting paranoid? Has anyone else experienced something similar?</p>\n</div><!-- SC_ON -->",
  "score": 217,
  "permalink": "/r/Bitcoin/comments/povjpq/im_not_ready_to_get_rich/",
  "subreddit": "Bitcoin",
  "id": "povjpq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I know this might sound like a very good \"problem\" to have, but I think most\npeople here are pretty smart and will get it. Some of you will even be in a\nsimilar situation soon if not already.\n\nLong story short, I feel like I'm not ready to get rich.\n\nMy crypto portfolio is now around $400K and it…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これはとても良い「問題」のように聞こえるかもしれませんが、ここにいるほとんどの人は、かなり賢くてよく知っていると思います。\nしかし、ここにいるほとんどの人はとても賢く、きっと理解してくれるでしょう。皆さんの中には、同じような状況に置かれている人もいるでしょう。\n同じような状況にある人もいるでしょう。\n\n長い話になりますが、私は金持ちになる準備ができていないように感じます。\n\n私の暗号化ポートフォリオは現在約40万ドルで、それは...",
      "title": "豊かになるための準備はできていない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道这可能听起来像是一个非常好的 \"问题\"，但我认为这里的大多数人都很聪明，会明白这个问题。\n这里的大多数人都很聪明，会明白这一点。你们中的一些人甚至会在一个\n如果不是的话，你们中的一些人甚至很快就会遇到类似的情况。\n\n长话短说，我觉得我还没有准备好发财。\n\n我的加密货币投资组合现在约为40万美元，它...",
      "title": "我还没有准备好发财"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道這可能聽起來像是一個非常好的 \"問題\"，但我認爲這裏的大多數人都很聰明，會明白這個問題。\n這裏的大多數人都很聰明，會明白這一點。你們中的一些人甚至會在一個\n如果不是的話，你們中的一些人甚至很快就會遇到類似的情況。\n\n長話短說，我覺得我還沒有準備好發財。\n\n我的加密貨幣投資組合現在約爲40萬美元，它...",
      "title": "我還沒有準備好發財"
    }
  ]
}