{
  "author": "ShotBot",
  "original_created_utc": 1629495966,
  "title": "If Palantir is prepping for a Black Swan event, you should probably pay attention.",
  "created_utc": 1629523972,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Earlier this week, Palantir bought 50 million dollars worth of gold bars to prepare for a coming &quot;black swan event&quot;.</p>\n\n<p>If this was any other company, it wouldn&#39;t mean very much to me, but Palantir is not an ordinary company. They are a big data intelligence firm that the United States uses in their military, the NSA, CIA, FBI, etc... While most of the exact uses in government are classified/secret, it is known that their data was responsible for locating Osama Bin Laden that led to the 2011 raid.</p>\n\n<p>They are essentially a worldwide intelligence network that has access to so much data that the rest of the world is not privy to. So when they are prepping for a &quot;black swan event&quot;, it&#39;s because they see something coming that the rest of us don&#39;t see. Something in their data is suggesting something is coming, and I think people should be paying attention.</p>\n</div><!-- SC_ON -->",
  "score": 161,
  "permalink": "/r/Bitcoin/comments/p8ept5/if_palantir_is_prepping_for_a_black_swan_event/",
  "subreddit": "Bitcoin",
  "id": "p8ept5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Earlier this week, Palantir bought 50 million dollars worth of gold bars to\nprepare for a coming \"black swan event\".\n\nIf this was any other company, it wouldn't mean very much to me, but Palantir is\nnot an ordinary company. They are a big data intelligence firm that the United\nStates uses in their…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今週初め、Palantir社は5,000万ドル相当の金塊を購入しました。\n来るべき「ブラックスワン・イベント」に備えて。\n\nこれが他の会社であれば、私にとってはあまり意味のないことですが、Palantirは普通の会社ではありません。\n普通の会社ではありません。しかし、パランティアは普通の会社ではありませんでした。彼らは、米国が...\n米国が使用しているビッグデータ・インテリジェンス企業です...",
      "title": "もしPalantirがブラックスワンイベントの準備をしているとしたら、おそらく注意を払うべきでしょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "本周早些时候，帕兰蒂尔公司购买了价值5000万美元的金条，以备\n为即将发生的 \"黑天鹅事件 \"做准备。\n\n如果是其他公司，这对我来说意义不大，但Palantir是\n不是一个普通的公司。他们是一家大数据情报公司。\n他们是一家大数据情报公司，美国在其...",
      "title": "如果Palantir正在为一个黑天鹅事件做准备，你也许应该注意。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "本週早些時候，帕蘭蒂爾公司購買了價值5000萬美元的金條，以備\n爲即將發生的 \"黑天鵝事件 \"做準備。\n\n如果是其他公司，這對我來說意義不大，但Palantir是\n不是一個普通的公司。他們是一家大數據情報公司。\n他們是一家大數據情報公司，美國在其...",
      "title": "如果Palantir正在爲一個黑天鵝事件做準備，你也許應該注意。"
    }
  ]
}