{
  "author": "TNGSystems",
  "original_created_utc": 1625696256,
  "title": "21 Accounts received maximum karma for Moons this month. Let's see how they did it.",
  "created_utc": 1625754644,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I did this a while ago and people seemed to get a kick out of it. It&#39;s best done on the day of the snapshot. Go to a user&#39;s profile and sort by &quot;top&quot; and then &quot;month&quot; to see what earned them karma for that month.  </p>\n\n<p><strong>15,000 karma is the cap, which in this distribution is 4,560 Moons. That equates to $376.54 in today&#39;s prices.</strong></p>\n\n<p>The latest distribution snapshot is here:  </p>\n\n<p><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/ofss7k/new_moons_distribution_round_15_proposal/\">https://www.reddit.com/r/CryptoCurrency/comments/ofss7k/new_moons_distribution_round_15_proposal/</a></p>\n\n<table><thead>\n<tr>\n<th>Rank</th>\n<th>Method</th>\n</tr>\n</thead><tbody>\n<tr>\n<td>1</td>\n<td>A couple good link posts and several high-rated comments</td>\n</tr>\n<tr>\n<td>2</td>\n<td>High volume of comments, top ones up to +150</td>\n</tr>\n<tr>\n<td>3</td>\n<td>A few top comments that hit the 1,000 karma cap. Lots of other high rated helpful / interesting content</td>\n</tr>\n<tr>\n<td>4</td>\n<td>A couple top comments and a lot of daily discussion posts</td>\n</tr>\n<tr>\n<td>5</td>\n<td>A couple quite well upvoted comments and a lot with +50 - this guy seems pretty agreeable ;&#39;)</td>\n</tr>\n<tr>\n<td>6</td>\n<td>I&#39;m gonna call this man &quot;Captain Reddit&quot; because he frequently gets top comments in several subreddits</td>\n</tr>\n<tr>\n<td>7</td>\n<td>I think this user <em>might</em> have been responsible for the recent reminder that upvote solicitation is not allowed..</td>\n</tr>\n<tr>\n<td>8</td>\n<td>A couple whopping front page links and several top comments maxing karma limits.</td>\n</tr>\n<tr>\n<td>9</td>\n<td>Lots of highly rated comments</td>\n</tr>\n<tr>\n<td>10</td>\n<td>Has about 30 highly-rated links, mostly about Elon &amp; Doge.</td>\n</tr>\n<tr>\n<td>11</td>\n<td>Lots of top comments and high-rated comments, averaging around 150-200 karma per. Wowzarooni</td>\n</tr>\n<tr>\n<td>12</td>\n<td>Again lots of top comments, and possibly one of the sassiest posts I&#39;ve seen on this reddit.</td>\n</tr>\n<tr>\n<td>13</td>\n<td>A few high rated comments and lots of low-rated ones</td>\n</tr>\n<tr>\n<td>14</td>\n<td>Same as above</td>\n</tr>\n<tr>\n<td>15</td>\n<td>Same as above</td>\n</tr>\n<tr>\n<td>16</td>\n<td>I think we have a contender to Captain reddit here!</td>\n</tr>\n<tr>\n<td>17</td>\n<td>Lots of top comments &amp; some sage advice</td>\n</tr>\n<tr>\n<td>18</td>\n<td>Huge volume of low rated comments and Gif spam aplenty. Pretty much all in the Daily Discussion thread</td>\n</tr>\n<tr>\n<td>19</td>\n<td>Same as above but with less GIFs</td>\n</tr>\n<tr>\n<td>20</td>\n<td>Quite a few top rated links and helpful self-posts and an average smattering of 50 karma comments</td>\n</tr>\n<tr>\n<td>21</td>\n<td>Lots of links. <strong>LOTS</strong> of GIFs</td>\n</tr>\n</tbody></table>\n\n<p>So that&#39;s that then, quite a change from the last time I did this where easily the top way to earn max karma was to post links. Now it seems like only 3/21 accounts managed to get there with links.  </p>\n\n<p>By far the most common method of maxing karma appears to be dropping in a few decent comments in threads. Another change from last time I did this was there were a lot less comedy-oriented comments. <strong>Being genuinely helpful or offering a hot take on the industry seems the best method for success in the Jun-July period.</strong></p>\n</div><!-- SC_ON -->",
  "score": 162,
  "permalink": "/r/CryptoCurrency/comments/ofthyj/21_accounts_received_maximum_karma_for_moons_this/",
  "subreddit": "CryptoCurrency",
  "id": "ofthyj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I did this a while ago and people seemed to get a kick out of it. It's best done\non the day of the snapshot. Go to a user's profile and sort by \"top\" and then\n\"month\" to see what earned them karma for that month.\n\n15,000 karma is the cap, which in this distribution is 4,560 Moons. That equates\nto…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "少し前にやったのですが、みんなが喜んでくれたようです。一番いいのは\nスナップショットの日に行うのがベストです。ユーザーのプロフィールを見て、「トップ」「月」の順に並び替えてください。\n\"月」でソートすると、その月のカルマ獲得状況がわかります。\n\n15,000カルマが上限で、今回の配信では4,560ムーンとなっています。これはつまり\nつまり...",
      "title": "今月、21のアカウントが「月」の最大カルマを受けました。どのようにして獲得したのか見てみましょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不久前做了这个，人们似乎从中得到了乐趣。它最好是在\n在快照的当天。进入一个用户的档案，按 \"顶部 \"和 \"月份 \"排序。\n\"月 \"来查看他们当月赢得了什么业力。\n\n15,000 karma是上限，在这个分配中是4,560 Moons。这相当于\n相当于...",
      "title": "本月有21个账户获得了月亮的最大因果。让我们看看他们是如何做到的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不久前做了這個，人們似乎從中得到了樂趣。它最好是在\n在快照的當天。進入一個用戶的檔案，按 \"頂部 \"和 \"月份 \"排序。\n\"月 \"來查看他們當月贏得了什麼業力。\n\n15,000 karma是上限，在這個分配中是4,560 Moons。這相當於\n相當於...",
      "title": "本月有21個賬戶獲得了月亮的最大因果。讓我們看看他們是如何做到的。"
    }
  ]
}