{
  "author": "theslothoverlord",
  "original_created_utc": 1646273453,
  "title": "How frequently did wartime leaders such as Churchill, Roosevelt, or Stalin take days off work during the war, and how did they avoid burnout working &gt;=16 hour days every day for 5+ years?",
  "created_utc": 1646286976,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Recently, President Zelensky of Ukraine said that &amp;quot;work and sleep&amp;quot; is all he has done since the start of the war last week. This made me wonder if/when he may suffer from burnout or be incapacitated with stress, and how often wartime leaders in the past might have suffered the same. &lt;/p&gt;\n\n&lt;p&gt;My question is - In a much more higher stakes war (such as World War II), how often did the main Allied leaders take a holiday, or simply just have a day or two off? Who covered for them in that time? Or did they really work 7 days per week for the entire war? If so, how did they cope? &lt;/p&gt;\n\n&lt;p&gt;Answers don`t have to be limited to just World War II and I would be happy to read answers about leaders in other conflicts. Thank you!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/t5gih0/how_frequently_did_wartime_leaders_such_as/",
  "subreddit": "AskHistorians",
  "id": "t5gih0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Recently, President Zelensky of Ukraine said that \"work and sleep\" is all he has\ndone since the start of the war last week. This made me wonder if/when he may\nsuffer from burnout or be incapacitated with stress, and how often wartime\nleaders in the past might have suffered the same.\n\nMy question is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、ウクライナのゼレンスキー大統領が、「仕事と睡眠しかない」と言ったそうです。\n先週、戦争が始まってから。そのため、私は、「もしかしたら、彼はいつ\n戦時中の戦場ではよくあることです。\n過去の指導者もそうだったのかもしれない。\n\nそこで質問なのだが...",
      "title": "チャーチルやルーズベルト、スターリンといった戦時中の指導者たちは、戦時中にどれくらいの頻度で仕事を休み、5年以上にわたって毎日16時間労働を続けて、どのように燃え尽き症候群を回避したのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近，乌克兰总统泽伦斯基说，\"工作和睡眠 \"是他自上周开始的所有\n自上周战争开始以来，他只做了一件事。这让我怀疑他是否/何时会\n这让我想知道，他是否/何时会出现职业倦怠或因压力过大而丧失能力，以及过去的战时领导人有多少次出现同样的情况。\n过去的战时领导人可能会有同样的遭遇。\n\n我的问题是...",
      "title": "丘吉尔、罗斯福或斯大林等战时领导人在战争期间多长时间休息一次，他们是如何避免在5年多的时间里每天工作&gt;=16小时的倦怠的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近，烏克蘭總統澤倫斯基說，\"工作和睡眠 \"是他自上週開始的所有\n自上週戰爭開始以來，他只做了一件事。這讓我懷疑他是否/何時會\n這讓我想知道，他是否/何時會出現職業倦怠或因壓力過大而喪失能力，以及過去的戰時領導人有多少次出現同樣的情況。\n過去的戰時領導人可能會有同樣的遭遇。\n\n我的問題是...",
      "title": "丘吉爾、羅斯福或斯大林等戰時領導人在戰爭期間多長時間休息一次，他們是如何避免在5年多的時間裏每天工作&gt;=16小時的倦怠的？"
    }
  ]
}