{
  "author": "Yonsei",
  "the_new_excerpt": "Alright apes and autists, let me explain why I believe GameStop has a strong\nfundamental case without mentioning diamond hands and short squeeze. If Ryan\nCohen can successfully execute his vision, this leaky vessel will turn into a\nrocket ship blasting past the moon to the edge of the observable…",
  "original_created_utc": 1613239744,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，猿人和自闭症患者，让我解释一下为什么我相信GameStop有一个强大的。\n基本情况下，不提钻石手和短挤。如果瑞恩\n科恩如果能成功地执行他的设想，这艘漏网之鱼就会变成一个\n火箭飞船在月球上爆炸，到达可观测的边缘... ...",
      "title": "为什么GameStop和Ryan Cohen会赢？[DD]不需要钻石手。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，猿人和自閉症患者，讓我解釋一下爲什麼我相信GameStop有一個強大的。\n基本情況下，不提鑽石手和短擠。如果瑞恩\n科恩如果能成功地執行他的設想，這艘漏網之魚就會變成一個\n火箭飛船在月球上爆炸，到達可觀測的邊緣... ...",
      "title": "爲什麼GameStop和Ryan Cohen會贏？[DD]不需要鑽石手。"
    }
  ],
  "title": "Why GameStop and Ryan Cohen will win. [DD] No Diamond Hands Required.",
  "created_utc": 1613248448,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Alright apes and autists, let me explain why I believe GameStop has a strong fundamental case without mentioning diamond hands and short squeeze. If Ryan Cohen can successfully execute his vision, this leaky vessel will turn into a rocket ship blasting past the moon to the edge of the observable universe.</p>\n\n<p>On November 16, 2020, Ryan Cohen sent a letter to the GameStop&#39;s Board of Directors titled &quot;Maximizing Stockholder Value by Becoming the Ultimate Destination for Gamers&quot;. In it, Ryan Cohen outlined the roadmap for GameStop to pivot and become a technology first company. Let me boil this down for you in simple language for you smooth brain apes.</p>\n\n<p><strong>The Mission Statement</strong></p>\n\n<p>&quot;GameStop needs to evolve into a technology company that delights gamers and delivers exceptional digital experiences [...] the successful and durable players of tomorrow will be technology-first companies that specialize in gaming products, experiences and services.&quot;</p>\n\n<p><strong>The Landscape</strong></p>\n\n<ul>\n<li>Explosive Growth in the Gaming Industry\n\n<ul>\n<li>&quot;The size of the global gaming market has grown by more than 2.5x since the last console cycle.&quot;</li>\n<li>&quot;The global gaming market expected to be $174.9 billion this year and reach $217.9 billion by 2023.&quot;</li>\n</ul></li>\n<li>Valuable Assets\n\n<ul>\n<li>Existing &quot;strong brand&quot; and recent Reddit frenzy is net positive to the brand, increases awareness, and strengthens its base.</li>\n<li>&quot;Large customer base and 55 million PowerUp members.&quot;</li>\n<li>Large retail and physical footprint.</li>\n</ul></li>\n</ul>\n\n<p><strong>The Roadmap</strong></p>\n\n<ul>\n<li>Evolve into a Technology-first company\n\n<ul>\n<li>&quot;Technology is changing nearly every aspect of the gaming world, ranging from the way gamers shop to how they interact and compete with one another.&quot;</li>\n<li>GameStop will have to &quot;begin building a powerful e-commerce platform that provides competitive pricing, broad gaming selection, fast shipping and a truly high-touch experience that excites and delights customers.&quot; (Ryan successfully executed this vision with Chewy and he can do it again in gaming)</li>\n<li>GameStop will have to &quot;hire the right talent.&quot; (So far, Ryan has recruited 5 rock stars from Chewy and Amazon to join the team, more on that later).</li>\n</ul></li>\n<li>Create the Ultimate Gaming Platform\n\n<ul>\n<li>&quot;Shift to purchasing from mass retailers and other online competitors.&quot; (Create a marketplace of wanted products and services, i.e. Amazon, Target, App Store)</li>\n<li>Provide and expand &quot;larger gaming catalogs&quot; (Capture all games)</li>\n<li>Create &quot;community experiences&quot; (This could be both physical and digital experiences)</li>\n<li>Provide &quot;streaming services&quot; (New vertical opportunity for content creation, tournaments, and others)</li>\n<li>Support &quot;Esports&quot; (Expanding scene that is not going away)</li>\n</ul></li>\n<li>Transition to Digital\n\n<ul>\n<li>&quot;Industry developments in recent years&quot; include &quot;transition from physical hardware to digital streaming&quot; and the &quot;explosion of mobile.&quot;</li>\n<li>Expand &quot;digital content.&quot; (This needs to be a focus as it&#39;s competing against Steam, Blizzard, App Store, etc)</li>\n<li>Allow &quot;online trade-ins.&quot; (This would be a game changer)</li>\n</ul></li>\n<li>Cut Excessive costs\n\n<ul>\n<li>&quot;Cut its excessive real estate costs&quot; and &quot;identify duplicative, under performing stores and plan to forgo lease renewals.&quot;</li>\n<li>Streamline &quot;Non-core operations in Europe and Australia [...] in order to reduce losses and potentially generate cash.&quot;</li>\n<li>&quot;Near-term increases in cash flow stemming from the console cycle can also help finance the future.&quot;</li>\n</ul></li>\n</ul>\n\n<p><strong>The Financials</strong></p>\n\n<p>Analysts are valuing GameStop as a traditional brick-and-mortar business. If Ryan can properly execute and transform the company, I believe they can become the Target and Chewy of Gaming with potential verticals of streaming and Esports (not factored into this calculation for now). GameStop makes roughly $8 Billion in Revenue, however it is currently valued at a $3.5B Market Cap as it bleeds cash. Target makes roughly $78B in Revenue with $3.3B in Net Income and a Market Cap of $96 Billion. Chewy makes roughly $4.8B in Revenue, losing money but growing quickly, and is valued at $44B in Market Cap. Target and Chewy are valued at 1.25x to 9x Price to Sales respectively. This equates to $10B to $72B Market Cap transposed to GameStop. Obviously, this is very simplistic and does not consider their balance sheet and other factors, but given these metrics:</p>\n\n<ul>\n<li>GameStop stock price potential is between $143 to $1,032 a share based on a current revenues.</li>\n</ul>\n\n<p>Note this is assuming $8B in Revenue. If GameStop can grow revenues, focus on digital to improve margins, and expand within the growing total addressable market, I see potential for higher prices and achieving Target to Chewy-like multiples.</p>\n\n<p><strong>The X Factor</strong></p>\n\n<p>I believe Ryan Cohen was offered to lead GameStop&#39;s transition with significant control and autonomy. Otherwise, I do not believe he would have joined the Board. In his letter, Ryan simply stated that &quot;RC Ventures is not interested in receiving a lone seat on GameStop&#39;s ten-member Board. It is not enticing to become an isolated stockholder advocate on a Board that has overlooked years of digital revenue opportunities and presided over massive value destruction without assuming full accountability.&quot; With the recent additions of two Chewy Executives to the Board of Directors, a new Chief Technology Officer who was the Engineering Lead in Amazon Web Services, a new Customer Care Executive from Chewy, and a new Fulfillment Executive from Amazon, I believe Ryan is executing his vision and revamping the GameStop team.</p>\n\n<p>Notice his hires are from Chewy and Amazon? Ryan Cohen was obsessed with Amazon’s customer centric philosophy and built Chewy to follow that same model. He is hiring digital and e-commerce focused leaders to manage this transformation. Ryan&#39;s customer centric obsession is what allowed Chewy to beat Amazon. If GameStop pivots to digital and follows that same obsession, this will be a great opportunity to win.</p>\n\n<p>Furthermore, I believe Ryan&#39;s vision is the right roadmap for GameStop. Digital e-commerce, streaming, and mobile is the future and Ryan fully acknowledges and embraces that future. GameStop will need to revamp and modernize their website and phone app, but I am sure that will follow in the months ahead. GameStop has the financial and brand assets that should weather this storm, but execution will be key. Ryan owns nearly 10% of GameStop, so he has a vested interest in its success and has much more to lose than my stake.</p>\n\n<p>So degens, I say think with your heart and not with your smooth brain. Strap in and sit tight, this rocket ship may turn into a long journey to Mars. Maybe Papa Elon will be our catalyst.</p>\n\n<p>P.S. If we all buy something from GameStop this quarter we can load this rocket ship ourselves.</p>\n\n<p><strong>TLDR; Ryan Cohen is Jesus. Buy and Hold $GME.</strong></p>\n</div><!-- SC_ON -->",
  "score": 11128,
  "permalink": "/r/wallstreetbets/comments/lj5oyo/why_gamestop_and_ryan_cohen_will_win_dd_no/",
  "subreddit": "wallstreetbets",
  "id": "lj5oyo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728630015
}