{
  "author": "Codeine_dreamer",
  "original_created_utc": 1627991094,
  "title": "How do I report CP? Specifically if it’s on discord?",
  "created_utc": 1628077040,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I was going through Twitter and somebody posted a porn link to discord so I joined it thinking it would be normal shit, but the videos were of obviously very underage girls. The videos were screen recordings of some piece of shit texting and manipulating like no older than 14 year old girls into sending him sexual videos. They were really disturbing and I want to report it somehow. The only problems are </p>\n\n<ol>\n<li><p>I don’t know how discord works</p></li>\n<li><p>I don’t want to be apart of the discord group that has the CP in it but if I exit it will the evidence be lost? Obviously I don’t want to save the videos to my phone..</p></li>\n<li><p>How would I even go about reporting this? Where would I report this?</p></li>\n</ol>\n</div><!-- SC_ON -->",
  "score": 811,
  "permalink": "/r/TooAfraidToAsk/comments/ox1qd8/how_do_i_report_cp_specifically_if_its_on_discord/",
  "subreddit": "TooAfraidToAsk",
  "id": "ox1qd8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So I was going through Twitter and somebody posted a porn link to discord so I\njoined it thinking it would be normal shit, but the videos were of obviously\nvery underage girls. The videos were screen recordings of some piece of shit\ntexting and manipulating like no older than 14 year old girls into…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ツイッターを見ていたら、誰かがdiscordにポルノのリンクを貼っていたので、普通のことだと思って参加した。\n普通の動画だと思って参加したんだけど、その動画は明らかに\n未成年の女の子の動画だった その動画は、あるクソ野郎がメールや操作をしている画面を録画したものだった。\n14歳以下の女の子にメールを送って操って...",
      "title": "CPを報告するにはどうすればいいですか？特にdiscordでの報告は？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我正在浏览Twitter，有人发布了一个色情链接到discord，所以我加入了它，以为它是一个很好的平台。\n于是我加入了这个链接，以为会是正常的狗屎，但视频中的女孩显然都是\n非常未成年的女孩。这些视频是一些狗屎的屏幕记录\n发短信和操纵像不超过14岁的女孩进入...",
      "title": "我如何报告CP？特别是如果是在不和谐的情况下？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我正在瀏覽Twitter，有人發佈了一個色情鏈接到discord，所以我加入了它，以爲它是一個很好的平臺。\n於是我加入了這個鏈接，以爲會是正常的狗屎，但視頻中的女孩顯然都是\n非常未成年的女孩。這些視頻是一些狗屎的屏幕記錄\n發短信和操縱像不超過14歲的女孩進入...",
      "title": "我如何報告CP？特別是如果是在不和諧的情況下？"
    }
  ]
}