{
  "author": "jogarz",
  "the_new_excerpt": "This is something that has always stood out to me. Most of the Roman emperors of\nthe first two centuries seem to have had relatively few children, at least\ncompared to the large family sizes that would have been common in those days.\nLooking at the first ten emperors (excluding the three from the…",
  "original_created_utc": 1620446988,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは、私にとっていつも目につくことでした。最初の2世紀のローマ皇帝のほとんどは\n少なくとも、当時の大家族に比べれば、子供の数は少なかったようです。\n少なくても、当時の大家族に比べれば、子供の数は少なかったようです。\n最初の10人の皇帝を見てみましょう（3人の皇帝を除く）。",
      "title": "初期のローマ皇帝は、なぜ実子が少なかったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这一点一直让我印象深刻。前两个世纪的大多数罗马皇帝都是\n前两个世纪的大多数罗马皇帝似乎都有相对较少的孩子，至少\n与当时常见的大家庭规模相比。\n纵观前十位皇帝（不包括来自于《史记》的三位皇帝），他们的子女相对较少。",
      "title": "为什么早期罗马皇帝的亲生子女如此之少？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這一點一直讓我印象深刻。前兩個世紀的大多數羅馬皇帝都是\n前兩個世紀的大多數羅馬皇帝似乎都有相對較少的孩子，至少\n與當時常見的大家庭規模相比。\n縱觀前十位皇帝（不包括來自於《史記》的三位皇帝），他們的子女相對較少。",
      "title": "爲什麼早期羅馬皇帝的親生子女如此之少？"
    }
  ],
  "title": "Why did early Roman Emperors have so few biological children?",
  "created_utc": 1620462494,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is something that has always stood out to me. Most of the Roman emperors of the first two centuries seem to have had relatively few children, at least compared to the large family sizes that would have been common in those days. Looking at the first ten emperors (excluding the three from the post-Nero interregnum):</p>\n\n<ul>\n<li><strong>Augustus</strong>: One daughter.</li>\n<li><strong>Tiberius</strong>: Two sons.</li>\n<li><strong>Caligula</strong>: One daughter.</li>\n<li><strong>Claudius</strong>: Two sons, two daughters. Critiqued in ancient sources as a lustful womanizer.</li>\n<li><strong>Nero</strong>: One daughter.</li>\n<li><strong>Vespasian</strong>: Two sons, one daughter.</li>\n<li><strong>Nerva</strong>: No children.</li>\n<li><strong>Trajan</strong>: No children.</li>\n<li><strong>Hadrian</strong>: No children.</li>\n<li><strong>Antonius Pius</strong>: Two sons, two daughters.</li>\n</ul>\n\n<p>After this Emperors start to regularly have more kids.</p>\n\n<p>All in all, it seems like the early Roman Emperors had a pretty low fertility rate, especially since many of the listed kids died in infancy. This is even more confusing to me because of the high importance of succession.</p>\n\n<p>So why did early Roman Emperors not have a lot of kids?</p>\n</div><!-- SC_ON -->",
  "score": 127,
  "permalink": "/r/AskHistorians/comments/n7gy8h/why_did_early_roman_emperors_have_so_few/",
  "subreddit": "AskHistorians",
  "id": "n7gy8h",
  "is_self": true,
  "media": null,
  "is_video": false
}