{
  "author": "pukem0n",
  "the_new_excerpt": "By default Windows 10 saves the last 25 items you copied. These items might\ninclude wallet adresses you don't want anybody to know, like your metamask\nwallet address for example.\n\nSo do yourself a favor and delete these items from your clipboard history after\nevery time you copied and pasted a…",
  "original_created_utc": 1619537629,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Windows 10のデフォルトでは、コピーした最後の25個のアイテムが保存されます。これらのアイテムには\nこれらのアイテムには、誰にも知られたくないウォレットアドレスが含まれています。\nウォレットアドレスなどです。\n\nそこで、以下の操作を行った後、クリップボードの履歴からこれらの項目を削除してください。\nコピー＆ペーストするたびに...",
      "title": "暗号マニアの皆様、たまにはクリップボードの履歴を削除してみませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "默认情况下，Windows 10会保存你最后复制的25个项目。这些项目可能\n包括你不想让别人知道的钱包地址，比如你的元宝地址\n钱包地址等。\n\n因此，帮你自己一个忙，在你每次复制和粘贴后，从剪贴板历史中删除这些项目。\n每次你复制和粘贴了一个项目后，都要从你的剪贴板历史中删除这些项目。",
      "title": "亲爱的加密货币爱好者们，请偶尔删除你的剪贴板历史记录吧"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "默認情況下，Windows 10會保存你最後複製的25個項目。這些項目可能\n包括你不想讓別人知道的錢包地址，比如你的元寶地址\n錢包地址等。\n\n因此，幫你自己一個忙，在你每次複製和粘貼後，從剪貼板歷史中刪除這些項目。\n每次你複製和粘貼了一個項目後，都要從你的剪貼板歷史中刪除這些項目。",
      "title": "親愛的加密貨幣愛好者們，請偶爾刪除你的剪貼板歷史記錄吧"
    }
  ],
  "title": "Dear Crypto Enthusiasts, delete your clipboard history once in a while",
  "created_utc": 1619549867,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>By default Windows 10 saves the last 25 items you copied. These items might include wallet adresses you don&#39;t want anybody to know, like your metamask wallet address for example.</p>\n\n<p>So do yourself a favor and delete these items from your clipboard history after every time you copied and pasted a wallet address. To do this press Windows+V and it shows you all the entries where you can manually delete items.</p>\n\n<p>If you don&#39;t want Windows to save your clipboard history, turn it off completely in the settings. Just go to Windows settings -&gt; System - Clipboard and turn it off there.</p>\n\n<p>A lot of people don&#39;t know of this vulnerability and it seems to be easy to read out for hackers.</p>\n</div><!-- SC_ON -->",
  "score": 1009,
  "permalink": "/r/CryptoCurrency/comments/mzr4dd/dear_crypto_enthusiasts_delete_your_clipboard/",
  "subreddit": "CryptoCurrency",
  "id": "mzr4dd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776212026
}