{
  "author": "Zarkorix",
  "original_created_utc": 1629712741,
  "title": "Algorand - a deep dive",
  "created_utc": 1629722134,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ll preface this by saying ALGO, like all blockchain projects, is not perfect (e.g. it has less-than-optimal tokenomics) but that I&#39;m going to focus on its merits.</p>\n\n<h1>Solving the Blockchain Trilemma</h1>\n\n<p>Algorand is a blockchain network (i.e. like ETH, ADA, SOL) and a solution to the &quot;blockchain trilemma&quot; - the ability of a network to be simultaneously scalable, secure and decentralised. ALGO&#39;s transactions per second (TPS) is 1k, with a 4s finality. Transactions cost 0.001 ALGO and the network already offers L1 smart contracts. However, <strong>the network will be upgraded in Q3-Q4 2021 to 45k/s TPS and 2.5s finality</strong>, ranking it toward the top for speed and scalability <a href=\"https://www.algorand.com/120720-Algorand%202021%20Performance.pdf\">(Source)</a>. ALGO is currently experiencing ~1m transactions per day, placing it close to ETH in usage.</p>\n\n<p><strong>Main Conclusion</strong>: ALGO is, along with other projects, building and pioneering &#39;Blockchain 3.0&#39;.</p>\n\n<h1>Academic Rigor</h1>\n\n<p>Algorand was founded by the Turing-award-winning, MIT professor Silvio Micali - and is backed by an excellent team with solid peer-reviewed academic prowess and publication record <a href=\"https://www.algorand.com/technology/research-innovation/research-papers\">(Source 1)</a> <a href=\"https://scholar.google.com/scholar?hl=en&amp;as_sdt=0%2C5&amp;q=silvio+micali&amp;btnG=\">(Source 2)</a>. Silvio Micali conceived of and pioneered zero-knowledge proofs (among many other concepts) - a key and integral part of many cryptocurrencies. ALGO&#39;s respectable and trustworthy team boosts ALGO&#39;s chances of mass adoption, especially in the financial/institutional sectors - which appears to be ALGO&#39;s key target demographic.</p>\n\n<p><strong>Main Conclusion:</strong> ALGO&#39;s reliability, technology and ability to form partnerships is bolstered by the prestige and talent of its team.</p>\n\n<h1>Pure Proof-of-Stake</h1>\n\n<p>Algorand uses pure proof-of-stake (PPoS) as a consensus mechanism, which employs <strong>algo</strong>rithmic <strong>rand</strong>omness to achieve decentralisation + security. PPoS differs from regular, delegated PoS (dPoS) in a number of ways, including:</p>\n\n<ul>\n<li>No pooled validators (i.e. holders do not pledge their coins to a minority of super-validators). Theoretically, this minimises the drive toward centralisation that dPoS suffers from.</li>\n<li>ALGO node running is permissionless (i.e. anybody with &gt;1 ALGO can run a node, be a validator and participate in consensus).</li>\n<li>PPoS is extremely lightweight (an ALGO node can be run on a low energy, $50 Raspberry Pi 4 - no expensive hardware or upfront cost is required).</li>\n</ul>\n\n<p>A key feature of PPoS is the use of a randomised, weighted lottery that selects validators - known as VRF. This prevents any malicious actor(s) from attacking the network since the identities of the currently selected validators (who must be corrupted in order to carry out an attack) are not known until the block is already finalised. At 1-4k validators, PPoS is paradoxically superior to dPoS in terms of decentralisation - even if the latter had 50,000+ nodes. This is because validators under the dPoS system are long-lived and known. By contrast, ALGO&#39;s random selections vary on both a <em>round</em> and <em>subround</em> basis - that is, block proposers, voters, vote certifiers all vary, across all steps of creating a block - making it incredibly secure and decentralised.</p>\n\n<p><strong>Main Conclusion:</strong> ALGO is fast, scalable, secure while remaining decentralised.</p>\n\n<h1>Staking Rewards &amp; Governance</h1>\n\n<p>ALGO currently offers liquid and seamless staking with an APY of ~5.75% - you simply hold ALGO in a non-custodial wallet and there is no lock-up period. On Oct 1st 2021, governance is launching and this will gradually replace staking. In exchange for voting on proposals, you will be rewarded with 7.5-33% APY (depending on the number of participants). For the initial 3 months, this APY will be <strong><em>in addition</em></strong> to the passive 5.75%, meaning you could theoretically earn up to ~38.75% APY. Governance will not only allow ALGO holders to vote on changes to the network, consensus mechanism or tokenomics - but also select projects to receive developer grants (see below).</p>\n\n<p><strong>Main conclusion</strong>: ALGO offers highly competitive staking APYs and will further decentralise by handing voting power to holders.</p>\n\n<h1>Carbon Negative</h1>\n\n<p>PPoS is extremely lightweight - consuming ~0.000008 kWh per transaction <a href=\"https://www.algorand.com/resources/blog/sustainable-blockchain-calculating-the-carbon-footprint\">(Source)</a>. That&#39;s ~70,000x less energy than ADA, and 116250000x less energy than BTC.</p>\n\n<p>The energy that is used by ALGO is 100%+ offset via carbon credits. An on-chain sustainability oracle analyses the energy utilised by each node and a partnership with ClimateTrade (and others) then channels this funding into reforestation, peat management and wind-energy projects <a href=\"https://www.algorand.com/resources/algorand-announcements/carbon_negative_announcement\">(Source)</a>.</p>\n\n<p><strong>Main Conclusion:</strong> ALGO is eco-friendly, and the world&#39;s first carbon-<em>negative</em> blockchain network.</p>\n\n<h2>Developer Friendly &amp; Ecosystem</h2>\n\n<p>Algorand is extremely accessible to developers <a href=\"https://developer.algorand.org/tutorials/\">(Source 1)</a> <a href=\"https://developer.algorand.org/docs/reference/sdks/\">(Source 2)</a>. Most importantly, it supports development in <strong>Python, C++, GO, Java, Javascript and RUST</strong> - removing the need for developers to retrain or learn new languages. ALGO&#39;s smart contract language, TEAL, is incredibly intuitive and can be accessed via Python (PyTEAL). <strong>As of TEAL 4.0, the language is now fully Turing-complete.</strong> In addition, Algorand offers comprehensive, detailed documentation and tutorials (for free) - see Source 1.</p>\n\n<p>Moreover, ~$200-250m is available to support developers and 50+ grants have already been issued <a href=\"https://algorand.foundation/developers/developer-incentive-awards-program\">(Source)</a>. In total, ~600-650 companies are currently developing on ALGO and intend to deploy DApps/ALGO-based services <a href=\"https://www.algorand.com/ecosystem/\">(Source)</a>.</p>\n\n<p>Yieldly, ALGO&#39;s first DeFi app launched, ~2-3 months ago and has enjoyed a high TVL since. A number of high profile projects, including ALGO&#39;s first DEX are launching shortly this year. Tokenized, real-estate projects (e.g. <a href=\"https://Lofty.io\">Lofty.</a>ai) are also currently operating successfully on ALGO.</p>\n\n<p><strong>Main Conclusion:</strong> ALGO has the ability to instantly attract developers, and is poised for an explosion in its ecosystem.</p>\n\n<h2>Real World Use</h2>\n\n<p>A key feature of Algorand is that it is <em>forkless</em> - it is mathematically impossible for ALGO to fork <a href=\"https://www.sciencedirect.com/science/article/pii/S030439751930091X\">(Source)</a>. This is extremely important for real-world usage. Businesses accepting ALGO will not only experience rapid finality but can trust that the transaction is not on a forked branch of the blockchain that can be lost. This is even more important for NFTs. Thus far, ALGO has seen major adoption, recently including:</p>\n\n<ul>\n<li>70M South Americans (potentially 200M soon) using ALGO to issue + store COVID-19 passports <a href=\"https://www.algorand.com/resources/ecosystem-announcements/vitalpass-vaccine-tracing-latam/\">(Source)</a></li>\n<li>BNext adopting ALGO for its $100b/year Spain&lt;-&gt;Latin American remittance service <a href=\"https://www.algorand.com/resources/ecosystem-announcements/bnext-announces-next-generation-remittance-service/\">(Source)</a></li>\n<li>MAPay adopting ALGO to power $800m/year in healthcare payments for Bermuda <a href=\"https://www.algorand.com/resources/ecosystem-announcements/mapay-to-implement-blockchain-based-solutions-on-algorand\">(Source)</a></li>\n<li>SIAE, one of the largest and oldest digital rights management companies in the world, launched 4.5m NFTs onto ALGO - representing the work of 10,000 artists and which will involve $100m/year in royalties <a href=\"https://www.algorand.com/ecosystem/use-cases/siae\">(Source)</a>.</li>\n<li>ALGO was recently featured in a World Economic Forum (WEF) report on cryptocurrency - listed as a recommended &quot;VIP&quot; blockchain that solves issues with BTC/ETH and proof-of-stake <a href=\"http://www3.weforum.org/docs/WEF_Getting_Started_Cryptocurrency_2021.pdf\">(Source)</a>. This document will be seen by institutions, banks and economists worldwide.</li>\n</ul>\n\n<p>The list goes on and on <a href=\"https://www.algorand.com/ecosystem/use-cases\">Here.</a></p>\n\n<p><strong>Main Conclusion:</strong> ALGO is already being deployed for large-scale and institutional solutions.</p>\n\n<p>Does ALGO have problems? Absolutely - all projects do. But, at the same time, for a chain that launched only ~2y ago in June 2019, it has accomplished a great deal and its future, to me, seems extremely bright.</p>\n</div><!-- SC_ON -->",
  "score": 217,
  "permalink": "/r/CryptoCurrency/comments/p9wmgd/algorand_a_deep_dive/",
  "subreddit": "CryptoCurrency",
  "id": "p9wmgd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'll preface this by saying ALGO, like all blockchain projects, is not perfect\n(e.g. it has less-than-optimal tokenomics) but that I'm going to focus on its\nmerits.\n\n\nSOLVING THE BLOCKCHAIN TRILEMMA\n\nAlgorand is a blockchain network (i.e. like ETH, ADA, SOL) and a solution to the\n\"blockchain…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "前置きが長くなりましたが、ALGOは他のブロックチェーンプロジェクト同様、完璧ではありません。\n(トークノミクスが最適ではないなど）ですが、私はそのメリットに注目しています。\nそのメリットを紹介します。\n\n\nブロックチェーンのトリレンマを解決する\n\nAlgorandは、ブロックチェーンネットワーク（つまりETH、ADA、SOLのようなもの）であり、以下のような解決策を提供します。\n\"ブロックチェーン...",
      "title": "アルゴランド - ディープダイブ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在这之前，我想说ALGO和所有的区块链项目一样，并不完美。\n(例如，它有不太理想的tokenomics)，但我将专注于其\n的优点。\n\n\n解决区块链的三难问题\n\nAlgorand是一个区块链网络（即像ETH、ADA、SOL），也是对\n\"区块链...",
      "title": "Algorand - 深入研究"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在這之前，我想說ALGO和所有的區塊鏈項目一樣，並不完美。\n(例如，它有不太理想的tokenomics)，但我將專注於其\n的優點。\n\n\n解決區塊鏈的三難問題\n\nAlgorand是一個區塊鏈網絡（即像ETH、ADA、SOL），也是對\n\"區塊鏈...",
      "title": "Algorand - 深入研究"
    }
  ]
}