{
  "author": "bubul_babul",
  "original_created_utc": 1643803705,
  "title": "Why Whoopie Goldberg was criticised and suspended for saying \"holocaust wasn't about racism but about men's inhumanity to other men\"?",
  "created_utc": 1643813995,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t understand what was so controversial about her post. \nJewish people are generally white. In fact you cannot tell them apart from an ordinary white folk - the way to tell if someone is Jewish is when they declare themselves as such. You can also become a Jewish person by joining the religion.&lt;/p&gt;\n\n&lt;p&gt;Whereas if you&amp;#39;re black- you cannot do either. You also cannot simply become white or hide it.&lt;/p&gt;\n\n&lt;p&gt;If holocaust was about racism why don&amp;#39;t we call every type of ethnic cleansing an act of racism? &amp;#39;Xenophobia&amp;#39; is the word I would use, but not racism. &lt;/p&gt;\n\n&lt;p&gt;I really don&amp;#39;t understand why she got so much backlash for it and got suspended. I would be grateful if you could help me understand. &lt;/p&gt;\n\n&lt;p&gt;Edit: thanks for all the good answers! Seems like the issue lies around the definition of &amp;quot;race&amp;quot;. Nazis had a much more extensive classification of what race is than what we currently have. So yes, it seems to have been a race issue as they thought of Jewish, Polish, Roma people as a &amp;quot;race&amp;quot; and not as &amp;quot;ethnicity&amp;quot; which is how we classify nowadays.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/TooAfraidToAsk/comments/sin47h/why_whoopie_goldberg_was_criticised_and_suspended/",
  "subreddit": "TooAfraidToAsk",
  "id": "sin47h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I don't understand what was so controversial about her post. Jewish people are\ngenerally white. In fact you cannot tell them apart from an ordinary white folk\n- the way to tell if someone is Jewish is when they declare themselves as such.\nYou can also become a Jewish person by joining the…"
}