{
  "author": "bubul_babul",
  "original_created_utc": 1643803705,
  "title": "Why Whoopie Goldberg was criticised and suspended for saying \"holocaust wasn't about racism but about men's inhumanity to other men\"?",
  "created_utc": 1643813995,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t understand what was so controversial about her post. \nJewish people are generally white. In fact you cannot tell them apart from an ordinary white folk - the way to tell if someone is Jewish is when they declare themselves as such. You can also become a Jewish person by joining the religion.&lt;/p&gt;\n\n&lt;p&gt;Whereas if you&amp;#39;re black- you cannot do either. You also cannot simply become white or hide it.&lt;/p&gt;\n\n&lt;p&gt;If holocaust was about racism why don&amp;#39;t we call every type of ethnic cleansing an act of racism? &amp;#39;Xenophobia&amp;#39; is the word I would use, but not racism. &lt;/p&gt;\n\n&lt;p&gt;I really don&amp;#39;t understand why she got so much backlash for it and got suspended. I would be grateful if you could help me understand. &lt;/p&gt;\n\n&lt;p&gt;Edit: thanks for all the good answers! Seems like the issue lies around the definition of &amp;quot;race&amp;quot;. Nazis had a much more extensive classification of what race is than what we currently have. So yes, it seems to have been a race issue as they thought of Jewish, Polish, Roma people as a &amp;quot;race&amp;quot; and not as &amp;quot;ethnicity&amp;quot; which is how we classify nowadays.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/TooAfraidToAsk/comments/sin47h/why_whoopie_goldberg_was_criticised_and_suspended/",
  "subreddit": "TooAfraidToAsk",
  "id": "sin47h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I don't understand what was so controversial about her post. Jewish people are\ngenerally white. In fact you cannot tell them apart from an ordinary white folk\n- the way to tell if someone is Jewish is when they declare themselves as such.\nYou can also become a Jewish person by joining the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "彼女の投稿の何がそんなに物議をかもしたのか、理解できない。ユダヤ人は\nは一般的に白人です。実際、普通の白人と見分けがつきません。\n- ユダヤ人かどうかの見分け方は、本人がそう宣言している場合です。\nまた、ユダヤ教団に入ればユダヤ人になることができます。",
      "title": "ホロコーストは人種差別ではなく、男の非人道的な行為だ」と発言したウーピー・ゴールドバーグが批判され、停職処分を受けたのはなぜか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不明白她的帖子有什么可争议的。犹太人是\n一般都是白人。事实上，你无法将他们与普通白种人区分开来。\n- 判断一个人是否是犹太人的方法是当他们宣布自己是犹太人的时候。\n你也可以通过加入犹太人而成为犹太人。",
      "title": "为什么Whoopie Goldberg因为说 \"大屠杀不是关于种族主义，而是关于男人对其他男人的不人道行为 \"而被批评和停职？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不明白她的帖子有什麼可爭議的。猶太人是\n一般都是白人。事實上，你無法將他們與普通白種人區分開來。\n- 判斷一個人是否是猶太人的方法是當他們宣佈自己是猶太人的時候。\n你也可以通過加入猶太人而成爲猶太人。",
      "title": "爲什麼Whoopie Goldberg因爲說 \"大屠殺不是關於種族主義，而是關於男人對其他男人的不人道行爲 \"而被批評和停職？"
    }
  ]
}