{
  "author": "Menacingamaranth",
  "original_created_utc": 1645980468,
  "title": "Do other mentally ill people feel like standard treatment is focused on keeping us alive and productive, not on improving subjective experience?",
  "created_utc": 1645989248,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I (F/30) have depression, anxiety, PTSD and possibly borderline personality disorder and have been dealing w these issues for over a decade. Am in a new phase of bettering myself in earnest; have mostly coped via denial until now.&lt;/p&gt;\n\n&lt;p&gt;Disclaimer that a lot of the therapy and medication guidance I’ve gotten have objectively sucked. But I have had the sneaking suspicion that insurance-supported treatment has really only cared about preventing me from committing suicide and keeping me functional (employed, productive, good family relationships etc.).&lt;/p&gt;\n\n&lt;p&gt;Just seems like every professional I see doesn’t believe or care when I tell them I’m in excruciating pain. They see that I’m working, not in danger, in a relationship etc and that’s where their responsibility ends.&lt;/p&gt;\n\n&lt;p&gt;Anyone else have this experience? I feel like it’s related to health insurance, money, and capitalism.&lt;/p&gt;\n\n&lt;p&gt;Edit: I should add that I’m trying new medication and other alternative therapies; I also just started a comprehensive DBT program. All of this finally was able to happen because I had an insight that I was of value and worthy of self love right now, not just when I feel I “deserve” it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 121,
  "permalink": "/r/TooAfraidToAsk/comments/t2s8tg/do_other_mentally_ill_people_feel_like_standard/",
  "subreddit": "TooAfraidToAsk",
  "id": "t2s8tg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I (F/30) have depression, anxiety, PTSD and possibly borderline personality\ndisorder and have been dealing w these issues for over a decade. Am in a new\nphase of bettering myself in earnest; have mostly coped via denial until now.\n\nDisclaimer that a lot of the therapy and medication guidance I’ve…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私（F/30）は、うつ病、不安神経症、PTSD、そしておそらく境界性パーソナリティを患っています。\n10年以上、これらの問題に取り組んでいます。今は新しい\n本格的に自分を改善する段階。今まではほとんど否定で対処してきた。\n\n今まで受けてきた治療や服薬指導の多くが...」と断言する。",
      "title": "他の精神障害者は、標準的な治療が主観的な経験を改善することではなく、私たちの生存と生産性を維持することに焦点を合わせていると感じているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我（F/30）有抑郁症、焦虑症、创伤后应激障碍，可能还有边缘型人格障碍。\n我已经处理这些问题超过十年了。现在正处于一个新的\n认真改善自己的阶段；直到现在，我主要是通过否认来应对。\n\n免责声明：我所做的很多治疗和药物指导都是为了帮助我的家人。",
      "title": "其他精神病患者是否觉得标准治疗的重点是保持我们的生命和生产力，而不是改善主观体验？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我（F/30）有抑鬱症、焦慮症、創傷後應激障礙，可能還有邊緣型人格障礙。\n我已經處理這些問題超過十年了。現在正處於一個新的\n認真改善自己的階段；直到現在，我主要是通過否認來應對。\n\n免責聲明：我所做的很多治療和藥物指導都是爲了幫助我的家人。",
      "title": "其他精神病患者是否覺得標準治療的重點是保持我們的生命和生產力，而不是改善主觀體驗？"
    }
  ]
}