{
  "author": "Menacingamaranth",
  "original_created_utc": 1645980468,
  "title": "Do other mentally ill people feel like standard treatment is focused on keeping us alive and productive, not on improving subjective experience?",
  "created_utc": 1645989248,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I (F/30) have depression, anxiety, PTSD and possibly borderline personality disorder and have been dealing w these issues for over a decade. Am in a new phase of bettering myself in earnest; have mostly coped via denial until now.&lt;/p&gt;\n\n&lt;p&gt;Disclaimer that a lot of the therapy and medication guidance I’ve gotten have objectively sucked. But I have had the sneaking suspicion that insurance-supported treatment has really only cared about preventing me from committing suicide and keeping me functional (employed, productive, good family relationships etc.).&lt;/p&gt;\n\n&lt;p&gt;Just seems like every professional I see doesn’t believe or care when I tell them I’m in excruciating pain. They see that I’m working, not in danger, in a relationship etc and that’s where their responsibility ends.&lt;/p&gt;\n\n&lt;p&gt;Anyone else have this experience? I feel like it’s related to health insurance, money, and capitalism.&lt;/p&gt;\n\n&lt;p&gt;Edit: I should add that I’m trying new medication and other alternative therapies; I also just started a comprehensive DBT program. All of this finally was able to happen because I had an insight that I was of value and worthy of self love right now, not just when I feel I “deserve” it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 121,
  "permalink": "/r/TooAfraidToAsk/comments/t2s8tg/do_other_mentally_ill_people_feel_like_standard/",
  "subreddit": "TooAfraidToAsk",
  "id": "t2s8tg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I (F/30) have depression, anxiety, PTSD and possibly borderline personality\ndisorder and have been dealing w these issues for over a decade. Am in a new\nphase of bettering myself in earnest; have mostly coped via denial until now.\n\nDisclaimer that a lot of the therapy and medication guidance I’ve…"
}