{
  "author": "Chase757",
  "the_new_excerpt": "I’m looking for a few renewable energy stocks to add to my watchlist and\npossibly my portfolio. I feel the Biden administration & dems have a big focus\non renewable/green energy especially while they have the house and senate. Right\nnow a few on my watchlist are\n\n$SOL -ReneSola (manufactures parts…",
  "original_created_utc": 1611015606,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我正在寻找一些可再生能源股票添加到我的观察列表和。\n可能是我的投资组合。我觉得拜登政府与民主党有一个很大的焦点。\n在可再生/绿色能源上，尤其是当他们拥有众议院和参议院的时候。吧\n现在在我的观察名单上的几个是\n\n昱辉阳光 -ReneSola (制造零部件) ...",
      "title": "拜登政府下的可再生能源股票"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我正在尋找一些可再生能源股票添加到我的觀察列表和。\n可能是我的投資組合。我覺得拜登政府與民主黨有一個很大的焦點。\n在可再生/綠色能源上，尤其是當他們擁有衆議院和參議院的時候。吧\n現在在我的觀察名單上的幾個是\n\n昱輝陽光 -ReneSola (製造零部件) ...",
      "title": "拜登政府下的可再生能源股票"
    }
  ],
  "title": "Renewable energy stocks under Biden administration",
  "created_utc": 1611039330,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m looking for a few renewable energy stocks to add to my watchlist and possibly my portfolio. I feel the Biden administration &amp; dems have a big focus on renewable/green energy especially while they have the house and senate. Right now a few on my watchlist are </p>\n\n<p>$SOL -ReneSola (manufactures parts for solar panels)</p>\n\n<p>$BE - Bloom Energy (converts natural gas into electricity)</p>\n\n<p>$TPIC - TPI Composites (manufactures wind blades for wind turbines)</p>\n\n<p>$ARRY - Array Technologies (design and manufacture of solar tracking systems)</p>\n\n<p>$IEA - Infrastructure and Energy Alternatives (infrastructure solutions for renewable energy focusing on a renewable segment and a civil constitution segment)</p>\n\n<p>$BEEM - Beem Global (engineering, manufacture and sale of solar products)</p>\n\n<p>$NOVA - SunNova Energy (solar and energy storage services)</p>\n\n<p>I provided very brief descriptions of each company. If there is anything I got wrong or if you would like to expand on them anything is welcomed!</p>\n\n<p>If there are any others you recommend it would also be greatly appreciated!</p>\n</div><!-- SC_ON -->",
  "score": 67,
  "permalink": "/r/stocks/comments/l07o0b/renewable_energy_stocks_under_biden_administration/",
  "subreddit": "stocks",
  "id": "l07o0b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1611311218342
}