{
  "author": "rocketeer8015",
  "the_new_excerpt": "I see this come up again and again.\n\nNot your keys, not your bitcoin.\n\nAnd then a explanation, usually about how they could steal your coins from a\ncustodial wallet or exchange(theft). How the coins maybe don’t even exist(fraud)\nor how you are not in control of them.\n\nI feel like these arguments are…",
  "original_created_utc": 1619524089,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは何度も出てきますね。\n\nあなたの鍵ではなく、あなたのビットコインでもない。\n\nそして、たいていの場合、保管されているウォレットや取引所からあなたのコインをどのようにして盗むことができるかについての説明があります。\n保管されているウォレットや取引所からコインを盗む（窃盗）。そのコインが存在しないかもしれない（詐欺）とか\nあるいは、あなたがコインを管理していないということです。\n\n私はこれらの議論は...",
      "title": "鍵の管理が重要な理由(政治的リスク)"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我看到这个问题一次又一次地出现了。\n\n不是你的钥匙，不是你的比特币。\n\n然后是一个解释，通常是关于他们如何从一个\n保管的钱包或交易所（偷窃）。币可能根本就不存在（欺诈）。\n或者你是如何无法控制它们的。\n\n我觉得这些论点是...",
      "title": "为什么控制你自己的钥匙很重要（政治风险"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到這個問題一次又一次地出現了。\n\n不是你的鑰匙，不是你的比特幣。\n\n然後是一個解釋，通常是關於他們如何從一個\n保管的錢包或交易所（偷竊）。幣可能根本就不存在（欺詐）。\n或者你是如何無法控制它們的。\n\n我覺得這些論點是...",
      "title": "爲什麼控制你自己的鑰匙很重要（政治風險"
    }
  ],
  "title": "Why controlling your own keys is important(political risk)",
  "created_utc": 1619543595,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I see this come up again and again. </p>\n\n<p>Not your keys, not your bitcoin. </p>\n\n<p>And then a explanation, usually about how they could steal your coins from a custodial wallet or exchange(theft). How the coins maybe don’t even exist(fraud) or how you are not in control of them.</p>\n\n<p>I feel like these arguments are not convincing everyone. Big exchanges like Coinbase have a excellent track record of not loosing or stealing coins. Btc on robinhood might just be a entry in a database, but so are stocks these days. Every reasonable custodian will follow every lawful order of yours to the letter etc.</p>\n\n<p>The issue in my POV nowadays is political. Above I mentioned how every reasonable custodian will follow every lawful order of yours to the letter, but that’s just half the story. They will follow <strong>every</strong> lawful order, not just yours. And who decides what’s lawful? Politicians. </p>\n\n<p>This can have tax implications(transaction tax). Or regulatory implications(only allowing transfers to kyc aml known wallets). The more people have custodial crypto the more tempting such regulation becomes.</p>\n\n<p>This became very clear to me with the rise of a political party in my country which I hold not much trust in(not a US thing). With non custodial crypto I can vote with my feet if need be, my bitcoin will be wherever I am. With custodial crypto ... I have to worry. Will they allow outgoing transfers? Do I have to pay a exit tax? What if it gets seized due to some crisis because it’s over whatever amount your allowed to own(see greece and financial crisis).</p>\n\n<p>With custodial crypto you are dependent on the justice of future governments. 300k in crypto? 10% solidarity surcharge. Living in a self used house worth 400k? You are fine. <strong>They</strong> decide what is fair and just, like they do now. I can’t visit my friends, because that spreads corona and my rights don’t matter. But visiting 15 different families every day because my boss wants to earn money is fine because it’s work.</p>\n\n<p>If you don’t hold your keys... you <strong>depend</strong> on the sense of justice and freedom of others instead of your own. And you risk the most basic right of them all, to go away from where you are no longer welcome.</p>\n</div><!-- SC_ON -->",
  "score": 327,
  "permalink": "/r/Bitcoin/comments/mzmne5/why_controlling_your_own_keys_is/",
  "subreddit": "Bitcoin",
  "id": "mzmne5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776205693
}