{
  "author": "SadSam7",
  "original_created_utc": 1632977187,
  "title": "Has Anyone Bought Bitcoin at a Ridiculously Low Price and Actually Managed to Hold Up to This Point?",
  "created_utc": 1633001489,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>One of the things you’ll hear most in the crypto space is people ask themselves “what if I had bought BTC back when it was $100, $10, $1, etc,” and not just BTC, but any number of coins or tokens. Obviously, with the price of BTC where it is now, it’s hard to imagine that it was ever as low as the examples I gave, let alone that people actually bought and owned BTC at those prices. Yet, for BTC to have come this far, people had to have been buying, mining, and utilizing BTC since its inception when it was below even a dollar.</p>\n\n<p>With this in mind, is there anyone in this sub that actually managed to buy/mine BTC (or really any crypto), at a very low price relative to where it is now, and actually continued to hold despite the gains?</p>\n\n<p>Stories of paper handing away low Dollar Cost Averages are also appreciated.</p>\n</div><!-- SC_ON -->",
  "score": 192,
  "permalink": "/r/CryptoCurrency/comments/pycn4e/has_anyone_bought_bitcoin_at_a_ridiculously_low/",
  "subreddit": "CryptoCurrency",
  "id": "pycn4e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "One of the things you’ll hear most in the crypto space is people ask themselves\n“what if I had bought BTC back when it was $100, $10, $1, etc,” and not just\nBTC, but any number of coins or tokens. Obviously, with the price of BTC where\nit is now, it’s hard to imagine that it was ever as low as the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号の世界でよく耳にするのは、「もしBTCを買っていたら」という質問です。\n「BTCが100ドル、10ドル、1ドルなどのときに買っていたらどうだっただろう」というものです。\nBTCに限らず、さまざまなコインやトークンがあります。明らかに、BTCの価格が現在のような状態では\nもちろん、現在のBTCの価格では、かつてこれほど低かったとは想像できませんが...。",
      "title": "ビットコインをとんでもない安値で買って、実際にここまで持ちこたえた人はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在加密货币领域，你会听到最多的一件事是人们问自己\n\"如果我在BTC是100美元、10美元、1美元等的时候买了它，会怎么样呢？\n不仅仅是BTC，而是任何数量的硬币或代币。显然，随着BTC的价格在\n显然，随着BTC的价格现在的位置，很难想象它曾经像现在这样低。",
      "title": "有没有人以可笑的低价买入比特币，并真正能坚持到现在？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在加密貨幣領域，你會聽到最多的一件事是人們問自己\n\"如果我在BTC是100美元、10美元、1美元等的時候買了它，會怎麼樣呢？\n不僅僅是BTC，而是任何數量的硬幣或代幣。顯然，隨着BTC的價格在\n顯然，隨着BTC的價格現在的位置，很難想象它曾經像現在這樣低。",
      "title": "有沒有人以可笑的低價買入比特幣，並真正能堅持到現在？"
    }
  ]
}