{
  "author": "americanah22",
  "the_new_excerpt": "First I want you all to understand that Musk is not one of us. The fact he post\nmemes on twitter doesn't make him different from other greedy billionaires.\n\nThe cryptocurrency market is all a game to Musk. He really doesn't give a shit\nabout it.\n\nHe already set a precedent and showed the entire…",
  "original_created_utc": 1620860487,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "まず皆さんにご理解いただきたいのは、Muskは私たちの仲間ではないということです。ツイッターでミームを投稿したからといって\n貪欲な億万長者とは違うということです。\n\n暗号通貨市場は、Muskにとってはすべてゲームです。彼は本当に何とも思っていません。\n彼は本当にどうでもいいと思っています。\n\n彼はすでに前例を作り、全世界に...",
      "title": "暗号通貨業界はイーロン・マスク氏に力を与えすぎて、私たちを苦しめています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "首先，我希望你们都明白，马斯克不是我们中的一员。事实上，他在Twitter上发布\n他在Twitter上发布的备忘录并没有使他与其他贪婪的亿万富翁不同。\n\n加密货币市场对马斯克来说都是一场游戏。他真的不关心\n关于它。\n\n他已经开创了一个先例，向整个...",
      "title": "加密货币社区给了埃隆-马斯克太多的权力，它伤害了我们。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，我希望你們都明白，馬斯克不是我們中的一員。事實上，他在Twitter上發佈\n他在Twitter上發佈的備忘錄並沒有使他與其他貪婪的億萬富翁不同。\n\n加密貨幣市場對馬斯克來說都是一場遊戲。他真的不關心\n關於它。\n\n他已經開創了一個先例，向整個...",
      "title": "加密貨幣社區給了埃隆-馬斯克太多的權力，它傷害了我們。"
    }
  ],
  "title": "The cryptocurrency Community gave too much power to Elon Musk and its hurting us.",
  "created_utc": 1620869072,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>First I want you all to understand that Musk is not one of us. The fact he post memes on twitter doesn&#39;t make him different from other greedy billionaires.</p>\n\n<p>The cryptocurrency market is all a game to Musk. He really doesn&#39;t give a shit about it.</p>\n\n<p>He already set a precedent and showed the entire world how ridiculous the idea of cryptocurrency is when he pumped doge to 70cents.</p>\n\n<p>I repeat Musk is not one of us. This is all a game to him.</p>\n\n<p>We gave him so much power and he has destroyed the market by pumping meme coins. Now meme coins are pumping even more than coins with actual case use.</p>\n\n<p>The final straw is the tweet about bitcoin mining energy problems. That&#39;s bullshit. I&#39;m not a genius but I&#39;ve known since 2017 about the energy problems with bitcoin mining. How come is Elon Musk just finding out after he has made huge profit.</p>\n\n<p>I really wish this would end Elon Musk&#39;s influence on the market.</p>\n\n<p>Edit : I bet he short bitcoin before putting out that tweet</p>\n</div><!-- SC_ON -->",
  "score": 1308,
  "permalink": "/r/CryptoCurrency/comments/nb20my/the_cryptocurrency_community_gave_too_much_power/",
  "subreddit": "CryptoCurrency",
  "id": "nb20my",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985993631
}