{
  "author": "atc2017",
  "the_new_excerpt": "TLDR (because I hate it when they are at the end) – I build a model that\nenriches investors’ intuition with AI and alternative data. For example if\nexperience taught an investor that TSMC (Taiwanese semiconductor stock) is\ndriven by Tech, tension between US-China, news on Taiwan and consumer…",
  "original_created_utc": 1622036489,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "TLDR（最後にあると嫌なので） - I build a model that is enriched investors with AI and alternative data.\n投資家の直観をAIと代替データで豊かにするモデルを構築しています。例えば、もし\nTSMC(台湾の半導体株)はハイテク、米中の緊張、台湾のニュース、台湾のニュースに左右されると経験から学んだ投資家がいたとします。\n技術、米中の緊張、台湾や消費者に関するニュースなどに左右されると経験的に分かっていたとします。",
      "title": "株式市場の投資家の勘をビッグデータとAIで補うモデルを構築します"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "TLDR（因为我讨厌把它们放在最后）--我建立了一个模型，用人工智能和替代数据丰富投资者的直觉。\n用人工智能和替代数据丰富投资者的直觉。例如，如果\n经验告诉投资者，台积电（台湾半导体股票）是由科技、中美之间的紧张关系、台湾和消费者的新闻驱动的。\n受科技、中美关系紧张、台湾和消费者的新闻驱动......",
      "title": "我建立一个模型，用大数据和人工智能补充股市投资者的直觉"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "TLDR（因爲我討厭把它們放在最後）--我建立了一個模型，用人工智能和替代數據豐富投資者的直覺。\n用人工智能和替代數據豐富投資者的直覺。例如，如果\n經驗告訴投資者，臺積電（臺灣半導體股票）是由科技、中美之間的緊張關係、臺灣和消費者的新聞驅動的。\n受科技、中美關係緊張、臺灣和消費者的新聞驅動......",
      "title": "我建立一個模型，用大數據和人工智能補充股市投資者的直覺"
    }
  ],
  "title": "I build a model that supplements stock market investors’ intuition with big data and AI",
  "created_utc": 1622043768,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><em>TLDR (because I hate it when they are at the end) – I build a model that enriches investors’ intuition with AI and alternative data. For example if experience taught an investor that TSMC (Taiwanese semiconductor stock) is driven by Tech, tension between US-China, news on Taiwan and consumer behaviour narratives then we can point our model to those narratives in our dataset and it can learn to predict stock prices from those narratives. So it can learn for example if there is tension on Taiwan how that relates to future prices. In case someone has narratives they want to test (eg Oil, Middle-east, economy for the price of ExxonMobil) let me know and I will run the model and share the output dashboard.</em></p>\n\n<p>Example output: <a href=\"https://imgur.com/gGwFWPw\">https://imgur.com/gGwFWPw</a> (real dashboard is interactive but it is on a private server and im not sure whether its allowed to share the link)</p>\n\n<p>&#x200B;</p>\n\n<p>Alternative data and Machine Learning are gaining rapid traction in the investment industry. However AI and Machine learning still is not able to beat the market or most regular investors in a real life environment, even though the internet is full of articles predicting stock prices with 99% accuracy (overfitting is no joke). One can safely say there are domains where humans outperform AI and there are domains where it is the other way around. This also goes for investing. But why only use either human input or AI input when you can also combine them?</p>\n\n<p>In this post Ill try to explain how we build a model that uses both human intuition and AI in analysing the stock market, as well as some examples on how it works in practice. This will be followed up by more elaborate examples in subsequent articles. As said in case someone has a narrative they want to test let me know.</p>\n\n<p><strong>Where humans have the edge over AI— developing investment narratives</strong></p>\n\n<p>Academics are becoming increasingly convinced that narratives play a key role in explaining stock price movements (eg Robert Shiller — Narrative Economics, Andrew Lo-Adaptive Markets). Not so strange if you think about it, people have been storytellers for thousands of years and our brains are hardwired to build a narrative for everything we experience. The best stock pickers in the world are using narratives to make their plays, only they call their narratives investment theses, scenario’s or bets. The famous play George Soros made against the Bank of England basically was betting on a narrative, namely the narrative that the Bank of England would be able to keep supporting the British pound. Similarly tension in oil producing countries are narratives that move the price of ExxonMobil. Or narratives what the FED will do will move the entire SP500. Essentially when you start to think about it, narratives really matter.</p>\n\n<p>&#x200B;</p>\n\n<p>Humans are way better than AI in and telling stories and recognizing stories. A five year old can tell a coherent story whereas even the most sophisticated AI (eg GPT -3) still struggles with telling a random story, let alone recognizing one. Ask an investor what narrative will affect the stock price of Microsoft and he will instantly have some idea that it relates to tech, working from home (and therefore Covid developments) and cloud computing. AI does not have that intuition.</p>\n\n<p><strong>Where AI has the edge over humans — data and patterns</strong></p>\n\n<p>Humans can see the big picture, but AI can spot the details, and it can do it better and faster. I can write an AI script in one hour that can beat any human at the “Find Wally” game, no matter if they are trained to do it for decades. Similarly I can (and I did) write an AI script that is able to monitor any desired narrative. And where the average investor might be able to crunch several news sources per day, AI can monitor thousands within minutes. Moreover we programmed our AI to pick up meaningful and small differences in nuance of specific narratives that humans cannot detect. Additionally AI can assess whether narratives are discussed in a positive or negative tone. In this way we can see whether negative sentiment is developing on oil, or positive sentiment on interest rates, or controversy around working from home, or fear of negative economic data, or an increase in bullish sentiment within the manufacturing sector, or on any other narrative one can think of.</p>\n\n<p>Let humans find the narrative and let AI find the pattern</p>\n\n<p>Having established all that we set out to build a model where humans can supply the narrative (whether that is an investment thesis, stress-scenario or monitoring the new hype sector) and AI. Below is a brief explanation of the steps taken to build a narrative model, followed by an exemplary case study/example.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Human input</strong> → Which narratives are suspected to drive price. Experienced investors generally have a good sense on what news or narratives drive price. We can use this information to feed in to our model (see also the real life example further on).</p>\n\n<p><strong>Narrative-investing.io</strong> <strong>model AI input</strong> → deduce narrative time series from our alternative dataset (Financial Tweets, Financial headlines, Financial subreddits). This is done by:</p>\n\n<p>- Using our customized algorithm to assign a narrative to each headline or Tweet</p>\n\n<p>- Determine for each relevant headline (i.e. that is related to the narrative) its sentiment, emotional value etc by using a Machine Learning based sentiment/emotion classifier.</p>\n\n<p><strong>Narrative-investing.io</strong> <strong>model AI input</strong> → Analyse which narrative exposures are most important in explaining future price. We feed (lagged) price and our narrative time series to our model. From this our model can be trained on what narrative series are most important in explaining future price movements.</p>\n\n<p><strong>Narrative-investing.io</strong> <strong>model AI input</strong> → Having established a model we continuously keep monitoring how narratives develop and how this would influence future price movements. We do this by setting up a dashboard with all relevant metrics.</p>\n\n<p>We did this by leveraging our inhouse dataset of news websites, financial tweets and Reddit data. As with all things in live, it helps to describe this with an example;</p>\n\n<p><strong>A real life example</strong></p>\n\n<p>The investors’ intuition — Eg I know an investor in the semiconductor industry. Many years of experience taught him that the semiconductor industry is sensitive to various domains/narratives, from which he gave the following as input to our model:</p>\n\n<p>- Taiwan → Taiwan is one of the main semiconductor producing regions. Uncertainty on that region seems to affect the semiconductor market.</p>\n\n<p>- China US tension → Related to above, if there is tension between US and China it increases tension with respect to Taiwan.</p>\n\n<p>- Consumer → Consumers create demand for semiconductors. Positive narratives on consumers influence the semiconductor market.</p>\n\n<p>- Tech → Tech is heavily dependent on semiconductors and positive narratives on is reflected in the semiconductor market.</p>\n\n<p>- Economic factors → Finally all general economic narratives are also at play for the semiconductor business. So FED policy, investors emotions and all other economic related narratives are taken in to account.</p>\n\n<p>The narrative time series— From the ideas investors have we can let AI determine narrative time series from our alternative dataset of millions of tweets and headlines. We plotted a subset of our narratives against the stock market returns of TSMC stock (a large semiconductor company). Already you see there is some relation.</p>\n\n<p>&#x200B;</p>\n\n<p>Example of a narrative time series vs stock returns, see dashboard middle right chart (<a href=\"https://imgur.com/gGwFWPw\">https://imgur.com/gGwFWPw</a>)</p>\n\n<p>Determining the most important narratives — From all narratives given we can let our model analyse which narratives are most important for (future) returns.</p>\n\n<p>&#x200B;</p>\n\n<p>Most important narratives for TSM returns see dashboard middle chart (<a href=\"https://imgur.com/gGwFWPw\">https://imgur.com/gGwFWPw</a>)</p>\n\n<p>Here you see the top 10 most important narratives. For TSM this means that when consumer news gets more exposure that is an important indicator for future price. Almost as important as the sentiment on news on Taiwan (second row). This in turn is followed by negative exposure of consumer headlines.</p>\n\n<p>Monitoring narratives and run predictions — All these metrics (and many more) are then continuously updated on our dashboard. In this way the investors intuition can be quantified and monitored. Our engine and AI model is able to build time series for any narrative so all of our dashboard are unique and tailormade to the need of the investor or client. It helps them leveraging all their years of experience and intuition by means of our dataset and AI analyses.</p>\n\n<p>&#x200B;</p>\n\n<p>This in a nutshell explains how we tried to build a model that offers the best of both worlds, human intuition combined with the rigor and insight from AI. There are a lot more use cases for this model (spoiler, scenarios analyses, trend watching, theme investing) but for know this more than enough reading material I guess;)</p>\n</div><!-- SC_ON -->",
  "score": 66,
  "permalink": "/r/stocks/comments/nlhbrq/i_build_a_model_that_supplements_stock_market/",
  "subreddit": "stocks",
  "id": "nlhbrq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197389740
}