{
  "author": "BurntTurmoil",
  "original_created_utc": 1630006662,
  "title": "Does anyone else shit their pants when they send crypto anywhere?",
  "created_utc": 1630013432,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I happened to get a nice check from some back pay from work and my first reaction to it was to buy more crypto (obviously). So im on the exchange and i go to send it to my hard wallet and instant paranoia and anxiety per usual. Ive been sending crypto to different wallets since mid 2017 and it still makes my heart drop when i think its taking too long (more than 5 seconds). Does anyone actually grow use to the feeling of sending crypto from wallet to wallet and not thinking it’ll all disappear in the blink of an eye? I can’t imagine getting hacked for any amount of my bag, the thought of it gives me anxiety.</p>\n</div><!-- SC_ON -->",
  "score": 400,
  "permalink": "/r/CryptoCurrency/comments/pc6t4w/does_anyone_else_shit_their_pants_when_they_send/",
  "subreddit": "CryptoCurrency",
  "id": "pc6t4w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So I happened to get a nice check from some back pay from work and my first\nreaction to it was to buy more crypto (obviously). So im on the exchange and i\ngo to send it to my hard wallet and instant paranoia and anxiety per usual. Ive\nbeen sending crypto to different wallets since mid 2017 and it…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "たまたま仕事のバックペイで良い小切手をもらったので、最初の反応は、もっと暗号を買おうと思いました。\nその時の最初の反応は、暗号を買い足すことでした（当然）。それで、取引所に行って\nハードウォレットに送ろうとすると、いつものようにすぐにパラノイアと不安に襲われました。私はこれまで\n2017年半ばから様々なウォレットに暗号を送ってきましたが、それは...",
      "title": "暗号をどこかに送るとき、誰もがパンツを濡らしてしまうのでは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我碰巧从工作中得到了一张不错的支票，我的第一反应是购买更多的加密货币。\n对它的第一反应是购买更多的加密货币（很明显）。所以我在交易所，我\n去把它发送到我的硬钱包里，然后像往常一样，立即出现了偏执和焦虑的情绪。我已经\n自2017年中期以来，我一直在向不同的钱包发送加密货币，它...",
      "title": "还有人在向任何地方发送加密货币时拉裤子吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我碰巧從工作中得到了一張不錯的支票，我的第一反應是購買更多的加密貨幣。\n對它的第一反應是購買更多的加密貨幣（很明顯）。所以我在交易所，我\n去把它發送到我的硬錢包裏，然後像往常一樣，立即出現了偏執和焦慮的情緒。我已經\n自2017年中期以來，我一直在向不同的錢包發送加密貨幣，它...",
      "title": "還有人在向任何地方發送加密貨幣時拉褲子嗎？"
    }
  ]
}