{
  "author": "Some1fromReddit",
  "original_created_utc": 1636383987,
  "title": "Nobody seems to mention the market's new ATH includes over $500,000,000,000 in Shitcoins.",
  "created_utc": 1636400300,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Nobody seems to mention the fact that one day Shitcoin market will be worth more than $1,000,000,000,000. </p>\n\n<p>That means right now, if Shitcoins were a country, it&#39;s net worth is big enough to be listed in the top 50 most valuable countries not for GDP, but for total net worth. </p>\n\n<p>Let&#39;s think about how a leaders of countries feel about this. </p>\n\n<p>140 World leaders are reminded that...</p>\n\n<ul>\n<li><p>Shitcoins are worth more than their country</p></li>\n<li><p>People are more interested in shitcoins than their own homeland.</p></li>\n<li><p>Shitcoins are worth so much that they even took steps to invest in their own shitcoin before solving their countries child hunger rates.</p></li>\n</ul>\n\n<p>When all these facts come to realization for the general populous, they are going to know how Fked this world really is.    Forget about religion,  Investors are living the way of their own book. The Shitcoin Bible with a picture of SHlB on the front of it where everyone congregates to sing the gospel of Carlos Matos.</p>\n</div><!-- SC_ON -->",
  "score": 253,
  "permalink": "/r/CryptoCurrency/comments/qpfjar/nobody_seems_to_mention_the_markets_new_ath/",
  "subreddit": "CryptoCurrency",
  "id": "qpfjar",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Nobody seems to mention the fact that one day Shitcoin market will be worth more\nthan $1,000,000,000,000.\n\nThat means right now, if Shitcoins were a country, it's net worth is big enough\nto be listed in the top 50 most valuable countries not for GDP, but for total\nnet worth.\n\nLet's think about how a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "いつの日かShitcoin市場が10億ドル以上の価値を持つようになるという事実には誰も言及しないようだ。\n誰も言及していないようですが、いつの日かShitcoin市場は10億ドル以上の価値を持つようになるでしょう。\n\nつまり、今現在、Shitcoinが国だとしたら、その純資産は上場できるほど大きいのです。\n今、Shitcoinを国に例えると、GDPではなく、純資産総額で、最も価値のある国のトップ50に入るほどの大きさです。\n純資産の額です。\n\nここで考えてみましょう...",
      "title": "市場の新しいATHには、500,000,000,000ドル以上のShitcoinsが含まれていることに誰も言及しないようです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "似乎没有人提到这样一个事实：有一天，屎币市场的价值将超过\n超过1,000,000,000美元。\n\n这意味着现在，如果屎币是一个国家，它的净价值足以\n足够被列入前50个最有价值的国家，不是因为GDP，而是因为总的\n净值。\n\n让我们想一想，一个...",
      "title": "似乎没有人提到市场的新ATH包括超过500,000,000,000美元的屎币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "似乎沒有人提到這樣一個事實：有一天，屎幣市場的價值將超過\n超過1,000,000,000美元。\n\n這意味着現在，如果屎幣是一個國家，它的淨價值足以\n足夠被列入前50個最有價值的國家，不是因爲GDP，而是因爲總的\n淨值。\n\n讓我們想一想，一個...",
      "title": "似乎沒有人提到市場的新ATH包括超過500,000,000,000美元的屎幣。"
    }
  ]
}