{
  "author": "CoffeeDealer99",
  "original_created_utc": 1635994422,
  "title": "How to get a job as a convicted felon?",
  "created_utc": 1636073345,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Im 21 about to be 22 and during the first wave of covid i was self employed working detailing but winter is here and i need to find a job since i live in TN. I was convicted for possession of psilocybin and cause i had a scale got accused of trying to sell, i  went with my public defend plea and well im stupid for that but besides the point, i have applied for about 15 jobs since the past 2 months now entering the third month of November and i cant land a job, last place was Advanced auto parts and they ended up just sending me a letter saying because of my felony they weren’t going to hire me. Im running low on funds and the clock is ticking. Im also not trying to work some place paying minimum since in TN you need about 14/hr to get by on your own</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TrueAskReddit/comments/qmb66a/how_to_get_a_job_as_a_convicted_felon/",
  "subreddit": "TrueAskReddit",
  "id": "qmb66a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Im 21 about to be 22 and during the first wave of covid i was self employed\nworking detailing but winter is here and i need to find a job since i live in\nTN. I was convicted for possession of psilocybin and cause i had a scale got\naccused of trying to sell, i went with my public defend plea and well…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は21歳でもうすぐ22歳になりますが、Covidの最初の波の時は自営業をしていました。\n仕事をしていましたが、冬が来て、テネシー州に住んでいるので仕事を探さなければなりません。\nTN州に住んでいます。私はシロシビンの所持で有罪判決を受け、体重計を持っていたため、販売しようとしたと非難されました。\n秤を持っていたので、販売しようとしたと非難されました。私は公的な弁護活動を行いました。",
      "title": "前科者として仕事を得るには？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是21岁，即将年满22岁，在第一波covid浪潮中，我是自雇的。\n但冬天来了，我需要找一份工作，因为我住在田纳西州。\n田纳西州。我因持有迷幻药而被定罪，由于我有一个秤，被指控试图出售。\n我被指控试图出售，我做了公共辩护，然后......",
      "title": "作为一个被定罪的重罪犯，如何获得一份工作？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是21歲，即將年滿22歲，在第一波covid浪潮中，我是自僱的。\n但冬天來了，我需要找一份工作，因爲我住在田納西州。\n田納西州。我因持有迷幻藥而被定罪，由於我有一個秤，被指控試圖出售。\n我被指控試圖出售，我做了公共辯護，然後......",
      "title": "作爲一個被定罪的重罪犯，如何獲得一份工作？"
    }
  ]
}