{
  "author": "TheSqueezeHasSquozen",
  "the_new_excerpt": "Edit: thanks for the awards :)\n\nI swear I’m not being paid to advertise. I have been using the Yahoo Finance\nwebsite for the last while to keep track of some of my stocks (the ones I can’t\nget through my main broker because TD’s way of displaying data is needlessly\nconvoluted).\n\nI just decided to…",
  "original_created_utc": 1616555590,
  "localize": [
    {
      "locale": "zh",
      "title": "小贴士：雅虎金融(App)真厉害!",
      "the_new_excerpt": "我发誓我没有被收钱做广告。我一直在使用雅虎金融\n在过去的一段时间里，我一直在网站上跟踪我的一些股票（那些我不能接受的股票）。\n通过我的主要经纪人，因为TD的显示数据的方式是不必要的。\n错综复杂的）。)\n\n我刚刚决定在IOS上下载这个应用，它..."
    },
    {
      "locale": "zh-Hant",
      "title": "小貼士：雅虎金融(App)真厲害!",
      "the_new_excerpt": "我發誓我沒有被收錢做廣告。我一直在使用雅虎金融\n在過去的一段時間裏，我一直在網站上跟蹤我的一些股票（那些我不能接受的股票）。\n通過我的主要經紀人，因爲TD的顯示數據的方式是不必要的。\n錯綜複雜的）。)\n\n我剛剛決定在IOS上下載這個應用，它..."
    }
  ],
  "title": "Tip: Yahoo Finance (App) Is Awesome!",
  "created_utc": 1616564279,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Edit: thanks for the awards :)</p>\n\n<p>I swear I’m not being paid to advertise. I have been using the Yahoo Finance website for the last while to keep track of some of my stocks (the ones I can’t get through my main broker because TD’s way of displaying data is needlessly convoluted).</p>\n\n<p>I just decided to download the app on IOS and it blew my mind because it put everything in one place.</p>\n\n<p>It lets you add a list of your favourite tickers so you can see them all on the same page in real time.</p>\n\n<p>After you create a list by adding your favourite stocks you can click on “list details” and there is even a customizable table where you can decide which details you want to see for your stocks (52 week high, day high, day low, volume, avg volume etc).</p>\n\n<p>It also lists upcoming earnings reports for your favourite stocks.</p>\n\n<p>And if you scroll down on any page it lists news articles related to the stocks on your list as well.</p>\n\n<p>Now, instead of doing frequent searches for all the stocks I’m following to get updates I can just sit back and let it all roll in (I’m still going to cross reference for a while because I don’t know how accurate they are).</p>\n\n<p>This is probably a bit random and I’m sure there are more experienced people who will scoff at this but it just made my day.</p>\n</div><!-- SC_ON -->",
  "score": 1656,
  "permalink": "/r/stocks/comments/mbw5zv/tip_yahoo_finance_app_is_awesome/",
  "subreddit": "stocks",
  "id": "mbw5zv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752822099
}