{
  "author": "OnLY399_",
  "the_new_excerpt": "Earlier this year. Probably the first week of 2021 I bought a small amount of\nEthereum and Bitcoin. My dad has invested in the stock market for centuries so\nof course my proud ass went to him “I made 5% profits today”.\n\nHe started being quite mad and couldn’t understand I was that dumb to buy…",
  "original_created_utc": 1613597601,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "本年早些时候。大概是2021年的第一周，我买了少量的。\nEthereum和比特币。我爸爸在股市投资了几个世纪，所以...\n当然，我骄傲的屁股去找他 \"我今天赚了5%的利润\"。\n\n他开始很生气，不明白我那么笨，买...",
      "title": "我很高兴我决定购买加密货币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "本年早些時候。大概是2021年的第一週，我買了少量的。\nEthereum和比特幣。我爸爸在股市投資了幾個世紀，所以...\n當然，我驕傲的屁股去找他 \"我今天賺了5%的利潤\"。\n\n他開始很生氣，不明白我那麼笨，買...",
      "title": "我很高興我決定購買加密貨幣。"
    }
  ],
  "title": "Im so glad i decided to buy crypto",
  "created_utc": 1613608247,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Earlier this year. Probably the first week of 2021 I bought a small amount of Ethereum and Bitcoin. My dad has invested in the stock market for centuries so of course my proud ass went to him “I made 5% profits today”. </p>\n\n<p>He started being quite mad and couldn’t understand I was that dumb to buy into this big scam. But after some talking and explaining he decided that “ok get me in too”. He gave me a chunk of money and told me to buy the best internet coins I knew. I began reading about crypto 24 hours straight for 2 whole days because you can bet your ass I was going to impress the sh*t out of him.</p>\n\n<p>After long research I decided on ADA, ATOM, ETH, XLM and BTC. I told him about every one of them and why I choose them and he seemed genuinely interested. In the first week our portfolio did +21%. Safe to say he was very impressed.</p>\n\n<p>Everyday since we’ve been talking crypto daily and I don’t think I’ve ever talked this much to my dad. Today our portfolio is up a total 104% in just over a month which is better than anything he’s ever done. He is very proud and I’m very happy that he is.</p>\n\n<p>Thank you to all of you guys who’ve helped me pick the coins and getting started. You probably don’t know it but you’ve helped me so much.</p>\n\n<p>Thank you all, god bless you :)</p>\n</div><!-- SC_ON -->",
  "score": 2786,
  "permalink": "/r/CryptoCurrency/comments/lm5b4s/im_so_glad_i_decided_to_buy_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "lm5b4s",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728620224
}