{
  "author": "electricp0ww0w",
  "the_new_excerpt": "I really don't understand this shit.\n\nAll the time now, a company performs well and the stock price drops because of\nit. Take Lowe's today for example. It blasted earnings. It literally doubled\nthem. 8th earnings in a row it has smashed, and today it's down. Literally, you\nhave a company coining it…",
  "original_created_utc": 1621446779,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はこのクソを本当に理解していない。\n\n今では、ある会社の業績が良くて、そのために株価が下がるということがよくあります。\nします。今日のロウズを例にとってみましょう。最高の業績でした。文字通り2倍になりました。\n倍にしました。8回連続で収益を上げましたが、今日は下がってしまいました。文字通り、あなたは\nある会社がそれを造語として使っています...",
      "title": "なぜ業績が重要でなくなり、市場全体がポンプ＆ダンプに次ぐポンプ＆ダンプになっているのか、誰か説明できますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我真的不明白这个狗屎。\n\n现在所有的时间，一个公司表现良好，而股票价格却因此而下跌\n它。以Lowe's今天为例。它的收益爆棚。它实际上是翻了一番\n他们。它已经连续第8次盈利了，而今天它又下跌了。从字面上看，你\n有一家公司创造了它...",
      "title": "谁能解释一下为什么收益不再重要，而整个市场只是一个又一个的抽水机和抽水机？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我真的不明白這個狗屎。\n\n現在所有的時間，一個公司表現良好，而股票價格卻因此而下跌\n它。以Lowe's今天爲例。它的收益爆棚。它實際上是翻了一番\n他們。它已經連續第8次盈利了，而今天它又下跌了。從字面上看，你\n有一家公司創造了它...",
      "title": "誰能解釋一下爲什麼收益不再重要，而整個市場只是一個又一個的抽水機和抽水機？"
    }
  ],
  "title": "Can anyone explain why earnings no longer matter, and the entire market is just pump&dump after pump&dump?",
  "created_utc": 1621452635,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I really don&#39;t understand this shit.</p>\n\n<p>All the time now, a company performs well and the stock price drops because of it. Take Lowe&#39;s today for example. It blasted earnings. It literally doubled them. 8th earnings in a row it has smashed, and today it&#39;s down. Literally, you have a company coining it in, and the share price is dropping. (I dont own it btw, so this isn&#39;t a rant on that basis)</p>\n\n<p>I know the argument is &quot;ThE WhoLE MaRkEt Is DoWn&quot;. Sorry, no, I don&#39;t buy this bullshit.</p>\n\n<p>Let&#39;s look at todays winners;</p>\n\n<p>Advaxis is the 2nd biggest gainer today and is up 21%. It&#39;s a garbage fucking pennystock that trades at 0.58 cents. Even worse, it&#39;s a bullshit pharma stock. Normal volume is 6 million. Volume today - 166 million. There is no news to justify this interest</p>\n\n<p>Mosys is the big winner so far, up 33%. Another bullshit $5 stock. Normal volume is 2 mil. No news, but today the volume is 30x the norm.</p>\n\n<p>LifeMD has had lawsuits filed against it today, about claims its directors have comitted fraud. Even better;</p>\n\n<p><strong>LifeMD appears to use unlicensed doctors to dispense OTC medications, has implemented an autoshipping/autobilling scheme, failed to honor guarantees, and put in place abusive telemarketing practices.</strong></p>\n\n<p>So what does the stock do in response to this? Of course, it jumps 12%.</p>\n\n<p>To end my rant, the 3rd placed highest today is another bullshit company, a Chinese medical company called Lianluo Smart. There&#39;s one single news article linking it to a takeover by newegg or something, the news article made little sense. Low and behold, normal volume is 400k, today it&#39;s 9 million. Even if the news is to be believed, this one single article was posted 1 hour ago, yet the price suddenly spiked 2 hours ago.</p>\n\n<p>So, why do companies that do well, make money, smash earnings lose their stock value, and bullshit, nonsense companies get P&amp;D so much. This is a daily occurance. Every single day I see a new company increasing its share price by 50%+ and it&#39;s nonsense. I thought P&amp;D&#39;s were illegal.</p>\n\n<p>I&#39;m losing (lost tbh) all faith in the market and it feels more and more like a (rigged) casino every day now.</p>\n</div><!-- SC_ON -->",
  "score": 9167,
  "permalink": "/r/stocks/comments/ngcedr/can_anyone_explain_why_earnings_no_longer_matter/",
  "subreddit": "stocks",
  "id": "ngcedr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590804461
}