{
  "approved_at_utc": null,
  "subreddit": "wallstreetbets",
  "selftext": "My dumbass son (who is like 15) thinks he knows more than I learned in my 4 year MBA from Georgia Tech. I literally took Venture Capital and Investments three times each (4 semesters apart) so you know that I know my shit better than some idiot who only took those classes once and probably forgot everything after the final.\n\n&amp;#x200B;\n\nNow my kid is very well-meaning, so don't insult that son of a bitch, but he keeps telling me to invest in index funds. In-dicks my ASS. SPY is down 10% YTD, and I made already made 10.89% this month accidentally buying $BBY instead of $BBBY. Making 11% on accident? I'm a god of technical analysis (I can tell that BBY is going up by looking at the 1 month chart, for example) and holding through a bad investment. My soon keeps fixating on \"he's up 1% this year\" when he should focus on my 10% gains this month instead of looking at the broader picture (because that picture also includes some bad months where I lost money even though I made good trades because Ken and the other hedges personally tapped my phone and short laddered the fuck out of me which my son doesn't even know are real).\n\nHe tells me that most traders will lose money (then how come I made 10% in a month alone) but has he even seen the kind of gain porn that's posted here. I study WSB DD thoroughly every night. I come freshly awake to the daily threads where I enthusiastically post\n\n# OPEN THE FUCKING CASINO\n\nYou really think I don't know what I'm doing? I know this is a casino and I like it.\n\nI've had erectile disfunction since I was 19 and discovered porn, but WSB gain porn gives me five and a half hour long erections every fucking trading day. My wife is finally happy (but don't tell her about my portfolio because I'm trying to surprise her with a pink Lambo this September 1st as a happy new month present when BBBY will surely moon). I have fully assimilated within the WSB culture and have done all my due diligence and it is only a statistical inevitability that I will, therefore, receive the bounty of tendies and lambos as soon as BBY moons. Once it moons, I'll pay for my kid's education (so he can fuck off and leave me alone) and proceed to YOLO.\n\n# DO I LOOK LIKE A GUY WITHOUT A PLAN?\n\nI made 10.89% in a month when the market is down 10% in a YEAR? That's a 1282% OUTPERFORMANCE RATIO (Quick maths: (10.89\\*10/31\\*365) = 1282%), which is a term I coined in my MBA thesis class (which I later found out wasn't a real class but a frat attempting to haze me, which I found out wasn't a real frat because they're only for undergrads...it was an enlightening experience). The MBA was for shits and giggles anyway, and I don't use it much in my \"job\" as a data scientist (I just do technical analysis in 3D, so line up is good and that's all I know) but I'm about to leave and YOLO full-time. I even bought an elite trading setup: used 11\" MacBook Air from 2017 (to save money on tech and YOLO it instead) and since it's small, I'm always on WSB and Robinhood wherever I am.\n\nI have about $300k to YOLO, and can you imagine how many Lambos you can get for $300k\\*1282% (which is approx 3.846 BILLION dollars before tax).\n\nThis kid reads from some idiots like John Beagle and Peter Link, and some fucker named Gram. It's so easy to \"read\" all this \"wisdom\" after all the action has happened. I?? I was here (on an alt account since I got banned as I promised to eat my wife’s cum if GME mooned over $10 and didn’t have the balls to) watching DFV post his meat LIVE while GME rocketed. I made a 10000% return back then (in my paper trading account because I was a bigger pussy than my son back then). Not any more. I will go to the fucking MOON with BBY.\n\nMy next move is to make a trading bot to make my tendies for me. I'm now learning a very advanced programming language called HTML (more letters is more complex for those of you who don’t know computers like I do) and when I'm done I will have a killer bot ready to fuck all your puts.\n\nAnyway...didn't mean to rant but since this is flaired a \"discussion\" I guess my question is: how do you YOLO in peace?\n\n&amp;#x200B;\n\n**tl;dr:** Sun dumb and I smart. Want YOLO in silence for lambos.",
  "author_fullname": "t2_55okfyrj",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 1,
  "clicked": false,
  "title": "My idiot son is \"concerned\" about my portfolio and won't let me YOLO in peace",
  "link_flair_richtext": [
    {
      "e": "text",
      "t": "Shitpost"
    }
  ],
  "subreddit_name_prefixed": "r/wallstreetbets",
  "hidden": false,
  "pwls": 7,
  "link_flair_css_class": "shitpost",
  "downs": 0,
  "thumbnail_height": null,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_wpe1ls",
  "quarantine": false,
  "link_flair_text_color": "light",
  "upvote_ratio": 0.92,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 1249,
  "total_awards_received": 3,
  "media_embed": {},
  "thumbnail_width": null,
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Shitpost",
  "can_mod_post": false,
  "score": 1249,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": true,
  "thumbnail": "self",
  "edited": 1660636702,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {
    "gid_1": 1,
    "gid_2": 1
  },
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1660605246,
  "link_flair_type": "richtext",
  "wls": 7,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.wallstreetbets",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My dumbass son (who is like 15) thinks he knows more than I learned in my 4 year MBA from Georgia Tech. I literally took Venture Capital and Investments three times each (4 semesters apart) so you know that I know my shit better than some idiot who only took those classes once and probably forgot everything after the final.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Now my kid is very well-meaning, so don&amp;#39;t insult that son of a bitch, but he keeps telling me to invest in index funds. In-dicks my ASS. SPY is down 10% YTD, and I made already made 10.89% this month accidentally buying $BBY instead of $BBBY. Making 11% on accident? I&amp;#39;m a god of technical analysis (I can tell that BBY is going up by looking at the 1 month chart, for example) and holding through a bad investment. My soon keeps fixating on &amp;quot;he&amp;#39;s up 1% this year&amp;quot; when he should focus on my 10% gains this month instead of looking at the broader picture (because that picture also includes some bad months where I lost money even though I made good trades because Ken and the other hedges personally tapped my phone and short laddered the fuck out of me which my son doesn&amp;#39;t even know are real).&lt;/p&gt;\n\n&lt;p&gt;He tells me that most traders will lose money (then how come I made 10% in a month alone) but has he even seen the kind of gain porn that&amp;#39;s posted here. I study WSB DD thoroughly every night. I come freshly awake to the daily threads where I enthusiastically post&lt;/p&gt;\n\n&lt;h1&gt;OPEN THE FUCKING CASINO&lt;/h1&gt;\n\n&lt;p&gt;You really think I don&amp;#39;t know what I&amp;#39;m doing? I know this is a casino and I like it.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve had erectile disfunction since I was 19 and discovered porn, but WSB gain porn gives me five and a half hour long erections every fucking trading day. My wife is finally happy (but don&amp;#39;t tell her about my portfolio because I&amp;#39;m trying to surprise her with a pink Lambo this September 1st as a happy new month present when BBBY will surely moon). I have fully assimilated within the WSB culture and have done all my due diligence and it is only a statistical inevitability that I will, therefore, receive the bounty of tendies and lambos as soon as BBY moons. Once it moons, I&amp;#39;ll pay for my kid&amp;#39;s education (so he can fuck off and leave me alone) and proceed to YOLO.&lt;/p&gt;\n\n&lt;h1&gt;DO I LOOK LIKE A GUY WITHOUT A PLAN?&lt;/h1&gt;\n\n&lt;p&gt;I made 10.89% in a month when the market is down 10% in a YEAR? That&amp;#39;s a 1282% OUTPERFORMANCE RATIO (Quick maths: (10.89*10/31*365) = 1282%), which is a term I coined in my MBA thesis class (which I later found out wasn&amp;#39;t a real class but a frat attempting to haze me, which I found out wasn&amp;#39;t a real frat because they&amp;#39;re only for undergrads...it was an enlightening experience). The MBA was for shits and giggles anyway, and I don&amp;#39;t use it much in my &amp;quot;job&amp;quot; as a data scientist (I just do technical analysis in 3D, so line up is good and that&amp;#39;s all I know) but I&amp;#39;m about to leave and YOLO full-time. I even bought an elite trading setup: used 11&amp;quot; MacBook Air from 2017 (to save money on tech and YOLO it instead) and since it&amp;#39;s small, I&amp;#39;m always on WSB and Robinhood wherever I am.&lt;/p&gt;\n\n&lt;p&gt;I have about $300k to YOLO, and can you imagine how many Lambos you can get for $300k*1282% (which is approx 3.846 BILLION dollars before tax).&lt;/p&gt;\n\n&lt;p&gt;This kid reads from some idiots like John Beagle and Peter Link, and some fucker named Gram. It&amp;#39;s so easy to &amp;quot;read&amp;quot; all this &amp;quot;wisdom&amp;quot; after all the action has happened. I?? I was here (on an alt account since I got banned as I promised to eat my wife’s cum if GME mooned over $10 and didn’t have the balls to) watching DFV post his meat LIVE while GME rocketed. I made a 10000% return back then (in my paper trading account because I was a bigger pussy than my son back then). Not any more. I will go to the fucking MOON with BBY.&lt;/p&gt;\n\n&lt;p&gt;My next move is to make a trading bot to make my tendies for me. I&amp;#39;m now learning a very advanced programming language called HTML (more letters is more complex for those of you who don’t know computers like I do) and when I&amp;#39;m done I will have a killer bot ready to fuck all your puts.&lt;/p&gt;\n\n&lt;p&gt;Anyway...didn&amp;#39;t mean to rant but since this is flaired a &amp;quot;discussion&amp;quot; I guess my question is: how do you YOLO in peace?&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;tl;dr:&lt;/strong&gt; Sun dumb and I smart. Want YOLO in silence for lambos.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "d609e434-b97f-11ea-a39e-0ea715edff61",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2th52",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#7a5901",
  "id": "wpe1ls",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "wasabiEatingMoonMan",
  "discussion_type": null,
  "num_comments": 197,
  "send_replies": true,
  "whitelist_status": "some_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/wallstreetbets/comments/wpe1ls/my_idiot_son_is_concerned_about_my_portfolio_and/",
  "parent_whitelist_status": "some_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/wallstreetbets/comments/wpe1ls/my_idiot_son_is_concerned_about_my_portfolio_and/",
  "subreddit_subscribers": 12430503,
  "created_utc": 1660653719,
  "num_crossposts": 1,
  "media": null,
  "is_video": false,
  "original_created_utc": 1660605246,
  "the_new_excerpt": "My dumbass son (who is like 15) thinks he knows more than I learned in my 4 year\nMBA from Georgia Tech. I literally took Venture Capital and Investments three\ntimes each (4 semesters apart) so you know that I know my shit better than some\nidiot who only took those classes once and probably forgot…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の馬鹿息子（15歳）は、私が4年間で学んだ以上のことを知っていると思っています。\nジョージア工科大学でMBAを取得しました。私は文字通り、ベンチャーキャピタルと投資を3回受講しました。\nベンチャーキャピタルと投資をそれぞれ3回ずつ（4学期ずつ）受講しました。\n一度しか授業を受けず、おそらく忘れているようなバカより、僕の方がよく知っているはずだ...",
      "title": "バカ息子が私のポートフォリオを「心配」して、安心してYOLOさせてくれない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的蠢儿子（好像是15岁）认为他知道的比我在4年里学到的还多。\n在佐治亚理工学院学习的MBA课程。我从字面上看，风险投资和投资各上了三次课（相隔4个学期）。\n所以你知道我比那些只上过一次课而且可能忘记了的白痴更了解我的东西。\n那些只上过一次课，而且可能忘记了的白痴。",
      "title": "我的白痴儿子 \"关心 \"我的投资组合，不让我安静地做YOLO。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的蠢兒子（好像是15歲）認爲他知道的比我在4年裏學到的還多。\n在佐治亞理工學院學習的MBA課程。我從字面上看，風險投資和投資各上了三次課（相隔4個學期）。\n所以你知道我比那些只上過一次課而且可能忘記了的白癡更瞭解我的東西。\n那些只上過一次課，而且可能忘記了的白癡。",
      "title": "我的白癡兒子 \"關心 \"我的投資組合，不讓我安靜地做YOLO。"
    }
  ],
  "source_updated_at": 1660902362791
}