{
  "author": "IJustCameForTheBeer",
  "original_created_utc": 1630792384,
  "title": "Cashed out for the first time!",
  "created_utc": 1630816219,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Been a medium/long time hodler, watched and regretted never buying in when BTC was at $250… After watching the FOMO for years and buying into it only first in early 2018 Learned as much as I could, constant DCA, emotional ups and downs, you know the drill, I finally cashed out for the first time! </p>\n\n<p>What a relief! I only cashed out a small amount to purchase some steel bumpers for my new truck but still… </p>\n\n<p>I’ve always had the feeling that if I cash out I lost potential gains (and losses I guess). But honestly, these new bumpers are now on the way and it’s all from profit…</p>\n\n<p>Gonna feel good looking at my truck knowing I finally have something tangible from this wild space and all the time spent over the last few years!</p>\n\n<p>Cheers and hope you guys can feel the same when you pull some profits!</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/CryptoCurrency/comments/pi0hj8/cashed_out_for_the_first_time/",
  "subreddit": "CryptoCurrency",
  "id": "pi0hj8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Been a medium/long time hodler, watched and regretted never buying in when BTC\nwas at $250… After watching the FOMO for years and buying into it only first in\nearly 2018 Learned as much as I could, constant DCA, emotional ups and downs,\nyou know the drill, I finally cashed out for the first…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "中/長期のホドラーで、BTCが250ドルになった時に買わなかったことを後悔していました。\n何年もFOMOを見てきて、最初に買ったのがBTCだった。\nできる限りのことを学び、一定のDCA、感情的な浮き沈みを経験しました。\nその結果、私はついに最初の現金化をしました。",
      "title": "はじめての現金化"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个中度/长期持有者，观察并后悔没有在BTC处于250美元时买入。\n在观察了多年的FOMO之后，在2018年初才第一次买入。\n2018年初，我尽可能多地学习，不断的DCA，情绪起伏。\n你知道的，我终于第一次兑现了......",
      "title": "第一次兑现了!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一箇中度/長期持有者，觀察並後悔沒有在BTC處於250美元時買入。\n在觀察了多年的FOMO之後，在2018年初才第一次買入。\n2018年初，我儘可能多地學習，不斷的DCA，情緒起伏。\n你知道的，我終於第一次兌現了......",
      "title": "第一次兌現了!"
    }
  ]
}