{
  "author": "badlybarding",
  "original_created_utc": 1628277270,
  "title": "With such a high r0, why didn't measles just burn itself out?",
  "created_utc": 1628294038,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve seen speculation floating around the internet that we will get to herd immunity faster with the delta variant because it spreads so quickly, but I wonder even if that is the case, why didn&#39;t we develop enough herd immunity naturally for measles to simply burn itself out (for reference, measles has an r0 of 12-18 compared to the delta variant&#39;s 5-9.5). I guess I&#39;m generally curious as to why some viruses burn themselves out (or mutate to become far less deadly, like Spanish flu) but others do not. Thanks <a href=\"/r/askscience\">r/askscience</a>!</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/askscience/comments/ozdflz/with_such_a_high_r0_why_didnt_measles_just_burn/",
  "subreddit": "askscience",
  "id": "ozdflz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've seen speculation floating around the internet that we will get to herd\nimmunity faster with the delta variant because it spreads so quickly, but I\nwonder even if that is the case, why didn't we develop enough herd immunity\nnaturally for measles to simply burn itself out (for reference, measles…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "インターネット上では、デルタ・バリアントを使った方が集団免疫に早く到達できるという憶測を目にしました。\nデルタ型は拡散が早いので、集団免疫を獲得するのが早いのではないかという憶測をインターネットで見たことがあります。\nもしそうだとしても、なぜ自然に麻疹が消滅するほどの集団免疫を獲得できなかったのでしょうか？\n麻疹が自然に消滅するほどの集団免疫ができなかったのだろうか（参考までに、麻疹は...",
      "title": "こんなにR0が高いのに、なぜ麻疹は自然消滅しなかったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我看到互联网上流传着这样的猜测：我们将得到群居的\n群体免疫的速度，因为它的传播速度非常快。\n但我想知道，即使是这样，为什么我们没有发展出足够的群体免疫力？\n我们为什么没有自然地发展出足够的群体免疫力，让麻疹自行消亡（作为参考，麻疹...",
      "title": "在如此高的r0下，为什么麻疹没有自己烧掉？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到互聯網上流傳着這樣的猜測：我們將得到羣居的\n羣體免疫的速度，因爲它的傳播速度非常快。\n但我想知道，即使是這樣，爲什麼我們沒有發展出足夠的羣體免疫力？\n我們爲什麼沒有自然地發展出足夠的羣體免疫力，讓麻疹自行消亡（作爲參考，麻疹...",
      "title": "在如此高的r0下，爲什麼麻疹沒有自己燒掉？"
    }
  ]
}