{
  "author": "SweetPie123",
  "the_new_excerpt": "Ever since I got into crypto I've been fascinated about crypto history. I lived\nthrough the Mt.Gox times, seen Bitconnect arise and fall down, and of course the\nend of OneCoin. So far I managed to collect some of the coins that are part of\ncrypto history like Ethereum Classic, XRP, and some other…",
  "original_created_utc": 1609857308,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "自从我进入密码领域后，我就对密码历史着迷了。我活了下来\n在Mt.Gox时代，我们看到Bitconnect起起落落，当然还有\n一枚硬币的末尾。到目前为止，我设法收集了一些硬币，这些硬币是\n加密历史记录，如以太经典、xrp和其他一些…",
      "title": "我想买Bitconnect。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "自從我進入密碼領域後，我就對密碼歷史着迷了。我活了下來\n在Mt.Gox時代，我們看到Bitconnect起起落落，當然還有\n一枚硬幣的末尾。到目前爲止，我設法收集了一些硬幣，這些硬幣是\n加密歷史記錄，如以太經典、xrp和其他一些…",
      "title": "我想買Bitconnect。"
    }
  ],
  "title": "I want to buy Bitconnect.",
  "created_utc": 1609887763,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Ever since I got into crypto I&#39;ve been fascinated about crypto history. I lived through the Mt.Gox times, seen Bitconnect arise and fall down, and of course the end of OneCoin. So far I managed to collect some of the coins that are part of crypto history like Ethereum Classic, XRP, and some other smaller coins that either exit scammed or stopped producing blocks.</p>\n\n<p>One coin is however extremely hard to get my hands on, Bitconnect. Bitconnect hit a $3b marketcap in 2018 before plummeting near zero in a matter of days. So to say, there must be a lot of holders left from 2018 that didn&#39;t bother to move their coins anymore after they became worthless. Someone (didn&#39;t know if he likes to be tagged) let me know that Bitconnect still produces blocks, so it should still be possible to send it from one wallet to another.</p>\n\n<p>So if you know anyone that still has some Bitconnect or you hold some yourself, feel free to leave a comment. I&#39;m of course willing to compensate anyone that manages to get me some.</p>\n\n<p>To end this post in the spirits of Bitconnect:</p>\n\n<p>HEY HEY HEEEYYY WASSSA WASSA WASSSUP! BITCONNEEEECT!</p>\n</div><!-- SC_ON -->",
  "score": 280,
  "permalink": "/r/CryptoCurrency/comments/kqzk0n/i_want_to_buy_bitconnect/",
  "subreddit": "CryptoCurrency",
  "id": "kqzk0n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610100746079
}