{
  "author": "Nefarious_Partner",
  "the_new_excerpt": "Plenty of you degenerates have seen the interview from 2006 where Jim Cramer\ntalks about about stock manipulation being a \"fun game\" from his hedge fund\ndays. He goes as far as saying the SEC isn't smart enough to go after hedge\nfunds for fomenting, or feeding false news to the media to stir up…",
  "original_created_utc": 1612863554,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "你们这些堕落的人中有很多人看过2006年的采访，在那里，吉姆-克拉默\n从他的对冲基金谈到股票操纵是一个 \"有趣的游戏\"\n天。他竟然说美国证券交易委员会不够聪明，不愿意去追捕对冲基金\n煽动资金，或向媒体提供虚假新闻以煽动...",
      "title": "Cramer正在努力删除他在2006年采访中承认操纵证券的视频。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你們這些墮落的人中有很多人看過2006年的採訪，在那裏，吉姆-克拉默\n從他的對沖基金談到股票操縱是一個 \"有趣的遊戲\"\n天。他竟然說美國證券交易委員會不夠聰明，不願意去追捕對沖基金\n煽動資金，或向媒體提供虛假新聞以煽動...",
      "title": "Cramer正在努力刪除他在2006年採訪中承認操縱證券的視頻。"
    }
  ],
  "title": "Cramer is working hard to take down videos of his admission to securities manipulating in a 2006 interview",
  "created_utc": 1612877921,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Plenty of you degenerates have seen the interview from 2006 where Jim Cramer talks about about stock manipulation being a &quot;fun game&quot; from his hedge fund days. He goes as far as saying the SEC isn&#39;t smart enough  to go after hedge funds for fomenting, or feeding false news to the media to stir up uncertainty for retail. It&#39;s basically 11 minutes of him bragging about his past and saying that you won&#39;t make it if you don&#39;t employ illegal tactics. What does that tell you about how wide-spread this is in the industry? Now extrapolate that 15 years and here we are today.</p>\n\n<p>All the videos have since been taken down within the last day or two by The Street.</p>\n\n<p>&quot;What&#39;s important when you&#39;re in that hedge fund mode is to not do anything remotely truthful. Because the truth is so against your view, that it&#39;s important to create a new truth to develop a fiction. And, um, the fiction is developed by almost anybody who&#39;s down.&quot;</p>\n\n<p>Everyone have a good hard think about this. This guy&#39;s got coke sniffles while he spits in the face of the SEC and every retail investor in the stock market. He&#39;s allowed to continue without consequence, yet we see people like DeepFuckingValue getting railed in the media and being asked to testify because it fits the desired narrative even though the dude did nothing wrong and should be allowed to live peacefully.</p>\n\n<p>I met Jim Cramer over a decade ago. Can confirm he is a prick.</p>\n\n<p>EDIT: Here is a transcript of first 2 minutes 40 seconds of the interview if you can&#39;t watch the video (in comments). It goes on for another 8 but this should be enough for your ape attention spans:</p>\n\n<p><strong>A:</strong> Welcome to Wallstreet Confidential, I&#39;m Aaron Tass(?), joined again by Jim Cramer. Jim, Welcome</p>\n\n<p><strong>Cramer:</strong> Good to see ya.</p>\n\n<p><strong>A:</strong> Thanks for being here. Uh, so, economic data out today but wanna talk about something else first. Again today we have the misdirection from the futures. The futures pointing up in market. as of right now it&#39;s actually down again. Is this just because it&#39;s the holiday period that we&#39;re seeing this?</p>\n\n<p><strong>Cramer:</strong> You know, a lot of times when I was short at my hedge fund, and I was position short, meaning I needed it down, I would create a level of activity before hand that could drive the futures. It doesn&#39;t take much money. Similarly, or if I were long and wanted to make things a little bit rosy, I would go and take a bunch of stocks and make sure they were higher. Maybe commit 5 million in capital to do it and I could effect it. What you&#39;re seeing now is probably a bigger market, maybe you need 10 million to knock the stuff down. But it&#39;s a fun game, and it&#39;s a lucrative game. You can move it up and then fade it, that often creates a very negative feel. So let&#39;s say you take a longer term view intra-day and you say listen, I&#39;m gonna boost the futures and when the real sellers comes in I&#39;m gonna knock it down and it&#39;s gonna create a negative view. That&#39;s a strategy very worth doing. When you&#39;re valuing on a day to day basis. I would encourage anyone who&#39;s in a hedge fund to do it, because it&#39;s legal. And it uh, is a very quick way to make money. And very satisfying. And by the way, no one else in the world would ever admit that but I don&#39;t care. And I can&#39;t - I&#39;m not gonna say it on TV.</p>\n\n<p><strong>A:</strong> There&#39;s so many more hedge funds today than when you were managing yours. Do you think that exacerbates the moves or makes it tougher?</p>\n\n<p><strong>Cramer:</strong> Well, you know, the hedge funds are positioned long-short. They&#39;re not just long like mutual funds. So it&#39;s really vital these next 6 days cuz of your pay day, you really gotta control the market. You can&#39;t let it lift. When you&#39;ve got research in motion(?) it&#39;s really important to use a lot of your firepower to knock that down because it&#39;s the fulcrum of the market today. So let&#39;s say I were short, what I would do is I would hit a lot of guys with RIM, now you can&#39;t foment. That&#39;s a violation of, of..</p>\n\n<p><strong>A:</strong> Ferment? (lol)</p>\n\n<p><strong>Cramer:</strong> Yeah, you can&#39;t FOment. You can&#39;t create, yourself, an impression that a stock&#39;s down. But you do it anyway because the SEC doesn&#39;t understand it. So, I mean that&#39;s the only sense I would say this is illegal. But a hedge fund not up a lot really has to do a lot to save itself. So, this is different from what I was talking about in the beginning where I&#39;d be buying the Q&#39;s and stuff. This is actually just blatantly illegal. But when you have 6 days and your company may be in doubt because you&#39;re down, I think it&#39;s really important to foment if I were one of these guys.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/xzc98fhz9fg61.png?width=1591&amp;format=png&amp;auto=webp&amp;s=d34efdae548f34e99a3ce0699a757b708448a6d6\">https://preview.redd.it/xzc98fhz9fg61.png?width=1591&amp;format=png&amp;auto=webp&amp;s=d34efdae548f34e99a3ce0699a757b708448a6d6</a></p>\n</div><!-- SC_ON -->",
  "score": 19722,
  "permalink": "/r/wallstreetbets/comments/lfyzh5/cramer_is_working_hard_to_take_down_videos_of_his/",
  "subreddit": "wallstreetbets",
  "id": "lfyzh5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123220379
}