{
  "author": "redditdumpstertrash",
  "the_new_excerpt": "Why has Russia never collapsed and fractured in the same way other countries\nlike china have? It's massive geographically, and incredibly diverse culturally\nand ethnically speaking. One would have thought that a country so disparate and\ndiverse would have collapsed at least a couple of times. Sure,…",
  "original_created_utc": 1624096358,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "なぜロシアは中国のような他の国のように崩壊したり分裂したりしないのか？\n中国のような他の国のように、ロシアが崩壊したり分裂したりしないのはなぜでしょう？ロシアは地理的に巨大で、文化的にも民族的にも信じられないほど多様です。\n民族的にも多様です。これほどバラバラで多様な国は、少なくとも2、3回は崩壊していると思っていたでしょう。\n少なくとも2、3回は崩壊しているだろうと思っていました。確かに、...",
      "title": "なぜロシアは崩壊しないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "为什么俄罗斯从未像中国等其他国家那样崩溃和分裂？\n中国这样的国家？它在地理上是巨大的，而且在文化上和民族上是令人难以置信的多样化。\n和种族上的多样性。人们会认为，一个如此不同的国家\n会至少崩溃过几次。当然，...",
      "title": "为什么俄罗斯从未崩溃？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "爲什麼俄羅斯從未像中國等其他國家那樣崩潰和分裂？\n中國這樣的國家？它在地理上是巨大的，而且在文化上和民族上是令人難以置信的多樣化。\n和種族上的多樣性。人們會認爲，一個如此不同的國家\n會至少崩潰過幾次。當然，...",
      "title": "爲什麼俄羅斯從未崩潰？"
    }
  ],
  "title": "Why has Russia never collapsed?",
  "created_utc": 1624125446,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Why has Russia never collapsed and fractured in the same way other countries like china have? It&#39;s massive geographically, and incredibly diverse culturally and ethnically speaking. One would have thought that a country so disparate and diverse would have collapsed at least a couple of times. Sure, it&#39;s lost parts of it a couple of times (e.g. mongolia, kazakhstan etc.) but it&#39;s general shape and form has basically stayed the same, maintaining control of huge swathes of land between it&#39;s western areas in russia through siberia and into its eastern coast. So how has a country so diverse, geographically, culturally, ethnically etc. stayed mostly together for so long?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/o3chqx/why_has_russia_never_collapsed/",
  "subreddit": "AskHistorians",
  "id": "o3chqx",
  "is_self": true,
  "media": null,
  "is_video": false
}