{
  "author": "TemporaryCitron9271",
  "original_created_utc": 1637496296,
  "title": "3rd world countries will adopt cryptocurrencies faster than those \"developed\"",
  "created_utc": 1637509218,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>At the outset, I wanted to emphasize that the post is not intended to offend any country. The definition of the third world country is to show the differences that exist. </p>\n\n<p>As the US, Europe and China add more and more taxes on cryptocurrencies, ban cryptocurrency trading, ban cryptocurrency companies and banks warn against it, 3rd world countries are increasingly adopting cryptocurrencies into their lives. </p>\n\n<p>In Venezuela due to ifnlation the country released Digital Bolivar and on top of that the country is moving more and more towards cryptocurrencies. Authorities promise to create special training for residents interested in cryptocurrencies.</p>\n\n<p>El Salvador has recognized bitcoin as an official means of payment and you can buy yourself a coconut in bitcoins (damn). It is also celebrating &quot;Bitcoin Week.&quot; </p>\n\n<p>These are just some &quot;news&quot; items. Do you guys also think that these countries will develop faster with the topic of cryptocurrencies than countries that are supposedly &quot;developed&quot;. Why is this the case?</p>\n</div><!-- SC_ON -->",
  "score": 200,
  "permalink": "/r/CryptoCurrency/comments/qytlyy/3rd_world_countries_will_adopt_cryptocurrencies/",
  "subreddit": "CryptoCurrency",
  "id": "qytlyy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "At the outset, I wanted to emphasize that the post is not intended to offend any\ncountry. The definition of the third world country is to show the differences\nthat exist.\n\nAs the US, Europe and China add more and more taxes on cryptocurrencies, ban\ncryptocurrency trading, ban cryptocurrency…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最初に強調しておきたいのは、この投稿はどの国の人も怒らせるつもりはないということです。\nの国のことです。第三世界の国の定義は、その違いを示すためのものです。\n存在していることを示すためです。\n\nアメリカ、ヨーロッパ、中国が暗号通貨にますます多くの税金を加えたり、暗号通貨取引を禁止したり\n暗号通貨の取引を禁止したり、暗号通貨を禁止したり...。",
      "title": "第3世界の国々は、\"先進国 \"の国々よりも早く暗号通貨を導入するでしょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "首先，我想强调的是，这个帖子无意冒犯任何国家。\n国家。第三世界国家的定义是为了显示存在的差异。\n存在的差异。\n\n随着美国、欧洲和中国对加密货币增加越来越多的税收，禁止\n加密货币交易，禁止加密货币...",
      "title": "第三世界国家将比那些 \"发达国家 \"更快地采用加密货币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，我想強調的是，這個帖子無意冒犯任何國家。\n國家。第三世界國家的定義是爲了顯示存在的差異。\n存在的差異。\n\n隨着美國、歐洲和中國對加密貨幣增加越來越多的稅收，禁止\n加密貨幣交易，禁止加密貨幣...",
      "title": "第三世界國家將比那些 \"發達國家 \"更快地採用加密貨幣"
    }
  ]
}