{
  "author": "Ok_Nerve8442",
  "original_created_utc": 1658407788,
  "title": "If you move an ant from one location to another remote place, what will it do?",
  "created_utc": 1658473899,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For example, an ant &amp;quot;got on&amp;quot; me at the park where its home was, I then went back to my house. The ant is now at my house, what will it do? Will it just join another ant crew at my house? Or will it walk all the way back? Or you know, just get terrified and die? I want to know. Thank you&lt;/p&gt;\n\n&lt;p&gt;EDIT: thanks everyone despite now i&amp;#39;m kinda sad&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/NoStupidQuestions/comments/w4fw93/if_you_move_an_ant_from_one_location_to_another/",
  "subreddit": "NoStupidQuestions",
  "id": "w4fw93",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "For example, an ant \"got on\" me at the park where its home was, I then went back\nto my house. The ant is now at my house, what will it do? Will it just join\nanother ant crew at my house? Or will it walk all the way back? Or you know,\njust get terrified and die? I want to know. Thank you\n\nEDIT:…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "例えば、アリが住処のある公園で私に「乗って」きて、私は家に戻りました。\n自分の家に戻りました。アリは今、私の家にいますが、どうするのでしょう？このまま、私の家にいる\n他のアリの仲間になるのでしょうか？それとも、歩いて帰ってくるのだろうか？それとも、あのね。\n恐怖を感じて死んでしまうのか？知りたいです。ありがとうございました。\n\nEDIT:...",
      "title": "アリをある場所から離れた別の場所に移動させると、アリはどうなるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "例如，一只蚂蚁在它的家所在的公园里 \"上了 \"我，然后我回到了\n回到我的家里。这只蚂蚁现在在我家里，它要做什么？它是否会加入\n另一个蚂蚁团队在我家里？还是会一路走回去？或者你知道。\n吓死了？我想知道。谢谢你\n\n编辑：...",
      "title": "如果你把一只蚂蚁从一个地方移到另一个遥远的地方，它将做什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "例如，一隻螞蟻在它的家所在的公園裏 \"上了 \"我，然後我回到了\n回到我的家裏。這隻螞蟻現在在我家裏，它要做什麼？它是否會加入\n另一個螞蟻團隊在我家裏？還是會一路走回去？或者你知道。\n嚇死了？我想知道。謝謝你\n\n編輯：...",
      "title": "如果你把一隻螞蟻從一個地方移到另一個遙遠的地方，它將做什麼？"
    }
  ]
}