{
  "author": "Alive-Tumbleweed68",
  "original_created_utc": 1646024284,
  "title": "What is it mean when you think about dying almost every day but you don't actively want to kill yourself?",
  "created_utc": 1646037426,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s weird, even on really good high dopamine days my brain is just like &amp;quot;what if you didn&amp;#39;t just wake up in the morning&amp;quot;. I haven&amp;#39;t truly wanted to unalive myself in 7 years but the intrusive thoughts pop in daily. It doesn&amp;#39;t even bother me that much I just don&amp;#39;t know why it always seems to be in the back of my mind.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 109,
  "permalink": "/r/TooAfraidToAsk/comments/t37df1/what_is_it_mean_when_you_think_about_dying_almost/",
  "subreddit": "TooAfraidToAsk",
  "id": "t37df1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "It's weird, even on really good high dopamine days my brain is just like \"what\nif you didn't just wake up in the morning\". I haven't truly wanted to unalive\nmyself in 7 years but the intrusive thoughts pop in daily. It doesn't even\nbother me that much I just don't know why it always seems to be in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "不思議なもので、高ドーパミンの良い日でも、私の脳は「どうした？\n朝、目が覚めなかったら」。本当に生きたいと思ったことはありません。\n7年前からですが、毎日のように押し寄せる思考があります。それは\nなぜか、いつも気になるんです...。",
      "title": "ほぼ毎日死ぬことを考えながらも、積極的に自殺したいとは思わないのはどういうことなのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这很奇怪，即使是在多巴胺含量很高的日子里，我的大脑也会觉得 \"如果你早上没有醒来怎么办？\n如果你不是在早上醒来\"。7年来，我还没有真正想让自己解脱\n但这种侵入性的想法每天都会出现。它甚至不\n我只是不知道为什么它似乎总是出现在...",
      "title": "当你几乎每天都想到死亡，但你并不主动想自杀，这意味着什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這很奇怪，即使是在多巴胺含量很高的日子裏，我的大腦也會覺得 \"如果你早上沒有醒來怎麼辦？\n如果你不是在早上醒來\"。7年來，我還沒有真正想讓自己解脫\n但這種侵入性的想法每天都會出現。它甚至不\n我只是不知道爲什麼它似乎總是出現在...",
      "title": "當你幾乎每天都想到死亡，但你並不主動想自殺，這意味着什麼？"
    }
  ]
}