{
  "author": "Two_Pickachu_One_Cup",
  "original_created_utc": 1654247495,
  "title": "SOL attacked yet again! Why invest in SOL when crypto with 100 percent uptime exists?",
  "created_utc": 1654261658,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s common knowledge here that the SOL network goes down frequently, gets hacked, doesn&amp;#39;t work etc yet people still continue to invest in it. And yet again it was attacked YET AGAIN recently! If traditional banking was this flakey the government would haul it over the coals and watch it burn.&lt;/p&gt;\n\n&lt;p&gt;Yet people still invest in this centralized chain.&lt;/p&gt;\n\n&lt;p&gt;Litecoin for example (and I am sure there are many other examples that people can name) has had 100 percent uptime with literally no hacks or exploits, yet people instantly dismiss.&lt;/p&gt;\n\n&lt;p&gt;It brings me to the conclusion that we don&amp;#39;t really care about fundamentals in the crypto space, only juicy profits. &lt;/p&gt;\n\n&lt;p&gt;So it brings me back to the original point of this post, why an earth are people investing in SOL when it is the least secure and reliable chain in crypto?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 421,
  "permalink": "/r/CryptoCurrency/comments/v3vcls/sol_attacked_yet_again_why_invest_in_sol_when/",
  "subreddit": "CryptoCurrency",
  "id": "v3vcls",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "It's common knowledge here that the SOL network goes down frequently, gets\nhacked, doesn't work etc yet people still continue to invest in it. And yet\nagain it was attacked YET AGAIN recently! If traditional banking was this flakey\nthe government would haul it over the coals and watch it burn.\n\nYet…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "SOLのネットワークが頻繁にダウンするのは、ここでは常識です。\nハッキングされたり、機能しなかったりすることはよく知られていますが、それでも人々はそれに投資し続けます。しかし\n最近もまた攻撃されました。もし伝統的な銀行がこれほどずさんなものであれば\n政府はその銀行を炭火の上に引きずり出し、燃えるのを見守っていることでしょう。\n\nしかし...",
      "title": "SOLがまたもや攻撃された! 100%アップタイムの暗号が存在するのに、なぜSOLに投資するのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "众所周知，SOL网络经常出现故障，被黑客攻击，无法使用等，但人们仍然继续投资于它。\n黑客攻击，不工作等，但人们仍然继续投资于它。然而\n最近，它又一次受到了攻击。如果传统的银行业务是如此脆弱\n政府就会把它拖到炭火上，看着它燃烧。\n\n然而...",
      "title": "SOL再次受到攻击! 既然存在100%正常运行时间的加密货币，为什么还要投资于SOL？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "衆所周知，SOL網絡經常出現故障，被黑客攻擊，無法使用等，但人們仍然繼續投資於它。\n黑客攻擊，不工作等，但人們仍然繼續投資於它。然而\n最近，它又一次受到了攻擊。如果傳統的銀行業務是如此脆弱\n政府就會把它拖到炭火上，看着它燃燒。\n\n然而...",
      "title": "SOL再次受到攻擊! 既然存在100%正常運行時間的加密貨幣，爲什麼還要投資於SOL？"
    }
  ]
}