{
  "author": "Nostalg33k",
  "original_created_utc": 1640870331,
  "title": "If the only purpose of a coin is to gain value and make 'early adopters' rich, then it will fail.",
  "created_utc": 1640886260,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have seen countless of new projects overpromise that their coin will go to the moon.&lt;/p&gt;\n\n&lt;p&gt;I have seen teams dedicated to saying &amp;quot;we will be so rich&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Things always crumble when you start to ask: What is your use case ? What problem do you solve?&lt;/p&gt;\n\n&lt;p&gt;If you are discovering a coin which is promoted for the sole &amp;#39;future value&amp;#39; of the coin, it is a predatory project which will most likely fail and/or burn a lot of people. This should be one of the reddest flag for anyone.&lt;/p&gt;\n\n&lt;p&gt;In our market, hype is a real factor it is true BUT utility is king.&lt;/p&gt;\n\n&lt;p&gt;Your coin utility is to reward debt forgiveness? Great!&lt;/p&gt;\n\n&lt;p&gt;Your coin utility is to apply the blockchain to the housing industry through a metaverse to do VR visits of real houses and flats? Great.&lt;/p&gt;\n\n&lt;p&gt;Your coin utility is to make early adopters rich ? Not great !&lt;/p&gt;\n\n&lt;p&gt;Tldr: Coins made to go &amp;quot;2 the moon&amp;quot; will never go there, the best coins have utility. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 197,
  "permalink": "/r/CryptoCurrency/comments/rs1m5j/if_the_only_purpose_of_a_coin_is_to_gain_value/",
  "subreddit": "CryptoCurrency",
  "id": "rs1m5j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I have seen countless of new projects overpromise that their coin will go to the\nmoon.\n\nI have seen teams dedicated to saying \"we will be so rich\"\n\nThings always crumble when you start to ask: What is your use case ? What\nproblem do you solve?\n\nIf you are discovering a coin which is promoted for…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はこれまで、数え切れないほどの新しいプロジェクトが、自分たちのコインが遠くまで行くと過信しているのを見てきました。\n月です。\n\n\"我々は金持ちになる \"と言うことに専念しているチームを見たことがあります\n\nあなたのユースケースは何ですか？どんな\n問題を解決するのですか？\n\nもし、あなたが、あるコインを発見し、そのコインは...のために宣伝されているとしたら。",
      "title": "もしコインの目的が、価値を高めて「アーリーアダプター」を金持ちにすることだけなら、そのコインは失敗するでしょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我见过无数的新项目过度承诺他们的钱币会去到\n月球。\n\n我见过一些团队致力于说 \"我们将变得非常富有\"。\n\n当你开始问：你的用例是什么时，事情总是崩溃的。你要解决什么问题？\n你要解决什么问题？\n\n如果你发现了一种硬币，而这种硬币是为了促进......",
      "title": "如果一个硬币的唯一目的是获得价值并使 \"早期采用者 \"致富，那么它将失败。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我見過無數的新項目過度承諾他們的錢幣會去到\n月球。\n\n我見過一些團隊致力於說 \"我們將變得非常富有\"。\n\n當你開始問：你的用例是什麼時，事情總是崩潰的。你要解決什麼問題？\n你要解決什麼問題？\n\n如果你發現了一種硬幣，而這種硬幣是爲了促進......",
      "title": "如果一個硬幣的唯一目的是獲得價值並使 \"早期採用者 \"致富，那麼它將失敗。"
    }
  ]
}