{
  "author": "xqcbigschnozer",
  "original_created_utc": 1631112147,
  "title": "Teacher finds bitcoin “gambling and worst investment ever”",
  "created_utc": 1631122343,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello everyone. I am a 14 year old student and we were talking about money in economics class and bitcoin popped up in the conversation. I made my points myself but the teacher didn’t even bother listening to me as bitcoin is supposedly “a scam and gambling”. Considering a teacher somewhat takes part in education, i find this absurd. I was trying to discuss with her why i don’t agree with her she told me that if i talked back more i was gonna get sent to the principals office. What are your thoughts on this?</p>\n</div><!-- SC_ON -->",
  "score": 208,
  "permalink": "/r/Bitcoin/comments/pkbv8p/teacher_finds_bitcoin_gambling_and_worst/",
  "subreddit": "Bitcoin",
  "id": "pkbv8p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hello everyone. I am a 14 year old student and we were talking about money in\neconomics class and bitcoin popped up in the conversation. I made my points\nmyself but the teacher didn’t even bother listening to me as bitcoin is\nsupposedly “a scam and gambling”. Considering a teacher somewhat takes…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。私は14歳の学生ですが、経済学の授業でお金の話をしていたら\n経済学の授業でお金の話をしていて、その中でビットコインが出てきました。私は自分の主張をしました。\n私は自分の主張をしましたが、先生はビットコインが「詐欺やギャンブル」だと思われるので、私の話を聞こうともしませんでした。\nビットコインは「詐欺やギャンブル」だと思われるからです。先生がなんとなく受け止めていることを考えると...。",
      "title": "教師がビットコインを \"ギャンブルであり、史上最悪の投資 \"と判断"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。我是一个14岁的学生，我们在经济学课上谈论金钱时\n经济学课上，比特币突然出现在谈话中。我提出了我的观点\n但老师甚至懒得听我说，因为比特币是\n据称是 \"一个骗局和赌博\"。考虑到一个老师在某种程度上把...",
      "title": "教师认为比特币是 \"赌博和最糟糕的投资\""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。我是一個14歲的學生，我們在經濟學課上談論金錢時\n經濟學課上，比特幣突然出現在談話中。我提出了我的觀點\n但老師甚至懶得聽我說，因爲比特幣是\n據稱是 \"一個騙局和賭博\"。考慮到一個老師在某種程度上把...",
      "title": "教師認爲比特幣是 \"賭博和最糟糕的投資\""
    }
  ]
}