{
  "author": "Zombeasle",
  "original_created_utc": 1624821866,
  "title": "Do animals with less brainpower make “mistakes” the way we do?",
  "created_utc": 1624836575,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Let’s use an ant as an example. If a worker ants job is to clean the eggs, is there a chance they forget? Or perhaps pop an egg? Or are their brains so hardwired to their roles that they have no room for interpretation? </p>\n\n<p>On the flip side, if you ask a human child what 2+2 is, they’ll probably say 7 or pineapple or something because kids are dumb and don’t pay taxes. That does, however, require knowledge OUTSIDE of the question, such as knowing that 7 is a number and that pineapples… exist. So, does a higher thought process give way to error or the other way around?</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/NoStupidQuestions/comments/o93r4r/do_animals_with_less_brainpower_make_mistakes_the/",
  "subreddit": "NoStupidQuestions",
  "id": "o93r4r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Let’s use an ant as an example. If a worker ants job is to clean the eggs, is\nthere a chance they forget? Or perhaps pop an egg? Or are their brains so\nhardwired to their roles that they have no room for interpretation?\n\nOn the flip side, if you ask a human child what 2+2 is, they’ll probably say…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "蟻を例にしてみましょう。働きアリの仕事は卵を掃除することですが、忘れてしまうことはありませんか？\n忘れてしまうことはありませんか？あるいは、卵を飛ばしてしまうこともあるでしょうか？それとも、彼らの脳は\n解釈の余地がないのでしょうか？\n\n逆に、人間の子供に2+2は何かと聞くと、おそらく...と答えるでしょう。",
      "title": "脳力のない動物は、人間と同じように「間違い」を犯すのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "让我们用一只蚂蚁作为例子。如果工蚁的工作是清理卵子，那么它们有可能忘记吗？\n他们有可能忘记吗？或者是弹出一个蛋？或者它们的大脑是如此\n他们的大脑对自己的角色是如此刻板，以至于他们没有解释的余地？\n\n反过来说，如果你问一个人类小孩什么是2+2，他们可能会说......",
      "title": "脑力较弱的动物会像我们一样犯 \"错误 \"吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "讓我們用一隻螞蟻作爲例子。如果工蟻的工作是清理卵子，那麼它們有可能忘記嗎？\n他們有可能忘記嗎？或者是彈出一個蛋？或者它們的大腦是如此\n他們的大腦對自己的角色是如此刻板，以至於他們沒有解釋的餘地？\n\n反過來說，如果你問一個人類小孩什麼是2+2，他們可能會說......",
      "title": "腦力較弱的動物會像我們一樣犯 \"錯誤 \"嗎？"
    }
  ]
}