{
  "author": "BoardfShadowyFigures",
  "the_new_excerpt": "Looking at American history, a lot of terrible things were done and questionable\ndecisions made in service of \"stopping Communism.\" Involvement in the Korean and\nVietnam wars, installing Saddam Hussein, facilitating numerous coups around the\nworld, and of course the constant cultural specter of the…",
  "original_created_utc": 1611674782,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "纵观美国历史，很多可怕的事情都做过，也有很多值得商榷的地方。\n为 \"制止共产主义 \"服务而作出的决定。参与朝鲜和。\n越战、安插萨达姆-侯赛因、协助各地的多次政变。\n世界，当然还有不断的文化幽灵... ...",
      "title": "为什么美国如此关注阻止共产主义的传播？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "縱觀美國曆史，很多可怕的事情都做過，也有很多值得商榷的地方。\n爲 \"制止共產主義 \"服務而作出的決定。參與朝鮮和。\n越戰、安插薩達姆-侯賽因、協助各地的多次政變。\n世界，當然還有不斷的文化幽靈... ...",
      "title": "爲什麼美國如此關注阻止共產主義的傳播？"
    }
  ],
  "title": "Why was America so concerned with halting the spread of communism?",
  "created_utc": 1611690157,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Looking at American history, a lot of terrible things were done and questionable decisions made in service of &quot;stopping Communism.&quot; Involvement in the Korean and Vietnam wars, installing Saddam Hussein, facilitating numerous coups around the world, and of course the constant cultural specter of the Red Scare, this ever-present Communist Boogieman that defined post-war America. </p>\n\n<p>But why was Communism seen as such a threat? Was there genuine concern that &quot;the communists&quot; would take over America? Was it fear at having a competing superpower? Or was it purely manufactured in an attempt at creating the kind of national unity seen against the Nazis?</p>\n\n<p>Also sub question, did other nations have their own Red Scare or was that purely an American phenomenon?</p>\n</div><!-- SC_ON -->",
  "score": 904,
  "permalink": "/r/AskHistorians/comments/l5g77i/why_was_america_so_concerned_with_halting_the/",
  "subreddit": "AskHistorians",
  "id": "l5g77i",
  "is_self": true,
  "media": null,
  "is_video": false
}