{
  "author": "Trevigol",
  "original_created_utc": 1635974333,
  "title": "How to handle a crazy colleague who got obsessed with crypto and is stalking me?",
  "created_utc": 1635994124,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So, few weeks ago a colleague who never invested in crypto said he read somewhere that Shiba is the new Bitcoin. At that time, he didn&#39;t even know what Shiba or bitcoin mean. He had no crypto wallets, he was just making a random conversation about something he read online.</p>\n\n<p>I made the mistake of telling him that I invest in crypto and that Shiba is a shitcoin.</p>\n\n<p>Everything ended up there.</p>\n\n<p>A week ago he read the news about the guy who invested 8k in Shiba and became rich and he automatically decided that now he would be a billionaire and he&#39;s not just because of me.</p>\n\n<p>I never told him to not invest in Shiba, I just expressed my opinion. He never really wanted to invest in any crypto. However, even if he invested in Shiba a month ago, now he wouldn&#39;t be rich at all. But he&#39;s too illiterate to understand it.</p>\n\n<p>Since then, he started to say that I made him lose millions and I should help him to recover (?!)</p>\n\n<p>I just told him I&#39;m not a trader and I don&#39;t give any financial advice. I really don&#39;t trade. I just buy the crypto I like and hold.</p>\n\n<p>Since then, he started to text me everyday about any possible crypto and asking me if he should buy it. I always answer that I don&#39;t know it.</p>\n\n<p>He thinks I&#39;m just selfish and I don&#39;t want to help him because I want to be the only one to become rich.</p>\n\n<p>He became very annoying so I blocked him in every social and I told him to not bother me anymore. So he just started to send me emails in my work account where I can&#39;t block him because he&#39;s a colleague.</p>\n\n<p>Few days ago he sent an email without any text, in the subject it was written &quot;shibazzilla: should I buy it?&quot;\nI didn&#39;t answer him.</p>\n\n<p>Now he told me he lost everything invested in shibazilla and he said it&#39;s my fault because I didn&#39;t warn him.</p>\n\n<p>I told him &quot;I just ignored you like I told you, I didn&#39;t tell you to buy it&quot; and he said &quot;so you had to talk when I was going to buy Shiba but you didn&#39;t think to tell me anything when I told you I was buying shibazilla&quot;</p>\n\n<p>He clearly got obsessed with crypto and he&#39;s too illiterate to understand anything.</p>\n\n<p>I have no idea how to handle him. He clearly got crazy. I literally told him to not bother me and that I blocked him because he&#39;s not my friend, but he doesn&#39;t care. He&#39;s doesn&#39;t understand it. He says I&#39;m kidding and we&#39;re all &quot;crypto brothers&quot;</p>\n\n<p>I&#39;m afraid soon I&#39;ll end up beating him and then I&#39;ll lose my job.</p>\n\n<p>Any advices? Maybe someone had a similar situation?</p>\n</div><!-- SC_ON -->",
  "score": 221,
  "permalink": "/r/CryptoCurrency/comments/qm4jaa/how_to_handle_a_crazy_colleague_who_got_obsessed/",
  "subreddit": "CryptoCurrency",
  "id": "qm4jaa",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So, few weeks ago a colleague who never invested in crypto said he read\nsomewhere that Shiba is the new Bitcoin. At that time, he didn't even know what\nShiba or bitcoin mean. He had no crypto wallets, he was just making a random\nconversation about something he read online.\n\nI made the mistake of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "数週間前、暗号に投資したことのない同僚が、どこかで読んだと言っていました。\n読んだと言っていました。その時、彼は芝やビットコインが何を意味するのかさえ知らなかった。\n柴やビットコインの意味も知らなかった。彼は暗号化された財布を持っておらず、ただネットで読んだことを適当に会話していただけでした。\nネットで読んだことを適当に話していただけでした。\n\n私は間違えて...",
      "title": "暗号に夢中になって、私をストーカーしているクレイジーな同僚をどう扱うか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以，几周前，一位从未投资过加密货币的同事说，他在某处读到的\n说他在某处读到Shiba是新的比特币。那时候，他甚至不知道什么是\nShiba或比特币的意思。他没有加密货币钱包，他只是在网上随便说了几句\n关于他在网上读到的东西的谈话。\n\n我犯了一个错误，那就是...",
      "title": "如何处理一个疯狂的同事，他迷恋上了加密货币并跟踪我？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以，幾周前，一位從未投資過加密貨幣的同事說，他在某處讀到的\n說他在某處讀到Shiba是新的比特幣。那時候，他甚至不知道什麼是\nShiba或比特幣的意思。他沒有加密貨幣錢包，他只是在網上隨便說了幾句\n關於他在網上讀到的東西的談話。\n\n我犯了一個錯誤，那就是...",
      "title": "如何處理一個瘋狂的同事，他迷戀上了加密貨幣並跟蹤我？"
    }
  ]
}