{
  "author": "VCGS",
  "the_new_excerpt": "I'm sure whoever it is, is already aware and it is our fault (an incredibly rare\nbug caused it) but if you could return the Lumens we'd really appreciate it. We\nhaven't taken any profit from the site at all yet and it's only going to reduce\nthe pool balances for the next time you want to trade so…",
  "original_created_utc": 1623151757,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "それが誰であっても、すでに気付いていると思いますし、私たちの責任でもあります（信じられないほど稀なバグが原因です）。\nしかし、もしあなたがルーメンを返してくれるなら、私たちは本当に感謝します。私たちは\n私たちはまだサイトから何の利益も得ていませんし、次回のプール残高が減るだけです。\n次に取引したいときにプールの残高が減るだけなので...。",
      "title": "もしあなたが昨夜 celesti.trade で誤って多くのルーメンを手に入れたのなら、私に連絡してもらえませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我相信不管是谁，都已经知道了，这是我们的错（一个极其罕见的错误造成的）。\n但如果你能归还Lumens，我们将非常感激。我们\n我们还没有从网站上获得任何利润，这只会减少\n而且这只会在您下次想交易时减少资金池的余额，所以...",
      "title": "嘿，如果你昨晚不小心在celesti.trade上得到了太多的Lumens，能不能请你联系我？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我相信不管是誰，都已經知道了，這是我們的錯（一個極其罕見的錯誤造成的）。\n但如果你能歸還Lumens，我們將非常感激。我們\n我們還沒有從網站上獲得任何利潤，這隻會減少\n而且這隻會在您下次想交易時減少資金池的餘額，所以...",
      "title": "嘿，如果你昨晚不小心在celesti.trade上得到了太多的Lumens，能不能請你聯繫我？"
    }
  ],
  "title": "Hey if you accidentally got too many Lumens last night on celesti.trade could you please contact me?",
  "created_utc": 1623188488,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m sure whoever it is, is already aware and it is our fault (an incredibly rare bug caused it) but if you could return the Lumens we&#39;d really appreciate it. We haven&#39;t taken any profit from the site at all yet and it&#39;s only going to reduce the pool balances for the next time you want to trade so please consider it. </p>\n\n<p>It was 2554.5 Lumens that we accidentally double sent.</p>\n\n<p>Thanks.</p>\n\n<p>EDIT: Btw here are the double transactions we accidentally send just for further proof:</p>\n\n<p><a href=\"https://stellarchain.io/tx/e95e256130d321ab1d13534e7c11407641d42a97223d6d1cc7d156ef777bdcd9\">https://stellarchain.io/tx/e95e256130d321ab1d13534e7c11407641d42a97223d6d1cc7d156ef777bdcd9</a></p>\n\n<p><a href=\"https://stellarchain.io/tx/b9c6fd43e8e3640ed010285446594c660af36f2fb892fe583a62562f9a25c28c\">https://stellarchain.io/tx/b9c6fd43e8e3640ed010285446594c660af36f2fb892fe583a62562f9a25c28c</a></p>\n\n<p>EDIT2: To be clear the above address we sent to is an exchange address so it&#39;s actually impossible to tell specifically who it was sent to without their memo. We have that in our logs but not sure if there&#39;s any point in posting it, plus I guess that counts as doxxing.</p>\n\n<p>EDIT3: We have a potential lead! Waiting on their reply to confirm.</p>\n\n<p>Edit4: they replied and they will return the Lumens!! Big thank you to the very honest <a href=\"/u/EGarrett\">/u/EGarrett</a> and to <a href=\"/u/Dro1100\">/u/Dro1100</a> for finding them! Humanity ain&#39;t so bad afterall.</p>\n</div><!-- SC_ON -->",
  "score": 263,
  "permalink": "/r/CryptoCurrency/comments/nv1url/hey_if_you_accidentally_got_too_many_lumens_last/",
  "subreddit": "CryptoCurrency",
  "id": "nv1url",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404884244
}