{
  "author": "cynical_americano",
  "the_new_excerpt": "NO Doge is not like BTC\n\nThere is no limited supply. It was specifically intended to remain cheap to\nfacilitate FAST txns. Raising the price directly conflicts with this and will\nlikely result in an influx of new coins into circulation. THE SUPPLY IS NOT\nLIMITED, UNLIKE BTC.\n\n\n\nNO the situation with…",
  "original_created_utc": 1611957386,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "NO Doge不像BTC\n\n没有限量供应。它是专门为了保持便宜的价格，以\n促进FAST txns。提高价格与此直接冲突，并将导致\n很可能导致新的钱币涌入流通领域。供应量不\n限公司，不像BTC。\n\n\n\nNO的情况与...",
      "title": "对所有散布关于Doge的公然虚假信息的人来说，停止，你正在伤害更大的事业。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "NO Doge不像BTC\n\n沒有限量供應。它是專門爲了保持便宜的價格，以\n促進FAST txns。提高價格與此直接衝突，並將導致\n很可能導致新的錢幣湧入流通領域。供應量不\n限公司，不像BTC。\n\n\n\nNO的情況與...",
      "title": "對所有散佈關於Doge的公然虛假信息的人來說，停止，你正在傷害更大的事業。"
    }
  ],
  "title": "To all the people spreading blatantly false info about Doge; STOP; you're hurting the bigger cause",
  "created_utc": 1611970781,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>NO Doge is not like BTC</p>\n\n<p>There is no limited supply. It was specifically intended to remain cheap to facilitate FAST txns. Raising the price directly conflicts with this and will likely result in an influx of new coins into circulation. <strong>THE SUPPLY IS NOT LIMITED, UNLIKE BTC.</strong></p>\n\n<p>&#x200B;</p>\n\n<p>NO the situation with Doge is not like GME in ANY WAY.</p>\n\n<p>GME happened because of SHORTS. AFAIK this is not something that exists in the crypto world. You are relying on other (retail, most likely) investors to take your bags when the shit hits the fan.  This is not screwing over wallstreet or investment firms in any perceivable way. They don&#39;t give a shit about Doge, and they sure as shit don&#39;t have short positions, the entire catalyst to the price increase with GME, forcing them to buy down the road.</p>\n\n<p>&#x200B;</p>\n\n<p>NO you are not helping crypto by supporting a pump and dump.</p>\n\n<p>A LOT of new eyes are on crypto lately. If their first experience is holding bags after being sold a lie on a pump and dump (could be called a pyramid) scheme, they will most likely come away with a horrible impression of crypto as a whole.</p>\n\n<p>&#x200B;</p>\n\n<p>NO I&#39;m not a hater</p>\n\n<p>Now is the time to prove a point, a point bigger than money. This is why GME was so pivotal, it is taking money from the rich fuckers who have gamed the system for so long with no downsides. That is not the same situation with Doge, a coin no reasonable corporate investor would ever take interest in. Despite how much the doge folk like to talk about Elon&#39;s mention of the coin, he made a few off hand remarks, and a week later changes his twitter bio to say #BITCOIN NOT #DOGE. Why would he do that if he was so sold on the idea? I don&#39;t even care if you pump and dump, but the MASSIVE amount of hype you&#39;re building, preying on ignorant retail investors, is concerning.</p>\n\n<p>&#x200B;</p>\n\n<p>I&#39;m prepared for a massive backlash, but I&#39;m fairly certain anyone who has done their research knows Doge is nothing but a shitcoin to be used for pump and dump (it fails at its intended purpose), kind of like MEME. It&#39;s quite literally a meme coin.</p>\n\n<p>&#x200B;</p>\n\n<p>If you want to hype a coin, maybe try one with an actual use-case and limited supply.</p>\n</div><!-- SC_ON -->",
  "score": 1497,
  "permalink": "/r/CryptoCurrency/comments/l85gqa/to_all_the_people_spreading_blatantly_false_info/",
  "subreddit": "CryptoCurrency",
  "id": "l85gqa",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518527089
}