{
  "author": "JohnDonMike",
  "original_created_utc": 1635348911,
  "title": "My(21M) first girlfriend (20) of 5 years just cheated on me, on my birthday. I feel a little down, still have feelings for her but right now I really need good music just to get over it. What music should I listen to?",
  "created_utc": 1635370934,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Edit1: Wow, than you for you support guys! I find your music really awesome here. I am trying every one of them. Not to mention that I don&#39;t hate her at all but just feeling used and disappointed in her.Sometimes i would get dark thoughts of her kissing another guy, or holding hands together. But music does help me cope with this. All of you are different and special and every way. I know that people like you have really cool special music taste and i wanna be part of that so i can forget my pain for while. Thank you again</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/qgzf0s/my21m_first_girlfriend_20_of_5_years_just_cheated/",
  "subreddit": "NoStupidQuestions",
  "id": "qgzf0s",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Edit1: Wow, than you for you support guys! I find your music really awesome\nhere. I am trying every one of them. Not to mention that I don't hate her at all\nbut just feeling used and disappointed in her.Sometimes i would get dark\nthoughts of her kissing another guy, or holding hands together. But…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Edit1: 応援してくれてありがとうございます。私はあなたの音楽が本当に素晴らしい\nこれは 一つ一つ試しています。言うまでもなく、私は彼女のことを全く嫌いではありません。\n時々、彼女が他の男とキスしたり、一緒に手をつないだりしている暗い考えが浮かんできます。\n時々、彼女が他の男とキスしたり、一緒に手をつないだりしているのを暗く考えてしまいます。でも...",
      "title": "私（21M）の5年ぶりの彼女（20）が、私の誕生日に浮気をしました。私は少し落ち込んでいます。まだ彼女への気持ちはありますが、今はそれを乗り越えるために良い音楽が必要です。どんな音楽を聴けばいいですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "编辑1。哇，谢谢你们的支持! 我发现你的音乐真的很不错\n在这里。我正在尝试每一个人的作品。更不用说我根本就不恨她\n只是觉得自己被利用了，对她失望了。\n想到她在亲吻另一个人，或者一起牵手。但是...",
      "title": "我（21岁）的第一个女朋友（20岁）在我的生日那天出轨了。我感到有点沮丧，对她仍有感觉，但现在我真的需要好的音乐来克服它。我应该听什么音乐呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "編輯1。哇，謝謝你們的支持! 我發現你的音樂真的很不錯\n在這裏。我正在嘗試每一個人的作品。更不用說我根本就不恨她\n只是覺得自己被利用了，對她失望了。\n想到她在親吻另一個人，或者一起牽手。但是...",
      "title": "我（21歲）的第一個女朋友（20歲）在我的生日那天出軌了。我感到有點沮喪，對她仍有感覺，但現在我真的需要好的音樂來克服它。我應該聽什麼音樂呢？"
    }
  ]
}