{
  "author": "k20stitch_tv",
  "the_new_excerpt": "Given the most recent events surrounding Covid, the GameStop craze, and new\ninvestors piling into the stock market. There are folks watching what you post\nand sending you messages to convince you of the next best way to make handsome\nloot.\n\nThey’ll push things like forex, binary options, crypto…",
  "original_created_utc": 1611438976,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "鉴于最近围绕科维德的事件，游戏机的热潮，以及新的\n投资者扎堆进入股市。有乡亲们在看你发什么\n并给你发信息，让你相信下一个赚取帅气的最好方法。\n掠夺。\n\n他们会推送诸如外汇、二元期权、加密......等东西。",
      "title": "在这里发帖后收到的信息要小心了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "鑑於最近圍繞科維德的事件，遊戲機的熱潮，以及新的\n投資者扎堆進入股市。有鄉親們在看你發什麼\n並給你發信息，讓你相信下一個賺取帥氣的最好方法。\n掠奪。\n\n他們會推送諸如外匯、二元期權、加密......等東西。",
      "title": "在這裏發帖後收到的信息要小心了。"
    }
  ],
  "title": "Be weary of messages received after posting here",
  "created_utc": 1611455362,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Given the most recent events surrounding Covid, the GameStop craze, and new investors piling into the stock market. There are folks watching what you post and sending you messages to convince you of the next best way to make handsome loot.</p>\n\n<p>They’ll push things like forex, binary options, crypto currency. It’s all a scam (not those things specifically but what they’re actually trying to convince you to do)</p>\n\n<p>No one. I repeat no one is going to go out of their way to help you make millions unless it’s for their own interest. </p>\n\n<p>I made one post here and received three messages almost instantly all pushing the same scam. Usernames available on request as I’m not sure if it’s allowed that I post them.</p>\n\n<p>Yes, I’m aware I spelled wary wrong, can’t edit titles.</p>\n\n<p>Edit here are the users that haven’t already been deleted</p>\n\n<ul>\n<li><a href=\"/u/Dive_into_Anything\">u/Dive_into_Anything</a></li>\n<li><a href=\"/u/KikiLucky\">u/KikiLucky</a></li>\n<li><a href=\"/u/TheRealSamBell\">u/TheRealSamBell</a> (this guy obviously trolling as a result of this post but listing for transparency anyway)</li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 967,
  "permalink": "/r/investing/comments/l3lk67/be_weary_of_messages_received_after_posting_here/",
  "subreddit": "investing",
  "id": "l3lk67",
  "is_self": true,
  "media": null,
  "is_video": false
}