{
  "author": "noinjury678",
  "original_created_utc": 1631360661,
  "title": "Peter Singer and Capitalism",
  "created_utc": 1631438784,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have a question about Singer&#39;s approach to various issues. For example, donating to charity and Veganism. As a Utilitarian, Singer aims to promote the outcome which satisfies the most preferences/produces more pleasure/less pain. However, I am unsure why he places so much emphasis on individual action when it seems we don&#39;t have much power to change anything on an individual level. </p>\n\n<p>I don&#39;t think the issue of poverty is created by individuals not being generous enough; I think it is rooted in an exploitative system. Therefore, trying to solve problems caused by capitalism within the framework of capitalism seems unproductive. Surely the most effective method of creating change would be to change the very system which causes these problems? Considering Singer is a Utilitarian, I struggle to understand why he favours individual action which I don&#39;t believe will make a difference.</p>\n\n<p>Sorry if I have misunderstood Singer, I just struggle to reconcile his consequentialist viewpoint with his focus on individual action and was wondering if I have missed something in Singer&#39;s argument, or if anyone can provide an answer?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/askphilosophy/comments/pm5ys3/peter_singer_and_capitalism/",
  "subreddit": "askphilosophy",
  "id": "pm5ys3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I have a question about Singer's approach to various issues. For example,\ndonating to charity and Veganism. As a Utilitarian, Singer aims to promote the\noutcome which satisfies the most preferences/produces more pleasure/less pain.\nHowever, I am unsure why he places so much emphasis on individual…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "様々な問題に対するシンガーのアプローチについて質問があります。例えば、以下のようなものです。\n慈善団体への寄付や菜食主義などです。功利主義者であるシンガーは、最も多くの選好を満足させ、より多くの喜びや痛みをもたらす\n最も多くの選好を満足させ、より多くの喜びと痛みをもたらす結果を促進することを目指しています。\nしかし、なぜシンガーが個人の行動を重視するのか、私にはわかりません。",
      "title": "ピーター・シンガーと資本主義"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我有一个关于辛格处理各种问题的方法的问题。比如说。\n向慈善机构捐款和素食主义。作为一个功利主义者，辛格的目标是促进\n作为一个功利主义者，辛格的目标是促进满足最多偏好的结果/产生更多的快乐/更少的痛苦。\n然而，我不确定他为什么如此强调个人的利益。",
      "title": "彼得-辛格与资本主义"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我有一個關於辛格處理各種問題的方法的問題。比如說。\n向慈善機構捐款和素食主義。作爲一個功利主義者，辛格的目標是促進\n作爲一個功利主義者，辛格的目標是促進滿足最多偏好的結果/產生更多的快樂/更少的痛苦。\n然而，我不確定他爲什麼如此強調個人的利益。",
      "title": "彼得-辛格與資本主義"
    }
  ]
}