{
  "author": "essentialplanner",
  "the_new_excerpt": "Hi Everyone! I was doing some research and the Boglehead approach really\nresonated with me. I am 23 years old and will be starting my first job soon.\nUnfortunately, my parents passed away during COVID, but left me with some money.\nI really do not want to waste their money and prepare myself for…",
  "original_created_utc": 1622215685,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。私はいくつかの研究をしていて、Bogleheadのアプローチは本当に共鳴しました。\n私の心に響きました。私は23歳で、もうすぐ最初の仕事を始める予定です。\n残念なことに、両親はCOVID中に亡くなりましたが、私にいくらかのお金を残してくれました。\n私は本当に両親のお金を無駄にしたくないし、自分自身のために準備したいと思っています。",
      "title": "スタートアップの支援を求めている（23M"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好! 我在做一些研究，而Boglehead的方法真的\n与我产生了共鸣。我今年23岁，很快就会开始我的第一份工作。\n不幸的是，我的父母在COVID期间去世了，但给我留下了一些钱。\n我真的不想浪费他们的钱，为自己准备...",
      "title": "寻求帮助的起步 (23M)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好! 我在做一些研究，而Boglehead的方法真的\n與我產生了共鳴。我今年23歲，很快就會開始我的第一份工作。\n不幸的是，我的父母在COVID期間去世了，但給我留下了一些錢。\n我真的不想浪費他們的錢，爲自己準備...",
      "title": "尋求幫助的起步 (23M)"
    }
  ],
  "title": "Looking for help starting out (23M)",
  "created_utc": 1622283999,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi Everyone! I was doing some research and the Boglehead approach really resonated with me. I am 23 years old and will be starting my first job soon. Unfortunately, my parents passed away during COVID, but left me with some money. I really do not want to waste their money and prepare myself for retirement. Current plan is to throw my money into my company&#39;s Roth 403b to max the 5% match and then throw some money into a Roth IRA. I guess these are my non-taxable accounts. I guess my question is, with my inheritance would it be best to just open a Vanguard account and throw it all into VTSAX? This is my taxable account? Thank you so much.</p>\n</div><!-- SC_ON -->",
  "score": 18,
  "permalink": "/r/Bogleheads/comments/nn0b02/looking_for_help_starting_out_23m/",
  "subreddit": "Bogleheads",
  "id": "nn0b02",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804299107
}