{
  "author": "hotmomma21",
  "the_new_excerpt": "Hello I'm just a regular mom who knows nothing about stocks or trading. My 17\nyear old son told me to invest in Gamestop way back and now I'm kicking myself\nin the ASS!!! He also told me to invest in Etheruem and in Jan I bought $250\nworth and now I have over $1k in there. (I'm saving it for his…",
  "original_created_utc": 1622051708,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは、私は株や取引について何も知らない普通の母親です。私の17歳の息子が\n17歳の息子が昔、Gamestopに投資するように言ったのですが、今になって自分で自分を責めています。\nしています。彼はまた私にEtheruemに投資するように言い、1月に250ドル分を購入しました。\n買って、今では1,000ドル以上入っている。(私は彼のためにそれを保存しています...)",
      "title": "ブラックベリー？私のSon..... を聞く？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好，我只是一个普通的妈妈，对股票和交易一无所知。我的17\n我17岁的儿子告诉我投资Gamestop，现在我正在踢自己的屁股。\n在屁股上！！。他还告诉我投资Etheruem，我在1月份买了250美元的\n价值，现在我有超过1000美元在里面。(我把它留给他的...",
      "title": "黑莓？听我的Son.....?"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好，我只是一個普通的媽媽，對股票和交易一無所知。我的17\n我17歲的兒子告訴我投資Gamestop，現在我正在踢自己的屁股。\n在屁股上！！。他還告訴我投資Etheruem，我在1月份買了250美元的\n價值，現在我有超過1000美元在裏面。(我把它留給他的...",
      "title": "黑莓？聽我的Son.....?"
    }
  ],
  "title": "Blackberry?? Listen to my Son.....??",
  "created_utc": 1622106396,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello I&#39;m just a regular mom who knows nothing about stocks or trading. My 17 year old son told me to invest in Gamestop way back and now I&#39;m kicking myself in the ASS!!! He also told me to invest in Etheruem and in Jan I bought $250 worth and now I have over $1k in there. (I&#39;m saving it for his college). Also kicking my ass for not buying more. Lol Well now he is telling me to invest in Blackberry. Does anyone know anything about this? I&#39;m wondering if I should? I&#39;ll buy a little bit just to make him happy, but just wanted to see if anyone with knowledge could give me a suggestion? My son is pretty tech savvy and really smart with math. I&#39;m just not sure if he just listening to some random people who don&#39;t know what they are talking about. Figured it&#39;s best to ask you experts! Thanks in advance. It&#39;s very much appreciated.</p>\n</div><!-- SC_ON -->",
  "score": 38,
  "permalink": "/r/stocks/comments/nln5br/blackberry_listen_to_my_son/",
  "subreddit": "stocks",
  "id": "nln5br",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197389741
}