{
  "author": "CommunityPoints",
  "original_created_utc": 1632956703,
  "title": "New Moons Distribution (Round 18 Proposal)",
  "created_utc": 1632972998,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Update (9/29)</strong>: Following <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/pftw5l/disincentivize_extreme_moon_farming_spam/\">this poll</a>, a new rule disincentivizing too many posts and comments in a day has been implemented starting with this distribution.</p>\n\n<p>Moons are <a href=\"/r/CryptoCurrency\">r/CryptoCurrency</a>&#39;s version of Community Points. <a href=\"https://reddit.com/community-points\">Community Points</a> are a way for users to be rewarded for their contributions to the subreddit, and they can be used on premium features in the community.</p>\n\n<p>Moons are distributed every 4 weeks based on contributions people make to <a href=\"/r/CryptoCurrency\">r/CryptoCurrency</a>. For every distribution, Reddit publishes karma data as a default measure of contribution. The community can review the data and optionally propose an alternative distribution, if they wish.</p>\n\n<p>This distribution is based on karma earned from 2021-09-01 to 2021-09-28. <a href=\"https://reddit-meta-production.s3.amazonaws.com/distribution/publish/CryptoCurrency/round_18_proposed.csv\">Here is the data.</a></p>\n\n<p>To propose an alternative distribution:</p>\n\n<ul>\n<li>You can create a CSV with alternative contribution scores or propose changes to the algorithm used to calculate them from karma (as long as the changes can be implemented easily).</li>\n<li>The amount of Moons distributed to a user will be proportional to their contribution score. Contribution scores cannot be negative.</li>\n<li>Make a poll to have the community vote on your proposal. Include an accurate description of the changes you are proposing.</li>\n<li>In order to pass, the winning option in the poll must meet the decision threshold (minimum number of Moons in support). If it is in favor of the change, it becomes the official contribution measurement (unless there is evidence of abuse in the vote, such as bribery). Algorithm changes will carry forward to future distributions.</li>\n<li>In case of multiple competing polls passing, the one with the most Moons cast in favor will be the official one.</li>\n<li>If no alternative passes, the data provided here will become official.</li>\n</ul>\n\n<p>The contribution scores for this round will be finalized on 2021-10-06. Any poll proposing an alternative needs to be completed by then.</p>\n\n<p>After the scores are finalized, Reddit will sign the data and publish the final, official data. After that, people with a registered Vault will receive Moons directly into their Vault. Other users will receive their Moons when they create and register a Vault.</p>\n</div><!-- SC_ON -->",
  "score": 162,
  "permalink": "/r/CryptoCurrency/comments/py6z4o/new_moons_distribution_round_18_proposal/",
  "subreddit": "CryptoCurrency",
  "id": "py6z4o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Update (9/29): Following this poll\n[https://www.reddit.com/r/CryptoCurrency/comments/pftw5l/disincentivize_extreme_moon_farming_spam/],\na new rule disincentivizing too many posts and comments in a day has been\nimplemented starting with this distribution.\n\nMoons are r/CryptoCurrency…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "更新（9/29）しました。この投票を受けて\n[https://www.reddit.com/r/CryptoCurrency/comments/pftw5l/disincentivize_extreme_moon_farming_spam/]をご覧ください。\n今回の配信から、1日の投稿数やコメント数が多すぎないようにするルールを設けました。\n今回の配信から実施します。\n\nムーンはr/CryptoCurrency...",
      "title": "ニュームーンの配信（ラウンド18提案"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "更新（9/29）。在这次投票之后\n[https://www.reddit.com/r/CryptoCurrency/comments/pftw5l/disincentivize_extreme_moon_farming_spam/]。\n一个新的规则，不鼓励在一天内有太多的帖子和评论。\n从这个分发开始实施。\n\n月亮是r/CryptoCurrency...",
      "title": "新月分布（第18轮提案"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "更新（9/29）。在這次投票之後\n[https://www.reddit.com/r/CryptoCurrency/comments/pftw5l/disincentivize_extreme_moon_farming_spam/]。\n一個新的規則，不鼓勵在一天內有太多的帖子和評論。\n從這個分發開始實施。\n\n月亮是r/CryptoCurrency...",
      "title": "新月分佈（第18輪提案"
    }
  ]
}