{
  "author": "UTrider",
  "the_new_excerpt": "Was happy to see news this morning that Lordstown Motors had the first two beta\ntrucks come off the assembly line yesterday. I know I know -- SEC investigation\n-- yes I know one of their trucks burned to the ground in January on a test\ndrive.\n\nBut i like the way they are doing the trucks. They…",
  "original_created_utc": 1617272507,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "今天早上很高兴地看到新闻，Lordstown汽车有第一批两个测试版。\n卡车昨天才下线 我知道我知道 -- 美国证券交易委员会的调查\n-- 是的，我知道他们的一辆卡车在一月份的一次测试中被烧毁了。\n驱动器。\n\n但我喜欢他们做卡车的方式。他们...",
      "title": "Lordstown motors beta卡车下线。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天早上很高興地看到新聞，Lordstown汽車有第一批兩個測試版。\n卡車昨天才下線 我知道我知道 -- 美國證券交易委員會的調查\n-- 是的，我知道他們的一輛卡車在一月份的一次測試中被燒燬了。\n驅動器。\n\n但我喜歡他們做卡車的方式。他們...",
      "title": "Lordstown motors beta卡車下線。"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "今朝のニュースで、Lordstown Motorsが最初の2つのベータを持っていたことを知って嬉しかった。\nトラックが生産ラインから出荷されたというニュースを見て、嬉しくなりました。知っています、知っています -- SECの調査\n-- 1月にテストドライブ中にトラックの1台が焼失したことは知っています。\nしかし\n\nしかし、私は彼らのトラックのやり方が気に入っています。彼らは...",
      "title": "ロードスタウン・モーターズのベータ・トラックが組み立てラインから外れた"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "今朝のニュースで、Lordstown Motorsが最初の2つのベータを持っていたことを知って嬉しかった。\nトラックが生産ラインから出荷されたというニュースを見て、嬉しくなりました。知っています、知っています -- SECの調査\n-- 1月にテストドライブ中にトラックの1台が焼失したことは知っています。\nしかし\n\nしかし、私は彼らのトラックのやり方が気に入っています。彼らは...",
      "title": "ロードスタウン・モーターズのベータ・トラックが組み立てラインから外れた"
    }
  ],
  "title": "Lordstown motors beta trucks come off assembly line",
  "created_utc": 1617296951,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Was happy to see news this morning that Lordstown Motors had the first two beta trucks come off the assembly line yesterday. I know I know -- SEC investigation -- yes I know one of their trucks burned to the ground in January on a test drive.</p>\n\n<p>But i like the way they are doing the trucks.  They actually look like a truck -- compare it to the Cyber truck, and just looks alone it wins hands down.  I also think the hub motors will be the way for EV to go in the future.  The space a motor like Tesla uses can be dedicated to storage area or more battery space for longer distances.</p>\n\n<p>I&#39;m slowly coming to face reality that EV will be what we drive in the next 10 to 15 years.  So I&#39;ve been watching and reading on different companies.  I do have a few shares of Lordstown (38 shares -- please stop laughing at the small amount.)</p>\n\n<p>Hopefully the remaining test trucks come off the line without a hitch, the testing of them goes off without a hitch, and production starts this fall.</p>\n\n<p><a href=\"https://electrek.co/2021/03/31/lordstown-motors-reveals-its-first-two-endurance-betas/\">https://electrek.co/2021/03/31/lordstown-motors-reveals-its-first-two-endurance-betas/</a></p>\n</div><!-- SC_ON -->",
  "score": 51,
  "permalink": "/r/stocks/comments/mhsasq/lordstown_motors_beta_trucks_come_off_assembly/",
  "subreddit": "stocks",
  "id": "mhsasq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961877895
}