{
  "author": "Rich-12-88",
  "the_new_excerpt": "Japan’s Nikkei 225 drops more than 3%, leading losses across major markets in\nAsia\n\nJapanese stocks led losses regionally, with the Nikkei 225 falling 3.18% in\nMonday morning trade. China on Monday announced that the one-year Loan Prime\nRate (LPR) was kept unchanged at 3.85% while the five-year LPR…",
  "original_created_utc": 1624246211,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "日本の日経平均株価が3％以上下落し、世界の主要市場の下落を牽引\nアジア\n\n月曜日の朝、日本の日経平均株価は3.18%の下落となり、アジアの主要市場では日本株が下落しました。\n月曜の朝の取引では、日本株が3.18%下落しました。中国は月曜日、1年物のローンプライムレート(LPR)を据え置いたと発表しました。\n中国は、1年物の貸出金利を3.85%に据え置き、5年物の貸出金利を3.85%に据え置きました。",
      "title": "6月21日（月）アジア市場が夜通しで大きく下落"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "日本日经225指数下跌超过3%，领跌各主要市场\n亚洲\n\n日本股市在区域内领跌，日经225指数在周一早盘下跌3.18%。\n周一早盘。中国周一宣布，一年期贷款最优惠利率\n贷款利率（LPR）保持在3.85%不变，而五年期LPR...",
      "title": "6月21日星期一 - 隔夜亚洲市场大跌"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "日本日經225指數下跌超過3%，領跌各主要市場\n亞洲\n\n日本股市在區域內領跌，日經225指數在週一早盤下跌3.18%。\n週一早盤。中國週一宣佈，一年期貸款最優惠利率\n貸款利率（LPR）保持在3.85%不變，而五年期LPR...",
      "title": "6月21日星期一 - 隔夜亞洲市場大跌"
    }
  ],
  "title": "Monday, June 21st - big drops in Asian markets overnight",
  "created_utc": 1624253158,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Japan’s Nikkei 225 drops more than 3%, leading losses across major markets in Asia</p>\n\n<p>Japanese stocks led losses regionally, with the Nikkei 225 falling 3.18% in Monday morning trade.\nChina on Monday announced that the one-year Loan Prime Rate (LPR) was kept unchanged at 3.85% while the five-year LPR was also held steady at 4.65%. That was in line with expectations of majority of analysts in a snap Reuters poll, who had predicted no change to the one-year Loan Prime Rate as well as the five-year LPR.\nSINGAPORE — Shares in Asia-Pacific dropped in Monday morning trade, as Japan’s markets plummeted in the morning. Meanwhile, China kept its benchmark lending rate unchanged.</p>\n\n<p>Japanese stocks led losses regionally, with the Nikkei 225 falling 3.18%. The Topix index shed 2.44%.</p>\n\n<p>Losses were seen in most sectors in Japan, with shares of automakers such as Nissan and Honda falling more than 3% each. Shares of Fanuc slumped nearly 5%. Meanwhile among financials, Mitsubishi UFJ Financial Group shares fell 2.36% and Mizuho Financial Group declined 2.09%.</p>\n\n<p>Markets in Asia-Pacific slip</p>\n\n<p>Elsewhere in Asia-Pacific, Hong Kong’s Hang Seng index dropped 1.45%. Mainland Chinese stocks fell in early trade as the Shanghai composite declined 0.43% and the Shenzhen component shed 0.717%.</p>\n\n<p>South Korea’s Kospi declined 0.71%. Shares in Australia slipped, with the S&amp;P/ASX 200 shedding 1.69%.</p>\n\n<p>MSCI’s broadest index of Asia-Pacific shares outside Japan traded 0.97% lower.</p>\n\n<p>“Markets continue their post-FOMC slump as concerns over rate normalisation continues to keep a lid on risk sentiment,” analysts at Singapore’s OCBC Bank wrote in a note dated Monday.</p>\n\n<p>Last week, the U.S. Federal Reserve raised its expectations for inflation and moved forward the timeline of its interest rate hikes, setting off a surge in the dollar index against a basket of its peers.</p>\n\n<p>The U.S. dollar index was at 92.26 after a recent climb from levels below 91.2.</p>\n\n<p>Stock picks and investing trends from CNBC Pro:\nThe global bull market will run through 2021 with only small pullbacks, Ned Davis Research predicts\nEnergy stocks roar toward their best year in three decades amid recovery in oil\nGoldman believes these quality stocks are cheap\nChina on Monday announced that the one-year Loan Prime Rate (LPR) was kept unchanged at 3.85% while the five-year LPR was also held steady at 4.65%. That was in line with expectations of majority of analysts in a snap Reuters poll, who had predicted no change to the one-year Loan Prime Rate as well as the five-year LPR.</p>\n\n<p>TICKER  COMPANY NAME    PRICE   CHANGE  %CHANGE\n.N225   Nikkei 225 Index    NIKKEI  27980.87    -983.21 -3.39\n.HSI    Hang Seng Index HSI 28416.15    -385.12 -1.34\n.AXJO   S&amp;P/ASX 200 ASX 200 7243.10 -125.80 -1.71\n.SSEC   Shanghai    SHANGHAI    3513.95 -11.14  -0.32\n.KS11   KOSPI Index KOSPI   3230.88 -37.05  -1.13\n.FTFCNBCA   CNBC 100 ASIA IDX   CNBC 100    10744.06    -226.29 -2.06\nCurrencies and oil</p>\n\n<p>The Japanese yen traded at 110.15 per dollar, stronger than levels above 110.5 against the greenback seen last week. The Australian dollar changed hands at $0.7506, still struggling to recover after its fall last week from above $0.768.</p>\n\n<p>Oil prices were higher in the morning of Asia trading hours, with international benchmark Brent crude futures up 0.68% to $74.01 per barrel. U.S. crude futures advanced 0.8% to $72.21 per barrel.</p>\n\n<p>— CNBC’s Patti Domm contributed to this report.</p>\n</div><!-- SC_ON -->",
  "score": 50,
  "permalink": "/r/stocks/comments/o4m1ka/monday_june_21st_big_drops_in_asian_markets/",
  "subreddit": "stocks",
  "id": "o4m1ka",
  "is_self": true,
  "media": null,
  "is_video": false
}