{
  "author": "robdog301",
  "original_created_utc": 1634381219,
  "title": "Should I be upset or just let it go?",
  "created_utc": 1634391067,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So Ive been working out of town a lot for the past couple months. My wife of 5 years stays at home with our two kids. She is in her last year of school so she has a lot to do by herself mostly so I try to not ask for much and do my best to make it easier for her when I&#39;m not home or when I am. I am gone for two weeks at a time so when I am home I try to be intimate with her as much as possible before leaving again. </p>\n\n<p>If it happens it happens if it doesn&#39;t it doesn&#39;t kids kind of have a way of keeping us busy. We talk a lot about wanting and needing each other, but just this last time I was coming home and about an hour before I was there she says she&#39;s going out with her friend. No big deal, I encourage her to spend her time with her friends it&#39;s good to get away and have adult fun when you can get someone to watch the kids for a bit.</p>\n\n<p>I arrive and the kids are a little wild not a big deal so I shower and play with my youngest for a bit then put my kids and her friends kids to bed. It&#39;s been two and a half hours now (1030pm) that they are gone and she says shes coming back soon so I try to stay awake because I want to at least see her before going to bed. She gets home at 2am and we cuddle a bit and I initiate sex but she says she&#39;s feeling spinny so I back off and she rolls over and goes to sleep. Im wide awake now feeling a little hurt but should I not understand she spends all her time alone with the kids trying to get through school when I&#39;m not there? I feel disappointed that she doesn&#39;t seem so happy or eager to see me. I also feel that I should be patient and attentive to her needs too. I don&#39;t know if I should be upset or just let it go.</p>\n</div><!-- SC_ON -->",
  "score": 139,
  "permalink": "/r/TooAfraidToAsk/comments/q99n6o/should_i_be_upset_or_just_let_it_go/",
  "subreddit": "TooAfraidToAsk",
  "id": "q99n6o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So Ive been working out of town a lot for the past couple months. My wife of 5\nyears stays at home with our two kids. She is in her last year of school so she\nhas a lot to do by herself mostly so I try to not ask for much and do my best to\nmake it easier for her when I'm not home or when I am. I am…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この2、3ヶ月間、私は街の外で仕事をすることが多かったんです。私の妻は5年間\n歳の妻は2人の子供と一緒に家にいます。彼女は学校の最終学年なので\n自分でやることが多いので、あまり頼まないようにして、私が家にいないときに彼女が楽になるように最善を尽くしています。\n私が家にいないときも、家にいるときも、妻が楽になるように最善を尽くしています。私は...",
      "title": "怒るべきなのか、放っておくべきなのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，在过去几个月里，我经常在城外工作。我5年的妻子\n年的妻子留在家里照顾我们的两个孩子。她正处于学校的最后一年，所以她有很多事情要自己做。\n所以我尽量不要求太多，并尽我所能在我不在的时候让她更轻松。\n当我不在家或在家时，让她更轻松。我是...",
      "title": "我是应该不高兴，还是让它过去？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，在過去幾個月裏，我經常在城外工作。我5年的妻子\n年的妻子留在家裏照顧我們的兩個孩子。她正處於學校的最後一年，所以她有很多事情要自己做。\n所以我儘量不要求太多，並盡我所能在我不在的時候讓她更輕鬆。\n當我不在家或在家時，讓她更輕鬆。我是...",
      "title": "我是應該不高興，還是讓它過去？"
    }
  ]
}