{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "I just want to share my personal opinion. \n\nWe all know the common arguments against owning Chinese stocks, which are questionable VIA structure, questionable accounting, questionable auditing and also being dependent on policies of the CCP like the recent interventions against the education sector and gaming sector. That doesn't stop many from investing in Chinese stocks, saying it will be all right and that some of their stocks appear to be very undervalued (to which I agree). \n\nHowever another risk which becomes obvious now is Chinas aggression against it's neighbors, in particular Taiwan. China isn't making a secret out of it, that they plan to invade Taiwan at some point in the future and they do not accept Taiwan as an independent nation as it currently is.\n\nWe can only hope that it never happens, but if it happens (And at least for me I think it's somewhat likely in the long-term), you can be sure that China will receive the same sanctions as Russia right now and China will also fight back with similar methods. In such a case the Chinese stock market and the yuan will be likely crashing like in Russia right now.  But even more importantly, you can be almost sure, that you will not be able to sell your BABA ADRs no matter how good the fundamentals are. It appears to be likely that China would ban foreign access to Chinese capital markets and the VIA structures would suddenly become illegal. Chinese stocks will have for any non Chinese citizen a value of $0.\n\nConsidering such a situation, it appears to be not smart to own large amounts of Chinese stocks. And anyone who still decides to own them should take the risk of such a scenario into account.",
  "author_fullname": "t2_afkj1wrf",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "I think the war in Ukraine shows well why you shouldn't buy and hold Chinese Stocks (at a large extent)",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": "discussion",
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": true,
  "name": "t3_t3lsow",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.81,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 1028,
  "total_awards_received": 1,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Industry Discussion",
  "can_mod_post": false,
  "score": 1028,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": true,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1646071738,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I just want to share my personal opinion. &lt;/p&gt;\n\n&lt;p&gt;We all know the common arguments against owning Chinese stocks, which are questionable VIA structure, questionable accounting, questionable auditing and also being dependent on policies of the CCP like the recent interventions against the education sector and gaming sector. That doesn&amp;#39;t stop many from investing in Chinese stocks, saying it will be all right and that some of their stocks appear to be very undervalued (to which I agree). &lt;/p&gt;\n\n&lt;p&gt;However another risk which becomes obvious now is Chinas aggression against it&amp;#39;s neighbors, in particular Taiwan. China isn&amp;#39;t making a secret out of it, that they plan to invade Taiwan at some point in the future and they do not accept Taiwan as an independent nation as it currently is.&lt;/p&gt;\n\n&lt;p&gt;We can only hope that it never happens, but if it happens (And at least for me I think it&amp;#39;s somewhat likely in the long-term), you can be sure that China will receive the same sanctions as Russia right now and China will also fight back with similar methods. In such a case the Chinese stock market and the yuan will be likely crashing like in Russia right now.  But even more importantly, you can be almost sure, that you will not be able to sell your BABA ADRs no matter how good the fundamentals are. It appears to be likely that China would ban foreign access to Chinese capital markets and the VIA structures would suddenly become illegal. Chinese stocks will have for any non Chinese citizen a value of $0.&lt;/p&gt;\n\n&lt;p&gt;Considering such a situation, it appears to be not smart to own large amounts of Chinese stocks. And anyone who still decides to own them should take the risk of such a scenario into account.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "8acd2324-65e6-11e5-a263-122ab0778f8b",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#4f8ef7",
  "id": "t3lsow",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "doctorzaius6969",
  "discussion_type": null,
  "num_comments": 34,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/t3lsow/i_think_the_war_in_ukraine_shows_well_why_you/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/t3lsow/i_think_the_war_in_ukraine_shows_well_why_you/",
  "subreddit_subscribers": 3694510,
  "created_utc": 1646076469,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1646071738,
  "the_new_excerpt": "I just want to share my personal opinion.\n\nWe all know the common arguments against owning Chinese stocks, which are\nquestionable VIA structure, questionable accounting, questionable auditing and\nalso being dependent on policies of the CCP like the recent interventions\nagainst the education sector…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ただ、個人的な意見を述べたいと思います。\n\n中国株を保有することに対する一般的な反論は、誰もが知っている。\n疑問のあるVIA構造、疑問のある会計、疑問のある監査、そして\nまた、最近の介入など中国共産党の政策に左右されることもある。\n教育セクターに対する...",
      "title": "ウクライナの戦争は、中国株を買い持ちしてはいけない理由をよく示していると思う（かなりの程度で）。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我只想分享我的个人观点。\n\n我们都知道反对持有中国股票的常见论点，那就是\n有问题的VIA结构、有问题的会计、有问题的审计以及\n还有就是依赖中国共产党的政策，比如最近对教育部门的干预。\n对教育部门的干预......",
      "title": "我认为乌克兰的战争很好地说明了为什么你不应该购买和持有中国的股票（在很大程度上）。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我只想分享我的個人觀點。\n\n我們都知道反對持有中國股票的常見論點，那就是\n有問題的VIA結構、有問題的會計、有問題的審計以及\n還有就是依賴中國共產黨的政策，比如最近對教育部門的干預。\n對教育部門的干預......",
      "title": "我認爲烏克蘭的戰爭很好地說明了爲什麼你不應該購買和持有中國的股票（在很大程度上）。"
    }
  ],
  "source_updated_at": 1646386893958
}