{
  "author": "Randomized_Emptiness",
  "original_created_utc": 1630636703,
  "title": "Unpopular opinion: this sub doesn't like honesty",
  "created_utc": 1630668709,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There&#39;s a saying: &quot;each sub is it&#39;s own echo chamber&quot;</p>\n\n<p>Views that differ from what&#39;s accepted and agreed upon as true are heavily downvoted. Downvoting opinions, that hold a contrarian view to the point they get hidden are a great tool to enforce this echo chamber, but it limits the subs usefulness as a source of unbiased information. </p>\n\n<p>Just to give an example to illustrate, here&#39;s some data:</p>\n\n<p>USD is a world reserve currency, so 1 USD = 1 USD. It&#39;s current inflation is ~ 5%, so people view it as a bad investment, as you lose ~5% annually on it. </p>\n\n<p>Now let&#39;s take a look at Algorand. It has a 6% network reward. It&#39;s inflation is 19%. This is a -13% APY. </p>\n\n<p>Even a mere mention of the fact, that currently ALGO has worse Tokenomics than the US Dollar brings out the downvote army. And stifles any discussion. </p>\n\n<p>What is the deal with downvoting anything that doesn&#39;t agree with ones beliefs? </p>\n\n<p>Edit: I&#39;m also somewhat salty, that commenting unpopular opinions cost money. With the upcoming karma-to-moon ratio, a simple comment on how the USD has better Tokenomics than ALGO will probably cost me more than $1. This is a major encouragement to only post stuff the majority agrees with and further enforces this echo chamber.</p>\n</div><!-- SC_ON -->",
  "score": 182,
  "permalink": "/r/CryptoCurrency/comments/pgwbmh/unpopular_opinion_this_sub_doesnt_like_honesty/",
  "subreddit": "CryptoCurrency",
  "id": "pgwbmh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "There's a saying: \"each sub is it's own echo chamber\"\n\nViews that differ from what's accepted and agreed upon as true are heavily\ndownvoted. Downvoting opinions, that hold a contrarian view to the point they\nget hidden are a great tool to enforce this echo chamber, but it limits the subs\nusefulness…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "という言葉があります。\"各サブはそれ自身のエコーチャンバーである\"\n\n真実として受け入れられ、同意されていることと異なる見解は、大きくダウンブレートされます。\n下げられます。反対意見を持っている意見を非表示にすることは、この反響室を強化するための素晴らしいツールです。\nこのエコーチェンバーを強化するための素晴らしいツールですが、サブの有用性が制限されてしまいます。\n役に立ちません。",
      "title": "不評な意見：このサブは正直者が嫌いです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有一句话是这样说的。\"每个子都是它自己的回声室\"\n\n与公认的真实情况不同的观点会被大量的\n贬低。对持有相反观点的意见进行降权，以至于它们被隐藏。\n被隐藏的意见是执行这个回声室的一个伟大工具，但它限制了子频道的\n的作用......",
      "title": "不受欢迎的意见：这个子不喜欢诚实"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有一句話是這樣說的。\"每個子都是它自己的回聲室\"\n\n與公認的真實情況不同的觀點會被大量的\n貶低。對持有相反觀點的意見進行降權，以至於它們被隱藏。\n被隱藏的意見是執行這個回聲室的一個偉大工具，但它限制了子頻道的\n的作用......",
      "title": "不受歡迎的意見：這個子不喜歡誠實"
    }
  ]
}