{
  "author": "Appropriate-Lie6592",
  "original_created_utc": 1642243867,
  "title": "How can I get the confidence to touch my boyfriends dick?",
  "created_utc": 1642269330,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Me (f18) and my boyfriend it&amp;#39;s both our first relationship. And he likes to touch me and does that too. But I never really touched him yet other than back, stomach etc. And I kinda really want to touch his dick. \nYesterday I had the chance to but I just couldn&amp;#39;t bring myself to do it.\nI&amp;#39;m just to afraid to do something wrong, that I hurt him somehow, that he doesn&amp;#39;t like it or I don&amp;#39;t like the feel of it and never want to do it again. \nI&amp;#39;ve never seen or touched a dick before really so I&amp;#39;m just so unsure.\nWhat advice can you give me?\nHow can I get more confidence?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 115,
  "permalink": "/r/TooAfraidToAsk/comments/s4huc3/how_can_i_get_the_confidence_to_touch_my/",
  "subreddit": "TooAfraidToAsk",
  "id": "s4huc3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "Me (f18) and my boyfriend it's both our first relationship. And he likes to\ntouch me and does that too. But I never really touched him yet other than back,\nstomach etc. And I kinda really want to touch his dick. Yesterday I had the\nchance to but I just couldn't bring myself to do it. I'm just to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私(f18)と彼氏は、お互い初めての恋愛です。そして、彼が好きなのは\n触ってくれたり、してくれたりします。しかし、私はまだ背中以外を触ったことがありません。\nお腹など そして、なんとなく彼のペニスを触ってみたいのです。昨日、私は\nでも、その気になれなくて。私はただ...",
      "title": "どうしたら彼氏のペニスを触る自信がつくのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我（18岁）和我的男朋友，我们都是第一次恋爱。他喜欢\n他喜欢抚摸我，也会这样做。但我从来没有真正触摸过他，除了背部。\n肚子等等。我真的很想触摸他的阴茎。昨天我有机会\n机会，但我就是不能让自己去做。我只是想...",
      "title": "我怎样才能有信心去摸我男朋友的鸡巴？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我（18歲）和我的男朋友，我們都是第一次戀愛。他喜歡\n他喜歡撫摸我，也會這樣做。但我從來沒有真正觸摸過他，除了背部。\n肚子等等。我真的很想觸摸他的陰莖。昨天我有機會\n機會，但我就是不能讓自己去做。我只是想...",
      "title": "我怎樣纔能有信心去摸我男朋友的雞巴？"
    }
  ]
}