{
  "author": "Puzzleheaded_Hat_263",
  "original_created_utc": 1639829359,
  "title": "Does it look like I'm staring at your chest even though I'm not?",
  "created_utc": 1639859487,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a taller guy at around 6 ft 4. The world is not efficiently built for taller people so I naturally am looking at an angle downwards to see what in doing. Issue is any average height breasted person in my town has there chest inconveniently located right where my resting point of my eyes are. I make immediate corrections when I see the chest appear in my focal point but always feel awkward. &lt;/p&gt;\n\n&lt;p&gt;Am I the only one with this issue? Should I still go to my family gatherings? Shall I notify my close friends and family it&amp;#39;s an accidental reoccurring occurrence?&lt;/p&gt;\n\n&lt;p&gt;Edit: I haven&amp;#39;t been 6 ft 4 for a long time now, just got a rapid growth spurt and grew 6 inches. Wasn&amp;#39;t an issue before but now it is.&lt;/p&gt;\n\n&lt;p&gt;Edit: should mention I&amp;#39;m gay this is purely an awkward scenario I keep finding myself in. Not some gross perv way of living.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/rj688u/does_it_look_like_im_staring_at_your_chest_even/",
  "subreddit": "TooAfraidToAsk",
  "id": "rj688u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm a taller guy at around 6 ft 4. The world is not efficiently built for taller\npeople so I naturally am looking at an angle downwards to see what in doing.\nIssue is any average height breasted person in my town has there chest\ninconveniently located right where my resting point of my eyes are. I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は身長180cmくらいで背が高い方なんですけどね。世の中は背の高い人向けに効率的に作られているわけではありません。\nを見るために、自然と斜め下を向いてしまう。\n問題は、私の町にいる平均的な身長の胸のある人は、そこに胸があることです。\n不便なことに、私の目の休まる位置は、ちょうどそこにあるのです。I...",
      "title": "胸を見つめているわけではないのに、見つめているように見える？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个较高的人，大约6英尺4英寸。这个世界并没有为高个子的人有效地建造\n所以我自然而然地从一个角度向下看，看自己在做什么。\n问题是，在我的城市里，任何平均身高的胸脯的人，他们的胸部\n恰好位于我眼睛的休息点，很不方便。I...",
      "title": "这看起来像是我在盯着你的胸部看，尽管我没有？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個較高的人，大約6英尺4英寸。這個世界並沒有爲高個子的人有效地建造\n所以我自然而然地從一個角度向下看，看自己在做什麼。\n問題是，在我的城市裏，任何平均身高的胸脯的人，他們的胸部\n恰好位於我眼睛的休息點，很不方便。I...",
      "title": "這看起來像是我在盯着你的胸部看，儘管我沒有？"
    }
  ]
}