{
  "author": "gamerweeb1",
  "original_created_utc": 1656595484,
  "title": "Why does Japanese anime and manga sexualise high school girls so much?",
  "created_utc": 1656609987,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;To be clear, I&amp;#39;m not saying that Western media never sexualises high school girls. But it is EXTREMELY common for high school girls in anime to be sexualised. Things like short skirts, panty shots and large jiggling breasts are very common in anime and manga, even some of the most popular ones.&lt;/p&gt;\n\n&lt;p&gt;Is there a reason why this so common in Japanese media? And why does Japanese culture seems to be more open to sexualisation of high schoolers?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 132,
  "permalink": "/r/NoStupidQuestions/comments/vo8c52/why_does_japanese_anime_and_manga_sexualise_high/",
  "subreddit": "NoStupidQuestions",
  "id": "vo8c52",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "To be clear, I'm not saying that Western media never sexualises high school\ngirls. But it is EXTREMELY common for high school girls in anime to be\nsexualised. Things like short skirts, panty shots and large jiggling breasts are\nvery common in anime and manga, even some of the most popular ones.\n\nIs…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "はっきり言って、欧米のメディアが高校生を決して性的に扱わないと言っているわけではありません。\nないとは言いません。しかし、アニメに登場する女子高生が性的描写を受けることは、極めて一般的です。\nることはよくあることです。短いスカート、パンティーショット、大きな胸の揺れなどは、アニメや漫画でよく見られます。\nアニメや漫画ではよくあることで、人気のあるものでもそうです。\n\nそれは...",
      "title": "日本のアニメや漫画は、なぜ女子高生をこれほどまでに性的に扱うのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "明确地说，我并不是说西方媒体从来没有将高中生性化。\n女孩。但是，在动漫中，高中女生被性化是非常普遍的。\n性化。像短裙、内裤镜头和巨大的抖动的乳房都是\n在动画和漫画中非常常见，即使是一些最受欢迎的动画。\n\n是...",
      "title": "为什么日本的动画和漫画会把女高中生的性欲表现得如此强烈？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "明確地說，我並不是說西方媒體從來沒有將高中生性化。\n女孩。但是，在動漫中，高中女生被性化是非常普遍的。\n性化。像短裙、內褲鏡頭和巨大的抖動的乳房都是\n在動畫和漫畫中非常常見，即使是一些最受歡迎的動畫。\n\n是...",
      "title": "爲什麼日本的動畫和漫畫會把女高中生的性慾表現得如此強烈？"
    }
  ]
}