{
  "author": "bighdaddie",
  "the_new_excerpt": "Do you want reality? I was a big short seller back in the 80's. Short Iomega at\n$12 and it went to $55. Margin calls out the ass. Like $200k per day. If I\nbought back the stock (covered) I would never be able to borrow it again so I\nwould be totally locked out. I bought the same number of shares…",
  "original_created_utc": 1612229816,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "你想要现实吗？我在80年代是个大空头。做空Iomega\n12元，就到了55元。保证金叫出了屁股。比如每天20万。如果我\n买回股票（覆盖），我将永远无法再借到它，所以我\n会被完全锁定。我买了同样数量的股票... ...",
      "title": "卖空者的自白"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你想要現實嗎？我在80年代是個大空頭。做空Iomega\n12元，就到了55元。保證金叫出了屁股。比如每天20萬。如果我\n買回股票（覆蓋），我將永遠無法再借到它，所以我\n會被完全鎖定。我買了同樣數量的股票... ...",
      "title": "賣空者的自白"
    }
  ],
  "title": "Confessions of a short seller",
  "created_utc": 1612237066,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Do you want reality? I was a big short seller back in the 80&#39;s. Short Iomega at $12 and it went to $55. Margin calls out the ass. Like $200k per day. If I bought back the stock (covered) I would never be able to borrow it again so I would be totally locked out. I bought the same number of shares that I was short so that I was both short and long (short against the box it is called). No matter which way the stock went I was even. When it finally peaked at $55 and started falling like a rock I sold my long side every day that I had enough margin and rode it down to $9. I made about $180k but believe me, it wasn&#39;t worth the stress.</p>\n\n<p>I am so tired of people saying that the shorts haven&#39;t covered. Or one neophyte asking &quot;What day are the shorts going to cover?&quot; I don&#39;t have a horse in this race (I day traded it last week several times) but I feel very bad for the new people getting in at the high. Especially one who said &quot;I paid my rent by credit card and used the money to buy GME&quot; That person is already under water.</p>\n\n<p>GME shorts all covered and/or boxed last week. Do you really think that you guys collectively have enough buying power to move it it from $65 to $483 with 500 million shares on your own? Time for a reality check.</p>\n</div><!-- SC_ON -->",
  "score": 29,
  "permalink": "/r/stocks/comments/lak74v/confessions_of_a_short_seller/",
  "subreddit": "stocks",
  "id": "lak74v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518541038
}