{
  "author": "Tux_fan",
  "original_created_utc": 1636310790,
  "title": "I'm from El Salvador...UPDATE 4",
  "created_utc": 1636324824,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi, it&#39;s time for an update about btc in my country.</p>\n\n<p>First of all, since my last post there haven&#39;t been any protest about btc.</p>\n\n<p>There haven&#39;t been any major issue or breaking new about btc in general...as I said many times before, nothing has really changed, just another payment method.</p>\n\n<p>However there have been many issues in the chivo app, the official wallet.</p>\n\n<p>Transactions between chivo apps works fine, if you&#39;re sending btc, by default you use a L1 qr code, however tx are instant with no issues so you can assume tx are not really done through the btc network.</p>\n\n<p>Transactions (either L1 or LN) from an external wallet like muun or coinomi  to chivo app works fine.</p>\n\n<p>Transactions (either L1 or LN) from chivo app to an external wallet have many problems, sometimes work, sometimes not...simply like that, although  I personally found that $2 transactions trough LN have no issues, problems appear from $5 onwards.</p>\n\n<p>Also, failed transactions are still deducted from your balance, so you have to call chivo app customer support and make a report of the tx, you have to wait about a week four your money to be reimbursed. </p>\n\n<p>Remember my $2 tx? which was originally $20 but due to a bug only $2 were send) I tough it was on the way to my other wallet however customer service told that failed chivo tx don&#39;t even enter the btc network...still I got my money back.</p>\n\n<p>I&#39;ve done other tx to external wallets and lost (temporaly) my money, have to call many times to customer support and wait (about a week) for a reimbursement.</p>\n\n<p>Similar problems have occurred sending money from chivo to a bank account.</p>\n\n<p>The next big issue is quite funny and frightening at the same time, many people start getting extra money, hundreds, thousands and millions of dollars...here is an article with a pic<a href=\"https://m.elsalvador.com/noticias/negocios/chivo-wallet-empresa-bukele-dinero-fraude/891236/2021/\">million</a></p>\n\n<p>This happened a couple weeks ago and is now fixed, but social media was stamped with people&#39;s chivo wallet screenshots.</p>\n\n<p>There were some people that send that money to their bank accounts and others retrieve it in chivo atms, later on they were called and ordered to give the money back, if not, prison and other legal things will be the outcome.</p>\n\n<p>Lastly, in chivo app you can convert btc to USD and viceversa while having a one minute period to make tx at a certain price, many people start scalping and making a nice profit. This was quickly fixed and now you have to wait 3 minutes between tx.</p>\n\n<p>So this were the most important things to notice, the gas discount still continues and its now $0.30 less for gallon, a vet will be built using the btc profit (although they won&#39;t sell the btc and get the earnings through other means).</p>\n\n<p>Aside chivo app problems everything is fine, some people   start getting interest in crypto and some other doesn&#39;t care.</p>\n\n<p>As always I&#39;ll try to answer any questions you have.</p>\n</div><!-- SC_ON -->",
  "score": 169,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/tdlKMD7QDj_jHs9OK5UHykD45rXEyvVWt3GgAgca8d4.jpg?auto=webp&s=0e3d6b89399f474ae1f73c7414415b24c4a55c0f",
          "width": 800,
          "height": 450
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/tdlKMD7QDj_jHs9OK5UHykD45rXEyvVWt3GgAgca8d4.jpg?width=108&crop=smart&auto=webp&s=510609c6d6a0b58c2bf675291a0086e9e51ca498",
            "width": 108,
            "height": 60
          },
          {
            "url": "https://external-preview.redd.it/tdlKMD7QDj_jHs9OK5UHykD45rXEyvVWt3GgAgca8d4.jpg?width=216&crop=smart&auto=webp&s=d3efb4e91af5565fc00344b9cf5a9ddf7ffad23e",
            "width": 216,
            "height": 121
          },
          {
            "url": "https://external-preview.redd.it/tdlKMD7QDj_jHs9OK5UHykD45rXEyvVWt3GgAgca8d4.jpg?width=320&crop=smart&auto=webp&s=73c868cef4de296ad82ae0bc511a9a97936f13ca",
            "width": 320,
            "height": 180
          },
          {
            "url": "https://external-preview.redd.it/tdlKMD7QDj_jHs9OK5UHykD45rXEyvVWt3GgAgca8d4.jpg?width=640&crop=smart&auto=webp&s=05cda25f8c675a54e432e8081d3a7b8c22ccf3b6",
            "width": 640,
            "height": 360
          }
        ],
        "variants": {},
        "id": "gGyBH6rQzgGPrx1po2Sk__CB7BIkCeLbjK5CjSeyVYg"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/Bitcoin/comments/qouy39/im_from_el_salvadorupdate_4/",
  "subreddit": "Bitcoin",
  "id": "qouy39",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi, it's time for an update about btc in my country.\n\nFirst of all, since my last post there haven't been any protest about btc.\n\nThere haven't been any major issue or breaking new about btc in general...as I\nsaid many times before, nothing has really changed, just another payment method.\n\nHowever…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは、私の国でのbtcに関する最新情報をお伝えする時が来ました。\n\nまず、前回の投稿以降、BTCに関する抗議活動は行われていません。\n\n一般的にbtcに関する大きな問題や新しい情報はありませんでした...私が言ったように\n前に何度も言ったように、実際には何も変わっておらず、ただ支払い方法が変わっただけです。\n\nしかし...",
      "title": "エルサルバドルから来ました...UPDATE 4"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嗨，是时候更新一下我国的btc了。\n\n首先，从我上一篇文章开始，还没有任何关于btc的抗议。\n\n一般来说，没有任何关于btc的重大问题或突发事件。\n我已经说过很多次了，没有什么真正的变化，只是多了一种支付方式。\n\n然而...",
      "title": "我来自萨尔瓦多...更新4"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嗨，是時候更新一下我國的btc了。\n\n首先，從我上一篇文章開始，還沒有任何關於btc的抗議。\n\n一般來說，沒有任何關於btc的重大問題或突發事件。\n我已經說過很多次了，沒有什麼真正的變化，只是多了一種支付方式。\n\n然而...",
      "title": "我來自薩爾瓦多...更新4"
    }
  ]
}