{
  "author": "KofiOlut",
  "original_created_utc": 1638201274,
  "title": "94% of Crypto Investors are 40 years old or younger , but my 71-year grandpa manages to outperform them all.",
  "created_utc": 1638234773,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My grandpa is an 71-year old retired physics and mathematics professor and crypto enthusiast. He bought his first 10 bitcoins (he told me he sold them just two years later) in 2013 after Crypto got a little more traction in the mainstream media and ever since then he has been on about the mathematical potential of blockchain technology. He is not in it for the money, his retirement benefits are more than enough, but for the tech.</p>\n\n<p>Since he was the only man in his age group invested in crypto I was curious how old crypto investors usually are.</p>\n\n<p>Cryptocurrency buyers breakdown by generation:</p>\n\n<p><a href=\"https://preview.redd.it/glriwv9e1k281.png?width=728&amp;format=png&amp;auto=webp&amp;s=4ef650c255befa6db80258218dd263340ffb66ad\">Source: https://www.stilt.com/blog/2021/03/vast-majority-crypto-buyers-millennials-gen-z/</a></p>\n\n<p>Boomers (57+) are only 1,22% of all the crypto investors and the age group from 65+ are probably a fraction from that percentage. Makes me think that older age groups are still not taking this whole thing serious and If they would, the market would probably explode (since they have a lot more capital to invest than millenials for example)</p>\n\n<p>Interestingly enough &quot;even though Gen X buyers only make up 4.9% of all crypto buyers, they bought an average of $9,611 in cryptocurrency over 12 months, or:</p>\n\n<ul>\n<li>1.6x more than Gen Z buyers</li>\n<li>1.1x more than Millennial buyers</li>\n</ul>\n\n<p>Older people — who’ve had more time to advance in their careers and who have access to large lines of credit — have more spending power and disposable income.</p>\n\n<p>How those individuals are spending that money on crypto — especially compared to younger buyers — is a bit surprising, though.</p>\n\n<p>As mentioned above, younger Gen Z and Millenial crypto buyers outnumber older buyers — by ~15x. So, it would be easy to chalk this all up to older investors’ uncertainty about an emerging and potentially volatile market and younger buyer’s willingness to take more risk.</p>\n\n<p>But the data tells a different story.</p>\n\n<p>It shows clearly that, not only are Gen X crypto buyers outspending younger buyers, but also that there’s also a correlation between increasing age and bigger spending on crypto.&quot; (Source: <a href=\"https://www.stilt.com/blog/2021/03/vast-majority-crypto-buyers-millennials-gen-z/\">https://www.stilt.com/blog/2021/03/vast-majority-crypto-buyers-millennials-gen-z/</a>)</p>\n\n<p>Needless to say for years my family and myself included thought he was crazy and that digital money wouldn&#39;t last. As we all know, we were wrong (and looked pretty stupid being wrong) and in 2018 I joined him in his crypto journey. Luckily he was very knowledgable to the point that I am lost more than a few times when I visit him, but his investment advice has so far always been solid and our mutual interest has also been good for our relationship. And even though he is not in it for the money, he has made quite good gains.</p>\n\n<p>Do you know any older folk that are into Crypto ?</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/IwQm35vtvKS_tIW0C7QFrqWuIrIMPdQ2XL2NZiaXRD8.jpg?auto=webp&s=5b369da291901e117abaee9723cfef056f2cd97e",
          "width": 1024,
          "height": 512
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/IwQm35vtvKS_tIW0C7QFrqWuIrIMPdQ2XL2NZiaXRD8.jpg?width=108&crop=smart&auto=webp&s=e6d8da1a4c7131db48832d552492ec15feaaad75",
            "width": 108,
            "height": 54
          },
          {
            "url": "https://external-preview.redd.it/IwQm35vtvKS_tIW0C7QFrqWuIrIMPdQ2XL2NZiaXRD8.jpg?width=216&crop=smart&auto=webp&s=ea8383e5bef5bda7567589dd7bba9375b3affc3b",
            "width": 216,
            "height": 108
          },
          {
            "url": "https://external-preview.redd.it/IwQm35vtvKS_tIW0C7QFrqWuIrIMPdQ2XL2NZiaXRD8.jpg?width=320&crop=smart&auto=webp&s=ff2ad413e67ab87dd5c278f7b7e163aea43939ef",
            "width": 320,
            "height": 160
          },
          {
            "url": "https://external-preview.redd.it/IwQm35vtvKS_tIW0C7QFrqWuIrIMPdQ2XL2NZiaXRD8.jpg?width=640&crop=smart&auto=webp&s=8ce2a63616d805fb341afdd7f0745ee09214dc18",
            "width": 640,
            "height": 320
          },
          {
            "url": "https://external-preview.redd.it/IwQm35vtvKS_tIW0C7QFrqWuIrIMPdQ2XL2NZiaXRD8.jpg?width=960&crop=smart&auto=webp&s=f7f7ad0fd303ced630cd0150fe58b353df7af7e9",
            "width": 960,
            "height": 480
          }
        ],
        "variants": {},
        "id": "vyGPUCqhwsuLvubfFKy0dKwMDGkisB277D2V7m60yAE"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/r4yrv9/94_of_crypto_investors_are_40_years_old_or/",
  "subreddit": "CryptoCurrency",
  "id": "r4yrv9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My grandpa is an 71-year old retired physics and mathematics professor and\ncrypto enthusiast. He bought his first 10 bitcoins (he told me he sold them just\ntwo years later) in 2013 after Crypto got a little more traction in the\nmainstream media and ever since then he has been on about the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の祖父は71歳で物理学と数学の教授を引退しています。\n暗号愛好家です。彼は2013年にCryptoの後に最初の10ビットコインを購入しました（ちょうど2年後に売ったと言っていました）。\n2013年に初めてビットコインを10枚購入しました（2年後に売却したそうです）。\nそれ以来、彼はビットコインのことをずっと気にかけています。",
      "title": "暗号投資家の94％は40歳以下ですが、私の71歳のおじいちゃんは彼らよりも優れた結果を出しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的爷爷是一位71岁的退休物理学和数学教授，他是一个很好的朋友。\n是一个加密货币的爱好者。他买了他的第一个10个比特币（他告诉我他在两年前就把它们卖了\n他告诉我，他在2013年买了他的第一个10个比特币（他告诉我，两年后他把它们卖掉了），当时加密货币在主流市场上有了一点吸引力。\n从那时起，他就一直在关注......",
      "title": "94%的加密货币投资者是40岁或更年轻的人，但我71岁的爷爷却能胜过他们所有人。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的爺爺是一位71歲的退休物理學和數學教授，他是一個很好的朋友。\n是一個加密貨幣的愛好者。他買了他的第一個10個比特幣（他告訴我他在兩年前就把它們賣了\n他告訴我，他在2013年買了他的第一個10個比特幣（他告訴我，兩年後他把它們賣掉了），當時加密貨幣在主流市場上有了一點吸引力。\n從那時起，他就一直在關注......",
      "title": "94%的加密貨幣投資者是40歲或更年輕的人，但我71歲的爺爺卻能勝過他們所有人。"
    }
  ]
}