{
  "author": "PaladinFeng",
  "original_created_utc": 1658372634,
  "title": "How pious were monks actually during medieval times? Do we have any \"uncensored\" behind-the-scenes accounts of the realities of monastic life?",
  "created_utc": 1658412692,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m aware that monastic life in medieval abbeys were far from the dry hagiographic accounts passed down to us today, and that the religious vocation was filled with humor, drama, and the occasional debauchery. With that said, do we have any firsthand accounts from monks/nuns that illuminate the realities of monastic life &amp;quot;warts and all&amp;quot; so-to-speak?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 115,
  "permalink": "/r/AskHistorians/comments/w45kn5/how_pious_were_monks_actually_during_medieval/",
  "subreddit": "AskHistorians",
  "id": "w45kn5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm aware that monastic life in medieval abbeys were far from the dry\nhagiographic accounts passed down to us today, and that the religious vocation\nwas filled with humor, drama, and the occasional debauchery. With that said, do\nwe have any firsthand accounts from monks/nuns that illuminate the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "中世の修道院での生活は、乾燥とはほど遠いものだったと認識しています。\n中世の修道院の生活は、今日私たちに伝えられている萩焼のような乾いた話とは程遠く、宗教的な職業は\nユーモアやドラマ、そして時には放蕩もあったようです。とはいえ\n修道士や修道女の生の声から、その実態を知ることはできるのだろうか...。",
      "title": "中世の修道士は、実はどれだけ敬虔だったのか？修道院生活の実態を伝える「ノーカット」の舞台裏はあるのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道，中世纪修道院的修道生活与我们今天流传的干巴巴的传记描述相去甚远。\n我知道中世纪修道院的生活远非今天流传下来的干巴巴的传记所描述的那样，而且宗教的使命\n充满了幽默、戏剧和偶尔的放荡。说到这里，我们是否有任何第一手的资料？\n我们是否有任何来自僧侣/修女的第一手资料，以阐明...",
      "title": "在中世纪时代，僧侣们究竟有多虔诚？我们是否有任何关于修士生活现实的 \"未经审查的 \"幕后叙述？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道，中世紀修道院的修道生活與我們今天流傳的乾巴巴的傳記描述相去甚遠。\n我知道中世紀修道院的生活遠非今天流傳下來的乾巴巴的傳記所描述的那樣，而且宗教的使命\n充滿了幽默、戲劇和偶爾的放蕩。說到這裏，我們是否有任何第一手的資料？\n我們是否有任何來自僧侶/修女的第一手資料，以闡明...",
      "title": "在中世紀時代，僧侶們究竟有多虔誠？我們是否有任何關於修士生活現實的 \"未經審查的 \"幕後敘述？"
    }
  ]
}