{
  "author": "qwertyops900",
  "the_new_excerpt": "Recently, I was reading about the Hindenburg Research report that alleged black\nmarket activity and other shady activity at DraftKings. What I found fascinating\nabout this is that Hindenburg Research investigated a company, found\nincriminating information, made a short position, and then revealed…",
  "original_created_utc": 1623977416,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、Hindenburg Research社の報告書を読んでいて、DraftKingsのブラックマーケット活動やその他の怪しい活動を疑っていました。\nDraftKingsのブラックマーケット活動やその他の怪しい活動を疑うHindenburg Researchの報告書を読んでいました。私が魅力を感じたのは\nHindenburg Researchがある会社を調査して、証拠となる情報を見つけて、ショートポジションを作って、そして明らかにしたということです。\n証拠となる情報を見つけ、ショートポジションを作り、そして明らかにしたということです...",
      "title": "新聞社がヒンデンブルグ・リサーチのように行動するのを防ぐには？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近，我正在阅读兴登堡研究报告，该报告指称DraftKings的黑市活动和其他不正当活动。\n该报告指控DraftKings的黑市活动和其他不正当活动。我发现令人着迷的是\n的是，兴登堡研究公司调查了一家公司，发现了\n有罪的信息，做了一个空头头寸，然后透露......",
      "title": "是什么阻止了报纸公司像兴登堡研究公司那样行事？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近，我正在閱讀興登堡研究報告，該報告指稱DraftKings的黑市活動和其他不正當活動。\n該報告指控DraftKings的黑市活動和其他不正當活動。我發現令人着迷的是\n的是，興登堡研究公司調查了一家公司，發現了\n有罪的信息，做了一個空頭頭寸，然後透露......",
      "title": "是什麼阻止了報紙公司像興登堡研究公司那樣行事？"
    }
  ],
  "title": "What prevents newspaper companies from acting like Hindenburg Research?",
  "created_utc": 1623986310,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Recently,  I was reading about the Hindenburg Research report that alleged black market activity and other shady activity at DraftKings. What I found fascinating about this is that Hindenburg Research investigated a company, found incriminating information, made a short position, and then revealed this information to the public. Their information gathering process seemed very similar to the ones used by regular news outlets to discover shady business practices, interviewing former employees and examining hard-to-find information. Furthermore, as far as I could tell, this appeared to be totally legal.</p>\n\n<p>My question is, why don’t news companies do the same thing as Hindenburg when they discover similarly damaging information about a public company? I’m aware that individual employees are likely prevented from doing this by their contract, but what stops the overall company from shorting these companies? Is it just journalistic integrity, or are there laws that would apply to news companies and not to ones like Hindenburg?</p>\n</div><!-- SC_ON -->",
  "score": 135,
  "permalink": "/r/investing/comments/o2ckev/what_prevents_newspaper_companies_from_acting/",
  "subreddit": "investing",
  "id": "o2ckev",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009743439
}