{
  "author": "Envinsule",
  "original_created_utc": 1637905242,
  "title": "3 years of learning about investing in cryptocurrency as a hobby distilled into 10 pieces of advice.",
  "created_utc": 1637930348,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Here are a few things I learned over three years of hodling, trading, and selling cryptocurrencies. This may be helpful to those that are new or a good reminder for those that are veterans to crypto trading.</p>\n\n<ol>\n<li><strong>Create an investment plan</strong>. <em>“If You Fail to Plan, You Are Planning to Fail” — Benjamin Franklin.</em> Ask yourself how much you want to invest, when to invest, set a goal, and determine what amount you’d be comfortable selling at (if you plan to sell at all). To get started, consider investing on a schedule (every paycheck, once a week, once a month). A little can go a long way. Consider taxes and exchange fees when planning, too.</li>\n<li><strong>Stick to your ticket</strong>. <em>You&#39;re a crypto investor, Harry...</em> Your plan will protect you from loss and set you up for gain. If you buy in at a certain price, following your plan, have patience until it’s profitable. Don’t sell early. Wait until you’ve netted some profits. Look to your peers for support if you’re doubting. If one thing is predictable in this market, it’s that prices/value usually go up, eventually. That’s why so many people say buy and HODL (hold, don’t sell). It may take months; it may take years, but in general, in the grand scheme of things, this technology is just getting started.</li>\n<li><strong>Expect a loss in the short term, and a gain in the long term</strong>. <em>“A winning strategy must include losing.” —</em> <em>Robert T. Kiyosaki</em>. If it goes up after you buy, you’ll be pleasantly surprised. If you’re confident in what you’d like to invest in, because you’ve done the research, think of it like a CD at a bank or maybe even a 401k. Both have fees, taxes, or penalties for withdrawing early. Consider your money locked away for a period of time. If the price goes down by 1%, 5%, or even up to 50%, that’s just the fee for taking your money out early. It’s more than likely that your investment will go up with time, if you’ve carefully looked at what you’re investing in and you believe in it.</li>\n<li><strong>Don’t bet your whole stack on a single trade</strong>. <em>This isn&#39;t a game of green light, red light.</em> When buying in, set multiple buy-in points. For example, if you do your own research, and you are relatively certain the price will go up in the short term, don’t buy in with all of your cash. You’ll want to keep a percentage of your cash to buy in if it goes lower than you’d expect. Average your buy in points and sell off points across a range that you’re comfortable with.</li>\n<li><strong>Look for when your coin/token is on sale</strong>. <em>&quot;I bought the dip, but it keeps dipping!&quot;</em> If you invest in a cryptocurrency and the price goes down, consider it to be on sale, and try to buy more.</li>\n<li><strong>Learn from other’s failures, and don’t take out loans to invest</strong>. <em>“Learn from the mistakes of others. You can&#39;t live long enough to make them all yourself.” ― Eleanor Roosevelt.</em> Many people I know invested in Bitcoin in Dec 2017 (when the price of Bitcoin was rising). I heard stories of some (friends of friends) that took out a loan for cash to invest. They bought in when the market was on the rise, and held ‘til it crashed. Then, they lost faith and sold. They took their money out early and ended up in a bad situation.</li>\n<li><strong>There</strong> <strong><em>is</em></strong> <strong>such a thing as too much risk</strong>. <em>One does not simply bet what they can&#39;t lose.</em> Be careful and consider all of the potential consequences if you are thinking about investing money you’re worried about losing.</li>\n<li><strong>Don’t let your emotions decide when to sell or buy</strong>. <em>&quot;You have to let it all go, Neo. Fear, doubt, and disbelief. Free your mind.&quot; — Morpheus, The Matrix.</em> Manage your fear of missing out (FOMO); don’t buy just because the price is going up. If you do this, you’ll often buy at a high and lose money. Watch out for fear, uncertainty, and doubt (FUD); don’t sell just because the price is going down and you get scared. If you do this, you’ll often sell at a low, just before the price is about to rise. Keep in mind that a few percentage points up and down throughout a day is normal. Calculate what this is so that you expect it. It could be in the hundreds or thousands based on how much you invest.</li>\n<li><strong>Get to know the tools of the trade</strong>. &quot;<em>The best investment is in the tools of one’s own trade.&quot; — Benjamin Franklin.</em> Research which exchanges are right for you, not just what your friend or family member recommended. Understand what fees are involved for trades. Don’t hesitate to try a few different exchanges. Consider learning about limit orders; they’ll help you in the long run. Learn about wallets and staking, if applicable to your trading plan. Make sure you understand what taxes you will need to pay on any capital gains; know that there are cryptocurrency tax services out there that can help.</li>\n<li><strong>Beware of scammers</strong>. This is perhaps the most important!! If anyone messages you about cryptocurrency, be skeptical of their intent. Research all exchanges and wallets that you’re considering thoroughly; don’t just click the first link that pops up on a search. Be careful about installing ANY software or mobile apps. Lookup independent reviews first.</li>\n</ol>\n\n<p>I hope these guidelines or tips are helpful. I really have this community to thank for much of the knowledge I’ve gained. Thank you!</p>\n\n<p>Also, note, <del>none of this is financial advice</del> [I&#39;m not advising you to buy or sell cryptocurrency. These are just some tips, if you do decide to invest. Do your own research.] I’m not qualified to advise anyone on this stuff; just learning - sometimes the hard way, like everyone else.</p>\n\n<p>What are some things you’ve learned about investing in cryptocurrency, but wish you knew earlier?</p>\n\n<p>--</p>\n\n<p>Edit: updated disclaimer</p>\n</div><!-- SC_ON -->",
  "score": 187,
  "permalink": "/r/CryptoCurrency/comments/r2fz10/3_years_of_learning_about_investing_in/",
  "subreddit": "CryptoCurrency",
  "id": "r2fz10",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Here are a few things I learned over three years of hodling, trading, and\nselling cryptocurrencies. This may be helpful to those that are new or a good\nreminder for those that are veterans to crypto trading.\n\n 1.  Create an investment plan. “If You Fail to Plan, You Are Planning to Fail”\n     —…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここでは、私が3年間に渡って暗号通貨の売買を行ってきた中で学んだことをいくつかご紹介します。\n暗号通貨を販売しています。初めての方には参考になるかもしれませんし、暗号取引のベテランの方には備忘録として\nベテランの方にも参考にしていただけると思います。\n\n 1.  投資計画を立てる。\"If You Fail to Plan, You Are Planning to Fail\" (計画を立てることを怠れば、失敗することを計画していることになる)\n     -...",
      "title": "趣味で暗号通貨への投資について学んだ3年間が10個のアドバイスに集約されています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "以下是我在三年多时间里从事加密货币交易和出售的一些经验。\n出售加密货币的过程中，我学到了一些东西。这可能对那些新手有帮助，或者对那些加密货币交易的老手是一个很好的提醒。\n提醒那些对加密货币交易有经验的人。\n\n 1.  创建一个投资计划。\"如果你没有计划，你就是在计划失败\"\n     -...",
      "title": "3年来对加密货币投资的学习作为一种爱好，提炼成10条建议。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "以下是我在三年多時間裏從事加密貨幣交易和出售的一些經驗。\n出售加密貨幣的過程中，我學到了一些東西。這可能對那些新手有幫助，或者對那些加密貨幣交易的老手是一個很好的提醒。\n提醒那些對加密貨幣交易有經驗的人。\n\n 1.  創建一個投資計劃。\"如果你沒有計劃，你就是在計劃失敗\"\n     -...",
      "title": "3年來對加密貨幣投資的學習作爲一種愛好，提煉成10條建議。"
    }
  ]
}