{
  "author": "delalooney",
  "original_created_utc": 1645880420,
  "title": "Why do men who are afraid of getting someone pregnant not default to using condoms?",
  "created_utc": 1645889131,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So this is on the surface a very obvious question I know, but I keep seeing mention of scenarios (on &lt;a href=\"/r/relationships\"&gt;r/relationships&lt;/a&gt; for example) which reference guys talking about being worried about getting sexual partners pregnant, but still proceeding with sex without female birth control. Often this is referenced where women are left worrying about pregnancy after a hookup or breakup.&lt;/p&gt;\n\n&lt;p&gt;I find it totally weird that guys who profess that fear wouldn&amp;#39;t use condoms. Is it just faux worry but &amp;quot;it feels better without&amp;quot;, or is it cultural Catholicism but feeling unable to just... Abstain? Or am I missing something?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 139,
  "permalink": "/r/TooAfraidToAsk/comments/t1wkig/why_do_men_who_are_afraid_of_getting_someone/",
  "subreddit": "TooAfraidToAsk",
  "id": "t1wkig",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So this is on the surface a very obvious question I know, but I keep seeing\nmention of scenarios (on r/relationships [/r/relationships] for example) which\nreference guys talking about being worried about getting sexual partners\npregnant, but still proceeding with sex without female birth control.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは表面的にはとても当たり前の質問だと思うのですが、私は常に\nシナリオについて（例えば r/relationships [/r/relationships] で）言及する。\n性的なパートナーになることを心配している男の話を参照してください。\n妊娠しても、女性の避妊具なしでセックスを進めてしまう......。",
      "title": "誰かを妊娠させるのが怖い男性は、なぜコンドームを使うことをデフォルトにしないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我知道这表面上是一个非常明显的问题，但我一直看到\n提到一些情景（例如在r/relationships [/r/relationships]上），其中提到了\n提到男人们在谈论担心让性伙伴怀孕的问题时\n怀孕，但仍然在没有女性节育措施的情况下进行性行为....。",
      "title": "为什么害怕让别人怀孕的男人不默认使用避孕套？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我知道這表面上是一個非常明顯的問題，但我一直看到\n提到一些情景（例如在r/relationships [/r/relationships]上），其中提到了\n提到男人們在談論擔心讓性夥伴懷孕的問題時\n懷孕，但仍然在沒有女性節育措施的情況下進行性行爲....。",
      "title": "爲什麼害怕讓別人懷孕的男人不默認使用避孕套？"
    }
  ]
}