{
  "author": "hnnng_booba",
  "original_created_utc": 1652966725,
  "title": "In US history, were slaves ever bought for the explicit purpose of prostitution?",
  "created_utc": 1652977421,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I understand that there is a pretty dark and storied history of rape between white men and black women in the Antebellum South. This made me wonder, did slave masters ever buy women for the sole purpose of pimping them out to other men? While we’re at it, let’s also open this up to the rest of the Western Hemisphere. Did this ever happen in Canada or Latin America?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 199,
  "permalink": "/r/AskHistorians/comments/ut3dwh/in_us_history_were_slaves_ever_bought_for_the/",
  "subreddit": "AskHistorians",
  "id": "ut3dwh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "I understand that there is a pretty dark and storied history of rape between\nwhite men and black women in the Antebellum South. This made me wonder, did\nslave masters ever buy women for the sole purpose of pimping them out to other\nmen? While we’re at it, let’s also open this up to the rest of the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "の間には、かなり暗いレイプの歴史があるそうですね。\nこのことから、私は、この映画で白人が黒人の女性をレイプしたのか？このことから、私は\n奴隷の主人たちは、女性を他の男性に売り渡すためだけに女性を買っていたのでしょうか？\n奴隷の主人たちは、他の男たちに斡旋するためだけに女性を買ったのだろうか？ついでに、この話を他の国にも広げてみよう。",
      "title": "アメリカの歴史上、売春を明確な目的として奴隷が買われたことはあったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "据我所知，在前民权时代的南方，白人男子和黑人妇女之间有一段相当黑暗和传奇的强奸史。\n白人男子和黑人妇女在前民权时代南方的强奸历史。这让我想知道\n奴隶主们是否曾经买过女人，只为了把她们拉到其他男人那里？\n奴隶主是否曾经买过女人，只为了把她们拉皮条给其他男人？既然如此，让我们也把这个问题开放给其他的...",
      "title": "在美国历史上，是否曾有过以卖淫为明确目的而购买的奴隶？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "據我所知，在前民權時代的南方，白人男子和黑人婦女之間有一段相當黑暗和傳奇的強姦史。\n白人男子和黑人婦女在前民權時代南方的強姦歷史。這讓我想知道\n奴隸主們是否曾經買過女人，只爲了把她們拉到其他男人那裏？\n奴隸主是否曾經買過女人，只爲了把她們拉皮條給其他男人？既然如此，讓我們也把這個問題開放給其他的...",
      "title": "在美國曆史上，是否曾有過以賣淫爲明確目的而購買的奴隸？"
    }
  ]
}