{
  "author": "LukaIsBestVocaloid",
  "original_created_utc": 1638562392,
  "title": "What would defunding the police do for us?",
  "created_utc": 1638581529,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is a potentially charged question, so I&amp;#39;m sorry in advance if this breaks a rule or two that I haven&amp;#39;t seen.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t necessarily see the merit in defunding the police forces, but  I realize I have some bias and I don&amp;#39;t know a ton about the movement and its goals. I also haven&amp;#39;t been given a good answer as to what people hope to accomplish by doing so without being called a bootlicker or whatever, which is very frustrating.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d just like some genuine, rational answers so I can expand my viewpoint and learn without being attacked.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 119,
  "permalink": "/r/NoStupidQuestions/comments/r87zq3/what_would_defunding_the_police_do_for_us/",
  "subreddit": "NoStupidQuestions",
  "id": "r87zq3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is a potentially charged question, so I'm sorry in advance if this breaks a\nrule or two that I haven't seen.\n\nI don't necessarily see the merit in defunding the police forces, but I realize\nI have some bias and I don't know a ton about the movement and its goals. I also\nhaven't been given a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは、潜在的に有料の質問なので、もしこれが違反であれば、事前に申し訳ありません。\nルールや見落としがあるのでは？\n\n私は必ずしも警察への資金援助にメリットを感じているわけではありませんが\n私はバイアスがかかっており、この運動とその目的について多くを知りません。また、私は\nをもらっていないのですが・・・。",
      "title": "警察を廃止して何になるの？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是一个潜在的问题，所以我很抱歉，如果这违反了我没有看到的一两个规则\n如果这违反了我没有见过的一两条规则，我很抱歉。\n\n我不一定能看到削减警察部队经费的好处，但我意识到\n我有一些偏见，而且我对这个运动和它的目标了解不多。我也\n我也没有得到一个...",
      "title": "削减警察经费对我们有什么好处？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是一個潛在的問題，所以我很抱歉，如果這違反了我沒有看到的一兩個規則\n如果這違反了我沒有見過的一兩條規則，我很抱歉。\n\n我不一定能看到削減警察部隊經費的好處，但我意識到\n我有一些偏見，而且我對這個運動和它的目標瞭解不多。我也\n我也沒有得到一個...",
      "title": "削減警察經費對我們有什麼好處？"
    }
  ]
}