{
  "author": "TheTwoWipeWonder",
  "the_new_excerpt": "Not sure if it’s a good idea to even make this post because it might jeopardize\nmy own safety, but I am guessing that there are others like me, probably lurking\nthis subreddit right now.\n\nEver since 2018 I have been able to perfectly time the crypto market and it is\nstarting to make me very…",
  "original_created_utc": 1621447231,
  "title": "Anyone else able to perfectly time the market?",
  "created_utc": 1621474940,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Not sure if it’s a good idea to even make this post because it might jeopardize my own safety, but I am guessing that there are others like me, probably lurking this subreddit right now.</p>\n\n<p>Ever since 2018 I have been able to perfectly time the crypto market and it is starting to make me very anxious. </p>\n\n<p>I’m not a conspiracy theory lunatic, but I have a knack for simulation theory and theorize that my ability to time the market might be linked to a supernatural power.</p>\n\n<p>If there is anyone else out there, I hope this reaches you and we can talk more about it. </p>\n\n<p>Anyways, about how I can time the market. Each time I buy, it goes down, and each time I sell, it goes up.</p>\n</div><!-- SC_ON -->",
  "score": 1002,
  "permalink": "/r/CryptoCurrency/comments/ngckx5/anyone_else_able_to_perfectly_time_the_market/",
  "subreddit": "CryptoCurrency",
  "id": "ngckx5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590801372,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このような投稿をすることが良いことなのかどうか分かりませんが、危険にさらされるかもしれないので\nしかし、私のような人が他にもいて、おそらく潜んでいると思います。\n今、このサブレディットで\n\n2018年以来、私は暗号市場のタイミングを完璧に合わせることができるようになり、それは\nし始めたので、とても...",
      "title": "誰か完璧に相場のタイミングを計れる人はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不知道发这个帖子是否是个好主意，因为它可能会危及到我自己的安全。\n我自己的安全，但我猜想，还有其他像我一样的人，可能正在潜伏在\n这个subreddit，现在。\n\n自2018年以来，我已经能够完美地掌握加密货币市场的时间，而且它\n开始让我非常...",
      "title": "还有人能够完美地把握市场时机吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不知道發這個帖子是否是個好主意，因爲它可能會危及到我自己的安全。\n我自己的安全，但我猜想，還有其他像我一樣的人，可能正在潛伏在\n這個subreddit，現在。\n\n自2018年以來，我已經能夠完美地掌握加密貨幣市場的時間，而且它\n開始讓我非常...",
      "title": "還有人能夠完美地把握市場時機嗎？"
    }
  ]
}