{
  "author": "simplelifestyle",
  "the_new_excerpt": "I won't list all the FUD, but it was massive, it was in every news outlet, all\nover the world, spreading very negative 'news' about Bitcoin.\n\nThey came out from all fronts, FUD about the environment, governments bans,\nasset bubble and ponzi, inefficient and slow technology, dangerous,…",
  "original_created_utc": 1621524532,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "すべてのFUDを列挙するつもりはありませんが、それは大規模なもので、世界中のあらゆるニュース媒体で、ビットコインに関する非常にネガティブな「ニュース」が流されていました。\n世界中のあらゆるニュースで、ビットコインに関する非常にネガティブな「ニュース」が流されました。\n\n環境に関するFUD、政府による禁止、資産バブルとポンジ、非効率的で遅いというFUDなど、あらゆる方面から出てきました。\n環境に関するFUD、政府による禁止、資産バブルとポンジ、非効率で遅い技術、危険、などなど。",
      "title": "2013年からビットコイナーになっていますが、ラス数日ほど大規模なFUDは見たことがありません。moneybadgerがまたそれを振り払ってくれて嬉しいよ。ビットコインはこれまで以上に強い。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不会列出所有的疑虑，但它是大规模的，它出现在每一个新闻媒体上，在全世界\n世界各地都在传播关于比特币的非常负面的 \"新闻\"。\n\n他们从各方面出来，对环境、政府禁令的疑虑。\n资产泡沫和庞氏骗局，低效和缓慢的技术，危险，...",
      "title": "我从2013年就开始做比特币了，我从来没有见过像最近几天这么大规模的FUD。我很高兴moneybadger又把它洗掉了。比特币比以前更强大了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不會列出所有的疑慮，但它是大規模的，它出現在每一個新聞媒體上，在全世界\n世界各地都在傳播關於比特幣的非常負面的 \"新聞\"。\n\n他們從各方面出來，對環境、政府禁令的疑慮。\n資產泡沫和龐氏騙局，低效和緩慢的技術，危險，...",
      "title": "我從2013年就開始做比特幣了，我從來沒有見過像最近幾天這麼大規模的FUD。我很高興moneybadger又把它洗掉了。比特幣比以前更強大了。"
    }
  ],
  "title": "I've been a bitcoiner since 2013 and I've never seen a FUD as massive as the las few days. I'm glad moneybadger shuck it off again. Bitcoin is stronger than ever.",
  "created_utc": 1621568958,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I won&#39;t list all the FUD, but it was massive, it was in every news outlet, all over the world, spreading very negative &#39;news&#39; about Bitcoin.</p>\n\n<p>They came out from all fronts, FUD about the environment, governments bans, asset bubble and ponzi, inefficient and slow technology, dangerous, money laundering, etc. You name it... they had it.</p>\n</div><!-- SC_ON -->",
  "score": 191,
  "permalink": "/r/Bitcoin/comments/nh3733/ive_been_a_bitcoiner_since_2013_and_ive_never/",
  "subreddit": "Bitcoin",
  "id": "nh3733",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197378396
}