{
  "author": "Chicky_Nuggy",
  "the_new_excerpt": "So I invested in this altcoin called Ethereum, like a BNB binance coin rip off I\nthink? They even copied the exchange Pancakeswap with something called Uniswap,\ndesperate much?\n\nAnyway, I invested $30 4 hours ago and obviously been checking my portfolio\nevery 15 mins or so just to check on the gains…",
  "original_created_utc": 1620848678,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そこで私はイーサリアムというアルトコインに投資したのですが、これはBNBバイナンスコインのパクリのようなものだと思います。\nでしょうか？Pancakeswapという取引所をUniswapという名前でコピーしていました。\n必死ですね。\n\nとにかく、4時間前に30ドルを投資して、15分ごとに自分のポートフォリオをチェックしています。\n15分ごとにポートフォリオをチェックして、利益を確認しています。",
      "title": "私のコインは過去4時間で5％下がっていますが、詐欺の可能性はありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我投资了一个叫Ethereum的altcoin，好像是BNB binance coin的翻版。\n我认为？他们甚至用一个叫Uniswap的东西复制了Pancakeswap的交易所。\n这也太绝情了吧？\n\n总之，我在4个小时前投资了30美元，显然每隔15分钟左右就会检查我的投资组合\n每15分钟左右检查一次我的投资组合，以检查收益情况......",
      "title": "我的硬币在过去4小时内下跌了5%，可能是骗局？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我投資了一個叫Ethereum的altcoin，好像是BNB binance coin的翻版。\n我認爲？他們甚至用一個叫Uniswap的東西複製了Pancakeswap的交易所。\n這也太絕情了吧？\n\n總之，我在4個小時前投資了30美元，顯然每隔15分鐘左右就會檢查我的投資組合\n每15分鐘左右檢查一次我的投資組合，以檢查收益情況......",
      "title": "我的硬幣在過去4小時內下跌了5%，可能是騙局？"
    }
  ],
  "title": "My Coin Has Gone Down 5% in The Past 4 Hours, Possible Scam?",
  "created_utc": 1620869072,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I invested in this altcoin called Ethereum, like a BNB binance coin rip off I think? They even copied the exchange Pancakeswap with something called Uniswap, desperate much? </p>\n\n<p>Anyway, I invested $30 4 hours ago and obviously been checking my portfolio every 15 mins or so just to check on the gains and how much profit I&#39;d need to move into Shiba coin (more stable/reliable investment) but the charts have been going down around 1% an hour since? WTF is going on? </p>\n\n<p>I checked coinmarketcap AND coingecko just to make sure one of them ran out of bandwidth or had a bad connection or something, but they&#39;re both telling me my initial investment is down over 5%... </p>\n\n<p>Emailed their scammy vibe CEO called Vitality Butin around 30 mins ago but no reply as of yet. I consulted with my Telegram group (which has over 50 millionaires in) and they&#39;re telling me it&#39;s a possible scam too. </p>\n\n<p>Any advice? Should I pull out now? I don&#39;t want to risk losing more</p>\n</div><!-- SC_ON -->",
  "score": 711,
  "permalink": "/r/CryptoCurrency/comments/naxj2c/my_coin_has_gone_down_5_in_the_past_4_hours/",
  "subreddit": "CryptoCurrency",
  "id": "naxj2c",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985993626
}