{
  "author": "boneywankenobi",
  "the_new_excerpt": "Hooo boy I just figured out something amazing you dirty apes. Buckle up because\nit is story time, you are going to like this one. This is not a story about GME\nnow, but what we will see happen during the MOASS. How about a trailer to the\nmovie we are about to see?\n\nGoldman Sachs and Block…",
  "original_created_utc": 1616903745,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我刚刚发现了一些惊人的事情，你们这些肮脏的猿人。系好安全带，因为\n现在是故事时间，你会喜欢这个故事。这不是一个关于GME的故事\n现在，但我们会看到什么 发生在MOASS。怎么样的预告片，以\n我们要看的电影？\n\n高盛和Block... ...",
      "title": "嗝嗝--本周我们刚看到一个对冲基金死了! MOASS电影的预告片，并解释一些奇怪的星期五。DD"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我剛剛發現了一些驚人的事情，你們這些骯髒的猿人。繫好安全帶，因爲\n現在是故事時間，你會喜歡這個故事。這不是一個關於GME的故事\n現在，但我們會看到什麼 發生在MOASS。怎麼樣的預告片，以\n我們要看的電影？\n\n高盛和Block... ...",
      "title": "嗝嗝--本週我們剛看到一個對沖基金死了! MOASS電影的預告片，並解釋一些奇怪的星期五。DD"
    }
  ],
  "title": "BUCKLE UP - we just saw a hedge fund die this week! A trailer of the MOASS movie, and explaining some weirdness Friday. DD",
  "created_utc": 1616916034,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hooo boy I just figured out something amazing you dirty apes.  Buckle up because it is story time, you are going to like this one.  This is not a story about GME now, but what we will see happen during the MOASS.  How about a trailer to the movie we are about to see?</p>\n\n<p><strong>Goldman Sachs and Block Trades</strong></p>\n\n<p>Our story starts with an oddity someone pointed out to me Friday:  <a href=\"https://twitter.com/AnalystDC/status/1375517530723352578\">There was a huge block trade being offered up on the Bloomberg terminal.</a>.  What is a block trade?  It is when millions of shares are sold at once for a discount because they need to be liquidated for cash.... fast.  Normally this big blocks trade in the dark market to not spook investors and allow big stockholders to exit without causing a panic.  One of the more benign reasons the dark markets exist.</p>\n\n<p>So Goldman Sachs in this case does not actually own the stocks.  They are just selling them on behalf of some mysterious owner and are on the face of it.  Let&#39;s dig deeper.</p>\n\n<p><strong>The Man Behind The Curtain</strong></p>\n\n<p>If you look at all those stocks, they have one common entity which has enough stock for <em>all</em> of those trades: Morgan Stanley.  Not going to post all the links, but MS is in the top 5 holders of every single one and is the only one with enough stock to sell those big of blocks.  Cool, one piece down.  But the thing is, Morgan Stanley&#39;s balance sheet doesn&#39;t have any reason that they would have to liquidate that much risk.  So who could it be?</p>\n\n<p>Well, Yahoo broke the story - <a href=\"https://finance.yahoo.com/news/exclusive-tiger-cub-archegos-liquidation-015109185.html\">The Archegos Capital Management hedge fund</a> is the apparent owner of all of those stocks.  It is run by Bill Hwang who used to own Tiger Asia Management (for those looking at other posts, this is the common Hong Kong thread).  Now the thing is, not all hedge funds are necessarily evil, but <a href=\"https://www.asiaasset.com/post/3180-news-tiger\">Tiger had to shut down</a> due to <a href=\"https://www.nj.com/business/2012/12/tiger_asia_hedge_fund_expected.html\">insider trading</a>.  So fuck&#39;m.  (Credit to <a href=\"/u/the_captain_slog\">/u/the_captain_slog</a> for that find).  Now Archegos&#39; website is down too.   Oh well!</p>\n\n<p><strong>The Margin Call and QQQ</strong></p>\n\n<p>So why did they get margin called?  Well, from the above links Archegos is heavily leveraged.  So that means most of their holdings are bought on loan.  There is a capital requirement that they must fulfill in order to have this much leverage as a result of the 2008 crash where some players had 33:1 leverage <em>cough</em> bear stearns <em>cough</em> and died because of it taking the market with them.  Due to the pandemic, there was a temporary rule put in place saying that the treasury bonds didn&#39;t count against that limit.  It ends March 31st.  </p>\n\n<p>So they need a bit of cash, so what?   Well, guess what they also own huge stakes in?  Viacom and Discovery.  These two stocks lost about 50% of their price over the last few days, eliminating another huge portion of Archegos&#39; equity value.  So now their debt/equity ratio is a shitload higher!  </p>\n\n<p>What happens if the ratio gets too high?  The banks come a-callin!  They force the hedge fund to close their leveraged positions and <em>margin call</em> them.  This margin call is also what happens to be the mechanism behind a.... <strong>short squeeze!</strong>  Only a short squeeze has many margin calls happening back to back as their debt from short positions skyrockets.</p>\n\n<p>Well, something really odd happened at the end of Friday - the SPY and QQQ ETFs, which are relatively low volatility, climbed up a few percent in the last few hours.  Traders have been super confused on why this happened.  But there is a really easy linkage here that isn&#39;t much of a stretch: Archegos was heavily shorting either the ETFs or the underlying stocks!  So what happens when they get margin called?  They have to cover their positions suddenly at whatever price the stock is selling!  Boom goes the stock price.  Well, little boom in this case but it is a mini preview of the MOASS.  This will be happening at a much bigger scale.</p>\n\n<p>Could it have been just normal portfolio rebalancing?  Maybe!  But the timing of this works out really well, and the narrative fits.  </p>\n\n<p>I am not a financial advisor, cat, nor jedi.  This is just a story about some other stocks and not financial advise.</p>\n</div><!-- SC_ON -->",
  "score": 6698,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/Ssep9AZA-LkZ9YC9HTFj_Xvv-V4MUmLWhPxKXVbY8zE.jpg?auto=webp&s=cadf023131765288aba7302008203b1eb80f1675",
          "width": 140,
          "height": 78
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/Ssep9AZA-LkZ9YC9HTFj_Xvv-V4MUmLWhPxKXVbY8zE.jpg?width=108&crop=smart&auto=webp&s=2ae642f1021945d1ac983b7a09e50274bcbd7809",
            "width": 108,
            "height": 60
          }
        ],
        "variants": {},
        "id": "NMp6h9GQhr4tmXLlk3CNnYK7BXI7oxtKi1cbmn-zOrQ"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/wallstreetbets/comments/metz4t/buckle_up_we_just_saw_a_hedge_fund_die_this_week/",
  "subreddit": "wallstreetbets",
  "id": "metz4t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357149291
}