{
  "author": "_BreakingGood_",
  "original_created_utc": 1652384250,
  "title": "Why does nobody follow the \"Don't invest more than you can afford to lose\" rule?",
  "created_utc": 1652449058,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Scroll down the various cryptocurrency feeds for a few minutes and you will see within seconds dozens of people who invested more than they can afford to lose.&lt;/p&gt;\n\n&lt;p&gt;Why does literally nobody follow this advice? I put $500 into crypto (mostly a bag of ULTRASAFE coin and GenWealth coin and a little bit of PORNROCKET) because $500 was all I could afford. I lost all of that money but it didn&amp;#39;t ruin my life because I followed the advice to not invest more than I could afford to lose.&lt;/p&gt;\n\n&lt;p&gt;Now I have more money to invest during this dip and I am able to buy coins that will moon on short notice.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 305,
  "permalink": "/r/CryptoCurrency/comments/uo96al/why_does_nobody_follow_the_dont_invest_more_than/",
  "subreddit": "CryptoCurrency",
  "id": "uo96al",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Scroll down the various cryptocurrency feeds for a few minutes and you will see\nwithin seconds dozens of people who invested more than they can afford to lose.\n\nWhy does literally nobody follow this advice? I put $500 into crypto (mostly a\nbag of ULTRASAFE coin and GenWealth coin and a little bit…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "数分間、様々な暗号通貨のフィードをスクロールダウンして、あなたは見ることができます。\n数秒のうちに、失うことができる以上の金額を投資した人たちが何十人も出てきます。\n\nなぜ文字通り誰もこのアドバイスに従わないのでしょうか？私は500ドルを暗号につぎ込みました（ほとんどが\nULTRASAFEコインとGenWealthコインの袋と少し...）に投資しました。",
      "title": "なぜ誰も「損してもいい額以上の投資はするな」というルールを守らないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "向下滚动各种加密货币饲料几分钟，你会看到\n几秒钟内就会看到几十个人的投资超过了他们能承受的损失。\n\n为什么简直没有人遵循这个建议？我向加密货币投入了500美元（主要是一个\n一袋ULTRASAFE币和GenWealth币，还有一点...",
      "title": "为什么没有人遵守 \"不要投资超过你能承受的损失 \"的规则？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "向下滾動各種加密貨幣飼料幾分鐘，你會看到\n幾秒鐘內就會看到幾十個人的投資超過了他們能承受的損失。\n\n爲什麼簡直沒有人遵循這個建議？我向加密貨幣投入了500美元（主要是一個\n一袋ULTRASAFE幣和GenWealth幣，還有一點...",
      "title": "爲什麼沒有人遵守 \"不要投資超過你能承受的損失 \"的規則？"
    }
  ]
}