{
  "author": "drlusso",
  "original_created_utc": 1631878284,
  "title": "Challenge: don’t check your crypto for a week.",
  "created_utc": 1631885997,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>When it comes to investments, I only want to buy something that has long term potential. Not interested in pumps/dumps/shills and all that. I want something that has solid use case over the coming years. Something I am comfortable holding for a decade regardless of how the market is doing. You’d think that based on this mindset, one would be comfortable ignoring price action, just research, buy and go about your daily business right? Right???</p>\n\n<p>Well, fuck me I’ve been so wrong! I must be checking my portfolio like at least 10+ times a day, and it’s so fucking pointless. I don’t learn anything new about what I hold, I get distracted from real life, stress myself (both when things go up or down, or sideways for that matter), see price patterns that tell you jack shit, and get tempted by my animal spirits to make stupid decisions on the whims of the moment. Lots of people here who say they do “research”, when in reality they basically just look at lines and candles all day and think they’ve learned something when in reality all they’ve been looking at is market volatility visualised. </p>\n\n<p>So I want to try avoiding checking prices/my portfolio for a week, and thought perhaps others here want to join too as a challenge, and to keep each other accountable (well, at least in spirit). I’ll update the post in a week on whether I managed or how long I lasted lol. Others could do the same in the comments with reminders if interested, and then see how badly we all fuckup :p</p>\n\n<p>Will be interesting to see what portion of people actually get through 7 days, and whether we are all just a bunch of degenerate crypto addicts ;)</p>\n</div><!-- SC_ON -->",
  "score": 209,
  "permalink": "/r/CryptoCurrency/comments/ppye8p/challenge_dont_check_your_crypto_for_a_week/",
  "subreddit": "CryptoCurrency",
  "id": "ppye8p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "When it comes to investments, I only want to buy something that has long term\npotential. Not interested in pumps/dumps/shills and all that. I want something\nthat has solid use case over the coming years. Something I am comfortable\nholding for a decade regardless of how the market is doing. You’d…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "投資に関しては、長期的な可能性のあるものしか買いたくない。\n可能性のあるものを買いたい。パンプス、ダンプス、シラーなどには興味がない。私が欲しいのは\n今後数年間、しっかりとしたユースケースがあるものがいい。今後数年間、しっかりとしたユースケースがあるものが欲しい。\n市場の動向に関わらず、10年は持ち続けられるもの。あなたは...",
      "title": "チャレンジ：1週間、自分の暗号をチェックしない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当谈到投资时，我只想买一些有长期潜力的东西。\n潜力的东西。对抽水机/倾倒机/骗子之类的东西不感兴趣。我想要的是\n在未来几年内有坚实的使用案例。我可以放心地\n无论市场如何发展，我都可以持有十年。你会...",
      "title": "挑战：一周内不要检查你的加密货币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當談到投資時，我只想買一些有長期潛力的東西。\n潛力的東西。對抽水機/傾倒機/騙子之類的東西不感興趣。我想要的是\n在未來幾年內有堅實的使用案例。我可以放心地\n無論市場如何發展，我都可以持有十年。你會...",
      "title": "挑戰：一週內不要檢查你的加密貨幣。"
    }
  ]
}