{
  "author": "pablopsoto",
  "the_new_excerpt": "It was September 2016, when I was starting my second year of Computer Science at\nUniversity. A group of friends in class began to talk and discuss a new platform\nand technology, that I had never heard about, \"Blockchain\". It got me so\ninterested that I enrolled my self into a one-day course that…",
  "original_created_utc": 1622130285,
  "localize": [
    {
      "locale": "ja",
      "title": "父が2016年に1ビットコインを密かに購入し、今までHODLしてきたという自己紹介",
      "the_new_excerpt": "でコンピュータサイエンスの2年生になった2016年9月のことです。\n大学でのこと。クラスの友人たちが、ある新しいプラットフォームについて語り始め\nブロックチェーン」という、聞いたこともないような技術。それがきっかけで\nそして、1日講習を受けることにしました。"
    },
    {
      "locale": "zh",
      "title": "关于我父亲如何在2016年秘密购买1个比特币并一直HODL到现在的自我故事",
      "the_new_excerpt": "那是2016年9月，我在大学开始了我的计算机科学第二年的学习。\n大学计算机科学的第二年。班上的一群朋友开始谈论和讨论一个新的平台\n和技术，我从来没有听说过，\"区块链\"。这让我非常感兴趣\n兴趣，于是我为自己报名参加了一个为期一天的课程。"
    },
    {
      "locale": "zh-Hant",
      "title": "關於我父親如何在2016年祕密購買1個比特幣並一直HODL到現在的自我故事",
      "the_new_excerpt": "那是2016年9月，我在大學開始了我的計算機科學第二年的學習。\n大學計算機科學的第二年。班上的一羣朋友開始談論和討論一個新的平臺\n和技術，我從來沒有聽說過，\"區塊鏈\"。這讓我非常感興趣\n興趣，於是我爲自己報名參加了一個爲期一天的課程。"
    }
  ],
  "title": "Self-story about how my father secretely bought 1 Bitcoin in 2016 and has HODL until now",
  "created_utc": 1622148727,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It was September 2016, when I was starting my second year of Computer Science at University. A group of friends in class began to talk and discuss a new platform and technology, that I had never heard about, &quot;Blockchain&quot;. It got me so interested that I enrolled my self into a one-day course that some PhD and Master students at my faculty were organising, about Cryptocurrencies, Ethereum blockchain, smart contracts, and so on.</p>\n\n<p>The course went great, it opened my mind and I was completely amazed at how revolutionary this technology seemed to be. At that time, bitcoin was worth around 600/700$ but as I was a student I only invested a small amount. </p>\n\n<p>As you can imagine, when you are young and amazed by something, you want to talk about it 24/7, and therefore I tried to explain to my parents what this was all about. My mother didn&#39;t pay me a lot of attention and just barked at me saying that it was all speculation and smoke... but my father kind of liked it, so we had more extensive talks. Obviously, I knew what kind of risks involved investing in Crypto so I never told my dad to invest in it.</p>\n\n<p>Fast forward the story 5 years, we were having a family dinner two months ago (March 2021) and the media was crowded with Bitcoin news as it was, for the first time, crossing the 60K mark. It was at this moment, that my dad between laughs told me that in 2016, when I explained him what Cryptocurrencies were, bought 1 bitcoin for 700$. I COULD NOT BELIEVE IT!!! HOW DID HE NOT MENTIONED IT TO ME BEFORE? He explained to me that he loved the idea behind it and that he bought one as an experiment. He also told me that at the begining he was looking a bit at the charts and prices, but then forgot completely about it until this year.</p>\n\n<p>To finish this off, my dad told me that his plan is to hold it for at least 5 more years and then donate all the profit to a charity. Well, hahaha not what I would do but my dad is like that...</p>\n</div><!-- SC_ON -->",
  "score": 1813,
  "permalink": "/r/CryptoCurrency/comments/nmabps/selfstory_about_how_my_father_secretely_bought_1/",
  "subreddit": "CryptoCurrency",
  "id": "nmabps",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804295053
}