{
  "author": "Rminora",
  "original_created_utc": 1625736115,
  "title": "Would it be weird to pay $300 for a stuffed animal clone of my dog that died yesterday?",
  "created_utc": 1625745411,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>EDIT: I MEAN PLUSHIE, NOT TAXIDERMY\nI could write pages about that dog, but I’ll keep it short.</p>\n\n<p>I left my understaffed job in the middle of my shift to go spend his final moments with him. </p>\n\n<p>When I got there, I was still in shock, I had no idea what was wrong with him - it hadn’t set in. It was the first and only time he didn’t wag his tail when he saw me. I just hugged the shit out of him, and encouraged him to lie down. He hesitated but then lay down in my lap. I tried not to cry, but his breathing was so laboured, I knew he was suffering. We then put him down, he passed in my arms.</p>\n\n<p>Afterwards I learned that his lungs were filling with fluid. Before I got there, he was anxious, stressed, coughing and gasping for every breath. I had no idea, when I got there, he was so calm with me, and never coughed once. And he lay in my lap, a severley disadvantageous position for breathing, which most likely caused a lot of distress, just to calm me down and give me one final snuggle.</p>\n\n<p>Fuck man, I loved that dog</p>\n</div><!-- SC_ON -->",
  "score": 149,
  "permalink": "/r/NoStupidQuestions/comments/og3oe9/would_it_be_weird_to_pay_300_for_a_stuffed_animal/",
  "subreddit": "NoStupidQuestions",
  "id": "og3oe9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "EDIT: I MEAN PLUSHIE, NOT TAXIDERMY I could write pages about that dog, but I’ll\nkeep it short.\n\nI left my understaffed job in the middle of my shift to go spend his final\nmoments with him.\n\nWhen I got there, I was still in shock, I had no idea what was wrong with him -\nit hadn’t set in. It was the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "EDIT: I MEAN PLUSHIE, NOT TAXIDERMY あの犬については何ページも書けますが、簡潔にまとめます。\n簡潔に書きます。\n\n私は人手不足の仕事を途中で切り上げて、彼の最後の瞬間を一緒に過ごしました。\nその犬と最後の時間を過ごすために。\n\nそこに着いたとき、私はまだショックを受けていて、彼に何が起こったのかわからなかった。\n何が悪いのかわからなかったのですが、まだ理解できませんでした。それは、...",
      "title": "昨日死んだ愛犬のクローンのぬいぐるみに300ドル払うのは変かな？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "编辑：我的意思是PLUSHIE，不是TAXIDERMY 我可以写几页关于那条狗的文章，但我要保持简短。\n但我还是要简短地说说。\n\n我在当班期间离开了人手不足的工作岗位，去陪伴它的最后时刻。\n和它一起度过最后的时光。\n\n当我到达那里时，我仍然处于震惊之中，我不知道他出了什么问题------。\n它还没有开始。那是...",
      "title": "花300美元买一个克隆我昨天去世的狗的毛绒玩具会不会很奇怪？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "編輯：我的意思是PLUSHIE，不是TAXIDERMY 我可以寫幾頁關於那條狗的文章，但我要保持簡短。\n但我還是要簡短地說說。\n\n我在當班期間離開了人手不足的工作崗位，去陪伴它的最後時刻。\n和它一起度過最後的時光。\n\n當我到達那裏時，我仍然處於震驚之中，我不知道他出了什麼問題------。\n它還沒有開始。那是...",
      "title": "花300美元買一個克隆我昨天去世的狗的毛絨玩具會不會很奇怪？"
    }
  ]
}