{
  "author": "Worth-Ad8369",
  "the_new_excerpt": "Ok this question is really for all of us who live in the USA, and is more\napplicable to non COVID times. And I want to say that I am genuinely curious\nabout this AND I always tip at least 20%. However, I don't really understand why\nsome servers get very upset at non-tipping customers rather than at…",
  "original_created_utc": 1614932415,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，这个问题其实是针对我们所有生活在美国的人来说的，而且是较\n适用于非COVID时代。我想说的是，我真的很好奇\n关于这一点，我总是至少给20%的小费。然而，我真的不明白为什么\n有些服务员对不给小费的顾客非常不满，而不是... ...",
      "title": "为什么服务员会对不给小费的顾客发火，而不是对没有给他们合理工资的雇主发火？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，這個問題其實是針對我們所有生活在美國的人來說的，而且是較\n適用於非COVID時代。我想說的是，我真的很好奇\n關於這一點，我總是至少給20%的小費。然而，我真的不明白爲什麼\n有些服務員對不給小費的顧客非常不滿，而不是... ...",
      "title": "爲什麼服務員會對不給小費的顧客發火，而不是對沒有給他們合理工資的僱主發火？"
    }
  ],
  "title": "Why do servers get mad at non-tipping customers rather than their employers who are not paying them a fair wage?",
  "created_utc": 1614947559,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Ok this question is really for all of us who live in the USA, and is more applicable to non COVID times. And I want to say that I am genuinely curious about this AND I always tip at least 20%. However, I don&#39;t really understand why some servers get very upset at non-tipping customers rather than at their employers. I understand that it is a hard job, and that some workers don&#39;t get paid very much so the tips help make up for that, but I feel like the responsibility should not be on the customer to pay additional money for the server&#39;s wage. My friend worked as a server and would get paid $2.70 an hour and rely on tips for her wage. I see countless rants from servers on Social Media about non-tipping customers and I am just confused. Why isn&#39;t that energy redirected at the employer paying them $2.70 an hour? Why haven&#39;t more people and servers tried to pass laws to ensure that servers are paid a better wage, and do not have to rely on tips? I have wondered this for years.</p>\n</div><!-- SC_ON -->",
  "score": 356,
  "permalink": "/r/NoStupidQuestions/comments/ly7dp7/why_do_servers_get_mad_at_nontipping_customers/",
  "subreddit": "NoStupidQuestions",
  "id": "ly7dp7",
  "is_self": true,
  "media": null,
  "is_video": false
}