{
  "author": "Gausauce",
  "the_new_excerpt": "Hi fellow retards!\n\nMy hypothesis and granted this may have already been postulated here is that the\nhedgers had enough liquidity in Jan to short GME and temper the price back down.\nNow it appears that they’ve run out of liquidity and are forced to sell their\nincome generating securities to continue…",
  "original_created_utc": 1614447300,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "嗨，弱智的朋友们!\n\n我的假设，当然这可能已经在这里被推测出来了。\n对冲者在1月份有足够的流动性做空GME，使价格回落。\n现在看来，他们已经耗尽了流动性，被迫卖出他们的GME。\n创收证券继续...",
      "title": "短裤是真的没子弹了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嗨，弱智的朋友們!\n\n我的假設，當然這可能已經在這裏被推測出來了。\n對沖者在1月份有足夠的流動性做空GME，使價格回落。\n現在看來，他們已經耗盡了流動性，被迫賣出他們的GME。\n創收證券繼續...",
      "title": "短褲是真的沒子彈了。"
    }
  ],
  "title": "Shorts are literally running out of bullets.",
  "created_utc": 1614478765,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi fellow retards!</p>\n\n<p>My hypothesis and granted this may have already been postulated here is that the hedgers had enough liquidity in Jan to short GME and temper the price back down. Now it appears that they’ve run out of liquidity and are forced to sell their income generating securities to continue to short in an act of desperation. </p>\n\n<p>As a parallel - consider it from a mortgage perspective they’re trying to stave of foreclosure by first burning through savings and now they’re selling off their valuable possessions. So they can’t borrow off margin, they are out of cash and now they’re selling off their source of income. Which by the way hurts the passive investors that like their ETF stocks, but the hedges don’t give a shit. They just want to short GME no matter the cost. </p>\n\n<p>The mortgage allegory reminds me of say the 2008 crisis - I used to be a loan officer and the exotic sub prime mortgages were horse shit. You could qualify for a mortgage back then with a DTI (debt to income ratio) of 65%. For those unaware DTI is the ratio of your GROSS income vs the PITI of your home and all revolving and installment debt on your credit report. It does not factor in payments for utilities, food, gas. So they assume people can afford a house with the 35% of gross fucking income after their monthly debt is paid? No. Now the opposite is happening again. They deserve this for their insatiable greed and lack of compassion for anyone but themselves. </p>\n\n<p>Hedgies have no cash and selling their income generating stocks to continue this fight. Eventually they’ll run out of those and will have no choice but to cover no matter the price. They fucking deserve it. From their ashes I hope we can build a market that is free and open without their influence and heavy shorting a float will be illegal. If I want to pay x dollars for a stock, that’s my business. Shorting is bullshit. Think a company is overvalued? Then close your position and find another fucking stock. The government should be appalled. Trying to BK a company not only puts thousands out of a job, but reduces the income tax stream from them to the gov’t. Not only that but now they’re on the govt payroll via unemployment. All this so they can profit off of destruction. Fuck. You. Long post I’m sorry.</p>\n\n<p>TLDR: hedgies are going to burn for their atrocities. </p>\n\n<p>My position: 914 shares of GME and one 3/5 $100 call. The shares I’d be willing to part with for say a minimum of 4 figures per share. Maybe 5 who knows? 42,069 per share has a nice ring to it. I like the stock and this isn’t financial advice. Hedge funds are cucks.</p>\n</div><!-- SC_ON -->",
  "score": 4470,
  "permalink": "/r/wallstreetbets/comments/ltt17r/shorts_are_literally_running_out_of_bullets/",
  "subreddit": "wallstreetbets",
  "id": "ltt17r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937752770
}