{
  "author": "Mektzer",
  "the_new_excerpt": "People are so clueless about bitcoin it's mindboggling for those who have been\nin it and around it for years and years.. it makes you realise we're still so\nearly..\n\nTesla bought 70k bitcoins, Michael Saylor bought 90k bitcoins, so many other big\nand small companies and high net worth individuals…",
  "original_created_utc": 1619685268,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "人々はビットコインについてあまりにも無知なので、何年もビットコインに関わってきた人にとっては呆れてしまいます。\n何年も何年もビットコインに関わってきた人たちにとっては、驚くべきことです。\n早いもので...\n\nテスラは7万ビットコインを購入し、マイケル・セイラーは9万ビットコインを購入し、その他多くの大小の企業が\n他にも多くの大企業や中小企業、個人富裕層が...",
      "title": "人々はビットコインや暗号についてとても無知です...私たちはまだとても早いのです"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "人们对比特币是如此的无知，对于那些已经在其中和周围的人来说，这简直是匪夷所思。\n让你意识到我们仍然是如此的\n早期...\n\n特斯拉买了7万个比特币，迈克尔-赛勒买了9万个比特币，还有许多其他大\n小公司和高净值个人...",
      "title": "人们对比特币和加密货币是如此的无知，我们还是如此的早!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "人們對比特幣是如此的無知，對於那些已經在其中和周圍的人來說，這簡直是匪夷所思。\n讓你意識到我們仍然是如此的\n早期...\n\n特斯拉買了7萬個比特幣，邁克爾-賽勒買了9萬個比特幣，還有許多其他大\n小公司和高淨值個人...",
      "title": "人們對比特幣和加密貨幣是如此的無知，我們還是如此的早!"
    }
  ],
  "title": "People are so clueless about bitcoin and crypto.. we're still so early!",
  "created_utc": 1619713831,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>People are so clueless about bitcoin it&#39;s mindboggling for those who have been in it and around it for years and years.. it makes you realise we&#39;re still so early.. </p>\n\n<p>Tesla bought 70k bitcoins, Michael Saylor bought 90k bitcoins, so many other big and small companies and high net worth individuals bought it and speak good things about it, Jack Dorsey and Square are building around it and believing in it, ETFs are about to be approved all over the place, big traditional investors are coming in, heck there are several politicians in the US that believe in bitcoins future.. there are so many exciting new developments, new platforms, new technologies, new services that are constantly being built.. </p>\n\n<p>But nothing of all this matters. Outsiders will stay outsiders. They just don&#39;t care, their prejudice is too strong. We know it because we all were there at some point, thinking it&#39;s a scam, that it will be outlawed, that it won&#39;t work etc. But get ready folks because (in my opinion) things are about to change, after a slow and steady grind things will change suddenly and all at once. </p>\n\n<p>Just my 2 sats.. keep stacking &#39;em up!</p>\n</div><!-- SC_ON -->",
  "score": 219,
  "permalink": "/r/Bitcoin/comments/n10134/people_are_so_clueless_about_bitcoin_and_crypto/",
  "subreddit": "Bitcoin",
  "id": "n10134",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380957431
}