{
  "author": "ICareAboutThings25",
  "original_created_utc": 1646528171,
  "title": "Why is it “selfish” to not have children?",
  "created_utc": 1646543788,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Isn’t it way more selfish to create a human for the wrong reason? Not saying having kids is always selfish, just if it’s done for the wrong reasons. &lt;/p&gt;\n\n&lt;p&gt;I’ve heard stories of child free people being told they’re “selfish” by relatives for not having children. But I don’t understand the logic.&lt;/p&gt;\n\n&lt;p&gt;Edit: I’m not saying it actually is. I should have phrased my question as “What’s the argument behind this sentiment?”&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/t7nb6h/why_is_it_selfish_to_not_have_children/",
  "subreddit": "TooAfraidToAsk",
  "id": "t7nb6h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Isn’t it way more selfish to create a human for the wrong reason? Not saying\nhaving kids is always selfish, just if it’s done for the wrong reasons.\n\nI’ve heard stories of child free people being told they’re “selfish” by\nrelatives for not having children. But I don’t understand the logic.\n\nEdit:…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "間違った理由で人間を作る方がよっぽど利己的じゃないですか？とは言いませんが\n子供を持つことは常に利己的ですが、それが間違った理由で行われた場合だけです。\n\n子供がいない人が、「自分勝手だ」と言われたという話を聞いたことがあります。\n親族が子供を作らないことで でも、その理屈は理解できない。\n\n編集部：...",
      "title": "なぜ、子供を作らないことが「わがまま」なのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "为了错误的原因而创造一个人，这不是更自私吗？不是说\n生孩子总是自私的，只是如果它是出于错误的原因。\n\n我听说过一些没有孩子的人被亲戚说成是 \"自私 \"的。\n亲戚说他们 \"自私\"，因为他们不生孩子。但我不明白这种逻辑。\n\n编辑：...",
      "title": "为什么不生孩子是 \"自私 \"的呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "爲了錯誤的原因而創造一個人，這不是更自私嗎？不是說\n生孩子總是自私的，只是如果它是出於錯誤的原因。\n\n我聽說過一些沒有孩子的人被親戚說成是 \"自私 \"的。\n親戚說他們 \"自私\"，因爲他們不生孩子。但我不明白這種邏輯。\n\n編輯：...",
      "title": "爲什麼不生孩子是 \"自私 \"的呢？"
    }
  ]
}