{
  "author": "Luxri",
  "the_new_excerpt": "I am writing an essay, and I claimed that people have said that poor people are\npoor because of their own moral failings. I have heard this in school when I was\nyounger, but I have been unable to find a reliable source or any source at all\nreally. Is this statement just flat out wrong then? The…",
  "original_created_utc": 1622724236,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はエッセイを書いているのですが、私が主張したのは、「貧しい人が貧しいのは、その人自身の道徳的な欠陥のためだ」と言っている人がいるということです。\n貧乏人は自分のモラルがないから貧乏なんだ」と言っています。私が若い頃、学校で聞いたことがあります。\nしかし、私は信頼できるソースを見つけることができませんでしたし、ソースを見つけることもできませんでした。\nと言っています。では、この発言は全くの誤りなのでしょうか？その...",
      "title": "貧困はモラルに反するという考えはどこから来ているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我正在写一篇文章，我声称人们曾说过，穷人是\n穷人是因为他们自己的道德失败。我年轻时在学校听说过这个说法。\n但我一直无法找到可靠的来源或任何来源。\n真的。那么这种说法是不是完全错误呢？这句话...",
      "title": "贫穷是一种道德失败的想法从何而来？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我正在寫一篇文章，我聲稱人們曾說過，窮人是\n窮人是因爲他們自己的道德失敗。我年輕時在學校聽說過這個說法。\n但我一直無法找到可靠的來源或任何來源。\n真的。那麼這種說法是不是完全錯誤呢？這句話...",
      "title": "貧窮是一種道德失敗的想法從何而來？"
    }
  ],
  "title": "Where does the idea that poverty is a moral failing come from?",
  "created_utc": 1622743433,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am writing an essay, and I claimed that people have said that poor people are poor because of their own moral failings. I have heard this in school when I was younger, but I have been unable to find a reliable source or any source at all really. Is this statement just flat out wrong then? The strange thing is that I have found articles talking about how the idea that poverty is a moral failing is a lie, but no source as to where said idea comes from. I just really need a good source but I just can&#39;t find a good article that speaks of the idea&#39;s origin.</p>\n</div><!-- SC_ON -->",
  "score": 111,
  "permalink": "/r/AskHistorians/comments/nrclng/where_does_the_idea_that_poverty_is_a_moral/",
  "subreddit": "AskHistorians",
  "id": "nrclng",
  "is_self": true,
  "media": null,
  "is_video": false
}