{
  "author": "IntrospectiveAnimal",
  "original_created_utc": 1643177036,
  "title": "Has anyone ever felt that their childhood dog taught them more about sincerity, communication, and socializing than their biological parents?",
  "created_utc": 1643197820,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I grew up with a fantastic dog.  She was everything to me.  When I got diagnosed with a chronic disease when I was young, I showed no emotion to anyone, until I burst into tears only upon seeing her.  She immediately comforted me.&lt;/p&gt;\n\n&lt;p&gt;I went on to work with canines for many years of my life.  Wolves, coyotes, and foxes in particular.  I have met, lived with, cared for over 60 wolves (at sanctuaries). Even raised one from birth.  My baby girl. My best friend, at one point, was a coyote. He didn’t let anyone touch him.. and I was the first. They always made more sense to me than humans.&lt;/p&gt;\n\n&lt;p&gt;Love and be loved- respect and be respected. They are so simple in that regard…and not ironically, like me. I find humans to  often be absolutely absurd in their logic.. but dogs just make sense.&lt;/p&gt;\n\n&lt;p&gt;I really am afraid to ask.  Because I know I’m a  bit divergent. But this is one aspect of my self I am curious to know more about.&lt;/p&gt;\n\n&lt;p&gt;Has anyone ever felt like they understand canines better than humans, to this scale?\nI feel like I have three parents.  Only… I connected best with the dog.  To this day I feel more comfortable around canines than I do humans.  I’m distant from my family, but latch on immediately to any dog that gives me a ‘smile’ and a “howdy, do you play?”  Likewise, I’m very good at knowing when a dog doesn’t want attention, or understanding their needs and desires- like how important to them their favorite bone is.  Or how fucking with them can really stress them out. It hurts sometimes when I see people interacting with dogs- yanking on leashes and feeding them food the garbage bin behind Trader Joe’s would refuse. I’m the guy that will remember to bring your dog a treat, but forget the wine I said I’d bring for dinner.&lt;/p&gt;\n\n&lt;p&gt;Children are intuitive.  If you try and pretend everything is fine, your kid will see through it. Dogs don’t do that to others.  They are genuine.  So am I a lone wolf on this, or are there other people that feel this, too?&lt;/p&gt;\n\n&lt;p&gt;(Btw, I am not one of those “Wolves are my spirit guide” people.  I genuinely feel similar to canines.)&lt;/p&gt;\n\n&lt;p&gt;edit- I’m going to try and sleep again.  I hope I get some responses. Dreamwell, everyone.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/TooAfraidToAsk/comments/scyyzb/has_anyone_ever_felt_that_their_childhood_dog/",
  "subreddit": "TooAfraidToAsk",
  "id": "scyyzb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I grew up with a fantastic dog. She was everything to me. When I got diagnosed\nwith a chronic disease when I was young, I showed no emotion to anyone, until I\nburst into tears only upon seeing her. She immediately comforted me.\n\nI went on to work with canines for many years of my life. Wolves,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は素晴らしい犬と一緒に育ちました。彼女は私のすべてでした。私が\n若い頃、持病のある私は誰にも感情を見せなかった。\nこの子と出会って、初めて涙がこぼれた。彼女はすぐに私を慰めてくれました。\n\n私はその後、長年にわたってイヌに関わる仕事をしました。オオカミ、...",
      "title": "実の親よりも幼い頃の愛犬に、誠意やコミュニケーション、人付き合いについて教わったと感じた人はいるだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我和一只神奇的狗一起长大。她是我的一切。当我被诊断出\n时，我没有对任何人表现出任何情感，直到我看到她时才泪流满面。\n直到我看到她时才泪流满面。她立即安慰了我。\n\n在我生命中的许多年里，我一直在与犬类打交道。狼、...",
      "title": "有没有人觉得他们小时候的狗比他们的亲生父母更懂得真诚、沟通和社交？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我和一隻神奇的狗一起長大。她是我的一切。當我被診斷出\n時，我沒有對任何人表現出任何情感，直到我看到她時才淚流滿面。\n直到我看到她時才淚流滿面。她立即安慰了我。\n\n在我生命中的許多年裏，我一直在與犬類打交道。狼、...",
      "title": "有沒有人覺得他們小時候的狗比他們的親生父母更懂得真誠、溝通和社交？"
    }
  ]
}