{
  "author": "herereadthis",
  "the_new_excerpt": "It's been quite interesting to follow these two coins, as they were both started\nby Ethereum founders, and both seek to solve problems those founders had with\nETH 1.0.\n\nPolkadot has been rolling out new features and recently Acala has won a\nparachain slot. Its price has been inching closer and…",
  "original_created_utc": 1617388949,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "关注这两枚硬币是相当有趣的，因为它们都是始作俑者。\n的Ethereum创始人，两者都是为了解决这些创始人与\nETH 1.0。\n\nPolkadot一直在推出新的功能，最近Acala获得了一个\n伞形槽。其价格已渐渐逼近，...",
      "title": "波尔卡多(DOT)的市值已经悄然超过了卡达诺(ADA)。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "關注這兩枚硬幣是相當有趣的，因爲它們都是始作俑者。\n的Ethereum創始人，兩者都是爲了解決這些創始人與\nETH 1.0。\n\nPolkadot一直在推出新的功能，最近Acala獲得了一個\n傘形槽。其價格已漸漸逼近，...",
      "title": "波爾卡多(DOT)的市值已經悄然超過了卡達諾(ADA)。"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "この2つのコインを追いかけるのはとても面白いことでした。\nこの2つのコインは、イーサリアムの創始者が始めたもので、創始者がETH 1.0で抱えていた問題を解決しようとしたものです。\nETH 1.0で創業者たちが抱えていた問題を解決しようとしているからです。\n\nPolkadotは新機能を展開しており、最近ではAcalaが優勝した\nparachainスロットを獲得しました。その価格は少しずつ近づいてきており、...",
      "title": "ポルカドット（DOT）は、時価総額でカルダノ（ADA）を静かに追い抜いた。"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "この2つのコインを追いかけるのはとても面白いことでした。\nこの2つのコインは、イーサリアムの創始者が始めたもので、創始者がETH 1.0で抱えていた問題を解決しようとしたものです。\nETH 1.0で創業者たちが抱えていた問題を解決しようとしているからです。\n\nPolkadotは新機能を展開しており、最近ではAcalaが優勝した\nparachainスロットを獲得しました。その価格は少しずつ近づいてきており、...",
      "title": "ポルカドット（DOT）は、時価総額でカルダノ（ADA）を静かに追い抜いた。"
    }
  ],
  "title": "Polkadot (DOT) has quietly overtaken Cardano (ADA) in market cap.",
  "created_utc": 1617399744,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It&#39;s been quite interesting to follow these two coins, as they were both started by Ethereum founders, and both seek to solve problems those founders had with ETH 1.0. </p>\n\n<p>Polkadot has been rolling out new features and recently Acala has won a parachain slot. Its price has been inching closer and closer to $40 though I suspect it there will be quite a selloff at that point.</p>\n\n<p>Meanwhile, ADA has been holding steady at around $1.20 for the entire month of March. A re-accumulation phase, perhaps? They are promising smart contracts soon, however.</p>\n\n<p>Disclaimer: I don&#39;t think Crypto is a zero-sum game. There&#39;s room for every coin to be a winner. I also don&#39;t think either of these coins are Ethereum killers, that&#39;s just shill talk. It&#39;s just an exciting time to watch both DOT and ADA try to position themselves while ETH 2.0 is not too far off.</p>\n</div><!-- SC_ON -->",
  "score": 666,
  "permalink": "/r/CryptoCurrency/comments/miqnyf/polkadot_dot_has_quietly_overtaken_cardano_ada_in/",
  "subreddit": "CryptoCurrency",
  "id": "miqnyf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961875620
}