{
  "author": "wists",
  "original_created_utc": 1644060025,
  "title": "BTC has just undone a month's worth of decline in 24 hours; this is why the crypto market is so entertaining",
  "created_utc": 1644082481,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It never closes and that&amp;#39;s probably where the obsession lies for so many: there&amp;#39;s no weekend or nighttime reprieve from the upticks and downticks. You know that when you go to bed and when you wake up in the morning something will have changed in your portfolio; things jump up or fall off of a cliff our of nowhere and you&amp;#39;re just lying there thinking about what you&amp;#39;re going to buy when it all works out (because it feels like an inevitability); you wake up and shrug off the -5% because you&amp;#39;re sure that eventually it&amp;#39;ll be made up, and it might not even take that long because of how quickly things seem to gain or lose momentum. At first it&amp;#39;s stressful but if you stick around you develop a kind of gallows humour where you just laugh and wait for the next day to come around to throw more coins into the money pit. Because one day you know you&amp;#39;ll have enough for that little impractical squashed-looking yellow car.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 325,
  "permalink": "/r/CryptoCurrency/comments/sl4rdn/btc_has_just_undone_a_months_worth_of_decline_in/",
  "subreddit": "CryptoCurrency",
  "id": "sl4rdn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "It never closes and that's probably where the obsession lies for so many:\nthere's no weekend or nighttime reprieve from the upticks and downticks. You\nknow that when you go to bed and when you wake up in the morning something will\nhave changed in your portfolio; things jump up or fall off of a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "決して閉まらない、そこに多くの人がこだわりを持っているのでしょう。\n週末も夜間も、上昇と下降から解放されることがないのです。あなたは\n寝る時も朝起きる時も、何かが起きていることは分かっています。\nポートフォリオに変化があり、物事が跳ね上がったり、落ちたりしています。",
      "title": "BTCは24時間で1ヶ月分の下落を取り戻した。これが暗号市場の面白さだ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "它从未关闭过，这可能是许多人痴迷的地方。\n周末或晚上都不能从上升和下降中缓和过来。你知道吗？\n你知道，当你上床睡觉和早上醒来时，你的投资组合会发生一些变化。\n在你的投资组合中发生了变化；一些东西从你的投资组合中跳起来或掉下来。",
      "title": "BTC刚刚在24小时内撤销了一个月的跌幅；这就是加密货币市场如此具有娱乐性的原因"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "它從未關閉過，這可能是許多人癡迷的地方。\n週末或晚上都不能從上升和下降中緩和過來。你知道嗎？\n你知道，當你上牀睡覺和早上醒來時，你的投資組合會發生一些變化。\n在你的投資組合中發生了變化；一些東西從你的投資組合中跳起來或掉下來。",
      "title": "BTC剛剛在24小時內撤銷了一個月的跌幅；這就是加密貨幣市場如此具有娛樂性的原因"
    }
  ]
}