{
  "author": "lwc-wtang12",
  "original_created_utc": 1634913362,
  "title": "I've tried to use Ethereum 10-15 times over the last year for basic swaps and it is utterly unusable in every possible way",
  "created_utc": 1634942149,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Recently I wanted to try to swap out my Uni for Sol. To do this I needed to make sure enough eth was in the Uni address to be able to pay the gas fee (there wasn&#39;t. TX 1 - ridiculous gas fee).</p>\n\n<p>Then I need to send Uni from HW wallet to metamask or something similar (TX 2 - ridiculous gas fee). edit: this one is my fault - I should have simply connected my HW wallet to metamask.</p>\n\n<p>Then I need to swap Uni for a stablecoin (TX 3 - ridiculous gas fee).</p>\n\n<p>Then you need to convert an erc20 stablecoin to a version that works on the Sol chain (TX 4 - ridiculous gas fee).</p>\n\n<p>But oh wait you don&#39;t have enough Eth in your wallet now to do the conversion because you spent well over $100 on the four TXs leading up to this so you must send another $60 of eth again. But you should actually send $120 because that transaction will have huge gas fees too...... (TX 5 - ridiculous gas fee).</p>\n\n<p>At this point I gave up on the whole thing. I&#39;m not trying to dump hundreds of dollars of Eth just to swap Uni for Sol. (The process of switching a stablecoin from ERC20 to a different chain is also a convoluted nightmare but that was expected).</p>\n\n<p>I have a bag of eth locked away simply as an investment and with the hope that eth 2 is somewhere on the horizon but good god it is not a usable system in any sense of the word usable. And yeah yeah &quot;use layer 2.&quot; I&#39;ve heard it 100 times but it still costs an arm and a leg to get in and out of layer 2. It&#39;s barely a bandaid to the underlying issue.</p>\n\n<p>For layer 2 to have been helpful here I would have needed to send Eth and Uni from one single address to metamask and then bridged to a layer 2 from there. But if your ERC20 coin isn&#39;t in the same address as your eth then you need to send eth to the address with the ERC20 so you can actually move it to metamask. All of this takes insane fees relative to the action I am trying to take.</p>\n\n<p>If you own ethereum it&#39;s basically no different than having your funds locked in an escrow account unless you have like 10+ ethereum to play around with to actually be able to comfortably fund transactions without hurting your stack. Then again, regardless of how much money you have these fees are unbearable.</p>\n\n<p>To be clear, I am still a fan of Eths vision. I am not a fan of some of these new &quot;eth killers&quot; as they aren&#39;t decentralized and are backed by venture capital firms. This goes against the entire purpose and ethos of cryptocurrency in the first place to me. The only reason I was going to grab some Sol was to see if I could catch a moon shot to like $400 or something (aka greed). But perhaps this was a sign...</p>\n\n<p>The only ones I genuinely care for are the ones that had fair coin distributions, have ease of participation (requirements to run a node), and are decentralized. Sol does not have any of those properties. There is a small handful of projects aiming to be what Eth is still trying to achieve that are interesting (ada, xtz, and so on).</p>\n\n<p>At the end of the day, the barrier to entry to literally all of DeFi is massive. And not just because it&#39;s expensive to use, but because it is an extremely confusing shit show to anyone above the age of 45 (unless tech-savvy) and to those that are simply not tech-savvy. The front-end user interfaces and interoperability have a LONG way to go.</p>\n\n<p>The great thing about this is that this is kind of a good problem to have in a sense. Those who are trying and using this stuff are extremely early. It&#39;s like we are using flip phones and the first iphones are about to come out.</p>\n</div><!-- SC_ON -->",
  "score": 167,
  "permalink": "/r/CryptoCurrency/comments/qdi9i8/ive_tried_to_use_ethereum_1015_times_over_the/",
  "subreddit": "CryptoCurrency",
  "id": "qdi9i8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Recently I wanted to try to swap out my Uni for Sol. To do this I needed to make\nsure enough eth was in the Uni address to be able to pay the gas fee (there\nwasn't. TX 1 - ridiculous gas fee).\n\nThen I need to send Uni from HW wallet to metamask or something similar (TX 2 -\nridiculous gas fee). edit:…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、UniをSolに交換してみたいと思いました。これを行うためには、ユニのアドレスに\nガス代を払えるだけのethがUniのアドレスにあることを確認する必要がありました（ありませんでした。\nませんでした。TX 1 - 馬鹿げたガソリン代）。)\n\nその後、HWウォレットからmetamaskなどにUniを送る必要があります（TX 2 - とんでもないガソリン代）。\nedit:...",
      "title": "去年、イーサリアムを基本的なスワップに10～15回使ってみましたが、あらゆる面で全く使えませんでした。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近我想尝试把我的Uni换成Sol。要做到这一点，我需要确保\n为了做到这一点，我需要确保Uni的地址中有足够的道德，以便能够支付汽油费（没有。\n没有。TX1--可笑的汽油费）。)\n\n然后我需要将Uni从HW钱包发送到metamask或类似的地方（TX2--荒谬的汽油费）。\n编辑：...",
      "title": "在过去的一年里，我曾尝试使用以太坊进行基本的交换，但它在所有可能的方面都完全无法使用。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近我想嘗試把我的Uni換成Sol。要做到這一點，我需要確保\n爲了做到這一點，我需要確保Uni的地址中有足夠的道德，以便能夠支付汽油費（沒有。\n沒有。TX1--可笑的汽油費）。)\n\n然後我需要將Uni從HW錢包發送到metamask或類似的地方（TX2--荒謬的汽油費）。\n編輯：...",
      "title": "在過去的一年裏，我曾嘗試使用以太坊進行基本的交換，但它在所有可能的方面都完全無法使用。"
    }
  ]
}