{
  "author": "kscruggs182",
  "original_created_utc": 1655536672,
  "title": "Why is there a double standard with christianity?",
  "created_utc": 1655558563,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Don’t attack me or the religion this is just a question. Disrespecting christianity (along with catholicism, baptism- all the jesus stuff) has been widely accepted but when disrespect is caught going to other religions there’s immediately a defense. On tiktok and twitter I see mostly 14-25 year olds just putting the whole religion on blast and saying the most disrespectful things that would never be said about any other religion in public, also dressing up as nuns, priests, god and such for halloween when its frowned upon to dress up as other religious figures and/or in others cultural attire. Also the whole trend of wearing rosaries just as fashion. I see a lot of people blatantly telling christians that their religion is fake and how the bible is fiction, but happen to be the same people who defend other religions? btw im not associated w any religion im just curious from an outside POV, also i have no biases i understand this is a touchy subject im fr just curious&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/TooAfraidToAsk/comments/vf0s6v/why_is_there_a_double_standard_with_christianity/",
  "subreddit": "TooAfraidToAsk",
  "id": "vf0s6v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Don’t attack me or the religion this is just a question. Disrespecting\nchristianity (along with catholicism, baptism- all the jesus stuff) has been\nwidely accepted but when disrespect is caught going to other religions there’s\nimmediately a defense. On tiktok and twitter I see mostly 14-25 year…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私や宗教を攻撃しないでください......これは単なる質問です。キリスト教を軽んじることは\nキリスト教（カソリック、洗礼、イエスにまつわるすべてのもの）を軽視することは\n広く受け入れられていますが、他の宗教への不敬が発覚すると、すぐさま擁護の声が\nすぐに防御になります。tiktokやtwitterでは、主に14～25歳...",
      "title": "なぜ、キリスト教にはダブルスタンダードがあるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "不要攻击我或宗教，这只是一个问题。不尊重\n基督教（以及天主教、洗礼--所有关于耶稣的东西）已被广泛接受。\n但当不尊重其他宗教的行为被发现时，就会有\n马上就有了辩护。在tiktok和twitter上，我看到大多数14-25岁的人...",
      "title": "为什么对基督教有双重标准？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不要攻擊我或宗教，這只是一個問題。不尊重\n基督教（以及天主教、洗禮--所有關於耶穌的東西）已被廣泛接受。\n但當不尊重其他宗教的行爲被發現時，就會有\n馬上就有了辯護。在tiktok和twitter上，我看到大多數14-25歲的人...",
      "title": "爲什麼對基督教有雙重標準？"
    }
  ]
}