{
  "author": "Desert_Rattler",
  "the_new_excerpt": "I can't be the only one. And don't get me wrong, I've zoomed out, I'm up\nsignificantly over the last few months but god damn. When I watch Shiba Inu and\nKeannu Inu and Safemoon and all these fucking shitcoins go off and calculate how\nmuch money I would have made if I was willing to gamble that…",
  "original_created_utc": 1620766747,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私だけではないはずです。誤解を恐れずに言えば、ズームアウトした私はアップ\nここ数ヶ月で大幅にアップしましたが、なんということでしょう。柴犬を見ていると\nKeannu InuやSafemoonなどのクソコインを見て、もし自分が稼いでいたらどれだけ儲かっていたかを計算してみた。\n賭けていたらどれだけ儲かっていたか...。",
      "title": "私が投資している合法的で価値を提供する高度に開発されたプロジェクトがゆっくりと成長する一方で、クソコインが急上昇するのを見て、極度に不愉快になるのは私だけでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不可能是唯一的一个。不要误会我的意思，我已经放大了，我起来了\n在过去的几个月里，我的成绩显著提高，但该死的是。当我观看《柴犬》和\n基努-伊努和萨菲姆，以及所有这些该死的狗屎硬币，并计算出如果我是一个人，会赚多少钱？\n我可以赚多少钱，如果我愿意赌的话......",
      "title": "难道我是唯一一个看着狗屎币起飞而我所投资的合法的、提供价值的、高度发展的项目缓慢增长的人吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不可能是唯一的一個。不要誤會我的意思，我已經放大了，我起來了\n在過去的幾個月裏，我的成績顯著提高，但該死的是。當我觀看《柴犬》和\n基努-伊努和薩菲姆，以及所有這些該死的狗屎硬幣，並計算出如果我是一個人，會賺多少錢？\n我可以賺多少錢，如果我願意賭的話......",
      "title": "難道我是唯一一個看着狗屎幣起飛而我所投資的合法的、提供價值的、高度發展的項目緩慢增長的人嗎？"
    }
  ],
  "title": "Am I the only one that gets super salty watching shitcoins take off while the legitimate, value providing, highly developed projects I'm invested in grow slowly?",
  "created_utc": 1620786600,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I can&#39;t be the only one. And don&#39;t get me wrong, I&#39;ve zoomed out, I&#39;m up significantly over the last few months but god damn. When I watch Shiba Inu and Keannu Inu and Safemoon and all these fucking shitcoins go off and calculate how much money I would have made if I was willing to gamble that aggressively it pisses me off. Not because I&#39;m missing out so much as knowing what it would do to the crypto market as a whole if these people just invested in any of the projects that are legitimate and have development teams that know what they&#39;re doing. </p>\n\n<p>I was around in 2017 and things were similar but it feels different right now. Now that we have DEXs where people can swap from one coin to another without the projects having to be listed on exchanges it seems like the a side of the market that didn&#39;t exist before has emerged. It&#39;s dark, there are no clocks or windows and the carpet is patterned to excite. Gamblers line up to throw their money into the latest and greatest shitcoin and the smart ones get out with significant returns, the not so smart ones convince themselves they&#39;ve found the next BTC and start trying to indoctrinate as many people as they can into this &quot;world changing technology&quot; they found.</p>\n</div><!-- SC_ON -->",
  "score": 872,
  "permalink": "/r/CryptoCurrency/comments/na7k7n/am_i_the_only_one_that_gets_super_salty_watching/",
  "subreddit": "CryptoCurrency",
  "id": "na7k7n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985992430
}