{
  "author": "Set1Less",
  "original_created_utc": 1633801535,
  "title": "Vitalik hitting out against Bitcoin because of El Salvador's adoption and spreading FUD like buttcoiners shows he is just a hypocrite",
  "created_utc": 1633831690,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Vitalik has posted a high and mightly criticism of Bitcoin&#39;s adoption as legal tender in El Salvador, labelling it &quot;against crypto&#39;s principles&quot;</p>\n\n<p>But where where crypto principles when he pre-mined 72m ETH out of thin air to give it away to VCs and insiders?</p>\n\n<p>The shitcoin culture he created started the ponzi token boom on the blockchain, and now his chain the home of countless pyramid schemes and scams, literally full of grifters and garbage NFT peddlers trying to sell their crap to the next guy who is willing to buy it off them, all for a negative sum ecosystem where an average user cant even transact because of prohibitive gas fees.</p>\n\n<p>Somehow this person has a problem with a country adopting bitcoin.</p>\n\n<p>He says El Salvador&#39;s &quot;unplanned rollout&quot; risks a large number of innocent people getting hacked or scammed</p>\n\n<p>Lol, he created the network where the most number of crypto scams are happening, on a daily basis. Not even considering absolutely sum zero games like Pfp scams that are being sold for ludicrous sums, and other garbage that are purely just greedy grifting. People are losing all their savings just because of gas bugs thanks to incompatible wallets after eip1559.</p>\n\n<p>If he really cared about people getting hacked or scammed, wouldnt it have been better if he hadnt even created Ethereum in the first place? How many scams could he have prevented?</p>\n\n<p>He is literally the father of Shitcoins, trying to put down Satoshi&#39;s vision of financial freedom for everyone, just because his shitcoin didnt make the cut. Shameful.</p>\n</div><!-- SC_ON -->",
  "score": 173,
  "permalink": "/r/Bitcoin/comments/q4q71k/vitalik_hitting_out_against_bitcoin_because_of_el/",
  "subreddit": "Bitcoin",
  "id": "q4q71k",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Vitalik has posted a high and mightly criticism of Bitcoin's adoption as legal\ntender in El Salvador, labelling it \"against crypto's principles\"\n\nBut where where crypto principles when he pre-mined 72m ETH out of thin air to\ngive it away to VCs and insiders?\n\nThe shitcoin culture he created started…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Vitalikは、ビットコインがエルサルバドルで法定通貨に採用されたことについて、高らかに、そして激しく批判しました。\nエルサルバドルでのビットコインの法定通貨化を「暗号の原則に反する」と批判しています。\n\nしかし、彼が7200万ETHを空中から採掘してVCやインサイダーに配ったとき、暗号の原則はどこにあったのでしょうか？\nそれをVCやインサイダーに配っていたとき、暗号の原則はどこにあったのでしょうか？\n\n彼が生み出したシットコイン文化は...",
      "title": "エルサルバドルが採用したからといってビットコインに反対を叩き、buttcoinersのようにFUDを広めるVitalikは、彼がただの偽善者であることを示している。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "维塔利克发表了一篇关于比特币在萨尔瓦多作为法定货币的高度和强烈的批评。\n抨击萨尔瓦多采用比特币作为法定货币，称其 \"违背了加密货币的原则\"\n\n但是，当他凭空预先开采了7200万个ETH并将其送给VC时，加密货币的原则在哪里？\n送给风险投资公司和内部人士的时候，加密货币的原则在哪里？\n\n他所创造的屎币文化开始......",
      "title": "维塔利克因为萨尔瓦多的采用而对比特币大打出手，并像屁民一样散布FUD，说明他只是一个伪君子。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "維塔利克發表了一篇關於比特幣在薩爾瓦多作爲法定貨幣的高度和強烈的批評。\n抨擊薩爾瓦多采用比特幣作爲法定貨幣，稱其 \"違背了加密貨幣的原則\"\n\n但是，當他憑空預先開採了7200萬個ETH並將其送給VC時，加密貨幣的原則在哪裏？\n送給風險投資公司和內部人士的時候，加密貨幣的原則在哪裏？\n\n他所創造的屎幣文化開始......",
      "title": "維塔利克因爲薩爾瓦多的採用而對比特幣大打出手，並像屁民一樣散佈FUD，說明他只是一個僞君子。"
    }
  ]
}