{
  "author": "Tiltnes",
  "the_new_excerpt": "Gas prices are falling (finally), but still unbearable fees to waiting for 2.0\nand Rollups like Optimism in June.\n\nSo I decided to finally try Polygon (Matic rebrand) after a shill in the\ncomments... and WTF it works flawlessly! It even has a Dex Quickswap (Totally\nUniswap clone) and Aave + Curve…",
  "original_created_utc": 1619295034,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ガソリン価格は（ようやく）下がってきたが、まだ2.0を待つには耐えられない料金だ\nと6月のオプティミズムのようなロールアップ。\n\nそこで、コメント欄に書かれていたポリゴン（Maticのリブランド）をついに試してみることにしました。\nそしてWTFは完璧に動作しています。さらにはDex Quickswap (Totally\nUniswapクローン）とAave＋Curveまで搭載しています...。",
      "title": "イーサリアム用のMatic/Polygon L2を試してみたところ...。なぜもっと早く誰も教えてくれなかったんだ！？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "汽油价格正在下降（最后），但仍然难以忍受的费用，以等待2.0\n和6月份的乐观主义这样的卷积。\n\n所以我决定最终尝试一下Polygon（Matic的改名），因为在评论里有一个骗子。\n评论......和WTF它工作得完美无缺! 它甚至有一个Dex Quickswap（完全是\nUniswap的克隆）和Aave + Curve...",
      "title": "我刚刚尝试了以太坊的Matic/Polygon L2... 为什么没有人早些告诉我这个？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "汽油價格正在下降（最後），但仍然難以忍受的費用，以等待2.0\n和6月份的樂觀主義這樣的卷積。\n\n所以我決定最終嘗試一下Polygon（Matic的改名），因爲在評論裏有一個騙子。\n評論......和WTF它工作得完美無缺! 它甚至有一個Dex Quickswap（完全是\nUniswap的克隆）和Aave + Curve...",
      "title": "我剛剛嘗試了以太坊的Matic/Polygon L2... 爲什麼沒有人早些告訴我這個？"
    }
  ],
  "title": "I just tried Matic/Polygon L2 for Ethereum... WHY did no one tell me about this sooner?!",
  "created_utc": 1619322194,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Gas prices are falling (finally), but still unbearable fees to waiting for 2.0 and Rollups like Optimism in June.</p>\n\n<p>So I decided to finally try Polygon (Matic rebrand) after a shill in the comments... and WTF it works flawlessly! It even has a Dex <strong>Quickswap</strong> (Totally Uniswap clone) and <strong>Aave</strong> + <strong>Curve</strong> DEFI integration.</p>\n\n<p>With todays gas fees it costed like 10 dollar to send all my Eth over there (Or back!), and you can use your Ethereum and ERC-20 tokens with Meta Mask on Polygons Layer 2 with constant transaction speeds at <strong>2 f*cking seconds</strong> gas fees <strong>LESS than 0,1 cent</strong> like on mainnet and smart contracts!\nI could&#39;ve saved <strong>houndres of dollars</strong> spendt on 1inch/Uniswap fees the last months. FML.</p>\n\n<p>Why is no one talking about this?! The future of fast and almost free Eth transfers and swaps are here, and most (people like myself) up until today don&#39;t know, and cry about gas fees. Don&#39;t believe me? Try for yourself!</p>\n\n<p>Why is this? Is it something about it being scary cause its new? Too &quot;complicated&quot; to do the 1-time transfer on bridge? Or is it unsafe? Whats the catch?</p>\n\n<p><em>EDIT</em>: Just learned from comments <strong>Opensea</strong> and <strong>Sushiswap</strong> already integrated Polygon. There also is Cometh swap, AND there is a <strong>working NTF minter</strong>. Yup, knock yourselves out.</p>\n</div><!-- SC_ON -->",
  "score": 301,
  "permalink": "/r/CryptoCurrency/comments/mxrw09/i_just_tried_maticpolygon_l2_for_ethereum_why_did/",
  "subreddit": "CryptoCurrency",
  "id": "mxrw09",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776208822
}