{
  "author": "Crakalak",
  "original_created_utc": 1636340005,
  "title": "It’s almost Monday… what are you looking forward to most this week?",
  "created_utc": 1636353031,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As Sunday comes to an end another work day begins for most. I know while many of us are aiming to break out from the 9-5 with the help of crypto, while we wait, what are you looking forward to most this week?</p>\n\n<p>Me personally, I’m excited for the Cronos Mainnet launch tomorrow.\nIt also looks like BTC and ETH may hit their all time highs this week.</p>\n\n<p>Despite the dread of yet another work week I see it as another week closer to financial freedom, it’s only a matter of time for the patient. HODL the line!</p>\n</div><!-- SC_ON -->",
  "score": 185,
  "permalink": "/r/CryptoCurrency/comments/qp4enw/its_almost_monday_what_are_you_looking_forward_to/",
  "subreddit": "CryptoCurrency",
  "id": "qp4enw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As Sunday comes to an end another work day begins for most. I know while many of\nus are aiming to break out from the 9-5 with the help of crypto, while we wait,\nwhat are you looking forward to most this week?\n\nMe personally, I’m excited for the Cronos Mainnet launch tomorrow. It also looks\nlike BTC…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "日曜日が終われば、多くの人にとっては次の仕事が始まる。私たちの多くは\n暗号の力を借りて9時から5時までの仕事から抜け出そうとしていますが、それを待っています。\n今週、最も楽しみにしていることは何ですか？\n\n私個人としては、明日のCronosメインネットの立ち上げに期待しています。また、これは\nBTCのように...",
      "title": "もうすぐ月曜日ですが、今週の一番の楽しみは何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "随着周日的结束，对大多数人来说，另一个工作日开始了。我知道，虽然我们中的许多人\n我们的目标是在加密货币的帮助下摆脱朝九晚五的生活，而我们在等待。\n本周你最期待的是什么？\n\n就我个人而言，我对明天Cronos主网的启动感到兴奋。它也看起来\n像BTC...",
      "title": "快到星期一了......你这周最期待的是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "隨着週日的結束，對大多數人來說，另一個工作日開始了。我知道，雖然我們中的許多人\n我們的目標是在加密貨幣的幫助下襬脫朝九晚五的生活，而我們在等待。\n本週你最期待的是什麼？\n\n就我個人而言，我對明天Cronos主網的啓動感到興奮。它也看起來\n像BTC...",
      "title": "快到星期一了......你這周最期待的是什麼？"
    }
  ]
}