{
  "author": "GodlordHerus",
  "original_created_utc": 1634791536,
  "title": "Its time to ignore this Sub and YouTube",
  "created_utc": 1634815845,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We are starting to enter the euphoria stage of a bull run. Crazy predictions are taken seriously, Youtubers become geniuses for randomly picking coins in a market where everything is pumping. Twitter TA gurus drawing meme lines on charts to millions of followers </p>\n\n<p>It&#39;s been a good couple of months but this sub and social media  will only muddy when I should pull the trigger </p>\n\n<p>My bags are packed and yesterday was a good day</p>\n\n<p>See you all at the inevitable turn to red. When the great bear awakes from his slumber </p>\n\n<p>But for now let the bull run free and eat the green grass</p>\n</div><!-- SC_ON -->",
  "score": 223,
  "permalink": "/r/CryptoCurrency/comments/qcjt0i/its_time_to_ignore_this_sub_and_youtube/",
  "subreddit": "CryptoCurrency",
  "id": "qcjt0i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "We are starting to enter the euphoria stage of a bull run. Crazy predictions are\ntaken seriously, Youtubers become geniuses for randomly picking coins in a\nmarket where everything is pumping. Twitter TA gurus drawing meme lines on\ncharts to millions of followers\n\nIt's been a good couple of months…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ブルランのユーフォリア（幸福感）の段階に入りつつある。狂ったような予測が真に受けられ\nYoutuberは、すべてがポンピングされている市場でランダムにコインを選ぶ天才になります。\nYoutuberが天才的にコインを選んでいる。ツイッターのTAの達人は、チャートにミームラインを描き\n何百万人ものフォロワーに向けてチャートにミームラインを描く\n\nこの2ヶ月間、いいことばかりだった...。",
      "title": "このSubとYouTubeを無視する時が来ました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们开始进入牛市运行的欣喜阶段。疯狂的预测被\n认真对待，Youtubers成为天才，在一个所有东西都在上涨的市场中随机挑选硬币。\n市场中随机挑选硬币的天才，一切都在抽水。推特上的TA大师们在图表上画出备忘线\n图表上画出备忘线给数以百万计的追随者\n\n这几个月来的情况不错...",
      "title": "是时候无视这个Sub和YouTube了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們開始進入牛市運行的欣喜階段。瘋狂的預測被\n認真對待，Youtubers成爲天才，在一個所有東西都在上漲的市場中隨機挑選硬幣。\n市場中隨機挑選硬幣的天才，一切都在抽水。推特上的TA大師們在圖表上畫出備忘線\n圖表上畫出備忘線給數以百萬計的追隨者\n\n這幾個月來的情況不錯...",
      "title": "是時候無視這個Sub和YouTube了"
    }
  ]
}