{
  "author": "GhostOfMcAfee",
  "original_created_utc": 1652471375,
  "title": "The ALGOrun",
  "created_utc": 1652493530,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The ALGOrun - FAQ, Responses, Ideas&lt;/p&gt;\n\n&lt;p&gt;TL;DR: Take your ALGO off exchanges unless you are actively trading. June 5 is the target &amp;quot;date&amp;quot; of the ALGOrun, but really this an ongoing affair. This is good for decentralization of the ALGO chain.&lt;/p&gt;\n\n&lt;p&gt;Not long ago, our brethren in Monero staged the Monerun. It was a fantastic move and we applaud you. Also, we are saddened by the news that you all collectively took a boat trip to celebrate and then all lost your keys in a tragic accident. Truly heartbreaking.&lt;/p&gt;\n\n&lt;p&gt;Anyway, like the folks at XMR, we at ALGO are also concerned about fractional reserve trading. But, even more pressing is the issue of exchanges having too much control in our governance program. They pledge your ALGO, then vote them how they see fit. They pocket the rewards and pass scraps on to you. We are fighting back and taking control.&lt;/p&gt;\n\n&lt;p&gt;So far, the effort at an ALGOrun has been confined to our little community over at &lt;a href=\"/r/algorand\"&gt;r/algorand&lt;/a&gt;. In that time, we have nonetheless managed to sack two of Binance&amp;#39;s cold wallets and make them forfeit a total of over 154M ALGO from Governance.&lt;/p&gt;\n\n&lt;p&gt;It is time to spread the word: #weALGOoffexchanges.&lt;/p&gt;\n\n&lt;p&gt;What we are trying to accomplish is a run on the exchanges that forces them to forfeit their governance rewards (return more power to holders) or buy OTC to defend their governance position. So, we are now officially on an ALGOrun. From now until &lt;strong&gt;June 5th&lt;/strong&gt;, we are pressing all our folks to go off exchanges unless they are actively trading. We have made a stockpile of memes and educational material. We will force every damn exchange we can to quit governance and return control to the Algonauts.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;So...What is the idea here?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Answer: We try to push exchanges out of governance and/or buy ALGO over the counter (OTC) to cover their position. At least 500M Algos in governance belong to exchanges. That means exchanges are voting on governance proposals how they see fit and pocketing the rewards. People don&amp;#39;t realize they can get the same or WAY better rewards on a private wallet that is pledged in governance and actually be able to make their own choices on how Algorand goes forward.. The exchanges have wagered that many Algonauts will remain ignorant of this fact. It is time to we expose this.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Wait, are you saying this is like a short squeeze?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Yes. Wallets that pledge and then vote in governance get rewards. Exchanges are using your Algo to do this. They are voting for you (and it may not be a vote that is in your interest) and then pocketing the rewards. They pass on only a portion of it to you. If we withdraw from the exchanges, they will be faced with two options: (1) forfeit governance rewards, which can be millions of dollars; or (2) go buy ALGOs over the counter and drive the price up.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;But can&amp;#39;t the exchanges just freeze withdraws?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Yes they can, and many already have. But just keep up with it and withdraw. In the past two days we&amp;#39;ve sacked 154M ALGO from Binance. They had to halt withdrawals while they recharged their hot wallet. First they forfeited 64M Algos from governance. Then they reopened withdrawals. And then, they had to forfeit another 94M.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Why June 5th?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Anniversary of the launch of Algorand main net!&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Won&amp;#39;t people just front run June 5th? Should I pull my funds sooner than that?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Sure. They might. And, you don&amp;#39;t need to wait to withdraw. This is an ongoing movement. June 5 is just an arbitrary day for peak activity if possible. And this isn&amp;#39;t just about price. It&amp;#39;s about decentralization and ensuring people have the power to vote their own ALGO and receive all the rewards for it, to participate in the ecosystem, etc.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Can&amp;#39;t exchanges just frontrun this event too? Stock up on ALGO to avoid forfeiting governance?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Sure. If they want to buy ALGO and drive price up, more power to them. The point is to either make them forfeit governance or to make them buy more ALGO. If we are relentless enough, we can make them do both.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Don&amp;#39;t exchanges do this with other coins too?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Yes. I have no idea if those other coins have the same economic incentives for exchanges to try to defend their cold wallet positions. But, if you want to do your own &amp;quot;[coin]Run&amp;quot;, you can feel free to do so. I&amp;#39;ll promote that too. We have made a ton of content that you can crib from. This isn&amp;#39;t a coin vs coin battle. This is a people vs institutions battle. We are all on the same side here.&lt;/p&gt;\n\n&lt;p&gt;If you are interested in contributing to content or seeing the content we have made so far, we have posted a lot of content over at &lt;a href=\"/r/algorand\"&gt;r/algorand&lt;/a&gt;. I refrain from posting it here for fear of  automod. &lt;/p&gt;\n\n&lt;p&gt;From henceforth, the ALGOrun is officially on.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 306,
  "permalink": "/r/CryptoCurrency/comments/uozt3h/the_algorun/",
  "subreddit": "CryptoCurrency",
  "id": "uozt3h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The ALGOrun - FAQ, Responses, Ideas\n\nTL;DR: Take your ALGO off exchanges unless you are actively trading. June 5 is\nthe target \"date\" of the ALGOrun, but really this an ongoing affair. This is\ngood for decentralization of the ALGO chain.\n\nNot long ago, our brethren in Monero staged the Monerun. It…",
  "localize": [
    {
      "locale": "ja",
      "title": "アルゴラン",
      "the_new_excerpt": "ALGOrun - よくある質問、回答、アイデア\n\nTL;DR: ALGOを積極的に取引しない限り、取引所から持ち出しましょう。6月5日は\nALGOrunのターゲット「日付」ですが、実際にはこれは継続的な問題です。これは\nALGOチェーンの非中央集権化には良いことです。\n\n少し前に、Moneroの同胞がMonerunを演出しました。それは..."
    },
    {
      "locale": "zh",
      "the_new_excerpt": "ALGOrun - 常见问题、回应、想法\n\nTL;DR: 除非你积极交易，否则请将你的ALGO带离交易所。6月5日是\n是ALGO运行的目标 \"日期\"，但实际上这是一个持续的事件。这\n对ALGO链的去中心化有好处。\n\n不久前，我们在Monero的兄弟们上演了Monerun。它...",
      "title": "阿尔戈伦"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "ALGOrun - 常見問題、回應、想法\n\nTL;DR: 除非你積極交易，否則請將你的ALGO帶離交易所。6月5日是\n是ALGO運行的目標 \"日期\"，但實際上這是一個持續的事件。這\n對ALGO鏈的去中心化有好處。\n\n不久前，我們在Monero的兄弟們上演了Monerun。它...",
      "title": "阿爾戈倫"
    }
  ]
}