{
  "author": "Chicky_Nuggy",
  "original_created_utc": 1632916123,
  "title": "Reminder, do put all of your savings into crypto",
  "created_utc": 1632936639,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I don&#39;t know why but people are still not putting their life savings into cryptocurrencies and crypto tokens, like dude, crypto is a risky asset, you can have huge gains from it but it is still NOT TOO RISKY to put all of your money into it!</p>\n\n<p>Remember the gains in April? This can happen anytime soon! So please put only the amount you have in your savings accounts!!!</p>\n\n<p>If you have no problem gaining 1 million dollars then fine, put a million into some token or whatever but if 1 million is all that you have,  put it all in crypto!</p>\n\n<p>I repeat, DO PUT ALL OF YOUR SAVINGS INTO CRYPTOCURRENCIES!!!</p>\n\n<p>Don&#39;t be stupid, be a smartie, come and join the &quot;I am a reasonable fat gains or nothing&quot; party!</p>\n\n<p>&#x200B;</p>\n\n<p><span class=\"md-spoiler-text\">(THIS IS OBVIOUSLY A JOKE, ANYONE NEW TO HERE OR CRYPTO DO NOT DO THIS WITH YOUR MONEY YOU WILL END UP POOR, FAT AND SINGLE)</span></p>\n</div><!-- SC_ON -->",
  "score": 180,
  "permalink": "/r/CryptoCurrency/comments/pxtp40/reminder_do_put_all_of_your_savings_into_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "pxtp40",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I don't know why but people are still not putting their life savings into\ncryptocurrencies and crypto tokens, like dude, crypto is a risky asset, you can\nhave huge gains from it but it is still NOT TOO RISKY to put all of your money\ninto it!\n\nRemember the gains in April? This can happen anytime…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "理由はわからないが、人々はまだ人生の貯蓄を投入していない\n暗号はリスクの高い資産であり、そこから大きな利益を得ることもできます。\n莫大な利益を得ることができますが、全財産を投入するにはまだリスクが高すぎます。\nのです。\n\n4月の利益を覚えていますか？これはいつでも起こりうることです。",
      "title": "思い出してください、貯金のすべてを暗号化してください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不知道为什么，但人们仍然没有把他们的毕生积蓄投入到\n加密货币和加密代币，就像老兄一样，加密货币是一种风险资产，你可以从中获得巨大的收益，但把你所有的钱都投入其中，风险还是很大的。\n你可以从中获得巨大的收益，但把你所有的钱都投入其中，风险还是不大。\n的风险!\n\n还记得4月份的收益吗？这随时可能发生...",
      "title": "提醒您，请将您的所有储蓄存入加密货币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不知道爲什麼，但人們仍然沒有把他們的畢生積蓄投入到\n加密貨幣和加密代幣，就像老兄一樣，加密貨幣是一種風險資產，你可以從中獲得巨大的收益，但把你所有的錢都投入其中，風險還是很大的。\n你可以從中獲得巨大的收益，但把你所有的錢都投入其中，風險還是不大。\n的風險!\n\n還記得4月份的收益嗎？這隨時可能發生...",
      "title": "提醒您，請將您的所有儲蓄存入加密貨幣"
    }
  ]
}