{
  "author": "RoPrime12",
  "the_new_excerpt": "In 2010 legendary investor and founder of the Baupost Group Seth Klarman\ndescribed in his annual letter 20 lessons from the financial crisis which were\neither never learned or else immediately forgotten by most market participants.\nWith him at the helm the Baupost Group has averaged around 18% and…",
  "original_created_utc": 1613118225,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "2010年，传奇投资人、Baupost集团创始人塞斯-克拉曼(Seth Klarman)\n在他的年度信中描述了从金融危机中得到的20个教训，这些教训是\n要么从不学习，要么立即被大多数市场参与者遗忘。\n在他的掌舵下，Baupost集团平均约18%和...",
      "title": "2008年被遗忘的教训，在今天更有意义"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "2010年，傳奇投資人、Baupost集團創始人塞斯-克拉曼(Seth Klarman)\n在他的年度信中描述了從金融危機中得到的20個教訓，這些教訓是\n要麼從不學習，要麼立即被大多數市場參與者遺忘。\n在他的掌舵下，Baupost集團平均約18%和...",
      "title": "2008年被遺忘的教訓，在今天更有意義"
    }
  ],
  "title": "Forgotten lessons of 2008 that are even more relevant today",
  "created_utc": 1613140685,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In 2010 legendary investor and founder of the Baupost Group Seth Klarman described in his annual letter 20 lessons from the financial crisis which were either never learned or else immediately forgotten by most market participants. With him at the helm the Baupost Group has averaged around 18% and that since 1982 -  a spectacular return. Some of these lessons are even more relevant today. I took the most important ones and updated it for the current market.</p>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>Things that have never happened before are bound to occur with some regularity. You must always be prepared for the unexpected, including sudden, sharp downward swings in markets and the economy. Whatever adverse scenario you can contemplate, reality can be far worse.</p>\n</blockquote>\n\n<p>Nassim Taleb calls these “Black Swans”:  an event that comes as a surprise, has a major effect, and is often inappropriately rationalized after the fact with the benefit of<a href=\"https://en.wikipedia.org/wiki/Hindsight\"> </a>hindsight. Examples would be the Internet, the personal Computer, World War I, the dissolution of the Soviet Union, 9/11 and of course the Coronavirus.</p>\n\n<p>These all changed countries or continents for decades.  With shutdown still in place in several countries in the world the economy’s output is much lower than it was at the end of 2019 -  yet we reached an all time high in the stock market. New Mutations are evolving and there might be a sharp downturn in the future or there might not. History taught us that market crashes are much more common than we think. So it is important to be diversified in different asset classes, industries and countries to be protected against those changes.</p>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>When excesses such as lax lending standards become widespread and persist for some time, people are lulled into a false sense of security, creating an even more dangerous situation. In some cases, excesses migrate beyond regional or national borders, raising the ante for investors and governments. These excesses will eventually end, triggering a crisis at least in proportion to the degree of the excesses. Correlations between asset classes may be surprisingly high when leverage rapidly unwinds.</p>\n</blockquote>\n\n<p>With interest rates in Europe being partly negative and extremely low in the US, people are lulled into borrowing to get onto the Party of rising stocks, and that on margin. Margin on Portfolio reached an all time high in December of 2020 and the number of retail traders thanks to Robin Hood exploded even with the recent controversy. In addition - central banks in Europe and the US are printing money like there is no tomorrow. These money policies have driven stocks to a new high. And the excess of government debt mirrored that progression. Action always have consequences - but however harsh they may be one thing is certain: If the current price is higher, the returns won’t be as great in the future.</p>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>Nowhere does it say that investors should strive to make every last dollar of potential profit; consideration of risk must never take a backseat to return. Conservative positioning entering a crisis is crucial: it enables one to maintain long-term oriented, clear thinking, and to focus on new opportunities while others are distracted or even forced to sell. Portfolio hedges must be in place before a crisis hits. One cannot reliably or affordably increase or replace hedges that are rolling off during a financial crisis.</p>\n</blockquote>\n\n<p>We all chase profits, that is just how it is. However conservative positioning and a long-term oriented perspective is crucial. Most people in 2000 thought they would buy the dip when their favourite stocks started to decline, however the decline didn’t stop. The Nasdaq posted a loss of 77%, which would take 15 years to regain the dotcom bubble. During the financial crisis many couldn’t sell their stock because there were no buyers - even retail investors that thought they could get out couldn’t.</p>\n\n<p>During it Janus Funds were similar to ARK today. Investing in modern technology companies and industry they were one of the top cutting edge technologies. Janus were lauded as great money managers but the end of the bubble resulted in brutal loses. Cathie Wood is one of the smartest investors today, but one has to keep in mind the inherent risk that comes with her investment strategy.</p>\n\n<p>Similarly we saw extreme loses in GME. Chasing after returns purely on performance will not result in great results.</p>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>Risk is not inherent in an investment; it is always relative to the price paid. Uncertainty is not the same as risk. Indeed, when great uncertainty – such as in the fall of 2008 – drives securities prices to especially low levels, they often become less risky investments.</p>\n</blockquote>\n\n<p>This is the quintessential art of investing. Your returns will entirely depend on what price you paid. Microsoft was a great company, but buying it during the dotcom bubble would leave you 15 years with no returns and several other well known companies like Cisco or Intel never reached their dot-com peak. Your returns are entirely dependent on the price you pay and so is the risk factor.</p>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>Do not trust financial market risk models. Reality is always too complex to be accurately modeled. Attention to risk must be a 24/7/365 obsession, with people – not computers – assessing and reassessing the risk environment in real time. Despite the predilection of some analysts to model the financial markets using sophisticated mathematics, the markets are governed by behavioral science, not physical science.</p>\n</blockquote>\n\n<p>Because of this behavior we see certain securities being extremely highly valued like Zoom at the moment and certain sectors being very depressed like oil until recently. Yet oil is seen as extremely risky, even though the projected use of oil will increase in the next 10 years. That means that you can find bargains all the time. Those bargains are declared risky -  while the overvalued stocks are declared safe. Microsoft after the dotcom bubble only recovered in 2016. 15 years of no gains at all -  yet now Microsoft is treated like a company that will be a great stock forever. It is a great company, but the same was thought about companies like Polaroid or Kodak - we saw how it turned out.</p>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>Do not accept principal risk while investing short-term cash: the greedy effort to earn a few extra basis points of yield inevitably leads to the incurrence of greater risk, which increases the likelihood of losses and severe illiquidity at precisely the moment when cash is needed to cover expenses, to meet commitments, or to make compelling long-term investments.</p>\n</blockquote>\n\n<p>This can be highly dangerous and I see it all the time here on reddit. Someone wants to use the money in 3-5 years to buy a house, yet instead of proposing a portfolio that is safe and diversified in several asset classes, most propose a stock only portfolio and sometimes even sector or ARK ETFs. Research has shown that a stock only portfolio will beat pretty much every other asset allocation -  that is over the long term. Due to the ups and downs of the market it doesn’t guarantee returns in 3-5 years or even worse can lead to loses. From 1929-1954,1973-1982 and from 2000-2013 the S&amp;P 500 has shown long stretches of no absolute return. Investing before a correction that you cannot foresee would result in either big loses or in the inability to purchase that house -  often both. So be conservative when you need the money.</p>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>The latest trade of a security creates a dangerous illusion that its market price approximates its true value. This mirage is especially dangerous during periods of market exuberance. The concept of &quot;private market value&quot; as an anchor to the proper valuation of a business can also be greatly skewed during ebullient times and should always be considered with a healthy degree of skepticism.</p>\n</blockquote>\n\n<p>This is especially true today. Many stocks are currently at outrageous prices. I don’t talk about the FANGMAN stocks -  these have great growth and while still being historically overvalued not outrageously so. Several EV/Green/Biotech/Weed/Technology stocks are seen as the next big Google without decent cash flows and while competing in the same space.</p>\n\n<p>This is especially true for unprofitable companies at the moment. According to Joel Greenblatt:  If you bought every company that lost money in 2019 that had a market cap over $1 billion, and so they’re about 261 companies, you’ll be up 85 percent so far until today. Something like that won’t be sustainable.Looking at the fundamentals behind the business often makes it clear how unreasonable some of these numbers are - and what returns should be expected of them (often negative)</p>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>You must buy on the way down. There is far more volume on the way down than on the way back up, and far less competition among buyers. It is almost always better to be too early than too late, but you must be prepared for price markdowns on what you buy.</p>\n</blockquote>\n\n<p>We saw that during the financial crisis and also again in 2020. Those that bought on the way down were generously rewarded. You never know when the bottom will hit especially since everyone will run around in panic like a beheaded henn. Researching the fundamentals of a company one can score great businesses for cheap. However they might go down a bit in the short term due to market panic.</p>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>Financial innovation can be highly dangerous, though almost no one will tell you this. New financial products are typically created for sunny days and are almost never stress-tested for stormy weather. Securitization is an area that almost perfectly fits this description; markets for securitized assets such as subprime mortgages completely collapsed in 2008 and have not fully recovered. Ironically, the government is eager to restore the securitization markets back to their pre-collapse stature.</p>\n</blockquote>\n\n<p>As SPACs and Bitcoin dominate the current market this warning is very important. SPACs and the companies behind them haven’t had the greatest return over the long term. With the explosion of SPACs going public, chances are high that those financial products can be very dangerous. Add the risk that SPAC managers often get big compensation packages and try to hide information to increase the price (DOJ Investigation from Clover), these investments should be taken with the utmost caution. Not only that but they also compete in the same space.</p>\n\n<p>The same applies to bitcoin. While I believe that cryptocurrencies will have a bright future, they have yet to be tested during prolonged market downturn where the market was negative not just a few week but several months or even years. No one know what the price will be then and some investors might wake up to a bad surprise. It is important to know these risks.</p>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>Ratings agencies are highly conflicted, unimaginative dupes. They are blissfully unaware of adverse selection and moral hazard. Investors should never trust them.</p>\n</blockquote>\n\n<p>That what makes short seller research so important. While there are a lot of crocks in the financial market (both on the long and the short side), these people often find what the rating agencies or investment banks ignore. If you invest into a company and there is a short report don’t dismiss it - often they include information that was previously overlooked.</p>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>Be sure that you are well compensated for illiquidity – especially illiquidity without control – because it can create particularly high opportunity costs.</p>\n</blockquote>\n\n<p>The OTC market absolutely exploded in 2020. Many of these are highly illiquid. Be prepared for the risk.</p>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>Beware leverage in all its forms. Borrowers – individual, corporate, or government – should always match fund their liabilities against the duration of their assets. Borrowers must always remember that capital markets can be extremely fickle, and that it is never safe to assume a maturing loan can be rolled over. Even if you are unleveraged, the leverage employed by others can drive dramatic price and valuation swings; sudden unavailability of leverage in the economy may trigger an economic downturn.</p>\n</blockquote>\n\n<p>Everyone takes debt at the moment. It is so cheap that many companies use debt to do buybacks or otherwise increase their price. Other people trade on margin and governments don&#39;t seem to care about debt. That can be highly dangerous. No one can control interests rates over the long run and bankruptcy is the most surefire way to delete any investment returns. Peter Lynch said: “If you have no debt it is very hard to go bankrupt”. While businesses with little or no debt might not rise to the same degree, they will reduce the chance of a wipeout significantly.</p>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>When a government official says a problem has been &quot;contained,&quot; pay no attention.</p>\n</blockquote>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>The government – the ultimate short-term-oriented player – cannot withstand much pain in the economy or the financial markets. Bailouts and rescues are likely to occur, though not with sufficient predictability for investors to comfortably take advantage. The government will take enormous risks in such interventions, especially if the expenses can be conveniently deferred to the future. Some of the price-tag is in the form of back- stops and guarantees, whose cost is almost impossible to determine.</p>\n</blockquote>\n\n<p>We saw that in March the Fed stepped in and bailed out the market. A decrease in interest rates and intense money printing. However the question is: How long can it continue and what will happen to those expenses in the future? All action has consequences and we saw that some of them can end quite bad.</p>\n\n<p>Seth Klarman also added some false lessons, that are relevant without commentary.</p>\n\n<p><strong>False Lessons</strong></p>\n\n<ol>\n<li>There are no long-term lessons – ever.</li>\n<li>Bad things happen, but really bad things do not. Do buy the dips, especially the lowest quality securities when they come under pressure, because declines will quickly be</li>\n<li>There is no amount of bad news that the markets cannot see past.</li>\n<li>If you’ve just stared into the abyss, quickly forget it: the lessons of history can only hold you back.</li>\n<li>Excess capacity in people, machines, or property will be quickly absorbed.</li>\n<li>Markets need not be in sync with one another. Simultaneously, the bond market can be priced for sustained tough times, the equity market for a strong recovery, and gold for high inflation. Such an apparent disconnect is indefinitely sustainable.</li>\n<li>In a crisis, stocks of financial companies are great investments, because the tide is bound to turn. Massive losses on bad loans and soured investments are irrelevant to value; improving trends and future prospects are what matter, regardless of whether profits will have to be used to cover loan losses and equity shortfalls for years to come.</li>\n<li>The government can reasonably rely on debt ratings when it forms programs to lend money to buyers of otherwise unattractive debt instruments.</li>\n<li>The government can indefinitely control both short-term and long-term interest rates.</li>\n<li>The government can always rescue the markets or interfere with contract law whenever it deems convenient with little or no apparent cost. (Investors believe this now and, worse still, the government believes it as well. We are probably doomed to a lasting legacy of government tampering with financial markets and the economy, which is likely to create the mother of all moral hazards. The government is blissfully unaware of the wisdom of Friedrich Hayek: “The curious task of economics is to demonstrate to men how little they really know about what they imagine they can design.”)</li>\n</ol>\n\n<p>&#x200B;</p>\n\n<p>Hope you enjoyed my little writeup. Feel free to post any questions!</p>\n</div><!-- SC_ON -->",
  "score": 2265,
  "permalink": "/r/investing/comments/li6vyf/forgotten_lessons_of_2008_that_are_even_more/",
  "subreddit": "investing",
  "id": "li6vyf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728621128
}