{
  "author": "erjo5055",
  "original_created_utc": 1641832176,
  "title": "Bull markets make you money, Bear markets make you rich",
  "created_utc": 1641857475,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;While everyone enjoys bull markets, green candles and the weekly increasing net worth as it pads their ego, bull markets aren&amp;#39;t where you get rich. Bear markets are the rare opportunity for wealth transfers, and are where crypto millionares are made. If you loaded up on $90 ETH and $4K BTC during the March 2020 dip, or either coin from 2019 til then, you&amp;#39;d still be up a TON. &lt;/p&gt;\n\n&lt;p&gt;Buying $40K BTC to sell at $60K during a bull market really isn&amp;#39;t going to change your life. Buying during the fear, panic and capitulation is. &lt;/p&gt;\n\n&lt;p&gt;I know its hard, but I&amp;#39;d urge you to be calm and excited for a bear market. I doubt we will see an 80-90% dip off ATH, but I HOPE we do. I want to dispose of USD shitcoin and load up on limited supply, lower inflation coins like BTC/ETH, and I have been during this year. But sales and discounts allow you to 10x instead of 2x. &lt;/p&gt;\n\n&lt;p&gt;The only reason you should have fear, is if you need this money to pay bills in the next few months. But if you hodl for the long term, you should be very happy that we may have another wealth transfer market on the horizon; transferring wealth from those who can&amp;#39;t afford to wait to those who can. &lt;/p&gt;\n\n&lt;p&gt;Good luck.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 323,
  "permalink": "/r/CryptoCurrency/comments/s0nzhn/bull_markets_make_you_money_bear_markets_make_you/",
  "subreddit": "CryptoCurrency",
  "id": "s0nzhn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "While everyone enjoys bull markets, green candles and the weekly increasing net\nworth as it pads their ego, bull markets aren't where you get rich. Bear markets\nare the rare opportunity for wealth transfers, and are where crypto millionares\nare made. If you loaded up on $90 ETH and $4K BTC during…"
}