{
  "author": "Visible-Ad743",
  "original_created_utc": 1659821100,
  "title": "Ethereum merge is going to be the game changer we have been waiting for.",
  "created_utc": 1659844517,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The merge is huge guys. At this point if you are not convinced of what an enormous event this will be for crypto and all of us who believe in the Ethereum project all I can say is be ready to watch this thing take off. It won&amp;#39;t be over night although the media will praise this one of the biggest technological and environmental upgrades seen to date. The fact these guys plan to merge at any given time without stopping the chain is truly amazing. The price may not be indicative of what will happen right away but as Ethereum after merge continues its road map and executes it to perfection you will see more and more people and institutions get on board. There is simply too much money to be made and too many goodies to play with like DEFI, NFT&amp;#39;s or ENS domains plus now we are almost all of us on a layer 2. They keep coming and its not stopping. Once all exchanges participate and on board clients to L2&amp;#39;s the game will have changed forever.&lt;/p&gt;\n\n&lt;p&gt;In my opinion Ethereum is going to lead the pack of crypto moving forward. I won&amp;#39;t talk about flippening or stuff like that because simply who cares. The tech and decentralization speaks for itself. The world&amp;#39;s computer is here to stay and not going anywhere. What I am most excited about is that Ethereum is going to take center stage soon and will be finally acknowledged as a wonderful decentralized technology that welcomes all humans and all institutions to join, build and play. Its teh way it should be. All inclusive with no means to discriminate or shun those who don&amp;#39;t like it or agree with it. You know who you are!&lt;/p&gt;\n\n&lt;p&gt;Peace. Merge incoming soon. Be ready!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 326,
  "permalink": "/r/CryptoCurrency/comments/whyo67/ethereum_merge_is_going_to_be_the_game_changer_we/",
  "subreddit": "CryptoCurrency",
  "id": "whyo67",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The merge is huge guys. At this point if you are not convinced of what an\nenormous event this will be for crypto and all of us who believe in the Ethereum\nproject all I can say is be ready to watch this thing take off. It won't be over\nnight although the media will praise this one of the biggest…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "合併は巨大なものだ この時点で、もしあなたが、この合併がいかに巨大なイベントであるかを理解していなければ\n暗号とイーサリアムを信じる私たち全員にとって大きな出来事です。\nこのプロジェクトが離陸するのを見るために準備することです。一晩で終わることはないでしょう。\nメディアはこれを最大級と賞賛するでしょうが、一晩で終わるものではありません...",
      "title": "イーサリアムマージは、私たちが待ち望んでいたゲームチェンジャーになりそうです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "合并是巨大的，伙计们。在这一点上，如果你不相信这是一个多么巨大的\n这对加密货币和我们所有相信以太坊的人来说将是一个巨大的事件。\n项目的人来说，我所能说的就是准备好观看这个东西的起飞。这不会是一夜之间的事\n虽然媒体会称赞这是最重要的事件之一。",
      "title": "以太坊合并将成为我们一直在等待的游戏改变者。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "合併是巨大的，夥計們。在這一點上，如果你不相信這是一個多麼巨大的\n這對加密貨幣和我們所有相信以太坊的人來說將是一個巨大的事件。\n項目的人來說，我所能說的就是準備好觀看這個東西的起飛。這不會是一夜之間的事\n雖然媒體會稱讚這是最重要的事件之一。",
      "title": "以太坊合併將成爲我們一直在等待的遊戲改變者。"
    }
  ]
}