{
  "author": "strongerthenbefore20",
  "original_created_utc": 1629554870,
  "title": "With the trend of unskilled, high-paying jobs being lost to automation continuing, what, if any types of jobs do you think will be available to unskilled workers in the future?",
  "created_utc": 1629633100,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><ul>\n<li>The biggest group of people affected by job automation are those who were unable to afford higher education for whatever reason, meaning that their best chance at finding a good job lied in the unskilled labor market, which unfortunately is where most job automation takes place.</li>\n<li>Based on what I read and seen, some people say that jobs in the solar industry may fill some of the jobs that would be lost to further automation. Some other people recommend pursuing a career in the trades or the military. </li>\n</ul>\n\n<p>Articles About Job Automation</p>\n\n<ul>\n<li><a href=\"https://time.com/5876604/machines-jobs-coronavirus/\">https://time.com/5876604/machines-jobs-coronavirus/</a></li>\n<li><a href=\"https://www.weforum.org/agenda/2020/09/short-history-jobs-automation/\">https://www.weforum.org/agenda/2020/09/short-history-jobs-automation/</a></li>\n<li><a href=\"https://willrobotstakemyjob.com/rankings\">https://willrobotstakemyjob.com/rankings</a></li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TrueAskReddit/comments/p8s2sn/with_the_trend_of_unskilled_highpaying_jobs_being/",
  "subreddit": "TrueAskReddit",
  "id": "p8s2sn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": " * The biggest group of people affected by job automation are those who were\n   unable to afford higher education for whatever reason, meaning that their\n   best chance at finding a good job lied in the unskilled labor market, which\n   unfortunately is where most job automation takes place.\n * Based…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": " * ジョブ・オートメーションの影響を受ける最大のグループは、次のような人たちです。\n   何らかの理由で高等教育を受けることができない人たち。\n   つまり、良い仕事に就くチャンスは、残念ながらほとんどが非熟練労働市場にあるということです。\n   つまり、良い仕事に就くための最良のチャンスは非熟練労働市場にあり、残念ながらそこでほとんどのジョブ・オートメーションが行われている。\n *...",
      "title": "自動化によって未熟で高収入の仕事が失われる傾向が続く中、今後、未熟な労働者が就ける仕事があるとすれば、どのようなタイプの仕事だと思いますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": " *受工作自动化影响的最大群体是那些因各种原因而无法负担高等教育的人。\n   受工作自动化影响的最大群体是那些由于某种原因无法负担高等教育的人，这意味着他们找到好工作的最佳机会在于\n   他们找到一份好工作的最好机会是在非技术性的劳动力市场上，而这正是大多数工作自动化的地方。\n   不幸的是，这正是大多数工作自动化发生的地方。\n *基于...",
      "title": "随着非技术性的高薪工作被自动化所取代的趋势继续下去，如果有的话，你认为非技术工人在未来会有什么类型的工作？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": " *受工作自動化影響的最大羣體是那些因各種原因而無法負擔高等教育的人。\n   受工作自動化影響的最大羣體是那些由於某種原因無法負擔高等教育的人，這意味着他們找到好工作的最佳機會在於\n   他們找到一份好工作的最好機會是在非技術性的勞動力市場上，而這正是大多數工作自動化的地方。\n   不幸的是，這正是大多數工作自動化發生的地方。\n *基於...",
      "title": "隨着非技術性的高薪工作被自動化所取代的趨勢繼續下去，如果有的話，你認爲非技術工人在未來會有什麼類型的工作？"
    }
  ]
}