{
  "author": "roberthonker",
  "original_created_utc": 1633099793,
  "title": "Don’t miss out on your chance to be a part of Reddit’s next big thing",
  "created_utc": 1633113941,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Recently there was a post that showed that only 3% of this sub has set up their vaults in order to receive moons. This is absolutely crazy, if you haven’t set up your vault, you should do it now! </p>\n\n<p>I have a very strong feeling that community points are going to be the next story about Reddit that gets into the news. It’s already happened with GME, Reddit just seems to attract interesting societal movements.</p>\n\n<p>I think that more social media sites are going to start rewarding their users for using them, this has been done before but never on the same scale as on Reddit.</p>\n\n<p>It can’t hurt to open your vault. I have a feeling that about 5 years from now there will be a lot of people sad that they missed out on moons / tipped 1000’s of dollars of them away.</p>\n\n<p>!remindme 5 years</p>\n</div><!-- SC_ON -->",
  "score": 240,
  "permalink": "/r/CryptoCurrency/comments/pz9l5n/dont_miss_out_on_your_chance_to_be_a_part_of/",
  "subreddit": "CryptoCurrency",
  "id": "pz9l5n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Recently there was a post that showed that only 3% of this sub has set up their\nvaults in order to receive moons. This is absolutely crazy, if you haven’t set\nup your vault, you should do it now!\n\nI have a very strong feeling that community points are going to be the next\nstory about Reddit that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、このサブの3％しか月を受信するための金庫を設置していないという記事がありました。\nムーンを受信するために保管場所を設定しているのは、このサブ これは絶対におかしいです。\nまだ設定していない方は、今すぐ設定してください。\n\n私は、コミュニティポイントがRedditの次の話題になるのではないかと強く感じています。\nRedditの次の記事は...",
      "title": "Redditの次のビッグイベントに参加するチャンスをお見逃しなく"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近，有一个帖子显示，只有3%的人建立了他们的\n储存库，以便接收月亮。这实在是太疯狂了。\n如果你还没有建立你的金库，你应该现在就去做!\n\n我有一种非常强烈的感觉，社区积分将是下一个\n关于Reddit的故事，...",
      "title": "不要错过成为Reddit下一个大事件的一部分的机会"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近，有一個帖子顯示，只有3%的人建立了他們的\n儲存庫，以便接收月亮。這實在是太瘋狂了。\n如果你還沒有建立你的金庫，你應該現在就去做!\n\n我有一種非常強烈的感覺，社區積分將是下一個\n關於Reddit的故事，...",
      "title": "不要錯過成爲Reddit下一個大事件的一部分的機會"
    }
  ]
}