{
  "author": "gorillamutila",
  "original_created_utc": 1633156499,
  "title": "You are just creating a new Elon Musk out of El Salvador's president",
  "created_utc": 1633170785,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m Latin American. Not from El Salvador, but from the same God forsaken region.</p>\n\n<p>Let me tell you this: Latin American politicians are pretty much the last people you&#39;d like to praise or emulate in any way. The general rule of thumb is that, if someone is a successful politician in Latin America, he is probably a legit scumbag. He&#39;s either involved with organized crime, or he&#39;s undemocratic to the core and only sees the state and the people as a toy to exploit at will.</p>\n\n<p>Just because this particular dude did for crypto something we were all hoping for, It does not mean that he is an enlightened and benevolent ruler. He made one apparently good decision, but we don&#39;t know how this will play out in his country, if the legislation surrounding the adoption of crypto is fair, and if the common people will truly benefit from this (and not only him and his entourage).</p>\n\n<p>It could well be that, in a couple of months from now, corruption scandals and other unpleasant surprises regarding bitcoin in El Salvador come to surface and, in turn, discourage or hinder adoption in other countries. Maybe it could spook monetary authorities elsewhere and harden existing regulations.</p>\n\n<p>So, as we all saw happen with Elon Musk, this is just a reminder not to place someone on a pedestal just because that one time he did something nice for crypto. Keep things in perspective, always.</p>\n\n<p>Peace.</p>\n</div><!-- SC_ON -->",
  "score": 239,
  "permalink": "/r/CryptoCurrency/comments/pzpxz6/you_are_just_creating_a_new_elon_musk_out_of_el/",
  "subreddit": "CryptoCurrency",
  "id": "pzpxz6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm Latin American. Not from El Salvador, but from the same God forsaken region.\n\nLet me tell you this: Latin American politicians are pretty much the last people\nyou'd like to praise or emulate in any way. The general rule of thumb is that,\nif someone is a successful politician in Latin America, he…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はラテンアメリカ人です。エルサルバドルではありませんが、同じ神に見放された地域の出身です。\n\nこれだけは言わせてください。ラテンアメリカの政治家たちは、あなたが何かを賞賛したり、見習ったりしたいと思うような人たちではありません。\n褒めたり、見習ったりしたくないものです。一般的な経験則では、次のようになります。\nもし誰かがラテンアメリカで成功した政治家であれば、彼は...",
      "title": "エルサルバドルの大統領から新たなイーロン・マスクを生み出しているだけです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是拉丁美洲人。不是来自萨尔瓦多，但来自同一个被上帝抛弃的地区。\n\n让我告诉你吧。拉美的政治家们几乎是你最不愿意看到的人\n你想以任何方式赞美或效仿的人。一般的经验法则是，。\n如果某人在拉丁美洲是一个成功的政治家，他...",
      "title": "你只是从萨尔瓦多的总统中创造了一个新的伊隆-马斯克。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是拉丁美洲人。不是來自薩爾瓦多，但來自同一個被上帝拋棄的地區。\n\n讓我告訴你吧。拉美的政治家們幾乎是你最不願意看到的人\n你想以任何方式讚美或效仿的人。一般的經驗法則是，。\n如果某人在拉丁美洲是一個成功的政治家，他...",
      "title": "你只是從薩爾瓦多的總統中創造了一個新的伊隆-馬斯克。"
    }
  ]
}