{
  "author": "ProductOfUK",
  "original_created_utc": 1657241784,
  "title": "Why did Carthage rely so heavily on foreign troops?",
  "created_utc": 1657294486,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Whilst reading a history book by Historian Adrian Goldsworthy titled &amp;quot;The Fall of Carthage&amp;quot;, he mentioned something that I found curious.&lt;/p&gt;\n\n&lt;p&gt;Carthage relied heavily upon foreign troops to make up it&amp;#39;s armies. This set me to wondering exactly how Carthage was a dominant power in the Mediterranean, what with lacking a truly reliable host of native troops through which to project their power.&lt;/p&gt;\n\n&lt;p&gt;I know of course that many nations relied quite a lot on foreign levies to put more men under arms for their respective kingdoms, but none that I personally have read about seemed to do this quite so heavily as Carthage did during the Second Punic War. &lt;/p&gt;\n\n&lt;p&gt;Why was Carthage able to keep it&amp;#39;s station as a preeminent power whilst lacking a native professional army of their own? &lt;/p&gt;\n\n&lt;p&gt;Thank you!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/vtxzl0/why_did_carthage_rely_so_heavily_on_foreign_troops/",
  "subreddit": "AskHistorians",
  "id": "vtxzl0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Whilst reading a history book by Historian Adrian Goldsworthy titled \"The Fall\nof Carthage\", he mentioned something that I found curious.\n\nCarthage relied heavily upon foreign troops to make up it's armies. This set me\nto wondering exactly how Carthage was a dominant power in the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "歴史家エイドリアン・ゴールズワージが書いた「カルタゴの滅亡」という歴史書を読んでいて\nカルタゴの滅亡 \"という歴史書を読んでいて、不思議に思ったことがある。\n\nカルタゴは軍隊を構成するために外国の軍隊に大きく依存していたのだ。そのため、私は\nカルタゴがどのように支配的な国であったのか、不思議に思いました。",
      "title": "カルタゴはなぜ外国人部隊に大きく依存したのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在阅读历史学家阿德里安-戈德斯沃西（Adrian Goldsworthy）的历史著作《迦太基的衰落》（The Fall\n迦太基的衰落\"，他提到了一些我觉得很好奇的事情。\n\n迦太基在很大程度上依赖外国军队来组成它的军队。这让我\n想知道迦太基究竟是如何在当时成为一个主导力量的。",
      "title": "为什么迦太基如此依赖外国军队？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在閱讀歷史學家阿德里安-戈德斯沃西（Adrian Goldsworthy）的歷史著作《迦太基的衰落》（The Fall\n迦太基的衰落\"，他提到了一些我覺得很好奇的事情。\n\n迦太基在很大程度上依賴外國軍隊來組成它的軍隊。這讓我\n想知道迦太基究竟是如何在當時成爲一個主導力量的。",
      "title": "爲什麼迦太基如此依賴外國軍隊？"
    }
  ]
}