{
  "author": "alttoby",
  "the_new_excerpt": "There's been a lot of negative sentiment thrown around with the recent market\nvolatility. Some people clearly haven't been investing for a longer period of\ntime (neither have I) and others just don't deal well with the bad days.\n\nMy advice is this: during red periods take a look at your investments…",
  "original_created_utc": 1617047728,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "近期市场上抛出的负面情绪很多\n的波动性。有些人显然没有在较长的时间内投资\n时间(我也没有)，而其他人只是不能很好地处理糟糕的日子。\n\n我的建议是：在红色时期，看看你的投资...",
      "title": "不要为红日&你的投资组合下跌而紧张。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "近期市場上拋出的負面情緒很多\n的波動性。有些人顯然沒有在較長的時間內投資\n時間(我也沒有)，而其他人只是不能很好地處理糟糕的日子。\n\n我的建議是：在紅色時期，看看你的投資...",
      "title": "不要爲紅日&你的投資組合下跌而緊張。"
    }
  ],
  "title": "Don't stress about red days & your portfolio being down.",
  "created_utc": 1617053068,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There&#39;s been a lot of negative sentiment thrown around with the recent market volatility. Some people clearly haven&#39;t been investing for a longer period of time (neither have I) and others just don&#39;t deal well with the bad days. </p>\n\n<p>My advice is this: during red periods take a look at your investments and see if anything about the company has changed since you started investing. If there is no significant change why would you sell now?</p>\n\n<p>Second, if you have cash on hand try to incrementally buy shares of your highest conviction stocks or buy those who you think have been hit hardest. </p>\n\n<p>Third, think about the overall state of your portfolio. If it is too focused on one particular section, then consider broadening out your portfolio to different ones so you mitigate risk if you are not comfortable with the current volatility of your portfolio.</p>\n\n<p>The final piece of advice is to just not stare at the graphs everday if you can&#39;t handle looking at the red candles. If you are like me and you are investing for the long-term why would you need to look at the graphs every single day?\nJust grab the stock chart of any stock for a 5 year period and look at the peaks and downturns in stock price. Some stocks lose like 30 percent from one peak before doubling in price compared to that peak and stockholders who held through that downturn eventually got rewarded for their patience. This doesn&#39;t mean that every investment you make will turn out alright in the long-term but panicking and selling at a loss just because the price went down isnt going to make u money especially if nothing about the company changed.</p>\n\n<p>Just today as I write this my portfolio is down about 3 percent while the nasdaq is only down about 0.5 percent. I am not too worried because I am investing with money I don&#39;t necessarily need right now and am investing for the long-term so temporary downturns are only opportunities to add to my highest conviction positions. The point is, if you are investing like me theres no need to panic about what is happening now. </p>\n\n<p>Anyway, I wish u all good gains in the rest of the year and don&#39;t stress about the market too much, there is more important stuff in life to worry about and we&#39;ve got time on our hands.</p>\n\n<p>Edit: </p>\n\n<p>Also, if you are relatively new to investing and want to learn more, there is alot you can learn just through reading books and practicing doing your own DD on stocks</p>\n\n<p>This post gives a pretty good starting point:</p>\n\n<p><a href=\"https://www.reddit.com/r/stocks/comments/m85sp6/list_of_books_to_read_if_you_want_to_actually/?utm_medium=android_app&amp;utm_source=share\">https://www.reddit.com/r/stocks/comments/m85sp6/list_of_books_to_read_if_you_want_to_actually/?utm_medium=android_app&amp;utm_source=share</a></p>\n</div><!-- SC_ON -->",
  "score": 973,
  "permalink": "/r/stocks/comments/mfxzyn/dont_stress_about_red_days_your_portfolio_being/",
  "subreddit": "stocks",
  "id": "mfxzyn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357142654
}