{
  "author": "sponge_hitler",
  "original_created_utc": 1646676184,
  "title": "To the people that say that ADA will rise a lot in the long term: Why?",
  "created_utc": 1646701837,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I noticed that this sub is responding to serious concerns about Cardano by calling it FUD or calling the poster out for allegedly being only into short term gains or buying the peak.&lt;/p&gt;\n\n&lt;p&gt;People are also blaming the bear market that started in November and the war that started recently as the sole reason for the dip, even though the ADA price has been falling non-stop since September.&lt;/p&gt;\n\n&lt;p&gt;So far, I have not met a single person here that made an actual argument for ADAs long term value.&lt;/p&gt;\n\n&lt;p&gt;I would like to know what’s so special about it? I get that ETH is currently unbearable and its true that Cardano has Proof-of-Stake while ETH doesn&amp;#39;t. But there are literally dozens of Proof-of-stake blockchains with working smart contracts and a blooming network of dApps.&lt;/p&gt;\n\n&lt;p&gt;Tezos, Harmony, Fantom, Juno, Algorand, Solana, BSC, Tron, Flow, Cronos, Secret Network, Oasis, Near, Klaytn, Celo, Avalanche, Moonbeam and many more are proof of stake and have tons of dApps. They all have their pros and cons, but every single one of them is much further in their development than Cardano. Some of them also seem more scalable for the long term like Harmony and Near.&lt;/p&gt;\n\n&lt;p&gt;So, what about Cardano is so promising? Why is everyone so sure that it will outperform all this other ETH competitors?&lt;/p&gt;\n\n&lt;p&gt;Inb4 all the FUD comments&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 301,
  "permalink": "/r/CryptoCurrency/comments/t8v8my/to_the_people_that_say_that_ada_will_rise_a_lot/",
  "subreddit": "CryptoCurrency",
  "id": "t8v8my",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I noticed that this sub is responding to serious concerns about Cardano by\ncalling it FUD or calling the poster out for allegedly being only into short\nterm gains or buying the peak.\n\nPeople are also blaming the bear market that started in November and the war\nthat started recently as the sole…"
}