{
  "author": "sponge_hitler",
  "original_created_utc": 1646676184,
  "title": "To the people that say that ADA will rise a lot in the long term: Why?",
  "created_utc": 1646701837,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I noticed that this sub is responding to serious concerns about Cardano by calling it FUD or calling the poster out for allegedly being only into short term gains or buying the peak.&lt;/p&gt;\n\n&lt;p&gt;People are also blaming the bear market that started in November and the war that started recently as the sole reason for the dip, even though the ADA price has been falling non-stop since September.&lt;/p&gt;\n\n&lt;p&gt;So far, I have not met a single person here that made an actual argument for ADAs long term value.&lt;/p&gt;\n\n&lt;p&gt;I would like to know what’s so special about it? I get that ETH is currently unbearable and its true that Cardano has Proof-of-Stake while ETH doesn&amp;#39;t. But there are literally dozens of Proof-of-stake blockchains with working smart contracts and a blooming network of dApps.&lt;/p&gt;\n\n&lt;p&gt;Tezos, Harmony, Fantom, Juno, Algorand, Solana, BSC, Tron, Flow, Cronos, Secret Network, Oasis, Near, Klaytn, Celo, Avalanche, Moonbeam and many more are proof of stake and have tons of dApps. They all have their pros and cons, but every single one of them is much further in their development than Cardano. Some of them also seem more scalable for the long term like Harmony and Near.&lt;/p&gt;\n\n&lt;p&gt;So, what about Cardano is so promising? Why is everyone so sure that it will outperform all this other ETH competitors?&lt;/p&gt;\n\n&lt;p&gt;Inb4 all the FUD comments&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 301,
  "permalink": "/r/CryptoCurrency/comments/t8v8my/to_the_people_that_say_that_ada_will_rise_a_lot/",
  "subreddit": "CryptoCurrency",
  "id": "t8v8my",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I noticed that this sub is responding to serious concerns about Cardano by\ncalling it FUD or calling the poster out for allegedly being only into short\nterm gains or buying the peak.\n\nPeople are also blaming the bear market that started in November and the war\nthat started recently as the sole…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブは、カルダノに関する深刻な懸念に、次のように対応していることに気づきました。\nFUDと呼んだり、投稿者が短絡的な考えしか持っていないとして罵倒したり。\nを買ったり、ピークを買ったりしています。\n\nまた、11月に始まった弱気相場や戦争も非難されています。\n最近始まった、唯一の...",
      "title": "ADAが長期的に大きく上昇すると言っている人たちへ。なぜですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我注意到，这个子网站在回应对Cardano的严重关切时，称其为FUD或指责发帖人对Cardano有偏见。\n称其为FUD，或指责发帖人所谓的只追求短期收益或买入峰值。\n短期收益或购买峰值。\n\n人们还将11月开始的熊市和最近开始的战争归咎于\n归咎于11月开始的熊市和最近开始的战争是唯一的...",
      "title": "对于那些说ADA在长期内会大量上涨的人。为什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我注意到，這個子網站在回應對Cardano的嚴重關切時，稱其爲FUD或指責發帖人對Cardano有偏見。\n稱其爲FUD，或指責發帖人所謂的只追求短期收益或買入峯值。\n短期收益或購買峯值。\n\n人們還將11月開始的熊市和最近開始的戰爭歸咎於\n歸咎於11月開始的熊市和最近開始的戰爭是唯一的...",
      "title": "對於那些說ADA在長期內會大量上漲的人。爲什麼？"
    }
  ]
}