{
  "author": "kr393kr",
  "original_created_utc": 1650350094,
  "title": "Scammer has a video of me jacking it and is threatening to send it to all my contacts",
  "created_utc": 1650374375,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I was stupid and jerked it on cam and showed my face. Now the scammer wants 400$ and is threatening to send it to all my 500 instagram followers.\nI’m fucking shaking.\nHelp&lt;/p&gt;\n\n&lt;p&gt;Edit.\nIt’s a couple of hours later. \nI’ve called my closest family and explained the situation. They are understanding. \nHe didn’t follow trough. As i deleted my instagram.\nI’m convinced he’s an indian scammer, as he called me a while later agressivly telling me to send him money or he would upload the ”jerk off scandal video”. \nHe told me to send money to western union bank and I got some contact info, i’ll be sending this including all the screenshots and yes, the video of me jacking it to the police. And I’ll see what happends.\nThank all of you for the advice&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 137,
  "permalink": "/r/NoStupidQuestions/comments/u6ylje/scammer_has_a_video_of_me_jacking_it_and_is/",
  "subreddit": "NoStupidQuestions",
  "id": "u6ylje",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "So I was stupid and jerked it on cam and showed my face. Now the scammer wants\n400$ and is threatening to send it to all my 500 instagram followers. I’m\nfucking shaking. Help\n\nEdit. It’s a couple of hours later. I’ve called my closest family and explained\nthe situation. They are understanding. He…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "だから、バカな私は、カメラで自慰行為をして、顔を見せた。今、詐欺師は\n400ドルで、私の500人のインスタグラムのフォロワー全員に送ると脅しています。僕は\nクソ震えてる。助けて\n\n編集する 数時間後です。私は親しい家族に電話し、説明しました。\nこのような状況です。彼らは理解してくれています。彼は...",
      "title": "詐欺師は私がジャックをするビデオを持ち、私の連絡先全てに送ると脅しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我很傻，在摄像头上撸了一把，还露了脸。现在这个骗子想要\n400美元，并威胁要将其发送给我的500个Instagram粉丝。我\n他妈的发抖。帮助\n\n编辑。已经过了几个小时了。我给我最亲近的家人打电话，并解释了\n的情况。他们都很理解。他...",
      "title": "骗子有一段我打劫的视频，并威胁要把它发给我所有的联系人"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我很傻，在攝像頭上擼了一把，還露了臉。現在這個騙子想要\n400美元，並威脅要將其發送給我的500個Instagram粉絲。我\n他媽的發抖。幫助\n\n編輯。已經過了幾個小時了。我給我最親近的家人打電話，並解釋了\n的情況。他們都很理解。他...",
      "title": "騙子有一段我打劫的視頻，並威脅要把它發給我所有的聯繫人"
    }
  ]
}