{
  "author": "2012Jesusdies",
  "original_created_utc": 1646631158,
  "title": "Japan's \"miraculous\" economic rise came to a screeching halt in the 90s. Was this stagnation delibarately caused by Japanese bankers to create impetus for financial reform?",
  "created_utc": 1646687199,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So, I just watched a documentary based on the book &amp;quot;Princes of the Yen&amp;quot; and it argues with many quotes from Japanese higher ups that the &amp;quot;window guidance&amp;quot; was the critical force behind Japanese economic &amp;quot;miracle&amp;quot;, in which the Bank of Japan gives quotas to banks how much they should lend and to what companies under low interest rates. The Japanese officials of the time dressed this under technical jargon and pretended it was all free-market as revealing the truth would have been politically troubling.&lt;/p&gt;\n\n&lt;p&gt;Then, Japanese bankers educated in the US under free-market principles came back to Japan and judged that the &amp;quot;window-guidance&amp;quot; was a break from free-market and is a crisis waiting to happen. So, they needed to reform it, but they argued no fundamental reforms can be undertaken without crisis. So they decided to pump up the window guidance to extreme to create a bubble. They kept pumping it and when it started bursting, they avoided doing actions which would&amp;#39;ve solved the crisis. &lt;/p&gt;\n\n&lt;p&gt;How widely accepted is this?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/t8i1pt/japans_miraculous_economic_rise_came_to_a/",
  "subreddit": "AskHistorians",
  "id": "t8i1pt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So, I just watched a documentary based on the book \"Princes of the Yen\" and it\nargues with many quotes from Japanese higher ups that the \"window guidance\" was\nthe critical force behind Japanese economic \"miracle\", in which the Bank of\nJapan gives quotas to banks how much they should lend and to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そこで、「円の王子たち」という本を基にしたドキュメンタリーを見ました。\n窓際族は、「窓際族」であることを、日本の上層部からの多くの引用をもとに論証しています。\n日本経済の「奇跡」の決定的な原動力となったのは、日銀であった。\n日本が銀行に対して、どれだけ貸し出すべきかというノルマを与え、...",
      "title": "日本の「奇跡的な」経済成長は、90年代で急停止した。この停滞は、日本の銀行家が金融改革のきっかけを作るために意図的に引き起こしたものなのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以，我刚刚看了一部根据《日元王子》一书改编的纪录片。\n该片引用了许多日本高层人士的话来论证 \"窗口指导 \"是\n是日本经济 \"奇迹 \"背后的关键力量。\n其中，日本银行向银行提供配额，规定他们应该贷出多少钱，并向...",
      "title": "日本 \"奇迹般的 \"经济崛起在90年代戛然而止。这种停滞是由日本银行家故意造成的，以创造金融改革的动力？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以，我剛剛看了一部根據《日元王子》一書改編的紀錄片。\n該片引用了許多日本高層人士的話來論證 \"窗口指導 \"是\n是日本經濟 \"奇蹟 \"背後的關鍵力量。\n其中，日本銀行向銀行提供配額，規定他們應該貸出多少錢，並向...",
      "title": "日本 \"奇蹟般的 \"經濟崛起在90年代戛然而止。這種停滯是由日本銀行家故意造成的，以創造金融改革的動力？"
    }
  ]
}