{
  "author": "2012Jesusdies",
  "original_created_utc": 1646631158,
  "title": "Japan's \"miraculous\" economic rise came to a screeching halt in the 90s. Was this stagnation delibarately caused by Japanese bankers to create impetus for financial reform?",
  "created_utc": 1646687199,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So, I just watched a documentary based on the book &amp;quot;Princes of the Yen&amp;quot; and it argues with many quotes from Japanese higher ups that the &amp;quot;window guidance&amp;quot; was the critical force behind Japanese economic &amp;quot;miracle&amp;quot;, in which the Bank of Japan gives quotas to banks how much they should lend and to what companies under low interest rates. The Japanese officials of the time dressed this under technical jargon and pretended it was all free-market as revealing the truth would have been politically troubling.&lt;/p&gt;\n\n&lt;p&gt;Then, Japanese bankers educated in the US under free-market principles came back to Japan and judged that the &amp;quot;window-guidance&amp;quot; was a break from free-market and is a crisis waiting to happen. So, they needed to reform it, but they argued no fundamental reforms can be undertaken without crisis. So they decided to pump up the window guidance to extreme to create a bubble. They kept pumping it and when it started bursting, they avoided doing actions which would&amp;#39;ve solved the crisis. &lt;/p&gt;\n\n&lt;p&gt;How widely accepted is this?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/t8i1pt/japans_miraculous_economic_rise_came_to_a/",
  "subreddit": "AskHistorians",
  "id": "t8i1pt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So, I just watched a documentary based on the book \"Princes of the Yen\" and it\nargues with many quotes from Japanese higher ups that the \"window guidance\" was\nthe critical force behind Japanese economic \"miracle\", in which the Bank of\nJapan gives quotas to banks how much they should lend and to…"
}