{
  "author": "TryingToMakeAMil",
  "original_created_utc": 1635276379,
  "title": "It will take you at least 3 bull markets to make life changing money",
  "created_utc": 1635302310,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>You’re going to make most of your mistakes during your 1st and 2nd bull market.</p>\n\n<p>During your first bull market you will probably come in too late. It’s likely that you got hyped after seeing about coins going to the moon on the news or from your friends (like SHIB). Your greed gets the better of you even if you don’t know much about crypto or investing.</p>\n\n<p>During the second bull market chances are you’re still greedy or simply too inexperienced. This causes you to either take profit too early or hodl past the peak and miss out on your best gains.</p>\n\n<p>When the third bull market comes you’re smart and experienced enough to have loaded your bags in the bear market and know when to exit the market.</p>\n\n<p>We’re all gonna make it.</p>\n</div><!-- SC_ON -->",
  "score": 177,
  "permalink": "/r/CryptoCurrency/comments/qge39i/it_will_take_you_at_least_3_bull_markets_to_make/",
  "subreddit": "CryptoCurrency",
  "id": "qge39i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "You’re going to make most of your mistakes during your 1st and 2nd bull market.\n\nDuring your first bull market you will probably come in too late. It’s likely\nthat you got hyped after seeing about coins going to the moon on the news or\nfrom your friends (like SHIB). Your greed gets the better of you…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1回目と2回目の強気相場では、ほとんどの失敗をすることになるでしょう。\n\n最初の強気相場では、おそらく参入するのが遅すぎるでしょう。それは、おそらく\nニュースや友人（SHIBなど）からコインが月に行くという話を聞いて興奮してしまったのでしょう。\nニュースや友人（SHIBなど）からコインが高騰しているのを見て 欲に負けてしまったのでしょう。",
      "title": "人生を変えるほどの大金を手にするには、少なくとも3回の強気相場が必要です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你会在你的第一和第二轮牛市中犯大部分错误。\n\n在你的第一个牛市中，你可能会来得太晚。这很可能是\n你很可能在新闻中或从你的朋友那里看到关于硬币上月球的消息后被炒得很热。\n从你的朋友那里（如SHIB）。你的贪婪使你变得更好......",
      "title": "你至少需要3个牛市才能赚到改变生活的钱"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你會在你的第一和第二輪牛市中犯大部分錯誤。\n\n在你的第一個牛市中，你可能會來得太晚。這很可能是\n你很可能在新聞中或從你的朋友那裏看到關於硬幣上月球的消息後被炒得很熱。\n從你的朋友那裏（如SHIB）。你的貪婪使你變得更好......",
      "title": "你至少需要3個牛市才能賺到改變生活的錢"
    }
  ]
}