{
  "author": "MasterCookSwag",
  "the_new_excerpt": "First of all, I can't wait to be berated in the comments.\n\nI'm gonna be blunt, I have seen a whole lot of dumb shit over the last week. A\nlot more than normal. And compounding all of that is an unprecedented amount of\nlegitimate emotional involvement here. So let me get started by saying…",
  "original_created_utc": 1612186971,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "首先，我已经迫不及待地想在评论里被骂了。\n\n我直言不讳的说，在过去的一周里，我看到了一大堆的蠢事。A\n比正常情况下多很多。而这一切的复合是一个前所未有的数量。\n合法的情感参与在这里。所以，让我先说... ...",
      "title": "情感投入从未如此之高，请理解其中的风险。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，我已經迫不及待地想在評論裏被罵了。\n\n我直言不諱的說，在過去的一週裏，我看到了一大堆的蠢事。A\n比正常情況下多很多。而這一切的複合是一個前所未有的數量。\n合法的情感參與在這裏。所以，讓我先說... ...",
      "title": "情感投入從未如此之高，請理解其中的風險。"
    }
  ],
  "title": "Emotional involvement has never been this high, please understand the risk involved.",
  "created_utc": 1612190581,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>First of all, I can&#39;t wait to be berated in the comments. </p>\n\n<p>I&#39;m gonna be blunt, I have seen a whole lot of dumb shit over the last week.  A lot more than normal.  And compounding all of that is an unprecedented amount of legitimate emotional involvement here.  So let me get started by saying outright that people getting emotionally involved with trading stocks always lose.  Short, long, whatever.  It doesn&#39;t matter if you&#39;re a 19 year old throwing in your life savings or Bill fucking Ackman not being able to admit he was wrong with Herbalife.  Letting your emotions be a major factor in trading is a fantastic way to lose money. </p>\n\n<p>And a whole lot of you are really emotionally involved with this GME, AMC, whatever stuff.</p>\n\n<p>To the point: I am not making a buy/sell/hold/whatever reccomendation.  I have no special insight in to what&#39;s happening with GME or whatever else.  What I can tell you is that it is for sure not worth $300.</p>\n\n<p>So let&#39;s dispel one quick thing: this is not David vs Goliath.  It also isn&#39;t the little man vs hedge funds or WSB vs big finance.  It might have started out that way, but if you only read one thing {read this](<a href=\"https://www.bloomberg.com/opinion/articles/2021-01-29/reddit-traders-on-robinhood-are-on-both-sides-of-gamestop):\">https://www.bloomberg.com/opinion/articles/2021-01-29/reddit-traders-on-robinhood-are-on-both-sides-of-gamestop):</a> </p>\n\n<blockquote>\n<p>Many of the big retail brokerages, including Robinhood, route a lot of their customer orders to Citadel Securities, so it ends up seeing a large percentage of retail trades in U.S. stocks. It can see if retail traders are mostly buying or mostly selling or mostly pretty balanced. You might expect—I certainly expected—to see that retail traders were buying more than they were selling this week. The stock seemed to be rocketing up on frenzied retail sentiment, and the posters on WallStreetBets were all claiming that they would never sell and keep buying until it hit $1,000.</p>\n\n<p>But here’s what Citadel Securities’ retail flow looked like in GameStop this week: 1</p>\n\n<p>Retail investors were net buyers on Monday but net sellers for the rest of the week (through yesterday), and all in all quite balanced: About 49.8% of retail orders (that Citadel Securities saw) were to buy, and 50.2% were to sell.</p>\n\n<p>What do you make of that? One reading would be: “Retail investors on Reddit might have started the GameStop rally, but they’re not piling into this stock now, and the price action this week is coming from professionals.” Or as one Twitter user put it, “past the retail ignition, the rocket ship was mostly intra-fast money warfare.”</p>\n</blockquote>\n\n<p><a href=\"https://assets.bwbx.io/images/users/iqjWHBFdfxIU/i9SnRzR8AM1c/v0/800x-1.png\">Graphic here</a></p>\n\n<p>So, just to be clear about this, there is massive institutional money on both sides of this trade, and retail is a toddler sitting at the world series of poker.  </p>\n\n<p><strong>Understand that melvin does not need to cover in the way a retail trader needs to cover</strong>.<br/>\nYou, and everyone else, have no idea what Melvin&#39;s position looks like, and they can reorganize and exit a position before you ever knew it happened.  You don&#39;t know how hedged they are, you don&#39;t know what their collateral looks like, and you don&#39;t know if they&#39;ve covered and restructured a short at last week&#39;s prices.  You simply don&#39;t know.  You only know what&#39;s been presented in the news and, which is almost certainly bullshit.  </p>\n\n<p>This thing could come to an end as fast as it started and you won&#39;t know what happened for weeks.  You might go take a shit at 1pm today and come back to GME trading at $16 because Ken Griffin got on CNBC and announced they restructured their short at an average price of $200, and were happy to sit on it.  Make no mistake, you&#39;ll get kicked in the nuts and have your ball taken away faster than you can comprehend.  </p>\n\n<p><strong>Emotions</strong>\nThe problem with this whole &quot;strike back at wall street&quot; narrative is that lots of you are getting really worked up over this trade.  Losing money sucks, but losing money and feeling like you got shit on by the big guy is going to hurt.  This isn&#39;t a moral crusade to them, it&#39;s 25 billion dollars.  So if you&#39;re out here putting money and emotions on the line that you can&#39;t afford to lose there won&#39;t be a happy ending. </p>\n\n<p>Want to fight the good fight against wall street? Write your congressman, Tweet AOC or Ted Cruz, get you a fucking picket sign and go wave it around on the streeet.  But dropping money on GME that you need in life ain&#39;t gonna change anything except your net worth.</p>\n\n<p>TLDR: </p>\n\n<p>1) know and understand who is playing this game.  And that they have access to tools, leverage, and markets that you do not.  You&#39;re playing Le Chiffre at Casino Royale right now, you might think you&#39;re James Bond but there&#39;s a good chance that you&#39;re just the fat dude in the corner. </p>\n\n<p>2) Short squeezes end fast.  As fast as they started.  If you&#39;re new to trading then understand buying GME at this price can mean all of your money will evaporate before you had time to make a TikTock about it.</p>\n\n<p>3) Get your emotions out of play here.  This whole nonsense political narrative is only going to cause you to make trading mistakes.  Can&#39;t handle that?  then maybe it&#39;s not a good idea to sit at this table.  </p>\n\n<p>Lastly, if you really just can&#39;t get yourself out of the whole &quot;fight the hedge funds&quot; nonsense, at least understand that you&#39;re spending money that you likely won&#39;t get back.  If that&#39;s worth it to you then have at it.  But don&#39;t fool yourself  in to thinking otherwise.</p>\n</div><!-- SC_ON -->",
  "score": 7458,
  "permalink": "/r/investing/comments/la3bft/emotional_involvement_has_never_been_this_high/",
  "subreddit": "investing",
  "id": "la3bft",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518534783
}