{
  "author": "mn_my",
  "the_new_excerpt": "In the past month, eToro has had three extended outages (the latest, yesterday,\nwas 17 hours of straight downtime), has had glitches including setting automatic\n20% stop losses, failure to execute buy orders at open, delaying closure of\npositions for up to an hour after request. If you think…",
  "original_created_utc": 1614170578,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在过去的一个月里，eToro已经发生了三次长时间的故障（最近一次，是在昨天。\n是17个小时的直接停机时间），出现了一些小故障，包括设置自动停机。\n20%的止损，开盘时未执行买单，延迟平仓。\n阵地，在提出要求后，最多可以停留一小时。如果你认为...",
      "title": "eToro最近绝对是群魔乱舞。被警告，把你的钱放在其他地方。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在過去的一個月裏，eToro已經發生了三次長時間的故障（最近一次，是在昨天。\n是17個小時的直接停機時間），出現了一些小故障，包括設置自動停機。\n20%的止損，開盤時未執行買單，延遲平倉。\n陣地，在提出要求後，最多可以停留一小時。如果你認爲...",
      "title": "eToro最近絕對是羣魔亂舞。被警告，把你的錢放在其他地方。"
    }
  ],
  "title": "eToro has been an absolute clusterfuck lately. Be warned, put your money elsewhere.",
  "created_utc": 1614187662,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In the past month, eToro has had three extended outages (the latest, yesterday, was 17 hours of straight downtime), has had glitches including setting automatic 20% stop losses, failure to execute buy orders at open, delaying closure of positions for up to an hour after request. If you think Robinhood sounds bad, eToro is Vlad&#39;s haircut level of fucked.   </p>\n\n<p>The solution to the problem, in eToro&#39;s eyes, is now to increase the minimum deposit for new users (up to $1,000 from $250 earlier this year), and to stop allowing placing order requests for market open. Not to increase server capacity, just to squeeze people a little more. Withdrawal requests already were a travesty (over two weeks in most cases), but now there is an upper limit on withdrawals at one time too. If you have an issue, be prepared to wait 14 days minimum for a response, which will be copy/pasted and ignore the issue before having your ticket closed.  </p>\n\n<p>This amount of bullshit from people who have your money in their hands just can&#39;t be accepted. eToro is dangerous for your money, and shows no signs of improving. And they&#39;re IPOing soon apparently, another one to buy luvley puts on.</p>\n</div><!-- SC_ON -->",
  "score": 3929,
  "permalink": "/r/wallstreetbets/comments/lrbz4a/etoro_has_been_an_absolute_clusterfuck_lately_be/",
  "subreddit": "wallstreetbets",
  "id": "lrbz4a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332901575
}