{
  "author": "c12mintz",
  "the_new_excerpt": "Rates for containerships (the ships which carry thousands of the 20-40’ boxes\nyou seen on railroads and trucks) have been going ballistic the past 4-5 months,\nbut the stock reactions have been mixed.\n\nLink to containership rates: https://harpex.harperpetersen.com/harpexVP.do\n\nI’m currently long…",
  "original_created_utc": 1612153401,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "集装箱船(运载数千只20-40'集装箱的船舶)的费率\n你在铁路和卡车上看到的）在过去的4-5个月里一直在发飙。\n但股价反应不一。\n\n集装箱运价链接：https://harpex.harperpetersen.com/harpexVP.do\n\n我目前做多...",
      "title": "集装箱船的繁荣正在进行中"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "集裝箱船(運載數千只20-40'集裝箱的船舶)的費率\n你在鐵路和卡車上看到的）在過去的4-5個月裏一直在發飆。\n但股價反應不一。\n\n集裝箱運價鏈接：https://harpex.harperpetersen.com/harpexVP.do\n\n我目前做多...",
      "title": "集裝箱船的繁榮正在進行中"
    }
  ],
  "title": "Containership Boom Ongoing",
  "created_utc": 1612162731,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Rates for containerships (the ships which carry thousands of the 20-40’ boxes you seen on railroads and trucks) have been going ballistic the past 4-5 months, but the stock reactions have been mixed.</p>\n\n<p>Link to containership rates:\n<a href=\"https://harpex.harperpetersen.com/harpexVP.do\">https://harpex.harperpetersen.com/harpexVP.do</a></p>\n\n<p>I’m currently long about every name possible in the sector including $NMCI which I’ve owned for a bit over a year and doubled down hard into last summer at $0.70-$0.80. </p>\n\n<p>Even after the huge surge in the stock price, the enterprise value to EBITDA valuation metric has barely moved since cash flows are being net debts down rapidly while 2021 projected EBITDA has nearly tripled.</p>\n\n<p>Containerships aren’t like tankers and dry bulk vessels which normally just get 60-80 voyages. These ships are typically contracted for 1-2 or even 3+ years. So when we talk about 2021 EBITDA, they’ve already locked in about 80% of it and over 50% of 2022 rates.</p>\n\n<p>I’ve covered the shipping sector extensively on Seeking Alpha for nearly 10 years and am also on Twitter (@mintzmyer). I figured I’d open up a conversation here and see if anyone is interested in the sector. $NMCI still trades for an unbelievable P/E of under 2x.</p>\n\n<p>Nick First (@allthingsventured on Twitter) has recently written a new article on Navios Partners with his own financial projections:</p>\n\n<p><a href=\"https://seekingalpha.com/article/4402328-new-navios-partners-favorite-play-for-supercycle\">Article on Navios Maritime Partners</a></p>\n\n<p>I believe we’re just getting started here. For my disclosure, I’m long nearly every name in the space- $ATCO $CMRE $CPLP $DAC $MPCC (Oslo) $NMCI $NMM (they own most of $NMCI) and mostly recently: $ZIM. </p>\n\n<p>I have about 10% of my wealth in $NMCI/$NMM. Average basis in NMCI is in the very low $1s after buying a lot this summer at 70-80c. </p>\n\n<p>I’ve been a long time Reddit user, but I’ve never really posted much about stocks so please forgive the basic post. I’m happy to answer any questions- cheers!</p>\n\n<p>Edit: Wow thanks for the great engagement so far. Feel free to check out Twitter (@mintzmyer) or Seeking Alpha profile for more background:\n<a href=\"https://seekingalpha.com/author/j-mintzmyer#regular_articles\">https://seekingalpha.com/author/j-mintzmyer#regular_articles</a></p>\n</div><!-- SC_ON -->",
  "score": 324,
  "permalink": "/r/investing/comments/l9unrf/containership_boom_ongoing/",
  "subreddit": "investing",
  "id": "l9unrf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518534781
}