{
  "author": "Fl3tchx",
  "the_new_excerpt": "This might be a bit of a rant but seriously wtf are we doing here? These fees\nare no different to repeatedly punching yourself in the balls and wondering why\nno one else wants to do the same! Anyone who thinks crypto is going to be used\nas a form of payment and mass adopted are living in their own…",
  "original_created_utc": 1611044014,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这可能是一个有点咆哮，但严重的是，wtf我们在这里做什么？这些费用\n无异于屡屡打自己的蛋蛋，不知道为什么。\n没有人愿意做同样的事情! 任何认为加密技术会被使用的人。\n作为一种支付方式，并大量采用是活在自己的...",
      "title": "收费让加密技术看起来像妄想症!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這可能是一個有點咆哮，但嚴重的是，wtf我們在這裏做什麼？這些費用\n無異於屢屢打自己的蛋蛋，不知道爲什麼。\n沒有人願意做同樣的事情! 任何認爲加密技術會被使用的人。\n作爲一種支付方式，並大量採用是活在自己的...",
      "title": "收費讓加密技術看起來像妄想症!"
    }
  ],
  "title": "Fees make crypto look Delusional!",
  "created_utc": 1611065914,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This might be a bit of a rant but seriously wtf are we doing here? These fees are no different to repeatedly punching yourself in the balls and wondering why no one else wants to do the same! Anyone who thinks crypto is going to be used as a form of payment and mass adopted are living in their own delusional reality.  </p>\n\n<p>I had to move around some Bitcoin and ETH tokens for security reasons and what an absolute shit show that is. I had to buy more ETH to pay for the gas fees because what I had a month ago suddenly isn&#39;t enough, not ideal but ok, however I couldn&#39;t even send $10 I just brought to another wallet because it doesn&#39;t cover the fees! Never mind the BTC fees and the time I had to wait for it all to be confirmed. </p>\n\n<p>I&#39;ve been in crypto since bitcoin was around $10 so I&#39;ve seen a lot happen in this space, but I&#39;m done with all this until something changes. People go on about mass adoption globally and it being widely used to help poorer countries with hyper inflation or the unbanked, sounds great but that&#39;s never going to happen with insane fees given to greedy miners who throw a tantrum when things don&#39;t get changed to go their way. Do you seriously think someone who lives on less than $1 a day is going to spend $10 on fees! Seriously fuck these greedy self obsessed miners, they are one out of many reasons holding everything back. Crypto has turned into a tool for the wealthy more than the poorer people who need it.</p>\n\n<p>Also stop treating satoshi like some god who could never have been wrong. Do people ever think that maybe just maybe he/they weren&#39;t right about everything and forget it was just some guy or two, that clearly never saw industrial scale mining happening using specialized hardware that only wealthy investors can afford. This is now NOT! a technology run for the people by the people but run by corporations only in it for profit. Then you have the people who are stuck on repeat about how the lightning network is going to save btc and eth 2.0 will have &quot;thousands&quot; of TPS. Well where are they? Always another year or two away that never arrives never mind how laughable the lightning network is. And I&#39;m not even saying litecoin or bcash or whatever shitcoin is any better because they aren&#39;t, if everyone jumped to them they still couldn&#39;t handle the TPS and fees would go up. Never mind all the electricity wasted which is a whole other issue.</p>\n\n<p>If crypto is ever going to work there has to be no fees for the poorer parts of the world and instant transactions for retail to gain mass adoption. Otherwise this is just one big circle jerk filled with scams and people drawing imaginary lines on colourful charts pretending they can predict the future, and has absolutely nothing to do with saving the world from the banking cartel and governments.</p>\n</div><!-- SC_ON -->",
  "score": 444,
  "permalink": "/r/CryptoCurrency/comments/l0fi0h/fees_make_crypto_look_delusional/",
  "subreddit": "CryptoCurrency",
  "id": "l0fi0h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1611311216174
}