{
  "author": "10SneksInATrenchcoat",
  "original_created_utc": 1646043626,
  "title": "Does everyone secretly have no idea what they're doing and just pretend to?",
  "created_utc": 1646053911,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Young adult here. I&amp;#39;ve always felt inferior to everyone because I felt like everyone was handed this mysterious instruction manual of life and I didn&amp;#39;t get it. Like I&amp;#39;m dumber or more naive than every other person on the planet. Or more dishonest, less worthy of the space I take up, just somehow less than everyone. And that everyone around me is walking around doing everything just right, know exactly what they&amp;#39;re doing and I&amp;#39;m just out here doing everything wrong and being a complete moron and a fuck up no matter how hard I try. I&amp;#39;ve always felt like a sham and, imposter and a liar compared to most people. And I don&amp;#39;t associate myself with them because of it. Because I feel like they&amp;#39;re Superior to me in some way - like they&amp;#39;re the real adults and I&amp;#39;m the child and I don&amp;#39;t deserve to be around them, be friends with them or even think of having a relationship. Even among people my own age I feel like a total fake and I&amp;#39;m here just a little kid in adults clothes playing pretend doing things I&amp;#39;m unqualified to do like operating a cash register, having my own place or a friend with benefits. Like everyone else is doing it right and I&amp;#39;m just doing it wrong!&lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t even take myself seriously as an adult because of my height. I mean I&amp;#39;m 4&amp;#39;11. Most adults are much bigger than that and I look completely ridiculous going into work like a 12-year-old.&lt;/p&gt;\n\n&lt;p&gt;But sometimes I wonder.. is it possible these people are every bit as clueless as I am? About what the proper protocol is during dating? Jobs? Getting into the right college or finding the right place to move? Making friends as an adult? Is it possible that these people are actually my equals and are just blundering around as stupidly as I am but they just pretend they know what they&amp;#39;re doing? Or does everybody else have some mysterious instruction manual to life that I don&amp;#39;t have and I&amp;#39;m inferior somehow for some reason? What&amp;#39;s really going on?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 111,
  "permalink": "/r/TooAfraidToAsk/comments/t3cgla/does_everyone_secretly_have_no_idea_what_theyre/",
  "subreddit": "TooAfraidToAsk",
  "id": "t3cgla",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Young adult here. I've always felt inferior to everyone because I felt like\neveryone was handed this mysterious instruction manual of life and I didn't get\nit. Like I'm dumber or more naive than every other person on the planet. Or more\ndishonest, less worthy of the space I take up, just somehow…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ヤングアダルトです。私はいつもみんなより劣っていると感じていました。\nみんな不思議な人生の指南書を渡されて、私はそれを理解できなかった。\nそれは 私は地球上のどの人よりも頭が悪く、世間知らずであるかのように。あるいはもっと\n不誠実で、自分の居場所がない、ただなんとなく...。",
      "title": "みんな内心では何も考えてなくて、ただフリをしているだけなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是年轻的成年人。我一直觉得自己比别人差，因为我觉得\n每个人都得到了这本神秘的生活指南，而我却没有得到\n它。就像我比这个星球上的每个人都更笨或更天真。或者更\n不诚实，不值得我占用的空间，只是不知为何...",
      "title": "是否每个人都秘密地不知道自己在做什么，只是假装不知道？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是年輕的成年人。我一直覺得自己比別人差，因爲我覺得\n每個人都得到了這本神祕的生活指南，而我卻沒有得到\n它。就像我比這個星球上的每個人都更笨或更天真。或者更\n不誠實，不值得我佔用的空間，只是不知爲何...",
      "title": "是否每個人都祕密地不知道自己在做什麼，只是假裝不知道？"
    }
  ]
}