{
  "author": "mic_droo",
  "original_created_utc": 1636994180,
  "title": "I just took profits for the first time today (tax free!) and it feels good!",
  "created_utc": 1637008295,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Exactly one year and one day ago today, I bought my first crypto. Of course I had heard about Bitcoin and some other crypto currencies years before that, but I didn&#39;t really have that much money I could afford to lose until like one and a half years ago; and I was only finally convinced to invest myself after BTC did its first crazy rally this bull run late last year.</p>\n\n<p>The first coin I bought was ADA, a small-ish bag of it for slightly above $0.1 per coin. I live in Germany, and here you can sell your crypto tax free if you held it for at least a year. So to celebrate that my first bag of crypto is now tax free, I sold half the ADA I bought back then - receiving ten times as much as I paid for the full amount back then. I know it&#39;s probably not the best time to sell ADA, but I have more, wanted to take a bit of profit to celebrate my &quot;anniversary&quot; and I bought more over the following months, so it&#39;s not like I sold half my ADA. It feels really nice to finally take profits after what feels much longer than a year :) !</p>\n</div><!-- SC_ON -->",
  "score": 175,
  "permalink": "/r/CryptoCurrency/comments/qukfl5/i_just_took_profits_for_the_first_time_today_tax/",
  "subreddit": "CryptoCurrency",
  "id": "qukfl5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Exactly one year and one day ago today, I bought my first crypto. Of course I\nhad heard about Bitcoin and some other crypto currencies years before that, but\nI didn't really have that much money I could afford to lose until like one and a\nhalf years ago; and I was only finally convinced to invest…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ちょうど1年と1日前の今日、私は初めて暗号を買いました。もちろん、私は\nビットコインやその他の暗号通貨については、その数年前から聞いていましたが\n1年半ほど前までは、失ってもよいほどの大金を持っていませんでした。\nしかし、1年半ほど前までは失うほどの大金を持っていませんでした。",
      "title": "今日、初めて利益を得ました（非課税です！）。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "整整一年零一天前的今天，我买了我的第一个加密货币。当然，我\n在那之前，我已经听说过比特币和其他一些加密货币，但是\n我并没有那么多钱，我可以承受损失，直到一年半前\n半年前，我才最终被说服投资......",
      "title": "我今天刚刚第一次获利（免税！），感觉很好！\"。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "整整一年零一天前的今天，我買了我的第一個加密貨幣。當然，我\n在那之前，我已經聽說過比特幣和其他一些加密貨幣，但是\n我並沒有那麼多錢，我可以承受損失，直到一年半前\n半年前，我才最終被說服投資......",
      "title": "我今天剛剛第一次獲利（免稅！），感覺很好！\"。"
    }
  ]
}