{
  "author": "SuspiciousAdverts",
  "original_created_utc": 1638843779,
  "title": "For those against abortion, what if I never want kids?",
  "created_utc": 1638874090,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;These anti-abortion arguments always bring up how “women shouldn’t be having sex before marriage anyway,” like it’s some kind of foregone conclusion that once I put a ring on my finger, I’m going to want kids. &lt;/p&gt;\n\n&lt;p&gt;I am a married woman who uses protection and hates kids, but I recognize that protection is only 99 percent safe.&lt;/p&gt;\n\n&lt;p&gt;Genuine question for those against abortion: what am I supposed to do if the protection fails? Am I just SOL and have to have a kid? Or would you rather see me put them up for adoption in the system?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/rao9v1/for_those_against_abortion_what_if_i_never_want/",
  "subreddit": "TooAfraidToAsk",
  "id": "rao9v1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "These anti-abortion arguments always bring up how “women shouldn’t be having sex\nbefore marriage anyway,” like it’s some kind of foregone conclusion that once I\nput a ring on my finger, I’m going to want kids.\n\nI am a married woman who uses protection and hates kids, but I recognize that\nprotection…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "中絶反対論者はいつも、「女性はセックスをしてはいけない」と持ち出す。\n結婚する前に、結婚するのは当然のことであるかのように。\n指輪をはめると、子供が欲しくなるんです。\n\n私は避妊具を使う既婚女性で、子供も嫌いですが、そのことは認識しています。\n保護...",
      "title": "中絶に反対する人たちは、もし私が子供を欲しがらなかったら？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这些反堕胎的论点总是提到 \"妇女无论如何都不应该在婚前发生性行为\"。\n就像一旦我戴上了戒指，我就会去做。\n一旦我戴上了戒指，我就会想要孩子。\n\n我是一个已婚妇女，使用保护措施，讨厌孩子，但我承认\n保护...",
      "title": "对于那些反对堕胎的人来说，如果我永远不想要孩子怎么办？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這些反墮胎的論點總是提到 \"婦女無論如何都不應該在婚前發生性行爲\"。\n就像一旦我戴上了戒指，我就會去做。\n一旦我戴上了戒指，我就會想要孩子。\n\n我是一個已婚婦女，使用保護措施，討厭孩子，但我承認\n保護...",
      "title": "對於那些反對墮胎的人來說，如果我永遠不想要孩子怎麼辦？"
    }
  ]
}