{
  "author": "SoupaSoka",
  "original_created_utc": 1629941125,
  "title": "If you bought a random top 50 coin during the ATH in 2017/2018, you had a 74% chance of never recouping your investment (and more data/graphs/discussion!)",
  "created_utc": 1629992135,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This post is one in my series of crypto graph/data posts; please see links to my others below:</p>\n\n<ol>\n<li><a href=\"https://new.reddit.com/r/CryptoCurrency/comments/p90ole/i_graphed_whether_the_top_100_coins_from_2016/\">What happened to the top 100 coins from 2016?</a></li>\n<li><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/p8ao8r/i_graphed_how_many_bricks_and_moons_you_would/\">How many Bricks/Moons you&#39;d need to spend to buy lunch</a></li>\n<li><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/p6cvf8/this_is_what_1000_invested_5_years_ago_would_be/\">Comparing a 5-year investment in the top 5 crypto versus traditional investments</a></li>\n<li><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/p4ltdj/i_compared_the_change_in_value_of_the_top_10/\">YTD changes in top 10 coin market cap versus subreddit subscriber counts</a></li>\n</ol>\n\n<p>A little methodology for today&#39;s data. I found the top 50 cryptocurrencies by market cap on October 1st, 2017. This date is just a little bit before the big crypto boom that started in late 2017 and ended in early 2018; October 1st itself isn&#39;t important, but it was data I could find easily and seemed close enough to the start of the boom without being actually in the boom itself.</p>\n\n<p><a href=\"https://preview.redd.it/p7ss1tgdnlj71.png?width=332&amp;format=png&amp;auto=webp&amp;s=df78dd37d9b4634bb6e9a9be25fcfd81890300a6\">Fig. 1 - Top 50 cryptocurrencies by market cap on October 1st, 2017.</a></p>\n\n<p>You can see the list above of the top 50 cryptocurrencies by market cap on October 1st, 2017. You&#39;ll probably recognize some of them, but in my opinion, most of these are relatively obscure these days, some having been completely eliminated from existence as far as I can tell.</p>\n\n<p>Now, let&#39;s take a quick look at what a &quot;typical&quot; pump looked like during the 2017/2018 market boom.</p>\n\n<p><a href=\"https://preview.redd.it/b894li0rnlj71.png?width=1907&amp;format=png&amp;auto=webp&amp;s=de701272efbb5a5b06e9e5549bb7f37057282a8c\">Fig. 2 - The historical price of NEM (XEM) from 2015 thru today.</a></p>\n\n<p>I grabbed NEM (XEM) as an example, as it was a top 10 coin in late 2017 and is still holding on as a top 100 coin today. You&#39;ll note the large spike starting in late 2017 and ending by early 2018. This spike is pretty extreme, but if you include the shoulders of this peak, it actually lasted for weeks or months for almost all of these coins. However, for the purpose of this study, I asked this question:</p>\n\n<h1>If you bought at the VERY PEAK in late 2017/early 2018 for each of the top 50 cryptocurrencies by market cap (at that time) and didn&#39;t immediately sell, how many days would you have had to wait for the price to return to that peak price?</h1>\n\n<p>Well, I&#39;ve got some really bad news for you if you were one of those poor souls. Let&#39;s look to see how many of these top 50 coins ever returned to that peak between the early 2018 crash and today:</p>\n\n<p><a href=\"https://preview.redd.it/67fijpioolj71.jpg?width=976&amp;format=pjpg&amp;auto=webp&amp;s=2ef321301c8b787e26f2ec60f6eaf51f2a7f2e50\">Fig. 3 - From their peaks in late 2017/early 2018, how many coins ever recovered to those same peak prices by today?</a></p>\n\n<p>I would appreciate if you would reply with an F in the chat for these data. To clarify, what the above data tell us is that if you bought at the peak late 2017/early 2018 price for all 50 of the top coins, 37 of those coins would <strong>never</strong> have gotten back up to that same price, ever. Fortunately, twelve coins would go on to new highs, and one coin is that piece of shit Tether. This means if you had picked just one coin randomly and bought it at the 2017/2018 peak, you had a 74% chance of picking a coin that never recovered your initial investment.</p>\n\n<p>So, that&#39;s pretty bad. In fact, looking at these data, it&#39;s a stark contrast to <a href=\"https://new.reddit.com/r/CryptoCurrency/comments/p90ole/i_graphed_whether_the_top_100_coins_from_2016/\">my previous post</a> which showed you would have made huge gains if you bought most or all of the top 100 coins from 5 years ago and held until today. The difference is primarily the timing - if you bought 5 years ago, you were doing so before the big 2017/2018 boom. If you bought at the peak of the 2017/2018 boom, well, yeah, you probably FOMO&#39;d and you likely paid for it.</p>\n\n<p>I then had this thought: my last dataset showed that if you bought coins in the top 5/10/25/50 by market cap in 2016, you were more profitable on average than if you bought coins ranked 51-100. So, was this also true here among this smaller sample size of the top 50 coins? Did you have a better chance of recovering from the 2017/2018 peak if you bought coins primarily in the top 5/10/25 by market cap as opposed to some of the lower market cap coins in the 30-50 range? And, if so, how many days did you have to HODL to recover to a new ATH?</p>\n\n<p><a href=\"https://preview.redd.it/5w3y39a2qlj71.jpg?width=1093&amp;format=pjpg&amp;auto=webp&amp;s=20fc54d44c54f73a5b96f9742e26e2670ed55b8b\">Fig. 4 - An X-Y scatter plot showing coins organized by market cap and how many days it took for them to recover to a new ATH after their 2017/2018 boom/crash. Note, all coins shown as \\&quot;zero\\&quot; days to return to their ATH never recovered at all.</a></p>\n\n<p>Along the X-axis, I have plotted how many days it took for each coin to return to profitability after their 2017/2018 boom and crash. The Y-axis is simply organizing the coins by their market cap rank; e.g., Bitcoin (BTC) was the #1 market cap coin on October 1st, 2017, and thus is at the very bottom of the chart.</p>\n\n<p>Let me point out a few interesting notes here: of the 12 coins that ever returned to profitability from their ATH in 2017/2018, 10 of them took between 1,096 days (BTC) and 1,238 days (LTC), which comes out to almost exactly 3 years, or a little bit longer. You all may know this period of time as the Great Crypto Boom of 2021 (and what a boom it was... and still is?). Importantly, the distribution of those coins are spread almost evenly throughout the top 50 coins; this tells us that just because it was a top 10 coin doesn&#39;t mean it survived the 2018 crash better than a coin ranked in the 30-50 market cap range.</p>\n\n<p>Two coins stand out as outliers: Binance Coin (BNB) and Chainlink (LINK). The reason for these two isn&#39;t that exciting: the BNB pump in 2017/2018 wasn&#39;t very large, and a small price surge in May/June 2018 was enough to get it back over the 2017/2018 hump, but then the price was virtually flat until the 2021 boom. LINK is slightly different but also unexciting: it more or less wasn&#39;t widely popular in 2017/2018 and didn&#39;t seem to get much attention during that bull run, so the peak was very mild. BNB and LINK were, as you may tell from the chart, #47 and #46 (respectively) in market cap at the time, so they likely just didn&#39;t have enough word-of-mouth or other attention to really lead to a price pump.</p>\n\n<h1>What can we learn from these data?</h1>\n\n<p>I&#39;ll start by saying this: cryptocurrency investments are not a guarantee. Despite my last post suggesting that long-term diversification and holding can be incredibly profitable, there are ways to invest in crypto that can be financially ruinous. Picking a few coins and FOMOing in near or at the ATH can be one of those scenarios. I am very doubtful that most of the above coins that haven&#39;t yet recovered to their 2017/2018 peaks will ever recover. Look at that NEM (XEM) chart in Figure 2; do you think there&#39;s any hope for that coin if it couldn&#39;t recover after this massive bull run in early 2021?</p>\n\n<p>And, although my data are looking at the very WORST time to buy (the 2017/2018 peak of the ATH/bull run), there were days/weeks around the peak that were also quite highly-priced that you still likely wouldn&#39;t have recovered from for many of these coins (again, look at the NEM example above).</p>\n\n<h1>tl;dr</h1>\n\n<ol>\n<li>Crypto investments are not guaranteed to be profitable</li>\n<li>FOMOing in during a bull run can be disastrous</li>\n<li>Sometimes, you&#39;re gonna have to HODL for <em>years</em> to recover your investment</li>\n<li>Top 10 market cap coins were not more likely to recover after the 2017/2018 pump/crash than other coins in the top 50</li>\n<li>DCAing would virtually eliminate the risks presented in this dataset, as you likely would have bought coins leading up to the bull run, during bull run, and after the bull run, and your average coin price would be well below the ATH</li>\n</ol>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/pbp7oz/if_you_bought_a_random_top_50_coin_during_the_ath/",
  "subreddit": "CryptoCurrency",
  "id": "pbp7oz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This post is one in my series of crypto graph/data posts; please see links to my\nothers below:\n\n 1. What happened to the top 100 coins from 2016?\n    [https://new.reddit.com/r/CryptoCurrency/comments/p90ole/i_graphed_whether_the_top_100_coins_from_2016/]\n 2. How many Bricks/Moons you'd need to spend…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この投稿は、私の暗号グラフ/データ投稿シリーズの1つで、下記の他の投稿へのリンクを参照してください。\n他の記事へのリンクは以下をご覧ください。\n\n 1. 2016年のトップ100コインに何が起こったのか？\n    [https://new.reddit.com/r/CryptoCurrency/comments/p90ole/i_graphed_whether_the_top_100_coins_from_2016/]\n 2. 何個のレンガ/ムーンを使う必要があるのか...",
      "title": "2017/2018年のATH中にランダムにトップ50のコインを買った場合、74％の確率で投資額を回収できなかった（さらにデータ/グラフ/議論を重ねる！）。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这篇文章是我的加密货币图表/数据系列文章中的一篇；请看下面的链接到我的\n其他文章。\n\n 1. 2016年排名前100的硬币发生了什么？\n    [https://new.reddit.com/r/CryptoCurrency/comments/p90ole/i_graphed_whether_the_top_100_coins_from_2016/]\n 2. 你需要花多少砖块/摩恩...",
      "title": "如果你在2017/2018年ATH期间随机买入一个前50名的币，你有74%的机会永远无法收回投资（还有更多数据/图表/讨论！）。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這篇文章是我的加密貨幣圖表/數據系列文章中的一篇；請看下面的鏈接到我的\n其他文章。\n\n 1. 2016年排名前100的硬幣發生了什麼？\n    [https://new.reddit.com/r/CryptoCurrency/comments/p90ole/i_graphed_whether_the_top_100_coins_from_2016/]\n 2. 你需要花多少磚塊/摩恩...",
      "title": "如果你在2017/2018年ATH期間隨機買入一個前50名的幣，你有74%的機會永遠無法收回投資（還有更多數據/圖表/討論！）。"
    }
  ]
}