{
  "author": "Silent-Ambition1399",
  "the_new_excerpt": "I love my life, my wife(8 years married) and my children (ages 5 and 2) and\nright now things socially and work related are going great. But sometimes I get\ncrazy anxiety just about possible futures. I hear and see stories of marriages\nending in divorce after a decade or more. I hear about kids dying…",
  "original_created_utc": 1619498901,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は自分の人生、妻（結婚8年目）、子供（5歳と2歳）を愛しています。\n今は社会的にも仕事的にもうまくいっています。しかし、時々、将来の可能性について\nしかし、時々、将来の可能性についてめちゃくちゃ不安になります。結婚生活が10年以上続いた後に離婚したという話を聞いたり見たりします。\n結婚しても10年以上で離婚してしまうという話を聞いたり見たりします。子供が死んでしまうという話も聞きますし...。",
      "title": "自分の未来がどうなるのか、怖くてたまらない人はいませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我热爱我的生活，我的妻子（结婚8年）和我的孩子（5岁和2岁）。\n现在社会上和工作上的事情都很顺利。但有时我也会\n对可能的未来产生疯狂的焦虑。我听到和看到一些婚姻故事\n在十年或更长时间后以离婚告终。我听到孩子们的死亡...",
      "title": "还有人害怕吗，我是说真的害怕他们的个人未来会怎样？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我熱愛我的生活，我的妻子（結婚8年）和我的孩子（5歲和2歲）。\n現在社會上和工作上的事情都很順利。但有時我也會\n對可能的未來產生瘋狂的焦慮。我聽到和看到一些婚姻故事\n在十年或更長時間後以離婚告終。我聽到孩子們的死亡...",
      "title": "還有人害怕嗎，我是說真的害怕他們的個人未來會怎樣？"
    }
  ],
  "title": "Is anybody else scared, I mean really terrified of what their personal future might hold for them?",
  "created_utc": 1619531863,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I love my life, my wife(8 years married) and my children (ages 5 and 2) and right now things socially and work related are going great. But sometimes I get crazy anxiety just about possible futures. I hear and see stories of marriages ending in divorce after a decade or more. I hear about kids dying at 15 or younger. All I can think is no matter what I do or how good it is now all these things could happen to me and I can’t do a damn thing about what’s coming in 5 or 10 years.</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/mzgqlk/is_anybody_else_scared_i_mean_really_terrified_of/",
  "subreddit": "TooAfraidToAsk",
  "id": "mzgqlk",
  "is_self": true,
  "media": null,
  "is_video": false
}