{
  "author": "Perfect-Ad-7429",
  "original_created_utc": 1657802262,
  "title": "XRP news abound this week! Former Ripple chair Barr Confirmed as new Fed Chief, Judge Netburn named the SEC 'hypocrites' in ruling, McCaleb (XLM) dumping nearly done. Whew!",
  "created_utc": 1657870354,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My goodness friends, what a week for Ripple. XRP holders, catalysts abound yet we remain stuck in by the bears. Let&amp;#39;s do a quick recap anyway, and hope that the market begins to reflect the bullish news:&lt;/p&gt;\n\n&lt;p&gt;Michael Barr Confirmed: Michael Barr, a former Ripple adviser, is set to assume one of the most important U.S. regulatory roles after winning Senate confirmation to be vice chairman for supervision at the Federal Reserve. Barr is considered an ally to crypto, but has tempered his sentiments with expectations that the market be regulated robustly. This appointment is widely considered good for crypto, and considering it&amp;#39;s issues with the SEC - good for Ripple.&lt;/p&gt;\n\n&lt;p&gt;Netburn says &amp;#39;the Hinman emails must be produced&amp;#39;: The long awaited ruling has finally come down from Circuit Judge Sarah Netburn regarding the attorney-client privilege of conversations had with SEC lawyers by William Hinman. Judge Netburn unequivocally ruled in favor of Ripple, even slamming the &amp;#39;hypocrisy&amp;#39; of the SEC in its attempted defense - asserting that the SEC isn&amp;#39;t even attempting to follow the law in good faith. In his now infamous speech Hinman said that Bitcoin and Ethereum were not to be considered securities, despite ETH having conducted the same kind of unregistered token offerings as Ripple. The preperatory emails Hinman exchanged with SEC lawyers have been desperately guarded to this point, and it remains to be seen what the SEC will do. It seems likely that there will be a series of appeals to Judge Analise Torres, who is responsible for ruling on any appeals to Judge Netburn&amp;#39;s decisions.&lt;/p&gt;\n\n&lt;p&gt;Jed&amp;#39;s dead baby: Former Ripple CTO Jed McCaleb is almost done selling his 9 billion XRP after nearly 8 years. Jed left Ripple after having differences with the leadership team on the direction of the project there. Jed has since worked to bring Stellar (XLM) into the crypto space as a competitor to Ripple within the global payment settlement industry. It is believed that Jed has nearly completed selling his stack of XRP, (he holds approximately 10 million in his TacoStand account) which is estimated to be gone by weeks end. XRP fans are ecstatic about this, as the downward selling pressure has been significant from McCaleb for nearly a decade.&lt;/p&gt;\n\n&lt;p&gt;Other notes: Did you know that Ripple only controls about 5% of nodes on the XRPL? XRP is more decentralized than many crypto projects. The community drives most innovations on chain as well, and will soon deliver Smart Contracts to XRPL in a 100% community driven effort, minus any Ripple devs. Congrats!&lt;/p&gt;\n\n&lt;p&gt;Much to be excited for if you hold a bag of XRP. Thanks for reading!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 301,
  "permalink": "/r/CryptoCurrency/comments/vyuvy5/xrp_news_abound_this_week_former_ripple_chair/",
  "subreddit": "CryptoCurrency",
  "id": "vyuvy5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "My goodness friends, what a week for Ripple. XRP holders, catalysts abound yet\nwe remain stuck in by the bears. Let's do a quick recap anyway, and hope that\nthe market begins to reflect the bullish news:\n\nMichael Barr Confirmed: Michael Barr, a former Ripple adviser, is set to assume\none of the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の良い友人、リップルにとって何という週だろう。XRP ホルダーは、カタリストがたくさんあるにもかかわらず\n私たちはベアから抜け出せないままです。とにかく簡単に振り返ってみて、次のことを期待しましょう。\n市場が強気なニュースを反映し始めることを願っています。\n\nマイケル・バーを確認しました。元リップル社顧問のマイケル・バー氏が、リップル社の経営陣の一人として就任することが決定しました。\nの一人である。",
      "title": "今週はXRPのニュースが盛りだくさん! 元リップル議長のバー氏が新FRB長官に確定、ネットバーン判事が判決でSECを「偽善者」と名指し、マカレブ（XLM）のダンピングはほぼ完了。ふぁいとーーーー"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的天哪，朋友们，这一周对瑞波币来说是多么的重要。XRP持有者，催化剂比比皆是，但\n我们仍然被熊市所困。让我们做一个简单的回顾，并希望\n市场开始反映看涨的消息。\n\n迈克尔-巴尔被证实。前瑞波公司顾问迈克尔-巴尔将担任\n之一的职位。",
      "title": "本周XRP新闻层出不穷! 前Ripple主席Barr被确认为新的美联储主席，Netburn法官在裁决中称SEC为 \"伪君子\"，McCaleb（XLM）的抛售几乎完成。呜呼!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的天哪，朋友們，這一週對瑞波幣來說是多麼的重要。XRP持有者，催化劑比比皆是，但\n我們仍然被熊市所困。讓我們做一個簡單的回顧，並希望\n市場開始反映看漲的消息。\n\n邁克爾-巴爾被證實。前瑞波公司顧問邁克爾-巴爾將擔任\n之一的職位。",
      "title": "本週XRP新聞層出不窮! 前Ripple主席Barr被確認爲新的美聯儲主席，Netburn法官在裁決中稱SEC爲 \"僞君子\"，McCaleb（XLM）的拋售幾乎完成。嗚呼!"
    }
  ]
}