{
  "author": "Lost-Guarantee229",
  "the_new_excerpt": "Can Workhorse Find the Strength to Bounce Back?\n\nThe USPS Next generation Delivery Vehicle Project\n[https://about.usps.com/newsroom/national-releases/2021/0223-multi-billion-dollar-modernization-of-postal-delivery-vehicle-fleet.htm]\nwas recently awarded to Oshkosh Defense, which had extreme effects…",
  "original_created_utc": 1623677447,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ワークホースは立ち直る力を得られるか？\n\nUSPSの次世代デリバリービークルプロジェクト\n[https://about.usps.com/newsroom/national-releases/2021/0223-multi-billion-dollar-modernization-of-postal-delivery-vehicle-fleet.htm]\nがオシュコシュ・ディフェンス社に発注されたことは、非常に大きな影響を与えました...。",
      "title": "WKHSはディップした後、買いなのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Workhorse能否找到反弹的力量？\n\n美国邮政的下一代递送车辆项目\n[https://about.usps.com/newsroom/national-releases/2021/0223-multi-billion-dollar-modernization-of-postal-delivery-vehicle-fleet.htm]\n最近被授予奥什科什防御公司，这产生了极端的影响...",
      "title": "WKHS在下跌后是一个好的买点吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Workhorse能否找到反彈的力量？\n\n美國郵政的下一代遞送車輛項目\n[https://about.usps.com/newsroom/national-releases/2021/0223-multi-billion-dollar-modernization-of-postal-delivery-vehicle-fleet.htm]\n最近被授予奧什科什防禦公司，這產生了極端的影響...",
      "title": "WKHS在下跌後是一個好的買點嗎？"
    }
  ],
  "title": "Is $WKHS a good buy after their dip?",
  "created_utc": 1623713065,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Can Workhorse Find the Strength to Bounce Back?</strong></p>\n\n<p>The <a href=\"https://about.usps.com/newsroom/national-releases/2021/0223-multi-billion-dollar-modernization-of-postal-delivery-vehicle-fleet.htm\">USPS Next generation Delivery Vehicle Project</a> was recently awarded to Oshkosh Defense, which had extreme effects on the share price of <a href=\"https://utradea.com/stocks/WKHS\">$WKHS – Workhorse.</a> However, the question I wanted an answer to is did this occurrence make Workhorse an undervalued growth stock, or is Workhorse still overvalued even after their share price was massacred? This question led me to undergo this analysis to find out.</p>\n\n<p><strong>Company Overview:</strong> </p>\n\n<p>Workhorse is a technology company focused on renewable, and cost-effective solutions in the transportation sector (they make EV’s). Workhorse is an all-American electric delivery truck, and drone manufacturer that is constantly looking for new ways to innovate and optimize their mechanisms. Workhorse is currently working on bringing their <a href=\"https://workhorse.com/cseries.html\">C-Series</a> electric <strong>delivery trucks</strong> to the market to fulfill previous order request. Workhorse is an OEM trying to satisfy the requirements for their Class 2 – Class 6 commercial-grade, medium-duty truck market.</p>\n\n<p>Workhorse has highlighted some of the biggest benefits derive from using their vehicles, these include:</p>\n\n<p>· Lower total cost-of-ownership compared to conventional gasoline/diesel vehicles (estimated to save $170k in fuel savings compared to their fossil fuel counterparts)</p>\n\n<p>· Increased package deliveries per day through the use of more efficient delivery methods</p>\n\n<p>· Improved profitability through lower maintenance costs and reduced fuel expenses</p>\n\n<p>· Improved vehicle safety and driver experience.</p>\n\n<p>Currently, Workhorse is selling their vehicles to their clients using the following distributors Hitachi, Ryder, and Pritchard. Furthermore, 2 of their distributors (Ryder and Pritchard) are also maintenance providers for Workhorse.</p>\n\n<p>Currently, Workhorse has successfully delivered 370 electric delivery vehicles to their customers, and they are the only American OEM to reach these figures, which is quite the accomplishment. These customers consist of the following companies Alpha Baking, <a href=\"https://utradea.com/stocks/FDX\">FedEx</a>, Fluid Market Inc., Pride Group Enterprises, Pritchard, <a href=\"https://utradea.com/stocks/R\">Ryder</a>, <a href=\"https://utradea.com/stocks/UPS\">UPS</a>, and WB Mason.</p>\n\n<p>Workhorse’s Series-C delivery truck comes in 2 configurations, a 650 cubic ft., and a 1,000 cubic ft configuration. Furthermore, their Series-C vehicles include lightweight materials, 360-degree camera’s, collision avoidance, best-in-class turning radius, and their very own roof mounted <a href=\"https://workhorse.com/horsefly.html\">HorseFly delivery drone.</a> These features help to set Workhorse apart from both their electric and fossil fuel competitors, especially their roof-mounted drone.</p>\n\n<p><strong>Investment Information:</strong></p>\n\n<p><em>USPS Next Generation Delivery Vehicle Project:</em></p>\n\n<p>Last year, Workhorse was in competition to win a USPS contract to manufacture 165,000 vehicles for USPS to order and use as mail delivery vehicles. There were 4 other participants in this program, and Workhorse delivered 6 of their prototype vehicles for testing to potentially win this contract. On February 23rd, 2021, it was announced that Workhorse would not be obtaining this contract, but rather Oshkosh Defense.</p>\n\n<p>This came as a surprise to many people and investors and WKHS share price was greatly affected by this news. However, this also created a buying opportunity for investors, as this contract was not the be all and end all of Workhorse’s business. Workhorse still manufactures their electric vehicles and has great potential in the EV Trucking space.</p>\n\n<p><em>HorseFly Technology:</em></p>\n\n<p>As I previously mentioned, Workhorse has their HorseFly drones built into their delivery vehicles. These HorseFly drones are patented, unmanned, and are incorporated into Workhorse’s delivery vehicles in order to deliver packages more efficiently.</p>\n\n<p>These HorseFly drones are capable of carrying up to 10 pounds of packages (payload) and can reach maximum speeds at approximately 50 mph (80km/hr).</p>\n\n<p>The HorseFly system includes an aircraft, a Ground Control Station (GCS), supports takeoff/landing, and has a cargo handling system. This system is designed to support high volumes of packages, long days of use, little maintenance is required, and the system allows Remote Pilots in Command (RPIC) allowing one pilot to control multiple drones.</p>\n\n<p>Workhorse’s drones have been proven to be safe, reliable, and capable of delivering packages.</p>\n\n<p><em>Metron:</em></p>\n\n<p>Workhorse has a cloud-based, remote management system to trach vehicular performance, which they have called “Metron”. <a href=\"https://workhorse.com/metron.html\">Metron</a> collects data and signals while the truck is driving and stores this data in their database and is shared to their clients. This data will be used to map specific route parameters to better manage the battery power, which can help maximize efficiency and determine the ideal times and locations to charge their batteries.</p>\n\n<p><em>Partnerships:</em></p>\n\n<p><em>Duke Energy:</em> </p>\n\n<p>Workhorse has entered into a partnership with <a href=\"https://utradea.com/stocks/DUK\">$DUK - Duke Energy</a> to create an innovative battery leasing program that provides customers with options and cost-competitive alternatives. Duke can also provide depot-wide electrification, battery leasing, and distributed energy resources to Workhorse’s customers. Duke and Workhorse [partnered to make an integrated solution to help reduce the costs of converting existing fleets to quicken their adoption.</p>\n\n<p><em>Moog:</em></p>\n\n<p>Workhorse has also partnered with a company called <a href=\"https://utradea.com/stocks/MOG-A\">$MOG-A - Moog</a>. This partnership is a joint venture (50%-50%) for the development of the unmanned aerial systems (UAS), (their drones). Teams from both Workhorse and Moog are working on developing these drones, their systems, and their sub-systems to improve their quality and make them the most capable UAS in the market. Their goal for these UAS is to be highly reliable, safe, and certified by the highest levels of government approval.</p>\n\n<p><em>Emission and Fuel Economy Standards:</em></p>\n\n<p>The Environmental Protection Agency (EPA) and the National Highway Traffic Safety Administration (NHTSA) issues increasingly stringent fuel/emission standards for 2021-2027. In this document they highlight Workhorse as a “vocational vehicle” manufacturer, which makes Workhorse eligible for flexibility and incentive programs, such as the <a href=\"https://www.epa.gov/ve-certification/averaging-banking-and-trading-abt-report-template-and-guidance-locomotive-engines\">Averaging, Braking, and Trading Program (ABT).</a> This program allows fuel consumption credits to be banked, traded, or averaged. This will allow Workhorse to sell these credits to companies who have larger than mandated emissions.</p>\n\n<p><em>Clean Air Act:</em></p>\n\n<p>Workhorse has already acquired their Certificate of Conformity from the EPA. This certificate is required to be able to sell vehicles in states covered by the Clean Energy Act (ie. California).</p>\n\n<p><em>Intellectual Property:</em></p>\n\n<p>Workhorse currently has 8 existing patents, 1 of which is Canadian and covers their vehicle chassis assembly, and the other 7 are American covering vehicle chassis assembly, vehicle headers, onboard generator system, UAS package delivery system, and their drive module. Additionally, Workhorse has 19 pending patent applications.</p>\n\n<p>Furthermore, Workhorse has 14 issued trademarks (US, and Internationally) and has filed for 5 more trademarks.</p>\n\n<p><em>Property:</em></p>\n\n<p>Workhorse owns 2 pieces of real estate, one of which is their 250,000 sq ft manufacturing plant in Union City, Indiana, and the other is a 45,000 sq ft administrative, manufacturing, and R&amp;D plant in Loveland, Ohio.</p>\n\n<p>Furthermore, Workhorse leases 2 factories which are also located in Loveland, Ohio.</p>\n\n<p>It is good to see that Workhorse has purchased these 2 factories as they will have greater control over what they chose to do and their methods of manufacturing. Also, paying off equity in these 2 factories is essentially paying down an asset.</p>\n\n<p><em>Financial Information:</em></p>\n\n<p>· <strong>2016 Stock Incentive Plan:</strong> Currently, there are still 102,500 shares yet to be converted from existing warrants from Workhorses 2016 stock incentive plan. If these shares were to be converted and dumped into the market, it would cause a dilutionary effect of 0.08%</p>\n\n<p>· <strong>2017 Stock Incentive Plan:</strong> Currently, there are 2,247,500 common shares, and 1,475,625 shares that can be converted from warrants that are yet to hit the market from Workhorse’s 2017 stock incentive plan. If these shares were to be put on the market this year, it would cause dilutionary effect of roughly 3.02% on existing shares.</p>\n\n<p>· <strong>2019 Stock Incentive Plan:</strong> There are also 773,115 common shares that can be converted from warrants, and 4,332,011 shares that are yet to be issued from Workhorse’s 2019 stock incentive plan. If these shares were to be converted and dumped into the market, it would cause dilutionary effect of roughly 4.14%</p>\n\n<p>· <strong>Series B Preferred Stock:</strong> In 2019, Workhorse offered some Series B Preferred Shares to accredited investors. Workhorse sold 1,250,000 of these shares, and each of these preferred shares can be converted into 7.41 common shares. If all of these preferred shares were converted there would be 9,262,500 common shares, however, we know that in 2019 and 2020, 1.6M shares were issued through the conversion of preferred shares. Meaning that there is a maximum of 7,662,500 common shares that can be converted. If all of the remaining preferred shares were to be converted, then it would cause a dilutionary effect of roughly 6.22%</p>\n\n<p>· <strong>2024 Convertible Notes:</strong> Currently, there is $197.7M worth of convertible notes, which are convertible at $35.29/share. This means that there are 5,602,154 shares that can be converted from these notes. If this were to happen, existing shares would exhibit dilutionary effects of 4.55%.</p>\n\n<p>· <strong>Marathon Warrant Agreement:</strong> In 2018, Workhorse sold Marathon Asset Management a warrant to purchase 8,053,390 shares for an exercise price of $1.25. If these warrants were to be exercised and sold, there would be dilutionary effects of 6.53%.</p>\n\n<p>· <strong>RSU and Options:</strong> In Workhorses stock-based compensation they also offer options and restricted stock units (RSU), and as of December 2021, there are 1.97M shares available from options to be purchased at $2.10/share (exercisable over the next 1.8 years), and 1.37M shares in RSU’s (which is expected to be recognized over the next 1.7 years). If all of these options are exercised, and the RSU’s are vested then there will be dilutionary effects of 2.72%.</p>\n\n<p>· <strong>Financial Performance (Good):</strong> Workhorse had a great year in 2020, as their net sales increased by 269.80% (and their cost of sales only increased by 123.56%), their net income was $69.78M (which is the first time they have reported a positive net income), they reported revenue from their drones for the first time, and they paid off $19.14M in long-term debt.</p>\n\n<p>· <strong>Financial Performance (Bad):</strong> Workhorse’s gross loss increase by 113.35% however their surge in “other income” helped to prop up earnings (they are not making money from solely the sale of their vehicles), and their interest expense increased by 553.67%.</p>\n\n<p>· <strong>Liquidity:</strong> Workhorse has nearly doubled their cash position YoY, from $23.9M to $46.8M. They noted that they will use some of this cash to finance projects in 2021 in their <a href=\"https://sec.report/Document/0001628280-21-003538/\">SEC 10-K filing.</a></p>\n\n<p><em>Management Team:</em></p>\n\n<p><strong>Duane Hughes (CEO, President, and Director):</strong> Mr. Hughes has 20 years of direct experience and has relationships in the automotive, advertising, and technology industries. Prior to Workhorse, he worked at Cumulus Interactive Technologies Group as their COO, and prior to this he worked as VP of sales and operations for Gannett Co. Inc.</p>\n\n<p><strong>Robert Willison (COO):</strong> Mr. Willison previously served as the Director of Fleet Technology for Sysco Corp. Prior to Sysco, Mr. Willison worked as the CTO of Rav Technologies.</p>\n\n<p><strong>Steve Schrader (CFO):</strong> Mr. Schrader has over 16 years of experience in public and private companies in a variety of industries. Prior to Workhorse Steve was the CFO of Fuyao Glass America for 4 years.</p>\n\n<p><strong>Stephen Fleming (VP):</strong> Mr. Fleming worked at Workhorse for 9 years as corporate/securities counsel before being promoted to VP. Previously to that, Mr.Fleming served as the managing member of Fleming PLLC, which is a boutique law firm specializing in corporate/securities law.</p>\n\n<p>Although these people do not have the most extensive background in the automotive industry they have a solid background in business, finance, and technology. This is good to hear as they should be able to run this business from a management standpoint, however, where these people lack expertise in the automotive field, they can consult their board of directors who have worked for companies like GM, Piston Group, Cadillac etc. This helps to create a well-rounded management team that I believe is capable of running this business properly.</p>\n\n<p><strong>Investment Valuation:</strong> </p>\n\n<p>Due to Workhorse’s current financial information, I am not able to create a DCF model in order to value the company. However, I was able to undergo comparable analyses, in which I compared Workhorse’s EV/Assets, EV/Revenue and P/B multiples to their competitors. In order to arrive at an unbiased valuation, I took a weighted average of the comparable analyses.</p>\n\n<p><em>EV/Assets:</em></p>\n\n<p>By comparing this multiple to their competition, I arrived at a fair value of $WKHS of $11.97, if this were the case the implied downside would be 22.91%.</p>\n\n<p><em>EV/Revenue:</em></p>\n\n<p>By comparing Workhorse’s EV/Revenue multiple to their competition, I arrived at a fair value of $535.36, which would imply an upside of 3347.23%. This is absurdly high and is due to $NKLA – Nikola having an EV/Revenue multiple of 153,392.</p>\n\n<p><em>P/B:</em></p>\n\n<p>By comparing Workhorse’s P/B ratio to their competitors, I arrived at a fair value per share of $14.73, which would imply a downside risk of 5.14%.</p>\n\n<p><em>Weighted Average Comparable:</em></p>\n\n<p>Since the EV/Revenue comparable implied such a large upside I gave it a weight of 6.6% (20% of equal weight (33%).) the other two results achieve in the comparable analyses are both then weighted equally at 46.7%.</p>\n\n<p>By doing this I arrived at an estimated fair value per share of $15.93, which would imply that Workhorse has a potential upside of 2.58%. This essentially means that you are buying close to fair value, which helps to mitigate risk.</p>\n\n<p><em>Analyst Coverage:</em></p>\n\n<p>The average analyst price target of 7 Wall Street analysts for $WKHS – Workhorse is $15.70, which would imply an upside of 1.09%, this implies that Workhorse is an undervalued growth stock. These estimates are similar to the results I achieved in my comparable analyses.</p>\n\n<p><strong>Risks:</strong></p>\n\n<p>· <strong>Dilution:</strong> Workhorse has had problems with their levels of dilution in the past as they have averaged 44.64% share dilution per year over the last 3 years. Furthermore, these high levels of dilution are also looking pretty likely in the future as Workhorse is yet to offer all of the shares from their 2016, 2017, and 2019 stock incentive plans, their Series B Preferred Shares, their 2024 Convertible Notes, their Warrant Agreement with Marathon Asset Management, their RSU’s, and finally their outstanding options. All of these programs, plans, and agreements will account for approximately 27.26% of future share dilution. This level of previous dilution, and the levels of expected dilution are very high, even for a high-growth, high-potential stock like Workhorse, and should worry current and potential investors alike.</p>\n\n<p>· <strong>Financial Performance:</strong> As stated previously, Workhorse has a couple sections of their financial reports that did not look so favourable (gross loss increase, and high interest expense growth.) If Workhorse does not continue to make large sums of revenue from their “other revenue” segment, then their losses will appear bigger, and they may not report another positive year (like they did this year). This would be detrimental for the stock and scare off investors.</p>\n\n<p><strong>Catalysts:</strong></p>\n\n<p>· <strong>Financial Performance:</strong> Workhorse increased their net sales by 269.80% (and their cost of sales only increased by 123.56%), their net income was $69.78M (which is the first time they have reported a positive net income), they reported revenue from their drones for the first time, and they paid off $19.14M in long-term debt. As stated previously, this was Workhorse’s first time reporting a positive net income on their yearly statement, this could show investors that they have turned around the business, and if they continue this performance in the future, then it will solidify this belief and attract investors.</p>\n\n<p>· <strong>Social Sentiment:</strong> According to <a href=\"https://utradea.com/feed\">Utradea’s Reddit Tab</a>, Workhorse is the 4th most trending stock (in the past 24 hours) and the 9th most tending stock (in the past 48 hours) on Wall Street Bets and has an overall positive sentiment. We have seen the impact that Wall Street Bets has had on other trending stocks, so it will be interesting to see if Wall Street Bets can pump this stock for a quick return.</p>\n\n<p>· <strong>Short Squeeze Potential:</strong> Currently, Workhorse has a short interest of 22%, which makes it a good candidate for s short squeeze. Furthermore, the short borrow rate (premium) for people/institutions to short Workhorse is at 11.91%, which can cause the shorts to have to cover quicker than usual. This stock has the potential to be squeezed, especially if Wall Street Bets takes an interest in it.</p>\n\n<p>This article took a lot of effort for me to make so if you could support my channel to stay up to date as I analyze more “hype” stocks to find what all the hype is about, view/follow <a href=\"https://utradea.com/member-portfolio/WallStreetWhale?utm_source=R&amp;utm_medium=B&amp;utm_campaign=WKHS\">my profile</a>.</p>\n</div><!-- SC_ON -->",
  "score": 51,
  "permalink": "/r/stocks/comments/nzmuaq/is_wkhs_a_good_buy_after_their_dip/",
  "subreddit": "stocks",
  "id": "nzmuaq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009743478
}