{
  "author": "CT_Gunner",
  "original_created_utc": 1646142286,
  "title": "We should give Laszlo Hanyecz (the guy who bought pizzas with 10 000 Bitcoins) some crypto as a reward for his pioneer status. One of the first people to actually use cryptocurrency in the real world and he paved the way...in a way.",
  "created_utc": 1646153039,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Whenever we hear of his story it&amp;#39;s usually a lesson about holding, being patient and not selling all your bag at one.&lt;/p&gt;\n\n&lt;p&gt;He&amp;#39;s generally painted in a relatively negative light or at least painted as someone who made a terrible decision but the truth is at the time he did what not many other people were doing in using crypto in the real world for a legal purchase.&lt;/p&gt;\n\n&lt;p&gt;I think (like many others I&amp;#39;m sure) that he is a pioneer of crypto and real world usage. &lt;/p&gt;\n\n&lt;p&gt;He should be lauded and rewarded for his initial adoption of crypto, so maybe we can do something for him as a community and let him know how much of a legend he is!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 403,
  "permalink": "/r/CryptoCurrency/comments/t488c7/we_should_give_laszlo_hanyecz_the_guy_who_bought/",
  "subreddit": "CryptoCurrency",
  "id": "t488c7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Whenever we hear of his story it's usually a lesson about holding, being patient\nand not selling all your bag at one.\n\nHe's generally painted in a relatively negative light or at least painted as\nsomeone who made a terrible decision but the truth is at the time he did what\nnot many other people…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "彼の話を聞くときはいつも、「持ち続けること」「忍耐強くあること」の教訓になります。\nそして、一度にすべてのバッグを売らないことです。\n\n彼は一般的に比較的ネガティブなイメージで描かれることが多い。\nしかし、その当時、彼がしたことは、とてもひどい決断だったのです。\n他の多くの人々は...",
      "title": "Laszlo Hanyecz（1万ビットコインでピザを買った男）には、パイオニアとしての報酬として暗号を与えるべきでしょう。暗号通貨を実際に使用した最初の人物の1人で、彼はある意味道を切り開いたのです...。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "每当我们听到他的故事，通常都是一个关于坚持、耐心的教训\n和不要一次卖掉所有的包。\n\n他通常被描述为一个相对负面的人，或者至少被描述为\n做出了一个可怕的决定，但事实是，在当时他所做的是\n没有多少人...",
      "title": "我们应该给Laszlo Hanyecz（用10 000个比特币买披萨的人）一些加密货币，作为对他先锋地位的奖励。他是第一批在现实世界中真正使用加密货币的人之一，他铺平了道路......在某种程度上。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "每當我們聽到他的故事，通常都是一個關於堅持、耐心的教訓\n和不要一次賣掉所有的包。\n\n他通常被描述爲一個相對負面的人，或者至少被描述爲\n做出了一個可怕的決定，但事實是，在當時他所做的是\n沒有多少人...",
      "title": "我們應該給Laszlo Hanyecz（用10 000個比特幣買披薩的人）一些加密貨幣，作爲對他先鋒地位的獎勵。他是第一批在現實世界中真正使用加密貨幣的人之一，他鋪平了道路......在某種程度上。"
    }
  ]
}