{
  "author": "DaisyMirolin",
  "original_created_utc": 1628574140,
  "title": "Take your protein pills and put your helmet on",
  "created_utc": 1628595180,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi im from El Salvador \nHere’s another Salvadoran update on BTC law:</p>\n\n<p>Be prepared for lift off because in exactly one month El Salvador’s “Bitcoin Law” will be effective. </p>\n\n<p>The Law was passed by the Legislative Assembly on June 8 giving Bitcoin the status of legal tender. </p>\n\n<p>Some informative points on the law:</p>\n\n<ul>\n<li><p>Every adult citizen of El Salvador will receive $30 worth of BTC when they download and register on the gov crypto app.</p></li>\n<li><p>Use of Bitcoin is optional not mandatory for the people (however company’s will have to mandatorily accept BTC as payment) </p></li>\n<li><p>Salaries and pension will be continued to be paid in usd.</p></li>\n<li><p>Anyone that is being paid in BTC can automatically receive their money in usd.</p></li>\n<li><p>One of the key drivers of the law is to help people sending remittances back to El Salvador, as the payments typically suffer from high transaction and commission costs</p></li>\n<li><p>Transactions in BTC are under Layer 2 Scaling Solutions.. much faster :)</p></li>\n<li><p>Anyone ready to invest 3 Bitcoin in the countries economy will be granted immediate permanent residency</p></li>\n<li><p>Capital gains on Bitcoin will not be taxed</p></li>\n</ul>\n\n<p>My little El Salvador let’s hope you make the grade…</p>\n</div><!-- SC_ON -->",
  "score": 252,
  "permalink": "/r/CryptoCurrency/comments/p1j2bp/take_your_protein_pills_and_put_your_helmet_on/",
  "subreddit": "CryptoCurrency",
  "id": "p1j2bp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi im from El Salvador Here’s another Salvadoran update on BTC law:\n\nBe prepared for lift off because in exactly one month El Salvador’s “Bitcoin\nLaw” will be effective.\n\nThe Law was passed by the Legislative Assembly on June 8 giving Bitcoin the\nstatus of legal tender.\n\nSome informative points on…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "エルサルバドルからこんにちは。\n\nエルサルバドルの「ビットコイン法」がちょうど1ヶ月後に施行されるので、離陸の準備をしてください。\n法」が施行されます。\n\nこの法律は、6月8日に立法議会で可決され、ビットコインに\n法定通貨の地位を与えるものです。\n\nいくつかの有益なポイントは...",
      "title": "プロテインを飲み、ヘルメットをかぶる"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嗨，我来自萨尔瓦多，这是萨尔瓦多关于BTC法律的另一个更新。\n\n准备好起飞，因为在整整一个月后，萨尔瓦多的 \"比特币法 \"将生效。\n法 \"将生效。\n\n该法在6月8日由立法议会通过，给予比特币\n法定货币的地位。\n\n一些信息点是关于...",
      "title": "吃下你的蛋白质药丸，戴上你的头盔"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嗨，我來自薩爾瓦多，這是薩爾瓦多關於BTC法律的另一個更新。\n\n準備好起飛，因爲在整整一個月後，薩爾瓦多的 \"比特幣法 \"將生效。\n法 \"將生效。\n\n該法在6月8日由立法議會通過，給予比特幣\n法定貨幣的地位。\n\n一些信息點是關於...",
      "title": "喫下你的蛋白質藥丸，戴上你的頭盔"
    }
  ]
}