{
  "author": "Random_Account__",
  "original_created_utc": 1624706481,
  "title": "Why is everyone in America so opinionated on mundane things? And by everyone I mean from a common person to the government itself? Sorry if it comes out as rude.",
  "created_utc": 1624734505,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As a non American I have seen so many Americans being highly opinionated about issues such as pineapple on pizza to all the way about pro life/choice and anti vaxxers etc.\nDon&#39;t get me wrong, having opinions is completely OK and a human tendency. Every country and its citizens have opinions of their own based on culture, education, society, upbringing etc. But I have seen a huge amount of articles or videos where Americans want to load their personal opinions on everyone in general. And most of the times if not always these opinions are harmful not only to themselves but others as well and yet many do not want to stray from it no matter what. \nIs this something to do with the society or are there any other reasons?</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/o88wzq/why_is_everyone_in_america_so_opinionated_on/",
  "subreddit": "TooAfraidToAsk",
  "id": "o88wzq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As a non American I have seen so many Americans being highly opinionated about\nissues such as pineapple on pizza to all the way about pro life/choice and anti\nvaxxers etc. Don't get me wrong, having opinions is completely OK and a human\ntendency. Every country and its citizens have opinions of their…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アメリカ人でない私は、多くのアメリカ人が、ピザのパイナップルのような問題や\nアメリカ人は、ピザのパイナップルのような問題から、人生や選択のプロ、反ワクチン主義者のような\nVaxxersなど。誤解しないでいただきたいのですが、意見を持つことは全く問題ありませんし、人間の傾向でもあります。\n人間の傾向です。すべての国とその国民は、それぞれの国について意見を持っています。",
      "title": "アメリカの人たちは、どうしてみんな平凡なことに意見を言うんだろう？みんなというのは、一般人から政府そのものまでということです。失礼なことを言っていたらごめんなさい。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "作为一个非美国人，我看到许多美国人对诸如比萨饼上的菠萝到支持生命/选择和反对生命/选择的所有问题都有强烈的意见。\n诸如比萨饼上的菠萝等问题，到支持生命/选择和反\nvaxxers等等。不要误会我的意思，有意见是完全可以的，是人类的一种倾向。\n倾向。每个国家及其公民都有自己的意见。",
      "title": "为什么美国人对平凡的事情都这么有看法？我说的每个人是指从一个普通人到政府本身？如果你觉得这样说很无礼，请原谅。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "作爲一個非美國人，我看到許多美國人對諸如比薩餅上的菠蘿到支持生命/選擇和反對生命/選擇的所有問題都有強烈的意見。\n諸如比薩餅上的菠蘿等問題，到支持生命/選擇和反\nvaxxers等等。不要誤會我的意思，有意見是完全可以的，是人類的一種傾向。\n傾向。每個國家及其公民都有自己的意見。",
      "title": "爲什麼美國人對平凡的事情都這麼有看法？我說的每個人是指從一個普通人到政府本身？如果你覺得這樣說很無禮，請原諒。"
    }
  ]
}