{
  "author": "AnInjuredBadger",
  "original_created_utc": 1626335126,
  "title": "How survivable was the frontline of a Medieval pitched battle?",
  "created_utc": 1626352387,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I sometimes read about medieval battles in which armies of thousands marched at each other and think about what it must have felt like for those at the fronts of each side. In films and television, we&#39;re conditioned to regularly see our heroes fighting on the frontlines and surviving (especially looking at Game of Thrones), but when I imagine the carnage that must have happened in actual historical battles, I can&#39;t imagine a single person who was leading the charge making it more than a couple of minutes. Am I wrong to think that? And it begs the second question - if the reality was that you were very likely to die if you had the misfortune of being placed at the front, why did the entire frontline go through with it, and how did enough men keep fighting for anyone to sustain an army, since eventually surely most soldiers would have the misfortune of being placed at the front? </p>\n\n<p>Sorry if this is a really stupid question - I am absolutely nothing close to a historian, but this is something I&#39;ve been thinking about lately. I&#39;m very interested in what smarter people than I have to say.</p>\n</div><!-- SC_ON -->",
  "score": 167,
  "permalink": "/r/AskHistorians/comments/oko2d3/how_survivable_was_the_frontline_of_a_medieval/",
  "subreddit": "AskHistorians",
  "id": "oko2d3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I sometimes read about medieval battles in which armies of thousands marched at\neach other and think about what it must have felt like for those at the fronts\nof each side. In films and television, we're conditioned to regularly see our\nheroes fighting on the frontlines and surviving (especially…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は時々、何千人もの軍勢が行進した中世の戦いの記事を読み、前線にいた人たちの気持ちを考えます。\n双方の前線にいた人たちはどんな気持ちだったのだろうと\n思うことがあります。映画やテレビでは、私たちはヒーローが最前線で戦い、生き残っていく姿をよく目にします。\n映画やテレビでは、ヒーローが最前線で戦い、生き残っていく姿をよく目にします（特に...）。",
      "title": "中世の戦いの最前線では、どのくらいの生存率があったのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我有时会读到中世纪的战役，在这些战役中，数千人的军队互相攻打，并思考那些在前线的人的感受。\n我有时会读到中世纪的战役，在这些战役中，数以千计的军队向对方进军，我想，对于那些在前线的人来说，那一定是一种什么样的感觉？\n每一方的感觉。在电影和电视中，我们经常看到我们的英雄在前线作战，并能幸存下来。\n在电影和电视中，我们经常看到我们的英雄们在前线战斗，并且幸存下来（特别是...",
      "title": "中世纪激战的前线的生存能力如何？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我有時會讀到中世紀的戰役，在這些戰役中，數千人的軍隊互相攻打，並思考那些在前線的人的感受。\n我有時會讀到中世紀的戰役，在這些戰役中，數以千計的軍隊向對方進軍，我想，對於那些在前線的人來說，那一定是一種什麼樣的感覺？\n每一方的感覺。在電影和電視中，我們經常看到我們的英雄在前線作戰，並能倖存下來。\n在電影和電視中，我們經常看到我們的英雄們在前線戰鬥，並且倖存下來（特別是...",
      "title": "中世紀激戰的前線的生存能力如何？"
    }
  ]
}