{
  "author": "Virtual-Pin1025",
  "the_new_excerpt": "Sup ya'll, it's me again to get my weekly fix of confirmation bias.\n\nWHAT THE FUCK HAPPENED THIS WEEK ON THE CHART:\nStill confirmed to be disconnected from WSB... for now. This is good.\nDrastically over solid on Thursday and saw a retest of $10 USD but got rejected.\nAs of writing this, I would have…",
  "original_created_utc": 1616864993,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "你们好，这是我再次得到我每周固定的确认偏见。\n\n什么他妈的发生了本周在图表上。\n仍然确认被断开 从WSB ... 暂时。这是好的。\n周四大幅过稳，看到10美元的重测，但被拒绝了。\n在写这篇文章的时候, 我已经...",
      "title": "$BB 3/26/2021 - 技术分析和盈利情况。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你們好，這是我再次得到我每週固定的確認偏見。\n\n什麼他媽的發生了本週在圖表上。\n仍然確認被斷開 從WSB ... 暫時。這是好的。\n週四大幅過穩，看到10美元的重測，但被拒絕了。\n在寫這篇文章的時候, 我已經...",
      "title": "$BB 3/26/2021 - 技術分析和盈利情況。"
    }
  ],
  "title": "$BB 3/26/2021 - Technical Analysis and Earnings",
  "created_utc": 1616893986,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Sup ya&#39;ll, it&#39;s me again to get my weekly fix of confirmation bias.  </p>\n\n<p>WHAT THE FUCK HAPPENED THIS WEEK ON THE CHART:<br/>\nStill confirmed to be disconnected from WSB... for now. This is good. Drastically over solid on Thursday and saw a retest of $10 USD but got rejected. As of writing this, I would have to say ~$9.00USD is the bottom and pending reversal. Using a line starting from October 30th that touches Jan 5th, March 5th and today we dipped under the trend line, recovered, and then dipped under it again. I hope this doesn&#39;t act as resistance otherwise I&#39;m not sure how far down we&#39;ll sink. Financials come out after hours on March 30th, so we could slide a bit more until then.  </p>\n\n<p>THINGS TO LOOK FOR ON FINANCIALS:<br/>\n-Sale of patents to Huwaeii<br/>\n-Facebook Settlement<br/>\n-EBIDTA Positive<br/>\n-Revenue<br/>\n-Debt<br/>\nAll the obvious shit. I shouldn&#39;t need to remind you dinguses but with all these things in mind, this could be a very strong earnings play for those that are not in or are looking to get in. I can with strong confidence currently say all of these things will be higher than expected.   </p>\n\n<p>WELL, WHY THE FUCK DO YOU SAY THAT?:<br/>\nBecause I have my opinions and opinions are like assholes, everyone has one.<br/>\nBut also:<br/>\n-Massive recent hiring postings on at BB for<br/>\n<a href=\"https://bb.wd3.myworkdayjobs.com/BlackBerry/3/refreshFacet/318c8bb6f553100021d223d9780d30be\">https://bb.wd3.myworkdayjobs.com/BlackBerry/3/refreshFacet/318c8bb6f553100021d223d9780d30be</a><br/>\nAlso, you can check LinkedIn for other more recent postings.<br/>\nMeans they have the cash to burn and ready to lock and load and put their software to work<br/>\n-BB IVY Innovation Fund<br/>\n<a href=\"https://www.blackberry.com/us/en/products/automotive/blackberry-ivy/innovation-fund\">https://www.blackberry.com/us/en/products/automotive/blackberry-ivy/innovation-fund</a><br/>\nThis means they&#39;re willing to front/invest their own cash and prove their product works and is worthy of investment. Spend a little bit now, retrieve it later in subscription-based licensing and also purchase of applications, like an &quot;app store&quot; but for cars. One application that comes to mind immediately is hours-of-service apps for commercial truck drivers, but that&#39;s one main of several I have.</p>\n\n<p>Lets now look at the chart:<br/>\n1 Hour:<br/>\nRSI - Massively oversold on Thursday, no surprise we had a dead cat bounce. I am also curious as to why everything rallied in the last 90 minutes across the market, not sure what to think here<br/>\n-Bollinger bands - Tight af. Looking for breakout after that downtrend<br/>\n-50 DMA - I&#39;m sad we didn&#39;t hold above the 50 DMA but it&#39;s fine, it tried but ultimately lost. A expect a retest soon after financials.<br/>\n-Trendline - as I stated above, closed Friday using the major trendline from October 30th as resistance. I&#39;m not too concerned about it because of financials but we shall see what the financials bring  </p>\n\n<p>4 hour:<br/>\nRSI - Almost oversold, on the low end. Lots of room to move up<br/>\nBollinger bands - Thursday we oversold and did not respect the bands and got a bounce, otherwise again our dead cat bounce. I like this because this broke the falling knife.   </p>\n\n<p>Daily:<br/>\nRSI - Healthy, below center. Has the room to move up or down.<br/>\n20 DMA and 50 DMA are completely in line with each other currently and have been since March 12th. I&#39;m interested to see how this plays out. We&#39;re trading below both right now so eventually, this has to break.<br/>\nBollinger Bands - Tightened up as best as it can prior to financials, expecting a breakout from the bottom. </p>\n\n<p>Not much else to report. Financials should be sexy. DYOD you idiots and do not take this as financial advice because last week I shit my pants playing Fortnite.</p>\n\n<p>Take care</p>\n</div><!-- SC_ON -->",
  "score": 88,
  "permalink": "/r/stocks/comments/mei0eo/bb_3262021_technical_analysis_and_earnings/",
  "subreddit": "stocks",
  "id": "mei0eo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357141538
}