{
  "author": "RusticBohemian",
  "original_created_utc": 1625949665,
  "title": "The level of physical activity among preindustrial agricultural workers was immense, and they'd need 2x5 times the caloric intake of modern sedentary people to maintain weight. Did they have access to high-calorie foods? Were they generally feasting on loads of rice, bread, potatoes?",
  "created_utc": 1625988750,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Are there surviving accounts of how much these agricultural workers ate? What were they eating? Pounds and pounds of rice, bread, cornmeal, or potatoes? Did they have access to sources of concentrated calories like oil, nuts, lard, etc?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/ohqgp8/the_level_of_physical_activity_among/",
  "subreddit": "AskHistorians",
  "id": "ohqgp8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Are there surviving accounts of how much these agricultural workers ate? What\nwere they eating? Pounds and pounds of rice, bread, cornmeal, or potatoes? Did\nthey have access to sources of concentrated calories like oil, nuts, lard, etc?",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "農業従事者がどれだけ食べていたかという記録は残っていますか？何を\n何を食べていたのでしょうか？何ポンドもの米、パン、コーンミール、あるいはジャガイモ？また、彼らは\n油、ナッツ、ラードなどの集中カロリー源を利用していたのか？",
      "title": "工業化以前の農業従事者の運動量は膨大で、体重を維持するためには、現代の座り仕事の人の2倍から5倍のカロリー摂取が必要です。彼らは高カロリーの食品を利用していたのでしょうか？彼らは一般的に、大量の米、パン、ジャガイモを食べていたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "是否有关于这些农业工人吃了多少东西的现存记载？他们吃了什么？\n他们在吃什么？一磅一磅的大米、面包、玉米面，还是土豆？他们是否\n他们是否有机会获得集中的热量来源，如油、坚果、猪油等？",
      "title": "前工业时期农业工人的体力活动水平是巨大的，他们需要2-5倍于现代久坐的人的热量摄入来维持体重。他们有机会获得高热量的食物吗？他们一般是以大米、面包、土豆为食吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "是否有關於這些農業工人吃了多少東西的現存記載？他們吃了什麼？\n他們在喫什麼？一磅一磅的大米、麪包、玉米麪，還是土豆？他們是否\n他們是否有機會獲得集中的熱量來源，如油、堅果、豬油等？",
      "title": "前工業時期農業工人的體力活動水平是巨大的，他們需要2-5倍於現代久坐的人的熱量攝入來維持體重。他們有機會獲得高熱量的食物嗎？他們一般是以大米、麪包、土豆爲食嗎？"
    }
  ]
}