{
  "author": "iamnobodysfriend",
  "the_new_excerpt": "No!\n\nSome of us are becoming extremely wealthy because of Bitcoin. And many of us\ncame from poor or lower-middle-class backgrounds. The joy, the exuberant feeling\nwinning millions may lead you to make a severe mistake: You want to tell the\nworld. You want to post it to Facebook and Instagram. You…",
  "original_created_utc": 1609591223,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "不是的！\n\n我们中的一些人因为比特币而变得非常富有。我们中的许多人\n来自贫穷或中下层阶级背景。喜悦，欣喜若狂的感觉\n赢得数百万可能会导致你犯一个严重的错误：你想告诉\n世界。你想把它发布到Facebook和Instagram上。You…",
      "title": "“我刚成为百万富翁”的问题：你应该告诉别人吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不是的！\n\n我們中的一些人因爲比特幣而變得非常富有。我們中的許多人\n來自貧窮或中下層階級背景。喜悅，欣喜若狂的感覺\n贏得數百萬可能會導致你犯一個嚴重的錯誤：你想告訴\n世界。你想把它發佈到Facebook和Instagram上。You…",
      "title": "“我剛成爲百萬富翁”的問題：你應該告訴別人嗎？"
    }
  ],
  "title": "The \"I just became a millionaire\" problem: Should you tell people?",
  "created_utc": 1609601532,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>No!</p>\n\n<p>Some of us are becoming extremely wealthy because of Bitcoin. And many of us came from poor or lower-middle-class backgrounds. The joy, the exuberant feeling winning millions may lead you to make a severe mistake: You want to tell the world. You want to post it to Facebook and Instagram. You want to buy that lambo and race your neighborhood and live-stream your vacations. </p>\n\n<p>DON&#39;T.</p>\n\n<p>Before you know it, every one of your cousins, nieces, (grand)parents, siblings, friends, co-workers, former classmates, and complete fucking strangers will present you their &quot;business plan&quot; why you should invest in their store/car/house/vacation/shit. And if you&#39;re a guy, there is a real danger of gold digger women who are much more cunning than you can possibly imagine.</p>\n\n<p>Only tell your spouse and/or long-term lover. And your children. But that&#39;s it. No, you don&#39;t tell your parents. Not yet. Not immediately. Only long-term lovers and kids are your Inner Circle of trusted allies. Everyone else is a potential honeypot.</p>\n\n<p>Your first best decision is to keep quiet. Your second best decision is to start investing in INCOME STREAMS. You may have a lot of money now, but it&#39;s going to devalue like the USD or any other currecny. You will want to invest in business operations that generate you more CASH. For example, you can buy a restaurant business (after covid, of course). Or you can buy an ecommerce website that generates profits. Or you buy several apartment units you rent out to expats. </p>\n\n<p>Whatever you do, 1) keep quiet, 2) find 3 new income streams. You can, of course, re-invest in other crypto, or invest in gold, or invest in anything you think will generate profits. But focus on income streams. </p>\n\n<p>When people find out you&#39;ve bought a new restaurant, they can figure it out for themselves that you must have won big. You don&#39;t need to tell them how you did it! Now, you may tell your parents you&#39;ve bought that restaurant or those apartments for renting out. You don&#39;t need to tell anyone your exact net worth. Talk to people about what you&#39;re DOING with your money, not about the contents of your savings account.</p>\n\n<p>Once you&#39;ve set yourself up with several or more income streams, you can buy that lambo. Just don&#39;t let anyone but your spouse and kids touch it. And you may need to hire a security/surveillance team to keep an eye on you. The rich stay rich because they invest in income. Get it? HUSH</p>\n</div><!-- SC_ON -->",
  "score": 714,
  "permalink": "/r/Bitcoin/comments/kowvek/the_i_just_became_a_millionaire_problem_should/",
  "subreddit": "Bitcoin",
  "id": "kowvek",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610100740962
}