{
  "author": "OberynMartell94",
  "original_created_utc": 1642725018,
  "title": "What the hell happened this time?",
  "created_utc": 1642739902,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I was drinking coffee with a friend today and one of the conversations was about cryptocurrencies and how prices have been dropping lately. I checked on my portfolio during the conversation and I saw that everything was green, COSMOS was even up double digits. Great, I said. Maybe this is the start of an uptrend.&lt;/p&gt;\n\n&lt;p&gt;I get home, take a shower and go to bed. Woke up and decided to see if the uptrend continues but all I see is a wall of red. It&amp;#39;s worse than it was yesterday. &lt;/p&gt;\n\n&lt;p&gt;Does anyone have any idea what happened? What triggered this double digit dip? I know crypto is volatile but there has to be some kind of explanation or reasoning behind this.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 374,
  "permalink": "/r/CryptoCurrency/comments/s8x9m1/what_the_hell_happened_this_time/",
  "subreddit": "CryptoCurrency",
  "id": "s8x9m1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I was drinking coffee with a friend today and one of the conversations was about\ncryptocurrencies and how prices have been dropping lately. I checked on my\nportfolio during the conversation and I saw that everything was green, COSMOS\nwas even up double digits. Great, I said. Maybe this is the start…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日、友人とコーヒーを飲んでいて、その会話の中で、次のようなことが話題になりました。\n暗号通貨が最近値下がりしていること。私は自分の\nその時、ポートフォリオが全て緑色になっているのを見ました。\nが2桁も上がっていた。素晴らしい、と私は言った。もしかしたら、これがきっかけで......」。",
      "title": "今回は一体何があったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我今天和一个朋友喝咖啡，其中一个谈话是关于\n加密货币以及最近价格如何下降。我在谈话中查看了我的\n我在谈话中查看了我的投资组合，我看到所有东西都是绿色的，COSMOS\n甚至有两位数的增长。太好了，我说。也许这就是开始...",
      "title": "这次到底发生了什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我今天和一個朋友喝咖啡，其中一個談話是關於\n加密貨幣以及最近價格如何下降。我在談話中查看了我的\n我在談話中查看了我的投資組合，我看到所有東西都是綠色的，COSMOS\n甚至有兩位數的增長。太好了，我說。也許這就是開始...",
      "title": "這次到底發生了什麼？"
    }
  ]
}