{
  "author": "Mother_Welder_5272",
  "original_created_utc": 1652652217,
  "title": "Is trying to experience \"authenticity\" while traveling internationally a fool's errand?",
  "created_utc": 1652701451,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I just got back from a vacation a little while ago and I&amp;#39;ve still been mulling this over and I&amp;#39;m curious as to what people think. I&amp;#39;m not the biggest traveler, but I&amp;#39;m in my late 30s and have been on international trips a good amount, over 10 times now. I&amp;#39;m kind of fascinated at how the appeal of traveling as presented to the American middle and upper class through the internet kind of sucks the fun out of it.&lt;/p&gt;\n\n&lt;p&gt;From what I understand from historical context, it was post WWII when middle class American families could generally begin to afford trips abroad. If you went to Rome or Paris, your neighbors would &amp;quot;ooh&amp;quot; and &amp;quot;ahh&amp;quot; when you came back. American brands became international and you could stay at a Hilton or Four Seasons abroad and live in comfort.&lt;/p&gt;\n\n&lt;p&gt;Somewhere along the lines to today, these major destinations and the traditional style of traveling in comfort became trite. &amp;quot;X city is just a tourist trap&amp;quot; became a known line. Cities that were more off the beaten path became cooler. Do you want to go to Paris like every other tourist in the world? Or what about cities that people have heard of, but still have some mystique. Saying &amp;quot;I went to Geneva&amp;quot; or Prague or Belgrade or Dubrovnik now get more &amp;quot;oohs&amp;quot; and &amp;quot;ahhs&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Further, the rise of travel blogs and Instagramming (and probably even before) has led to this concept that to really enjoy, appreciate, or gain perspective during an international trip, you need to see the authentic city. Restaurants in Florence within a 5 mile radius of the Duomo are just gonna be tourist trash, not &amp;quot;real&amp;quot; Italy. You need to find &amp;quot;a hole in the wall&amp;quot;, preferable with some story about how the food is made by an old lady who gets up at 4 AM to knead the bread every morning or whatever. Now that&amp;#39;s supposed to be real traveling.&lt;/p&gt;\n\n&lt;p&gt;Where does this need to be &amp;quot;one up&amp;quot; from the masses who travel come from? Why do we get the sense that once an area has a critical mass of attention or tourists, the well is poisoned for anyone else trying to have fun traveling? Is the only purpose of traveling to find things that no other American has ever seen? &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been with friends who once they&amp;#39;re on a side street or a restaurant and hear another group speaking English, they sigh, and the illusion is ruined. They did not have the good fortune of serendipitously stumbling across a hidden gem. The locals just know what&amp;#39;s hot right now and know how to present a rustic looking cafe on cobblestone streets as an oasis in your journey or whatever. &lt;/p&gt;\n\n&lt;p&gt;This desire can be seen in travel marketing - phrases like &amp;quot;discover untouched waters&amp;quot;. It&amp;#39;s almost absurd on its face. How can a gigantic industry bring me on a chartered trip to undiscovered lands for me to explore? But that human need to be the one who found the thing before the others is just so strong.&lt;/p&gt;\n\n&lt;p&gt;Lastly, even the concept of trying to see the genuine, authentic city and hole in the wall restaurants kind of unsettles me. I think there&amp;#39;s something fundamentally weird, exploitative and colonialist in a group of modern day tech workers all making $200k a year, all who grew up in suburban neighborhoods which they resent, taking a trip to some ancient city that they saw on an Instagram post, and searching out that old lady with a hunched back who wakes up at 4 AM to knead bread and has probably never made more than $5k a year. The lady politely smiles, they all are satisfied, take picture of the meal, say &amp;quot;Mmm, you can&amp;#39;t find that authenticity anywhere but here&amp;quot; which justifies the trip. They maybe take a picture of her and make an Instagram post about how seeing the old lady gave them new perspective on what really matters in life and perseverance and tradition and wow look at her worn hands. They then go back to the Bay Area, with modern day life and amenities and apps like Postmates which they work at, with no discernible difference in their behavior.&lt;/p&gt;\n\n&lt;p&gt;Something about the entire exercise of traveling as a millennial in the post 2010 landscape, looking for authenticity and meaning while traveling, all of it seems somewhat performative and empty. Has anyone else felt these feelings?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/TrueAskReddit/comments/uqgqjr/is_trying_to_experience_authenticity_while/",
  "subreddit": "TrueAskReddit",
  "id": "uqgqjr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I just got back from a vacation a little while ago and I've still been mulling\nthis over and I'm curious as to what people think. I'm not the biggest traveler,\nbut I'm in my late 30s and have been on international trips a good amount, over\n10 times now. I'm kind of fascinated at how the appeal of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は少し前に休暇から戻ったばかりで、まだ熟考しているところです。\nを考えているのですが、皆さんはどう思われますか？私は最大の旅行者ではありません。\n30代後半で、海外旅行にはそれなりに行っています。\nもう10回以上です。その中で、海外旅行の魅力に惹かれています。",
      "title": "海外旅行で「本物」を体験しようとするのは、愚の骨頂？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不久前刚刚度假回来，我仍然在考虑这个问题。\n我仍然在考虑这个问题，我很好奇大家的看法。我不是最大的旅行者。\n但我已经30多岁了，已经进行了大量的国际旅行，已经超过10次了。\n10次了。我有点着迷于国际旅行的吸引力。",
      "title": "试图在国际旅行中体验 \"真实性 \"是一件愚蠢的事情吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不久前剛剛度假回來，我仍然在考慮這個問題。\n我仍然在考慮這個問題，我很好奇大家的看法。我不是最大的旅行者。\n但我已經30多歲了，已經進行了大量的國際旅行，已經超過10次了。\n10次了。我有點着迷於國際旅行的吸引力。",
      "title": "試圖在國際旅行中體驗 \"真實性 \"是一件愚蠢的事情嗎？"
    }
  ]
}