{
  "author": "manu9958",
  "original_created_utc": 1648727656,
  "title": "My girlfriend hung up on me to talk to a random dude who approached her. Is it right for me to get jealous?",
  "created_utc": 1648734911,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;She wore a football jersey to college. As usual she called me and we were talking. While on the call she in a hurry said &amp;quot;I&amp;#39;ll talk to you later&amp;quot; and hung up even before i could say anything. Later when she called me i asked her what had happened. She told me one random dud approached her and started talking to her about her favourite football team(because she was wearing a jersey). Idk why but i thought it was wrong on her part to hang up straight away. And i got jealous and felt that im really low on her priority list. What should i do?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 148,
  "permalink": "/r/TooAfraidToAsk/comments/tsy1td/my_girlfriend_hung_up_on_me_to_talk_to_a_random/",
  "subreddit": "TooAfraidToAsk",
  "id": "tsy1td",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "She wore a football jersey to college. As usual she called me and we were\ntalking. While on the call she in a hurry said \"I'll talk to you later\" and hung\nup even before i could say anything. Later when she called me i asked her what\nhad happened. She told me one random dud approached her and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "彼女はアメフトのジャージを着て大学に通っていた。いつものように彼女が電話してきて、私たちは\n話しています。通話中、彼女は慌てて「また後で」と言い、電話を切った。\n私が何も言わないうちに切り上げました。後日、彼女から電話があったとき、私は何があったのか尋ねました。\nがあった。彼女は、ある不審な男が近づいてきて...と言った。",
      "title": "私のガールフレンドは、彼女に近づいてきたランダムな男と話をするために、私の電話を切りました。嫉妬していいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "她穿了一件足球衫上大学。像往常一样，她给我打电话，我们在\n谈话。在通话过程中，她匆匆说了一句 \"我以后再跟你说 \"就挂了电话。\n我还没来得及说什么就挂了。后来她给我打电话时，我问她\n发生了什么。她告诉我，有一个随机的哑巴走近她，并...",
      "title": "我的女朋友挂断了我的电话，和一个随意接近她的男人说话。我吃醋是对的吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "她穿了一件足球衫上大學。像往常一樣，她給我打電話，我們在\n談話。在通話過程中，她匆匆說了一句 \"我以後再跟你說 \"就掛了電話。\n我還沒來得及說什麼就掛了。後來她給我打電話時，我問她\n發生了什麼。她告訴我，有一個隨機的啞巴走近她，並...",
      "title": "我的女朋友掛斷了我的電話，和一個隨意接近她的男人說話。我喫醋是對的嗎？"
    }
  ]
}