{
  "author": "GeneReddit123",
  "the_new_excerpt": "Rabies is near-universally fatal unless treated early, at least in humans. In\nanimals such as canines, it also provokes aggression and attacking others, which\nhelps spread the disease, over a prolonged period of time and with an easy\ninfection vector.\n\nDiseases are generally thought to fall on the…",
  "original_created_utc": 1619212691,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "狂犬病は、少なくとも人間の場合、早期に治療しなければほぼ全滅してしまいます。イヌなどの動物では\nイヌなどの動物では、狂犬病は攻撃性を誘発し、他者を攻撃することで\nまた、イヌのような動物では、攻撃性があり、他の人を攻撃して、病気を広めることになります。\n感染媒介となる。\n\n病気は、一般的には、降...",
      "title": "狂犬病は、（未治療の場合）致死率がほぼ100％で、感染期間が長くなる病気です。動物界にはどのように存在するのですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "除非早期治疗，否则狂犬病几乎是致命的，至少对人类来说是如此。在\n犬类等动物，它还会激起攻击性和攻击他人，这有助于疾病的传播。\n这有助于疾病的传播，在很长的一段时间内，有一个容易的\n感染媒介。\n\n疾病一般被认为是落在...",
      "title": "狂犬病是一种（未经治疗的）死亡率接近100%的疾病，而且传播期很长。它是如何被控制在动物界的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "除非早期治療，否則狂犬病幾乎是致命的，至少對人類來說是如此。在\n犬類等動物，它還會激起攻擊性和攻擊他人，這有助於疾病的傳播。\n這有助於疾病的傳播，在很長的一段時間內，有一個容易的\n感染媒介。\n\n疾病一般被認爲是落在...",
      "title": "狂犬病是一種（未經治療的）死亡率接近100%的疾病，而且傳播期很長。它是如何被控制在動物界的？"
    }
  ],
  "title": "Rabies is a disease with (untreated) near-100% fatality and a prolonged transmissible period. How is it contained in the animal kingdom?",
  "created_utc": 1619301375,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Rabies is near-universally fatal unless treated early, at least in humans. In animals such as canines, it also provokes aggression and attacking others, which helps spread the disease, over a prolonged period of time and with an easy infection vector.</p>\n\n<p>Diseases are generally thought to fall on the mortality-transmissibility curve, where highly lethal diseases generally kill the host before many others are infected, while highly infectious diseases are usually less lethal, with both ends of the curve limiting the diseases&#39; destructiveness at the species level. Rabies, however, seems to be strong in both categories. What stops it from completely decimating every species it targets?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/askscience/comments/mx5ce8/rabies_is_a_disease_with_untreated_near100/",
  "subreddit": "askscience",
  "id": "mx5ce8",
  "is_self": true,
  "media": null,
  "is_video": false
}