{
  "author": "avaheli",
  "the_new_excerpt": "CLOV might be the greatest play in the history of investments. However, I've\nstarted looking at the comment history of some of the profiles hyping this stock\nand it's all comments that have come in the past couple of months, and all of\nthem are devoted to CLOV stock jumping.\n\nNo additional comments,…",
  "original_created_utc": 1619979119,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "CLOVは、投資の歴史の中で最も偉大なプレイかもしれません。しかし、私は\nこの株を持ち上げているいくつかのプロフィールのコメント履歴を見始めました。\nここ2、3ヶ月の間に寄せられたコメントで、その全てがCLOVに捧げられています。\nそのすべてがCLOV株のジャンプに捧げられています。\n\n追加のコメントはありません、...",
      "title": "CLOVのハイプとそれをハイプする人たち。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "CLOV可能是投资史上最伟大的游戏。然而，我已经\n我开始看了一些炒作这只股票的评论历史\n所有的评论都是在过去几个月里出现的，而且都是\n他们都致力于CLOV股票的跳跃。\n\n没有额外的评论，...",
      "title": "CLOV的炒作和那些炒作。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "CLOV可能是投資史上最偉大的遊戲。然而，我已經\n我開始看了一些炒作這隻股票的評論歷史\n所有的評論都是在過去幾個月裏出現的，而且都是\n他們都致力於CLOV股票的跳躍。\n\n沒有額外的評論，...",
      "title": "CLOV的炒作和那些炒作。"
    }
  ],
  "title": "CLOV hype and those hyping it.",
  "created_utc": 1620008963,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>CLOV might be the greatest play in the history of investments. However, I&#39;ve started looking at the comment history of some of the profiles hyping this stock and it&#39;s all comments that have come in the past couple of months, and all of them are devoted to CLOV stock jumping. </p>\n\n<p>No additional comments, no additional interests. </p>\n\n<p>Granted, I haven&#39;t looked at 100% of the CLOV OPs, but I have looked at 5 or 6 and none of them have cake days prior to Jan 1, 2021 and none of them have comments about anything but CLOV. It&#39;s entirely possible there&#39;s nothing to see here and this is perfectly normal... but I have to ask those wiser than me who would benefit if shares of CLOV were snatched up? Who would want a reduction in float for CLOV shares? Is this a squeeze in the making and who would or could start hyping the stock to gin up the price and lower the available shares? </p>\n\n<p>These aren&#39;t leading questions, I would sincerely like to hear from those who understand this better than I do.</p>\n</div><!-- SC_ON -->",
  "score": 81,
  "permalink": "/r/stocks/comments/n3c8mo/clov_hype_and_those_hyping_it/",
  "subreddit": "stocks",
  "id": "n3c8mo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380968351
}