{
  "author": "dras333",
  "the_new_excerpt": "I get that there are a lot of new people, but there are a lot of us that have\nbeen around for 3+ years and wait for these opportunities. I was only mad that\nit started to climb back up so fast.\n\nNew folks, it's been said many times but bears repeating- you haven't lost\nanything until you sell and…",
  "original_created_utc": 1621439734,
  "title": "You know you are a crypto veteran when this drop made you search for more cash",
  "created_utc": 1621482512,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I get that there are a lot of new people, but there are a lot of us that have been around for 3+ years and wait for these opportunities. I was only mad that it started to climb back up so fast.</p>\n\n<p>New folks, it&#39;s been said many times but bears repeating- you haven&#39;t lost anything until you sell and you don&#39;t sell on a tanked market. You&#39;ll see many of these swings throughout your investment cycle, so prepare mentally as best possible. I found that walking away and not looking for a day or so worked when I started out.</p>\n</div><!-- SC_ON -->",
  "score": 484,
  "permalink": "/r/CryptoCurrency/comments/ng9ish/you_know_you_are_a_crypto_veteran_when_this_drop/",
  "subreddit": "CryptoCurrency",
  "id": "ng9ish",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590801371,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "新しい人が多いのはわかりますが、私たちの中にもたくさんいます。\n3年以上前から、このような機会を待っていたのです。ただ、私が頭にきたのは\nあっという間に上昇に転じました。\n\n新しい皆さん、何度も言われていることですが、繰り返しになりますが、あなたは負けていません。\n売ってしまうまで、そして...",
      "title": "この下落で、より多くの現金を探すようになったとき、あなたは暗号のベテランであることを知っています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道有很多新人，但我们中也有很多人已经在这里工作了3年以上，并等待这些机会。\n但我们有很多人已经在这里工作了3年多，并在等待这些机会。我只是很生气，因为\n它开始这么快地回升。\n\n新人们，这句话已经说过很多次了，但还是要重复一下--你没有损失\n直到你卖出并...",
      "title": "当这次下跌让你寻找更多的现金时，你知道你是一个加密货币的老手。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道有很多新人，但我們中也有很多人已經在這裏工作了3年以上，並等待這些機會。\n但我們有很多人已經在這裏工作了3年多，並在等待這些機會。我只是很生氣，因爲\n它開始這麼快地回升。\n\n新人們，這句話已經說過很多次了，但還是要重複一下--你沒有損失\n直到你賣出並...",
      "title": "當這次下跌讓你尋找更多的現金時，你知道你是一個加密貨幣的老手。"
    }
  ]
}