{
  "author": "fuuufu",
  "original_created_utc": 1638102862,
  "title": "Why is it a problem in America that you have to show your ID to vote?",
  "created_utc": 1638111342,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was just listening to a podcast from like a year ago, and someone mentioned Georgia wanting to pass a law that would make it mandatory for people to show their ID when voting, and everyone was appalled. </p>\n\n<p>I know the voting process is kinda stupid over there and you have to register for some reason and whatnot, but in Europe, it is absolutely normal to go to your local voting place where you are automatically registered, and you come there and show your ID that proves that you are the person with the right to vote, and you get a paper and you go into a booth and fill it out and then you drop it into a box. </p>\n\n<p>I don&#39;t even understand the issue.</p>\n</div><!-- SC_ON -->",
  "score": 109,
  "permalink": "/r/TooAfraidToAsk/comments/r43d3j/why_is_it_a_problem_in_america_that_you_have_to/",
  "subreddit": "TooAfraidToAsk",
  "id": "r43d3j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was just listening to a podcast from like a year ago, and someone mentioned\nGeorgia wanting to pass a law that would make it mandatory for people to show\ntheir ID when voting, and everyone was appalled.\n\nI know the voting process is kinda stupid over there and you have to register\nfor some reason…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1年前のポッドキャストを聞いていたら、誰かがこう言っていました。\nジョージア州では、投票の際に身分証明書の提示を義務付ける法律の制定を目指しています。\n投票の際に身分証明書の提示を義務付ける法律を可決しようとしているジョージア州の話をしていて、みんな驚いていました。\n\nジョージア州の投票プロセスはちょっと馬鹿げていて、登録しなければならないことは知っています。\n何らかの理由で...。",
      "title": "アメリカでは、投票するのに身分証明書を提示しなければならないことが、なぜ問題なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我刚才在听一年前的一个播客，有人提到了\n佐治亚州想通过一项法律，规定人们在投票时必须出示身份证。\n他们的身份证，而每个人都感到震惊。\n\n我知道那里的投票程序有点愚蠢，你必须登记\n因为某些原因...",
      "title": "为什么在美国，投票要出示身份证是个问题？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我剛纔在聽一年前的一個播客，有人提到了\n佐治亞州想通過一項法律，規定人們在投票時必須出示身份證。\n他們的身份證，而每個人都感到震驚。\n\n我知道那裏的投票程序有點愚蠢，你必須登記\n因爲某些原因...",
      "title": "爲什麼在美國，投票要出示身份證是個問題？"
    }
  ]
}