{
  "author": "mercistheman",
  "the_new_excerpt": "Me and my son started mining in 2013... The butterfly labs systems would heat\nthe entire home up north for every month except January... Still have memories\nof the constant humming noise... I sold almost everything in 2018 at the bottom\ndue to cancer treatment... Looking forward there is still so…",
  "original_created_utc": 1622515443,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私と息子は、2013年にマイニングを始めました...。バタフライラボのシステムは、1月を除いて\n1月を除くすべての月に北の家全体を暖めていました...。絶え間ないハミングノイズの記憶がまだ残っています。\n絶え間ないハミングノイズの記憶が残っています...。2018年、癌の治療のために、ほとんどのものを底値で売りました。\n癌の治療のために... 前向きに考えれば、まだまだ...",
      "title": "何が起きても平気"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我和我儿子在2013年开始采矿... 蝴蝶实验室的系统可以为北方的整个家庭提供热量\n蝴蝶实验室的系统可以在北方的每个月为整个家庭供暖，除了一月之外...... 我仍然记得\n那持续不断的嗡嗡声... 我在2018年的底部卖掉了几乎所有的东西\n由于癌症治疗... 展望未来，仍然有那么...",
      "title": "无论发生什么，都能平静地对待"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我和我兒子在2013年開始採礦... 蝴蝶實驗室的系統可以爲北方的整個家庭提供熱量\n蝴蝶實驗室的系統可以在北方的每個月爲整個家庭供暖，除了一月之外...... 我仍然記得\n那持續不斷的嗡嗡聲... 我在2018年的底部賣掉了幾乎所有的東西\n由於癌症治療... 展望未來，仍然有那麼...",
      "title": "無論發生什麼，都能平靜地對待"
    }
  ],
  "title": "At peace with whatever happens",
  "created_utc": 1622550744,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Me and my son started mining in 2013... The butterfly labs systems would heat the entire home up north for every month except January... Still have memories of the constant humming noise... I sold almost everything in 2018 at the bottom due to cancer treatment... Looking forward there is still so much hope. The buzz for the next havening should start around early 2022... The stockpiling is inevitable for what should be a battle for the remaining coins... There will be no second chances at this stage. Nobody will want to part with this rare commodity. So if some  unexpected regulations come along there is comfort knowing that this community is battle tested and will not simply roll over for the next so called crisis... We are large enough and strong enough to maintain BTC&#39;s value on our own... No worries about the mood swings of wallstreet or  political Fuddsters.... Life is good for  us believers... Onwards and upwards for the steady hands... Peace and prosperity brothers and sisters... for a better Future!</p>\n</div><!-- SC_ON -->",
  "score": 286,
  "permalink": "/r/Bitcoin/comments/npjuxp/at_peace_with_whatever_happens/",
  "subreddit": "Bitcoin",
  "id": "npjuxp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804295038
}