{
  "author": "CoolCoolPapaOldSkool",
  "original_created_utc": 1637253722,
  "title": "You haven't seen bloodshed yet, and it's still time to set your priorities straight.",
  "created_utc": 1637321633,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For a veteran like me who has seen the last few bear runs and survived them all, all I can say is that the market is very volatile at the moment; but nobody knows shit about what&#39;s going to happen.</p>\n\n<p>Many new investors who believed in making 10x -100x profits would be confused about their decisions. Panic won&#39;t do you any good.</p>\n\n<p>So it&#39;s time to set your priorities straight. You have only 2 options:-</p>\n\n<p><strong>Option 1</strong>: Keep on Hodling. You won&#39;t lose anything if you don&#39;t sell anything. But this decision has its cost. You may never know when the market will rebound. But one thing that is certain apart from death and taxes is that the market will always rebound no matter what. You have to be patient, and nobody knows for how long.</p>\n\n<p><strong>Option 2</strong>: Sell before the market dips even more. This option is only for those who invested more than they could afford or considered crypto a get-rich-quick scheme. Patience is always the key here. If you can’t be patient enough, then crypto isn’t for you.</p>\n\n<p>You don&#39;t become millionaire overnight, and any decision you will take during the current market movement will be another lesson for you. </p>\n\n<p><em>Fortune favours the bold.</em></p>\n</div><!-- SC_ON -->",
  "score": 177,
  "permalink": "/r/CryptoCurrency/comments/qwts4y/you_havent_seen_bloodshed_yet_and_its_still_time/",
  "subreddit": "CryptoCurrency",
  "id": "qwts4y",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "For a veteran like me who has seen the last few bear runs and survived them all,\nall I can say is that the market is very volatile at the moment; but nobody\nknows shit about what's going to happen.\n\nMany new investors who believed in making 10x -100x profits would be confused\nabout their decisions.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私のように過去数回のベアランを見てきて、全てを乗り越えてきたベテランにとっては\n私が言えることは、現在の市場は非常に不安定で、何が起こるかは誰にもわからないということです。\nしかし、何が起こるかは誰にもわからないのです。\n\n10倍、100倍の利益を信じていた多くの新しい投資家は、自分の判断に戸惑うことでしょう。\n自分の決断に戸惑うことになるだろう....",
      "title": "まだ流血を見ていないので、優先順位を決めるにはまだ時間がかかります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对于像我这样的老手来说，他已经看到了过去几次熊市的运行，并且都活了下来。\n我所能说的是，目前市场非常不稳定；但是没有人\n知道会发生什么。\n\n许多相信能获得10倍-100倍利润的新投资者会对他们的决定感到困惑\n关于他们的决定....",
      "title": "你还没有看到流血事件，现在还是要摆正你的优先次序。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對於像我這樣的老手來說，他已經看到了過去幾次熊市的運行，並且都活了下來。\n我所能說的是，目前市場非常不穩定；但是沒有人\n知道會發生什麼。\n\n許多相信能獲得10倍-100倍利潤的新投資者會對他們的決定感到困惑\n關於他們的決定....",
      "title": "你還沒有看到流血事件，現在還是要擺正你的優先次序。"
    }
  ]
}