{
  "author": "liog2step",
  "original_created_utc": 1640469071,
  "title": "How common was being killed by “friendly fire” in times of hand-to-hand combat? For instance during Viking battles.",
  "created_utc": 1640498012,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Obviously I’ve only seen these battles on TV on The Last Kingdom and Vikings, but with the number of people and the complete chaos I can’t understand how you could tell one side from another. I know shields were painted differently and some armies carried flags but if you aren’t holding something that says what side you’re on, I’m sure killing people on your side had to be pretty common.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/roi91r/how_common_was_being_killed_by_friendly_fire_in/",
  "subreddit": "AskHistorians",
  "id": "roi91r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Obviously I’ve only seen these battles on TV on The Last Kingdom and Vikings,\nbut with the number of people and the complete chaos I can’t understand how you\ncould tell one side from another. I know shields were painted differently and\nsome armies carried flags but if you aren’t holding something…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もちろん、こうした戦いはテレビでは「ラストキングダム」や「ヴァイキング」でしか見たことがありません。\nが、人数の多さと完全なカオスで、どうやっても理解できない。\nを見分けることができました。盾の塗り方が違うのは知っています。\n旗を持っている軍もありましたが、もし何かを持っていなかったら......。",
      "title": "白兵戦の時代、\"フレンドリー・ファイア \"で殺されることはよくあったのでしょうか？例えばヴァイキングの戦いの時。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "显然，我只在电视上看过《最后的王国》和《维京人》的这些战斗。\n但由于人数众多且完全混乱，我不明白你是如何\n我不明白你是如何区分一方和另一方的。我知道盾牌的颜色是不同的，有些军队还带着旗子。\n但如果你没有拿着东西......",
      "title": "在徒手搏斗的时代，被 \"友谊之火 \"杀死的情况有多普遍？例如，在维京人的战斗中。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "顯然，我只在電視上看過《最後的王國》和《維京人》的這些戰鬥。\n但由於人數衆多且完全混亂，我不明白你是如何\n我不明白你是如何區分一方和另一方的。我知道盾牌的顏色是不同的，有些軍隊還帶着旗子。\n但如果你沒有拿着東西......",
      "title": "在徒手搏鬥的時代，被 \"友誼之火 \"殺死的情況有多普遍？例如，在維京人的戰鬥中。"
    }
  ]
}