{
  "author": "Dirty2020",
  "the_new_excerpt": "I'm just going to leave this here for my fellow retard ape brain brethren... If\nyou've lost confidence, if you're scared.... I understand\n\nAlso... Fuck you. You wanted to get on this rollercoaster, you bought your\nticket, you wanted to play with the big boys, guess what fucknuts? Now we're in\nthe…",
  "original_created_utc": 1612544711,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我只想把这个留给我的智障猿脑兄弟们... 如果...\n如果你害怕，你就失去了信心....。我明白了\n\n还有... 去你的 你想上这个过山车，你买了你的。\n你想和大人物们一起玩，你猜怎么着？现在我们在\n的...",
      "title": "你已经开始了，现在投入到他妈的游戏中去吧。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我只想把這個留給我的智障猿腦兄弟們... 如果...\n如果你害怕，你就失去了信心....。我明白了\n\n還有... 去你的 你想上這個過山車，你買了你的。\n你想和大人物們一起玩，你猜怎麼着？現在我們在\n的...",
      "title": "你已經開始了，現在投入到他媽的遊戲中去吧。"
    }
  ],
  "title": "YOU STARTED THIS, NOW COMMIT TO THE FUCKING PLAY",
  "created_utc": 1612556828,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m just going to leave this here for my fellow retard ape brain brethren... If you&#39;ve lost confidence, if you&#39;re scared.... I understand</p>\n\n<p>Also... Fuck you. You wanted to get on this rollercoaster, you bought your ticket, you wanted to play with the big boys, guess what fucknuts? Now we&#39;re in the churn, so sack up, and commit to what you fucking started.</p>\n\n<p>Wall Street wins because they don&#39;t just go &quot;ah shit, I&#39;m down, guess I better give up and pay out&quot;, fuck no, they&#39;re animals, they will go to whatever length necessary to win. So cut that defeatism shit out, don&#39;t take the L like a bitch, re-evaluate and fight the fuck back.</p>\n\n<p>Was the original DD and thesis good? Yes? Then carry the fuck on.</p>\n\n<p>Did we get the rug pulled out? Yes? Then fucking pivot</p>\n\n<p>Did we pivot successfully to new brokerages? Yes? Then fucking attack!</p>\n\n<p>Remember you asked for this, now see it through. I am with you, millions of retards just like you ARE WITH YOU. So let&#39;s go fucking get it!</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>Edit: No advice, just retard, rocket moon, yada yada yada yada. One thing that is legit though, don&#39;t take out a fucking loan. This is a high risk play, don&#39;t bet anything you can&#39;t lose. I&#39;m risking what I can lose because I believe. This shit is the real deal, don&#39;t fuck up your life over FOMO. Now let&#39;s GET IT!</p>\n</div><!-- SC_ON -->",
  "score": 15348,
  "permalink": "/r/wallstreetbets/comments/ldbp0z/you_started_this_now_commit_to_the_fucking_play/",
  "subreddit": "wallstreetbets",
  "id": "ldbp0z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123211366
}