{
  "author": "stitt1337",
  "original_created_utc": 1639931587,
  "title": "LRC + GME Announcement?",
  "created_utc": 1639949598,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;At the end of November when the markets were pumping, we all heard about the potential LRC and GME announcement that was going to be coming in late Q4/December. Well, the time is almost up and LRC has continued a downward trend while MATIC has only seen upward trends. Both are layer 2 solutions and with all the good news surrounding Polygon lately that isn’t riding on just hype/a possible announcement, how are you all feeling in regards to LRC and MATIC? I’m hoping that we actually see a LRC announcement before EOY so that I can determine which layer 2 solution to fully invest in, instead of having split investments.&lt;/p&gt;\n\n&lt;p&gt;EDIT: Thank you to everyone who has contributed to this discussion.  I didn’t expect this many people to contribute. Reading over most comments I realize that I still have much to learn and research. Still a crypto noob.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 173,
  "permalink": "/r/CryptoCurrency/comments/rk08t0/lrc_gme_announcement/",
  "subreddit": "CryptoCurrency",
  "id": "rk08t0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "At the end of November when the markets were pumping, we all heard about the\npotential LRC and GME announcement that was going to be coming in late\nQ4/December. Well, the time is almost up and LRC has continued a downward trend\nwhile MATIC has only seen upward trends. Both are layer 2 solutions and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "11月末、市場が活況を呈していた頃、私たちは皆、次のような話を耳にしました。\nLRCとGMEの発表の可能性がある。\n第4四半期から12月にかけて。さて、もうすぐその時期がやってきますが、LRCは下落傾向が続いています。\n一方、MATICは上昇傾向にあるのみです。どちらもレイヤー2ソリューションであり、...",
      "title": "LRC＋GME発表？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在11月底，当市场被打压的时候，我们都听说了关于LRC和GME的潜在公告。\n潜在的LRC和GME公告，将在第四季度末/12月到来。\n第四季度/12月。好了，时间快到了，LRC继续呈下降趋势\n而MATIC只看到上升的趋势。两者都是第二层的解决方案，而且...",
      "title": "LRC + GME公告？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在11月底，當市場被打壓的時候，我們都聽說了關於LRC和GME的潛在公告。\n潛在的LRC和GME公告，將在第四季度末/12月到來。\n第四季度/12月。好了，時間快到了，LRC繼續呈下降趨勢\n而MATIC只看到上升的趨勢。兩者都是第二層的解決方案，而且...",
      "title": "LRC + GME公告？"
    }
  ]
}