{
  "author": "rrdonoo",
  "the_new_excerpt": "https://news.bloomberglaw.com/tech-and-telecom-law/softbank-says-unaware-of-sec-probe-into-securities-trading\n\nOn Wednesday, short seller research site PlainSite posted a letter from the\nSecurities and Exchange Commission on Twitter revealing that the agency is\ninvestigating SoftBank, the Japanese…",
  "original_created_utc": 1616645951,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "https://news.bloomberglaw.com/tech-and-telecom-law/softbank-says-unaware-of-sec-probe-into-securities-trading\n\n周三，做空者研究网站PlainSite发布了一封来自。\n证券交易委员会在推特上透露，该机构正在。\n调查软银，日本...",
      "title": "美国证券交易委员会确认正在调查软银的市场操纵行为。软银在美国科技市场花费了价值170亿美元的股票，另有34亿美元的赌注来支撑其价格。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "https://news.bloomberglaw.com/tech-and-telecom-law/softbank-says-unaware-of-sec-probe-into-securities-trading\n\n週三，做空者研究網站PlainSite發佈了一封來自。\n證券交易委員會在推特上透露，該機構正在。\n調查軟銀，日本...",
      "title": "美國證券交易委員會確認正在調查軟銀的市場操縱行爲。軟銀在美國科技市場花費了價值170億美元的股票，另有34億美元的賭注來支撐其價格。"
    }
  ],
  "title": "The SEC confirms it is investigating SoftBank for market manipulation. Softbank spent $17B worth of shares in the US tech market, with another $3.4B in bets to prop up their prices.",
  "created_utc": 1616650778,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://news.bloomberglaw.com/tech-and-telecom-law/softbank-says-unaware-of-sec-probe-into-securities-trading\">https://news.bloomberglaw.com/tech-and-telecom-law/softbank-says-unaware-of-sec-probe-into-securities-trading</a></p>\n\n<p>On Wednesday, short seller research site PlainSite posted a letter from the Securities and Exchange Commission on Twitter revealing that the agency is investigating SoftBank, the Japanese telecommunications company and investing giant notorious for financing various unprofitable “technology” companies like WeWork, Uber, Compass, and Oyo.</p>\n\n<p>Aaron Greenspan, founder of the Think Computer Foundation that runs Plainsite, filed a FOIA request in December 2020 for &quot;any investigative materials [from January 1, 2018 to the present] pertaining to the various SoftBank companies controlled by Masayoshi Son, specifically relating to SoftBank&#39;s trading of stocks and derivatives on those stocks.&quot;</p>\n\n<p>This request was filed in response to the revelation last fall that SoftBank was the &quot;Nasdaq whale.” SoftBank was responsible for stoking a huge rally in tech stocks, the Financial Times reported, because around August it began buying billions of dollars worth of call options in a shift for the company, fueling a rally that pushed up the share prices of tech companies it held billions of dollars of equity in.</p>\n\n<p>Thanks in large part to a rally sparked by SoftBank’s high-risk market plays, firms like Tesla and Apple were up 74 and 21 percent, respectively, in the month of August alone. Executed through a small desk of traders and chief executive Masayoshi Son himself, the trading unit―named SB Northstar―and its bets won the company some $4 billion in gains at the beginning of September, before quickly melting away into nearly $3 billion in losses by the end of the month.</p>\n\n<p>In a January letter responding to Greenspan’s initial request, and months after the reporting on Softbank became public, the SEC said that its search did not turn up any relevant records. Greenspan appealed the decision on March 9 and two weeks later received a letter saying that responsive records were identified, but they could not be released under legal provisions that cover ongoing investigations.</p>\n\n<p>“We have confirmed with Division of Enforcement staff that the investigation from which you seek records is still active and ongoing,” the SEC letter stated.</p>\n\n<p>According to the letter, the SEC maintains that releasing the records “could cause harm to the active and ongoing enforcement proceedings because, among other things, individuals and entities of interest in the underlying investigation could fabricate evidence, influence witness testimony and/or destroy or alter certain documents,” in addition to revealing cooperating witnesses and the general scope of the investigation.</p>\n\n<p>The debatable merits of the SEC’s denial aside, an investigation into Softbank may indicate that its risky trading strategy is catching up to the giant. SoftBank unwound its Nasdaq derivative positions by December 2020 after investors questioned its &quot;controversial strategy&quot; which could&#39;ve lost the company billions more. The last look at SB Northstar&#39;s books at the end of September showed that it had bought about $17 billion worth of shares in the US tech market, with another $3.4 billion in bets to prop up their prices.</p>\n\n<p>SoftBank did not immediately respond to Motherboard’s request for comment. The SEC declined to comment.</p>\n</div><!-- SC_ON -->",
  "score": 3288,
  "permalink": "/r/investing/comments/mcpqqp/the_sec_confirms_it_is_investigating_softbank_for/",
  "subreddit": "investing",
  "id": "mcpqqp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752819542
}