{
  "author": "ThrowRA0049",
  "original_created_utc": 1659347467,
  "title": "Is it okay for a guy to pay me to clean my house?",
  "created_utc": 1659380244,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So for some context, I (f19) live with my friend (f19). She’s a financial dominatrix which means people just give her money but she has one client who wants to clean her house. She checked with me first and we met the guy beforehand and he came with a reference from another dominatrix so it was fine. &lt;/p&gt;\n\n&lt;p&gt;But it’s been happening for a few weeks now and it is just such a strange dynamic like this guy who’s a professional lawyer pays our rent just so he can clean our house. He’s a super sweet dude and we’re just like telling him to clean? &lt;/p&gt;\n\n&lt;p&gt;We had a party on Saturday and it got messy and one of our bathrooms was just so gross but my first response was just “eh the guy will take of it” and then it occurred to me that what a crazy thing that was and the even crazier thing was that he did it! He spent a whole day cleaning while we were just hungover and I was like ??? &lt;/p&gt;\n\n&lt;p&gt;So is like is this okay? Is it wrong that I’m happy with this?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 116,
  "permalink": "/r/TooAfraidToAsk/comments/wddeww/is_it_okay_for_a_guy_to_pay_me_to_clean_my_house/",
  "subreddit": "TooAfraidToAsk",
  "id": "wddeww",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So for some context, I (f19) live with my friend (f19). She’s a financial\ndominatrix which means people just give her money but she has one client who\nwants to clean her house. She checked with me first and we met the guy\nbeforehand and he came with a reference from another dominatrix so it was…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ということで、少し文脈を変えて、私（f19）は友人（f19）と同居しています。彼女は経済的な\nドミネーターで、人々は彼女にお金を渡します。\n家を掃除してほしいという依頼がありました。彼女はまず私に確認し、私たちはその人に会いました。\nその人は他の女王様の紹介で来たんだけど...",
      "title": "男が金を払って家を掃除するのはいいのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，为了了解一些情况，我（f19）和我的朋友（f19）住在一起。她是一个金融\n这意味着人们只是给她钱，但她有一个客户想为她打扫房子。\n想打扫她的房子。她先跟我确认了一下，我们事先见过那个人。\n而且他有另一个支配者的推荐信，所以是......。",
      "title": "一个人花钱让我打扫房子，可以吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，爲了瞭解一些情況，我（f19）和我的朋友（f19）住在一起。她是一個金融\n這意味着人們只是給她錢，但她有一個客戶想爲她打掃房子。\n想打掃她的房子。她先跟我確認了一下，我們事先見過那個人。\n而且他有另一個支配者的推薦信，所以是......。",
      "title": "一個人花錢讓我打掃房子，可以嗎？"
    }
  ]
}