{
  "author": "bravolimawhiskey",
  "original_created_utc": 1638230595,
  "title": "It's OK to be into Crypto for the tech. It's OK to be into Crypto for money to buy a house, a lambo or pay your debts. It's not OK for either group to shit on the other.",
  "created_utc": 1638239983,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I keep seeing posts like &quot;Well I&#39;M into Crypto for the tech&quot; or &quot;Yeah, well, I&#39;m into it for the money babyyyyy&quot; every other day and there&#39;s always some entitlement that comes with the claim. It&#39;s fine either way, you do you, no need to act like you are enlightened for your choices. Either way, more people are getting into this community, which is what all of us should strive for (mass adoption and all). Gatekeeping won&#39;t do us any favors, be nice to newbies and unite as a community against the real enemies and be glad to be a part of something amazing so early (which we still are). Cheers!</p>\n</div><!-- SC_ON -->",
  "score": 503,
  "permalink": "/r/CryptoCurrency/comments/r59g8z/its_ok_to_be_into_crypto_for_the_tech_its_ok_to/",
  "subreddit": "CryptoCurrency",
  "id": "r59g8z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I keep seeing posts like \"Well I'M into Crypto for the tech\" or \"Yeah, well, I'm\ninto it for the money babyyyyy\" every other day and there's always some\nentitlement that comes with the claim. It's fine either way, you do you, no need\nto act like you are enlightened for your choices. Either way, more…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は技術のためにCryptoをやっている」とか「ああ、そうだね、技術のためにやっているんだ」といった投稿をよく目にします。\nお金のためにやっているんだ」といった投稿を毎日のように目にしますが、そこには必ずと言っていいほ\nその主張には必ずと言っていいほど権利が伴います。どちらでも構いません、あなたはあなたで。\n自分の選択で悟りを開いたように振る舞う必要はありません。どちらにしても、もっと...",
      "title": "技術のためにCryptoに夢中になるのは構いません。家やランボを買ったり、借金を返したりするために暗号に夢中になるのもいいでしょう。どちらかのグループがもう一方のグループを非難するのはよくありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直看到类似 \"我是为了技术而进入加密货币 \"或 \"是的，我是为了钱而进入加密货币 \"这样的帖子。\n是的，我是为了钱，宝贝，\"每隔一天，总是有一些\n伴随着这种说法而来的权利。无论哪种方式都很好，你做你的，没有必要\n没有必要表现得好像你的选择是开明的。无论哪种方式，更...",
      "title": "为了技术而进入加密货币是可以的。为了买房、买兰博或还债而进入加密货币是可以的。这两类人中的任何一类人都不应该在另一类人身上拉屎。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直看到類似 \"我是爲了技術而進入加密貨幣 \"或 \"是的，我是爲了錢而進入加密貨幣 \"這樣的帖子。\n是的，我是爲了錢，寶貝，\"每隔一天，總是有一些\n伴隨着這種說法而來的權利。無論哪種方式都很好，你做你的，沒有必要\n沒有必要表現得好像你的選擇是開明的。無論哪種方式，更...",
      "title": "爲了技術而進入加密貨幣是可以的。爲了買房、買蘭博或還債而進入加密貨幣是可以的。這兩類人中的任何一類人都不應該在另一類人身上拉屎。"
    }
  ]
}