{
  "author": "Acceptable_Novel8200",
  "original_created_utc": 1633331868,
  "title": "Pandora Papers: 12 million documents,35 current and former leaders,more than 3000 public officials did illegal transactions! But Crypto is bad for us people!",
  "created_utc": 1633340142,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Some 35 current and former leaders and more than 300 public officials are featured in the files from offshore companies, dubbed the Pandora Papers.</p>\n\n<p>*Ex UK PM Tony Blair and his wife saved 312,000 pounds in Stamp duty when they bought a London office,they bought an offshore firm that owned the building.</p>\n\n<p>*Russian President Vladimir Putin&#39;s secret assets in Monaco</p>\n\n<p>*Czech  PM Andrej Babis failed to declare an offshore investment company used to purchase two villas for 12million pounds in the south of France </p>\n\n<p>*Kenya President Uhuru Kenyatta and six members of his family secretly owned a network of offshore companies. They have been linked to 11 firms - one of which was valued as holding assets of $30m</p>\n\n<ul>\n<li>Members of Pakistan Prime Minister Imran Khan&#39;s inner circle, including cabinet ministers and their families, secretly own companies and trusts holding millions of dollars</li>\n</ul>\n\n<p>The law firm founded by President Nicos Anastasiades of Cyprus appears to have provided fake owners to disguise the real owner of a series of offshore companies - a former Russian politician who had been accused of embezzlement. However, the law firm denies this</p>\n\n<p>Ukraine&#39;s President Volodymyr Zelensky transferred his stake in a secret offshore company just before he won the 2019 election</p>\n\n<p>Ecuador President Guillermo Lasso, a former banker, replaced a Panamanian foundation that made monthly payments to his close family members with a trust based in South Dakota in the US</p>\n\n<h1>The boy who owned a £33m London property</h1>\n\n<p>Mayfair building was sold to a front company in 2009</p>\n\n<p>Other documents show how Azerbaijan&#39;s ruling Aliyev family have secretly acquired UK property using offshore companies.</p>\n\n<p>The files show how the family - long accused of corruption in the European nation - bought 17 properties, including a £33m office block in London for the president&#39;s 11-year-old son Heydar Aliyev.</p>\n\n<p>The building in Mayfair was bought by a front company owned by a family friend of President Ilham Aliyev in 2009.</p>\n\n<p>It was transferred one month later to Hedyar.</p>\n\n<p>The research also reveals how another office block owned by the family nearby was sold to the Crown Estate for £66m in 2018.</p>\n\n<p>The Crown Estate said it carried out the checks required in law at the time of purchase but is now looking into the matter.</p>\n\n<p>The UK government says it is cracking down on money laundering with tougher laws and enforcement, and that it will introduce a register of offshore companies owning UK property when parliamentary time allows.</p>\n\n<p>The Pandora Papers is a leak of almost 12 million documents and files exposing the secret wealth and dealings of world leaders, politicians and billionaires. The data was obtained by the International Consortium of Investigative Journalists in Washington DC and has led to one of the biggest ever global investigations. More than 600 journalists from 117 countries have looked at the hidden fortunes of some of the most powerful people on the planet. BBC Panorama and the Guardian have led the investigation in the UK.</p>\n</div><!-- SC_ON -->",
  "score": 551,
  "permalink": "/r/CryptoCurrency/comments/q10jmq/pandora_papers_12_million_documents35_current_and/",
  "subreddit": "CryptoCurrency",
  "id": "q10jmq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Some 35 current and former leaders and more than 300 public officials are\nfeatured in the files from offshore companies, dubbed the Pandora Papers.\n\n*Ex UK PM Tony Blair and his wife saved 312,000 pounds in Stamp duty when they\nbought a London office,they bought an offshore firm that owned the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "約35人の現役および元リーダーと300人以上の公務員が\nパンドラ文書」と呼ばれるオフショア企業のファイルには、35人の現役リーダーと300人の公務員が登場します。\n\n*トニー・ブレア元英国首相とその妻は、ロンドンのオフィスを購入する際、印紙税を31万2千ポンド節約しました。\nトニー・ブレア元首相夫妻は、ロンドンのオフィスを購入する際に、そのオフィスを所有するオフショア企業を購入し、印紙税31万2000ポンドを節約しました。",
      "title": "パンドラ・ペーパーズ 1200万枚の文書、35人の現役・元リーダー、3000人以上の公務員が違法取引をしていた！？しかし、暗号は私たち人間にとって悪いものです"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大约35名现任和前任领导人以及300多名公职人员被列入离岸公司的档案中。\n在被称为 \"潘多拉文件 \"的离岸公司档案中，约有35名现任和前任领导人以及300多名公职人员被提及。\n\n*前英国首相托尼-布莱尔和他的妻子在购买伦敦办公室时节省了312,000英镑的印花税。\n他们购买了一个离岸公司，该公司拥有一个伦敦办公室。",
      "title": "潘多拉文件。1200万份文件,35位现任和前任领导人,3000多名公职人员做了非法交易! 但加密货币对我们这些人来说是不好的!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大約35名現任和前任領導人以及300多名公職人員被列入離岸公司的檔案中。\n在被稱爲 \"潘多拉文件 \"的離岸公司檔案中，約有35名現任和前任領導人以及300多名公職人員被提及。\n\n*前英國首相托尼-布萊爾和他的妻子在購買倫敦辦公室時節省了312,000英鎊的印花稅。\n他們購買了一個離岸公司，該公司擁有一個倫敦辦公室。",
      "title": "潘多拉文件。1200萬份文件,35位現任和前任領導人,3000多名公職人員做了非法交易! 但加密貨幣對我們這些人來說是不好的!"
    }
  ]
}