{
  "author": "TheBeast798",
  "original_created_utc": 1638062966,
  "title": "How does everyone deal with it?",
  "created_utc": 1638093411,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m just so floored by how well everyone deals with life, and deals with working. Like, I&#39;m barely working part time, and it just feels like so much of my time is being wasted where I&#39;m working. But then there&#39;s people who are full time who are perfectly happy, and even pick up extra hours and all that.</p>\n\n<p>Am I missing something here? Like, I understand the requirement for money and all that, but even then, I still feel like I&#39;d be miserable spending that much of my time at work. I despise being at work, and I feel like full-time hours would mentally drain me.</p>\n\n<p>Any toxic or rude comments will be blocked.</p>\n</div><!-- SC_ON -->",
  "score": 109,
  "permalink": "/r/NoStupidQuestions/comments/r3sdi2/how_does_everyone_deal_with_it/",
  "subreddit": "NoStupidQuestions",
  "id": "r3sdi2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm just so floored by how well everyone deals with life, and deals with\nworking. Like, I'm barely working part time, and it just feels like so much of\nmy time is being wasted where I'm working. But then there's people who are full\ntime who are perfectly happy, and even pick up extra hours and all…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さんがいかに上手に人生や仕事と向き合っているかに驚かされています。\n働いています。私はやっとパートタイムで働いているのですが、働いているところでは時間を無駄にしているように感じます。\n時間を無駄にしているような気がします。でも、フルタイムで働いている人の中には\nでも、フルタイムで働いている人の中には、完全に満足している人もいるし、時間を延長したりしている人もいる...。",
      "title": "皆さんはどのように対処していますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我只是对每个人都能很好地处理生活和工作问题感到惊讶。\n工作。就像，我勉强在做兼职工作，但感觉就像我的很多时间被浪费在我工作的地方。\n我的时间在我工作的地方被浪费了。但也有一些人是全职的\n但有的人是全职的，他们非常开心，甚至还拿起了额外的时间和所有......",
      "title": "大家是如何处理的呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我只是對每個人都能很好地處理生活和工作問題感到驚訝。\n工作。就像，我勉強在做兼職工作，但感覺就像我的很多時間被浪費在我工作的地方。\n我的時間在我工作的地方被浪費了。但也有一些人是全職的\n但有的人是全職的，他們非常開心，甚至還拿起了額外的時間和所有......",
      "title": "大家是如何處理的呢？"
    }
  ]
}