{
  "author": "pimpingprincess",
  "the_new_excerpt": "I’m black and I know i’m going to get a lot of shit but I need someone else’s\nopinion on this. I’m from the hood and i know people from the hood basically\nmajority of the fucking city and everyone says the N word. and i know it’s not\nmeant to be derogatory although, it is a derogatory term. it’s…",
  "original_created_utc": 1622177472,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は黒人で、多くの非難を浴びることになると思いますが、誰か他の人の意見が必要です。\n意見を聞かせてください。俺はフード出身で、フード出身者をよく知っている。\n街の大部分を占めていて、誰もがNワードを言う。\n軽蔑的な意味ではないが 軽蔑的な言葉ではある...",
      "title": "白人がNワードを言っても気にならないのは悪いことか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是黑人，我知道我将会得到很多狗屎，但我需要别人的\n的意见。我是来自兜帽区的，我知道兜帽区的人基本上都来自兜帽区。\n这座城市的大多数人都会说N字。\n我知道这不是一个贬义词，尽管它是一个贬义词，它...",
      "title": "我不为白人说 \"N \"字而烦恼，这很糟糕吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是黑人，我知道我將會得到很多狗屎，但我需要別人的\n的意見。我是來自兜帽區的，我知道兜帽區的人基本上都來自兜帽區。\n這座城市的大多數人都會說N字。\n我知道這不是一個貶義詞，儘管它是一個貶義詞，它...",
      "title": "我不爲白人說 \"N \"字而煩惱，這很糟糕嗎？"
    }
  ],
  "title": "Is it bad that i’m not bothered by white people saying the N word?",
  "created_utc": 1622207362,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m black and I know i’m going to get a lot of shit but I need someone else’s opinion on this. I’m from the hood and i know people from the hood basically majority of the fucking city and everyone says the N word. and i know it’s not meant to be derogatory although,  it is a derogatory term. it’s basically another word for bro or dude from where i’m from. It’s different in the south i’m sure.. but being from the city they say it like nothing and i don’t have a problem with it and neither does any other black person they’re around. Unless they’re calling me the N word out of anger/ using the heavy ER at the end of it then it’s a problem i suppose but i’ve never been called the n word before as an insult. And if it’s not such a nice word for other races to use it why are we (black people and I) allowed to say it and call each other that if it’s really that bad?</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/TooAfraidToAsk/comments/nmq370/is_it_bad_that_im_not_bothered_by_white_people/",
  "subreddit": "TooAfraidToAsk",
  "id": "nmq370",
  "is_self": true,
  "media": null,
  "is_video": false
}