{
  "author": "KillingSQUIDSisGAY",
  "original_created_utc": 1660215193,
  "title": "I'm really embarrassed to ask this so please don't judge. (Sex education)",
  "created_utc": 1660241968,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I graduated Highschool in 2022 and haven&amp;#39;t had sex education since I was 10. I went to christian special needs school because my disabilities and CPTSD didn&amp;#39;t allow to function in public school my city school district paid for the private school I attended and my experience there is kindly irrelevant to my question. Sex education wasn&amp;#39;t allowed because of faith elements of the School and not because the students were unable to handle it. This isn&amp;#39;t a criticism of Christianity just me stating my experience at a particular christian orginzation . Where do I get this kind of education post high school?  I think it&amp;#39;s important to know for many reasons.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/NoStupidQuestions/comments/wlohaf/im_really_embarrassed_to_ask_this_so_please_dont/",
  "subreddit": "NoStupidQuestions",
  "id": "wlohaf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "I graduated Highschool in 2022 and haven't had sex education since I was 10. I\nwent to christian special needs school because my disabilities and CPTSD didn't\nallow to function in public school my city school district paid for the private\nschool I attended and my experience there is kindly…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は2022年に高校を卒業しましたが、10歳の時から性教育を受けていません。I\nので、キリスト教の特別支援学校に通いました。\n公立の学校では機能しないので、市の学区が私立学校の費用を負担してくれました。\n私の通っていた私立学校での経験は、親切なものです。",
      "title": "こんなこと聞くのは本当に恥ずかしいので、批判しないでください。(性教育)"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我于2022年高中毕业，从10岁起就没有接受过性教育。I\n我去了基督教的特殊需要学校，因为我的残疾和CPTSD不允许\n因为我的残疾和CPTSD不允许在公立学校学习，我所在的城市学区为我的私立学校支付了费用。\n我的城市学区支付了我参加的私立学校，我在那里的经历是亲切的......",
      "title": "我真的很不好意思问这个问题，所以请不要评判。(性教育)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我於2022年高中畢業，從10歲起就沒有接受過性教育。I\n我去了基督教的特殊需要學校，因爲我的殘疾和CPTSD不允許\n因爲我的殘疾和CPTSD不允許在公立學校學習，我所在的城市學區爲我的私立學校支付了費用。\n我的城市學區支付了我參加的私立學校，我在那裏的經歷是親切的......",
      "title": "我真的很不好意思問這個問題，所以請不要評判。(性教育)"
    }
  ]
}