{
  "author": "Joeman720",
  "the_new_excerpt": "So I am really starting to get into philosophy, as I am currently taking a\nmodern philosophy course. The problem however, is i am getting roped in to each\nphilosophers beliefs once I read them, even though my philosophy teacher has\nshown the blatant issues he sees with them. For example, we read…",
  "original_created_utc": 1612899468,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "所以我真的开始接触哲学了，因为我现在正在考研。\n现代哲学课程。然而，问题是我被卷入到每一个。\n哲学家的信仰，我一读就懂，尽管我的哲学老师已经。\n显示了他所看到的公然的问题。例如，我们读...",
      "title": "如何才能读懂哲学家，而不被他们的信仰所迷惑？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我真的開始接觸哲學了，因爲我現在正在考研。\n現代哲學課程。然而，問題是我被捲入到每一個。\n哲學家的信仰，我一讀就懂，儘管我的哲學老師已經。\n顯示了他所看到的公然的問題。例如，我們讀...",
      "title": "如何才能讀懂哲學家，而不被他們的信仰所迷惑？"
    }
  ],
  "title": "How can I read philosophers without getting roped in to their beliefs?",
  "created_utc": 1612926626,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I am really starting to get into philosophy, as I am currently taking a modern philosophy course. The problem however, is i am getting roped in to each philosophers beliefs once I read them, even though my philosophy teacher has shown the blatant issues he sees with them. For example, we read about Rousseau and Hobbes, and at first I got a long nicely with hobbes, then I started to get along with Rousseau. My professor then went and showed how both are wrong in a lot of ways  (right in others) while pointing at the current modern day evidence that we have of earlier humans. The problem i found in that example and other philosophers is that when I was reading them, I was falling into their line of thinking. Not to say I didn&#39;t have issues with what they said, but their overarching point I was starting to believe. Another trap that I notice a lot of people fall into when reading philosophers is that they believe them when they agree with their worldviews. Like how a libertarian would fall for Locke or how a Communist would fall for Rousseau. I am a bit irrational in that I want to find the inherent truths through philosophy and science even if it seems they are wrong overtime. I want to fall for philosophers that are closer to the truth then others, whom seem to have a better understanding of our world then others. But I am so dumb in that I fall for the wrong philosophers constantly and dont use my intelligence and my understanding of philosophers/philosophy to see the issues of philosophers I like with my own mind instead of relying on those smarter then me. I dont know, some advice would be great, I really want to get into this subject while not losing my grip on reality (if I ever had one)</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/askphilosophy/comments/lgbgqz/how_can_i_read_philosophers_without_getting_roped/",
  "subreddit": "askphilosophy",
  "id": "lgbgqz",
  "is_self": true,
  "media": null,
  "is_video": false
}