{
  "author": "Tux_fan",
  "original_created_utc": 1632194203,
  "title": "I’m from El Salvador… UPDATE 2",
  "created_utc": 1632223815,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h1>Hi, it’s been a while since my last post so I want to give everyone an update adding also my personal perception on how things are going.</h1>\n\n<p>To begin with, chivo app (official wallet) haven’t been fully released to all android phones although it’s just a matter of time.</p>\n\n<p>Here’s a recent <a href=\"https://twitter.com/nayibbukele/status/1440033171009982475\">tweet</a> from president Bukele saying 1.6M Salvadorans are alredy using chivo app.</p>\n\n<p>Bukele also <a href=\"https://twitter.com/nayibbukele/status/1438711414064128005\">tweet</a> that chivo app is 100% functional, however there are still many issues to be solved.</p>\n\n<ul>\n<li>UX design problem, lightning network (LN) is hidden. (<a href=\"https://imgur.com/a/3d9S3D1\">See here some screenshots</a>)\n\n<ul>\n<li>Most people don’t know the differences between Layer 1 (L1) and LN, they just tap “receive” and show you either the USD or Bitcoin qr code.</li>\n<li>Transaction in LN are ok.</li>\n<li>L1 transactions between chivo’s app are ok.</li>\n<li><em>L1 transactions from chivo app to other wallets (Trust, Exodus, etc.) takes</em> <strong><em>days</em></strong> <em>to arrive.</em>\n\n<ul>\n<li>I send a $2.00 transaction on sept. 8 (the same transaction I talked about in my last post) to my exodus wallet, today’s sept. 20 and I haven’t received it yet. From my personal perspective, this is the most common problem people post on social media, and since the money do not arrive, many have pay in USD, meaning they’re actually paying double.</li>\n</ul></li>\n</ul></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>The USD qr code shows personal information. By using a qr scanner you can read the person DUI (Salvadoran ID) and full name.\n\n<ul>\n<li>There are people who post their qr codes as a joke towards the anti-bitcoin “if you don’t want the $30 then send it here”, many advise them to delete their post since anyone can see their data but they either don’t mind or don’t understand what’s the problem.</li>\n<li><a href=\"https://twitter.com/JoseValdezSV/status/1439426897981677568\">Here’s a code</a>, try scanning it with whatever qr code scanner you want. This guy is a government worker so his information is public anyways.</li>\n</ul></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>There are issues withdrawing money from chivo app to a bank account (Note that first you need to convert btc to USD to use this feature). Sometimes it works fine others don’t.</li>\n<li>Some random log out.</li>\n<li>There are moments you can’t make transactions, probably due to server problems since new devices are been added.</li>\n<li>Some people report not being able to send money from Chivo website using credit cards from Banco Agricola (Local Bank) and Chase.</li>\n<li>Chivo atm can be used with any wallet. (<a href=\"https://twitter.com/MarcFalzon/status/1439597651377414149\">Video by Marc Falzon</a>)</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p><strong>Now some insights about the general environment that is lived.</strong></p>\n\n<p>Chivo’s atm are crowded almost all day. People are waiting in lines and asking for guidance, however (this is my perspective) most of them just want to withdraw the $30 bonus. Only a minority is using it to withdraw remittances or using it with other purposes.</p>\n\n<p>Since most atms are crowded, many people are buying the $30 bonus btc for only $25.</p>\n\n<p>Let me explain (Please note that I’m not saying this is what most people are doing. It’s just a commonly seen phenomenon), you register in chivo app and get the $30 bonus, you want to withdraw that money to have cash. In order to do this, first you need to send the $30 to other chivo app and then re-send it to yourself to be able to withdraw it from the atm. Then you look for an atm to find it is crowded. To avoid all this hassle there are people who gives you immediately $25 cash and you send your bonus btc. This type of “business” is happening in many places. Almost all of my neighborhood has actually sold their bonus btc for $25.</p>\n\n<p>Aside the number of downloads shown in the stores, there are no other official data… not really sure if people are actually using the wallet after getting the $30.</p>\n\n<p>It might take a while to actually see if people use btc or ditch it away. There are no education programs about btc from the government aside teaching you how to use chivo app.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Now let me ask you a question and get the discussion start.</strong></p>\n\n<p>How is btc better than USD in a daily basis? Taking in consideration that many families have zero savings and live with what they earn daily or with a weekly/monthly paycheck. How are families supposed to get advantage of btc raise in price if they can’t hold them for more than a month?</p>\n\n<p>At the moment, no one seems to have the answer. This is the dilemma of many low income families who are willing to give btc a try.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p><strong><em>PD: For the people who message me, I&#39;ll try to reply this week, apologies for the delay.</em></strong></p>\n</div><!-- SC_ON -->",
  "score": 162,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/4BDrs78Z0tEAPMgwHsTjCrKY57crp-h43ehAgGbdMuc.jpg?auto=webp&s=c12d84fefab48ab07736c3c62e99e860c2466176",
          "width": 1770,
          "height": 2757
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/4BDrs78Z0tEAPMgwHsTjCrKY57crp-h43ehAgGbdMuc.jpg?width=108&crop=smart&auto=webp&s=8441cf811436ce083de1d1b102f4fd607141de9e",
            "width": 108,
            "height": 168
          },
          {
            "url": "https://external-preview.redd.it/4BDrs78Z0tEAPMgwHsTjCrKY57crp-h43ehAgGbdMuc.jpg?width=216&crop=smart&auto=webp&s=900b916f4466dfc15e41fd61ac728a5531cafd3b",
            "width": 216,
            "height": 336
          },
          {
            "url": "https://external-preview.redd.it/4BDrs78Z0tEAPMgwHsTjCrKY57crp-h43ehAgGbdMuc.jpg?width=320&crop=smart&auto=webp&s=47b32c06e6f68bd3d8c42b210f46ab05bde2e6ca",
            "width": 320,
            "height": 498
          },
          {
            "url": "https://external-preview.redd.it/4BDrs78Z0tEAPMgwHsTjCrKY57crp-h43ehAgGbdMuc.jpg?width=640&crop=smart&auto=webp&s=434232607cc37021ca686efb3459573cc4771505",
            "width": 640,
            "height": 996
          },
          {
            "url": "https://external-preview.redd.it/4BDrs78Z0tEAPMgwHsTjCrKY57crp-h43ehAgGbdMuc.jpg?width=960&crop=smart&auto=webp&s=8be98fa9ba566cdd5305e8ca4c4434e92862cffa",
            "width": 960,
            "height": 1495
          },
          {
            "url": "https://external-preview.redd.it/4BDrs78Z0tEAPMgwHsTjCrKY57crp-h43ehAgGbdMuc.jpg?width=1080&crop=smart&auto=webp&s=9d4a2d58851c25d39d00b4e8e092a27ddb766ff3",
            "width": 1080,
            "height": 1682
          }
        ],
        "variants": {},
        "id": "T3uzMHFB557ZEfb2NIYCQBL-Dr_uEYG1SW3ntvPb_Rk"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/Bitcoin/comments/psab55/im_from_el_salvador_update_2/",
  "subreddit": "Bitcoin",
  "id": "psab55",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "HI, IT’S BEEN A WHILE SINCE MY LAST POST SO I WANT TO GIVE EVERYONE AN UPDATE\nADDING ALSO MY PERSONAL PERCEPTION ON HOW THINGS ARE GOING.\n\nTo begin with, chivo app (official wallet) haven’t been fully released to all\nandroid phones although it’s just a matter of time.\n\nHere’s a recent…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "前回の投稿からしばらく経ってしまったので、皆さんに最新情報をお伝えしたいと思います。\n私の個人的な見解も含めて、状況をお伝えしたいと思います。\n\nまず、chivoアプリ（公式ウォレット）はすべてのアンドロイド携帯に完全にはリリースされていません。\n時間の問題ではありますが、すべてのアンドロイド携帯には完全にリリースされていません。\n\nこれは最近の...",
      "title": "エルサルバドルから来ました... UPDATE 2"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嗨，距离我上次发帖已经有一段时间了，所以我想给大家介绍一下最新情况。\n同时也加入我个人对事情发展的看法。\n\n首先，Chivo应用程序（官方钱包）还没有完全发布到所有的\n安卓手机，尽管这只是时间问题。\n\n这里有一个最近的...",
      "title": "我来自萨尔瓦多...更新2"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嗨，距離我上次發帖已經有一段時間了，所以我想給大家介紹一下最新情況。\n同時也加入我個人對事情發展的看法。\n\n首先，Chivo應用程序（官方錢包）還沒有完全發佈到所有的\n安卓手機，儘管這只是時間問題。\n\n這裏有一個最近的...",
      "title": "我來自薩爾瓦多...更新2"
    }
  ]
}