{
  "author": "Horizon0D",
  "original_created_utc": 1652295054,
  "title": "There is 0% chance that 98% drop was caused by retail selling. This is a coordinated attack.",
  "created_utc": 1652309027,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;First of all, I am thankfully not invested in TerraLuna. My heart goes out to everyone impacted by the price drop and I hope you seek the necessary help. Nothing is worth losing your life over. &lt;/p&gt;\n\n&lt;p&gt;Terra&amp;#39;s market dropped from 6.7 billion USD to 790 million USD in 24 hours. Do people seriously think that this sharp decline in price can be tied to retail dumping billions in a matter of hours? Bullshit. &lt;/p&gt;\n\n&lt;p&gt;Few whales got together and exploited the mistake on Terras part, eventually wiping out retail money for their own profit. There is no evidence yet as it is too soon to be 100% sure, but there are many theories about potential exploits and some people have been warning in the past about it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 896,
  "permalink": "/r/CryptoCurrency/comments/ungzko/there_is_0_chance_that_98_drop_was_caused_by/",
  "subreddit": "CryptoCurrency",
  "id": "ungzko",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "First of all, I am thankfully not invested in TerraLuna. My heart goes out to\neveryone impacted by the price drop and I hope you seek the necessary help.\nNothing is worth losing your life over.\n\nTerra's market dropped from 6.7 billion USD to 790 million USD in 24 hours. Do\npeople seriously think…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "まず、ありがたいことに私はTerraLunaに投資していません。価格下落の影響を受けた皆さんには、心よりお見舞い申し上げます。\nそして、必要な助けを求めることを望みます。\n人生を棒に振るほどのことはないのです。\n\nTerraの市場は24時間で67億ドルから7億9000万ドルに下落した。みんな\n人々は真剣に考え...",
      "title": "98%の下落が小売の販売によるものである可能性は0%です。これは組織的な攻撃なのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "首先，庆幸的是我没有在TerraLuna投资。我的心是向\n我对每一个受价格下跌影响的人表示同情，我希望你能寻求必要的帮助。\n没有什么值得你为之失去生命。\n\nTerra的市场在24小时内从67亿美元跌至7.9亿美元。是否\n人们真的以为...",
      "title": "98%的下跌是由零售销售造成的，这种可能性为0。这是一次协调的攻击。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，慶幸的是我沒有在TerraLuna投資。我的心是向\n我對每一個受價格下跌影響的人表示同情，我希望你能尋求必要的幫助。\n沒有什麼值得你爲之失去生命。\n\nTerra的市場在24小時內從67億美元跌至7.9億美元。是否\n人們真的以爲...",
      "title": "98%的下跌是由零售銷售造成的，這種可能性爲0。這是一次協調的攻擊。"
    }
  ]
}