{
  "author": "Jadonblade",
  "the_new_excerpt": "Across 7000+ coins and 463 exchanges! - Not only is the growth truly amazing,\nthe size and variety of the marketplace is also growing massively. BTC slowly\nlosing dominance (but still growing in its own right) I think is a great sign of\na maturing market that is becoming more independent from its…",
  "original_created_utc": 1620297639,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "7000以上のコインと463の取引所を越えて! - 驚くべき成長を遂げているだけでなく\n市場の規模や種類も膨大に増えています。BTCが徐々に\nBTCが徐々に優位性を失ってきているのは（それでも独自に成長していますが）、市場が成熟してきていることを示す素晴らしい兆候だと思います。\nこれは、市場が成熟し、その市場から独立しつつあることを示していると思います...。",
      "title": "暗号の時価総額はちょうど$2.5Tに達し、BTCが43.5%、ETHが16.3%を占めています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "跨越7000多个硬币和463个交易所! - 不仅增长速度确实惊人。\n市场的规模和种类也在大规模增长。BTC慢慢\n逐渐失去主导地位（但其本身仍在增长），我认为这是一个伟大的迹象，表明\n我认为这是一个成熟的市场的伟大标志，它正变得更加独立于其自身。",
      "title": "加密货币市值刚刚达到2.5T，BTC占主导地位43.5%，ETH占16.3"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "跨越7000多個硬幣和463個交易所! - 不僅增長速度確實驚人。\n市場的規模和種類也在大規模增長。BTC慢慢\n逐漸失去主導地位（但其本身仍在增長），我認爲這是一個偉大的跡象，表明\n我認爲這是一個成熟的市場的偉大標誌，它正變得更加獨立於其自身。",
      "title": "加密貨幣市值剛剛達到2.5T，BTC占主導地位43.5%，ETH佔16.3"
    }
  ],
  "title": "Crypto market cap just hit $2.5T, BTC dominance 43.5%, ETH 16.3%",
  "created_utc": 1620315890,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Across 7000+ coins and 463 exchanges! - Not only is the growth truly amazing, the size and variety of the marketplace is also growing massively. BTC slowly losing dominance (but still growing in its own right) I think is a great sign of a maturing market that is becoming more independent from its most well known and largest coin. </p>\n\n<p>My personal opinion is that we will see ETH climb to 20% in the near future, and that this year will be absolutely critical for fulfilling promises.</p>\n</div><!-- SC_ON -->",
  "score": 515,
  "permalink": "/r/CryptoCurrency/comments/n64cuj/crypto_market_cap_just_hit_25t_btc_dominance_435/",
  "subreddit": "CryptoCurrency",
  "id": "n64cuj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985987338
}