{
  "author": "the_winds_of_shit_",
  "the_new_excerpt": "I’ve seen a lot of threads with people arguing about whether the inflation we’re\nseeing is transient (caused by supply chain issues) or permanent (caused by\ngrowth in the money supply). If transient inflation is the best case scenario,\nwe should understand what that means.\n\nInflation can be…",
  "original_created_utc": 1623847056,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私たちが見ているインフレが一過性のもの（サプライチェーンの問題によるもの）なのか、それとも恒久的なもの（サプライチェーンの問題によるもの）なのかを議論しているスレッドをたくさん見ました。\nサプライチェーンの問題による一過性のものなのか、マネーサプライの増加による恒久的なものなのかを議論しているスレッドをよく見かけます。\n貨幣供給量の増加によるもの）なのかを議論しているスレッドをよく見かけます。) もし一過性のインフレが最良のシナリオであるならば\nその意味を理解する必要があります。\n\nインフレには...",
      "title": "トランジェント・インフレーションの理解"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我看到很多人在争论我们看到的通货膨胀是短暂的（由供应链问题造成的）还是永久的（由供应链问题造成的）。\n我们看到的通货膨胀是短暂的（由供应链问题引起）还是永久的（由货币供应量增长引起）。\n货币供应量的增长）。) 如果暂时性的通货膨胀是最好的情况。\n我们应该明白这意味着什么。\n\n通货膨胀可以是...",
      "title": "了解瞬时通货膨胀"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到很多人在爭論我們看到的通貨膨脹是短暫的（由供應鏈問題造成的）還是永久的（由供應鏈問題造成的）。\n我們看到的通貨膨脹是短暫的（由供應鏈問題引起）還是永久的（由貨幣供應量增長引起）。\n貨幣供應量的增長）。) 如果暫時性的通貨膨脹是最好的情況。\n我們應該明白這意味着什麼。\n\n通貨膨脹可以是...",
      "title": "瞭解瞬時通貨膨脹"
    }
  ],
  "title": "Understanding Transient Inflation",
  "created_utc": 1623861965,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve seen a lot of threads with people arguing about whether the inflation we’re seeing is transient (caused by supply chain issues) or permanent (caused by growth in the money supply). If transient inflation is the best case scenario, we should understand what that means. </p>\n\n<p>Inflation can be transitory in absolute terms or rate of change terms. In the absolute case, prices would briefly spike and then come back down to the same level that they were before. In the rate of change case, prices would briefly spike and then stop increasing, but stay at that higher level in the long term.</p>\n\n<p>Historically, inflation has almost always been transient in rate of change terms. So when you hear Powell telling you not to worry because inflation is transitory - just know that means that prices will stop going up soon, but they will remain at elevated levels. </p>\n\n<p>Of course there are extreme supply chain cases such as lumber where prices will come back down, but these cases are the exception, not the rule. Generally across the board, the inflation that we see will be caused by an expansion in the money supply. </p>\n\n<p>For a breakdown of historical transient inflation, see this article: <a href=\"https://www.lynalden.com/inflation/#transitory\">https://www.lynalden.com/inflation/#transitory</a></p>\n</div><!-- SC_ON -->",
  "score": 87,
  "permalink": "/r/investing/comments/o13vcs/understanding_transient_inflation/",
  "subreddit": "investing",
  "id": "o13vcs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009742351
}