{
  "author": "AppropriateMove8989",
  "the_new_excerpt": "Hi everyone,\n\nNot a troll. I started trading this year just to see if I could make a little\nbit of money instead of letting it sit in my savings account and managed to make\n$35k+ so far in profits off of about $6k of my student loan refund. I'm confused\nif this fucks me over since I'm in college and…",
  "original_created_utc": 1608314744,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "大家好，\n\n不是巨魔。我今年开始交易只是想看看我能不能赚点钱\n一点钱，而不是让它存在我的储蓄账户里，然后设法赚到了\n到目前为止，我的学生贷款退款中大约有6000美元，到目前为止，我的利润超过了35000美元。我很困惑\n如果这件事把我搞砸了，因为我还在上大学，而且…",
      "title": "今年开始交易。没有工作，拿了6000美元的大学贷款退款，赚了3.5万美元甚至更多。我不知道该怎么处理税务问题。帮助?"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好，\n\n不是巨魔。我今年開始交易只是想看看我能不能賺點錢\n一點錢，而不是讓它存在我的儲蓄賬戶裏，然後設法賺到了\n到目前爲止，我的學生貸款退款中大約有6000美元，到目前爲止，我的利潤超過了35000美元。我很困惑\n如果這件事把我搞砸了，因爲我還在上大學，而且…",
      "title": "今年開始交易。沒有工作，拿了6000美元的大學貸款退款，賺了3.5萬美元甚至更多。我不知道該怎麼處理稅務問題。幫助?"
    }
  ],
  "title": "Started trading this year. No job, took $6,000 of my college loan refund, made $35,000 profit and possibly more. Not sure what to do with the tax situation. Help?",
  "created_utc": 1608363247,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi everyone,</p>\n\n<p>Not a troll. I started trading this year just to see if I could make a little bit of money instead of letting it sit in my savings account and managed to make $35k+ so far in profits off of about $6k of my student loan refund. I&#39;m confused if this fucks me over since I&#39;m in college and have no job. Not sure if I&#39;m getting paranoid for no reason.</p>\n\n<p>Theoretically if I made $100,000+ in profits would I fuck myself over tax wise or with any penalties? Or should I just report what I can on my tax return and move on?</p>\n\n<p>The stock that I made the most money off is currently projected to do really well and I&#39;m thinking I will make substantially more. I don&#39;t want to sell yet but I do want to make sure I don&#39;t get in trouble or screw it up. After the success with mine, I later had my boyfriend do the same thing with his stocks and he made $8,000. He&#39;s not in college and is employed so we&#39;ve been paying some attention to his tax bracket and capital gains tax but aren&#39;t sure what to do for my situation.</p>\n\n<p>TLDR; In college with no job. Used college loans in stock market and made $35,000 profit. Is there anything special I should do for my tax return? And theoretically if I made $200,000 in profit or $1 million in profit...what would be the next steps?</p>\n\n<p>Edit: I’m 27</p>\n\n<p>Update: Ended up securing $20k profits on AMPE. Might buy back some if there’s a big dip. I might post updates on Monday if all goes well? Hopefully...</p>\n\n<p>Thank you for all of the advice!</p>\n</div><!-- SC_ON -->",
  "score": 57,
  "permalink": "/r/stocks/comments/kfq891/started_trading_this_year_no_job_took_6000_of_my/",
  "subreddit": "stocks",
  "id": "kfq891",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609260495599
}