{
  "author": "Ott621",
  "original_created_utc": 1635000208,
  "title": "Have there been any attempts to build a solid rocket motor that can be throttled or turned off?",
  "created_utc": 1635006340,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It seems like there would be a lot of applications for a small solid rocket motor that can go from ~0% to 100% or possibly greater.</p>\n\n<p>I&#39;m imagining something like a JATO rocket in terms of size and the creative ways it has been implemented.</p>\n\n<p>It could be something simple such as a mechanism to destroy sections of the propellent and spit out the chunks. It couldn&#39;t throttle back up and will spike thrust briefly but it still sounds useful.</p>\n</div><!-- SC_ON -->",
  "score": 166,
  "permalink": "/r/askscience/comments/qe65vo/have_there_been_any_attempts_to_build_a_solid/",
  "subreddit": "askscience",
  "id": "qe65vo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It seems like there would be a lot of applications for a small solid rocket\nmotor that can go from ~0% to 100% or possibly greater.\n\nI'm imagining something like a JATO rocket in terms of size and the creative\nways it has been implemented.\n\nIt could be something simple such as a mechanism to destroy…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "小型の固体ロケットモーターの用途はたくさんありそうですね。\n0％から100％、あるいはそれ以上の出力が可能な小型固体ロケットモーターには多くの用途がありそうです。\n\nサイズ的にはJATOロケットのようなものを想像しています。\n実現しているものを想像しています。\n\nそれは、例えば破壊するためのメカニズムのような単純なものかもしれませんが...。",
      "title": "固体ロケットのモーターで、スロットルやスイッチを切ることができるものはありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "一个小型的固体火箭发动机似乎有很多用途，它可以从0%到100%甚至更多。\n的小型固体火箭发动机会有很多应用，它可以从~0%上升到100%或可能更高。\n\n我想象的是类似于JATO火箭的尺寸和创造性的方式。\n它已经实现了。\n\n它可能是一些简单的东西，如摧毁的机制...",
      "title": "有没有人尝试过制造一种可以节流或关闭的固体火箭发动机？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "一個小型的固體火箭發動機似乎有很多用途，它可以從0%到100%甚至更多。\n的小型固體火箭發動機會有很多應用，它可以從~0%上升到100%或可能更高。\n\n我想象的是類似於JATO火箭的尺寸和創造性的方式。\n它已經實現了。\n\n它可能是一些簡單的東西，如摧毀的機制...",
      "title": "有沒有人嘗試過製造一種可以節流或關閉的固體火箭發動機？"
    }
  ]
}