{
  "author": "Lost_In_Detroit",
  "original_created_utc": 1634001077,
  "title": "Are online dating apps truly that bad for guys?",
  "created_utc": 1634081472,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have been out of the dating game for quite some time and pending on certain things going on in my life currently I might find myself back in the dating pool at some point.</p>\n\n<p>I’ve read a ton of stories across all corners of the internet of absolutely horrible experiences (mainly no matches, fake accounts, unrealistic expectations, etc) and was just curious if dating apps are really that bad for cisgender guys like myself? Can you really find love on a dating app or is it just an endless meat market for people with commitment issues?</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/q6aloa/are_online_dating_apps_truly_that_bad_for_guys/",
  "subreddit": "TooAfraidToAsk",
  "id": "q6aloa",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I have been out of the dating game for quite some time and pending on certain\nthings going on in my life currently I might find myself back in the dating pool\nat some point.\n\nI’ve read a ton of stories across all corners of the internet of absolutely\nhorrible experiences (mainly no matches, fake…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はかなり長い間、デートゲームから離れていましたが、現在の私の人生で起こっているあることに基づいて\n現在の生活の中で、あることが起きれば、またデートの場に戻ってくるかもしれません。\nしれません。\n\n私はインターネットのあらゆる場所で、絶対にひどい経験をしたという話をたくさん読みました。\n酷い経験（主に、マッチしない、偽物の...",
      "title": "オンライン・デート・アプリは、男にとって本当に悪いものなのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我已经离开约会游戏相当长的一段时间了，但由于目前我生活中的某些事情，我可能会发现自己又回到了约会池中。\n目前我的生活中发生的一些事情，我可能会发现自己回到了约会池中\n在某些时候。\n\n我在互联网的各个角落都读到了大量的故事，绝对的\n可怕的经验（主要是没有匹配，假的...",
      "title": "在线约会应用程序对男人来说真的那么糟糕吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我已經離開約會遊戲相當長的一段時間了，但由於目前我生活中的某些事情，我可能會發現自己又回到了約會池中。\n目前我的生活中發生的一些事情，我可能會發現自己回到了約會池中\n在某些時候。\n\n我在互聯網的各個角落都讀到了大量的故事，絕對的\n可怕的經驗（主要是沒有匹配，假的...",
      "title": "在線約會應用程序對男人來說真的那麼糟糕嗎？"
    }
  ]
}