{
  "author": "OldDogWater",
  "original_created_utc": 1651212289,
  "title": "What Happened to Alexander the Great’s Cloak?",
  "created_utc": 1651241599,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Alexander the Great supposedly wore a cloak.&lt;/p&gt;\n\n&lt;p&gt;Mithridates supposedly had this cloak in his possession and wore it both for fun and for appealing to potential allies.&lt;/p&gt;\n\n&lt;p&gt;According to Plutarch, Pompey supposedly got the cloak after defeating Mithridates, and allegedly wore it during his Triumph in 61 BC.&lt;/p&gt;\n\n&lt;p&gt;Trouble is, I can’t find any more information on what happened to the cloak? If anyone has an idea, I’d love to hear it&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/uefdrt/what_happened_to_alexander_the_greats_cloak/",
  "subreddit": "AskHistorians",
  "id": "uefdrt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Alexander the Great supposedly wore a cloak.\n\nMithridates supposedly had this cloak in his possession and wore it both for fun\nand for appealing to potential allies.\n\nAccording to Plutarch, Pompey supposedly got the cloak after defeating\nMithridates, and allegedly wore it during his Triumph in 61…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アレキサンダー大王はマントを着ていたとされる。\n\nミトリダテスはこのマントを所持していたとされ、遊び心と同盟国へのアピールのために着用したとされる\n味方へのアピールのために着用したとされる。\n\nプルタークによると、ポンペイはミトリダテスを倒した後、このマントを手に入れたとされている。\nポンペイはミトリダテスを倒した後にマントを手に入れ、61年の凱旋の際にこれを着用したと言われている。",
      "title": "アレキサンダー大王のマントはどうなったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "亚历山大大帝据说穿了一件斗篷。\n\n米特里达斯据说也有这件斗篷，他穿这件斗篷是为了好玩。\n也是为了吸引潜在的盟友。\n\n根据普鲁塔克的说法，庞培应该是在击败米特里达斯后得到了这件斗篷。\n据称庞培在击败米特里达斯后得到了这件斗篷，并在61年的凯旋中穿上了它......",
      "title": "亚历山大大帝的斗篷怎么了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "亞歷山大大帝據說穿了一件斗篷。\n\n米特里達斯據說也有這件斗篷，他穿這件斗篷是爲了好玩。\n也是爲了吸引潛在的盟友。\n\n根據普魯塔克的說法，龐培應該是在擊敗米特里達斯後得到了這件斗篷。\n據稱龐培在擊敗米特里達斯後得到了這件斗篷，並在61年的凱旋中穿上了它......",
      "title": "亞歷山大大帝的斗篷怎麼了？"
    }
  ]
}