{
  "author": "CommunicationNo3845",
  "original_created_utc": 1643881837,
  "title": "Solana is the McDonalds ice cream machine of the crypto world.",
  "created_utc": 1643892170,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I tried to give this chain the benefit of the doubt multiple times yet it always seems to fail my expectations.&lt;/p&gt;\n\n&lt;p&gt;Either it’s down cause its out of RAM, got attacked by a DDOS and now it got hacked.\nThere’s always something wrong with this chain.&lt;/p&gt;\n\n&lt;p&gt;Honestly I feel like it’s one of the most overhyped projects on the market especially with other chains like Polygon being MUCH more consistent, cheaper and faster.\nAt least when Polygon gets DDOSed it doesn’t come to a complete stop like Solana. In fact even with the attack, Polygon still had one of the cheapest fees ok the market.&lt;/p&gt;\n\n&lt;p&gt;I honestly don’t know why anyone would keep supporting and hyping this chain anymore…&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 319,
  "permalink": "/r/CryptoCurrency/comments/sjfad1/solana_is_the_mcdonalds_ice_cream_machine_of_the/",
  "subreddit": "CryptoCurrency",
  "id": "sjfad1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I tried to give this chain the benefit of the doubt multiple times yet it always\nseems to fail my expectations.\n\nEither it’s down cause its out of RAM, got attacked by a DDOS and now it got\nhacked. There’s always something wrong with this chain.\n\nHonestly I feel like it’s one of the most overhyped…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このチェーンには何度も疑問の余地を与えようとしたが、いつもそうだ。\n期待外れだったようです。\n\nRAMが不足してダウンしたのか、DDOSに攻撃されたのか、そして今になって\nハッキングされている。このチェーンには常に何か問題があるのです。\n\n正直なところ、最も過大評価されているチェーンの1つだと思う...",
      "title": "Solanaは暗号世界のマクドナルド・アイスクリーム・マシンです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我曾多次试图给这个链条以怀疑的好处，但它总是\n似乎辜负了我的期望。\n\n不是因为它的内存用完了，就是被DDOS攻击了，现在它又被\n黑客攻击。这条链子总是有问题。\n\n老实说，我觉得它是最被过度夸大的一个...",
      "title": "索拉纳是加密货币世界的麦当劳冰淇淋机。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我曾多次試圖給這個鏈條以懷疑的好處，但它總是\n似乎辜負了我的期望。\n\n不是因爲它的內存用完了，就是被DDOS攻擊了，現在它又被\n黑客攻擊。這條鏈子總是有問題。\n\n老實說，我覺得它是最被過度誇大的一個...",
      "title": "索拉納是加密貨幣世界的麥當勞冰淇淋機。"
    }
  ]
}