{
  "author": "asithinkit",
  "original_created_utc": 1657910310,
  "title": "Guys: Why aren't we using deodorant \"down there\"?",
  "created_utc": 1657942652,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t see any reason not to, and it strikes me as a life hack. Keeps things fresh, why aren&amp;#39;t we doing this?? The thought came to me preparing for yoga class where my instructor might have close contact with me while I&amp;#39;m in weird bendy yoga positions. She explicitly gives instructions to all beginners about hygiene and body odor when attending classes. Not sure why this isn&amp;#39;t practiced broadly.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 114,
  "permalink": "/r/TooAfraidToAsk/comments/vzvvnt/guys_why_arent_we_using_deodorant_down_there/",
  "subreddit": "TooAfraidToAsk",
  "id": "vzvvnt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I can't see any reason not to, and it strikes me as a life hack. Keeps things\nfresh, why aren't we doing this?? The thought came to me preparing for yoga\nclass where my instructor might have close contact with me while I'm in weird\nbendy yoga positions. She explicitly gives instructions to all…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "しない理由が見当たらないし、ライフハックとしても印象的だ。物事を新鮮に保つ\nなぜやらないんだろう？ヨガ教室の準備をしていて、ふと思ったんです。\nインストラクターに密着されながら、変な体勢でヨガをすることになるのでは？\nインストラクターに密着されるかもしれない。彼女は明確にすべての人に指示を出し...",
      "title": "男子：なぜ「下」にデオドラントを使わないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我看不出有什么理由不这样做，而且这让我觉得是一种生活智慧。让事情保持\n新鲜，我们为什么不这样做？我在准备上瑜伽课时想到了这个问题。\n的时候，我的教练可能会和我有亲密的接触，而我正处于奇怪的状态。\n弯曲的瑜伽姿势时与我亲密接触。她明确地给所有的指示...",
      "title": "伙计们：为什么我们不在 \"下面 \"使用除臭剂？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看不出有什麼理由不這樣做，而且這讓我覺得是一種生活智慧。讓事情保持\n新鮮，我們爲什麼不這樣做？我在準備上瑜伽課時想到了這個問題。\n的時候，我的教練可能會和我有親密的接觸，而我正處於奇怪的狀態。\n彎曲的瑜伽姿勢時與我親密接觸。她明確地給所有的指示...",
      "title": "夥計們：爲什麼我們不在 \"下面 \"使用除臭劑？"
    }
  ]
}