{
  "author": "KofiOlut",
  "original_created_utc": 1638118851,
  "title": "It's been two months since the pandora papers, an investigation into the shadowy offshore financial system, but everyone seems to forgotten its implication and now the US Treasury Secretary Janet Yellen closes in on Crypto as a haven for criminals. That's exactly why we need Crypto.",
  "created_utc": 1638128220,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A Reminder: </p>\n\n<p><strong>What are the Pandora Papers?</strong></p>\n\n<p>The <a href=\"https://www.icij.org/investigations/pandora-papers/frequently-asked-questions-about-the-pandora-papers-and-icij/\">Pandora Papers</a> is an investigation into the shadowy offshore financial system that reveals the workings of a secret economy that benefits the wealthy and well-connected at the expense of everyone else.</p>\n\n<p>The “papers” are the more than 11.9 million confidential records obtained by the International Consortium of Investigative Journalists that form the backbone of the investigation.</p>\n\n<p><strong>Where did the Pandora Papers leak come from?</strong></p>\n\n<p>The records come from 14 offshore service providers — law firms, wealth management advisors and corporate formation agencies — that help those with money set up companies in low- or no-tax jurisdictions. You can find out more about the firms here.</p>\n\n<p><strong>What’s the difference between Pandora Papers and Panama Papers?</strong></p>\n\n<p>Size, scale, scope. While the Panama Papers was based on the files of a single offshore services provider, the Pandora Papers records come from 14. The new investigation includes data on more than 27,000 companies and 29,000 so-called ultimate beneficial owners — the real owners of shell companies — or more than twice the number of beneficial owners identified in the Panama Papers.  The Pandora Papers also connected offshore activity to more than twice as many politicians and public officials as did the Panama Papers.</p>\n\n<p><strong>Why does the Pandora Papers investigation matter?</strong></p>\n\n<p>The offshore system allows elites and multinationals to shift taxable wealth to paper-only companies in low-tax jurisdictions, without requiring them to live or actually earn profits there. They can shelter their assets— yachts, airplanes, artwork, mansions, cash and even company shares — by paying financial services providers to set up companies to hold those items. It also offers secrecy, which provides an opportunity to hide assets from authorities, creditors and other claimants as well as from public scrutiny.</p>\n\n<p>The offshore financial system can drain trillions of dollars from treasuries, worsen wealth disparities and protect those who cheat and steal while depriving their victims of recourse. Studies have estimated that the world’s ultra-wealthy own the bulk of the $11 trillion realm of offshore companies.</p>\n\n<p><strong>$11 Trillion Dollars !</strong> That&#39;s a lot of doe. </p>\n\n<p>And now the relatively new US Treasury Secretary Yellen has the audacity <a href=\"https://www.forbes.com/sites/haileylennon/2021/01/19/the-false-narrative-of-bitcoins-role-in-illicit-activity/\">to claim</a>: “I think many (cryptocurrencies) are used, at least in a transaction sense, mainly for illicit financing. And I think we really need to examine ways in which we can curtail their use, and make sure that anti-money laundering (sic) doesn&#39;t occur through those channels.” </p>\n\n<p>I am at loss for words, the pandora papers confirm what we all knew all along, but instead of doing something about those tax havens, they go after crypto, which is pushing a completely false narrative: </p>\n\n<p>&quot;The majority of cryptocurrency is not used for criminal activity. According to an excerpt from Chainalysis’ <a href=\"https://blog.chainalysis.com/reports/2021-crypto-crime-report-intro-ransomware-scams-darknet-markets\">2021 report</a>, in 2019, criminal activity represented 2.1% of all cryptocurrency transaction volume (roughly $21.4 billion worth of transfers). In 2020, the criminal share of all cryptocurrency activity fell to just 0.34% ($10.0 billion in transaction volume).&quot;</p>\n\n<p>and that&#39;s the exact reason why we need more of crypto and to push on with idea of decentralizing financial markets. <strong>Only way out.</strong></p>\n</div><!-- SC_ON -->",
  "score": 324,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/GGKbMugk91edb84lWvvuvJGN-5x1npbrGCwMO0_xyYc.jpg?auto=webp&s=e55612fad87da3628bad8217e9b6c68d480854c0",
          "width": 1200,
          "height": 675
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/GGKbMugk91edb84lWvvuvJGN-5x1npbrGCwMO0_xyYc.jpg?width=108&crop=smart&auto=webp&s=b95ca1572a5afc74dd04e43cfc66b72d914be420",
            "width": 108,
            "height": 60
          },
          {
            "url": "https://external-preview.redd.it/GGKbMugk91edb84lWvvuvJGN-5x1npbrGCwMO0_xyYc.jpg?width=216&crop=smart&auto=webp&s=e4d4f76c62facf1de456932ef2781243414a22f6",
            "width": 216,
            "height": 121
          },
          {
            "url": "https://external-preview.redd.it/GGKbMugk91edb84lWvvuvJGN-5x1npbrGCwMO0_xyYc.jpg?width=320&crop=smart&auto=webp&s=8ae03c2d112df041dda7503cb9540a7b845774bf",
            "width": 320,
            "height": 180
          },
          {
            "url": "https://external-preview.redd.it/GGKbMugk91edb84lWvvuvJGN-5x1npbrGCwMO0_xyYc.jpg?width=640&crop=smart&auto=webp&s=bcfbea7fc88168d68f7dd23bca7258c0e8878cd4",
            "width": 640,
            "height": 360
          },
          {
            "url": "https://external-preview.redd.it/GGKbMugk91edb84lWvvuvJGN-5x1npbrGCwMO0_xyYc.jpg?width=960&crop=smart&auto=webp&s=ff966a4742e7b970cc498f6e481e55ea0fad0c43",
            "width": 960,
            "height": 540
          },
          {
            "url": "https://external-preview.redd.it/GGKbMugk91edb84lWvvuvJGN-5x1npbrGCwMO0_xyYc.jpg?width=1080&crop=smart&auto=webp&s=960892bc0cfae4a721ab20e902fe2811a743674c",
            "width": 1080,
            "height": 607
          }
        ],
        "variants": {},
        "id": "ejwdHF5Usonzl73Rvj3EcLa57GTQ8oWfFE6tHpNsmVc"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/r48tvn/its_been_two_months_since_the_pandora_papers_an/",
  "subreddit": "CryptoCurrency",
  "id": "r48tvn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "A Reminder:\n\nWhat are the Pandora Papers?\n\nThe Pandora Papers\n[https://www.icij.org/investigations/pandora-papers/frequently-asked-questions-about-the-pandora-papers-and-icij/]\nis an investigation into the shadowy offshore financial system that reveals the\nworkings of a secret economy that benefits…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "リマインダーです。\n\nパンドラ・ペーパーとは？\n\nパンドラ・ペーパーとは\n[https://www.icij.org/investigations/pandora-papers/frequently-asked-questions-about-the-pandora-papers-and-icij/]をご覧ください。\nは、影の薄いオフショア金融システムを調査し、その実態を明らかにしたものです。\n恩恵を受ける秘密の経済の仕組みを明らかにするものです。",
      "title": "闇のオフショア金融システムを調査したパンドラ文書から2ヶ月が経ちましたが、誰もがその意味を忘れてしまったようで、今度は米財務長官のジャネット・イエレンが犯罪者の避難所としてのCryptoに迫っています。それこそが、私たちがCryptoを必要とする理由なのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "一个提醒。\n\n什么是潘多拉文件？\n\n潘多拉文件\n[https://www.icij.org/investigations/pandora-papers/frequently-asked-questions-about-the-pandora-papers-and-icij/]\n是一项对阴暗的离岸金融系统的调查，揭示了一个秘密经济的运作。\n揭示了一个秘密经济的运作情况，它有利于...",
      "title": "潘多拉文件已经过去两个月了，这是对阴暗的离岸金融系统的调查，但每个人似乎都忘记了它的影响，现在美国财政部长珍妮特-耶伦把加密货币作为犯罪分子的避风港而逼近。这正是我们需要加密货币的原因。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "一個提醒。\n\n什麼是潘多拉文件？\n\n潘多拉文件\n[https://www.icij.org/investigations/pandora-papers/frequently-asked-questions-about-the-pandora-papers-and-icij/]\n是一項對陰暗的離岸金融系統的調查，揭示了一個祕密經濟的運作。\n揭示了一個祕密經濟的運作情況，它有利於...",
      "title": "潘多拉文件已經過去兩個月了，這是對陰暗的離岸金融系統的調查，但每個人似乎都忘記了它的影響，現在美國財政部長珍妮特-耶倫把加密貨幣作爲犯罪分子的避風港而逼近。這正是我們需要加密貨幣的原因。"
    }
  ]
}