{
  "author": "Hard_Cor",
  "original_created_utc": 1629143401,
  "title": "it is sad the average person is too afraid of cryptocurrency to even consider stablecoin staking.",
  "created_utc": 1629164548,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was on a personal finance reddit community, and someone was talking about &quot;safe&quot; ways to earn interest on their money. People were recommending GICs which paid less than 2.5% interest (these GICs were also associated with sketchy banks no one has heard of). </p>\n\n<p>I suggested they could look into stablecoin staking which is fairly similar to a GIC (you have counter-party risk on both, both are not 1 to 1 backed by dollars) with the major difference being the lack deposit insurance banks (typically) have, but with the upside of earning 6 - 12% interest.</p>\n\n<p>Basically staking stablecoins could earn the person the same amount of money with about 1/4th of the amount of capital locked in. </p>\n\n<p>Unfortunately everyone else thought that cryptocurrency was too volatile and scary and that the person was guaranteed lose all their money if they did this.</p>\n</div><!-- SC_ON -->",
  "score": 159,
  "permalink": "/r/CryptoCurrency/comments/p5nmg6/it_is_sad_the_average_person_is_too_afraid_of/",
  "subreddit": "CryptoCurrency",
  "id": "p5nmg6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was on a personal finance reddit community, and someone was talking about\n\"safe\" ways to earn interest on their money. People were recommending GICs which\npaid less than 2.5% interest (these GICs were also associated with sketchy banks\nno one has heard of).\n\nI suggested they could look into…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はパーソナルファイナンスのredditのコミュニティにいて、誰かが自分のお金に利息をつける「安全な」方法について話していました。\n「安全な」お金の使い方について話していました。2.5%以下の利息しかつかないGICを勧めていました。\n2.5%以下の利息しかつかないGICを勧めていました（これらのGICは誰も聞いたことがないような大雑把な銀行と関連していました\n誰も聞いたことがないような大雑把な銀行に関連していた。)\n\n私は、彼らに...を調べてみてはどうかと提案しました。",
      "title": "一般の人は暗号通貨を恐れていて、安定したコインのステークを考えることすらできないのが悲しい。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在一个个人理财的reddit社区上，有人在谈论\n用他们的钱赚取利息的 \"安全 \"方法。人们推荐的是GICs，其\n支付不到2.5%的利息（这些GIC还与一些小银行有联系\n没有人听说过）。)\n\n我建议他们可以研究一下...",
      "title": "可悲的是，普通人太害怕加密货币，甚至不考虑稳定币的赌注。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在一個個人理財的reddit社區上，有人在談論\n用他們的錢賺取利息的 \"安全 \"方法。人們推薦的是GICs，其\n支付不到2.5%的利息（這些GIC還與一些小銀行有聯繫\n沒有人聽說過）。)\n\n我建議他們可以研究一下...",
      "title": "可悲的是，普通人太害怕加密貨幣，甚至不考慮穩定幣的賭注。"
    }
  ]
}