{
  "author": "theloneshewolf",
  "original_created_utc": 1624304216,
  "title": "If bras are necessities then why didn't we evolve some kind of natural back support like stronger back muscles?",
  "created_utc": 1624329899,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Sorry if this is a stupid question, I&#39;m a small-breasted woman so I really don&#39;t understand why bras are necessary. I&#39;ve heard it said that bras are important for back support, especially for women with larger breasts, and I&#39;ve certainly heard larger-breasted women echo this. It&#39;s not just large-breasted women however, according to &quot;experts&quot; in this article they&#39;re important for all sizes (<a href=\"https://www.elle.com/uk/life-and-culture/culture/a22322591/braless-benefits/\">https://www.elle.com/uk/life-and-culture/culture/a22322591/braless-benefits/</a>). But I don&#39;t get it, I know evolution isn&#39;t perfect but if breasts were such an issue and caused such problems then why didn&#39;t we evolve to have stronger back muscles or something? Aren&#39;t bras purely cosmetic? I can see how they&#39;re necessary for exercise (trust me, I&#39;ve been there) since working out with your boobs flapping everywhere is kinda painful. But for everything else... I thought they were more for looks and for &quot;decency&quot;? Actually, that&#39;s another thing I don&#39;t get, why did we evolve to have back pains and other problems when exercising? If breasts make it difficult to run that seems like it&#39;d be kind of an evolutionary disadvantage... Sorry again if this is a dumb question, and I hope this is the right place to post this! Thanks in advance!</p>\n\n<p>P.S. I dunno if talking about women&#39;s breasts would be deemed inappropriate or not, so I&#39;m just gonna tag this NSFW just in case. It shouldn&#39;t be though, breasts are natural parts of human bodies and it&#39;s dumb that we censor them.</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/NoStupidQuestions/comments/o53h9g/if_bras_are_necessities_then_why_didnt_we_evolve/",
  "subreddit": "NoStupidQuestions",
  "id": "o53h9g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Sorry if this is a stupid question, I'm a small-breasted woman so I really don't\nunderstand why bras are necessary. I've heard it said that bras are important\nfor back support, especially for women with larger breasts, and I've certainly\nheard larger-breasted women echo this. It's not just large…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "くだらない質問だったらすみません。私は胸の小さい女性なので、なぜブラジャーが必要なのか本当にわかりません。\nなぜブラジャーが必要なのか理解できません。ブラジャーは背中を支えるために重要だと聞いたことがあります。\n特に胸の大きい女性にとっては、背中を支えるためにブラジャーが重要だと聞いたことがありますし、胸の大きい女性がそう言っているのも確かです。\n胸の大きい女性がそう言っているのを聞いたことがあります。胸の大きい女性からもそう言われますが、胸が大きいだけではありません。",
      "title": "ブラジャーが必需品であるならば、なぜ私たちはより強い背筋のような、自然な背中のサポートを進化させなかったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果这是个愚蠢的问题，我很抱歉，我是一个小胸脯的女人，所以我真的不明白为什么需要戴胸罩。\n所以我真的不明白为什么需要戴胸罩。我听人说过，胸罩对背部的支撑很重要，特别是对胸部较大的女性来说。\n我听说胸罩对背部的支撑很重要，特别是对乳房较大的女性，我当然也听说过乳房较大的女性\n我当然也听到过胸大的女性对此表示赞同。这不仅仅是大...",
      "title": "如果胸罩是必需品，那么为什么我们没有进化出某种自然的背部支撑，如更强的背部肌肉？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果這是個愚蠢的問題，我很抱歉，我是一個小胸脯的女人，所以我真的不明白爲什麼需要戴胸罩。\n所以我真的不明白爲什麼需要戴胸罩。我聽人說過，胸罩對背部的支撐很重要，特別是對胸部較大的女性來說。\n我聽說胸罩對背部的支撐很重要，特別是對乳房較大的女性，我當然也聽說過乳房較大的女性\n我當然也聽到過胸大的女性對此表示贊同。這不僅僅是大...",
      "title": "如果胸罩是必需品，那麼爲什麼我們沒有進化出某種自然的背部支撐，如更強的背部肌肉？"
    }
  ]
}