{
  "author": "aadustparticle",
  "original_created_utc": 1647691708,
  "title": "What does it actually mean to be gender nonbinary?",
  "created_utc": 1647702269,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am not trying to be disrespectful at all. I want to generate fruitful discussion. &lt;/p&gt;\n\n&lt;p&gt;Whenever I have asked this question in the past, I get similar answers: it means one doesn&amp;#39;t subscribe to a traditional gender role. &lt;/p&gt;\n\n&lt;p&gt;But who does? If someone wears dresses and pants alike, or makeup one day and no makeup another, or likes to do skincare but also likes riding fourwheelers, does that make them gender nonbinary? What are the criteria?&lt;/p&gt;\n\n&lt;p&gt;When you call yourself gender nonbinary, aren&amp;#39;t you endorsing strict gender stereotypes more than deconstructing them?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 135,
  "permalink": "/r/TooAfraidToAsk/comments/thtuyl/what_does_it_actually_mean_to_be_gender_nonbinary/",
  "subreddit": "TooAfraidToAsk",
  "id": "thtuyl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I am not trying to be disrespectful at all. I want to generate fruitful\ndiscussion.\n\nWhenever I have asked this question in the past, I get similar answers: it means\none doesn't subscribe to a traditional gender role.\n\nBut who does? If someone wears dresses and pants alike, or makeup one day and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "失礼なことを言うつもりは全くありません。実りあるものにしたいのです。\nという議論をします。\n\n過去にこの質問をすると、いつも同じような答えが返ってきます。\n伝統的な性別の役割に従わない。\n\nしかし、誰がそんなことをするのでしょうか？もし、ある人がドレスとパンツを同じように着たり、ある日はメイクをして、ある日は...といった具合に。",
      "title": "ジェンダー・ノンバイナリーの実際の意味とは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我完全不是想不尊重人。我希望能产生有成效的\n讨论。\n\n过去每当我问起这个问题时，我都会得到类似的答案：这意味着\n一个人不认同传统的性别角色。\n\n但谁会这样做呢？如果一个人穿裙子和裤子都一样，或者某天化妆，然后...",
      "title": "性别不分的实际含义是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我完全不是想不尊重人。我希望能產生有成效的\n討論。\n\n過去每當我問起這個問題時，我都會得到類似的答案：這意味着\n一個人不認同傳統的性別角色。\n\n但誰會這樣做呢？如果一個人穿裙子和褲子都一樣，或者某天化妝，然後...",
      "title": "性別不分的實際含義是什麼？"
    }
  ]
}