{
  "author": "goodbrews",
  "the_new_excerpt": "I was in $PLTR. I almost NEVER sell for a loss. At least not a big one\n(relatively speaking). This morning I did and it has been eating away at me all\nday. I know better and I have no problem holding out during crashes. Maybe it\nwas too early in the morning and my brain wasnt functioning quite yet.…",
  "original_created_utc": 1620777299,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は$PLTRにいました。私は損切りをすることはほとんどありません。少なくとも、大きなものではありません\n(相対的に)。今朝、私は売りましたが、それが一日中私を蝕んでいます。\n一日中悩んでいました。私はよく知っていますし、暴落時に我慢することに問題はありません。もしかしたら、それは\n朝早すぎて、脳がまだ機能していなかったのかもしれません....",
      "title": "暴落の日に売り逃げするのはよくない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我当时在$PLTR。我几乎从来没有卖出亏损过。至少不会有大的损失\n(相对而言)。今天早上我做了，它已经侵蚀了我一整天\n一天。我知道的更多，而且我在暴跌时坚持不动，也没有问题。也许这\n也许是早上太早了，我的大脑还没有完全发挥作用....。",
      "title": "在暴跌日抛售不是一个好主意"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我當時在$PLTR。我幾乎從來沒有賣出虧損過。至少不會有大的損失\n(相對而言)。今天早上我做了，它已經侵蝕了我一整天\n一天。我知道的更多，而且我在暴跌時堅持不動，也沒有問題。也許這\n也許是早上太早了，我的大腦還沒有完全發揮作用....。",
      "title": "在暴跌日拋售不是一個好主意"
    }
  ],
  "title": "Not a good idea to sell off on a crash day",
  "created_utc": 1620792296,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was in $PLTR.  I almost NEVER sell for a loss.  At least not a big one (relatively speaking).   This morning I did and it has been eating away at me all day.   I know better and I have no problem holding out during crashes.   Maybe it was too early in the morning and my brain wasnt functioning quite yet.  The slow and heavy bleed on tech and small cap has messed me up...haha.   I don&#39;t even think I realized it was a hard crash bc of the non stop downward trend.   I have seen multiple ERs go well the last few days and almost no positive movement on the stock.  I didn&#39;t see much of a reaction in PLTR at first and thought it was the same story.   I saw that everything was down again this morning and needed to scrounge up some money.   While I have plenty of cash, I don&#39;t feel responsible taking any more.   After months of this crap, I just didn&#39;t want to take the cash out.   My average was around 20....ughh.    This bear market finally got to me.</p>\n</div><!-- SC_ON -->",
  "score": 137,
  "permalink": "/r/stocks/comments/nabdwh/not_a_good_idea_to_sell_off_on_a_crash_day/",
  "subreddit": "stocks",
  "id": "nabdwh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985996883
}