{
  "author": "xavierwest888",
  "original_created_utc": 1642454797,
  "title": "Remember the 'evidence' that the market is going to dip significantly soon is the same 'evidence' that predicted BTC $100k for 2021",
  "created_utc": 1642481349,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Title says it all, for all you new investors that are probably holding portfolios in the red right now and are worried about continuing to DCA into your coins because there are people claiming that &amp;#39;the markets are absolutely going to crash&amp;#39; were probably the same people that predicted that BTC will absolutely hit $100k by the end of 2021.&lt;/p&gt;\n\n&lt;p&gt;And in case you didn&amp;#39;t notice:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;span class=\"md-spoiler-text\"&gt;It is 2022.&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span class=\"md-spoiler-text\"&gt;Bitcoin did in fact NOT hit even close to $100k.&lt;/span&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;That doesn&amp;#39;t mean that the market won&amp;#39;t go down of course, it very likely could go down further. It also could start pumping and if you don&amp;#39;t continue to DCA you&amp;#39;ll miss the chance to average down those ATH buy in prices you probably entered the market with. The market is already almost 50% down, even if it dips further this is still a great price point to be buying in on almost all coins in terms of risk / reward.&lt;/p&gt;\n\n&lt;p&gt;The point is that take two massive piles of table salt whenever anyone tries to tell you they are anything other than &amp;#39;guessing&amp;#39; what the market is going to do. Ignore all the &amp;#39;TA&amp;#39; and the graphs and the political rumours and hearsay and don&amp;#39;t worry about the stock markets. They have been telling me that the stock markets are about to crash any day now for over a year and the FTSE just keeps on reaching new post-COVID highs.&lt;/p&gt;\n\n&lt;p&gt;So invest wisely and DO research and make informed opinions but also filter out the doomsayers and the market crash predicters.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 320,
  "permalink": "/r/CryptoCurrency/comments/s6fdgk/remember_the_evidence_that_the_market_is_going_to/",
  "subreddit": "CryptoCurrency",
  "id": "s6fdgk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Title says it all, for all you new investors that are probably holding\nportfolios in the red right now and are worried about continuing to DCA into\nyour coins because there are people claiming that 'the markets are absolutely\ngoing to crash' were probably the same people that predicted that BTC…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルが全てを物語っています。\n今、ポートフォリオが赤字で、このままDCAを続けることに不安を感じている。\n市場は絶対に崩壊する」と主張する人々がいるため、あなたのコインは崩壊する。\nBTCが暴落する」と予測した人たちと同じだったのでしょう...。",
      "title": "市場がまもなく大きく落ち込むという「根拠」は、2021年にBTCが10万ドルになると予測したのと同じ「根拠」であることを忘れないでください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "标题说明了一切，对于所有新的投资者来说，他们可能现在持有的投资组合处于亏损状态，并担心继续进入DCA的问题。\n现在你们的投资组合处于亏损状态，并担心继续向你们的DCA\n你的硬币，因为有人声称 \"市场绝对是\n声称 \"市场绝对会崩溃 \"的人，可能也是预测BTC...",
      "title": "请记住，市场即将大幅下挫的 \"证据 \"与预测2021年BTC 10万美元的 \"证据 \"是一样的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "標題說明了一切，對於所有新的投資者來說，他們可能現在持有的投資組合處於虧損狀態，並擔心繼續進入DCA的問題。\n現在你們的投資組合處於虧損狀態，並擔心繼續向你們的DCA\n你的硬幣，因爲有人聲稱 \"市場絕對是\n聲稱 \"市場絕對會崩潰 \"的人，可能也是預測BTC...",
      "title": "請記住，市場即將大幅下挫的 \"證據 \"與預測2021年BTC 10萬美元的 \"證據 \"是一樣的。"
    }
  ]
}