{
  "author": "xavierwest888",
  "original_created_utc": 1642454797,
  "title": "Remember the 'evidence' that the market is going to dip significantly soon is the same 'evidence' that predicted BTC $100k for 2021",
  "created_utc": 1642481349,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Title says it all, for all you new investors that are probably holding portfolios in the red right now and are worried about continuing to DCA into your coins because there are people claiming that &amp;#39;the markets are absolutely going to crash&amp;#39; were probably the same people that predicted that BTC will absolutely hit $100k by the end of 2021.&lt;/p&gt;\n\n&lt;p&gt;And in case you didn&amp;#39;t notice:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;span class=\"md-spoiler-text\"&gt;It is 2022.&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span class=\"md-spoiler-text\"&gt;Bitcoin did in fact NOT hit even close to $100k.&lt;/span&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;That doesn&amp;#39;t mean that the market won&amp;#39;t go down of course, it very likely could go down further. It also could start pumping and if you don&amp;#39;t continue to DCA you&amp;#39;ll miss the chance to average down those ATH buy in prices you probably entered the market with. The market is already almost 50% down, even if it dips further this is still a great price point to be buying in on almost all coins in terms of risk / reward.&lt;/p&gt;\n\n&lt;p&gt;The point is that take two massive piles of table salt whenever anyone tries to tell you they are anything other than &amp;#39;guessing&amp;#39; what the market is going to do. Ignore all the &amp;#39;TA&amp;#39; and the graphs and the political rumours and hearsay and don&amp;#39;t worry about the stock markets. They have been telling me that the stock markets are about to crash any day now for over a year and the FTSE just keeps on reaching new post-COVID highs.&lt;/p&gt;\n\n&lt;p&gt;So invest wisely and DO research and make informed opinions but also filter out the doomsayers and the market crash predicters.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 320,
  "permalink": "/r/CryptoCurrency/comments/s6fdgk/remember_the_evidence_that_the_market_is_going_to/",
  "subreddit": "CryptoCurrency",
  "id": "s6fdgk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Title says it all, for all you new investors that are probably holding\nportfolios in the red right now and are worried about continuing to DCA into\nyour coins because there are people claiming that 'the markets are absolutely\ngoing to crash' were probably the same people that predicted that BTC…"
}