{
  "author": "RichRaichu5",
  "the_new_excerpt": "So, we know that despite their anti-pagan attitude, the Byzantines safe-guarded\nancient manuscripts, busts, artworks etc (roman and greek). So presumably, a\nroman in medieval era could educate himself about ancient roman or greek\nliterature, history, arts using the libraries of Constantinople.\n\nMy…",
  "original_created_utc": 1611662198,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "所以，我们知道，尽管他们的态度是反异教，但拜占庭人还是安全地保护着。\n古手稿、半身像、艺术品等（罗马和希腊）。因此，可以推测，一个\n罗马人\n用君士坦丁堡的图书馆来研究文学、历史、艺术。\n\n我的...",
      "title": "拜占庭人有机会接触到他们古老的过去，不像他们同时代的大多数人。那么，他们有没有在中世纪带回一些 \"古代 \"的东西（战法、武器、建筑、艺术等）呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以，我們知道，儘管他們的態度是反異教，但拜占庭人還是安全地保護着。\n古手稿、半身像、藝術品等（羅馬和希臘）。因此，可以推測，一個\n羅馬人\n用君士坦丁堡的圖書館來研究文學、歷史、藝術。\n\n我的...",
      "title": "拜占庭人有機會接觸到他們古老的過去，不像他們同時代的大多數人。那麼，他們有沒有在中世紀帶回一些 \"古代 \"的東西（戰法、武器、建築、藝術等）呢？"
    }
  ],
  "title": "The Byzantines had access to their ancient past, unlike most of their contemporaries. So, did they ever bring back something \"ancient\" (battle tactics, weapons, architecture, art etc.) in the medieval era?",
  "created_utc": 1611682643,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So, we know that despite their anti-pagan attitude, the Byzantines safe-guarded ancient manuscripts,  busts,  artworks etc (roman and greek). So presumably, a roman in medieval era could educate himself about ancient roman or greek literature, history, arts using the libraries of Constantinople. </p>\n\n<p>My question is, did they ever use this knowledge and their accessibility to the antiquity to their advantage in medieval era? One example might be that they used the Phalanx formation in the siege of Rome (maybe, I read it somewhere but I&#39;m not sure). Implementing these types of ancient battle tactics or bringing back those units must have given the enemies a great surprise. An arab or Turkic or Slavic army would never expect to meet a legion in battle, which could work in the Byzantines&#39; advantage, couldn&#39;t it?</p>\n\n<p>Also do we see similar revival in the fields of literature and arts? I guess Anna Komnene did something like this, but again I am not sure.</p>\n\n<p>Thanks in advance.</p>\n</div><!-- SC_ON -->",
  "score": 2829,
  "permalink": "/r/AskHistorians/comments/l5cjhm/the_byzantines_had_access_to_their_ancient_past/",
  "subreddit": "AskHistorians",
  "id": "l5cjhm",
  "is_self": true,
  "media": null,
  "is_video": false
}