{
  "author": "Klaasiker",
  "original_created_utc": 1635411093,
  "title": "I sleep like a baby due to Crypto",
  "created_utc": 1635435081,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I realized a thing since I invest into Crypto. My sleep behaviour has changed massively and my wife also noticed. So in my first days of investing into Cryptocurrencies my sleep has changed as I went to check the charts on a regular base.</p>\n\n<p>But after a while it changed. With the latest drops after the massive bull runs my sleep behaviour is pretty different than before. My wife mentioned that due to Crypto I now sleep like a baby. </p>\n\n<p>I sleep for a couple of hours, and then I wake up and cry for a while. After I get comforted I sleep again till I wake up again and cry again.</p>\n</div><!-- SC_ON -->",
  "score": 192,
  "permalink": "/r/CryptoCurrency/comments/qhimrf/i_sleep_like_a_baby_due_to_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "qhimrf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So I realized a thing since I invest into Crypto. My sleep behaviour has changed\nmassively and my wife also noticed. So in my first days of investing into\nCryptocurrencies my sleep has changed as I went to check the charts on a regular\nbase.\n\nBut after a while it changed. With the latest drops after…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そこで、Cryptoに投資していて気づいたことがあります。私の睡眠行動が大きく変わりました。\n妻も気づいていました。だから、暗号に投資した最初の日に\n暗号通貨に投資した最初の頃は、定期的にチャートをチェックしていたので、睡眠が変わりました。\nベースになりました。\n\nしかし、しばらくすると変わってきました。最近の下落で...",
      "title": "Cryptoのおかげで赤ちゃんのように眠れます"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "自从我投资加密货币以来，我意识到一件事。我的睡眠行为已经改变\n大幅改变，我的妻子也注意到了。所以在我投资加密货币的头几天\n我的睡眠发生了变化，因为我经常去查看图表。\n础。\n\n但过了一段时间后，情况发生了变化。随着最近的下跌之后，我的睡眠也发生了变化......",
      "title": "我因隐匿性疾病而睡得像个婴儿"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "自從我投資加密貨幣以來，我意識到一件事。我的睡眠行爲已經改變\n大幅改變，我的妻子也注意到了。所以在我投資加密貨幣的頭幾天\n我的睡眠發生了變化，因爲我經常去查看圖表。\n礎。\n\n但過了一段時間後，情況發生了變化。隨着最近的下跌之後，我的睡眠也發生了變化......",
      "title": "我因隱匿性疾病而睡得像個嬰兒"
    }
  ]
}