{
  "author": "damittydam",
  "original_created_utc": 1625346740,
  "title": "Let your money make more money, even if it's a few dollars per month. You're not doing it for the now, you're doing it for your future self.",
  "created_utc": 1625376634,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A lot of people don&#39;t have much invested and many people will tell you, &quot;well, with that little, it&#39;s worthless to stake&quot;. </p>\n\n<p>Whether it&#39;s a few cents or a few dollars per month, the dollar amount now doesn&#39;t matter and shouldn&#39;t discourage you from doing the effort of a few clicks to stake, provide liquidity, lend, etc.</p>\n\n<p>If even a few of those coins you hodl and believe in go 10-100x in the next 5 years, it&#39;ll be worth doing the effort of a few clicks.</p>\n\n<p>Some of the easiest ways to earn crypto from your crypto:</p>\n\n<p>• Staking using central exchanges or a token&#39;s official wallet. Central exchanges like binance and coinbase have very good staking options. This is the easiest and most popular option imo. Just a reminder, Always secure your online exchange accounts with multiple authentication methods.</p>\n\n<p>• Providing liquidity on DEXes using a software wallet like metamask or trust. </p>\n\n<p>• You can even stake some tokens if they&#39;re on your ledger.</p>\n\n<p>• Lending on blockfi, nexo or Celsius.</p>\n\n<p>If you believe in a coin&#39;s potential, then you should be using your current holdings to farm more.</p>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/CryptoCurrency/comments/od6hdv/let_your_money_make_more_money_even_if_its_a_few/",
  "subreddit": "CryptoCurrency",
  "id": "od6hdv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "A lot of people don't have much invested and many people will tell you, \"well,\nwith that little, it's worthless to stake\".\n\nWhether it's a few cents or a few dollars per month, the dollar amount now\ndoesn't matter and shouldn't discourage you from doing the effort of a few\nclicks to stake, provide…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "多くの人があまり投資をしていないので、多くの人が「そんなことでは、賭けても意味がない」と言うでしょう。\nとおっしゃる方が多いのですが、そんなことはありません。\n\n月に数セントだろうが数ドルだろうが、今となっては金額は関係ありません。\n数回のクリックで賭けをする努力をすることを妨げるものではありません。\n数回のクリックでステイクすることを躊躇してはいけません。",
      "title": "月に数ドルでもいいから、お金でお金を増やしてあげてください。今の自分のためではなく、未来の自分のためにやるのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "很多人的投资不多，很多人会告诉你，\"嗯。\n就这么点钱，对赌注来说不值一提\"。\n\n不管是每月几美分还是几美元，现在的美元数额\n并不重要，也不应该阻止你做一些努力。\n点击入股，提供...",
      "title": "让你的钱赚更多的钱，哪怕是每月几美元。你这样做不是为了现在，而是为了未来的自己。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "很多人的投資不多，很多人會告訴你，\"嗯。\n就這麼點錢，對賭注來說不值一提\"。\n\n不管是每月幾美分還是幾美元，現在的美元數額\n並不重要，也不應該阻止你做一些努力。\n點擊入股，提供...",
      "title": "讓你的錢賺更多的錢，哪怕是每月幾美元。你這樣做不是爲了現在，而是爲了未來的自己。"
    }
  ]
}