{
  "author": "Salibih",
  "original_created_utc": 1636210430,
  "title": "I did a rug pull by mistake and it shows how crazy the market is",
  "created_utc": 1636224404,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was looking into ways to better understand crypto so I thought it would be a cool idea to create my own token, deploy it to the main net and even get it listed on an exchange (DEX of course).</p>\n\n<p>It was an easy decision for me to do this on the Binance Smart chain as I simply wanted to try it not having to pay the high fees when trying the same on the ethereum network.</p>\n\n<p>After having the ideaI thought about how to do this and my goal and budget was set very quickly.</p>\n\n<p>Budget: 30USD in BNB, had to move it from Binance to one of my wallets.</p>\n\n<p>Steps:\n1) Create a random coin on BSC smart chain using solidity and ethereum remix.\n2) Deploy it to the bsc chain and do some trades between my wallets.\n3) Check everything that happens on bscscan.\n4) Get it up and running on Pancake Swap.\n5) Buy a small amount with one of my wallets directly from Pancake Swap for test purposes.\n6) Remove liquidity and delete the imported tokens from my wallets.\n7) Be happy about having created my first crypto project in production.</p>\n\n<p>While doing all that some people randomly bought my coin on pancake swap. I saw the trades and was confused first. I had to check my wallets, the contract and everything as I did not believe that a random person bought this random shitcoin. Anyways I decided to move forward with my steps and after around 30min I removed the liquidity and received around 1.50$ more in BNB than I put in.</p>\n\n<p>So I guess that was my first and last rugpull - if you want to name it that way.</p>\n\n<p>Why am I posting this?</p>\n\n<p>Just a reminder that EVERYONE can create a token and get it listed within a couple of minutes. Don&#39;t buy every new shit that is listed on all these DEXes!</p>\n</div><!-- SC_ON -->",
  "score": 292,
  "permalink": "/r/CryptoCurrency/comments/qo1we1/i_did_a_rug_pull_by_mistake_and_it_shows_how/",
  "subreddit": "CryptoCurrency",
  "id": "qo1we1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was looking into ways to better understand crypto so I thought it would be a\ncool idea to create my own token, deploy it to the main net and even get it\nlisted on an exchange (DEX of course).\n\nIt was an easy decision for me to do this on the Binance Smart chain as I simply\nwanted to try it not…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号をもっと理解する方法を探していたので、自分で作った暗号を使うのはいいアイデアだと思いました。\n自分でトークンを作ってメインネットに展開し、さらにそれを上場させるというクールなアイデアを思いつきました。\n取引所（もちろんDEX）に上場させるのはクールなアイデアだと思いました。\n\nこれをBinanceスマートチェーンで行うことは、私にとっては簡単な決断でした。\n試してみたかったからです...",
      "title": "誤ってラグプルをしてしまい、市場がいかに狂っているかを示している"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我正在研究如何更好地理解加密货币，所以我认为这将是一个\n创建我自己的代币，并将其部署到主网上，甚至让它在电子市场上上市，将是一个很酷的想法。\n在一个交易所（当然是DEX）上市。\n\n对我来说，在Binance智能链上做这个决定是很容易的，因为我只需\n想尝试一下。",
      "title": "我错误地做了一个地毯式的拉动，这表明市场是多么疯狂。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我正在研究如何更好地理解加密貨幣，所以我認爲這將是一個\n創建我自己的代幣，並將其部署到主網上，甚至讓它在電子市場上上市，將是一個很酷的想法。\n在一個交易所（當然是DEX）上市。\n\n對我來說，在Binance智能鏈上做這個決定是很容易的，因爲我只需\n想嘗試一下。",
      "title": "我錯誤地做了一個地毯式的拉動，這表明市場是多麼瘋狂。"
    }
  ]
}