{
  "author": "VampAurora",
  "the_new_excerpt": "As posted in /r/PalantirTech earlier.\n__\n\nAlex Karp, the co-founder and CEO of Palantir Technologies (NYSE:PLTR), spoke\nvia teleconference on December 3 with Greek Prime Minister Kyriakos Mitsotakis\nabout Palantir’s ever-expanding partnership with the government of Greece to\nsupport their COVID-19…",
  "original_created_utc": 1607352458,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "正如之前在/r/PalantirTech中发布的。\n__\n\nPalantir Technologies(纽约证券交易所代码：PLTR)的联合创始人兼首席执行官亚历克斯·卡普发表了讲话\n通过12月3日与希腊总理Kyriakos Mitsotakis的电话会议\n关于Palantir与希腊政府不断扩大的伙伴关系\n支持他们的冠状病毒…",
      "title": "希腊政府和Palantir重申数字转型伙伴关系"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "正如之前在/r/PalantirTech中發佈的。\n__\n\nPalantir Technologies(紐約證券交易所代碼：PLTR)的聯合創始人兼首席執行官亞歷克斯·卡普發表了講話\n通過12月3日與希臘總理Kyriakos Mitsotakis的電話會議\n關於Palantir與希臘政府不斷擴大的夥伴關係\n支持他們的冠狀病毒…",
      "title": "希臘政府和Palantir重申數字轉型夥伴關係"
    }
  ],
  "title": "Greek Government and Palantir Reaffirm Digital Transformation Partnership",
  "created_utc": 1607945298,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As posted in <a href=\"/r/PalantirTech\">/r/PalantirTech</a> earlier.<br/>\n__</p>\n\n<p>Alex Karp, the co-founder and CEO of Palantir Technologies (NYSE:PLTR), spoke via teleconference on December 3 with Greek Prime Minister Kyriakos Mitsotakis about Palantir’s ever-expanding partnership with the government of Greece to support their COVID-19 response efforts. Dr. Karp and Prime Minister Mitsotakis were joined by Palantir Executive Josh Harris and Kyriakos Pierrakakis, Minister of Digital Governance of Greece, to explore new ways to keep Greece ahead of the curve with their public health response. </p>\n\n<p>Since the start of the pandemic, Palantir has worked with the Greek government to help enable data-driven decision-making in the context of the COVID-19 pandemic response. The government is leveraging Palantir’s Foundry software platform on top of Amazon Web Services infrastructure to deliver COVID-19 response workflows to government officials responding to the pandemic. Of particular value has been the deployment of a crisis-control center dashboard for the Prime Minister, which displays a holistic overview of the state of the COVID-19 pandemic in Greece in real time.</p>\n\n<p>“Our partnership with the Greek government was borne out of necessity once the pandemic began,” said Alex Karp, co-founder and CEO of Palantir Technologies. “We have readily played a key role in their COVID-19 response effort, which from our experience has been one of the best in the world, and we look forward to broadening this partnership for years to come.”</p>\n\n<p>The Ministry of Digital Governance, leading Greece’s rapid digital transformation, played a pivotal role in facilitating the partnership swiftly, enabling top decision makers to start generating actionable insights within a matter of days. As the pandemic continues to evolve, Palantir will deliver advanced integration and analytic capabilities to a range of government initiatives, to enable data-driven decision-making.</p>\n\n<p><strong>About Palantir</strong></p>\n\n<p>Palantir Technologies Inc. is a software company that builds enterprise data platforms for use by organizations with complex and sensitive data environments. From building safer cars and planes, to discovering new drugs and combating terrorism, Palantir helps customers across the public, private, and nonprofit sectors transform the way they use their data. Additional information is available at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.palantir.com%2F&amp;esheet=52343859&amp;newsitemid=20201207005526&amp;lan=en-US&amp;anchor=www.palantir.com&amp;index=1&amp;md5=9eded45bd34ee442f24ad9dcf3ce6164\">www.palantir.com</a>.</p>\n\n<p><strong>Forward-Looking Statements</strong></p>\n\n<p>This press release contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. These statements may relate to, but are not limited to, Palantir’s expectations regarding the partnership and the expected benefits of our software platforms. Forward-looking statements are inherently subject to risks and uncertainties, some of which cannot be predicted or quantified. Forward-looking statements are based on information available at the time those statements are made and were based on current expectations as well as the beliefs and assumptions of management as of that time with respect to future events. These statements are subject to risks and uncertainties, many of which involve factors or circumstances that are beyond our control. These risks and uncertainties include our ability to meet the unique needs of our customer; the failure of our platforms to satisfy our customer or perform as desired; the frequency or severity of any software and implementation errors; our platforms’ reliability; and our customer’s ability to modify or terminate the partnership. Additional information regarding these and other risks and uncertainties is included in the filings we make with the Securities and Exchange Commission from time to time. Except as required by law, we do not undertake any obligation to publicly update or revise any forward-looking statement, whether as a result of new information, future developments, or otherwise.  </p>\n\n<p>Source: <a href=\"https://www.businesswire.com/news/home/20201207005526/en/Greek-Government-and-Palantir-Reaffirm-Digital-Transformation-Partnership#.X848jdHF08M.reddit\">https://www.businesswire.com/news/home/20201207005526/en/Greek-Government-and-Palantir-Reaffirm-Digital-Transformation-Partnership#.X848jdHF08M.reddit</a></p>\n</div><!-- SC_ON -->",
  "score": 736,
  "permalink": "/r/stocks/comments/k8hwg6/greek_government_and_palantir_reaffirm_digital/",
  "subreddit": "stocks",
  "id": "k8hwg6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609260493094
}