{
  "author": "astrocnp",
  "original_created_utc": 1626736289,
  "title": "Today I sent some Bitcoin to my Venezuelan friend who was Playing mobile COD for 1 year.",
  "created_utc": 1626745346,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have been playing COD for almost year now. I met this Venezuelan friend through online and he a very good person. He has not knowingly helped me during rough times. Today i joked about bitcoin and ask for his address and for the first time i sent some bitcoin ( not a lot)  to my online friend as an appreciation for his kindness. He was so happy with the surprise transaction. Thanks to Bitcoin i believe, i made someone happy. Spread the kindness. Live Long Bitcoin. !!</p>\n</div><!-- SC_ON -->",
  "score": 198,
  "permalink": "/r/Bitcoin/comments/onpnxs/today_i_sent_some_bitcoin_to_my_venezuelan_friend/",
  "subreddit": "Bitcoin",
  "id": "onpnxs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I have been playing COD for almost year now. I met this Venezuelan friend\nthrough online and he a very good person. He has not knowingly helped me during\nrough times. Today i joked about bitcoin and ask for his address and for the\nfirst time i sent some bitcoin ( not a lot) to my online friend as…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はCODをプレイし始めて約1年になります。このベネズエラ人の友人とはオンラインで知り合いました。\nオンラインで知り合ったのですが、彼はとても良い人でした。彼は知らず知らずのうちに、私が大変な時に助けてくれた。\n困った時に助けてくれました。今日、私はビットコインについて冗談を言って、彼のアドレスを聞いてみました。\n初めてオンラインの友人にビットコインを送ってみました（大した額ではありません）。",
      "title": "今日、私は1年間携帯電話のCODをプレイしていたベネズエラ人の友人にビットコインを送った。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我玩COD已经快一年了。我在网上认识了这位委内瑞拉的朋友\n他是一个非常好的人。在我遇到困难的时候，他不知不觉地帮助了我。\n困难的时候帮助我。今天我开了个关于比特币的玩笑，问他的地址，并且\n我第一次给我的网上朋友发送了一些比特币（不是很多），作为...",
      "title": "今天我给我的委内瑞拉朋友发送了一些比特币，他玩了1年的移动COD。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我玩COD已經快一年了。我在網上認識了這位委內瑞拉的朋友\n他是一個非常好的人。在我遇到困難的時候，他不知不覺地幫助了我。\n困難的時候幫助我。今天我開了個關於比特幣的玩笑，問他的地址，並且\n我第一次給我的網上朋友發送了一些比特幣（不是很多），作爲...",
      "title": "今天我給我的委內瑞拉朋友發送了一些比特幣，他玩了1年的移動COD。"
    }
  ]
}