{
  "author": "StephenMoore34",
  "original_created_utc": 1638963423,
  "title": "Can a court appointed lawyer refuse to defend someone if they really can't stomach the crimes they committed?",
  "created_utc": 1638974854,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For example; imagine a serial murderer, rapist, child rapist, arsonist etc... was arrested and taken to court. The person is WELL known and has been making headlines for months. &lt;/p&gt;\n\n&lt;p&gt;Can a court appointed lawyer refuse to represent them if they simply can&amp;#39;t stand to be anywhere near that person? They find the crimes they committed so appalling, that the money they could get just simply isn&amp;#39;t worth it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 108,
  "permalink": "/r/NoStupidQuestions/comments/rbpfwz/can_a_court_appointed_lawyer_refuse_to_defend/",
  "subreddit": "NoStupidQuestions",
  "id": "rbpfwz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "For example; imagine a serial murderer, rapist, child rapist, arsonist etc...\nwas arrested and taken to court. The person is WELL known and has been making\nheadlines for months.\n\nCan a court appointed lawyer refuse to represent them if they simply can't stand\nto be anywhere near that person? They…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "例えば、連続殺人犯、強姦魔、児童強姦魔、放火魔などがいたとします。\nが逮捕され、裁判にかけられたとします。その人物はよく知られた人物であり、そのことが話題になりました。\n数ヶ月に渡るヘッドライン\n\n裁判所が選任した弁護士は、もし彼らの弁護を拒否することができるでしょうか。\nその人に近づくことはできないのでしょうか？彼らは...",
      "title": "国選弁護人は、自分が犯した犯罪を本当に腹に据えかねる場合、弁護を拒否できるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "例如；设想一个连环杀人犯、强奸犯、儿童强奸犯、纵火犯等。\n被逮捕并被带上法庭。这个人是众所周知的，并且已经成为了\n几个月来一直是头条新闻。\n\n法院指定的律师是否可以拒绝代表他们，如果他们根本无法忍受\n靠近那个人的地方？他们...",
      "title": "如果一个人真的无法忍受他们所犯的罪行，法院指定的律师可以拒绝为其辩护吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "例如；設想一個連環殺人犯、強姦犯、兒童強姦犯、縱火犯等。\n被逮捕並被帶上法庭。這個人是衆所周知的，並且已經成爲了\n幾個月來一直是頭條新聞。\n\n法院指定的律師是否可以拒絕代表他們，如果他們根本無法忍受\n靠近那個人的地方？他們...",
      "title": "如果一個人真的無法忍受他們所犯的罪行，法院指定的律師可以拒絕爲其辯護嗎？"
    }
  ]
}