{
  "author": "hannes_throw_far",
  "original_created_utc": 1626077541,
  "title": "How does one deal with the problem of adopting/sympathizing with every position right after reading a comprehensive defense?",
  "created_utc": 1626096455,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Whenever I dive into some position or theory in philosophy, and read a book on it, I end up strongly sympathizing with it and think ok this was really plausible. But then I think that&#39;s no surprise: I just read a book-length treatment on it, while having limited exposure to the whole debate outside of that. Of course if a professional has the opportunity to present me their point of view for 300 pages without anyone interrupting them, this is going to be the most substantial take on the issue I&#39;ve heard so far. </p>\n\n<p>Then this whole story seems to continue. Whenever I keep reading and keep diving into the topic, I almost always switch to whatever I&#39;ve read last, in as far as it&#39;s a response to something I read previously. Like, </p>\n\n<p>Here&#39;s why A is true. </p>\n\n<p>Me: I agree, that was convincing.</p>\n\n<p>Here&#39;s why A is false and B is true. </p>\n\n<p>Me: Right, that makes sense.</p>\n\n<p>No, actually this doesn&#39;t work, see the next 200 pages for why.</p>\n\n<p>Me: Yeah, that totally doesn&#39;t work.</p>\n\n<p>This way I feel like my convictions are just contingent on a time line along my reading habits. But it&#39;s also difficult to imagine something else happening while I&#39;m reasonable: As a novice, I&#39;ll probably not refute an expert ad hoc, after being confronted with their best arguments.  How to go about this?</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/askphilosophy/comments/oimxl6/how_does_one_deal_with_the_problem_of/",
  "subreddit": "askphilosophy",
  "id": "oimxl6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Whenever I dive into some position or theory in philosophy, and read a book on\nit, I end up strongly sympathizing with it and think ok this was really\nplausible. But then I think that's no surprise: I just read a book-length\ntreatment on it, while having limited exposure to the whole debate outside…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "哲学のある立場や理論に飛び込んで、それに関する本を読むたびに\n強く共感し、「これは本当に正しい」と思ってしまうのです。\nと思ってしまいます。しかし、それは当然のことだと思います。\nしかし、それは当然のことだと思います。私は、外ではその議論全体にあまり触れていないのに、それに関する長編本を読んだのですから。",
      "title": "包括的な防衛策を読んだ直後に、すべてのポジションを採用／共感してしまうという問題にどう対処するか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "每当我潜心研究哲学中的某些立场或理论，并阅读有关书籍时\n时，我都会对它表示强烈的同情，并认为这真的是\n是合理的。但后来我想这并不奇怪：我刚刚读了一本长篇的\n而对整个辩论的接触有限......",
      "title": "如何处理在读完全面的辩护后马上采纳/同情每个立场的问题？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "每當我潛心研究哲學中的某些立場或理論，並閱讀有關書籍時\n時，我都會對它表示強烈的同情，並認爲這真的是\n是合理的。但後來我想這並不奇怪：我剛剛讀了一本長篇的\n而對整個辯論的接觸有限......",
      "title": "如何處理在讀完全面的辯護後馬上採納/同情每個立場的問題？"
    }
  ]
}