{
  "author": "LorenzoApophis",
  "original_created_utc": 1631501977,
  "title": "Wikipedia's article on US Civil War prison camps has a pretty disturbing picture of an almost literally skeletal but apparently still living survivor of one. Is the identity of this particular soldier known? What happened to him?",
  "created_utc": 1631518026,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The picture is at the top of this page: <a href=\"https://en.wikipedia.org/wiki/American_Civil_War_prison_camps\">https://en.wikipedia.org/wiki/American_Civil_War_prison_camps</a></p>\n\n<p>My curiosity was raised because he really doesn&#39;t seem to be in a condition one would recover from - I doubt he could even move in his state - but the caption claims he was still &quot;barely alive&quot; at the time. It also says he was in the Union and was liberated from Andersonville in May 1865, but nothing else. Given that a photo was taken of him, are there any other records of who this was and whether he survived?</p>\n</div><!-- SC_ON -->",
  "score": 109,
  "permalink": "/r/AskHistorians/comments/pn712a/wikipedias_article_on_us_civil_war_prison_camps/",
  "subreddit": "AskHistorians",
  "id": "pn712a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The picture is at the top of this page:\nhttps://en.wikipedia.org/wiki/American_Civil_War_prison_camps\n\nMy curiosity was raised because he really doesn't seem to be in a condition one\nwould recover from - I doubt he could even move in his state - but the caption\nclaims he was still \"barely alive\" at…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "写真はこのページの一番上にあります。\nhttps://en.wikipedia.org/wiki/American_Civil_War_prison_camps\n\n私が興味を持ったのは、彼が本当に回復できるような状態ではないように思えたからです。\nこの状態では動くことすらできないのではないかと思ったからです。\nしかし、キャプションによると、彼はまだ「かろうじて生きている」と主張しています...",
      "title": "ウィキペディアの南北戦争の収容所に関する記事には、ほとんど文字通り骸骨のようになっているが、まだ生きていると思われる生存者のかなり不穏な写真が掲載されている。この特定の兵士の身元はわかっているのでしょうか？彼に何が起こったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "图片在本页面的顶部。\nhttps://en.wikipedia.org/wiki/American_Civil_War_prison_camps\n\n我的好奇心被激发出来了，因为他看起来真的不是一个可以恢复的状态。\n痊愈--我怀疑他在这种状态下甚至可以移动--但标题是\n声称他仍然 \"勉强活着\"，在...",
      "title": "维基百科关于美国内战战俘营的文章中有一张相当令人不安的照片，照片中的幸存者几乎是一副骨架，但显然还活着。这个特殊的士兵的身份是否为人所知？他的情况如何？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "圖片在本頁面的頂部。\nhttps://en.wikipedia.org/wiki/American_Civil_War_prison_camps\n\n我的好奇心被激發出來了，因爲他看起來真的不是一個可以恢復的狀態。\n痊癒--我懷疑他在這種狀態下甚至可以移動--但標題是\n聲稱他仍然 \"勉強活着\"，在...",
      "title": "維基百科關於美國內戰戰俘營的文章中有一張相當令人不安的照片，照片中的倖存者幾乎是一副骨架，但顯然還活着。這個特殊的士兵的身份是否爲人所知？他的情況如何？"
    }
  ]
}