{
  "author": "AjaxFC1900",
  "the_new_excerpt": "Janet Yellen will use her first major address as Treasury secretary to argue for\na global minimum corporate tax rate, Axios has learned, as she makes the case\nfor President Biden’s plan to raise U.S. corporate taxes to fund his $2\ntrillion+ infrastructure plan.\n\nWhy it matters: Convincing other…",
  "original_created_utc": 1617621456,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "珍妮特-耶伦将用她作为财政部长的首次重要讲话来论证。\n全球最低企业税率，Axios了解到，因为她提出的理由是\n为拜登总统提高美国企业税以资助其2美元的计划。\n万亿以上的基础设施计划。\n\n为什么它很重要。说服其他...",
      "title": "珍妮特-耶伦将呼吁提高全球最低税率"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "珍妮特-耶倫將用她作爲財政部長的首次重要講話來論證。\n全球最低企業稅率，Axios瞭解到，因爲她提出的理由是\n爲拜登總統提高美國企業稅以資助其2美元的計劃。\n萬億以上的基礎設施計劃。\n\n爲什麼它很重要。說服其他...",
      "title": "珍妮特-耶倫將呼籲提高全球最低稅率"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "ジャネット・イエレンは、財務長官としての最初の主要な演説で、世界的な最低法人税率の導入を主張する予定です。\nAxiosによると、イエレン議長は財務長官としての最初の主要な演説で、グローバルな最低法人税率の導入を主張する予定です。\nこれは、バイデン大統領が2兆ドル以上のインフラ整備計画のために米国の法人税を引き上げる計画を支持するためです。\n兆ドル以上のインフラ計画のために米国の法人税を引き上げるというバイデン大統領の計画を支持していることがAxiosによって明らかになりました。\n\nなぜそれが重要なのか。他の国の人々を説得することは...",
      "title": "ジャネット・イエレン氏、グローバル・ミニマム・タックスを提唱"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "ジャネット・イエレンは、財務長官としての最初の主要な演説で、世界的な最低法人税率の導入を主張する予定です。\nAxiosによると、イエレン議長は財務長官としての最初の主要な演説で、グローバルな最低法人税率の導入を主張する予定です。\nこれは、バイデン大統領が2兆ドル以上のインフラ整備計画のために米国の法人税を引き上げる計画を支持するためです。\n兆ドル以上のインフラ計画のために米国の法人税を引き上げるというバイデン大統領の計画を支持していることがAxiosによって明らかになりました。\n\nなぜそれが重要なのか。他の国の人々を説得することは...",
      "title": "ジャネット・イエレン氏、グローバル・ミニマム・タックスを提唱"
    }
  ],
  "title": "Janet Yellen to call for global minimum tax rate",
  "created_utc": 1617648294,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Janet Yellen will use her first major address as Treasury secretary to argue for a global minimum corporate tax rate, Axios has learned, as she makes the case for President Biden’s plan to raise U.S. corporate taxes to fund his $2 trillion+ infrastructure plan.</p>\n\n<p>Why it matters: Convincing other countries to impose a global minimum tax would reduce the likelihood of companies relocating offshore, as Biden seeks to increase the corporate rate from 21% to 28%.</p>\n\n<p>“Competitiveness is about more than how U.S.-headquartered companies fare against other companies in global merger and acquisition bids,” Yellen will say today in a speech to the Chicago Council on Global Affairs, according to an excerpt of her prepared remarks obtained by Axios.\n&quot;It is about making sure that governments have stable tax systems that raise sufficient revenue to invest in essential public goods and respond to crises, and that all citizens fairly share the burden of financing government.&quot;\n&quot;We are working with G20 nations to agree to a global minimum corporate tax rate that can stop the race to the bottom.&quot;\nThe big picture: President Trump lowered the U.S. rate from 35% to 21%, arguing that U.S. companies were at a global disadvantage and were being incentivized to relocate offshore.</p>\n\n<p>The average corporate rate in the G7 is 24%, with some nine countries recently lowering their corporate rate, according to the Tax Foundation, a conservative tax group.\nBiden’s plan would also raise the international minimum rate for foreign profits from U.S. companies from 10.5% to 21%, which would still be lower than the 28% domestic corporate rate.\nDriving the news: Biden has tapped five Cabinet secretaries to explain — and sell — his plan to the American public, including Transportation Secretary Pete Buttigieg, Energy Secretary Jennifer Granholm, Housing and Urban Development Secretary Marcia Fudge, Labor Secretary Marty Walsh and Commerce Secretary Gina Raimondo.</p>\n\n<p>Yellen’s task is to make the international case. Her speech also is designed to set the tone for the annual spring International Monetary Fund and World Bank meetings in Washington, which will begin virtually this week.\nBetween the lines: Biden has been relying on Yellen to convince the business community and reassure Wall Street that his $2 trillion+ infrastructure proposal, on top of his $1.9 trillion stimulus package, won’t lead to inflation.</p>\n\n<p>Now he’s deploying her to convince international finance ministers and central bankers that the world’s biggest economies need to act in concert on corporate rates to avoid a race to the bottom.\nGo deeper: Yellen will also challenge the world’s economic powers to focus on climate change and on ways to improve vaccine access for the world’s poorest countries.</p>\n\n<p>She will call for $650 billion in new “Special Drawing Rights” — essentially lines of credit at the IMF that can help developing countries access more U.S. dollars.\nThe Trump administration was skeptical of new SDR allocations and many congressional Republicans are still opposed.\nThe bottom line: By trying to convince other countries to impose a global minimum tax, Yellen is acknowledging the risks to the American economy if it acts alone in raising corporate rates.</p>\n\n<p>“Together we can use a global minimum tax to make sure the global economy thrives based on a more level playing field in the taxation of multinational corporations, and spurs innovation, growth, and prosperity,” she will say.</p>\n\n<p>Source  : <a href=\"https://www.axios.com/janet-yellen-global-minimum-tax-rate-51c7395b-e46a-4a5c-b18b-bdcf5d8bd352.html\">https://www.axios.com/janet-yellen-global-minimum-tax-rate-51c7395b-e46a-4a5c-b18b-bdcf5d8bd352.html</a></p>\n</div><!-- SC_ON -->",
  "score": 288,
  "permalink": "/r/stocks/comments/mki9or/janet_yellen_to_call_for_global_minimum_tax_rate/",
  "subreddit": "stocks",
  "id": "mki9or",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961878990
}