{
  "author": "atomthe7",
  "original_created_utc": 1626363585,
  "title": "I live off of Bitcoin, and I still don't understand how it works",
  "created_utc": 1626396923,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello, I&#39;m not used to this site so forgive if I get something wrong. But I did read the rules.<br/>\nI&#39;m not an &quot;internet guy&quot;, my son showed me Reddit some time ago. I didn&#39;t give much attention to it, it&#39;s not my kind of thing. Today I opened it again and found out there is a community here about Bitcoin.  </p>\n\n<p>My story is that I &quot;bought&quot; it when it was cheap in 2013. I was selling my car to a friend of mine, he didn&#39;t have all the money to buy it, just a part of it. He asked me to split the amount in installments. I declined, I don&#39;t like installments. Then he asked if he could pay for the rest of the value with his Bitcoins.  </p>\n\n<p>He explained for a long time what it was, and why it worked like money. At first, I didn&#39;t like the idea. But I wasn&#39;t needing all the money at that time, and he said he could buy it back. So we did it.  </p>\n\n<p>He teached me to use it though I didn&#39;t really used it for a long time. It was just sitting there. Of course I heard the news that it was getting value. This same friend told me to buy a physical wallet to hold it. He said it was more safe, and I agree. I also like to have something that is not just in my computer.  </p>\n\n<p>In the last years, I retired earlier. Every month I sell some of my Bitcoins to this same friend. Not any insane amount, just what I need for my family expenses etc. And sometimes some more when I need to buy something new.  </p>\n\n<p>I don&#39;t live a live of luxuries. I have a good house, a good car. I pay for my children college and school and we do some family travels together. And I guaranteed they have a house to live. That&#39;s enough for me  </p>\n\n<p>That&#39;s it, I&#39;m not in any Bitcoin related community or discussion. I don&#39;t know how it works. My friend tried to explain me a lot of times. I know enough about it to use all these years. I know how to send, how to receive and I have my pass phrase in a paper well hidden.  </p>\n\n<p>I read about how you guys buy and sell it all the time. I&#39;m not any specialist and I might be wrong. But maybe you just need a little more patience. It took a long time for my Bitcoins to be worth something.  </p>\n\n<p>Excuse me if I don&#39;t reply you. As I said, I don&#39;t really use Reddit<br/>\nAlso excuse me if I made any grammatical errors, english is not my first language and I don&#39;t live in an english speaking country.</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/Bitcoin/comments/okvdub/i_live_off_of_bitcoin_and_i_still_dont_understand/",
  "subreddit": "Bitcoin",
  "id": "okvdub",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hello, I'm not used to this site so forgive if I get something wrong. But I did\nread the rules.\nI'm not an \"internet guy\", my son showed me Reddit some time ago. I didn't give\nmuch attention to it, it's not my kind of thing. Today I opened it again and\nfound out there is a community here about…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは、私はこのサイトに慣れていないので、何か間違っていたら許してください。しかし、私は\nルールを読みました。\n私は「インターネットの達人」ではありませんが、息子が何年か前にRedditを見せてくれました。私はあまり気にしませんでした。\n私の好みではないので、あまり気にしていませんでした。今日、私は再びそれを開いて\nここにはコミュニティがあることを知りました。",
      "title": "私はビットコインで生活していますが、いまだにその仕組みを理解していません"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好，我不太习惯这个网站，如果我弄错了什么，请原谅。但我确实\n阅读了规则。\n我不是一个 \"互联网人\"，我儿子前段时间给我看了Reddit。我并没有给予\n我没怎么注意它，它不是我喜欢的类型。今天，我再次打开它，发现这里有一个关于 \"网络 \"的社区。\n发现这里有一个社区，关于...",
      "title": "我靠比特币生活，但我还是不明白它是如何运作的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好，我不太習慣這個網站，如果我弄錯了什麼，請原諒。但我確實\n閱讀了規則。\n我不是一個 \"互聯網人\"，我兒子前段時間給我看了Reddit。我並沒有給予\n我沒怎麼注意它，它不是我喜歡的類型。今天，我再次打開它，發現這裏有一個關於 \"網絡 \"的社區。\n發現這裏有一個社區，關於...",
      "title": "我靠比特幣生活，但我還是不明白它是如何運作的。"
    }
  ]
}