{
  "author": "invest_opinions",
  "original_created_utc": 1639232870,
  "title": "Bitcoin is Officially Stronger Now Than Before China Mining Ban. Hashrate higher 113% Compared to Hashrate Before the Ban, Price Will Follow Up Soon! Here is Why:",
  "created_utc": 1639269315,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Silverline:&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Why is important to understand this numbers and this numbers are shaping on long term the BTC price charts.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Note: Looking at the price of #BTC, I believe there are some things every BTC owner should know.&lt;/p&gt;\n\n&lt;p&gt;Plus, every little bit helps to morally support BTC owners so they don&amp;#39;t get bullied by BigMOney corporations in to selling BTC cheap out of fear.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Most of pple reading this here would know that but I thought it might be helpful for new memebersso bare with me if you feel this is elementary.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;When analyzing the possible price movements of an asset we need to consider 2 factors: production costs and demand.&lt;/p&gt;\n\n&lt;p&gt;So demand is dependent by market &amp;quot;feelings&amp;quot;, Investment Funds jumping, Mainstream Media positive or negative coverage, etc. Most of the time this gives the momentum, sharp movements in short period of times.&lt;/p&gt;\n\n&lt;p&gt;On a long term we need to consider the production costs. And here the Hashrate is essential.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;BTC and Hashrate&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I love #BTC because it has transparency, clear numbers.  Hashrate is one of those numbers showing the ammount of computational power invested to encrypt/mine the next block.&lt;/p&gt;\n\n&lt;p&gt;Why is this important?&lt;/p&gt;\n\n&lt;p&gt;Computational power = hightech hardware + energy = money as in cash $$$$.&lt;/p&gt;\n\n&lt;p&gt;With more money invested for hunting new BTC blocks, obviousy the cost of every BTC in the market is increasing.&lt;/p&gt;\n\n&lt;p&gt;You can factor in the inflation too. Semiconductor shortage and energy prices booming this year are also contributing to the cost of every BTC block.&lt;/p&gt;\n\n&lt;p&gt;So, mining a BTC block requieres now more computational power than ever. Look at the chart (courtesy of Blockchain)&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/0a2xqcg76x481.png?width=1203&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=3d6b43b7227f72b4f380c25d85a09f7b3737f302\"&gt;https://preview.redd.it/0a2xqcg76x481.png?width=1203&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=3d6b43b7227f72b4f380c25d85a09f7b3737f302&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;But hey, the cost of that computation power (Hashrate) has increased too.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Semiconductors cost fo production are at the highest level this year:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/fa9msvd97x481.png?width=1762&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=c593663e8504dee9e4277ef409bb337faad71d32\"&gt;Semiconductors cost of manufacturing&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Enrrgy prices are also at the high end, even if Aug-Oct 2021 have seen the tip in energy prices at least for now.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/1aqxq0c58x481.png?width=1240&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=a5e3215ca53c85653c62a1ca0e80d089efc9bceb\"&gt;electric energy price North America last 3Y&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;With supply chain disruptions &amp;amp; high inflation expected in 2022 too, we can not expect to see this costs go down. Even more with renewable energy political push, the cost of electricity will get more and more expensive. Gas - that used to be the cheapest energy resource is at an historically high price.&lt;/p&gt;\n\n&lt;p&gt;In conclusion we can expect computational power/ hash power to get more expensive in 2022 too.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Getting back to BTC - This is why your BTC, even counting on the same demand, is worth more than ever.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Gold line : Every BTC block that was mined in December  was more expensive than ever because it took more computational power than ever and that computational power was more expensive to produce.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Looking forward in 2022, Mastercard (with $BKKT), Visa, Finserv, Hedge funds and many more market makers that manage collectively hundreds of billions, wil need BTC. When they will need it they&amp;#39;ll have to buy. Nobody (from the miners) will sell under the cost price that is highest then ever right now! Why they won&amp;#39;t sell? &lt;strong&gt;Because it will cost even more in 2022 to mine a BTC block!&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Now, do you see why you should hold your $BTC?&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 162,
  "permalink": "/r/Bitcoin/comments/re0vdn/bitcoin_is_officially_stronger_now_than_before/",
  "subreddit": "Bitcoin",
  "id": "re0vdn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Silverline:\n\nWhy is important to understand this numbers and this numbers are shaping on long\nterm the BTC price charts.\n\nNote: Looking at the price of #BTC, I believe there are some things every BTC\nowner should know.\n\nPlus, every little bit helps to morally support BTC owners so they don't…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "シルバーライン\n\nなぜこの数字を理解することが重要なのか、この数字は長期的に形成されています。\nBTCの価格チャートを長期的に見ることができます。\n\n注：#BTCの価格を見ていると、すべてのBTCにあるものがあると思います。\nの所有者は知っておくべきでしょう。\n\nさらに、少しでもBTCオーナーを道徳的にサポートすることで、BTCオーナーが...",
      "title": "ビットコインは中国のマイニング禁止前よりも公式に強くなった。ハッシュレートは禁止前のハッシュレートに比べて113％上昇、価格もすぐに追随する! 理由はここにある。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "银线。\n\n为什么要理解这个数字，这个数字是在长期的\nBTC价格图表。\n\n注：看了#BTC的价格，我相信有一些事情是每个BTC\n拥有者都应该知道。\n\n另外，每一点都有助于从道德上支持BTC所有者，使他们不...",
      "title": "比特币现在正式比中国采矿禁令前更强大。与禁令前的Hashrate相比，Hashrate提高了113%，价格将很快跟进! 这就是原因。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "銀線。\n\n爲什麼要理解這個數字，這個數字是在長期的\nBTC價格圖表。\n\n注：看了#BTC的價格，我相信有一些事情是每個BTC\n擁有者都應該知道。\n\n另外，每一點都有助於從道德上支持BTC所有者，使他們不...",
      "title": "比特幣現在正式比中國採礦禁令前更強大。與禁令前的Hashrate相比，Hashrate提高了113%，價格將很快跟進! 這就是原因。"
    }
  ]
}