{
  "author": "AwesomenessPie",
  "the_new_excerpt": "I wanted to share with you an experience that I had today. This happens to me\nall too often. I guess I am not a good trader, but you can learn from my\nmistakes.\n\nToday I bought ORPH in premarket at a \"good\" entry price. I held through open,\nthrough the halts, and watched my unrealized gains…",
  "original_created_utc": 1623454607,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日は、私が体験したことを皆さんにお伝えしたいと思います。このようなことは、私にとって\nあまりにも頻繁に起こります。私は優秀なトレーダーではないと思いますが、私の失敗から学ぶことができます。\n私の失敗から学ぶことができます。\n\n今日、私はプレマーケットでORPHを「良い」エントリー価格で買いました。オープンからホールドしました。\n含み益が出ているのを見ていました。",
      "title": "\"利益を得て破産した人はいない」-個人的な体験談"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想和你们分享我今天的一个经历。这事发生在我身上\n太频繁了。我想我不是一个好的交易员，但你可以从我的\n错误。\n\n今天我在盘前以一个 \"好 \"的进场价买入ORPH。我一直持有到开盘。\n通过停盘，看着我未实现的收益......",
      "title": "\"从来没有人因为获取利润而破产\"--一个人的经历"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想和你們分享我今天的一個經歷。這事發生在我身上\n太頻繁了。我想我不是一個好的交易員，但你可以從我的\n錯誤。\n\n今天我在盤前以一個 \"好 \"的進場價買入ORPH。我一直持有到開盤。\n通過停盤，看着我未實現的收益......",
      "title": "\"從來沒有人因爲獲取利潤而破產\"--一個人的經歷"
    }
  ],
  "title": "\"Nobody Ever Went Broke Taking Profits\" - A personal experience",
  "created_utc": 1623463485,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I wanted to share with you an experience that I had today. This happens to me all too often. I guess I am not a good trader, but you can <strong>learn from my mistakes</strong>.</p>\n\n<p>Today I bought ORPH in premarket at a &quot;good&quot; entry price. I held through open, through the halts, and watched my unrealized gains accumulate. At the highest point I was <strong>up 65%</strong>. I could have taken profits. I could have taken some off... <strong>I got greedy, or hopeful, or whatever</strong>...</p>\n\n<p>I thought it could go higher... <strong>I held</strong>.</p>\n\n<p>I held on the way down all day long, waiting for a reversal that never came. I am now <strong>down 5%</strong>. I know some other people have lost a lot more than me, but it really hit me hard because I really could have used some gains for a change. It&#39;s made a bit worse because I was up almost all day. And I just kept hoping for a reversal, despite the <strong>obvious downtrend and loss of volume</strong>.</p>\n\n<p>If someone can learn something from my mistake, I don&#39;t mind some of you making fun of me. A winning trade can easily turn into a losing trade.</p>\n\n<p>Remember: <strong>&quot;Nobody ever went broke taking profit.&quot;</strong></p>\n\n<p>Thank you! Good luck to you all.</p>\n</div><!-- SC_ON -->",
  "score": 580,
  "permalink": "/r/stocks/comments/nxtbig/nobody_ever_went_broke_taking_profits_a_personal/",
  "subreddit": "stocks",
  "id": "nxtbig",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009743455
}