{
  "author": "mic_droo",
  "original_created_utc": 1642247317,
  "title": "Remember Nano, this sub's (former?) favorite coin? It left the top 200 for the first time since 2017 today",
  "created_utc": 1642260728,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Remember Nano? That coin that really shot up from, like, $0.15 in November 2017 to $33 two months later? It even was in the top 20 for a bit. Well, I suppose many people on here must have bought close to ATH back then, because they always REALLY wanted it to go there again and talked about their love for it a lot&lt;/p&gt;\n\n&lt;p&gt;Unfortunately it never did. It was hit HARD by the bear market of 2018ff., even went below $0.4. While it did quite well in the bullrun of 2021, it was one of those coins that stayed way below their 2017-2018 ATHs, it got close to $15. Other than most other formerly huge coins that didn&amp;#39;t reach a new ATH this bull run - stuff like XRP, BCH, EOS, NEO, DASH... - which don&amp;#39;t get a lot of love on here, Nano stayed a sub favorite, I don&amp;#39;t think any other coin outside the top 100 (except Moons) is mentioned this often.&lt;/p&gt;\n\n&lt;p&gt;Speaking of the top 100: you can see how much this sub loves Nano, if you read &lt;a href=\"https://np.reddit.com/r/CryptoCurrency/comments/og5u6m/its_official_nano_is_no_longer_among_the_top_100/\"&gt;this post&lt;/a&gt; from last July, when it left the top 100 - OP was at a &amp;quot;loss for words&amp;quot;, how could a coin that was &amp;quot;perfect: Instant. Feeless. Green&amp;quot; not be much higher? Many people agreed, the post has over 5k upvotes. I would argue the post was a bit dramatic - Nano hat only re-entered the top 100 3 months earlier after spending a few weeks below that - but you see how much love there is for the coin.&lt;/p&gt;\n\n&lt;p&gt;Today, it left the top 200 for the first time since its big explosion in late 2017, as I am writing this it&amp;#39;s 202 on Coingecko, -91% since ATH, the downtrend has been pretty consistent the past few months.&lt;/p&gt;\n\n&lt;p&gt;What do you think about Nano? Do you still believe in it, do you think it will break its ATH ever again? Do you think it&amp;#39;s a dead coin that will just continue to go down? Other coins have been declared dead for less but hey, it&amp;#39;s crypto, anything can happen&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 411,
  "permalink": "/r/CryptoCurrency/comments/s4iozd/remember_nano_this_subs_former_favorite_coin_it/",
  "subreddit": "CryptoCurrency",
  "id": "s4iozd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Remember Nano? That coin that really shot up from, like, $0.15 in November 2017\nto $33 two months later? It even was in the top 20 for a bit. Well, I suppose\nmany people on here must have bought close to ATH back then, because they always\nREALLY wanted it to go there again and talked about their…"
}