{
  "author": "benjaneson",
  "original_created_utc": 1653306176,
  "title": "At the founding meeting of Nottingham Forest FC in 1865, the committee decided that the team colour should be \"Garibaldi red\", in honour of Giuseppe Garibaldi (and until this day, the club's players wear that colour). Why was a group of amateur athletes from the English Midlands honouring Garibaldi?",
  "created_utc": 1653369598,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Fun fact: when Arsenal FC was founded (as Dial Square FC) in 1886, two of its founding members were former Forest players who had moved to Woolwich for work. They wrote home for help with founding the new club, and Nottingham Forest FC sent them a set of kit and a ball. Because of that, Arsenal FC&amp;#39;s kit colour is red (the white sleeves were added in 1933).&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/uvya3i/at_the_founding_meeting_of_nottingham_forest_fc/",
  "subreddit": "AskHistorians",
  "id": "uvya3i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Fun fact: when Arsenal FC was founded (as Dial Square FC) in 1886, two of its\nfounding members were former Forest players who had moved to Woolwich for work.\nThey wrote home for help with founding the new club, and Nottingham Forest FC\nsent them a set of kit and a ball. Because of that, Arsenal…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アーセナルFCが1886年にダイヤル・スクエアFCとして創設されたとき、創設メンバーのうち2人がウリッジに移り住んだ元フォレスト選手だったという面白い事実があります。\n元Forestの選手で、仕事のためにWoolwichに引っ越してきた2人が創立メンバーでした。\n彼らは新クラブの設立を手助けするために故郷に手紙を書き、ノッティンガム・フォレストFCはキットとボール一式を送りました。\nは道具一式とボールを送りました。そのおかげで、アーセナルは...",
      "title": "1865年、ノッティンガム・フォレストFCの設立総会で、ジュゼッペ・ガリバルディに敬意を表して、チームカラーを「ガリバルディ・レッド」にすることが決定された（今日まで、クラブの選手はこのカラーを着用している）。なぜ、イギリス中部のアマチュア選手たちがガリバルディを称えたのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有趣的事实：当阿森纳俱乐部在1886年成立时（作为拨号广场俱乐部），它的两个创始成员是前森林队球员，他们搬到了伍尔维奇工作。\n创始成员是搬到伍尔维奇工作的前森林队球员。\n他们写信回家请求帮助建立新俱乐部，诺丁汉森林俱乐部\n送给他们一套装备和一个球。因为这个原因，阿森纳...",
      "title": "在1865年诺丁汉森林俱乐部的成立会议上，委员会决定球队的颜色应该是 \"加里波第红\"，以纪念朱塞佩-加里波第（直到今天，俱乐部的球员还穿着这个颜色）。一群来自英国中部地区的业余运动员为什么要纪念加里波第？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有趣的事實：當阿森納俱樂部在1886年成立時（作爲撥號廣場俱樂部），它的兩個創始成員是前森林隊球員，他們搬到了伍爾維奇工作。\n創始成員是搬到伍爾維奇工作的前森林隊球員。\n他們寫信回家請求幫助建立新俱樂部，諾丁漢森林俱樂部\n送給他們一套裝備和一個球。因爲這個原因，阿森納...",
      "title": "在1865年諾丁漢森林俱樂部的成立會議上，委員會決定球隊的顏色應該是 \"加里波第紅\"，以紀念朱塞佩-加里波第（直到今天，俱樂部的球員還穿着這個顏色）。一羣來自英國中部地區的業餘運動員爲什麼要紀念加里波第？"
    }
  ]
}