{
  "author": "KevTravels",
  "original_created_utc": 1652619567,
  "title": "It's 1868 and I'm a Northerner (from New England) who just came of age and decided to join the Army to make up for having missed service in the Civil War. My unit is being deployed to the South to serve in either Mississippi or Alabama. What would my daily duties and service look like?",
  "created_utc": 1652633710,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Would it just be mostly guard duty? How would my day-to-day look like?&lt;/p&gt;\n\n&lt;p&gt;How much interaction would I have with locals be they former Confederates or ex-slaves? &lt;/p&gt;\n\n&lt;p&gt;Would I possibly see some action against former Confederates who were part of the Ku Klux Klan?&lt;/p&gt;\n\n&lt;p&gt;Would it be equivalent to being stationed in a &amp;quot;foreign country&amp;quot;?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/uq5ldj/its_1868_and_im_a_northerner_from_new_england_who/",
  "subreddit": "AskHistorians",
  "id": "uq5ldj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Would it just be mostly guard duty? How would my day-to-day look like?\n\nHow much interaction would I have with locals be they former Confederates or\nex-slaves?\n\nWould I possibly see some action against former Confederates who were part of\nthe Ku Klux Klan?\n\nWould it be equivalent to being stationed…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ほとんどガードマン業務だけでしょうか？私の日常はどのようなものでしょうか。\n\n元連合国兵士や元奴隷など、現地の人たちとの交流はどの程度あるのでしょうか。\n交流はありますか？\n\nクー・クラックス・クランの一員である元連合国軍兵士に対して、何か行動を起こすことはあるのでしょうか。\n何か行動を起こすでしょうか?\n\n駐屯地と同じようなものでしょうか？",
      "title": "1868年、私は成人したばかりの北方人（ニューイングランド出身）で、南北戦争で兵役に就けなかったのを補うために陸軍に入隊することにしました。私の部隊は南部に配備され、ミシシッピ州かアラバマ州で兵役に就くことになっています。私の日々の任務と奉仕はどのようなものでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "会不会主要是警卫工作？我的日常工作是什么样子的？\n\n我将与当地人有多少互动，不管他们是前邦联人还是\n前奴隶？\n\n我是否有可能看到对属于三K党的前邦联人采取一些行动？\n三K党？\n\n这是否等同于被派驻到...",
      "title": "现在是1868年，我是一个北方人（来自新英格兰），刚刚成年，决定参军以弥补在内战中错过的服务。我的部队将被部署到南方，在密西西比州或阿拉巴马州服役。我的日常职责和服务会是什么样子？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "會不會主要是警衛工作？我的日常工作是什麼樣子的？\n\n我將與當地人有多少互動，不管他們是前邦聯人還是\n前奴隸？\n\n我是否有可能看到對屬於三K黨的前邦聯人採取一些行動？\n三K黨？\n\n這是否等同於被派駐到...",
      "title": "現在是1868年，我是一個北方人（來自新英格蘭），剛剛成年，決定參軍以彌補在內戰中錯過的服務。我的部隊將被部署到南方，在密西西比州或阿拉巴馬州服役。我的日常職責和服務會是什麼樣子？"
    }
  ]
}