{
  "author": "oldironsides23",
  "the_new_excerpt": "Title is self explanatory. All the attention goes to volatile stocks (GME, AMC,\nyou know the rest) and trying to time the market just right.\n\nBut the bogle strategy seems to be as close to a sure winner as you can get.\nUnless you have an extended period of bad stock market years, you should…",
  "original_created_utc": 1622896189,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルを見れば一目瞭然。注目されているのはボラティリティの高い銘柄（GME、AMC。\n揮発性の高い銘柄（GME、AMCなど）や、市場のタイミングを計ることに注目が集まります。\n\nしかし、ボーグル戦略は確実な勝利に限りなく近いと思われます。\n株式市場が悪い年が長く続かない限り、あなたは・・・。",
      "title": "なぜこの投資戦略がもっと主流にならないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "标题是不言自明的。所有的注意力都集中在不稳定的股票上（GME, AMC,\n你知道其余的），并试图把握好市场的时机。\n\n但博格尔策略似乎是你能得到的最接近稳赢的策略。\n除非你有很长一段时间的糟糕的股市年份，否则你应该...",
      "title": "为什么这种投资策略没有成为主流？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "標題是不言自明的。所有的注意力都集中在不穩定的股票上（GME, AMC,\n你知道其餘的），並試圖把握好市場的時機。\n\n但博格爾策略似乎是你能得到的最接近穩贏的策略。\n除非你有很長一段時間的糟糕的股市年份，否則你應該...",
      "title": "爲什麼這種投資策略沒有成爲主流？"
    }
  ],
  "title": "Why isn't this investment strategy more mainstream?",
  "created_utc": 1622902559,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Title is self explanatory. All the attention goes to volatile stocks (GME, AMC, you know the rest) and trying to time the market just right. </p>\n\n<p>But the bogle strategy seems to be as close to a sure winner as you can get. Unless you have an extended period of bad stock market years, you should always see growth of your investment. Or am I wrong? </p>\n\n<p>Basically just wondering why a lot of people aren&#39;t doing it this way opposed to throwing money into 1 stock and hoping for the best. I&#39;ve never even heard about this strategy until I stumbled upon it here.</p>\n</div><!-- SC_ON -->",
  "score": 172,
  "permalink": "/r/Bogleheads/comments/nsuq2i/why_isnt_this_investment_strategy_more_mainstream/",
  "subreddit": "Bogleheads",
  "id": "nsuq2i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404885442
}