{
  "author": "dalibor68",
  "original_created_utc": 1636794617,
  "title": "With inflation on the rise, how much of your portfolio should be crypto?",
  "created_utc": 1636817919,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello,</p>\n\n<p>So we all know the usual (rather conservative in my opinion) statements by prominent investors or news outlets claiming the ideal spot of crypto in one&#39;s portfolio would be 5-10%. I&#39;m pretty sure the people saying this are mostly rich as fuck though and not telling you that the other 90-95% of their portfolio is not just sitting as FIAT on the bank account, but also invested in housing, gold and stocks.</p>\n\n<p>In addition, we are witnessing an increase of worldwide FIAT inflation. In Europe, it is currently around +3-4% officially, and probably more like 5%+ in reality. So basically any FIAT you have on your bank account is devalued by 5%+ every year, in some countries you&#39;ll even have to pay negative interest on top of that.</p>\n\n<p>So taking this all into consideration, what do you think is currently the optimal percentage that crypto should take in the portfolio of a &quot;regular&quot; (as in &quot;not already rich af&quot;) investor?</p>\n\n<p>Personally, I&#39;ll be around 33% crypto at the end of the year. That&#39;s money that would hurt me in the sense of maybe not having a big vacation next year if it went -50%, but otherwise not too much of a big deal. But for me it is a risk willing to take and a good compromise to not just watch all Fiat be eaten up by inflation while also having enough investment to potentially have significant gains.</p>\n\n<p>What do you think?</p>\n</div><!-- SC_ON -->",
  "score": 161,
  "permalink": "/r/CryptoCurrency/comments/qsxhgh/with_inflation_on_the_rise_how_much_of_your/",
  "subreddit": "CryptoCurrency",
  "id": "qsxhgh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hello,\n\nSo we all know the usual (rather conservative in my opinion) statements by\nprominent investors or news outlets claiming the ideal spot of crypto in one's\nportfolio would be 5-10%. I'm pretty sure the people saying this are mostly rich\nas fuck though and not telling you that the other 90-95%…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは。\n\n著名な投資家や報道機関が、自分の資産の中に暗号の理想的な場所があると主張する、通常の（私に言わせればかなり保守的な）発言は誰もが知っています。\n著名な投資家や報道機関が、ポートフォリオに占める暗号の理想的な割合は5～10％であると主張するのはよくあることです。\nポートフォリオの中で暗号の理想的な割合は5～10％であると主張しています。これを言っている人たちは、ほとんどが金持ちだと思います。\nしかし、これを言っている人たちはほとんどが金持ちで、残りの90～95％は...",
      "title": "インフレが進む中、ポートフォリオの中でどのくらいの割合を暗号化すべきか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好。\n\n因此，我们都知道著名的投资者或新闻机构通常的声明（在我看来相当保守），声称加密货币在一个人的理想位置。\n知名投资者或新闻机构声称，一个人的投资组合中理想的加密货币点\n投资组合中的理想位置是5-10％。我敢肯定，说这些话的人大多数都很有钱\n但他们不会告诉你其他的90-95%...",
      "title": "随着通货膨胀的加剧，你的投资组合中应该有多少是加密货币？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好。\n\n因此，我們都知道著名的投資者或新聞機構通常的聲明（在我看來相當保守），聲稱加密貨幣在一個人的理想位置。\n知名投資者或新聞機構聲稱，一個人的投資組合中理想的加密貨幣點\n投資組合中的理想位置是5-10％。我敢肯定，說這些話的人大多數都很有錢\n但他們不會告訴你其他的90-95%...",
      "title": "隨着通貨膨脹的加劇，你的投資組合中應該有多少是加密貨幣？"
    }
  ]
}