{
  "author": "Comer_Agua",
  "original_created_utc": 1642638473,
  "title": "Why do people only acknowledge Nike using sweatshops when 90% of famous shoe brands do the exact same thing but people ignore it?",
  "created_utc": 1642653622,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not saying that using sweatshops is good it is terrible and shouldn&amp;#39;t be a thing and we should absolutely fight against and stop the use of them. But I have a problem when I see people hate on athletes signing with Nike/ Nike ads and lash out against Nike for using sweatshops (despite most of their clothing probably coming from sweatshops as well) but ignore most other brands that use sweatshops like Sketchers. I&amp;#39;m not saying we shouldn&amp;#39;t hate on Nike I&amp;#39;m just confused why people act in this way.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 112,
  "permalink": "/r/TooAfraidToAsk/comments/s856ip/why_do_people_only_acknowledge_nike_using/",
  "subreddit": "TooAfraidToAsk",
  "id": "s856ip",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm not saying that using sweatshops is good it is terrible and shouldn't be a\nthing and we should absolutely fight against and stop the use of them. But I\nhave a problem when I see people hate on athletes signing with Nike/ Nike ads\nand lash out against Nike for using sweatshops (despite most of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "スウェットショップを使うことが良いとは言いません。\n私たちは絶対に反対し、その使用を止めるべきです。しかし、私は\nナイキと契約しているアスリートやナイキの広告を嫌う人を見ると、問題があります。\nまた、ナイキが労働搾取工場を使っていることを非難しています（ほとんどの労働搾取工場が労働搾取工場であるにもかかわらず）。",
      "title": "有名な靴ブランドの90％が全く同じことをしているのに、なぜ人々はナイキだけが搾取工場を使っていることを認めるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不是说使用血汗工厂是好的，它是可怕的，不应该成为一件事。\n我们绝对应该反对和停止使用它们。但我\n当我看到人们讨厌与耐克/耐克广告签约的运动员时，我有一个问题。\n并对耐克公司使用血汗工厂进行抨击（尽管大多数人...",
      "title": "为什么人们只承认耐克使用血汗工厂，而90%的著名鞋类品牌都在做完全相同的事情，但人们却忽视了这一点？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不是說使用血汗工廠是好的，它是可怕的，不應該成爲一件事。\n我們絕對應該反對和停止使用它們。但我\n當我看到人們討厭與耐克/耐克廣告簽約的運動員時，我有一個問題。\n並對耐克公司使用血汗工廠進行抨擊（儘管大多數人...",
      "title": "爲什麼人們只承認耐克使用血汗工廠，而90%的著名鞋類品牌都在做完全相同的事情，但人們卻忽視了這一點？"
    }
  ]
}