{
  "author": "wheelzoffortune",
  "original_created_utc": 1636408349,
  "title": "I'm getting tired of trying to convert people",
  "created_utc": 1636486656,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I first got into crypto back around mid 2017. Within a few weeks I became convinced that the technology would transform the world. In seeing that, I realized that if I didn&#39;t want friends and family to miss out on this once in a lifetime opportunity, I needed to do as much as I could to convince them to get in. </p>\n\n<p>At that time the big orange coin was about $2k.</p>\n\n<p>I began my crusade to help my loved ones make money.</p>\n\n<p>It didn&#39;t take long before I understood the phrase &quot;you can lead a horse to water, but you cannot make him drink&quot;.</p>\n\n<p>It went to $3k and no one was interested. Then $4k. Same deal. Then $5k, 6, 7, and 8k.</p>\n\n<p>Now the instead of not being interested, I was getting more &quot;it is too expensive&quot;.</p>\n\n<p>Those chants got louder.</p>\n\n<p>Of course, it went all the way up to almost $20k so if it was too expensive at $8k, it was far too expensive at $20k.</p>\n\n<p>Then it crashed.</p>\n\n<p>Surely if people were interested at $20k, but thought it was too costly then at $4k I could convince them that now was the time to get in because at $4,000 it was &quot;cheap&quot;.</p>\n\n<p>Except that when it went back down to that, the friends and family who were interested at 20k but thought it was too expensive were now not interested at all.</p>\n\n<p>I&#39;ve spent the last 5 years trying to spread the word about crypto and make people aware of this amazing and transformative tech, but I&#39;ve barely made a dent in converting anyone.</p>\n\n<p>I&#39;m just tired. It seems like a waste of time trying to convert those who are competely content with the current financial system.</p>\n\n<p>Thanks for reading.</p>\n</div><!-- SC_ON -->",
  "score": 166,
  "permalink": "/r/CryptoCurrency/comments/qpo7m1/im_getting_tired_of_trying_to_convert_people/",
  "subreddit": "CryptoCurrency",
  "id": "qpo7m1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I first got into crypto back around mid 2017. Within a few weeks I became\nconvinced that the technology would transform the world. In seeing that, I\nrealized that if I didn't want friends and family to miss out on this once in a\nlifetime opportunity, I needed to do as much as I could to convince…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が初めて暗号に手を出したのは、2017年の半ば頃でした。数週間のうちに私は\nこの技術が世界を変えると確信しました。それを見て、私は\n友人や家族にこの一生に一度の機会を逃してほしくないのであれば、自分もこの機会を逃さないようにしなければならないと思いました。\nこの一生に一度の機会を友人や家族に逃さないためには、できるだけ多くのことをして説得する必要があると思いました...",
      "title": "人を変えようとすることに疲れてしまった"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我第一次接触加密货币是在2017年中期左右。在几个星期内，我就\n确信这项技术将改变世界。在看到这一点时，我\n我意识到，如果我不想让朋友和家人错过这个一生中只有一次的机会，我需要尽可能地说服他们。\n机会，我需要尽可能多地说服...",
      "title": "我已经厌倦了试图改变人们的想法"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我第一次接觸加密貨幣是在2017年中期左右。在幾個星期內，我就\n確信這項技術將改變世界。在看到這一點時，我\n我意識到，如果我不想讓朋友和家人錯過這個一生中只有一次的機會，我需要儘可能地說服他們。\n機會，我需要儘可能多地說服...",
      "title": "我已經厭倦了試圖改變人們的想法"
    }
  ]
}