{
  "author": "velvetblunder",
  "original_created_utc": 1637494305,
  "title": "Which Crypto Games are actually good and worth playing",
  "created_utc": 1637516481,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello Guys!!  </p>\n\n<p>Recently prices of gaming crypto rising like MANA, SAND, GALA, BORA, etc   </p>\n\n<p>I love playing games but when I take a look at all this games they are shit. If it did not involve crypto I dont even think someone would play that.   </p>\n\n<p>Crypto Royale is the one game I found is decent to play. Its a browser based game but I have played Miniclip games which are lot better than this crypto games.</p>\n\n<p>I am not sure if there are any games like valo, CS, dota, minecraft, GTA, Fifa yet but I hope if there are gaming crypto main focus should be on gameplay rather than crypto.   </p>\n\n<p>If you guys know about such gaming project which are good and has good future ahead please share it with others.  </p>\n\n<p>Thanks</p>\n</div><!-- SC_ON -->",
  "score": 185,
  "permalink": "/r/CryptoCurrency/comments/qyt5l4/which_crypto_games_are_actually_good_and_worth/",
  "subreddit": "CryptoCurrency",
  "id": "qyt5l4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hello Guys!!\n\nRecently prices of gaming crypto rising like MANA, SAND, GALA, BORA, etc\n\nI love playing games but when I take a look at all this games they are shit. If\nit did not involve crypto I dont even think someone would play that.\n\nCrypto Royale is the one game I found is decent to play. Its a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Hello Guys!\n\n最近、MANA、SAND、GALA、BORAなどのゲームクリプトの価格が上昇しています。\n\n私はゲームをするのが大好きですが、これらのゲームを見てみるとクソゲーばかりです。もし\n暗号が絡んでいなければ、誰かがそれをプレイするとさえ思えない。\n\nCrypto Royaleは、私がプレイしてまともだと思ったゲームの一つです。それは...",
      "title": "どの暗号ゲームが実際に優れていて、プレイする価値があるか"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好！!\n\n最近游戏加密货币的价格不断上涨，如MANA、SAND、GALA、BORA等。\n\n我喜欢玩游戏，但当我看到这些游戏时，它们都是狗屎。如果\n如果不涉及加密货币，我甚至不认为有人会玩这个游戏。\n\nCrypto Royale是我发现的一个游戏，玩起来还算不错。它是一个...",
      "title": "哪些加密货币游戏实际上是好的和值得玩的"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好！!\n\n最近遊戲加密貨幣的價格不斷上漲，如MANA、SAND、GALA、BORA等。\n\n我喜歡玩遊戲，但當我看到這些遊戲時，它們都是狗屎。如果\n如果不涉及加密貨幣，我甚至不認爲有人會玩這個遊戲。\n\nCrypto Royale是我發現的一個遊戲，玩起來還算不錯。它是一個...",
      "title": "哪些加密貨幣遊戲實際上是好的和值得玩的"
    }
  ]
}