{
  "author": "ultron290196",
  "original_created_utc": 1627274950,
  "title": "BTC dumps to 30k in one day: Manipulation! BTC pumps to 40k in one hour: Natural Progression!",
  "created_utc": 1627285034,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Let&#39;s admit it. We don&#39;t have a clue how, when and why the price of BTC reacts the way it does. We scream manipulation only when the outcome doesn&#39;t favor us. Uptrend manipulation is still manipulation!</p>\n\n<p>There are big and unknown figures at play here. We&#39;re just pawns in the grand scheme of things. There&#39;s no denying that. The only thing we, small retail investors, can hope for is to ride the waves and hope we can reach the destination.</p>\n\n<p>The technology is solid. I cannot imagine the future without BTC being implemented in our lives one way or another. That fundamental is the reason why I can remain sane during these insane market movements. </p>\n\n<p>Just don&#39;t make decisions based on your emotions. That&#39;s what &quot;they&quot; are hoping to cash in on.</p>\n</div><!-- SC_ON -->",
  "score": 221,
  "permalink": "/r/CryptoCurrency/comments/orrp9c/btc_dumps_to_30k_in_one_day_manipulation_btc/",
  "subreddit": "CryptoCurrency",
  "id": "orrp9c",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Let's admit it. We don't have a clue how, when and why the price of BTC reacts\nthe way it does. We scream manipulation only when the outcome doesn't favor us.\nUptrend manipulation is still manipulation!\n\nThere are big and unknown figures at play here. We're just pawns in the grand\nscheme of things.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "認めましょう。BTCの価格がどのように、いつ、どのように反応するのか、私たちには手掛かりがありません。\nどうやって、いつ、なぜ、BTCの価格がこのように反応するのか分からない。自分に都合の悪い結果になったときだけ、操作だと叫ぶ。\n上昇トレンドでの操作は、やはり操作なのだ。\n\nここには大きな、そして未知の数字が関わっている。私たちは壮大な計画の駒に過ぎません。\n壮大な計画の駒に過ぎない....",
      "title": "BTCが1日で30kまで暴落。マニピュレーション！？BTCが1時間で40kまで上昇。自然な流れだ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "让我们承认这一点。我们不知道BTC的价格是如何、何时以及为何反应的\n的方式。只有当结果对我们不利时，我们才会大喊操纵。\n上升趋势的操纵仍然是操纵!\n\n这里有巨大而未知的数字在起作用。我们只是大计划中的小卒子。\n计划中的棋子....",
      "title": "BTC在一天内跳水至30K。操纵! BTC在一小时内抽到40K。自然进步!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "讓我們承認這一點。我們不知道BTC的價格是如何、何時以及爲何反應的\n的方式。只有當結果對我們不利時，我們纔會大喊操縱。\n上升趨勢的操縱仍然是操縱!\n\n這裏有巨大而未知的數字在起作用。我們只是大計劃中的小卒子。\n計劃中的棋子....",
      "title": "BTC在一天內跳水至30K。操縱! BTC在一小時內抽到40K。自然進步!"
    }
  ]
}