{
  "author": "sporadicjesus",
  "the_new_excerpt": "Ok, there is some competetion but, future competetion is non existant. The\nregulatory hurtles, the land that would need to be baught, the man power it\nwould take to build a new railroad network is just out of the question.\n\nSo what are we left with? Well with whats already there. They are…",
  "original_created_utc": 1620438341,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "確かに競争はありますが、将来の競争はありません。それは\n規制の問題、土地の確保、新しい鉄道網の構築に必要なマンパワーなどは\n新しい鉄道網を構築するために必要なマンパワーは問題外です。\n\nでは、私たちには何が残されているのでしょうか？それは、すでにあるものです。それは...",
      "title": "将来の競争力がなく、バブルでもない人を当てよう。鉄道会社です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，有一些竞争，但是，未来的竞争是不存在的。监管障碍\n监管方面的障碍，需要购买的土地，建立一个新的铁路网络所需要的人力\n建立一个新的铁路网络所需的人力是不可能的。\n\n那么，我们还剩下什么？那就用已经存在的东西。他们是...",
      "title": "猜猜看，谁没有未来的竞争，也不在泡沫中。铁路部门。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，有一些競爭，但是，未來的競爭是不存在的。監管障礙\n監管方面的障礙，需要購買的土地，建立一個新的鐵路網絡所需要的人力\n建立一個新的鐵路網絡所需的人力是不可能的。\n\n那麼，我們還剩下什麼？那就用已經存在的東西。他們是...",
      "title": "猜猜看，誰沒有未來的競爭，也不在泡沫中。鐵路部門。"
    }
  ],
  "title": "Guess who has no future competetion and is not in a bubble. Railroads.",
  "created_utc": 1620448365,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Ok, there is some competetion but, future competetion is non existant. The regulatory hurtles, the land that would need to be baught, the man power it would take to build a new railroad network is just out of the question.</p>\n\n<p>So what are we left with? Well with whats already there. They are all prospering.</p>\n\n<p>Me, I chose CNI.</p>\n\n<p>Canadian National Railway. (CNI or CNR)</p>\n\n<p>Just had a huge dip after the KCS offer. Perfect time to get in while the market is down.</p>\n\n<p>If they dont get the railway, their SP should shoot back up. If they do get it, theyll have the first transcontinental railway going from across Canada down to Mexico.</p>\n\n<p>Win win in my opinion.</p>\n</div><!-- SC_ON -->",
  "score": 1485,
  "permalink": "/r/investing/comments/n7ei1n/guess_who_has_no_future_competetion_and_is_not_in/",
  "subreddit": "investing",
  "id": "n7ei1n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985994596
}