{
  "author": "DOG_BUTTHOLE",
  "original_created_utc": 1624877913,
  "title": "Am I the only one who never remembers artist names, album names, etc?",
  "created_utc": 1624894103,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Unless I actively listen to that specific artist very frequently I almost never remember artist names and album names, even if I&#39;ve heard them before. And I listen ot Music 4-12 hours a day (only if I&#39;m gaming or activity).</p>\n\n<p>Everybody&#39;s always like &quot;Oh you heard Lil Shitball9000&#39;s new song?&quot; I&#39;ll be like &quot;No&quot; and then hear it and realize I played that shit on repeat a lot.</p>\n\n<p>Is this just an ADHD thing orrr.... lol</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/o9hx4z/am_i_the_only_one_who_never_remembers_artist/",
  "subreddit": "TooAfraidToAsk",
  "id": "o9hx4z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Unless I actively listen to that specific artist very frequently I almost never\nremember artist names and album names, even if I've heard them before. And I\nlisten ot Music 4-12 hours a day (only if I'm gaming or activity).\n\nEverybody's always like \"Oh you heard Lil Shitball9000's new song?\" I'll be…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "特定のアーティストを頻繁に聴くのでなければ、たとえ以前に聴いたことがあっても、アーティスト名やアルバム名を覚えることはほとんどありません。\nアーティスト名やアルバム名は、たとえ以前に聞いたことがあっても、ほとんど覚えていません。そして、私は\n1日に4～12時間音楽を聴いています（ゲームやアクティビティをするときだけ）。\n\nみんながいつも「Lil Shitball9000の新曲聞いた？私は...",
      "title": "アーティスト名やアルバム名などを覚えられないのは私だけでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "除非我经常听那个特定的艺术家，否则我几乎从来没有\n记艺术家的名字和专辑的名字，即使我以前听过它们。而且我\n每天听4-12个小时的音乐（只有当我在游戏或活动时）。\n\n大家总是说 \"哦，你听说过Lil Shitball9000的新歌吗？\" 我就会...",
      "title": "我是唯一一个从来不记得艺术家名字、专辑名称等的人吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "除非我經常聽那個特定的藝術家，否則我幾乎從來沒有\n記藝術家的名字和專輯的名字，即使我以前聽過它們。而且我\n每天聽4-12個小時的音樂（只有當我在遊戲或活動時）。\n\n大家總是說 \"哦，你聽說過Lil Shitball9000的新歌嗎？\" 我就會...",
      "title": "我是唯一一個從來不記得藝術家名字、專輯名稱等的人嗎？"
    }
  ]
}