{
  "author": "Accomplished-Design7",
  "original_created_utc": 1626063091,
  "title": "Your crypto holding is your secret to keep!",
  "created_utc": 1626075464,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have tried telling family and friends about my cryptos and boy, I have never regretted anything more than that. The constant badgering about how it&#39;s all going to go to zero and I am involved in a Ponzi scheme. When I am making gains they say nothing and don&#39;t want to part of any conversation but once my portfolio is bleeding they suddenly have an interest. They proceed to tell me how I am behaving like a fool and what not.  </p>\n\n<p>Lesson learnt, never again. My cryptos holdings are my secret to keep whether it is gains or loss.</p>\n</div><!-- SC_ON -->",
  "score": 183,
  "permalink": "/r/CryptoCurrency/comments/oijqu6/your_crypto_holding_is_your_secret_to_keep/",
  "subreddit": "CryptoCurrency",
  "id": "oijqu6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I have tried telling family and friends about my cryptos and boy, I have never\nregretted anything more than that. The constant badgering about how it's all\ngoing to go to zero and I am involved in a Ponzi scheme. When I am making gains\nthey say nothing and don't want to part of any conversation but…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は家族や友人に自分のクリプトのことを話してみましたが、これほど後悔したことはありません。\nほど後悔したことはありません。すべてがゼロになり、私はネズミ講に巻き込まれていると\n私はねずみ講に巻き込まれているのです。私が利益を上げていても\n彼らは何も言わず、会話に参加しようともしません。",
      "title": "あなたの保有する暗号は、あなたの秘密にしておきましょう"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我试着把我的加密货币告诉家人和朋友，孩子，我从来没有后悔过。\n遗憾的是，我从未后悔过。我不断地催促他们说，这一切都将归于零，而我将被卷入其中。\n将会归零，我参与了一个庞氏骗局。当我有收益的时候\n他们什么也不说，也不想参与任何谈话，但是......",
      "title": "你的加密货币持有量是你的秘密，要好好保管!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我試着把我的加密貨幣告訴家人和朋友，孩子，我從來沒有後悔過。\n遺憾的是，我從未後悔過。我不斷地催促他們說，這一切都將歸於零，而我將被捲入其中。\n將會歸零，我參與了一個龐氏騙局。當我有收益的時候\n他們什麼也不說，也不想參與任何談話，但是......",
      "title": "你的加密貨幣持有量是你的祕密，要好好保管!"
    }
  ]
}