{
  "author": "greensymbiote",
  "the_new_excerpt": "TLDR : See summary at bottom\n\nWith PSFE’s daily short volume often in the 40-65% range, many believe the share\nprice is being tactically pinned down as 13F filings have steadily revealed more\ninstitutions taking large positions. Joining noted fund managers David Tepper,\nAaron Cohen, Dan Loeb and…",
  "original_created_utc": 1623941531,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "TLDR : 下部の要約を参照\n\nPSFEの1日の空売り数量は40～65％の範囲内であることが多く、13Fファイルの提出により、株価は戦術的に抑えられていると多くの人が考えています。\nPSFEの1日の空売り数量は40～65％の範囲になることが多く、多くの人は株価が戦術的に抑えられていると考えています。\n多くの機関投資家が大規模なポジションを取っていることが明らかになったため、株価は戦略的に下げられていると考えられます。著名なファンドマネージャーであるDavid Tepper氏に加え、Aaron Cohen氏、Dan Loeb氏などが参加しています。\nアーロン・コーエン、ダン・ローブ、そして...",
      "title": "Paysafe (PSFE) はアナリストの予想を上回る準備ができている。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "TLDR : 见底部的摘要\n\n由于PSFE的每日空头量经常在40-65%的范围内，许多人认为股价正在被战术性地压低，因为13F文件不断地显示出更多的信息。\n由于13F文件不断显示出更多的机构正在大举买入，股价被战术性地压低了。\n机构持有大量头寸。与著名的基金经理大卫-泰普（David Tepper）一起。\n亚伦-科恩、丹-勒布和...",
      "title": "Paysafe(PSFE)有望超出分析师预期"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "TLDR : 見底部的摘要\n\n由於PSFE的每日空頭量經常在40-65%的範圍內，許多人認爲股價正在被戰術性地壓低，因爲13F文件不斷地顯示出更多的信息。\n由於13F文件不斷顯示出更多的機構正在大舉買入，股價被戰術性地壓低了。\n機構持有大量頭寸。與著名的基金經理大衛-泰普（David Tepper）一起。\n亞倫-科恩、丹-勒布和...",
      "title": "Paysafe(PSFE)有望超出分析師預期"
    }
  ],
  "title": "Paysafe (PSFE) poised to beat analysts estimates",
  "created_utc": 1623959465,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>TLDR : See summary at bottom</p>\n\n<p>With PSFE’s daily short volume often in the 40-65% range, many believe the share price is being tactically pinned down as 13F filings have steadily revealed more institutions taking large positions. Joining noted fund managers David Tepper, Aaron Cohen, Dan Loeb and Leon Cooperman, Wells Fargo’s various funds have picked up 12 million shares and Blackstone has increased their holdings by an additional 37 million shares.</p>\n\n<p>Some have calculated that share lockup rules have reduced the true available float to as little as 80-85 million shares, causing the most recently reported short interest of 36 millions shares to have an outsized effect.  But shorts must be covered eventually.  A common theory, given the regular 700K-2M block trades we’ve seen, is that aggressive shorting enables large funds to accumulate before Q2 ER (which should beat estimates) and before PSFE is added to the Russell 3000 Index next month. Goldman Sachs also anticipates Paysafe’s Russell 1000 inclusion which, in light of their projected $100+ billion in market share, would likely be followed by other benchmark funds and ETFs, carving out yet even more of the available float.</p>\n\n<p>Along with now priced-in fears of PE lockup expiration (more on that below), it’s clear that PSFE’s share price has also suffered from the Q1 report of YoY 5% quarterly revenue growth which, no doubt, disappointed the short-term expectations of many impatient traders invited in by constant Cramer and Steve Grasso pumps.  It&#39;s understandable that, over the last few months, PSFE has reportedly experienced a large demographic shift away from younger shareholders, indicating a transition to a steadier long-term investor base.</p>\n\n<p>But that 5% number may have been misleading to some who didn’t bother to look under the hood.  Paysafe not only upgraded the low end of their 2021 revenue guidance to $1.53 billion, they beat analysts’ average estimate and they also noted that revenue growth would have been “mid to high teens” were it not for their strategic “market/channel exit to improve overall risk/reward profile.”  This was not a surprise as they explained: “adjusting for the actions we have discussed in our Analyst Day and continued risk reward optimization in our business model, our revenue growth would have been in the mid to high teens.” Based on valuation comps, such a growth rate would easily support a share price double the current level.</p>\n\n<p>Paysafe’s quarterly revenue, gross profit and EBITDA numbers all came in at the upper range of their guidance along with a 63% gain in eCash revenue and 29% gain in free cash flow to over $108 million for Q1 alone.  On the day of their earnings report, initial headlines were favorable: “Paysafe beats on revenue, Reaffirms 2021 outlook” only to be suddenly overtaken by articles almost uniformly focused on the negative, offering oddly biased summaries like: “Sees Q2 adjusted EBITDA of $110M-$120M, which means it could fall below the Q1 level of $113.2M.”  (Obviously, given that range, it could just as well, if not more likely, rise above that number.)</p>\n\n<p>Several outlets focused on an EPS miss of $0.02 despite the fact that Paysafe did not offer any EPS estimate to miss.  Even now, many platforms continue to wildly misreport their financial data.  For example, Yahoo Finance falsely reports a much more dramatic $0.37 miss, something that would naturally deter potential investors at first glance.</p>\n\n<p>Intentional or not, analysts’ EPS estimates overlooked previously signaled temporary quarterly expenses associated with paying down $1.16 billion in debt and the transaction that took Paysafe public.  The company noted: “Results included interest expense of $58.5 million, an increase of 53% compared to the prior year, reflecting the expense of capitalized debt fees as a result of debt repayment on March 31, 2021. Net loss also included share-based compensation of $72.4 million, compared to none in the prior year due to shares vested on completion of the Transaction.&quot;</p>\n\n<p>Take away these one-time non-recurring expenses which amount to roughly $90 million and, rather than reporting a $49 million loss, the company would have reported $41 million in quarterly earnings thereby significantly beating all analyst estimates.</p>\n\n<p>Thanks to an improved credit rating, the company announced a refinancing of roughly a billion in debt at a 1.25%+ lower interest rate.  In all, their recent debt management measures will save them an estimated $92 million in annual operating costs.  Global Capital reports that their loan offers an additional 25bp margin step-down if the firm hits 3.7 times net leverage, something they told analysts they intend to activate quickly.</p>\n\n<p>Taken together, all of this will greatly enhance EBITDA and free cash flow (already $362 million in 2020) enabling them to better pursue their “active M&amp;A pipeline.”</p>\n\n<p>Unless the company chooses, for strategic tax purposes, to write off some discretionary impairment expense on intangibles, they should soundly beat the current analysts’ average EPS estimate of $0.00 for Q2 and $0.02 for 2021.  Those analysts have a median price target $17.67, so consistently beating their estimates over the next three quarters will likely lead to price target upgrades (and new price catalysts along the way).</p>\n\n<p>&#x200B;</p>\n\n<p>Note on Private Equity lockup expiration:</p>\n\n<p>Blackstone bought an additional 37 million shares of Paysafe beyond their original 123 million shares.  Redditor kiedennis noted that these additional shares would theoretically secure a 50.159% controlling interest for insiders, which some think could be part of ensuring Paysafe’s M&amp;A strategy going forward.  At the very least, it protects the company from hostile takeover.  Notably, such a large purchase on top of the initial merger deal should allay fears that they’d want to sell when lockup expires in the coming weeks.  At this point it’s evident that such fears are priced in but some are still concerned so here are some further notes on the subject:</p>\n\n<p>Back in 2017, Reuters reported Blackstone/CVC initially pursued Paysafe making five separate bids to take it private, increasing their bid 32% before Paysafe finally agreed. The Wall Street Journal later confirmed, Blackstone/CVC took Paysafe private for $3.9 Billion. (Around $4.2 Billion in today’s dollars)</p>\n\n<p>An inside source close to those negotiations said, “There is a fundamental change in the way we pay for goods and services, away from the cash and cheques of our parents’ age,” adding that the private equity firms “have a decade-long thesis that this shift will only grow and grow and they want to get in now.”</p>\n\n<p>Blackstone’s website says its typical investment term is “upwards of 7-10 years” which dovetails with the “decade-long thesis” noted above.</p>\n\n<p>From 2017 to 2019, under Blackstone/CVC stewardship, Paysafe grew revenue 65% from $864 million to $1.418 billion. (28% CAGR) 2020 saw revenue stagnate due to Covid-related business closures and high-risk channel exits but, even so, if you add 2020’s performance, 2017-2020 still amounts to a respectable 18% CAGR, roughly the same as PayPal’s current projected growth.</p>\n\n<p>Recently Paysafe has gone public through reverse merger, paid down $1.2 billion in debt and Blackstone/CVC received about $5.6 billion in cash and shares.  Adjusted for inflation, that’s only a 33% gain on a 4 year hold which tells me they’d want to stay on and benefit from Foley’s M&amp;A playbook which has steadily proven to generate 300-800% growth in as little as 5 years (This falls nicely within Blackstone’s remaining time horizon). As part of the deal, Paysafe’s 20F filing confirms that Blackstone rolled $1.23 billion into Paysafe, keeping 123 million shares. Foley says, this is part of what “created the confidence among the investor base to invest in the PIPE and then support the stock.”</p>\n\n<p>More recently, Blackstone’s 13F shows they now own 160 million shares indicating that they acquired an additional 37 million shares outside of the deal structure. That’s $436 million more at the current share price. As insiders on the Board of Directors, they wouldn’t take on that level of additional exposure if they didn’t see serious value here. Dan Loeb (Third Point)’s 13F indicates they also picked up more shares beyond their original PIPE investment. For the above reasons, along with the depressed share price, I highly doubt private equity would be seeking a near-term exit.</p>\n\n<p>&#x200B;</p>\n\n<p>TLDR summary:</p>\n\n<p>Paysafe has put itself in a great position to beat analyst EPS estimates for Q2, Q3, Q4 and 2021 overall, leading to raised price targets and  positive price action catalysts.</p>\n\n<p>Q1&#39;s one-time $90 million in expenses showed Paysafe is already poised for significant profit growth.  Recent  debt management, saving around $92 million annually, secures even higher  profits going forward.</p>\n\n<p>The picture gets  brighter with the introduction of fast growing revenue streams from the  US iGaming market, especially in Q3 and 4.</p>\n\n<p>Fears of private  equity lockup expiry fully priced in at this point, but such fears are  unwarranted at these low levels, especially considering Blackstone’s  acquisition of another 37 million shares.</p>\n\n<p>But  here&#39;s a question: Has anyone thought about cash conversion of PSFE&#39;s  outstanding warrants bringing the company as much as $600 million? The  last SEC filing says there are as many as 53.9 million warrants that  could bring the company $11.50 each upon redemption.  This would more  than double their EBITDA and go a long way towards deleveraging and/or  funding their &quot;active M&amp;A pipeline.&quot;</p>\n\n<p>Such a huge cash infusion gives them meaningful incentive to eventually  promote the stock price to well above $18, a 60%+ gain from current  levels.</p>\n\n<p>There’s a strategy here and Foley has repeatedly shown he knows exactly how to play his  cards. Like most good things, it takes time.</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/stocks/comments/o1z4dm/paysafe_psfe_poised_to_beat_analysts_estimates/",
  "subreddit": "stocks",
  "id": "o1z4dm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009745348
}