{
  "author": "EnclavedMicrostate",
  "original_created_utc": 1629729394,
  "title": "Monday Methods: The 'New Qing' Turn and Decentering Chinese History | Also, Reddit Talk Announcement",
  "created_utc": 1629757495,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><em>A note before we start: This Monday Methods post has been written to go in conjunction with a Reddit Talk event which will take place on 26 August at 5-6 p.m., PST. Full details including timezone conversion will be listed at the end of this post.</em></p>\n\n<h3>Introduction</h3>\n\n<p>Many students and enthusiasts of modern Chinese history or comparative Eurasian studies will likely have come across the term ‘New Qing History’ (or one of many variations containing the phrase ‘New Qing’), but I imagine that much of the readership here will not. And so here I am today to give a brief primer on this historiographical topic, its origins, its direct impact on the study of the Qing, and its wider implications for our understanding of Chinese history as a whole.</p>\n\n<p>What is ‘New Qing History’? The short answer (which I will expand on later) is that it is an approach to the history of the Great Qing (1636-1912) that takes a more sceptical view of the notion that the Qing ought to be seen as simply the last iteration in a succession of essentially ‘Chinese’ states, with its Manchu founding aristocracy undergoing a process of ‘Sinicisation’ which made them fundamentally indistinct from their Chinese subjects. ‘New Qing’ historians may highlight the continuing importance of the Manchus in the Qing state and changes in the basis of Manchu identity; Inner Asian (as opposed to Chinese) intellectual influences and political imperatives; contacts and parallels between the Qing and other Eurasian empires such as France, Russia, or the Ottomans; and so on and so forth. Drawing attention to these non-Chinese dimensions of the Qing state helps to de-emphasise ‘China’ as a central, overpowering entity in the history of East Asia writ large, as well as complicating the picture of ‘China’ as a continuous entity in political and cultural terms.</p>\n\n<p>This, quite naturally, has helped make ‘New Qing History’ rather a hot-button topic, as the People’s Republic of China is not exactly happy to see the neat, nationalist narratives of history that it likes to present get torpedoed by new trends in Western scholarship. There will be more detail on this later, but suffice it to say that there has been controversy, but of a sort which is in very large part political in origin, and principally concerning how the modern historiography challenges the neat narrative of national history.</p>\n\n<p>But we do need to problematise the phrase itself a bit. Firstly, it is not a ‘school’. Although many of the historians associated with ‘New Qing’ scholarship were influenced by Joseph Fletcher or are in turn students of those historians, the ‘New Qing’ turn as a phenomenon has been nowhere near as organised or centralised as the ‘Harvard School’ fostered by John King Fairbank (more on this later), and there has been significant disagreement between different strands of ‘New Qing’ historiography on quite fundamental matters of Qing political and intellectual history. In addition, while a number of scholars, such as Joanna Waley-Cohen and Mark C. Elliott, do self-identify under the ‘New Qing’ banner, a number do not, notably Pamela Crossley, who has among other things asked what exactly is so ‘new’ about the ‘New Qing’ turn given its roots in scholarship stretching back to the 1980s. And so it is to these 1980s developments that we now turn.</p>\n\n<h3>Background: The Harvard School and ‘China-centric’ Historiography</h3>\n\n<p>We can trace the beginning of modern historiography on China to just after the Second World War, when a number of American intellectuals who had been taken on to serve as diplomatic staff and attachés in China returned to the US and began taking on students in the emerging field of ‘area studies’. For China in particular, the most prominent and prolific was John King Fairbank at Harvard, who had actually been teaching before the war as well. Fairbank’s influence on Western historiography on China has been vast and cannot be covered at anywhere near enough length here, as he was not only an incredibly prolific writer (with over a dozen published monographs and countless chapters, articles, and edited volumes to his name) but also an extremely prolific educator, whose students went on to produce a huge body of scholarship of their own.</p>\n\n<p>Fairbank’s work adhered to what he called the ‘impact-response’ model of Chinese history: an ‘impact’ in the form of a Western action in China would be met with a Chinese ‘response’, and this back-and-forth was the principal dynamic in Chinese history. However, as later noted by Paul A. Cohen in <em>Discovering History in China</em> (1984), this meant that Chinese history would, by definition, begin with the first point of Western-derived rupture, such as the Opium War in 1839-42, and so all of Chinese history before that point could be understood as fundamentally continuous – a classic hallmark of Orientalist discourse. This of course has obvious implications for how the Qing continued to be viewed in essentially iterative terms, as the transition from Ming to Qing rule, with its tens of millions of lives lost and its deeply traumatic effect on those who lived through it, would not, in this view, be a fundamental rupture to China.</p>\n\n<p>Some of Fairbank’s students such as Mary Wright and Albert Feuerwerker approached Chinese history through the lens of ‘modernisation theory’, a sociological approach that attempts to explain how a combination of internal and external factors leads societies from ‘tradition’ to ‘modernity’. Such scholarship equally relies on the notion of an essential ‘tradition’ that becomes upset by some external influence. In this view, historical change beyond the cosmetic simply does not take place before the point of rupture, and just like the impact-response model, modernisation theory would have us presume that the Qing were not significantly different from any other prior state in China, and that their period of rule was, before the 1840s at least, simply a continuation of what had been there for centuries if not millennia.</p>\n\n<p>Fairbank would fall in some hot water in the 1960s, when his support for American involvement in Vietnam caused him to be at odds with a number of left-wing scholars. While perhaps the most infamous incident was when he got into a physical altercation with Howard Zinn over control of a microphone at the 1969 meeting of the American Historical Association, he and his work also came under fire from within the China studies world, most prominently from James Peck. Cohen groups these critiques under what he terms the ‘imperialism critique’, which argued that Western intervention was in fact so overpowering that the ‘impact-response’ model afforded <em>too much</em> agency to China in its struggle with Western imperialism. By suggesting a relatively value-neutral process of impact and response, critics argued that was excusing imperialism by suggesting that adaptation to imperial conditions was a viable option, as opposed to the concerted overthrow of the imperial system. A further deconstruction will not be pertinent here, but what is important is how it shows that there remained the underlying assumption that Western imperialism represented a critical point of rupture of a sort incomparable with any local antecedent.</p>\n\n<p>It was in response and contrast to these existing approaches that Cohen proposed a new approach, which he called ‘China-centric’ history, finding sources of historical change in China within China itself and evaluating it on the basis of Chinese rather than European standards. Cohen was of course far from the first to be doing this, and indeed he cites a number of prior examples of such scholarship like Philip Kuhn’s 1970 work, <em>Rebellion and its Enemies in Late Imperial China</em>. What Cohen did was give a name to this approach and elevate it to becoming the new basic intellectual position for Western history-writing on China, and set the stage for developments to come.</p>\n\n<p>Interestingly, however, Cohen <em>did</em> buy into the idea of ‘Sinicisation’ of the Manchus, and his regarding of the Qing as easily synonymous with ‘China’ is quite telling. Why, then, does Crossley argue that ‘New Qing’ history is actually just a specific outgrowth of what Cohen was proposing? Simply put, even if Cohen in 1984 continued to hold onto these now-outdated assumptions about the Qing, this was not on the basis of assumptions about fundamental Chinese continuity. Cohen had argued forcefully that if they went looking, historians <em>would</em> find historical change before the Western intrusion in China, and so they did.</p>\n\n<h3>The Emergence of the ‘New Qing’ Turn</h3>\n\n<p>In parallel with Cohen’s turn towards China-centrism, there was also a growing body of scholars interested in Inner and Central Asia, and who advocated that others do the same. While Joseph Fletcher, a Harvard college of Fairbank’s, was not alone among these, his influence on Qing history has perhaps been the most substantial. Fletcher had been pushing for recognition of Inner and Central Asia’s place in Chinese history since the 1960s, when he wrote a chapter for Fairbank’s <em>The Chinese World Order</em> covering Sino-Central Asian relations from the early Ming to the late Qing. Perhaps his most enduring contribution has been his chapter on Qing Inner Asia in the early 19th century in <em>The Cambridge History of China</em> Volume 10 (1978), which among other things suggested that the Qing confrontation with Britain in 1839-42 actually had a bit of an uncanny parallel with Qing relations with the Khanate of Kokand (in what is now Uzbekistan) earlier in the 1830s. Fletcher also advocated for reading texts in non-Chinese languages, and historians who took on this advice like would find this paying great dividends when they dug into new archival sources that illuminated swathes of previously unknown Qing history, beginning with Beatrice Bartlett in 1985 when she found materials on the Qing Grand Council that existed solely in Manchu. Fletcher unfortunately died suddenly in 1978 at the age of 50, with much of his own remaining writing published posthumously as much as two decades later, and leaving the task of further investigating China’s Inner Asian connections and source material to his successors.</p>\n\n<p>While the methodological basis of ‘New Qing’ history was being worked out, however, a number of historians working in more ‘traditional’ topics of Qing history would approach similar theoretical conclusions even just from Chinese sources. James Polachek, whose <em>The Inner Opium War</em> was published in 1992 but written on the basis of research conducted in the early 1980s, argued that Manchus and Banner Mongols still formed a coherent and influential interest group in the early nineteenth century, and one that openly contended with Han Chinese factions in officaldom. Philip A. Kuhn, investigating the Qing administrative apparatus and its response to the 1768 sorcery scare in <em>Soulstealers</em> (1990), argued that while the Manchuness of the Qing monarchy and its ruling elite was never to be stated publicly, a tacit recognition of this ethnic/cultural difference permeated the Qing bureaucratic record, and that Manchus occupied a distinctive and trusted role in the Qing government.</p>\n\n<p>Since the 1980s, Manchu-reading students of Qing history had begun publishing new work in English in earnest, helped along by the publication of Manchu archival materials in China and Taiwan as well as a resurgent scholarly interest both in these countries and also Japan. For instance, 1990 saw the publication of Pamela Crossley’s <em>Orphan Warriors</em>, which narrates how a family of Manchus in the Banner garrison town at Hangzhou adapted to the changes in the Qing that took place over the course of the late nineteenth century, with Crossley arguing that Manchus in these garrison towns developed their identity as a response to the state essentially giving up on their welfare. The same year saw Mark Elliott’s article ‘Bannerman and Townsman’, which covers the period of Manchu-imposed martial law in Zhenjiang during the First Opium War, and highlights how ethnic tensions manifested even at this point when Manchus had supposedly ‘Sinicised’.</p>\n\n<p>But perhaps the great tipping point was 1996, when Evelyn Rawski, then President of the Association for Asian Studies, published the text of her presidential address, ‘Reenvisioning the Qing: The Significance of the Qing Period in Chinese History’, in which she brought up an earlier address by former AAS president Ping-ti Ho delivered and published in 1967. Rawski gave an overview of how Qing studies had changed since Ho’s time in the president’s chair, particularly with the surge in interest in Manchu studies in the last decade or so, and and advocated a more Manchu-centric view of the Qing that rejected the simplistic and nationalistic ‘Sinicisation’ thesis. Instead, she argued for seeing the Qing not as a simply ‘Chinese’ dynasty but a multiplex, compound entity that was drawn in multiple different directions by multiple different forces, many if not most of which lay outside the bounds of ‘China proper’. Ho replied with a rather polemical article of his own, ‘In Defense of Sinicization’, in a 1998 issue of the <em>Journal of Asian Studies</em>, fiercely defending his earlier argument. The incident often gets presented, particularly by mainland Chinese historians, as laying out the contours of ‘New Qing’ versus establishment historiography and setting the stage for further debate, but this was in fact the end of it – Rawski did not respond to Ho’s diatribe, and few if any critiques from ‘traditional’ Qing historiography have regained purchase, least of all the insistence upon ‘Sinicisation’.</p>\n\n<h3>Examples of ‘New Qing’ Historiography</h3>\n\n<p>So that’s how we ended up with ‘New Qing’ historiography pretty firmly established by the turn of the millennium. But what, specifically, have ‘New Qing’ historians been able to say about the Qing under this new paradigm? Well, arguably what makes ‘New Qing’ a particularly unhelpful category is that basically <em>all</em> contemporary Western historians of the Qing fall under it anyway, and I wouldn’t even be able to start with trying to summarise over thirty years of historiography on every dimension of Qing history here. Instead, I’ll highlight some particularly prominent and pertinent works that have particularly interesting or important implications.</p>\n\n<p>The questions of what the Qing state conceived of itself as, who the Manchus were conceived as, and what the Manchus actually were in the context of the Qing state, remain somewhat open ones, with some quite distinct approaches from different historians. One view is presented by Pamela Crossley in <em>A Translucent Mirror</em> (1999): the Qing should be regarded as basically ‘culturally null’, with no particular preference for any specific group within the empire, and with the imperial state, embodied in the person of the emperor, adapting its image to suit distinct contexts, or making use of imagery that was consciously intended to appeal to multiple distinct constituencies. As part of the process of creating this model of universal monarchy, the Qing needed to solidify the boundaries between these constituencies and make them mutually exclusive, and it was as part of this process that the Qianlong Emperor (r. 1735-96/9) reorganised the Banners, in particular by expelling some of the Han Bannermen and recategorising many of the remainder as Manchus. By reducing the Han Banners to a relatively token component of the overall Banner system, the emperor thereby all but destroyed a previously liminal category of people, and more clearly defined Manchus and Han as distinct, setting the stage for an eventual self-definition of the Manchus as an ethnic group in the nineteenth century. Mark C. Elliott, in <em>The Manchu Way</em> (2001), interprets the same processes entirely differently: he argues that the Qing were always reliant on a component of Manchu-centric ‘ethnic sovereignty’, and that the Manchus had already developed ideas of their own ethnic essentialism in the early seventeenth century, with the Banners serving as an institutional mechanism that tied the Manchus together. It was an interlinked process of fiscal strain and cultural erosion that led the Qianlong Emperor to reorganise the Banners, re-emphasising their Manchuness and reducing the strain on their budgets. A somewhat shifted timeline is suggested by Edward J.M. Rhoads in <em>Manchus and Han</em> (2000): looking at ethnic policy and political discourse beginning with the ascendancy of Cixi in 1862, Rhoads argues that the Banners had, in a formal sense, remained an occupational caste rather than an ethnic preserve, and that the blurring of ‘Banner’ and ‘Manchu’, and the latter’s being made an essential identity based on descent, were products of changes mainly in the period 1860-1930. Such changes were brought about in no small part because the Qing state, seeking to re-centralise its authority after the Taiping War, was naturally drawn towards attempting to re-strengthen its traditional aristocracy, and to head off attempts to weaken or even abolish the Banners as an institution – which in fact would lead to its downfall at the hands of Han Chinese nationalists. However, as mutually opposed as these positions are, none would agree that the Qing deliberately or willingly subsumed their state or the Manchus under some essential notion of Chineseness, all propose that we see Bannermen and/or Manchus as a critical and distinct group in Qing policy down to the end of their rule.</p>\n\n<p>As stated, the Qing were not simply another iteration of a state in the Chinese mould, but rather an empire with far-reaching interests, in many ways comparable other Eurasian imperial states. It is not for nothing that Crossley finds parallels to the Qianlong Emperor in Louis XIV, or that Mark Elliott uses the Ottoman Janissaries as a point of comparison for the Eight Banners. And this is often true of writings on Qing colonialism and imperialism. The classic study of Qing imperialism in Central Asia, James Millward’s <em>Beyond the Pass</em> (1997), stands out as a bit of an exception for looking at Qing Xinjiang mainly on its own terms, describing in detail the Qing’s approaches to administering this diverse region, and using them as an illustration of the dynamics of imperial ideology and ethnic relations that would later be discussed in more abstract form by Crossley. But another major work on Qing Inner Asia, Peter Perdue’s <em>China Marches West</em> (2005), very much leans into the Eurasian comparative angle. Perdue, quite explicitly rejecting the PRC line that the Qing expansion was a process of ‘national unification’, presents the expansion of the Qing Empire into the eastern steppe, Tibet, and the Tarim Basin as a complex process of competing imperial expansion, with three major centralising states – the Qing, Russia, and the Zunghar Khanate – competing for dominance using the same technologies and undergoing similar processes of state expansion. For Laura Hostetler in <em>Qing Colonial Enterprise</em> (2001), the mechanisms of Qing colonialism in southwest China absolutely mirror those of European colonial empires, sometimes by conscious replication. Although the Qing pulled back from outright imposition of control over indigenous peoples during the reign of the Qianlong Emperor, they created scale maps (enabled by the employment of Jesuit advisors in this role) and increasingly precise ethnographic albums in order to impose their designs on the land, at least in an intellectual space. And it is the discourses around colonialism that are the focus of Emma Teng’s <em>Taiwan’s Imagined Geography</em> (2004), which surveys how Qing travel writers discussed the island between its conquest in the 1680s and its loss to Japan in 1895, during which time Han Chinese settlers seized more and more land from the indigenous peoples, virtually unburdened by Qing state policy. All four of these historians concur that the Qing were just as capable of engaging in processes of colonialism and imperialism as European states of the same time period, and that they did so for much the same sorts of reasons, with comparable discourses to justify such action. The implications of this line of thinking go much deeper than just discussing the frontiers of the Qing empire. As Teng argues, there is a tendency to see imperialism and colonialism as behaviours exclusive to European polities, with a direct presumption that ‘colonisers’ are white Europeans more or less by definition, and non-white, non-Europeans are the ‘colonised’ by that same token, barring the occasional and exceptional imitator like Japan. Drawing an arbitrary line whereby the Qing had an empire, but did not conduct imperialism, is both logically bizarre and also potentially a bit dangerous – and there will be more on this later.</p>\n\n<p>An interesting outgrowth of the above has come up in work by historians writing on the history of neighbouring countries, particularly in the nineteenth century, who have seen the Qing as engaging in basically the same processes of New Imperialism as the maritime European empires. After all, if the Qing acted like contemporaneous empires in the 17th and 18th centuries and consciously borrowed and replicated European technologies and expertise in doing so, why should they be any different in the nineteenth century? Kirk Larsen, in <em>Tradition, Treaties, and Trade</em> (2008), finds the Qing acting more or less exactly like Japan, Britain, France, or Russia in Korea during the imperial contests for control there, arguing the Qing abandoned much of the ‘traditional’ basis for their suzerainty in favour of codified treaty arrangements in light of those they had made with Europeans, and employing European technologies like the telegraph in their consolidation of control. Bradley Camp Davis in <em>Imperial Bandits</em> (2014), looking at the bandit groups known as the Black and Yellow Flag Armies in the north Vietnamese highlands, sees the Qing as basically the same as France in its approach to the rump Nguyen state in Tonkin, with both powers attempting to use the bandits as proxies in their attempts to secure control, both seeking to exploit technologies like telegraphs and steamships, and both ultimately moving towards creating a solid border rather than allowing the continued existence of a liminal highland zone. Most recently, Eric Schluessel has discussed the Qing colonial programme in Xinjiang post-1878 at length in <em>Land of Strangers</em> (2020), and found processes very much analogous with European settler-colonial projects. Qing imperialism, then, was not a historical anomaly localised to the eighteenth and early nineteenth centuries, but a process that continued into the nineteenth centuries and were picked up by the post-Qing republics. The interesting and potentially perturbing extension of this is that the Qing in the nineteenth century were perhaps not the victims of imperialism as such, but the losers in a contest of empires in which the participants differed by their material strength, but not their intentions, their means, or their discourses of power.</p>\n\n<p>A particularly interesting outgrowth of ‘New Qing’ historiography has pertained to the national histories of the Qing Empire’s non-Chinese regions. Nationalist historiography tends to assert the inevitability of a polity reaching it ‘natural frontiers’, to regard national identities as timeless and unchanging, and to see periods of foreign rule as invariably illegitimate and invariably temporary. But as Johan Elverskog has shown for Mongolia in <em>Our Great Qing</em> (2006), and Max Oidtmann for Tibet in <em>Forging the Golden Urn</em> (2018), the Qing’s Vajrayana Buddhist constituents were, until the last couple of decades of the empire, receptive to Qing rule, the disruptiveness of which could be quite variable. Both became considerably enlarged under Qing rule as liminal groups and territories were defined as being under the purview of one or the other – in particular, it was under Qing rule that Amdo came to be recognised as Tibetan, and the Oyirads were defined as Mongols. The growth of Han Chinese power later in the nineteenth century, and the consequent growth of Han colonialism in the Inner Asian empire, created significant disillusionment among Tibetans and Mongols, but even then the Mongolian and Tibetan states that formed in 1911-12 in some way saw fit to note – if perhaps only for rhetorical purposes – that it was their loyalty to the Qing state that led them to refuse to recognise a transfer of sovereignty to the new Chinese republic, and to declare their own independence. The delegitimisation of Qing rule among Tibetans and Mongolians has been largely post-hoc, and while neither can be begrudged this – especially not the Tibetans – it is ahistorical to assert that Qing rule was solely coercive or that, especially in the Tibetan case, the Qing played a considerable role in the creation of these national polities and their ruling elites.</p>\n\n<p>The final work that I would like to highlight takes us full circle in a number of ways. Evelyn Rawski’s <em>Early Modern China and Northeast Asia: Cross-Border Perspectives</em> (2014) is not per se methodologically unique in its de-emphasis on borders and its encouragement to approach the histories of polities in Northeast Asia (northeast China, Korea, Japan, eastern Mongolia, and ‘Manchuria’) in holistic and interconnected terms. However, it does serve as a great encapsulation of how ideas that have been kindled in ‘New Qing’ historiography can be applied more broadly. As Rawski argues, state formation and consolidation in Korea and Japan was not solely a product of importing Chinese ideas, but also driven by imperatives created by these regions’ proximity to militarily powerful but economically poor tribal polities in the Northeast Asian hinterland, just as interaction with the steppe helped drive state formation and expansion in Chinese polities and eventually the Qing. Questions of identity become particularly paramount in a zone where multiple different kinds of polities interacted and mixed over the course of centuries. And, going back to the work of John King Fairbank and Paul A. Cohen, there is an interesting suggestion about the role that Europeans played in the region’s Early Modern history. The rise of powerful European maritime empires, the connections these created across the world, and the goods, people, and ideas that moved across these maritime networks, meant that the Northeast Asian world was being reshaped through its interaction with Europe even in the <em>sixteenth</em> century. While this Western interaction was not, as Fairbank would have argued, the original impulse behind historical change in Asia, neither did the West have no influence whatever in its political, intellectual, cultural and religious changes. Moreover, there was no violent collision of a uniquely European imperialism with an unchanging Chinese tradition that irrevocably shook the foundations of the latter, but rather a meeting of imperial states that were in fact far more similar than nineteenth and twentieth century historians had believed.</p>\n\n<h3>The Controversy</h3>\n\n<p>Some may be under the impression that ‘New Qing History’, which has arguably been around since the 1980s and so may not exactly be that ‘new’ anymore, remains controversial. This is not helped by the fact that, whether through some deliberate exercise of Chinese soft power or simple naïveté on the part of editors, Wikipedia’s editorial policy on the Qing has generally regarded the critiques of ‘New Qing’ approaches to be equally valid as the proposition, which has no doubt helped keep traditional narratives alive.</p>\n\n<p>But academically, the fruits of the ‘New Qing’ turn have been basically uncontroversial and are the baseline consensus. There have been a few historians in the last decade or so who have overtly sought to push back on this, to varying degrees of success: Richard J. Smith’s third edition of <em>The Qing Dynasty and Traditional Chinese Culture</em> (2015) attempts to stake out a firmer claim for the continued relative importance of Chinese culture in the Qing’s multicultural landscape, while Yuanchong Wang’s <em>Remaking the Chinese Empire</em> (2018) argues that there was a Sinicisation of Qing political discourse in relation to Korea over the course of 1618-1911 (something that Kirk Larsen has been receptive to). There is also a body of international relations scholarship spearheaded by David Kang which tries to argue that a soft-power hegemony kept the Confucian ‘Sinosphere’ in a state of peace during both the Ming and Qing periods, asserting the Qing’s Confucian acculturation, but frankly this speaks mostly to the poor historical literacy of segments of the IR community than anything else. By and large, the notions that the Qing did not solely prioritise China proper at the expense of Inner Asia, that the Banner system and Manchu identity remained consistently important considerations for the Qing state, and that the Qing were an imperial and colonial state in a broadly Eurasian mode, are all broadly accepted in academia.</p>\n\n<p>Where, then, is there a controversy, and why? The answer is, in short, modern politics. In longer form: the People’s Republic of China, which rules over most of the former Qing Empire’s territory save for Taiwan, Outer Mongolia, and some parts of what are now the Russian Far East, has a number of ideological reasons for considering ‘New Qing History’ to be not only problematic, but indeed potentially seditious, as it fundamentally contradicts key aspects of the state’s ideology. Firstly, the PRC line has been increasingly nationalistic since the Mao years, and this has led to two very divergent perspectives on the Qing, but both of which are irreconcilable with the ‘New Qing’ approach: either the Qing ought to be seen as an illegitimate foreign dynasty, or as a dynasty that gained legitimation through subsuming itself to the Han Chinese majority in short order. The ‘New Qing’ proposition, which applies across the various interpretations, is that the Qing could both retain its distinct extra-Chinese identities <em>and</em> hold genuine political legitimacy in China, which ends up as anathema to both views. Secondly, the PRC is, by any good-faith metric, in possession of an empire, particularly in Xinjiang and Tibet but also in areas of significant Muslim minorities like Northwest China and in areas of traditionally indigenous settlement in the Southwest. Until recently, ‘New Qing History’ was objectionable for daring to suggest that China, which defines its modern identity through anti-imperialism, could be culpable in imperialism itself; these days, the rhetoric seems to be shifting to one where the PRC is actively taking pride in empire, and the fact that ‘New Qing’ historians are generally unfavourable towards imperialism, whoever does it, continues to makes it problematic, only differently. ‘New Qing’ historiography is not merely sceptical of prior narratives, but in fact fundamentally hostile to the assumptions underpinning Chinese nationalism.</p>\n\n<p>The decentering approach that the ‘New Qing’ paradigm has brought about thus has implications far beyond just the academic study of history. It has, by intention or otherwise, come to be a potent counter-narrative against nationalist polemic. It is worth stating quite firmly of course that historians in mainland China are not and have not been uniformly bound to the party line, and mainland historiography still does have a place in Western output on Chinese history. However, it is generally the anti-New Qing voices that have often been amplified, and it has often remained up to Western historians to question and dissect the Chinese national narrative. For my part, it’s my hope that readers will have grasped some of the key contours of modern Qing historiography, and may be more clued in to instances of nationalistic presentations of history in their own reading, especially on the Internet.</p>\n\n<h3>Further Reading</h3>\n\n<p>Obviously all the books cited above are worth a read, but for a general overview of much of the underlying historiographical theory I would again recommend Paul Cohen’s <em>Discovering History in China</em> (1984). Evelyn Rawski’s ‘Re-Envisioning the Qing’ then gives a good summary of historiographical developments up to 1996, while a potted summary of developments in Qing historiography to 2008 can be found in William Rowe’s <em>China’s Last Empire: The Great Qing</em> (2008), although his metric for differentiating ‘New Qing’ and ‘Eurasian’ historiography is a little arbitrary. Probably the best and most digestible overview is Laura Newby’s article ‘China: Pax Manjurica’ (2011), although this obviously misses out work done in the past decade.</p>\n\n<p>And of course there are plenty of books I could recommend that I just didn’t have space to cover above; if there’s anything in particular you’re curious on, I may be able to provide pointers.</p>\n\n<h4>Final note: Reddit Talk</h4>\n\n<p><em>As noted, the above post will be accompanied by a Reddit Talk, expected to last 1 hour, taking place via the mobile app this week. The format will be a Q&amp;A with us letting people join the call to ask questions and then getting moved to the audience. Below is a table of the start times converted to different time zones – hope to see you there!</em></p>\n\n<table><thead>\n<tr>\n<th>Timezone</th>\n<th>Time+Date</th>\n</tr>\n</thead><tbody>\n<tr>\n<td>HAST</td>\n<td>2-3 pm, Thu 26 Aug</td>\n</tr>\n<tr>\n<td>PST</td>\n<td>5-6 pm, Thu 26 Aug</td>\n</tr>\n<tr>\n<td>EST</td>\n<td>8-9 pm, Thu 26 Aug</td>\n</tr>\n<tr>\n<td>GMT</td>\n<td>12-1 am, Fri 27 Aug</td>\n</tr>\n<tr>\n<td>HKT</td>\n<td>8-9 am, Fri 27 Aug</td>\n</tr>\n<tr>\n<td>JST</td>\n<td>9-10 am, Fri 27 Aug</td>\n</tr>\n<tr>\n<td>AEST</td>\n<td>10-11 am, Fri 27 Aug</td>\n</tr>\n</tbody></table>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/pa13hj/monday_methods_the_new_qing_turn_and_decentering/",
  "subreddit": "AskHistorians",
  "id": "pa13hj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "A note before we start: This Monday Methods post has been written to go in\nconjunction with a Reddit Talk event which will take place on 26 August at 5-6\np.m., PST. Full details including timezone conversion will be listed at the end\nof this post.\n\n\nINTRODUCTION\n\nMany students and enthusiasts of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "始める前に一言。このマンデー・メソッドの記事はに行くために書かれています。\nこの記事は、8月26日午後5時から6時（PST）に開催されるReddit Talkイベントに合わせて書かれたものです。\np.m., PST. タイムゾーンの変換を含む詳細は、イベントの最後に記載されています。\nこの記事の最後に記載します。\n\n\nはじめに\n\n多くの学生や愛好家が...",
      "title": "月曜日のメソッド。新清」の転回と中国史の脱中心化｜また、Reddit Talkのお知らせ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在我们开始之前有一个说明。本周一的方法帖是为了配合Reddit Talk活动而写的。\n这篇文章是为了配合将于8月26日下午5点至6点举行的Reddit Talk活动。\np.m.，北京时间。包括时区转换在内的全部细节将在本帖末尾列出\n本帖末尾。\n\n\n简介\n\n许多学生和爱好者",
      "title": "星期一的方法。新清 \"的转向和中国历史的去中心化｜同时，红网讲座公告"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在我們開始之前有一個說明。本週一的方法帖是爲了配合Reddit Talk活動而寫的。\n這篇文章是爲了配合將於8月26日下午5點至6點舉行的Reddit Talk活動。\np.m.，北京時間。包括時區轉換在內的全部細節將在本帖末尾列出\n本帖末尾。\n\n\n簡介\n\n許多學生和愛好者",
      "title": "星期一的方法。新清 \"的轉向和中國歷史的去中心化｜同時，紅網講座公告"
    }
  ]
}