{
  "author": "milonuttigrain",
  "original_created_utc": 1634838471,
  "title": "If you get rich from crypto, keep it as a secret. Don’t tell anyone, your future will thank you.",
  "created_utc": 1634844912,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Some people have what is called here in New Zealand “tall poppy syndrome”. People become envious and resentful when you got rich or more successful than them.</p>\n\n<p>Some people will go like “Wow, you’re rich now. Can you lend me $10,000. You have got $1m, $10,000 is nothing mate. Right?”. It will put you into a dilemma, and we know - if you lend them $10,000 you might lose $10,000 and your friend as well.</p>\n\n<p>Some people will try to scam you. This is especially true if you go tell the world on the Internet about your wealth.</p>\n\n<p>Some people will tell other people about you getting rich from crypto as if you won lotto. They will think your gain is ill-gotten and you don’t deserve it. </p>\n\n<p>Some people will be like “Oh you should have told me about this opportunity mate”. Right, even if I told you back then, you wouldn’t buy anyway!!</p>\n\n<p>So save yourself some trouble. Keep your mouth shut, keep your seeds safe (and please use protection - even with your girlfriend!)</p>\n</div><!-- SC_ON -->",
  "score": 389,
  "permalink": "/r/CryptoCurrency/comments/qcxao8/if_you_get_rich_from_crypto_keep_it_as_a_secret/",
  "subreddit": "CryptoCurrency",
  "id": "qcxao8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Some people have what is called here in New Zealand “tall poppy syndrome”.\nPeople become envious and resentful when you got rich or more successful than\nthem.\n\nSome people will go like “Wow, you’re rich now. Can you lend me $10,000. You\nhave got $1m, $10,000 is nothing mate. Right?”. It will put you…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ニュージーランドでは「トールポピー症候群」と呼ばれている人がいます。\n人は、自分よりも金持ちになったり、成功したりすると、妬んだり恨んだりする。\n妬んだり恨んだりします。\n\n中には、「わあ、お金持ちになったんだね。俺に1万ドル貸してくれないか？あなたは\nあなたは100万ドル持っているから、1万ドルは何の仲間でもない。そうだろ？そうすれば、あなたは...",
      "title": "暗号で金持ちになっても、それは秘密にしておいてください。誰にも言わないでください、あなたの未来はあなたに感謝するでしょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在新西兰，有些人有所谓的 \"高大的罂粟花综合症\"。\n当你发财或比他们更成功时，人们会变得羡慕和怨恨。\n他们。\n\n有些人会说：\"哇，你现在有钱了。你能不能借给我1万美元。你\n你已经有了100万美元，1万美元不算什么，伙计。对吗？\"。这将使你...",
      "title": "如果你从加密货币中致富，请将其作为一个秘密。不要告诉任何人，你的未来会感谢你。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在新西蘭，有些人有所謂的 \"高大的罌粟花綜合症\"。\n當你發財或比他們更成功時，人們會變得羨慕和怨恨。\n他們。\n\n有些人會說：\"哇，你現在有錢了。你能不能借給我1萬美元。你\n你已經有了100萬美元，1萬美元不算什麼，夥計。對嗎？\"。這將使你...",
      "title": "如果你從加密貨幣中致富，請將其作爲一個祕密。不要告訴任何人，你的未來會感謝你。"
    }
  ]
}