{
  "author": "bjaxen",
  "the_new_excerpt": "It started in 2008 with the financial crash. I couldn't understand how it\nhappened, and so I dived down the rabbit hole and learnt about the creation of\nmoney. That blew my mind. Somewhere around this time, Max Keiser started his\ncampaign 'Buy Silver crash J P Morgan.' That was enough for me and I…",
  "original_created_utc": 1612263431,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这是从2008年的金融风暴开始的。我不明白它怎么会\n发生了，所以我潜入了兔子洞，了解到了关于创造\n钱。这让我大吃一惊。大约在这个时候，马克斯-基泽开始了他的。\n\"买入白银让摩根大通崩盘 \"的活动。这对我来说已经够了，我... ...",
      "title": "比特币是如何发生在我身上的"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是從2008年的金融風暴開始的。我不明白它怎麼會\n發生了，所以我潛入了兔子洞，瞭解到了關於創造\n錢。這讓我大喫一驚。大約在這個時候，馬克斯-基澤開始了他的。\n\"買入白銀讓摩根大通崩盤 \"的活動。這對我來說已經夠了，我... ...",
      "title": "比特幣是如何發生在我身上的"
    }
  ],
  "title": "How Bitcoin happened to me",
  "created_utc": 1612286389,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It started in 2008 with the financial crash. I couldn&#39;t understand how it happened, and so I dived down the rabbit hole and learnt about the creation of money. That blew my mind. Somewhere around this time, Max Keiser started his campaign &#39;Buy Silver crash J P Morgan.&#39; That was enough for me and I was in. Me and millions of others bought physical silver, kilos of it in bars and coins. We then sat back and waited for the crash, it didn&#39;t happen. Why?, because J P Morgan got out of it&#39;s short position and that was that. They always will. They own wallstreet the media all of it.</p>\n\n<p>During this time I would be on ZH arguing against Bitcoin and for Silver. I was in IT my whole life, but just thought that Bitcoin was stupid. One day while having a major fall out with someone on ZH, I realised that I actually didn&#39;t know what I was talking about, and that I knew nothing about Bitcoin. And so I read the white paper. Before I had even finished reading it, I was converted. 20 mins later I was back on ZH saying just how wrong I had been.</p>\n\n<p>I started buying small amounts of Bitcoin in late 2016 early 2017. I bought all the way up to the top, and all the way back down again. DCA all the way. I sold my silver at at a loss, and put that money into Bitcoin. The best thing I ever did.</p>\n\n<p>I am writing this here as I have been trying to let people know that buying silver now is still a waste of money if you want to change the system. Bitcoin is the ONLY way this will happen. You have to separate the state from money creation. It&#39;s the only way that you can beat the system that has been evolved to not include you. Today I am still buying Bitcoin along with all my friends and some family. 99.9% of my wealth is in Bitcoin. I would never sell not if it went to -0. Long live Satoshi and coders that are making this happen. For everyone involved with it, even the ones I don&#39;t agree with. The common ground here is change, and complete and total change the likes of which have never been seen before.</p>\n\n<p>PS. I also run a full node on a dedicated machine :)</p>\n</div><!-- SC_ON -->",
  "score": 240,
  "permalink": "/r/Bitcoin/comments/lat2g1/how_bitcoin_happened_to_me/",
  "subreddit": "Bitcoin",
  "id": "lat2g1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518525376
}