{
  "author": "AskScienceModerator",
  "original_created_utc": 1645704013,
  "title": "AskScience AMA Series: I'm Sliman Bensmaia, PhD, a neuroscientist who studies the sense of touch and how it informs motor control in order to develop better neuroprosthetics. AMA!",
  "created_utc": 1645714472,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi reddit, I&amp;#39;m Sliman Bensmaia! As a neuroscientist, my overall scientific goal is to understand how nervous systems give rise to flexible, intelligent behavior. I study this question through the lens of sensory processing: how does the brain process information about our environment to support our behavior? Biomedically, &lt;a href=\"https://bensmaialab.github.io/\"&gt;my lab&amp;#39;s goal&lt;/a&gt; is to use what we learn about natural neural coding to restore the sense of touch to people who have lost it (such as amputees and tetraplegic patients) by building better bionic hands that can interface directly with the brain. I&amp;#39;ll be on at 2 PM CT/3 PM ET/20 UT, AMA!&lt;/p&gt;\n\n&lt;p&gt;Username: &lt;a href=\"/u/UChicagoMedicine\"&gt;/u/UChicagoMedicine&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 120,
  "permalink": "/r/askscience/comments/t09b6b/askscience_ama_series_im_sliman_bensmaia_phd_a/",
  "subreddit": "askscience",
  "id": "t09b6b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hi reddit, I'm Sliman Bensmaia! As a neuroscientist, my overall scientific goal\nis to understand how nervous systems give rise to flexible, intelligent\nbehavior. I study this question through the lens of sensory processing: how does\nthe brain process information about our environment to support our…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "redditの皆さん、こんにちは！私はSliman Bensmaiaです。神経科学者として、私は科学的な目標を掲げています。\n神経系がどのように柔軟で知的なものを生み出すかを理解することです。\n行動する。私はこの問題を、感覚処理というレンズを通して研究しています。\n脳は環境に関する情報を処理し、私たちの生活を支えています。",
      "title": "AskScienceのAMAシリーズ。私は、より良い神経補綴を開発するために、触覚とそれが運動制御にどのように影響するかを研究している神経科学者、スリマン・ベンスマイア博士です。AMA!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嗨，reddit，我是Sliman Bensmaia! 作为一名神经科学家，我的总体科学目标是\n是要了解神经系统如何产生灵活、智能的\n行为。我通过感觉处理的角度来研究这个问题：大脑是如何\n大脑如何处理有关我们环境的信息，以支持我们的行为。",
      "title": "AskScience AMA系列。我是Sliman Bensmaia博士，一位研究触觉以及触觉如何影响运动控制以开发更好的神经义肢的神经科学家。AMA!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嗨，reddit，我是Sliman Bensmaia! 作爲一名神經科學家，我的總體科學目標是\n是要了解神經系統如何產生靈活、智能的\n行爲。我通過感覺處理的角度來研究這個問題：大腦是如何\n大腦如何處理有關我們環境的信息，以支持我們的行爲。",
      "title": "AskScience AMA系列。我是Sliman Bensmaia博士，一位研究觸覺以及觸覺如何影響運動控制以開發更好的神經義肢的神經科學家。AMA!"
    }
  ]
}