{
  "author": "DareNotFallAsleep",
  "the_new_excerpt": "This is a common trope\n[https://reddit.com/r/brasil/comments/lwcrbe/portugal_do_caix%C3%A3o/] in\nPortuguese-speaking “pop history” and to some extent I know this trade flow did\nindeed exist (Portugal using gold and it’s low-aggregate value products to buy\nBritish textiles, etc), as evidenced in…",
  "original_created_utc": 1614784311,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这是一个常见的套路\n[https://reddit.com/r/brasil/comments/lwcrbe/portugal_do_caix%C3%A3o/]\n葡语 \"流行史\"，在一定程度上我知道这种贸易流确实\n确实存在（葡萄牙用黄金和它的低总值产品来购买）。\n英国的纺织品等），具体表现在：...",
      "title": "葡萄牙/巴西的历史 \"杠杠说 \"是，葡萄牙用巴西的黄金购买 \"英国工业化商品\"，精英阶层拒绝工业化，从而挥霍掉了保持世界强国的机会。这其中有多少是真的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是一個常見的套路\n[https://reddit.com/r/brasil/comments/lwcrbe/portugal_do_caix%C3%A3o/]\n葡語 \"流行史\"，在一定程度上我知道這種貿易流確實\n確實存在（葡萄牙用黃金和它的低總值產品來購買）。\n英國的紡織品等），具體表現在：...",
      "title": "葡萄牙/巴西的歷史 \"槓槓說 \"是，葡萄牙用巴西的黃金購買 \"英國工業化商品\"，精英階層拒絕工業化，從而揮霍掉了保持世界強國的機會。這其中有多少是真的？"
    }
  ],
  "title": "The history “bar talk” in Portugal/Brazil is that Portugal squandered its way out of remaining a global power by using Brazil’s gold to buy “British industrialised goods” and its elite refusing to industrialise the country. How much of this is true?",
  "created_utc": 1614796283,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is a <a href=\"https://reddit.com/r/brasil/comments/lwcrbe/portugal_do_caix%C3%A3o/\">common trope</a> in Portuguese-speaking “pop history” and to some extent I know this trade flow did indeed exist (Portugal using gold and it’s low-aggregate value products to buy British textiles, etc), as evidenced in David Ricardo’s examples (always involving Portuguese wine and British cloth), Adam Smith (who also liked to use Portugal in his examples, if memory serves me right), but also in events such as the Methuen Treaty. Being Portuguese and having studied in Portugal myself, this was also definitely something my high school history teacher used to say, and we spent quite some time reading up on Portugal‘s historical trade relationship with the UK. In addition, Brazil’s massive gold mines were also discovered precisely at this point in time. A key fact, however, that most people (choose to) ignore is that Portugal pursued this type of deals with Britain to safeguard its sovereignty against French-backed Spanish incursions, especially in Europe, so I already know things aren’t so straightforward to begin with.</p>\n\n<p>But then I wonder - is this really the case? Or Portugal’s squandering of its resources, all flowing to Britain, is overstated? And if so was it that different from what was going on in Spain and the Netherlands, to use two other key colonial players that were also late to the industrialisation game? </p>\n\n<p>I’m asking this because one of the go-to answers out in the street to both Portugal and Brazil’s current-day challenges often boils down to “18th century Portuguese were so dumb they exploited and stripped an entire country of its mineral resources and ended up with nothing to show - unlike the Dutch, for example!”.</p>\n\n<p>Thanks</p>\n</div><!-- SC_ON -->",
  "score": 618,
  "permalink": "/r/AskHistorians/comments/lww497/the_history_bar_talk_in_portugalbrazil_is_that/",
  "subreddit": "AskHistorians",
  "id": "lww497",
  "is_self": true,
  "media": null,
  "is_video": false
}