{
  "author": "teenpunkinheat",
  "original_created_utc": 1652493655,
  "title": "What are some socially acceptable excuses for a 23 year old who doesn't like to drink alcohol?",
  "created_utc": 1652526088,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Title says it. I&amp;#39;m 23 years old, and I just don&amp;#39;t like drunk people. I hate being around drunk people and I just feel put off by the results of drinking. However, whenever I get invited for a drink, I always get interrogated when I just say I don&amp;#39;t like it. I think due to my age maybe? Are there any excuses I can use in the future which don&amp;#39;t offend people  and get them off my back?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/NoStupidQuestions/comments/up70ln/what_are_some_socially_acceptable_excuses_for_a/",
  "subreddit": "NoStupidQuestions",
  "id": "up70ln",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Title says it. I'm 23 years old, and I just don't like drunk people. I hate\nbeing around drunk people and I just feel put off by the results of drinking.\nHowever, whenever I get invited for a drink, I always get interrogated when I\njust say I don't like it. I think due to my age maybe? Are there…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルに書いてありますね。私は23歳ですが、酔っぱらいがとにかく嫌いです。私は23歳です。\n酔っぱらいと一緒にいるのも嫌だし、お酒を飲んだ結果、気後れしてしまうだけなんです。\nしかし、飲みに誘われても、嫌いと言っただけなのに、いつも尋問されます。\nと聞かれる。年齢のせいでしょうか？もしかして...",
      "title": "お酒が苦手な23歳の社会通念上の言い訳は？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "标题说明了这一点。我今年23岁，我只是不喜欢喝醉的人。我讨厌\n我讨厌和喝醉的人在一起，我只是对喝酒的结果感到厌恶。\n然而，每当我被邀请去喝酒的时候，我总是被审问。\n就说我不喜欢喝酒。我想也许是由于我的年龄？是否有...",
      "title": "一个23岁的人不喜欢喝酒，有什么社会可以接受的借口？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "標題說明了這一點。我今年23歲，我只是不喜歡喝醉的人。我討厭\n我討厭和喝醉的人在一起，我只是對喝酒的結果感到厭惡。\n然而，每當我被邀請去喝酒的時候，我總是被審問。\n就說我不喜歡喝酒。我想也許是由於我的年齡？是否有...",
      "title": "一個23歲的人不喜歡喝酒，有什麼社會可以接受的藉口？"
    }
  ]
}