{
  "author": "Junior_Print_6532",
  "original_created_utc": 1634074333,
  "title": "I started DCAing into crypto so that I can start smoking again",
  "created_utc": 1634125102,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve read all the success stories on this sub of people giving up their bad habits and investing the money they’ve saved into something that will better their future.  Something that will improve the lives of their beautiful children.  It sickens me.</p>\n\n<p>I don’t want a lambo or a house or a fund to give to my non-existent (and now very improbable) children.  All I want from crypto is enough invested so that my earnings can cover the costs of my smoking habit.  So I can smoke however much I want, whenever I want, for however long I want.</p>\n\n<p>I hope you guys realise your crypto dreams - I’ll let you know how I get on.</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/q6w7t7/i_started_dcaing_into_crypto_so_that_i_can_start/",
  "subreddit": "CryptoCurrency",
  "id": "q6w7t7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’ve read all the success stories on this sub of people giving up their bad\nhabits and investing the money they’ve saved into something that will better\ntheir future. Something that will improve the lives of their beautiful children.\nIt sickens me.\n\nI don’t want a lambo or a house or a fund to give…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブサイトでは、悪い習慣をやめて、貯めたお金を投資に回した人のサクセスストーリーをすべて読みました。\n貯めたお金を将来のために投資している人の成功談を読みました。\n自分の将来を良くするために。自分の可愛い子供たちの生活を向上させるために。\nそれは私をうんざりさせます。\n\n私はランボや家や基金が欲しいわけではありません・・・。",
      "title": "喫煙を再開するために暗号化してDCAを始めました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我读过这个网站上所有的成功故事，这些人放弃了他们的坏习惯，并将他们省下的钱投资到一些会更好的东西上。\n他们放弃了自己的坏习惯，并将节省下来的钱投资到能改善他们未来的事情上。\n他们的未来。一些将改善他们美丽的孩子的生活的东西。\n这让我感到恶心。\n\n我不想要兰博或房子或基金来给...",
      "title": "我开始将DCA转换为加密货币，以便我可以重新开始吸烟。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我讀過這個網站上所有的成功故事，這些人放棄了他們的壞習慣，並將他們省下的錢投資到一些會更好的東西上。\n他們放棄了自己的壞習慣，並將節省下來的錢投資到能改善他們未來的事情上。\n他們的未來。一些將改善他們美麗的孩子的生活的東西。\n這讓我感到噁心。\n\n我不想要蘭博或房子或基金來給...",
      "title": "我開始將DCA轉換爲加密貨幣，以便我可以重新開始吸菸。"
    }
  ]
}