{
  "author": "worksinthetown",
  "original_created_utc": 1628441860,
  "title": "How do I tell a guy I’ve only ever had “sex” once and I’m 30 years old?",
  "created_utc": 1628452620,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am about to enter into a relationship with a guy I’ve been smitten with for about 10 years and I am struggling with the inevitable conversation where I tell him I’ve only ever had penetrative sex once and it wasn’t sex, it was more like a drunken assault. </p>\n\n<p>I am not triggered by the thought of sex with the new guy and get turned on like normal folks whenever we make out or touch etc. But I’m a little nervous to tell him he will be my first real sexual partner.</p>\n</div><!-- SC_ON -->",
  "score": 110,
  "permalink": "/r/TooAfraidToAsk/comments/p0ibjx/how_do_i_tell_a_guy_ive_only_ever_had_sex_once/",
  "subreddit": "TooAfraidToAsk",
  "id": "p0ibjx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I am about to enter into a relationship with a guy I’ve been smitten with for\nabout 10 years and I am struggling with the inevitable conversation where I tell\nhim I’ve only ever had penetrative sex once and it wasn’t sex, it was more like\na drunken assault.\n\nI am not triggered by the thought of sex…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "10年ほど前から気になっていた男性と交際することになりました。\n10年ほど前から気になっていた男性と交際を始めようとしているのですが、どうしても避けられない会話に悩んでいます。\n一度だけ挿入されたことがありますが、それはセックスではなく、酔って暴行されたようなものでした。\n酔っぱらって暴行したようなものだった。\n\n私はセックスのことを考えても何も起こらないのですが...。",
      "title": "一度しか「セックス」をしたことがない、30歳の男性にどう伝えればいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我即将与一个我迷恋了10年的男人建立关系。\n我正在为这段不可避免的对话而挣扎，在这段对话中我告诉他\n我告诉他我只做过一次插入式性行为，那不是性行为，更像是\n醉酒的攻击。\n\n我并没有因为想到性而受到刺激......",
      "title": "我如何告诉一个男人我只做过一次 \"性\"，而且我已经30岁了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我即將與一個我迷戀了10年的男人建立關係。\n我正在爲這段不可避免的對話而掙扎，在這段對話中我告訴他\n我告訴他我只做過一次插入式性行爲，那不是性行爲，更像是\n醉酒的攻擊。\n\n我並沒有因爲想到性而受到刺激......",
      "title": "我如何告訴一個男人我只做過一次 \"性\"，而且我已經30歲了？"
    }
  ]
}