{
  "author": "rexfordays",
  "the_new_excerpt": "I get the excitement, I feel it too, but there's a few problems with posts like\nthis:\n\n 1. They are low effort, meme-replacing, moon-farming posts that offer no value.\n 2. The value that they offer, especially in a bull market, is often outdated.\n    Yesterday I saw a text post about bitcoin…",
  "original_created_utc": 1618401255,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "興奮するのはわかりますし、私も感じますが、このような投稿にはいくつかの問題があります。\nこのような投稿にはいくつかの問題があります。\n\n 1. 1.努力が足りない、ミームリプレイス、ムーンファーミング的な投稿で、価値がない。\n 2. 2. 特に強気の市場では、提供される価値が古いものになることが多い。\n    昨日、私はビットコインについてのテキストポストを見ました...",
      "title": "\"X coin new ATH of $!\"と投稿するのはやめませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我明白这种兴奋，我也感觉到了，但是像这样的帖子有几个问题。\n这个。\n\n 1. 它们都是低努力、换备忘录、养月亮的帖子，没有提供任何价值。\n 2. 它们提供的价值，尤其是在牛市中，往往是过时的。\n    昨天我看到一个关于比特币的文字帖...",
      "title": "能不能不要再发 \"X币新ATH为元！\""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我明白這種興奮，我也感覺到了，但是像這樣的帖子有幾個問題。\n這個。\n\n 1. 它們都是低努力、換備忘錄、養月亮的帖子，沒有提供任何價值。\n 2. 它們提供的價值，尤其是在牛市中，往往是過時的。\n    昨天我看到一個關於比特幣的文字帖...",
      "title": "能不能不要再發 \"X幣新ATH爲元！\""
    }
  ],
  "title": "Can we stop posting \"X coin new ATH of $!\"",
  "created_utc": 1618421432,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I get the excitement, I feel it too, but there&#39;s a few problems with posts like this:</p>\n\n<ol>\n<li>They are low effort, meme-replacing, moon-farming posts that offer no value.</li>\n<li>The value that they offer, especially in a bull market, is often outdated. Yesterday I saw a text post about bitcoin breaking 63K omg! But, a few hours later when I was reading it, the price had already crossed 64k.</li>\n</ol>\n\n<p>Is there a moon proposal to limit these kinds of posts? I just saw one for cardano hitting $1.50, and now there&#39;s another for 1.54.  Are we going to post another when it hits $1.545?? I&#39;d even be ok with these posts as long as they are limited to the top 10 coins by marketcap and only for round number milestones ($69,420 being the obvious and only exception).</p>\n\n<p>Also, I have no idea what flair a rant like this deserves, sorry.</p>\n</div><!-- SC_ON -->",
  "score": 231,
  "permalink": "/r/CryptoCurrency/comments/mqoyb3/can_we_stop_posting_x_coin_new_ath_of/",
  "subreddit": "CryptoCurrency",
  "id": "mqoyb3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566615684
}