{
  "author": "GroundbreakingLack78",
  "original_created_utc": 1643738650,
  "title": "You don’t need to “convince” nor argue with anyone to invest in crypto. It’s not some MLM, Pyramid scheme, Ponzi etc.. When they’ll be interested, they’ll ask.",
  "created_utc": 1643762552,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’ve seen a lot of opinions thrown out here, whether you should or shouldn’t tell your family, friends, neighbours about crypto.&lt;/p&gt;\n\n&lt;p&gt;The general consensus of this subreddit is always: &lt;strong&gt;“DCA and HODL!”&lt;/strong&gt; Yes, the past already proved that it’s one of the best if not the best strategy out there. But do we really need to force this motto everywhere we go?&lt;/p&gt;\n\n&lt;p&gt;Shouldn’t we focus more on teaching them what crypto actually solves, how it can literally “change” or “transform” the world that were living it to a better place? One of the biggest benefits that crypto is offering to us, is that there will be no more total control of every aspect in our lives. &lt;/p&gt;\n\n&lt;p&gt;If these people will be interested in it, they’ll ask, and that’s time when we, crypto investors can try to direct them to the right way, and show them that crypto isn’t some get rich free quick scheme provided by Tai Lopez. Creating financial freedom from crypto or getting wealthy from it is only side effect.&lt;/p&gt;\n\n&lt;p&gt;Just my poor point of view. Have a nice day.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 322,
  "permalink": "/r/CryptoCurrency/comments/si1abt/you_dont_need_to_convince_nor_argue_with_anyone/",
  "subreddit": "CryptoCurrency",
  "id": "si1abt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’ve seen a lot of opinions thrown out here, whether you should or shouldn’t\ntell your family, friends, neighbours about crypto.\n\nThe general consensus of this subreddit is always: “DCA and HODL!” Yes, the past\nalready proved that it’s one of the best if not the best strategy out there. But\ndo we…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここで、様々な意見が飛び交うのを見ました。\n家族、友人、隣人に暗号について話す。\n\nこのサブレディットの総意はいつもこうです。\"DCAとHODL!\" そう、過去に\nそれが最高の戦略でないにしても、ベストの一つであることはすでに証明されている。しかし\n私たちは...",
      "title": "暗号に投資するために、誰かを「説得」したり、議論したりする必要はないのです。それはいくつかのMLM、ピラミッドスキーム、ポンジなどではありません。彼らは興味を持つだろうとき、彼らは尋ねるでしょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在这里看到很多意见，你是否应该或不应该\n告诉你的家人、朋友、邻居关于加密货币的事情。\n\n这个分论坛的普遍共识始终是。\"DCA和HODL！\" 是的，过去的\n已经证明了这是最好的，甚至是最好的策略之一。但是\n我们是否...",
      "title": "你不需要 \"说服 \"或与任何人争论来投资加密货币。这不是什么传销，金字塔计划，庞氏骗局等等。当他们感兴趣时，他们会问。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在這裏看到很多意見，你是否應該或不應該\n告訴你的家人、朋友、鄰居關於加密貨幣的事情。\n\n這個分論壇的普遍共識始終是。\"DCA和HODL！\" 是的，過去的\n已經證明了這是最好的，甚至是最好的策略之一。但是\n我們是否...",
      "title": "你不需要 \"說服 \"或與任何人爭論來投資加密貨幣。這不是什麼傳銷，金字塔計劃，龐氏騙局等等。當他們感興趣時，他們會問。"
    }
  ]
}