{
  "author": "laidlyworm",
  "original_created_utc": 1627292483,
  "title": "Trying to find a British “sea dragon cult”",
  "created_utc": 1627314632,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is perhaps the most vague and unhelpful description of anything ever, but I strongly, distinctly remember reading this in one of my many history/cultural books as a child. A single, tantalizing sentence, paraphrased from memory:</p>\n\n<p>“In Britain, a tiny cult worshipping a ‘sea dragon’ survived into the 1910s.”</p>\n\n<p>Is there any documentation of this <em>anywhere??</em> It sounds incredibly far-fetched, but I remember it being in a nonfiction work, dedicated to historical oddities or something. Sorry for the vagueness!</p>\n</div><!-- SC_ON -->",
  "score": 126,
  "permalink": "/r/AskHistorians/comments/orvf7r/trying_to_find_a_british_sea_dragon_cult/",
  "subreddit": "AskHistorians",
  "id": "orvf7r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is perhaps the most vague and unhelpful description of anything ever, but I\nstrongly, distinctly remember reading this in one of my many history/cultural\nbooks as a child. A single, tantalizing sentence, paraphrased from memory:\n\n“In Britain, a tiny cult worshipping a ‘sea dragon’ survived into…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは、おそらく最も曖昧で役に立たない説明だと思いますが、私は\n子供の頃に読んだ歴史や文化の本の中で、これを読んだことを強く、はっきりと覚えています。\n子供の頃、歴史や文化の本で読んだことをはっきりと覚えている。記憶を頼りに言い換えてみると、心に響く一文がある。\n\nイギリスでは、\"海竜 \"を崇拝する小さな教団が...。",
      "title": "イギリスの \"海竜教団 \"を探してみると"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这也许是对任何事物最模糊和最无助的描述，但我\n我强烈地、清楚地记得在我的许多历史/文化书籍中读到过这一点。\n书中读到的。一个诱人的句子，根据记忆转述的。\n\n\"在英国，一个崇拜'海龙'的小邪教活到了......",
      "title": "试图寻找英国的 \"海龙崇拜\""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這也許是對任何事物最模糊和最無助的描述，但我\n我強烈地、清楚地記得在我的許多歷史/文化書籍中讀到過這一點。\n書中讀到的。一個誘人的句子，根據記憶轉述的。\n\n\"在英國，一個崇拜'海龍'的小邪教活到了......",
      "title": "試圖尋找英國的 \"海龍崇拜\""
    }
  ]
}