{
  "author": "KingFly11",
  "the_new_excerpt": "In the coming two months, a wave of money will slosh into the system, which, I\nwould argue, will result in significant financial firepower that will lead to\neven greater financial gains in speculative asset trades. The latest Democratic\nproposal for $1,400 payments for singles earning up to $75,000…",
  "original_created_utc": 1613852846,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在未来的两个月里，一波资金将涌入系统，这，我。\n会认为，这将导致巨大的金融火力，将导致\n在投机性资产交易中获得更大的经济收益。最新的民主\n建议向收入不超过75,000美元的单身人士发放1,400美元... ...",
      "title": "即将到来的经济刺激支付--散户投资者的水龙头"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在未來的兩個月裏，一波資金將湧入系統，這，我。\n會認爲，這將導致巨大的金融火力，將導致\n在投機性資產交易中獲得更大的經濟收益。最新的民主\n建議向收入不超過75,000美元的單身人士發放1,400美元... ...",
      "title": "即將到來的經濟刺激支付--散戶投資者的水龍頭"
    }
  ],
  "title": "The Coming Stimulus Payments — The Retail Investor Spigot",
  "created_utc": 1613901555,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In the coming two months, a wave of money will slosh into the system, which, I would argue, will result in significant financial firepower that will lead to even greater financial gains in speculative asset trades. The latest Democratic proposal for $1,400 payments for singles earning up to $75,000 and couples earning up to $150,000 would cost about $422 BILLION—with most of that money being disbursed in a matter of months. In a study focused on the first stimulus payment done last year, those with incomes between $35k and $150k decided to significantly increase their exposure to investing. If someone has some good estimates or ideas on how much of the coming stimulus payments will flow into the financial markets, it would be much appreciated.</p>\n\n<p>Whatever the estimate is of how much will flow into the investment market, my main point is that I think speculative assets have room to run with the stimulus checks coming out.</p>\n\n<p>I am planning on placing some trades once the cash disbursement process ramps up next month. If anyone has sectors or types of securities, which will be most receptive to this phenomenon, that would be great. If you have ideas about specific trades, even better. The areas I&#39;m looking at mostly involve more long-term positioning in industry more resilient to inflation like oil (I&#39;m liking Exxon Mobile and Chevron). However, I&#39;m happy to discuss and engage with others and their opinions.</p>\n\n<p>*Edit: I added my long-term view on investment positioning to provide some insight into what I&#39;m doing with my more long-term decision-making. I should have been clearer in that last paragraph that I am interested more in the short and medium term trade. </p>\n</div><!-- SC_ON -->",
  "score": 59,
  "permalink": "/r/investing/comments/lofwdn/the_coming_stimulus_payments_the_retail_investor/",
  "subreddit": "investing",
  "id": "lofwdn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332881987
}