{
  "author": "ToonSquadFan4Ever",
  "the_new_excerpt": "I'm relatively new to crypto and I fully admit to have been swept by the XRP\npump-and-dump hype that happened recently. In case you happened to miss it, the\nshort version--that I gather is not an uncommon scam--was that rumors of this\ntelegram investor group that planned on pumping and very…",
  "original_created_utc": 1612193623,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我对加密技术比较陌生，我完全承认自己被XRP刷屏了。\n最近发生的抽水式炒作。如果你碰巧错过了，那\n简而言之... ...我觉得这并不是一个罕见的骗局... ...是这个传言的...\n电报投资集团，计划在抽水和很。",
      "title": "在此感谢这个分论坛帮我险些避开了XRP的抽水和甩水。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我對加密技術比較陌生，我完全承認自己被XRP刷屏了。\n最近發生的抽水式炒作。如果你碰巧錯過了，那\n簡而言之... ...我覺得這並不是一個罕見的騙局... ...是這個傳言的...\n電報投資集團，計劃在抽水和很。",
      "title": "在此感謝這個分論壇幫我險些避開了XRP的抽水和甩水。"
    }
  ],
  "title": "I would like to thank this subreddit for helping me narrowly avoid the XRP pump-and-dump.",
  "created_utc": 1612205848,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m relatively new to crypto and I fully admit to have been swept by the XRP pump-and-dump hype that happened recently. In case you happened to miss it, the short version--that I gather is not an uncommon scam--was that rumors of this telegram investor group that planned on pumping and very specifically not selling XRP to keep its value rising. People were told the pump was going to happen on Monday, at 8:30am. </p>\n\n<p>I bought into the hype -- having missed out on GME and Dogecoin I was in a really &quot;I want to get into investing&quot; mood and was <em>certain</em> that this was gonna be it. Everywhere I looked about this was filled with memes about going to the moon with it and really positive talk, and everywhere that was <em>not</em> filled with memes had almost no discussion on it. Which honestly makes me realize is part of the issue; the only places I heard about this in where also places where you were made to feel crazy for not buying into the hype. It was a really bad feedback loop.</p>\n\n<p>Fortunately I stumbled upon a few discussions on this subreddit about it and it helped me take a step back and think about the logistics of it. I thought about it a lot and looking outside of my bubble really helped me realize how I wasn&#39;t investing, I was positively gambling. I had no idea about XRP as a technology and was buying it solely as a quick get rich scheme which was a terrible idea. The many stories people had here about how pump-and-dump schemes worked to prey on overly excited newbies helped me realize that I <em>was</em> the overly excited newbie and I wasn&#39;t a weird exception, I was just being driven by FOMO and hype. </p>\n\n<p>I had bought in when it was at .4, and last night when I was up late reading this subreddit and realizing I had screwed up it was going up by a lot, at .67. I set up a stop limit at  .65 and went to bed, woke up realizing how close I had come to losing a lot of money.</p>\n\n<p>Now to be clear, I did do some reading and I think that XRP could be an interesting coin to invest in. But not the way I did it and not for the reasons I did it. I want to say I dodged a bullet, but instead it’s more accurate to say you guys pushed me out of the way when the bullet was on its way to me. I really appreciate that. In the future, I’m going to invest in crypto when I legitimately believe there is a long term possibility of growth based on the technology and opportunities instead of trying to ride the wave. I learned an invaluable lesson and can’t thank you guys enough for it.</p>\n</div><!-- SC_ON -->",
  "score": 886,
  "permalink": "/r/CryptoCurrency/comments/la5s79/i_would_like_to_thank_this_subreddit_for_helping/",
  "subreddit": "CryptoCurrency",
  "id": "la5s79",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518530871
}