{
  "author": "asdJesus",
  "the_new_excerpt": "Hey, so I have several thousand dollars (which is a lot for me) invested via\nCash App. I have been seeing a lot of things that are making me really nervous\nto be so heavily invested in the brokerage. I just opened a Fidelity account and\nI want to transfer to it so I don't have to worry anymore. I'm…",
  "original_created_utc": 1618809869,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ねえ、だから私は数千ドル（私にとっては多額）の投資を\nキャッシュアプリ。いろいろなことを目の当たりにして、証券会社に多額の投資をしていることが本当に不安になってきました。\n証券会社に多額の投資をしていることに。ちょうどFidelityの口座を開設したので\nもう心配しなくてもいいように移籍したいと思っています。私は...",
      "title": "I'm Really Scared"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嘿，所以我有几千美元（这对我来说是一个很大的）通过投资。\n现金app。我看到了很多让我非常紧张的事情。\n如此重金投入的券商。我刚刚开了一个富达帐户和\n我想转入它，这样我就不用再担心了。我是...",
      "title": "我真的很害怕"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嘿，所以我有幾千美元（這對我來說是一個很大的）通過投資。\n現金app。我看到了很多讓我非常緊張的事情。\n如此重金投入的券商。我剛剛開了一個富達帳戶和\n我想轉入它，這樣我就不用再擔心了。我是...",
      "title": "我真的很害怕"
    }
  ],
  "title": "I'm Really Scared",
  "created_utc": 1618832075,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey, so I have several thousand dollars (which is a lot for me) invested via Cash App. I have been seeing a lot of things that are making me really nervous to be so heavily invested in the brokerage. I just opened a Fidelity account and I want to transfer to it so I don&#39;t have to worry anymore. I&#39;m just concerned that I am going to mess up somewhere along the way or make an oversight and screw myself. Like I said, this is a lot of money for me, so I&#39;m very tressed. Any and all help would be much appreciated. I can also only transfer full stocks so I will have to sell of any stock that is a percentage. I am extremely nervous for many reasons regarding this. If anyone has any insight about Cash App as a whole it would be much appreciated, thank you.</p>\n</div><!-- SC_ON -->",
  "score": 79,
  "permalink": "/r/stocks/comments/mtttrf/im_really_scared/",
  "subreddit": "stocks",
  "id": "mtttrf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171527430
}