{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "**Abstract:**\n\n* **^(Due to the impact of Martin Luther King Day holiday, US stocks are closed for one day on Monday;)**\n* **^(Brent crude oil hit a new high in more than three years, and US oil rose above US $84 to a two-month high;)**\n* **^(Gold tried to break $1820;)**\n* **^(Apple was forced to relax payment regulations, and Dutch regulators: will review rectification measures;)**\n* **^(Credit Suisse is in constant trouble! The chairman stepped down for violating Epidemic Prevention Regulations &gt; &gt; &gt;)**\n\n**International market**\n\n**^(On January 17, the US stock market was closed for one day due to Martin Luther King Day)**\n\nJanuary 17 (Monday) is the \"Martin Luther King Day\", the US stock market is closed for one day, and normal trading resumes on January 18 (Tuesday).\n\n**^(European stocks closed higher across the board, with the UK FTSE 100 index up 0.91%)**\n\nFrance's CAC40 index rose 0.82%, Britain's FTSE 100 index rose 0.91%, Spain's ibex35 index rose 0.38%, Italy's FTSE MIB index rose 0.5% and Europe's Stoxx 50 index rose 0.74%.\n\n**^(The settlement price of international crude oil futures closed up slightly, and Brent crude oil rose 0.49%)**\n\nThe settlement price of international crude oil futures closed up slightly. The settlement price of Brent crude oil futures in March closed up US $0.42, or 0.49%, to US $86.48/barrel.\n\n**^(Gold prices remained stable as investors weighed the prospect of interest rate hikes against the Omicron threat)**\n\nGold prices stabilized after the best weekly increase in two months, and traders weighed the prospect of monetary policy against the threat posed by a new round of coronavirus epidemic in the United States. The price of gold remained above $1800 an ounce after gold fell for the first time in three years in 2021 as investors began to reflect tightening monetary policy.\n\n**International macro**\n\n**^(Fudge: it's impossible to say that the Omicron variant marks the end of the pandemic)**\n\nDr. Anthony Foch, chief medical adviser of the US president, said it is not possible to assert that the mutation of the EMI will symbolized the evolution of COVID-19 from the pandemic to a local epidemic. \"Whether Omicron will be the live virus vaccine we all want is an open question, because with the emergence of new variants, there is a lot of variability,\" fouch said at the online meeting of the Davos agenda of the world economic forum on Monday.\n\n**^(Dalio warned: at a time of inflation panic, we should not be too hasty to get rid of fossil fuels)**\n\nRui Dalio, founder of hedge fund Jinqiao water, warned that the transition from fossil fuels could not be too fast, and said that stopping the supply of funds to the industry would have a destabilizing effect when inflation soared.\n\n**^(The International Labour Organization lowered its forecast for the recovery of the global labor market in 2022)**\n\nThe International Labour Organization, headquartered in Geneva, Switzerland, issued a report on trends in world employment and social outlook 2022. The report shows that novel coronavirus pneumonia will have a slow and uncertain global recovery in 2022 because of the significant impact of the new crown pneumonia epidemic on the global labour market.\n\n**^(The meeting of finance ministers of euro zone countries agreed to make new arrangements for national debt reduction plans)**\n\nFinance ministers of 19 euro zone countries held a meeting at the EU headquarters in Brussels on the 17th local time, focusing on how to modify the provisions on the government debt ceiling in the European stability and growth pact. After the meeting on the same day, European Commission Vice President Dong broskis said that all countries basically agreed to amend the more stringent provisions of the original convention and adopt a more practical and operational approach.\n\n**^(On the 17th, more than 50 million people in the eastern United States received winter storm warnings)**\n\nAccording to the report of CNN on January 17 local time, the winter storm continued to attack the eastern United States. More than 50 million people have received extreme weather warnings related to the storm in the morning of January 17. Tornadoes, freezing rain and heavy snow brought by the storm also swept parts of Florida to Maine. Affected by the storm, the problem of flight cancellation and local power outage is still serious.\n\n**^(Tonga volcanic eruption: how much impact does it have on the global climate and economy?)**\n\nWhen Omicron disturbed the world, the news of Tonga volcanic eruption once again shocked the sensitive nerves of human society. A large-scale volcanic eruption occurred in the waters of Tonga, an island country in the South Pacific. The volcanic eruption interrupted Tonga's Internet connection, and the United States, New Zealand, Japan, Australia and other countries also issued tsunami warnings to varying degrees. Satellite detection results show that the volcanic ash reaches an altitude of about 28 kilometers, and mushroom clouds can even be seen on satellite cloud images.\n\n**Company news**\n\n**^(Large technology companies in the United States are facing a new round of supervision! How big is the impact this time?)**\n\nEurope, Asia and the United States are considering introducing new laws to prevent large technology companies from using their own market forces to curb competition. In addition, the new laws may involve restricting the use of artificial intelligence technologies such as face recognition.\n\n**^(\"Apple tax\" has been hit hard again! Apple's \"compromise\" to the Netherlands)**\n\nRecently, apple said it would abide by the ruling of the Dutch consumer and market supervision authority and allow users to use two other payment methods other than the apple system when downloading dating software in the online Apple store. In addition, on January 11 local time, the Korean Communications Commission said that Apple had submitted its compliance plan, which would allow app developers to provide third-party payment options in Korea and reduce commission fees.\n\n**^(The chairman of Credit Suisse, Switzerland's second largest bank, resigned and twice violated the new crown's epidemic prevention regulations)**\n\nAntonio Orta Osorio, chairman of Credit Suisse Bank, resigned on the 17 day because of a violation of COVID-19's isolation regulations. According to Broadcasting British Corporation (BBC) 17 reported that the internal investigation conducted by Credit Suisse confirmed that in July last year, Orta Osorio watched the finals of the Wimbledon tennis tournament in England, and he should have been in quarantine according to the travel restrictions of COVID-19 in Britain at that time. In addition, he also violated Swiss epidemic prevention regulations. On November 28, 2021, he arrived in Switzerland by plane and left the country on December 1; According to Swiss epidemic prevention regulations, he should have been isolated for 10 days after entering the country.\n\n**^(Oyo was approved to go public as soon as this week, seeking an IPO valuation of $9 billion)**\n\nAccording to reports, people familiar with the matter said today that after preliminary contact with potential investors, Indian economy hotel chain Oyo plans to seek a valuation of about $9 billion in its IPO (initial public offering).\n\n**^(Expand the global production territory of COVID-19 oral medicine, Pfizer signed the French cdmo to provide API)**\n\nNovasep, a French pharmaceutical cdmo (R &amp; D and production outsourcing service) company, announced that it had signed a letter of intent with Pfizer to join the global supply chain of its new crown protease inhibitor paxlovid. It is reported that this project is also included in Pfizer's plan to invest 520 million euros in France in the next five years.\n\n**^(Wall Street poured cold water on Unilever's ambitious acquisition)**\n\nUnilever considered raising its offer after GlaxoSmithKline rejected a £ 50 billion ($68 billion) takeover offer. Many analysts opposed the deal, saying it was meaningless and the valuation was too high.\n\n**^(Labor shortage is coming again! McDonald's was forced to shorten its business hours in the United States)**\n\nMcDonald's chief executive Chris Kempczinski told Fox Businesses that McDonald's is restricting the operation time of individual stores to solve the labor shortage problem caused by the increase in COVID-19 infection, and some stores may reduce their business hours by as much as 10%.\n\n**^(The surge in infection cases in the United States comes at a time when Pfizer and MSD are in serious shortage of oral drugs)**\n\nPfizer and MSD's new crown oral drug is considered to be the key to ending the pandemic. However, with the surge of Omicron infection cases in the United States, these new crown oral drugs are in an embarrassing situation of serious shortage of supply and long production cycle.",
  "author_fullname": "t2_h9vowh19",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Keep updating. What happened last night and this morning?",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": "news",
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_s6rv5y",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.87,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 43,
  "total_awards_received": 1,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Industry News",
  "can_mod_post": false,
  "score": 43,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1642491192,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": true,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;Abstract:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;&lt;sup&gt;Due to the impact of Martin Luther King Day holiday, US stocks are closed for one day on Monday;&lt;/sup&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;&lt;sup&gt;Brent crude oil hit a new high in more than three years, and US oil rose above US $84 to a two-month high;&lt;/sup&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;&lt;sup&gt;Gold tried to break $1820;&lt;/sup&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;&lt;sup&gt;Apple was forced to relax payment regulations, and Dutch regulators: will review rectification measures;&lt;/sup&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;&lt;sup&gt;Credit Suisse is in constant trouble! The chairman stepped down for violating Epidemic Prevention Regulations &amp;gt; &amp;gt; &amp;gt;&lt;/sup&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;International market&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&lt;sup&gt;On January 17, the US stock market was closed for one day due to Martin Luther King Day&lt;/sup&gt;&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;January 17 (Monday) is the &amp;quot;Martin Luther King Day&amp;quot;, the US stock market is closed for one day, and normal trading resumes on January 18 (Tuesday).&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&lt;sup&gt;European stocks closed higher across the board, with the UK FTSE 100 index up 0.91%&lt;/sup&gt;&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;France&amp;#39;s CAC40 index rose 0.82%, Britain&amp;#39;s FTSE 100 index rose 0.91%, Spain&amp;#39;s ibex35 index rose 0.38%, Italy&amp;#39;s FTSE MIB index rose 0.5% and Europe&amp;#39;s Stoxx 50 index rose 0.74%.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&lt;sup&gt;The settlement price of international crude oil futures closed up slightly, and Brent crude oil rose 0.49%&lt;/sup&gt;&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;The settlement price of international crude oil futures closed up slightly. The settlement price of Brent crude oil futures in March closed up US $0.42, or 0.49%, to US $86.48/barrel.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&lt;sup&gt;Gold prices remained stable as investors weighed the prospect of interest rate hikes against the Omicron threat&lt;/sup&gt;&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Gold prices stabilized after the best weekly increase in two months, and traders weighed the prospect of monetary policy against the threat posed by a new round of coronavirus epidemic in the United States. The price of gold remained above $1800 an ounce after gold fell for the first time in three years in 2021 as investors began to reflect tightening monetary policy.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;International macro&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&lt;sup&gt;Fudge: it&amp;#39;s impossible to say that the Omicron variant marks the end of the pandemic&lt;/sup&gt;&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Dr. Anthony Foch, chief medical adviser of the US president, said it is not possible to assert that the mutation of the EMI will symbolized the evolution of COVID-19 from the pandemic to a local epidemic. &amp;quot;Whether Omicron will be the live virus vaccine we all want is an open question, because with the emergence of new variants, there is a lot of variability,&amp;quot; fouch said at the online meeting of the Davos agenda of the world economic forum on Monday.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&lt;sup&gt;Dalio warned: at a time of inflation panic, we should not be too hasty to get rid of fossil fuels&lt;/sup&gt;&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Rui Dalio, founder of hedge fund Jinqiao water, warned that the transition from fossil fuels could not be too fast, and said that stopping the supply of funds to the industry would have a destabilizing effect when inflation soared.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&lt;sup&gt;The International Labour Organization lowered its forecast for the recovery of the global labor market in 2022&lt;/sup&gt;&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;The International Labour Organization, headquartered in Geneva, Switzerland, issued a report on trends in world employment and social outlook 2022. The report shows that novel coronavirus pneumonia will have a slow and uncertain global recovery in 2022 because of the significant impact of the new crown pneumonia epidemic on the global labour market.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&lt;sup&gt;The meeting of finance ministers of euro zone countries agreed to make new arrangements for national debt reduction plans&lt;/sup&gt;&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Finance ministers of 19 euro zone countries held a meeting at the EU headquarters in Brussels on the 17th local time, focusing on how to modify the provisions on the government debt ceiling in the European stability and growth pact. After the meeting on the same day, European Commission Vice President Dong broskis said that all countries basically agreed to amend the more stringent provisions of the original convention and adopt a more practical and operational approach.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&lt;sup&gt;On the 17th, more than 50 million people in the eastern United States received winter storm warnings&lt;/sup&gt;&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;According to the report of CNN on January 17 local time, the winter storm continued to attack the eastern United States. More than 50 million people have received extreme weather warnings related to the storm in the morning of January 17. Tornadoes, freezing rain and heavy snow brought by the storm also swept parts of Florida to Maine. Affected by the storm, the problem of flight cancellation and local power outage is still serious.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&lt;sup&gt;Tonga volcanic eruption: how much impact does it have on the global climate and economy?&lt;/sup&gt;&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;When Omicron disturbed the world, the news of Tonga volcanic eruption once again shocked the sensitive nerves of human society. A large-scale volcanic eruption occurred in the waters of Tonga, an island country in the South Pacific. The volcanic eruption interrupted Tonga&amp;#39;s Internet connection, and the United States, New Zealand, Japan, Australia and other countries also issued tsunami warnings to varying degrees. Satellite detection results show that the volcanic ash reaches an altitude of about 28 kilometers, and mushroom clouds can even be seen on satellite cloud images.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Company news&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&lt;sup&gt;Large technology companies in the United States are facing a new round of supervision! How big is the impact this time?&lt;/sup&gt;&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Europe, Asia and the United States are considering introducing new laws to prevent large technology companies from using their own market forces to curb competition. In addition, the new laws may involve restricting the use of artificial intelligence technologies such as face recognition.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&lt;sup&gt;&amp;quot;Apple tax&amp;quot; has been hit hard again! Apple&amp;#39;s &amp;quot;compromise&amp;quot; to the Netherlands&lt;/sup&gt;&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Recently, apple said it would abide by the ruling of the Dutch consumer and market supervision authority and allow users to use two other payment methods other than the apple system when downloading dating software in the online Apple store. In addition, on January 11 local time, the Korean Communications Commission said that Apple had submitted its compliance plan, which would allow app developers to provide third-party payment options in Korea and reduce commission fees.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&lt;sup&gt;The chairman of Credit Suisse, Switzerland&amp;#39;s second largest bank, resigned and twice violated the new crown&amp;#39;s epidemic prevention regulations&lt;/sup&gt;&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Antonio Orta Osorio, chairman of Credit Suisse Bank, resigned on the 17 day because of a violation of COVID-19&amp;#39;s isolation regulations. According to Broadcasting British Corporation (BBC) 17 reported that the internal investigation conducted by Credit Suisse confirmed that in July last year, Orta Osorio watched the finals of the Wimbledon tennis tournament in England, and he should have been in quarantine according to the travel restrictions of COVID-19 in Britain at that time. In addition, he also violated Swiss epidemic prevention regulations. On November 28, 2021, he arrived in Switzerland by plane and left the country on December 1; According to Swiss epidemic prevention regulations, he should have been isolated for 10 days after entering the country.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&lt;sup&gt;Oyo was approved to go public as soon as this week, seeking an IPO valuation of $9 billion&lt;/sup&gt;&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;According to reports, people familiar with the matter said today that after preliminary contact with potential investors, Indian economy hotel chain Oyo plans to seek a valuation of about $9 billion in its IPO (initial public offering).&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&lt;sup&gt;Expand the global production territory of COVID-19 oral medicine, Pfizer signed the French cdmo to provide API&lt;/sup&gt;&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Novasep, a French pharmaceutical cdmo (R &amp;amp; D and production outsourcing service) company, announced that it had signed a letter of intent with Pfizer to join the global supply chain of its new crown protease inhibitor paxlovid. It is reported that this project is also included in Pfizer&amp;#39;s plan to invest 520 million euros in France in the next five years.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&lt;sup&gt;Wall Street poured cold water on Unilever&amp;#39;s ambitious acquisition&lt;/sup&gt;&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Unilever considered raising its offer after GlaxoSmithKline rejected a £ 50 billion ($68 billion) takeover offer. Many analysts opposed the deal, saying it was meaningless and the valuation was too high.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&lt;sup&gt;Labor shortage is coming again! McDonald&amp;#39;s was forced to shorten its business hours in the United States&lt;/sup&gt;&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;McDonald&amp;#39;s chief executive Chris Kempczinski told Fox Businesses that McDonald&amp;#39;s is restricting the operation time of individual stores to solve the labor shortage problem caused by the increase in COVID-19 infection, and some stores may reduce their business hours by as much as 10%.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&lt;sup&gt;The surge in infection cases in the United States comes at a time when Pfizer and MSD are in serious shortage of oral drugs&lt;/sup&gt;&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Pfizer and MSD&amp;#39;s new crown oral drug is considered to be the key to ending the pandemic. However, with the surge of Omicron infection cases in the United States, these new crown oral drugs are in an embarrassing situation of serious shortage of supply and long production cycle.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "866eb162-65e6-11e5-a903-1252b640afe9",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#80adf9",
  "id": "s6rv5y",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "lilyxu185",
  "discussion_type": null,
  "num_comments": 18,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/s6rv5y/keep_updating_what_happened_last_night_and_this/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/s6rv5y/keep_updating_what_happened_last_night_and_this/",
  "subreddit_subscribers": 3532418,
  "created_utc": 1642510256,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1642491192,
  "the_new_excerpt": "Abstract:\n\n * Due to the impact of Martin Luther King Day holiday, US stocks are closed for\n   one day on Monday;\n * Brent crude oil hit a new high in more than three years, and US oil rose\n   above US $84 to a two-month high;\n * Gold tried to break $1820;\n * Apple was forced to relax payment…"
}