{
  "author": "DestructorEFX",
  "original_created_utc": 1652315311,
  "title": "Thanks to all the “toxic bitcoin maximalist” that taught me to not buy shitcoin since 2019",
  "created_utc": 1652369809,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I got into bitcoin back in 2019, when I was learning about it, I questioned about other coins. Most bitcoiners said to stay away from other coins, that they weren’t decentralized and safe. At the begging I didn’t understand, even believed that other coin could be better. But as the years passed and learned more about bitcoin, it made more sense (bought E.T.H only once for $40, sold for 45$ lol). Unfortunately, these past few days are a catastrophic example that many people are learning the hard way why you shouldn’t put considerable money on shitcoins. But that’s the free market, nobody is going to bail you out.&lt;/p&gt;\n\n&lt;p&gt;So, thanks to all the bitcoiners that taught me to stay away from other coins, stay safe and stacks sats!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 320,
  "permalink": "/r/Bitcoin/comments/uno6bn/thanks_to_all_the_toxic_bitcoin_maximalist_that/",
  "subreddit": "Bitcoin",
  "id": "uno6bn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I got into bitcoin back in 2019, when I was learning about it, I questioned\nabout other coins. Most bitcoiners said to stay away from other coins, that they\nweren’t decentralized and safe. At the begging I didn’t understand, even\nbelieved that other coin could be better. But as the years passed and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私がビットコインに手を出したのは、2019年、ビットコインを学んでいるときに、疑問に思ったことがありました。\n他のコインについて。ほとんどのビットコイナーは、他のコインには手を出すなと言いました、彼らは\n分散型で安全ではない、と。当初、私は理解できず、他のコインの方が優れているとさえ思っていました。\n他のコインの方が優れている可能性があるとさえ信じていました。しかし、年月が経つにつれて、そして...",
      "title": "2019年からクソコインを買うなと教えてくれた「毒舌ビットコイン最大手」の皆さん、ありがとうございました"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是在2019年开始接触比特币的，当时我正在了解它，我对\n关于其他硬币。大多数比特币持有者都说要远离其他硬币，说它们是\n不是去中心化和安全的。在开始的时候，我不理解，甚至\n相信其他币会更好。但随着时间的推移和...",
      "title": "感谢所有从2019年开始教我不要买狗屎币的 \"有毒的比特币极简主义者\""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是在2019年開始接觸比特幣的，當時我正在瞭解它，我對\n關於其他硬幣。大多數比特幣持有者都說要遠離其他硬幣，說它們是\n不是去中心化和安全的。在開始的時候，我不理解，甚至\n相信其他幣會更好。但隨着時間的推移和...",
      "title": "感謝所有從2019年開始教我不要買狗屎幣的 \"有毒的比特幣極簡主義者\""
    }
  ]
}