{
  "author": "GelDel12",
  "original_created_utc": 1636139149,
  "title": "Sometimes you need to sell at a loss, and put that money into something else. The opportunity costs of holding a dead bag",
  "created_utc": 1636155615,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Preface: There are coins you should hold because they bounce right back, even after dipping hard. Having said that...</p>\n\n<p>It seems that there&#39;s a very heavy push into &quot;you don&#39;t lose if you don&#39;t sell&quot;. I&#39;ve seen this line of thinking much more than &quot;cut your losses and move on to something else.&quot;</p>\n\n<p>If you don&#39;t consider the consequences, you lose the opportunity to reinvest into another coin that can ultimately shoot so high that it offsets your initial loss. </p>\n\n<p>I&#39;m very surprised to hear when crypto investors don&#39;t consider opportunity cost. The other day I had short discussion where someone said they have been holding to an investment for 7 months now. They have had money sitting there doing almost nothing for them.</p>\n\n<p>If they had put some of that money somewhere else, they would be making money</p>\n</div><!-- SC_ON -->",
  "score": 175,
  "permalink": "/r/CryptoCurrency/comments/qni74p/sometimes_you_need_to_sell_at_a_loss_and_put_that/",
  "subreddit": "CryptoCurrency",
  "id": "qni74p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Preface: There are coins you should hold because they bounce right back, even\nafter dipping hard. Having said that...\n\nIt seems that there's a very heavy push into \"you don't lose if you don't sell\".\nI've seen this line of thinking much more than \"cut your losses and move on to\nsomething else.\"\n\nIf…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "はじめに 強く浸してもすぐに戻ってくるので、持っておくべきコインがある。\nるからです。そうは言っても...。\n\n売らなければ損をしない」という考え方が非常に強くなっているようです。\nこの考え方は、「損切りをして他のものに移る」よりも、「売らなければ損はしない」という考え方の方が\n何か他のことをする」よりも\n\nもし...",
      "title": "時には、損をしてでも売って、そのお金を他のものに回す必要があります。デッドバッグを持つことによる機会費用"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "序言。有些硬币你应该持有，因为它们会马上反弹，甚至在\n跌得很厉害。话虽如此...\n\n似乎有一种非常强烈的 \"不卖就不亏 \"的想法。\n我看到这种思路比 \"减少损失，继续前进 \"要多得多。\n其他东西。\"\n\n如果...",
      "title": "有时你需要亏本出售，并将这些钱投入到其他方面。持有死袋的机会成本"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "序言。有些硬幣你應該持有，因爲它們會馬上反彈，甚至在\n跌得很厲害。話雖如此...\n\n似乎有一種非常強烈的 \"不賣就不虧 \"的想法。\n我看到這種思路比 \"減少損失，繼續前進 \"要多得多。\n其他東西。\"\n\n如果...",
      "title": "有時你需要虧本出售，並將這些錢投入到其他方面。持有死袋的機會成本"
    }
  ]
}