{
  "author": "The_Texidian",
  "the_new_excerpt": "Yikes.....That’s all I gotta say.\n\nIt’s been noticeable that the quality of posts and comments have gone down with\nthe influx of novice investors. It’s due to a lack of experience, however thanks\nto the Dunning-Kruger Effect these people often feel superior to seasoned\ninvestors....including Warren…",
  "original_created_utc": 1616643355,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "Yikes.....这就是我要说的。\n\n已经注意到，帖子和评论的质量已经下降，随着\n新手投资者的涌入。这是由于缺乏经验，然而由于\n邓宁-克鲁格效应，这些人往往觉得自己比老练的人更优秀\n投资者....，包括沃伦...",
      "title": "小心你在r/stocks上读到的东西。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Yikes.....這就是我要說的。\n\n已經注意到，帖子和評論的質量已經下降，隨着\n新手投資者的湧入。這是由於缺乏經驗，然而由於\n鄧寧-克魯格效應，這些人往往覺得自己比老練的人更優秀\n投資者....，包括沃倫...",
      "title": "小心你在r/stocks上讀到的東西。"
    }
  ],
  "title": "Be careful with what you read on r/stocks",
  "created_utc": 1616655643,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Yikes.....That’s all I gotta say. </p>\n\n<p>It’s been noticeable that the quality of posts and comments have gone down with the influx of novice investors. It’s due to a lack of experience, however thanks to the Dunning-Kruger Effect these people often feel superior to seasoned investors....including Warren Buffett, Peter Lynch and academics. </p>\n\n<p>It used to be that I’d come across down right nonsensical (worse than bad) posts or comments every other week. However in the past month that number has increased to once every other day....and sorry but it mostly comes from the dividend investing crowd and the TSLA fan-Boiz. </p>\n\n<p>Today I was trying to explain to someone what Dividend irrelevance theory is...and somehow this person determined that you can have a 13% “guaranteed” rate of return no matter what the stock price does; meaning the stock can crash 90% and your rate of return is still +13% or more for the year. Well turns out this guy calculates his rate of return by the number of shares bought buy his DRIP per stock....rather than growth/loss in the value of your investments. And ofc he felt like he cracked the investing code of ancient wisdom that us plebs don’t know. So his idea was to buy high yield stocks, hold on and never sell....according to this user it was impossible to lose money with a dividend stock because it always pays a dividend.....I think this takes the cake for worst advice/logic I’ve seen on this sub and that’s saying a lot. </p>\n\n<p>So I think it’s a great time to remind people. Be careful whom you take advice from. Especially on Reddit and YouTube. There’s a few users out there that are good, but the majority don’t know what they’re doing half the time.</p>\n</div><!-- SC_ON -->",
  "score": 437,
  "permalink": "/r/stocks/comments/mcoy9k/be_careful_with_what_you_read_on_rstocks/",
  "subreddit": "stocks",
  "id": "mcoy9k",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752822106
}