{
  "author": "ConcreteCrusher",
  "the_new_excerpt": "I get a sense from watching the market in the past years and company\nfundamentals matter less and less. Seems like as of late you make gains by\nsimply riding the wave of investor sentiment regardless of where the long term\nroad leads. Oddly enough, this sentiment, which often seems irrational, seems…",
  "original_created_utc": 1611548193,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我通过观察过去几年的市场和公司的情况，感受到了一种\n基本面越来越不重要。似乎最近你通过以下方式获得收益\n只不过是乘着投资者情绪的浪潮，不管长线的走势如何。\n道路导致。奇怪的是，这种情绪，往往显得非理性，似乎...",
      "title": "投资是否已经不再是基本面，而是群体心理？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我通過觀察過去幾年的市場和公司的情況，感受到了一種\n基本面越來越不重要。似乎最近你通過以下方式獲得收益\n只不過是乘着投資者情緒的浪潮，不管長線的走勢如何。\n道路導致。奇怪的是，這種情緒，往往顯得非理性，似乎...",
      "title": "投資是否已經不再是基本面，而是羣體心理？"
    }
  ],
  "title": "Has Investing Become Less About Fundamentals and More About Group Psychology?",
  "created_utc": 1611583965,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I get a sense from watching the market in the past years and company fundamentals matter less and less. Seems like as of late you make gains by simply riding the wave of investor sentiment regardless of where the long term road leads. Oddly enough, this sentiment, which often seems irrational, seems to be propping up companies with failed business models since those companies can cash out on the stock gains. I fear this is going to end very badly because eventually there could be a sudden and deep shift, leaving certain stocks or sectors in a very bad downward spiral. Akin to the tension that springs a significant earthquake. Then when the volatility hits, its about which way the Fed and Congress decide to move.</p>\n\n<p>Is this logic flawed and if not, what percent of investors are successful focusing on investor sentiment and not fundamentals?</p>\n</div><!-- SC_ON -->",
  "score": 179,
  "permalink": "/r/investing/comments/l4fqbs/has_investing_become_less_about_fundamentals_and/",
  "subreddit": "investing",
  "id": "l4fqbs",
  "is_self": true,
  "media": null,
  "is_video": false
}