{
  "author": "PrometheanSigma",
  "the_new_excerpt": "Hey all! I was one of the many who bought into the GME/AMC hype and ended up\nlosing because of it. I lost around 2k (as a 21 year old college student, around\n20% of my savings). This is nothing for many of you and won't be a life ruining\nevent for me, but it definitely taught me some important…",
  "original_created_utc": 1612469162,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "嘿，大家好！我是众多相信GME/AMC炒作的人之一。我是许多人中的一员，谁买到了GME/AMC炒作，并结束了\n因为它而失去了。我输了2千左右（作为一个21岁的大学生，大约在\n我存款的20%）。) 这对很多人来说不算什么，也不会是毁天灭地的事。\n但它确实教会了我一些重要的... ...",
      "title": "对于有500美元的人来说，最好的ETF或共同基金？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嘿，大家好！我是衆多相信GME/AMC炒作的人之一。我是許多人中的一員，誰買到了GME/AMC炒作，並結束了\n因爲它而失去了。我輸了2千左右（作爲一個21歲的大學生，大約在\n我存款的20%）。) 這對很多人來說不算什麼，也不會是毀天滅地的事。\n但它確實教會了我一些重要的... ...",
      "title": "對於有500美元的人來說，最好的ETF或共同基金？"
    }
  ],
  "title": "Best ETFs or mutual funds for someone with $500?",
  "created_utc": 1612492707,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey all! I was one of the many who bought into the GME/AMC hype and ended up losing because of it. I lost around 2k (as a 21 year old college student, around 20% of my savings). This is nothing for many of you and won&#39;t be a life ruining event for me, but it definitely taught me some important lessons. </p>\n\n<p>I want to actually be smart with investing and I plan on making that loss up over time by being a smart long-term investor. I salvaged around 1k of what I had initially put in, and I plan on using half of that for this. I think ETFs are probably a much safer way to get started and to slowly make my money back. What funds would you all suggest? Would you suggest any other kinds of investments?  Thank you for the input!</p>\n\n<p>EDIT: Thanks for the comments! Decided to go with 2 in ARKK, 3 in ICLN, 4 in YOLO, and 2 in JETS. Here&#39;s to not looking at this account for a year and seeing where it goes!</p>\n</div><!-- SC_ON -->",
  "score": 124,
  "permalink": "/r/stocks/comments/lcoov7/best_etfs_or_mutual_funds_for_someone_with_500/",
  "subreddit": "stocks",
  "id": "lcoov7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123201953
}