{
  "author": "anon517",
  "the_new_excerpt": "People who say Bitcoin is a gamble have no idea how risky it is to own money\nthat is being heavily debased on the whims of people you can't trust for reasons\nthat are suspicious at best.\n\nDo you really want gold that can't be transported or self-verified? Do you\nreally want land or a house that can…",
  "original_created_utc": 1614925790,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "那些说比特币是赌博的人，根本不知道拥有金钱的风险有多大。\n你不能相信的人，因为你不能相信的原因，被严重贬低了\n最多只能说是可疑的。\n\n你真的想要无法运输或自我验证的黄金吗？你\n真的想要土地或房子，可以...",
      "title": "\"现金是一种负债而不是资产。\" - \"迈克尔-赛勒"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "那些說比特幣是賭博的人，根本不知道擁有金錢的風險有多大。\n你不能相信的人，因爲你不能相信的原因，被嚴重貶低了\n最多隻能說是可疑的。\n\n你真的想要無法運輸或自我驗證的黃金嗎？你\n真的想要土地或房子，可以...",
      "title": "\"現金是一種負債而不是資產。\" - \"邁克爾-賽勒"
    }
  ],
  "title": "\"Cash is a liability not an asset.\" - Michael Saylor",
  "created_utc": 1614980084,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>People who say Bitcoin is a gamble have no idea how risky it is to own money that is being heavily debased on the whims of people you can&#39;t trust for reasons that are suspicious at best.</p>\n\n<p>Do you really want gold that can&#39;t be transported or self-verified? Do you really want land or a house that can be confiscated by the state when you miss property tax payments? Do you really want stocks that rely on business outcome?</p>\n\n<p>As the price of Bitcoin goes higher, it becomes increasingly crazy to own anything else. People think it&#39;s a speculative bubble, and have thought that way since 2011. It&#39;s eating all the value not because people are betting on huge gains but simply because every other option is complete trash. It&#39;s the lifeboat.</p>\n\n<p>You&#39;re nuts if you don&#39;t even have 1% of the best financial insurance policy ever created by man.</p>\n</div><!-- SC_ON -->",
  "score": 171,
  "permalink": "/r/Bitcoin/comments/ly5vr5/cash_is_a_liability_not_an_asset_michael_saylor/",
  "subreddit": "Bitcoin",
  "id": "ly5vr5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542567859
}