{
  "author": "gofigure37",
  "original_created_utc": 1658122313,
  "title": "\"brainwashed\" into believing America is the best?",
  "created_utc": 1658133510,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sure there will be a huge age range here. But im 23, born in &amp;#39;98. Lived in CA all my life. Just graduated college a while ago. After I graduated highschool and was blessed enough to visit Europe for the first time...it was like I was seeing clearly and I realized just how conditioned I had become. I truly thought the US was &amp;quot;the best&amp;quot; and no other country could remotely compare.&lt;/p&gt;\n\n&lt;p&gt;That realization led to a further revelation... I know next to nothing about ANY country except America. 12+ years of history and I&amp;#39;ve learned nothing about other countries – only a bit about them if they were involved in wars. But America was always painted as the hero and whoever was against us were portrayed as the evildoers. I&amp;#39;ve just been questioning everything I&amp;#39;ve been taught growing up. I feel like I&amp;#39;ve been &amp;quot;brainwashed&amp;quot; in a way if that makes sense? I just feel so disgusted that many history books are SO biased. There&amp;#39;s no other side to them, it&amp;#39;s simply America&amp;#39;s side or gtfo.&lt;/p&gt;\n\n&lt;p&gt;Does anyone share similar feelings? This will definitely be a controversial thread, but I love hearing any and all sides so leave a comment!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/NoStupidQuestions/comments/w1rfy4/brainwashed_into_believing_america_is_the_best/",
  "subreddit": "NoStupidQuestions",
  "id": "w1rfy4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm sure there will be a huge age range here. But im 23, born in '98. Lived in\nCA all my life. Just graduated college a while ago. After I graduated highschool\nand was blessed enough to visit Europe for the first time...it was like I was\nseeing clearly and I realized just how conditioned I had…"
}