{
  "author": "justinlongbranch",
  "the_new_excerpt": "Bitcoin is just now starting to be mentioned in the main stream news media. This\nis a good thing. Institutional investment in Bitcoin is passingly interesting.\nBitcoin surpassing it's previous ATH is a bullet point. Bitcoin doubling its ATH\nis a headline.\n\nThis is a purely psychological issue, going…",
  "original_created_utc": 1609385405,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "比特币刚刚开始在主流新闻媒体中被提及。这\n是件好事。机构对比特币的投资非常有趣。\n比特币超越之前的ATH是一个要点。比特币ATH翻了一番\n是头条新闻。\n\n这纯粹是一个心理问题，去…",
      "title": "比特币在媒体中的受欢迎程度不会像2017年那样再次发生，直到它突破40K、50K或更多"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "比特幣剛剛開始在主流新聞媒體中被提及。這\n是件好事。機構對比特幣的投資非常有趣。\n比特幣超越之前的ATH是一個要點。比特幣ATH翻了一番\n是頭條新聞。\n\n這純粹是一個心理問題，去…",
      "title": "比特幣在媒體中的受歡迎程度不會像2017年那樣再次發生，直到它突破40K、50K或更多"
    }
  ],
  "title": "Bitcoins popularity in the media won't happen again like 2017 until it breaks 40k, 50k, or more",
  "created_utc": 1609435035,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Bitcoin is just now starting to be mentioned in the main stream news media.  This is a good thing.  Institutional investment in Bitcoin is passingly interesting. Bitcoin surpassing it&#39;s previous ATH is a bullet point.  Bitcoin doubling its ATH is a headline.  </p>\n\n<p>This is a purely psychological issue, going from 2,000 to 10,000 is news worthy, because there&#39;s such a huge difference in those price points and people can work with those numbers easier in their heads.  Makes for catchy headlines, journalists do their jobs the hype train leaves the station and it rockets to double the price. </p>\n\n<p>However, as numbers grow in size the anchor points become more and more spread out.  So when Bitcoin regained and passed it&#39;s previous ATH this was huge news for people that follow Bitcoin.  But to people who don&#39;t, it barely registers.  Getting to 40k, doubling it&#39;s ATH!  Now that&#39;s newsworthy to the casual observer, that generates headlines, that generates clicks.  Once it breaks 50k then it&#39;s halfway to an order of magnitude change.  100k? You won&#39;t be able to look at any media without seeing Bitcoin everywhere. </p>\n\n<p>The path there whether long or short will be an easy to follow graph for media organizations to display in made for tv graphics.  It&#39;s real meme material.  And when that happens then we see some real major fomo growth rockets to the moon.</p>\n\n<p>TLDR;. Bitcoin is going to the moon, it&#39;s not news til it&#39;s halfway there, or at least twice as far as it&#39;s been before.</p>\n</div><!-- SC_ON -->",
  "score": 182,
  "permalink": "/r/Bitcoin/comments/knhvrs/bitcoins_popularity_in_the_media_wont_happen/",
  "subreddit": "Bitcoin",
  "id": "knhvrs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610100739497
}