{
  "author": "Small_Cattle5295",
  "original_created_utc": 1634918584,
  "title": "Looking for testers for habits introducing app, try to build your habits",
  "created_utc": 1634924745,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey guys!</p>\n\n<p>Who strives to read more or wants to build the &quot;reading habit&quot;?</p>\n\n<p>We&#39;ve launched an app Practiqa that helps you to integrate new habits and I want to offer you to try it out and build your habit for free :)</p>\n\n<p>Practiqa is based on behavioral science, it works like a habit coach who helps you to build your habits consistently to achieve your long-term goals.</p>\n\n<p>If you are interested, please, leave a comment below and I&#39;ll share a link for the app with you!</p>\n</div><!-- SC_ON -->",
  "score": 5,
  "permalink": "/r/SideProject/comments/qdk2kx/looking_for_testers_for_habits_introducing_app/",
  "subreddit": "SideProject",
  "id": "qdk2kx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hey guys!\n\nWho strives to read more or wants to build the \"reading habit\"?\n\nWe've launched an app Practiqa that helps you to integrate new habits and I want\nto offer you to try it out and build your habit for free :)\n\nPractiqa is based on behavioral science, it works like a habit coach who helps\nyou…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。\n\nもっと読みたいと努力している人や、「読書の習慣」を身につけたいと思っている人はいませんか？\n\n私たちは、新しい習慣を身につけるためのアプリ「Practiqa」を発表しました。\nこのアプリを無料で試してみませんか？)\n\nPractiqaは行動科学に基づいていて、あなたを助ける習慣コーチのように機能します。\nしてくれる習慣コーチのように機能します...",
      "title": "習慣を紹介するアプリのテスターを募集、習慣づくりに挑戦"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嘿，伙计们!\n\n谁努力多读书或想培养 \"阅读习惯\"？\n\n我们已经推出了一个应用程序Practiqa，它可以帮助你整合新的习惯，我想要\n我想为您提供免费试用并培养您的习惯 :)\n\nPractiqa是基于行为科学的，它的工作方式就像一个习惯教练，帮助你\n你...",
      "title": "为介绍习惯的应用程序寻找测试人员，尝试建立自己的习惯"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嘿，夥計們!\n\n誰努力多讀書或想培養 \"閱讀習慣\"？\n\n我們已經推出了一個應用程序Practiqa，它可以幫助你整合新的習慣，我想要\n我想爲您提供免費試用並培養您的習慣 :)\n\nPractiqa是基於行爲科學的，它的工作方式就像一個習慣教練，幫助你\n你...",
      "title": "爲介紹習慣的應用程序尋找測試人員，嘗試建立自己的習慣"
    }
  ]
}