{
  "author": "SkinGetterUnderer",
  "original_created_utc": 1653595516,
  "title": "How come people catch so much crap when they say they hate both political parties?",
  "created_utc": 1653621014,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Why can’t I hate both? Both options suck. How is that my fault or problem? Make better political parties, I don’t know what to tell ya.&lt;/p&gt;\n\n&lt;p&gt;Also mental midgets will come in saying “you’re just right wing because if you hate both parties you’re actually just right wing.” It’s like, oh gee wiz that’s convenient for you if you’re on the left huh? Seems peculiar to me…&lt;/p&gt;\n\n&lt;p&gt;But yeah I really hate both parties for different reasons. Sorry, but it’s the consequence of living here in America where both parties blow.&lt;/p&gt;\n\n&lt;p&gt;Edit: crap I forgot about the “pfff what are you crazy? That doesn’t even happen” line. Caught me by surprise but it’s a popular one.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 172,
  "permalink": "/r/TooAfraidToAsk/comments/uyg8im/how_come_people_catch_so_much_crap_when_they_say/",
  "subreddit": "TooAfraidToAsk",
  "id": "uyg8im",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Why can’t I hate both? Both options suck. How is that my fault or problem? Make\nbetter political parties, I don’t know what to tell ya.\n\nAlso mental midgets will come in saying “you’re just right wing because if you\nhate both parties you’re actually just right wing.” It’s like, oh gee wiz…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "なぜ両方嫌いになってはいけないのか？どちらの選択肢も最悪です。どうしてそれが私のせいや問題なんだ？もっといい政党を作れ\nもっといい政党を作れ、なんて言うんだろう。\n\nまた、小人が「お前はただの右翼だ、だって両方の政党が嫌いならただの右翼だ」と言いに来るだろう。\n両党が嫌いならただの右翼だ \"と言ってくる。まるで、ああ、ジーウィズ...。",
      "title": "両政党が嫌いって言うとなんでこんなに釣られるんだ？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "为什么我不能两个都讨厌？两个选项都很糟糕。这怎么是我的错或问题呢？让\n更好的政党，我不知道该怎么告诉你。\n\n还有精神上的侏儒会说：\"你只是右翼，因为如果你\n因为如果你讨厌两个政党，你实际上只是右翼。\" 这就像，哦，天哪，Wiz...",
      "title": "当人们说他们讨厌两个政党时，怎么会抓到这么多废话？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "爲什麼我不能兩個都討厭？兩個選項都很糟糕。這怎麼是我的錯或問題呢？讓\n更好的政黨，我不知道該怎麼告訴你。\n\n還有精神上的侏儒會說：\"你只是右翼，因爲如果你\n因爲如果你討厭兩個政黨，你實際上只是右翼。\" 這就像，哦，天哪，Wiz...",
      "title": "當人們說他們討厭兩個政黨時，怎麼會抓到這麼多廢話？"
    }
  ]
}