{
  "author": "throwaway29801A",
  "original_created_utc": 1629786615,
  "title": "Update-Sold my condo for bitcoin",
  "created_utc": 1629844231,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is not a bitcoin hype file. 10 things I&#39;ve learned. Hopefully they can help you.</p>\n\n<ol>\n<li>Time is not on your side. As you get older, you will see friends deny this. I&#39;m 38. Get a plan. As fast as possible. If not, you wake up 50, in a small apartment, and say where did life go. If you are 50 in this situation, let&#39;s go and turn things around.</li>\n<li>You have more opportunities than you can imagine. It is your choice on whether you want to pursue them.</li>\n<li>Don&#39;t use money you need to pay bills on investments and don&#39;t used borrowed funds. These create very stressful situations.</li>\n<li>If you want to go for it, go for it. But actually go for it. Live like a poor person if you&#39;re the salesperson of the month. Embrace the pain. Put off rewards for 2 years.</li>\n<li>Most of our wages will go down over the next 5 years. Jobs are being replaced by computers at a massive clip...so your wages will go down in real value.</li>\n<li>Most ngmi-I&#39;ve realized most people go with the flow. They get on the river of life and hope there are no rocks.</li>\n<li>My typical friend makes $15k a month, has no kids, and 8/10 have no bitcoin.</li>\n<li>If you blow the next 5 years, it&#39;s on you.</li>\n<li>Don&#39;t tell your boss how much btc you have. Be very careful about who knows what.</li>\n<li>Be humble and attempt to be a decent person.</li>\n</ol>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/Bitcoin/comments/pahtu9/updatesold_my_condo_for_bitcoin/",
  "subreddit": "Bitcoin",
  "id": "pahtu9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is not a bitcoin hype file. 10 things I've learned. Hopefully they can help\nyou.\n\n 1.  Time is not on your side. As you get older, you will see friends deny this.\n     I'm 38. Get a plan. As fast as possible. If not, you wake up 50, in a small\n     apartment, and say where did life go. If you…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは、ビットコインのハイプファイルではありません。私が学んだ10のこと。あなたのお役に立てれば幸いです。\n役に立てればと思います。\n\n 1.  時間はあなたの味方ではありません。年を重ねるごとに、友人がこのことを否定するのを目にするようになります。\n     私は38歳です。計画を立てよう。出来るだけ早く。そうしないと、50歳で目が覚めたとき、小さなアパートで\n     人生はどこへ行ってしまったのだろうと思うでしょう。もしあなたが...",
      "title": "更新-ビットコインのために私のコンドミニアムを売却しました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这不是一个比特币的炒作文件。我学到的10件事。希望它们能帮助\n你。\n\n 1.  时间不在你这边。随着你年龄的增长，你会看到朋友们否认这一点。\n     我38岁了。得到一个计划。越快越好。如果没有，你在50岁时醒来，在一个小的\n     公寓，并说生活到哪里去了。如果你...",
      "title": "更新--为比特币卖掉我的公寓"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這不是一個比特幣的炒作文件。我學到的10件事。希望它們能幫助\n你。\n\n 1.  時間不在你這邊。隨着你年齡的增長，你會看到朋友們否認這一點。\n     我38歲了。得到一個計劃。越快越好。如果沒有，你在50歲時醒來，在一個小的\n     公寓，並說生活到哪裏去了。如果你...",
      "title": "更新--爲比特幣賣掉我的公寓"
    }
  ]
}