{
  "author": "Socialinfluencing",
  "original_created_utc": 1636917010,
  "title": "The bullish case for Monero.",
  "created_utc": 1636932649,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is probably one of the most controversial projects in this space, also happens to be one of the oldest and most stable, which is rare in crypto. The prevalent false claim against Monero has proven unsuccessful and to not be based in reality.</p>\n\n<p>People will frequently bring up, what do you have to hide? Surely you must be buying illegal stuff if you support Monero. To to those people I wanna ask, why don&#39;t you shower with the doors wide open? Surely if you want some privacy you must be up to something sinister.</p>\n\n<p>Or how about leaving your car and house unlocked, otherwise why else would you be doing that, you&#39;re probably selling drugs or running a meth lab in there, no wonder you wanna lock everything. See how absolutely dumb that sounds?</p>\n\n<p>Monero offers you privacy in arguably the most important part of our everyday lives, your finances. Not only does it do this, it has proven to be uncrackable, so your money is safe and in your hands alone. So don&#39;t listen to the fud, Monero will keep growing, because it&#39;s awesome and represents crypto.</p>\n</div><!-- SC_ON -->",
  "score": 196,
  "permalink": "/r/CryptoCurrency/comments/qtwxsv/the_bullish_case_for_monero/",
  "subreddit": "CryptoCurrency",
  "id": "qtwxsv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is probably one of the most controversial projects in this space, also\nhappens to be one of the oldest and most stable, which is rare in crypto. The\nprevalent false claim against Monero has proven unsuccessful and to not be based\nin reality.\n\nPeople will frequently bring up, what do you have to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは、おそらくこの分野で最も物議を醸すプロジェクトの一つです。\nまた、暗号では珍しく、最も古く、最も安定したプロジェクトの一つでもあります。Moneroに対する\nモネロに対する一般的なデマは成功しておらず、現実に基づいていないことが証明されています。\nていないことが証明されています。\n\n人々は頻繁に、あなたは何をしなければならないのか、という話を持ち出します。",
      "title": "モネロの強気なケース"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这可能是这个空间中最有争议的项目之一，也是最古老、最稳定的项目之一。\n恰好是最古老和最稳定的项目之一，这在加密货币中是罕见的。针对Monero的\n针对Monero的盛行的虚假声明已被证明是不成功的，并且不是基于\n在现实中。\n\n人们会经常提出，你有什么...",
      "title": "Monero的看涨案例。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這可能是這個空間中最有爭議的項目之一，也是最古老、最穩定的項目之一。\n恰好是最古老和最穩定的項目之一，這在加密貨幣中是罕見的。針對Monero的\n針對Monero的盛行的虛假聲明已被證明是不成功的，並且不是基於\n在現實中。\n\n人們會經常提出，你有什麼...",
      "title": "Monero的看漲案例。"
    }
  ]
}