{
  "author": "Separate-Insurance63",
  "original_created_utc": 1629834513,
  "title": "Hacked Accounts are not Coinbase or Bitcoin Fault - Sorry CNBC",
  "created_utc": 1629853586,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>After reading many articles and situations on how individual accounts got hacked - Phone Carriers(Especially! T-Mobile) are at fault for allowing SIM Card Swamps. The fact these phone carriers never caught on to these hackers is unbelievable. Two authentication is used by so many companies, not just Coinbase. If your own phone carrier allows a hackers to take over your phone with 5 min call and gain access to any account - The Phone Carrier is at fault.</p>\n\n<p>We just recently found out hackers had access to over 101 Million users data at T-Mobile Database. We have no idea how long they have had access to the database. For all we know, they have been using this information to gain access to our personal identification(SSN, Address, Photo ID).</p>\n\n<p>You can pray for all the customer service you can imagine but if you can&#39;t get to the source of the problem(Phone Carriers) to handle there flawed system, then improving customer service won&#39;t mean anything. Source of the problem is phone carriers are handing over and allowing access to your phone. It&#39;s not just your coinbase accounts, it&#39;s your gmail, company email where your hold private cooperate information. Some how you all you can say this is just a coinbase problem with customer service? wake up, these hackers just don&#39;t solely have access to your Coinbase account, they have access to everything!</p>\n\n<p>Part that pisses me off is that these articles try to present bitcoin, eth and all crypto as unsafe asset to hold. Cryptocurrency have only showed how flawed cooperate America software security is. There is a huge lawsuit that needs to be settled to all customers of T-Mobile, Sprint and Verizon when it comes to our Data.</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/Bitcoin/comments/paus12/hacked_accounts_are_not_coinbase_or_bitcoin_fault/",
  "subreddit": "Bitcoin",
  "id": "paus12",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "After reading many articles and situations on how individual accounts got hacked\n- Phone Carriers(Especially! T-Mobile) are at fault for allowing SIM Card\nSwamps. The fact these phone carriers never caught on to these hackers is\nunbelievable. Two authentication is used by so many companies, not…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "個人のアカウントがハッキングされたという記事や状況をたくさん読んだ結果\n- 携帯電話会社（特にT-Mobile）がSIMカードの流出を許したことが悪い。\n沼地になっています。電話会社がこれらのハッカーに気づかなかったという事実は\n信じられません。二重認証は多くの企業で使用されていますが、それは...",
      "title": "ハッキングされたアカウントは、CoinbaseやBitcoinの責任ではない - 申し訳ありません CNBC"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在阅读了许多关于个人账户被黑的文章和情况之后\n- 电话运营商（特别是T-Mobile）在允许SIM卡的问题上有错。\n沼泽。这些电话运营商从未抓住这些黑客的事实是\n令人难以置信。许多公司都使用两种认证，而不是...",
      "title": "被黑的账户不是Coinbase或比特币的错--对不起CNBC"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在閱讀了許多關於個人賬戶被黑的文章和情況之後\n- 電話運營商（特別是T-Mobile）在允許SIM卡的問題上有錯。\n沼澤。這些電話運營商從未抓住這些黑客的事實是\n令人難以置信。許多公司都使用兩種認證，而不是...",
      "title": "被黑的賬戶不是Coinbase或比特幣的錯--對不起CNBC"
    }
  ]
}