{
  "author": "Chicky_Nuggy",
  "original_created_utc": 1641730620,
  "title": "Gentle reminder: Pulse X, Pulse Chain, HEX and anything Richard Heart / Richard Schueler shills/owns is a scam.",
  "created_utc": 1641796842,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Crypto HEX Founder is Actually Notorious Criminal ‘Spam King’&lt;/p&gt;\n\n&lt;p&gt;Richard Heart, aka Richard J. Schueler, aka, J. Richard, aka James Hart is linked to a Panama criminal network which included corrupt lawyers and judges.\nHeart also sold anti-aging cures in between roles as Spam King and Bitcoin thought leader.\nRichard Heart, founder of controversial cryptocurrency project HEX (HEX), has been outed as a former internet scammer and ‘Spam King’.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://techtelegraph.co.uk/crypto-hex-founder-is-actually-notorious-criminal-spam-king/\"&gt;https://techtelegraph.co.uk/crypto-hex-founder-is-actually-notorious-criminal-spam-king/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Heart now charades as a thought leader in the cryptocurrency space, but while Satoshi Nakamoto was working on Bitcoin, Heart was hocking anti-ageing remedies.&lt;/p&gt;\n\n&lt;p&gt;The Methuselah Foundation, for which Heart apparently volunteered, is committed to extending the human lifespan and “making 90 the new 50”. The video below shows Heart in between his spells as Spam King and crypto thought leader.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://cryptotraderspro.com/hex-founder-outed-spam-king/\"&gt;link&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;The cryptocurrency’s official website even claims that the asset is “designed for 10,000x returns,” something that even the SEC would say fails their Howey test, which helps investors determine if an investment is too good to be true and may be a scam.\n &lt;a href=\"https://www.newsbtc.com/news/why-this-developer-of-the-controversial-hex-cryptocurrency-accused-of-scam-left/\"&gt;link&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Most recently, a Reddit user pointed out that 800 Ether tokens were withdrawn from the wallet used to store the proceeds from HEX token sale, and 770 Ether were sent to two crypto exchanges - Binance and Bitfinex.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.google.com/amp/s/www.financemagnates.com/cryptocurrency/news/exit-scam-500-eth-from-hex-ico-wallet-liquidated/amp/\"&gt;link &lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;The list goes on and on and on. All of the articles saying it isn&amp;#39;t a scam are clearly paid for, the only SEO ranking against the coin is Reddit, luckily you can&amp;#39;t pay for Reddit rankings. Hex even run a site saying they&amp;#39;re not a scam, lmao imagine if any other coin did this? Massive red flags.&lt;/p&gt;\n\n&lt;p&gt;Edit\nThis post will be brigaded by multiple accounts (one person) check their history before believing their comments.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 304,
  "permalink": "/r/CryptoCurrency/comments/rzqh7o/gentle_reminder_pulse_x_pulse_chain_hex_and/",
  "subreddit": "CryptoCurrency",
  "id": "rzqh7o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Crypto HEX Founder is Actually Notorious Criminal ‘Spam King’\n\nRichard Heart, aka Richard J. Schueler, aka, J. Richard, aka James Hart is\nlinked to a Panama criminal network which included corrupt lawyers and judges.\nHeart also sold anti-aging cures in between roles as Spam King and Bitcoin\nthought…"
}