{
  "author": "klabboy109",
  "the_new_excerpt": "Which is the better investment, owning a home or owning stocks? If you ask most\nAmericans, chances are they prefer the former.\n\nA new study from the Federal Reserve Bank of New York examined consumer\npreferences toward being a homeowner and how their attitudes have changed over\nthe course of the…",
  "original_created_utc": 1618104600,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "家を持つのと、株を持つのと、どちらが良い投資か？多くのアメリカ人に聞いてみると\nアメリカ人に聞いてみると、たぶん前者を好むでしょう。\n\nニューヨーク連邦準備銀行の新しい研究では、消費者の住宅所有に対する嗜好と、その傾向がどのようなものかを調べました。\nニューヨーク連邦準備銀行が行った新しい調査では、消費者の住宅所有者としての好みと、その考え方が過去10年間でどのように変化したかを調べました。\nニューヨーク連邦準備銀行の新しい研究では、消費者の住宅所有者としての嗜好を調査し、その意識がどのように変化したかを調べました。",
      "title": "アメリカ人は、株式市場よりも住宅に投資したほうがよいと考えている - その理由は？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "自有住房和拥有股票，哪个是更好的投资？如果你问大多数\n美国人，他们有可能更喜欢前者。\n\n纽约联邦储备银行的一项新研究考察了消费者的\n他们对成为房主的偏好以及他们的态度在过去几年中发生了怎样的变化。\n过程中...",
      "title": "美国人认为投资住房比投资股市更好--这就是原因。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "自有住房和擁有股票，哪個是更好的投資？如果你問大多數\n美國人，他們有可能更喜歡前者。\n\n紐約聯邦儲備銀行的一項新研究考察了消費者的\n他們對成爲房主的偏好以及他們的態度在過去幾年中發生了怎樣的變化。\n過程中...",
      "title": "美國人認爲投資住房比投資股市更好--這就是原因。"
    }
  ],
  "title": "Americans think it’s better to invest in housing than the stock market — here’s why",
  "created_utc": 1618120299,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Which is the better investment, owning a home or owning stocks? If you ask most Americans, chances are they prefer the former.</p>\n\n<p>A new study from the Federal Reserve Bank of New York examined consumer preferences toward being a homeowner and how their attitudes have changed over the course of the COVID-19 pandemic. Survey participants were asked to rate which was the better investment — a home or financial assets such as a stocks — and what factors contributed to their choice.</p>\n\n<p>The study found that over 90% of respondents preferred owning their primary residence rather than investing in the stock market. A majority of survey-takers also favored the idea of being a landlord to purchasing stocks, with more than 50% of the participating households preferring to own a rental property.</p>\n\n<p>The most common reasons people cited in choosing housing over stocks seemed to be about comfort and stability, rather than seeking a better return. The most commonly-selected responses were that the home was their “desired living environment” and “provides stability” and that house prices were “less volatile.”</p>\n\n<p>Research has shown that residential real-estate has acted as a strong hedge in most bear markets, with the notable exception of the Great Recession. The early days of the pandemic is a prime example: The S&amp;P 500 index SPX, +0.77% lost over 20% in the first quarter, while the Case-Shiller National Home Price Index increased 1.4%. That stock market has, of course, recovered since then.</p>\n\n<p>That said, Americans were more likely to cite higher housing returns in 2021 than in the year prior, likely a reflection of the incredibly fast pace of home price appreciation nationwide.</p>\n\n<p>But people’s attitudes toward the housing market have shifted over the course of the pandemic, the researchers found. “The preference for housing dipped in October 2020 and returned back to the pre-COVID level by February 2021,” the study’s authors noted.</p>\n\n<p>That shift in preferences away from housing wasn’t driven by concerns about home prices. Some Americans expressed more concern about the risk of vacant rental units, while concerns about being able to make mortgage payments may have had an effect on people’s predilection toward homeownership.</p>\n\n<p>People’s inclination toward owning a home may also be a reflection of their gender or education. Women were more likely to prefer housing than men, and non-college graduates opted for homeownership more often than those with college diplomas.</p>\n\n<p><a href=\"https://www.marketwatch.com/story/americans-think-its-better-to-invest-in-housing-than-the-stock-market-heres-why-11617639806?link=sfmw_fb&amp;fbclid=IwAR3kfXYOE_qgl83qHQYTwFU1nuoRerMJGNhSoKyBh96K7X7HA8Ai0T7cgqk_aem_AT0agxhgPsy4Ywv_8ryOTYkvjmGSazlAM4-LeDVbJG7HWF4bOSNx1F10ZNUIBt3OyUqcFGrAIjeYVniYs5Kx0yRIfsHr3onDVEK99eSx7Ra6gELN8_Mq1VQX9rg0PilnZbQ\">https://www.marketwatch.com/story/americans-think-its-better-to-invest-in-housing-than-the-stock-market-heres-why-11617639806?link=sfmw_fb&amp;fbclid=IwAR3kfXYOE_qgl83qHQYTwFU1nuoRerMJGNhSoKyBh96K7X7HA8Ai0T7cgqk_aem_AT0agxhgPsy4Ywv_8ryOTYkvjmGSazlAM4-LeDVbJG7HWF4bOSNx1F10ZNUIBt3OyUqcFGrAIjeYVniYs5Kx0yRIfsHr3onDVEK99eSx7Ra6gELN8_Mq1VQX9rg0PilnZbQ</a></p>\n</div><!-- SC_ON -->",
  "score": 1450,
  "permalink": "/r/investing/comments/mohir3/americans_think_its_better_to_invest_in_housing/",
  "subreddit": "investing",
  "id": "mohir3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566616795
}