{
  "author": "FurFaceMcBeard",
  "the_new_excerpt": "We're down about 50% in our total investments, which I manage completely. This\nmeans we won't be able to buy a car, despite us having another baby in the way\nand just one vehicle. It also means our dreams of being homeowners are on hold.\n\nShe was upset, but she said we shouldn't sell for a loss, and…",
  "original_created_utc": 1621785605,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が完全に管理している総投資額は約50％減少しています。これでは\nこれでは、もう一人子供が生まれて車が一台しかないのに、車が買えなくなってしまいます。\n車は1台しかありません。また、私たちの夢であるマイホームの取得もお預けとなりました。\n\n彼女は動揺していましたが、「損をしてまで売るべきではない」と言っていましたし・・・。",
      "title": "嫁に言った"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们的总投资下降了约50%，我完全管理这些投资。这\n这意味着我们将无法买车，尽管我们还有一个孩子在身旁\n而且只有一辆车。这也意味着我们成为房主的梦想被搁置了。\n\n她很难过，但她说我们不应该亏本出售，而且...",
      "title": "告诉妻子"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們的總投資下降了約50%，我完全管理這些投資。這\n這意味着我們將無法買車，儘管我們還有一個孩子在身旁\n而且只有一輛車。這也意味着我們成爲房主的夢想被擱置了。\n\n她很難過，但她說我們不應該虧本出售，而且...",
      "title": "告訴妻子"
    }
  ],
  "title": "Told the Wife",
  "created_utc": 1621801834,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We&#39;re down about 50% in our total investments, which I manage completely. This means we won&#39;t be able to buy a car, despite us having another baby in the way and just one vehicle. It also means our dreams of being homeowners are on hold.</p>\n\n<p>She was upset, but she said we shouldn&#39;t sell for a loss, and just to keep holding for the next few years and act as if the money doesn&#39;t exist.</p>\n\n<p>I fucked up royally, and she could&#39;ve been much worse. </p>\n\n<p>Hope anyone else in a similar situation makes out okay. </p>\n\n<p>Remember, if you do all the investing, that means you did all the losing. Don&#39;t deny this. </p>\n\n<p>Good luck out there.</p>\n</div><!-- SC_ON -->",
  "score": 8357,
  "permalink": "/r/CryptoCurrency/comments/njanwu/told_the_wife/",
  "subreddit": "CryptoCurrency",
  "id": "njanwu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197385271
}