{
  "author": "joeyarctic",
  "the_new_excerpt": "It is 2021 officially, and its been 1 month since I have started investing. I\ndon't make much by any means, as I work as a Traffic Control Tech, but I have\nbig dreams and big hopes! I hope to be able to contribute $800 a month into the\nstock market. It's going to take a huge chunk of my paychecks,…",
  "original_created_utc": 1609540414,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "现在是2021年，我开始投资已经有1个月了。我\n无论如何我赚不了多少钱，因为我是一名交通管制技术员，但我有\n远大的梦想和远大的希望！我希望每个月能捐800美元到\n股票市场。这要从我的薪水中拿出一大笔钱，…",
      "title": "从22岁开始交易。一个月前。我已经有一段时间了，这是我最开心的事了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "現在是2021年，我開始投資已經有1個月了。我\n無論如何我賺不了多少錢，因爲我是一名交通管制技術員，但我有\n遠大的夢想和遠大的希望！我希望每個月能捐800美元到\n股票市場。這要從我的薪水中拿出一大筆錢，…",
      "title": "從22歲開始交易。一個月前。我已經有一段時間了，這是我最開心的事了。"
    }
  ],
  "title": "Started trading at 22. 1 month ago. Happiest I've been in a while.",
  "created_utc": 1609544722,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It is 2021 officially,  and its been 1 month since I have started investing. I don&#39;t make much by any means, as I work as a Traffic Control Tech, but I have big dreams and big hopes! I hope to be able to contribute $800 a month into the stock market. It&#39;s going to take a huge chunk of my paychecks, but I&#39;ve come to Spend what I don&#39;t save , rather than saving what I don&#39;t spend. I have a little over $1,000 in my trading account right now, and its the most money I&#39;ve ever managed to save up in my life. It&#39;s felt really good, and I am already ready for 2022, being that if I stay on this route,  it&#39;ll be a good year for me! And every year after that :) Happy new years all! And to any of you out there thinking about investing , I say jump in , learn as much as you can, and have fun:)</p>\n\n<p>Edit:\n  OK, so people think I&#39;m claiming a victory lap, and I simply am not. I am just taking a moment in time to reflect on the accomplishment I have made in the last month. I am not saying that this will be positive in every stride , but right now it is positive, and I&#39;d like to simply sit back and enjoy this last months accomplishment today. And maybe next month will be a different story,  but today we celebrate!</p>\n</div><!-- SC_ON -->",
  "score": 1034,
  "permalink": "/r/stocks/comments/kokpqe/started_trading_at_22_1_month_ago_happiest_ive/",
  "subreddit": "stocks",
  "id": "kokpqe",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610100748519
}