{
  "author": "electricp0ww0w",
  "the_new_excerpt": "Forget the balance sheets, the financials , the ceo, the board etc. Before I do\nany of this, I tap the head office address of the company into Google and look\nat it on streetview.\n\nIt might sound simple, but bear with me...\n\nIf you get chance to watch The China Hustle on Netflix, do it. It's about…",
  "original_created_utc": 1614049601,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "忘掉资产负债表、财务状况、首席执行官、董事会等。在我做之前\n任何这些，我在谷歌中点击公司的总部地址，并查看\n在它的街景。\n\n听起来很简单，但请听我说... ...\n\n如果你有机会看Netflix上的《中国喧嚣》，就看吧。它是关于...",
      "title": "当你考虑投资一只股票时，谷歌街景应该是你首先要检查的东西之一。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "忘掉資產負債表、財務狀況、首席執行官、董事會等。在我做之前\n任何這些，我在谷歌中點擊公司的總部地址，並查看\n在它的街景。\n\n聽起來很簡單，但請聽我說... ...\n\n如果你有機會看Netflix上的《中國喧囂》，就看吧。它是關於...",
      "title": "當你考慮投資一隻股票時，谷歌街景應該是你首先要檢查的東西之一。"
    }
  ],
  "title": "Google street view should be one of your first things to check when you think about investing in a stock.",
  "created_utc": 1614054185,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Forget the balance sheets, the financials , the ceo, the board etc. Before I do <em>any</em> of this, I tap the head office address of the company into Google and look at it on streetview.</p>\n\n<p>It might sound simple, but bear with me...</p>\n\n<p>If you get chance to watch The China Hustle on Netflix, do it. It&#39;s about how Chinese companies performed security fraud to get listed on the NYSE/DAQ with nothing but lies about how big, good and profitable they were. Basically, they said they were billion dollar companies. Nobody from the SEC or the US bothered to check and took their word for it.</p>\n\n<p>The documentary spoke to a short seller who uncovered the fraud. The very first alarm bell was when he looked at the road leading up to a paper plant that claimed it was running thousands of tonnes of high quality paper in and out daily. The road leading up to the site was a crappy dirt track road that could no way, take the number of trucks the company said they were running.</p>\n\n<p>Now, they physically went out to check the site, but theres a lot from Google Street View you can learn. I find this more so with chinese companies.</p>\n\n<p>As an example, I looked at a chinese company earlier that had a market cap of around 3 billion. Don&#39;t ask me what, i&#39;ve checked so many today &gt;_&gt;</p>\n\n<p>Anyway, their head office, as listed on their website and SEC filings was nothing more than a shop in a line of other shops. It looked total garbage. I nope&#39;d out straight away. The one thing I learned from the documentary, even more so about Chinese companies, is they present to the SEC/Banks whatever they want, and <em>NOBODY</em> checks it. They are &#39;auditors&#39;, as in they &#39;audit&#39; what is presented. They are not physically checking if a company is trash or not. That&#39;s your job i&#39;m afraid. Nobody will protect you, especially the banks or brokers, because they take your money.</p>\n\n<p>Now, bear in mind this might not be flawless, as companies might have holding adresses or something, but I find most of the time it&#39;s all good.</p>\n\n<p>This just doesnt apply to China. Check Europe or the US. Is the company that is &quot;growing, expanding and breaking out&quot; still running its office out of some fucking ghetto with some cops in the background of streetview clearing up some bodies? Or do they have plush offices in an affluent area which probably cost a small fortune to upkeep. </p>\n\n<p>This is by no means flawless, but if you wanted to buy a house, you&#39;d want to look at it first. Same for a car. You wouldnt just read the stats/dimensions on paper. Why should stonk be any different?</p>\n\n<p>I think streetview is a very under valued tool when it comes to doing some DD and can give you a fairly good impression of if what they present on paper could be mirrored with what they present in real life.</p>\n</div><!-- SC_ON -->",
  "score": 19828,
  "permalink": "/r/stocks/comments/lq7kxd/google_street_view_should_be_one_of_your_first/",
  "subreddit": "stocks",
  "id": "lq7kxd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332886307
}