{
  "author": "Falom",
  "the_new_excerpt": "So I just got engaged to my fiancée, and we went to go get the ring sized at our\nlocal jewelry store.\n\nWhen we got there, as well as looking at the diamond up close and sending the\nring off to be resized, I found a ring I really liked. I ended up buying it for\nmyself, just so that way I could… show…",
  "original_created_utc": 1623625428,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "婚約したばかりの私は、地元の宝石店で指輪のサイズを測りに行きました。\n地元の宝石店に指輪のサイズを測りに行きました。\n\n店に着いて、ダイヤモンドを近くで見て、指輪をサイズ直しに出したのですが\nサイズ直しに出したところ、とても気に入った指輪が見つかりました。結局、自分用に購入しました。\n自分のために買うことにしました。",
      "title": "男性は婚約中に指輪をしてはいけないのですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我刚刚和我的未婚妻订婚，我们去当地的珠宝店给戒指量尺寸。\n当地的珠宝店。\n\n当我们到了那里，在近距离观察钻石的同时，还把戒指送去重修。\n我发现了一个我非常喜欢的戒指。最后我把它买给了\n这样我就可以......展示......",
      "title": "男人在订婚时不应该戴戒指吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我剛剛和我的未婚妻訂婚，我們去當地的珠寶店給戒指量尺寸。\n當地的珠寶店。\n\n當我們到了那裏，在近距離觀察鑽石的同時，還把戒指送去重修。\n我發現了一個我非常喜歡的戒指。最後我把它買給了\n這樣我就可以......展示......",
      "title": "男人在訂婚時不應該戴戒指嗎？"
    }
  ],
  "title": "Are men not supposed to wear rings while engaged?",
  "created_utc": 1623699630,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I just got engaged to my fiancée, and we went to go get the ring sized at our local jewelry store. </p>\n\n<p>When we got there, as well as looking at the diamond up close and sending the ring off to be resized, I found a ring I really liked. I ended up buying it for myself, just so that way I could… show off(?) that I was engaged to others. </p>\n\n<p>Well, we both got our rings and posted them on Facebook for our mutual friends to see. My mom called me a day later and let me know that what I was wearing was actually a wedding ring, and that men weren’t supposed to wear rings before the wedding. I obviously didn’t know that because I know nothing about engagements or weddings. </p>\n\n<p>We both laughed it off and she called it quirky. Now I’m wondering, is it customary for a man to not wear an engagement ring? Not really self-conscious about it, I like the ring and I’m going to continue to wear it, I’m more just wondering for customary sake.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/NoStupidQuestions/comments/nz8hbk/are_men_not_supposed_to_wear_rings_while_engaged/",
  "subreddit": "NoStupidQuestions",
  "id": "nz8hbk",
  "is_self": true,
  "media": null,
  "is_video": false
}