{
  "author": "Adune05",
  "original_created_utc": 1635763014,
  "title": "Why are so many people so angry about \"cultural appropriation\" and why is it so bad?",
  "created_utc": 1635786384,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I guess everyone that hasn&#39;t been living under a rock these past few years has at least heard the term of &quot;cultural appropriation&quot;. People who wear and use things that aren&#39;t from their &quot;own&quot; culture get verbally attacked because of it. </p>\n\n<p>As far as I have understood it popular examples would be non-Japanese people wearing kimonos, people that aren&#39;t black wearing dreadlocks or literal children dressing up as for example native Americans for a costume party. But I have even seen some cases where people claimed that a traditional Mexican dish can only be prepared by a Mexican chef. </p>\n\n<p>Why does anybody care about this? If somebody is happy and comfortable wearing dreads  then let them do it, it doesn&#39;t hurt anybody. If some child wants to play as a brave native American riding through the wast fields why not let them? \nNone of these things oppress anybody and none of it is meant as an expression of power. It is just people seeing things that they like in other cultures and they try to incorporate it into their own lives. I mean is that really such a bad thing? </p>\n\n<p>Did I miss something? I would really appreciate your thoughts about the topic but please keep it civil.</p>\n</div><!-- SC_ON -->",
  "score": 138,
  "permalink": "/r/TooAfraidToAsk/comments/qkb5pm/why_are_so_many_people_so_angry_about_cultural/",
  "subreddit": "TooAfraidToAsk",
  "id": "qkb5pm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I guess everyone that hasn't been living under a rock these past few years has\nat least heard the term of \"cultural appropriation\". People who wear and use\nthings that aren't from their \"own\" culture get verbally attacked because of it.\n\nAs far as I have understood it popular examples would be non…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここ数年、石の下に住んでいない人なら誰でも、少なくとも「C」という言葉を聞いたことがあるだろう。\n文化的流用」という言葉を耳にしたことがあると思います。自分たちの文化ではないものを身につけたり使ったりすると\n自分の文化ではないものを身につけたり使ったりする人は、そのために言葉で攻撃されます。\n\n私が理解した限りでは、一般的な例は、非...",
      "title": "なぜ多くの人が「文化的流用」に怒り、それが悪いことだと思うのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想在过去的几年里，每一个没有生活在岩石下的人都已经\n至少听说过 \"文化盗用 \"这个词。那些穿戴和使用\n的人都会因此而受到言语攻击。\n\n根据我的理解，流行的例子是非...",
      "title": "为什么这么多人对 \"文化挪用 \"如此愤怒，为什么它是如此糟糕？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想在過去的幾年裏，每一個沒有生活在岩石下的人都已經\n至少聽說過 \"文化盜用 \"這個詞。那些穿戴和使用\n的人都會因此而受到言語攻擊。\n\n根據我的理解，流行的例子是非...",
      "title": "爲什麼這麼多人對 \"文化挪用 \"如此憤怒，爲什麼它是如此糟糕？"
    }
  ]
}