{
  "author": "Set1Less",
  "original_created_utc": 1643216347,
  "title": "US Congress: Yet another Omnibus Bill has been introduced in Congress, that contains provisions that seeks to prohibit crypto transactions, damage privacy and constitutional rights. Once again, we have to fight these laws.",
  "created_utc": 1643222603,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;After the Infrastructure bill debacle where anti-crypto laws were introduced in a must pass bill, now a new America COMPETES act has just been filed in Congress. This Bill on the surface seeks to make US more competitive against China. &lt;/p&gt;\n\n&lt;p&gt;But hidden deep in its 2900 pages, this Bill contains provisions that give the Treasury unlimited powers to prohibit and block crypto exchanges. &lt;/p&gt;\n\n&lt;p&gt;Currently, the Treasury cannot take unilateral decisions to block crypto transactions without a formal notice and a public process, and give a 120 day period to challenge any decision. However, under the new Bill, the Treasury can take decisions without any formal process, based solely on its own apprehensions. &lt;/p&gt;\n\n&lt;p&gt;The new bill allows the Treasury headed by Yellen to block transmission of funds if the Treasury deems so. It can quickly order blocking any transaction or exchange without any review process or administrative controls. This gives the Treasury unchecked control over all crypto exchanges and transactions. &lt;/p&gt;\n\n&lt;p&gt;This language was already included in a bill from last year, however there was opposition and it was removed. However yet again this has been sneaked into a must pass bill. The very idea of sneaking in such clauses in 2900 pages of incomprehensible regulations stinks. How are even the legislators going to read any of this? &lt;/p&gt;\n\n&lt;p&gt;The new bill: &lt;a href=\"https://rules.house.gov/sites/democrats.rules.house.gov/files/BILLS-117HR4521RH-RCP117-31.pdf\"&gt;https://rules.house.gov/sites/democrats.rules.house.gov/files/BILLS-117HR4521RH-RCP117-31.pdf&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Coincenter&amp;#39;s legal arguments: &lt;a href=\"https://www.coincenter.org/new-bill-would-hand-treasury-blank-check-to-ban-crypto-at-exchanges/\"&gt;https://www.coincenter.org/new-bill-would-hand-treasury-blank-check-to-ban-crypto-at-exchanges/&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 356,
  "permalink": "/r/CryptoCurrency/comments/sdam8b/us_congress_yet_another_omnibus_bill_has_been/",
  "subreddit": "CryptoCurrency",
  "id": "sdam8b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "After the Infrastructure bill debacle where anti-crypto laws were introduced in\na must pass bill, now a new America COMPETES act has just been filed in\nCongress. This Bill on the surface seeks to make US more competitive against\nChina.\n\nBut hidden deep in its 2900 pages, this Bill contains…"
}