{
  "author": "someoneUnreadable",
  "the_new_excerpt": "NIO Inc. (NIO) is announcing the beginning of construction of NeoPark, a smart\nelectric vehicle industry park it is co-developing with the Hefei\ngovernment, ahead of the Chinese automaker's quarterly earnings release after\nthe close Thursday. \n\nWhat Happened: Work on NeoPark has kicked off, Nio said…",
  "original_created_utc": 1619737398,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "NIO Inc. NIOは、合肥市と共同開発しているスマート電気自動車産業パーク「NeoPark」の建設を開始しました。\n合肥市政府と共同開発しているスマート電気自動車工業団地「NeoPark」の着工を発表しました。\nNIO Inc.は、合肥市政府と共同開発しているスマート電気自動車産業パーク「NeoPark」の建設開始を発表しました。\nを発表しました。 \n\n何が起こったのか。NeoParkの建設が開始されたとNio社が発表しました。",
      "title": "NIOは大きなことに向けて準備を進めている"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "NIO Inc. (NIO)宣布开始建设NeoPark，这是一个智能电动汽车产业园。\n宣布其与合肥市政府共同开发的智能电动汽车产业园区NeoPark开始建设。\n在这家中国汽车制造商周四收盘后发布季度财报之前，宣布NeoPark开始建设。\n周四收盘后，中国汽车制造商将发布季度财报。 \n\n发生了什么。尼欧公司表示，NeoPark的工作已经启动...",
      "title": "NIO正在为大事情做准备"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "NIO Inc. (NIO)宣佈開始建設NeoPark，這是一個智能電動汽車產業園。\n宣佈其與合肥市政府共同開發的智能電動汽車產業園區NeoPark開始建設。\n在這家中國汽車製造商週四收盤後發佈季度財報之前，宣佈NeoPark開始建設。\n週四收盤後，中國汽車製造商將發佈季度財報。 \n\n發生了什麼。尼歐公司表示，NeoPark的工作已經啓動...",
      "title": "NIO正在爲大事情做準備"
    }
  ],
  "title": "NIO is ramping up for big things",
  "created_utc": 1619745506,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>NIO Inc. (NIO) is announcing the beginning of construction of NeoPark, a smart electric vehicle industry park it is co-developing with the Hefei government, ahead of the Chinese automaker&#39;s quarterly earnings release after the close Thursday. </p>\n\n<p>What Happened: Work on NeoPark has kicked off, Nio said in a Thursday press release.\nThe opening ceremony was attended by several officials from Anhui province, where Hefei is located, as well as William Li, Nio&#39;s founder, chairman and CEO.</p>\n\n<p>Nio&#39;s China headquarters are situated in Hefei. The collaboration agreement with the Hefei municipal government for NeoPark was signed in early February.</p>\n\n<p>NeoPark is conceived as a smart EV industry cluster, encompassing R&amp;D of vehicles, core parts and components and autonomous driving. It was envisioned to evolve as a pioneering innovation chain with global competitiveness and a hub for hundreds of key supporting industries and a highly clustered, full-fledged industry chain, the company said.</p>\n\n<p>The 16,950-acre park features three main function areas — smart manufacturing, R&amp;D and living space, and Eco park. NeoPark will likely contribute to peaking carbon emissions and achieving carbon neutrality, according to the company.\nThe park, according to company, will accommodate over 10,000 R&amp;D personnel and 40,000 technical workers. It&#39;s expected to have an annual production capacity of 1 million vehicles and 100 GWh. The annual gross output from the park is expected to reach 500 billion yuan ($77.3 billion).\nWhy It&#39;s Important: Nio has embarked on a broad push to drive volumes as it comes up against fierce competition in a crowded EV market. The company has announced innovation in battery technology, charging infrastructure and services, while also announcing new models.</p>\n\n<p>The company confirmed Wednesday that it is setting up operations in Norway, terming it as the first leg of its international expansion.\nThe investment in Neo Park is also seen as a payback from Nio to the Hefei city, which bailed it out with financial assistance when the company was running out of cash in 2019.</p>\n</div><!-- SC_ON -->",
  "score": 477,
  "permalink": "/r/stocks/comments/n1gpdx/nio_is_ramping_up_for_big_things/",
  "subreddit": "stocks",
  "id": "n1gpdx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380966998
}