{
  "author": "explosively_inert",
  "original_created_utc": 1631979099,
  "title": "Why does the American health care debate fixate so much on how to pay for it instead of why it costs so much?",
  "created_utc": 1631996676,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Health care in the US is ridiculously expensive, but we seem to focus on who we can tax instead of how we can get the costs down.  Why aren&#39;t we looking at how to reduce costs?</p>\n\n<p>Edit to clarify:  The public discourse seems to be centered on developing a tax based, single payer health insurance.  I don&#39;t understand why we aren&#39;t looking for ways to reduce the costs themselves.  Things like transparency of pricing, reducing barriers to entry where able, even controlling the costs of education itself.  If we got the costs to a point where they weren&#39;t so high then single payer may be a more tenable solution, or it may not be needed at all.</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/NoStupidQuestions/comments/pqojmz/why_does_the_american_health_care_debate_fixate/",
  "subreddit": "NoStupidQuestions",
  "id": "pqojmz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Health care in the US is ridiculously expensive, but we seem to focus on who we\ncan tax instead of how we can get the costs down. Why aren't we looking at how\nto reduce costs?\n\nEdit to clarify: The public discourse seems to be centered on developing a tax\nbased, single payer health insurance. I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アメリカの医療費はとんでもなく高いのですが、どうやってコストを下げるかではなく、誰に税金をかけるかに注目しているようです。\nどうやってコストを下げるかではなく、誰に課税するかに焦点を当てているようです。なぜ私たちは、コストを削減する方法に目を向けないのでしょうか？\nコストを削減する方法に目を向けないのでしょうか？\n\n明確にするために編集しました：世論は、税金をベースにした単一支払いの医療保険を開発することに集中しているようです。\n基づいた単一支払いの医療保険の開発に集中しているようです。I...",
      "title": "なぜアメリカの医療費の議論は、「なぜこんなにお金がかかるのか」ではなく、「どうやってお金を払うのか」に集中してしまうのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "美国的医疗保健费用高得离谱，但我们似乎只关注谁能向我们征税，而不是如何降低成本。\n税，而不是如何降低费用。为什么我们不关注如何\n降低成本？\n\n编辑澄清：公众讨论的中心似乎是制定一个以税收为基础的、单一支付方式的卫生保健制度。\n税为基础的单一付费健康保险。I...",
      "title": "为什么美国的医疗保健辩论如此专注于如何支付，而不是为什么花费这么多？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "美國的醫療保健費用高得離譜，但我們似乎只關注誰能向我們徵稅，而不是如何降低成本。\n稅，而不是如何降低費用。爲什麼我們不關注如何\n降低成本？\n\n編輯澄清：公衆討論的中心似乎是制定一個以稅收爲基礎的、單一支付方式的衛生保健制度。\n稅爲基礎的單一付費健康保險。I...",
      "title": "爲什麼美國的醫療保健辯論如此專注於如何支付，而不是爲什麼花費這麼多？"
    }
  ]
}