{
  "author": "Jxntb733",
  "original_created_utc": 1639835551,
  "title": "Don’t give your crypto away to corporations!",
  "created_utc": 1639870382,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Adidas just made 22million in an afternoon from a NFT mint. That’s going to become parasitic faster than you think. There is nothing stopping corporate brands from continuously creating ‘unique’ NFTs, front running and botting the minting, immediately cashing out to fiat, just to repeat that for years while only using DeFi buzzword to drive sales.       &lt;/p&gt;\n\n&lt;p&gt;The entire structure of their businesses is counter to decentralized ideologies - they have profits and share holder driven moves - did everyone forget Nike and Coca-Cola are part of major business groups lobbying Congress to weaken bills that ban imported goods made with forced labor?!       &lt;/p&gt;\n\n&lt;p&gt;If we give corporations that lobby against human rights our crypto, it’s a step backwards towards a better financial future.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/rj7xnn/dont_give_your_crypto_away_to_corporations/",
  "subreddit": "CryptoCurrency",
  "id": "rj7xnn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Adidas just made 22million in an afternoon from a NFT mint. That’s going to\nbecome parasitic faster than you think. There is nothing stopping corporate\nbrands from continuously creating ‘unique’ NFTs, front running and botting the\nminting, immediately cashing out to fiat, just to repeat that for…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アディダスはNFTのミントで午後から2200万円稼いだそうです。これは\n思ったより早く寄生される。企業による\nブランドは、継続的に「ユニークな」NFTを作成し、フロントランニングとボットで\n鋳造し、すぐに不換紙幣に換金し、それを繰り返す...。",
      "title": "暗号を企業に渡してはいけない！？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "阿迪达斯刚刚在一个下午从NFT薄荷糖中赚了2200万。这将会\n这将比你想象的更快成为寄生虫。没有什么能阻止企业\n品牌不断地创造 \"独特的 \"NFT，在前面跑，并在中间作梗。\n铸币，并立即兑现为法定货币，只是为了重复......",
      "title": "不要把你的加密货币交给企业！\"。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "阿迪達斯剛剛在一個下午從NFT薄荷糖中賺了2200萬。這將會\n這將比你想象的更快成爲寄生蟲。沒有什麼能阻止企業\n品牌不斷地創造 \"獨特的 \"NFT，在前面跑，並在中間作梗。\n鑄幣，並立即兌現爲法定貨幣，只是爲了重複......",
      "title": "不要把你的加密貨幣交給企業！\"。"
    }
  ]
}