{
  "author": "solidstate25",
  "original_created_utc": 1634693932,
  "title": "Taking profits scares me",
  "created_utc": 1634718644,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Yeah thats what it is. I want to convert my profits into stablecoins and live off passive income. I have set my price goals realistically related to the amount of money ive invested in, but what scares me the most is to pull out from a coin that could go x5 two weeks later, knowing I could have had x5 more and probably beating myself up because of it.</p>\n\n<p>Has this happened to you and how did you deal with it? Which is the best strategy to take profits in your own opinion?</p>\n\n<p>Sorry english is not my native language.</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/CryptoCurrency/comments/qbq2k4/taking_profits_scares_me/",
  "subreddit": "CryptoCurrency",
  "id": "qbq2k4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Yeah thats what it is. I want to convert my profits into stablecoins and live\noff passive income. I have set my price goals realistically related to the\namount of money ive invested in, but what scares me the most is to pull out from\na coin that could go x5 two weeks later, knowing I could have had…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そうなんですよ。儲けたお金を安定したコインに変えて、パッシブインカムで生活したい。\nパッシブインカムで生活したい。投資した金額に応じて現実的な価格目標を設定しています。\nしかし、一番怖いのは、2週間後に5倍になるかもしれないコインから撤退することです。\n2週間後に5倍になる可能性のあるコインから撤退することです。",
      "title": "利益を出すのが怖い"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "是的，这就是事实。我想把我的利润转化为稳定币，然后靠被动收入生活。\n被动收入。我已经把我的价格目标设定为与我投资的金额相关的现实的价格。\n但最让我害怕的是，从一个两周后可能涨到X5的硬币中抽身。\n我最害怕的是在两周后从一个可能涨到X5的硬币中撤出，因为我知道我本可以有...",
      "title": "获利让我感到害怕"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "是的，這就是事實。我想把我的利潤轉化爲穩定幣，然後靠被動收入生活。\n被動收入。我已經把我的價格目標設定爲與我投資的金額相關的現實的價格。\n但最讓我害怕的是，從一個兩週後可能漲到X5的硬幣中抽身。\n我最害怕的是在兩週後從一個可能漲到X5的硬幣中撤出，因爲我知道我本可以有...",
      "title": "獲利讓我感到害怕"
    }
  ]
}