{
  "author": "d19racing2",
  "original_created_utc": 1659275696,
  "title": "TIL that the Cucuteni-Trypillia Culture based in modern day Ukraine was established a millennium before Sumeria and Egypt and had settlements far larger than either of them. How come they are rarely if ever mentioned as an early civilization?",
  "created_utc": 1659295089,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;They had settlements as large as 46,000 people, practiced agriculture, and even have evidence of developing an early version of the wheel (potter&amp;#39;s wheel) and depictions of wheeled vehicles well before they were invented in the Near East around 3000 BCE.   Yet whenever people talk about &amp;quot;early civilizations,&amp;quot; people bring up Norte Chico from Peru, Ancient China, the Indus River Valley, and the Fertile Crescent, but CT is just considered a culture. One could argue that they were largely destroyed by invading Proto-Indo-Europeans, but the same could be said of the Indus River Valley civilization, who are still considered a civilization. What&amp;#39;s the dividing line here exactly?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 109,
  "permalink": "/r/AskHistorians/comments/wcpakc/til_that_the_cucutenitrypillia_culture_based_in/",
  "subreddit": "AskHistorians",
  "id": "wcpakc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "They had settlements as large as 46,000 people, practiced agriculture, and even\nhave evidence of developing an early version of the wheel (potter's wheel) and\ndepictions of wheeled vehicles well before they were invented in the Near East\naround 3000 BCE. Yet whenever people talk about \"early…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "4万6000人規模の集落を持ち、農耕を行い、さらには\n初期バージョンの車輪（ろくろ）を開発した証拠もあります。\n近東で車輪が発明されるよりずっと前に、車輪のついた乗り物が描かれている。\n紀元前3000年頃だ。しかし、人々は「初期...」という言葉を口にするたびに、そのことを思い出す。",
      "title": "現代のウクライナにあるククテニ・トリピリア文化は、シュメリアやエジプトより数千年も前に成立し、両者よりはるかに大きな集落を持っていたことが分かった。なぜ彼らは初期文明として言及されることがほとんどないのだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "他们有多达46,000人的定居点，从事农业，甚至有证据表明他们发展了一种新的技术。\n有证据表明他们开发了早期版本的轮子（陶器轮）和\n在近东地区发明轮式车辆之前，他们就已经有了关于轮式车辆的描述。\n公元前3000年左右。然而，每当人们谈及 \"早期...",
      "title": "在现代乌克兰的库库特尼-特里皮利亚文化比苏美尔和埃及早一千年建立，其定居点远远大于这两个国家。为什么他们很少作为早期文明被提及呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "他們有多達46,000人的定居點，從事農業，甚至有證據表明他們發展了一種新的技術。\n有證據表明他們開發了早期版本的輪子（陶器輪）和\n在近東地區發明輪式車輛之前，他們就已經有了關於輪式車輛的描述。\n公元前3000年左右。然而，每當人們談及 \"早期...",
      "title": "在現代烏克蘭的庫庫特尼-特里皮利亞文化比蘇美爾和埃及早一千年建立，其定居點遠遠大於這兩個國家。爲什麼他們很少作爲早期文明被提及呢？"
    }
  ]
}