{
  "author": "PowerHausMachine",
  "original_created_utc": 1628303071,
  "title": "Politicians are playing all of you. They want to pass crypto regulations without losing votes and it might work.",
  "created_utc": 1628325703,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Politicians are playing all of you.  They&#39;ve figured out how to pass crypto regulations without a huge blow back from voters and the move is in play as we speak.  How exactly are they able to achieve this?  Through Negotiation Anchoring.</p>\n\n<p>First they slipped in crypto provisions at the last minute into the Infrastructure bill knowing full well that there would be huge resentment from crypto voters. A small panel of bipartisan members introduce an amendment that slightly improves the provisions (Wyden/Lummis/Toomey) but the amendment isn&#39;t quite enough to calm the mob. So they introduce an even worse amendment that scares the living sh*t out of all of you (Portman/Warner) so that all of you anchor your reference point to the first amendment from Wyden/Lummis/Toomey.  Notice how both amendments have members of both party? This is so neither party takes all of the flack and hatred from passing crypto regulations.</p>\n\n<p>NONE of the crypto provisions should be in the infrastructure bill PERIOD until we understand it better. They&#39;ve successfully moved the conversations from we shouldn&#39;t have any regulations to what regulations are acceptable.</p>\n</div><!-- SC_ON -->",
  "score": 266,
  "permalink": "/r/CryptoCurrency/comments/ozku3t/politicians_are_playing_all_of_you_they_want_to/",
  "subreddit": "CryptoCurrency",
  "id": "ozku3t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Politicians are playing all of you. They've figured out how to pass crypto\nregulations without a huge blow back from voters and the move is in play as we\nspeak. How exactly are they able to achieve this? Through Negotiation Anchoring.\n\nFirst they slipped in crypto provisions at the last minute into…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "政治家は皆さんを翻弄しています。彼らは、暗号の規制を通す方法を考え出しました。\n有権者からの大反発を受けずに暗号規制を通す方法を考えていて、その動きは今のところ順調です。\nしています。具体的にはどのようにして実現しているのでしょうか？ネゴシエーション・アンカリングです。\n\nまず、彼らは土壇場で暗号の条項を...",
      "title": "政治家は皆さんを翻弄しています。彼らは票を失うことなく暗号規制を通過させたいと考えており、それはうまくいくかもしれません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "政客们在玩弄你们所有人。他们已经想出了如何通过加密货币\n法规，而不引起选民的巨大反感，而且在我们发言时，此举正在发挥作用。\n讲话。他们到底是如何做到这一点的呢？通过谈判锚定。\n\n首先，他们在最后一刻将加密货币条款塞进了...",
      "title": "政客们在玩弄你们所有人。他们想在不失去选票的情况下通过加密货币法规，而且可能会成功。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "政客們在玩弄你們所有人。他們已經想出瞭如何通過加密貨幣\n法規，而不引起選民的巨大反感，而且在我們發言時，此舉正在發揮作用。\n講話。他們到底是如何做到這一點的呢？通過談判錨定。\n\n首先，他們在最後一刻將加密貨幣條款塞進了...",
      "title": "政客們在玩弄你們所有人。他們想在不失去選票的情況下通過加密貨幣法規，而且可能會成功。"
    }
  ]
}