{
  "author": "rawrtherapybackup",
  "original_created_utc": 1624303391,
  "title": "I've been shorting BTC since $60k and Doge since $0.70c, here is where i think the market is going, where it is and why it fell",
  "created_utc": 1624336318,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Ooof okay lets get started.</p>\n\n<p><strong>My current positions and why the market fell</strong></p>\n\n<p>Call it magic, call it astrology, call it fugazi or call it dumb.</p>\n\n<p>But IMO Technical Analysis has and will always work 100% <strong>IF</strong> you know exactly where to look.</p>\n\n<p>Since, February i have been calling the downfall of Bitcoin while everyone was saying we were going to continue or rise to $100k based off on two very simple indicators</p>\n\n<p>The first is one i have created myself known as the Reverse MACD, where i have essentially built it to let me know when i should SELL as opposed to buy (i wont go into the details of this because this isnt what the post is about)</p>\n\n<p>and the second is the very simple indicator known as the Stochastic which basically shows you overbought or sold momentum.</p>\n\n<p>Essentially what i did was have my eye on the MONTHLY chart of bitcoin.</p>\n\n<p>Ever since the beginning of the year the Rev MACD was showing me HUGE signs of weakening power on the bullish side for BTC, immediate red flag telling me to keep an eye on the price at the range of $60k</p>\n\n<p>it kept its price around that level for some weeks and after realizing that we were not breaking ATHs and bullish momentum on the Rev MACD was weakening and the stochastic was creating clear tops, i decided to pull the trigger back in February and open my short position on Forex</p>\n\n<p>ive been holding since</p>\n\n<p>Doge is basically the same story but i noticed that Elon Musks tweets were highly inefficient in the last couple of weeks/months since bitcoin started falling</p>\n\n<p>after seeing how much the price dropped in recent weeks compared to bitcoins i knew that Doges drop was going to be glorious, of course unless Elon Musk Tweeted.</p>\n\n<p><strong>Where i think the Market is going</strong></p>\n\n<p>Lets keep this very simple, i do think that Bitcoin is HIGHLY likely to retouch 2017 highs of ~$20,000. Im just going to say that right now.</p>\n\n<p>Reason being is, i still think crypto is early and there is no big financial institutional support for bitcoin</p>\n\n<p><strong>People who keep saying &quot;BUT ITS TOO BIG TO DROP,  THERE TOO MUCH INSTITUTIONAL SUPPORT NOW&quot; yall need to stop right now.</strong></p>\n\n<p>Bitcoin is definitely NOT supported in a big way unless i can easily buy a Big Mac at McDonalds or my Coffee at starbucks without it affecting the normality of everyday transactions</p>\n\n<p>essentially what i mean by this is, if starbucks and McDonalds are openly okay with accepting crypto.</p>\n\n<p>So back to my original thought, Bitcoin as of right now has some REALLY nice support around $32,000 but as soon as alts start deterring Bitcoin is going to drop straight to $26,000 and just keep falling from there</p>\n\n<p>BUT rawrtherapy are you telling me that were done for?</p>\n\n<p>Not necessarily, i DO think that in order for Bitcoin to stay in this downtrend that we need to have June and July close bearish for confirmation, if either of these months end up closing bullish then I 100% think that we are rallying back to $60,000+</p>\n\n<p><strong>What about alts rawrtherapy? Will those recover?</strong></p>\n\n<p>I am going to be buying Alts HEAVY as soon as there is any indication on Bitcoin closing bullish on any month going from now on, so far we have been bearish on Bitcoin for two months and June being the critical 3rd month (let me explain why)</p>\n\n<p>Historically Bitcoin only drops in two sets of ways</p>\n\n<p>We either see a 40-50% Correction in 90 days</p>\n\n<p>OR</p>\n\n<p>We see a full Bitcoin correction of 70-80% in 250+ days</p>\n\n<p>There are around 4-5-6 historical drops like this, all being relative to each other on the monthly drops of ATHs down to lows of when bearish momentum was weakening</p>\n\n<p>This is what i am basing my thesis on for Bitcoins current drop.</p>\n\n<p>The importance of June closing bearish is it will be the all tell if BTC will stay bearish and has completed Phase 1 of the bear cycle</p>\n\n<p>Phase 2 is closing the 4th month bearish indicating a FULL bear market that will last another 160+ days</p>\n\n<p>otherwise, if July closes Bullish that is the indication that BTC will no longer be in bear territory and is primed to do a 3x from whatever lows the Phase 1 bear cycle created</p>\n\n<p>Historicall Bitcoins at MINIMUM rallies 3 times dependent on its bear cycle lows.</p>\n\n<p>For example the lowest low weve seen in this Phase 1 Bear Cycle is roughly $30,000 that gives me $90,000 Price Target on an average 200+ days after the low was created</p>\n\n<p>so if we created that low last month on May 15, then expect a 3x from bitcoin from that date + 200+ days</p>\n\n<p><strong>Where we are in the Market right now</strong></p>\n\n<p>I think right now we are at the most crucial price for Bitcoin. June is in theory one of the most important months in this Phase 1 Bear Cycle, we can either stay bearish and close this month on a continued down trend that will then lead to July being the catalyst or we can recover this month (unlikely) by shooting up like crazy and evidently close June bullish (again which i dont think will happen).</p>\n\n<p>Because i am 99% sure that Bitcoin WILL indeed close bearish for the month of June this leaves July as the MOST important month for Bitcoin, which can either start the rally IMO minimum to $90,000 or we can see a much further drop down to $20,000.</p>\n\n<p>July is the most import month for Bitcoin hands down and it is and will be the month catalyst for Bitcoins rise or fall.</p>\n\n<p><strong>TL;DR</strong>: July needs to close bullish for Bitcoin to see $90,000. If July closes bearish then we will see a $20,000 Bitcoin again and expect to be in a bear market for 200+ more days from now.</p>\n\n<p><strong>Note</strong> If July closes bullish on Bitcoin i will start buying heavy into Alts. As i do think with Doge dying that retail money will flow into Alts the correct way instead of just going into one Crypto.</p>\n\n<p><strong>TL;DR 2: Jesus i didnt think this was gonna be an issue but i literally tell you guys what i think is going to happen.</strong></p>\n\n<p><strong>July closes Bearish, $20,000 and under in 250+ days</strong></p>\n\n<p><strong>July closes Bullish, $90,000 in 200 days, roughly from July&#39;s end</strong></p>\n\n<p>Edit; So im not one for self promotion but here&#39;s all the proof, literally in video and dates of upload: <strong><a href=\"https://www.youtube.com/channel/UCfsjoc_1Q9ue1pL0BpehqmQ\">https://www.youtube.com/channel/UCfsjoc_1Q9ue1pL0BpehqmQ</a></strong></p>\n\n<p><strong>For those of you that are interested i will be creating a new post on July 31st updating everyone</strong></p>\n</div><!-- SC_ON -->",
  "score": 357,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/J1XfYQwabJ03VTzG5Ml0WQLeN4Oiotzxl6YLojUn4xM.jpg?auto=webp&s=5e94b3e97859729f4674eeba03b41b3e8dbb830b",
          "width": 900,
          "height": 900
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/J1XfYQwabJ03VTzG5Ml0WQLeN4Oiotzxl6YLojUn4xM.jpg?width=108&crop=smart&auto=webp&s=1d98a7f3ac21ea711138505e4790ccd3f54965ba",
            "width": 108,
            "height": 108
          },
          {
            "url": "https://external-preview.redd.it/J1XfYQwabJ03VTzG5Ml0WQLeN4Oiotzxl6YLojUn4xM.jpg?width=216&crop=smart&auto=webp&s=2b9c064f35085b09f4377f1feec0eec6cb72de2a",
            "width": 216,
            "height": 216
          },
          {
            "url": "https://external-preview.redd.it/J1XfYQwabJ03VTzG5Ml0WQLeN4Oiotzxl6YLojUn4xM.jpg?width=320&crop=smart&auto=webp&s=a31de74cf5722b1f598459025c3b3ca0f8fe6114",
            "width": 320,
            "height": 320
          },
          {
            "url": "https://external-preview.redd.it/J1XfYQwabJ03VTzG5Ml0WQLeN4Oiotzxl6YLojUn4xM.jpg?width=640&crop=smart&auto=webp&s=07598efbc30de8aa760d635e22464844218759fe",
            "width": 640,
            "height": 640
          }
        ],
        "variants": {},
        "id": "9ivG6EFYFuS0qbroOPwr0i_VyLVzRiHTQoqpOQTGC34"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/o5361i/ive_been_shorting_btc_since_60k_and_doge_since/",
  "subreddit": "CryptoCurrency",
  "id": "o5361i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Ooof okay lets get started.\n\nMy current positions and why the market fell\n\nCall it magic, call it astrology, call it fugazi or call it dumb.\n\nBut IMO Technical Analysis has and will always work 100% IF you know exactly\nwhere to look.\n\nSince, February i have been calling the downfall of Bitcoin while…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "では、早速始めましょう。\n\n私の現在のポジションと市場が下落した理由\n\nマジックと呼ばれても、アストロロジーと呼ばれても、フガジと呼ばれても、ダムと呼ばれてもいい。\n\nしかし、IMOのテクニカル分析は、正確にどこを見るべきかを知っていれば、常に100％機能します。\nどこを見ればいいのかを正確に知っていれば、テクニカル分析は常に100％機能します。\n\n2月以降、私はビットコインの下落を訴えてきましたが...",
      "title": "私はBTCを$60kから、Dogeを$0.70cからショートしていますが、市場がどこに向かっているのか、どこにいるのか、そしてなぜ下落したのかを以下に示します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "哦，好吧，让我们开始吧。\n\n我目前的立场和市场下跌的原因\n\n说它是魔术，说它是占星术，说它是Fugazi，或者说它是愚蠢的。\n\n但在我看来，技术分析一直并将一直发挥100%的作用，如果你确切地知道\n看的地方。\n\n自2月份以来，我一直在呼吁比特币的下行，而...",
      "title": "我从6万美元开始做空BTC，从0.7美元开始做空Doge，以下是我认为市场的走向，它的位置和它的下跌原因"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "哦，好吧，讓我們開始吧。\n\n我目前的立場和市場下跌的原因\n\n說它是魔術，說它是占星術，說它是Fugazi，或者說它是愚蠢的。\n\n但在我看來，技術分析一直並將一直髮揮100%的作用，如果你確切地知道\n看的地方。\n\n自2月份以來，我一直在呼籲比特幣的下行，而...",
      "title": "我從6萬美元開始做空BTC，從0.7美元開始做空Doge，以下是我認爲市場的走向，它的位置和它的下跌原因"
    }
  ]
}