{
  "author": "TVLIESIN",
  "original_created_utc": 1637716956,
  "title": "Epiphany I just had after making $30 off of CRO",
  "created_utc": 1637764250,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve been investing here and there over the last 2 years. 5 days ago I put $200 on CRO because they bought the naming rights to the staples center in LA for 700 million. Obviously due to that this seems like they are committed and could be a wise long term investment.</p>\n\n<p>Exhibit B: Chase bank is currently promoting opening a savings account for your newborn babies to help them earn interest. When you read the fine print, they give you .01% back. You can look this up yourself. Say I put $10,000 on a newborns account, in 30 years that $10,000 will earn that baby a grand total of $30, or, lunch at McDonald’s. </p>\n\n<p>In the last 5 days, my $200 investment on CRO has made me exactly $30 as of today. This is the same amount I would have made with a $10k investment with a chase savings account if I waited 30 years.</p>\n\n<p>Now let’s say I put $10k down on CRO instead of the $200 5 days ago. I would have made $1500 in the last 5 days, and I could pull it out at any time. </p>\n\n<p>Obviously I don’t give a crap about a $30 gain in 5 days but I think it’s an extremely valuable insight to the following: fuck Chase bank. Buy crypto.</p>\n</div><!-- SC_ON -->",
  "score": 198,
  "permalink": "/r/CryptoCurrency/comments/r0sq3i/epiphany_i_just_had_after_making_30_off_of_cro/",
  "subreddit": "CryptoCurrency",
  "id": "r0sq3i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’ve been investing here and there over the last 2 years. 5 days ago I put $200\non CRO because they bought the naming rights to the staples center in LA for 700\nmillion. Obviously due to that this seems like they are committed and could be a\nwise long term investment.\n\nExhibit B: Chase bank is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この2年間、あちこちに投資してきました。5日前、CROに200ドルを投資しました。\nCROに200ドルを投資しました。なぜなら、彼らはLAのステイプルズ・センターの命名権を7億ドルで買ったからです。\n億円で購入したからです。明らかに彼らはコミットしているように見えますし、賢明な長期投資になるかもしれません。\n賢明な長期投資となるでしょう。\n\n証拠B。チェース銀行は...",
      "title": "CROで30ドル稼いだ後に感じたエピファニー"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在过去两年中，我一直在这里和那里投资。5天前，我把200美元\n因为他们以7亿美元买下了洛杉矶斯台普斯中心的冠名权。\n亿元。显然，由于这一点，他们似乎致力于此，并可能成为一项明智的长期投资。\n明智的长期投资。\n\n证据B。大通银行是...",
      "title": "从CRO中赚取30美元后，我刚刚顿悟了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在過去兩年中，我一直在這裏和那裏投資。5天前，我把200美元\n因爲他們以7億美元買下了洛杉磯斯臺普斯中心的冠名權。\n億元。顯然，由於這一點，他們似乎致力於此，並可能成爲一項明智的長期投資。\n明智的長期投資。\n\n證據B。大通銀行是...",
      "title": "從CRO中賺取30美元后，我剛剛頓悟了"
    }
  ]
}