{
  "author": "Chicano_Ducky",
  "original_created_utc": 1624620657,
  "title": "Teotihuacan was the most influential and powerful city state of its time, with control over a large trade network. They worshiped a \"spider goddess\" but this goddess doesn't seem to show up in later pantheons after the city was abandoned. Why?",
  "created_utc": 1624657695,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I keep reading about this spider goddess but I keep finding the same question.</p>\n\n<p>If the city state was so influential, how did this goddess disappear and not be inducted into the pantheon of the region? Mesoamerica was very syncretic and adopted gods from many different cultures.</p>\n\n<p>What caused this goddess to be lost to time? if this city state did in fact war with Mayan city states such as the battle of Washaktun, would we not see this goddess spread among the region?</p>\n\n<p>If the people left, surely they would take their god with them?</p>\n\n<p>I also see references spider goddesses to the northern southwest and a spider god to the south, in Peru. Is there a connection between these spider gods as well?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/o7lui3/teotihuacan_was_the_most_influential_and_powerful/",
  "subreddit": "AskHistorians",
  "id": "o7lui3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I keep reading about this spider goddess but I keep finding the same question.\n\nIf the city state was so influential, how did this goddess disappear and not be\ninducted into the pantheon of the region? Mesoamerica was very syncretic and\nadopted gods from many different cultures.\n\nWhat caused this…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はこの蜘蛛の女神について読み続けていますが、同じ疑問を感じています。\n\nもし都市国家がそれほど影響力を持っていたのなら、どうしてこの女神は消えてしまい、その地域のパンテオンに組み込まれなかったのか？\nその地域のパンテオンに組み込まれなかったのか？メソアメリカは非常にシンクレティックであり\n様々な文化から神々を取り入れていました。\n\nその原因は...。",
      "title": "テオティワカンは、当時最も影響力のある強力な都市国家であり、大規模な貿易ネットワークを支配していました。彼らは「蜘蛛の女神」を崇拝していましたが、この女神は都市が放棄された後のパンテオンには現れていないようです。なぜでしょう？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直在读这个蜘蛛女神的故事，但我一直发现同一个问题。\n\n如果城邦的影响力如此之大，那么这位女神是如何消失的，并且没有被纳入该地区的神庙？\n被纳入该地区的万神殿中？中美洲是一个非常融合的地方，它采用了许多不同文化的神。\n采用了许多不同文化中的神。\n\n是什么导致了这种情况？",
      "title": "特奥蒂瓦坎是当时最具影响力和实力的城市国家，控制着一个庞大的贸易网络。他们崇拜一个 \"蜘蛛女神\"，但在城市被遗弃后，这个女神似乎并没有出现在后来的万神殿中。为什么呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直在讀這個蜘蛛女神的故事，但我一直髮現同一個問題。\n\n如果城邦的影響力如此之大，那麼這位女神是如何消失的，並且沒有被納入該地區的神廟？\n被納入該地區的萬神殿中？中美洲是一個非常融合的地方，它採用了許多不同文化的神。\n採用了許多不同文化中的神。\n\n是什麼導致了這種情況？",
      "title": "特奧蒂瓦坎是當時最具影響力和實力的城市國家，控制着一個龐大的貿易網絡。他們崇拜一個 \"蜘蛛女神\"，但在城市被遺棄後，這個女神似乎並沒有出現在後來的萬神殿中。爲什麼呢？"
    }
  ]
}