{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "Hi Winners,\n\nFolks seems to like my [DKNG DD](https://www.reddit.com/r/stocks/comments/ow7dr6/the_bull_case_for_dkng_ahead_of_earnings_on/) so I thought I'd go deeper. Most is info taken from the filing which posted a week ago.\n\nHere are some facts and thoughts on a big stock which filed for IPO in the sports betting data space.\n\n[https://www.barrons.com/articles/michael-jordan-backed-sportradar-to-go-public-51629314994](https://www.barrons.com/articles/michael-jordan-backed-sportradar-to-go-public-51629314994)\n\n**My intention?**\n\nTo be first and provide some original, informed and balanced analysis of    the publicly available information. I will avoid sensational    self-descriptions by SRAD and update the post if there are factual errors.\n\n**Disclaimer**\n\nI am not a financial expert, technical writer actually.\n\nI have a small position in competitor GENI with 150 shares  (and sometimes day trade their price) and will be buying Sportradar stock – likely at least 600 shares to complement my DKNG holdings.\n\n**And a bit of good advice:**\n\nAlways do your own due diligence.\n\n**Valuations and multiples (based on $645m 2021 revenue) as seen** **in a tweet I can't share** **by “Anpanman” due to posting rules.**\n\n* 7bn = 10.85x\n* 8bn (previously quoted predicated valuation) = 12.4x\n* 9bn = 13.95x\n* 10bn (previously quoted predicted valuation) = 15.5\n\nComparison multiples:\n\n* DKNG - 15x (loss making)\n* GENI - 13x (loss making)\n* Kambi - 3.8x (less scalable)\n* Evolution Gaming AB - 30x (casino but comparable company due to player acquisition)\n\n**SRAD Topline Numbers**\n\n[**https://imgur.com/a/meIJjtb**](https://imgur.com/a/meIJjtb) \\- here is a table summary\n\n**Sources used:**\n\n[SRAD SEC Filing](https://sec.report/Document/0001193125-21-249269/#d122309df1.htm)\n\n[Moodys assigns first time B2 ratings to Sportradar ](https://www.moodys.com/research/Moodys-assigns-first-time-B2-ratings-to-Sportradar-outlook-stable--PR_434482)\n\n[Fitch assigns Sportradar first time b - outlook stable](https://www.fitchratings.com/research/corporate-finance/fitch-assigns-sportradar-first-time-b-idr-outlook-stable-14-10-2020)\n\n[https://en.wikipedia.org/wiki/Sportradar](https://en.wikipedia.org/wiki/Sportradar)\n\nREDDIT!\n\n**Background (major, recent news only)**\n\n**Sportradar (SR)**\n\nSportradar was founded in 2001 as Market Monitor AS. In 2015, [Michael Jordan, Mark Cuban and Ted Leonsis invested $44m into Swiss-owned Sportradar. ](https://techcrunch.com/2015/10/27/michael-jordan-mark-cuban-betting-44-million-on-sportradars-data/) At the time, SRAD was relatively unknown but this investment was seen as forward-thinking as [PASPA was repealed](https://www.usatoday.com/story/sports/2018/05/14/supreme-court-sports-betting-paspa-law-new-jersey/440710002/) in May 2018. In July 2018, [CPPIB and TCV invested in SRAD at a valuation of $2.4bn](https://www.cppinvestments.com/public-media/headlines/2018/sportradar-announces-cppib-and-tcv-new-strategic-partners). The following events then played out:\n\n* In July 2020, it was [rumored SRAD was exploring plans to go public](https://www.sportico.com/business/finance/2020/sportradar-going-public-1234609311/)\n* In March 2021, it was rumored SRAD was going to enter a deal with Todd Boehly’s HZON\n* In April 2021, it was announced that [rival Genius Sports (GENI) had won the NFL data rights](https://www.sportico.com/leagues/football/2021/nfl-data-deal-1234626096/) for an alleged $120m per year in cash and stock\n* In June 2021, SRAD reportedly pulled the proposed deal with HZON and went for a traditional IPO\n* In August 2021, it was announced SRAD would go public on the NASDAQ via IPO with valuation unknown\n\n**Underlying Numbers**\n\nSRAD is a solid, already long profitable company easily passing the “[rule of 40](https://www.thesaascfo.com/rule-of-40-saas/)”    adding together profit margin (22%) and CAGR (25%). They are often    compared to competitor GENI, though there are other competitors (Kambi,  Scientific Games, Stats Perform, IMG to name but name but a few).\n\nSRAD's estimated 2021 revenue of $645m more than double competitor GENI’s    $255m, the latter of which was achieved inclusive of very expensive, negative ROI, NFL rights [costing over $120m (cash and stock).](https://www.espn.com/chalk/story/_/id/31180158/genius-sports-tapped-nfl-exclusive-distributor-data-sportsbooks)  When looking at 2020’s revenue numbers of $489m (SRAD) and $150m (GENI), this is a fairer representation of the difference in scale. When compared with DKNG, SRAD’s revenue is just 50% of DKNG’s $1.25bn but the latter will lose $1bn in 2021.\n\n**SRAD Revenue, EBITDA, EBITDA Margin & Net Income**\n\n[**https://imgur.com/a/SI45vle**](https://imgur.com/a/SI45vle)\n\nSRAD’s  numbers tell a story of stability but an increasing profitability    trend, but is it explosive enough? The 2019 vs 2020 small revenue increase could be a concern, though no doubt related to Covid-19 and is offset by the impressive YoY EBITDA gain. The huge increase in 2021 is an encouraging sign for the path to $1bn+ with banked profits.\n\nI am struggling to see any issues with SRAD’s financials but I will update this section if I receive it in the comments. The only question is whether $645m in revenue at a CAGR of 25% with $140m in EBITDA    warrants the valuation of the often quoted $10bn. The rest is solid and  this was the consensus from the public even with HZON looking to invest in SRAD.\n\n**CEO, Board & Share Structure**\n\n[https://www.theofficialboard.com/org-chart/sportradar](https://www.theofficialboard.com/org-chart/sportradar) and filings\n\n* Carsten Koerl – CEO – [founded bwin](https://www.businesscase.at/beispielcase1) and sold it to fund Sportradar\n\nFrom the filing:\n\n***“Carsten Koerl*** *has served as our Founder and Chief Executive Officer since our founding   in  2001. Mr. Koerl also serves as Group Chief Executive Officer of   Sports  Statistics and Information Systems Ltd, a subsidiary of   Sportradar.  Prior to founding Sportradar, Mr. Koerl held a number of   management  positions within the software development and gaming   industry, including  betandwin Interactive Entertainment AG, an online   betting company,  which he founded in 1997. He holds a Master of   Electronic and  Microprocessor Engineering degree from the University   for Applied  Sciences in Konstanz. We believe Mr. Koerl’s experience and   insight, as  well as his deep knowledge of Sportradar, gained through   service as our  Chief Executive Officer, make him well qualified to   serve as a member of  our board of directors.”*\n\nOthers:\n\n* Michael Jordan – Investor, Board (less than 5% majority interest)\n* Mark Cuban – Investor (less than 5% majority interest)\n* Ted Leonsis – Investor, Board – CEO of Monumental Sports (less than 5% majority interest)\n* Jeffery Yabuki – Chairman – Ex-CEO of Fiserv, a $15bn revenue company\n* Deirdre Bigley – Board – Ex-CMO of Bloomberg\n* Mark Walder – Board – CEO of Ringier, a billion dollar media company\n\nWell you can't say there's a lack of experience..\n\n**Sports Rights**\n\nRights are bought to be sold to sportsbooks for revenue. No matter how many    “deals” or so called “moats” a company owns, it is irrelevant if no revenue – or more specifically – no net income is generated.\n\nWe  know SRAD own NBA, NHL, MLB. But are these rights even profitable for SRAD? One statistic I found was “Sportradar achieved 62% MLB media revenue CAGR from 2015 to 2019.”\n\nWe    know GENI own the NFL rights, but having only increased guidance from $190m to $255m including NFL rights monetization and their   acquisitions,  we know they will make a loss on such rights. Before this deal, their  revenue was “only” $190m for 2021, less than a third of SRAD’s. So who  cares?\n\nMy approach  will be to  ignore all press releases and mention of rights unless   there is specific  information about their monetization. Instead, I will   focus on revenue,  EBITDA, margin and net profit/loss. If you are interested in a list  from the filing:\n\n“*Sportradar leads on breadth of events coverage for sports data and odds. We  offer   the largest volume of data in the world across our peers,  leveraging   nearly 20 years of historical sports information. We  collect over 1.2   billion live data points per year from over 600,000  events in 37 sports.   In 2020, we generated 3.7 billion live and  pre-match odds changes   collected 1.9 billion betting tickets and  processed 21 billion odds   changes from betting operators. We have a  strong betting data rights   portfolio, including non-exclusive rights  to the National Basketball   Association (NBA) and the Major League  Baseball (MLB) in the United   States, as well as exclusive rights on a  global basis to the NBA   (excluding the United States and China) and  MLB (excluding the United   States). In addition, we hold exclusive and  worldwide media data rights   for the NBA and MLB (including in the  United States). We also have   exclusive and worldwide betting data  rights to the International Tennis   Federation (ITF), Tennis Australia  (TA) and Formula 1 and non-exclusive   rights to the Deutsche Fußball  Liga (DFL) in most jurisdictions. Tier 1   sports, particularly in the  United States, tend to have official   partnerships with sports data  providers to create new revenue streams.   Official sports rights  partners have advantages in terms of renewals   because of tech  integrations. We are highly diversified across tiers of   customers and  tiers of sports content. We are not dependent on any   single sport data  right.*\n\n*In  addition to sports data, we provide our customers with the largest    sports audiovisual content offering including 200,000 events per year    across tier 1 and other-tier sports leagues. Sportradar provides global    coverage, with strong U.S. market positioning, including rights for    major U.S. sports leagues. Our current portfolio of audiovisual rights    includes MLB, NBA, DFL, Copa del Rey, Asian Football Confederation    (AFC), TA, ITF, Badminton Europe and the Professional Darts Corporation    (PDC).”*\n\n**Clients**\n\nAs above, we should only consider the underlying hidden numbers of such deals. Therefore, I will only mention paying clients.\n\nFrom the filing:\n\n*“We have a large, blue-chip customer base, which consists of 1,612    customers as of December 31, 2020 and partners across more than 120    countries globally, including more than 900 sports betting operator    customers and over 350 media and digital platforms. Our customers    include many of the largest U.S. and global sports betting operators    such as Bet365, Caesars, DraftKings, Entain, FanDuel, Flutter and    William Hill; leading internet and digital companies such as Apple,    Facebook, Google, Twitter and Yahoo Sports; broadcasters and other media    companies such as CBS Sports, ESPN, Fox Sports and NBC Sports; and    league partners such as the NBA and ITF. We have also built a global,    market-leading portfolio of over 150 league, clubs and federations    relationships across 29 sports.”*\n\n**Strategy**\n\nQuotes from the filing:\n\n***“Our Growth Strategy***\n\n*Our vision is to entertain sports fans and bettors globally through    engagement across media, betting, gaming and beyond. We have continually    broadened our product portfolio to better serve our customers and    increase our touchpoints with end users across the sports betting value chain. The more knowledge of the end user that we are able to collect,    the more valuable our insights and platform services become to  leagues,   sports betting companies and media companies. These network  effects  also  enable us to enhance our product portfolio, serving as a  key  element of  our growth strategy.”*\n\n*“We are part of a founder-led organization with a strategy that is focused on innovation and long-term value creation.”*\n\n*“Our product strategy is centered on speed, reliability and scalability to    match the demands of our customers. We use advanced algorithms to   create  scalable, customized insights in real-time with latency   averaging 700  milliseconds (“ms”). We have one of the industry’s   leading cloud native  storage and distribution platforms. We leverage AI   and machine learning  capabilities, based on our rich data lake, to   provide the most accurate  odds. We are innovators at the forefront of revolutionary new  technologies in sports data and analytics including   computer vision,  data visualization, virtual gaming and simulated   reality*.”\n\nSportradar also believes in a profitable open source strategy but paying when the numbers make sense. A clue to this was [given in a leaked NFL letter](https://sportshandle.com/sportradar-genius-nfl-data/):\n\n*(A  single data provider is): “not only harmful to data supply companies like Sportradar, but also to the downstream market (bookmakers and  their   customers) where product choice is being restricted or removed  in  favour of an information monopoly.”* [*https://igamingbusiness.com/seeking-truth-in-the-upcoming-data-battle/*](https://igamingbusiness.com/seeking-truth-in-the-upcoming-data-battle/)\n\nFor now, the revenue for SRAD suggests a multi-layered strategy is best rather than monopolistic deals.\n\n**Risks**\n\nA fairly generic set of risks is mentioned in the filing, but there were some business specific ones mentioned:\n\n* Business Model Risks - *We depend on the success of our strategic relationships with our sports league partners.*\n* *Social responsibility concerns and public opinion regarding responsible gambling, gambling by minors, match-fixing and related matters could    cause the popularity of sports betting to decline*\n* *We are subject to reputational risks related to betting-related match fixing, doping, and other sports integrity threats.*\n\n**Conclusion**\n\nThe  evidence points towards SRAD dominating the space over the next few    years. They have competition but contrary to surface level statements,  their underlying numbers are impressive and a good foundation for even more growth.\n\nBut what I have not answered is whether SRAD is a buy at $7,8,9, or even 10bn. The upside is too big to ignore and we can’t be missing out on another DraftKings (5bn → 20bn).\n\nWhat do ya'll think?",
  "author_fullname": "t2_bhjb6mq7",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "I went deep on a sports betting stock which filed for IPO - SRAD DD",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": "tickerdiscussion",
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_pawrh5",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.84,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 128,
  "total_awards_received": 2,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Company Discussion",
  "can_mod_post": false,
  "score": 128,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1629840513,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi Winners,</p>\n\n<p>Folks seems to like my <a href=\"https://www.reddit.com/r/stocks/comments/ow7dr6/the_bull_case_for_dkng_ahead_of_earnings_on/\">DKNG DD</a> so I thought I&#39;d go deeper. Most is info taken from the filing which posted a week ago.</p>\n\n<p>Here are some facts and thoughts on a big stock which filed for IPO in the sports betting data space.</p>\n\n<p><a href=\"https://www.barrons.com/articles/michael-jordan-backed-sportradar-to-go-public-51629314994\">https://www.barrons.com/articles/michael-jordan-backed-sportradar-to-go-public-51629314994</a></p>\n\n<p><strong>My intention?</strong></p>\n\n<p>To be first and provide some original, informed and balanced analysis of    the publicly available information. I will avoid sensational    self-descriptions by SRAD and update the post if there are factual errors.</p>\n\n<p><strong>Disclaimer</strong></p>\n\n<p>I am not a financial expert, technical writer actually.</p>\n\n<p>I have a small position in competitor GENI with 150 shares  (and sometimes day trade their price) and will be buying Sportradar stock – likely at least 600 shares to complement my DKNG holdings.</p>\n\n<p><strong>And a bit of good advice:</strong></p>\n\n<p>Always do your own due diligence.</p>\n\n<p><strong>Valuations and multiples (based on $645m 2021 revenue) as seen</strong> <strong>in a tweet I can&#39;t share</strong> <strong>by “Anpanman” due to posting rules.</strong></p>\n\n<ul>\n<li>7bn = 10.85x</li>\n<li>8bn (previously quoted predicated valuation) = 12.4x</li>\n<li>9bn = 13.95x</li>\n<li>10bn (previously quoted predicted valuation) = 15.5</li>\n</ul>\n\n<p>Comparison multiples:</p>\n\n<ul>\n<li>DKNG - 15x (loss making)</li>\n<li>GENI - 13x (loss making)</li>\n<li>Kambi - 3.8x (less scalable)</li>\n<li>Evolution Gaming AB - 30x (casino but comparable company due to player acquisition)</li>\n</ul>\n\n<p><strong>SRAD Topline Numbers</strong></p>\n\n<p><a href=\"https://imgur.com/a/meIJjtb\"><strong>https://imgur.com/a/meIJjtb</strong></a> - here is a table summary</p>\n\n<p><strong>Sources used:</strong></p>\n\n<p><a href=\"https://sec.report/Document/0001193125-21-249269/#d122309df1.htm\">SRAD SEC Filing</a></p>\n\n<p><a href=\"https://www.moodys.com/research/Moodys-assigns-first-time-B2-ratings-to-Sportradar-outlook-stable--PR_434482\">Moodys assigns first time B2 ratings to Sportradar </a></p>\n\n<p><a href=\"https://www.fitchratings.com/research/corporate-finance/fitch-assigns-sportradar-first-time-b-idr-outlook-stable-14-10-2020\">Fitch assigns Sportradar first time b - outlook stable</a></p>\n\n<p><a href=\"https://en.wikipedia.org/wiki/Sportradar\">https://en.wikipedia.org/wiki/Sportradar</a></p>\n\n<p>REDDIT!</p>\n\n<p><strong>Background (major, recent news only)</strong></p>\n\n<p><strong>Sportradar (SR)</strong></p>\n\n<p>Sportradar was founded in 2001 as Market Monitor AS. In 2015, <a href=\"https://techcrunch.com/2015/10/27/michael-jordan-mark-cuban-betting-44-million-on-sportradars-data/\">Michael Jordan, Mark Cuban and Ted Leonsis invested $44m into Swiss-owned Sportradar. </a> At the time, SRAD was relatively unknown but this investment was seen as forward-thinking as <a href=\"https://www.usatoday.com/story/sports/2018/05/14/supreme-court-sports-betting-paspa-law-new-jersey/440710002/\">PASPA was repealed</a> in May 2018. In July 2018, <a href=\"https://www.cppinvestments.com/public-media/headlines/2018/sportradar-announces-cppib-and-tcv-new-strategic-partners\">CPPIB and TCV invested in SRAD at a valuation of $2.4bn</a>. The following events then played out:</p>\n\n<ul>\n<li>In July 2020, it was <a href=\"https://www.sportico.com/business/finance/2020/sportradar-going-public-1234609311/\">rumored SRAD was exploring plans to go public</a></li>\n<li>In March 2021, it was rumored SRAD was going to enter a deal with Todd Boehly’s HZON</li>\n<li>In April 2021, it was announced that <a href=\"https://www.sportico.com/leagues/football/2021/nfl-data-deal-1234626096/\">rival Genius Sports (GENI) had won the NFL data rights</a> for an alleged $120m per year in cash and stock</li>\n<li>In June 2021, SRAD reportedly pulled the proposed deal with HZON and went for a traditional IPO</li>\n<li>In August 2021, it was announced SRAD would go public on the NASDAQ via IPO with valuation unknown</li>\n</ul>\n\n<p><strong>Underlying Numbers</strong></p>\n\n<p>SRAD is a solid, already long profitable company easily passing the “<a href=\"https://www.thesaascfo.com/rule-of-40-saas/\">rule of 40</a>”    adding together profit margin (22%) and CAGR (25%). They are often    compared to competitor GENI, though there are other competitors (Kambi,  Scientific Games, Stats Perform, IMG to name but name but a few).</p>\n\n<p>SRAD&#39;s estimated 2021 revenue of $645m more than double competitor GENI’s    $255m, the latter of which was achieved inclusive of very expensive, negative ROI, NFL rights <a href=\"https://www.espn.com/chalk/story/_/id/31180158/genius-sports-tapped-nfl-exclusive-distributor-data-sportsbooks\">costing over $120m (cash and stock).</a>  When looking at 2020’s revenue numbers of $489m (SRAD) and $150m (GENI), this is a fairer representation of the difference in scale. When compared with DKNG, SRAD’s revenue is just 50% of DKNG’s $1.25bn but the latter will lose $1bn in 2021.</p>\n\n<p><strong>SRAD Revenue, EBITDA, EBITDA Margin &amp; Net Income</strong></p>\n\n<p><a href=\"https://imgur.com/a/SI45vle\"><strong>https://imgur.com/a/SI45vle</strong></a></p>\n\n<p>SRAD’s  numbers tell a story of stability but an increasing profitability    trend, but is it explosive enough? The 2019 vs 2020 small revenue increase could be a concern, though no doubt related to Covid-19 and is offset by the impressive YoY EBITDA gain. The huge increase in 2021 is an encouraging sign for the path to $1bn+ with banked profits.</p>\n\n<p>I am struggling to see any issues with SRAD’s financials but I will update this section if I receive it in the comments. The only question is whether $645m in revenue at a CAGR of 25% with $140m in EBITDA    warrants the valuation of the often quoted $10bn. The rest is solid and  this was the consensus from the public even with HZON looking to invest in SRAD.</p>\n\n<p><strong>CEO, Board &amp; Share Structure</strong></p>\n\n<p><a href=\"https://www.theofficialboard.com/org-chart/sportradar\">https://www.theofficialboard.com/org-chart/sportradar</a> and filings</p>\n\n<ul>\n<li>Carsten Koerl – CEO – <a href=\"https://www.businesscase.at/beispielcase1\">founded bwin</a> and sold it to fund Sportradar</li>\n</ul>\n\n<p>From the filing:</p>\n\n<p><strong><em>“Carsten Koerl</em></strong> <em>has served as our Founder and Chief Executive Officer since our founding   in  2001. Mr. Koerl also serves as Group Chief Executive Officer of   Sports  Statistics and Information Systems Ltd, a subsidiary of   Sportradar.  Prior to founding Sportradar, Mr. Koerl held a number of   management  positions within the software development and gaming   industry, including  betandwin Interactive Entertainment AG, an online   betting company,  which he founded in 1997. He holds a Master of   Electronic and  Microprocessor Engineering degree from the University   for Applied  Sciences in Konstanz. We believe Mr. Koerl’s experience and   insight, as  well as his deep knowledge of Sportradar, gained through   service as our  Chief Executive Officer, make him well qualified to   serve as a member of  our board of directors.”</em></p>\n\n<p>Others:</p>\n\n<ul>\n<li>Michael Jordan – Investor, Board (less than 5% majority interest)</li>\n<li>Mark Cuban – Investor (less than 5% majority interest)</li>\n<li>Ted Leonsis – Investor, Board – CEO of Monumental Sports (less than 5% majority interest)</li>\n<li>Jeffery Yabuki – Chairman – Ex-CEO of Fiserv, a $15bn revenue company</li>\n<li>Deirdre Bigley – Board – Ex-CMO of Bloomberg</li>\n<li>Mark Walder – Board – CEO of Ringier, a billion dollar media company</li>\n</ul>\n\n<p>Well you can&#39;t say there&#39;s a lack of experience..</p>\n\n<p><strong>Sports Rights</strong></p>\n\n<p>Rights are bought to be sold to sportsbooks for revenue. No matter how many    “deals” or so called “moats” a company owns, it is irrelevant if no revenue – or more specifically – no net income is generated.</p>\n\n<p>We  know SRAD own NBA, NHL, MLB. But are these rights even profitable for SRAD? One statistic I found was “Sportradar achieved 62% MLB media revenue CAGR from 2015 to 2019.”</p>\n\n<p>We    know GENI own the NFL rights, but having only increased guidance from $190m to $255m including NFL rights monetization and their   acquisitions,  we know they will make a loss on such rights. Before this deal, their  revenue was “only” $190m for 2021, less than a third of SRAD’s. So who  cares?</p>\n\n<p>My approach  will be to  ignore all press releases and mention of rights unless   there is specific  information about their monetization. Instead, I will   focus on revenue,  EBITDA, margin and net profit/loss. If you are interested in a list  from the filing:</p>\n\n<p>“<em>Sportradar leads on breadth of events coverage for sports data and odds. We  offer   the largest volume of data in the world across our peers,  leveraging   nearly 20 years of historical sports information. We  collect over 1.2   billion live data points per year from over 600,000  events in 37 sports.   In 2020, we generated 3.7 billion live and  pre-match odds changes   collected 1.9 billion betting tickets and  processed 21 billion odds   changes from betting operators. We have a  strong betting data rights   portfolio, including non-exclusive rights  to the National Basketball   Association (NBA) and the Major League  Baseball (MLB) in the United   States, as well as exclusive rights on a  global basis to the NBA   (excluding the United States and China) and  MLB (excluding the United   States). In addition, we hold exclusive and  worldwide media data rights   for the NBA and MLB (including in the  United States). We also have   exclusive and worldwide betting data  rights to the International Tennis   Federation (ITF), Tennis Australia  (TA) and Formula 1 and non-exclusive   rights to the Deutsche Fußball  Liga (DFL) in most jurisdictions. Tier 1   sports, particularly in the  United States, tend to have official   partnerships with sports data  providers to create new revenue streams.   Official sports rights  partners have advantages in terms of renewals   because of tech  integrations. We are highly diversified across tiers of   customers and  tiers of sports content. We are not dependent on any   single sport data  right.</em></p>\n\n<p><em>In  addition to sports data, we provide our customers with the largest    sports audiovisual content offering including 200,000 events per year    across tier 1 and other-tier sports leagues. Sportradar provides global    coverage, with strong U.S. market positioning, including rights for    major U.S. sports leagues. Our current portfolio of audiovisual rights    includes MLB, NBA, DFL, Copa del Rey, Asian Football Confederation    (AFC), TA, ITF, Badminton Europe and the Professional Darts Corporation    (PDC).”</em></p>\n\n<p><strong>Clients</strong></p>\n\n<p>As above, we should only consider the underlying hidden numbers of such deals. Therefore, I will only mention paying clients.</p>\n\n<p>From the filing:</p>\n\n<p><em>“We have a large, blue-chip customer base, which consists of 1,612    customers as of December 31, 2020 and partners across more than 120    countries globally, including more than 900 sports betting operator    customers and over 350 media and digital platforms. Our customers    include many of the largest U.S. and global sports betting operators    such as Bet365, Caesars, DraftKings, Entain, FanDuel, Flutter and    William Hill; leading internet and digital companies such as Apple,    Facebook, Google, Twitter and Yahoo Sports; broadcasters and other media    companies such as CBS Sports, ESPN, Fox Sports and NBC Sports; and    league partners such as the NBA and ITF. We have also built a global,    market-leading portfolio of over 150 league, clubs and federations    relationships across 29 sports.”</em></p>\n\n<p><strong>Strategy</strong></p>\n\n<p>Quotes from the filing:</p>\n\n<p><strong><em>“Our Growth Strategy</em></strong></p>\n\n<p><em>Our vision is to entertain sports fans and bettors globally through    engagement across media, betting, gaming and beyond. We have continually    broadened our product portfolio to better serve our customers and    increase our touchpoints with end users across the sports betting value chain. The more knowledge of the end user that we are able to collect,    the more valuable our insights and platform services become to  leagues,   sports betting companies and media companies. These network  effects  also  enable us to enhance our product portfolio, serving as a  key  element of  our growth strategy.”</em></p>\n\n<p><em>“We are part of a founder-led organization with a strategy that is focused on innovation and long-term value creation.”</em></p>\n\n<p><em>“Our product strategy is centered on speed, reliability and scalability to    match the demands of our customers. We use advanced algorithms to   create  scalable, customized insights in real-time with latency   averaging 700  milliseconds (“ms”). We have one of the industry’s   leading cloud native  storage and distribution platforms. We leverage AI   and machine learning  capabilities, based on our rich data lake, to   provide the most accurate  odds. We are innovators at the forefront of revolutionary new  technologies in sports data and analytics including   computer vision,  data visualization, virtual gaming and simulated   reality</em>.”</p>\n\n<p>Sportradar also believes in a profitable open source strategy but paying when the numbers make sense. A clue to this was <a href=\"https://sportshandle.com/sportradar-genius-nfl-data/\">given in a leaked NFL letter</a>:</p>\n\n<p><em>(A  single data provider is): “not only harmful to data supply companies like Sportradar, but also to the downstream market (bookmakers and  their   customers) where product choice is being restricted or removed  in  favour of an information monopoly.”</em> <a href=\"https://igamingbusiness.com/seeking-truth-in-the-upcoming-data-battle/\"><em>https://igamingbusiness.com/seeking-truth-in-the-upcoming-data-battle/</em></a></p>\n\n<p>For now, the revenue for SRAD suggests a multi-layered strategy is best rather than monopolistic deals.</p>\n\n<p><strong>Risks</strong></p>\n\n<p>A fairly generic set of risks is mentioned in the filing, but there were some business specific ones mentioned:</p>\n\n<ul>\n<li>Business Model Risks - <em>We depend on the success of our strategic relationships with our sports league partners.</em></li>\n<li><em>Social responsibility concerns and public opinion regarding responsible gambling, gambling by minors, match-fixing and related matters could    cause the popularity of sports betting to decline</em></li>\n<li><em>We are subject to reputational risks related to betting-related match fixing, doping, and other sports integrity threats.</em></li>\n</ul>\n\n<p><strong>Conclusion</strong></p>\n\n<p>The  evidence points towards SRAD dominating the space over the next few    years. They have competition but contrary to surface level statements,  their underlying numbers are impressive and a good foundation for even more growth.</p>\n\n<p>But what I have not answered is whether SRAD is a buy at $7,8,9, or even 10bn. The upside is too big to ignore and we can’t be missing out on another DraftKings (5bn → 20bn).</p>\n\n<p>What do ya&#39;ll think?</p>\n</div><!-- SC_ON -->",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "612ee368-65e6-11e5-b53f-129e4297eb59",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#f7b84f",
  "id": "pawrh5",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "ResearchandstuffptII",
  "discussion_type": null,
  "num_comments": 16,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/pawrh5/i_went_deep_on_a_sports_betting_stock_which_filed/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/pawrh5/i_went_deep_on_a_sports_betting_stock_which_filed/",
  "subreddit_subscribers": 2996229,
  "created_utc": 1629913773,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1629840513,
  "the_new_excerpt": "Hi Winners,\n\nFolks seems to like my DKNG DD\n[https://www.reddit.com/r/stocks/comments/ow7dr6/the_bull_case_for_dkng_ahead_of_earnings_on/]\nso I thought I'd go deeper. Most is info taken from the filing which posted a\nweek ago.\n\nHere are some facts and thoughts on a big stock which filed for IPO in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは、ウィナーズ。\n\n皆さん、私のDKNG DDを気に入ってくれたようです。\n[https://www.reddit.com/r/stocks/comments/ow7dr6/the_bull_case_for_dkng_ahead_of_earnings_on/]\nそこで、もっと深く掘り下げてみようと思います。ほとんどの情報は、1週間前に投稿されたファイリングから引用されています。\n一週間前に掲載されたファイリングからの情報です。\n\nここでは1週間前にIPOを申請した大型株についての事実と考えを述べています。",
      "title": "IPO申請したスポーツベッティング銘柄を深追いしてみた - SRAD DD"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嗨，赢家。\n\n大家似乎很喜欢我的DKNG DD\n[https://www.reddit.com/r/stocks/comments/ow7dr6/the_bull_case_for_dkng_ahead_of_earnings_on/]\n所以我想我应该更深入地了解一下。大部分信息取自一周前发布的文件。\n一周前发布的信息。\n\n这里有一些事实和想法，是关于一只申请IPO的大股票的。",
      "title": "我深入研究了一只申请IPO的体育博彩股票--SRAD DD"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嗨，贏家。\n\n大家似乎很喜歡我的DKNG DD\n[https://www.reddit.com/r/stocks/comments/ow7dr6/the_bull_case_for_dkng_ahead_of_earnings_on/]\n所以我想我應該更深入地瞭解一下。大部分信息取自一週前發佈的文件。\n一週前發佈的信息。\n\n這裏有一些事實和想法，是關於一隻申請IPO的大股票的。",
      "title": "我深入研究了一隻申請IPO的體育博彩股票--SRAD DD"
    }
  ],
  "source_updated_at": 1630057192846
}