{
  "author": "Myomyw",
  "original_created_utc": 1655605583,
  "title": "Why is the overwhelming crypto sentiment on Reddit so negative outside of crypto subs? Do you think it’s an accurate representation of sentiment in the general population?",
  "created_utc": 1655635442,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Visit any thread about crypto outside of crypto specific subs and its unbelievably negative. Everyone has essentially written it off as something between gambling and a scam, with phrases like “greater fools” echoing from thread to thread. There isn’t even a hint of rhetoric resembling open discourse about the crypto space in the comments.&lt;/p&gt;\n\n&lt;p&gt;I’m wondering how we arrived at such a divisive place, if we should be worried that the rhetoric is becoming overwhelmingly negative and polarized, and if Reddit is analogous main stream sentiment. &lt;/p&gt;\n\n&lt;p&gt;Part of what gives anything value is the belief that it has value. As amazing as the theory and tech side of crypto is, with its potential to revolutionize and disrupt archaic systems, if people simply emotionally decide it’s worthless, then it could become a self fulfilling prophecy of sorts.&lt;/p&gt;\n\n&lt;p&gt;Curious what this community thinks about this.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 343,
  "permalink": "/r/CryptoCurrency/comments/vfl7cr/why_is_the_overwhelming_crypto_sentiment_on/",
  "subreddit": "CryptoCurrency",
  "id": "vfl7cr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Visit any thread about crypto outside of crypto specific subs and its\nunbelievably negative. Everyone has essentially written it off as something\nbetween gambling and a scam, with phrases like “greater fools” echoing from\nthread to thread. There isn’t even a hint of rhetoric resembling open…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号に特化したサブスクリプション以外の暗号に関するスレッドを訪問し、その\n信じられないほど否定的です。誰もが、暗号はギャンブルと詐欺の中間のようなものだと\nギャンブルと詐欺の間のようなもので、「大馬鹿者」といったフレーズがスレッドから響いてきます。\nスレッドからスレッドへ。レトリックのヒントさえありません オープン似ています...",
      "title": "Redditの圧倒的なクリプトセンチメントは、なぜクリプトサブ以外では否定的なのでしょうか？それは一般人の感情を正確に表していると思いますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "访问任何关于加密货币的线程，在加密货币特定的子系统之外，其\n令人难以置信的消极。每个人基本上都把它写成了介于赌博和骗局之间的东西。\n赌博和骗局之间的东西，像 \"更大的傻瓜 \"这样的短语在线程中回荡。\n的短语。甚至没有一丝类似于公开的言辞。",
      "title": "为什么Reddit上压倒性的加密货币情绪在加密货币子系统之外如此消极？你认为这是否准确代表了普通人的情绪？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "訪問任何關於加密貨幣的線程，在加密貨幣特定的子系統之外，其\n令人難以置信的消極。每個人基本上都把它寫成了介於賭博和騙局之間的東西。\n賭博和騙局之間的東西，像 \"更大的傻瓜 \"這樣的短語在線程中迴盪。\n的短語。甚至沒有一絲類似於公開的言辭。",
      "title": "爲什麼Reddit上壓倒性的加密貨幣情緒在加密貨幣子系統之外如此消極？你認爲這是否準確代表了普通人的情緒？"
    }
  ]
}