{
  "author": "Darkvoid_L",
  "the_new_excerpt": "Also, which ones would you say are not essential, but are interesting to have\neasily available?\n\nI personally think that some of the most important information are:\n\nCurrent Price of a position/portfolio - While price might not be important to\nsome long term investors, especially when they use DCA…",
  "original_created_utc": 1611980958,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "另外，你会说哪些不是必需的，但很有趣的是要有\n容易获得？\n\n我个人认为最重要的一些信息是\n\n仓位/组合的当前价格--虽然价格可能并不重要\n一些长期投资者，特别是当他们使用DCA... ...",
      "title": "在您看来，股票投资组合电子表格中不能缺少什么样的信息/数据？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "另外，你會說哪些不是必需的，但很有趣的是要有\n容易獲得？\n\n我個人認爲最重要的一些信息是\n\n倉位/組合的當前價格--雖然價格可能並不重要\n一些長期投資者，特別是當他們使用DCA... ...",
      "title": "在您看來，股票投資組合電子表格中不能缺少什麼樣的信息/數據？"
    }
  ],
  "title": "In your opinion, what kind of information/data cannot be missing from a Stock Portfolio Spreadsheet?",
  "created_utc": 1612038247,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Also, which ones would you say are not essential, but are interesting to have easily available?</p>\n\n<p>I personally think that some of the most important information are:</p>\n\n<p><strong>Current Price of a position/portfolio</strong> - While price might not be important to some long term investors, especially when they use DCA strategies, I think it&#39;s nice to have a readied picture of how much you have available, if for any reason you were forced to liquidate your positions immediately. It could help in choosing which assets to liquidate and/or not liquidate more than you really need.</p>\n\n<p><strong>Acquisition Price (and Average Cost in case of partial sales</strong>) - I think this one is very important for Tax Returns. For investors who only make total sales, when they do, it might be simple, but when you do partial sales you need to keep a close eye on the change in your supply, and how it affecs the weight of the next purchase in the Average Cost. At least where I live, that is how Average Price for Taxes is calculated.</p>\n\n<p><strong>Portfolio Composition</strong> - I believe proper diversification requires you to keep track of your Portfolio composition as the prices change. It also helps to keep the weight of any risky investments in control; without this control you could end up pouring more in an asset, in relation to your total equity, than you think you are; i.e thinking that you are putting 2.5% of your Stock Money into a risky investment when it&#39;s actually 10%, because you did&#39;t keep track of how much you have invested (and that ties into current price of the portfolio)</p>\n\n<p><strong>A tab with details</strong> for all purchases and sales (profit, prices, fees, dates, etc..) so you won&#39;t have to search through your papers for them later on if/when you have to.</p>\n\n<p>Some stuff i find interesting to have:</p>\n\n<p>Yearly Results for the companies you have stocks in, so you can easily check them when the next results come and compare them. Then, have their tickers colored differently so you remember which companies are doing great/well, which ones should be watched more closely/frequently, and which ones you are considering leaving.</p>\n</div><!-- SC_ON -->",
  "score": 78,
  "permalink": "/r/investing/comments/l8dryo/in_your_opinion_what_kind_of_informationdata/",
  "subreddit": "investing",
  "id": "l8dryo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518532619
}