{
  "author": "redditmunchers",
  "original_created_utc": 1626167006,
  "title": "Why are mixed (black and white) people seen as more black than white?",
  "created_utc": 1626197231,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m mixed race (black and white) I have skin that’s as light as most white people though. If I say I’m black, nobody bats an eyelid. If I say I’m white, everyone says “you’re not white!”</p>\n\n<p>People always say I’m black or put me in the category with black people.</p>\n\n<p>However, I’m just as much white as I am black, it’s 50/50. Isn’t this just a form of racism?</p>\n\n<p>Like anything that isn’t 100% pure white can’t be white, but has to be the other race? Seems strange. Why is this?</p>\n\n<p>Even black and mixed people seem to perpetuate this.</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/TooAfraidToAsk/comments/ojbqdo/why_are_mixed_black_and_white_people_seen_as_more/",
  "subreddit": "TooAfraidToAsk",
  "id": "ojbqdo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m mixed race (black and white) I have skin that’s as light as most white\npeople though. If I say I’m black, nobody bats an eyelid. If I say I’m white,\neveryone says “you’re not white!”\n\nPeople always say I’m black or put me in the category with black people.\n\nHowever, I’m just as much white as I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は混血（黒人と白人）で、肌の色は一般の白人と同じくらい明るいです。\n白人と同じくらい明るい肌をしていますが 私が黒人だと言えば、誰もが目を伏せます。もし私が白人だと言えば\n白人と言えば、誰もが「あなたは白人じゃない！」と言います。\n\n私はいつも黒人だと言われたり、黒人と一緒のカテゴリーに入れられたりします。\n\nしかし、私は私と同じように白人で...",
      "title": "なぜ、ミックス（黒人と白人）の人は白人よりも黒く見られるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是混血儿（黑人和白人），我的皮肤和大多数白人一样白。\n不过。如果我说我是黑人，没有人眨一下眼睛。如果我说我是白人。\n每个人都说 \"你不是白人！\"\n\n人们总是说我是黑人，或者把我和黑人归为一类。\n\n然而，我也是白人，就像我一样。",
      "title": "为什么混血（黑人和白人）的人被视为比白人更黑？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是混血兒（黑人和白人），我的皮膚和大多數白人一樣白。\n不過。如果我說我是黑人，沒有人眨一下眼睛。如果我說我是白人。\n每個人都說 \"你不是白人！\"\n\n人們總是說我是黑人，或者把我和黑人歸爲一類。\n\n然而，我也是白人，就像我一樣。",
      "title": "爲什麼混血（黑人和白人）的人被視爲比白人更黑？"
    }
  ]
}