{
  "author": "Thisisgonna",
  "original_created_utc": 1660429934,
  "title": "Is sex all that it’s hyped up to be?",
  "created_utc": 1660443956,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m 21F and a virgin (waiting until I get a bf) and all people at my college ever talk about is SEX! Sex this sex that “I hooked up with him” “we went 10 rounds” I COULD GO ON. Sex and relationships is legit all they talk about it’s like wtf. Plus basically every song and movie or tv show is full of sex references. Now don’t get me wrong, I’m not a prude (I have a very high SEX drive despite being a virgin), but still wtf. Is it really this magical thing cause I feel FOMO (even though I’m waiting by choice)? I live in the USA specifically California and go to a party school if that helps give a reference.\nI NEED TO KNOW I AM FREAKING OUT!! I FEEL LIKE I AM MISSING OUT!!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 130,
  "permalink": "/r/TooAfraidToAsk/comments/wnqhwi/is_sex_all_that_its_hyped_up_to_be/",
  "subreddit": "TooAfraidToAsk",
  "id": "wnqhwi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "I’m 21F and a virgin (waiting until I get a bf) and all people at my college\never talk about is SEX! Sex this sex that “I hooked up with him” “we went 10\nrounds” I COULD GO ON. Sex and relationships is legit all they talk about it’s\nlike wtf. Plus basically every song and movie or tv show is full…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は21Fで童貞（彼氏ができるまで待機）ですが、私の大学ではすべての人が\nはSEXの話ばかり! このセックス、あのセックス、「彼と付き合った」「10ラウンドした」。\nをした\" などなど。セックスと恋愛の話ばかり......もうね。\nwtfのようなもの。さらに、基本的にすべての歌や映画やテレビ番組は、フル...",
      "title": "セックスは謳い文句の通りなのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我21岁，是个处女（等到我有了男朋友），我的大学里所有的人都是这样。\n谈论的都是性! 性这个性那个 \"我和他勾搭上了\"\"我们打了10个回合\"。\n轮\"，我可以继续说下去。性和关系是合法的，他们谈论的都是性。\n就像wtf。另外，基本上每首歌和电影或电视节目都充满了...",
      "title": "性爱是否就是它所宣传的那样？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我21歲，是個處女（等到我有了男朋友），我的大學裏所有的人都是這樣。\n談論的都是性! 性這個性那個 \"我和他勾搭上了\"\"我們打了10個回合\"。\n輪\"，我可以繼續說下去。性和關係是合法的，他們談論的都是性。\n就像wtf。另外，基本上每首歌和電影或電視節目都充滿了...",
      "title": "性愛是否就是它所宣傳的那樣？"
    }
  ]
}