{
  "author": "_martinshkreli_",
  "original_created_utc": 1624612019,
  "title": "I made a post about the scam OpisHub yesterday. The scammers didn't like that and bought downvotes to make my post invisible. So this is an even more detailed post about them.",
  "created_utc": 1624617041,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Yesterday I made <a href=\"https://old.reddit.com/r/CryptoCurrency/comments/o6zy0e/scam_warning_if_you_see_posts_praising_opishub_on/\">a post</a> about OpisHub. It&#39;s still up, but the main point was that they approached me to shill their shitcoin for money and that they are really shady, it has many red flags and very much looks like a scam.</p>\n\n<p>Then one of the scammers (Scammer 2) sent me a message that he didn&#39;t like it, and that I was deleting his comments on my post (lol he has less than 50 comment karma, they just got deleted, of course I didn&#39;t do anything). My post only had like 35 or 50 upvotes at this point and it had already been 2 hours since I posted, the post wouldn&#39;t have become very big - but the scammers decided to buy downvotes, bringing it to below 0 within minutes, <a href=\"https://old.reddit.com/r/CryptoCurrency/comments/o75scd/the_scammers_behind_opishub_didnt_like_the_post_i/h2wxc7e/\">see also here</a>. The mods deleted a post about this that I made yesterday (because it broke another rule, so I understand - but that post is probably also the reason why my original post is above 0 again), so here I go again: these guys are obviously shady, some examples:</p>\n\n<ul>\n<li>one of them (the one that originally approached me, Scammer 1), <a href=\"https://old.reddit.com/r/beermoneyuk/comments/n15mwk/passive_phone_gains_opishub/\">pretended to have just stumbled across the project</a> instead of saying that he was part of the project</li>\n<li>they wanted to pay me (and most likely others) to shill their project</li>\n<li>they <a href=\"https://imgur.com/a/rgw1HsB\">openly told me</a> they would do vote manipulation and upvote my posts about them and then, well, bought downvotes</li>\n</ul>\n\n<p>So even if the coin would not be a total scam - which I really think it is - they are obviously doing shady stuff. I have already listed the obvious red flags that make them look like your average scam coin, here they are again, slightly adapted:</p>\n\n<ul>\n<li>they use your phone&#39;s CPU for mining</li>\n<li>the CPU is used to power scientific research (of course they don&#39;t say what &quot;scientific research&quot; they are talking about anywhere). And I work in science: of course I would rather use the CPU of a few phones than, well, the powerful computers we have, just as much as I would rather ride a few cats that are tied together than a horse</li>\n<li>&quot;each transaction gives a small % to charity&quot;</li>\n<li>they plan to be super eco friendly and plant trees</li>\n<li>&quot;our primary promotional point is that it adds people&#39;s incentive to get  their friends and family on board , therefore we will have a reffer@l scheme in place&quot;, so it&#39;s officially a pyramid scheme</li>\n<li>the token (and app) will launch soon ™</li>\n</ul>\n\n<p>Scammer 1 had also told me they &quot;have received £3.5million pounds in the last week to utilise to get this project off the ground&quot;. If you look at their social media activity etc., it&#39;s all extremely basic and unprofessional (but check out their Twitter, it&#39;s kind of funny - they really try to seem &quot;sciency&quot; but don&#39;t really know anything about science I think. The followers are either also bought or baited by some fake giveaways, very few seem to be normal, non-spammy accounts) - no company with multiple millions funding would present themselves like that. Also look at the <a href=\"https://imgur.com/a/tbq5YZ9\">start of the email</a> they sent me in beautiful red, Scammer 1 didn&#39;t even remove the &quot;initial contact&quot;, which I think is hilarious.</p>\n\n<p>So again, if you see positive posts about this project, it&#39;s either the scammers or people with less morals that they approached. Stay away from them as far as possible, at least don&#39;t give them money, your personal information, or go to their website/ download their app so they can send you viruses.</p>\n</div><!-- SC_ON -->",
  "score": 486,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/yLjZE2g_rPWdcULkBCpicQkQ9l-1yrX6UI9t2Dgn2cg.jpg?auto=webp&s=db1be18977c925d8317fd941706509d3c570906a",
          "width": 368,
          "height": 258
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/yLjZE2g_rPWdcULkBCpicQkQ9l-1yrX6UI9t2Dgn2cg.jpg?width=108&crop=smart&auto=webp&s=f1852a66e9e016b9a06d4b9e87796643d0e85906",
            "width": 108,
            "height": 75
          },
          {
            "url": "https://external-preview.redd.it/yLjZE2g_rPWdcULkBCpicQkQ9l-1yrX6UI9t2Dgn2cg.jpg?width=216&crop=smart&auto=webp&s=d3d4b4c1eade583f05d5b13a1ba7f8a8cb845812",
            "width": 216,
            "height": 151
          },
          {
            "url": "https://external-preview.redd.it/yLjZE2g_rPWdcULkBCpicQkQ9l-1yrX6UI9t2Dgn2cg.jpg?width=320&crop=smart&auto=webp&s=dc3bcc7de8fe1818ede4773eaf6383e9b00f15b9",
            "width": 320,
            "height": 224
          }
        ],
        "variants": {},
        "id": "-3SPJU4rg2kePOy7aTIcONGKhvRTLW3IbisQ6o7QURA"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/o7k0b4/i_made_a_post_about_the_scam_opishub_yesterday/",
  "subreddit": "CryptoCurrency",
  "id": "o7k0b4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Yesterday I made a post\n[https://old.reddit.com/r/CryptoCurrency/comments/o6zy0e/scam_warning_if_you_see_posts_praising_opishub_on/]\nabout OpisHub. It's still up, but the main point was that they approached me to\nshill their shitcoin for money and that they are really shady, it has many red\nflags…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昨日、私はある投稿をしました。\n[https://old.reddit.com/r/CryptoCurrency/comments/o6zy0e/scam_warning_if_you_see_posts_praising_opishub_on/]\nOpisHubについて投稿しました。まだアップされていますが、主な内容は、彼らがお金のために彼らのクソコインを売り込むために私に近づいてきたということです。\n金のために彼らのクソコインを売り込むために私に近づいてきたということと、彼らは本当に怪しくて、多くの赤旗を持っているということです。\nフラグがたくさんあります...",
      "title": "昨日、OpisHubという詐欺についての投稿をしました。詐欺師たちはそれが気に入らなかったようで、私の投稿を見えなくするためにダウンノートを買いました。そのため、これは彼らについてのさらに詳細な投稿です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "昨天我发了一个帖子\n[https://old.reddit.com/r/CryptoCurrency/comments/o6zy0e/scam_warning_if_you_see_posts_praising_opishub_on/]\n关于OpisHub。它仍然在上面，但主要内容是他们找我推销他们的狗屎币来赚钱。\n兜售他们的狗屎币来赚钱，他们真的很阴暗，有很多红色的\n旗帜...",
      "title": "我昨天发了一个关于骗局OpisHub的帖子。骗子们不喜欢这样，他们买了降级票，使我的帖子不可见。因此，这是一个关于他们的更详细的帖子。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "昨天我發了一個帖子\n[https://old.reddit.com/r/CryptoCurrency/comments/o6zy0e/scam_warning_if_you_see_posts_praising_opishub_on/]\n關於OpisHub。它仍然在上面，但主要內容是他們找我推銷他們的狗屎幣來賺錢。\n兜售他們的狗屎幣來賺錢，他們真的很陰暗，有很多紅色的\n旗幟...",
      "title": "我昨天發了一個關於騙局OpisHub的帖子。騙子們不喜歡這樣，他們買了降級票，使我的帖子不可見。因此，這是一個關於他們的更詳細的帖子。"
    }
  ]
}