{
  "author": "BoardfShadowyFigures",
  "the_new_excerpt": "The current theory as to how Uranus tilted is that it was hit by a large object\nthat caused a drastic change in its orientation. This has always puzzled me. I\nwould think that being a large ball of gas, an \"impact\" would be different from\nthat of a solid planet, that there's nothing there to hit and…",
  "original_created_utc": 1617380464,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "目前关于天王星如何倾斜的理论是 它被一个大物体撞到了\n导致其方向发生了巨大的变化。这一点一直让我很疑惑。I\n会认为，作为一个大的气体球，\"冲击 \"将是不同的。\n那是一个坚实的星球，那里没有什么可以打和... ...",
      "title": "天王星倾斜是由撞击引起的理论背后的机制是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "目前關於天王星如何傾斜的理論是 它被一個大物體撞到了\n導致其方向發生了巨大的變化。這一點一直讓我很疑惑。I\n會認爲，作爲一個大的氣體球，\"衝擊 \"將是不同的。\n那是一個堅實的星球，那裏沒有什麼可以打和... ...",
      "title": "天王星傾斜是由撞擊引起的理論背後的機制是什麼？"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "天王星が傾いた原因については、現在のところ、大きな物体が衝突して\n天王星が傾いた原因は、大きな物体が衝突したことにより、天王星の向きが急激に変化したという説が有力です。これにはいつも戸惑いを覚えます。I\n大きなガスの塊である天王星に「衝突」といっても、固体の惑星とは違い、何もないと思っていました。\n衝突するものがないので、固体の惑星とは違うと思うのですが...。",
      "title": "天王星の傾きが衝突によって生じたという説は、どのようなメカニズムなのでしょうか。"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "天王星が傾いた原因については、現在のところ、大きな物体が衝突して\n天王星が傾いた原因は、大きな物体が衝突したことにより、天王星の向きが急激に変化したという説が有力です。これにはいつも戸惑いを覚えます。I\n大きなガスの塊である天王星に「衝突」といっても、固体の惑星とは違い、何もないと思っていました。\n衝突するものがないので、固体の惑星とは違うと思うのですが...。",
      "title": "天王星の傾きが衝突によって生じたという説は、どのようなメカニズムなのでしょうか。"
    }
  ],
  "title": "What is the mechanism behind the theory that Uranus' tilt was caused by an impact?",
  "created_utc": 1617419849,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The current theory as to how Uranus tilted is that it was hit by a large object that caused a drastic change in its orientation.\nThis has always puzzled me. I would think that being a large ball of gas, an &quot;impact&quot; would be different from that of a solid planet, that there&#39;s nothing there to hit and it would simply plunge into a cloud of gas.\nDoes gas at that mass behave differently? Is the impacting object so large that it doesn&#39;t matter what it&#39;s interacting with? Or am I just fundamentally misunderstanding some basic aspect of physics/fluid dynamics?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/askscience/comments/minov8/what_is_the_mechanism_behind_the_theory_that/",
  "subreddit": "askscience",
  "id": "minov8",
  "is_self": true,
  "media": null,
  "is_video": false
}