{
  "author": "Set1Less",
  "original_created_utc": 1628422757,
  "title": "Yellen needs to resign. She is corrupt, collecting millions from the same banks she regulates. And at the forefront of these draconian anti-crypto laws that seek to stifle innovation.",
  "created_utc": 1628440535,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Multiple reports claim that Yellen has been the person pushing the aggressive laws against Crypto, sandwiched in the Infrastructure bill. Because if the laws pass, it will give her the power to regulate the entire crypto industry. Yellen is the person behind White House&#39;s push to favor Sen. Warner&#39;s amendment over others. While the entire crypto community has been publicly tying to educate Senators on these laws, she has been making calls behind closed doors trying to arm twist the Senators into bringing in these draconian regulations. &quot;Shadowy&quot;</p>\n\n<p>As it turns out she has also been getting paid by the banks she is supposed to regulate. And she is brining in regulation that kills decentralised competitors to banks, who have so far enjoyed near monopoly when it comes to controlling people&#39;s finances. </p>\n\n<p>As Treasury Secretary, she is paid by the US Government to regulate banks - a role that requires the highest standards of ethics and moral turpitude. But she has collected $7m from the same banks that she regulates! Including Citi, Citadel Securities etc. How, without impartiality, can she regulate these banks that are paying her millions of dollars in speaking fees? </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/xffdoivz7zf71.jpg?width=952&amp;format=pjpg&amp;auto=webp&amp;s=45e1e13fd61e6313fb748fed2beaa006ccad9d09\">All the payments she received in 2020. All from home, due to lockdown. Collecting millions from the entities she regulates. </a></p>\n\n<p>Imo - public officials paid by the government should not be collecting millions from the same entities they regulate. This is nothing but grift. While it is not per se criminal, because she was doing it when she was not a Govt official, but nevertheless these payments were received between her 2 terms as Treasury Secretary. </p>\n\n<p>The ethical thing for her was to not accept the role of Treasury Secretary in the new Biden Administration, because she was aware she had been paid by the banks she is supposed to regulate. But despite all this, she took up the job. clearly indicating her lack of morals and ethics. </p>\n\n<p>She really needs to STEP DOWN. The crypto community must unite to get such greedy grifters out of public policy for good, if we need to have a fair chance at our decentralised future.</p>\n</div><!-- SC_ON -->",
  "score": 1553,
  "permalink": "/r/CryptoCurrency/comments/p0d4sh/yellen_needs_to_resign_she_is_corrupt_collecting/",
  "subreddit": "CryptoCurrency",
  "id": "p0d4sh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Multiple reports claim that Yellen has been the person pushing the aggressive\nlaws against Crypto, sandwiched in the Infrastructure bill. Because if the laws\npass, it will give her the power to regulate the entire crypto industry. Yellen\nis the person behind White House's push to favor Sen. Warner's…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "複数の報道によると、イエレン氏は、暗号に対する攻撃的な法律を推進している人物であると言われています。\nインフラ法案に挟まれた暗号に対する積極的な法律を推し進めているのはイエレンだと複数の報道が伝えています。なぜなら、この法律が通れば\nこの法律が通れば、彼女は暗号産業全体を規制する権限を持つことになるからです。イエレン\nホワイトハウスがワーナー上院議員の法案を支持した背景には、イエレンの存在がありました。",
      "title": "イエレン氏は辞任しなければならない。彼女は腐敗しており、自分が規制しているのと同じ銀行から何百万ドルも集めています。そして、イノベーションを阻害しようとする強硬な反暗号法の先頭に立っています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "多份报告称，耶伦一直在推动针对加密货币的激进的\n针对加密货币的法律，夹在基础设施法案中。因为如果这些法律\n通过，它将赋予她监管整个加密货币行业的权力。耶伦\n是白宫推动支持华纳参议员的背后人物。",
      "title": "耶伦需要辞职。她很腐败，从她监管的那些银行那里收取数百万美元。而且处于这些试图扼杀创新的严厉的反加密货币法律的最前沿。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "多份報告稱，耶倫一直在推動針對加密貨幣的激進的\n針對加密貨幣的法律，夾在基礎設施法案中。因爲如果這些法律\n通過，它將賦予她監管整個加密貨幣行業的權力。耶倫\n是白宮推動支持華納參議員的背後人物。",
      "title": "耶倫需要辭職。她很腐敗，從她監管的那些銀行那裏收取數百萬美元。而且處於這些試圖扼殺創新的嚴厲的反加密貨幣法律的最前沿。"
    }
  ]
}