{
  "author": "slugslanga",
  "the_new_excerpt": "The man, the legend, the trendsetter and above all the hero in this time of\nstrife, Alex Karp is the peoples hero. I mean look at that hair, look at the\nshoes! His style and grace has captivated virgins and autists internationally as\nnews came that he loves to fuck his wife (only while her bf isn't…",
  "original_created_utc": 1613421954,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "他是男人，是传奇，是潮流的引领者，更是这个时代的英雄。\n纷争，亚历克斯卡普是人民的英雄。我的意思是，看看那头发，看在\n鞋！他的风格和优雅在国际上迷住了处女和自闭症患者，作为\n新闻传来，他喜欢操他的妻子（只有当她的男朋友不... ...",
      "title": "24小时，直到PLTR收入打电话给我得到SIRELLY。数十亿美金的赌注和一个性丑闻的副作用BOB LOOKALIKE与水鞋有所有的筹码在他的角落：*一个风扇的故事*。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "他是男人，是傳奇，是潮流的引領者，更是這個時代的英雄。\n紛爭，亞歷克斯卡普是人民的英雄。我的意思是，看看那頭髮，看在\n鞋！他的風格和優雅在國際上迷住了處女和自閉症患者，作爲\n新聞傳來，他喜歡操他的妻子（只有當她的男朋友不... ...",
      "title": "24小時，直到PLTR收入打電話給我得到SIRELLY。數十億美金的賭注和一個性醜聞的副作用BOB LOOKALIKE與水鞋有所有的籌碼在他的角落：*一個風扇的故事*。"
    }
  ],
  "title": "24 HOURS UNTIL PLTR EARNINGS CALL IM GETTING SQUIRELLY. BILLIONS OF DOLLARS AT STAKE AND A SEX DEVIATE SIDE SHOW BOB LOOKALIKE WITH WATER SHOES HAS ALL THE CHIPS IN HIS CORNER: *A FANFICTION*",
  "created_utc": 1613451572,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The man, the legend, the trendsetter and above all the hero in this time of strife, Alex Karp is the peoples hero.  I mean look at that hair, look at the shoes!  His style and grace has captivated virgins and autists internationally as news came that he loves to fuck his wife (only while her bf isn&#39;t around) non-stop and do Qigong.  This is the man we all aspire to be, every virgin cuck alive is jealous of his existence but, instead of being bitter, they respect him.</p>\n\n<p><a href=\"https://preview.redd.it/c8cxsgevdph61.jpg?width=1100&amp;format=pjpg&amp;auto=webp&amp;s=705244b531507e7c13755816ccf2e74fe8d1eae8\">https://preview.redd.it/c8cxsgevdph61.jpg?width=1100&amp;format=pjpg&amp;auto=webp&amp;s=705244b531507e7c13755816ccf2e74fe8d1eae8</a></p>\n\n<p>This is the new autistic face of North America everyone.  The hair, the water-shoes, all of these things factor into the earnings call coming up.  Ahead is some riveting DD/fan fiction I&#39;ve put together, so take this post as a 2-4-1 deal on brain damage and retina damage while you can.</p>\n\n<p><a href=\"https://preview.redd.it/jtr9wy4ydph61.jpg?width=1465&amp;format=pjpg&amp;auto=webp&amp;s=fb90d42a0c2dfdffedb7731e21f3564a40e4f81e\">https://preview.redd.it/jtr9wy4ydph61.jpg?width=1465&amp;format=pjpg&amp;auto=webp&amp;s=fb90d42a0c2dfdffedb7731e21f3564a40e4f81e</a></p>\n\n<p>Since Karp is seen wearing inexpensive footwear mainly used in aquatic environments, I believe he is indeed a mammal (like you and I) except he is more of a marine species (my guess is seal or otter).  If my speculations are correct, then the leading short position holder of commodities related to water will get involved in this massive war between sea mammals and land mammals.  The man in question (leader of land mammals) is short seller Michael Burry.</p>\n\n<p><a href=\"https://preview.redd.it/916kzp40eph61.jpg?width=620&amp;format=pjpg&amp;auto=webp&amp;s=6739fc49ab2a960fca12b05087419fe8035043a7\">https://preview.redd.it/916kzp40eph61.jpg?width=620&amp;format=pjpg&amp;auto=webp&amp;s=6739fc49ab2a960fca12b05087419fe8035043a7</a></p>\n\n<p>&quot;Even his jacket is waterproof or has gills or whatever.  Who does he think he&#39;s fooling?  This guy is constantly being a cuck and I&#39;ve had about enough of it.&quot;  Burry expressed his feelings about Karp in a interview recently where he also added &quot;His hair resembles tentacles, I&#39;ve seen enough hentai to know the difference between hair follicles and tentacles.  The guy thinks we are all oblivious.&quot;   The interviewer could not get a single word edge wise as Burry continued to bash Karp relentlessly for his business model, hair, choice of footwear and marital status.  Burry continued to call Alex Karp&#39;s wife a whore and bash PLTR&#39;s business model senselessly.  While in between gasps for air, the interviewed shouted the words &quot;WATER SHOES&quot; which in turn, riled Burry up even more.  &quot;Those fucking water shoes, can&#39;t believe he wears those things.  Just wear flippers because your not fooling anyone!&quot;</p>\n\n<p><a href=\"https://preview.redd.it/eu6me6r1eph61.jpg?width=1200&amp;format=pjpg&amp;auto=webp&amp;s=3dfb66a4e6a158b80844f88e2238d35439a69f8c\">https://preview.redd.it/eu6me6r1eph61.jpg?width=1200&amp;format=pjpg&amp;auto=webp&amp;s=3dfb66a4e6a158b80844f88e2238d35439a69f8c</a></p>\n\n<p>&quot;Burry, that fool?  He is not even on my radar.&quot;  Karp mentioned to a radio station recently.  When asked about the beef he began to rant about water preservation.  &quot;The world only has so much water and I&#39;m going to hoard it all.&quot;  He also snapped back at the comments made by Burry about his wife and said &quot;If my wife&#39;s a whore than his wife must have been the benchmark.&quot;  He continued to call Burry&#39;s wife a &quot;foreigner&quot; a slew of racist stereotypes and epithets.  After approximately 9 minutes of slandering Burry&#39;s wife, he ended the interview with: &quot;Land mammals are really the weaker breed after my earnings call Tuesday they realize I am a superpower in this water gang shit.&quot;  He hung up the phone interview on live radio without saying thank you or bye to the radio station, a true legend move.</p>\n\n<p><a href=\"https://preview.redd.it/2yc96gx3eph61.jpg?width=1200&amp;format=pjpg&amp;auto=webp&amp;s=5a62caddc54c79f67057c8ef3af89546732581ee\">https://preview.redd.it/2yc96gx3eph61.jpg?width=1200&amp;format=pjpg&amp;auto=webp&amp;s=5a62caddc54c79f67057c8ef3af89546732581ee</a></p>\n\n<p>I&#39;m not really sure what this all means, but I vote that the shitpost flair should be reinstated.</p>\n</div><!-- SC_ON -->",
  "score": 1535,
  "permalink": "/r/wallstreetbets/comments/lkmpxe/24_hours_until_pltr_earnings_call_im_getting/",
  "subreddit": "wallstreetbets",
  "id": "lkmpxe",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728633161
}