{
  "author": "Fleegalicious",
  "original_created_utc": 1644191489,
  "title": "ALGO over a dollar, ETH over $3,000, BTC nearing $42,000, Fellas, flavoring for our ramen is back on the menu!!!!!",
  "created_utc": 1644198172,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Am I right? Or am I right? Let me just be the first one to say I am SO happy shitposting is back. Have you guys tried sorting by new? Oh my goodness the “technical analysis” I’ve seen is incredible. That leads me to ask,\nis your coin of choice going up? Have you seen the triple double golden shower triangle? Well, the funny numbers only go up so you best spread the word! Be sure to tell everyone that your coin is pumping, will keep pumping, and will never stop pumping. &lt;/p&gt;\n\n&lt;p&gt;Did you take the price chart and take it to art class? If you have doodled and discovered some fun shapes in the chart than you bet your ass it’s &lt;em&gt;technically&lt;/em&gt; analyzed! Just take a crayon, and take a chart, you can try this at home! They’re never wrong!&lt;/p&gt;\n\n&lt;p&gt;This is what I’m asking of you friends, shill me your best technical analysis! Do you know shit about fuck? Are you going to shitpost in the comments, or do you know what you’re talking about?&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;IS THIS FINANCIAL ADVICE?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;This is not financial advice&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;or is it?&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Edit: spelling&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 355,
  "permalink": "/r/CryptoCurrency/comments/smbhkv/algo_over_a_dollar_eth_over_3000_btc_nearing/",
  "subreddit": "CryptoCurrency",
  "id": "smbhkv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Am I right? Or am I right? Let me just be the first one to say I am SO happy\nshitposting is back. Have you guys tried sorting by new? Oh my goodness the\n“technical analysis” I’ve seen is incredible. That leads me to ask, is your coin\nof choice going up? Have you seen the triple double golden shower…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そうだろうか？それとも私が正しいのでしょうか？最初に言っておくが、私はとても幸せだ\nshitpostingが復活しました。新着順は試しましたか？なんということでしょう\n私が見た「テクニカル分析」は信じられないほどです。そこで質問なのですが、あなたのコイン\nを選択し、上昇する？トリプルダブルのゴールデンシャワーを見たか・・・。",
      "title": "ALGOが1ドル超え、ETHが3000ドル超え、BTCが42000ドルに迫る！フェラーズ、うちのラーメンの味付けが復活！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我说的对吗？或者我是对的吗？让我成为第一个说我非常高兴的人\n狗屎贴回来了。你们有没有试过按新分类？哦，我的天啊\n我所看到的 \"技术分析 \"是不可思议的。这让我想问，你选择的硬币是\n的选择在上升吗？你有没有看到三倍的黄金雨...",
      "title": "ALGO超过1美元，ETH超过3,000美元，BTC接近42,000美元，伙计们，我们拉面的调味品又上菜单了!!!!!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我說的對嗎？或者我是對的嗎？讓我成爲第一個說我非常高興的人\n狗屎貼回來了。你們有沒有試過按新分類？哦，我的天啊\n我所看到的 \"技術分析 \"是不可思議的。這讓我想問，你選擇的硬幣是\n的選擇在上升嗎？你有沒有看到三倍的黃金雨...",
      "title": "ALGO超過1美元，ETH超過3,000美元，BTC接近42,000美元，夥計們，我們拉麪的調味品又上菜單了!!!!!"
    }
  ]
}