{
  "author": "DarkStar668",
  "the_new_excerpt": "I gotta say, I see some good shit out there. I see new members trying to\ndiversify their positions and learn about other stocks and other ways to make\nmoney. This is the path my fellow retards. I'm a nobody here, but I have good\nreturns and some good insight. When I came to WSB, multiple people…",
  "original_created_utc": 1612858266,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我得说，我看到一些好东西在那里。我看到新成员试图\n分散自己的仓位，并了解其他股票和其他方式，以使\n钱。这就是我的弱智同伴们的道路。我在这里是个无名小卒，但我有很好的。\n的回报和一些好的见解。当我来到WSB时，多人...",
      "title": "给新交易者的东西(不讨论GME)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我得說，我看到一些好東西在那裏。我看到新成員試圖\n分散自己的倉位，並瞭解其他股票和其他方式，以使\n錢。這就是我的弱智同伴們的道路。我在這裏是個無名小卒，但我有很好的。\n的回報和一些好的見解。當我來到WSB時，多人...",
      "title": "給新交易者的東西(不討論GME)"
    }
  ],
  "title": "Stuff for new traders (No GME Discussion)",
  "created_utc": 1612880657,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I gotta say, I see some good shit out there. I see new members trying to diversify their positions and learn about other stocks and other ways to make money. This is the path my fellow retards. I&#39;m a nobody here, but I have good returns and some good insight. When I came to WSB, multiple people helped me figure out what the fuck I was doing, because I knew jack shit. I care more about my money than yours, but no retard should be left in the dark alone. So let me pass on a couple things. I can&#39;t prove shit to you, so read this or don&#39;t.</p>\n\n<p>I mainly trade options (Calls and Puts), so that is what I will discuss</p>\n\n<p>Generally the most insane gains will come from being in a specific stock and not an ETF or Index. While riskier, this is where you can hit the homeruns. So decide if you want to go for conservative gains or if you want those huge swings. While what I said is true, I am usually against putting everything into a single bet. Anything can go wrong at any time and no play is 100% guaranteed. The goal of this game is to stay alive. You will lose money on a play at some point, because it is inevitable. So never let yourself get wiped out, because you can always build yourself back up. This goes along with one of my other recommendations: always have SOME cash ready to go. You never know when there might be an incredible opportunity and you do not want to get caught with your ass hanging out.</p>\n\n<p>Paper hands and diamond hands are just words. You ultimately decide when you want to sell or hold and how much profit you want to take. One of my favorite strategies is to say, buy an even number of options on a play, sell half at a modest level of gains (like enough to break even or gain a little bit) and then let the rest ride longer. Look guys, on many plays, you either paper hands at some point or diamond hands long enough to see your positions go red. Some people will bail at 40% gains and others might not take anything less than 500%. Just know that chasing endless profits ups the risk factor, so YOU decide when it&#39;s time. Having a target share price for the stock is also a good strategy.</p>\n\n<p>Here&#39;s a couple psychological principles in investing. Studies have found that people tend to hold onto losing positions too long and sell winning positions too early. They let their losers lose and cut off their winners short. Apparently most people hate losing more than they like winning. Think about this before you sell. Stocks can often get hot and run multiple days in a row. Sometimes a stock will have one red day and then keep up going. This is why it&#39;s important to know WHY you got into a position. Trust your DD and stick to the plan. I had ideas for plays where they went red right away and I bailed... only to see them moon. &quot;Diamond Hands&quot; means that you don&#39;t dump your position instantly if it goes down. The hardest thing is knowing if you should cut losses or diamond hands. I&#39;m a retard and we&#39;re in a bull market.. so often times the stock will eventually go up. Your call though.</p>\n\n<p>The market makers and big boys want you to lose. They want your money. I&#39;m not going to dive into the realm of possible illegal activities that they may use, but just point out some simpler tactics they will use. Big money often sees retail as &quot;weak hands&quot; aka Buy High and Sell Low. They know FOMO is strong when a stock is going up big and that fear takes over when a stock divebombs. We&#39;re in a bull market, which means stonks only go up. However, we still have negative days. Stocks sell off sometimes and things can look bad. Generally, the dip is not time to sell, but instead, time to buy. Case and point, we had a pretty big drilling 2 weeks ago. Do you know what the big money did? They bought the fuckin dip and snatched up everything for cheap. We&#39;ve been mooning ever since.</p>\n\n<p>Sometimes shit makes no sense. A company can have blowout earnings, exceed expectations, and the stock will tank. I was holding one stock a little while ago that reported a fantastic earnings and proceeded to drill to the core of the Earth that day. It was total bullshit and I knew it, I trusted my DD. So instead of panic selling, I added to my position. Sure enough, the stock began swinging upwards and hit an all-time high just 2 weeks later. This is why simply gambling can bite you in the ass. It&#39;s easy to get scared and sell when you doubt yourself because you picked a random thing to buy.</p>\n\n<p>Option Expiration Dates matter. Buying a 1 week option is the cheapest and gives the biggest percentage of profits if it goes your way. However, it can often be a noob trap. One bad day or one piece of bad news can kill your entire position. Stocks trade sideways sometimes. Sometimes they don&#39;t do what you think they should do. And sometimes the whole fucking market shits itself for seemingly no reason. So give yourself TIME to work with. Time costs money and hurts profit margins. But it is better to consistently make 50% profit than to hit one play for 300% followed by 10 losers. Look, playing weekly stupidly OTM calls is fun as hell and is a huge rush when it hits. I do at least one or more every week. The key is not loading your entire portfolio into this shit. Remember, no tendies = no more fun.</p>\n\n<p>Along the same lines, Strike Price matters. An OTM (Out of the Money) option means that the Strike Price is a bit of a ways from where the stock&#39;s price currently is. OTM options give huge profit margins the further you go out. I personally enjoy using them.. some people don&#39;t. But my advice is to balance risk with profit potential. If your call relies on a stock gaining 50% in 2 weeks.. then well, it&#39;s probably not gonna happen. ITM (In The Money) options means that your stock is already within the strike price. ITM is a more conservative play and sacrifices massive gains for lower risk.</p>\n\n<p><a href=\"https://www.optionsprofitcalculator.com/calculator/long-call.html\">https://www.optionsprofitcalculator.com/calculator/long-call.html</a> - Use this to get an estimate of potential profits and how much of a move you need</p>\n\n<p>Leaps are fuckin dope. A Leap is a call, but for a much longer period of time. I&#39;m using the term loosely because we&#39;re degenerates and some people might consider anything more than 1 month a leap. Given that the market trends up over time, you might even make some money on a mediocre stock this way. A lot of people buy ITM leaps, but again, I&#39;m a degenerate and go OTM a lot.</p>\n\n<p>Implied Volatility (IV) - Extremely fucking important. IV is basically an estimation of how much a stock is predicted to move in either direction. High IV = Expensive Options. It&#39;s fucking weird to think, but you can make similar profits from a 2% move on a low IV stock as you can from a 5% move on a more volatile stock. Low IV is fantastic when buying an option on a stock that you think is about to moon. High IV is riskier, so you damn well better think the stock can make some big moves. Buying an option on a stock right before Earnings Report (ER) will be more expensive due to IV. Trying to play ER is usually for suckers, unless you have some really good DD about why a company might deliver a huge surprise. One of the textbook big boy moves is to pump a stock going into ER. The company will deliver great news and then dump hard. You may see people bitching about this very soon. Basically, big money knew ahead of time it would be good, so the stock got pumped and then they took profits.</p>\n\n<p>Buy the rumor and sell the news. Events, press releases, and important dates that everyone knows about are another trap. You will get shit on. Ask someone about TESLA Battery Day. Positive rumors will send a stock soaring though.</p>\n\n<p>Finally, get busy learning. Read about Options on Investopedia and any other things you do not understand. The big boys rely on us to not know what the fuck we&#39;re doing to take our money. Learn about the general market. Stocks are grouped into &quot;Sectors&quot; or categories. Start figuring out what they are and pay attention to where the money is going. I didn&#39;t even mention half of the shit that goes on in options, so that&#39;s on you. The first thing you need to do is to learn what the &quot;Greeks&quot; are. That will teach you how options function.</p>\n\n<p><a href=\"https://www.investopedia.com/trading/using-the-greeks-to-understand-options/\">https://www.investopedia.com/trading/using-the-greeks-to-understand-options/</a></p>\n\n<p>If anyone wants to talk or discuss, send me a message. I&#39;m a degenerate with no life.</p>\n\n<p>Oh and, if you follow someone&#39;s DD and lose money that&#39;s on you. I&#39;ve come up with some genius shit, but I&#39;ve also lost on some retarded calls. Nobody can pick you a guaranteed winner and hindsight is 20/20.</p>\n\n<p>May the gains be with you</p>\n</div><!-- SC_ON -->",
  "score": 6871,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/t94mN7YhHQKrN1WJdkvXcZm6JmHei2J8a-icHE0Wz1Q.jpg?auto=webp&s=d95d5f9aecda1a9b92e34139edc3db8c2bc078f6",
          "width": 180,
          "height": 180
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/t94mN7YhHQKrN1WJdkvXcZm6JmHei2J8a-icHE0Wz1Q.jpg?width=108&crop=smart&auto=webp&s=8a95e733dae70fc1172af58ce7605abbbc63af73",
            "width": 108,
            "height": 108
          }
        ],
        "variants": {},
        "id": "VwT9MiRM_IE2J2bffhONCbTSvFfdDj8CgzUJGvR6pts"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/wallstreetbets/comments/lfxux0/stuff_for_new_traders_no_gme_discussion/",
  "subreddit": "wallstreetbets",
  "id": "lfxux0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123217909
}