{
  "author": "SxQuadro",
  "original_created_utc": 1630335376,
  "title": "Isn't it too obvious r/CryptoMoonShots is a scam sub with full of scam coin spams? Why don't reddit take action against them?",
  "created_utc": 1630345053,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I don&#39;t know why reddit doesn&#39;t give a fuck while there are a subreddit with 740k members that full of scam coin spams. Isn&#39;t it too obvious they are scammers? They make a post about their scam coin and their post gets hundreds of awards and thousands of upvotes within few hours. Dude WTF? I mean obviously those al upvotes are form bot accounts or brigading. Isn&#39;t it against reddit&#39;s policy?</p>\n\n<p>If a person is new to reddit and crypto, it&#39;s so easy for them to get scammed by those scammers. It&#39;s sad too see..</p>\n\n<p>I reported that subreddit multiple times but it looks like they don&#39;t give a fuck.</p>\n</div><!-- SC_ON -->",
  "score": 173,
  "permalink": "/r/CryptoCurrency/comments/pejpz9/isnt_it_too_obvious_rcryptomoonshots_is_a_scam/",
  "subreddit": "CryptoCurrency",
  "id": "pejpz9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I don't know why reddit doesn't give a fuck while there are a subreddit with\n740k members that full of scam coin spams. Isn't it too obvious they are\nscammers? They make a post about their scam coin and their post gets hundreds of\nawards and thousands of upvotes within few hours. Dude WTF? I mean…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "740kのメンバーがいるサブレディットがあるのに、なぜredditは気にしないのかわからない。\n740kのメンバーを持つサブレディットがあり、そこには詐欺コインのスパムが溢れています。彼らが詐欺師であることはあまりにも明白ではありませんか？\n詐欺師であることはあまりにも明白ではありませんか？彼らは自分の詐欺コインについての投稿をし、その投稿は何百もの賞を獲得し、何千ものupvoteを獲得します。\n数時間のうちに何百もの賞と何千ものupvoteを獲得しています。Dude WTF? っていうか...。",
      "title": "r/CryptoMoonShotsが詐欺コインのスパムだらけの詐欺サブであることはあまりにも明らかではないでしょうか？なぜredditは彼らに対して行動を起こさないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不知道为什么reddit不给一个他妈的，而有一个子reddit与\n74万名成员，充满了诈骗硬币的垃圾邮件。这不是太明显了吗，他们是\n诈骗者？他们发了一个关于他们的诈骗币的帖子，他们的帖子得到了数以百计的奖项和数以千计的支持。\n他们的帖子在几个小时内就获得了数百个奖项和数千次的支持率。老兄，你说什么？我的意思是...",
      "title": "r/CryptoMoonShots是一个充满诈骗币垃圾邮件的诈骗子，这不是很明显吗？为什么reddit不对他们采取行动？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不知道爲什麼reddit不給一個他媽的，而有一個子reddit與\n74萬名成員，充滿了詐騙硬幣的垃圾郵件。這不是太明顯了嗎，他們是\n詐騙者？他們發了一個關於他們的詐騙幣的帖子，他們的帖子得到了數以百計的獎項和數以千計的支持。\n他們的帖子在幾個小時內就獲得了數百個獎項和數千次的支持率。老兄，你說什麼？我的意思是...",
      "title": "r/CryptoMoonShots是一個充滿詐騙幣垃圾郵件的詐騙子，這不是很明顯嗎？爲什麼reddit不對他們採取行動？"
    }
  ]
}