{
  "author": "lipscarf",
  "the_new_excerpt": "Full disclosure. My position in AGTC is 300 @ 7.65.\n\nWho is AGTC?\n\nAGTC is a Biopharmaceutical company that focuses on gene therapies to treat rare\ninherited genetic conditions. They specialize in treating eye conditions, and\nhave a substantial pipeline with promising results. This pipeline…",
  "original_created_utc": 1614026984,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "全面披露。我在AGTC的仓位是300@7.65。\n\nAGTC是谁？\n\nAGTC是一家生物制药公司，专注于治疗罕见病的基因疗法。\n遗传性疾病。他们专注于治疗眼部疾病，以及。\n有一个实质性的管道，并取得了可喜的成果。这条管道...",
      "title": "AGTC。生物医药玩法，100%的上涨空间! DD"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "全面披露。我在AGTC的倉位是300@7.65。\n\nAGTC是誰？\n\nAGTC是一家生物製藥公司，專注於治療罕見病的基因療法。\n遺傳性疾病。他們專注於治療眼部疾病，以及。\n有一個實質性的管道，並取得了可喜的成果。這條管道...",
      "title": "AGTC。生物醫藥玩法，100%的上漲空間! DD"
    }
  ],
  "title": "AGTC. Biopharma play with 100% upside! DD",
  "created_utc": 1614044620,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Full disclosure. My position in AGTC is 300 @ 7.65. </p>\n\n<p><strong>Who is AGTC?</strong></p>\n\n<p>AGTC is a Biopharmaceutical company that focuses on gene therapies to treat rare inherited genetic conditions. They specialize in treating eye conditions, and have a substantial pipeline with promising results. This pipeline includes treatment for X-Linked Retinitis Pigmentosa (XLRP), which is in extended phase 2 clinical trials. They are also in clinical trials for a treatment of Achromatopsia. You can see their full pipeline here: <a href=\"https://agtc.com/programs/\">https://agtc.com/programs/</a></p>\n\n<p><strong>What is XLRP?</strong> </p>\n\n<p><strong>&quot;</strong>Retinitis pigmentosa (RP) describes a group of rare genetic eye diseases that damage light-sensitive cells in the retina, leading to loss of sight over time. In about 10% of RP cases, the non-working gene is passed down from the mother to her children resulting in a form of RP known as X-Linked RP (XLRP). For more information about how retinitis pigmentosa is inherited and the impact on the vision of male and female children, please go to <a href=\"https://www.nei.nih.gov/learn-about-eye-health/eye-conditions-and-diseases/retinitis-pigmentosa\">https://www.nei.nih.gov/learn-about-eye-health/eye-conditions-and-diseases/retinitis-pigmentosa.</a></p>\n\n<p>XLRP causes gradual vision loss in boys and young men. The disease begins with night blindness and is followed by a slow narrowing of the peripheral field of vision. In general, the decline in vision (also referred to as “visual acuity”) results in a person becoming legally blind in their 40s.&quot;</p>\n\n<p><strong>Catalysts</strong></p>\n\n<p>AGTC recently took part in the OIS Gene Therapy Innovation Showcase and showed extremely promising results from their XLRP trials. I watched the conference and CEO Sue Washer spoke clearly and confidently about their results. Unfortunately the YouTube video was made private, and I am unable to locate it anywhere. If I find a link I will update this post. </p>\n\n<p>AGTC is also presenting this week at the 4th annual Gene Therapy for Rare Disorders digital event. Information on this event can be found here: <a href=\"https://genetherapy-conference.com/\">https://genetherapy-conference.com/</a> </p>\n\n<p>AGTC currently has a strong buy rating with an average price target of $16.71. Low price target is $9, high price target is $35. Right now looks like a perfect entry point, and I have spent the day averaging down during the dip. <a href=\"https://www.wsj.com/market-data/quotes/AGTC/research-ratings\">https://www.wsj.com/market-data/quotes/AGTC/research-ratings</a></p>\n\n<p>The analyst that gave a $35 PT is Zegbeh Jallah Ph D, a senior research analyst in the biotech sector for Roth Capital. I tend to listen to voices such as hers! </p>\n\n<p>AGTC is also speculated to be a buyout candidate by Sanofi. These are just rumors, but there is a lot of reason to be optimistic moving forward! </p>\n\n<p><strong>Institutional Ownership</strong></p>\n\n<p>According to Fintel, AGTC has institutional ownership pushing 40%. This is generally a great sign for retail investors. Institutions generally don&#39;t invest in failing companies. <a href=\"https://fintel.io/so/us/agtc\">https://fintel.io/so/us/agtc</a></p>\n\n<p><strong>Competitors</strong></p>\n\n<p>AGTC isn&#39;t the only company that is developing XLRP therapy. Currently the two main competitors are Biogen (BIIB) and Mieragtx (MGTX). Both of these companies are also in clinical trials for their XLRP treatment, but what sets AGTC apart is the efficacy and safety of their treatments. Compared to their competitors, AGTC&#39;s therapy is not only more effective, but also has far fewer incidents of negative side effects. </p>\n\n<p>Recently AGTC went through a big pump. On Feb 1 the stock was trading right around $4 and shot up all the way to $9+ by 2/11, and again on 2/17. The last few days of trading we are seeing a steady pullback, with a share price of $6.39 at the time of writing. This presents a fantastic entry point in my opinion. With an average price target of $16+, AGTC could easily see 150% growth over the next 12 months, with potential to soar well above that if the clinical trials continue to show positive results. </p>\n\n<p>There isn&#39;t much to dislike about this company. Their leadership team is extremely seasoned, they are narrowly focused, their trials show incredible promise and they are the clear front runners among their competitors for XLRP treatment!</p>\n\n<p>As always, do your own DD before investing! You can join the sub <a href=\"/r/AGTCstock\">r/AGTCstock</a> where you can find a lot more great DD posts and information. The discord is lively as well! <a href=\"https://discord.com/invite/Pugj8Sz4Sf\">Discord</a></p>\n</div><!-- SC_ON -->",
  "score": 72,
  "permalink": "/r/investing/comments/lpzh9d/agtc_biopharma_play_with_100_upside_dd/",
  "subreddit": "investing",
  "id": "lpzh9d",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332881994
}