{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "At the moment everyone's understandably focused on finding value in a market that's been brutally punishing overvalued high PS/PE names. However recently I've been seeing a lot of people here dismiss certain growth tech names on the basis of their PS and PE ratios alone without looking into them in any real depth.\n\nI thought it might be useful to share how I think about growth tech valuations and why in many cases I think people have been wrongly dismissive of certain stocks.\n\n**Growth rates**\n\nSo firstly, I think we're all aware that growth tech companies typically have higher valuations because every metric investors care about tends to be skewed by growth. I think most people here probably understand that a company growing at 2x the rate of a similar sized company is likely to be given a premium by the market, but I don't think it's always appreciated that this relationship between growth and value is exponential. Take the following example:\n\nThree companies have revenues of $100m.\n\nCompany 1 is expected to grow at 5% YoY.\n\nCompany 2 is expected to grow at 20% YoY.\n\nCompany 3 is expected to grow at 80% YoY.\n\nIf these growth expectations are accurate then after 5 years Company 1 will have revenues of $128m; Company 2 will have revenues of $249m; and Company 3 will have revenues of $1,890.\n\nWhen valuing a company like SNOW with a YoY growth rate in excess of 100% you need to keep this exponential increase in valuation in mind. Too often I see people just comparing SNOWs PS directly with other growth tech stocks with a YoY growth rates of 40-60%. These do not make good direct comparisons. Companies with growth rates as high as SNOWs should be reasonably expected to have valuations exponentially higher in many cases.\n\n**Price/Sales**\n\nAnother thing to consider is that many popular growth tech stocks are cloud and SaaS names. These types of companies can usually be expected to have far higher valuations because unlike most traditional businesses they have higher profit margins and repeatable streams of income. This becomes extremely important when looking at a company's PS ratio because the value of those sales depends on their stickiness and margins...\n\nAs an example a retail store that has good sales one year may not necessarily have strong sales the next year, but for a SaaS company current sales tend to be much more predictive of future sales thanks to its subscription model and the friction in switching to a competitor.\n\nAnother advantage these companies have is in their margins. If you take a company like F you'll notice that for every $1 they sell they only make around $0.15 - $0.20 in gross profit, where as a software company might make anywhere from $0.40 - $0.70 in gross profit for every $1 they sell.\n\nPut simply, sales are worth more to software companies, especially those in the cloud/SaaS space.\n\n**Price/Earnings**\n\nFinally I want to talk about PE...\n\nThe main thing people get wrong when it comes to looking at the PEs of growth stocks is that most growth tech companies don't care that much about profitability. Software tends to be inherently monopolistic so the goal of most early-stage tech companies is to capture as much of market as possible to secure future profits. This is a challenge for us as investors though because without profits it's difficult to understand what these companies are really worth.\n\nIn recent weeks I've seen a few people talk about how SHOP looks expensive because it has a forward PE in excess of 100. For me the problem with this argument is that it's not factoring the fact SHOP hasn't finished growing yet and is still trying to secure it's share of the market while building out its core product. Most established tech companies spend around 20-40% of their gross profits on sales &amp; marketing + R&amp;D, where as growing tech companies normally spend around 60-100% (or more) on S&amp;M + R&amp;D.\n\nIf we take the example of SHOP, we find about 75% of gross profits are being spent on S&amp;M + R&amp;D. If we halve this 37.5% to get a S&amp;M + R&amp;D spend more typical of an establish tech company then in the last quarter their operating expenses would drop from $613m to $395m and their operating income would go from -$4m to $213m. I personally like to adjust the PEs of growth stocks to factor in a more realistic long-term S&amp;M + R&amp;D spend. If you do this for SHOP using your own long-term S&amp;M + R&amp;D estimates you should find SHOP's PE falls closer in line with other high value tech names like NVDA and AMZN.\n\n**Compounding factors**\n\nFinally it's worth noting that all of these factors (growth rates, the value of current sales, and future earnings potential) compound together. I mentioned how a more realistic long-term PE for SHOP would be closer to an AMZN or NVDA, but this still doesn't factor in the expected YoY growth of SHOP or the relative stickiness of their platform and revenue model.\n\n**Some thoughts on growth tech valuations**\n\nIn my opinion when you look at the valuations of growth tech today and adjust valuations for better comps with establish tech players in most cases you'll find growth tech is trading at a decent discount.\n\nThat said, there is a debate to be had about how future profitability should be discounted, especially now rates are set to move higher. Established tech players are making huge amounts of cash today and in many cases returning that cash to share holders via buybacks and dividends. Growth stocks are inherently riskier as there is a chance they will never reach profitably.\n\nWhatever your thoughts on growth stocks, hopefully this will help some of you understand why many of these companies appear to be trading at such significant premiums and why it might not be as extreme as you might think. I've just touched on three things to consider here, but often with growth tech companies you'll also need to think about how TAM and a company's moat can impact its valuation. Many of these companies also operating within growing sectors of the economy and this can also help support higher relative valuations.",
  "author_fullname": "t2_e8clt",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Growth stock valuations - why growth tech is (probably) not as expensive as you think",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": "advice",
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_scweet",
  "quarantine": false,
  "link_flair_text_color": "light",
  "upvote_ratio": 0.88,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 43,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Advice",
  "can_mod_post": false,
  "score": 43,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": 1643168934,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1643168569,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;At the moment everyone&amp;#39;s understandably focused on finding value in a market that&amp;#39;s been brutally punishing overvalued high PS/PE names. However recently I&amp;#39;ve been seeing a lot of people here dismiss certain growth tech names on the basis of their PS and PE ratios alone without looking into them in any real depth.&lt;/p&gt;\n\n&lt;p&gt;I thought it might be useful to share how I think about growth tech valuations and why in many cases I think people have been wrongly dismissive of certain stocks.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Growth rates&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;So firstly, I think we&amp;#39;re all aware that growth tech companies typically have higher valuations because every metric investors care about tends to be skewed by growth. I think most people here probably understand that a company growing at 2x the rate of a similar sized company is likely to be given a premium by the market, but I don&amp;#39;t think it&amp;#39;s always appreciated that this relationship between growth and value is exponential. Take the following example:&lt;/p&gt;\n\n&lt;p&gt;Three companies have revenues of $100m.&lt;/p&gt;\n\n&lt;p&gt;Company 1 is expected to grow at 5% YoY.&lt;/p&gt;\n\n&lt;p&gt;Company 2 is expected to grow at 20% YoY.&lt;/p&gt;\n\n&lt;p&gt;Company 3 is expected to grow at 80% YoY.&lt;/p&gt;\n\n&lt;p&gt;If these growth expectations are accurate then after 5 years Company 1 will have revenues of $128m; Company 2 will have revenues of $249m; and Company 3 will have revenues of $1,890.&lt;/p&gt;\n\n&lt;p&gt;When valuing a company like SNOW with a YoY growth rate in excess of 100% you need to keep this exponential increase in valuation in mind. Too often I see people just comparing SNOWs PS directly with other growth tech stocks with a YoY growth rates of 40-60%. These do not make good direct comparisons. Companies with growth rates as high as SNOWs should be reasonably expected to have valuations exponentially higher in many cases.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Price/Sales&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Another thing to consider is that many popular growth tech stocks are cloud and SaaS names. These types of companies can usually be expected to have far higher valuations because unlike most traditional businesses they have higher profit margins and repeatable streams of income. This becomes extremely important when looking at a company&amp;#39;s PS ratio because the value of those sales depends on their stickiness and margins...&lt;/p&gt;\n\n&lt;p&gt;As an example a retail store that has good sales one year may not necessarily have strong sales the next year, but for a SaaS company current sales tend to be much more predictive of future sales thanks to its subscription model and the friction in switching to a competitor.&lt;/p&gt;\n\n&lt;p&gt;Another advantage these companies have is in their margins. If you take a company like F you&amp;#39;ll notice that for every $1 they sell they only make around $0.15 - $0.20 in gross profit, where as a software company might make anywhere from $0.40 - $0.70 in gross profit for every $1 they sell.&lt;/p&gt;\n\n&lt;p&gt;Put simply, sales are worth more to software companies, especially those in the cloud/SaaS space.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Price/Earnings&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Finally I want to talk about PE...&lt;/p&gt;\n\n&lt;p&gt;The main thing people get wrong when it comes to looking at the PEs of growth stocks is that most growth tech companies don&amp;#39;t care that much about profitability. Software tends to be inherently monopolistic so the goal of most early-stage tech companies is to capture as much of market as possible to secure future profits. This is a challenge for us as investors though because without profits it&amp;#39;s difficult to understand what these companies are really worth.&lt;/p&gt;\n\n&lt;p&gt;In recent weeks I&amp;#39;ve seen a few people talk about how SHOP looks expensive because it has a forward PE in excess of 100. For me the problem with this argument is that it&amp;#39;s not factoring the fact SHOP hasn&amp;#39;t finished growing yet and is still trying to secure it&amp;#39;s share of the market while building out its core product. Most established tech companies spend around 20-40% of their gross profits on sales &amp;amp; marketing + R&amp;amp;D, where as growing tech companies normally spend around 60-100% (or more) on S&amp;amp;M + R&amp;amp;D.&lt;/p&gt;\n\n&lt;p&gt;If we take the example of SHOP, we find about 75% of gross profits are being spent on S&amp;amp;M + R&amp;amp;D. If we halve this 37.5% to get a S&amp;amp;M + R&amp;amp;D spend more typical of an establish tech company then in the last quarter their operating expenses would drop from $613m to $395m and their operating income would go from -$4m to $213m. I personally like to adjust the PEs of growth stocks to factor in a more realistic long-term S&amp;amp;M + R&amp;amp;D spend. If you do this for SHOP using your own long-term S&amp;amp;M + R&amp;amp;D estimates you should find SHOP&amp;#39;s PE falls closer in line with other high value tech names like NVDA and AMZN.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Compounding factors&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Finally it&amp;#39;s worth noting that all of these factors (growth rates, the value of current sales, and future earnings potential) compound together. I mentioned how a more realistic long-term PE for SHOP would be closer to an AMZN or NVDA, but this still doesn&amp;#39;t factor in the expected YoY growth of SHOP or the relative stickiness of their platform and revenue model.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Some thoughts on growth tech valuations&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;In my opinion when you look at the valuations of growth tech today and adjust valuations for better comps with establish tech players in most cases you&amp;#39;ll find growth tech is trading at a decent discount.&lt;/p&gt;\n\n&lt;p&gt;That said, there is a debate to be had about how future profitability should be discounted, especially now rates are set to move higher. Established tech players are making huge amounts of cash today and in many cases returning that cash to share holders via buybacks and dividends. Growth stocks are inherently riskier as there is a chance they will never reach profitably.&lt;/p&gt;\n\n&lt;p&gt;Whatever your thoughts on growth stocks, hopefully this will help some of you understand why many of these companies appear to be trading at such significant premiums and why it might not be as extreme as you might think. I&amp;#39;ve just touched on three things to consider here, but often with growth tech companies you&amp;#39;ll also need to think about how TAM and a company&amp;#39;s moat can impact its valuation. Many of these companies also operating within growing sectors of the economy and this can also help support higher relative valuations.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "823be0a6-65e6-11e5-9784-125ee764bc01",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#646d73",
  "id": "scweet",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "kriptonicx",
  "discussion_type": null,
  "num_comments": 44,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/scweet/growth_stock_valuations_why_growth_tech_is/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/scweet/growth_stock_valuations_why_growth_tech_is/",
  "subreddit_subscribers": 3570140,
  "created_utc": 1643203733,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1643168569,
  "the_new_excerpt": "At the moment everyone's understandably focused on finding value in a market\nthat's been brutally punishing overvalued high PS/PE names. However recently\nI've been seeing a lot of people here dismiss certain growth tech names on the\nbasis of their PS and PE ratios alone without looking into them in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "現在、皆が市場の価値を見出すことに集中しているのは当然です。\n高PS/PE銘柄の割高感を厳しく罰してきた。しかし、最近\nこのところ、ある成長株のハイテク銘柄を、\"nothing \"と断じる人をよく見かけます。\nPSとPEの比率だけで、その企業のことをよく調べずに...",
      "title": "グロース株のバリュエーション - なぜグロース・テックは（おそらく）あなたが思うほど高くないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "目前，每个人都专注于在市场中寻找价值，这是可以理解的。\n残酷地惩罚被高估的高PS/PE名称。然而，最近\n我已经看到很多人在这里否定了某些成长型科技公司，仅仅是基于它们的PS和PE比率，而不去研究它们。\n他们的PS和PE比率，而不去研究它们。",
      "title": "成长型股票的估值--为什么成长型科技公司（可能）没有你想象的那么贵"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "目前，每個人都專注於在市場中尋找價值，這是可以理解的。\n殘酷地懲罰被高估的高PS/PE名稱。然而，最近\n我已經看到很多人在這裏否定了某些成長型科技公司，僅僅是基於它們的PS和PE比率，而不去研究它們。\n他們的PS和PE比率，而不去研究它們。",
      "title": "成長型股票的估值--爲什麼成長型科技公司（可能）沒有你想象的那麼貴"
    }
  ]
}