{
  "author": "R0B0C0P33",
  "original_created_utc": 1629575119,
  "title": "Bitcoin becomes legal tender in El Salvador in less than 3 weeks. What will this look like?",
  "created_utc": 1629594724,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>On September 7th, El Salvador will officially become the first country to accept Bitcoin as legal tender for all payments nation-wide. I&#39;m really curious what this will look like. Will there be a steep learning curve for businesses and average citizens? Will they adapt quickly?</p>\n\n<p>I&#39;m hopeful that this is successful and spurs other countries to adopt it. This may not be an apt comparison, but in the United States we have several states that have now legalized marijuana that I don&#39;t think would have if not for the fact that other states did it first and didn&#39;t have disastrous consequences.</p>\n\n<p>I&#39;m thrilled it&#39;s happening but am worried about the possibility that the rollout being done hastily or not going well and thus setting back crypto implementation. Since no one has to use crypto, I&#39;m guessing that anyone who doesn&#39;t want to can still use their fiat currency and September 7th will be no different from September 6th. However, if they see people who want to use it, use it at stores and have no hiccups, perhaps it will help demystify and make it seem like actual currency and not &quot;pretend Internet money&quot;</p>\n\n<p>Anyone who has followed this more closely and has a better understanding of this, I&#39;d love to hear your thoughts.</p>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/CryptoCurrency/comments/p8xy7z/bitcoin_becomes_legal_tender_in_el_salvador_in/",
  "subreddit": "CryptoCurrency",
  "id": "p8xy7z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "On September 7th, El Salvador will officially become the first country to accept\nBitcoin as legal tender for all payments nation-wide. I'm really curious what\nthis will look like. Will there be a steep learning curve for businesses and\naverage citizens? Will they adapt quickly?\n\nI'm hopeful that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "9月7日、エルサルバドルは、全国でビットコインを法定通貨として受け入れる最初の国となります。\nビットコインを法定通貨として受け入れる最初の国となります。これがどのようなものか、とても気になります。\nこれがどのようなものか、とても気になります。企業や一般市民にとって、急な学習曲線があるのでしょうか？\n企業や一般市民にとって急な学習曲線となるでしょうか？それとも、すぐに適応できるでしょうか？\n\n私は期待しています...",
      "title": "エルサルバドルでは、3週間以内にビットコインが法定通貨になります。これはどのようなものでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "9月7日，萨尔瓦多将正式成为第一个接受\n比特币作为法定货币用于全国范围内的所有支付。我真的很好奇\n这将是什么样子的。对于企业和普通公民来说，是否会有一个陡峭的学习曲线？\n普通公民？他们会很快适应吗？\n\n我希望...",
      "title": "在不到3周的时间里，比特币在萨尔瓦多成为合法货币。这将是什么样子的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "9月7日，薩爾瓦多將正式成爲第一個接受\n比特幣作爲法定貨幣用於全國範圍內的所有支付。我真的很好奇\n這將是什麼樣子的。對於企業和普通公民來說，是否會有一個陡峭的學習曲線？\n普通公民？他們會很快適應嗎？\n\n我希望...",
      "title": "在不到3周的時間裏，比特幣在薩爾瓦多成爲合法貨幣。這將是什麼樣子的？"
    }
  ]
}