{
  "author": "rosssspat",
  "original_created_utc": 1636360415,
  "title": "(Possibly?) Unpopular Opinion: Solana is Overvalued and Does not Deserve to be in the Top 5",
  "created_utc": 1636367881,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Don’t get me wrong, SOL is still a good project. It’s fast, smart contract compatible and has a thriving DEX and NFT community building on top of it. </p>\n\n<p><em>However</em> it also has come glaring issues with how centralised the platform is. </p>\n\n<p>On <em>September 11th</em> the SOL network went down due to a glitch which lead to a very high frequency of transactions at once (upwards of 400,000). This was due to excessive memory usage which caused several nodes to go offline. The network stayed offline for over 10 hours whilst they tried to fix the error. </p>\n\n<p>However the issue with this is that together, it would only take a small number of validators (&lt;20) to take down the network again. </p>\n\n<p>The next issue just occurred just a couple of days ago on <em>November 5th</em>. In April 2020, the SOL team stated that the total circulating supply was only <strong>8.2M</strong> where in reality it was <strong>&gt;20M.</strong> Which is a huge difference. A 3d party managed to find the <em>unlocked</em> wallet containing the extra 13M SOL. </p>\n\n<p>Once this was found out, SOL admitted to the fraud and they said they would get back the coins and make sure they were burned to make sure they wouldn’t go back into the market. <strong>But</strong> they only managed to retrieve 3.3M of the coins and therefore 8M new   SOL went into circulation. This <strong>doubled</strong> the supply from 8M to 16M. </p>\n\n<p>Following this, there was no official announced or anything, they just moved on. </p>\n\n<p>Now with all this, I’m not suggesting that every centralised crypto project is awful. There has just been some shady things going on with SOL recently. Issues that go against what crypto is all about. </p>\n\n<p>Something just doesn’t sit right with me that SOL has a $74,000,000,000 market cap</p>\n</div><!-- SC_ON -->",
  "score": 363,
  "permalink": "/r/CryptoCurrency/comments/qp9dnh/possibly_unpopular_opinion_solana_is_overvalued/",
  "subreddit": "CryptoCurrency",
  "id": "qp9dnh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Don’t get me wrong, SOL is still a good project. It’s fast, smart contract\ncompatible and has a thriving DEX and NFT community building on top of it.\n\nHowever it also has come glaring issues with how centralised the platform is.\n\nOn September 11th the SOL network went down due to a glitch which lead…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "誤解しないでほしいのは、SOLは今でもいいプロジェクトだということ。高速で、スマートコントラクト\n互換性があり、その上に繁栄するDEXとNFTのコミュニティが構築されている。\n\nしかし、プラットフォームの中央集権化には大きな問題がある。\n\n9月11日、SOLのネットワークは不具合によりダウンし、その結果...",
      "title": "(Possibly?) Unpopular Opinion: ソラナは過大評価されており、トップ5に入る資格はない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "不要误会我的意思，SOL仍然是一个好项目。它的速度快，智能合约\n兼容，并且有一个蓬勃发展的DEX和NFT社区在其之上。\n\n然而，它也有明显的问题，那就是平台的中心化程度。\n\n9月11日，SOL网络由于一个故障而瘫痪，这导致...",
      "title": "(可能？)不受欢迎的意见。索拉纳被高估了，不配进入前五名"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不要誤會我的意思，SOL仍然是一個好項目。它的速度快，智能合約\n兼容，並且有一個蓬勃發展的DEX和NFT社區在其之上。\n\n然而，它也有明顯的問題，那就是平臺的中心化程度。\n\n9月11日，SOL網絡由於一個故障而癱瘓，這導致...",
      "title": "(可能？)不受歡迎的意見。索拉納被高估了，不配進入前五名"
    }
  ]
}