{
  "author": "illram",
  "the_new_excerpt": "I can end with the title but I can explain more.\n\nI know I know another safemoon is a scam post but I feel like this particular\npoint is getting lost on people and/or there are still enough bag holders and\nshillers here to perhaps create some doubt. And there are still bullshit posts\nlike…",
  "original_created_utc": 1619043662,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルだけで終わらせることもできますが、もっと説明することもできます。\n\n私は別のセーフムーンが詐欺であることを知っていますが、この特定のポイントが人々に理解されていないような気がしています。\nこの点が人々に理解されていないような気がしますし、ここにはまだ多くのバッグホルダーやシラーがいて\n疑念を抱かせるようなバッグホルダーやシラーがまだここにいるような気がします。そして、まだデタラメな投稿があります。\n例えば...",
      "title": "Safemoonはまさに文字通りネズミ講です。もしあなたがSafemoonを持っているなら、今すぐ手を止めて全部売りに行きましょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我可以用标题结束，但我可以解释更多。\n\n我知道我知道另一个safemoon是一个骗局帖子，但我觉得这个特别的\n我知道我知道另一个Safemoon是一个骗局的帖子，但我觉得这个特别的观点在人们心中越来越模糊，并且/或者仍然有足够的持袋者和\n骗子在这里也许会产生一些怀疑。而且还有一些狗屁帖子\n如...",
      "title": "Safemoon实际上是一个庞氏骗局。如果你拥有任何东西，请停止你正在做的事情，现在就去卖掉所有的东西。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我可以用標題結束，但我可以解釋更多。\n\n我知道我知道另一個safemoon是一個騙局帖子，但我覺得這個特別的\n我知道我知道另一個Safemoon是一個騙局的帖子，但我覺得這個特別的觀點在人們心中越來越模糊，並且/或者仍然有足夠的持袋者和\n騙子在這裏也許會產生一些懷疑。而且還有一些狗屁帖子\n如...",
      "title": "Safemoon實際上是一個龐氏騙局。如果你擁有任何東西，請停止你正在做的事情，現在就去賣掉所有的東西。"
    }
  ],
  "title": "Safemoon is quite literally a ponzi scheme. If you own any, stop what you are doing and go sell all of it right now.",
  "created_utc": 1619058388,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I can end with the title but I can explain more. </p>\n\n<p>I know I know another safemoon is a scam post but I feel like this particular point is getting lost on people and/or there are still enough bag holders and shillers here to perhaps create some doubt. And there are still bullshit posts like <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/mv693w/lets_have_a_discussion_about_safemoon/\">this</a> from just 17 hours ago, and hundreds of millions in volume on Pancake swap, such that I feel like people need to hear this very, very clearly:</p>\n\n<p>Safemoon is a ponzi. It is explicitly designed to be a ponzi. <em>They admit it is a ponzi on their website</em> if you actually can get through the gobbledeygook explanation in their complete and utter joke of a whitepaper. So, let me now dispel any doubt that it is quite literally a ponzi in smart contract form.  </p>\n\n<p>First let&#39;s define a ponzi scheme. From wiki:</p>\n\n<blockquote>\n<p>a form of fraud that lures investors and pays profits to earlier investors with funds from more recent investors.[2] The scheme leads victims to believe that profits are coming from legitimate business activity (e.g. product sales and/or successful investments), and they remain unaware that other investors are the source of funds. A Ponzi scheme can maintain the illusion of a sustainable business as long as new investors contribute new funds, and as long as most of the investors do not demand full repayment and still believe in the non-existent assets they are purported to own.</p>\n</blockquote>\n\n<p>Now let&#39;s consider safemoon&#39;s &quot;tokenomics.&quot; If you read their &quot;whitepaper&quot; on their website, which I will not link to, they state the only revenue generation of the token is the 5% &quot;fee&quot; that is distributed to everyone from every transaction of the token. Another 5% goes to the liquidity pool on Pancake swap which they claim is to keep a &quot;price floor&quot;, this is mostly irrelevant to the explanation, but it helps aid the scam by maintaining liquidity, since the coin relies on people buying it. (And it also gives it a veneer of authority as I suspect a lot of people have no clue what a liquidity pool is.) They also claim there is an a &quot;burn wallet&quot; which the developers admit they will only <strong>manually burn</strong> (i.e., they don&#39;t have to burn shit) as they see fit for the health of the token. (lol). Finally, their website explicitly encourages you to hodl your tokens so you continue to reap the 5% transaction fee from all the other people transacting the token. </p>\n\n<p>There is <em>no other use of the token</em>. None. It is purely by the developers own admission a smart contract designed to take money from someone buying or selling the token and give it to you. Or, to use the wiki definition, a new and advanced means of &quot;pay[ing] profits to earlier investors with funds from more recent investors.&quot;</p>\n\n<p>So, we have all the basic conditions of a ponzi, right there in the white paper:</p>\n\n<ul>\n<li>revenue generation from the token is entirely dependent on people buying more of the token;</li>\n<li>the longer you hodl, &quot;the more you make&quot;; </li>\n<li>irrespective of how markets affect price, there is zero revenue generation if people stop transacting with the token, and</li>\n<li>you are discouraged from selling the token by earning fees and being taxed on your way out (like in a traditional ponzi, where you&#39;d be discouraged from ever cashing out as that would collapse the whole scheme).</li>\n</ul>\n\n<p>Keep in mind this is separate from just speculating on price. Every token has that component, but most tokens at least <em>pretend</em> to serve some sort of function irrespective of just speculating on price. A token&#39;s purpose could be as simple as a digital trustless means of transacting in some form of currency as an alternative to fiat. Safemoon does not even pretend to be that.</p>\n\n<p>I also occasionally see posts where they claim this is not a ponzi because old and new investors alike make money from the fee generation. This is simply a function of the way a smart contract ponzi can work, though. In a way it is a technical advancement in ponzi scheming, if you will. Old AND new investor transacting can add money into the scheme to satiate bag hodlers, you don&#39;t just need new suckers, you can live off a combo of new suckers and bag holders transferring funds or selling (as long as they are not collapsing the price) since everyone&#39;s transactions are contributing to the Pancake liquidity pool which can theoretically provide a constant market, even if no one new enters the scam.</p>\n\n<p>That&#39;s it. I suppose this is also useful to new people in the crypto scene. If you actually try to understand a token&#39;s stated purpose, it can be clear that a given token is in fact a scam without doing any other research.</p>\n</div><!-- SC_ON -->",
  "score": 1113,
  "permalink": "/r/CryptoCurrency/comments/mvqzfd/safemoon_is_quite_literally_a_ponzi_scheme_if_you/",
  "subreddit": "CryptoCurrency",
  "id": "mvqzfd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171523348
}