{
  "author": "I_aint_taking_ur_bs",
  "original_created_utc": 1659174837,
  "title": "What’s the difference between bisexual and pansexual?",
  "created_utc": 1659193361,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don’t know if this is a right place to ask that question but well... I’m afraid to ask so I guess it is. I don’t understand the difference. So, pan means that you’re attracted to all genders and bi- to both genders. We could argue how many genders there are and all but on a basic level people are attracted to secondary sexual characteristic and sex is binary. So a bisexual person could be attracted to a nonbinary person (because ,,nonbinary” doesn’t mean ,,sexless”). I don’t wanna invalidate anybody, I’m just confused.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/TooAfraidToAsk/comments/wbtw6m/whats_the_difference_between_bisexual_and/",
  "subreddit": "TooAfraidToAsk",
  "id": "wbtw6m",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I don’t know if this is a right place to ask that question but well... I’m\nafraid to ask so I guess it is. I don’t understand the difference. So, pan means\nthat you’re attracted to all genders and bi- to both genders. We could argue how\nmany genders there are and all but on a basic level people are…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここで質問していいのかわからないけど、まあ...。でも\n聞くのが怖いので、そうなんでしょうけど。違いがよくわからないんです。つまり、パンとは\n\"すべての性別に惹かれる\"\"両方の性別に惹かれる 私たちは、どのように\nでも基本的に人は...",
      "title": "バイセクシャルとパンセクシャルの違いは何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不知道这是否是一个合适的地方来问这个问题，但是...... 我\n我不敢问，所以我想这是。我不明白其中的区别。那么，泛指\n你对所有性别都有吸引力，对两种性别都有吸引力。我们可以争论一下\n我们可以争论有多少种性别，但在一个基本层面上，人们是...",
      "title": "双性恋和泛性恋之间有什么区别？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不知道這是否是一個合適的地方來問這個問題，但是...... 我\n我不敢問，所以我想這是。我不明白其中的區別。那麼，泛指\n你對所有性別都有吸引力，對兩種性別都有吸引力。我們可以爭論一下\n我們可以爭論有多少種性別，但在一個基本層面上，人們是...",
      "title": "雙性戀和泛性戀之間有什麼區別？"
    }
  ]
}