{
  "author": "thinkofme23",
  "original_created_utc": 1642936172,
  "title": "Why has “too afraid to ask” basically become “I really want to bait ask a obvious question on a sensitive topic but instead of using google, I'll be asking a website that has a less than stellar record of acceptance\"?",
  "created_utc": 1642944765,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;And why do so people insist on pretending than the questions are being asked in good faith? The majority of the ones pertaining to gay people and transsexuals et cetera are arguably not. Is it some sort of major conservative astroturfing operation? It’s literally every day, it sure as hell doesn’t look like these people are “too afraid” to ask.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 128,
  "permalink": "/r/TooAfraidToAsk/comments/sardty/why_has_too_afraid_to_ask_basically_become_i/",
  "subreddit": "TooAfraidToAsk",
  "id": "sardty",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "And why do so people insist on pretending than the questions are being asked in\ngood faith? The majority of the ones pertaining to gay people and transsexuals\net cetera are arguably not. Is it some sort of major conservative astroturfing\noperation? It’s literally every day, it sure as hell doesn’t…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そして、なぜ人々は、質問が誠実になされているように見せかけようとするのでしょう。\n誠意があるのか？ゲイやニューハーフに関するものの大半は\nなどは、間違いなく違う。保守派のアストロターフのようなものなのでしょうか。\nの操作ですか？文字通り毎日です、それは確かに...。",
      "title": "なぜ「怖くて聞けない」が基本的に「本当はデリケートな話題で当たり前のことを訊きたいのに、googleを使う代わりに、受け入れ実績の少ないサイトに訊く」になってしまったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "为什么这么多人坚持要假装这些问题是出于善意的呢？\n诚信的问题？大多数与同性恋者和变性人有关的问题\n等等，可以说都不是。这是某种大型的保守派天马行空的行动吗？\n的行动？这简直是每天都在发生的事情，肯定不是...",
      "title": "为什么 \"不敢问 \"基本上变成了 \"我真的想诱导问一个关于敏感话题的明显问题，但不是用谷歌，而是问一个接受记录不怎么好的网站\"？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "爲什麼這麼多人堅持要假裝這些問題是出於善意的呢？\n誠信的問題？大多數與同性戀者和變性人有關的問題\n等等，可以說都不是。這是某種大型的保守派天馬行空的行動嗎？\n的行動？這簡直是每天都在發生的事情，肯定不是...",
      "title": "爲什麼 \"不敢問 \"基本上變成了 \"我真的想誘導問一個關於敏感話題的明顯問題，但不是用谷歌，而是問一個接受記錄不怎麼好的網站\"？"
    }
  ]
}