{
  "author": "mXgibskn",
  "the_new_excerpt": "I’m trying to put you guys on, please read and share since nobody in this\nsubreddit is talking about it\n\nNOT MY DD u/aguacatesoup [/u/aguacatesoup] is the one who posted it but I need\nto share this since nobody else is...\n\nHey all, I've been doing research on this stock all weekend since…",
  "original_created_utc": 1613016378,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我想让你们上，请阅读和分享，因为这里面没有人。\n子reddit正在谈论它\n\n不是我的DD u/aguacatesoup [/u/aguacatesoup]是一个人发布的，但我需要。\n分享这一点，因为没有其他人... ...\n\n嘿，我一直在做研究这只股票整个周末，因为... ...",
      "title": "DD -$AGTC (5.60美元) - 疯狂的潜力"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想讓你們上，請閱讀和分享，因爲這裏面沒有人。\n子reddit正在談論它\n\n不是我的DD u/aguacatesoup [/u/aguacatesoup]是一個人發佈的，但我需要。\n分享這一點，因爲沒有其他人... ...\n\n嘿，我一直在做研究這隻股票整個週末，因爲... ...",
      "title": "DD -$AGTC (5.60美元) - 瘋狂的潛力"
    }
  ],
  "title": "DD -$AGTC ($5.60) - Crazy potential",
  "created_utc": 1613028291,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m trying to put you guys on, please read and share since nobody in this subreddit is talking about it</p>\n\n<p>NOT MY DD <a href=\"/u/aguacatesoup\">u/aguacatesoup</a> is the one who posted it but I need to share this since nobody else is...</p>\n\n<p>Hey all, I&#39;ve been doing research on this stock all weekend since I&#39;m considering investing. I&#39;ve seen multiple posts about it and have read them all, but I haven&#39;t seen anyone mention some very odd (potentially bullish) things about this stock. I am not a financial advisor.</p>\n\n<p>I will link all the sources to my information down below.</p>\n\n<p>This stock is pretty volatile and has been jumping all over the place for years. It reached a high of $30.46 back in 2014 and currently it is at $5.27, with a 52-week high of $7.40\nThe reasonable explanation for this stock&#39;s volatility is because it&#39;s a biotech company still in the clinical trial phase. What really interests me though is that 6+ years later after that initial high, it appears to be on the uptrend again. They are in Phase 2 expansion for X-Linked Retinitis Pigmentosa, in Phase 1/2 for Achromatopsia and Bionic Sight.</p>\n\n<p>What really REALLY interests me are these 4 facts I will lay out below\n* 1. In July of 2020, Roth Capitol analyst Dr. Zegbeh Jallah speculated that AGTC could attract interest of a Sanofi buyout.\n* 2. On February 1st, 2021 that same analyst updated the price estimate from $30 to $35\n* 3. On February 2nd, 2021 users on StockTwits were up in arms about AGTC&#39;s stock stubbornly remaining at $4.05 even though there was a HUGE increase in volume. It later comes to light that big whales Blackrock Inc. &amp; Empery Investments both made large purchases of AGTC&#39;s stock on that day, which explains why the stock remained at $4.05 (market manipulation?)\nBlackrock made a purchase of 1,732,067 shares, Empery made a purchase of 3,932,584.\n* 4. AGTC is releasing their Earnings Report on 2/11, and are also hosting a conference before the market opens on Thursday.</p>\n\n<p><strong>Analysis of these 4 facts:</strong>\nFirst off, let&#39;s take a look at the analyst at Roth Capitol. </p>\n\n<blockquote>\n<p>&quot;Zegbeh Jallah, Ph.D. is a Managing Director, Senior Research Analyst in the Biotech sector. Prior to joining ROTH, she was a Senior Biopharma Research Strategist at Piper Jaffray, where she worked in close partnership with the Biopharma Sector Analysts to author and develop thematic Biotechnology research with unique insights. Ms. Jallah’s universe includes mid-cap biotech companies developing technologies for ophthalmology, auto-immune, and oncology indications. She holds a Ph.D in Biomedical Engineering from the University of Pittsburgh, and is a trained scientist with over 10 years of scientific research experience.&quot;</p>\n</blockquote>\n\n<p>Based on her credentials, I&#39;m inclined to believe she has valuable insight into this field of Biotech that we, the retail investors, do not. In September 2020, she raised the price estimate from $25 to $26. In November of 2020, she raised it again from $26 to $30. Then finally on February 1st, she raised it to $35. What could cause her to raise the price estimate 3x in 6 months? To me, this is indicative of promising findings from AGTC&#39;s clinical trials. There hasn&#39;t been any information from her about Sanofi interest since July of 2020. Obviously a company buyout, if it were happening in this case, would take time to get everything in order. For her to raise the price point yet again at the beginning of Feb and then the very next day Blackrock and Empery make those purchases...hmm..</p>\n\n<p>Next, we have the large institutional share purchase on February 2nd, 2020. This to me is the most baffling. Why would they keep the price at exactly $4.05 while they purchased their shares? Why not lower? Why are they purchasing before the release of the Earnings Report? The exchange of shares at this price is very odd indeed. Almost like it was agreed upon beforehand. </p>\n\n<p>Finally, we have their conference &amp; Earnings Report release on February 11th. This is typical of AGTC to hold a conference in conjuction with the release of the ER. Historically, the share price drops $1-2 after the release of the ER, as they are usually negative being that this company is still in R&amp;D. Given that, I would normally wait for the conference before deciding to invest. But something seems up here. Does anyone else have some insight on what could be going on? Why are these institutions buying in before the ER? </p>\n\n<p><strong>Conclusion:</strong>\nI have no fucking clue what is going on. But if a more seasoned investor out there has suspicions on what could be going down here, your input would be greatly appreciated. This stock seems like a great long term investment, no doubt about that. I guess the question is when to get in. Thoughts?</p>\n\n<p><strong>Sources:</strong>\n(XLRP Clinical Trials)\n<a href=\"https://clinicaltrials.gov/ct2/show/NCT03116113?cond=xlrp&amp;cntry=US&amp;state=US%3AFL&amp;draw=2&amp;rank=1\">https://clinicaltrials.gov/ct2/show/NCT03116113?cond=xlrp&amp;cntry=US&amp;state=US%3AFL&amp;draw=2&amp;rank=1</a></p>\n\n<p>(AGTC Pipeline Programs)\n<a href=\"https://agtc.com/programs/\">https://agtc.com/programs/</a></p>\n\n<p>(AGTC May Attract Sanofi Interest) \n<a href=\"https://thefly.com/landingPageNews.php?id=3119774&amp;headline=AGTC;SNY-Applied-Genetic-may-attract-Sanofi-takeover-interest-says-Roth-Capital\">https://thefly.com/landingPageNews.php?id=3119774&amp;headline=AGTC;SNY-Applied-Genetic-may-attract-Sanofi-takeover-interest-says-Roth-Capital</a></p>\n\n<p>(AGTC Price Target raised to $35)\n<a href=\"https://thefly.com/landingPageNews.php?id=3237987&amp;headline=AGTC-Applied-Genetic-price-target-raised-to--from--at-Roth-Capital\">https://thefly.com/landingPageNews.php?id=3237987&amp;headline=AGTC-Applied-Genetic-price-target-raised-to--from--at-Roth-Capital</a></p>\n\n<p>(Statement of acquisition of beneficial ownership by individuals, Blackrock Inc)\n<a href=\"https://sec.report/Document/0000834237-21-007084/\">https://sec.report/Document/0000834237-21-007084/</a></p>\n\n<p>(Statement of acquisition of beneficial ownership by individuals, Empery Asset Management)\n<a href=\"https://sec.report/Document/0000902664-21-000757/\">https://sec.report/Document/0000902664-21-000757/</a></p>\n</div><!-- SC_ON -->",
  "score": 99,
  "permalink": "/r/stocks/comments/lhchjh/dd_agtc_560_crazy_potential/",
  "subreddit": "stocks",
  "id": "lhchjh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123205012
}