{
  "author": "samcornwell",
  "original_created_utc": 1636440157,
  "title": "£50,000",
  "created_utc": 1636457520,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Bitcoin breaches the £50,000 mark in the country of its birth.</p>\n\n<p>The majority of my British brethren are sleeping at the moment, but as they wake they’ll be seeing a milestone in U.K. FIAT. </p>\n\n<p>Bitcoin started in the U.K. (if the Genesis block is anything to go by) so this is as significant as any meme dollar value number.</p>\n\n<p>I love a good meme as the next person and $69,420 is just around the corner too, however I couldn’t let the significance of £50k pass without mention in this sub, even if it’s very US centric.</p>\n\n<blockquote>\n<blockquote>\n<p>The Times 03/Jan/2009 Chancellor on brink of second bailout for banks[1]\nThis was probably intended as proof that the block was created on or after January 3, 2009, as well as a comment on the instability caused by fractional-reserve banking. Additionally, it suggests that Satoshi Nakamoto may have lived in the United Kingdom.</p>\n</blockquote>\n</blockquote>\n</div><!-- SC_ON -->",
  "score": 158,
  "permalink": "/r/Bitcoin/comments/qpxuky/50000/",
  "subreddit": "Bitcoin",
  "id": "qpxuky",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Bitcoin breaches the £50,000 mark in the country of its birth.\n\nThe majority of my British brethren are sleeping at the moment, but as they wake\nthey’ll be seeing a milestone in U.K. FIAT.\n\nBitcoin started in the U.K. (if the Genesis block is anything to go by) so this\nis as significant as any meme…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコインが誕生した国で5万ポンドの大台を突破\n\n私のイギリスの同胞たちの大半は、今は眠っていますが、彼らが目を覚ますと\n英国FIATのマイルストーンを目にすることになるだろう。\n\nビットコインは英国で始まった（ジェネシスブロックが何かあれば）ので、これはミームと同じくらい重要です。\nミームと同じくらい重要です。",
      "title": "£50,000"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "比特币在其诞生的国家突破了50,000英镑大关。\n\n我的大多数英国兄弟此刻都在睡觉，但当他们醒来时\n他们将看到英国FIAT的一个里程碑。\n\n比特币是从英国开始的（如果创世纪区块有什么可以参考的），所以这\n和任何备忘录一样重要......",
      "title": "£50,000"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "比特幣在其誕生的國家突破了50,000英鎊大關。\n\n我的大多數英國兄弟此刻都在睡覺，但當他們醒來時\n他們將看到英國FIAT的一個里程碑。\n\n比特幣是從英國開始的（如果創世紀區塊有什麼可以參考的），所以這\n和任何備忘錄一樣重要......",
      "title": "£50,000"
    }
  ]
}