{
  "author": "Stewart_Games",
  "original_created_utc": 1635196423,
  "title": "Can \"hybrid\" caves form, in which some chambers are lava tubes, and others made by limestone dissolving?",
  "created_utc": 1635240822,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m wondering about speleogenesis - the formation of cave systems. As I understand it, there are really only 3 types of caverns - those formed when groundwater dissolves holes into limestone karsts, those formed by lava flows after the lava recedes, and the rare case of sub-glacial ice caves formed between a layer of ice and a stone floor as the glacier melts. </p>\n\n<p>What I am wondering is, could you get a situation where a limestone cave and a lava tube cave connect or overlap? Perhaps a way to think of this is &quot;can you find both lava and limestone in the same place?&quot;.</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/askscience/comments/qfqkiy/can_hybrid_caves_form_in_which_some_chambers_are/",
  "subreddit": "askscience",
  "id": "qfqkiy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm wondering about speleogenesis - the formation of cave systems. As I\nunderstand it, there are really only 3 types of caverns - those formed when\ngroundwater dissolves holes into limestone karsts, those formed by lava flows\nafter the lava recedes, and the rare case of sub-glacial ice caves…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "洞窟システムの形成である「Speleogenesis」について知りたいのですが。私の理解では\n地下水が石灰岩のカルストに穴を開けてできたもの、溶岩流でできたもの、の3種類しかないと理解しています。\n地下水が石灰岩のカルストに穴を溶かしてできたもの、溶岩が引いた後の溶岩流によってできたもの\n溶岩が引いた後の溶岩流によって形成されたもの、そして稀にある氷床下の氷の洞窟の3種類しかありませんが...。",
      "title": "溶岩洞と、石灰岩が溶けてできた洞が混在する「ハイブリッド」な洞窟ができることもあるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在想关于洞穴生成的问题--洞穴系统的形成。根据我的理解\n据我所知，实际上只有三种类型的洞穴--地下水将洞口溶入石灰岩岩溶中而形成的洞穴。\n地下水将洞口溶入石灰岩岩溶中，熔岩流在熔岩退去后形成的洞穴。\n熔岩退去后形成的，以及罕见的冰川下的冰洞......",
      "title": "能否形成 \"混合 \"洞穴，其中一些洞室是熔岩管，而另一些则是由石灰石溶解而成？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在想關於洞穴生成的問題--洞穴系統的形成。根據我的理解\n據我所知，實際上只有三種類型的洞穴--地下水將洞口溶入石灰岩岩溶中而形成的洞穴。\n地下水將洞口溶入石灰岩岩溶中，熔岩流在熔岩退去後形成的洞穴。\n熔岩退去後形成的，以及罕見的冰川下的冰洞......",
      "title": "能否形成 \"混合 \"洞穴，其中一些洞室是熔岩管，而另一些則是由石灰石溶解而成？"
    }
  ]
}