{
  "author": "tehzayay",
  "original_created_utc": 1640722076,
  "title": "Why is it that euthanasia is highly controversial for humans, but universally accepted and even encouraged for pets?",
  "created_utc": 1640754068,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I frequently hear the reasoning that you shouldn&amp;#39;t let your pet suffer needlessly at the end of its life, and in my experience the vast majority of dog/cat owners (in the appropriate situation of course) opt to put them down for this reason. Makes enough sense, but shouldn&amp;#39;t that logic hold even stronger for people? And before anyone jumps on me for supporting such a controversial thing, it&amp;#39;s the opposite. I personally find it hard to imagine euthanizing a pet for the same reason I find it hard to justify for a person. Plus, the pet can&amp;#39;t consent!&lt;/p&gt;\n\n&lt;p&gt;It seems to me like we overwhelmingly agree that a person&amp;#39;s life should be extended by any possible means, because more time with loved ones is worth any amount of suffering. But when it&amp;#39;s a pet (and let&amp;#39;s be honest, many are closer to their pets than all but a handful of people) we just say nah?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/rqoeqc/why_is_it_that_euthanasia_is_highly_controversial/",
  "subreddit": "TooAfraidToAsk",
  "id": "rqoeqc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I frequently hear the reasoning that you shouldn't let your pet suffer\nneedlessly at the end of its life, and in my experience the vast majority of\ndog/cat owners (in the appropriate situation of course) opt to put them down for\nthis reason. Makes enough sense, but shouldn't that logic hold even…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ペットを苦しめてはいけないという理由をよく耳にします。\nそして、私の経験では、大多数の人が、その最期を無駄にすることなく、その人生を終えることができます。\n犬や猫の飼い主は、（もちろん適切な状況であれば）処分することを選択します。\nということです。しかし、その理屈が通用するかというと......。",
      "title": "安楽死は、人間にとっては非常に議論を呼ぶものですが、ペットにとっては普遍的に受け入れられ、奨励さえされているのはなぜでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我经常听到这样的理由：你不应该让你的宠物在生命的最后时刻遭受不必要的痛苦。\n在其生命的最后阶段遭受不必要的痛苦，而根据我的经验，绝大部分的\n在我的经验中，绝大多数狗/猫的主人（当然是在适当的情况下）都会选择把它们放下，因为\n这个原因。这很有道理，但这一逻辑不应该适用于......",
      "title": "为什么安乐死对人类来说有很大争议，而对宠物来说却被普遍接受甚至鼓励？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我經常聽到這樣的理由：你不應該讓你的寵物在生命的最後時刻遭受不必要的痛苦。\n在其生命的最後階段遭受不必要的痛苦，而根據我的經驗，絕大部分的\n在我的經驗中，絕大多數狗/貓的主人（當然是在適當的情況下）都會選擇把它們放下，因爲\n這個原因。這很有道理，但這一邏輯不應該適用於......",
      "title": "爲什麼安樂死對人類來說有很大爭議，而對寵物來說卻被普遍接受甚至鼓勵？"
    }
  ]
}