{
  "author": "Brinothedino",
  "original_created_utc": 1629517541,
  "title": "Anybody else hoping to use their Crypto to buy a home?",
  "created_utc": 1629542075,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Lambos are great and all, but if I&#39;m honest I really want to be able to own a home one day. \nPlus, buying property will go up in value, while a Lambo will depreciate pretty fast. </p>\n\n<p>I feel like buying property is pretty much unattainable these days unless you have money from your parents (I don&#39;t). Crypto feels like the only real path to doing so. I don&#39;t know if I&#39;ll get there this bull run, but eventually i think I&#39;ll get there.</p>\n</div><!-- SC_ON -->",
  "score": 164,
  "permalink": "/r/CryptoCurrency/comments/p8kefm/anybody_else_hoping_to_use_their_crypto_to_buy_a/",
  "subreddit": "CryptoCurrency",
  "id": "p8kefm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Lambos are great and all, but if I'm honest I really want to be able to own a\nhome one day. Plus, buying property will go up in value, while a Lambo will\ndepreciate pretty fast.\n\nI feel like buying property is pretty much unattainable these days unless you\nhave money from your parents (I don't).…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ランボもいいですが、本音を言えば、いつか自分の家を持てるようになりたいですね。\nいつかは家を持ちたい。それに、不動産を買えば価値が上がりますが、ランボはすぐに減価してしまいます。\nランボはすぐに減価してしまう。\n\n最近では、不動産を購入することは、次のような場合を除いて、ほとんど不可能だと感じています。\n親からお金をもらっている（私は持っていません）....",
      "title": "暗号を使って家を買いたいと思っている人はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "兰博是伟大的，但如果我是诚实的，我真的希望有一天能够拥有一个\n有一天能拥有自己的家。另外，购买房产会升值，而兰博会\n贬值得非常快。\n\n我觉得现在购买房产几乎是遥不可及的，除非你\n有父母的钱（我没有）....",
      "title": "还有人希望用他们的加密货币来买房吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "蘭博是偉大的，但如果我是誠實的，我真的希望有一天能夠擁有一個\n有一天能擁有自己的家。另外，購買房產會升值，而蘭博會\n貶值得非常快。\n\n我覺得現在購買房產幾乎是遙不可及的，除非你\n有父母的錢（我沒有）....",
      "title": "還有人希望用他們的加密貨幣來買房嗎？"
    }
  ]
}