{
  "author": "gorays21",
  "the_new_excerpt": "> NVIDIA today announced that its board of directors declared a four-for-one\n> split of NVIDIA’s common stock in the form of a stock dividend to make stock\n> ownership more accessible to investors and employees.\n> \n> The stock dividend is conditioned on obtaining stockholder approval at the\n>…",
  "original_created_utc": 1621602701,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "> エヌビディアは、本日の取締役会において、エヌビディアの普通株式を1株につき4分割することを宣言しました。\n> 投資家や従業員にとって株式所有をより身近なものにするために、株式配当の形でNVIDIAの普通株式を\n> 投資家や従業員にとって株式所有がより身近なものとなるよう、株式配当の形で\n> \n> この株式配当は、株主総会で株主の承認を得ることが条件となります。\n>...",
      "title": "NVIDIA、1株につき4回の株式分割を発表"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "> 英伟达公司今天宣布，其董事会宣布以股票股利的形式对英伟达公司的普通股进行四比一的分割。\n> 以股票红利的形式对英伟达的普通股进行分割，以使投资者和员工更容易获得股票\n> 让投资者和员工更容易拥有股票。\n> \n> 此次股票分红的条件是，必须获得股东大会的批准。\n>...",
      "title": "英伟达公司宣布进行四比一的股票分割"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "> 英偉達公司今天宣佈，其董事會宣佈以股票股利的形式對英偉達公司的普通股進行四比一的分割。\n> 以股票紅利的形式對英偉達的普通股進行分割，以使投資者和員工更容易獲得股票\n> 讓投資者和員工更容易擁有股票。\n> \n> 此次股票分紅的條件是，必須獲得股東大會的批准。\n>...",
      "title": "英偉達公司宣佈進行四比一的股票分割"
    }
  ],
  "title": "NVIDIA Announces Four-for-One Stock Split",
  "created_utc": 1621608890,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><blockquote>\n<p>NVIDIA today announced that its board of directors declared a four-for-one split of NVIDIA’s common stock in the form of a stock dividend to make stock ownership more accessible to investors and employees.  </p>\n\n<p>The stock dividend is conditioned on obtaining stockholder approval at the company’s 2021 Annual Meeting of Stockholders ― to be held virtually on Thursday, June 3, at 11 a.m. PT ― to increase the number of authorized shares of common stock to 4 billion shares.  </p>\n\n<p>If approval is obtained, each NVIDIA stockholder of record at the close of business on June 21, 2021, will receive a dividend of three additional shares of common stock for every share held on the record date, to be distributed after the close of trading on July 19, 2021. Trading is expected to begin on a stock split-adjusted basis on July 20.</p>\n</blockquote>\n\n<p><a href=\"https://www.marketscreener.com/quote/stock/NVIDIA-CORPORATION-57355629/news/NVIDIA-nbsp-Announces-Four-for-One-Stock-Split-Pending-Stockholder-Approval-at-Annual-Meeting-Set-33321310/\">NVIDIA : Announces Four-for-One Stock Split, Pending Stockholder Approval at Annual Meeting Set for June 3 (Form 8-K) | MarketScreener</a> </p>\n</div><!-- SC_ON -->",
  "score": 2935,
  "permalink": "/r/stocks/comments/nhs698/nvidia_announces_fourforone_stock_split/",
  "subreddit": "stocks",
  "id": "nhs698",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197388322
}