{
  "author": "ThatInternetGuy",
  "original_created_utc": 1632198175,
  "title": "Most Newcomers Don't Know Ethereum Once Crashed from $1400 to $85 in Year 2018",
  "created_utc": 1632223815,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Everyday we see newcomers proudly state that something as solid as Ethereum will never lose 80% of its value but little do they know that Ethereum lost 94% of its value over the course of 11 months in the year 2018.</p>\n\n<p>And it wasn&#39;t until year 2020 that Ethereum started to see a slow recovery. Most newcomers never even witnessed the recovery altogether, because they came after TikTokers started shilling Shiba Inu and SafeMoon right around February 2021.</p>\n\n<p>So what happened in 2020 and 2021 that saw crypto market surging 2000+%? Perhaps it&#39;s the stimulus money handed out ever since. Perhaps people stayed more at home and they had more free time to check out investment opportunities. As the governments begin to taper out the stimulus money, the crypto market starts to slump over. I&#39;m just pointing out this interesting correlation. Would be nice for everyone to discuss why it is and why it is not.</p>\n</div><!-- SC_ON -->",
  "score": 175,
  "permalink": "/r/CryptoCurrency/comments/psbcjn/most_newcomers_dont_know_ethereum_once_crashed/",
  "subreddit": "CryptoCurrency",
  "id": "psbcjn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Everyday we see newcomers proudly state that something as solid as Ethereum will\nnever lose 80% of its value but little do they know that Ethereum lost 94% of\nits value over the course of 11 months in the year 2018.\n\nAnd it wasn't until year 2020 that Ethereum started to see a slow recovery.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "イーサリアムのような堅実なものは80％の価値を失うことはないと、毎日のように新参者が誇らしげに語っています。\nしかし、彼らはイーサリアムが2018年の11ヶ月間でその価値の94%を失ったことをほとんど知りません。\n2018年の11ヶ月間で94％の価値を失ったことを知らないのです。\n\nそして、イーサリアムがゆっくりと回復し始めたのは2020年になってからでした....",
      "title": "ほとんどの新参者は、イーサリアムがかつて2018年の1年間に1400ドルから85ドルまで暴落したことを知らない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们每天都看到新来的人骄傲地说，像以太坊这样稳固的东西不会\n永远不会失去80%的价值，但他们不知道，以太坊在2018年的11个月中失去了94%的价值\n在2018年的11个月里，它的价值损失了94%。\n\n而直到2020年，以太坊才开始出现缓慢复苏....。",
      "title": "大多数新人不知道以太坊曾经在2018年从1400美元暴跌至85美元"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們每天都看到新來的人驕傲地說，像以太坊這樣穩固的東西不會\n永遠不會失去80%的價值，但他們不知道，以太坊在2018年的11個月中失去了94%的價值\n在2018年的11個月裏，它的價值損失了94%。\n\n而直到2020年，以太坊纔開始出現緩慢復甦....。",
      "title": "大多數新人不知道以太坊曾經在2018年從1400美元暴跌至85美元"
    }
  ]
}