{
  "author": "Dwez1337",
  "original_created_utc": 1642515700,
  "title": "Influencers who are Paid to Promote Scam-/Shitcoins deserve to be Sued by Victims, They profited of their Audience being Scammed",
  "created_utc": 1642531335,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Influencers who are paid to promote Scam-/Shitcoins to their audience on Twitter or Instagram deserve to be sued by victims of these rugpulls/ pump and dumps.&lt;/p&gt;\n\n&lt;p&gt;Influencers like Kim Kardashian have promoted Shitcoins like EthereumMax (has nothing to do with the actual Ethereum), which dumped hard following the promotion by said influencers, making random, often young, people, lose all their money.&lt;/p&gt;\n\n&lt;p&gt;Might be more of a controversial opinion, but: They deserve to be sued by every single victim of the scams they promoted, Shitcoins like EthereumMax never had a future, influencers just did a short cash grab, which in reality is funded by the people being scammed after their promotion, making them profit of people losing money&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 303,
  "permalink": "/r/CryptoCurrency/comments/s6yn0o/influencers_who_are_paid_to_promote_scamshitcoins/",
  "subreddit": "CryptoCurrency",
  "id": "s6yn0o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Influencers who are paid to promote Scam-/Shitcoins to their audience on Twitter\nor Instagram deserve to be sued by victims of these rugpulls/ pump and dumps.\n\nInfluencers like Kim Kardashian have promoted Shitcoins like EthereumMax (has\nnothing to do with the actual Ethereum), which dumped hard…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "お金をもらってTwitterで詐欺やクソコインを宣伝しているインフルエンサーは\nまたはInstagramは、これらのラグプル/ポンプアンドダンプの被害者から訴えられるに値します。\n\nキム・カーダシアンのようなインフルエンサーは、イーサリアムマックスのようなクソコインを宣伝してきました。\n実際のイーサリアムとは何の関係もない）、ハードダンピングされた...",
      "title": "詐欺やクソコインを宣伝するためにお金をもらっているインフルエンサーは、被害者から訴えられるのが当然です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "那些在Twitter或Instagram上向其受众宣传骗局/垃圾币的影响者应被这些骗局/抽水机的受害者起诉。\n或Instagram上向他们的受众宣传骗局/垃圾币的影响者理应被这些骗局/抽水马桶的受害者起诉。\n\n像金-卡戴珊（Kim Kardashian）这样的影响者已经推广了EthereumMax（与实际的以太坊无关）这样的狗屎币。\n与实际的以太坊没有任何关系），它倾倒了大量的...",
      "title": "收费推广骗局/垃圾币的影响者应该被受害者起诉，他们从受众被骗中获利。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "那些在Twitter或Instagram上向其受衆宣傳騙局/垃圾幣的影響者應被這些騙局/抽水機的受害者起訴。\n或Instagram上向他們的受衆宣傳騙局/垃圾幣的影響者理應被這些騙局/抽水馬桶的受害者起訴。\n\n像金-卡戴珊（Kim Kardashian）這樣的影響者已經推廣了EthereumMax（與實際的以太坊無關）這樣的狗屎幣。\n與實際的以太坊沒有任何關係），它傾倒了大量的...",
      "title": "收費推廣騙局/垃圾幣的影響者應該被受害者起訴，他們從受衆被騙中獲利。"
    }
  ]
}