{
  "author": "KAX1107",
  "original_created_utc": 1629617582,
  "title": "Elon Musk and Mark Cuban are shilling Doge to hijack crypto and turn it into PayPal. We have to reject this billionaire invasion of crypto",
  "created_utc": 1629632351,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Elon Musk&#39;s goal with every project he ever got into was to hijack it and say he founded it. He got kicked out of PayPal trying to hijack it. He&#39;s still mad about that. He hijacked Tesla and said he founded it. He&#39;s trying to hijack crypto using Doge.</p>\n\n<p>Remember he said exchanges can be second layer for Doge? That&#39;s Robinhood. All this time the smartest minds were trying to scale blockchains and nobody came up with this idea. What a genius!</p>\n\n<p>Everytime he talks about crypto he makes it clear he hasn&#39;t got the first clue about it. Elon wants to turn Doge into PayPal. Mark Cuban is going to be his sidekick.</p>\n\n<p>Poor Doge was at least decentralized when it was a joke. It&#39;s about to become a plaything for a couple of narcissistic billionaires. Now it&#39;s a bad joke in the most evil sense.</p>\n</div><!-- SC_ON -->",
  "score": 167,
  "permalink": "/r/CryptoCurrency/comments/p989e7/elon_musk_and_mark_cuban_are_shilling_doge_to/",
  "subreddit": "CryptoCurrency",
  "id": "p989e7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Elon Musk's goal with every project he ever got into was to hijack it and say he\nfounded it. He got kicked out of PayPal trying to hijack it. He's still mad\nabout that. He hijacked Tesla and said he founded it. He's trying to hijack\ncrypto using Doge.\n\nRemember he said exchanges can be second layer…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "イーロン・マスクの目標は、彼が関わったすべてのプロジェクトをハイジャックして、自分が設立したと言うことでした。\n設立したと言うことでした。彼は、PayPalを乗っ取ろうとして、PayPalから追い出されました。彼はまだ怒っています。\nそのことを今でも怒っています。テスラをハイジャックして、自分が設立したと言った。彼はDogeを使って暗号を乗っ取ろうとしています。\nDogeを使って暗号を乗っ取ろうとしています。\n\n彼は取引所は第2の層になりうると言っていたのを覚えています...",
      "title": "イーロン・マスクとマーク・キューバンは、Dogeを使って暗号をハイジャックし、それをPayPalに変えようとしています。私たちはこの億万長者による暗号への侵略を拒否しなければなりません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "埃隆-马斯克对他所参与的每个项目的目标是劫持它，并说他\n创立了它。他因试图劫持PayPal而被踢出。他现在还在生气\n他还在为这个生气。他劫持了特斯拉，并说他创立了它。他试图劫持\n使用Doge的加密货币。\n\n记得他说过交易所可以成为第二层...",
      "title": "埃隆-马斯克和马克-库班正在为Doge摇旗呐喊，以劫持加密货币并将其变成PayPal。我们必须拒绝这种亿万富翁对加密货币的入侵。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "埃隆-馬斯克對他所參與的每個項目的目標是劫持它，並說他\n創立了它。他因試圖劫持PayPal而被踢出。他現在還在生氣\n他還在爲這個生氣。他劫持了特斯拉，並說他創立了它。他試圖劫持\n使用Doge的加密貨幣。\n\n記得他說過交易所可以成爲第二層...",
      "title": "埃隆-馬斯克和馬克-庫班正在爲Doge搖旗吶喊，以劫持加密貨幣並將其變成PayPal。我們必須拒絕這種億萬富翁對加密貨幣的入侵。"
    }
  ]
}