{
  "author": "olivesnolives",
  "the_new_excerpt": "Want to know why you’re nervous, anxious, and emotionally turbulent when you\nmake that Meme stock YOLO?\n\nBecause you have no fucking clue why you’re investing in it outside of\ngroup-think.\n\nSpoiler alert: virtually none of the companies being spammed on this sub over\nthe last week make any fucking…",
  "original_created_utc": 1623298581,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "なぜ、あなたが緊張したり、不安になったり、感情が乱れたりするのか知りたいですか？\nそのミームストックをYOLOにするとき、なぜ緊張し、不安になり、感情的に乱れるのか知りたいですか？\n\nなぜなら、あなたはなぜそれに投資しているのか、グループ思考の外には全く手がかりがないからです。\nグループ思考の外に\n\nネタバレすると、先週からこのサブサイトに掲載されている企業のうち、事実上どれも\n先週からこのサブに送られてくる会社のどれもがクソ...",
      "title": "$CLFは、このサブではGameStore以来、最もリスクの低い「ミーム」銘柄です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "想知道为什么你会紧张、焦虑、情绪动荡，当你\n使得Meme股票YOLO？\n\n因为你根本不知道你为什么要投资于它，除了\n群体思维。\n\n剧透提醒：在过去的一周里，这个子网站上被吐槽的公司几乎没有任何一家能赚到钱。\n在过去的一周里，几乎没有一家公司能他妈的...",
      "title": "CLF美元是本子自GameStore以来看到的风险最小的 \"备忘录 \"股票。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "想知道爲什麼你會緊張、焦慮、情緒動盪，當你\n使得Meme股票YOLO？\n\n因爲你根本不知道你爲什麼要投資於它，除了\n羣體思維。\n\n劇透提醒：在過去的一週裏，這個子網站上被吐槽的公司幾乎沒有任何一家能賺到錢。\n在過去的一週裏，幾乎沒有一家公司能他媽的...",
      "title": "CLF美元是本子自GameStore以來看到的風險最小的 \"備忘錄 \"股票。"
    }
  ],
  "title": "$CLF is the least risky “meme” stock this sub has seen since GameStore.",
  "created_utc": 1623333686,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Want to know why you’re nervous, anxious, and emotionally turbulent when you make that Meme stock YOLO?</p>\n\n<p>Because you have no fucking clue why you’re investing in it outside of group-think. </p>\n\n<p>Spoiler alert: virtually none of the companies being spammed on this sub over the last week make any fucking money. Go for it, look up their last earnings report and look at how much money they shat down the drain.</p>\n\n<p>That’s why they have short interest in excess of 20% - they’re SHIT COMPANIES.</p>\n\n<p>Trading them is a fucking shot in the dark - sure, it might go up based off retail buy pressure, gamma ramp, or a short getting margin called elsewhere in their account - but if it does YOU GOT LUCKY. </p>\n\n<p>These are shit companies, and guess what happens if you don’t get the market mechanics you’re looking for?</p>\n\n<p>You’re bag holding a shit company.</p>\n\n<p>There are literally two companies with traction on this sub that turn a profit, $UWMC and $CLF.</p>\n\n<p>UWMC looked good months ago, same time RKT did - only since then housing starts have dropped three months in a row, and the imminent collapse of homebuyer sentiment is dinner-table conversation in every suburb your mom has a boyfriend. Share price valuations are forward-looking, and the outlook for UWMC is not overly positive, no matter what the half-assed DD you read here said.</p>\n\n<p><strong>CLF has the exact opposite macro-outlook.</strong> Steel prices have tripled in the past year, with industry overheads remaining largely stable save for the price of Iron Ore, which has also ran up significantly. Fortunately, CLF produces their own Iron Ore, <strong>so they are literally shitting out money as they reap the benefits of vertical integration.</strong> </p>\n\n<p>Steel prices are <strong>the highest they’ve ever been</strong> - nearly every single steel company is going to report their greatest quarter in history this summer. But most importantly:</p>\n\n<p><strong>STEEL PRICES ARE GOING TO STAY HIGH.</strong> Why?</p>\n\n<ul>\n<li><strong>Chinese steel accounts for 15-20%</strong> of the global export market, and they’ve all but stopped exporting - they eliminated Tax rebate incentives for steel producers last month in a bid to keep supply grounded domestically for their own affordable infrastructure stimulus and carbon emissions goals, and have been floating rumors of an export tax the past two weeks. 15% of the worlds export tonnage drying up is HUGE - the leftover demand will NEED to come from somewhere.</li>\n</ul>\n\n<p>Additionally, the 2022 Beijing olympics are around the corner, and who remembers what china did in an effort to combat smog prior to the 2008 games? They shuttered steel production in Beijing/Hebei, one of the largest steel producing provinces. Less Chinese steel = higher ex-China prices.</p>\n\n<ul>\n<li><p><strong>Nations using infrastructure-as-stimulus post-covid.</strong> Bidens infrastructure bill is coming down the pipe. China issued a $500 Billion package as well, and they’re being floated in parliaments across South America, Asia, and Europe as we speak.</p></li>\n<li><p><strong>Industry consolidation.</strong> Competition and supply gluts are what eventually kill commodity runs - but the US and European steel industries have consolidated into significantly fewer hands since the last steel bull run. The current CLF is the product of the 2020 acquisitions of AK Steel and ArcelorMittal USA, taking two independent drivers off the table.</p></li>\n</ul>\n\n<p><strong>In addition to the boatload of macroeconomic tailwinds the steel industry writ-large is experiencing, \nthere are also CLF specific advantages.</strong></p>\n\n<ul>\n<li><p><strong>GOES.</strong> CLF is the sole American producer of Grain-Oriented Electric Steel (GOES), which is necessary for transformers, generators, and other grid elements necessary for the transition to renewables.</p></li>\n<li><p><strong>Vertically Integrated.</strong> Discussed earlier, CLF is equal parts Iron Ore Miner and Steel producer.</p></li>\n<li><p><strong>High short interest.</strong> on the order of 20%. I truly do not understand the shorts thesis AT ALL. Yes CLF is leveraged due to recent acquisitions, but they are printing money. Literally printing it.</p></li>\n</ul>\n\n<p><strong>For perspective: CLF is an $11 Billion company that is projected to do $4 Billion+ in EBITDA this year. AMC is a $25 Billion company that did $0.77 Billion EBITDA in 2019, PRE-Pandemic.</strong></p>\n\n<p>I trimmed my CLF for other steel companies over the last couple weeks and am regretting it now that WSB is finally aware of the shares on loan %.</p>\n\n<p>CLF’s fair valuation relative to CURRENT industry peers based on forward EBITDA, book value, and managements forecasts on debt pay down would put CLF squarely in $30-40 / share range. That’s not even counting continued sector growth over the coming year, that’s just <strong>fair value right now.</strong></p>\n\n<p>Fair value returns at 50%-100% even BEFORE meme/squeeze returns is a hell of a lot safer of a bet than UWMC, BB, AMC, GME, CLNE, CLOV, or whatever the hell else ill-advised prayer play I’ve seen here the past week.</p>\n\n<p><strong>TLDR: CLF is pretty much the only WSB short interest play with limited fundamental downside; they’re shitting money, and have enough macroeconomic tailwinds to entertain a supply chain logistics class for a semester.</strong></p>\n\n<p>If you think it’s late for CLF you’re probably not aware of the industry landscape or the company’s footing in it.</p>\n\n<p>Edit: </p>\n\n<p>Positions: </p>\n\n<p>CLF 10/15 18c </p>\n\n<p>CLF 10/15 20c</p>\n\n<p>As well as Various other MT and TX September and later calls.</p>\n</div><!-- SC_ON -->",
  "score": 1635,
  "permalink": "/r/wallstreetbets/comments/nweryx/clf_is_the_least_risky_meme_stock_this_sub_has/",
  "subreddit": "wallstreetbets",
  "id": "nweryx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009745416
}