{
  "author": "dahasn",
  "the_new_excerpt": "Because I work with computers all my friends are thinking that I'm a crypto\nmaster. But when they ask me about it I usually say I don't have any crypto, I\ndon't know anything about it and I can't tell them if they should buy or not.\nThey bought crypto anyway and tried to convince me that they are…",
  "original_created_utc": 1621779659,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はコンピュータを扱う仕事をしているので、友人たちは私が暗号解読者だと思っています。\nマスターだと思っています。しかし、そのことを聞かれると、たいていは「暗号は持っていないし、何も知らない。\n何も知らないし、買うべきかどうかもわからないと言います。\nしかし、彼らはとにかく暗号を購入し、私を説得しようとしました...。",
      "title": "ヶ月前、友人が暗号を買うべきかどうか尋ねたとき、私はいつも暗号を所有していないと答えていました。そうしておいてよかったと思います。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因为我从事计算机工作，我所有的朋友都认为我是一个加密货币。\n大师。但当他们问我这个问题时，我通常会说我没有任何加密货币，我对它一无所知，我不能告诉他们是否应该购买。\n我对它一无所知，我不能告诉他们是否应该购买。\n他们还是买了加密货币，并试图让我相信他们是...",
      "title": "几个月前，当我的朋友问他们是否应该购买加密货币时，我总是回答说我不拥有任何加密货币。我很高兴我这么做了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因爲我從事計算機工作，我所有的朋友都認爲我是一個加密貨幣。\n大師。但當他們問我這個問題時，我通常會說我沒有任何加密貨幣，我對它一無所知，我不能告訴他們是否應該購買。\n我對它一無所知，我不能告訴他們是否應該購買。\n他們還是買了加密貨幣，並試圖讓我相信他們是...",
      "title": "幾個月前，當我的朋友問他們是否應該購買加密貨幣時，我總是回答說我不擁有任何加密貨幣。我很高興我這麼做了。"
    }
  ],
  "title": "Months ago when my friends asked if they should buy crypto, I always answered that I don't own any crypto. I'm glad I did that.",
  "created_utc": 1621801834,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Because I work with computers all my friends are thinking that I&#39;m a crypto master. But when they ask me about it I usually say I don&#39;t have any crypto, I don&#39;t know anything about it and I can&#39;t tell them if they should buy or not. They bought crypto anyway and tried to convince me that they are all going to be rich as fuck.</p>\n\n<p>Right now in this crash they are searching someone to blame. They hate each other, they went crazy, they are posting shit about crypto and are always telling me that they made a huge mistake and that they will sell everything soon. They can&#39;t handle to dip.</p>\n\n<p>I have crypto and keeping it a secret was the best idea I had. If not those guys would have started to blame me for everything.</p>\n</div><!-- SC_ON -->",
  "score": 2125,
  "permalink": "/r/CryptoCurrency/comments/nj8psq/months_ago_when_my_friends_asked_if_they_should/",
  "subreddit": "CryptoCurrency",
  "id": "nj8psq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197385270
}