{
  "author": "ultron290196",
  "original_created_utc": 1626911723,
  "title": "Imagine if Instagram, Facebook, Twitter created their own cryptocurrencies, everyone would go mad! Reddit has done it, yet everyone is sleeping on it.",
  "created_utc": 1626978916,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Imagine if these mainstream social media platforms created their own native tokens that have actual financial value and can be used by their users to tip each other and is generated by proof of engagement. Hmmm... Sounds familiar?</p>\n\n<p>Bingo! We&#39;ve reddit issued tokens such as moons, bricks and donuts. Been more than a year since existence and yet the internet as a whole is sleeping on it. Actually forget the whole internet, our own subreddit is sleeping on it. Less than 100k vaults have been opened when we have more than 3.2 million users in this subreddit. </p>\n\n<p>Maybe it&#39;s Reddit&#39;s fault for not promoting these projects enough. However, if you&#39;re reading this and still haven&#39;t set up your vaults. Please do so and earn your free crypto. </p>\n\n<p>They will blow up one day.</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/op27tx/imagine_if_instagram_facebook_twitter_created/",
  "subreddit": "CryptoCurrency",
  "id": "op27tx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Imagine if these mainstream social media platforms created their own native\ntokens that have actual financial value and can be used by their users to tip\neach other and is generated by proof of engagement. Hmmm... Sounds familiar?\n\nBingo! We've reddit issued tokens such as moons, bricks and donuts.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もし、これらの主流のソーシャル・メディア・プラットフォームが、実際の金銭的価値を持ち、ユーザーにチップを与えることができる\n実際に金銭的価値のあるトークンを作成し、ユーザーがお互いにチップを払うことができたらどうでしょう。\nエンゲージメントの証明によって生成されます。ふむふむ...。聞き覚えがありませんか？\n\nそうですね。redditでは、月、レンガ、ドーナツなどのトークンを発行しています....",
      "title": "もし、InstagramやFacebook、Twitterが独自の暗号通貨を作ったらと想像すると、誰もが狂喜するでしょう。Redditはそれをやってのけましたが、誰もがそれを見て眠っています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "想象一下，如果这些主流社交媒体平台创建了他们自己的本地\n有实际金融价值的代币，并且用户可以用它来支付小费。\n并通过参与证明产生。嗯... 听起来很熟悉？\n\n是的。我们已经reddit发行的代币，如月亮、砖头和甜甜圈....",
      "title": "想象一下，如果Instagram、Facebook、Twitter创造了他们自己的加密货币，每个人都会疯掉! Reddit已经做到了，然而大家都在睡觉。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "想象一下，如果這些主流社交媒體平臺創建了他們自己的本地\n有實際金融價值的代幣，並且用戶可以用它來支付小費。\n並通過參與證明產生。嗯... 聽起來很熟悉？\n\n是的。我們已經reddit發行的代幣，如月亮、磚頭和甜甜圈....",
      "title": "想象一下，如果Instagram、Facebook、Twitter創造了他們自己的加密貨幣，每個人都會瘋掉! Reddit已經做到了，然而大家都在睡覺。"
    }
  ]
}