{
  "author": "Outrageous-Speeed",
  "original_created_utc": 1632150926,
  "title": "How do I tell my girlfriend I think she should try to lose some weight?",
  "created_utc": 1632163897,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My girlfriend is... sensitive to say the least. Ever since we started dating 5 years ago she&#39;s slowly gotten bigger and bigger over time. I never minded but now it&#39;s to the point where she gets winded when walking up a flight of stairs. Also, it&#39;s honestly starting to effect my attraction to her. Don&#39;t get me wrong I love her to death but I seriously think it would be better for the both of us if she lost a few pounds</p>\n\n<p>Edit: I have no interest in your opinion of me or my relationship. If you&#39;re here to call me shallow to to say &quot;just dump her&quot;, please just find another post to comment on. On the other hand, thank you to everyone who gave me great advice and even better things to think about.</p>\n</div><!-- SC_ON -->",
  "score": 165,
  "permalink": "/r/TooAfraidToAsk/comments/prwxiv/how_do_i_tell_my_girlfriend_i_think_she_should/",
  "subreddit": "TooAfraidToAsk",
  "id": "prwxiv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My girlfriend is... sensitive to say the least. Ever since we started dating 5\nyears ago she's slowly gotten bigger and bigger over time. I never minded but\nnow it's to the point where she gets winded when walking up a flight of stairs.\nAlso, it's honestly starting to effect my attraction to her.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の彼女は、控えめに言っても繊細です。5年前に付き合い始めて以来\n年前に付き合い始めて以来、彼女は時間とともに徐々に大きくなってきました。私は気にしていませんでしたが\n今では階段を上るときに息が切れるほどになってしまいました。\nまた、正直なところ、彼女に対する私の魅力にも影響を与え始めています....",
      "title": "恋人に「痩せたほうがいい」と伝えるには？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的女朋友是......至少可以说是敏感的。自从我们5年前开始约会以来\n她就慢慢地变得越来越大了。我从未介意过，但\n现在已经到了走楼梯时都会上气不接下气的地步。\n此外，说实话，这已经开始影响我对她的吸引力....。",
      "title": "我如何告诉我的女朋友，我认为她应该试着减掉一些体重？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的女朋友是......至少可以說是敏感的。自從我們5年前開始約會以來\n她就慢慢地變得越來越大了。我從未介意過，但\n現在已經到了走樓梯時都會上氣不接下氣的地步。\n此外，說實話，這已經開始影響我對她的吸引力....。",
      "title": "我如何告訴我的女朋友，我認爲她應該試着減掉一些體重？"
    }
  ]
}