{
  "author": "TarkovReddit0r",
  "original_created_utc": 1639165489,
  "title": "How did you go from “100k end of year” to “I’m not buying the dip this is the bear market”???",
  "created_utc": 1639171981,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Seriously this blows my mind! How are there so many people believing in the bull run when bitcoin was going from 60k to 69k but now I still see so many selling and complaining that “we enter the bear market”&lt;/p&gt;\n\n&lt;p&gt;What kind of mindset is this? Wasn’t it you that complained for months that “I wish I bought the dip”? Well guess what now it’s the perfect time! If you truly believed in crypto hitting another all time high - how can you think it will go further down from the 47k we are at right now? Or even worse - how can people sell NOW when it’s already so far down?\nSeriously when people here were saying “buy high sell low” they didn’t meant it literally. It’s a joke. Don’t be the clown that actually does this.&lt;/p&gt;\n\n&lt;p&gt;I yolo’d my last savings into the recent dip and wanna hear something crazy? I already made profit! Not that I sell but pretty good for such a “bear market” right ?&lt;/p&gt;\n\n&lt;p&gt;Now this is not a financial advice but I’ll promise you that me and the boys who bought this dip will drive behind you with our lambo for weeks if we catch you complaining “oh man I wish I bought the end of 2021 dip”.&lt;/p&gt;\n\n&lt;p&gt;“Oh but what does this guy know about btc” yea true I don’t know anything! But do you know who I trust ? The over 90 richest whales that HAVEN’T SOLD A SINGLE COIN SINCE ATH!\nThey keep buying every dip. Every. Single. One.&lt;/p&gt;\n\n&lt;p&gt;Edit: I know this is not all of you guys. I just hope this helps some people with their mental health when they struggle and consider selling right now driven by emotions :)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 294,
  "permalink": "/r/CryptoCurrency/comments/rdgsyg/how_did_you_go_from_100k_end_of_year_to_im_not/",
  "subreddit": "CryptoCurrency",
  "id": "rdgsyg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Seriously this blows my mind! How are there so many people believing in the bull\nrun when bitcoin was going from 60k to 69k but now I still see so many selling\nand complaining that “we enter the bear market”\n\nWhat kind of mindset is this? Wasn’t it you that complained for months that “I\nwish I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "マジでこれには驚かされました どうしてこれほど多くの人が強気を信じているのでしょうか？\nビットコインが6万円から6万9千円になったとき、多くの人が売りに走りました。\n弱気市場に入った」と文句を言う。\n\nどういう考え方なんだろう？と何ヶ月も愚痴っていたのは、あなたではありませんか？\n願わくば...",
      "title": "どうやって「年末に10万円」から「ディップは買わない、これはベアマーケットだ」になったんですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "说真的，这让我大吃一惊! 怎么会有这么多的人相信牛市？\n当比特币从6万涨到6.9万的时候，怎么会有这么多人相信牛市，但现在我仍然看到这么多卖家\n并抱怨说 \"我们进入了熊市\"\n\n这是什么样的心态？难道不是你抱怨了好几个月 \"我\n希望我...",
      "title": "你是如何从 \"年底10万 \"到 \"我不买跌停板，这是熊市 \"的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "說真的，這讓我大喫一驚! 怎麼會有這麼多的人相信牛市？\n當比特幣從6萬漲到6.9萬的時候，怎麼會有這麼多人相信牛市，但現在我仍然看到這麼多賣家\n並抱怨說 \"我們進入了熊市\"\n\n這是什麼樣的心態？難道不是你抱怨了好幾個月 \"我\n希望我...",
      "title": "你是如何從 \"年底10萬 \"到 \"我不買跌停板，這是熊市 \"的？"
    }
  ]
}