{
  "author": "jratcliff63367",
  "the_new_excerpt": "My bitcoin journey...so far…\n\nIn December 2012 a friend of mine gave me a single bitcoin as a gift. Bitcoin\nwas worth $13 at the time. My friend had done a little bit of bitcoin mining so\nhe had some from that.\n\nI briefly looked into bitcoin, very briefly, and I dismissed it as just another\nkind of…",
  "original_created_utc": 1609532409,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我的比特币之旅.到目前为止，…\n\n2012年12月，我的一个朋友送给我一枚比特币作为礼物。比特币\n当时价值13美元。我的朋友做了一点比特币挖掘，所以\n他从那里吃了一些。\n\n我简单地看了一下比特币，非常简短地，我把它当作另一个\n一种…",
      "title": "我从2013年到2021年的比特币之旅"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的比特幣之旅.到目前爲止，…\n\n2012年12月，我的一個朋友送給我一枚比特幣作爲禮物。比特幣\n當時價值13美元。我的朋友做了一點比特幣挖掘，所以\n他從那裏吃了一些。\n\n我簡單地看了一下比特幣，非常簡短地，我把它當作另一個\n一種…",
      "title": "我從2013年到2021年的比特幣之旅"
    }
  ],
  "title": "My bitcoin journey from 2013 to 2021",
  "created_utc": 1609576719,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My bitcoin journey...so far…</p>\n\n<p>In December 2012 a friend of mine gave me a single bitcoin as a gift. Bitcoin was worth $13 at the time. My friend had done a little bit of bitcoin mining so he had some from that.</p>\n\n<p>I briefly looked into bitcoin, very briefly, and I dismissed it as just another kind of game currency, like world of warcraft gold, and I didn’t take it seriously.</p>\n\n<p>A few months later that $13 bitcoin my friend had given me was worth $72 after the beginning of the first bull run of 2013.</p>\n\n<p>This was my first experience in life holding an ‘investment’ and having it grow by like 5x in value. I had literally never experienced anything like that in my life, having virtually no experience as an investor other than contributing to a 401k and some rando fund.</p>\n\n<p>So, I created a Coinbase account, transferred the one bitcoin my friend had given me, and then I sold it and used the money to go out for a nice dinner.</p>\n\n<p>This would have been the end of my bitcoin career except that the experience, of holding an investment and watching it go up in value, was such a new one that I kind of started messing around with it in 2013.</p>\n\n<p>From around April of 2013 until November I was buying bitcoin. By November the price of bitcoin had risen to $350 which was a substantial return on my investment over a short period of time (my average buy price was around $80). As I was new to any kind of speculative investing, I was constantly asking my friends who had large investment portfolios for advice. Their advice, universally, was that I was an idiot for not selling all of it immediately. They were constantly on me about it and, by that point, I had invested over $15,000 in bitcoin which, at the time, was a lot of money to me and my family; especially to have invested in something that seemed ‘not entirely real’ and extremely high risk.</p>\n\n<p>So, due to peer pressure, in November of 2013 I sold 50 bitcoin at around $350 apiece. This allowed me to take back my ‘original investment’ so no matter what, the remaining bitcoin I held would always be pure profit. I took the proceeds and bought myself the nicest sports car I had ever owned, a 1996 Acura NSX-T (the bitcoin I sold didn’t pay for the entire car but it helped).</p>\n\n<p>Shortly after I sold those bitcoin the price skyrocketed and briefly touched $1,000 and then MtGox happened and it all collapsed.  During this time period I started studying bitcoin seriously. I downloaded and reviewed the source code to the point that I felt like I had a reasonable understanding of it. I started writing my own software to analyze the bitcoin blockchain so I could better understand it as well.</p>\n\n<p>By this time I truly understood how revolutionary the invention was, but I always felt that it was at risk from government regulation or just outright being declared illegal.</p>\n\n<p>Another result of my having sold those bitcoin at a profit, was a realization on my part that I should take investing more seriously and also diversify what I was investing in.</p>\n\n<p>Around that same time I purchased two ounces of physical gold. I figured that for the same reason I was interested in bitcoin as sound money, I should also hold some physical gold too.  So, I bought two ounces of gold at around $1,300 an ounce each; so a total of $2,600 which at the time could have bought me about seven bitcoin, which, today, would be worth $200k while the two ounces of gold (I still have to this day) are only worth $3,800.</p>\n\n<p>One of the most significant changes in my life at this same exact time, which I 100% credit to my friend Billy giving me that first bitcoin, was that I decided to start investing in the stock market. Until November of 2013 I had never directly owned a single share of stock in my life. I only had contributed to a 401k which offered me just some generic retirement fund which made barely any money at all.</p>\n\n<p>Had I not ‘gotten into’ bitcoin, I never would have ‘gotten into’ stock trading. Had I not learned the importance of holding, I would not have applied that to my stock holdings as well. Had I not learned about markets, and how markets are just reflections of the emotion and feelings of the investors, I would have never become such a confident investor and trader.</p>\n\n<p>The point here is that the biggest benefits I got from bitcoin were actually when I applied lessons learned from it onto markets in general. Bitcoin is a serious bootcamp in learning how markets behave. Raw, unfiltered, running 24/7 on pure hype and speculation. We have all heard about how stock traders moved over to bitcoin to translate their knowledge to this new market but, for some of us, it went the other way. We took the lessons we learned from the bitcoin markets and then applied them to speculative stocks in the stock market such as TSLA for example.</p>\n\n<p>Not much happened with me and bitcoin during the years 2014 and 2016. I pretty much just held bitcoin. During that time I was also trading stocks in the stock market and began taking over control of my entire company sponsored 401k and began trading it. I utilized TSLA, GBTC, and other speculative assets to churn a lot of profit. I started out with barely $100k in my 401k and managed to grow it each year with returns far, far, exceeding the market.  I have now managed to grow my retirement accounts large enough that I should be able to retire comfortably without needing a single satoshi of bitcoin to back it up.</p>\n\n<p>Now, had I simply bought TSLA and GBTC, held it, and never touched it, I would have realized much greater returns, but since these were my retirement accounts I was much more cautious and I tried to limit the size and time I would spend exposed to the volatility of any single asset.</p>\n\n<p>In January 2017 bitcoin hit $1,000; three years for it to retake the all-time-high from the MtGox days. My bitcoin was now worth a lot of real-world money. At that time my two adult children had a substantial amount of student loan debt; over $100k between the two of them. And, here I was, sitting on more than that from my silly bitcoin investment.</p>\n\n<p>So, I made a big decision to sell enough bitcoin to pay off my kid’s student loans. This truly was life changing for them. Student loans are extremely predatory and are designed to keep a young person in shackles for a lifetime.  Being able to do this for my kids meant a great deal to me.</p>\n\n<p>This was the second time I sold a large chunk of bitcoin at once; the first being at $350 in November of 2013 to buy a sports car.</p>\n\n<p>In November of 2017 bitcoin was really on a tear. It hit $7,000 which was just mind boggling to me. Also, in November of 2017, Tesla announced the new Tesla Roadster. I had just recently purchased the original Tesla Roadster and I was in love with the car. To get a reservation for the new Tesla Roadster required a deposit of $50k.  Now, I was sitting on a whole lot more than that in bitcoin. And I had now been holding it for over four years. I figured, I would get just as much enjoyment fantasizing about my new sports car as I would watching my bitcoin sit in cold storage. So, I sold six bitcoin at around $7k apiece to pay for the deposit on the new Tesla Roadster.</p>\n\n<p>A little math comparison:</p>\n\n<p>Had I held those six bitcoin until today, they would now be worth $174,000.  But, if I had bought shares of TSLA instead it would be worth roughly $577,000. There’s a lesson to be had here; and it is that you can make more money trading a speculative stock than you can bitcoin if you find the right stock at the right time.</p>\n\n<p>At the all-time-high price the bitcoin I held was worth almost three million dollars. This was enough money to retire for life with a really nice lifestyle even after taxes. The price was only that high for a very brief period of time. I wanted to sell a chunk at those high price levels, but I also wanted to wait until the new tax year. By the time 2018 came, the bitcoin price started going down and I thought, no point in selling now, wait until it goes back up again. Then it kept going down. And kept going down. And kept going down. Until Thanksgiving weekend 2018 when it crashed to nearly $3,000. And I watched my ‘paper profit’ slip away from enough to retire for life down to, not nearly enough to accomplish anything like that.</p>\n\n<p>I held through this entire period of time, the whole time fully expecting bitcoin could well go to zero. This was the hardest holding period of my time with bitcoin.</p>\n\n<p>So, I just stuck with it and kept holding. In the summer of 2019 the price of bitcoin finally started going up again. It got above $10k and then started climbing towards $14k. I was very excited with this development and I was enjoying watching my bitcoin paper-profit grow.</p>\n\n<p>Then, a series of events happened in a very short period of time which caused me to lose my nerve. It wasn’t just one thing. It was a collection of them. During a single week period in the summer of 2019 the president of the United States made negative comments about bitcoin. Then the treasury secretary made extremely hostile remarks about bitcoin. Then the congress held hearings about bitcoin with the usual fear and demonization that comes with it.  Then the IRS started sending out nasty letters to everyone who had cryptocurrency holdings.</p>\n\n<p>Then, coinciding with this series of events, the price of bitcoin started crashing. From $13k it started falling. It started dropping below $10k and was heading lower still.  The letter from the IRS, the comments from the government, and now the price dropping reminding me of that fateful Thanksgiving weekend of 2018, and I was like ‘not again’.  </p>\n\n<p>Another thing that happens when you are a really long term holder without taking profit is that the bitcoin wealth sometimes doesn’t ‘seem real’. Until you have successfully transferred it to an exchange, executed a sell order, and had that money hit your checking account in the form of fiat that you can use to pay off debt or make other investments, it just doesn’t always ‘seem real’. You can even get paranoid. What happens if I lose my keys? What happens if I make a mistake? What happens if I get hacked?</p>\n\n<p>Another thing that was happening in my life at this same time is that I had made the decision to build a new house. With my bitcoin, I was going to be able to build my house and also be able to retire in a couple of years (I am 59 years old so it&#39;s not like I&#39;m trying to retire obscenely early). I started imagining what would happen if my bitcoin became worthless. I realized that I wouldn’t be able to retire. Yes, I could still finish my house but I might have to keep working for another five years or more, and I really didn’t want to do that.</p>\n\n<p>All of these things together led me into a panic and for the first time I ‘panic sold’ some of my bitcoin. I ended up selling half of my bitcoin and successfully transferred the proceeds to pay off debt and diversify into other investments. </p>\n\n<p>I’ve had a lot of time to think about it, and at the end of the day I don’t regret the decision. It was the right decision at that time. Also, the price of bitcoin did continue to drop after that, so I did after-all capture profit. And, with the money I received from selling half of my bitcoin, I paid off two mortgages and guaranteed that I could complete my new house and still retire on my original schedule.</p>\n\n<p>There was another side effect from that decision as well. I had always planned to take profit whenever bitcoin reached it’s previous all time high around $20k. I ended up taking profit at $10k instead of $20k, but it was always my intention to take profit at some point.</p>\n\n<p>So, the bitcoin I have remaining, I have felt no temptation to sell even at the current price levels. In fact, I have no intention or need to sell any of my bitcoin at all. I can now hold forever. I never have to ‘take profit’ again. Also, if I woke up tomorrow and all of my bitcoin was gone, it would not affect my life at all. I have a sufficiently diversified portfolio that I would still be fine without it.  All of this was possible because I did take profit before. So, the point here, is that sometimes taking profit at the right time can make holding your remaining bitcoin forever much easier.</p>\n\n<p>That said, I do plan to sell some bitcoin. Wealth that you never use is kind of pointless if you ask me. In retirement your budget is critical. And the single most important retirement budget item is also the easiest one to eliminate. One of the most important things to me in retirement is travel. But, your travel budget is the single most flexible item. Your travel budget could be limited to places you can drive in your car and stay somewhere cheap. Or, it could be a first class trip around the world staying in five star hotels. The budget for the first is measured in hundreds of dollars and the latter in tens of thousands. So, I have decided that my travel budget in retirement will come from bitcoin. The more bitcoin is worth, the better a vacation I can take each year. The less it is worth, well, I guess it’s the local campground.</p>\n\n<p>As of today I hold about 30% of my entire investment portfolio in bitcoin; and I think that is quite enough for now. If I ever reached the point where bitcoin was about 60% of my portfolio again, I might sell some to diversify. But, for now, I’m back to just long term holding.</p>\n\n<p>Everyone’s journey in bitcoin is different. I never really messed with alt-coins. Not that I didn’t try a couple of times, but I quickly realized that anytime I bought an alt-coin I was just betting that it would do better than bitcoin and, frankly, I never believed that to be true. I only tried trading a couple of times, and I quickly realized that is just a way to end up with less bitcoin than you started with, so I stuck with holding. I most certainly never did any leveraged trading at all.</p>\n\n<p>What I have learned is that it’s really, really, hard to hold long term. And, even though I constantly think about how much money I would have had I kept all of my bitcoin or made better trading decisions, the bottom line is that I came out way ahead of the game which is more than a lot of people can say.</p>\n\n<p>I guess the takeaway lessons of my experience boil down to:</p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>Don’t trade, just hold</li>\n<li>Don’t ever, ever, ever, sell all of your bitcoin. If your bitcoin is worth two million, then sell one million and keep the rest. But do not sell it all! </li>\n<li>Take the lessons you learn from bitcoin and apply them to investing in general</li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 172,
  "permalink": "/r/Bitcoin/comments/koi8lx/my_bitcoin_journey_from_2013_to_2021/",
  "subreddit": "Bitcoin",
  "id": "koi8lx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610100740958
}