{
  "author": "FedeBuccs",
  "original_created_utc": 1635286825,
  "title": "DYOR of Harmony One from a noob perspective",
  "created_utc": 1635359475,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<h1>WARNING: this is a noob post, trying to get better and to learn. It does not contain the best information, i just hope that a noob like me can actually start to DYOR. Plus, English isn&#39;t my native language, sorry for typos.</h1>\n\n<p><strong>Premise:</strong></p>\n\n<p>I got in the crypto world <strong>a month ago</strong>, precisely during the Evergrande FUD; one week before the Evergrande thing exploded I was already informing myself about cryptocurrency. As a young Italian, I think that crypto is one of the best investments you can do, since banks basically give you almost zero in return.I think that if you can control yourself and invest even only in BTC and ETH, you can have good profits in the future. If you put 100 euros in BTC, chances are you go at least 150 euros, that’s a 50% increase vs a 0.10% of what you can get from a bank.Now, <strong>the crypto world is overwhelming with information</strong> and one of the main things I’ve learned is that you must  <strong>DYOR</strong>. Everyone talks about DYOR, talks about what to see, <strong>but how do you even start as a newbie?</strong> What are the things i should care about?I’ll try to DYOR following <a href=\"/u/dragondude4\">u/dragondude4</a> post (link: <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/owihb6/everyone_always_says_dyor_but_never_shows_you_how/\">https://www.reddit.com/r/CryptoCurrency/comments/owihb6/everyone_always_says_dyor_but_never_shows_you_how/</a> ) but, I’ll actually do the DYOR basically from basically live.</p>\n\n<h1>First of all, what the f is Harmony One?</h1>\n\n<p>Let’s see their page: <a href=\"https://www.harmony.one/\">https://www.harmony.one/</a>The site is gorgeous. It’s already a positive thing. Scrolling to the bottom, we see the news feed; nice, you can get fast updates with that, even if they’re from August.</p>\n\n<p>We want to have <strong>a nice understanding of how this blockchain works</strong>. What i don&#39;t want is to actually go way too deep with the math stuff, just <strong>a basic function of the blockchain</strong>. It seems hard, but it&#39;s not that hard since i guess developers want people to know how their project works.</p>\n\n<h1>WHITE PAPER</h1>\n\n<p>(source: <a href=\"https://harmony.one/pdf/whitepaper.pdf\">https://harmony.one/pdf/whitepaper.pdf</a> )</p>\n\n<p>We have a brief introduction, Harmony One is an open and fast blockchain, wait, <strong>how fast?</strong> And <strong>what does open mean</strong>? For the speed, Harmony One claims that <strong>a transaction takes 2 seconds</strong>. What does the market offer though? Do we have other contenders?</p>\n\n<p><em>Google google google</em></p>\n\n<p>It seems that <strong>ONE is the fastest blockchain</strong>. For comparison:</p>\n\n<ul>\n<li><strong>BTC:</strong> 30 - 60m</li>\n<li><strong>ADA</strong>: 10m</li>\n<li><strong>ETH</strong>: 25s</li>\n<li><strong>Stellar</strong>: 4s</li>\n<li><strong>SOL</strong>: 2.5s</li>\n</ul>\n\n<p>(source: <a href=\"https://www.makeuseof.com/bitcoin-is-slow-what-is-the-fastest-cryptocurrency/\">https://www.makeuseof.com/bitcoin-is-slow-what-is-the-fastest-cryptocurrency/</a> )</p>\n\n<p>So, from the first page, we get that the problem here in the crypto world is the <strong>tps</strong> and <strong>scalability</strong>; the first is highly dependable on the second.<em>Ex.Eth, has huge fees and it&#39;s slow.</em></p>\n\n<p><em>Wait, what the hell is</em> <strong><em>scalability</em></strong>*?* From what I’ve understood, <strong>scalability refers to how the blockchain react to a great influx of transactions</strong>. So, ETH has not a good scalability because if you give him a lot of transactions, the blockchain will slow down and ask for high gas prices.<strong>No bueno</strong>, ‘cause If I have to pay 50$ of fee on a 10$ and lose money, then I’d rather buy DOGE at ATH. We shall see what happens with ETH 2.0.</p>\n\n<p>Harmony ONE proposes a <strong>sharding-based blockchain</strong> to increase scalability, something Ziliqa (another coin) tried without success.</p>\n\n<p><em>Google google on sharding</em></p>\n\n<p><strong>Sharding</strong> is basically <strong>divide-et-impera</strong>, split stuff in smaller things and work them out instead of working a whole block. Why transport a whole tree when you can chop it in pieces?</p>\n\n<p>&#x200B;</p>\n\n<h1>Consensus mechanism</h1>\n\n<p>&#x200B;</p>\n\n<p>Consensus is basically: <strong>how do I trust these guys to validate my block</strong>? Well, we know there are mainly two types of consensus: <strong>PoW</strong> (proof of work, Bitcoin, miners) and <strong>PoS</strong> (proof of stake, ETH 2.0/ALGO, validators). In the first, you basically <strong>pay a miner some fee</strong> to verify the transaction of your block while in the second method <strong>people stake money to be able to validate</strong> parts of blockchain (dummy definition).</p>\n\n<p>Of course, Harmony uses a consensus protocol I’ve never heard of. First, let&#39;s talk of the consensus mechanism which Harmony One took inspiration: <strong>PBFT (Practical Byzantine Fault Tolerance).</strong></p>\n\n<p><strong>Dummy explanation:</strong></p>\n\n<p>We have a <em>leader</em> and then some <em>soldiers</em>. First round: preparation.</p>\n\n<p>Leader says ‘<em>’hey,</em> <strong><em>I think x</em></strong>*’*<strong><em>’</em></strong>.  Soldiers then whispers their take on the leaders proposal.</p>\n\n<p>Now, first question. <strong>How do I trust this process and the vote?</strong> There could be bad guys in the vote. Well, lets say out of 10 people, 2 are bad and corrupt people. We only pass to the next phase when <strong>atleast 5 good people</strong> (<strong>2x+1</strong> is the formula, where <strong>x is the number of the bad persons</strong>) have voted <strong>AND</strong> in total, we have <strong>7 votes (3x+1)</strong>.You <strong>reiterate</strong> this process until we see that the vote outcome of 2x+1 is a <strong>trend</strong>. The problem is that if there are too many soldiers, reiterating the process is a long one. Think about having a legion of soldiers whispering their vote and going through the same stuff again.</p>\n\n<p><strong>Harmony</strong> said in the whitepaper: fuck that, more math, and add more letters to our consensus mechanism. <strong>The FBFT (Fast Byzantine Fault Tolerance)</strong> basically should work like this:Leader says ‘’<em>hey, I think x, I give you a piece of paper, vote on it</em>’’. Soldiers vote and <strong>the leader collects the papers</strong>.Leader aggregates votes and basically shouts so loud, everyone knows the end result. So basically, shouting works because we have a vote and everybody knows the outcome. We shall not whisper and vote 10 times again. Hurray! This process is way faster than the first.</p>\n\n<p><strong>Now, who is our leader (validator) in this block / shard?</strong> Well, out leader is elected through <strong>PoS</strong> (proof-of-stake). To sum up PoS with the leader thing, i<strong>f the leader (that stakes money to be one) passes or tries to pass an outcome of the vote that isn’t the one the soldiers decided, the leader loses all the money he staked</strong>. So yes, the more you stake, the more you lose if you try to be dodgy.</p>\n\n<p>&#x200B;</p>\n\n<h1>Sharding</h1>\n\n<p>&#x200B;</p>\n\n<p>RIP me, now we get to the central part of Harmony, <strong>sharding</strong>.</p>\n\n<p>Let’s take a breath, we know <strong>sharding is just dividing the problem in smaller groups</strong>.So uhm, basically we have something called <strong>state sharding</strong>. You break the blockchain in little pieces and <strong>these pieces still have info of the original block</strong>. Harmony got inspired by this sick solution: <strong>you shard the blockchain</strong>, <strong>then you assign a number to this shard</strong> (I guess every validator is assigned to a number?). To <strong>prevent a targeted attack on a single shard</strong>, at <strong>a fixed interval you shuffle the shards</strong>. Get fucked corrupted leader, this is time interval is called <strong><em>epoch</em></strong>.</p>\n\n<p><strong>But</strong>, Harmony uses something called <strong>beacon chain</strong> and <strong>multiple shard chains</strong>. The <strong>beacon chain should be from what I gathered the ‘’home’’ of the sharded blockchain</strong>. The beacon is responsible for assigning the random numbers we talked about.The <strong>shard chains</strong> store <strong>separate blockchain states</strong> and <strong>still passes transactions</strong>. Harmony then… uses a lot of stuff to make this thing secure, trust me. How these numbers gets assigned though, is not something i want to know.</p>\n\n<p><strong>Something interesting is definitely the staking-based sharding.</strong></p>\n\n<p>&#x200B;</p>\n\n<h1>STAKING-BASED SHARDING</h1>\n\n<p>&#x200B;</p>\n\n<p>As said earlier, <strong>Proof of Stake basically means that to become a validator, you must stake a certain amount of tokens</strong>; you pass some corrupt blocks, you lose the amount staked and lose other privileges.</p>\n\n<p>In <strong>Harmony One</strong>, your <strong>share of voting is proportionate by the amount of tokes you stoked</strong>; how many are required is computed by an algorithm, it is not a quantified and constant amount. Validation works something like this:</p>\n\n<ol>\n<li><strong>Epoch</strong></li>\n<li><strong>Validator gets assigned a rando shard</strong></li>\n<li><strong>Vote through FBFT protocol</strong></li>\n<li><strong>When consensus is reached, go on next shard</strong></li>\n<li><strong>Repeat from step 1</strong></li>\n</ol>\n\n<p><strong>How secure is this method?</strong> A lot since they <strong>assign shards by voting shares</strong> and <strong>not by validators. Remember</strong>: if you have more voting shares, it means you have staked more tokens (money). Even if you could potentially control the vote, if try to fraud the mechanism, you will lose any amount staked.</p>\n\n<p>Now, let’s say someone attacks a shard. <strong>Harmony uses the Cuckoo-rule when we reshard the block</strong>. Basically after an epoch, if you withdraw your stake, you’re kinda <strong>sus</strong> and you will get expelled. If you don’t unstake, you stay and new validators will gain next voting shares.</p>\n\n<p>Come on, we almost finished.</p>\n\n<h1>SHARD CHAIN AND BEACON CHAIN</h1>\n\n<p>Get a blockchain, shard it and bam. <strong>Shard chain</strong>! In here, the shard chain validates the transactions and keeps his own state (note: <strong>it can’t interfere with transactions that happen in another shard</strong>). Communication is done through cross-shard communication.</p>\n\n<p>We mentioned the <strong>beacon chain</strong>, well, what is it? It’s <strong>another sharded chain but it as two functionalities: it assigns the famous random number and it accepts the stake</strong>. You deposit in the beacon chain to become a validators.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>I think I finished with the basic mechanism of the blockchain and the whitepapers. There are more pages to be analyzed but they are way too technical for now.</p>\n\n<h1>TEAM &amp; ROADMAP</h1>\n\n<p>Now, for the team as the reddit post says. From the website there are 14 people we need to keep an eye out. There is a little summary in the Harmony One webpage.</p>\n\n<p>…<strong>I think it’s useless to even analyze the team</strong>, these are big people with big achievements. They aren’t the type of tech people that will say ‘’yeah, just turn on and off the PC’’ to your computer problem. They will probably turn your PC to a quantum PC.</p>\n\n<p>Now, i do not have any more references, plus i want others point of view. Lets head to the Harmony One Youtube channel: it’s pretty updated. First thing I’m interested is in their <strong>roadmap</strong>. One thing is sure, Harmony One site is aesthetic, but <strong>searching a topic is pretty tedious</strong>.</p>\n\n<p>Let’s see <strong>2020 achievements</strong>: (source: <a href=\"https://medium.com/harmony-one/harmony-2020-year-in-review-ecosystem-growth-f414a86dbda9\">https://medium.com/harmony-one/harmony-2020-year-in-review-ecosystem-growth-f414a86dbda9</a>)</p>\n\n<p>So, in 2020 they <strong>launched the blockchain</strong>, becoming the <strong>first blockchain to successfully implement sharding</strong>, they opened to <strong>640 validators slots</strong> and <strong>successfully lowered the seconds to make a transaction from 8 to 2 seconds</strong>. One important thing they already had in mind is b<strong><em>uilding bridges between blockchains</em></strong>. That’s interesting because it seems like ONE doesn’t want to take on ETH but rather be a ‘’<strong>glue</strong>’’ for other blockchains.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>The 2021 roadmap have some interesting points</strong> (source: <a href=\"https://open.harmony.one/strategy-roadmap\">https://open.harmony.one/strategy-roadmap</a>)<strong>:</strong></p>\n\n<p>· <strong>Building more bridges with other blockchains</strong> (Bitcoin, Polygon, Cosmos)</p>\n\n<p>· <strong>Cross-shard transaction</strong>, which is similar to Cosmos zone and Polkadot parachains. Basically, from what I get from here (source: <a href=\"https://github.com/harmony-one/bounties/issues/85\">https://github.com/harmony-one/bounties/issues/85</a>), only ONE tokens can go / communicate from shard to shard. We have smart contracts in the shards, but they can’t communicate with each other right now. I guess it’s <strong>VERY important</strong> since we are building bridges. We can’t cross bridges that don’t align with each other.</p>\n\n<p>· <strong>Lowering down the transaction speed to 1s, it’s huge if the fees are low</strong>.</p>\n\n<p>Now, these are great objectives, faster transaction speed (hoping to maintain low fees), more blockchain connections.. hope for the best.</p>\n\n<h1>TOKENOMICS</h1>\n\n<p>&#x200B;</p>\n\n<p>This is the hardest part for me, definitely. But as a noob, I must try. First of all, <strong>what are the tokenomics</strong>? It’s basically an investigation on how the tokens are allocated, the marketcap, the inflation rates ecc. (are most of them in sale to the public? Who got them first? Do they burn? Ecc.). These are stats that <strong>basically tell you how a coin works from an economic perspective</strong>. Now, let’s check Guys video from CoinBureau, lets set a guideline: <a href=\"https://www.youtube.com/watch?v=ftCaqG7wckg\">https://www.youtube.com/watch?v=ftCaqG7wckg</a></p>\n\n<p>Lets do a <strong>bullet list and comment it.</strong></p>\n\n<p>· <strong>Circulating Supply</strong> (how many coins are in circulation): 10.69B! Is it a lot? Lets check on CoinMarketCap. It seems there are many tokens circulating, more than DOT, ATOM and SOL. We <strong>definitely want to know how tokens burn</strong>, because having a lower supply SHOULD actually increase price. Higher quantity of tokens means the price goes lower (check DOGE). But, I’m a noob, I could be 100% wrong.</p>\n\n<p>· <strong>Marketcap = n. of tokens in circulations x price.</strong> Why is market cap important? Well, it establishes how <strong>stable</strong> the coin is. The bigger, the better cause it’s more stable right? Nope, crypto is volatile as a meth-head. Let’s then put it like this then: <strong>the lower it is, the higher it can grow but with higher risks</strong>. Harmony One sits in the right spot.</p>\n\n<p>· <strong>Allocation and distribution:</strong> now, important thing here. We do not want whales of any kind here. Why? <strong>Because whales control the price.</strong> Lets say a token sells 100 coins and 70 are bought by someone. Assume the token goes 100x the price. You already buy higher than the whale. <strong>So,</strong> <strong><em>buy buy buy</em></strong><strong>, the coins are steadily decreasing in circulation that makes the price pump. Whale sees the price pump and sells everything: a lot of tokens are found. If a lot of tokens are found, then the price drops abruptly</strong>. </p>\n\n<p>Think it like the so-sought First Edition Charizard. Why is it so precious? Apart the horn, it’s sought cause there aren’t many out there. If the card had more supply, you can bet it wouldn’t cost so much. </p>\n\n<p><strong><em>I’m having a hard time finding the distribution. If anyone could help, I’d appreciate it!</em></strong></p>\n\n<p>· <strong>Vesting and inflation:</strong> Uhm, <strong>vesting means to lock a part of the tokens and release it in another moment</strong>. From what I gathered from Guy from CoinBureau ( source: <a href=\"https://www.youtube.com/watch?v=wARoB6CvQbQ\">https://www.youtube.com/watch?v=wARoB6CvQbQ</a>) , it’s nothing. Like, i didn&#39;t really understand him. But the graph shows that they will <strong>gradually</strong> release more tokens. Now, <strong>inflation means that over time, the coin loses it’s value</strong>. Harmony One seems to basically mint per 441M coins per year, which is not good. <strong>BUT</strong>, ONE tokens get burned the more transactions there are. Slashed stakes get burned too! But, can you burn more than you mint? Hopefully one day, for now, we have an inflationary coin.</p>\n\n<h1>CONCLUSION</h1>\n\n<p><strong>I don’t have any strong conclusions</strong>, I still don’t have anything on other coins to be honest. From a quick Google search, we don’t have anything like Harmony One. H<strong>armony One has an objective to be a bridge from a blockchain to another and adopts a successful sharding method.</strong></p>\n\n<p>I will definitely buy some next DCA. Why? It’s unique and it seems a really good project. It has nice objectives. I wish i could give a more detailed analysis, but the premise was clear. <strong>I&#39;m a noob that hopes to have done a good work and  hope that some other noob sees the actual process of doing your own research.</strong><br/>\n<strong>Is it the best?</strong> Nope, but i hope i will get better each time a new interesting coin appears here on the subreddit.</p>\n\n<p>Harmony, make the site more accessible, i mean look at ETH. Holy moly that site rocks.   </p>\n\n<p>Cheers guys!</p>\n</div><!-- SC_ON -->",
  "score": 162,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/28yGra4HVUdaKBNhZj_yitxfX60ZigmvLndfdM8GTTE.jpg?auto=webp&s=5b9350b314f4dc98c35037f0cf753ea4af77577a",
          "width": 600,
          "height": 314
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/28yGra4HVUdaKBNhZj_yitxfX60ZigmvLndfdM8GTTE.jpg?width=108&crop=smart&auto=webp&s=b0d255ce2ad4c67f760daf83a5f8906e40b5389c",
            "width": 108,
            "height": 56
          },
          {
            "url": "https://external-preview.redd.it/28yGra4HVUdaKBNhZj_yitxfX60ZigmvLndfdM8GTTE.jpg?width=216&crop=smart&auto=webp&s=a981521ec5331ebb43f1dcba5a63d1107c9e5b17",
            "width": 216,
            "height": 113
          },
          {
            "url": "https://external-preview.redd.it/28yGra4HVUdaKBNhZj_yitxfX60ZigmvLndfdM8GTTE.jpg?width=320&crop=smart&auto=webp&s=a56c287196a949ce1a7435ef2054f99ea142ab70",
            "width": 320,
            "height": 167
          }
        ],
        "variants": {},
        "id": "-2Q6sT36vca27HKxr0RUQgPYtlKxdmTJMupwWxUNLVY"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/qghs3q/dyor_of_harmony_one_from_a_noob_perspective/",
  "subreddit": "CryptoCurrency",
  "id": "qghs3q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "WARNING: THIS IS A NOOB POST, TRYING TO GET BETTER AND TO LEARN. IT DOES NOT\nCONTAIN THE BEST INFORMATION, I JUST HOPE THAT A NOOB LIKE ME CAN ACTUALLY START\nTO DYOR. PLUS, ENGLISH ISN'T MY NATIVE LANGUAGE, SORRY FOR TYPOS.\n\nPremise:\n\nI got in the crypto world a month ago, precisely during the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "警告：これは初心者向けの投稿で、より良くなろう、学ぼうとしているものです。最高の情報は含まれていません。\nただ、私のような初心者が実際にDYORを始められることを願っています。\nDYORを始められることを願っています。また、英語は私の母国語ではありませんので、誤字脱字はご容赦ください。\n\n前提\n\n私が暗号の世界に入ったのは1ヶ月前で、まさにその時期は...。",
      "title": "初心者から見たハーモニーワンのDYOR"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "警告：这是一个新手帖子，试图让自己变得更好并学习。它并不\n包含最好的信息，我只是希望像我这样的新手能真正开始\n开始学习。另外，英语不是我的母语，抱歉有错别字。\n\n前提是。\n\n我在一个月前进入加密货币世界，正是在...",
      "title": "从一个新手的角度看和谐一号的DYOR"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "警告：這是一個新手帖子，試圖讓自己變得更好並學習。它並不\n包含最好的信息，我只是希望像我這樣的新手能真正開始\n開始學習。另外，英語不是我的母語，抱歉有錯別字。\n\n前提是。\n\n我在一個月前進入加密貨幣世界，正是在...",
      "title": "從一個新手的角度看和諧一號的DYOR"
    }
  ]
}