{
  "author": "loveyoustink",
  "original_created_utc": 1635425118,
  "title": "Why is there a lack of cat coins in the crypto market?",
  "created_utc": 1635431829,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is now a genuine question, I get that some people prefer dogs over cats, but there are people that prefer cats over dogs too. We now have two dog coins in the top 10, which is... questionable, but I&#39;m happy for everyone who made money from them, but where are all the cat coins? </p>\n\n<p>This is bad for diversity, if we&#39;re going to have memecoins, let&#39;s just have all the pets, not just dogs. I have actually checked and if I am not wrong, there is not a cat coin in the top 100, but 2 dogs in the top 10, I bet the cats are feeling left out now.</p>\n</div><!-- SC_ON -->",
  "score": 708,
  "permalink": "/r/CryptoCurrency/comments/qhm7w1/why_is_there_a_lack_of_cat_coins_in_the_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "qhm7w1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is now a genuine question, I get that some people prefer dogs over cats,\nbut there are people that prefer cats over dogs too. We now have two dog coins\nin the top 10, which is... questionable, but I'm happy for everyone who made\nmoney from them, but where are all the cat coins?\n\nThis is bad for…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "猫よりも犬が好きな人がいるのはわかります。\nでも、犬よりも猫が好きな人もいますよね。トップ10に犬のコインが2つ入っているのは\nトップ10に犬のコインが2枚入っているのは...疑問ですが、犬で儲けた人は嬉しいですが\nでも、猫のコインはどこにあるの？\n\nこれでは...。",
      "title": "なぜ、暗号市場で猫のコインが不足しているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是一个真正的问题，我知道有些人喜欢狗而不是猫。\n但也有一些人喜欢猫而不喜欢狗。我们现在有两枚狗币\n在前10名，这是......值得怀疑的，但我为每一个从它们身上赚钱的人感到高兴。\n但所有的猫币在哪里呢？\n\n这对...",
      "title": "为什么加密货币市场上缺少猫币？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是一個真正的問題，我知道有些人喜歡狗而不是貓。\n但也有一些人喜歡貓而不喜歡狗。我們現在有兩枚狗幣\n在前10名，這是......值得懷疑的，但我爲每一個從它們身上賺錢的人感到高興。\n但所有的貓幣在哪裏呢？\n\n這對...",
      "title": "爲什麼加密貨幣市場上缺少貓幣？"
    }
  ]
}