{
  "author": "roberthonker",
  "the_new_excerpt": "You are in charge of your own money when you use crypto. This means that there\nis the possibility for some stupid shit to go down, and the potential for many\ncoins to be lost.\n\nAround 20% of the current bitcoin supply is lost, and the number of lost coins\nwill continue to increase as more clueless…",
  "original_created_utc": 1623123077,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号を使うと、自分のお金を管理することになります。これは、ある意味\nる可能性があり、多くのコインが失われる可能性があります。\nコインが失われる可能性があるということです。\n\n現在のビットコインの供給量の約20％が失われており、失われたコインの数は今後も増え続けるでしょう。\n今後も、無知な人が増えれば、失われるコインの数は増え続けるでしょう。",
      "title": "愚かさの証明 - コインを受動的に \"賭ける \"新しい方法"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当你使用加密货币时，你负责你自己的钱。这意味着有\n有可能发生一些愚蠢的事情，也有可能出现许多\n币丢失。\n\n目前比特币供应量的20%左右是丢失的，而丢失的币的数量\n将继续增加，因为更多无知的...",
      "title": "愚蠢的证明--被动 \"抵押 \"你的硬币的新方法"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當你使用加密貨幣時，你負責你自己的錢。這意味着有\n有可能發生一些愚蠢的事情，也有可能出現許多\n幣丟失。\n\n目前比特幣供應量的20%左右是丟失的，而丟失的幣的數量\n將繼續增加，因爲更多無知的...",
      "title": "愚蠢的證明--被動 \"抵押 \"你的硬幣的新方法"
    }
  ],
  "title": "Proof of stupidity - the new way to passively \"stake\" your coins",
  "created_utc": 1623163457,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>You are in charge of your own money when you use crypto. This means that there is the possibility for some stupid shit to go down, and the potential for many coins to be lost.</p>\n\n<p>Around 20% of the current bitcoin supply is lost, and the number of lost coins will continue to increase as more clueless people get into crypto. For every coin that is lost, the owner is making a donation to all other holders by raising the price of their coins. </p>\n\n<p>I call this <strong>Proof of stupidity</strong></p>\n</div><!-- SC_ON -->",
  "score": 179,
  "permalink": "/r/CryptoCurrency/comments/nuvang/proof_of_stupidity_the_new_way_to_passively_stake/",
  "subreddit": "CryptoCurrency",
  "id": "nuvang",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404882875
}