{
  "author": "Kimjongjimbo",
  "the_new_excerpt": "I’m acutely aware of the institutional moves that sent it down last week, but\nI’m curious: How much of the price movement is related to a change in the\ncompany’s outlook? I know there’s a good bit of bearish sentiment with all the\nchanges going on in media, but I’m curious whether folks have an…",
  "original_created_utc": 1617652399,
  "localize": [
    {
      "locale": "ja-JA",
      "the_new_excerpt": "先週、それを突き落とした制度的な動きを痛感していますが\n気になるのは、今回の値動きのうち、どの程度が会社の見通しの変更に関連しているのかということです。\n疑問なのですが、この値動きは会社の見通しの変更にどの程度関連しているのでしょうか？メディアの変化に伴い、弱気になっているのはよくわかる。\nしかし、私は、皆さんがこのようなことを考えているのかどうか、興味があります。",
      "title": "Viacom-CBSはどうした？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我敏锐地意识到上周机构的动作，使其下跌，但。\n我很好奇：价格的变动有多少是与改变\n公司的前景？我知道有很多人看空的情绪，所有的?\n在媒体上发生的变化，但我很好奇，是否人们有一个... ...",
      "title": "Viacom和CBS是怎么回事？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我敏銳地意識到上週機構的動作，使其下跌，但。\n我很好奇：價格的變動有多少是與改變\n公司的前景？我知道有很多人看空的情緒，所有的?\n在媒體上發生的變化，但我很好奇，是否人們有一個... ...",
      "title": "Viacom和CBS是怎麼回事？"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "先週、それを突き落とした制度的な動きを痛感していますが\n気になるのは、今回の値動きのうち、どの程度が会社の見通しの変更に関連しているのかということです。\n疑問なのですが、この値動きは会社の見通しの変更にどの程度関連しているのでしょうか？メディアの変化に伴い、弱気になっているのはよくわかる。\nしかし、私は、皆さんがこのようなことを考えているのかどうか、興味があります。",
      "title": "Viacom-CBSはどうした？"
    }
  ],
  "title": "What’s up with Viacom-CBS?",
  "created_utc": 1617696373,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m acutely aware of the institutional moves that sent it down last week, but I’m curious: How much of the price movement is related to a change in the company’s outlook? I know there’s a good bit of bearish sentiment with all the changes going on in media, but I’m curious whether folks have an opinion on the overall outlook from here. </p>\n\n<p>Basically, my question is twofold. One, I’m curious, what the hell happened to send it tumbling like that? Two, where does the company go from here? I welcome insight on what happened and peoples’ opinions on the company.</p>\n</div><!-- SC_ON -->",
  "score": 46,
  "permalink": "/r/stocks/comments/mktaek/whats_up_with_viacomcbs/",
  "subreddit": "stocks",
  "id": "mktaek",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961878995
}