{
  "author": "uw888",
  "original_created_utc": 1626532574,
  "title": "Barbara Bush spoke about her support for abortion access, LGBT rights, civil rights, and AIDS awareness during her term as First Lady of the United States. How was this received by her husband and Republicans of that time?",
  "created_utc": 1626572317,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It looks like many of her views and causes she cared for are quite different from that of many/most of today&#39;s Republicans from what I know about American politics (disclaimer: not American). Or maybe even her family. These issues must have been controversial as well at the time. What informed her politics, was it congruent with President Bush&#39;s views and policies? Did she make a difference, managed to influence change? How effective was she? Wash she criticised by the right?</p>\n</div><!-- SC_ON -->",
  "score": 111,
  "permalink": "/r/AskHistorians/comments/om5fhf/barbara_bush_spoke_about_her_support_for_abortion/",
  "subreddit": "AskHistorians",
  "id": "om5fhf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It looks like many of her views and causes she cared for are quite different\nfrom that of many/most of today's Republicans from what I know about American\npolitics (disclaimer: not American). Or maybe even her family. These issues must\nhave been controversial as well at the time. What informed her…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "彼女の意見や関心事の多くは、現在の共和党の多くや大部分とはかなり異なっているようです。\n私がアメリカの政治について知っている限りでは、今日の共和党の多くの、あるいはほとんどの人たちの意見とはかなり異なっています。\nアメリカの政治について知っている限りでは（免責事項：アメリカ人ではありません）。あるいは、彼女の家族とも違うかもしれません。これらの問題は\n当時、これらの問題も議論の的になっていたに違いない。彼女は何を考えていたのだろうか。",
      "title": "バーバラ・ブッシュ氏は、米国のファーストレディとしての任期中に行った、中絶アクセス、LGBTの権利、公民権、エイズ啓発への支援について語りました。これは、彼女の夫や当時の共和党員にどのように受け止められたのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "从我对美国的了解来看，她的许多观点和她所关心的事业与今天的许多/大多数共和党人有很大的不同。\n从我对美国政治的了解来看，她的许多观点和她所关心的事业与当今许多/大多数共和党人的观点和事业有很大不同。\n(免责声明：不是美国人)。甚至可能是她的家人。这些问题一定\n在当时也是有争议的。是什么告知她...",
      "title": "芭芭拉-布什谈到了她在担任美国第一夫人期间对堕胎机会、LGBT权利、民权和艾滋病意识的支持。她的丈夫和当时的共和党人是如何看待这个问题的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "從我對美國的瞭解來看，她的許多觀點和她所關心的事業與今天的許多/大多數共和黨人有很大的不同。\n從我對美國政治的瞭解來看，她的許多觀點和她所關心的事業與當今許多/大多數共和黨人的觀點和事業有很大不同。\n(免責聲明：不是美國人)。甚至可能是她的家人。這些問題一定\n在當時也是有爭議的。是什麼告知她...",
      "title": "芭芭拉-布什談到了她在擔任美國第一夫人期間對墮胎機會、LGBT權利、民權和艾滋病意識的支持。她的丈夫和當時的共和黨人是如何看待這個問題的？"
    }
  ]
}