{
  "author": "Okmanl",
  "the_new_excerpt": "Something I've noticed, but it seems a lot of 10X investments tend to be\ncontroversial. I guess if everyone recognizes something as a good investment,\nthen it would no longer be 10X as everyone is already buying that thing.\n\nBasically if you have a lot of people who are dismissive of something…",
  "original_created_utc": 1614487559,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我注意到一些事情，但似乎很多10X投资往往是\n有争议的。我想如果大家都认可一些东西是好的投资。\n那就不再是10X了，因为大家都已经在买这个东西了。\n\n基本上如果你有很多人对某个东西不屑一顾......",
      "title": "你所拥有的投资，你认为在5-10年内10倍的机会最高。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我注意到一些事情，但似乎很多10X投資往往是\n有爭議的。我想如果大家都認可一些東西是好的投資。\n那就不再是10X了，因爲大家都已經在買這個東西了。\n\n基本上如果你有很多人對某個東西不屑一顧......",
      "title": "你所擁有的投資，你認爲在5-10年內10倍的機會最高。"
    }
  ],
  "title": "Investments you own that you believe have the highest chance of 10X'ing in 5-10 years.",
  "created_utc": 1614496973,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Something I&#39;ve noticed, but it seems a lot of 10X investments tend to be controversial. I guess if everyone recognizes something as a good investment, then it would no longer be 10X as everyone is already buying that thing. </p>\n\n<p>Basically if you have a lot of people who are dismissive of something who&#39;ve only researched that thing at a surface level, while on the other hand, you have another group of people who&#39;ve done some serious DD on it and are convinced of its potential, then you know that it&#39;s a 10X candidate. Especially if that company has a great CEO / management team and work culture to solve what the public think are massive hurdles for the company.</p>\n\n<p>Anyways for me it would be Lemonade. I think what&#39;s going on is a textbook example of innovator&#39;s dilemma. Lemonade at first entered a very underserved market (renter&#39;s insurance) to build brand value and recognition. They&#39;re now releasing new insurance products every 6-8 months.</p>\n\n<p>Meanwhile the incumbents have the luxury of a huge customer set but high expectations of yearly sales. They are still relying on a lot of legacy systems and core capabilities (broker based systems, software that&#39;s still running on COBOL). Many shareholders still expect yearly dividends. And so on.</p>\n\n<p>One interesting quote by the CEO of Lemonade “Ironically you have a better chance of creating a product that’s 10x better than 10% better. And in order to do so you have to throw away everything you know and reason from first principles”. Right now lemonade is ranked #1 in customer satisfaction for insurance, and they can give out and process claims in 1/10th the time as traditional insurance.</p>\n</div><!-- SC_ON -->",
  "score": 1073,
  "permalink": "/r/investing/comments/lu6i2t/investments_you_own_that_you_believe_have_the/",
  "subreddit": "investing",
  "id": "lu6i2t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937740754
}