{
  "author": "throwaway11121121112",
  "original_created_utc": 1633991325,
  "title": "How I spent 29 bitcoin at 16",
  "created_utc": 1634004716,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Back when I was young, around 2015. I got into bitcoin, it was amazing, exciting and brand new.</p>\n\n<p>I immediately saw the utility and value going up, it was enough to make my young eyes glisten. However in my wisdom, I only saw a single use case at the time. I saw bitcoin as a currency, not something to be held and stored.</p>\n\n<p>I found these &#39;dark web&#39; stores where you could spend bitcoin and get stuff delivered!?! Amazing. I felt like I was in a thriller movie for a little bit of trees. During my time as a teen, I did this again, and again. I spent 29 bitcoin. At the time, this wasn&#39;t much, just my minimum wage job paying me enough to do something with it.</p>\n\n<p>Here I am, 6 years later. Struggling financially, investing in crypto and just wishing I had held it. $1.6 million USD, what a life changing amount.</p>\n\n<p>I dont know why I am posting this, but if I could say one thing to each and every one of you it would be to hold. Just hold, don&#39;t regret it years later like me.</p>\n</div><!-- SC_ON -->",
  "score": 187,
  "permalink": "/r/Bitcoin/comments/q67jbi/how_i_spent_29_bitcoin_at_16/",
  "subreddit": "Bitcoin",
  "id": "q67jbi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Back when I was young, around 2015. I got into bitcoin, it was amazing, exciting\nand brand new.\n\nI immediately saw the utility and value going up, it was enough to make my young\neyes glisten. However in my wisdom, I only saw a single use case at the time. I\nsaw bitcoin as a currency, not something…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "若かりし頃、2015年頃。私はビットコインに夢中になり、それは素晴らしく、エキサイティングで\n真新しいものでした。\n\nすぐに実用性と価値が上がっていくのがわかり、若かった私の目を輝かせるのに十分でした。\n目を輝かせました。しかし、私の知恵では、当時は1つのユースケースしか見ていませんでした。I\n当時の私は、ビットコインを通貨としてしか見ておらず、何か...",
      "title": "16歳で29ビットコインを使った方法"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "回到我年轻的时候，大约在2015年。我进入了比特币，它很神奇，很刺激\n而且是全新的。\n\n我立刻看到了它的效用和价值在上升，这足以让我年轻的\n的眼睛闪闪发光。然而以我的智慧，我当时只看到了一个单一的使用案例。I\n把比特币看成是一种货币，而不是什么...",
      "title": "我如何在16岁时花掉29个比特币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "回到我年輕的時候，大約在2015年。我進入了比特幣，它很神奇，很刺激\n而且是全新的。\n\n我立刻看到了它的效用和價值在上升，這足以讓我年輕的\n的眼睛閃閃發光。然而以我的智慧，我當時只看到了一個單一的使用案例。I\n把比特幣看成是一種貨幣，而不是什麼...",
      "title": "我如何在16歲時花掉29個比特幣"
    }
  ]
}