{
  "author": "Environmental_Point3",
  "original_created_utc": 1635961627,
  "title": "I started investing when I was 29, thanks to crypto I’m now 47!",
  "created_utc": 1635975116,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Anyone else wake up in the middle of the night and check the charts? </p>\n\n<p>Calculate how much something would be worth in ALGO rather than your fiat currency?</p>\n\n<p>Perhaps a sneaky browse of CoinMarketCap.com while on shift at the fiat mines? Only to close it, and re open it a few minutes later - <em>just</em> in case.</p>\n\n<p>Although I have learned a lot (and earned a lot) in my short time in this wild wonderful world - man has it been crazy! I have definitely developed some unhealthy tendencies which surely have not been good for my overall health. </p>\n\n<p>I’m not even over invested… I am quite simply hooked!! Maybe it’s all the hype this year has brought, but to those of you who can DCA in and go on with their lives, I salute you. To those of you who day trade or swing trade, the size of your cajónes scares me. And to those of you who check the charts once every five minutes…. they better be the 30 second charts!</p>\n</div><!-- SC_ON -->",
  "score": 300,
  "permalink": "/r/CryptoCurrency/comments/qlzy4w/i_started_investing_when_i_was_29_thanks_to/",
  "subreddit": "CryptoCurrency",
  "id": "qlzy4w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Anyone else wake up in the middle of the night and check the charts?\n\nCalculate how much something would be worth in ALGO rather than your fiat\ncurrency?\n\nPerhaps a sneaky browse of CoinMarketCap.com while on shift at the fiat mines?\nOnly to close it, and re open it a few minutes later - just in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "夜中に目が覚めて、チャートをチェックしている人はいませんか？\n\n自分の通貨ではなく、ALGOでいくらになるか計算する\n通貨ではなく、ALGOではいくらになるか？\n\n不換地の鉱山で働いているときに、CoinMarketCap.comをこっそり見たことはありませんか？\nしかし、いったん閉じて、数分後に再び開くことになります...。",
      "title": "私は29歳で投資を始めましたが、暗号のおかげで今は47歳になりました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "还有人在半夜醒来查看图表吗？\n\n计算某样东西用ALGO而不是你的法定货币能值多少钱？\n货币？\n\n也许在法币矿场值班的时候，偷偷浏览一下CoinMarketCap.com？\n只是关闭它，并在几分钟后重新打开 - 只是在...",
      "title": "我在29岁时开始投资，多亏了加密货币，我现在已经47岁了!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "還有人在半夜醒來查看圖表嗎？\n\n計算某樣東西用ALGO而不是你的法定貨幣能值多少錢？\n貨幣？\n\n也許在法幣礦場值班的時候，偷偷瀏覽一下CoinMarketCap.com？\n只是關閉它，並在幾分鐘後重新打開 - 只是在...",
      "title": "我在29歲時開始投資，多虧了加密貨幣，我現在已經47歲了!"
    }
  ]
}