{
  "author": "tudor_wife",
  "original_created_utc": 1648816548,
  "title": "We are the wives of Henry VIII, King of England, France, and Ireland. Ask Us Anything!",
  "created_utc": 1648827019,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Greetings! &lt;a href=\"https://imgur.com/a/MHCMep3\"&gt;Here be our proof.&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;We, the six wives of King Henry VIII, shall jointly share this account to answer your questions about our lives and our tumultuous times. We shall individually introduce ourselves:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I am Katherine, daughter of Isabel of Castile and Fernando of Aragon, and true and loyal wife of my husband Henry from our marriage to my death. I bore several children, but only my daughter Mary survived infancy.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Katherine Regina&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Hello! I&amp;#39;m Anne, and I am very happy to speak to you today about the great changes my husband made to reform the true Church of England, and the great sacrifices we made for each other along the way. My daughter, Elizabeth, was my pride and joy even before she became one of the preeminent monarchs of England.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Anne B.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;My name is Jane, and I do not know how much I can tell you, for I stay away from weighty matters of politics and religion. I am the wife who gave Henry his son and heir apparent, his most dear Edward.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;J. Seymour&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I must admit that I am not technically a wife of Henry VIII, as our marriage was never fully binding under canon law. But I welcome the opportunity to share my views on his court during my time there as his Beloved Sister!&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Anna von Kleve&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Hello, hello! I greet you respectfully as a visitor to our court. My time as consort was brief, but I am pleased to tell you about my life in the Howard family and as the young woman with &amp;quot;no other will but his&amp;quot;.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;~ Kathryn&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Experience tells me that you will have little interest in me as a person, but I am here regardless. I was with Henry in his twilight years, and influenced him in reconciling with his daughters Mary and Elizabeth. Few are aware that I also acted as de facto regent during my husband&amp;#39;s final military campaign!&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Catherine Parr&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 113,
  "permalink": "/r/AskHistorians/comments/ttpm8n/we_are_the_wives_of_henry_viii_king_of_england/",
  "subreddit": "AskHistorians",
  "id": "ttpm8n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Greetings! Here be our proof. [https://imgur.com/a/MHCMep3]\n\nWe, the six wives of King Henry VIII, shall jointly share this account to answer\nyour questions about our lives and our tumultuous times. We shall individually\nintroduce ourselves:\n\n> I am Katherine, daughter of Isabel of Castile and…"
}