{
  "author": "Throughawayup",
  "original_created_utc": 1639002069,
  "title": "Dundle.com requests KYC after you pay for your order",
  "created_utc": 1639060313,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;They dont tell you you need to verify your identity until you send your payment. Then once they know they have your money they hold it ransom until you submit ID and if you dont submit then they will not return your funds. &lt;/p&gt;\n\n&lt;p&gt;What a scam. It would have been one thing if they had even so much as mentioned it while placing an order so i could have chose another site. It would have been one thing if they refunded me upon my refusal to submit documents. &lt;/p&gt;\n\n&lt;p&gt;If you value your privacy and your crypto, stay clear of this service.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/rc2kfp/dundlecom_requests_kyc_after_you_pay_for_your/",
  "subreddit": "CryptoCurrency",
  "id": "rc2kfp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "They dont tell you you need to verify your identity until you send your payment.\nThen once they know they have your money they hold it ransom until you submit ID\nand if you dont submit then they will not return your funds.\n\nWhat a scam. It would have been one thing if they had even so much as…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "支払いを済ませるまで、本人確認が必要なことを教えてくれません。\nそして彼らはあなたのお金を手に入れたと知ると、あなたが身分証明書を提出するまで身代金を要求するのです。\nを提出しなければ、資金は戻ってきません。\n\nなんという詐欺でしょう。このようなことが起こるのは、彼らが...",
      "title": "Dundle.comは、お客様が注文の支払いをした後にKYCを要求します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "他们不告诉你需要验证你的身份，直到你发送你的付款。\n一旦他们知道你的钱在他们手里，他们就会扣留你的钱，直到你提交身份证明。\n如果你不提交，他们就不会退还你的资金。\n\n这真是一个骗局。如果他们有这么多的钱，那是一回事。",
      "title": "Dundle.com在您支付订单后要求进行KYC认证"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "他們不告訴你需要驗證你的身份，直到你發送你的付款。\n一旦他們知道你的錢在他們手裏，他們就會扣留你的錢，直到你提交身份證明。\n如果你不提交，他們就不會退還你的資金。\n\n這真是一個騙局。如果他們有這麼多的錢，那是一回事。",
      "title": "Dundle.com在您支付訂單後要求進行KYC認證"
    }
  ]
}