{
  "author": "Mandrake_m2",
  "original_created_utc": 1645997983,
  "title": "The fact that you can now transfer thousands of dollars from one country or another for near zero fees should be enough to show you the inefficiency of institutions like Western Union.",
  "created_utc": 1646023134,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A thousand dollars cross country would cost at least $50 through things like Western Union which we all too as a standard back in the day but now seems outrageous with projects like e-Money or Tron pressing near zero fees for such large sums of money transfers.&lt;/p&gt;\n\n&lt;p&gt;The only reason Western Union isn’t tumbling right now is because crypto is still new to most of the populous and the fact that some countries don’t have internet access to begin with.&lt;/p&gt;\n\n&lt;p&gt;But for the most part, once crypto start gaining more and more mainstream traction, companies and financial institutions the likes of Western Union and MoneyGram will start to falter and wi only be used by severely underdeveloped countries with no internet access.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 314,
  "permalink": "/r/CryptoCurrency/comments/t2ykey/the_fact_that_you_can_now_transfer_thousands_of/",
  "subreddit": "CryptoCurrency",
  "id": "t2ykey",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "A thousand dollars cross country would cost at least $50 through things like\nWestern Union which we all too as a standard back in the day but now seems\noutrageous with projects like e-Money or Tron pressing near zero fees for such\nlarge sums of money transfers.\n\nThe only reason Western Union isn’t…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1,000ドルが国をまたぐと、少なくとも50ドルかかる。\nウエスタンユニオンは、昔は当たり前のように使っていましたが、今はどうでしょう。\n電子マネーやトロンのようなプロジェクトが、このような手数料をゼロに近づけているのですから、とんでもないことです。\n大口送金の\n\nウエスタンユニオンがそうでない唯一の理由は...",
      "title": "現在、ある国から別の国へ数千ドルをほぼゼロの手数料で送金できるという事実は、Western Unionのような機関の非効率性を示すのに十分である。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "一千美元的跨国汇款至少要花50美元，比如说\n西联汇款，这在过去也是一个标准，但现在看来\n但现在看来，像e-Money或Tron这样的项目，对这样的大额汇款几乎不收取任何费用，实在是太离谱了。\n大额汇款的费用几乎为零。\n\n西联汇款不是唯一的原因...",
      "title": "现在你可以从一个国家或另一个国家转移数千美元，而费用几乎为零，这一事实应该足以让你看到像西联这样的机构的低效率。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "一千美元的跨國匯款至少要花50美元，比如說\n西聯匯款，這在過去也是一個標準，但現在看來\n但現在看來，像e-Money或Tron這樣的項目，對這樣的大額匯款幾乎不收取任何費用，實在是太離譜了。\n大額匯款的費用幾乎爲零。\n\n西聯匯款不是唯一的原因...",
      "title": "現在你可以從一個國家或另一個國家轉移數千美元，而費用幾乎爲零，這一事實應該足以讓你看到像西聯這樣的機構的低效率。"
    }
  ]
}