{
  "author": "AskScienceModerator",
  "original_created_utc": 1646049636,
  "title": "AskScience AMA Series: Molecular engineering (MolE) encompasses everything from protein design, nanomaterials, vaccine development, battery/solar cell design, &amp; much more. We're a group of students, professors &amp; staff connected to the University of Washington's MolE Institute. AUA about MolE!",
  "created_utc": 1646085229,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;We are graduate students, staff, and faculty from the University of Washington Molecular Engineering and Science (MolES) Institute. Molecular Engineering is a new field; we were one of the first Molecular Engineering graduate programs in the world, and one of only two in the United States. Though MolES only opened in 2014, we have had many discoveries to share!&lt;/p&gt;\n\n&lt;p&gt;Molecular engineering itself is a broad and evolving field that seeks to understand how molecular properties and interactions can be manipulated to design and assemble better materials, systems, and processes for specific functions. Any time you attempt to change the object-level behavior of something by precisely altering it on the molecular level - given knowledge of how molecules in that &amp;quot;something&amp;quot; interacts with one another - you&amp;#39;re engaging in a type of molecular engineering. The applications are endless! Some specific examples of Molecular Engineering research being done within the labs of the MolES Institute are:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;MolES faculty member and Chemistry professor Al Nelson developed a new way to produce medicines and chemicals and preserve them in portable, modular &amp;quot;biofactories&amp;quot; embedded in water-based gels known as hydrogels. This approach could enable access to critical medicines and other compounds in low-resource areas.&lt;/li&gt;\n&lt;li&gt;The Baker lab in MolES and Biochemistry is engineering artificial proteins to self-assemble on a crystal surface. The ability to program these interactions could enable the design of new biomimetic materials with customized chemical reactivity or mechanical properties, that can serve as scaffolds for nano-filters, solar cells or electronic circuits.&lt;/li&gt;\n&lt;li&gt;Bioengineering/MolES Institute Professor Kelly Stevens developed a new 3D printing approach to create biocompatible hydrogels with life-like vasculature - opening the possibility of printing living human tissue for things like organ replacement!&lt;/li&gt;\n&lt;li&gt;Researchers in MolES and Chemical Engineering professor Elizabeth Nance&amp;#39;s lab are attempting to deliver therapeutics to the brain using tiny nanoparticles that can effectively cross the blood-brain-barrier in brain injury and disease.&lt;/li&gt;\n&lt;li&gt;MolES PhD student Jason Fontana is working in the labs of James Carothers and Jesse Zalatan to develop tools that facilitate genetic engineering in bacteria for optimizing biosynthesis of valuable products.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Molecular engineering is recognized by the National Academy of Engineering as one of the areas of education and research most critical to ensuring the future economic, environmental and medical health of the U.S. As a highly interdisciplinary field spanning across the science and engineering space, students of Molecular Engineering have produced numerous impactful scientific discoveries. We specifically believe that Molecular Engineering could be an exciting avenue for up-and-coming young scientists, and thus we would like to further general awareness of our discipline!&lt;/p&gt;\n\n&lt;p&gt;Our panelists today consist of faculty members of the University of Washington MolE Institute, as well as PhD students in the MolE program. They are:&lt;/p&gt;\n\n&lt;p&gt;Faculty:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Alshakim Nelson (&lt;a href=\"/u/polymerprof\"&gt;/u/polymerprof&lt;/a&gt;) - Associate Professor of Chemistry, Director of Education of the MolE Institute. Research Interests - polymer chemistry, biohybrid materials, stimuli-responsive materials, 3D printing&lt;/li&gt;\n&lt;li&gt;Neil King (&lt;a href=\"/u/ProteinKing_MolES\"&gt;/u/ProteinKing_MolES&lt;/a&gt;) - Assistant Professor of Biochemistry, Institute of Protein Design. Research Interests - protein design, self-assembling protein nanoparticles, vaccine design&lt;/li&gt;\n&lt;li&gt;Jeff Nivala (&lt;a href=\"/u/technomolecularprof\"&gt;/u/technomolecularprof&lt;/a&gt;) - Research Assistant Professor, Molecular Information Systems Lab, Allen School of Computer Science and Engineering. Research Interests - synthetic biology, DNA data storage, nanopore sensing, single-molecule protein sequencing, machine learning for biological systems design, and cyber-bio security&lt;/li&gt;\n&lt;li&gt;David Bergsman (&lt;a href=\"/u/ProfBergsman\"&gt;/u/ProfBergsman&lt;/a&gt;) - Assistant Professor of Chemical Engineering, Research Interests - ultrathin nanostructures, nanocoatings, chemical separations, water purification, data science for material design&lt;/li&gt;\n&lt;li&gt;Doug Ballard (&lt;a href=\"/u/uw-moles\"&gt;/u/uw-moles&lt;/a&gt;) - Graduate Program Advisor of the MolE PhD Program, MolE Institute Representative&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Students:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Ben Nguyen (&lt;a href=\"/u/nguyencd296\"&gt;/u/nguyencd296&lt;/a&gt;) - polymeric drug delivery systems, polymer-drug conjugates, cancer immunotherapy, renal drug delivery&lt;/li&gt;\n&lt;li&gt;Evan Pepper (&lt;a href=\"/u/evanpepper\"&gt;/u/evanpepper&lt;/a&gt;) - human microbiome, microbial evolution&lt;/li&gt;\n&lt;li&gt;Phuong Nguyen (&lt;a href=\"/u/npnguyen8\"&gt;/u/npnguyen8&lt;/a&gt;) - nanomedicine, neuroscience, biomaterials&lt;/li&gt;\n&lt;li&gt;Ayumi Pottenger (&lt;a href=\"/u/errorhandlenotfound\"&gt;/u/errorhandlenotfound&lt;/a&gt;) - infectious disease, drug delivery, polymer chemistry&lt;/li&gt;\n&lt;li&gt;Olivia Dotson (&lt;a href=\"/u/OliviaDotson\"&gt;/u/OliviaDotson&lt;/a&gt;) - nanomedicine, materials synthesis&lt;/li&gt;\n&lt;li&gt;Marti Tooley (&lt;a href=\"/u/MartiTooley\"&gt;/u/MartiTooley&lt;/a&gt;)- protein engineering, vaccine development, immune modulation&lt;/li&gt;\n&lt;li&gt;Cholpisit Ice Kiattisewee (&lt;a href=\"/u/theicechol\"&gt;/u/theicechol&lt;/a&gt;) - bacterial synthetic biology, CRISPR&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;We&amp;#39;ll be on from 11-1PM PST (2-4 PM ET/19-21 UT), AUA!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 111,
  "permalink": "/r/askscience/comments/t3dzwt/askscience_ama_series_molecular_engineering_mole/",
  "subreddit": "askscience",
  "id": "t3dzwt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "We are graduate students, staff, and faculty from the University of Washington\nMolecular Engineering and Science (MolES) Institute. Molecular Engineering is a\nnew field; we were one of the first Molecular Engineering graduate programs in\nthe world, and one of only two in the United States. Though…"
}