{
  "author": "d_d0g",
  "original_created_utc": 1631493822,
  "title": "How do Cardano fanboys feel?",
  "created_utc": 1631514640,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The upgrade is complete with the first 69 transactions recorded.</p>\n\n<p>We’ve been waiting a long time for this and it will now be an official use coin. Nobody can say it doesn’t do anything from this point forward. Of course there’s some dApps to onboard still and much work to do in general, but we are live nonetheless.</p>\n\n<p>We sit at about the same price we’ve been at for a month, but anyone who doesn’t know shit about fuck knows it wasn’t going to moon on day one. This is just the beginning.</p>\n\n<p>ADA will be used to do good things and join a few others such as Algo to revolutionize Bitcoin alternatives, likely bringing other coins to the forefront. </p>\n\n<p>Cardano is the coin that drug me into the crypto world after seeing Project Catalyst and understanding the type of scrutiny put into its development. It may not be perfect, but ADA has a lot of positive passionate behind it.</p>\n\n<p>I HODL about 6 other coins and don’t care for tribalism. I welcome all good ideas but want to hit this soapbox for a minute to congratulate all those who stood up for Cardano the last couple years regardless of the FUD and naysayers.</p>\n\n<p>ADA being great will likely mean your coin of choice has a better chance at being great. We’re all in this community together, so let’s all be happy for everyone’s victories.</p>\n</div><!-- SC_ON -->",
  "score": 210,
  "permalink": "/r/CryptoCurrency/comments/pn4unh/how_do_cardano_fanboys_feel/",
  "subreddit": "CryptoCurrency",
  "id": "pn4unh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The upgrade is complete with the first 69 transactions recorded.\n\nWe’ve been waiting a long time for this and it will now be an official use coin.\nNobody can say it doesn’t do anything from this point forward. Of course there’s\nsome dApps to onboard still and much work to do in general, but we are…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最初の69件のトランザクションを記録して、アップグレードが完了しました。\n\n長い間待っていたので、これで正式な使用コインとなります。\nここから先は誰も何もしないとは言えません。もちろん、まだ\nもちろん、まだいくつかのdAppsを搭載する必要がありますし、一般的にやるべきことはたくさんありますが、私たちは...",
      "title": "カルダノファンボーイの気持ちは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "升级已经完成，并记录了首批69笔交易。\n\n我们已经等了很久了，现在它将成为一个正式的使用币。\n从现在开始，没有人可以说它不做任何事情。当然，还有\n一些dApps还需要加入，总体来说还有很多工作要做，但我们...",
      "title": "卡达诺的粉丝们感觉如何？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "升級已經完成，並記錄了首批69筆交易。\n\n我們已經等了很久了，現在它將成爲一個正式的使用幣。\n從現在開始，沒有人可以說它不做任何事情。當然，還有\n一些dApps還需要加入，總體來說還有很多工作要做，但我們...",
      "title": "卡達諾的粉絲們感覺如何？"
    }
  ]
}