{
  "author": "mrhuggables",
  "original_created_utc": 1651333099,
  "title": "How did the Toyota Hilux become the \"vehicle of choice\" for armed conflicts and/or guerilla warfare in the developing world over the last 40-50 years?",
  "created_utc": 1651363936,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;If there&amp;#39;s one thing that&amp;#39;s burned into my brain when seeing videos of armed conflicts in the developing world, whether latin america or central asia or subsaharan africa... it&amp;#39;s that they&amp;#39;re all using Toyota pickup trucks, often with a machine gun in the truck bed. I&amp;#39;m sure I am not alone in this observation, as a quick google search can demonstrate.&lt;/p&gt;\n\n&lt;p&gt;My question is, &lt;em&gt;why&lt;/em&gt; Toyota specifically? Did they run an ad campaign for guerrilla warfare? Why don&amp;#39;t we see Nissans or Fords or other makes in these same environments? Was the Toyota Hilux the only game in town? Or did the Toyota reputation for reliability help shoot it to the top of the technical game?&lt;/p&gt;\n\n&lt;p&gt;Thanks!!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/ufdl43/how_did_the_toyota_hilux_become_the_vehicle_of/",
  "subreddit": "AskHistorians",
  "id": "ufdl43",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "If there's one thing that's burned into my brain when seeing videos of armed\nconflicts in the developing world, whether latin america or central asia or\nsubsaharan africa... it's that they're all using Toyota pickup trucks, often\nwith a machine gun in the truck bed. I'm sure I am not alone in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "武装の映像を見て脳裏に焼き付いたことがあるとすれば、それは\nラテンアメリカでも中央アジアでもアフリカでも、発展途上国での武力紛争のビデオを見ていて、ひとつだけ脳裏に焼き付いていることがあります。\nトヨタのピックアップトラックを使っていることです。\n荷台にマシンガンを積んでいることが多いのです。私一人ではないはずだ...",
      "title": "この40〜50年、なぜトヨタ・ハイラックスが発展途上国の武力紛争やゲリラ戦のための「選択車」になったのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果说在看到发展中国家的武装冲突视频时，有一件事深深地印在我的脑子里\n无论是拉丁美洲、中亚还是非洲撒哈拉以南地区，当我看到发展中世界的武装冲突视频时，有一件事深深地印在我的脑海里。\n撒哈拉以南的非洲地区......他们都使用丰田皮卡，通常在车内装有机枪。\n他们都使用丰田皮卡，车内往往有一挺机枪。我相信我不是一个人在...",
      "title": "在过去的40-50年里，丰田Hilux是如何成为发展中国家武装冲突和/或游击战的 \"首选车辆 \"的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果說在看到發展中國家的武裝衝突視頻時，有一件事深深地印在我的腦子裏\n無論是拉丁美洲、中亞還是非洲撒哈拉以南地區，當我看到發展中世界的武裝衝突視頻時，有一件事深深地印在我的腦海裏。\n撒哈拉以南的非洲地區......他們都使用豐田皮卡，通常在車內裝有機槍。\n他們都使用豐田皮卡，車內往往有一挺機槍。我相信我不是一個人在...",
      "title": "在過去的40-50年裏，豐田Hilux是如何成爲發展中國家武裝衝突和/或游擊戰的 \"首選車輛 \"的？"
    }
  ]
}