{
  "author": "RealWina",
  "original_created_utc": 1653330778,
  "title": "The crypto community is still way too inmature",
  "created_utc": 1653368196,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I hate having to say this but it is true. One of the many reasons people hate crypto is the community itself. \nI would rather spend one week watching &lt;a href=\"/r/animemes\"&gt;r/animemes&lt;/a&gt; than spending one hour looking at crypto twitter. &lt;/p&gt;\n\n&lt;p&gt;And im not talking only about ape pfps being, well, ape pfps; im talking about the cringe of crypto &amp;quot;influencers&amp;quot; and meme pages that either post repetitive stuff like &amp;quot;if you dont buy bitcoin now, you will regret it&amp;quot; every 2 minutes and the absolute worst memes ever. Not to mention the comment sections with &amp;quot;hodl hodl hodl 🚀&amp;quot; and bots. &lt;/p&gt;\n\n&lt;p&gt;90% of people are here because of the money, 9% of the people are here because of the memes and the remaining 1% isnt loud enough to make the community look more serious than it actually is. &lt;/p&gt;\n\n&lt;p&gt;This is also an obstacle for the mass adoption of crypto.\nImagine nations depending on cryptos with communities like dogecoin&amp;#39;s.&lt;/p&gt;\n\n&lt;p&gt;What do y&amp;#39;all think? Am i making this a bigger deal than it actually is?&lt;/p&gt;\n\n&lt;p&gt;edit: imnature, i mean inmanture, i mean imnan- imnanture, i mean-&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 330,
  "permalink": "/r/CryptoCurrency/comments/uw6ysk/the_crypto_community_is_still_way_too_inmature/",
  "subreddit": "CryptoCurrency",
  "id": "uw6ysk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I hate having to say this but it is true. One of the many reasons people hate\ncrypto is the community itself. I would rather spend one week watching\nr/animemes [/r/animemes] than spending one hour looking at crypto twitter.\n\nAnd im not talking only about ape pfps being, well, ape pfps; im talking…"
}