{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "I've seen an increasing number of posts lately discussing the prospects of shorting in this market.  I think it's worth pointing a few things out.  I have a few relatively small short positions (10-20% of my entire portfolio in aggregate) that have done well for me (the rest is in cash).  I've been in various short instruments over the last few months, and I even had some very substantial short positions (50% of portfolio) in individual tech stocks back in March (that I wish to god I had held on to!).  But this is a risky endeavor, and I think people need to keep a few things in mind.  \n\n\n1. Bear market rallies can be fierce, and until you have the luxury of hindsight, they are almost indistinguishable from new bull runs.\n2. If we apply some Bayesian reasoning, we can see that the odds start to stack up into pretty long odds when we need to guess when to go short, guess when to stop going short and guess when to go long.  There are ways to reduce this risk, but the simple fact that we think things are going down now and will go up in the future doesn't imply we have a clear game plan.\n3. This is already a risky enough thing.  There's no need to compound that by using options.  Short positions are preferable unless you are really playing with a small, small portion of your portfolio that you can just write off.\n4. This should be a small part of your portfolio no matter how you play it.  All short positions feature risk/reward asymmetry because stocks can go up indefinitely (infinite losses) but can only drop 100%.\n\nSo how should one play this once the high level of risk is accepted?  I think at least three things make sense:\n\n1. Pick a mark where you'll exit your short position on the upside (if you're wrong) and lower it as this drops.  Don't make this too low (bear rallies can be big), otherwise you take on all the risk with little of the gain.  If you can't accept the possibility of selling for a 30% loss or stomaching the ride until you get there, you shouldn't be doing this.\n2. Don't get too greedy.  The odds of continued declines in stocks go down as the market gets lower.  30% drops are more common than 50% drops which are more common than 70% drops.\n3. Mix up your position a bit.  I'm currently in SH (inverse of S&amp;P), SJB (inverse of junk bonds), am short REZ (residential real estate ETF) and have some SRS calls (inverse of Dow Jones Real Estate Index).  These are collectively less than 20% of my portfolio, and the calls are about 2% of my portfolio.  \n\nThere are a lot of ways to accomplish gaining exposure to declining stock prices, but the difficult thing is coming up with a system that doesn't overexpose you to being wrong and doesn't require you to stack multiple longshot decisions on top of each other.\n\nPersonally, I will probably be out of these positions completely if we get to a 30% drop in the S&amp;P.  I think the prospects of continued gains after that just aren't worth the risk to me....others will disagree.",
  "author_fullname": "t2_lembv4rl",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "On Shorting a Bear Market",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_vgrqtt",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.88,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 43,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 43,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1655748357,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve seen an increasing number of posts lately discussing the prospects of shorting in this market.  I think it&amp;#39;s worth pointing a few things out.  I have a few relatively small short positions (10-20% of my entire portfolio in aggregate) that have done well for me (the rest is in cash).  I&amp;#39;ve been in various short instruments over the last few months, and I even had some very substantial short positions (50% of portfolio) in individual tech stocks back in March (that I wish to god I had held on to!).  But this is a risky endeavor, and I think people need to keep a few things in mind.  &lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Bear market rallies can be fierce, and until you have the luxury of hindsight, they are almost indistinguishable from new bull runs.&lt;/li&gt;\n&lt;li&gt;If we apply some Bayesian reasoning, we can see that the odds start to stack up into pretty long odds when we need to guess when to go short, guess when to stop going short and guess when to go long.  There are ways to reduce this risk, but the simple fact that we think things are going down now and will go up in the future doesn&amp;#39;t imply we have a clear game plan.&lt;/li&gt;\n&lt;li&gt;This is already a risky enough thing.  There&amp;#39;s no need to compound that by using options.  Short positions are preferable unless you are really playing with a small, small portion of your portfolio that you can just write off.&lt;/li&gt;\n&lt;li&gt;This should be a small part of your portfolio no matter how you play it.  All short positions feature risk/reward asymmetry because stocks can go up indefinitely (infinite losses) but can only drop 100%.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;So how should one play this once the high level of risk is accepted?  I think at least three things make sense:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Pick a mark where you&amp;#39;ll exit your short position on the upside (if you&amp;#39;re wrong) and lower it as this drops.  Don&amp;#39;t make this too low (bear rallies can be big), otherwise you take on all the risk with little of the gain.  If you can&amp;#39;t accept the possibility of selling for a 30% loss or stomaching the ride until you get there, you shouldn&amp;#39;t be doing this.&lt;/li&gt;\n&lt;li&gt;Don&amp;#39;t get too greedy.  The odds of continued declines in stocks go down as the market gets lower.  30% drops are more common than 50% drops which are more common than 70% drops.&lt;/li&gt;\n&lt;li&gt;Mix up your position a bit.  I&amp;#39;m currently in SH (inverse of S&amp;amp;P), SJB (inverse of junk bonds), am short REZ (residential real estate ETF) and have some SRS calls (inverse of Dow Jones Real Estate Index).  These are collectively less than 20% of my portfolio, and the calls are about 2% of my portfolio.&lt;br/&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;There are a lot of ways to accomplish gaining exposure to declining stock prices, but the difficult thing is coming up with a system that doesn&amp;#39;t overexpose you to being wrong and doesn&amp;#39;t require you to stack multiple longshot decisions on top of each other.&lt;/p&gt;\n\n&lt;p&gt;Personally, I will probably be out of these positions completely if we get to a 30% drop in the S&amp;amp;P.  I think the prospects of continued gains after that just aren&amp;#39;t worth the risk to me....others will disagree.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "vgrqtt",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "gravcycrunnow",
  "discussion_type": null,
  "num_comments": 19,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/vgrqtt/on_shorting_a_bear_market/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/vgrqtt/on_shorting_a_bear_market/",
  "subreddit_subscribers": 4200896,
  "created_utc": 1655785433,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1655748357,
  "the_new_excerpt": "I've seen an increasing number of posts lately discussing the prospects of\nshorting in this market. I think it's worth pointing a few things out. I have a\nfew relatively small short positions (10-20% of my entire portfolio in\naggregate) that have done well for me (the rest is in cash). I've been…"
}