{
  "author": "AdhesivenessWorth118",
  "the_new_excerpt": "Hey you wonderful apes. I wanted to say thank you for saving me. I had given up\nearlier this year and was ready to go to the big jungle in the sky. I’ve had a\nlot of health problems after breaking my neck in 2005 including two blood\ninfections, over 30 surgeries, and having both hips amputated. I…",
  "original_created_utc": 1615819841,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "嘿，你们这些奇妙的猿人。我想说谢谢你们救了我。我已经放弃了\n今年年初，准备去天上的大丛林。我已经有了一个\n2005年，我的脖子断了之后，身体出现了很多问题，包括两次流血。\n感染，超过30次手术， 并有两个髋关节截肢。I…",
      "title": "WSB救了我"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嘿，你們這些奇妙的猿人。我想說謝謝你們救了我。我已經放棄了\n今年年初，準備去天上的大叢林。我已經有了一個\n2005年，我的脖子斷了之後，身體出現了很多問題，包括兩次流血。\n感染，超過30次手術， 並有兩個髖關節截肢。I…",
      "title": "WSB救了我"
    }
  ],
  "title": "WSB saved me.",
  "created_utc": 1615830152,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey you wonderful apes. I wanted to say thank you for saving me. I had given up earlier this year and was ready to go to the big jungle in the sky. I’ve had a lot of health problems after breaking my neck in 2005 including two blood infections, over 30 surgeries, and having both hips amputated. I just didn’t see a light at the end of the tunnel anymore after all the years of pain. I heard about GME going crazy and said what the hell and bought in at $330 (currently 5.8 shares @ $171.73)with the little savings I had and ever since that moment I’ve found a purpose in life. I have goals for the first time in ten years. My biggest one is to be off disability by the end of the year so I can better help my dad who has taken care of me after my car accident. Getting up in the morning is a little easier and the days seem a little brighter now. Thank you for being such a cool community.  &lt;3</p>\n</div><!-- SC_ON -->",
  "score": 5340,
  "permalink": "/r/wallstreetbets/comments/m5mc4h/wsb_saved_me/",
  "subreddit": "wallstreetbets",
  "id": "m5mc4h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147394512
}