{
  "author": "WonderfulComplaint45",
  "the_new_excerpt": "I understand that during this time period the Christian faith was quite\nfractitious. There were multiple councils called during this time period with\nthe intent of setting forth a clear doctrine. I am interested in how\nrecognizable the Christian faith of this time period would be to a…",
  "original_created_utc": 1624230651,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この時代、キリスト教の信仰はかなり分裂していたと聞いています。\n分裂していました。この時代には、明確な教義を示すことを目的とした複数の審議会が召集されています。\n明確な教義を示すことを目的とした複数の審議会が開かれました。私が興味を持ったのは\n私は、この時代のキリスト教の信仰がどのように認識されるのかに興味があります。",
      "title": "もし、現代のカソリック教徒が4世紀や5世紀の共通の時代に移動したとしたら、彼らにとってキリスト教の信仰はどれほど身近なものになるでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "据我所知，在这一时期，基督教信仰是相当\n分裂的。在这一时期，有多个理事会被召集起来，目的是为了制定明确的教义。\n的意图是提出明确的教义。我感兴趣的是\n这一时期的基督教信仰对一个人来说有多大的可识别性。",
      "title": "如果一个现代的天主教徒被传送到第四或第五世纪的普通时代，他们对基督教信仰会有多熟悉？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "據我所知，在這一時期，基督教信仰是相當\n分裂的。在這一時期，有多個理事會被召集起來，目的是爲了制定明確的教義。\n的意圖是提出明確的教義。我感興趣的是\n這一時期的基督教信仰對一個人來說有多大的可識別性。",
      "title": "如果一個現代的天主教徒被傳送到第四或第五世紀的普通時代，他們對基督教信仰會有多熟悉？"
    }
  ],
  "title": "If a modern catholic were to be transported to the fourth or fifth century common era, how familiar would the Christian faith be to them?",
  "created_utc": 1624249868,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I understand that during this time period the Christian faith was quite fractitious. There were multiple councils called during this time period with the intent of setting forth a clear doctrine. I am interested in how recognizable the Christian faith of this time period would be to a modern person.</p>\n\n<p>Thank you so much for any insight into this question.</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/o4hii8/if_a_modern_catholic_were_to_be_transported_to/",
  "subreddit": "AskHistorians",
  "id": "o4hii8",
  "is_self": true,
  "media": null,
  "is_video": false
}