{
  "author": "Fair_Still6667",
  "original_created_utc": 1631391324,
  "title": "When do you think you'll be able to retire because of your crypto investments?",
  "created_utc": 1631403203,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been in crypto maybe a year. I had high hopes of retiring this January and it could still happen. I&#39;ve got a substantial amount in ETH staked, also providing some safer low interest liquidity, and joined some BTC mining pools. Now if ETH goes to 10k and BTC to 100k around 2022, I think I&#39;ll be set. That&#39;s said I&#39;ve learned to tamp down my enthusiasm due to the wild swings we have. I also learned to stick with ETH and BTC mostly. I&#39;m really enthusiastic about them hitting 10k and 100k respectively. I&#39;m tempted to get into more tokens, or projects but I can&#39;t afford to gamble too much.</p>\n\n<p>That said, what investments do you have that&#39;s you think will alow you to retire, and how long before you think that may happen? I feel highly confident in ETH and BTC, so I&#39;m just trying to get a feel for people&#39;s confidence here on other projects. Not long shots, but what you think you&#39;ll retire because of. (Yes I know, it&#39;s all long shots but you know what I mean. Also this IS part of my DYOR.)</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/CryptoCurrency/comments/pmekeu/when_do_you_think_youll_be_able_to_retire_because/",
  "subreddit": "CryptoCurrency",
  "id": "pmekeu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've been in crypto maybe a year. I had high hopes of retiring this January and\nit could still happen. I've got a substantial amount in ETH staked, also\nproviding some safer low interest liquidity, and joined some BTC mining pools.\nNow if ETH goes to 10k and BTC to 100k around 2022, I think I'll be…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号の世界に入って1年くらいですかね。今年の1月には引退したいと思っていました。\nまだまだ可能性はあると思います。ETHはかなりの額をステークしています。\nまた、BTCのマイニングプールにも参加しています。\nもし2022年頃にETHが10k、BTCが100kになったら、私は...。",
      "title": "暗号投資のおかげで、いつ引退できると思いますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我从事加密货币也许有一年了。我曾对今年1月退休寄予厚望，而且\n它仍然可能发生。我已经在ETH上押了相当大的金额，也\n提供一些更安全的低利息流动性，并加入了一些BTC矿池。\n现在，如果ETH在2022年左右涨到1万，BTC涨到10万，我想我就...",
      "title": "你认为你什么时候能因为你的加密货币投资而退休？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我從事加密貨幣也許有一年了。我曾對今年1月退休寄予厚望，而且\n它仍然可能發生。我已經在ETH上押了相當大的金額，也\n提供一些更安全的低利息流動性，並加入了一些BTC礦池。\n現在，如果ETH在2022年左右漲到1萬，BTC漲到10萬，我想我就...",
      "title": "你認爲你什麼時候能因爲你的加密貨幣投資而退休？"
    }
  ]
}