{
  "author": "EffectOne675",
  "original_created_utc": 1625935574,
  "title": "The US constitution is the oldest active constitution in the world. So why has it not been rewritten and why is it sill so important today?",
  "created_utc": 1625968213,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Thomas Jefferson said the constitution should last about 20 years. that would be optimal as &quot;the earth belongs to the living not the dead&quot;. the average constitution is 19 years (according to Google).</p>\n\n<p>The US constitution is nearly 250 years old and the founding fathers couldn&#39;t imagine what America today would be like cars, technological and medical advances, societal changes etc. Even the government must be different from what it was then so why has it not not been written to more accurately reflect a more modern country/society?</p>\n</div><!-- SC_ON -->",
  "score": 110,
  "permalink": "/r/Ask_Politics/comments/ohm64q/the_us_constitution_is_the_oldest_active/",
  "subreddit": "Ask_Politics",
  "id": "ohm64q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Thomas Jefferson said the constitution should last about 20 years. that would be\noptimal as \"the earth belongs to the living not the dead\". the average\nconstitution is 19 years (according to Google).\n\nThe US constitution is nearly 250 years old and the founding fathers couldn't\nimagine what America…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "トーマス・ジェファーソンは、憲法は20年くらいで終わるべきだと言いました。\n地球は死者ではなく生者のものである」というのが最適です。\n平均的な憲法は19年です（Google調べ）。\n\nアメリカの憲法は約250年前のものですが、建国の父たちはアメリカがどのような国になるか想像できませんでした。\nアメリカがどのような国になるのか想像もできませんでした...",
      "title": "アメリカの憲法は、世界で最も古い現役の憲法です。では、なぜ書き換えられず、現在も重要視されているのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "托马斯-杰斐逊说宪法应该持续20年左右。\n最佳，因为 \"地球属于活人而不是死人\"。\n宪政是19年（根据谷歌）。\n\n美国的宪法有近250年的历史，开国元勋们无法\n想不到美国...",
      "title": "美国宪法是世界上最古老的现行宪法。那么，为什么它没有被重写，为什么它在今天仍然如此重要？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "托馬斯-傑斐遜說憲法應該持續20年左右。\n最佳，因爲 \"地球屬於活人而不是死人\"。\n憲政是19年（根據谷歌）。\n\n美國的憲法有近250年的歷史，開國元勳們無法\n想不到美國...",
      "title": "美國憲法是世界上最古老的現行憲法。那麼，爲什麼它沒有被重寫，爲什麼它在今天仍然如此重要？"
    }
  ]
}