{
  "author": "Siriuslymarauding",
  "original_created_utc": 1635370274,
  "title": "Do you ever think you’re not really here?",
  "created_utc": 1635392858,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ll try and explain. </p>\n\n<p>Sometimes I think that I’m watching all of this (life) happen. Like I can see everything happening and day to day life, but I’m removed from it.\nI often think that maybe I died a few years ago, and this is an alternate reality. </p>\n\n<p>Or I get massive urges to do ridiculous and dangerous things.. like ‘step off the edge’ or turn the car into the central reservation on the motorway. </p>\n\n<p>It’s a really strange feeling and I can lay awake some nights thinking about it and get myself into a bit of a state. </p>\n\n<p>In all other respects I’m a normal functioning member of society. Husband, 2 children, great job, chair of PTFA, friends and social life etc… but it just doesn’t feel real, or like I’m really there. </p>\n\n<p>Does everyone get this?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/qh75en/do_you_ever_think_youre_not_really_here/",
  "subreddit": "TooAfraidToAsk",
  "id": "qh75en",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’ll try and explain.\n\nSometimes I think that I’m watching all of this (life) happen. Like I can see\neverything happening and day to day life, but I’m removed from it. I often think\nthat maybe I died a few years ago, and this is an alternate reality.\n\nOr I get massive urges to do ridiculous and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "説明してみます。\n\n時々、私はこの（人生の）すべての出来事を見ているのではないかと思うことがあります。すべての出来事や日々の生活が見えているような\nすべての出来事や日々の生活が見えるのに、自分はそこから離れているような。よく思うのは\n自分は数年前に死んでいて、これは別の現実なのではないかと思うことがあります。\n\nあるいは、とんでもないことをしたいという強い衝動に駆られたり...。",
      "title": "自分は本当はここにいないのではないかと思うことはありませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我试着解释一下。\n\n有时我觉得我在看着这一切（生活）的发生。就像我可以看到\n发生的一切和日常的生活，但我却置身事外。我经常想\n也许我几年前就死了，而这是另一个现实。\n\n或者我有巨大的冲动，想做荒谬的事和...",
      "title": "你有没有想过你不是真的在这里？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我試着解釋一下。\n\n有時我覺得我在看着這一切（生活）的發生。就像我可以看到\n發生的一切和日常的生活，但我卻置身事外。我經常想\n也許我幾年前就死了，而這是另一個現實。\n\n或者我有巨大的衝動，想做荒謬的事和...",
      "title": "你有沒有想過你不是真的在這裏？"
    }
  ]
}