{
  "author": "Pixeth_",
  "original_created_utc": 1629814876,
  "title": "I've now realised that gradually investing in the top cryptos is probably better than investing in stocks. The growth is ridiculous and the potential is still huge.",
  "created_utc": 1629826365,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been investing in stocks for some time and only relatively recently got into crypto on a larger scale. In the time I&#39;ve been in crypto I&#39;ve seen my investments make far more in a far shorter time.</p>\n\n<p>Day trading has never been my thing; i&#39;m a put money in and let it sit kind of person and with crypto I just feel much more relaxed. Particularly as you don&#39;t really have to use a broker - just transfer your coins to a wallet and secure your passphrase.</p>\n\n<p>The potential for mass adoption is so exciting to me; I will always diversify but most of what i have invested is now in crypto.</p>\n\n<p>Crypto just seems on the verge of mass adoption and the monetary explosion which comes with it.</p>\n</div><!-- SC_ON -->",
  "score": 235,
  "permalink": "/r/CryptoCurrency/comments/paob40/ive_now_realised_that_gradually_investing_in_the/",
  "subreddit": "CryptoCurrency",
  "id": "paob40",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've been investing in stocks for some time and only relatively recently got\ninto crypto on a larger scale. In the time I've been in crypto I've seen my\ninvestments make far more in a far shorter time.\n\nDay trading has never been my thing; i'm a put money in and let it sit kind of\nperson and with…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は以前から株式投資をしていましたが、比較的最近になって\n大規模な暗号化を始めたのは比較的最近です。暗号に参加している間に、私は自分の投資額が増加するのを見ました。\n投資は、はるかに短い時間ではるかに多くの利益を上げています。\n\nデイトレードは得意ではありませんでした。\n私は資金を投入して放置するタイプの人間なので...",
      "title": "今では、上位のクリプトに徐々に投資していく方が、株式投資よりも良いかもしれないと気がつきました。成長がとんでもないことになっているし、可能性もまだまだ大きい。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我投资股票已经有一段时间了，最近才开始大规模投资加密货币。\n进入大规模的加密货币领域。在我从事加密货币的这段时间里，我看到我的投资在更短的时间内赚得更多。\n投资在更短的时间内赚得更多。\n\n日间交易从来不是我的事；我是一个把钱放进去，让它坐着的人。\n的人，并且与...",
      "title": "我现在已经意识到，逐渐投资于顶级加密货币可能比投资于股票更好。增长是荒谬的，潜力仍然是巨大的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我投資股票已經有一段時間了，最近纔開始大規模投資加密貨幣。\n進入大規模的加密貨幣領域。在我從事加密貨幣的這段時間裏，我看到我的投資在更短的時間內賺得更多。\n投資在更短的時間內賺得更多。\n\n日間交易從來不是我的事；我是一個把錢放進去，讓它坐着的人。\n的人，並且與...",
      "title": "我現在已經意識到，逐漸投資於頂級加密貨幣可能比投資於股票更好。增長是荒謬的，潛力仍然是巨大的。"
    }
  ]
}