{
  "author": "AdventurousDistance1",
  "original_created_utc": 1652532312,
  "title": "At what point did Elon Musk switch from being a hero idealized by reddit to a super villain billionaire hated by all?",
  "created_utc": 1652538564,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I remember a point where reddit was obsessed with how brilliant Elon Musk was and everything he did. Now he seems to be the villain that no one likes. what happened? Was the turning point in 2018, after the rescue of the soccer team suck in the cave in Thailand, where he got mad for not using his robot?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 122,
  "permalink": "/r/NoStupidQuestions/comments/upgi9o/at_what_point_did_elon_musk_switch_from_being_a/",
  "subreddit": "NoStupidQuestions",
  "id": "upgi9o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I remember a point where reddit was obsessed with how brilliant Elon Musk was\nand everything he did. Now he seems to be the villain that no one likes. what\nhappened? Was the turning point in 2018, after the rescue of the soccer team\nsuck in the cave in Thailand, where he got mad for not using his…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "イーロン・マスクがいかに素晴らしいかということに、redditが夢中になっていた時期があったのを覚えています。\nということに夢中になっていたのを覚えています。今は誰からも好かれない悪役のようですが、何があったのでしょうか？\nが起きたのでしょうか？転機は2018年、サッカーチームの救出後だったのか\nタイの洞窟で吸われた、彼が使わないことに腹を立てた...",
      "title": "イーロン・マスクは、どの時点で、redditが理想とするヒーローから、誰からも嫌われる超悪役の億万長者に切り替わったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我记得有一段时间，reddit沉迷于埃隆-马斯克是多么的辉煌\n和他所做的一切。现在他似乎成了没人喜欢的恶棍。\n发生了什么？转折点是在2018年，在拯救足球队之后\n在泰国的山洞里被吸，他因为没有使用他的...",
      "title": "在什么时候，埃隆-马斯克从一个被reddit理想化的英雄转变成一个被所有人讨厌的超级恶棍亿万富翁？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我記得有一段時間，reddit沉迷於埃隆-馬斯克是多麼的輝煌\n和他所做的一切。現在他似乎成了沒人喜歡的惡棍。\n發生了什麼？轉折點是在2018年，在拯救足球隊之後\n在泰國的山洞裏被吸，他因爲沒有使用他的...",
      "title": "在什麼時候，埃隆-馬斯克從一個被reddit理想化的英雄轉變成一個被所有人討厭的超級惡棍億萬富翁？"
    }
  ]
}