{
  "author": "fan_of_hakiksexydays",
  "original_created_utc": 1633529271,
  "title": "Common misconceptions about market cap.",
  "created_utc": 1633555883,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I see it too often in comments about market cap, either people overestimating what it means, or underestimating it. In either case, misunderstanding how it works and what it really means.</p>\n\n<h1>The Myth</h1>\n\n<p>Here&#39;s some of the misconceptions I see the most:</p>\n\n<p>-If a market cap is at $1Trillion, that means it took $1Trillion to get to this point. That&#39;s incorrect.</p>\n\n<p>-To raise a market cap by another $100 million, it means you need $100 million of money coming in. That&#39;s incorrect.</p>\n\n<p>-Market cap determines the value of that market. That&#39;s incorrect.</p>\n\n<p>-On the other side of it, I see people say that their high market cap $2 ADA coin could go to $100. Which would make them four times Bitcoin&#39;s market cap. That&#39;s unlikely to happen.</p>\n\n<h1>How it works</h1>\n\n<p>A market cap is not based on buy orders, how much money comes in, or anything to do with cash flow.</p>\n\n<p>It&#39;s simply a formula calculating (total shares) x (price of shares).</p>\n\n<p>Yes, it really is as stupid as that. There&#39;s no other element taken into account.</p>\n\n<p>Latest price is the key. If there&#39;s a lot of shares bought for dirt cheap, but the last buy order decided that the price would be $1M per share, then the market cap could become astronomical.</p>\n\n<p>Or you could have only 1 person buy a share and no one else, and pay $1M. If there&#39;s 1 million shares, the market cap would be $1Trillion.</p>\n\n<p>For a company and its stock, market cap does still make some sense. But applying that same principle on a coin, may not make as much sense.</p>\n\n<p>In crypto, it&#39;s the circulating supply multiplied by the current market price of the coin...based on fiat. This gets a little muddy as you have coins mined or issued, different caps on supply, very volatile volume, and you are pegging a currency to another currency.</p>\n\n<p>To the point where you have to question if it even makes any sense to look at market caps for crypto.</p>\n\n<h1>Example</h1>\n\n<p>One more extreme example I like to use are Moons. Earlier this year, Moons were hovering around $0.10. Until someone placed an order worth only around $15,000. Because of the ridiculously low volume and small market, the price spiked above $0.30. That was a market cap increase of over $10 Million.</p>\n\n<p>But there was never $10M involved in any way. Depending on the volume, and the action of the market, you can increase the market cap of a coin without even that much money.</p>\n\n<p>So yea, it&#39;s not completely impossible in theory for some shitcoin to match Bitcoin&#39;s market cap on a fluke. It&#39;s still very unlikely. But we have seen how ridiculously high ICP jumped out of nowhere in market cap within days, into the top 10.</p>\n\n<p>It&#39;s also not inconceivable for Bitcoin to reach prices in the hundreds of thousands. You wouldn&#39;t actually need entire nations GDP to push the price that high.</p>\n\n<h1>How to use market caps</h1>\n\n<p>On its own, market caps in crypto don&#39;t mean that much, but you can still make some use of them if you combine that data with other data.</p>\n\n<p>You have to take into account other elements, like trading volume of a coin, minting and supply limits, some of the tokenomics like burning, etc...</p>\n\n<p>And market cap should really be considered relative to other coins, preferably of similar tokenomics and appealing to a similar market.</p>\n\n<p>And more importantly, be compared within cryptocurrency. Comparing the market cap of a coin to the market cap of a stock becomes very meaningless.</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/CryptoCurrency/comments/q2l7b0/common_misconceptions_about_market_cap/",
  "subreddit": "CryptoCurrency",
  "id": "q2l7b0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I see it too often in comments about market cap, either people overestimating\nwhat it means, or underestimating it. In either case, misunderstanding how it\nworks and what it really means.\n\n\nTHE MYTH\n\nHere's some of the misconceptions I see the most:\n\n-If a market cap is at $1Trillion, that means it…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "時価総額についてのコメントでよく見かけるのは、人々が自分の価値を過大評価しているか\n過大評価している人、過小評価している人。どちらにしても、その仕組みと本当の意味を誤解しています。\n本当の意味での誤解です。\n\n\n誤解\n\n私がよく目にする誤解は以下の通りです。\n\n-時価総額が1兆ドルであれば、それはその企業が...",
      "title": "マーケットキャップにまつわるよくある誤解"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在关于市值的评论中经常看到这种情况，人们要么高估了市值的意义，要么低估了市值。\n它意味着什么，或者低估了它。无论哪种情况，都是对它的工作原理和真正含义的误解\n运作方式和真正的含义。\n\n\n谬论\n\n以下是我看到最多的一些误解。\n\n-如果一家公司的市值是1万亿美元，那就意味着它是一个大公司。",
      "title": "关于市值的常见误解。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在關於市值的評論中經常看到這種情況，人們要麼高估了市值的意義，要麼低估了市值。\n它意味着什麼，或者低估了它。無論哪種情況，都是對它的工作原理和真正含義的誤解\n運作方式和真正的含義。\n\n\n謬論\n\n以下是我看到最多的一些誤解。\n\n-如果一家公司的市值是1萬億美元，那就意味着它是一個大公司。",
      "title": "關於市值的常見誤解。"
    }
  ]
}