{
  "author": "Many_Scratch2269",
  "original_created_utc": 1642161737,
  "title": "I hate to say it, but a lot of the newer Crypto investors aren't investing, but rather gambling.",
  "created_utc": 1642167581,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Most newbies think that Crypto is something that will make you rich overnight, and they end up investing in low market cap coins before they &amp;quot;moon&amp;quot;. Of course a few of them might have the potential to give you great returns, but a lot of people completely end up ignoring the risk factor. &lt;/p&gt;\n\n&lt;h1&gt;CryptoMoonShots vs &lt;a href=\"/r/Cryptocurrency\"&gt;r/Cryptocurrency&lt;/a&gt;&lt;/h1&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/azvhoo2o3nb81.png?width=1099&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=d6668d709c5ff7f2f82bd1a4ef1ce276700af48d\"&gt;https://preview.redd.it/azvhoo2o3nb81.png?width=1099&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=d6668d709c5ff7f2f82bd1a4ef1ce276700af48d&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;The CryptoMoonShots subreddit has even started to outpace the Cryptocurrency subreddit in terms of growth. It is a terrible thing to see considering the vast majority of the cryptocurrencies advertised there there are complete scam projects. &lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t get me wrong. Some low market coins do have great utility and great future potential, but when you start going lower into the low millions or hundreds of thousands, the risk far outweighs their benefits.&lt;/p&gt;\n\n&lt;p&gt;If you are new to Crypto, the best thing you can do in Crypto is DCA and accumulate larger projects for the long term. Crypto is not the stock market, and deviating away from trusted projects or trying to rely on technical analysis is very risky.&lt;/p&gt;\n\n&lt;p&gt;TLDR: Unfortunately a lot of the newbies that are joining Crypto are completely ignoring even top 100 coins and are choosing to put their money in these shady &amp;quot;get rich quick&amp;quot; schemes which is nothing short of gambling.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 377,
  "permalink": "/r/CryptoCurrency/comments/s3qrsk/i_hate_to_say_it_but_a_lot_of_the_newer_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "s3qrsk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Most newbies think that Crypto is something that will make you rich overnight,\nand they end up investing in low market cap coins before they \"moon\". Of course\na few of them might have the potential to give you great returns, but a lot of\npeople completely end up ignoring the risk…"
}