{
  "author": "Artistic_Necessary77",
  "original_created_utc": 1636126553,
  "title": "I held a presentation on cryptocurrency",
  "created_utc": 1636176917,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I study bachelor in economics and today i held a presentation for the whole class on blockchain and crypto currency</p>\n\n<p>Before the presentation my class mates told me they wouldnt understand shit, but I kept the explanations and examples simple and people actually enjoyed it and told me they are going to look into it.</p>\n\n<p>The teacher was hestiant at first, but was thrilled after.</p>\n\n<p>This gave me such a good feeling, and I really think adoption through knowledge and awarness is the way.</p>\n\n<p>That’s it. Have i Nice weekend peeps &lt;3</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/CryptoCurrency/comments/qndq7y/i_held_a_presentation_on_cryptocurrency/",
  "subreddit": "CryptoCurrency",
  "id": "qndq7y",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I study bachelor in economics and today i held a presentation for the whole\nclass on blockchain and crypto currency\n\nBefore the presentation my class mates told me they wouldnt understand shit, but\nI kept the explanations and examples simple and people actually enjoyed it and\ntold me they are going…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は経済学の学士号を取得していますが、今日はクラス全体に向けて、ブロックチェーンと暗号通貨に関するプレゼンテーションを行いました。\nブロックチェーンと暗号通貨に関するプレゼンテーションを行いました。\n\n発表の前にクラスメートは「理解できないだろう」と言っていたのですが\n私は説明と例をシンプルにしたところ、皆が実際に楽しんでくれて\nと言ってくれました...",
      "title": "暗号通貨に関するプレゼンテーションを行いました"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我学的是经济学学士，今天我为全班同学做了一个关于区块链和加密货币的演讲。\n召开了一次关于区块链和加密货币的演讲。\n\n在演讲之前，我的同学们告诉我他们什么都不懂，但\n但我保持了简单的解释和例子，人们实际上很喜欢它，并告诉我他们将...\n告诉我他们要...",
      "title": "我举行了一场关于加密货币的演讲"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我學的是經濟學學士，今天我爲全班同學做了一個關於區塊鏈和加密貨幣的演講。\n召開了一次關於區塊鏈和加密貨幣的演講。\n\n在演講之前，我的同學們告訴我他們什麼都不懂，但\n但我保持了簡單的解釋和例子，人們實際上很喜歡它，並告訴我他們將...\n告訴我他們要...",
      "title": "我舉行了一場關於加密貨幣的演講"
    }
  ]
}