{
  "author": "dragondude4",
  "original_created_utc": 1635893534,
  "title": "Famous Bitcoin Addresses and Transactions",
  "created_utc": 1635917437,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>These are pieces of history anyone can view, stored forever on the most secure network in the world. One of the coolest part about the blockchain being an open, decentralized and immutable ledger is that you can look back into the past at snapshots of very special moments. Here are some famous bitcoin addresses and transactions that involve turning points in the evolution of the currency, or are related to important people or events:</p>\n\n<ul>\n<li><p><a href=\"https://www.blockchain.com/btc/address/1A1zP1eP5QGefi2DMPTfTL5SLmv7DivfNa\">The Genesis Block</a> - The first ever Bitcoin block, mined by Satoshi on Jan 9, 2009. Hundreds of Bitcoin enthusiasts continue to show their appreciation by transferring small amounts of BTC to the same address. As of Aug 19, 2020, there was a total of 68.33526331 BTC logged at the address.</p></li>\n<li><p><a href=\"https://blockchain.info/de/address/12cbQLTFMXRnSzktFkuoG3eHoMeFtpTu3S\">Satoshi&#39;s only transaction</a> - This, as far as we know, is the only known address Satoshi ever spent coins from and sent 10 BTC to Hal Finney.</p></li>\n<li><p><a href=\"https://www.blockchain.com/btc/address/1XPTgDRhN8RFnzniWCddobD9iKZatrvH4\">The &quot;Bitcoin Pizza&quot; transaction</a> - On May 22 every year, crypto enthusiasts all over the world celebrate the anniversary of “Bitcoin Pizza Day” by eating pizza? The trend began when Laszlo Hanyecz ordered and paid for two pizzas with 10,000 BTC. This was the first Bitcoin transaction in the real world. Based on the Aug 3, 2021 BTC value of approx. $38,000, that single pizza would be worth around $382 million!</p></li>\n<li><p><a href=\"https://blockchain.info/de/tx/29a3efd3ef04f9153d47a990bd7b048a4b2d213daaa5fb8ed670fb85f13bdbcf\">Largest transaction ever</a> - apparantly the single largest transaction ever (550,000 BTC)</p></li>\n<li><p><a href=\"https://blockchain.info/address/1F1tAaz5x1HUXrCNLbtMDqcw6o5GNn4xqX\">Silk Road seized hot wallet coins</a> - The address of the seized hot wallet coins belonging to the users of the infamous Silk Road dark net marketplace.</p></li>\n<li><p><a href=\"https://blockchain.info/address/1FfmbHfnpaZjKFvyi1okTjJJusN455paPH\">Ross Ulbricht (DreadPirateRoberts) personal BTC stash</a> - The personal stash of the infamous Silk Road dark net marketplace founder Ross Ulbricht. Now seized by the FBI.</p></li>\n<li><p><a href=\"https://blockchain.info/tx/3a1b9e330d32fef1ee42f8e86420d2be978bbe0dc5862f17da9027cf9e11f8c4\">MT.GOX &quot;proof of assets&quot; transaction</a> - When bitcoin exchange Mt.Gox was struggling to stay afloat prior to their infamous collapse, then CEO Mark Karpeles wanted to prove that Mt.Gox was financially sound. To do so, he performed one of the biggest and most risky bitcoin transactions ever. The transaction was from Mt.Gox to Mt.Gox, but regardless it was sent over the bitcoin network to the tune of 442,000 bitcoins.</p></li>\n<li><p><a href=\"https://www.newsday.com/classifieds/cars/bitcoin-used-for-tesla-model-s-purchase-at-lamborghini-dealership-1.6568853\">December 6, 2013: Bitcoin accepted as payment for Tesla Model S</a> - According to a news report about Lamborghini Newport Beach car dealership in California, they sold a Tesla Model S electric car for 91.4 bitcoins, or $103,000 at the time of purchase. The transaction was handled by payment processor BitPay, said Cedric Davy, marketing director for the Costa Mesa, California based dealership. The dealership has never accepted bitcoin directly, but BitPay’s merchant processing service allowed the buyer to use bitcoin as a form of payment, <a href=\"http://www.cnbc.com/2013/12/09/buying-a-tesla-with-bitcoin-not-so-fast.html\">which was converted into USD</a> once the transaction was complete.</p></li>\n<li><p><a href=\"https://blockchain.info/de/tx/a289ea76bcc396412e90d63b90eb462ea2adb326aa027d5a1bb8864c7c152012\">One of the richest entities</a> - This transaction links 9 addresses each holding 66,000+ BTC that most definitely belong to the same entity (lets hope not a single person) and the 10th address in the blockchain with the same characteristics is likely part of that. This would imply that a single entity holds over 660,000 Bitcoins.</p></li>\n<li><p><a href=\"https://blockchain.info/tx/9e95c3c3c96f57527cdc649550bf8e92892f7651f718d846033798aee333b0c3\">The U.S. Marshal’s Auction</a> - When the online black market Silk Road was shut down, the U.S. government seized roughly 144,000 bitcoins. In what was a three-part auction, the <a href=\"http://www.coindesk.com/us-marshals-one-auction-bidder-claimed-all-30000-silk-road-bitcoins/\">first auction of coins was sold</a> to venture capitalist and entrepreneur Tim Draper which was for 30,000 bitcoins, worth $19 million USD at the time.</p></li>\n<li><p><a href=\"https://blockchain.info/address/1FeexV6bAHb8ybZjqQMjJrcCrHGW9sb6uF\">Very old Bitcoins</a> - This address holds almost 80,000 Bitcoins and has never been touched since the deposit in early 2011</p></li>\n</ul>\n\n<p>Have I missed any important transactions? If you know any that I failed to mention please comment it on this thread! Hope you enjoy this little peak into history.</p>\n</div><!-- SC_ON -->",
  "score": 167,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/xf5WRDvubf0PhY4le0v4W4wr81N87tj2wQnRGoW9Td8.jpg?auto=webp&s=c1ced0f4a1ab60898fb9919fdad1364127afca34",
          "width": 384,
          "height": 202
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/xf5WRDvubf0PhY4le0v4W4wr81N87tj2wQnRGoW9Td8.jpg?width=108&crop=smart&auto=webp&s=d8af5dbd817197d438fe5779d7ed3fb3fef97062",
            "width": 108,
            "height": 56
          },
          {
            "url": "https://external-preview.redd.it/xf5WRDvubf0PhY4le0v4W4wr81N87tj2wQnRGoW9Td8.jpg?width=216&crop=smart&auto=webp&s=f2f581aff666da605e242bae0d30e36b5e03fc73",
            "width": 216,
            "height": 113
          },
          {
            "url": "https://external-preview.redd.it/xf5WRDvubf0PhY4le0v4W4wr81N87tj2wQnRGoW9Td8.jpg?width=320&crop=smart&auto=webp&s=06f7f5451936bc461c285fe1d29a2dc49ca32b4b",
            "width": 320,
            "height": 168
          }
        ],
        "variants": {},
        "id": "XFlerzvs5kFGXARq-1TqbiS0gL88z1a9BGeyD7jTbyo"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/qlghp8/famous_bitcoin_addresses_and_transactions/",
  "subreddit": "CryptoCurrency",
  "id": "qlghp8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "These are pieces of history anyone can view, stored forever on the most secure\nnetwork in the world. One of the coolest part about the blockchain being an\nopen, decentralized and immutable ledger is that you can look back into the past\nat snapshots of very special moments. Here are some famous…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "誰もが見ることができる歴史の断片であり、世界で最も安全なネットワークに永遠に保存されています。\n世界で最も安全なネットワークに永遠に保存されます。ブロックチェーンの最も素晴らしい点の一つは\nオープンで分散化された不変の台帳であるブロックチェーンの最も素晴らしい点は、非常に特別な瞬間のスナップショットを過去に遡って見ることができることです。\n非常に特別な瞬間のスナップショットを過去に振り返ることができることです。ここでは、いくつかの有名な...",
      "title": "有名なビットコインのアドレスとトランザクション"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这些是任何人都可以查看的历史片段，永远储存在世界最安全的\n的网络上永远保存。区块链最酷的部分之一就是它是一个\n区块链是一个开放的、去中心化的和不可改变的账本，最酷的部分是你可以回顾过去\n在非常特别的时刻的快照。这里有一些著名的...",
      "title": "著名的比特币地址和交易"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這些是任何人都可以查看的歷史片段，永遠儲存在世界最安全的\n的網絡上永遠保存。區塊鏈最酷的部分之一就是它是一個\n區塊鏈是一個開放的、去中心化的和不可改變的賬本，最酷的部分是你可以回顧過去\n在非常特別的時刻的快照。這裏有一些著名的...",
      "title": "著名的比特幣地址和交易"
    }
  ]
}