{
  "author": "DeliciousFold2894",
  "original_created_utc": 1639413597,
  "title": "Why is broth “clear” in western cooking?",
  "created_utc": 1639450273,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’ve been on a recent ramen making bender, and noticed a stark difference between the western (read:French) and Japanese broth cooking methods. In French stocks the bones are boiled at barely a simmer to avoid emulsifying fats and to make as clear a  stock as possible. In a Japanese paitan (cloudy stock) the bones are agitated and cooked at a rolling boil to make the thickest soup possible. In Japanese food, both chintan (clear stock) and paitan (cloudy stock) are common and desirable. I’ve never heard of an intentionally cloudy western stock. Why is this?&lt;/p&gt;\n\n&lt;p&gt;Edit: just thought of an addition. ARE there any intentionally cloudy broths that fell out of fashion?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/rfjvd6/why_is_broth_clear_in_western_cooking/",
  "subreddit": "AskHistorians",
  "id": "rfjvd6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’ve been on a recent ramen making bender, and noticed a stark difference\nbetween the western (read:French) and Japanese broth cooking methods. In French\nstocks the bones are boiled at barely a simmer to avoid emulsifying fats and to\nmake as clear a stock as possible. In a Japanese paitan (cloudy…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、ラーメンを作り続けていて、その違いに気づきました。\n欧米（フランス）と日本のダシの取り方の違い。フランスでは\n油脂の乳化を防ぐため、骨はほとんど沸騰させない。\nなるべく澄んだスープを作る。日本のパイタン（白濁した...",
      "title": "なぜ西洋料理では出汁が「澄む」のでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近一直在做拉面，并注意到一个明显的区别\n我注意到西方（读作：法国）和日本的肉汤烹饪方法之间的明显区别。在法国\n在法国的汤里，骨头几乎是用小火煮的，以避免脂肪乳化，并尽可能使汤清澈。\n尽可能做出清澈的汤。在日本的paitan（浑浊的汤）中...",
      "title": "为什么肉汤在西餐中是 \"清 \"的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近一直在做拉麪，並注意到一個明顯的區別\n我注意到西方（讀作：法國）和日本的肉湯烹飪方法之間的明顯區別。在法國\n在法國的湯裏，骨頭幾乎是用小火煮的，以避免脂肪乳化，並儘可能使湯清澈。\n儘可能做出清澈的湯。在日本的paitan（渾濁的湯）中...",
      "title": "爲什麼肉湯在西餐中是 \"清 \"的？"
    }
  ]
}