{
  "author": "svitlanamidianko",
  "original_created_utc": 1647935506,
  "title": "Launched by first-ever product for self-tracking! Check it out.",
  "created_utc": 1647945574,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I launched my first ever product and am trying to figure out distribution now. If you could check and give feedback on this product, I would greatly appreciate it!  &lt;/p&gt;\n\n&lt;p&gt;I co-built Lyfe with a mission to improve people&amp;#39;s well-being in a data-driven way. We hope it becomes a personal buddy interface between you and the mountains of data you generate each day.  Its current main features are:&lt;br/&gt;\n✨Mood, activity, and anything tracking&lt;br/&gt;\n✨User-friendly dashboard that displays correlations, habits, you name it&lt;br/&gt;\n✨Check out more on &lt;a href=\"https://lyfe.ltd\"&gt;lyfe.ltd&lt;/a&gt; or &lt;a href=\"https://www.producthunt.com/posts/lyfe-3\"&gt;https://www.producthunt.com/posts/lyfe-3&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 5,
  "permalink": "/r/SideProject/comments/tjxrnu/launched_by_firstever_product_for_selftracking/",
  "subreddit": "SideProject",
  "id": "tjxrnu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I launched my first ever product and am trying to figure out distribution now.\nIf you could check and give feedback on this product, I would greatly appreciate\nit!\n\nI co-built Lyfe with a mission to improve people's well-being in a data-driven\nway. We hope it becomes a personal buddy interface…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "初めて製品を発売し、今、流通を考えているところです。\nもし、この製品についてチェックし、フィードバックしていただけるなら、私は非常に感謝します。\nをご覧ください。\n\n私は、データ駆動で人々の幸福を向上させるというミッションのもと、Lyfeを共同開発しました。\nの方法です。個人の相棒的なインターフェイスになればと...。",
      "title": "世界初！セルフトラッキングのための製品を販売開始 チェックしてみてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我推出了我的第一个产品，现在正试图搞清楚分销。\n如果你能检查并反馈这个产品，我将非常感激。\n我将不胜感激!\n\n我共同建立了Lyfe，其使命是以数据驱动的方式提高人们的幸福感。\n的方式改善人们的福祉。我们希望它成为一个个人好友界面...",
      "title": "由有史以来第一个用于自我跟踪的产品推出! 看看吧。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我推出了我的第一個產品，現在正試圖搞清楚分銷。\n如果你能檢查並反饋這個產品，我將非常感激。\n我將不勝感激!\n\n我共同建立了Lyfe，其使命是以數據驅動的方式提高人們的幸福感。\n的方式改善人們的福祉。我們希望它成爲一個個人好友界面...",
      "title": "由有史以來第一個用於自我跟蹤的產品推出! 看看吧。"
    }
  ]
}