{
  "author": "Foufou190",
  "the_new_excerpt": "All right folks for those of us who bought very cheap for a few thousands, \"last\nchance to buy at 30k\" can also very well be \"last chance to sell at 30k\".\n\nSo reality is -25% is nothing for a bitcoin correction so if you believe you\nwant to sell part of your portfolio to rebuy cheaper, just do it,…",
  "original_created_utc": 1610383934,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，伙计们，对于我们这些花几千美元就买得很便宜的人来说，“最后一次\n以30K买入的机会“也很可能是”以30K卖出的最后机会“。\n\n所以现实是-25%对于比特币修正来说算不了什么，所以如果你相信你\n想卖掉你的投资组合的一部分以更便宜的价格回购，那就这么做吧，…",
      "title": "非常不受欢迎的观点：不要听信别人说的“最后一次3万买的机会”"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，夥計們，對於我們這些花幾千美元就買得很便宜的人來說，“最後一次\n以30K買入的機會“也很可能是”以30K賣出的最後機會“。\n\n所以現實是-25%對於比特幣修正來說算不了什麼，所以如果你相信你\n想賣掉你的投資組合的一部分以更便宜的價格回購，那就這麼做吧，…",
      "title": "非常不受歡迎的觀點：不要聽信別人說的“最後一次3萬買的機會”"
    }
  ],
  "title": "Very unpopular opinion: DO NOT listen to people saying \"last chance to buy at 30k\"",
  "created_utc": 1610405122,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>All right folks for those of us who bought very cheap for a few thousands, &quot;last chance to buy at 30k&quot; can also very well be &quot;last chance to sell at 30k&quot;.</p>\n\n<p>So reality is -25% is nothing for a bitcoin correction so if you believe you want to sell part of your portfolio to rebuy cheaper, just do it, and if you want to HODL for ever without taking this risk, good for you we will meet again at 150k anyway but don&#39;t spread intox like this.</p>\n\n<p>&#x200B;</p>\n\n<p>by the way I am posting here after several removals from <a href=\"/r/bitcoin\">r/bitcoin</a>, we do have different opinions but this censorship needs to end if we want cryptos to be taken seriously.</p>\n</div><!-- SC_ON -->",
  "score": 850,
  "permalink": "/r/CryptoCurrency/comments/kv6kda/very_unpopular_opinion_do_not_listen_to_people/",
  "subreddit": "CryptoCurrency",
  "id": "kv6kda",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706376235
}