{
  "author": "IllFox3004",
  "original_created_utc": 1644594885,
  "title": "My Fiance's Employer Wants to See My Holdings",
  "created_utc": 1644611810,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My fiance&amp;#39;s company is requiring it&amp;#39;s employees and anyone who lives with said employees to disclose their crypto holdings.  Am I legally obligated to do so?  They already have access to my Fidelity account and now they want my bitcoin too?  Apparently they have some &amp;quot;Blacklist&amp;quot; and &amp;quot;Bitcoin will never be on it.&amp;quot;  At this point I might just transfer what I have in Coinbase to my cold storage and tell them I have nothing.  Anyone have a similar situation or ways to get around this?  Thanks.&lt;/p&gt;\n\n&lt;p&gt;Edit: Thank you to all who provided insight. I think I’ll transfer what I have on the exchange to my cold storage and be done with it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 357,
  "permalink": "/r/Bitcoin/comments/sq2kq3/my_fiances_employer_wants_to_see_my_holdings/",
  "subreddit": "Bitcoin",
  "id": "sq2kq3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "My fiance's company is requiring it's employees and anyone who lives with said\nemployees to disclose their crypto holdings. Am I legally obligated to do so?\nThey already have access to my Fidelity account and now they want my bitcoin\ntoo? Apparently they have some \"Blacklist\" and \"Bitcoin will…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私のフィアンセの会社では、社員とその社員と同居している人に対し\n社員は暗号の保有量を開示する必要があります。私は法的にそうする義務があるのでしょうか？\n彼らはすでに私のフィデリティ口座にアクセスしており、今度は私のビットコインを欲しがっています。\nも？どうやら「ブラックリスト」「ビットコインは...」というのがあるようです。",
      "title": "フィアンセの勤務先が私の手帳を見たいと言っているのですが。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我未婚夫的公司要求它的员工和与该员工同住的人\n披露他们的加密货币持有量。我在法律上有义务这样做吗？\n他们已经可以进入我的Fidelity账户，现在他们想让我的比特币\n也要？显然，他们有一些 \"黑名单 \"和 \"比特币将...",
      "title": "我未婚夫的雇主想看我的控股权"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我未婚夫的公司要求它的員工和與該員工同住的人\n披露他們的加密貨幣持有量。我在法律上有義務這樣做嗎？\n他們已經可以進入我的Fidelity賬戶，現在他們想讓我的比特幣\n也要？顯然，他們有一些 \"黑名單 \"和 \"比特幣將...",
      "title": "我未婚夫的僱主想看我的控股權"
    }
  ]
}