{
  "author": "arandom_econstudent",
  "original_created_utc": 1633526893,
  "title": "1.1 billion in futures shorts liquidated accross the crypto market as Bitcoin rose 5% in 3 minutes to 55k",
  "created_utc": 1633537986,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As you guys just saw there was a HUGE pump just a few minutes ago. This caused a massive amount of shorts to get liquidated across all exchanges.</p>\n\n<p>On the one hand this makes me happy because this took capital and money from the people who keep prices down. On the other hand I feel a little sorry for those who were average persons and had a short position. But at least I hope they learnt the lesson. </p>\n\n<p>Also, usually after a big short liquidation comes a corrections (as we saw from the 42k local high that then dropped to 37k) or the liquidations at 50k, which then pumped to 52k to correct downwards to 40k. </p>\n\n<p>So just beware, do not invest more than you can afford to lose and avoid leverage. Crypto makes some crazy gains anyways.</p>\n\n<p>Hope this helps</p>\n</div><!-- SC_ON -->",
  "score": 189,
  "permalink": "/r/CryptoCurrency/comments/q2kgwa/11_billion_in_futures_shorts_liquidated_accross/",
  "subreddit": "CryptoCurrency",
  "id": "q2kgwa",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As you guys just saw there was a HUGE pump just a few minutes ago. This caused a\nmassive amount of shorts to get liquidated across all exchanges.\n\nOn the one hand this makes me happy because this took capital and money from the\npeople who keep prices down. On the other hand I feel a little sorry for…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さんがご覧になったように、ほんの数分前に巨大なポンプが発生しました。これにより\nすべての取引所で大量のショートが清算されました。\n\n一方では、価格を下げようとしている人たちから資本とお金を奪ったということで、これは私にとって喜ばしいことです。\n価格を下げている人たちから資本とお金を奪ったからです。一方で、私は少し気の毒に思っています...",
      "title": "ビットコインが3分間で5％上昇し、55kになったことで、暗号市場全体で11億ドルの先物ショートが清算された。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "正如你们刚才看到的，几分钟前有一个巨大的泵。这导致\n导致大量空头在所有交易所被清算。\n\n一方面，这让我很高兴，因为这从那些压低价格的人那里拿走了资本和资金。\n人的资金和金钱，他们压低了价格。另一方面，我感到有点遗憾的是...",
      "title": "比特币在3分钟内上涨5%至55K，整个加密货币市场有11亿的期货空头被清算。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "正如你們剛纔看到的，幾分鐘前有一個巨大的泵。這導致\n導致大量空頭在所有交易所被清算。\n\n一方面，這讓我很高興，因爲這從那些壓低價格的人那裏拿走了資本和資金。\n人的資金和金錢，他們壓低了價格。另一方面，我感到有點遺憾的是...",
      "title": "比特幣在3分鐘內上漲5%至55K，整個加密貨幣市場有11億的期貨空頭被清算。"
    }
  ]
}