{
  "author": "Crafty_Supermarket15",
  "original_created_utc": 1631035176,
  "title": "This price drop is blatant manipulation. Don’t let nation states and power brokers win.",
  "created_utc": 1631054138,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>On the day the first country in the world adopts bitcoin as legal tender, it drops 20%…Does that sound right to you?</p>\n\n<p>If that isn’t the most obvious example of nation state manipulation I don’t know what is. It also wholly validates the idea that bitcoin is a threat to these players.  It is however only a peaceful threat because they can’t control it and it’s free whether they like it or not. </p>\n\n<p>GME folks, this is how you stick it to the man!</p>\n\n<p>Never selling.</p>\n</div><!-- SC_ON -->",
  "score": 192,
  "permalink": "/r/Bitcoin/comments/pjritp/this_price_drop_is_blatant_manipulation_dont_let/",
  "subreddit": "Bitcoin",
  "id": "pjritp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "On the day the first country in the world adopts bitcoin as legal tender, it\ndrops 20%…Does that sound right to you?\n\nIf that isn’t the most obvious example of nation state manipulation I don’t know\nwhat is. It also wholly validates the idea that bitcoin is a threat to these\nplayers. It is however…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "世界で初めてビットコインを法定通貨として採用した日には\n20％下落する......これは正しいと思いませんか？\n\nこれが国家による操作の最も明白な例でなければ、何がそうなのか私にはわかりません。\n何なのか。また、ビットコインがこれらのプレーヤーにとって脅威であるという考えを完全に立証しています。\n脅威であるという考えを裏付けるものです。しかし、それは...",
      "title": "この値下げはあからさまな操作です。国家や権力者に負けてはいけない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在世界第一个国家采用比特币作为法定货币的那天，它\n跌了20%......你觉得这听起来对吗？\n\n如果这还不是最明显的民族国家操纵的例子，我不知道什么是\n什么才是。这也完全验证了比特币对这些玩家是一种威胁的想法\n玩家的威胁。然而，它是...",
      "title": "这种价格下跌是公然的操纵行为。不要让民族国家和权力掮客得逞。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在世界第一個國家採用比特幣作爲法定貨幣的那天，它\n跌了20%......你覺得這聽起來對嗎？\n\n如果這還不是最明顯的民族國家操縱的例子，我不知道什麼是\n什麼纔是。這也完全驗證了比特幣對這些玩家是一種威脅的想法\n玩家的威脅。然而，它是...",
      "title": "這種價格下跌是公然的操縱行爲。不要讓民族國家和權力掮客得逞。"
    }
  ]
}