{
  "author": "resectioningzone31",
  "original_created_utc": 1625949237,
  "title": "NEVER, EVER tell ANYONE about your crypto holdings",
  "created_utc": 1625977835,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello all. I am new in this market, and made a post earlier about a &quot;friend&quot; of mine who ever since the elon tweets just full on turned into an insufferable smug asshole. The reason? I made the mistake of telling him i bought some bitcoin and other things.</p>\n\n<p>&#x200B;</p>\n\n<p>From that point on it was constant jabs, and forwarding of every single FUD article he can find into my group chat and passive-aggressively making comments towards me. Keep in mind: He did NOT care at all about crypto , up until I told him about it. And now he made it his personal mission to be a smug asshole as often as he can, about anything that paints crypto as a ponzi/scam/energy waste that will doom humanity.</p>\n\n<p>&#x200B;</p>\n\n<p>Well, I KNOW it was my mistake for telling him. but it&#39;s been 3 months, and every 2-3 days its the same old shit. I nuked the group discord so that it&#39;s gone, disbanded the group chat and basically scattered the entire group and told him to shut the fuck up about crypto, and that I know he has something to say to me but he&#39;d rather pussy-foot around it and be a smug asshole and forward me forbes articles.</p>\n\n<p>&#x200B;</p>\n\n<p>I hope those cheap chuckles were worth it, asshole. I was one of your last friends</p>\n\n<p>&#x200B;</p>\n\n<p>Also, I KNOW IM DOWN 30%. I don&#39;t need some dickhead reminding me about it infront of my other friends every 2-3 days&#39;</p>\n\n<p>and even IF i may consider all crypto/stocks a pyramid scheme in some sense - he isn&#39;t coming from a place of concern. He&#39;s just being a smug asshole. He even told me &quot;I indirectly make people feel like shit&quot; and was proud of himself - because he cant just come out and say &quot;i think you are a retard for buying bitcoin&quot;</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/Bitcoin/comments/ohqc80/never_ever_tell_anyone_about_your_crypto_holdings/",
  "subreddit": "Bitcoin",
  "id": "ohqc80",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hello all. I am new in this market, and made a post earlier about a \"friend\" of\nmine who ever since the elon tweets just full on turned into an insufferable\nsmug asshole. The reason? I made the mistake of telling him i bought some\nbitcoin and other things.\n\n\n\nFrom that point on it was constant jabs,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。私はこの市場では新参者で、以前、私の「友人」について投稿しました。\n私の友人は、エロンのツイート以来、我慢できないほどの\n独りよがりのクソ野郎になってしまいました。その理由は？私は間違えて、彼にビットコインやその他のものを買ったと言ってしまいました。\nビットコインなどを買ったと伝えたのが間違いだったのです。\n\n\n\nそれからは、常に冗談を言ったり...",
      "title": "保有している暗号を誰にも絶対に教えない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。我是这个市场的新成员，早些时候发了一个帖子，说我的一个 \"朋友\"，自从埃隆的推文发布后，他就完全变成了一个骗子。\n我的一个 \"朋友\"，自从埃隆的推文发布后，就完全变成了一个令人难以忍受的\n自以为是的混蛋。原因是什么？我犯了一个错误，告诉他我买了一些\n比特币和其他东西。\n\n\n\n从那时起，他就不断地嘲笑，...",
      "title": "永远不要告诉任何人你所持有的加密货币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。我是這個市場的新成員，早些時候發了一個帖子，說我的一個 \"朋友\"，自從埃隆的推文發佈後，他就完全變成了一個騙子。\n我的一個 \"朋友\"，自從埃隆的推文發佈後，就完全變成了一個令人難以忍受的\n自以爲是的混蛋。原因是什麼？我犯了一個錯誤，告訴他我買了一些\n比特幣和其他東西。\n\n\n\n從那時起，他就不斷地嘲笑，...",
      "title": "永遠不要告訴任何人你所持有的加密貨幣。"
    }
  ]
}