{
  "author": "robis87",
  "the_new_excerpt": "According to a prominent leaker, Grand Theft Auto 6 will pay players in-game\ncryptocurrency rewards for completing some missions, as per report by U.Today.\n\nAs claimed in a June 3 tweet by famous leaker Tom Henderson, the next instalment\nof the iconic franchise will pay players rewards in crypto…",
  "original_created_utc": 1622746232,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ある著名なリーク情報によると、『グランド・セフト・オート6』では、いくつかのミッションを達成すると、ゲーム内でプレイヤーに\nU.Todayが報じたところによると、「Grand Theft Auto 6」では、いくつかのミッションをクリアすると、ゲーム内で暗号通貨の報酬が支払われるとのことです。\n\n著名なリーク者であるTom Henderson氏が6月3日にツイートしたように、代表的なフランチャイズの次の作品では\n象徴的なフランチャイズの次の作品は、プレイヤーに暗号で報酬を支払うと主張しています...",
      "title": "GTA 6』にゲーム内での暗号通貨リワードを搭載すると著名なインサイダーが発表"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "据一位著名的泄密者称，《侠盗猎车手6》将在游戏中向玩家支付\n根据U.Today的报道，完成一些任务的玩家将在游戏中获得加密货币奖励。\n\n著名泄密者汤姆-亨德森在6月3日的推文中称，下一版\n这个标志性的专营权将向玩家支付加密货币的奖励。",
      "title": "据知名内部人士透露，《GTA 6》将包括游戏内的加密货币奖励"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "據一位著名的泄密者稱，《俠盜獵車手6》將在遊戲中向玩家支付\n根據U.Today的報道，完成一些任務的玩家將在遊戲中獲得加密貨幣獎勵。\n\n著名泄密者湯姆-亨德森在6月3日的推文中稱，下一版\n這個標誌性的專營權將向玩家支付加密貨幣的獎勵。",
      "title": "據知名內部人士透露，《GTA 6》將包括遊戲內的加密貨幣獎勵"
    }
  ],
  "title": "GTA 6 to Include In-Game Cryptocurrency Rewards, According to Prominent Insider",
  "created_utc": 1622762953,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>According to a prominent leaker, Grand Theft Auto 6 will pay players in-game cryptocurrency rewards for completing some missions, as per report by U.Today. </p>\n\n<p>As claimed in a June 3 tweet by famous leaker Tom Henderson, the next instalment of the iconic franchise will pay players rewards in crypto instead of cash for completing some missions: </p>\n\n<p><em>I heard recently that in GTA 6, some missions will reward you in bitcoin instead of cash for completing some missions.</em></p>\n\n<p>Henderson also says that the game will add a broker for various cryptocurrencies, which he believes would be &quot;huge&quot; for the industry.  </p>\n\n<p>The insider adds that the in-game cryptocurrency is unlikely to be called “Bitcoin” per se, but it will be cryptocurrency.</p>\n</div><!-- SC_ON -->",
  "score": 1437,
  "permalink": "/r/CryptoCurrency/comments/nrku3o/gta_6_to_include_ingame_cryptocurrency_rewards/",
  "subreddit": "CryptoCurrency",
  "id": "nrku3o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404881313
}