{
  "author": "Albasilbr",
  "original_created_utc": 1627454979,
  "title": "Did the Nazi State ever draw an strategy on how to “communicate”, in case of victory in the War, what had happened with the Jews?",
  "created_utc": 1627494417,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Well, to begin with, this topic always fascinated me, and I’ve never, ever, found anything in regard to that until now.\nWe know, from the Possen Speeches by Himmler and Goebbels’s diaries that they (the Nazis) saw their time as being the “perfect” one in history in order to do what, in their view, should be done. Himmler explicitly argued, when addressing the question of sending the children to their deaths that this was being done to avoid that a “generation of avengers would rise up to harass our children and grandchildren”, in another point he argues that “this will cause a problem for another generation, that will not, most certainly, have the same opportunity as we are having now”\nI always think to myself if there was any individual or group of individuals or, even, any institution of the Nazi bureaucracy that anticipated what to do in case of victory, how they would tell what had happened (of course they would lie all the way around), but what I want to know  is exactly that: did someone whitin the Nazi framework ever thought about  “how we’re going to deal with that?”. I found a very interesting citation on Wikipedia about a book by Historian Dieter Pohl, on his book “Der Holocaust als offenes Geheimnis”, as it follows: </p>\n\n<p>“Traditional institutions of the Nazi state secretly began the search for a defence strategy for the post-war period in 1943: one had not been informed, and the SS was exclusively to blame.”</p>\n\n<p>Unfortunately, I couldn’t find anymore information regarding the aforementioned “defense strategy” by the State.</p>\n\n<p>I wish to thank the Community in advance.</p>\n</div><!-- SC_ON -->",
  "score": 115,
  "permalink": "/r/AskHistorians/comments/ot4lgs/did_the_nazi_state_ever_draw_an_strategy_on_how/",
  "subreddit": "AskHistorians",
  "id": "ot4lgs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Well, to begin with, this topic always fascinated me, and I’ve never, ever,\nfound anything in regard to that until now. We know, from the Possen Speeches by\nHimmler and Goebbels’s diaries that they (the Nazis) saw their time as being the\n“perfect” one in history in order to do what, in their view,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そもそも、このテーマは私を魅了してやまないのですが、今までそれに関するものを見つけたことがありませんでした。\n今まで何も見つけられませんでした。私たちは、ヒムラーとゲッペルスのポッセン・スピーチから知っています。\nヒムラーのポッセン・スピーチやゲッベルスの日記から、彼ら（ナチス）は自分たちの時代を歴史上「完璧」なものと考えていたことがわかります。\n「彼らの見解では...",
      "title": "ナチス国家は、戦争に勝利した場合に、ユダヤ人に何が起こったかを「伝える」ための戦略を描いたことがあったのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，首先，这个话题总是让我着迷，而我从来没有，从来没有。\n直到现在，我才发现任何与此有关的东西。我们知道，从希姆莱的《波森演讲》和戈培尔的日记中可以看出，他们（纳粹）看到的是 \"纳粹\"。\n我们知道，从希姆莱的波森演讲和戈培尔的日记中，他们（纳粹）认为他们的时代是历史上的\n他们（纳粹）认为他们的时代是历史上 \"完美 \"的时代，以便做在他们看来，...",
      "title": "纳粹国家是否曾就如何在战争胜利的情况下 \"沟通 \"发生在犹太人身上的事情制定过战略？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，首先，這個話題總是讓我着迷，而我從來沒有，從來沒有。\n直到現在，我才發現任何與此有關的東西。我們知道，從希姆萊的《波森演講》和戈培爾的日記中可以看出，他們（納粹）看到的是 \"納粹\"。\n我們知道，從希姆萊的波森演講和戈培爾的日記中，他們（納粹）認爲他們的時代是歷史上的\n他們（納粹）認爲他們的時代是歷史上 \"完美 \"的時代，以便做在他們看來，...",
      "title": "納粹國家是否曾就如何在戰爭勝利的情況下 \"溝通 \"發生在猶太人身上的事情制定過戰略？"
    }
  ]
}