{
  "author": "CuriousAjnabi",
  "original_created_utc": 1632041801,
  "title": "Are there Muslim communities in Spain to this day who survived the prohibition of Islam in the 16th century/expulsion of Moriscos in the 17th century?",
  "created_utc": 1632069452,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was curious to know if there are still any significant Muslim communities living in Spain who have been around since Al-Andalus times, and managed to escape all those persecutions and are still out there today. </p>\n\n<p>And if so, where are they located, for the most part? I&#39;d be curious to see how their habits and traditions evolved differently from Muslim communities in Muslim-majority countries.</p>\n</div><!-- SC_ON -->",
  "score": 120,
  "permalink": "/r/AskHistorians/comments/pr4f42/are_there_muslim_communities_in_spain_to_this_day/",
  "subreddit": "AskHistorians",
  "id": "pr4f42",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was curious to know if there are still any significant Muslim communities\nliving in Spain who have been around since Al-Andalus times, and managed to\nescape all those persecutions and are still out there today.\n\nAnd if so, where are they located, for the most part? I'd be curious to see how\ntheir…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、今でも重要なイスラム教徒のコミュニティがあるかどうかを知りたいと思いました。\nスペインには、アル・アンダルス時代から存在し、迫害を逃れて今もなお存在している\n迫害を逃れて今も存在しているのでしょうか？\n\nもしあるとすれば、それは大体どこにあるのでしょうか？私は、彼らがどのように\n彼らの...",
      "title": "スペインには、16世紀のイスラム禁止／17世紀のモリスコ追放を生き延びたイスラム教徒のコミュニティが現在も存在するのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我很想知道，在西班牙是否还有任何重要的穆斯林社区？\n他们从阿尔-安达鲁斯时代就已经存在，并设法躲过了所有这些迫害，至今仍在那里生活。\n他们设法逃脱了所有这些迫害，今天仍然在那里。\n\n如果有的话，他们大部分都在哪里？我很想知道\n他们的...",
      "title": "直到今天，西班牙还有没有在16世纪禁止伊斯兰教/17世纪驱逐莫里斯科人的过程中幸存下来的穆斯林社区？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我很想知道，在西班牙是否還有任何重要的穆斯林社區？\n他們從阿爾-安達魯斯時代就已經存在，並設法躲過了所有這些迫害，至今仍在那裏生活。\n他們設法逃脫了所有這些迫害，今天仍然在那裏。\n\n如果有的話，他們大部分都在哪裏？我很想知道\n他們的...",
      "title": "直到今天，西班牙還有沒有在16世紀禁止伊斯蘭教/17世紀驅逐莫里斯科人的過程中倖存下來的穆斯林社區？"
    }
  ]
}