{
  "author": "Kocteau",
  "original_created_utc": 1625026996,
  "title": "Is it considered weird to masturbate in the living room (home alone) when you live with other people?",
  "created_utc": 1625037825,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For context you can take a look at my profile and read my post from earlier today lmao. A lot of commenters said that it was not normal to masturbate in a common area of the house even if I’m home by myself and I was honestly surprised lolol </p>\n\n<p>Anyways, sometimes if I’m home alone, I masturbate in the upstairs TV / living room (cos I’m too lazy to get up and go to my room hah). I feel like it’s not weird if no one knows I do this ??? If it makes any difference I don’t live w my dad, just my mom and sister (I’m also female). And it’s not like I’m rubbing my clit all over the furniture??? Like whatever mess I’m making stays in my underwear. This is a very strange thing to type out lol but I’m curious to know what everyone’s thoughts are</p>\n</div><!-- SC_ON -->",
  "score": 120,
  "permalink": "/r/TooAfraidToAsk/comments/oapgte/is_it_considered_weird_to_masturbate_in_the/",
  "subreddit": "TooAfraidToAsk",
  "id": "oapgte",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "For context you can take a look at my profile and read my post from earlier\ntoday lmao. A lot of commenters said that it was not normal to masturbate in a\ncommon area of the house even if I’m home by myself and I was honestly surprised\nlolol\n\nAnyways, sometimes if I’m home alone, I masturbate in the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私のプロフィールを見て、今日の私の投稿を読んでみてください。\n今日の記事を読んでみてください。多くの人が、一人で家にいても家の中の共有スペースでオナニーをするのは普通ではないと言っていました。\nひとりで家にいても、家の中の共有スペースでオナニーするのは普通じゃないと多くのコメントがあり、正直驚きました。\n笑\n\nとにかく、たまに一人で家にいるときは、家の中でオナニーをしています。",
      "title": "他の人と一緒に住んでいるのに、リビング（家での一人暮らし）でオナニーをするのは変だと思われますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "为了了解情况，你可以看一下我的个人资料，并阅读我今天早些时候的帖子。\n今天的帖子，笑死我了。很多评论者说，即使我一个人在家，在房子的公共区域手淫也是不正常的。\n即使我自己在家，在房子的公共区域自慰也是不正常的，说实话，我很惊讶\nlolol\n\n总之，有时如果我一个人在家，我就在家里自慰。",
      "title": "当你和其他人住在一起时，在客厅（独自在家）手淫被认为是很奇怪的事情吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "爲了瞭解情況，你可以看一下我的個人資料，並閱讀我今天早些時候的帖子。\n今天的帖子，笑死我了。很多評論者說，即使我一個人在家，在房子的公共區域手淫也是不正常的。\n即使我自己在家，在房子的公共區域自慰也是不正常的，說實話，我很驚訝\nlolol\n\n總之，有時如果我一個人在家，我就在家裏自慰。",
      "title": "當你和其他人住在一起時，在客廳（獨自在家）手淫被認爲是很奇怪的事情嗎？"
    }
  ]
}