{
  "author": "jabilas",
  "the_new_excerpt": "So being into DeFi I tend to get a lot of messages on Telegram from people\npretending to be the support team of the DeFi projects I'm invested in, which\ntends to happen almost every time I ask a question on those project's Telegram.\nI usually just block and report them but this time I decided to…",
  "original_created_utc": 1617594254,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "因此，作为DeFi，我往往会收到很多人在Telegram上发来的信息。\n假装是我投资的DeFi项目的支持团队，这。\ntends to happen almost every time I ask a question on those project's Telegram.\n我通常只是阻止和报告他们，但这次我决定... ...",
      "title": "我能够浪费一个骗子的时间，使他们关闭他们的假网站。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，作爲DeFi，我往往會收到很多人在Telegram上發來的信息。\n假裝是我投資的DeFi項目的支持團隊，這。\ntends to happen almost every time I ask a question on those project's Telegram.\n我通常只是阻止和報告他們，但這次我決定... ...",
      "title": "我能夠浪費一個騙子的時間，使他們關閉他們的假網站。"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "DeFiに夢中になっていると、Telegramでたくさんの人からメッセージを受け取ることがあります。\n私が投資しているDeFiプロジェクトのサポートチームを装ったメッセージをTelegramで受け取る傾向があります。\nそのプロジェクトのTelegramで質問をすると、ほぼ毎回そうなる傾向があります。\nいつもはブロックしたり報告したりしているのですが、今回は...",
      "title": "詐欺師の時間を無駄にして、偽装サイトを閉鎖させることができました。"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "DeFiに夢中になっていると、Telegramでたくさんの人からメッセージを受け取ることがあります。\n私が投資しているDeFiプロジェクトのサポートチームを装ったメッセージをTelegramで受け取る傾向があります。\nそのプロジェクトのTelegramで質問をすると、ほぼ毎回そうなる傾向があります。\nいつもはブロックしたり報告したりしているのですが、今回は...",
      "title": "詐欺師の時間を無駄にして、偽装サイトを閉鎖させることができました。"
    }
  ],
  "title": "I was able to waste a scammers time and cause them to shut down their fake website.",
  "created_utc": 1617648293,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So being into DeFi I tend to get a lot of messages on Telegram from people pretending to be the support team of the DeFi projects I&#39;m invested in, which tends to happen almost every time I ask a question on those project&#39;s Telegram. I usually just block and report them but this time I decided to have some fun and play along. </p>\n\n<p>So, as usual,  the scammer sends me a link to a fake website and asks me to &quot;validate&quot; my wallet to receive rewards. I decided to open the link, but of course on private browsing mode with all my other windows closed just in case. The website asked me to type in my 12 word wallet seed and I just typed in &quot;You are a low life loser who takes the easy way out by trying to steal peoples money&quot; and the wallet seed was imported successfully. </p>\n\n<p>I typed in a few other more explicit wallet phrases and those were all imported successfully as well. Then I spent the next 15-20 minutes submitting a bunch of fake wallet seeds. I thought maybe if the website was run my multiple scammers I may be able to flood their pool with fake seeds that it will make their job harder to find the real seeds from the actual victims. But I did spend enough time that the scammer shut down their website. </p>\n\n<p>I won&#39;t lie, doing that made me feel really good especially if it meant 1 less unsuspecting person falling victim to their ploy. If I was knowledgeable with bots I would have easily had one just spam the website with a bunch of random imported fake wallet gibberish. </p>\n\n<p>This goes without saying but to those that are new to the cryptocurrency space and made a private wallet(meaning not on a central exchange like Coinbase, Binance, Gemini etc.), don&#39;t EVER give ANYONE your private keys, just type in a bunch of fake keys instead and waste their time ;)</p>\n</div><!-- SC_ON -->",
  "score": 165,
  "permalink": "/r/CryptoCurrency/comments/mkbwif/i_was_able_to_waste_a_scammers_time_and_cause/",
  "subreddit": "CryptoCurrency",
  "id": "mkbwif",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961875632
}