{
  "author": "fatpotato111",
  "original_created_utc": 1626893132,
  "title": "Is it embarassing to hike and take lots of breaks?",
  "created_utc": 1626918355,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m a fairly fat girl, like 5&#39;1 and 80kg. I am in this constant denial where I think I&#39;m fit and thin (and also having constant breakdowns cause well, in reality ik im not)</p>\n\n<p>Today my friends and I went on hiking this famous mountain. To be fair its not too high (based on POV from bottom ofc) and i was thinking &quot;fuck yeah i can do this&quot;. 5 mins in, I was huffing and puffing and I can feel my heartbeat is going crazy to the point where I can feel it with my eyes. My breath is uncontrollable so I have to gasp for air as if I&#39;m running out of oxygen. I&#39;m hiking with 1 female friend and 1 male friend and they&#39;re both really thin. I was trying to force myself so bad but halfway I felt like I was going to faint and I&#39;ve never had that before. It was so scary but I wanted to push past it cause I&#39;m embarassed that i&#39;m the last one. </p>\n\n<p>I even texted my male friend saying &quot;I&#39;m just gonna stay here, u guys go ahead&quot; but to my surprise he came down and stayed with me (its surprising because before this I had mixed feelings on how I hate him cause hes a snob but this gesture really made me empathise him...that bastard). And I keep on telling him he can hike without me but he insist saying it&#39;s normal to take breaks. I have no fuckin clue where this sudden batch of hormone came from but I was gonna cry at him saying that. I guess I knew I was really insecure about this, about walking last or running last, basically anything related with my body stamina/image. </p>\n\n<p>We kept on taking breaks, like literally I had a break every 3 metres...but theres this question that kept on popping so i thought i&#39;d ask redditors: is it embarassing when you guys see someone who&#39;s huffing and puffing at sport activities? Like something as easy as running 100 metre or something, is that something I should be ashamed of?</p>\n\n<p>P.S: yeah i have insecurities and low self esteem issues</p>\n\n<p>Edit:Thank you so much for the advice and comments, everyone! Unfortunately, I&#39;m tired and my legs hate me atm so I&#39;ll try to reply tomorrow :D</p>\n</div><!-- SC_ON -->",
  "score": 109,
  "permalink": "/r/TooAfraidToAsk/comments/oow8l2/is_it_embarassing_to_hike_and_take_lots_of_breaks/",
  "subreddit": "TooAfraidToAsk",
  "id": "oow8l2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm a fairly fat girl, like 5'1 and 80kg. I am in this constant denial where I\nthink I'm fit and thin (and also having constant breakdowns cause well, in\nreality ik im not)\n\nToday my friends and I went on hiking this famous mountain. To be fair its not\ntoo high (based on POV from bottom ofc) and i…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は170cmで80kgとかなり太めの女の子です。私は常に自分を否定しています。\n私は自分が健康で痩せていると思っていますが、実際にはそうではありません。\n実際にはそうではありませんが）。)\n\n今日は友達と一緒にこの有名な山をハイキングしました。正直言って、それほど高い山ではありません。\n高い山ではありません（下からの視点では）。",
      "title": "ハイキングをしてたくさんの休憩を取ることは恥ずかしいことですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个相当胖的女孩，像5英尺1英寸和80公斤。我一直在否定自己，我认为自己很健康，很瘦。\n我一直在否认，我认为我很健康，很瘦（也一直在崩溃，因为\n实际上我不是)\n\n今天我和我的朋友们去爬这座著名的山。公平地说，它不是\n它并不高（基于从底部的角度来看），而且我...",
      "title": "徒步旅行和大量休息是否令人尴尬？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個相當胖的女孩，像5英尺1英寸和80公斤。我一直在否定自己，我認爲自己很健康，很瘦。\n我一直在否認，我認爲我很健康，很瘦（也一直在崩潰，因爲\n實際上我不是)\n\n今天我和我的朋友們去爬這座著名的山。公平地說，它不是\n它並不高（基於從底部的角度來看），而且我...",
      "title": "徒步旅行和大量休息是否令人尷尬？"
    }
  ]
}