{
  "author": "HurtsFlyerin21",
  "the_new_excerpt": "Years ago I learned about how terrible financial advisors were for the common\nman. How the same stat got thrown in my face over and over, \"95% of traders\ndon't beat the market.\" From what I understand, there is merit to this fact.\n\nBecause of this I've stacked up VTI/VTSAX, VGTSX, and VOO. Since…",
  "original_created_utc": 1618942103,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "数年前、私はファイナンシャル・アドバイザーがいかに庶民にとって恐ろしい存在であるかを知りました。\n庶民にとっていかに恐ろしいかを知った。トレーダーの95％は市場に勝てない」という同じ統計が何度も何度も私の顔に投げつけられました。\n市場に勝てない」と。私の理解では、この事実にはメリットがあります。\n\nこのため、私はVTI/VTSAX、VGTSX、VOOを積み上げてきました。以来...",
      "title": "95％のトレーダーが市場に勝てないのであれば、なぜ多くの株式サブスクが人気なのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "几年前，我了解到财务顾问对普通人来说是多么的糟糕。\n人来说是多么可怕。同样的统计数字是如何被一次又一次地扔到我面前的，\"95%的交易者\n不能战胜市场\"。据我所知，这个事实是有道理的。\n\n正因为如此，我把VTI/VTSAX、VGTSX和VOO堆积起来。自从...",
      "title": "如果95%的交易者都不能战胜市场，为什么这么多的股票子会如此受欢迎？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "幾年前，我瞭解到財務顧問對普通人來說是多麼的糟糕。\n人來說是多麼可怕。同樣的統計數字是如何被一次又一次地扔到我面前的，\"95%的交易者\n不能戰勝市場\"。據我所知，這個事實是有道理的。\n\n正因爲如此，我把VTI/VTSAX、VGTSX和VOO堆積起來。自從...",
      "title": "如果95%的交易者都不能戰勝市場，爲什麼這麼多的股票子會如此受歡迎？"
    }
  ],
  "title": "If 95% of traders don't beat the market, why are so many stock subs so popular?",
  "created_utc": 1618950405,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Years ago I learned about how terrible financial advisors were for the common man. How the same stat got thrown in my face over and over, &quot;95% of traders don&#39;t beat the market.&quot; From what I understand, there is merit to this fact.</p>\n\n<p>Because of this I&#39;ve stacked up VTI/VTSAX, VGTSX, and VOO. Since inception, I&#39;ve averaged 13% YOY. The gains are impressive since I started in about 2011-2012, with heavier contributions each year as my job came with higher salary over the years.  Easy to look good in the beginning of a decade long bull run.</p>\n\n<p>&quot;Time in the market&quot; &gt; &quot;Timing the market&quot; - This is another one that seems to stand the test of time.  Constantly seeing advice on liquidating so they have &quot;cash on the side to buy the dip.&quot;  Is that not just timing the market?  Why sell unless to spend or spend during retirement?</p>\n\n<p>My question is why are subs like <a href=\"https://www.reddit.com/r/stocks/\">r/stocks</a> and <a href=\"https://www.reddit.com/r/investing/\">r/investing</a> and such so popular, constantly everyday people posting about their super niche tailored portfolios with DD on random companies. And it seems there is a herd like mentality in these subs as well.</p>\n\n<p>Tech stocks go up - all the DD and posts are about tech stocks - everyone is bullish in tech....until its not</p>\n\n<p>Tech stocks go down - tons of QQ and posts about &quot;how is the market going up and I&#39;m down 15%?&quot; - with comments talking about OP lacking diversification.</p>\n\n<p><strong>Again if 95% of traders don&#39;t beat the market, why are so many people trying?</strong></p>\n\n<p>Some things that I may not fully grasp:</p>\n\n<ul>\n<li>Are regular people building their custom portfolios, picking individual stocks not considered traders?</li>\n<li>The market has inefficiencies - does this invalidate the &quot;95% stat?&quot;</li>\n<li>Does the &quot;95% stat&quot; only apply to professionals? And by some weird way allow retail average Joes better opportunity?</li>\n<li>Why does the consensus on all the finance subs seem to be centered around building your own portfolio?</li>\n<li>Are 19/20 people in these subs really failing to beat the market?</li>\n<li>Why not just VTSAX and chill?</li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 460,
  "permalink": "/r/stocks/comments/muwhxe/if_95_of_traders_dont_beat_the_market_why_are_so/",
  "subreddit": "stocks",
  "id": "muwhxe",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171527440
}