{
  "author": "midnightfarmer",
  "original_created_utc": 1626792289,
  "title": "Why so red? A summary from the WSJ today.",
  "created_utc": 1626805864,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Much like the sentiment that all crypto follows BTC, I&#39;m a firm believer that crypto in general follows traditional financial markets. </p>\n\n<p>Here&#39;s a summary of an article in today&#39;s Wall Street Journal titled &quot;Delta Variant Fears Shake Markets&quot; that I think paints a red picture of what we saw yesterday. </p>\n\n<ul>\n<li><p>The DJIA decline 700 points yesterday, it&#39;s worse session in nine months</p></li>\n<li><p>The blue-chip index fell 725 points, its steepest decline since Oct 28 2020</p></li>\n<li><p>10 year US treasury note went to lowest level since Feb &#39;21</p></li>\n<li><p>Governments are considering lockdowns again due to Delta variant </p></li>\n<li><p>Inflation growing faster than expected </p></li>\n<li><p>Strained US/China relations putting pressure on trillions of dollars worth of US listed Chinese companies </p></li>\n</ul>\n\n<p>-&quot;The market is saying the economy is going to slow down fairly significantly in the next weeks or months&quot;</p>\n\n<ul>\n<li><p>Markets rallied first half of 2021 as people bet the economy would bounce back post-Corona</p></li>\n<li><p>The economy grew 9.1% from April-June, the second fastest pace since 1983</p></li>\n<li><p>Analysts are predicting S&amp;P 500 profits for Q2 to be 70% higher than last year - highest growth rate in a decade </p></li>\n<li><p>Growth most likely peaked in spring </p></li>\n<li><p>Oil price is declining </p></li>\n<li><p>Unemployment has stagnated which could lead to labor shortage </p></li>\n<li><p>INFLATION, INFLATION, INFLATION</p></li>\n<li><p>Consumer price index rose 5.4% in June from a year ago, fastest pace since August 2008</p></li>\n<li><p>Investors are moving to government bonds, a general sign of market fear </p></li>\n<li><p>THERE HAS NEVER BEEN A MODERN ECONOMY THAT HAS REOPENED AFTER A PANDEMIC </p></li>\n</ul>\n\n<p>Time to strap in and HODL. Going to be a bumpy ride.</p>\n\n<p>EDIT: My first awards :) Thank you fellow crytpo-psychos!</p>\n</div><!-- SC_ON -->",
  "score": 162,
  "permalink": "/r/CryptoCurrency/comments/oo3fio/why_so_red_a_summary_from_the_wsj_today/",
  "subreddit": "CryptoCurrency",
  "id": "oo3fio",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Much like the sentiment that all crypto follows BTC, I'm a firm believer that\ncrypto in general follows traditional financial markets.\n\nHere's a summary of an article in today's Wall Street Journal titled \"Delta\nVariant Fears Shake Markets\" that I think paints a red picture of what we…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "すべての暗号はBTCに従うという考え方と同様に、私は暗号全般は伝統的な金融市場に従うと確信しています。\n一般的に暗号は伝統的な金融市場に従うものだと確信しています。\n\n今日のウォール・ストリート・ジャーナルに掲載された「Delta Variant Fears Shake Markets」という記事の要約を紹介します。\nVariant Fears Shake Markets」という記事の要約です。",
      "title": "どうしてこんなに赤いの？今日のWSJからの要約です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "与所有加密货币跟随BTC的情绪一样，我坚定地认为\n我坚信加密货币总体上遵循传统金融市场。\n\n以下是今天《华尔街日报》上一篇文章的摘要，题目是 \"Delta\n我认为这篇文章为我们描绘了一幅红色的画面。",
      "title": "为什么这么红？今天《华尔街日报》的一篇摘要。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "與所有加密貨幣跟隨BTC的情緒一樣，我堅定地認爲\n我堅信加密貨幣總體上遵循傳統金融市場。\n\n以下是今天《華爾街日報》上一篇文章的摘要，題目是 \"Delta\n我認爲這篇文章爲我們描繪了一幅紅色的畫面。",
      "title": "爲什麼這麼紅？今天《華爾街日報》的一篇摘要。"
    }
  ]
}