{
  "author": "DJIMBEAUXbucc",
  "original_created_utc": 1635284642,
  "title": "Did kids actually have to kill their frogs before dissecting them in the 80s?",
  "created_utc": 1635315923,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Was watching ET and at one part Elliot is in biology while ET is getting hammered and watching tv, and the scene involves all the kids giving live frogs chloroform cotton balls and suffocating them or whatever before dissecting.  Was that actually standard practice in public school biology in the 80s and earlier?</p>\n\n<p>In my biology class in 2001 or 2002 or whenever they brought in already dead and preserved/bloodless refrigerated frogs.  There was clearly an entire industry dedicated to providing dead and easy to dissect frog cadavers to public schools.  Did that service not exist 40 years ago?  They just brought in dozens of live frogs and had the kids passively kill them and watch them slowly die before dissecting their fresh bloody corpse like little Jeffrey Dahmers?</p>\n\n<p>Also did they really do that when kids where 10 like Elliot was?  That’s like elementary school age.  Pretty sure we were all like 13-14 when we did it 20 years later.</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/qgh1ol/did_kids_actually_have_to_kill_their_frogs_before/",
  "subreddit": "AskHistorians",
  "id": "qgh1ol",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Was watching ET and at one part Elliot is in biology while ET is getting\nhammered and watching tv, and the scene involves all the kids giving live frogs\nchloroform cotton balls and suffocating them or whatever before dissecting. Was\nthat actually standard practice in public school biology in the 80s…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ETを見ていて、エリオットが生物学の授業を受けているときに、ETが酔っぱらってテレビを見ているシーンがありました。\nそのシーンでは、子供たちが生きたカエルにクロロホルムを与えて\n解剖する前にクロロホルムの綿球を与えて窒息させたりするシーンがありました。それは\n80年代の公立学校の生物学では、実際に標準的なやり方だったのでしょうか...。",
      "title": "80年代の子供たちは、カエルを解剖する前に実際に殺さなければならなかったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在看《ET》的时候，有一段是艾略特在生物课上，而《ET》则是在看电视的时候。\n看电视的时候，有一个场景是所有的孩子都在给活青蛙喂食。\n在解剖之前，所有的孩子都给活青蛙喂食氯仿棉球并使其窒息或其他什么。这是不是\n这实际上是80年代公立学校生物课的标准做法......",
      "title": "在80年代，孩子们在解剖青蛙之前真的要杀死它们吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在看《ET》的時候，有一段是艾略特在生物課上，而《ET》則是在看電視的時候。\n看電視的時候，有一個場景是所有的孩子都在給活青蛙餵食。\n在解剖之前，所有的孩子都給活青蛙餵食氯仿棉球並使其窒息或其他什麼。這是不是\n這實際上是80年代公立學校生物課的標準做法......",
      "title": "在80年代，孩子們在解剖青蛙之前真的要殺死它們嗎？"
    }
  ]
}