{
  "author": "knightbrowsin",
  "original_created_utc": 1628149964,
  "title": "Were the late 60s and 70s more progressive for LGBT rights in America than the 80s and 90s?",
  "created_utc": 1628182043,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been watching old movies recently and I&#39;ve been kind of astounded by how progressive on LGBT rights some of these movies from the late 60s and 70s are.  Examples I can think of are Shaft, Dog Day Afternoon, and Midnight Cowboy.  In Shaft there&#39;s a bartender who&#39;s gay.  He&#39;s kind of stereotypical, but generally he&#39;s just a guy who owns a bar and is gay.  Dog Day Afternoon and Midnight Cowboy also have portrayals of gay men just as normal guys trying to live their life.  However, what&#39;s especially interesting to me is that both of those movies also have very sympathetic portrayals of trans women.  In my lifetime I didn&#39;t really see that until maybe 2015 or 2016.  </p>\n\n<p>Further, I don&#39;t remember any big 80s or 90s movies having significant LGBT plots or characters.  It seems that LGBT people were kind of ignored for those decades.  I was young, but I also remember when Brokeback Mountain came out in 2005 it was a really big thing to have such a big movie center around an LGBT romance.  However, it seems like Dog Day Afternoon did that 30 years before.  It&#39;s not like Dog Day Afternoon was an obscure movie either.  It stars Al Pacino and won an oscar.</p>\n\n<p>I&#39;m curious if these themes in movies from that era reflect a general progressive attitude people held towards the LGBT community in America, and if the popular opinion towards LGBT people became more conservative in the 80s and 90s before becoming more progressive again in the 00s and 10s.</p>\n</div><!-- SC_ON -->",
  "score": 108,
  "permalink": "/r/AskHistorians/comments/oyctfr/were_the_late_60s_and_70s_more_progressive_for/",
  "subreddit": "AskHistorians",
  "id": "oyctfr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've been watching old movies recently and I've been kind of astounded by how\nprogressive on LGBT rights some of these movies from the late 60s and 70s are.\nExamples I can think of are Shaft, Dog Day Afternoon, and Midnight Cowboy. In\nShaft there's a bartender who's gay. He's kind of stereotypical,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、昔の映画を見ていて、LGBTの権利について先進的な映画があることに驚かされました。\n60年代後半から70年代にかけての映画の中には、LGBTの権利について先進的なものがいくつかあります。\n例えば、『シャフト』や『Dog Day Afternoon』、『真夜中のカウボーイ』などです。で\nShaft』では、ゲイのバーテンダーが登場します。彼はある意味、ステレオタイプで......。",
      "title": "アメリカのLGBTの権利は、60年代後半から70年代の方が80年代、90年代よりも進んでいたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近一直在看老电影，我对一些在男女同性恋、双性恋和变性者权利方面的进步感到震惊。\n我对60年代末和70年代的一些电影在LGBT权利方面的进步感到震惊。\n我能想到的例子是《盗梦空间》（Shaft）、《狗日的下午》（Dog Day Afternoon）和《午夜牛仔》（Midnight Cowboy）。在\n沙夫特》中，有一个酒保是同性恋。他的形象有点刻板，...",
      "title": "在美国，60年代末和70年代的LGBT权利是否比80年代和90年代的更进步？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近一直在看老電影，我對一些在男女同性戀、雙性戀和變性者權利方面的進步感到震驚。\n我對60年代末和70年代的一些電影在LGBT權利方面的進步感到震驚。\n我能想到的例子是《盜夢空間》（Shaft）、《狗日的下午》（Dog Day Afternoon）和《午夜牛仔》（Midnight Cowboy）。在\n沙夫特》中，有一個酒保是同性戀。他的形象有點刻板，...",
      "title": "在美國，60年代末和70年代的LGBT權利是否比80年代和90年代的更進步？"
    }
  ]
}