{
  "author": "SpecificCrash",
  "original_created_utc": 1645747393,
  "title": "How can I tell my girlfriend that I want to listen to upbeat bluegrass right after sex?",
  "created_utc": 1645778937,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Yes, I know this is weird. But at the pandemic I discovered how good is to orgasm and to listen to upbeat bluegrass right after, I sincerely don&amp;#39;t know why I like this, as I don&amp;#39;t EVER listen to bluegrass in my day-to-day.&lt;br/&gt;\nThis worked like a charm before I met my GF. She lives 1600 km away and I only see her once per 4 months give or take. I spent the entire January with her (I am 22 years old, so yeah) and I was URGING to put some music right after sex, but I know she is going to find this very weird, as we are bot normies when it comes to sex.&lt;br/&gt;\nI don&amp;#39;t have any unusual habits, so I guess it&amp;#39;s going to come out as a joke to her if I tell her. I don&amp;#39;t really know if it&amp;#39;s worth telling her or just keep jacking off and listening to that fine rhythm from Alabama.&lt;br/&gt;\nOBS: I am Brazilian, and I know for a fact that my girlfriend doesn&amp;#39;t know bluegrass and she will be associating it with the &amp;quot;redneck&amp;quot; stereotype =C&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/t0pdl8/how_can_i_tell_my_girlfriend_that_i_want_to/",
  "subreddit": "TooAfraidToAsk",
  "id": "t0pdl8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "Yes, I know this is weird. But at the pandemic I discovered how good is to\norgasm and to listen to upbeat bluegrass right after, I sincerely don't know why\nI like this, as I don't EVER listen to bluegrass in my day-to-day.\nThis worked like a charm before I met my GF. She lives 1600 km away and I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "はい、変な話ですが。しかし、このパンデミックで、私は以下のことがいかに良いかを発見しました。\nオーガズムに達した後、アップビートのブルーグラスを聴くと、なぜか心から\n日常でブルーグラスを聴くことはまずないので、これはいい。\nこれは、私のガールフレンドに会う前に、魅力的に機能しました。彼女は1600km離れたところに住んでいて、僕は...",
      "title": "セックスの直後にアップビートなブルーグラスを聴きたいと恋人に伝えるにはどうしたらいいでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "是的，我知道这很奇怪。但在大流行中，我发现高潮是多么的好\n高潮，并在高潮后马上听欢快的蓝草音乐，我真的不知道为什么\n我喜欢这个，因为我在日常工作中从不听蓝草音乐。\n在我遇到我的GF之前，这招很管用。她住在1600公里以外，我...",
      "title": "我怎样才能告诉我的女朋友，我想在做爱后马上听节奏感强的蓝草音乐？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "是的，我知道這很奇怪。但在大流行中，我發現高潮是多麼的好\n高潮，並在高潮後馬上聽歡快的藍草音樂，我真的不知道爲什麼\n我喜歡這個，因爲我在日常工作中從不聽藍草音樂。\n在我遇到我的GF之前，這招很管用。她住在1600公里以外，我...",
      "title": "我怎樣才能告訴我的女朋友，我想在做愛後馬上聽節奏感強的藍草音樂？"
    }
  ]
}