{
  "author": "thejoker4059",
  "the_new_excerpt": "Speaking of deep value, I'm finding it in WOOF after a deep dive. It's 1/8th the\nvaluation of CHWY with very similar market shares (approx. 5-6%) and revenues\n($4B-$5B range) as of the end of 2020. Chewy is definitely growing faster rn no\ndoubt. However, the WOOF CEO started in 2018 and came from…",
  "original_created_utc": 1613231016,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "说到深层价值，我在WOOF深挖后发现。它是1/8的\n市场份额（约5-6%）和收入非常相似的CHWY的估值。\n(40亿-50亿区间)，截至2020年底。Chewy绝对是增长较快的rn不\n疑。然而，WOOF CEO从2018年开始，从...",
      "title": "WOOF. 我看到了价值。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "說到深層價值，我在WOOF深挖後發現。它是1/8的\n市場份額（約5-6%）和收入非常相似的CHWY的估值。\n(40億-50億區間)，截至2020年底。Chewy絕對是增長較快的rn不\n疑。然而，WOOF CEO從2018年開始，從...",
      "title": "WOOF. 我看到了價值。"
    }
  ],
  "title": "WOOF. I see value.",
  "created_utc": 1613241145,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Speaking of deep value, I&#39;m finding it in WOOF after a deep dive. It&#39;s 1/8th the valuation of CHWY with very similar market shares (approx. 5-6%) and revenues ($4B-$5B range) as of the end of 2020. Chewy is definitely growing faster rn no doubt. However, the WOOF CEO started in 2018 and came from HPQ. He was definitely blindsided by the pandemic in orchestrating the turnaround. HPQ and its stock performed very well while he was el presidente, and it actually seems to have dropped quite a bit ever since he left. </p>\n\n<p>Long term debt is the elephant in the room, but the IPO will cover a portion of it (maybe 1/3), and a successful turnaround will take care of the rest. I like the omnichannel focus, the brick and mortar footprint (bc of in-store veterinary services) coming out of the pandemic, and a tech oriented CEO. If they can make big inroads with marketing and customer service (seems to be their biggest issues rn), they will be on equal footing with CHWY. Another small factor is that WOOF doesn&#39;t sell the trash pet food that CHWY does. Lots of other factors of course, but I like the stock and the opportunity for a turnaround. The $97B TAM means CHWY and WOOF combined only have like 10-12% of the marketshare, which leaves plenty of room for both CHWY and WOOF to thrive and not have to fight each other tooth and nail. </p>\n\n<p>Not as sexy as CHWY, but I think given CHWY&#39;s current valuation there is better risk/reward and upside for WOOF. Wish there were 2022/23 leaps available. Only goes out to September 2021 rn. Anyway, I&#39;ll be buying deep ITM September calls and a sizable shares position.</p>\n</div><!-- SC_ON -->",
  "score": 125,
  "permalink": "/r/stocks/comments/lj2tct/woof_i_see_value/",
  "subreddit": "stocks",
  "id": "lj2tct",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728623043
}