{
  "author": "ToothKindly",
  "the_new_excerpt": "Look, I know you're about to downvote. Its like being on team Nestle or team\nAgit Pai in here. Hedge Funds are definitely no angels by any means. That being\nsaid, as much as I get a little schadenfreude watching them get kicked around a\nlittle bit, I'd argue that some of the anger is a little…",
  "original_created_utc": 1612325276,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "听着，我知道你要降权了。这就像雀巢团队或团队\n阿吉特派在这里。对冲基金绝对不是天使，无论如何。那就是\n说，虽然我得到一个小schadenfreude看着他们得到踢周围一个\n一点点，我想说的是，有些愤怒是有点... ...",
      "title": "对冲基金的误区"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "聽着，我知道你要降權了。這就像雀巢團隊或團隊\n阿吉特派在這裏。對沖基金絕對不是天使，無論如何。那就是\n說，雖然我得到一個小schadenfreude看着他們得到踢周圍一個\n一點點，我想說的是，有些憤怒是有點... ...",
      "title": "對沖基金的誤區"
    }
  ],
  "title": "Hedge Fund Misconceptions",
  "created_utc": 1612361640,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Look, I know you&#39;re about to downvote.  Its like being on team Nestle or team Agit Pai in here.  Hedge Funds are definitely no angels by any means.  That being said, as much as I get a little schadenfreude watching them get kicked around a little bit, I&#39;d argue that some of the anger is a little unfounded (or a little exaggerated) . Figured I&#39;d try posting it in <a href=\"/r/stocks\">r/stocks</a> since you might take an extra second to glance through. </p>\n\n<p>And before I&#39;m called a shill, yes, I did work in the sector for a few years (not at a fund, but a company that works directly with them). I&#39;ve since moved on to a new career and am less stressed and happier.  I just ask you take a moment and flip through before you call me names (although maybe thats a wsb thing)..</p>\n\n<p><strong>Naked Short Selling has played a major role in manipulating GME&#39;s prices</strong>\nWasn&#39;t sure where to start but this one is everywhere.  The main cause of this seems to be that short interest was 120% of the shares outstanding and how can you short more than all the shares? When you create a new short position you are effectively creating a new long as well. If you own a company with 1 share and I borrow it from you to sell short, the person I sold it to now has 1 share. If someone shorts his share, there&#39;s now 2 shares short. Short interest is now 200%.</p>\n\n<p><strong>There&#39;s a massive coverup going on due to their being more shares traded than there actually are</strong>\nGlad this one is going away but it seems like the confusion stemmed from the &#39;synthetic&#39; long created by the short. If this was an issue anytime a company got acquired for stock they&#39;d be a giant controversy. </p>\n\n<p><strong>This picture of a bunch of 100s in a row is evidence of a giant illegal short ladder strategy</strong>\nShares are typically sold in lots of 100. If you are trading an amount smaller (an odd lot) you are grouped in with other odd lots to make a lot of 100. Given that there are millions of retail traders sending odd lots, this is most likely a row of retail orders selling.</p>\n\n<p><strong>Hedge Funds conspired with the app-that-must not-be-named to halt trading to save their asses</strong>\nNow this one will be impossible to sway some people without a smoking gun but those clearinghouse capital requirements are real &amp; are federal law. It also lines up with what WeBull said (who doesnt have Citadel connections) and it makes sense that once it was announced they had received billions in funding, they opened it back up.\nTheres a better explanation from Matt Levine at Bloomberg. </p>\n\n<p>This does not forgive them for being a complete mess through most of this.</p>\n\n<p><strong>Hedge Funds are only for rich people</strong>\nThere&#39;s a lot of rich people in the industry. Filthy rich people. But their clients necessarily aren&#39;t. I&#39;ve worked with funds with unions, public pensions, school endowments, and charities as clients.</p>\n\n<p><strong>Hedge Funds and Short Sellers control the market and are the only ones allowed make money</strong>\nI find this funny because pre-pandemic, the narrative was that no one should be giving money to hedge funds simply because their returns sucked. The hedge fund index has been awful compared to the rest of the market. Anyone who threw money in an index performed better. Everyone has made money the last decade but hedge funds. And in regards to shorts, the market is at an all time high and short interest was at a 12 year low. They stink in particular.</p>\n\n<p>Anyway that&#39;s basically it, with the markets becoming more and more accessible, HFs and their high fees are part of a fading business model. I&#39;m sure most would short their industry if they could.</p>\n\n<p>If you made it this far, thanks for taking the time. This doesn&#39;t absolve them of many things but if you&#39;re going to get mad, get mad at the right reasons. Also if you disagree with any points, just tell me what!</p>\n</div><!-- SC_ON -->",
  "score": 75,
  "permalink": "/r/stocks/comments/lbf5g9/hedge_fund_misconceptions/",
  "subreddit": "stocks",
  "id": "lbf5g9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518541062
}