{
  "author": "bigbear0083",
  "the_new_excerpt": "Good Saturday morning to all of you here on r/stocks [/r/stocks]. I hope\neveryone on this sub made out pretty nicely in the market this past week, and is\nready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week\nbeginning March 8th,…",
  "original_created_utc": 1615033553,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在r/stocks[/r/stocks]上，大家周六早上好。我希望\n每个人都在这个子上做了相当不错的市场在过去的一周，和是\n为未来新的交易周做好准备。\n\n以下是你需要知道的一切，让你为本交易周做好准备。\n3月8日开始，...",
      "title": "2021年3月8日开始的交易周华尔街一周展望"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在r/stocks[/r/stocks]上，大家週六早上好。我希望\n每個人都在這個子上做了相當不錯的市場在過去的一週，和是\n爲未來新的交易周做好準備。\n\n以下是你需要知道的一切，讓你爲本交易周做好準備。\n3月8日開始，...",
      "title": "2021年3月8日開始的交易周華爾街一週展望"
    }
  ],
  "title": "Wall Street Week Ahead for the trading week beginning March 8th, 2021",
  "created_utc": 1615041337,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Good Saturday morning to all of you here on <a href=\"/r/stocks\">r/stocks</a>. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.</p>\n\n<p>Here is everything you need to know to get you ready for the trading week beginning March 8th, 2021.</p>\n\n<h1><strong>Stocks face the crosscurrents of higher interest rates and fiscal stimulus in the week ahead - <a href=\"https://www.cnbc.com/2021/03/05/stocks-face-the-crosscurrents-of-higher-interest-rates-and-fiscal-stimulus-in-the-week-ahead.html\">(Source)</a></strong></h1>\n\n<hr/>\n\n<blockquote>\n<p>The Covid-19 aid package is on track for final congressional approval in the week ahead — and it could be a double-edged sword for markets.</p>\n\n<hr/>\n\n<p>The legislation should be greeted by optimism around the powerful lift it could give the stock market and the economy, but it could also be met with concern about what a historically large stimulus package could do to inflation and interest rates.</p>\n\n<hr/>\n\n<p>Stocks were mixed in the past week, with the Dow and S&amp;P 500 higher, but the Nasdaq was dragged lower by interest rate-sensitive tech names. The benchmark 10-year Treasury yield has continued to press higher, revisiting its recent high of 1.61% on Friday, before trading at 1.54% in late trading. Yields move opposite price.</p>\n\n<hr/>\n\n<p>One wild card for stocks could be how interest rates behave around upcoming Treasury auctions.</p>\n\n<hr/>\n\n<p>There is a $38 billion 10-year auction on Wednesday and a $24 billion 30-year bond auction on Thursday.</p>\n\n<hr/>\n\n<p>Traders are watching these closely, after a historically weak 7-year Treasury note auction in February sent rates higher, even for the 10-year.</p>\n\n<hr/>\n\n<p>“We’re a little more cautious on them, just given what we saw in the 7-year and some Japanese selling pressure,” said Ben Jeffery, strategist on the U.S. rates strategy team at BMO Capital Markets.</p>\n\n<hr/>\n\n<p>He said Japanese institutions could be less interested in participating before the end of their fiscal year on March 31.</p>\n\n<hr/>\n\n<h1>Stimulus coming</h1>\n\n<p>The Senate was expected to approve its version of the $1.9 trillion stimulus package and send it to the House for a vote during the week. Otherwise, the market is watching key inflation reports with the consumer price index expected Wednesday and the producer price index, scheduled for Friday.</p>\n\n<hr/>\n\n<p>“I think the markets will be watching closely the progress on the stimulus package,” said Michael Arone, chief investment strategist at State Street Global Advisors. “I think they’ll continue to watch the 10-year Treasury move and we’re going to get CPI data. That’s going to inform on those moves.”</p>\n\n<hr/>\n\n<p>He expects stimulus to remain a factor that could sway markets.</p>\n\n<hr/>\n\n<p>Inflation has been a worry for markets, since rising inflation could crush margins and corrode earnings power. For bond investors, it would erode value and make interest payments worth less.</p>\n\n<hr/>\n\n<p>“As long as the rise in Treasury yields matches the pick-up in inflation, I think the market will be able to handle that. I think the challenge is when yields get notably above inflation...I like to see them closely matched,” said Arone.</p>\n\n<hr/>\n\n<p>He said the market is concerned that the next stimulus package could overheat the economy and create inflation, particularly as it comes on the heels of the package approved in December.</p>\n\n<hr/>\n\n<p>“I think it lends to the conversation, ‘do you really need another $1.9 trillion?’ Arone said. “We’re going to pour more gas on the fire, and with this $1.9 trillion that’s what the market is concerned about.”</p>\n\n<hr/>\n\n<p>Consumer inflation is expected to remain somewhat muted for February, after the 1.4% rise year-over-year in core CPI in January. But the pace of inflation is likely to pick up notably in March and April, since the comparisons to last year, when the economy was shut down, will likely look extreme.</p>\n\n<hr/>\n\n<h1>Choppy to continue</h1>\n\n<p>Strategists expect the push-pull between interest rates and stocks to continue.</p>\n\n<hr/>\n\n<p>On Friday, rates were higher after a strong February jobs report and stocks were also higher. The economy added 379,000 jobs in February, about 160,000 more than expected.</p>\n\n<hr/>\n\n<p>“I don’t think 1.5%, 1.6% on the 10-year is terribly troublesome for the market,” said Liz Ann Sonders, chief investment strategist at Charles Schwab. She said the speed of the move was troubling.</p>\n\n<hr/>\n\n<p>The rotation out of tech and growth into more cyclical names in the financial, energy and industrial sectors continued in the past week.</p>\n\n<hr/>\n\n<p>Energy was up more than 10% with oil prices, which were at a near two-year high. Financials saw the next strongest move, gaining 4.3% for the week.</p>\n\n<hr/>\n\n<p>“I think we’re in a choppy consolidation phase,” said Sonders.</p>\n\n<hr/>\n\n<p>“You’re seeing some extreme historical spreads between what energy and financials are doing recently versus tech and consumer discretionary,” she said.</p>\n\n<hr/>\n\n<p>Sonders added that even if the consolidation phase is close to ending, that suggests there could be more downside for some frothy names. “The good news here is I think it’s becoming a better environment for active stock pickers,” she said.</p>\n\n<hr/>\n\n<p>The Nasdaq Composite was down more than 10%, as of Thursday from its Feb. 12 high. But on Friday, the index turned around, gaining about 1.6%. That’s a positive sign for the market, particularly since it happened as rates moved higher.</p>\n\n<hr/>\n\n<p>The S&amp;P 500 was up 0.8% for the week, and the Dow was up 1.8%. The Nasdaq, meanwhile, was down 2%.</p>\n\n<hr/>\n\n<p>“I think ultimately the higher quality segments that got hit in tech and communications probably did need to see a valuation reweighting,” Sonders said. “Arguably, we had some micro bubbles in the market, and they may need to suffer more downside.”</p>\n\n<hr/>\n\n<p>She said investors may want to adjust the allocation of their holdings regularly instead of waiting to adjustments around the calendar</p>\n\n<hr/>\n\n<p>“If you get a two three week, four five day surge in a particular sector, pare some back,” Sonders said, nothing that’s the opposite of what most people do.</p>\n\n<hr/>\n</blockquote>\n\n<h1><strong>This past week saw the following moves in the S&amp;P:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/To10aNZ.png\">CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!</a>)</strong></h6>\n\n<h1><strong>S&amp;P Sectors for this past week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/dWhJ1FA.png\">CLICK HERE FOR THE S&amp;P SECTORS FOR THE PAST WEEK!</a>)</strong></h6>\n\n<h1><strong>Major Indices for this past week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/dD0ByFt.png\">CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!</a>)</strong></h6>\n\n<h1><strong>Major Futures Markets as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/EBYgVqH.png\">CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!</a>)</strong></h6>\n\n<h1><strong>Economic Calendar for the Week Ahead:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/6Gawyx5.png\">CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!</a>)</strong></h6>\n\n<h1><strong>Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/dQ2GrwQ.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>S&amp;P Sectors for the Past Week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/53ABWAI.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Major Indices Pullback/Correction Levels as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/76tpdtn.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Major Indices Rally Levels as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/nx5XPYB.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Most Anticipated Earnings Releases for this week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/tOFbsYf.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Here are the upcoming IPO&#39;s for this week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/RVs6ymH.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Friday&#39;s Stock Analyst Upgrades &amp; Downgrades:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/530wcow.png\">CLICK HERE FOR THE CHART LINK #1!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://i.imgur.com/7ZHSqwf.png\">CLICK HERE FOR THE CHART LINK #2!</a>)</strong></h6>\n\n<hr/>\n\n<blockquote>\n<h1>Jobs Market Gets Reopening Boost</h1>\n\n<p>US payrolls grew at a solid clip month over month in February, as progress in the vaccine distribution process appeared to boost growth by enabling more of the economy to reopen. Our opinion has always been that until we have achieved widespread vaccine distribution, the in-person segments of the labor market will be slow to recover losses from a year ago. We are becoming increasingly bullish on the prospect for a 2021 economic reacceleration, and we are heartened that the hardest hit segments of the jobs market may be beginning to reflect that view.</p>\n\n<p>The US Bureau of Labor Statistics released its monthly employment report this morning, revealing that the domestic economy added 379,000 jobs in February, exceeding Bloomberg-surveyed economists’ forecasts for a 200,000 gain. Large seasonal adjustments to the data did serve to boost the overall number by roughly 140,000, while January’s jobs gain was revised significantly higher from 49,000 to 166,000. Colder weather than normal may have also played some role, though the worst of the freeze experienced by middle America occurred just after the report’s observation window closed. The unemployment rate fell to 6.2% from 6.3%, and was paired with an unchanged labor force participation rate of 61.4%.</p>\n\n<p>“Last month on jobs day, we noted our optimism around an improving trajectory for vaccinations and the implications that may have for future jobs reports,” explained LPL Financial Chief Market Strategist Ryan Detrick. “This has played out so far, and we expect continued vaccination progress to become more evident in the jobs numbers as the recovery reaccelerates.”</p>\n\n<p>Average hourly earnings rose 0.2% month over month and 5.3% year over year, continuing to signal that lower-wage workers have endured the worst of the pandemic’s job losses. Inflation expectations have been in particular focus for the market lately, however inflation risks from a tightening labor market are not of major concern for now in our opinion. We expect overall average hourly earnings to remain steady or even reverse as lower wage workers are rehired in service sector jobs, and we still have lots of slack in the labor market as we hover well below 2020’s peak employment.</p>\n\n<p>The composition of February’s report importantly signals a reversal of COVID-19-driven trends seen in recent months. Retail trade gained 41,100 jobs while the leisure and hospitably industry gained 355,000—two segments that have been hardest hit throughout the pandemic. Meanwhile, professional and business services added 63,000 jobs and government jobs fell by 86,000.</p>\n\n<p>As seen in the LPL Chart of the Day, the jobs recovery in the leisure and hospitality sector has generally plateaued following an initial bounce. This segment of the labor market is highly dependent on in-person interaction, and has understandably suffered in a work-from-home environment. Unsurprisingly, service sector jobs have strongly correlated with broader trends in COVID-19 cases. The leisure and hospitality sector alone still accounts for about 3.5 million of the 9.5 million jobs lost compared to the February 2020 peak. And while we do caution against reading too far into one month’s numbers, we are excited to see this decimated sector tick notably higher in February.</p>\n\n<h6><strong>(<a href=\"https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/03/3.5.21-Blog-Chart-1.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>We have not had to look hard to find evidence that vaccines are having an impact. Nationally, seven-day averages for new cases have fallen to below early 2020 peaks, significantly below the highs of late 2020. Perhaps most crucially, the portion of the population most vulnerable to severe symptoms has largely already received at least one dose of the vaccination. A third vaccine was granted emergency use authorization in March, and this week President Biden estimated we would have enough supply of vaccinations to cover every adult by the end of May 2021. Once people can become comfortable with the virus trends, we expect widespread hiring in in-person industries to snowball quickly. February may have signaled a start to this trend.</p>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Anatomy of a Bond Market Sell-off</h1>\n\n<p>Coming into 2021, one of our higher-conviction ideas was that we would see rising long-term interest rates in the United States; it’s one of the reasons we recommended suitable investors consider an underweight to interest rate sensitive fixed income. However, we didn’t expect interest rates to move this high, this fast. The 10-Year Treasury yield started the year at 0.91% and ended the month of February at 1.41%, down from an intraday high of 1.61%. As such, core fixed income assets are off to one of their worst starts ever (remember that as yields go up, prices go down).</p>\n\n<p>“Core fixed income assets aren’t off to a very good start this year, but we don’t think investors should abandon high-quality fixed income assets as they play an important role in a diversified portfolio” says LPL Financial Chief Market Strategist Ryan Detrick.</p>\n\n<p><strong>So what is driving interest rates higher? Changing expectations</strong></p>\n\n<p>Inflation and growth expectations are important factors into the fundamental outlook for interest rates. Broadly speaking, what we’ve seen in the bond market this year is a re-pricing of both higher inflation and higher growth expectations. Inflation expectations have steadily moved higher, and market-based gauges of inflation expectations are the highest they’ve been since 2011. We don’t expect much higher inflation expectations from here, but we are watching how additional fiscal stimulus flows into the economy. Additionally, it seems increasing economic growth expectations have picked up recently as well. An increase in growth expectations may put pressure on the Federal Reserve (Fed) to move away from its low interest rate policy sooner than expected, which has put upward pressure on longer-dated Treasury yields.</p>\n\n<p>An unfortunate byproduct of those higher expectations is that we’ve seen an increase in the volatility of the 10-Year Treasury. As shown in the LPL Chart of the Day, daily percentage changes for the 10-Year Treasury yield are above historical norms (each vertical line on the chart represents the one day percentage change in the 10-Year Treasury yield). As shown, over the past several months, yields have regularly moved 10-20% in either direction on any given day. We think this is due to the changing interest rate dynamic and believe that interest rate volatility will subside the further we get into this new interest rate regime.</p>\n\n<h6><strong>(<a href=\"https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/03/3.2.21-Blog-Chart-1.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>S&amp;P 500 Seasonal Pattern Suggests Weakness Likely Ending Soon</h1>\n\n<p>In the above chart we have plotted five different S&amp;P 500 seasonal patterns along side 2021 through today’s close. “All Years 1949-2020” and “All Years 1988-2020” represent longer-term and mid-term baseline patterns. “All Post-Election Years” includes every year that was a post-presidential-election year regardless of outcome. “1St Year Democratic President” applies to this post-election year and so does “Post-Election Year After Incumbent Party Loss.”</p>\n\n<p>When comparing 2021 to these various past seasonal patterns, this year’s performance is above average, and the S&amp;P 500 is currently experiencing some of the weakness present in the other five patterns. Historical weakness (shaded in light blue) is most visible in the three post-election year patterns in February lasting until early to mid-March depending on the post-election year pattern. All three historical post-election year patterns suggest that current weakness could be ending soon.</p>\n\n<h6><strong>(<a href=\"https://64.media.tumblr.com/312c0ff338783a2746d1f2b86e748a96/35cb088c7397be19-26/s500x750/6a02d14a98ad77a0399943ed9a4533afc4385052.jpg\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Historic Surge for the Energy Sector</h1>\n\n<p>The energy sector has certainly been on a wild ride over the course of the past year, perhaps the wildest of all of the S&amp;P 500 sectors. The outbreak of the pandemic in 2020 caused such a demand shock that oil futures traded for a negative value for the first time in history, implying that someone would pay you to take delivery of their oil!</p>\n\n<p>Well, that’s in the rear-view mirror for the energy market now. Year to date, the S&amp;P 500 energy sector is up over 29% as of March 2, according to data from FactSet, more than double the return of the financial sector, the second strongest sector thus far in 2021. As shown in the LPL Chart of the Day, the S&amp;P 500 energy sector is trading at a blistering 30% above its 200-day moving average, the most ever using data back to 1990. While this might seem bearish on the surface, previous surges above 20% have historically bought above average returns over the next year rather than below average.</p>\n\n<h6><strong>(<a href=\"https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/03/3.3.21-Blog-Chart-1.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>“The case can be made that energy could be a bit stretched in the near-term, but momentum often breeds more momentum,” added LPL Financial Chief Market Strategist Ryan Detrick. “Energy has been unloved for quite some time, but we may be in the early innings of a larger rally for the energy sector as the global economy continues to improve.”</p>\n\n<p>A confluence of events may be spurring the boom in the energy sector. An expanding global economy, a historic winter storm that shut down major oil producing states like Texas and Oklahoma, and an output agreement from members of OPEC+ have sent oil prices soaring to their highest level since early 2019. It’s not just oil, either. Copper and lumber have surged past their 2019 highs as well. It’s no secret that inflation expectations have been on the rise, and the surge in commodity prices are likely adding further credence to the market’s view of higher inflation.</p>\n\n<p>We have continued to warm up to the energy sector, including upgrading our view on oil in January and then our upgrade from negative to neutral in our February Global Portfolio Strategy publication.</p>\n</blockquote>\n\n<hr/>\n\n<h6><strong>(<a href=\"https://i.imgur.com/tOFbsYf.png\">CLICK HERE FOR NEXT WEEK&#39;S MOST NOTABLE EARNINGS RELEASES!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://i.imgur.com/EpicBgo.png\">CLICK HERE FOR NEXT WEEK&#39;S HIGHEST VOLATILITY EARNINGS RELEASES!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://i.imgur.com/8Yu6xEv.png\">CLICK HERE FOR THE MOST ANTICIPATED EARNINGS RELEASES BEFORE MONDAY&#39;S MARKET OPEN!</a>)</strong></h6>\n\n<hr/>\n\n<p>Below are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:</p>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Monday 3.8.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/1GusVbt.png\">CLICK HERE FOR MONDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n\n<h1><strong><em>Monday 3.8.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/8rZIyb6.png\">CLICK HERE FOR MONDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Tuesday  3.9.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/uCPw0OM.png\">CLICK HERE FOR TUESDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n\n<h1><strong><em>Tuesday 3.9.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/Ip7ljec.png\">CLICK HERE FOR TUESDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Wednesday 3.10.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/CpwVBDz.png\">CLICK HERE FOR WEDNESDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n\n<h1><strong><em>Wednesday 3.10.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/xvNwkyY.png\">CLICK HERE FOR WEDNESDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Thursday 3.11.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/GVnk8Z8.png\">CLICK HERE FOR THURSDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n\n<h1><strong><em>Thursday 3.11.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/gZCO70k.png\">CLICK HERE FOR THURSDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Friday 3.12.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/9hiUcBu.png\">CLICK HERE FOR FRIDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Friday 3.12.21 After Market Close:</em></strong></h1>\n\n<h6>([CLICK HERE FOR FRIDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())</h6>\n\n<p>(NONE.)</p>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>AMC Entertainment Holdings, Inc $8.05</h1>\n\n<p><strong>AMC Entertainment Holdings, Inc (AMC)</strong> is confirmed to report earnings at approximately 4:15 PM ET on Wednesday, March 10, 2021. The consensus estimate is for a loss of $2.89 per share on revenue of $155.19 million and the Earnings Whisper ® number is ($4.23) per share. Investor sentiment going into the company&#39;s earnings release has 25% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 925.71% with revenue decreasing by 89.28%. The stock has drifted higher by 244.0% from its open following the earnings release to be 71.3% above its 200 day moving average of $4.70. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Wednesday, March 3, 2021 there was some notable buying of 108,187 contracts of the $1.00 put expiring on Thursday, April 1, 2021. Option traders are pricing in a 22.3% move on earnings and the stock has averaged a 7.0% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=AMC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>JD.com, Inc. $90.62</h1>\n\n<p><strong>JD.com, Inc. (JD)</strong> is confirmed to report earnings at approximately 5:50 AM ET on Thursday, March 11, 2021. The consensus earnings estimate is $0.19 per share on revenue of $33.90 billion and the Earnings Whisper ® number is $0.25 per share. Investor sentiment going into the company&#39;s earnings release has 83% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 57.78% with revenue increasing by 38.27%. Short interest has decreased by 18.6% since the company&#39;s last earnings release while the stock has drifted higher by 2.4% from its open following the earnings release to be 17.3% above its 200 day moving average of $77.28. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Wednesday, February 17, 2021 there was some notable buying of 7,146 contracts of the $135.00 call expiring on Friday, March 19, 2021. Option traders are pricing in a 8.2% move on earnings and the stock has averaged a 7.4% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=JD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>DocuSign $204.31</h1>\n\n<p><strong>DocuSign (DOCU)</strong> is confirmed to report earnings at approximately 4:05 PM ET on Thursday, March 11, 2021. The consensus earnings estimate is $0.22 per share on revenue of $407.65 million and the Earnings Whisper ® number is $0.29 per share. Investor sentiment going into the company&#39;s earnings release has 85% expecting an earnings beat The company&#39;s guidance was for revenue of $404.00 million to $408.00 million. Consensus estimates are for year-over-year earnings growth of 120.00% with revenue increasing by 48.29%. The stock has drifted lower by 16.6% from its open following the earnings release to be 3.3% below its 200 day moving average of $211.25. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Friday, March 5, 2021 there was some notable buying of 2,182 contracts of the $220.00 call expiring on Friday, April 16, 2021. Option traders are pricing in a 10.7% move on earnings and the stock has averaged a 9.9% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=DOCU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>XPeng Inc. $28.03</h1>\n\n<p><strong>XPeng Inc. (XPEV)</strong> is confirmed to report earnings at approximately 4:00 AM ET on Monday, March 8, 2021. Investor sentiment going into the company&#39;s earnings release has 64% expecting an earnings beat. The stock has drifted lower by 23.2% from its open following the earnings release. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Thursday, February 25, 2021 there was some notable buying of 18,718 contracts of the $25.00 put expiring on Friday, March 19, 2021. Option traders are pricing in a 16.1% move on earnings and the stock has averaged a 33.4% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=XPEV&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Tattooed Chef Inc. $19.12</h1>\n\n<p><strong>Tattooed Chef Inc. (TTCF)</strong> is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, March 10, 2021. The consensus earnings estimate is $0.03 per share on revenue of $39.05 million and the Earnings Whisper ® number is $0.04 per share. Investor sentiment going into the company&#39;s earnings release has 90% expecting an earnings beat. The stock has drifted lower by 0.1% from its open following the earnings release. On Thursday, January 21, 2021 there was some notable buying of 2,046 contracts of the $40.00 call expiring on Friday, January 21, 2022. Option traders are pricing in a 17.1% move on earnings and the stock has averaged a 13.8% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=TTCF&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Niu Technologies $33.55</h1>\n\n<p><strong>Niu Technologies (NIU)</strong> is confirmed to report earnings at approximately 2:00 AM ET on Monday, March 8, 2021. The consensus earnings estimate is $0.09 per share on revenue of $95.16 million and the Earnings Whisper ® number is $0.11 per share. Investor sentiment going into the company&#39;s earnings release has 70% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 18.18% with revenue increasing by 23.57%. Short interest has increased by 170.9% since the company&#39;s last earnings release while the stock has drifted higher by 2.1% from its open following the earnings release to be 27.3% above its 200 day moving average of $26.35. Overall earnings estimates have been revised lower since the company&#39;s last earnings release. On Thursday, February 25, 2021 there was some notable buying of 10,356 contracts of the $35.00 put expiring on Friday, March 19, 2021. Option traders are pricing in a 20.3% move on earnings and the stock has averaged a 4.9% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=NIU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>CarParts.com, Inc. $16.16</h1>\n\n<p><strong>CarParts.com, Inc. (PRTS)</strong> is confirmed to report earnings at approximately 4:00 PM ET on Monday, March 8, 2021. The consensus estimate is for a loss of $0.10 per share on revenue of $91.97 million and the Earnings Whisper ® number is ($0.07) per share. Investor sentiment going into the company&#39;s earnings release has 76% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 85.71% with revenue increasing by 46.08%. Short interest has decreased by 5.5% since the company&#39;s last earnings release while the stock has drifted higher by 14.9% from its open following the earnings release to be 26.4% above its 200 day moving average of $12.78. Overall earnings estimates have been revised lower since the company&#39;s last earnings release. On Wednesday, January 27, 2021 there was some notable buying of 3,469 contracts of the $20.00 call expiring on Friday, March 19, 2021. Option traders are pricing in a 23.1% move on earnings and the stock has averaged a 13.0% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=PRTS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>DICK&#39;S Sporting Goods, Inc. $71.69</h1>\n\n<p><strong>DICK&#39;S Sporting Goods, Inc. (DKS)</strong> is confirmed to report earnings at approximately 7:30 AM ET on Tuesday, March 9, 2021. The consensus earnings estimate is $2.21 per share on revenue of $3.05 billion and the Earnings Whisper ® number is $2.98 per share. Investor sentiment going into the company&#39;s earnings release has 71% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 67.42% with revenue increasing by 16.92%. Short interest has decreased by 21.0% since the company&#39;s last earnings release while the stock has drifted higher by 21.5% from its open following the earnings release to be 31.9% above its 200 day moving average of $54.34. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Monday, February 1, 2021 there was some notable buying of 522 contracts of the $100.00 call expiring on Friday, June 18, 2021. Option traders are pricing in a 10.3% move on earnings and the stock has averaged a 7.7% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=DKS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>ContextLogic Inc. $17.77</h1>\n\n<p><strong>ContextLogic Inc. (WISH)</strong> is confirmed to report earnings after the market closes on Monday, March 8, 2021. The consensus estimate is for a loss of $2.13 per share on revenue of $736.10 million and the Earnings Whisper ® number is ($1.89) per share. Investor sentiment going into the company&#39;s earnings release has 79% expecting an earnings beat On Friday, February 26, 2021 there was some notable buying of 5,486 contracts of the $15.00 put expiring on Friday, April 16, 2021.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=WISH&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Stitch Fix, Inc. $73.00</h1>\n\n<p><strong>Stitch Fix, Inc. (SFIX)</strong> is confirmed to report earnings at approximately 4:05 PM ET on Monday, March 8, 2021. The consensus estimate is for a loss of $0.22 per share on revenue of $512.37 million and the Earnings Whisper ® number is ($0.06) per share. Investor sentiment going into the company&#39;s earnings release has 58% expecting an earnings beat The company&#39;s guidance was for revenue of $506.00 million to $515.00 million. Consensus estimates are for earnings to decline year-over-year by 300.00% with revenue increasing by 13.41%. Short interest has decreased by 58.5% since the company&#39;s last earnings release while the stock has drifted higher by 43.1% from its open following the earnings release to be 74.0% above its 200 day moving average of $41.96. Overall earnings estimates have been revised lower since the company&#39;s last earnings release. On Monday, March 1, 2021 there was some notable buying of 708 contracts of the $90.00 call expiring on Friday, April 16, 2021. Option traders are pricing in a 23.7% move on earnings and the stock has averaged a 16.9% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=SFIX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<h1>DISCUSS!</h1>\n\n<p>What are you all watching for in this upcoming trading week?</p>\n\n<hr/>\n\n<p>I hope you all have a wonderful weekend and a great week and month ahead <a href=\"/r/stocks\">r/stocks</a>.</p>\n</div><!-- SC_ON -->",
  "score": 353,
  "permalink": "/r/stocks/comments/lz0k91/wall_street_week_ahead_for_the_trading_week/",
  "subreddit": "stocks",
  "id": "lz0k91",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542576972
}