{
  "author": "AhoyMatteyPDX",
  "original_created_utc": 1659943312,
  "title": "Do mentally well people think of suicide?",
  "created_utc": 1659967096,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;First things first, i&amp;#39;m not going to do it. Let me repeat, I&amp;#39;m not going to do it.&lt;/p&gt;\n\n&lt;p&gt;But I sure AF think about it. Daily. Multiple times a day.  I have for as far back as I can remember, which is probably why while unwelcome it doesn&amp;#39;t feel weird to me. But it can&amp;#39;t be normal to have this repeated impulse, right?&lt;/p&gt;\n\n&lt;p&gt;Though not currently in therapy, I have spent many years seeing different psychologists and have felt good about progress I&amp;#39;ve made in certain areas of my life, but this thought never seems to go away. And also, it makes me question if I actually have made any progress, since it seems like &amp;quot;wanting to be alive&amp;quot; should probably be baseline for success.&lt;/p&gt;\n\n&lt;p&gt;So, are there people out there who consider themselves relatively well adjusted that also deal with these unwelcome thoughts?&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;ETA some clarification on a couple of things:&lt;/p&gt;\n\n&lt;p&gt;- Not currently in therapy but totally open to getting back into it. I&amp;#39;m sure that I will, I just need a few other things to fall into place first.&lt;/p&gt;\n\n&lt;p&gt;- It&amp;#39;s not even a &amp;quot;i am worthless and the world would be better without me&amp;quot; thing (though i&amp;#39;ve been there, too). It&amp;#39;s kind of like &amp;quot;oh, i&amp;#39;m standing on this balcony, i should just jump off&amp;quot; or &amp;quot;look at that pipe. I could hang myself from it.&amp;quot; Or sometimes its just out of nowhere &amp;quot;hey! I could blow my brains out!&amp;quot; Incredibly vivid thoughts/mental images that just come out of nowhere. It feels important to make that distinction bc it&amp;#39;s not like I&amp;#39;m trying to find a long term solution to a short term problem. It&amp;#39;s more just... how I see my environment? And it&amp;#39;s exhausting.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 107,
  "permalink": "/r/TooAfraidToAsk/comments/wj2gxo/do_mentally_well_people_think_of_suicide/",
  "subreddit": "TooAfraidToAsk",
  "id": "wj2gxo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "First things first, i'm not going to do it. Let me repeat, I'm not going to do\nit.\n\nBut I sure AF think about it. Daily. Multiple times a day. I have for as far\nback as I can remember, which is probably why while unwelcome it doesn't feel\nweird to me. But it can't be normal to have this repeated…"
}