{
  "author": "psychotrader00",
  "the_new_excerpt": "Stocks rose on Monday, following a volatile week, with technology stocks leading\nthe pack looking to reclaim lost ground. After leading the market higher in\n2020, tech stocks have largely been under pressure following a sharp rise in\nTreasury yields. Banks, industrials, and other reopening stock…",
  "original_created_utc": 1616445163,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "周一股市上涨，在经历了一周的波动后，科技股领涨。\n的队伍，希望收复失地。在领涨市场后\n2020年，科技股在大幅上涨后，基本已经承压。\n国债收益率。银行、工业品等复盘股...",
      "title": "以下是2021年3月22日（星期一）今天的市场回顾。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "週一股市上漲，在經歷了一週的波動後，科技股領漲。\n的隊伍，希望收復失地。在領漲市場後\n2020年，科技股在大幅上漲後，基本已經承壓。\n國債收益率。銀行、工業品等覆盤股...",
      "title": "以下是2021年3月22日（星期一）今天的市場回顧。"
    }
  ],
  "title": "Here is a Market Recap for today Monday, March 22, 2021",
  "created_utc": 1616467979,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Stocks rose on Monday, following a volatile week, with technology stocks leading the pack looking to reclaim lost ground. After leading the market higher in 2020, tech stocks have largely been under pressure following a sharp rise in Treasury yields. Banks, industrials, and other reopening stock underperformed, giving back some recent gains, but looking ahead, we expect the rotation out of tech stocks and into cyclical and reopening stocks to continue as the economy continues to gradually open back up.</p>\n\n<p>After jumping to one-year highs last week, the 10 year Treasury yield retreated to hover slightly below 1.7% (1.68% at the time of writing). The sharp contrast between the performance of the Dow and the Nasdaq in recent weeks underscores the increasing rotation out of high-flying tech stocks that led the markets higher last year and into stocks that are poised to directly benefit from economic reopening. The energy and financials sectors have also been leading gains in the S&amp;P 500, outperforming tech and growth stocks in 2021. Rising Treasury yields hurt high-growth stocks the most because these companies require a lot of capital to fund their growth and expansion and generate most of their cash and earnings years down the road. Future cash decreases in today&#39;s dollars as rates increase partly because investors have more opportunity to earn bigger returns from assets paying higher interest and dividends right now. Higher yields make it more expensive to borrow capital. It’s important to remember that despite rising yields, the benchmark 10-year yield remains at historic lows, roughly half what it was five years ago. </p>\n\n<p>Last week, The Federal Reserve reiterated its commitment to maintaining interest rates near zero and asset purchase program at a pace of $120 billion per month in place for the foreseeable future, even as the US economy shows signs of gaining momentum thanks to an increase in the pace of vaccination and the recently passed stimulus package. FOMC members now expect the unemployment rate to dip to 4.5% by the end of this year with an inflation rate of 2.4%. Three months earlier, the Fed expected an unemployment rate to improve to only 5.0% with core personal consumption expenditures rising by just 1.8% by year-end. Real GDP growth will likely come in at 6.5% this year, the Fed projected, up sharply from its previous 4.2% growth forecast. </p>\n\n<p>Steve Sosnick, chief strategist of at Interactive Brokers said of the Fed’s comments, “Chairman Powell was pretty adamant, as he had been in front of Congress as well, that he was not really inclined to do anything preemptive about inflation, but react to it if inflation becomes a problem if we’re at full employment. We’re a long way off from that, but the bond market now is getting nervous that we could see inflation becoming a problem before the Fed does anything about it. And that’s the little bit of a freak out that we had been seeing in bonds.”</p>\n\n<p><strong>Highlights</strong></p>\n\n<ul>\n<li>Tomorrow after the close, Gamestop (GME) is reporting earnings. This is going to be interesting to say the least.</li>\n<li>India plans to offer fresh incentives to companies making electric vehicles (EVs) as part of a broad auto sector scheme it expects to attract $14 billion of investment over five years, according to industry sources and a document seen by Reuters.</li>\n<li>The number of U.S. air passengers screened topped 1.5 million Sunday for the first time since March 2020, as air travel continues to rebound from a pandemic-related drop, the U.S. Transportation Security Administration (TSA) said Monday.</li>\n<li>After announcing plans to cut battery costs and rely on six European gigafactories to produce EV’s, shares of Volkswagen (VWAGY) have been on a tear. </li>\n<li>Existing home sales dropped 6.6% in February over January, declining to a seasonally adjusted annual rate of 6.22 million, <a href=\"https://urldefense.proofpoint.com/v2/url?u=https-3A__www.nar.realtor_existing-2Dhome-2Dsales&amp;d=DwMFaQ&amp;c=sWW_bEwW_mLyN3Kx2v57Q8e-CRbmiT9yOhqES_g_wVY&amp;r=I97LtZbGxrZY5aiFxIAXefV9ml4lj-X42ih5ebFy_l0&amp;m=ycD3-sTG_290ozMNsCB5D5Ou-pF0OguHJFs7Yp29dzo&amp;s=yw-exLt29oZJd9JSv9rb1B7IHuwQNJzVJ8Aje1FLyrw&amp;e=\">according to the National Association of Realtors</a> (NAR). Consensus economists were expecting a decline of just 2.8% for the month, according to Bloomberg consensus estimates.</li>\n<li>California&#39;s two U.S. senators are urging President Joe Biden to set a firm date to phase-out gas-powered passenger vehicles. </li>\n<li><strong>**Please note current stock price was written premarket and does not reflect intraday changes*\\</strong>*</li>\n<li>Apple (AAPL) target raised by Evercore ISI from $163 to $175 at Outperform. Stock currently around $120</li>\n<li>Accenture (ACN) target raised by Barclays from $300 to $310 at Overweight. Stock currently around $263</li>\n<li>Adient (ADNT) with three target raises. Stock currently around $42.60\n\n<ul>\n<li>Royal Bank of Canada from $46 to $55</li>\n<li>Barclays from $45 to $60</li>\n</ul></li>\n<li>-Alaska Air (ALK) target raised by Goldman Sachs (GS) from $64 to $90 at Buy. Stock currently around $71KeyCorp from $45 to $55</li>\n<li>Boeing (BA) target raised by Morgan Stanley (MS) from $250 to $274 at Overweight. Stock currently $256</li>\n<li>Darden Restaurants (DRI) with two target raises. Stock currently around $140\n\n<ul>\n<li>Raymond James from $137 to $155</li>\n<li>Oppenheimer from $140 to $165</li>\n</ul></li>\n<li>GoodRx (GDRX) target raised by Credit Suisse from $49 to $50 at Outperform. Stock currently around $37</li>\n<li>Gap (GPS) target raised by Wells Fargo (WFC) from $32 to $40 at Overweight. Stock currently around $31</li>\n<li>JP Morgan (JPM) target raised by Wells Fargo (WFC) from $170 to $185 at Overweight. Stock currently around $155</li>\n<li>Eli Lilly (LLY) target raised by Truist Securities from $215 to $225 at Buy. Stock currently around $184</li>\n<li>Mastercard (MA) target raised by Morgan Stanley (MS) from $377 to $412 at Overweight. Stock currently around $356</li>\n<li>Nike (NKE) target raised by Piper Sanlder from $168 to $170 at Overweight. Stock currently around $137</li>\n<li>Micron Tech (MU) target raised by Cascend Securities from $100 to $110 at Buy. Stock currently around $90</li>\n<li>NXP Semiconductors (NXPI) target raised by Credit Suisse from $215 to $250 at Outperform. Stock currently around $202</li>\n<li>Dave &amp; Buster&#39;s (PLAY) target raised by Raymond James from $45 to $55 at Strong-Buy</li>\n<li>Royal Caribbean (RCL) target raised by JP Morgan from $100 to $110 at Overweight. Stock currently around $91</li>\n<li>Visa (V) target raised by Morgan Stanley (MS) from $233 to $253 at Overweight. Stock currently around $207</li>\n<li>Texas Roadhouse (TXRH) with two target raises. Stock currently around $95\n\n<ul>\n<li>BTIG Research from $92 to $109 at Buy</li>\n<li>Raymond James from $100 to $108 at Strong-Buy</li>\n</ul></li>\n</ul>\n\n<p>“In the middle of difficulty lies opportunity.” - Albert Einstein</p>\n</div><!-- SC_ON -->",
  "score": 81,
  "permalink": "/r/stocks/comments/max8nb/here_is_a_market_recap_for_today_monday_march_22/",
  "subreddit": "stocks",
  "id": "max8nb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752821016
}