{
  "author": "illintent99",
  "original_created_utc": 1639254489,
  "title": "If we go into a bear market, which coin isn't making it back out?",
  "created_utc": 1639269315,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Ofcourse, no one knows for sure what&amp;#39;s going to happen, just &lt;del&gt;educated&lt;/del&gt; guesses. I personally don&amp;#39;t think we are/going into a &amp;#39;bear&amp;#39; market. That term gets thrown around a little too easily on this sub. I&amp;#39;m guessing things will pick up considerably in the next month or two but I&amp;#39;m a naive shrimp. &lt;/p&gt;\n\n&lt;p&gt;I keep hearing a vast majority of Alts do not make it out of a true bear market. They usually reference 2017 till now. I get it, some coins get wrecked but that was also a very different time in Crypto. I think the blow to credible Alts won&amp;#39;t be as harsh this time around. &lt;/p&gt;\n\n&lt;p&gt;That being said, a number of them will not recover. This is the time to air it all out, which coin(s) will not survive?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 181,
  "permalink": "/r/CryptoCurrency/comments/re83f5/if_we_go_into_a_bear_market_which_coin_isnt/",
  "subreddit": "CryptoCurrency",
  "id": "re83f5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Ofcourse, no one knows for sure what's going to happen, just educated guesses. I\npersonally don't think we are/going into a 'bear' market. That term gets thrown\naround a little too easily on this sub. I'm guessing things will pick up\nconsiderably in the next month or two but I'm a naive shrimp.\n\nI…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もちろん、何が起こるかは誰にもわからない。ただ、経験則から推測することはできる。I\n個人的には、「弱気」相場には入っていないと思っています。この言葉は\nこのサブサイトでは少し安易に考えすぎています。私は、事態が好転すると思っています。\nこの1～2ヶ月でかなり改善されると思いますが、私は甘いエビです。\n\nI...",
      "title": "もしもベアマーケットに突入した場合、どのコインが復活しないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当然，没有人知道肯定会发生什么，只是经过教育的猜测。I\n个人不认为我们正在/即将进入 \"熊市\"。这个词被扔在\n这个词在本子上被扔得太容易了。我猜测事情会在\n在接下来的一两个月里会有相当大的回升，但我是个天真的小虾米。\n\nI...",
      "title": "如果我们进入熊市，哪种钱币不可能再出来？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當然，沒有人知道肯定會發生什麼，只是經過教育的猜測。I\n個人不認爲我們正在/即將進入 \"熊市\"。這個詞被扔在\n這個詞在本子上被扔得太容易了。我猜測事情會在\n在接下來的一兩個月裏會有相當大的回升，但我是個天真的小蝦米。\n\nI...",
      "title": "如果我們進入熊市，哪種錢幣不可能再出來？"
    }
  ]
}