{
  "author": "hooman_or_whatever",
  "the_new_excerpt": "It has become exceeding clear that a lot of new investors, and even some\nseasoned ones have overlooked some crucial aspects regarding finance as a whole.\nI am beginning a tutorial series on YT and here, starting with finance and\nworking our way up to investing/trading tools and strategies. Welcome…",
  "original_created_utc": 1614130896,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "越来越明显的是，很多新的投资者，甚至是一些。\n资深的人都忽略了一些关于金融整体的关键环节。\n我在YT和这里开始一个系列教程，从金融和\n我们的工作方式投资/交易工具和策略。欢迎...",
      "title": "给新投资者的说明--------系列教程"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "越來越明顯的是，很多新的投資者，甚至是一些。\n資深的人都忽略了一些關於金融整體的關鍵環節。\n我在YT和這裏開始一個系列教程，從金融和\n我們的工作方式投資/交易工具和策略。歡迎...",
      "title": "給新投資者的說明--------系列教程"
    }
  ],
  "title": "A Note To New Investors - A Series of Tutorials",
  "created_utc": 1614137113,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It has become exceeding clear that a lot of new investors, and even some seasoned ones have overlooked some crucial aspects regarding finance as a whole. I am beginning a tutorial series on YT and here, starting with finance and working our way up to investing/trading tools and strategies. Welcome to the first one.</p>\n\n<p>A large portion of individuals understand what money is but few know what we are supposed to be doing with it. Today we are going to discuss the 4 buckets of finance.</p>\n\n<p><strong>Short, Mid, Long, Retirement</strong></p>\n\n<p>The purpose, asset classes, advantages and disadvantages of each will be discussed.</p>\n\n<p><strong>Short-Term Bucket</strong></p>\n\n<p><em>Purpose:</em> It is meant to be 3-6 months worth of expenses that you have saved away. It should never exceed more than 6 months as your money in a savings account is actually losing value over time. It is meant to fund short term things such as your car breaking down, we can call this the emergency fund.  It is also a safety net, for instance, if you were to lose your job then you are sure you have 6 months to find a new one. This is perhaps the most important bucket to investors and I will explain why later.</p>\n\n<p><em>Asset Classes:</em> Cash, Checking, Savings, Money Market Accounts</p>\n\n<p><em>Advantages:</em> It is liquid meaning you can withdraw at any time, and it is safe as the money is insured and secured. More than that, it keeps peace of mind. This is why it is so important to investors; one of the largest risks while investing is emotion, with a full short term bucket you will not fall prey to emotion as much as you would if this was all of your funds.</p>\n\n<p><em>Disadvantages:</em> Low returns, typically less than 2%. Now, keep in mind, inflation averages 2-3% and therefore outpaces your returns de-valuing your money over time. This money is also fully taxable. These are reasons why it should never exceed the 6 months worth of expenses mark. All additional funds beyond your emergency fund should be moved to other buckets to grow exponentially, outpace inflation, and increase your net-worth.</p>\n\n<p><strong>Mid-Term Bucket</strong></p>\n\n<p><em>Purpose:</em> It is meant to fund mid-term goals such as purchasing a home, paying for college, investing in a company. This is where most people on Reddit are currently operating and where too many are being their financial journey.</p>\n\n<p><em>Asset Classes:</em> Stocks, bonds, mutual funds, ETF&#39;s</p>\n\n<p><em>Advantages:</em> Contrary to popular belief 7-8% is the target goal for growth. If you are able to pull off 20% or higher annual returns, then good on you. If you have a separate fund that&#39;s available for high-risk investments akin to gambling, this is how you could see 1000%+ returns. Another advantage is that its relatively liquid, meaning you could sell off securities to retrieve your money at anytime. However, it is <em>relatively</em> liquid because if they market is moving against you then you would have to sell at a loss, or even if the market is in a bull run you wouldn&#39;t want to pull out until you&#39;re closer to the top.</p>\n\n<p><em>Disadvantages:</em> First and foremost; risk. Not only are you subject to market risk, but that market risk is controlled by global socioeconomic factors that could be impossible to predict. The way people react to these things is based on emotion. So emotional risk isn&#39;t only your own, personal emotion, but the emotion of everyone else in the market. Your personal emotion could be curbed by having a full short term bucket. Gains are taxable...by quite a bit. <a href=\"https://smartasset.com/investing/capital-gains-tax-calculator\">Here is a calculator</a> so you can see for yourself. Finally, there are some serious barriers to entry regarding FUD (Fear. Uncertainty. Doubt) and knowledge. I am hoping that this tutorial series could help alleviate some of that concern.</p>\n\n<p><strong>Long-Term Bucket</strong></p>\n\n<p><em>Purpose:</em> This is meant to diversify and hedge against market risk. This bucket requires some serious capital and should be started after seeing some success in your mid-term bucket. Albeit, some individuals will purchase homes prior to investing but I don&#39;t think jumping right into real-estate is always the wisest financial decision.</p>\n\n<p><em>Asset Classes:</em> Real estate, small business, cash value life insurance, fixed annuities</p>\n\n<p><em>Advantages:</em> Relatively safe, several tax benefits, and it creates generational wealth; meaning these are things that could stay within your family line. The returns are typically 4-5% in this bucket. They aren&#39;t meant to outpace inflation by a terrible sum, but enough to diversify your wealth and secure tangible assets.</p>\n\n<p><em>Disadvantages:</em> This bucket is probably out of many&#39;s reach right now due to the capital requirements. Even still, it is not a bucket I am focused on due to this significant disadvantage: your capital is tied up in the short term. I am personally not at a place where I want my capital tied up, all of it is in the midterm bucket until I have reached my financial goals and am ready to move on.</p>\n\n<p><strong>Retirement Bucket</strong></p>\n\n<p><em>Purpose:</em> Well...to retire. I&#39;m sure many of you are familiar with this bucket but a lot of younger folks (myself included) seem to have forgotten that we will one day need to rely on funds in order to survive. We don&#39;t put enough emphasis on this bucket earlier on in life.</p>\n\n<p><em>Asset Classes:</em> Roth 401k, 401k, Roth IRA, IRA, Variable Annuity</p>\n\n<p><em>Advantages:</em> A large advantage to this bucket is the tax advantage. Depending on which direction you go, you could end up with tax-deferred or even tax-free growth. Because the market generally trends upward, this also means on a long enough horizon you will see larger returns. The biggest benefit and the prime reason I utilize this bucket is the 401k company match. To turn that down is equivalent to denying free money.</p>\n\n<p><em>Disadvantages:</em> You cannot forget that this is still the market, so you are still held to similar disadvantages as the mid-term bucket. The market could move against you and market or independent emotion could play a factor as well. Another disadvantage is that it is virtually illiquid, while you are able to take your money out you will be hit with a pretty severe penalty. This in conjunction with personal emotion could add up to serious financial disaster. The final disadvantage is that annual contributions are capped. IRA&#39;s are capped at $6000 and 401k&#39;s are capped at $19,500. Even if you have the wealth to fully commit to both of these for 60 straight years that would equate to roughly $1.5M (of course not including the returns)</p>\n\n<p><strong>Summary:</strong></p>\n\n<p>I truthfully don&#39;t believe anyone should even consider investing until they have their short term bucket full. It will make you a better investor by helping mitigate emotional response and will also provide peace of mind to allow you to practice patience in the market. On the other side, for those who have filled their short-term bucket and continue adding to their savings account, you are quite literally throwing money away and should consider at least one, if not all, of these follow-on buckets.</p>\n\n<p>The tutorial series will be focused heavily on the mid-term bucket, primarily regarding stocks. This bucket is single handedly the largest creator of wealth in the entire world.</p>\n\n<p>The long term bucket is a fantastic way to give peace of mind, diversify your wealth, and create generational wealth for your family and legacy. However, the capital requirements and short term lockup makes this something we won&#39;t focus on in the series until a much later date. I hope that myself and you will be considering adding to this bucket at the same time and we could open a new series on this bucket specifically.</p>\n\n<p>The retirement bucket isn&#39;t something that should be ignored but should be getting added to gradually over a long timeline. Truthfully, I expect to retire from the mid-term bucket, however, I am adding to this bucket solely due to the 401k match by my employers.</p>\n\n<p><strong>TL;DR:</strong> Before you begin investing, or even if you have and don&#39;t really know what you should do with this money, you should consider learning a bit about finance first. As we continue to crowd source and share information, I hope this generation to exhibit enough knowledge, perseverance, and grit to create a real shift in wealth distribution. Follow me for the tutorials to come. I look forward to your thoughts and questions.</p>\n\n<p><em>Disclaimer: I am not a financial advisor, I am passionate about finance and have utilized certain tools and ideologies to take control of my money and work towards true financial freedom. None of what I say is direct advice and should not be interpreted as such. These are simply things that have worked for me and I want to share them with you.</em> </p>\n</div><!-- SC_ON -->",
  "score": 510,
  "permalink": "/r/stocks/comments/lqzrk7/a_note_to_new_investors_a_series_of_tutorials/",
  "subreddit": "stocks",
  "id": "lqzrk7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332886313
}