{
  "author": "Weaver96",
  "the_new_excerpt": "To all the new guys who regret not investing in crypto earlier: You're still\nearly. Wanna know why?\n\n#1 - Most people still don't have any idea what cryptocurrencies are. They\nmight've heard the word \"bitcoin\" once, but can't really tell what it is, or if\nthere are other cryptos as well.\n\n#2 - Media…",
  "original_created_utc": 1613064458,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "致所有后悔没有早点投资加密的新人。你还在\n尽早。想知道为什么吗？\n\n#1 - 大多数人仍然不知道什么是加密货币。他们\n可能听说过 \"比特币 \"这个词，但不知道它是什么，也不知道它是不是\n还有其他的加密货币。\n\n#＃2 - 媒体...",
      "title": "别担心，你还早着呢! 想知道为什么吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "致所有後悔沒有早點投資加密的新人。你還在\n儘早。想知道爲什麼嗎？\n\n#1 - 大多數人仍然不知道什麼是加密貨幣。他們\n可能聽說過 \"比特幣 \"這個詞，但不知道它是什麼，也不知道它是不是\n還有其他的加密貨幣。\n\n#＃2 - 媒體...",
      "title": "別擔心，你還早着呢! 想知道爲什麼嗎？"
    }
  ],
  "title": "Don't worry, you're still early! Wanna know why?",
  "created_utc": 1613075882,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>To all the new guys who regret not investing in crypto earlier: You&#39;re still early. Wanna know why?</p>\n\n<p><strong>#1</strong> - Most people still don&#39;t have any idea what cryptocurrencies are. They might&#39;ve heard the word &quot;bitcoin&quot; once, but can&#39;t really tell what it is, or if there are other cryptos as well.</p>\n\n<p><strong>#2</strong> - Media coverage is mostly negative, lobbying against crypto is harder than ever. However, this is slowly, but steadily shifting.</p>\n\n<p><strong>#3</strong> - Most cryptocurrencies are still under development and are far from a finished product. Even those dev teams that claim to have a finished product are optimizing and polishing their network/platform. </p>\n\n<p><strong>#4</strong> - Price discovery is still going on, the ratio of supply and demand are changing 24/7. Also, the volatility is very high, which scares off many investors. </p>\n\n<p><strong>#5</strong> - Most merchants don&#39;t accept cryptocurrencies. We are starting to see the signs of mass adoption, but there&#39;s still a long way to go. </p>\n\n<p><strong>#6</strong> - Cryptocurrencies are still lacking in user experience. For the average user, buying, selling and trading cryptocurrencies are still considered complicated, and while Coinbase and co. have very simplified platforms for purchasing cryptos, improving UX is still an ongoing process.</p>\n\n<p>Feel free to add anything to this list in the comments!</p>\n</div><!-- SC_ON -->",
  "score": 1008,
  "permalink": "/r/CryptoCurrency/comments/lhpojh/dont_worry_youre_still_early_wanna_know_why/",
  "subreddit": "CryptoCurrency",
  "id": "lhpojh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728615769
}