{
  "author": "Machinarae",
  "original_created_utc": 1628370029,
  "title": "Why do feminists support sex workers of various sorts, but shame people who use their services?",
  "created_utc": 1628414025,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>By sex workers I mean pornstars, camgirls, onlyfans, voluntary prostitutes (as those exist). If I wanted to learn about sex slavery and trafficking, I would&#39;ve asked about that. This is a question about a situation like in the Netherlands and the Amsterdam red light district, or professional escorts, not some Vietnamese underground sex dungeon for pedos. If you want to answer in regard to sex slavery and rape then this is not a thread for that. This is strictly about women who decide on their own to pursue that line of work, be it they want money or they like it.\nIf someone is raped, abused or forced to do things against their will, then it is 1000% deplorable. But I am not asking about those situations. Not about some lawless hellscape in some part of the world where people don&#39;t give a fuck about human rights, but a civilized business transaction between two consenting adults, consenting being the key word. No physical or psychological abuse on any side. I agree that there are numerous instances where sex workers are abused, but, to reiterate, we are talking about the, rare or not, instances where they used their free will to do those things without coercion. No pimps involved, just type of self employment.</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/p01aea/why_do_feminists_support_sex_workers_of_various/",
  "subreddit": "TooAfraidToAsk",
  "id": "p01aea",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "By sex workers I mean pornstars, camgirls, onlyfans, voluntary prostitutes (as\nthose exist). If I wanted to learn about sex slavery and trafficking, I would've\nasked about that. This is a question about a situation like in the Netherlands\nand the Amsterdam red light district, or professional…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "セックスワーカーとは、ポルノスター、カムガール、オンリーファン、自発的な売春婦（それらが存在する場合）を意味します。\nが存在します）。) もし私が性奴隷や人身売買について知りたいと思っていたら、そのことについて質問していたでしょう。\n尋ねたでしょう。これは、オランダのような状況についての質問です。\nアムステルダムの赤線地帯や、プロの...",
      "title": "なぜフェミニストは、様々な種類のセックスワーカーを支援する一方で、そのサービスを利用する人々を辱めるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我所说的性工作者指的是色情明星、凸轮女郎、Onlyfans、自愿卖淫者（因为存在这些人）。\n那些存在的）。) 如果我想了解性奴役和贩卖人口，我就会\n问这个问题。这是一个关于像荷兰的情况的问题\n和阿姆斯特丹红灯区的情况，或者是专业...",
      "title": "为什么女权主义者支持各种类型的性工作者，却对使用其服务的人感到羞耻？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我所說的性工作者指的是色情明星、凸輪女郎、Onlyfans、自願賣淫者（因爲存在這些人）。\n那些存在的）。) 如果我想了解性奴役和販賣人口，我就會\n問這個問題。這是一個關於像荷蘭的情況的問題\n和阿姆斯特丹紅燈區的情況，或者是專業...",
      "title": "爲什麼女權主義者支持各種類型的性工作者，卻對使用其服務的人感到羞恥？"
    }
  ]
}