{
  "author": "RevenantMedia",
  "original_created_utc": 1640042522,
  "title": "Do you ever not eat supper because the meal prep is too time consuming and you're already exhausted from work/life?",
  "created_utc": 1640069038,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My fridge and cupboards are fully stocked, so lack of food isn&amp;#39;t an issue. I could whip up a traditional U.S. Holiday meal tonight if I wanted too, but cooking supper is just too time consuming and right now I&amp;#39;m exhausted from a long day at work. I live alone, so its not like I have anyone else to feed but myself. Does anyone else just not eat sometimes because they don&amp;#39;t have the energy to cook?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/rl02iz/do_you_ever_not_eat_supper_because_the_meal_prep/",
  "subreddit": "NoStupidQuestions",
  "id": "rl02iz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My fridge and cupboards are fully stocked, so lack of food isn't an issue. I\ncould whip up a traditional U.S. Holiday meal tonight if I wanted too, but\ncooking supper is just too time consuming and right now I'm exhausted from a\nlong day at work. I live alone, so its not like I have anyone else to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "冷蔵庫や食器棚には十分な在庫があるので、食料の不足は問題ではありません。I\nその気になれば、今夜はアメリカの伝統的な休日料理を作ることも可能ですが\n夕食を作るのは時間がかかりすぎるし、今は仕事で疲れている。\n仕事で長い一日でした。私は一人暮らしなので、他に誰かがいるわけではありませんが......。",
      "title": "食事の準備に時間がかかり、仕事や生活ですでに疲れているからと、夕飯を食べないことはありませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的冰箱和橱柜都有充足的存货，所以缺乏食物不是问题。I\n如果我想的话，今晚可以做一顿传统的美国节日大餐，但是\n但做晚饭太费时间了，而且现在我已经从一天的工作中疲惫不堪。\n漫长的一天工作让我筋疲力尽。我一个人住，所以它不像我有其他人可以...",
      "title": "你是否曾经因为准备饭菜太耗时而不吃晚饭，而且你已经被工作/生活搞得筋疲力尽？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的冰箱和櫥櫃都有充足的存貨，所以缺乏食物不是問題。I\n如果我想的話，今晚可以做一頓傳統的美國節日大餐，但是\n但做晚飯太費時間了，而且現在我已經從一天的工作中疲憊不堪。\n漫長的一天工作讓我筋疲力盡。我一個人住，所以它不像我有其他人可以...",
      "title": "你是否曾經因爲準備飯菜太耗時而不喫晚飯，而且你已經被工作/生活搞得筋疲力盡？"
    }
  ]
}