{
  "author": "dazeechayn",
  "the_new_excerpt": "General After years of focus on alpha generation in the product. This makes you\ncompetitive in defense and industry.\n\n“We are an operating system for the modern enterprise.” What actions should\ninsights drive?\n\nOne of the biggest investment areas over the past few years has been modulation.\nProud…",
  "original_created_utc": 1611700786,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "一般经过多年的关注，在产品的α代。这让你\n在国防和工业领域的竞争力。\n\n\"我们是现代企业的操作系统\" 应该采取哪些行动\n洞察力驱动？\n\n过去几年最大的投资领域之一是调制。\n骄傲的是...",
      "title": "Palantir演示日：原始笔记和讨论"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "一般經過多年的關注，在產品的α代。這讓你\n在國防和工業領域的競爭力。\n\n\"我們是現代企業的操作系統\" 應該採取哪些行動\n洞察力驅動？\n\n過去幾年最大的投資領域之一是調製。\n驕傲的是...",
      "title": "Palantir演示日：原始筆記和討論"
    }
  ],
  "title": "Palantir demo day: raw notes and discussion",
  "created_utc": 1611716881,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>General\nAfter years of focus on alpha generation in the product. This makes you competitive in defense and industry. </p>\n\n<p>“We are an operating system for the modern enterprise.” What actions should insights drive?</p>\n\n<p>One of the biggest investment areas over the past few years has been modulation. Proud ourselves on end to end solutions. We learned how the conventional architecture broke down or didn’t work. This became encoded in the product. But customers had to take everything. Now, they can pick what they need only and build on that. </p>\n\n<p>Foundry\nBianca rahill-marier product leader everything above ontology</p>\n\n<p>Central decision support framework. </p>\n\n<p>Ontology and simulation engine: preserve local governance. Data from across organization maps to objects/categories which can flow from and back into enterprise apps/solutions. Example: identify surplus of raw materialism supply chain flagged and notify sales of the opportunity. The ontology and resulting actions train the engine/models which allow simulation or “what-if” scenarios. Can be based on AI or simple logic or both. Models are bound to real world inputs and outputs. As well models can be bound together in a chained scenario providing the ability to understand the impacts of real world situations to the entire supply chain. Ie. you can test market impacting decisions not just for your part of the supply chain but all the way to the consumer. \nWhat took months now takes hours:\nData integration: takes raw data from many systems, joins and featurizes. User defined and inferred table relationships are created. \nUse case catalog: templates for common industry use cases. Provide a foundation of the hard stuff and flex within the framework. \nRoadmap:\nReach more customers through use case catalog\nModularity: \nInteroperability with data platforms or build 3rd party apps on top of foundry as a data platform\nReach more users: new mobile offering and collaboration solutions\nMobile app for field workers to be given task plan prioritized and based on broad data inputs\nShared spaced with foundry for purpose built efforts. Highly controlled permissions. \nBuild on AI applied to operations:\nDigital twin: provide dev ops for applying and creating purpose built models that can be quickly deployed\nSimulation engine: chained models to ask what if scenarios’ impact on the entire supply chain</p>\n\n<p>Gotham\nMartin Manville product leader cut teeth fightng finance crimes</p>\n\n<p>Shifted from counter terrorism to the near peer fight. Old paradigm was what can you do? Now is what should you do?</p>\n\n<p>Understand\nMore data != better decisions\nFuses and augments data to produce cradle views or world both of The adversary and available resources of allies\nDecide\nLess time setting up the chess board and more time analyzing\nExplore options and model scenarios \nModels adapt with real time data\nAct\nDeployed at the edge. From aircraft carriers to UAV. Adapts as systems come off and on line\n“We build Ironman suits NOT robots”</p>\n\n<p>Apollo</p>\n\n<p>The silent 3rd platform. Manages end to end set of platform operations. </p>\n\n<p>Monitors performance and health of all Gotham and Foundry deployments. With synchronous and asynchronous telemetry. Allows continuous deployment and integration to be safe and secure.  </p>\n\n<p>Nearly all new customers have gone with the cloud version. </p>\n\n<p>Building Apollo to be infrastructure agnostic to allow multi cloud deployments and fast change between infrastructure provided either public or private. </p>\n\n<p>Ambitions to be worlds only saas provider for DoD level 6 security applications.</p>\n</div><!-- SC_ON -->",
  "score": 88,
  "permalink": "/r/stocks/comments/l5posr/palantir_demo_day_raw_notes_and_discussion/",
  "subreddit": "stocks",
  "id": "l5posr",
  "is_self": true,
  "media": null,
  "is_video": false
}