{
  "author": "ottolouis",
  "original_created_utc": 1638456337,
  "title": "How did George H.W. Bush manage to lose the 1992 election after the success of Desert Storm?",
  "created_utc": 1638472756,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Desert Storm is mostly forgotten at this point, but it really is one of the greatest triumphs in American history. The entire international community viewed Iraq&amp;#39;s invasion of Kuwait as illegitimate, and the US built a multi-nation coalition to oust Saddam&amp;#39;s forces. Everything followed international law: Iraq ignored multiple UN Security Council resolutions to leave Kuwait, and rejected peaceful solutions to the conflict. &lt;/p&gt;\n\n&lt;p&gt;And it wasn&amp;#39;t obvious that victory would be so easy. &lt;a href=\"https://foreignpolicy.com/2011/01/20/the-gulf-war-in-retrospect/\"&gt;People on both sides of the aisle opposed the invasion — Ted Kennedy and Patrick Buchanan, for example — and Kennedy predicted 3000 US casualties per week.&lt;/a&gt; Iraq had the 4th largest military in the world at that point, and it was very experienced after having fought a 10-year war against Iran. Nevertheless, when the coalition invaded, the fighting was over after about 100 hours, and around 100 US combatants were killed. There must&amp;#39;ve been widespread celebration.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://projects.fivethirtyeight.com/biden-approval-rating/\"&gt;When we look at historic approval ratings, it seems that Bush&amp;#39;s was at about 85% when Desert Storm happened, but by 1992, it had fallen below 50%.&lt;/a&gt; What happened? Why wasn&amp;#39;t Desert Storm a lasting political victory for Bush? Why did his approval fall so suddenly, and how did he wind up losing to Clinton in &amp;#39;92?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 110,
  "permalink": "/r/AskHistorians/comments/r78zxo/how_did_george_hw_bush_manage_to_lose_the_1992/",
  "subreddit": "AskHistorians",
  "id": "r78zxo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Desert Storm is mostly forgotten at this point, but it really is one of the\ngreatest triumphs in American history. The entire international community viewed\nIraq's invasion of Kuwait as illegitimate, and the US built a multi-nation\ncoalition to oust Saddam's forces. Everything followed…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "砂漠の嵐は、今ではほとんど忘れ去られていますが、本当に素晴らしい出来事でした。\nアメリカの歴史上、最も偉大な勝利です。国際社会全体が\nイラクのクウェート侵攻は非合法であり、アメリカは多国籍軍を構築した。\nサダム軍を追放するための連合。その後、すべてが...",
      "title": "砂漠の嵐」を成功させたジョージ・H・W・ブッシュは、なぜ1992年の選挙で負けてしまったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "沙漠风暴现在大多被遗忘，但它确实是美国历史上最伟大的胜利之一。\n美国历史上最伟大的胜利之一。整个国际社会都认为\n伊拉克对科威特的入侵是非法的，而美国建立了一个多国联盟来驱逐萨达姆的部队。\n美国建立了一个多国联盟来驱逐萨达姆的部队。一切都跟着...",
      "title": "乔治-H.W.布什是如何在 \"沙漠风暴 \"取得成功后，在1992年的选举中败北的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "沙漠風暴現在大多被遺忘，但它確實是美國曆史上最偉大的勝利之一。\n美國曆史上最偉大的勝利之一。整個國際社會都認爲\n伊拉克對科威特的入侵是非法的，而美國建立了一個多國聯盟來驅逐薩達姆的部隊。\n美國建立了一個多國聯盟來驅逐薩達姆的部隊。一切都跟着...",
      "title": "喬治-H.W.布什是如何在 \"沙漠風暴 \"取得成功後，在1992年的選舉中敗北的？"
    }
  ]
}