{
  "author": "OberynMartell94",
  "original_created_utc": 1643068074,
  "title": "My lovely bank cares so much about me (!)",
  "created_utc": 1643086547,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So my bank informed that I won&amp;#39;t be able to transfer funds to cryptocurrency exchanges because of  the elevated risks of fraud, loss, and volatility inherent in the cryptocurrency market.&lt;/p&gt;\n\n&lt;p&gt;I have had an account at this bank for about 15-16 years, my parents opened an account where I couldn&amp;#39;t touch the money until I am 18 years old. I am 28 now so I have been personally using this account for exactly 10 years.&lt;/p&gt;\n\n&lt;p&gt;I have been sports betting for 20 and playing poker for 15 years now. First through my father and his debit cards until I turned 18, and ever since then I have used my personal account to transfer money into various poker and sports betting sites.&lt;/p&gt;\n\n&lt;p&gt;For TEN YEARS these motherfuckers did not say a word and are still not saying anything about me losing maybe 5 figures on poker and football bets but now all of a sudden they are worried that I might lose a few hundred bucks at a volatile market. They were okay with me gambling when I was a barely legal teenager but God forbid I lose some money in the cryptomarket now that I am a grown man earning his own money.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 325,
  "permalink": "/r/CryptoCurrency/comments/sc0418/my_lovely_bank_cares_so_much_about_me/",
  "subreddit": "CryptoCurrency",
  "id": "sc0418",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So my bank informed that I won't be able to transfer funds to cryptocurrency\nexchanges because of the elevated risks of fraud, loss, and volatility inherent\nin the cryptocurrency market.\n\nI have had an account at this bank for about 15-16 years, my parents opened an\naccount where I couldn't touch…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そのため、私の銀行からは、暗号通貨への送金ができなくなるとの連絡がありました。\n取引所では、詐欺、損失、ボラティリティのリスクが高まっているためです。\n暗号通貨市場の\n\n私はこの銀行に15～16年ほど前から口座を持ち、親が開設した\nの口座は、私が手を出せないところ...。",
      "title": "素敵な銀行が私のことをとても大切にしてくれている（！？）"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，我的银行通知我，我将不能将资金转移到加密货币\n交易所，因为加密货币市场固有的欺诈、损失和波动的风险提高了\n加密货币市场中的欺诈、损失和波动风险升高。\n\n我在这家银行有一个大约15-16年的账户，我父母开了一个\n帐户，我不能碰...",
      "title": "我可爱的银行如此关心我（！）。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，我的銀行通知我，我將不能將資金轉移到加密貨幣\n交易所，因爲加密貨幣市場固有的欺詐、損失和波動的風險提高了\n加密貨幣市場中的欺詐、損失和波動風險升高。\n\n我在這家銀行有一個大約15-16年的賬戶，我父母開了一個\n帳戶，我不能碰...",
      "title": "我可愛的銀行如此關心我（！）。"
    }
  ]
}