{
  "author": "Soulsiick",
  "the_new_excerpt": "My wooden Moon coin !\n[https://preview.redd.it/zgzse5yubgl61.jpg?width=3456&format=pjpg&auto=webp&s=30feaee398e138649e2359f20ebec910134ec87d]\n\nA short rant:\n\nAt first I posted this as an image, but it got deleted immediately because it\nseems media posts are now considered \"low effort\". While by no…",
  "original_created_utc": 1615062863,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我的木制月亮币 !\n[https://preview.redd.it/zgzse5yubgl61.jpg?width=3456&format=pjpg&auto=webp&s=30feaee398e138649e2359f20ebec910134ec87d]\n\n短暂的唠叨。\n\n起初，我把这个作为图片发布， 但它被立即删除，因为它是\n似乎媒体帖子现在被认为是 \"低努力\"。虽然没有...",
      "title": "我给自己做了一个月亮币，这样我就不会错过了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的木製月亮幣 !\n[https://preview.redd.it/zgzse5yubgl61.jpg?width=3456&format=pjpg&auto=webp&s=30feaee398e138649e2359f20ebec910134ec87d]\n\n短暫的嘮叨。\n\n起初，我把這個作爲圖片發佈， 但它被立即刪除，因爲它是\n似乎媒體帖子現在被認爲是 \"低努力\"。雖然沒有...",
      "title": "我給自己做了一個月亮幣，這樣我就不會錯過了。"
    }
  ],
  "title": "I made myself a Moon coin so I don't miss out.",
  "created_utc": 1615113038,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/zgzse5yubgl61.jpg?width=3456&amp;format=pjpg&amp;auto=webp&amp;s=30feaee398e138649e2359f20ebec910134ec87d\">My wooden Moon coin !</a></p>\n\n<p>A short rant: </p>\n\n<p>At first I posted this as an image, but it got deleted immediately because it seems media posts are now considered &quot;low effort&quot;. While by no means I am against a more informative and technical subreddit, and actually think current state of subreddit is significantly better than a weak ago, at the same time there are many people who does not have technical knowledge or even any meaningful investment in cryptocurrencies, but still like to be a part of this community. </p>\n\n<p>I might be new to the whole cryptocurrency world, and I might not have the means or the capital to invest in crypto, but I am enthusiastic about the concept and I like to be a part of its community. If the crypto community hopes for democracy, de-centralization and collective mindset as its core values and the solution to the problem that we already have, it should be able to find a way to include everybody, otherwise it will slowly fall into the same elitist mindset that it does not like.</p>\n\n<p>Anyway, I just wanted to say this image is by no means a &quot;low effort&quot; post, I spend hours for it.</p>\n</div><!-- SC_ON -->",
  "score": 177,
  "permalink": "/r/CryptoCurrency/comments/lzagxq/i_made_myself_a_moon_coin_so_i_dont_miss_out/",
  "subreddit": "CryptoCurrency",
  "id": "lzagxq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542572113
}