{
  "author": "rrdonoo",
  "the_new_excerpt": "I sent a transaction with BTC and it costed me $60. And the gas fee for ETH is\nout of control as well.\n\nBTC and ETH are the faces of crypto, they basically dictate the entire market\nmovement. Yet they are not even remotely useful as a cryptocurrency to do p2p. I\nget the whole store of value notion,…",
  "original_created_utc": 1619278961,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "BTCでトランザクションを送ったら、60ドルかかった。また、ETHのガス料金は\nも制御不能です。\n\nBTCとETHは暗号の顔であり、基本的に市場全体の動きを左右します。\n動きをしています。しかし、P2Pを行うための暗号通貨としては全く役に立ちません。I\n価値の保存という考え方もありますが...。",
      "title": "暴言】残念ですが、今のBTCとETHはかなり使えません"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我用BTC发送了一笔交易，花费了60美元。而ETH的加油费也是\n也失去了控制。\n\nBTC和ETH是加密货币的代言人，它们基本上决定了整个市场的发展。\n运动。然而，作为做P2P的加密货币，它们甚至没有一点用处。I\n我明白整个价值储存的概念，...",
      "title": "[咆哮]我很抱歉，但BTC和ETH现在基本无法使用了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我用BTC發送了一筆交易，花費了60美元。而ETH的加油費也是\n也失去了控制。\n\nBTC和ETH是加密貨幣的代言人，它們基本上決定了整個市場的發展。\n運動。然而，作爲做P2P的加密貨幣，它們甚至沒有一點用處。I\n我明白整個價值儲存的概念，...",
      "title": "[咆哮]我很抱歉，但BTC和ETH現在基本無法使用了"
    }
  ],
  "title": "[Rant] I am sorry but BTC and ETH is pretty much unusable right now",
  "created_utc": 1619300849,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I sent a transaction with BTC and it costed me $60. And the gas fee for ETH is out of control as well.</p>\n\n<p>BTC and ETH are the faces of crypto, they basically dictate the entire market movement. Yet they are not even remotely useful as a cryptocurrency to do p2p. I get the whole store of value notion, but this is the complete antithesis of the world of crypto that it was designed to be.</p>\n\n<p>I know people say Lightning will solve this and ETH 2.0 will move to PoS. Neither is a certainty and who knows how long it will until full adoption if all things worked out perfectly as intended.</p>\n\n<p>I truly hope some of these other alts will have greater adoption and weaken the pull that these two have.</p>\n</div><!-- SC_ON -->",
  "score": 457,
  "permalink": "/r/CryptoCurrency/comments/mxmgn5/rant_i_am_sorry_but_btc_and_eth_is_pretty_much/",
  "subreddit": "CryptoCurrency",
  "id": "mxmgn5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776208817
}