{
  "author": "Mooney-Aviator",
  "the_new_excerpt": "Goldman Sachs and Morgan Stanley have reportedly sold $19 billion worth of\nshares in Chinese tech and US media companies. Traders are now wondering what\ncaused the unusually massive move and whether it will continue next week.\n\nGoldman Sachs alone liquidated $10.5 billion worth of stocks in block…",
  "original_created_utc": 1616953160,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "据报道，高盛和摩根士丹利已经出售了价值190亿美元的。\n中国科技公司和美国媒体公司的股票。交易员们现在想知道的是\n导致异常巨大的举动，以及下周是否会继续。\n\n仅高盛就清算了价值105亿美元的股票，在块...",
      "title": "WAHT'S GOING ON? 华尔街银行在 \"史无前例 \"的大宗交易中抛售190亿美元的股票--媒体"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "據報道，高盛和摩根士丹利已經出售了價值190億美元的。\n中國科技公司和美國媒體公司的股票。交易員們現在想知道的是\n導致異常巨大的舉動，以及下週是否會繼續。\n\n僅高盛就清算了價值105億美元的股票，在塊...",
      "title": "WAHT'S GOING ON? 華爾街銀行在 \"史無前例 \"的大宗交易中拋售190億美元的股票--媒體"
    }
  ],
  "title": "WAHT'S GOING ON?? Wall Street banks ditch $19 billion of stocks in ‘unprecedented’ block trade selloff – media",
  "created_utc": 1616964333,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Goldman Sachs and Morgan Stanley have reportedly sold $19 billion worth of shares in Chinese tech and US media companies. Traders are now wondering what caused the unusually massive move and whether it will continue next week.</p>\n\n<p>Goldman Sachs alone liquidated $10.5 billion worth of stocks in block trades on Friday, Bloomberg reported citing the investment bank’s email to clients. The first batch, that included $6.6 billion worth of shares of Baidu, Tencent Music Entertainment Group and Vipshop Holdings, was sold before the market opened on Friday. Later that day, the bank reportedly managed the sale of $3.9 billion worth of shares in American media conglomerates ViacomCBS and Discovery, as well some other companies, such as Farfetch, iQiyi and GSX Techedu. </p>\n\n<p>Another US investment bank involved in the block trades, which are believed to have wiped $35 billion off affected firms’ valuations in just one day, was Morgan Stanley. The investment bank offered two batches of shares worth $4 billion each on Friday, according to the Financial Times. \nWhile block trades, when sellers are looking for buyers for large volumes of securities at a price sometimes negotiated privately between the two parties, are a common thing, the scale of Friday’s moves raised eyebrows. </p>\n\n<p>Continue...</p>\n\n<p>“I’ve never seen something of this magnitude in my 25-year career,” portfolio manager at Swiss-based Bellevue Asset Management AG, Michel Keusch, told Bloomberg. \nSenior vice president at Wealthspire Advisors, Oliver Pursche, called the move “highly unusual,” adding that the market participants are now wondering if another wave of block trades could hit the market on Monday and Tuesday, causing wild price swings in the affected stocks.\nAnother issue is the unclear nature of those trades. Goldman Sachs explained the sales with “forced deleveraging,” the Financial Times wrote citing people with knowledge of the matter. The outlet also said that the move could indicate that a big hedge fund or family office faced some serious problems. \nMeanwhile, CNBC reported the selling pressure in some US media and Chinese stocks was linked to the forced liquidation of positions held by family investment office Archegos Capital Management. The lack of details about the move makes the situation worrisome, Pursche said, as investors don’t know “whether this was the liquidation of just one fund or more than a fund, or whether it was a fund liquidation to begin with and the reason behind it.”</p>\n</div><!-- SC_ON -->",
  "score": 191,
  "permalink": "/r/stocks/comments/mf5os6/wahts_going_on_wall_street_banks_ditch_19_billion/",
  "subreddit": "stocks",
  "id": "mf5os6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357142646
}