{
  "author": "AgeVisible5214",
  "original_created_utc": 1656516671,
  "title": "do I really love my gf if think about other girls (sexually)?",
  "created_utc": 1656561851,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have an almost 1-year relationship. I really think I found the perfect girl, the girl of my dreams. In the first 3 months of the relationship i was 100% all about her, but after that, somehow, i started observing other girls around, how they look, talk and what they wear, and i kinda liked it. I also started talking to some girls, but not pursuing anything, just casual talk. But, I repeat, i really love my gf, or do I?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/vnij17/do_i_really_love_my_gf_if_think_about_other_girls/",
  "subreddit": "TooAfraidToAsk",
  "id": "vnij17",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I have an almost 1-year relationship. I really think I found the perfect girl,\nthe girl of my dreams. In the first 3 months of the relationship i was 100% all\nabout her, but after that, somehow, i started observing other girls around, how\nthey look, talk and what they wear, and i kinda liked it. I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もうすぐ交際1年になります。本当に完璧な女性を見つけたと思う。\n夢のような女性だ。付き合い始めて最初の3ヶ月は100％彼女一筋だった。\nしかし、その後、どういうわけか、周りの他の女の子を観察するようになった。\n彼女たちがどう見えるか、どう話すか、何を着るか、それを観察するようになった。I...",
      "title": "他の女の子のことを（性的な意味で）考えている場合、私は本当に彼女を愛しているのだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我有一个近1年的关系。我真的认为我找到了一个完美的女孩。\n我梦想中的女孩。在这段关系的前3个月，我是100%的全\n但在那之后，不知怎的，我开始观察周围的其他女孩，观察她们的长相、谈吐和行为。\n他们的样子、说话和穿着，我有点喜欢。I...",
      "title": "如果我考虑其他女孩（性），我真的爱我的女朋友吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我有一個近1年的關係。我真的認爲我找到了一個完美的女孩。\n我夢想中的女孩。在這段關係的前3個月，我是100%的全\n但在那之後，不知怎的，我開始觀察周圍的其他女孩，觀察她們的長相、談吐和行爲。\n他們的樣子、說話和穿着，我有點喜歡。I...",
      "title": "如果我考慮其他女孩（性），我真的愛我的女朋友嗎？"
    }
  ]
}