{
  "author": "SameThingHappened2Me",
  "the_new_excerpt": "I get it. When you invest, you probably invest to make money. That's the goal\nand usually the only goal. But it's worth considering that you're not just\nmaking money off a particular project, you're also supporting the particular\nvision that project entails. If you're a decent person, there's a line…",
  "original_created_utc": 1620579906,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はそれを理解しています。あなたが投資をするとき、おそらくお金を稼ぐために投資をするでしょう。それが目的であり\nそれが唯一の目的だと思います。しかし、特定のプロジェクトでお金を稼ぐだけでなく、そのプロジェクトを支援しているということを考える価値があります。\n特定のプロジェクトでお金を稼ぐだけでなく、そのプロジェクトに付随する特定のビジョンを支援していると考えるべきです。\n考えてみる価値があります。もしあなたがまともな人間なら、一線を画すことになるでしょう...。",
      "title": "BNBとBinance Smart ChainがETHへの攻撃であり、分散型スマートコントラクトの未来への攻撃であることを毎日のように思い出させてくれます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我明白了。当你投资时，你可能是为了赚钱而投资。这就是目标\n而且通常是唯一的目标。但值得考虑的是，你不仅仅是在为一个特定的项目赚钱，你还在支持特定的项目。\n从一个特定的项目中赚钱，你也在支持该项目所涉及的特定的\n该项目所带来的愿景。如果你是一个正直的人，有一条线...",
      "title": "你的每日提醒：BNB和Binance智能链是对ETH的攻击，是对去中心化智能合约未来的攻击。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我明白了。當你投資時，你可能是爲了賺錢而投資。這就是目標\n而且通常是唯一的目標。但值得考慮的是，你不僅僅是在爲一個特定的項目賺錢，你還在支持特定的項目。\n從一個特定的項目中賺錢，你也在支持該項目所涉及的特定的\n該項目所帶來的願景。如果你是一個正直的人，有一條線...",
      "title": "你的每日提醒：BNB和Binance智能鏈是對ETH的攻擊，是對去中心化智能合約未來的攻擊。"
    }
  ],
  "title": "Your Daily Reminder that BNB and the Binance Smart Chain Is an Attack on ETH and an Attack on a Decentralized Smart Contract Future.",
  "created_utc": 1620639099,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I get it.  When you invest, you probably invest to make money.  That&#39;s the goal and usually the only goal.  But it&#39;s worth considering that you&#39;re not just making money off a particular project, you&#39;re also supporting the particular vision that project entails.  If you&#39;re a decent person, there&#39;s a line you (hopefully) wouldn&#39;t cross.  If there were a tokenized version of child sex-trafficking, one would hope you wouldn&#39;t invest in it even if it were a growing market.  But the examples don&#39;t have to be that extreme: if you&#39;re an environmentalist, you probably shouldn&#39;t be buying big oil companies like ExxonMobil.</p>\n\n<p>So let&#39;s remember what the Binance Smart Chain is in relation to Ethereum.  Ethereum introduced the world to the idea of a decentralized open-sourced smart-contract platform, a World&#39;s Computer.   As Vitalik put it:</p>\n\n<blockquote>\n<p>Whereas most technologies tend to automate workers on the periphery doing menial tasks, blockchains automate away the center. Instead of putting the taxi driver out of a job, blockchain puts <strong>Uber</strong> out of a job and lets the taxi drivers work with the customer directly.</p>\n</blockquote>\n\n<p>We&#39;re not there yet obviously, but the promise of a future built on smart contracts is there.  So that brings us to the Binance Smart Chain.  What is it?</p>\n\n<p>The Binance Smart Chain (BSC) is just a copy-paste of Ethereum with the tweak that they ditched decentralization.  That&#39;s it.  Founded in China, moved to the Cayman Islands, their founder and CEO regularly shit-talks Ethereum, holds no ether, but openly-plagiarized their work to launch it. </p>\n\n<p>The key difference between the Binance Smart Chain and Ethereum is governance.  On BSC, 11 validator nodes are responsible for governance.  They&#39;re already selected.  We don&#39;t know precisely their ties to Binance, but they behave in a coordinated manner.  (E.g., they rotate producing blocks in a seemingly predefined order despite their being no stake-weighted mechanism to determine which produces the next block.) </p>\n\n<p>By contrast, governance on Ethereum&#39;s Beacon Chain is handled by the over <a href=\"https://www.beaconcha.in/\">133,000 validators</a> staking.  The number is rapidly rising and anyone with the (admittedly significant) funds can join.</p>\n\n<p>And to be clear, I&#39;m all for competition.  Cardano, for example, appears to be a genuine effort to compete.  BSC is a pure centralized attempt to undermine.</p>\n\n<p>TL;DR - Consider Ditching BNB and BEP-20 tokens.</p>\n</div><!-- SC_ON -->",
  "score": 163,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/VxonNMrBIkUuMxbnC8KswxDZ2wEq3P0266aomwJ3z8E.jpg?auto=webp&s=1e3caae340138cb28b85215ddf97f860cd0f63b2",
          "width": 1024,
          "height": 1024
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/VxonNMrBIkUuMxbnC8KswxDZ2wEq3P0266aomwJ3z8E.jpg?width=108&crop=smart&auto=webp&s=6ebd86bc0634d71b2b9a3939cc1e7c48683f4b1e",
            "width": 108,
            "height": 108
          },
          {
            "url": "https://external-preview.redd.it/VxonNMrBIkUuMxbnC8KswxDZ2wEq3P0266aomwJ3z8E.jpg?width=216&crop=smart&auto=webp&s=56993a6a10442a142a026ceedf642eaaad1fbcf0",
            "width": 216,
            "height": 216
          },
          {
            "url": "https://external-preview.redd.it/VxonNMrBIkUuMxbnC8KswxDZ2wEq3P0266aomwJ3z8E.jpg?width=320&crop=smart&auto=webp&s=97c5a5048822499e1832d6a6cacc535b6fc3742e",
            "width": 320,
            "height": 320
          },
          {
            "url": "https://external-preview.redd.it/VxonNMrBIkUuMxbnC8KswxDZ2wEq3P0266aomwJ3z8E.jpg?width=640&crop=smart&auto=webp&s=8d4afd35c59957dd2c80c051b3f757d13ce2968f",
            "width": 640,
            "height": 640
          },
          {
            "url": "https://external-preview.redd.it/VxonNMrBIkUuMxbnC8KswxDZ2wEq3P0266aomwJ3z8E.jpg?width=960&crop=smart&auto=webp&s=09e1c2f002859dcac5162eb4b2c5ac23527dc73b",
            "width": 960,
            "height": 960
          }
        ],
        "variants": {},
        "id": "jM0AlR2vEFNvH9CArNFMgLWy0W7Ocw4dPZxQgd4Ia0Y"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/n8ihjo/your_daily_reminder_that_bnb_and_the_binance/",
  "subreddit": "CryptoCurrency",
  "id": "n8ihjo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985990909
}