{
  "author": "moneytobemade8",
  "the_new_excerpt": "One of the best ways to reduce your risk is by diversification. This can usually\nbe done by holding many stocks in different industries or more simply holding an\nindex. Let me explain why.\n\nThere are two kinds of risks. One is systematic risk and the other is\nnon-systematic risk. We can eliminate…",
  "original_created_utc": 1614967019,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "降低风险的最好方法之一就是分散投资。这通常可以\n可以通过持有不同行业的多只股票来实现，或者更简单地持有一只。\n指数。让我解释一下原因。\n\n风险有两种。一种是系统性风险，另一种是\n非系统性风险。我们可以消除...",
      "title": "通过分散投资降低风险"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "降低風險的最好方法之一就是分散投資。這通常可以\n可以通過持有不同行業的多隻股票來實現，或者更簡單地持有一隻。\n指數。讓我解釋一下原因。\n\n風險有兩種。一種是系統性風險，另一種是\n非系統性風險。我們可以消除...",
      "title": "通過分散投資降低風險"
    }
  ],
  "title": "Reducing Your Risk By Diversification",
  "created_utc": 1615015668,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>One of the best ways to reduce your risk is by diversification. This can usually be done by holding many stocks in different industries or more simply holding an index. Let me explain why.</p>\n\n<p>There are two kinds of risks. One is systematic risk and the other is non-systematic risk. We can eliminate non-systematic risk through diversification, but not systematic risk. Systematic risk is also called market risk which means it impacts the whole market. For example, this could be due to a hike in interest rates, Treasury Yields rising and etc. This impacts the whole market and cannot be diversified.</p>\n\n<p>However, there is also called non-systematic risk. This is a firm-specific or industry-specific risk. For example, if a company has a product recall, the risk is only for that specific company and not other companies. An industry-specific risk is if the whole industry is shaken by something only impacting that industry. For example, we saw this with oil prices a year ago. Oil companies went down, but other companies weren&#39;t specifically down.</p>\n\n<p>Why does this matter and how does it relate to risk. Well, we can eliminate all non-systematic risk by holding a diversified portfolio. The reason for this is because many stocks won&#39;t be as correlated with one another, which means that any really bad gains can be offset by any really good gains and vice versa. Theoretically, You won&#39;t be exposed to non-systematic risk since you are eliminating it by holding a diversified portfolio. The only risk you have is systematic risk (market risk). Theoretically, we are not compensated by non-systematic risk since it is a risk we can diversify.</p>\n\n<p>Just keep in mind that when you buy industry-specific ETF&#39;s or if your portfolio is concentrated in one sector, you are exposing yourself to more risk than necessary.</p>\n</div><!-- SC_ON -->",
  "score": 62,
  "permalink": "/r/investing/comments/lyhqyg/reducing_your_risk_by_diversification/",
  "subreddit": "investing",
  "id": "lyhqyg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542574787
}