{
  "author": "PieWare",
  "original_created_utc": 1639145769,
  "title": "How can you estimate the temperature of an arc discharge in air generated through high-frequency AC?",
  "created_utc": 1639163298,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi everyone. I&amp;#39;m wondering if it is possible or if there are methods to estimate the temperature of a plasma generated from an high-frequency arc discharge in air, like arcs generated from an arc lighter. &lt;/p&gt;\n\n&lt;p&gt;Would it be dependant on the frequency, the distance between the electrodes or other things? The closest thing I found is related to the concept of electron temperature, but I haven&amp;#39;t found any clear way to compute it.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Thanks for your help and have a nice day!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/askscience/comments/rd9ldz/how_can_you_estimate_the_temperature_of_an_arc/",
  "subreddit": "askscience",
  "id": "rd9ldz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi everyone. I'm wondering if it is possible or if there are methods to estimate\nthe temperature of a plasma generated from an high-frequency arc discharge in\nair, like arcs generated from an arc lighter.\n\nWould it be dependant on the frequency, the distance between the electrodes or\nother things?…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。私は、次のようなことが可能か、または方法があるかどうか知りたいと思っています。\n高周波アーク放電から発生するプラズマの温度について\nアークライターから発生するアークのような、空気中の\n\n周波数や電極間の距離などに依存するのでしょうか？\nなどなど...。",
      "title": "高周波交流で発生した空気中のアーク放電の温度を推定するには？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。我想知道是否有可能或是否有方法来估计\n在空气中的高频电弧放电产生的等离子体的温度。\n空气中的高频电弧放电产生的等离子体，如打火机产生的电弧。\n\n它是否取决于频率、电极之间的距离或其他因素？\n其他因素？",
      "title": "你如何估计通过高频交流产生的空气中的电弧放电的温度？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。我想知道是否有可能或是否有方法來估計\n在空氣中的高頻電弧放電產生的等離子體的溫度。\n空氣中的高頻電弧放電產生的等離子體，如打火機產生的電弧。\n\n它是否取決於頻率、電極之間的距離或其他因素？\n其他因素？",
      "title": "你如何估計通過高頻交流產生的空氣中的電弧放電的溫度？"
    }
  ]
}