{
  "approved_at_utc": null,
  "subreddit": "investing",
  "selftext": " \n\nHere is a couple of stocks that might be worth your attention this week. This is part 2 of 2.\n\nThis is not a sponsored content. I'm just sharing my thoughts with you, hoping you're going to enjoy it.\n\nThis  short list was compiled with help of various sources of data, including  Buy recommendations from several renowned stock data providers and  analytical services. This is why I’m calling the approach a **consensus strategy.**  The stocks I’m going to present you below are generally believed to  outperform the stock market in the coming months, they have a consensus  recommendation of Buy, their fundamentals are scored considerably better  than most stocks and their average target price by stock analysts is  above current market valuation.\n\nIn order to consider buying the stock’s shares, the following criteria need to be satisfied:\n\n* **TheStreet score**: A+, A or A-\n* **Zacks Rank**: 1 (Strong Buy), 2 (Buy) or 3      (Hold)\n* **Weiss Ratings recommendation**: A or B\n* **Yahoo Finance recommendation**: at least mixed Buy/Hold\n* **MarketBeat recommendation**: at least mixed Buy/Hold\n* **Yahoo Finance target price**: min. 5% higher than current      price\n* **MarketBeat target price**: min. 5% higher than current      price\n* **Piotroski F-Score**: min. 4\n* **Moody’s Daily Credit Risk**: 1 to 6\n* **InvestorsObserver Overall Score**: min. 50\n\n**Note**: Descriptions of those criteria are provided at the end of this post.\n\nIf  you decide to buy any of the below stocks, you might want to consider  the following selling conditions (at least one of them should be  satisfied):\n\n* price is higher or close to      target\n* profit is in range 20% – 30%\n* loss is higher than 50%\n* TheStreet recommendation is      changed to Sell\n* Weiss Ratings recommendation is      changed to Sell\n* Yahoo Finance recommendation is      changed to Sell\n\n**Let’s now take a look at the stocks I’ve identified with this strategy today.**\n\n&#x200B;\n\n**FIRST AMERICAN FINANCIAL CP (FAF)**\n\n**Sector**: Finance  \n**Industry**: Specialty Insurance  \n**Description**:  First American Financial Corp. operates as an insurance company. It  provides title insurance and settlement services to the real estate and  mortgage industries. The company operates its business through the  following segments: Title Insurance \\&amp; Services and Specialty  Insurance. First American Financial was founded in January, 2008 and is  headquartered in Santa Ana, CA.  \n**Dividend**:  First American Financial pays an annual dividend of $1.84 per share,  with a dividend yield of 2.69%. FAF’s most recent quarterly dividend  payment was made to shareholders of record on Tuesday, June 15. The  company has grown its dividend for the last 1 consecutive years and is  increasing its dividend by an average of 7.32% each year. First American  Financial pays out 33.76% of its earnings out as a dividend.  \n**Current valuation**: $64.85\n\n**Valuation of entry parameters:**\n\nTheStreet score: A-  \nZacks Rank: Hold  \nWeiss Ratings recommendation: Buy  \nYahoo Finance recommendation: Buy/Hold  \nMarketBeat recommendation: Buy  \nYahoo Finance target price: $74.8  \nMarketBeat target price: $73.00  \nPiotroski F-Score: 8  \nMoody’s Daily Credit Risk: 4  \nInvestorsObserver Overall Score: 52  \nYahoo Finance 1 year change: 15.34%\n\n&#x200B;\n\n**FACEBOOK INC (FB)**\n\n**Sector**: Technology Services  \n**Industry**: Internet Software/Services  \n**Description**:  Facebook, Inc. is focused on building products that enable people to  connect and share through mobile devices, personal computers and other  surfaces. The Company’s products include Facebook, Instagram, Messenger,  WhatsApp and Oculus. Facebook enables people to connect, share,  discover and communicate with each other on mobile devices and personal  computers. Instagram enables people to take photos or videos, customize  them with filter effects, and share them with friends and followers in a  photo feed or send them directly to friends. Messenger allows  communicating with people and businesses alike across a range of  platforms and devices. WhatsApp Messenger is a messaging application  that is used by people around the world and is available on a range of  mobile platforms. Its Oculus virtual reality technology and content  platform offers products that allow people to enter an interactive  environment to play games, consume content and connect with others.  \n**Dividend**: NA  \n**Current valuation**: $360.33\n\n**Valuation of entry parameters:**\n\nTheStreet score: A-  \nZacks Rank: Hold  \nWeiss Ratings recommendation: Buy  \nYahoo Finance recommendation: Buy  \nMarketBeat recommendation: Buy  \nYahoo Finance target price: $386.47  \nMarketBeat target price: $402.76  \nPiotroski F-Score: 7  \nMoody’s Daily Credit Risk: 1  \nInvestorsObserver Overall Score: 79  \nYahoo Finance 1 year change: 7.33%\n\n&#x200B;\n\n**FEDERAL SIGNAL CORP (FSS)**\n\n**Sector**: Producer Manufacturing  \n**Industry**: Trucks/Construction/Farm Machinery  \n**Description**:  Federal Signal Corp. engages in the designed manufacture of products  and integrated solutions for municipal, governmental, industrial, and  commercial customers. It operates through the Environmental Solutions  Group and Safety and Security Systems Group segments. The company was  founded in 1901 and is headquartered in Oak Brook, IL.  \n**Dividend**:  Federal Signal pays an annual dividend of $0.36 per share, with a  dividend yield of 0.90%. FSS’s next quarterly dividend payment will be  made to shareholders of record on Wednesday, September 1. The company  has grown its dividend for the last 1 consecutive years and is  increasing its dividend by an average of 4.55% each year. Federal Signal  pays out 21.56% of its earnings out as a dividend.  \n**Current valuation**: $39.81\n\n**Valuation of entry parameters:**\n\nTheStreet score: A-  \nZacks Rank: Hold  \nWeiss Ratings recommendation: Buy  \nYahoo Finance recommendation: Buy  \nMarketBeat recommendation: Buy  \nYahoo Finance target price: $45.33  \nMarketBeat target price: $44.00  \nPiotroski F-Score: 4  \nMoody’s Daily Credit Risk: 6  \nInvestorsObserver Overall Score: 56  \nYahoo Finance 1 year change: 13.87%\n\n&#x200B;\n\n**GAMING & LEISURE PPTYS (GLPI)**\n\n**Sector**: Finance  \n**Industry**: Real Estate Investment Trusts  \n**Description**:  Gaming & Leisure Properties, Inc. is engaged in acquiring,  financing, and owning real estate property to be leased to gaming  operators in triple net lease arrangements. It operates through the GLP  Capital and TRS Properties segments. The GLP Capital segment consists of  the leased real property and represents the majority of business. The  TRS Properties segment includes Hollywood Casino Perryville and  Hollywood Casino Baton Rouge. The company was founded on February 13,  2013 and is headquartered in Wyomissing, PA.  \n**Dividend**:  Gaming and Leisure Properties pays an annual dividend of $2.68 per  share, with a dividend yield of 5.56%. GLPI’s most recent quarterly  dividend payment was made to shareholders of record on Friday, June 25.  Gaming and Leisure Properties pays out 77.68% of its earnings out as a  dividend.  \n**Current valuation**: $47.86\n\n**Valuation of entry parameters:**\n\nTheStreet score: A-  \nZacks Rank: Buy  \nWeiss Ratings recommendation: Buy  \nYahoo Finance recommendation: Buy/Hold  \nMarketBeat recommendation: Buy  \nYahoo Finance target price: $51.08  \nMarketBeat target price: $50.25  \nPiotroski F-Score: 7  \nMoody’s Daily Credit Risk: 4  \nInvestorsObserver Overall Score: 60  \nYahoo Finance 1 year change: 6.73%\n\n&#x200B;\n\n**HAWKINS INC (HWKN)**\n\n**Sector**: Distribution Services  \n**Industry**: Wholesale Distributors  \n**Description**:  Hawkins, Inc. engaged in the distribution, blending, and manufacture of  chemicals and specialty ingredients for a wide variety of industries.  It operates through the following segments: Industrial, Water Treatment,  and Health and Nutrition. The company was founded by Howard Hawkins in  1938 and is headquartered in Roseville, MN.  \n**Dividend**:  Hawkins pays an annual dividend of $0.49 per share, with a dividend  yield of 1.33%. HWKN’s next quarterly dividend payment will be made to  shareholders of record on Friday, August 27. The company has grown its  dividend for the last 1 consecutive years and is increasing its dividend  by an average of 2.64% each year. Hawkins pays out 25.39% of its  earnings out as a dividend.  \n**Current valuation**: $36.80\n\n**Valuation of entry parameters:**\n\nTheStreet score: A  \nZacks Rank: Buy  \nWeiss Ratings recommendation: Buy  \nYahoo Finance recommendation: Buy  \nMarketBeat recommendation: Buy  \nYahoo Finance target price: $44.0  \nMarketBeat target price: $44.00  \nPiotroski F-Score: 8  \nMoody’s Daily Credit Risk: 6  \nInvestorsObserver Overall Score: 51  \nYahoo Finance 1 year change: 137.84%\n\n&#x200B;\n\n**ICON PLC (ICLR)**\n\n**Sector**: Health Technology  \n**Industry**: Pharmaceuticals: Other  \n**Description**:  ICON plc operates as a clinical research organization, which engages in  the provision of outsourced development services to the pharmaceutical,  biotechnology, and medical device industries. It specializes in the  strategic development, management and analysis of programs that support  clinical development. The company was founded by John Climax and Ronan  Lambe in June 1990 and is headquartered in Dublin, Ireland.  \n**Dividend**: NA  \n**Current valuation**: $235.92\n\n**Valuation of entry parameters:**\n\nTheStreet score: A-  \nZacks Rank: Buy  \nWeiss Ratings recommendation: Buy  \nYahoo Finance recommendation: Buy  \nMarketBeat recommendation: Buy  \nYahoo Finance target price: $251.42  \nMarketBeat target price: $251.00  \nPiotroski F-Score: 6  \nMoody’s Daily Credit Risk: 2  \nInvestorsObserver Overall Score: 80  \nYahoo Finance 1 year change: 6.57%\n\n&#x200B;\n\n**IDEX CORP (IEX)**\n\n**Sector**: Finance  \n**Industry**: Investment Banks/Brokers  \n**Description**:  Indian Energy Exchange Ltd. Engages in power exchange business and  provides an automated platform for trading of electricity and related  products. It enables trading and price discovery of electricity and  related products with risk management for participants of the  electricity market. The firm’s products include day-ahead-market (DAM)  electricity contracts, term-ahead-market (TAM) electricity contract,  Renewable Energy Certificates (REC) and Energy Saving Certificates. The  company was founded on March 26, 2007 and is headquartered in Noida,  India.  \n**Dividend**:  IDEX pays an annual dividend of $2.16 per share, with a dividend yield  of 0.95%. IEX’s most recent quarterly dividend payment was made to  shareholders of record on Friday, July 30. The company has grown its  dividend for the last 1 consecutive years and is increasing its dividend  by an average of 11.31% each year. IDEX pays out 41.62% of its earnings  out as a dividend.  \n**Current valuation**: $227.11\n\n**Valuation of entry parameters:**\n\nTheStreet score: A-  \nZacks Rank: Buy  \nWeiss Ratings recommendation: Buy  \nYahoo Finance recommendation: Buy/Hold  \nMarketBeat recommendation: Buy  \nYahoo Finance target price: $242.25  \nMarketBeat target price: $239.50  \nPiotroski F-Score: 5  \nMoody’s Daily Credit Risk: 2  \nInvestorsObserver Overall Score: 69  \nYahoo Finance 1 year change: 6.61%\n\n&#x200B;\n\n**JOHNSON & JOHNSON (JNJ)**\n\n**Sector**: Health Technology  \n**Industry**: Pharmaceuticals: Major  \n**Description**:  Johnson \\&amp; Johnson is a holding company, which is engaged in the  research and development, manufacture and sale of a range of products  in the healthcare field. It operates through three segments: Consumer,  Pharmaceutical and Medical Devices. Its primary focus is products  related to human health and well-being. Its research facilities are  located in the United States, Belgium, Brazil, Canada, China, France,  Germany, India, Israel, Japan, the Netherlands, Singapore, Switzerland  and the United Kingdom.  \n**Dividend**:  Johnson & Johnson pays an annual dividend of $4.24 per share, with a  dividend yield of 2.44%. JNJ’s next quarterly dividend payment will be  made to shareholders of record on Tuesday, September 7. The company has  grown its dividend for the last 59 consecutive years and is increasing  its dividend by an average of 6.23% each year. Johnson & Johnson  pays out 52.80% of its earnings out as a dividend.  \n**Current valuation**: $173.82\n\n**Valuation of entry parameters:**\n\nTheStreet score: A  \nZacks Rank: Hold  \nWeiss Ratings recommendation: Buy  \nYahoo Finance recommendation: Buy  \nMarketBeat recommendation: Buy  \nYahoo Finance target price: $187.39  \nMarketBeat target price: $190.38  \nPiotroski F-Score: 7  \nMoody’s Daily Credit Risk: 1  \nInvestorsObserver Overall Score: 62  \nYahoo Finance 1 year change: 7.81%\n\n&#x200B;\n\n**LAM RESEARCH CORP (LRCX)**\n\n**Sector**: Electronic Technology  \n**Industry**: Electronic Production Equipment  \n**Description**:  Lam Research Corp. engages in manufacturing and servicing of wafer  processing semiconductor manufacturing equipment. It operates through  the following geographical segments: the United States, China, Europe,  Japan, Korea, Southeast Asia, and Taiwan. It offers thin film  deposition, plasma etch, photoresist strip, and wafer cleaning. The  company was founded by David Lam on January 21, 1980 and is  headquartered in Fremont, CA.  \n**Dividend**:  Lam Research pays an annual dividend of $5.20 per share, with a  dividend yield of 0.86%. LRCX’s most recent quarterly dividend payment  was made to shareholders of record on Wednesday, July 7. The company has  grown its dividend for the last 3 consecutive years and is increasing  its dividend by an average of 38.36% each year. Lam Research pays out  19.09% of its earnings out as a dividend.  \n**Current valuation**: $599.8\n\n**Valuation of entry parameters:**\n\nTheStreet score: A  \nZacks Rank: Hold  \nWeiss Ratings recommendation: Buy  \nYahoo Finance recommendation: Buy  \nMarketBeat recommendation: Buy  \nYahoo Finance target price: $728.43  \nMarketBeat target price: $713.94  \nPiotroski F-Score: 7  \nMoody’s Daily Credit Risk: 6  \nInvestorsObserver Overall Score: 65  \nYahoo Finance 1 year change: 21.45%\n\n&#x200B;\n\n**MONDELEZ INTERNATIONAL INC (MDLZ)**\n\n**Sector**: Consumer Non-Durables  \n**Industry**: Food: Major Diversified  \n**Description**:  Mondelez International, Inc. engages in the manufacture and marketing  of snack food and beverage products. It operates through the following  geographical segments: Latin America; Asia, Middle East, and Africa;  Europe; and North America. Its products include beverages, biscuits,  chocolate, gum & candy, cheese \\&amp; grocery and meals. Its  brands include but not limited to Nabisco, Oreo, and LU biscuits;  Cadbury, Cadbury Dairy Milk, and Milka chocolates; and Trident gum. The  company was founded by James Lewis Kraft in 1903 is headquartered in  Chicago, IL.  \n**Dividend**:  Mondelez International pays an annual dividend of $1.26 per share, with  a dividend yield of 2.01%. MDLZ’s next quarterly dividend payment will  be made to shareholders of record on Thursday, October 14. The company  has grown its dividend for the last 8 consecutive years and is  increasing its dividend by an average of 13.53% each year. Mondelez  International pays out 48.65% of its earnings out as a dividend.  \n**Current valuation**: $62.59\n\n**Valuation of entry parameters:**\n\nTheStreet score: A  \nZacks Rank: Hold  \nWeiss Ratings recommendation: Buy  \nYahoo Finance recommendation: Buy  \nMarketBeat recommendation: Buy  \nYahoo Finance target price: $69.17  \nMarketBeat target price: $67.90  \nPiotroski F-Score: 7  \nMoody’s Daily Credit Risk: 1  \nInvestorsObserver Overall Score: 68  \nYahoo Finance 1 year change: 10.51%\n\n&#x200B;\n\n**OPEN TEXT CORP (OTEX)**\n\n**Sector**: Technology Services  \n**Industry**: Packaged Software  \n**Description**:  Open Text Corp. engages in the design, development, marketing and sales  of enterprise information management software and solutions. It  includes customer experience management (CEM), digital process  automation, business network, and enterprise content management,  discovery, security, and artificial intelligence (AI) and analytics  solutions. It also offers consulting, managed, and learning services.  The company was founded on June 26, 1991 and is headquartered in  Waterloo, Canada.  \n**Dividend**:  Open Text pays an annual dividend of $0.38 per share, with a dividend  yield of 0.72%. OTEX’s next quarterly dividend payment will be made to  shareholders of record on Friday, September 24. The company has grown  its dividend for the last 7 consecutive years and is increasing its  dividend by an average of 12.35% each year. Open Text pays out 13.57% of  its earnings out as a dividend.  \n**Current valuation**: $52.62\n\n**Valuation of entry parameters:**\n\nTheStreet score: A  \nZacks Rank: Hold  \nWeiss Ratings recommendation: Buy  \nYahoo Finance recommendation: Buy  \nMarketBeat recommendation: Buy  \nYahoo Finance target price: $56.95  \nMarketBeat target price: $60.00  \nPiotroski F-Score: 6  \nMoody’s Daily Credit Risk: 6  \nInvestorsObserver Overall Score: 57  \nYahoo Finance 1 year change: 8.23%\n\n&#x200B;\n\n**QUALCOMM INC (QCOM)**\n\n**Sector**: Electronic Technology  \n**Industry**: Telecommunications Equipment  \n**Description**:  QUALCOMM, Inc. engages in the development, design, and provision of  digital telecommunications products and services. It operates through  the following segments: Qualcomm CDMA Technologies (QCT), Qualcomm  Technology Licensing (QTL), and Qualcomm Strategic Initiatives (QSI).  The company was founded by Franklin P. Antonio, Adelia A. Coffman,  Andrew Cohen, Klein Gilhousen, Irwin Mark Jacobs, Andrew J. Viterbi, and  Harvey P. White in July 1985 and is headquartered in San Diego, CA.  \n**Dividend**:  QUALCOMM pays an annual dividend of $2.72 per share, with a dividend  yield of 1.87%. QCOM’s next quarterly dividend payment will be made to  shareholders of record on Thursday, September 23. The company has grown  its dividend for the last 1 consecutive years and is increasing its  dividend by an average of 4.69% each year. QUALCOMM pays out 81.44% of  its earnings out as a dividend.  \n**Current valuation**: $145.03\n\n**Valuation of entry parameters:**\n\nTheStreet score: A  \nZacks Rank: Buy  \nWeiss Ratings recommendation: Buy  \nYahoo Finance recommendation: Buy  \nMarketBeat recommendation: Buy  \nYahoo Finance target price: $171.44  \nMarketBeat target price: $167.54  \nPiotroski F-Score: 7  \nMoody’s Daily Credit Risk: 6  \nInvestorsObserver Overall Score: 70  \nYahoo Finance 1 year change: 18.21%\n\n&#x200B;\n\n**QORVO INC (QRVO)**\n\n**Sector**: Electronic Technology  \n**Industry**: Semiconductors  \n**Description**:  Qorvo, Inc. engages in the provision of development and  commercialization of technologies and products for wireless and wired  connectivity. It operates through the following reportable segments:  Mobile Products and Infrastructure & Defense Products. The firm’s  products include amplifiers, control products, discrete transistors,  filters \\&amp; duplexers, frequency converters \\&amp; sources,  integrated products, optical components, passives, power management  products, switches, and wireless connectivity products. The company was  founded on December 13, 2013 and is headquartered in Greensboro, NC.  \n**Dividend**: NA  \n**Current valuation**: $188.32\n\n**Valuation of entry parameters:**\n\nTheStreet score: A-  \nZacks Rank: Buy  \nWeiss Ratings recommendation: Buy  \nYahoo Finance recommendation: Buy  \nMarketBeat recommendation: Buy  \nYahoo Finance target price: $208.26  \nMarketBeat target price: $205.14  \nPiotroski F-Score: 8  \nMoody’s Daily Credit Risk: 6  \nInvestorsObserver Overall Score: 74  \nYahoo Finance 1 year change: 10.59%\n\n&#x200B;\n\n**Now, a few words on the criteria I’m using and sources of data.**\n\n**1. TheStreet score**\n\nThe first filtering step is to get stocks with Buy recommendation at TheStreet stock screener. I’m only keeping stocks with A+, A or A- rating (top ones), although A-, B+, B and B- are Buys as well.\n\nFrom thestreet.com:\n\n***A (Excellent)*** *–  The stock has an excellent track record for maximizing performance  while minimizing risk, thus delivering the best possible combination of  total return on investment and reduced volatility. It has made the most  of the recent economic environment to maximize risk-adjusted returns  compared to other stocks. While past performance is just an indication —  not a guarantee — we believe this fund is among the most likely to  deliver superior performance relative to risk in the future as well.*\n\nAnd about the methodology:\n\n*TheStreet  Ratings’ stock model projects a stock’s total return potential over a  12-month period including both price appreciation and* ***dividends***\\*.  Our Buy, Hold or Sell ratings designate how we expect these stocks to  perform against a general benchmark of the equities market and interest  rates. While our model is quantitative, it utilizes both\\* ***subjective*** *and* ***objective*** *elements.  For instance, subjective elements include expected equities market  returns, future interest rates, implied industry outlook and forecasted  company earnings. Objective elements include volatility of past  operating revenues, financial strength, and company cash flows.*\n\n**2. Zacks Rank**\n\nIt  is required that the Zacks Rank is Hold, Buy or Strong Buy (so we’re  avoiding stocks with Sell and Strong Sell recommendations). The Zacks  Rating utilizes a completely different system, based on company  earnings-related data, in particular earnings estimate revisions and  earnings surprises, to predict profitability of holding the company’s  shares.\n\n**3. Weiss Ratings recommendation**\n\nWe’re only keeping stocks with Buy (B) or Strong Buy (A) recommendation.\n\nWjat are these scores? This is what I found at their website:\n\n*“A” Rating:* ***Excellent.*** *The  company’s stock has an excellent track record for providing strong  performance with lower-than-average risk, and it is trading at a price  that represents good value relative to the company’s earnings prospects.  While past performance is no guarantee of future results, our opinion  is that this stock is among the most likely to deliver superior  performance relative to risk in the future. Of course, even the best  stocks can decline in a down market. But our “A” rating can generally be  considered the equivalent of a “****Strong Buy****“.*\n\n*“B” rating:* ***Good.*** *The  company’s stock has a good track record for delivering a balance of  performance and risk. While the risk-adjusted performance of any stock  is subject to change, our opinion is that this stock is a good value,  with good prospects for outperforming the market. Although even good  investments can decline in a down market, our “B” rating is considered  the equivalent of a “****Buy****“.*\n\n**4.  Yahoo Finance  recommendation and target price**\n\nIt is required that the Yahoo Finance  stock recommendation is at least mixed Buy/Hold from experts.  Additionally, the predicted target price (average, from experts) should  be at least 5% higher than the current one.\n\n**5. MarketBeat recommendation and taget price**\n\nSimilar to Yahoo Finance, it is required that the MarketBeat stock recommendation is at least mixed Buy/Hold. Additionally, the  predicted target price (average, from experts) should be at least 5%  higher than the current valuation.\n\n**6. Piotroski F-Score**\n\nThe  Piotroski score is a number between 0-9 that reflects nine criteria  used to determine the strength of a company’s financial situation,  including profitability, leverage or operating efficiency. Zero is the  worst value and nine is the best. As we can read in Piotroski's paper from 2000:\n\n*In addition, an investment strategy that buys expected winners and shorts expected losers generates a* ***23% annual return*** *between 1976 and 1996, and the strategy appears to be robust across time and to controls for alternative investment strategies.*\n\nIt is required that the score is 4 or higher. The values were retrieved from gurufocus website.\n\n**7. Moody’s Daily Credit Risk**\n\nMoody’s  Daily Credit Risk Score is a 1-10 score, which provides a  forward-looking, one-year measure of credit risk. It is updated daily  and takes into account day-to-day market movements compared to a  company’s liabilities.\n\nThe value is retrieved from Business Insider's website and is expected to be in the range of 1-6.\n\n**8. InvestorsObserver Overall Score**\n\nThe rank has a value in between 0 and 100. It takes into account both **technical** analysis and **fundamental**  stock data. An Overall Rank of N means that a given company is rated  above N% of stocks, therefore the higher the number, the better. My  requirement is that the company has InvestorsObserver Overall score of  at least 50. From their website:\n\n*The  Overall Score combines our two technical scores (Short Term and Long  Term) with our Fundamental Score into one metric. This makes our overall  score a great place to start when evaluating stocks, regardless of your  investing style.*\n\n*A  low score doesn’t necessarily mean a stock is likely to go down, just  that our system doesn’t think there’s much of a bullish case for it.*\n\nPlease note that the company profile data (short description) was taken from  tradingview website (sometimes I shortened it) and dividend data was retrieved from MarketBeat.\n\nI  hope you enjoyed the reading. What do you think about this stock  selection and the strategy? Feel free to leave a comment below.\n\n*Michael*\n\nDisclosures:\n\n* What you see here is my      personal opinion, my own investments and should not be treated as      investing advice\n* I’m an amateur investor",
  "author_fullname": "t2_82rq0vlw",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Thirteen stocks possibly worth attention, a consensus strategy: FAF, FB, FSS, GLPI, HWKN, ICLR, IEX, JNJ, LRCX, MDLZ, OTEX, QCOM, QRVO",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/investing",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_p2v8y4",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.75,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 188,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 188,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1628754689,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.investing",
  "allow_live_comments": true,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Here is a couple of stocks that might be worth your attention this week. This is part 2 of 2.</p>\n\n<p>This is not a sponsored content. I&#39;m just sharing my thoughts with you, hoping you&#39;re going to enjoy it.</p>\n\n<p>This  short list was compiled with help of various sources of data, including  Buy recommendations from several renowned stock data providers and  analytical services. This is why I’m calling the approach a <strong>consensus strategy.</strong>  The stocks I’m going to present you below are generally believed to  outperform the stock market in the coming months, they have a consensus  recommendation of Buy, their fundamentals are scored considerably better  than most stocks and their average target price by stock analysts is  above current market valuation.</p>\n\n<p>In order to consider buying the stock’s shares, the following criteria need to be satisfied:</p>\n\n<ul>\n<li><strong>TheStreet score</strong>: A+, A or A-</li>\n<li><strong>Zacks Rank</strong>: 1 (Strong Buy), 2 (Buy) or 3      (Hold)</li>\n<li><strong>Weiss Ratings recommendation</strong>: A or B</li>\n<li><strong>Yahoo Finance recommendation</strong>: at least mixed Buy/Hold</li>\n<li><strong>MarketBeat recommendation</strong>: at least mixed Buy/Hold</li>\n<li><strong>Yahoo Finance target price</strong>: min. 5% higher than current      price</li>\n<li><strong>MarketBeat target price</strong>: min. 5% higher than current      price</li>\n<li><strong>Piotroski F-Score</strong>: min. 4</li>\n<li><strong>Moody’s Daily Credit Risk</strong>: 1 to 6</li>\n<li><strong>InvestorsObserver Overall Score</strong>: min. 50</li>\n</ul>\n\n<p><strong>Note</strong>: Descriptions of those criteria are provided at the end of this post.</p>\n\n<p>If  you decide to buy any of the below stocks, you might want to consider  the following selling conditions (at least one of them should be  satisfied):</p>\n\n<ul>\n<li>price is higher or close to      target</li>\n<li>profit is in range 20% – 30%</li>\n<li>loss is higher than 50%</li>\n<li>TheStreet recommendation is      changed to Sell</li>\n<li>Weiss Ratings recommendation is      changed to Sell</li>\n<li>Yahoo Finance recommendation is      changed to Sell</li>\n</ul>\n\n<p><strong>Let’s now take a look at the stocks I’ve identified with this strategy today.</strong></p>\n\n<p>&#x200B;</p>\n\n<p><strong>FIRST AMERICAN FINANCIAL CP (FAF)</strong></p>\n\n<p><strong>Sector</strong>: Finance<br/>\n<strong>Industry</strong>: Specialty Insurance<br/>\n<strong>Description</strong>:  First American Financial Corp. operates as an insurance company. It  provides title insurance and settlement services to the real estate and  mortgage industries. The company operates its business through the  following segments: Title Insurance &amp;amp; Services and Specialty  Insurance. First American Financial was founded in January, 2008 and is  headquartered in Santa Ana, CA.<br/>\n<strong>Dividend</strong>:  First American Financial pays an annual dividend of $1.84 per share,  with a dividend yield of 2.69%. FAF’s most recent quarterly dividend  payment was made to shareholders of record on Tuesday, June 15. The  company has grown its dividend for the last 1 consecutive years and is  increasing its dividend by an average of 7.32% each year. First American  Financial pays out 33.76% of its earnings out as a dividend.<br/>\n<strong>Current valuation</strong>: $64.85</p>\n\n<p><strong>Valuation of entry parameters:</strong></p>\n\n<p>TheStreet score: A-<br/>\nZacks Rank: Hold<br/>\nWeiss Ratings recommendation: Buy<br/>\nYahoo Finance recommendation: Buy/Hold<br/>\nMarketBeat recommendation: Buy<br/>\nYahoo Finance target price: $74.8<br/>\nMarketBeat target price: $73.00<br/>\nPiotroski F-Score: 8<br/>\nMoody’s Daily Credit Risk: 4<br/>\nInvestorsObserver Overall Score: 52<br/>\nYahoo Finance 1 year change: 15.34%</p>\n\n<p>&#x200B;</p>\n\n<p><strong>FACEBOOK INC (FB)</strong></p>\n\n<p><strong>Sector</strong>: Technology Services<br/>\n<strong>Industry</strong>: Internet Software/Services<br/>\n<strong>Description</strong>:  Facebook, Inc. is focused on building products that enable people to  connect and share through mobile devices, personal computers and other  surfaces. The Company’s products include Facebook, Instagram, Messenger,  WhatsApp and Oculus. Facebook enables people to connect, share,  discover and communicate with each other on mobile devices and personal  computers. Instagram enables people to take photos or videos, customize  them with filter effects, and share them with friends and followers in a  photo feed or send them directly to friends. Messenger allows  communicating with people and businesses alike across a range of  platforms and devices. WhatsApp Messenger is a messaging application  that is used by people around the world and is available on a range of  mobile platforms. Its Oculus virtual reality technology and content  platform offers products that allow people to enter an interactive  environment to play games, consume content and connect with others.<br/>\n<strong>Dividend</strong>: NA<br/>\n<strong>Current valuation</strong>: $360.33</p>\n\n<p><strong>Valuation of entry parameters:</strong></p>\n\n<p>TheStreet score: A-<br/>\nZacks Rank: Hold<br/>\nWeiss Ratings recommendation: Buy<br/>\nYahoo Finance recommendation: Buy<br/>\nMarketBeat recommendation: Buy<br/>\nYahoo Finance target price: $386.47<br/>\nMarketBeat target price: $402.76<br/>\nPiotroski F-Score: 7<br/>\nMoody’s Daily Credit Risk: 1<br/>\nInvestorsObserver Overall Score: 79<br/>\nYahoo Finance 1 year change: 7.33%</p>\n\n<p>&#x200B;</p>\n\n<p><strong>FEDERAL SIGNAL CORP (FSS)</strong></p>\n\n<p><strong>Sector</strong>: Producer Manufacturing<br/>\n<strong>Industry</strong>: Trucks/Construction/Farm Machinery<br/>\n<strong>Description</strong>:  Federal Signal Corp. engages in the designed manufacture of products  and integrated solutions for municipal, governmental, industrial, and  commercial customers. It operates through the Environmental Solutions  Group and Safety and Security Systems Group segments. The company was  founded in 1901 and is headquartered in Oak Brook, IL.<br/>\n<strong>Dividend</strong>:  Federal Signal pays an annual dividend of $0.36 per share, with a  dividend yield of 0.90%. FSS’s next quarterly dividend payment will be  made to shareholders of record on Wednesday, September 1. The company  has grown its dividend for the last 1 consecutive years and is  increasing its dividend by an average of 4.55% each year. Federal Signal  pays out 21.56% of its earnings out as a dividend.<br/>\n<strong>Current valuation</strong>: $39.81</p>\n\n<p><strong>Valuation of entry parameters:</strong></p>\n\n<p>TheStreet score: A-<br/>\nZacks Rank: Hold<br/>\nWeiss Ratings recommendation: Buy<br/>\nYahoo Finance recommendation: Buy<br/>\nMarketBeat recommendation: Buy<br/>\nYahoo Finance target price: $45.33<br/>\nMarketBeat target price: $44.00<br/>\nPiotroski F-Score: 4<br/>\nMoody’s Daily Credit Risk: 6<br/>\nInvestorsObserver Overall Score: 56<br/>\nYahoo Finance 1 year change: 13.87%</p>\n\n<p>&#x200B;</p>\n\n<p><strong>GAMING &amp; LEISURE PPTYS (GLPI)</strong></p>\n\n<p><strong>Sector</strong>: Finance<br/>\n<strong>Industry</strong>: Real Estate Investment Trusts<br/>\n<strong>Description</strong>:  Gaming &amp; Leisure Properties, Inc. is engaged in acquiring,  financing, and owning real estate property to be leased to gaming  operators in triple net lease arrangements. It operates through the GLP  Capital and TRS Properties segments. The GLP Capital segment consists of  the leased real property and represents the majority of business. The  TRS Properties segment includes Hollywood Casino Perryville and  Hollywood Casino Baton Rouge. The company was founded on February 13,  2013 and is headquartered in Wyomissing, PA.<br/>\n<strong>Dividend</strong>:  Gaming and Leisure Properties pays an annual dividend of $2.68 per  share, with a dividend yield of 5.56%. GLPI’s most recent quarterly  dividend payment was made to shareholders of record on Friday, June 25.  Gaming and Leisure Properties pays out 77.68% of its earnings out as a  dividend.<br/>\n<strong>Current valuation</strong>: $47.86</p>\n\n<p><strong>Valuation of entry parameters:</strong></p>\n\n<p>TheStreet score: A-<br/>\nZacks Rank: Buy<br/>\nWeiss Ratings recommendation: Buy<br/>\nYahoo Finance recommendation: Buy/Hold<br/>\nMarketBeat recommendation: Buy<br/>\nYahoo Finance target price: $51.08<br/>\nMarketBeat target price: $50.25<br/>\nPiotroski F-Score: 7<br/>\nMoody’s Daily Credit Risk: 4<br/>\nInvestorsObserver Overall Score: 60<br/>\nYahoo Finance 1 year change: 6.73%</p>\n\n<p>&#x200B;</p>\n\n<p><strong>HAWKINS INC (HWKN)</strong></p>\n\n<p><strong>Sector</strong>: Distribution Services<br/>\n<strong>Industry</strong>: Wholesale Distributors<br/>\n<strong>Description</strong>:  Hawkins, Inc. engaged in the distribution, blending, and manufacture of  chemicals and specialty ingredients for a wide variety of industries.  It operates through the following segments: Industrial, Water Treatment,  and Health and Nutrition. The company was founded by Howard Hawkins in  1938 and is headquartered in Roseville, MN.<br/>\n<strong>Dividend</strong>:  Hawkins pays an annual dividend of $0.49 per share, with a dividend  yield of 1.33%. HWKN’s next quarterly dividend payment will be made to  shareholders of record on Friday, August 27. The company has grown its  dividend for the last 1 consecutive years and is increasing its dividend  by an average of 2.64% each year. Hawkins pays out 25.39% of its  earnings out as a dividend.<br/>\n<strong>Current valuation</strong>: $36.80</p>\n\n<p><strong>Valuation of entry parameters:</strong></p>\n\n<p>TheStreet score: A<br/>\nZacks Rank: Buy<br/>\nWeiss Ratings recommendation: Buy<br/>\nYahoo Finance recommendation: Buy<br/>\nMarketBeat recommendation: Buy<br/>\nYahoo Finance target price: $44.0<br/>\nMarketBeat target price: $44.00<br/>\nPiotroski F-Score: 8<br/>\nMoody’s Daily Credit Risk: 6<br/>\nInvestorsObserver Overall Score: 51<br/>\nYahoo Finance 1 year change: 137.84%</p>\n\n<p>&#x200B;</p>\n\n<p><strong>ICON PLC (ICLR)</strong></p>\n\n<p><strong>Sector</strong>: Health Technology<br/>\n<strong>Industry</strong>: Pharmaceuticals: Other<br/>\n<strong>Description</strong>:  ICON plc operates as a clinical research organization, which engages in  the provision of outsourced development services to the pharmaceutical,  biotechnology, and medical device industries. It specializes in the  strategic development, management and analysis of programs that support  clinical development. The company was founded by John Climax and Ronan  Lambe in June 1990 and is headquartered in Dublin, Ireland.<br/>\n<strong>Dividend</strong>: NA<br/>\n<strong>Current valuation</strong>: $235.92</p>\n\n<p><strong>Valuation of entry parameters:</strong></p>\n\n<p>TheStreet score: A-<br/>\nZacks Rank: Buy<br/>\nWeiss Ratings recommendation: Buy<br/>\nYahoo Finance recommendation: Buy<br/>\nMarketBeat recommendation: Buy<br/>\nYahoo Finance target price: $251.42<br/>\nMarketBeat target price: $251.00<br/>\nPiotroski F-Score: 6<br/>\nMoody’s Daily Credit Risk: 2<br/>\nInvestorsObserver Overall Score: 80<br/>\nYahoo Finance 1 year change: 6.57%</p>\n\n<p>&#x200B;</p>\n\n<p><strong>IDEX CORP (IEX)</strong></p>\n\n<p><strong>Sector</strong>: Finance<br/>\n<strong>Industry</strong>: Investment Banks/Brokers<br/>\n<strong>Description</strong>:  Indian Energy Exchange Ltd. Engages in power exchange business and  provides an automated platform for trading of electricity and related  products. It enables trading and price discovery of electricity and  related products with risk management for participants of the  electricity market. The firm’s products include day-ahead-market (DAM)  electricity contracts, term-ahead-market (TAM) electricity contract,  Renewable Energy Certificates (REC) and Energy Saving Certificates. The  company was founded on March 26, 2007 and is headquartered in Noida,  India.<br/>\n<strong>Dividend</strong>:  IDEX pays an annual dividend of $2.16 per share, with a dividend yield  of 0.95%. IEX’s most recent quarterly dividend payment was made to  shareholders of record on Friday, July 30. The company has grown its  dividend for the last 1 consecutive years and is increasing its dividend  by an average of 11.31% each year. IDEX pays out 41.62% of its earnings  out as a dividend.<br/>\n<strong>Current valuation</strong>: $227.11</p>\n\n<p><strong>Valuation of entry parameters:</strong></p>\n\n<p>TheStreet score: A-<br/>\nZacks Rank: Buy<br/>\nWeiss Ratings recommendation: Buy<br/>\nYahoo Finance recommendation: Buy/Hold<br/>\nMarketBeat recommendation: Buy<br/>\nYahoo Finance target price: $242.25<br/>\nMarketBeat target price: $239.50<br/>\nPiotroski F-Score: 5<br/>\nMoody’s Daily Credit Risk: 2<br/>\nInvestorsObserver Overall Score: 69<br/>\nYahoo Finance 1 year change: 6.61%</p>\n\n<p>&#x200B;</p>\n\n<p><strong>JOHNSON &amp; JOHNSON (JNJ)</strong></p>\n\n<p><strong>Sector</strong>: Health Technology<br/>\n<strong>Industry</strong>: Pharmaceuticals: Major<br/>\n<strong>Description</strong>:  Johnson &amp;amp; Johnson is a holding company, which is engaged in the  research and development, manufacture and sale of a range of products  in the healthcare field. It operates through three segments: Consumer,  Pharmaceutical and Medical Devices. Its primary focus is products  related to human health and well-being. Its research facilities are  located in the United States, Belgium, Brazil, Canada, China, France,  Germany, India, Israel, Japan, the Netherlands, Singapore, Switzerland  and the United Kingdom.<br/>\n<strong>Dividend</strong>:  Johnson &amp; Johnson pays an annual dividend of $4.24 per share, with a  dividend yield of 2.44%. JNJ’s next quarterly dividend payment will be  made to shareholders of record on Tuesday, September 7. The company has  grown its dividend for the last 59 consecutive years and is increasing  its dividend by an average of 6.23% each year. Johnson &amp; Johnson  pays out 52.80% of its earnings out as a dividend.<br/>\n<strong>Current valuation</strong>: $173.82</p>\n\n<p><strong>Valuation of entry parameters:</strong></p>\n\n<p>TheStreet score: A<br/>\nZacks Rank: Hold<br/>\nWeiss Ratings recommendation: Buy<br/>\nYahoo Finance recommendation: Buy<br/>\nMarketBeat recommendation: Buy<br/>\nYahoo Finance target price: $187.39<br/>\nMarketBeat target price: $190.38<br/>\nPiotroski F-Score: 7<br/>\nMoody’s Daily Credit Risk: 1<br/>\nInvestorsObserver Overall Score: 62<br/>\nYahoo Finance 1 year change: 7.81%</p>\n\n<p>&#x200B;</p>\n\n<p><strong>LAM RESEARCH CORP (LRCX)</strong></p>\n\n<p><strong>Sector</strong>: Electronic Technology<br/>\n<strong>Industry</strong>: Electronic Production Equipment<br/>\n<strong>Description</strong>:  Lam Research Corp. engages in manufacturing and servicing of wafer  processing semiconductor manufacturing equipment. It operates through  the following geographical segments: the United States, China, Europe,  Japan, Korea, Southeast Asia, and Taiwan. It offers thin film  deposition, plasma etch, photoresist strip, and wafer cleaning. The  company was founded by David Lam on January 21, 1980 and is  headquartered in Fremont, CA.<br/>\n<strong>Dividend</strong>:  Lam Research pays an annual dividend of $5.20 per share, with a  dividend yield of 0.86%. LRCX’s most recent quarterly dividend payment  was made to shareholders of record on Wednesday, July 7. The company has  grown its dividend for the last 3 consecutive years and is increasing  its dividend by an average of 38.36% each year. Lam Research pays out  19.09% of its earnings out as a dividend.<br/>\n<strong>Current valuation</strong>: $599.8</p>\n\n<p><strong>Valuation of entry parameters:</strong></p>\n\n<p>TheStreet score: A<br/>\nZacks Rank: Hold<br/>\nWeiss Ratings recommendation: Buy<br/>\nYahoo Finance recommendation: Buy<br/>\nMarketBeat recommendation: Buy<br/>\nYahoo Finance target price: $728.43<br/>\nMarketBeat target price: $713.94<br/>\nPiotroski F-Score: 7<br/>\nMoody’s Daily Credit Risk: 6<br/>\nInvestorsObserver Overall Score: 65<br/>\nYahoo Finance 1 year change: 21.45%</p>\n\n<p>&#x200B;</p>\n\n<p><strong>MONDELEZ INTERNATIONAL INC (MDLZ)</strong></p>\n\n<p><strong>Sector</strong>: Consumer Non-Durables<br/>\n<strong>Industry</strong>: Food: Major Diversified<br/>\n<strong>Description</strong>:  Mondelez International, Inc. engages in the manufacture and marketing  of snack food and beverage products. It operates through the following  geographical segments: Latin America; Asia, Middle East, and Africa;  Europe; and North America. Its products include beverages, biscuits,  chocolate, gum &amp; candy, cheese &amp;amp; grocery and meals. Its  brands include but not limited to Nabisco, Oreo, and LU biscuits;  Cadbury, Cadbury Dairy Milk, and Milka chocolates; and Trident gum. The  company was founded by James Lewis Kraft in 1903 is headquartered in  Chicago, IL.<br/>\n<strong>Dividend</strong>:  Mondelez International pays an annual dividend of $1.26 per share, with  a dividend yield of 2.01%. MDLZ’s next quarterly dividend payment will  be made to shareholders of record on Thursday, October 14. The company  has grown its dividend for the last 8 consecutive years and is  increasing its dividend by an average of 13.53% each year. Mondelez  International pays out 48.65% of its earnings out as a dividend.<br/>\n<strong>Current valuation</strong>: $62.59</p>\n\n<p><strong>Valuation of entry parameters:</strong></p>\n\n<p>TheStreet score: A<br/>\nZacks Rank: Hold<br/>\nWeiss Ratings recommendation: Buy<br/>\nYahoo Finance recommendation: Buy<br/>\nMarketBeat recommendation: Buy<br/>\nYahoo Finance target price: $69.17<br/>\nMarketBeat target price: $67.90<br/>\nPiotroski F-Score: 7<br/>\nMoody’s Daily Credit Risk: 1<br/>\nInvestorsObserver Overall Score: 68<br/>\nYahoo Finance 1 year change: 10.51%</p>\n\n<p>&#x200B;</p>\n\n<p><strong>OPEN TEXT CORP (OTEX)</strong></p>\n\n<p><strong>Sector</strong>: Technology Services<br/>\n<strong>Industry</strong>: Packaged Software<br/>\n<strong>Description</strong>:  Open Text Corp. engages in the design, development, marketing and sales  of enterprise information management software and solutions. It  includes customer experience management (CEM), digital process  automation, business network, and enterprise content management,  discovery, security, and artificial intelligence (AI) and analytics  solutions. It also offers consulting, managed, and learning services.  The company was founded on June 26, 1991 and is headquartered in  Waterloo, Canada.<br/>\n<strong>Dividend</strong>:  Open Text pays an annual dividend of $0.38 per share, with a dividend  yield of 0.72%. OTEX’s next quarterly dividend payment will be made to  shareholders of record on Friday, September 24. The company has grown  its dividend for the last 7 consecutive years and is increasing its  dividend by an average of 12.35% each year. Open Text pays out 13.57% of  its earnings out as a dividend.<br/>\n<strong>Current valuation</strong>: $52.62</p>\n\n<p><strong>Valuation of entry parameters:</strong></p>\n\n<p>TheStreet score: A<br/>\nZacks Rank: Hold<br/>\nWeiss Ratings recommendation: Buy<br/>\nYahoo Finance recommendation: Buy<br/>\nMarketBeat recommendation: Buy<br/>\nYahoo Finance target price: $56.95<br/>\nMarketBeat target price: $60.00<br/>\nPiotroski F-Score: 6<br/>\nMoody’s Daily Credit Risk: 6<br/>\nInvestorsObserver Overall Score: 57<br/>\nYahoo Finance 1 year change: 8.23%</p>\n\n<p>&#x200B;</p>\n\n<p><strong>QUALCOMM INC (QCOM)</strong></p>\n\n<p><strong>Sector</strong>: Electronic Technology<br/>\n<strong>Industry</strong>: Telecommunications Equipment<br/>\n<strong>Description</strong>:  QUALCOMM, Inc. engages in the development, design, and provision of  digital telecommunications products and services. It operates through  the following segments: Qualcomm CDMA Technologies (QCT), Qualcomm  Technology Licensing (QTL), and Qualcomm Strategic Initiatives (QSI).  The company was founded by Franklin P. Antonio, Adelia A. Coffman,  Andrew Cohen, Klein Gilhousen, Irwin Mark Jacobs, Andrew J. Viterbi, and  Harvey P. White in July 1985 and is headquartered in San Diego, CA.<br/>\n<strong>Dividend</strong>:  QUALCOMM pays an annual dividend of $2.72 per share, with a dividend  yield of 1.87%. QCOM’s next quarterly dividend payment will be made to  shareholders of record on Thursday, September 23. The company has grown  its dividend for the last 1 consecutive years and is increasing its  dividend by an average of 4.69% each year. QUALCOMM pays out 81.44% of  its earnings out as a dividend.<br/>\n<strong>Current valuation</strong>: $145.03</p>\n\n<p><strong>Valuation of entry parameters:</strong></p>\n\n<p>TheStreet score: A<br/>\nZacks Rank: Buy<br/>\nWeiss Ratings recommendation: Buy<br/>\nYahoo Finance recommendation: Buy<br/>\nMarketBeat recommendation: Buy<br/>\nYahoo Finance target price: $171.44<br/>\nMarketBeat target price: $167.54<br/>\nPiotroski F-Score: 7<br/>\nMoody’s Daily Credit Risk: 6<br/>\nInvestorsObserver Overall Score: 70<br/>\nYahoo Finance 1 year change: 18.21%</p>\n\n<p>&#x200B;</p>\n\n<p><strong>QORVO INC (QRVO)</strong></p>\n\n<p><strong>Sector</strong>: Electronic Technology<br/>\n<strong>Industry</strong>: Semiconductors<br/>\n<strong>Description</strong>:  Qorvo, Inc. engages in the provision of development and  commercialization of technologies and products for wireless and wired  connectivity. It operates through the following reportable segments:  Mobile Products and Infrastructure &amp; Defense Products. The firm’s  products include amplifiers, control products, discrete transistors,  filters &amp;amp; duplexers, frequency converters &amp;amp; sources,  integrated products, optical components, passives, power management  products, switches, and wireless connectivity products. The company was  founded on December 13, 2013 and is headquartered in Greensboro, NC.<br/>\n<strong>Dividend</strong>: NA<br/>\n<strong>Current valuation</strong>: $188.32</p>\n\n<p><strong>Valuation of entry parameters:</strong></p>\n\n<p>TheStreet score: A-<br/>\nZacks Rank: Buy<br/>\nWeiss Ratings recommendation: Buy<br/>\nYahoo Finance recommendation: Buy<br/>\nMarketBeat recommendation: Buy<br/>\nYahoo Finance target price: $208.26<br/>\nMarketBeat target price: $205.14<br/>\nPiotroski F-Score: 8<br/>\nMoody’s Daily Credit Risk: 6<br/>\nInvestorsObserver Overall Score: 74<br/>\nYahoo Finance 1 year change: 10.59%</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Now, a few words on the criteria I’m using and sources of data.</strong></p>\n\n<p><strong>1. TheStreet score</strong></p>\n\n<p>The first filtering step is to get stocks with Buy recommendation at TheStreet stock screener. I’m only keeping stocks with A+, A or A- rating (top ones), although A-, B+, B and B- are Buys as well.</p>\n\n<p>From thestreet.com:</p>\n\n<p><strong><em>A (Excellent)</em></strong> <em>–  The stock has an excellent track record for maximizing performance  while minimizing risk, thus delivering the best possible combination of  total return on investment and reduced volatility. It has made the most  of the recent economic environment to maximize risk-adjusted returns  compared to other stocks. While past performance is just an indication —  not a guarantee — we believe this fund is among the most likely to  deliver superior performance relative to risk in the future as well.</em></p>\n\n<p>And about the methodology:</p>\n\n<p><em>TheStreet  Ratings’ stock model projects a stock’s total return potential over a  12-month period including both price appreciation and</em> <strong><em>dividends</em></strong>*.  Our Buy, Hold or Sell ratings designate how we expect these stocks to  perform against a general benchmark of the equities market and interest  rates. While our model is quantitative, it utilizes both* <strong><em>subjective</em></strong> <em>and</em> <strong><em>objective</em></strong> <em>elements.  For instance, subjective elements include expected equities market  returns, future interest rates, implied industry outlook and forecasted  company earnings. Objective elements include volatility of past  operating revenues, financial strength, and company cash flows.</em></p>\n\n<p><strong>2. Zacks Rank</strong></p>\n\n<p>It  is required that the Zacks Rank is Hold, Buy or Strong Buy (so we’re  avoiding stocks with Sell and Strong Sell recommendations). The Zacks  Rating utilizes a completely different system, based on company  earnings-related data, in particular earnings estimate revisions and  earnings surprises, to predict profitability of holding the company’s  shares.</p>\n\n<p><strong>3. Weiss Ratings recommendation</strong></p>\n\n<p>We’re only keeping stocks with Buy (B) or Strong Buy (A) recommendation.</p>\n\n<p>Wjat are these scores? This is what I found at their website:</p>\n\n<p><em>“A” Rating:</em> <strong><em>Excellent.</em></strong> <em>The  company’s stock has an excellent track record for providing strong  performance with lower-than-average risk, and it is trading at a price  that represents good value relative to the company’s earnings prospects.  While past performance is no guarantee of future results, our opinion  is that this stock is among the most likely to deliver superior  performance relative to risk in the future. Of course, even the best  stocks can decline in a down market. But our “A” rating can generally be  considered the equivalent of a “</em><strong><em>Strong Buy</em></strong><em>“.</em></p>\n\n<p><em>“B” rating:</em> <strong><em>Good.</em></strong> <em>The  company’s stock has a good track record for delivering a balance of  performance and risk. While the risk-adjusted performance of any stock  is subject to change, our opinion is that this stock is a good value,  with good prospects for outperforming the market. Although even good  investments can decline in a down market, our “B” rating is considered  the equivalent of a “</em><strong><em>Buy</em></strong><em>“.</em></p>\n\n<p><strong>4.  Yahoo Finance  recommendation and target price</strong></p>\n\n<p>It is required that the Yahoo Finance  stock recommendation is at least mixed Buy/Hold from experts.  Additionally, the predicted target price (average, from experts) should  be at least 5% higher than the current one.</p>\n\n<p><strong>5. MarketBeat recommendation and taget price</strong></p>\n\n<p>Similar to Yahoo Finance, it is required that the MarketBeat stock recommendation is at least mixed Buy/Hold. Additionally, the  predicted target price (average, from experts) should be at least 5%  higher than the current valuation.</p>\n\n<p><strong>6. Piotroski F-Score</strong></p>\n\n<p>The  Piotroski score is a number between 0-9 that reflects nine criteria  used to determine the strength of a company’s financial situation,  including profitability, leverage or operating efficiency. Zero is the  worst value and nine is the best. As we can read in Piotroski&#39;s paper from 2000:</p>\n\n<p><em>In addition, an investment strategy that buys expected winners and shorts expected losers generates a</em> <strong><em>23% annual return</em></strong> <em>between 1976 and 1996, and the strategy appears to be robust across time and to controls for alternative investment strategies.</em></p>\n\n<p>It is required that the score is 4 or higher. The values were retrieved from gurufocus website.</p>\n\n<p><strong>7. Moody’s Daily Credit Risk</strong></p>\n\n<p>Moody’s  Daily Credit Risk Score is a 1-10 score, which provides a  forward-looking, one-year measure of credit risk. It is updated daily  and takes into account day-to-day market movements compared to a  company’s liabilities.</p>\n\n<p>The value is retrieved from Business Insider&#39;s website and is expected to be in the range of 1-6.</p>\n\n<p><strong>8. InvestorsObserver Overall Score</strong></p>\n\n<p>The rank has a value in between 0 and 100. It takes into account both <strong>technical</strong> analysis and <strong>fundamental</strong>  stock data. An Overall Rank of N means that a given company is rated  above N% of stocks, therefore the higher the number, the better. My  requirement is that the company has InvestorsObserver Overall score of  at least 50. From their website:</p>\n\n<p><em>The  Overall Score combines our two technical scores (Short Term and Long  Term) with our Fundamental Score into one metric. This makes our overall  score a great place to start when evaluating stocks, regardless of your  investing style.</em></p>\n\n<p><em>A  low score doesn’t necessarily mean a stock is likely to go down, just  that our system doesn’t think there’s much of a bullish case for it.</em></p>\n\n<p>Please note that the company profile data (short description) was taken from  tradingview website (sometimes I shortened it) and dividend data was retrieved from MarketBeat.</p>\n\n<p>I  hope you enjoyed the reading. What do you think about this stock  selection and the strategy? Feel free to leave a comment below.</p>\n\n<p><em>Michael</em></p>\n\n<p>Disclosures:</p>\n\n<ul>\n<li>What you see here is my      personal opinion, my own investments and should not be treated as      investing advice</li>\n<li>I’m an amateur investor</li>\n</ul>\n</div><!-- SC_ON -->",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qhhq",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "p2v8y4",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "investing-scientist2",
  "discussion_type": null,
  "num_comments": 12,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/investing/comments/p2v8y4/thirteen_stocks_possibly_worth_attention_a/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/investing/comments/p2v8y4/thirteen_stocks_possibly_worth_attention_a/",
  "subreddit_subscribers": 1897191,
  "created_utc": 1628781982,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1628754689,
  "the_new_excerpt": "Here is a couple of stocks that might be worth your attention this week. This is\npart 2 of 2.\n\nThis is not a sponsored content. I'm just sharing my thoughts with you, hoping\nyou're going to enjoy it.\n\nThis short list was compiled with help of various sources of data, including Buy\nrecommendations…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今週、注目すべき銘柄を紹介します。これは\nパート2の2です。\n\nこれはスポンサー付きのコンテンツではありません。ただ、私の考えをお伝えしているだけです。\n楽しんでもらえればと思います。\n\nこの短いリストは、様々なデータの助けを借りてまとめられたものです。例えば、Buy\nの推奨事項です...",
      "title": "注目すべき13銘柄の可能性、コンセンサス戦略。faf、fb、fss、glpi、hwkn、iclr、iex、jnj、lrcx、mdlz、otex、qcom、qrvo"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "以下是本周可能值得你关注的几只股票。这里是\n2的第二部分。\n\n这不是一个赞助内容。我只是与你分享我的想法，希望\n你会喜欢它。\n\n这个简短的名单是在各种数据来源的帮助下编制的，包括Buy\n建议...",
      "title": "十三只股票可能值得关注，这是一个共识策略。FAF, FB, FSS, GLPI, HWKN, ICLR, iex, JNJ, LRCX, MDLZ, OTEX, QCOM, QRVO"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "以下是本週可能值得你關注的幾隻股票。這裏是\n2的第二部分。\n\n這不是一個贊助內容。我只是與你分享我的想法，希望\n你會喜歡它。\n\n這個簡短的名單是在各種數據來源的幫助下編制的，包括Buy\n建議...",
      "title": "十三隻股票可能值得關注，這是一個共識策略。FAF, FB, FSS, GLPI, HWKN, ICLR, iex, JNJ, LRCX, MDLZ, OTEX, QCOM, QRVO"
    }
  ],
  "source_updated_at": 1629452482613
}