{
  "author": "360Housing",
  "the_new_excerpt": "I'm new to stocks and have a limited knowledge of how they work, but to my\nunderstanding when a stock is selling in large quantities, the price goes up\n(supply and demand). This is what happened for GME, everyone bought in and the\nprice went up. I realize there are other factors that go into a…",
  "original_created_utc": 1612460006,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我是新股，对股票的工作原理了解有限，但对我来说\n理解当股票大量出售时，价格会上升。\n(供应和需求)。这就是GME的情况，大家都买进了，而GME的。\n价格上涨。我知道还有其他的因素，进入一个... ...",
      "title": "有什么理由阻止一个亿万富翁向一只股票倾注数十亿美元来推高价格，然后卖出获利？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是新股，對股票的工作原理了解有限，但對我來說\n理解當股票大量出售時，價格會上升。\n(供應和需求)。這就是GME的情況，大家都買進了，而GME的。\n價格上漲。我知道還有其他的因素，進入一個... ...",
      "title": "有什麼理由阻止一個億萬富翁向一隻股票傾注數十億美元來推高價格，然後賣出獲利？"
    }
  ],
  "title": "What's preventing a billionaire from dumping billions of dollars into a single stock to drive up price, and then selling for profit?",
  "created_utc": 1612478543,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m new to stocks and have a limited knowledge of how they work, but to my understanding when a stock is selling in large quantities, the price goes up (supply and demand). This is what happened for GME, everyone bought in and the price went up. I realize there are other factors that go into a stocks price, but in simplest of terms that is what I understand.</p>\n\n<p>&#x200B;</p>\n\n<p>So with that being said, what is stopping a billionaire from dumping a ton of money into a stock, having the price go up, sell as soon as it does, and repeat. Some might call this &quot;market manipulation&quot; but to my understanding simply purchasing a stock is not illegal, regardless in the quantity that is being purchased. </p>\n\n<p>&#x200B;</p>\n\n<p>Hypothetical example: Bezos see&#39;s Ford(FORD) is valued at $3.685/stock. He then uses his ungodly amount of money to purchase the entire market cap of 36,381,772 of stocks for $134,066,830.00. Doing so causes the stock to rise to $3.90/stock, and then he sells instantly, resulting in a sell price of $141,888,911.00, or a net profit of $7.8M.</p>\n\n<p>&#x200B;</p>\n\n<p>I&#39;m likely wrong about all of this, just looking for some clarification.</p>\n</div><!-- SC_ON -->",
  "score": 204,
  "permalink": "/r/stocks/comments/lcl15f/whats_preventing_a_billionaire_from_dumping/",
  "subreddit": "stocks",
  "id": "lcl15f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123200918
}