{
  "author": "gorays21",
  "the_new_excerpt": "> Chinese electric-vehicle maker NIO said that it has extended its current\n> manufacturing deal for another three years -- and that its manufacturing\n> partner has agreed to double the factory's production capacity.\n> \n> Although the company has talked from time to time about building a factory,\n>…",
  "original_created_utc": 1621921068,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "> 中国の電気自動車メーカーであるNIOは、現在の製造契約をさらに3年間延長したと発表しました。\n> 中国の電気自動車メーカーNIOは、現在の製造契約をさらに3年間延長し、製造パートナーが\n> 生産能力を倍増することに合意した。\n> \n> NIOはこれまでも工場建設の話をしてきましたが。\n>...",
      "title": "NIO、生産量倍増の契約を発表"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "> 中国电动汽车制造商NIO表示，它已将其目前的\n> 制造协议再延长三年--而且其制造伙伴已同意将工厂的生产能力提高一倍。\n> 合作伙伴已同意将工厂的生产能力提高一倍。\n> \n> 尽管该公司不时谈到建厂的问题。\n>...",
      "title": "NIO宣布将其产量增加一倍的交易"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "> 中國電動汽車製造商NIO表示，它已將其目前的\n> 製造協議再延長三年--而且其製造夥伴已同意將工廠的生產能力提高一倍。\n> 合作伙伴已同意將工廠的生產能力提高一倍。\n> \n> 儘管該公司不時談到建廠的問題。\n>...",
      "title": "NIO宣佈將其產量增加一倍的交易"
    }
  ],
  "title": "NIO Announces Deal to Double Its Production",
  "created_utc": 1621929267,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><blockquote>\n<p>Chinese electric-vehicle maker NIO said that it has extended its current manufacturing deal for another three years -- and that its manufacturing partner has agreed to double the factory&#39;s production capacity.   </p>\n\n<p>Although the company has talked from time to time about building a factory, NIO doesn&#39;t currently own one. Its vehicles are manufactured in a factory belonging to Chinese state-owned automaker <strong>Jianghuai Automobile Group</strong> in the industrial city of Hefei, where NIO is headquartered.   </p>\n\n<p>Under the new deal, the JAC factory will continue to build NIOs for another three years, through May of 2024. JAC also agreed to increase the manufacturing capacity of the factory to 240,000 NIO vehicles per year (or 20,000 per month). That will roughly double the production capacity available to NIO.  </p>\n\n<p>NIO said in April that it had completed upgrades that will allow it to manufacture <a href=\"https://www.fool.com/investing/2021/04/08/why-nio-stock-is-higher-today/\">up to 10,000 vehicles per month</a>, though ongoing shortages of battery cells and semiconductors have so far <a href=\"https://www.fool.com/investing/2021/04/30/after-a-good-first-quarter-nio-joins-the-ranks-of/\">limited it to a lower output</a>.  </p>\n\n<p>As with many deals involving Chinese automakers, the details of this arrangement are a bit complicated. While JAC owns the factory, it was designed and built specifically for NIO, and it&#39;s operated by a third company called Jianglai Advanced Manufacturing. Jianglai is a joint venture between NIO and JAC in which NIO holds a 49% stake. </p>\n</blockquote>\n\n<p><a href=\"https://finance.yahoo.com/news/nio-announces-renewal-joint-manufacturing-080500577.html\">NIO Announces Renewal of Joint Manufacturing Arrangements (yahoo.com)</a></p>\n</div><!-- SC_ON -->",
  "score": 1381,
  "permalink": "/r/stocks/comments/nki7qb/nio_announces_deal_to_double_its_production/",
  "subreddit": "stocks",
  "id": "nki7qb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197389736
}