{
  "author": "moodring88",
  "the_new_excerpt": "what stock are you holding for at least a year from now?\n\nFor me, I'm holding etsy, conoco phillips, Opendoor, and poshmark. I've held\netsy for a year now and it's done phenomenal. Conoco phillips (just bought\ntoday) all analysts rate it a strong buy. I believe opendoor tech will be the\nfuture. The…",
  "original_created_utc": 1620438219,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "あなたは少なくとも1年後のためにどんな株を持っていますか？\n\n私の場合は、etsy、conoco phillips、Opendoor、poshmarkを保有しています。etsyは1年前から保有しています。\netsyは1年前から保有していますが、驚異的な業績を上げています。Conoco phillips（今日買ったばかり\nアナリストは皆、強い買いだと評価しています。私は、オープンドア・テックが将来的には\n未来です。その...",
      "title": "どのような銘柄を長期的に保有していますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你持有什么股票，从现在起至少一年？\n\n对我来说，我持有etsy、Conoco phillips、Opendoor和poshmark。我已经持有\netsy已经一年了，它的表现非常好。康菲石油公司（今天刚买入\n今天刚买的）所有的分析师都把它评为强力买入。我相信Opendoor技术将是\n未来。我相信开门技术将是未来的趋势。",
      "title": "你长期持有什么股票？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你持有什麼股票，從現在起至少一年？\n\n對我來說，我持有etsy、Conoco phillips、Opendoor和poshmark。我已經持有\netsy已經一年了，它的表現非常好。康菲石油公司（今天剛買入\n今天剛買的）所有的分析師都把它評爲強力買入。我相信Opendoor技術將是\n未來。我相信開門技術將是未來的趨勢。",
      "title": "你長期持有什麼股票？"
    }
  ],
  "title": "what stocks are you holding long term?",
  "created_utc": 1620490986,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>what stock are you holding for at least a year from now?</p>\n\n<p>For me, I&#39;m holding etsy, conoco phillips, Opendoor, and poshmark. I&#39;ve held etsy for a year now and it&#39;s done phenomenal. Conoco phillips (just bought today) all analysts rate it a strong buy. I believe opendoor tech will be the future. The only reason im holding poshmark for a year is because I bought at $60 and im losing kinda bad :( otherwise, I would have sold it after gaining some some. I do believe it has a strong future but I was just wanting to swing trade it but that didn&#39;t work out lol</p>\n</div><!-- SC_ON -->",
  "score": 91,
  "permalink": "/r/stocks/comments/n7egrl/what_stocks_are_you_holding_long_term/",
  "subreddit": "stocks",
  "id": "n7egrl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985995615
}