{
  "author": "TwistedFluke",
  "original_created_utc": 1638826405,
  "title": "What did you buy during this pullback",
  "created_utc": 1638841159,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m interested to see what everyone is eyeing or is interested in adding more positions. For myself, I bought more algo, dot and ada cause the pullbacks on those are juicy and I&amp;#39;m still very bullish on the projects. Its times like these that if you&amp;#39;re bullish in the space to take advantage of pullbacks and ensure you DCA on your favorite projects. Its hard to catch a falling knife so DCA is an effective tool if you have a positive view in the future of the space. Time in the market especially crypto seems to be more effective than swing trading.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 293,
  "permalink": "/r/CryptoCurrency/comments/raid8f/what_did_you_buy_during_this_pullback/",
  "subreddit": "CryptoCurrency",
  "id": "raid8f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm interested to see what everyone is eyeing or is interested in adding more\npositions. For myself, I bought more algo, dot and ada cause the pullbacks on\nthose are juicy and I'm still very bullish on the projects. Its times like these\nthat if you're bullish in the space to take advantage of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "みんなが注目しているもの、増やしたいと思っているものに興味があります。\nのポジションになります。私自身は、アルゴ、ドット、エイダを買い増しました。\nこれらのプロジェクトは魅力的で、私はまだ非常に強気です。このような時こそ\nもし、あなたがその分野で強気であれば、それを利用することができます。",
      "title": "このプルバックで何を買いましたか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我很想看看大家都在关注什么，或者有兴趣增加什么\n职位。就我自己而言，我买了更多的algo、dot和ada，因为这些股票的回撤很有吸引力。\n这些都是多汁的，我仍然非常看好这些项目。像这种时候\n如果你看好这个领域，就可以利用...",
      "title": "在这次回调中你买了什么"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我很想看看大家都在關注什麼，或者有興趣增加什麼\n職位。就我自己而言，我買了更多的algo、dot和ada，因爲這些股票的回撤很有吸引力。\n這些都是多汁的，我仍然非常看好這些項目。像這種時候\n如果你看好這個領域，就可以利用...",
      "title": "在這次回調中你買了什麼"
    }
  ]
}