{
  "author": "Aggressive-Airport32",
  "original_created_utc": 1630947442,
  "title": "I just turned 19 and am officially a whole coiner! Still can’t believe it.",
  "created_utc": 1630954066,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I know we arent supposed to say stuff like this but I needed to tell somebody. Right before covid my parents kicked me out and I lived in my car for little under 2 months. I had about $300 in my pocket at the time. Every day, I would wake up early and donate plasma before work and then work 8-12 hours at my sales job depending on how many hours of OT they gave me, I would also shower there too. Ever paycheck I got I would take what little money i needed for necessities and the rest I would put in in bitcoin. To me, bitcoin was hope, hope that I would eventually be able to be financially stable and for a brighter future. I bought in before the dip and during the dip to sub 5000.  Again, sorry i know we shouldnt talk about this but i cant tell anyone and today i passed 1 whole coin.</p>\n</div><!-- SC_ON -->",
  "score": 299,
  "permalink": "/r/Bitcoin/comments/pj3dnh/i_just_turned_19_and_am_officially_a_whole_coiner/",
  "subreddit": "Bitcoin",
  "id": "pj3dnh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I know we arent supposed to say stuff like this but I needed to tell somebody.\nRight before covid my parents kicked me out and I lived in my car for little\nunder 2 months. I had about $300 in my pocket at the time. Every day, I would\nwake up early and donate plasma before work and then work 8-12…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんなことを言ってはいけないのはわかっていますが、誰かに話さなければなりませんでした。\nCovidの直前に両親に追い出されて、2ヶ月弱、車の中で暮らしていました。\n2ヶ月弱。その時のポケットマネーは300ドルくらいでした。毎日、私は\n毎日、早起きして仕事の前に血漿を提供し、8～12時間働いて......。",
      "title": "19歳になったばかりで、正式にホールコーターになりました。まだ信じられません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道我们不应该说这样的事情，但我需要告诉别人。\n就在科维德之前，我的父母把我赶了出来，我在自己的车里住了不到两个月。\n不到两个月。当时我的口袋里有大约300美元。每一天，我都会\n早晨起来，在工作前捐献血浆，然后工作8至12小时......",
      "title": "我刚刚年满19岁，正式成为一个完整的投币者！我仍然不敢相信。仍然不敢相信。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道我們不應該說這樣的事情，但我需要告訴別人。\n就在科維德之前，我的父母把我趕了出來，我在自己的車裏住了不到兩個月。\n不到兩個月。當時我的口袋裏有大約300美元。每一天，我都會\n早晨起來，在工作前捐獻血漿，然後工作8至12小時......",
      "title": "我剛剛年滿19歲，正式成爲一個完整的投幣者！我仍然不敢相信。仍然不敢相信。"
    }
  ]
}