{
  "author": "MinnesotaPower",
  "the_new_excerpt": "I made a graphic showing every time the NASDAQ pulled back from previous highs\nand stayed down longer than three months since 2007. I hope it's acceptable to\npost an image like this.\n\nhttps://i.imgur.com/eDnQEp8.jpg\n\nI defined pullback as any drop that did not sustain a recovery for at least a\nweek…",
  "original_created_utc": 1620752388,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2007年以降、ナスダックが過去の高値から後退し、3ヶ月以上下落した時の様子を図にしてみました。\n2007年以降、ナスダックが過去の高値から後退し、3ヶ月以上下落し続けたことを示す図を作成しました。このような画像を掲載してもいいのでしょうか？\nこのような画像を投稿してもよいと思います。\n\nhttps://i.imgur.com/eDnQEp8.jpg\n\n私はプルバックを、少なくとも1週間は回復を維持しなかった下落と定義しました。\nと定義しています。",
      "title": "2007年以降、3ヶ月以上続いたすべてのNASDAQのプルバック"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我做了一个图形，显示纳斯达克指数每次从以前的高点回撤的情况\n并且自2007年以来保持下跌超过三个月的时间。我希望能接受\n发布这样的图片。\n\nhttps://i.imgur.com/eDnQEp8.jpg\n\n我把回撤定义为任何没有持续恢复的下跌，至少在一个星期内\n一周的下跌...。",
      "title": "自2007年以来，纳斯达克每一次持续超过三个月的回撤都是如此"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我做了一個圖形，顯示納斯達克指數每次從以前的高點回撤的情況\n並且自2007年以來保持下跌超過三個月的時間。我希望能接受\n發佈這樣的圖片。\n\nhttps://i.imgur.com/eDnQEp8.jpg\n\n我把回撤定義爲任何沒有持續恢復的下跌，至少在一個星期內\n一週的下跌...。",
      "title": "自2007年以來，納斯達克每一次持續超過三個月的回撤都是如此"
    }
  ],
  "title": "Every NASDAQ pullback lasting longer than three months since 2007",
  "created_utc": 1620762299,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I made a graphic showing every time the NASDAQ pulled back from previous highs and stayed down longer than three months since 2007. I hope it&#39;s acceptable to post an image like this. </p>\n\n<p><a href=\"https://i.imgur.com/eDnQEp8.jpg\">https://i.imgur.com/eDnQEp8.jpg</a></p>\n\n<p>I defined pullback as any drop that did not sustain a recovery for at least a week within a three month time frame. (Note the NASDAQ reached new highs in March 2018 and April 2021 but immediately fell again after 1–3 days.)</p>\n\n<p>I think this helps put the recent rotation out of growth/tech into context. Since 2007, the NASDAQ has recovered nicely from every single pullback – eventually.</p>\n</div><!-- SC_ON -->",
  "score": 206,
  "permalink": "/r/stocks/comments/na1qvf/every_nasdaq_pullback_lasting_longer_than_three/",
  "subreddit": "stocks",
  "id": "na1qvf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985996882
}