{
  "author": "CaptainWelfare",
  "the_new_excerpt": "So everyone probably has a coin jar or box or storage bin or whatever. Who\ndoesn’t like having that little bit of surprise money sitting around? (It’s\nestimated that there is BILLIONS of dollars in change in couches, cars, jars etc\naround the US.)\n\nI work in retail, and having not been able to get a…",
  "original_created_utc": 1624066185,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "だから、みんなコイン入れとか箱とか収納箱とか持ってるんじゃない？誰もが\nちょっとしたサプライズのお金を置いておくのが嫌いな人はいないでしょう。(それは\nアメリカのソファや車、瓶などには何十億ドルもの小銭があると言われています)\nアメリカでは何億ドルもの小銭がソファや車、瓶などに入っていると言われています)。\n\n私は小売業で働いているのですが、これまでは、小銭を手に入れることができませんでした。",
      "title": "コインジャーの誤謬、そしてなぜあなたは早急に自分のコインジャーを処分すべきなのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，每个人可能都有一个硬币罐或盒子或储存箱或其他东西。谁\n谁不喜欢有那么一点点惊喜的钱放在身边？(据估计\n据估计，在美国各地的沙发、汽车、罐子等地方，有数十亿美元的零钱。\n美国各地）。)\n\n我在零售业工作，由于无法得到一个...",
      "title": "硬币罐的谬误，以及为什么你应该尽快摆脱你的硬币罐。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，每個人可能都有一個硬幣罐或盒子或儲存箱或其他東西。誰\n誰不喜歡有那麼一點點驚喜的錢放在身邊？(據估計\n據估計，在美國各地的沙發、汽車、罐子等地方，有數十億美元的零錢。\n美國各地）。)\n\n我在零售業工作，由於無法得到一個...",
      "title": "硬幣罐的謬誤，以及爲什麼你應該儘快擺脫你的硬幣罐。"
    }
  ],
  "title": "The coin jar fallacy, and why you should get rid of yours ASAP.",
  "created_utc": 1624084419,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So everyone probably has a coin jar or box or storage bin or whatever.  Who doesn’t like having that little bit of surprise money sitting around? (It’s estimated that there is BILLIONS of dollars in change in couches, cars, jars etc around the US.)</p>\n\n<p>I work in retail, and having not been able to get a box of coins in weeks due to the second pandemic shortage, I tried to convince my wife to trade in the office cooler jug of change we’ve been adding to forever, mostly because it would help my store.</p>\n\n<p>“No!” She says, that’s our free vacation money!”  </p>\n\n<p>“But honey, I’ve been putting quarters in there for over fifteen years.  They’re worth practically half of what they were 15 years ago.”  </p>\n\n<h1>Damn</h1>\n\n<p>“You just want to use it to buy more crypto!”</p>\n\n<p>And there it is.  She’s half right, of course.  Part of me wants to invest in anything besides holding US debt in a jar and watching it slowly erode.  </p>\n\n<p>Look, I’m not saying turn your real coins into virtual ones, but, had I gotten rid of said barrel last bear market and dumped it into BTC or ETH, those devaluing coins would be worth a hell of a lot more now.  Hell I could have done so six months ago and still made a killing!</p>\n\n<p>Listen crypto fam, I’m a widower.  My late wife helped me fill that jar for years, and we never got to use it as our secret vacation jar, even though it was our plan too.  The government and inflation is going to destroy what you save.  Either invest it in crypto (or something safer if you have little risk appetite,) or go on the goddamn vacation.  This jar of coins is mocking me.</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/o357is/the_coin_jar_fallacy_and_why_you_should_get_rid/",
  "subreddit": "CryptoCurrency",
  "id": "o357is",
  "is_self": true,
  "media": null,
  "is_video": false
}