{
  "author": "In-Evidable",
  "original_created_utc": 1632161123,
  "title": "I Sold Everything Today",
  "created_utc": 1632166505,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I don&#39;t know how this Evergrande situation is going to effect the crypto market any more than it has, but what I do know is that as of right now, the money I&#39;ve invested into crypto over the past year has grown enough to pay off my student loans once and for all.</p>\n\n<p>If this turns into an actual crash, I may change my mind and buy back in. But for now I&#39;m going to stick to fulfilling the goal I set out to achieve when I started investing.</p>\n\n<p>I want to thank you guys. Even though this subreddit acts rather schizophrenic, all of my &quot;good&quot; trading ideas came from reading the comments. I&#39;m gonna continue to DCA my way back in, but now with a lot less bills.</p>\n</div><!-- SC_ON -->",
  "score": 415,
  "permalink": "/r/CryptoCurrency/comments/ps09pl/i_sold_everything_today/",
  "subreddit": "CryptoCurrency",
  "id": "ps09pl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I don't know how this Evergrande situation is going to effect the crypto market\nany more than it has, but what I do know is that as of right now, the money I've\ninvested into crypto over the past year has grown enough to pay off my student\nloans once and for all.\n\nIf this turns into an actual crash,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このEvergrandeの状況が、これまで以上に暗号市場に影響を与えるかどうかはわかりません。\nしかし、私が知っているのは、今現在、私が投資した資金は、このようにして\nこの1年で暗号に投資したお金は、私の学生ローンを完済できるほどに成長しました。\nこれで学生ローンを完済できます。\n\nもしこれが実際の暴落になったら...。",
      "title": "今日はすべてを売った"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不知道恒大的情况将如何影响加密货币市场\n但我知道的是，截至目前，我在过去一年中投资于加密货币的资金已经增长到足以偿还我的学生费用。\n在过去的一年里，我投资到加密货币的钱已经增长到足以偿还我的学生贷款。\n一劳永逸地偿还我的学生贷款。\n\n如果这变成了一场真正的崩溃，...",
      "title": "我今天卖掉了所有东西"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不知道恆大的情況將如何影響加密貨幣市場\n但我知道的是，截至目前，我在過去一年中投資於加密貨幣的資金已經增長到足以償還我的學生費用。\n在過去的一年裏，我投資到加密貨幣的錢已經增長到足以償還我的學生貸款。\n一勞永逸地償還我的學生貸款。\n\n如果這變成了一場真正的崩潰，...",
      "title": "我今天賣掉了所有東西"
    }
  ]
}