{
  "author": "Sandrokz",
  "the_new_excerpt": "You have 51M followers on Twitter and you are seen as one of the most inspiring\nheroes of this century. People trust you and see you as a leader. But with the\nFOMO you are generating on Doge (and the related pump) you are gonna hurt A LOT\nof people and this is no good for the crypto world. This is…",
  "original_created_utc": 1618574303,
  "localize": [
    {
      "locale": "ja",
      "title": "イーロン・マスク、もしあなたがこれを読んでいるなら、自分が何をしているのか理解してください。",
      "the_new_excerpt": "Twitterのフォロワーは5,100万人、最も刺激的な人物の一人と見なされています。\n今世紀のヒーローです。人々はあなたを信頼し、リーダーとして見ています。しかし\nあなたがDoge（と関連するポンプ）で引き起こしているFOMOは、多くの人を傷つけそうです。\nこれは暗号の世界にとって良いことではありません。これは..."
    },
    {
      "locale": "zh",
      "title": "埃隆-马斯克，如果你在读这篇文章，请明白你在做什么。",
      "the_new_excerpt": "你在推特上有5100万粉丝，你被认为是最鼓舞人心的英雄之一。\n的英雄之一。人们信任你，视你为领袖。但随着\n你在Doge上产生的FOMO（以及相关的泵），你将会伤害很多人，这对加密货币没有好处。\n的人，这对加密货币世界没有好处。这就是..."
    },
    {
      "locale": "zh-Hant",
      "title": "埃隆-馬斯克，如果你在讀這篇文章，請明白你在做什麼。",
      "the_new_excerpt": "你在推特上有5100萬粉絲，你被認爲是最鼓舞人心的英雄之一。\n的英雄之一。人們信任你，視你爲領袖。但隨着\n你在Doge上產生的FOMO（以及相關的泵），你將會傷害很多人，這對加密貨幣沒有好處。\n的人，這對加密貨幣世界沒有好處。這就是..."
    }
  ],
  "title": "Elon Musk, if you are reading this, please understand what you are doing",
  "created_utc": 1618583433,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>You have 51M followers on Twitter and you are seen as one of the most inspiring heroes of this century. People trust you and see you as a leader. But with the FOMO you are generating on Doge (and the related pump) you are gonna hurt A LOT of people and this is no good for the crypto world. This is no good for the people who are creating the future of the FinTech. This is no good for our visibility.</p>\n\n<p>Let’s be honest here, “dumb money” and new retail investors are approaching the crypto world with doge right now, putting there their money and I’m afraid also their life savings. New joiners have no clue of how mean can be volatility, especially on a coin like this. They don’t know what to do, they don’t have an exit strategy. They just see green, +200% and your tweets. They are gonna lose money, blame crypto and flag it as a scam. Once again. Please, know what you are doing.</p>\n\n<p>Doge army is gonna downvote like crazy, but I’m pretty sure I’m not the only one being worried about this.</p>\n\n<p>Update: small edits, typos</p>\n</div><!-- SC_ON -->",
  "score": 10592,
  "permalink": "/r/CryptoCurrency/comments/ms1man/elon_musk_if_you_are_reading_this_please/",
  "subreddit": "CryptoCurrency",
  "id": "ms1man",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171517801
}