{
  "author": "Affectionate-Fact-34",
  "original_created_utc": 1660780622,
  "title": "Sanity check: would someone want to live in my basement in exchange for some chores, or am I delusional?",
  "created_utc": 1660812625,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have this vague idea that there’s an arrangement that’s mutually beneficial. There are only 2 of us plus two 20lb dogs living in a 4200 square foot house with a 1600 sqft finished walk out basement that includes a full bath and kitchenette (sink, counter, microwave, fridge but no oven).&lt;/p&gt;\n\n&lt;p&gt;Do you think someone (either 1 person or a small family) would be willing to live down there in exchange for daily dog walking and twice-monthly house cleaning? Or am I nuts?&lt;/p&gt;\n\n&lt;p&gt;This is not an ad.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/NoStupidQuestions/comments/wr46bv/sanity_check_would_someone_want_to_live_in_my/",
  "subreddit": "NoStupidQuestions",
  "id": "wr46bv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I have this vague idea that there’s an arrangement that’s mutually beneficial.\nThere are only 2 of us plus two 20lb dogs living in a 4200 square foot house\nwith a 1600 sqft finished walk out basement that includes a full bath and\nkitchenette (sink, counter, microwave, fridge but no oven).\n\nDo you…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "お互いにメリットのある取り決めがあるのではと、漠然と考えています。\n4200平方フィートの家に住んでいるのは、私たち2人と20ポンドの犬2匹だけです。\n1600平方フィートの完成したウォークアウト地下室があり、そこにはフルバスと\nシンク、カウンター、電子レンジ、冷蔵庫はあるがオーブンはない）。\n\nあなたは...",
      "title": "正気度チェック：雑用と引き換えに誰かが私の地下室に住みたがるだろうか、それとも私の妄想だろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我有个模糊的想法，就是有一个对双方都有利的安排。\n我们只有两个人，加上两只20磅重的狗，住在一个4200平方英尺的房子里。\n有一个1600平方英尺的成品地下室，包括一个完整的浴室和\n小厨房（水槽、柜台、微波炉、冰箱但没有烤箱）。\n\n你是否...",
      "title": "理智检查：有人愿意住在我的地下室以换取一些家务，还是我有妄想症？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我有個模糊的想法，就是有一個對雙方都有利的安排。\n我們只有兩個人，加上兩隻20磅重的狗，住在一個4200平方英尺的房子裏。\n有一個1600平方英尺的成品地下室，包括一個完整的浴室和\n小廚房（水槽、櫃檯、微波爐、冰箱但沒有烤箱）。\n\n你是否...",
      "title": "理智檢查：有人願意住在我的地下室以換取一些家務，還是我有妄想症？"
    }
  ]
}