{
  "author": "theyfoundDNAinme",
  "original_created_utc": 1629299896,
  "title": "Finally cashed out the remainder of my Robinhood acount and it feels so good",
  "created_utc": 1629322242,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Made my first few trades using RH before DMOR and have been slowly selling and rebuying on a better exchange for the past feew months. Today I finally zeroed out my account. </p>\n\n<p>Feels really good to finally delete the app from my phone. So long, Little Green Feather icon. </p>\n\n<p>If you&#39;re still using RH, I strongly recommend creating a plan to GTFO. There are so many better options out there.</p>\n</div><!-- SC_ON -->",
  "score": 164,
  "permalink": "/r/CryptoCurrency/comments/p6t9cu/finally_cashed_out_the_remainder_of_my_robinhood/",
  "subreddit": "CryptoCurrency",
  "id": "p6t9cu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Made my first few trades using RH before DMOR and have been slowly selling and\nrebuying on a better exchange for the past feew months. Today I finally zeroed\nout my account.\n\nFeels really good to finally delete the app from my phone. So long, Little Green\nFeather icon.\n\nIf you're still using RH, I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "DMORの前にRHを使って最初の数回の取引を行い、この数ヶ月間、より良い取引所でゆっくりと売っては買い直してきました。\nこの数ヶ月間、より良い取引所で売り買いを繰り返しています。今日、私はついに口座をゼロにしました。\n今日、ついに自分のアカウントをゼロにしました。\n\n最終的に携帯電話からアプリを削除するのはとても良い気分です。さようなら、リトル・グリーン\n羽根のアイコンです。\n\nもしまだRHを使っているなら、私は...",
      "title": "ついにRobinhoodのアカウントの残りを現金化しました！とてもいい気分です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在DMOR之前，我用RH做了最初的几笔交易，并一直在慢慢地卖出和回购。\n在过去的几个月里，我一直在一个更好的交易所里重新购买。今天我终于把\n了我的账户。\n\n最后从我的手机上删除这个应用程序的感觉真的很好。再见了，小绿\n羽毛图标。\n\n如果你还在使用RH，我...",
      "title": "终于把我Robinhood账户的剩余部分兑现了，感觉真好。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在DMOR之前，我用RH做了最初的幾筆交易，並一直在慢慢地賣出和回購。\n在過去的幾個月裏，我一直在一個更好的交易所裏重新購買。今天我終於把\n了我的賬戶。\n\n最後從我的手機上刪除這個應用程序的感覺真的很好。再見了，小綠\n羽毛圖標。\n\n如果你還在使用RH，我...",
      "title": "終於把我Robinhood賬戶的剩餘部分兌現了，感覺真好。"
    }
  ]
}