{
  "author": "crucifixioncruise",
  "original_created_utc": 1635652059,
  "title": "What is this intense, painful feeling?",
  "created_utc": 1635693869,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m 24, female. Can’t quite put my finger on what I’m feeling or what the feeling might be called. I’ve rarely if ever experienced this before tonight. </p>\n\n<p>Basically, I was reading this self help article and suddenly I felt horrible about myself and then extremely agitated in this intense weird way that would not go away!</p>\n\n<p>But I can’t pinpoint what exactly I was feeling. The best I can explain it is that it’s like a kind of rage, but it’s not directed at anyone or anything. I want to hit things. Crawl out of my skin. My body is extremely tense. I can barely tolerate my mom’s friendly questions from the kitchen. I want to scream at her for asking if I want soup but I know I can’t. </p>\n\n<p>It’s not justified or righteous anger. I’m not even annoyed at anyone FOR anything. Just them bring them makes me irrationally rageful.</p>\n\n<p>Edit: this is some of the parts from the advice column that hurt the most. </p>\n\n<p>“That Guy was never going to give me the time of day. He mattered too much to me; he could feel it. And also, honestly, he was into women who had <em>better things to do with their time than hang on his every word.</em>” (My reaction: everyone can sense that I’m pathetic, I have nothing better to do, most other women are better people and this more attractive) </p>\n\n<p>“He also had lots of projects, lots of adventures, lots of pressing shit to do. <em>I was too busy daydreaming and feeling rejected. But he was busy doing things that felt important to him.</em> Focusing on something outside of yourself is hot. It’s hot to work that hard.” (My reaction: I’m pathetic and not worthy, no one could like someone like that, like me)</p>\n\n<p>“You need to focus all this swirling, intense, imaginative mind-fuckery into something bold and bright and <em>useful.</em>” (My reaction: I am useless, I bring nothing into the world, have no value, waste of space) </p>\n\n<p>“<em>You can’t become a full person</em> until you learn to turn off the <em>pretty fantasies</em> in your brain.” (My reaction: I’m not a full person) </p>\n\n<p>“<em>You can’t hang out with people and have a good time until you show them respect.</em> That means you have to <em>stop putting yourself at the center of every picture.</em> (My reaction: I don’t respect people, I put myself at the center of every picture.)</p>\n\n<p>“That means you have to appreciate pictures even when you’re not in them. <em>Once you care about yourself, you’ll have room to care about other people</em> — <em>as human beings</em>, not as mirrors or escape fantasies or ciphers.” (My reaction: I don’t care about other people and can’t until I care about myself, which I worry will not be for a long time; I don’t see others as human beings)</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/NoStupidQuestions/comments/qjhfc5/what_is_this_intense_painful_feeling/",
  "subreddit": "NoStupidQuestions",
  "id": "qjhfc5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m 24, female. Can’t quite put my finger on what I’m feeling or what the\nfeeling might be called. I’ve rarely if ever experienced this before tonight.\n\nBasically, I was reading this self help article and suddenly I felt horrible\nabout myself and then extremely agitated in this intense weird way…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "24歳、女性です。何を感じているのか、その感覚が何と呼ばれているのか、よくわかりません。\n感じているのか、何と呼ばれているのかわからない。今までこのような経験をしたことはほとんどありませんでした。\n\n基本的に、私はこの自己啓発記事を読んでいて、突然、自分自身について恐ろしく感じました。\n自分のことが恐ろしくなって、強烈に変な方向に興奮して...。",
      "title": "この強烈な痛みは何だろう？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我24岁，女性。我不太清楚自己的感觉，也不知道是什么原因。\n这种感觉可能被称为。在今晚之前，我很少有这种经历。\n\n基本上，我正在读这篇自我帮助的文章，突然间我觉得自己很糟糕，然后在这种强烈的焦虑中极度激动。\n对自己的感觉，然后非常激动，以这种强烈的奇怪方式......",
      "title": "这种强烈、痛苦的感觉是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我24歲，女性。我不太清楚自己的感覺，也不知道是什麼原因。\n這種感覺可能被稱爲。在今晚之前，我很少有這種經歷。\n\n基本上，我正在讀這篇自我幫助的文章，突然間我覺得自己很糟糕，然後在這種強烈的焦慮中極度激動。\n對自己的感覺，然後非常激動，以這種強烈的奇怪方式......",
      "title": "這種強烈、痛苦的感覺是什麼？"
    }
  ]
}