{
  "author": "Virralla",
  "the_new_excerpt": "Background\n\nOften in history, after a state has grown so powerful that it takes a coalition\nof other great powers to defeat it, these victorious powers will then decide to\ntake away territories from the former either as spoils of war or to stop it from\nbecoming a threat once more. (Of course, these…",
  "original_created_utc": 1621855647,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "背景\n\n歴史上、ある国家が強大化し、他の大国と連合して敗北した後に、勝利した大国が\n大国の連合によって敗北した後、勝利した大国は、戦利品として、あるいはその大国の\n戦利品として、あるいは再び脅威となるのを防ぐために、かつての国家から領土を奪うことになる。\n脅威となることを防ぐために。(もちろん、これらの...",
      "title": "ワーテルローの敗北（1815年）後、なぜフランスは縮小されなかったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "背景介绍\n\n在历史上，当一个国家变得如此强大，以至于需要一个由其他大国组成的联盟来打败它时，这些胜利的国家往往会决定\n的时候，这些战胜国就会决定夺取前者的领土，作为战利品或阻止其发展。\n夺取前者的领土，作为战利品或阻止其再次成为威胁。\n以阻止它再次成为威胁。(当然，这些...",
      "title": "为什么法国在滑铁卢战役（1815年）失败后没有缩小规模？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "背景介紹\n\n在歷史上，當一個國家變得如此強大，以至於需要一個由其他大國組成的聯盟來打敗它時，這些勝利的國家往往會決定\n的時候，這些戰勝國就會決定奪取前者的領土，作爲戰利品或阻止其發展。\n奪取前者的領土，作爲戰利品或阻止其再次成爲威脅。\n以阻止它再次成爲威脅。(當然，這些...",
      "title": "爲什麼法國在滑鐵盧戰役（1815年）失敗後沒有縮小規模？"
    }
  ],
  "title": "Why was France not reduced in size after the defeat at Waterloo (1815)?",
  "created_utc": 1621870381,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Background</p>\n\n<p>Often in history, after a state has grown so powerful that it takes a coalition of other great powers to defeat it, these victorious powers will then decide to take away territories from the former either as spoils of war or to stop it from becoming a threat once more. (Of course, these motives can be combined.) I would think this is done primarily out of national self-interest, but of course there may also be an element of revenge and retribution involved.</p>\n\n<p>This has happened to Germany twice, in 1918 and in 1945, when Germany had to give up, in 1918, Alsace-Lorraine to France, Eupen-Malmedy to Belgium, and the province of Posen to Poland, and, in 1945, when it had to cede all the territories East of the Oder-Neisse line to Poland, Lithuania, Latvia, the Czech Republic and the Soviet Union.</p>\n\n<p>Question</p>\n\n<p>Now, my <strong>question</strong> is, how did France stay so large after being decisively beaten at Waterloo in 1815 by the Prussians, Dutch, and British? Surely, by that stage it was clear that France, with its vast population (30 million) and formidable military, had not lost its potential military advantage over its continental rivals? It would take another 60 years for Prussia/Germany to equal and surpass France as a great power.</p>\n\n<p>To make this more concrete, why were sizeable chunks of France not given to neighbouring countries? For example, why was Alsace-Lorraine not returned to some German kingdom, such as Baden or Wurttemberg, or Prussia or Bavaria? Or why not to Austria? And why was French Flanders not given to the newly formed United Kingdom of the Netherlands? And then I could go on for a while: why was the French Basque country not ceded, or the area around Perpignan given to Spain. Or most symbolically of all, why were Savoy and Corsica not given back to some Italian state, like Piedmont?</p>\n\n<p>To be sure, I know that the United Kingdom of the Netherlands was formed to act as a sort of moderately powerful buffer-state that would be able to resist France if it came to that. So, clearly, there was some fear among the other European powers that France would have a go at them again.</p>\n\n<p>&#x200B;</p>\n\n<p>I&#39;m curious to hear what the experts think!</p>\n</div><!-- SC_ON -->",
  "score": 172,
  "permalink": "/r/AskHistorians/comments/njvqna/why_was_france_not_reduced_in_size_after_the/",
  "subreddit": "AskHistorians",
  "id": "njvqna",
  "is_self": true,
  "media": null,
  "is_video": false
}