{
  "author": "LGBTMushroom",
  "original_created_utc": 1645965616,
  "title": "Why is autism seen as a 'children's disability'? Why don't autistic adults get nearly as much representation in autism resources than children?",
  "created_utc": 1645978272,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As an autistic adult, I find it hard for people to take me seriously. I still need help with some things and I&amp;#39;m working towards becoming more independent over time. But before I found the support I need it was quite hard because there&amp;#39;s way more resources available for autistic children than adults. &lt;/p&gt;\n\n&lt;p&gt;If you look up autism on Google Images, you have to scroll pretty far to find a picture of an autistic adult. Even all the first results for websites have only images of children in their articles. It&amp;#39;s pretty clear that when someone thinks of autism, the first thing they think of is children.&lt;/p&gt;\n\n&lt;p&gt;So, what&amp;#39;s with the lack of the representation for autistic adults? A lot of them can&amp;#39;t get the support they need because the only support in their area is specific towards children&amp;#39;s needs. It&amp;#39;s not even uncommon to believe that autism goes away with age, unless you&amp;#39;re &amp;#39;low functioning&amp;#39; enough. Even though that&amp;#39;s impossible, you cannot grow out of autism no matter where you are on the spectrum, people still believe that myth.&lt;/p&gt;\n\n&lt;p&gt;Is it because as we age we gain more life skills and appear to &amp;#39;grow out&amp;#39; of autism? And therefore children need more support than adults? But many adults still need support, why is it so hard for them to get it, especially if they can mask well or appear &amp;#39;high functioning&amp;#39;?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/NoStupidQuestions/comments/t2neig/why_is_autism_seen_as_a_childrens_disability_why/",
  "subreddit": "NoStupidQuestions",
  "id": "t2neig",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "As an autistic adult, I find it hard for people to take me seriously. I still\nneed help with some things and I'm working towards becoming more independent\nover time. But before I found the support I need it was quite hard because\nthere's way more resources available for autistic children than…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "自閉的な大人である私は、人からなかなか相手にされないと思います。私はまだ\n自立を目指す。\nを、時間をかけて行う。しかし、私が必要なサポートを見つけるまでは、とても大変でした。\n自閉症児の方が、より多くのリソースを利用できるんです。",
      "title": "なぜ自閉症は「子どもの障害」とみなされるのか？なぜ自閉症の大人は、自閉症に関する資料で子供とほぼ同じ表現がないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "作为一个自闭症成年人，我发现人们很难认真对待我。我仍然\n我在一些事情上仍然需要帮助，我正在努力使自己变得更加独立\n随着时间的推移。但在我找到我需要的支持之前，这相当困难，因为\n为自闭症儿童提供的资源远远多于......",
      "title": "为什么自闭症被视为 \"儿童的残疾\"？为什么成人自闭症患者在自闭症资源中的代表性不如儿童多？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "作爲一個自閉症成年人，我發現人們很難認真對待我。我仍然\n我在一些事情上仍然需要幫助，我正在努力使自己變得更加獨立\n隨着時間的推移。但在我找到我需要的支持之前，這相當困難，因爲\n爲自閉症兒童提供的資源遠遠多於......",
      "title": "爲什麼自閉症被視爲 \"兒童的殘疾\"？爲什麼成人自閉症患者在自閉症資源中的代表性不如兒童多？"
    }
  ]
}