{
  "author": "No-Application-9114",
  "original_created_utc": 1652965479,
  "title": "How do I get my attention span back?",
  "created_utc": 1652981184,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For the past 2 years, I noticed a severe deterioration in my attention span. I used to binge watch TV shows, movies, and listen to hours of podcasts. These days I notice myself reaching for my phone 2-3 minutes into a video/podcast. If I didn&amp;#39;t have my phone, I would switch between videos rapidly every 2-3 minutes. There are so many things I&amp;#39;m interested in watching, but suddenly everything seems to get boring very quickly. &lt;/p&gt;\n\n&lt;p&gt;How do I &amp;#39;hack&amp;#39; my brain to restore my attention span? Is there some sort of detox I have to do?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 217,
  "permalink": "/r/NoStupidQuestions/comments/ut2zpl/how_do_i_get_my_attention_span_back/",
  "subreddit": "NoStupidQuestions",
  "id": "ut2zpl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "For the past 2 years, I noticed a severe deterioration in my attention span. I\nused to binge watch TV shows, movies, and listen to hours of podcasts. These\ndays I notice myself reaching for my phone 2-3 minutes into a video/podcast. If\nI didn't have my phone, I would switch between videos rapidly…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2年前から、注意力が著しく低下していることに気づきました。I\nテレビ番組や映画を夢中で見たり、ポッドキャストを何時間も聴いたりしていました。しかし、最近は\n最近は、ビデオやポッドキャストを始めて2〜3分で携帯電話に手が伸びるようになりました。もし\n携帯電話を持っていなかったら、ビデオをどんどん切り替えていたでしょう...。",
      "title": "どうすれば注意力を取り戻せるか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在过去的两年里，我注意到我的注意力严重下降了。I\n我曾经狂热地观看电视节目、电影，并听了几个小时的播客。这些天\n现在，我注意到自己在观看视频/播客的2-3分钟后就会伸手去拿手机。如果\n如果我没有手机，我就会在视频之间快速切换......",
      "title": "我怎样才能恢复我的注意力？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在過去的兩年裏，我注意到我的注意力嚴重下降了。I\n我曾經狂熱地觀看電視節目、電影，並聽了幾個小時的播客。這些天\n現在，我注意到自己在觀看視頻/播客的2-3分鐘後就會伸手去拿手機。如果\n如果我沒有手機，我就會在視頻之間快速切換......",
      "title": "我怎樣才能恢復我的注意力？"
    }
  ]
}