{
  "author": "flobbley",
  "the_new_excerpt": "I've seen a ton of posts recently from new investors asking how they should get\nstarted in investing along with a lot of posts from people who have just gotten\ninto the stock market, lost a lot of money and are now panicking. As such I\nfigured I'd just make a quick post to recommend what I feel is…",
  "original_created_utc": 1620315489,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、投資を始めたばかりの人が、どうやって投資を始めればいいのかという投稿をたくさん見ました。\nまた、株式市場に参入したばかりの人が、大損してパニックになっているという投稿も多く見られます。\nまた、株式市場に参入して大損し、パニックに陥っている人の投稿も多く見られます。そのため、私は\n私が感じたことをお勧めするために、ちょっとした投稿をしてみようと思いました。",
      "title": "どのように投資を始めるべきか"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近看到很多新投资者的帖子，询问他们应该如何开始投资，以及很多刚开始投资的人的帖子。\n的帖子，以及很多刚刚进入股市的人的帖子。\n进入股市，损失了很多钱，现在很恐慌。因此，我\n想到我只是发了一个快速的帖子，推荐我认为是......",
      "title": "你应该如何开始投资"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近看到很多新投資者的帖子，詢問他們應該如何開始投資，以及很多剛開始投資的人的帖子。\n的帖子，以及很多剛剛進入股市的人的帖子。\n進入股市，損失了很多錢，現在很恐慌。因此，我\n想到我只是發了一個快速的帖子，推薦我認爲是......",
      "title": "你應該如何開始投資"
    }
  ],
  "title": "How you should start with investing",
  "created_utc": 1620340366,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve seen a ton of posts recently from new investors asking how they should get started in investing along with a lot of posts from people who have just gotten into the stock market, lost a lot of money and are now panicking. As such I figured I&#39;d just make a quick post to recommend what I feel is the best way to get started in the stock market.</p>\n\n<p><strong>Step 1: Take 90% of your capital that you would like to invest and put it in a total market index fund like VTI or FZROX</strong></p>\n\n<p>You&#39;re new at this, no matter how much research you have done you don&#39;t know what you&#39;re doing and will make mistakes. Putting your money into an index fund will give you good returns along with the security of knowing with 99.999% certainty that if there is a dip it WILL recover (and if it doesn&#39;t you probably have bigger problems to worry about). It will also help you get used to the ups and downs of the market without getting emotional.</p>\n\n<p><strong>Step 2: Start paper trading</strong></p>\n\n<p>Most brokerages offer a &quot;paper trading&quot; account. These are accounts where you invest with fake money and can track how you would have done with these investments. I know you&#39;re excited and want to start investing now so you can make money, but you&#39;re new and will likely fall into one of several common pitfalls of new investors, better to do this with fake money than real money. And besides if you follow step 1 your money <em>is</em> invested and you are getting good returns.</p>\n\n<p><strong>Step 3*: Start using your 10% cash to make real stock purchases</strong></p>\n\n<p>Once you do well after a few months to a year of paper trading (it seems like a long time I know but trust me the stock market will still be there when you&#39;re done), take some of your remaining capital and start buying stocks. Real investing is not like paper trading when it comes to your actual money, keep that in mind. You will find yourself panicking for the first time here, that&#39;s fine, remember the vast majority of your money is in a solid investment with little risk and good returns.</p>\n\n<p><strong>Step 4*: Start moving more into stock picks</strong></p>\n\n<p>After a few years of doing well with your 10%, if you feel like you&#39;d rather pick your own stocks over using an index fund then start moving money out of your total market index funds into individual stock picks</p>\n\n<p>And that&#39;s it, that&#39;s (in my opinion) the best way to get started in the stock market. Any additional tips from you guys?</p>\n\n<p>*These steps aren&#39;t actually necessary, you can just leave 100% of your capital in total market index funds and you will be fine, in fact that&#39;s what I would recommend you do but I realize that many people, especially those that come to this subreddit, would rather take their chances and try to outperform the market</p>\n</div><!-- SC_ON -->",
  "score": 78,
  "permalink": "/r/stocks/comments/n6a4a2/how_you_should_start_with_investing/",
  "subreddit": "stocks",
  "id": "n6a4a2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985995609
}