{
  "author": "CryptoBehemoth",
  "original_created_utc": 1630470058,
  "title": "One day Bitcoin will have been online for so long that no one alive on Earth will have lived its debut",
  "created_utc": 1630495893,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>One day it&#39;ll be common knowledge that Satoshi Nakamoto invented Bitcoin in 2008, just like today we all know Einstein discovered general relativity, or that Socrates did, well... Socrates, back in Ancient Greece. But the thing is, there will be no one alive on Earth who can personally claim to have lived it. It&#39;ll have been so lobg ago! There will be people for whom Bitcoin has been generational wealth for decades. How crazy is that?</p>\n</div><!-- SC_ON -->",
  "score": 170,
  "permalink": "/r/Bitcoin/comments/pfmef5/one_day_bitcoin_will_have_been_online_for_so_long/",
  "subreddit": "Bitcoin",
  "id": "pfmef5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "One day it'll be common knowledge that Satoshi Nakamoto invented Bitcoin in\n2008, just like today we all know Einstein discovered general relativity, or\nthat Socrates did, well... Socrates, back in Ancient Greece. But the thing is,\nthere will be no one alive on Earth who can personally claim to have…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2008年にサトシ・ナカモトがビットコインを発明したことは、いつの日か常識になるでしょう。\nアインシュタインが一般相対性理論を発見したことや、ソクラテスが...\nソクラテスがやったことも...。古代ギリシャのソクラテスのように。しかし、重要なのは\n個人的に発明したと言える人は地球上にはいないでしょう。",
      "title": "いつかビットコインが登場してから時間が経ち、地球上の誰もそのデビューを知らない日が来るだろう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "总有一天，人们会知道中本聪在2008年发明了比特币。\n就像今天我们都知道爱因斯坦发现了广义相对论，或\n苏格拉底做了，嗯...。苏格拉底，早在古希腊。但问题是。\n地球上没有一个活着的人可以亲自宣称拥有...",
      "title": "有一天，比特币已经上线很久了，以至于地球上活着的人都没有经历过它的首次亮相。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "總有一天，人們會知道中本聰在2008年發明了比特幣。\n就像今天我們都知道愛因斯坦發現了廣義相對論，或\n蘇格拉底做了，嗯...。蘇格拉底，早在古希臘。但問題是。\n地球上沒有一個活着的人可以親自宣稱擁有...",
      "title": "有一天，比特幣已經上線很久了，以至於地球上活着的人都沒有經歷過它的首次亮相。"
    }
  ]
}