{
  "author": "FortePiano119",
  "original_created_utc": 1638998491,
  "title": "Am I stupid for asking this question?",
  "created_utc": 1639019517,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Today in math class I asked the teacher why a circle is divided into 360 degrees, and why they didn’t make it 100 or 500 or any other number of degrees. He explained that the 3 angles of a triangle always add up to 180 and 180 is half of 360. I said “yes but why 360 degrees?” And the teacher said “because 360 degrees makes a circle!” And the whole class laughed at me. I think they either all misunderstood the question or I am the stupidest person on planet earth and haven’t figured out this obvious issue.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 118,
  "permalink": "/r/NoStupidQuestions/comments/rc1b8v/am_i_stupid_for_asking_this_question/",
  "subreddit": "NoStupidQuestions",
  "id": "rc1b8v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Today in math class I asked the teacher why a circle is divided into 360\ndegrees, and why they didn’t make it 100 or 500 or any other number of degrees.\nHe explained that the 3 angles of a triangle always add up to 180 and 180 is\nhalf of 360. I said “yes but why 360 degrees?” And the teacher said…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日、数学の授業で先生に「なぜ円は360に分割されるのですか？\nなぜ、100度とか500度とか、他の度数にしないのか。\n三角形の3つの角は必ず180になり、180は3つの角の合計であることを説明した。\n360の半分です。私は \"そうだけど、なぜ360度なの？\"と言いました。すると先生は",
      "title": "この質問をした私はバカですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今天在数学课上，我问老师，为什么一个圆被分成360度？\n为什么他们不把圆分成100度或500度或任何其他度数。\n他解释说，一个三角形的3个角加起来总是180，而180是360的一半。\n360的一半。我说：\"是的，但为什么是360度？\" 然后老师说...",
      "title": "我问这个问题很愚蠢吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天在數學課上，我問老師，爲什麼一個圓被分成360度？\n爲什麼他們不把圓分成100度或500度或任何其他度數。\n他解釋說，一個三角形的3個角加起來總是180，而180是360的一半。\n360的一半。我說：\"是的，但爲什麼是360度？\" 然後老師說...",
      "title": "我問這個問題很愚蠢嗎？"
    }
  ]
}