{
  "author": "yeahyeah2468",
  "the_new_excerpt": "If you had to pick 5 stocks today to hold for the next 5 years, what would you\npick?\n\nI realize these questions come up every now and then on this sub, but the macro\nsituation changes, the companies change, the sentiment continues to change so I\nthink it's important to repeatedly look at this…",
  "original_created_utc": 1618666742,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もし、今後5年間保有するために、今日5つの銘柄を選ぶとしたら、何を選びますか？\n選びますか？\n\nこのような質問は、このサブサイトでも時々出てきますが、マクロの状況が変わり、企業が変わり、センチメントが変わり続けるので\nマクロの状況が変わり、企業が変わり、センティメントが変わり続けているので\n繰り返し見ることが重要だと思います。",
      "title": "今後5年間で選ぶべき5つの銘柄"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果今天让你选5只股票，在未来5年内持有，你会选什么？\n挑？\n\n我意识到这些问题在这个子上时常出现，但宏观的\n形势在变，企业在变，情绪也在不断变化，所以我\n认为重要的是要反复看... ...",
      "title": "未来5年的5只股票选择"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果今天讓你選5只股票，在未來5年內持有，你會選什麼？\n挑？\n\n我意識到這些問題在這個子上時常出現，但宏觀的\n形勢在變，企業在變，情緒也在不斷變化，所以我\n認爲重要的是要反覆看... ...",
      "title": "未來5年的5只股票選擇"
    }
  ],
  "title": "5 stock picks for the next 5 years",
  "created_utc": 1618676099,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If you had to pick 5 stocks <strong>today</strong> to hold for the next <strong>5 years</strong>, what would you pick?</p>\n\n<p>I realize these questions come up every now and then on this sub, but the macro situation changes, the companies change, the sentiment continues to change so I think it&#39;s important to repeatedly look at this question. </p>\n\n<p>I also think the 5 year time period is important because serious gains often require a bit of patience and 5 years seem like a reasonable holding period for growth stocks. </p>\n\n<p>I would choose:</p>\n\n<p>- Tesla</p>\n\n<p>- Square</p>\n\n<p>- SeaLimited</p>\n\n<p>- Roku</p>\n\n<p>- Apple</p>\n</div><!-- SC_ON -->",
  "score": 1070,
  "permalink": "/r/stocks/comments/msqx2g/5_stock_picks_for_the_next_5_years/",
  "subreddit": "stocks",
  "id": "msqx2g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171526132
}