{
  "author": "apan-man",
  "the_new_excerpt": "I was very fortunate to attend a meeting with Abel Avellan during the company\ninvestor roadshow earlier this year. Below are my notes.\n\nA quick introduction on $ASTS:\n\n * AST SpaceMobile is creating the first and only patented-protected,\n   space-based cellular broadband network that can provide…",
  "original_created_utc": 1623925334,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今年の初めに行われた同社の投資家向けロードショーでは、幸運にもAbel Avellan氏とのミーティングに参加することができました。\n投資家向けロードショーに参加することができました。以下は私のメモです。\n\nASTSについて簡単に紹介します。\n\n * AST SpaceMobileは、特許で保護された最初で唯一の宇宙ベースの携帯電話を作っています。\n   宇宙ベースのセルラー・ブロードバンド・ネットワークを構築しています。",
      "title": "$ASTS AST SpaceMobile社CEO Abel Avellan氏とのミーティングのメモ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我非常幸运地在今年早些时候的公司投资者路演中参加了与阿贝尔-阿维兰的会议。\n今年早些时候的投资者路演。以下是我的笔记。\n\n关于$ASTS的快速介绍。\n\n * AST SpaceMobile正在创建第一个也是唯一一个受专利保护的。\n   AST SpaceMobile正在创建第一个也是唯一一个受专利保护的、基于空间的蜂窝式宽带网络，可以提供...",
      "title": "$ASTS 我与AST SpaceMobile首席执行官Abel Avellan的会谈记录"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我非常幸運地在今年早些時候的公司投資者路演中參加了與阿貝爾-阿維蘭的會議。\n今年早些時候的投資者路演。以下是我的筆記。\n\n關於$ASTS的快速介紹。\n\n * AST SpaceMobile正在創建第一個也是唯一一個受專利保護的。\n   AST SpaceMobile正在創建第一個也是唯一一個受專利保護的、基於空間的蜂窩式寬帶網絡，可以提供...",
      "title": "$ASTS 我與AST SpaceMobile首席執行官Abel Avellan的會談記錄"
    }
  ],
  "title": "$ASTS My Notes from Meeting with Abel Avellan, CEO of AST SpaceMobile",
  "created_utc": 1623933416,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was very fortunate to attend a meeting with Abel Avellan during the company investor roadshow earlier this year.  Below are my notes.</p>\n\n<p><strong>A quick introduction on $ASTS:</strong> </p>\n\n<ul>\n<li>AST SpaceMobile is creating the first and only patented-protected, space-based cellular broadband network that can provide coverage across the entire globe.<br/></li>\n<li>The service is compatible with all +5B mobile phones in use today featuring 4G &amp; 5G data speeds with low latency. </li>\n<li>AST is partnering with the world&#39;s largest wireless carriers, like Vodafone and AT&amp;T, which allows it to:\n\n<ul>\n<li>Leverage their low band and mid band spectrum which has great coverage and propagation characteristics </li>\n<li>Access existing network infrastructure to carry voice and data</li>\n<li>Eliminate customer acquisition and service costs by selling to the carrier&#39;s existing subscribers </li>\n<li>Rapidly navigate regulatory processes</li>\n</ul></li>\n<li>Each one of AST&#39;s partners have undertaken significant due diligence in underwriting the technology and in some cases these partners have invested in the company\n\n<ul>\n<li>Investors and Partners: Vodafone, Rakuten, American Tower, Samsung, Cisneros, Bell Canada</li>\n<li>Partners: AT&amp;T, Telefonica, Indosat, Telecom Argentina, Telstra, Tigo, Liberty LatAm</li>\n</ul></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p><strong>My Meeting with Abel Avellan:</strong></p>\n\n<p><strong><em>BlueWalker-3 Deployment:</em></strong></p>\n\n<ul>\n<li>BlueWalker-3 will have the full technology stack implemented\n\n<ul>\n<li>10 meters x 10 meters array and has ability to connect directly to handset and provide streaming, voice, data</li>\n<li>Have tested apps on core networks of Vodafone, AT&amp;T, Rakuten and some other telcos in Africa</li>\n<li>Have interconnectivity with telcos setup and ready for launch</li>\n</ul></li>\n<li>Using two vendors, one is Rakuten’s Altiostar that is the interface with the carrier’s network</li>\n<li>Designed service so AST doesn’t need to modify current mobile phone in any way</li>\n<li>After you get a text message to opt in, your phone takes over and you won’t know if you are connected to a satellite or a tower</li>\n<li>BlueWalker-3 is 1.5 ton satellite the size of a pickup truck\n\n<ul>\n<li>Will be launched this year from Kazakhstan</li>\n<li>The profile of the satellite is very thin, like a table and built in modules</li>\n</ul></li>\n<li>The deployment of BlueWalker-3 is the final production of all the development that has gone into the technology. After the successful launch we will go immediately into producing 20 satellites for first phase of launch</li>\n<li>The biggest risk? I put in context this way. Connecting to a phone from a satellite is nothing new. This has happened for 25 years. Satellite phones are bulky and proprietary. The premise of what we do is that EVERY phone today is part of our market.</li>\n<li>Satellite phone is 1 watt of power and 3DBI of gain and bulky</li>\n<li>An iPhone today is 0.25 watt of power and ½ DBI of gain</li>\n<li>Difference is the satellite phones connect to a satellite that is a couple hundred kilograms, whereas our satellites are 1.5-2 tons and have all the power and gain to connect to a regular handset</li>\n<li>The satellite will fly at 600 kilometers</li>\n<li>The full production satellite will be larger, 20 meters x 20 meters array and will be a little bit heavier</li>\n<li>Building satellite with modules called microns which are elements that form the phase array</li>\n<li>Built the tech ourselves in Israel, but will be outsourcing future production to NEC in Japan - but all the tech is our IP and the final production and assembly will be done in Midland TX</li>\n</ul>\n\n<p><strong><em>Utilizing Wireless Carrier Partner’s Spectrum:</em></strong></p>\n\n<ul>\n<li>We will be using lowband, midband and c-band. We have the ability to tune into any cellular spectrum 700-950mhz, 1700-2200mhz and C-Band</li>\n<li>Our ability to utilize a carrier’s spectrum is software-defined, so we can tune per beam per cell into multiple different bands. So we have total flexibility</li>\n<li>We don’t own the spectrum, we partner with AT&amp;T, Vodafone, Telefonica, American Movil, etc to use their spectrum where it isn’t lit up (used) and then interconnect that spectrum to our gateways via B-Band 45Ghz (satellite backhaul).</li>\n<li>You have a field of view which is the area a satellite can see which is 2,800 kilometers (not sure if this is the right number), within each of the field of view you have cells which is the equivalent to a tower.\n\n<ul>\n<li>So for a satellite you can have 2,800 cells in low band and 10,000 cells in midband</li>\n</ul></li>\n<li>All these cells are in the frequencies that are native to current mobile phones. We don’t want to modify current phones. We want users to be able to access SpaceMobile from responding to a text message</li>\n<li>All the native cellular spectrum is used which then gets translated to the B-Band spectrum down to the gateway where we have eNodeB and rack of equipment that then connect to the carrier’s network</li>\n<li>In the US we only need 2 gateways, but we will be using 3 gateways in carrier neutral locations of American Tower.</li>\n<li>1 East Coast, 1 in Midland and 1 in Hawaii</li>\n</ul>\n\n<p><strong><em>Mobile Users Covered by a Cell:</em></strong></p>\n\n<ul>\n<li>Depends on what spectrum is being used, but it’s between 300 - 10,000 users based on how much overbooking you are putting on the spectrum and what packages you are offering</li>\n<li>Roughly per satellite we can produce 1.6 million gigabytes per month. If you were to allocate 1 gigabyte to each user that’s 1.6 million subscribers.\n\n<ul>\n<li>But in the equatorial areas where we are charging $1 or less, you can multiply those subscribers by 10x. In the US if you’re charging $25/year, then you give people more data.</li>\n<li>High end market is for people moving in and out of connectivity\n\n<ul>\n<li>If you’re in the home you use WiFi</li>\n<li>If you’re in coverage area you use your current carrier plan</li>\n<li>If you move out of coverage you will connect to SpaceMobile. If you’re on a plane or driving to the hamptons or going to a cabin in a remote location, you would connect to SpaceMobile.</li>\n</ul></li>\n<li>The other part of the opportunity is people who don’t have internet or phone\n\n<ul>\n<li>We are starting with this market in the equatorial countries</li>\n</ul></li>\n</ul></li>\n</ul>\n\n<p><strong><em>Working with Vodafone and AT&amp;T:</em></strong></p>\n\n<ul>\n<li>Vodafone is the largest telco in the world outside of China</li>\n<li>640M subscribers and a leader in technology development. They are very progressive in how they think about utilizing new technology</li>\n<li>Vodafone is the largest holder of cellular spectrum on the planet</li>\n<li>I personally financed $7.5M to develop the technology and launched the BW-1 to prove that the technology works</li>\n<li>Then I invited Vodafone to work together\n\n<ul>\n<li>Vodafone has worked closely with me to help design the service from the beginning to ensure that nothing in their network infrastructure would be changed\n\n<ul>\n<li>(Vodafone CTO in March 2020 video said they’ve been working with AST SpaceMobile for 18 months → Mid 2018)</li>\n</ul></li>\n<li>Vodafone spends hundred of billions of dollars every year on their current infrastructure. I want to piggyback their investment and not change anything</li>\n</ul></li>\n<li>Vodafone provided a lot of technical support</li>\n<li>Also provided access to their supply chain which was very important</li>\n<li>Vodafone diligenced AST for over a year</li>\n<li>Vodafone invested in Series B and in the PIPE</li>\n<li>We are very close to Vodafone and they are an ideal partner</li>\n<li>Also American Tower, Samsung useful to have handset guy, and Rakuten Altiostar is very important for us</li>\n<li>Abel also partnered with AT&amp;T in his first company, so he has a great relationship and that’s why he partnered with them now</li>\n</ul>\n\n<p><strong><em>Issues with Latency, Existing Protocols and Noise:</em></strong></p>\n\n<ul>\n<li>These problems are solved by the technology covered by our patent claims. These issues were addressed by our demonstration with BW1</li>\n<li>All the cellular infrastructure is designed to work with a range of 100km. If you go out on a boat, you stop seeing a coast because the earth is curved. The same thing happens with signals. So all the LTE and 5G protocols and every system is designed to sustain 100km of distance.</li>\n<li>Typically you have towers 5-25km from where you are.</li>\n<li>There are two effects: when you have a satellite high up that is moving, you have two effects on the signal = one is doppler and one is delay</li>\n<li>Doppler is the same effect when you see F-1 racing car, when you see it approach and then it’s going away the sound changes</li>\n<li>Satellites have the same issue when it approaches you and it’s going away.</li>\n<li>Cell phones can’t cope with these issues. So we have patents that can deal with doppler and delay without needing to modify current mobile phones. We have patents that also cover how to create kilowatt satellites cost-effectively, we patents for the architecture. We have a family of patents to deal with all these issues.</li>\n<li>One key aspect, all of this technology goes into software that is on the ground and not in the satellite. We want to be completely independent of 3G 4G 5G tech that is used by mobile handset.</li>\n<li>The satellite is like a gigantic mirror relay. The satellite is a beam former and takes those beams from cellular spectrum and translates it down via satellite spectrum to the gateway</li>\n<li>Phased array is very well known technology. Every tower has a phased array and we adapted that to be used in our satellites.</li>\n</ul>\n\n<p><strong><em>What’s the Magic:</em></strong></p>\n\n<ul>\n<li>We have the ability to create a large aperture cost effectively that has sensitivity and power to collect signal from mobile phones. This ability is protocol agnostic whether it’s 3G 4G 5G, that doesn’t change. Building a satellite of this size at an effective cost is a big part of the magic</li>\n<li>The other part of the magic is the software that manages communication from satellite and the mobile phone.</li>\n</ul>\n\n<p><strong><em>Launch Costs:</em></strong></p>\n\n<ul>\n<li>There are many launch providers. US, SpaceX, Astra, Blue Origin, Europeans, Russians (we’re using Soyuz), Indians launched BW1. So many options for launch providers.</li>\n<li>Cost has gone down orders of magnitude. NASA you could pay $30-50k per kg, now it’s order of magnitude less and continues to go down.</li>\n</ul>\n\n<p><strong><em>Selecting Wireless Carrier Partners:</em></strong></p>\n\n<ul>\n<li>Big believer in creating huge barriers entry\n\n<ul>\n<li>1,000 patent claims</li>\n<li>Highly technological approach to solve the problem</li>\n<li>It will take years for competitors to try to catch up with us</li>\n<li>We have patent insurance with Lloyd’s of London → AST pays premium each year and when someone violate patents Lloyd’s utilizes legal resources to pursue</li>\n</ul></li>\n<li>Other barrier of entry, we have 800M subscribers out of 5B in the world under mutual exclusivity which will keep others from trying to enter</li>\n<li>Won’t do anymore of these mutually exclusive deals</li>\n<li>It’s a multi-billion dollar opportunity and market is big enough that other competitors will eventually come\n\n<ul>\n<li>I’m ok with this, but I’m years ahead and I have 20% of market secured with mutual exclusivity</li>\n<li>I will be launching service first and will have experience</li>\n<li>Patents will position us to have 5-10 years of advantage</li>\n</ul></li>\n<li>But market is so big, the focus is delivering the technology and getting service up and running by 2023</li>\n<li>Yes there will be customer (wireless carrier) announcements after the merger closing, but I can’t say when\n\n<ul>\n<li>To give you a sense, it takes 1 telco to add 200M subscribers</li>\n<li>This is great business model - 1 agreement we get millions of subscribers</li>\n</ul></li>\n<li>Future agreements won’t be mutually exclusive, so we will add as many carriers as we can. For example in South America we have 3 out of 4 largest carriers</li>\n<li>AT&amp;T won’t let me disclose everything we’re doing, but they are looking at SpaceMobile to have the same effect as when they had exclusivity with iPhone vs. competition\n\n<ul>\n<li>Just imagine one telco saying you’re phone can work everywhere, on a plane or train vs. competitor</li>\n</ul></li>\n</ul>\n\n<p><strong><em>Competitive Landscape:</em></strong></p>\n\n<ul>\n<li>Lynk is trying to accomplish something similar with $10M of funding, which is very tough\n\n<ul>\n<li>Have not partnered with any wireless carriers to date</li>\n<li>Lynk’s patents reference me in the prior art</li>\n<li>Their approach is using small satellites like what we did with BlueWalker 1\n\n<ul>\n<li>You can’t do broadband or other services with small satellites</li>\n<li>You may be able to send a text message and the receive something back 2 hours later</li>\n</ul></li>\n<li>It’s unclear how you can deliver this solution to customers without working with wireless carriers</li>\n</ul></li>\n<li>Omnispace\n\n<ul>\n<li>Omnispace is a spectrum play</li>\n<li>I know them very well and don’t see them as a direct competitor to AST SpaceMobile</li>\n</ul></li>\n<li>AST SpaceMobile: we are making a play for all the large wireless telco carriers which makes the model work. Everyone else is doing something completely different</li>\n</ul>\n\n<p><strong><em>Milestones / Catalysts:</em></strong></p>\n\n<ul>\n<li>One major milestone obviously is the launch of BW3</li>\n<li>Another major milestone would be increasing the signed access to 1.3B of subscribers to a number that I can’t disclose yet</li>\n<li>There will be service launches and regulatory approvals on a per country basis, many of them in Vodafone markets - many of these coming</li>\n<li>There may be news with some of our technology partners providing non-dilutive financing to support us</li>\n<li>We will start manufacturing of the 20 satellites and I will do a video of the facility that will be coming out</li>\n<li>We will keep the market informed, but I need to keep a balance to not share too much to competitors</li>\n<li>The US Senate passed a bipartisan $9B 5G Fund for Rural America\n\n<ul>\n<li>AST SpaceMobile was part of FCC comment period for the 5G Fund</li>\n<li>I am confident we will get some portion of this fund\n\n<ul>\n<li>For example, SpaceX got $885.5M of the $9.2B RDOF (Rural Digital Opportunity Fund)</li>\n<li>SpaceX is providing Internet to the home, however we are providing connectivity for the mobile handset in rural areas which is important for 5G</li>\n<li>This is the only way for the US to light up 5G across the entire country, especially rural areas</li>\n</ul></li>\n<li>It will be perfect timing as the decision will be made after the launch of BW3, but before the constellation is launch\n\n<ul>\n<li>7 senators writing letters to the FCC in support of AST SpaceMobile</li>\n<li>AT&amp;T is also supporting us</li>\n</ul></li>\n</ul></li>\n<li>We will keep the cadence of the marketing up\n\n<ul>\n<li>Video with Jason Silva is just the beginning</li>\n<li>We will do videos of the facility, satellite launches, etc</li>\n</ul></li>\n<li>We are going to have wonderful research coverage, not only because of interest in our company but also people that are covering our investors/partners American Tower, Vodafone, AT&amp;T - they are all going to be in\n\n<ul>\n<li>I can’t say who will be covering us, but it will be very good coverage</li>\n</ul></li>\n</ul>\n\n<p><strong><em>Final Thoughts:</em></strong></p>\n\n<ul>\n<li>Have all the technology components in place and more than funded now.</li>\n<li>Commercial risks are gone. Will announce many more wireless carrier customers soon.</li>\n<li>This will work, it&#39;s just a matter of time.</li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 144,
  "permalink": "/r/stocks/comments/o1twj3/asts_my_notes_from_meeting_with_abel_avellan_ceo/",
  "subreddit": "stocks",
  "id": "o1twj3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009745311
}