{
  "author": "Revolutionary_Owl670",
  "original_created_utc": 1643340354,
  "title": "As someone who's not from the USA, you all politicize crypto way too much.",
  "created_utc": 1643352035,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;We get it. Your government can potentially **** this up for everyone. &lt;em&gt;Like real bad.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;But is this the place where you need to shill your favourite political party and share the same overused &amp;quot;this party bad, this party good&amp;quot; rhetorics? No. There are so many of us that don&amp;#39;t give an absolute donkey&amp;#39;s ass about why you think one party is better than the other. They are both awful and you&amp;#39;re kidding yourself if you think &lt;strong&gt;either&lt;/strong&gt; of them has you or your favourite crypto&amp;#39;s best interest in mind.&lt;/p&gt;\n\n&lt;p&gt;By all means, it is important that many of these topics within the political sphere are discussed and opposed when they threaten the future of our financial independence, freedom of information, etc.&lt;/p&gt;\n\n&lt;p&gt;But really, it gets old fast when you all inject your political views into things. If you&amp;#39;re going to constantly look for reasons to hate on a political party,  but not actually address the underlying REASONS both parties are equally corrupt when discussing crypto, you&amp;#39;re not helping the issue, you&amp;#39;re &lt;em&gt;part&lt;/em&gt; of it.&lt;/p&gt;\n\n&lt;p&gt;/rant&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 497,
  "permalink": "/r/CryptoCurrency/comments/segxj2/as_someone_whos_not_from_the_usa_you_all/",
  "subreddit": "CryptoCurrency",
  "id": "segxj2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "We get it. Your government can potentially **** this up for everyone. Like real\nbad.\n\nBut is this the place where you need to shill your favourite political party and\nshare the same overused \"this party bad, this party good\" rhetorics? No. There\nare so many of us that don't give an absolute…"
}