{
  "author": "Dwez1337",
  "original_created_utc": 1635437084,
  "title": "YouTuber who promoted Crypto Scam to 75,000 People Live now Complains that No One Watches him Anymore",
  "created_utc": 1635460438,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>YouTuber and streamer Adin Ross has promoted a crypto scam to its viewers for a payment of $200,000</p>\n\n<p>He has promoted this live to 75,000 people</p>\n\n<p>Following being exposed for scamming his viewers, he said this:</p>\n\n<blockquote>\n<p>“that MILF token sh<em>t I did a while back, I already told you guys to not buy that sh</em>t. I got paid a bag to do that sh<em>t. Like I don’t give a f</em>*k, I hope none of you guys actually bought it”</p>\n</blockquote>\n\n<p>Now he is complaining about the dropping number of people who actually watch his content, I wonder why this could be the case?</p>\n\n<p>Stop supporting any crypto content creator (YouTuber/live streamer) who promotes scams, they make millions each year, they are in no position to additionally scam their community</p>\n</div><!-- SC_ON -->",
  "score": 252,
  "permalink": "/r/CryptoCurrency/comments/qhqagm/youtuber_who_promoted_crypto_scam_to_75000_people/",
  "subreddit": "CryptoCurrency",
  "id": "qhqagm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "YouTuber and streamer Adin Ross has promoted a crypto scam to its viewers for a\npayment of $200,000\n\nHe has promoted this live to 75,000 people\n\nFollowing being exposed for scamming his viewers, he said this:\n\n> “that MILF token sht I did a while back, I already told you guys to not buy\n> that sht.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "YouTuberでストリーマーのアディン・ロスは、視聴者に暗号詐欺を宣伝して\n200,000ドルの支払いを求めています。\n\n75,000人に向けてライブで宣伝しました。\n\n視聴者に詐欺を働いたことを暴露された後、彼はこのように述べています。\n\n> 私が少し前に行ったMILFトークンの件ですが、すでに皆さんに買わないように言っています。\n> あの作品....",
      "title": "75,000人に暗号詐欺を宣伝したYouTuberが「もう誰も見てくれない」と不満を漏らす"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "优酷网和流媒体人阿丁-罗斯向其观众宣传了一个加密货币骗局，以获得\n支付200,000美元\n\n他向75,000人直播推广了这一行为\n\n在被曝光骗取观众的行为后，他这样说。\n\n> \"我前段时间做的那个MILF代币的东西，我已经告诉你们不要买了\n>那件事....",
      "title": "向7.5万人直播推广加密货币骗局的优酷网友现在抱怨说，没有人再看他了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "優酷網和流媒體人阿丁-羅斯向其觀衆宣傳了一個加密貨幣騙局，以獲得\n支付200,000美元\n\n他向75,000人直播推廣了這一行爲\n\n在被曝光騙取觀衆的行爲後，他這樣說。\n\n> \"我前段時間做的那個MILF代幣的東西，我已經告訴你們不要買了\n>那件事....",
      "title": "向7.5萬人直播推廣加密貨幣騙局的優酷網友現在抱怨說，沒有人再看他了"
    }
  ]
}