{
  "author": "bloodyvajayjay",
  "original_created_utc": 1653101606,
  "title": "Can someone truly vanish in today’s connected world?",
  "created_utc": 1653118112,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am trying to find out what happened to my husband’s best friend. Several years ago the friend, Wyatt (not his real name) went through an ugly divorce from an equally ugly woman. Shortly after the finalization of the divorce, Wyatt just stopped existing. He stopped answering the phone. Online searches revealed he stopped paying rent on the storage unit he had and the contents were auctioned off.  This storage unit held most of his furniture, all of his belongings he kept in the divorce and his cherished motorcycle. All of this went to the highest bidder.  I only know this from online searches for his name. Recently, even this information is no longer available online. &lt;/p&gt;\n\n&lt;p&gt;None of our mutual friends can reach him.  Two of the three phone numbers we had for him are disconnected. The last one appears to have my cell number blocked as it goes right to voicemail without ringing.  If I call from a different number, it rings 6 or so times and then goes to voice mail. This is the same for all of us. The outgoing message is a standard greeting about the person you are trying to reach is not available. Our mutual friends can not find him at his last known address. No one has found an obituary or a death notice. It’s like he just disappeared like a fart in the wind. &lt;/p&gt;\n\n&lt;p&gt;Theories swirl about what happened to him. How can someone we loved and cherished disappear or cut everyone off that loved him without a trace? Is it possible?  How can we get information on his possible demise when none of us are blood family? Are we demised to never know what became of Wyatt?&lt;/p&gt;\n\n&lt;p&gt;Edit to add: He was last known to drive a very distinct older car that one friend saw in an apartment parking lot. Unfortunately, no one has been able to determine who owns that particular car to ask questions or identify if it is Wyatt’s new address.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/uue2mh/can_someone_truly_vanish_in_todays_connected_world/",
  "subreddit": "TooAfraidToAsk",
  "id": "uue2mh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I am trying to find out what happened to my husband’s best friend. Several years\nago the friend, Wyatt (not his real name) went through an ugly divorce from an\nequally ugly woman. Shortly after the finalization of the divorce, Wyatt just\nstopped existing. He stopped answering the phone. Online…"
}