{
  "author": "daisykeeks",
  "original_created_utc": 1646345124,
  "title": "I lost my 2 week old kitten and I can’t find her anywhere. She’s only been in my room and I’ve looked everywhere. so where could she possibly be?",
  "created_utc": 1646373968,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The last time I saw her was about an hour ago before I left for a quick grocery trip. I came back about 20 minutes later and she was nowhere to be found. I’ve looked all around my room numerous times but I just can’t seem to find her and I’m starting to get nervous, especially since she’s usually very vocal and I haven’t heard a thing. I’m thinking my other cat (her mother) may have gotten out of the room when I left the door cracked and moved to her another spot but I highly doubt that seeing as 1.) the mother cat seems to be comfortable in the room they’re in and b.) I’ve already looked in the one spot I know she would take her and she isn’t there. I also don’t think she would have moved her considering she has another kitten who is still in the room. Does anyone have any idea of where a 2-week old kitten who can’t jump could possibly be hiding?&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Edit: After an hour or so of searching for her, I walked into my room and found her literally 5 minutes after posting this. Nonetheless, thank you for the replies!&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/NoStupidQuestions/comments/t62z4i/i_lost_my_2_week_old_kitten_and_i_cant_find_her/",
  "subreddit": "NoStupidQuestions",
  "id": "t62z4i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The last time I saw her was about an hour ago before I left for a quick grocery\ntrip. I came back about 20 minutes later and she was nowhere to be found. I’ve\nlooked all around my room numerous times but I just can’t seem to find her and\nI’m starting to get nervous, especially since she’s usually…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最後に彼女を見たのは、1時間ほど前、ちょっとした買い物に出かける前だった。\nを使用します。20分ほどして戻ってきたら、彼女はどこにもいなかった。私は\n何度も部屋中を探したのですが、どうしても見つからなくて。\n不安になってきた特に彼女はいつも...",
      "title": "生後2週間の子猫が行方不明になり、どこにもいません。私の部屋にしかいなかったので、あちこち探したのですが、どこにいるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最后一次见到她是在一个小时前，在我离开去买菜之前。\n旅行。大约20分钟后我回来，她就不知所踪了。我已经\n我在我的房间里找了无数次，但我似乎找不到她。\n我开始紧张了，尤其是她通常...",
      "title": "我的2周大的小猫不见了，我到处都找不到她。她只在我的房间里，我到处都找过了。那么她可能在哪里呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最後一次見到她是在一個小時前，在我離開去買菜之前。\n旅行。大約20分鐘後我回來，她就不知所蹤了。我已經\n我在我的房間裏找了無數次，但我似乎找不到她。\n我開始緊張了，尤其是她通常...",
      "title": "我的2周大的小貓不見了，我到處都找不到她。她只在我的房間裏，我到處都找過了。那麼她可能在哪裏呢？"
    }
  ]
}