{
  "author": "xcryptogurux",
  "the_new_excerpt": "Another long post. I request that you bear with me and I hope this allows people\nto understand that proof of work is non-negotiable for a public blockchain.\n\nWe've grown into this habit of dismissing even the most legitimate fact-based\ncriticism as FUD so I'm not going to specifically mention any…",
  "original_created_utc": 1621091175,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "またまた長い投稿です。私の話を聞いていただきたいのですが、これで人々が\nパブリック・ブロックチェーンにとってプルーフ・オブ・ワークは譲れないものだと理解してもらえればと思います。\n\n私たちは、最も正当な事実に基づいた批判でさえもFUDとして否定する癖がついてしまっています。\n私たちは、最も正当な事実に基づく批判をFUDとして退ける習慣を身につけてしまったので、特に言及するつもりはありません。",
      "title": "Deep dive - Proof of work is non-negotiable（仕事の証拠は譲れない）。Proof of stakeは恐ろしいコンセンサスモデル"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "又是一个长帖子。我请求你容忍我，我希望这能让人们\n理解工作证明对于公共区块链来说是不可商量的。\n\n我们已经养成了这样的习惯，即使是最合理的基于事实的批评，我们也会将其视为FUD，所以我不会再去理会。\n的批评，所以我不打算特别提及任何...",
      "title": "深入探讨--工作证明是不可谈判的。利益证明是一个糟糕的共识模式"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "又是一個長帖子。我請求你容忍我，我希望這能讓人們\n理解工作證明對於公共區塊鏈來說是不可商量的。\n\n我們已經養成了這樣的習慣，即使是最合理的基於事實的批評，我們也會將其視爲FUD，所以我不會再去理會。\n的批評，所以我不打算特別提及任何...",
      "title": "深入探討--工作證明是不可談判的。利益證明是一個糟糕的共識模式"
    }
  ],
  "title": "Deep dive - Proof of work is non-negotiable. Proof of stake is a terrible consensus model",
  "created_utc": 1621117942,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Another long post. I request that you bear with me and I hope this allows people to understand that proof of work is non-negotiable for a public blockchain.</p>\n\n<p>We&#39;ve grown into this habit of dismissing even the most legitimate fact-based criticism as FUD so I&#39;m not going to specifically mention any names here at all but just focus on proof of stake as a consensus model vis-a-vis public blockchains.</p>\n\n<p>Last cycle, they were shilling you blatantly centralized consensus models like dPOS and private, permissioned blockchains where, just like the banking system, there was no way for the user to verify the truth. You just had a bank account. Except, instead of trusting bankers, they asked you to trust a handful of strangers from across the world with little legal recourse. You don&#39;t need a blockchain for this but people actually ate this shit up!</p>\n\n<p>This cycle, it&#39;s all about how POS is the way forward because POW consumes too much energy. People are actually suggesting, with a straight face, that Bitcoin should switch to POS. Seriously? Talk about the tail trying to wag the dog. Should be careful mentioning dogs, lest another scammer gets inspired to create a $10 billion mcap token for less than 2 minutes of effort.</p>\n\n<p>The ubiquity of ignorance and blissful dunning-kruger-fest on social media with regards to proof of work after all these years is disappointing. Even more disappointing is how individuals who are looked up to by the masses irresponsibly let down the masses by not doing their research and falling prey to scaremongering media coverage.</p>\n\n<p>It&#39;s time to educate some of our misguided crypto brethren why <strong>proof of work is absolutely indispensable for blockchains</strong>. Indeed, if you&#39;re thinking about a non-POW blockchain, you really don&#39;t need a blockchain.</p>\n\n<p>Speaking of effort, that&#39;s the whole point. If there is no effort, then the consensus model is doomed. <strong>Work is the most fundamental criteria for a blockchain protocol</strong>. Not only does it make the network unassailable, but it also ensures that there is no barrier of entry for absolutely anyone anywhere in the world to participate in the network, do the work and be rewarded. You simply cannot eliminate this property of permissionless for a public blockchain. Non-negotiable!</p>\n\n<p>Perhaps most critical of all, mining provides the value anchor for blockchains, as a factor of real-world expenditures. That&#39;s why Bitcoin&#39;s price evinces a close correlation to its hash rate! Next time someone asks what Bitcoin&#39;s value is based on, tell them <strong>Bitcoin&#39;s value is based on the real-world cost expenditure undertaken by miners</strong>.</p>\n\n<p><strong>Only without proof of work, a blockchain asset&#39;s value is based on nothing.</strong> The asset is as good as a dog meme token.</p>\n\n<p>Not only that, with a proof of work network, miners are required to constantly upgrade their hardware, entailing continual overhead cost. This ensures that newly generated coins are equitably distributed across the network, controlled only by the supply/demand dynamics. <strong>With proof of stake, there&#39;s no real-world cost, no overhead cost, zilch!</strong> This means the big boys keep increasing their share and clout by gobbling up the supply inflation and dumping the actual inflation itself on the little fellas. Sounds familiar? Bingo! That&#39;s fiat money. #CantillonEffect</p>\n\n<p>With proof of stake, if a handful of rich people buy up enough coins, they&#39;ll become your masters. <strong>Proof of work constantly moves money the other way, diluting the concentration of wealth from the rich to the poor as the number of wallets increase.</strong></p>\n\n<p><strong>But miners control POW blockchains, right? Wrong!</strong> This always makes me chuckle when people say it with such conviction. Instead of me explaining this one, I urge you to read <a href=\"https://en.bitcoin.it/wiki/Bitcoin_is_not_ruled_by_miners\">this from the Bitcoin wiki</a>.</p>\n\n<p>With permissioned staking models, the government can easily take them down since there are a finite points of failure. This is amplified by centralized exchanges as most people will use their staking pools to stake their coins, making the blockchain extremely vulnerable and insecure.</p>\n\n<p>There are frankly so many other glaring inefficiencies with the staking model which I really cannot get into at once, including things like indeterminable cost of attack and inevitable centralization of jurisdiction over stake-slashing.</p>\n\n<p>We need to stop letting wilfully ignorant mainstream media with thinly-veiled agendas dragoon us into adopting centralized, undemocratic, inefficient, basically bullshit protocols which they can easily take over.</p>\n\n<p>All blockchains except Bitcoin have a central figurehead/supreme leader. I sincerely hope for the sake of people investing in these projects that these leaders carefully consider the glaring and crippling demerits of transitioning to such a flawed consensus model.</p>\n\n<p>I do believe most of these blockchains make compromises to somehow distinguish themselves and say, &quot;look we&#39;re faster, scalable etc.&quot; but it&#39;s ultimately a self-defeating gambit.</p>\n\n<p>If the energy expenditure of gold mining, the banking system and, I must include this, rocket-launching are essential, then Bitcoin&#39;s energy expenditure is, in my personal opinion, the more essential expenditure of energy in the 7000-year history of money. It has the potential to efficiently replace gold &amp; the banking system! Let&#39;s embrace renewables, but not be so ignorant to say proof of work wastes energy.</p>\n\n<p>So Bitcoin could actually effect a net reduction in energy expenditure for human value exchange besides finally &quot;taking the thing out of the hands of government.&quot;</p>\n\n<p><strong>Decentralization tolerates no compromise.</strong></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/60zzrufmraz61.jpg?width=800&amp;format=pjpg&amp;auto=webp&amp;s=296ae326a4f9c561d0c6b36c6a7e943bf2432518\">https://preview.redd.it/60zzrufmraz61.jpg?width=800&amp;format=pjpg&amp;auto=webp&amp;s=296ae326a4f9c561d0c6b36c6a7e943bf2432518</a></p>\n</div><!-- SC_ON -->",
  "score": 291,
  "permalink": "/r/Bitcoin/comments/nd0wyh/deep_dive_proof_of_work_is_nonnegotiable_proof_of/",
  "subreddit": "Bitcoin",
  "id": "nd0wyh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590794220
}