{
  "author": "ShiningConcepts",
  "original_created_utc": 1650621714,
  "title": "Why are Ukrainian refugees being given so much more media attention and sympathy, than refugees from nonwhite countries?",
  "created_utc": 1650631522,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t get me wrong, I&amp;#39;m not some &lt;a href=\"/r/conspiracy\"&gt;/r/conspiracy&lt;/a&gt; pro-Russian troll or anything lol, I 100% am on the side of Ukrainians in this conflict and see them as victims of a war of aggression.&lt;/p&gt;\n\n&lt;p&gt;What I don&amp;#39;t see however, is something implied to exist by the widely disparate levels of media coverage - which is why they are more deserving of sympathy and the international community&amp;#39;s attention than people from other countries (speaking very very bluntly here, nonwhite countries). Namely Palestine, Syria, Afghanistan, Yemen and so on.&lt;/p&gt;\n\n&lt;p&gt;So in all seriousness, is there a reason Ukrainians are being treated much differently here? Is there anything wrong with me being no more sympathetic to them then I am with the people in those other countries?&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;The only thing I can think of is that this conflict has a lot of political/geopolitical implications for the West, because of how it&amp;#39;s happening in Europe and isn&amp;#39;t restricted to the &amp;quot;third world&amp;quot; (huge air quotes there). So I&amp;#39;m guessing that&amp;#39;s a key reason for the media coverage disparity. But, ignoring the disparity in political implications, and just looking at the refugees/affected civilians from the countries themselves: why are they given more attention, sympathy and support than those from other countries?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 185,
  "permalink": "/r/TooAfraidToAsk/comments/u9b1s0/why_are_ukrainian_refugees_being_given_so_much/",
  "subreddit": "TooAfraidToAsk",
  "id": "u9b1s0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Don't get me wrong, I'm not some /r/conspiracy pro-Russian troll or anything\nlol, I 100% am on the side of Ukrainians in this conflict and see them as\nvictims of a war of aggression.\n\nWhat I don't see however, is something implied to exist by the widely disparate\nlevels of media coverage - which is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "誤解しないでください、私は /r/conspiracy pro-Russian troll でも何でもありません。\nこの紛争では100％ウクライナ人の味方であり、彼らを侵略戦争の犠牲者として見ています。\n侵略戦争の犠牲者だと考えています。\n\nしかし、私が見ていないのは、メディアの報道レベルが大きく異なることによって、その存在が暗示されているものです。\nメディアの報道レベルの違いによって、その存在が暗示されていることです。",
      "title": "なぜウクライナ難民は、非白人国家からの難民よりも、メディアの注目度が高く、同情されているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "不要误会我的意思，我不是什么/r/conspiracy亲俄罗斯的巨头或其他什么。\n笑，我在这场冲突中100%地站在乌克兰人一边，把他们看作是侵略战争的受害者。\n侵略战争的受害者。\n\n然而，我没有看到的是，在媒体的报道中，有一些暗示存在着广泛的差异性\n媒体报道水平的差异所暗示的东西--那就是......",
      "title": "为什么乌克兰难民比来自非白人国家的难民得到了更多的媒体关注和同情？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不要誤會我的意思，我不是什麼/r/conspiracy親俄羅斯的巨頭或其他什麼。\n笑，我在這場衝突中100%地站在烏克蘭人一邊，把他們看作是侵略戰爭的受害者。\n侵略戰爭的受害者。\n\n然而，我沒有看到的是，在媒體的報道中，有一些暗示存在着廣泛的差異性\n媒體報道水平的差異所暗示的東西--那就是......",
      "title": "爲什麼烏克蘭難民比來自非白人國家的難民得到了更多的媒體關注和同情？"
    }
  ]
}