{
  "author": "Wise_Card7304",
  "original_created_utc": 1655469722,
  "title": "Is it common to be tired of living? Not in a suicidal way, more of a “I’m not gonna kill myself but fuck I cannot do this shit anymore” type of way? I straight up just don’t wanna continue existing at this point.",
  "created_utc": 1655483410,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;-I wake up everyday miserable, I whole heartedly can’t remember the last time I was genuinely happy. I try to do things with friends but my friends also seem to be in the same boat as me and when we all do find the time to hang out, none of us can find the energy to actually have fun and it just turns into a day of a group of 19-21 year olds moping about every stress in the world. &lt;/p&gt;\n\n&lt;p&gt;-I work so much yet have no money, I desperately want to get therapy, but oh wait, I have no money lmao … or fucking time now that I think about it. &lt;/p&gt;\n\n&lt;p&gt;-Everything just disgust me, I go outside and I’m just completely turned off by the sight of everyone and everything. &lt;/p&gt;\n\n&lt;p&gt;-I have to deal with the fact that I more than likely have no future if things keep going this way. I try to tell myself things are gonna get better but realistically it just won’t. This alone is responsible for most of my gloom.&lt;/p&gt;\n\n&lt;p&gt;-things I used to enjoy are basically meaningless now. Video games? Trash. Sex? Trash(insane). Music? Trash\nFoods I used to enjoy? Hella trash. Going to the gym? Trash. Hanging with friends? Like I said, trash. &lt;/p&gt;\n\n&lt;p&gt;This is probably just depression but if that’s the case why are so many people this depressed? Ik I asked “is it common..?” But that’s only bc it’s mandatory I ask a question, I’ve asked many of my closer friends if they share the same feelings as me and way too many of them have said yea. WHYS EVERYONE SO DEPRESSED? LOL??? I’m just existing, impatiently waiting to die.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 1162,
  "permalink": "/r/TooAfraidToAsk/comments/vecapr/is_it_common_to_be_tired_of_living_not_in_a/",
  "subreddit": "TooAfraidToAsk",
  "id": "vecapr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "-I wake up everyday miserable, I whole heartedly can’t remember the last time I\nwas genuinely happy. I try to do things with friends but my friends also seem to\nbe in the same boat as me and when we all do find the time to hang out, none of\nus can find the energy to actually have fun and it just…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "-毎日惨めに目が覚める。\n純粋に幸せだったことが思い出せない。友達と一緒に何かしようとするのですが、友達も同じような感じです。\nをするように心がけていますが、友人も同じような状態です。\nでも、そんなことはどうでもよくて、ただ、ただ、ただ、ただ、ただ、ただ、ただ、ただ、ただ、ただ、ただ、ただ、ただ、ただ。",
      "title": "生きることに疲れるのはよくあること？自殺するような感じではなく、「自殺はしないけど、もうこんなことやってられない」という感じでしょうか。私はこのまま存在し続けるのが嫌なんです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "-我每天醒来都很痛苦，我全心全意地记得我最后一次\n是真正的快乐。我试着和朋友一起做事，但我的朋友似乎也和我在一条船上。\n当我们都找到时间出去玩的时候，没有一个人能够找到真正的精力去玩。\n我们都找不到精力去真正享受快乐，这只是...",
      "title": "对生活感到厌倦是很常见的吗？不是以自杀的方式，更像是 \"我不会自杀，但他妈的我不能再这样下去了 \"的方式？在这一点上，我只是不想继续存在。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "-我每天醒來都很痛苦，我全心全意地記得我最後一次\n是真正的快樂。我試着和朋友一起做事，但我的朋友似乎也和我在一條船上。\n當我們都找到時間出去玩的時候，沒有一個人能夠找到真正的精力去玩。\n我們都找不到精力去真正享受快樂，這只是...",
      "title": "對生活感到厭倦是很常見的嗎？不是以自殺的方式，更像是 \"我不會自殺，但他媽的我不能再這樣下去了 \"的方式？在這一點上，我只是不想繼續存在。"
    }
  ]
}