{
  "author": "Flower838",
  "the_new_excerpt": "tl;dr: Dont get in love with, or marry you baggs.\n\nThe intention is to not spread more FUD (like we need it right?), but please be\naware.\n\nThis recent crash (no, its not a dip; lets call it what it is at this point) has\nmany investors and traders scared to put money into the market. We have…",
  "original_created_utc": 1621789619,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "tl;dr。あなたのバッグを好きになったり、結婚したりしないでください。\n\n意図としては、これ以上FUDを広めないようにしたいのですが（それが必要なのか？\nご注意ください。\n\nこの最近の暴落（ディップではありません、今の時点ではそう呼びましょう）は\n多くの投資家やトレーダーは、市場に資金を投入することを恐れています。私たちは...",
      "title": "思い出してください。EVERYTHINGは弱気相場ではクソコインになる。2018年の \"素晴らしい \"プロジェクトを振り返る】のページです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "简而言之。不要爱上或嫁给你的巴格斯。\n\n我们的目的是不传播更多的虚假信息（就像我们需要它一样），但请注意\n注意。\n\n最近的暴跌（不，它不是下跌；在这一点上让我们称它为暴跌）使\n许多投资者和交易者害怕把钱投入市场。我们已经...",
      "title": "提醒您。在熊市中，所有的东西都是狗屎币。[回顾一下2018年的一些 \"伟大 \"项目]"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "簡而言之。不要愛上或嫁給你的巴格斯。\n\n我們的目的是不傳播更多的虛假信息（就像我們需要它一樣），但請注意\n注意。\n\n最近的暴跌（不，它不是下跌；在這一點上讓我們稱它爲暴跌）使\n許多投資者和交易者害怕把錢投入市場。我們已經...",
      "title": "提醒您。在熊市中，所有的東西都是狗屎幣。[回顧一下2018年的一些 \"偉大 \"項目]"
    }
  ],
  "title": "Reminder: EVERYTHING is a shitcoin in a bear market. [A lookback at some \"great\" projects from 2018]",
  "created_utc": 1621821514,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong><em>tl;dr: Dont get in love with, or marry you baggs.</em></strong></p>\n\n<p>The intention is to not spread more FUD (like we need it right?), but please be aware. </p>\n\n<p>This recent crash (no, its not a dip; lets call it what it is at this point) has many investors and traders scared to put money into the market. We have seen some of the altcoins get rekt pretty hard.  40-70% loss on the weekly is not uncommon for even top 50 and those are surely supposed to be &quot;good &amp; solid&quot; projects right? Well...think again. </p>\n\n<p>With the potential upcomming bear market I would like to remind everyone that most alts that are now top 100 might not make it. This time the hype is around staking rewards, DeFi APY pools, NTF&#39;s and meme coins. The main focus of 2018 were ICO&#39;s. It changes drastically each cycle. As someone who witnessed my portfolio outperform BTC in 2017, only to lose both sats and fiat value by 90% in the early 2018, I would like to inform the new people how things work with altcoins. BTC&#39;s dominance is rising again - hinting at the end of altseason.</p>\n\n<p>Consider the following to be true:</p>\n\n<p>1.) It does not matter if the team is good.<br/>\n2.) It does not matter if the idea is revolutionary.<br/>\n3.) It does not matter that there is a real life usecase for the coin/token.</p>\n\n<p>I see some newcommers on this sub already coming to terms with the fact that it might be over and sayin &quot;ill just hold my alt picks for the longterm, I believe in the project&quot;.... Now, yes, some will be good in the longterm... <strong>But most will not.</strong> Even if we go sideways for a few months and then have another leg up in the summer due to good news, institutions buying more, and major platforms(mainly big three ETH, ADA, DOT) with big updates, A LOT of coins will not be there.</p>\n\n<p>I suspect many will never reach their ATH&#39;s again. Remember, most of the coins I will mention below were in the top 100 at some point during the 2017-2018 bullrun, perhaps briefly, perhaps for months.</p>\n\n<p>So....</p>\n\n<p>A lookback at some of the coins that were shilled and hyped heavily on the way down from the 2018 peak and never got back to ATH&#39;s:</p>\n\n<p><a href=\"https://coinmarketcap.com/currencies/iota/\">Iota</a></p>\n\n<p><em>Price facts:</em></p>\n\n<p>It peaked at $5 in december 2017, and bottomed at ~$1 just a few months later in april 2018. Thats an 80% loss. Then it went on to reach a low of as much as $0.1 in the following years. <strong>A loss of 98% from ATH.</strong></p>\n\n<p>I was buying this at 2.3 and 4.2 all the way up back in 2017, waiting for my guaranteed 10x. Finally got rid of it at 1.7 this year.It never got back to its ATH - peaking just slightly above 2.53 this run.</p>\n\n<p><em>The hype surrounding it:</em></p>\n\n<p>Reading about it, you could hear stuff like &quot;Blockchain 3.0&quot;, and &quot;the bigger the userbase the faster and more secure the network&quot;, and &quot;the currency of the future&quot;, &quot;it will connect all machines on the internet, making them exchange good in IoTa currency&quot;, &quot;the team is smart and hard-working&quot; &quot;a very well designed projects&quot; &quot;will revolutionalize the way smart cars, refrigiratos and phones communicate with each other&quot;.</p>\n\n<p><a href=\"https://coinmarketcap.com/currencies/request/\">Request (REQ)</a> (frequently hyped and shilled on this sub like VET and LTO today)</p>\n\n<p><em>Price facts:</em></p>\n\n<p>Had a massive run in extremely short time. This one hit like few others. Was just under 10 cents in december 2017, then it just 10x-ed in a month or so to just uner a dollar, peaking in January. It was free money. Until it one day just wasnt. By april it was trading at 14 cents again. <strong>Now its dead.</strong>  Gone from top 100 for probably forever, forgotten by most. Went under a cent in 2019 (-99.4% from ATH) and came back this year to around 15 cents again. Still like 83% away from ATH.</p>\n\n<p><em>The hype surrounding it:</em></p>\n\n<p>Didnt really read into it much back then. It was the one that got away and I never got into it. Something something about revolutionazing the paymant industry, putting it on the blockchain. Having an universal storage of transactions. I am talking credit cards, cashback, decentralised and publically viewed on the blockchain and becoming transparent. HUGE. It was all the rage and the cryptospace, especially YTB was losing its mind over it, this sub not beeing immune. I am talking  VET and LTO level shilling.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://coinmarketcap.com/currencies/substratum/\">Substratum (SUB)</a></p>\n\n<p><em>Price facts:</em></p>\n\n<p>Picture this: Its 30th of December 2017 and you are preparing for new years eve party. You finally dump 2.5k into Substratum after researching it for a week or so, already feeling massive FOMO for missing the price surge from 40 cents to $1. You get 2,517 of them. In 9 days I was sitting on 7.5k, about 5k in pure profits feeling on top of the world. It 3x-ed in 10 days. Why sell? Shit is going to $10 for sure.</p>\n\n<p>....</p>\n\n<p>This one, I still to this day hold. BAGGGS of it. It was delisted on Binance, where my worthless bag resides. I cant do shit with it. It is now trading at 0.004 on an exchange no1 knows about and has no volume. That is a 99.8% price drop from ATH.</p>\n\n<p><em>The hype surrounding it:</em></p>\n\n<p>My friend pitched it to me saying it will make internet use fair. It was supposed to make search engines fair and it was supposed to do that by decentralising them. HUGE project, solid team. Shilled heavily on YouTube mostly. Exit scam.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://coinmarketcap.com/currencies/quantstamp/\">QuantStamp (QSP)</a></p>\n\n<p><em>Price facts:</em></p>\n\n<p>After 7x-ing its value(from 9 cents to 73 cents) in 2 weeks or less, it went all the way back down to 20 cents before dead-cat-bouncing slightly above 35 again. Then died quite quickly (to like 0.006) with 99.1% loss in the upcomming bear. Got a bump to 10 cents this bullrun.</p>\n\n<p><em>The hype surrounding it:</em></p>\n\n<p>The first mover advantage into Smart Contact Security. Top notch tech for securing the ETH blockchain, even getting mentions from Vitalik. Huge partnerships, hard working team, and a product we surely need, right? RIGHT??</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://coinmarketcap.com/currencies/lisk/\">Lisk (LSK)</a> This one was really dear to my heart. I even got my dad into it.</p>\n\n<p><em>Price facts:</em></p>\n\n<p>It initially lost 76% during the great crash of 2018, and the went on to rebounce somewhat, finally bottomed around %0.7 (a 97% crash) in 2020. This run it never got past $10, I got out at around $8.3 after holding for years.</p>\n\n<p><em>The hype surrounding it:</em></p>\n\n<p>It was massive. It was aiming to be the biggest blockchain ecosystem around in the years to come, with a pro team and a long roadmap, and you were really early if you buying at $17( I was). </p>\n\n<p>There was a rumour going around that ALL apps, on ALL playstores, be it android or iPhone would be written on and connected throught Lisk. It was like the main blockchain for mobile app industry. They had events, AMA&#39;s, hard working team, a product that the world surely will need. They will be the first in the space. </p>\n\n<p>The blockchain has also been around since before the bullrun, and that was somehow supposed to prove these guys are legit.  It was stable it was secure it was the future. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://coinmarketcap.com/currencies/icon/\">Icon(ICX)</a></p>\n\n<p><em>Price facts:</em></p>\n\n<p>Crashed from $12 to $3 when everything else was crashing. I bought this one on the way down actually. I let it go at $2.3 this year(almost perfect peak, yay me) after holding all throughout the bear. Bottomed at -95%+ at some point.  </p>\n\n<p><em>The hype surrounding it:</em></p>\n\n<p>Throwing around big words that noone really understood or took the time to explain such as &quot;aggregator&quot;, &quot;interoperability&quot;, &quot;layering&quot; and the bunch. It was supposed to connect the one bussines group with another though its network in an effective and decentralised way. Had actually shools and governments as partners. Also Samsung got involved later I think.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://coinmarketcap.com/currencies/power-ledger/\">Power Ledger (POWR)</a> </p>\n\n<p><em>Price facts:</em></p>\n\n<p>It was worth like $1.6 at some point, I remember getting into it at 70 cents. Held it all the way through initial crash of like 80+% to 2021, when I let it go for like $38. Peaked at $0.64 this run.</p>\n\n<p><em>The hype surrounding it:</em></p>\n\n<p>This project was supposed to revolutionalize the energy and electric distribution globally, making it trackable on blockchain, and sending it where there is shortage. Sustainable energy for all. Connected globally. No1 of us though why we need a crypto token to implement this change and why would any big energy firm need a token to implement this change though. It just sounded sooooo coool. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://coinmarketcap.com/currencies/pivx/\">PIVX</a></p>\n\n<p><em>Price facts:</em></p>\n\n<p>Crashed from like $13 to $2 (around 80%) in a month or less. Bottomed at sub 25 cents (a 98% loss from ATH ) in 2020. Never came back, but had a bump back to $2 this run. </p>\n\n<p><em>The hype surrounding it:</em></p>\n\n<p>Simply put, it was &quot;the Monero killer&quot;. Almost no fees, even more secure, more anonymous, cutting edge tech, privacy for days. The future of privacy coins. Masternodes. Proof of stake. Top tech. Buy buy buy. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://coinmarketcap.com/currencies/neo/\">NEO (or &quot;Antshares&quot; back then).</a></p>\n\n<p><em>Price facts:</em></p>\n\n<p>This beast literally 200x-ed. If you got into it before rebranding, when it was still Antshares you were lucky. It almost reached $200 from sub $1. Crashed hard after China FUD was released(yes China FUD was a thing back then also). From January 15 to April 4th, a loss of 74%. ALMOST came back to ATH this bullrun. It never broke into top 25 I dont think, even though it was firmly in the top 10 for quite some time in 2017. I hodled like 42 of them all these yeas, finally letting it go at $50 this year. I lost like half my money on it.</p>\n\n<p><em>The hype surrounding it:</em></p>\n\n<p>It was advertised as the Chinese Ethereum killer. Better tech.Better implementations of smart contracts. Harder working team. The fact that is was (somewhat) centralized didnt bother much people. Earning GAS for just holding it was a big deal back then (staking rewards were not really a thing, you see). It was one of the only projects giving passive income. Also a lot of projects were starting on it. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://coinmarketcap.com/currencies/deepbrain-chain/\">DeepBrainChain</a></p>\n\n<p><em>Price facts:</em></p>\n\n<p>Would you like to 6x your money in 10 days?? All you had to do was buy this shitcoin at new year 2018 and sell it at the peak on 9th January 2018. Now trading at around one cent, down 98% from ATH.</p>\n\n<p><em>The hype surrounding it:</em></p>\n\n<p>An integration of AI and blockchain technology. A revolution in the AI industry. Not anonymous team. Good partnerships, huge offices, dedication, integrity, vision, exelent crowdfunding. The future is ours. </p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Honorable mentions that were also shilled on Youtube and some from 2018 might remember, but I dont have the time to go into detail and will only mention:</strong></p>\n\n<p>&#x200B;</p>\n\n<p>Aion: <a href=\"https://coinmarketcap.com/currencies/aion/\">https://coinmarketcap.com/currencies/aion/</a> Was really big back then, but I cant quite remember what  for. Some on my friends held loads of it. Today is sub 300 on cmc. </p>\n\n<p>Verge: <a href=\"https://coinmarketcap.com/currencies/verge/\">https://coinmarketcap.com/currencies/verge/</a> remember verge?? The best tech coin around by far?? Also, Pornhub accepting it as payment.</p>\n\n<p>WaltonChain: <a href=\"https://coinmarketcap.com/currencies/waltonchain/\">https://coinmarketcap.com/currencies/waltonchain/</a> </p>\n\n<p>Dragon Chain: <a href=\"https://coinmarketcap.com/currencies/dragonchain/\">https://coinmarketcap.com/currencies/dragonchain/</a> (Everything with a &quot;Chain&quot; in its name was booming in early 2018)</p>\n\n<p>WanChain: <a href=\"https://coinmarketcap.com/currencies/wanchain/\">https://coinmarketcap.com/currencies/wanchain/</a></p>\n\n<p>Aelf: <a href=\"https://coinmarketcap.com/currencies/aelf/\">https://coinmarketcap.com/currencies/aelf/</a></p>\n\n<p>FLiK: <a href=\"https://coinmarketcap.com/currencies/flik/\">https://coinmarketcap.com/currencies/flik/</a> (the Netflix of crypto). Owner was later investigated by SEC and found guilty. You can find the report online. </p>\n\n<p>Civic:<a href=\"https://coinmarketcap.com/currencies/civic/\">https://coinmarketcap.com/currencies/civic/</a> (something something security)</p>\n\n<p>carVertical: <a href=\"https://coinmarketcap.com/currencies/carvertical/\">https://coinmarketcap.com/currencies/carvertical/</a> (putting car data on blockchain) I still have thousands of them after going in at 1 full ETH into ICO. Forgot the seed tho.</p>\n\n<p>Salt: <a href=\"https://coinmarketcap.com/currencies/salt/\">https://coinmarketcap.com/currencies/salt/</a></p>\n\n<p>Stratis: <a href=\"https://coinmarketcap.com/currencies/stratis/\">https://coinmarketcap.com/currencies/stratis/</a></p>\n\n<p>Steem: <a href=\"https://coinmarketcap.com/currencies/steem/\">https://coinmarketcap.com/currencies/steem/</a> (A type of social platform. Get paid in cryptocurrencies to writte posts.)</p>\n\n<p>Cobinhood: <a href=\"https://coinmarketcap.com/currencies/cobinhood/\">https://coinmarketcap.com/currencies/cobinhood/</a> (I remember a guy posting profits from this, making his first million, after it went 10x, he was one of the first guys into it. The team exit scammed. )</p>\n\n<p>Iconomi: <a href=\"https://coinmarketcap.com/currencies/iconomi/\">https://coinmarketcap.com/currencies/iconomi/</a> had a double peak where you could 10x your money. Now delisted. Gone.</p>\n\n<p>TenX: <a href=\"https://coinmarketcap.com/currencies/tenx/\">https://coinmarketcap.com/currencies/tenx/</a> from 5 bucks to sub 10 cents. This was the project where you would get your credit card, store crypto on it, and pay with it all around the world.</p>\n\n<p>Electroneum: <a href=\"https://coinmarketcap.com/currencies/electroneum/\">https://coinmarketcap.com/currencies/electroneum/</a> something something mobiles</p>\n\n<p>Bitquence. Rebranded to ETHOS. Rebranded to Voyager.   <a href=\"https://coinmarketcap.com/currencies/voyager-token/\">https://coinmarketcap.com/currencies/voyager-token/</a> Still around today. Shilled by Suppoman in 2017, I had like 3000 of them at some point.</p>\n\n<p>Polymath: <a href=\"https://coinmarketcap.com/currencies/polymath-network/\">https://coinmarketcap.com/currencies/polymath-network/</a> </p>\n\n<p>Dentacoin: <a href=\"https://coinmarketcap.com/currencies/dentacoin/\">https://coinmarketcap.com/currencies/dentacoin/</a></p>\n\n<p>Golem: <a href=\"https://coinmarketcap.com/currencies/golem-network-tokens/\">https://coinmarketcap.com/currencies/golem-network-tokens/</a> this one ALMOST recovered this run.</p>\n\n<p>0x protocol: <a href=\"https://coinmarketcap.com/currencies/0x/\">https://coinmarketcap.com/currencies/0x/</a> also another one that kinda recovered.</p>\n\n<p>BitShares: <a href=\"https://coinmarketcap.com/currencies/bitshares/\">https://coinmarketcap.com/currencies/bitshares/</a> </p>\n\n<p>Po.et: <a href=\"https://coinmarketcap.com/currencies/poet/\">https://coinmarketcap.com/currencies/poet/</a> Almost got into this at ICO. </p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p><strong>THERE&#39;s A LOT MORE.</strong> These are the ones I and my friends remember.</p>\n\n<p>Hold on to your sats guys.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Which projects/coins/tokens do I think will not make it??</strong></p>\n\n<p>1.) <strong><em>The majority of the food shitcoins on Binance Smart Chain</em></strong> ...</p>\n\n<p>will just die. I mean, can you imagine buying CAKE, BAKE or BURGER  after what happened last week?? Of course the dog coins and scams on BSC will die also. If/when ETH fixes fee&#39;s, Cardano does smart contracts and Polkadot kicks off parachains, there will be less and less need for BNB in the space, and even though the token might(probably will) stay a top 10 for years to come, the BSC ecosystem will surely lose its significance in the crypto space.</p>\n\n<p>2.) <strong><em>Memes.</em></strong></p>\n\n<p>Everyone loves hype, TikTok, YouTube and Twitter shilling, and dumb money flows into this. But with the recent crash, dumb money is now scared shitless. Yes DOGE might come around again in the next run as the king of memes, but I dont see that hapenning to coins with &quot;safe&quot;, &quot;dog&quot; &quot;mars&quot; &quot;elon&quot; &quot;moon&quot; &quot;cum&quot; &quot;pussy&quot; in their name. Its just not happening.</p>\n\n<p>3.) <strong><em>Smart contract platforms and Ethereum competitors.</em></strong></p>\n\n<p>Dont get me wrong I do believe in multichain world. I think some can coexist. SOME. Not all. I believe Ethereum, Cardano and Polkadot are here to stay. They have solid tech, they have hardworking teams and have been around for years now. I also think Cosmos(ATOM) is undervalued and is all tech no hype this run, and thus, didnt get to shine in the spotlight, but can potentially play a big role in the years to come. I am not so sure about Solana, Avalanche, Tezos, Tron, Eos, Icon, Neo, Algorand, Elrond, Nem, Hedera HashGraph, ... etc</p>\n\n<p>I know many of you like these projects. I, too, like some of them. Ask yourself, is there really a space for them in crypto in 3 -10 years??</p>\n\n<p><strong><em>4.) Coins that are trying to be &quot;the next&quot; ______ (fill in the blank) and forks that are trying to improve on an existing coin.</em></strong></p>\n\n<p>There are countless(actually I think 105) forks of BTC that are now mostly ghost chains. Bitcoin Gold, Bitcoin Diamond, BitcoinX, Bitcoin Satoshi Vision; even Bitcoin Cash Satoshi Vision and ... Bitcoin this and Bitcoin that.  Do you have any idea how fast EthereumClassic(ETC) will die?? Probably even BCH (bcash) and LTC(litecoin) will not make it. For sure others didnt.</p>\n\n<p>Yes Litecoin is objectively better tech(and dear to my heart) than Bitcoin. It does not matter though.</p>\n\n<p>&#x200B;</p>\n\n<p><strong><em>tl;dr: Dont get in love with, or marry you baggs.</em></strong></p>\n\n<p>&#x200B;</p>\n\n<p>Not financial advice. But you already know that. Good luck in the weeks to come,</p>\n</div><!-- SC_ON -->",
  "score": 1449,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/dooU6muJPXXBtWT_4nUo4rwgD7nN5HxOPnWw0qtu8zY.jpg?auto=webp&s=a93be8e2242914c0c905f3bff82d4a173ef8514d",
          "width": 200,
          "height": 200
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/dooU6muJPXXBtWT_4nUo4rwgD7nN5HxOPnWw0qtu8zY.jpg?width=108&crop=smart&auto=webp&s=1fc5e8ce8940caa4906eb003e187468a4156e55b",
            "width": 108,
            "height": 108
          }
        ],
        "variants": {},
        "id": "MqiKm8VhWo59MG7DdhasB-iGrQ-lckJVVuczpoiihtc"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/njc1pl/reminder_everything_is_a_shitcoin_in_a_bear/",
  "subreddit": "CryptoCurrency",
  "id": "njc1pl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197385272
}