{
  "author": "Chaoscontrol9999",
  "original_created_utc": 1644009473,
  "title": "Is saying you act white offensive to a black person?",
  "created_utc": 1644035160,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m 20 and It’s starting to annoy me tbh, all my white friends say it or they call me a coconut “black on outside white on the inside”. &lt;/p&gt;\n\n&lt;p&gt;Just because I study computer science, get very good grades, well mannered and just being myself.I think I’m eventually just going to explode if someone’s says this to me again. I don’t know what acting black means. Why do I have to act a way because of my skin colour?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/NoStupidQuestions/comments/skom1z/is_saying_you_act_white_offensive_to_a_black/",
  "subreddit": "NoStupidQuestions",
  "id": "skom1z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m 20 and It’s starting to annoy me tbh, all my white friends say it or they\ncall me a coconut “black on outside white on the inside”.\n\nJust because I study computer science, get very good grades, well mannered and\njust being myself.I think I’m eventually just going to explode if someone’s…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は20歳ですが、白人の友達はみんなそう言うし、白人の友達もそう言うので、正直イライラし始めました。\n外見は黒く、中身は白い」ココナッツと呼ばれています。\n\nコンピュータサイエンスを勉強していて、成績もよく、マナーもよく、そして\nこのままでは爆発してしまいそうで......。",
      "title": "白人を演じると言うことは、黒人にとって不快なことなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我20岁了，这开始让我很恼火，我所有的白人朋友都这么说，或者他们说我是椰子，\"外黑内白\"。\n称我是 \"外黑内白 \"的椰子。\n\n只是因为我学习计算机科学，成绩很好，举止得体，而且\n我想我最终会爆发，如果有人......",
      "title": "说你装成白人对黑人来说是一种冒犯吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我20歲了，這開始讓我很惱火，我所有的白人朋友都這麼說，或者他們說我是椰子，\"外黑內白\"。\n稱我是 \"外黑內白 \"的椰子。\n\n只是因爲我學習計算機科學，成績很好，舉止得體，而且\n我想我最終會爆發，如果有人......",
      "title": "說你裝成白人對黑人來說是一種冒犯嗎？"
    }
  ]
}