{
  "author": "theytookthemall",
  "original_created_utc": 1634133179,
  "title": "How, if at all, would Oliver have known Fagin was Jewish, and would readers have understood that? What \"tells\" might he have seen and understood?",
  "created_utc": 1634164920,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m rereading Oliver Twist for the first time since high school (teenage me did not appreciate Dickens at all), and I was struck by the fact that Fagin is immediately identified in the narrative as Jewish. It&#39;s not explicitly stated that Oliver recognizes him as such, but my read is that it&#39;s implied. </p>\n\n<p>However, I was struck by the fact that, within the scene where he is first introduced, Fagin is described as having red hair (not a trait which immediately makes me think of Jewish populations), and also as cooking sausages. Now, this is certainly my own lived experience of secular Judaism tinting my perspective, but I generally assume sausage (particularly at that time and place) to be pork. I know plenty of Jewish people do not keep kosher, but -- again, my own lived experience speaking -- it&#39;s not uncommon for Jews to not keep kosher but also avoid certain <em>treyf</em> foods (for example, not a person in my entire extended Jewish family has ever kept kosher, but I&#39;m pretty sure that not a one of us has ever cooked a porkchop or shrimp). To me, it&#39;s almost comedic, because there are two things that suggest Fagin is <em>not</em> Jewish, while Dickens is tripping over himself to remind the reader that he <em>is</em>. </p>\n\n<p>I know there is plenty to be discussed regarding Dickens&#39; antisemitism both in his work and as a person, but I&#39;m curious about the historicity of this and particularly how contemporary readers would have received and interpreted the character. I know, regrettably, the view of Jews as thieves and crooks was not new, but was it widespread enough in early Victorian England that it was enough &quot;evidence&quot;, as it were, of Fagin&#39;s Judaism? Are there other clues hiding in the text? </p>\n\n<p>For that matter, while we&#39;re here, how well-integrated was the Jewish population in working-class London? I know there were the rare and exceptional cases like the Rothschilds, but among the normal gentile population, was there a lot of preconception of &quot;what Jews look like&quot;?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/q7bmk2/how_if_at_all_would_oliver_have_known_fagin_was/",
  "subreddit": "AskHistorians",
  "id": "q7bmk2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm rereading Oliver Twist for the first time since high school (teenage me did\nnot appreciate Dickens at all), and I was struck by the fact that Fagin is\nimmediately identified in the narrative as Jewish. It's not explicitly stated\nthat Oliver recognizes him as such, but my read is that it's…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "オリバー・ツイスト」を高校時代以来、初めて読み直しています（10代の私はディケンズを全く評価していませんでした）。\nディケンズを全く理解していませんでした）、Faginが物語の中ですぐに\n物語の中ですぐにユダヤ人であることが判明したことに衝撃を受けました。オリバーが彼をそのように認識しているとは明示されていませんが\nオリバーが彼をそのように認識しているとは明示されていませんが、私の読みでは、それは...。",
      "title": "オリバーがフェイギンがユダヤ人であることを知っていたとしたら、どのようにして知っていたのか、そして読者はそれを理解したのか。また、読者はそれを理解したでしょうか？彼はどのような「指示」を見て理解したのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "自高中以来，我第一次重读《奥利弗-托斯特》（十几岁的我完全不欣赏狄更斯）。\n少年时代的我根本不欣赏狄更斯），我对费金在叙述中被立即认定为犹太人这一事实感到震惊。\n让我印象深刻的是，费金在叙述中被立即认定为犹太人。它没有明确指出\n奥利弗承认他是犹太人，但我的理解是，这是......",
      "title": "如果有的话，奥利弗是如何知道费金是犹太人的，读者会理解吗？他可能看到并了解哪些 \"情况\"？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "自高中以來，我第一次重讀《奧利弗-託斯特》（十幾歲的我完全不欣賞狄更斯）。\n少年時代的我根本不欣賞狄更斯），我對費金在敘述中被立即認定爲猶太人這一事實感到震驚。\n讓我印象深刻的是，費金在敘述中被立即認定爲猶太人。它沒有明確指出\n奧利弗承認他是猶太人，但我的理解是，這是......",
      "title": "如果有的話，奧利弗是如何知道費金是猶太人的，讀者會理解嗎？他可能看到並瞭解哪些 \"情況\"？"
    }
  ]
}