{
  "author": "rieixee",
  "original_created_utc": 1640035137,
  "title": "Do you hold any meme coins?",
  "created_utc": 1640039641,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;From what I have gathered from this sub it seems that meme coins are pretty frowned upon, and for good reason I guess. I do think there is a beneficial side to meme coins though, it introduces many people to crypto and can provide a fun community feeling.&lt;/p&gt;\n\n&lt;p&gt;I was wondering if you guys hold any meme coins at all just for the fun of it? 80% of my portfolio is in BTC and ETH but I think its fun to have a very small gamble portion, I picked up a bag of Chibonk ( $CHIBO ) for example just because the whitepaper made me laugh.&lt;/p&gt;\n\n&lt;p&gt;So are you guys still as against the idea of meme coins as I seem to remember or have you come to embrace them as part of crypto?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 207,
  "permalink": "/r/CryptoCurrency/comments/rkxg7u/do_you_hold_any_meme_coins/",
  "subreddit": "CryptoCurrency",
  "id": "rkxg7u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "From what I have gathered from this sub it seems that meme coins are pretty\nfrowned upon, and for good reason I guess. I do think there is a beneficial side\nto meme coins though, it introduces many people to crypto and can provide a fun\ncommunity feeling.\n\nI was wondering if you guys hold any meme…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブサイトを見た限りでは、ミームコインはかなり人気があるようです。\nというのも、その理由があるからです。私は、有益な面もあると思います。\nしかし、ミームコインは多くの人に暗号を紹介し、楽しい時間を提供することができます。\nコミュニティ感覚。\n\n私は、皆さんがミームを持っているかどうか疑問に思っていました...",
      "title": "ミームコインをお持ちですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "从我所收集到的信息来看，纪念币似乎是非常不受欢迎的。\n皱眉头，我想这是有原因的。我确实认为纪念币有其有益的一面\n纪念币也有好处，它让很多人了解了加密货币，并能提供一种有趣的\n社区的感觉。\n\n我想知道你们是否持有任何纪念币...",
      "title": "你持有任何备忘录硬币吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "從我所收集到的信息來看，紀念幣似乎是非常不受歡迎的。\n皺眉頭，我想這是有原因的。我確實認爲紀念幣有其有益的一面\n紀念幣也有好處，它讓很多人瞭解了加密貨幣，並能提供一種有趣的\n社區的感覺。\n\n我想知道你們是否持有任何紀念幣...",
      "title": "你持有任何備忘錄硬幣嗎？"
    }
  ]
}