{
  "author": "Neembuu",
  "original_created_utc": 1641723586,
  "title": "This sub is the best place for entertainment and crypto news, but the worst place for advice. Don’t come here if you need advice.",
  "created_utc": 1641742792,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Today, one half of the experts of this sub seem sure that we have entered a bear market while the other half is sure this dip is nothing but a tiny hiccup and are advising everyone to BTFD. In the coming days, when one of the two things will play out, one half of our &lt;a href=\"/r/cc\"&gt;r/cc&lt;/a&gt; experts will jump out and start shitposting how they perfectly predicated the market and had you listened to them, you would be having your own lambo today. &lt;/p&gt;\n\n&lt;p&gt;The fact is nobody knows what will happen. The market could continue to go sideways for months, or it could shoot back up or completely crash in an hour. Looking at former cycles doesn&amp;#39;t help us all that much; nothing is guaranteed to repeat itself. &lt;/p&gt;\n\n&lt;p&gt;The sub is a great source of entertainment but it is the worst place for advice. People like to pretend they know what will happen - and I think some really think they know it and are telling that to themselves - because they read it in the stars (and call it technical analysis) or just look at some metrics that support their claims and ignore others. Don&amp;#39;t believe them, nobody knows anything.&lt;/p&gt;\n\n&lt;p&gt;tl;dr: nobody knows shit about fuck, don&amp;#39;t believe anyone who pretends they do.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 388,
  "permalink": "/r/CryptoCurrency/comments/rzoq1i/this_sub_is_the_best_place_for_entertainment_and/",
  "subreddit": "CryptoCurrency",
  "id": "rzoq1i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Today, one half of the experts of this sub seem sure that we have entered a bear\nmarket while the other half is sure this dip is nothing but a tiny hiccup and\nare advising everyone to BTFD. In the coming days, when one of the two things\nwill play out, one half of our r/cc [/r/cc] experts will jump…"
}