{
  "author": "Neembuu",
  "original_created_utc": 1641723586,
  "title": "This sub is the best place for entertainment and crypto news, but the worst place for advice. Don’t come here if you need advice.",
  "created_utc": 1641742792,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Today, one half of the experts of this sub seem sure that we have entered a bear market while the other half is sure this dip is nothing but a tiny hiccup and are advising everyone to BTFD. In the coming days, when one of the two things will play out, one half of our &lt;a href=\"/r/cc\"&gt;r/cc&lt;/a&gt; experts will jump out and start shitposting how they perfectly predicated the market and had you listened to them, you would be having your own lambo today. &lt;/p&gt;\n\n&lt;p&gt;The fact is nobody knows what will happen. The market could continue to go sideways for months, or it could shoot back up or completely crash in an hour. Looking at former cycles doesn&amp;#39;t help us all that much; nothing is guaranteed to repeat itself. &lt;/p&gt;\n\n&lt;p&gt;The sub is a great source of entertainment but it is the worst place for advice. People like to pretend they know what will happen - and I think some really think they know it and are telling that to themselves - because they read it in the stars (and call it technical analysis) or just look at some metrics that support their claims and ignore others. Don&amp;#39;t believe them, nobody knows anything.&lt;/p&gt;\n\n&lt;p&gt;tl;dr: nobody knows shit about fuck, don&amp;#39;t believe anyone who pretends they do.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 388,
  "permalink": "/r/CryptoCurrency/comments/rzoq1i/this_sub_is_the_best_place_for_entertainment_and/",
  "subreddit": "CryptoCurrency",
  "id": "rzoq1i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Today, one half of the experts of this sub seem sure that we have entered a bear\nmarket while the other half is sure this dip is nothing but a tiny hiccup and\nare advising everyone to BTFD. In the coming days, when one of the two things\nwill play out, one half of our r/cc [/r/cc] experts will jump…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日、この分野の専門家の半分は、私たちは弱気に入ったと確信しているようです。\nもう一方は、この落ち込みはほんのささいなことに過ぎないと確信している。\nとアドバイスしている。今後、この2つのうち、どちらかが\nが出てくると、r/cc [/r/cc]の専門家の片割れが飛びつくことになる。",
      "title": "このサブは、エンターテイメントと暗号のニュースには最適な場所ですが、アドバイスには最悪の場所です。アドバイスが必要な場合は、ここに来ないでください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今天，这部分专家中的一半人似乎确信我们已经进入了熊市。\n而另一半人则确信这次下跌不过是个小插曲，并建议大家赶紧离开。\n正在建议每个人BTFD。在未来的日子里，当这两件事中的一件发生时\n的时候，一半的专家就会跳出来......",
      "title": "这个子是娱乐和加密货币新闻的最佳场所，但却是提供建议的最差场所。如果你需要建议，请不要来这里。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天，這部分專家中的一半人似乎確信我們已經進入了熊市。\n而另一半人則確信這次下跌不過是個小插曲，並建議大家趕緊離開。\n正在建議每個人BTFD。在未來的日子裏，當這兩件事中的一件發生時\n的時候，一半的專家就會跳出來......",
      "title": "這個子是娛樂和加密貨幣新聞的最佳場所，但卻是提供建議的最差場所。如果你需要建議，請不要來這裏。"
    }
  ]
}