{
  "author": "rogbel",
  "original_created_utc": 1659604046,
  "title": "The Pontic-Caspian steppe is very rich in what is apparently very fertile soil (chernozem). But from what I can tell the region has mostly been inhabited by pastorialist nomads as opposed to agricultural societies. Why?",
  "created_utc": 1659636830,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Seems to be that from way back in the neolithic until relatively recent Russian colonial settlement, the region has only been inhabited by nomadic societies - from PIEs to, maybe arguably, the cossacks. Why hasn&amp;#39;t a sedentary farming society developed in the region despite its richness in chernozem, especially in southern Ukraine?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 110,
  "permalink": "/r/AskHistorians/comments/wfwdgi/the_ponticcaspian_steppe_is_very_rich_in_what_is/",
  "subreddit": "AskHistorians",
  "id": "wfwdgi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Seems to be that from way back in the neolithic until relatively recent Russian\ncolonial settlement, the region has only been inhabited by nomadic societies -\nfrom PIEs to, maybe arguably, the cossacks. Why hasn't a sedentary farming\nsociety developed in the region despite its richness in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "新石器時代の昔から、比較的最近のロシアまで、そうだったようです。\nこの地域には遊牧民しか住んでいなかったようです。\nピエから、おそらく間違いなくコサックまで。なぜ定住型の農耕社会が発達しなかったのか。\nなぜ定住型社会が発達しなかったのか。",
      "title": "ポントスカスピアのステップには、非常に肥沃な土壌（チェルノゼム）があるようだ。しかし、私の知る限り、この地域には農耕社会とは対照的に、牧畜民がほとんど住んでいた。なぜだろう？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "似乎从新石器时代开始，直到相对较近的俄罗斯\n殖民时期，该地区只居住着游牧社会--从PIEs到，也许可以说，是游牧社会。\n从PIEs到，也许可以说是哥萨克。为什么没有一个定居的农业\n为什么该地区没有发展出定居的农业社会，尽管它有丰富的......",
      "title": "庞蒂克-里海草原有非常丰富的显然是非常肥沃的土壤（chernozem）。但据我所知，该地区主要是由牧民游牧者居住，而不是农业社会。为什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "似乎從新石器時代開始，直到相對較近的俄羅斯\n殖民時期，該地區只居住着遊牧社會--從PIEs到，也許可以說，是遊牧社會。\n從PIEs到，也許可以說是哥薩克。爲什麼沒有一個定居的農業\n爲什麼該地區沒有發展出定居的農業社會，儘管它有豐富的......",
      "title": "龐蒂克-裏海草原有非常豐富的顯然是非常肥沃的土壤（chernozem）。但據我所知，該地區主要是由牧民遊牧者居住，而不是農業社會。爲什麼？"
    }
  ]
}