{
  "author": "Jxntb733",
  "original_created_utc": 1650827102,
  "title": "I'm no technical analyst, but Bitcoin has been bouncing off the 600 day SMA all year.",
  "created_utc": 1650861561,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have been using the same Bitcoin chart for the last 15 months, on it I have coded in the 10, 50, 100, 200, 300, 400, 500, 600, 700, 800, 900, and 1000 day Simple Moving Averages (SMAs); calculated by adding recent price and then dividing by time periods. I also added the Bull Market Support Band (20 week SMA, 21 week EMA (exponential moving average; placing greater weight on more recent data points)).           &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/xcjhudzh6hv81.png?width=1802&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=fb4be69bab7182deb4526f1e396f9089a4696121\"&gt;Bitcoin Simple Moving Average Lines&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m no technical analyst, but it looks like the price in USD has been bouncing on and off that tan 600 day SMA many times this year. Every time it goes back down to this average we get the FUD &lt;em&gt;&amp;quot;Bitcoin has crashed, fell, &amp;amp; tanked&amp;quot;&lt;/em&gt; articles. This may be oversimplified, but prices seem to both shake and grasps these average lines. Recent FUD has been calling for 800/900 day SMA levels. For some hopium; notice how those longer averages just slowly and constantly trend upwards.      &lt;/p&gt;\n\n&lt;p&gt;This is not financial advice. This is just a chart.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 315,
  "permalink": "/r/CryptoCurrency/comments/ub1s7k/im_no_technical_analyst_but_bitcoin_has_been/",
  "subreddit": "CryptoCurrency",
  "id": "ub1s7k",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I have been using the same Bitcoin chart for the last 15 months, on it I have\ncoded in the 10, 50, 100, 200, 300, 400, 500, 600, 700, 800, 900, and 1000 day\nSimple Moving Averages (SMAs); calculated by adding recent price and then\ndividing by time periods. I also added the Bull Market Support Band…"
}