{
  "author": "alleeele",
  "original_created_utc": 1633106079,
  "title": "What was the state of Middle Eastern antisemitism before the creation of the State of Israel?",
  "created_utc": 1633125572,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve seen this narrative a lot online that the Arab world was a sort of paradise for Jews and everything was fine until the zionists arrived.  Similarly, I’ve seen a lot of pushback from Jewish activists who cite the second-class dhimmi status and events like the Hebron Massacre.  As a Mizrahi Jew myself, I grew up hearing my grandfather’s heart-wrenching stories of nearly escaping being stoned to death and his family experiencing the Farhud.  However, these things all happened already after the British Mandate and the Ottoman Empire, and after the advent of Zionism (note: I do believe that persecution of Jews due to supposed zionist connections is still antisemitism).  So what was life like beforehand, really?  And how did it compare to antisemitism in Europe? Thanks!</p>\n</div><!-- SC_ON -->",
  "score": 109,
  "permalink": "/r/AskHistorians/comments/pzbppu/what_was_the_state_of_middle_eastern_antisemitism/",
  "subreddit": "AskHistorians",
  "id": "pzbppu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’ve seen this narrative a lot online that the Arab world was a sort of paradise\nfor Jews and everything was fine until the zionists arrived. Similarly, I’ve\nseen a lot of pushback from Jewish activists who cite the second-class dhimmi\nstatus and events like the Hebron Massacre. As a Mizrahi Jew…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アラブ世界はユダヤ人にとって楽園のようなもので、シオニストが来るまではすべてが順調だったという話をネットでよく見かけます。\nユダヤ人にとっては楽園のようなもので、シオニストがやってくるまではすべてが順調だった。また、同様に\nユダヤ人活動家からは、二流のディミーの地位やヘブロンの大虐殺のような出来事を引き合いに出して、反発する声が多く聞かれます。\nヘブロンの大虐殺のような出来事を引き合いに出すユダヤ人活動家の反発を目にします。ミズラヒ・ユダヤ人として...",
      "title": "イスラエル国家が誕生する前の中東の反ユダヤ主義はどのような状態だったのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在网上经常看到这种说法，说阿拉伯世界是犹太人的天堂，在犹太复国主义者到来之前一切都很好。\n犹太人的天堂，一切都很好，直到犹太复国主义者到来。同样，我也看到\n同样，我也看到了犹太活动家的很多反驳，他们引用了二等公民的地位和希伯伦大屠杀等事件。\n地位和希伯伦大屠杀等事件。作为一个米兹拉希犹太人...",
      "title": "在以色列国成立之前，中东的反犹太主义是什么状况？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在網上經常看到這種說法，說阿拉伯世界是猶太人的天堂，在猶太復國主義者到來之前一切都很好。\n猶太人的天堂，一切都很好，直到猶太復國主義者到來。同樣，我也看到\n同樣，我也看到了猶太活動家的很多反駁，他們引用了二等公民的地位和希伯倫大屠殺等事件。\n地位和希伯倫大屠殺等事件。作爲一個米茲拉希猶太人...",
      "title": "在以色列國成立之前，中東的反猶太主義是什麼狀況？"
    }
  ]
}