{
  "author": "Kyozou66",
  "original_created_utc": 1643958041,
  "title": "Do you ever click on random users in comment threads and go through their post history to see how wildly differently people use reddit and express their interests?",
  "created_utc": 1644013238,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I think it&amp;#39;s kind of fun. You see what sort of things random people get excited about, kind of like a random portfolio of someone&amp;#39;s thoughts. See different approaches in life and different groupings of interests. Sometimes you see subreddits you didn&amp;#39;t even know existed and might find something interesting that way.&lt;/p&gt;\n\n&lt;p&gt;I never spend more than a couple minutes on it and move on and forget the person exists and probably never see them again. Is that weird or creepy though?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/sk6xhr/do_you_ever_click_on_random_users_in_comment/",
  "subreddit": "TooAfraidToAsk",
  "id": "sk6xhr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I think it's kind of fun. You see what sort of things random people get excited\nabout, kind of like a random portfolio of someone's thoughts. See different\napproaches in life and different groupings of interests. Sometimes you see\nsubreddits you didn't even know existed and might find something…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "なんだか楽しそうですね。不特定多数の人がどんなことに熱中しているのかがわかるので\n誰かの思考を集めたランダムなポートフォリオのようなものです。さまざまな\n人生におけるアプローチや、興味のあることのグループ分けが違う。時には\nサブREDDITの存在すら知らなかったので、何か発見があるかも...。",
      "title": "コメントスレッドでランダムにユーザーをクリックし、その投稿履歴を見て、redditの使い方や興味の表現がいかに乱暴に異なるかを確認したことはありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我认为这很有趣。你可以看到随机的人对什么样的事情感到兴奋\n就像一个人的想法的随机组合。看到不同的\n生活方式和不同的兴趣分组。有时你会看到\n你甚至不知道存在的子红包，可能会发现一些东西...",
      "title": "你有没有点击过评论线程中的随机用户，翻看他们的帖子历史，看看人们使用reddit和表达自己的兴趣有多大的不同？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我認爲這很有趣。你可以看到隨機的人對什麼樣的事情感到興奮\n就像一個人的想法的隨機組合。看到不同的\n生活方式和不同的興趣分組。有時你會看到\n你甚至不知道存在的子紅包，可能會發現一些東西...",
      "title": "你有沒有點擊過評論線程中的隨機用戶，翻看他們的帖子歷史，看看人們使用reddit和表達自己的興趣有多大的不同？"
    }
  ]
}