{
  "author": "FloridaFedererFan",
  "the_new_excerpt": "Don't ask me why but I often watch Mad Money on CNBC. I also make note of where\nI got recommendations when I buy stocks, and I'm starting to realize how bad his\nrecommendations often are and how dishonest he is about his bad calls. A few\nexamples:\n\n\n\n1) Last night, someone called into to ask about…",
  "original_created_utc": 1620999420,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "なぜかというと、CNBCの「Mad Money」をよく見るからです。また、株を買うときには、どこで勧められたかをメモしています。\n私は株を買うときにどこで推奨されたかをメモしています。\nそして、彼の推薦がいかに悪いものであるか、また、自分の悪い判断に対していかに不誠実であるかを理解し始めています。いくつかの例\n例を挙げてみよう。\n\n\n\n1) 昨晩、ある人が電話で...",
      "title": "CNBCのジム・クレイマーは、とてもクソだらけだ。..."
    },
    {
      "locale": "zh",
      "the_new_excerpt": "不要问我为什么，但我经常看CNBC的《疯狂金钱》。我还记下了\n我在买股票的时候，也会记下哪里有推荐，我开始意识到他的推荐往往是多么糟糕，他对自己的坏建议是多么不诚实。\n我开始意识到他的推荐往往是多么糟糕，而且他对他的坏建议是多么不诚实。几个\n例子。\n\n\n\n1）昨天晚上，有人打电话进来问...",
      "title": "CNBC的吉姆-克莱默是如此的满嘴跑火车...。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不要問我爲什麼，但我經常看CNBC的《瘋狂金錢》。我還記下了\n我在買股票的時候，也會記下哪裏有推薦，我開始意識到他的推薦往往是多麼糟糕，他對自己的壞建議是多麼不誠實。\n我開始意識到他的推薦往往是多麼糟糕，而且他對他的壞建議是多麼不誠實。幾個\n例子。\n\n\n\n1）昨天晚上，有人打電話進來問...",
      "title": "CNBC的吉姆-克萊默是如此的滿嘴跑火車...。"
    }
  ],
  "title": "CNBC's Jim Cramer Is So Full of Shit...",
  "created_utc": 1621036430,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Don&#39;t ask me why but I often watch Mad Money on CNBC. I also make note of where I got recommendations when I buy stocks, and I&#39;m starting to realize how bad his recommendations often are and how dishonest he is about his bad calls. A few examples:</p>\n\n<p>&#x200B;</p>\n\n<p>1) Last night, someone called into to ask about Aeva and he said he couldn&#39;t recommend it. Oh really? Actually, HE DID recommend it just several weeks ago. I know because I bought it soon afterwards and it tanked. I understand things change and he&#39;s entitled to change his mind but how about at least saying something like, &quot;I know I recommended this one before, but I can&#39;t now because of inflation or whatever...&quot;</p>\n\n<p>2) XL Fleet. Same story as above. He recommended it, then he didn&#39;t and pretended like the earlier recommendation never happened.</p>\n\n<p>3) Tech meltdown. In the runup to the 2020 election, Big Jim was pimping hard for Biden. Okay, fine, everyone&#39;s entitled to their opinion. But he kept repeatedly claiming that Biden would great for tech stocks, especially Apple, because he would improve relations with China. This call has been catastrophically wrong, at least so far but no acknowledgment of this whatsoever from him. As a so -called expert, shouldn&#39;t he have known that the policies Biden was calling for (huge increase in government spending, massive stimulus checks, enhanced unemployement checks, etc, etc) would cause inflation and inflation would be bad for many of these high multiple tech stocks? </p>\n\n<p>&#x200B;</p>\n\n<p>Yeah, I know. I shouldn&#39;t be taking recommendations from Cramer and other so-called TV experts. That&#39;s on me...but I just wanted to add my thoughts here in case others take him seriously. And yes, I&#39;m sure some of his recommendations also pan out well but I wish he would man up and admit when he makes bad calls.</p>\n</div><!-- SC_ON -->",
  "score": 1490,
  "permalink": "/r/wallstreetbets/comments/nc8sj2/cnbcs_jim_cramer_is_so_full_of_shit/",
  "subreddit": "wallstreetbets",
  "id": "nc8sj2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590806194
}