{
  "author": "DetroitMotorShow",
  "original_created_utc": 1625375642,
  "title": "After the worst launch of any coin in crypto history, ICP Founder now wants to launch ANOTHER COIN.",
  "created_utc": 1625403456,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>ICP founder Dominic just announced on Twitter that he intends to start another coin to &quot;supplement ICP&quot;. He goes on to say that value from this second coin (called Badlands) will then be used to give value to ICP. This closely resembles a ponzi scheme, which he claims &quot;will be good for everyone&quot;</p>\n\n<p>Its hardly been a month since ICP&#39;s launch, and since then the project has been accused of one thing after another - from insiders dumping on holders to locking out early ICO participants, to being shady and opaque on the circulating supply of the token.  The market has not reacted well to these shenanigans post ICP launch, and price of the coin has crashed over 90% from a peak of over $1000 to almost $30 recently.</p>\n</div><!-- SC_ON -->",
  "score": 167,
  "permalink": "/r/CryptoCurrency/comments/oddtv9/after_the_worst_launch_of_any_coin_in_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "oddtv9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "ICP founder Dominic just announced on Twitter that he intends to start another\ncoin to \"supplement ICP\". He goes on to say that value from this second coin\n(called Badlands) will then be used to give value to ICP. This closely resembles\na ponzi scheme, which he claims \"will be good for…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ICPの創業者であるドミニクは、ツイッターで別のコインを始めるつもりであることを発表しました。\nICPを補完する」ために別のコインを始めるつもりだと発表しました。さらに、この2つ目のコイン（Badlandsと呼ばれる）の価値は、ICPに価値を与えるために使用されると述べています。\n(Badlandsと呼ばれる)からの価値は、ICPに価値を与えるために使用されます。これはネズミ講によく似ています。\nこれはネズミ講に酷似しており、彼は「良いことになる」と主張しています...",
      "title": "暗号史上最悪のコインを発売したICP創業者は、今度は別のコインを発売しようとしています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "ICP创始人多米尼克刚刚在Twitter上宣布，他打算创办另一个\n币来 \"补充ICP\"。他继续说，这第二个硬币的价值\n称为Badlands）的价值将被用来为ICP提供价值。这非常类似于\n庞氏骗局，他声称 \"这对......有好处。",
      "title": "在经历了加密货币历史上最糟糕的一次发行后，ICP创始人现在想再推出一个硬币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "ICP創始人多米尼克剛剛在Twitter上宣佈，他打算創辦另一個\n幣來 \"補充ICP\"。他繼續說，這第二個硬幣的價值\n稱爲Badlands）的價值將被用來爲ICP提供價值。這非常類似於\n龐氏騙局，他聲稱 \"這對......有好處。",
      "title": "在經歷了加密貨幣歷史上最糟糕的一次發行後，ICP創始人現在想再推出一個硬幣。"
    }
  ]
}