{
  "author": "TiredRightNowALot",
  "original_created_utc": 1640609521,
  "title": "We just had Christmas, we are seeing markets start to rise a little over the last couple days…. What’s your best advice for newcomers?",
  "created_utc": 1640640841,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For anyone new to crypto from gift-giving, what are your top tips?&lt;/p&gt;\n\n&lt;p&gt;Mine would be:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Don’t do anything right away.  Watch the market and learn.&lt;br/&gt;&lt;/li&gt;\n&lt;li&gt;The best advice does not come in the form of a YouTube video, Facebook ad or a PM from some random on Reddit.  It comes from doing some searching, reading official home pages of coins and looking at the merit of their project. &lt;/li&gt;\n&lt;li&gt;When something is pumping, you don’t have to jump in.  This is FOMO (fear of missing out). It isn’t always bad but please make sure you have a handle on the market before you make rash decisions. &lt;/li&gt;\n&lt;li&gt; Don’t invest more than you can afford to lose. &lt;/li&gt;\n&lt;li&gt;Don’t do leveraged trading. &lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Also, have fun!  People on here can be crazy and the memes can be weird. But it’s just people having fun (for the most part). Don’t get over invested and don’t take things too seriously!  Good luck, make some money.  Don’t forget about taxes depending on your region!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 156,
  "permalink": "/r/CryptoCurrency/comments/rpmw8y/we_just_had_christmas_we_are_seeing_markets_start/",
  "subreddit": "CryptoCurrency",
  "id": "rpmw8y",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "For anyone new to crypto from gift-giving, what are your top tips?\n\nMine would be:\n\n 1. Don’t do anything right away. Watch the market and learn.\n    \n 2. The best advice does not come in the form of a YouTube video, Facebook ad or\n    a PM from some random on Reddit. It comes from doing some…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ギフトから初めて暗号に触れる人のために、その秘訣をお聞かせください。\n\n私ならこうです。\n\n 1. すぐには何もしないこと。市場を見て、学ぶこと。\n    \n 2. 2. 最高のアドバイスは、YouTubeの動画やFacebookの広告、あるいは\n    Redditの不特定多数の人からのPM。それは、いくつかのことを行うことから来る...",
      "title": "クリスマスがあったばかりですが、ここ数日、市場が少し上がり始めていますね...。新社会人へのアドバイスをお願いします。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对于刚从送礼中接触到加密货币的人来说，你有什么高招？\n\n我的建议是。\n\n 1. 不要马上做任何事情。观察市场并学习。\n    \n 2. 2.最好的建议不是以YouTube视频、Facebook广告或\n    2.最好的建议不是以YouTube视频、Facebook广告或Reddit上一些随机的PM的形式出现。它来自于做一些...",
      "title": "我们刚刚过了圣诞节，我们看到市场在过去几天开始有点上升....。您对新人的最佳建议是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對於剛從送禮中接觸到加密貨幣的人來說，你有什麼高招？\n\n我的建議是。\n\n 1. 不要馬上做任何事情。觀察市場並學習。\n    \n 2. 2.最好的建議不是以YouTube視頻、Facebook廣告或\n    2.最好的建議不是以YouTube視頻、Facebook廣告或Reddit上一些隨機的PM的形式出現。它來自於做一些...",
      "title": "我們剛剛過了聖誕節，我們看到市場在過去幾天開始有點上升....。您對新人的最佳建議是什麼？"
    }
  ]
}