{
  "author": "thepineapplemen",
  "original_created_utc": 1633121663,
  "title": "How did white Southerners in the US view sexual violence against slaves? How well known was this practice to non-slaveholders?",
  "created_utc": 1633140216,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have many questions. I&#39;ve tried to break them down here.</p>\n\n<p>- Would the other members of a slave owner&#39;s household be aware of, or suspect, that the owner was sexually assaulting slaves?</p>\n\n<p>- How would a southern patriarch react if he found out that his son was sexually assaulting slaves?</p>\n\n<p>- Did other male members of the household commit sexual violence against slaves? Would that be seen as damaging the patriarch&#39;s property?</p>\n\n<p>- Would the slave owner worry that his vice would be discovered? Would he only worry if certain people, such as the women of the household, learned of it? Or would he be confident that nobody would dare to bring the subject up with him?</p>\n\n<p>- Did slave owners ever worry about an enslaved woman bearing a white-passing child? What would happen to a white-passing child?</p>\n\n<p>- Was anyone keeping track of children fathered by the slave owner or another male member of the household? Would unintentional incest occur?</p>\n\n<p>- I thought that miscegenation was seen as a negative and immoral thing. (Correct me if I&#39;m mistaken.) Did white men who sexually assaulted slaves hope that no child would result from it? Or did slaveowners want children to result from their relations with enslaved women since the child would be considered a slave? Was sexually assaulting enslaved women ever viewed as or rationalized as a way to increase the slaveholder&#39;s property?</p>\n\n<p>- Were male slaves commonly sexually abused by slaveholders? Was it seen as &quot;safer&quot; since no children would be born of it?</p>\n\n<p>- What would other Southern men of the planter class think of a slaveholder who had a reputation for sexual violence toward slaves?</p>\n\n<p>- What about Southern women who owned slaves in their own right? Would a female slaveowner prevent male members of the household (perhaps the husband) from sexually assaulting slaves that were held in her name? Would she turn a blind eye to it?</p>\n\n<p>- What would happen to a child fathered by a slave but born to a white woman? (Presumably by coercion, but that made me think of another question. Were slaveholders afraid that male slaves might pose a threat to the white women of the household?)</p>\n\n<p>- Were poor whites aware of sexual violence toward slaves? What did they think? Would they look down on the planters that did this?</p>\n\n<p>Additionally, I am reading the book <em>The End of the Myth: From the Frontier to the Border Wall in the Mind of America</em> and came across this passage in chapter four, &quot;The Safety Valve.&quot;</p>\n\n<p>&gt;Increasingly through the decades leading to the Civil War, abolitionists began to identify slavery as a moral evil, corrosive of Republican principles, and slavers responded by defending the institution as a &quot;positive good,&quot; helping to elevate republican virtue. [...]  Rape was an instrument of this refinement. Enslaved women were, as defenders of slavery put it, &quot;safety valves,&quot; helping to redirect the lust of white men away from white women and allowing southerners to distinguish their section of the country as genteel and mannerly. Samuel Rutherford, a Knoxville, Georgia, slaver, wrote New York&#39;s <em>Jamestown Journal</em> to complain about its anti-slavery editorial, which described the regime of sexual terror enslaved women lived under in the South. Rutherford admitted the truth of the editorial but said that sexual access to enslaved women worked as a &quot;safety valve to the virtues of our white females, who are far superior in virtue to your northern females.&quot;</p>\n\n<p>Was this sort of argument common, that sexual violence toward enslaved women was good because it redirected lustful passions away from white women?</p>\n</div><!-- SC_ON -->",
  "score": 132,
  "permalink": "/r/AskHistorians/comments/pzgww5/how_did_white_southerners_in_the_us_view_sexual/",
  "subreddit": "AskHistorians",
  "id": "pzgww5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I have many questions. I've tried to break them down here.\n\n- Would the other members of a slave owner's household be aware of, or suspect,\nthat the owner was sexually assaulting slaves?\n\n- How would a southern patriarch react if he found out that his son was sexually\nassaulting slaves?\n\n- Did other…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "たくさんの質問があります。ここでは、それらを分解してみました。\n\n- 奴隷所有者の家庭の他のメンバーは、所有者が奴隷に性的暴行を加えていたことを知っていたでしょうか、あるいは疑っていたでしょうか。\n疑うでしょうか？\n\n- 南部の家長は、自分の息子が奴隷に性的暴行を加えていることを知ったら、どう反応するでしょうか？\n南部の家長はどう反応するでしょうか？\n\n- 他の...",
      "title": "アメリカの南部の白人は、奴隷に対する性的暴力をどのように見ていたのでしょうか。奴隷所有者以外の人々には、このような行為はどの程度知られていたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我有很多问题。我试着在这里把它们分开。\n\n- 奴隶主家中的其他成员是否知道或怀疑。\n奴隶主正在对奴隶进行性侵犯？\n\n- 如果一个南方的家长发现他的儿子在对奴隶进行性侵犯，他会有什么反应？\n侵犯奴隶？\n\n- 其他...",
      "title": "美国的南方白人如何看待针对奴隶的性暴力？这种做法对非奴隶主来说有多大的知名度？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我有很多問題。我試着在這裏把它們分開。\n\n- 奴隸主家中的其他成員是否知道或懷疑。\n奴隸主正在對奴隸進行性侵犯？\n\n- 如果一個南方的家長髮現他的兒子在對奴隸進行性侵犯，他會有什麼反應？\n侵犯奴隸？\n\n- 其他...",
      "title": "美國的南方白人如何看待針對奴隸的性暴力？這種做法對非奴隸主來說有多大的知名度？"
    }
  ]
}