{
  "author": "athozintra",
  "original_created_utc": 1638832102,
  "title": "The modern era has produced some fantastic science fiction literature that imagines what humanity’s future might look like, questioning the limits of humanity and its place in the universe. Are there examples of ancient cultures producing texts that might be called “science fiction” in this way?",
  "created_utc": 1638863096,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Did ancient cultures have any intriguing visions of the future in this vein? I understand perceptions of time were different in different cultures and times, but are there examples of humans imagining a technologically advanced or “enlightened” (etc.) point in the future? &lt;/p&gt;\n\n&lt;p&gt;If not, why is this specifically a product of modern thinking?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/rakg19/the_modern_era_has_produced_some_fantastic/",
  "subreddit": "AskHistorians",
  "id": "rakg19",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Did ancient cultures have any intriguing visions of the future in this vein? I\nunderstand perceptions of time were different in different cultures and times,\nbut are there examples of humans imagining a technologically advanced or\n“enlightened” (etc.) point in the future?\n\nIf not, why is this…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "古代の文化には、このような魅力的な未来像があったのでしょうか。I\n文化や時代によって、時間の感じ方が違うのはわかります。\nが、人類が技術的に進歩した、あるいは技術的に進歩したことを想像した例はあるのでしょうか。\n未来の「悟り」（etc.）を開いた地点なのでしょうか？\n\nもしそうでなければ、なぜこのような...",
      "title": "現代では、人類の未来を想像し、人類の限界や宇宙での地位を問う、素晴らしいSF文学が生まれています。古代の文化でも、このような「SF」と呼ばれるような文章を生み出した例はあるのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "古代文化中是否有这种耐人寻味的未来愿景？I\n我知道在不同的文化和时代对时间的看法是不同的。\n但是否有例子表明，人类想象出了一个技术先进的或\n\"开明\"（等等）的未来点？\n\n如果没有，为什么这...",
      "title": "现代产生了一些奇妙的科幻文学，想象人类的未来会是什么样子，质疑人类的极限和它在宇宙中的地位。是否有古代文化产生的文本以这种方式被称为 \"科幻小说 \"的例子？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "古代文化中是否有這種耐人尋味的未來願景？I\n我知道在不同的文化和時代對時間的看法是不同的。\n但是否有例子表明，人類想象出了一個技術先進的或\n\"開明\"（等等）的未來點？\n\n如果沒有，爲什麼這...",
      "title": "現代產生了一些奇妙的科幻文學，想象人類的未來會是什麼樣子，質疑人類的極限和它在宇宙中的地位。是否有古代文化產生的文本以這種方式被稱爲 \"科幻小說 \"的例子？"
    }
  ]
}