{
  "author": "Mediocre-Title420",
  "original_created_utc": 1638547435,
  "title": "What would be a productive way to spend two months in bed?",
  "created_utc": 1638566039,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So basically I have to get two surgeries that are going to keep me in bed pretty much all of the time for about 2 months. During this time I would like to be able to be productive instead of wasting that time just watching TV, reading, etc. I should also note that I should (hopefully) be lucid and not hopped up on too many drugs, so my mental capacities should still all be there. However for the life of me I can’t figure out what would be the best use of the time. I don’t have a job that would allow me to accomplish anything from working remotely. So I’m turning to Reddit to see what y’all think.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/r82erh/what_would_be_a_productive_way_to_spend_two/",
  "subreddit": "NoStupidQuestions",
  "id": "r82erh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So basically I have to get two surgeries that are going to keep me in bed pretty\nmuch all of the time for about 2 months. During this time I would like to be\nable to be productive instead of wasting that time just watching TV, reading,\netc. I should also note that I should (hopefully) be lucid and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "だから、基本的には2つの手術を受けなければならず、かなり寝たきりになりそうだ。\n約2ヶ月間、ずっとです。この間、私は\nテレビを見たり、本を読んだりして時間を浪費するのではなく、生産的に過ごすことができるのです。\nなどです。また、私は（できれば）明晰であるべきであることに留意すべきです...",
      "title": "2ヶ月間のベッドでの生産的な過ごし方とは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，基本上我必须接受两个手术，这将使我在大约两个月的时间内几乎一直躺在床上。\n大约2个月的时间里，几乎所有的时间都在床上。在这段时间里，我希望能够\n能够有所作为，而不是把时间浪费在看电视、读书上。\n等。我还应该注意，我应该（希望）是清醒的，并且...",
      "title": "在床上度过两个月的时间，怎样才算有成效？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，基本上我必須接受兩個手術，這將使我在大約兩個月的時間內幾乎一直躺在牀上。\n大約2個月的時間裏，幾乎所有的時間都在牀上。在這段時間裏，我希望能夠\n能夠有所作爲，而不是把時間浪費在看電視、讀書上。\n等。我還應該注意，我應該（希望）是清醒的，並且...",
      "title": "在牀上度過兩個月的時間，怎樣纔算有成效？"
    }
  ]
}