{
  "author": "RusticBohemian",
  "original_created_utc": 1642452914,
  "title": "Barbary pirates prowled the English channel for most of the 17th century, abducting English people into slavery and taking them to Tripoli and Algiers. Hundreds were taken. Why couldn't the English Navy put a stop to this?",
  "created_utc": 1642472966,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Rumors held that as many as sixty Barbary men-of-war were actively prowling the English Channel, waiting for the opportunity to capture more product for the slave markets of Algiers and Tripoli. For most of the seventeenth century, an English or Irish family living near the coast confronted the real possibility that the might be hauled off without warning….[the] numbers suggest that the odds of sudden enslavement by Barbary pirates were far higher for the average Devonshire resident than the odds of experiencing a terrorist attack in a modern-day Western City.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;From Steven Johnson’s &amp;quot;Enemy of All Mankind.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 109,
  "permalink": "/r/AskHistorians/comments/s6elu9/barbary_pirates_prowled_the_english_channel_for/",
  "subreddit": "AskHistorians",
  "id": "s6elu9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "> Rumors held that as many as sixty Barbary men-of-war were actively prowling\n> the English Channel, waiting for the opportunity to capture more product for\n> the slave markets of Algiers and Tripoli. For most of the seventeenth century,\n> an English or Irish family living near the coast confronted…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "> 噂では60隻ものバーバリー船が活発に徘徊していたという。\n> 英仏海峡で、より多くの生産物を捕獲する機会を待っていたのです。\n> アルジェやトリポリの奴隷市場。17世紀の大半の間\n> 海岸近くに住むイギリスやアイルランドの家庭が直面したのは......。",
      "title": "バーバリー海賊は17世紀の大半、イギリス海峡を徘徊し、イギリス人を奴隷として拉致し、トリポリやアルジェに連行した。何百人もがさらわれた。なぜ、イギリス海軍はこれを阻止できなかったのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "> 有传言说，有多达60艘巴巴里战舰正在积极徘徊\n> 英吉利海峡，等待机会为阿尔及尔和的黎波里的奴隶市场捕获更多产品。\n> 阿尔及尔和的黎波里的奴隶市场。在十七世纪的大部分时间里。\n> 生活在海岸附近的英国或爱尔兰家庭面临着...",
      "title": "巴巴里海盗在17世纪的大部分时间里在英吉利海峡徘徊，绑架英国人为奴，并将他们带到的黎波里和阿尔及尔。数百人被带走。为什么英国海军不能制止这种情况？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "> 有傳言說，有多達60艘巴巴里戰艦正在積極徘徊\n> 英吉利海峽，等待機會爲阿爾及爾和的黎波里的奴隸市場捕獲更多產品。\n> 阿爾及爾和的黎波里的奴隸市場。在十七世紀的大部分時間裏。\n> 生活在海岸附近的英國或愛爾蘭家庭面臨着...",
      "title": "巴巴里海盜在17世紀的大部分時間裏在英吉利海峽徘徊，綁架英國人爲奴，並將他們帶到的黎波里和阿爾及爾。數百人被帶走。爲什麼英國海軍不能制止這種情況？"
    }
  ]
}