{
  "author": "expeditedcube",
  "the_new_excerpt": "Everytime I feel the urge to munch down on a burger or gorge on nachos after an\narduous day, I cant help but feel that 5-10 dollars of pleasure could have gone\nto support an animal liberation group or a charity that objectively need the\nmoney more than I do my need for taste.\n\nWhat is this feeling…",
  "original_created_utc": 1624185598,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "一日の終わりに、ハンバーガーやナチョスを食べたいと思うたびに\n苦労した一日の終わりにハンバーガーやナチョスを食べたいと思うたびに、5～10ドルの喜びが、動物解放団体や客観的に必要としている慈善団体の支援に使えたのではないかと思わずにはいられません。\n動物解放団体や、客観的にお金を必要としている慈善団体を支援するために使えたのではないかと思います。\n5～10ドルの喜びは、動物解放団体や慈善団体を支援するために使うことができたはずだ。\n\nこの感覚は何だろう...。",
      "title": "社会的な目的のために使うことができるはずのお金を、レズビアンに使うことを道徳的に正当化することができますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "每当我在辛苦工作了一天之后，有了啃汉堡或大吃玉米片的冲动时\n我不禁感到，5-10美元的快乐本可以用于支持动物解放组织或客观上需要的慈善机构。\n支持一个动物解放组织或一个客观上需要这些钱的慈善机构。\n比我对味道的需求更需要钱。\n\n这种感觉是什么...",
      "title": "当钱可以用于社会事业时，人们怎么能在道德上为花钱买病痛辩护？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "每當我在辛苦工作了一天之後，有了啃漢堡或大喫玉米片的衝動時\n我不禁感到，5-10美元的快樂本可以用於支持動物解放組織或客觀上需要的慈善機構。\n支持一個動物解放組織或一個客觀上需要這些錢的慈善機構。\n比我對味道的需求更需要錢。\n\n這種感覺是什麼...",
      "title": "當錢可以用於社會事業時，人們怎麼能在道德上爲花錢買病痛辯護？"
    }
  ],
  "title": "How can one morally justify spending money on lesiure when it could have gone towards a social cause?",
  "created_utc": 1624213742,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Everytime I feel the urge to munch down on a burger or gorge on nachos after an arduous day, I cant help but feel that 5-10 dollars of pleasure could have gone to support an animal liberation group or a charity that objectively need the money more than I do my need for taste. </p>\n\n<p>What is this feeling and how do I synthesize it?</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/askphilosophy/comments/o42x4y/how_can_one_morally_justify_spending_money_on/",
  "subreddit": "askphilosophy",
  "id": "o42x4y",
  "is_self": true,
  "media": null,
  "is_video": false
}