{
  "author": "stormbutton",
  "original_created_utc": 1657557267,
  "title": "As an American Jew, I am wondering why “the Jews killed Christ” is used to justify antisemitism by some. Wasn’t his death necessary for salvation per Christian theology?",
  "created_utc": 1657575355,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am aware of the historical inaccuracies regarding the premise itself, but even supposing it were 100% accurate as portrayed by those looking to justify their hatred, isn’t that….good? Didn’t he HAVE to die and rise to spiritually save his followers? &lt;/p&gt;\n\n&lt;p&gt;I know that this “justification” is obviously not perpetuated by all Christian denominations, and I am not trying to be divisive. I’m just really trying to understand.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/NoStupidQuestions/comments/vwmo2r/as_an_american_jew_i_am_wondering_why_the_jews/",
  "subreddit": "NoStupidQuestions",
  "id": "vwmo2r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I am aware of the historical inaccuracies regarding the premise itself, but even\nsupposing it were 100% accurate as portrayed by those looking to justify their\nhatred, isn’t that….good? Didn’t he HAVE to die and rise to spiritually save his\nfollowers?\n\nI know that this “justification” is obviously…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "前提自体に関する歴史的な不正確さは承知していますが、それすらも\n仮にそれが、自分たちの憎しみを正当化しようとする人たちによって描かれた100％正確なものであったとして\n憎しみを正当化しようとする人たちが描くように100％正確だったとしても、それは......良いことではないのでしょうか？を霊的に救うために、死んでよみがえらなければならなかったのではないのでしょうか。\nということなのでしょうか？\n\nこの「正当化」は明らかに...なんでしょうけど。",
      "title": "アメリカのユダヤ人として不思議に思うのは、なぜ「ユダヤ人がキリストを殺した」というのが、一部で反ユダヤ主義を正当化するために使われるのか、ということです。キリスト教の神学では、キリストの死は救いのために必要だったのではないでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道关于前提本身的历史不准确，但即使是\n假设它是100%准确的，就像那些想为自己的仇恨辩护的人所描述的那样。\n仇恨，那不是.... 好吗？他不是必须死而复生以在精神上拯救他的\n的追随者？\n\n我知道，这个 \"理由 \"显然是...",
      "title": "作为一个美国犹太人，我在想为什么 \"犹太人杀死了基督 \"被一些人用来为反犹太主义辩护。按照基督教神学，他的死亡难道不是救赎的必要条件吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道關於前提本身的歷史不準確，但即使是\n假設它是100%準確的，就像那些想爲自己的仇恨辯護的人所描述的那樣。\n仇恨，那不是.... 好嗎？他不是必須死而復生以在精神上拯救他的\n的追隨者？\n\n我知道，這個 \"理由 \"顯然是...",
      "title": "作爲一個美國猶太人，我在想爲什麼 \"猶太人殺死了基督 \"被一些人用來爲反猶太主義辯護。按照基督教神學，他的死亡難道不是救贖的必要條件嗎？"
    }
  ]
}