{
  "author": "No_citation",
  "the_new_excerpt": "I own a bit a VeChain and although I have no doubts about the economic success\nthat the company will have in the future, I felt another kind of worry creep up.\n\nAs is well known, the Chinese government is fked. They enslave Uighur Muslims in\nconcentration camps, massacre any kind opposition, let…",
  "original_created_utc": 1620465681,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はVeChainを少し所有していますが、経済的な成功には疑問を持っていません。\nしかし、私は別の心配をしていました。\n\nよく知られているように、中国政府はクソです。ウイグル人を強制収容所に入れて奴隷にする。\nウイグル人を強制収容所で奴隷にしたり、反対派を虐殺したり......。",
      "title": "VeChainはエシカルな投資ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我拥有一点VeChain，尽管我对该公司未来的经济成功没有任何怀疑。\n尽管我对该公司未来的经济成就毫不怀疑，但我感到另一种担忧悄然而至。\n\n众所周知，中国政府是有问题的。他们将维吾尔族穆斯林奴役在\n集中营，屠杀任何形式的反对派，让...",
      "title": "VeChain是一项道德投资吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我擁有一點VeChain，儘管我對該公司未來的經濟成功沒有任何懷疑。\n儘管我對該公司未來的經濟成就毫不懷疑，但我感到另一種擔憂悄然而至。\n\n衆所周知，中國政府是有問題的。他們將維吾爾族穆斯林奴役在\n集中營，屠殺任何形式的反對派，讓...",
      "title": "VeChain是一項道德投資嗎？"
    }
  ],
  "title": "Is VeChain an ethical investment?",
  "created_utc": 1620484921,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I own a bit a VeChain and although I have no doubts about the economic success that the company will have in the future, I felt another kind of worry creep up.</p>\n\n<p>As is well known, the Chinese government is fked. They enslave Uighur Muslims in concentration camps, massacre any kind opposition, let people disappear on a daily basis, draw developing countries into debt-traps in order to take their resources, AND are developing a truly Orwellian state where everyone is supposed to be monitored 24/7. All those who are detected as enemies of the panopticon, lose privileges (or basic human rights).</p>\n\n<p>As VeChain is a Chinese company, and you can not build a successful business in China without the governments&#39; approval (many billionaires &quot;disappear&quot; quite regularly), and they are developing a technology that is used for trustless monitoring of logistic processes, which seems like something a totalitarian state would know how to use for the surveillance of companies and people, I am worried that I am potentially funding the horrendous practices of an inhumane state.</p>\n\n<p>Have you guys ever had such thoughts? Are my worries misplaced?</p>\n\n<p>Edit: Downvoting without commenting is lazy and you probably are afraid to face the idea.</p>\n</div><!-- SC_ON -->",
  "score": 437,
  "permalink": "/r/CryptoCurrency/comments/n7lfwg/is_vechain_an_ethical_investment/",
  "subreddit": "CryptoCurrency",
  "id": "n7lfwg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985990893
}