{
  "author": "Liamdukerider",
  "the_new_excerpt": "So I’ve been heavily building my portfolio for a while now and I have to ask\nthis question here, because I can’t seem to find answers on google. If I type\nthis into google, I only get results like “You need this much to retire” and\nthey don’t even take index funds into account.\n\nSo if anyone reading…",
  "original_created_utc": 1615868940,
  "localize": [
    {
      "locale": "zh",
      "title": "我的投资组合应该有多大才可以辞职？",
      "the_new_excerpt": "所以，我这段时间一直在重金打造我的投资组合，我必须要问一下\n这个问题在这里，因为我似乎找不到答案的谷歌。如果我输入\n这进入谷歌，我只得到这样的结果 \"你需要这么多的退休 \"和\n他们甚至不考虑指数基金。\n\n所以，如果有人读..."
    },
    {
      "locale": "zh-Hant",
      "title": "我的投資組合應該有多大才可以辭職？",
      "the_new_excerpt": "所以，我這段時間一直在重金打造我的投資組合，我必須要問一下\n這個問題在這裏，因爲我似乎找不到答案的谷歌。如果我輸入\n這進入谷歌，我只得到這樣的結果 \"你需要這麼多的退休 \"和\n他們甚至不考慮指數基金。\n\n所以，如果有人讀..."
    }
  ],
  "title": "How big should my portfolio be before I can quit my job?",
  "created_utc": 1615956275,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I’ve been heavily building my portfolio for a while now and I have to ask this question here, because I can’t seem to find answers on google.\nIf I type this into google, I only get results like “You need this much to retire” and they don’t even take index funds into account.</p>\n\n<p>So if anyone reading this has managed to build their portfolio up to a point where you could quit your job, how much would I need?</p>\n\n<p>I understand that it varies from person to person due to lifestyle choices so I’ll give some info.</p>\n\n<p>I’m a pretty frugal person, I can live off of $10-20k a year quite happily although, I’ll be conservative and say that I might end up spending $50k a year if I decide to start any hobbies or projects that might require some extra cash.\nI’ll either continue stock picking, or if I want to dedicate my time entirely towards a passion or a project, I might just diversify it in multiple assets but put more than 70% into index funds like the S&amp;P 500 and such.\nI’ll keep at least 2 years worth of expenses in cash at all times so that I can live without having to sell any assets at a lousy price in case of a pretty bad market crash.</p>\n\n<p>Now, I hear some people saying “Do the math” and I have, I’ve calculated that I need a little over a million dollars to do be able to quit but I’ve seen other posts where people say that you need much more. I don’t know why they say this though, but I’m assume they know something I don’t. Thanks :)</p>\n\n<p>Edit: I just realized that I may have used the wrong flair. I don’t think I can change it.. Sorry about that.\n(Looks like the mods changed it to the correct flair) thanks mods :)</p>\n\n<p>Edit 2: TL;DR: How much money do I need invested in an index fund at average return rate to retire. Living off of 10-50k a year?</p>\n</div><!-- SC_ON -->",
  "score": 41,
  "permalink": "/r/stocks/comments/m60yre/how_big_should_my_portfolio_be_before_i_can_quit/",
  "subreddit": "stocks",
  "id": "m60yre",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147382533
}