{
  "author": "jblair814",
  "the_new_excerpt": "Hey All,\n\n\n\nSo I'm brand new to WSB but bear with me. Once upon a time, when I was very down\non my luck, I walked into a temp agency and asked for any job they could give\nme. What they had was a factory assembly worker on the line at Blackberry in my\nhometown of Waterloo, Canada (yep...Canadian…",
  "original_created_utc": 1622726363,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。\n\n\n\n私はWSBに参加したばかりですが、ご理解ください。昔々、私がとても落ち込んでいた時に\n派遣会社に入って、どんな仕事でもいいから欲しいと頼んだんです。\n依頼しました。そこにあったのは、私の故郷であるカナダのウォータールーにあるブラックベリー社のラインでの工場組み立て作業員でした。\n私の故郷であるカナダのウォータールーにあるブラックベリー社のラインでの工場組み立て作業員でした（そう...カナダ人...）。",
      "title": "むかしむかし、私はBBの工場で働いていました。BBは私の命を救ってくれました。今回もそうなるかもしれません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嗨，大家好。\n\n\n\n所以我是WSB的新手，但请容忍我。很久很久以前，当我非常倒霉的时候\n的时候，我走进一家临时工机构，要求他们给我任何工作。\n我。他们提供的是我家乡滑铁卢的黑莓公司生产线上的一名工厂装配工人。\n我的家乡加拿大滑铁卢（是的......加拿大......",
      "title": "很久以前，我是一名BB工厂的工人。BB救了我的命。它可能会再次这样做。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嗨，大家好。\n\n\n\n所以我是WSB的新手，但請容忍我。很久很久以前，當我非常倒黴的時候\n的時候，我走進一家臨時工機構，要求他們給我任何工作。\n我。他們提供的是我家鄉滑鐵盧的黑莓公司生產線上的一名工廠裝配工人。\n我的家鄉加拿大滑鐵盧（是的......加拿大......",
      "title": "很久以前，我是一名BB工廠的工人。BB救了我的命。它可能會再次這樣做。"
    }
  ],
  "title": "Once upon a time, I was a BB factory worker. BB saved my life. It might do so again.",
  "created_utc": 1622743444,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey All,</p>\n\n<p>&#x200B;</p>\n\n<p>So I&#39;m brand new to WSB but bear with me. Once upon a time, when I was very down on my luck, I walked into a temp agency and asked for any job they could give me. What they had was a factory assembly worker on the line at Blackberry in my hometown of Waterloo, Canada (yep...Canadian alert!). It was a 12hr job with day/night swapping shifts. It was a repetative, monotonous job putting screws into things and doing it all in style in a zero static white suit and blue boots. It was most definitely NOT what I had envisioned for myself for the rest of my life. However, that job would turn out to be one of the most rewarding short-term jobs I&#39;ve ever had because I sat next to some truly wonderful people on the assembly line. </p>\n\n<p>With nothing to do for 12hrs but shoot the sh*t, I soon discovered that I was sitting next to doctors from Iran, lawyers from Indonesia, CEOs from Pakistan. Each of them had come to this job out of desperation just like me. Each of them were deemed &quot;overqualified&quot; by most other jobs just like me. Each of them had worked hard, invested in company shares (BB had an amazing employee share program) and had made more money there than they could have dreamed. BB had given them the promise of a real future in Canada and you could see the passion they had for this company in their faces. Also, BB once a year rented out the Air Canada Centre (or Rogers or whatever the hell its called now...) and rented a rock band for their employees! Like...ALL of their employees...not just management. I saw ACDC, Steven Tyler, Van Halen and the Tragically Hip. All thanks to BB. They wanted to spread the love. </p>\n\n<p>So I got over myself and how I wasn&#39;t where I wanted to be, and I used this job to give myself a crash-course on global politics from the amazing people I worked with. I learned about the so-called &quot;scary&quot; parts of the world and how beautiful they actually were. When the time came to leave that job and move on to other things, I left with a profound appreciation for hard-working immigrants and just how much dedication it takes to sit down at a factory bench with a $200k salary potential education, and screw things together for $14/hr. I&#39;ll never forget those people. And I&#39;ll never forget that company. Blackberry gave life, employment, education grants, city improvements and other amazing opportunities to my hometown of Waterloo. When the time came that Apple overtook them and Blackberry faltered, my hometown and the rest of Canada turned its back on them, and that disgusted me. </p>\n\n<p>THAT is why I am investing in BB today. Not for a get-rich-quick scheme, but because I genuinely hold a special place in my heart for that company and can find way more emotional attachment to it than a TV channel I used to watch, and a place where I used to buy Ace Combat as a kid. </p>\n\n<p>TLDR; BB was once the bright future of Canadian tech industry, it carried me through tough times as an employee, and I respect it.</p>\n</div><!-- SC_ON -->",
  "score": 7794,
  "permalink": "/r/wallstreetbets/comments/nrdbzc/once_upon_a_time_i_was_a_bb_factory_worker_bb/",
  "subreddit": "wallstreetbets",
  "id": "nrdbzc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404890215
}