{
  "author": "JARVIS__78",
  "the_new_excerpt": "I've recently left Christianity, and this is the main question I'm grappling\nwith. Take what are, at least in my opinion, the two basic \"moral\" standards\nmost people hold: the golden rule and justice/fairness. From a religious\nperspective, actions in line with these principles are objectively good…",
  "original_created_utc": 1611642215,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我最近离开了基督教，这是我正在努力解决的主要问题。\n与。以至少在我看来，两个基本的 \"道德 \"标准是什么？\n大多数人认为：金科玉律和正义/公平。从宗教\n角度，符合这些原则的行为客观上是好的...",
      "title": "(如何)没有宗教，道德可以存在吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近離開了基督教，這是我正在努力解決的主要問題。\n與。以至少在我看來，兩個基本的 \"道德 \"標準是什麼？\n大多數人認爲：金科玉律和正義/公平。從宗教\n角度，符合這些原則的行爲客觀上是好的...",
      "title": "(如何)沒有宗教，道德可以存在嗎？"
    }
  ],
  "title": "(How) Can morals exist without religion?",
  "created_utc": 1611690157,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve recently left Christianity, and this is the main question I&#39;m grappling with. \nTake what are, at least in my opinion, the two basic &quot;moral&quot; standards most people hold: the golden rule and justice/fairness. From a religious perspective, actions in line with these principles are objectively good because they please god. But without religion, are there any real grounds for saying that a just act is somehow better than an unjust one? Or that serving others is better than serving self? Couldn&#39;t these principles be reduced to modes of behavior people tend to like?\nI am familiar with plato&#39;s argument in the republic that justice is beneficial to the individual and society as a whole, but I don&#39;t really find it all that convincing (as grounds for cleaning that justice is &quot;good&quot; and injustice is &quot;bad&quot;), so I am more interested in theories that don&#39;t rely on self-benefit (Or perhaps something more convincing than plato).</p>\n</div><!-- SC_ON -->",
  "score": 143,
  "permalink": "/r/askphilosophy/comments/l57zlp/how_can_morals_exist_without_religion/",
  "subreddit": "askphilosophy",
  "id": "l57zlp",
  "is_self": true,
  "media": null,
  "is_video": false
}