{
  "author": "Qtredit",
  "original_created_utc": 1642346773,
  "title": "2022 just started and I've already fucked up my portfolio bad",
  "created_utc": 1642404934,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So how did you manage to fuck your portfolio up this year?&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not gonna name the coin, but it&amp;#39;s one of the few that made some nice profits during this dip.&lt;/p&gt;\n\n&lt;p&gt;I owned a nice bag of it and sold a few days before it did those nice gains thinking I&amp;#39;d be better off with fiat during the dip.&lt;/p&gt;\n\n&lt;p&gt;Usually I buy before crashes, so at least it&amp;#39;s a new type of mistake. &lt;/p&gt;\n\n&lt;p&gt;I thought that in 2022 I&amp;#39;d make better choices and decisions with my crypto. Currently just HODLing.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;How about you? Which stupid mistakes have you made with your crypto?&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 302,
  "permalink": "/r/CryptoCurrency/comments/s5e39o/2022_just_started_and_ive_already_fucked_up_my/",
  "subreddit": "CryptoCurrency",
  "id": "s5e39o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So how did you manage to fuck your portfolio up this year?\n\nI'm not gonna name the coin, but it's one of the few that made some nice profits\nduring this dip.\n\nI owned a nice bag of it and sold a few days before it did those nice gains\nthinking I'd be better off with fiat during the dip.\n\nUsually I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "で、今年はどうやってポートフォリオをめちゃくちゃにしたんだ？\n\nコインの名前は言いませんが、いくつかの素晴らしい利益を得たものの1つです。\nこの下落の間に。\n\n私はこのバッグをたくさん持っていましたが、その数日前に売りました。\nフィアットの方がいいと思っていた。\n\nいつもは...",
      "title": "2022年始まったばかりなのに、すでにポートフォリオをめちゃくちゃにしてしまった"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "那么，你今年是如何将你的投资组合搞得一团糟的？\n\n我不会说出那枚硬币的名字，但它是为数不多的在这次下跌中赚了不少钱的硬币之一。\n在这次下跌中赚了不少钱。\n\n我拥有一个很好的袋子，但在它取得那些不错的收益之前几天就卖掉了\n认为在下跌过程中，我用法币会更好。\n\n通常情况下，我...",
      "title": "2022年刚刚开始，我已经把我的投资组合搞砸了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "那麼，你今年是如何將你的投資組合搞得一團糟的？\n\n我不會說出那枚硬幣的名字，但它是爲數不多的在這次下跌中賺了不少錢的硬幣之一。\n在這次下跌中賺了不少錢。\n\n我擁有一個很好的袋子，但在它取得那些不錯的收益之前幾天就賣掉了\n認爲在下跌過程中，我用法幣會更好。\n\n通常情況下，我...",
      "title": "2022年剛剛開始，我已經把我的投資組合搞砸了。"
    }
  ]
}