{
  "author": "Flamingo2k",
  "the_new_excerpt": "I’ve had Wirex since last October and was pretty pleased with the service as I\ncould exchange foreign currencies with bitcoin and could use my Wirex VISA debit\ncard literally anywhere in the world. As I slowly gained trust over the system,\nI have put a ton of money into my Wirex debit card (over…",
  "original_created_utc": 1612101239,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我从去年10月开始使用Wirex，我对服务非常满意，因为我觉得我的服务很好。\n可以用比特币兑换外币，可以使用我的Wirex VISA借记卡。\n卡的字面意思是世界上任何地方。当我慢慢获得了对系统的信任。\n我在我的Wirex借记卡里存了一大笔钱（超过...",
      "title": "请不要从Wirex购买比特币! Wirex是一个彻头彻尾的骗局，请注意欺诈。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我從去年10月開始使用Wirex，我對服務非常滿意，因爲我覺得我的服務很好。\n可以用比特幣兌換外幣，可以使用我的Wirex VISA借記卡。\n卡的字面意思是世界上任何地方。當我慢慢獲得了對系統的信任。\n我在我的Wirex借記卡裏存了一大筆錢（超過...",
      "title": "請不要從Wirex購買比特幣! Wirex是一個徹頭徹尾的騙局，請注意欺詐。"
    }
  ],
  "title": "Please don’t buy Bitcoin from Wirex! Wirex is a total scam please be aware of fraud",
  "created_utc": 1612121615,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve had Wirex since last October and was pretty pleased with the service as I could exchange foreign currencies with bitcoin and could use my Wirex VISA debit card literally anywhere in the world. As I slowly gained trust over the system, I have put a ton of money into my Wirex debit card (over 15000 USD) and even invested in their crowdfunding campaign. But then, this past month, all of a sudden, they’ve blocked my account miraculously and so I couldn’t get access to my funds in the card. I tried contacting customer service but there isn’t really a customer service hotline to call and they never once responded to my emails. So, I think I’ve lost 15000 USD in total. </p>\n\n<p>What I’ve read online (which I really should have done before) is they’re probably pulling an exit scam. Gaining good ratings through smaller accounts while blocking bigger accounts with larger $$. I’ve read other dodgy things about them. </p>\n\n<p>Reported this incident to the London Police and Financial Ombudsman. Hopefully, I can get my funds back but I think it’s gonna be a fight. </p>\n\n<p>Only bitcoin based companies I trust so far is Coinbase but please be aware of financial companies claiming that they sell bitcoin especially with the recent Bitcoin Frenzy. Research research research!</p>\n</div><!-- SC_ON -->",
  "score": 580,
  "permalink": "/r/Bitcoin/comments/l9cp4o/please_dont_buy_bitcoin_from_wirex_wirex_is_a/",
  "subreddit": "Bitcoin",
  "id": "l9cp4o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518523393
}