{
  "author": "Lewis_0683",
  "original_created_utc": 1631819861,
  "title": "let's not ridicule people who have made potentially bad investments",
  "created_utc": 1631835021,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So with Shibu Inu looking like it&#39;s made some new bag holders today like back in May. I&#39;ve noticed the usual horrible messages etc coming out of the woodwork. I get it you might think it&#39;s a shitcoin I personally don&#39;t rate it. But why then make people feel bad they probably already know they&#39;ve already messed up. It might well be the first crypto someone has ever brought and too then be ridiculed they might decide they want out of crypto. The community should be trying to make people feel welcome not rip shreds off them? </p>\n\n<p>I personally made a simlar mistake with Doge coin back in February. I&#39;m glad I took everything off here with a pinch of salt, then looked into other crypto and haven&#39;t  looked back since. </p>\n\n<p>Obviously no one knows what shib is going to do next up or down. I&#39;m just making an observation from posts off here</p>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/CryptoCurrency/comments/ppjzu1/lets_not_ridicule_people_who_have_made/",
  "subreddit": "CryptoCurrency",
  "id": "ppjzu1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So with Shibu Inu looking like it's made some new bag holders today like back in\nMay. I've noticed the usual horrible messages etc coming out of the woodwork. I\nget it you might think it's a shitcoin I personally don't rate it. But why then\nmake people feel bad they probably already know they've…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "渋犬は、5月に引き続き、今日も新しいバッグホルダーを作ったようです。\n5月。いつものようにひどいメッセージなどが出てきていることに気づきました。I\n私は個人的には評価していませんが、あなたはこのコインをクソだと思うかもしれません。しかし、なぜそれで\nしかし、なぜ人々に嫌な思いをさせるのか、おそらく彼らはすでに知っているだろう...",
      "title": "間違った投資をしてしまった人を嘲笑うのはやめよう"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，随着涉猎者看起来今天做了一些新的持袋者，就像早在\n5月。我注意到通常的可怕的信息等从树林里出来。I\n我明白，你可能认为这是一个狗屎币，我个人并不评价它。但为什么呢？\n让人们感觉不好，他们可能已经知道他们已经...",
      "title": "我们不要嘲笑那些做了潜在的错误投资的人。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，隨着涉獵者看起來今天做了一些新的持袋者，就像早在\n5月。我注意到通常的可怕的信息等從樹林裏出來。I\n我明白，你可能認爲這是一個狗屎幣，我個人並不評價它。但爲什麼呢？\n讓人們感覺不好，他們可能已經知道他們已經...",
      "title": "我們不要嘲笑那些做了潛在的錯誤投資的人。"
    }
  ]
}