{
  "author": "RAMB0NER",
  "the_new_excerpt": "This has honestly bothered me for a while now. I am 26 years old (in the US)\nwith a decent-ish government job and I am slamming money away into a 457(b)\nprogram and all that, but I can't help but feel that it might end up being\npointless. I hope to retire around 55y/o, but I could envision the…",
  "original_created_utc": 1617352638,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "说实话，这个问题已经困扰我一段时间了。我今年26岁(在美国)\n有一份体面的政府工作，而我正在把钱投入457(b)。\n程序等等，但我不禁觉得，它可能最终会被\n毫无意义。我希望在55岁左右退休，但我可以设想... ...",
      "title": "投资与气候变化的前景"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "說實話，這個問題已經困擾我一段時間了。我今年26歲(在美國)\n有一份體面的政府工作，而我正在把錢投入457(b)。\n程序等等，但我不禁覺得，它可能最終會被\n毫無意義。我希望在55歲左右退休，但我可以設想... ...",
      "title": "投資與氣候變化的前景"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "これは正直なところ、以前から気になっていました。私は26歳(米国)で、そこそこの政府の仕事をしています。\n適当な政府の仕事をしていて、457(b)プログラムにお金を突っ込んでいます。\nプログラムなどにお金をつぎ込んでいるのですが、それが無意味に終わってしまうのではないかと\n無駄になってしまうような気がしてなりません。私は55歳くらいで引退したいと思っていますが、そのようなことは考えられませんでした。",
      "title": "気候変動を見据えた投資とは"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "これは正直なところ、以前から気になっていました。私は26歳(米国)で、そこそこの政府の仕事をしています。\n適当な政府の仕事をしていて、457(b)プログラムにお金を突っ込んでいます。\nプログラムなどにお金をつぎ込んでいるのですが、それが無意味に終わってしまうのではないかと\n無駄になってしまうような気がしてなりません。私は55歳くらいで引退したいと思っていますが、そのようなことは考えられませんでした。",
      "title": "気候変動を見据えた投資とは"
    }
  ],
  "title": "Investing w/ Climate Change on the Horizon",
  "created_utc": 1617434807,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This has honestly bothered me for a while now.  I am 26 years old (in the US) with a decent-ish government job and I am slamming money away into a 457(b) program and all that, but I can&#39;t help but feel that it might end up being pointless.  I hope to retire around 55y/o, but I could envision the market getting wrecked by that time due to climate disasters.</p>\n\n<p>I know the market historically averages ~7% per year, but the odds of ideal market conditions continuing to 2050 just seem so low.  Does anyone else feel pessimistic about the financial market leading into the future?  It just keeps getting harder and harder for me to justify investing rather than leading a better life now while the opportunity is still there...</p>\n</div><!-- SC_ON -->",
  "score": 77,
  "permalink": "/r/investing/comments/mig57o/investing_w_climate_change_on_the_horizon/",
  "subreddit": "investing",
  "id": "mig57o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961877879
}