{
  "author": "RovCal_26",
  "the_new_excerpt": "This post is not a typical analysis. This is my personal observation.\n\nTo make the post more interesting let me introduce a grading or tier system for\nAlphabets various products\n\nTier 1 - Supreme Monopoly\n\nTier 2 - Monopoly but competition exist\n\nTier 3 - Excellent market share but not a…",
  "original_created_utc": 1609366976,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这篇文章不是典型的分析。这是我个人的观察。\n\n为了使这篇帖子更有趣，让我为以下内容引入一个分级或分级系统\n字母表各种产品\n\n第1级-最高垄断\n\n第2级-垄断，但存在竞争\n\n第3级-出色的市场份额，但不是…",
      "title": "为什么我对字母表很感兴趣？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這篇文章不是典型的分析。這是我個人的觀察。\n\n爲了使這篇帖子更有趣，讓我爲以下內容引入一個分級或分級系統\n字母表各種產品\n\n第1級-最高壟斷\n\n第2級-壟斷，但存在競爭\n\n第3級-出色的市場份額，但不是…",
      "title": "爲什麼我對字母表很感興趣？"
    }
  ],
  "title": "Why I am long on Alphabet",
  "created_utc": 1609417831,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p>This post is not a typical analysis. This is my personal observation.</p>\n\n<p>To make the post more interesting let me introduce a grading or tier system for Alphabets various products</p>\n\n<p>Tier 1 - Supreme Monopoly</p>\n\n<p>Tier 2 - Monopoly but competition exist</p>\n\n<p>Tier 3 - Excellent market share but not a monopoly</p>\n\n<p>Tier 4 - Good market share but somewhat far from the big boys</p>\n\n<p>Tier 5 - Decent market share and significantly far away from the mainstream products.</p>\n\n<p>Tier 6 - Future Potential</p>\n\n<p>Yesterday, GOOGL closed at 1757.76 and GOOG closed at 1758.72. Current P/E ratio is 35.42 and 35.47 respectively. S&amp;P 500 average P/E ratio at market close is at 37.56. Cheap tech stock what!</p>\n\n<p>I am gonna try my best to justify why Alphabet is that one stock you buy and hold forever, Alphabet is a safe bet, pun intended. </p>\n\n<p>As mentioned above, we will divide Alphabet into levels or tiers, with tier 1 product being the supreme one, supreme product is something that is irreplaceable and competition is not possible unless a company messes it up themself.  </p>\n\n<p>A company is absolutely safe for investment if they have a moat that is almost impossible to beat. For example, Amazon! there online retail business is almost impossible to beat. Because investment alone won&#39;t be enough to out do what they have achieved, amazon has amazing delivery time logistics, lots of products and so on. </p>\n\n<p>Then there are monopolies that a competitor can challenge for example google maps! we have apple maps and recently amazon announced AWS maps for company use. </p>\n\n<p>So what does Alphabet has that is unbeatable that is Level 1. </p>\n\n<p>you might think &#39;&#39;google search&#39;&#39;, but the </p>\n\n<p>answer is Youtube. </p>\n\n<p>Youtube is a beast like no other, the thing is a product becomes indispensable when money is not the only investment involved. Billions of hours of our lives is on this platform. From tutorials to how to videos to live shows to TV shows to News Channels to personal video to everythinggggggg. Youtube is essential and no matter how much money a competitor throws for a competing product it aint gonna be worth it because not only it will be extremely expensive to set up the data centres required and to maintain at the level of Youtube but more importantly you are also relying on people to invest there time in it in the form of uploads and to ditch an established streaming service in favour of something new. A variable not in your control. Based on this absolute monopoly alone that very few companies in the world possess Alphabet is a buy and hold forever!</p>\n\n<p>In contrast Google search for example is a monopoly at the moment and probably will always remain the number 1 search platform in the world but companies left and right release competitive products such as bing because the only investment required here is money. </p>\n\n<p>And Youtube has not achieved its full potential yet, there is still room for growth, especially as it moves towards a subscription based model and then you have the Youtube TV/Google TV product in USofA, wait till that becomes mainstream. </p>\n\n<p>I think in the near Future streaming services like Netflix, Disney plus, Prime TV on one side and Youtube alone on other side (because there is no one like Youtube) will dominate and TV channels will slowly get absorb into them. </p>\n\n<p>Now what about Alphabets other monopolies: Google search, Chrome, Android, Google maps, Gmail. I mean they are the best products in what they offer but they have pretty good competition namely bing, internet explorer/Firefox (love chrome as it over took Internet explorer), iOS, Apple maps, outlook. But having said that these products are likely to lead their respective markets although they will share the customers with their competitors. All of these products are monopoly level products but given they have good competition we label them as Level 2 product.</p>\n\n<p>Now let&#39;s talk about tier 3 products. Again these are the products that are extremely good but the market leader is someone else. Alphabet has amazing products in this tier that are providing revenues in the billions such as Google Cloud Platform(GCP) on one hand and on the other extreme with modest revenue Google Nest products.</p>\n\n<p>GCP is too big to be named in the same breadth as the other products here, the revenue that GCP  is projected to grow is significant, especially in comparison to other Alphabet revenue sources. If you look at the last quarter, 2020 Q3, GCP brought in 3.44 billion dollars, this is a 45% year over year growth in GCP revenue! pretty sweet; plus by 2025 Cloud market is projected to triple in revenue and hence GCP will be responsible for a bigger chunk of the parent company&#39;s revenue, currently it sits around 10% of the total revenue.</p>\n\n<p>Other products at level 3 includes google sheets/slides/docs (An excellent alternative to MS office. Its free! but it&#39;s unlikely to challenge Microsoft&#39;s monopoly in this regard. Office is such a strong moat even though it is a paid service, google sheets etc will likely remain number 2 in this game)</p>\n\n<p>please note Many of Google products come under the domain of Android and I have made a conscious effort to not name them separately unless they have a massive presence of their own.</p>\n\n<p>another notable entry here, in the near future, will be the fitbit smartwatch (Once that long awaited deal goes through World wide)  </p>\n\n<p>Now we bring our attention to tier 4 products. Again these are those products that are pretty good but are slightly far away at the moment from the main competition. This includes other Google hardware products such as Chromebooks and Pixel Phones. I am sure it won&#39;t be long before these products will move up to Level 3 but are unlikely to gain significant market share in the presence of Apple and Samsung.</p>\n\n<p>Level 5 includes those products that are far away from the main competing brands, a good example includes the Stadia. Which, frankly speaking is amazing but is very unlikely to reach the likes of Nintendo, Microsoft or Sony. Unless Alphabet buys big developers or something.</p>\n\n<p>Level 6 includes those potential products that might have a huge impact in the future, obviously we are talking about Alphabets moonshot division X. X has a lot of projects, I will briefly touch 4 of them. Waymo is the front runner here, followed by Verily, Deepmind and Quantum computer. </p>\n\n<p>Waymo main competition I think is Tesla. Not sure who is gonna come on top but one thing is for sure Waymo will have a significant market share.</p>\n\n<p>Verily is all about using Alphabets massive data for medicine, and Pharmaceutical companies are already paying verily for it&#39;s data to fine tune there future products.</p>\n\n<p>Deepmind another example of Alphabet&#39;s commitment to medicine, using Alphabet AI research to predict how a protein folds. Leading to a new chapter of medicine research and development.</p>\n\n<p>Finally and the project that is in it&#39;s infancy Quantum computing!</p>\n\n<p>this is as fantastic, as tremendous as Elon&#39;s SpaceX mission to Mars. It will be at least a decade before we start understanding and making products with QC. But if successful, it will have the highest potential out of all X&#39;s projects.</p>\n\n<p>If Alphabets projections are achieved than EPS will likely double in around 5-6 years time. Stock price should at least double as well.</p>\n\n<p>There you have it folks.  Hope this was a fun read.</p>\n\n<p>&#x200B;</p>\n\n<p>EDIT 1: All the lawsuits and hoo haa about breaking up the company. Well, first of all it aint gonna happen. But let&#39;s say down the line, even if it does happen. So what!, Now you have multiple shares of promising products! with reliable dividend coming from your Youtube stock your google stock your GCP stock and so on! You just cant go wrong.</p>\n</div><!-- SC_ON -->",
  "score": 53,
  "permalink": "/r/stocks/comments/kncavb/why_i_am_long_on_alphabet/",
  "subreddit": "stocks",
  "id": "kncavb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610100748514
}