{
  "author": "CombatWombat476",
  "original_created_utc": 1629344985,
  "title": "I think about money differently after buying Bitcoin",
  "created_utc": 1629405364,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve always been reasonably careful with my money and not wasting it, but I&#39;ve definitely had some questionable spending decisions in the past, like buying more computer monitors than I strictly need because it looks cool (two helps my productivity, the third is a waste)... or ordering in food when I could perfectly easily make my own... things like that.</p>\n\n<p>Now everytime I spend money, I think of the bitcoin I could be buying instead, and the appreciation of that value vs wasting it in the moment. I consider the prices of things much more carefully than before. It&#39;s kind of profound... I can&#39;t be the only one who expirences this change in thought?</p>\n</div><!-- SC_ON -->",
  "score": 158,
  "permalink": "/r/Bitcoin/comments/p779lz/i_think_about_money_differently_after_buying/",
  "subreddit": "Bitcoin",
  "id": "p779lz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've always been reasonably careful with my money and not wasting it, but I've\ndefinitely had some questionable spending decisions in the past, like buying\nmore computer monitors than I strictly need because it looks cool (two helps my\nproductivity, the third is a waste)... or ordering in food when…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はこれまで、お金を無駄にしないよう、それなりに気をつけてきましたが、過去には\nしかし、過去には問題のある支出をしたこともあります。\nかっこいいからといって、必要以上のコンピューターモニターを買ったり（2つは生産性の向上につながりますが、3つ目は無駄です。\n例えば、かっこいいからという理由で必要以上のコンピューターモニターを購入したり（2つは生産性の向上に役立ちますが、3つ目は無駄です）...あるいは、食事を注文する際に",
      "title": "ビットコインを購入して、お金に対する考え方が変わった"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我总是相当谨慎地对待我的钱，不浪费它，但我过去肯定有一些有问题的消费决定。\n但我在过去肯定有一些有问题的消费决定，如购买\n我买的电脑显示器比我真正需要的多，因为它看起来很酷（两个有助于我的生产力，第三个是浪费）。\n两台有助于我的工作效率，第三台是浪费）......或者在我订餐的时候......。",
      "title": "购买比特币后，我对金钱的看法不同了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我總是相當謹慎地對待我的錢，不浪費它，但我過去肯定有一些有問題的消費決定。\n但我在過去肯定有一些有問題的消費決定，如購買\n我買的電腦顯示器比我真正需要的多，因爲它看起來很酷（兩個有助於我的生產力，第三個是浪費）。\n兩臺有助於我的工作效率，第三臺是浪費）......或者在我訂餐的時候......。",
      "title": "購買比特幣後，我對金錢的看法不同了"
    }
  ]
}