{
  "author": "CONSOLE_LOAD_LETTER",
  "original_created_utc": 1658220889,
  "title": "You don't need a high paying job. You just need an average job, basic financial literacy, and some budget discipline to become financially secure.",
  "created_utc": 1658236135,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;h3&gt;High Paying Jobs But Very Little Wealth&lt;/h3&gt;\n\n&lt;p&gt;I know a lot of people with 6-figure incomes that are basically living paycheck to paycheck or are in debt up to their eyeballs.  I also know a lot of people with median incomes for their area who are much more disciplined and financially literate and have more wealth than the aforementioned 6-figure earners.&lt;/p&gt;\n\n&lt;p&gt;Something I have noticed is that this subreddit and many other crypto centric subreddits are filled with people with poor personal financial literacy and discipline, regardless of their income level.  There are also many people in the crypto space that actually do have a gambling addiction.  I also believe there are many bad faith participants egging these kinds of people on to FOMO invest so they can get their pump and dump short term play quotas in.  These kinds of posts have existed since the days of the early internet in stock discussion newsgroups and dial-up BBS.  Hell, they even existed pre-internet when guys like Jordan Belfort (Wolf of Wall Street) created cold call centers to drive penny stock pump and dumps.  The manipulations are not new, but the scale and speed with which they can be executed due to social media and everyone having access to the internet is and the best way to protect yourself from the knock-on effects is to be educated and financially literate.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;h3&gt;How To Get Financially Literate&lt;/h3&gt;\n\n&lt;p&gt;So how does one achieve financial literacy?  That is a big topic which is too big for a single post.  There are a lot of resources.  Being redditors, you might start here:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://np.reddit.com/r/personalfinance/wiki/commontopics/\"&gt;https://np.reddit.com/r/personalfinance/wiki/commontopics/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;I truly believe every single person in this subreddit should have a strong understanding on the importance of basic personal finance topics like bad vs good debt, emergency funds, budgets, and IRA&amp;#39;s before considering investing anything in crypto.  Without this very basic level of financial literacy, what you are doing is not investing, it&amp;#39;s gambling.  In fact, investing and gambling are very close to the same thing... the main difference is the amount of knowledge and risk management put in place.&lt;/p&gt;\n\n&lt;p&gt;Now keep in mind, many people that are conservative about personal finance are also biased to think in absolute negative terms about emerging technology like crypto.  I am not one of them.  I think crypto should play an important part in many people&amp;#39;s investment portfolio.  However, it is a very high risk investment and should only make up a small portion of most people&amp;#39;s overall investments.  Truly investing only what you can comfortably afford to lose is the best way to approach crypto in these very early, very volatile times.  I know you&amp;#39;ve heard that phrase a thousand times, but many don&amp;#39;t grasp what amount it means to be able to &amp;quot;comfortably lose&amp;quot;.  Basically, even if you are able to pay your bills and still have a 6-month emergency fund, if you are losing sleep over what you have invested or if it&amp;#39;s occupying an uncomfortable amount of your time and thoughts, you probably have invested more than you can comfortably afford to lose.  It&amp;#39;s not just what you can afford to lose and still live just about sustenance level, it&amp;#39;s what you can afford to lose and not feel angry, emotional, or mad about it.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;h3&gt;Responsibly Investing In Crypto&lt;/h3&gt;\n\n&lt;p&gt;I am a strong believer in the technological and societal impact that cryptocurrencies and other decentralized data and processing projects can have in the future.  However, I am also very cautious about my crypto investments because I also have personal experience from the dotcom bubble era to know that volatility is normal for new and emerging technology.  There will some big winners, but also the majority of projects and companies related to crypto will fail.  Be prepared for failure, but also put yourself in a position for taking advantage of opportunities when they come along without risking too much.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;h3&gt;Exceptions&lt;/h3&gt;\n\n&lt;p&gt;Now, I do understand, some people may not be able to get a median level job.  Some have been born into systemic disadvantages, family situations, or other extenuating circumstances that make it very difficult to even get to median level.  For people in these kinds of situations, the best advice I have to give is to just keep building your skillset and your experience.  Also keep networking and making connections.  In my experience, many of the best opportunities come about from knowing the right people, and the more people you know the better your chances of one of them being the right person at the right time.  You don&amp;#39;t have to set the bar too high, just set it somewhere you can realistically aim for and keep building on that.&lt;/p&gt;\n\n&lt;p&gt;Lastly, I also recognize there are people that can get a median level job or better but don&amp;#39;t want to be financially literate or disciplined.  They want to chase the adrenaline of a big win, put it all on the line and try to get rich quick, be lucky, etc.  You know what?  If this is your choice, it&amp;#39;s what makes you happy, and you are not hurting other people with your choices, I&amp;#39;m not one to tell you not to do it if that&amp;#39;s what you want.  Just know it&amp;#39;s your choice, you could have done it a different way that would have virtually guaranteed you at least a certain level of financial security, and even if you &amp;quot;hit it big&amp;quot; there&amp;#39;s also a good chance you might be continuing your bad habits of chasing the adrenaline rush and might lose everything if you never learn basic financial literacy and discipline.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 305,
  "permalink": "/r/CryptoCurrency/comments/w2nyk9/you_dont_need_a_high_paying_job_you_just_need_an/",
  "subreddit": "CryptoCurrency",
  "id": "w2nyk9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "HIGH PAYING JOBS BUT VERY LITTLE WEALTH\n\nI know a lot of people with 6-figure incomes that are basically living paycheck\nto paycheck or are in debt up to their eyeballs. I also know a lot of people\nwith median incomes for their area who are much more disciplined and financially\nliterate and have…"
}