{
  "author": "jerrywagnersfo",
  "the_new_excerpt": "> The Federal Reserve will soon begin selling off the corporate bonds and\n> exchange-traded funds it amassed last year through an emergency-lending\n> vehicle set up to contain the Covid-19 pandemic’s economic fallout.\n> \n> The vehicle, known as the Secondary Market Corporate Credit Facility, or\n>…",
  "original_created_utc": 1622669318,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "> 米連邦準備制度理事会（FRB）は、昨年の緊急融資で積み上げた社債や上場投資信託の\n> 米連邦準備制度理事会（FRB）は、昨年、Covid-19パンデミックによる経済的損失を防ぐために設けられた\n> コビット19のパンデミックによる経済的影響を抑制するために設定された緊急融資制度により、昨年蓄積された社債や上場投資信託の売却を間もなく開始する。\n> \n> セカンダリーマーケット・コーポレート・クレジット・ファシリティ（Secondary Market Corporate Credit Facility）として知られているこのビークルは...。\n>...",
      "title": "FRBは今年、社債型ETFを137億ドル売却へ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "> 美联储将很快开始抛售公司债券和\n> 交易所交易基金，它去年通过一个紧急贷款工具积累的\n> 为控制Covid-19大流行病的经济后果而设立的工具。\n> \n> 该工具被称为 \"二级市场企业信贷机制\"，即\n>...",
      "title": "美联储今年将出售137亿美元的企业债券ETF"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "> 美聯儲將很快開始拋售公司債券和\n> 交易所交易基金，它去年通過一個緊急貸款工具積累的\n> 爲控制Covid-19大流行病的經濟後果而設立的工具。\n> \n> 該工具被稱爲 \"二級市場企業信貸機制\"，即\n>...",
      "title": "美聯儲今年將出售137億美元的企業債券ETF"
    }
  ],
  "title": "The Fed to sell $13.7B in corporate bond ETFs this year",
  "created_utc": 1622676187,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><blockquote>\n<p>The Federal Reserve will soon begin selling off the corporate bonds and exchange-traded funds it amassed last year through an emergency-lending vehicle set up to contain the Covid-19 pandemic’s economic fallout.  </p>\n\n<p>The vehicle, known as the Secondary Market Corporate Credit Facility, or SMCCF, held $5.21 billion of bonds from companies including Whirlpool Corp. , Walmart Inc. and Visa Inc. as of April 30. In addition, it held $8.56 billion of exchange-traded funds that hold corporate debt, such as the Vanguard Short-Term Corporate Bond ETF.  </p>\n\n<p>A Fed official said the sales should be completed by the end of this year. Net proceeds will be remitted to the Treasury Department.  </p>\n\n<p>The Fed’s corporate-debt holdings are distinct from its $7.3 trillion balance sheet of Treasury securities and agency mortgage-backed securities. The central bank is continuing to purchase those types of assets to the tune of at least $120 billion a month as part of its monetary-policy goal of holding down borrowing costs until the economy recovers further from the pandemic.  </p>\n\n<p>The Fed added that its corporate-bond and ETF sales “will aim to minimize the potential for any adverse impact on market functioning by taking into account daily liquidity and trading conditions” for ETFs and corporate bonds.</p>\n</blockquote>\n\n<p><a href=\"https://www.wsj.com/articles/fed-plans-to-sell-13-7-billion-of-corporate-bonds-etfs-by-year-end-11622666400?mod=hp_lead_pos3\">https://www.wsj.com/articles/fed-plans-to-sell-13-7-billion-of-corporate-bonds-etfs-by-year-end-11622666400?mod=hp_lead_pos3</a></p>\n</div><!-- SC_ON -->",
  "score": 1341,
  "permalink": "/r/investing/comments/nqwvbk/the_fed_to_sell_137b_in_corporate_bond_etfs_this/",
  "subreddit": "investing",
  "id": "nqwvbk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804300239
}