{
  "author": "jessedjd",
  "the_new_excerpt": "I'm going to be honest. I'm somewhat of a serious investor. I have a monthly\nbudget that I put into a few coins that I believe in, such as eth, algo, ada and\natom, but my coworkers keep asking about safemoon and these small coins that are\nall coming out, so I decided to have a little fun, and…",
  "original_created_utc": 1619334457,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は正直に言います。私はやや真面目な投資家です。毎月、予算を決めて\n毎月の予算は、eth、algo、ada、atomなど、自分の信じるコインに投入しています。\nアトムなど、自分が信じるコインに毎月予算を投じているのですが、同僚がsafemoonや小さなコインが出てきたことを聞いてくるので\nと聞かれるので、ちょっと遊んでみることにしました。",
      "title": "今日、私は詐欺にあったので、あなたはその必要はありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我将实话实说。我是一个有点严肃的投资者。我每个月都有一个\n我每月有一笔预算，投入到我相信的几个币种中，如eth、algo、ada和atom。\n但我的同事们一直在问safemoon和这些正在出现的小币种。\n所以我决定玩一玩，并且...",
      "title": "今天我被骗了，所以你不必如此。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我將實話實說。我是一個有點嚴肅的投資者。我每個月都有一個\n我每月有一筆預算，投入到我相信的幾個幣種中，如eth、algo、ada和atom。\n但我的同事們一直在問safemoon和這些正在出現的小幣種。\n所以我決定玩一玩，並且...",
      "title": "今天我被騙了，所以你不必如此。"
    }
  ],
  "title": "Today I got scammed, so you don't have to.",
  "created_utc": 1619351021,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m going to be honest. I&#39;m somewhat of a serious investor. I have a monthly budget that I put into a few coins that I believe in, such as eth, algo, ada and atom, but my coworkers keep asking about safemoon and these small coins that are all coming out, so I decided to have a little fun, and dropped $200 into a separate account on trust wallet just to buy some shitcoins and have fun. </p>\n\n<p>Looked at the newest released coins and picked up 2 that I put between $25-$40 just to see what it&#39;s all about. I&#39;m not naming them because honestly, it doesn&#39;t matter. I swung by cryptomoonshots, told myself I was gonna put $50 on the first one I saw, and started the process through pancakeswap. I didn&#39;t read it all too well, but I did find the link easily for a currency called &quot;moonys&quot;. The process finished, and to my surprise, the coins that entered my wallet had no value to them. Thinking this may have been an error of some sort, I turned off my phone for an hour. When I came back, still no value. I tried finding the reddit post and to my complete and utter shock...... it had been deleted. So I&#39;m the proud owner of useless coins and it only cost me $50. (keep in mind this money isn&#39;t going to hurt me at all, and is purely for entertainment purposes) so please remember to do your research, stay away from cryptomoonshots, and never believe anything you read on reddit.....unless it&#39;s from me. Because I&#39;m trustworthy. And stupid. Thank you for your time.</p>\n</div><!-- SC_ON -->",
  "score": 1293,
  "permalink": "/r/CryptoCurrency/comments/my2zn6/today_i_got_scammed_so_you_dont_have_to/",
  "subreddit": "CryptoCurrency",
  "id": "my2zn6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776210445
}