{
  "author": "stopPuking",
  "original_created_utc": 1629116876,
  "title": "I've been taught that when Europeans found the new world, they brought with them many diseases that wiped out the native American population. but- wouldn't this work both ways? wouldnt the colonists encounter new diseases in America that they had no immunity to?",
  "created_utc": 1629132486,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>And yet, I&#39;ve only ever heard the description of how European diseases effected the natives, and not the other way around. Even though- from what I&#39;ve been told- the Europeans had worse hygiene and would rarely bathe, while native americans were cleaner and bathed often. what gives?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/p5f27p/ive_been_taught_that_when_europeans_found_the_new/",
  "subreddit": "AskHistorians",
  "id": "p5f27p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "And yet, I've only ever heard the description of how European diseases effected\nthe natives, and not the other way around. Even though- from what I've been\ntold- the Europeans had worse hygiene and would rarely bathe, while native\namericans were cleaner and bathed often. what gives?",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "しかし、私はヨーロッパの病気が原住民にどのような影響を与えたかという説明しか聞いたことがありません。\nその逆ではありません。でも、私が聞いたところによると\nヨーロッパ人は衛生状態が悪く、ほとんど入浴しません。\nアメリカの先住民は清潔でよく風呂に入っていた。",
      "title": "ヨーロッパ人が新大陸を発見したとき、彼らは多くの病気をもたらし、ネイティブ・アメリカンの人々を絶滅させたと教えられてきました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "然而，我只听说过关于欧洲人的疾病是如何影响到土著人的描述。\n的描述，而不是相反。尽管从我所了解的情况来看\n欧洲人的卫生状况较差，很少洗澡，而美国本土的\n美国人则比较干净，经常洗澡。",
      "title": "我被告知，当欧洲人发现新大陆时，他们带来了许多疾病，消灭了美国本土人口。但是，这不是双向的吗？ 殖民者在美国会不会遇到他们没有免疫力的新疾病？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "然而，我只聽說過關於歐洲人的疾病是如何影響到土著人的描述。\n的描述，而不是相反。儘管從我所瞭解的情況來看\n歐洲人的衛生狀況較差，很少洗澡，而美國本土的\n美國人則比較乾淨，經常洗澡。",
      "title": "我被告知，當歐洲人發現新大陸時，他們帶來了許多疾病，消滅了美國本土人口。但是，這不是雙向的嗎？ 殖民者在美國會不會遇到他們沒有免疫力的新疾病？"
    }
  ]
}