{
  "author": "damipereira",
  "original_created_utc": 1627582296,
  "title": "Is sleep debt from accumulated sleep loss real according to current understanding?",
  "created_utc": 1627601392,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi! I&#39;m trying to learn about sleep debt and what are it&#39;s limits. I found some questions in this subreddit, but they are from many years ago, and I was wondering about the current understanding/latest studies in the subject. And wether or not it is an accepted theory.</p>\n\n<p>I saw a lot of info about complete deprivation of sleep (all nighters). But I&#39;m more interested in chronic sleep loss and subconcious sleep deprivation. For example, if my body naturally needs 8 hours of sleep, and I sleep 7 for months, with some days of 6 hours splashed around, how would that affect my sleep debt and how could I recover?</p>\n\n<p>How much sleep is needed to recover from a months old accumulative sleep debt? Is a few days of unrestrained sleep enough? Or are multiple days of extra sleep across a longer span of time required?</p>\n</div><!-- SC_ON -->",
  "score": 117,
  "permalink": "/r/askscience/comments/ou2wkd/is_sleep_debt_from_accumulated_sleep_loss_real/",
  "subreddit": "askscience",
  "id": "ou2wkd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi! I'm trying to learn about sleep debt and what are it's limits. I found some\nquestions in this subreddit, but they are from many years ago, and I was\nwondering about the current understanding/latest studies in the subject. And\nwether or not it is an accepted theory.\n\nI saw a lot of info about…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは！私は睡眠負債とその限界について学ぼうとしています。このsubredditでいくつかの質問を見つけました。\nこのsubredditでいくつかの質問を見つけましたが、それは何年も前のもので、私は\n現在の理解や最新の研究はどうなっているのか気になります。また\n受け入れられている理論なのかどうか。\n\n私は多くの情報を見ました...",
      "title": "蓄積された睡眠不足による睡眠負債は、現在の理解では本当なのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好！我想了解一下睡眠负债，以及它的局限性是什么。我在这个分论坛上发现了一些\n问题，但它们是很多年前的问题，我想知道这些问题是什么？\n我想知道目前对这个问题的理解/最新的研究。还有\n它是否是一个公认的理论。\n\n我看到很多关于...",
      "title": "根据目前的理解，累积睡眠损失造成的睡眠债务是真实的吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好！我想了解一下睡眠負債，以及它的侷限性是什麼。我在這個分論壇上發現了一些\n問題，但它們是很多年前的問題，我想知道這些問題是什麼？\n我想知道目前對這個問題的理解/最新的研究。還有\n它是否是一個公認的理論。\n\n我看到很多關於...",
      "title": "根據目前的理解，累積睡眠損失造成的睡眠債務是真實的嗎？"
    }
  ]
}