{
  "author": "DELAIZ",
  "original_created_utc": 1636573134,
  "title": "How did Italian cuisine become so conservative from the 20th century onwards?",
  "created_utc": 1636609294,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Massimo Bottura became famous for making modifications to traditional dishes and generating the wrath of locals. It is common to find videos on the internet of irate Italians with modifications and changes in the ingredients of Italian dishes. there is this reputation that Italians only like the food of their grandmothers and mothers. and and this is not a recent phenomenon.</p>\n\n<p>how did a cuisine that was considered innovative (even including in its base a foreign ingredient like tomatoes) become something so stagnant and reluctant to innovation?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/qr2bqt/how_did_italian_cuisine_become_so_conservative/",
  "subreddit": "AskHistorians",
  "id": "qr2bqt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Massimo Bottura became famous for making modifications to traditional dishes and\ngenerating the wrath of locals. It is common to find videos on the internet of\nirate Italians with modifications and changes in the ingredients of Italian\ndishes. there is this reputation that Italians only like the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "マッシモ・ボットゥーラは、伝統的な料理に手を加えることで有名になりました。\n地元の人々の怒りを買うことで有名になりました。インターネット上では、このような動画をよく見かけます。\nインターネット上では、イタリア料理の材料を変更したり、修正したりして怒るイタリア人の動画がよく見られます。\nイタリア人は伝統的な料理しか好まないというイメージがあります。",
      "title": "20世紀以降のイタリア料理は、どうしてこんなに保守的になってしまったのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "马西莫-波图拉（Massimo Bottura）因修改传统菜肴而成名，并引起当地人的愤怒。\n引起了当地人的愤怒。在互联网上经常可以找到一些视频\n愤怒的意大利人对意大利菜的成分进行修改和变化的视频很常见。\n有一种说法是，意大利人只喜欢 \"大餐\"。",
      "title": "从20世纪开始，意大利菜如何变得如此保守？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "馬西莫-波圖拉（Massimo Bottura）因修改傳統菜餚而成名，並引起當地人的憤怒。\n引起了當地人的憤怒。在互聯網上經常可以找到一些視頻\n憤怒的意大利人對意大利菜的成分進行修改和變化的視頻很常見。\n有一種說法是，意大利人只喜歡 \"大餐\"。",
      "title": "從20世紀開始，意大利菜如何變得如此保守？"
    }
  ]
}