{
  "author": "rna32",
  "the_new_excerpt": "New retail investor here, about 2 months now. I've done a fair amount of reading\nto familiarize myself with the basics of buying/selling stocks but never once\ncame across thus.\n\nI had about $1,000 in one stock that dropped about 36% over the past week or\ntwo, so I decided to cut bait on half of my…",
  "original_created_utc": 1617203139,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这里是新的散户投资者，大约2个月了。我已经做了相当多的阅读\n以熟悉购买/出售股票的基本知识，但从未遇到过\n遇到过这种情况。\n\n我在一只股票上有大约1,000美元，在过去的一两个星期里下跌了大约36%。\n所以我决定放弃我的一半股票。",
      "title": "洗涤销售 - 我不知道"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這裏是新的散戶投資者，大約2個月了。我已經做了相當多的閱讀\n以熟悉購買/出售股票的基本知識，但從未遇到過\n遇到過這種情況。\n\n我在一隻股票上有大約1,000美元，在過去的一兩個星期裏下跌了大約36%。\n所以我決定放棄我的一半股票。",
      "title": "洗滌銷售 - 我不知道"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "個人投資家になって約2ヶ月。かなり多くの本を読みました。\n株の買い方、売り方の基本を身につけるために、一度も\nこのような出会いがありました。\n\nある銘柄に1000ドルほど投資していたのですが、この1～2週間で36％ほど下落し\nだから、私は半分を餌にすることにした...。",
      "title": "ウォッシュセール - 全然知らなかった"
    }
  ],
  "title": "Wash Sale - I had no idea",
  "created_utc": 1617239856,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>New retail investor here, about 2 months now. I&#39;ve done a fair amount of reading to familiarize myself with the basics of buying/selling stocks but never once came across thus.</p>\n\n<p>I had about $1,000 in one stock that dropped about 36% over the past week or two, so I decided to cut bait on half of my holdings (highest cost basis shares). What I didn&#39;t realize or understand was this thing called a Wash Sale, which increased my cost basis on my remaining shares by about 15% above my previous average cost. </p>\n\n<p>At this point I don&#39;t know what to do. And before I realized the Wash Sale thing I was actually inclined to buy back more of that same stock at the lower price. I suppose I can&#39;t do that for at least 30 days now? Do I now hold them for a year?</p>\n\n<p>Thanks in advance for your help.</p>\n</div><!-- SC_ON -->",
  "score": 46,
  "permalink": "/r/stocks/comments/mh82x3/wash_sale_i_had_no_idea/",
  "subreddit": "stocks",
  "id": "mh82x3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357142683
}