{
  "author": "Cryptardo",
  "original_created_utc": 1628165667,
  "title": "xMoons - questions I see all the time",
  "created_utc": 1628202643,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Someone suggested i post this so here goes. </p>\n\n<p>I see a bunch of people not understanding the following so here’s some stuff I learned over the past few months by speaking with mods and vets and whales:</p>\n\n<ul>\n<li><p>You only receive moons for the karma you earn between two snapshot dates per month in this subreddit. It doesn’t matter if you have a total of 1 million karma on your account, if you didn’t get any upvotes this month in this sub you’ll get no moons on distribution day.</p></li>\n<li><p>Comments count for double karma until you hit 1000 karma limit (technically that’s 2000 you get tho cause the double)</p></li>\n<li><p>Posts are not doubled so 1000 karma limit Is 1000 karma limit.</p></li>\n<li><p>15k karma limit per account per month, again not total karma on your account, but total karma earned in this sub that month.</p></li>\n<li><p>Downvotes take away moons for the month until a max of 0 moons is given (as in mods won’t take your moons away if you get - karma total in a month.</p></li>\n<li><p>Holding last months moons will add 20% to your total moons this month (so if you earned 1000 this month you’ll get 1200) unless you already hit the 15k karma limit. Any moons from before last month or any paid for moons do not affect your holding bonus. </p></li>\n<li><p>You can give away 100 moons per month without it affecting your 20% bonus. It then goes down in a linear percentage per moon you give away. If you made 1100 moons last month and give away 600 you’d lose half of the 20% bonus, and only get 10% bonus. I’m shit at math son this is probably a bad example but you should get what I’m saying.</p></li>\n<li><p>Voting in a governance poll gives you 5% to your total moons this month unless you already hit the 15k karma limit. These can be found stickied during “moon week” in the <a href=\"/r/CryptoCurrencymeta\">r/CryptoCurrencymeta</a> sub beginning the day after the snapshot. </p></li>\n<li><p>Finally, the ratio isn’t the same every month. Last month is was 0.304 per upvote this month it’s 0.26, so if you got 1000 karma last month you’d have 304 moons, but if you got 1000 karma this month it would be 260. It changes because more people come her for moons, more upvotes are given out by the growing users base, and each month the number of moons given out are reduced by 2.5% by the admins so it’s getting smaller automatically.</p></li>\n</ul>\n\n<p>And finallly here’s my moon calendar I made so you can know when all this applies <a href=\"https://i.imgur.com/dzhiBg3.jpg\">https://i.imgur.com/dzhiBg3.jpg</a></p>\n\n<p>Can’t think of anything else right now but if you have more feel free to add</p>\n</div><!-- SC_ON -->",
  "score": 169,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/TrM3CtWB0mjVWheP6359lxbdqqlssLmhP4QGFUXWKDc.jpg?auto=webp&s=83766d7aba1b390ad72706609ab46c121c175575",
          "width": 750,
          "height": 731
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/TrM3CtWB0mjVWheP6359lxbdqqlssLmhP4QGFUXWKDc.jpg?width=108&crop=smart&auto=webp&s=f9fee3a196be84c73cfc1a9e40edaa22c9eb7ca5",
            "width": 108,
            "height": 105
          },
          {
            "url": "https://external-preview.redd.it/TrM3CtWB0mjVWheP6359lxbdqqlssLmhP4QGFUXWKDc.jpg?width=216&crop=smart&auto=webp&s=ee3e20f209a0e3afdc9947cbbc57f01fe9b48ab5",
            "width": 216,
            "height": 210
          },
          {
            "url": "https://external-preview.redd.it/TrM3CtWB0mjVWheP6359lxbdqqlssLmhP4QGFUXWKDc.jpg?width=320&crop=smart&auto=webp&s=6e842484390f77347685a59391d0523ea43b9f71",
            "width": 320,
            "height": 311
          },
          {
            "url": "https://external-preview.redd.it/TrM3CtWB0mjVWheP6359lxbdqqlssLmhP4QGFUXWKDc.jpg?width=640&crop=smart&auto=webp&s=87c2258c1a3978367b85b2d5d6646786613afd88",
            "width": 640,
            "height": 623
          }
        ],
        "variants": {},
        "id": "V97rIsLJgTUt2GUfjFZ1eOX5SeJWH_bgq0SPUPvNEaU"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/oyg9y3/xmoons_questions_i_see_all_the_time/",
  "subreddit": "CryptoCurrency",
  "id": "oyg9y3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Someone suggested i post this so here goes.\n\nI see a bunch of people not understanding the following so here’s some stuff I\nlearned over the past few months by speaking with mods and vets and whales:\n\n * You only receive moons for the karma you earn between two snapshot dates per\n   month in this…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "誰かに勧められて投稿してみました。\n\n多くの人が以下の内容を理解していないようなので、ここでは私が\n私が過去数ヶ月の間にMODやベテラン、クジラと話して学んだことを紹介します。\n\n * 1ヶ月に2回のスナップショットの間に獲得したカルマに対してのみ、月を受け取ることができます。\n   これは...",
      "title": "xMoon - いつも見ている質問"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有人建议我发这个帖子，所以在这里。\n\n我看到很多人不理解以下内容，所以这里有一些东西我\n在过去的几个月里，我通过与管理员、兽医和鲸鱼交谈了解到一些情况。\n\n * 你只有在每个月的两个快照日期之间获得的业力才能获得月亮。\n   在这个月的两个快照日期之间，你只能获得月亮。",
      "title": "xMoons - 我经常看到的问题"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有人建議我發這個帖子，所以在這裏。\n\n我看到很多人不理解以下內容，所以這裏有一些東西我\n在過去的幾個月裏，我通過與管理員、獸醫和鯨魚交談了解到一些情況。\n\n * 你只有在每個月的兩個快照日期之間獲得的業力才能獲得月亮。\n   在這個月的兩個快照日期之間，你只能獲得月亮。",
      "title": "xMoons - 我經常看到的問題"
    }
  ]
}