{
  "author": "PulseQ8",
  "the_new_excerpt": "Most of us are fighting for crypto to escape the financial hell hole we're in.\nBut this guy is filthy rich and already secured a good legacy for himself,\nwhether crypto succeeds or not makes absolutely no difference to him, he's only\nin for the memes. Putting bitcoin in his bio just for a few days…",
  "original_created_utc": 1612455842,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我们大多数人都在为加密技术而奋斗，以逃离我们所处的金融地狱。\n但这个家伙是肮脏的富人，已经为自己争取到了一笔不错的遗产。\n加密技术的成功与否对他来说没有任何区别，他只是... ...\n在追忆中. 把比特币放在他的简历里只是为了几天... ...",
      "title": "埃隆不要再搞加密技术了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們大多數人都在爲加密技術而奮鬥，以逃離我們所處的金融地獄。\n但這個傢伙是骯髒的富人，已經爲自己爭取到了一筆不錯的遺產。\n加密技術的成功與否對他來說沒有任何區別，他只是... ...\n在追憶中. 把比特幣放在他的簡歷裏只是爲了幾天... ...",
      "title": "埃隆不要再搞加密技術了。"
    }
  ],
  "title": "Elon needs to stop messing with crypto",
  "created_utc": 1612490232,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Most of us are fighting for crypto to escape the financial hell hole we&#39;re in. But this guy is filthy rich and already secured a good legacy for himself, whether crypto succeeds or not makes absolutely no difference to him, he&#39;s only in for the memes. Putting bitcoin in his bio just for a few days then removing it, and tweeting doge again; clearly he&#39;s just toying with crypto. Because of him a lot of uninformed people are getting burnt, and reputation of crypto is being smeared, possibly leading to harsher regulation. He is making a joke out of something most of us are taking seriously. How would HE like it if someone out there swings his precious assets&#39; value at any time they like? If he wouldn&#39;t like that (and obviously he wouldn&#39;t) then how about treat others the way he likes to be treated?</p>\n</div><!-- SC_ON -->",
  "score": 184,
  "permalink": "/r/CryptoCurrency/comments/lcjcz3/elon_needs_to_stop_messing_with_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "lcjcz3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123193186
}