{
  "author": "Set1Less",
  "original_created_utc": 1649984745,
  "title": "You need to qualify as an \"accredited investor\" to earn 7% interest on stablecoins, but anyone can invest in IPO's like DIDI which Gary Gensler approved and is now down 85% from IPO price. Such a fair system.",
  "created_utc": 1649998798,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The Celsius news blocking regular Americans investors is terrible, but not surprising you could sense they were tightening the screws because allowing common folk to earn 7% on stables vs the 0.3% they get in banks is soooo risky.&lt;/p&gt;\n\n&lt;p&gt;Common folk can however invest happily, all their savings into IPOs like Didi...&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/zwuk6drnz4t81.jpg?width=2212&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=6cc8ae8a4fcc3b092caacb0f0efad779a7611ec9\"&gt;Which is down a whopping 84&amp;#37; from its IPO&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;The IPO which SEC&amp;#39;s anti-poor hitman Gary Gensler approved... &lt;/p&gt;\n\n&lt;p&gt;You see, as long as you lose money, its all fun and games. &lt;/p&gt;\n\n&lt;p&gt;But when the average guys finds a way to make just a little more than what the government allows them to make, they have to be shut down using the entire force of the regulatoooors who want to protect you from earning more than what banks allow you. &lt;/p&gt;\n\n&lt;p&gt;The 7% rate offered by Celsius or Blockfi isnt even inflation beating, in the era of &amp;gt; 8% CPI. But you cant earn that unless you are accredited.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 446,
  "permalink": "/r/CryptoCurrency/comments/u3w8vy/you_need_to_qualify_as_an_accredited_investor_to/",
  "subreddit": "CryptoCurrency",
  "id": "u3w8vy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The Celsius news blocking regular Americans investors is terrible, but not\nsurprising you could sense they were tightening the screws because allowing\ncommon folk to earn 7% on stables vs the 0.3% they get in banks is soooo risky.\n\nCommon folk can however invest happily, all their savings into IPOs…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "普通のアメリカ人投資家をブロックするセルシオのニュースはひどいものだが、そうではない\nというのも、彼らが締め付けを強めているのが感じられるからです。\n庶民が銀行で得られる0.3%に対して、厩舎で7%の利益を得ることは、とてもリスクが高いのです。\n\nしかし、庶民は喜んで、貯金をすべてIPOに投資することができる...。",
      "title": "安定したコインで7％の利息を得るには「認定投資家」の資格が必要ですが、ゲイリー・ゲンスラーが承認したDIDIのようなIPOには誰でも投資でき、現在IPO価格から85％下がっています。そんな公平なシステムです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "阻止美国普通投资者的消息是可怕的，但并不奇怪。\n你可以感觉到他们正在收紧螺丝，因为允许\n普通人在马厩里赚7%，而在银行里只赚0.3%，风险太大。\n\n然而，普通人可以愉快地投资，将他们所有的储蓄投入到IPO中......",
      "title": "你需要有资格成为 \"认可的投资者\"，才能在稳定币上获得7%的利息，但任何人都可以投资于像DIDI这样的IPO，Gary Gensler批准了DIDI，现在已经比IPO价格下降了85%。这样一个公平的系统。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "阻止美國普通投資者的消息是可怕的，但並不奇怪。\n你可以感覺到他們正在收緊螺絲，因爲允許\n普通人在馬廄裏賺7%，而在銀行裏只賺0.3%，風險太大。\n\n然而，普通人可以愉快地投資，將他們所有的儲蓄投入到IPO中......",
      "title": "你需要有資格成爲 \"認可的投資者\"，才能在穩定幣上獲得7%的利息，但任何人都可以投資於像DIDI這樣的IPO，Gary Gensler批准了DIDI，現在已經比IPO價格下降了85%。這樣一個公平的系統。"
    }
  ]
}