{
  "author": "onlymadethistoupvote",
  "the_new_excerpt": "International brokers sued over naked short selling allegations CIBC, Bank of\nAmerica, UBS and TD Bank stand accused of coordinating “abusive” naked short\nselling and spoofing strategies in US and Canadian stock markets by a Bermuda\nhedge fund that claims to have lost tens of millions of dollars as…",
  "original_created_utc": 1613151836,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "国际经纪商因裸卖空指控被起诉 CIBC、银行\n美团、瑞银和道明银行被指协调 \"滥竽充数 \"裸短\n百慕大人在美国和加拿大股票市场的卖出和欺骗策略\n对冲基金，声称已经损失了数千万美元，因为...",
      "title": "CIBC、美国银行、瑞银和道明银行被指控协调 \"滥用 \"裸卖空和恶搞策略。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "國際經紀商因裸賣空指控被起訴 CIBC、銀行\n美團、瑞銀和道明銀行被指協調 \"濫竽充數 \"裸短\n百慕大人在美國和加拿大股票市場的賣出和欺騙策略\n對沖基金，聲稱已經損失了數千萬美元，因爲...",
      "title": "CIBC、美國銀行、瑞銀和道明銀行被指控協調 \"濫用 \"裸賣空和惡搞策略。"
    }
  ],
  "title": "CIBC, Bank of America, UBS and TD Bank stand accused of coordinating “abusive” naked short selling and spoofing strategies",
  "created_utc": 1613157705,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>International brokers sued over naked short selling allegations\nCIBC, Bank of America, UBS and TD Bank stand accused of coordinating “abusive” naked short selling and spoofing strategies in US and Canadian stock markets by a Bermuda hedge fund that claims to have lost tens of millions of dollars as a result.</p>\n\n<p>Harrington Global Opportunity Fund has filed a suit at the US District Court for the Southern District of New York alleging that various US and Canadian financial institutions, through their broker divisions, manipulated markets and drove down pharmaceutical company ADVANZ PHARMA’s (formerly Concordia) share price in 2016.</p>\n\n<p>The specialist pharmaceutical recapitalised and rebranded in 2018 after being embroiled in a long-running dispute over apparent price hikes and accusations of mismanagement by its founder and CEO Mark Thompson, who stepped down in 2016. </p>\n\n<p>According to the suit, the defendants, which include several unnamed US and Canadian individuals, allegedly flooded the market with false sell signals by simultaneous naked short selling — in which the trader does not borrow a stock, or determine that it can be borrowed, before they short sell — and spoofing — a form of high-frequency trading that artificially inflates perceived demand of a security — which created millions of ‘phantom’ shares.</p>\n\n<p>These practices violate the US Securities Exchange Act 1934 and Regulation SHO. </p>\n\n<p>The result, Harrington suggests, is that Concordia’s stock price tumbled from $34.77 to $1.83 over 11 months.</p>\n\n<p>According to the complaint, Harrington sold 9 million Concordia shares on US and Canadian markets, including the NASDAQ and the Toronto Stock Exchange, in response to the defendants’ alleged illegal market manipulation.</p>\n\n<p>Harrington is seeking damages, legal fees and interest. </p>\n\n<p>It is alleged that in 2016 there were approximately 238 million shares of Concordia stock that were sold short on the Canadian and US exchanges, constituting around 58 per cent of the approximately 410 million Concordia shares traded during the period in question. </p>\n\n<p>However, Harrington argues that only 40 million shares were actually issued for trading, meaning the short sale turnover rate was approximately 600 per cent.</p>\n\n<p>“The enormous discrepancy between the 40 million shares issued by Concordia for trading and the approximately 410 million Concordia shares traded during this period represents an astonishingly high turnover rate of 1,000 per cent,” the suit states. </p>\n\n<p>The fund alleges that a “strong inference can be drawn” that these figures were inflated by “millions of fictitious shares unlawfully manufactured” through naked short selling.</p>\n\n<p>Lawyers for the plaintiff told SFT that no court date has been set.</p>\n\n<p>None of the financial institutions featured in the complaint wished to provide a comment for this story.</p>\n\n<p><a href=\"https://www.securitiesfinancetimes.com/securitieslendingnews/industryarticle.php?article_id=224548&amp;navigationaction=home&amp;page=1&amp;newssection=industry\">https://www.securitiesfinancetimes.com/securitieslendingnews/industryarticle.php?article_id=224548&amp;navigationaction=home&amp;page=1&amp;newssection=industry</a></p>\n</div><!-- SC_ON -->",
  "score": 19480,
  "permalink": "/r/stocks/comments/lig9vn/cibc_bank_of_america_ubs_and_td_bank_stand/",
  "subreddit": "stocks",
  "id": "lig9vn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728623032
}