{
  "author": "erjo5055",
  "original_created_utc": 1638636746,
  "title": "Crypto is officially dead, please sell all your Crypto",
  "created_utc": 1638653626,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi all, as you can see from this massive dip that does not happen every few weeks in crypto, crypto is officially dead. This is definetly not a normal occurrence in the crypto world, please do not look at charts and notice this is a common occurrence. &lt;/p&gt;\n\n&lt;p&gt;Instead please panic sell, and leave crypto forever. I definetly do not intend to gobble up the panic sellers, no, I believe crypto is 100% dead this time. Its only up a few hundred percent this year which isn&amp;#39;t enough to confirm its now an institutional, mature asset class. Being only a few trillion dollars, it will likely disappear overnight. &lt;/p&gt;\n\n&lt;p&gt;So again, please panic sell, the end is hear, and please continue to post about how scary and world ending this 10-15% dip is.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 202,
  "permalink": "/r/CryptoCurrency/comments/r8tqa8/crypto_is_officially_dead_please_sell_all_your/",
  "subreddit": "CryptoCurrency",
  "id": "r8tqa8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi all, as you can see from this massive dip that does not happen every few\nweeks in crypto, crypto is officially dead. This is definetly not a normal\noccurrence in the crypto world, please do not look at charts and notice this is\na common occurrence.\n\nInstead please panic sell, and leave crypto…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは、皆さん、この数年に一度の大暴落からおわかりのように\ncryptoは公式に死んでいる。これは間違いなく普通ではありません。\n暗号の世界では、チャートを見て、これがそうだと気づかないようにしてください。\nよくあることです。\n\nその代わりに、パニック売りして、暗号を残してください...",
      "title": "Cryptoは公式に死んでいる、すべてのCryptoを売ってください"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好，正如你们所看到的，这次大规模的下跌并不是每隔几周就会发生的。\n几周后，加密货币已经正式死亡。这绝对不是一个正常的\n这绝对不是加密货币世界的正常现象，请不要看图表并注意到这是\n这是一种常见的情况。\n\n相反，请恐慌性抛售，并离开加密货币...",
      "title": "隐性货币已正式死亡，请卖掉你所有的隐性货币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好，正如你們所看到的，這次大規模的下跌並不是每隔幾周就會發生的。\n幾周後，加密貨幣已經正式死亡。這絕對不是一個正常的\n這絕對不是加密貨幣世界的正常現象，請不要看圖表並注意到這是\n這是一種常見的情況。\n\n相反，請恐慌性拋售，並離開加密貨幣...",
      "title": "隱性貨幣已正式死亡，請賣掉你所有的隱性貨幣"
    }
  ]
}