{
  "author": "ziggyzago",
  "original_created_utc": 1626403014,
  "title": "I joined Reddit because of crypto. Today’s my Reddit cake day. You guys turned me into a Hodler.",
  "created_utc": 1626413513,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In April 2020 I started looking into crypto. Two months of research, white papers and little sleep I made my way into this sub. It was much different back then. I really enjoyed the memes. I learned about hard wallets and “not your keys, not your coins”. I stayed up way too late reading all the comments. You guys turned me into a hodler. Thank you.</p>\n</div><!-- SC_ON -->",
  "score": 249,
  "permalink": "/r/CryptoCurrency/comments/ol7qz0/i_joined_reddit_because_of_crypto_todays_my/",
  "subreddit": "CryptoCurrency",
  "id": "ol7qz0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In April 2020 I started looking into crypto. Two months of research, white\npapers and little sleep I made my way into this sub. It was much different back\nthen. I really enjoyed the memes. I learned about hard wallets and “not your\nkeys, not your coins”. I stayed up way too late reading all the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2020年4月、私は暗号について調べ始めました。2ヶ月間の調査、ホワイトペーパー\n睡眠時間を削って、私はこの分野に参入しました。当時はかなり違っていました。\nあの頃は 私はミームをとても楽しみました。ハードウォレットや「not your keys, not your coins」について学びました。\nキーでもなく、コインでもなく」ということを学びました。私は夜更かしして、すべての...",
      "title": "Redditに参加したのはcryptoのため。今日は私のRedditケーキの日です。あなたたちが私をホドラーに変えてくれたのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "2020年4月，我开始研究加密货币。两个月的研究，白皮书\n白皮书和很少的睡眠，我进入了这个子。那时的情况与现在大不相同。\n当时的情况大不相同。我真的很喜欢这些备忘录。我了解到硬钱包和 \"不是你的\n钥匙，而不是你的硬币\"。我熬夜阅读了所有这些文章。",
      "title": "我加入Reddit是因为加密货币。今天是我的Reddit蛋糕日。你们把我变成了一个霍德勒。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "2020年4月，我開始研究加密貨幣。兩個月的研究，白皮書\n白皮書和很少的睡眠，我進入了這個子。那時的情況與現在大不相同。\n當時的情況大不相同。我真的很喜歡這些備忘錄。我瞭解到硬錢包和 \"不是你的\n鑰匙，而不是你的硬幣\"。我熬夜閱讀了所有這些文章。",
      "title": "我加入Reddit是因爲加密貨幣。今天是我的Reddit蛋糕日。你們把我變成了一個霍德勒。"
    }
  ]
}