{
  "author": "TurbulentAd7713",
  "original_created_utc": 1647129657,
  "title": "Is my dad a misogynist?",
  "created_utc": 1647168446,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi Reddit,&lt;/p&gt;\n\n&lt;p&gt;I (15M) recently started talking to my father and overall it’s been an enjoyable experience. One thing, however, has been on my mind and I can’t seem to get behind it. My father has said some pretty obscenely harsh things about women that I don’t agree with. He has at one point encouraged me to manipulate and use them as it’s the only way to “win” and “be superior”. He also describes them as being a “lesser creature”. I asked him bluntly if he was a misogynist and he said no and got offended thereafter.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/TooAfraidToAsk/comments/tcubul/is_my_dad_a_misogynist/",
  "subreddit": "TooAfraidToAsk",
  "id": "tcubul",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hi Reddit,\n\nI (15M) recently started talking to my father and overall it’s been an enjoyable\nexperience. One thing, however, has been on my mind and I can’t seem to get\nbehind it. My father has said some pretty obscenely harsh things about women\nthat I don’t agree with. He has at one point…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは、Redditです。\n\n私（15M）は最近、父と話をするようになり、全体的に楽しくなってきました。\nを体験してください。しかし、ひとつだけ気になっていることがあり、どうしても\nその裏には 父は、女性についてかなり卑猥で厳しいことを言っています。\n納得がいかない。彼はある時...",
      "title": "親父は女嫌いなのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嗨，Reddit。\n\n我（15岁）最近开始与我父亲交谈，总体而言，这是一次愉快的\n经验。然而，有一件事一直在我的脑海中，我似乎无法得到\n思考这个问题。我父亲曾说过一些关于女性的非常难听的话\n我不同意。他曾在一个点上...",
      "title": "我爸爸是个厌恶女人的人吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嗨，Reddit。\n\n我（15歲）最近開始與我父親交談，總體而言，這是一次愉快的\n經驗。然而，有一件事一直在我的腦海中，我似乎無法得到\n思考這個問題。我父親曾說過一些關於女性的非常難聽的話\n我不同意。他曾在一個點上...",
      "title": "我爸爸是個厭惡女人的人嗎？"
    }
  ]
}