{
  "author": "cascading_disruption",
  "the_new_excerpt": "Simple topics made in 1 minute like this one\n[https://www.reddit.com/r/CryptoCurrency/comments/ng4moj/the_entire_market_dipped_heres_why/]\nare fun from time to time and they can get 10k+ upvotes but anything that has\nany kind of technical discussions on new features/updates that could…",
  "original_created_utc": 1623411999,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1分で作れる簡単な話題を集めました\n[https://www.reddit.com/r/CryptoCurrency/comments/ng4moj/the_entire_market_dipped_heres_why/]\nのような、1分で作れる簡単なトピックは、たまには楽しいし、10k以上のupvoteを獲得することもあります。\nしかし、新機能やアップデートに関する技術的な議論をするようなものは...",
      "title": "技術的な議論はこのsubredditやr/bitcoinでは不可能になってきており、この分野に参入する人にとっては残念なことだと思います。価格が唯一の問題であり、自分のコインを売りさばくことが究極の目的であるならば、moonboisを包み込んで、ミームだけのr/ccにしましょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "像这样在1分钟内做出的简单题目\n[https://www.reddit.com/r/CryptoCurrency/comments/ng4moj/the_entire_market_dipped_heres_why/]\n偶尔会很有趣，它们可以得到10k以上的支持率，但任何有\n任何关于新功能/更新的技术讨论，都可以...",
      "title": "技术讨论在这个子版块和r/bitcoin中变得不可能，这对任何进入这个领域的人来说都是一种耻辱。如果价格是唯一重要的事情，而推销你的硬币是最终目的，那么让我们把它包起来，让它成为一个只有回忆的r/cc。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "像這樣在1分鐘內做出的簡單題目\n[https://www.reddit.com/r/CryptoCurrency/comments/ng4moj/the_entire_market_dipped_heres_why/]\n偶爾會很有趣，它們可以得到10k以上的支持率，但任何有\n任何關於新功能/更新的技術討論，都可以...",
      "title": "技術討論在這個子版塊和r/bitcoin中變得不可能，這對任何進入這個領域的人來說都是一種恥辱。如果價格是唯一重要的事情，而推銷你的硬幣是最終目的，那麼讓我們把它包起來，讓它成爲一個只有回憶的r/cc。"
    }
  ],
  "title": "Technical discussions are becoming impossible in this subreddit and r/bitcoin and that's a shame for anyone entering this space. If the price is the only thing that matters, and shilling your coins is the ultimate goal then let's wrap it up moonbois and make it a meme-only r/cc",
  "created_utc": 1623426220,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Simple topics made in 1 minute <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/ng4moj/the_entire_market_dipped_heres_why/\">like this one</a> are fun from time to time and they can get 10k+ upvotes but anything that has any kind of technical discussions on new features/updates that could actually benefit the whole industry (after all it&#39;s all open source remember) get&#39;s replies that boil down to:</p>\n\n<ul>\n<li>never gonna happen, they are just lying (even if it is not just a simple whitepaper but actually a peer-reviewed paper meaning reviewed by their peers in their field and not by some Tronboi copy&amp;pasting from Ethereum paper for example)</li>\n<li>shilling the things that I HODL and don&#39;t care about anything else</li>\n<li>my cult is the best cult and what my cult uses is the best</li>\n<li>forgetting that we&#39;re in this industry together</li>\n</ul>\n\n<p>I love <a href=\"/r/cardano\">r/cardano</a> because the mods there ban shit like this and if you talk about the price or my dickchain is longer than your dickchain you get a warning.</p>\n\n<p>Nobody&#39;s perfect, we all post stupid things sometimes but if we systematically discard anything else or any new ideas that are different from our own then we deserve to fall divided.</p>\n\n<p>For example check my posts on reddit, I posted 3 technical posts about bitcoin with limited number of comments and then for fun I call out Max Keiser and it gets cult going...</p>\n\n<p>Peace out moonbois &amp; moongurls!</p>\n</div><!-- SC_ON -->",
  "score": 380,
  "permalink": "/r/CryptoCurrency/comments/nxe19h/technical_discussions_are_becoming_impossible_in/",
  "subreddit": "CryptoCurrency",
  "id": "nxe19h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009737339
}