{
  "author": "jkim088",
  "the_new_excerpt": "Hi I’m turning 19 soon and I have invested 90% of my savings since last year to\nhave a combined net worth of little more than 13k. I currently live abroad but I\nexpect to go back in less than a year. I use a foreign brokerage that charges me\nfor all the transaction and exchange rate, which is quite…",
  "original_created_utc": 1620564198,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは、私はもうすぐ19歳になりますが、去年から貯金の90％を投資していて\n去年から90％の貯金を投資して、合計で13,000円強の純資産があります。現在は海外に住んでいますが\n1年以内に帰国する予定です。私は海外の証券会社を利用しています。\n私は海外の証券会社を利用していますが、そこではすべての取引と為替レートに手数料がかかり、かなり...",
      "title": "ずっと持っていたい株？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好，我马上就要19岁了，从去年开始，我把90%的积蓄都投了进去。\n累计净资产超过13000。我目前住在国外，但我\n预计不到一年就会回去。我使用一家外国经纪公司，该公司向我收取所有交易和汇率费用。\n所有的交易和汇率，这是很重要的。",
      "title": "要永远持有的股票？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好，我馬上就要19歲了，從去年開始，我把90%的積蓄都投了進去。\n累計淨資產超過13000。我目前住在國外，但我\n預計不到一年就會回去。我使用一家外國經紀公司，該公司向我收取所有交易和匯率費用。\n所有的交易和匯率，這是很重要的。",
      "title": "要永遠持有的股票？"
    }
  ],
  "title": "Stocks to hold forever?",
  "created_utc": 1620593251,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi I’m turning 19 soon and I have invested 90% of my savings since last year to have a combined net worth of little more than 13k. I currently live abroad but I expect to go back  in less than a year. I use a foreign brokerage that charges me for all the transaction and exchange rate, which is quite high. So I refrain from trading as much as possible, meaning I have to hold shares for a long time to make a sizable gain. In practice, a 2-2.5% gain would break even due to currency exchange fees and taxes mostly.</p>\n\n<p>My main question is if these stocks are good enough to hold for at least 5 years. Idk if I’ll change my brokerage once I go back to the states or not, but if I decide to continue to use it I don’t have to sell anything. I currently hold the following:</p>\n\n<ul>\n<li>AMZN, GOOGL, AAPL, MSFT, PYPL, TSLA, HD, LOW, WMT, KO, VIG, JNJ, PG, ABT, COST, SBUX, TGT, ICLN</li>\n</ul>\n\n<p>When choosing stocks I didn’t really look through the financial sheets. I simply bought companies that looked relatively stable and well known anywhere I go. Let me know what you think!</p>\n</div><!-- SC_ON -->",
  "score": 98,
  "permalink": "/r/stocks/comments/n8dhxx/stocks_to_hold_forever/",
  "subreddit": "stocks",
  "id": "n8dhxx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985995617
}