{
  "author": "LordCommanderBlack",
  "original_created_utc": 1638890281,
  "title": "How did New Zealand's colder climate, mountainous terrain, and vast resources change Maori culture from their Polynesian cousins on smaller islands?",
  "created_utc": 1638934261,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://i.imgur.com/hRNugex.jpg\"&gt;New Zealand isn&amp;#39;t really a small country&lt;/a&gt; especially compared to the pacific islands that the Polynesian peoples settled.&lt;/p&gt;\n\n&lt;p&gt;Did their society become more complex because the vast amount of land they could populate? More complex agriculture?&lt;/p&gt;\n\n&lt;p&gt;Did their villages become more substantial because of the abundance of timber and far more colder winters the islands get?&lt;/p&gt;\n\n&lt;p&gt;Did their boats get larger to handle the increase in resources or smaller/less complex because they were no longer voyaging the vast ocean?&lt;/p&gt;\n\n&lt;p&gt;How did their political structure and economic structures change?&lt;/p&gt;\n\n&lt;p&gt;•••&lt;/p&gt;\n\n&lt;p&gt;I know environmental determinism is frowned upon for good reason but still, a society in Fiji and a society in Norway are going to evolve differently since they have different needs and access to different resources.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 107,
  "permalink": "/r/AskHistorians/comments/rb1fi1/how_did_new_zealands_colder_climate_mountainous/",
  "subreddit": "AskHistorians",
  "id": "rb1fi1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "New Zealand isn't really a small country [https://i.imgur.com/hRNugex.jpg]\nespecially compared to the pacific islands that the Polynesian peoples settled.\n\nDid their society become more complex because the vast amount of land they could\npopulate? More complex agriculture?\n\nDid their villages become…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ニュージーランドは実は小さな国ではない[https://i.imgur.com/hRNugex.jpg]\nポリネシア人が定住した太平洋の島々と比べると、特に。\n\nポリネシアの社会は、広大な土地ゆえに、より複雑になったのでしょうか。\nを、どう思いますか？より複雑な農業？\n\n彼らの村は...",
      "title": "ニュージーランドの寒冷な気候、山岳地帯、膨大な資源は、マオリの文化を小さな島々に住むポリネシア人の同胞からどのように変えたのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "新西兰并不是一个真正的小国家[https://i.imgur.com/hRNugex.jpg]\n特别是与波利尼西亚人定居的太平洋岛屿相比。\n\n他们的社会变得更加复杂，是否因为他们可以在大量的土地上\n人口而变得更加复杂？更复杂的农业？\n\n他们的村庄是否变得...",
      "title": "新西兰更寒冷的气候、多山的地形和巨大的资源如何改变了毛利人的文化，使之不同于他们在较小岛屿上的波利尼西亚表兄弟？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "新西蘭並不是一個真正的小國家[https://i.imgur.com/hRNugex.jpg]\n特別是與波利尼西亞人定居的太平洋島嶼相比。\n\n他們的社會變得更加複雜，是否因爲他們可以在大量的土地上\n人口而變得更加複雜？更復雜的農業？\n\n他們的村莊是否變得...",
      "title": "新西蘭更寒冷的氣候、多山的地形和巨大的資源如何改變了毛利人的文化，使之不同於他們在較小島嶼上的波利尼西亞表兄弟？"
    }
  ]
}