{
  "author": "frstrtd_ndrd_dvlpr",
  "original_created_utc": 1640329429,
  "title": "Thinking of quitting your job to trade crypto because of the gains? Don't.",
  "created_utc": 1640356376,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I think it&amp;#39;s about time to post something like this since we are seeing green again nowadays. &lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re thinking of quitting your job to trade crypto since you were successful and gaining day by day because of your decisions (buy/sell whatever), then please clear your mind, it could just be adrenaline, oxytocin, dopamine, or whatever hormone your body is generating for now. Don&amp;#39;t leave your stable jobs, you may see successful traders out there but it takes dedication and a little luck to be a full time trader. Or at the very least test your strategy first, put it in a trial during both a bull and a bear market. Yes, you might be earning something around 10% or more everyday by what you are currently doing, but what if bear market hits and instead of earning you are losing value day by day, and you got no regular source of income to support your daily needs, are you gonna sell your crypto?&lt;/p&gt;\n\n&lt;p&gt;If you really want to change careers then at least stock up savings of at least 6-12 months of your spendings so you won&amp;#39;t need to worry about tomorrow if all else fails. I have friends who actually quit trading and became successfully, but I think it&amp;#39;s as rare as people dropping out of harvard and ending up as a ceo of multi billion company.&lt;/p&gt;\n\n&lt;p&gt;At the end of the day it&amp;#39;s your life, your decisions, I suggest your rub one out before making any life changing decisions, post nut clarity is a thing.&lt;/p&gt;\n\n&lt;p&gt;During the January-April I was swimming in gains and my father asked me if I&amp;#39;m gonna quit my job to trade crypto. I&amp;#39;m like nahh, then May came. Sometimes it pays off being a scaredy cat.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 171,
  "permalink": "/r/CryptoCurrency/comments/rngme4/thinking_of_quitting_your_job_to_trade_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "rngme4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I think it's about time to post something like this since we are seeing green\nagain nowadays.\n\nIf you're thinking of quitting your job to trade crypto since you were\nsuccessful and gaining day by day because of your decisions (buy/sell whatever),\nthen please clear your mind, it could just be…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そろそろ緑が見えてきたので、このようなものを投稿してみようかと思います。\nまた、この頃です。\n\nもし、あなたが仕事を辞めて暗号を取引しようと考えているなら、あなたがそうだったように\n自分の判断（買い・売りなど）で成功し、日々利益を得ている。\nということなのでしょう。",
      "title": "利益を得るために仕事を辞めて暗号を取引しようと考えていますか？やめてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我认为现在是时候发布这样的信息了，因为我们现在又看到了绿色。\n现在又看到了绿色。\n\n如果你正在考虑辞去工作来进行加密货币交易，因为你是\n因为你的决定（买入/卖出什么的），你正在考虑辞去工作来进行加密货币交易。\n那么请理清你的思路，这可能只是...",
      "title": "想着因为收益而辞职去交易加密货币？不要。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我認爲現在是時候發佈這樣的信息了，因爲我們現在又看到了綠色。\n現在又看到了綠色。\n\n如果你正在考慮辭去工作來進行加密貨幣交易，因爲你是\n因爲你的決定（買入/賣出什麼的），你正在考慮辭去工作來進行加密貨幣交易。\n那麼請理清你的思路，這可能只是...",
      "title": "想着因爲收益而辭職去交易加密貨幣？不要。"
    }
  ]
}