{
  "author": "PomeloWarrior",
  "the_new_excerpt": "> In January 2021, we updated our investment policy to provide us with more\n> flexibility to further diversify and maximize returns on our cash that is not\n> required to maintain adequate operating liquidity. As part of the policy,\n> which was duly approved by the Audit Committee of our Board of…",
  "original_created_utc": 1612788727,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "> 2021年1月，我们更新了投资政策，为我们提供了更多的。\n> 灵活性，以进一步分散和最大限度地提高我们的现金回报，而这些现金并不在我们手中。\n> 需要保持足够的经营流动性。作为该政策的一部分。\n> 经本公司董事会审计委员会正式批准，... ...",
      "title": "特斯拉（TSLA）买入价值15亿的比特币（BTC）。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "> 2021年1月，我們更新了投資政策，爲我們提供了更多的。\n> 靈活性，以進一步分散和最大限度地提高我們的現金回報，而這些現金並不在我們手中。\n> 需要保持足夠的經營流動性。作爲該政策的一部分。\n> 經本公司董事會審計委員會正式批准，... ...",
      "title": "特斯拉（TSLA）買入價值15億的比特幣（BTC）。"
    }
  ],
  "title": "Tesla (TSLA) bought 1.5 billion worth of Bitcoin (BTC)",
  "created_utc": 1612795408,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><blockquote>\n<p>In January 2021, we updated our investment policy to provide us with more flexibility to further diversify and maximize returns on our cash that is not required to maintain adequate operating liquidity. As part of the policy, which was duly approved by the Audit Committee of our Board of Directors, we may invest a portion of such cash in certain alternative reserve assets including digital assets, gold bullion, gold exchange-traded funds and other assets as specified in the future. Thereafter, we invested an aggregate $1.50 billion in bitcoin under this policy and may acquire and hold digital assets from time to time or long-term. Moreover, we expect to begin accepting bitcoin as a form of payment for our products in the near future, subject to applicable laws and initially on a limited basis, which we may or may not liquidate upon receipt.</p>\n</blockquote>\n\n<p><a href=\"https://www.sec.gov/Archives/edgar/data/1318605/000156459021004599/tsla-10k_20201231.htm\">https://www.sec.gov/Archives/edgar/data/1318605/000156459021004599/tsla-10k_20201231.htm</a></p>\n</div><!-- SC_ON -->",
  "score": 6102,
  "permalink": "/r/investing/comments/lfb5jt/tesla_tsla_bought_15_billion_worth_of_bitcoin_btc/",
  "subreddit": "investing",
  "id": "lfb5jt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123199869
}