{
  "author": "Bobby_does_reddit",
  "the_new_excerpt": "I've never really bought in to the whole \"buy the dip\" philosophy for long term\ninvesting. I've always figured when you find a stock that you like for the long\nterm, buy and hold. Trying to find dips on which to buy just seems like you're\ngoing to be buying in at a higher and higher price over time…",
  "original_created_utc": 1614002859,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我从来没有真正相信过 \"买跌 \"这个长期的理念。\n投资。我一直认为，当你找到一只你喜欢的股票时，长\n期，买入并持有。试图寻找买入的点位，就好像你在\n随着时间的推移，会以越来越高的价格买入......",
      "title": "我们来讨论一下人们说的 \"买沾 \"是什么意思？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我從來沒有真正相信過 \"買跌 \"這個長期的理念。\n投資。我一直認爲，當你找到一隻你喜歡的股票時，長\n期，買入並持有。試圖尋找買入的點位，就好像你在\n隨着時間的推移，會以越來越高的價格買入......",
      "title": "我們來討論一下人們說的 \"買沾 \"是什麼意思？"
    }
  ],
  "title": "Let's discuss what people mean when they say \"buy the dip\"",
  "created_utc": 1614026307,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve never really bought in to the whole &quot;buy the dip&quot; philosophy for long term investing.  I&#39;ve always figured when you find a stock that you like for the long term, buy and hold.  Trying to find dips on which to buy just seems like you&#39;re going to be buying in at a higher and higher price over time compared to if you just bought now (assuming you were right about the stock in the first place).</p>\n\n<p>Look at Bitcoin, for example.  It&#39;s down 10% today so if you like bitcoin, you should be &quot;buying the dip&quot; right now, right?  But if you like the investment, didn&#39;t you like it a week ago too?  And you could have bought in for 8% lower then than you could buy today.  It would have been much more financially beneficial to buy then, rather that waiting for it to go up so it could drop and you could &quot;buy the dip&quot;.</p>\n</div><!-- SC_ON -->",
  "score": 75,
  "permalink": "/r/investing/comments/lpot6m/lets_discuss_what_people_mean_when_they_say_buy/",
  "subreddit": "investing",
  "id": "lpot6m",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332881992
}