{
  "author": "Many_Scratch2269",
  "original_created_utc": 1634601559,
  "title": "Taxing Crypto while billionaires avoid trillions of dollars in taxes shows the system is rigged",
  "created_utc": 1634610647,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Not only do you have to report Crypto transactions to the IRS for tax purposes, the IRS requires you to pay taxes on mined and purchased Crypto if you make any profit. It&#39;s outrageous how the IRS totally ignores billionaires avoiding trillions of dollars in taxes while asking Crypto holders to pay taxes.</p>\n\n<p>The government literally paid billionaires by the trillions after they printed money out of thin air to dump straight into the stock market. Normal people were already scammed when the dollar supply was increased by <strong>50%</strong> and they were told to go fuck themselves after the government didn&#39;t even bother raising the minimum wage as promised.</p>\n\n<p>Billionaires literally avoid trillions of dollars in taxes by moving their assets to tax havens or just by using shady practices. You have teachers paying more taxes than billionaires while not being able to afford a single bedroom apartment in the city they teach in.</p>\n\n<p>But of course, tax Crypto while giving billionaires trillions of dollars for free right? How dare the poor peasants invest in Crypto to become rich!</p>\n</div><!-- SC_ON -->",
  "score": 218,
  "permalink": "/r/CryptoCurrency/comments/qazbdu/taxing_crypto_while_billionaires_avoid_trillions/",
  "subreddit": "CryptoCurrency",
  "id": "qazbdu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Not only do you have to report Crypto transactions to the IRS for tax purposes,\nthe IRS requires you to pay taxes on mined and purchased Crypto if you make any\nprofit. It's outrageous how the IRS totally ignores billionaires avoiding\ntrillions of dollars in taxes while asking Crypto holders to pay…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "税務上、Cryptoの取引をIRSに報告する必要があるだけでなく\nIRSは、利益を得た場合、採掘および購入したCryptoに税金を支払うことを要求します。\n利益が出た場合には税金を支払う必要があります。IRSが、億万長者が何兆円ものお金を回避していることを全く無視しているのは、言語道断です。\n何兆ドルもの税金を回避している億万長者を全く無視して、暗号保有者に支払いを求めるなんて...",
      "title": "億万長者が何兆円もの税金を免れているのに、暗号に課税するのはシステムが不正であることを示している"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你不仅要向美国国税局报告加密货币的交易，以达到纳税目的。\n国税局要求你对开采和购买的加密货币纳税，如果你有任何盈利的话\n利润。令人气愤的是，国税局完全无视亿万富翁逃避的\n万亿美元的税收，而要求加密货币持有者支付......",
      "title": "对加密货币征税，而亿万富翁却逃避数万亿美元的税收，这表明系统被操纵了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你不僅要向美國國稅局報告加密貨幣的交易，以達到納稅目的。\n國稅局要求你對開採和購買的加密貨幣納稅，如果你有任何盈利的話\n利潤。令人氣憤的是，國稅局完全無視億萬富翁逃避的\n萬億美元的稅收，而要求加密貨幣持有者支付......",
      "title": "對加密貨幣徵稅，而億萬富翁卻逃避數萬億美元的稅收，這表明系統被操縱了"
    }
  ]
}