{
  "author": "mirza1h",
  "the_new_excerpt": "American cryptographer named David Chaum published a legendary article called\n“Traceable Email, Reverse Addresses and Digital Aliases” in 1981.\n\nIn this article, Chaum described an anonymous digital payment system. In 1989,\nChaum created a functioning digital currency DigiCash based on his protocol.…",
  "original_created_utc": 1618000751,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アメリカの暗号学者、デビッド・チャウムが1981年に発表した伝説的な論文がある。\n\"Traceable Email, Reverse Addresses and Digital Aliases\" という伝説的な論文を1981年に発表しました。\n\nこの論文の中で、Chaumは匿名のデジタル決済システムについて述べています。1989年には\nChaumは、彼のプロトコルに基づいて、機能するデジタル通貨DigiCashを作成しました....",
      "title": "ビットコインは最初の暗号通貨ではないことをご存知でしたか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "美国密码学家David Chaum发表了一篇传奇性的文章，叫做\n\"可追踪电子邮件、反向地址和数字别名 \"在1981年。\n\n在这篇文章中，Chaum描述了一个匿名数字支付系统。在1989年。\nChaum根据他的协议创造了一种可以运作的数字货币DigiCash....。",
      "title": "你知道比特币不是第一个加密货币吗 ?"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "美國密碼學家David Chaum發表了一篇傳奇性的文章，叫做\n\"可追蹤電子郵件、反向地址和數字別名 \"在1981年。\n\n在這篇文章中，Chaum描述了一個匿名數字支付系統。在1989年。\nChaum根據他的協議創造了一種可以運作的數字貨幣DigiCash....。",
      "title": "你知道比特幣不是第一個加密貨幣嗎 ?"
    }
  ],
  "title": "Did you know that Bitcoin isn't the first cryptocurrency ?",
  "created_utc": 1618017410,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>American cryptographer named David Chaum published a legendary article called “Traceable Email, Reverse Addresses and Digital Aliases” in 1981.  </p>\n\n<p>In this article, Chaum described an anonymous digital payment system. In 1989, Chaum created a functioning digital currency DigiCash based on his protocol. It was a revolutionary technology that gave the world the concept of “blind signatures”. </p>\n\n<p>Blind signatures conceal the content of a message and use a combination of public and private passwords to confirm a transaction. Today, this concept is used in well-known cryptocurrencies in the form of public keys. </p>\n\n<p>This technology was way ahead of it&#39;s time as  DigiCash Inc. declared bankruptcy in 1998 and subsequently sold its assets to eCash Technologies.</p>\n\n<p>Many of DigiCash&#39;s innovations laid the groundwork for the development of blockchain technology in the 2000s.</p>\n</div><!-- SC_ON -->",
  "score": 458,
  "permalink": "/r/CryptoCurrency/comments/mnq5jn/did_you_know_that_bitcoin_isnt_the_first/",
  "subreddit": "CryptoCurrency",
  "id": "mnq5jn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566614240
}