{
  "author": "KcAfterHours",
  "original_created_utc": 1648580381,
  "title": "Why are most Christian’s Conservative when Jesus is the exact opposite?",
  "created_utc": 1648589768,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Jesus served and took care of the poor, while most republican policies hurt the poor. Jesus didn’t judge, but conservatives seem to judge people who receive abortions or the LGBTQ+ community.&lt;/p&gt;\n\n&lt;p&gt;Jesus was for the foreigner and the refugee. Conservatives fight against their rights.&lt;/p&gt;\n\n&lt;p&gt;Jesus was not violent. Conservatives are pro gun, and Jesus has a specific verse saying “those who live by the sword, die by the sword.” So those seem contradictory.&lt;/p&gt;\n\n&lt;p&gt;It just seems like cognitive dissonance to me.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 118,
  "permalink": "/r/TooAfraidToAsk/comments/trenfe/why_are_most_christians_conservative_when_jesus/",
  "subreddit": "TooAfraidToAsk",
  "id": "trenfe",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Jesus served and took care of the poor, while most republican policies hurt the\npoor. Jesus didn’t judge, but conservatives seem to judge people who receive\nabortions or the LGBTQ+ community.\n\nJesus was for the foreigner and the refugee. Conservatives fight against their\nrights.\n\nJesus was not…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "イエスは貧しい人々に仕え、面倒を見たが、共和党の政策の多くは貧しい人々を苦しめている。\n貧しい。イエスは裁かなかったが、保守派は裁くようだ。\n中絶やLGBTQ+のコミュニティ。\n\nイエスは外国人、難民のためにあった。保守派は彼らのために戦い\nの権利です。\n\nイエスは...",
      "title": "イエス様は正反対なのに、なぜほとんどのキリスト教徒は保守的なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "耶稣服务并照顾穷人，而大多数共和党的政策却伤害了穷人。\n穷人。耶稣没有评判，但保守派似乎评判那些接受堕胎或LGBT+群体的人。\n堕胎或LGBTQ+群体。\n\n耶稣是为了外国人和难民。保守派则反对他们的\n权利。\n\n耶稣不是...",
      "title": "为什么大多数基督徒都是保守的，而耶稣恰恰相反？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "耶穌服務並照顧窮人，而大多數共和黨的政策卻傷害了窮人。\n窮人。耶穌沒有評判，但保守派似乎評判那些接受墮胎或LGBT+羣體的人。\n墮胎或LGBTQ+羣體。\n\n耶穌是爲了外國人和難民。保守派則反對他們的\n權利。\n\n耶穌不是...",
      "title": "爲什麼大多數基督徒都是保守的，而耶穌恰恰相反？"
    }
  ]
}