{
  "author": "seadev32",
  "original_created_utc": 1637813456,
  "title": "How did jeans become the \"default\" casual pants? Was there ever a competitor?",
  "created_utc": 1637823531,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I&#39;m sitting in a packed bar the night before Thanksgiving (as one does) and I noticed that literally every man and about 80% of the women are wearing jeans.  I know leggings have kind of jumped on the scene the last few years but for as long as I can remember jeans have the been the regular casual clothing.   When did that happen?  Levi&#39;s have existed since the 1800s and in pictures as recently as the 40s or 50s people wore more formal clothing it seems, so it doesn&#39;t seem like a novelty thing. How did jeans take over a hundred years after thier invention?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/r1nkyf/how_did_jeans_become_the_default_casual_pants_was/",
  "subreddit": "AskHistorians",
  "id": "r1nkyf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So I'm sitting in a packed bar the night before Thanksgiving (as one does) and I\nnoticed that literally every man and about 80% of the women are wearing jeans. I\nknow leggings have kind of jumped on the scene the last few years but for as\nlong as I can remember jeans have the been the regular casual…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "感謝祭の前夜、満員のバーに座っていると（いつものように）、私は\n男性はもちろんのこと、女性の80％がジーンズを履いていることに気がつきました。I\nここ数年、レギンスがブームになっているのは知っていますが、私が記憶している限りでは\nしかし、私が記憶している限りでは、ジーンズは通常のカジュアル...",
      "title": "なぜジーンズが「デフォルト」のカジュアルパンツになったのか？ライバルはいたのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "感恩节前夜，我坐在一个拥挤的酒吧里（正如人们所做的那样），我注意到每个男人和大约80%的女人都穿着牛仔裤。\n我注意到实际上每个男人和大约80%的女人都穿着牛仔裤。I\n我知道紧身裤在过去的几年里开始流行起来，但在我的记忆中，牛仔裤一直是最受欢迎的。\n但在我的记忆中，牛仔裤一直是常规的休闲装。",
      "title": "牛仔裤是如何成为 \"默认 \"的休闲裤的？曾经有竞争对手吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "感恩節前夜，我坐在一個擁擠的酒吧裏（正如人們所做的那樣），我注意到每個男人和大約80%的女人都穿着牛仔褲。\n我注意到實際上每個男人和大約80%的女人都穿着牛仔褲。I\n我知道緊身褲在過去的幾年裏開始流行起來，但在我的記憶中，牛仔褲一直是最受歡迎的。\n但在我的記憶中，牛仔褲一直是常規的休閒裝。",
      "title": "牛仔褲是如何成爲 \"默認 \"的休閒褲的？曾經有競爭對手嗎？"
    }
  ]
}