{
  "author": "Letlilive",
  "original_created_utc": 1646515875,
  "title": "Why do people complain about desk”9-5” jobs so much?",
  "created_utc": 1646534574,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I simply don’t get it. For YEARS we’ve been fed that a 9-5 office type job is the most soul crushing job on earth but after working food service for like 5 years and just getting a front desk job at a barber shop this shit is the life. I just check in and out customers, answer some phone calls, make appointments,sweep up hair and sanitize shit. My boss and coworkers are all cool too.I fucking love it. it’s really light work compared to the restaurant work I’ve done where it’s constant running around, tons of side work, cleaning for hours on end, having no weekends or nights. Not to mention getting to sit DOWN at a job. On top of that an hour lunch? Restaurant jobs you’re lucky if you get a chance to pee. Idk it just seems like people complain about it a lot when it’s really a cushy job.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/TooAfraidToAsk/comments/t7jcx5/why_do_people_complain_about_desk95_jobs_so_much/",
  "subreddit": "TooAfraidToAsk",
  "id": "t7jcx5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I simply don’t get it. For YEARS we’ve been fed that a 9-5 office type job is\nthe most soul crushing job on earth but after working food service for like 5\nyears and just getting a front desk job at a barber shop this shit is the life.\nI just check in and out customers, answer some phone calls,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "単純に理解できないんです。私たちは何年も前から 9時5時の事務的な仕事は\nしかし、5年ほど外食産業で働いた後、このような仕事をするようになりました。\n床屋でフロントの仕事に就いたばかりなのに、このクソみたいな生活は何なんだ。\nお客さんの出入りをチェックしたり、電話に出たり...。",
      "title": "なぜ、人々は「9時〜5時」のデスクワークに不満を持つのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我根本不明白。多年来，我们一直被告知，朝九晚五的办公室类型的工作是地球上最令人伤心的工作。\n是地球上最令人心碎的工作，但在做了5年的餐饮服务之后\n在理发店做了5年的前台工作后，这就是生活。\n我只是为顾客办理入住和退房手续，接听一些电话...。",
      "title": "为什么人们对 \"朝九晚五 \"的工作有那么多抱怨？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我根本不明白。多年來，我們一直被告知，朝九晚五的辦公室類型的工作是地球上最令人傷心的工作。\n是地球上最令人心碎的工作，但在做了5年的餐飲服務之後\n在理髮店做了5年的前臺工作後，這就是生活。\n我只是爲顧客辦理入住和退房手續，接聽一些電話...。",
      "title": "爲什麼人們對 \"朝九晚五 \"的工作有那麼多抱怨？"
    }
  ]
}