{
  "author": "PoodleMyDoodle",
  "original_created_utc": 1654806187,
  "title": "Carbonated water tastes bitter and horrid, everyone says they just taste water/flavouring. Am I weird?",
  "created_utc": 1654829308,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Carbonated water beverages seem to have been a hit lately. Parrier, bubly, other brands.&lt;/p&gt;\n\n&lt;p&gt;They all taste absolutely horrible to me, even the ones with added flavorings. They taste extremely bitter and chemically.  Maybe it&amp;#39;s the carbonic acid, but I don&amp;#39;t get this taste when I drink something like Coke or Sprite.&lt;/p&gt;\n\n&lt;p&gt;Friends and family just say it tastes like normal water just bubbly. They don&amp;#39;t know what I&amp;#39;m talking about.&lt;/p&gt;\n\n&lt;p&gt;Anyone else experience this? Or are my taste buds just screwed up?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/v8pysk/carbonated_water_tastes_bitter_and_horrid/",
  "subreddit": "NoStupidQuestions",
  "id": "v8pysk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Carbonated water beverages seem to have been a hit lately. Parrier, bubly, other\nbrands.\n\nThey all taste absolutely horrible to me, even the ones with added flavorings.\nThey taste extremely bitter and chemically. Maybe it's the carbonic acid, but I\ndon't get this taste when I drink something like…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、炭酸水飲料がヒットしているようです。パリエ、バブリー、その他\nのブランドがあります。\n\nどれもこれも、香料が添加されているものでさえ、私にはまったくひどい味です。\n非常に苦く、化学的な味がする。炭酸のせいかもしれませんが、私は\n炭酸のせいかもしれませんが、私はこの味を感じないんです。",
      "title": "炭酸水は苦くて恐ろしい味がする、みんな水・香料の味しかしないと言っている。私が変なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "碳酸水饮料最近似乎很受欢迎。Parrier, bubly, 其他\n品牌。\n\n对我来说，它们的味道都是绝对可怕的，即使是那些添加了调味剂的。\n它们的味道极其苦涩，而且有化学成分。也许是碳酸的缘故，但我\n但我喝的时候没有这种味道，比如......",
      "title": "碳酸水的味道又苦又可怕，大家都说他们只是尝到了水/香精的味道。我很奇怪吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "碳酸水飲料最近似乎很受歡迎。Parrier, bubly, 其他\n品牌。\n\n對我來說，它們的味道都是絕對可怕的，即使是那些添加了調味劑的。\n它們的味道極其苦澀，而且有化學成分。也許是碳酸的緣故，但我\n但我喝的時候沒有這種味道，比如......",
      "title": "碳酸水的味道又苦又可怕，大家都說他們只是嚐到了水/香精的味道。我很奇怪嗎？"
    }
  ]
}