{
  "author": "Wonzky",
  "original_created_utc": 1635269939,
  "title": "Anyone else in the red?",
  "created_utc": 1635297156,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Lots of posts about everything reaching ATHs, big green dildos all around and what to do with the gains. As much as I am happy for everyone in the green, many of my holdings have decidedly not reached ATHs. </p>\n\n<p>I&#39;m not talking about shitcoins but projects I&#39;d consider solid like VET, UNI, LINK, ADA. I get that a lot of the money went into BTC and ETH and alt season is suppose to be around the corner, but feels like alt season is already here, just not with the alts that I&#39;m holding</p>\n\n<p>Anyone else in the same boat? Could use some hopium</p>\n</div><!-- SC_ON -->",
  "score": 182,
  "permalink": "/r/CryptoCurrency/comments/qgbq7i/anyone_else_in_the_red/",
  "subreddit": "CryptoCurrency",
  "id": "qgbq7i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Lots of posts about everything reaching ATHs, big green dildos all around and\nwhat to do with the gains. As much as I am happy for everyone in the green, many\nof my holdings have decidedly not reached ATHs.\n\nI'm not talking about shitcoins but projects I'd consider solid like VET, UNI,\nLINK, ADA. I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ATH、大きな緑のディルドに到達するすべてのものについての多くの投稿があります。\n獲得したものをどうするかなどの投稿がありました。私は緑の中にいる皆さんを喜んでいますが、私の持ち株の多くは\n私の持ち株の多くは、明らかに ATH に達していません。\n\n私はクソコインの話をしているのではなく、VET、UNI、LINK、ADAのような私が堅実だと思うプロジェクトの話をしています。\nLINK, ADA. I...",
      "title": "赤字の人はいませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "很多关于一切达到ATH的帖子，到处都是绿色的大阳具和\n如何处理这些成果。尽管我为每个人的绿色投资感到高兴，但我的许多投资都没有达到ATH。\n我所持有的许多股票显然没有达到ATH。\n\n我说的不是狗屎币，而是我认为坚实的项目，如VET、UNI。\nLINK, ADA。I...",
      "title": "还有人处于亏损状态吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "很多關於一切達到ATH的帖子，到處都是綠色的大陽具和\n如何處理這些成果。儘管我爲每個人的綠色投資感到高興，但我的許多投資都沒有達到ATH。\n我所持有的許多股票顯然沒有達到ATH。\n\n我說的不是狗屎幣，而是我認爲堅實的項目，如VET、UNI。\nLINK, ADA。I...",
      "title": "還有人處於虧損狀態嗎？"
    }
  ]
}