{
  "author": "isaac_horstmeier",
  "original_created_utc": 1633274365,
  "title": "The biggest rug pulls have been made by Governments.",
  "created_utc": 1633332645,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>And yet somehow, some governments around the globe are still pushing the old, rusty narrative that Crypto projects are a threat to society, and yes Crypto it&#39;s a threat but to the society that they want to keep under they total control. Somehow there&#39;s people who still believe that the whole crypto universe it&#39;s just a ponzi scheme. </p>\n\n<p>And yes, don&#39;t get me wrong, there are some projects on the cryptoverse that are just made for make a rug pull, mostly promoted by celebrities, or promoted on obviously scam websites like cryptomoonshots.</p>\n\n<p>When you see countries like Venezuela, Zimbabwe, Argentina (who once was one of the richest countries in the world, top 5 actually). Those countries have been a victim of the biggest rug pulls that can ever be made on the history of human kind, where they actually made people work their entire life for a scam &quot;coin&quot; who can be printed at their will, and it will be losing value overtime at a rate out of this world. Venezuela it&#39;s up to 2700% inflation rate... Can you even imagine if crypto projects would put out of nowhere more and more and more coins into the market, and just keep increasing the ammount of coins available just &#39;cause they want it that way? The crypto world would be bombarded with con-arguments, and it would be on the lobbyists portfolio arguments to attack the cryptoverse.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/egsxfrbs49r71.png?width=1000&amp;format=png&amp;auto=webp&amp;s=e56eb7f1ffd9609e6ee6e2f0bc684478fd971a6c\">Venezuela inflation rate over the years.</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/5j6yryub59r71.png?width=400&amp;format=png&amp;auto=webp&amp;s=75390e8bce003544df5e64983bbe183c2f4485dc\">Argentina Inflation rate 2020-2021.</a></p>\n\n<p>Even USA now are showing us from a long time ago, that they are just using their printing machine at their will to keep the government running and not failing into a default. The actual Debt of the USA governments it&#39;s sitting at a modest 28,4 trillion dollars, and they will just changing the debt limit and the crash will be just harder and harder. </p>\n\n<p><a href=\"https://preview.redd.it/tuoq4swp39r71.png?width=2332&amp;format=png&amp;auto=webp&amp;s=bcc4ada73035953cb62b32a23fa5ca303a8e7ca8\">US debt Limit vs US total Debt.</a></p>\n\n<p>And, don&#39;t get me wrong, but, at least... crypto rug pulls are made to people who freely went into that project. On the otherside, you can&#39;t <em>always</em> choose where you are born, and where do you get to work, so you are forced to work for and with a certain currency, and you <strong>must</strong> only do transactions with that currency mostly your entire life. On the other hand with crypto you can make your homework, and choose what ever project it fits you the most, and make your transactions with that given currency (thinking long term here). </p>\n\n<p>So anyways, just wanted to share a thought, I believe crypto it&#39;s way better than any government currency thinking long term, we will see massive adoption as time goes by, and people start realizing that they can now choose, what currency they can truly trust, and they can get out of that shady part of the system where they impose to them a given currency backed by armed forces and government power.</p>\n\n<p>The future it&#39;s decentralized.</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/CryptoCurrency/comments/q0jt8j/the_biggest_rug_pulls_have_been_made_by/",
  "subreddit": "CryptoCurrency",
  "id": "q0jt8j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "And yet somehow, some governments around the globe are still pushing the old,\nrusty narrative that Crypto projects are a threat to society, and yes Crypto\nit's a threat but to the society that they want to keep under they total\ncontrol. Somehow there's people who still believe that the whole crypto…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "しかし、世界中の政府の中には、いまだに「暗号プロジェクトは社会の脅威である」という古くて錆びついた物語を押し付けているところがあります。\n暗号プロジェクトは社会への脅威であるという古くて錆びついた物語を推し進めています。\n脅威ではありますが、彼らが完全に支配下に置きたいと考えている社会にとっては脅威です。\nそうです。なぜか、いまだに暗号化プロジェクトは社会の脅威であると信じている人たちがいます。",
      "title": "最大の引き抜きは、政府が行ってきた。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "然而，不知何故，全球各地的一些政府仍在推崇老一套。\n老掉牙的说法，认为加密货币项目是对社会的威胁。\n是一种威胁，但却是对他们想完全控制的社会的一种威胁。\n控制下的社会。不知何故，有一些人仍然相信整个加密货币...",
      "title": "最大的地毯拉动是由政府做出的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "然而，不知何故，全球各地的一些政府仍在推崇老一套。\n老掉牙的說法，認爲加密貨幣項目是對社會的威脅。\n是一種威脅，但卻是對他們想完全控制的社會的一種威脅。\n控制下的社會。不知何故，有一些人仍然相信整個加密貨幣...",
      "title": "最大的地毯拉動是由政府做出的。"
    }
  ]
}