{
  "author": "D3FEATER",
  "original_created_utc": 1655814238,
  "title": "I wrote an ELI5 description of every coin on Coinbase",
  "created_utc": 1655825797,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Those who were here 2017-18 know what is coming over the next few months: the herd will thin and many of the alts you’ve grown to love are going to starve and die. Bitcoin dominance will consolidate and is already creeping above 70% in terms of volume.&lt;/p&gt;\n\n&lt;p&gt;As someone who first bought bitcoin in a barnes and noble off localbitcoins in 2013, I consider myself a Bitcoin Maxi — but I would be lying if I didn’t say that my biggest gains haven’t come from altcoins. Remember that ether itself was once considered a shitcoin. &lt;strong&gt;Historically, here are the two best things you can do during crypto winter:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;strong&gt;DCA into bitcoin&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Study and pick your alts.&lt;/strong&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Many coins that were by no means unknown in 2018 went on to produce 10-100x gains. Here are some prices for reference on Dec 22, 2017 — right after Bitcoin fell 30% over the course of two days (sound familiar?)&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;BNB: $5.54&lt;/li&gt;\n&lt;li&gt;Link: $0.57&lt;/li&gt;\n&lt;li&gt;KuCoin: $0.88&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Now, one of the bad things about the crypto industry is that people try to it make more complicated than it needs to be. Bitcoin needs a white paper; Floki Shiba Inu Monkey Pox coin doesn’t. This is why I wrote an &lt;a href=\"https://www.bitscrypto.com/cryptos\"&gt;ELI5 Description of Every Coin on Coinbase&lt;/a&gt;. A few well placed investments into the right alts while dollar cost averaging into BTC/ETH has historically been the best bear market strategy — and there is no reason to think this time around is any different.&lt;/p&gt;\n\n&lt;p&gt;Even more important than picking the right alts is to &lt;strong&gt;set up a DCA strategy and stick to it&lt;/strong&gt;. I like to keep my crypto investments proportional to how much money I’m actually spending day to day, so I actually wrote myself an ios/android app that rounds up my everyday purchases and invests the spare change into my coinbase portfolio. This is a strategy I’ve been employing for a few years now, but only just recently made the code user friendly enough to be used by strangers and added a “boost” setting so you can ramp investments up and down with spending. I made it free with no current monetization plan (it’s in the &lt;a href=\"https://9u9hu.app.link/e/view\"&gt;app store&lt;/a&gt;, so reviewed by Apple/Google).&lt;/p&gt;\n\n&lt;p&gt;** Edited for people who don&amp;#39;t want to click any embedded links (a la &amp;quot;all my apes gone&amp;quot;):&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;ELI5 descriptions: &lt;a href=\"https://bitscrypto.com/cryptos\"&gt;https://bitscrypto.com/cryptos&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;Free &amp;quot;acorns for crypto&amp;quot; app with no monetization plan:\n\n&lt;ul&gt;\n&lt;li&gt;iOS: &lt;a href=\"https://apps.apple.com/us/app/bits-buy-crypto-with-change/id1619835745\"&gt;https://apps.apple.com/us/app/bits-buy-crypto-with-change/id1619835745&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;Android: &lt;a href=\"https://play.google.com/store/apps/details?id=io.bits.getbits\"&gt;https://play.google.com/store/apps/details?id=io.bits.getbits&lt;/a&gt;&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 351,
  "permalink": "/r/CryptoCurrency/comments/vhc3xx/i_wrote_an_eli5_description_of_every_coin_on/",
  "subreddit": "CryptoCurrency",
  "id": "vhc3xx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Those who were here 2017-18 know what is coming over the next few months: the\nherd will thin and many of the alts you’ve grown to love are going to starve and\ndie. Bitcoin dominance will consolidate and is already creeping above 70% in\nterms of volume.\n\nAs someone who first bought bitcoin in a…"
}