{
  "author": "who_nobody",
  "original_created_utc": 1637331446,
  "title": "Is buying a Nintendo switch being a 22 year old woman immature or weird?",
  "created_utc": 1637350399,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was talking to my mom and mentioned that I might get myself a Nintendo switch for Christmas as I&#39;ve been enjoying playing borderlands on PC a lot and I really really want to play animal crossing (I&#39;ve played it on other people&#39;s consoles and I love it). Also the second part of my favorite game is launching next year, and I could play it on my laptop but it is going to be available on the switch too.</p>\n\n<p>I do have a job and would buy it with my own paychecks so it isn&#39;t like I&#39;m asking her for money. </p>\n\n<p>I didn&#39;t expect her to react like this, she told me not even my little brother is into stuff like that anymore and that I should grow up. To be fair I&#39;m only recently starting to be interested in video games and maybe I&#39;m too old for it? Is this weird?</p>\n</div><!-- SC_ON -->",
  "score": 134,
  "permalink": "/r/TooAfraidToAsk/comments/qxh4yv/is_buying_a_nintendo_switch_being_a_22_year_old/",
  "subreddit": "TooAfraidToAsk",
  "id": "qxh4yv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was talking to my mom and mentioned that I might get myself a Nintendo switch\nfor Christmas as I've been enjoying playing borderlands on PC a lot and I really\nreally want to play animal crossing (I've played it on other people's consoles\nand I love it). Also the second part of my favorite game is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "母と話していて、クリスマスにNintendo switchを買おうかなと話していました。\nというのも、PCでボーダーランズをよくプレイしていて、それがとても気に入っているからです。\nアニマルクロッシングをやってみたいと思っているんだ（他の人のゲーム機でやったことがあって\n気に入っています）。また、私の好きなゲームの第二弾は...。",
      "title": "22歳の女性がNintendo switchを買うことは、未熟なのか、変なのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我和我妈妈聊天时提到，我可能会在圣诞节给自己买一个任天堂开关\n因为我一直很喜欢在PC上玩《边疆》，而且我真的很想玩《动物之森》。\n我真的很想玩《动物之森》（我在别人的游戏机上玩过，我很喜欢）。\n我喜欢它）。另外，我最喜欢的游戏的第二部分是...",
      "title": "作为一个22岁的女人，购买任天堂开关是不成熟还是奇怪？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我和我媽媽聊天時提到，我可能會在聖誕節給自己買一個任天堂開關\n因爲我一直很喜歡在PC上玩《邊疆》，而且我真的很想玩《動物之森》。\n我真的很想玩《動物之森》（我在別人的遊戲機上玩過，我很喜歡）。\n我喜歡它）。另外，我最喜歡的遊戲的第二部分是...",
      "title": "作爲一個22歲的女人，購買任天堂開關是不成熟還是奇怪？"
    }
  ]
}