{
  "author": "ev29xyro",
  "original_created_utc": 1639402291,
  "title": "Why do we still have to work when a fraction of our population can produce most things we need?",
  "created_utc": 1639446396,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This might be a really dumb question and might end up on &lt;a href=\"/r/badphilosophy\"&gt;r/badphilosophy&lt;/a&gt;, but honestly, I have no starting point here and very little structure at hand to examine the topic at hand, so please allow me to share a few snippets of where this question is coming from.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;I saw a meme about how the ancient Greeks would be outraged if they found out that most of us can&amp;#39;t enjoy a leisured life although we invented machines that make food production so much easier. That is such a simple thought but I can&amp;#39;t really wrap my head around why that should be overly naive or whatnot.&lt;/li&gt;\n&lt;li&gt;Still, most things I use daily e.g.  the technology I am using to type this requires people working, like metal that some children mine in a very grim place. So there&amp;#39;s many many areas that still require workforce – but is that worth it? Do we need these things? What if we reevaluated our resources on food, housing, health and education?&lt;/li&gt;\n&lt;li&gt;Why are things the way they are? Which things we buy do we need to live good lives? Why is everyone participating in this? Is it impossible to go back after having tasted the cheap sugary taste of capitalism? Couldn&amp;#39;t we all live much better lives with what we could have instead of what we think we want to have?&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Again, sorry if this is out of place here and it really sounds like you needed to explain to a five year old how capitalism developed and why we like it. But something keeps me from shrugging this off. How to go about this? How to start thinking properly here?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 116,
  "permalink": "/r/askphilosophy/comments/rffsli/why_do_we_still_have_to_work_when_a_fraction_of/",
  "subreddit": "askphilosophy",
  "id": "rffsli",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This might be a really dumb question and might end up on r/badphilosophy\n[/r/badphilosophy], but honestly, I have no starting point here and very little\nstructure at hand to examine the topic at hand, so please allow me to share a\nfew snippets of where this question is coming from.\n\n * I saw a meme…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは本当に馬鹿な質問で、r/badphilosophyに載ってしまうかもしれません。\n[しかし、正直なところ、私にはここでの出発点がなく、ほとんど\nこのトピックを検討するための手持ちの構成は、次のとおりです。\nこの質問がどこから来たのか、いくつかの断片を紹介します。\n\n * 私はミームを見ました...",
      "title": "人口の一部が必要なものをほとんど生産できるのに、なぜ私たちはまだ働かなければならないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这可能是一个非常愚蠢的问题，可能会在r/badphilosophy上结束。\n[/r/badphilosophy]，但说实话，我在这里没有起点，也没有什么\n的结构，所以请允许我分享一下这个问题的几个片段。\n请允许我分享这个问题的几个片段。\n\n *我看到一个备忘录...",
      "title": "当我们人口中的一小部分人可以生产我们所需要的大部分东西时，我们为什么还要工作呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這可能是一個非常愚蠢的問題，可能會在r/badphilosophy上結束。\n[/r/badphilosophy]，但說實話，我在這裏沒有起點，也沒有什麼\n的結構，所以請允許我分享一下這個問題的幾個片段。\n請允許我分享這個問題的幾個片段。\n\n *我看到一個備忘錄...",
      "title": "當我們人口中的一小部分人可以生產我們所需要的大部分東西時，我們爲什麼還要工作呢？"
    }
  ]
}