{
  "author": "game-book-life",
  "the_new_excerpt": "Given the goal of being a Boglehead is to set your allocation and investment\nplan with broadly diversified cheap index funds, and then stay the course,\nshould the goal for the average investor be to come here, learn, and leave, or\nto continue to engage?\n\nObviously there will be those that want to…",
  "original_created_utc": 1622580156,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ボーグルヘッドであることの目的は、広く分散された安価なインデックスファンドで自分のアロケーションと投資プランを設定し、それを維持することです。\n広く分散された安価なインデックスファンドで投資計画を立て、その方針を貫くことです。\n一般的な投資家の目標は、ここに来て学んで帰ることでしょうか？\nそれとも継続して取り組むことでしょうか？\n\nもちろん、ここに来たいと思う人もいるでしょう。",
      "title": "Goal to Unsubscribe from Bogleheads?"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "考虑到作为一个Boglehead的目标是用广泛分散的廉价指数基金设定你的分配和投资计划，然后坚持下去。\n廉价指数基金，然后坚持下去。\n普通投资者的目标应该是来到这里，学习，然后离开，还是\n还是继续参与？\n\n很明显，会有一些人想...",
      "title": "取消订阅Bogleheads的目标？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "考慮到作爲一個Boglehead的目標是用廣泛分散的廉價指數基金設定你的分配和投資計劃，然後堅持下去。\n廉價指數基金，然後堅持下去。\n普通投資者的目標應該是來到這裏，學習，然後離開，還是\n還是繼續參與？\n\n很明顯，會有一些人想...",
      "title": "取消訂閱Bogleheads的目標？"
    }
  ],
  "title": "Goal to Unsubscribe from Bogleheads?",
  "created_utc": 1622586175,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Given the goal of being a Boglehead is to set your allocation and investment plan with broadly diversified cheap index funds, and then stay the course, should the goal for the average investor be to come here, learn, and leave, or to continue to engage?</p>\n\n<p>Obviously there will be those that want to educate others and share information, but I would suspect the majority may not do that. </p>\n\n<p>Staying overly engaged can also run the risk of questioning your decisions, reversing course, and generally worrying about your investments far more than you should.</p>\n\n<p>That all said, is it better for someone to stick around here or should they leave all investment subs (once they&#39;ve gone full Bogle) to shield themselves from noise?</p>\n</div><!-- SC_ON -->",
  "score": 140,
  "permalink": "/r/Bogleheads/comments/nq42iv/goal_to_unsubscribe_from_bogleheads/",
  "subreddit": "Bogleheads",
  "id": "nq42iv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804299113
}