{
  "author": "Mariana21bn",
  "original_created_utc": 1636551451,
  "title": "In case something happens to you, shouldn't someone close to you know your seed phrase?",
  "created_utc": 1636559224,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Since we are all gonna be millionaires, including me, i came up with the thought of having a closed one - perhaps a parent - knowing my seed phrase in case something happened to me. </p>\n\n<p>I know the vast majority of us haven&#39;t even shared that they have invested in crypto, waiting to become a millionaire and surprise everyone like a savage. But we have to think responsibly because you never know what can happen. </p>\n\n<p>This is the only - and i repeat - the only case we should break the number one rule of crypto &quot;Don&#39;t talk about Crypto&quot;. I just thought i should share this with you guys because it made me re-evaluate some of my beliefs for the greater good of me and my people.</p>\n\n<p>PS : I am having second thoughts about it. Don&#39;t tell your wife.</p>\n</div><!-- SC_ON -->",
  "score": 201,
  "permalink": "/r/CryptoCurrency/comments/qqumgb/in_case_something_happens_to_you_shouldnt_someone/",
  "subreddit": "CryptoCurrency",
  "id": "qqumgb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Since we are all gonna be millionaires, including me, i came up with the thought\nof having a closed one - perhaps a parent - knowing my seed phrase in case\nsomething happened to me.\n\nI know the vast majority of us haven't even shared that they have invested in\ncrypto, waiting to become a millionaire…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私も含めて全員が億万長者になるのだから、万が一に備えて、閉鎖的な人（おそらく親）に私の種明かしを知ってもらおうと考えました。\n私に何かあった時のために、親のような身近な人に私の種明かしを知ってもらおうと考えました。\n私に何かあったときのために。\n\n大多数の人は、自分が暗号に投資していて、億万長者になるのを待っているということを共有していませんよね。\nクリプトに投資して、ミリオネアになるのを待っている...。",
      "title": "自分に何かあったときのために、身近な人が自分の種明かしを知っておくべきではないでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "由于我们都将成为百万富翁，包括我在内，我想出了一个想法\n有一个封闭的人--也许是父母--知道我的种子短语，以防\n我发生了什么事。\n\n我知道我们中的绝大多数人甚至还没有分享他们已经投资于\n加密货币，等待成为百万富翁......",
      "title": "万一你发生了什么事，你身边的人不应该知道你的种子语吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "由於我們都將成爲百萬富翁，包括我在內，我想出了一個想法\n有一個封閉的人--也許是父母--知道我的種子短語，以防\n我發生了什麼事。\n\n我知道我們中的絕大多數人甚至還沒有分享他們已經投資於\n加密貨幣，等待成爲百萬富翁......",
      "title": "萬一你發生了什麼事，你身邊的人不應該知道你的種子語嗎？"
    }
  ]
}