{
  "author": "gigabyteIO",
  "original_created_utc": 1646327357,
  "title": "Algorand State Proofs are here! This is huge! Algorand State Proofs are a new interoperability standard that securely connects blockchains to the outer world without trust in an intermediary. All Proof of Stake chains can implement State Proofs to remove trust from the cross-chain equation.",
  "created_utc": 1646339670,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Blockchain ecosystems are like cities: each one provides value that draws people to visit — ranging from business opportunities, community, entertainment, infrastructure, local governance, to plain personal preference. As the industry matures, people will have more reasons to visit different ecosystems, driving more value into cross-chain applications.&lt;/p&gt;\n\n&lt;p&gt;In order to access your source blockchain in new ecosystems, you need a reliable way to verify its “state” (a snapshot of account balances and transactions) in the new environment. This trustless infrastructure is currently missing from the market, so people have turned to trusted intermediaries, like centralized bridges and validator networks, to handle their assets. Layer-1 blockchains share a responsibility to reduce this trust threshold in order to protect on-chain value.&lt;/p&gt;\n\n&lt;p&gt;Algorand State Proofs (ASPs) are a new interoperability standard that extends trustless interactions beyond a blockchain’s native ecosystem. Through &lt;a href=\"https://medium.com/codechain/blockchain-light-client-1171dfa1269a\"&gt;light clients&lt;/a&gt; (efficient software that tracks blockchain state), they provide a simple, trustless interface to build powerful applications conditioned by multiple blockchains’ events. State Proofs can be implemented on all Proof of Stake chains, and will accelerate our collective path towards true decentralization.&lt;/p&gt;\n\n&lt;p&gt;Algorand State Proofs fortify cross-chain applications with Post-Quantum security. By using advanced cryptography, ASPs can withstand attacks by powerful quantum computers that try to alter the reported state of the blockchain, providing a robust, portable source of truth about on-chain data.&lt;/p&gt;\n\n&lt;p&gt;From trustless bridges that move assets across blockchains to decentralized oracles that export valuable on-chain data, people will be able to leverage Algorand’s fast, cheap, and reliable protocol in new ecosystems without trust in an intermediary–they only need to trust the security of the underlying blockchain itself.&lt;/p&gt;\n\n&lt;h1&gt;Interoperability Problem&lt;/h1&gt;\n\n&lt;p&gt;2021 was an exciting year for the blockchain industry, with a 1,200% growth¹ in the Total Value Locked (TVL) in global DeFi smart contracts, the rise of NFTs, and a diversification across many Layer-1 chains. The promise of a thriving, decentralized blockchain ecosystem is nearly here — yet, most dApps are constrained by the very platform they are built upon.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Blockchain communities are looking for reliable ways to use their favorite dApps without paying expensive gas fees, dealing with network outages, or trusting intermediaries with their valued assets.&lt;/li&gt;\n&lt;li&gt;Developers want to build on fast and inexpensive blockchains like Algorand, and want immediate access to an expanded user base and liquidity scattered across several ecosystems.&lt;/li&gt;\n&lt;li&gt;Investors seek exciting opportunities on multiple platforms without switching chains or turning to more centralized alternatives.&lt;/li&gt;\n&lt;li&gt;People want to send basic transactions across blockchains in a trustless manner.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Developers, creators, and investors are looking for interoperability solutions that break them out of their walled gardens. ASPs remove these boundaries and open the doors to cross-chain applications and liquidity.&lt;/p&gt;\n\n&lt;h1&gt;Bridging Solution&lt;/h1&gt;\n\n&lt;p&gt;To solve these interoperability problems, many companies have built bridges that move assets across blockchains. These “bridged” assets can be freely used in the target chain’s ecosystem: lent out as collateral for a loan, traded for another asset, or simply held in a wallet.&lt;/p&gt;\n\n&lt;p&gt;While bridges show promise, most solutions require people to trust the bridge operator or a set of delegates to store and move their assets in a secure, timely manner. With over $32 billion worth of assets already held in cross-chain bridges (up from $670 million at the start of 2021)², the industry has created a new, centralized attack surface with a large target.&lt;/p&gt;\n\n&lt;p&gt;We have an opportunity to eliminate trust from the interoperability equation, creating a new breed of trustless bridges and cross-chain applications that don’t compromise on cost, reliability, or security.&lt;/p&gt;\n\n&lt;h1&gt;Algorand State Proofs&lt;/h1&gt;\n\n&lt;p&gt;Introducing Algorand State Proofs: new blockchain infrastructure that connects Algorand to the broader world. ASPs are an &lt;a href=\"https://people.csail.mit.edu/nickolai/papers/micali-compactcert-eprint.pdf\"&gt;immutable chain of proofs&lt;/a&gt; that attest to the state of the Algorand blockchain. They let anyone track Algorand transactions, balances, and application data in low-power environments like a phone, smartwatch, and even inside a blockchain smart contract, without compromising on security — each ASP is produced by the same decentralized network that reaches &lt;a href=\"https://www.algorand.com/technology/pure-proof-of-stake\"&gt;consensus&lt;/a&gt; on new blocks.&lt;/p&gt;\n\n&lt;p&gt;Due to their lightweight, portable nature, ASPs can be used to update Algorand light clients in other ecosystems. To lower costs in fee-constrained environments like Ethereum, Algorand will also produce even more compact zk-SNARK proofs that can be used to keep light clients up to date.&lt;/p&gt;\n\n&lt;p&gt;Applications like bridges, oracles, and wallets can query these light clients to cryptographically verify Algorand state in a simple, trustless manner. For example, say Alice wants to send Bob 10 AliceCoins from Algorand to Ethereum. AliceCoins are extremely valuable, so they want to make sure the tokens arrive quickly, safely, and without permission from or trust in an intermediary. Alice can send these tokens directly to Bob’s Ethereum wallet via a trustless bridge whose code-base is open to the public.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/99totm7qa7l81.png?width=1400&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=00cdb402e5b39e1072c564816ad169fa54b9e575\"&gt;https://preview.redd.it/99totm7qa7l81.png?width=1400&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=00cdb402e5b39e1072c564816ad169fa54b9e575&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Behind the scenes, Alice would “lock” the tokens in the trustless bridge’s &lt;a href=\"https://www.algorand.com/smart-contracts-defi\"&gt;Algorand smart contract&lt;/a&gt;, which prevents her from creating duplicate tokens out of thin air. The bridge’s Ethereum smart contract would simply ask the Algorand light client (kept up-to-date by State Proofs) if Alice did, in fact, lock the tokens. Once verified, the bridge would mint and release an equivalent amount on Ethereum to Bob’s chosen wallet.&lt;/p&gt;\n\n&lt;p&gt;Similarly, the bridge can trustlessly mint and release bridged Ethereum assets into the Algorand ecosystem using Ethereum light clients. Bridge operators can create Algorand smart contracts that ask these light clients to validate Ethereum transactions (e.g. depositing ETH in an Ethereum smart contract) via Algorand’s &lt;a href=\"https://medium.com/algorand/hello-contract-calling-abff8fc00939\"&gt;Contract to Contract calls&lt;/a&gt;. These light client pairs complete the import/export flow for bi-directional bridging.&lt;/p&gt;\n\n&lt;h1&gt;The Big Picture&lt;/h1&gt;\n\n&lt;p&gt;Algorand State Proofs fortify cross-chain applications with Post-Quantum security. By using advanced cryptography, ASPs can withstand attacks by powerful quantum computers that try to alter the reported state of the blockchain, providing a robust, portable source of truth about on-chain data.&lt;/p&gt;\n\n&lt;p&gt;From trustless bridges that move assets across blockchains to decentralized oracles that export valuable on-chain data, people will be able to leverage Algorand’s fast, cheap, and reliable protocol in new ecosystems without trust in an intermediary–they only need to trust the &lt;a href=\"https://www.algorand.com/technology/security\"&gt;security&lt;/a&gt; of the underlying blockchain itself.&lt;/p&gt;\n\n&lt;h1&gt;Roadmap&lt;/h1&gt;\n\n&lt;p&gt;Algorand State Proofs will be available soon, with our first milestone going live this month (March 2022). After next week’s consensus upgrade, the Algorand network will start registering the Post-Quantum secure voting keys used to generate ASPs.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;link: &lt;a href=\"https://medium.com/algorand/algorand-state-proofs-707d64038e35\"&gt;https://medium.com/algorand/algorand-state-proofs-707d64038e35&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 338,
  "permalink": "/r/CryptoCurrency/comments/t5wcvx/algorand_state_proofs_are_here_this_is_huge/",
  "subreddit": "CryptoCurrency",
  "id": "t5wcvx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Blockchain ecosystems are like cities: each one provides value that draws people\nto visit — ranging from business opportunities, community, entertainment,\ninfrastructure, local governance, to plain personal preference. As the industry\nmatures, people will have more reasons to visit different…"
}