{
  "author": "godstriker8",
  "original_created_utc": 1636655820,
  "title": "True Unpopular Opinion: I don't want people to earn crypto from Reddit karma",
  "created_utc": 1636662660,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In case you haven&#39;t heard, Reddit is planning to expand the vault system to provide crypto for upvotes similar to how moons work in this sub.</p>\n\n<p>I am very opposed to this, as moons have irrevocably damaged this sub by reducing it to constant reposts and diminishing contrarian opinions due to people wanting to earn free money.</p>\n\n<p>I do not want the rest of reddit to fall victim to the same thing (at least to an even greater extent as people still do reposts just for meaningless karma).</p>\n\n<p>But I realize that if crypto was integrated into Reddit that it would be a very bullish for the space.</p>\n\n<p>What do you all think about this?</p>\n</div><!-- SC_ON -->",
  "score": 566,
  "permalink": "/r/CryptoCurrency/comments/qrrt7f/true_unpopular_opinion_i_dont_want_people_to_earn/",
  "subreddit": "CryptoCurrency",
  "id": "qrrt7f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In case you haven't heard, Reddit is planning to expand the vault system to\nprovide crypto for upvotes similar to how moons work in this sub.\n\nI am very opposed to this, as moons have irrevocably damaged this sub by\nreducing it to constant reposts and diminishing contrarian opinions due to\npeople…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "聞いていないかもしれませんが、RedditはVaultのシステムを拡張して\nこのサブでのムーンの仕組みと同じように、upvoteに暗号を提供することを計画しています。\n\n私はこれに非常に反対しています。\n絶え間ない再投稿と、反対意見の減少により、このサブに取り返しのつかないダメージを与えたからです。\n人々...",
      "title": "真の不人気な意見。Redditのカルマでクリプトを稼いでほしくない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你还没有听说，Reddit正计划扩大金库系统，以\n提供加密货币，以换取加注，类似于本子中的月球工作方式。\n\n我非常反对这样做，因为月球已经不可挽回地破坏了这个子网站\n因为月球已经不可挽回地破坏了这个子，因为它使这个子变成了不断的转贴，并减少了反面的意见，由于\n人...",
      "title": "真正的不受欢迎的意见。我不希望人们从Reddit的因果关系中赚取加密货币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你還沒有聽說，Reddit正計劃擴大金庫系統，以\n提供加密貨幣，以換取加註，類似於本子中的月球工作方式。\n\n我非常反對這樣做，因爲月球已經不可挽回地破壞了這個子網站\n因爲月球已經不可挽回地破壞了這個子，因爲它使這個子變成了不斷的轉貼，並減少了反面的意見，由於\n人...",
      "title": "真正的不受歡迎的意見。我不希望人們從Reddit的因果關係中賺取加密貨幣"
    }
  ]
}