{
  "author": "frstrtd_ndrd_dvlpr",
  "original_created_utc": 1641370904,
  "title": "Be honest. Which coin(s) did you buy just because it is being shilled here or twitter or anywhere else, without doing researching on it?",
  "created_utc": 1641389866,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Have you ever seen coins that are being or have been shilled nonstop? &lt;em&gt;Ehem&lt;/em&gt; ERG ALGO LRC&lt;/p&gt;\n\n&lt;p&gt;Everyone always say DO YOUR OWN RESEARCH, but we all know that there are times when we are too lazy to do this tedious part of investment and we&amp;#39;re like &lt;em&gt;ahh fuck it, what could possibly go wrong&lt;/em&gt; and just put in money.&lt;/p&gt;\n\n&lt;p&gt;So which projects or coins have you bought without doing prior research and just went in head first? Was it successful? Did it fail horribly? How were you convinced to buy it just because? Was it the sheer volume of the people shilling? Did you read something informative that enticed you to buy it?&lt;/p&gt;\n\n&lt;p&gt;Edit: ok that&amp;#39;s a lot of people&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 362,
  "permalink": "/r/CryptoCurrency/comments/rwhxvb/be_honest_which_coins_did_you_buy_just_because_it/",
  "subreddit": "CryptoCurrency",
  "id": "rwhxvb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Have you ever seen coins that are being or have been shilled nonstop? Ehem ERG\nALGO LRC\n\nEveryone always say DO YOUR OWN RESEARCH, but we all know that there are times\nwhen we are too lazy to do this tedious part of investment and we're like ahh\nfuck it, what could possibly go wrong and just put in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ノンストップでシリングされている、あるいはされていたコインを見たことがありますか？Ehem ERG\nアルゴLRC\n\nいつも「自分で調べろ」と言われますが、「自分で調べろ」と言われることがあるのは\n投資という面倒なことをするのが億劫で、「あ～あ」となってしまう。\nもういいや、何が悪いんだろうと思って、そのまま入れてしまうと......。",
      "title": "素直になること。あなたはどのコインを、調べもせずに、ここでもツイッターでもどこでも、ただ評判が良いからというだけで買いましたか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你见过正在或已经被不停地推销的钱币吗？Ehem ERG\nALGO LRC\n\n大家总是说要自己研究，但我们都知道，有些时候\n当我们懒得去做这个繁琐的投资部分时，我们就会想，啊？\n去它的，有什么可能出错，就把...",
      "title": "要诚实。你买了哪种硬币，只是因为它在这里或twitter或其他地方被兜售，而没有对它进行研究？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你見過正在或已經被不停地推銷的錢幣嗎？Ehem ERG\nALGO LRC\n\n大家總是說要自己研究，但我們都知道，有些時候\n當我們懶得去做這個繁瑣的投資部分時，我們就會想，啊？\n去它的，有什麼可能出錯，就把...",
      "title": "要誠實。你買了哪種硬幣，只是因爲它在這裏或twitter或其他地方被兜售，而沒有對它進行研究？"
    }
  ]
}