{
  "author": "drinkerx",
  "original_created_utc": 1629867641,
  "title": "An Enhanced DCA Strategy I Hope You Will Like (With pictures!)",
  "created_utc": 1629901860,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><em>Pre-post edit:  This took me longer than I thought it would to type.  I drank two more whiskey drinks than I thought it would take.  I&#39;m sorry for the typos, but take it easy on me, please. /edit</em></p>\n\n<p>&#x200B;</p>\n\n<p>This is my first in depth post, so take it easy on me. I am by no means a seasoned trader but I listen to what <a href=\"/r/cc\">r/cc</a> has to say and I&#39;ve adapted the traditional &quot;DCA &amp; HODL&quot; strategy to what I would consider an enhanced, non-traditional Dollar Cost Averaging Strategy.</p>\n\n<p>I&#39;m not gonna pull a fucking recipes.com life story here, so if you don&#39;t mind let&#39;s get to the brass tacks. </p>\n\n<p>&#x200B;</p>\n\n<h1>TL:DR or &#39;My brief summary&#39;</h1>\n\n<p><strong>I believe there is a more efficient way to &#39;dollar cost average&#39; than the traditional way which involves buying when the</strong> <strong><em>90 Day Simple Moving Average</em></strong> <strong>is trending downwards (less than the day before).  /tl:dr</strong></p>\n\n<p>Traditional Dollar Cost Averaging (DCA) involves buying an asset class at set intervals (Daily, Weekly, Monthly, etc.) to remove the anxiety/hesitation of buying when market swings make it seem it would be disadvantageous to buy <em>(e.g.  I buy $50 bitcoin every week on the same day at the same time no matter the price).</em></p>\n\n<p>I have analyzed various versions of DCAing and the <strong>MOST PROFITABLE</strong> strategy is to make buys of your asset class when the 90 Day Simple Moving Average is decreasing.</p>\n\n<p>Why 90 Days?  Compared against 50, 100 and 200 Day Simple Moving Averages; 90 was a sweet spot that allowed for the highest Return on Investment (ROI) than 50, 100 and 200D MAs.</p>\n\n<p>&#x200B;</p>\n\n<h1>I PROMISED PICTURES</h1>\n\n<p><strong><em>Simple DCA Strategy - &#39;$10 DCA Every Day&#39;</em></strong></p>\n\n<p>The first strategy I looked at was a simple DCA strategy.  What if I invest $10 everyday in Bitcoin from December 16, 2017?  The closing price for BTC on that date was then at an all time high (ATH), $19,166.98.  I ran this simple investment strategy in which I bought $10 of BTC everyday until August 22, 2021.  What I found out was this:</p>\n\n<ul>\n<li>Invested - $13,450</li>\n<li>BTC accumulated - 1.55235798 </li>\n<li>Portfolio value <em>(August 22, 2021) - $78,015.94</em></li>\n<li>Dollar Return on Investment (ROI) - $64,565.94</li>\n<li>% ROI - 480%</li>\n<li>Cash on Hand - $0</li>\n</ul>\n\n<p>If you&#39;ve read this far, thank you, all my data is pulled from historical closing prices on CoinDesk.</p>\n\n<p><a href=\"https://preview.redd.it/820ncqymyej71.png?width=847&amp;format=png&amp;auto=webp&amp;s=2e93638d15827699e10a6a83d23661cc5b0c1bce\">BTC Accumulated and Amount Invested (December 16, 2017 through August 22, 2021)</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/fj1ohncwyej71.png?width=1035&amp;format=png&amp;auto=webp&amp;s=b47402a0c0812a980f4582357c9e9db72160c02f\">Portfolio Value / Dollar and Percent ROI (December 16, 2017 through August 22, 2021)</a></p>\n\n<p>This simple DCA strategy is why it is so popular.</p>\n\n<p>It WORKS!</p>\n\n<p>But it is not the best strategy according to the &#39;research&#39; I&#39;ve been doing.</p>\n\n<p>&#x200B;</p>\n\n<h1>Simple 90 Day Simple Moving Average - &#39;Closing Price (BTC) Less than 90 Day Moving Average&#39;</h1>\n\n<p>Below is a simple graphical representation of the strategy I am about to describe. It may be antithetical to the traditional DCA strategy to find a reason not to buy, almost heretical, but stay with me here while I take you through the alternate strategies I explored when comparing DCA strategies (DYOR right?)</p>\n\n<p><a href=\"https://preview.redd.it/9uodafc7xej71.png?width=3300&amp;format=png&amp;auto=webp&amp;s=9155138f0d23771399c90db26978989d29920ac4\">Closing Price versus 90 Day Simple Moving Average</a></p>\n\n<p>The idea illustrated above is to DCA when the graph is in the green, meaning the 90 day moving average (orange line) is more than the daily closing price (blue line).  I know the line color is hard to see, but the 90 day moving average is the smooth line that divides green and red.  The blue line is the squiggly line that bisects the orange line and outlines the outer portions of the green and red areas.</p>\n\n<p>In this DCA strategy, we buy $10 of BTC every day our closing price is less than the 90D MA (green areas).  In the red areas, we suspend our DCA buys and accumulate those $10 daily contributions for future DCA buys.</p>\n\n<p>What I found out was this:</p>\n\n<ul>\n<li>Invested - $6300</li>\n<li>BTC Accumulated - 0.88087648</li>\n<li>Portfolio value <em>(August 22, 2021) - $44,269.69</em></li>\n<li>Dollar Return on Investment (ROI) - $37,969.69</li>\n<li>% ROI - 603%</li>\n<li>Cash on Hand - $7150 <em>(available for future DCA buys)</em></li>\n</ul>\n\n<p>Compared to the simple strategy this strategy is undeniably better.  The ROI percentage is 1.25X better than the simple strategy of $10 every day.  Meaning if you invested $100,000 every year (I know, I know), you would make an extra $25,000 by DCAing only when the closing price is below the 90 day simple moving average.</p>\n\n<h1>Opposed to...  (&#39;Closing Price MORE than 90 Day Moving Average&#39;)</h1>\n\n<p>I will not spend much time on this strategy because it&#39;s the oh so popular, &quot;BUY HIGH&quot; strategy.  Humor me though. If we were to buy $10 BTC on days the closing price of BTC was more that the 90D SMA; and on days that the closing price was less we saved the $10 for future contributions, this is what it would look like:</p>\n\n<ul>\n<li>Invested - $7150</li>\n<li>BTC Accumulated - 0.67148150</li>\n<li>Portfolio value <em>(August 22, 2021) - $33,746.25</em></li>\n<li>Dollar Return on Investment (ROI) - $26,596.25</li>\n<li>% ROI - 372%</li>\n<li>Cash on Hand - $6300 <em>(available for future DCA buys)</em></li>\n</ul>\n\n<p><strong><em>The moral of the story here?  If you DCA, in even the worst possible way, you&#39;ll still look like a genius to your friends.</em></strong></p>\n\n<p>&#x200B;</p>\n\n<h1>MY STRATEGY...FINALLY (AND I&#39;M SURE I DIDN&#39;T INVENT IT), THE ENHANCED DCA STRATEGY WITH BUYS WHEN THE %TREND OF THE 90D SMA IS DECREASING</h1>\n\n<p>I know this is a long way to read to get to my point, but it is worth it...I promise (slightly).  Take a look at the chart below.</p>\n\n<p><a href=\"https://preview.redd.it/vr9w2twtdfj71.png?width=3300&amp;format=png&amp;auto=webp&amp;s=59a315e1d77444942eacbe60b168bc4ff0b93f25\">&#37;Trend 90D SMA with Daily Closing Price and 90D SMA</a></p>\n\n<p>This is very similar to the previous chart.  Notices the Red/Green areas are now tied to what I call the <em>&#39;%Trend 90Day Simple Moving Average&#39;</em>. This is a simple calculation that compares the current 90D SMA to the previous day&#39;s 90D SMA.  If the 90D SMA today is $36,000 and yesterday&#39;s was $36,605, the &#39;%Trend&#39; would be a .0001% decrease in 90D SMA.  In the situation the %trend decreases (red areas) I would purchase $10 worth of BTC.   If the %Trend were to increase (green areas) I would save $10 for future purchases.</p>\n\n<p>What I found out was this:</p>\n\n<ul>\n<li>Invested - $6220</li>\n<li>BTC Accumulated - 0.88559445</li>\n<li>Portfolio value <em>(August 22, 2021) - $44,506.80</em></li>\n<li>Dollar Return on Investment (ROI) - $38,286.80</li>\n<li>% ROI - 616%</li>\n<li>Cash on Hand - $7230 <em>(available for future DCA buys)</em></li>\n</ul>\n\n<p>On the surface this seems like it would be almost the same as just buying when the closing price is less than the 90D SMA, with an %ROI of 616% versus 603%.  I must admit, this seems like a point where the difference doesn&#39;t seem to matter.  But one strategy is better, statistically.  When we are talking about $300 DCA every month with $10 daily contributions, one is barely better than the other, but it is better.  That is were the wealthy make their money, because that 13% is the difference of $130,000,000 on a $1 Billion dollar investment.  I guarantee the super rich care, which is why it should matter to you (you know...since they are the great manipulators).</p>\n\n<p>&#x200B;</p>\n\n<h1>IT&#39;S NOT ALWAYS ABOUT THE HIGHS</h1>\n\n<p><em>We&#39;re almost to the end.</em> I promise.      So why does this 13% matter?  If you have ever shot a rifle over a long distance, you have experienced the fact that the further the bullet flies from you, the more aiming matters.  If you are a foot away, just point and shoot.  If your target is a mile a way, a chill on your neck moving your aim the width of a hair will throw your shot down range off by METERS!</p>\n\n<p>We are still coming out of the red area in my strategy, and my strategy is as close to the &#39;source of the shot&#39; as you can get.  This strategy will set you up for a better ROI when we are on top again.  Look at the chart below for example.  This is the &quot;crash&quot; on December 15, 2018 when the closing price was $3194.96 (I know...I&#39;m kicking myself in the ass too).  </p>\n\n<p><a href=\"https://preview.redd.it/3uneuy94hfj71.png?width=662&amp;format=png&amp;auto=webp&amp;s=98576df8eab915d76f247cfb59222809b1ae1671\">Still not much, but it&#39;s honest work</a></p>\n\n<p>My strategy out-performed the next best strategy (when you DCA on closing price being higher than the 90D SMA) by 1.28%.  It out performed the <em>Simple DCA Strategy</em> by 4.63%.  That matters when you are talking about serious moolah.  Where does my strategy take you when we hit our most recent ATH?  We closed at $63,346.79 on April 15, 2021 (source: CoinDesk).</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/jupuota6jfj71.png?width=663&amp;format=png&amp;auto=webp&amp;s=d9b50a4c3a1aba7938194fd0193b0ca0c5b26376\">Around the time I FOMO&#39;d after Swing Trading</a></p>\n\n<p>This is where my strategy matters and is at its most effective.  Far away from where we shot the DCA bullet.  Contributing on the negative %Trend is a difference of 39%. </p>\n\n<p><strong><em>Compared to the Simple DCA Strategy it is 235% more effective!</em></strong></p>\n\n<p>&#x200B;</p>\n\n<h1>CONCLUSION...FINALLY</h1>\n\n<p>First off, thank you for reading this, and if you like my post, I&#39;m glad I could contribute positively to the sub that got me going down this rabbit hole.  It&#39;s pretty easy to see that DCAing when the price is down is a good idea.  I&#39;ve given two great ways to DCA opposed to a Simple DCA Strategy.</p>\n\n<p>I suggest DCA only when the %Trend on the 90D SMA is declining, simply because the down-stream rewards are statistically better.</p>\n\n<p><a href=\"https://preview.redd.it/udyqm37qlfj71.png?width=847&amp;format=png&amp;auto=webp&amp;s=54e4506bc16745692960ee2f6d180755e2136f44\">This one again</a></p>\n\n<p><a href=\"https://preview.redd.it/xbf5fc1slfj71.png?width=1035&amp;format=png&amp;auto=webp&amp;s=0670952f559e9673c70d86437e3e6c469c0dd3c3\">and this one</a></p>\n\n<h1>DCA and HODL!!! Purists</h1>\n\n<p>I love y&#39;all, I really do.  But...if we follow the $10 everyday ($300/month) strategy I end up with what seems like a whopping chunk of change.</p>\n\n<p>$64K+ profit vs $38K profit versus my dumb strategy.  The dollar ROI looks good, but the only one that matters is %ROI.  If I took the exact same $13,450 invested into the simple DCA strategy and put it into my strategy, I would have a $ROI of $82,852.00 -or- $18,286.06 <strong>MORE</strong> than the simple DCA strategy in about 3.5 years with a monthly DCA of $300. </p>\n\n<p>And not to kick you while you are down, I would also have $7230 in cash saved up for the next opportunity, let&#39;s say if ETH becomes a clear cut favorite ;), versus the $0 I would have in cash with a simple DCA.</p>\n\n<p>So all I ask is this;  If you think $25K is worth it on $300 a month in 3.5 years, give this a shot.  If not, no skin off my back, just wanted to share with a community that has taught me so much.</p>\n\n<p>&#x200B;</p>\n\n<h1>post-script</h1>\n\n<p>I welcome all feedback, but this took me a few hours to compose so like Forrest famously said &quot;I think I&#39;ll go home now&quot;.</p>\n\n<p>I look forward to hearing what your strategies are and what you think of mine.</p>\n\n<p>Y&#39;all have a good night...and here&#39;s to 100K, cheers!</p>\n</div><!-- SC_ON -->",
  "score": 241,
  "permalink": "/r/CryptoCurrency/comments/pb4ebd/an_enhanced_dca_strategy_i_hope_you_will_like/",
  "subreddit": "CryptoCurrency",
  "id": "pb4ebd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Pre-post edit: This took me longer than I thought it would to type. I drank two\nmore whiskey drinks than I thought it would take. I'm sorry for the typos, but\ntake it easy on me, please. /edit\n\n\n\nThis is my first in depth post, so take it easy on me. I am by no means a\nseasoned trader but I listen…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "投稿前の編集：この文章を書くのに思ったより時間がかかりました。私は2杯のウイスキーを飲みました。\nウイスキーを2杯も飲んでしまいました。誤字脱字が多くてすみませんが\nお手柔らかにお願いします。/編集\n\n\n\nこれは私の初めての詳細な投稿なので、気楽に考えてください。私は決して経験豊富なトレーダーではありません。\n私は決して熟練したトレーダーではありませんが、私が聞くのは...",
      "title": "強化されたDCA戦略について（写真あり"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "帖前编辑：这比我想象的要花更多时间来打字。我喝了两杯\n比我想象的要多喝了两杯威士忌。我很抱歉有错别字，但\n请对我宽容一点。/编辑\n\n\n\n这是我的第一篇有深度的文章，所以请对我放松。我决不是一个\n经验丰富的交易员，但我听...",
      "title": "我希望你会喜欢的增强型DCA策略（附图）。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "帖前編輯：這比我想象的要花更多時間來打字。我喝了兩杯\n比我想象的要多喝了兩杯威士忌。我很抱歉有錯別字，但\n請對我寬容一點。/編輯\n\n\n\n這是我的第一篇有深度的文章，所以請對我放鬆。我決不是一個\n經驗豐富的交易員，但我聽...",
      "title": "我希望你會喜歡的增強型DCA策略（附圖）。"
    }
  ]
}