{
  "author": "2012Jesusdies",
  "original_created_utc": 1651072297,
  "title": "Holy Roman Empire is often made fun of for being essentially a formality with states inside having virtual independence. But France was also very decentralized in 1400s that its own vassal was their rival. How much of a difference was there?",
  "created_utc": 1651080361,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Duchy of Burgundy, a vassal of France was essentially a rival state of France (from what I understand) from middle of 14th to middle of 15th century with the Duke of Burgundy occassionally being the real power behind the French throne. French vassals in general were also very independent minded where the King exercised very little power till France&amp;#39;s centralization during like Louis XIV&amp;#39;s days.&lt;/p&gt;\n\n&lt;p&gt;Was this really all that far from the limited hold the Holy Roman Emperor had on, for example, Bavaria or Hamburg?&lt;/p&gt;\n\n&lt;p&gt;It could also be interesting to touch on other monarchies that were quite decentralized as well like Spain.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 164,
  "permalink": "/r/AskHistorians/comments/ud5udl/holy_roman_empire_is_often_made_fun_of_for_being/",
  "subreddit": "AskHistorians",
  "id": "ud5udl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Duchy of Burgundy, a vassal of France was essentially a rival state of France\n(from what I understand) from middle of 14th to middle of 15th century with the\nDuke of Burgundy occassionally being the real power behind the French throne.\nFrench vassals in general were also very independent minded…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "フランスの臣下であるブルゴーニュ公国は、実質的にフランスのライバル国家であった\n(14世紀中頃から15世紀中頃にかけて、ブルゴーニュ公国はフランスのライバル国であった。\nブルゴーニュ公爵がフランスの実権を握っていたこともあったようです。\nフランスの臣下は一般に独立心が旺盛であった...。",
      "title": "神聖ローマ帝国は、内部の国家が事実上独立しており、本質的に形式的なものであるとよく揶揄される。しかし、1400年代のフランスも、自国の家臣がライバルとなるような、非常に分権的な国だったのです。どれほどの違いがあったのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "勃艮第公国是法国的附庸，基本上是法国的一个敌对国家。\n(据我所知）从14世纪中叶到15世纪中叶，勃艮第公爵有时是法国王室背后的真正力量。\n勃艮第公爵有时会成为法国王位背后的真正力量。\n一般来说，法国的附庸也是非常有独立意识的......",
      "title": "神圣罗马帝国经常被取笑为基本上是一种形式，里面的国家实际上是独立的。但法国在14世纪也是非常分散的，它自己的附庸是他们的对手。这其中的差别有多大？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "勃艮第公國是法國的附庸，基本上是法國的一個敵對國家。\n(據我所知）從14世紀中葉到15世紀中葉，勃艮第公爵有時是法國王室背後的真正力量。\n勃艮第公爵有時會成爲法國王位背後的真正力量。\n一般來說，法國的附庸也是非常有獨立意識的......",
      "title": "神聖羅馬帝國經常被取笑爲基本上是一種形式，裏面的國家實際上是獨立的。但法國在14世紀也是非常分散的，它自己的附庸是他們的對手。這其中的差別有多大？"
    }
  ]
}