{
  "author": "14silicium",
  "original_created_utc": 1652722707,
  "title": "why does a bigger brain not equal more intelligence?",
  "created_utc": 1652763355,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I understand that the size of a cell is almost constant regardless of what animal it makes up.  A whale brain for instance weighs more than a human brain hence it must have more neurons, if it can make more neural connections, why isn&amp;#39;t it smarter, I would expect intelligence to be somewhat proportional to the number of neurons. If this is not the case, why would evolution not  just have made a wale have a human like brain? to the whale, the energy required to run a human brain would be insignificant&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/askscience/comments/ur1ha8/why_does_a_bigger_brain_not_equal_more/",
  "subreddit": "askscience",
  "id": "ur1ha8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I understand that the size of a cell is almost constant regardless of what\nanimal it makes up. A whale brain for instance weighs more than a human brain\nhence it must have more neurons, if it can make more neural connections, why\nisn't it smarter, I would expect intelligence to be somewhat…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "細胞の大きさは、どんな動物でもほぼ一定なんですね。\n細胞の大きさは、どんな動物でもほぼ一定なんですね。例えば、鯨の脳は人間の脳よりも重く、より多くの神経細胞を持っているはずです。\nより多くの神経接続ができるのであれば、なぜより賢くならないのでしょうか。\nより多くの神経接続を作ることができるのなら、なぜより賢くならないのでしょうか。私は、知能は多少なりとも...",
      "title": "なぜ脳が大きいと知能が高くならないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我了解到，一个细胞的大小几乎是恒定的，不管是什么\n动物都是如此。例如，鲸鱼的大脑比人类的大脑更重\n因此它一定有更多的神经元，如果它能建立更多的神经连接，为什么它不更聪明呢？\n它不是更聪明吗？我希望智力在某种程度上是...",
      "title": "为什么大脑越大不等于智力越高？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我瞭解到，一個細胞的大小几乎是恆定的，不管是什麼\n動物都是如此。例如，鯨魚的大腦比人類的大腦更重\n因此它一定有更多的神經元，如果它能建立更多的神經連接，爲什麼它不更聰明呢？\n它不是更聰明嗎？我希望智力在某種程度上是...",
      "title": "爲什麼大腦越大不等於智力越高？"
    }
  ]
}