{
  "author": "wiggyfig",
  "original_created_utc": 1636563670,
  "title": "Would you guys be bothered by this or am being too much?",
  "created_utc": 1636598772,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Every morning my bf has to go downstairs and stay with his mom in her room for three hours while she gets ready for work. If he doesn’t go down, she will come up bang on the door yelling and wake everyone up. I haven’t spent the morning with him in idk how long. Even on our anniversary I thought at least I won’t wake up alone today and he will be next to me….nope even on that day he spent all morning with her. He will make her coffee and sit on her bed and just talk and laugh while she gets ready. Im so bothered by this. What do u guys think?</p>\n</div><!-- SC_ON -->",
  "score": 108,
  "permalink": "/r/TooAfraidToAsk/comments/qqyw5a/would_you_guys_be_bothered_by_this_or_am_being/",
  "subreddit": "TooAfraidToAsk",
  "id": "qqyw5a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Every morning my bf has to go downstairs and stay with his mom in her room for\nthree hours while she gets ready for work. If he doesn’t go down, she will come\nup bang on the door yelling and wake everyone up. I haven’t spent the morning\nwith him in idk how long. Even on our anniversary I thought at…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "毎朝、彼は階下に降りて、母親が仕事の準備をしている間、母親の部屋に3時間滞在しなければなりません。\nお母さんが仕事に行く準備をしている間、3時間一緒にいなければなりません。彼が下に行かないと、お母さんがやってきて\nドアを叩いてみんなを起こしてしまいます。彼と一緒に朝の時間を過ごしたのは\n何年ぶりだろうか。結婚記念日でさえ、私は...",
      "title": "皆さんはこれを気にするでしょうか、それともやりすぎでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "每天早上，我的男朋友都要下楼和他妈妈一起在她的房间里呆上三天。\n三个小时，而他妈妈要准备上班。如果他不下去，他妈妈就会来。\n她就会上来敲门大叫，把大家都吵醒。我已经很久没有和他一起度过一个上午了\n和他在一起，不知道有多久了。即使在我们的结婚纪念日，我也认为在...",
      "title": "你们会对此感到困扰吗，还是我太过分了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "每天早上，我的男朋友都要下樓和他媽媽一起在她的房間裏呆上三天。\n三個小時，而他媽媽要準備上班。如果他不下去，他媽媽就會來。\n她就會上來敲門大叫，把大家都吵醒。我已經很久沒有和他一起度過一個上午了\n和他在一起，不知道有多久了。即使在我們的結婚紀念日，我也認爲在...",
      "title": "你們會對此感到困擾嗎，還是我太過分了？"
    }
  ]
}