{
  "author": "lo979797",
  "original_created_utc": 1642116512,
  "title": "So if my daughter keeps getting bullied at school, why can’t I just tell her to beat the shit out of the other kids?",
  "created_utc": 1642136953,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;She’s literally the nicest, happiest girl I’ve ever seen, and both her teachers agree. She’s a little shorter since we did early-entrance Kindergarten (she’s in the 1st grade now)&lt;/p&gt;\n\n&lt;p&gt;Kids shove her, hit her, one pushed her into the snow and hit her in the stomach repeatedly the other day. What the hell? I feel like it isn’t going to stop unless she fights back, but that’s totally not how we’ve raised her, and I’m sure she’d get in trouble from the school.&lt;/p&gt;\n\n&lt;p&gt;What am I supposed to do?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 113,
  "permalink": "/r/TooAfraidToAsk/comments/s3cw7w/so_if_my_daughter_keeps_getting_bullied_at_school/",
  "subreddit": "TooAfraidToAsk",
  "id": "s3cw7w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "She’s literally the nicest, happiest girl I’ve ever seen, and both her teachers\nagree. She’s a little shorter since we did early-entrance Kindergarten (she’s in\nthe 1st grade now)\n\nKids shove her, hit her, one pushed her into the snow and hit her in the stomach\nrepeatedly the other day. What the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "彼女は文字通り、私が今まで見た中で最も優しくて幸せな女の子です。\nと言っています。幼稚園の入園が早かったので、身長が少し低くなっています。\n現在1年生）\n\n子供たちは彼女を突き飛ばし、殴り、一人は彼女を雪の中に突き飛ばし、彼女の腹を殴った。\nこの間は何度も。なんなんだ・・・。",
      "title": "じゃあ、もし娘が学校でいじめられ続けても、他の子をボコボコにするように言ってはいけないの？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "她是我见过的最漂亮、最快乐的女孩，她的两位老师也同意这一点。\n都同意。由于我们上的是提前入园的幼儿园，所以她的个子矮了一些（她现在上的是一年级）。\n现在是一年级）。\n\n孩子们推搡她，打她，有一个人把她推到雪地里，打她的肚子。\n有一天，他们反复地打她。什么...",
      "title": "那么，如果我的女儿在学校一直被欺负，我为什么不能告诉她把其他孩子打得落花流水？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "她是我見過的最漂亮、最快樂的女孩，她的兩位老師也同意這一點。\n都同意。由於我們上的是提前入園的幼兒園，所以她的個子矮了一些（她現在上的是一年級）。\n現在是一年級）。\n\n孩子們推搡她，打她，有一個人把她推到雪地裏，打她的肚子。\n有一天，他們反覆地打她。什麼...",
      "title": "那麼，如果我的女兒在學校一直被欺負，我爲什麼不能告訴她把其他孩子打得落花流水？"
    }
  ]
}