{
  "author": "Profess0r0ak",
  "original_created_utc": 1626005153,
  "title": "Get a hardware wallet, stop putting it off. This is your reminder",
  "created_utc": 1626025245,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve been keeping my crypto on an exchange, reading posts like ‘not your keys not your crypto’ every day.</p>\n\n<p>I had it on my to do list for far too long, until I had a security scare and finally went for it.</p>\n\n<p>It took 30 minutes to set up, there was zero hassle and it was mega easy (even if you’re not confident with tech or crypto).</p>\n\n<p>Take it off of your to do list today. Stay safe.</p>\n</div><!-- SC_ON -->",
  "score": 155,
  "permalink": "/r/CryptoCurrency/comments/oi39lq/get_a_hardware_wallet_stop_putting_it_off_this_is/",
  "subreddit": "CryptoCurrency",
  "id": "oi39lq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’ve been keeping my crypto on an exchange, reading posts like ‘not your keys\nnot your crypto’ every day.\n\nI had it on my to do list for far too long, until I had a security scare and\nfinally went for it.\n\nIt took 30 minutes to set up, there was zero hassle and it was mega easy (even\nif you’re not…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は自分の暗号を取引所に保管しており、毎日「not your keys, not your crypto」のような投稿を読んでいる。\nnot your crypto」のような投稿を毎日のように読んでいます。\n\nあまりにも長い間、やるべきことリストに入れていたのですが、セキュリティ上の不安を感じて、ついに実行しました。\n遂に実行に移しました。\n\nセットアップするのに30分かかりましたが、面倒なことは一切なく、とても簡単でした。\nあなたがそうでなくても...）。",
      "title": "ハードウェアウォレットを手に入れよう！後回しにするのはやめよう これがあなたのリマインダー"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直把我的加密货币放在交易所里，每天都在看类似 \"不是你的钥匙\n而不是你的加密货币 \"的帖子。\n\n我把它列在我的工作清单上已经很久了，直到我遇到了一次安全恐慌，终于去做了。\n终于去做了。\n\n它花了30分钟来设置，没有任何麻烦，而且非常容易（即使你不是...\n如果你不是...",
      "title": "买个硬件钱包，别再拖了。这是对你的提醒"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直把我的加密貨幣放在交易所裏，每天都在看類似 \"不是你的鑰匙\n而不是你的加密貨幣 \"的帖子。\n\n我把它列在我的工作清單上已經很久了，直到我遇到了一次安全恐慌，終於去做了。\n終於去做了。\n\n它花了30分鐘來設置，沒有任何麻煩，而且非常容易（即使你不是...\n如果你不是...",
      "title": "買個硬件錢包，別再拖了。這是對你的提醒"
    }
  ]
}