{
  "author": "memories_torn_apart",
  "the_new_excerpt": "I’ve always wondered this, whenever I consider the fact that most of the\ncolonizers had probably never left their country, which though they can get warm\nprobably not that warm (especially during the Little Ice Age), and then suddenly\nthey land in moist, jungly, and scorching terrain—how difficult…",
  "original_created_utc": 1613697413,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我一直在想，每当我考虑到大部分的\n殖民者可能从来没有离开过他们的国家，这虽然他们可以得到温暖的\n乍暖还寒\n他们降落在潮湿，丛林， 和炎热的地形 - 如何困难... ...",
      "title": "欧洲人，特别是北方人，是如何应对在温暖的热带地区定居和殖民的？例如，一个17岁的荷兰人是如何应对印度尼西亚的强烈不同气候的，还是他们只是不断地出汗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直在想，每當我考慮到大部分的\n殖民者可能從來沒有離開過他們的國家，這雖然他們可以得到溫暖的\n乍暖還寒\n他們降落在潮溼，叢林， 和炎熱的地形 - 如何困難... ...",
      "title": "歐洲人，特別是北方人，是如何應對在溫暖的熱帶地區定居和殖民的？例如，一個17歲的荷蘭人是如何應對印度尼西亞的強烈不同氣候的，還是他們只是不斷地出汗？"
    }
  ],
  "title": "How did Europeans, especially Northern, deal with settling and colonizing warm, tropical places? For example, how did a 17th Dutchman cope with the intensely different climate of Indonesia, or did they just sweat constantly?",
  "created_utc": 1613714847,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve always wondered this, whenever I consider the fact that most of the colonizers had probably never left their country, which though they can get warm probably not <em>that</em> warm (especially during the Little Ice Age), and then suddenly they land in moist, jungly, and scorching terrain—how difficult was the adjustment, and what, if any, coping mechanisms were there? As someone, of European descent who lives in a continental climate, who sweats really easy, this is always my first thought. I can’t imagine any European colonizer, whether it be in Mexico, the Caribbean, Brazil, or wherever, as anything but just sweating themselves into a puddle all the time, and just how gross they must have been, especially with all the clothes and armor. Was it something they just ‘toughed’ out, or did they actually have some way of dealing with it?</p>\n\n<p>Sorry if this is a really broad question, but I can’t find a better way to put it. Thank you in advance!</p>\n</div><!-- SC_ON -->",
  "score": 110,
  "permalink": "/r/AskHistorians/comments/ln2ulw/how_did_europeans_especially_northern_deal_with/",
  "subreddit": "AskHistorians",
  "id": "ln2ulw",
  "is_self": true,
  "media": null,
  "is_video": false
}