{
  "author": "Buy_More_Bitcoin",
  "the_new_excerpt": "When you wake up, the probably a significant move which requires your attention\nis going to take place in the next the next hour or so is very low.\n\nStart your morning routine, do all the tits and bits you have to. Make some\ncoffee or tea. And only then, check what happened on the markets the past…",
  "original_created_utc": 1613553424,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "当你醒来的时候，可能是一个需要你注意的重大举措。\n是要在接下来的未来一个多小时内进行是非常低的。\n\n开始你的晨间程序，做所有你必须做的奶子和位子。做一些\n咖啡或茶。只有这样，检查发生了什么市场上的过去... ...",
      "title": "不要一醒来就检查你的投资组合，这不值得你放心。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當你醒來的時候，可能是一個需要你注意的重大舉措。\n是要在接下來的未來一個多小時內進行是非常低的。\n\n開始你的晨間程序，做所有你必須做的奶子和位子。做一些\n咖啡或茶。只有這樣，檢查發生了什麼市場上的過去... ...",
      "title": "不要一醒來就檢查你的投資組合，這不值得你放心。"
    }
  ],
  "title": "Don't check your portfolio the moment you wake up, it's not worth your peace of mind.",
  "created_utc": 1613565711,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>When you wake up, the probably a significant move which requires your attention is going to take place in the next the next hour or so is very low. </p>\n\n<p>Start your morning routine, do all the tits and bits you have to. Make some coffee or tea. And only then, check what happened on the markets the past couple of hours. \nIn any case, you&#39;re going to react less emotional than you would have had you checked your portfolio the moment you woke up. Ofcourse there is always a small chance you should have made a move an hour ago. But how many times would you have made bad-barely-half-awake decision? </p>\n\n<p>Peace of mind doesn&#39;t have a price tag.</p>\n\n<p><em>Thank you for coming to my ted talk</em></p>\n</div><!-- SC_ON -->",
  "score": 4758,
  "permalink": "/r/CryptoCurrency/comments/llqfv7/dont_check_your_portfolio_the_moment_you_wake_up/",
  "subreddit": "CryptoCurrency",
  "id": "llqfv7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728619148
}