{
  "author": "natius3",
  "original_created_utc": 1637441537,
  "title": "Historically, large parts of the American Midwest and Canadian Prairies were controlled by Indigenous, multi-nation confederacies, like the Council of Three Fires, the Great Sioux Nation and the Iron Confederacy. What do we know about their political organization?",
  "created_utc": 1637481405,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In High School, I learned that the Haudenosaunee/Iroquois Confederacy in New York had a constitution and system of representative democracy predating European colonization. I recently found out that further west there were other multi-ethnic political alliances and confederacies. For example, most of the  Lake Michigan area looks like it was controlled by the Anishinaabe <a href=\"https://elmoore.com/2014/10/15/the-voices-of-detroit-the-people-of-the-council-of-the-three-fires/\">Council of Three Fires</a>.  What do we know about the organization of these groups? Did members hold votes? Did membership provide nations with advantages beyond protection from shared enemies?</p>\n\n<p>Also, as far as I can tell the Great Sioux Nation and Council of Three Fires still exist as organizations in one form or another. I don&#39;t mean to imply they&#39;re gone, but I would guess that their function has changed over the past 300 years.  </p>\n\n<p>Thanks!</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/qyej1o/historically_large_parts_of_the_american_midwest/",
  "subreddit": "AskHistorians",
  "id": "qyej1o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In High School, I learned that the Haudenosaunee/Iroquois Confederacy in New\nYork had a constitution and system of representative democracy predating\nEuropean colonization. I recently found out that further west there were other\nmulti-ethnic political alliances and confederacies. For example, most…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "高校時代、ニューヨークのハウデノサウニー／イロコイ連合には、憲法と代表制があることを知りました。\nニューヨークのハウデノサウニー／イロコイ連合は、ヨーロッパの植民地化以前に憲法と代表制民主主義のシステムを持っていました。\nヨーロッパの植民地化に先立って 最近になって、もっと西にも多民族の政治同盟や連合体があったことを知りました。\n多民族の政治同盟や連合体があったことを知りました。例えば、ほとんどの...",
      "title": "歴史的に見ても、アメリカ中西部やカナダ大草原の大部分は、先住民族の複数の民族による連合体（Council of Three Fires、Great Sioux Nation、Iron Confederacyなど）によって支配されていました。彼らの政治的組織についてはどのようなことがわかっているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在高中时，我了解到纽约的豪德诺萨尼/易洛魁联盟有一个宪法和代议制民主制度。\n纽约有一部宪法和代议制民主制度，比欧洲殖民时期还要早。\n欧洲的殖民化。我最近发现，在更远的西部，还有其他的\n多民族的政治联盟和同盟。例如，大多数...",
      "title": "历史上，美国中西部和加拿大大草原的大部分地区被土著多民族联盟控制，如三火理事会、大苏国和铁器联盟。我们对他们的政治组织了解多少？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在高中時，我瞭解到紐約的豪德諾薩尼/易洛魁聯盟有一個憲法和代議制民主制度。\n紐約有一部憲法和代議制民主制度，比歐洲殖民時期還要早。\n歐洲的殖民化。我最近發現，在更遠的西部，還有其他的\n多民族的政治聯盟和同盟。例如，大多數...",
      "title": "歷史上，美國中西部和加拿大大草原的大部分地區被土著多民族聯盟控制，如三火理事會、大蘇國和鐵器聯盟。我們對他們的政治組織瞭解多少？"
    }
  ]
}