{
  "author": "KAX1107",
  "original_created_utc": 1634364939,
  "title": "Don't mind me. I'm just here to remind you that 3 weeks ago Jim Cramer begged you to sell",
  "created_utc": 1634380802,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Everyone in party mood but don&#39;t forget that Mad Money moron who somehow still has a job giving bad advice after bad advice about crypto for years.</p>\n\n<p>On September 20 he was trumping up Evergrande China FUD based on unproven speculation that Tether was holding Chinese commercial paper and begged everyone to sell.</p>\n\n<p>“I know the crypto-lovers never want to hear me say sell, but if you’ve got a big gain as I did, well, I’m begging you to. Don’t let it become a loss. Sell some, stay long the rest, then let’s wait and see if China changes its attitude toward an Evergrande bailout.”</p>\n\n<p>“The problem with tether is that it’s backed by various holdings and roughly half of those are commercial paper — short-term loans — and much of that is believed to be, but we don’t know, Chinese commercial paper.”</p>\n\n<p>How about STFU if you don&#39;t know instead of creating a dramatic story out of what you don&#39;t fucking know?</p>\n\n<p><span class=\"md-spoiler-text\">Quick update on that China FUD. Bitcoin still doesn&#39;t give a fuck about China. Better luck next time.</span></p>\n</div><!-- SC_ON -->",
  "score": 208,
  "permalink": "/r/CryptoCurrency/comments/q96anu/dont_mind_me_im_just_here_to_remind_you_that_3/",
  "subreddit": "CryptoCurrency",
  "id": "q96anu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Everyone in party mood but don't forget that Mad Money moron who somehow still\nhas a job giving bad advice after bad advice about crypto for years.\n\nOn September 20 he was trumping up Evergrande China FUD based on unproven\nspeculation that Tether was holding Chinese commercial paper and begged…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "みんなパーティー気分だけど、忘れちゃいけないのが、Mad Moneyのおバカさん。\n何年にもわたって暗号に関する悪いアドバイスに次ぐ悪いアドバイスをする仕事をしている。\n\n9月20日には、テザー社が中国のコマーシャルペーパーを保有しているという確証のない憶測に基づいて、Evergrande ChinaのFUDを捏造していた。\nテザー社が中国のコマーシャルペーパーを保有しているという確証のない憶測に基づいて、Evergrande ChinaのFUDを捏造して懇願した...",
      "title": "私のことは気にしないでください。3週間前、ジム・クレイマーがあなたに売るように懇願したことを思い出しに来ました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "每个人都有聚会的心情，但不要忘了那个疯狂的钱的白痴，他不知何故仍然\n多年来，他仍有一份工作，对加密货币提出一个又一个错误的建议。\n\n9月20日，他在未经证实的基础上捏造了恒大中国的恐惧症。\n推测Tether持有中国商业票据，并乞求...",
      "title": "不要介意我。我只是在这里提醒你，3周前吉姆-克莱默求你卖掉"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "每個人都有聚會的心情，但不要忘了那個瘋狂的錢的白癡，他不知何故仍然\n多年來，他仍有一份工作，對加密貨幣提出一個又一個錯誤的建議。\n\n9月20日，他在未經證實的基礎上捏造了恆大中國的恐懼症。\n推測Tether持有中國商業票據，並乞求...",
      "title": "不要介意我。我只是在這裏提醒你，3周前吉姆-克萊默求你賣掉"
    }
  ]
}