{
  "author": "Jethroe1",
  "original_created_utc": 1625664723,
  "title": "Bitcoin is a machine and the Apex Predator. You get several times to attack it for free, meaning the \"China Ban Bitcoin\"! meme works for awhile. Now it is over. Nobody gives a shit anymore what China says or posts. Same thing with the village idiot that owns a car company. Bitcoin spits you out.",
  "created_utc": 1625694081,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>What makes Bitcoin beautiful is it is relentless.  It just marches on no matter what you throw at it.  Every 2016 blocks it automatically adjusts itself to keep a 10 minute block time.  The game theory and incentive behind it&#39;s creation means it draws the most creative and innovative persons and technology to it&#39;s development.  It&#39;s decentralization allows it to give the finger to any country that bans it, and it&#39;s use of the Internet, which is the lifeblood of every advanced nation on earth, means that to kill it you have to destroy yourself in the process.  It makes HODLers of every person who buys it because it shakes people out, who then regret every day the sale they completed when it was so damn cheap.  It makes you feel like an idiot because you didn&#39;t get in earlier, and keeps kicking you in the ass for selling when you did.  </p>\n\n<p>Satoshi Nakamoto shoud be awarded the Nobel Prize.</p>\n</div><!-- SC_ON -->",
  "score": 164,
  "permalink": "/r/Bitcoin/comments/ofiycy/bitcoin_is_a_machine_and_the_apex_predator_you/",
  "subreddit": "Bitcoin",
  "id": "ofiycy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "What makes Bitcoin beautiful is it is relentless. It just marches on no matter\nwhat you throw at it. Every 2016 blocks it automatically adjusts itself to keep\na 10 minute block time. The game theory and incentive behind it's creation means\nit draws the most creative and innovative persons and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコインが美しいのは、それが容赦ないからです。何を投げつけられても、ひたすら前進する\n何をしても前進する。2016ブロックごとに、自動的に調整して\n10分間のブロックタイムを維持するように自動的に調整します。ビットコインが作られた背景には、ゲーム理論とインセンティブがあります。\n最も創造的で革新的な人たちを引き寄せることができます。",
      "title": "ビットコインは機械であり、Apex Predatorである。無料で何度も攻撃できるので、「中国がビットコインを禁止する」というミームがしばらくは機能するということです。今はもう終わりです。中国が何を言おうと、何を投稿しようと、もう誰も気にしない。自動車会社を経営している村のバカと同じだ。ビットコインはあなたを吐き出します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "比特币的美丽之处在于它是无情的。它只是在前进，无论\n你扔给它什么。每隔2016个区块，它就会自动调整自己，以保持\n10分钟的区块时间。它的创造背后的游戏理论和激励措施意味着\n它吸引了最有创造力和创新力的人和...",
      "title": "比特币是一台机器，是Apex掠夺者。你有好几次免费攻击它的机会，这意味着 \"中国禁止比特币\"！这种说法在一段时间内是有效的。现在它已经结束了。没有人再在乎中国说什么或发什么。拥有汽车公司的乡村白痴也是如此。比特币把你吐出来了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "比特幣的美麗之處在於它是無情的。它只是在前進，無論\n你扔給它什麼。每隔2016個區塊，它就會自動調整自己，以保持\n10分鐘的區塊時間。它的創造背後的遊戲理論和激勵措施意味着\n它吸引了最有創造力和創新力的人和...",
      "title": "比特幣是一臺機器，是Apex掠奪者。你有好幾次免費攻擊它的機會，這意味着 \"中國禁止比特幣\"！這種說法在一段時間內是有效的。現在它已經結束了。沒有人再在乎中國說什麼或發什麼。擁有汽車公司的鄉村白癡也是如此。比特幣把你吐出來了。"
    }
  ]
}