{
  "author": "MasterCookSwag",
  "the_new_excerpt": "Like the title says, this shit is ridiculous and we're not going to spend all\nafternoon moderating it. If you make a post and think it's a quality\ncontribution to the subreddit send a message to modmail and we can approve it.\n\nThe last two days have seen something like 200 post removals to start…",
  "original_created_utc": 1611792908,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "就像标题说的，这狗屎是荒谬的，我们不打算花所有的。\n下午主持它。如果你发了一个帖子，并且认为这是一个优质的\n贡献到subreddit发送消息到modmail，我们可以批准它。\n\n最近两天有200个帖子被删除，开始... ...",
      "title": "WSB私有化了，由于绝对荒谬的低质量帖子和WSB垃圾邮件迁移，我暂时将垃圾邮件过滤器设置为全部--只有版主批准的帖子才会出现。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "就像標題說的，這狗屎是荒謬的，我們不打算花所有的。\n下午主持它。如果你發了一個帖子，並且認爲這是一個優質的\n貢獻到subreddit發送消息到modmail，我們可以批准它。\n\n最近兩天有200個帖子被刪除，開始... ...",
      "title": "WSB私有化了，由於絕對荒謬的低質量帖子和WSB垃圾郵件遷移，我暫時將垃圾郵件過濾器設置爲全部--只有版主批准的帖子纔會出現。"
    }
  ],
  "title": "WSB Went private, and due to an absolutely ridiculous onlsaught of low quality posts and WSB spam migration I am temporarily setting the spam filter to All - only posts approved by mods will show up.",
  "created_utc": 1611796214,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Like the title says, this shit is ridiculous and we&#39;re not going to spend all afternoon moderating it.  If you make a post and think it&#39;s a quality contribution to the subreddit send a message to modmail and we can approve it.</strong></p>\n\n<p>The last two days have seen something like 200 post removals to start with, so with WSB going private and it being 7pm already, which is when we&#39;re typically light on mods, I&#39;m just going to step in and stop this nonsense for the time being.</p>\n\n<p>Also, Reddit has been having server issues all day meaning automod is just fucking up all over the place and not doing it&#39;s job.  This also means modmail is on the fritz, so if you don&#39;t get a response in a timely manner I apologize but there&#39;s not a lot we can do about it - I couldn&#39;t even message other mods to warn em I was doing this.  Reddit is a shitshow rn and we can&#39;t spend our whole night fixing it unfortunately.  If people weren&#39;t spamming the sub with garbage all day we wouldn&#39;t be here. </p>\n\n<p>Lastly, as a PSA to all of the people who think they&#39;ve been on WSB for a while and are confused: you haven&#39;t been on WSB for a while if this is confusing.  They regularly go private.  It&#39;s not the SEC, it&#39;s not the FBI, it&#39;s not whomever else they say is investigating them.  It&#39;s because the mods are tired of dealing with noobs that flood the sub after a media event so they just shut it down.  Hopefully that don&#39;t hit ya like a brick in the ol cranium...   </p>\n\n<p>This is why we can&#39;t have nice things.</p>\n\n<p>Apologies to all the real ones.</p>\n\n<p>E: Just FYI, if you&#39;re messaging modmail about getting a post approved, and your post is about GME, Short squeezes, your thoughts on shorts, or whatever else, then there&#39;s a 99.99% chance it&#39;s not getting approved unless you have a very in depth analysis or some new and important news item.  Add your thoughts to one of the existing threads.</p>\n\n<p>e2: looks like they&#39;re back, I&#39;m still going to keep the post block here for a bit, prior to WSB going down we had probably 40 threads that should have been comments in existing threads.  To be completely honest we have been in need of some sort of overhaul in both moderation and rules for some time - the onslaught of frankly very low effort posts over the last few days has only served to expose just how much we rely on users to do the right thing with regard to posting, this isn&#39;t the thread for that, and I&#39;m slammed at work, but it&#39;s gotta happen at some point.</p>\n\n<p>e3: y&#39;all, 5 people DMd me and 6 others messaged our modmail asking for access to WSB.  That is NOT how reddit works lol.  I do think this is illustrative of how many people have flocked to this sub and this site without understanding any of it recently.</p>\n\n<p>e4: in the last 60 minutes there were 53 new submissions, of those only 4 were actual posts worth making.  I&#39;m gonna leave the sub locked for a bit till we get a better solution, there&#39;s just no way to moderate this onslaught</p>\n</div><!-- SC_ON -->",
  "score": 2089,
  "permalink": "/r/investing/comments/l6iljq/wsb_went_private_and_due_to_an_absolutely/",
  "subreddit": "investing",
  "id": "l6iljq",
  "is_self": true,
  "media": null,
  "is_video": false
}