{
  "author": "Disguustang",
  "the_new_excerpt": "I don’t understand the comparison. The world as we know it, is in a state in\nwhich we haven’t seen since the Spanish flu.\n\nThe global economy is in tatters, I believe their were comparisons that put a\nlot of countries in the same economic status as to when world war 2 ended.\nPeople are still dying…",
  "original_created_utc": 1619863117,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "比べること自体が理解できない。私たちが知っている世界は、スペイン風邪以来、見たことのない状態です。\nスペイン風邪以来の状態です。\n\n世界経済はぼろぼろで、多くの国がその影響を受けているという比較があったと思います。\n多くの国が第2次世界大戦の終結時と同じ経済状態にあるという比較があったと思います。\n人々はまだ死んでいる...。",
      "title": "今回のブルランは2017年とは全く違う"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不明白这种比较。我们所知道的世界，正处于一种\n这是自西班牙流感以来我们从未见过的。\n\n全球经济已经支离破碎，我相信他们的比较使很多国家处于相同的经济状况。\n很多国家的经济状况与第二次世界大战结束时相同。\n人们仍然在死亡...",
      "title": "这轮牛市行情与2017年完全不同"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不明白這種比較。我們所知道的世界，正處於一種\n這是自西班牙流感以來我們從未見過的。\n\n全球經濟已經支離破碎，我相信他們的比較使很多國家處於相同的經濟狀況。\n很多國家的經濟狀況與第二次世界大戰結束時相同。\n人們仍然在死亡...",
      "title": "這輪牛市行情與2017年完全不同"
    }
  ],
  "title": "This bull run is nothing like 2017",
  "created_utc": 1619883815,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I don’t understand the comparison. The world as we know it, is in a state in which we haven’t seen since the Spanish flu. </p>\n\n<p>The global economy is in tatters, I believe their were comparisons that put a lot of countries in the same economic status as to when world war 2 ended. People are still dying in the thousands everywhere and millions of businesses are clutching at straws. </p>\n\n<p>We need to realise that 2017 may as well of been a completely different plane of existence. This time around we have NFTS, we have EFTs, we have major adoption from huge businesses like Tesla, major adoption from continents like Africa and countries such as Nigeria.</p>\n\n<p>Comparing Apples to oranges.</p>\n\n<p>I don’t feel like we will have an 80% crash at all. A lot of what’s being said feels like fear mongering or some weird form of PTSD that some people seem to have.</p>\n</div><!-- SC_ON -->",
  "score": 364,
  "permalink": "/r/CryptoCurrency/comments/n2fbzx/this_bull_run_is_nothing_like_2017/",
  "subreddit": "CryptoCurrency",
  "id": "n2fbzx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380961468
}