{
  "author": "RLBreakout",
  "the_new_excerpt": "First of all 70% of my portfolio is in INRG - which is the UK equivalent of ICLN\n(exact same holdings and all).\n\nFrom what I gather most of ICLN’s holdings are smaller companies EXPECTED to\ngrow due to their head starts in renewables for example Plug Power, which is one\nof the largest holdings in…",
  "original_created_utc": 1609332285,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "首先，我的投资组合中有70%投资于INRG-这相当于英国的ICLN\n(持有量和所有持有量完全相同)。\n\n据我所知，ICLN持有的大部分股份都是规模较小的公司，预计将\n增长得益于他们在可再生能源领域的领先地位，例如Plug Power，这是一种\n在…最大的持有量中",
      "title": "在成为可再生能源方面，人们对传统能源股票的期望值是否大大低于预期？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，我的投資組合中有70%投資於INRG-這相當於英國的ICLN\n(持有量和所有持有量完全相同)。\n\n據我所知，ICLN持有的大部分股份都是規模較小的公司，預計將\n增長得益於他們在可再生能源領域的領先地位，例如Plug Power，這是一種\n在…最大的持有量中",
      "title": "在成爲可再生能源方面，人們對傳統能源股票的期望值是否大大低於預期？"
    }
  ],
  "title": "Are people massively under expecting legacy energy stocks in their ability to become renewables?",
  "created_utc": 1609347389,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>First of all 70% of my portfolio is in INRG - which is the UK equivalent of ICLN (exact same holdings and all).</p>\n\n<p>From what I gather most of ICLN’s holdings are smaller companies EXPECTED to grow due to their head starts in renewables for example Plug Power, which is one of the largest holdings in ICLN at 5%.</p>\n\n<p>I for one have this vision that all these legacy energy stocks like BP, Shell, Exxon will for some reason neglect to transition to renewable sources of energy and fade into obscurity.</p>\n\n<p>Obviously, this surely cannot happen, the writing has been on the wall for the end of fossil fuel sources and these companies have already invested massively and plan to invest more in renewable development/research - <a href=\"https://www.google.co.uk/amp/s/amp.theguardian.com/business/2020/jan/03/royal-dutch-shell-may-fail-to-reach-green-energy-targets\">Shell plans to spend $2bn to $3bn through its “new energies division” every year between 2021 to 2025</a>.</p>\n\n<p>So is the future of renewable energy more likely to see these companies absorbing the other smaller ‘new’ renewable companies?</p>\n\n<p>What do you guys think about the future of these legacy stocks?</p>\n</div><!-- SC_ON -->",
  "score": 219,
  "permalink": "/r/stocks/comments/kn1mpb/are_people_massively_under_expecting_legacy/",
  "subreddit": "stocks",
  "id": "kn1mpb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609495335779
}