{
  "author": "AskScienceModerator",
  "original_created_utc": 1647514803,
  "title": "AskScience AMA Series: We're Experts Studying COVID-19 In Deer and Other Wildlife. AUA!",
  "created_utc": 1647544941,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In the past two years, dozens of animal species have been found to be infected with the SARS-CoV-2 virus. Of these, only two types of animals were found to be infected in the wild: mink and white-tailed deer. These findings have serious implications for managing (and ultimately ending) the COVID-19 pandemic.&lt;/p&gt;\n\n&lt;p&gt;Join us today at 2 PM ET for a discussion, organized by the American Society for Microbiology (ASM), about our work to identify, diagnose and treat COVID-19 infections in wildlife. We&amp;#39;ll discuss your questions about animal disease reservoirs, the potential for additional SARS-CoV-2 variants, and what our research (and the work of others) tells us about the role of wildlife in the COVID-19 pandemic, as well as future pandemics.&lt;/p&gt;\n\n&lt;p&gt;We are laboratory researchers, veterinarians, and evolutionary biologists. Ask us anything!&lt;/p&gt;\n\n&lt;p&gt;With us today are:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Dr. Angela Bosco-Lauth, Ph.D., D.V.M. (&lt;a href=\"/u/VirologyVet\"&gt;u/VirologyVet&lt;/a&gt;)- Assistant Professor, Biomedical Sciences, Colorado State University&lt;/li&gt;\n&lt;li&gt;Dr. Andrew S. Bowman, M.S., D.V.M., Ph.D., Diplomate ACVPM (&lt;a href=\"/u/Buckikid\"&gt;u/Buckikid&lt;/a&gt;)- Associate Professor, Department of Veterinary Preventive Medicine, The Ohio State University&lt;/li&gt;\n&lt;li&gt;Dr. Martha I. Nelson, Ph.D. (&lt;a href=\"/u/MI_Nelson\"&gt;u/MI_Nelson&lt;/a&gt;)- Staff Scientist, National Center for Biotechnology Information, National Institutes of Health&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Links:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;a href=\"https://theconversation.com/deer-mink-and-hyenas-have-caught-covid-19-animal-virologists-explain-how-to-find-the-coronavirus-in-animals-and-why-humans-need-to-worry-176666\"&gt;Deer, mink and hyenas have caught COVID-19 – animal virologists explain how to find the coronavirus in animals and why humans need to worry (The Conversation)&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;&lt;a href=\"https://www.nature.com/articles/s41586-021-04353-x\"&gt;SARS-CoV-2 infection in free-ranging white-tailed deer (Nature)&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;&lt;a href=\"https://www.microbe.tv/twiv/twiv-847/\"&gt;&amp;quot;This Week in Virology&amp;quot; podcast&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;&lt;a href=\"https://www.theguardian.com/world/2022/feb/14/covid-virus-in-deer\"&gt;How serious is the presence of the Covid virus in deer for humans? (The Guardian)&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;&lt;a href=\"https://www.nytimes.com/2022/02/22/health/coronavirus-animals.html\"&gt;If You Haven&amp;#39;t Thought About Coronavirus in Animals, You Should (New York Times)&lt;/a&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/askscience/comments/tg7kvi/askscience_ama_series_were_experts_studying/",
  "subreddit": "askscience",
  "id": "tg7kvi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In the past two years, dozens of animal species have been found to be infected\nwith the SARS-CoV-2 virus. Of these, only two types of animals were found to be\ninfected in the wild: mink and white-tailed deer. These findings have serious\nimplications for managing (and ultimately ending) the COVID-19…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この2年間で、数十種類の動物の感染が確認されています。\nSARS-CoV-2ウイルスに感染している。このうち、2種類の動物だけが、SARS-CoV-2ウイルスの感染が確認されました。\nミンクとオジロジカである。この発見は、以下のような重大な意味を持ちます。\nCOVID-19の管理（最終的には終息）にも影響する...",
      "title": "AskScience AMAシリーズ。私たちは、シカやその他の野生動物におけるCOVID-19を研究している専門家です。AUA!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在过去的两年里，有几十个动物物种被发现感染了\n感染了SARS-CoV-2病毒。在这些动物中，只有两种动物被发现在野外感染：水貂和白尾鹿。\n感染的动物：水貂和白尾鹿。这些发现具有严重的\n对管理（和最终结束）COVID-19的影响。",
      "title": "AskScience AMA系列。我们是研究鹿和其他野生动物COVID-19的专家。AUA!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在過去的兩年裏，有幾十個動物物種被發現感染了\n感染了SARS-CoV-2病毒。在這些動物中，只有兩種動物被發現在野外感染：水貂和白尾鹿。\n感染的動物：水貂和白尾鹿。這些發現具有嚴重的\n對管理（和最終結束）COVID-19的影響。",
      "title": "AskScience AMA系列。我們是研究鹿和其他野生動物COVID-19的專家。AUA!"
    }
  ]
}