{
  "author": "ChairSoggy6394",
  "the_new_excerpt": "I think this is the best advice I've received when it comes to the stock market.\nYou can have the greatest system in the world, but if you're not mechanically\napplying your rules and committing 100% to them (win or los), you'll create a\ncycle where you condition yourself to break your system on a…",
  "original_created_utc": 1614723204,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我想这是我在股市方面收到的最好的建议。\n你可以有世界上最伟大的系统，但如果你不是机械的。\n应用你的规则，并百分之百地致力于它们（无论输赢），你将创造一个\n循环，在那里你条件自己打破你的系统上... ...",
      "title": "交易你的规则，而不是你的情绪"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想這是我在股市方面收到的最好的建議。\n你可以有世界上最偉大的系統，但如果你不是機械的。\n應用你的規則，並百分之百地致力於它們（無論輸贏），你將創造一個\n循環，在那裏你條件自己打破你的系統上... ...",
      "title": "交易你的規則，而不是你的情緒"
    }
  ],
  "title": "Trade your rules, not your emotions",
  "created_utc": 1614734914,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I think this is the best advice I&#39;ve received when it comes to the stock market. You can have the greatest system in the world, but if you&#39;re not mechanically applying your rules and committing 100% to them (win or los), you&#39;ll create a cycle where you condition yourself to break your system on a hunch, feeling, or whatever.</p>\n\n<p>My personal mentor told me that if she&#39;s lost money on a position, she&#39;s proud to have lost it because she didn&#39;t compensate or compromise her rules. Can you imagine that? If she&#39;s made money on a position, she&#39;s equally proud and for the same reasons. In essence, she defines her success by the measure of how close to her rules she executed, not by how much she makes. Which is a lot I can tell you.</p>\n\n<p>It&#39;s a way to decondition yourself from thinking in terms of win or lose. Win or lose is a very binary and primitive condition. To be a pro, you have to have principles, rules, and mechanical execution. It requires discipline and probably years of an almost zen like state of trading when you see nothing but red figures or green figures. Panic or greed simply do not exist in such a state.</p>\n\n<p>I believe this is where the pros differentiate themselves from the amateurs and seems to be the common theme amongst the successful traders I&#39;ve talked to, and who I one day hope to join.</p>\n</div><!-- SC_ON -->",
  "score": 179,
  "permalink": "/r/stocks/comments/lwdz8s/trade_your_rules_not_your_emotions/",
  "subreddit": "stocks",
  "id": "lwdz8s",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937744931
}