{
  "author": "KofiOlut",
  "original_created_utc": 1637180482,
  "title": "Cryptocurrency Terms to Know Before You Invest: A Beginner’s Guide",
  "created_utc": 1637227992,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A short overview over the most important terminology in the crypto space:</p>\n\n<p><strong>Altcoin</strong></p>\n\n<p>Any coin that’s not Bitcoin. Altcoins can be anything from the second-most popular coin, Ethereum, to any of the thousands of coins with very minimal market value. Experts say you should largely stick to the bigger, more mainstream cryptocurrencies as an investment.</p>\n\n<p><strong>Bitcoin</strong></p>\n\n<p>The first and most valuable cryptocurrency, launched on Jan. 3, 2009. While its value has climbed steadily since then, it has seen wild fluctuations.</p>\n\n<p><strong>Block</strong></p>\n\n<p>Groups of data within a blockchain. On cryptocurrency blockchains, blocks are made up of transaction records as users buy or sell coins. Each block can hold only a certain amount of information. Once it reaches that limit, a new block is formed to continue the chain.</p>\n\n<p><strong>Blockchain</strong></p>\n\n<p>A digital form of record keeping, and the underlying technology behind cryptocurrencies. A blockchain is the result of sequential blocks that build upon one another, creating a permanent and unchangeable ledger of transactions (or other data).</p>\n\n<p><strong>Centralized Exchange (CEX</strong>) </p>\n\n<p>Platforms which facilitate the buying and selling of cryptocurrency, either for fiat currencies, like the US dollar, or between digital assets, like BTC and ETH. They function as trusted intermediaries in trades, and often act as custodians by storing and protecting your funds.</p>\n\n<p><strong>Coin</strong></p>\n\n<p>A representative store of digital value that lives on a given blockchain or cryptocurrency network. Some blockchains have the same name for both the network and the coin, like Bitcoin. Others can have different names for each, like the Stellar blockchain, which has a native coin called Lumen. </p>\n\n<p><strong>Cold Wallet/Cold Storage</strong></p>\n\n<p>A secure method of storing your cryptocurrency completely offline. Many cold wallets (also called hardware wallets) are physical devices that look similar to a USB drive. This kind of wallet can help protect your crypto from hacking and theft, though it also comes with its own risks – like losing it, along with your crypto.</p>\n\n<p><strong>Cryptocurrency</strong></p>\n\n<p>A type of currency that’s digital and decentralized. Cryptocurrency can be used to buy and sell things, or as a long-term store of value.</p>\n\n<p><strong>DCA - Dollar Cost Averaging</strong></p>\n\n<p>Investing set amount of money into an asset on a regular basis, disregarding the price action.</p>\n\n<p><strong>Decentralization</strong></p>\n\n<p>The principle of distributing power away from a central point. Blockchains are traditionally decentralized because they require majority approval from all users to operate and make changes, rather than a central authority.</p>\n\n<p><strong>Decentralized Finance (DeFi)</strong></p>\n\n<p>Financial activities conducted without the involvement of an intermediary, like a bank, government, or other financial institution. </p>\n\n<p><strong>Decentralized Applications (DApps)</strong></p>\n\n<p>Applications designed by developers and deployed on a blockchain to carry out actions without intermediaries. Decentralized finance activities are often completed using decentralized apps. Ethereum is the main network supporting activities in decentralized finance.</p>\n\n<p><strong>Decentralized Exchange (DEX)</strong> </p>\n\n<p>A type of cryptocurrency exchange which allows for direct peer-to-peer cryptocurrency transactions to take place online securely and without the need for an intermediary.</p>\n\n<p><strong>Digital</strong> <strong>Gold</strong></p>\n\n<p>Experts sometimes compare specific cryptocurrencies to real gold based on the way it can store and increase in value. Bitcoin is commonly referred to as digital gold.</p>\n\n<p><strong>Ethereum</strong></p>\n\n<p>The second largest cryptocurrency by trade volume, Ethereum is a crypto network and software platform that developers can use to create new applications, and has an associated currency called ether.</p>\n\n<p><strong>Exchange</strong></p>\n\n<p>A digital marketplace where you can buy and sell cryptocurrencies like Binance, Coinbase or Crypto.com</p>\n\n<p><strong>Fork</strong></p>\n\n<p>When a blockchain’s users make changes to its rules. These changes to the protocol of a blockchain often result in two new paths — one that follows the old rules, and a new blockchain that splits off from the previous one. (Example: a fork of Bitcoin resulted in Bitcoin Cash).</p>\n\n<p><strong>Gas</strong></p>\n\n<p>A fee that developers have to pay to the Ethereum network in order to use the system. Gas is paid in ether, the native cryptocurrency of Ethereum. </p>\n\n<p><strong>Genesis Block</strong></p>\n\n<p>The first block of a cryptocurrency ever mined</p>\n\n<p><strong>HODL</strong></p>\n\n<p>Stands for “Hold On for Dear Life” though the term originated from a user typo on a Bitcoin forum in 2013. It refers to a passive investment strategy in which people buy and hold onto cryptocurrency — instead of trading it — in the hopes that it increases in value. </p>\n\n<p><strong>Halving</strong></p>\n\n<p>A feature written into Bitcoin’s code in which after a certain number of blocks are mined (typically every four years) the amount of new Bitcoin entering circulation gets halved. The halving can have an impact on Bitcoin’s price.</p>\n\n<p><strong>Hash</strong></p>\n\n<p>A unique string of numbers and letters that identify blocks and are tied to crypto buyers and sellers.</p>\n\n<p><strong>Hot</strong> <strong>Wallet</strong></p>\n\n<p>A software-based cryptocurrency wallet  connected to the Internet. While more convenient for quickly accessing your crypto, these wallets are a bit more susceptible to hacking and cybersecurity attacks than offline wallets — just as files you store in the cloud may be more easily hacked than those locked in a safe in your home.</p>\n\n<p><strong>Initial Coin Offering (ICO)</strong></p>\n\n<p>A way that funds are raised for a new cryptocurrency project. ICOs are similar to Initial Public Offerings (IPOs) of stocks.</p>\n\n<p><strong>Market Capitalization</strong></p>\n\n<p>For cryptocurrency, market cap refers to the total value of all the coins that have been mined. You can calculate a crypto’s market cap by multiplying the current number of coins by the current value of the coins. </p>\n\n<p><strong>Memecoin</strong></p>\n\n<p>A cryptocurrency that is associated with some theme, often as a joke rather than a serious product.</p>\n\n<p><strong>Mining</strong></p>\n\n<p>Mining is the process of verifying new transactions on a blockchain. When someone donates computer power to a miner to complete an encryption challenge, that donor is then awarded crypto.</p>\n\n<p><strong>Node</strong></p>\n\n<p>A computer that connects to a blockchain network.</p>\n\n<p><strong>Non-fungible Tokens (NFTs)</strong></p>\n\n<p>Non-fungible tokens are units of value used to represent the ownership of unique digital items like art or collectibles. NFTs are most often held on the Ethereum blockchain.</p>\n\n<p><strong>Proof of Work</strong></p>\n\n<p>Proof of Work is a more traditional method to award miners for their effort. It requires miners to show their effort by tying a variable to the process of hashing a transaction. A hashed block proves work was completed and awards the miner. This takes up a lot of energy.</p>\n\n<p><strong>Proof of Stake</strong></p>\n\n<p>Proof of Stake allows a person to validate or mine cryptocurrency based on the number of coins he or she owns. Under this model, the idea is that a miner will be less likely to attack a network if they have a stake in the game.</p>\n\n<p><strong>Peer-to-peer</strong></p>\n\n<p>Two users interacting directly without a third party or intermediary</p>\n\n<p><strong>Public Key</strong> </p>\n\n<p>Your wallet&#39;s address, which is similar to your bank account number. You can share your public wallet key with people or institutions so they can send you money or take money from your account when you authorize it.</p>\n\n<p><strong>Private Key</strong></p>\n\n<p>The encrypted code that allows direct access to your cryptocurrency. Like your bank account password, you should never share your private key. </p>\n\n<p><strong>Rugpull</strong></p>\n\n<p>A rug pull is a malicious maneuver in the cryptocurrency industry where crypto developers abandon a project and run away with investors’ funds.</p>\n\n<p><strong>Satoshi Nakomoto</strong></p>\n\n<p>The pseudonymous creator of Bitcoin. No one knows the true identity of Nakomoto — or if it’s more than one person.</p>\n\n<p><strong>Shitcoin</strong></p>\n\n<p>The term shitcoin refers to a cryptocurrency with little to no value or a digital currency that has no immediate, discernible purpose. The word is a pejorative term often used to describe altcoins or cryptocurrencies that were developed after bitcoins became popular.</p>\n\n<p>The diminished value of a shitcoin is often due to failed investor interest because it was not created in good faith or because its price was based on speculation. As such, these currencies are considered to be bad investments.</p>\n\n<p><strong>Smart Contract</strong></p>\n\n<p>An algorithmic program that enacts the terms of a contract automatically based on its code. One of the main value propositions of the Ethereum network is its ability to execute smart contracts. Smart contracts hold multiple parties accountable for something, just like a normal legal contract, but it instructs each party through code rather than spoken language. Both parties can see and approve of the programming before accepting a contract’s terms, making it completely transparent.</p>\n\n<p><strong>Stablecoin or Digital Fiat</strong></p>\n\n<p>A stablecoin pegs its value to some other non-digital currency or commodity. A digital fiat represents a fiat, or government-backed currency on the blockchain. (Example: Tether, which is pegged to the U.S. dollar)</p>\n\n<p><strong>Token</strong></p>\n\n<p>A unit of value on a blockchain that usually has some other value proposition besides just a transfer of value (like a coin). </p>\n\n<p><strong>Vitalik Buterin</strong></p>\n\n<p>Programmer who invented Ethereum in 2015.</p>\n\n<p><strong>Wallet</strong></p>\n\n<p>A place to store your cryptocurrency holdings. Many exchanges offer digital wallets. Wallets may be hot (online, software-based) or cold (offline, usually on a device).</p>\n\n<p>&#x200B;</p>\n\n<p>Edit: I will Edit these as we go in case I forgot a few.</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/qw81sq/cryptocurrency_terms_to_know_before_you_invest_a/",
  "subreddit": "CryptoCurrency",
  "id": "qw81sq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "A short overview over the most important terminology in the crypto space:\n\nAltcoin\n\nAny coin that’s not Bitcoin. Altcoins can be anything from the second-most\npopular coin, Ethereum, to any of the thousands of coins with very minimal\nmarket value. Experts say you should largely stick to the bigger,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号の世界で最も重要な用語を簡単に説明します。\n\nAltcoin（アルトコイン\n\nビットコインではないあらゆるコイン。アルトコインには、2番目に人気のあるEthereumから\nアルトコインは、2番目に人気のあるコインであるEthereumから、市場価値が非常に低い何千ものコインのどれかになります。\nアルトコインは、2番目に人気のあるイーサリアムから、市場価値が非常に低い何千ものコインまであります。専門家によると、主に大規模なものに集中すべきだと言われています。",
      "title": "投資する前に知っておきたい暗号通貨の用語。初心者のためのガイド"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "简要介绍一下加密货币领域最重要的术语。\n\nAltcoin\n\n任何非比特币的币种。阿尔特币可以是任何东西，从第二大的\n币，到成千上万种市场价值极低的硬币中的任何一种。\n市场价值。专家说，你应该在很大程度上坚持使用较大的、...",
      "title": "投资前需要了解的加密货币术语。初学者的指南"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "簡要介紹一下加密貨幣領域最重要的術語。\n\nAltcoin\n\n任何非比特幣的幣種。阿爾特幣可以是任何東西，從第二大的\n幣，到成千上萬種市場價值極低的硬幣中的任何一種。\n市場價值。專家說，你應該在很大程度上堅持使用較大的、...",
      "title": "投資前需要了解的加密貨幣術語。初學者的指南"
    }
  ]
}