{
  "author": "spgallego",
  "original_created_utc": 1652455624,
  "title": "Just reached 0,01 Bitcoin for the first time ever!",
  "created_utc": 1652501022,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I know it ain’t much but hear me out.\nI have been following actively the crypto market for 6 years now (Since I was 18 y/o). The first time I heard about bitcoin I was a 12y/o kid who had just heard about the deep web and how Bitcoin was used to pay for assassinations and drugs and child porn and so on…\nFast forwad to 2018 I thought about buying but Bitcoin had already hit 17k (euros) and was at the time at 6 or 7k. I thought to myself “It dropped from 17k to 6k, that’s no good, besides, 7k is still too much”. Then it dropped to 3k and 2k and I  kind of lost interest, and now I regret not buying and Hodling at the time. However today I can see why Bitcoin is and will always be the number one cryptocurrency. I bought my first satoshi at 39k, I bought more earlier today at 29k and will continue buying every month and Hodl it for a very long long time.\nThank you for reading.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 329,
  "permalink": "/r/Bitcoin/comments/uou8nz/just_reached_001_bitcoin_for_the_first_time_ever/",
  "subreddit": "Bitcoin",
  "id": "uou8nz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I know it ain’t much but hear me out. I have been following actively the crypto\nmarket for 6 years now (Since I was 18 y/o). The first time I heard about\nbitcoin I was a 12y/o kid who had just heard about the deep web and how Bitcoin\nwas used to pay for assassinations and drugs and child porn and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "大したことではないのですが、話を聞いてください。私は暗号市場を積極的にフォローしてきました。\n6年前から（18歳のときから）暗号市場を積極的にフォローしています。初めてビットコインのことを知ったのは\nビットコインを初めて知ったのは12歳の子供で、ディープウェブやビットコインが暗殺や麻薬の支払いに使われることを知ったばかりでした。\n暗殺やドラッグ、児童ポルノの支払いにビットコインが使われていることを知ったばかりでした。",
      "title": "史上初めて0,01ビットコインに到達したところです"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道这不算什么，但请听我说。我一直在积极关注加密货币\n市场已经6年了（从我18岁开始）。我第一次听说\n比特币的时候，我还是个12岁的孩子，刚刚听说了深层网络和比特币是如何被用来支付暗杀的。\n被用来支付暗杀、毒品和儿童色情等等。",
      "title": "刚刚达到0,01比特币，这是有史以来的第一次!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道這不算什麼，但請聽我說。我一直在積極關注加密貨幣\n市場已經6年了（從我18歲開始）。我第一次聽說\n比特幣的時候，我還是個12歲的孩子，剛剛聽說了深層網絡和比特幣是如何被用來支付暗殺的。\n被用來支付暗殺、毒品和兒童色情等等。",
      "title": "剛剛達到0,01比特幣，這是有史以來的第一次!"
    }
  ]
}