{
  "author": "4ChoresAnd7BeersAgo",
  "original_created_utc": 1637020766,
  "title": "Where can I play with a parachute like we did in kindergarten?",
  "created_utc": 1637032870,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Remember being in kindergarten or grade school and they would pull out this huge silk multicolored parachute and we&#39;d bounce balls on it or make it all puffy and run under it or play other games? </p>\n\n<p>I do, and I want to do it again but with other adults. Maybe even slightly drunk/stoned adults.</p>\n\n<p>I&#39;ve thought about this on and off for YEARS but have no idea what gym, club, or cult has these parachutes where adults can play like kids. </p>\n\n<p>Is there such a thing?</p>\n</div><!-- SC_ON -->",
  "score": 109,
  "permalink": "/r/NoStupidQuestions/comments/quu64d/where_can_i_play_with_a_parachute_like_we_did_in/",
  "subreddit": "NoStupidQuestions",
  "id": "quu64d",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Remember being in kindergarten or grade school and they would pull out this huge\nsilk multicolored parachute and we'd bounce balls on it or make it all puffy and\nrun under it or play other games?\n\nI do, and I want to do it again but with other adults. Maybe even slightly\ndrunk/stoned adults.\n\nI've…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "幼稚園や小学校では、この巨大なソレを取り出して\n絹の色とりどりのパラシュートを引っ張り出してきて、その上でボールを弾いたり、膨らませたりして\nその上でボールを弾いたり、膨らませてその下を走ったり、いろいろな遊びをしましたよね？\n\n私はそれを知っています。そして、他の大人たちと一緒にもう一度やりたいと思っています。もしかしたら、少し\n酔っぱらった大人と。\n\n私は...",
      "title": "幼稚園でやったようなパラシュート遊びはどこでできますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "记得在幼儿园或小学的时候，他们会拿出这种巨大的\n丝质的多色降落伞，我们在上面弹球，或者把它弄得鼓鼓的，在下面跑，或者玩其他游戏。\n在它下面跑步或玩其他游戏？\n\n我记得，而且我想再做一次，但要和其他成年人一起做。也许甚至是稍微\n醉的/石头的成年人。\n\n我已经...",
      "title": "我在哪里可以像我们在幼儿园那样玩降落伞？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "記得在幼兒園或小學的時候，他們會拿出這種巨大的\n絲質的多色降落傘，我們在上面彈球，或者把它弄得鼓鼓的，在下面跑，或者玩其他遊戲。\n在它下面跑步或玩其他遊戲？\n\n我記得，而且我想再做一次，但要和其他成年人一起做。也許甚至是稍微\n醉的/石頭的成年人。\n\n我已經...",
      "title": "我在哪裏可以像我們在幼兒園那樣玩降落傘？"
    }
  ]
}