{
  "author": "VampAurora",
  "the_new_excerpt": "As posted in /r/PalantirTech\n--\n\n * Palantir Technologies (NYSE:PLTR) is expanding its work with Fujitsu\n   (OTCPK:FJTSY) with a one-year by signing $8M contract between Fujitsu and\n   Palantir Technologies Japan K.K.\n * Under the contract, Fujitsu will also become the first distributor of ERP\n  …",
  "original_created_utc": 1609938333,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "如发布在/r/PalantirTech中\n--\n\n*Palantir Technologies(纽约证券交易所代码：PLTR)正在扩大与富士通的合作\n(OTCPK：FJTSY)与富士通签署价值800万美元的合同，为期一年\nPalantir Technologies Japan K.K.\n*根据合同，富士通还将成为ERP的首家分销商\n…",
      "title": "富士通作为Palantir Foundry客户签署价值800万美元的合同"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如發佈在/r/PalantirTech中\n--\n\n*Palantir Technologies(紐約證券交易所代碼：PLTR)正在擴大與富士通的合作\n(OTCPK：FJTSY)與富士通簽署價值800萬美元的合同，爲期一年\nPalantir Technologies Japan K.K.\n*根據合同，富士通還將成爲ERP的首家分銷商\n…",
      "title": "富士通作爲Palantir Foundry客戶簽署價值800萬美元的合同"
    }
  ],
  "title": "Fujitsu signs $8M contract as Palantir Foundry customer",
  "created_utc": 1609947144,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><em>As posted in</em> <a href=\"/r/PalantirTech\">/r/PalantirTech</a><br/>\n--</p>\n\n<ul>\n<li>Palantir Technologies (NYSE:PLTR) is expanding its work with Fujitsu (OTCPK:FJTSY) with a one-year by signing $8M contract between Fujitsu and Palantir Technologies Japan K.K.</li>\n<li>Under the contract, Fujitsu will also become the first distributor of ERP Suite, a Palantir’s Foundry platform modules in the Japanese market and will build on the company’s existing support of customers in their digital transformation journeys, as well as its experience working with large commercial institutions and all branches of the Japanese government.</li>\n<li>The new module distribution channel will be accompanied by a Foundry certification program for Fujitsu’s DX services business.</li>\n</ul>\n\n<p>Palantir Technologies Inc. (PLTR) announced today it was expanding its work with Fujitsu with a one-year, $8,000,000 contract between Fujitsu and Palantir Technologies Japan K.K. Fujitsu will also become the first distributor of Palantir’s Foundry platform modules in the Japanese market.</p>\n\n<p>Fujitsu has used Palantir Foundry since last year to optimize its hardware supply chain, further improve its customer service efforts, and modernize its technological infrastructure, and will continue to do so until at least the end of 2021. Fujitsu will also become the first distributor within Japan of ERP Suite, a Palantir Foundry module. Fujitsu is already using ERP Suite internally to integrate its ERP systems with other critical systems of record. This new module distribution channel will be accompanied by a Foundry certification program for Fujitsu’s DX services business.</p>\n\n<p>Fujitsu’s distribution of Foundry modules will build on the company’s existing support of customers in their digital transformation journeys, as well as its experience working with large commercial institutions and all branches of the Japanese government.</p>\n</div><!-- SC_ON -->",
  "score": 509,
  "permalink": "/r/stocks/comments/krni0w/fujitsu_signs_8m_contract_as_palantir_foundry/",
  "subreddit": "stocks",
  "id": "krni0w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610100749679
}