{
  "author": "esol9",
  "the_new_excerpt": "It is my understanding that when the UN proposed the 1948 two state solution,\nthe majority of Jews agreed to it, and the majority of Muslims were against it.\nIf my understanding is correct, why did the Muslim population reject it?\n\nedit: i should also ask if the Muslim rejection was motivated by the…",
  "original_created_utc": 1621371238,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の理解では、国連が1948年に二国間解決策を提案したとき、ユダヤ人の大多数は賛成し、イスラム教徒の大多数は反対しました。\n私の理解では、国連が1948年に二国間解決策を提案したとき、ユダヤ人の大多数はそれに同意し、イスラム教徒の大多数はそれに反対したということになります。\nもし私の理解が正しければ、なぜイスラム教徒の人々はそれを拒否したのでしょうか？\n\n編集部：また、イスラム教徒の反対の動機は...と聞くべきでしょうか。",
      "title": "パレスチナ委任統治領に住むイスラム教徒の大多数は、なぜ1948年に国連が提案した二国間解決策を拒否したのか。彼らは、ユダヤ人と共存する多文化国家を望んでいたのだろうか？イスラム教徒の大多数は、ユダヤ人を追放したかったのでしょうか？それとも、私の理解はまったく的外れなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的理解是，当联合国提出1948年的两国解决方案时，大多数犹太人同意，而大多数穆斯林反对。\n大多数犹太人同意它，而大多数穆斯林反对它。\n如果我的理解是正确的，为什么穆斯林人口会拒绝它？\n\n编辑：我还应该问，穆斯林的拒绝是否是出于......",
      "title": "为什么生活在巴勒斯坦委任统治区的大多数穆斯林人口拒绝了1948年联合国最初提出的两个国家的解决方案？难道他们想要一个与犹太人共存的多元文化国家？大多数穆斯林想驱逐犹太人吗？还是说我的理解完全是错误的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的理解是，當聯合國提出1948年的兩國解決方案時，大多數猶太人同意，而大多數穆斯林反對。\n大多數猶太人同意它，而大多數穆斯林反對它。\n如果我的理解是正確的，爲什麼穆斯林人口會拒絕它？\n\n編輯：我還應該問，穆斯林的拒絕是否是出於......",
      "title": "爲什麼生活在巴勒斯坦委任統治區的大多數穆斯林人口拒絕了1948年聯合國最初提出的兩個國家的解決方案？難道他們想要一個與猶太人共存的多元文化國家？大多數穆斯林想驅逐猶太人嗎？還是說我的理解完全是錯誤的？"
    }
  ],
  "title": "Why did the majority of the Muslim population living in the Palestine Mandate reject the original 1948 UN proposal for a two state solution? Did they want one multicultural state for co-existance with Jews? Did the majority of Muslims want to expel the Jews? Or is my understanding entirely off base?",
  "created_utc": 1621388729,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It is my understanding that when the UN proposed the 1948 two state solution, the majority of Jews agreed to it, and the majority of Muslims were against it. If my understanding is correct, why did the Muslim population reject it?</p>\n\n<p>edit: i should also ask if the Muslim rejection was motivated by the evictions of Muslims for the influx of Jews during the British Mandate</p>\n</div><!-- SC_ON -->",
  "score": 139,
  "permalink": "/r/AskHistorians/comments/nflydt/why_did_the_majority_of_the_muslim_population/",
  "subreddit": "AskHistorians",
  "id": "nflydt",
  "is_self": true,
  "media": null,
  "is_video": false
}