{
  "author": "JeffTennis",
  "original_created_utc": 1642195128,
  "title": "Why do teenagers and children seem less affected by COVID than other age groups?",
  "created_utc": 1642213856,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Not trying to turn this into a should they get vaccinated argument. During the height of lockdown there was this argument that children and teenagers weren&amp;#39;t coming down with those symptoms and getting as sick as adults. Shouldn&amp;#39;t their immune systems be weaker since they haven&amp;#39;t been exposed to as many things as a healthy adult would?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 149,
  "permalink": "/r/askscience/comments/s42w2z/why_do_teenagers_and_children_seem_less_affected/",
  "subreddit": "askscience",
  "id": "s42w2z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Not trying to turn this into a should they get vaccinated argument. During the\nheight of lockdown there was this argument that children and teenagers weren't\ncoming down with those symptoms and getting as sick as adults. Shouldn't their\nimmune systems be weaker since they haven't been exposed to as…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "予防接種を受けるべきかの議論にするつもりはない。この間\nロックダウンの最中には、子供やティーンエイジャーはロックダウンをしていない、という議論がありました。\nこのような症状が出て、大人と同じように体調を崩してしまうのです。彼らの\n免疫系が弱くなっているのです。",
      "title": "なぜ10代や子供は、他の年齢層に比べてCOVIDの影響を受けにくいように見えるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不是想把这个问题变成他们是否应该接种疫苗的争论。在\n在封锁的高峰期，有这样一种说法，即儿童和青少年没有出现这些症状，也没有像成年人那样生病。\n出现这些症状并像成年人一样生病。难道他们不应该\n他们的免疫系统不是应该更弱吗，因为他们还没有接触到...",
      "title": "为什么青少年和儿童似乎比其他年龄组更少受到COVID的影响？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不是想把這個問題變成他們是否應該接種疫苗的爭論。在\n在封鎖的高峯期，有這樣一種說法，即兒童和青少年沒有出現這些症狀，也沒有像成年人那樣生病。\n出現這些症狀並像成年人一樣生病。難道他們不應該\n他們的免疫系統不是應該更弱嗎，因爲他們還沒有接觸到...",
      "title": "爲什麼青少年和兒童似乎比其他年齡組更少受到COVID的影響？"
    }
  ]
}