{
  "author": "bray799",
  "original_created_utc": 1638069492,
  "title": "Is .035xxxxx bitcoin honestly worth holding right now?",
  "created_utc": 1638113978,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I bought in a small amount last year before this insane bull run, definitely kicking myself wishing i wouldve bought more, had life get in the way so i was absent from buying dor a few months but have started to DCA, it just feels like ill never catch up to owning even .1 Bitcoin. Im debating on selling and trying to play some options so i can use those gains to buy back in with more buying power. Risky i know. Stupid? Probably. Should i play it safe and just hold while slowing buying more instead?</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/Bitcoin/comments/r3ui6x/is_035xxxxx_bitcoin_honestly_worth_holding_right/",
  "subreddit": "Bitcoin",
  "id": "r3ui6x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I bought in a small amount last year before this insane bull run, definitely\nkicking myself wishing i wouldve bought more, had life get in the way so i was\nabsent from buying dor a few months but have started to DCA, it just feels like\nill never catch up to owning even .1 Bitcoin. Im debating on…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は昨年、この異常な強気の動きの前に少量を購入しました。\nもっと買っておけばよかったと後悔していますが、生活に支障が出てきたので、数ヶ月間は購入を控えていました。\nもっと買っておけばよかったと思っていますが、生活に支障が出てきたので数ヶ月間購入を控えていましたが、DCAを始めました。\nビットコインを0.1枚でも所有するには到底追いつけない感じです。迷っているのは...",
      "title": "0.035xxxxxビットコインは正直、今保有する価値があるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我去年在这轮疯狂的牛市之前买了少量的东西，绝对是在自责。\n我希望自己能买更多的东西，但由于生活所迫，我没有买。\n几个月没有买东西，但已经开始买DCA，只是感觉好像\n感觉自己永远也追不上拥有0.1比特币的速度了。我正在考虑...",
      "title": ".035xxxxx比特币说实话现在值得持有吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我去年在這輪瘋狂的牛市之前買了少量的東西，絕對是在自責。\n我希望自己能買更多的東西，但由於生活所迫，我沒有買。\n幾個月沒有買東西，但已經開始買DCA，只是感覺好像\n感覺自己永遠也追不上擁有0.1比特幣的速度了。我正在考慮...",
      "title": ".035xxxxx比特幣說實話現在值得持有嗎？"
    }
  ]
}