{
  "author": "mweemwee",
  "original_created_utc": 1639530963,
  "title": "Most of the \"I got hacked\" posts are bullshit",
  "created_utc": 1639546457,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Most, if not all of those posts are just idiots who either clicked on suspicious links or had a stupid fuck-up they either don&amp;#39;t want to admit to or are oblivious about.\nIt is difficult to have your system compromised or to &amp;quot;hack&amp;quot; your software wallet. Most of the hacks are social engineering that ignorant people are susceptible to.\nPlease be vigilant about every link that you click, where you save your seed phrase, which smart contracts you interact with.\nAnd sim-swapping is very real (although difficult and expensive for hackers to carry out), just get a token-based 2fa.&lt;/p&gt;\n\n&lt;p&gt;It annoys me when people spread rumours about &amp;quot;hacks&amp;quot; when 99.9999% of the time it is their stupidity that caused it.&lt;/p&gt;\n\n&lt;p&gt;Edit : At this point I want to make it clear. I use the word hack as system/software-level exploits. Social engineering is a form of hacking, but new users tend to associate the word &amp;quot;hack&amp;quot; as some kind of computer wizardry to steal their crypto. And I am writing this post in that context.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 251,
  "permalink": "/r/CryptoCurrency/comments/rgmn4n/most_of_the_i_got_hacked_posts_are_bullshit/",
  "subreddit": "CryptoCurrency",
  "id": "rgmn4n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Most, if not all of those posts are just idiots who either clicked on suspicious\nlinks or had a stupid fuck-up they either don't want to admit to or are\noblivious about. It is difficult to have your system compromised or to \"hack\"\nyour software wallet. Most of the hacks are social engineering that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "その書き込みのほとんど、いや、全部が怪しいものをクリックした馬鹿ばかりです。\nリンクや、認めたくない、あるいは認めないような愚かな失敗をしたのです。\nを忘れてしまうのです。システムを侵害されたり、\"ハッキング \"することは難しい。\nソフトウェアウォレット ハッキングのほとんどは、ソーシャルエンジニアリングで...",
      "title": "ハッキングされた」という書き込みのほとんどはデタラメです"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大多数（如果不是全部）这些帖子都是白痴，他们要么点击了可疑的\n或者有一个愚蠢的错误，他们要么不愿意承认，要么就是无动于衷。\n漠不关心。你的系统被破坏或 \"入侵 \"你的软件钱包是很难的。\n你的软件钱包。大多数黑客是社会工程，...",
      "title": "大多数 \"我被黑了 \"的帖子都是废话。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大多數（如果不是全部）這些帖子都是白癡，他們要麼點擊了可疑的\n或者有一個愚蠢的錯誤，他們要麼不願意承認，要麼就是無動於衷。\n漠不關心。你的系統被破壞或 \"入侵 \"你的軟件錢包是很難的。\n你的軟件錢包。大多數黑客是社會工程，...",
      "title": "大多數 \"我被黑了 \"的帖子都是廢話。"
    }
  ]
}