{
  "author": "Supercharmeleon",
  "original_created_utc": 1636744774,
  "title": "Unpopular Opinion: Crypto won't make games better, it will only help the game companies already exploiting the medium and putting out mediocre titles.",
  "created_utc": 1636781943,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It scares me how much people here and in other crypto spaces are willing to sell the things they like to crypto and NFTs without a second thought just for further implementation.</p>\n\n<p>There&#39;s a post in the front page calling people who don&#39;t want crypto or NFTs on games idiots, and I can&#39;t wrap my head around that. Do you really want crypto to become a part of everyday gaming? To fall on the lap of EA or Activision? Aren&#39;t pre-orders and paid DLCs bad enough?</p>\n\n<p>And to top it all off, do you really want to turn gaming into a second job? That&#39;s the part I really can&#39;t understand. Gaming is my escape from work, the one thing I can do to relax, and people want it to be a paid thing? </p>\n\n<p>What&#39;s next, crypto rewards for eating, for breathing, for going out on a walk, all dependent on how well you do it? Do you really want to gamify your life, your free time and the experiences that are meant to be your escape from trying to make money? Is that really the world you want?</p>\n\n<p>This is very exaggerated and dramatic probably, but this is how I feel. I really don&#39;t think Crypto will make games better in any way, I think people just want to believe that because it&#39;ll make them money.</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/CryptoCurrency/comments/qsimfl/unpopular_opinion_crypto_wont_make_games_better/",
  "subreddit": "CryptoCurrency",
  "id": "qsimfl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It scares me how much people here and in other crypto spaces are willing to sell\nthe things they like to crypto and NFTs without a second thought just for\nfurther implementation.\n\nThere's a post in the front page calling people who don't want crypto or NFTs on\ngames idiots, and I can't wrap my head…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここや他の暗号スペースにいる人たちが、自分の好きなものを平気で暗号やNFTに売ってしまうのが怖いですね。\n自分の好きなものを平気でcryptoやNFTに売ってしまうのが怖い。\nさらなる実装のために。\n\nフロントページには、ゲームにクリプトやNFTを搭載したくない人をバカ呼ばわりする投稿があります。\nゲームに暗号やNFTを搭載したくない人をバカ呼ばわりしている記事がありますが、私には理解できません...。",
      "title": "不人気な意見。暗号化によってゲームが良くなるわけではなく、すでにメディアを利用して凡庸なタイトルを出しているゲーム会社を助けるだけだと思います。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "让我感到害怕的是，这里和其他加密空间的人愿意出售多少\n他们喜欢的东西，不假思索地卖给加密货币和NFTs，只是为了\n进一步实施。\n\n在头版有一个帖子，称那些不希望在游戏中使用加密货币或NFT的人是白痴。\n游戏的人是白痴，而我无法理解......",
      "title": "不受欢迎的意见。Crypto不会让游戏变得更好，它只会帮助那些已经在利用这个媒介并推出平庸作品的游戏公司。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "讓我感到害怕的是，這裏和其他加密空間的人願意出售多少\n他們喜歡的東西，不假思索地賣給加密貨幣和NFTs，只是爲了\n進一步實施。\n\n在頭版有一個帖子，稱那些不希望在遊戲中使用加密貨幣或NFT的人是白癡。\n遊戲的人是白癡，而我無法理解......",
      "title": "不受歡迎的意見。Crypto不會讓遊戲變得更好，它只會幫助那些已經在利用這個媒介並推出平庸作品的遊戲公司。"
    }
  ]
}