{
  "author": "toyume",
  "original_created_utc": 1632962678,
  "title": "Some perspective: if you bought near the all time high and now your ADA/VET/ONE/ERGO/MATIC/etc is deep in the red, you're still in a massively better position than the millions who chased shitcoins that don't have a purpose",
  "created_utc": 1632984453,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was feeling down today and blamed myself for FOMO-ing near the all time highs, when I realized there are millions of people in much worse shape (and made worse decisions).</p>\n\n<p>Most of my coins are down, but at least they&#39;re legitimate projects with real world applications and committed teams. The sun will shine on them again as long as development continues.</p>\n\n<p>But people who got into SHIB, that lunar-based coin with a cool logo, and the poor misled souls over at cryptomoohnshots are just fucked.</p>\n\n<p>They have 0 development that doesn&#39;t center around &quot;hype&quot;. Their only chance of making a profit is if the entire crypto market rises again, and at that point all coins are going to rocket up anyway.</p>\n\n<p>I realized that as long as I hold non-shitcoins, I have a massive leg up. ADA, VET, ONE, ERGO, MATIC, etc. have enough merits to jump on their own.</p>\n\n<p>All I need to do is let them continue on their path.</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/CryptoCurrency/comments/py8owr/some_perspective_if_you_bought_near_the_all_time/",
  "subreddit": "CryptoCurrency",
  "id": "py8owr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was feeling down today and blamed myself for FOMO-ing near the all time highs,\nwhen I realized there are millions of people in much worse shape (and made worse\ndecisions).\n\nMost of my coins are down, but at least they're legitimate projects with real\nworld applications and committed teams. The sun…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日は気分が落ち込んでいたので、史上最高値付近でFOMOした自分を責めました。\nしかし、もっとひどい状態の（そしてもっとひどい決断をした）何百万人もの人々がいることに気づきました。\n決断をした）何百万人もの人々がいることに気づきました。)\n\n私が持っているコインのほとんどは落ちていますが、少なくともそれらは実際の世界で使われている、献身的なチームによる正当なプロジェクトです。\n献身的なチームがある正当なプロジェクトです。太陽が...",
      "title": "視点を変えれば、もしあなたが史上最高値付近で購入し、今ではADA/VET/ONE/ERGO/MATICなどが大赤字になっていたとしても、目的のないクソコインを追い求めた何百万人もの人々に比べれば、はるかに有利な立場にあると言えるでしょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我今天心情不好，责怪自己的FOMO接近历史最高点。\n当我意识到有数以百万计的人处于更糟糕的状态时（而且是更糟糕的状态）。\n决定）。)\n\n我的大多数硬币都在下跌，但至少它们是合法的项目，有真实的应用和坚定的团队。\n承诺的团队。太阳...",
      "title": "一些观点：如果你在历史高点附近买入，现在你的ADA/VET/ONE/ERGO/MATIC/等深陷亏损，你的处境仍然比那些追逐没有意义的狗屎币的数百万人好得多。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我今天心情不好，責怪自己的FOMO接近歷史最高點。\n當我意識到有數以百萬計的人處於更糟糕的狀態時（而且是更糟糕的狀態）。\n決定）。)\n\n我的大多數硬幣都在下跌，但至少它們是合法的項目，有真實的應用和堅定的團隊。\n承諾的團隊。太陽...",
      "title": "一些觀點：如果你在歷史高點附近買入，現在你的ADA/VET/ONE/ERGO/MATIC/等深陷虧損，你的處境仍然比那些追逐沒有意義的狗屎幣的數百萬人好得多。"
    }
  ]
}