{
  "author": "stjornuryk",
  "the_new_excerpt": "First of all I'm not suggesting people should buy or sell their crypto right now\nthis is simply just some simple facts and my opinion.\n\nI need to preface this by saying the crypto space is in a much different place\nthan it was in at the end of 2017. More people are knowledgeable about\nblockchain…",
  "original_created_utc": 1621752987,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "まず第一に、私は人々に今すぐ暗号を買ったり売ったりすべきだと言っているわけではありません。\nこれは単に単純な事実と私の意見です。\n\n前置きが長くなりましたが、暗号化空間は2017年末とは大きく異なる場所にあります。\n2017年末の状態とは大きく異なっています。より多くの人々が\nブロックチェーン...",
      "title": "ビットコインは19.700ドルから3.200ドルまで暴落するのに丸1年かかり、価値の約84％を失いました。19.700ドルに戻るのに3年かかりました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "首先，我并不建议人们现在就购买或出售他们的加密货币\n这仅仅是一些简单的事实和我的观点。\n\n我需要先说一下，加密货币领域现在的情况与2017年底大不相同\n与2017年底相比，已经大不相同。更多的人对\n区块链...",
      "title": "比特币花了整整一年时间，从19.700美元崩溃到3.200美元，损失了大约84%的价值。它花了三年时间才恢复到19.700美元。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，我並不建議人們現在就購買或出售他們的加密貨幣\n這僅僅是一些簡單的事實和我的觀點。\n\n我需要先說一下，加密貨幣領域現在的情況與2017年底大不相同\n與2017年底相比，已經大不相同。更多的人對\n區塊鏈...",
      "title": "比特幣花了整整一年時間，從19.700美元崩潰到3.200美元，損失了大約84%的價值。它花了三年時間才恢復到19.700美元。"
    }
  ],
  "title": "Bitcoin took a whole year to crash from ~$19.700 to ~$3.200 losing roughly 84% of it's value. It took three years for it to get back to $19.700.",
  "created_utc": 1621773826,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>First of all I&#39;m not suggesting people should buy or sell their crypto right now this is simply just some simple facts and my opinion. </p>\n\n<p>I need to preface this by saying the crypto space is in a much different place than it was in at the end of 2017. More people are knowledgeable about blockchain technology and the cryptocurrency industry at large. It&#39;s come a long way in a short amount of time.</p>\n\n<p>However every winner is bound to pick up a few &quot;glory chasers&quot; on their way to stardom. Everyone loves a winner, especially a money making winner. And just like seemingly everyone became an overnight Golden State Warriors fan when they found amazing success with the splash bros, the same happened with crypto the last year+. People who were in the past making fun of it were suddenly asking what&#39;s the best way to buy Bitcoin. Everyone wanted in. Now many of the tag alongs who were only interested in the gains are jumping off, predictably.</p>\n\n<p>I see so many shills on this sub commenting something along the lines of &quot;now is the time to buy&quot; and regardless of their intentions I feel like an extremely volatile time like this is not a very appropriate time to give out biased opinion based suggestions of whether people should be buying or selling. </p>\n\n<p>Maybe this is the exact time to buy who knows but it&#39;s certainly not a time to risk money you can&#39;t afford to lose, given the history of Bitcoin.</p>\n\n<hr/>\n\n<p>According to Yahoo Finance Bitcoin peaked in value on:</p>\n\n<p><strong>December 16th 2017</strong> when it was valued at <strong>$19.716</strong> per coin. </p>\n\n<p>Then the crash began.</p>\n\n<p>Bitcoin didn&#39;t reach it&#39;s true floor until a <strong>year later</strong>:</p>\n\n<p>On <strong>December 15th 2018</strong> when it was valued at <strong>$3.191</strong> per coin.</p>\n\n<p>In the span of a year it lost <strong>~84%</strong> of it&#39;s peak value. </p>\n\n<p>It took <strong>three years</strong> for Bitcoin to get back to it&#39;s late 2017 peak:</p>\n\n<p>On <strong>December 16th 2020</strong> it finally reached the $19.716 mark again, closing out the day @ $21.310. </p>\n\n<p>No two crashes are the same. Some take years some take months others a single day. We have no idea what&#39;s going to happen but sure as the day is long this is an extremely volatile time so please be careful both with your own currency and what you recommend other people to do with theirs.</p>\n</div><!-- SC_ON -->",
  "score": 1594,
  "permalink": "/r/CryptoCurrency/comments/nj258h/bitcoin_took_a_whole_year_to_crash_from_19700_to/",
  "subreddit": "CryptoCurrency",
  "id": "nj258h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197385266
}