{
  "author": "GroundbreakingLack78",
  "original_created_utc": 1633501017,
  "title": "My wife thought I’m cheating on her because I’m spending too much time on internet. She searched my browser history, now she thinks I’m addicted to drug called Bitocin.",
  "created_utc": 1633509259,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Lately, I started to stare at my phone more than usual due to recent spike in cryptocurrency volatile market. You know how it goes when market is pumping. I started to learn or maybe even repeat some things that I know about cryptos, blockchain, TA...</p>\n\n<p>My wife started to have feelings that I’m cheating on her. The suspicion was building up. She was trying to see what I’m doing on my phone most of the day, why I was hiding the screen from her. You know, I followed the most crucial commandment of crypto. Don’t disclose that you’re invested in crypto.</p>\n\n<p>Few days passed, I got little bit drunk and went to sleep. My wife realised it and researched my phone! Oh boy, that was definitely good morning. She started to scream at me, that I’m fucking narcotic, that now she knows from where i was getting all the money. She told me that she knows about my addiction to <strong>Bitocin</strong> and how I’m buying it low selling it high. She knows everything. </p>\n\n<p>Recent search history: “best place to store  Bitocin”, “where to hide keys to your Trezor”, “where to buy Bitocin”, “how to sell Bitocin”.  “How to fuck your cousin...” fuck thats different story.</p>\n\n<p>Moral of the story, clear your cookies and cache, delete the browse history. You don’t want your wife to know that you’re addicted to Bitocin.</p>\n</div><!-- SC_ON -->",
  "score": 735,
  "permalink": "/r/CryptoCurrency/comments/q2eizx/my_wife_thought_im_cheating_on_her_because_im/",
  "subreddit": "CryptoCurrency",
  "id": "q2eizx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Lately, I started to stare at my phone more than usual due to recent spike in\ncryptocurrency volatile market. You know how it goes when market is pumping. I\nstarted to learn or maybe even repeat some things that I know about cryptos,\nblockchain, TA...\n\nMy wife started to have feelings that I’m…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、暗号通貨市場が急上昇していることもあり、いつも以上に携帯電話を見ていることが多くなりました。\nしています。相場が急上昇しているときには、どうなるかわかりますよね。I\n私は、暗号について知っていることを学んだり、あるいは繰り返したりし始めました。\nブロックチェーン、TA...。\n\n私の妻は、私が...と感じ始めました。",
      "title": "妻は、私がインターネットに時間をかけすぎているので、浮気をしていると思っています。彼女は私のブラウザの履歴を検索し、今では私がBitocinという薬の中毒になっていると考えています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近，我开始比往常更多地盯着我的手机，因为最近加密货币的价格飙升。\n加密货币波动的市场。你知道当市场在抽动时，情况会怎样。I\n我开始学习或甚至重复我所知道的关于加密货币的一些事情。\n区块链，TA...\n\n我的妻子开始有感觉，我...",
      "title": "我的妻子认为我在欺骗她，因为我花了太多的时间在网上。她搜索了我的浏览器历史记录，现在她认为我对名为Bitocin的药物上瘾了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近，我開始比往常更多地盯着我的手機，因爲最近加密貨幣的價格飆升。\n加密貨幣波動的市場。你知道當市場在抽動時，情況會怎樣。I\n我開始學習或甚至重複我所知道的關於加密貨幣的一些事情。\n區塊鏈，TA...\n\n我的妻子開始有感覺，我...",
      "title": "我的妻子認爲我在欺騙她，因爲我花了太多的時間在網上。她搜索了我的瀏覽器歷史記錄，現在她認爲我對名爲Bitocin的藥物上癮了。"
    }
  ]
}