{
  "author": "Dreampopgazer",
  "original_created_utc": 1641548038,
  "title": "A lot of retail investors have moved on already, they ain't gonna make it",
  "created_utc": 1641558722,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;If you&amp;#39;re still here, well done, you are more resilient than a lot of folk who have already left the crypto space. Ben Cowen has estimated 70% of his viewers have already left, which is completely insane! They&amp;#39;ll be back in future, and the daily thread will be full of moonbois once more, buying high and fomo&amp;#39;ing into coins that you bought for 5% of the price they are buying at. &lt;/p&gt;\n\n&lt;p&gt;Noone can honestly say when we will recover from this downtrend, but historically speaking we always do eventually and the investors that stay around, hold good projects and accumulate during the lows are the ones that make it. &lt;/p&gt;\n\n&lt;p&gt;So if we keep dropping, do try and stick around, even if you have to cut some losses in the short term and switch to safer bets. If it is the bear market, then last time it took 12 whole months to reach the bottom and another 18 months for the bull to restart. &lt;/p&gt;\n\n&lt;p&gt;If it is just another mid-cycle low, even better, new all time highs will come this year and the people that left already will be absolutely gutted. &lt;/p&gt;\n\n&lt;p&gt;There will be less of us in the daily but you&amp;#39;ll be surrounded by focused individuals that are prepared to grind it out and who will be handsomely rewarded next time out. &lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re reading this, WAGMI&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 370,
  "permalink": "/r/CryptoCurrency/comments/ry3nhu/a_lot_of_retail_investors_have_moved_on_already/",
  "subreddit": "CryptoCurrency",
  "id": "ry3nhu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "If you're still here, well done, you are more resilient than a lot of folk who\nhave already left the crypto space. Ben Cowen has estimated 70% of his viewers\nhave already left, which is completely insane! They'll be back in future, and\nthe daily thread will be full of moonbois once more, buying…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もしあなたがまだここにいるなら、よくやった！あなたは多くの人よりも回復力がある。\nはすでに暗号の世界から去っています。ベン・コーウェンは彼の視聴者の70％が\nこれはまったくもって正気の沙汰ではありません。彼らは将来的に戻ってくるでしょうし\n日刊スレはまたムーンボーイだらけになってしまうのか、、、買い。",
      "title": "個人投資家の多くは既に移動している、もう無理だろう"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你还在这里，做得很好，你比很多已经离开加密领域的人更有弹性。\n已经离开加密货币领域的人。本-考文估计他的70%的观众\n已经离开了，这完全是一种疯狂的行为。他们将来会回来的，而且\n每天的主题将再次充满了月光族，买...",
      "title": "很多散户投资者已经开始行动了，他们不可能成功。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你還在這裏，做得很好，你比很多已經離開加密領域的人更有彈性。\n已經離開加密貨幣領域的人。本-考文估計他的70%的觀衆\n已經離開了，這完全是一種瘋狂的行爲。他們將來會回來的，而且\n每天的主題將再次充滿了月光族，買...",
      "title": "很多散戶投資者已經開始行動了，他們不可能成功。"
    }
  ]
}