{
  "author": "Set1Less",
  "the_new_excerpt": "In this hype mania circus where market caps are being chased around and dog\ncoins with zero use cases pumping to ridiculous valuations, we need to remember\nwhy we are really in this space - to see actual use cases built around crypto,\nwhere large amounts of public information can be stored cheaply,…",
  "original_created_utc": 1621261609,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このハイプ・マニアのサーカスでは、時価総額が追いかけ回され、ユースケースのない犬のコインがとんでもない評価を受けています。\nユースケースのない犬のコインがとんでもない評価額になっているこの誇大広告の中で、私たちはなぜこの分野にいるのかを思い出す必要があります。\nなぜ私たちがこの分野にいるのか、それは暗号を使った実際の使用例を見るためです。\n大量の公開情報を安価に保存することができ、...",
      "title": "リアルワールドでの採用。インド政府はCOVID-19テストの公開検証にPolygon/Maticを使用しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在这个炒作狂热的马戏团里，市值被追捧，没有用处的狗狗\n币，我们需要记住我们在这个领域的真正原因--看到围绕加密货币的实际用例。\n我们在这个领域的真正原因--看到围绕加密货币建立的实际用例。\n在这里，大量的公共信息可以被廉价地存储，...",
      "title": "真实世界的采用。印度政府正在使用Polygon/Matic对所有的COVID-19测试进行公开验证!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在這個炒作狂熱的馬戲團裏，市值被追捧，沒有用處的狗狗\n幣，我們需要記住我們在這個領域的真正原因--看到圍繞加密貨幣的實際用例。\n我們在這個領域的真正原因--看到圍繞加密貨幣建立的實際用例。\n在這裏，大量的公共信息可以被廉價地存儲，...",
      "title": "真實世界的採用。印度政府正在使用Polygon/Matic對所有的COVID-19測試進行公開驗證!"
    }
  ],
  "title": "Real World Adoption: Indian Govt is using Polygon/Matic for public verification of all COVID-19 tests!",
  "created_utc": 1621316883,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In this hype mania circus where market caps are being chased around and dog coins with zero use cases pumping to ridiculous valuations, we need to remember why we are really in this space - to see actual use cases built around crypto, where large amounts of public information can be stored cheaply, securely on the blockchain and verified publicly.</p>\n\n<p>In this regard, the Maharashtra Government is using the Polygon public chain to track and trace COVID-19 tests. Its worth noting that the govt conducts around 30,000 COVID19 tests per day, and all of them are tracked publicly so that people can verify the records without any central authority </p>\n\n<p>Example: </p>\n\n<p>This is the link to a COVID19 test : </p>\n\n<p><a href=\"https://block.dmrr.mahaonline.gov.in/report?id=2e63e5ad7e1ae7f4fa8568e8cdb49dec4ac701f9469e7289ba84d1ddb2dc385b\">https://block.dmrr.mahaonline.gov.in/report?id=2e63e5ad7e1ae7f4fa8568e8cdb49dec4ac701f9469e7289ba84d1ddb2dc385b</a></p>\n\n<p>In the link, you can click on Verify button to get the complete blockchain audit.</p>\n\n<p>Then click on Public Audit Proof to see the blockchain txn where the data is written and read from the Polygon network:</p>\n\n<p><a href=\"https://explorer-mainnet.maticvigil.com/tx/0x3a337b32121f9781a24747208d1e866020944f729d12657ea3d2a3df27391c36/internal-transactions\">https://explorer-mainnet.maticvigil.com/tx/0x3a337b32121f9781a24747208d1e866020944f729d12657ea3d2a3df27391c36/internal-transactions</a></p>\n\n<p>This is made possible thanks to the scaling provided by Matic where it costs a fraction of a cent to make any transaction on the network. For 1 MATIC, over 10,000 records can be written to the network.</p>\n</div><!-- SC_ON -->",
  "score": 177,
  "permalink": "/r/CryptoCurrency/comments/nehoko/real_world_adoption_indian_govt_is_using/",
  "subreddit": "CryptoCurrency",
  "id": "nehoko",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590799674
}