{
  "author": "scottevil110",
  "the_new_excerpt": "...you see the entire market drop 10% in a half hour and your immediate reaction\nis to panic buy more.\n\nThere was a point in time where seeing everything plunge would have sent me into\na race to cut my losses and sell what I could, but I just found myself yelling\nat Coinbase for not doing my bank…",
  "original_created_utc": 1620679739,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "市場全体が30分で10％下落するのを見て、すぐに反応するのは\nパニックになって買い増しをしてしまう。\n\nすべてが急落するのを見て、私は損切りと可能な限りの売却に走ったかもしれません。\nしかし、私はただCoinbaseに叫んでいました。\nしかし、私は自分の銀行取引をしなかったCoinbaseに怒鳴ってしまいました。",
      "title": "あなたが強気であることがわかるのは、..."
    },
    {
      "locale": "zh",
      "the_new_excerpt": "...你看到整个市场在半小时内下跌10%，你的直接反应是\n是恐慌性地买入更多。\n\n有一个时间点，看到所有的东西都在暴跌，会让我陷入\n争分夺秒地减少损失，卖掉我可以卖的东西，但我发现自己在大骂\n骂Coinbase没有为我的银行服务...",
      "title": "你知道你是看涨的，当..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "...你看到整個市場在半小時內下跌10%，你的直接反應是\n是恐慌性地買入更多。\n\n有一個時間點，看到所有的東西都在暴跌，會讓我陷入\n爭分奪秒地減少損失，賣掉我可以賣的東西，但我發現自己在大罵\n罵Coinbase沒有爲我的銀行服務...",
      "title": "你知道你是看漲的，當..."
    }
  ],
  "title": "You know you're bullish when...",
  "created_utc": 1620736868,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>...you see the entire market drop 10% in a half hour and your immediate reaction is to panic buy more.</p>\n\n<p>There was a point in time where seeing everything plunge would have sent me into a race to cut my losses and sell what I could, but I just found myself yelling at Coinbase for not doing my bank transfer fast enough so that I could pick up some more ETH on the dip. All that happened without me really even analyzing it that much, which is admittedly not great and I need to look into that, but now that I&#39;m looking back a few minutes, I&#39;m realizing that&#39;s how confident I am in the long-term prospects of some of these coins.</p>\n</div><!-- SC_ON -->",
  "score": 155,
  "permalink": "/r/CryptoCurrency/comments/n9foso/you_know_youre_bullish_when/",
  "subreddit": "CryptoCurrency",
  "id": "n9foso",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985992424
}