{
  "author": "guywhofalls",
  "the_new_excerpt": "I don't concretely align myself with one party, and I am having difficulty\nunderstanding why Republicans do not like H.R.1. I understand it would reduce\nthe incidences of gerrymandering that republicans are notorious for, but I am\nunsure if there are any other reasons.\n\nI remember seeing Mitch…",
  "original_created_utc": 1619196490,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は特定の政党に所属しているわけではありませんが、なぜ共和党がH.R.1を好まないのか、理解に苦しみます。\n共和党がH.R.1を好まない理由を理解できません。共和党が苦手とするゲリマンダリングを減らすことができるのはわかりますが\n共和党が悪名高いゲリマンダリングの発生を抑えることができると理解していますが\nそれ以外の理由があるのかどうかはわかりません。\n\n私の記憶では、Mitch...",
      "title": "共和党はなぜH.R.1などの選挙資金改革を嫌うのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我没有具体地与某一党派结盟，而且我很难\n我很难理解为什么共和党人不喜欢H.R.1。我理解它将减少\n共和党人臭名昭著的选区划分事件，但我不确定这是否有任何意义。\n但我不确定是否有其他原因。\n\n我记得我看到米奇...",
      "title": "为什么共和党人不喜欢H.R.1和其他竞选财务改革？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我沒有具體地與某一黨派結盟，而且我很難\n我很難理解爲什麼共和黨人不喜歡H.R.1。我理解它將減少\n共和黨人臭名昭著的選區劃分事件，但我不確定這是否有任何意義。\n但我不確定是否有其他原因。\n\n我記得我看到米奇...",
      "title": "爲什麼共和黨人不喜歡H.R.1和其他競選財務改革？"
    }
  ],
  "title": "Why do republicans dislike H.R.1 and other campaign finance reformation?",
  "created_utc": 1619247928,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I don&#39;t concretely align myself with one party, and I am having difficulty understanding why Republicans do not like H.R.1. I understand it would reduce the incidences of gerrymandering that republicans are notorious for, but I am unsure if there are any other reasons.</p>\n\n<p>I remember seeing Mitch McConnell calling HR1 &quot;one big expensive partisan power grab&quot;. Obviously I know corruption is present on both sides, but what exactly does McConnell mean? And I guess going off of that, why are Republicans in general opposing Democrat led efforts to reform campaign financing?</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/Ask_Politics/comments/mwzkuo/why_do_republicans_dislike_hr1_and_other_campaign/",
  "subreddit": "Ask_Politics",
  "id": "mwzkuo",
  "is_self": true,
  "media": null,
  "is_video": false
}