{
  "author": "Addicted2sax",
  "the_new_excerpt": "In the past 1-2 trading months have shown strong reversal patterns for these\nthree miners and although,$SLSSF and $VALE were less pronounced\n\n$BHP, $FCX, $VALE& $RIO - Are among the world's largest miners in the world.\n\nSOLARIS RESOURCES INC (SLSSF)\n\nThough not as pronounced as others in the world…",
  "original_created_utc": 1617462831,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在过去的1-2个交易月中，这些都表现出了强烈的反转形态。\n三家矿企，虽然$SLSSF和$VALE不那么明显。\n\n$BHP，$FCX，$VALE&$RIO - 是世界上最大的矿商之一。\n\nSOLARIS RESOURCES INC (SLSSF)\n\n虽然不像世界上其他国家那样明显... ...",
      "title": "$SLSSF $BHP $FCX $VALE & $RIO - 矿商，特别是铜矿，正处于自己的牛市中!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在過去的1-2個交易月中，這些都表現出了強烈的反轉形態。\n三家礦企，雖然$SLSSF和$VALE不那麼明顯。\n\n$BHP，$FCX，$VALE&$RIO - 是世界上最大的礦商之一。\n\nSOLARIS RESOURCES INC (SLSSF)\n\n雖然不像世界上其他國家那樣明顯... ...",
      "title": "$SLSSF $BHP $FCX $VALE & $RIO - 礦商，特別是銅礦，正處於自己的牛市中!"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "過去1～2ヶ月の間に、これら3つの鉱山会社は強い反転パターンを示しています。\n過去1～2ヶ月の間に、これらの3つの鉱山会社は強い反転パターンを示しており、$SLSSFと$VALEはそれほど顕著ではありませんでした。\n\nBHP, $FCX, $VALE& $RIO - 世界最大の鉱山会社の一つです。\n\nソラリス・リソース社(SLSSF)\n\n世界の他の企業ほど顕著ではないが...。",
      "title": "SLSSF $BHP $FCX $VALE & $RIO - 鉱山、特に銅が強気の相場に!"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "過去1～2ヶ月の間に、これら3つの鉱山会社は強い反転パターンを示しています。\n過去1～2ヶ月の間に、これらの3つの鉱山会社は強い反転パターンを示しており、$SLSSFと$VALEはそれほど顕著ではありませんでした。\n\nBHP, $FCX, $VALE& $RIO - 世界最大の鉱山会社の一つです。\n\nソラリス・リソース社(SLSSF)\n\n世界の他の企業ほど顕著ではないが...。",
      "title": "SLSSF $BHP $FCX $VALE & $RIO - 鉱山、特に銅が強気の相場に!"
    }
  ],
  "title": "$SLSSF $BHP $FCX $VALE & $RIO - Miners specifically Copper are in a bull market of their own!",
  "created_utc": 1617468886,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In the past 1-2 trading months have shown strong reversal patterns for these three miners and although,$SLSSF and $VALE  were less pronounced </p>\n\n<p>$BHP, $FCX, $VALE&amp; $RIO - Are among the world&#39;s largest miners in the world.</p>\n\n<p>SOLARIS RESOURCES INC (SLSSF)</p>\n\n<p>Though not as pronounced as others in the world market, this miner is worth mentioning due     its promising <a href=\"https://www.solarisresources.com/projects/warintza/\">Warintza copper and gold project </a>in Ecuador. In the past 1 trading month it has   experienced exponential growth in value.It is also advancing a portfolio of copper and gold assets in the Americas, which includes: a high-grade resource with expansion and additional discovery potential at the Warintza; discovery potential on the grass-roots Tamarugo project in Chile and Capricho and Paco Orco projects in Peru; exposure to US$130M spending / 5-yrs through a farm-out agreement with Freeport-McMoRan on the Ricardo Project in Chile; and significant leverage to increasing copper prices through the 60%-interest in the development-stage La Verde joint-venture project with Teck Resources in Mexico.  </p>\n\n<p>BHP Group Ltd. (BHP)</p>\n\n<p>Revenue (TTM): $42.9 billion</p>\n\n<p>Net Income (TTM): $8.0 billion</p>\n\n<p>Market Cap: $137.2 billion</p>\n\n<p>1-Year Trailing Total Return: 9.9%</p>\n\n<p>Exchange: New York Stock Exchange</p>\n\n<p>BHP is an Australia-based international resources company. It explores and mines minerals, including coal, iron ore, gold, titanium, ferroalloys, nickel, and copper properties. It also offers petroleum exploration, production, and refining services. The company serves customers worldwide.</p>\n\n<p>Rio Tinto PLC (RIO)</p>\n\n<p>Revenue (TTM): $41.8 billion</p>\n\n<p>Net Income (TTM): $7.2 billion</p>\n\n<p>Market Cap: $79.8 billion</p>\n\n<p>1-Year Trailing Total Return: 21.0%</p>\n\n<p>Exchange: New York Stock Exchange</p>\n\n<p>Vale SA (VALE)</p>\n\n<p>Revenue (TTM): $34.7 billion</p>\n\n<p>Net Income (TTM): $1.3 billion</p>\n\n<p>Market Cap: $59.9 billion</p>\n\n<p>1-Year Trailing Total Return: -3.7%</p>\n\n<p>Exchange: New York Stock Exchange</p>\n\n<p>So, these miners - $BHP, $FCX, $RIO,  $VALE &amp; $SLSSF.</p>\n\n<p>I do like the iron ore play on steel and believe we will see elevated prices considerably above historic norms for the remainder of 2021.</p>\n\n<p>However, what I like more than iron ore are the metals that are going into smartphones, computers, and batteries for EV&#39;s and infrastructure.</p>\n\n<p>So, we have:</p>\n\n<p>$SLSSF - <a href=\"https://www.solarisresources.com/\">https://www.solarisresources.com/</a></p>\n\n<p>$BHP - <a href=\"https://www.bhp.com/our-businesses/\">https://www.bhp.com/our-businesses/</a></p>\n\n<p>$FCX - <a href=\"https://fcx.com/\">https://fcx.com/</a></p>\n\n<p>$RIO - <a href=\"https://www.riotinto.com/products\">https://www.riotinto.com/products</a></p>\n\n<p>$VALE - <a href=\"http://www.vale.com/EN/business/mining/Pages/default.aspx\">http://www.vale.com/EN/business/mining/Pages/default.aspx</a></p>\n\n<p>The increased demand of:</p>\n\n<p><strong>NICKEL</strong> - been on a tear since March lows <a href=\"https://www.investing.com/commodities/nickel-historical-data\">https://www.investing.com/commodities/nickel-historical-data - the price is more tied to stainless steel, but Battery Plays are driving speculation.</a></p>\n\n<p><strong>COPPER</strong> - The price of copper is believed to provide a reliable measure of economic health, as changes to copper prices can suggest global growth or an upcoming recession. With high volatility and strong liquidity, copper is attractive to traders. Copper spot price is affected by extraction and transportation costs, as well as supply and demand.</p>\n\n<p><strong>ZINC</strong> - sharp recovery since March lows, following all other metals - <a href=\"https://uszinc.com/services/lme-pricing/\">https://uszinc.com/services/lme-pricing/</a></p>\n\n<p><strong>ALUMINUM</strong> - recovery following other metals to new highs:</p>\n\n<p>Now the Confirmation Bias:</p>\n\n<p><strong>COPPER</strong></p>\n\n<p><a href=\"https://www.mining.com/copper-price-lifted-by-us-stimulus-china-inventory-squeeze/\">https://www.mining.com/copper-price-lifted-by-us-stimulus-china-inventory-squeeze/</a></p>\n\n<p>Copper prices rose on 8th Feb as optimism around a US stimulus raised hopes of higher demand for metals and a recovery in the world’s biggest economy.</p>\n\n<p>The copper price rose as much as 1.3% to $3.6745 ($8,100 a tonne) on the Comex market on Monday, with March delivery contracts back within shouting distance of multi-year highs hit early in January.</p>\n\n<p>The metal has rallied nearly 90% since the depth of the pandemic in March.</p>\n\n<p>Thinning inventories</p>\n\n<p>The rise in copper prices is underpinned by thinning inventories that pointed to higher demand for the industrial metal.</p>\n\n<p>“Inventories are still quite low on exchanges. That gives good indication that manufacturing demand for copper is present and that its not just a speculative story,” Nitesh Shah, an analyst at investment manager WisdomTree, <a href=\"https://www.nasdaq.com/articles/metals-copper-prices-lifted-by-inventory-squeeze-2021-02-08\">told Reuters.</a></p>\n\n<p>In China, the world’s top consumer, copper inventories normally accumulate in the run up to the Lunar New Year as businesses close for the week-long festivities.</p>\n\n<p>But this year, Chinese inventories have <a href=\"https://www.nasdaq.com/articles/metals-copper-prices-lifted-by-inventory-squeeze-2021-02-08\">dropped to near decade lows </a>on robust demand from factories, which are maintaining high operating rates due to shortened shutdown periods and tighter travel restrictions for workers.</p>\n\n<p>Meanwhile, effects of the <a href=\"https://www.mining.com/web/worlds-copper-mines-struggle-to-recover-from-covid-19-andy-home/\">coronavirus pandemic on copper supply</a> continues to be felt. In what was supposed to be a year of supply growth, global mined output during the first 10 months of 2020 were 0.5% lower compared to 2019 levels, according to the International Copper Study Group (ICSG).</p>\n\n<p>In Peru, the world’s second-biggest producer, copper output plunged 12.5% to 2.15 million tonnes in 2020, the country’s Energy and Mines Ministry said on <a href=\"https://www.mining.com/web/peru-reports-sharp-drop-in-2020-copper-production-due-to-pandemic/\">8th Feb</a>.</p>\n\n<p>Copper miners gain</p>\n\n<p>Despite copper prices hitting a slump in the second half of January, the world’s top copper producers have continued to rally this year after spectacular gains in 2020.</p>\n\n<p><strong>Shares of BHP, the largest publicly traded copper company</strong>, are up 6% year-to-date.</p>\n\n<p>Copper, like most commodities, has been a cyclical investment whose demand ebbs and flows with economic cycles. Traditionally, roughly half of all copper demand has come from new building construction and infrastructure, China has been the single biggest market by far. With many global economies in or entering recovery phases, cyclical demand is on the upswing. </p>\n\n<p>Green initiatives around the world offer a secular tailwind as well. The European Green Deal, President Joe Biden’s ambitious climate plan, and China’s target of carbon neutral by 2060 all point to increasing incremental demand for copper. </p>\n\n<p>Although mining stocks have in many cases quadrupled since their March 2020 lows, many names are still trading below their previous highs, and at a time when fundamentals are improving.</p>\n\n<p>Take <a href=\"https://www.barrons.com/quote/stock/fcx\">Freeport-McMoRan</a>, $FCX, a Phoenix-based company whose business is roughly 70% copper, 20% gold, and 10% other. The stock plummeted to $7 a share during the selloff last spring and has since recovered to a recent $30. But it is still about half what it was at previous highs of around $60 in early 2008 and 2011.  </p>\n\n<p>The big news on copper last month was regarding $RIO and the Mongolian situation.</p>\n\n<p>Feb 8 (Reuters) - Mongolia&#39;s government is seeking to cancel a deal with miner Rio Tinto to expand the OyuTolgoi copper mine in the Gobi Desert and replace it with a new agreement, the Financial Times reported.</p>\n\n<p><a href=\"https://www.miningweekly.com/article/mongolia-seeks-more-tax-revenue-from-rio-copper-mine-expansion--source-2021-02-09/rep_id:3650\">https://www.miningweekly.com/article/mongolia-seeks-more-tax-revenue-from-rio-copper-mine-expansion--source-2021-02-09/rep_id:3650</a></p>\n\n<p>Many thought this was potentially bad news for $RIO, but it appears it&#39;s about working out a little more tax dollars for the government and a deal will be struck.</p>\n\n<p><strong>The underground expansion will push annual production to nearly 500,000 tonnes per year, making it among the world’s biggest copper mines</strong></p>\n\n<p>Global copper demand</p>\n\n<p>As mentioned above, it’s not likely that copper demand will slow down in 2021.</p>\n\n<p>In the US, new home and home renovation demand spiked since the pandemic started, along with electronics demand. Analysts at CitiBank expect the copper market to shift into a deficit in the second half of the year with a minor surplus overall for 2021, Reuters reported. They also forecast deficits in 2022 and 2023.</p>\n\n<p>The US Census Bureau and the US Department of Housing and Urban Development reported building permits in December increased by 4.5% compared to November and 17.3% above the December 2019 rate. Privately owned housing continued to increase in December, rising by 5.8% from the previous month and by 5.2% compared to December 2019. The uptrend started in September 2020.</p>\n\n<p>China will continue to play an important role in the copper market. The country accounts for about half of global primary consumption, which is then used to manufacture export goods.</p>\n\n<p>According to the aforementioned Reuters report, appliances output also increased in China. Similarly, China’s refrigerators exports went up by 45% in December 2020 compared to December 2019. During the same period, exports of microwave ovens rose by 35%.</p>\n\n<p>Indonesian copper smelter</p>\n\n<p>Indonesian politician Luhut Pandjaitan, said Freeport-McMoRan, $FCX and Tsingshan Holding Group reached a $2.8 billion deal to build a copper smelter in Indonesia’s Weda Bay. The smelter would process copper concentrate from the Grasberg mine. Luhut did not report a timeline, per the report.</p>\n\n<p>“The smelter will produce copper pipes and wires of which output can be worth $10 billion or more,” the minister reportedly told IDX Channel. The smelter will aim to produce copper products to be used in lithium battery components. Indonesia is working to build an electric vehicle supply chain, as it is also a major nickel producer.<br/>\n<strong>A reminder:</strong> I am not a personal financial advisor, please do your own research. I’m only a value investor and I like to find value where others shy away from and commodities are the red-headed step child that I believe will shine in 2021 for all the reasons I have laid out here.</p>\n</div><!-- SC_ON -->",
  "score": 201,
  "permalink": "/r/stocks/comments/mjaf5j/slssf_bhp_fcx_vale_rio_miners_specifically_copper/",
  "subreddit": "stocks",
  "id": "mjaf5j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961878981
}