{
  "author": "Suglet",
  "original_created_utc": 1626695662,
  "title": "Why are people actually happy about being able to work from home?",
  "created_utc": 1626705068,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I don&#39;t understand it so help me out. I hate working from home, I get genuinely depressed. I need get out of my house, have a reason to see people, interact, and be outside. </p>\n\n<p>Being able to commute, be out in the city gives me reason to just be outdoors and see the world, no matter how banal it can be. I don&#39;t want to restrict that to time where I don&#39;t work (weekend) </p>\n\n<p>Obviously it&#39;s necessary during these times, but people seem to want to stay that way. Why?</p>\n\n<p>Edit: Maybe I should have posted this in <a href=\"/r/unpopularopinion\">r/unpopularopinion</a>. I&#39;d like to clarify things for people that seem slightly offended. I don&#39;t wish for people who like working from home, to have to go to work. I had to work from home in 2020, luckily this year I haven&#39;t, so I&#39;m fine. If everyone wants to continue to stay at home working, I&#39;m not against that. For me at that time working from home was miserable and I hated it. I was just curious how people feel about it. </p>\n\n<p>To the few people kind enough to pm me with slurs, I apologize if I hurt you with my question.</p>\n\n<p>Edit 2: Reading everyone&#39;s comments has been truly interesting, and I definitely see how it all comes down to circumstances and the different situations we all are in. </p>\n\n<p>One thing I&#39;d like to mention, I keep seeing how people think I&#39;m an extrovert or people lover. Funny enough it&#39;s the opposite! I don&#39;t like people just as much as everyone else claiming to hate humanity. Importantly I like separating work life and home life, and it&#39;s hard to do  when I&#39;m working at home. I like being in this space where I never have to think about work. A buffer, a gap, a space in-between those two things. </p>\n\n<p>I hope that everyone can get the work environment they thrive in best!</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/TooAfraidToAsk/comments/oncjlg/why_are_people_actually_happy_about_being_able_to/",
  "subreddit": "TooAfraidToAsk",
  "id": "oncjlg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I don't understand it so help me out. I hate working from home, I get genuinely\ndepressed. I need get out of my house, have a reason to see people, interact,\nand be outside.\n\nBeing able to commute, be out in the city gives me reason to just be outdoors\nand see the world, no matter how banal it can…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "理解できないので、助けてください。私は自宅で仕事をするのが嫌いで、純粋に落ち込んでしまいます。\n憂鬱になります。家から出て、人と会い、交流する理由が必要です。\n外に出る必要があります。\n\n通勤して都会に出ることができれば、屋外に出て世界を見る理由ができます。\nどんなに平凡な世界であっても、外に出て世界を見る理由になります。",
      "title": "実際に在宅勤務ができることを喜ぶ人がいるのはなぜか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不明白，请帮助我。我讨厌在家工作，我真的很沮丧。\n郁闷。我需要走出家门，有理由去见人，去交流。\n并到外面去。\n\n能够通勤，在城市里，让我有理由在户外活动\n看看这个世界，不管它有多平庸......",
      "title": "为什么人们对能够在家工作其实很高兴？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不明白，請幫助我。我討厭在家工作，我真的很沮喪。\n鬱悶。我需要走出家門，有理由去見人，去交流。\n併到外面去。\n\n能夠通勤，在城市裏，讓我有理由在戶外活動\n看看這個世界，不管它有多平庸......",
      "title": "爲什麼人們對能夠在家工作其實很高興？"
    }
  ]
}