{
  "author": "Ecstatic-Welcome-564",
  "original_created_utc": 1637091301,
  "title": "Do pornstars in BDSM videos have the ability to stop the video when things get to extreme for them?",
  "created_utc": 1637098099,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m very vanilla in my sex life and in the porn that I view, and while I do have kinks, they often involve crossdressing, post orgasm/orgasm denial, etc sometimes I like to look for new stuff, and I see these videos of women being tied u, spanked, electrocuted, whipped or having their clit tortured with pins or clamps etc, with a gag in their mouth and without the use of their hands and I guess I kinda, got lost into thinking how will they signal that they want the video to end or for a break with a physical signal or a safeword. I understand that there are people who enjoy pain and stuff like that but I&#39;m sure everyone has their limits, possibly?</p>\n\n<p>I&#39;m so sorry if this is rude or anything, there is no kink shaming here or anything like that, I&#39;m just super curious. Thank you!</p>\n</div><!-- SC_ON -->",
  "score": 158,
  "permalink": "/r/TooAfraidToAsk/comments/qvg1aq/do_pornstars_in_bdsm_videos_have_the_ability_to/",
  "subreddit": "TooAfraidToAsk",
  "id": "qvg1aq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm very vanilla in my sex life and in the porn that I view, and while I do have\nkinks, they often involve crossdressing, post orgasm/orgasm denial, etc\nsometimes I like to look for new stuff, and I see these videos of women being\ntied u, spanked, electrocuted, whipped or having their clit tortured…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は自分の性生活や見るAVがとてもバニラで、変態性はありますが\n女装やオーガズム後の拒否などの変態行為もあります。\n時々、新しいものを探すのが好きで、女性が縛られたり、お尻を叩かれたり、電気を流されたりするビデオを見ることがあります。\n縛られたり、お尻を叩かれたり、感電したり、ムチで打たれたり、クリトリスを責められたり...。",
      "title": "BDSMビデオに出演しているAV女優は、自分にとって過激な状況になるとビデオを止めることができますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在我的性生活和我所看的色情片中，我是非常虚荣的，虽然我也有一些癖好。\n虽然我有一些癖好，但它们通常涉及变装、高潮后/拒绝高潮等。\n有时，我喜欢寻找新的东西，我看到这些视频中的女人被绑起来，被打屁股，被强迫性交。\n我喜欢寻找新的东西，我看到这些视频中的女人被捆绑、打屁股、电击、鞭打或折磨她们的阴蒂......",
      "title": "BDSM视频中的色情明星是否有能力在事情变得极端时停止视频？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在我的性生活和我所看的色情片中，我是非常虛榮的，雖然我也有一些癖好。\n雖然我有一些癖好，但它們通常涉及變裝、高潮後/拒絕高潮等。\n有時，我喜歡尋找新的東西，我看到這些視頻中的女人被綁起來，被打屁股，被強迫性交。\n我喜歡尋找新的東西，我看到這些視頻中的女人被捆綁、打屁股、電擊、鞭打或折磨她們的陰蒂......",
      "title": "BDSM視頻中的色情明星是否有能力在事情變得極端時停止視頻？"
    }
  ]
}