{
  "author": "CryptoSorted",
  "original_created_utc": 1636607566,
  "title": "Here's why even large cap coins will still give you that 10x to 100x",
  "created_utc": 1636619450,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Most people believe that large cap coins like BTC and ETH cannot give you those coveted 10x to 100x gains anymore.</p>\n\n<p>If you think so, then here&#39;s what you need to know. </p>\n\n<p>The entire crypto marketcap is just about $3 trillion right now.</p>\n\n<p>A 10x from here would put the global crypto marketcap at over $30 trillion which we both know is highly feasible. I&#39;m confident this will happen within the next 5 years.</p>\n\n<p>Also, most of this new money will flow into the large and medium caps as people learn to mostly invest in the relatively secure assets or take profit from the shitcoins and low cap coins investment and dump it in large caps.</p>\n\n<p>If $50 trillion enters the crypto market in the next 10 to 20 years even BTC will give you at least 10x to 15x.</p>\n\n<p>The point is, further gains on the current large cap coins is only limited by the inflow of new money into the crypto economy and we know that the show hasn&#39;t even started yet.</p>\n</div><!-- SC_ON -->",
  "score": 234,
  "permalink": "/r/CryptoCurrency/comments/qrdm0f/heres_why_even_large_cap_coins_will_still_give/",
  "subreddit": "CryptoCurrency",
  "id": "qrdm0f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Most people believe that large cap coins like BTC and ETH cannot give you those\ncoveted 10x to 100x gains anymore.\n\nIf you think so, then here's what you need to know.\n\nThe entire crypto marketcap is just about $3 trillion right now.\n\nA 10x from here would put the global crypto marketcap at over $30…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ほとんどの人は、BTCやETHのような大型コインでは、それらの魅力を引き出すことはできないと考えています。\n10倍から100倍の利益を得ることはできないと考えています。\n\nもしそう思っているなら、ここで知っておくべきことがあります。\n\n暗号のマーケットキャップ全体は、今、ちょうど3兆ドルほどです。\n\nここから10倍になれば、世界の暗号マーケットキャップは30ドル以上になります...",
      "title": "大型コインでも10倍から100倍になる理由はここにあります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大多数人认为，像BTC和ETH这样的大盘币不能给你带来那些\n梦寐以求的10倍到100倍收益了。\n\n如果你这么认为，那么你需要知道的是。\n\n现在整个加密货币的市值只有大约3万亿美元。\n\n从这里开始的10倍将使全球加密货币的市值超过30美元...",
      "title": "以下是为什么即使是大盘币也会给你带来10倍到100倍的收益的原因"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大多數人認爲，像BTC和ETH這樣的大盤幣不能給你帶來那些\n夢寐以求的10倍到100倍收益了。\n\n如果你這麼認爲，那麼你需要知道的是。\n\n現在整個加密貨幣的市值只有大約3萬億美元。\n\n從這裏開始的10倍將使全球加密貨幣的市值超過30美元...",
      "title": "以下是爲什麼即使是大盤幣也會給你帶來10倍到100倍的收益的原因"
    }
  ]
}