{
  "author": "zabutter",
  "original_created_utc": 1640066797,
  "title": "Gave my grandad a orange pill",
  "created_utc": 1640091486,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Just orange pilled my 90 year old grand dad, if it wasn&amp;#39;t for the terminology of this space he would have understood better, but where I got him to ask, &amp;quot;why don&amp;#39;t everyone invest in it?&amp;quot;, was when I explained the ROI against Gold and the S&amp;amp;P, which is quite mental if you ask me. I only explained to him at a 2 year growth, how he can invest $100 and return around $2000 in a time span of 2 - 3 years.&lt;/p&gt;\n\n&lt;p&gt;Well he&amp;#39;s ready to invest $100.&lt;/p&gt;\n\n&lt;p&gt;He asked, &amp;quot;why does so many people not know about this that you are telling me&amp;quot; , I told him most people are afraid to learn about something they know nothing about. He then added that I was lucky to have realised all this about Bitcoin so early, and he&amp;#39;s proud of me.&lt;/p&gt;\n\n&lt;p&gt;My grandad is very open minded. Smoked weed with me the first time in his life at 87 y/o.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 161,
  "permalink": "/r/Bitcoin/comments/rl7vr2/gave_my_grandad_a_orange_pill/",
  "subreddit": "Bitcoin",
  "id": "rl7vr2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Just orange pilled my 90 year old grand dad, if it wasn't for the terminology of\nthis space he would have understood better, but where I got him to ask, \"why\ndon't everyone invest in it?\", was when I explained the ROI against Gold and the\nS&P, which is quite mental if you ask me. I only explained…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "90歳の祖父をオレンジ色に染めただけで、用語がなければ\nこの空間ならもっと理解してもらえたと思うのですが、「なぜ？\nみんな投資しないの？」と聞かれたので、金や株価に対するROIを説明しました。\nS&Pは、私に言わせれば、かなり精神的なものです。私が説明したのは...",
      "title": "おじいちゃんにオレンジの錠剤をあげました"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果不是因为这个空间的术语，他可能会更好地理解我的90岁的祖父。\n如果不是这个空间的术语，他可能会更好地理解，但我让他问，\"为什么每个人都不投资？\n我让他问，\"为什么不是每个人都投资于它？\"，是在我解释对黄金和标准普尔的投资回报率时。\n标准普尔，如果你问我，这是很精神的。我只解释了...",
      "title": "给我爷爷吃了一颗橙色药丸"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果不是因爲這個空間的術語，他可能會更好地理解我的90歲的祖父。\n如果不是這個空間的術語，他可能會更好地理解，但我讓他問，\"爲什麼每個人都不投資？\n我讓他問，\"爲什麼不是每個人都投資於它？\"，是在我解釋對黃金和標準普爾的投資回報率時。\n標準普爾，如果你問我，這是很精神的。我只解釋了...",
      "title": "給我爺爺吃了一顆橙色藥丸"
    }
  ]
}