{
  "author": "Mundanewisdom99",
  "original_created_utc": 1638242254,
  "title": "How to get free crypto?",
  "created_utc": 1638254421,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m a student in a shitty third world country. The pay here is around $100 a month, and on top of that as a student it&#39;s impossible to find a job. Before my college started, I worked for about 2 months and got $250. I have decided to invest that into crypto.</p>\n\n<p>Now I&#39;m looking for a way to earn more money, so that I can invest more. I looked at some old posts and most of the comments said that the best and efficient way is by being active on this subreddit. I&#39;ve heard that guys here earn hundreds of dollars a month just by posting and commenting on this subreddit. That would be better than getting a job for me. I want your advice guys. How do I do it?</p>\n\n<p>And I&#39;m pretty sure there are people who are in a similar situation as I am in. I want to hear from you guys about your experience with this.</p>\n</div><!-- SC_ON -->",
  "score": 239,
  "permalink": "/r/CryptoCurrency/comments/r5dce0/how_to_get_free_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "r5dce0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm a student in a shitty third world country. The pay here is around $100 a\nmonth, and on top of that as a student it's impossible to find a job. Before my\ncollege started, I worked for about 2 months and got $250. I have decided to\ninvest that into crypto.\n\nNow I'm looking for a way to earn more…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、クソみたいな第三世界の国で学生をしています。ここでの給料は月に100ドル程度。\nその上、学生である私が仕事を見つけるのは不可能です。大学が始まる前\n大学が始まる前に、2ヶ月ほど働いて250ドルもらったことがあります。私はそれを暗号に投資することにしました。\nそのお金を暗号に投資することにしました。\n\n今はもっと稼げる方法を探しています。",
      "title": "無料でcryptoを入手するには？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一名学生，在一个糟糕的第三世界国家。这里的工资大约是每月100美元。\n此外，作为一个学生，不可能找到工作。在我上大学之前\n在我上大学之前，我工作了大约两个月，得到了250美元。我已经决定\n将其投资于加密货币。\n\n现在我正在寻找一种方法来赚取更多...",
      "title": "如何获得免费的加密货币？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一名學生，在一個糟糕的第三世界國家。這裏的工資大約是每月100美元。\n此外，作爲一個學生，不可能找到工作。在我上大學之前\n在我上大學之前，我工作了大約兩個月，得到了250美元。我已經決定\n將其投資於加密貨幣。\n\n現在我正在尋找一種方法來賺取更多...",
      "title": "如何獲得免費的加密貨幣？"
    }
  ]
}