{
  "author": "monamikonami",
  "original_created_utc": 1637128910,
  "title": "The crypto market dipped 10% today. Can anyone explain to me WHY?",
  "created_utc": 1637166811,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>More than any other investment, I find crypto&#39;s dips and moons to be less tied to real world events. If the stock market or real estate market crash, there is usually a very easily identifiable real-world reason. You just need to open the news and check the headlines.</p>\n\n<p>But with crypto I find that the market is disconnected from real world events. China bans crypto? No effect up or down. Normal Tuesday? Market plunges 10%.</p>\n\n<p>With this in mind, was there an actual reason why the crypto market plunged today? I can&#39;t see any particular reason why it happened today or what events or news it was connected to.</p>\n\n<p><em>EDIT: Lol this sub is so trash. 75 comments only 1 or 2 actual attempts to really discuss what happened yesterday. Everything else is eye-rolling moon-farming attempts.</em></p>\n</div><!-- SC_ON -->",
  "score": 273,
  "permalink": "/r/CryptoCurrency/comments/qvsk3a/the_crypto_market_dipped_10_today_can_anyone/",
  "subreddit": "CryptoCurrency",
  "id": "qvsk3a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "More than any other investment, I find crypto's dips and moons to be less tied\nto real world events. If the stock market or real estate market crash, there is\nusually a very easily identifiable real-world reason. You just need to open the\nnews and check the headlines.\n\nBut with crypto I find that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "他のどの投資よりも、暗号のディップやムーンは、現実世界の出来事との結びつきが弱いと感じています。\n現実世界の出来事との関連性は低いと思います。株式市場や不動産市場が暴落した場合、たいていの場合、現実世界での理由を簡単に特定することができます。\n株式市場や不動産市場が暴落した場合、通常は簡単に特定できる現実世界の理由があります。ニュースを開いて見出しをチェックするだけでいいのです。\nニュースを見て、見出しをチェックするだけです。\n\nしかし、暗号の場合は...。",
      "title": "今日の暗号市場は10％下落しました。誰か理由を説明してくれませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "比起其他任何投资，我发现加密货币的跌宕起伏与现实世界事件的联系更少\n与现实世界的事件有关。如果股票市场或房地产市场崩溃，通常有一个非常容易识别的现实世界的原因。\n通常有一个非常容易识别的现实世界的原因。你只需要打开\n新闻并查看头条新闻。\n\n但对于加密货币，我发现...",
      "title": "今天加密货币市场下跌了10%。谁能向我解释一下原因？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "比起其他任何投資，我發現加密貨幣的跌宕起伏與現實世界事件的聯繫更少\n與現實世界的事件有關。如果股票市場或房地產市場崩潰，通常有一個非常容易識別的現實世界的原因。\n通常有一個非常容易識別的現實世界的原因。你只需要打開\n新聞並查看頭條新聞。\n\n但對於加密貨幣，我發現...",
      "title": "今天加密貨幣市場下跌了10%。誰能向我解釋一下原因？"
    }
  ]
}