{
  "author": "sylsau",
  "original_created_utc": 1642771934,
  "title": "If you're not a trader, there's no point in spending your day watching the price of Bitcoin. Move on to something more productive.",
  "created_utc": 1642790243,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The price of Bitcoin has fallen back below $40K and is currently around $38.5K.&lt;/p&gt;\n\n&lt;p&gt;Extreme fear is still prevalent in the market, and some people will still waste their day watching the Bitcoin price constantly.&lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re in the Bitcoin world for the long haul, and you&amp;#39;ve chosen to be a HODLer, you&amp;#39;d better put the Bitcoin price aside and move on to something more productive.&lt;/p&gt;\n\n&lt;p&gt;Specifically, if you&amp;#39;re not a trader, there&amp;#39;s no point in putting yourself through this all day. The market is red, but the fundamentals of Bitcoin keep getting stronger.&lt;/p&gt;\n\n&lt;p&gt;The best thing to do is to continue to focus on the long term. Move on and get ready to have a relaxed weekend away from the price of Bitcoin.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;PS: If you&amp;#39;re a trader, good luck to you in finding sleep in the coming days :P&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 307,
  "permalink": "/r/Bitcoin/comments/s9atbf/if_youre_not_a_trader_theres_no_point_in_spending/",
  "subreddit": "Bitcoin",
  "id": "s9atbf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The price of Bitcoin has fallen back below $40K and is currently around $38.5K.\n\nExtreme fear is still prevalent in the market, and some people will still waste\ntheir day watching the Bitcoin price constantly.\n\nIf you're in the Bitcoin world for the long haul, and you've chosen to be a\nHODLer,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコインの価格は40Kドルを割り込み、現在38.5Kドル前後となっています。\n\n市場にはまだ極端な恐怖が蔓延しており、一部の人々はまだ無駄なこと\nビットコインの価格を常に見ながら一日を過ごす。\n\nもし、あなたがビットコインの世界に長期滞在し、そして、あなたが選択したのが\nHODLer、、、。",
      "title": "トレーダーでなければ、ビットコインの価格を見ながら一日を過ごす意味はない。もっと生産的なことに移ってください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "比特币的价格已经回落到40K美元以下，目前在38.5K美元左右。\n\n极端的恐惧在市场上仍然盛行，一些人仍然会浪费一天的时间不断地观察比特币的价格。\n他们每天都在不停地观察比特币的价格。\n\n如果你在比特币世界里是长期的，而且你选择了做一个\nHODLer，...",
      "title": "如果你不是一个交易员，没有必要整天盯着比特币的价格。转移到更有成效的事情上。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "比特幣的價格已經回落到40K美元以下，目前在38.5K美元左右。\n\n極端的恐懼在市場上仍然盛行，一些人仍然會浪費一天的時間不斷地觀察比特幣的價格。\n他們每天都在不停地觀察比特幣的價格。\n\n如果你在比特幣世界裏是長期的，而且你選擇了做一個\nHODLer，...",
      "title": "如果你不是一個交易員，沒有必要整天盯着比特幣的價格。轉移到更有成效的事情上。"
    }
  ]
}