{
  "author": "takashiithrowaway453",
  "the_new_excerpt": "The food is extra spicy curry and rice (Japanese style). 99% of the time, it's\nfrom this one place. I have it pretty much every day and when I wake up I an\neager for the shop to open so I can order some.. I always warm it up in the\nmicrowave so it's piping hot, it also makes the curry seem even…",
  "original_created_utc": 1615267739,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "食物是特辣咖喱饭（日式）。99%的时间，都是\n从这一个地方。我几乎每天都有，当我醒来的时候，我就...\n渴望店面开张，这样我就可以订购一些... ... 我总是把它热起来\n微波炉加热，所以它是热的，它也使咖喱看起来甚至... ...",
      "title": "我很郁闷 我每天只盼着吃自己喜欢的食物，是不是很傻？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "食物是特辣咖喱飯（日式）。99%的時間，都是\n從這一個地方。我幾乎每天都有，當我醒來的時候，我就...\n渴望店面開張，這樣我就可以訂購一些... ... 我總是把它熱起來\n微波爐加熱，所以它是熱的，它也使咖喱看起來甚至... ...",
      "title": "我很鬱悶 我每天只盼着喫自己喜歡的食物，是不是很傻？"
    }
  ],
  "title": "I'm depressed. Is it silly of me to only look forward to eating my favorite food every day?",
  "created_utc": 1615321291,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The food is extra spicy curry and rice (Japanese style). 99% of the time, it&#39;s from this one place. I have it pretty much every day and when I wake up I an eager for the shop to open so I can order some.. I always warm it up in the microwave so it&#39;s piping hot, it also makes the curry seem even hotter. Sometimes I dream of it. It&#39;s not the only food I eat of course, I like other things too.. but it&#39;s my favorite comfort food that makes me feel a little glimmer of happiness when I eat it, and I feel like I should live another day just so I can order curry rice from this one place and eat it..I feel sad on Sundays, which is when this place is closed. </p>\n\n<p>Just wondering, is this silly? I don&#39;t get satisfaction out of doing nearly anything anymore.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/NoStupidQuestions/comments/m0zppx/im_depressed_is_it_silly_of_me_to_only_look/",
  "subreddit": "NoStupidQuestions",
  "id": "m0zppx",
  "is_self": true,
  "media": null,
  "is_video": false
}