{
  "author": "supernovalover",
  "original_created_utc": 1630102598,
  "title": "I am ashamed to have this thought, but is it wrong of me to think that we should deny anti-vaxxers medical care in hospital so people who took precautions and have deadly diseases (like cancer) can have actual proper care?",
  "created_utc": 1630120634,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I know this might be cruel, and I don’t want any harm to come to anybody, but it just makes me so angry that people who took the vaccine but have other deadly illnesses have to go home early because antivaxxers suddenly need care because they didn’t take the vaccine.</p>\n</div><!-- SC_ON -->",
  "score": 114,
  "permalink": "/r/TooAfraidToAsk/comments/pcxfhn/i_am_ashamed_to_have_this_thought_but_is_it_wrong/",
  "subreddit": "TooAfraidToAsk",
  "id": "pcxfhn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I know this might be cruel, and I don’t want any harm to come to anybody, but it\njust makes me so angry that people who took the vaccine but have other deadly\nillnesses have to go home early because antivaxxers suddenly need care because\nthey didn’t take the vaccine.",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "残酷なことかもしれませんが、誰にも危害を加えてほしくないのですが\nワクチンを接種したものの、他の致命的な病気にかかってしまった人が、反ワクチン主義者のせいで急にケアが必要になり\nワクチンを打たなかったからといって、反ワクチン主義者が急に治療を必要としたために、他の致命的な病気にかかった人たちが早く帰らなければならないことに腹が立ちます。\nワクチンを打たなかったからといって、反ワクチン派が突然治療を必要とするからです。",
      "title": "こんなことを考えるのは恥ずかしいのですが、予防措置をとっていたのに致命的な病気（癌など）になってしまった人たちが実際に適切な治療を受けられるように、アンチワクチン派の人たちの病院での治療を拒否すべきだと考えるのは、私の考え違いでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道这可能很残酷，我也不希望任何人受到伤害，但这让我感到非常愤怒。\n但这让我非常生气，因为那些接种了疫苗但有其他致命疾病的人不得不去接受治疗。\n因为反疫苗者突然需要照顾，因为他们没有接种疫苗，所以不得不提前回家。\n他们没有接种疫苗。",
      "title": "我为有这样的想法感到羞愧，但我认为我们应该拒绝让反免疫者在医院接受医疗服务，以便那些采取了预防措施并患有致命疾病（如癌症）的人能够得到实际的适当护理，这样的想法是否有错？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道這可能很殘酷，我也不希望任何人受到傷害，但這讓我感到非常憤怒。\n但這讓我非常生氣，因爲那些接種了疫苗但有其他致命疾病的人不得不去接受治療。\n因爲反疫苗者突然需要照顧，因爲他們沒有接種疫苗，所以不得不提前回家。\n他們沒有接種疫苗。",
      "title": "我爲有這樣的想法感到羞愧，但我認爲我們應該拒絕讓反免疫者在醫院接受醫療服務，以便那些採取了預防措施並患有致命疾病（如癌症）的人能夠得到實際的適當護理，這樣的想法是否有錯？"
    }
  ]
}