{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "The narrative here lately is that valuations are crazy even amongst the big tech and this is a major bubble we are in and we should expect a correction up to the 50% etc.\n\nWell, if we simply look from an earnings estimates perspective and compare this to these companies' past, it doesn't look overvalued mostly.\n\nThese earnings growth estimates are just estimates that's for sure, but not unachievable.\n\nI've used the estimates from Finviz and compared them to their past PE data gathered from Macrotrends.\n\n**Google**\n\nCurrently sitting at 25 PE, which is expected to drop more after the earnings announcement. When I look at the average for Google in the last 14 years, this number seems to be the average and even closer to the bottom in the last 5 years. Google's earnings have grown 21% on average in the last 5 years, and are expected to continue growing at the same pace for the next 5 years.\n\n**Facebook**\n\nI know the hate amongst Facebook well enough, but wherever you look from it, this stock is cheap.  Currently sitting at 21 PE which is the cheapest ever Facebook's stock ever been other than the 2008 crisis. The company has grown on an annual 50% growth rate for the last 5 years and is expected to continue its growth at 22% for the next five years. Also, I see a huge potential for Oculus brand. It's currently the best VR in the market by far and I do believe it is the finally the VR people have been expecting for years; it doesn't require a computer to run nor any cables.\n\n**Amazon**\n\nAmazon also sitting at its lowest PE ever (54) for the last 20 or more years, and grown at 101% annual growth rate in the last 5 years. But for the next 5 years, Amazon is expected to grow at a 36% growth rate. It still looks a bit expensive purely looking at these numbers but we all know Amazon is investing into so many different areas and can catch unexpected opportunities for faster growth.\n\n**AMD**\n\nThis one is my favorite. AMD's earnings have grown 35% on average in the last 5 years, and are expected to keep growing at 39% for the next 5 years. And compared to this, its PE is only 31. This is also the lowest AMD's PE has ever been.\n\n**NVIDIA**\n\nNvidia has similar earnings growth rates compared to AMD (past 5 years 45%, next 5 years expected 39%). However, its PE ratio is sitting at 68, which is almost the most expensive NVDA has ever been.\n\n**APPLE**\n\nApple is at 29 PE, which is historically quite high for Apple and is expected to grow only at 15% for the next 5 years (last 5 years was 22%). I don't think Apple is cheap, however, I do think investors like the balance sheet of Apple too much. No one know what might Apple lead into next, home electronics, EV, healthcare or smart home, which makes Apple's stock pricier. Also as a famous value investor, Warren Buffett is still all-in on Apple.\n\n**MICROSOFT**\n\nPeople usually compare Microsoft PE with its past average, which was about 12 PE for almost 10 years, and it's currently sitting at 34 PE. But what people forget is in that 8-10 year period, Microsoft's EPS **almost had zero growth**. Only in the last 5 years Microsoft started to grow and at a great pace of 26% annually. However, analysts expect this to fall into 17% annually for the next 5 years, so Microsoft's stock still looks pricey compared to its peers. I don't think it is cheap but I think this price comes from the mistrust against these expected growth numbers because of Microsoft's potential.\n\n&amp;#x200B;\n\nSo what do you think? Do you expect Google's PE to fall to 12? Or AMD into 15 while expecting this pace of growth?",
  "author_fullname": "t2_5whz3",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Is Big Tech Really Overvalued?",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_set0lg",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.83,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 44,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 44,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": 1643383180,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1643382844,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": true,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The narrative here lately is that valuations are crazy even amongst the big tech and this is a major bubble we are in and we should expect a correction up to the 50% etc.&lt;/p&gt;\n\n&lt;p&gt;Well, if we simply look from an earnings estimates perspective and compare this to these companies&amp;#39; past, it doesn&amp;#39;t look overvalued mostly.&lt;/p&gt;\n\n&lt;p&gt;These earnings growth estimates are just estimates that&amp;#39;s for sure, but not unachievable.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve used the estimates from Finviz and compared them to their past PE data gathered from Macrotrends.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Google&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Currently sitting at 25 PE, which is expected to drop more after the earnings announcement. When I look at the average for Google in the last 14 years, this number seems to be the average and even closer to the bottom in the last 5 years. Google&amp;#39;s earnings have grown 21% on average in the last 5 years, and are expected to continue growing at the same pace for the next 5 years.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Facebook&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I know the hate amongst Facebook well enough, but wherever you look from it, this stock is cheap.  Currently sitting at 21 PE which is the cheapest ever Facebook&amp;#39;s stock ever been other than the 2008 crisis. The company has grown on an annual 50% growth rate for the last 5 years and is expected to continue its growth at 22% for the next five years. Also, I see a huge potential for Oculus brand. It&amp;#39;s currently the best VR in the market by far and I do believe it is the finally the VR people have been expecting for years; it doesn&amp;#39;t require a computer to run nor any cables.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Amazon&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Amazon also sitting at its lowest PE ever (54) for the last 20 or more years, and grown at 101% annual growth rate in the last 5 years. But for the next 5 years, Amazon is expected to grow at a 36% growth rate. It still looks a bit expensive purely looking at these numbers but we all know Amazon is investing into so many different areas and can catch unexpected opportunities for faster growth.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;AMD&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;This one is my favorite. AMD&amp;#39;s earnings have grown 35% on average in the last 5 years, and are expected to keep growing at 39% for the next 5 years. And compared to this, its PE is only 31. This is also the lowest AMD&amp;#39;s PE has ever been.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;NVIDIA&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Nvidia has similar earnings growth rates compared to AMD (past 5 years 45%, next 5 years expected 39%). However, its PE ratio is sitting at 68, which is almost the most expensive NVDA has ever been.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;APPLE&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Apple is at 29 PE, which is historically quite high for Apple and is expected to grow only at 15% for the next 5 years (last 5 years was 22%). I don&amp;#39;t think Apple is cheap, however, I do think investors like the balance sheet of Apple too much. No one know what might Apple lead into next, home electronics, EV, healthcare or smart home, which makes Apple&amp;#39;s stock pricier. Also as a famous value investor, Warren Buffett is still all-in on Apple.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;MICROSOFT&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;People usually compare Microsoft PE with its past average, which was about 12 PE for almost 10 years, and it&amp;#39;s currently sitting at 34 PE. But what people forget is in that 8-10 year period, Microsoft&amp;#39;s EPS &lt;strong&gt;almost had zero growth&lt;/strong&gt;. Only in the last 5 years Microsoft started to grow and at a great pace of 26% annually. However, analysts expect this to fall into 17% annually for the next 5 years, so Microsoft&amp;#39;s stock still looks pricey compared to its peers. I don&amp;#39;t think it is cheap but I think this price comes from the mistrust against these expected growth numbers because of Microsoft&amp;#39;s potential.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;So what do you think? Do you expect Google&amp;#39;s PE to fall to 12? Or AMD into 15 while expecting this pace of growth?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "set0lg",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "ace66",
  "discussion_type": null,
  "num_comments": 83,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/set0lg/is_big_tech_really_overvalued/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/set0lg/is_big_tech_really_overvalued/",
  "subreddit_subscribers": 3580995,
  "created_utc": 1643422532,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1643382844,
  "the_new_excerpt": "The narrative here lately is that valuations are crazy even amongst the big tech\nand this is a major bubble we are in and we should expect a correction up to the\n50% etc.\n\nWell, if we simply look from an earnings estimates perspective and compare this\nto these companies' past, it doesn't look…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、大手ハイテク企業の間でさえもバリュエーションが狂っていると言われています。\nこれは大きなバブルであり、今後、最大で1,000億円の調整が必要である。\n50％など。\n\nさて、単純に業績予想の観点から見て、これを比較すると\nこれらの企業の過去と比較すると、どうも...。",
      "title": "ビッグテックは本当に過大評価されているのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近这里的说法是，即使在大型科技公司中，估值也是疯狂的。\n而这是一个重大的泡沫，我们应该期待一个修正，达到\n50%等等。\n\n好吧，如果我们简单地从盈利估计的角度来看，并将其与这些公司进行比较\n与这些公司的过去相比，它看起来并不...",
      "title": "大科技公司的价值真的被高估了吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近這裏的說法是，即使在大型科技公司中，估值也是瘋狂的。\n而這是一個重大的泡沫，我們應該期待一個修正，達到\n50%等等。\n\n好吧，如果我們簡單地從盈利估計的角度來看，並將其與這些公司進行比較\n與這些公司的過去相比，它看起來並不...",
      "title": "大科技公司的價值真的被高估了嗎？"
    }
  ]
}