{
  "author": "MyzMyz1995",
  "original_created_utc": 1650008022,
  "title": "Don't be that person that keep bringing up crypto every days to their friends and families",
  "created_utc": 1650037533,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Reminder to not be that kind of guy who has his whole personality built around crypto and talk about it everyday with people who don&amp;#39;t care about it. If they cared about it, they would be learning it themselves and than reach out to you about the subject.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s never a good idea to talk anything finance with friends and family if it&amp;#39;s something outside of very general subjects. It&amp;#39;s better if you join a community, discord, telegram or other platform to talk about those kind of things and not create uncomfortable situations or even resentment because you for example shilled a project and it flopped, and now they think it&amp;#39;s on you because you&amp;#39;re one the who &amp;#39;&amp;#39;advised&amp;#39;&amp;#39; to buy it.&lt;/p&gt;\n\n&lt;p&gt;Just like in this sub when you downvote people who shill what they have in their portfolio, don&amp;#39;t shill crypto to people who aren&amp;#39;t interested and get downvoted IRL for it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 427,
  "permalink": "/r/CryptoCurrency/comments/u42oqk/dont_be_that_person_that_keep_bringing_up_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "u42oqk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Reminder to not be that kind of guy who has his whole personality built around\ncrypto and talk about it everyday with people who don't care about it. If they\ncared about it, they would be learning it themselves and than reach out to you\nabout the subject.\n\nIt's never a good idea to talk anything…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "自分の個性を全面に押し出すような男にはならないように気をつけよう。\n暗号に興味のない人たちと毎日暗号の話をしている。もし彼らが\nを学ぶだろうし、あなたに連絡することもないだろう。\nというテーマについて。\n\n何でもかんでも話すのは決して良いことではありません・・・。",
      "title": "友人や家族に暗号を持ち出すような人になってはいけません。"
    },
    {
      "locale": "zh",
      "title": "不要成为那个每天都对朋友和家人提起加密货币的人。",
      "the_new_excerpt": "提醒我们不要成为那种把自己的全部个性都建立在加密货币上的人。\n围绕加密货币，每天与不关心它的人谈论它。如果他们\n如果他们关心它，他们就会自己学习它，而不是向你伸出援手\n谈论这个话题。\n\n谈论任何事情都不是一个好主意......"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "自分の個性を全面に押し出すような男にはならないように気をつけよう。\n暗號に興味のない人たちと毎日暗號の話をしている。もし彼らが\nを學ぶだろうし、あなたに連絡することもないだろう。\nというテーマについて。\n\n何でもかんでも話すのは決して良いことではありません・・・。",
      "title": "不要成爲那個每天都對朋友和家人提起加密貨幣的人。"
    }
  ]
}