{
  "author": "italiansomali",
  "the_new_excerpt": "I believe there are many retail investors diving into meme stocks before doing\nany due diligence at all due to FOMO, just like myself. I'm now trying to be\nmore responsible with my money so I started doing short research reports on the\nbusiness models of stocks expecting it will help me identify…",
  "original_created_utc": 1608853037,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我相信有很多散户投资者在做之前都会潜入Meme股票\n任何因“信息自由法”而进行的尽职调查，就像我自己一样。我现在正努力成为\n对我的钱更负责，所以我开始做简短的研究报告\n股票的业务模式期望它能帮助我识别…",
      "title": "海盗船游戏(花旗rsr)短DD"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我相信有很多散戶投資者在做之前都會潛入Meme股票\n任何因“信息自由法”而進行的盡職調查，就像我自己一樣。我現在正努力成爲\n對我的錢更負責，所以我開始做簡短的研究報告\n股票的業務模式期望它能幫助我識別…",
      "title": "海盜船遊戲(花旗rsr)短DD"
    }
  ],
  "title": "Corsair Gaming ($CRSR) Short DD",
  "created_utc": 1608910222,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I believe there are many retail investors diving into meme stocks before doing any due diligence at all due to FOMO, just like myself. I&#39;m now trying to be more responsible with my money so I started doing short research reports on the business models of stocks expecting it will help me identify potential multibaggers to buy and hold for the long term. I thought I&#39;d begin sharing, hoping it will help some of you too, as well as benefiting myself from your thoughts and comments.</p>\n\n<p>The write up is informational rather than analytic, and its purpose is to help you reach your own conclusions instead of telling you what to do.</p>\n\n<p>Please let me know if there is anything that can make future write ups more useful.</p>\n\n<h1>Corsair Gaming ($CRSR)</h1>\n\n<p><em>Redefining gaming, eSports, and streaming</em></p>\n\n<h1>Company Overview</h1>\n\n<p>Corsair Gaming is an American computer hardware and peripherals company founded in 1994 and headquartered in California.</p>\n\n<p>They acquired Elgato Gaming in 2018 to expand to the streaming gear market, Origin PC and SCUF gaming in 2019 to expand into the custom-built PC systems and console controllers markets, respectively, and during 2020 they acquired Gamer Sensei and EpocCam, and partnered with Pipeline to grow into the gaming and streaming coaching market.</p>\n\n<p>Corsair went public on September 23, 2020, with its IPO priced at $17, valuing the company at about $1.3B.</p>\n\n<h1>Understanding the Business</h1>\n\n<p><strong>Value Proposition</strong></p>\n\n<p>Corsair provides specialized, high-performance gear for gamers and streamers. Their products are designed to provide speed and reliability for competitive gaming, high quality content for streamers, and powerful PC components that allows gamers to run modern games smoothly.</p>\n\n<p><strong>Revenue Streams</strong></p>\n\n<p>Currently, Corsair groups its product offering into two segments: gamer and creator peripherals and gaming components and systems.</p>\n\n<p>Gamer and Creator Peripherals:</p>\n\n<p>which represents around 25% of net revenue, includes gaming mice, keyboards, and headsets, streaming gear, and high performance console controllers.</p>\n\n<p>Gaming Components Systems:</p>\n\n<p>which represents around 75% of net revenue includes computer cases, power supply units (PSU), high performance memory products (40% of net revenue), and custom-built gaming systems.</p>\n\n<p>Acquisitions and Partnerships:</p>\n\n<p>During 3Q 2020 Corsair acquired Gamer Sensei, a gaming coaching platform, EpocCam, an app that allows iPhones to serve as a webcam, and partnered with Pipeline, a course-based education platform for streamers.</p>\n\n<h1>Industry</h1>\n\n<p><strong>Market Size</strong></p>\n\n<p>According to Jon Peddie Research, the global gaming and streaming gear markets is expected to reach $40B by the end of 2020. Before the pandemic JPR estimated the market to grow at a modest 1.05% CAGR until 2022. However, during 2020 the market has grown an estimated 10% year-over-year.</p>\n\n<p>Additionally, DFC Intelligence research estimated that the video-game coaching market surpasses $1B.</p>\n\n<p><strong>Industry Fundamentals</strong></p>\n\n<p>Growth in the gaming and streaming gear industries are driven by strong and robust fundamentals.</p>\n\n<p>Popularity of gaming is increasing:</p>\n\n<p>According to Newzoo, there are an estimated 2.7B gamers worldwide, which are expected to spend $159B on games in 2020 and is expected to grow at an 8.3% CAGR to exceed $200B by 2023. PC and console gaming represents 51% of the total market, and mobile gaming 49%. Corsair has stated that currently there is no interest in expanding to the mobile gaming market.</p>\n\n<p>Tech-driven improvements in game quality:</p>\n\n<p>Advances in computer power have enabled gaming platforms to provide increasingly immersive experiences. This in turn, places increased demand on high-performance computing hardware.</p>\n\n<p>Increasing gaming and streaming engagement:</p>\n\n<p>Some interesting facts reported in the Limelight Networks’ State of Online Gaming 2019 research report include:</p>\n\n<ul>\n<li>On average, video gamers spend six hours and 20 minutes each week playing video games</li>\n<li>More than 38% of gamers would like to become professionals if it could support themselves</li>\n<li>Gamers from novice to aspiring professionals report missing daily activities due to gaming, missed sleep is the most pervasive</li>\n<li>Watching gamers play video games online is more popular than watching traditional sports for 18-25 year olds.</li>\n</ul>\n\n<p><strong>The eSports and streaming flywheel</strong></p>\n\n<p>The rise in popularity and viewership of eSports brings more investment from publishers, sponsors, advertisers, team owners, and leagues to the eSports industry. Increased investment brings more players and increased performance focus of gamers who advance from less engaged gaming to high-performance gameplay, which in turn brings more viewers.</p>\n\n<h1>Competitive Landscape &amp; Risks</h1>\n\n<p><strong>Competition</strong></p>\n\n<p>The gaming and streaming market is characterized by intense competition, constant price pressure and rapid change. Competition across Corsair’s product offering includes:</p>\n\n<p><strong>Gaming keyboards and mice</strong> - Logitech and Razer</p>\n\n<p><strong>Headsets and related audio products</strong> -Logitech, Razer, and HyperX</p>\n\n<p><strong>Streaming gear</strong> - Logitech and AVerMedia</p>\n\n<p><strong>Performance controllers</strong> - Microsoft and Logitech</p>\n\n<p><strong>PSUs, cooling solutions, and computer cases</strong> - Cooler Master, NZXT, EVGA, Seasonic, and Thermaltake</p>\n\n<p><strong>High performance memory</strong> - G.Skill, HyperX, and Micron</p>\n\n<p><strong>Pre-built and custom-built gaming PCs</strong> - Alienware (Dell), Omen (HP), Asus, Razer, iBuypower and Cyberpower</p>\n\n<p><strong>Competitive Strategy</strong></p>\n\n<p>The company follows a differentiation leadership strategy by prioritizing high-performance and professional quality and charging a price premium on their products in exchange for superior quality, high value added features, and superior brand recognition.</p>\n\n<p><strong>Market Share</strong></p>\n\n<p>According to NPD Group, by 2020 Corsair had #1 market share position in the US in its gaming components and systems products with 42% of the market share from 26% in 2015. Their gamer and creator peripheral products are not yet market leaders, however, the company increased its market share in that segment from 5% in 2013 to 18% by 2020 in the US.</p>\n\n<p><strong>Growth Strategy</strong></p>\n\n<p>Move into the Asia Pacific region:</p>\n\n<p>The Asia Pacific Region represents a long-term growth opportunity. According to Newzoo, they represent 54% of the global gaming community.</p>\n\n<p>Complimentary acquisitions:</p>\n\n<p>Corsair has carried out this strategy aggressively since 2018 with the acquisitions of Elgato Gaming, Origin PC, SCUF and Gamer Sensei. They plan to continue evaluating and pursuing new acquisitions that may strengthen their competitive position.</p>\n\n<p>New Markets:</p>\n\n<p>Uses of streaming gear has spread into areas including, podcasting, video blogging, interactive fitness, remote learning, and work-from-home, which represent a promising avenue for continued expansion in this product segment.</p>\n\n<p><strong>Threat of New Entrants</strong></p>\n\n<p>Because of the continued convergence between the computing devices and consumer electronics markets, increased competition from well-established consumer electronics companies is expected in the gaming and streaming peripherals segment (e.g. use of Audio-technica microphones by streamers).</p>\n\n<p><strong>Threat of Substitution</strong></p>\n\n<p>A significant medium- to long-term risk for Corsair’s business model is the evolution of cloud computing and augmented/virtual reality entertainment.</p>\n\n<p>Cloud computing refers to a computing environment in which software is run on third-party servers and accessed by end users over the internet, requiring minimal processing power from the end-user’s system. Through cloud computing, gamers will be able to access and play sophisticated games without the need of expensive high-performance PC systems and components.</p>\n\n<p>According to Grand View Research, the global cloud gaming market is expected to grow at a CAGR of 48% from 2020 to reach $7.2B by 2027.</p>\n\n<p>Additionally, Corsair must be able to adapt its product offering to meet the needs of the evolving augmented/virtual reality industry.</p>\n\n<p><strong>Moats</strong></p>\n\n<p>There does not seem to be any relevant, structural moats, that may prohibit competitors from capturing Corsair’s market share across their product offering.</p>\n\n<p><strong>Other Relevant Risks</strong></p>\n\n<p>Due to the concentration of their production facilities in Taiwan and China, Corsair may be adversely by geopolitical tensions and trade disputes.</p>\n\n<h1>Financial Summary</h1>\n\n<p><strong>Proforma Balance Sheet</strong></p>\n\n<p><a href=\"https://postimg.cc/QHgY1ZxL\"><strong>https://postimg.cc/QHgY1ZxL</strong></a></p>\n\n<p><strong>Income Statement</strong></p>\n\n<p><a href=\"https://postimg.cc/qNkbGDzN\"><strong>https://postimg.cc/qNkbGDzN</strong></a></p>\n\n<p><strong>For the 9 months ended September 2020 compared to the same period last year:</strong></p>\n\n<p>The 49% increase in net revenue is mostly attributed to a large number of consumers gaming and working from home during the COVID-19 pandemic.</p>\n\n<p>The company’s gross margin is influenced by its product mix for the period, gamer and creator peripherals have a higher gross margin (25-35%) than gaming components and systems (15-25%).</p>\n\n<p><strong>Proforma Cashflow Statement</strong></p>\n\n<p><a href=\"https://postimg.cc/XXCzNyRY\"><strong>https://postimg.cc/XXCzNyRY</strong></a></p>\n\n<p>Cash used in investing activities consists primarily on the acquisitions of Elgato in 2018, and SCUF and Origin PC in 2019.</p>\n\n<p><strong>Peer Comparison</strong></p>\n\n<p><a href=\"https://postimg.cc/Whcfd1V6\"><strong>https://postimg.cc/Whcfd1V6</strong></a></p>\n\n<p>Logitech International (LOGI) and Micron Technologies (MU)</p>\n\n<h1>Investment Outlook</h1>\n\n<p><strong>Case for Buying</strong></p>\n\n<p>Industry fundamentals and growth:</p>\n\n<p>You envision that through Corsair’s competitive strategy and management’s ability to adapt they will be able to grow, or at least maintain, their market share and global footprint in the gaming components, systems, and peripherals industry which shows promising fundamentals and growth as gaming, eSports, and streaming continue to gain significant relevance globally.</p>\n\n<p><strong>Case for Selling</strong></p>\n\n<p>Market structure, threat of new entrants and lack of moats:</p>\n\n<p>If you believe that Corsair will not be able to maintain their competitive position in a highly fragmented market with intense competition and without significant structural moats.</p>\n\n<p>Cloud computing and gaming:</p>\n\n<p>If you think that cloud computing will gain widespread adoption in the medium to long-term, significantly reducing the need for consumers of purchasing high-performance systems and components.</p>\n</div><!-- SC_ON -->",
  "score": 68,
  "permalink": "/r/stocks/comments/kjp5o4/corsair_gaming_crsr_short_dd/",
  "subreddit": "stocks",
  "id": "kjp5o4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609495334782
}