{
  "author": "FinAdvisor92",
  "the_new_excerpt": "I was speaking to a client this morning and he asked if I would have a\nconversation with his 15 year old son and answer some questions for him and\npoint him in the right direction in terms of his finances. He has apparently got\na little lucky on $TSLA lately and made some good money for a 15 year…",
  "original_created_utc": 1610392214,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "今天早上我和一位客户谈话，他问我是否愿意\n与他15岁的儿子交谈并回答一些问题\n从他的财务状况来看，给他指个正确的方向。他显然得了\n最近在美国电话服务级别协议上有点走运，15年的…赚了不少钱",
      "title": "你们这些人在制造自闭症患者。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天早上我和一位客戶談話，他問我是否願意\n與他15歲的兒子交談並回答一些問題\n從他的財務狀況來看，給他指個正確的方向。他顯然得了\n最近在美國電話服務級別協議上有點走運，15年的…賺了不少錢",
      "title": "你們這些人在製造自閉症患者。"
    }
  ],
  "title": "You people are creating autists.",
  "created_utc": 1610401016,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was speaking to a client this morning and he asked if I would have a conversation with his 15 year old son and answer some questions for him and point him in the right direction in terms of his finances. He has apparently got a little lucky on $TSLA lately and made some good money for a 15 year old, (I&#39;m assuming he is using his parents&#39; outside account).</p>\n\n<p>As soon as I got on the phone with him, I noticed an air of superiority. After discussing his &quot;investment strategy&quot; with him for a moment he started to tell me he knows more about investing than I ever will. Keep in mind he says he has been &quot;investing&quot; for 2 months. Then he hit me with this quote, which I will never forget in my entire life:</p>\n\n<p>&quot;Long term investments are for pussies. I dont want to drive a ferrari when I&#39;m 60 if I could when I&#39;m 16&quot;</p>\n\n<p>You people are creating an entire generation of autists. Godspeed.</p>\n\n<p>&#x200B;</p>\n\n<p>edit: DISCLAIMER ON USE OF TERM &quot;AUTIST&quot;: this post hit <a href=\"/r/all\">r/all</a>, which I never expected it to, and now I am getting flamed for using the term autist.</p>\n\n<p>For people who are here from <a href=\"/r/all\">r/all</a>, you will see that terms like this are used frequently and endearingly on this sub. I do genuinely apologize if I have offended anybody, though. It was not my intention.</p>\n</div><!-- SC_ON -->",
  "score": 15165,
  "permalink": "/r/wallstreetbets/comments/kv9k3n/you_people_are_creating_autists/",
  "subreddit": "wallstreetbets",
  "id": "kv9k3n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706385308
}