{
  "author": "squiglesthesquirrel",
  "the_new_excerpt": "I bought CCL/CUK (Carnival Corp) starting late April last year and made it 100%\nof my portfolio. Now it is up around 100% (mostly long term gains) and I\nrecently reflected if my hypothesis for the stock was seen through.\n\nFrankly I did not expect to hold so long. I bought expecting a faster return…",
  "original_created_utc": 1621790263,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "去年の4月下旬からCCL/CUK（カーニバル社）を買って、100％のポートフォリオにしました。\nした。現在は約100％の上昇（ほとんどが長期的な利益）となっています。\n最近になって、この株に対する私の仮説が当たったかどうか振り返ってみました。\n\n率直に言って、これほど長く保有するとは思っていませんでした。もっと早いリターンを期待して買ったのに...。",
      "title": "クルーズの株を持っている人、いつ売るの？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我从去年4月底开始买入CCL/CUK（嘉年华公司），并使其成为我投资组合的100%。\n我的投资组合中。现在它的涨幅约为100%（主要是长期收益），而我\n最近反映了我对该股的假设是否被看穿。\n\n坦率地说，我没有想到会持有这么久。我买入时期望有更快的回报......",
      "title": "邮轮公司的股票持有人，你们什么时候卖？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我從去年4月底開始買入CCL/CUK（嘉年華公司），並使其成爲我投資組合的100%。\n我的投資組合中。現在它的漲幅約爲100%（主要是長期收益），而我\n最近反映了我對該股的假設是否被看穿。\n\n坦率地說，我沒有想到會持有這麼久。我買入時期望有更快的回報......",
      "title": "郵輪公司的股票持有人，你們什麼時候賣？"
    }
  ],
  "title": "Cruise stock holders, when are you selling?",
  "created_utc": 1621825299,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I bought CCL/CUK (Carnival Corp) starting late April last year and made it 100% of my portfolio. Now it is up around 100% (mostly long term gains) and I recently reflected if my hypothesis for the stock was seen through.</p>\n\n<p>Frankly I did not expect to hold so long. I bought expecting a faster return to normal and if I knew in advance they wouldn&#39;t sail in the US until July 2021 I would assume it would be a bad investment. </p>\n\n<p>However, now they are confirmed to sail in July. I guess the hype that is left would be the cruises actually sailing successfully, and then the announcement of what they will do with their reserve cash ($11.5 billion compared to their usual $1 billion or less). They have around $26 billion in long-term debt (compared to $9 billion before the coronavirus) so I imagine it is a priority to pay off that. Then there are expenses of getting the cruises prepared to sail and upkeep. </p>\n\n<p>So even if CCL were to pay off $10 billion (maybe not the best use of funds) of their debt they would still be $6 billion more in debt than before the coronavirus with their dividend gone and shares heavily diluted.</p>\n\n<p>In fact, their market cap is practically the same as it was pre-covid. In December 2019 they had a run up but the market cap now is actually higher than it was in November 2019. It would require billions in stock buybacks for the share price to rise to it&#39;s pre-covid levels (which included a dividend), on top of the billions needed to pay for debt/upkeep. Not to mention CCL was actually in a downtrend from 2018 on, with the market cap going from $50 billion to $30 billion.</p>\n\n<p>So why would I hold now? Even if they have a successful year I&#39;m having trouble justifying why they would continue to grow and outpace the SPY. </p>\n\n<p>Any other cruise stock holders? I&#39;ve already started shifting money into a different investment that I have higher conviction will return healthy gains.</p>\n</div><!-- SC_ON -->",
  "score": 58,
  "permalink": "/r/stocks/comments/njc9ur/cruise_stock_holders_when_are_you_selling/",
  "subreddit": "stocks",
  "id": "njc9ur",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197389729
}