{
  "author": "wordsneedletters",
  "original_created_utc": 1624813593,
  "title": "A call to action for teachers and parents for financial literacy in school--I am teaching high school students about Cryptocurrency, Block chain, and Web 3.0 in a financial literacy class this summer----",
  "created_utc": 1624842327,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I think it&#39;s criminal that students don&#39;t get financial literacy in school---economics, sure--but actual financial literacy---not really much at all. I could have done so much with my life if I was given the basic run down before going into the adult world.</p>\n\n<p>So, I created a down-to earth, brass tax financial literacy course. Finding housing, learning real-world costs of living, college vs. working, being a good roommate, taxes, credit scores, retirement, social security, finding a job, stocks and investing with simulator investing app,  living alternatives, etc...and one three hour day is set aside for crypto alone--including all pros/cons, videos of ELi5 type-stuff,  and I&#39;m having them download a crypto investment simulation app to be used for the two weeks of class. Even talking to them about bull runs and bear markets, DCA, all the stuff--and the importance of taking time to learn and how long it takes to get a grasp on basic fundamentals of understanding what this whole thing is about. </p>\n\n<p>I see how forlorned these kids are about their futures. School districts everywhere need to require financial literacy courses---and hopefully, cryptocurrency and blockchain. </p>\n\n<p>If you are a teacher, especially a social studies teacher, here&#39;s your call to action! Create a financial literacy course curriculum for next summer or next year and propose it to your school. Schools have received all kinds of funds for summer school because of the Covid and students need credits. Also, many districts are getting on board regarding these classes in the yearly curriculum.</p>\n\n<p><a href=\"https://www.cnbc.com/2020/02/04/teaching-financial-education-in-schools-finally-catches-on.html\">https://www.cnbc.com/2020/02/04/teaching-financial-education-in-schools-finally-catches-on.html</a></p>\n\n<p>If you are a parent of a high school student, call your kid&#39;s high school or go to a school board meeting and demand financial literacy in school.</p>\n</div><!-- SC_ON -->",
  "score": 158,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/SFT0lQbK5pNAXCTrV9CjSNAn-45ptPKsesqYaAtmn8k.jpg?auto=webp&s=63167100ecb15b71d7d5ce5813f9d7e35d95180b",
          "width": 1191,
          "height": 692
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/SFT0lQbK5pNAXCTrV9CjSNAn-45ptPKsesqYaAtmn8k.jpg?width=108&crop=smart&auto=webp&s=4458f7fbf6b011d0e9b79800bda895ae3ec566f9",
            "width": 108,
            "height": 62
          },
          {
            "url": "https://external-preview.redd.it/SFT0lQbK5pNAXCTrV9CjSNAn-45ptPKsesqYaAtmn8k.jpg?width=216&crop=smart&auto=webp&s=c9a4914fe0ec9ba668732009f94850b38de6eb3a",
            "width": 216,
            "height": 125
          },
          {
            "url": "https://external-preview.redd.it/SFT0lQbK5pNAXCTrV9CjSNAn-45ptPKsesqYaAtmn8k.jpg?width=320&crop=smart&auto=webp&s=2e7c467cd6e6875c12ca40e741774c81dd6bd3b5",
            "width": 320,
            "height": 185
          },
          {
            "url": "https://external-preview.redd.it/SFT0lQbK5pNAXCTrV9CjSNAn-45ptPKsesqYaAtmn8k.jpg?width=640&crop=smart&auto=webp&s=d1835a63a7e4fc493820e33252eb110f598f15f6",
            "width": 640,
            "height": 371
          },
          {
            "url": "https://external-preview.redd.it/SFT0lQbK5pNAXCTrV9CjSNAn-45ptPKsesqYaAtmn8k.jpg?width=960&crop=smart&auto=webp&s=55d5b3920915645ba574d04f791c6822feefe2c8",
            "width": 960,
            "height": 557
          },
          {
            "url": "https://external-preview.redd.it/SFT0lQbK5pNAXCTrV9CjSNAn-45ptPKsesqYaAtmn8k.jpg?width=1080&crop=smart&auto=webp&s=557a488a9619bc7a318fc3b5635b2a7f892485d0",
            "width": 1080,
            "height": 627
          }
        ],
        "variants": {},
        "id": "BtFpSYxFx-dch_NrZDL7RiRTM9Nt_AwKnCQwfLHNGMk"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/o9159h/a_call_to_action_for_teachers_and_parents_for/",
  "subreddit": "CryptoCurrency",
  "id": "o9159h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I think it's criminal that students don't get financial literacy in\nschool---economics, sure--but actual financial literacy---not really much at\nall. I could have done so much with my life if I was given the basic run down\nbefore going into the adult world.\n\nSo, I created a down-to earth, brass tax…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、学生が学校で金融リテラシーを身につけていないのは犯罪的だと思います。\n経済学はともかく、実際の金融リテラシーはまったくと言っていいほど身についていません。\nこれは犯罪だと思います。大人になる前に基本的な知識を身につけていれば、自分の人生をもっと豊かにできたはずです。\n大人の世界に入る前に基本的なことを教えてもらっていたら、自分の人生を大きく変えることができたはずです。\n\nそこで私は、地に足のついた、真鍮製の税...",
      "title": "学校における金融リテラシーのための教師と親への呼びかけ--私はこの夏、金融リテラシーのクラスで高校生にCryptocurrency、Block chain、Web 3.0について教えています----"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我认为，学生在学校没有获得金融知识是一种犯罪。\n学校的经济学，当然--但实际的金融知识--其实不多。\n的。如果我在进入成人社会之前，能得到基本的财务知识，我的生活就会有很大的改观。\n在进入成人世界之前，我可以在我的生活中做很多事情。\n\n因此，我创建了一个脚踏实地的铜质税法。",
      "title": "呼吁教师和家长为学校的金融知识采取行动--我今年夏天在金融知识课上给高中生讲加密货币、区块链和Web 3.0----"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我認爲，學生在學校沒有獲得金融知識是一種犯罪。\n學校的經濟學，當然--但實際的金融知識--其實不多。\n的。如果我在進入成人社會之前，能得到基本的財務知識，我的生活就會有很大的改觀。\n在進入成人世界之前，我可以在我的生活中做很多事情。\n\n因此，我創建了一個腳踏實地的銅質稅法。",
      "title": "呼籲教師和家長爲學校的金融知識採取行動--我今年夏天在金融知識課上給高中生講加密貨幣、區塊鏈和Web 3.0----"
    }
  ]
}