{
  "author": "jacagu",
  "the_new_excerpt": "Since we can measure stellar parallax by the earth position around the sun, I'd\nimagine that our journy through the milky way would give us a lot more parallax.\nOr are we moving with our stellar neighbours in such a way that we don't see\nmuch drift at all?",
  "original_created_utc": 1617615610,
  "localize": [
    {
      "locale": "ja-JA",
      "the_new_excerpt": "恒星の視差は、太陽の周りの地球の位置で測ることができるので、私は\n天の川を旅すると、もっと多くの視差が生じるのではないでしょうか。\nそれとも、私たちは隣の恒星と一緒に移動しているので、あまりドリフトは見られないのでしょうか？\nドリフトはあまり見られないのでしょうか？",
      "title": "私たちは以前から夜空の写真を撮っています。新旧の観測結果を比較して、我々が天の川を移動することによる視差を見ることはまだ可能なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "既然我们可以通过地球绕太阳的位置来测量恒星视差，那么我将\n想象一下，我们在银河系的旅行会给我们带来更多的视差。\n还是说我们和我们的恒星邻居一起移动的方式让我们看不到... ...\n漂移得多吗？",
      "title": "我们拍摄夜空的照片已经有一段时间了。通过新旧观测资料的对比，是否还能看到我们在银河中移动的视差呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "既然我們可以通過地球繞太陽的位置來測量恆星視差，那麼我將\n想象一下，我們在銀河系的旅行會給我們帶來更多的視差。\n還是說我們和我們的恆星鄰居一起移動的方式讓我們看不到... ...\n漂移得多嗎？",
      "title": "我們拍攝夜空的照片已經有一段時間了。通過新舊觀測資料的對比，是否還能看到我們在銀河中移動的視差呢？"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "恒星の視差は、太陽の周りの地球の位置で測ることができるので、私は\n天の川を旅すると、もっと多くの視差が生じるのではないでしょうか。\nそれとも、私たちは隣の恒星と一緒に移動しているので、あまりドリフトは見られないのでしょうか？\nドリフトはあまり見られないのでしょうか？",
      "title": "私たちは以前から夜空の写真を撮っています。新旧の観測結果を比較して、我々が天の川を移動することによる視差を見ることはまだ可能なのでしょうか？"
    }
  ],
  "title": "We've taken photos of the night sky for some time now. Is it yet possible to see parallax from us moving through the milky way by comparing old and new observations?",
  "created_utc": 1617696364,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Since we can measure stellar parallax by the earth position around the sun, I&#39;d imagine that our journy through the milky way would give us a lot more parallax. Or are we moving with our stellar neighbours in such a way that we don&#39;t see much drift at all?</p>\n</div><!-- SC_ON -->",
  "score": 165,
  "permalink": "/r/askscience/comments/mkgu91/weve_taken_photos_of_the_night_sky_for_some_time/",
  "subreddit": "askscience",
  "id": "mkgu91",
  "is_self": true,
  "media": null,
  "is_video": false
}