{
  "author": "Dont_touch_my_elbows",
  "original_created_utc": 1625440737,
  "title": "Florida building collapse - what happens to all the undamaged apartments full of peoples' property?",
  "created_utc": 1625469312,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Obviously the building is way too dangerous to allow people inside to pack up an entire apartment....but....will they just raze the rest of the building with closets full of clothes, kitchens full of dishes, etc?</p>\n\n<p>It must be terrible to know that all of your worldly possessions are &quot;safe&quot; RIGHT NOW, but are PROBABLY gonna be lost because it&#39;s not safe to go get them.</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/odvbet/florida_building_collapse_what_happens_to_all_the/",
  "subreddit": "NoStupidQuestions",
  "id": "odvbet",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Obviously the building is way too dangerous to allow people inside to pack up an\nentire apartment....but....will they just raze the rest of the building with\nclosets full of clothes, kitchens full of dishes, etc?\n\nIt must be terrible to know that all of your worldly possessions are \"safe\"\nRIGHT NOW,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "明らかに、この建物は危険なので、中にいる人がアパート全体を梱包することはできません。\nしかし、....、....。\n衣類でいっぱいのクローゼットや、食器でいっぱいのキッチンなど。\n\nこの世の財産がすべて \"安全 \"であることを知るのは恐ろしいことでしょう。\nRIGHT NOW,...",
      "title": "フロリダのビル崩壊-人々の財産が詰まった無傷のアパートはどうなるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "很明显，这栋楼太危险了，不允许里面的人收拾东西。\n整个公寓....，但是....，他们会不会把这栋楼的其他部分夷为平地呢？\n衣柜里的衣服，厨房里的碗碟等等？\n\n知道你所有的世俗财产都是 \"安全的\"，这一定很可怕。\n就在此时，...",
      "title": "佛罗里达州的建筑倒塌--所有未受损的公寓都是人民的财产，会发生什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "很明顯，這棟樓太危險了，不允許裏面的人收拾東西。\n整個公寓....，但是....，他們會不會把這棟樓的其他部分夷爲平地呢？\n衣櫃裏的衣服，廚房裏的碗碟等等？\n\n知道你所有的世俗財產都是 \"安全的\"，這一定很可怕。\n就在此時，...",
      "title": "佛羅里達州的建築倒塌--所有未受損的公寓都是人民的財產，會發生什麼？"
    }
  ]
}