{
  "author": "takoko",
  "original_created_utc": 1640742468,
  "title": "Given the chaos of the February Revolution in France, who would have had the authority (and hopefully reason) to order a French corvette to embark on an almost 2-year mission around the Pacific to find and transfer the son of a minor French noble from one whaling ship to another?",
  "created_utc": 1640767615,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My husband (who is not a Redditor or a historian) is researching some background on a larger-than-life figure from Bath Maine: Francois de Loche (died 1889). Fascinating as his later history is, his early life reads something like a Kipling novel. He appears to have been the subject of a “secret mission” given to a well-known French naval commander, that took some 20 months to accomplish (with murder getting mixed in along the way).&lt;/p&gt;\n\n&lt;p&gt;The family concerned were Freemasons, but I am doubtful that association could have resulted in such an order being given. There are other questions, as it’s a fascinating story, so any insight or background would be vastly appreciated.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Possible areas of expertise that could help:&lt;/strong&gt; French navy of the late 1800s; the Lautrec Family; French Freemasonry; French Revolution of 1848; Whaling in the South Pacific and Japan/Java seas late 1800’s; French presence in Macau and Manila; French consulate in Sydney NSW (1840’s); Jurien de la Graviere; ships la Bayonnaise (the second, less famous one) and/or l’Enterprise and l’Nil.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The facts of the story as we know them are below&lt;/strong&gt;. All dates and details are from official sources such as ships logs and court reports or Graviere’s book mentioned below and linked at the bottom. Where we have connected information or are speculating (e.g., from plotting the ships’ voyages) I’ve italicized it.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;13 October 1847&lt;/strong&gt;, the French whaler l’Entreprise, under the command of Captain Briancon arrives in Sydney harbor.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Roughly half of the crew deserts immediately, and several more did so over the next 2 weeks.&lt;/li&gt;\n&lt;li&gt;Amongst the later deserters is Francois Alexander Deloche, a 16-year-old mousse (the ship&amp;#39;s arming records have him as a mousse serving as a mousse; his personnel records have him as a novice serving as a mousse), who is the son of a French Chevalier (Charles Deloche). Charles Deloche’s grandfather was Guillaume de Lautrec de Vieussan (Viscount, Captain and Chevalier).&lt;/li&gt;\n&lt;li&gt;Another crew member, Louis Choammeau – 25, an M2-rated sailor departed and returned to the ship on the same dates as Francois. &lt;em&gt;Note: according to l’Enterprise’s disarming sheet, it appears that Louis’s mother may have been a noblewoman (cannot fully decipher the last name).&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;As this was the last time Francois could have sent any communication in the relevant timeframes, it seems possible that Francois went to the French consul while in Sydney IF his desertion was to ask for assistance&lt;/em&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;5 November 1847&lt;/strong&gt;, Francois &amp;amp; Louis return to the ship&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Louis is demoted to Novice. Francois appears to have suffered no punishment. At least there is no mention to be found of it (Louis’ demotion is recorded in the disarming sheet – no other deserters returned).&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;Early November 1847&lt;/strong&gt;, l’Enterprise departs having been refinanced and resupplied.  A new, mostly English crew, is hired as replacements for the French deserters &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;23/24 January 1848,&lt;/strong&gt; l’Enterprise arrives in Bay of Isles (New Zealand) – at the time mostly a whaler camp. The newly hired English are all thrown off the ship for insubordination and replaced with mostly American crewmen, including William Petty of New York (hired and eventually promoted to second in command). &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;It is unknown exactly when l’Enterprise departed Bay of Isles, their whaling expedition having been an utter failure (and it never improved – they caught 0 whales).&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;Feb 1848&lt;/strong&gt; begins the revolution of 1848 in France (February Revolution).&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;28 Feb 1848&lt;/strong&gt;, the French corvette Bayonnaise returns to Macau after a week in Hong Kong, under the command of Captain of Frigate Jurien de la Graviere (who later became Vice Admiral). &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Bayonnaise was expecting orders to return to their homeport of Cherbourg, France. Instead, they learn of the revolution and receive a “secret mission” (in the words of the chaplain of the ship). The chaplain learned of the mission from the Catholic Church in Macau. Presumably, the Captain learned of it from the French Consul (but Graviere never mentions it in his book “Voyage de la Corvette la Bayonnaise dans les mers de Chine Tombs I &amp;amp; II”).&lt;br/&gt;&lt;/li&gt;\n&lt;li&gt;It may be worth noting that the chaplain’s commentary is only known because of an official complaint he made to the church alleging abuse he suffered at the hands of the Bayonnaise’s officers&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;8 March 1848&lt;/strong&gt; the Bayonnaise departs Macau, in darkness with no fanfare or salutes, which was apparently out of the ordinary, and heads straight for Manila. (This is per the chaplain’s complaint/testimony)&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;15 March 1848&lt;/strong&gt;, Bayonnaise arrives in Manila. According to personnel records, on 26 March 1848, a cousin of Chevalier Charles (Charles Augustus Deloche) is transferred from the whaler Gustav to the Bayonnaise. &lt;em&gt;Anecdotal reports from the Lautrec family say the cousin was to assist the Bayonnaise in removing Francois from l’Entreprise and place him on the whaler l’Nil.&lt;/em&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;&lt;em&gt;Side question&lt;/em&gt;&lt;/strong&gt;: Why does a transfer of a single person from one obscure whaler to another (more famous one) require the use of a major French warship commanded by the head of the French mission to China?&lt;/li&gt;\n&lt;li&gt;During the next 8 months Bayonnaise and l’Enterprise criss-cross each other through the Pacific between the ports of Macau, Manila, and the Caroline islands – never arriving in the same port at the same time.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;16 November 1848&lt;/strong&gt;, Bayonnaise is in Macau and (according to the court report of a subsequent trial), Captain Graviere is tasked with conducting an extensive investigation into the actions of Captain Briancon of l’Entreprise (unknown what actions are being investigated – the events that are the subject of the trial had yet to occur). &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;The order is given to Graviere by le minister de la marine prescrivit(?) M Forth Rouen, the envoy of the Republic of France in residence in Macau on 16 November 1848. &lt;strong&gt;&lt;em&gt;Side question:&lt;/em&gt;&lt;/strong&gt; was he tasked with this investigation because he was already under orders to find that ship? Was Graviere the only important French commander in the Asia region? Why would one obscure whaler generate two different orders from two different consuls to track it down – was the captain THAT bad?&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;For the next 12 months, Bayonnaise sails the Pacific&lt;em&gt;, stopping at (seemingly) every whaling camp&lt;/em&gt; from the Sea of Japan to the Java Sea and back again, without encountering l’Enterprise.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;12 May 1849&lt;/strong&gt;, a murder begins on board l’Entreprise (this is now 6 months &lt;strong&gt;after&lt;/strong&gt; Graviere is tasked with investigating Briancon). The murder victim was a French financier (Mr. Tignol) – who was to be the new owner of the ship. The man was severely whipped/beaten on board the ship by Petty, and when he survived, was taken ashore, and beaten to death. &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Mr. Tignol died on Lele island in the harbor of Strongs Island (aka Oualan), or Kosrae as it is known today.&lt;/li&gt;\n&lt;li&gt;Francois later testified to being below decks in his cabin (a mousse with a cabin?) while the beating was taking place directly above him. &lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;Around early November 1849&lt;/strong&gt;, Bayonnaise is in Macau, and Graviere learns that l’Entreprise is in Hong Kong harbor. Graviere requests permission to seize l’Enterprise (Hong Kong being under British rule at the time). The British deny the request and inform Graviere that if a French warship fires a shot in Hong Kong harbor the English forts will engage. &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Graviere instead sends marines under command of one of his officers into Hong Kong harbor aboard a Portuguese lorcha, along with French officials from Macau. The Captain of the Portuguese ship invites captain Briancon to dinner aboard his ship and the French arrest him as he arrives on board the vessel. &lt;/li&gt;\n&lt;li&gt;After Briancon’s arrest, French marines go to seize the l’Enterprise and the crew willingly surrender it. The ship is then brought back to Macau, decommissioned, and burnt.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;3 January 1850&lt;/strong&gt;, Bayonnaise (with Francois aboard) departs Macau for Manila.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;12 January 1850&lt;/strong&gt;, on the order of the Consul of France, Francois is transferred to the whaler l’Nil in Manila harbor. &lt;em&gt;Sometime between Nov 8 and 12 January&lt;/em&gt; he gave testimony regarding Mr. Tignol’s murder, which was introduced in the subsequent trial in France.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Bayonnaise departs Manila for Strong’s Island to investigate the murder and then sails home to France with the Captain, Petty, Charles Augustus Deloche, and the 6 remaining French crew of l’Enterprise (minus Francois and Louis Chammou – &lt;em&gt;who also transferred to l’Nil&lt;/em&gt;).&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;23 March 1851&lt;/strong&gt;, Nantes France; the trial of Briancon &amp;amp; Petty for the murder of Mr. Tignol. They were convicted and hung.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Summary:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Francois is the son of a minor noble (at best). Jurien de la Graviere is, at the time of these events, already a military officer and author of some renown.&lt;/p&gt;\n\n&lt;p&gt;What power, that survives a revolution, could have a French warship commanded by a famous Captain, spend 20 months on what appears to have started as a mission to remove said son from one whaler and put him onto another (intervening murder not withstanding)? Nothing directly says that Francois is the “secret mission”, but the Bayonnaise did nothing other than head for ports that l’Enterprise would conceivably have been at – nothing else happens of note, and the Bayonnaise heads for home as soon they are done with the investigation of the murder (after returning the Consul to Macao).&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Sources:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Legal Gazette&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://data.decalog.net/enap1/Liens/Gazette/ENAP_GAZETTE_TRIBUNAUX_18510323.pdf\"&gt;http://data.decalog.net/enap1/Liens/Gazette/ENAP_GAZETTE_TRIBUNAUX_18510323.pdf&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Enterprise Disarming Papers&lt;br/&gt;\n &lt;a href=\"https://www.archinoe.fr/v2/ad44/visualiseur/navires_nominatif.html?id=440604912\"&gt;https://www.archinoe.fr/v2/ad44/visualiseur/navires_nominatif.html?id=440604912&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Graviere&amp;#39;s book, tomb 2.&lt;br/&gt;\n full ship schedule on page 382&lt;br/&gt;\n &lt;a href=\"https://gallica.bnf.fr/ark:/12148/bpt6k65497244/f5.image\"&gt;https://gallica.bnf.fr/ark:/12148/bpt6k65497244/f5.image&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Chaplain’s complaint – reference has been lost. It was an official protest recorded with the Chaplain’s superiors in the Catholic church.&lt;/p&gt;\n\n&lt;p&gt;Site hosting the l&amp;#39;Nil&amp;#39;s arming papers has been down since the pandemic started (French records from L&amp;#39;Havre).&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/rqvv2i/given_the_chaos_of_the_february_revolution_in/",
  "subreddit": "AskHistorians",
  "id": "rqvv2i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My husband (who is not a Redditor or a historian) is researching some background\non a larger-than-life figure from Bath Maine: Francois de Loche (died 1889).\nFascinating as his later history is, his early life reads something like a\nKipling novel. He appears to have been the subject of a “secret…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の夫（Redditorでも歴史家でもない）は、いくつかの背景を調べています。\nバースメイン州出身のある大物人物について。フランソワ・ド・ローシュ（1889年没）。\nフランソワ・ド・ローシュ（1889年没）は、後世の歴史もさることながら、その幼少期がまるで\nキプリングの小説です。彼は「秘密」の対象だったようだ...。",
      "title": "2月革命の混乱期、フランスの小貴族の息子を捕鯨船から別の船に移すために、フランスのコルベットに約2年間の太平洋周航を命じる権限（できれば理由）が誰にあったのだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的丈夫（他不是Redditor或历史学家）正在研究一些背景资料。\n关于缅因州巴斯市的一个大人物的背景。Francois de Loche（死于1889年）。\n尽管他后来的历史很吸引人，但他的早期生活读起来就像一本\n吉卜林的小说。他似乎是一个 \"秘密 \"的对象。",
      "title": "鉴于法国二月革命的混乱局面，谁会有权力（希望有理由）命令一艘法国轻型护卫舰开始执行为期近两年的环太平洋任务，以寻找并将一个法国小贵族的儿子从一艘捕鲸船转移到另一艘船上？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的丈夫（他不是Redditor或歷史學家）正在研究一些背景資料。\n關於緬因州巴斯市的一個大人物的背景。Francois de Loche（死於1889年）。\n儘管他後來的歷史很吸引人，但他的早期生活讀起來就像一本\n吉卜林的小說。他似乎是一個 \"祕密 \"的對象。",
      "title": "鑑於法國二月革命的混亂局面，誰會有權力（希望有理由）命令一艘法國輕型護衛艦開始執行爲期近兩年的環太平洋任務，以尋找並將一個法國小貴族的兒子從一艘捕鯨船轉移到另一艘船上？"
    }
  ]
}