{
  "author": "FluffyKoalaButt",
  "original_created_utc": 1654566943,
  "title": "Am I... wiping my ass wrong?",
  "created_utc": 1654586818,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am so grateful that I have a place to ask this. Poop details below. &lt;/p&gt;\n\n&lt;p&gt;So after I defecate, I wipe my butt with toilet paper until the paper comes up clean. But sometimes, especially if the poop has been uh, well-hydrated, I can wipe until the paper is clean and later get an itchy butt after walking around. When I go back to the bathroom and wipe more, there&amp;#39;s more shit. I hate this. Am I wiping wrong? How do I stop this? Is this normal?&lt;/p&gt;\n\n&lt;p&gt;Edit: All of y&amp;#39;all should be disclosing if you&amp;#39;re being paid by bidet companies haha. Consider the bidet recommended!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 109,
  "permalink": "/r/TooAfraidToAsk/comments/v6jlyo/am_i_wiping_my_ass_wrong/",
  "subreddit": "TooAfraidToAsk",
  "id": "v6jlyo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I am so grateful that I have a place to ask this. Poop details below.\n\nSo after I defecate, I wipe my butt with toilet paper until the paper comes up\nclean. But sometimes, especially if the poop has been uh, well-hydrated, I can\nwipe until the paper is clean and later get an itchy butt after…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんなことを聞ける場所があるなんて、本当にありがたいことです。以下、ウンチの詳細です。\n\nで、排便後、トイレットペーパーでお尻を拭くのですが、紙がきれいに出てくるまで\nきれいになります。しかし、時々、特にウンチが、あー、よく水分を含んでいた場合、私は、紙がきれいになるまで拭いて、後に\n紙がきれいになるまで拭いても、後でお尻が痒くなることがあります...",
      "title": "俺は...ケツを拭き間違えたか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我非常感激，我有一个地方可以问这个问题。下面是大便的细节。\n\n所以在我排便后，我用卫生纸擦拭我的屁股，直到纸上出现\n干净。但有时，特别是如果大便已经呃，水分充足，我可以\n擦到手纸干净为止，后来屁股就会发痒......",
      "title": "我......擦错屁股了吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我非常感激，我有一個地方可以問這個問題。下面是大便的細節。\n\n所以在我排便後，我用衛生紙擦拭我的屁股，直到紙上出現\n乾淨。但有時，特別是如果大便已經呃，水分充足，我可以\n擦到手紙乾淨爲止，後來屁股就會發癢......",
      "title": "我......擦錯屁股了嗎？"
    }
  ]
}