{
  "author": "SoonMoonn",
  "original_created_utc": 1635006929,
  "title": "Taking profits never made someone broke.",
  "created_utc": 1635014419,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hodling is easy compared to how hard it’s taking profits for most of us. </p>\n\n<p>If you want that new Phone or want to go to. 2 week vacation to Bali. Do it! You only live once and you have to enjoy your life. Taking profits is hard but guess what is harder? When you’ll be old and you’ll have all the money in the world but the only thing you want is to be 20 and to do the things you didn’t do because you were busy investing in crypto!</p>\n\n<p>Investing is good, but investing while enjoying is better!</p>\n\n<p>Enjoy your life while you still can because it’s a privilege to be alive! Some people don’t even make it as old as you did! Nothing is certain in the future, only in the present it is!</p>\n</div><!-- SC_ON -->",
  "score": 248,
  "permalink": "/r/CryptoCurrency/comments/qe89h2/taking_profits_never_made_someone_broke/",
  "subreddit": "CryptoCurrency",
  "id": "qe89h2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hodling is easy compared to how hard it’s taking profits for most of us.\n\nIf you want that new Phone or want to go to. 2 week vacation to Bali. Do it! You\nonly live once and you have to enjoy your life. Taking profits is hard but guess\nwhat is harder? When you’ll be old and you’ll have all the money…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ホドリングは、多くの人が利益を得ることの難しさに比べれば簡単なことです。\n\nもしあなたがその新しいPhoneが欲しかったり、行きたいと思っているなら。バリへの2週間の休暇。そうしてください。あなたは\n人生は一度きり、自分の人生を楽しまなければなりません。利益を得ることは難しいが、何が難しいと思う？\n何が難しいと思いますか？あなたが年老いて、すべてのお金を手にしたとき...。",
      "title": "利益を出すことで誰かが破産することはない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "与我们大多数人获取利润的难度相比，霍德林很容易。\n\n如果你想要那个新的手机或者想去。到巴厘岛度假2周。那就去做吧! 你\n你只能活一次，你必须享受你的生活。获利是困难的，但你猜\n什么更难？当你老了，你将拥有所有的钱...",
      "title": "获利从未使人破产。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "與我們大多數人獲取利潤的難度相比，霍德林很容易。\n\n如果你想要那個新的手機或者想去。到巴厘島度假2周。那就去做吧! 你\n你只能活一次，你必須享受你的生活。獲利是困難的，但你猜\n什麼更難？當你老了，你將擁有所有的錢...",
      "title": "獲利從未使人破產。"
    }
  ]
}