{
  "author": "travelsex69",
  "the_new_excerpt": "A few thoughts/questions, I am an amateur investor but like to follow the\nfinancial news and try to piece things together. Would love to hear thoughts\nfrom people more coherent/intelligent than me:\n\n * Today the 10-year Treasury rate shot higher, to a level comparable to the\n   panic last March when…",
  "original_created_utc": 1613490198,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "一些想法/问题，我是一个业余的投资者，但喜欢关注的是\n财经新闻，并试图将事情拼凑起来。很想听听你的想法\n来自比我更连贯/聪明的人。\n\n *今天，10年期国债利率飙升，达到了一个类似于...的水平。\n   恐慌去年三月，当...",
      "title": "像鹰一样观察10年。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "一些想法/問題，我是一個業餘的投資者，但喜歡關注的是\n財經新聞，並試圖將事情拼湊起來。很想聽聽你的想法\n來自比我更連貫/聰明的人。\n\n *今天，10年期國債利率飆升，達到了一個類似於...的水平。\n   恐慌去年三月，當...",
      "title": "像鷹一樣觀察10年。"
    }
  ],
  "title": "Watching the 10-Year Like a Hawk",
  "created_utc": 1613495616,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A few thoughts/questions, I am an amateur investor but like to follow the financial news and try to piece things together. Would love to hear thoughts from people more coherent/intelligent than me:</p>\n\n<ul>\n<li><p>Today the 10-year Treasury rate shot higher, to a level comparable to the panic last March when people were dumping everything they could to raise cash. </p></li>\n<li><p>This has matched a melt-up in equities and crypto-currencies, as well as the SPAC craze.</p></li>\n<li><p>Treasury yields are rising despite the fact that the Fed is apparently still buying bonds at a massive rate from primary dealers </p></li>\n<li><p>Inflation expectations rising rapidly, Fed has said it will go over 3 percent</p></li>\n<li><p>Washington continues to deficit spend like nobody&#39;s business</p></li>\n<li><p>It&#39;s always trendy to talk about the &quot;bond bubble&quot; but I haven&#39;t seen any of these articles in awhile even though the reasons for owning bonds at these yields defy logic</p></li>\n</ul>\n\n<p>Potential Risks:</p>\n\n<ul>\n<li><p>(Perennial) - China dumping U.S. Treasuries </p></li>\n<li><p>Higher Treasury rate = higher mortgage rates, decrease in home values + many delinquent mortgages due to pandemic</p></li>\n<li><p>Does increasing yield on treasuries mean that Washington is increasingly going to be paying out higher amounts of interest on its deficit spending?  Could this lead to a credit downgrade? We know a low rate is good for stocks and real estate, but is it also good for a government that&#39;s unable to dig itself out of a fiscal hole and in fact keeps digging deeper?</p></li>\n</ul>\n\n<p>IDK what I&#39;m talking about really, these are just a few random thoughts that I can&#39;t piece together very smoothly.</p>\n</div><!-- SC_ON -->",
  "score": 213,
  "permalink": "/r/investing/comments/ll6h23/watching_the_10year_like_a_hawk/",
  "subreddit": "investing",
  "id": "ll6h23",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728621155
}