{
  "author": "TerribleD",
  "original_created_utc": 1630848381,
  "title": "I Quit Coinbase and am Now Buying from ATM's Only",
  "created_utc": 1630889743,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve used Coinbase since 2017 and have also used River, Kraken and CashApp to purchase sats, but I&#39;m not liking the vibe from KYC exchanges anymore. I think Strike is fine, but again... KYC.</p>\n\n<p>The ATM I use is right across the street from my business, private, and super easy to transfer sats to my MUUN wallet (and then on to my cold wallet) and not much more expensive than Coinbase. The daily limit is 900 USD which is fine with me so I don&#39;t see the downside.</p>\n\n<p>Edit: Many of the comments below exist to frighten buyers away from private buys of bitcoin eg., &quot;there is no privacy&quot;, &quot; ATM&#39;s are scammy rip-offs&quot;, etc.  Just understand that there are government shills on this subreddit who&#39;s job it is to spread FUD about the freedom bitcoin can bring.</p>\n</div><!-- SC_ON -->",
  "score": 163,
  "permalink": "/r/Bitcoin/comments/pid2fs/i_quit_coinbase_and_am_now_buying_from_atms_only/",
  "subreddit": "Bitcoin",
  "id": "pid2fs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've used Coinbase since 2017 and have also used River, Kraken and CashApp to\npurchase sats, but I'm not liking the vibe from KYC exchanges anymore. I think\nStrike is fine, but again... KYC.\n\nThe ATM I use is right across the street from my business, private, and super\neasy to transfer sats to my…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は2017年からCoinbaseを使用しており、またRiver、Kraken、CashAppを使用して\nサットを購入していましたが、KYC取引所の雰囲気が好きではなくなってきました。私が思うに\nストライクはいいんだけど、また...。KYCです。\n\n私が使っているATMは、私の仕事場の真向かいにあり、プライベートで、超\nサットの送金も簡単です。",
      "title": "コインベースを辞めて、今はATMのみで購入しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我从2017年开始使用Coinbase，也曾使用River、Kraken和CashApp来购买萨特。\n购买萨特，但我不喜欢KYC交易所的氛围了。我认为\nStrike还不错，但还是那句话... KYC。\n\n我使用的自动取款机就在我公司对面，是私人的，而且超级容易将卫星转移到我的公司。\n我使用的自动取款机就在我的公司对面，是私人的，而且超级容易将萨特转到我的...",
      "title": "我退出了Coinbase，现在只从ATM机上购买。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我從2017年開始使用Coinbase，也曾使用River、Kraken和CashApp來購買薩特。\n購買薩特，但我不喜歡KYC交易所的氛圍了。我認爲\nStrike還不錯，但還是那句話... KYC。\n\n我使用的自動取款機就在我公司對面，是私人的，而且超級容易將衛星轉移到我的公司。\n我使用的自動取款機就在我的公司對面，是私人的，而且超級容易將薩特轉到我的...",
      "title": "我退出了Coinbase，現在只從ATM機上購買。"
    }
  ]
}