{
  "author": "Faze-Cumshot",
  "original_created_utc": 1636697425,
  "title": "Which project are you losing hope day by day?",
  "created_utc": 1636716883,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>2021 was a great year for majority of the market, most of the cryptocurrencies pumped alot. Some even did 100x and still pumping to this day. There were some disappointing coins as well which had many expectations but failed. Then there were some coins/tokens which literally didn&#39;t pump on it&#39;s own but got dragged upward by BTC pump. So which coin you are or were holding that you have no hope for it&#39;s future. Mention the reasons so it helps others to make their own decision. Also I would like to know what made you invest in that project.</p>\n</div><!-- SC_ON -->",
  "score": 175,
  "permalink": "/r/CryptoCurrency/comments/qs4yr8/which_project_are_you_losing_hope_day_by_day/",
  "subreddit": "CryptoCurrency",
  "id": "qs4yr8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "2021 was a great year for majority of the market, most of the cryptocurrencies\npumped alot. Some even did 100x and still pumping to this day. There were some\ndisappointing coins as well which had many expectations but failed. Then there\nwere some coins/tokens which literally didn't pump on it's own…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2021年は、市場の大部分にとって素晴らしい年でした。\n大幅に上昇した。中には100倍になったものもあり、今でもその勢いは衰えていません。一方で、多くの期待を背負いながら\n期待していたのに失敗してしまった残念なコインもありました。それから\n文字通り、それだけではパンプしなかったコイン／トークンもあった...。",
      "title": "日に日に希望を失っていくのはどのプロジェクトですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "2021年对大多数市场来说是伟大的一年，大多数加密货币\n涨了很多。有些甚至达到了100倍，并且至今仍在抽水。也有一些\n也有一些令人失望的币，它们有很多期望，但都失败了。然后还有\n也有一些硬币/代币，从字面上看，它自己并没有抽水......",
      "title": "你对哪个项目一天天失去希望？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "2021年對大多數市場來說是偉大的一年，大多數加密貨幣\n漲了很多。有些甚至達到了100倍，並且至今仍在抽水。也有一些\n也有一些令人失望的幣，它們有很多期望，但都失敗了。然後還有\n也有一些硬幣/代幣，從字面上看，它自己並沒有抽水......",
      "title": "你對哪個項目一天天失去希望？"
    }
  ]
}