{
  "author": "GBBL",
  "the_new_excerpt": "It’s so tempting to take a look at the portfolio when you wake up in the middle\nof the night. It’s been such a long time and the phone is right there. Please\ndon’t do it. You won’t go back to sleep.\n\nPhones emit blue light which tells your body it’s tome to wake up. Plus the\ndopamine reward we get…",
  "original_created_utc": 1617552063,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "当你半夜醒来的时候，看一眼投资组合是那么的诱人。\n的夜晚。好久不见，电话就在那里。请你\n不要这样做。你不会再睡了。\n\n手机会发出蓝光，告诉你的身体该起床了。再加上\n我们得到的多巴胺奖励...",
      "title": "如果你在夜间醒来，千万不要检查你的投资组合。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當你半夜醒來的時候，看一眼投資組合是那麼的誘人。\n的夜晚。好久不見，電話就在那裏。請你\n不要這樣做。你不會再睡了。\n\n手機會發出藍光，告訴你的身體該起牀了。再加上\n我們得到的多巴胺獎勵...",
      "title": "如果你在夜間醒來，千萬不要檢查你的投資組合。"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "途中で目が覚めたときにポートフォリオを見てみたくなりますよね\n夜中に目が覚めたときにポートフォリオを見たくなります。こんなに久しぶりなのに、電話がすぐそこにあるんです。お願い\nしないでください。眠りに戻れなくなりますよ。\n\nスマホはブルーライトを発し、体に「そろそろ起きろ」と教えてくれます。さらに、私たちは\nドーパミンの報酬も得られます...",
      "title": "夜中に目が覚めても、絶対にポートフォリオを確認しないでください。"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "途中で目が覚めたときにポートフォリオを見てみたくなりますよね\n夜中に目が覚めたときにポートフォリオを見たくなります。こんなに久しぶりなのに、電話がすぐそこにあるんです。お願い\nしないでください。眠りに戻れなくなりますよ。\n\nスマホはブルーライトを発し、体に「そろそろ起きろ」と教えてくれます。さらに、私たちは\nドーパミンの報酬も得られます...",
      "title": "夜中に目が覚めても、絶対にポートフォリオを確認しないでください。"
    }
  ],
  "title": "NEVER check your portfolio if you wake up during the night.",
  "created_utc": 1617568234,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It’s so tempting to take a look at the portfolio when you wake up in the middle of the night. It’s been such a long time and the phone is right there. Please don’t do it. You won’t go back to sleep.</p>\n\n<p>Phones emit blue light which tells your body it’s tome to wake up. Plus the dopamine reward we get for checking our portfolio is going to provide a surge of energy that will jar you out of your sleep.</p>\n\n<p>When we’re tired, we make crap decisions. Sell Bitcoin for the shitcoin that’s pumping, sure why not. Trade all my ETH for ERC 20s. Sure. This game is hard enough as is and you need your brain in top condition to win.</p>\n\n<p>If you’re gonna check this at night, make sure you have night shift or a blue light filter enabled in your phone. It’s not perfect but it’ll help you stay sleepy.</p>\n\n<p>Stay well rested out there and drink some water!</p>\n</div><!-- SC_ON -->",
  "score": 710,
  "permalink": "/r/CryptoCurrency/comments/mjyzee/never_check_your_portfolio_if_you_wake_up_during/",
  "subreddit": "CryptoCurrency",
  "id": "mjyzee",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961875630
}