{
  "author": "Kaizenmz",
  "the_new_excerpt": "Recently my friend tried to send money (several times) from his HSBC account to\nbinance and it was blocked.\n\nIt turns out HSBC doesn't allow payments for cryptocurrencies. They also banned\nbuying microstrategy stocks.\n\nI'm so shocked they have the audacity to do this! Surely this solidifies…",
  "original_created_utc": 1620038288,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、私の友人がHSBCの口座からbinanceに送金しようとしましたが（数回）、ブロックされました。\nバイナンスに送金しようとしたところ、ブロックされてしまいました。\n\nHSBCは暗号通貨の支払いを許可していないことがわかりました。また、マイクロストラテジー株の購入も禁止しています。\nマイクロストラテジー銘柄の購入も禁止しています。\n\n彼らがこのようなことをする大胆さを持っていることにとてもショックを受けています! 確かにこれは強固な...",
      "title": "HSBCをお使いの方は、すぐに切り替えてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近我的朋友试图从他的汇丰银行账户汇款（几次）到\nbinance，但被阻止了。\n\n原来，汇丰银行不允许为加密货币付款。他们还禁止\n购买微型战略股票。\n\n我很震惊，他们竟然敢这么做！我不知道该怎么办。当然，这巩固了...",
      "title": "如果你正在使用汇丰银行作为你的银行，请立即转换!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近我的朋友試圖從他的匯豐銀行賬戶匯款（幾次）到\nbinance，但被阻止了。\n\n原來，匯豐銀行不允許爲加密貨幣付款。他們還禁止\n購買微型戰略股票。\n\n我很震驚，他們竟然敢這麼做！我不知道該怎麼辦。當然，這鞏固了...",
      "title": "如果你正在使用匯豐銀行作爲你的銀行，請立即轉換!"
    }
  ],
  "title": "If you are using HSBC as your bank switch immediately!",
  "created_utc": 1620052469,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Recently my friend tried to send money (several times) from his HSBC account to binance and it was blocked. </p>\n\n<p>It turns out HSBC doesn&#39;t allow payments for cryptocurrencies. They also banned buying microstrategy stocks. </p>\n\n<p>I&#39;m so shocked they have the audacity to do this! Surely this solidifies and shows the importance of decentralisation in crypto.</p>\n\n<p>I also found out ironically that they helped money launder for drug cartels in Mexico. </p>\n\n<p>If you are still using this awful bank please do yourself a favour and switch.</p>\n</div><!-- SC_ON -->",
  "score": 924,
  "permalink": "/r/CryptoCurrency/comments/n3sxpc/if_you_are_using_hsbc_as_your_bank_switch/",
  "subreddit": "CryptoCurrency",
  "id": "n3sxpc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380964316
}