{
  "author": "NinjaAssassino",
  "original_created_utc": 1634651334,
  "title": "Do not FOMO and do not take a LOAN",
  "created_utc": 1634661232,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Since weird stuff is happening right now..  Bitcoin joined New York Stock Exchange, Bitcoin and Ethereum is coming closer and closer to ATH, Elon is shilling his favorite Crypto coins, everyone and their mother are making Crypto predictions that make no sense and are completly false.</p>\n\n<p>Please for god&#39;s sake, dont take a LOAN to invest into this... and even worse, do not leverage the loan on exchanges, that&#39;s pure suicide ticket.<br/>\nSell your car, sell your stuff, get money however you want, but skip the bank loan part.</p>\n\n<p>&#x200B;</p>\n\n<p>Thanks for coming to my ted talk.</p>\n</div><!-- SC_ON -->",
  "score": 176,
  "permalink": "/r/CryptoCurrency/comments/qbbwdr/do_not_fomo_and_do_not_take_a_loan/",
  "subreddit": "CryptoCurrency",
  "id": "qbbwdr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Since weird stuff is happening right now.. Bitcoin joined New York Stock\nExchange, Bitcoin and Ethereum is coming closer and closer to ATH, Elon is\nshilling his favorite Crypto coins, everyone and their mother are making Crypto\npredictions that make no sense and are completly false.\n\nPlease for…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今、変なことが起きているので...。ビットコインがニューヨーク証券取引所に参加\nビットコインとイーサリアムはどんどんATHに近づいているし、イーロンはお気に入りの暗号コインを売り込んでいる。\nエロンはお気に入りの暗号コインを売り込み、誰もがその母親も暗号予測をしている。\n予測をしていますが、それは意味をなさず、完全に間違っています。\n\nお願いします...",
      "title": "FOMOしない、LOANしない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "由于现在正在发生奇怪的事情。比特币加入纽约证券交易所\n交易所，比特币和以太坊离ATH越来越近，埃隆正在向他最喜欢的加密货币推销。\n兜售他最喜欢的加密货币，每个人和他们的母亲都在做加密货币的预测。\n预测，这些预测毫无意义，完全是错误的。\n\n请为...",
      "title": "不要FOMO，不要贷款。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "由於現在正在發生奇怪的事情。比特幣加入紐約證券交易所\n交易所，比特幣和以太坊離ATH越來越近，埃隆正在向他最喜歡的加密貨幣推銷。\n兜售他最喜歡的加密貨幣，每個人和他們的母親都在做加密貨幣的預測。\n預測，這些預測毫無意義，完全是錯誤的。\n\n請爲...",
      "title": "不要FOMO，不要貸款。"
    }
  ]
}