{
  "author": "RubiksPoint",
  "the_new_excerpt": "Warnings: I own a few shares of Corsair, my evaluation may be biased. I am not a\nfinancial advisor. This is not financial advice. This is the first DD I've\nposted, I probably messed something up.\n\nTL;DR at the bottom.\n\nThis is the first DD I'm posting, let me know anything I should fix.\n\n\nWHO IS…",
  "original_created_utc": 1614893223,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "警告：我拥有一些Corsair的股票，我的评价可能会有偏差。我拥有一些Corsair的股票，我的评价可能有偏差。我不是一个\n财务顾问。这不是理财建议。这是我的第一个DD\n发布了，我可能搞出了一些东西。\n\nTL;DR在底部。\n\n这是我发的第一个DD，让我知道什么我应该修复。\n\n\n谁是...",
      "title": "Corsair尽职调查 ($CRSR)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "警告：我擁有一些Corsair的股票，我的評價可能會有偏差。我擁有一些Corsair的股票，我的評價可能有偏差。我不是一個\n財務顧問。這不是理財建議。這是我的第一個DD\n發佈了，我可能搞出了一些東西。\n\nTL;DR在底部。\n\n這是我發的第一個DD，讓我知道什麼我應該修復。\n\n\n誰是...",
      "title": "Corsair盡職調查 ($CRSR)"
    }
  ],
  "title": "Corsair Due Diligence ($CRSR)",
  "created_utc": 1614906080,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Warnings: I own a few shares of Corsair, my evaluation may be biased. I am not a financial advisor. This is not financial advice. This is the first DD I&#39;ve posted, I probably messed something up.</p>\n\n<p>TL;DR at the bottom.</p>\n\n<p>This is the first DD I&#39;m posting, let me know anything I should fix.</p>\n\n<h1>Who is Corsair?</h1>\n\n<p>Corsair is a company that makes computer components such as fans, power supplies, SSDs, cases, coolers, RAM, and other peripherals. Since the pandemic, the gaming industry has seen huge growth with an influx of people looking for ways to spend time and the new dependence on home computers. It is my opinion that even after the pandemic, many will continue to purchase computer components and many will continue to work from home if possible.</p>\n\n<h1>News.</h1>\n\n<p>Recently, Corsair has acquired Visuals by Impulse. Visuals is a streamer&#39;s tool to create overlays and alerts on their stream. With some streamers making millions of dollars per year, there is no doubt that streaming is an appealing prospect. In recent years, the number of active streamers has gone from around 3 million to 9 million with no signs of slowing down. The streaming industry is just getting started.</p>\n\n<p>Streamers Per Year:</p>\n\n<p><a href=\"https://imgur.com/a/WPUFhoE\">https://imgur.com/a/WPUFhoE</a></p>\n\n<p>Corsair also released its earnings report on February 9th. Corsair beat their estimate but not expectations, so the stock dipped right after earnings from $44.70 down to $33.68 today. The tech selloff over the week has also affected the stock greatly. Other than that, the stock has been relatively quiet.</p>\n\n<h1>Income and Revenue.</h1>\n\n<p>Corsair makes a majority of its revenue, $1.7bn up 55% from last year, from selling PC components(~69%), and a good chunk of revenue comes from peripherals(~31%). Corsair has seen consistent growth in revenue over the past couple of years and quarters.</p>\n\n<p>Net Revenue was around 465 million, <strong>up around 241 million from last year(~192%).</strong></p>\n\n<p>Net Income was at 103 million up from -8 million.</p>\n\n<h1>Pros:</h1>\n\n<p>- The price to book ratio is very low compared to the sector&#39;s(About 5 compared to 18).</p>\n\n<p>- The intrinsic value (at least according to my calculation) is higher than the current price even with a margin of safety of 10%.</p>\n\n<p>- Corsair is a very well respected brand in computers.</p>\n\n<p>- In the next few years, there will be big changes in the CPU market, and DDR5 RAM may come out, leading many to be looking for an upgrade.</p>\n\n<p>- The GPU shortage may end soon and people will be looking for PSUs to feed the GPUs and maybe fans and cases to better cool their PCs. Also, with the releases of the 3060 and AMD&#39;s equivalent coming soon to hopefully replace the 1060, many will be looking for new computer components. The 1060 currently makes up 9.62% of the GPUs used by Steam(gaming) users. With around 24% of Steam users using 3-4-year-old GPUs, there is no doubt that many will be looking for an upgrade soon. <strong>KEEP IN MIND</strong>, Corsair does <strong>not</strong> sell GPUs, but they sell items that are often purchased with GPUs.</p>\n\n<p>- Very high short float ~25% (Short squeeze?).</p>\n\n<p>- If you believe in Fibonacci retracements, Corsair is in the buy zone based on a 1-Year, 1-Day candle retracement from $22.97 to $51.26, -61.8% retracement puts the value at around $67.8.</p>\n\n<h1>Cons:</h1>\n\n<p>- There is a lot of competition in the industry, a lot of companies make SSD&#39;s, PSUs, RAM, etc.</p>\n\n<p>- Due to the silicone shortage, upgrading a PC is harder so it may lower the odds that people need new RAM, power supplies(power-hungry GPUs and CPUs), or cooling. This may be a good thing because once the shortage ends(hopefully), there should be a huge increase in the number of people purchasing products for their PCs.</p>\n\n<p>- I&#39;m probably biased towards Corsair.</p>\n\n<p>- Current bearish momentum.</p>\n\n<p>TL;DR: I&#39;m bullish on Corsair in the long term, I believe that it is very undervalued right now. With changes coming to the computing industry, I see very big potential in the growth of Corsair.</p>\n\n<p>Again, I am not a financial advisor. This is not financial advice. This is the first DD I&#39;ve posted, I probably messed something up.</p>\n</div><!-- SC_ON -->",
  "score": 238,
  "permalink": "/r/stocks/comments/lxvvwr/corsair_due_diligence_crsr/",
  "subreddit": "stocks",
  "id": "lxvvwr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542575859
}