{
  "author": "hyunrivet",
  "original_created_utc": 1626008565,
  "title": "What are arguments against \"Right to repair\"?",
  "created_utc": 1626031588,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So this is obviously a topic of huge interest, and likely to heat up even further. Seems pretty easy to me to vilify greedy companies/corporations and make it a simple case of profit-motivated planned obsolescence vs everyone else trying to reduce wasted money and resources. </p>\n\n<p>Are there any even remotely good arguments against the &quot;right to repair&quot; campaign in its current form? Is there something being missed in the internet echo chamber or is it really as black and white as it seems?</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/NoStupidQuestions/comments/oi42n2/what_are_arguments_against_right_to_repair/",
  "subreddit": "NoStupidQuestions",
  "id": "oi42n2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So this is obviously a topic of huge interest, and likely to heat up even\nfurther. Seems pretty easy to me to vilify greedy companies/corporations and\nmake it a simple case of profit-motivated planned obsolescence vs everyone else\ntrying to reduce wasted money and resources.\n\nAre there any even…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは明らかに大きな関心事であり、今後もさらに加熱する可能性があります。\nさらなる盛り上がりを見せることでしょう。貪欲な企業や会社を悪者にして、利益目的の計画的陳腐化と他の人々との単純なケースにするのはとても簡単なことだと思います。\n利益のために計画された陳腐化と、それ以外の人たちの陳腐化という単純なケースにするのは簡単です。\n無駄なお金や資源を減らそうとしている他の人たち。\n\n欲張りな企業を誹謗中傷するのは簡単です。",
      "title": "Right to repair」に対する反論はありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，这显然是一个备受关注的话题，而且可能会进一步升温。\n进一步升温。在我看来，诋毁贪婪的公司/企业似乎很容易，并且\n让它成为一个以利润为动机的计划性淘汰的简单案例，与其他所有人相比\n试图减少浪费的金钱和资源。\n\n是否有任何甚至...",
      "title": "反对 \"维修权 \"的论点是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，這顯然是一個備受關注的話題，而且可能會進一步升溫。\n進一步升溫。在我看來，詆譭貪婪的公司/企業似乎很容易，並且\n讓它成爲一個以利潤爲動機的計劃性淘汰的簡單案例，與其他所有人相比\n試圖減少浪費的金錢和資源。\n\n是否有任何甚至...",
      "title": "反對 \"維修權 \"的論點是什麼？"
    }
  ]
}