{
  "author": "Pupulikjan",
  "original_created_utc": 1640034752,
  "title": "Rules to live by in crypto markets.",
  "created_utc": 1640061876,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Here are some rules I have created and learned from others. These rules saved my ass multiple times. Maybe it may be of help to some of you.  Feel free to add your personal rules to make the list more powerful. &lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Never invest money you will need in a short period of time. This is not a game, so quit playing. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Never invest money you will need during an emergency. You might be down at that moment. It ain’t fun. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Invest in solid projects and forget about the money you invested. Solid projects go up and down on the daily but on the yearly it’s mostly up. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Get use to 20-60% drops and months if not years of no sign of life. The faster you get use to this the less stressed you will be. Price does not always equal the true value of the project. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;ALWAYS GO AGAINST THE MARKET, by that I mean panic BUY when everyone is panic selling, take profit when everyone is FOMOing in. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Time in the market beats timing the market! Persistence always wins.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Everybody is a genius in a bull run. And a dumbass in a bear winter. Never let your wins go to your head and losses to your heart. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;NEVER SHARE YOUR PRIVATE KEY OR INPUT YOUR 12/24 WORD PHRASE IF YOU ARE ASKED BY ANYONE ANYWHERE.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;If you get an email that causes you fear and a heart attack it’s most likely a scam. ALWAYS DOBLE CHECK THE EMAIL, if it’s a scam it will be some random email. &lt;/li&gt;\n&lt;/ol&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;NEVER CLICK RANDOM LINKS IN EMAILS! You ain’t getting shit free in life.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;If it’s too good to be true, it most likely is. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Meme coins are a gamble not an investment, always take profit or at least your initial investment. Have something to show for it, rich on paper is not something to be proud of. Life changing money mean nothing if you don’t change your life with them.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Never chase pumps. You missed it. It’s gone. Move on. Don’t chase it. You playing with fire. &lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;14.Never panic sell, there will almost always be a bounce if you want to sell do it then. &lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;(For USA residents) If you sell for profit or switch between cryptos be ready to pay taxes. Yes you can hide it, but remember sooner or later Uncle Sam will get his piece of the pie if not the whole cake. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Always have a nice stack on the side for major dip days. Millionaires are made during bear markets. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The trend is your friend until the end. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Do not leave large funds on an exchange, not your key not your crypto. Go ask those who used mt gox, cryptopia and many other “good exchanges”.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Be prepared to be down or even for at least 2 years, yes even if you are up 1000%, bear markets can be brutal. Ask those who were up in late 2017. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Quality over quantity! It’s better to invest big on 5 projects than small on 15 projects. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Don’t hate on Bitcoin. It made all this possible. It will remain king no matter what place it’s in. It’s like hating your grandpa for being slower than you. He is the reason you alive in the first place. &lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Been in this game since 2016, I know it ain’t much compared to some other cats on this forum but I believe they would also agree.feel free to add shit I missed.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 152,
  "permalink": "/r/CryptoCurrency/comments/rkxb9r/rules_to_live_by_in_crypto_markets/",
  "subreddit": "CryptoCurrency",
  "id": "rkxb9r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Here are some rules I have created and learned from others. These rules saved my\nass multiple times. Maybe it may be of help to some of you. Feel free to add\nyour personal rules to make the list more powerful.\n\n 1.  Never invest money you will need in a short period of time. This is not a\n    …",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここでは、私が作り、他の人から学んだルールを紹介します。これらのルールは、私を救ってくれました。\n何度も何度も。もしかしたら、皆さんのお役に立てるかもしれません。自由に追加してください。\nこのリストをより強力なものにするために、あなたの個人的なルールを教えてください。\n\n 1.  短期間で必要になるお金は絶対に投資しない。これは\n    ...",
      "title": "暗号市場で生きるためのルール"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "以下是我创建的和从别人那里学到的一些规则。这些规则救了我\n屁股多次。也许它对你们中的一些人可能有帮助。请随意添加\n你的个人规则，使这个列表更加强大。\n\n 1.  永远不要投资你在短时间内需要的钱。这不是一个\n    ...",
      "title": "在加密货币市场的生活规则。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "以下是我創建的和從別人那裏學到的一些規則。這些規則救了我\n屁股多次。也許它對你們中的一些人可能有幫助。請隨意添加\n你的個人規則，使這個列表更加強大。\n\n 1.  永遠不要投資你在短時間內需要的錢。這不是一個\n    ...",
      "title": "在加密貨幣市場的生活規則。"
    }
  ]
}