{
  "author": "katiecharm",
  "original_created_utc": 1627412617,
  "title": "I don’t give a damn what regulators try to do. Privacy is a fundamental human right, and people too easily forget that. Crypto wasn’t created to play nice with the corrupt oligarchs.",
  "created_utc": 1627433532,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><em>edit: I can tell by the downvotes, I’ve touched a nerve with those who love to be obedient little slaves to the US Dollar and the CCP.  Wake up.  Stop kneeling to tyranny.</em><br/>\n———————————-  </p>\n\n<p>Every time I discuss my enthusiasm about privacy coin tech like Monero, or Beam, or Firo - this is almost always the response:  “<em>i don’t think it’s a good idea, the regulators will probably ban it.  its much better to buy taco dog shit coin.</em>”  </p>\n\n<p>The purpose of crypto is not to make you more US Dollars.  The purpose of crypto is to give individual human begins the power and freedom of money once more.  Yes, you can use it to earn more US Dollars, just as you can use it to buy heroin and pipe bombs online.  But that’s not why it was initially created.  </p>\n\n<p>Embedded in the Bitcoin genesis block is everything you need to know about Satoshi’s intent: a headline from the Times on that day about how the banks were getting yet <em>another</em> bailout.  The traditional fiat system of monetary policy was cracking, and Bitcoin was the first generation of something better.  </p>\n\n<p>At the time it wasn’t known how to incorporate good privacy (other than the existing pseudo anonymous address system) into Bitcoin, or Satoshi would have likely considered it.  He even mused about it in public BitcoinTalk threads.  </p>\n\n<p>But then in the mid 2010’s a miracle happened - new math was anonymously put forward that let us do exactly this.  The Cryptonote Protocol and Mimblewimble (yes yes, moon math too) have given us powerful new tools to establish decentralized money that’s also fundamentally private.  This (along with defi) is the next generation of cryptocurrency tech.  </p>\n\n<p><strong>It doesn’t matter what the oligarch dinosaurs think</strong>.  We’re not here to beg them for permission to have freedom.  <strong>Privacy is our fundamental human right</strong>.  And those corrupt fucks have shown again and again they can’t be trusted to take that right away.  </p>\n\n<p>So stop cowering to their tyranny, and stop thinking of crypto as an “<em>uwu pweeesze may i mistress yellen??</em> O.O” endeavor.  Crypto is here to disrupt and perhaps even destroy the corrupt perpetual war machine that is fiat, and even if <em>you</em> use it’s immense power for something else - the true face of this technology is far more majestic than most can comprehend.  </p>\n\n<p>Embrace it.  And embrace your fundamental right to privacy as a sovereign intelligence on this Earth.  Finally, for the first time in centuries we have the freedom of money once more.  Of course the oligarchs aren’t happy about that.</p>\n</div><!-- SC_ON -->",
  "score": 166,
  "permalink": "/r/CryptoCurrency/comments/ost0t2/i_dont_give_a_damn_what_regulators_try_to_do/",
  "subreddit": "CryptoCurrency",
  "id": "ost0t2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "edit: I can tell by the downvotes, I’ve touched a nerve with those who love to\nbe obedient little slaves to the US Dollar and the CCP. Wake up. Stop kneeling\nto tyranny.\n———————————-\n\nEvery time I discuss my enthusiasm about privacy coin tech like Monero, or Beam,\nor Firo - this is almost always the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "edit: ダウンボードを見ると、米ドルと中国共産党の従順な小さな奴隷になるのが好きな人たちの神経を逆なでしてしまったようです。\nアメリカドルと中国共産党に従順な小さな奴隷であることが好きな人たちの神経を逆なでした。目を覚ませ。跪くのをやめて\n暴君に跪くのはやめよう。\n------------\n\nMoneroやBeam.やFiroのようなプライバシーコイン技術に対する私の熱意を語るたびに、このような人が出てきます。\nFiroのようなプライバシーコイン技術への熱意を語るたびに、ほとんどの場合、これは...",
      "title": "レギュレーターが何をしようと知ったことではありません。プライバシーは基本的な人権ですが、人々はそれを簡単に忘れてしまいます。暗号は、腐敗したオリガルヒと仲良くするために作られたものではありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "编辑：我可以从降票中看出，我已经触动了那些喜欢做美元和中共的小奴隶的人的神经\n那些喜欢做美元和中共的听话小奴隶的人的神经。醒醒吧。不要再跪在\n向暴政下跪。\n------------\n\n每次我讨论我对隐私币技术的热情时，如Monero，或Beam。\n或Firo - 这几乎总是...",
      "title": "我根本不在乎监管机构试图做什么。隐私是一项基本人权，而人们太容易忘记这一点。创建加密货币并不是为了与腐败的寡头们打好关系。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "編輯：我可以從降票中看出，我已經觸動了那些喜歡做美元和中共的小奴隸的人的神經\n那些喜歡做美元和中共的聽話小奴隸的人的神經。醒醒吧。不要再跪在\n向暴政下跪。\n------------\n\n每次我討論我對隱私幣技術的熱情時，如Monero，或Beam。\n或Firo - 這幾乎總是...",
      "title": "我根本不在乎監管機構試圖做什麼。隱私是一項基本人權，而人們太容易忘記這一點。創建加密貨幣並不是爲了與腐敗的寡頭們打好關係。"
    }
  ]
}