{
  "author": "Weaver96",
  "the_new_excerpt": "Have you ever noticed rule #11 in Monopoly? If not, you must read this:\n\n> 11. What if the bank runs out of money?\n> \n> Some players think the bank is bankrupt if it runs out of money. The bank\n> never goes bankrupt. To continue playing, use slips of paper to keep track of\n> each player's banking…",
  "original_created_utc": 1612920173,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "你注意过大富翁中的第11条规则吗？如果没有，你一定要看看这个。\n\n> 11. 如果银行没钱了怎么办？\n> \n>有的玩家认为银行没钱了就破产了。银行\n>永远不会破产。要想继续玩下去，就用纸条来记录。\n>每个玩家的银行...",
      "title": "大富翁从字面上教你为什么加密是未来。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你注意過大富翁中的第11條規則嗎？如果沒有，你一定要看看這個。\n\n> 11. 如果銀行沒錢了怎麼辦？\n> \n>有的玩家認爲銀行沒錢了就破產了。銀行\n>永遠不會破產。要想繼續玩下去，就用紙條來記錄。\n>每個玩家的銀行...",
      "title": "大富翁從字面上教你爲什麼加密是未來。"
    }
  ],
  "title": "Monopoly literally teaches you why crypto is the future.",
  "created_utc": 1612942504,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Have you ever noticed rule #11 in Monopoly? If not, you must read this:  </p>\n\n<blockquote>\n<p><strong>11. What if the bank runs out of money?</strong>  </p>\n\n<p>Some players think the bank is bankrupt if it runs out of money. <strong>The bank never goes bankrupt.</strong> To continue playing, use slips of paper to keep track of each player&#39;s banking transactions - until the bank has enough paper money to operate again. <strong>The banker may also issue &quot;new&quot; money on slips of ordinary paper.</strong></p>\n</blockquote>\n\n<p>This game (created in 1904) literally teaches you about money and how banks work. Yet very few people question why banks literally never go bankrupt. In case of a financial crisis, banks are always among the first ones to get financial aid from governments. Not the people, but the banks. </p>\n\n<p>We need crypto to succeed more than many of us think we need it. </p>\n\n<p><em>Fun fact: it was originally meant to demonstrate how property owners get richer and richer while tenants are impoverished.</em></p>\n</div><!-- SC_ON -->",
  "score": 364,
  "permalink": "/r/CryptoCurrency/comments/lginik/monopoly_literally_teaches_you_why_crypto_is_the/",
  "subreddit": "CryptoCurrency",
  "id": "lginik",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123197364
}