{
  "author": "Jmonahan581",
  "the_new_excerpt": "CLNE Cornering the Market\n\nI have never posted in here before, but I like this company and I would like to\nhere others input. I posted some details below, but there is much much more. I\nwould love to chat with any and all that have any questions or input.\n\nA little basis on Clean Energy Fuels. The…",
  "original_created_utc": 1623799938,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "CLNEが市場を追い詰める\n\n今までここに投稿したことはありませんでしたが、私はこの会社が好きなので、他の人の意見を聞きたいです。\n他の人の意見も聞いてみたい。下記に詳細を掲載しましたが、他にもたくさんあります。I\n質問や意見をお持ちの方とお話ししたいと思います。\n\nClean Energy Fuelsの基本情報です。その...",
      "title": "RNG市場におけるCLNEの優位性"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "CLNE 占领市场\n\n我以前从未在这里发过帖，但我喜欢这家公司，我想在这里听听别人的意见。\n这里其他人的意见。我在下面张贴了一些细节，但还有很多很多。I\n愿意与所有有任何问题或意见的人聊天。\n\n关于清洁能源燃料的一点基础。这是我的想法。",
      "title": "CLNE在RNG市场的良好定位"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "CLNE 佔領市場\n\n我以前從未在這裏發過帖，但我喜歡這家公司，我想在這裏聽聽別人的意見。\n這裏其他人的意見。我在下面張貼了一些細節，但還有很多很多。I\n願意與所有有任何問題或意見的人聊天。\n\n關於清潔能源燃料的一點基礎。這是我的想法。",
      "title": "CLNE在RNG市場的良好定位"
    }
  ],
  "title": "CLNE Well Positioned in the RNG market",
  "created_utc": 1623805761,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>CLNE Cornering the Market</p>\n\n<p>I have never posted in here before, but I like this company and I would like to here others input.  I posted some details below, but there is much much more.  I would love to chat with any and all that have any questions or input.</p>\n\n<p>A little basis on Clean Energy Fuels.  The company currently owns 570 fueling stations across the United States and Canada.  They specialize in high grade clean burning Renewable Natural Gas (RNG). They get their fuel by capturing methane released from dairies and landfills.  This fuel is actually carbon negative which positions the company well with the government having entered back into the Paris Climate Agreement.</p>\n\n<p>Clean Energy Fuels is in a couple of joint ventures with some big oil names you might recognize (Total and BP).  Along with that the company has signed many fueling contracts with waste companies, cities, Port of Los Angeles, LA Metro, UPS, USPS,and many other trucking companies.  On top of that they have recently added a contract with Amazon which recently ordered a fleet of 700 CNG trucks.</p>\n\n<p>NEWPORT BEACH, Calif.--(BUSINESS WIRE)--Jun. 14, 2021-- The demand for low- and negative-carbon renewable fuel has increased as more companies look for solutions to address climate change. As the leading provider of renewable natural gas (RNG) for the transportation industry, Clean Energy Fuels Corp. (NASDAQ: CLNE) is now well-positioned to turn their customers’ sustainability goals into reality.</p>\n\n<p>This press release features multimedia. View the full release here: <a href=\"https://www.businesswire.com/news/home/20210614005069/en/\">https://www.businesswire.com/news/home/20210614005069/en/</a></p>\n\n<p>(Graphic: Business Wire)</p>\n\n<p>Today at its annual shareholders meeting, Clean Energy introduced a new company logo, a cornerstone of an entirely new brand identity that aligns with its growing commitment to expand its renewable fuel solution. This includes investing in the development of RNG from dairies and other agricultural facilities both independently and with partners TotalEnergies and bp.</p>\n\n<p>“Clean Energy’s business has pivoted to focus on an extraordinary renewable, non-fossil fuel that can actually reduce fleets&#39; carbon footprint by as much as 500%,” said Andrew J. Littlefair, president and CEO, Clean Energy. “The logo, color scheme, messaging, website and other brand elements that we introduced today denote a circular economy, where organic waste is turned into sustainable fuel, and embodies the role Clean Energy plays in helping our planet.”</p>\n\n<p>Currently, RNG represents 70 percent of the fuel sold at Clean Energy’s nationwide network of stations, and the company is on a track to provide the fuel at all its stations by 2025, meeting one of its own sustainability goals.</p>\n\n<p>As part of the new branding, Clean Energy also launched a new website with updated information about the company’s focus on being able to provide beginning-to-end solutions to meet the growing demand for RNG.</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/stocks/comments/o0rjdm/clne_well_positioned_in_the_rng_market/",
  "subreddit": "stocks",
  "id": "o0rjdm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009745212
}