{
  "author": "diddycarter",
  "the_new_excerpt": "https://www.nbcnews.com/business/economy/dow-soars-new-record-high-after-retail-sales-boom-lowest-n1264174\n\n\n\n> The Dow Jones Industrial Average crossed the 34,000 mark for the first time in\n> history on Thursday, as Wall Street surged to new record highs after a slew of\n> positive economic data,…",
  "original_created_utc": 1618509064,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "https://www.nbcnews.com/business/economy/dow-soars-new-record-high-after-retail-sales-boom-lowest-n1264174\n\n\n\n> ダウ平均株価が史上初めて34,000ドルの大台に乗りました。\n> 史上初となる34,000ドルの大台を突破したことを発表しました。\n> 肯定的な経済指標、...",
      "title": "小売売上高が好調でダウは34,000ドルに到達、週間失業保険申請件数はパンデミック後最低となる"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "https://www.nbcnews.com/business/economy/dow-soars-new-record-high-after-retail-sales-boom-lowest-n1264174\n\n\n\n> 道琼斯工业平均指数首次突破34000点大关。\n>历史上周四，华尔街在经历了一系列的暴涨之后，创下了历史新高。\n>积极的经济数据，...",
      "title": "道指在零售销售繁荣后触及34000点，每周申请失业救济人数为疫情开始以来最低。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "https://www.nbcnews.com/business/economy/dow-soars-new-record-high-after-retail-sales-boom-lowest-n1264174\n\n\n\n> 道瓊斯工業平均指數首次突破34000點大關。\n>歷史上週四，華爾街在經歷了一系列的暴漲之後，創下了歷史新高。\n>積極的經濟數據，...",
      "title": "道指在零售銷售繁榮後觸及34000點，每週申請失業救濟人數爲疫情開始以來最低。"
    }
  ],
  "title": "Dow hits 34,000 after retail sales boom, lowest weekly jobless claims since pandemic began",
  "created_utc": 1618556137,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.nbcnews.com/business/economy/dow-soars-new-record-high-after-retail-sales-boom-lowest-n1264174\">https://www.nbcnews.com/business/economy/dow-soars-new-record-high-after-retail-sales-boom-lowest-n1264174</a></p>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>The Dow Jones Industrial Average crossed the 34,000 mark for the first time in history on Thursday, as Wall Street surged to new record highs after a slew of positive economic data, including soaring retail sales and a drop in the number of weekly filings for first-time unemployment benefits.  </p>\n\n<p>The Dow rose by more almost 300 points in the morning trading session, hitting the new milestone less than one month after breaching 33,000.  </p>\n\n<p>The S&amp;P 500 jumped by 0.75 percent and the Nasdaq notched up a gain of more than 1 percent to take it across the 14,000 threshold.  </p>\n\n<p>Markets were on a tear after initial weekly jobless claims totaled 576,000 for the week ended April 10, the lowest weekly figure since March 14, 2020, according to data released Thursday by the Department of Labor. The latest number comes after 55 weeks of claims that have far surpassed the pre-pandemic average.  </p>\n\n<p>“With a huge, better-than-expected decline in new claims for unemployment assistance, at long last the economic recovery appears to be picking up speed,&quot; said Mark Hamrick, senior economic analyst at Bankrate. However, nearly 17 million Americans still receiving some form of unemployment assistance, he added.  </p>\n\n<p>Retail sales, which had fallen by 3 percent in February, jumped to an increase of 9.8 percent for the month of March, after a fresh round of stimulus checks fueled consumer spending on clothes, sporting goods and cars.  </p>\n\n<p>That data, reported Thursday morning by the Commerce Department, roundly beat forecasts for a 6.1 percent gain and showed the best month since May last year, when the first tranche of economic impact payments boosted retail spending by more than 18 percent.</p>\n</blockquote>\n</div><!-- SC_ON -->",
  "score": 43,
  "permalink": "/r/stocks/comments/mrk1zh/dow_hits_34000_after_retail_sales_boom_lowest/",
  "subreddit": "stocks",
  "id": "mrk1zh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171526124
}