{
  "author": "Linpeiru0107",
  "original_created_utc": 1634382941,
  "title": "Bitcoin has reached $60,000 for the first time since April, which is worth celebrating, after previous reports that the ETF is about to be approved",
  "created_utc": 1634398866,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Bloomberg reported earlier today that people familiar with the matter have sent a positive signal that the US Securities and Exchange Commission may approve several Bitcoin futures ETFs to start trading next week.</p>\n\n<p>In the past seven days, rumors of impending approval have resulted in a price increase of approximately US$7,000, which is equivalent to a 13% increase from US$53,000 to US$60,000. The biggest increase was in the past two days. During this period, Bitcoin rose from about 54,000 US dollars to the current high of 60,000 US dollars. This may bring BTC to a new height, but investment needs to be cautious. Also need to be treated rationally</p>\n</div><!-- SC_ON -->",
  "score": 241,
  "permalink": "/r/CryptoCurrency/comments/q9a0aj/bitcoin_has_reached_60000_for_the_first_time/",
  "subreddit": "CryptoCurrency",
  "id": "q9a0aj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Bloomberg reported earlier today that people familiar with the matter have sent\na positive signal that the US Securities and Exchange Commission may approve\nseveral Bitcoin futures ETFs to start trading next week.\n\nIn the past seven days, rumors of impending approval have resulted in a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ブルームバーグは本日、この件に詳しい人々が\n米国証券取引委員会が7つの製品を承認する可能性があるとの見解を示した。\n来週、複数のビットコイン先物ETFが取引を開始することを承認するかもしれないと、関係者が前向きなシグナルを送っていると伝えました。\n\nこの7日間で、承認が間近に迫っているという噂は、結果的に...",
      "title": "ビットコインは4月以来初めて6万ドルに達し、ETFが承認されようとしているという以前の報道を受けて、これは祝うに値するものです"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "彭博社今天早些时候报道说，熟悉此事的人发出了一个积极的信号，即美国证券交易委员会可能会批准该公司。\n一个积极的信号，美国证券交易委员会可能会批准\n几个比特币期货ETF在下周开始交易。\n\n在过去的七天里，关于即将批准的传言导致了...",
      "title": "比特币自4月以来首次达到6万美元，这是值得庆祝的，此前有报道称ETF即将获批"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "彭博社今天早些時候報道說，熟悉此事的人發出了一個積極的信號，即美國證券交易委員會可能會批准該公司。\n一個積極的信號，美國證券交易委員會可能會批准\n幾個比特幣期貨ETF在下週開始交易。\n\n在過去的七天裏，關於即將批准的傳言導致了...",
      "title": "比特幣自4月以來首次達到6萬美元，這是值得慶祝的，此前有報道稱ETF即將獲批"
    }
  ]
}