{
  "author": "icantspellthatgood",
  "original_created_utc": 1625091493,
  "title": "How do i stop being racist.",
  "created_utc": 1625096796,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was raised by a hardcore racist, “hardcore” as in would and probably still is harassing non white people on the daily assaulting them and being a all around pos, now I don’t associate myself with them anymore.</p>\n\n<p>I’ve been working on myself for about 3 years now and it’s been going great I’m at a point where the only problems I have are subconsciously, I’ll be playing frustrated or mad at something like a game and it will just slip out I don’t go out of my way to say it but it happens, I always get mad at myself and get even more frustrated when this happens and I always get so pissed off on how far I’ve come and it just happens, And I’m just wondering what am I doing wrong for me to still be doing this? What can I do to better myself further? Thanks</p>\n</div><!-- SC_ON -->",
  "score": 158,
  "permalink": "/r/NoStupidQuestions/comments/ob7zx9/how_do_i_stop_being_racist/",
  "subreddit": "NoStupidQuestions",
  "id": "ob7zx9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was raised by a hardcore racist, “hardcore” as in would and probably still is\nharassing non white people on the daily assaulting them and being a all around\npos, now I don’t associate myself with them anymore.\n\nI’ve been working on myself for about 3 years now and it’s been going great I’m\nat a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は筋金入りの人種差別主義者に育てられました。\"筋金入り \"とは、白人以外の人々に嫌がらせをするという意味で、おそらく今でもそうでしょう。\n筋金入りの人種差別主義者に育てられましたが、その筋金入りというのは、白人以外の人々に毎日嫌がらせをしたり、暴行を加えたりして\n筋金入りの人種差別主義者に育てられましたが、今ではもう彼らとは関わりたくありません。\n\n私は3年ほど前から自分自身のために努力してきましたが、とてもうまくいっています。\n今は...",
      "title": "どうすれば人種差別をやめることができるのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是被一个铁杆种族主义者抚养长大的，\"铁杆 \"是指会而且可能仍然是\n每天骚扰非白人，攻击他们，是一个全面的\n现在，我不再与他们联系。\n\n我已经为自己工作了大约3年，而且进展得很好。\n在一个...",
      "title": "我怎样才能不再成为种族主义者。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是被一個鐵桿種族主義者撫養長大的，\"鐵桿 \"是指會而且可能仍然是\n每天騷擾非白人，攻擊他們，是一個全面的\n現在，我不再與他們聯繫。\n\n我已經爲自己工作了大約3年，而且進展得很好。\n在一個...",
      "title": "我怎樣才能不再成爲種族主義者。"
    }
  ]
}