{
  "author": "ChipmunkRude6670",
  "the_new_excerpt": "Maybe this is a bit far fetched, I was just curious if any philosophical ideas\nhave ever been developed to question even this basic truth of Descartes?\n\nAlso, as evidence for his hypothesis that you might be deceived, Descartes used\nthe prof that our senses are imperfect and therefore can be fooled.…",
  "original_created_utc": 1623759063,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ちょっと突飛な話かもしれませんが、このデカルトの基本的な真理にさえ疑問を投げかけるような哲学的な考えが、これまでに生まれたことがあるかどうかを知りたいのです。\nデカルトのこの基本的な真理にさえ疑問を投げかけるような哲学的な考えは生まれなかったのでしょうか？\n\nまた、「あなたは騙されているかもしれない」という仮説の証拠として、デカルトは\n私たちの感覚は不完全であり、それゆえに騙される可能性があるという事実を利用しました....",
      "title": "コギト・エルゴ・サム」に疑問を持った哲学者はいますか？考えるのは自分自身であると、本当に確信できるだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "也许这有点牵强，我只是好奇是否有任何哲学思想\n是否有任何哲学思想来质疑笛卡尔的这一基本真理？\n\n另外，作为他的假设，即你可能被欺骗的证据，笛卡尔用\n我们的感官是不完美的，因此可以被愚弄....。",
      "title": "是否有哲学家质疑过 \"cogito ergo sum\"？你真的能确定是你在思考吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "也許這有點牽強，我只是好奇是否有任何哲學思想\n是否有任何哲學思想來質疑笛卡爾的這一基本真理？\n\n另外，作爲他的假設，即你可能被欺騙的證據，笛卡爾用\n我們的感官是不完美的，因此可以被愚弄....。",
      "title": "是否有哲學家質疑過 \"cogito ergo sum\"？你真的能確定是你在思考嗎？"
    }
  ],
  "title": "Has any philosopher ever questioned ‘cogito ergo sum’ ? Can you really be sure that it is you that think?",
  "created_utc": 1623785027,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Maybe this is a bit far fetched, I was just curious if any philosophical ideas have ever been developed to question even this basic truth of Descartes?</p>\n\n<p>Also, as evidence for his hypothesis that you might be deceived, Descartes used the prof that our senses are imperfect and therefore can be fooled.  Say that I was medically able to establish that one sense can not be fooled - wouldn’t the global sceptic still win, because I could always say ‘It just LOOKS like this sense can not be cheated to you, because the great deceiver made it so’ ? So in essence, no matter what I was ever able to prove, I would never be able to refute the sceptic?</p>\n</div><!-- SC_ON -->",
  "score": 108,
  "permalink": "/r/askphilosophy/comments/o0cvm9/has_any_philosopher_ever_questioned_cogito_ergo/",
  "subreddit": "askphilosophy",
  "id": "o0cvm9",
  "is_self": true,
  "media": null,
  "is_video": false
}