{
  "author": "NoKey7846",
  "the_new_excerpt": "In feminist circles that I am in, it is regularly said that \"porn\" should not\nexist because it fetishizes, objectifies and sexualizes people and their\nrelationships. Porn glorifies sex, and treats people as nothing but\nobjects/degrades people to the status of mere objects for the…",
  "original_created_utc": 1620416840,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が所属するフェミニストの世界では、「ポルノ」は存在してはならないとよく言われます。\nなぜなら、それは人間とその関係をフェティッシュにし、対象化し、性的にするものだからです。\nということです。ポルノはセックスを美化し、人間をただの物として扱います。\n人をモノとしてしか扱わず、人を単なるモノの地位に貶める。",
      "title": "セクシュアル化、フェティシゼーション、オブジェクト化をいかに正当化するか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在我所在的女权主义圈子里，经常有人说，\"色情 \"不应该存在，因为它把人和他们的东西恋物化和性化。\n因为它把人和他们的关系恋物化、物化和性化。\n关系。色情片美化了性，把人当做无足轻重的物品/把人贬低为单纯的地位。\n物品/将人贬低到仅仅是物品的地位。",
      "title": "如何为性化、媚俗化和物化辩护？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在我所在的女權主義圈子裏，經常有人說，\"色情 \"不應該存在，因爲它把人和他們的東西戀物化和性化。\n因爲它把人和他們的關係戀物化、物化和性化。\n關係。色情片美化了性，把人當做無足輕重的物品/把人貶低爲單純的地位。\n物品/將人貶低到僅僅是物品的地位。",
      "title": "如何爲性化、媚俗化和物化辯護？"
    }
  ],
  "title": "How to justify sexualization, fetishization and objectification?",
  "created_utc": 1620472966,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In feminist circles that I am in, it is regularly said that &quot;porn&quot; should not exist because it fetishizes, objectifies and sexualizes people and their relationships. Porn glorifies sex, and treats people as nothing but objects/degrades people to the status of mere objects for the sexual gratification of consumers, which they say is &quot;immoral&quot;, &quot;wrong&quot;, and &quot;disgusting&quot;. Same for writing and drawing that include &quot;sex scenes&quot; in them, for which the claim is that because sex scenes in any art material fetishize, objectify and sexualize people, and their relationships, it should not be included in the art material. Especially when the art material is about imagining mere friends in sexual settings, the claim is that because there is nothing actually romantic/sexual between the &quot;just friends&quot;, it is &quot;immoral&quot; to imagine them as more than &quot;just friends&quot; as it would fetishize, sexualize and objectify their friendship.</p>\n\n<p>This article claims sexual desire itself is immoral because when we sexually desire someone, we treat them as mere object for our sexual gratification. We reduce them to their body, and body parts: <a href=\"https://qz.com/859933/philosophy-explains-why-sexual-desire-is-objectifying-and-hence-morally-wrong/\">https://qz.com/859933/philosophy-explains-why-sexual-desire-is-objectifying-and-hence-morally-wrong/</a></p>\n\n<blockquote>\n<p>Kant draws a distinction between mere use—the basis of objectification—and more-than-mere use. While we might employ people to do jobs, and accept payment for our work, we don’t treat the person on the other side of the transaction as a <em>mere</em> tool; we still recognize that person’s fundamental humanity.  </p>\n\n<p>Sex, though, is different. When I hire someone to sing, according to Kant, my desire is for his or her talent—for the voice-in-action. But when I sexually desire someone, I desire his or her body, not the person’s services or talents or intellectual capabilities, although any of these could enhance the desire. So, when we desire the person’s body, we often focus during sex on its individual parts: the buttocks, the penis, the clitoris, the thighs, the lips.  </p>\n\n<p>Sex doesn’t just make you objectify your partner. It also makes you objectify yourself. When I am in the grip of sexual desire, I also allow another person to reduce me to my body, to use me as a tool. Kant saw this process of self-objectification as an equally, if not more, serious moral problem than objectification directed outwards. I have duties to others to promote their happiness, but I also have a duty to morally perfect myself. Allowing myself to be objectified opposes this precept, according to Kant.   </p>\n\n<p>Is it possible to have sex without objectification? Of course. Prostitutes do it all the time. So do many long-term couples. They have sex with people whom they do not desire. And with no desire, there is no objectification. Not even love can fix it. When the desire is high, when the sexual act is in full swing, my beloved is a piece of flesh. </p>\n</blockquote>\n\n<p>But are there any arguments against such claims? And if there are any, what are they?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/askphilosophy/comments/n776ty/how_to_justify_sexualization_fetishization_and/",
  "subreddit": "askphilosophy",
  "id": "n776ty",
  "is_self": true,
  "media": null,
  "is_video": false
}