{
  "author": "roberthonker",
  "original_created_utc": 1629132648,
  "title": "Warning: Subreddits dedicated to a single coin are heavily censored echo chambers",
  "created_utc": 1629156637,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Recently I was permanently banned from <a href=\"/r/Bitcoin\">r/Bitcoin</a> for essentially no reason. A user wished to discuss blockchain technology, and all the other comments were saying how useless blockchain is and how Bitcoin is the only thing that matters.</p>\n\n<p>I left a comment and mentioned that this was not the right place for his discussion, and was banned for being a “shitcoin shill”</p>\n\n<p>This goes to show how ridiculously censored <a href=\"/r/Bitcoin\">r/Bitcoin</a> is. Take any information on subs dedicated to a particular coin with a grain of salt, because it is only telling one side of the story.</p>\n</div><!-- SC_ON -->",
  "score": 166,
  "permalink": "/r/CryptoCurrency/comments/p5k0kc/warning_subreddits_dedicated_to_a_single_coin_are/",
  "subreddit": "CryptoCurrency",
  "id": "p5k0kc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Recently I was permanently banned from r/Bitcoin [/r/Bitcoin] for essentially no\nreason. A user wished to discuss blockchain technology, and all the other\ncomments were saying how useless blockchain is and how Bitcoin is the only thing\nthat matters.\n\nI left a comment and mentioned that this was not…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、私は本質的に何の理由もなく、r/Bitcoin [/r/Bitcoin]から永久に追放されました。\n理由があります。あるユーザーがブロックチェーン技術について議論したいと言っていたのですが、他のコメントはすべて\n他のコメントは、ブロックチェーンがいかに役に立たないか、ビットコインが唯一の問題であると言っていました。\n重要であると言っていました。\n\n私はコメントを残し、これは違うと言及しました。",
      "title": "警告 一つのコインに特化したサブレディットは厳重に検閲されたエコーチェンバーである"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近，我被r/Bitcoin [/r/Bitcoin]永久禁言，基本上没有任何理由。\n原因。一个用户希望讨论区块链技术，而其他所有的\n所有其他评论都在说区块链是多么无用，比特币是唯一\n是唯一重要的东西。\n\n我留了一条评论，并提到这不是...",
      "title": "警告。专门讨论单一硬币的子目录是受到严格审查的回音室"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近，我被r/Bitcoin [/r/Bitcoin]永久禁言，基本上沒有任何理由。\n原因。一個用戶希望討論區塊鏈技術，而其他所有的\n所有其他評論都在說區塊鏈是多麼無用，比特幣是唯一\n是唯一重要的東西。\n\n我留了一條評論，並提到這不是...",
      "title": "警告。專門討論單一硬幣的子目錄是受到嚴格審查的迴音室"
    }
  ]
}