{
  "author": "giddyup281",
  "original_created_utc": 1641820364,
  "title": "I'm scared, and I'm tired of pretending I'm not",
  "created_utc": 1641829519,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I know, I know, this will be seen as FUD. But it&amp;#39;s not. I firmly believe we will get better in the mid to long term.&lt;/p&gt;\n\n&lt;p&gt;But this is just reminding me of 2018 too much. Day after day, week after week, my portfolio is losing a few %. With no end in sight. And the reasons are pulled out of thin air. September slump, November shenanigans, Christmas shopping, you name it. Now in 2022, I&amp;#39;m just waiting for the same ol&amp;#39; sayings from 2018. Chinese new year, wall street bonuses, January to end, March madness, and whatever idiotic saying there was to explain something that cannot be explained.&lt;/p&gt;\n\n&lt;p&gt;Now with the FED rates raised (and more rates raised foreseen), I just can&amp;#39;t help but feel... defeated.&lt;/p&gt;\n\n&lt;p&gt;I didn&amp;#39;t invest more than I&amp;#39;m willing to lose. I will not suffer financially if I lose EVERYTHING I have in crypto. That said, does anyone here LIKE losing any money?&lt;/p&gt;\n\n&lt;p&gt;I know it&amp;#39;s volatile. That&amp;#39;s why I love crypto. But this seems like it has no end in sight. And it just smells like 2018 all over again. And I just fall into this slump of how I felt back then. 10-20% dump daily. Going on for days and weeks. BTC was down 80% from ATH. All other alts over 90% (yes, even ETH). It&amp;#39;s terribly exhausting.&lt;/p&gt;\n\n&lt;p&gt;Maybe I&amp;#39;ll feel better smack down in the middle of bear run. That way I know there&amp;#39;s no other option but to buy/DCA and stake. But now... I&amp;#39;m scared.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;EDIT: Thank you for the awards (really not necessary), kind words, words of re-assurance, people calling me female genitalia and whoever said to &amp;quot;&lt;em&gt;be scared more quietly&lt;/em&gt;&amp;quot;. That one made my day. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 328,
  "permalink": "/r/CryptoCurrency/comments/s0jqoy/im_scared_and_im_tired_of_pretending_im_not/",
  "subreddit": "CryptoCurrency",
  "id": "s0jqoy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I know, I know, this will be seen as FUD. But it's not. I firmly believe we will\nget better in the mid to long term.\n\nBut this is just reminding me of 2018 too much. Day after day, week after week,\nmy portfolio is losing a few %. With no end in sight. And the reasons are pulled\nout of thin air.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これはFUDとみなされるのは分かっている。しかし、そうではありません。私は、私たちは必ずや\n中長期的に良くなっていく。\n\nただ、これでは2018年を思い出しすぎてしまいます。来る日も来る日も、毎週毎週。\n私のポートフォリオは数パーセントの損失です。終わりが見えないまま。そして、その理由は\nを薄っぺらくして...。",
      "title": "怖いんだ、怖くないふりをするのはもう嫌なんだ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道，我知道，这将被看作是FUD。但事实并非如此。我坚信，我们将\n在中长期内会变得更好。\n\n但这只是让我想起了2018年，太多。日复一日，周复一周。\n我的投资组合正在损失几个百分点。没有看到尽头。而原因是\n凭空捏造的....",
      "title": "我很害怕，我已经厌倦了假装我不害怕。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道，我知道，這將被看作是FUD。但事實並非如此。我堅信，我們將\n在中長期內會變得更好。\n\n但這只是讓我想起了2018年，太多。日復一日，周復一週。\n我的投資組合正在損失幾個百分點。沒有看到盡頭。而原因是\n憑空捏造的....",
      "title": "我很害怕，我已經厭倦了假裝我不害怕。"
    }
  ]
}