{
  "author": "Justin534",
  "original_created_utc": 1654245589,
  "title": "USDD and TRX has the exact same mint and burn mechanism that killed UST and Terra. Here's how to short.",
  "created_utc": 1654311148,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;&lt;em&gt;Important Edit:&lt;/em&gt;&lt;/strong&gt; &lt;em&gt;Someone just mentioned there seems to be no contract for minting TRX right now. I double checked the white paper and looks like the full mint and burn mechanism wont be implemented until November. Until USDD can be burned for newly minted TRX there is 0 chance of a failed mint and burn scenario similar to Terra / UST&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Just pulled up the white paper for USDD. Seems that the &amp;quot;stability&amp;quot; mechanism for USDD is the exact same as UST.&lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s the white paper so you can read for yourself &lt;a href=\"https://usdd.io/USDD-en.pdf\"&gt;https://usdd.io/USDD-en.pdf&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Page 3 and 4 show very plainly what the mint and burn mechanism is. You don&amp;#39;t have to know much about any of this to understand it. Simply 1 USDD can be burned for $1 equivalent of TRX minted. $1 worth of TRX can be burned for 1 USDD minted.&lt;/p&gt;\n\n&lt;p&gt;Looks like right now USDD borrow rates on &lt;a href=\"https://justlend.org\"&gt;justlend.org&lt;/a&gt; are 5%&lt;/p&gt;\n\n&lt;p&gt;So if you want to short USDD with leverage here&amp;#39;s how to do it.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Deposit collateral on &lt;a href=\"https://justlend.org\"&gt;justlend.org&lt;/a&gt; - Eth, BTC, USDC take your pick&lt;/li&gt;\n&lt;li&gt;Borrow USDD&lt;/li&gt;\n&lt;li&gt;Immediately sell USDD for more collateral&lt;/li&gt;\n&lt;li&gt;Deposit collateral&lt;/li&gt;\n&lt;li&gt;Repeat steps 2 and 3 depending on how much leverage you want exposure too&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;The loan to value ratio on justlend will determine how many times you can repeat this process. Each time you repeat steps 2 and 3 you increase your leverage. So at 10x leverage every 1% move in either direction is a 10% gain or loss. You&amp;#39;ll want to figure out what the liquidation threshold is so you don&amp;#39;t lose your collateral.&lt;/p&gt;\n\n&lt;p&gt;Some of the more obvious risks in this trade are the APY you pay on borrowed USDD, not managing your collateral and getting liquidated, and also maybe a not so obvious one is since justlend runs on tron, its worthwihile to think about if USDD and TRX fail will Tron shutdown? In the event of a network shutdown you wont be able to repay your USDD and release your collateral.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s also a much easier way to short Tron and USDD in the event of a failure of the mint and burn mechanism. Just set an alert (or program a script if your savvy enough) and short TRX on a centralized exchange like Kucoin if USDD depegs to $0.97 then short TRX with leverage in your margin account. I&amp;#39;m sure you can find TRX perpetuals on other exchanges too if you want to increase your leverage. Then if USDD repegs you close the trade. Rinse and repeat every time USDD depegs.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 305,
  "permalink": "/r/CryptoCurrency/comments/v3uxj0/usdd_and_trx_has_the_exact_same_mint_and_burn/",
  "subreddit": "CryptoCurrency",
  "id": "v3uxj0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Important Edit: Someone just mentioned there seems to be no contract for minting\nTRX right now. I double checked the white paper and looks like the full mint and\nburn mechanism wont be implemented until November. Until USDD can be burned for\nnewly minted TRX there is 0 chance of a failed mint and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "重要編集：今、ある人が、TRXを鋳造するための契約がないようだと言っていました。\nTRXを鋳造する契約はないようです。ホワイトペーパーを再確認したところ、完全なmint and burnの仕組みは11月まで実装されないようです。\n焼く仕組みは11月まで実装されないようです。USDDを燃やすことができるようになるまで\n新しく鋳造されたTRXのためにUSDDを燃やすことができるようになるまで、失敗した鋳造と...の可能性はゼロではありません。",
      "title": "USDDとTRXは、USTとTerraを殺したのと全く同じミント＆バーン・メカニズムを持っている。ショートする方法はこうだ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "重要编辑：刚才有人提到似乎没有铸币的合同\nTRX。我仔细检查了白皮书，看起来完整的铸币和烧毁机制不会出现。\n燃烧机制要到11月才会实施。在USDT可以被烧毁以换取\n新铸造的TRX之前，失败的铸币和烧毁的可能性为零。",
      "title": "USDD和TRX拥有与杀死UST和Terra完全相同的铸币和燃烧机制。下面是做空的方法。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "重要編輯：剛纔有人提到似乎沒有鑄幣的合同\nTRX。我仔細檢查了白皮書，看起來完整的鑄幣和燒燬機制不會出現。\n燃燒機制要到11月纔會實施。在USDT可以被燒燬以換取\n新鑄造的TRX之前，失敗的鑄幣和燒燬的可能性爲零。",
      "title": "USDD和TRX擁有與殺死UST和Terra完全相同的鑄幣和燃燒機制。下面是做空的方法。"
    }
  ]
}