{
  "author": "Paulie_Gatto",
  "the_new_excerpt": "From the Commission report: \"The most common charge levelled against the\nfounders, and hence against our country itself, is that they were hypocrites who\ndidn’t believe in their stated principles, and therefore the country they built\nrests on a lie. This charge is untrue, and has done enormous…",
  "original_created_utc": 1611014713,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "委员会报告中说： \"最常见的指控是，对《公约》的指控。\n他们是伪君子，他们是伪君子，他们是伪君子。\n他们不相信他们所宣称的原则，因此他们所建立的国度\n建立在一个谎言之上。这个指控是不真实的，并且已经做了巨大的... ...",
      "title": "1776年委员会说，在奴隶制问题和他们对原则性权利的信仰上，称开国元勋为伪君子或骗子是错误的。这种明显的虚伪行为在《宣言》和《宪法》出台时，当代人的反应是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "委員會報告中說： \"最常見的指控是，對《公約》的指控。\n他們是僞君子，他們是僞君子，他們是僞君子。\n他們不相信他們所宣稱的原則，因此他們所建立的國度\n建立在一個謊言之上。這個指控是不真實的，並且已經做了巨大的... ...",
      "title": "1776年委員會說，在奴隸制問題和他們對原則性權利的信仰上，稱開國元勳爲僞君子或騙子是錯誤的。這種明顯的虛僞行爲在《宣言》和《憲法》出臺時，當代人的反應是什麼？"
    }
  ],
  "title": "The 1776 Commission says that it's wrong to call the Founding Fathers hypocrites or liars over the issue of slavery and their belief in principled rights. What was the contemporary response of this apparent hypocrisy at the time of the Declaration and the Constitution?",
  "created_utc": 1611032626,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>From the Commission report: &quot;The most common charge levelled against the founders, and hence against our country itself, is that they were hypocrites who didn’t believe in their stated principles, and therefore the country they built rests on a lie. This charge is untrue, and has done enormous damage, especially in recent years, with a devastating effect on our civic unity and social fabric.&quot;</p>\n\n<p>However, I did find the Marquis de Lafayette reportedly telling someone he wouldn&#39;t have fought for America&#39;s independence if he had known it would become a nation of slavery, though I don&#39;t know when he said that.</p>\n</div><!-- SC_ON -->",
  "score": 209,
  "permalink": "/r/AskHistorians/comments/l07e14/the_1776_commission_says_that_its_wrong_to_call/",
  "subreddit": "AskHistorians",
  "id": "l07e14",
  "is_self": true,
  "media": null,
  "is_video": false
}