{
  "author": "erikfletch",
  "the_new_excerpt": "I've been a believer in and a holder of bitcoin for a few years now. I enjoyed\ntaking the time to read and learn about the technology behind it. Setting up\nwallets and discovering new ways to use it. I invested some money in it and\nwatched with glee as the price went up and up and up. However, this…",
  "original_created_utc": 1623027241,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は数年前から、ビットコインの信者であり、保有者でもあります。楽しんでいます。\nその背景にある技術について、時間をかけて読み、学ぶことができました。ウォレットを設定したり\nウォレットを設定したり、新しい使い方を発見したりしました。私はビットコインにお金を投資して\n価格がどんどん上がっていくのを嬉しそうに見ていました。ところが、これが...。",
      "title": "ビットコインの最大の脅威は「文化」である"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我相信并持有比特币已经有好几年了。我很喜欢\n花时间去阅读和了解它背后的技术。建立\n钱包和发现使用它的新方法。我在里面投资了一些钱，并且\n我高兴地看着它的价格不断上涨，不断上涨。然而，这...",
      "title": "比特币的最大威胁是它的文化"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我相信並持有比特幣已經有好幾年了。我很喜歡\n花時間去閱讀和了解它背後的技術。建立\n錢包和發現使用它的新方法。我在裏面投資了一些錢，並且\n我高興地看着它的價格不斷上漲，不斷上漲。然而，這...",
      "title": "比特幣的最大威脅是它的文化"
    }
  ],
  "title": "Bitcoin's biggest threat is it's culture",
  "created_utc": 1623059159,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been a believer in and a holder of bitcoin for a few years now. I enjoyed taking the time to read and learn about the technology behind it. Setting up wallets and discovering new ways to use it. I invested some money in it and watched with glee as the price went up and up and up. However,  this weekend&#39;s event in Miami has revealed a major flaw that has snapped me back to my senses. The culture.</p>\n\n<p>Previously, when I would read people criticizing bitcoin outside of crypto subs, I would usually think to myself, &quot;This idiot just doesn&#39;t get it yet. They haven&#39;t taken the time to learn and they will regret it later. Have fun staying poor&quot; etc. Now I&#39;m starting to realize, I&#39;m the one who didn&#39;t get it.</p>\n\n<p><a href=\"https://www.youtube.com/watch?v=w3Ax3wS1opU\">FOMO</a></p>\n\n<p>Among the many brilliant minds speaking at the bitcoin conference, we have Dan Held, Director of Growth Marketing at Kraken.</p>\n\n<blockquote>\n<p>Bitcoin has something called &quot;Number go up<sup>tm</sup> technology&quot;  </p>\n\n<p>People will buy in anticipation of the price continuing to climb. This is called FOMO.</p>\n</blockquote>\n\n<p>FOMO is an emotion that&#39;s frequently mentioned on this sub and those that have been around for a while often try to coach newbies on how to avoid falling victim to it. And here we have someone responsible for leading crypto marketing strategies, explaining how this fear of missing out is THE path to mass adoption. This is the public strategy and this is the lens that the mainstream world sees bitcoin through. Here is a guy who bought in for 10 dollars, and is openly admitting he will exploit my emotions to get me to pay $35,000 (and much, much more) for it. And why should I buy it? Because price goes up forever.</p>\n\n<p>That&#39;s it. That&#39;s the utility being sold. But who benefits the most from this number go up<sup>tm</sup> technology? The new guy who bought .5 BTC at $35k or the guy who bought thousands at $10? Even if new adopters end up loosing most of their money, those that got in years ago still won big. The more they can stoke this fear, the bigger they win.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://twitter.com/coffeencrypt0/status/1401278099522822146\">Toxic Maximalism</a></p>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>If you’re against Bitcoin toxicity, you’re against Bitcoin. And if you’re against Bitcoin, you’re against freedom.</p>\n</blockquote>\n\n<p>What a complete load of nonsense.  I was already well aware of Bitcoin&#39;s toxic culture, but I always assumed this would fade away out of necessity of the bigger goal of mass adoption. Instead I see it&#39;s being embraced and encouraged. A toxic culture is completely antithetical to freedom. Any discussions of other cryptocurrencies in a positive way is not a topic allowed for discussion on their sub or at this weekend&#39;s event. I would argue that this toxicity leads to a very centralized point of view that is controlled by those with the most influence in the culture. I thought that a culture that constantly espouses decentralization would encourage the free expression of ideas. I was wrong. Even Erik Voorhees was booed for calling this out as <a href=\"https://twitter.com/finematics/status/1401498099441405953?s=20\">bullshit</a>.</p>\n\n<p>&#x200B;</p>\n\n<p>Add to this the many other widely circulated clips that make me <a href=\"https://twitter.com/alifarhat79/status/1401536053731860482?s=20\">cringe</a> with embarrassment, and I now understand why those that don&#39;t get sucked in by the technology or by FOMO just see bitcoin as a bunch of charlatans peddling snake oil. This felt more like watching a tent revival than a celebration of a new technology that could revolutionize our financial system.</p>\n\n<p>This isn&#39;t just the opinions of a handful of zealots who are not representative of the culture. These are influential voices that were given a spotlight and widely applauded. These ideas are widely shared and have found strong consensus on social media.</p>\n\n<p>&#x200B;</p>\n\n<p>I know, I know. Bitcoin doesn&#39;t care what I think. Bitcoin has El Salvador now and the number goes up technology works just fine without me. But if Bitcoin or any other cryptocurrency is going to truly succeed, it&#39;s not just the technology that needs to be able to scale. The culture has to be able to scale as well.</p>\n</div><!-- SC_ON -->",
  "score": 320,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/btomtQ71aXVll71YYYC3qelzacJfwz_-zyrTN3i3jRk.jpg?auto=webp&s=9e694cbba29a74442deea24794b515cb8b1e4013",
          "width": 480,
          "height": 360
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/btomtQ71aXVll71YYYC3qelzacJfwz_-zyrTN3i3jRk.jpg?width=108&crop=smart&auto=webp&s=fa2cda961057357c1bbcec2ae26771a6f8e6da26",
            "width": 108,
            "height": 81
          },
          {
            "url": "https://external-preview.redd.it/btomtQ71aXVll71YYYC3qelzacJfwz_-zyrTN3i3jRk.jpg?width=216&crop=smart&auto=webp&s=f4d8c44f90f9d22afae132a19838c922141bd450",
            "width": 216,
            "height": 162
          },
          {
            "url": "https://external-preview.redd.it/btomtQ71aXVll71YYYC3qelzacJfwz_-zyrTN3i3jRk.jpg?width=320&crop=smart&auto=webp&s=980c90a23f11f870f7a825243abd47eff2572ca0",
            "width": 320,
            "height": 240
          }
        ],
        "variants": {},
        "id": "t2vmH76-s1gs8OEQTVBoq973IP5cf_7QqsgBLvPt2hM"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/nu0506/bitcoins_biggest_threat_is_its_culture/",
  "subreddit": "CryptoCurrency",
  "id": "nu0506",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404882867
}