{
  "author": "imkinda_adog",
  "original_created_utc": 1642985176,
  "title": "If we want crypto adopted to real world, it needs to be easier. Much easier.",
  "created_utc": 1643050111,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’ve been investing in crypto for nearly a year now, so I’m in every way still a beginner. \nI decided to try purchase my first NFT yesterday, and holy hell was that confusing. Still is. I used my MetaMask account had $200 worth of ETH on there, tried to bid on something worth .007 eth but noticed I had to change it? Okay did the steps ended up back with Poly??? Or some sort of “wrapped ETH”And now down to $70 due to gas fees.. worse yet I don’t even have the NFT. \nJust imagine going out to buy a $7 dollar beer only to be charged $130 then only to have the bar tender give it someone else. &lt;/p&gt;\n\n&lt;p&gt;I know there must have been steps I did not understand and may have screwed things up a little. But holy hell if we want this to be a thing of everyday use, this shit can’t be happening.&lt;/p&gt;\n\n&lt;p&gt;EDIT- thank you everyone explaining things to me. Im not trying to shit on anything and I still have full belief in where we are heading. \nI understand now that we are still very early stages and I guess I’m just used to being late to parties. \nThat and ETH is kind of a mess and there’s more than just OpenSea to purchase NFTs. Genuinely was unaware cardano has their own system for it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 305,
  "permalink": "/r/CryptoCurrency/comments/sb8tty/if_we_want_crypto_adopted_to_real_world_it_needs/",
  "subreddit": "CryptoCurrency",
  "id": "sb8tty",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’ve been investing in crypto for nearly a year now, so I’m in every way still a\nbeginner. I decided to try purchase my first NFT yesterday, and holy hell was\nthat confusing. Still is. I used my MetaMask account had $200 worth of ETH on\nthere, tried to bid on something worth .007 eth but noticed I…"
}