{
  "author": "theepicone111",
  "the_new_excerpt": "I don’t see this talked much about. If an international investor is buying US\nequities in dollars, they are paying in their own currency which is converted to\ndollars. Since the US dollar is the global reserve currency, we obviously had a\nlot of printing in 2020. 25% of all US dollar in existence…",
  "original_created_utc": 1624217777,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "あまり話題になったことはありませんね。海外の投資家がドル建てで米国株を購入する場合\n海外の投資家がドル建てで米国株を購入する場合、彼らは自国の通貨で支払い、それをドルに換算しています。\nドルに変換されます。米ドルは世界の基軸通貨ですから、2020年には明らかに大量の印刷が行われました。\n2020年には大量の印刷が行われました。現存する米ドルの25％が...",
      "title": "米国外の投資家は、ドル安を懸念すべきでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我没有看到这个问题被谈论得太多。如果国际投资者购买美国的\n的股票，他们是用自己的货币支付的，而这些货币会被兑换成美元。\n美元。由于美元是全球储备货币，我们显然在2020年有大量的印刷。\n在2020年有大量的印刷。现存的所有美元中的25%...",
      "title": "美国以外的投资者是否应该关注美元的贬值？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我沒有看到這個問題被談論得太多。如果國際投資者購買美國的\n的股票，他們是用自己的貨幣支付的，而這些貨幣會被兌換成美元。\n美元。由於美元是全球儲備貨幣，我們顯然在2020年有大量的印刷。\n在2020年有大量的印刷。現存的所有美元中的25%...",
      "title": "美國以外的投資者是否應該關注美元的貶值？"
    }
  ],
  "title": "Should investors outside the US be concerned about the depreciation of the dollar?",
  "created_utc": 1624227727,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I don’t see this talked much about. If an international investor is buying US equities in dollars, they are paying in their own currency which is converted to dollars. \nSince the US dollar is the global reserve currency, we obviously had a lot of printing in 2020. 25% of all US dollar in existence was printed last year. Expectedly, this leads to inflation. Whether is temporary or not remains to be seen but it would not be surprising to see a less valuable dollar. </p>\n\n<p>Wouldn’t this also mean a smaller ROI for US stocks? For example, you may make a 10% gain on Apple and gain $13 per share. However, if the pound (£) is now 10% stronger against USD, when your USD is converted back to £, you may not even end up making a profit. \nIt seems this is likely to happen with the inflation numbers coming out. E.g UK YoY inflation was 2.1%, US was 5%.</p>\n\n<p>How do you account for this, if at all, when investing for the long term? I guess you could stick to investing in companies in your own country but the growth is likely not there compared to the US. It becomes a game of balancing the numbers in to see if you end up losing money in a bullish market.</p>\n</div><!-- SC_ON -->",
  "score": 68,
  "permalink": "/r/investing/comments/o4d7xh/should_investors_outside_the_us_be_concerned/",
  "subreddit": "investing",
  "id": "o4d7xh",
  "is_self": true,
  "media": null,
  "is_video": false
}