{
  "author": "NotAMazda",
  "original_created_utc": 1651184986,
  "title": "Do doctors just not take womens reproductive health seriously?",
  "created_utc": 1651200682,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Two people in my life now have had severe issues with endometriosis and it took them ages to diagnose/cure.&lt;/p&gt;\n\n&lt;p&gt;A friend of mine, 26, had to insist the doctors remove a fibroid in her uterus. If she hadn’t pushed, it would have been way worse. It took her two years to get surgery and the fibroid was the size of a basketball. While they were doing her surgery, they discovered she had stage 4 endometriosis.&lt;/p&gt;\n\n&lt;p&gt;From what I understand this is a fairly common thing - it taking years to discover endo and it being not recognized or taken seriously.&lt;/p&gt;\n\n&lt;p&gt;Soooo… can anyone explain why to me?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 273,
  "permalink": "/r/TooAfraidToAsk/comments/ue72m4/do_doctors_just_not_take_womens_reproductive/",
  "subreddit": "TooAfraidToAsk",
  "id": "ue72m4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Two people in my life now have had severe issues with endometriosis and it took\nthem ages to diagnose/cure.\n\nA friend of mine, 26, had to insist the doctors remove a fibroid in her uterus.\nIf she hadn’t pushed, it would have been way worse. It took her two years to get\nsurgery and the fibroid was…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今、私の人生の中で2人が子宮内膜症の深刻な問題を抱え、それに対処するため\n診断・治療に何年もかかりました。\n\n私の友人（26歳）は、子宮の筋腫を取り除くよう医師に強く言わなければなりませんでした。\nもし、彼女が無理をしなければ、もっとひどいことになっていたでしょう。手術を受けるまでに2年かかりました。\n手術に2年かかり、子宮筋腫は...",
      "title": "医師は女性の生殖医療に真剣に取り組んでいないだけなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在我的生活中，有两个人有严重的子宫内膜异位症问题，他们花了很长时间才诊断/治疗。\n他们花了很长时间来诊断/治疗。\n\n我的一个朋友，26岁，不得不坚持让医生切除她子宫里的一个肌瘤。\n如果她不这样做，情况会更糟糕。她花了两年时间才得到\n她花了两年时间才做了手术，而这个肌瘤是...",
      "title": "医生是否不重视妇女的生殖健康？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在我的生活中，有兩個人有嚴重的子宮內膜異位症問題，他們花了很長時間才診斷/治療。\n他們花了很長時間來診斷/治療。\n\n我的一個朋友，26歲，不得不堅持讓醫生切除她子宮裏的一個肌瘤。\n如果她不這樣做，情況會更糟糕。她花了兩年時間纔得到\n她花了兩年時間才做了手術，而這個肌瘤是...",
      "title": "醫生是否不重視婦女的生殖健康？"
    }
  ]
}