{
  "author": "idekwhatidk",
  "the_new_excerpt": "It's used casually throughout much of the English speaking world. In Scotland,\n\"cunt\" just means \"person in that general direction\". I exclaim \"cunt\" whenever\nI hurt myself. Sometimes it's a term of endearment. Calling somebody a beautiful\ncunt when they bring you something from their trip to the…",
  "original_created_utc": 1620746040,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "英語圏の多くの地域で気軽に使われています。スコットランドでは\n\"cunt \"は単に「その方向にいる人」という意味です。私は自分が傷つくたびに「cunt」と叫びます。\n私は自分が傷つくたびに「cunt」と叫びます。時には、愛称としても使われます。誰かがおいしいものを持ってきてくれたときに「beautiful cunt」と\n誰かが旅行先から何かを持ってきたときに「美しいマンコ」と言うのは...",
      "title": "なぜアメリカではcuntがそんなに攻撃的なのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "它在英语世界的大部分地区被随意使用。在苏格兰。\n\"cunt \"只是指 \"那个大方向上的人\"。每当我受伤时，我都会喊 \"屄\"。\n我就喊 \"屄\"。有时它也是一种爱称。称某人为美丽的\n当他们从他们的旅行中给你带来一些东西的时候，叫他们 \"阴户\"...",
      "title": "为什么阴户在美国如此具有攻击性？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "它在英語世界的大部分地區被隨意使用。在蘇格蘭。\n\"cunt \"只是指 \"那個大方向上的人\"。每當我受傷時，我都會喊 \"屄\"。\n我就喊 \"屄\"。有時它也是一種愛稱。稱某人爲美麗的\n當他們從他們的旅行中給你帶來一些東西的時候，叫他們 \"陰戶\"...",
      "title": "爲什麼陰戶在美國如此具有攻擊性？"
    }
  ],
  "title": "Why is cunt so offensive in the US?",
  "created_utc": 1620771997,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It&#39;s used casually throughout much of the English speaking world. In Scotland, &quot;cunt&quot; just means &quot;person in that general direction&quot;. I exclaim &quot;cunt&quot; whenever I hurt myself. Sometimes it&#39;s a term of endearment. Calling somebody a beautiful cunt when they bring you something from their trip to the store. It can also be the equivalent of calling somebody a dick/prick. Very versatile word. I understand that it&#39;s offensive, but why is it so offensive in the US?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/n9zb7c/why_is_cunt_so_offensive_in_the_us/",
  "subreddit": "NoStupidQuestions",
  "id": "n9zb7c",
  "is_self": true,
  "media": null,
  "is_video": false
}