{
  "author": "SuchTown32",
  "original_created_utc": 1636160166,
  "title": "I made a website that can find sports arbitrages",
  "created_utc": 1636165076,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A sports arbitrage is where you bet on every outcome of a sporting event, e.g. win, draw, loss and be guaranteed to make profit</p>\n\n<p>I’m a CS grad and web developer by day, but been itching to build something. I personally don’t gamble, but wanted something where I could integrate a front end, backend and database and figured out how to get a whole bunch of sports odds data.</p>\n\n<p>Its been live for one month and I’ve already had 20k page views and 3k new users.</p>\n\n<p>If you’d like to check it out go to <a href=\"https://sportsarbitragefinder.com\">www.sportsarbitragefinder.com</a></p>\n\n<p>Still trying to figure out the best way to monetise it, any ideas??</p>\n</div><!-- SC_ON -->",
  "score": 5,
  "permalink": "/r/SideProject/comments/qnp4l6/i_made_a_website_that_can_find_sports_arbitrages/",
  "subreddit": "SideProject",
  "id": "qnp4l6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "A sports arbitrage is where you bet on every outcome of a sporting event, e.g.\nwin, draw, loss and be guaranteed to make profit\n\nI’m a CS grad and web developer by day, but been itching to build something. I\npersonally don’t gamble, but wanted something where I could integrate a front\nend, backend…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "スポーツアービトラージとは、スポーツイベントのすべての結果に賭けることです。\n勝ち、引き分け、負けなど、スポーツイベントのすべての結果に賭けて、利益を得ることを保証するものです。\n\n私はCSの卒業生で、普段はウェブ開発者ですが、何かを作りたくてうずうずしています。I\n個人的にはギャンブルはしませんが、フロントエンドとバックエンドを\nエンド、バックエンドを統合できるようなものが欲しかったのです...",
      "title": "スポーツアービトラージを検索できるサイトを作ってみた"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "体育套利是指你在体育赛事的每一个结果上都下注，例如。\n赢、平、输，并保证获利。\n\n我是一个CS毕业生，白天是网络开发人员，但一直渴望建立一些东西。I\n我个人不赌博，但我想做一个可以整合前端、后端\n终端、后端...",
      "title": "我做了一个网站，可以找到体育套利。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "體育套利是指你在體育賽事的每一個結果上都下注，例如。\n贏、平、輸，並保證獲利。\n\n我是一個CS畢業生，白天是網絡開發人員，但一直渴望建立一些東西。I\n我個人不賭博，但我想做一個可以整合前端、後端\n終端、後端...",
      "title": "我做了一個網站，可以找到體育套利。"
    }
  ]
}