{
  "author": "Velteau",
  "original_created_utc": 1648052013,
  "title": "The song 'Come Out Ye Black and Tans' has a verse that goes \"come tell us how you slew them old Arabs two by two, like the Zulus they had spears and bow and arrows.\" Were there really Arabs still using pre-gunpowder weaponry by the late 19th to early 20th centuries?",
  "created_utc": 1648063747,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I reckon the song could also be referring to non-Arab peoples like the Tuaregs which to Westerners would seem more or less the same, but were there proper Arabs still living in near-Mediaeval conditions so recently?&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://en.wikipedia.org/wiki/Come_Out,_Ye_Black_and_Tans\"&gt;Here&amp;#39;s&lt;/a&gt; the context for the song itself.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/tkyhuw/the_song_come_out_ye_black_and_tans_has_a_verse/",
  "subreddit": "AskHistorians",
  "id": "tkyhuw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I reckon the song could also be referring to non-Arab peoples like the Tuaregs\nwhich to Westerners would seem more or less the same, but were there proper\nArabs still living in near-Mediaeval conditions so recently?\n\nHere's [https://en.wikipedia.org/wiki/Come_Out,_Ye_Black_and_Tans] the context\nfor…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この歌は、トゥアレグのような非アラブ系民族のことを指しているのかもしれない。\n欧米人から見れば、ほぼ同じに見えるのでしょうが、きちんとした\nアラブ人が中世に近い環境で生活していたのは、つい最近のことなのだろうか。\n\n以下は[https://en.wikipedia.org/wiki/Come_Out,_Ye_Black_and_Tans]の文脈である。\nのために...",
      "title": "Come Out Ye Black and Tans」という曲には、\"come tell us how you slew them old Arabs two by two, like the Zulus they had spears and bow and arrows.\" という一節があります。19世紀末から20世紀初頭にかけて、アラブ人はまだ火薬以前の武器を使っていたのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我认为这首歌也可能是指像图阿雷格这样的非阿拉伯民族。\n对西方人来说，这似乎是差不多的，但是否有适当的\n阿拉伯人最近还生活在接近中世纪的条件下吗？\n\n这里是[https://en.wikipedia.org/wiki/Come_Out,_Ye_Black_and_Tans]的背景\n为...",
      "title": "歌曲《出来吧，黑与白》中有一节是这样说的：\"来告诉我们你是如何把那些老阿拉伯人两个两个地杀死的，像祖鲁人一样，他们有长矛和弓箭。\" 到19世纪末至20世纪初，真的有阿拉伯人还在使用火药前的武器吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我認爲這首歌也可能是指像圖阿雷格這樣的非阿拉伯民族。\n對西方人來說，這似乎是差不多的，但是否有適當的\n阿拉伯人最近還生活在接近中世紀的條件下嗎？\n\n這裏是[https://en.wikipedia.org/wiki/Come_Out,_Ye_Black_and_Tans]的背景\n爲...",
      "title": "歌曲《出來吧，黑與白》中有一節是這樣說的：\"來告訴我們你是如何把那些老阿拉伯人兩個兩個地殺死的，像祖魯人一樣，他們有長矛和弓箭。\" 到19世紀末至20世紀初，真的有阿拉伯人還在使用火藥前的武器嗎？"
    }
  ]
}