{
  "author": "nobjos",
  "the_new_excerpt": "Preamble: One of the main questions that I had and I see recurring on this sub\nis how to identify and invest in emerging stocks before it becomes mainstream\nnews. I did not have the time to actively track social media and decided to\nbuild a program that does it for me.\n\nHow it works: The program is…",
  "original_created_utc": 1617370884,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "序言。我有一个主要问题，而且我看到在这个分论坛上反复出现。\n是如何在新兴股票成为主流之前，识别和投资新兴股票。\n新闻。我没有时间去主动跟踪社交媒体，于是决定\n建立一个程序，为我做。\n\n它是如何工作的。这个程序是...",
      "title": "我建立了一个程序，跟踪Reddit和Twitter上的股票提及率和情绪，以寻找上涨的股票! 本周的热门股及其DD：台湾半导体($TSM)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "序言。我有一個主要問題，而且我看到在這個分論壇上反覆出現。\n是如何在新興股票成爲主流之前，識別和投資新興股票。\n新聞。我沒有時間去主動跟蹤社交媒體，於是決定\n建立一個程序，爲我做。\n\n它是如何工作的。這個程序是...",
      "title": "我建立了一個程序，跟蹤Reddit和Twitter上的股票提及率和情緒，以尋找上漲的股票! 本週的熱門股及其DD：臺灣半導體($TSM)"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "前置きが長くなりました。私が抱いていた主な質問の一つで、このサブページでも繰り返し出てくるものです。\n新興国の株式をどのように見極め、投資するかということです。\nのニュースです。私にはソーシャルメディアを積極的に追跡する時間がなかったので、それを代行するプログラムを作ることにしました。\nしてくれるプログラムを作ることにしました。\n\nどのような仕組みなのか。このプログラムは...",
      "title": "RedditやTwitterでの銘柄の言及やセンチメントを追跡して、上昇銘柄を見つけるプログラムを作りました 今週の上位銘柄とそのDD：台湾セミコンダクター（$TSM)"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "前置きが長くなりました。私が抱いていた主な質問の一つで、このサブページでも繰り返し出てくるものです。\n新興国の株式をどのように見極め、投資するかということです。\nのニュースです。私にはソーシャルメディアを積極的に追跡する時間がなかったので、それを代行するプログラムを作ることにしました。\nしてくれるプログラムを作ることにしました。\n\nどのような仕組みなのか。このプログラムは...",
      "title": "RedditやTwitterでの銘柄の言及やセンチメントを追跡して、上昇銘柄を見つけるプログラムを作りました 今週の上位銘柄とそのDD：台湾セミコンダクター（$TSM)"
    }
  ],
  "title": "I built a program that tracks mentions and sentiment of stocks across Reddit and Twitter to find rising stocks! This week's top stock and its DD: Taiwan Semiconductor ($TSM)",
  "created_utc": 1617401331,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Preamble:</strong> One of the main questions that I had and I see recurring on this sub is how to identify and invest in emerging stocks before it becomes mainstream news. I did not have the time to actively track social media and decided to build a program that does it for me.</p>\n\n<p><strong>How it works:</strong> The program is built using Python and uses both Twitter and Reddit API to stream comments and tweets and spot tickers that are exhibiting accelerated growth. I added sentiment analysis to the findings so as to check the general sentiment (whether what is being talked about the stock is positive or negative).</p>\n\n<p>Here is the stock picked by the program and my DD</p>\n\n<p><strong>Stock:</strong>   <strong>Taiwan Semiconductor Manufacturing Company ($TSM)</strong></p>\n\n<p>Week on Week increase in mentions: <strong>130%</strong></p>\n\n<p>Month on Month increase in mentions: <strong>324%</strong></p>\n\n<p>Average sentiment across mentions: <strong>+29.5%</strong></p>\n\n<p><strong>DD</strong></p>\n\n<p><strong>Core Product</strong></p>\n\n<p>TSMC was founded in 1987 by Morris Chang, who previously had worked in Texas Instruments. TSMC can be considered as possibly the most important company in the world that few people have heard of. This is because it is practically a chokepoint of the $470 Billion semiconductor industry and is instrumental in supplying chips to almost all the major players. Currently, the company supplies to Apple for their A14 chips and ARM-based chips for their Mac products, Qualcomm, MediaTek, AMD, Intel, and Nvidia.</p>\n\n<p>The company is the world’s largest semiconductor foundry. They are in the pure-play foundry business. This means that they do not produce any processors for their own products but they manufacture and sell chips to companies such as AMD, Intel, and Apple. The main reason for which companies such as Apple and AMD source chips from TSMC is that they do not have to build their own expensive silicon fabrication plants (the CapEx of the plans run into 10s of billions of dollars and it takes an extremely long time to set up) to manufacture their chips. TSMC is currently the world’s 11th largest company by market capitalization ($554 B).</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/qx1btw29krq61.png?width=624&amp;format=png&amp;auto=webp&amp;s=61ce94bf883480c99f5e74a43bdea79bbf9d4d9f\">TSMC absolutely dominates the advanced chip market </a></p>\n\n<p>As you can see from the above chart, TSMC absolutely dominates the advanced chip market (&lt;10nm, think phone processors) which also has the highest margins. The company effectively controls more than half (54% to be exact) of the world’s made-to-order chip market.</p>\n\n<p><strong>Financials</strong></p>\n\n<p>TSMC posted its best-ever quarter in Q4’20 with revenues jumping 22% to a record $12.68 Billion and profits increasing 23% to $5.1 Billion. They are also expected to invest heavily this year with capital expenditure for production and development of advanced chips to be between $25-$28 Billion. (60% higher than the amount TSMC spend in 2020)</p>\n\n<p>They also have a very strong financial position with $23 Billion in cash vs a long-term liability of only $10 billion (YE 2020). The company has also predicted a record first-quarter revenue between $12.7 Billion and $13 Billion, which is almost a 30% growth from the same period last year. We do have to note that their share price has jumped more than 140% over the past 12 months giving it the current valuation of $554 Billion.</p>\n\n<p><strong>Potential and Hype Factors</strong></p>\n\n<p><strong>Technology moat:</strong> Compared to peers, TSMC is easily the leader in chip production technology. The company has delivered over 1 Billion 7nm chips by 2020 whereas Intel is still trying to master its 7nm development process. For those who are unaware of chip manufacturing, in general, the smaller the node size (measured in nanometer (nm)), the better the performance and power management. This is why the companies making the top-end chips want the smallest node size available.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/w6mw9ehakrq61.png?width=624&amp;format=png&amp;auto=webp&amp;s=a70944796b31b7b971e743f497854c29d9b797d1\">https://preview.redd.it/w6mw9ehakrq61.png?width=624&amp;format=png&amp;auto=webp&amp;s=a70944796b31b7b971e743f497854c29d9b797d1</a></p>\n\n<p>TSMC is currently in the process of producing 5nm chips (20% of their total wafer revenue) and is already ramping up for 3nm production by the end of 2022. It takes a long time to spin up a new silicon fabrication factory (3-4 years is the average time it takes for a factory to go from planning to production).</p>\n\n<p>This leadership in technology would be one of the key drivers for growth in the coming years. The $28 Billion Capex spending also reflects on the management’s confidence about the long-term demand for the advanced chips.</p>\n\n<p><strong>Strong long-term demand:</strong> Even though the current shortage faced by automakers is mainly due to a supply chain issue, cars, in general, are getting more and more complicated and EV’s tend to need better hardware and chips. This will force the automakers to rush to lock in future supply. Even though the margins produced from the auto-chips are not as high as the phones/laptops, the producers of the chips are definitely going to benefit in the long run.</p>\n\n<p><strong>Risk and Competition</strong></p>\n\n<p>There are multiple risks associated with TSMC. First and foremost, at the current valuation, the stock is definitely not cheap. The current PE ratio is 33 which puts them in the same bucket as Apple and AMD. While this might be representative of their future growth potential, it is on the higher side for a manufacturing company.</p>\n\n<p>The company might face a short-term crisis in production as Taiwan is currently facing its most severe water shortage in 56 years. Taiwan’s chipmakers have begun stocking up on truckloads of water to prepare for shortages. During a similar drought in 2015, Taiwan was forced to implement water restrictions for industrial companies. This can cause a significant impact on the top and bottom line as TSMC is currently producing at 100% capacity. A weakening USD can also have a significant impact on TSMC’s EPS as ~99% of their sales are in US dollars whereas only 15% of its COGS is in US dollars.</p>\n\n<p>A long-term risk for TSMC is that their increasingly dominant position in chip manufacturing is starting to attract political attention. The current shock from the auto chip shortage is forcing governments to bring vital supply chains back into their countries in order to make them less vulnerable to disruption. In the US, lawmakers are citing the chip shortage as proof that the country needs to revive more semiconductor manufacturing at home. This has forced TSMC to build a $12 billion plant in Arizona. This political climate can be beneficial for Intel, given their current foray into fabrication. (I do not think Intel can effectively compete with TSMC in fabrication without significant help in trade restrictions. As we can see from the process roadmap, Intel is currently years behind TSMC in the manufacturing process and they could not make their products work even when they had the best process technology years back)</p>\n\n<p><strong>Conclusion</strong></p>\n\n<p>TSMC is currently one of the world’s largest companies and they are definitely not resting on their laurels. They have been continuously working on building more capacity and advancing their nodes. Even though there are some short-term and long-term risks in terms of their exposure to the US dollar, rising geopolitical tensions, etc., I believe TSMC’s current technological moat, a monopoly level market share in advanced chips, and the rising use of smartphones and IoT devices put TSMC in a very strong position over the long term!</p>\n\n<p><em>Disclaimer: I am not a financial advisor. I currently do not own any stock of TSM. Please do your own extensive research before investing in any stock</em></p>\n</div><!-- SC_ON -->",
  "score": 2177,
  "permalink": "/r/wallstreetbets/comments/mikm42/i_built_a_program_that_tracks_mentions_and/",
  "subreddit": "wallstreetbets",
  "id": "mikm42",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961882732
}