{
  "author": "yuhngG82",
  "original_created_utc": 1636051789,
  "title": "Fucking bullish on Loopring",
  "created_utc": 1636065332,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am a gme shareholder since the beginning, and as soon as there was confirmed that like half of the loopring team started working at gamestop I bought a small bag, and today I swapped all my eth and btc in it because let me tell you something.. Do you know how much loyal customers gamestop has?do you know Ryan cohen? Do you know that gamestop is currently in the process of changing from an brick and mortar store into a fintech company? Do yourself the favor and get in before their partnership will get announced. Image all the fomo buyers after all the news articles about it. I won&#39;t sell before 10euros per token but you do you\nHave a nice day\nLg also this is my first post hello guys\nBack into lurker mode</p>\n\n<p>Edit: I want to add, do your own research</p>\n</div><!-- SC_ON -->",
  "score": 331,
  "permalink": "/r/CryptoCurrency/comments/qmrlen/fucking_bullish_on_loopring/",
  "subreddit": "CryptoCurrency",
  "id": "qmrlen",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I am a gme shareholder since the beginning, and as soon as there was confirmed\nthat like half of the loopring team started working at gamestop I bought a small\nbag, and today I swapped all my eth and btc in it because let me tell you\nsomething.. Do you know how much loyal customers gamestop has?do…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は創業時からのGMEの株主ですが、loopringチームの半数がGAMESTOPで働き始めたことが確認されるとすぐに\nループリングチームの半分がゲームストップで働き始めたことが確認されてすぐに小さなバッグを買いました。\n買って、今日、私のすべてのethとbtcをその中に入れました。なぜなら言わせてください。\n何かというと... Gamestopにどれだけのロイヤルカスタマーがいるか知っていますか？",
      "title": "ループリングに強気"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我从一开始就是Gme的股东，当确认有一半的loopring团队开始在Gamestop工作时，我就买了一小部分。\n我就买了一个小袋子。\n我买了一个小袋子，今天我把我所有的乙烷和BTC都换到了里面，因为让我告诉你\n因为让我告诉你... 你知道gamestop有多少忠实客户吗？",
      "title": "他妈的看涨Loopring"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我從一開始就是Gme的股東，當確認有一半的loopring團隊開始在Gamestop工作時，我就買了一小部分。\n我就買了一個小袋子。\n我買了一個小袋子，今天我把我所有的乙烷和BTC都換到了裏面，因爲讓我告訴你\n因爲讓我告訴你... 你知道gamestop有多少忠實客戶嗎？",
      "title": "他媽的看漲Loopring"
    }
  ]
}