{
  "author": "jesusvsaquaman",
  "original_created_utc": 1640300234,
  "title": "People seem to not really understand the gargantuan difference between a million and billion",
  "created_utc": 1640323901,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;If I you get $5,000 a day, it would take you only 7 months to become a millionaire.&lt;/p&gt;\n\n&lt;p&gt;However, to become a billionaire, you’ll need 548 years instead of 7 months.&lt;/p&gt;\n\n&lt;p&gt;And the reason this topic is relevant here is cause people don’t seem to understand that some coins already had their prime and will most probably NOT do another 10x or 5x&lt;/p&gt;\n\n&lt;p&gt;This is exactly why I shifted towards low market cap coins recently. So instead of ETH I’m shifting towards things like Raven cause they still have more potential. And instead of ALGO I’m shifting more towards BitDAO especially considering that they’re still very new and already have the largest treasury in the market and they’re gonna use it to make their tokens one of the most powerful in the market.&lt;/p&gt;\n\n&lt;p&gt;Basically, I’m leaning more towards new projects but with real concepts and backing behind them cause even if ETH reaches 10k or BTC reaches 100k, that’s only a 2x&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 169,
  "permalink": "/r/CryptoCurrency/comments/rn7pko/people_seem_to_not_really_understand_the/",
  "subreddit": "CryptoCurrency",
  "id": "rn7pko",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "If I you get $5,000 a day, it would take you only 7 months to become a\nmillionaire.\n\nHowever, to become a billionaire, you’ll need 548 years instead of 7 months.\n\nAnd the reason this topic is relevant here is cause people don’t seem to\nunderstand that some coins already had their prime and will…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "仮に1日5,000ドルもらえるとしたら、たった7ヶ月でなれる。\n百万長者です。\n\nしかし、億万長者になるには 7ヶ月ではなく548年必要です。\n\nこの話題がここで関係するのは、人々が知らないようだからです。\nコインの中には、すでに全盛期を迎えているものもあり、今後...",
      "title": "人々は、100万と10億の間の巨大な違いをあまり理解していないようです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果我每天得到5,000美元，你只需要7个月就能成为一个\n百万富翁。\n\n然而，要成为一个亿万富翁，你需要548年而不是7个月。\n\n这个话题与此相关的原因是，人们似乎并不了解\n明白一些硬币已经有了它们的黄金期，并将...",
      "title": "人们似乎没有真正理解一百万和十亿之间的巨大区别。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果我每天得到5,000美元，你只需要7個月就能成爲一個\n百萬富翁。\n\n然而，要成爲一個億萬富翁，你需要548年而不是7個月。\n\n這個話題與此相關的原因是，人們似乎並不瞭解\n明白一些硬幣已經有了它們的黃金期，並將...",
      "title": "人們似乎沒有真正理解一百萬和十億之間的巨大區別。"
    }
  ]
}