{
  "author": "agent47brother",
  "the_new_excerpt": "I'm not a philosopher, nor trained in philosophy, nor smart enough to understand\nmost of it, but after years of armchair reading, all I ended up with is moral\nand metaphysical uncertainty, lost between schools of thought offering arguments\nwith what seems to be equal logical strength (or almost…",
  "original_created_utc": 1623310641,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は哲学者でもなければ、哲学の訓練を受けたわけでもなく、ほとんどのことを理解できるほど賢くもありません。\n私は哲学者でもないし、哲学の訓練を受けたわけでもないし、ほとんどのことを理解できるほど頭がいいわけでもありません。\nと形而上学的な不確かさであり、同等の論理的強度を持つ議論を提供する学派の間で迷っています。\n同等の論理的強度を持つと思われる論者の間で迷っています。",
      "title": "哲学は何かの慰めになりますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不是哲学家，也没有受过哲学训练，也没有聪明到可以理解\n但经过多年的扶手式阅读，我最终得到的是道德和形而上学的不确定性。\n和形而上学的不确定性，迷失在提供论据的思想流派之间\n似乎具有同等的逻辑力量（或几乎......",
      "title": "哲学能提供一些安慰吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不是哲學家，也沒有受過哲學訓練，也沒有聰明到可以理解\n但經過多年的扶手式閱讀，我最終得到的是道德和形而上學的不確定性。\n和形而上學的不確定性，迷失在提供論據的思想流派之間\n似乎具有同等的邏輯力量（或幾乎......",
      "title": "哲學能提供一些安慰嗎？"
    }
  ],
  "title": "Can philosophy offer some comfort?",
  "created_utc": 1623348870,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m not a philosopher, nor trained in philosophy, nor smart enough to understand most of it, but after years of armchair reading, all I ended up with is moral and metaphysical uncertainty, lost between schools of thought offering arguments with what seems to be equal logical strength (or almost equal!).</p>\n\n<p>What I can see is that philosophers, even in a field that relies on rigorous reasoning and the use of logic, most of them do not change their positions for a life time, and most of the time is spent combing for technical &quot;mistakes&quot; with no major arguments powerful enough to trump the other opinion, making converging on &quot;the truth&quot; a bit of a fantasy, and making philosophers no different than the rest in taking shelter behind their emotions and upbringings.</p>\n\n<p>All of this makes the search for meaning, purpose, reason to live (for me), a very painful journey, full of fear, misery and despair. I tried taking comfort in the idea that maybe the universe is in a way that accepts many (maybe all) interpretations, but then am haunted with the idea that this arbitrariness makes my existence even more futile.</p>\n\n<p>I don&#39;t even know if this question belongs here, but I cannot think of better people to provide some insight, point out where i went wrong, maybe offer some wisdom to a naive ignorant man.</p>\n\n<p>Can philosophy offer some comfort in our journey on this planet? Be at peace with yourself and your existence?</p>\n\n<p>Thank you, everyone.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/askphilosophy/comments/nwhto2/can_philosophy_offer_some_comfort/",
  "subreddit": "askphilosophy",
  "id": "nwhto2",
  "is_self": true,
  "media": null,
  "is_video": false
}