{
  "author": "areyoudizzzy",
  "the_new_excerpt": "I've noticed a lot of people suggesting Ethereum is outdated tech and that BNB\nis the future because it has lower fees. That couldn't be further from the\ntruth.\n\nBSC is an Ethereum clone and all they did to reduce fees was increase the gas\nlimit. That means that more transactions can be processed…",
  "original_created_utc": 1617718249,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "イーサリアムは時代遅れの技術で、BNBは手数料が安いから未来の技術だと言っている人が多いですね。\nが未来だと言っています。これは真実から大きく外れています。\n真実です。\n\nBSCはEthereumのクローンで、手数料を下げるためにやったことは、ガスの上限を増やしただけです。\n制限を増やしただけです。つまり、より多くの取引が処理できるようになったということです...",
      "title": "最近のBNBの価格高騰で迷っている人のために説明すると、BSCは中央集権を犠牲にしてガスの上限を高くしたイーサリアムに過ぎません。イーサリアムの方が優れているとか、イーサリアムは「時代遅れの技術」だとか、そんなことに惑わされないでください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我注意到很多人建议Ethereum是过时的技术，BNB\n是未来，因为它的费用较低。这不可能是进一步的\n真相。\n\nBSC是Ethereum的克隆，他们为了降低费用所做的只是增加了油费\n限制。这意味着可以处理更多的交易... ...",
      "title": "对于任何因最近BNB价格暴涨而持观望态度的人来说，BSC只是以牺牲中心化为代价的更高气限的Ethereum。不要被愚弄，不要以为它更好，也不要以为Ethereum是 \"过时的技术\"，Ethereum有最多的开发者在努力改进它，幅度非常大。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我注意到很多人建議Ethereum是過時的技術，BNB\n是未來，因爲它的費用較低。這不可能是進一步的\n真相。\n\nBSC是Ethereum的克隆，他們爲了降低費用所做的只是增加了油費\n限制。這意味着可以處理更多的交易... ...",
      "title": "對於任何因最近BNB價格暴漲而持觀望態度的人來說，BSC只是以犧牲中心化爲代價的更高氣限的Ethereum。不要被愚弄，不要以爲它更好，也不要以爲Ethereum是 \"過時的技術\"，Ethereum有最多的開發者在努力改進它，幅度非常大。"
    }
  ],
  "title": "For anyone on the fence due to the recent BNB price spike, BSC is just Ethereum with a higher gas limit at the expense of centralization. Don't be fooled into thinking it's better or that Ethereum is \"outdated tech\", Ethereum has the most developers working on improving it by a very wide margin.",
  "created_utc": 1617727842,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve noticed a lot of people suggesting Ethereum is outdated tech and that BNB is the future because it has lower fees. That couldn&#39;t be further from the truth.</p>\n\n<p>BSC is an Ethereum clone and all they did to reduce fees was increase the gas limit. That means that more transactions can be processed for lower fees but it requires more powerful hardware and thus more centralization. Ethereum could do this in 10 minutes if they thought that was beneficial to the network but they haven&#39;t because doing so would break a lot of the decentralization and security of the network.</p>\n\n<p>Ethereum is so widely used and trusted <strong>because</strong> it is so decentralized and secure.</p>\n\n<p>Ethereum has the most developers and researchers working on it than any other blockchain project by a very long way which means it is literally the bleeding edge of crypto tech. The Eth killers have a long way to go to knock it off as king of DeFi.</p>\n\n<p>That&#39;s not to say that ADA and DOT aren&#39;t very promising projects but putting BSC/BNB in with them is almost laughable. It&#39;s just a clone! It will always be behind.</p>\n\n<p>Check out Ben Cowen&#39;s recent <a href=\"https://www.youtube.com/watch?v=NguprqQyUDo\">fundamentals video</a> to understand a bit more.</p>\n</div><!-- SC_ON -->",
  "score": 2879,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/GjqBv9FZx1cgW9euUpOf6hLy6AIo166v5pHas1pA1YY.jpg?auto=webp&s=8d021b77c3635442ca62dc8b3d4539999bf9f6f5",
          "width": 480,
          "height": 360
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/GjqBv9FZx1cgW9euUpOf6hLy6AIo166v5pHas1pA1YY.jpg?width=108&crop=smart&auto=webp&s=fe3638c9fc1658aad525cecd983ec10d4bb0a1fc",
            "width": 108,
            "height": 81
          },
          {
            "url": "https://external-preview.redd.it/GjqBv9FZx1cgW9euUpOf6hLy6AIo166v5pHas1pA1YY.jpg?width=216&crop=smart&auto=webp&s=08926688e7290707e162315cf961e12ac5186284",
            "width": 216,
            "height": 162
          },
          {
            "url": "https://external-preview.redd.it/GjqBv9FZx1cgW9euUpOf6hLy6AIo166v5pHas1pA1YY.jpg?width=320&crop=smart&auto=webp&s=cf0818ca5c06d332a31e036dfb4ceea7daabcc15",
            "width": 320,
            "height": 240
          }
        ],
        "variants": {},
        "id": "wJt0oJowHP-YkpY2uLww-cRtKsDZdgbSTRzb-Mkugts"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/mlcja7/for_anyone_on_the_fence_due_to_the_recent_bnb/",
  "subreddit": "CryptoCurrency",
  "id": "mlcja7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961876903
}