{
  "author": "Radiant-Demand8",
  "original_created_utc": 1659962785,
  "title": "Was I drugged by him?",
  "created_utc": 1659970616,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I’m going to try to keep this very short and (not so) sweet, me (31) and the guy I’m dating (35) have been going steady for about three months now. He hasn’t asked me to be his girlfriend yet, but it was definitely headed that way, and I was excited about the prospect of it…until today. Now I’m not so sure. &lt;/p&gt;\n\n&lt;p&gt;I wanted to go out and hang out with friends and drink, it was a weekend and I usually don’t feel like it but I really was in the mood to let loose and have fun with my girlfriends. So the plan was to go out with friends at the bars and head home later that night and have the guy I’m dating come over and spend the night at my place. That was the plan the whole day, and he knew it. He doesn’t really like to go out, he’s more of an introvert and it was a girls night so I didn’t invite him. As I’m getting ready though, he tells me he’s outside. He surprises me with flowers and a bottle of wine. I was stunned that he was here, because he knew I was about to go out. Obviously I was super appreciative and thought it was so romantic he brought me flowers and my favorite wine, but I was also really confused. Like… I was supposed to be leaving and out the door in 20 minutes. &lt;/p&gt;\n\n&lt;p&gt;I invite him in and ask him why he’s here and he basically just said he wanted to convince me to stay in with him and not go out. I laughed and politely said no, I haven’t gone out and seen my girlfriends in months, and they were all literally waiting for me. We started making out for a little bit on the couch and I was close to having sex with him (he was very persuasive) but I decided to just wait and told him to come back over tonight after I got home. He seemed ok with it, a little disappointed but he wasn’t angry or anything. He was complaining about how I was giving him “blue balls” like I had planned the whole thing. Anyways after a short conversation he agrees he’ll come back over tonight and he goes, “just have a glass of wine with me before you go out.” I didn’t really feel like it but to make him somewhat happy I agreed and ran and got two glasses. &lt;/p&gt;\n\n&lt;p&gt;After I gave him the two glasses he poured the wine and I left to my bathroom to go fix my hair and makeup because he ruined it, and I was back within two minutes. We sat and drank wine and chatted for about 15 minutes. I was annoyed because my friends were texting me and I felt all flustered and he kept telling me to “calm down” but i told him I couldn’t because I hated making people wait. Anyways, that was the last thing I said before things got a little blurry. I started feeling really tired all of a sudden and my eyes were getting really heavy. I honestly just thought it might have been the wine. Red wine always makes me sleepy. He tells me I look really tired. And I go “yeah i feel so exhausted.”&lt;/p&gt;\n\n&lt;p&gt;He goes “aw poor baby” and picks me up. I tell him to put me down. At this point I’m laughing and delirious. I didn’t really think anything of it at the time. He carries me to my bedroom and we cuddle for what felt like forever. He was whispering things in my ear (I don’t remember what exactly) and then he goes “do you want me to text your friends you can’t make it?” And I go no I’ll do it. At that point I had given up on going out. I was so tired and my limbs felt really heavy. He strokes my hair and I’m guessing I fell asleep after that. &lt;/p&gt;\n\n&lt;p&gt;I wake up the next morning and he’s still there and we’re cuddling and it never occurred to me until he left how weird that all was. I had to ask him if we had sex last night because I literally remembered nothing up to the point I texted my friends I can’t make it. Wine makes me sleepy, but I only had one glass and it didn’t really seem like the affects of wine. &lt;/p&gt;\n\n&lt;p&gt;I have no clue if he did drug me or not. I’ve been up all night wondering, and I’m scared to even ask him or accuse him because what if he didn’t. It’s a huge accusation. I just can’t think of another reason why I felt so strange or why a chunk of time was missing from my night. I genuinely don’t know what to do.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 117,
  "permalink": "/r/TooAfraidToAsk/comments/wj7zpj/was_i_drugged_by_him/",
  "subreddit": "TooAfraidToAsk",
  "id": "wj7zpj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So I’m going to try to keep this very short and (not so) sweet, me (31) and the\nguy I’m dating (35) have been going steady for about three months now. He hasn’t\nasked me to be his girlfriend yet, but it was definitely headed that way, and I\nwas excited about the prospect of it…until today. Now I’m…"
}