{
  "author": "NextGenAce",
  "original_created_utc": 1637866633,
  "title": "BAT has been rising (+26.8%) , What and Why it is for people that do not know.",
  "created_utc": 1637901783,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>BAT stands for  Basic Attention Token</p>\n\n<p>They aim to &quot;solve the endemic inefficiencies and privacy violations hobbling the digital ad industry.&quot;Basically advertisers like Google, who probably know more about you than you know about yourself. The targeted ads on every single website you go to happens behind your back, and you can do little to control your privacy. For example: You go look at a new gaming keyboard or something along that lines. You visit (Brand A), but you leave their website after. 2 minutes later you have multiple ads from (Brand B), (Brand C) and (Brand D). Google knows that you went on (Brand A)&#39;s website to look at a keyboard, and starts forcing other keyboard ads in your face. It&#39;s an invasion of privacy, and as I said, you can do little to control it.</p>\n\n<p>Why the project has been insanely successful is because of its integration with the Brave Browser, which is also privacy orientated. Brave lets you choose what kind of ads you get, rewarding you partially for viewing ads, and also calculating your attention span. From <a href=\"https://brave.com\">brave.com</a> &quot; You can control every aspect of Brave Ads — from the number of system notifications you’d like to see, to whether or not you want to hide sponsored images. You’ll earn 70% of the ad revenue that we receive from advertisers. In exchange for your attention, you’ll accumulate tokens as you browse. You can contribute these tokens to the sites you love — with more options coming later. &quot;</p>\n\n<p>Fun Fact, Brave is also built on the Chromium base which browsers like Chrome and Edge are also built on.</p>\n\n<p>Why I believe BAT is rising:I don&#39;t believe it&#39;s just following the trend, hitchhiking along with other coins, but also because it&#39;s mission is getting the attention of some media and investors. BAT has a purpose, and Brave&#39;s browser is gaining popularity, not just because you can earn some crypto on it, but also because of its built in privacy features. (Think of it like duckduckgo but you can earn a little $) It has long term potential, as intrusive advertising sites, (EX: FACEBOOK) will face lots of laws/regulations about their invasive techniques, more people will become cautious about using the internet, and wanting to stay safe. BAT has short AND long term potential.</p>\n\n<p>&#x200B;</p>\n\n<p>BAT has spiked to $1.33, with a $1,977,737,669 market cap.</p>\n\n<p>For more information about BAT read <a href=\"https://basicattentiontoken.org/\">https://basicattentiontoken.org/</a></p>\n\n<p>Brave: <a href=\"https://brave.com/\">https://brave.com/</a></p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>Thank you for listening to my ted talk.</p>\n\n<p>(I earn an average of 12-20 bat tokens a month)</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>Edit: <strong>YOU CAN WATCH YOUTUBE WITHOUT ADS</strong></p>\n</div><!-- SC_ON -->",
  "score": 233,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/TzmCIhYTwzsUYqELeWSjpODEyMLdfnk4KSwLwfjrADo.jpg?auto=webp&s=18ef4a1cdadf217375975edf10fff8a11148cea6",
          "width": 1012,
          "height": 510
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/TzmCIhYTwzsUYqELeWSjpODEyMLdfnk4KSwLwfjrADo.jpg?width=108&crop=smart&auto=webp&s=43eaf25588f7d50e003d5f583ae34944728f6fc1",
            "width": 108,
            "height": 54
          },
          {
            "url": "https://external-preview.redd.it/TzmCIhYTwzsUYqELeWSjpODEyMLdfnk4KSwLwfjrADo.jpg?width=216&crop=smart&auto=webp&s=26e20e81ab31a159a430b3e536d51474cf03199f",
            "width": 216,
            "height": 108
          },
          {
            "url": "https://external-preview.redd.it/TzmCIhYTwzsUYqELeWSjpODEyMLdfnk4KSwLwfjrADo.jpg?width=320&crop=smart&auto=webp&s=58462175d6cd0a26e74220b08471ea56e17c6e4f",
            "width": 320,
            "height": 161
          },
          {
            "url": "https://external-preview.redd.it/TzmCIhYTwzsUYqELeWSjpODEyMLdfnk4KSwLwfjrADo.jpg?width=640&crop=smart&auto=webp&s=9b10275be8f8b69f57d1a24420a201f4c6ffb3c3",
            "width": 640,
            "height": 322
          },
          {
            "url": "https://external-preview.redd.it/TzmCIhYTwzsUYqELeWSjpODEyMLdfnk4KSwLwfjrADo.jpg?width=960&crop=smart&auto=webp&s=54f2c2210f08a3b24873fa9dc23998f0f0157ff4",
            "width": 960,
            "height": 483
          }
        ],
        "variants": {},
        "id": "udMQzOV46BrmIv0kTlGVieRpH8xl-1S-qLQbaOneVO4"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/r23nhv/bat_has_been_rising_268_what_and_why_it_is_for/",
  "subreddit": "CryptoCurrency",
  "id": "r23nhv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "BAT stands for Basic Attention Token\n\nThey aim to \"solve the endemic inefficiencies and privacy violations hobbling\nthe digital ad industry.\"Basically advertisers like Google, who probably know\nmore about you than you know about yourself. The targeted ads on every single\nwebsite you go to happens…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "BATはBasic Attention Tokenの略で\n\nBATは、「デジタル広告業界に蔓延する非効率性やプライバシー侵害を解決する」ことを目的としています。\n基本的には、Googleのような広告主が、より多くのことを知っているでしょう。\n基本的には、Googleのような広告主は、あなたが自分のことを知っている以上に、あなたのことを知っているでしょう。あなたがアクセスするすべてのウェブサイトにターゲット広告が表示されます。\nあなたがアクセスするすべてのウェブサイト上のターゲット広告が起こる...",
      "title": "BATは右肩上がり（+26.8%）、知らない人には「何が、なぜ？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "BAT是基本关注代币的缩写\n\n他们的目标是 \"解决阻碍数字广告行业发展的效率低下和侵犯隐私的问题。\n基本上是像谷歌这样的广告商，他们对你的了解可能超过你对自己的了解。\n他们对你的了解可能比你对自己的了解还要多。你去的每一个网站上的目标广告\n你去的每一个网站上的定向广告都会发生...",
      "title": "BAT一直在上升（+26.8%），对于不知道的人来说，它是什么和为什么。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "BAT是基本關注代幣的縮寫\n\n他們的目標是 \"解決阻礙數字廣告行業發展的效率低下和侵犯隱私的問題。\n基本上是像谷歌這樣的廣告商，他們對你的瞭解可能超過你對自己的瞭解。\n他們對你的瞭解可能比你對自己的瞭解還要多。你去的每一個網站上的目標廣告\n你去的每一個網站上的定向廣告都會發生...",
      "title": "BAT一直在上升（+26.8%），對於不知道的人來說，它是什麼和爲什麼。"
    }
  ]
}