{
  "author": "GajarCroissant",
  "the_new_excerpt": "Whatsapp rival, the encrypted open source messaging app Signal, focussed on\nprivacy retention, integrated support for MobileCoin cryptocurrency to enable\nusers to send payments within it's encrypted network\n\nMobileCoin is a form of digital cash designed to work efficiently on mobile\ndevices while…",
  "original_created_utc": 1617731779,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Whatsappのライバル、暗号化されたオープンソースのメッセージングアプリ「Signal」は、プライバシーの保持に重点を置いています。\n暗号通貨「MobileCoin」をサポートし、暗号化されたネットワーク内での\n暗号通貨「MobileCoin」をサポートし、暗号化されたネットワーク内での支払いを可能にしました。\n\nMobileCoinは、モバイルデバイス上で効率的に機能するように設計されたデジタルキャッシュです。\nモバイルコインは、モバイルデバイス上で効率的に機能するように設計されたデジタルキャッシュです...",
      "title": "WhatsappのライバルであるSignalがCrypto支払い機能を追加、BULLISH!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Whatsapp的竞争对手，加密的开源消息应用Signal，专注于。\n隐私保留，集成支持MobileCoin加密货币，以实现\n用户可以在它的加密网络中进行支付。\n\nMobileCoin是一种数字现金形式，旨在有效地在移动设备上工作。\n设备，而...",
      "title": "Whatsapp的竞争对手Signal增加了加密支付功能，BULLISH!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Whatsapp的競爭對手，加密的開源消息應用Signal，專注於。\n隱私保留，集成支持MobileCoin加密貨幣，以實現\n用戶可以在它的加密網絡中進行支付。\n\nMobileCoin是一種數字現金形式，旨在有效地在移動設備上工作。\n設備，而...",
      "title": "Whatsapp的競爭對手Signal增加了加密支付功能，BULLISH!"
    }
  ],
  "title": "Whatsapp rival Signal adds Crypto payments feature, BULLISH!",
  "created_utc": 1617762676,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Whatsapp rival, the encrypted open source messaging app Signal, focussed on privacy retention, integrated support for MobileCoin cryptocurrency to enable users to send payments within it&#39;s encrypted network</p>\n\n<p>MobileCoin is a form of digital cash designed to work efficiently on mobile devices while protecting users&#39; privacy and even their anonymity.</p>\n\n<p>Unlike payment features in other messaging apps like WhatsApp, where users have to link bank accounts, Signal aims to provide a payment method which only the sender and receiver can track using the public ledger blockchain</p>\n\n<p>Why Mobilecoin? Although Zcash and monero exist, they usually take minutes to confirm transactions, as opposed to mobilecoin, giving a feel of venmo</p>\n\n<p>Mainstream adoption is the way to go for crypto, and with Signal integrating crypto on its platform, it is very bullish for crypto in general, which might soon replace fiat at the rate is being adopted</p>\n</div><!-- SC_ON -->",
  "score": 221,
  "permalink": "/r/CryptoCurrency/comments/mlhkew/whatsapp_rival_signal_adds_crypto_payments/",
  "subreddit": "CryptoCurrency",
  "id": "mlhkew",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961876904
}