{
  "author": "torvim",
  "the_new_excerpt": "Hello,\n\nRecently I've been doing some research as to my great grandfather's involvement\nin the war. Unfortunately, when he came home he didn't speak much about it -\nthis means that most of his experiences died with him. I have three photos,\nlikely taken at an army barracks. In one, he's atop his…",
  "original_created_utc": 1622284576,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは。\n\n最近、私は曾祖父の戦争への関与について調べています。\n祖父の戦争への関与について調べています。残念なことに、彼が帰国したとき、そのことについてあまり話さなかったのです。\nつまり、彼の経験のほとんどは彼と一緒に死んでしまったのです。私は3枚の写真を持っています。\n軍の兵舎で撮ったと思われる写真が3枚あります。一つは、彼が上に乗っているもの。",
      "title": "私の曽祖父は騎兵として第一次世界大戦に参戦しましたが、彼の日常生活はどのようなものだったのでしょうか？私の国は1914年にはまだ形成されていませんでしたが、どのように彼のことを調べていけばよいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好。\n\n最近我一直在做一些研究，了解我曾祖父的参与情况\n在战争中的表现。不幸的是，当他回到家时，他没有多说什么 --\n这意味着他的大部分经历都随他而去。我有三张照片。\n可能是在一个军营拍摄的。其中一张，他在他的...",
      "title": "我的曾祖父作为一名骑兵参加了第一次世界大战；他的日常生活是由什么样的活动构成的？鉴于我的国家在1914年还没有成立，我应该如何继续研究他？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好。\n\n最近我一直在做一些研究，瞭解我曾祖父的參與情況\n在戰爭中的表現。不幸的是，當他回到家時，他沒有多說什麼 --\n這意味着他的大部分經歷都隨他而去。我有三張照片。\n可能是在一個軍營拍攝的。其中一張，他在他的...",
      "title": "我的曾祖父作爲一名騎兵參加了第一次世界大戰；他的日常生活是由什麼樣的活動構成的？鑑於我的國家在1914年還沒有成立，我應該如何繼續研究他？"
    }
  ],
  "title": "My great grandfather fought in World War 1 as a cavalryman; what sort of activities made up his day-to-day life? How should I keep researching him, given that my country was not yet formed in 1914?",
  "created_utc": 1622303042,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello,</p>\n\n<p>Recently I&#39;ve been doing some research as to my great grandfather&#39;s involvement in the war. Unfortunately, when he came home he didn&#39;t speak much about it - this means that most of his experiences died with him. I have three photos, likely taken at an army barracks. In one, he&#39;s atop his horse and the other two feature him posing on his own and with his squad. Unfortunately, as they were taken circa 1914 the picture quality isn&#39;t great. I&#39;ve tried my best to create high quality scans but there&#39;s little I can do for pictures that weren&#39;t preserved very well. </p>\n\n<p>Our family has lived in the north of Ireland (now Northern Ireland) for as long as I can trace my lineage back. He was born in either Fermanagh or Antrim, and his family were Protestant. His surname was Campbell and he was 18-19 in 1914. He most likely fought with the 36th Ulster Brigade as a mounted troop, although an insignia on his cap infers that he might have had a different role during the war. </p>\n\n<p><a href=\"https://imgur.com/a/o1Oxv1U\">The pictures.</a></p>\n\n<p>Any more info as to his involvement in the war would be greatly appreciated.</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/AskHistorians/comments/nnkqrn/my_great_grandfather_fought_in_world_war_1_as_a/",
  "subreddit": "AskHistorians",
  "id": "nnkqrn",
  "is_self": true,
  "media": null,
  "is_video": false
}