{
  "author": "cefpodoxime",
  "the_new_excerpt": "$SLQT [https://www.stocktwits.com/symbol/SLQT], SelectQuote\n\nMarket cap: 4.71B\n\nShare price at time of writing: $28.40\n\nIPO date 5/21/2020, closing IPO day price: $27\n\nI believe $SLQT is a still 'hidden gem' growth stock. They have been executing\nflawlessly quarter after quarter since their IPO last…",
  "original_created_utc": 1613755093,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "$SLQT [https://www.stocktwits.com/symbol/SLQT], SelectQuote\n\n市值。4.71B\n\n发稿时股价：28.40美元\n\nIPO日期5/21/2020，IPO当日收盘价：27美元。\n\n我相信$SLQT仍然是一只 \"隐藏的宝石 \"成长股。他们一直在执行\n自去年上市以来，一个季度又一个季度地完美无瑕...",
      "title": "$SLQT - 盈利能力强，执行力无懈可击，收入增长超过70%，但价值仍被低估。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "$SLQT [https://www.stocktwits.com/symbol/SLQT], SelectQuote\n\n市值。4.71B\n\n發稿時股價：28.40美元\n\nIPO日期5/21/2020，IPO當日收盤價：27美元。\n\n我相信$SLQT仍然是一隻 \"隱藏的寶石 \"成長股。他們一直在執行\n自去年上市以來，一個季度又一個季度地完美無瑕...",
      "title": "$SLQT - 盈利能力強，執行力無懈可擊，收入增長超過70%，但價值仍被低估。"
    }
  ],
  "title": "$SLQT - highly profitable and executing flawlessly with >70% revenue growth, still undervalued",
  "created_utc": 1613777122,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.stocktwits.com/symbol/SLQT\">$SLQT</a>, SelectQuote</p>\n\n<p>Market cap: 4.71B</p>\n\n<p>Share price at time of writing: $28.40</p>\n\n<p>IPO date 5/21/2020, closing IPO day price: $27</p>\n\n<p>I believe $SLQT is a still &#39;hidden gem&#39; growth stock. They have been executing flawlessly quarter after quarter since their IPO last year, by leveraging their proprietary machine learning technology to improve agent productivity and accelerate sales.</p>\n\n<p>Founded in 1985, SelectQuote helps consumers purchase complex senior health, life, auto, and home insurance policies from a curated panel of the nation&#39;s leading insurance carriers. They were the first direct-to-consumer term life insurance exchange platform in the U.S. The company doesn&#39;t provide the insurance, but rather finds consumers looking to buy it and matches them with insurance carriers. SelectQuote earns commissions from the insurance carriers for the policies it sells on their behalf.</p>\n\n<p>It has a total addressable market (TAM) of at least $180 billion for the insurance products its distributes. The company believes the TAM presents an annual commission revenue opportunity of roughly $28 billion for its seniors segment, $105 billion in life insurance, and $47 billion in auto and home insurance. In each of those three segments, <strong>SelectQuote estimates its market share to be less than 1% and thinks there is a lot of potential for better market penetration and market growth.</strong></p>\n\n<p><strong>SLQT had</strong> total revenue of $337.5 million in fiscal 2019, up 44% from sales in fiscal 2018.</p>\n\n<p>In 2020, they had 534 million revenue, up 58%</p>\n\n<p>Now, they expect <strong>76% revenue increase for 2021</strong> over full year 2020.</p>\n\n<p><strong>This is accelerating revenue growth.</strong></p>\n\n<p>They have had blowout quarters, including most recent earnings Feb 8,  2021:</p>\n\n<p>-Consolidated revenue up 103% YoY, 68% gross margins</p>\n\n<p>-<strong>2021 guidance raised twice in a row already</strong> (in Nov and again this Feb). Full year 2021 revenue of 940M now expected, 76% increase over full year 2020.</p>\n\n<p>-Profitable, <strong>adj EBITDA up 88% YoY</strong> with better margins than its competitors EHealth (EHTH) and GoHealth (GOCO) which are growing much slower and losing money. Note that SLQT&#39;s other &#39;competitor&#39; is Everquote (EVER) which is more concentrated in auto sales (80% revenue) and still losing money, while SelectQuote has auto comprising &lt;20% of its revenue</p>\n\n<p>-proprietary machine learning platform to drive sales efficiency. Agent productivity steadily increasing (see <a href=\"https://s23.q4cdn.com/545595037/files/doc_financials/2021/q2/SelectQuote-Inc.-December-31-2020-10-Q-Earnings-Presentation-VFINAL.pdf\">https://s23.q4cdn.com/545595037/files/doc_financials/2021/q2/SelectQuote-Inc.-December-31-2020-10-Q-Earnings-Presentation-VFINAL.pdf</a> )</p>\n\n<p>-The Biden admin desire to expand Medicare age to 60, would be a MASSIVE tailwind to sector if it ever goes through</p>\n\n<p><strong>VALUATION:</strong></p>\n\n<p>Enterprise value 4.86B</p>\n\n<p>Forward EV/S: 4.3x</p>\n\n<p>Considering that other tech growth companies are growing slower and aren&#39;t even profitable plus with worse gross margins (like for example, FUBO is trading at 12.3x forward EV/S), I believe SLQT should trade at minimum at 8x forward EV/S. The stock price should at least be double what it is today, if not more. My target price is $60 before end of 2021.</p>\n\n<p><strong>ANALYST COVERAGE:</strong></p>\n\n<blockquote>\n<p>2/9/2021: Evercore ISI analyst Elizabeth Anderson raised the firm&#39;s price target on SelectQuote to $38 from $35 and keeps an Outperform rating on the shares, noting that the company &quot;had a very strong AEP&quot; but despite robust growth its LTVs remained stable. The Q2 results &quot;come as a relief and further reinforce its differentiated business model,&quot; according to Anderson, who adds that she is excited by SelectQuote&#39;s continued initiatives to deepen relationships with carriers.  </p>\n\n<p>2/9/2021:  Barclays analyst Steve Valiquette raised the firm’s price target on SelectQuote to $36 from $32 and keeps an Overweight rating on the shares. Industry concerns were put to rest with a “strong quarter” from SelectQuote, Valiquette tells investors in a research note.</p>\n</blockquote>\n\n<p><strong>RISKS:</strong></p>\n\n<p>-Implementation of single payer health will be very bad, but this seems highly unlikely on the horizon</p>\n\n<p>-Insider trading has shown selling, but I believe this is because they have not been able to sell at a decent price since IPO date; the price of stock traded below IPO for much of last year until finally the market started to recognize their success recently. It was probably very frustrating that they couldn’t cash out some of gains until now.</p>\n\n<p>-Competition in the massive TAM is heating up. Walmart made an entry last year (July 2020: <a href=\"https://www.cnbc.com/2020/07/08/walmart-quietly-registers-insurance-business-in-its-latest-move-into-health-care.html\">https://www.cnbc.com/2020/07/08/walmart-quietly-registers-insurance-business-in-its-latest-move-into-health-care.html</a> ) </p>\n\n<p>However, per Citi’s analyst (10/6/2020):</p>\n\n<blockquote>\n<p>After Walmart (WMT) announced it is launching Walmart Insurance Services, a licensed insurance brokerage, Citi analyst Daniel Grosslight said he views the company’s entry into the Medicare Advantage broker market as “a significant competitive threat to the tech-enabled DTC brokers,” particularly eHealth (EHTH). He views the platform as most comparable to eHealth’s, citing the ability to search for plans and enroll completely online without speaking with an agent, and believes SelectQuote (SLQT) should “be relatively better protected” given its high touch approach and diversification, Grosslight tells investors.</p>\n</blockquote>\n\n<p>Disclosure: I am long SLQT with a couple thousand shares.</p>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/investing/comments/lnl70t/slqt_highly_profitable_and_executing_flawlessly/",
  "subreddit": "investing",
  "id": "lnl70t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332881981
}