{
  "author": "3STmotivation",
  "the_new_excerpt": "To say we had an interesting few weeks in the uranium sector would be a massive\nunderstatement. We have seen new geopolitical support for nuclear power and a\nmassive new catalyst in the form of the newly formed Sprott Uranium Trust (more\non that later). There was also a new version released of the…",
  "original_created_utc": 1620047705,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この数週間、ウラン部門では興味深い出来事があったと言っても過言ではありません。\n控えめな表現です。地政学的に原子力発電が新たに支持されたことや\n新たに設立されたSprott Uranium Trust(詳細はこちら)という形で、大規模な新しい触媒が登場しました。\n詳細は後述）。) また、新バージョンの...",
      "title": "ウラン市場の最新情報、これまでの最大のカタリストの一つがそろそろ出てきました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果说我们在铀矿部门有一个有趣的几周，那将是一个巨大的轻描淡写。\n是一个巨大的轻描淡写的说法。我们看到了新的地缘政治对核电的支持，以及新成立的斯普罗特铀业公司这个巨大的新催化剂。\n新成立的Sprott Uranium Trust是一个巨大的新催化剂。\n关于这一点，稍后会有更多报道）。) 此外，还发布了一个新的版本，即 \"中国核电\"。",
      "title": "铀市场更新，迄今为止最大的催化剂之一即将到位。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果說我們在鈾礦部門有一個有趣的幾周，那將是一個巨大的輕描淡寫。\n是一個巨大的輕描淡寫的說法。我們看到了新的地緣政治對核電的支持，以及新成立的斯普羅特鈾業公司這個巨大的新催化劑。\n新成立的Sprott Uranium Trust是一個巨大的新催化劑。\n關於這一點，稍後會有更多報道）。) 此外，還發布了一個新的版本，即 \"中國核電\"。",
      "title": "鈾市場更新，迄今爲止最大的催化劑之一即將到位。"
    }
  ],
  "title": "Uranium market update, one of the biggest catalysts to date is about to be in place.",
  "created_utc": 1620057323,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>To say we had an interesting few weeks in the uranium sector would be a massive understatement. We have seen new geopolitical support for nuclear power and a massive new catalyst in the form of the newly formed Sprott Uranium Trust (more on that later). There was also a new version released of the Bear Traps Report, a popular type of newsletter that in the words of John Quakes is “send to thousands of Wall Street money managers”. It is also believed that the initial run up was sparked by the sharing of a similar Bear Traps Report article around November/December of last year, sparking the first leg up with institutional capital positioning in the sector. There is *a lot* happening beneath the surface and the coming few months will, in my view, prove to be significant.</p>\n\n<p>Here is the first part of the Bear Traps Report with my own added comments as well:</p>\n\n<p>In 2020, six nuclear reactors were connected to the gnd. Of these, Belarus and the UAE opened their first nuclear reactors. This, despite the pandemic. We expect this trend to continue over the balance of the century. There are currently 108 planned nuclear reactors globally at various stages of the approval funding process. Different countries get different percentages from nuclear reactors, a sample: China, 4.9%; India, 3.2%, Japan, 7.5%, UK 15.6%, USA, 19.7%. The take away is that between China, the UK and the USA, alone, there is plenty of potential growth in nuclear reactor electricity supply and, of course, these countries have the financial wherewithal to fund the requisite nuclear reactors to go green should consensus so direct.</p>\n\n<p>Production from mining (in tonnes U) for 2019 was. 22,808 from Kazakhstan: 6,938 from Canada, 6,613 from Australia, 5,476 from Namibia, estimated 3,500 from Uzbekistan 2,983 from Russia, estimated 1,885 from China, 801 from Ukraine, and 67 from the USA Production in the U.S. has been in steady decline: 2014 = 1,919, 2015 = 1,256, 2016 = 1,125, 2017 = 940, 2018 = 582, 2019 = 67. </p>\n\n<p>The main takeaway here is there is a seemingly strong geopolitical risk component to Uranium supply. U.S. production has essentially evaporated, an extremely bullish fact for forward Uranium pricing given Biden&#39;s pro-nuclear stance. Production of Uranium concentrate in the U.S. has fallen steeply and steadily (pounds U308): 2,422,789 for 2017, 1,446,496 for 2018, 173,875 for 2019. In the first quarter of 2020-8,989 vs 58,481 in first quarter 2019 vs 226,780 first quarter 2018 and 450,215 first quarter of 2017.  </p>\n\n<p>Overall, nuclear power provides about 11% of global electricity output. Demand grows alapually in the single digits. Because of low prices, global Uranium supply is down 25%. If prices double, mines will reopen and consolidate. If the U.S. alone decides to go big on nuclear prices will at least double. And assuming prices double, supply will be adequate to power U.S. nuclear ambitions. It goes both ways. The U.S. produces but 7% of its own demand, with 93% dependent on imports. &quot;For strategic issues such as power supply and defense, this is not a healthy situation, and therefore the plan was made for a strategic stockpile, &quot;Gabi Schneider, the executive director of the Namibian Uranium Institute, explains, adding it is ultimately the US&#39;s goal to expand uranium production domestically in order to shrink, or halt outright, U.S. imports of Uranium. </p>\n\n<p>The U.S. goverment&#39;s Uranium strategic stockpile effort passed last December is a key, and telling, first step. At the state level, legislatures have begun passing laws that set up support for nuclear reactors. This represents a big shift from half a century ago. The Biden administration is pro-nuclear power. China&#39;s nuclear reactor capacity is set to grow from 46 GWe in 2020 to 108 GWe by 2030. We expect ground to be broken for nuclear reactors over the balance of this decade in Uzbekistan, Kazakhstan and Poland. Projects have begun in Turkey, Bangladesh and Egypt. So it&#39;s not just a question of the wealthiest countries jumping in. </p>\n\n<p>Consensus thought on Uranium has been remarkably stupid, missing the supply cuts, missing the 5x move in conversion prices (UF6), missing the 40% rise in SWU (enrichment) prices, and missing the recent run up in spot prices (U308). Basically, consensus can&#39;t even think one step ahead when it comes to basic economics. It didn&#39;t occur to them that money losing mines would be shut down.</p>\n\n<p>The US needs to guarantee greater uranium supply. For that it needs U.S. mines to reopen and consolidate. For that Uranium prices have to double. The new U.S. Uranium stockpile could prove a key component to that price shift. Uranium just entered supply deficit Kazakhstan&#39;s Uranium production forecast is for its Uranium production to peak next year and to go into serious decline post 2030.</p>\n\n<p>&#x200B;</p>\n\n<p>All of this comes down to one simple fact, it is that we are running out of time for uranium prices to get going and the longer this doesn’t happen, the higher the eventual price overshoot to try and make up for a decade of lost capex investments and exploration. If utilities come to the table within the next 12 months, some form of price control can be asserted and perhaps a slower run up into a price of roughly 60-65 dollars with a small overshoot to around 80 dollars by 2024 might be the most probable scenario. If they don’t though, we might be looking at triple digit uranium once more. One massive new catalyst that was brought to the table recently was the fact the coming into existence of the Sprott Uranium Trust. The bear traps report names 9 reasons why this will likely have significant implications for the broad uranium market:  </p>\n\n<p>Uranium Participation Corp was a company that was buying U and sitting on it, the original yellow cake. The market will now have daily price discovery and a retail / family office / small asset manager speculation vehicle. This is a game changer. Now we have a new team taking over (Sprott). Very bullish for uranium. Why? Here is why:</p>\n\n<ol>\n<li><p>We are getting a U.S. listed vehicle with a physical redemption Like a GLD for uranium. Look at PSLV and PHYS, equivalent.</p></li>\n<li><p>A new mechanism for retail, institutional. An at the market facility. Technically a closed end fund, NOT a GLD.</p></li>\n<li><p>Pounds come in, don&#39;t go out. They could do a buyback if the market provides that opportunity.</p></li>\n<li><p>Uranium Participation Corp is tough to buy, pink sheet. Many online brokers didn’t offer it, but now there will be a new liquidity vehicle that is far more widely available.</p></li>\n<li><p>Management transition from Denison to Sprott. Think Industry player to real asset mgr.</p></li>\n<li><p>When there is large premium new buyers are vulnerable. This has suppressed upside momentum NOW there is a liquid vehicle, large buyers can come in with a liquidity work out.</p></li>\n<li><p>Next, Sprott does a big offering to bring in new pounds into the fund. There was too much inventory of uranium in the system, this vehicle will eliminate this problem. New size buyers of the fund will quickly translate into spot buying!</p></li>\n<li><p>Think CME and oil this could be a new real franchise /a liquidity central facility</p></li>\n<li><p>Management take over might take 2/3 months. Then the premium U Part will come in, was 16% today in a month or so Dan Loeb can come in and buy $100m without the premium risk pounds will permanently be removed from the mkt NOT an ETF, it’s a closed end fund. A discount may develop in the shares but new buyers are in a much better spot.</p></li>\n</ol>\n\n<p>&#x200B;</p>\n\n<p>That marks the end of this uranium market update and I hope you enjoyed the read. With so much happening both in front as well as behind the scenes, hopefully I can be of aid to help you traverse this opaque market in the best way possible. We are at the foot of what will undoubtably prove to be a generational event, but it will be an extremely volatile and wild market all the way up and eventually down as well. If you got any questions or comments, my dm’s are always open. As always I wish you all a good and healthy rest of your day and good luck out there in the markets, cheers!</p>\n</div><!-- SC_ON -->",
  "score": 339,
  "permalink": "/r/stocks/comments/n3vqmp/uranium_market_update_one_of_the_biggest/",
  "subreddit": "stocks",
  "id": "n3vqmp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380968352
}