{
  "author": "verysillyman",
  "original_created_utc": 1639435934,
  "title": "Moment of silence",
  "created_utc": 1639442034,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For all of those who talked to their family members about the markets at Thanksgiving dinner, and convinced them to buy crypto or stocks. A good idea in general, but the timing could not have been worse. &lt;/p&gt;\n\n&lt;p&gt;At this very moment, members of our community are getting throttled like Bart Simpson by friends and family members who put too much money into the markets right before a big correction. &lt;/p&gt;\n\n&lt;p&gt;Now all that we can do is have a moment of silence for our brothers and sisters who are facing all of the blame and frustration of their loved ones for giving them solid advice but at the wrong time. Hopefully we will all recover and be able to say I told you so in the future&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 361,
  "permalink": "/r/CryptoCurrency/comments/rfsjxy/moment_of_silence/",
  "subreddit": "CryptoCurrency",
  "id": "rfsjxy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "For all of those who talked to their family members about the markets at\nThanksgiving dinner, and convinced them to buy crypto or stocks. A good idea in\ngeneral, but the timing could not have been worse.\n\nAt this very moment, members of our community are getting throttled like Bart\nSimpson by…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "でご家族に市場の話をされた皆様。\n感謝祭のディナーで、暗号や株を買うように説得した。良いアイデアだ。\nしかし、このタイミングは最悪だった。\n\nこの瞬間、私たちのコミュニティのメンバーは、バートのように喉を鳴らされているのです。\nシンプソンに...",
      "title": "モメンタムオブサイレンス"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对于所有那些在感恩节晚餐上与家人谈论市场的人来说\n感恩节晚餐，并说服他们购买加密货币或股票。一般来说，这是一个好主意，但时机不可能更糟。\n一般来说是个好主意，但时机不可能更糟。\n\n此时此刻，我们社区的成员正像巴特-辛普森一样被扼杀。\n辛普森一样被...",
      "title": "默哀时刻"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對於所有那些在感恩節晚餐上與家人談論市場的人來說\n感恩節晚餐，並說服他們購買加密貨幣或股票。一般來說，這是一個好主意，但時機不可能更糟。\n一般來說是個好主意，但時機不可能更糟。\n\n此時此刻，我們社區的成員正像巴特-辛普森一樣被扼殺。\n辛普森一樣被...",
      "title": "默哀時刻"
    }
  ]
}