{
  "author": "FordPrefect343",
  "original_created_utc": 1632154463,
  "title": "The Evergrande Debt Crisis is a Black Swan Event Unfolding",
  "created_utc": 1632180786,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This debt implosion to me was a black swan anways, I don’t know if there were warning signs prior but i sure wasn’t aware of them.</p>\n\n<p>This is not a “dip”, a “correction” or otherwise. The Markets are reacting to a very real threat that could have massive implications.</p>\n\n<p>TA is completely out the window right now, this could be a blip, a signal day scare or we could be about to fall off over a cliff.</p>\n\n<p>A lot of smart money is reducing leverage and moving capital into cash or safer investments, you may want to consider doing the same.</p>\n\n<p>Buying the dip could also yeild outstanding gains, just understand the situation we are in before making a decision.</p>\n\n<p>Stay safe everyone.</p>\n\n<p>Edit: OK OK i see people have been predicting a crash due to tethers potential involvement in evergrande for a while, making this not a black swan.</p>\n</div><!-- SC_ON -->",
  "score": 185,
  "permalink": "/r/CryptoCurrency/comments/pry2c4/the_evergrande_debt_crisis_is_a_black_swan_event/",
  "subreddit": "CryptoCurrency",
  "id": "pry2c4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This debt implosion to me was a black swan anways, I don’t know if there were\nwarning signs prior but i sure wasn’t aware of them.\n\nThis is not a “dip”, a “correction” or otherwise. The Markets are reacting to a\nvery real threat that could have massive implications.\n\nTA is completely out the window…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今回の債務破綻は、私にとってはブラックスワンでした。\n事前に警告のサインがあったかどうかはわかりませんが、私はそれに気づかなかったのです。\n\nこれは「落ち込み」でも「調整」でもなんでもない。市場が反応しているのは\n市場は、巨大な影響を及ぼす可能性のある非常に現実的な脅威に反応しているのです。\n\nTAは完全に蚊帳の外です...。",
      "title": "エバーグランデの債務危機は、ブラックスワン・イベントとして展開されている。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对我来说，这次债务内爆是一只黑天鹅，我不知道之前是否有警告信号，但我肯定没有意识到。\n预警信号，但我肯定没有意识到它们。\n\n这不是一次 \"下跌\"、\"修正 \"或其他。市场正在对一个\n非常真实的威胁，可能有巨大的影响。\n\nTA是完全不存在的......。",
      "title": "恒大债务危机是一个黑天鹅事件的展开"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對我來說，這次債務內爆是一隻黑天鵝，我不知道之前是否有警告信號，但我肯定沒有意識到。\n預警信號，但我肯定沒有意識到它們。\n\n這不是一次 \"下跌\"、\"修正 \"或其他。市場正在對一個\n非常真實的威脅，可能有巨大的影響。\n\nTA是完全不存在的......。",
      "title": "恆大債務危機是一個黑天鵝事件的展開"
    }
  ]
}