{
  "author": "AskScienceModerator",
  "the_new_excerpt": "Hi Reddit,\n\nWe're the six scientists profiled in the Reuters Hot List series\n[https://www.reuters.com/investigates/section/climate-change-scientists/], a\nproject ranking and profiling the world's top climate scientists. We'll be\naround for the next several hours to answer your questions about…",
  "original_created_utc": 1619694002,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは、Reddit。\n\n私たちは、ロイターのホットリストシリーズで紹介された6人の科学者です。\n[https://www.reuters.com/investigates/section/climate-change-scientists/]という\n世界のトップ気候科学者をランキング形式で紹介するプロジェクトです。私たちは\nこれから数時間、皆さんの質問にお答えします...",
      "title": "AskScience AMAシリーズ。私たちは世界中の気候科学者です。何でも聞いてください"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嗨，Reddit。\n\n我们是路透社热榜系列报道中的六位科学家\n[https://www.reuters.com/investigates/section/climate-change-scientists/]，一个\n该项目对世界顶级气候科学家进行排名和介绍。我们将在\n在接下来的几个小时里，我们将回答你的问题，关于...",
      "title": "AskScience AMA系列。我们是来自世界各地的气候科学家。问我们任何问题!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嗨，Reddit。\n\n我們是路透社熱榜系列報道中的六位科學家\n[https://www.reuters.com/investigates/section/climate-change-scientists/]，一個\n該項目對世界頂級氣候科學家進行排名和介紹。我們將在\n在接下來的幾個小時裏，我們將回答你的問題，關於...",
      "title": "AskScience AMA系列。我們是來自世界各地的氣候科學家。問我們任何問題!"
    }
  ],
  "title": "AskScience AMA Series: We're climate scientists from around the world. Ask us anything!",
  "created_utc": 1619706846,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi Reddit,</p>\n\n<p>We&#39;re the six scientists profiled in the Reuters <a href=\"https://www.reuters.com/investigates/section/climate-change-scientists/\">Hot List series</a>, a project ranking and profiling the world&#39;s top climate scientists. We&#39;ll be around for the next several hours to answer your questions about climate change and more. A little more about us:</p>\n\n<p><a href=\"https://www.reuters.com/investigates/special-report/climate-change-scientists-oppenheimer/\">Michael Oppenheimer</a>, Professor of Geosciences and International Affairs at Princeton University: My <a href=\"https://scholar.princeton.edu/oppenheimer\">research and teaching</a> focus on climate change and its impacts, especially sea level rise and human migration. My research group examines how households and societies manage the impacts of sea level rise and coastal storms, the increasing risk these bring as Earth warms, and policies to reduce greenhouse gas emissions, increase adaptation and limit the risks. We also model the effect of climate change on human migration which is a longstanding adaptation to climate variations. We project future climate-driven migration and analyze policies that can ease the burden on migrants and their origin and destination communities. Follow me on <a href=\"https://twitter.com/ClimateOpp\">Twitter</a>.</p>\n\n<p><a href=\"https://www.reuters.com/investigates/special-report/climate-change-scientists-lequere/\">Corinne Le Quéré</a>, Royal Society Professor of Climate Change Science at the University of East Anglia in the UK: I conduct research on the interactions between <a href=\"https://www.nature.com/articles/s41558-020-0797-x.epdf\">climate change (ePDF)</a> and the carbon cycle, including the drivers of <a href=\"https://www.nature.com/articles/s41558-021-01001-0.epdf\">CO2 emissions (ePDF)</a> and the response of the natural carbon sinks. I Chair the French High council on climate and sit on the UK Climate Change Committee, two independent advisory boards that help guide climate actions in their respective governments. I am author of three IPCC reports, former director of the Tyndall Centre for Climate Change Research and of the annual update of the global carbon budget by the Global Carbon Project. Read more on my <a href=\"https://people.uea.ac.uk/c_lequere\">website</a>, watch my <a href=\"https://www.youtube.com/watch?v=O6f4Q_ReMxA\">TED talk</a> and <a href=\"https://www.bbc.co.uk/programmes/m0003cy9\">BBC interview</a>, and follow me on <a href=\"https://twitter.com/clequere\">Twitter</a>.</p>\n\n<p><a href=\"https://www.reuters.com/investigates/special-report/climate-change-scientists-caldeira/\">Ken Caldeira</a>, Senior Scientist at Breakthough Energy: I joined Breakthrough Energy (BE) as Senior Scientist in January of 2021, but I have been helping to bring information and expertise to Bill Gates since 2007. I&#39;m committed to helping scale the technologies we need to achieve a path to net zero emissions by 2050, and thinking through the process of getting these technologies deployed around the world in ways that can both improve people&#39;s lives and protect the environment. Visit my <a href=\"https://dge.carnegiescience.edu/labs/caldeira-lab\">lab page</a> and follow my <a href=\"https://kencaldeira.wordpress.com/\">blog</a>.</p>\n\n<p><a href=\"https://www.reuters.com/investigates/special-report/climate-change-scientists-duarte/\">Carlos Duarte</a>, Distinguished Professor and Tarek Ahmed Juffali Research Chair in Red Sea Ecology at the King Abdullah University of Science and Technology (KAUST), in Saudi Arabia: My <a href=\"https://en.wikipedia.org/wiki/Carlos_M._Duarte\">research</a> focuses on understanding the effects of climate change in marine ecosystems and developing ocean-based solutions to global challenges, including climate change, and develop evidence-based strategies to rebuild the abundance of marine life by 2050. Follow me on <a href=\"https://twitter.com/duarteoceans\">Twitter</a>.</p>\n\n<p><a href=\"https://www.reuters.com/investigates/special-report/climate-change-scientists-arblaster/\">Julie Arblaster</a>: I&#39;m a climate scientist with expertise in using climate models to understand mechanisms of recent and future climate change.</p>\n\n<p>Kaveh Madani, Visiting Scholar (Yale University) and Visiting Professor (Imperial College London): <a href=\"https://www.kavehmadani.com/about\">My work</a> focuses on mathematical modeling of complex, coupled human-environment systems to advise policy makers. Follow me on <a href=\"https://twitter.com/KavehMadani\">Twitter</a>, <a href=\"https://www.instagram.com/kmadanil/\">Instagram</a>, <a href=\"https://www.facebook.com/kavehmadani\">Facebook</a> and <a href=\"https://www.youtube.com/channel/UCeYquVn3pdKw3VJEL2Z_INg\">YouTube</a>. Watch my <a href=\"https://www.kavehmadani.com/englishtalks\">talks</a> and <a href=\"https://www.kavehmadani.com/interviews\">interviews</a>.</p>\n\n<p>We&#39;re also joined by <a href=\"https://twitter.com/motamman\">Maurice Tamman</a>, who reported &quot;The Hot List&quot; series and can answer questions about how it came together. He is a reporter and editor on the Reuters enterprise unit based in New York City. His other work includes &quot;<a href=\"https://www.reuters.com/investigates/section/ocean-shock/\">Ocean Shock</a>,&quot; an expansive examination of how climate change is causing chaos for fisheries around the planet. Previously, Mo ran the unit’s forensic data team, which he created after joining Reuters in 2011 from The Wall Street Journal.</p>\n\n<p>We&#39;ll be on starting at 12 p.m. ET (16 UT). Ask us anything!</p>\n\n<p>Username: <a href=\"/u/Reuters\">/u/Reuters</a></p>\n\n<hr/>\n\n<p>Follow Reuters on <a href=\"https://twitter.com/Reuters/\">Twitter</a>, <a href=\"https://www.facebook.com/Reuters/\">Facebook</a>, <a href=\"https://www.instagram.com/reuters/\">Instagram</a>, <a href=\"https://www.linkedin.com/company/reuters2/\">LinkedIn</a>, and <a href=\"https://www.youtube.com/channel/UChqUTb7kYRX8-EiaN3XFrSQ\">YouTube</a>.</p>\n</div><!-- SC_ON -->",
  "score": 108,
  "permalink": "/r/askscience/comments/n11vaj/askscience_ama_series_were_climate_scientists/",
  "subreddit": "askscience",
  "id": "n11vaj",
  "is_self": true,
  "media": null,
  "is_video": false
}