{
  "author": "Colmado_Bacano",
  "the_new_excerpt": "I joined this subreddit, 3 months ago, depressed because I am an old broke fat\nguy. I am still an old broke fat guy, in fact, even broker! Nonetheless, this\ncommunity makes me feel good about being broke.\n\nI see a dip, and I get exited because I can come in and watch everyone come\ntogether and bitch…",
  "original_created_utc": 1621177095,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は3ヶ月前にこのサブレディットに参加しましたが、私は年老いた破産した太った男なので落ち込みました。\nの男です。私は今でも年老いた破産した太った男で、実際にはブローカーでさえあります。それにもかかわらず、この\nしかし、このコミュニティは私を無一文であることに満足させてくれます。\n\n落ち込んでいるのを見ると、ワクワクしてきます。\nみんなで集まって愚痴を言い合っているのを見ることができるからです...",
      "title": "お金を失うこと」を楽しくしてくれるこのコミュニティに感謝したいと思います。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在3个月前加入了这个分论坛，很沮丧，因为我是一个破产的老胖子。\n的人。我仍然是一个老破产的胖子，事实上，甚至是经纪人！\"。尽管如此，这个\n社区让我对自己的破产感觉良好。\n\n我看到下跌，我就很兴奋，因为我可以进来，看着大家一起\n一起发牢骚...",
      "title": "我要感谢这个社区使 \"输钱 \"成为一种乐趣!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在3個月前加入了這個分論壇，很沮喪，因爲我是一個破產的老胖子。\n的人。我仍然是一個老破產的胖子，事實上，甚至是經紀人！\"。儘管如此，這個\n社區讓我對自己的破產感覺良好。\n\n我看到下跌，我就很興奮，因爲我可以進來，看着大家一起\n一起發牢騷...",
      "title": "我要感謝這個社區使 \"輸錢 \"成爲一種樂趣!"
    }
  ],
  "title": "I'd like to thank this community for making \"losing money\" fun!",
  "created_utc": 1621191433,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I joined this subreddit, 3 months ago, depressed because I am an old broke fat guy.  I am still an old broke fat guy, in fact, even broker!  Nonetheless, this community makes me feel good about being broke.  </p>\n\n<p>I see a dip, and I get exited because I can come in and watch everyone come together and bitch together.  We suffer through the dips, applaud when the [what the fuck is the opposite of dip is] happens, and live, love and laugh.</p>\n\n<p>You guys really make losing money fun!  Let&#39;s hope that none of you drop out so we can keep losing even more together!  </p>\n\n<p>I love you all.</p>\n</div><!-- SC_ON -->",
  "score": 1920,
  "permalink": "/r/CryptoCurrency/comments/ndq3tv/id_like_to_thank_this_community_for_making_losing/",
  "subreddit": "CryptoCurrency",
  "id": "ndq3tv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590799663
}