{
  "author": "warwickfilm",
  "the_new_excerpt": "So I’ve been thinking about regrets people have had in the past, you know the\nstories where people say “oh I invested in Bitcoin at $1,000 but sold when it\nhit $7,000” we’ve seen the same regrets over and over again.\n\nHere’s a solution. Say you wanna hold for at least 5 years, but you’re afraid\nyour…",
  "original_created_utc": 1622973377,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そこで私は、人々が過去に経験した後悔について考えてみました。\nビットコインに1,000ドルで投資したが、7,000ドルになったときに売ってしまった」というような話です。\n私たちは同じような後悔を何度も目にしてきました。\n\nここで解決策を考えてみましょう。最低でも5年間は保有したいと考えています。\nあなたの...",
      "title": "長期保有しないと怖いという人には最適なアイデア"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我一直在思考人们在过去的遗憾，你知道的\n人们说 \"哦，我在1000美元时投资了比特币，但在它达到7000美元时卖掉了 \"的故事。\n我们一次又一次地看到同样的遗憾。\n\n这里有一个解决方案。假设你想至少持有5年，但你害怕\n你的...",
      "title": "如果你害怕不长期持有，这是一个好主意"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我一直在思考人們在過去的遺憾，你知道的\n人們說 \"哦，我在1000美元時投資了比特幣，但在它達到7000美元時賣掉了 \"的故事。\n我們一次又一次地看到同樣的遺憾。\n\n這裏有一個解決方案。假設你想至少持有5年，但你害怕\n你的...",
      "title": "如果你害怕不長期持有，這是一個好主意"
    }
  ],
  "title": "A great idea if you’re scared of not holding long term",
  "created_utc": 1622980422,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I’ve been thinking about regrets people have had in the past, you know the stories where people say “oh I invested in Bitcoin at $1,000 but sold when it hit $7,000” we’ve seen the same regrets over and over again.</p>\n\n<p>Here’s a solution. Say you wanna hold for at least 5 years, but you’re afraid your paper hands mentality will take over and you’ll sell early, here’s what you do. </p>\n\n<p>1) invest as much as you can into BTC (or whatever coin you have faith in)</p>\n\n<p>2) You commit a crime that gets you that many years, maybe armed robbery? GTA? I dunno, DYOR with the crimes in your local area.</p>\n\n<p>Plead guilty, do the time, come out rich as fuck.</p>\n\n<p>This is financial advice, you’re welcome. </p>\n\n<p>/s</p>\n</div><!-- SC_ON -->",
  "score": 10948,
  "permalink": "/r/CryptoCurrency/comments/ntibo4/a_great_idea_if_youre_scared_of_not_holding_long/",
  "subreddit": "CryptoCurrency",
  "id": "ntibo4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404882862
}