{
  "author": "illintent99",
  "original_created_utc": 1634235301,
  "title": "Not trying to \"burst your bubble\" but some may need to read this.",
  "created_utc": 1634247640,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>When the markets pump, even a little, there&#39;s lots of talk about exotic cars, being set for life etc. I don&#39;t want anyone discouraged in anyway about Crypto, it can be a way for people to change their lives in some capacity. However it&#39;s important to be realistic with the end result. It&#39;s fun to joke about when we all get Lambos the hardest chart to decide on will be the color catalog. </p>\n\n<p>The not-so fun truth is that a vast majority of us will not be <em>rich</em>. I heard a few numbers but it seems the average person on here has $400-$600 invested. If you become exceptionally <del>successful</del> <em>lucky</em>, and your portfolio hits 100x, that 60k will not buy financial independence. However depending on where you are in world that money could help greatly, for me it would be a fairly decent down payment on a house, but that&#39;s it. </p>\n\n<p>For those who don&#39;t know, a good way to get an idea of max price, it&#39;s to fully understand &#39;market capitalization&#39; (price of coin x total supply of coin). This is why your fractions of a penny coin that &quot;just needs to hit a dollar&quot; will not do so since it would be 80x Bitcoin&#39;s current market cap.</p>\n\n<p>Don&#39;t set yourself up for disappointment,  however we can make some money and change things up in our lives. </p>\n\n<p>Best of luck.</p>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/CryptoCurrency/comments/q85env/not_trying_to_burst_your_bubble_but_some_may_need/",
  "subreddit": "CryptoCurrency",
  "id": "q85env",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "When the markets pump, even a little, there's lots of talk about exotic cars,\nbeing set for life etc. I don't want anyone discouraged in anyway about Crypto,\nit can be a way for people to change their lives in some capacity. However it's\nimportant to be realistic with the end result. It's fun to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "市場が少しでも上昇すると、エキゾチックカーの話題で持ちきりになります。\n一生安泰だとか。私は、暗号について誰もがっかりさせたくありません。\n暗号は、人々の生活を変える手段になり得ます。しかし\n最終的な結果に対して現実的であることが重要です。それは楽しいことです...",
      "title": "あなたのバブルを破裂させる」つもりはありませんが、これを読む必要がある人もいるでしょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当市场抽水时，哪怕是一点点，都会有很多关于异国情调汽车的讨论。\n被设定为终身制等等。我不希望任何人对加密货币感到气馁。\n它可以成为人们在某种程度上改变其生活的一种方式。然而，重要的是\n重要的是要对最终结果持现实态度。这很有趣，因为...",
      "title": "我不是想 \"戳破你的泡沫\"，但有些人可能需要阅读这个。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當市場抽水時，哪怕是一點點，都會有很多關於異國情調汽車的討論。\n被設定爲終身制等等。我不希望任何人對加密貨幣感到氣餒。\n它可以成爲人們在某種程度上改變其生活的一種方式。然而，重要的是\n重要的是要對最終結果持現實態度。這很有趣，因爲...",
      "title": "我不是想 \"戳破你的泡沫\"，但有些人可能需要閱讀這個。"
    }
  ]
}