{
  "author": "scvet",
  "original_created_utc": 1630301205,
  "title": "What type of clothing or protection did Vikings use when crossing the frigid seas?",
  "created_utc": 1630334490,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A question came up between my friends and I. How did Vikings manage to cross such frigid seas in such exposed conditions? I stated that they must’ve used multiple layers or some kind of protection(wood panels or something to block the air and water) from the wind and sea. But my friend questions how effective clothing could be once it got exposed to the frigid seas in the Northern hemisphere where the Vikings roamed. As well as how much protection they could’ve realistically had on their boats based on all the pictures of their boats being pretty open and exposed. So how did the Vikings fight the elements at sea?</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/pebqlr/what_type_of_clothing_or_protection_did_vikings/",
  "subreddit": "AskHistorians",
  "id": "pebqlr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "A question came up between my friends and I. How did Vikings manage to cross\nsuch frigid seas in such exposed conditions? I stated that they must’ve used\nmultiple layers or some kind of protection(wood panels or something to block the\nair and water) from the wind and sea. But my friend questions how…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ヴァイキングはどうやってあの極寒の海を渡ったのだろう？\n厳寒の海をどうやって渡ったんだろう？私は、「きっと何重にも重ねていたんだろうね。\n風や海から守るために、何重にも重ねたり、何かの保護具（木の板とか）を使って\n風や海から何重にも保護していたに違いないと言いました。しかし、私の友人はどのようにして...",
      "title": "ヴァイキングは極寒の海を渡るとき、どのような衣服や保護具を使っていたのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我和我的朋友之间出现了一个问题：维京人是如何跨越\n在如此恶劣的条件下穿越如此寒冷的海面？我说，他们一定使用了\n多层或某种保护措施（木板或其他东西来阻挡风和水\n空气和水）来抵御风和海。但我的朋友质疑，如何...",
      "title": "维京人在穿越冰冷的海洋时使用什么类型的衣服或保护措施？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我和我的朋友之間出現了一個問題：維京人是如何跨越\n在如此惡劣的條件下穿越如此寒冷的海面？我說，他們一定使用了\n多層或某種保護措施（木板或其他東西來阻擋風和水\n空氣和水）來抵禦風和海。但我的朋友質疑，如何...",
      "title": "維京人在穿越冰冷的海洋時使用什麼類型的衣服或保護措施？"
    }
  ]
}