{
  "author": "inevitable_username",
  "original_created_utc": 1634591459,
  "title": "They say you need $100k to start with to become a millionaire through crypto... I strongly disagree",
  "created_utc": 1634608351,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There&#39;s this opinion going around that you need to invest a lot to begin with to get significant returns, that at the current state of the market it&#39;s unlikely for BTC to go 100x up and so on...</p>\n\n<p><strong>No, your $100 abdolutely won&#39;t magically grow four more zeros and of course you need 100k to get to $1,000,000...</strong></p>\n\n<p>BUT who said you can&#39;t make 100k through crypto? </p>\n\n<p>Someone may object - $100k from $100? That&#39;s still super unrealistic!</p>\n\n<p>No, not from $100, from $50k.</p>\n\n<p>Someone may ask — And where&#39;s the $50k coming from?</p>\n\n<p>From $10k you earned through crypto.</p>\n\n<ul>\n<li>But $10k is still a long way to go from $100!</li>\n</ul>\n\n<p>Not from $100, from 200, then from 500 then from 1k...</p>\n\n<p><strong>My point is there are plenty of money-making opportunities in crypto. They are literally all over the place.</strong></p>\n\n<p>There are crashes to buy into every once in a while, parabolic runs, alt seasons, airdrops, emerging projects, anticipated updates of old projects, halvings, rumor/news situations, and so on and so forth...</p>\n\n<p>If you play your cards right and avoid doing major mistakes, you can get closer and closer to a 10x away from your life-changing money, then to a 5x away, then to a 2x away...</p>\n\n<p>Crypto IS life-changing money. If you&#39;re here, you&#39;re already ahead of the curve!</p>\n</div><!-- SC_ON -->",
  "score": 196,
  "permalink": "/r/CryptoCurrency/comments/qaw1kw/they_say_you_need_100k_to_start_with_to_become_a/",
  "subreddit": "CryptoCurrency",
  "id": "qaw1kw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "There's this opinion going around that you need to invest a lot to begin with to\nget significant returns, that at the current state of the market it's unlikely\nfor BTC to go 100x up and so on...\n\nNo, your $100 abdolutely won't magically grow four more zeros and of course you\nneed 100k to get to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "大きなリターンを得るためには、最初に多くの投資をしなければならないという意見があります。\n大きなリターンを得るためには、最初に多くの投資をしなければならないという意見や、現在の市場の状態では\n現在の市場でBTCが100倍になることはないだろうという意見がありますが...。\n\nいや、100ドルの絶対額が魔法のようにゼロを4つ増やすことはないし、もちろん10万円は必要です。\nもちろん、10万円は必要ですが・・・。",
      "title": "暗号で億万長者になるには、最初に10万ドル必要だと言われていますが...。私はそうは思いません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有一种观点认为，你需要在一开始就进行大量的投资才能获得可观的回报。\n获得可观的回报，在目前的市场状况下，BTC不太可能上涨100倍等等。\nBTC不可能上涨100倍等等......\n\n不，你的100美元绝对不会神奇地再长出4个零，当然你需要10万美元才能达到\n需要10万才能达到...",
      "title": "他们说你需要10万美元开始，才能通过加密货币成为百万富翁...... 我坚决不同意"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有一種觀點認爲，你需要在一開始就進行大量的投資才能獲得可觀的回報。\n獲得可觀的回報，在目前的市場狀況下，BTC不太可能上漲100倍等等。\nBTC不可能上漲100倍等等......\n\n不，你的100美元絕對不會神奇地再長出4個零，當然你需要10萬美元才能達到\n需要10萬才能達到...",
      "title": "他們說你需要10萬美元開始，才能通過加密貨幣成爲百萬富翁...... 我堅決不同意"
    }
  ]
}