{
  "author": "Nostalg33k",
  "original_created_utc": 1636914047,
  "title": "What did you improve in your life thanks to crypto?",
  "created_utc": 1636921838,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Investing has unexpected benefits. I am on the verge (nice) to celebrate 4 years without smoking. (Not thanks to crypto) and I just realized Crypto already helped me change some of my behaviors. </p>\n\n<p>I spend less, save more. Also I&#39;ve started to cook more, order less food outside. I also started to write on different  platforms (not speaking of reddit) and partaking in group projects. </p>\n\n<p>I also stopped playing with my money through Lotto and Casinos. </p>\n\n<p>I try to plan my monthly finance and despite being the smallest earner of my group I&#39;m now the one who can help a bit others. </p>\n\n<p>I started to repay a debt I had to a friend. </p>\n\n<p>Honestly, I feel like crypto investing paid its dividends through all of these and the ROI is for me incredible.   </p>\n\n<p>What did crypto improve in your life ?</p>\n</div><!-- SC_ON -->",
  "score": 169,
  "permalink": "/r/CryptoCurrency/comments/qtvur7/what_did_you_improve_in_your_life_thanks_to_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "qtvur7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Investing has unexpected benefits. I am on the verge (nice) to celebrate 4 years\nwithout smoking. (Not thanks to crypto) and I just realized Crypto already\nhelped me change some of my behaviors.\n\nI spend less, save more. Also I've started to cook more, order less food\noutside. I also started to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "投資には思わぬメリットがある。禁煙4年目を迎えようとしています（笑）。\nタバコを吸わずに4年を迎えようとしています。(暗号のおかげではありませんが)そして、暗号がすでに私の行動を変えてくれたことに気づきました。\n自分の行動の一部を変えるのに役立ちました。\n\n支出を減らし、貯蓄を増やしました。また、もっと料理をするようになり、外食を減らすようになりました。\n外出もしています。また、私は...",
      "title": "暗号のおかげで生活に何か変化がありましたか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "投资有意想不到的好处。我即将（很好地）庆祝4年来的\n不抽烟。(不是因为加密货币），我刚刚意识到加密货币已经\n帮助我改变了我的一些行为。\n\n我花得少，存得多。我也开始多做饭，少在外面点菜。\n在外面。我也开始...",
      "title": "由于加密货币的出现，你的生活有什么改善？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "投資有意想不到的好處。我即將（很好地）慶祝4年來的\n不抽菸。(不是因爲加密貨幣），我剛剛意識到加密貨幣已經\n幫助我改變了我的一些行爲。\n\n我花得少，存得多。我也開始多做飯，少在外面點菜。\n在外面。我也開始...",
      "title": "由於加密貨幣的出現，你的生活有什麼改善？"
    }
  ]
}