{
  "author": "Prestigious-Try-4363",
  "the_new_excerpt": "I'm a little confused about why the big short investor Michael Burry was visited\nby the SEC. When going over his archive of tweets he rails against tesla,\nrobinhood and warns of a bubble in the market; what I don't understand is why he\nwould be visited by the SEC for expressing his opinion on…",
  "original_created_utc": 1622407671,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "大口のショート投資家であるMichael Burry氏が、なぜSECの訪問を受けたのか、少し困惑しています。\nSECの訪問を受けたのはなぜか？彼のツイートのアーカイブを見てみると、彼はテスラやロビンフッドを非難し、市場のバブルを警告しています。\nロビンフッドを非難し、市場のバブル化を警告していますが、私が理解できないのは、なぜ彼が自分の意見を述べただけでSECの訪問を受けるのかということです。\n私が理解できないのは、なぜ彼が自分の意見を述べただけでSECの訪問を受けたのかということです...",
      "title": "The Big Short」の投資家であるMichael Burry氏がSECの訪問を受け、その後twitterの削除を余儀なくされた理由についての意見"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我有点困惑，为什么大空头投资者Michael Burry会被美国证券交易委员会访问？\n被美国证券交易委员会访问。在翻阅他的推文档案时，他抨击特斯拉。\n我不明白的是，为什么他会因为表达自己的观点而被美国证券交易委员会访问？\n我不明白的是，为什么他因为表达了自己的观点而被美国证券交易委员会访问？",
      "title": "关于 \"大空头 \"投资者迈克尔-伯利被美国证券交易委员会访问并随后被迫关闭其微博的原因的意见"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我有點困惑，爲什麼大空頭投資者Michael Burry會被美國證券交易委員會訪問？\n被美國證券交易委員會訪問。在翻閱他的推文檔案時，他抨擊特斯拉。\n我不明白的是，爲什麼他會因爲表達自己的觀點而被美國證券交易委員會訪問？\n我不明白的是，爲什麼他因爲表達了自己的觀點而被美國證券交易委員會訪問？",
      "title": "關於 \"大空頭 \"投資者邁克爾-伯利被美國證券交易委員會訪問並隨後被迫關閉其微博的原因的意見"
    }
  ],
  "title": "Opinions on why \"The Big Short\" investor Michael Burry was visited by the SEC and subsequently forced to take down his twitter",
  "created_utc": 1622457181,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m a little confused about why the big short investor Michael Burry was visited by the SEC. When going over his archive of tweets he rails against tesla, robinhood and warns of a bubble in the market; what I don&#39;t understand is why he would be visited by the SEC for expressing his opinion on twitter. </p>\n\n<p>Isn&#39;t this literally what the pundits on CNBC do all day? All I ever hear on that channel is &quot;Buy, Buy, Buy,&quot; whereas Burry&#39;s tweets have substance behind them. For example, he warned about inflation in February and as of April 2021 it has begun to hit the markets. Also, when does someone become to big to express their opinion about the market?</p>\n</div><!-- SC_ON -->",
  "score": 1761,
  "permalink": "/r/wallstreetbets/comments/nok7pa/opinions_on_why_the_big_short_investor_michael/",
  "subreddit": "wallstreetbets",
  "id": "nok7pa",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804304074
}