{
  "author": "misterflyyy",
  "the_new_excerpt": "I just wanna briefly start this off by saying the crypto community on Reddit has\nbeen one of the nicest communities on this website I’ve ever seen!\n\nI first got into crypto back in 2016 selling fakes in high school, i amassed a\ndecent amount of crypto but didn’t realize it’s capabilities of truly…",
  "original_created_utc": 1613585558,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我只想简单的先说一下Reddit上的加密社区已经...\n一直是这个网站上我见过的最棒的社区之一!\n\n我第一次接触加密技术是在2016年，在高中时卖假货，我积累了一\n像样的加密量，但没有意识到它的能力，真正... ...",
      "title": "我撞到了我的月亮！"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我只想簡單的先說一下Reddit上的加密社區已經...\n一直是這個網站上我見過的最棒的社區之一!\n\n我第一次接觸加密技術是在2016年，在高中時賣假貨，我積累了一\n像樣的加密量，但沒有意識到它的能力，真正... ...",
      "title": "我撞到了我的月亮！"
    }
  ],
  "title": "I hit my moon!!",
  "created_utc": 1613608247,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I just wanna briefly start this off by saying the crypto community on Reddit has been one of the nicest communities on this website I’ve ever seen!</p>\n\n<p>I first got into crypto back in 2016 selling fakes in high school, i amassed a decent amount of crypto but didn’t realize it’s capabilities of truly changing someone’s life by just HODLing…I spent about 50% of my btc at that time on weed (i ended up selling about 80%) and slowly forgot about the remaining Bitcoin I had. </p>\n\n<p>Fast forward to 2017 the market boom is happening and I see Bitcoin at a price I hadn’t yet seen it at (around 7k) I take my emergency savings and say “I won’t miss out on this market boom and invest enough to basically double my Bitcoin portfolio (even though I had completely forgotten about my 2016 purchases) When it reached the former ATH I bought all the moon hype and didn’t plan on selling for a long long time. </p>\n\n<p>Covid hits in March of last year and everything everywhere in the world completely tanks…I was so tempted to sell and just settle for my loss. Turns out I was deemed an essential worker and was able to keep my job while the market was in complete fluctuations. Bitcoin was around 5k and this other crypto I was researching called ethereum was around ~100 something dollars, I saw it’s ath was over $1000 and thought to myself “wow if I could make a 10x return on an investment I would be able to buy a new car and really begin to be comfortable with my place economically. So I throw money at the wall and it sticks. </p>\n\n<p>Around October or so I have a dream about all the Bitcoin I had in my high school days and wake up in a cold sweat. For the next couple days I try every password and recovery email I could remember and I eventually get my localcoinbase account login. I was SO EXCITED, I had just hit the lottery in my mind and nothing could tell me otherwise. I transfer funds so everything is on one wallet and just literally stare at my money, the most I’ve ever seen as a college dropout working meaningless slightly above state minimum wage jobs…I was literally jumping with joy!!!</p>\n\n<p>Now with Bitcoin over 50k and ethereum pushing close to 2k I can officially say I never dreamed of this moment before. I always had this creeping thought in the back of my mind that I would never “make it” and would settle for a life that I never wanted…GUYS don’t believe that what you’re doing is wrong. I love the projects that these cryptos bring, I hope one day crypto is as mainstream as Netflix and google is. I don’t see that future not coming to fruition..I just can’t pass up this life changing money any longer. </p>\n\n<p>I never posted that much or talked that much but I genuinely hope everyone here reaches their moon &lt;3</p>\n</div><!-- SC_ON -->",
  "score": 270,
  "permalink": "/r/CryptoCurrency/comments/lm0s1m/i_hit_my_moon/",
  "subreddit": "CryptoCurrency",
  "id": "lm0s1m",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728620222
}