{
  "author": "Ghost_Lagoon",
  "original_created_utc": 1644622263,
  "title": "People call this dip Russian FUD and it's fucking disgusting",
  "created_utc": 1644626037,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a little drunk rn but I&amp;#39;m pissed off and have to get this off my chest. \nI&amp;#39;ve seen so many comments about the Russian / Ukraine conflict. People brush it off as FUD, some even asked for Russia to &amp;quot;just fucking do it&amp;quot; so we can get over with it already. Seriously what the FUCK is wrong with people like you? Wishing for a country to be invaded by one of the most powerful forces in the world just so your favorite shitcoin can start to go up in value again? Be glad you are not on the edge of a war. People in this space have no ethics and are just as bad as your average banker investing in the war industry. I thought embracing authoritarian quasi-dictators like Bukele and Erdogan is bad enough but this crap takes it to a whole new level. Fuck everybody who thinks that way. Rethink your values.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 630,
  "permalink": "/r/CryptoCurrency/comments/sqcw3a/people_call_this_dip_russian_fud_and_its_fucking/",
  "subreddit": "CryptoCurrency",
  "id": "sqcw3a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm a little drunk rn but I'm pissed off and have to get this off my chest. I've\nseen so many comments about the Russian / Ukraine conflict. People brush it off\nas FUD, some even asked for Russia to \"just fucking do it\" so we can get over\nwith it already. Seriously what the FUCK is wrong with…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今は少し酔っているが、腹が立っているので、この場をお借りして。私は\nロシアとウクライナの紛争について、多くのコメントを目にしました。人々はそれを払いのけ\nをFUDと呼ぶ人もいれば、ロシアに「さっさとやれ」と言う人さえいる。\nを、もういい加減にしろ。マジでどうしたんだよ...。",
      "title": "このディップをロシアのFUDと呼ぶ人がいるが、クソむかつく。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我现在有点醉了，但我很生气，必须要把这件事说出来。我已经\n我看到很多关于俄罗斯/乌克兰冲突的评论。人们把它当作\n有些人甚至要求俄罗斯 \"就他妈这么干\"，这样我们就可以结束了\n就可以结束了。说真的，这他妈是怎么回事......",
      "title": "人们称这种浸泡为俄罗斯的FUD，这真他妈的令人厌恶"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我現在有點醉了，但我很生氣，必須要把這件事說出來。我已經\n我看到很多關於俄羅斯/烏克蘭衝突的評論。人們把它當作\n有些人甚至要求俄羅斯 \"就他媽這麼幹\"，這樣我們就可以結束了\n就可以結束了。說真的，這他媽是怎麼回事......",
      "title": "人們稱這種浸泡爲俄羅斯的FUD，這真他媽的令人厭惡"
    }
  ]
}