{
  "author": "ThrowawayRA9294",
  "original_created_utc": 1631776581,
  "title": "Is it bad to take money from a guy online?",
  "created_utc": 1631782804,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So a few months ago I did a dumb Insta story asking for money, almost as a joke, but a guy replied and he actually gave me money for what I needed. Since then I’ll tell him what I want to do and he’ll just give me money for it. </p>\n\n<p>He’s into something called ‘financial domination’ and apparently it’s weirdly common. He introduced me to a group and now I’ve got like 5 of these guys? I’ve paid off my car, refurnished my entire house and going on holiday and they’ve paid for it all. </p>\n\n<p>And all they want is for me to like be annoyed at them? Like idk if it’s even sexual I’m just being an asshole to them. So idk my friends are conflicted about it and so am I because they’re practically begging to give away their money and I’m just taking it. Is that bad? Should I let them go to like a professional dominatrix or just keep going?</p>\n</div><!-- SC_ON -->",
  "score": 123,
  "permalink": "/r/TooAfraidToAsk/comments/pp8hob/is_it_bad_to_take_money_from_a_guy_online/",
  "subreddit": "TooAfraidToAsk",
  "id": "pp8hob",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So a few months ago I did a dumb Insta story asking for money, almost as a joke,\nbut a guy replied and he actually gave me money for what I needed. Since then\nI’ll tell him what I want to do and he’ll just give me money for it.\n\nHe’s into something called ‘financial domination’ and apparently it’s…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "数ヶ月前、私はインスタのストーリーで「お金を貸してください」と、ほとんど冗談のように言っていました。\nすると、ある男性が返信してくれて、必要な分のお金を実際に渡してくれたんです。それ以来\n私が何をしたいかを彼に伝えると、彼はそのためのお金をくれます。\n\n彼は「経済的支配」と呼ばれるものに夢中で、どうやらそれは...",
      "title": "ネットで男から金を取るのは悪いことなのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，几个月前，我做了一个愚蠢的Insta故事，几乎是作为一个笑话来要求钱。\n但一个人回复了我，他真的给了我所需的钱。从那以后\n我告诉他我想做什么，他就会直接给我钱。\n\n他喜欢一种叫做 \"财务支配 \"的东西，显然，这是...",
      "title": "在网上接受一个人的钱是坏事吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，幾個月前，我做了一個愚蠢的Insta故事，幾乎是作爲一個笑話來要求錢。\n但一個人回覆了我，他真的給了我所需的錢。從那以後\n我告訴他我想做什麼，他就會直接給我錢。\n\n他喜歡一種叫做 \"財務支配 \"的東西，顯然，這是...",
      "title": "在網上接受一個人的錢是壞事嗎？"
    }
  ]
}