{
  "author": "moneytobemade8",
  "the_new_excerpt": "Since the March lows, it seems a lot of the stocks have gone up +100% in one\nyear which is very abnormal and does not happen in \"regular\" years. We have seen\nthis, especially in the tech sector. We have seen a bit of a pull back in the\ntech sector with stocks going down 10- 20% or more since…",
  "original_created_utc": 1620342493,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "3月の安値以降、多くの銘柄が1年で100％の上昇をしているようです。\nこれは非常に異常なことであり、「通常の」年には起こりえないことです。私たちはこれを\nこれは非常に異常なことであり、通常の年には起こりえないことです。特にハイテク部門で見られました。ハイテク部門では、株価が10～10％下落し、少し後退しています。\n技術部門では、10～20％以上の下落が見られましたが...",
      "title": "市場は予測不可能であり、株が下がるのは普通のこと"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "自3月的低点以来，似乎很多股票在一年内上涨了+100%。\n这是很不正常的，在 \"正常 \"年份不会发生。我们已经看到\n这一点，尤其是在科技领域。我们已经看到了科技行业的回调，股票下跌了10-15%。\n科技行业出现了一些回调，股票下跌了10-20%或更多，自...",
      "title": "市场是不可预测的，股票下跌是正常的"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "自3月的低點以來，似乎很多股票在一年內上漲了+100%。\n這是很不正常的，在 \"正常 \"年份不會發生。我們已經看到\n這一點，尤其是在科技領域。我們已經看到了科技行業的回調，股票下跌了10-15%。\n科技行業出現了一些回調，股票下跌了10-20%或更多，自...",
      "title": "市場是不可預測的，股票下跌是正常的"
    }
  ],
  "title": "The Market Is Unpredictable And Stocks Going Down Is Normal",
  "created_utc": 1620354759,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Since the March lows, it seems a lot of the stocks have gone up +100% in one year which is very abnormal and does not happen in &quot;regular&quot; years. We have seen this, especially in the tech sector. We have seen a bit of a pull back in the tech sector with stocks going down 10- 20% or more since February. </p>\n\n<p>You must remember that if a stock goes up 100% and falls by 20% that is still a great return if you got in early. However, if you FOMO&#39;d in many cases or bought into the hype, you must understand that this can happen. The market is unpredictable right now and it&#39;s important to invest in stocks that you believe are good and not look for a quick book if you are worried about losing money.</p>\n\n<p>Stocks don&#39;t go up forever and in many cases, they may fall because the stock is going back to its &quot;fundamentals&quot;.</p>\n</div><!-- SC_ON -->",
  "score": 299,
  "permalink": "/r/stocks/comments/n6keio/the_market_is_unpredictable_and_stocks_going_down/",
  "subreddit": "stocks",
  "id": "n6keio",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985995611
}