{
  "author": "Jeffery95",
  "original_created_utc": 1656661035,
  "title": "Ancient civilisations were built on river floodplains, because of the soil quality. Why didnt the incredibly fertile lands north of the black sea ever become a center of ancient civilisation?",
  "created_utc": 1656686431,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;All great ancient civilisations were centered on river flood plains. India on the Indus and Ganges, China on the Yellow and Yangtze, Egypt on the Nile and Mesopotamia on the Tigris and Euphrates. The yearly flooding would irrigate the land and make it very fertile.  &lt;/p&gt;\n\n&lt;p&gt;According to this global survey i&amp;#39;ve linked below, the land north of the black sea is both high performing and high resilience. Similar characteristics are true of the American plains in the central United States and Argentina.&lt;br/&gt;\nModern day Ukraine is a huge grain producer due to this soil quality. Why didnt the region ever manifest an ancient culture similar to mesopotamia, india, egypt or china?  &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.nrcs.usda.gov/wps/portal/nrcs/detail/soils/use/worldsoils/?cid=nrcs142p2_054011\"&gt;https://www.nrcs.usda.gov/wps/portal/nrcs/detail/soils/use/worldsoils/?cid=nrcs142p2_054011&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 121,
  "permalink": "/r/AskHistorians/comments/vov2qp/ancient_civilisations_were_built_on_river/",
  "subreddit": "AskHistorians",
  "id": "vov2qp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "All great ancient civilisations were centered on river flood plains. India on\nthe Indus and Ganges, China on the Yellow and Yangtze, Egypt on the Nile and\nMesopotamia on the Tigris and Euphrates. The yearly flooding would irrigate the\nland and make it very fertile.\n\nAccording to this global survey…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "古代の偉大な文明はすべて、河川の氾濫原を中心としていた。インドではインダス川とガンジス川\nインドではインダス川とガンジス川が、中国では黄河と長江が、エジプトではナイル川が、そして\nメソポタミアはチグリス川とユーフラテス川である。毎年氾濫する水によって、土地は灌漑され\n灌漑が行われ、肥沃な土地となった。\n\nこの世界的な調査によると...",
      "title": "古代の文明が河川の氾濫原に築かれたのは、その土壌の良さが理由だった。なぜ黒海の北側の肥沃な土地は古代文明の中心地とならなかったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所有伟大的古代文明都以河流冲积平原为中心。印度\n印度的印度河和恒河，中国的黄河和长江，埃及的尼罗河，美索不达米亚的底格里斯河和幼发拉底河。\n美索不达米亚在底格里斯河和幼发拉底河上。每年的洪水都会灌溉土地，使其非常肥沃。\n土地，使其变得非常肥沃。\n\n根据这项全球调查...",
      "title": "由于土壤质量好，古代文明都建立在河流泛滥区。为什么黑海以北无比肥沃的土地没有成为古代文明的中心？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所有偉大的古代文明都以河流沖積平原爲中心。印度\n印度的印度河和恆河，中國的黃河和長江，埃及的尼羅河，美索不達米亞的底格里斯河和幼發拉底河。\n美索不達米亞在底格里斯河和幼發拉底河上。每年的洪水都會灌溉土地，使其非常肥沃。\n土地，使其變得非常肥沃。\n\n根據這項全球調查...",
      "title": "由於土壤質量好，古代文明都建立在河流泛濫區。爲什麼黑海以北無比肥沃的土地沒有成爲古代文明的中心？"
    }
  ]
}