{
  "author": "gigabyteIO",
  "original_created_utc": 1659212414,
  "title": "Zero downtime, no forking, 4.4 second deterministic finality, 26M addresses, 1.4k+ nodes, carbon negative, $0.0004 transaction fees, post quantum secure. FIFA Technical partner, Nigeria Partner, El Salvador Partner, Central Bank of Italy Partner, ISDA Member, ISO20022 Compliant. Algorand is grand.",
  "created_utc": 1659236834,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Algorand Metrics:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://metrics.Algorand.org\"&gt;metrics.Algorand.org&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Algorand&amp;#39;s unique and novel 1/1 blockchain design called Pure-Proof of Stake(PPoS) allows for decentralization, scalability, and security.&lt;/p&gt;\n\n&lt;p&gt;Here is a break down of what exactly Pure Proof of Stake is and why it is unique:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/dx1ea20cire91.jpg?width=680&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=395b52cbfa4f77534ad7a6ccc8b4d5a06a51fe46\"&gt;https://preview.redd.it/dx1ea20cire91.jpg?width=680&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=395b52cbfa4f77534ad7a6ccc8b4d5a06a51fe46&lt;/a&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Block Proposal:&lt;/strong&gt; Accounts propose new blocks to the network&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Soft Vote:&lt;/strong&gt; Committee votes on proposals and filters down to one&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Certify Vote:&lt;/strong&gt; Separate committee votes to certify the block&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Each node receives a certificate for the block and writes it to the ledger&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;New round is initiated and process starts over with new block proposers and voters&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;The Algorand blockchain uses a decentralized Byzantine agreement protocol based on pure proof-of-stake (PPoS). It can tolerate an arbitrary number of malicious users as long as honest users (those that follow the instructions of the protocol) hold more than two-thirds of the total stake in the system. The following is a brief overview of the Algorand protocol.&lt;/p&gt;\n\n&lt;h2&gt;Protocol Participation&lt;/h2&gt;\n\n&lt;p&gt;In Algorand, every online user who possesses algos can participate in the consensus protocol. To reduce exposure, users do not use their spending keys (i.e., the keys they use to spend stake) for consensus. Instead, a user who wishes to participate in the protocol generates and registers a participation key. With this key, an account can participate in proposing and voting on blocks. Using participation keys ensures that a user&amp;#39;s algos are secure even if their participating node is compromised.&lt;/p&gt;\n\n&lt;h4&gt;Self-Selection via Verifiable Random Function&lt;/h4&gt;\n\n&lt;p&gt;Every block in Algorand reveals a new random and unpredictable selection seed that determines which users should participate in the next round of the consensus protocol. When a new block gets committed to the blockchain, everyone becomes aware of this seed (and everyone sees the same seed). A user secretly checks whether they were selected to participate by evaluating a Verifiable Random Function (VRF) with their secret participation key and the selection seed. This computation is minimal, so even a limited device such as a Raspberry Pi can do it. The VRF computation produces a pseudorandom output with a cryptographic proof that anyone can use to verify the result. By sending this proof, a user can prove to anyone that they were indeed selected to participate.&lt;/p&gt;\n\n&lt;h4&gt;Pure Proof-of-Stake&lt;/h4&gt;\n\n&lt;p&gt;What makes this protocol pure proof-of-stake is the fact that users are chosen to participate in the protocol based on the stake (number of algos) that they have. The VRF behaves similarly to a weighted lottery; it is as if every algo in an account gets its own lottery ticket. The more algos in an online account, the better chance the account has of being selected to participate.&lt;/p&gt;\n\n&lt;h4&gt;User Replaceability&lt;/h4&gt;\n\n&lt;p&gt;The selection of users to participate in the certification of blocks using the VRF is done randomly and secretly, without any communication among the users. Since executing this procedure requires a user’s private key, no one except for that user knows whether they were selected. An adversary does not know who matters in generating the next block (and thus should be targeted) until after a selected user participates in the consensus protocol. And by the time an adversary realizes that a user is selected, it is too late for them to benefit from an attack; the user has already sent their message and fulfilled their responsibility in the consensus protocol. Furthermore, for each step of the protocol a unique subset of participants is randomly and privately selected, independent of earlier subsets.&lt;/p&gt;\n\n&lt;h4&gt;Achieving Consensus&lt;/h4&gt;\n\n&lt;p&gt;Consensus refers to the way blocks are selected and written to the blockchain. Algorand uses the VRF described above to select accounts to propose blocks for a given round. When a block is proposed to the blockchain, a committee of voters is selected to vote on the block proposal. If a super majority of the votes are from honest participants, the block can be certified.&lt;/p&gt;\n\n&lt;p&gt;Consensus requires three steps to propose, confirm, and write a block to the blockchain: 1) propose, 2) soft vote, and 3) certify vote. Each is described below, assuming the ideal case when there are no malicious users and the network is not partitioned (i.e., none of the network is down due to technical issues or from DoS attacks).&lt;/p&gt;\n\n&lt;h4&gt;Block Proposal&lt;/h4&gt;\n\n&lt;p&gt;In the block proposal step, accounts are selected to propose new blocks to the network. This phase starts with every node in the network looping through each of the accounts that it manages and, for each account that is online and participating, running Algorand’s VRF to determine if the account is selected to propose the block. Once an account is selected, each node propagates its proposed block along with the VRF output, which proves that the account is a valid proposer. Each node in the network will get block proposals from other nodes, and then validate the VRF output for these proposals.&lt;/p&gt;\n\n&lt;h4&gt;Soft Vote&lt;/h4&gt;\n\n&lt;p&gt;Next, each node will run the VRF for every participating account it manages to see if they have been chosen to participate in the soft vote committee. If an account is chosen, it will have a weighted vote based on the number of algos it has. Each account chosen will filter the proposals down to one by voting to confirm the block. These votes will be for the lowest VRF block proposal calculated at the timeout and will be sent out to the other nodes along with the VRF proof. Each node will validate the committee membership VRF proof before adding to the vote tally. Once a quorum is reached for the soft vote, the process moves to the certify vote step.&lt;/p&gt;\n\n&lt;h4&gt;Certify Vote&lt;/h4&gt;\n\n&lt;p&gt;A new committee is then selected to check the block proposal that was voted on in the soft vote phase for overspending, double-spending, or any other problems. If valid, the committee votes again to certify the block. This is done in a similar manner to the soft vote where each node iterates through its managed accounts to select a committee and to send votes. These votes are collected and validated by each node until a quorum is reached, triggering an end to the round and prompting the node to create a certificate for the block and write it to the ledger. At that point, a new round is initiated and the process starts over.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/oteo2v9iire91.jpg?width=1282&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=9f54b0c63e767bb05c72b4a7f9d93cfc047a1eff\"&gt;https://preview.redd.it/oteo2v9iire91.jpg?width=1282&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=9f54b0c63e767bb05c72b4a7f9d93cfc047a1eff&lt;/a&gt;&lt;/p&gt;\n\n&lt;h1&gt;People tend to unfairly criticize Algorand&amp;#39;s tokenomics so here is an exact break down:&lt;/h1&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;10 Billion MAX SUPPLY (There will never be more).&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;7 Billion ALREADY IN CIRCULATION (70% are already owned).&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;3 Billion left to be released, the only way to obtain them is via Governance until 2030.&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Yearly inflation is around 3.7% until 2030, when Algorand will become deflationary.&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Links:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;a href=\"https://www.algorand.foundation/general-faq\"&gt;Algo Supply&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;&lt;a href=\"https://www.algorand.foundation/tokenomics\"&gt;Tokenomics&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;&lt;a href=\"https://www.algorand.foundation/transparency\"&gt;Transparency Reports&lt;/a&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re interested in participating in Governance, the next period sign up opens October 1st:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://algorand.foundation/governance\"&gt;algorand.foundation/governance&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 355,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/m_qrHOzKpuuWo76HeWpBSCMYFo-qK6A4E0x1NzSNw5w.jpg?auto=webp&amp;s=085743db52f9206c9956d1ed8fb379c5b213a545",
          "width": 1200,
          "height": 630
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/m_qrHOzKpuuWo76HeWpBSCMYFo-qK6A4E0x1NzSNw5w.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=a17dd4f9b84ae52df77cbce0e74ff067711401cf",
            "width": 108,
            "height": 56
          },
          {
            "url": "https://external-preview.redd.it/m_qrHOzKpuuWo76HeWpBSCMYFo-qK6A4E0x1NzSNw5w.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=a7298e8d62dd47c3b6b18e9e3a37d14af88ffb43",
            "width": 216,
            "height": 113
          },
          {
            "url": "https://external-preview.redd.it/m_qrHOzKpuuWo76HeWpBSCMYFo-qK6A4E0x1NzSNw5w.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=a85a44956597ea6dfae29d79ca0d6ca18885f035",
            "width": 320,
            "height": 168
          },
          {
            "url": "https://external-preview.redd.it/m_qrHOzKpuuWo76HeWpBSCMYFo-qK6A4E0x1NzSNw5w.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=705ad14b7f2835e0a83214322cc582d662dbd35d",
            "width": 640,
            "height": 336
          },
          {
            "url": "https://external-preview.redd.it/m_qrHOzKpuuWo76HeWpBSCMYFo-qK6A4E0x1NzSNw5w.jpg?width=960&amp;crop=smart&amp;auto=webp&amp;s=3f38c1813b7a13f1a8f1f7a3a98c8c9d0464e534",
            "width": 960,
            "height": 504
          },
          {
            "url": "https://external-preview.redd.it/m_qrHOzKpuuWo76HeWpBSCMYFo-qK6A4E0x1NzSNw5w.jpg?width=1080&amp;crop=smart&amp;auto=webp&amp;s=603643c424cdd2b92bd28a3882a4cb7d5cf94a9b",
            "width": 1080,
            "height": 567
          }
        ],
        "variants": {},
        "id": "PiCn6kfJ96_egh1RgelB-aBfiQuO_YznwPuOqe_ObFU"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/wc6ft2/zero_downtime_no_forking_44_second_deterministic/",
  "subreddit": "CryptoCurrency",
  "id": "wc6ft2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Algorand Metrics:\n\nmetrics.Algorand.org [https://metrics.Algorand.org]\n\nAlgorand's unique and novel 1/1 blockchain design called Pure-Proof of\nStake(PPoS) allows for decentralization, scalability, and security.\n\nHere is a break down of what exactly Pure Proof of Stake is and why it…"
}