{
  "author": "AkenHoma",
  "original_created_utc": 1631511670,
  "title": "I earned and saved more money with crypto than my full time day job by using platforms and coins that have staking rewards.",
  "created_utc": 1631522153,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Yup you heard that right. I have been working as an Admin Assistant in a company for 5 years and I earned and saved more money than my full time job. But of course this didn’t happen in just one day. Investments need to grow whether it be stocks or in crypto.</p>\n\n<p>Until I started investing in crypto, I was a terrible saver. The lessons I&#39;ve gained are invaluable in and of themselves. This is why I’m excited to invest even more in crypto. I&#39;ve already planned out everything so I know how much I can invest and what I can invest.</p>\n\n<p>Just remember that in some platforms, the higher the yield investment, the higher the volatility/risk enables them to offer high APY...That’s why there&#39;s no such thing as a safe high yield investment and a reason to diversify with other platforms.</p>\n\n<p>If you do it right though, it can easily be the greatest wealth building machine in existence and could be the door for your early retirement. And to those who play their cards right will become king.</p>\n\n<p>As always, stake safe, stake healthy, and get secured on one of the best APY offers. Cheers.</p>\n</div><!-- SC_ON -->",
  "score": 347,
  "permalink": "/r/CryptoCurrency/comments/pn9dek/i_earned_and_saved_more_money_with_crypto_than_my/",
  "subreddit": "CryptoCurrency",
  "id": "pn9dek",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Yup you heard that right. I have been working as an Admin Assistant in a company\nfor 5 years and I earned and saved more money than my full time job. But of\ncourse this didn’t happen in just one day. Investments need to grow whether it\nbe stocks or in crypto.\n\nUntil I started investing in crypto, I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "はい、その通りです。私は、ある会社でアドミン・アシスタントとして5年間働いてきました。\n5年間、フルタイムの仕事よりも多くのお金を稼ぎ、貯めてきました。しかし、もちろん\nもちろん、これは1日で実現したことではありません。株でも暗号でも、投資には成長が必要です。\n株であれ、暗号であれ、投資には成長が必要です。\n\n暗号への投資を始めるまで、私は...",
      "title": "私は、ステーキング報酬のあるプラットフォームやコインを使うことで、フルタイムの昼間の仕事よりも多くのお金をcryptoで稼ぎ、貯めました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "是的，你没听错。我在一家公司担任行政助理已经5年了。\n5年了，我赚的钱和存的钱都比我的全职工作多。但当然\n当然，这不是在一天之内发生的。投资需要增长，无论它是\n是股票还是加密货币。\n\n在我开始投资加密货币之前，我...",
      "title": "通过使用有赌注奖励的平台和硬币，我用加密货币赚的钱和存的钱比我白天的全职工作还多。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "是的，你沒聽錯。我在一家公司擔任行政助理已經5年了。\n5年了，我賺的錢和存的錢都比我的全職工作多。但當然\n當然，這不是在一天之內發生的。投資需要增長，無論它是\n是股票還是加密貨幣。\n\n在我開始投資加密貨幣之前，我...",
      "title": "通過使用有賭注獎勵的平臺和硬幣，我用加密貨幣賺的錢和存的錢比我白天的全職工作還多。"
    }
  ]
}