{
  "author": "AskScienceModerator",
  "original_created_utc": 1652353216,
  "title": "AskScience AMA Series: We're Event Horizon Telescope scientists with groundbreaking results on our own galaxy. Ask Us Anything!",
  "created_utc": 1652361062,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Three  years ago, we revealed the first image of a black hole. Today, we announce groundbreaking results on the center of our galaxy.&lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;ll be answering questions from 1:30-3:30 PM Eastern Time (17:30-19:30 UTC)!&lt;/p&gt;\n\n&lt;p&gt;The Event Horizon Telescope (EHT) - a planet-scale array of eleven ground-based radio telescopes forged through international collaboration - was designed to capture images of a black hole. As we continue to delve into data from past observations and pave the way for the next generation of black hole science, we wanted to answer some of your questions! You might ask us about:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Observing with a global telescope array&lt;/li&gt;\n&lt;li&gt;Black hole theory and simulations&lt;/li&gt;\n&lt;li&gt;The black hole imaging process&lt;/li&gt;\n&lt;li&gt;Technology and engineering in astronomy&lt;/li&gt;\n&lt;li&gt;International collaboration at the EHT&lt;/li&gt;\n&lt;li&gt;The next-generation Event Horizon Telescope (ngEHT)&lt;/li&gt;\n&lt;li&gt;... and our recent results!&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Our Panel Members consist of:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Michi Bauböck, Postdoctoral Research Associate at the University of Illinois Urbana-Champaign&lt;/li&gt;\n&lt;li&gt;Nicholas Conroy, Astronomy PhD Student at the University of Illinois Urbana-Champaign&lt;/li&gt;\n&lt;li&gt;Vedant Dhruv, Physics PhD Student at the University of Illinois Urbana-Champaign&lt;/li&gt;\n&lt;li&gt;Razieh Emami, Institute for Theory and Computation Fellow at the Center for Astrophysics | Harvard &amp;amp; Smithsonian&lt;/li&gt;\n&lt;li&gt;Joseph Farah, Astrophysics PhD Student at University of California, Santa Barbara&lt;/li&gt;\n&lt;li&gt;Raquel Fraga-Encinas, PhD Student at Radboud University Nijmegen, The Netherlands&lt;/li&gt;\n&lt;li&gt;Abhishek Joshi, Physics PhD Student at University of Illinois Urbana-Champaign&lt;/li&gt;\n&lt;li&gt;Jun Yi (Kevin) Koay, Support Astronomer at the Academia Sinica Institute of Astronomy and Astrophysics, Taiwan&lt;/li&gt;\n&lt;li&gt;Yutaro Kofuji, Astronomy PhD Student at the University of Tokyo and National Astronomical Observatory of Japan&lt;/li&gt;\n&lt;li&gt;Noemi La Bella,  PhD Student at Radboud University Nijmegen, The Netherlands&lt;/li&gt;\n&lt;li&gt;David Lee, Physics PhD Student at University of Illinois Urbana-Champaign&lt;/li&gt;\n&lt;li&gt;Amy Lowitz, Research Scientist at the University of Arizona&lt;/li&gt;\n&lt;li&gt;Lia Medeiros, NSF Astronomy and Astrophysics Fellow at the Institute for Advanced Study, Princeton&lt;/li&gt;\n&lt;li&gt; Wanga Mulaudzi, Astrophysics PhD Student at the Anton Pannekoek Institute for Astronomy at the University of Amsterdam&lt;/li&gt;\n&lt;li&gt;Alejandro Mus, PhD Student at the Universitat de València, Spain&lt;/li&gt;\n&lt;li&gt;Gibwa Musoke, NOVA-VIA Postdoctoral Fellow at the Anton Pannekoek Institute for Astronomy, University of Amsterdam&lt;/li&gt;\n&lt;li&gt;Ben Prather, Physics PhD Student at University of Illinois Urbana-Champaign&lt;/li&gt;\n&lt;li&gt;Jan Röder, Astrophysics PhD Student at the Max Planck Institute for Radio Astronomy in Bonn, Germany&lt;/li&gt;\n&lt;li&gt;Jesse Vos, PhD Student at Radboud University Nijmegen, The Netherlands&lt;/li&gt;\n&lt;li&gt;Michael F. Wondrak, Radboud Excellence Fellow at Radboud University Nijmegen, The Netherlands&lt;/li&gt;\n&lt;li&gt;Gunther Witzel, Staff Scientists at the Max Planck Institute for Radioastronomy, Germany&lt;/li&gt;\n&lt;li&gt;George N. Wong, Member at the Institute for Advanced Study and Associate Research Scholar in the Princeton Gravity Initiative&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;If you&amp;#39;d like to learn more about us, you can also check out our &lt;a href=\"https://eventhorizontelescope.org/\"&gt;Website&lt;/a&gt;, &lt;a href=\"https://www.facebook.com/ehtelescope/\"&gt;Facebook&lt;/a&gt;, &lt;a href=\"https://twitter.com/ehtelescope\"&gt;Twitter&lt;/a&gt;,\n&lt;a href=\"https://www.instagram.com/ehtelescope\"&gt;Instagram&lt;/a&gt;, and &lt;a href=\"https://www.youtube.com/channel/UC4sItzYomoJ6Flt0aDyHMOQ\"&gt;YouTube&lt;/a&gt;. We look forward to answering your questions!&lt;/p&gt;\n\n&lt;p&gt;Username: &lt;a href=\"/u/EHTelescope\"&gt;/u/EHTelescope&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 218,
  "permalink": "/r/askscience/comments/unyg77/askscience_ama_series_were_event_horizon/",
  "subreddit": "askscience",
  "id": "unyg77",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Three years ago, we revealed the first image of a black hole. Today, we announce\ngroundbreaking results on the center of our galaxy.\n\nWe'll be answering questions from 1:30-3:30 PM Eastern Time (17:30-19:30 UTC)!\n\nThe Event Horizon Telescope (EHT) - a planet-scale array of eleven ground-based\nradio…",
  "localize": [
    {
      "locale": "ja",
      "title": "AskScience AMAシリーズ。私たちはイベントホライズン望遠鏡の科学者であり、私たちの銀河系について画期的な結果を出しています。何でも聞いてください",
      "the_new_excerpt": "3年前、私たちは初めてブラックホールの画像を公開しました。そして今日、私たちは\n銀河の中心に関する画期的な結果を発表します。\n\n本日は、銀河系の中心に関する画期的な結果を発表します。\n\nイベント・ホライズン・テレスコープ（EHT）-11台の地上望遠鏡を惑星規模で並べたもの。\nイベント・ホライズン・テレスコープ（EHT）は、11台の地上設置型電波望遠鏡の惑星規模のアレイです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "三年前，我们揭示了第一张黑洞的图像。T",
      "title": "AskScience AMA系列。我们是地平线事件望远镜的科学家，对我们自己的星系有突破性的成果。向我们提出任何问题!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "三年前，我們揭示了第一張黑洞的圖像。T",
      "title": "AskScience AMA系列。我們是地平線事件望遠鏡的科學家，對我們自己的星系有突破性的成果。向我們提出任何問題!"
    }
  ]
}