{
  "author": "soyboymeatsworld",
  "the_new_excerpt": "I posted some of this yesterday in r/investing\n[https://www.reddit.com/r/investing/] and r/valueinvesting [/r/valueinvesting].\nSomeone suggested to post it here to get talked down off the ledge. :) What I\nlearned from those conversations yesterday was that I need a better conception\nof my risk…",
  "original_created_utc": 1621102120,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昨日、この一部をr/investingに投稿しました。\n[https://www.reddit.com/r/investing/]とr/valueinvesting[/r/valueinvesting]に投稿しました。\n誰かがここに投稿して、話を聞いてもらおうと提案しました。) 昨日の会話で学んだことは\n昨日の会話から学んだのは、私にはもっと良い概念が必要だということです。\n自分のリスクをもっとよく考える必要があるということです。",
      "title": "インデックスファンドの黒い薬を飲んでしまった人への視点やアドバイスをお願いします。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我昨天在r/investing发布了一些内容\n[https://www.reddit.com/r/investing/] 和r/valueinvesting [/r/valueinvesting]。\n有人建议把它贴在这里，让大家从窗台上谈下来。) 我\n我昨天从这些对话中学到的是，我需要对我的风险有更好的概念\n我的风险...",
      "title": "对刚刚吞下指数基金黑药丸的人的看法/建议？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我昨天在r/investing發佈了一些內容\n[https://www.reddit.com/r/investing/] 和r/valueinvesting [/r/valueinvesting]。\n有人建議把它貼在這裏，讓大家從窗臺上談下來。) 我\n我昨天從這些對話中學到的是，我需要對我的風險有更好的概念\n我的風險...",
      "title": "對剛剛吞下指數基金黑藥丸的人的看法/建議？"
    }
  ],
  "title": "Perspective/advice to someone that just swallowed the index fund black pill?",
  "created_utc": 1621107155,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I posted some of this yesterday in <a href=\"https://www.reddit.com/r/investing/\">r/investing</a> and <a href=\"/r/valueinvesting\">r/valueinvesting</a>. Someone suggested to post it here to get talked down off the ledge. :) What I learned from those conversations yesterday was that I need a better conception of my risk tolerance and a plan I have confidence in. I think that as I&#39;ve aged, my circumstances changed, and my nest-egg grew, my risk tolerance changed too but I didn&#39;t realize it was happening. </p>\n\n<p>tldr, I&#39;m having a crisis of confidence in buy-and-hold index investing strategy</p>\n\n<p><strong>Backstory:</strong></p>\n\n<p>I&#39;m 38 and live in the USA. I&#39;m employed, and I make the median national income. I want to accrue wealth over the long term. I&#39;ve been invested at Vanguard for 2 decades, over which time I&#39;ve had 13.1% returns. I don&#39;t know that I have an accurate understanding of my risk tolerance. I think generally I am very cautious. Before yesterday I was about 70% equities, 15 bonds, 15 cash. Before a January I was almost entirely in the S&amp;P. I have no debts. I&#39;m on track to retire with enough money for my lifestyle.</p>\n\n<p>I have been a buy &amp; hold index fund investor for the 20 years of my adult life. It always sort of bothered me that I didn&#39;t understand the underlying mechanisms of the markets I was investing in. At some point in the last decade I learned about the Schiller p/e index and thought &quot;hmm, this doesn&#39;t seem good...&quot; I read <em>Random Walk,</em> and I think I understood most of it.</p>\n\n<p>Most recent update is that after my sell-off freak-out a few days ago, I&#39;m sitting at 42% value stocks, 42% cash, and  16% bonds diversified across US/XUS. </p>\n\n<p><strong>The Bug Out:</strong></p>\n\n<p>Recently, I heard a Grantham interview and read some Hussman, and their gloomy prognostication really struck a chord with my natural inclination towards pessimism. They say current prices are unthethered from the underlying assets and and that this is true across all sectors of the market. My friends and the forums are full people throwing money at speculative investments (currency, SPAC, etc). My elders are telling me to blindly invest in an index fund and forget about it, because &#39;historic returns, don&#39;t miss the market&#39;s big days, it worked for them, etc.&#39;</p>\n\n<p>My armchair diagnosis is that there are a lot of people like me that are blindly investing in broad index funds that could care less about the underlying value of the assets as long as the price keeps going up. I suspect at some time in the future we&#39;ll look back and see that index funds were a craze like any other and laugh at the certainly we currently feel that these assets will return 6-8% on average until the end of time. Looking at you Vanguard (who recently told me that a &#39;normal asset allocation&#39; was 90-95% stocks...hmm). I also think we&#39;ll look back and see that the last trick the boomers played on us was propping up their asset valuations with Fed policy and leaving us to hold the bag.</p>\n\n<p>Worst of all, it doesn&#39;t seem like anyone I speak these concerns to (friends, family, investment advisors) is really taking them seriously or even hearing them. Am I turning into a flat-earther? Is the king wearing any clothes?</p>\n\n<p><strong>What Now?</strong></p>\n\n<p>I&#39;ve been told you shouldn&#39;t try to time the market, and I&#39;ve read the explainers about how I&#39;m likely to mistime by selling below the peak, buying before the trough, and missing out on gains while out of the market. Frankly, I&#39;m at a point where I don&#39;t believe in the market at all. Is not believing in the market at all the same as timing it? Why would I want to buy overpriced assets? I believe in a reversion to the mean. In this market, that means that some day in the future, the assets will cost less than they do now.</p>\n\n<p>I&#39;ve heard that market can stay irrational longer than you can stay solvent. I&#39;ve also read that by definition there is never greater certainty in the market than the day before the bubble pops.</p>\n\n<p>I&#39;m not sure I can just put all of my money in an index fund and sleep at night. I have the following questions. Have some of you had a bug-out like I&#39;m having now? Do you still believe in index funds in this current market? Why would I want to spend money on a fund with a p/e of 90 or a value fund with a p/e of 25? Isn&#39;t that a growth p/e, even if it&#39;s better by comparison?</p>\n\n<p>Lastly, for this forum in particular, I think Vanguard&#39;s risk calculator is garbage. I just plugged in my answers and it told me to go 80 stock, 20 bonds. If that&#39;s the suggestion in my current mood, then something isn&#39;t working right. I spoke with an advisor there that told me 80/20 was the &#39;conservative&#39; allocation. I think they are drinking their own cool-aid. Who can I trust to help me find my asset allocation?</p>\n\n<p>tldr2; I am questioning the fundamentals of my buy-and-hold index fund approach to investing. What the hell do I do? </p>\n\n<p>Sorry this is such a mess of thoughts. Thanks in advance for any advice :)</p>\n</div><!-- SC_ON -->",
  "score": 144,
  "permalink": "/r/Bogleheads/comments/nd4uje/perspectiveadvice_to_someone_that_just_swallowed/",
  "subreddit": "Bogleheads",
  "id": "nd4uje",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590802222
}