{
  "author": "juaggo_",
  "the_new_excerpt": "The market has been rough the last few days, especially towards tech. Plenty of\npeople’s portfolio’s are getting hit hard since their portfolios consist of\ntech, more or less. I just wanted to encourage people and say that there’s no\nneed to be worried. You’ve done (at least you should have) your DD…",
  "original_created_utc": 1614288284,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "最近几天市场很不景气，尤其是对科技股。大量的\n人们的投资组合受到严重打击，因为他们的投资组合包括\n技术，或多或少。我只是想鼓励大家，并说有没有\n需要担心。你已经做了（至少你应该做的）你的DD... ...",
      "title": "PSA：从长远来看，一切都会好起来的。继续跑马拉松吧!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近幾天市場很不景氣，尤其是對科技股。大量的\n人們的投資組合受到嚴重打擊，因爲他們的投資組合包括\n技術，或多或少。我只是想鼓勵大家，並說有沒有\n需要擔心。你已經做了（至少你應該做的）你的DD... ...",
      "title": "PSA：從長遠來看，一切都會好起來的。繼續跑馬拉松吧!"
    }
  ],
  "title": "PSA: Everything will be good in the long term. Keep running the marathon!",
  "created_utc": 1614294141,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The market has been rough the last few days, especially towards tech. Plenty of people’s portfolio’s are getting hit hard since their portfolios consist of tech, more or less. I just wanted to encourage people and say that there’s no need to be worried. You’ve done (at least you should have) your DD on your investments and you know why they are good. You know that they are good and will perform well in the long term. </p>\n\n<p>Short term volatility doesn’t matter in the long term. I’ve heard many successful CEOs like Bezos talk about how he doesn’t care about the volatility in the short term. And in my opinion, this is a very important thing to remember during times when there is a lot of short term volatility.</p>\n\n<p>I think selling is necessary only if something really negative is happening within the company or the sector. If it’s just healthy market behaviour, you shouldn’t be worried.</p>\n\n<p>This quote by Benjamin Graham, the author of the Intelligent Investor is really good and should be remembered always.</p>\n\n<p>”In the short term, the market is voting machnie, but in the long term the market is a weighing machine.”</p>\n\n<p>The people that hold strong companies will be rewarded sooner or later. But it’s on your shoulders to stay calm and head towards the future without hesitation. </p>\n\n<p>If you are gaining wealth slowly with your own solid stocks, you’ll have your happy days. It might not be tomorrow or maybe not even in 8 years, but trust me, if you’ve done research, it’ll come. </p>\n\n<p>Good feelings to everybody. Have a good one!</p>\n</div><!-- SC_ON -->",
  "score": 500,
  "permalink": "/r/stocks/comments/lshb9u/psa_everything_will_be_good_in_the_long_term_keep/",
  "subreddit": "stocks",
  "id": "lshb9u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937742093
}