{
  "author": "Adawgx",
  "original_created_utc": 1634135958,
  "title": "How do people come to terms with the fact that a majority of our adult years are spent working?",
  "created_utc": 1634153460,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I graduated college a couple years ago and have been working at a job that pays well and provides good benefits, vacation time, etc. I&#39;m incredibly grateful to have the job and as far as working goes, I see it as the best situation I can have. </p>\n\n<p>Still, when I think to myself that the next 20-40 years of my life, I&#39;m going to have to work, I feel hopeless and try to invent a way out or another source of income without having to actually go to work. So far, the statistically improbable chance of winning the lottery gives me hope of a work-free life, but I recognize how unrealistic that is... </p>\n\n<p>It leads me to ask, how do people come to terms with the fact that a majority of our adult years are spent working?</p>\n</div><!-- SC_ON -->",
  "score": 117,
  "permalink": "/r/TooAfraidToAsk/comments/q7cl2k/how_do_people_come_to_terms_with_the_fact_that_a/",
  "subreddit": "TooAfraidToAsk",
  "id": "q7cl2k",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I graduated college a couple years ago and have been working at a job that pays\nwell and provides good benefits, vacation time, etc. I'm incredibly grateful to\nhave the job and as far as working goes, I see it as the best situation I can\nhave.\n\nStill, when I think to myself that the next 20-40 years…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は数年前に大学を卒業し、給料も良く、福利厚生も充実した仕事に就いています。\n給料も良く、福利厚生や休暇なども充実した仕事に就いています。仕事ができることにとても感謝しています。\n仕事をしている限り、これは私にとって最高の状況だと思います。\nしています。\n\nしかし、今後20年から40年は......と考えると......。",
      "title": "大人になってからの人生の大半を仕事に費やすという事実に、人々はどう折り合いをつけるのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我几年前大学毕业，一直在做一份薪水不错的工作。\n顺利，并提供良好的福利和休假时间，等等。我非常感激能有这份工作。\n我非常感谢这份工作，就工作而言，我认为这是我能拥有的最好的情况。\n有的。\n\n尽管如此，当我想到未来20-40年...",
      "title": "人们如何接受这样一个事实：我们成年后的大部分时间都在工作？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我幾年前大學畢業，一直在做一份薪水不錯的工作。\n順利，並提供良好的福利和休假時間，等等。我非常感激能有這份工作。\n我非常感謝這份工作，就工作而言，我認爲這是我能擁有的最好的情況。\n有的。\n\n儘管如此，當我想到未來20-40年...",
      "title": "人們如何接受這樣一個事實：我們成年後的大部分時間都在工作？"
    }
  ]
}