{
  "approved_at_utc": null,
  "subreddit": "wallstreetbets",
  "selftext": " \n\nI will be as honest as possible about this situation. I'm going to tear you down and I'm going to build you up in this post but I am going to keep hopium completely out of it.\n\nIt blows.\n\nAt face value here RC has essentially handed retail the bag and has quite literally gone against his own character with this move. Is there more to this or is this it? Well lets consider several things.\n\nRC sold his position entirely on the 16th and the 17th. The price action during these days had its ups and downs naturally but even yesterday we were able to tread 17 and 18 no problem. The sheer news of a past occurrence that was already baked into the price managed to spook a lot of people out of their shares.\n\nI only want to go over material facts here. There is plenty of speculation to be had of course but lets keep this cut and dry.\n\nCohen being in or not does not change anything to the original thesis on this play which is the spin off of buy buy baby or sale of buy buy baby or even the entirety of BBBY itself.\n\nYou also must note that Cohen is not the only one that sold here.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/umg2d5t2jli91.jpg?width=1560&amp;format=pjpg&amp;auto=webp&amp;s=5c9837d14b99d9a34c9fb2d8ef3bda1f45de2e0f\n\nThere are two sides to this coin. Gustavo just nabbed a quick 1.4M but he held onto 250k shares. There are potential reasons for this. dumping out and Cohen dumping out at the same time would look bad. It certainly invites scrutiny of a pump and dump.\n\nThe other reason would be you know RC is sellin and you need some personal money and your holding on because you know what your update at the end of the month actually is or your planning to throw 1.4M right back into it at a lower price.\n\nIt is indeed worth noting that while there had not been a spectacular amount of buying, Sue grabbed the most but it was only 50k. Others bought 10k shares. Some of you have bought more than them. This is the only insider sell besides RC. Lets be honest, there could be more. We can only react to what has actually happened so far.\n\nHere is what has happened to BBBY up to this point materially.\n\nThey have a smaller board, and 3 of RC's people are still on it. Unless RC is intentionally trying to hurt the company, he likely picked 3 competent people that can get stuff done. Materially positive.\n\nThe CEO was fired. Arguably RC kinda looks like this CEO right now driving the share price into the ground with his sale. Lets not beat around the bush, he absolutely knew this would happen if he sold and so did everyone else deep down. Regardless, the heart of the problem was cut out of the company and so this is another material positive.\n\nIn my previous posts I have also pointed out the many filings of all the executives getting may RSU's and these rsu don't vest until about July of 2023. Those in control of the company have it in their best interest to maximize this share price not just for you, but for their own person gain. These rsu are essentially a set your bonus challenge. Material positive.\n\nThere is an announcement as promised by Sue by the end of this month. This was reiterated in that 8k yesterday:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/8mctdmm3jli91.jpg?width=1646&amp;format=pjpg&amp;auto=webp&amp;s=2ad05ef9be949648f9e5bf84cee6fd752351c78b\n\nAlso note who signed that bad boy:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/je19nlj4jli91.jpg?width=1485&amp;format=pjpg&amp;auto=webp&amp;s=b62c4135e9279eb5bb8ada1155140f7dcc9ce7ea\n\nWhat was said here is they reached an agreement way back in March of 2022. They are committed to maximizing the value to share holders. They wish to restore the company to its heritage...\"for all share holders\". I find this wording interesting. I mean if you wanted a very direct message that they are working on something to increase shareholder value beyond what it was on August 17th, this is it.\n\nThey also mentioned they have been, key word \"been\" over the past \"several weeks\" with what they call \"essential financial advisors\" and they wrap it up with the end of month updated candy.\n\nNow what came out today is highly interesting.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/k5heof55jli91.jpg?width=722&amp;format=pjpg&amp;auto=webp&amp;s=c628f3993dd6e306aefe5f421df1cdbb3b7a1d84\n\n[https://finance.yahoo.com/news/bed-bath-beyond-taps-kirkland-203546387.html](https://finance.yahoo.com/news/bed-bath-beyond-taps-kirkland-203546387.html)\n\nAbsolutely nobody is focused on this news at all today. In fact it completely flew entirely under the radar.\n\nHere is some straight talk. The highlighted portions are 100% true. They do indeed have a large debt load. Kirland does indeed do restructuring AND bankruptcy stuff. Their purpose here reportedly is to advise on how to raise new money or doing a debt refi or both.\n\nSo I want to point out the most gargantuan risk of all time here because as investors if we are not evaluating the massive risk we are walking into and pretending its not there we more susceptible to losing money and getting blind sided. How many of you honestly did not believe RC would sell like ever? Then when news came out he has the legal clearance to sell, how many of you thought he would sell maybe into MOASS? I thought both and got utterly blindsided. RC had been a big part of my thesis on this play from the jump. So lets not play around the fact that bankruptcy could be in the cards. Understand it is not a certainty. But also understand that if they do declare bankruptcy out of the blue and no one expected it you will indeed lose the mass of everything. Make peace with this risk and weigh your own odds as GME was literally in the exact same position also facing bankruptcy but it never materialized. It does not have to materialize here.\n\nBut who is Kirland anyway? Some random advisor company?\n\n&amp;#x200B;\n\nhttps://preview.redd.it/iky6g2u5jli91.jpg?width=1446&amp;format=pjpg&amp;auto=webp&amp;s=0234c95046fa9f3296109fe870f56cf0bb4f07a8\n\nNope! This is like the best company you could possible hire to do anything remotely close to what BBBY is about to pull off in just a few short weeks. They literally generate the most revenue out of their peers and have multiple #1 and #2 rankings for restructuring businesses. They actually have some very notable cases as well that are extremely worth looking at:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/h0bqjnk6jli91.jpg?width=1414&amp;format=pjpg&amp;auto=webp&amp;s=dc128ab10d4015e1a2eaff621f4a11443ecdf9bd\n\nYou read this correctly. This is a company that oversaw the largest biopharmaceutical deal of all time, helped with other acquisitions and outright sales of companies sprinkling in a spin off and company restructuring. \\*\\*\\*THIS HAS LITERALY BEEN OUR THESIS SINCE THE BEGINNING\\*\\*\\* RC was always apart of the thesis as something fun to rally around, but at the end of the day the thesis HE had IS THE THESIS STILL. This company literally specializes in selling a company, merging a company and spinning off a company. All the things you have been looking at, the best possible company was just picked.\n\nWhat I have gathered from all of this, is that Kirkland is not a company that plays around and gets results. If there was one company you could possibly call for an emergency life line to be pulled out of thin air, it sounds like Kirkland. This is all from the wiki:\n\n[https://en.wikipedia.org/wiki/Kirkland\\_%26\\_Ellis](https://en.wikipedia.org/wiki/Kirkland_%26_Ellis)\n\nThis is not something being widely discussed. Consider the fact that right now, 99.99% including myself are literally losing their minds running around like a blind chicken in panic because this news was entirely and completely overshadowed and under examined by RC selling. He knew that too.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/pbct9l97jli91.jpg?width=596&amp;format=pjpg&amp;auto=webp&amp;s=c7c1a282c2993fef6a38e2a6d9773ee86400d68c\n\nCohen set BBBY up with new management. Bullish. Only 1 insider really sold anything and that was 20% of their stake. Bullish. The people in charge are being paid by rsu's. Bullish. After RC sold, we maintained a very healthy price level. Bullish. BBBY just hired THE company to either sell itself to someone entirely, spin off buy buy baby or sell buy buy baby. BULLSIH AF.\n\nConsider that this is the company Gustavo mentioned. They didn't just start working with Kirkland yesterday. This has been in the works for \"several weeks\". Could be one, two, four, eight. Its anyone's guess.\n\nNow consider what I mentioned earlier. If there is no sale of BBBY entirely or buy buy baby or no spin off, bankruptcy is indeed on the table. It might not come to pass in 6 months or a year. But it would indeed look inevitable unless something materially changes here.\n\nSo now the stock will trade exactly like that is the case because the market does not see what I just pointed out about Kirland at all. In fact, just as we got blindsided by RC's move, the bears are going to be entirely blindsided by BBBY's move.\n\nThis thing is going to have a serious attempt on its very life over the next few days and even week. There are 9 trading days until we are at the last day of the month. Each day that goes by, shorts that got stuck in this play when it was under 10, 8, 6 are going to pull all the stops now to really get it down there. Short interest in BBBY is about to go through the dam roof and to the moon. I would not be surprised if they short over 100% officially of the float which I understand to be up to over 50% right now. They never left. They only doubled down and they are going to quintuple down on Monday.\n\nIf you thought you were taking a risk before I have to be very blunt when I say that your risk level did indeed go up about 100 fold today being up from about 10 fold yesterday. There is no middle ground on BBBY. This thing is either going to dip hard and rip even harder than it ever has in its lifetime or its going to dip hard and never come back. If you ever were looking to be in on the ramen or lambo of ramen or lambo plays, there is no other. BBBY is it more than ever now.\n\nThere are two realities at the end of the day and you need to consider this in your risk assessment.\n\nRC did a classical pump and dump. Although its not much of a pump for him as he pocketed 19M bucks on the trade according to Trey Trades and the other 19M is going to BBBY per the swing trade rule which does apply since his position was created over a multiple month period of time. He let everyone out here lay the groundwork and was tired of holding in the red for a whopping 4 months and said this is too risky for me and dumped it all. He got tired of the retail investor demanding so much from him and set a price on forever tarnishing his reputation and trust in him and any other future venture he ever seeks. No one will ever follow this man into anything ever again.\n\nRC just sacrificed the queen on the chess board (himself) to save the king (BBBY). BBBY could have diluted shares at anytime. The company could have quite easily dropped a nice 9M shares of its own onto the open markets. But they didn't. If they are facing bankruptcy why wouldn't they? They don't need to because they know what this August update really is and what it will set the new share price at over night. Not only is the ground work being laid for the most massive short squeeze of all time as this even is indeed the largest panic nuclear bomb that could be generated for a stock, but the ground work has been being laid much longer for the big turn around event that BBBY will announce at some point over the next 9 trading days at the max.\n\nI'm still upset, I thought we had it in the bag. This thing was literally on the verge of going to incredible numbers and RC pumped the brakes knowing he pumped the brakes. Why he does not want to ride to the moon is a matter of it being possible he cannot ride this to the moon for some legal reason. I barley could understand what a 144 was let alone the implications of buying a stock and then spinning off a part of the company sending the share price to astronomical numbers.\n\nI still think we have this in the bag. But I wont sit here and pretend I don't see both sides of the coin. Its reasonable to not get involved with something where the risk just increased 100 fold. The reward has increased 100 fold too and that's what I'm leaning towards. It's not just the bulls this risk has increased 100 fold on. It's also up 100 fold for the shorts who risk over shorting this stock AGAIN and having to go through a whole other short squeeze again. both sides are scary af to play. Do your own due diligence, search your own soul and find the answer for what you will do on Monday. Will you buy more? Will you sell out? Will you hold? I won't advocate for anything from you, but consider these things and weigh the odds yourself.\n\nThe final die is cast for buy buy baby/BBBY and we are 9 trading days away from you knowing with 100% certainty either way. It's not much of a wait. Ramen or Lambo ya'll. Whatever happens, it has absolutely been a hell of a ride either way!",
  "author_fullname": "t2_bjg6aizo",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 3,
  "clicked": false,
  "title": "The only DD you'll need this week.",
  "link_flair_richtext": [
    {
      "e": "text",
      "t": "DD"
    }
  ],
  "subreddit_name_prefixed": "r/wallstreetbets",
  "hidden": false,
  "pwls": 7,
  "link_flair_css_class": "dd",
  "downs": 0,
  "thumbnail_height": 51,
  "top_awarded_type": null,
  "hide_score": false,
  "media_metadata": {
    "umg2d5t2jli91": {
      "status": "valid",
      "e": "Image",
      "m": "image/jpg",
      "p": [
        {
          "y": 39,
          "x": 108,
          "u": "https://preview.redd.it/umg2d5t2jli91.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=b7d5c7097788d1437513b29861cd64ee4d570ee3"
        },
        {
          "y": 78,
          "x": 216,
          "u": "https://preview.redd.it/umg2d5t2jli91.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=29410734bdc08072a508e898bfa9d7f426ad3026"
        },
        {
          "y": 116,
          "x": 320,
          "u": "https://preview.redd.it/umg2d5t2jli91.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=80a6ae5eb1c7e0ad6a5bdf221fa5bea9a0c5429a"
        },
        {
          "y": 233,
          "x": 640,
          "u": "https://preview.redd.it/umg2d5t2jli91.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=06bf83eb44c5cb1d300cac8fbb49ef089b538edd"
        },
        {
          "y": 350,
          "x": 960,
          "u": "https://preview.redd.it/umg2d5t2jli91.jpg?width=960&amp;crop=smart&amp;auto=webp&amp;s=5c8be470bf6fde61baae7ad489404bdf473d9f56"
        },
        {
          "y": 394,
          "x": 1080,
          "u": "https://preview.redd.it/umg2d5t2jli91.jpg?width=1080&amp;crop=smart&amp;auto=webp&amp;s=701a77c8e54af0e9741bc54a74e8114f349b28b9"
        }
      ],
      "s": {
        "y": 570,
        "x": 1560,
        "u": "https://preview.redd.it/umg2d5t2jli91.jpg?width=1560&amp;format=pjpg&amp;auto=webp&amp;s=5c9837d14b99d9a34c9fb2d8ef3bda1f45de2e0f"
      },
      "id": "umg2d5t2jli91"
    },
    "k5heof55jli91": {
      "status": "valid",
      "e": "Image",
      "m": "image/jpg",
      "p": [
        {
          "y": 78,
          "x": 108,
          "u": "https://preview.redd.it/k5heof55jli91.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=48b0061c9ab6f75064f8c40949e1ae1a767cdad2"
        },
        {
          "y": 157,
          "x": 216,
          "u": "https://preview.redd.it/k5heof55jli91.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=5f403bda38b8f63ddc226102c233a22aaccb3409"
        },
        {
          "y": 233,
          "x": 320,
          "u": "https://preview.redd.it/k5heof55jli91.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=382c713af862bae9a56472cc53dbd6edef3739e2"
        },
        {
          "y": 467,
          "x": 640,
          "u": "https://preview.redd.it/k5heof55jli91.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=da4d7dd3833bcfa8e4b877fe29513e93697a6799"
        }
      ],
      "s": {
        "y": 527,
        "x": 722,
        "u": "https://preview.redd.it/k5heof55jli91.jpg?width=722&amp;format=pjpg&amp;auto=webp&amp;s=c628f3993dd6e306aefe5f421df1cdbb3b7a1d84"
      },
      "id": "k5heof55jli91"
    },
    "je19nlj4jli91": {
      "status": "valid",
      "e": "Image",
      "m": "image/jpg",
      "p": [
        {
          "y": 21,
          "x": 108,
          "u": "https://preview.redd.it/je19nlj4jli91.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=c92c3c44c84637ff7af802a38cb794a8f757a657"
        },
        {
          "y": 43,
          "x": 216,
          "u": "https://preview.redd.it/je19nlj4jli91.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=8d511e5c8cc7990ab8e2bcea3210f62fbdcedc47"
        },
        {
          "y": 63,
          "x": 320,
          "u": "https://preview.redd.it/je19nlj4jli91.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=05b25786d756848e529aa872e8c04d999f14869e"
        },
        {
          "y": 127,
          "x": 640,
          "u": "https://preview.redd.it/je19nlj4jli91.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=b18a63cdacfb3eb48b2738abe6cc2ac9137d2de4"
        },
        {
          "y": 191,
          "x": 960,
          "u": "https://preview.redd.it/je19nlj4jli91.jpg?width=960&amp;crop=smart&amp;auto=webp&amp;s=2fc42720bd52bcd2c4603a5cb5e51b8c83c532c1"
        },
        {
          "y": 215,
          "x": 1080,
          "u": "https://preview.redd.it/je19nlj4jli91.jpg?width=1080&amp;crop=smart&amp;auto=webp&amp;s=1c4b56faf0ea6a67bf30e42a537b8882ef616e64"
        }
      ],
      "s": {
        "y": 296,
        "x": 1485,
        "u": "https://preview.redd.it/je19nlj4jli91.jpg?width=1485&amp;format=pjpg&amp;auto=webp&amp;s=b62c4135e9279eb5bb8ada1155140f7dcc9ce7ea"
      },
      "id": "je19nlj4jli91"
    },
    "h0bqjnk6jli91": {
      "status": "valid",
      "e": "Image",
      "m": "image/jpg",
      "p": [
        {
          "y": 60,
          "x": 108,
          "u": "https://preview.redd.it/h0bqjnk6jli91.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=a8145744dd04cde9d9d34e22452a97ae21a67403"
        },
        {
          "y": 120,
          "x": 216,
          "u": "https://preview.redd.it/h0bqjnk6jli91.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=4fd53ff8939e71ed36c733ea2e9367bff951e402"
        },
        {
          "y": 179,
          "x": 320,
          "u": "https://preview.redd.it/h0bqjnk6jli91.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=a0d53c8398902e2758f5ded9743bc6e4745d243f"
        },
        {
          "y": 358,
          "x": 640,
          "u": "https://preview.redd.it/h0bqjnk6jli91.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=ce52ecc13931008e48b920cd737e8c9f9d94db26"
        },
        {
          "y": 537,
          "x": 960,
          "u": "https://preview.redd.it/h0bqjnk6jli91.jpg?width=960&amp;crop=smart&amp;auto=webp&amp;s=c1e7f69ae1235597de82c66d970d1a83765a3ea6"
        },
        {
          "y": 604,
          "x": 1080,
          "u": "https://preview.redd.it/h0bqjnk6jli91.jpg?width=1080&amp;crop=smart&amp;auto=webp&amp;s=df2af98b547722bff1a786b8aeb0598468619c43"
        }
      ],
      "s": {
        "y": 792,
        "x": 1414,
        "u": "https://preview.redd.it/h0bqjnk6jli91.jpg?width=1414&amp;format=pjpg&amp;auto=webp&amp;s=dc128ab10d4015e1a2eaff621f4a11443ecdf9bd"
      },
      "id": "h0bqjnk6jli91"
    },
    "8mctdmm3jli91": {
      "status": "valid",
      "e": "Image",
      "m": "image/jpg",
      "p": [
        {
          "y": 22,
          "x": 108,
          "u": "https://preview.redd.it/8mctdmm3jli91.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=467088ee65dc42c516b238aa4aeb1e2b180274c5"
        },
        {
          "y": 44,
          "x": 216,
          "u": "https://preview.redd.it/8mctdmm3jli91.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=ec7670fc863d5c9b611a06752dbaf39bdd2fb8c8"
        },
        {
          "y": 66,
          "x": 320,
          "u": "https://preview.redd.it/8mctdmm3jli91.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=d02f3ac073ff317bf62661de1bf57eec104b5620"
        },
        {
          "y": 132,
          "x": 640,
          "u": "https://preview.redd.it/8mctdmm3jli91.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=bcf50bbe61a22d9c1ce530b528b4ad5d671c3051"
        },
        {
          "y": 198,
          "x": 960,
          "u": "https://preview.redd.it/8mctdmm3jli91.jpg?width=960&amp;crop=smart&amp;auto=webp&amp;s=c5f0093d51172aa13801aaaeca7dde53aee5e81a"
        },
        {
          "y": 223,
          "x": 1080,
          "u": "https://preview.redd.it/8mctdmm3jli91.jpg?width=1080&amp;crop=smart&amp;auto=webp&amp;s=59a786eb6bd6bb68c522fae57cf4ad79c974a634"
        }
      ],
      "s": {
        "y": 341,
        "x": 1646,
        "u": "https://preview.redd.it/8mctdmm3jli91.jpg?width=1646&amp;format=pjpg&amp;auto=webp&amp;s=2ad05ef9be949648f9e5bf84cee6fd752351c78b"
      },
      "id": "8mctdmm3jli91"
    },
    "iky6g2u5jli91": {
      "status": "valid",
      "e": "Image",
      "m": "image/jpg",
      "p": [
        {
          "y": 15,
          "x": 108,
          "u": "https://preview.redd.it/iky6g2u5jli91.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=2a433cc88cd0062337af31447a3931dd90fa0712"
        },
        {
          "y": 31,
          "x": 216,
          "u": "https://preview.redd.it/iky6g2u5jli91.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=b12bcd06813994021689ef41820b2737384d3d2e"
        },
        {
          "y": 46,
          "x": 320,
          "u": "https://preview.redd.it/iky6g2u5jli91.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=786eda9ba9685f0a44c5784f0c190de8b557ffaf"
        },
        {
          "y": 92,
          "x": 640,
          "u": "https://preview.redd.it/iky6g2u5jli91.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=6b6a647de6d07692ae0a834cc94a551e033fd8a8"
        },
        {
          "y": 138,
          "x": 960,
          "u": "https://preview.redd.it/iky6g2u5jli91.jpg?width=960&amp;crop=smart&amp;auto=webp&amp;s=73dc7202ba67baaea1eb72980b371f4cb32e400b"
        },
        {
          "y": 156,
          "x": 1080,
          "u": "https://preview.redd.it/iky6g2u5jli91.jpg?width=1080&amp;crop=smart&amp;auto=webp&amp;s=3002bda6d1b55a661df0af0636a75cfd1677af1d"
        }
      ],
      "s": {
        "y": 209,
        "x": 1446,
        "u": "https://preview.redd.it/iky6g2u5jli91.jpg?width=1446&amp;format=pjpg&amp;auto=webp&amp;s=0234c95046fa9f3296109fe870f56cf0bb4f07a8"
      },
      "id": "iky6g2u5jli91"
    },
    "pbct9l97jli91": {
      "status": "valid",
      "e": "Image",
      "m": "image/jpg",
      "p": [
        {
          "y": 21,
          "x": 108,
          "u": "https://preview.redd.it/pbct9l97jli91.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=01ebaa46239ea9672b2a5d9bcbe4b943299b4c83"
        },
        {
          "y": 42,
          "x": 216,
          "u": "https://preview.redd.it/pbct9l97jli91.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=cd4474756bf8c6917786ab1a420c295f8fb380d6"
        },
        {
          "y": 62,
          "x": 320,
          "u": "https://preview.redd.it/pbct9l97jli91.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=39df30b27a0425f6a670a4f4bffe304c0afcb7bd"
        }
      ],
      "s": {
        "y": 116,
        "x": 596,
        "u": "https://preview.redd.it/pbct9l97jli91.jpg?width=596&amp;format=pjpg&amp;auto=webp&amp;s=c7c1a282c2993fef6a38e2a6d9773ee86400d68c"
      },
      "id": "pbct9l97jli91"
    }
  },
  "name": "t3_ws4b8q",
  "quarantine": false,
  "link_flair_text_color": "light",
  "upvote_ratio": 0.94,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 1950,
  "total_awards_received": 37,
  "media_embed": {},
  "thumbnail_width": 140,
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "DD",
  "can_mod_post": false,
  "score": 1950,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": true,
  "thumbnail": "https://a.thumbs.redditmedia.com/9b-M5nDI8vz0pcY2d1m9-7SUS5Eg22W9uteGDFV-Ej8.jpg",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {
    "gid_1": 9,
    "gid_2": 3
  },
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1660882699,
  "link_flair_type": "richtext",
  "wls": 7,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.wallstreetbets",
  "allow_live_comments": true,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I will be as honest as possible about this situation. I&amp;#39;m going to tear you down and I&amp;#39;m going to build you up in this post but I am going to keep hopium completely out of it.&lt;/p&gt;\n\n&lt;p&gt;It blows.&lt;/p&gt;\n\n&lt;p&gt;At face value here RC has essentially handed retail the bag and has quite literally gone against his own character with this move. Is there more to this or is this it? Well lets consider several things.&lt;/p&gt;\n\n&lt;p&gt;RC sold his position entirely on the 16th and the 17th. The price action during these days had its ups and downs naturally but even yesterday we were able to tread 17 and 18 no problem. The sheer news of a past occurrence that was already baked into the price managed to spook a lot of people out of their shares.&lt;/p&gt;\n\n&lt;p&gt;I only want to go over material facts here. There is plenty of speculation to be had of course but lets keep this cut and dry.&lt;/p&gt;\n\n&lt;p&gt;Cohen being in or not does not change anything to the original thesis on this play which is the spin off of buy buy baby or sale of buy buy baby or even the entirety of BBBY itself.&lt;/p&gt;\n\n&lt;p&gt;You also must note that Cohen is not the only one that sold here.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/umg2d5t2jli91.jpg?width=1560&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=5c9837d14b99d9a34c9fb2d8ef3bda1f45de2e0f\"&gt;https://preview.redd.it/umg2d5t2jli91.jpg?width=1560&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=5c9837d14b99d9a34c9fb2d8ef3bda1f45de2e0f&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;There are two sides to this coin. Gustavo just nabbed a quick 1.4M but he held onto 250k shares. There are potential reasons for this. dumping out and Cohen dumping out at the same time would look bad. It certainly invites scrutiny of a pump and dump.&lt;/p&gt;\n\n&lt;p&gt;The other reason would be you know RC is sellin and you need some personal money and your holding on because you know what your update at the end of the month actually is or your planning to throw 1.4M right back into it at a lower price.&lt;/p&gt;\n\n&lt;p&gt;It is indeed worth noting that while there had not been a spectacular amount of buying, Sue grabbed the most but it was only 50k. Others bought 10k shares. Some of you have bought more than them. This is the only insider sell besides RC. Lets be honest, there could be more. We can only react to what has actually happened so far.&lt;/p&gt;\n\n&lt;p&gt;Here is what has happened to BBBY up to this point materially.&lt;/p&gt;\n\n&lt;p&gt;They have a smaller board, and 3 of RC&amp;#39;s people are still on it. Unless RC is intentionally trying to hurt the company, he likely picked 3 competent people that can get stuff done. Materially positive.&lt;/p&gt;\n\n&lt;p&gt;The CEO was fired. Arguably RC kinda looks like this CEO right now driving the share price into the ground with his sale. Lets not beat around the bush, he absolutely knew this would happen if he sold and so did everyone else deep down. Regardless, the heart of the problem was cut out of the company and so this is another material positive.&lt;/p&gt;\n\n&lt;p&gt;In my previous posts I have also pointed out the many filings of all the executives getting may RSU&amp;#39;s and these rsu don&amp;#39;t vest until about July of 2023. Those in control of the company have it in their best interest to maximize this share price not just for you, but for their own person gain. These rsu are essentially a set your bonus challenge. Material positive.&lt;/p&gt;\n\n&lt;p&gt;There is an announcement as promised by Sue by the end of this month. This was reiterated in that 8k yesterday:&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/8mctdmm3jli91.jpg?width=1646&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=2ad05ef9be949648f9e5bf84cee6fd752351c78b\"&gt;https://preview.redd.it/8mctdmm3jli91.jpg?width=1646&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=2ad05ef9be949648f9e5bf84cee6fd752351c78b&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Also note who signed that bad boy:&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/je19nlj4jli91.jpg?width=1485&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=b62c4135e9279eb5bb8ada1155140f7dcc9ce7ea\"&gt;https://preview.redd.it/je19nlj4jli91.jpg?width=1485&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=b62c4135e9279eb5bb8ada1155140f7dcc9ce7ea&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;What was said here is they reached an agreement way back in March of 2022. They are committed to maximizing the value to share holders. They wish to restore the company to its heritage...&amp;quot;for all share holders&amp;quot;. I find this wording interesting. I mean if you wanted a very direct message that they are working on something to increase shareholder value beyond what it was on August 17th, this is it.&lt;/p&gt;\n\n&lt;p&gt;They also mentioned they have been, key word &amp;quot;been&amp;quot; over the past &amp;quot;several weeks&amp;quot; with what they call &amp;quot;essential financial advisors&amp;quot; and they wrap it up with the end of month updated candy.&lt;/p&gt;\n\n&lt;p&gt;Now what came out today is highly interesting.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/k5heof55jli91.jpg?width=722&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=c628f3993dd6e306aefe5f421df1cdbb3b7a1d84\"&gt;https://preview.redd.it/k5heof55jli91.jpg?width=722&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=c628f3993dd6e306aefe5f421df1cdbb3b7a1d84&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://finance.yahoo.com/news/bed-bath-beyond-taps-kirkland-203546387.html\"&gt;https://finance.yahoo.com/news/bed-bath-beyond-taps-kirkland-203546387.html&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Absolutely nobody is focused on this news at all today. In fact it completely flew entirely under the radar.&lt;/p&gt;\n\n&lt;p&gt;Here is some straight talk. The highlighted portions are 100% true. They do indeed have a large debt load. Kirland does indeed do restructuring AND bankruptcy stuff. Their purpose here reportedly is to advise on how to raise new money or doing a debt refi or both.&lt;/p&gt;\n\n&lt;p&gt;So I want to point out the most gargantuan risk of all time here because as investors if we are not evaluating the massive risk we are walking into and pretending its not there we more susceptible to losing money and getting blind sided. How many of you honestly did not believe RC would sell like ever? Then when news came out he has the legal clearance to sell, how many of you thought he would sell maybe into MOASS? I thought both and got utterly blindsided. RC had been a big part of my thesis on this play from the jump. So lets not play around the fact that bankruptcy could be in the cards. Understand it is not a certainty. But also understand that if they do declare bankruptcy out of the blue and no one expected it you will indeed lose the mass of everything. Make peace with this risk and weigh your own odds as GME was literally in the exact same position also facing bankruptcy but it never materialized. It does not have to materialize here.&lt;/p&gt;\n\n&lt;p&gt;But who is Kirland anyway? Some random advisor company?&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/iky6g2u5jli91.jpg?width=1446&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=0234c95046fa9f3296109fe870f56cf0bb4f07a8\"&gt;https://preview.redd.it/iky6g2u5jli91.jpg?width=1446&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=0234c95046fa9f3296109fe870f56cf0bb4f07a8&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Nope! This is like the best company you could possible hire to do anything remotely close to what BBBY is about to pull off in just a few short weeks. They literally generate the most revenue out of their peers and have multiple #1 and #2 rankings for restructuring businesses. They actually have some very notable cases as well that are extremely worth looking at:&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/h0bqjnk6jli91.jpg?width=1414&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=dc128ab10d4015e1a2eaff621f4a11443ecdf9bd\"&gt;https://preview.redd.it/h0bqjnk6jli91.jpg?width=1414&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=dc128ab10d4015e1a2eaff621f4a11443ecdf9bd&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;You read this correctly. This is a company that oversaw the largest biopharmaceutical deal of all time, helped with other acquisitions and outright sales of companies sprinkling in a spin off and company restructuring. ***THIS HAS LITERALY BEEN OUR THESIS SINCE THE BEGINNING*** RC was always apart of the thesis as something fun to rally around, but at the end of the day the thesis HE had IS THE THESIS STILL. This company literally specializes in selling a company, merging a company and spinning off a company. All the things you have been looking at, the best possible company was just picked.&lt;/p&gt;\n\n&lt;p&gt;What I have gathered from all of this, is that Kirkland is not a company that plays around and gets results. If there was one company you could possibly call for an emergency life line to be pulled out of thin air, it sounds like Kirkland. This is all from the wiki:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://en.wikipedia.org/wiki/Kirkland_%26_Ellis\"&gt;https://en.wikipedia.org/wiki/Kirkland_%26_Ellis&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;This is not something being widely discussed. Consider the fact that right now, 99.99% including myself are literally losing their minds running around like a blind chicken in panic because this news was entirely and completely overshadowed and under examined by RC selling. He knew that too.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/pbct9l97jli91.jpg?width=596&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=c7c1a282c2993fef6a38e2a6d9773ee86400d68c\"&gt;https://preview.redd.it/pbct9l97jli91.jpg?width=596&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=c7c1a282c2993fef6a38e2a6d9773ee86400d68c&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Cohen set BBBY up with new management. Bullish. Only 1 insider really sold anything and that was 20% of their stake. Bullish. The people in charge are being paid by rsu&amp;#39;s. Bullish. After RC sold, we maintained a very healthy price level. Bullish. BBBY just hired THE company to either sell itself to someone entirely, spin off buy buy baby or sell buy buy baby. BULLSIH AF.&lt;/p&gt;\n\n&lt;p&gt;Consider that this is the company Gustavo mentioned. They didn&amp;#39;t just start working with Kirkland yesterday. This has been in the works for &amp;quot;several weeks&amp;quot;. Could be one, two, four, eight. Its anyone&amp;#39;s guess.&lt;/p&gt;\n\n&lt;p&gt;Now consider what I mentioned earlier. If there is no sale of BBBY entirely or buy buy baby or no spin off, bankruptcy is indeed on the table. It might not come to pass in 6 months or a year. But it would indeed look inevitable unless something materially changes here.&lt;/p&gt;\n\n&lt;p&gt;So now the stock will trade exactly like that is the case because the market does not see what I just pointed out about Kirland at all. In fact, just as we got blindsided by RC&amp;#39;s move, the bears are going to be entirely blindsided by BBBY&amp;#39;s move.&lt;/p&gt;\n\n&lt;p&gt;This thing is going to have a serious attempt on its very life over the next few days and even week. There are 9 trading days until we are at the last day of the month. Each day that goes by, shorts that got stuck in this play when it was under 10, 8, 6 are going to pull all the stops now to really get it down there. Short interest in BBBY is about to go through the dam roof and to the moon. I would not be surprised if they short over 100% officially of the float which I understand to be up to over 50% right now. They never left. They only doubled down and they are going to quintuple down on Monday.&lt;/p&gt;\n\n&lt;p&gt;If you thought you were taking a risk before I have to be very blunt when I say that your risk level did indeed go up about 100 fold today being up from about 10 fold yesterday. There is no middle ground on BBBY. This thing is either going to dip hard and rip even harder than it ever has in its lifetime or its going to dip hard and never come back. If you ever were looking to be in on the ramen or lambo of ramen or lambo plays, there is no other. BBBY is it more than ever now.&lt;/p&gt;\n\n&lt;p&gt;There are two realities at the end of the day and you need to consider this in your risk assessment.&lt;/p&gt;\n\n&lt;p&gt;RC did a classical pump and dump. Although its not much of a pump for him as he pocketed 19M bucks on the trade according to Trey Trades and the other 19M is going to BBBY per the swing trade rule which does apply since his position was created over a multiple month period of time. He let everyone out here lay the groundwork and was tired of holding in the red for a whopping 4 months and said this is too risky for me and dumped it all. He got tired of the retail investor demanding so much from him and set a price on forever tarnishing his reputation and trust in him and any other future venture he ever seeks. No one will ever follow this man into anything ever again.&lt;/p&gt;\n\n&lt;p&gt;RC just sacrificed the queen on the chess board (himself) to save the king (BBBY). BBBY could have diluted shares at anytime. The company could have quite easily dropped a nice 9M shares of its own onto the open markets. But they didn&amp;#39;t. If they are facing bankruptcy why wouldn&amp;#39;t they? They don&amp;#39;t need to because they know what this August update really is and what it will set the new share price at over night. Not only is the ground work being laid for the most massive short squeeze of all time as this even is indeed the largest panic nuclear bomb that could be generated for a stock, but the ground work has been being laid much longer for the big turn around event that BBBY will announce at some point over the next 9 trading days at the max.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m still upset, I thought we had it in the bag. This thing was literally on the verge of going to incredible numbers and RC pumped the brakes knowing he pumped the brakes. Why he does not want to ride to the moon is a matter of it being possible he cannot ride this to the moon for some legal reason. I barley could understand what a 144 was let alone the implications of buying a stock and then spinning off a part of the company sending the share price to astronomical numbers.&lt;/p&gt;\n\n&lt;p&gt;I still think we have this in the bag. But I wont sit here and pretend I don&amp;#39;t see both sides of the coin. Its reasonable to not get involved with something where the risk just increased 100 fold. The reward has increased 100 fold too and that&amp;#39;s what I&amp;#39;m leaning towards. It&amp;#39;s not just the bulls this risk has increased 100 fold on. It&amp;#39;s also up 100 fold for the shorts who risk over shorting this stock AGAIN and having to go through a whole other short squeeze again. both sides are scary af to play. Do your own due diligence, search your own soul and find the answer for what you will do on Monday. Will you buy more? Will you sell out? Will you hold? I won&amp;#39;t advocate for anything from you, but consider these things and weigh the odds yourself.&lt;/p&gt;\n\n&lt;p&gt;The final die is cast for buy buy baby/BBBY and we are 9 trading days away from you knowing with 100% certainty either way. It&amp;#39;s not much of a wait. Ramen or Lambo ya&amp;#39;ll. Whatever happens, it has absolutely been a hell of a ride either way!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "5692ce02-b860-11e5-b542-0edc7016bbd3",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2th52",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#365b8c",
  "id": "ws4b8q",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "Active_Piglet_7170",
  "discussion_type": null,
  "num_comments": 310,
  "send_replies": false,
  "whitelist_status": "some_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/wallstreetbets/comments/ws4b8q/the_only_dd_youll_need_this_week/",
  "parent_whitelist_status": "some_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/wallstreetbets/comments/ws4b8q/the_only_dd_youll_need_this_week/",
  "subreddit_subscribers": 12460166,
  "created_utc": 1660911097,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1660882699,
  "the_new_excerpt": "I will be as honest as possible about this situation. I'm going to tear you down\nand I'm going to build you up in this post but I am going to keep hopium\ncompletely out of it.\n\nIt blows.\n\nAt face value here RC has essentially handed retail the bag and has quite\nliterally gone against his own…"
}