{
  "author": "Innit4theTech",
  "original_created_utc": 1632324695,
  "title": "If you could only hodl one coin for the rest of your life which one would it be?",
  "created_utc": 1632336435,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>BITCOIN AND ETHEREUM NOT ALLOWED</strong></p>\n\n<p>If I could only hodl one coin it would be XLM (Stellar) it’s fast and cheap to transfer and even tough it’s acting like a stablecoin nowadays, it’s a matter of time before it pumps in my opinion.</p>\n\n<p>Another shout would be XMR (Monero), because it’s completely anonymous and I privacy is super important especially money-wise.</p>\n\n<p>It’s a tough question especially when BTC and ETH isn’t allowed. What would you go for, I think a lot of people will chose ADA here, or NANO. </p>\n\n<p>Sad thing about this is that if you don’t choose moons, say goodbye to them forever.</p>\n</div><!-- SC_ON -->",
  "score": 292,
  "permalink": "/r/CryptoCurrency/comments/pt9zzr/if_you_could_only_hodl_one_coin_for_the_rest_of/",
  "subreddit": "CryptoCurrency",
  "id": "pt9zzr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "BITCOIN AND ETHEREUM NOT ALLOWED\n\nIf I could only hodl one coin it would be XLM (Stellar) it’s fast and cheap to\ntransfer and even tough it’s acting like a stablecoin nowadays, it’s a matter of\ntime before it pumps in my opinion.\n\nAnother shout would be XMR (Monero), because it’s completely…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコイン・イーサリアム不可\n\n1つのコインしか使えないとしたら、XLM(Stellar)です。\n速くて安いし、最近は安定したコインのように振る舞っていますが、それも時間の問題でしょう。\n私の意見では、それが普及するのは時間の問題です。\n\nもう一つの候補はXMR（Monero）です。",
      "title": "一生の間、1枚のコインしか使えないとしたら......どのコインにしますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "不允许使用比特币和以太坊\n\n如果我只能持有一种币，那就是XLM（恒星），它的传输速度快，价格便宜。\n它的传输速度快，价格便宜，即使它现在表现得像一个稳定币，但它迟早会成为一个\n在我看来，它只是一个时间问题。\n\n另一个叫法是XMR（Monero），因为它是完全的...",
      "title": "如果你的余生只能收藏一枚硬币，你会选择哪一枚？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不允許使用比特幣和以太坊\n\n如果我只能持有一種幣，那就是XLM（恆星），它的傳輸速度快，價格便宜。\n它的傳輸速度快，價格便宜，即使它現在表現得像一個穩定幣，但它遲早會成爲一個\n在我看來，它只是一個時間問題。\n\n另一個叫法是XMR（Monero），因爲它是完全的...",
      "title": "如果你的餘生只能收藏一枚硬幣，你會選擇哪一枚？"
    }
  ]
}