{
  "author": "zjet022",
  "original_created_utc": 1655017722,
  "title": "Should a husband be okay with his wife being a stripper?",
  "created_utc": 1655042351,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My wife (26F) came to me asking if she should work at a club to help with our finances. This conversation came up when our water heater broken plus she got a flat tire, back to back this week. We are already in financial trouble with credit cards and her student loads. She lost her job during covid then we had a baby. Day care was killing us so we ended up deciding for her to stay home. When she approach me with this question. Like what type of club? One with a pole? Yes told me yes. Puzzled but not angry I asked where this came from. She just had that we are never getting above water and a friend of hers that she goes to the gym with suggested the idea to her as she is a stripper herself. &lt;/p&gt;\n\n&lt;p&gt;My wife told me that it’s only to support our family. The money can help us and she would be working night so I can watch our daughter and she will be home to which off. &lt;/p&gt;\n\n&lt;p&gt;I myself have never been to a stripper club so I can only think what I see in the movies. She told me that her friend would show her the club and if it was okay with both of us she could audition to see after we talk. &lt;/p&gt;\n\n&lt;p&gt;I feel that we have a solid marriage of 4 years. Just life does not always work as planned. Looking for advice on her because it’s not something you can talk with people. &lt;/p&gt;\n\n&lt;p&gt;What should I know about or questions I should ask. What does a audition in tell.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/vaghu0/should_a_husband_be_okay_with_his_wife_being_a/",
  "subreddit": "TooAfraidToAsk",
  "id": "vaghu0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "My wife (26F) came to me asking if she should work at a club to help with our\nfinances. This conversation came up when our water heater broken plus she got a\nflat tire, back to back this week. We are already in financial trouble with\ncredit cards and her student loads. She lost her job during covid…"
}