{
  "author": "5iveminds",
  "original_created_utc": 1641445328,
  "title": "How do people go to work the same 9-5 job every day for years and not hate their lives?",
  "created_utc": 1641460216,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Okay yea this already is clearly a pessimistic question, but i’ve been very depressed lately and anxious about my future being bleak and eventful. I’m 19, my childhood was extremely dramatic and stressful, I grew up with abusive parents in a poor neighborhood, so needless to say I was never bored, there was always something to do, and someone to run from. I ran away long before I turned 18, and was on the street/living out of my car for a couple years, and my grandparents found out around 6 months ago and moved me in with them. I’ve managed to turn my life around and I’m in college now to study psychology, but the more work I do in school the more depressed I seem to get. I’m so bored by peace and quiet and not having to fight for my life constantly, it sometimes makes me question what I really want for my life, because i’m not sure living a mundane, everyday life is for me.&lt;/p&gt;\n\n&lt;p&gt;please no hate but constructive feedback or anything you think might help me see things differently is always appreciated, i’m hear to learn and try to be more positive.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/TooAfraidToAsk/comments/rx65z2/how_do_people_go_to_work_the_same_95_job_every/",
  "subreddit": "TooAfraidToAsk",
  "id": "rx65z2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Okay yea this already is clearly a pessimistic question, but i’ve been very\ndepressed lately and anxious about my future being bleak and eventful. I’m 19,\nmy childhood was extremely dramatic and stressful, I grew up with abusive\nparents in a poor neighborhood, so needless to say I was never bored,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "さて、これはもう明らかに悲観的な質問なのですが、私は最近非常に\n最近落ち込んでいて、自分の将来が暗くて不安なのです。私は19歳です。\n私の子供時代は非常に劇的でストレスの多いものでした。\n親は貧しい地域に住んでいて、言うまでもなく私は退屈していました。",
      "title": "毎日同じ9時〜5時の仕事を何年も続けて、自分の人生が嫌にならない人なんているのだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，这显然已经是一个悲观的问题，但我最近一直非常\n郁闷，对我的未来感到焦虑，因为我的未来是暗淡而多事的。我今年19岁。\n我的童年是非常戏剧性和紧张的，我是在父母虐待的情况下长大的。\n我在父母的虐待下长大，所以不用说，我从未感到无聊，...",
      "title": "人们怎么会多年来每天都去做同样的朝九晚五的工作而不讨厌自己的生活？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，這顯然已經是一個悲觀的問題，但我最近一直非常\n鬱悶，對我的未來感到焦慮，因爲我的未來是暗淡而多事的。我今年19歲。\n我的童年是非常戲劇性和緊張的，我是在父母虐待的情況下長大的。\n我在父母的虐待下長大，所以不用說，我從未感到無聊，...",
      "title": "人們怎麼會多年來每天都去做同樣的朝九晚五的工作而不討厭自己的生活？"
    }
  ]
}