{
  "author": "carlyslayjedsen",
  "the_new_excerpt": "Short answer: don't. I work in the industry and learned early on not to touch it\nwith a ten-foot pole. If you want to invest in the pharma/biopharma/biotech\nindustry, investing in small-cap biotech stocks - MBIO, VKTX, ATOS, etc. for\nexamples is basically gambling. Here are the alternatives I…",
  "original_created_utc": 1621696827,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "簡単に言うと、「しない」ということです。私はこの業界で働いていますが、早い段階で「10フィートの棒で触ってはいけない」と学びました。\n触れないようにしています。製薬/バイオ製薬/バイオテック業界に投資したいのであれば\n製薬/バイオ製薬/バイオテック業界に投資したいなら、MBIO、VKTX、ATOSなどの小型バイオ株に投資するのは\n例は、基本的にギャンブルです。ここでは、私の代替案をご紹介します。",
      "title": "バイオテックに投資してみませんか？クイックガイドです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "简短的回答：不要。我在这个行业工作，很早就知道不要用十英尺长的杆子去碰它。\n用十英尺长的杆子去碰它。如果你想投资于制药/生物制药/生物技术\n如果你想投资制药/生物制药/生物技术行业，投资于小盘生物技术股票--如MBIO、VKTX、ATOS等。\n例如，基本上是在赌博。以下是我的备选方案。",
      "title": "想投资于生物技术？一个快速指南。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "簡短的回答：不要。我在這個行業工作，很早就知道不要用十英尺長的杆子去碰它。\n用十英尺長的杆子去碰它。如果你想投資於製藥/生物製藥/生物技術\n如果你想投資製藥/生物製藥/生物技術行業，投資於小盤生物技術股票--如MBIO、VKTX、ATOS等。\n例如，基本上是在賭博。以下是我的備選方案。",
      "title": "想投資於生物技術？一個快速指南。"
    }
  ],
  "title": "Want to invest in biotech? A quick guide.",
  "created_utc": 1621716519,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Short answer: don&#39;t. I work in the industry and learned early on not to touch it with a ten-foot pole. If you want to invest in the pharma/biopharma/biotech industry, investing in small-cap biotech stocks - MBIO, VKTX, ATOS, etc. for examples is basically gambling. Here are the alternatives I suggest.</p>\n\n<p>Supply chain. TMO and AVTR are the two biggest suppliers of consumables in the life sciences industry and essentially hold a duopoly. Both are basically trying to position themselves as the amazon of the industry. TMO is more diversified offering various services and high-powered equipment and is on the cutting-edge of R&amp;D in a lot of equipment fields (MS and cryo-EM). AVTR owns VWR which is basically like an Amazon/costco hybrid for companies and academia. I highly recommend choosing one or both.</p>\n\n<p>Equipment. TMO/AVTR kind of fall into this category but I wanted to make a different section because they pretty much own the entire consumables market. Instrumentation has a lot more competition. While something like TMO has its hands dipped into everything, almost nobody would choose a TMO HPLC over Agilent (A) or Waters (WAT). PCR? Bio-Rad (BIO). Centrifuges? Beckman Coulter (DHR). A lot of companies have carved out niches for themselves whereas something like TMO is a generalist. You also have companies like DHR that hold brands like Beckman Coulter that have a lot of brand loyalty.</p>\n\n<p>Services. CROs like IQVIA, PPD, manufacturing services, instrumentation (calibration, maintenance) services etc. One of the most expensive things about the industry is the regulatory hurdles, especially clinical trials. CROs help companies save money on clinical trials by outsourcing them to companies already equipped to handle different parts of them. Equipment has to have records of being &quot;up to spec&quot; for audit purposes and a lot of companies do this stuff in-house or let the vendors send service techs out. You also have companies like TMO with their unity service that do this stuff. They also recently bought out Patheon and PPD so they&#39;re expanding the services side of their company a lot.</p>\n\n<p>Tech. This sort of falls under equipment and services so I won&#39;t spend too long on it, but companies like Illumina have revolutionized things in their fields (DNA sequencing for Illumina).</p>\n\n<p>In terms of innovation in tech/equipment, chromatography, mass spec, sequencing, cryo-EM and Big Data are the future.</p>\n\n<p>Big pharma/biopharma/biotech. You can still benefit from the excitement of a positive clinical trial result without the volatility. The issue with small-cap biotech is that you&#39;ll bleed out 70% over the course of a few months, and by the time you get that 25% bump from a positive trial result you&#39;re still extremely deep in the red. These companies completely hinge on a very small amount of drugs which is why they&#39;re such a gamble. Companies like PFE, ABBV have blockbuster drugs under their belt that keep them relatively stable and allow them to pay dividends. The 25% bump from a positive result you&#39;d see from biotech is buffered to be more like 5-10%, but at least you know you won&#39;t (probably) lose 90% of your investment.</p>\n\n<p>Last but not least... ETFs. Pharma, biotech and medical devices ETFs all hold a lot of these aforementioned categories/companies.</p>\n\n<p>Disclaimer: I own TMO, A, AVTR and BIO.</p>\n</div><!-- SC_ON -->",
  "score": 116,
  "permalink": "/r/stocks/comments/nikw11/want_to_invest_in_biotech_a_quick_guide/",
  "subreddit": "stocks",
  "id": "nikw11",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197389724
}