{
  "author": "Nowhere_Man_Forever",
  "original_created_utc": 1654874119,
  "title": "I just learned that the Sahara has only been a desert for about 5,000-6,000 years. This time period is somewhat close to the development of the earliest known writing systems in Mesopotamia. Are there any written sources that discuss the desertification of the Sahara?",
  "created_utc": 1654880965,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Obviously there are potentially hundreds of years between the completion of Sahara desertification and the onset of writing in Mesopotamia, but it&amp;#39;s close enough that it seems possible that there could have been a &amp;quot;cultural memory&amp;quot; of a &amp;quot;green Sahara&amp;quot; during the earliest stages of writing. Mesopotamia is obviously pretty far from Africa, but historically speaking north African and middle eastern nomads have had contact with one another and seem could have theoretically had contact with Mesopotamian civilizations. &lt;/p&gt;\n\n&lt;p&gt;Do scholars believe any early written myths and legends discuss this? It is just astounding to me that the Sahara was relatively lush within a period that could theoretically be in the historical record. &lt;/p&gt;\n\n&lt;p&gt;Apologies if this is a dumb question I just got off a Wikipedia deep dive and probably don&amp;#39;t have a full story.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 130,
  "permalink": "/r/AskHistorians/comments/v9a0nl/i_just_learned_that_the_sahara_has_only_been_a/",
  "subreddit": "AskHistorians",
  "id": "v9a0nl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Obviously there are potentially hundreds of years between the completion of\nSahara desertification and the onset of writing in Mesopotamia, but it's close\nenough that it seems possible that there could have been a \"cultural memory\" of\na \"green Sahara\" during the earliest stages of writing.…"
}