{
  "author": "Nowhere_Man_Forever",
  "original_created_utc": 1654874119,
  "title": "I just learned that the Sahara has only been a desert for about 5,000-6,000 years. This time period is somewhat close to the development of the earliest known writing systems in Mesopotamia. Are there any written sources that discuss the desertification of the Sahara?",
  "created_utc": 1654880965,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Obviously there are potentially hundreds of years between the completion of Sahara desertification and the onset of writing in Mesopotamia, but it&amp;#39;s close enough that it seems possible that there could have been a &amp;quot;cultural memory&amp;quot; of a &amp;quot;green Sahara&amp;quot; during the earliest stages of writing. Mesopotamia is obviously pretty far from Africa, but historically speaking north African and middle eastern nomads have had contact with one another and seem could have theoretically had contact with Mesopotamian civilizations. &lt;/p&gt;\n\n&lt;p&gt;Do scholars believe any early written myths and legends discuss this? It is just astounding to me that the Sahara was relatively lush within a period that could theoretically be in the historical record. &lt;/p&gt;\n\n&lt;p&gt;Apologies if this is a dumb question I just got off a Wikipedia deep dive and probably don&amp;#39;t have a full story.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 130,
  "permalink": "/r/AskHistorians/comments/v9a0nl/i_just_learned_that_the_sahara_has_only_been_a/",
  "subreddit": "AskHistorians",
  "id": "v9a0nl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Obviously there are potentially hundreds of years between the completion of\nSahara desertification and the onset of writing in Mesopotamia, but it's close\nenough that it seems possible that there could have been a \"cultural memory\" of\na \"green Sahara\" during the earliest stages of writing.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "が完成するまでに何百年もかかる可能性があるのは明らかです。\nサハラの砂漠化が完了してからメソポタミアで文字が書かれるようになるまでには、数百年の時間がかかります。\nサハラの砂漠化が完了してから、メソポタミアで文字が書かれるようになるまでには、数百年の歳月が必要です。\n文化的な記憶」が残っている可能性があるのだ......。",
      "title": "サハラ砂漠が砂漠になったのは5,000～6,000年前くらいからだと今知りました。この時期は、メソポタミアで最古の文字システムが開発された時期にやや近いと思われます。サハラの砂漠化について書かれた資料はあるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "很明显，在完成《圣经》的过程中，可能有几百年的时间。\n撒哈拉沙漠化的完成和美索不达米亚文字的出现之间可能有几百年的时间，但这已经足够接近了。\n足够接近，所以似乎有可能在美索不达米亚最早的阶段存在着 \"绿色撒哈拉 \"的 \"文化记忆\"。\n一个 \"绿色撒哈拉 \"的 \"文化记忆\"，在写作的最初阶段....。",
      "title": "我刚刚了解到，撒哈拉成为沙漠的时间只有大约5000-6000年。这个时间段与美索不达米亚最早的已知文字系统的发展有些接近。是否有任何书面资料讨论撒哈拉沙漠化的问题？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "很明顯，在完成《聖經》的過程中，可能有幾百年的時間。\n撒哈拉沙漠化的完成和美索不達米亞文字的出現之間可能有幾百年的時間，但這已經足夠接近了。\n足夠接近，所以似乎有可能在美索不達米亞最早的階段存在着 \"綠色撒哈拉 \"的 \"文化記憶\"。\n一個 \"綠色撒哈拉 \"的 \"文化記憶\"，在寫作的最初階段....。",
      "title": "我剛剛瞭解到，撒哈拉成爲沙漠的時間只有大約5000-6000年。這個時間段與美索不達米亞最早的已知文字系統的發展有些接近。是否有任何書面資料討論撒哈拉沙漠化的問題？"
    }
  ]
}