{
  "author": "ShoppingCart96",
  "original_created_utc": 1649200966,
  "title": "What is the current, most heated debate on a topic in your specific field of study that people are not aware of?",
  "created_utc": 1649214557,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A question a little bit outside of the box, hopefully it won&amp;#39;t be deleted. What is the current controversial discussion happening in academia, over your different fields of study. For example, in Linguistics, the recursion debate rages on, but the average Joe isn&amp;#39;t particularly aware of it. Perhaps there was a recent archaeological finding? A new interpretation of primary sources? A breakthrough in deciphering an artifact?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/tx83rw/what_is_the_current_most_heated_debate_on_a_topic/",
  "subreddit": "AskHistorians",
  "id": "tx83rw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "A question a little bit outside of the box, hopefully it won't be deleted. What\nis the current controversial discussion happening in academia, over your\ndifferent fields of study. For example, in Linguistics, the recursion debate\nrages on, but the average Joe isn't particularly aware of it. Perhaps…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "少し枠から外れた質問ですが、削除されないことを祈ります。どのような\n学問の世界では、現在どのような議論が行われているのでしょうか？\nの分野です。例えば、言語学では、再帰性の議論があります。\nでも、一般の人は特に意識していないですよね。もしかしたら...",
      "title": "あなたの専門分野のトピックで、現在、最も白熱した議論で、人々が気づいていないものは何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "一个有点出格的问题，希望不会被删除。什么是\n目前在学术界发生的有争议的讨论是什么，在你们的\n不同的研究领域。例如，在语言学中，递归的争论\n争论不休，但普通人并不特别了解。也许...",
      "title": "在你的特定研究领域中，当前最激烈的辩论是什么，人们并不了解？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "一個有點出格的問題，希望不會被刪除。什麼是\n目前在學術界發生的有爭議的討論是什麼，在你們的\n不同的研究領域。例如，在語言學中，遞歸的爭論\n爭論不休，但普通人並不特別瞭解。也許...",
      "title": "在你的特定研究領域中，當前最激烈的辯論是什麼，人們並不瞭解？"
    }
  ]
}