{
  "author": "SnPotager",
  "original_created_utc": 1648059543,
  "title": "In 1985, the popular American sitcom Night Court ran an episode about a transgender woman, treating her identity (more or less) with respect and dignity. How big of a deal was this at the time?",
  "created_utc": 1648067486,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m referring to season three episode six, &lt;em&gt;The Best of Friends.&lt;/em&gt; The basic premise is that one of the recurring cast reconnects with an old college friend, only to discover that she has undergone medical and social transition in the years since they knew each other. The portrayal of a trans character is remarkably respectful compared to most 80s media (or even to other episodes of Night Court), so I’m wondering how this episode got made and what the popular reaction was at the time.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 108,
  "permalink": "/r/AskHistorians/comments/tl5kg9/in_1985_the_popular_american_sitcom_night_court/",
  "subreddit": "AskHistorians",
  "id": "tl5kg9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m referring to season three episode six, The Best of Friends. The basic\npremise is that one of the recurring cast reconnects with an old college friend,\nonly to discover that she has undergone medical and social transition in the\nyears since they knew each other. The portrayal of a trans…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "シーズン3の第6話「最高の友だち」のことです。基本的な流れは\n前提は、出演者の一人が大学時代の友人と再会することです。\nその結果、彼女が医学的・社会的な変遷を遂げていることが判明しました。\nを、「萌え萌え」と呼んでいます。トランスの描写は...",
      "title": "1985年、アメリカの人気コメディ番組『Night Court』は、トランスジェンダーの女性のエピソードを放送し、彼女のアイデンティティを（多かれ少なかれ）尊重し、尊厳を持って扱いました。当時、これはどれほど大きな出来事だったのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我指的是第三季第六集《最好的朋友》。其基本\n基本的前提是，一个经常性的演员与一个老的大学朋友重新联系。\n结果发现她在这几年里经历了医疗和社会转型。\n在他们相识后的几年里，她经历了医疗和社会转型。该剧描绘了一个变性人的形象。",
      "title": "1985年，流行的美国情景喜剧《夜总会》（Night Court）播出了一集关于一名变性妇女的节目，以尊重和尊严对待她的身份（或多或少）。这在当时是多么大的一件事？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我指的是第三季第六集《最好的朋友》。其基本\n基本的前提是，一個經常性的演員與一個老的大學朋友重新聯繫。\n結果發現她在這幾年裏經歷了醫療和社會轉型。\n在他們相識後的幾年裏，她經歷了醫療和社會轉型。該劇描繪了一個變性人的形象。",
      "title": "1985年，流行的美國情景喜劇《夜總會》（Night Court）播出了一集關於一名變性婦女的節目，以尊重和尊嚴對待她的身份（或多或少）。這在當時是多麼大的一件事？"
    }
  ]
}