{
  "author": "TheFreshHearth",
  "original_created_utc": 1628405730,
  "title": "Why are the comments in Youtube and Facebook so Anti-Vaccine?",
  "created_utc": 1628467142,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m trying to convince my mother to get the vaccine and for some odd reason she would not explain why she doesn&#39;t want to get it. I decided to youtube / google &quot;reasons why people don&#39;t want the vaccine&quot; or &quot;medical opinion on vaccine&quot; and read a bombardment of comments all anti-vaccine with hundreds, if not thousands of upvotes.</p>\n\n<p>&#x200B;</p>\n\n<p>What&#39;s the deal?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TrueAskReddit/comments/p09xax/why_are_the_comments_in_youtube_and_facebook_so/",
  "subreddit": "TrueAskReddit",
  "id": "p09xax",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm trying to convince my mother to get the vaccine and for some odd reason she\nwould not explain why she doesn't want to get it. I decided to youtube / google\n\"reasons why people don't want the vaccine\" or \"medical opinion on vaccine\" and\nread a bombardment of comments all anti-vaccine with…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は母にワクチンを受けるように説得しているのですが、なぜか母は\n母はなぜかワクチンを受けたくない理由を説明しません。私は、youtube/googleで\n\"reasons why people don't want the vaccine\" or \"medical opinion on vaccine\" and\n膨大な数のアンチワクチンのコメントを読みました。",
      "title": "YoutubeやFacebookのコメントはなぜアンチワクチンなのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我试图说服我母亲接种疫苗，但由于一些奇怪的原因，她不愿意解释她为什么不想接种。\n她不愿意解释她为什么不想接种疫苗。我决定在YouTube/谷歌上\n\"人们不愿意接种疫苗的原因 \"或 \"关于疫苗的医学意见\"，并阅读了大量的评论。\n阅读了大量的评论，这些评论都是反疫苗的......",
      "title": "为什么Youtube和Facebook上的评论如此反疫苗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我試圖說服我母親接種疫苗，但由於一些奇怪的原因，她不願意解釋她爲什麼不想接種。\n她不願意解釋她爲什麼不想接種疫苗。我決定在YouTube/谷歌上\n\"人們不願意接種疫苗的原因 \"或 \"關於疫苗的醫學意見\"，並閱讀了大量的評論。\n閱讀了大量的評論，這些評論都是反疫苗的......",
      "title": "爲什麼Youtube和Facebook上的評論如此反疫苗？"
    }
  ]
}