{
  "author": "Closeted-banana",
  "original_created_utc": 1628600307,
  "title": "is it homophobic if a straight person is disgusted at gay couples kissing?",
  "created_utc": 1628625319,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I live in a highly conservative and religious country and Im a closeted bi. My straight sister is always saying &quot;ew&quot; whenever she sees a gay couple expressing their love for each other like kissing. I always binge-watch series and movies on Netflix and I mainly watch on the living room. Since Netflix&#39;s shows has lgbtq+ representations, there are mostly gay couples or other members from the community being represented.</p>\n\n<p>I found that whenever such romantic scenes involving those members are on the show or movie Im watching she keeps saying &quot;ew&quot;. Mostly on the kissing scenes. I always stare back at her and say &quot;wtf&quot;. These representations help me as well since im closeted lol. So now I wanna ask if my sister is homophobic? I may be overreacting since straight ppl have other preferences(?) Like yeah i get that theyre not attracted to gay relationships...But she also got me confused as she supports the lgbtq+ community as well. So im like you support it but you dont really want to see it??</p>\n\n<p>I mean no offense to anyone. I just wanna know if its considered homophobic. Like dude. theyre just kissing?! If so I think ill just stay in my closet for my whole life and just enjoy the lgbtq+ reps on Netflix lol.  </p>\n\n<p>Edit: I saw some comments if she acts the same to hetero couples: NO she does not. She even watches those Korean dramas that mainly have straight couples. I see and hear her squeak or swoon over the main couples&#39; romantic scenes.</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/TooAfraidToAsk/comments/p1onn9/is_it_homophobic_if_a_straight_person_is/",
  "subreddit": "TooAfraidToAsk",
  "id": "p1onn9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I live in a highly conservative and religious country and Im a closeted bi. My\nstraight sister is always saying \"ew\" whenever she sees a gay couple expressing\ntheir love for each other like kissing. I always binge-watch series and movies\non Netflix and I mainly watch on the living room. Since…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は非常に保守的で宗教的な国に住んでいますが、私はクローゼットの中のバイです。私の\nストレートの妹は、ゲイカップルがキスなどの愛情表現をしているのを見ると、いつも「えーっ」と言っています。\n私のストレートの妹は、ゲイカップルがキスなどの愛情表現をしているのを見ると、いつも「えっ」と言っています。私はいつもNetflixでシリーズや映画を繰り返し見ています。\n主にリビングルームで見ています。それは...",
      "title": "ストレートの人がゲイカップルのキスに嫌悪感を抱くのはホモフォビアなのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我生活在一个高度保守的宗教国家，我是一个不公开的双性恋。我的\n我的异性恋妹妹每当看到一对同性恋者表达他们的爱意，如接吻时，她总是说 \"恶心\"。\n他们对彼此的爱，比如接吻。我总是在Netflix上狂看电视剧和电影\n在Netflix上，我主要在客厅里看。自从...",
      "title": "如果一个异性恋者对同性恋伴侣接吻感到厌恶，这算不算是同性恋恐惧症？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我生活在一個高度保守的宗教國家，我是一個不公開的雙性戀。我的\n我的異性戀妹妹每當看到一對同性戀者表達他們的愛意，如接吻時，她總是說 \"噁心\"。\n他們對彼此的愛，比如接吻。我總是在Netflix上狂看電視劇和電影\n在Netflix上，我主要在客廳裏看。自從...",
      "title": "如果一個異性戀者對同性戀伴侶接吻感到厭惡，這算不算是同性戀恐懼症？"
    }
  ]
}