{
  "author": "Set1Less",
  "original_created_utc": 1655390423,
  "title": "Contagion is spreading: Another centralised lender Sequoia backed Finblox is in deep trouble. After exposure to 3AC, they have paused rewards, and capped withdrawals to $500 a day and $1500 a month for all users.",
  "created_utc": 1655408191,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Finblox is yet another lender who seems to have been affected due to the ongoing collapse of key centralised players and a large fund 3AC which has apparently blown up. Finblox was backed by large VCs like Sequoia and Dragonfly. &lt;/p&gt;\n\n&lt;p&gt;In a message to users, Finblox has informed them they are reducing withdrawal limits and cutting all rewards. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/7pmmv1kavz591.jpg?width=777&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=3633179ec302914d1c0508065c81e604e38853ff\"&gt;Finfblox: Withdrawals capped, rewards paused&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Finblox claims to have insurance for its funds - not sure if its going to pay out at all. In the present situation, VCs coming to any startup rescue is pretty much off the table.. &lt;/p&gt;\n\n&lt;p&gt;Its not clear which other operators are affected with the ongoing situation, one thing is certain - the contagion is deep and spreading quickly. 3AC was quite a big player who had commitments across multiple exchanges, lending services and market makers. Some trading desks have already sounded the alarm and have called back their margin. &lt;/p&gt;\n\n&lt;p&gt;Centralised entities continue to be very risky as of now.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 310,
  "permalink": "/r/CryptoCurrency/comments/vdnjel/contagion_is_spreading_another_centralised_lender/",
  "subreddit": "CryptoCurrency",
  "id": "vdnjel",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Finblox is yet another lender who seems to have been affected due to the ongoing\ncollapse of key centralised players and a large fund 3AC which has apparently\nblown up. Finblox was backed by large VCs like Sequoia and Dragonfly.\n\nIn a message to users, Finblox has informed them they are reducing…"
}