{
  "author": "tryM3B1tch",
  "original_created_utc": 1637262061,
  "title": "Kraken are now delisting XMR (Monero) from their site on the 26th for the UK",
  "created_utc": 1637284401,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m a fan of privacy coins, big fan of Monero both for the anonymity, fast transactions and low fees. It is dumb and ridiculous Kraken are taking it down from their site due to &quot;UK regulations&quot;</p>\n\n<p>Full email from Kraken:</p>\n\n<blockquote>\n<p>Hello,</p>\n\n<p>We are reaching out regarding an update to trading and funding of Monero (XMR) on Kraken. </p>\n\n<p>In compliance with UK regulations, Kraken (Payward Ltd) will no longer be supporting Monero (XMR) on its platform. </p>\n\n<p>Trading </p>\n\n<p>On the 26th of November, all Monero (XMR) trading on Kraken will cease in the UK. This includes Instant Buy/Sell Services as well as order book trading on XMR/BTC, XMR/USD, and XMR/EUR.</p>\n\n<p>Funding</p>\n\n<p>Any deposits of Monero (XMR) in the UK will no longer be credited after 26th of November. Thereafter, Monero (XMR) balances can be withdrawn to a personal wallet or to an alternative exchange.</p>\n\n<p>Margin</p>\n\n<p>On the 23rd of November, 2021, your Monero (XMR) margin positions will be set to reduce only. This means that you will not be able to increase or open new Monero (XMR) margin positions. You will only be able to reduce open Monero (XMR) margin positions.</p>\n\n<p>We kindly ask that you close any open margin positions involving Monero (XMR) by the 26th of November, 2021. On 26th of November, all open margin positions will be force liquidated and any open orders will be cancelled. </p>\n\n<p>We appreciate your understanding and we apologise for any inconvenience caused. Should you have any questions, please do not hesitate to contact our support team.</p>\n\n<p>Best regards,</p>\n\n<p>The Kraken Team</p>\n</blockquote>\n\n<p>Edit: wallets to use are GUI wallet + trezor optional, exodus and cake wallet</p>\n</div><!-- SC_ON -->",
  "score": 204,
  "permalink": "/r/CryptoCurrency/comments/qwww81/kraken_are_now_delisting_xmr_monero_from_their/",
  "subreddit": "CryptoCurrency",
  "id": "qwww81",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm a fan of privacy coins, big fan of Monero both for the anonymity, fast\ntransactions and low fees. It is dumb and ridiculous Kraken are taking it down\nfrom their site due to \"UK regulations\"\n\nFull email from Kraken:\n\n> Hello,\n> \n> We are reaching out regarding an update to trading and funding of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はプライバシーコインのファンで、匿名性、迅速な取引、低い手数料の両方でMoneroの大ファンです。\nトランザクションの速さと手数料の安さでMoneroの大ファンです。Krakenがこのコインを削除するのは馬鹿げています。\nイギリスの規制」を理由に、Krakenがサイトから削除しています。\n\nクラーケンからのメール全文\n\n> こんにちは。\n> \n> 私たちは、取引と資金調達の最新情報について連絡しています...",
      "title": "Krakenは、英国では26日にXMR（Monero）の上場を廃止しました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是隐私币的粉丝，是Monero的忠实粉丝，因为它的匿名性、快速交易和低费用。\n交易和低费用。这是愚蠢和可笑的，Kraken由于 \"英国法规 \"而将其从网站上删除\n从他们的网站上删除，因为 \"英国的法规\"\n\nKraken的完整电子邮件。\n\n> 你好。\n> \n> 我们正在联系关于交易和资金的更新。",
      "title": "Kraken现在从他们的网站上取消了英国的XMR（Monero）26日的上市。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是隱私幣的粉絲，是Monero的忠實粉絲，因爲它的匿名性、快速交易和低費用。\n交易和低費用。這是愚蠢和可笑的，Kraken由於 \"英國法規 \"而將其從網站上刪除\n從他們的網站上刪除，因爲 \"英國的法規\"\n\nKraken的完整電子郵件。\n\n> 你好。\n> \n> 我們正在聯繫關於交易和資金的更新。",
      "title": "Kraken現在從他們的網站上取消了英國的XMR（Monero）26日的上市。"
    }
  ]
}