{
  "author": "marleymush0208",
  "original_created_utc": 1627680622,
  "title": "Is it weird for a 22 year old to date a 17 year old?",
  "created_utc": 1627703316,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So, I&#39;ve gotten to know a girl in a social group we&#39;re in, and we have a lot in common, and I&#39;d love to ask her if she wants to hang out some time, but as a (very soon to be) 22 year old, I feel like I&#39;m maybe pushing what is generally accepted in terms of age gaps at our age.</p>\n\n<p>I&#39;ve never dated before so I&#39;m not really sure of the norms and such, and so it is, that I turn to reddit with a burn account. Would this be okay, or should I just not act on it?</p>\n\n<p>I&#39;m in the UK, I know people are going to bring up the age of consent, It&#39;s 16 here, but I&#39;m not even certain if I&#39;m ready for that yet.</p>\n\n<p>&#x200B;</p>\n\n<p>Edit: Okay, the general consensus is mostly a &#39;no&#39;. It&#39;s good to know, rather than going for it and being shunned by people I know. Just so I&#39;m aware for the future, when does the age gap become not weird, when its 22/18, 23/19, 24/20? Gathering opinions is helpful as I am more than happy to just remain friends and keep it open as an option in the future if neither of us has a partner by then.</p>\n</div><!-- SC_ON -->",
  "score": 110,
  "permalink": "/r/TooAfraidToAsk/comments/ouudhv/is_it_weird_for_a_22_year_old_to_date_a_17_year/",
  "subreddit": "TooAfraidToAsk",
  "id": "ouudhv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So, I've gotten to know a girl in a social group we're in, and we have a lot in\ncommon, and I'd love to ask her if she wants to hang out some time, but as a\n(very soon to be) 22 year old, I feel like I'm maybe pushing what is generally\naccepted in terms of age gaps at our age.\n\nI've never dated…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私たちが参加しているソーシャルグループで、ある女の子と知り合いになったのですが、共通点が多くて\n共通点が多いので、今度遊びに行かないかと誘ってみたいのですが、（もうすぐ）22歳の若者としては\n(しかし、（もうすぐ）22歳の私は、一般的には無理をしているのではないかと感じています。\nしかし、もうすぐ22歳になる私は、私たちの年齢で一般的に認められている年齢差を超えているような気がします。\n\n私は一度もデートしたことがありません...",
      "title": "22歳の人が17歳の人と付き合うのは変ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以，我在我们的一个社会团体中认识了一个女孩，我们有很多共同点。\n我很想问她是否愿意和我一起出去玩，但作为一个22岁的年轻人，我不知道该怎么办。\n(但是，作为一个22岁的年轻人，我觉得我可能是在推卸责任。\n在我们这个年龄段的年龄差距方面被接受。\n\n我从来没有约会过...",
      "title": "一个22岁的人和一个17岁的人约会很奇怪吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以，我在我們的一個社會團體中認識了一個女孩，我們有很多共同點。\n我很想問她是否願意和我一起出去玩，但作爲一個22歲的年輕人，我不知道該怎麼辦。\n(但是，作爲一個22歲的年輕人，我覺得我可能是在推卸責任。\n在我們這個年齡段的年齡差距方面被接受。\n\n我從來沒有約會過...",
      "title": "一個22歲的人和一個17歲的人約會很奇怪嗎？"
    }
  ]
}