{
  "author": "zandor435",
  "original_created_utc": 1638453790,
  "title": "“40% of all money today was printed in the last 18 months” - Breedlove",
  "created_utc": 1638470174,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Robert Breedlove has said this on a few podcasts.  I shared with a friend who was skeptical.  He dug in and found that this stat comes from the fed website.  Per my skeptical friend this is misleading.  &lt;/p&gt;\n\n&lt;p&gt;He says that “printed” does not mean “created.”  He says that printed more accurately means converting non physical cash into physical cash.  &lt;/p&gt;\n\n&lt;p&gt;Further, some economists say this is a sign of a strengthening economy bc banks are responding to patrons desire for more cash to spend.  &lt;/p&gt;\n\n&lt;p&gt;This last part seems highly debatable and dubious.  But I’d love some feedback on what Breedlove was actually saying.  Does “printed” mean “created” or only converted?&lt;/p&gt;\n\n&lt;p&gt;Appreciate some thoughts.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 185,
  "permalink": "/r/Bitcoin/comments/r78508/40_of_all_money_today_was_printed_in_the_last_18/",
  "subreddit": "Bitcoin",
  "id": "r78508",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Robert Breedlove has said this on a few podcasts. I shared with a friend who was\nskeptical. He dug in and found that this stat comes from the fed website. Per my\nskeptical friend this is misleading.\n\nHe says that “printed” does not mean “created.” He says that printed more\naccurately means…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Robert Breedloveは、いくつかのポッドキャストでこのように語っています。友人に話したところ、彼は\nは懐疑的である。彼が調べたところ、この統計は連邦政府のウェブサイトから来ていることがわかりました。私の\n懐疑的な友人は、これは誤解を招くと述べています。\n\n彼は、\"印刷 \"は \"作成 \"を意味しない、と言っています。彼は、\"印刷 \"は \"作成 \"を意味しないと言っています\n正確には...",
      "title": "\"今日の全貨幣の40％は、過去18ヶ月間に印刷されたものである\" - Breedlove"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Robert Breedlove在几个播客中都说过这句话。我和一个朋友分享了这个观点，他\n持怀疑态度。他深入研究后发现，这个统计数字来自于美联储的网站。根据我的\n怀疑的朋友，这是误导。\n\n他说，\"印刷 \"并不意味着 \"创造\"。他说，印刷品更\n准确的意思是...",
      "title": "\"今天所有货币的40%是在过去18个月里印制的\" - 布雷德洛夫"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Robert Breedlove在幾個播客中都說過這句話。我和一個朋友分享了這個觀點，他\n持懷疑態度。他深入研究後發現，這個統計數字來自於美聯儲的網站。根據我的\n懷疑的朋友，這是誤導。\n\n他說，\"印刷 \"並不意味着 \"創造\"。他說，印刷品更\n準確的意思是...",
      "title": "\"今天所有貨幣的40%是在過去18個月裏印製的\" - 佈雷德洛夫"
    }
  ]
}