{
  "author": "Dowdell2008",
  "the_new_excerpt": "This popped up on my TD Ameritrade app this morning:\n\n“Tesla Inc (NASDAQ: TSLA) saw new registrations fall 24% year-over-year in April\nin Germany, while Volkswagen AG's secured a 108.4% rise.\n\nTesla new registrations in Germany totaled 484 in April, while in the preceding\nmonth the tally was at…",
  "original_created_utc": 1620395093,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今朝、TDアメリトレードのアプリにこんなのが出てきました。\n\n\"テスラ社（NASDAQ: TSLA）の4月のドイツでの新規登録台数は、前年同月比で24％減少しました。\n一方、フォルクスワーゲンAGは108.4％の増加を記録しました。\n\nドイツにおけるテスラの新規登録台数は、4月には484台でした。\n4月のドイツにおけるテスラの新規登録台数は484台で、前月は...",
      "title": "テスラのドイツにおける4月の新車登録台数は25％減、フォルクスワーゲンは108％増"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今天早上，我的TD Ameritrade应用程序上弹出了这个消息。\n\n\"特斯拉公司（NASDAQ: TSLA）4月份在德国的新车注册量同比下降24%，而大众汽车公司的新车注册量同比增长108.4%。\n在德国，而大众汽车公司确保了108.4%的增长。\n\n4月份特斯拉在德国的新注册量为484辆，而前一个月的注册量为\n月，该数字为...",
      "title": "特斯拉4月在德国的新注册量下降25%，而大众汽车则上升108%。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天早上，我的TD Ameritrade應用程序上彈出了這個消息。\n\n\"特斯拉公司（NASDAQ: TSLA）4月份在德國的新車註冊量同比下降24%，而大衆汽車公司的新車註冊量同比增長108.4%。\n在德國，而大衆汽車公司確保了108.4%的增長。\n\n4月份特斯拉在德國的新註冊量爲484輛，而前一個月的註冊量爲\n月，該數字爲...",
      "title": "特斯拉4月在德國的新註冊量下降25%，而大衆汽車則上升108%。"
    }
  ],
  "title": "Tesla Saw New Registrations Drop 25% In Germany In April, While Volkswagen Saw 108% Rise",
  "created_utc": 1620406300,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This popped up on my TD Ameritrade app this morning:</p>\n\n<p>“Tesla Inc (NASDAQ: TSLA) saw new registrations fall 24% year-over-year in April in Germany, while Volkswagen AG&#39;s secured a 108.4% rise.</p>\n\n<p>Tesla new registrations in Germany totaled 484 in April, while in the preceding month the tally was at 3,703 - a fall of 86.93%, according to data released by the country&#39;s federal motor transport authority, Das Kraftfahrt-Bundesamt.</p>\n\n<p>Comparatively, Volkswagen saw registrations totaled 43,230 in April 2021; in March the number was 56,550, indicating a month-over-month fall of 23.5%. The automaker secured the largest share of new registrations in April at 18.8%.”</p>\n\n<p>Anyone ignoring VW as a serious EV player is missing out on a significant upside. From the valuation perspective, “Tesla is worth more than twice as much as the two companies that sell by far the most actual cars — VW and Toyota, whose market caps are $102 billion and $213 billion respectively. Tesla delivered 499,550 vehicles last year. By comparison, Toyota sold 8.5 million vehicles just through November, and VW sold 8.3 million.”  </p>\n\n<p>I am all in on VWAPY and POAHY. I am a bit biased - drive Porsche Macan and love it. Will be switching to Taycan within 12-18 months but apparently they are already back ordered for months. </p>\n\n<p>And no, this isn’t intended to be a detailed DD, so don’t come at me for that. :). Just sharing what I read this morning.</p>\n\n<p>EDIT:  in terms of EV only sales, here is how these two companies sold world-wide. As you can see, in 2020 VW already sold almost half as many cars as Tesla. That’s three times as many as in 2019. Not too bad considering COVId.   </p>\n\n<p>VW:</p>\n\n<p>2019: 75k</p>\n\n<p>2020: 230k</p>\n\n<p>Tesla</p>\n\n<p>2019: 370k</p>\n\n<p>2020: 500k</p>\n</div><!-- SC_ON -->",
  "score": 220,
  "permalink": "/r/stocks/comments/n6yu2y/tesla_saw_new_registrations_drop_25_in_germany_in/",
  "subreddit": "stocks",
  "id": "n6yu2y",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985995614
}