{
  "approved_at_utc": null,
  "subreddit": "wallstreetbets",
  "selftext": "# I. Introduction\n\nSorry for the wall of text - but if you are serious about trading **please read through this -** I think you all could really benefit from a bit of intermarket analysis - and I see way too many victims of ignorance here who could prevent their losses by understanding these relatively simply concepts.\n\nThis sub is primarily focused on IWM names (Russell 2000/Small Caps). If you look at that stock - **it's been sideways for almost a year**. No secret you all have been losing tons of money as of late on your favorite names (Except MVST - nice one there).\n\nIn my eyes - for the best probability of success - you always want to be playing the names that are within the strongest index at the time (or simply playing the strongest index itself). I determine which is the strongest via charting plus some simple intermarket relationships.\n\nLast year during the recovery we got a huge **everything rally** \\- that is not usually the case. Money constantly rotates from sector to sector - this is how it usually is - and how it's been for most of 2021. For instance - notice today (8/102021) tech is dropping while financials, materials and other inflation camp names are pumping. This is one of many useful correlations.\n\n# II. The Indices\n\nThe indices are large groups of stocks lumped in together that usually move in unison. Most of you probably already know this. I'm just going to list out what each index is and what it focuses on.\n\n**S&P 500 (SPY, SPX, ES)**\n\n*from Wikipedia*\n\n\"The Standard and Poor's 500, or simply the S&P 500, is a stock market index that tracks 500 large companies listed on stock exchanges in the United States. It is one of the most commonly followed equity indices.\"\n\nBasically a compilation of most large caps in the United States. Great gage of overall market health - and sort of a cross between the other two large cap indexes (Nasdaq 100, Dow Jones).\n\n**Nasdaq 100 (QQQ, NDX, NQ)**\n\n*from Wikipedia*\n\n\"The Nasdaq-100 is a stock market index made up of 102 equity securities issued by 100 of the largest non-financial companies listed on the Nasdaq stock market. It is a modified capitalization-weighted index. \"\n\nThese are going to be mostly your large cap growth names (tech stocks) - but there are a few boomer names in there. Just more heavy on the growth side than the other indexes.\n\n**Dow Jones Industrial Average (DIA, DJIA, YM)**\n\n*from Wikipedia*\n\n\"The Dow Jones Industrial Average, Dow Jones, or simply the Dow, is a price-weighted measurement stock market index of 30 prominent companies listed on stock exchanges in the United States.\"\n\nThese are going to be your \"boomer\" names - I like to call it the boomer index. Value, materials, healthcare etc. Not really any growth names in there (except AAPL, CRM I guess). One thing I like to note is that **all the names in Dow Jones are present in the S&P 500 - the Dow is the most closely correlated index to the S&P** (about a 0.92 correlation iirc).\n\n**Russell 2000 Index (IWM, RUT, RTY)**\n\n*from Wikipedia*\n\n\"The Russell 2000 Index is a small-cap stock market index of the smallest 2,000 stocks in the Russell 3000 Index. It was started by the Frank Russell Company in 1984. The index is maintained by FTSE Russell, a subsidiary of the London Stock Exchange Group.\"\n\nThese are all your small cap names. There is also a Russell 1000 and Russell 3000. Notice how many more companies are in here than the other indexes. This one isn't going to be moved by one or two stocks. Small caps usually benefit from risk on environments (they are perceived to be riskier) - but note the more speculative growth ones will lag in those situations.\n\nThese are also **meme stocks - pretty much every single one is in a Russell Index.** If you are someone who likes to play memes - you always want to watch IWM. When this one is popping off is when they will be making a run.\n\n# III. Risk On vs Risk Off (Inflation vs Deflation Camp)\n\nMoving onto more practical applications of this information. I could do a section on Forex, Bonds, etc. - but honestly you only need to know what they are to apply the analysis that I do.\n\nThe primary narrative driving the market in recent times is whether we are getting inflation or deflation - and this has dictated the flow of money.\n\n**Risk On (Inflation Camp)**\n\nRisk-On is described as a rotation from save haven assets into riskier assets. If market participants believe in high inflationary pressures, they will want to invest their cash into **\"risk\" assets** including, stocks, real estate etc. to combat the residual effects of inflation on their money. Additionally, they believe we are now in a rising rate environment (rates already at zero, likely to increase in the future), which would help benefit **value stocks, financials/banks, energy, specific forex/currencies**, anything that benefits from low rates (currently).\n\nMore specifically, **banks benefit from a gradual steady increase in interest rates.** Banks make an interest rate spread on deposits received versus money lent. In a rising rate environment, they are able to pay lower interest on their deposits and make a larger spread on their loans.\n\nCommodities, materials (energy), and consumer/defensive stocks **benefit from inflation** as they are able to pass on rising costs to consumers. Additionally, value/defensive stocks typically have a strong track-record of recurring dividends and share buybacks to provide yield to shareholders. Conversely, in later stages of rising rates, investors may divest from growth or tech stocks because rising rates have a direct effect on liquidity and cost of capital. **When rates are high, debt is heavier and money is more expensive.**\n\nAUD/JPY is an easy forex pair to watch for risk on movements based on the Australian economy in relation to Japan. A**UD is seen as a \"risk\" currency**, whereas **JPY is seen as a \"safe haven\"**. When AUDJPY is increasing, typically this is a sign of \"risk-on\". This is only one of many pairs to watch for in Forex Markets, considering Forex Markets are much larger than the stock market.\n\nRemember, in the early stages of inflation, small caps or tech stocks will perform well because the negative impact of inflation on sitting in cash; however, if the federal reserve is required to combat hyper/stagflation worries, they will raise rates and growth or tech stocks may perform poorly in that environment. Furthermore, **Dow Jones Industrial Average (boomer)** names will usually outperform, and investors today may be pricing-in this effect.\n\nEquities as a whole will generally do well in a risk-on environment. Stocks are considered a hedge for inflation, but watch-out for JPOW and his antics later on.\n\n**Risk Off (Deflation Camp)**\n\nThis is the opposite of risk-on. Money rotates out of risk assets into safe havens. People in the deflation corner believe inflation is transitory, asset prices will decline, and virtually **assume the Federal Reserve won't have to raise rates**. In low inflation or deflationary environment, money flows **to safe haven assets out of risk assets**. Participants would hoard cash (increasing in value) and wait for asset prices to decline. They would invest in **bonds, safe haven currencies, speculate on an increase in volatility, and save cash to reinvest later.**\n\nGrowth performs well here because when interest rates are low - money is cheaper to borrow. **Growth depends on debt to continue it's operations. Most of them also don't make money and so they have** **no yield.**  An increase in interest rates will raise the cost of capital making it harder for companies to generate higher returns. With rising rates, a company has to pay a higher interest expense that lowers their overall profitability. Lower profits lead to lower cash flows, which lead to a higher required rate of return for investors, all of which lead to a lower valuation for the company's share price.\n\nBonds outperform because investors believe rates to remain low or fall further. They'd be able to receive a **\"higher\" interest rate today versus in the future.** Bonds are typically safer than equity because they are first in-line in the event of a liquidation (bankruptcy) and earn a fixed rate of return. Additionally, the **USD, JPY, CHF** perform well because they are a 'safe-haven' currency. The US Dollar is still considered the world's reserve currency. (Trust in the US Economy/Risk Free) In addition, deflation has a natural increase in the dollar's value.\n\nThe VIX performs well because it's **essentially a measure of how hedged SPX players are**. If you are expecting deflation in assets - you are expecting prices to drop for the most part - and so you want to be hedged on your long positions (or make straight bear bets).\n\n**In Summary**\n\nToday, the Federal Reserve has created a low interest rate environment to stimulate the economy; through allowing participants to borrow funds \"cheaper\" or lower rates. This stimulates demand, supply, borrowing, lending... overall growth. Asset prices are attempting to \"price-in\" the future state of the economy.\n\nIf you believe that inflation is here to stay, then you'd want to shift into risk-assets. If you believe that inflation is 'transitory', then you'd want to move towards safe haven assets. Ultimately, you could assume that the Federal Reserve controls the narrative and that any major movements in the flow of money, cost of debt (change in rates), could have a positive or negative impact on asset prices. In either scenario (in the future), inflation can lead to higher interest rates causing a drop in asset prices or deflation worries can keep interest rates low and fuel the rally for longer than one would expect. I hope that makes sense.\n\n< *Risk On >*\n\n* Financials\n* Commodities\n* Value\n* Materials\n* AUD/JPY\n* **Russell 2000**\n* **Dow Jones**\n\n< *Risk Off >*\n\n* Bonds\n* Growth\n* Dollar\n* VIX\n* **Nasdaq 100**\n\n# IV. Practical Applications\n\nFirst let me go over the tickers I watch for each rotation -\n\n< *Risk On >*\n\n* YM (DIA)\n* RTY (IWM)\n* CL (Crude Oil Futures)\n* ZC (Corn Futures)\n* AUD/JPY\n\n*< Risk Off >*\n\n* DXY (Dollar Index)\n* ZB (30 Year Treasury Bonds)\n* TNX (10 Year Treasury Index)\n* VIX (The \"Fear Index\")\n* NQ (QQQ)\n* ARKK (This is a bit newer and less common - but I find it useful to track speculative growth names that perform quite well in a deflationary environment)\n\nGlancing at a watchlist of these will give you a quick picture of where money is flowing at the moment - but in order to predict the odds of future movements (and more profitable ones) - I perform technical analysis on all of these names.\n\nBasically - I analyze all the indices and only play the one that is the strongest from a technical standpoint. I further filter these signals and determine position sizing by analyzing their correlated assets.\n\nFor instance - if **DIA** is breaking out - and **ZB** is breaking down - this is confluence for a risk on rotation. The more confluence - the higher probability you have of success in any play.\n\nOn the contrary, if **DIA** is breaking out - and **ZB** is rallying - this is a sign one of the moves is likely fake - and a signal I have lower odds of success. Subsequently, I want to size smaller.\n\n***Let's take a look at one example in which QQQ (Growth, Risk Off) caught the rotation this past May. This is a perfect example of Bonds and Growth moving in unison to provide a high probability long trade in QQQ and TLT. Note: I just use trendlines and volume for my technical analysis. No indicators.***\n\n[NQ \\(QQQ\\)](https://preview.redd.it/fdtd97r9fkg71.png?width=1696&format=png&auto=webp&s=2e7c58fa94c018f4d6fb5b38585a4d474f77b5c6)\n\nThe red circle is Nasdaq on **5/13.** You can see that is the day it bottomed - and every day since then pretty much Nasdaq, tech, and risk off assets have been leading. Not only that - but on **6/22** it broke a huge technical setup (the big red line) - which triggered a ton more upside.\n\n[TLT \\(ZB\\)](https://preview.redd.it/cuq89v4hfkg71.png?width=1456&format=png&auto=webp&s=836d02a7fc13c175aebc93f080d705679b0b2f7c)\n\nThe red circle here is also **5/13.** You can see that is also the day that TLT (ZB or Bonds) bottomed - and every day since then except for the past three days - it's held the same uptrend. Not only that - but on **6/22** it also broke that big red line - which was a downtrend stemming from last year - triggering more upside here as well. We also broke out of that teal symmetrical triangle, which provided more confluence for the move.\n\nI try to assign a signal strength to each move in order to make it easier for my monkey brain to understand.\n\n* **Indexes:** 3\n* **Bonds:** 2\n* **Everything Else:** 1\n\nYou will see a lot of people say bonds are everything - and in my experience that is very true. Last year we had an extremely odd situation where risk parity was fucked - but in recent times it has come back. Correlations almost always revert to the mean at **some point**. Subsequently - you could watch just bonds and the indices and efficiently track the flow of money.\n\n# V. Divergences\n\nCorrelations are not perfect. If they were - everyone would be a billionaire. There are times when we get divergences and things move opposite of the way they usually do. Like I said - they **almost** **always revert to the mean** at some point - but the catch is the divergence could blow your account before it reverts back. If you are good with technicals you can easily spot when a setup you are trying to play breaks down and stop loss accordingly - but the key point here is **always have a stop loss when playing correlations.** Lots of people think they can average down infinitely and eventually profit off the arbitrage that comes with assets reverting to the mean - but **the market can stay irrational longer than you can stay solvent.**\n\n# IV. TL;DR\n\nThe main thing to takeaway here is the indices. If QQQ is weak - maybe you want to take a look at DIA. If IWM is sideways - maybe you want to take a look at QQQ. Keep your head on a swivel and don't be too biased towards one sector. **If you can effectively track the flow of money - you can theoretically catch every rotation.**\n\nAlso - you don't have to apply the technicals I do to track it. That's just my method. Lot's of people use complex macroeconomic analysis to assess these sorts of things, among other methods. I'm just too smooth brained for that.\n\nI hope this helped you all - and if anyone has questions drop it in the comments.\n\n\\---\n\nEdit: One final note since I know the more advanced people will likely comment on this. I know QQQ/Growth has not always been risk off - this is a new thing. I was trying to explain things from the perspective of recent times as correlations shift with macroeconomic changes.\n\nWe haven't had a true deflationary environment in over a decade - and subsequently the market rotations have been more about pricing in rate hikes/rate cuts than rotating in and out of equities as a whole.",
  "author_fullname": "t2_9j0dm2bt",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 3,
  "clicked": false,
  "title": "Follow The Money - How To Catch Every Rotation And (Almost) Always Make Money",
  "link_flair_richtext": [
    {
      "e": "text",
      "t": "Discussion"
    }
  ],
  "subreddit_name_prefixed": "r/wallstreetbets",
  "hidden": false,
  "pwls": 7,
  "link_flair_css_class": "question",
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "media_metadata": {
    "fdtd97r9fkg71": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 59,
          "x": 108,
          "u": "https://preview.redd.it/fdtd97r9fkg71.png?width=108&crop=smart&auto=webp&s=5344559ca3c6fa650826ba4cf2e0d0c744db12f0"
        },
        {
          "y": 118,
          "x": 216,
          "u": "https://preview.redd.it/fdtd97r9fkg71.png?width=216&crop=smart&auto=webp&s=30a93bc83cca5a12648090ddbf2dc12edf098922"
        },
        {
          "y": 174,
          "x": 320,
          "u": "https://preview.redd.it/fdtd97r9fkg71.png?width=320&crop=smart&auto=webp&s=8392cd13beaef8e6ac2911369572b049e0c6d620"
        },
        {
          "y": 349,
          "x": 640,
          "u": "https://preview.redd.it/fdtd97r9fkg71.png?width=640&crop=smart&auto=webp&s=038b7ba7c447c50608e6fc843412eacf9cd9ba9c"
        },
        {
          "y": 524,
          "x": 960,
          "u": "https://preview.redd.it/fdtd97r9fkg71.png?width=960&crop=smart&auto=webp&s=606015393f147f541e7157611be7a8522709d64b"
        },
        {
          "y": 590,
          "x": 1080,
          "u": "https://preview.redd.it/fdtd97r9fkg71.png?width=1080&crop=smart&auto=webp&s=db3cf8776a4a5e521e906c693778d6d92b95eccc"
        }
      ],
      "s": {
        "y": 927,
        "x": 1696,
        "u": "https://preview.redd.it/fdtd97r9fkg71.png?width=1696&format=png&auto=webp&s=2e7c58fa94c018f4d6fb5b38585a4d474f77b5c6"
      },
      "id": "fdtd97r9fkg71"
    },
    "cuq89v4hfkg71": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 65,
          "x": 108,
          "u": "https://preview.redd.it/cuq89v4hfkg71.png?width=108&crop=smart&auto=webp&s=2ac564829042622089f400bae9fbc73d4860982b"
        },
        {
          "y": 130,
          "x": 216,
          "u": "https://preview.redd.it/cuq89v4hfkg71.png?width=216&crop=smart&auto=webp&s=84a1d3e5603174973117ed393360af65cc9fd99a"
        },
        {
          "y": 192,
          "x": 320,
          "u": "https://preview.redd.it/cuq89v4hfkg71.png?width=320&crop=smart&auto=webp&s=d9bc3d5898de081e9f3bc2fcb9bb23fa6927606f"
        },
        {
          "y": 385,
          "x": 640,
          "u": "https://preview.redd.it/cuq89v4hfkg71.png?width=640&crop=smart&auto=webp&s=ad1fe679a76ee0b0f640227c4769228420240bec"
        },
        {
          "y": 578,
          "x": 960,
          "u": "https://preview.redd.it/cuq89v4hfkg71.png?width=960&crop=smart&auto=webp&s=35eefebcf8b3ea60469af80f1850ac550b30c412"
        },
        {
          "y": 650,
          "x": 1080,
          "u": "https://preview.redd.it/cuq89v4hfkg71.png?width=1080&crop=smart&auto=webp&s=f61a1ed7bf32f8d078df765f2b626e52516cfec0"
        }
      ],
      "s": {
        "y": 877,
        "x": 1456,
        "u": "https://preview.redd.it/cuq89v4hfkg71.png?width=1456&format=png&auto=webp&s=836d02a7fc13c175aebc93f080d705679b0b2f7c"
      },
      "id": "cuq89v4hfkg71"
    }
  },
  "name": "t3_p1x0ls",
  "quarantine": false,
  "link_flair_text_color": "light",
  "upvote_ratio": 0.96,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 4320,
  "total_awards_received": 49,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Discussion",
  "can_mod_post": false,
  "score": 4320,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": true,
  "thumbnail": "",
  "edited": 1628638615,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {
    "gid_1": 14,
    "gid_2": 3,
    "gid_3": 1
  },
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1628625639,
  "link_flair_type": "richtext",
  "wls": 7,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.wallstreetbets",
  "allow_live_comments": true,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h1>I. Introduction</h1>\n\n<p>Sorry for the wall of text - but if you are serious about trading <strong>please read through this -</strong> I think you all could really benefit from a bit of intermarket analysis - and I see way too many victims of ignorance here who could prevent their losses by understanding these relatively simply concepts.</p>\n\n<p>This sub is primarily focused on IWM names (Russell 2000/Small Caps). If you look at that stock - <strong>it&#39;s been sideways for almost a year</strong>. No secret you all have been losing tons of money as of late on your favorite names (Except MVST - nice one there).</p>\n\n<p>In my eyes - for the best probability of success - you always want to be playing the names that are within the strongest index at the time (or simply playing the strongest index itself). I determine which is the strongest via charting plus some simple intermarket relationships.</p>\n\n<p>Last year during the recovery we got a huge <strong>everything rally</strong> - that is not usually the case. Money constantly rotates from sector to sector - this is how it usually is - and how it&#39;s been for most of 2021. For instance - notice today (8/102021) tech is dropping while financials, materials and other inflation camp names are pumping. This is one of many useful correlations.</p>\n\n<h1>II. The Indices</h1>\n\n<p>The indices are large groups of stocks lumped in together that usually move in unison. Most of you probably already know this. I&#39;m just going to list out what each index is and what it focuses on.</p>\n\n<p><strong>S&amp;P 500 (SPY, SPX, ES)</strong></p>\n\n<p><em>from Wikipedia</em></p>\n\n<p>&quot;The Standard and Poor&#39;s 500, or simply the S&amp;P 500, is a stock market index that tracks 500 large companies listed on stock exchanges in the United States. It is one of the most commonly followed equity indices.&quot;</p>\n\n<p>Basically a compilation of most large caps in the United States. Great gage of overall market health - and sort of a cross between the other two large cap indexes (Nasdaq 100, Dow Jones).</p>\n\n<p><strong>Nasdaq 100 (QQQ, NDX, NQ)</strong></p>\n\n<p><em>from Wikipedia</em></p>\n\n<p>&quot;The Nasdaq-100 is a stock market index made up of 102 equity securities issued by 100 of the largest non-financial companies listed on the Nasdaq stock market. It is a modified capitalization-weighted index. &quot;</p>\n\n<p>These are going to be mostly your large cap growth names (tech stocks) - but there are a few boomer names in there. Just more heavy on the growth side than the other indexes.</p>\n\n<p><strong>Dow Jones Industrial Average (DIA, DJIA, YM)</strong></p>\n\n<p><em>from Wikipedia</em></p>\n\n<p>&quot;The Dow Jones Industrial Average, Dow Jones, or simply the Dow, is a price-weighted measurement stock market index of 30 prominent companies listed on stock exchanges in the United States.&quot;</p>\n\n<p>These are going to be your &quot;boomer&quot; names - I like to call it the boomer index. Value, materials, healthcare etc. Not really any growth names in there (except AAPL, CRM I guess). One thing I like to note is that <strong>all the names in Dow Jones are present in the S&amp;P 500 - the Dow is the most closely correlated index to the S&amp;P</strong> (about a 0.92 correlation iirc).</p>\n\n<p><strong>Russell 2000 Index (IWM, RUT, RTY)</strong></p>\n\n<p><em>from Wikipedia</em></p>\n\n<p>&quot;The Russell 2000 Index is a small-cap stock market index of the smallest 2,000 stocks in the Russell 3000 Index. It was started by the Frank Russell Company in 1984. The index is maintained by FTSE Russell, a subsidiary of the London Stock Exchange Group.&quot;</p>\n\n<p>These are all your small cap names. There is also a Russell 1000 and Russell 3000. Notice how many more companies are in here than the other indexes. This one isn&#39;t going to be moved by one or two stocks. Small caps usually benefit from risk on environments (they are perceived to be riskier) - but note the more speculative growth ones will lag in those situations.</p>\n\n<p>These are also <strong>meme stocks - pretty much every single one is in a Russell Index.</strong> If you are someone who likes to play memes - you always want to watch IWM. When this one is popping off is when they will be making a run.</p>\n\n<h1>III. Risk On vs Risk Off (Inflation vs Deflation Camp)</h1>\n\n<p>Moving onto more practical applications of this information. I could do a section on Forex, Bonds, etc. - but honestly you only need to know what they are to apply the analysis that I do.</p>\n\n<p>The primary narrative driving the market in recent times is whether we are getting inflation or deflation - and this has dictated the flow of money.</p>\n\n<p><strong>Risk On (Inflation Camp)</strong></p>\n\n<p>Risk-On is described as a rotation from save haven assets into riskier assets. If market participants believe in high inflationary pressures, they will want to invest their cash into <strong>&quot;risk&quot; assets</strong> including, stocks, real estate etc. to combat the residual effects of inflation on their money. Additionally, they believe we are now in a rising rate environment (rates already at zero, likely to increase in the future), which would help benefit <strong>value stocks, financials/banks, energy, specific forex/currencies</strong>, anything that benefits from low rates (currently).</p>\n\n<p>More specifically, <strong>banks benefit from a gradual steady increase in interest rates.</strong> Banks make an interest rate spread on deposits received versus money lent. In a rising rate environment, they are able to pay lower interest on their deposits and make a larger spread on their loans.</p>\n\n<p>Commodities, materials (energy), and consumer/defensive stocks <strong>benefit from inflation</strong> as they are able to pass on rising costs to consumers. Additionally, value/defensive stocks typically have a strong track-record of recurring dividends and share buybacks to provide yield to shareholders. Conversely, in later stages of rising rates, investors may divest from growth or tech stocks because rising rates have a direct effect on liquidity and cost of capital. <strong>When rates are high, debt is heavier and money is more expensive.</strong></p>\n\n<p>AUD/JPY is an easy forex pair to watch for risk on movements based on the Australian economy in relation to Japan. A<strong>UD is seen as a &quot;risk&quot; currency</strong>, whereas <strong>JPY is seen as a &quot;safe haven&quot;</strong>. When AUDJPY is increasing, typically this is a sign of &quot;risk-on&quot;. This is only one of many pairs to watch for in Forex Markets, considering Forex Markets are much larger than the stock market.</p>\n\n<p>Remember, in the early stages of inflation, small caps or tech stocks will perform well because the negative impact of inflation on sitting in cash; however, if the federal reserve is required to combat hyper/stagflation worries, they will raise rates and growth or tech stocks may perform poorly in that environment. Furthermore, <strong>Dow Jones Industrial Average (boomer)</strong> names will usually outperform, and investors today may be pricing-in this effect.</p>\n\n<p>Equities as a whole will generally do well in a risk-on environment. Stocks are considered a hedge for inflation, but watch-out for JPOW and his antics later on.</p>\n\n<p><strong>Risk Off (Deflation Camp)</strong></p>\n\n<p>This is the opposite of risk-on. Money rotates out of risk assets into safe havens. People in the deflation corner believe inflation is transitory, asset prices will decline, and virtually <strong>assume the Federal Reserve won&#39;t have to raise rates</strong>. In low inflation or deflationary environment, money flows <strong>to safe haven assets out of risk assets</strong>. Participants would hoard cash (increasing in value) and wait for asset prices to decline. They would invest in <strong>bonds, safe haven currencies, speculate on an increase in volatility, and save cash to reinvest later.</strong></p>\n\n<p>Growth performs well here because when interest rates are low - money is cheaper to borrow. <strong>Growth depends on debt to continue it&#39;s operations. Most of them also don&#39;t make money and so they have</strong> <strong>no yield.</strong>  An increase in interest rates will raise the cost of capital making it harder for companies to generate higher returns. With rising rates, a company has to pay a higher interest expense that lowers their overall profitability. Lower profits lead to lower cash flows, which lead to a higher required rate of return for investors, all of which lead to a lower valuation for the company&#39;s share price.</p>\n\n<p>Bonds outperform because investors believe rates to remain low or fall further. They&#39;d be able to receive a <strong>&quot;higher&quot; interest rate today versus in the future.</strong> Bonds are typically safer than equity because they are first in-line in the event of a liquidation (bankruptcy) and earn a fixed rate of return. Additionally, the <strong>USD, JPY, CHF</strong> perform well because they are a &#39;safe-haven&#39; currency. The US Dollar is still considered the world&#39;s reserve currency. (Trust in the US Economy/Risk Free) In addition, deflation has a natural increase in the dollar&#39;s value.</p>\n\n<p>The VIX performs well because it&#39;s <strong>essentially a measure of how hedged SPX players are</strong>. If you are expecting deflation in assets - you are expecting prices to drop for the most part - and so you want to be hedged on your long positions (or make straight bear bets).</p>\n\n<p><strong>In Summary</strong></p>\n\n<p>Today, the Federal Reserve has created a low interest rate environment to stimulate the economy; through allowing participants to borrow funds &quot;cheaper&quot; or lower rates. This stimulates demand, supply, borrowing, lending... overall growth. Asset prices are attempting to &quot;price-in&quot; the future state of the economy.</p>\n\n<p>If you believe that inflation is here to stay, then you&#39;d want to shift into risk-assets. If you believe that inflation is &#39;transitory&#39;, then you&#39;d want to move towards safe haven assets. Ultimately, you could assume that the Federal Reserve controls the narrative and that any major movements in the flow of money, cost of debt (change in rates), could have a positive or negative impact on asset prices. In either scenario (in the future), inflation can lead to higher interest rates causing a drop in asset prices or deflation worries can keep interest rates low and fuel the rally for longer than one would expect. I hope that makes sense.</p>\n\n<p>&lt; <em>Risk On &gt;</em></p>\n\n<ul>\n<li>Financials</li>\n<li>Commodities</li>\n<li>Value</li>\n<li>Materials</li>\n<li>AUD/JPY</li>\n<li><strong>Russell 2000</strong></li>\n<li><strong>Dow Jones</strong></li>\n</ul>\n\n<p>&lt; <em>Risk Off &gt;</em></p>\n\n<ul>\n<li>Bonds</li>\n<li>Growth</li>\n<li>Dollar</li>\n<li>VIX</li>\n<li><strong>Nasdaq 100</strong></li>\n</ul>\n\n<h1>IV. Practical Applications</h1>\n\n<p>First let me go over the tickers I watch for each rotation -</p>\n\n<p>&lt; <em>Risk On &gt;</em></p>\n\n<ul>\n<li>YM (DIA)</li>\n<li>RTY (IWM)</li>\n<li>CL (Crude Oil Futures)</li>\n<li>ZC (Corn Futures)</li>\n<li>AUD/JPY</li>\n</ul>\n\n<p><em>&lt; Risk Off &gt;</em></p>\n\n<ul>\n<li>DXY (Dollar Index)</li>\n<li>ZB (30 Year Treasury Bonds)</li>\n<li>TNX (10 Year Treasury Index)</li>\n<li>VIX (The &quot;Fear Index&quot;)</li>\n<li>NQ (QQQ)</li>\n<li>ARKK (This is a bit newer and less common - but I find it useful to track speculative growth names that perform quite well in a deflationary environment)</li>\n</ul>\n\n<p>Glancing at a watchlist of these will give you a quick picture of where money is flowing at the moment - but in order to predict the odds of future movements (and more profitable ones) - I perform technical analysis on all of these names.</p>\n\n<p>Basically - I analyze all the indices and only play the one that is the strongest from a technical standpoint. I further filter these signals and determine position sizing by analyzing their correlated assets.</p>\n\n<p>For instance - if <strong>DIA</strong> is breaking out - and <strong>ZB</strong> is breaking down - this is confluence for a risk on rotation. The more confluence - the higher probability you have of success in any play.</p>\n\n<p>On the contrary, if <strong>DIA</strong> is breaking out - and <strong>ZB</strong> is rallying - this is a sign one of the moves is likely fake - and a signal I have lower odds of success. Subsequently, I want to size smaller.</p>\n\n<p><strong><em>Let&#39;s take a look at one example in which QQQ (Growth, Risk Off) caught the rotation this past May. This is a perfect example of Bonds and Growth moving in unison to provide a high probability long trade in QQQ and TLT. Note: I just use trendlines and volume for my technical analysis. No indicators.</em></strong></p>\n\n<p><a href=\"https://preview.redd.it/fdtd97r9fkg71.png?width=1696&amp;format=png&amp;auto=webp&amp;s=2e7c58fa94c018f4d6fb5b38585a4d474f77b5c6\">NQ (QQQ)</a></p>\n\n<p>The red circle is Nasdaq on <strong>5/13.</strong> You can see that is the day it bottomed - and every day since then pretty much Nasdaq, tech, and risk off assets have been leading. Not only that - but on <strong>6/22</strong> it broke a huge technical setup (the big red line) - which triggered a ton more upside.</p>\n\n<p><a href=\"https://preview.redd.it/cuq89v4hfkg71.png?width=1456&amp;format=png&amp;auto=webp&amp;s=836d02a7fc13c175aebc93f080d705679b0b2f7c\">TLT (ZB)</a></p>\n\n<p>The red circle here is also <strong>5/13.</strong> You can see that is also the day that TLT (ZB or Bonds) bottomed - and every day since then except for the past three days - it&#39;s held the same uptrend. Not only that - but on <strong>6/22</strong> it also broke that big red line - which was a downtrend stemming from last year - triggering more upside here as well. We also broke out of that teal symmetrical triangle, which provided more confluence for the move.</p>\n\n<p>I try to assign a signal strength to each move in order to make it easier for my monkey brain to understand.</p>\n\n<ul>\n<li><strong>Indexes:</strong> 3</li>\n<li><strong>Bonds:</strong> 2</li>\n<li><strong>Everything Else:</strong> 1</li>\n</ul>\n\n<p>You will see a lot of people say bonds are everything - and in my experience that is very true. Last year we had an extremely odd situation where risk parity was fucked - but in recent times it has come back. Correlations almost always revert to the mean at <strong>some point</strong>. Subsequently - you could watch just bonds and the indices and efficiently track the flow of money.</p>\n\n<h1>V. Divergences</h1>\n\n<p>Correlations are not perfect. If they were - everyone would be a billionaire. There are times when we get divergences and things move opposite of the way they usually do. Like I said - they <strong>almost</strong> <strong>always revert to the mean</strong> at some point - but the catch is the divergence could blow your account before it reverts back. If you are good with technicals you can easily spot when a setup you are trying to play breaks down and stop loss accordingly - but the key point here is <strong>always have a stop loss when playing correlations.</strong> Lots of people think they can average down infinitely and eventually profit off the arbitrage that comes with assets reverting to the mean - but <strong>the market can stay irrational longer than you can stay solvent.</strong></p>\n\n<h1>IV. TL;DR</h1>\n\n<p>The main thing to takeaway here is the indices. If QQQ is weak - maybe you want to take a look at DIA. If IWM is sideways - maybe you want to take a look at QQQ. Keep your head on a swivel and don&#39;t be too biased towards one sector. <strong>If you can effectively track the flow of money - you can theoretically catch every rotation.</strong></p>\n\n<p>Also - you don&#39;t have to apply the technicals I do to track it. That&#39;s just my method. Lot&#39;s of people use complex macroeconomic analysis to assess these sorts of things, among other methods. I&#39;m just too smooth brained for that.</p>\n\n<p>I hope this helped you all - and if anyone has questions drop it in the comments.</p>\n\n<p>---</p>\n\n<p>Edit: One final note since I know the more advanced people will likely comment on this. I know QQQ/Growth has not always been risk off - this is a new thing. I was trying to explain things from the perspective of recent times as correlations shift with macroeconomic changes.</p>\n\n<p>We haven&#39;t had a true deflationary environment in over a decade - and subsequently the market rotations have been more about pricing in rate hikes/rate cuts than rotating in and out of equities as a whole.</p>\n</div><!-- SC_ON -->",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "96f6c79e-b853-11e5-a4cb-0ebdf030e05d",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2th52",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#800080",
  "id": "p1x0ls",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "tickerwizards",
  "discussion_type": null,
  "num_comments": 170,
  "send_replies": true,
  "whitelist_status": "some_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/wallstreetbets/comments/p1x0ls/follow_the_money_how_to_catch_every_rotation_and/",
  "parent_whitelist_status": "some_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/wallstreetbets/comments/p1x0ls/follow_the_money_how_to_catch_every_rotation_and/",
  "subreddit_subscribers": 10730587,
  "created_utc": 1628641183,
  "num_crossposts": 5,
  "media": null,
  "is_video": false,
  "original_created_utc": 1628625639,
  "the_new_excerpt": "I. INTRODUCTION\n\nSorry for the wall of text - but if you are serious about trading please read\nthrough this - I think you all could really benefit from a bit of intermarket\nanalysis - and I see way too many victims of ignorance here who could prevent\ntheir losses by understanding these relatively…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "I. イントロダクション\n\n壁のような文章で申し訳ありませんが、もしあなたが真剣にトレーディングに取り組んでいるのであれば、この文章に目を通してください。\n私は皆さんが少しのインターマーケット分析から本当に恩恵を受けることができると思います。\n私は、皆さんが市場間分析から本当に恩恵を受けることができると思います - そして、私はここで、これらの比較的...\nそして、これらを理解することで損失を防ぐことができる無知な犠牲者がここにはあまりにも多くいます...",
      "title": "Follow The Money - すべてのローテーションをキャッチして、ほぼ常にお金を稼ぐ方法"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "I. 简介\n\n很抱歉有这么多的文字 - 但如果你是认真对待交易的，请读完这篇文章。\n我认为你们都可以从一些市场间的分析中受益。\n我在这里看到了太多无知的受害者，他们可以通过了解这些相对较高的价格来避免损失。\n我在这里看到了太多无知的受害者，他们可以通过了解这些相对...",
      "title": "跟着钱走--如何抓住每一次轮动并（几乎）一直赚钱"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "I. 簡介\n\n很抱歉有這麼多的文字 - 但如果你是認真對待交易的，請讀完這篇文章。\n我認爲你們都可以從一些市場間的分析中受益。\n我在這裏看到了太多無知的受害者，他們可以通過了解這些相對較高的價格來避免損失。\n我在這裏看到了太多無知的受害者，他們可以通過了解這些相對...",
      "title": "跟着錢走--如何抓住每一次輪動並（幾乎）一直賺錢"
    }
  ],
  "source_updated_at": 1628847702963
}