{
  "author": "Nuewim",
  "original_created_utc": 1639319341,
  "title": "USA inflation is currently 6.8% and is highest since 1982. Almost 55% of all ever existing dollars were printed in last 3 years. Can we finally stop pretending fiat is in any way safer than crypto?",
  "created_utc": 1639330654,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Many people do not understand that fiat do not hold any value anymore. It always go down. Always. And now it happen much more than most of us  ever experienced in our lives. In recent times inflation is highest since decades and it is just the beginning.&lt;/p&gt;\n\n&lt;p&gt;Before covid, few years ago it was rational to hold fiat and not be all in crypto. With inflation 1.5% or 2% yearly it was still rational decision to diversify and save some money. But it was before  2019 and is not actual info anymore. It was before covid, before huge inflation and printing of few trillions $. Over $4 trillion printed in just 2020.&lt;/p&gt;\n\n&lt;p&gt;Current USA inflation is 6,8% and it is highest  number since 1982&lt;/p&gt;\n\n&lt;p&gt;Current inflation in Venezuela is  around 2700%, your money are literally worth less than paper they are printed on&lt;/p&gt;\n\n&lt;p&gt;Current  inflation  in Argentina:  52%, you would lose half of your savings in just one year&lt;/p&gt;\n\n&lt;p&gt;Current  inflation  Germany  is almost 6% and is highest since 1992 &lt;/p&gt;\n\n&lt;p&gt;Current  inflation in France: 3% highest in 10 years&lt;/p&gt;\n\n&lt;p&gt;Current  inflation in Lebanon 174%&lt;/p&gt;\n\n&lt;p&gt;People that hold large amount of fiat are simmilar to patients that don&amp;#39;t want medical treatment cause it can possibly make their condition worse. But they don&amp;#39;t  understand they will never be healthy without treatment.  They need to risk  to save themselves or in long term they will lose everything anyway.&lt;/p&gt;\n\n&lt;p&gt;Holding fiat is really dangerous. I do not tell invest all in crypto, but at least buy things  that hold value ( furnitures, land, gold &amp;amp; silver), invest in stocks or at least spend those money on things you enjoy: like travels, when they still are worth more than toilet paper. Saving fiat is worst thing anyone can do. Have small emergency fund, but remember richest people do not hold much fiat.  They know it mean losing money. All their money are invested into some assets to increase in value not decrease.&lt;/p&gt;\n\n&lt;p&gt;Crypto unlike fiat at least give you chance to have profits. Crypto can possibly go down, but I will trust all my money BTC or other good project  much more than I would ever trust them USD or any other fiat. Cause crypto can also go up a lot. And chances for crypto going up are actually very big if you chose solid projects. Fiat will never go up, only down. Your fiat become worthless in few years anyway, chose wisely how you want to prevent it. &lt;/p&gt;\n\n&lt;p&gt;Tl;dr Litterally everything is safer than holding Fiat.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 213,
  "permalink": "/r/CryptoCurrency/comments/req3o3/usa_inflation_is_currently_68_and_is_highest/",
  "subreddit": "CryptoCurrency",
  "id": "req3o3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Many people do not understand that fiat do not hold any value anymore. It always\ngo down. Always. And now it happen much more than most of us ever experienced in\nour lives. In recent times inflation is highest since decades and it is just the\nbeginning.\n\nBefore covid, few years ago it was rational…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "多くの人は、フィアットはもう何の価値もないことを理解していない。それは常に\n下がる。常にです そして今、私たちの多くが経験したことのないようなことが起こっています。\n私たちの人生 最近のインフレ率はここ数十年で最も高く、それはまだ始まったばかりです。\n始まりです。\n\nコビド以前、数年前までは合理的だった...",
      "title": "米国のインフレ率は現在6.8％で、1982年以来の高水準となっています。過去3年間で、現存するドルの約55％が印刷されました。不換紙幣が暗号よりも安全であるかのようなふりをするのは、もうやめにしませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "许多人不明白，法币不再具有任何价值。它总是\n下跌。总是如此。而现在发生的事情比我们大多数人一生中经历的都要多。\n我们的生活。近来，通货膨胀率达到了几十年来的最高水平，而这还只是\n开始。\n\n在Covid之前，几年前它是合理的。",
      "title": "美国的通货膨胀率目前为6.8%，是1982年以来最高的。在过去3年中，几乎有55%的美元是印刷出来的。我们终于可以不再假装法币比加密货币更安全了吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "許多人不明白，法幣不再具有任何價值。它總是\n下跌。總是如此。而現在發生的事情比我們大多數人一生中經歷的都要多。\n我們的生活。近來，通貨膨脹率達到了幾十年來的最高水平，而這還只是\n開始。\n\n在Covid之前，幾年前它是合理的。",
      "title": "美國的通貨膨脹率目前爲6.8%，是1982年以來最高的。在過去3年中，幾乎有55%的美元是印刷出來的。我們終於可以不再假裝法幣比加密貨幣更安全了嗎？"
    }
  ]
}