{
  "author": "LindseyNoelle23",
  "original_created_utc": 1633604680,
  "title": "Mass adoption of Bitcoin and other cryptos in Nigeria.",
  "created_utc": 1633646318,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Nigeria is looking like the powerhouse of bitcoin adoption in Africa. And that&#39;s because it is. Nigeria is the largest economy in Africa and one of the largest producers of petroleum in the world. It&#39;s also one of the countries that are most exposed to the emerging cryptocurrency market. 33% of the population of Nigeria uses/owns cryptocurrency which is roughly 61 million people. This results in local businesses adding crypto payment options. The case when mass crypto adoption was started by people! Do you know any other countries apart from Venezuela and Nigeria where Bitcoin is widely acceptable?</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/Bitcoin/comments/q36o6v/mass_adoption_of_bitcoin_and_other_cryptos_in/",
  "subreddit": "Bitcoin",
  "id": "q36o6v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Nigeria is looking like the powerhouse of bitcoin adoption in Africa. And that's\nbecause it is. Nigeria is the largest economy in Africa and one of the largest\nproducers of petroleum in the world. It's also one of the countries that are\nmost exposed to the emerging cryptocurrency market. 33% of the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ナイジェリアは、アフリカにおけるビットコイン導入のパワースポットになりそうです。それは\nそれは、そうだからです。ナイジェリアはアフリカ最大の経済大国で、最大級のガソリン生産国でもあります。\n世界最大級の石油生産国です。アフリカ最大の経済規模を誇り、世界最大級の石油生産国でもあるナイジェリアは、新興のクリプトコインに最も適した国のひとつです。\n新興の暗号通貨市場に最もさらされている国のひとつです。33%の...",
      "title": "ナイジェリアでのビットコインをはじめとする暗号の大量導入。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "尼日利亚看起来像是非洲采用比特币的动力源。而这是\n因为它是。尼日利亚是非洲最大的经济体，也是世界上最大的石油生产国之一。\n世界上最大的石油生产国之一。它也是最容易受到新兴加密货币影响的国家之一。\n在新兴的加密货币市场中暴露得最多。33%的...",
      "title": "在尼日利亚大规模采用比特币和其他加密货币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "尼日利亞看起來像是非洲採用比特幣的動力源。而這是\n因爲它是。尼日利亞是非洲最大的經濟體，也是世界上最大的石油生產國之一。\n世界上最大的石油生產國之一。它也是最容易受到新興加密貨幣影響的國家之一。\n在新興的加密貨幣市場中暴露得最多。33%的...",
      "title": "在尼日利亞大規模採用比特幣和其他加密貨幣。"
    }
  ]
}