{
  "author": "swiftessence",
  "original_created_utc": 1640832265,
  "title": "What caused West Virginia to be a nearly solid blue state since the 1930s to a solid red state by the 1990s?",
  "created_utc": 1640877359,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I know the south shifted Republican after the Civil Rights Act passed in 1964 but West Virginia is more of a mystery to me.  It started out as a state that rebelled against the south and slavery, it&amp;#39;s fairly far north and yet seems to have fallen to a similar pattern.&lt;/p&gt;\n\n&lt;p&gt;So my question is what made it a solid Democrat state since the 1930s to a solid Republican state by the 1990s?  Was it a cultural/economic shift or something else?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/AskHistorians/comments/rrqbzm/what_caused_west_virginia_to_be_a_nearly_solid/",
  "subreddit": "AskHistorians",
  "id": "rrqbzm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I know the south shifted Republican after the Civil Rights Act passed in 1964\nbut West Virginia is more of a mystery to me. It started out as a state that\nrebelled against the south and slavery, it's fairly far north and yet seems to\nhave fallen to a similar pattern.\n\nSo my question is what made it…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1964年に公民権法が可決された後、南部が共和党にシフトしたことは知っている。\nが、ウェストバージニアはもっと不思議なんです。この州は、最初は\n南部と奴隷制に反抗し、かなり北に位置するにもかかわらず、このような\n同じようなパターンに陥ってしまったのです。\n\nそこで質問なのですが、何が原因で...",
      "title": "1930年代からほぼ青い州であったウェストバージニア州が、1990年代には赤い州になった原因は何だったのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道在1964年通过民权法案后，南部地区转向共和党。\n但西弗吉尼亚州对我来说更像是一个谜。它最初是一个反对南方和奴隶制的州。\n它起初是一个反抗南方和奴隶制的州，它的位置相当靠北，但似乎\n然而，它似乎已经落入了一个类似的模式。\n\n所以我的问题是，是什么让它...",
      "title": "是什么原因导致西弗吉尼亚州自1930年代以来几乎是一个纯蓝的州，到1990年代却成了一个纯红的州？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道在1964年通過民權法案後，南部地區轉向共和黨。\n但西弗吉尼亞州對我來說更像是一個謎。它最初是一個反對南方和奴隸制的州。\n它起初是一個反抗南方和奴隸制的州，它的位置相當靠北，但似乎\n然而，它似乎已經落入了一個類似的模式。\n\n所以我的問題是，是什麼讓它...",
      "title": "是什麼原因導致西弗吉尼亞州自1930年代以來幾乎是一個純藍的州，到1990年代卻成了一個純紅的州？"
    }
  ]
}