{
  "author": "d4v1d87",
  "the_new_excerpt": "Which one between TSM, INTC or Samsung electronics could be the better\ninvestment in semiconductors? Currently, TSM is the leader in the sector which a\nmarket share of 80% and they announced an investment of 100 billion for increase\ntheir production capacity; I have read they invented a new nanochip…",
  "original_created_utc": 1621793839,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "TSM、INTC、サムスン電子のうち、どれがより良い半導体投資になり得るか？\n半導体への投資は？現在、TSMはこの分野で80％のシェアを持つリーダーです。\n生産能力増強のために1,000億ドルの投資を発表しました。\n私は、彼らが新しいナノチップを発明したという記事を読んだことがあります...",
      "title": "TSM、INTC、それともサムスン電子？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在TSM、INTC和三星电子之间哪一个可能是更好的\n在半导体方面的投资？目前，TSM是该行业的领导者，市场份额为80%。\n目前，TSM是该行业的领导者，市场份额为80%，他们宣布投资1000亿以提高其生产能力。\n他们的生产能力；我读到他们发明了一种新的纳米芯片......",
      "title": "TSM、INTC还是三星电子？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在TSM、INTC和三星電子之間哪一個可能是更好的\n在半導體方面的投資？目前，TSM是該行業的領導者，市場份額爲80%。\n目前，TSM是該行業的領導者，市場份額爲80%，他們宣佈投資1000億以提高其生產能力。\n他們的生產能力；我讀到他們發明了一種新的納米芯片......",
      "title": "TSM、INTC還是三星電子？"
    }
  ],
  "title": "TSM, INTC or Samsung electronics?",
  "created_utc": 1621806487,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Which one between TSM, INTC or Samsung electronics could be the better investment in semiconductors? Currently, TSM is the leader in the sector which a market share of 80% and they announced an investment of 100 billion for increase their production capacity; I have read they invented a new nanochip and their know how give them an advantage of years compared to competitors; TSM stocks raised more than 1000% in the last 20 years. Intel and Samsung are investing in USA because they want to decrease their addiction of semiconductor from China. Which one of these can be a good long term investment?</p>\n</div><!-- SC_ON -->",
  "score": 147,
  "permalink": "/r/stocks/comments/njdkpf/tsm_intc_or_samsung_electronics/",
  "subreddit": "stocks",
  "id": "njdkpf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197389730
}