{
  "author": "Chicano_Ducky",
  "original_created_utc": 1636260705,
  "title": "The \"world turtle\" was a common belief that the land people lived on was on the back of a giant turtle. It's seen everywhere from Eastern cultures and even Native American ones across the Americas. Why is this?",
  "created_utc": 1636299794,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>How can completely separate cultures that had no contact converge onto the world turtle? I look at the geography and I struggle to see a turtle anywhere. Even North America which was said to be &quot;in the shape of a turtle&quot; looks nothing like a turtle.</p>\n\n<p>Am I taking the &quot;world turtle&quot; too literally or is there something I am missing?</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/AskHistorians/comments/qohguo/the_world_turtle_was_a_common_belief_that_the/",
  "subreddit": "AskHistorians",
  "id": "qohguo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "How can completely separate cultures that had no contact converge onto the world\nturtle? I look at the geography and I struggle to see a turtle anywhere. Even\nNorth America which was said to be \"in the shape of a turtle\" looks nothing like\na turtle.\n\nAm I taking the \"world turtle\" too literally or…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "接触のなかった全く別の文化が、なぜ世界に収斂するのか\nカメ？私は地理的に見て、どこにも亀がいないことに苦労しています。ましてや\n亀の形をしている」と言われていた北米でさえ、亀には見えません。\n亀とは思えない。\n\n私は「世界の亀」を文字通り受け止めすぎているのか、それとも......。",
      "title": "世界の亀」とは、人が住んでいる土地は巨大な亀の背中の上にあるという俗説でした。東洋の文化からアメリカ大陸のネイティブ・アメリカンのものまで、あらゆるところで見られます。これはなぜでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "没有接触过的完全独立的文化，怎么会汇聚到这个世界上呢？\n龟？我看了看地理环境，我很难在任何地方看到乌龟。甚至\n即使是据说 \"形如乌龟 \"的北美洲，看起来也不像\n龟。\n\n是我把 \"世界乌龟 \"看得太重了还是...",
      "title": "世界龟 \"是一种普遍的信念，认为人们居住的土地是在一个巨大的龟背上。从东方文化，甚至美洲各地的原住民文化，到处都能看到它。这是为什么呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "沒有接觸過的完全獨立的文化，怎麼會匯聚到這個世界上呢？\n龜？我看了看地理環境，我很難在任何地方看到烏龜。甚至\n即使是據說 \"形如烏龜 \"的北美洲，看起來也不像\n龜。\n\n是我把 \"世界烏龜 \"看得太重了還是...",
      "title": "世界龜 \"是一種普遍的信念，認爲人們居住的土地是在一個巨大的龜背上。從東方文化，甚至美洲各地的原住民文化，到處都能看到它。這是爲什麼呢？"
    }
  ]
}