{
  "author": "mr_snrub_123",
  "original_created_utc": 1640739177,
  "title": "Why is transracialism seen as less authentic than transgenderism?",
  "created_utc": 1640766769,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;If race and gender are both social constructs, categories society puts us into because of the way we look rather than biological realities about us, then why should one be seen as more authentic than the other? Many of those who claim transracial identities undergo surgery to look more like the race they identify with, it is obviously very important to them. The case is often made that we should refer to trans people by their preferred pronouns as not doing so can negatively impact their mental health. If it were the case that not respecting transracial peoples identities would have a negative effect on their wellbeing then I fail to see why theres a difference. The only argument I’ve really heard against transracialism is that race is a lived experience, therefore someone who was born as white British cannot truly know what it’s like to be Korean. Switch out “white British” to “man” and “Korean” to “woman” and it’s the same argument trans exclusionary feminists use as far as I can tell. I’m certain I haven’t heard all the arguments either way and my mind is far from being made, looking forward to an interesting discussion below. Thanks!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/askphilosophy/comments/rqupvb/why_is_transracialism_seen_as_less_authentic_than/",
  "subreddit": "askphilosophy",
  "id": "rqupvb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "If race and gender are both social constructs, categories society puts us into\nbecause of the way we look rather than biological realities about us, then why\nshould one be seen as more authentic than the other? Many of those who claim\ntransracial identities undergo surgery to look more like the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もし、人種と性別がともに社会的構築物であり、社会が私たちをカテゴリーに分類するものだとしたら\n生物学的な現実というより、見た目で判断してしまうのです。\n一方は他方より本物であるとみなされるべきなのでしょうか？多くの人は\nトランスレーショナルアイデンティティは、より似せるために手術を受ける。",
      "title": "なぜトランスジェンダーよりもトランスレイシズムの方が信憑性が低いと見られているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果种族和性别都是社会建构，是社会将我们归类为\n而不是我们的生物学现实，那么为什么\n为什么其中一个应该被视为比另一个更真实？许多人声称\n许多声称具有跨种族身份的人都接受了手术，以使自己看起来更像......",
      "title": "为什么跨种族主义被视为不如跨性别主义那样真实？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果種族和性別都是社會建構，是社會將我們歸類爲\n而不是我們的生物學現實，那麼爲什麼\n爲什麼其中一個應該被視爲比另一個更真實？許多人聲稱\n許多聲稱具有跨種族身份的人都接受了手術，以使自己看起來更像......",
      "title": "爲什麼跨種族主義被視爲不如跨性別主義那樣真實？"
    }
  ]
}