{
  "author": "Johnblr",
  "the_new_excerpt": "U.S. job growth picked up in May and the unemployment rate fell, signaling firms\nare making some progress filling a record number of openings as the economy\npowers up.\n\nPayrolls increased by 559,000 last month after a revised 278,000 gain in April,\naccording to a Labor Department report Friday. The…",
  "original_created_utc": 1622812044,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "米国では、5月に雇用が回復し、失業率が低下したことにより、企業の人材確保が進んでいる。\n景気の回復に伴い、企業は記録的な数の求人に対応しており、一定の成果を上げている。\n景気の回復に伴い、企業が記録的な数の求人数を満たしつつあることを示している。\n\n4月の雇用者数は27万8,000人でしたが、5月は55万9,000人増加しました。\n金曜日に発表された労働省の報告によると、雇用者数は55万9千人増加しました。雇用者数は",
      "title": "米国の雇用成長率は4月に続いて5月にも回復した"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "美国5月份的就业增长有所回升，失业率下降，这表明随着经济的发展，企业在填补创纪录的空缺方面取得了一些进展。\n随着经济的发展，企业在填补创纪录的职位空缺方面取得了一些进展。\n增长的动力。\n\n根据劳工部周五的报告，在4月份修正后的27.8万个就业岗位之后，上个月的就业人数增加了55.9万。\n根据劳工部周五的报告。劳工部的报告显示，上个月的就业人数增加了55.9万人。",
      "title": "美国就业增长在4月令人失望后5月有所回升"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "美國5月份的就業增長有所回升，失業率下降，這表明隨着經濟的發展，企業在填補創紀錄的空缺方面取得了一些進展。\n隨着經濟的發展，企業在填補創紀錄的職位空缺方面取得了一些進展。\n增長的動力。\n\n根據勞工部週五的報告，在4月份修正後的27.8萬個就業崗位之後，上個月的就業人數增加了55.9萬。\n根據勞工部週五的報告。勞工部的報告顯示，上個月的就業人數增加了55.9萬人。",
      "title": "美國就業增長在4月令人失望後5月有所回升"
    }
  ],
  "title": "U.S. Job Growth Picked Up Steam in May After Disappointing April",
  "created_utc": 1622837500,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>U.S. job growth picked up in May and the unemployment rate fell, signaling firms are making some progress filling a record number of openings as the economy powers up.</p>\n\n<p>Payrolls increased by 559,000 last month after a revised 278,000 gain in April, according to a Labor Department report Friday. The median estimate in a Bloomberg survey of economists was for a 675,000 rise. The jobless rate dropped to 5.8%, while the labor participation rate was little changed.</p>\n\n<p>Long-term Treasury yields are little changed, the dollar declined and U.S. stock futures moved higher.</p>\n\n<p>The payrolls gain leaves the U.S. labor market 7.6 million jobs short of pre-pandemic levels. A broader improvement in the labor market requires faster job growth among service providers, like the leisure and hospitality industry, that have suffered a more lengthy disruption from the health crisis.</p>\n\n<p><strong>Source:</strong> <a href=\"https://www.bloomberg.com/news/articles/2021-06-04/u-s-job-growth-picked-up-steam-in-may-after-disappointing-april?srnd=premium\">https://www.bloomberg.com/news/articles/2021-06-04/u-s-job-growth-picked-up-steam-in-may-after-disappointing-april?srnd=premium</a></p>\n</div><!-- SC_ON -->",
  "score": 70,
  "permalink": "/r/stocks/comments/ns4pf4/us_job_growth_picked_up_steam_in_may_after/",
  "subreddit": "stocks",
  "id": "ns4pf4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404886630
}