{
  "author": "AskScienceModerator",
  "the_new_excerpt": "Hi Reddit!\n\nI'm a Senior Fellow of the Woods Institute for the Environment and of the\nPrecourt Institute for Energy. I have published three textbooks and over 160\npeer-reviewed journal articles.\n\nI've also served on an advisory committee to the U.S. Secretary of Energy and\ncofounded The Solutions…",
  "original_created_utc": 1616065256,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "嗨，雷迪特！我是伍兹环境研究所的高级研究员。\n\n我是伍兹环境研究所的高级研究员，也是伍兹环境研究所的高级研究员。\nPrecourt能源研究所。我已经出版了三本教科书和160多本\n同行评审的期刊文章。\n\n我还曾在美国能源部部长的咨询委员会任职，并在美国能源部部长的指导下，为美国能源部部长的工作提供建议。\n共同创办了解决方案...",
      "title": "AskScience AMA系列。我是马克・雅各布森， 大气/能源项目主任 和教授 土木和环境工程 在斯坦福大学，和作者 100％清洁，可再生能源 和存储的一切。关于气候变化和可再生能源的AMA!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嗨，雷迪特！我是伍茲環境研究所的高級研究員。\n\n我是伍茲環境研究所的高級研究員，也是伍茲環境研究所的高級研究員。\nPrecourt能源研究所。我已經出版了三本教科書和160多本\n同行評審的期刊文章。\n\n我還曾在美國能源部部長的諮詢委員會任職，並在美國能源部部長的指導下，爲美國能源部部長的工作提供建議。\n共同創辦瞭解決方案...",
      "title": "AskScience AMA系列。我是馬克・雅各布森， 大氣/能源項目主任 和教授 土木和環境工程 在斯坦福大學，和作者 100％清潔，可再生能源 和存儲的一切。關於氣候變化和可再生能源的AMA!"
    }
  ],
  "title": "AskScience AMA Series: I'm Mark Jacobson, Director of the Atmosphere/Energy program and Professor of Civil and Environmental Engineering at Stanford University, and author of 100% Clean, Renewable Energy and Storage for Everything. AMA about climate change and renewable energy!",
  "created_utc": 1616073995,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi Reddit!</p>\n\n<p>I&#39;m a Senior Fellow of the Woods Institute for the Environment and of the Precourt Institute for Energy. I have published three textbooks and over 160 peer-reviewed journal articles.</p>\n\n<p>I&#39;ve also served on an advisory committee to the U.S. Secretary of Energy and cofounded The Solutions Project. My research formed the scientific basis of the Green New Deal and has resulted in laws to transition electricity to 100% renewables in numerous cities, states, and countries. Before that, I found that black carbon may be the second-leading cause of global warming after CO2. I am here to discuss these and other topics covered in my new book, &quot;100% Clean, Renewable Energy and Storage for Everything,&quot; published by Cambridge University Press.</p>\n\n<p>Ask me anything about:</p>\n\n<ul>\n<li>The Green New Deal</li>\n<li>Renewable Energy</li>\n<li>Environmental Science</li>\n<li>Earth Science</li>\n<li>Global Warming</li>\n</ul>\n\n<p>I&#39;ll be here, from 12-2 PM PDT  / 3-5 PM EDT (19-21 UT) on March 18th, Ask Me Anything!</p>\n\n<p>Username: <a href=\"/u/Mark_Jacobson\">/u/Mark_Jacobson</a></p>\n</div><!-- SC_ON -->",
  "score": 141,
  "permalink": "/r/askscience/comments/m7ocl9/askscience_ama_series_im_mark_jacobson_director/",
  "subreddit": "askscience",
  "id": "m7ocl9",
  "is_self": true,
  "media": null,
  "is_video": false
}