{
  "author": "HondaHoff",
  "original_created_utc": 1632419969,
  "title": "Why do we normalize getting fat?",
  "created_utc": 1632462809,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Im a 25M and live in the deep south.  Im 6&#39;2 @~180lbs.  I live an active lifestyle and eat clean.  Almost all of my coworkers ridicule me for bringing a salad to lunch, walking on my break, etc.  Im always being told to stop trying so hard, your metabolism will catch up to you, you&#39;re eating what food eats, etc.  </p>\n\n<p>No one seems to mind bashing me, but the second i bring up their habbits: drinking soda constantly, eating nothing but fast food and sugar, clocking out and living on the couch, etc. they get immediately defense, like im verbally attacking them.</p>\n\n<p>When I bring up that they do the same thing to me, they say its apples to oranges or some other bullshit.  What&#39;s the deal?</p>\n</div><!-- SC_ON -->",
  "score": 131,
  "permalink": "/r/TooAfraidToAsk/comments/pu0vpp/why_do_we_normalize_getting_fat/",
  "subreddit": "TooAfraidToAsk",
  "id": "pu0vpp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Im a 25M and live in the deep south. Im 6'2 @~180lbs. I live an active lifestyle\nand eat clean. Almost all of my coworkers ridicule me for bringing a salad to\nlunch, walking on my break, etc. Im always being told to stop trying so hard,\nyour metabolism will catch up to you, you're eating what food…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は25Mで、ディープサウスに住んでいます。私は6フィート2インチで180ポンドです。アクティブな生活をしています。\nクリーンな食事をしています。同僚のほとんどは、ランチにサラダを持ってくることを嘲笑します。\nランチにサラダを持ってきたり、休憩中に歩いたりしていると、同僚から嘲笑されます。頑張るのはやめようといつも言われています。\n頑張らなくても代謝が追いついてくるし、どんなものを食べているのか...。",
      "title": "なぜ、太ることが当たり前になっているのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个25岁的人，住在南部深处。我身高6英尺2英寸，体重180磅。我的生活方式很活跃\n而且吃得很干净。几乎所有的同事都嘲笑我在午餐时带沙拉，在休息时散步等等。\n几乎所有的同事都嘲笑我在午餐时带沙拉，在休息时散步，等等。我总是被告知不要再那么努力了。\n你的新陈代谢会赶上你，你吃的是什么食物......",
      "title": "为什么我们将变胖视为正常？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個25歲的人，住在南部深處。我身高6英尺2英寸，體重180磅。我的生活方式很活躍\n而且喫得很乾淨。幾乎所有的同事都嘲笑我在午餐時帶沙拉，在休息時散步等等。\n幾乎所有的同事都嘲笑我在午餐時帶沙拉，在休息時散步，等等。我總是被告知不要再那麼努力了。\n你的新陳代謝會趕上你，你喫的是什麼食物......",
      "title": "爲什麼我們將變胖視爲正常？"
    }
  ]
}