{
  "author": "Grandpamemer",
  "original_created_utc": 1645130538,
  "title": "EL Salvador started using bitcoin. Arizona trying to pass bills to use bitcoin. Ukraine just legalized bitcoin. Other US states trying to get on with bitcoin. Staples arena is now CRYPTO ARENA. Bitcoin is.........down",
  "created_utc": 1645166627,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;EVERY TIME there is good news about bitcoin its in the red. Is this not proof that the whole market is manipulated by something other than adoption? Think about every time there has been good or GREAT news about bitcoin. Its almost ALWAYS red. At this point if amazon took bitcoin today I can see the price dropping.&lt;/p&gt;\n\n&lt;p&gt;We all want adoption but it seems to be the Achilles heel of bitcoin. Not even to mention the purpose of bitcoin is to fight inflation and our inflation in the US is getting worse and worse and what&amp;#39;s bitcoin doing.............................&lt;/p&gt;\n\n&lt;p&gt;You guessed it&lt;/p&gt;\n\n&lt;p&gt;its gone down.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 340,
  "permalink": "/r/CryptoCurrency/comments/suyrvc/el_salvador_started_using_bitcoin_arizona_trying/",
  "subreddit": "CryptoCurrency",
  "id": "suyrvc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "EVERY TIME there is good news about bitcoin its in the red. Is this not proof\nthat the whole market is manipulated by something other than adoption? Think\nabout every time there has been good or GREAT news about bitcoin. Its almost\nALWAYS red. At this point if amazon took bitcoin today I can see…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコインに関する良いニュースがあるたびに、赤字になります。これは証拠ではないでしょうか。\n市場全体が、採用以外の何かによって操作されているということでしょうか。考える\nビットコインに関する良いニュース、または素晴らしいニュースがあるたびに。そのほとんど\nいつも赤字です。もし今日、amazonがビットコインを手に入れたら...",
      "title": "ELサルバドールがビットコインの利用を開始。アリゾナ州はビットコインを使うための法案を通そうとしている。ウクライナはビットコインを合法化したばかり。他のアメリカの州もビットコインを使おうとしている。ステイプルズ・アリーナがCRYPTO ARENAになりました。ビットコインは............下降中"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "每次有关于比特币的好消息时，它都是红色的。这难道不是证明\n整个市场被其他东西操纵着，而不是通过？想想看\n每当有关于比特币的好消息或大好消息时。它几乎\n总是红色的。在这一点上，如果亚马逊今天拿下比特币，我可以看到...",
      "title": "萨尔瓦多开始使用比特币。亚利桑那州试图通过法案来使用比特币。乌克兰刚刚将比特币合法化。美国其他州也在尝试使用比特币。斯台普斯竞技场现在是CRYPTO ARENA。比特币是.........down"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "每次有關於比特幣的好消息時，它都是紅色的。這難道不是證明\n整個市場被其他東西操縱着，而不是通過？想想看\n每當有關於比特幣的好消息或大好消息時。它幾乎\n總是紅色的。在這一點上，如果亞馬遜今天拿下比特幣，我可以看到...",
      "title": "薩爾瓦多開始使用比特幣。亞利桑那州試圖通過法案來使用比特幣。烏克蘭剛剛將比特幣合法化。美國其他州也在嘗試使用比特幣。斯臺普斯競技場現在是CRYPTO ARENA。比特幣是.........down"
    }
  ]
}