{
  "author": "harjeet_hellboy321",
  "original_created_utc": 1624551091,
  "title": "Just a quick reminder of why Bitcoin was invented in the first place. This used to be preaching to the choir. But these days all people care about is the price.",
  "created_utc": 1624589101,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><ul>\n<li>People used to pay each other in gold and silver. Difficult to transport. Difficult to divide.</li>\n<li>Paper money was invented. A claim to gold in a bank vault. Easier to transport and divide.</li>\n<li>Banks gave out more paper money than they had gold in the vault. They ran “fractional reserves”. A real money maker. But every now and then, banks collapsed because of runs on the bank.</li>\n<li>Central banking was invented. Central banks would be lenders of last resort. Runs on the bank were thus mitigated by banks guaranteeing each other’s deposits through a central bank. The risk of a bank run was not lowered. Its frequency was diminished and its impact was increased. After all, banks remained basically insolvent in this fractional reserve scheme.</li>\n<li>Banks would still get in trouble. But now, if one bank got insufficient trouble, they would all be in trouble at the same time. Governments would have to step in to save them.</li>\n<li>All ties between the financial system and gold were severed in 1971 when Nixon decided that the USD would no longer be exchangeable for a fixed amount of gold. This exacerbated the problem because there was now effectively no limit anymore on the amount of paper money that banks could create.</li>\n<li>From this moment on, all money was created as credit. Money ceased to be supported by an asset. When you take out a loan, money is created and lent to you. Banks expect this freshly minted money to be returned to them with interest. Sure, banks need to keep adequate reserves. But these reserves basically consist of the same credit-based money. And reserves are much lower than the loans they make.</li>\n<li>This led to an explosion in the money supply. The Federal Reserve stopped reporting M3 in 2006. But the ECB currently reports a yearly increase in the supply of the euro of about 5%.</li>\n<li>This leads to a yearly increase in prices. The price increase is somewhat lower than the increase in the money supply. This is because of increased productivity. Society gets better at producing stuff cheaper all the time. So, in absence of money creation, you would expect prices to drop every year. That they don’t is the effect of money creation.</li>\n<li>What remains is an inflation rate in the 2% range.</li>\n<li>Banks have discovered that they can siphon off all the productivity increase + 2% every year, without people complaining too much. They accomplish this currently by increasing the money supply by 5% per year, getting this money returned to them at interest.</li>\n<li>Apart from this insidious tax on society, banks take society hostage every couple of years. In case of a financial crisis, banks need bailouts or the system will collapse.</li>\n<li>Apart from these problems, banks and governments are now striving to do away with cash. This would mean that no two free men would be able to exchange money without intermediation by a bank. If you believe that to transact with others is a fundamental right, this should scare you.</li>\n<li>The absence of sound money was at the root of the problem. We were force-fed paper money because there were no good alternatives. Gold and silver remain difficult to use.</li>\n<li>When it was tried to launch a private currency backed by precious metals (Liberty dollar), this initiative was shut down because it undermined the U.S. currency system. Apparently, a currency alternative could only thrive if “nobody” launched it and if they was no central point of failure.</li>\n<li>What was needed was a peer-to-peer electronic cash system. This was what Satoshi Nakamoto described in 2008. It was a response to all the problems described above. That is why he labeled the genesis block with the text: “03/Jan/2009 Chancellor on brink of second bailout for banks.”. Bitcoin was meant to be an alternative to our current financial system.</li>\n</ul>\n\n<p>So, if you find yourself religiously checking some cryptocurrency’s price, or bogged down in discussions about the “one true bitcoin”, or constantly asking what currency to buy, please at least remember that we have bigger fish to fry.</p>\n\n<p>We are here to fix the financial system.</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/CryptoCurrency/comments/o742qf/just_a_quick_reminder_of_why_bitcoin_was_invented/",
  "subreddit": "CryptoCurrency",
  "id": "o742qf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": " * People used to pay each other in gold and silver. Difficult to transport.\n   Difficult to divide.\n * Paper money was invented. A claim to gold in a bank vault. Easier to\n   transport and divide.\n * Banks gave out more paper money than they had gold in the vault. They ran\n   “fractional reserves”.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": " * 昔の人は金や銀で支払いをしていました。運ぶのが難しい。\n   分けにくい。\n * 紙幣が発明された。銀行の金庫に入っている金に対する請求権です。輸送や分割が容易な\n   運ぶのも分けるのも簡単です。\n * 銀行は金庫にある金よりも多くの紙幣を配りました。彼らは\n   \"フラクショナル・リザーブ」....",
      "title": "そもそもなぜビットコインが発明されたのか、ちょっと思い出してみましょう。これはかつては聖職者に説くことでした。しかし、最近では人々が気にするのは価格だけです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": " * 人们习惯用金银来支付对方。难以运输。\n   难以分割。\n * 纸币被发明了。对银行金库中的黄金提出要求。更容易\n   更容易运输和分割。\n * 银行发放的纸币比他们金库里的黄金还要多。他们运行\n   \"部分储备\"....",
      "title": "只是简单提醒一下，为什么当初要发明比特币。这曾经是对唱诗班的说教。但这些天来，人们关心的只是价格。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": " * 人們習慣用金銀來支付對方。難以運輸。\n   難以分割。\n * 紙幣被髮明瞭。對銀行金庫中的黃金提出要求。更容易\n   更容易運輸和分割。\n * 銀行發放的紙幣比他們金庫裏的黃金還要多。他們運行\n   \"部分儲備\"....",
      "title": "只是簡單提醒一下，爲什麼當初要發明比特幣。這曾經是對唱詩班的說教。但這些天來，人們關心的只是價格。"
    }
  ]
}