{
  "author": "DoItYrselfLiberation",
  "original_created_utc": 1625891732,
  "title": "Invest in fundamentals and you'll sleep well at night.",
  "created_utc": 1625931226,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If you&#39;re buying meme coins with no real use or value just because other people are doing the same thing then of course you&#39;ll freak out when prices drop.  You&#39;re gambling on a ponzi scheme.</p>\n\n<p>The analogy that Warren Buffett uses is that you own a productive farm.  You understand farming and you have a general idea of what your farm is worth, and you also have a crazy alcoholic neighbor who keeps offering you a different price for your farm each day.  Why would you sell your farm to your neighbor just because you think that he&#39;ll offer you a lower price tomorrow?  Why would you buy your neighbor&#39;s farm just because you think that he&#39;ll ask for a higher price tomorrow?  It&#39;s the wrong mindset.</p>\n\n<p>Do your research.  Does your coin have a working product, a solid use-case, and a team you can trust?  Is it at a price below what you believe its actual value to be, or to be in the future?  That&#39;s how you know whether to buy or not, and then it doesn&#39;t really matter how the market shifts.  You just wait until your coin is at or above what you think it is fundamentally worth and then you sell.  Simple :)</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/ohc0wr/invest_in_fundamentals_and_youll_sleep_well_at/",
  "subreddit": "CryptoCurrency",
  "id": "ohc0wr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "If you're buying meme coins with no real use or value just because other people\nare doing the same thing then of course you'll freak out when prices drop.\nYou're gambling on a ponzi scheme.\n\nThe analogy that Warren Buffett uses is that you own a productive farm. You\nunderstand farming and you have a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "他の人が同じことをしているからといって、実際には使い道も価値もないミームコインを買っていたら\n他の人が同じことをしているからといって、実際には使い道も価値もないミームコインを買っていたら、当然、価格が下がったらパニックになりますよね。\nあなたはネズミ講のギャンブルをしているのです。\n\nウォーレン・バフェットの例えでは、生産性の高い農場を所有しているとします。あなたは\nあなたは農業を理解しているし、あなたが持っているのは...",
      "title": "ファンダメンタルズに投資すれば、夜もぐっすり眠れます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你购买没有实际用途或价值的纪念币，只是因为其他人在做同样的事情\n如果你购买没有实际用途或价值的纪念币，只是因为其他人在做同样的事情，那么当价格下跌时，你当然会抓狂。\n你是在赌一个庞氏骗局。\n\n沃伦-巴菲特使用的比喻是，你拥有一个生产性农场。你\n你了解耕作，你有一个...",
      "title": "投资于基本面，你会在晚上睡得很好。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你購買沒有實際用途或價值的紀念幣，只是因爲其他人在做同樣的事情\n如果你購買沒有實際用途或價值的紀念幣，只是因爲其他人在做同樣的事情，那麼當價格下跌時，你當然會抓狂。\n你是在賭一個龐氏騙局。\n\n沃倫-巴菲特使用的比喻是，你擁有一個生產性農場。你\n你瞭解耕作，你有一個...",
      "title": "投資於基本面，你會在晚上睡得很好。"
    }
  ]
}