{
  "author": "vret1414",
  "original_created_utc": 1635754914,
  "title": "Bitcoin found in old harddrive for Bitcoin Core",
  "created_utc": 1635773550,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey guys i have recently found my old harddrive down in my basement and when I opened it I managed to find a folder with alot of videos photos and personal files and I managed to find something very valuable. My fathers wallet was in my personal files because back then we only had 1 computer which was shared among our family. My father sadly passed away in 2017 and the wallet has fallen into my hands and it has alot of bitcoin in it (I won&#39;t disclose how much bitcoin, but it&#39;s REALLY valuable). I have let the wallet sync for about 2 1/2 weeks now and sadly its stuck at 88% and doesn&#39;t seem like it wants to move, any Idea on what I should do?  </p>\n\n<p>The wallet is MultiBit HD<br/>\nI have the information such as the seed and passcode.  </p>\n\n<p>I hope I can get some help from here.</p>\n</div><!-- SC_ON -->",
  "score": 161,
  "permalink": "/r/Bitcoin/comments/qk9ggl/bitcoin_found_in_old_harddrive_for_bitcoin_core/",
  "subreddit": "Bitcoin",
  "id": "qk9ggl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hey guys i have recently found my old harddrive down in my basement and when I\nopened it I managed to find a folder with alot of videos photos and personal\nfiles and I managed to find something very valuable. My fathers wallet was in my\npersonal files because back then we only had 1 computer which…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、地下室で私の古いハードディスクを見つけました。\n開いてみると、ビデオや写真、個人的なファイルがたくさん入ったフォルダが見つかりました。\nそして、とても貴重なものを見つけることができました。個人ファイルの中には父親の財布が入っていました。\n私の個人ファイルの中には、父の財布が入っていました。なぜなら当時、私たちは1台のコンピュータしか持っていなかったので...",
      "title": "Bitcoin Coreの古いハードディスクにビットコインを発見"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嘿，伙计们，我最近发现我的旧硬盘在我的地下室，当我\n当我打开它时，我设法找到了一个文件夹，里面有很多视频、照片和个人文件。\n我设法找到了一些非常有价值的东西。我父亲的钱包就在我的\n个人文件中，因为那时我们只有一台电脑，...",
      "title": "在Bitcoin Core的旧硬盘中发现比特币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嘿，夥計們，我最近發現我的舊硬盤在我的地下室，當我\n當我打開它時，我設法找到了一個文件夾，裏面有很多視頻、照片和個人文件。\n我設法找到了一些非常有價值的東西。我父親的錢包就在我的\n個人文件中，因爲那時我們只有一臺電腦，...",
      "title": "在Bitcoin Core的舊硬盤中發現比特幣"
    }
  ]
}