{
  "author": "rmczpp",
  "original_created_utc": 1636548078,
  "title": "Ethereum Classic and Bitcoin Cash are pumping...which means the latest batch of noob retail investors have finally arrived!",
  "created_utc": 1636559224,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I think many of you would consider Ethereum Classic a terrible investment, considering (1) it was the result of a hack, and (2) the hacker still has their bags of ETC available, which they periodically dump on unsuspecting investors. Bitcoin Cash doesn&#39;t have such a problematic origin, but might also be considered an unwise purchase given the lack of usage and development compared to BTC and other good projects.</p>\n\n<p>So, when I open the charts and see that specifically BCH and ETC have been pumping hard for the last couple of days, my only conclusion is that new retail investment money has arrived and these noobs are dropping cash on &#39;cheaper&#39; projects with the name Bitcoin and Ethereum in it. I should know, I did this exact thing myself earlier this year!</p>\n\n<p>Here&#39;s hoping this signals the start of a another massive pump too.</p>\n\n<p>Edit: spelling</p>\n</div><!-- SC_ON -->",
  "score": 1297,
  "permalink": "/r/CryptoCurrency/comments/qqtjjn/ethereum_classic_and_bitcoin_cash_are/",
  "subreddit": "CryptoCurrency",
  "id": "qqtjjn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I think many of you would consider Ethereum Classic a terrible investment,\nconsidering (1) it was the result of a hack, and (2) the hacker still has their\nbags of ETC available, which they periodically dump on unsuspecting investors.\nBitcoin Cash doesn't have such a problematic origin, but might…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "イーサリアムクラシックは、多くの人がひどい投資だと思っていると思います。\n(1)ハッキングの結果であること、(2)ハッカーがまだETCのバッグを持っていること、を考えると、ひどい投資だと思う。\n2）ハッカーはまだETCの袋を持っていて、疑うことを知らない投資家に定期的に投売りしています。\nビットコインキャッシュにはそのような問題はありませんが、もしかしたら...。",
      "title": "イーサリアムクラシックとビットコインキャッシュが汲み上げられている...ということは、最新のノッブな個人投資家たちがついに登場したということだ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想你们中的许多人会认为Ethereum Classic是一项糟糕的投资。\n考虑到（1）它是黑客攻击的结果，以及（2）黑客仍然拥有他们的\n袋子里的ETC，他们定期向毫无戒心的投资者倾销。\n比特币现金没有这样的问题起源，但可能...",
      "title": "以太坊经典和比特币现金正在抽水......这意味着最新一批无知的散户投资者终于来了!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想你們中的許多人會認爲Ethereum Classic是一項糟糕的投資。\n考慮到（1）它是黑客攻擊的結果，以及（2）黑客仍然擁有他們的\n袋子裏的ETC，他們定期向毫無戒心的投資者傾銷。\n比特幣現金沒有這樣的問題起源，但可能...",
      "title": "以太坊經典和比特幣現金正在抽水......這意味着最新一批無知的散戶投資者終於來了!"
    }
  ]
}