{
  "author": "jsheppy16",
  "the_new_excerpt": "It is done. My stack has been sold.\n\nI've been here since before the 2017 bull run and I told myself once I rebuilt\nmy stack, I wouldn't make the same mistake again. This feels weird. I became so\nattached to this community, but I knew eventually I would have to make an\nuncomfortable decision. This…",
  "original_created_utc": 1618859268,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "終わった。私のスタックは売られました。\n\n私は2017年のブルランの前からここにいて、一度自分のスタックを再構築したときに自分に言い聞かせました。\n自分のスタックを再構築したら、同じ過ちを繰り返さないと自分に言い聞かせていました。これは変な気分です。私はこのコミュニティにとても\nこのコミュニティに愛着を持ちましたが、最終的には不愉快な決断をしなければならないことがわかっていました。\n不愉快な決断をしなければならないと思っていました。これは...",
      "title": "I BID YOU FARewell - For Now"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "它是完成了。我的堆栈已经卖掉了。\n\n我从2017年牛市之前就在这里了，我告诉自己，一旦我重建了。\n我的堆栈，我不会再犯同样的错误。这感觉很奇怪。我变得如此\n但我知道最终我还是要做一个。\n不舒服的决定。这...",
      "title": "我向你告别--暂时的"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "它是完成了。我的堆棧已經賣掉了。\n\n我從2017年牛市之前就在這裏了，我告訴自己，一旦我重建了。\n我的堆棧，我不會再犯同樣的錯誤。這感覺很奇怪。我變得如此\n但我知道最終我還是要做一個。\n不舒服的決定。這...",
      "title": "我向你告別--暫時的"
    }
  ],
  "title": "I Bid You Farewell - For Now",
  "created_utc": 1618911009,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It is done. My stack has been sold.</p>\n\n<p>I&#39;ve been here since before the 2017 bull run and I told myself once I rebuilt my stack, I wouldn&#39;t make the same mistake again. This feels weird. I became so attached to this community, but I knew eventually I would have to make an uncomfortable decision. This thing could go 5x from here for all I know, but I now must embrace my decision.</p>\n\n<p>Good luck to all of you. I hope you all get to make a decision this uncomfortable sometime soon.</p>\n\n<p>PS: I&#39;ll be back</p>\n</div><!-- SC_ON -->",
  "score": 200,
  "permalink": "/r/CryptoCurrency/comments/mu7ywe/i_bid_you_farewell_for_now/",
  "subreddit": "CryptoCurrency",
  "id": "mu7ywe",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171521489
}