{
  "author": "CMADBF",
  "original_created_utc": 1628206318,
  "title": "IMO, the dumbest move you can make in crypto is telling anyone when you have success. LIE to everyone that is not the IRS.",
  "created_utc": 1628278736,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The headline might be off putting at first but let me explain:</p>\n\n<p>I think about it every single day. What would I do if I woke up to my portfolio hitting my target price? I would tell my wife to quit her job and I would put in my 2 weeks with my employer.</p>\n\n<p>To my employer: I would politely tell them that I need to quit my job in oder to “find myself” \nsaying something along the lines of needing some “soul searching”. \nIt comes across professionally neutral yet ambiguous. Most importantly, it leaves them guessing without burning any bridges or bad blood- just in case things go belly up.</p>\n\n<p>To my family: I would tell them I took up a an opportunity of a lifetime within my company, a dream position that sounds too good to be true, because it is. This “dream job” would allow me to travel the world and financially provide me the means to justify any bigger purchases like a home or providing for a child. </p>\n\n<p>To everyone else: They’ll see what they see with whatever I decide to share online with my new found freedom and travel. Honestly, I would most likely fall of socially- at least for a while. \nNow if someone really presses me for details, I would vaguely regurgitate what I originally told my family but with even less details. </p>\n\n<p>If anyone asks if I’m still invested in crypto, i’ll tell them all I sold before it pumped and how I’ll kick myself every day for doing so. </p>\n\n<p>You may be asking, would I go to all this trouble? Because fuck them!- respectfully. </p>\n\n<p>Having money can change a lot in your life, including how people see and treat you; your family unfortunately isn’t immune from this. All of a sudden you become an ATM. You’re seen as a resource, a safety net. Random people old and new start wanting to be your “friend”, or you might start getting phone calls from family members you haven’t heard from in years. You don’t want to end up in this position. It’s emotionally exhausting and potentially causing irreversible damage with those you love. </p>\n\n<p>This isn’t always the case, but more often then not, if you tell people you have money, especially if you’re young, or if you live recklessly, not staying in your lane, then you’ll quickly find yourself back in your old cubicle. </p>\n\n<p>Stay humble, stay hungry, keep DCA’ing and when you sell, don’t say a fucking word. </p>\n\n<p>I wish you all much success and happiness for many cycles to come.</p>\n</div><!-- SC_ON -->",
  "score": 159,
  "permalink": "/r/CryptoCurrency/comments/oyum3o/imo_the_dumbest_move_you_can_make_in_crypto_is/",
  "subreddit": "CryptoCurrency",
  "id": "oyum3o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The headline might be off putting at first but let me explain:\n\nI think about it every single day. What would I do if I woke up to my portfolio\nhitting my target price? I would tell my wife to quit her job and I would put in\nmy 2 weeks with my employer.\n\nTo my employer: I would politely tell them…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この見出しは、最初は違和感があるかもしれませんが、説明しましょう。\n\n私は毎日、このことを考えています。目覚めたときに、自分のポートフォリオが目標価格に達していたらどうしよう？\n自分のポートフォリオが目標価格に達していたらどうしますか？私は妻に仕事を辞めるように言い、電子メールで2週間の休暇を取るでしょう。\n雇い主に2週間の猶予を与えます。\n\n雇い主に。私は丁寧に彼らに言うでしょう...",
      "title": "IMOは、暗号化において最も愚かな行動は、成功したときに誰かに話すことだと考えています。IRS以外の人には嘘をつきましょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这个标题一开始可能会让人不舒服，但让我解释一下。\n\n我每天都在思考这个问题。如果我一觉醒来发现我的投资组合\n达到我的目标价格，我会怎么做？我会告诉我的妻子辞掉她的工作，我将投入到\n我将与我的雇主共度两周。\n\n对我的雇主来说。我会礼貌地告诉他们...",
      "title": "IMO，你在加密货币中最愚蠢的举动是在你获得成功时告诉任何人。对所有不是国税局的人撒谎。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個標題一開始可能會讓人不舒服，但讓我解釋一下。\n\n我每天都在思考這個問題。如果我一覺醒來發現我的投資組合\n達到我的目標價格，我會怎麼做？我會告訴我的妻子辭掉她的工作，我將投入到\n我將與我的僱主共度兩週。\n\n對我的僱主來說。我會禮貌地告訴他們...",
      "title": "IMO，你在加密貨幣中最愚蠢的舉動是在你獲得成功時告訴任何人。對所有不是國稅局的人撒謊。"
    }
  ]
}