{
  "author": "BigLongFootDoctor",
  "original_created_utc": 1637538431,
  "title": "Metaverse is just a buzz word.",
  "created_utc": 1637581147,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Anyone else tired of hearing of the Metaverse? Reality is the graphics of all of these projects look like Minecraft and hot dog water. It&#39;s crazy to see so many ppl sold so adamantly on this word.</p>\n\n<p>Just yesterday there was a post asking which Metaverse will take over, it&#39;s none of them. The next big metaverse is years away from being built and it&#39;ll be done by a company like Nvidia.</p>\n\n<p>The point is don&#39;t get sold on random projects because they&#39;re using buzzwords like &quot;we&#39;re building a metaverse&quot;, everybody is building a metaverse... Folks, we&#39;re still years away from the tech being available to truly support it.</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/CryptoCurrency/comments/qz7qii/metaverse_is_just_a_buzz_word/",
  "subreddit": "CryptoCurrency",
  "id": "qz7qii",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Anyone else tired of hearing of the Metaverse? Reality is the graphics of all of\nthese projects look like Minecraft and hot dog water. It's crazy to see so many\nppl sold so adamantly on this word.\n\nJust yesterday there was a post asking which Metaverse will take over, it's none\nof them. The next big…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "メタバースと聞き飽きた人はいませんか？現実は、これらのプロジェクトのグラフィックはすべて\nこれらのプロジェクトのグラフィックは、まるでマインクラフトとホットドッグウォーターのようです。多くの人々がこの言葉に強く惹かれているのを見るのは\nこの言葉に固執して販売している人々を見るのはクレイジーです。\n\nちょうど昨日、どのメタバースが引き継がれるかという投稿がありましたが、どれでもないです。\nそのどれでもない。次の大きな...",
      "title": "メタバースはただのバズワードです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "还有谁听腻了Metaverse？现实是，所有这些项目的图形\n这些项目看起来像Minecraft和热狗水。看到这么多\n看到这么多的人如此执着于这个词，真是疯狂。\n\n就在昨天，有一个帖子问哪一个Metaverse将被接管，它不是\n都不是。下一个大...",
      "title": "Metaverse只是一个流行词。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "還有誰聽膩了Metaverse？現實是，所有這些項目的圖形\n這些項目看起來像Minecraft和熱狗水。看到這麼多\n看到這麼多的人如此執着於這個詞，真是瘋狂。\n\n就在昨天，有一個帖子問哪一個Metaverse將被接管，它不是\n都不是。下一個大...",
      "title": "Metaverse只是一個流行詞。"
    }
  ]
}