{
  "author": "Many_Arm7466",
  "original_created_utc": 1635882621,
  "title": "Crypto account: $4* ***.** Bank account: $98.12. Anybody else like this?",
  "created_utc": 1635888637,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Just like the title says I am as much as all in that I can afford the majority of my pay check goes into Crypto. I have most of my portfolio in ETH as I feel comfortable that it will be around long term and gain in price. Then I do have an emergency fund in my bank that will allow me to get by for 6 months which I believe will be enough time for me to get by in an emergency if Crypto does enter a bear market. </p>\n\n<p>I’m tired of my stupid job, and I’m tired of my annoying bosses. This is my last chance of being financially secure in life and I’m going to make the most of it!</p>\n\n<p>Anybody else with a significant amount of their network in Crypto?</p>\n</div><!-- SC_ON -->",
  "score": 267,
  "permalink": "/r/CryptoCurrency/comments/qlckhx/crypto_account_4_bank_account_9812_anybody_else/",
  "subreddit": "CryptoCurrency",
  "id": "qlckhx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Just like the title says I am as much as all in that I can afford the majority\nof my pay check goes into Crypto. I have most of my portfolio in ETH as I feel\ncomfortable that it will be around long term and gain in price. Then I do have\nan emergency fund in my bank that will allow me to get by for 6…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルにあるように、私は給料の大半を暗号につぎ込む余裕があるくらいです。\n給料の大半を暗号に充てています。私は自分のポートフォリオのほとんどをETHにしています。\nETHは長期的に存在し、価格も上昇すると確信しているからです。それから、私は\n私の銀行には、6年間の生活を送るための緊急資金があります...。",
      "title": "暗号化されたアカウント $4* ***.** 銀行口座 $98.12. このような方はいらっしゃいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "就像标题说的那样，我和所有的人一样，我可以负担得起。\n我的工资支票被投入加密货币。我的投资组合中大部分是ETH，因为我觉得\n因为我觉得它将长期存在并且价格上涨。然后，我确实有\n我的银行里有一笔应急基金，可以让我度过6年的时间。",
      "title": "加密货币账户。4美元* ***.**银行账户。$98.12. 还有人像这样吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "就像標題說的那樣，我和所有的人一樣，我可以負擔得起。\n我的工資支票被投入加密貨幣。我的投資組合中大部分是ETH，因爲我覺得\n因爲我覺得它將長期存在並且價格上漲。然後，我確實有\n我的銀行裏有一筆應急基金，可以讓我度過6年的時間。",
      "title": "加密貨幣賬戶。4美元* ***.**銀行賬戶。$98.12. 還有人像這樣嗎？"
    }
  ]
}