{
  "author": "Stilgrave",
  "original_created_utc": 1657243420,
  "title": "How do I professionally tell someone they are bad pet owners?",
  "created_utc": 1657288116,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;We are sitting for this handsome 3 year old Corgi. He came with his own personal spa and crate with built in sound system, just to set the tone.&lt;/p&gt;\n\n&lt;p&gt;He knows no commands, discipline, and destroys everything.&lt;/p&gt;\n\n&lt;p&gt;He is not a good boi.&lt;/p&gt;\n\n&lt;p&gt;And here&amp;#39;s the kicker &amp;quot;When we are at work (telework), sleeping or not playing with him we just leave him in the crate.&amp;quot;\n-the owner&lt;/p&gt;\n\n&lt;p&gt;I feel leaving a dog in a crate for ~16 hours a day is abuse.&lt;/p&gt;\n\n&lt;p&gt;They&amp;#39;ve made it clear this is a trophy/stature dog and are not giving it the care it deserves.&lt;/p&gt;\n\n&lt;p&gt;How do I tell them they suck and need to change their ways?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/NoStupidQuestions/comments/vtyjcc/how_do_i_professionally_tell_someone_they_are_bad/",
  "subreddit": "NoStupidQuestions",
  "id": "vtyjcc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "We are sitting for this handsome 3 year old Corgi. He came with his own personal\nspa and crate with built in sound system, just to set the tone.\n\nHe knows no commands, discipline, and destroys everything.\n\nHe is not a good boi.\n\nAnd here's the kicker \"When we are at work (telework), sleeping or not…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "3歳のハンサムなコーギーをシッティングしています。この子には、自分専用の\nスパとクレート（サウンドシステム内蔵）がついてきます。\n\n彼はコマンドも躾も知らないし、何でも破壊してしまいます。\n\nいい子ではありません。\n\nそして、「私たちが仕事（テレワーク）をしているときは、寝ても覚めても...」というのがキッカケです。",
      "title": "ペットを飼うのが下手な人に、プロとしてどう言えばいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们正在为这只3岁的英俊的柯基犬坐诊。他有自己的个人\n的温泉和带内置音响系统的板条箱，只是为了给它定下基调。\n\n他不知道任何命令和纪律，并且破坏一切。\n\n他不是一个好孩子。\n\n最重要的是 \"当我们在工作时（远程工作），无论是否在睡觉......",
      "title": "我如何从专业角度告诉别人他们是坏的宠物主人？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們正在爲這隻3歲的英俊的柯基犬坐診。他有自己的個人\n的溫泉和帶內置音響系統的板條箱，只是爲了給它定下基調。\n\n他不知道任何命令和紀律，並且破壞一切。\n\n他不是一個好孩子。\n\n最重要的是 \"當我們在工作時（遠程工作），無論是否在睡覺......",
      "title": "我如何從專業角度告訴別人他們是壞的寵物主人？"
    }
  ]
}