{
  "author": "silevent",
  "original_created_utc": 1646462799,
  "title": "Am I A Creep?",
  "created_utc": 1646489632,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Okay, so I&amp;#39;m making this on a throwaway account because I don&amp;#39;t want to be seen as creepy because I don&amp;#39;t know if this is stalkerish or not.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve had a crush on a YouTuber since I was around 11. We&amp;#39;re around the same age (19(me) &amp;amp; 24(YouTuber), respectively). I don&amp;#39;t follow any of his social media accounts simply because I can&amp;#39;t be bothered with Instagram or Snapchat etc., but I&amp;#39;ve had so many dreams about this YouTuber and I&amp;#39;ve never felt physically attracted to anyone before more than this guy despite having dated past people, &amp;amp; never having met him in real life. Like, this guy is constantly in my mind, but I don&amp;#39;t know if it&amp;#39;s because I admire this person so much. I mean, throughout my entire high school career and even as far back as me being 11, like mentioned before, this guy has been in my life and I&amp;#39;ve watched him grow from literally nothing to the millions he has now. (i.e been around from his &lt;em&gt;first ever&lt;/em&gt; video)&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;I obviously don&amp;#39;t want to name him because I don&amp;#39;t want to seem like a creep, but he&amp;#39;s fairly popular now and pulling in the average of millions of views on his videos. I don&amp;#39;t know if this is a celebrity crush or not. I feel like a creep for him showing up in my dreams - I&amp;#39;ve never masterbated to him or anything of the sort but he&amp;#39;s just so attractive to me and I&amp;#39;ve got no idea if it&amp;#39;s creepy for me to be this attracted to a guy, both because of his looks and personality.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s because of this that I&amp;#39;m also scared to buy merchandise because it&amp;#39;s like... I don&amp;#39;t want to be one of those horny stalkers you always hear about in media and the idea terrifies me. I don&amp;#39;t want it to become an obsession despite me daydreaming about what it&amp;#39;d be like to be his significant other or being important to him. I&amp;#39;ve been thinking on this for a while and I don&amp;#39;t want to be like... ruining one of the only things that&amp;#39;s made me laugh so much and be a constant source of happiness.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;I guess what I&amp;#39;m asking is this: am I a creep?&lt;/p&gt;\n\n&lt;p&gt;TL;DR: Been watching the same YouTuber since I was 11(19 now), have daydreamed about him, and am scared if it&amp;#39;s turning into an obsession / crossing the line with him always being in my thoughts.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 121,
  "permalink": "/r/NoStupidQuestions/comments/t73my6/am_i_a_creep/",
  "subreddit": "NoStupidQuestions",
  "id": "t73my6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "Okay, so I'm making this on a throwaway account because I don't want to be seen\nas creepy because I don't know if this is stalkerish or not.\n\n\n\nI've had a crush on a YouTuber since I was around 11. We're around the same age\n(19(me) & 24(YouTuber), respectively). I don't follow any of his social…"
}