{
  "author": "Successful_Craft3076",
  "original_created_utc": 1646603335,
  "title": "We don't invest in crypto because we are tax dodgers. We do because future is stark and we are desperate.",
  "created_utc": 1646621162,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Dear feds&lt;/p&gt;\n\n&lt;p&gt;Fuck off already with all negativity about crypto investors.\nWe are not bunch of evil money launderers. \nWe are not Russian agents. \nAnd we sure are not here because we don&amp;#39;t know the risks.&lt;/p&gt;\n\n&lt;p&gt;We are here because your system ruined our future. Because we don&amp;#39;t see any other scenario when we can afford to buy a house or even a nice new car. People in 50s were compensated decently for their hard work. They had a roof over their heads, a nice job and a lots of hope for the future. We? If we are really smart we might pay off our debts by the time we have our first heart attack.&lt;/p&gt;\n\n&lt;p&gt;We are not victims of some crypto scam machine. We know what we signed up for. What you call it? Free market? Only this is truly a free market and not only in name for few to profit. We might actually have a chance of winning here. &lt;/p&gt;\n\n&lt;p&gt;Dear feds, every single person here knows this market is a minefield. They are not stupid. But what can you do when there is no safe option to reach your dreams? You take a risk. Yes, we are desperate and it is your doing. We are here risking for a win because we have no other choice. Because you fucked up bad.&lt;/p&gt;\n\n&lt;p&gt;Dear feds, there are more pressing matters than crypto, you fucked up earth and continue to do so. World is on the brink of war. We have tyrants taking out democracies and people&amp;#39;s trust in you is at all time low. Leave us alone for once. Don&amp;#39;t fuck this one up. We can take care of ourselves. It is our choice to make. Let us have this one thing.&lt;/p&gt;\n\n&lt;p&gt;Regards\nA pissed off millennial&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 362,
  "permalink": "/r/CryptoCurrency/comments/t89c9g/we_dont_invest_in_crypto_because_we_are_tax/",
  "subreddit": "CryptoCurrency",
  "id": "t89c9g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Dear feds\n\nFuck off already with all negativity about crypto investors. We are not bunch of\nevil money launderers. We are not Russian agents. And we sure are not here\nbecause we don't know the risks.\n\nWe are here because your system ruined our future. Because we don't see any\nother scenario when we…"
}