{
  "author": "Independent-Turn-858",
  "original_created_utc": 1636475309,
  "title": "People who max out credit cards, what’s your end game?",
  "created_utc": 1636485016,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Specifically talking about personal credit cards where the owner makes less than $60k/year but has tens of thousands of high-interest debt. I’ve known lots of people in this range and I’ve always been too afraid to ask how they plan to pay down all that debt?</p>\n\n<p>For example, a colleague of mine makes $55k per year but he has easily $20k in credit card debt. It blows my mind when he tells me he needs to buy a PlayStation 5. I don’t think anyone needs to buy a PS5 let alone someone in heavy debt.</p>\n\n<p>How do you justify buying more junk? Do you ever envision throwing the stuff away in the dumpster one day? Does buyers remorse ever happen? How do you plan to pay back nearly 50% salary in debt?</p>\n</div><!-- SC_ON -->",
  "score": 125,
  "permalink": "/r/TooAfraidToAsk/comments/qq7di0/people_who_max_out_credit_cards_whats_your_end/",
  "subreddit": "TooAfraidToAsk",
  "id": "qq7di0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Specifically talking about personal credit cards where the owner makes less than\n$60k/year but has tens of thousands of high-interest debt. I’ve known lots of\npeople in this range and I’ve always been too afraid to ask how they plan to pay\ndown all that debt?\n\nFor example, a colleague of mine makes…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "具体的には、所有者が年収6万ドル以下でありながら数万ドルの現金を持っているような個人のクレジットカードについてです。\n年収が6万ドル以下なのに、何万もの高利の借金がある個人のクレジットカードのことです。私はこのような人たちをたくさん知っています。\n私はこのような人たちをたくさん知っていますが、どうやってその借金を返すつもりなのか、いつも怖くて聞けませんでした。\n聞くのが怖かったんです。\n\n例えば、私の同僚の収入は...。",
      "title": "クレジットカードを使っている人は、どうしたいですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "特别是在谈论个人信用卡时，主人的收入低于\n6万美元/年，但有数万的高息债务。我认识很多\n的人，但我总是不敢问他们打算如何偿还这些债务？\n偿还所有的债务？\n\n例如，我的一个同事赚...",
      "title": "刷爆信用卡的人，你的最终目的是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "特別是在談論個人信用卡時，主人的收入低於\n6萬美元/年，但有數萬的高息債務。我認識很多\n的人，但我總是不敢問他們打算如何償還這些債務？\n償還所有的債務？\n\n例如，我的一個同事賺...",
      "title": "刷爆信用卡的人，你的最終目的是什麼？"
    }
  ]
}