{
  "author": "TheTradingCollective",
  "the_new_excerpt": "All day I’ve just been reading back and forth comments from $amc holders to\n$clov to $wkhs and all the others just bashing each other. So we’re rooting for\nother individuals downfall now? That’s not the idea behind WSB and should not be\nthe way this is. If a group of individuals want to push and…",
  "original_created_utc": 1623270232,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日は一日中、$amcホルダーから$clov、$wkhsなどのコメントを読み返し、お互いを非難し合っていました。\n他の人たちがお互いを非難しています。では、私たちは他の人の没落を応援しているのでしょうか？\n応援するのか？それはWSBの理念ではありませんし、このような状況になってはいけません。\n今のままではいけません。もし、ある個人のグループがプッシュして...",
      "title": "なぜ株対株の戦争になってしまったのか？ヘッジファンドの空売りに対する猿の戦いでは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "一整天我都在读来回的评论，从$amc的持有者到$clov到$wkhs，还有其他所有的人都在抨击eBay。\n洛克菲勒公司和沃克斯公司以及其他所有的人都在相互抨击对方。所以我们现在是在支持\n其他个人垮台了？这不是WSB背后的想法，也不应该是\n这样的方式。如果一群人想要推动和...",
      "title": "为什么这变成了一场股票与股票的战争？我以为是人猿对抗对冲基金卖空者？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "一整天我都在讀來回的評論，從$amc的持有者到$clov到$wkhs，還有其他所有的人都在抨擊eBay。\n洛克菲勒公司和沃克斯公司以及其他所有的人都在相互抨擊對方。所以我們現在是在支持\n其他個人垮臺了？這不是WSB背後的想法，也不應該是\n這樣的方式。如果一羣人想要推動和...",
      "title": "爲什麼這變成了一場股票與股票的戰爭？我以爲是人猿對抗對沖基金賣空者？"
    }
  ],
  "title": "Why has this turned into a war of stock vs stock? I thought it was apes against hedge fund short sellers?",
  "created_utc": 1623288050,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>All day I’ve just been reading back and forth comments from $amc holders to $clov to $wkhs and all the others just bashing each other. So we’re rooting for other individuals downfall now? That’s not the idea behind WSB and should not be the way this is. If a group of individuals want to push and support a certain stock then let them. You don’t have to bash their boards or comment on posts with negative remarks not backed by intelligence. I support everyone here from the original $gme investors to the new ones pushing Wendy’s. If you believe in it then go for it. If you have DD to try and convince me of your thoughts and views then post it. I’ll make my decision from there and if I disagree for a reason I believe you should know then I’ll present it accordingly and not like a mindless fool. Anyways just my opinion and I’m sure this will get hate like anything else but we’re better than bashing and mindless comments.</p>\n</div><!-- SC_ON -->",
  "score": 7229,
  "permalink": "/r/wallstreetbets/comments/nw5eda/why_has_this_turned_into_a_war_of_stock_vs_stock/",
  "subreddit": "wallstreetbets",
  "id": "nw5eda",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404895342
}