{
  "author": "Anonymous-User6678",
  "original_created_utc": 1639532303,
  "title": "I'm 19 and feel like I'm missing out.",
  "created_utc": 1639609094,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve lived in a religious family my entire life. I&amp;#39;ve never done drugs. Never smoked. I&amp;#39;ve never worn a crop top or bikini. I can&amp;#39;t show my stomach at all. I&amp;#39;ll get kicked out of the house if I don&amp;#39;t go to church with my parents. I&amp;#39;ve never dated a guy in real life, only online. My curfew is 10:00 pm. \nI&amp;#39;m in college with a part-time job and a car. I have nice friends. Most of them are Christians. After hanging out with my friends in college, I&amp;#39;ve realized they have done a lot of things my parents would have considered bad. \nIn six months I&amp;#39;ll be 20. Have I been missing out on anything? Is my life normal?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/NoStupidQuestions/comments/rgn2vf/im_19_and_feel_like_im_missing_out/",
  "subreddit": "NoStupidQuestions",
  "id": "rgn2vf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've lived in a religious family my entire life. I've never done drugs. Never\nsmoked. I've never worn a crop top or bikini. I can't show my stomach at all.\nI'll get kicked out of the house if I don't go to church with my parents. I've\nnever dated a guy in real life, only online. My curfew is 10:00…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はずっと宗教的な家庭で暮らしてきました。ドラッグはやったことがない。一度も\nタバコを吸う。クロップトップやビキニを着たことがない。お腹は全く出せない。\n親と一緒に教会に行かないと、家から追い出される。私は\nネット上だけで、リアルに男性とデートしたことがない。私の門限は10時...",
      "title": "私は19歳ですが、物足りなさを感じています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一生都生活在一个宗教家庭里。我从来没有做过毒品。从不\n抽烟。我从来没有穿过麦穗衫或比基尼。我根本不能露出我的肚子。\n如果我不和父母一起去教堂，我就会被赶出家门。我\n我从来没有在现实生活中约会过一个男人，只是在网上。我的宵禁时间是10:00...",
      "title": "我今年19岁，感觉自己错过了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一生都生活在一個宗教家庭裏。我從來沒有做過毒品。從不\n抽菸。我從來沒有穿過麥穗衫或比基尼。我根本不能露出我的肚子。\n如果我不和父母一起去教堂，我就會被趕出家門。我\n我從來沒有在現實生活中約會過一個男人，只是在網上。我的宵禁時間是10:00...",
      "title": "我今年19歲，感覺自己錯過了。"
    }
  ]
}