{
  "author": "GNTsquid0",
  "the_new_excerpt": "I jumped on the stock bandwagon/hive mind in late Jan/early Feb so I’m new to\nthe stock thing and have been trying to understand how everything works ever\nsince.\n\nOne question I haven’t been able to find and answer or explanation for is Inflow\nand Outflow.\n\nFor example on the AMC stock according to…",
  "original_created_utc": 1623346951,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は1月下旬から2月上旬に株の流行に乗ってハイブマインドになったので、株のことは初心者です。\nそれ以来、すべての仕組みを理解しようとしています。\nそれ以来、すべての仕組みを理解しようとしています。\n\n私がまだ答えや説明を見つけられていない質問の一つに、インフローとアウトフローがあります。\nとアウトフローです。\n\n例えば、AMCの株では、...",
      "title": "流入量が流出量を常に上回っているのに、なぜ価格が下がるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在1月底/2月初加入了股票大军/蜂巢思维，所以我是个新手。\n我在1月底/2月初加入了股票大军/蜂巢思维，所以我是股票新手，从那时起就一直试图了解一切是如何运作的。\n试图了解一切是如何运作的。\n\n有一个问题我一直没能找到答案或解释，那就是流入和流出。\n和流出。\n\n例如，在AMC的股票上，根据...",
      "title": "如果流入量持续高于流出量，为什么价格会下降？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在1月底/2月初加入了股票大軍/蜂巢思維，所以我是個新手。\n我在1月底/2月初加入了股票大軍/蜂巢思維，所以我是股票新手，從那時起就一直試圖瞭解一切是如何運作的。\n試圖瞭解一切是如何運作的。\n\n有一個問題我一直沒能找到答案或解釋，那就是流入和流出。\n和流出。\n\n例如，在AMC的股票上，根據...",
      "title": "如果流入量持續高於流出量，爲什麼價格會下降？"
    }
  ],
  "title": "Why Would Price Go Down if Inflow is Consistently Higher Than Outflow?",
  "created_utc": 1623356547,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I jumped on the stock bandwagon/hive mind in late Jan/early Feb so I’m new to the stock thing and have been trying to understand how everything works ever since.</p>\n\n<p>One question I haven’t been able to find and answer or explanation for is Inflow and Outflow.</p>\n\n<p>For example on the AMC stock according to the Webull app the Inflow is consistently greater than the outflow but the price of the stock still drops at times.</p>\n\n<p>Inflow vs outflow surely can’t be the only factor I’m that determines a stock price but the basics tell me when there’s more people buying (inflow) the price goes up and more people selling (outflow) price goes down. So if there’s more people buying all the time wouldn’t the price move up a lot more?</p>\n\n<p>Whenever I ask this I get one word answers like “manipulation” “dark pools” “hedgies”. I’d like better explanations though or at least more detailed. Seems too simple an answer to be strictly manipulation.</p>\n\n<p><a href=\"https://imgur.com/q8uDLwB\">Webull Inflow/Outflow 1</a></p>\n\n<p><a href=\"https://imgur.com/8PkL8Gc\">Webull Inflow/Outflow 2</a></p>\n\n<p>Ive seen greater and smaller differences in the inflow vs outflow than this before but at the time the stock is still going down.</p>\n</div><!-- SC_ON -->",
  "score": 88,
  "permalink": "/r/stocks/comments/nwtmvj/why_would_price_go_down_if_inflow_is_consistently/",
  "subreddit": "stocks",
  "id": "nwtmvj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009743444
}