{
  "author": "BaconSanwich",
  "original_created_utc": 1651664687,
  "title": "Why do so many people list their mental health disorders in their profiles like badges of honor?",
  "created_utc": 1651672036,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Honestly don&amp;#39;t understand it myself but I&amp;#39;m genuinely curious about the motivation. Is it to get sympathy? Is it to brag? Is it to obtain power through victimhood? Is it seen as their direct personhood? Something else entirely? Anyone who does this and can shed some light on it, I would very much appreciate it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 112,
  "permalink": "/r/TooAfraidToAsk/comments/ui4njz/why_do_so_many_people_list_their_mental_health/",
  "subreddit": "TooAfraidToAsk",
  "id": "ui4njz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Honestly don't understand it myself but I'm genuinely curious about the\nmotivation. Is it to get sympathy? Is it to brag? Is it to obtain power through\nvictimhood? Is it seen as their direct personhood? Something else entirely?\nAnyone who does this and can shed some light on it, I would very much…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "正直、自分でもよくわからないのですが、純粋に気になるのは\n動機が気になります。共感を得るためなのか？自慢したいのか？被害者意識で権力を手に入れるためなのか？\n被害者意識なのか？それは彼らの直接的な人格と見られているのだろうか？全く別の何か？\nどなたか、このようなことをされている方で、何か光を当てていただける方がいらっしゃいましたら、是非とも...。",
      "title": "なぜ多くの人が、自分の精神疾患を名誉の象徴のようにプロフィールに記載しているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "说实话，我自己也不明白，但我真的很好奇，为什么会有这样的动机？\n动机。是为了获得同情吗？是为了炫耀吗？是为了通过\n受害者身份？是被看作是他们的直接人格吗？还是其他什么原因？\n任何做这个工作的人，如果能给我一些启示，我将非常...",
      "title": "为什么这么多人把他们的心理健康疾病像荣誉勋章一样列在他们的资料中？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "說實話，我自己也不明白，但我真的很好奇，爲什麼會有這樣的動機？\n動機。是爲了獲得同情嗎？是爲了炫耀嗎？是爲了通過\n受害者身份？是被看作是他們的直接人格嗎？還是其他什麼原因？\n任何做這個工作的人，如果能給我一些啓示，我將非常...",
      "title": "爲什麼這麼多人把他們的心理健康疾病像榮譽勳章一樣列在他們的資料中？"
    }
  ]
}