{
  "author": "MasterCookSwag",
  "the_new_excerpt": "Mutual Fund Locks Out Founder After SEC Questions Swaps Pricing\n[https://www.bloomberg.com/news/articles/2021-02-22/infinity-q-fund-seeks-sec-permission-to-suspend-redemptions]\n\n> In a dramatic response to a federal inquiry, Infinity Q Capital Management\n> announced Monday it’s shutting a $1.8…",
  "original_created_utc": 1614112787,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "证监会质疑掉期定价后，共同基金锁定创始人\n[https://www.bloomberg.com/news/articles/2021-02-22/infinity-q-fund-seeks-sec-permission-to-suspend-redemptions]\n\n> 在对联邦调查的戏剧性回应中，Infinity Q Capital Management\n>周一宣布关闭1.8亿美元的......",
      "title": "无限极Q今天的表现相当垃圾"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "證監會質疑掉期定價後，共同基金鎖定創始人\n[https://www.bloomberg.com/news/articles/2021-02-22/infinity-q-fund-seeks-sec-permission-to-suspend-redemptions]\n\n> 在對聯邦調查的戲劇性迴應中，Infinity Q Capital Management\n>週一宣佈關閉1.8億美元的......",
      "title": "無限極Q今天的表現相當垃圾"
    }
  ],
  "title": "Infinity Q is having a pretty garbage day today",
  "created_utc": 1614153459,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.bloomberg.com/news/articles/2021-02-22/infinity-q-fund-seeks-sec-permission-to-suspend-redemptions\"><strong>Mutual Fund Locks Out Founder After SEC Questions Swaps Pricing</strong></a></p>\n\n<blockquote>\n<p>In a dramatic response to a federal inquiry,\nInfinity Q Capital Management\nannounced Monday it’s shutting a $1.8 billion mutual fund and that it placed Velissaris on leave, cutting off his access to accounts and trading while hiring an expert to value holdings. The firm said it had learned the U.S. Securities and Exchange Commission is probing whether Velissaris, now 36, incorrectly valued complex derivatives.</p>\n\n<p>The SEC told Infinity Q’s non-executive chairman that the agency’s investigators had obtained evidence Velissaris adjusted models used to price swap contracts held by the\nInfinity Q Diversified Alpha Fund\n, likely resulting in incorrect valuations being reported to investors, according to a company statement on Monday.</p>\n\n<p>“Infinity Q has independently verified that Mr. Velissaris did access and alter the third party’s valuation models but has not yet assessed the impact of those alterations,” the company said. Its website, which says the firm uses a “quantamental” strategy blending quantitative research with a private equity discipline, was in “maintenance mode” on Monday night.</p>\n\n<p>In an emailed statement, Velissaris’s attorneys, Sean Hecker and Michael Ferrara, said: “Our client has acted in good faith throughout his tenure at Infinity Q and will continue to do so moving forward. His focus has always been on delivering and preserving value for investors.”</p>\n</blockquote>\n\n<p>/</p>\n\n<blockquote>\n<p>Infinity Q was using models provided by an outside pricing service to determine the value of the swap contracts, according to the request filed with the SEC for permission to suspend redemptions. Based on information provided by the SEC, Infinity Q found out last week that the firm’s CIO had been “adjusting certain parameters” within the models that affected the valuation of the swaps, the firm said in a filing.</p>\n\n<p>The Diversified Value Fund held swap contracts with a fair value of $449 million at the end of November, equaling about 26% of its $1.71 billion in net assets at the time, according to its most recent portfolio report to the SEC. This included so-called variance swap contracts written by a wide range of Wall Street banks that were tied to the volatility of global market benchmarks, such as the S&amp;P 500 index.</p>\n\n<p>Leonard Potter, Infinity Q’s non-executive chairman, will take over management of the firm. Potter is the owner of Wildcat Capital Management, which managed more than $3 billion at the end of 2019, including capital from Bonderman.</p>\n\n<p>The Diversified Alpha Fund’s institutional shares have gained almost 1% year-to-date, performance that ranked below almost 90% of its peers, according to data compiled by Bloomberg.</p>\n</blockquote>\n\n<p><a href=\"https://www.wsj.com/articles/investment-firm-halts-redemptions-on-1-8-billion-fund-11614090454#:%7E:text=Investment%20firm%20Infinity%20Q%20Capital,issues%20valuing%20the%20fund&#x27;s%20holdings.\"><strong>Investment Firm Halts Redemptions on $1.8 Billion\nFund</strong></a></p>\n\n<blockquote>\n<p>Investment firm Infinity Q Capital Management LLC asked the Securities and Exchange\nCommission to halt redemptions on a $1.8 billion fund and is looking to liquidate its\nholdings.</p>\n\n<p>The request comes after the firm was unable to value some of its holdings, which include\nswaps, in one of its funds. Infinity Q had about $3 billion in assets under management at\nthe end of January, with roughly $1.8 billion belonging to its Infinity Q Diversified Alpha\nFund, according to an SEC filing. The fund employed strategies across several markets,\nincluding derivatives, stocks, and futures, according to FactSet.</p>\n\n<p>Halting redemptions is an unusual move, since mutual funds offer freedom to cash out at\nany time, and it suggests severe problems at the firm. Third Avenue Management LLC\nhalted redemptions in one of its credit funds in 2015, a move that shocked the market, left\na black mark on the firm and spurred worries about the wider bond market.</p>\n\n<p>The SEC informed Infinity Q’s non-executive chairman, Len Potter, that staff had evidence\nthat the firm’s Chief Investment Officer James Velissaris “had been adjusting parameters”\nof pricing models that were used to value derivatives in the fund’s portfolio, according to\na spokesman for Infinity Q. As a result, incorrect valuations were likely being reported to\ninvestors. The spokesman said in a statement that the firm is “cooperating with the SEC\ninvestigation” and has cut off Mr. Velissaris’s access to trading.</p>\n</blockquote>\n\n<p>ruh roh...</p>\n\n<p>Pour one out for mah liquid alts homies.</p>\n\n<p>e: Looks like the &quot;mispriced&quot; swaps were around 17-20% of the portfolio, and the word I&#39;m hearing is that the company (Infinity Q) is treating this basically like it&#39;s deliberate fraud.  So this is a pretty wild thing to happen in the mutual fund world.  It looks like there was some potentially systemic overvaluation with regard to their swaps in order to make performance look better than it was.  I realize most people aren&#39;t super familiar with this stuff but 40 act funds are super regulated, this sort of thing just does not happen much at all.  </p>\n\n<p>realistically this should serve as a bit of a cautionary tale to anyone who&#39;s interested in looking in to the alts space, or anything that has some investments that aren&#39;t publicly listed and able to easily be marked to market.</p>\n</div><!-- SC_ON -->",
  "score": 49,
  "permalink": "/r/investing/comments/lqsfpi/infinity_q_is_having_a_pretty_garbage_day_today/",
  "subreddit": "investing",
  "id": "lqsfpi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332883603
}