{
  "author": "Leionart",
  "the_new_excerpt": "Previously I wrote about Enphase Energy 1 year ago and people doubted the\ninvestment opportunity\n\nhttps://www.reddit.com/r/stocks/comments/d6zsof/best_time_to_buy_enphase_energy_enph_is_now/\n\nBack then, Enphase energy was trading at $32 and many people naysayers flooded\nmy inbox. People looked at…",
  "original_created_utc": 1611346666,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "此前我在1年前写过关于Enphase Energy的文章，大家对其表示怀疑。\n投资机会\n\nhttps://www.reddit.com/r/stocks/comments/d6zsof/best_time_to_buy_enphase_energy_enph_is_now/\n\n当年，恩相能源的交易价格是32美元，很多人非议者涌入了\n我的邮箱。人们看着...",
      "title": "下一个伟大的可再生能源公司"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "此前我在1年前寫過關於Enphase Energy的文章，大家對其表示懷疑。\n投資機會\n\nhttps://www.reddit.com/r/stocks/comments/d6zsof/best_time_to_buy_enphase_energy_enph_is_now/\n\n當年，恩相能源的交易價格是32美元，很多人非議者湧入了\n我的郵箱。人們看着...",
      "title": "下一個偉大的可再生能源公司"
    }
  ],
  "title": "The Next Great Renewable Energy Firm",
  "created_utc": 1611384786,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Previously I wrote about Enphase Energy 1 year ago and people doubted the investment opportunity</p>\n\n<p><a href=\"https://www.reddit.com/r/stocks/comments/d6zsof/best_time_to_buy_enphase_energy_enph_is_now/\">https://www.reddit.com/r/stocks/comments/d6zsof/best_time_to_buy_enphase_energy_enph_is_now/</a></p>\n\n<p>Back then, Enphase energy was trading at $32 and many people naysayers flooded my inbox. People looked at the P/E ratio and I had responses saying that it wouldn&#39;t hold. Well, look at where we are now; ENPH became an industry leader in microinverters for solar panel systems and is now trading at a 566% gain from when I posted that. Hell; their ERs were negative at that point, but were increasingly getting closer to making positive revenue. Though I believe that there is still a long runway for ENPH and I do still have a position within it, I do believe that there is a potentially better investment moving forward.</p>\n\n<p>As we all know, the Biden administration will push and promote renewables and renewable infrastructure within the next 4 years.</p>\n\n<p>&quot; He will launch <strong>a national effort aimed at creating the jobs we need to build a modern, sustainable infrastructure now and deliver an equitable clean energy future</strong>. &quot;</p>\n\n<p><a href=\"https://joebiden.com/clean-energy/\">https://joebiden.com/clean-energy/</a></p>\n\n<p>Though most of the market is now aware of solar companies and wind energy companies, there is a huge gap in focus of infrastructure.</p>\n\n<p>The next 4 years we will see a huge push and incentives for companies taking out age old infrastructure and replacing them with modern, ecofriendly, and more efficient systems to meet the rising demands of power.</p>\n\n<p><strong>How do you get large renewable energy wind/solar, which is concentrated in the suburbs and farmlands of America, into the cities?</strong> You do it with new power lines, and ideally more efficient ones.</p>\n\n<p>That&#39;s where American Superconductor AMSC comes in.</p>\n\n<p>This company specializes in MEGA-Watt scale power solutions that improve the performance of power grids., and electric utilities. This is ideal for moving new renewable energy from distant farmlands into large cities and meet the increasing demand for electricity.</p>\n\n<p>As we know, there is increasing demand for Electric vehicles thanks to companies like Tesla as well as ramping up production of EVs from other car manufacturers. There will also be new wind as well as solar farms propping up in the very near future to meet the goals of switching to renewable energy and away from fossil fuels.  In the near future, we&#39;re going to see a lot more charging stations, as well as more demand in infrastructure to deliver renewables energy into cities.</p>\n\n<p>Their main product,  a high temperature superconductor (HTS) wire that will take up less space and transmit up to <strong>10 times more power</strong>, <strong>allowing bulk transfer of transmission-level power at distribution voltages.</strong></p>\n\n<p>We&#39;re going to need new infrastructure to scale up the demand for renewable energy. AMSC will be one of those companies that will rise in the coming months and years.</p>\n\n<p>&#x200B;</p>\n\n<p>Currently, it&#39;s trading at $28 and is set to have earnings reports after hours on 2/3/21.</p>\n\n<p>Looking at their EPS reports, the company has increased revenue over every single quarter over the past year. (Similar to ENPH a year ago.) <strong><em>And is still unknown to the masses.</em></strong></p>\n\n<p>Q1 2020 -0.24</p>\n\n<p>Q2 2020 -0.15</p>\n\n<p>Q3 2020 -.13</p>\n\n<p>Q4 - 2/3/21</p>\n\n<p>Looking at their past earnings, it&#39;s clear that this company is on track to have positive revenue within this year.</p>\n\n<p>Get in now before word breaks out!</p>\n\n<p><strong>TLDR: Buy American Superconductor AMSC!</strong></p>\n</div><!-- SC_ON -->",
  "score": 59,
  "permalink": "/r/stocks/comments/l2w21j/the_next_great_renewable_energy_firm/",
  "subreddit": "stocks",
  "id": "l2w21j",
  "is_self": true,
  "media": null,
  "is_video": false
}