{
  "author": "littlelightpole",
  "original_created_utc": 1635085212,
  "title": "When does the “adult” kick in?",
  "created_utc": 1635096916,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m twenty-six, and I have two children(3 &amp; 6), and a mortgage. I’m still getting through university, but I’m married. I’ve got my own health insurance, car insurance phone plan... I’m pretty Adult, right? But I don’t feel like it. Not when I see the other parents at my son’s school. They have it so together. Their temperaments are always cool and even. And my neighbors: they’re responsibly doing their yard work every week, and taking walks with their kids, and I’m barely getting in one mow every two weeks because I’m tired 24/7 and my kids don’t walk, they RUN as I holler from fifteen feet behind: <em>“too far!”</em>\nI’m twenty-six, and I’m a bit younger than the other adults I’m comparing myself to, so— when does it kick in? When will my adult gene wake up and grant me with everlasting responsibility and an even-head? </p>\n\n<p>TLDR: I feel differently from other adults, I’m still a bit young I suppose, when does my adult gene kick in?</p>\n</div><!-- SC_ON -->",
  "score": 119,
  "permalink": "/r/NoStupidQuestions/comments/qet3mu/when_does_the_adult_kick_in/",
  "subreddit": "NoStupidQuestions",
  "id": "qet3mu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m twenty-six, and I have two children(3 & 6), and a mortgage. I’m still\ngetting through university, but I’m married. I’ve got my own health insurance,\ncar insurance phone plan... I’m pretty Adult, right? But I don’t feel like it.\nNot when I see the other parents at my son’s school. They have it so…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は26歳で、2人の子供（3歳と6歳）と、住宅ローンを抱えています。私はまだ大学を卒業していませんが\n私はまだ大学を卒業していませんが、結婚しています。自分の健康保険にも加入している。\n車の保険、電話のプラン...。私はかなり大人ですよね？でも、そうは思えません。\n息子の学校の他の親たちを見ていると、そうは思えないのです。彼らはそれを持っている...",
      "title": "いつになったら「大人」になるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我今年26岁，有两个孩子（3岁和6岁），还有一笔抵押贷款。我还在\n我还在读大学，但我已经结婚了。我有自己的健康保险。\n汽车保险电话计划... 我已经很成人了，对吗？但我不觉得是这样。\n当我看到我儿子学校里的其他家长时，我就不觉得。他们有这么...",
      "title": "什么时候 \"成人 \"才开始呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我今年26歲，有兩個孩子（3歲和6歲），還有一筆抵押貸款。我還在\n我還在讀大學，但我已經結婚了。我有自己的健康保險。\n汽車保險電話計劃... 我已經很成人了，對嗎？但我不覺得是這樣。\n當我看到我兒子學校裏的其他家長時，我就不覺得。他們有這麼...",
      "title": "什麼時候 \"成人 \"纔開始呢？"
    }
  ]
}