{
  "author": "pethhh",
  "original_created_utc": 1637297580,
  "title": "What is a crypto-opinion hill that you will die on?",
  "created_utc": 1637339845,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In this sub we see lots of love and hate for different projects and it appears to change every day! </p>\n\n<p>I’m curious what opinions y’all have with certain aspect of crypto or certain projects that is a hill you are willing to die on!</p>\n\n<p>Mine is I personally think DENT (not dentacoin) is an amazing project and while I see barely-any-to-no mentions of it in this subreddit, I think it deserves to be a top 50 coin</p>\n\n<p>Whether you agree or disagree with the views commonly seen in this subreddit, I’d love to hear the crypto hills you are willing to die on!</p>\n\n<p>TLDR: What is a crypto-opinion hill you are willing to die on?</p>\n</div><!-- SC_ON -->",
  "score": 170,
  "permalink": "/r/CryptoCurrency/comments/qx8lsl/what_is_a_cryptoopinion_hill_that_you_will_die_on/",
  "subreddit": "CryptoCurrency",
  "id": "qx8lsl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In this sub we see lots of love and hate for different projects and it appears\nto change every day!\n\nI’m curious what opinions y’all have with certain aspect of crypto or certain\nprojects that is a hill you are willing to die on!\n\nMine is I personally think DENT (not dentacoin) is an amazing project…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブでは、様々なプロジェクトに対する愛と憎しみが見られ、それは日々変化しているようです。\n毎日変化しています。\n\n私は皆さんが暗号のある側面やあるプロジェクトに対してどのような意見を持っているのか興味があります。\n私は、皆さんが暗号のある側面やプロジェクトに対してどのような意見を持っているのか興味があります。\n\n私は個人的にDENT（dentacoinではない）は素晴らしいプロジェクトだと思っています。",
      "title": "自分が死ぬほどのクライスト・オピニオン・ヒルとは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在这个子项目中，我们看到了很多对不同项目的爱与恨，而且它似乎\n每天都在变化!\n\n我很好奇你们对加密货币的某些方面或某些项目有什么看法？\n项目是你愿意死在上面的一个山头!\n\n我的看法是，我个人认为DENT（不是dentacoin）是一个了不起的项目。",
      "title": "什么是你会死在上面的隐性观点山？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在這個子項目中，我們看到了很多對不同項目的愛與恨，而且它似乎\n每天都在變化!\n\n我很好奇你們對加密貨幣的某些方面或某些項目有什麼看法？\n項目是你願意死在上面的一個山頭!\n\n我的看法是，我個人認爲DENT（不是dentacoin）是一個了不起的項目。",
      "title": "什麼是你會死在上面的隱性觀點山？"
    }
  ]
}