{
  "author": "Electrical_Potato_21",
  "original_created_utc": 1636878424,
  "title": "Which gaming-related cryptos has the most potential?",
  "created_utc": 1636896647,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was reading today about blockchain activity, and was surprised to see that the number of unique active wallets connected to games now represents 55% of the blockchain industry’s total.</p>\n\n<p>Polygon (MATIC) showed the biggest growth, and increased its active wallets connected to games by 982% compared to August. With over 125,000 daily active wallets, game transactions doubled in October when compared to last month, despite the number of DeFi associated transactions decreasing by almost 52%. This is incredibly bullish for Polygon if they can keep up the dominance. </p>\n\n<p>Given that gaming-related crypto is still fairly new, which projects do you think has the most potential in this sector?</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/CryptoCurrency/comments/qtlgvr/which_gamingrelated_cryptos_has_the_most_potential/",
  "subreddit": "CryptoCurrency",
  "id": "qtlgvr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was reading today about blockchain activity, and was surprised to see that the\nnumber of unique active wallets connected to games now represents 55% of the\nblockchain industry’s total.\n\nPolygon (MATIC) showed the biggest growth, and increased its active wallets\nconnected to games by 982% compared…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日、ブロックチェーンの活動について読んでいて驚いたのですが、その中でも\nゲームに接続されているユニークでアクティブなウォレットの数は、ブロックチェーン業界全体の55%を占めていることに驚きました。\nブロックチェーン業界全体の55%を占めていることに驚きました。\n\nポリゴン(MATIC)は最も大きな成長を見せ、ゲームに接続されたアクティブウォレットの数は、...\nゲームに接続されているアクティブウォレットを982％も増加させました...",
      "title": "最も可能性のあるゲーム関連のクリプトは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我今天在阅读关于区块链活动的文章时，惊讶地看到\n与游戏相连的独特的活跃钱包的数量现在占到了区块链行业总数的55%。\n区块链行业总数的55%。\n\nPolygon（MATIC）显示出最大的增长，其活跃钱包增加了\n与游戏相连的活跃钱包增加了982%。",
      "title": "哪些游戏相关的加密货币最有潜力？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我今天在閱讀關於區塊鏈活動的文章時，驚訝地看到\n與遊戲相連的獨特的活躍錢包的數量現在佔到了區塊鏈行業總數的55%。\n區塊鏈行業總數的55%。\n\nPolygon（MATIC）顯示出最大的增長，其活躍錢包增加了\n與遊戲相連的活躍錢包增加了982%。",
      "title": "哪些遊戲相關的加密貨幣最有潛力？"
    }
  ]
}