{
  "author": "Mamiid",
  "original_created_utc": 1641841326,
  "title": "Should I rethink our 4 year relationship if my boyfriend does not want to support me when I'm financially down?",
  "created_utc": 1641856385,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I (23F) and boyfriend (35M) have been dating for four years. We started dating right after I joined campus, and throughout I&amp;#39;ve never asked him for anything. While at school, my parents were not able to give me a pocket money, but I had a part-time job as a waitress and most of my fees was paid off by government bursaries, I only had to pay for the hostel.  During the pandemic most hotels closed down and thats how I lost my waitress job. Right after campus, I got unpaid internship that required me to work full time so I was using my little savings mostly. The company is yet to give me a full time job and I am really struggling, though they promised me this year. My boyfriend knows all that.&lt;/p&gt;\n\n&lt;p&gt;I have been doing online jobs, if I ever get any. So my rent has been due for 2 months and the landlord has been on my neck. I paid off some of the rent with the little money I had and now I owe the landlord $650.  Since we started dating this is the first time I&amp;#39;m asking my boyfriend for any kind of financial help and he outright refused. He has a stable job but doesn&amp;#39;t want to help me with the rent just this once. All he wants is for me to move in with him. Since last month I&amp;#39;ve been begging him but he says no and I&amp;#39;ve asked him severally if he can loan me the money and has also refused. I really love him, but he is very controlling and has anger issues. I don&amp;#39;t think I&amp;#39;ll be comfortable having constant fights with him everyday. Last time I slept over at his place on a weekend he slapped me over a misunderstanding. He apologized. This is why I don&amp;#39;t want to move in with him. He has been calling me to ask of I&amp;#39;ve packed my clothes and ready to move.&lt;/p&gt;\n\n&lt;p&gt;This has gotten me really thinking and I&amp;#39;ve decided not to pick up his calls anymore. I know he is not obligated to help with my rent just because we are dating. But I&amp;#39;ve always taken care of all my bills without his assistance. Am I just being petty or should I really rethink our relationship. Coz what&amp;#39;s the point of calling someone my ride or die if he can&amp;#39;t support me in such a desperate situation. I might be homeless but he doesn&amp;#39;t care, yet I have no one else to count on.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 132,
  "permalink": "/r/NoStupidQuestions/comments/s0rmev/should_i_rethink_our_4_year_relationship_if_my/",
  "subreddit": "NoStupidQuestions",
  "id": "s0rmev",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So I (23F) and boyfriend (35M) have been dating for four years. We started\ndating right after I joined campus, and throughout I've never asked him for\nanything. While at school, my parents were not able to give me a pocket money,\nbut I had a part-time job as a waitress and most of my fees was paid…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ということで、私（23F）と彼氏（35M）は付き合って4年目になります。付き合い始めたのは\n入学してすぐに付き合い始めましたが、今まで一度も頼み事をしたことがありません。\n何もない。在学中は、親からお小遣いをもらうことができませんでした。\nでも、ウェイトレスのアルバイトをしていたので、学費はほとんど払われていました...。",
      "title": "経済的に落ち込んでいるときに、彼氏が支えてくれないなら、4年間の交際を考え直すべき？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我（23岁）和男友（35岁）已经交往了四年。我们在我进入校园后就开始约会。\n我们在我进入校园后就开始约会，自始至终我都没有向他要求过什么。\n什么。在学校时，我的父母不能给我零花钱。\n但我有一份服务员的兼职工作，我的大部分费用都是由他支付的...。",
      "title": "如果我的男朋友不想在我经济拮据的时候支持我，我是否应该重新考虑我们4年的关系？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我（23歲）和男友（35歲）已經交往了四年。我們在我進入校園後就開始約會。\n我們在我進入校園後就開始約會，自始至終我都沒有向他要求過什麼。\n什麼。在學校時，我的父母不能給我零花錢。\n但我有一份服務員的兼職工作，我的大部分費用都是由他支付的...。",
      "title": "如果我的男朋友不想在我經濟拮据的時候支持我，我是否應該重新考慮我們4年的關係？"
    }
  ]
}