{
  "author": "FlocculentFractal",
  "original_created_utc": 1633030945,
  "title": "As humans, are we always carrying viruses? Or do we completely get rid of viruses when we recover from them?",
  "created_utc": 1633050754,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have a high school level biological sciences education and have studied mostly computer science since then.  I&#39;m given to understand that some people can be asymptomatic carriers of viruses and I want to understand how this works. From what I understand,</p>\n\n<ul>\n<li>Immunocompromised patients, e.g. those with AIDS, die due to causes other than HIV because their body is not able to fight other viruses, like influenza. When this happens, have they contracted influenza externally, or were these viruses in their body waiting to strike?</li>\n<li>Though I am vaccinated, I may be an asymptomatic carrier of COVID and should be careful out in public places.</li>\n</ul>\n\n<p>But I also thought,</p>\n\n<ul>\n<li>Viruses start replicating in your body, literally fill up cells and explode outwards, killing cells. This is how they reproduce, so some cells would always need to either be dying, or keep producing some small amount of the virus, but not enough to kill them, to keep some level of the virus in our body.</li>\n</ul>\n\n<p>So, how does this work? Am I still carrying the influenza variant from the last time I got the flu? I am not currently sick with the flu. Could I spread it to someone who is not immune to that variant? Or did my body completely get rid of that virus?</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/askscience/comments/pyr9ak/as_humans_are_we_always_carrying_viruses_or_do_we/",
  "subreddit": "askscience",
  "id": "pyr9ak",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I have a high school level biological sciences education and have studied mostly\ncomputer science since then. I'm given to understand that some people can be\nasymptomatic carriers of viruses and I want to understand how this works. From\nwhat I understand,\n\n * Immunocompromised patients, e.g. those…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は高校レベルの生物科学の教育を受けており、主に勉強してきました。\nコンピュータサイエンス となる人がいることを理解させてもらっています。\n無症状でウイルスのキャリアになる、その仕組みを理解したい。ということです。\n私の理解するところでは\n\n * 免疫不全の患者、例えば...",
      "title": "人間である私たちは、常にウイルスを持っているのでしょうか？それとも、ウイルスから回復したら、完全にウイルスから解放されるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我有高中水平的生物科学教育，此后主要学习了\n计算机科学，从那时起。我了解到，有些人可能是\n无症状的病毒携带者，我想了解这是怎么回事。根据我的理解\n我所理解的。\n\n *免疫力低下的病人，例如那些...",
      "title": "作为人类，我们总是携带病毒吗？或者说，当我们从病毒中恢复时，我们是否完全摆脱了病毒？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我有高中水平的生物科學教育，此後主要學習了\n計算機科學，從那時起。我瞭解到，有些人可能是\n無症狀的病毒攜帶者，我想了解這是怎麼回事。根據我的理解\n我所理解的。\n\n *免疫力低下的病人，例如那些...",
      "title": "作爲人類，我們總是攜帶病毒嗎？或者說，當我們從病毒中恢復時，我們是否完全擺脫了病毒？"
    }
  ]
}