{
  "author": "brianmonarch",
  "the_new_excerpt": "So... Hopefully any logical reader will see that I would have no reason to write\nthis if it wasn't the truth. Either way, this is what happened to me...\n\nI had A LOT of $PVDG in my Etrade account. I woke up on the morning of 3/10/21\nand logged into my Etrade Pro right when the market opened. All of…",
  "original_created_utc": 1615917264,
  "localize": [
    {
      "locale": "zh",
      "title": "尽快离开E*Trade！这只是发生。",
      "the_new_excerpt": "所以，希望任何一个有逻辑的读者都会明白，我没有理由写出...\n如果这不是事实的话 无论如何，这是发生在我身上的事情... ...\n\n我有很多的$PVDG在我的Etrade帐户。我在3/10/21早上醒来的时候\n并登录到我的Etrade Pro当市场开盘。所有的..."
    },
    {
      "locale": "zh-Hant",
      "title": "儘快離開E*Trade！這只是發生。",
      "the_new_excerpt": "所以，希望任何一個有邏輯的讀者都會明白，我沒有理由寫出...\n如果這不是事實的話 無論如何，這是發生在我身上的事情... ...\n\n我有很多的$PVDG在我的Etrade帳戶。我在3/10/21早上醒來的時候\n並登錄到我的Etrade Pro當市場開盤。所有的..."
    }
  ],
  "title": "Get out of E*Trade ASAP! This just happened.",
  "created_utc": 1615927458,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So...  Hopefully any logical reader will see that I would have no reason to write this if it wasn&#39;t the truth.  Either way, this is what happened to me...</p>\n\n<p>I had A LOT of $PVDG in my Etrade account.  I woke up on the morning of 3/10/21 and logged into my Etrade Pro right when the market opened.  All of a sudden at the bottom right corner of my screen I see messages &quot;PVDG Sell Executed&quot; and I immediately panic because I had NO intentions of selling this.  I see that 2.4 million shares were sold.  Keep in mind it was at around 8 cents the day prior.  Opens and sells at .0711.  It dropped big for no reason which leads me to believe that this happened to a bunch of accounts and that&#39;s what made it drop.  I immediately panic and buy back as many as I can.  I got around 2.2 million at the .074-ish range.  So lost 200k shares.  I never put in that trade.  No stop orders, no limit orders.  I called etrade.  Lady says I&#39;ll be taken care of.  Riiiiiight.  Finally get to fraud.  He asks me questions and investigates.  Tells me it was a MARKET ORDER put in after the bell the day prior.  I would NEVERRRRRR DO THAT.  Wasn&#39;t even logged in 45 minutes after the bell.  Etrade&#39;s guy was very nice.  Steve Doyle.  He gets back to me and tells me straight out... &quot;There were multiple red flags on your account.  There were 4 failed login attempts which never happens on your account and they looked at your profile after they logged in, which you never do.  So that&#39;s a good start.&quot;  (not to mention I&#39;ve been with these guys for at least 20 years and I have NEVER made after hours market sell.  You&#39;d have to be stupid to do that.  Either way, I didn&#39;t do it.  He makes me sign an affidavit and get it notarized AND make a police report.  Do that within an hour.  I ask him &quot;Is this common?!  I&#39;ve never heard of such craziness.  They broke into my account JUST to sell shares?!?&quot;  He says it&#39;s VERY common.  They bring the price down to get in cheaper.  Then he tells me what is even more common is they will sell a big corp stock like Amazon in the account, use the assets to buy a penny stock they are in so it goes up and they can sell higher.  Wow.  So...  He tells me they&#39;re working on it and he&#39;ll get back to me tomorrow.  Next thing I know it&#39;s dragging on and on and on.  Finally today he calls me back.  &quot;I&#39;m sorry...  But they&#39;ve determined that they won&#39;t be giving you your shares back and they don&#39;t want to do business with you anymore&quot;  UTTER shock on my end.  So I&#39;m basically saying &quot;Steve, you realize your company is basically telling me that they not only denying my claim that you made out in my mind to be obvious fraud, but on top of that they&#39;re now accusing me of lying and trying to steal from them... right?&quot;  He apologizes again and says he has no part of the final decision.  </p>\n\n<p>I mean, I&#39;m not one to talk about how much money I have, but I&#39;ll tell you this much, I have enough that I&#39;m not going to jump through ALL these ridiculous hoops to try to get 200k shares back because I regretted a trade I made (after hours market trade which I&#39;d never do I&#39;d like to point out once again.)  So insane!!!!!!  I was happy when they put me on 2 point authentication after this went down.  Made me feel way more secure...  Then this happens?  F them man.  I mean how are they viewing this?  I intentionally did multiple failed logins and looked at my profile the afternoon I made these trades just in case I regretted said trades the next day and I can claim fraud and those red flags (didn&#39;t even know they were red flags until he told me btw) were there to back me up?!?!  I am sooooooo pisssssseed off right now, and I want to do anything I can to let people know how awful this company is.  Let&#39;s not mention that you can&#39;t even talk to a live person without being on hold for OVER and HOUR every time you call.  These guys need to go bye bye and I hope this helps make that happen, even if it&#39;s just a little grain of sand in the vast beach of E*Trade complaints.  </p>\n\n<p>Now THAT my friends...  Is customer service.  F*CK THEM.  I don&#39;t think I forgot anything, but If you have any questions, I&#39;m more than happy to answer them.</p>\n</div><!-- SC_ON -->",
  "score": 52,
  "permalink": "/r/stocks/comments/m6f0er/get_out_of_etrade_asap_this_just_happened/",
  "subreddit": "stocks",
  "id": "m6f0er",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147382536
}