{
  "author": "SiliconeGiant",
  "original_created_utc": 1648906715,
  "title": "my girl is dogsitting at someone's house for a week and she's seeing pictures of young girls on the tv, tagged from 2007",
  "created_utc": 1648915154,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The clients are an older couple, I&amp;#39;m guessing the guy signed into his &lt;del&gt;google&lt;/del&gt; (edit seems to be amazon) account from 2007 and it&amp;#39;s connected. My first thought was to report it but that&amp;#39;s either really ruining someone&amp;#39;s life (if he&amp;#39;s not actually a pedo) or If they determine there&amp;#39;s nothing they can prosecute then it&amp;#39;s just drama for her so I want to be sure and asking here what we should do. &lt;/p&gt;\n\n&lt;p&gt;She sent me a couple of a young girl in a towel, I asked her not to send me the worst ones but she said some are pretty much straight up porn, no males involved. &lt;/p&gt;\n\n&lt;p&gt;What should we do? Thanks&lt;/p&gt;\n\n&lt;p&gt;Edit she said some were about 12 and &amp;quot;like penthouse&amp;quot; oof&lt;/p&gt;\n\n&lt;p&gt;Ok it seems like it&amp;#39;s connected to an Amazon photos account, It&amp;#39;s the screensaver, it was set to memories. I&amp;#39;m trying to get her to find the email it&amp;#39;s connected to. I&amp;#39;m guessing that&amp;#39;s what the fbi would want&lt;/p&gt;\n\n&lt;p&gt;Edit oh my God it&amp;#39;s connected to his wife&amp;#39;s account what the actual fuck&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/NoStupidQuestions/comments/tuj2op/my_girl_is_dogsitting_at_someones_house_for_a/",
  "subreddit": "NoStupidQuestions",
  "id": "tuj2op",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "The clients are an older couple, I'm guessing the guy signed into his google\n(edit seems to be amazon) account from 2007 and it's connected. My first thought\nwas to report it but that's either really ruining someone's life (if he's not\nactually a pedo) or If they determine there's nothing they can…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "クライアントは年配のご夫婦で、男性がgoogleにサインインしたのでしょう。\n(編集はamazonのようです)の2007年からのアカウントで、つながっています。最初に考えたのは\nを報告しようと思ったのですが、それは誰かの人生を本当に狂わせてしまうか（もし彼が\nペドロと判断された場合、あるいは、何もできないと判断された場合。",
      "title": "私の娘が一週間、誰かの家でドッグシッターをしているのですが、テレビで若い女の子の写真を見て、2007年のタグが付けられているのを見ています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "客户是一对年长的夫妇，我猜想那个人签入了他的谷歌\n(Edit seems to be amazon)的账户，并且它已经连接了。我的第一个想法是\n我的第一个想法是报告它，但这要么是真的毁了某人的生活（如果他不是\n实际上是一个恋童癖），或者如果他们确定没有什么他们可以...",
      "title": "我的女儿在别人家看狗一周，她在电视上看到年轻女孩的照片，标签是2007年的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "客戶是一對年長的夫婦，我猜想那個人簽入了他的谷歌\n(Edit seems to be amazon)的賬戶，並且它已經連接了。我的第一個想法是\n我的第一個想法是報告它，但這要麼是真的毀了某人的生活（如果他不是\n實際上是一個戀童癖），或者如果他們確定沒有什麼他們可以...",
      "title": "我的女兒在別人家看狗一週，她在電視上看到年輕女孩的照片，標籤是2007年的。"
    }
  ]
}