{
  "author": "Seebeedeee",
  "original_created_utc": 1634127995,
  "title": "BEWARE: There is NO reason anyone here or on other crypto subs should need to DM you! There is tons of scams all over Reddit. Stay safe.",
  "created_utc": 1634161011,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Yesterday, I saw a new person thrilled to respond to an obvious scammer via DMs on the ledger sub.  </p>\n\n<p>Virtually every hardware wallet sub, especially the ellipal sub, is crawling with scammers.  I think they target these subs because they know the users probably hold a significant amount of crypto and that they are new to securing it.  Sometimes these scammers even have company logos in their profile and user names that suggest they’re part of the company. </p>\n\n<p>So how can you tell if it’s a scam?…</p>\n\n<ol>\n<li><p>If they need to DM you, it’s most likely a scam.  These companies almost always prefer to communicate using email, not Reddit.</p></li>\n<li><p>Always check their profile to see if it looks legit.  Many people will claim to have promo codes or helpful info and need to DM you.  If their profile has zero posts and all their comments are asking for DMs, do not reply.  Replying will make you seem like a better target than ignoring.</p></li>\n<li><p>If someone sends you a link to your DMs, do NOT open it.  This is how your phone can become infected with malware designed to steal your crypto.  At the very least, it’s just another attempt at scamming.</p></li>\n<li><p>If ANYONE asks for your backup phrase, run away.  Do not give that to anyone ever, nobody needs it but you.  </p></li>\n</ol>\n\n<p>Please stay safe out there guys.</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/CryptoCurrency/comments/q7a1tx/beware_there_is_no_reason_anyone_here_or_on_other/",
  "subreddit": "CryptoCurrency",
  "id": "q7a1tx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Yesterday, I saw a new person thrilled to respond to an obvious scammer via DMs\non the ledger sub.\n\nVirtually every hardware wallet sub, especially the ellipal sub, is crawling\nwith scammers. I think they target these subs because they know the users\nprobably hold a significant amount of crypto and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昨日は、明らかな詐欺師にDMで対応してドキドキしている新規の方を見ました\nledgerのサブで。\n\nハードウェアウォレットのサブ、特にellipalのサブには、事実上すべての\n詐欺師がうようよしています。これらのサブをターゲットにしているのは、ユーザーが\nおそらくかなりの量の暗号を保有していて...",
      "title": "注意：このサイトや他の暗号サブサイトでは、誰もがあなたにDMを送る必要はありません。Redditにはたくさんの詐欺があります。ご安全に。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "昨天，我看到一个新人很兴奋地通过DMs回应一个明显的诈骗者\n在分类账子上。\n\n几乎每一个硬件钱包子，特别是椭圆子，都在爬行着\n诈骗者。我认为他们针对这些子项目，因为他们知道这些用户\n可能持有大量的加密货币和...",
      "title": "注意：这里或其他加密货币子系统的任何人都没有理由需要向你发送DM! Reddit上有大量的骗局。保持安全。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "昨天，我看到一個新人很興奮地通過DMs迴應一個明顯的詐騙者\n在分類賬子上。\n\n幾乎每一個硬件錢包子，特別是橢圓子，都在爬行着\n詐騙者。我認爲他們針對這些子項目，因爲他們知道這些用戶\n可能持有大量的加密貨幣和...",
      "title": "注意：這裏或其他加密貨幣子系統的任何人都沒有理由需要向你發送DM! Reddit上有大量的騙局。保持安全。"
    }
  ]
}