{
  "author": "jet_ski_jacky",
  "original_created_utc": 1658363098,
  "title": "Do teenagers really need sex-ed from their parents?",
  "created_utc": 1658382389,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I understand that it&amp;#39;s common for parents to discuss sex-ed with their kids. However, I&amp;#39;ve never really understood this. With the internet and mandated school instruction (at least in California), every middle schooler should know how sex works and what condoms and STDs are. Personally, I would find talking about sexual things really awkward with my parents. So, is it really necessary for parents to have the talk with their kid? And for those of you who had the talk with your parents, what do you think of it?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 249,
  "permalink": "/r/TooAfraidToAsk/comments/w424zq/do_teenagers_really_need_sexed_from_their_parents/",
  "subreddit": "TooAfraidToAsk",
  "id": "w424zq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I understand that it's common for parents to discuss sex-ed with their kids.\nHowever, I've never really understood this. With the internet and mandated\nschool instruction (at least in California), every middle schooler should know\nhow sex works and what condoms and STDs are. Personally, I would…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "親が子供と性教育について話し合うのは一般的なことだと理解しています。\nしかし、私はこれがよくわからないのです。インターネットや義務教育で\n学校での指導が義務付けられている（少なくともカリフォルニア州では）ので、中学生なら誰でも、セックスの仕組みやコンドームや性病について\nコンドームや性病がどんなものかを知っているはずです。個人的には、私は...",
      "title": "ティーンエイジャーに親からの性教育は本当に必要なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我明白，父母与孩子讨论性教育是很常见的。\n然而，我从来没有真正理解这一点。有了互联网和强制性的\n学校教学（至少在加利福尼亚），每个中学生都应该知道\n每个中学生都应该知道性是如何运作的，以及什么是避孕套和性病。就个人而言，我想...",
      "title": "青少年真的需要父母的性教育吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我明白，父母與孩子討論性教育是很常見的。\n然而，我從來沒有真正理解這一點。有了互聯網和強制性的\n學校教學（至少在加利福尼亞），每個中學生都應該知道\n每個中學生都應該知道性是如何運作的，以及什麼是避孕套和性病。就個人而言，我想...",
      "title": "青少年真的需要父母的性教育嗎？"
    }
  ]
}