{
  "author": "redflu88",
  "the_new_excerpt": "So I decided to visit the infamous /biz/ board on 4chan out of a mix of lockdown\nboredom and curiosity. I heard it’s basically the polar opposite of the crypto\nsubreddit, while still being focused on the same subject so it had me wondering\nwhat it is like on 'the other side’.\n\n 1. Ripple holders on…",
  "original_created_utc": 1618736280,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そこで私は、4chanの悪名高い/biz/掲示板を訪れてみることにしました。\n退屈と好奇心からです。基本的には、crypto\nサブレディットとは基本的に正反対だと聞いていましたが、同じテーマに焦点を当てていたので、「向こう側」はどんな感じなのだろうと思いました。\n向こう側」はどんな感じなんだろうと思いました。\n\n 1. リップルの保有者は...",
      "title": "私は4chan crypto boardを2ヶ月間潜んでいましたが、ここで学んだことがあります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我决定去访问4chan上臭名昭著的/biz/板块，出于锁定的考虑\n无聊和好奇心。听说，这基本上是与加密技术截然相反的。\n子reddit，同时还在关注同一个主题，所以让我很好奇。\n在 \"彼岸 \"是什么样子的。\n\n 1. 涟漪支架上...",
      "title": "我在4chan加密板块潜伏了2个月，以下是我的心得。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我決定去訪問4chan上臭名昭著的/biz/板塊，出於鎖定的考慮\n無聊和好奇心。聽說，這基本上是與加密技術截然相反的。\n子reddit，同時還在關注同一個主題，所以讓我很好奇。\n在 \"彼岸 \"是什麼樣子的。\n\n 1. 漣漪支架上...",
      "title": "我在4chan加密板塊潛伏了2個月，以下是我的心得。"
    }
  ],
  "title": "I lurked the 4chan crypto board for 2 months, here is what I learned:",
  "created_utc": 1618764226,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I decided to visit the infamous /biz/ board on 4chan out of a mix of lockdown boredom and curiosity. I heard it’s basically the polar opposite of the crypto subreddit, while still being focused on the same subject so it had me wondering what it is like on &#39;the other side’.</p>\n\n<ol>\n<li>Ripple holders on there are a full blown cult, they go to great lengths with their conspiracy theories, desperately trying to connect senseless ‘breadcrumbs’ regarding the SEC lawsuit and protect their coin with absolute conviction. They are regarded as ‘schizos’ by everybody else and even themselves at this point. After the recent ripple pump they might honestly become even more culty and think of themselves as prophets.</li>\n<li>The BSV camp is similar but it seems a bit more goofy. Their conspiracies are obscure and hilarious at the same time and they spread them almost ironically it feels like, as if they’re trying to get a reaction from the BTC maxis. There is a good chance that they are just trolling honestly, but I can’t tell for sure. For example there was this theory that when Tesla announced their bitcoin purchase, they actually bought BSV and not BTC, since BSV is the ‘real bitcoin’ made by the ‘real satoshi’ AKA Craig Wright. Obviously it was supported by nothing other than wishful thinking. They keep throwing out random dates when Craig will finally prove that he is the real satoshi and then just change it to something else. To me it’s just too funny to be real.</li>\n<li>There is a cult of old LINK holders who bought it for pennies and never sold, believing the project will go to a 1000$. They call themselves &#39;stinky linkies&#39; or &#39;link marines&#39; I honestly wouldn’t be surprised if some of them die irl before they sell their LINK. Their memes are top tier and they make fun of the core dev called Sergey Nazarov(Sirgay Betray) for being fat and ironically overreact when the developer wallet sells some LINK, saying that it’s over and that Sergey once again, you guessed it, betrayed them. Interestingly, from what I gathered, he never acknowledged 4chan or anything from them publicly, which makes their dedication even more bizarre.</li>\n<li>There is a ton of shilling, and I mean a TON, everyone shilling meme coins and animal coins, the vast majority of them are obvious scams, or as they call it ‘rugpulls’. Very rarely is there something legit that sticks for longer than a week. Despite the sea of rugpulls, there are a few groups that are loyal to one project, seemingly trying to replicate the success of link and become the next ‘link marines’. The most popular seems to be a project called Rubic. Similar to Link, it also has russian devs and a bit similar logo in terms of shape, so I guess that’s where their interest came from.</li>\n<li>People discussing stocks are called boomers, but there is not THAT much animosity between them and the dominant crypto crowd, that is unless you are talking about GME specifically. Everyone discussing/holding GME is a cuck who drinks soy and should ‘go back’(to reddit obviously). Generally, stocks are just referred to as ‘cringe’ and not ‘based’.</li>\n</ol>\n\n<p>This is by no means some 4chan hate thread, just a few observations I noticed and felt like sharing. The social dynamics are completely backwards and it can actually be very refreshing.</p>\n</div><!-- SC_ON -->",
  "score": 716,
  "permalink": "/r/CryptoCurrency/comments/mt99j4/i_lurked_the_4chan_crypto_board_for_2_months_here/",
  "subreddit": "CryptoCurrency",
  "id": "mt99j4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171519559
}