{
  "author": "superavg",
  "the_new_excerpt": "I'm biased towards the we're overvalued side of things.\n\nIt seems like lately the only reasoning many give for the current market prices\nare the low interest rates. This idea to me does not flow with the idea that\nmost investors demand at least some type of safety or risk aversion with…",
  "original_created_utc": 1610886796,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我偏向于我们被高估的一面。\n\n似乎最近很多人对目前的市场价格给出的唯一理由就是\n是低利率。在我看来，这种想法并不符合这样的想法。\n大多数投资者要求至少有一定的安全性或风险规避与... ...",
      "title": "观点）降息不会永远成为过度估值的理由。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我偏向於我們被高估的一面。\n\n似乎最近很多人對目前的市場價格給出的唯一理由就是\n是低利率。在我看來，這種想法並不符合這樣的想法。\n大多數投資者要求至少有一定的安全性或風險規避與... ...",
      "title": "觀點）降息不會永遠成爲過度估值的理由。"
    }
  ],
  "title": "(Opinion) Lower interest rates won't justify excessive valuations forever.",
  "created_utc": 1610905322,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m biased towards the we&#39;re overvalued side of things. </p>\n\n<p>It seems like lately the <em>only</em> reasoning many give for the current market prices are the low interest rates. This idea to me does not flow with the idea that most investors demand at least some type of safety or risk aversion with their investment choices. </p>\n\n<p>Lower interest rates, easy money, and simply no where else to put that money to gain a return, won&#39;t last forever. Sure, up until some given point (and that is the key) investors will flock to the only option available for returns. However, in my opinion, that level will slowly wane as the market rises along with the risk associated with it at these price levels. I don&#39;t believe investors will continue to put their money to work in a market that (at these price levels) only brings a higher level of risk with it. At some point money will stay on the sidelines. </p>\n\n<p>Low interest rates just might cut it as a qualifying reasoning for the current valuations, but they won&#39;t be the reasoning for a correction/recession if it occurs and stays. </p>\n\n<p>Low interest rates that fueled this IMO excessive market rally will eventually be named the cause of the eventual correction. At that point whether money on the sidelines flows in will be dependent upon the economic/stimulus conditions at the time.</p>\n</div><!-- SC_ON -->",
  "score": 173,
  "permalink": "/r/investing/comments/kz5o83/opinion_lower_interest_rates_wont_justify/",
  "subreddit": "investing",
  "id": "kz5o83",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1611311217225
}