{
  "author": "Sniff_RawMeat",
  "original_created_utc": 1639876127,
  "title": "We should create a DAO and buy Reddit once it IPOs",
  "created_utc": 1639884956,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This idea is a modification of a &lt;a href=\"/r/WSB\"&gt;r/WSB&lt;/a&gt; post I saw earlier today. We all know that crypto technology is the future and where better to display this technology than through Reddit. This is a rough idea ( kind of a joke but interesting to think about nonetheless) that I would love the community&amp;#39;s input on. &lt;/p&gt;\n\n&lt;p&gt;Reddit recently filed a confidential report with the SEC marking its first step toward an IPO. According to Forbes, Reddit&amp;#39;s most recent funding round yielded $700 Million, which puts the companies value at around $10 Billion. Most companies offer a limited number of shares at any given time. These shares are usually common stock which gives investors a right to vote and earn dividends (if dividends are offered). The right to vote is the important part. If an individual or group can buy a majority [ 50% plus 1] of a company&amp;#39;s voting stock, known as a controlling equity interest, then that individual or group has significant influence in the operating decisions of the company. However, a majority is not always required and significant influence can be achieved through owning a plurality of voting shares.   &lt;/p&gt;\n\n&lt;p&gt;This is where a DAO comes in. I think we all remember the ConstitutionDAO that valiantly tried to buy one of the 13 copies of the U.S Constitution. In what was our crypto National Treasure moment, we were presented with a real-world example of the power of crypto technology. Thousands of individuals, &amp;quot;The People&amp;quot;, participated to fundraise money and buy a piece of history. A RedditDAO could attempt a similar feat, but instead of buying an artifact, we could buy a controlling share of Reddit. We could all have a voice on the board of a publically traded company. We would be able to influence strategic and operational changes that impact Reddit users (all of us). Instead of being at the whims of management, we could become a part of management.  &lt;/p&gt;\n\n&lt;p&gt;I neither know the legal behind a DAO having a seat on the board of a publically traded company nor do I know the steps toward creating a DAO, but If someone with the know-how and resources does then this could be an interesting endeavor. &lt;/p&gt;\n\n&lt;p&gt;For those of you that didn&amp;#39;t labor through the paragraphs above here is the TLDR: &lt;/p&gt;\n\n&lt;p&gt;TLDR: We create a RedditDAO to buy a controlling or influencing share of Reddit once it IPOs. With this influence, we not only have a voice in the decisions of the company but protection from potentially harmful policies.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 190,
  "permalink": "/r/CryptoCurrency/comments/rjl893/we_should_create_a_dao_and_buy_reddit_once_it_ipos/",
  "subreddit": "CryptoCurrency",
  "id": "rjl893",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This idea is a modification of a r/WSB [/r/WSB] post I saw earlier today. We all\nknow that crypto technology is the future and where better to display this\ntechnology than through Reddit. This is a rough idea ( kind of a joke but\ninteresting to think about nonetheless) that I would love the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このアイデアは、今日早くに見たr/WSB[/r/WSB]の投稿を修正したものです。私たちは皆\n暗号技術は未来であり、この技術を展示するのに最適な場所であることを知っています。\nRedditより優れた技術です。これは大まかなアイデアです（冗談のようなものですが\nということで、ぜひ、このような企画を考えてみたいと思います。",
      "title": "DAOを作り、RedditがIPOしたら買うべき"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这个想法是我今天早些时候看到的一个r/WSB[/r/WSB]帖子的修改。我们都知道\n我们都知道，加密技术是未来的趋势，在哪里可以更好地展示这种技术呢？\n技术的最佳途径是通过Reddit。这是一个粗略的想法（有点像一个笑话，但\n这是个粗略的想法（有点像笑话，但还是很有趣的），我很希望...",
      "title": "我们应该创建一个DAO，一旦Reddit上市就购买它"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個想法是我今天早些時候看到的一個r/WSB[/r/WSB]帖子的修改。我們都知道\n我們都知道，加密技術是未來的趨勢，在哪裏可以更好地展示這種技術呢？\n技術的最佳途徑是通過Reddit。這是一個粗略的想法（有點像一個笑話，但\n這是個粗略的想法（有點像笑話，但還是很有趣的），我很希望...",
      "title": "我們應該創建一個DAO，一旦Reddit上市就購買它"
    }
  ]
}