{
  "author": "MizLucyO",
  "original_created_utc": 1643324160,
  "title": "So, how much does your significant other know?",
  "created_utc": 1643384557,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The recent &amp;quot;crash&amp;quot; and fear and greed index at an all time high has had me pretty quiet about crypto around the house lately. Every once in awhile the old hubster will mention something about  &amp;quot;bitcoin tanking&amp;quot; and I manage to mutter a  &amp;quot;yeah it&amp;#39;s bad&amp;quot; and change the subject to college football or basketball. Or I just give the obligatory &amp;quot;I just hope the Kardashians are OK&amp;quot; type response.&lt;/p&gt;\n\n&lt;p&gt;He hasn&amp;#39;t said much about all the bank withdrawals and I&amp;#39;ve been waiting for it and am pretty sure I&amp;#39;m &amp;quot;this close&amp;quot; to hearing about it so I quit putting money in. All I keep hearing is &amp;quot;tax time is going to be a bitch with all that crypto stuff your doing&amp;quot; and then as my kids say &amp;quot;butt clench time&amp;quot; but until then I guess I&amp;#39;ll keep moving things around and trying to make the red green and keep the rest as it is.&lt;/p&gt;\n\n&lt;p&gt;Every once in awhile I see the &amp;quot;should I tell the wife&amp;quot; posts and ...idk...So...that got me thinking how much does she know? Or for the other 3 ladies and few gents with husbands in here does &amp;quot;he&amp;quot; know? It&amp;#39;s bad enough I&amp;#39;m on my phone in the middle of the night checking things...he&amp;#39;d probably be grateful if it was porn but nope...I&amp;#39;m such a nerd crypto is my side piece. Thoughts?&lt;/p&gt;\n\n&lt;p&gt;TLDR - Does you SO know how much you&amp;#39;ve spent/made in crypto? You gonna tell them?&lt;/p&gt;\n\n&lt;p&gt;Edit: So, our relationship is good, 23 yrs strong.  We are financially sound and own everything. I&amp;#39;m talking less than 10k. The post was brought on by the downturn where I&amp;#39;m down about 40% and it&amp;#39;s more about being perceived as making a bad investment decision and not wanting to talk about it. I&amp;#39;m not hiding it but he hasn&amp;#39;t asked and I&amp;#39;m not bringing it up. BTW, he&amp;#39;s not perfect either. I&amp;#39;ve also seen a lot of &amp;quot;should I tell the wife&amp;quot; questions and that&amp;#39;s why I asked where everyone&amp;#39;s at ...pure curiosity.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 305,
  "permalink": "/r/CryptoCurrency/comments/seb7ei/so_how_much_does_your_significant_other_know/",
  "subreddit": "CryptoCurrency",
  "id": "seb7ei",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The recent \"crash\" and fear and greed index at an all time high has had me\npretty quiet about crypto around the house lately. Every once in awhile the old\nhubster will mention something about \"bitcoin tanking\" and I manage to mutter a\n\"yeah it's bad\" and change the subject to college football or…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近の「暴落」と史上最高値の「恐怖と強欲」指数に、私はすっかり参ってしまいました。\n最近、家の中では暗号についてかなり静かです。たまに、古い\n旦那が「ビットコインが暴落している」と言い出すので、なんとか呟きながら\n「そうですね......」と言いながら、大学サッカーの話に切り替えたり......。",
      "title": "では、あなたの大切な人はどこまで知っているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近的 \"崩溃 \"和恐惧与贪婪指数处于历史高位，让我最近对家里的加密货币相当沉默。\n最近在家里对加密货币相当安静。每隔一段时间，老\n丈夫会提到一些关于 \"比特币下跌 \"的事情，而我则设法嘀咕一句\n\"是的，这很糟糕\"，然后把话题转移到大学足球或......",
      "title": "那么，你的重要他人知道多少呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近的 \"崩潰 \"和恐懼與貪婪指數處於歷史高位，讓我最近對家裏的加密貨幣相當沉默。\n最近在家裏對加密貨幣相當安靜。每隔一段時間，老\n丈夫會提到一些關於 \"比特幣下跌 \"的事情，而我則設法嘀咕一句\n\"是的，這很糟糕\"，然後把話題轉移到大學足球或......",
      "title": "那麼，你的重要他人知道多少呢？"
    }
  ]
}