{
  "author": "CurSpider",
  "the_new_excerpt": "Good day everyone, My family and I are changing to a situation where we won't\nneed to pay for accommodation again while we continue to do the jobs we are just\nstarting (long story but we're stoked to get this expense off our books).\n\nI currently run a three fund portfolio like a sane person.\n\nWe…",
  "original_created_utc": 1623495630,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。私と私の家族は、今の仕事を続けながら、宿代を二度と払わなくて済むような状況に変えようとしています。\n私の家族と私は、今始めたばかりの仕事を続けながら、宿泊費を再び支払う必要のない状況に変えようとしています。\n長い話になりますが、この費用を帳消しにしたいと思っています）。\n\n私は現在、3つのファンドのポートフォリオをまともな人のように運用しています。\n\n私たちは...",
      "title": "現在、3つのファンドでポートフォリオを組んでいますが、家を売ったばかりで資金が必要ありません...。全部積み上げる？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好！我和我的家人正在改变现状，我们将不再需要支付住宿费用，同时我们继续做我们现在的工作。\n我们需要再次支付住宿费用，同时我们继续做我们刚刚开始的工作\n说来话长，但我们很想把这笔费用从我们的账面上去除）。\n\n我目前像一个理智的人一样管理着三个基金组合。\n\n我们...",
      "title": "目前有3个基金投资组合，刚卖了房子，不需要这些资金...... 把它全部投入吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好！我和我的家人正在改變現狀，我們將不再需要支付住宿費用，同時我們繼續做我們現在的工作。\n我們需要再次支付住宿費用，同時我們繼續做我們剛剛開始的工作\n說來話長，但我們很想把這筆費用從我們的賬面上去除）。\n\n我目前像一個理智的人一樣管理着三個基金組合。\n\n我們...",
      "title": "目前有3個基金投資組合，剛賣了房子，不需要這些資金...... 把它全部投入嗎？"
    }
  ],
  "title": "Currently a 3 fund portfolio boglehead, just sold house & don't need the funds... Pile it all in?",
  "created_utc": 1623505039,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Good day everyone,\nMy family and I are changing to a situation where we won&#39;t need to pay for accommodation again while we continue to do the jobs we are just starting (long story but we&#39;re stoked to get this expense off our books).</p>\n\n<p>I currently run a three fund portfolio like a sane person.</p>\n\n<p>We just sold our house and won&#39;t be looking to buy/build W/E for at least 20 years of until retirement. Would you just put all the equity we had in the house ( ~130k USD) and allocate it accordingly? This is my default move I am thinking since the need for the money is a long way off.</p>\n\n<p>Thanks,</p>\n</div><!-- SC_ON -->",
  "score": 95,
  "permalink": "/r/Bogleheads/comments/ny483x/currently_a_3_fund_portfolio_boglehead_just_sold/",
  "subreddit": "Bogleheads",
  "id": "ny483x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009741226
}