{
  "author": "NineteenSixtySix",
  "the_new_excerpt": "https://www.businesswire.com/news/home/20210420005521/en/Palantir-and-Ringier-Extend-Digital-Transformation-Partnership\n\nApril 20, 2021 05:00 AM Eastern Daylight Time\n\nDENVER & ZURICH--(BUSINESS WIRE)--Palantir Technologies Inc. (NYSE:PLTR) and\nRingier AG today announced they have renewed their…",
  "original_created_utc": 1618913083,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "https://www.businesswire.com/news/home/20210420005521/en/Palantir-and-Ringier-Extend-Digital-Transformation-Partnership\n\n4月20日午前05時00分（東部夏時間\n\nデンバーとチューリッヒ--(BUSINESS WIRE)--Palantir Technologies Inc. (NYSE:PLTR) と\nパランティア・テクノロジーズ・インク（NYSE:PLTR）とリンギエールAGは、本日、パランティア・テクノロジーズ・インクとリンギエールAGの提携を更新しました。",
      "title": "PalantirとRingier、デジタルトランスフォーメーションのパートナーシップを拡大"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "https://www.businesswire.com/news/home/20210420005521/en/Palantir-and-Ringier-Extend-Digital-Transformation-Partnership\n\n2021年4月20日东部夏令时间上午05:00\n\n丹佛和苏黎世--(美国商业资讯)--Palantir Technologies Inc. (NYSE:PLTR)和Ringier AG今天宣布，他们已经与Ringier AG续约。\n荣格公司今天宣布，他们已经续签了他们的合作协议。",
      "title": "帕兰提尔和荣格延长数字转型合作关系"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "https://www.businesswire.com/news/home/20210420005521/en/Palantir-and-Ringier-Extend-Digital-Transformation-Partnership\n\n2021年4月20日東部夏令時間上午05:00\n\n丹佛和蘇黎世--(美國商業資訊)--Palantir Technologies Inc. (NYSE:PLTR)和Ringier AG今天宣佈，他們已經與Ringier AG續約。\n榮格公司今天宣佈，他們已經續簽了他們的合作協議。",
      "title": "帕蘭提爾和榮格延長數字轉型合作關係"
    }
  ],
  "title": "Palantir and Ringier Extend Digital Transformation Partnership",
  "created_utc": 1618925733,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.businesswire.com/news/home/20210420005521/en/Palantir-and-Ringier-Extend-Digital-Transformation-Partnership\">https://www.businesswire.com/news/home/20210420005521/en/Palantir-and-Ringier-Extend-Digital-Transformation-Partnership</a></p>\n\n<p>April 20, 2021 05:00 AM Eastern Daylight Time</p>\n\n<p>DENVER &amp; ZURICH--(BUSINESS WIRE)--Palantir Technologies Inc. (NYSE:PLTR) and Ringier AG today announced they have renewed their strategic partnership to provide Ringier with software to further its digital transformation and accelerate its shift to a digital-first global media company.</p>\n\n<p>Ringier uses Palantir’s Foundry software to harness the power of data in order to better serve and inform readers. By expanding reach and enhancing the relationship to its audience, Ringier is able in turn to increase the revenue needed to fund quality journalism. In addition to being used in newsrooms, Ringier also uses Foundry to improve performance in the advertising departments across its media brands.</p>\n\n<p>Foundry transforms the way organizations operate by creating a central operating system for their data. It allows for the integration of siloed data sources into a common operating picture, leading to better data-driven decision making across the enterprise.</p>\n\n<p>Ringier embarked on an ambitious digital transformation plan more than a decade ago, embracing the shift from a legacy newspaper business into a diversified, digital-first, global media company through significant investments in technology and skills.</p>\n\n<p>“Ringier provides premium journalism. Yet, the European digital publishing space is changing. We wanted to be able to arm our journalists with the best possible data, so they could better serve and inform our readers. Palantir’s world-leading integration technology enabled us to create a secure, comprehensive data foundation that enables experienced journalists to make more informed decisions about what content best serves their local communities,” said Marc Walder, chief executive officer of Ringier AG.</p>\n\n<p>In the case of Blick.ch, one of Switzerland’s top digital properties, up to 85% of the newsroom’s team looks at Foundry every day to analyze readership and performance, and set goals associated with these analytics.</p>\n\n<p>Foundry’s easy-to-use interface allows people of all technical ability to interact with data, while its granular access controls ensure only the right people have access to the right data at the right time.</p>\n\n<p>“Ringier is one of Switzerland’s most innovative and iconic companies, and we could not be more proud to be expanding our partnership,” said Alexander Karp, co-founder and chief executive officer of Palantir. “We have learned an immense amount from Ringier, whose history stretches back nearly two centuries, and are privileged to work with such a pathbreaker in its field.”</p>\n\n<p>Palantir is proud to have a strong presence across Europe and in Switzerland, working with global leaders such as Merck KGaA and Airbus. It has an office in Zurich and plans to continue its expansion in Switzerland.</p>\n\n<p>About Ringier</p>\n\n<p>Ringier AG is an innovative, digitalised and diversified Swiss media company operating in Europe, Asia and Africa. Its portfolio includes around 125 subsidiaries in the print, digital media, radio, ticketing, entertainment and e-commerce sectors and leading online marketplaces for cars, property and jobs. As a venture capital provider, Ringier supports innovative digital start-ups. Ringier, a family company founded in 1833 as a publishing house and printing plant, has invested consistently in digitalisation and global expansion in recent years. Today, over 72 per cent of its operating profit already comes from digital, where Ringier is a leader among European media companies. Ringier’s core values are independence, freedom of expression and a pioneering spirit. Additional information is available at <a href=\"http://www.ringier.ch\">www.ringier.ch</a>.</p>\n</div><!-- SC_ON -->",
  "score": 71,
  "permalink": "/r/investing/comments/mun22n/palantir_and_ringier_extend_digital/",
  "subreddit": "investing",
  "id": "mun22n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171524773
}