{
  "author": "TcheQuevara",
  "original_created_utc": 1636244146,
  "title": "How do we know \"cave men\" lived poor lives, almost entirely focused on subsistence and survival, if pre-Columbian hunter gatherers contacted with in the 16th century didn't?",
  "created_utc": 1636258681,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was reading the Wikipedia article on the <a href=\"https://en.wikipedia.org/wiki/Lion-man\">Lion-man figurine</a> and there is this quote:  &quot;... so why would a community living on the edge of subsistence, whose primary concerns were finding food, keeping that fire going, protecting children from predators, allow someone to spend so much time away from those tasks?&quot; [carving ivory to craft the figurine, in this case]</p>\n\n<p>However, the hunter-gatherers of the Americas lived lives full of  complex rituals that took a lot of time (including wars driven by vendetta) and used to wear garments that were very rich from an artistic perspective, even when sophisticated materials weren&#39;t avaiable. Of course their life wasn&#39;t easy, but it&#39;s far from this empoverished image the quote is conjuring. Some would argue hunter-gathering Amerindians had a lot of time to dedicate to leisure and culture. Is there a reason why &quot;cave men&quot; of Europe and Asia wouldn&#39;t live like that?</p>\n\n<p>Also, plenty them were semi-agriculturalists. Are we certain &quot;cave men&quot; weren&#39;t semi-agriculturalists? And why?</p>\n\n<p>(I&#39;m comparing the people who left archeological sites in Europe to Amerindians who <em>did not</em> live in agrarian, large scale societies, like the Incas, Mayas and Astecs)</p>\n</div><!-- SC_ON -->",
  "score": 115,
  "permalink": "/r/AskHistorians/comments/qocvks/how_do_we_know_cave_men_lived_poor_lives_almost/",
  "subreddit": "AskHistorians",
  "id": "qocvks",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was reading the Wikipedia article on the Lion-man figurine\n[https://en.wikipedia.org/wiki/Lion-man] and there is this quote: \"... so why\nwould a community living on the edge of subsistence, whose primary concerns were\nfinding food, keeping that fire going, protecting children from predators,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ライオンマンのフィギュアのWikipediaの記事を読んでいたら\n[https://en.wikipedia.org/wiki/Lion-man] で、こんな言葉がありました。「...では、なぜ\n食物を見つけ、火を絶やさず、子供を守ることを第一に考えていた自給自足のギリギリの生活をしているコミュニティが\n食物を見つけること、火を絶やさないこと、子供を外敵から守ること...。",
      "title": "16世紀に接触したコロンブス以前の狩猟採集民がそうではなかったとしても、「穴居人」がほとんど自給自足の貧しい生活をしていたことがなぜわかるのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在阅读维基百科关于狮人塑像的文章时\n[https://en.wikipedia.org/wiki/Lion-man]，其中有这样一段话。\"......那么为什么\n为什么一个生活在生存边缘的社区，其主要关注点是\n寻找食物，保持火势，保护儿童不受捕食者伤害，......。",
      "title": "我们怎么知道 \"穴居人 \"过着贫穷的生活，几乎完全专注于生计和生存，如果在16世纪接触到的前哥伦比亚狩猎采集者没有这样的生活？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在閱讀維基百科關於獅人塑像的文章時\n[https://en.wikipedia.org/wiki/Lion-man]，其中有這樣一段話。\"......那麼爲什麼\n爲什麼一個生活在生存邊緣的社區，其主要關注點是\n尋找食物，保持火勢，保護兒童不受捕食者傷害，......。",
      "title": "我們怎麼知道 \"穴居人 \"過着貧窮的生活，幾乎完全專注於生計和生存，如果在16世紀接觸到的前哥倫比亞狩獵採集者沒有這樣的生活？"
    }
  ]
}