{
  "author": "weeping_nymph",
  "original_created_utc": 1643032608,
  "title": "How do people manage to break condoms?",
  "created_utc": 1643044295,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My partner and I have used condoms for birth control for the entirety of our 5 year relationship. He&amp;#39;s well hung, so he fits very snuggly into every condom we&amp;#39;ve used, including the ones we use now which are marketed as ultra thin with minimal lubricant.&lt;/p&gt;\n\n&lt;p&gt;We love to get rough, and despite that, we&amp;#39;ve never had a single condom break. Doesn&amp;#39;t matter what position we&amp;#39;re in or how hard we go at it, it has always stayed intact. &lt;/p&gt;\n\n&lt;p&gt;So why is it that I hear of so many people having this issue with condoms breaking? I&amp;#39;ve seen some people online say they don&amp;#39;t use condoms because of how easily they break. Do people store their condoms in a hot car or something? do you keep a condom in your wallet for months and still use it? Whether it&amp;#39;s a matter of brand or improper storage or something else.. how in the hell do people manage to break them?? I can fit my foot in one of those things! I can fill it with a shit ton of water and it still doesn&amp;#39;t break! so what gives??&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 130,
  "permalink": "/r/TooAfraidToAsk/comments/sbmry5/how_do_people_manage_to_break_condoms/",
  "subreddit": "TooAfraidToAsk",
  "id": "sbmry5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "My partner and I have used condoms for birth control for the entirety of our 5\nyear relationship. He's well hung, so he fits very snuggly into every condom\nwe've used, including the ones we use now which are marketed as ultra thin with\nminimal lubricant.\n\nWe love to get rough, and despite that,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私たち夫婦は、5年間ずっとコンドームで避妊してきました。\nの関係です。彼はスタイルが良いので、どのコンドームもぴったりとはまります。\n今使っているものも含めて、超薄型で、かつ\n潤滑油も最小限。\n\n私たちは乱暴なことが大好きで、それにもかかわらず...",
      "title": "コンドームが壊れるのはどうして？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在我们5年的关系中，我和我的伴侣一直使用安全套来控制生育。\n年的关系。他的身材很好，所以他非常贴合每一个安全套。\n包括我们现在使用的安全套，这些安全套在市场上被称为超薄型，只需极少的润滑剂。\n润滑剂最少的。\n\n我们喜欢粗暴行事，尽管如此，我们的关系还是很好。",
      "title": "人们是如何做到打破安全套的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在我們5年的關係中，我和我的伴侶一直使用安全套來控制生育。\n年的關係。他的身材很好，所以他非常貼合每一個安全套。\n包括我們現在使用的安全套，這些安全套在市場上被稱爲超薄型，只需極少的潤滑劑。\n潤滑劑最少的。\n\n我們喜歡粗暴行事，儘管如此，我們的關係還是很好。",
      "title": "人們是如何做到打破安全套的？"
    }
  ]
}