{
  "author": "HoldEnvironmental930",
  "original_created_utc": 1627543530,
  "title": "In consideration of this cycle approaching its ATH, a few lessons i learned 2014/2017. Or, how not to burn your money.",
  "created_utc": 1627565751,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m in no way an experienced trader, but i think i learned a thing or two by burning my fingers in the last bull and bear markets. Hopefully this can be help for some of you to avoid the same mistakes. </p>\n\n<p><strong>Cycles and the flood lifts all boats</strong></p>\n\n<p>There are a bunch of theories and modles as of why the market cycles occur. In retrospect we see that the bitcoin halving is triggering a bull market.</p>\n\n<p><a href=\"https://preview.redd.it/xycyobl6k3e71.png?width=1745&amp;format=png&amp;auto=webp&amp;s=1fcf7f74be6bd547342bcac051a2b78d2867ade1\">Log halving/price chart</a></p>\n\n<p><em>&quot;Bitcoin is the first digitally scarce thing known to mankind, and within its inner workings is a Mathematical mechanism that should make Bitcoin&#39;s value continue to rise. Each bitcoin is mined from so-called &quot;blocks&quot;. A block is a 1MB piece of information that describes all transactions that take place within a period of time. A new block is generated roughly every 10 minutes. The Bitcoin network has been generating blocks, uninterrupted ever since its inception. The first block (genesis block) was generated on the 3rd of January 2009 and the reward for mining it was 50 bitcoins (BTC). Every subsequent block had the same mining reward but on every 210.000 generated blocks there is an event called &quot;halving&quot; which cuts, in half, the reward value distributed to miners from that moment on. In other words from block 210.000 onwards the reward is halved to 25 BTC; from block 420.000 onwards, it&#39;s halved to 12,5 BTC; and so on. Since blocks are generated every 10 minutes, &quot;halving events&quot; take place every 35.000 hours: almost exactly every 4 years.</em> </p>\n\n<p><em>Halving events will continue taking place until the reward for miners reaches 0 BTC. Since Bitcoin&#39;s value representation has 8 decimal places, after the 33rd halving, the value of the reward will hit precisely 0 BTC. 33 halving events every 4 years adds up to 132 years total. The last Bitcoin to be mined into existence will be mined in the year 2140. It will be the 21 million&#39;th Bitcoin to come into existence, and last, after which point it will be impossible to create anymore. From then on, Bitcoin will become truely &#39;deflationary&#39;, since &quot;printing&quot; / &quot;minting&quot; / &quot;mining&quot; new coins will no longer be possible, and if owners keep on losing their private keys, as they currently are, then the supply would further deflate by that lost-keys ratio.&quot;</em></p>\n\n<p><strong>Bitcoin is King.</strong> Meaning that historically the value of other cryptos is correlated to BTC. To some extent or another. BTC goes up, market goes up. BTC goes down, market goes down. </p>\n\n<p>There will be a overheated period and a cool down period. So lesson 1 i wished i learned earlier</p>\n\n<p>&#x200B;</p>\n\n<h1>Lesson 1</h1>\n\n<h1>Have an exit strategy and stick to it</h1>\n\n<p>There are different kinds of strategies and you got to decide wich fits your bill. But in the end you will get emotional. We all do. Ignore it and <strong>stich to the plan!</strong></p>\n\n<p><strong>The Step-by-Step-Method</strong></p>\n\n<p>Always make sure you have a plan before investing in anything. You should think about when you will be satisfied with the result. Will a 20% increase in price make you happy? Or are you someone that wants at least 200% profits before selling? This is where the Step-by-Step-Method comes into play. The Step-by-Step-Method allows you to sell a predetermined percentage of your crypto at certain price points. There is not a golden rule that will lead to definitive success. However, this strategy can prevent <strong>becoming to greedy, or selling to late, while still taking profits from time-to-time</strong>. Many investors will always keep 5-10% of their holdings for a longer period of time, just in case of a bigger up-cycle or because they firmly believe in the project they have invested in. <strong>It is always smart to take profits at a certain price range</strong>. An example of the step-by-step-method can be found below.</p>\n\n<p>&#x200B;</p>\n\n<table><thead>\n<tr>\n<th align=\"left\">SELLING POINT</th>\n<th align=\"left\">% of holdings sold</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">40.000$</td>\n<td align=\"left\">10%</td>\n</tr>\n<tr>\n<td align=\"left\">50.000$</td>\n<td align=\"left\">10%</td>\n</tr>\n<tr>\n<td align=\"left\">59.500$</td>\n<td align=\"left\">20%</td>\n</tr>\n<tr>\n<td align=\"left\">and so on...</td>\n<td align=\"left\"></td>\n</tr>\n</tbody></table>\n\n<p><strong>Initial Investment Return</strong></p>\n\n<p>Another smart things is taking profits similar to the invested amount. For example, if you have invested 1000 dollars, taking profits to an equal amount on a later point in time could be a great way to liquidate the risk of losing money. This way you make sure that no matter what happens, you can never lose more money than you initially invested.</p>\n\n<p>Do your own due dillegence and find out what levels you&#39;re comfortable with. Then stick to it. </p>\n\n<p>You will be a little unhappy if you leave a 50% gain on the table. You will be pissed when you&#39;ll lose 95% and have to wait 3 years to break even!</p>\n\n<p>&#x200B;</p>\n\n<h1>Lesson 2.</h1>\n\n<h1>There will be a long bear market</h1>\n\n<p>What goes up will come down. This is the time where you start accumulationg and DCA ( Dollar-cost averaging).  </p>\n\n<p>Dollar-cost averaging (DCA) is an investment strategy in which an investor divides up the total amount to be invested across periodic purchases of a target asset in an effort to <strong>reduce the impact of volatility on the overall purchase</strong>. The purchases occur regardless of the asset&#39;s price and at regular intervals. In effect, this strategy removes much of the detailed work of attempting to time the market in order to make purchases of equities at the best prices. Dollar-cost averaging is also known as the constant dollar plan. A 2012 study by Vanguard found that historically investing your money in a lump sum vs. dollar-<strong>cost averaging produced better results 66 percent of the time</strong>. The longer the time frame, the greater the chance that investing all at once beat dollar-cost averaging, the study found.</p>\n\n<p>Ideally you have some profits from the bull market which you DCA over a period of 3-5years. Set a date (monthly, weekly..eg) and an amount. Then stick to it. Take your time. There is always the next big BTC or ETH killer. Take your time to do your DD. Then formulate a strategy. And srick to it. </p>\n\n<p>Also, there is always some buzz. Be it the HODL gang trying to convince you to buy their stake or the bear gang trying to buy cheap. Be smart. Buy when theres blood on the street. Sell when you grandmother is asking to buy her BTC. </p>\n\n<p>&#x200B;</p>\n\n<h1>Lesson 3</h1>\n\n<h1>Taxes</h1>\n\n<p>Track every buy and sell. Be it via excell or a crypto tax service. Inform yourself when and how your crypto is taxes. FiFo, capital gain, holding deadlines and tax exemptions. Then fill your taxes properly.</p>\n\n<p>Don&#39;t be the guy that owns the gouverment 500k$ in taxes and lost everything during a bear cycle. </p>\n\n<h1>Lesson 4</h1>\n\n<h1>Nice to know</h1>\n\n<p><strong>Make a cheklist. Don&#39;t buy because you like the logo or animal</strong></p>\n\n<p>- Can it be easily copied? </p>\n\n<p>- Is the Team competent and trustworthy?</p>\n\n<p>-  How big is the market they&#39;re targeting? </p>\n\n<p>- How is the vakue actually derived for the holder? </p>\n\n<p>- What are the weaknesses/problems?</p>\n\n<p>- How is the project fundet?</p>\n\n<p>- Is it audited?</p>\n\n<p>- What problem does it solve?</p>\n\n<p>-  Who is their competition and what does it do better? </p>\n\n<p>and so on...</p>\n\n<p><strong>Research</strong> </p>\n\n<p>- Critcally evaluta the projects website. Is it professional or just an accumulaiton of buzzwords.</p>\n\n<p>- Read the whitepaper</p>\n\n<p>- Explore the blockchain and teh distribution. Are there big accounts? Regualr selloffs?</p>\n\n<p>- Is the Github repository busy?</p>\n\n<p>- Is there much &quot;shilling&quot; going on? </p>\n\n<p>- See if the team has a discord, blog, youtube and take a look on the quality of the discussions? Is it about price or quality of the product?</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/otsqbd/in_consideration_of_this_cycle_approaching_its/",
  "subreddit": "CryptoCurrency",
  "id": "otsqbd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm in no way an experienced trader, but i think i learned a thing or two by\nburning my fingers in the last bull and bear markets. Hopefully this can be help\nfor some of you to avoid the same mistakes.\n\nCycles and the flood lifts all boats\n\nThere are a bunch of theories and modles as of why the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は決して経験豊富なトレーダーではありませんが、過去の強気相場や弱気相場で指を焼いたことで、いくつかのことを学んだと思います。\nしかし、過去の強気と弱気の市場で指を焼いて学んだと思います。願わくば、同じ失敗を避けるために\n同じ過ちを犯さないための参考になれば幸いです。\n\nサイクルと洪水はすべての船を浮かせる\n\nなぜ強気相場と弱気相場が繰り返されるのかについては、様々な理論やモデルがあります。",
      "title": "このサイクルがATHに近づいていることを考慮して、2014/2017年にいくつかの教訓を得ました。あるいは、いかにしてお金を燃やさないかということ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我绝不是一个有经验的交易员，但我认为我通过在过去的牛市和熊市中烧毁手指学到了一两件事。\n在过去的牛市和熊市中烧毁了我的手指。希望这能帮助\n避免你们中的一些人犯同样的错误。\n\n周期和水涨船高\n\n有一堆理论和模型来说明为什么会有这样的情况。",
      "title": "考虑到这个周期接近其ATH，2014/2017年我学到了一些教训。或者说，如何不烧掉你的钱。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我絕不是一個有經驗的交易員，但我認爲我通過在過去的牛市和熊市中燒燬手指學到了一兩件事。\n在過去的牛市和熊市中燒燬了我的手指。希望這能幫助\n避免你們中的一些人犯同樣的錯誤。\n\n週期和水漲船高\n\n有一堆理論和模型來說明爲什麼會有這樣的情況。",
      "title": "考慮到這個週期接近其ATH，2014/2017年我學到了一些教訓。或者說，如何不燒掉你的錢。"
    }
  ]
}