{
  "author": "RichmondRay",
  "original_created_utc": 1647556356,
  "title": "Russia is having a lot of logistical difficulties in its invasion of Ukraine. Did the Soviet Union have the same problems supplying and feeding troops during its war in Afghanistan?",
  "created_utc": 1647574115,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Watching all of the problems Russia is having keeping its troops well-equipped and well-fed in Ukraine, a neighboring country, has me wondering whether the same thing happened 40 years ago when the USSR invaded Afghanistan. Did it? Are the Russians just bad at logistics?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/tgm81c/russia_is_having_a_lot_of_logistical_difficulties/",
  "subreddit": "AskHistorians",
  "id": "tgm81c",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Watching all of the problems Russia is having keeping its troops well-equipped\nand well-fed in Ukraine, a neighboring country, has me wondering whether the\nsame thing happened 40 years ago when the USSR invaded Afghanistan. Did it? Are\nthe Russians just bad at logistics?",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ロシアが自国の軍隊の装備を維持するために抱えているすべての問題を見ること\n隣国のウクライナで、十分な食糧を供給しているのだろうか？\n40年前、ソ連がアフガニスタンに侵攻したときと同じことが起こったのです。そうなのか？それとも\nロシアは物流が下手なだけなのか？",
      "title": "ロシアはウクライナへの侵攻で、多くの物流上の問題を抱えている。ソ連はアフガニスタン戦争の際にも同じように部隊への補給や食事に問題があったのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "观察到俄罗斯在保持其军队装备精良和食物充足方面遇到的所有问题\n我想知道，40年前，当美国的军队在乌克兰的时候，是否也发生了同样的情况？\n40年前苏联入侵阿富汗时是否也发生了同样的事情。是这样吗？难道\n俄罗斯人只是在后勤方面做得不好？",
      "title": "俄罗斯在入侵乌克兰的过程中遇到了很多后勤方面的困难。苏联在阿富汗战争期间，是否也有同样的部队供应和供养问题？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "觀察到俄羅斯在保持其軍隊裝備精良和食物充足方面遇到的所有問題\n我想知道，40年前，當美國的軍隊在烏克蘭的時候，是否也發生了同樣的情況？\n40年前蘇聯入侵阿富汗時是否也發生了同樣的事情。是這樣嗎？難道\n俄羅斯人只是在後勤方面做得不好？",
      "title": "俄羅斯在入侵烏克蘭的過程中遇到了很多後勤方面的困難。蘇聯在阿富汗戰爭期間，是否也有同樣的部隊供應和供養問題？"
    }
  ]
}