{
  "author": "Tizunia",
  "the_new_excerpt": "I think we all need a little bit of a positive talk :3\n\nAlso I just wanted to just talk about my beautiful wife and how fucking great\nshe is and hearing other stories like that might give people that nice feeling\nand I'm kinda drunk so I might regret this in the morning lol\n\nBut the first time I…",
  "original_created_utc": 1610688166,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我想我们都需要一点积极的谈话:3。\n\n此外，我只是想谈谈我美丽的妻子和如何他妈的伟大的\n她是和听到其他的故事这样的，可能会给人们的好感。\n我有点醉了，所以我可能会后悔在早上lol\n\n但我第一次...",
      "title": "你的S/O做了什么让你意识到你会爱上他们?"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想我們都需要一點積極的談話:3。\n\n此外，我只是想談談我美麗的妻子和如何他媽的偉大的\n她是和聽到其他的故事這樣的，可能會給人們的好感。\n我有點醉了，所以我可能會後悔在早上lol\n\n但我第一次...",
      "title": "你的S/O做了什麼讓你意識到你會愛上他們?"
    }
  ],
  "title": "What's something that your S/O did that made you realize you could fall for them?",
  "created_utc": 1610719607,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I think we all need  a little bit of a positive talk :3</p>\n\n<p>Also I just wanted to just talk about my beautiful wife and how fucking great she is and hearing other stories like that might give people that nice feeling and I&#39;m kinda drunk so I might regret this in the morning lol</p>\n\n<p>But the first time I knew I could fall for my wife was when we were at senior prom and she was dancing like no one else could see her, she literally didn&#39;t give a fuck and it was so cute to just see her, kinda weird ngl, dancing. I was going through a rough time after a girl I loved led me on for ages and lied to me before getting with someone else and rubbing it in my face, so this was the first time I felt happy just watching her dance. She pulled me onto the dance floor with her when the next song began and my heart fucking just skipped a beat and it was so weird because she was my childhood friend since forever and I didn&#39;t think I&#39;d see her that way but I did and now we&#39;re married and we have a beautiful new baby and I&#39;m so happy</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/AskMen/comments/kxnuhn/whats_something_that_your_so_did_that_made_you/",
  "subreddit": "AskMen",
  "id": "kxnuhn",
  "is_self": true,
  "media": null,
  "is_video": false
}