{
  "author": "0toHeroInvesting",
  "the_new_excerpt": "Should you get into stocks that benefit from the booming housing market? Is the\nworkout at home trade done? Intel stops the bleeding while Apple loses lawsuit.\nLet’s talk about this and other stock market news\n\nHello everyone and Good Morning! So, let’s start with the recap of yesterday, as\nwe saw…",
  "original_created_utc": 1609335572,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "你应该进入从繁荣的房地产市场中受益的股票吗？是不是\n在家里锻炼完了吗？交易完成了吗？英特尔止血苹果败诉\n让我们来谈谈这件事和其他股市消息\n\n大家好，早上好！那么，让我们从昨天的回顾开始，因为\n我们看到了…",
      "title": "今日股市动态|INTC、PTON、AAPL、HD、LULU、AMC等股市最新消息[12-30]"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你應該進入從繁榮的房地產市場中受益的股票嗎？是不是\n在家裏鍛鍊完了嗎？交易完成了嗎？英特爾止血蘋果敗訴\n讓我們來談談這件事和其他股市消息\n\n大家好，早上好！那麼，讓我們從昨天的回顧開始，因爲\n我們看到了…",
      "title": "今日股市動態|INTC、PTON、AAPL、HD、LULU、AMC等股市最新消息[12-30]"
    }
  ],
  "title": "Stock Market News for Today | INTC, PTON, AAPL, HD, LULU, AMC & other stock market updates [12-30]",
  "created_utc": 1609347389,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Should you get into stocks that benefit from the booming housing market? Is the workout at home trade done? Intel stops the bleeding while Apple loses lawsuit. Let’s talk about this and other stock market news</strong></p>\n\n<p>Hello everyone and Good Morning! So, let’s start with the recap of yesterday, as we saw all 3 big indexes closing the day in the red despite hitting intraday records, with the <a href=\"https://ibb.co/PCN8dwz\">NASDAQ COMPOSITE</a> losing .38%, while both the broad market <a href=\"https://ibb.co/cDjpNKP\">SP500</a> and the <a href=\"https://ibb.co/RydQj61\">DOW JONES</a> Industrial finished the day down just over .2% as we also saw the <a href=\"https://ibb.co/44wGzR0\">VIX</a> rising by more than 4% yesterday as the $2000 stimulus was <a href=\"https://ibb.co/WFNSpCH\">BLOCKED</a> in the Senate by McConnell and the Georgia Senate runoff election is just a week away.</p>\n\n<p>Almost 70% of the <a href=\"https://ibb.co/LYM4JfL\">COMPANIES</a> were declining yesterday on below average volume as the number of companies that were trading above the 50-day moving average fell under 70% for the first time in quite a while.</p>\n\n<p>We saw 9 of the 11 <a href=\"https://ibb.co/GRJSmht\">SECTORS</a> closing in the red yesterday, with only the Health Care and Consumer Discretionary sectors having small gains as almost all the types of companies were losing ground <a href=\"https://ibb.co/7tKPyP4\">YESTERDAY</a>, especially the small-caps with the small-cap growth group losing more than 2%.</p>\n\n<p>Here is the <a href=\"https://ibb.co/KjVsn9X\">HEAT MAP</a> from yesterday, it’s mostly red, with only a couple of companies that were gaining big like the Chinese companies alongside Amazon and Intel.HEAT</p>\n\n<p>We also got some economic data yesterday, as a review of the 2020 aviation and air travel <a href=\"https://ibb.co/hRbYxpG\">ESTIMATED</a> that traffic will be down 67% since last year, dropping to levels not seen since 1999, as air travel is still struggling to come back after the march bottoms. This has affected most of the <a href=\"https://ibb.co/FBq4g37\">COMPANIES</a> worldwide but it seems that China airlines is doing somewhat better with the biggest percentage of the total number of flights completed compared to last year.</p>\n\n<p>The SP Home price <a href=\"https://ibb.co/W67RBYh\">INDICES</a> also came in better than expected with the National Index increasing by 1.4% M/M, as this is a leading measure of real estate prices, gaining 8.4% nationwide over year ago. </p>\n\n<p>These moves can also be seen in the latest Redfin report, as home sales <a href=\"https://ibb.co/CwR5H56\">PRICES</a> are up 14% year/year to over $320K with a great increase in pending <a href=\"https://ibb.co/mJtrwV9\">SALES</a> which are also up more than 34% since last year, as the number of active <a href=\"https://ibb.co/vVkfMMh\">LISTINGS</a> of home sales is down more than 30%, as buyers can’t snatch them up quick enough with such low <a href=\"https://ibb.co/7j1kY3s\">YIELDS</a>, as this has led for the <a href=\"https://ibb.co/gzQq8Wb\">AVERAGE</a> sale price to list value to rise to 99.4% which Is up 1.5% since 2019. This should be good news for companies like Toll Brothers, Lennar, HD and LOW.</p>\n\n<p>This was also accompanied by the great numbers in the us chain store sales <a href=\"https://ibb.co/4PykPcH\">NUMBERS</a>, which rose by almost 9% y/y with December sales expected to rise almost 5% since last year and a .2% increase since last month.</p>\n\n<p>While <a href=\"https://ibb.co/8N3YMPV\">TODAY</a> we start the day with MBA Mortgage applications, home sales and the Chicago PMI alongside advance reads on many other data points.</p>\n\n<p>In some other stock market <a href=\"https://ibb.co/q1J6Snv\">NEWS</a>, we saw Apple cool of a little yesterday, losing more than 1% for the day while they also lost a lawsuit aimed of stopping Corellium using virtual iPhone for security researching in the operating system, while <a href=\"https://ibb.co/3vvXFGT\">INTEL</a> finally got a breather and recovered some of the recent loses, after an activist hedge fund manager pushed for strategic changes in the company as Intel is losing market share and top designers, with the company also <a href=\"https://ibb.co/WgtwTrY\">ISSUING</a> a statement that lifted spirits around the stock.</p>\n\n<p>We also saw the <a href=\"https://ibb.co/6rJ6bHd\">FAA</a> introduce new rules for drones, this may have a big impact on companies like UPS, Walmart and Amazon, as all of them have started trials for drone-delivery, as this could lead to better margins for the companies.</p>\n\n<p>The Fed also <a href=\"https://ibb.co/cxV3HkC\">EXTENDED</a> the main street lending programs until Jan. 8 with the approval of Mnuchin as they try to process a bunch of applications this month, this means we can get even more money put into the economy and eventually the stock markets which is good news.</p>\n\n<p>And meanwhile, AstraZeneca’s vaccine was <a href=\"https://ibb.co/y5QWbmh\">APPROVED</a> for emergency use in the UK, this is another weapon to find this freaking illness, while JNJ will give us some results in early 2021 and Novavax just started their trial in the US.</p>\n\n<p>Also, one last piece of data that I found recently shows that there was indeed a huge spike this <a href=\"https://ibb.co/JrKw01B\">YEAR</a> in the move to live streaming video and pre-recorded videos this year, as this has boosted companies like Peloton, Lululemon and others.</p>\n\n<p>But this trend is seen slowing down in the next years with just a 4% <a href=\"https://ibb.co/HGhFJXS\">CAGR</a> in the equipment market, but that the exercise apps will see a big <a href=\"https://ibb.co/02wm273\">GROWTH</a> in the next years, so there are 2 different POV. I wouldn’t stay invested in companies like PTON right now, I’d rather take profits and move to other areas in the stock market. But don’t rush into companies like AMC which have diluted their stock a lot or have lots of debt… this will not recover so fast, with <a href=\"https://ibb.co/gDR8S81\">AMC</a> filling to share up to 50M shares.</p>\n\n<p>Let’s hope for a good day in the market as US <a href=\"https://ibb.co/nbV49Bs\">FUTURES</a> seem to be pointing at a good open, with all 3 big indexes in the green as the Nasdaq is leading the way.</p>\n\n<p>Thank you everyone for reading! Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market!</p>\n\n<p>Have a great day and see you next time!</p>\n</div><!-- SC_ON -->",
  "score": 237,
  "permalink": "/r/stocks/comments/kn2fca/stock_market_news_for_today_intc_pton_aapl_hd/",
  "subreddit": "stocks",
  "id": "kn2fca",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609495335780
}