{
  "author": "jetmax25",
  "the_new_excerpt": "The best way to find great investments is to start with the belief that the\ninvestment is doomed, then try to find the reasons proving that statement wrong.\nIt's however very easy to get caught up in a hype chamber and go in with the\nwrong mindset, even if the investment is sound. For example on the…",
  "original_created_utc": 1617898261,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "優れた投資先を見つける一番の方法は、その投資先が絶望的であると信じることから始めて、それが間違っていることを証明する理由を見つけることです。\nそして、その言葉が間違っていることを証明する理由を見つけようとすることです。\nしかし、誇大広告に踊らされて、間違った投資をしてしまうことはよくあります。\nしかし、投資が健全であっても、誇大広告に巻き込まれ、間違った考え方をしてしまいがちです。例えば、...",
      "title": "それぞれのコインが過大評価されていると思う理由を挙げてみましょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "寻找优秀投资的最好方法是从相信开始。\n投资是注定要失败的，那就试着去寻找证明这种说法错误的理由。\n然而，很容易陷入炒作室，并以\n错误的心态，即使投资是稳健的。比如在...",
      "title": "让我们发挥魔鬼代言人的作用，并列出你认为每个硬币被过度炒作/价格的原因。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "尋找優秀投資的最好方法是從相信開始。\n投資是註定要失敗的，那就試着去尋找證明這種說法錯誤的理由。\n然而，很容易陷入炒作室，並以\n錯誤的心態，即使投資是穩健的。比如在...",
      "title": "讓我們發揮魔鬼代言人的作用，並列出你認爲每個硬幣被過度炒作/價格的原因。"
    }
  ],
  "title": "Let's Play Devils Advocate And List The Reasons That You Believe Each Coin Is Overhyped/Priced",
  "created_utc": 1617917875,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The best way to find great investments is to start with the belief that the investment is doomed, then try to find the reasons proving that statement wrong. It&#39;s however very easy to get caught up in a hype chamber and go in with the wrong mindset, even if the investment is sound. For example on the last daily discussion one of the top comments was &quot;buy coin x&quot; with the only reason being &quot;i&#39;ll change the world&quot;</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Rules:</strong> </p>\n\n<ul>\n<li>Top level comments are the names of coins (I will start with a few but please add more)</li>\n<li>Comments under the top levels are the devils advocate, commenting on the problems with the coin/concept and why it may be overpriced </li>\n<li>The most valid criticisms should be upvoted even if you disagree with them</li>\n<li>Replies to those comments may be rebuttals and counterpoints again advocating for the coin</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p>Hopefully we can gain a more nuanced understanding of each assets pros and cons, maybe even solidifying our optimism now that we&#39;ve understood the possible downsides</p>\n</div><!-- SC_ON -->",
  "score": 397,
  "permalink": "/r/CryptoCurrency/comments/mmv5ma/lets_play_devils_advocate_and_list_the_reasons/",
  "subreddit": "CryptoCurrency",
  "id": "mmv5ma",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566612881
}