{
  "author": "nobjos",
  "the_new_excerpt": "This post is in continuation of a series of posts I made in the previous weeks.\nThe response I received was amazing and a lot of you were asking for continued\nweekly updates. I have also added the Week-on-Week stock price change due to\npopular requests.\n\nThe market, in general, has continued to…",
  "original_created_utc": 1623590399,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今回の投稿は、前の週に行った一連の投稿の続きです。\n私が受け取った反応は驚くべきもので、多くの皆さんが継続して欲しいと言っていました。\n毎週更新してほしいという声を多くいただきました。私はまた、ご要望の多かった「週ごとの株価変化」も追加しました。\nご要望が多かったためです。\n\n市場は全般的に、引き続き...",
      "title": "RedditやTwitterでの銘柄の言及やセンチメントを追跡するプログラムを作ってみた! 今週の最も話題になった銘柄と成長率の高い銘柄を紹介します"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这篇文章是我在前几周发表的一系列文章的延续。\n我收到的反应是惊人的，许多人要求继续每周更新。\n每周更新。由于大众的要求，我还增加了每周的股票价格变化。\n大众的要求。\n\n总的来说，市场一直在继续...",
      "title": "我建立了一个程序，跟踪Reddit和Twitter上的股票的提及和情绪！这是我的工作。本周讨论最多和增长最快的股票!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這篇文章是我在前幾周發表的一系列文章的延續。\n我收到的反應是驚人的，許多人要求繼續每週更新。\n每週更新。由於大衆的要求，我還增加了每週的股票價格變化。\n大衆的要求。\n\n總的來說，市場一直在繼續...",
      "title": "我建立了一個程序，跟蹤Reddit和Twitter上的股票的提及和情緒！這是我的工作。本週討論最多和增長最快的股票!"
    }
  ],
  "title": "I built a program that tracks mentions and sentiment of stocks across Reddit and Twitter! This week's most discussed and top growing stocks!",
  "created_utc": 1623601429,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This post is in continuation of a series of posts I made in the previous weeks. The response I received was amazing and a lot of you were asking for continued weekly updates. I have also added the Week-on-Week stock price change due to popular requests. </p>\n\n<p>The market, in general, has continued to rally strongly and it has been a pretty good week for investors. The top growing stocks I <a href=\"https://www.reddit.com/r/wallstreetbets/comments/ntlyqy/i_built_a_program_that_tracks_mentions_and/\">shared last week</a> had made an average return of 6.6% with Workhorse Group making a whopping 19% return in one week! Now, let’s jump right into this week’s list!</p>\n\n<p><strong>Most Discussed Stocks of the Week</strong></p>\n\n<p><a href=\"https://preview.redd.it/p9znai9z91571.png?width=1042&amp;format=png&amp;auto=webp&amp;s=064000d3d54a7e847dc1bec4905f9380db5e05c8\">https://preview.redd.it/p9znai9z91571.png?width=1042&amp;format=png&amp;auto=webp&amp;s=064000d3d54a7e847dc1bec4905f9380db5e05c8</a></p>\n\n<p>AMC and BB are now the top 2 most discussed stock! Both generated almost the same amount of discussion, but investors, in general, were more bullish about Blackberry as reflected in the sentiment. The returns on both the stocks were muted with AMC and BB returning just 3% and 2% respectively. ECommerce platform ContextLogic(WISH) had a wild ride with the stock rising 90% and then dropping 46% over the next two days. Investor returns wise, Clover health is the front runner returning an insane 67% in one week. Also, Tesla dropped out of the top 10 list for the first time in 2021!</p>\n\n<p><strong>Top Growing Stocks of the Week</strong></p>\n\n<p><a href=\"https://preview.redd.it/s5j78yn0a1571.png?width=1233&amp;format=png&amp;auto=webp&amp;s=241763eda48057740436f648ba342b56a7999cd4\"> </a></p>\n\n<p>Above is the list of stocks that have exploded in the number of mentions throughout social media.</p>\n\n<p><strong>Wendys($WEN):</strong> This was definitely a long time coming. Wendys shares soared more than 19% on Tuesday after the company became a meme stock in Reddit. There was no new fundamental news from the company that changed the investment perspective other than an announcement that the company will bring back its popular Summer Strawberry Chicken Salad.</p>\n\n<p><strong>Clover Health($CLOV):</strong> had its best week yet since inception with the stock returning 67% in just one week. Reddit investors sparked another rally with the stock price soaring more than 200% and then fell sharply! The stock was trading at 6 times the normal volume. Even though the company has an optimistic business model, the current rally was predominantly driven by CLOV’s high short interest (43%)!</p>\n\n<p><strong>Senseonics Holdings($SENS):</strong> $SENS exploded in mentions and the stock jumped 22% during intraday trading without any new news from the company. Its a small Maryland-based pharma company, which specializes in the development of products made to ease the burden of diabetes monitoring. The company had announced news of a promising trial but that was long back. The current rally was majorly based on its short interest (25%) and increasing chatter!</p>\n\n<p><strong>Clean Energy Fuels($CLNE):</strong> $CLNE had a wild week with the stock shooting up 31% on Wednesday due to the retail crowd but then promptly tumbled 17% in Thursday afternoon trading. The drop was due to the information that its largest shareholder reduced their stake in the company by 1.25 Million shares. The retail crowd is still extremely bullish on the stock as seen by the sentiment.</p>\n\n<p><strong>Invesco Mortgage($IVR):</strong> The company had a spectacular crash at the beginning of the pandemic with the shares losing almost 90% of its value. It has been growing slowly over the past few months. The stock was trending in relation to the current uncertainty regarding inflation rates and how Fed is going to adjust its rates.</p>\n\n<p><strong>Honorable Mentions:</strong> ContextLogic($WISH) chatter grew by 487% and UWM Holdings($UWMC) by 373% but were not high enough to make the top 5 list. Another interesting finding from my program is that mentions of CPI (Consumer Price Index) grew by more than 900% last week showcasing the rising discussion about inflation and its impact among investors.</p>\n\n<p>Hope you enjoyed this week’s top stocks issue!  </p>\n\n<p><em>Disclaimer: I am not a financial advisor.</em></p>\n</div><!-- SC_ON -->",
  "score": 3894,
  "permalink": "/r/wallstreetbets/comments/nyw691/i_built_a_program_that_tracks_mentions_and/",
  "subreddit": "wallstreetbets",
  "id": "nyw691",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009747678
}