{
  "author": "Foufou190",
  "the_new_excerpt": "Disclaimer: this post claims an alternative point of view on the current events,\nafter several removals from r/bitcoin [https://www.reddit.com/r/bitcoin/] I want\nto say that we do have different opinions but this censorship needs to end if we\nwant cryptocurrencies to be taken seriously.\n\n\n\nAll right…",
  "original_created_utc": 1610384172,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "免责声明：这篇帖子声称对当前事件有另一种观点，\n几次从r/比特币中移除后[https://www.reddit.com/r/bitcoin/]I Want\n要说我们确实有不同的意见，但这种审查制度需要结束，如果我们\n希望加密货币得到认真对待。\n\n\n\n好的，…",
      "title": "非常不受欢迎的观点：不要听信别人说的“最后一次3万买的机会”"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "免責聲明：這篇帖子聲稱對當前事件有另一種觀點，\n幾次從r/比特幣中移除後[https://www.reddit.com/r/bitcoin/]I Want\n要說我們確實有不同的意見，但這種審查制度需要結束，如果我們\n希望加密貨幣得到認真對待。\n\n\n\n好的，…",
      "title": "非常不受歡迎的觀點：不要聽信別人說的“最後一次3萬買的機會”"
    }
  ],
  "title": "Very unpopular opinion: DO NOT listen to people saying \"last chance to buy at 30k\"",
  "created_utc": 1610401014,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Disclaimer: this post claims an alternative point of view on the current events, after several removals from <a href=\"https://www.reddit.com/r/bitcoin/\">r/bitcoin</a> I want to say that we do have different opinions but this censorship needs to end if we want cryptocurrencies to be taken seriously.</p>\n\n<p>&#x200B;</p>\n\n<p>All right folks for those of us who bought very cheap for a few thousands, &quot;last chance to buy at 30k&quot; can also very well be &quot;last chance to sell at 30k&quot;.</p>\n\n<p>So reality is -25% is nothing for a bitcoin correction so if you believe you want to sell part of your portfolio to rebuy cheaper, just do it, and if you want to HODL for ever without taking this risk, good for you we will meet again at 150k anyway but don&#39;t spread intox like this.</p>\n</div><!-- SC_ON -->",
  "score": 442,
  "permalink": "/r/Bitcoin/comments/kv6nj8/very_unpopular_opinion_do_not_listen_to_people/",
  "subreddit": "Bitcoin",
  "id": "kv6nj8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706373017
}