{
  "author": "rayou111x",
  "the_new_excerpt": "DEFINITION OF PREFERRED SHARES\n\nWhen you own a share of a company. You are basically part of the business. You\nhave the right to vote and participate in shareholders’ annual meeting. Your\nreturn will depend solely of the performance of the company in the stock market\nand its dividends. It’s…",
  "original_created_utc": 1616616477,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "優先股的定義\n\n当你拥有一家公司的股份。你基本上就是企业的一部分。你是\n有权投票和参加股东年会。您的\n回报率将完全取决于公司在股票市场的表现。\n和它的红利。它的...",
      "title": "加拿大优先股ETF的快速比较"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "優先股的定義\n\n當你擁有一家公司的股份。你基本上就是企業的一部分。你是\n有權投票和參加股東年會。您的\n回報率將完全取決於公司在股票市場的表現。\n和它的紅利。它的...",
      "title": "加拿大優先股ETF的快速比較"
    }
  ],
  "title": "Preferred shares ETF in Canada a quick comparison",
  "created_utc": 1616640228,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h3>Definition of preferred shares</h3>\n\n<p>When you own a share of a company. You are basically part of the business. You have the right to vote and participate in shareholders’ annual meeting. Your return will depend solely of the performance of the company in the stock market and its dividends. It’s rewarding but it’s also risky. Preferred shares are a bit different. You don’t get to vote and you have no ownership in the business. Your preferred share entitles you priority to dividends based on a percentage agreed upon in advance. The priority means the company needs to pay you first before paying the regular shareholders. In case of bankruptcy, you have first claim on the assets of the company. So, in essence, a preferred share is kind of hybrid product that shares certain characteristics of bonds (a bit of safety) and some of regular shares (potential for appreciation).</p>\n\n<p>Investors can invest directly in preferred shares as they trade like stocks. Or, they can buy preferred shares ETF to achieve diversification and reduce risk.</p>\n\n<p>A preferred share grants the holder a percentage return based on its par value. there are several risks associated with preferred shares:</p>\n\n<ul>\n<li>The issuer can decide not pay dividends in a particular year because of bad financial results. Unless you hold a cumulative right, you will not receive your dividends;</li>\n<li>The preferred share price tend to rise if the price of the regular share rises or lose value if the opposite scenario occurs;</li>\n<li>Preferred shares are sensitive to interest rates. When interest rate are low, preferred shares are in demand because their dividend is much higher than other fixed income products. If interest rate rise, investors will turn to safer fixed income products such as bonds. This will impact negatively the price of the preferred share;</li>\n<li>An issuer of preferred shares can decide to recall his shares or offer the option to convert them to regular stocks anytime.</li>\n</ul>\n\n<h3>What’s a preferred shares ETF</h3>\n\n<p>It’s basically ETFs that invest mainly in preferred shares. These ETFs are quite popular because they offer investors interesting yields with possibility of capital appreciation. Among all fixed income products, there’s no question that preferred shares usually offer the best return in comparison to bonds. This being said a preferred share carries more risk than owning a bond.</p>\n\n<h3><a href=\"https://wyzeinvestors.com/?p=708#Methodology\">Methodology</a></h3>\n\n<p>I started by selecting all Fixed income ETFs offered in Canada. I considered in my comparison only ETFs that pay more than 3% dividend yield. I consider 3% a reasonable payout especially if it’s combined with an interesting capital appreciation. Most fixed income ETFs holders seek a regular dividend income. So, it’s an important condition.</p>\n\n<p>Second step: I ranked these ETFs based on the past 52 weeks performance.</p>\n\n<p>Third step: All ETFs in the list should have asset under management above 100 M. Generally speaking, the higher the AUM the better the liquidity because of the high volume of shares exchanging hands daily. This factor is important because investors should be able to buy and sell an ETF at a reasonable spread. The spread is the difference between the bid and the ask price. For liquid assets, the spread can be as little as 0.005$ while for low AUM ETFs the spread can easily reach 0.05$. If you buy 100 shares that’s 5$ cost in addition to the commission you’re paying to the broker.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>Dyn Ishares Active Pref Shares – DXP</p>\n\n<p>RBC Canadian Pref Share – RPF</p>\n\n<p>Horizons Active Pref Share – HPR</p>\n\n<p>BMO Laddered Pref Share – ZPR</p>\n\n<p>Ishares S&amp;P TSX CDN Pref – CPD</p>\n\n<p>I couldn&#39;t past table but see results in link below</p>\n\n<p><a href=\"https://wyzeinvestors.com/?p=708\">Results</a></p>\n</div><!-- SC_ON -->",
  "score": 200,
  "permalink": "/r/investing/comments/mcfag2/preferred_shares_etf_in_canada_a_quick_comparison/",
  "subreddit": "investing",
  "id": "mcfag2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752819542
}