{
  "author": "Gayjock69",
  "original_created_utc": 1637077595,
  "title": "How was William the Conquerer able to effectively supplant the Anglo-Saxon nobility with Norman nobility? What happened to the old nobility?",
  "created_utc": 1637110290,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>When he conquered England, many Lords had surrendered to him and he established his authority further in the harrying of the north. </p>\n\n<p>Did he simply murder all of the old nobility? If he didn’t, what did that nobility do after their titles were stripped? How did the population of England view the new Norman elite, was there resentment and a remaining support for their old nobility?</p>\n</div><!-- SC_ON -->",
  "score": 108,
  "permalink": "/r/AskHistorians/comments/qvaooj/how_was_william_the_conquerer_able_to_effectively/",
  "subreddit": "AskHistorians",
  "id": "qvaooj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "When he conquered England, many Lords had surrendered to him and he established\nhis authority further in the harrying of the north.\n\nDid he simply murder all of the old nobility? If he didn’t, what did that\nnobility do after their titles were stripped? How did the population of England\nview the new…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "彼がイングランドを征服したとき、多くの領主が彼に降伏していたため、彼はさらにその権威を確立した。\n彼は、北方を占領することで、さらにその権威を確立した。\n\n彼は単純に旧来の貴族をすべて殺害したのでしょうか？そうでないとしたら、その貴族たちは\n殺害しなかったとしたら、貴族たちは爵位を剥奪された後どうしたのでしょうか？イングランドの人々は、新...\n新しい...",
      "title": "征服王ウィリアムは、どのようにしてアングロサクソン系の貴族をノルマン系の貴族に効果的に取って代わらせることができたのでしょうか。旧来の貴族はどうなったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当他征服英格兰时，许多领主都向他投降了，他在英格兰进一步建立了自己的权威。\n他在对北方的骚扰中进一步确立了自己的权威。\n\n他是否只是简单地谋杀了所有的旧贵族？如果他没有，那么这些贵族在被剥夺了头衔后又做了什么？\n贵族们在他们的头衔被剥夺后做了什么？英格兰的民众是如何看待\n如何看待这个新的...",
      "title": "征服者威廉如何能够有效地用诺曼人的贵族来取代盎格鲁-撒克逊人的贵族？旧的贵族们发生了什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當他征服英格蘭時，許多領主都向他投降了，他在英格蘭進一步建立了自己的權威。\n他在對北方的騷擾中進一步確立了自己的權威。\n\n他是否只是簡單地謀殺了所有的舊貴族？如果他沒有，那麼這些貴族在被剝奪了頭銜後又做了什麼？\n貴族們在他們的頭銜被剝奪後做了什麼？英格蘭的民衆是如何看待\n如何看待這個新的...",
      "title": "征服者威廉如何能夠有效地用諾曼人的貴族來取代盎格魯-撒克遜人的貴族？舊的貴族們發生了什麼？"
    }
  ]
}