{
  "author": "RzK",
  "original_created_utc": 1626437015,
  "title": "Why do people turn mental illness into a cute quirk about them?",
  "created_utc": 1626466404,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I notice this on social media more than ever where people who I&#39;m certain self diagnosed themselves are saying they have whatever illness... But they paint it moreso in a way to get attention, like it&#39;s some silly cute feature about their character. </p>\n\n<p>I totally understand the spread of awareness, or methods to cope... But this straight up comes off as totally mentally ok people taking advantage for attention. </p>\n\n<p>I&#39;ll tell you right now there&#39;s nothing cute and tehehehehe about your mind betraying you... Some people live in constant fear because of it.</p>\n\n<p>Is this part of social media addiction? An addiction to collecting likes? Maybe that&#39;s the actual illness</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/olficl/why_do_people_turn_mental_illness_into_a_cute/",
  "subreddit": "TooAfraidToAsk",
  "id": "olficl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I notice this on social media more than ever where people who I'm certain self\ndiagnosed themselves are saying they have whatever illness... But they paint it\nmoreso in a way to get attention, like it's some silly cute feature about their\ncharacter.\n\nI totally understand the spread of awareness, or…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ソーシャルメディアを見ていると、自分で診断したと思われる人が、何かの病気にかかっていると言っているのをよく見かけます。\n自分で診断したと思われる人たちが、何かの病気にかかっていると言っています。しかし、彼らはそれを\n注目を集めるために、まるで自分の性格のくだらないかわいい特徴のように描くのです。\n性格です。\n\n認知度を上げるために、あるいは...というのはよくわかります。",
      "title": "なぜ人は心の病を自分のかわいい癖にしてしまうのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在社交媒体上比以往任何时候都更注意到这种情况，我确信那些自我诊断的人\n诊断自己的人说他们有什么病......但他们把它描绘得很好。但他们把它\n但他们更多的是以一种方式来吸引注意力，就像这是他们性格中的一些愚蠢的可爱特征。\n的特点。\n\n我完全理解意识的传播，或...",
      "title": "为什么人们把精神疾病变成关于他们的一个可爱的怪癖？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在社交媒體上比以往任何時候都更注意到這種情況，我確信那些自我診斷的人\n診斷自己的人說他們有什麼病......但他們把它描繪得很好。但他們把它\n但他們更多的是以一種方式來吸引注意力，就像這是他們性格中的一些愚蠢的可愛特徵。\n的特點。\n\n我完全理解意識的傳播，或...",
      "title": "爲什麼人們把精神疾病變成關於他們的一個可愛的怪癖？"
    }
  ]
}