{
  "author": "anxi111",
  "original_created_utc": 1634834454,
  "title": "Have you ever feared “losing control”? How did you deal with it ?",
  "created_utc": 1634892634,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I saw this quote and a bunch of women I know resonated with it. How do you deal with this anxiety of “losing control”. Where do you think it comes from. </p>\n\n<p>“Almost every woman I have ever met has a secret belief that she is just on the edge of madness, that there is some deep, crazy part within her, that she must be on guard constantly against ‘losing control’ — of her temper, of her appetite, of her sexuality, of her feelings, of her ambition, of her secret fantasies, of her mind.”</p>\n\n<ul>\n<li>Elana Dykewomon</li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskWomen/comments/qcvw3a/have_you_ever_feared_losing_control_how_did_you/",
  "subreddit": "AskWomen",
  "id": "qcvw3a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I saw this quote and a bunch of women I know resonated with it. How do you deal\nwith this anxiety of “losing control”. Where do you think it comes from.\n\n“Almost every woman I have ever met has a secret belief that she is just on the\nedge of madness, that there is some deep, crazy part within her,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この言葉を見て、知り合いの女性たちが共感してくれました。あなたはどのようにして\nコントロールを失う」という不安にどのように対処していますか？それはどこから来るのだと思いますか？\n\n「私がこれまでに出会ったほとんどすべての女性は、自分は狂気の淵にいるのだという秘密の信念を持っている。\n自分の中には深くて狂った部分があると密かに信じています。",
      "title": "あなたは \"コントロールを失う \"ことを恐れたことがありますか？どのように対処しましたか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我看到这句话，我认识的一群女性对此产生了共鸣。你是如何处理\n处理这种 \"失去控制 \"的焦虑。你认为它来自哪里。\n\n\"几乎所有我见过的女人都有一个秘密的信念，那就是她正处于疯狂的边缘。\n处于疯狂的边缘，她内心深处有一些疯狂的部分，......",
      "title": "你有没有担心过 \"失去控制\"？你是如何处理的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到這句話，我認識的一羣女性對此產生了共鳴。你是如何處理\n處理這種 \"失去控制 \"的焦慮。你認爲它來自哪裏。\n\n\"幾乎所有我見過的女人都有一個祕密的信念，那就是她正處於瘋狂的邊緣。\n處於瘋狂的邊緣，她內心深處有一些瘋狂的部分，......",
      "title": "你有沒有擔心過 \"失去控制\"？你是如何處理的？"
    }
  ]
}