{
  "author": "ShadowBaj",
  "original_created_utc": 1628481990,
  "title": "Unpopular Correction: Sen. Warren never said that \"Cryptocurrencies may need a Taxpayer Bailout\" like Banks did",
  "created_utc": 1628524119,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I hate all FUD, the current anti Crypto legislation and corrupt politicians as much as you do, but we need to stay correct on what we say here.</p>\n\n<p>What Sen. Warren has said is that companies which heavily invest in crypto may need a bailout if the cryptocurrency would crash. She never said Satoshi Nakamoto, Bitcoin itself or any other crypto itself would need a bailout, but this was claimed here with thousands of upvotes. </p>\n\n<p>We dont need to make things up/ actively misinterpret statements to fight the corrupt polticians. There is enough actual things they have done or said which we can use go argue against them. I hate these corrupt people as much as you do, but doing things like this will only make it harder to fight against them, not easier.</p>\n</div><!-- SC_ON -->",
  "score": 170,
  "permalink": "/r/CryptoCurrency/comments/p0ty5o/unpopular_correction_sen_warren_never_said_that/",
  "subreddit": "CryptoCurrency",
  "id": "p0ty5o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I hate all FUD, the current anti Crypto legislation and corrupt politicians as\nmuch as you do, but we need to stay correct on what we say here.\n\nWhat Sen. Warren has said is that companies which heavily invest in crypto may\nneed a bailout if the cryptocurrency would crash. She never said…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はあなたと同じように、すべてのFUD、現在の反暗号法、腐敗した政治家を憎んでいます。\nしかし、ここでの発言は正しいものでなければなりません。\n\nウォーレン上院議員が言ったことは、暗号に多額の投資をしている企業は、暗号通貨がクラッシュした場合、救済が必要になるかもしれないということです。\n暗号通貨がクラッシュした場合、救済措置が必要になるかもしれないということです。彼女は決して...",
      "title": "人気のない訂正です。Warren上院議員は、銀行のように「暗号通貨には納税者の救済が必要かもしれない」とは言っていない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我和你一样讨厌所有的FUD、当前的反加密货币立法和腐败的政客。\n和你一样，但我们需要保持我们在这里所说的话是正确的。\n\n沃伦参议员所说的是，大量投资于加密货币的公司可能会\n需要救助，如果加密货币会崩溃。她从未说过...",
      "title": "不受欢迎的更正。沃伦参议员从未说过 \"加密货币可能需要纳税人的救助\"，就像银行那样。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我和你一樣討厭所有的FUD、當前的反加密貨幣立法和腐敗的政客。\n和你一樣，但我們需要保持我們在這裏所說的話是正確的。\n\n沃倫參議員所說的是，大量投資於加密貨幣的公司可能會\n需要救助，如果加密貨幣會崩潰。她從未說過...",
      "title": "不受歡迎的更正。沃倫參議員從未說過 \"加密貨幣可能需要納稅人的救助\"，就像銀行那樣。"
    }
  ]
}