{
  "author": "fluenticons",
  "original_created_utc": 1659022578,
  "title": "I bought a micro-saas and now I have to make my money back on it",
  "created_utc": 1659040828,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I bought a micro-saas from microacquire recently. It&amp;#39;s a web app that has icon designs from Microsoft&amp;#39;s fluent icons and makes them easily acceessible to download in any color and any format (SVG, PNG, JPG). &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s called Fluenticons.   &lt;/p&gt;\n\n&lt;p&gt;It has good traffic and lots of returning users, but no revenue.   &lt;/p&gt;\n\n&lt;p&gt;My ideas for new features are as follows:&lt;br/&gt;\n- add more icons to download&lt;br/&gt;\n- all users to add gradient color to icons&lt;br/&gt;\n- allow users to add app backgrounds to icons (app icon generator)  &lt;/p&gt;\n\n&lt;p&gt;To access these new features I was thinking I would require the user to register, but not pay anything.   &lt;/p&gt;\n\n&lt;p&gt;Revenue generator would be:&lt;br/&gt;\n- adding new &amp;quot;premium&amp;#39; icon sets - monthly fee or one-time.&lt;br/&gt;\n- ads  &lt;/p&gt;\n\n&lt;p&gt;What do you think? I&amp;#39;m open to ideas for gaining new users/revenue, or anything really! This is my first acquisition and i&amp;#39;m excited to scale it up.  &lt;/p&gt;\n\n&lt;p&gt;My expertise is marketing, so all of the technical works needs to be outsourced, but the platform is built in React and it seems easy enough to find good talent.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 5,
  "permalink": "/r/SideProject/comments/wad2en/i_bought_a_microsaas_and_now_i_have_to_make_my/",
  "subreddit": "SideProject",
  "id": "wad2en",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I bought a micro-saas from microacquire recently. It's a web app that has icon\ndesigns from Microsoft's fluent icons and makes them easily acceessible to\ndownload in any color and any format (SVG, PNG, JPG).\n\nIt's called Fluenticons.\n\nIt has good traffic and lots of returning users, but no…"
}