{
  "author": "_chloe_rddt",
  "the_new_excerpt": "This is a serious question. I'm 16.\nWhenever I look at machines, I can feel what it is to be that machine.\nLike I know what it is to mow grass as a lawnmower or how it feels to ride on\nthe freeway as a car. I know how heavy a garage door is because I can feel that.\nIt's not like I imagine it, I feel…",
  "original_created_utc": 1623496419,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは深刻な質問です。私は16歳です。\n私は機械を見るたびに、その機械になったときの気持ちを感じることができます。\n芝刈り機で草を刈るのがどんな感じか、車で高速道路を走るのがどんな感じかを知っているように。\n車でフリーウェイを走る気持ちがわかるように。ガレージのドアがどれだけ重いかは、それを感じることができるからです。\n想像するのではなく、感じるのです...。",
      "title": "これは荒らしの投稿ではありませんが、他の人が機械を感じることができるかどうかを知りたいのです。どこで聞いたらいいのかわかりません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是个严肃的问题。我16岁了。\n每当我看着机器，我就能感觉到成为那台机器是什么感觉。\n就像我知道作为割草机割草是什么感觉，或者作为汽车在高速公路上行驶是什么感觉。\n作为汽车在高速公路上行驶的感觉。我知道车库门有多重，因为我可以感觉到。\n这不像我想象的那样，我感觉...",
      "title": "这并不是一个巨头的帖子，但我需要知道其他人是否能感受到机器。我不知道该在哪里问这个问题。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是個嚴肅的問題。我16歲了。\n每當我看着機器，我就能感覺到成爲那臺機器是什麼感覺。\n就像我知道作爲割草機割草是什麼感覺，或者作爲汽車在高速公路上行駛是什麼感覺。\n作爲汽車在高速公路上行駛的感覺。我知道車庫門有多重，因爲我可以感覺到。\n這不像我想象的那樣，我感覺...",
      "title": "這並不是一個巨頭的帖子，但我需要知道其他人是否能感受到機器。我不知道該在哪裏問這個問題。"
    }
  ],
  "title": "This isn't a troll post but I need to know if other people can feel machines. I don't know where to ask about this.",
  "created_utc": 1623526996,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is a serious question. I&#39;m 16.<br/>\nWhenever I look at machines, I can feel what it is to be that machine.<br/>\nLike I know what it is to mow grass as a lawnmower or how it feels to ride on the freeway as a car. I know how heavy a garage door is because I can feel that.<br/>\nIt&#39;s not like I imagine it, I <em>feel</em> it like how I feel when I move my arms or legs or anything.<br/>\nI can feel electric current flowing through a cable to an appliance. I know how fast it is and how precise it is. Sometimes I also taste it on my tongue or see colors at the edges of my vision.<br/>\nAm I crazy? I don&#39;t know if I should talk about this IRL but I haven&#39;t heard about anyone who has this too.</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/NoStupidQuestions/comments/ny4fnl/this_isnt_a_troll_post_but_i_need_to_know_if/",
  "subreddit": "NoStupidQuestions",
  "id": "ny4fnl",
  "is_self": true,
  "media": null,
  "is_video": false
}