{
  "author": "Livid_Blacksmith_437",
  "the_new_excerpt": "Ticker is $DNMR.\n\n * Plastic waste is undoubtedly one of the largest environmental issues we face.\n   We are generating more plastic trash than ever, and very little of it gets\n   recycled. Recycling plastics is not viable either; it loses durability, it's\n   difficult to sort the different types of…",
  "original_created_utc": 1609990738,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "股票代码是$DNMR。\n\n*塑料垃圾无疑是我们面临的最大环境问题之一。\n我们产生的塑料垃圾比以往任何时候都要多，但得到的却很少。\n回收利用。回收塑料也是不可行的；它会失去耐用性，它\n难以对不同类型的…进行排序",
      "title": "我为什么要买这个生物塑料股票。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "股票代碼是$DNMR。\n\n*塑料垃圾無疑是我們面臨的最大環境問題之一。\n我們產生的塑料垃圾比以往任何時候都要多，但得到的卻很少。\n回收利用。回收塑料也是不可行的；它會失去耐用性，它\n難以對不同類型的…進行排序",
      "title": "我爲什麼要買這個生物塑料股票。"
    }
  ],
  "title": "Why I Bought this BioPlastic Stock.",
  "created_utc": 1610027518,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Ticker is $DNMR.</p>\n\n<ul>\n<li>Plastic waste is undoubtedly one of the largest environmental issues we face.  We are generating more plastic trash than ever, and very little of it gets recycled. Recycling plastics is not viable either; it loses durability, it&#39;s difficult to sort the different types of plastic, and it&#39;s not economical at all. Plastics and their byproducts are littering our cities, oceans, and waterways, and contributing to health problems in humans and animals. The most logical solution to this problem is biodegradable, plant based plastic.</li>\n<li>This company produces 100% biodegradable, plant based (canola) plastic feedstock.</li>\n<li>They are targeting the single use plastics market. </li>\n<li>DNMR is 6% owned by Pepsi and has R&amp;D agreements with Nestle. PepsiCo and Nestle plans to make 100% of its packaging recyclable, compostable or biodegradable by 2025.</li>\n<li>This company has completed phase I at their Kentucky plant and plan to complete phase II in 2021. There is a second Greenfield facility planned to come online in 2023. (2020-2025 96% CAGR in finished products in Kentucky.) (2023-2027 62% CAGR in finished products at Greenfield facility.)</li>\n<li>Capacity is expected to be sold out through 2024.</li>\n<li>2021 YoY Revenue growth is expected to be 100%+ with $500 million expected revenue by 2025.</li>\n<li>There has been lots of insider buying lately.</li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 61,
  "permalink": "/r/stocks/comments/ks4r8d/why_i_bought_this_bioplastic_stock/",
  "subreddit": "stocks",
  "id": "ks4r8d",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706379522
}