{
  "author": "mxdSirty",
  "original_created_utc": 1636580814,
  "title": "If that drop right there scared you",
  "created_utc": 1636595101,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Welcome to the world of crypto where anything can happen, including the flash “correction” that just occurred. Anyone from 2017 can tell you that around this time of year 4 years ago, the very same thing happened between November 9-11th </p>\n\n<p>If that small drop right there scared you and you don&#39;t what to do </p>\n\n<p><strong>Delete your brokers, exchanges, or whatever you use to check your crypto</strong></p>\n\n<p>&#x200B;</p>\n\n<p>Remember your investing in crypto, a long-term investment that will continue to shape the modern world  5+ years from now.  Just have faith and HODL, believe in your investments. Who knows what the next 6 months might look like, and we can very well enter a bear market at any moment. If it&#39;s too much to handle, then it&#39;s better to take your gains now, and re-enter when you feel more comfortable.</p>\n\n<p>Cheers lads!</p>\n</div><!-- SC_ON -->",
  "score": 339,
  "permalink": "/r/CryptoCurrency/comments/qr52he/if_that_drop_right_there_scared_you/",
  "subreddit": "CryptoCurrency",
  "id": "qr52he",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Welcome to the world of crypto where anything can happen, including the flash\n“correction” that just occurred. Anyone from 2017 can tell you that around this\ntime of year 4 years ago, the very same thing happened between November 9-11th\n\nIf that small drop right there scared you and you don't what…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "何が起こっても不思議ではない暗号の世界へようこそ。\n今起きた「修正」も含め、何が起きてもおかしくない暗号の世界へようこそ。2017年の人なら誰でも、4年前のこの時期に\n4年前のこの時期、11月9日から11月11日の間に全く同じことが起こったことを、2017年の人なら誰でも知っているでしょう。\n\nもし、あの小さな下落が怖くて何もできなかったら...。",
      "title": "その一滴があなたを脅かすなら"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "欢迎来到加密货币的世界，在这里任何事情都可能发生，包括刚刚发生的闪光\n\"修正 \"刚刚发生。任何来自2017年的人都可以告诉你，在4年前的这个时候\n4年前的这个时候，在11月9日至11日之间也发生了同样的事情。\n\n如果那里的小幅下跌吓到了你，而且你不什么...",
      "title": "如果刚才的跌落吓到了你"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "歡迎來到加密貨幣的世界，在這裏任何事情都可能發生，包括剛剛發生的閃光\n\"修正 \"剛剛發生。任何來自2017年的人都可以告訴你，在4年前的這個時候\n4年前的這個時候，在11月9日至11日之間也發生了同樣的事情。\n\n如果那裏的小幅下跌嚇到了你，而且你不什麼...",
      "title": "如果剛纔的跌落嚇到了你"
    }
  ]
}