{
  "author": "ImFedUpWithItAll",
  "the_new_excerpt": "Disclaimer: None of the following is investment advice. Do your own research.\n\nThere's a lot of chatter about AMC and whether it'll pop or it'll dive. This is\nan attempt to establish the facts and figure out what's the roadmap to tendies\nfrom here on.\n\ntl;dr for those on a multicoloured crayon…",
  "original_created_utc": 1613342450,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "声明：以下内容均非投资建议。请自行研究。\n\n有很多关于AMC的讨论，以及它是会流行还是会跳水。這是\n试图确定事实，并找出什么是通向Tendies的路线图。\n从这里开始。\n\ntl;dr为那些对多色蜡笔... ...",
      "title": "AMC Blockbuster DD"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "聲明：以下內容均非投資建議。請自行研究。\n\n有很多關於AMC的討論，以及它是會流行還是會跳水。這是\n試圖確定事實，並找出什麼是通向Tendies的路線圖。\n從這裏開始。\n\ntl;dr爲那些對多色蠟筆... ...",
      "title": "AMC Blockbuster DD"
    }
  ],
  "title": "AMC Blockbuster DD",
  "created_utc": 1613408753,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p>Disclaimer: None of the following is investment advice. Do your own research.</p>\n\n<p>There&#39;s a lot of chatter about AMC and whether it&#39;ll pop or it&#39;ll dive. This is an attempt to establish the facts and figure out what&#39;s the roadmap to tendies from here on.</p>\n\n<p><strong>tl;dr for those on a multicoloured crayon diet:</strong> </p>\n\n<p><strong>AMC is not dead, nor will it die anytime soon. There&#39;s plenty of positive catalysts coming up.</strong></p>\n\n<p><strong>If you want to get in this play right away then better buy shares because IV is very high at the moment. $5 seems like a price floor. If you do want to buy calls I suggest Aug expiry between $7-$9, or better yet LEAPS Jan 22 at $10-$12.</strong> </p>\n\n<p><strong>My position is 15,000 shares at about $2.40. I&#39;m waiting for IV to drop a bit before I buy LEAPS.</strong></p>\n\n<p>Let&#39;s start at the beginning:</p>\n\n<p>AMC is the largest movies operator in the world. It has 1,004 theatres and 11,041 screens worldwide. The biggest, by far. They made $43bn revenue for movie studios in 2019.</p>\n\n<p>What we know from the Q3 2020 results:</p>\n\n<p>After 5 months suspension of Operations theatres started to reopen.</p>\n\n<p>First domestic theatres reopened 8/20 and int&#39;l ones as early as June. However, most of Europe has been in lockdown since Nov/Dec 2020 and all domestics operate on a 20%-40% limited capacity. As of Oct 30th it operated 539/600 domestic locations and 261/358 int&#39;l locations. </p>\n\n<p>Record high scores in cleanliness of theatres.</p>\n\n<p>March 2020 raised $900m in debt and equity. $1bn concessions from creditors and landlords, $80m asset sales.</p>\n\n<ul>\n<li>Q1 of 2020: drew down $325m from existing credit lines</li>\n<li>April 2020: issued $500m of debt due 2025. Suspended cash repurchase and dividends. Received $7m in tax cash refunds</li>\n<li>July 2020: debt exchange reduced debt by $555m, reduced interest expenses by $120m for one year (up to July 2022), extended maturities on $1.7bn of debt until 2026 and issued $300m of new debt due 2026.</li>\n<li>August 2020: sold Baltic region theatres for $77m.</li>\n<li>Sept 2020: sold 15m shares for $56.1m.</li>\n<li>Oct 2020: sold another 15m shares for $41.6m.</li>\n<li>Dec 2020: Prepared 50m shares for issuance, should they need to. Total shares outstanding on Dec 28 2020 were 164m Class A and 51.8m Class B. </li>\n<li>Jan 2021: Total shares outstanding as of Jan 22 2021 were 287,276,58 Class A and 51.8m Class B (Class B can&#39;t be sold unless converted to Class A).</li>\n<li>Jan 27th: SLA converts debt into equity and sells $600m worth of shares in the market. Total shares added to float: 44.4m. Debt reduced by $600m</li>\n<li>Feb 5th 2020: Wanda converted it&#39;s class B shares to class A shares. This means they can sell them in the market at any time now. There is no specific # on how many shares it converted, but we know it owned 51.8m of Class B shares. </li>\n</ul>\n\n<p>Operationally they proceeded with layoffs and a series of cost cutting measures, renegotiated theatre leases, eliminate contractor roles and all sorts of expenses. <strong>This is important as these savings will persist throughout the reopening of the theatres, so they will improve their profit margins going forward.</strong></p>\n\n<p><strong>Cash position on 9/30: $417.9m</strong></p>\n\n<p><strong>Total debt on 9/30: $5.82bn</strong></p>\n\n<p><strong>Q&amp;A with myself</strong></p>\n\n<p><strong>Are people really returning to theatres?</strong></p>\n\n<p>Attendance was 6.5m tickets in Q3 2020 vs 87.1m in Q3 2019, representing about 7.5% of seating capacity, which was limited to about 20%-40% of total seats. While this may look like they are not utilizing their existing seating capacity, remember that theatre ops in USA were suspended for 2/3 of the 3rd quarter. I am guessing (no data) a similar restriction at the international theatres. Had ops not been suspended for 2/3 of Q3 then we&#39;d be seeing roughly 3x the tickets, about 19.5m, or 22% of total seating capacity. That would suggest people were returning to cinemas before the end of Sept 2020. That&#39;s despite no blockbusters playing. <strong>Only 2 films were released theatrically since mid-March to end of Sept and theatres were open mostly on weekends, so there wasn&#39;t much to watch anyway.</strong></p>\n\n<p><strong>Are people spending at the theatres?</strong></p>\n\n<p>Average ticket prices in Q3 2020 were $9.37 VS. $9.45 in Q3 2019, so pretty much the same.</p>\n\n<p>In Int&#39;l markets ticket prices were actually higher, at $9.80 vs $8.45.</p>\n\n<p>Spending on food and beverage was the same in USA, at $5.35/patron in both Q3 2020 and Q3 2019, and higher in int&#39;l markets ($4.10/patron vs. $3.59/patron in Q3 2019)</p>\n\n<p>Again, that&#39;s positive in relation to how customers feel about AMC managing the cleaning of its theatres and safety practices. That level of spending suggests people are comfortable watching movies and eating/drinking in the theatres. </p>\n\n<p><strong>From the Q3 ER call:</strong></p>\n\n<p>The critical movie-leading markets of Los Angeles and New York City remain closed.</p>\n\n<p>There has been massive focus on improving liquidity and deleveraging the balance sheet and cutting costs and spending. <strong>A lot of those cost saving and spending cuts will continue even after revenue recovers,</strong> which means higher profit margins, which means higher EPS, which means lower multiples to comps, which means share price will go up as it will be perceived as &#39;cheap&#39;.</p>\n\n<p>Stroke a deal with Universal for a PVOD window. Basically, that means that AMC will not exclusive rights to play movies for 74 days at theatres before the movie can go on video-on-demand. The time window is shortened, and after that you will have movies both on theatres and on demand online at the same time. AMC will take a cut for any movies that go on PVOD before the theatrical release period ends. As they said later in November, they have made more money with the PVOD deal than the standard exclusive theatrical release.</p>\n\n<p>Theatre count in Middle East tripled in 2020, and it will further double in the first half of 2021.</p>\n\n<p>Cash burn for Q3 2020 was $324m, inclusive of the costs for raising capital.</p>\n\n<p><strong>44 major film titles have been rescheduled to play theatrically only in 2021. Once theatres reopen, say in summer, there will be a blockbuster every single week and some more.</strong></p>\n\n<p>They have gotten out of 40 loss-making theatres in USA as well by not renewing leases.</p>\n\n<p><strong>Breaking even?</strong></p>\n\n<p>In 2019 AMC sold 17% of their available seats and had the biggest revenue/profit of any year ever. It all hinges to NYC and LA reopening basically as other individual theatres break even at 25% capacity. What this means is that you don&#39;t need COVID restrictions to lift fully before AMC starts making profits, you only need LA and NYC to reopen. This makes AMC a bit of a dark horse because most people will be waiting for full economy reopen before they jump at the stock, but its financials will be in the black long before then, and that means that it will most likely surprise upwards on ER going forward and exceed wallstreet&#39;s expectations.</p>\n\n<p><strong>Innovation. Ok, they will reopen, but will they grow?</strong></p>\n\n<p>They have launched a private theatre rental program, where you can book the whole auditorium. They have had 80,000 incquiries about it, and that&#39;s with a soft launch (no press releases yet or advertising).</p>\n\n<p>There have been a lot of articles in the second half of 2020 about Amazon or Netflix partnering or buying them out. That would drive the price high instantly. Bear in mind that the streaming giants are facing pressure on growing their market share and AMC makes perfect sense. Also, given their balance sheets the financial risk of buying AMC out at roughly $2bn market cap is negligible.</p>\n\n<p><strong>Won&#39;t streaming kill the movie theatres?</strong></p>\n\n<p>No, absolutely not. AMC provided $43bn of revenue to film makers in 2019. No studio will forgo that kind of revenue. In fact, from the pilot testing of PVOD they&#39;ve done, it&#39;s actually more lucrative for both theatres and studios to have a short exclusive theatrical release followed by concurrent streaming, than either/or. It&#39;s a new model of releasing movies and a much more profitable one. In summary, streaming will actually increase profits for AMC, not take away any.</p>\n\n<p><strong>Ok, that may be true for the big blockbuster Avenger-type movies, but what about smaller releases? won&#39;t they be best stream-only?</strong></p>\n\n<p>No, they have tested the PVOD deal with small releases (e.g. Kajilionaire which made under $10m revenue in cinemas) and the combined profit for studios/AMC was higher than the older model or what it&#39;d have done streaming alone.</p>\n\n<p><strong>Analyst ratings:</strong></p>\n\n<p>According to marketbeat: 4 sell and 6 hold</p>\n\n<p>AMC has the lowest, by far, P/E ratio against its competitors. This means it is perceived as cheap.</p>\n\n<p><strong>Earnings date: 25 Feb</strong></p>\n\n<p>&#x200B;</p>\n\n<p><strong>Major shareholders:</strong></p>\n\n<ul>\n<li>Blackrock 2.9% (increased it&#39;s position by 70%)</li>\n<li>Vanguard 4.5% (reduced its position slightly by -5%)</li>\n<li>Mittleman 1%</li>\n<li>Norther Trust 0.5% (increased position by 40%)</li>\n<li>Stifel 0.2% (increase position by 285%)</li>\n<li>Bank of NY Mellon 0.2%</li>\n<li>Wells Fargo 0.15%</li>\n<li>Charles Schwab 1% (increased its position by 10%)</li>\n<li>Goldman Sachs 0.6% (increased position by 160%)</li>\n</ul>\n\n<p><strong>Risks:</strong></p>\n\n<p>Further dilution in case AMC decides to sell more shares. This can be avoided if theatres start reopening faster or attendance picks up. With vaccinations underway in USA we should soon hear about LA and NYC reopening (NYC already lifte some restrictions in hospitality). People are worried about dilution, but do remember that shareholders were happy to pay high prices for those shares, so they believe they bought in cheap, and they aren&#39;t all idiots.</p>\n\n<p>Debt holders pushing hard on AMC. However, this is unlikely to their benefit as any restructuring will take forever and they stand to lose a lot through a prolonged asset sale. It&#39;s preferable for debt holders to convert debt to equity and sell - and for that they&#39;d need a good/high stock price.</p>\n\n<p>Further COVID lockdowns because of new variants or whatnot</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Catalysts</strong>:</p>\n\n<p>Definite: Vaccination roll out means NYC and LA announce reopening of theatres soon.</p>\n\n<p>Possible: Esports partnerships</p>\n\n<p>Who knows: Buyout or partnership with Netflix, Amazon or Disney</p>\n\n<p><strong>Other</strong></p>\n\n<ul>\n<li>Short interest remains high, I believe it was around 68% on 1/31, but someone may correct me if I got this wrong. In any positive newsflow the shorts will be pressed a bit.</li>\n<li>People are gagging to go to the cinema, AMC has had it&#39;s best revenue year after year up to 2019. They are not a dying business by any stretch of the imagination.</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>Any error you see, or additional piece of info that would be useful, let me know and I&#39;ll edit accordingly.</p>\n\n<p>Disclaimer: None of the above is investment advice. Do your own research.</p>\n</div><!-- SC_ON -->",
  "score": 1307,
  "permalink": "/r/wallstreetbets/comments/ljz99b/amc_blockbuster_dd/",
  "subreddit": "wallstreetbets",
  "id": "ljz99b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728633150
}