{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "**Compare the similarities from this article to our current situation**  \n\n \"Investors Take Sunny View Of Gloomy U.S. Jobs Data\"\n\n *By* *E.S. Browning* Staff Reporter of The Wall Street Journal\n\n**May 7, 2001** 12:01 am ET \n\n The economic indicators are gloomily heading south. The stock market is cheerfully heading north. What gives?\n\nEconomic hopes took a hit Friday, when investors learned that April unemployment, at 4.5%, was far higher than expected. Wages also were up more than expected, sparking worries on inflation. On top of that, President Bush's spokesman said the White House feared that strong first-quarter growth numbers, which had helped to boost stocks, might have to be revised downward.\n\nIt sounded like the economy might be heading down again, and stocks initially fell Friday morning. But then, curiously, the market turned around and stocks put in a substantial gain.\n\nSome attributed it to a renewal of the old bull-market mentality. Hopes spread that the Federal Reserve now will stimulate the economy further by cutting rates by yet another half-percentage point when it holds its next policy meeting a week from Tuesday.\n\n But it is possible that an even simpler explanation is behind some of the buying: Over the past month, a lot of investors have begun to bet that the economy isn't going to get much worse and may well entirely avoid a recession, defined as two consecutive quarters of economic decline. Given all of the job cuts announced in April, the reasoning goes, an uptick in unemployment isn't a bad surprise at all. It is a sign that companies are taking their medicine and that the economy is hitting bottom.\n\nThere are plenty of experts who think that is fool's logic, that recession could be around the corner and that the market is headed down again. But that skeptical view is in the clear minority now. Expectations for technology stocks had fallen so low that the mere idea that the economy could be reaching bottom has been enough to give them a serious boost and help pull the entire market back up.\n\n \"I think that even a 5% unemployment number is not so steep as to really affect the broad economy,\" says Tim Morris, chief investment officer at Bessemer Trust in New York. \"In a way, this is positive news because this is what companies had to do to get a handle on their earnings and margins. They had to attack the labor component of their cost structure.\"\n\nThat helps explain why the tech group has been surging. On Friday, despite the negative economic news, the tech-led Nasdaq Composite Index jumped 2.11%, or 45.33 points, to 2191.53. It was up 5.6% for the week and ahead 34% since April 4. The Dow Jones Industrial Average advanced 1.43%, or 154.59 points, on Friday, to 10951.24, up 1.3% for the week and up 15% since March 22.\n\n For the year so far, the industrials now are up 1.5%, but the beleaguered Nasdaq still is down 11%. The broad S&amp;P 500, which gained 1.44%, or 18.03 points, to 1266.61 on Friday, still is down 4.1% so far this year and is 17% off its record close of March 24, 2000.\n\nIt isn't that investors such as Mr. Morris have turned totally bullish. Mr. Morris has boosted his tech holdings to 18% from 12% of his portfolio, a 50% increase in a month. But his exposure to tech and communications stocks still is below that of the Standard &amp; Poor's 500-stock index, which is around 26%. He had sold so much tech stock that all he had to do was turn somewhat less pessimistic in order to spark a sharp jump, in percentage terms, in his exposure.\n\nGeorge Cohen, president of New York money-management firm Cohen Klingenstein &amp; Marks, made a similar argument in a report to clients last week. \"It is our view that the economy is very close to the weakest point in the current slowdown, probably we are past it,\" Mr. Cohen wrote. His firm sold a lot of its tech holdings more than a year ago and shunned them until a few weeks ago. Now, he told his clients, \"the quality technology companies that have defined markets and huge profits have had their stock prices overcorrected. It is time to move back into them.\" \n\n There are plenty of people who are less hopeful about the economic data.\n\nBob Bissell, president of Wells Capital Management, Wells Fargo's money-management arm, agrees that, in all probability, \"we are past the worst\" in the economy, although he, too, says he wouldn't be surprised to see unemployment go to 5% before companies finish downsizing.\n\nBut he disagrees with Mr. Cohen on an important point: He doesn't see how technology companies can turn in business results to justify their huge recent stock gains. [Juniper Networks](https://www.wsj.com/market-data/quotes/JNPR) has more than doubled since April 4. [Intel](https://www.wsj.com/market-data/quotes/INTC) is up 36% and [Nokia](https://www.wsj.com/market-data/quotes/nok) is up more than 50% since then. What are they going to do now to justify further gains?\n\nEven the best of the economic numbers still look weak, Mr. Bissell notes. Strong auto sales helped spark first-quarter growth, but many of those sales were made at little or no profit. He thinks the economy will remain weak and bonds may do better than stocks as the Fed keeps cutting interest rates in an effort to stave off recession.\n\n\"We think some major sectors of the economy will still go sideways for a while, including technology,\" he says. \"Companies aren't investing a lot of money in new technology initiatives. They still are in a wait-and-see mode.\"",
  "author_fullname": "t2_77vx6epz",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "WSJ Article from May 7, 2001 which was the top of a 34% bear market rally for the Nasdaq",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_wodr81",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.68,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 41,
  "total_awards_received": 1,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 41,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {
    "gid_1": 1
  },
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1660503309,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;Compare the similarities from this article to our current situation&lt;/strong&gt;  &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Investors Take Sunny View Of Gloomy U.S. Jobs Data&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;By&lt;/em&gt; &lt;em&gt;E.S. Browning&lt;/em&gt; Staff Reporter of The Wall Street Journal&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;May 7, 2001&lt;/strong&gt; 12:01 am ET &lt;/p&gt;\n\n&lt;p&gt;The economic indicators are gloomily heading south. The stock market is cheerfully heading north. What gives?&lt;/p&gt;\n\n&lt;p&gt;Economic hopes took a hit Friday, when investors learned that April unemployment, at 4.5%, was far higher than expected. Wages also were up more than expected, sparking worries on inflation. On top of that, President Bush&amp;#39;s spokesman said the White House feared that strong first-quarter growth numbers, which had helped to boost stocks, might have to be revised downward.&lt;/p&gt;\n\n&lt;p&gt;It sounded like the economy might be heading down again, and stocks initially fell Friday morning. But then, curiously, the market turned around and stocks put in a substantial gain.&lt;/p&gt;\n\n&lt;p&gt;Some attributed it to a renewal of the old bull-market mentality. Hopes spread that the Federal Reserve now will stimulate the economy further by cutting rates by yet another half-percentage point when it holds its next policy meeting a week from Tuesday.&lt;/p&gt;\n\n&lt;p&gt;But it is possible that an even simpler explanation is behind some of the buying: Over the past month, a lot of investors have begun to bet that the economy isn&amp;#39;t going to get much worse and may well entirely avoid a recession, defined as two consecutive quarters of economic decline. Given all of the job cuts announced in April, the reasoning goes, an uptick in unemployment isn&amp;#39;t a bad surprise at all. It is a sign that companies are taking their medicine and that the economy is hitting bottom.&lt;/p&gt;\n\n&lt;p&gt;There are plenty of experts who think that is fool&amp;#39;s logic, that recession could be around the corner and that the market is headed down again. But that skeptical view is in the clear minority now. Expectations for technology stocks had fallen so low that the mere idea that the economy could be reaching bottom has been enough to give them a serious boost and help pull the entire market back up.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I think that even a 5% unemployment number is not so steep as to really affect the broad economy,&amp;quot; says Tim Morris, chief investment officer at Bessemer Trust in New York. &amp;quot;In a way, this is positive news because this is what companies had to do to get a handle on their earnings and margins. They had to attack the labor component of their cost structure.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;That helps explain why the tech group has been surging. On Friday, despite the negative economic news, the tech-led Nasdaq Composite Index jumped 2.11%, or 45.33 points, to 2191.53. It was up 5.6% for the week and ahead 34% since April 4. The Dow Jones Industrial Average advanced 1.43%, or 154.59 points, on Friday, to 10951.24, up 1.3% for the week and up 15% since March 22.&lt;/p&gt;\n\n&lt;p&gt;For the year so far, the industrials now are up 1.5%, but the beleaguered Nasdaq still is down 11%. The broad S&amp;amp;P 500, which gained 1.44%, or 18.03 points, to 1266.61 on Friday, still is down 4.1% so far this year and is 17% off its record close of March 24, 2000.&lt;/p&gt;\n\n&lt;p&gt;It isn&amp;#39;t that investors such as Mr. Morris have turned totally bullish. Mr. Morris has boosted his tech holdings to 18% from 12% of his portfolio, a 50% increase in a month. But his exposure to tech and communications stocks still is below that of the Standard &amp;amp; Poor&amp;#39;s 500-stock index, which is around 26%. He had sold so much tech stock that all he had to do was turn somewhat less pessimistic in order to spark a sharp jump, in percentage terms, in his exposure.&lt;/p&gt;\n\n&lt;p&gt;George Cohen, president of New York money-management firm Cohen Klingenstein &amp;amp; Marks, made a similar argument in a report to clients last week. &amp;quot;It is our view that the economy is very close to the weakest point in the current slowdown, probably we are past it,&amp;quot; Mr. Cohen wrote. His firm sold a lot of its tech holdings more than a year ago and shunned them until a few weeks ago. Now, he told his clients, &amp;quot;the quality technology companies that have defined markets and huge profits have had their stock prices overcorrected. It is time to move back into them.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;There are plenty of people who are less hopeful about the economic data.&lt;/p&gt;\n\n&lt;p&gt;Bob Bissell, president of Wells Capital Management, Wells Fargo&amp;#39;s money-management arm, agrees that, in all probability, &amp;quot;we are past the worst&amp;quot; in the economy, although he, too, says he wouldn&amp;#39;t be surprised to see unemployment go to 5% before companies finish downsizing.&lt;/p&gt;\n\n&lt;p&gt;But he disagrees with Mr. Cohen on an important point: He doesn&amp;#39;t see how technology companies can turn in business results to justify their huge recent stock gains. &lt;a href=\"https://www.wsj.com/market-data/quotes/JNPR\"&gt;Juniper Networks&lt;/a&gt; has more than doubled since April 4. &lt;a href=\"https://www.wsj.com/market-data/quotes/INTC\"&gt;Intel&lt;/a&gt; is up 36% and &lt;a href=\"https://www.wsj.com/market-data/quotes/nok\"&gt;Nokia&lt;/a&gt; is up more than 50% since then. What are they going to do now to justify further gains?&lt;/p&gt;\n\n&lt;p&gt;Even the best of the economic numbers still look weak, Mr. Bissell notes. Strong auto sales helped spark first-quarter growth, but many of those sales were made at little or no profit. He thinks the economy will remain weak and bonds may do better than stocks as the Fed keeps cutting interest rates in an effort to stave off recession.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;We think some major sectors of the economy will still go sideways for a while, including technology,&amp;quot; he says. &amp;quot;Companies aren&amp;#39;t investing a lot of money in new technology initiatives. They still are in a wait-and-see mode.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "wodr81",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "OBS10invest",
  "discussion_type": null,
  "num_comments": 45,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/wodr81/wsj_article_from_may_7_2001_which_was_the_top_of/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/wodr81/wsj_article_from_may_7_2001_which_was_the_top_of/",
  "subreddit_subscribers": 4426834,
  "created_utc": 1660575551,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1660503309,
  "the_new_excerpt": "Compare the similarities from this article to our current situation\n\n\"Investors Take Sunny View Of Gloomy U.S. Jobs Data\"\n\nBy E.S. Browning Staff Reporter of The Wall Street Journal\n\nMay 7, 2001 12:01 am ET\n\nThe economic indicators are gloomily heading south. The stock market is\ncheerfully heading…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この記事から、私たちの現状との類似点を比較してみましょう。\n\n\"投資家、暗い米雇用統計に明るい見方\"\n\nBy E.S. Browning ウォールストリートジャーナルのスタッフレポーター\n\n2001年5月7日 12時01分(米国東部時間)\n\n経済指標は、暗澹たる気持ちで南に向かっている。株式市場は\n株式市場は明るく...",
      "title": "ナスダックが34％上昇した弱気相場の頂点となった2001年5月7日のWSJ記事"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "将这篇文章中的相似之处与我们目前的情况进行比较\n\n\"投资者对黯淡的美国就业数据持乐观态度\"\n\n作者：E.S. Browning 《华尔街日报》的工作人员记者\n\n美东时间2001年5月7日上午12:01\n\n经济指标正阴沉地往南走。股票市场则是\n欢快地走向...",
      "title": "华尔街日报》2001年5月7日的文章，那是纳斯达克34%的熊市反弹的顶部"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "將這篇文章中的相似之處與我們目前的情況進行比較\n\n\"投資者對黯淡的美國就業數據持樂觀態度\"\n\n作者：E.S. Browning 《華爾街日報》的工作人員記者\n\n美東時間2001年5月7日上午12:01\n\n經濟指標正陰沉地往南走。股票市場則是\n歡快地走向...",
      "title": "華爾街日報》2001年5月7日的文章，那是納斯達克34%的熊市反彈的頂部"
    }
  ]
}