{
  "author": "That-Attitude6308",
  "original_created_utc": 1637077052,
  "title": "Other than reddit, where do you get your info on crypto from? Shill your info sources.",
  "created_utc": 1637091078,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I got most of my info on crypto from reddit through <a href=\"/r/cc\">r/cc</a> and various other specific coin related subs.  Reddit remains my prime source for crypto information.</p>\n\n<p>Where do you guys get information on latest developments in crypto? I follow a few telegram groups too but i am not that active and there are thousands of messages everyday and its difficult to keep up. Is there there some place where we are not overwhelmed with information but also gets relevant information all the same?</p>\n\n<p>I would like to have some discord server where only few people posts messages with relevant info so that we upto date on crypto or a weekly newsletter with relevant info and promising projects.</p>\n\n<p>Anyone has any ideas? Feel free to pitch in.</p>\n</div><!-- SC_ON -->",
  "score": 235,
  "permalink": "/r/CryptoCurrency/comments/qvahg4/other_than_reddit_where_do_you_get_your_info_on/",
  "subreddit": "CryptoCurrency",
  "id": "qvahg4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I got most of my info on crypto from reddit through r/cc [/r/cc] and various\nother specific coin related subs. Reddit remains my prime source for crypto\ninformation.\n\nWhere do you guys get information on latest developments in crypto? I follow a\nfew telegram groups too but i am not that active and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はredditのr/cc[/r/cc]や他の様々なコイン関連のサブサイトからcryptoに関する情報を得ています。\n他のコイン関連のサブサイトからです。Redditは今でも私の暗号情報の主要な情報源です。\n情報源です。\n\n皆さんは、cryptoの最新情報をどこで入手していますか？いくつかのテレグラムグループもフォローしていますが\n私もいくつかのテレグラムグループをフォローしていますが、それほどアクティブではありませんし...。",
      "title": "reddit以外では、cryptoの情報はどこから得ていますか？あなたの情報源を教えてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我从reddit的r/cc [/r/cc]和各种特定的硬币相关子频道获得了大部分关于加密货币的信息。\n其他特定硬币相关的子网站。Reddit仍然是我获得加密货币信息的主要来源。\n信息的主要来源。\n\n你们从哪里获得加密货币的最新发展信息？我关注了一个\n一些电报组，但我不是那么活跃，而且...",
      "title": "除了reddit之外，你从哪里得到关于加密货币的信息？推销你的信息来源。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我從reddit的r/cc [/r/cc]和各種特定的硬幣相關子頻道獲得了大部分關於加密貨幣的信息。\n其他特定硬幣相關的子網站。Reddit仍然是我獲得加密貨幣信息的主要來源。\n信息的主要來源。\n\n你們從哪裏獲得加密貨幣的最新發展信息？我關注了一個\n一些電報組，但我不是那麼活躍，而且...",
      "title": "除了reddit之外，你從哪裏得到關於加密貨幣的信息？推銷你的信息來源。"
    }
  ]
}