{
  "author": "Superkulicka",
  "original_created_utc": 1629067104,
  "title": "I deleted my seed phrase and sent it to my future me. Let's see how this experiment goes.",
  "created_utc": 1629096239,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>That&#39;s it. From a start, I appreciated that crypto changed my life for the better (cut my alcohol, cigarettes, nonsense expenses), but recently I caught myself checking the market so much that it made me stressed, inevitable moving chunks of my portfolio and losing a bit here and there. Well, now I don&#39;t care about the market.</p>\n\n<p>I put all my shitcoins and alt-coins into my cold wallet and <strong>destroyed, deleted, annihilated my seed phrase.</strong></p>\n\n<p>Before destroying my seed phrase, <strong>I wrote it down and send it. As a letter and an email. To myself, in the future, like goddamn Doc in Back to the future 2</strong>. I used three different services to be sure that at least one will come. 2 of them are via email, one of them via physical letter (you can change address in case of moving). Those services are operating for almost 20 years, so I kinda believe they will be around in 5 years.</p>\n\n<p>In some cases, I dissolved that seed phrase in longer text, although even if someone would &quot;steal&quot; my seed phrase, they would not know from which wallet it is.</p>\n\n<p>I set the date for exactly 5 years from now. So I will be able to move my portfolio not sooner than 15.8.2026.</p>\n\n<p>Since I know I can&#39;t do anything about that, I deleted coinmarketcap, coingecko etc from my mobile phone.</p>\n\n<p>Right now I am outside reading a book.</p>\n\n<p>EDIT: I locked myself from an amount that I am willing to lose and can afford to lose/not be able to get when I need. I am doing this just as an experiment.</p>\n</div><!-- SC_ON -->",
  "score": 168,
  "permalink": "/r/CryptoCurrency/comments/p53f8f/i_deleted_my_seed_phrase_and_sent_it_to_my_future/",
  "subreddit": "CryptoCurrency",
  "id": "p53f8f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "That's it. From a start, I appreciated that crypto changed my life for the\nbetter (cut my alcohol, cigarettes, nonsense expenses), but recently I caught\nmyself checking the market so much that it made me stressed, inevitable moving\nchunks of my portfolio and losing a bit here and there. Well, now I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "以上です。最初から、暗号が私の人生を良い方向に変えたことを評価していました。\nしたが、最近は市場をチェックしすぎてストレスがたまり、必然的に市場が動くようになりました。\nしかし、最近は市場をチェックしすぎてストレスが溜まり、必然的にポートフォリオの一部を移動させてしまいました。\nしかし、最近は市場をチェックしすぎてストレスがたまり、必然的にポートフォリオの大部分を動かしてしまい、あちこちで少しずつ損をしていました。さて、今、私は...",
      "title": "種明かしのフレーズを削除して、未来の私に送ってみました。この実験がどうなるか見てみよう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "就是这样。从一开始，我就很欣赏加密货币改变了我的生活\n削减了我的酒精、香烟和无意义的开支），但最近我发现\n但最近我发现自己经常查看市场，以至于让我感到压力，不可避免地移动了\n大块的投资组合，并在这里和那里损失了一些。那么，现在我...",
      "title": "我删除了我的种子短语，并将其发送给我未来的我。让我们看看这个实验如何进行。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "就是這樣。從一開始，我就很欣賞加密貨幣改變了我的生活\n削減了我的酒精、香菸和無意義的開支），但最近我發現\n但最近我發現自己經常查看市場，以至於讓我感到壓力，不可避免地移動了\n大塊的投資組合，並在這裏和那裏損失了一些。那麼，現在我...",
      "title": "我刪除了我的種子短語，並將其發送給我未來的我。讓我們看看這個實驗如何進行。"
    }
  ]
}