{
  "author": "curiousabe_1",
  "the_new_excerpt": "So I have a some close friends who started this quite successful company a few\nyears ago. After some buzz in media with some quite heavy players investing I\nthought I'd reach out too see if I could join in. Seeing as I'm no millionaire\nthis will be one of the few times I'm able to particiapte. I…",
  "original_created_utc": 1616115271,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "所以，我有一些亲密的朋友谁创办了这个相当成功的公司几\n几年前。经过媒体的一番热议，一些相当重量级的玩家投资我。\n我想我也会伸出手，看看我是否能加入。因为我不是什么百万富翁\n这将是我为数不多的几次能参与的机会。I…",
      "title": "投资于非上市公司"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以，我有一些親密的朋友誰創辦了這個相當成功的公司幾\n幾年前。經過媒體的一番熱議，一些相當重量級的玩家投資我。\n我想我也會伸出手，看看我是否能加入。因爲我不是什麼百萬富翁\n這將是我爲數不多的幾次能參與的機會。I…",
      "title": "投資於非上市公司"
    }
  ],
  "title": "Investing in non-traded company",
  "created_utc": 1616131692,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I have a some close friends who started this quite successful company a few years ago. After some buzz in media with some quite heavy players investing I thought I&#39;d reach out too see if I could join in. Seeing as I&#39;m no millionaire this will be one of the few times I&#39;m able to particiapte. I belive in their business model bigly and honestly think they have a very good chance of succeeding.</p>\n\n<p>Up until now I&#39;ve only invested in stocks and mutual funds so when it comes to investing in privately-held companies what pitfalls and financial key metrics should I look at / ask them?</p>\n\n<p>The company today:</p>\n\n<ul>\n<li>Current outstanding shares: 6m</li>\n<li>Implied equity value: 23m USD</li>\n</ul>\n\n<p>They are about to initiate another round of funding, this will be a large round where they are trying to raise 440m USD since they are scaling up substatntionally from local to national distribution and sales in order to supply demand , if sucessfull it will change the numbers to:</p>\n\n<ul>\n<li>Outstanding shares: 15.5m</li>\n<li>Estimated valuation: 440m USD</li>\n</ul>\n\n<p>Estimated earnings/projections look good but what specific answers should I ask them before jumping the gun and what key metrics should I try and calculate?</p>\n</div><!-- SC_ON -->",
  "score": 146,
  "permalink": "/r/investing/comments/m85fyo/investing_in_nontraded_company/",
  "subreddit": "investing",
  "id": "m85fyo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752818324
}