{
  "author": "Raiwist",
  "original_created_utc": 1629899169,
  "title": "Banks don't want the average person to know about crypto. It loses them business.",
  "created_utc": 1629930869,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Banks are ultimately businesses whose main aim is to turn a profit. They do so by investing the money kept in the accounts people keep with them - YOUR money.</p>\n\n<p>If a new store of wealth comes along into which people place money they would have otherwise kept in bank accounts, banks lose out on capital with which to invest and make more money.</p>\n\n<p>When banks are seen as the only option, they possess all the power (money=power, that&#39;s obvious nowadays). It is in their best interests to fearmonger when it comes to a potential rival - which crypto is.</p>\n\n<p>While cryptocurrency is currently just a plucky underdog of sorts, I think many people (here at least) forsee that not being the case for long. The will of the common person is gradually wearing them down, but some banks still make it incredibly difficult to deposit into exchanges to make crypto purchases.</p>\n\n<p>We&#39;ve already seen adoption by huge institutions - and the recent applications regarding Bitcoin ETFs are very promising. Cryptocurrencies are the centre of attention for many news outlets; the daily number of crypto-related articles being produced seems to be increasing exponentially.</p>\n\n<p>The average person is far more clued-in than they would have wanted and only when negative press would damage their credibility do they give in (not all do but social media is a powerful tool these days).</p>\n\n<p>So, do spread the word; you don&#39;t need to give specific investing advice. Just tell people to look into cyrpto in general - the technology, growth and potential really speaks for itself.</p>\n</div><!-- SC_ON -->",
  "score": 191,
  "permalink": "/r/CryptoCurrency/comments/pbbjig/banks_dont_want_the_average_person_to_know_about/",
  "subreddit": "CryptoCurrency",
  "id": "pbbjig",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Banks are ultimately businesses whose main aim is to turn a profit. They do so\nby investing the money kept in the accounts people keep with them - YOUR money.\n\nIf a new store of wealth comes along into which people place money they would\nhave otherwise kept in bank accounts, banks lose out on…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "銀行は、最終的には利益を上げることを目的としたビジネスです。そのためには\n人々の口座に保管されているお金、つまりあなたのお金を投資することで利益を得ています。\n\n人々が銀行口座に預けていたお金を投資する新しい富の貯蔵庫が登場すると、銀行は...\n人々が銀行口座に預けていたお金を投資する新しい富の貯蔵庫が登場すれば、銀行は損失を被ることになります。",
      "title": "銀行は一般の人に暗号について知ってもらいたくありません。それは彼らのビジネスを失うからです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "银行最终是企业，其主要目的是实现盈利。他们这样做\n通过投资人们在他们那里的账户中的钱--你的钱。\n\n如果出现了一种新的财富存储方式，人们把本来放在银行账户里的钱放进去\n否则他们会把钱放在银行账户里，银行就会失去...",
      "title": "银行不希望普通人了解加密货币。这让他们失去了生意。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "銀行最終是企業，其主要目的是實現盈利。他們這樣做\n通過投資人們在他們那裏的賬戶中的錢--你的錢。\n\n如果出現了一種新的財富存儲方式，人們把本來放在銀行賬戶裏的錢放進去\n否則他們會把錢放在銀行賬戶裏，銀行就會失去...",
      "title": "銀行不希望普通人瞭解加密貨幣。這讓他們失去了生意。"
    }
  ]
}