{
  "author": "Spiritual_Navigator",
  "the_new_excerpt": "If you are feeling suicidal over this you can send me a private message, can\nhelp to have someone to talk to in private.\n\nThe reason I am making this post is because I still remember how many people\nwere commiting suicide back in 2018, and I think that we as a community have a\nresponsibility to…",
  "original_created_utc": 1621668705,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もし、この件で自殺したくなったら、私にプライベートメッセージを送ってください。\n誰かと個人的に話をすることは助けになります。\n\n私がこの投稿をした理由は、2018年に多くの人が自殺したことをまだ覚えているからです。\nこの投稿をしたのは、2018年に多くの人が自殺していたことを今でも覚えていて、私たちはコミュニティとして責任があると思ったからです。\n責任があると思います。",
      "title": "もしあなたが自殺を考えているなら、あなたの人生はスクリーン上の数字よりもはるかに価値のある貴重なものだということを知ってもらいたいと思います。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你对此有自杀倾向，你可以给我发一条私人信息，可以\n能帮助你找到一个可以私下交谈的人。\n\n我发这个帖子的原因是，我还记得2018年有很多人\n在2018年时有多少人自杀，我认为我们作为一个社区有责任\n有责任去...",
      "title": "如果你正在考虑自杀，我想让你知道，你的生命远比屏幕上的一些数字更有价值和珍贵。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你對此有自殺傾向，你可以給我發一條私人信息，可以\n能幫助你找到一個可以私下交談的人。\n\n我發這個帖子的原因是，我還記得2018年有很多人\n在2018年時有多少人自殺，我認爲我們作爲一個社區有責任\n有責任去...",
      "title": "如果你正在考慮自殺，我想讓你知道，你的生命遠比屏幕上的一些數字更有價值和珍貴。"
    }
  ],
  "title": "If you are thinking about suicide I want you to know that your life is far more valuable and precious than some numbers on a screen",
  "created_utc": 1621690944,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If you are feeling suicidal over this you can send me a private message, can help to have someone to talk to in private.</p>\n\n<p>The reason I am making this post is because I still remember how many people were commiting suicide back in 2018, and I think that we as a community have a responsibility to support each other in a time like this.</p>\n\n<p>You are the Universe experiencing itself,  it would truly be a tragedy for a unique and remarkable expression of this cosmos to commit suicide because of numbers on a screen.</p>\n\n<p>Your life is far more rare and valuable than any coin.</p>\n</div><!-- SC_ON -->",
  "score": 1673,
  "permalink": "/r/CryptoCurrency/comments/nid9zr/if_you_are_thinking_about_suicide_i_want_you_to/",
  "subreddit": "CryptoCurrency",
  "id": "nid9zr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197383352
}