{
  "author": "ashtonlaszlo",
  "original_created_utc": 1636561696,
  "title": "I’m becoming more and more embarrassed to talk about crypto. Is anybody else feeling this or am I the only adult left here?",
  "created_utc": 1636569153,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As adoption increases, we’re bringing more idiots, children, and failed comedians into the space. </p>\n\n<p>Where I used to find information, discussion, intellectual and constructive criticism, I now see a flood of “Can you believe the number 69 is in the price of BTC?! Next stop 69,420!” or “69,420.69 the magic number!” </p>\n\n<p>Yes, marijuana is good. Yes, sex is good. We all know it. You’re not contributing anything by referencing them. </p>\n\n<p>The intelligence and maturity in this sub, and nearly every other crypto sub I’m subscribed to, has become completely diluted. </p>\n\n<p>All this, during a time where we’re pushing for adoption. We’re trying to be taken seriously. We’re wanting to bring new investors into the space. We’re wanting to see real use of crypto/blockchain technology. </p>\n\n<p>And here you all are acting like a bunch of children, laughing at the mention of “genitalia” in biology class. </p>\n\n<p>It’s fucking embarrassing.</p>\n</div><!-- SC_ON -->",
  "score": 299,
  "permalink": "/r/CryptoCurrency/comments/qqy5sw/im_becoming_more_and_more_embarrassed_to_talk/",
  "subreddit": "CryptoCurrency",
  "id": "qqy5sw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As adoption increases, we’re bringing more idiots, children, and failed\ncomedians into the space.\n\nWhere I used to find information, discussion, intellectual and constructive\ncriticism, I now see a flood of “Can you believe the number 69 is in the price\nof BTC?! Next stop 69,420!” or “69,420.69 the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "普及が進むにつれ、より多くのバカや子供、失敗したコメディアンを\n落ち目のコメディアンが増えています。\n\n以前は、情報や議論、知的で建設的な批判を見つけることができたのに\n以前は情報や議論、知的で建設的な批判があったのですが、今では「BTCの価格に69という数字が入っているなんて信じられますか？\nBTCの価格に69という数字が入っているなんて信じられるか！？次は69,420だ！」とか「69,420.69の...",
      "title": "だんだん暗号の話をするのが恥ずかしくなってきました。このような気持ちになっている人は他にもいるのでしょうか、それともここに残っている大人は私だけなのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "随着采用率的增加，我们把更多的白痴、儿童和失败的\n带来了更多的白痴、儿童和失败的喜剧演员。\n\n以前我可以在这里找到信息、讨论、智力和建设性的\n批评的地方，我现在看到的是大量的 \"你能相信69这个数字在BTC的价格里吗？\nBTC的价格？下一站是69,420！\"或 \"69,420.69这个...\"。",
      "title": "我越来越不好意思谈论加密货币了。还有人有这种感觉吗，还是我是这里唯一的成年人？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "隨着採用率的增加，我們把更多的白癡、兒童和失敗的\n帶來了更多的白癡、兒童和失敗的喜劇演員。\n\n以前我可以在這裏找到信息、討論、智力和建設性的\n批評的地方，我現在看到的是大量的 \"你能相信69這個數字在BTC的價格裏嗎？\nBTC的價格？下一站是69,420！\"或 \"69,420.69這個...\"。",
      "title": "我越來越不好意思談論加密貨幣了。還有人有這種感覺嗎，還是我是這裏唯一的成年人？"
    }
  ]
}