{
  "author": "Simple_Yam",
  "original_created_utc": 1626682602,
  "title": "Ever wondered why 90% of the posts you see in this sub are about Bitcoin and Ethereum?",
  "created_utc": 1626701438,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The answer is simple, we&#39;re not really allowed to talk about other coins. I was reading the rules of this subreddit and found a very interesting portion that I wasn&#39;t aware of:</p>\n\n<p>&quot;No coin or project other than BTC or ETH can have more than two posts in the top50.(...) Bitcoin is exempted because of its dominance in crypto news. The limit for Ethereum has been raised to four.&quot;</p>\n\n<p>So a coin can break the entire world in half but we wouldn&#39;t see more than 2 posts about it in Hot? Am I missreading this?</p>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/CryptoCurrency/comments/on9rdm/ever_wondered_why_90_of_the_posts_you_see_in_this/",
  "subreddit": "CryptoCurrency",
  "id": "on9rdm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The answer is simple, we're not really allowed to talk about other coins. I was\nreading the rules of this subreddit and found a very interesting portion that I\nwasn't aware of:\n\n\"No coin or project other than BTC or ETH can have more than two posts in the\ntop50.(...) Bitcoin is exempted because of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "答えは簡単で、他のコインについて話すことはあまり許されていません。私は\nこのサブレディットのルールを読んでいて、私が知らなかったとても興味深い部分を見つけました。\n認識していませんでした。\n\n\"BTCやETH以外のコインやプロジェクトは、トップ50に2つ以上の投稿をすることはできません。\nビットコインは、以下の理由で除外されています...",
      "title": "このサブで見る記事の90％がビットコインやイーサリアムに関するものであることを不思議に思ったことはありませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "答案很简单，我们其实不允许谈论其他硬币。我在\n我在阅读这个分论坛的规则时，发现了一个非常有趣的部分。\n没有注意到的部分。\n\n\"除BTC或ETH外，其他币种或项目在前50名中不能有两个以上的帖子。\n(...) 比特币被排除在外，因为...",
      "title": "有没有想过，为什么你在这个子里看到的90%的帖子是关于比特币和以太坊的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "答案很簡單，我們其實不允許談論其他硬幣。我在\n我在閱讀這個分論壇的規則時，發現了一個非常有趣的部分。\n沒有注意到的部分。\n\n\"除BTC或ETH外，其他幣種或項目在前50名中不能有兩個以上的帖子。\n(...) 比特幣被排除在外，因爲...",
      "title": "有沒有想過，爲什麼你在這個子裏看到的90%的帖子是關於比特幣和以太坊的？"
    }
  ]
}