{
  "author": "Donkey_Launcher_7",
  "the_new_excerpt": "Hi all,\n\nI was going to post this in the Palantir Technologies thread but I thought I'd\nair my thoughts with the general group. I do not invest in Oil & Gas, Tobacco,\nor Weapons companies, or in specific companies like Amazon, Palantir, etc.\n\nAll of them are morally suspect - either in terms of…",
  "original_created_utc": 1615364669,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "大家好\n\n我本来想把这个贴在Palantir技术的帖子里，但我想我应该把它贴在\n与广大群友交流我的想法。我不投资油气、烟草。\n或武器公司，或在亚马逊、Palantir等具体公司。\n\n所有这些公司都有道德上的嫌疑--无论是在... ...",
      "title": "个人道德与投资"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好\n\n我本來想把這個貼在Palantir技術的帖子裏，但我想我應該把它貼在\n與廣大羣友交流我的想法。我不投資油氣、菸草。\n或武器公司，或在亞馬遜、Palantir等具體公司。\n\n所有這些公司都有道德上的嫌疑--無論是在... ...",
      "title": "個人道德與投資"
    }
  ],
  "title": "Personal ethics & investing",
  "created_utc": 1615382903,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi all, </p>\n\n<p>I was going to post this in the Palantir Technologies thread but I thought I&#39;d air my thoughts with the general group. I do not invest in Oil &amp; Gas, Tobacco, or Weapons companies, or in specific companies like Amazon, Palantir, etc. </p>\n\n<p>All of them are morally suspect - either in terms of being a member of a general industry (i.e. Tobacco companies sueing Governments for potential loss of profits or trying to advertise outside schools) or because of specific issues (e.g. Amazon having meetings with start-up companies and then - completely coincidentally - using their deep pockets to create a cheaper product that happens to be exactly the same, not allowing / resisting unions, etc.; or Palantir, which has had several controversies against its name including being an integral part of the US ICE programme, with Amnesty International being critical about their due diligence). </p>\n\n<p>You may say that 1. you don&#39;t care, so obviously this post isn&#39;t for you, 2. that you&#39;re only one individual so how can you make a difference? Well, corporate governance is increasingly part of businesses these days and plenty of fund managers are moving out of ethically suspect stocks, so you&#39;re not alone, or 3. You&#39;re going to lose out on a lot of money! See below for that one... </p>\n\n<p>Personally I just don&#39;t want to feel that someone else has suffered for me to make some money. There&#39;s plenty of companies out there that could make me a good profit but aren&#39;t screwing over someone else / the planet to do it. </p>\n\n<p>Maybe this is something that&#39;s come with age as well, I&#39;m 47 now and previously I wouldn&#39;t have considered such things. The thing is...I&#39;d like to think of myself as a &#39;good&#39; person, I give to charity each month, I try to consider other people&#39;s feelings or think about their perspective, I don&#39;t give unrequested advice, etc. but how would I reconcile that with investing in companies whose stock and trade is producing items that kill people or contributing to climate change. More precisely, can my general ethical principles be discarded for a quick profit? </p>\n\n<p>Anyway - this isn&#39;t supposed to be an admonishment or even a call to arms - I&#39;d just thought I&#39;d raise the case for ethics playing a role in our investment decisions. </p>\n\n<p>Disclosure: I&#39;m a University lecturer whose research is in sustainable behaviours.</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/investing/comments/m1sv8f/personal_ethics_investing/",
  "subreddit": "investing",
  "id": "m1sv8f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542575837
}