{
  "author": "sylsau",
  "original_created_utc": 1639745189,
  "title": "What cryptocurrency has disappointed you the most since you've been in the crypto world?",
  "created_utc": 1639755139,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Almost thirteen years after the official launch of the Bitcoin network, the digital currency invented by Satoshi Nakamoto remains the undisputed leader of the crypto world. The compass that gives direction to the market as a whole.&lt;/p&gt;\n\n&lt;p&gt;Since you&amp;#39;ve entered the crypto world, you&amp;#39;ve probably become interested in other cryptocurrency projects.&lt;/p&gt;\n\n&lt;p&gt;With each project proclaiming loudly that it will revolutionize the industry by eventually surpassing Bitcoin (or Ethereum), you must have had high hopes for some cryptocurrencies. Those hopes may still be there, or they may have faded away, caught up with reality.&lt;/p&gt;\n\n&lt;p&gt;My question is more about those cryptocurrency projects that you believed in so much, and that have totally disappointed you in the end. Do not hesitate to tell me what justifies this disappointment. These can of course not be final, you never know.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 191,
  "permalink": "/r/CryptoCurrency/comments/rigp1i/what_cryptocurrency_has_disappointed_you_the_most/",
  "subreddit": "CryptoCurrency",
  "id": "rigp1i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Almost thirteen years after the official launch of the Bitcoin network, the\ndigital currency invented by Satoshi Nakamoto remains the undisputed leader of\nthe crypto world. The compass that gives direction to the market as a whole.\n\nSince you've entered the crypto world, you've probably become…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコインネットワークの正式な立ち上げから約13年が経過し\nサトシ・ナカモトが発明したデジタル通貨は、今もなお、世界のリーダーとして君臨しています。\n暗号の世界 市場全体に方向性を与える羅針盤。\n\n暗号の世界に足を踏み入れたからには、おそらく...",
      "title": "暗号の世界に身を置いてから、最も失望した暗号通貨は何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在比特币网络正式启动近13年后，由中本聪发明的数字货币\n由中本聪发明的数字货币仍然是加密世界无可争议的领导者。\n的领导者。为整个市场指明方向的指南针。\n\n自从你进入加密货币世界，你可能已经成为...",
      "title": "自从你进入加密货币世界以来，哪种加密货币最让你失望？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在比特幣網絡正式啓動近13年後，由中本聰發明的數字貨幣\n由中本聰發明的數字貨幣仍然是加密世界無可爭議的領導者。\n的領導者。爲整個市場指明方向的指南針。\n\n自從你進入加密貨幣世界，你可能已經成爲...",
      "title": "自從你進入加密貨幣世界以來，哪種加密貨幣最讓你失望？"
    }
  ]
}