{
  "author": "cine_man",
  "original_created_utc": 1639791200,
  "title": "What do I do about my neighbor who keeps passing out with the stove on?",
  "created_utc": 1639821170,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So twice today my neighbors smoke alarm has gone off, causing me to knock on the door and eventually just enter because she doesn&amp;#39;t lock her door. Both times she has been passed out on her bed or couch, all of her stove burners on, clearly breathing but messed up enough to not be woken by a very loud smoke alarm and a stranger in her apartment calling out to her from a few feet away. &lt;/p&gt;\n\n&lt;p&gt;This is a weird apartment complex where I don&amp;#39;t know the landlord and only put in work orders on a web form, which basically is just sent to the most incompetent repairmen I have ever met, so I don&amp;#39;t know how helpful that would be. I&amp;#39;m worried for my cat I don&amp;#39;t want to leave her home alone anymore for fear of this neighbor staring a serious fire. &lt;/p&gt;\n\n&lt;p&gt;Any ideas of what I could do about this?&lt;/p&gt;\n\n&lt;p&gt;Edit: just called emergency services and a wellness check is going to be performed shortly. Thanks for all the responses&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/NoStupidQuestions/comments/riw68a/what_do_i_do_about_my_neighbor_who_keeps_passing/",
  "subreddit": "NoStupidQuestions",
  "id": "riw68a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So twice today my neighbors smoke alarm has gone off, causing me to knock on the\ndoor and eventually just enter because she doesn't lock her door. Both times she\nhas been passed out on her bed or couch, all of her stove burners on, clearly\nbreathing but messed up enough to not be woken by a very…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日2回、隣の家の煙探知機が鳴ったので、ノックしてしまいました。\nというのも、彼女はドアに鍵をかけないので、結局そのまま中に入ってしまいました。2回とも彼女は\nベッドかソファの上で気絶しており、ストーブの火は全てついていて、明らかに\n呼吸はしているが、とてもじゃないが起こせないほどぐちゃぐちゃになっている。",
      "title": "ストーブをつけたまま気絶している隣人をどうしたらいいのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今天，我的邻居的烟雾警报器响了两次，导致我敲门，并最终进入，因为她没有锁门。\n因为她没有锁门，所以我就进去了。两次都是她\n都是昏倒在床上或沙发上，她的所有炉子都开着，显然有呼吸，但很混乱。\n她显然还有呼吸，但已经乱成一团，不会被一个非常大的烟雾警报器吵醒。",
      "title": "我的邻居一直开着炉子昏倒，我该怎么处理？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天，我的鄰居的煙霧警報器響了兩次，導致我敲門，並最終進入，因爲她沒有鎖門。\n因爲她沒有鎖門，所以我就進去了。兩次都是她\n都是昏倒在牀上或沙發上，她的所有爐子都開着，顯然有呼吸，但很混亂。\n她顯然還有呼吸，但已經亂成一團，不會被一個非常大的煙霧警報器吵醒。",
      "title": "我的鄰居一直開着爐子昏倒，我該怎麼處理？"
    }
  ]
}