{
  "author": "good-as-hellx",
  "the_new_excerpt": "We recently became 2 million in here and with the latest news and adoptions and\nprojects around, I expect a lot more to come.\n\nSome here have a lot of knowledge, some have lessser. I think it's our duty to\nhelp the ones who have none at all and are willing to learn.\n\nSo, without further…",
  "original_created_utc": 1617451131,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我们最近成为200万在这里，并与最新的新闻和收养和\n左右的项目，我期望有更多的项目。\n\n这里有些人有很多知识，有些人有更多的知识。我觉得我们有责任\n帮助那些一无所有又愿意学习的人。\n\n所以，不再赘述...",
      "title": "CryptoCurrency初学者维基"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們最近成爲200萬在這裏，並與最新的新聞和收養和\n左右的項目，我期望有更多的項目。\n\n這裏有些人有很多知識，有些人有更多的知識。我覺得我們有責任\n幫助那些一無所有又願意學習的人。\n\n所以，不再贅述...",
      "title": "CryptoCurrency初學者維基"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "先日、ここで200万人になりましたが、最新のニュースや採用情報、プロジェクトがあちこちにあるので\nプロジェクトがあるので、もっともっと増えていくと思います。\n\nここにはたくさんの知識を持っている人もいれば、そうでない人もいます。何も知らない人を助けるのは私たちの義務だと思います。\n私たちの義務は、全く知識のない人を助けることだと思います。\n\nでは、早速ですが...。",
      "title": "CryptoCurrency Beginners Wiki"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "先日、ここで200万人になりましたが、最新のニュースや採用情報、プロジェクトがあちこちにあるので\nプロジェクトがあるので、もっともっと増えていくと思います。\n\nここにはたくさんの知識を持っている人もいれば、そうでない人もいます。何も知らない人を助けるのは私たちの義務だと思います。\n私たちの義務は、全く知識のない人を助けることだと思います。\n\nでは、早速ですが...。",
      "title": "CryptoCurrency Beginners Wiki"
    }
  ],
  "title": "CryptoCurrency Beginners Wiki",
  "created_utc": 1617463834,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We recently became 2 million in here and with the latest news and adoptions and projects around, I expect a lot more to come. </p>\n\n<p>Some here have a lot of knowledge, some have lessser. I think it&#39;s our duty to help the ones who have none at all and are willing to learn. </p>\n\n<p>So, without further ado, </p>\n\n<p>&nbsp;</p>\n\n<h1>What is crypto?</h1>\n\n<p>Cryptocurrency is a digital payment system that doesn&#39;t rely on banks to verify transactions. It&#39;s a peer-to-peer system that can enable anyone anywhere to send and receive payments. Instead of being physical money that is carried around and exchanged in the real world, cryptocurrency payments exist purely as digital entries to an online database that describe specific transactions. When you transfer cryptocurrency funds, the transactions are recorded in a public ledger. You store your cryptocurrency in a digital wallet.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<h1>What is the Blockchain?</h1>\n\n<p>Cryptocurrencies work using a technology called blockchain. Blockchain is a decentralized technology spread across many computers that manages and records transactions. Part of the appeal of this technology is its security. </p>\n\n<p>A blockchain is essentially a digital ledger of transactions that is duplicated and distributed across the entire network of computer systems on the blockchain. Each block in the chain contains a number of transactions, and every time a new transaction occurs on the blockchain, a record of that transaction is added to every participant’s ledger. The decentralised database managed by multiple participants is known as Distributed Ledger Technology (DLT).</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<h1>How to trade Crypto</h1>\n\n<p>&#x200B;</p>\n\n<p><strong>1. Make an account on a crypto exchange.</strong></p>\n\n<p>To choose the best exchange for your needs, it is important to fully understand the types of exchanges. There are two types of exchanges:</p>\n\n<p><strong>Centralized Exchange</strong></p>\n\n<p>The first and most common type of exchange is the centralized exchange. Popular exchanges that fall into this category are Coinbase, Binance, Kraken, and Gemini. These exchanges are private companies that offer platforms to trade cryptocurrency. These exchanges require registration and identification, also known as the Know Your Customer or Know Your Client(KYC) rule.</p>\n\n<p>centralized exchanges are not in line with the philosophy of Bitcoin. They run on their own private servers which creates a vector of attack. If the servers of the company were to be compromised, the whole system could be shut down for some time. Worse, sensitive data about its users could be released. </p>\n\n<p>The larger, more popular centralized exchanges are by far the easiest on-ramp for new users and they even provide some level of insurance should their systems fail. While this is true, when cryptocurrency is purchased on these exchanges it is stored within their custodial wallets and not in your own wallet that you own the keys to. The insurance that is provided is only applicable if the exchange is at fault. Should your computer and your Coinbase account, for example, become compromised, your funds would be lost and you would not likely have the ability to claim insurance. This is why it is important to withdraw any large sums and practice safe storage.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Decentralized Exchange</strong></p>\n\n<p>Decentralized exchanges work in the same manner that Bitcoin does. A decentralized exchange has no central point of control. Instead, think of it as a server, except that each computer within the server is spread out across the world and each computer that makes up one part of that server is controlled by an individual. If one of these computers turns off, it has no effect on the network as a whole because there are plenty of other computers that will continue running the network.</p>\n\n<p>This is drastically different from one company controlling a server in a single location. Attacking something that is spread out and decentralized in this manner is significantly more difficult, making any such attacks unrealistic and likely unsuccessful. </p>\n\n<p>Due to this decentralization, these types of exchanges cannot be subject to the rules of any regulatory body, as there is no specific person or group running the system. The individuals who participate come and go, so there is no one individual or group that a government or regulatory body can realistically pursue. This means that those trading on the platform do not have to declare their identification and are free to use the platform in any manner they choose, whether legal or not.</p>\n\n<p>&#x200B;</p>\n\n<p>Best crypto exchanges as of 2021 <sup>(according to investopedia</sup>)</p>\n\n<ul>\n<li>Best overall: Coinbase &amp; Coinbase Pro</li>\n<li>Best for Altcoins: Binance</li>\n<li>Best for Decentralised Exchange:  Bisq</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p><strong>2. Pick a crypto to invest in</strong></p>\n\n<p>How? Easy, one might say - just Do Your Own Research(<strong>DYOR</strong>), because no one here is a financial advisor!</p>\n\n<p>&#x200B;</p>\n\n<p>Things to look at when researching: </p>\n\n<ul>\n<li>The Community</li>\n<li>Fundamental Analysis</li>\n<li>The Team</li>\n<li>The Technology</li>\n<li>The White Paper</li>\n<li>Their Vision</li>\n<li>Their Leadership</li>\n<li>Pricing History</li>\n<li>Credibility &amp; Reputation</li>\n<li>Roadmap</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p><strong>3. Choose a strategy</strong></p>\n\n<p>A. Buy and hold(<strong>HODL</strong>)</p>\n\n<p>“Buy and hold” is a passive investment strategy where traders buy an asset intending to hold it for a long time, regardless of market fluctuations.</p>\n\n<p>This strategy is typically used in long-term investment portfolios, where the idea is simply to get in the market without any regard for timing. The idea behind this strategy is that on a long enough time frame, the timing or entry price won’t matter much.</p>\n\n<p>&#x200B;</p>\n\n<p>B. Dollar Cost Averaging(<strong>DCA</strong>)</p>\n\n<p>Dollar cost averaging is a popular and well-tested trading strategy that works best when done over longer periods of time. The concept is simple. Instead of investing all your money in a particular cryptocurrency at once you divide it into small amounts, choose a particular time and day of the week and only buy at those times.</p>\n\n<p><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/llsxv7/dca_what_is_dollar_cost_averaging_why_you_should/\">DivineEu - What is DollarCostAveraging?</a></p>\n\n<p>&#x200B;</p>\n\n<p>C. Day trading</p>\n\n<p>Day trading might be the most well-known active trading strategy. It’s a common misconception to think that all active traders are by definition day traders, but that isn’t true.</p>\n\n<p>Day trading involves entering and exiting positions on the same day. As such, day traders aim to capitalize on intraday price movements, i.e., price moves that happen within one trading day.</p>\n\n<p>&#x200B;</p>\n\n<p>D. Swing trading</p>\n\n<p>Swing trading is a type of longer-term trading strategy that involves holding positions for longer than a day but typically not longer than a few weeks or a month. In some ways, swing trading sits in the middle between day trading and trend trading.</p>\n\n<p>Swing traders generally try to take advantage of waves of volatility that take several days or weeks to play out. Swing traders may use a combination of technical and fundamental factors to formulate their trade ideas. Naturally, fundamental changes may take a longer time to play out, and this is where fundamental analysis comes into play. Even so, chart patterns and technical indicators can also play a major part in a swing trading strategy.</p>\n\n<p>&#x200B;</p>\n\n<p>E. Trend trading</p>\n\n<p>Sometimes also referred to as position trading, trend trading is a strategy that involves holding positions for a longer period of time, typically at least a few months. As the name would suggest, trend traders try to take advantage of directional trends. Trend traders may enter a long position in an uptrend and a short position in a downtrend.</p>\n\n<p>Trend traders will typically use fundamental analysis, but this may not always be the case. Even so, fundamental analysis considers events that may take a long time to play out – and these are the moves that trend traders try to take advantage of.</p>\n\n<p>&#x200B;</p>\n\n<p>F. Scalping</p>\n\n<p>Scalping is one of the quickest trading strategies out there. Scalpers don’t try to take advantage of big moves or drawn-out trends. It’s a strategy that focuses on exploiting small moves over and over again. For example, profiting off of bid-ask spreads, gaps in liquidity, or other inefficiencies in the market. </p>\n\n<p>Scalpers don’t aim to hold their positions for a long time. It’s quite common to see scalp traders opening and closing positions in a matter of seconds. This is why scalping is often related to High-Frequency Trading (HFT).</p>\n\n<p>&#x200B;</p>\n\n<p>G. YOLO</p>\n\n<p>This one is self-explanatory. </p>\n\n<p>&#x200B;</p>\n\n<p><strong>4. Store your cryptocurrency</strong></p>\n\n<p>The main purpose of the creation of Bitcoin as a decentralized currency was to give the masses the power to control and manage their own money.</p>\n\n<p>First off, digital wallets are quite different as compared to your physical wallet. Instead of storing money, digital wallets store private and public keys.</p>\n\n<p>Private keys are like your PIN number to access your bank account, while public keys are similar to your bank account number. When you send Bitcoin, you’re sending VALUE in the form of a transaction, transferring the ownership of your coin to the recipient.</p>\n\n<p>Ownership of your private keys gives you total control over the funds associated with your corresponding public keys. That’s why it is vital to make sure you keep your private keys secretly hidden so that ONLY YOU know your private keys.</p>\n\n<p>If any other person gets hold of your private keys, they will have control over your coins. It is also equally important to have a back-up of your private keys, so as to protect yourself from accidental loss.</p>\n\n<p>You&#39;d also lose your funds if you cannot recover your lost private keys.</p>\n\n<p><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/lkkm0v/a_beginners_guide_to_cryptocurrency_wallets/\">Weaver96&#39;s wallet guide</a> | <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/ld42yc/cryptowallets_which_one_should_you_use/\">good-as-hellx&#39;s wallet guide</a></p>\n\n<p>&#x200B;</p>\n\n<h1>Crypto Apps</h1>\n\n<p>Given the fact that we are facing an influx of fake applications meant to stole people&#39;s private keys/personal info and what not, I felt the need to add this too:</p>\n\n<p>&#x200B;</p>\n\n<p><em>adding after mods review</em></p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<h1>Scams</h1>\n\n<p><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/m9maxp/all_the_hacksscams_and_stuff_you_should_be_aware/\">UrMuMGaEe - All the hacks, scams and stuff you should be aware off!</a></p>\n\n<p>&#x200B;</p>\n\n<p>⚠️ Active scams:</p>\n\n<ul>\n<li><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/l9no5k/warning_pump_and_dump_scams_going_around_read/\">Pump and dumps</a></li>\n<li><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/mdm66w/scammers_are_active_on_reddit_do_not_fall_for_the/\">Coinbase Airdrop Scam</a></li>\n<li><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/m9n8kn/beware_elon_musk_bitcoin_giveaway_scam_costs_this/\">Elon Musk Twitter Bitcoin Giveaway</a></li>\n<li><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/lx6zgs/beware_of_crypto_scam_beware_yellow_star/\">Yellow Star Investment / Richert Funding</a></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<h1>Earn</h1>\n\n<p><strong>Aidrops</strong></p>\n\n<p>Who doesn&#39;t like airdrops? An airdrop, in the cryptocurrency business, is a marketing stunt that involves sending coins or tokens to wallet addresses in order to promote awareness of a new virtual currency. Small amounts of the new virtual currency are sent to the wallets of active members of the blockchain community for free or in return for a small service, such as retweeting a post sent by the company issuing the currency.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Faucets</strong></p>\n\n<p>A crypto faucet is an app or a website that distributes small amounts of cryptocurrencies as a reward for completing easy tasks. They’re given the name “faucets&#39;&#39; because the rewards are small, just like small drops of water dripping from a leaky faucet.</p>\n\n<p><a href=\"https://nano-faucet.org\">Try Nano faucet</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://www.coinbase.com/earn\"><strong>Coinbase Earn</strong></a></p>\n\n<ul>\n<li>Watch videos - We&#39;ve created educational videos to teach you about different cryptocurrencies.</li>\n<li>Complete a quiz - After each video you&#39;ll receive a simple quiz testing what you&#39;ve learned.</li>\n<li>Earn - You&#39;ll receive crypto in your Coinbase wallet for every quiz you complete.</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p><strong>Staking</strong></p>\n\n<p>Staking is the process of actively participating in transaction validation (similar to mining) on a proof-of-stake (PoS) blockchain. On these blockchains, anyone with a minimum-required balance of a specific cryptocurrency can validate transactions and earn Staking rewards.</p>\n\n<p><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/lwun4f/ultimate_staking_guide_2021_overview_of_best/\">icysx - Ultimate Staking Guide 2021</a></p>\n\n<p>&#x200B;</p>\n\n<p><strong>On-Chain Governance</strong></p>\n\n<p>On-chain governance is a system for managing and implementing changes to cryptocurrency blockchains. In this type of governance, rules for instituting changes are encoded into the blockchain protocol. Developers propose changes through code updates and each node votes on whether to accept or reject the proposed change.</p>\n\n<p>Stakeholders in the process are provided economic incentives to participate. For example, each node can earn a cut of overall transaction fees for voting, while developers are rewarded through alternate funding mechanisms.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<h1>Great topics</h1>\n\n<ul>\n<li><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/lsb7jf/crypto_lingo_guide/\">Gagbra - CryptoTerms Guide</a></li>\n<li><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/lkwz2r/a_beginners_guide_to_market_cap_volume_supply/\">Alliswell119 - A Beginner&#39;s Guide to Market Cap, Volume &amp; Supply</a></li>\n<li><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/lolbo6/a_beginners_guide_to_limit_orders_stop_orders_and/\">A beginner&#39;s guide to limit orders, stop orders and stop limit orders</a></li>\n<li><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/m6k33z/how_to_survive_the_next_bear_market/\">Meme_Pope - Surviving in a Bear Market</a></li>\n<li><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/m7pd7j/a_list_of_43_countrys_and_their_cryptocurrency/\">steavus - Country regulations</a></li>\n<li><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/m20cyd/a_complete_list_of_all_the_basic_useful/\">GroundbreakingLack78 - A complete List of All The Basic Useful Essentials About CryptoCurrency</a></li>\n<li><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/mcuuu0/happy_moon_distribution_day_here_are_all_my_4/\">DivineEu - Everything you need to know about MOONS</a></li>\n<li><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/mctn4r/defi_explained_what_is_defi/\">Fantastic-Cucumber-1 - What is DeFI</a></li>\n<li><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/mdjsrj/defi_explained_defi_wallets/\">Fantastic-Cucumber-1 - DeFI Wallets</a></li>\n<li><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/mexb51/defi_explained_nfts/\">Fantastic-Cucumber-1 - NFT</a></li>\n<li><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/me9p7h/defi_explained_smart_contracts/\">Fantastic-Cucumber-1 - Smart contracts</a></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>My main goal was to resume everything in one post while providing a neutral point of view, to make it easier for new people. Thanks to everyone who contributed to this post and this community.</p>\n\n<p>&#x200B;</p>\n\n<p>For any suggestions and questions related to this post feel free to DM me anytime.</p>\n\n<p>&#x200B;</p>\n\n<p><em>I intend to update this post in the future based on feedback and further research</em>.</p>\n</div><!-- SC_ON -->",
  "score": 712,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/YWP0wTA2uvidgaJ3cKJDIsg7aunE3AINCqgn3T-j1fo.jpg?auto=webp&s=67248ebcc8720b270d9d0b39e880c8aa6edb6686",
          "width": 2397,
          "height": 2561
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/YWP0wTA2uvidgaJ3cKJDIsg7aunE3AINCqgn3T-j1fo.jpg?width=108&crop=smart&auto=webp&s=ea4924488b71dc5001d891b965a58f9a0537a2a6",
            "width": 108,
            "height": 115
          },
          {
            "url": "https://external-preview.redd.it/YWP0wTA2uvidgaJ3cKJDIsg7aunE3AINCqgn3T-j1fo.jpg?width=216&crop=smart&auto=webp&s=3d89160fe9653efaf330e9d38f681a34ba2d558e",
            "width": 216,
            "height": 230
          },
          {
            "url": "https://external-preview.redd.it/YWP0wTA2uvidgaJ3cKJDIsg7aunE3AINCqgn3T-j1fo.jpg?width=320&crop=smart&auto=webp&s=a65743da044b5620396125b0625567a72d4f0043",
            "width": 320,
            "height": 341
          },
          {
            "url": "https://external-preview.redd.it/YWP0wTA2uvidgaJ3cKJDIsg7aunE3AINCqgn3T-j1fo.jpg?width=640&crop=smart&auto=webp&s=c0bf50a1de85ff0d08018aea8aaa653b4e501edf",
            "width": 640,
            "height": 683
          },
          {
            "url": "https://external-preview.redd.it/YWP0wTA2uvidgaJ3cKJDIsg7aunE3AINCqgn3T-j1fo.jpg?width=960&crop=smart&auto=webp&s=80e74c01da387f6968a89d715b1495d297eb0674",
            "width": 960,
            "height": 1025
          },
          {
            "url": "https://external-preview.redd.it/YWP0wTA2uvidgaJ3cKJDIsg7aunE3AINCqgn3T-j1fo.jpg?width=1080&crop=smart&auto=webp&s=856172a32365f37bec0474a6539e0a1433f6ef53",
            "width": 1080,
            "height": 1153
          }
        ],
        "variants": {},
        "id": "mhHCcv6sFpzKV432G_wGlhk0ev1AXH1GBmocbmm4bto"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/mj74o8/cryptocurrency_beginners_wiki/",
  "subreddit": "CryptoCurrency",
  "id": "mj74o8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961875623
}