{
  "author": "throwra_passinggirl",
  "original_created_utc": 1628198236,
  "title": "If I was threatened with my partner’s suicide is it rape?",
  "created_utc": 1628224485,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A recent popular post on this subreddit got me thinking about my own experience and how I can/should categorize it.</p>\n\n<p>Years ago in high school, I was in a relationship where I often felt coerced into sex. It started out alright but about a year in, he started talking about how he was depressed and suicidal and how I was the only thing keeping him from killing himself. Then this transitioned to him saying that when we didn’t have sex often enough he felt like I didn’t care about him keeping himself alive and as soon as I stopped sleeping with him he would kill himself. He would force me to leave school in the middle of the day to sleep with him and when we went days without doing this he would say how he’d started planning his death again. When I tried to tell school administrators about this he told me that he would just lied to them and that if I told anyone again he’d go through with it. When I tried to leave the relationship at one point he texted me for hours saying how he was going to go through with it unless I came back to him. </p>\n\n<p>There was one instance that I’m fairly certain was assault where I woke up in the middle of the night to him trying to have sex with me even though I was asleep. </p>\n\n<p>Eventually I got out of the relationship. He did attempt suicide at our senior trip but wasn’t successful. He’s still alive as far as I know. </p>\n\n<p>I have been to years of therapy since and am now in a healthy, happy relationship where my boundaries are respected.</p>\n\n<p>I’ve been saying that this was an emotionally and/or sexually abusive since then but haven’t referred to it as rape or sexual assault and was wondering it it would be classified as that.</p>\n</div><!-- SC_ON -->",
  "score": 116,
  "permalink": "/r/TooAfraidToAsk/comments/oys280/if_i_was_threatened_with_my_partners_suicide_is/",
  "subreddit": "TooAfraidToAsk",
  "id": "oys280",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "A recent popular post on this subreddit got me thinking about my own experience\nand how I can/should categorize it.\n\nYears ago in high school, I was in a relationship where I often felt coerced\ninto sex. It started out alright but about a year in, he started talking about\nhow he was depressed and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブレディットの最近の人気記事を見て、自分の経験について考えてみました。\nそして、それをどのように分類すべきかを考えました。\n\n何年も前の高校生の頃、私はよくセックスを強要されていると感じる関係にありました。\nセックスを強要されていると感じていました。最初はうまくいっていたのですが、1年ほど経った頃、彼が以下のことを話し始めました。\n落ち込んでいて...。",
      "title": "パートナーの自殺を脅迫された場合、それはレイプですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近在这个分论坛上的一个热门帖子让我想到了自己的经历\n以及我可以/应该如何对其进行分类。\n\n几年前，在高中时，我处于一种关系中，我经常感到被胁迫\n性。一开始还好，但大约一年后，他开始谈论\n他说他很沮丧，而且...",
      "title": "如果我被威胁要杀死我的伴侣，这算不算强奸？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近在這個分論壇上的一個熱門帖子讓我想到了自己的經歷\n以及我可以/應該如何對其進行分類。\n\n幾年前，在高中時，我處於一種關係中，我經常感到被脅迫\n性。一開始還好，但大約一年後，他開始談論\n他說他很沮喪，而且...",
      "title": "如果我被威脅要殺死我的伴侶，這算不算強姦？"
    }
  ]
}