{
  "author": "No_Weather682",
  "original_created_utc": 1639404062,
  "title": "Would you still come back to this sub if you made life-changing money?",
  "created_utc": 1639427547,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I know that there’s plenty of people in this sub that only care about making money, which is fine, but would you still come back to this sub if you made life-changing money? And would you still check crypto news or would you cash out and leave the crypto space?&lt;/p&gt;\n\n&lt;p&gt;Personally, I guess I would reduce the time I spend on this sub, crypto new or watching the charts. Even thought I don’t plan to ever leave the crypto space, I would deffinently take a break from social media and crypto in general the first weeks or maybe even months. I admit that I do spend too much time (even if it&amp;#39;s worth it) thinking about crypto and checking the news/charts. So taking a &amp;quot;long&amp;quot; break would be great, especially for my mental health. Moreover, I do think that even when you make life changing money, you still want to make more. Would that be the cause to return 24/7 top the crypto space? Or would it be the perfect occasion to achieves new goals outside of the crypto field? What do you think?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 161,
  "permalink": "/r/CryptoCurrency/comments/rfgd7b/would_you_still_come_back_to_this_sub_if_you_made/",
  "subreddit": "CryptoCurrency",
  "id": "rfgd7b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I know that there’s plenty of people in this sub that only care about making\nmoney, which is fine, but would you still come back to this sub if you made\nlife-changing money? And would you still check crypto news or would you cash out\nand leave the crypto space?\n\nPersonally, I guess I would reduce…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブには、儲けることしか考えていない人がたくさんいることは知っています。\nしかし、もしあなたがお金を稼いだとしても、このサブに戻ってきてくれますか？\n人生を変えるようなお金を そして、あなたはまだ暗号のニュースをチェックしますか、それともキャッシュアウトしますか？\n暗号空間から離れるのでしょうか？\n\n個人的には、減らすかな...。",
      "title": "人生を変えるほどの大金を手にしても、このサブに戻ってきてくれますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道，在这个子里有很多人只关心如何使\n赚钱，这很好，但如果你赚到了改变生活的钱，你还会回到这个地方来吗？\n改变生活的钱？你还会查看加密货币新闻吗？\n并离开加密货币领域？\n\n就个人而言，我想我会减少...",
      "title": "如果你赚到了改变生活的钱，你还会回来这个子吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道，在這個子裏有很多人只關心如何使\n賺錢，這很好，但如果你賺到了改變生活的錢，你還會回到這個地方來嗎？\n改變生活的錢？你還會查看加密貨幣新聞嗎？\n並離開加密貨幣領域？\n\n就個人而言，我想我會減少...",
      "title": "如果你賺到了改變生活的錢，你還會回來這個子嗎？"
    }
  ]
}