{
  "author": "otocratial",
  "original_created_utc": 1641209796,
  "title": "I know I still got a long way to go, but i finally have 0.1BTC",
  "created_utc": 1641229119,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’ve been striving for almost a year now to achieve something, and finally I was able to stack 0.1BTC. I know it’s still small and I still have to grind more to reach 1BTC, but I feel so giddy realizing that I have this. I want to continue doing this so that I can buy a house and hopefully become financially stable as soon as I could.&lt;/p&gt;\n\n&lt;p&gt;It’s still a long way to go, but seeing the decimal place move as I keep on stacking makes me feel excited and motivated at the same time. Sometimes it really pays to be frugal.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 452,
  "permalink": "/r/Bitcoin/comments/ruzrj1/i_know_i_still_got_a_long_way_to_go_but_i_finally/",
  "subreddit": "Bitcoin",
  "id": "ruzrj1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’ve been striving for almost a year now to achieve something, and finally I was\nable to stack 0.1BTC. I know it’s still small and I still have to grind more to\nreach 1BTC, but I feel so giddy realizing that I have this. I want to continue\ndoing this so that I can buy a house and hopefully become…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もう1年近く、何かを達成しようと努力してきましたが、ようやく\n0.1BTCを積み上げることができた。まだ小さいし、もっと削らないといけないのは分かっています。\nでも、これを手に入れたら、めまいがしそうです。これからも\n家を買って、できれば...。",
      "title": "まだまだ先は長いけど、やっと0.1BTCになったよ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我已经努力了将近一年，想要取得一些成就，最后我是\n能够堆积0.1BTC。我知道这仍然很小，我仍然需要更多的磨练才能达到\n达到1BTC，但我意识到自己拥有这个，感觉很兴奋。我想继续\n这样我就可以买房子，并希望能成为...",
      "title": "我知道我还有很长的路要走，但我终于有了0.1BTC。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我已經努力了將近一年，想要取得一些成就，最後我是\n能夠堆積0.1BTC。我知道這仍然很小，我仍然需要更多的磨練才能達到\n達到1BTC，但我意識到自己擁有這個，感覺很興奮。我想繼續\n這樣我就可以買房子，並希望能成爲...",
      "title": "我知道我還有很長的路要走，但我終於有了0.1BTC。"
    }
  ]
}