{
  "author": "mic_droo",
  "original_created_utc": 1640251741,
  "title": "Most of you are probably buying crypto to have a better life later - but don't forget to enjoy life and spend money on stuff that you enjoy once in a while!",
  "created_utc": 1640277575,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I just saw another one of those threads that get posted on here regularly, something like &amp;quot;what can you cut back on to buy even more crypto??&amp;quot; As always, there are a few suggestions that makes sense (&amp;quot;don&amp;#39;t play the lottery&amp;quot; - I mean, sure, crypto is the better gamble), but, predictably, most are stuff like:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;don&amp;#39;t eat out&lt;/li&gt;\n&lt;li&gt;don&amp;#39;t buy clothes you enjoy&lt;/li&gt;\n&lt;li&gt;stuff like Netflix? don&amp;#39;t need that, doesn&amp;#39;t make you a profit&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;etc etc - and come on guys, really? The general sentiment in these threads always is &amp;quot;sacrifices now will be worth it&amp;quot;. And I think that&amp;#39;s a really bad attitude, for at least two reasons:&lt;/p&gt;\n\n&lt;p&gt;First, maybe it won&amp;#39;t work out. There are no guarantees, maybe we&amp;#39;re all way too late and 2 months ago was the all time peak for crypto and it&amp;#39;s all downhill from here. Do I think so? Nah. Is it possible? 100%! So even if you make huge sacrifices now, you might end up broke.&lt;/p&gt;\n\n&lt;p&gt;Second, it just doesn&amp;#39;t make sense to now live badly now to be well off at some point in the future. Maybe you&amp;#39;ll die in a car crash in 5 years, maybe your health goes downhill and you can&amp;#39;t enjoy life as you could do now. Maybe you will be super rich and can quit your job - and then you&amp;#39;ll be bored because you gave up on all of your hobbies and don&amp;#39;t know what to do with your time, except try to earn even more money.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not saying you shouldn&amp;#39;t invest in crypto, I&amp;#39;m not saying you should spend huge amounts of money on useless garbage either. I&amp;#39;m just saying that you shouldn&amp;#39;t use all your free time and all your disposable money (not even all that you could theoretically afford to lose) on crypto in the hope to one day live nicely, if you have to live miserably and cannot spend money on fun stuff now. Find a balance that works for you, but don&amp;#39;t forget that life can be fun and that just living for the future is not a great idea&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 156,
  "permalink": "/r/CryptoCurrency/comments/rmryle/most_of_you_are_probably_buying_crypto_to_have_a/",
  "subreddit": "CryptoCurrency",
  "id": "rmryle",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I just saw another one of those threads that get posted on here regularly,\nsomething like \"what can you cut back on to buy even more crypto??\" As always,\nthere are a few suggestions that makes sense (\"don't play the lottery\" - I mean,\nsure, crypto is the better gamble), but, predictably, most are…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここに定期的に貼られるスレをまた見たんだが。\n\"暗号を買うために何を削れるか？\" みたいなね いつものように。\n理にかなった提案もいくつかあります（「宝くじはやめとけ」。\nしかし、予想通り、そのほとんどは...。",
      "title": "皆さんの多くは、後々より良い生活を送るために暗号を買っているのでしょう。でも、たまには人生を楽しみ、自分が楽しめることにお金を使うことも忘れないでくださいね。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我刚刚看到另一个经常被贴在这里的主题。\n诸如 \"你可以减少什么来购买更多的加密货币？\" 一如既往。\n有一些建议是有意义的（\"不要玩彩票\" - 我的意思是。\n当然，加密货币是更好的赌博），但是，可以预见的是，大多数...",
      "title": "你们中的大多数人可能是为了以后有更好的生活而购买加密货币--但别忘了享受生活，偶尔花钱买点自己喜欢的东西!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我剛剛看到另一個經常被貼在這裏的主題。\n諸如 \"你可以減少什麼來購買更多的加密貨幣？\" 一如既往。\n有一些建議是有意義的（\"不要玩彩票\" - 我的意思是。\n當然，加密貨幣是更好的賭博），但是，可以預見的是，大多數...",
      "title": "你們中的大多數人可能是爲了以後有更好的生活而購買加密貨幣--但別忘了享受生活，偶爾花錢買點自己喜歡的東西!"
    }
  ]
}