{
  "author": "dwniell",
  "original_created_utc": 1626047503,
  "title": "People in places like the U.S or E.U have a huge advantage. Take it.",
  "created_utc": 1626108082,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It just hit me while I was in the shower, I currently live in the U.S but was born in a third world country. \nLiving in a country like this one allows me to invest every week what my dad makes in a whole month. And I only put in an amount that I’m willing to lose. Crazy. \nHell, even by just putting $20 a week you’re probably investing way more than the average person in other parts of the world. \nIf you’re privileged, or lucky, enough to live in one of these countries take advantage of this golden opportunity!!</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/CryptoCurrency/comments/oifl5s/people_in_places_like_the_us_or_eu_have_a_huge/",
  "subreddit": "CryptoCurrency",
  "id": "oifl5s",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It just hit me while I was in the shower, I currently live in the U.S but was\nborn in a third world country. Living in a country like this one allows me to\ninvest every week what my dad makes in a whole month. And I only put in an\namount that I’m willing to lose. Crazy. Hell, even by just putting…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "シャワーを浴びているときにふと思ったのですが、私は現在アメリカに住んでいますが、第三国で生まれました。\n第三世界の国で生まれました。このような国に住んでいるからこそ、私は毎週のように、自分の大学の授業料を投資することができるのです。\n父が1ヶ月に稼ぐ金額を毎週投資することができます。そして、損をしてもいいと思える額しか投資しません。\n失ってもいいと思える額しか入れない。狂っている。ただ、それだけでは...。",
      "title": "アメリカやEUのような場所にいる人は、とても有利です。取ってください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在洗澡的时候突然想到，我现在住在美国，但却出生在第三世界国家。\n出生在一个第三世界国家。生活在这样一个国家，使我能够\n每周的投资相当于我父亲一个月的收入。而且我只投入一个\n我只投入我愿意失去的金额。疯了。见鬼，即使只是把...",
      "title": "像美国或欧盟这样的地方的人有一个巨大的优势。拿去吧。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在洗澡的時候突然想到，我現在住在美國，但卻出生在第三世界國家。\n出生在一個第三世界國家。生活在這樣一個國家，使我能夠\n每週的投資相當於我父親一個月的收入。而且我只投入一個\n我只投入我願意失去的金額。瘋了。見鬼，即使只是把...",
      "title": "像美國或歐盟這樣的地方的人有一個巨大的優勢。拿去吧。"
    }
  ]
}