{
  "author": "TooTarded4U",
  "original_created_utc": 1627743085,
  "title": "We've been through a lot in recent months. Friendly reminder to withdraw your Bitcoin from the exchanges",
  "created_utc": 1627786060,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There&#39;s been alot of ups-and-downs over the recent months, and you may have gotten comfortable with your Bitcoin sitting on exchanges, waiting for &quot;something&quot;.</p>\n\n<p>This is a friendly reminder to withdraw your stack back to your hardware wallet.</p>\n\n<p>Not your wallet, not your coins!</p>\n\n<p>You don&#39;t want to be caught with your pants down if an exchange is hacked, or if government passes legislation banning Bitcoin and locks you from accessing your stack.</p>\n\n<p>Play it safe, gents!</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/Bitcoin/comments/ov8ici/weve_been_through_a_lot_in_recent_months_friendly/",
  "subreddit": "Bitcoin",
  "id": "ov8ici",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "There's been alot of ups-and-downs over the recent months, and you may have\ngotten comfortable with your Bitcoin sitting on exchanges, waiting for\n\"something\".\n\nThis is a friendly reminder to withdraw your stack back to your hardware wallet.\n\nNot your wallet, not your coins!\n\nYou don't want to be…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここ数ヶ月の間に多くのアップダウンがあり、皆さんは\nビットコインを取引所に預け、次のステップを待つことに慣れる。\n「何か \"です。\n\nこれは、あなたのハードウェアウォレットにあなたのスタックを撤回するためのフレンドリーなリマインダーです。\n\nあなたのウォレットではなく、あなたのコインでもない!\n\nあなたはそうなりたくはないでしょう...",
      "title": "ここ数ヶ月、いろいろなことがありました。取引所からビットコインを引き出すための親切なリマインダー"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在最近几个月里，有很多起起落落，你可能已经\n你可能已经习惯于把你的比特币放在交易所里，等待着\n\"东西\"。\n\n这是一个友好的提醒，将你的堆栈撤回到你的硬件钱包。\n\n不是你的钱包，不是你的币!\n\n你不希望被...",
      "title": "近几个月来，我们经历了很多。友情提醒：从交易所提取你的比特币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在最近幾個月裏，有很多起起落落，你可能已經\n你可能已經習慣於把你的比特幣放在交易所裏，等待着\n\"東西\"。\n\n這是一個友好的提醒，將你的堆棧撤回到你的硬件錢包。\n\n不是你的錢包，不是你的幣!\n\n你不希望被...",
      "title": "近幾個月來，我們經歷了很多。友情提醒：從交易所提取你的比特幣"
    }
  ]
}