{
  "author": "Brinothedino",
  "original_created_utc": 1625409294,
  "title": "I don't even hold any XLM, but can we all just take a moment to appreciate how awesome it is for transferring between exchanges?",
  "created_utc": 1625417514,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Seriously, USDT wants like 9 bucks for a transfer? Lots of different coins take forever and have high transaction fees. Swapping to Stellar Lumens and then transfering between exchanges is insanely fast and costs something ridiculous like 0.0001 lumens.</p>\n\n<p>Maybe in time all coins will have low tx fees, but for now, XLM deserves a round of applause from all of us for saving our asses again and again. Especially in countries where the on-ramp for fiat to exchanges is a pain in the ass.</p>\n</div><!-- SC_ON -->",
  "score": 179,
  "permalink": "/r/CryptoCurrency/comments/odlnkz/i_dont_even_hold_any_xlm_but_can_we_all_just_take/",
  "subreddit": "CryptoCurrency",
  "id": "odlnkz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Seriously, USDT wants like 9 bucks for a transfer? Lots of different coins take\nforever and have high transaction fees. Swapping to Stellar Lumens and then\ntransfering between exchanges is insanely fast and costs something ridiculous\nlike 0.0001 lumens.\n\nMaybe in time all coins will have low tx…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "USDTは9ドルで送金してくれるってマジ？多くの異なるコインは\n時間がかかるし、取引手数料も高い。ステラルーメンに交換してから\nステラルーメンに交換して、取引所間で転送するのはめちゃくちゃ早いし、コストも馬鹿にならない。\n0.0001ルーメンとかね。\n\nそのうち、すべてのコインの取引手数料が低くなるかもしれませんね...。",
      "title": "私はXLMを一枚も持っていませんが、取引所間の移動のためのXLMの素晴らしさを、みんなで評価してみませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "说真的，USDT要9块钱的转帐？很多不同的硬币都需要\n漫长的时间，并且有很高的交易费用。换成恒星流明，然后再\n交易所之间的转账速度快得惊人，而且费用也高得离谱。\n如0.0001流明。\n\n也许到时候所有的币都会有低的交易费...",
      "title": "我甚至没有持有任何XLM，但我们能不能花点时间来欣赏一下它在交易所之间的转账有多棒？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "說真的，USDT要9塊錢的轉帳？很多不同的硬幣都需要\n漫長的時間，並且有很高的交易費用。換成恆星流明，然後再\n交易所之間的轉賬速度快得驚人，而且費用也高得離譜。\n如0.0001流明。\n\n也許到時候所有的幣都會有低的交易費...",
      "title": "我甚至沒有持有任何XLM，但我們能不能花點時間來欣賞一下它在交易所之間的轉賬有多棒？"
    }
  ]
}