{
  "author": "SeanVo",
  "the_new_excerpt": "The market has brought so much growth to many portfolios over the last 10+\nyears, it's been a wonderful ride. I've developed decent skills identifying\nsectors that are in favor, buying and holding low cost index funds and sector\nETF's focused on technology and innovation.\n\nLong-term charts of market…",
  "original_created_utc": 1613157957,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在过去的10多年里，市场给很多投资组合带来了巨大的增长。\n年，这是一个美妙的旅程。我已经练就了像样的识别技能\n板块的青睐，买入并持有低成本的指数基金和行业\nETF的关注科技创新。\n\n长期图表的市场...",
      "title": "准备有朝一日与熊（市场）抗衡。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在過去的10多年裏，市場給很多投資組合帶來了巨大的增長。\n年，這是一個美妙的旅程。我已經練就了像樣的識別技能\n板塊的青睞，買入並持有低成本的指數基金和行業\nETF的關注科技創新。\n\n長期圖表的市場...",
      "title": "準備有朝一日與熊（市場）抗衡。"
    }
  ],
  "title": "Preparing to fight a bear (market) someday",
  "created_utc": 1613195000,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The market has brought so much growth to many portfolios over the last 10+ years, it&#39;s been a wonderful ride. I&#39;ve developed decent skills identifying sectors that are in favor, buying and holding low cost index funds and sector ETF&#39;s focused on technology and innovation.</p>\n\n<p>Long-term charts of market performance show there are periods of decline. Sometimes weeks to months (Covid in February - March of 2020) and sometimes a number of years (August 2000 - March 2003). My portfolio was reduced quite a bit between 2000 and 2003. I held on, rode it down, and back up.</p>\n\n<p>Just like earthquakes, fires, and floods, it&#39;s good to think through a plan before the event comes. What&#39;s your plan to make it through a bear market?</p>\n\n<p>Some presumably wise investors like having some cash on the side to pickup bargains during downturns. Some did that during the Covid drop. There are others that would either short the overall market on the way down, or buy inverse ETF&#39;s (ProShares for example. <em>Side note</em>: holding leveraged inverse funds for a long period of time, even a few days, can lead to unpredictable results due to decay.) If you have a longer time horizon until retirement, riding it down and back up would likely be better than selling at some point and missing the rebound.</p>\n\n<p>What&#39;s your plan?</p>\n</div><!-- SC_ON -->",
  "score": 62,
  "permalink": "/r/investing/comments/liilvv/preparing_to_fight_a_bear_market_someday/",
  "subreddit": "investing",
  "id": "liilvv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728621131
}