{
  "author": "bronic12",
  "the_new_excerpt": "I was looking at the posts today and noticed that increasingly there are posts\nlike: \"stake this -APY 50%, stake that on DeF API 200%. Change my mind or\ndownvote me if you like, but WHERE DOES THE MONEY for this COME FROM? Most\nlikely from suckers who fall into this coming for quick gains. I would…",
  "original_created_utc": 1619697299,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日、投稿を見ていて気がついたのですが、だんだんと、以下のような投稿が増えてきました。\nのようなものです。\"これはAPY50％、これはDeF API200％に賭けよう。私の考えを変えるか\nしかし、そのための資金はどこから来ているのでしょうか？ほとんどの場合\n手っ取り早く利益を得ようとするカモからでしょうね。私なら...",
      "title": "ねずみ講のようなプロジェクトが増えています。気持ちの切り替え"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我今天看了一下帖子，发现越来越多的帖子\n诸如。\"赌这个-APY 50%，赌那个DeF API 200%。改变我的想法或\n如果你愿意的话，可以给我投个反对票，但是这样做的资金从哪里来？很可能是\n很可能是那些为了快速收益而陷入其中的傻瓜。我想...",
      "title": "越来越多的项目似乎是庞氏骗局。改变我的想法"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我今天看了一下帖子，發現越來越多的帖子\n諸如。\"賭這個-APY 50%，賭那個DeF API 200%。改變我的想法或\n如果你願意的話，可以給我投個反對票，但是這樣做的資金從哪裏來？很可能是\n很可能是那些爲了快速收益而陷入其中的傻瓜。我想...",
      "title": "越來越多的項目似乎是龐氏騙局。改變我的想法"
    }
  ],
  "title": "More and more projects seem like a Ponzi. Change my mind",
  "created_utc": 1619721776,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was looking at the posts today and noticed that increasingly there are posts like: &quot;stake this -APY 50%, stake that on DeF API 200%. Change my mind or downvote me if you like, but WHERE DOES THE MONEY for this COME FROM? Most likely from suckers who fall into this coming for quick gains. I would like to see a reasonable explanation how this money is created, or if it&#39;s made from thin air ? Back in my day, this was the literal definition of a Ponzi scheme and a HUGE red flag.</p>\n\n<p>I would like to be wrong as a crypto enthusiast but I fear for the worst, again after 2017.</p>\n\n<p>EDIT: just to reiterate, because some people seem to think that I&#39;m a noob, I&#39;m in the space since 2016, and I&#39;ve seen it all, from ICO&#39;s to even Bitconnect (Wassawassa) . My main problem is that here value is being created out of thin air and has no correlation to anything.</p>\n\n<p>EDIT 2: I don&#39;t really understand the downvotes, i actually think we had a couple of good insights and discussions.</p>\n</div><!-- SC_ON -->",
  "score": 472,
  "permalink": "/r/CryptoCurrency/comments/n12oru/more_and_more_projects_seem_like_a_ponzi_change/",
  "subreddit": "CryptoCurrency",
  "id": "n12oru",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380959897
}