{
  "author": "anon8496847385",
  "the_new_excerpt": "As I think we all know (I hope so anyway), a crash/correction is a certainty.\nThe only unknown is when. So, let's get one thing clear to start with. This time\nis NOT different, I feel a nice big build-up of sick in the back of my throat\nwhen I read \"This time is different\". I have seen this in 2014…",
  "original_created_utc": 1620313846,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "誰もが知っていると思うが（とにかくそうあってほしい）、暴落・修正は確実に起こる。\n唯一の未知数は「いつ」かということです。そこで、まず一つのことを明確にしておきましょう。今回の\n私は「今回は違う」という言葉を読むと、喉の奥から気持ち悪さがこみ上げてきます。\n今回は違う」という言葉を読むと、喉の奥から気持ち悪さがこみ上げてきます。私は2014年にこれを見たことがあります...。",
      "title": "市場の暴落とはどのようなものか？2017年の生き残りから"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想我们都知道（反正我希望如此），崩溃/修正是肯定的。\n唯一的未知数是什么时候。因此，让我们先弄清楚一件事。这个时间\n并非不同，当我读到 \"这一次是不同的 \"时，我感到喉咙里有一股强烈的不适。\n当我读到 \"这一次是不同的 \"时，我感到喉咙里有一大堆恶心。我在2014年已经看到了这一点...",
      "title": "市场崩溃是什么样子的？来自一个2017年的幸存者"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想我們都知道（反正我希望如此），崩潰/修正是肯定的。\n唯一的未知數是什麼時候。因此，讓我們先弄清楚一件事。這個時間\n並非不同，當我讀到 \"這一次是不同的 \"時，我感到喉嚨裏有一股強烈的不適。\n當我讀到 \"這一次是不同的 \"時，我感到喉嚨裏有一大堆噁心。我在2014年已經看到了這一點...",
      "title": "市場崩潰是什麼樣子的？來自一個2017年的倖存者"
    }
  ],
  "title": "What is a market crash like? From a 2017 survivor",
  "created_utc": 1620337043,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As I think we all know (I hope so anyway), a crash/correction is a certainty. The only unknown is when. So, let&#39;s get one thing clear to start with. This time is NOT different, I feel a nice big build-up of sick in the back of my throat when I read &quot;This time is different&quot;. I have seen this in 2014 and 2017. Does that mean I don&#39;t think this space has progressed or there are more institutional investors? No, what I mean to say is this time is no different than any other asset class and after a big pump/market surge, a correction/crash is INEVITABLE. This will happen, we just don&#39;t know when. If you don&#39;t believe this, I would suggest, take the tin foil off your head and go outside. </p>\n\n<p>What a crash does is really highlight the flaws in your investments. In 2017, it hit be like a train would hit a marshmallow. I had failed to follow simple guidance. I had invested far too much money then I could afford to lose/go down 90% and my portfolio was far to weighted in moon shots/alts. As a result, I felt the crash hard. What we know from previous crashes, and highly likely to happen in future crashes is when BTC poops itself, the alts get Dehli belly to the extreme and will crash FAR harder. This is the risk you take in alts, they have more upside potential, but boy oh boy do they have downside potential as well. </p>\n\n<p>Don&#39;t start losing your head because crypto is earning you more than your actual fiat mining job. Get a grip and don&#39;t go FOMOing into any random moonshot and come crying to this sub when it crashes 99.99%. You cannot seriously accept the amazing potential of picking the right alt that blows 100-1000x but when it does the same the other way go, hey what gives?</p>\n\n<p>As we get closer and closer to a market top, more and more fresh blood and new faces will be FOMOing and likely not into BTC and ETH due to common misconceptions that they are too expensive/gains aren&#39;t as much as other coins. These people, in particular, a word of warning, remember you HAVE to be prepared for a crash at some point. It is a certainty. We just don&#39;t know when. When making investing decisions in this space, just keep that at the back of your mind. </p>\n\n<p>In all seriousness, I&#39;ve been in dark places when it crashed, don&#39;t be me, be better.</p>\n</div><!-- SC_ON -->",
  "score": 436,
  "permalink": "/r/CryptoCurrency/comments/n69hyj/what_is_a_market_crash_like_from_a_2017_survivor/",
  "subreddit": "CryptoCurrency",
  "id": "n69hyj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985988836
}