{
  "author": "Annual-Strategy-6487",
  "original_created_utc": 1656247491,
  "title": "Why do philosophers use sophisticated language?",
  "created_utc": 1656276593,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Very often i see phisolophers using unnecessarily sophisticated words that are hard to understand and not known by many people to convey their message, when they could convey the same meaning in much more common words. Why is that?&lt;/p&gt;\n\n&lt;p&gt;Isn&amp;#39;t philosophy supposed to help mankind? How is it going to help if it can&amp;#39;t reach the majority of people? Language becomes a barrier for the less educated and philosophy becomes an elite of thought.&lt;/p&gt;\n\n&lt;p&gt;Why can&amp;#39;t we use common words that the average human being in 2022 can understand? When we try to explain something to a friend we use common words and he understands, but when we are going to write a philosophical book about the same subject we need to use words and build overly complicated sentences? Doesn&amp;#39;t make sense and i don&amp;#39;t get it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/askphilosophy/comments/vl3y7g/why_do_philosophers_use_sophisticated_language/",
  "subreddit": "askphilosophy",
  "id": "vl3y7g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Very often i see phisolophers using unnecessarily sophisticated words that are\nhard to understand and not known by many people to convey their message, when\nthey could convey the same meaning in much more common words. Why is that?\n\nIsn't philosophy supposed to help mankind? How is it going to help…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "フィソロフィーの人たちが、不必要に洗練された言葉を使っているのをよく見かけます。\nを使うのをよく見かけます。\n同じ意味なら、もっと一般的な言葉で伝えられるはずです。なぜでしょう？\n\n哲学は人類を救うものではないのですか？どうやって助けるんだ......」。",
      "title": "なぜ哲学者は洗練された言葉を使うのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我经常看到钓鱼者使用不必要的复杂词汇，这些词汇是\n来传达他们的信息。\n他们可以用更普通的词来表达同样的意思。为什么会这样？\n\n哲学不是应该帮助人类的吗？它怎么能帮助...",
      "title": "为什么哲学家使用复杂的语言？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我經常看到釣魚者使用不必要的複雜詞彙，這些詞彙是\n來傳達他們的信息。\n他們可以用更普通的詞來表達同樣的意思。爲什麼會這樣？\n\n哲學不是應該幫助人類的嗎？它怎麼能幫助...",
      "title": "爲什麼哲學家使用複雜的語言？"
    }
  ]
}