{
  "author": "Regret92",
  "original_created_utc": 1656501953,
  "title": "Here is why 2022 will be a great year for Loopring (LRC)",
  "created_utc": 1656513379,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’ve been in the crypto space since 2017, and this bear market is leading us to some exciting times!&lt;/p&gt;\n\n&lt;p&gt;As the bear continues, and as a general rule, I am becoming more and more of a loopring maxi.&lt;/p&gt;\n\n&lt;p&gt;Here is why.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;ZK rollups are the future of web 3, and reduce transaction fees massively.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Minting an NFT on loopring network is a fraction of competing marketplace costs.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The loopring market cap is tiny compared to other less ambitious products. So much room to grow. Once the bear market is over smart money will flock to a humblecap like Loopring.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Daddy V (Vitalik) has namedropped us no less than 4 times on various podcasts, unprompted. This is a huge thing as he usually remains impartial.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The GameStop connection is massive. GameStop has always been at the forefront of innovation and is the #1 name when it comes to purchasing new games or gaming tech. This cannot be understated and I am so bullish for the future of loopring now they are formally partnered! \n&lt;a href=\"https://nft.gamestop.com\"&gt;Power to the players!&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Loopring stores your KYC and all user information permanently and securely on-cloud in accordance with PRC law, which is convenient as you never have to validate it periodically (looking at you, Binance!)\n&lt;a href=\"https://static.loopring.io/documents/markdown/privacy_en.md\"&gt;Linky to details&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The permanent storage of your information is for any possible future disputes. This is huge, as a massive downside of ETH and BTC is sending to wrong addresses and burning your tokens. With loopring, this is the first DeFi system to offer this kind of user security, not unlike PayPal.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Public sentiment and community. The loopring sub is amazing and welcoming. The discord is hugely useful. The public is also beginning to wake up to the huge utility of NFT - it is not just monkey pictures.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The FUD here on reddit - you will see a lot of anti-loopring/ GME posts and comments. Resistance is bullish, as there must be a reason to try to suppress a good project.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The response to the FUD - I frequently see comments unfairly criticising loopring be downvoted fairly quickly. This shows the community is aware of the great utility of loopring, and that we are moving on from unfounded criticism. We are so early!&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Future partnerships in the works - a fair amount of contributors in the GitHub are from large organisations such as Amazon and Alibaa. This cannot be overlooked.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Looprings fee-cutting tech has helped out ETH ahead of the merge, as people have now gotten a taste for cheap transactions and minting on the ETH network.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The loopring wallet is amazing and seamless. Imagine Fantom wallet but even better. This is the future.\n&lt;a href=\"https://loopring.org/#/\"&gt;Here’s the link to give it a try!&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The open and honest nature of the dev team. Check out &lt;a href=\"https://github.com/Loopring\"&gt;their github&lt;/a&gt; - they are constantly updating and providing bug fixes as well as communicating with the public.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;There are honestly so many more points, but I wanted to provide some during this bear market as it leaves more room for open and honest discussion. I am so incredibly bullish for the future of crypto, and the ETH-LRC wombo-combo is one that is very understated!&lt;/p&gt;\n\n&lt;p&gt;Edit: point 9 being displayed in this thread by the paid FUDders!&lt;/p&gt;\n\n&lt;p&gt;Edit 2: thanks for the suicide bot report, kind stranger!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 348,
  "permalink": "/r/CryptoCurrency/comments/vndi8a/here_is_why_2022_will_be_a_great_year_for/",
  "subreddit": "CryptoCurrency",
  "id": "vndi8a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’ve been in the crypto space since 2017, and this bear market is leading us to\nsome exciting times!\n\nAs the bear continues, and as a general rule, I am becoming more and more of a\nloopring maxi.\n\nHere is why.\n\n 1.  ZK rollups are the future of web 3, and reduce transaction fees massively.\n\n 2. …"
}