{
  "author": "M4A-is-OK",
  "the_new_excerpt": "I would have thrown in the towel long ago on this one with my cost averaged\npositions of ~$41. But the story just looked too good! I already made this my\none exception to my normal rules (try to keep losses small) after reading about\nhow they are working on replacing jet…",
  "original_created_utc": 1617897522,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の平均的なポジションのコストは～41ドルで、私はずっと前にタオルを投げていました。\nしかし、ストーリーがあまりにも素晴らしかったのです。私はすでにこの銘柄を\n損失を最小限に抑えるために）私の通常のルールの一つの例外として、ジェット機の代わりに\nジェット機の交換に取り組んでいるという記事を読んで、私はすでに通常のルール（損失を小さくする）を守っています。",
      "title": "$PLUG、グリーン水素ネットワーク構築のために5.2億ドルの融資保証を受ける"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我早就在这个问题上扔下毛巾，我的成本平均为\n仓位约41美元，但这个故事看起来太美好了! 我已经把这个作为我的\n在阅读了我的正常规则后，我的一个例外（尽量保持小的损失）。\n他们是如何工作的更换喷气... ...",
      "title": "$PLUG将获得5.2亿美元的贷款担保，以建立它的绿色氢气网络。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我早就在這個問題上扔下毛巾，我的成本平均爲\n倉位約41美元，但這個故事看起來太美好了! 我已經把這個作爲我的\n在閱讀了我的正常規則後，我的一個例外（儘量保持小的損失）。\n他們是如何工作的更換噴氣... ...",
      "title": "$PLUG將獲得5.2億美元的貸款擔保，以建立它的綠色氫氣網絡。"
    }
  ],
  "title": "$PLUG to get a $520 million loan guarantee to build out it's green hydrogen network",
  "created_utc": 1617950800,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I would have thrown in the towel long ago on this one with my cost averaged positions of ~$41.  But the story just looked too good!  I already made this my one exception to my normal rules (try to keep losses small) after reading about how they are working on replacing <a href=\"https://www.ir.plugpower.com/Press-Releases/Press-Release-Details/2021/Plug-Power-and-Universal-Hydrogen-Expand-Partnership-to-Include-Investment-and-Global-Green-Hydrogen-Supply-for-Aviation/default.aspx\">jet fuel</a>.</p>\n\n<p>Now I&#39;m reading <a href=\"https://www.globenewswire.com/news-release/2021/04/08/2206804/9619/en/Plug-Power-Invited-to-Submit-Part-II-Application-for-Proposed-520-million-from-DOE-s-Title-XVII-Loan-Guarantee-Program.html\">this</a>: &quot;We’ve proven the viability of our 10 year roadmap to be cost competitive  with natural gas-derived “gray” hydrogen,” said Andy Marsh, CEO of Plug  Power.&quot;</p>\n\n<p>---------------------------------------------------</p>\n\n<p>Update 4/8/2021 8:30pm ET: I understand not everybody is a fan (would worry me if they were).  But for now I&#39;m sticking with the 13 analysts who are giving an average 12 month price target of $58.92 (high of $78, low of $29 - has come close to hitting that last one!)</p>\n\n<p>However I will say this does bring back memories of a stock I got into about 9 years ago?  Westport Fuel Systems and their natural gas engines (WPRT) - it hurt me and made me cry.  Peaked at $40 in February 2012 and last I checked it was still in the single digits.  I&#39;m just hoping this plug dream stock (as in wing and a prayer) doesn&#39;t turn into a nightmare like that one did. </p>\n</div><!-- SC_ON -->",
  "score": 46,
  "permalink": "/r/stocks/comments/mmuvqh/plug_to_get_a_520_million_loan_guarantee_to_build/",
  "subreddit": "stocks",
  "id": "mmuvqh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566617815
}