{
  "author": "DrUNC83",
  "the_new_excerpt": "So it looks like after the inflow last week to silver , $SLV finally admitted\nthe scam they have been running. I am curious how this effects price. Does paper\nsilver finally squeeze or do people flee $SLV?\n\nBasically what happened: normally $SLV is supposed to cover their positions with\nphysical…",
  "original_created_utc": 1613302840,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "所以看起来上周流入白银后，$SLV终于承认了。\n的骗局，他们一直在运行。我很好奇这对价格有何影响。纸张\n白银最终压制还是人们逃离$SLV？\n\n基本上发生了什么：通常$SLV应该是用他们的仓位来弥补\n物理...",
      "title": "$SLV破产？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以看起來上週流入白銀後，$SLV終於承認了。\n的騙局，他們一直在運行。我很好奇這對價格有何影響。紙張\n白銀最終壓制還是人們逃離$SLV？\n\n基本上發生了什麼：通常$SLV應該是用他們的倉位來彌補\n物理...",
      "title": "$SLV破產？"
    }
  ],
  "title": "$SLV Broke?",
  "created_utc": 1613338384,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So it looks like after the inflow last week to silver , $SLV finally admitted the scam they have been running. I am curious how this effects price.  Does paper silver finally squeeze or do people flee $SLV?  </p>\n\n<p>Basically what happened: normally $SLV is supposed to cover their positions with physical silver.  They have been “required” to buy positions with physical silver and the fund always acted as a surrogate for the price of physical silver.  Well... recently they updated their prospectus page 7 \n<a href=\"https://www.ishares.com/us/literature/prospectus/p-ishares-silver-trust-prospectus-12-31.pdf\">https://www.ishares.com/us/literature/prospectus/p-ishares-silver-trust-prospectus-12-31.pdf</a></p>\n\n<p>It essentially says that they may not be able to find physical silver to cover positions, finally admitting what has been known for years, that silver supply is way less than demand.  I am sure they saw a potential surge in pricing and are trying to cover themselves from potential lawsuits should “authorized dealers” want to take delivery of their lots of silver from their $SLV position.</p>\n\n<p>This will likely surge the price of physical silver but I am curious does paper silver rocket up also? Does $SLV break? Does paper and physical finally decouple?</p>\n</div><!-- SC_ON -->",
  "score": 2388,
  "permalink": "/r/wallstreetbets/comments/ljmwyt/slv_broke/",
  "subreddit": "wallstreetbets",
  "id": "ljmwyt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728633142
}