{
  "author": "lego-ninja",
  "original_created_utc": 1647353039,
  "title": "Why are women's clothes designed to show off their bodies far more so than men's clothes are?",
  "created_utc": 1647364758,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;TL;DR:&lt;/strong&gt; Do women consciously realize that nearly all the clothing they wear before they hit menopause is designed and worn with the express purpose at some level or another, to some degree or another, for drawing non-platonic attention from the opposite gender?&lt;/p&gt;\n\n&lt;p&gt;Reading through the replies in the cleavage thread from yesterday was really enlightening as a guy, there were some unique viewpoints and some really different ways of viewing the world that I hadn&amp;#39;t understood previously.&lt;/p&gt;\n\n&lt;p&gt;One thing it brought up that I&amp;#39;ve never felt safe to ask though is why women&amp;#39;s clothes seem to be primarily designed to show off their bodies, vs men&amp;#39;s clothes, which seem to favor functionality first and everything else a distant second.&lt;/p&gt;\n\n&lt;p&gt;There were so many replies in the cleavage thread justifying women&amp;#39;s clothing choices that basically boiled down to &amp;#39;&lt;em&gt;I want to be comfortable and not treated like my body is on display as a sexual object&lt;/em&gt;&amp;#39;.&lt;/p&gt;\n\n&lt;p&gt;Which totally makes sense! What human being would?&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s that saying that actions speak louder than words though, and as a guy, it looks like every adult woman that&amp;#39;s pre menopause wears clothing that is designed exactly to put their body on display as a sexual object (with the curious exception of lesbians that don&amp;#39;t go for the feminine look).&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not talking club wear, or swimsuits, but basic every day casual clothing. &lt;/p&gt;\n\n&lt;p&gt;Take the following for example:&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Men&amp;#39;s shorts&lt;/strong&gt;? Wide cut, only touching the skin at the waist and top of the butt, hem at mid thigh to just above the knee.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Women&amp;#39;s shorts&lt;/strong&gt;? Extremely tight cut, touching the skin at every single point, hem right below the crotch or just an inch or two below.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Men&amp;#39;s t-shirts&lt;/strong&gt;? Generally loose, sleeve hemmed at mid bicep, neck right at the collar bone.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Women&amp;#39;s t-shirts&lt;/strong&gt;? Much tighter, sleeve hemmed much higher up, neck as low as it can get without drawing condemnation from other women.&lt;/p&gt;\n\n&lt;p&gt;And this is just casual clothing that&amp;#39;s worn by both genders. It&amp;#39;s not even getting into athletic clothing, which amps this up to 11.&lt;/p&gt;\n\n&lt;p&gt;As a guy, short shorts exist, as do tight t-shirts. I don&amp;#39;t need either - or any skin hugging casual clothing, as a matter of fact - to &amp;#39;be comfortable&amp;#39; and I know that wearing either is very much putting my body on display as a sexual object, which I did in the past when I wasn&amp;#39;t in a long term relationship and wanted to draw attention from the opposite sex.&lt;/p&gt;\n\n&lt;p&gt;But from the way women dress, it appears that every piece of clothing (unless you&amp;#39;re a member of the Amish or other hyper-traditional sect) is designed to display the message that I  display when I&amp;#39;m looking to garner attention from the opposite gender that says &amp;quot;&lt;em&gt;Hey, I&amp;#39;m a healthy adult male and I want non-platonic attention from women.&lt;/em&gt;&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;But as soon as women hit menopause? All of those clothing choices start to resemble the casual wear clothing of men. So it&amp;#39;s definitely not a &amp;#39;&lt;em&gt;This is how I have to dress for basic human comfort&lt;/em&gt;&amp;#39; thing, despite a bunch of words to the contrary. &lt;/p&gt;\n\n&lt;p&gt;There seems to be this weird double standard of &amp;quot;Pay non-platonic attention to my body, but don&amp;#39;t pay non-platonic attention to my body.&amp;quot; that women seem to be completely blind to in a really strange way.&lt;/p&gt;\n\n&lt;p&gt;I think women are great human beings like men are great human beings, and worthy of the exact same respect you&amp;#39;d give a guy, but they make some strange clothing choices that seem to be contrary to what they say on the subject, and it&amp;#39;s something I&amp;#39;ve yet to understand, but definitely would appreciate the chance to do so.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/tepqd4/why_are_womens_clothes_designed_to_show_off_their/",
  "subreddit": "TooAfraidToAsk",
  "id": "tepqd4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "TL;DR: Do women consciously realize that nearly all the clothing they wear\nbefore they hit menopause is designed and worn with the express purpose at some\nlevel or another, to some degree or another, for drawing non-platonic attention\nfrom the opposite gender?\n\nReading through the replies in the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "TL;DR: 女性は、自分が着ているほとんどすべての衣服に、意識的に気づいているのだろうか？\n更年期を迎える前に、何らかの明確な目的を持ってデザインされ、着用されているのです。\nプラトニックでない注意を引くために、ある程度、あるいはそれ以上のレベルで\n異性から？\n\nの返信を読むと...",
      "title": "なぜ女性の服は、男性の服よりもはるかに体を見せるデザインなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "TL;DR：女性是否意识到，她们在更年期之前所穿的几乎所有衣服\n在她们进入更年期之前，几乎所有的衣服都是以某种程度上的明确目的而设计和穿着的。\n在某种程度上，在某种程度上，为了吸引非platonic关注\n吸引异性的注意？\n\n通过阅读《中国青年报》上的回复，我们可以发现，女性在更年期所穿的衣服，几乎都是为了在某种程度上吸引异性的注意而设计的。",
      "title": "为什么女人的衣服被设计成远比男人的衣服更能展示她们的身体？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "TL;DR：女性是否意識到，她們在更年期之前所穿的幾乎所有衣服\n在她們進入更年期之前，幾乎所有的衣服都是以某種程度上的明確目的而設計和穿着的。\n在某種程度上，在某種程度上，爲了吸引非platonic關注\n吸引異性的注意？\n\n通過閱讀《中國青年報》上的回覆，我們可以發現，女性在更年期所穿的衣服，幾乎都是爲了在某種程度上吸引異性的注意而設計的。",
      "title": "爲什麼女人的衣服被設計成遠比男人的衣服更能展示她們的身體？"
    }
  ]
}