{
  "author": "Obsessive_commentor",
  "original_created_utc": 1639886568,
  "title": "What’s with all the anti-American sentiment on major subreddits?",
  "created_utc": 1639900721,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Here is an example of what I mean:&lt;/p&gt;\n\n&lt;p&gt;A couple of days ago there was a post on the front page of Reddit titles “People leave space in the middle during traffic on the Autobahn so emergency vehicles can get through directly.” As the title suggests, it’s of a lot of cars in traffic making room for an emergency services vehicle to get through in Germany. A lot of the top comments under this post basically say “Americans never let ambulances and firetrucks through.” &lt;/p&gt;\n\n&lt;p&gt;I lived in America for a while and whenever I saw an emergency vehicle, cars made way for it. To confirm, I made a post on the ‘ask an American’ subreddit asking if people make room for emergency services vehicles. All the replies confirmed that they do, stated that it’s law to do so, and reiterated that it’s basically universally followed. &lt;/p&gt;\n\n&lt;p&gt;This is one example of this anti-American bias I’ve noticed on Reddit (another is that when the vaccine was just coming out, Canada announced that it would be free to all citizens and the news articles announcing this were on the front page for a while. The US announced that they would be free before Canada did and this did not make it onto the front page). &lt;/p&gt;\n\n&lt;p&gt;There are many other examples I could list. Why does this anti-American sentiment exist on Reddit?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/rjodkh/whats_with_all_the_antiamerican_sentiment_on/",
  "subreddit": "TooAfraidToAsk",
  "id": "rjodkh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Here is an example of what I mean:\n\nA couple of days ago there was a post on the front page of Reddit titles “People\nleave space in the middle during traffic on the Autobahn so emergency vehicles\ncan get through directly.” As the title suggests, it’s of a lot of cars in\ntraffic making room for an…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "その一例をご紹介します。\n\n数日前、Redditのトップページに「People」というタイトルの投稿がありました。\nアウトバーンでの渋滞時には、緊急車両のために真ん中にスペースを空けておく。\nが直接通れる\" タイトルの通り、たくさんの車が走っている様子で\n渋滞に巻き込まれ...",
      "title": "主要なサブレディットでの反米感情はどうしたんだ？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这里有一个例子说明我的意思。\n\n几天前，在Reddit的首页上有一个帖子，标题是 \"人们\n在高速公路上的交通中，人们在中间留出空间，以便紧急车辆能够直接通过。\n可以直接通过\"。正如标题所暗示的那样，这是许多汽车在\n交通中的许多汽车为一辆汽车腾出空间。",
      "title": "主要子网站上的反美情绪是怎么回事？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這裏有一個例子說明我的意思。\n\n幾天前，在Reddit的首頁上有一個帖子，標題是 \"人們\n在高速公路上的交通中，人們在中間留出空間，以便緊急車輛能夠直接通過。\n可以直接通過\"。正如標題所暗示的那樣，這是許多汽車在\n交通中的許多汽車爲一輛汽車騰出空間。",
      "title": "主要子網站上的反美情緒是怎麼回事？"
    }
  ]
}