{
  "author": "mczmczmcz",
  "original_created_utc": 1649260137,
  "title": "Why are conservatives opposed to government intervention in regard to vaccination and mask mandantes but in favor of government intervention in regard to abortions?",
  "created_utc": 1649272527,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Sincere question. Conservatives consider mask and vaccination mandates as violations of people’s rights. But forcing a woman to have baby is considered to be acceptable. &lt;/p&gt;\n\n&lt;p&gt;The “best” justification I’ve heard is that an unborn baby shouldn’t have to be killed because the mother was irresponsible. But by that reasoning, a random person shouldn’t be infected with a virus because someone is too irresponsible to wear a mask. Right?&lt;/p&gt;\n\n&lt;p&gt;Ideally I’d like to hear a conservative perspective.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 226,
  "permalink": "/r/NoStupidQuestions/comments/txp81j/why_are_conservatives_opposed_to_government/",
  "subreddit": "NoStupidQuestions",
  "id": "txp81j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Sincere question. Conservatives consider mask and vaccination mandates as\nviolations of people’s rights. But forcing a woman to have baby is considered to\nbe acceptable.\n\nThe “best” justification I’ve heard is that an unborn baby shouldn’t have to be\nkilled because the mother was irresponsible. But…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "真摯な質問 保守派はマスクや予防接種の義務付けを\n人々の権利を侵害している。しかし、女性に赤ちゃんを産むことを強制することは\n許容される。\n\n私が聞いた「最高の」正当化理由は、「生まれてくる子供を殺すべきでない」というものです。\n母親が無責任だから殺される。でも...",
      "title": "なぜ保守派は、ワクチン接種やマスクの義務付けに関しては政府の介入に反対し、中絶に関しては政府の介入に賛成するのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "真诚的问题。保守派认为口罩和疫苗接种的强制规定是\n侵犯了人们的权利。但强迫妇女生孩子却被认为是\n是可以接受的。\n\n我听到的 \"最好 \"的理由是，未出生的婴儿不应该被\n因为母亲是不负责任的。但是...",
      "title": "为什么保守派反对政府对疫苗接种和口罩任务的干预，而赞成政府对堕胎的干预？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "真誠的問題。保守派認爲口罩和疫苗接種的強制規定是\n侵犯了人們的權利。但強迫婦女生孩子卻被認爲是\n是可以接受的。\n\n我聽到的 \"最好 \"的理由是，未出生的嬰兒不應該被\n因爲母親是不負責任的。但是...",
      "title": "爲什麼保守派反對政府對疫苗接種和口罩任務的干預，而贊成政府對墮胎的干預？"
    }
  ]
}