{
  "author": "WutYoYoYo",
  "the_new_excerpt": "After losing billions for multiple weeks to the retail investor and proclaiming\nthey are changing strategies to invest in growth stocks, hedge funds start a new\ngame. Short the US financial system, short ten year treasury bonds, spur\ninflation, cause the feds to raise interest rates, and stall the…",
  "original_created_utc": 1614910591,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在连续多周亏损数十亿的散户，并宣称\n他们正在改变策略，投资成长股，对冲基金开始新的\n游戏。做空美国金融体系，做空十年期国债，刺激。\n通货膨胀，导致美联储加息，拖住... ...",
      "title": "对冲基金在无法战胜散户时做空美债市场。惩罚华尔街。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在連續多周虧損數十億的散戶，並宣稱\n他們正在改變策略，投資成長股，對沖基金開始新的\n遊戲。做空美國金融體系，做空十年期國債，刺激。\n通貨膨脹，導致美聯儲加息，拖住... ...",
      "title": "對沖基金在無法戰勝散戶時做空美債市場。懲罰華爾街。"
    }
  ],
  "title": "Hedge Funds Short US Bond Market When They Can't Win Against The Retail Investor. Punishes Wallstreet.",
  "created_utc": 1614926218,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>After losing billions for multiple weeks to the retail investor and proclaiming they are changing strategies to invest in growth stocks, hedge funds start a new game. Short the US financial system, short ten year treasury bonds, spur inflation, cause the feds to raise interest rates, and stall the economic recovery from COVID-19.</p>\n\n<p>Article summarizing the events are here:\n<a href=\"https://www.cnn.com/2021/03/04/investing/wall-street-repo-market-fed/index.html\">https://www.cnn.com/2021/03/04/investing/wall-street-repo-market-fed/index.html</a></p>\n\n<p>TLDR:\nHedge funds shorting US Treasury bond market, specifically 10 year bonds, testing the Federal Reserve. Causes inflation worries, stocks react and sell off in mass. Hedge funds do this to punish the retail investor who they have lost billions to because SEC is not regulating the retail investor.</p>\n\n<p>Edit: Grammatical errors.</p>\n</div><!-- SC_ON -->",
  "score": 483,
  "permalink": "/r/stocks/comments/ly1mbx/hedge_funds_short_us_bond_market_when_they_cant/",
  "subreddit": "stocks",
  "id": "ly1mbx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542575860
}