{
  "author": "MRKworkaccount",
  "original_created_utc": 1650916296,
  "title": "What were Chinese gangs in the American West like?",
  "created_utc": 1650978633,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I  am currently teaching a unit on the Chinese Exclusion Act in my 10th  grade cultural studies class and as I&amp;#39;ve been looking for material on  the expulsion of Chinese from west coast cities (We&amp;#39;re near Tacoma) I  notice that in the Eureka expulsion the triggering event as a shootout  between two Chinese gangs that caught a city council member. The  American Experience documentary also noted that the Los Angeles lynching  started after someone caught a stray during a gunfight between two  Chinese. I&amp;#39;ve never read much about Chinese organized Crime in the US  and was primarily interested if anyone had an sources on the topic, but  in the spirit of asking specific questions I&amp;#39;ve listed several below.&lt;/p&gt;\n\n&lt;p&gt;Was  open warfare between Chinese gangs common in the west? How powerful  were these gangs, did they have connections to organized crime back in  China? Were they politically active and did they attempt to defend  Chinese against expulsions. Were there activities limited to the Chinese  community and the types of crimes we tend to associate with the Chinese  of this period like opium, prostitution and trafficking or were they  involved with other enterprises and ethnic groups? Did they run into  issues with other ethnic gangs/organized crimes?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/ubtrn7/what_were_chinese_gangs_in_the_american_west_like/",
  "subreddit": "AskHistorians",
  "id": "ubtrn7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I am currently teaching a unit on the Chinese Exclusion Act in my 10th grade\ncultural studies class and as I've been looking for material on the expulsion of\nChinese from west coast cities (We're near Tacoma) I notice that in the Eureka\nexpulsion the triggering event as a shootout between two…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "現在、10年生の文化研究の授業で、中国人排斥法に関する単元を担当しています。\n西海岸の都市（私たちはタコマの近くです）から中国人を追放するための資料を探していました。\n西海岸の都市（私たちはタコマの近くに住んでいます）からの中国人の追放に関する資料を探していて、ユーレカでの\n追放の引き金となったのは、2人の中国人による銃撃戦だった。",
      "title": "アメリカ西部の中国人ギャングとは、どのようなものだったのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我目前在10年级教授一个关于排华法案的单元。\n文化研究课上，我一直在寻找有关将中国人驱逐出西海岸的材料。\n我一直在寻找关于西海岸城市驱逐中国人的材料（我们在塔科马附近），我注意到，在尤里卡\n我注意到，在尤里卡的驱逐事件中，触发事件是两个人之间的枪战......",
      "title": "美国西部的华人帮派是什么样的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我目前在10年級教授一個關於排華法案的單元。\n文化研究課上，我一直在尋找有關將中國人驅逐出西海岸的材料。\n我一直在尋找關於西海岸城市驅逐中國人的材料（我們在塔科馬附近），我注意到，在尤里卡\n我注意到，在尤里卡的驅逐事件中，觸發事件是兩個人之間的槍戰......",
      "title": "アメリカ西部の中國人ギャングとは、どのようなものだったのでしょうか。"
    }
  ]
}