{
  "author": "MRKworkaccount",
  "original_created_utc": 1650916296,
  "title": "What were Chinese gangs in the American West like?",
  "created_utc": 1650978633,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I  am currently teaching a unit on the Chinese Exclusion Act in my 10th  grade cultural studies class and as I&amp;#39;ve been looking for material on  the expulsion of Chinese from west coast cities (We&amp;#39;re near Tacoma) I  notice that in the Eureka expulsion the triggering event as a shootout  between two Chinese gangs that caught a city council member. The  American Experience documentary also noted that the Los Angeles lynching  started after someone caught a stray during a gunfight between two  Chinese. I&amp;#39;ve never read much about Chinese organized Crime in the US  and was primarily interested if anyone had an sources on the topic, but  in the spirit of asking specific questions I&amp;#39;ve listed several below.&lt;/p&gt;\n\n&lt;p&gt;Was  open warfare between Chinese gangs common in the west? How powerful  were these gangs, did they have connections to organized crime back in  China? Were they politically active and did they attempt to defend  Chinese against expulsions. Were there activities limited to the Chinese  community and the types of crimes we tend to associate with the Chinese  of this period like opium, prostitution and trafficking or were they  involved with other enterprises and ethnic groups? Did they run into  issues with other ethnic gangs/organized crimes?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/ubtrn7/what_were_chinese_gangs_in_the_american_west_like/",
  "subreddit": "AskHistorians",
  "id": "ubtrn7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I am currently teaching a unit on the Chinese Exclusion Act in my 10th grade\ncultural studies class and as I've been looking for material on the expulsion of\nChinese from west coast cities (We're near Tacoma) I notice that in the Eureka\nexpulsion the triggering event as a shootout between two…"
}