{
  "author": "Clarkeboyzinc",
  "original_created_utc": 1628076805,
  "title": "The dark side of moons",
  "created_utc": 1628087657,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Moons have changed this sub. For the better or the worse, that is up to discussion.</p>\n\n<p>I want to talk about the flaws of moons. Their psychological effect. Every I’ve seen in new has had 40+ comments in 30 minutes, but all the posts I make rarely have 15+ upvotes. Not upvoting a post makes almost zero effect, in fact in a post I’d seen before analysing karma and moons, not upvoting 1000 posts will only increase the number f moons you receive 0.17% more moons, that’s 100.17 moons instead of 100. But people don’t care that they barely change anything, they are greedy, and moons have magnified these issues 1000 fold.</p>\n\n<p>Edit: this post has been live 3 minutes. It already has 11 comments but 1 upvote. This just further proves my statement</p>\n</div><!-- SC_ON -->",
  "score": 227,
  "permalink": "/r/CryptoCurrency/comments/oxqr4l/the_dark_side_of_moons/",
  "subreddit": "CryptoCurrency",
  "id": "oxqr4l",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Moons have changed this sub. For the better or the worse, that is up to\ndiscussion.\n\nI want to talk about the flaws of moons. Their psychological effect. Every I’ve\nseen in new has had 40+ comments in 30 minutes, but all the posts I make rarely\nhave 15+ upvotes. Not upvoting a post makes almost zero…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ムーンはこのサブを変えた。良い意味でも悪い意味でも、それは議論の余地があります。\nの議論になります。\n\n私はムーンの欠点について話したいと思います。その心理的効果について。私が今まで見てきた\n新しい記事には30分で40以上のコメントがついていますが、私の記事には15以上のアップヴォートはほとんどありません。\n15以上のアップヴォートはほとんどない。アップヴォートしない投稿はほとんどゼロ...",
      "title": "ムーンのダークサイド"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "月亮已经改变了这个子。不管是好是坏，这都有待于\n讨论。\n\n我想谈一谈月亮的缺陷。他们的心理影响。我所看到的每一个\n都在30分钟内有40多条评论，但我发的所有帖子很少有\n有15个以上的支持率。不给一个帖子投票，几乎是零...",
      "title": "卫星的黑暗面"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "月亮已經改變了這個子。不管是好是壞，這都有待於\n討論。\n\n我想談一談月亮的缺陷。他們的心理影響。我所看到的每一個\n都在30分鐘內有40多條評論，但我發的所有帖子很少有\n有15個以上的支持率。不給一個帖子投票，幾乎是零...",
      "title": "衛星的黑暗面"
    }
  ]
}