{
  "author": "Snoo65810",
  "original_created_utc": 1643538321,
  "title": "You are NOT a Crypto \"Millionaire/Billionaire\" if you simply just converted your already existing wealth or part of it to Crypto.",
  "created_utc": 1643568129,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I keep seeing this &amp;quot;Crypto Billionaire&amp;quot; label thrown around and frankly it doesn&amp;#39;t make sense nor is it an accomplishment.&lt;/p&gt;\n\n&lt;p&gt;Most of those who hold such a title were already rich to begin with!&lt;/p&gt;\n\n&lt;p&gt;This gives unrealistic expectations in the technology making every joe believe he can be a millionaire with $100. If we actually took the time to research the family backgrounds/immense dollar wealth these successful Crypto influencers already possessed prior to investing, I believe it would help show everyone a glimpse of reality.&lt;/p&gt;\n\n&lt;p&gt;Yes there are legends who make it from nothing but they either held since the dark ages or made a barbaric play into a newly released project. Other than that, it is the same old story of &amp;quot;My father gave me a small loan of a million dollars&amp;quot;. The next time you see someone on some &amp;quot;Crypto rich list&amp;quot; or a guy flashing his Crypto gains, consider doing a little research.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 336,
  "permalink": "/r/CryptoCurrency/comments/sg6cnt/you_are_not_a_crypto_millionairebillionaire_if/",
  "subreddit": "CryptoCurrency",
  "id": "sg6cnt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I keep seeing this \"Crypto Billionaire\" label thrown around and frankly it\ndoesn't make sense nor is it an accomplishment.\n\nMost of those who hold such a title were already rich to begin with!\n\nThis gives unrealistic expectations in the technology making every joe believe\nhe can be a millionaire…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はこの「暗号億万長者」というラベルが投げかけられるのをずっと見てきましたが、率直に言って、それは\n意味もないし、成果でもない。\n\nそのような肩書きを持つ人のほとんどは、元々お金持ちだったのです。\n\nそのため、テクノロジーに非現実的な期待を抱かせ、あらゆる人が\n億万長者になれるかもしれない...。",
      "title": "すでに持っている財産やその一部を暗号に変換しただけでは、暗号「ミリオネア/ビリオネア」ではありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直看到这个 \"加密货币亿万富翁 \"的标签被扔来扔去，坦率地说，它没有意义，也不是一种成就。\n说实话，这没有意义，也不是什么成就。\n\n大多数拥有这种头衔的人一开始就很富有！这给技术领域带来了不切实际的期望。\n\n这给技术带来不切实际的期望，使每个人都相信\n他可以成为百万富翁...",
      "title": "如果你只是简单地将你已经存在的财富或部分财富转换为加密货币，你就不是一个加密货币 \"百万富翁/亿万富翁\"。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直看到這個 \"加密貨幣億萬富翁 \"的標籤被扔來扔去，坦率地說，它沒有意義，也不是一種成就。\n說實話，這沒有意義，也不是什麼成就。\n\n大多數擁有這種頭銜的人一開始就很富有！這給技術領域帶來了不切實際的期望。\n\n這給技術帶來不切實際的期望，使每個人都相信\n他可以成爲百萬富翁...",
      "title": "如果你只是簡單地將你已經存在的財富或部分財富轉換爲加密貨幣，你就不是一個加密貨幣 \"百萬富翁/億萬富翁\"。"
    }
  ]
}