{
  "author": "yankees051693",
  "original_created_utc": 1636375872,
  "title": "Good news. Bought ICP at $750 and it’s at $57.40 today",
  "created_utc": 1636382255,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Happy to announce the icp seems to be on the move after losing a ton of money buying it at the top. It’s up like 13% today or something and I really thought in may icp was going to be the fucking bees knees. But here we are almost everything in the market has recovered except for icp. I don’t think it ever will. It was a bad investment. I just wanted to let people know who were also degenerates that bought at the top, that just because it sounds good doesn’t always mean it is. I now just stick to bitcoin and eth. Thanks for coming to my Ted talk.</p>\n</div><!-- SC_ON -->",
  "score": 179,
  "permalink": "/r/CryptoCurrency/comments/qpcygi/good_news_bought_icp_at_750_and_its_at_5740_today/",
  "subreddit": "CryptoCurrency",
  "id": "qpcygi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Happy to announce the icp seems to be on the move after losing a ton of money\nbuying it at the top. It’s up like 13% today or something and I really thought\nin may icp was going to be the fucking bees knees. But here we are almost\neverything in the market has recovered except for icp. I don’t think…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "嬉しいことに、大損したICPが動き出したようです。\nトップで買って大損したのに、動き出しました。今日は13％ほど上昇しています。\n5月の時点では、ICPは最悪の状態になるだろうと思っていました。しかし、現在ではほとんど\n市場のすべてが回復していますが、ICPだけは別です。思うに...",
      "title": "良いニュースです。ICPを750ドルで買って、今日57.40ドルになった"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "很高兴地宣布，在损失了一大笔钱之后，ICP似乎正在行动。\n在顶部买入它。它今天上涨了13%左右，我真的以为\n在五月，ICP将成为他妈的蜜蜂的膝盖。但现在我们几乎\n市场上所有的东西都已经恢复了，除了ICP。我不认为...",
      "title": "好消息。在750美元买入ICP，今天的价格是57.40美元"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "很高興地宣佈，在損失了一大筆錢之後，ICP似乎正在行動。\n在頂部買入它。它今天上漲了13%左右，我真的以爲\n在五月，ICP將成爲他媽的蜜蜂的膝蓋。但現在我們幾乎\n市場上所有的東西都已經恢復了，除了ICP。我不認爲...",
      "title": "好消息。在750美元買入ICP，今天的價格是57.40美元"
    }
  ]
}