{
  "author": "ezdudera21",
  "original_created_utc": 1625976850,
  "title": "“ I haven’t heard you talk about your Cryptocurrency...”",
  "created_utc": 1625999439,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My wife walked in to my office today and piped up and said “ you haven’t been talking about your cryptocurrency ( yes she says the whole word all the time). I said “ what you mean”. She says “ well a couple months ago you used to tell me everyday how much you made, now I never hear anything about it... have you lost everything “ </p>\n\n<p>My jaw dropped. My reply “ I’m not at a loss but yes it’s dropped a good bit... but I’m not at a loss. I’m not at a loss. Did I mention I’m not at a loss god damn it. </p>\n\n<p>Just wanted to share.</p>\n</div><!-- SC_ON -->",
  "score": 367,
  "permalink": "/r/CryptoCurrency/comments/ohxliy/i_havent_heard_you_talk_about_your_cryptocurrency/",
  "subreddit": "CryptoCurrency",
  "id": "ohxliy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My wife walked in to my office today and piped up and said “ you haven’t been\ntalking about your cryptocurrency ( yes she says the whole word all the time). I\nsaid “ what you mean”. She says “ well a couple months ago you used to tell me\neveryday how much you made, now I never hear anything about…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日、私のオフィスに来た妻が、「あなた、暗号通貨の話をしていないわね」と言いました。\nあなたは暗号通貨の話をしていないわね」と言いました。I\n私は「どういうこと」と言いました。彼女が言うには、「2、3ヶ月前、あなたは毎日のように、どれだけ多くの通貨を購入したかを話していたわ。\n稼いだ金額を毎日話してくれていたのに、今は何も聞いていないわ。",
      "title": "\" 暗号通貨の話は聞いていませんが・・・ \""
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的妻子今天走进我的办公室，大声说：\"你一直没有\n谈论你的加密货币（是的，她一直在说整个词）。I\n我说：\"你是什么意思\"。她说：\"几个月前，你曾经告诉我\n你每天赚了多少钱，现在我从来没有听到任何关于......",
      "title": "\" 我没有听你说过你的加密货币......\""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的妻子今天走進我的辦公室，大聲說：\"你一直沒有\n談論你的加密貨幣（是的，她一直在說整個詞）。I\n我說：\"你是什麼意思\"。她說：\"幾個月前，你曾經告訴我\n你每天賺了多少錢，現在我從來沒有聽到任何關於......",
      "title": "\" 我沒有聽你說過你的加密貨幣......\""
    }
  ]
}