{
  "author": "Daanvann",
  "original_created_utc": 1631557617,
  "title": "I started investing my dad’s money while he knows nothing about crypto, here’s a funny thing that happened.",
  "created_utc": 1631565360,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>First of all, My dad asked me to invest some of his money into crypto, as I know a bit about it and I’m doing relatively well. He knows nothing about crypto, but trusts me and acknowledges the volatility. I, in no way, persuaded him to invest in crypto.\nHaving said that, here’s what happened;</p>\n\n<p>I downloaded a portfolio app on his phone so that he can track the crypto I bought and also so he keeps up with what I’m doing with his money. Naturally, I keep plenty of funds in a stablecoin (in this case usdt) so that I can buy potential dips.\nOne afternoon I kept getting calls from him on my workphone (he never calls me on my workphone). Flustered, I picked up the phone during an important meeting, fearing something bad had happened. When I picked up he said the most boomer thing I ever heard him say ‘Hey, I have been tracking this coin usdt you bought, and it is not doing much, it’s not fluctuating at all, but I’m really, really expecting a rise soon, what do you think?!’</p>\n\n<p>I found it absolutely adorable and dumb at the same time. I explained everything to him and we had a good laugh about it. </p>\n\n<p>Anyway, I just wanted to share this giggle I had. Hope it also brings you some joy in these trying times.</p>\n</div><!-- SC_ON -->",
  "score": 527,
  "permalink": "/r/CryptoCurrency/comments/pnlb29/i_started_investing_my_dads_money_while_he_knows/",
  "subreddit": "CryptoCurrency",
  "id": "pnlb29",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "First of all, My dad asked me to invest some of his money into crypto, as I know\na bit about it and I’m doing relatively well. He knows nothing about crypto, but\ntrusts me and acknowledges the volatility. I, in no way, persuaded him to invest\nin crypto. Having said that, here’s what happened;\n\nI…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "まず第一に、父に頼まれて、自分のお金の一部を暗号に投資することにしました。\n私はそれについて少し知っていて、比較的うまくいっているからです。父は暗号について何も知りませんが\n私を信頼し、ボラティリティーを認めています。私は決して父に暗号に投資するように説得したわけではありません。\n説得したわけではありません。そうは言っても、ここでは何が起こったのか。\n\nI...",
      "title": "父が暗号について何も知らない状態で、父のお金を投資し始めたのですが、ここで面白いことが起こりました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "首先，我父亲让我把他的一些钱投资到加密货币上，因为我对它有点了解，而且我做得比较好。\n我对它有一些了解，而且我做得比较好。他对加密货币一无所知，但\n信任我，并承认其波动性。我绝不是在说服他投资\n在加密货币中。说了这么多，事情是这样的。\n\nI...",
      "title": "我开始投资我父亲的钱，而他对加密货币一无所知，这里发生了一件有趣的事情。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，我父親讓我把他的一些錢投資到加密貨幣上，因爲我對它有點了解，而且我做得比較好。\n我對它有一些瞭解，而且我做得比較好。他對加密貨幣一無所知，但\n信任我，並承認其波動性。我絕不是在說服他投資\n在加密貨幣中。說了這麼多，事情是這樣的。\n\nI...",
      "title": "我開始投資我父親的錢，而他對加密貨幣一無所知，這裏發生了一件有趣的事情。"
    }
  ]
}