{
  "author": "ricky_jxmmy01",
  "original_created_utc": 1658637827,
  "title": "What's your most cringey moment that still haunts you?",
  "created_utc": 1658662273,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll go first,\nThere was this day at the campus cafeteria when I went to get lunch. I saw this girl sitting alone at a table and I went and joined her (I am not really good at talking to girls generally). But that day I decided to overcome my social anxiety and went ahead a started a conversation. I then offered to buy her a drink (soda). She said she&amp;#39;s okay and I misunderstood her and went ahead to get some drinks. I came back and she looked at me, confused. She then excused herself and left saying she had something else to do. I, then, remained there standing like a fucking clown with two sodas in my hand. I don&amp;#39;t think anyone saw it but everytime I think about it it just breaks my heart. I must be the weirdest guys she&amp;#39;s ever seen.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 111,
  "permalink": "/r/TooAfraidToAsk/comments/w6nbx3/whats_your_most_cringey_moment_that_still_haunts/",
  "subreddit": "TooAfraidToAsk",
  "id": "w6nbx3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'll go first, There was this day at the campus cafeteria when I went to get\nlunch. I saw this girl sitting alone at a table and I went and joined her (I am\nnot really good at talking to girls generally). But that day I decided to\novercome my social anxiety and went ahead a started a conversation.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が最初に行きます。ある日、キャンパスのカフェテリアに、私が\n昼食を取りに行ったときのことです。一人でテーブルに座っている女の子を見かけたので、その子のところに行きました。\n女の子と話すのは苦手なんです。） しかし、その日、私は社交不安を克服しようと決心し\nその日、私は社交不安を克服しようと決心し、会話を始めたのです...。",
      "title": "今でも忘れられない、最もヒヤヒヤした瞬間は？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我先说，有一天在校园食堂，我去拿\n午餐。我看到一个女孩独自坐在一张桌子旁，我就去加入了她的行列（我一般不擅长与女孩交谈）。\n我一般不擅长和女孩说话）。但那一天我决定\n克服了我的社交焦虑，并继续开始了对话....。",
      "title": "你最令人畏惧的时刻是什么，至今仍困扰着你？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我先說，有一天在校園食堂，我去拿\n午餐。我看到一個女孩獨自坐在一張桌子旁，我就去加入了她的行列（我一般不擅長與女孩交談）。\n我一般不擅長和女孩說話）。但那一天我決定\n克服了我的社交焦慮，並繼續開始了對話....。",
      "title": "你最令人畏懼的時刻是什麼，至今仍困擾着你？"
    }
  ]
}