{
  "author": "Alterationexpert",
  "original_created_utc": 1631587103,
  "title": "Algorand chosen for European stablecoins and by Colombia for vaccine passports",
  "created_utc": 1631608923,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Algorand making big moves again. Besides being recently adopted by El Salvador, it seems like they are continuing to make big steps to intergovernmental legitimacy.</p>\n\n<p>Algorand has been chosen for the creation of European stablecoins with E-money. Additionally, the Colombian government also announced they would be using the Algorand blockchain for their vaccine passports.</p>\n\n<p>It seems when everyone has been looking at ADA and SOL, ALGO has been making real progress.</p>\n\n<p>Maybe because they are scaling up to 46K TPS by the end of this year?</p>\n\n<p>Open discussion on this development, feel free to provide more information if you have it.</p>\n</div><!-- SC_ON -->",
  "score": 161,
  "permalink": "/r/CryptoCurrency/comments/pnu4ca/algorand_chosen_for_european_stablecoins_and_by/",
  "subreddit": "CryptoCurrency",
  "id": "pnu4ca",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Algorand making big moves again. Besides being recently adopted by El Salvador,\nit seems like they are continuing to make big steps to intergovernmental\nlegitimacy.\n\nAlgorand has been chosen for the creation of European stablecoins with E-money.\nAdditionally, the Colombian government also announced…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アルゴランドがまた大きく動き出した。最近、エルサルバドルで採用されたほか\nエルサルバドルで採用されただけでなく、政府間の正統性への大きな一歩を踏み出し続けているようです。\nアルゴランドは、最近エルサルバドルで採用されただけでなく、政府間の正当性に向けて大きなステップを続けているようです。\n\nアルゴランドは、Eマネーを使ったヨーロッパの安定したコインの作成に選ばれました。\nさらに、コロンビア政府も発表...",
      "title": "アルゴランドはヨーロッパの安定コインに、コロンビアはワクチンパスポートに選ばれました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "阿尔戈兰再次做出大动作。除了最近被萨尔瓦多采用外。\n看起来他们正在继续向政府间的合法性迈出大步。\n合法性。\n\nAlgorand已经被选为欧洲稳定币与电子货币的创建者。\n此外，哥伦比亚政府还宣布...",
      "title": "欧洲稳定币选择Algorand，哥伦比亚选择Algorand为疫苗护照。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "阿爾戈蘭再次做出大動作。除了最近被薩爾瓦多采用外。\n看起來他們正在繼續向政府間的合法性邁出大步。\n合法性。\n\nAlgorand已經被選爲歐洲穩定幣與電子貨幣的創建者。\n此外，哥倫比亞政府還宣佈...",
      "title": "歐洲穩定幣選擇Algorand，哥倫比亞選擇Algorand爲疫苗護照。"
    }
  ]
}