{
  "author": "tadhg8811",
  "the_new_excerpt": "2020 was a bumper year for tech IPOs. Companies like Snowflake, Airbnb, Doordash\nand Palantir* have been standout IPOs this year. Snowflake’s IPO was the biggest\nUS software IPO in history while Palantir’s stock price has more than doubled\nsince going public in September.\n\nIt looks like this IPO…",
  "original_created_utc": 1608327733,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "2020年是科技公司IPO的丰收年。雪花、Airbnb、DoorDash等公司\n和Palantir*都是今年表现突出的首次公开募股(IPO)。雪花的首次公开募股是最大的\n美国软件历史上首次公开募股，而Palantir的股价上涨了一倍多\n自从9月份上市以来。\n\n看起来这个首次公开募股的…",
      "title": "2021年值得关注的5宗IPO"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "2020年是科技公司IPO的豐收年。雪花、Airbnb、DoorDash等公司\n和Palantir*都是今年表現突出的首次公開募股(IPO)。雪花的首次公開募股是最大的\n美國軟件歷史上首次公開募股，而Palantir的股價上漲了一倍多\n自從9月份上市以來。\n\n看起來這個首次公開募股的…",
      "title": "2021年值得關注的5宗IPO"
    }
  ],
  "title": "5 IPOs to watch for in 2021",
  "created_utc": 1608342110,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>2020 was a bumper year for tech IPOs. Companies like Snowflake, Airbnb, Doordash and Palantir* have been standout IPOs this year. Snowflake’s IPO was the biggest US software IPO in history while Palantir’s stock price has more than doubled since going public in September.</p>\n\n<p>It looks like this IPO trend could continue well into 2021 with some of the biggest names in tech expected to go public. Here are 5 of the most anticipated IPOs for 2021.</p>\n\n<p><strong><em>\\</em>Note:</strong>* <em>Palantir went public via a direct listing, not an IPO.</em></p>\n\n<h3>1. Robinhood</h3>\n\n<p>The stock-trading platform looks set to go public in 2021.</p>\n\n<p>2020 has been a massive year for Robinhood. In Q2 of 2020, they made revenue of $180 million. Up from $91 million in Q1 of this year. Revenue growth of 100% in a single quarter is incredibly impressive.</p>\n\n<p>Robinhood hasn’t been without controversy this year. Many people cite the app’s popularity as a big contributing factor into the high market volatility we’ve seen.</p>\n\n<p>Robinhood’s growth plans seem to be centered around providing more financial products to its US customers, as opposed to expanding into international markets. It launched Robinhood Crypto in 2018 and a 1.8% interest rate savings account in 2019. This was around the same time that plans to launch in the UK and Australia were postponed. It will be interesting to see how this growth strategy plays out and if international expansion gets a renewed focus in the future.</p>\n\n<p>All of the signs seem to be pointing to an IPO in the first half of 2021. A Reuters report states that Robinhood have partnered with Goldman Sachs to begin IPO preparations at an expected valuation of over $20 billion.</p>\n\n<h3>2. Gitlab</h3>\n\n<p>While not a household name, Gitlab is an impressive company that looks set to go public in 2021. Gitlab is a SaaS company that markets a DevOps platform which allows their customers to build software more efficiently.</p>\n\n<p>Gitlab is an interesting company to say the least. All of its employees are fully remote. Meaning that Gitlab doesn’t have a corporate office and employees can work from anywhere in the world. Gitlab is a proponent of the “open-source” software model and sells its software under an “open-core” business model. This is where the core functionality is released under an open-source (MIT) license while the additional functionality is under a proprietary license.</p>\n\n<p>Gitlab’s business has been performing very well. When it last raised money in September 2019, it announced that its revenue growth rate was 140% year over year. In January of 2020, Gitlab hit an annual revenue run rate of $120 million.</p>\n\n<p>Gitlab had originally planned on going public in November of this year. But in May, they decided to hold off on these plans due to the uncertain economic outlook at the time. However with the recent performance of tech IPO’s, you can expect that they will be going public sooner rather than later.</p>\n\n<p>Gitlab is currently valued at over $6 billion, after shares were sold in the secondary market in September of this year. That’s more than double its valuation when it raised money in September 2019.</p>\n\n<h3>3. Stripe</h3>\n\n<p>Stripe is a SaaS company that provides payment processing services and other financial products to businesses of all sizes.</p>\n\n<p>Stripe is one of the most valuable startups in the world. Its most recent round of funding valued the company at $36 billion.</p>\n\n<p>Revenue numbers are hard to come by for Stripe, but a recent interview with co-founder John Collison shows the scale of the business:</p>\n\n<blockquote>\n<p><em>Mr Collison said that 200,000 new businesses have signed up with Stripe since March. “Those businesses, since March, have already processed more than $20 billion in revenue,” he said.</em></p>\n</blockquote>\n\n<p>Stripe typically charges 2.9% per transaction. So a back-of-the-envelope calculation shows that Stripe earned almost $600 million since March <strong>ONLY</strong> from companies that have signed up to Stripe since March. Their actual revenue numbers are obviously much higher.</p>\n\n<p>There is no hard evidence that Stripe will go public in 2021. In fact, in the same interview, Mr.Collison stated that “We have no plans to IPO”. However, a recent major partnership with Salesforce and the hiring of a high-profile CFO from General Motors seems to signal that an IPO might not be too far off.</p>\n\n<h3>4. Bumble</h3>\n\n<p>Bumble is a dating app with a twist - on Bumble, only women can make the first move when a man and a women ‘match’.</p>\n\n<p>Match Group (owners of Tinder) are the major player in the online dating space. But Bumble seems to be catching up. Bumble posted revenue of $240 million in 2019 and has 100 million users as of 2020.</p>\n\n<p>Bumble’s growth strategy seems similar to that of Tinder in that it offers premium features such as “Bumble Boost”. But a key part of their growth strategy also seems to be to move outside of just dating. They recently launched two major products; BFF helps you to meet new friends while BIZZ helps you to network more effectively.</p>\n\n<p>According to a Bloomberg report, Bumble just recently confidentially filed for an IPO in February 2021. The expected valuation range is $6-8 billion.</p>\n\n<h3>5. Instacart</h3>\n\n<p>2020 has been a massive year for the grocery-delivery company, Instacart.</p>\n\n<p>Similar to other delivery companies like Doordash, the pandemic brought on a massive spike in demand for Instacart. In March, order volume on the platform jumped by over 500%.</p>\n\n<p>Instacart’s valuation has grown in line with its order volume this year. It grew from $7.9 billion at the beginning of 2020 to more than $17 billion by October.</p>\n\n<p>Instacart looks set to be planning an IPO for 2021. A recent Financial Times report stated that the company is consulting with banks ahead of a potential IPO in early 2021.</p>\n\n<p>&#x200B;</p>\n\n<p>What IPOs are you most excited for in 2021?</p>\n</div><!-- SC_ON -->",
  "score": 547,
  "permalink": "/r/investing/comments/kfuc0v/5_ipos_to_watch_for_in_2021/",
  "subreddit": "investing",
  "id": "kfuc0v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609260493086
}