{
  "author": "wai_bother",
  "original_created_utc": 1631488913,
  "title": "Help!!! How do I begin to address a very sudden and upsetting infestation with maggots?",
  "created_utc": 1631510378,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Woke up this morning, feeling on top of the world.</p>\n\n<p>Got up, did yard work, helped my neighbor tackle a couple home improvement projects. </p>\n\n<p>Came back 3 hours later. Greeted the dog, as is tradition, she was very excited to see me. She sleeps on the bed all the time, she&#39;s getting older. </p>\n\n<p>As I approached the bed, I see something very unusual surround ing my bed at the sides and foot area. Didnt remember spilling rice all over the damn bedroom. Wtf?</p>\n\n<p>It wasn&#39;t rice. It was thousands of maggots. Like apocalyptic. Wtf??</p>\n\n<p>Immediately checked the dog ( who seemed concerned about my sudden concern).</p>\n\n<p>I ran to my nearly empty trashcan in the kitchen. Nothing. </p>\n\n<p>Checked every book and cranny around the bedroom, drains, fishtanks, under the bed while squatting over and amongst the hoarde of maggots surrounding it. Just let that sink in. It was fucking terrible. </p>\n\n<p>I ran like a fucking maniac from corner to corner, room to room, trying to figure out what in God&#39;s name would have spawned these maggots? My house is really clean, I recently spent a couple days  organizing and decluttering the week before. There is no food source nor smell of decay. </p>\n\n<p>And then it hit me. The opossum that had been breaking and entering, to eat dog food often in the mornings. I played cat and mouse, or human and marsupial, I guess, sealing off every entry point he managed to make over the past several months. Haven&#39;t seen him in a couple weeks now. </p>\n\n<p>He just is trapped, and rotting, somewhere inside of the walls, floor, ceiling? Where and how do I even start? </p>\n\n<p>Removed my dog and quarantined her with family, for obvious reasons. Sprayed the many hundreds of maggots in the bedroom with insecticide and dumped salt on them. Left. I&#39;m waiting for them to dessicate for a couple hours, and then hypothetically vaccum them up before burning the vacuum ceremoniously. </p>\n\n<p>This is a fucking nightmare.</p>\n\n<p>Has anyone had something like this happen? How did you fix it?</p>\n\n<p>I&#39;m pretty sure the most likely plan of action will be burning down my house and assuming a new identity. Please talk some sense into me.</p>\n</div><!-- SC_ON -->",
  "score": 110,
  "permalink": "/r/NoStupidQuestions/comments/pn3j5q/help_how_do_i_begin_to_address_a_very_sudden_and/",
  "subreddit": "NoStupidQuestions",
  "id": "pn3j5q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Woke up this morning, feeling on top of the world.\n\nGot up, did yard work, helped my neighbor tackle a couple home improvement\nprojects.\n\nCame back 3 hours later. Greeted the dog, as is tradition, she was very excited\nto see me. She sleeps on the bed all the time, she's getting older.\n\nAs I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今朝、世界の頂点に立っているような気分で目覚めた。\n\n起きて、庭仕事をして、近所の人が家の改修工事をするのを手伝って\nプロジェクトを手伝った。\n\n3時間後に戻ってきた。いつものように犬に挨拶すると、彼女はとても興奮していた。\n私を見てとても興奮していました。彼女はいつもベッドの上で寝ているが、年をとったものだ。\n\n私は...",
      "title": "助けてください!!! 急にウジ虫が発生して動揺しているのですが、どのように対処を始めればよいでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今天早上醒来时，感觉自己站在了世界之巅。\n\n起床后，做了院子里的工作，帮助我的邻居解决了几个家庭装修项目\n项目。\n\n3个小时后回来了。和狗打招呼，按照传统，她非常兴奋地\n看到我。她一直睡在床上，她越来越老了。\n\n当我...",
      "title": "帮助！！！！！。我如何开始解决一个非常突然和令人不安的蛆虫侵扰？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天早上醒來時，感覺自己站在了世界之巔。\n\n起牀後，做了院子裏的工作，幫助我的鄰居解決了幾個家庭裝修項目\n項目。\n\n3個小時後回來了。和狗打招呼，按照傳統，她非常興奮地\n看到我。她一直睡在牀上，她越來越老了。\n\n當我...",
      "title": "幫助！！！！！。我如何開始解決一個非常突然和令人不安的蛆蟲侵擾？"
    }
  ]
}