{
  "author": "MGTOW_and_Bitcoin",
  "original_created_utc": 1627523029,
  "title": "Elizabeth Warren is a key part of the Legacy Financial system.",
  "created_utc": 1627541247,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Every fixed and entrenched Institution requires elements that pretend to be antagonistic to the institutions goals... without disrupting those institutions or their goals... the most fundamental goal of every institution is self-perpetuation.</p>\n\n<p>Elizabeth Warren and others who are not truly against the banking system are clearly being exposed as frauds who&#39;s purpose is clear by now (to any rational mind). Her role is to speak in the voice of dissent and outrage while going along with the program.</p>\n\n<p>The shit bag was supposed to represent the people who these banks have destroyed: Representatives like her are a persistent but inept part that placates to the masses... only telling them what they want to hear. </p>\n\n<p>But of course she is the perfect voice for financial institution to use at this moment to attack a real threat to those institutions... and make no mistake about it bitcoin is a real threat to an outdated dysfunctional Financial system but it&#39;s not a threat to the people who want access to financial sovereignty.</p>\n\n<p>I wonder how long the real people in charge debated before they arrived at some idiot like Elizabeth Warren as the perfect mouthpiece...</p>\n</div><!-- SC_ON -->",
  "score": 200,
  "permalink": "/r/Bitcoin/comments/otnxfp/elizabeth_warren_is_a_key_part_of_the_legacy/",
  "subreddit": "Bitcoin",
  "id": "otnxfp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Every fixed and entrenched Institution requires elements that pretend to be\nantagonistic to the institutions goals... without disrupting those institutions\nor their goals... the most fundamental goal of every institution is\nself-perpetuation.\n\nElizabeth Warren and others who are not truly against…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "固定され、定着した制度には、その制度の目標に対立するふりをする要素が必要です。\n制度やその目標を崩壊させることなく、制度の目標に対立するふりをする要素が必要です。\nすべての組織の最も基本的な目標は\n自己増殖です。\n\nエリザベス・ウォーレンやその他の人々は、本当に反対しているわけではありませんが...",
      "title": "エリザベス・ウォーレンはレガシー金融システムの重要な役割を担っています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "每一个固定的、根深蒂固的机构都需要一些假装与机构目标对立的因素。\n与机构目标对立的因素......而不破坏这些机构或其目标\n或其目标......每个机构的最基本目标是\n每个机构最基本的目标是自我延续。\n\n伊丽莎白-沃伦和其他不是真正反对...",
      "title": "伊丽莎白-沃伦是遗产金融系统的一个关键部分。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "每一個固定的、根深蒂固的機構都需要一些假裝與機構目標對立的因素。\n與機構目標對立的因素......而不破壞這些機構或其目標\n或其目標......每個機構的最基本目標是\n每個機構最基本的目標是自我延續。\n\n伊麗莎白-沃倫和其他不是真正反對...",
      "title": "伊麗莎白-沃倫是遺產金融系統的一個關鍵部分。"
    }
  ]
}