{
  "author": "kgentes",
  "original_created_utc": 1640134827,
  "title": "A Simple Plan: Building Bags via 1) Portfolio Selection, 2) Mining and 3) DCA",
  "created_utc": 1640205066,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A lot of people coming online in this sub will find a lot of recommendations. What coins to buy, when to do it, what industries etc. The problem is those are all scattered pieces of a larger picture.  I wanted to give a possible consideration of a simple strategy that I am moving towards in the last few months. Here are the basic core elements:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Funding&lt;/strong&gt;: you need to have a regular, monthly stream of cash you can invest into crypto. Many people can simply set aside a portion of their monthly savings for crypto investments. If you can, this is a one clean way to do it. For myself, I already have my savings set aside for other items and investments and this wasn&amp;#39;t what I chose to do. I chose to create a monthly revenue stream from mining crypto, and use the funds generated there to fuel my crypto investments. No matter what you do, before you decide to invest in crypto you should plan out what regular, and consistent course of money you will use for your investing.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Selection&lt;/strong&gt;: There are a lot of strategies for crypto investing. Market focus, trend focus, coin focus, value focus. Just like stocks there are a lot of different ways people determine what to buy.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Purchasing&lt;/strong&gt;: There are a number of different ways to buy in. One of the most popular, and generally recommended is called DCA- dollar cost averaging.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;All of the long time investors and crypto hodlers will laugh at how obvious some of this stuff is. But the truth is, there is so much weird chatter on this channel that a lot of clear and core ideas seem to be ignored. All I am doing here is giving my own &amp;quot;self-story&amp;quot; of how I do this. It is not what everyone can or should do. I am not providing advice, just an outline sketch of one idea- the outline I use. If it helps great. If you can steal parts of the ideas here to help yourself. Do it. Just read through this and see if it helps you in adding to your overall knowledge on crypto, and how to approach investing in it.&lt;/p&gt;\n\n&lt;h1&gt;Funding&lt;/h1&gt;\n\n&lt;p&gt;&lt;strong&gt;Investment funding&lt;/strong&gt;: first, I decided that I don&amp;#39;t want to invest additional money streams from my regular income to build my crypto portfolio. Instead, I decided to make an initial investment in building a mining rig, that would produce monthly income. Sounds simple enough. But it is not. It requires some work. It is also not truly feasible if you are not a tech savvy person. That said, if you know how to build your own PC, you can build a mining rig. There are several communities in reddit that can help you with learning how to build a mining rig. This is how I learned how to build my rig. Here is what my rig looks like in its present state. I have 7 GPUs mining crypto on this rig:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/le2cclu0o1781.jpg?width=4032&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=9ad25fd15d022217bff6e54ab4d1114c8e15b9ee\"&gt;Rig Back&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/lc488lz2o1781.jpg?width=4032&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=25ace7c2f3afe58a6ab717b258ecd538839bbe92\"&gt;Rig Front&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;After building my rig, I had to choose what software to mine with. In my case, I am currently just using a service called &lt;a href=\"https://NiceHash.com\"&gt;NiceHash.com&lt;/a&gt; since it is simple and easy to get started. In the future, I may move to HiveOS and mine more directly, but for now this is clean and easy.&lt;/p&gt;\n\n&lt;p&gt;For help with building your own mining rig, understanding how to use it, and setting up the software, I recommend the following resources:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Red Panda Mining  &lt;a href=\"https://www.redpandamining.com/\"&gt;Latest Videos • Red Panda Mining&lt;/a&gt; - this guy is a Canadian. So all their videos have that cool apologetic and low push feel. ha. Anyways, they are good advice. He does some technical deep stuff that a beginner won&amp;#39;t follow but get a hold of his older videos that explain simpler things and they are very helpful.&lt;/li&gt;\n&lt;li&gt;&lt;a href=\"https://rabidmining.com/\"&gt;Rabid Mining - Crypto Mining&lt;/a&gt; - another Canadian who is very good with crypto mining, rig details and lots of technical info on how to make your operational rig be more efficient. He focuses more on CPU mining, which I don&amp;#39;t care about, but his stuff on equipment, especially power related topics is very helpful. If you are building a rig, look through his videos.&lt;/li&gt;\n&lt;li&gt;&lt;a href=\"/r/NiceHash\"&gt;r/NiceHash&lt;/a&gt; - this is a good group that will help with learning how to set up the NiceHash software&lt;/li&gt;\n&lt;li&gt;&lt;a href=\"/r/gpumining\"&gt;r/gpumining&lt;/a&gt; - this is another good reddit group. They helped a lot with finding good information on building the hardware of the rig.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Monthly income: Many may wonder, how much will this kind of thing produce? In my simple case, the rig will bring in from 800 - 1000 per month, minus electricity costs (about $150 per month). I have been building this rig very slowly and been turning it off and on, getting my settings just right. Here is a sample of the report NiceHash produced for me as I was testing and building my rig:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/bdk6x4sbo1781.png?width=692&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=76123f46b1e25a581d5f233322f43ea335245944\"&gt;Mining Results&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Of course, this rig has not been run 100% 24/7 for an entire month. Once I complete my setup the regular 800/1000 income is the estimate.  The important thing here isn&amp;#39;t the exact amount, but the regular, steady income. The net income I get from this rig will be what I use to fuel my crypto investment.  But again, this is just part of &lt;strong&gt;my&lt;/strong&gt; story- I decided to make an initial investment into a mining rig that will be the source of future investments. This isn&amp;#39;t for everyone. You need to know that mining changes over time. Some coins (like ETH) are switching from POW (mining) to other kinds of operation. This means some coins will not be minable in the future (like ETH). You have to understand that and understand how to mine other coins or how to switch to other ways of mining if you want to stay doing this. Don&amp;#39;t choose mining if you aren&amp;#39;t ready to take on the technical and time challenges of staying with it.&lt;/p&gt;\n\n&lt;h1&gt;Selection &amp;amp; Research&lt;/h1&gt;\n\n&lt;p&gt;&lt;strong&gt;Research&lt;/strong&gt;: How someone purchases crypto should not be done without some forethought.  To do research, you need to find places that can provide you with helpful understanding of crypto in various ways. I will list some resources to consider and some crypto categories that I use.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Resources&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;One thing I highly recommend is that you do some good research on credible YouTube channels. My three favorite channels are:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;a href=\"https://www.paulbarronnetwork.com/\"&gt;Paul Barron Network&lt;/a&gt;  - this is a professional looking channel with lots of good content. The presentation is slick and information good. There are times when the channel seems a little cheesy because his research really isn&amp;#39;t anything that you couldn&amp;#39;t do on your own. But the big thing is- he has done it, and he does it fully time. Why spend all your own time gathering the data, when channels like this can do that work for you. He is US based, so all of the work he does is actually applicable to US investors. This is very good.&lt;/li&gt;\n&lt;li&gt;&lt;a href=\"https://www.youtube.com/c/MoneyZG\"&gt;MoneyZG - YouTube&lt;/a&gt;  - James is a UK based youtuber, who is a former stock broker on the London Stock exchange. He is actually really good at making things clear and understandable, yet will still explain the technical information about charts and make it helpful. I find his videos more practical than insightful- meaning he has a lot of &amp;quot;how to&amp;quot; and &amp;quot;3 steps&amp;quot; kinds of things for people learning how to get around in the crypto world. I really like most of his stuff, and if you are looking for good content, you should definitely check out his channel on whatever topic you need help on.&lt;/li&gt;\n&lt;li&gt;&lt;a href=\"https://www.youtube.com/c/ConorKenny\"&gt;Conor Kenny - YouTube&lt;/a&gt; - Conor is a simple youtuber, but he puts out a lot of videos. He also has a discord channel(s) that are pretty good. His stuff is still based on his 3 core premise of following the fear/greed index (buying in fear, selling in greed), watching the BTC fundamental charts, and always taking profits. A lot of his recommends are meme coins, so may be too risky for people. Also, he recommends a lot of things that are &lt;strong&gt;not&lt;/strong&gt; even available for US based people- he is very much into launch pads, none of which are even available to US investors due to KYC laws. I like Conor&amp;#39;s approach and suggestions, but not being US based makes it less useful for me.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;&lt;strong&gt;Portfolio Groups&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;In addition to those resources, you need to decide what kind of strategy you want to employ in purchasing crypto. For myself, I am looking at building a portfolio that contains 3 things:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;core crypto&lt;/li&gt;\n&lt;li&gt;strategic eco/tech solutions&lt;/li&gt;\n&lt;li&gt;metaverse/gaming crypto&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;I chose those 3 ways of grouping my crypto investment targets because I think they represent a good slice of what makes crypto valuable, unique and especially where its future growth lies.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Core Crypto&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;em&gt;Bitcoin&lt;/em&gt; - &lt;a href=\"https://bitcoin.org/\"&gt;[website]&lt;/a&gt; the digital store of value. The most popular blockchain and crypto in the world&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Ethereum&lt;/em&gt; - &lt;a href=\"https://ethereum.org/\"&gt;[website]&lt;/a&gt; the largest blockchain with application-enabled functionality.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;Strategic Blockchain Ecosystems/Technology&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;em&gt;Solana&lt;/em&gt; - [&lt;a href=\"https://solana.com/\"&gt;website&lt;/a&gt;] the fastest blockchain that actually works.&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Polygon&lt;/em&gt; - [&lt;a href=\"https://polygon.technology/\"&gt;website&lt;/a&gt;] a network/solution for connecting to Ethereum (called a layer 2 solution) that provides speed and ease of use for apps and people wanting to avoid the slow and costly fees of Ethereum&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Polkadot&lt;/em&gt; - [&lt;a href=\"https://polkadot.network/\"&gt;website&lt;/a&gt;] a solution for connecting other blockchains and creating complete cross-chain functionalities, breaking the reliance on single points of pain in other networks.&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Avalanche&lt;/em&gt; - [&lt;a href=\"https://www.avax.network/\"&gt;website&lt;/a&gt;] a smart contracts platform for creating custom blockchains and decentralized apps.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;Metaverse / Gaming&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;em&gt;Sandbox&lt;/em&gt; - [&lt;a href=\"https://discover.sandbox.game/\"&gt;website&lt;/a&gt;] NTF based gaming ecosystem. Large following. Eth based, but with new Polygon partnership. My top pick and my current DCA target.&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;BlockApeScissors&lt;/em&gt; - [&lt;a href=\"https://www.blockapescissors.com/\"&gt;website&lt;/a&gt;] gaming ecosystem. Some sample games already running.&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;StrikeX&lt;/em&gt; - [&lt;a href=\"https://strikex.com/\"&gt;website&lt;/a&gt;] chain solutions/tools (Dex/Cex and makers of the Tradestrike wallet)&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;RMRK&lt;/em&gt; - [&lt;a href=\"https://www.rmrk.app/\"&gt;website&lt;/a&gt;] NFT tech chain solution and tools&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Star Atlas&lt;/em&gt; - [&lt;a href=\"https://staratlas.com/\"&gt;website&lt;/a&gt;] a Solana based game that is very graphical and still in early stages.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;The above groups and cryptos are things I settled on for my initial portfolios. They are not the only ones I have invested in. For example, I held &lt;em&gt;Cardano&lt;/em&gt; (ADA) for several months. But the more I learned about this, the more it was clear to me that it will not be the future of crypto. Other solutions (like Solana) have already proven to be better technical solutions and with a much better adoption rate.  What you see above is just my current thinking, and it will remain dynamic as I continue to learn and build confidence in understanding the underlying value in these and other projects.&lt;/p&gt;\n\n&lt;p&gt;Of course, you don&amp;#39;t have to come up with the same groupings I did. But when you have done your research, come up with things you believe in.&lt;/p&gt;\n\n&lt;h1&gt;Purchasing&lt;/h1&gt;\n\n&lt;p&gt;My general strategy for purchasing is &lt;strong&gt;DCA&lt;/strong&gt; - &lt;strong&gt;dollar cost averaging&lt;/strong&gt;. This simply means that you invest a given amount of money on a regular basis into the same selected asset. I personally take a two-pronged approach:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;strong&gt;Weekly&lt;/strong&gt; - Invest in a single asset each week. For example, I invest $50 per week into Avalanche. There is not magic here. I simply have an automatic purchase of $50 a month buying up a little more AVAX.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Monthly&lt;/strong&gt; - Invest in a single asset each month. For example, I purchase about $500 a month in Polygon each month right now- I do this from the funds provided by mining.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;&lt;strong&gt;When to change the selected asset?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Currently, I am investing in AVAX (Avalanche) and MATIC (Polygon). But I won&amp;#39;t keep my DCA target on these coins forever. Instead, I will use a purchase limit to stop my DCA target of these assets and move to another asset in each case. For example, I will probably move my purchase of AVAX over to Polkadot in the near future. Likewise, once I reach my purchase limit on MATIC I will move the target to more Sandbox.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;How do I determine what to buy next?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Three things:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Once I hit a purchase limit on my current DCA, I look for other targets. For example, my current purchase limit is $2k into a single coin. So, when I reach 2k in a single asset, I move my DCA target to another worthy asset.&lt;/li&gt;\n&lt;li&gt;Even if item 1 is already met, I won&amp;#39;t move off of my DCA target to another target unless I have another target that looks like as good or better investment. Part of the goal of investing is to take risk for gains. The other part is to mitigate risk by spreading investments across multiple assets. For me, I believe that there are a lot of worthy crypto assets to invest in, so no shortage of targets to DCA into.&lt;/li&gt;\n&lt;li&gt;Finally, when I am ready to invest, I pick targets that are down in the current cycle against a) market and b) expectations.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;For example, I am about to DCA into Sandbox as my next selection. The reason is that the entire market has been down, and SAND is in a unique position of being a top Metaverse/gaming coin that is at a discount due to the recent sell off. This is easy to see when you look at the price charts for SAND. Below, are the 1 month, 1 week and 1 day price charts for SAND. This shows you how the coin has a recent decline (market flush). But it also shows you that in up sentiment the coin trends up quickly (see 1 day chart). SAND is one of the top metaverse plays. I believe it will be worth many multiples of its current price as mainstream adoption takes hold.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/b4aksw6po1781.jpg?width=1440&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=af1f831815ffd2c239e3b71706db8026c5174967\"&gt;One Month price SAND&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/62acqnj7p1781.jpg?width=1440&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=11a3f06786d3889bca75b3a359256c491a71d954\"&gt;One Week price SAND&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/hc4e2beap1781.jpg?width=1439&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=87043799e1f263655da25ff2067130a2764672e8\"&gt;One Day price SAND&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Resources for DCA and purchasing&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;based on comments to the post, I am adding the info on what apps I use to DCA&lt;/em&gt;.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;strong&gt;Weekly DCA&lt;/strong&gt; - Currently, I use &lt;a href=\"https://coinbase.com\"&gt;coinbase.com&lt;/a&gt; app for my weekly auto DCA ($50/week).  I know many people don&amp;#39;t like Coinbase, but for me the fees are as low or lower than any other FIAT to crypto conversion possible elsewhere.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Monthly DCA&lt;/strong&gt; - for my monthly DCA (approx. 500/month), I do purchases those directly on the dex (decentralized exchange) or cex (centralized exchange) locations as required by the coin. For example, I use &lt;a href=\"https://kucoin.com\"&gt;kucoin.com&lt;/a&gt; app (cex) for purchasing some unique cryptos like RMRK. BSC (Binance smart chain) coins I buy directly on &lt;a href=\"https://pancakeswap.finance\"&gt;pancakeswap.finance&lt;/a&gt; (dex). Ethereum network coins I sometimes buy using &lt;a href=\"https://Flooz.trade\"&gt;Flooz.trade&lt;/a&gt; (dex).&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;h1&gt;Final thought&lt;/h1&gt;\n\n&lt;p&gt;I highly encourage you to consider coming up with your own plan for crypto. Perhaps some of these ideas will help you. I hope so.&lt;/p&gt;\n\n&lt;p&gt;Also, if you have any feedback regarding anything my post, please share a comment and I will update the post with your feedback if applicable. Thanks for making this a great community!&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/rlszz0/a_simple_plan_building_bags_via_1_portfolio/",
  "subreddit": "CryptoCurrency",
  "id": "rlszz0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "A lot of people coming online in this sub will find a lot of recommendations.\nWhat coins to buy, when to do it, what industries etc. The problem is those are\nall scattered pieces of a larger picture. I wanted to give a possible\nconsideration of a simple strategy that I am moving towards in the last…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブでオンラインに来る多くの人は、たくさんのおすすめ情報を見つけることができます。\nどのコインを買うか、いつ買うか、どの業界で買うか、などなど。問題は、それらが\nは、大きな絵の中の散らばった断片です。私は、可能性のあるものを提供したいと思いました。\n最後に私が向かっているシンプルな戦略の考察を...",
      "title": "シンプルな計画 1）ポートフォリオ選択、2）マイニング、3）DCAによるバッグの構築"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "很多人在这个子里上网会发现有很多推荐。\n买什么币，什么时候买，什么行业等等。问题是这些都是\n问题是这些都是一个大画面中的零散部分。我想给出一个可能的\n考虑一个简单的策略，我正朝着这个方向努力。",
      "title": "一个简单的计划。通过1）投资组合选择，2）采矿和3）DCA建立袋子"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "很多人在這個子裏上網會發現有很多推薦。\n買什麼幣，什麼時候買，什麼行業等等。問題是這些都是\n問題是這些都是一個大畫面中的零散部分。我想給出一個可能的\n考慮一個簡單的策略，我正朝着這個方向努力。",
      "title": "一個簡單的計劃。通過1）投資組合選擇，2）採礦和3）DCA建立袋子"
    }
  ]
}