{
  "author": "WhoAmIEven2",
  "original_created_utc": 1633261539,
  "title": "Why do we work so much still even though modern society could allow for less hours?",
  "created_utc": 1633287132,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Get up at 06, go to work at 8, get home at 18 and then make dinner, go to the gym and then finally having like an hour of free time. Repeat 5 days a week, 46-47 weeks per year. </p>\n\n<p>It&#39;s like all we do is live to work. In the past you HAD to work to survive, but in today&#39;s world we don&#39;t have to. We could easily have 4 day weeks or at least cut the 5 day week by 2 hours every day. There are always people looking for work, so there would not be any gaps where nothing is being done, in those areas that use rotating schedule. </p>\n\n<p>Is it just because of greed? I know they tried 4 day work weeks in finland in a limited area and it worked great, and I know some parties here in Sweden have discussed it as well, but nothing seems to happen.</p>\n</div><!-- SC_ON -->",
  "score": 108,
  "permalink": "/r/NoStupidQuestions/comments/q0g5o6/why_do_we_work_so_much_still_even_though_modern/",
  "subreddit": "NoStupidQuestions",
  "id": "q0g5o6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Get up at 06, go to work at 8, get home at 18 and then make dinner, go to the\ngym and then finally having like an hour of free time. Repeat 5 days a week,\n46-47 weeks per year.\n\nIt's like all we do is live to work. In the past you HAD to work to survive, but\nin today's world we don't have to. We…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "朝6時に起きて、8時に仕事に行き、18時に帰宅して、夕食を作り、ジムに行って\nその後、1時間ほどの自由時間があります。これを週に5日繰り返す。\n1年に46〜47週。\n\nまるで、働くために生きているかのようです。昔は働かないと生きていけませんでした。\n今日の世界では、その必要はありません。私たちは...",
      "title": "現代社会では労働時間が短縮できるにもかかわらず、なぜ私たちはこんなにも働いているのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "6点起床，8点上班，18点回家，然后做晚饭，去健身房，最后有一个小时的自由时间。\n健身房，然后最后有一个小时的自由时间。每周重复5天。\n每年46-47周。\n\n就像我们所做的一切是为了工作而生活。在过去，你必须工作才能生存，但是\n但在今天的世界里，我们不必如此。我们...",
      "title": "尽管现代社会可以允许减少工作时间，但为什么我们仍然工作得那么多？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "6點起牀，8點上班，18點回家，然後做晚飯，去健身房，最後有一個小時的自由時間。\n健身房，然後最後有一個小時的自由時間。每週重複5天。\n每年46-47周。\n\n就像我們所做的一切是爲了工作而生活。在過去，你必須工作才能生存，但是\n但在今天的世界裏，我們不必如此。我們...",
      "title": "儘管現代社會可以允許減少工作時間，但爲什麼我們仍然工作得那麼多？"
    }
  ]
}