{
  "author": "Lopsided-Signature87",
  "original_created_utc": 1640371524,
  "title": "What Crypto do you think was hyped a lot in 2021 but has no value ?",
  "created_utc": 1640393166,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;We all know how crypto was in 2021 and seeing nearly 700 cryptos coming in and going out everyday was a lot in which nearly everything was a memecoin.&lt;/p&gt;\n\n&lt;p&gt;But even for coins in top100 , there were a lot which was hyped for its project but it never really performed for the hype it had. ICP is the best Crypto is name in this sub and how everyone thought it will revolutionize the entire internet but just to fall 90% from its high.&lt;/p&gt;\n\n&lt;p&gt;What are the coins you felt like was nothing but hype or the coins that are making some greats returns are nothing but just hype and will eventually come down like most of the Alts in the bear run we had and merry Christmas everyone&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 164,
  "permalink": "/r/CryptoCurrency/comments/rns9l2/what_crypto_do_you_think_was_hyped_a_lot_in_2021/",
  "subreddit": "CryptoCurrency",
  "id": "rns9l2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "We all know how crypto was in 2021 and seeing nearly 700 cryptos coming in and\ngoing out everyday was a lot in which nearly everything was a memecoin.\n\nBut even for coins in top100 , there were a lot which was hyped for its project\nbut it never really performed for the hype it had. ICP is the best…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2021年に暗号がどのようになったか、700近い暗号が出入りしているのを見て、皆知っています。\n毎日出て行くのは、ほとんどすべてがメメコインという状態でした。\n\nしかしトップ100に入ったコインでさえも そのプロジェクトが誇張されたものがたくさんありました\nしかし、その誇大広告に見合ったパフォーマンスを発揮することはなかった。ICPは最高です...",
      "title": "2021年に大々的に宣伝されたものの、何の価値もない暗号は何だと思いますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们都知道加密货币在2021年的情况，看到每天有近700个加密货币进入和流出，这在当时是非常大的挑战。\n几乎所有的东西都是memecoin。\n\n但即使是前100名的硬币，也有很多因其项目而被炒作的。\n但它从来没有真正表现出它的炒作价值。ICP是最好的...",
      "title": "你认为哪种加密货币在2021年被炒得很热，但没有价值？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們都知道加密貨幣在2021年的情況，看到每天有近700個加密貨幣進入和流出，這在當時是非常大的挑戰。\n幾乎所有的東西都是memecoin。\n\n但即使是前100名的硬幣，也有很多因其項目而被炒作的。\n但它從來沒有真正表現出它的炒作價值。ICP是最好的...",
      "title": "你認爲哪種加密貨幣在2021年被炒得很熱，但沒有價值？"
    }
  ]
}