{
  "author": "Sockpuppet009",
  "the_new_excerpt": "Are they the same name but written differently because of nonstandardized\nspelling?\n\nAre they different names, but just happen to be spelt very similarly?\n\nDid people change letters in names like that a lot and are there other examples?\n\nWas it common to name your kid after something important to…",
  "original_created_utc": 1622921941,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "同じ名前なのに、標準化されていないために違う表記になっている。\nスペルが違うのでしょうか？\n\n別の名前だが、たまたま似たような綴りになっているのか？\n\nこのように名前の文字を変えることはよくあったのでしょうか？また、他にも例があるのでしょうか？\n\n自分の子供に何か重要なことを名前にするのは一般的だったのでしょうか？",
      "title": "シェイクスピアは『ハムレット』を書き、『ハムネット』という息子をもうけた。それがどうした？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "它们是否是同一个名字，但由于非标准化的拼写而写得不同？\n拼写？\n\n它们是不同的名字，但只是碰巧拼写得非常相似？\n\n人们是否经常改变名字中的字母，是否有其他的例子？\n\n以重要的东西给孩子取名是很常见的。",
      "title": "莎士比亚写了《哈姆雷特》，有一个儿子叫哈姆雷特。那是怎么回事？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "它們是否是同一個名字，但由於非標準化的拼寫而寫得不同？\n拼寫？\n\n它們是不同的名字，但只是碰巧拼寫得非常相似？\n\n人們是否經常改變名字中的字母，是否有其他的例子？\n\n以重要的東西給孩子取名是很常見的。",
      "title": "莎士比亞寫了《哈姆雷特》，有一個兒子叫哈姆雷特。那是怎麼回事？"
    }
  ],
  "title": "Shakespeare wrote Hamlet and had a son called Hamnet. What's up with that?",
  "created_utc": 1622973654,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Are they the same name but written differently because of nonstandardized spelling? </p>\n\n<p>Are they different names, but just happen to be spelt very similarly?</p>\n\n<p>Did people change letters in names like that a lot and  are there other examples?</p>\n\n<p>Was it common to name your kid after something important to you but change a letter for some reason. Like, my dad is called Jason but I could call my son Jalon or something. </p>\n\n<p>Why did he even name his son that? Was it a common name?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/nt3l5t/shakespeare_wrote_hamlet_and_had_a_son_called/",
  "subreddit": "AskHistorians",
  "id": "nt3l5t",
  "is_self": true,
  "media": null,
  "is_video": false
}