{
  "author": "baksiboi",
  "the_new_excerpt": "Dear Bogleheads I need your help with some argumentative convincing. I'm in no\nway a financial expert so I don't have the knowledge to do so myself.\n\nSo, I've decided to get my dad into this style of investing, but knowing him he\nwould just say \"aah it's all a lottery\". But I believe if I can show…",
  "original_created_utc": 1621766847,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Dear Bogleheads I need your help with some argumentative convincing. 私は金融の専門家ではありません。\n私は金融の専門家ではないので、自分で説得する知識がありません。\n\nそこで、父をこの投資スタイルに参加させることにしたのですが、父のことですから\nしかし、父は「宝くじみたいなものだ」と言うでしょう。しかし、私は、もし私が父にこのスタイルを教えることができれば、父は「宝くじだ」と言うでしょう。",
      "title": "2008年のような大きな市場の暴落に対して、ボーグル・メソッドはどのように持ちこたえるのでしょうか？父を説得したいのですが。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "亲爱的Bogleheads，我需要你帮助我做一些有说服力的论证。我不是\n我不是一个金融专家，所以我自己没有知识来做这些。\n\n所以，我决定让我的父亲加入这种投资方式，但是了解他的人都知道他\n只会说 \"啊，这都是彩票\"。但我相信，如果我能够向他展示...",
      "title": "博格尔方法在面对像2008年那样的大市场崩溃时是如何坚持的？我需要帮助说服我的父亲。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "親愛的Bogleheads，我需要你幫助我做一些有說服力的論證。我不是\n我不是一個金融專家，所以我自己沒有知識來做這些。\n\n所以，我決定讓我的父親加入這種投資方式，但是瞭解他的人都知道他\n只會說 \"啊，這都是彩票\"。但我相信，如果我能夠向他展示...",
      "title": "博格爾方法在面對像2008年那樣的大市場崩潰時是如何堅持的？我需要幫助說服我的父親。"
    }
  ],
  "title": "How does the Bogle method hold up against the big market crashes like in 2008.? I need help convincing my father.",
  "created_utc": 1621775880,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Dear Bogleheads I need your help with some argumentative convincing. I&#39;m in no way a financial expert so I don&#39;t have the knowledge to do so myself.</p>\n\n<p>So, I&#39;ve decided to get my dad into this style of investing, but knowing him he would just say &quot;aah it&#39;s all a lottery&quot;. But I believe if I can show him that the Bogle method can and has survived even through all the biggest market crises of our time, then he would be more inclined to put some money into this rather than have it sitting on a bank account.</p>\n\n<p>Do you have any arguments for convincing such a person to invest?</p>\n</div><!-- SC_ON -->",
  "score": 109,
  "permalink": "/r/Bogleheads/comments/nj5bpm/how_does_the_bogle_method_hold_up_against_the_big/",
  "subreddit": "Bogleheads",
  "id": "nj5bpm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197387108
}