{
  "author": "MomoXono",
  "original_created_utc": 1637606561,
  "title": "In 1974, ABBA famously performed the hit song “Waterloo” live at Eurovision and won the contest. What was there any outrage across the French populace to a song celebrating the fall of Napoleon winning a contest intended to promote European unity?",
  "created_utc": 1637633231,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>edit: Sorry I botched the title. The question was supposed to be: Was there any outrage across the French populace to a song celebrating the fall of Napoleon winning a contest intended to promote European unity?</p>\n</div><!-- SC_ON -->",
  "score": 111,
  "permalink": "/r/AskHistorians/comments/qzsfl4/in_1974_abba_famously_performed_the_hit_song/",
  "subreddit": "AskHistorians",
  "id": "qzsfl4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "edit: Sorry I botched the title. The question was supposed to be: Was there any\noutrage across the French populace to a song celebrating the fall of Napoleon\nwinning a contest intended to promote European unity?",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "edit: タイトルを間違えてしまいました。質問は次のようなものでした。というものでした。\nナポレオンの没落を祝う歌が、ヨーロッパの統一を目的としたコンテストで優勝したことに、フランス国民は怒りを覚えたか？\nヨーロッパの統一を目的としたコンテストで、ナポレオンの没落を祝う歌が優勝したことに、フランス国民は怒りを感じたか？",
      "title": "1974年、ABBAがユーロビジョンでヒット曲「Waterloo」をライブ演奏し、優勝したのは有名な話です。ヨーロッパの統一を目的としたコンテストで、ナポレオンの没落を讃える歌が優勝したことに、フランス国民はどのような憤りを感じたのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "编辑：对不起，我把标题写错了。这个问题应该是。是否有任何\n法国民众对一首庆祝拿破仑倒台的歌曲赢得旨在促进欧洲统一的比赛是否感到愤怒？\n赢得旨在促进欧洲统一的比赛，法国民众对此是否感到愤怒？",
      "title": "1974年，ABBA在欧洲电视网现场演唱了著名的热门歌曲《滑铁卢》，并赢得了比赛。法国民众对一首庆祝拿破仑倒台的歌曲赢得旨在促进欧洲团结的比赛有什么愤怒的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "編輯：對不起，我把標題寫錯了。這個問題應該是。是否有任何\n法國民衆對一首慶祝拿破崙倒臺的歌曲贏得旨在促進歐洲統一的比賽是否感到憤怒？\n贏得旨在促進歐洲統一的比賽，法國民衆對此是否感到憤怒？",
      "title": "1974年，ABBA在歐洲電視網現場演唱了著名的熱門歌曲《滑鐵盧》，並贏得了比賽。法國民衆對一首慶祝拿破崙倒臺的歌曲贏得旨在促進歐洲團結的比賽有什麼憤怒的？"
    }
  ]
}