{
  "author": "mx_prepper",
  "the_new_excerpt": "I am a hodler. This is my story of how $15 USD got me a house. The common\nmortgage in my country is 30 years at 12%. Thats a lot. I bought 2 years ago at\nthat rate.\n\nYears ago there were \"revenue share\" scam sites popping up everywhere. I knew\nthey were a scam, but heard of a couple that were…",
  "original_created_utc": 1610054283,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我是霍德勒家的人。这是我用15美元买到房子的故事。普通的\n我们国家的抵押贷款利率是30年，利率是12%。那太多了。我两年前在\n这个价格。\n\n几年前，到处都是“收入分成”的诈骗网站。我知道\n他们是个骗局，但听说有一对夫妇是…",
      "title": "今天我到达了我的月亮"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是霍德勒家的人。這是我用15美元買到房子的故事。普通的\n我們國家的抵押貸款利率是30年，利率是12%。那太多了。我兩年前在\n這個價格。\n\n幾年前，到處都是“收入分成”的詐騙網站。我知道\n他們是個騙局，但聽說有一對夫婦是…",
      "title": "今天我到達了我的月亮"
    }
  ],
  "title": "Today I reached my Moon",
  "created_utc": 1610085644,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am a hodler. This is my story of how $15 USD got me a house. The common mortgage in my country is 30 years at <strong><em>12%</em></strong>. Thats a lot.  I bought 2 years ago at that rate. </p>\n\n<p>Years ago there were &quot;revenue share&quot; scam sites popping up everywhere. I knew they were a scam, but heard of a couple that were actually paying. As you know, these scam sites  really pay out at the beginning to draw in more people. I decided to give it a go with $15. These sites allowed to withdraw either dollars or Bitcoin. I completed my &#39;daily tasks&#39; (clicking on ads) and managed to withdraw about 4 BTC before they scammed out and disappeared. </p>\n\n<p>It wasnt worth a whole lot at the time, but I hodled. I eventually bought a little more here and there when the price seemed good and had some extra cash around. I also spent a little, but held most of it. I was very tempted to sell in December 2017, but I HODLED. It dropped like a rock, yet I hedled. </p>\n\n<p>After I bought the house I set a figure so that if my btc ever totaled more than x amount I would sell to pay off my mortgage. Well early today I reached and exceeded that amount. I sold and still have some btc left over. </p>\n\n<p>&#x200B;</p>\n\n<p>TL;DR</p>\n\n<p>I just paid off my mortgage, saved 28 years of interests, <strong>I have reached my moon.</strong></p>\n</div><!-- SC_ON -->",
  "score": 238,
  "permalink": "/r/Bitcoin/comments/ksn1av/today_i_reached_my_moon/",
  "subreddit": "Bitcoin",
  "id": "ksn1av",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706370125
}