{
  "author": "graynewworld",
  "the_new_excerpt": "They are not designed so that one makes goods decisions. The are designed so one\nclicks on links and adds. In most cases you are better off reading nothing but\nfinancial statements and sector/industry news.\n\nThis is especially true if your looking at mid to long term plays. Statistically\nspeaking…",
  "original_created_utc": 1616600802,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "它们的设计不是为了让人们做出商品决定。它们的设计是为了让人们\n点击链接和添加。在大多数情况下，你最好什么都不看，只看以下内容\n财务报表和部门/行业新闻。\n\n如果您正在寻找中长期的游戏，这一点尤其正确。据统计\n说...",
      "title": "Motley Fool和其他很多财经新闻网站都是SEO的玩法。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "它們的設計不是爲了讓人們做出商品決定。它們的設計是爲了讓人們\n點擊鏈接和添加。在大多數情況下，你最好什麼都不看，只看以下內容\n財務報表和部門/行業新聞。\n\n如果您正在尋找中長期的遊戲，這一點尤其正確。據統計\n說...",
      "title": "Motley Fool和其他很多財經新聞網站都是SEO的玩法。"
    }
  ],
  "title": "Motley Fool and many other financial news sites are SEO plays.",
  "created_utc": 1616612318,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>They are not designed so that one makes goods decisions. The are designed so one clicks on links and adds. In most cases you are better off reading nothing but financial statements and sector/industry news.</p>\n\n<p>This is especially true if your looking at mid to long term plays. Statistically speaking most news is just noise (no predictable impact on price) and most experts do not consistently get it right.</p>\n\n<p>Even when content is written with the investors best interest in mind, the author is still victim biases that are defaults in how we think.</p>\n\n<p>&#x200B;</p>\n\n<p>EDIT: Since this posts has some traction I&#39;d like to encourage anyone who is interested to read up on heuristics and heuristics in investing. The psychology of investing is grossly undervalued and much of the best research is used by marketers and product designers to ensure that we act in their best interest and not our own. </p>\n\n<p>I&#39;d also like to add that while Motley Fool is low hanging fruit, they are far from the only offender. </p>\n</div><!-- SC_ON -->",
  "score": 2711,
  "permalink": "/r/stocks/comments/mc91ew/motley_fool_and_many_other_financial_news_sites/",
  "subreddit": "stocks",
  "id": "mc91ew",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752822102
}