{
  "author": "AskScienceModerator",
  "the_new_excerpt": "Solvents are used in a variety of applications - from paints and electronics to\npharmaceuticals and agrochemical production. Yet, many pose a hazard to human\nhealth and the environment, which means it's more important than ever to create\nsafer, more sustainable alternatives.\n\nWe're exploring new…",
  "original_created_utc": 1618484458,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "溶剤は、塗料、電子機器、医薬品、農薬など、さまざまな分野で使用されています。\n薬品や農薬の生産に至るまで、さまざまな用途で使用されています。しかし、その多くは人の健康や環境に悪影響を及ぼすものです。\nそのため、より安全で持続可能な代替品の開発がかつてないほど重要になっています。\nつまり、より安全で持続可能な代替品を作ることがこれまで以上に重要なのです。\n\n私たちは、新しい...",
      "title": "AskScience AMAシリーズ。私たちは、より持続可能な化学のために、次世代の溶媒を研究している科学者のグループです。何でも聞いてください"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "溶剂被用于各种应用--从涂料和电子到\n医药和农化生产。然而，许多人对人类造成了危害。\n健康和环境，这意味着比以往任何时候都更重要的是创造\n更安全、更可持续的替代品。\n\n我们正在探索新的...",
      "title": "AskScience AMA系列。我们是一群科学家，正在研究下一代溶剂，以实现更可持续的化学。有什么问题都可以问我们"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "溶劑被用於各種應用--從塗料和電子到\n醫藥和農化生產。然而，許多人對人類造成了危害。\n健康和環境，這意味着比以往任何時候都更重要的是創造\n更安全、更可持續的替代品。\n\n我們正在探索新的...",
      "title": "AskScience AMA系列。我們是一羣科學家，正在研究下一代溶劑，以實現更可持續的化學。有什麼問題都可以問我們"
    }
  ],
  "title": "AskScience AMA Series: We're a group of scientists working on the next generation of solvents for more sustainable chemistry. Ask us anything!",
  "created_utc": 1618496808,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Solvents are used in a variety of applications - from paints and electronics to pharmaceuticals and agrochemical production. Yet, many pose a hazard to human health and the environment, which means it&#39;s more important than ever to create safer, more sustainable alternatives.</p>\n\n<p>We&#39;re exploring new applications for bio-based solvents, such as Cyrene™ - a dipolar aprotic solvent that is derived from cellulose and produced in one step from levoglucosenone (LGO), a versatile chemical building block. This solvent can be used for the production and development of active pharmaceutical ingredients, the engineering of plastics and the manufacturing and recycling of electronic components.</p>\n\n<p>In addition to determining new applications for Cyrene™ solvent, we&#39;re also working on further developments for other LGO derivatives. These next-gen solvents can play a crucial role in more sustainable chemistry. For example, when compared to N-methyl-2-pyrrolione (NMP) and dimethylformamide (DMF), two solvents under increasing regulatory restrictions due to their toxicity, Cyrene™ solvent offers superior performance in some applications. Additionally, its low toxicity falls well below the hazard thresholds defined by the Globally Harmonized System of Classification and Labelling of Chemicals.</p>\n\n<p>Here to answer your questions about greener solvents are:</p>\n\n<ul>\n<li>Dr. Jane Murray (<a href=\"/u/GreenJanem\">/u/GreenJanem</a>): I am the global head of green chemistry at Merck. I have a background in chemical research-having completed my Ph.D. at the University of York, where I researched green oxidations of organosulfur compounds using hydrogen peroxide. In my current role, I enjoy partnering with academics to introduce novel green chemistry technologies to the scientific community. I was named an Environment+Energy Leader 100 Honoree in 2020.</li>\n<li>Dr. Jason Camp (<a href=\"/u/DrJasonCamp\">/u/DrJasonCamp</a>): I am the chief technology officer at Circa Group. Prior to joining Circa, I had over 10 years of experience as an independent academic at various UK universities, during which I conducted research and published extensively in the areas of green chemistry and sustainable solvents, including Cyrene™. In addition, I have served on the Society of Chemical industry&#39;s (SCI) Fine Chemicals Group since 2014 and am currently the secretary of the SCI&#39;s Science and Enterprise Group.</li>\n<li>James Clark (<a href=\"/u/GreenJamesClark\">/u/GreenJamesClark</a>): I am a scientific advisor at Circa Group, professor at the University of York and director of the Green Chemistry Centre of Excellence. I have played a leading role in green and sustainable chemistry over the last 20 years, and have published over 400 related articles in that period. My activities in research, education and industrial collaboration have led to prizes and awards from the Royal Society of Chemistry, the SCI and EUChemS, as well as honorary doctorates from universities in Belgium, Germany and Sweden.</li>\n</ul>\n\n<p>We&#39;ll be answering questions about our work on bio-based solvent developments from 11 a.m. EDT - 1 p.m. EDT (15-17 UT). Ask us anything!</p>\n</div><!-- SC_ON -->",
  "score": 118,
  "permalink": "/r/askscience/comments/mrcaea/askscience_ama_series_were_a_group_of_scientists/",
  "subreddit": "askscience",
  "id": "mrcaea",
  "is_self": true,
  "media": null,
  "is_video": false
}