{
  "author": "vegoonthrowaway",
  "the_new_excerpt": "First off: I'm very bullish on GME, and I won't sell a single share for this\nplay. However, I had some cash laying around in my brokerage account that I owe\nin taxes. And I don't want to feel any pressure about the squeeze having to\nhappen before X or Y, so that money won't be going into GME. The…",
  "original_created_utc": 1616070046,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "首先，我 我非常看好GME，我不会为了这个卖掉任何一份股票\n戏。然而，我有一些现金 躺在我的经纪账户，我欠了\n税。而我不想感到任何压力，关于压榨不得不。\n发生在X或Y之前，所以这些钱不会进入GME。这...",
      "title": "UWMC火箭"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，我 我非常看好GME，我不會爲了這個賣掉任何一份股票\n戲。然而，我有一些現金 躺在我的經紀賬戶，我欠了\n稅。而我不想感到任何壓力，關於壓榨不得不。\n發生在X或Y之前，所以這些錢不會進入GME。這...",
      "title": "UWMC火箭"
    }
  ],
  "title": "The UWMC rocket",
  "created_utc": 1616104633,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>First off: I&#39;m very bullish on GME, and I won&#39;t sell a single share for this play. However, I had some cash laying around in my brokerage account that I owe in taxes. And I don&#39;t want to feel any pressure about the squeeze having to happen before X or Y, so that money won&#39;t be going into GME. The squeeze will happen when it happens, and I can confidently say I can hold my shares for however long I need to do so.</p>\n\n<p>So during the last couple of weeks, I’ve seen UWMC being mentioned here. From what I understand, the company has pretty good fundamentals. They’re profitable, yada yada yada. However, I’m not looking for boomer stocks that give me a few percent of profit a year. I like rockets.But among the posts about UWMC, people were mentioning that there were a lot of options expiring on Mar 19. This piqued my interest. And I decided to take a look at the options chain myself.</p>\n\n<p>I ran a script to collect the data from the Yahoo options chain on Mar 7th, and quickly realized that there are indeed a shit ton of calls. This is not a boomer stock. This is a rocket, primed for launch. I figured someone else was going to post about the options chain in a more exhaustive manner, but this never happened. However, the last date for optimal launch conditions is drawing close, and the stock price is finally seeing some nice upwards action. So I figured I&#39;d take it upon myself to tell you all about the beautiful options chain.</p>\n\n<p>Now, before we start, I should mention that my understanding of options is rather limited. Prior to the whole GME thing, “options” primarily made me think about the menu where you can change the graphics fidelity and your controls in a videogame. So keep that in mind as you read this. I’m not the ideal person to be posting this.</p>\n\n<p>The UWMC options chain had (as of Mar 7th - sorry about the outdated data, didn’t run the script since then, and the Yahoo IV seems to be scuffed right now) a total of 501,471 calls, with strike prices ranging from $1 to $25. As we all probably know by now, each call contract is worth 100 shares. This means that there were call contracts out there worth 50,147,100 shares.For a stock which has a public float of only ~90 million. Let that sink in. There are calls for literally 55% of the float.</p>\n\n<p>I also went ahead and calculated approximate deltas for the various calls in order to calculate to which extent these calls are likely hedged. With the price at the time ($8.68), roughly 11.3 million shares would have been held by call writers, assuming all of them hedge according to delta, and calls worth 38.9 million shares would have been unhedged.</p>\n\n<p>At a price of $10, the number of hedged shares should go up to roughly 16 million.</p>\n\n<p>At $12, that number would be ~23 million.</p>\n\n<p>At $14, ~28.9 million. At this point, there are still ~21.2 million shares that are unhedged.</p>\n\n<p>And this just keeps going as the price reaches new heights. Basically RKT all over.</p>\n\n<p>Now, the deltas would be slightly different today seeing as the delta calculation takes time until expiry into account, and a lot of the calls expire tomorrow, but the situation should still be <em>very</em> similar. Also, all of the calls aren’t written by market makers or by people who delta-hedge, but from what I understand, Market Makers do write the majority of call options.</p>\n\n<p>TLDR:There are call options out there worth roughly 55% of the public float of UWMC. Potential for a massive gamma squeeze starting if the price goes up just a couple of dollars. EZ 2-bagger <em>with shares</em> before the week is over.</p>\n\n<p>If the price doesn&#39;t go up soon enough, UWMC is apparently still a solid company, according to other posts on this sub. Boomer profits, maybe a 2-bagger with shares before the year is over.</p>\n\n<p>Positions: 150 shares @ $9.06. No options because I’m not rich enough to set up an account at an american broker, and I can’t find any european brokers that offer options for american stocks.</p>\n\n<p>This is obviously not investing advice. I barely understand how options work, and eat crayons for breakfast.</p>\n\n<p>Edit: Market is open, yahoo IV is unscuffed. So I could get some fresh data.</p>\n\n<p>Total open interest  is 543,817 for calls across all strike prices and dates. Table below is assuming 100% of calls are hedged according to delta. This is obviously not the case in reality, but I&#39;m not sure what percentage would be a reasonable assumption, so just posting the raw results from my script here. Also, keep in mind my deltas aren&#39;t 100% correct, but rather just approximations. I&#39;m too smoothbrained for using the real black-scholes algorithm.</p>\n\n<p>&#x200B;</p>\n\n<table><thead>\n<tr>\n<th align=\"left\">Price of underlying</th>\n<th align=\"left\">Shs hedged</th>\n<th align=\"left\">Shs unhedged</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">$9.5</td>\n<td align=\"left\">12,837,474.4</td>\n<td align=\"left\">41,544,225.6</td>\n</tr>\n<tr>\n<td align=\"left\">$10</td>\n<td align=\"left\">15,287,918.4</td>\n<td align=\"left\">39,093,781.6</td>\n</tr>\n<tr>\n<td align=\"left\">$11</td>\n<td align=\"left\">19,884,009.9</td>\n<td align=\"left\">34,497,690.1</td>\n</tr>\n<tr>\n<td align=\"left\">$12</td>\n<td align=\"left\">23,913,412.6</td>\n<td align=\"left\">30,468,287.4</td>\n</tr>\n<tr>\n<td align=\"left\">$13</td>\n<td align=\"left\">28,048,652.1</td>\n<td align=\"left\">26,333,047.9</td>\n</tr>\n<tr>\n<td align=\"left\">$14</td>\n<td align=\"left\">32,059,778.8</td>\n<td align=\"left\">22,321,921.2</td>\n</tr>\n<tr>\n<td align=\"left\">$15</td>\n<td align=\"left\">35,577,854.3</td>\n<td align=\"left\">18,803,845.7</td>\n</tr>\n<tr>\n<td align=\"left\">$17.5</td>\n<td align=\"left\">41,868,771.4</td>\n<td align=\"left\">12,512,928.6</td>\n</tr>\n<tr>\n<td align=\"left\">$20</td>\n<td align=\"left\">45,074,617.3</td>\n<td align=\"left\">9,307,082.7</td>\n</tr>\n<tr>\n<td align=\"left\">$25</td>\n<td align=\"left\">49,206,602.5</td>\n<td align=\"left\">5,175,097.5</td>\n</tr>\n<tr>\n<td align=\"left\">$30</td>\n<td align=\"left\">51,505,219.5</td>\n<td align=\"left\">2,876,480.5</td>\n</tr>\n</tbody></table>\n\n<p>Edit2:<br/>\nShitadel and Susquehanna both seem to be UWMC stakeholders. Just a heads up. If this prints, it likely also prints for the bad guys.  </p>\n</div><!-- SC_ON -->",
  "score": 1554,
  "permalink": "/r/wallstreetbets/comments/m7plal/the_uwmc_rocket/",
  "subreddit": "wallstreetbets",
  "id": "m7plal",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752824354
}