{
  "author": "rootpl",
  "original_created_utc": 1631457673,
  "title": "Instead of fighting with each other like some crazy bloodthirsty tribes why can't we just work together and coexist to create great projects together?",
  "created_utc": 1631475042,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Cardano is about to launch its smart contracts today and there has been a lot of negativity surrounding the project, especially from the SOL and ETH communities. ETH sub was full of ADA memes and FUD in recent days saying it can&#39;t do things the way it is supposed to (that was debunked straight away by the way). Concurrency issues with ADA were never a thing and most of the decentralised exchanges including Ergo and other exchanges already found solutions to the UTXO model. </p>\n\n<p>But the biggest feature that we should focus on in my opinion is interoperability:</p>\n\n<p>&quot;<em>One of the main value propositions of Cardano since its inception has been interoperability. The vision for the future is to provide a decentralized data platform utilizing blockchain technology that is scalable to onboard large amounts of user data, sustainable to keep incentives aligned with a robust Cardano governance structure and offer efficient interoperability with other blockchains and legacy systems.</em></p>\n\n<p><em>To date, one of the biggest factors that the blockchain industry has been trying to address is the zero-sum mentality of many big industry players creating a need for a unifying industry theme.</em></p>\n\n<p><em>As the blockchain industry matures, several blockchain projects will co-exist in a dynamic ecosystem to meet the specific demands of many types of applications and users. Existing legacy systems will also need to somehow be a part of the movement towards blockchain-based data infrastructure and an interoperable blockchain platform such as Cardano will be able to meet its needs as well.&quot;</em></p>\n\n<p>It&#39;s simple as that, different crypto projects can easily coexist, single coin maxists will remain on all sides wherever we want it or not but I think as a crypto community we should focus on working together instead of fighting with each other. Bridges that will connect communities will be built and we should help them do it for the better future of all crypto space.</p>\n\n<p>For the record, I hold ETH, SOL, ADA and ALGO.</p>\n</div><!-- SC_ON -->",
  "score": 159,
  "permalink": "/r/CryptoCurrency/comments/pmtw7b/instead_of_fighting_with_each_other_like_some/",
  "subreddit": "CryptoCurrency",
  "id": "pmtw7b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Cardano is about to launch its smart contracts today and there has been a lot of\nnegativity surrounding the project, especially from the SOL and ETH communities.\nETH sub was full of ADA memes and FUD in recent days saying it can't do things\nthe way it is supposed to (that was debunked straight away…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Cardanoは今日、スマートコントラクトをローンチしようとしているが、特にSOLとETHのコミュニティからは多くの否定的な意見が出ている。\n特にSOLとETHのコミュニティからは、このプロジェクトに否定的な意見が多く寄せられています。\nETHサブはここ数日、ADAのミームやFUDでいっぱいで、想定通りのことができないと言っていた。\nETHサブではADAのミームやFUDがあふれていた。",
      "title": "狂った血気盛んな部族のように互いに争うのではなく、協力し合い、共存して素晴らしいプロジェクトを一緒に作ることができないだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Cardano即将在今天推出其智能合约，并有很多\n围绕着这个项目，尤其是来自SOL和ETH社区的负面情绪。\n最近几天，ETH分站充满了ADA的备忘录和FUD，说它不能做事情\n的方式（这被直接揭穿了......",
      "title": "与其像一些疯狂的嗜血部落一样相互争斗，为什么我们不能一起工作，共存共荣，共同创造伟大的项目？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Cardano即將在今天推出其智能合約，並有很多\n圍繞着這個項目，尤其是來自SOL和ETH社區的負面情緒。\n最近幾天，ETH分站充滿了ADA的備忘錄和FUD，說它不能做事情\n的方式（這被直接揭穿了......",
      "title": "與其像一些瘋狂的嗜血部落一樣相互爭鬥，爲什麼我們不能一起工作，共存共榮，共同創造偉大的項目？"
    }
  ]
}