{
  "author": "Brinothedino",
  "original_created_utc": 1640220470,
  "title": "The metaverse isn't for you and me, it's going to be the next generation that chooses.",
  "created_utc": 1640263536,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Geezers like myself (I&amp;#39;m only 32...) quickly forget how much shit our parents gave us for spending hours in &amp;quot;online chatrooms&amp;quot; like MSN Messenger back in the day. It strikes me how natural it is for my 6 year old nephew to spend time in online universes like Lego world or Minecraft. I&amp;#39;m honestly not really sure what Roblox is but it seems to be huge as well and I heard some kid trying to explain it to his dad in the drug store today. &lt;/p&gt;\n\n&lt;p&gt;In the same way that it would have seemed bizarre for us to spend so much time on our phones like 20 years ago, the metaverse is going to be the place for kids to spend hours afterschool (or maybe even AT school) and as the tech improves so will the experience. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sure many of the current metaverse tokens will still eat shit over the next bear cycle. We are still a ways away from anything game changing in that market IMHO, but don&amp;#39;t be fooled into thinking it&amp;#39;s not going to be back with a vengeance. Honestly we may even be a couple cycles away from a real user friendly metaverse, but we all know the value in getting in early in crypto. &lt;/p&gt;\n\n&lt;p&gt;Anyway, just my two Satoshis on the topic as someone who thinks the metaverse sounds stupid (but plans to invest heavily over the next few years)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 162,
  "permalink": "/r/CryptoCurrency/comments/rmjak9/the_metaverse_isnt_for_you_and_me_its_going_to_be/",
  "subreddit": "CryptoCurrency",
  "id": "rmjak9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Geezers like myself (I'm only 32...) quickly forget how much shit our parents\ngave us for spending hours in \"online chatrooms\" like MSN Messenger back in the\nday. It strikes me how natural it is for my 6 year old nephew to spend time in\nonline universes like Lego world or Minecraft. I'm honestly…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私のようなオヤジは（まだ32歳ですが...）、親にどれだけ怒られたか、すぐに忘れてしまうのです。\n昔、MSNメッセンジャーのような「オンラインチャット」で何時間も過ごしていると\nその昔 6歳の甥っ子が「甥っ子と一緒に」「甥っ子と一緒に」「甥っ子と一緒に」「甥っ子と一緒に」「甥っ子と一緒に」「甥っ子と一緒に\nレゴワールドやマインクラフトのようなオンラインユニバース。正直言って...",
      "title": "メタバースはあなたや私のためではなく、次の世代が選ぶものなのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "像我这样的怪人（我只有32岁......）很快就忘记了我们的父母在过去的几年里因为我们在 \"在线聊天室\"（如MSN Messenger）里花了几个小时而给我们施加了多少压力\n我们的父母因为我们在 \"在线聊天室\"（如MSN Messenger）中花费了几个小时而对我们大加指责。\n天。我觉得我6岁的侄子花时间在网上聊天是多么的自然\n像乐高世界或Minecraft这样的在线宇宙。老实说，我...",
      "title": "元数据不是为你和我准备的，将是下一代的选择。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "像我這樣的怪人（我只有32歲......）很快就忘記了我們的父母在過去的幾年裏因爲我們在 \"在線聊天室\"（如MSN Messenger）裏花了幾個小時而給我們施加了多少壓力\n我們的父母因爲我們在 \"在線聊天室\"（如MSN Messenger）中花費了幾個小時而對我們大加指責。\n天。我覺得我6歲的侄子花時間在網上聊天是多麼的自然\n像樂高世界或Minecraft這樣的在線宇宙。老實說，我...",
      "title": "元數據不是爲你和我準備的，將是下一代的選擇。"
    }
  ]
}