{
  "author": "UserLostBadly",
  "original_created_utc": 1631227654,
  "title": "Looking for a front end developer(s) to build a cool portfolio project.",
  "created_utc": 1631260717,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi everyone, </p>\n\n<p>I am a python developer (back end, familiar with React). I am looking for a front end developer to build something cool together so we can use it in our resumes for future jobs. I will take care of the back end and would like to work with somebody who is familiar with React or any other front end library/framework. \nIf you are interested please leave a comment with a few words about yourself or dm me. \nThank you.</p>\n</div><!-- SC_ON -->",
  "score": 5,
  "permalink": "/r/SideProject/comments/pl8isv/looking_for_a_front_end_developers_to_build_a/",
  "subreddit": "SideProject",
  "id": "pl8isv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi everyone,\n\nI am a python developer (back end, familiar with React). I am looking for a\nfront end developer to build something cool together so we can use it in our\nresumes for future jobs. I will take care of the back end and would like to work\nwith somebody who is familiar with React or any…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。\n\n私はpythonの開発者です（バックエンド、Reactに精通しています）。フロントエンドの開発者を探しています。\nフロントエンドの開発者を探していて、一緒に何かクールなものを作って\nフロントエンド開発者を探しています。バックエンドは私が担当しますが、Reactに精通している人と一緒に働きたいと思っています。\nバックエンドは私が担当しますが、Reactやその他の技術に精通している方と一緒に働きたいと思っています。",
      "title": "クールなポートフォリオプロジェクトを構築するフロントエンド開発者を探しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。\n\n我是一名python开发人员（后端，熟悉React）。我正在寻找一个\n前端开发人员，一起建立一些很酷的东西，这样我们就可以在我们的\n辞，以便在未来的工作中使用。我将负责后端，并希望与熟悉React的人一起工作。\n熟悉React或任何其他技术的人合作。",
      "title": "寻找一个前端开发人员来建立一个很酷的组合项目。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。\n\n我是一名python開發人員（後端，熟悉React）。我正在尋找一個\n前端開發人員，一起建立一些很酷的東西，這樣我們就可以在我們的\n辭，以便在未來的工作中使用。我將負責後端，並希望與熟悉React的人一起工作。\n熟悉React或任何其他技術的人合作。",
      "title": "尋找一個前端開發人員來建立一個很酷的組合項目。"
    }
  ]
}