{
  "author": "MrMcBert",
  "original_created_utc": 1634968916,
  "title": "Tried to explain market cap to guys in the office talking about crypto - it did not go well",
  "created_utc": 1634985674,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This week I saw some guys at the office staring at a graph that looked pretty familiar to me. They were looking at the year graph of shiba inu. One of them told the others he is going to invest €50 into shiba because if it goes to &#39;even&#39; €0.01 he will turn it into €20k. \nI could not hold myself back so I stepped forward trying to explain to him that if shiba would go to 0.01 its market cap would be like $5T because the coin supply of Shiba inu is just so absurdly high and then there would be more money in crypto than there is in the entire world with stocks and everything. I also told him to check out the graph. You could clearly see a large spike in april/may and now a large spike again. In between nothing happened with Shiba at all. So I asked him what he thinks will happen to shiba this time. Obviously an equal drop as in May is way more likely than another pump. \nHe just said well it&#39;s only €50 if I lose it it&#39;s fine but it could go to at least €20k.\nThe crazy thing is he told me he already has an account on Kraken and is investing in Crypto. He just needs a new account at Coinbase because Kraken does not list Shiba. So this guy is already part of crypto and has no idea about Market cap, coin supply etc.</p>\n\n<p>tl;dr we are still so early guys. Even some people invested in Crypto have zero knowledge about it</p>\n</div><!-- SC_ON -->",
  "score": 233,
  "permalink": "/r/CryptoCurrency/comments/qdz2c8/tried_to_explain_market_cap_to_guys_in_the_office/",
  "subreddit": "CryptoCurrency",
  "id": "qdz2c8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This week I saw some guys at the office staring at a graph that looked pretty\nfamiliar to me. They were looking at the year graph of shiba inu. One of them\ntold the others he is going to invest €50 into shiba because if it goes to\n'even' €0.01 he will turn it into €20k. I could not hold myself back…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今週、会社で何人かの人が、見覚えのあるグラフを見つめているのを見ました。\n私には見覚えがある。彼らが見ていたのは、柴犬の年別グラフ。その中の一人が\n50ユーロを柴犬に投資するつもりだ。\n0.01ユーロになれば、2万ユーロになるからだ。私は我慢できなかった...。",
      "title": "オフィスで暗号の話をしている人に、時価総額を説明しようとしたが、うまくいかなかった。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "本周，我在办公室看到一些人盯着一个图表，这个图表对我来说相当熟悉。\n对我来说很熟悉。他们在看柴犬的年份图。其中一个人\n告诉其他人，他准备投资50欧元到芝罘区，因为如果它涨到了\n0.01欧元，他将把它变成2万欧元。我无法控制自己...",
      "title": "试图向办公室里谈论加密货币的人解释市值--这并不顺利。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "本週，我在辦公室看到一些人盯着一個圖表，這個圖表對我來說相當熟悉。\n對我來說很熟悉。他們在看柴犬的年份圖。其中一個人\n告訴其他人，他準備投資50歐元到芝罘區，因爲如果它漲到了\n0.01歐元，他將把它變成2萬歐元。我無法控制自己...",
      "title": "試圖向辦公室裏談論加密貨幣的人解釋市值--這並不順利。"
    }
  ]
}