{
  "author": "ViciousPhilosopher",
  "the_new_excerpt": "This was a quote in a movie. But this seems to be true in real life as well.\n\nBy extension, if we quantify good vs evil, does this imply effect of 1 unit of\ngood < effect 1 unit of evil?\n\nAnd depending on the answer, do utilitarians take this factor into\nconsideration? That, for example, harming 1…",
  "original_created_utc": 1619861234,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これはある映画の中の言葉です。しかし、これは現実にも当てはまることのようです。\n\nひいては、善と悪を数値化すると、善1単位の効果＜悪1単位の効果ということになるのでしょうか。\n善の効果1単位＜悪の効果1単位ということになるのでしょうか？\n\nまた、その答えによっては、功利主義者はこの要素を考慮に入れるのでしょうか？\n考慮しますか？それは、例えば、1を害すると...",
      "title": "なぜ、たった一度の善行では悪の人生を赦すことができず、たった一度の悪行で善行の人生を非難することができるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是一部电影中的一句话。但在现实生活中，这似乎也是真的。\n\n推而广之，如果我们把善与恶量化，这是否意味着1单位的善的效果<1单位的恶的效果？\n善<1单位的恶的效果？\n\n根据这个答案，功利主义者是否将这个因素考虑在内？\n考虑吗？比如说，伤害1...",
      "title": "为什么一件善事不足以赦免一生的恶行，而一件恶行却足以谴责一生的善行？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是一部電影中的一句話。但在現實生活中，這似乎也是真的。\n\n推而廣之，如果我們把善與惡量化，這是否意味着1單位的善的效果<1單位的惡的效果？\n善<1單位的惡的效果？\n\n根據這個答案，功利主義者是否將這個因素考慮在內？\n考慮嗎？比如說，傷害1...",
      "title": "爲什麼一件善事不足以赦免一生的惡行，而一件惡行卻足以譴責一生的善行？"
    }
  ],
  "title": "Why is it that a single good deed isn’t enough to pardon a life of evilness but a single act of evil is enough to condemn a life of good deeds?",
  "created_utc": 1619880838,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This was a quote in a movie. But this seems to be true in real life as well.</p>\n\n<p>By extension, if we quantify good vs evil, does this imply effect of 1 unit of good &lt; effect 1 unit of evil?</p>\n\n<p>And depending on the answer, do utilitarians take this factor into consideration?  That, for example, harming 1 person may irrespectively outweigh the good caused to the other four because of the above fact?</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/askphilosophy/comments/n2eycy/why_is_it_that_a_single_good_deed_isnt_enough_to/",
  "subreddit": "askphilosophy",
  "id": "n2eycy",
  "is_self": true,
  "media": null,
  "is_video": false
}