{
  "author": "tadhg8811",
  "the_new_excerpt": "Hi everyone,\n\nI work as a product manager at a large tech company and as part of my job it's\nimportant for me to understand major technology trends and strategies. I put\nthis post together to outline a major new 'moat' strategy being used by some of\nthe world's best SaaS companies. I've also…",
  "original_created_utc": 1611097028,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "大家好\n\n我在一家大型科技公司担任产品经理，作为工作的一部分，我的工作是\n对我来说，了解主要的技术趋势和战略很重要。我把\n本篇文章旨在概述一些公司正在使用的主要的新 \"护城河 \"战略。\n世界上最好的SaaS公司。我还...",
      "title": "采用这种商业策略的科技公司存在巨大的投资机会"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好\n\n我在一家大型科技公司擔任產品經理，作爲工作的一部分，我的工作是\n對我來說，瞭解主要的技術趨勢和戰略很重要。我把\n本篇文章旨在概述一些公司正在使用的主要的新 \"護城河 \"戰略。\n世界上最好的SaaS公司。我還...",
      "title": "採用這種商業策略的科技公司存在巨大的投資機會"
    }
  ],
  "title": "Big investment opportunities in tech companies who adopt this business strategy",
  "created_utc": 1611140691,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi everyone,</p>\n\n<p>I work as a product manager at a large tech company and as part of my job it&#39;s important for me to understand major technology trends and strategies. I put this post together to outline a major new &#39;moat&#39; strategy being used by some of the world&#39;s best SaaS companies. I&#39;ve also highlighted some of the best related investment opportunities.</p>\n\n<p>If you found this post valuable and would like to read more please let me know. I&#39;m thinking about writing like this more often if it&#39;s something people get value from. Thanks a lot</p>\n\n<h1>The Lock-Expand-Improve Strategy</h1>\n\n<p>In 2016, Instagram launched their ‘Stories’ feature. Instagram Stories was an almost direct copy of Snapchat Stories (even copying the name). Whatever your opinion on such a move, it has most definitely paid off. By 2019, the daily active user count for Instagram stories was twice as high as Snapchat’s total DAU count.</p>\n\n<p>Building great software is still one of the most important things that software companies should be focused on. But it’s not enough. In a world where your best features can (and will) be copied, companies need to focus on building a strong economic moat around their business.</p>\n\n<p>First coined by Warren Buffett, an economic moat is a company’s ability to build and maintain a durable competitive advantage while protecting its long-term profits and market share.</p>\n\n<blockquote>\n<p>“The most important thing [is] trying to find a business with a wide and long-lasting moat around it … protecting a terrific economic castle with an honest lord in charge of the castle,” - Buffett</p>\n</blockquote>\n\n<p>I believe that there are 3 ‘types’ of moats in particular that when built together by tech companies, will compound upon each other to create a hugely defensible business. This business strategy will be one of the most important strategies of the next 10 years. Companies who can successfully execute on this strategy will dominate their markets and deliver outsized returns to their investors.</p>\n\n<p>I call this moat strategy the <strong>Lock-Expand-Improve</strong> strategy.</p>\n\n<p>In this post, I’ll first briefly explain some of the traditional moats currently seen in tech companies. Then I’ll go into detail on the lock-expand-improve strategy. Finally, I’ll highlight a few tech companies that I think are best positioned to execute on this strategy and therefore make for great investment opportunities.</p>\n\n<h2>Traditional Business Moats</h2>\n\n<ul>\n<li><strong>Deep Technology/IP:</strong> Sometimes, companies can build a massive economic moat by having deep technology that is at least 10 times better than the competition. Google’s search engine is the classic example of this. Google joined the search wars somewhat late but had a solution that was far better than Yahoo’s.</li>\n<li><strong>Economies of Scale:</strong> The bigger your are, the lower your costs will be due to having more operating leverage. This means that you can earn more money per customer (at the same price) or provide a cheaper solution than your smaller competitors. Software companies in general are great examples of economies of scale due to the almost zero additional cost of production involved in acquiring another customer.</li>\n<li><strong>Network Effects:</strong> Your product/service has network effects if its value increases as the number of people using it increases. Social networks and messaging products are classic examples of network effects. Network moats can be incredibly defensible. Why would I download a new messaging app when all of my friends are using WhatsApp?</li>\n<li><strong>Brand Loyalty:</strong> A strong brand can be a moat. Think Apple, Coca-Cola, Gucci. Instantly recognisable brands that have built huge businesses by cultivating brand loyalty amongst their customers.</li>\n</ul>\n\n<p>The above moats have built some of the biggest and most enduring tech companies in the world. Google, Amazon and Facebook all have one or more of those moats. But many of these moats can become shallow over time. For example, network effects have been key to Facebook’s success. The more users that use Facebook, the better Facebook becomes for each individual user (to an extent). However, Facebook’s network effects don’t stop users from adopting and using other social networks.</p>\n\n<p>Major platform shifts/trends can also make some moats a lot more shallow. The emergence of open-source software has made deep tech a far shallower moat in many instances.</p>\n\n<p>Today, for tech companies to build a truly durable competitive advantage they need more than one moat. These moats should also compound upon each other. The whole should be greater than the sum of its parts.</p>\n\n<p>Enter the lock-expand-improve moat strategy.</p>\n\n<h2>Lock-Expand-Improve</h2>\n\n<p>Before explaining the lock-expand-improve strategy, it’s important to note that this strategy is focused on B2B/enterprise software companies. While aspects of this strategy could most likely be useful for companies in other industries/verticals, I’ll only be highlighting investment opportunities in the B2B/enterprise space.</p>\n\n<p>The most important thing to note about this strategy is that it is a compounding moat strategy. This means two things:</p>\n\n<ol>\n<li>Each step of the strategy must be in place for it to be successful.</li>\n<li>Each step builds upon the previous step to allow companies to build a stronger competitive advantage over time.</li>\n</ol>\n\n<p>While traditional moats allow companies to focus on protecting and improving their castle (business), these moats can get shallower over time. The lock-expand-improve strategy allows companies not only to to protect and improve their castles but also to <strong><em>dig a deeper and wider moat over time.</em></strong></p>\n\n<h2>Step 1: Lock-In</h2>\n\n<p>The first two steps of this strategy are similar to the popular ‘land and expand’ strategy.</p>\n\n<p>The first step, lock-in (or high switching costs), involves making it very difficult for your customers to switch to a competitor. Here are some of the ways that software companies can achieve customer lock-in:</p>\n\n<ol>\n<li><strong>High sunk costs:</strong> High sunk costs are a common feature of major ERP-style businesses such as ServiceNow or Oracle. Implementing these products can cost millions of dollars and take months to years. Once a customer has put that much time and effort into implementing your product, they will be far less likely to switch to a competitor.</li>\n<li><strong>Deep integrations:</strong> If your product allows your customers to integrate with lots of other apps and data sources, it will be far harder for a company to switch to a competing product. They will not only have to replace your product but also replace all of the integrations that have been built up over time.</li>\n<li><strong>Business logic and workflows:</strong> You can build customer lock-in by being the product in which a lot of customer information, logic and workflows are stored. A good example of this is Atlassian’s jira product. While the implementation costs for jira are low, a huge amount of organisational logic and process gets stored in jira over time, making it difficult to replace.</li>\n</ol>\n\n<h2>Step 2: Expand</h2>\n\n<p>Once you have achieved customer lock-in, the next step is to expand into other product areas and use cases. The goal is to solve more problems and sell more relevant products to each individual customer.</p>\n\n<p>This multi-product strategy is a really powerful way of building a strong moat around your business. Even if the individual products are worse in isolation, the benefits of multi-product may far outweigh the negatives for customers.</p>\n\n<p>For example, a competitor may have built a sales analytics tool that is far better than Salesforce’s analytics product. But a large customer is not comparing both analytics tools in isolation. A large customer is comparing your analytics tool against the fact that they can also get their CRM, marketing and customer support software all from Salesforce. One contract. One vendor relationship. One login for employees.</p>\n\n<h2>Step 3: Improve with data</h2>\n\n<p>Once a company has locked-in their customers and has expanded into new products, they can then begin collecting huge amounts of data about how their customers use their products.</p>\n\n<p>This final step of this strategy is the most important - Using customer data to provide tangible benefits to those customers and significantly improve their businesses. There are two main ways that data can be used to benefit customers:</p>\n\n<ol>\n<li><strong><em>Focus on using the data from an individual customer to benefit that specific customer -</em></strong> Companies can use an individual customer’s data to provide actionable insights to that customer to allow them to improve their businesses. For example, People.ai uses ML to help companies uncover new revenue opportunities. Customer data can also be used to automate specific, repetitive tasks for customers. For example, UiPath (can’t wait for their IPO) provides RPA solutions to allow customers to automate repetitive tasks.</li>\n<li><strong><em>Focus on using the data from all customers to benefit the entire customer ecosystem -</em></strong> Google is a great example of a company that uses a data network effect to their advantage. The more search data they collect from all searches, the more accurate they can make searches in the future. We are beginning to see some enterprise software companies move in this direction. For example, ServiceNow provides benchmarking data to customers to allow them to compare themselves against industry standards and improve their business from there.</li>\n</ol>\n\n<p>Artificial intelligence and machine learning have been buzzwords in the software world for quite a while. Up until now, we haven’t seen huge benefits from AI/ML strategies in b2b/enterprise software. I strongly believe that this is beginning to change. We are starting to see the big incumbents build or acquire meaningful data solutions (eg Salesforce acquiring Tableau). Companies that can leverage AI/ML to do meaningful and useful things with their customer’s data will have a huge advantage over their competition.</p>\n\n<h2>The Flywheel</h2>\n\n<p>You can see how the lock-expand-improve strategy has such a compounding effect. By first locking in a customer, you can expand into new products, which allows you to then collect as much data as possible. Once you are collecting this data, you can then begin to use this data to provide big tangible benefits to your customers. These benefits mean your customers will be even less likely to switch to a competitor (lock-in) which will allow you to expand into even more products and collect even more data. The flywheel continues.</p>\n\n<p>That is what’s so powerful about this strategy - where many traditional moats get shallower over time, the flywheel effect makes this economic moat even deeper and wider over time.</p>\n\n<h2>Investment Opportunities</h2>\n\n<p><em>(\\</em>**Please note, that this post does not represent investment advice and these are just the companies that I&#39;m excited about for my personal portfolio)*</p>\n\n<p>While there are many b2b/enterprise tech companies that have successfully executed on the first 2 steps of this strategy (lock and expand) and there are a number of companies placing a huge amount of focus on step 3 (improving with data), there are no companies who I feel have fully executed on this strategy in it’s entirety.</p>\n\n<p>From an investing perspective, the opportunity lies in identifying companies who are best positioned to (and would benefit most from) successful execute the lock-expand-improve strategy. Below are 3 such companies that I am incredibly bullish on.</p>\n\n<h2>Okta ($OKTA):</h2>\n\n<p>Okta is an identity management company that provides identity services such as single sign on and user authentication. They are perfectly positioned to execute on the lock-expand-improve strategy.</p>\n\n<p>Okta has incredibly high lock-in properties. Once a product is managing your SSO, user authentication and provisioning services, it is not easy to replace. The switching costs are high both in terms of the amount of core business logic managed by the platform and the amount of integrations to other software products.</p>\n\n<p>Okta is successfully executing on the expansion aspect of this strategy too. They have moved into products such as API management and now have two major product areas; workforce identity management and customer identity management.</p>\n\n<p>I believe Okta has a huge opportunity to double down on their data initiatives and to truly start to help their customers to improve. They have already started doing so with their “Okta Insights” product which provides analytics and tailored recommendations to Okta customers. These products seem to be mostly focused on user security but imagine the further opportunities here - We are seeing an explosion in the number of SaaS products being used internally by companies. Okta is the single source of truth for companies to understand their SaaS usage, spend etc. Okta has a huge opportunity to leverage this information to help their customers choose the right tools, reduce unnecessary IT spend and much more.</p>\n\n<p>Okta is already the leader in the identity management space. If they continue to focus on their data strategy over the next few years then I firmly believe that the lock-expand-improve flywheel will begin turning and they will fully cement that position.</p>\n\n<h2>Twilio ($TWLO)</h2>\n\n<p>Twilio provides communication APIs that allows companies to engage/communicate with customers over multiple channels such as SMS and Whatsapp.</p>\n\n<p>API products have very high lock-in characteristics. The more services that Twilio allows you to integrate with, the harder it becomes to switch to a competitor.</p>\n\n<p>Twilio is expanding into new product areas very successfully. They have expanded into new communications use cases such as video messaging and recently launched a programmable call centre product - Twilio Flex.</p>\n\n<p>What’s most interesting about Twilio is its data strategy. Up until 2020, they didn’t seem to have much of a data focus. But their recent acquisition of Segment looks set to change all that. Segment allows customers to make data-driven decisions around engineering and marketing., allowing them to improve their businesses over time. The Segment acquisition was a brilliant move. It makes Twilio’s position far more defensible. The flywheel effect could be very powerful here; Twilio already has high lock-in and is expanding aggressively, the Segment acquisition allows them to focus on helping their customers to improve their businesses through data.</p>\n\n<h2>Stripe</h2>\n\n<p>Okay, I know - Stripe isn’t public. But I couldn’t help including them here. They look likely to go public in the few years and in my opinion are perfectly positioned to execute on the lock-expand-improve strategy.</p>\n\n<p>Stripe’s product has high lock-in properties, they are expanding aggressively into other product areas and have already built a very powerful data product - Stripe Radar which allows companies to detect and fight fraud.</p>\n\n<p>Stripe has all of the ingredients for a successful lock-expand-improve execution. Here’s hoping they go public sooner rather than later.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>If you liked this post lease let me know below. Are there any companies you think I should have added to the list?</p>\n</div><!-- SC_ON -->",
  "score": 45,
  "permalink": "/r/investing/comments/l0vkkl/big_investment_opportunities_in_tech_companies/",
  "subreddit": "investing",
  "id": "l0vkkl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1611311217232
}