{
  "author": "Britsu",
  "original_created_utc": 1633471147,
  "title": "Am I really bisexual If I've never technically acted on it? (NSFW)",
  "created_utc": 1633520671,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I recently discovered that I was attracted to women as well as men.<br/>\nI assumed this made me bisexual. My husband of 8 years is totally cool with it, super supportive, and even encourages it as you can imagine. (Rolls eyes)<br/>\nOther than being sexually attracted to some women, and I don&#39;t really have a type per se, I do enjoy going to the strip club, getting lap dances, and have even <span class=\"md-spoiler-text\">sucked on a stripper&#39;s titties.</span><br/>\nI guess my husband&#39;s argument is that since I have never acted on these urges in real life, outside of a club, etc, that I should still be considered heterosexual?<br/>\nThe last thing I want to do is offend the LGBTQ community. Could someone please settle this argument for us?<br/>\nI appreciate all opinions and perspectives thank you in advance!\nEdit: wow! Thank you for all the support and answers!! Now I have a solid argument! ❤️❤️❤️</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/NoStupidQuestions/comments/q26nfp/am_i_really_bisexual_if_ive_never_technically/",
  "subreddit": "NoStupidQuestions",
  "id": "q26nfp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I recently discovered that I was attracted to women as well as men.\nI assumed this made me bisexual. My husband of 8 years is totally cool with it,\nsuper supportive, and even encourages it as you can imagine. (Rolls eyes)\nOther than being sexually attracted to some women, and I don't really have…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は最近、男性だけでなく女性にも惹かれることを知りました。\nこのことから、私はバイセクシャルだと思っていました。8年間連れ添ってきた夫は、そのことをとても気に入っています。\n応援してくれていて、想像できるように励ましてもくれます。(目を丸くして)\n何人かの女性に性的に惹かれる以外に、私には本当に...",
      "title": "技術的に行動したことがない私は、本当にバイセクシャルなのか？(NSFW)"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近发现，我对女性和男性都有吸引力。\n我以为这使我成为双性恋。我结婚8年的丈夫对此完全不介意。\n超级支持，甚至还鼓励我这样做，你可以想象。(翻白眼)\n除了对一些女性有性吸引力之外，我并没有真正的...",
      "title": "如果我从未在技术上采取过行动，我真的是双性恋吗？(NSFW)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近發現，我對女性和男性都有吸引力。\n我以爲這使我成爲雙性戀。我結婚8年的丈夫對此完全不介意。\n超級支持，甚至還鼓勵我這樣做，你可以想象。(翻白眼)\n除了對一些女性有性吸引力之外，我並沒有真正的...",
      "title": "如果我從未在技術上採取過行動，我真的是雙性戀嗎？(NSFW)"
    }
  ]
}