{
  "author": "justachu93",
  "original_created_utc": 1631595278,
  "title": "Crypto feels like the last hope.",
  "created_utc": 1631611993,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As a millennial I feel like the world is against us. Homes cost 10x what our parents paid while wages have barly increased. The cost of living is becoming insane or rather is insane. Even with a well paying job I find myself living check to check and in credit card debt. I invest what I can into crypto while trying to manage my debt the best I can. A 9-5 is never going to allow me to become &quot;well off&quot;.  I have maybe earned a few nickles from a savings account thanks to the amazing 0.01% interests rates our banks give. I&#39;ve earned more staking coins this year than the last 28 years of my life in a savings account. My 401k gets about 10% a year but this is nowhere enough to retire with the insane increase of living costs. I hope we can all break free from the corruption the system. Crypto is here to stay and it will save us all.</p>\n</div><!-- SC_ON -->",
  "score": 269,
  "permalink": "/r/CryptoCurrency/comments/pnw6l9/crypto_feels_like_the_last_hope/",
  "subreddit": "CryptoCurrency",
  "id": "pnw6l9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As a millennial I feel like the world is against us. Homes cost 10x what our\nparents paid while wages have barly increased. The cost of living is becoming\ninsane or rather is insane. Even with a well paying job I find myself living\ncheck to check and in credit card debt. I invest what I can into…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ミレニアル世代として、私は世界が私たちに敵対しているように感じています。家の値段は親の10倍。\n家は親の10倍の値段で、賃金はほとんど上がっていません。生活費は非常識になりつつあります。\n狂ってきているというか、狂っています。給料の良い仕事に就いていても、気がつけば小切手やクレジットカードの借金に追われています。\nクレジットカードで借金をしています。私はできる限りの投資をしていますが...",
      "title": "暗号は最後の希望のように感じます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "作为一个千禧一代，我觉得世界在反对我们。房子的价格是我们父母的10倍\n而工资却几乎没有增长。生活成本正在变得\n疯了，或者说是疯了。即使有一份收入丰厚的工作，我发现自己的生活\n支票和信用卡债务。我把我能做的都投资到了...",
      "title": "Crypto感觉是最后的希望。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "作爲一個千禧一代，我覺得世界在反對我們。房子的價格是我們父母的10倍\n而工資卻幾乎沒有增長。生活成本正在變得\n瘋了，或者說是瘋了。即使有一份收入豐厚的工作，我發現自己的生活\n支票和信用卡債務。我把我能做的都投資到了...",
      "title": "Crypto感覺是最後的希望。"
    }
  ]
}