{
  "author": "windwalker7",
  "original_created_utc": 1630986918,
  "title": "I'm gonna say it. El Salvador is the next Elon Musk. They will cause the next bear circle.",
  "created_utc": 1631021436,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I held BTC and ETH, I love the bull run , BUT</p>\n\n<p>Let&#39;s be god damn real, a country using bitcoin as tether?, a currency which halved their value in THIS May and then almost doubled in less than 2 months go? Think about it, it is doom to fail.</p>\n\n<p>Despite the name &#39;currency&#39;. Bitcoin can only be used as store of value, an investment. Hate me but deep down you guys know I am right.</p>\n\n<p>All I can see here, is a poor country government found a way to hide their corruption through cryptocurrencies and increase their leader popularity to young people. </p>\n\n<p>I live in a poor country, I know the mindset of these &#39;leader&#39;. I can bet all my money those &#39;bitcoin ATMs&#39;, &#39;bitcoin banks&#39;, &#39;volcano bitcoin mining rigs&#39; is just bunch of false fads, used to lure people trust and will be abandon. </p>\n\n<p>I don&#39;t believe in El Salvador president. A lot of articles link him to corruption. You can easily search it up on google his name, which I can not mention here.</p>\n\n<p>I know I am FUD-ing  but keep ignoring the negative is what made big disasters in history.</p>\n</div><!-- SC_ON -->",
  "score": 171,
  "permalink": "/r/CryptoCurrency/comments/pjfdav/im_gonna_say_it_el_salvador_is_the_next_elon_musk/",
  "subreddit": "CryptoCurrency",
  "id": "pjfdav",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I held BTC and ETH, I love the bull run , BUT\n\nLet's be god damn real, a country using bitcoin as tether?, a currency which\nhalved their value in THIS May and then almost doubled in less than 2 months go?\nThink about it, it is doom to fail.\n\nDespite the name 'currency'. Bitcoin can only be used as…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はBTCとETHを保有していました、私はブルランが大好きです、しかし\n\n現実的に考えて、ビットコインをテザーとして使っている国は、今年の5月に価値が半減した通貨を\n今年の5月に価値が半分になり、その後2ヶ月足らずでほぼ2倍になった通貨？\n考えてみてください、失敗する運命にあるのです。\n\n通貨」という名前がついていますが ビットコインはテザーとしてしか使えません。",
      "title": "私は言いたい。エルサルバドルは次のイーロン・マスクだ。彼らは次のベアサークルを引き起こすだろう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我持有BTC和ETH，我喜欢这波牛市，但是\n\n让我们说实话吧，一个用比特币作为纽带的国家？\n在今年5月价值减半，然后在不到两个月的时间里几乎翻倍？\n想想看，这是注定要失败的。\n\n尽管有 \"货币 \"之名。比特币只能作为...",
      "title": "我要说的是。萨尔瓦多是下一个埃隆-马斯克。他们将造成下一个熊圈。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我持有BTC和ETH，我喜歡這波牛市，但是\n\n讓我們說實話吧，一個用比特幣作爲紐帶的國家？\n在今年5月價值減半，然後在不到兩個月的時間裏幾乎翻倍？\n想想看，這是註定要失敗的。\n\n儘管有 \"貨幣 \"之名。比特幣只能作爲...",
      "title": "我要說的是。薩爾瓦多是下一個埃隆-馬斯克。他們將造成下一個熊圈。"
    }
  ]
}