{
  "author": "crjlsm",
  "the_new_excerpt": "I know most people here are thoroughly familiar with Ethereum. But for those of\nyou who are not, Ethereum is a cryptocurrency that is used to pay transaction\nfees (gas) on the ethereum network.\n\nEthereum is a lot of things to a lot of people, but at its core it is a\nprogramming language with a…",
  "original_created_utc": 1618377786,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここにいるほとんどの人は、イーサリアムについて徹底的に知っていると思います。しかし、そうでない方のために\nイーサリアムは暗号通貨であり、取引手数料（ガ\n取引手数料（ガス）を支払うための暗号通貨です。\n\nイーサリアムは多くの人にとっていろいろなものがありますが、その核となるのは\nのあるプログラミング言語です。",
      "title": "ETH/USDのブル・テーゼを視野に入れる"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道这里的大多数人都对Ethereum彻底熟悉。但对于那些\n你谁是不，Ethereum是一种加密货币，是用来支付交易的\n费（汽油）在以太坊网络上。\n\n对很多人来说，Ethereum是很多东西，但它的核心是一个。\n编程语言与...",
      "title": "从角度看ETH/美元的牛市论题"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道這裏的大多數人都對Ethereum徹底熟悉。但對於那些\n你誰是不，Ethereum是一種加密貨幣，是用來支付交易的\n費（汽油）在以太坊網絡上。\n\n對很多人來說，Ethereum是很多東西，但它的核心是一個。\n編程語言與...",
      "title": "從角度看ETH/美元的牛市論題"
    }
  ],
  "title": "Putting in perspective the ETH/USD bull thesis",
  "created_utc": 1618425648,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I know most people here are thoroughly familiar with Ethereum. But for those of you who are not, Ethereum is a cryptocurrency that is used to pay transaction fees (gas) on the ethereum network. </p>\n\n<p>Ethereum is a lot of things to a lot of people, but at its core it is a programming language with a native crypto, allowing people to develop Decentralized applications, smart contracts, DAOs, NFTs, and so much more; these use cases are already beginning to fundamentally change the way business and finance is conducted and transacted. \nCrypto as a whole is beginning to fundamentally alter the way we <em>perceive</em> money, the way we perceive ownership, what we consider to be valuable, and these and a whole host of other radical changes are sure to only accelerate. Institutions, as we are now more than aware, have taken notice. </p>\n\n<p>Most institutional interest is in Bitcoin, and it looks to remain that way for some time as more legacy firms dip their toes in. However, interest in ETH has begun to skyrocket, as people(and institutions)  realize all the ways it is different than BTC, and are trying to wrap their heads around a potential future valuation. </p>\n\n<p>Which brings us to the bull thesis, and I would caution I&#39;m being overly optimistic here but frankly my conviction is unshakeable: that Ethereum will one day be the foundational layer, or a component thereof, of essentially <em>all</em> software applications, current and future. Video games, digital merchandise, physical merchandise, all finance including derivatives, retirement plans, all corporate entities existing as DAOs, all virtual reality apps and uses, etc. The list goes on. There is not a single app, entity, or software product that wont be at least partially built on ETH, or in some way connected to it. Even entirely separate competitors must remain compatible, and it only follows that most of their volume will find it&#39;s way to ethereum one way or another.</p>\n\n<p>&quot;How and why will this come to pass? Why ETH? And how does this help me wrap my head around a potential valuation?&quot; </p>\n\n<ol>\n<li><p>Because decentralized organizations can outcompete centralized entities. This is basic economics. These businesses are in high demand fields, are able to automate processes that we hire people to do, and therefore have essentially very little to no overhead on a relative basis. Credit markets can operate where yields beat banks. Some yields beat stocks. Some yields beat TECH STOCKS.  There is value being created and money being saved at every turn, and stakeholders profit handsomely along the way. \nThe consumer gets a cheaper, better product, and the stakeholders enjoy high returns. Centralized entities have to adapt (decentralize) or be crushed. You&#39;re seeing this already with DEXs vs CEXs, Binance has already begun to adapt. Coinbase is going public but they have recently hinted at a coin of their own, and you know what that means. As decentralization spreads further into finance and into other industries, so too will this paradigm. </p></li>\n<li><p>Why ETH? because, and this is a very recent development, it would appear that ETH has been &quot;chosen&quot; so to speak. That is to say, the United States and US corporate entities have begun to view it favorably, and seem to be choosing it over other options. USDC is built on ethereum, a 1:1 USD backed ERC-20 token. The government likes that very much. Visa and Mastercard have both begun settling transactions on the Ethereum chain. Firms like Bain capital are investors in projects like Compound finance. JPMorgan and others recently invested in Consensys&#39; latest funding round, the biggest developer on ETH at the moment.\nOther blockchains have advantages to ethereum, this is true. Their weaknesses, from the perspective of institutions and our government, lie in their sometimes more centralized nature, their ties to foreign governments, and their use in illicit activities. Ethereum is really the only network of it&#39;s kind and size that can be said to be decentralized and owing allegiance to no one country moreso than another.\nCountries like China, NK, Russia, Venezuela, and Iran have used Bitcoin and seem to be trying to accumulate as much as possible. I&#39;m not saying that&#39;s not the case with ETH, but the US has a clear opportunity to be the top player in the ETH space, and to pretty much ensure it is the global standard as such. If they see Bitcoin as a national security issue, then ETH is the foile. They will take the dollar digital, and they will use ETH to cement ensure it&#39;s spread in the digital age.</p></li>\n<li><p>How does this help anyone wrap their heads around a potential valuation? It doesnt! But the scale of what we are dealing with should be coming more into focus for you. Nothing like this has ever existed before. </p></li>\n</ol>\n\n<p>Finally, and to really complicate matters, is EIP 1559 and Ethereum 2. Without going too much into either of these things, I&#39;ll touch on one aspect of EIP-1559, specifically, the burn mechanism. EIP 1559 introduces a burn mechanism to ethereum transactions, meaning every time a transaction occurs on the chain, a tiiiiiiny little bit of ETH is &quot;burnt&quot; and therefore removed from supply forever. \nThink about the potential scale of ethereum we just covered. Think about the # of transactions on a network of that size. Now, imagine how much of the supply will be destroyed.\n Bitcoin&#39;s supply is currently ~19.5m, with a total supply of 21m. Scarce, to be sure. Only 1.5m more bitcoin will ever exist, and it will take years to mine it. Ethereum&#39;s supply is ~120m, with no fixed supply. However, that changes with EIP 1559 and ETH 2. Taking both coins&#39; total supply, and assuming ETH scales the way I expect it to, ETH will overtake Bitcoin in scarcity terms-this is almost an inevitability. But heres the kicker: Whatever is left after all that deflation? That&#39;s what you and I are buying. That&#39;s what institutions are buying. People still need that to pay gas. The demand is ever present.</p>\n\n<p>Which brings us back to valuation. You want me to name a price target, I know. Well, I&#39;m not going to. All I can say is that taking all of the above into account, along with the way monetary policy is heading, I believe that ETH is a unique asset in that it&#39;s market cap is totally unfettered. Trillions seem paltry. Hundreds of trillions is more likely, if not more ludicrous figures I dont dare name. My bear case is pretty much that it <em>only</em> encompasses the entire financial industry one day.  Ho-hum. </p>\n\n<p>TL;DR: we fuckin wit some crazy shit bois </p>\n\n<p>And Disclaimer: I hold and am long Ethereum, Chainlink, The Graph, and Ren. 40%, 40%, 10% and 10%, respectively, and have been buying since spring of 2020. I do not hold any Bitcoin, but that doesnt mean it wont appreciate right there along with ETH. I personally just expect ETH to eventually outpace it, I am not suggesting anyone sell or stop buying BTC. On the contrary, BTC has it&#39;s own unique properties that make it compelling. Own both! </p>\n\n<p>Ps: decrypt if you reading this hire my ass</p>\n\n<p>Pps: yahoo finance too, your crypto analysts suck</p>\n\n<p>Ppps: Cathie Wood, notice me</p>\n</div><!-- SC_ON -->",
  "score": 172,
  "permalink": "/r/CryptoCurrency/comments/mqjx2v/putting_in_perspective_the_ethusd_bull_thesis/",
  "subreddit": "CryptoCurrency",
  "id": "mqjx2v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566615682
}