{
  "author": "starla_apple",
  "original_created_utc": 1633464118,
  "title": "Am I weird for being obsessed with having sex with my partner?",
  "created_utc": 1633469887,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Well I think I’ve always been a hypersexual woman. I used to masturbate daily before I was married. My husband and I enjoy sex a lot. Now, I am obsessed with having intercourse with my husband. My mouth literally waters for his dick. I love being in control of his pleasure with my mouth. Geeze just thinking about his penis makes me so wet. He takes his time, he gives me multiple orgasms. He makes me moan and writhe with pleasure. I find myself getting aroused throughout the day just thinking about him. We have been married nearly 15 years. Am I weird?</p>\n</div><!-- SC_ON -->",
  "score": 145,
  "permalink": "/r/TooAfraidToAsk/comments/q24b3e/am_i_weird_for_being_obsessed_with_having_sex/",
  "subreddit": "TooAfraidToAsk",
  "id": "q24b3e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Well I think I’ve always been a hypersexual woman. I used to masturbate daily\nbefore I was married. My husband and I enjoy sex a lot. Now, I am obsessed with\nhaving intercourse with my husband. My mouth literally waters for his dick. I\nlove being in control of his pleasure with my mouth. Geeze just…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は昔から性欲の強い女性だったと思います。結婚する前は毎日オナニーをしていました。\n結婚する前は毎日オナニーしていました。夫とはセックスをとても楽しんでいます。今、私が夢中になっているのは\n夫との性交に夢中になっています。私の口は文字通り彼のペニスを求めています。I\n私の口で彼の喜びをコントロールするのが大好きです。ジーズ...ただ...",
      "title": "パートナーとのセックスにこだわっている私は変ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，我想我一直是个性欲旺盛的女人。我曾经每天手淫\n在我结婚之前。我丈夫和我非常享受性生活。现在，我痴迷于\n与我丈夫性交。我的嘴简直是在为他的阴茎而流泪。I\n我喜欢用我的嘴来控制他的快乐。啧啧，只是...",
      "title": "我迷恋与我的伴侣做爱，是不是很奇怪？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，我想我一直是個性慾旺盛的女人。我曾經每天手淫\n在我結婚之前。我丈夫和我非常享受性生活。現在，我癡迷於\n與我丈夫性交。我的嘴簡直是在爲他的陰莖而流淚。I\n我喜歡用我的嘴來控制他的快樂。嘖嘖，只是...",
      "title": "我迷戀與我的伴侶做愛，是不是很奇怪？"
    }
  ]
}