{
  "author": "sheritajanita",
  "original_created_utc": 1658388339,
  "title": "Is it strange to change or bathe in front of my child?",
  "created_utc": 1658403358,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For some context, he&amp;#39;s 6 and I&amp;#39;m a single mum. We have a great bond and until about a year ago we would still sometimes share the bathtub and I still get changed (but quickly) in front of him. He doesn&amp;#39;t react to it or stare or comment, it&amp;#39;s just normal. I&amp;#39;ve always considered it normalizing people&amp;#39;s bodies and acceptance etc but maybe I&amp;#39;m weird...?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 115,
  "permalink": "/r/TooAfraidToAsk/comments/w4abcj/is_it_strange_to_change_or_bathe_in_front_of_my/",
  "subreddit": "TooAfraidToAsk",
  "id": "w4abcj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "For some context, he's 6 and I'm a single mum. We have a great bond and until\nabout a year ago we would still sometimes share the bathtub and I still get\nchanged (but quickly) in front of him. He doesn't react to it or stare or\ncomment, it's just normal. I've always considered it normalizing…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "参考までに、彼は6歳、私はシングルマザーです。私たちはとても絆が深く、1年ほど前までは\n1年前までは、お風呂も一緒で、私が着替えをすることもありました。\n着替えをします。彼はそれに反応することも、見つめることも、コメントすることもなく、普通に過ごしています。\n普通にしてる。私はそれを普通だと思っていたのですが・・・。",
      "title": "子どもの前で着替えや入浴をするのはおかしいですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "为了了解情况，他今年6岁，我是一个单亲妈妈。我们有很好的关系，直到\n直到一年前，我们有时还会分享浴缸，我还会在他面前换衣服（但很快）。\n在他面前换衣服（但很快）。他没有任何反应，也没有盯着我看或发表意见，这很正常。\n评论，这很正常。我一直认为这是正常的...",
      "title": "在我的孩子面前换衣服或洗澡是不是很奇怪？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "爲了瞭解情況，他今年6歲，我是一個單親媽媽。我們有很好的關係，直到\n直到一年前，我們有時還會分享浴缸，我還會在他面前換衣服（但很快）。\n在他面前換衣服（但很快）。他沒有任何反應，也沒有盯着我看或發表意見，這很正常。\n評論，這很正常。我一直認爲這是正常的...",
      "title": "在我的孩子面前換衣服或洗澡是不是很奇怪？"
    }
  ]
}