{
  "author": "hisholinessleoxiii",
  "original_created_utc": 1658068389,
  "title": "What led to the fall of Robespierre?",
  "created_utc": 1658117136,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t really understand what happened with Robespierre. He&amp;#39;s basically all-powerful, condemning people to the guillotine and crushing all opposition. On 8 Thermidor he gave a speech announcing there were more traitors. Suddenly, the National Convention announces that Robespierre is, himself, a traitor, he&amp;#39;s arrested and guillotined, and his policy of terror is outlawed. It seemed like he had their full support until he gave his speech on 8 Thermidor. What am I missing? What actually happened to make Robespierre fall so suddenly and dramatically? Was it really because of one speech, or was there something else happening behind the scenes?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 112,
  "permalink": "/r/AskHistorians/comments/w18qt5/what_led_to_the_fall_of_robespierre/",
  "subreddit": "AskHistorians",
  "id": "w18qt5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I don't really understand what happened with Robespierre. He's basically\nall-powerful, condemning people to the guillotine and crushing all opposition.\nOn 8 Thermidor he gave a speech announcing there were more traitors. Suddenly,\nthe National Convention announces that Robespierre is, himself, a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ロベスピエールのことはよくわからないんです。彼は基本的に\nギロチンにかけられ、反対派をすべて打ち負かす、全能の男です。\n8日のテルミドールでは、さらに裏切り者が出たと演説しています。突如として\n国民議会はロベスピエール自身が...",
      "title": "ロベスピエールを陥落させたのは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不太明白罗伯斯庇尔的事。他基本上是\n他基本上是全能的，将人们送上断头台，粉碎所有的反对意见。\n在Thermidor 8日，他发表了一个演讲，宣布有更多的叛徒。忽然之间。\n国民大会宣布，罗伯斯庇尔本人就是一个...",
      "title": "是什么导致了罗伯斯庇尔的倒台？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不太明白羅伯斯庇爾的事。他基本上是\n他基本上是全能的，將人們送上斷頭臺，粉碎所有的反對意見。\n在Thermidor 8日，他發表了一個演講，宣佈有更多的叛徒。忽然之間。\n國民大會宣佈，羅伯斯庇爾本人就是一個...",
      "title": "是什麼導致了羅伯斯庇爾的倒臺？"
    }
  ]
}