{
  "author": "Master_Ad9853",
  "original_created_utc": 1634019776,
  "title": "As a 19 year old, idk if I am doing this side project thing correctly",
  "created_utc": 1634038293,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello fellow ambitious folks, </p>\n\n<p>First time posting on Reddit, so this is a little scary. Here I go, I am a 19-year-old university student that has been working on a side project idea over the summer: students do cheap labor in their fields/major for experience. Businesses/students can use this labor to do small tasks from cleaning to data analytics. I have created an MVP in flutter, but I keep chasing so many ideas and change my app constantly. I keep asking my business co-founder to find testers in order to determine the market for the app, but he is waiting on me to create a much better app. I have put too much time into this, but I do not want to keep putting in time if no one is interested. What should I do? I keep hearing conflicting advice like test the MVP, but if it is bad, they would bad-mouth it. </p>\n\n<p>Thank you for any advice in advance :&#39;)</p>\n\n<p>If you want to check out our &#39;landing/launch&#39; page:</p>\n\n<p>yab.mailchimpsites.com</p>\n</div><!-- SC_ON -->",
  "score": 5,
  "permalink": "/r/SideProject/comments/q6ftaz/as_a_19_year_old_idk_if_i_am_doing_this_side/",
  "subreddit": "SideProject",
  "id": "q6ftaz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hello fellow ambitious folks,\n\nFirst time posting on Reddit, so this is a little scary. Here I go, I am a\n19-year-old university student that has been working on a side project idea over\nthe summer: students do cheap labor in their fields/major for experience.\nBusinesses/students can use this labor…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "野心家の皆さん、こんにちは。\n\nRedditへの投稿は初めてなので、ちょっと怖いです。さて、私は19歳の大学生です。\n私は19歳の大学生で、夏休みにサイドプロジェクトのアイデアに取り組んでいます。\n学生が経験を積むために、自分の専門分野で安い労働力を提供する。\n企業や学生はこの労働力を...",
      "title": "19歳の私がこのサイドプロジェクトを正しく行っているかどうかはわかりません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "各位雄心勃勃的朋友们，大家好。\n\n第一次在Reddit上发帖，所以这有点吓人。我在这里，我是一个\n我是一个19岁的大学生，在暑假期间一直在研究一个副业的想法。\n我是一个19岁的大学生，在暑假期间一直在研究一个副业的想法：学生在他们的领域/专业中做廉价的劳动以获得经验。\n企业/学生可以利用这些劳动力...",
      "title": "作为一个19岁的年轻人，我不知道我做这个副业是否正确。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "各位雄心勃勃的朋友們，大家好。\n\n第一次在Reddit上發帖，所以這有點嚇人。我在這裏，我是一個\n我是一個19歲的大學生，在暑假期間一直在研究一個副業的想法。\n我是一個19歲的大學生，在暑假期間一直在研究一個副業的想法：學生在他們的領域/專業中做廉價的勞動以獲得經驗。\n企業/學生可以利用這些勞動力...",
      "title": "作爲一個19歲的年輕人，我不知道我做這個副業是否正確。"
    }
  ]
}