{
  "author": "cheeseburger_daddy",
  "original_created_utc": 1629206789,
  "title": "Ever feel like you’re becoming “that guy”…?",
  "created_utc": 1629232252,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Well, it has finally happened to me. </p>\n\n<p>Was having a few drinks with some friends last night, the topic gradually got towards finance, and as soon as I started mentioning crypto all I got in return was a <em>not again with this shit dude, we’ve heard it enough</em>. </p>\n\n<p>As the night went on, we went off to a party, joined some other friends. Saw some acquaintances there, greeted me with “<em>ahh, here he is, mr crypto guy</em>” as they laughed, sarcastically. </p>\n\n<p>Off to breakfast this morning, somewhat hungover, reading the news and mention something about Bitcoin to my mum - “<em>Madooo, ora basta con sto Bitcoin, non a colazione cazzo</em>” is her response (which is Italian mum for “stop breaking my dick with Bitcoin”). </p>\n\n<p>Then it hit me. I’ve officially become <em>that fucking guy</em>.</p>\n\n<p>What do I do now my guys?</p>\n</div><!-- SC_ON -->",
  "score": 165,
  "permalink": "/r/CryptoCurrency/comments/p63r1b/ever_feel_like_youre_becoming_that_guy/",
  "subreddit": "CryptoCurrency",
  "id": "p63r1b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Well, it has finally happened to me.\n\nWas having a few drinks with some friends last night, the topic gradually got\ntowards finance, and as soon as I started mentioning crypto all I got in return\nwas a not again with this shit dude, we’ve heard it enough.\n\nAs the night went on, we went off to a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ついに私にも起こってしまいました。\n\n昨晩、友人たちと飲んでいたとき、話題はだんだんと金融に移っていきました。\n金融の話になり、私が暗号の話を始めた途端、返ってきたのは\nもう聞き飽きたよ、この手の話はやめてくれよ」と言われてしまいました。\n\n夜が更けるにつれ、私たちは...",
      "title": "自分が \"あの人 \"になっていると感じたことはありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，它终于发生在我身上了。\n\n昨晚和一些朋友喝了几杯，话题逐渐转到了\n金融，我一提到加密货币，得到的回答是\n我就说不要再提这个了，我们已经听够了。\n\n随着夜幕的降临，我们去了一个...",
      "title": "有没有感觉到你正在成为 \"那个人\"...？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，它終於發生在我身上了。\n\n昨晚和一些朋友喝了幾杯，話題逐漸轉到了\n金融，我一提到加密貨幣，得到的回答是\n我就說不要再提這個了，我們已經聽夠了。\n\n隨着夜幕的降臨，我們去了一個...",
      "title": "有沒有感覺到你正在成爲 \"那個人\"...？"
    }
  ]
}