{
  "author": "Pma2kdota",
  "original_created_utc": 1630665887,
  "title": "Unpopular opinion: I don't care about gas fees because I hold all my coins on an exchange",
  "created_utc": 1630679463,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Yeah, I know. &quot;Not your keys not your coins.&quot; I understand, it sounds risky. </p>\n\n<p>But have I paid even a penny in transaction fees? Nope.</p>\n\n<p>Did I spend $100+ on a hardware wallet? Nope, I looked at the cool wallets online and put that $ directly into the last ETH dip. </p>\n\n<p>Am I investing only what I can afford to lose? Nope, a rugpull/exchange hack would ruin me financially.</p>\n\n<p>How do I sleep at night? (<em>I don&#39;t, but not because of this</em>)</p>\n\n<p>I have accounts on multiple KYC exchanges, each with a different $ amount of my portfolio based on how comfortable I am with holding that amount on the particular exchange. Some exchanges have more coins available than others, so that&#39;s another factor. One of these exchanges is listed directly on the NASDAQ. Another exchange is a subsidiary of a company listed on the CSE (Canadian Stock Exchange). <strong>Note: both DO have the option to withdraw your crypto, so it is &quot;mine&quot;.</strong> It&#39;s 2FA secured and I am forewarned about any maintenance that limits my ability to trade.</p>\n\n<p>If these guys run away with my crypto, I think the SEC and CSA (Canadian Securities Administrators) will finally have a reason to stop browsing p*rnhub. It will give them a reason to bring that &quot;regulation&quot; that Gary Gensler is hot for. So I personally choose to believe the days of Mt.Gox and Quadriga are behind us, when it comes to BrandName<sup>TM</sup> exchanges. And that&#39;s why I don&#39;t complain about gas fees. Because I only pay the spread between buying and selling. </p>\n\n<p>With crypto gaining adoption, and being accepted as a security in some states, surely many are to follow. I believe this will lead to more investors and more people being comfortable with depositing and holding funds on an exchange, similar to on a brokerage when trading stocks.</p>\n\n<p>Anyways, just my 2 sats.</p>\n</div><!-- SC_ON -->",
  "score": 226,
  "permalink": "/r/CryptoCurrency/comments/ph2p7z/unpopular_opinion_i_dont_care_about_gas_fees/",
  "subreddit": "CryptoCurrency",
  "id": "ph2p7z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Yeah, I know. \"Not your keys not your coins.\" I understand, it sounds risky.\n\nBut have I paid even a penny in transaction fees? Nope.\n\nDid I spend $100+ on a hardware wallet? Nope, I looked at the cool wallets\nonline and put that $ directly into the last ETH dip.\n\nAm I investing only what I can…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ええ、そうですね。\"鍵ではなく......コインでもなく......\" わかります、危険な感じがしますよね。\n\nでも、取引手数料を1円でも払ったことがありますか？ありません。\n\nハードウェアウォレットに100ドル以上費やしましたか？いや、オンラインでクールなウォレットを見て\nオンラインでクールなウォレットを見て、そのお金を最後のETHのディップに直接入れました。\n\n私は自分ができることだけに投資しているのでしょうか...",
      "title": "不人気な意見ですが コインはすべて取引所で保有しているので、ガス料金は気にしない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "是的，我知道。\"不是你的钥匙不是你的硬币。\" 我明白，这听起来很有风险。\n\n但我有没有支付过哪怕是一分钱的交易费？没有。\n\n我花了100多美元买了一个硬件钱包吗？没有，我在网上看了一些很酷的钱包\n并把这些钱直接投入到最后一次ETH的下跌中。\n\n我是否只投资了我能...",
      "title": "不受欢迎的意见。我不关心汽油费，因为我在交易所持有我所有的硬币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "是的，我知道。\"不是你的鑰匙不是你的硬幣。\" 我明白，這聽起來很有風險。\n\n但我有沒有支付過哪怕是一分錢的交易費？沒有。\n\n我花了100多美元買了一個硬件錢包嗎？沒有，我在網上看了一些很酷的錢包\n並把這些錢直接投入到最後一次ETH的下跌中。\n\n我是否只投資了我能...",
      "title": "不受歡迎的意見。我不關心汽油費，因爲我在交易所持有我所有的硬幣。"
    }
  ]
}