{
  "author": "specspecspec",
  "the_new_excerpt": "As all you BBheads knows, the QNX is BlackBerrys flagship product. A software\nfor your car that makes it smarter than all you retards in this community\ncombined. They make alot of other products and has historically been very\ninnovative products (yes maybe not when mr stevey jobs smashed it with…",
  "original_created_utc": 1611511264,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "各位BB头都知道，QNX是黑莓的旗舰产品。一个软件\n为你的车，使它比你所有的弱智在这个社区的智能\n结合起来。他们做了很多其他的产品，并且在历史上一直是非常。\n创新产品（是的，也许不是当史蒂维-乔布斯先生用...",
      "title": "$BB短期内会月，但不是因为基本面。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "各位BB頭都知道，QNX是黑莓的旗艦產品。一個軟件\n爲你的車，使它比你所有的弱智在這個社區的智能\n結合起來。他們做了很多其他的產品，並且在歷史上一直是非常。\n創新產品（是的，也許不是當史蒂維-喬布斯先生用...",
      "title": "$BB短期內會月，但不是因爲基本面。"
    }
  ],
  "title": "$BB will moon in the short term, but not because of fundamentals.",
  "created_utc": 1611583965,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As all you BBheads knows, the QNX is BlackBerrys flagship product. A software for your car that makes it smarter than all you retards in this community combined. They make alot of other products and has historically been very innovative products (yes maybe not when mr stevey jobs smashed it with the smartphone). But all of that does not really matter.</p>\n\n<p>What matters now is the WSB megamainstream storm that we are currently in and will be after the gme squeeze is over (which its not, it just got the start signal last friday). But look at this now, GME was thought to be a blockbuster company but hardcore WSBers did their homework and unleashed the massive autist attack. WSB saw a big increase in traders during 2020, globally we went from roughly 4-5% retail traders to a staggering 20% in 2020. </p>\n\n<p>We are getting unprecedented attention, they see us as the community that revived a dying brick and mortar retailer and surged the stock price. The same goes for $BB. The company was seen as a dying one when they couldn&#39;t keep up with their competitors in the phone game. They have completely changed and with this GME thing, people will jump on the rocket ship like never before since $BB has garnered huge attention in the mists of  the GME play. New hoards of people are lurking in this subreddit trying to find our next play. If you like money this train has not even left the station yet and the price is still a steal.</p>\n\n<p>EDIT: I am not a financial advisor. I&#39;m saying that I personally would be in at the current price to see how it plays out. Buy at your own risk.</p>\n</div><!-- SC_ON -->",
  "score": 1572,
  "permalink": "/r/wallstreetbets/comments/l44d6y/bb_will_moon_in_the_short_term_but_not_because_of/",
  "subreddit": "wallstreetbets",
  "id": "l44d6y",
  "is_self": true,
  "media": null,
  "is_video": false
}