{
  "author": "wenchanted",
  "the_new_excerpt": "I have a degree in accountancy, 5 years exp in finance as an analyst. I quit to\nrun my own business for 6 years and recently exited due to COVID.\n\nStarted investing a few months ago.\n\nI know most people get CFA for professional reasons. However, I have no\nintention of going back to full time…",
  "original_created_utc": 1612079797,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我有会计学学位，在金融领域有5年的分析师经验。我辞职后\n经营自己的生意6年，最近由于COVID的原因退出了。\n\n几个月前开始投资。\n\n我知道大多数人考CFA是出于专业原因。但是，我没有\n打算回到全职工作...",
      "title": "我是否应该考取CFA来学习更多的投资知识？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我有會計學學位，在金融領域有5年的分析師經驗。我辭職後\n經營自己的生意6年，最近由於COVID的原因退出了。\n\n幾個月前開始投資。\n\n我知道大多數人考CFA是出於專業原因。但是，我沒有\n打算回到全職工作...",
      "title": "我是否應該考取CFA來學習更多的投資知識？"
    }
  ],
  "title": "Should I get a CFA to learn more about investing?",
  "created_utc": 1612145529,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have a degree in accountancy, 5 years exp in finance as an analyst. I quit to run my own business for 6 years and recently exited due to COVID. </p>\n\n<p>Started investing a few months ago. </p>\n\n<p>I know most people get CFA for professional reasons. However, I have no intention of going back to full time employment in the foreseeable future. </p>\n\n<p>It will purely be for the purpose of getting more in depth knowledge how markets work and reviewing/adding to what I have learned in uni and work. I’m hoping that it can help me analyse the market and companies more thoroughly and make better investment decisions. </p>\n\n<p>Well and maybe getting a , CFA Charter Holder beside my name would be pretty spiffy. </p>\n\n<p>Is pursuing a CFA a way to get all the knowledge I need in an organised way? </p>\n\n<p>Or should I just watch some investment courses on udemy and call it a day?</p>\n</div><!-- SC_ON -->",
  "score": 59,
  "permalink": "/r/investing/comments/l97rf2/should_i_get_a_cfa_to_learn_more_about_investing/",
  "subreddit": "investing",
  "id": "l97rf2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518534776
}