{
  "author": "nobjos",
  "the_new_excerpt": "Let’s be real here. We all have bought into an IPO that we regretted. We might\nhave been swayed by the Red Herring report, the marketing pitch, or the\ninvestment banks' roadshow. I personally have lost money in both the IPOs that I\nbought into and now avoid IPOs like the plague. However, I wanted to…",
  "original_created_utc": 1623504948,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここで現実を見てみましょう。誰もが後悔するようなIPOを買ったことがあるでしょう。私たちは\nレッドハーリングレポート、マーケティングピッチ、または投資銀行のロードショーに振り回されたかもしれません。\n投資銀行のロードショーに振り回されたかもしれません。私は個人的に、自分が買ったIPOと現在のIPOの両方でお金を失ったことがあります。\n今ではIPOを避けるようになりました。しかし、私が望んだのは...",
      "title": "過去20年間の3600件以上のIPOを分析し、IPOを買うべきかどうかを判断しました。その結果は以下の通りです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "让我们在这里说实话吧。我们都曾买入过令我们后悔的IPO。我们可能\n我们可能被红鲱鱼的报告、市场宣传或投资银行的路演所动摇。\n投资银行的路演。我个人在我买入的两次IPO中都损失了钱。\n现在我像躲避瘟疫一样躲避IPO。然而，我想...",
      "title": "我分析了过去20年的3600多个IPO，以确定你是否应该买入IPO。下面是结果!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "讓我們在這裏說實話吧。我們都曾買入過令我們後悔的IPO。我們可能\n我們可能被紅鯡魚的報告、市場宣傳或投資銀行的路演所動搖。\n投資銀行的路演。我個人在我買入的兩次IPO中都損失了錢。\n現在我像躲避瘟疫一樣躲避IPO。然而，我想...",
      "title": "我分析了過去20年的3600多個IPO，以確定你是否應該買入IPO。下面是結果!"
    }
  ],
  "title": "I analyzed 3600+ IPOs over the past two decades to determine if you should buy into an IPO. Here are the results!",
  "created_utc": 1623526408,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Let’s be real here. We all have bought into an IPO that we regretted. We might have been swayed by the Red Herring report, the marketing pitch, or the investment banks&#39; roadshow. I personally have lost money in both the IPOs that I bought into and now avoid IPOs like the plague. However, I wanted to keep my personal experience out of the analysis and wanted to understand</p>\n\n<p><strong>Whether IPOs in general make or lose money for the average investor?</strong></p>\n\n<p><strong>Where is the data from:</strong> iposcoop.com</p>\n\n<p>This is the first time in any of the analyses that I have done where the data was accessible directly in a usable format. They have documented almost all of the IPOs from 2000. I have cross verified the data with <a href=\"https://www.statista.com/statistics/270290/number-of-ipos-in-the-us-since-1999/\">Statista</a> and have observed coverage of more than 90%. This period covers a wide variety of situations such as the dot-com crash, 2008 financial crisis, market rally following the crisis, etc. which implies that our analysis covers both bear and bull market.,</p>\n\n<p>All the IPOs and my analysis have been shared on a Google sheet at the end.</p>\n\n<p><a href=\"https://preview.redd.it/8cfa0ni07u471.png?width=624&amp;format=png&amp;auto=webp&amp;s=cc604e1016e7aa4550141751f9904567d7209daf\">https://preview.redd.it/8cfa0ni07u471.png?width=624&amp;format=png&amp;auto=webp&amp;s=cc604e1016e7aa4550141751f9904567d7209daf</a></p>\n\n<p><strong>Analysis</strong></p>\n\n<p>Before we jump into the analysis, there are some things we need to understand about IPOs (if you know the inner workings of an IPO, please feel free to skip to the results). When a company wants to go public, they hire investment bankers to sell the shares. The investment banks are then responsible for creating interest, choosing the optimum time to go public, and make sure the price is right so that there is enough demand. But the banks offer a large share of the allocated stock to institutional investors such as pensions, endowments, or hedge funds. Retail brokerages can end up getting shares, but they may make up only <a href=\"https://money.usnews.com/investing/investing-101/articles/how-to-buy-ipo-stock-at-its-offer-price\">10% of the total allotment</a>.</p>\n\n<p>Adding to this, additional factors such as your brokerage account, account balance, the historical trading pattern will all contribute to whether you get the IPO shares or not. (i.e., Brokerages tend to allocate IPO shares to their premium clients). For e.g., in the case of <a href=\"https://www.tdameritrade.com/investment-products/IPOs.html\">TD Ameritrade</a>, your account must have a value of at least $250,000 or have completed 30 trades in the last 3 months.</p>\n\n<p>I have factored in the above limitations and have calculated the historical performance of the IPOs in two different ways</p>\n\n<p>a. You get the IPO allocated at the offer price (the price at which institutional investors are buying)</p>\n\n<p>b. You buy the IPO when the market opens on the listing day (opening price)</p>\n\n<p>For the above scenarios, I have analyzed the following</p>\n\n<ul>\n<li>Listing Change (Difference between Opening price and Offer price)</li>\n<li>One day change - inclusive of listing</li>\n<li>One day change - exclusive of listing</li>\n</ul>\n\n<p>To make it simple, let’s take the example of company X. If the offer price of the IPO is $10, the Opening price on the day of the IPO is $12 and the Closing price is $15 then,</p>\n\n<ul>\n<li>Listing change is +20%</li>\n<li>One day change inclusive of the listing is +50%</li>\n<li>One day change exclusive of the listing is +25%</li>\n</ul>\n\n<p><strong>Results</strong></p>\n\n<p><a href=\"https://preview.redd.it/vby0prh27u471.png?width=950&amp;format=png&amp;auto=webp&amp;s=be6276dde250412988455ba3d78d3b7e37418e24\">https://preview.redd.it/vby0prh27u471.png?width=950&amp;format=png&amp;auto=webp&amp;s=be6276dde250412988455ba3d78d3b7e37418e24</a></p>\n\n<p>On average, IPOs did make money for the investor. But the amount is significantly different if you got allocated the IPO at offer price vs you bought the IPO at market open. The average listing change over the last two decades was 12% and the average one-day gain in the market inclusive of the listing was 13.6%. Adding to this more than 68% of the IPOs ended in green on the listing day.</p>\n\n<p>But the story is markedly different if you choose to buy at the market open. Only 48% of the IPOs ended at a price higher than the opening price and the average change was a mere 1.3%. Now that it’s out of the way, diving deeper into the data brings interesting insights.</p>\n\n<p><a href=\"https://preview.redd.it/7f5sbp547u471.png?width=1033&amp;format=png&amp;auto=webp&amp;s=733dc5a1fb88e6c1d49490c2278c0e17d20913f3\">https://preview.redd.it/7f5sbp547u471.png?width=1033&amp;format=png&amp;auto=webp&amp;s=733dc5a1fb88e6c1d49490c2278c0e17d20913f3</a></p>\n\n<p>Above is the list of top 10 IPOs having the most amount of gain on listing day. Baidu.com made a whopping 354% on its listing day. Another interesting observation is 6 out of 10 companies in the list were listed in 2000 and were predominantly tech companies (just before the dot com crash). But not all companies had a great experience on the IPO day. Here is a list of the worse performing companies on the day of listing. </p>\n\n<p><a href=\"https://preview.redd.it/562w2az57u471.png?width=1034&amp;format=png&amp;auto=webp&amp;s=dfeeb4dcd44348538c657d3cfc0fb4a3920e6d59\">https://preview.redd.it/562w2az57u471.png?width=1034&amp;format=png&amp;auto=webp&amp;s=dfeeb4dcd44348538c657d3cfc0fb4a3920e6d59</a></p>\n\n<p>There are certainly some familiar names on the list. <a href=\"https://www.seattletimes.com/business/funko-stock-plunges-in-ipo-shocker/\">Funko IPO</a> is considered to have the worst first-day return for an IPO in the last two decades. Sundial Growers also had a rough time in the market on its listing day with the stock losing 35% of the value in one day. </p>\n\n<p><a href=\"https://preview.redd.it/c71zm1j77u471.png?width=1186&amp;format=png&amp;auto=webp&amp;s=5a5b5009abef9c0e0f90c4166767ef878824a730\">https://preview.redd.it/c71zm1j77u471.png?width=1186&amp;format=png&amp;auto=webp&amp;s=5a5b5009abef9c0e0f90c4166767ef878824a730</a></p>\n\n<p>I also calculated the IPO returns for each year after 2000. As expected, the year 2000 was the most successful year for an IPO with an average return (inclusive of listing gain) of 35%. The worst year was 2008 (after the financial crisis) with only a 2.3% return. This graph also showcases two important things</p>\n\n<p>a. On average the IPOs have made positive returns every year in the last two decades</p>\n\n<p>b. There is a vast difference in your returns based on if you got the stock at offer price vs opening price and the trend holds across the years.</p>\n\n<p>This brings us to our final question of which investment bank made the most number of IPOs and how was their performance on listing day</p>\n\n<p><a href=\"https://preview.redd.it/dxy9xq597u471.png?width=1028&amp;format=png&amp;auto=webp&amp;s=dc4dbd6096edbb790669325b91cce48759b4f393\"> </a></p>\n\n<p>Out of the top 10 list, only 3 Investment banks had below-average returns. We are not going to draw any conclusion from this as an IPO is usually handled by multiple banks in partnership and the above analysis is done using Fuzzy match (its an approximate match)</p>\n\n<p><strong>Limitations of the Analysis</strong></p>\n\n<p>There are some limitations to the analysis.</p>\n\n<p>a.  We don’t have 100% coverage for the IPOs done since 2000. From comparing to other sources, I could observe more than 90% coverage and I feel that this should be representative of the whole.</p>\n\n<p>b.  There is no data showcasing what percentage of each IPO was offered to the retail investor.</p>\n\n<p><strong>Conclusion:</strong> I have some theories to explain the IPO performance. I think it’s driven mainly by two factors. One being the hype/PR generated by the investment bank about the company and the second is that I think the investment banks slightly price the IPO lower than the market value of the company so that the IPO issue is 100% subscribed (their fees are dependent on a successful IPO). Both these factors contribute to the listing as well as the one-day gain that we see across the board.</p>\n\n<p>Overall, this once again seems to a situation where having money makes you more money (institutional investors having easier access to the IPO) but as the analysis shows retail investors can still make significant gains by buying into an IPO!</p>\n\n<p>Google Sheet containing all the data: <a href=\"https://docs.google.com/spreadsheets/d/1nHsXW7-2bu0jafuZe_0LmapSE5V5KXYF14Oe0lG2TKA/edit?usp=sharing\">here</a></p>\n\n<p><em>Disclaimer: I am not a financial advisor. If you are planning to invest in an IPO, make sure your brokerage support purchasing IPOs, minimum criteria to participate, and also the historical track record of your brokerage in issuing IPOs. All of this will significantly improve your chances of getting the IPO issued at the offer price.</em></p>\n</div><!-- SC_ON -->",
  "score": 1807,
  "permalink": "/r/wallstreetbets/comments/ny6wpp/i_analyzed_3600_ipos_over_the_past_two_decades_to/",
  "subreddit": "wallstreetbets",
  "id": "ny6wpp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009747677
}