{
  "author": "interrobangbros",
  "the_new_excerpt": "Source: How Many Stocks Beat the Indexes?\n[https://www.morningstar.com/articles/1035348/how-many-stocks-beat-the-indexes]\n\nRecent posts about people losing their initial investments over the past 6-12\nmonths made me think of this article that I heard the guys on the recent…",
  "original_created_utc": 1620343064,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ソース インデックスに勝つ株はどれくらいあるのか？\n[https://www.morningstar.com/articles/1035348/how-many-stocks-beat-the-indexes]\n\n過去6～12ヶ月の間に初期投資を失った人々に関する最近の投稿を見て、私はこの記事を思い出しました。\nこの記事を見て、私は、最近の...",
      "title": "モーニングスターによると、過去10年間で米国の上位5,000銘柄のうち、プラスで終えたのはわずか42％だった（さらに、私が12年以上の投資経験で学んだこともある"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "资料来源：《中国证券报》。有多少股票击败了指数？\n[https://www.morningstar.com/articles/1035348/how-many-stocks-beat-the-indexes]\n\n最近关于人们在过去6-12个月内失去初始投资的帖子让我想到了这篇文章。\n月，让我想到了这篇文章，我在最近的节目中听到了这些人...",
      "title": "根据晨星公司的数据，在过去的十年中，前5000名美国股票中只有42%的股票完成了正值（加上我在12年多的投资中所学到的东西"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "資料來源：《中國證券報》。有多少股票擊敗了指數？\n[https://www.morningstar.com/articles/1035348/how-many-stocks-beat-the-indexes]\n\n最近關於人們在過去6-12個月內失去初始投資的帖子讓我想到了這篇文章。\n月，讓我想到了這篇文章，我在最近的節目中聽到了這些人...",
      "title": "根據晨星公司的數據，在過去的十年中，前5000名美國股票中只有42%的股票完成了正值（加上我在12年多的投資中所學到的東西"
    }
  ],
  "title": "According to Morningstar, only 42% of the top 5,000 US stocks finished positive in the previous decade (plus what I've learned over my 12+ years investing)",
  "created_utc": 1620414253,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Source:  <a href=\"https://www.morningstar.com/articles/1035348/how-many-stocks-beat-the-indexes\">How Many Stocks Beat the Indexes?</a></p>\n\n<p>Recent posts about people losing their initial investments over the past 6-12 months made me think of this article that I heard the guys on the recent <a href=\"https://theirrelevantinvestor.com/2021/05/05/animal-spirits-we-should-be-in-a-bubble/\">Animal Spirits</a> podcast discuss. Over the past 10 years, 42% of the top 5,000 US stocks finished in the black, 36% finished in the red, and 22% are gone. Of that 22%, Morningstar does acknowledge they didn&#39;t check to see if a company went bankrupt or was acquired at a premium/loss but they did note, &quot;Bessembinder’s research suggests that half the expired stocks were acquired, with decent results, while the other half were delisted, with dire consequences.&quot;</p>\n\n<p>Basically what this research shows is stock picking isn&#39;t easy and probably shouldn&#39;t be done by most people, if any. There&#39;s a reason mutual funds and active money managers have been shown to trail benchmarks over short- and long-term timeframes. <a href=\"https://www.investors.com/etfs-and-funds/mutual-funds/best-mutual-funds-beating-sp-500-over-last-1-3-5-10-years/\">This IBD article from March</a> shows only 25% of MFs beat their benchmark over varying timeframes. <a href=\"https://www.cnbc.com/2019/03/15/active-fund-managers-trail-the-sp-500-for-the-ninth-year-in-a-row-in-triumph-for-indexing.html\">This 2019 article from CNBC</a> shows nearly 65% of active fund managers trailed the S&amp;P 500 for the 9th consecutive year. If people who devote their literal careers can&#39;t do it, most retail investors probably can&#39;t either. It&#39;s just as much luck as it is skill. </p>\n\n<p>Note: if you don&#39;t give a shit about what my opinions are, do as my wife does and stop paying attention to me now. I only planned to post the above and then I just started jotting down thoughts that turned into more thoughts and the below was born.</p>\n\n<p>If you want to pick stocks, probably the only hope you have is having a very long-term horizon and being diversified, but not diworsified. If you just want exposure to every industry for diversification purposes, just buy an ETF that tracks everything all sectors. </p>\n\n<p>Irony time: Save for my wife&#39;s retirement and our savings for future kid(s) (both of which I manage and both of which are in QQQ, SPY, and/or VOO), I pick stocks and although I have overall exceeded my chosen benchmarks (SPY and QQQ) over the past 9 years, I have no expectation that will last, which is why I benchmark. I <del>want</del> need to know how I am doing because if I absolutely suck and perpetually trail the benchmarks, I would be leaving easy money on the table. I don&#39;t want to do that so I manically track my transactions.</p>\n\n<p>For me, I actually match the Morningstar numbers pretty well.</p>\n\n<p><strong>Closed Positions</strong></p>\n\n<table><thead>\n<tr>\n<th align=\"left\">Beat SPY &amp; QQQ</th>\n<th align=\"left\">Beat one but not the other</th>\n<th align=\"left\">Trailed SPY &amp; QQQ</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">45%</td>\n<td align=\"left\">10%</td>\n<td align=\"left\">45%</td>\n</tr>\n</tbody></table>\n\n<p><strong>Open Positions</strong></p>\n\n<table><thead>\n<tr>\n<th align=\"left\">Currently beating SPY &amp; QQQ</th>\n<th align=\"left\">Beating one but not the other</th>\n<th align=\"left\">Currently trailing SPY &amp; QQQ</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">35%</td>\n<td align=\"left\">8%</td>\n<td align=\"left\">57%</td>\n</tr>\n</tbody></table>\n\n<p>Quick tangent. Open positions are doing worse right now because I continue to buy. I don&#39;t care about the isolated market choppiness currently going on (some of which I&#39;m invested in) and I&#39;m not sitting on a mound of cash waiting for a massive dip. I buy when I have cash ready and a company I want shares of. People seem to think entry point matters but it doesn&#39;t with a long-term view. Sure, $45/sh is better than $50 but what if it goes to $60 before that 10% drop you were waiting for. Now you have to buy at a higher price or live with the feeling you missed the boat (spoiler: you didn&#39;t; just fucking buy). Sure, some stocks will pull back to your entry point but if the thesis is good and remains in place, just buy when you can and add more when you can.</p>\n\n<p>So if the majority of my positions are trailing at least one benchmark, how am I beating SPY and QQQ overall? To keep the theme going, having a long-term approach is why. I wasn&#39;t beating the benchmarks right away. In fact, it took 3 years before I was intermittently ahead of them and another 3 years before I was consistently beating them every month. Six years may seem like a long time to allot myself but, at the time, my planned retirement was 40 years away. I had a long runway to work with so I knew my risk profile could be high and I could continue to learn as I went along. I bought companies I believed would win over 10+ years and then I let my winners win. </p>\n\n<p>This is a divisive take but I rarely take gains on my winners. I don&#39;t need the cash now; this money was earmarked for decades down the road so I let it be invested. I even let some of my losers lose (looking at you Ford). I do everything I can to not micromanage my holdings. I monitor the news and quarterly filings but unless there&#39;s been a fundamental change in the business that renders my initial investment thesis moot, I hold. </p>\n\n<p>By letting my winners win, I allowed the SHOP&#39;s and the SIVB&#39;s and the AMZN&#39;s and the SMG&#39;s to make up in gains far more than my losers lost. Currently, my three largest gaining positions have increased in value more than all my losing positions (open and closed) <strong>combined</strong>. And those 3 largest gaining positions are all still open. I have never in the 5+ years I&#39;ve been invested sold a single share in any of them and I see no reason to even consider doing so. It&#39;s cliched to say but the max you can lose on a stock purchase is 100% while the max you can gain is infinite. Don&#39;t overreact. Follow your thesis. I bought AMZN in June 2014 for $327.39 and it then traded basically flat for 7 months. Imagine having had sold that for a miniscule gain because I didn&#39;t see an immediate 35% return? </p>\n\n<p>All this being said, I absolutely understand why people would choose passive ETF investing. I enjoy reading about companies and perusing SEC filings. I view my investing as a hobby in addition to wealth building. Not everyone does. They may see the benefit of investing while viewing company research as work. Others may want to try to get rich quick. I would never recommend the latter but to each their own. I didn&#39;t hit it big on GME or AMC or become a Dogecoin millionaire but I also didn&#39;t FOMO buy only to lose 50% of my investment within a week and then panic sell. I&#39;m not yucking anyone&#39;s yum. I just know the lane I&#39;m comfortable in. Know your risk profile and how much you can lose without making your life uncomfortable, because any investment can drop 20% a day after you buy it and any investment can go to zero. You can&#39;t invest and also be undisciplined or prone to FOMO. You will almost always lose out.</p>\n\n<p>I didn&#39;t mean for this post to turn into a soapbox speech but if it came off that way, my apologies. Just trying to convey some interesting research I heard/read with some lessons I have learned.</p>\n\n<p>Happy investing!</p>\n</div><!-- SC_ON -->",
  "score": 64,
  "permalink": "/r/investing/comments/n6klu0/according_to_morningstar_only_42_of_the_top_5000/",
  "subreddit": "investing",
  "id": "n6klu0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985994594
}