{
  "author": "midoxvx",
  "original_created_utc": 1641145899,
  "title": "Why do a lot of people think black people can’t be racist?",
  "created_utc": 1641207255,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Full disclosure: I am not American, I live in America however and I believe that I understand the history of this country to some degree and the sensitivity that comes with this topic. &lt;/p&gt;\n\n&lt;p&gt;That being said, I am genuinely trying to understand why a lot of people have that notion (title). Do people mean black people are incapable of systemic racism or racism period? I would disagree if it is the latter. &lt;/p&gt;\n\n&lt;p&gt;What do you think? \nI know this is a sensitive subject so let’s try to keep it civil please.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 1493,
  "permalink": "/r/TooAfraidToAsk/comments/ruf0jw/why_do_a_lot_of_people_think_black_people_cant_be/",
  "subreddit": "TooAfraidToAsk",
  "id": "ruf0jw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Full disclosure: I am not American, I live in America however and I believe that\nI understand the history of this country to some degree and the sensitivity that\ncomes with this topic.\n\nThat being said, I am genuinely trying to understand why a lot of people have\nthat notion (title). Do people mean…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "完全な開示：私はアメリカ人ではない、しかし、私はアメリカに住んでいる、そして私は信じている。\nこの国の歴史はある程度理解していますし、その繊細さも理解しています。\nこのトピックに付属しています。\n\nとはいえ、私は純粋に、なぜ多くの人がこのような話題を持っているのかを理解しようとしています。\nという概念（タイトル）があります。人々が意味するのは...",
      "title": "なんで黒人は差別されないと思ってる人が多いんだろう？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "全面披露：我不是美国人，但我生活在美国，我相信\n我在某种程度上了解这个国家的历史和这个话题的敏感性。\n这个话题的敏感性。\n\n既然如此，我是真心实意地想了解为什么很多人有\n这个概念（标题）。人们是否意味着...",
      "title": "为什么很多人认为黑人不可能有种族歧视？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "全面披露：我不是美國人，但我生活在美國，我相信\n我在某種程度上瞭解這個國家的歷史和這個話題的敏感性。\n這個話題的敏感性。\n\n既然如此，我是真心實意地想了解爲什麼很多人有\n這個概念（標題）。人們是否意味着...",
      "title": "爲什麼很多人認爲黑人不可能有種族歧視？"
    }
  ]
}