{
  "author": "badonkerous",
  "original_created_utc": 1638674793,
  "title": "Is it strange if my friend is flirting with my younger sister who is a minor?",
  "created_utc": 1638724306,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My friend is staying with me for a little while and has started to flirt pretty heavily with my younger sister. She’s flirting back, but she’s 15 and he’s 18. I am uncomfortable around them. &lt;/p&gt;\n\n&lt;p&gt;I’m not the overprotective brother who snoops into my sisters life, but I can’t be the only one who thinks it strange that almost immediately after staying with me &amp;amp; my family he begins to flirt with my sister.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 111,
  "permalink": "/r/TooAfraidToAsk/comments/r96dy7/is_it_strange_if_my_friend_is_flirting_with_my/",
  "subreddit": "TooAfraidToAsk",
  "id": "r96dy7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My friend is staying with me for a little while and has started to flirt pretty\nheavily with my younger sister. She’s flirting back, but she’s 15 and he’s 18. I\nam uncomfortable around them.\n\nI’m not the overprotective brother who snoops into my sisters life, but I can’t\nbe the only one who thinks…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の友人が少しの間、私の家に滞在しているのですが、かなりいちゃつき始めているようです。\n妹に猛アタック。妹もいちゃつくのですが、妹は15歳で、彼は18歳です。I\nが、その周りにいるのは不快です。\n\n私は妹の生活を覗き見するような過保護な兄ではありませんが、このままでは\nと思うのは私だけでしょうか...。",
      "title": "友人が未成年の妹とイチャイチャしていたらおかしいですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的朋友和我一起住了一段时间，并开始与我的妹妹调情。\n与我的妹妹调情。她也在调情，但她是15岁，他是18岁。I\n我在他们身边感到很不自在。\n\n我不是那种过度保护的哥哥，不会去窥探我妹妹的生活，但我不能\n但我不能成为唯一一个认为...",
      "title": "如果我的朋友与我未成年的妹妹调情，这很奇怪吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的朋友和我一起住了一段時間，並開始與我的妹妹調情。\n與我的妹妹調情。她也在調情，但她是15歲，他是18歲。I\n我在他們身邊感到很不自在。\n\n我不是那種過度保護的哥哥，不會去窺探我妹妹的生活，但我不能\n但我不能成爲唯一一個認爲...",
      "title": "如果我的朋友與我未成年的妹妹調情，這很奇怪嗎？"
    }
  ]
}