{
  "author": "MadCyborg12",
  "the_new_excerpt": "For most religious people religion is just their own thing and they keep it to\nthemselves. Reddit makes it seem like every single religious person is a crazy\nlunatic straight out of Far Cry 5. I am genuinely interested and have no\nintention in ranting or provoking someone. Please keep it civil in…",
  "original_created_utc": 1621529757,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ほとんどの宗教家にとって、宗教は自分だけのものであり、自分の中にとどめておくものです。\nしています。Redditでは、すべての宗教家がFar Cry 5から出てきたようなクレイジーな\n狂人のように見えます。私は純粋に興味があり、誰かを暴言や挑発するつもりはありません。\n私は純粋に興味があり、誰かを怒らせたり挑発したりするつもりはありません。私は純粋に興味があり、誰かを暴言や挑発するつもりはありません。",
      "title": "なぜRedditではほとんどの人が反宗教的で、ニヒリズム的で、宗教という考えに対して攻撃的なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对于大多数宗教人士来说，宗教只是他们自己的事情，他们把它留给自己。\n自己。Reddit让人觉得每个宗教人士都是一个疯狂的\n疯子，直接从《孤岛惊魂5》中走出来。我是真的很感兴趣，并没有\n我真的很感兴趣，也无意咆哮或挑衅别人。请保持文明的态度，在...",
      "title": "为什么Reddit上的大多数人都是反宗教的，虚无主义的，对宗教的想法很反感？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對於大多數宗教人士來說，宗教只是他們自己的事情，他們把它留給自己。\n自己。Reddit讓人覺得每個宗教人士都是一個瘋狂的\n瘋子，直接從《孤島驚魂5》中走出來。我是真的很感興趣，並沒有\n我真的很感興趣，也無意咆哮或挑釁別人。請保持文明的態度，在...",
      "title": "爲什麼Reddit上的大多數人都是反宗教的，虛無主義的，對宗教的想法很反感？"
    }
  ],
  "title": "Why are most people on Reddit anti-religious, nihilistic and offensive to the idea of religion?",
  "created_utc": 1621564576,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For most religious people religion is just their own thing and they keep it to themselves. Reddit makes it seem like every single religious person is a crazy lunatic straight out of Far Cry 5. I am genuinely interested and have no intention in ranting or provoking someone. Please keep it civil in the comments.</p>\n\n<p>Edit: what have I done lol, its a mess down there.</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/TooAfraidToAsk/comments/nh5du0/why_are_most_people_on_reddit_antireligious/",
  "subreddit": "TooAfraidToAsk",
  "id": "nh5du0",
  "is_self": true,
  "media": null,
  "is_video": false
}