{
  "author": "Ze_Bonitinho",
  "original_created_utc": 1640032179,
  "title": "Did rennaissance people struggle to read their handwrittem texts the way do today?",
  "created_utc": 1640072441,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I sometimes come across notes written by Galileo, Copernicus and other people from centuries ago and find their handwriting extremely difficult to read. Sometimes, book authors leave notes saying that some texts are yet to be deciphered. Is it a problem associated with the ink and paper degradation through time? Modern physicians are sometimes regarded as writing with unreadable calligraphy as if it was part of some sort of &amp;quot;physician culture/style&amp;quot;. Was it the same case? Did they feel compelled to write in a calligraphy that was hard to read because it was what everyone else did? Was it an attempt to hide their ideas from others? Or is it just an anachronistic impression by someone who&amp;#39;s born centuries later?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/rkwdh9/did_rennaissance_people_struggle_to_read_their/",
  "subreddit": "AskHistorians",
  "id": "rkwdh9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I sometimes come across notes written by Galileo, Copernicus and other people\nfrom centuries ago and find their handwriting extremely difficult to read.\nSometimes, book authors leave notes saying that some texts are yet to be\ndeciphered. Is it a problem associated with the ink and paper…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ガリレオやコペルニクスなどが書いたメモに出会うことがあるのですが\n何百年も前のものでありながら、非常に読みにくい字で書かれています。\nまた、本の著者が「まだ未解決の文章がある」と書き残していることもあります。\nを読み解く。インクや紙に関連した問題なのだろうか...。",
      "title": "ルネサンス期の人々は、現代のように手書きの文章を読むのに苦労したのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我有时会看到伽利略、哥白尼和其他几个世纪前的人写的笔记。\n的笔记，发现他们的笔迹非常难读。\n有时，书的作者会留下说明，说有些文字还没有被破解。\n破译。这是一个与墨水和纸张有关的问题吗...",
      "title": "文艺复兴时期的人们是否像今天这样努力阅读他们的手写文本？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我有時會看到伽利略、哥白尼和其他幾個世紀前的人寫的筆記。\n的筆記，發現他們的筆跡非常難讀。\n有時，書的作者會留下說明，說有些文字還沒有被破解。\n破譯。這是一個與墨水和紙張有關的問題嗎...",
      "title": "文藝復興時期的人們是否像今天這樣努力閱讀他們的手寫文本？"
    }
  ]
}