{
  "author": "ImKubush",
  "the_new_excerpt": "Before we start sorry if I worded the title poorly but I just didn't know how to\nchange my thought into words accurately\n\nLike yeah, good for you, but I just kinda don't care, I have some friends that\nare bi/gay and when they said they were my reaction was just like \"O, good for\nyou!\" and such and…",
  "original_created_utc": 1612370189,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在我们开始之前，对不起，如果我措辞的标题不好，但我只是不知道如何。\n妙语连珠\n\n是啊，对你有好处，但我只是有点不在乎，我有一些朋友，。\n是双性恋/同性恋，当他们说，他们是我的反应只是像 \"O，好为\n你！\"等等...",
      "title": "当LGBTQ+的人出柜时，我并不关心，这不好吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在我們開始之前，對不起，如果我措辭的標題不好，但我只是不知道如何。\n妙語連珠\n\n是啊，對你有好處，但我只是有點不在乎，我有一些朋友，。\n是雙性戀/同性戀，當他們說，他們是我的反應只是像 \"O，好爲\n你！\"等等...",
      "title": "當LGBTQ+的人出櫃時，我並不關心，這不好嗎？"
    }
  ],
  "title": "Is it bad that I don't really care when LGBTQ+ people are coming out?",
  "created_utc": 1612392774,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Before we start sorry if I worded the title poorly but I just didn&#39;t know how to change my thought into words accurately</p>\n\n<p>Like yeah, good for you, but I just kinda don&#39;t care, I have some friends that are bi/gay and when they said they were my reaction was just like &quot;O, good for you!&quot; and such and then I just wanted to go back to the conversation we had. I know it&#39;s hard for some/most (idk) people to come out, but it just doesn&#39;t move me in any way, I&#39;m just there like &quot;ok, you haven&#39;t changed as a person so like good for you I guess&quot; but whenever I go on social media and there&#39;s posts of people coming there&#39;s lots of people being extremeley enthusiastic and stuff about this, meanwhile I&#39;m just sitting there and my opinion of them pretty much doesn&#39;t change at all.</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/NoStupidQuestions/comments/lbrldn/is_it_bad_that_i_dont_really_care_when_lgbtq/",
  "subreddit": "NoStupidQuestions",
  "id": "lbrldn",
  "is_self": true,
  "media": null,
  "is_video": false
}