{
  "author": "Oregano__Gangster",
  "the_new_excerpt": "How the hell do people curl their hair and do their makeup and stuff? It's a\nhuge skillset that I feel like is 100% not given the recognition it deserves\nbecause goddamn it is difficult.\n\nI was a very minimalist tomboy until I was like 25, and I feel like it's not a\ngood look to struggle with these…",
  "original_created_utc": 1619024772,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "みんなどうやって髪を巻いたり、メイクをしたりしているんだろう？それは\nそれに見合うだけの評価を受けていないように感じます。\nなぜなら、それはとても難しいことだからです。\n\n私は25歳の頃まで、とてもミニマリストなおてんば娘でした。\n私は25歳までミニマリストのおてんば娘でしたが、このようなことで苦労するのは見苦しいですね。",
      "title": "他の女性は、女性らしさについてのコースを逃してしまったような気がしますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "人们到底是如何卷起他们的头发和做他们的化妆之类的？这是一个巨大的\n我觉得这是一个巨大的技能组合，100%没有得到应有的认可。\n因为该死的，这很难。\n\n在我25岁之前，我是一个非常简约的假小子，我觉得在这些方面挣扎并不是一个好的形象。\n我觉得在这些方面挣扎不是一个好的样子......",
      "title": "是否有其他女性觉得她们在某种程度上错过了关于女性化的整个课程？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "人們到底是如何捲起他們的頭髮和做他們的化妝之類的？這是一個巨大的\n我覺得這是一個巨大的技能組合，100%沒有得到應有的認可。\n因爲該死的，這很難。\n\n在我25歲之前，我是一個非常簡約的假小子，我覺得在這些方面掙扎並不是一個好的形象。\n我覺得在這些方面掙扎不是一個好的樣子......",
      "title": "是否有其他女性覺得她們在某種程度上錯過了關於女性化的整個課程？"
    }
  ],
  "title": "Any other women feel like they somehow missed an entire course on being feminine?",
  "created_utc": 1619032364,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>How the hell do people curl their hair and do their makeup and stuff? It&#39;s a huge skillset that I feel like is 100% not given the recognition it deserves because goddamn it is difficult. </p>\n\n<p>I was a very minimalist tomboy until I was like 25, and I feel like it&#39;s not a good look to struggle with these kinds of basics, but I want to learn so I have to push through it. I feel like most women look so put together all the time and it baffles me. Anyone else ever feel like this?</p>\n</div><!-- SC_ON -->",
  "score": 145,
  "permalink": "/r/TooAfraidToAsk/comments/mvk9fd/any_other_women_feel_like_they_somehow_missed_an/",
  "subreddit": "TooAfraidToAsk",
  "id": "mvk9fd",
  "is_self": true,
  "media": null,
  "is_video": false
}