{
  "author": "Trevigol",
  "original_created_utc": 1644303355,
  "title": "Here is how I doxxed the creator of a scamcoin and make him abandon the scam few minutes before launch",
  "created_utc": 1644313122,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;em&gt;I posted this yesterday but it was removed by reddit because I said the website of the scam. Now I repost it without any information so please don&amp;#39;t ask for it. Anyway the website is now deleted so you can&amp;#39;t see anything.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;I own a telegram group where this morning an user entered telling everyone to be quick because today it was starting the private sale of a new coin.&lt;/p&gt;\n\n&lt;p&gt;I looked at its website and it was clearly made by an amateur. It&amp;#39;s whitepaper was a joke.&lt;/p&gt;\n\n&lt;p&gt;However, the devs officially doxxed themselves and most users in their &amp;quot;official&amp;quot; telegram group were starring to believe in this scam.&lt;/p&gt;\n\n&lt;p&gt;I noticed some users were clearly fake, saying things like &amp;quot;I follow this project since 1 year and it&amp;#39;s amazing&amp;quot; but I checked and the &lt;strong&gt;group was created just few days ago so how they were following this project since 1 year ago?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I then decided to &lt;strong&gt;contact on LinkedIn the 2 official admins of the project&lt;/strong&gt;. They both answered me that they had nothing to do with it and clearly someone took their names and photos and posted them on that website.&lt;/p&gt;\n\n&lt;p&gt;45 minutes were remaining before the private sale would start. By the way, the private sale was going to work in this way: they would publish a bsc address and everyone had to send bnb at that address. In exchange they would receive back these new tokens.&lt;/p&gt;\n\n&lt;p&gt;I posted in their group that admins were liars and that the people listed in the official website were not related to this project in any way.&lt;/p&gt;\n\n&lt;p&gt;They accused me of fud, I had no proofs. Also they were deleting most of my messages. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Then I tried what I thought was impossible, because only the worst amateur would make such a mistake: I did a whois of the domain of their website&lt;/strong&gt; and found out the website was created just 2 days ago, and I found the name and the address of the owner. This guy didn&amp;#39;t even think to hide it properly.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;At this point it was just few minutes before the official launch of the private sale. I simply posted in the group the name and the home address of the scammer and then &amp;quot;if anyone will be scammed, just give this name to the police&amp;quot;&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Admins abandoned the group immediately, countdown went to 0 but no private sale started. They literally disappeared and they had no opportunity to scam anyone.&lt;/p&gt;\n\n&lt;p&gt;Obviously they were amateurs, it&amp;#39;s harder with professional scammers, but I&amp;#39;m proud that I destroyed the plan of these scammers who invested money and time in creating their website and preparing this scam.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 368,
  "permalink": "/r/CryptoCurrency/comments/snds3m/here_is_how_i_doxxed_the_creator_of_a_scamcoin/",
  "subreddit": "CryptoCurrency",
  "id": "snds3m",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I posted this yesterday but it was removed by reddit because I said the website\nof the scam. Now I repost it without any information so please don't ask for it.\nAnyway the website is now deleted so you can't see anything.\n\nI own a telegram group where this morning an user entered telling everyone…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昨日投稿したのですが、ウェブサイトを言ったのでredditに削除されました。\n詐欺の 今、私は何の情報もなしにそれを再投稿しているので、それを求めないでください。\nとにかくウェブサイトは削除されたので、何も見ることができません。\n\n私はテレグラムグループを所有しており、今朝、あるユーザーが皆に伝えてきました...",
      "title": "詐欺コインの作成者をdoxして、発売の数分前に詐欺を放棄させた方法を紹介します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我昨天发了这个帖子，但它被reddit删除了，因为我说了这个网站\n的骗局。现在我重新发布，没有任何信息，所以请不要要求它。\n无论如何，该网站现在已经被删除，所以你不能看到任何东西。\n\n我拥有一个电报组，今天早上一个用户进入该组，告诉大家...",
      "title": "以下是我如何揭露一个诈骗币的创造者，并让他在推出前几分钟放弃诈骗。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我昨天發了這個帖子，但它被reddit刪除了，因爲我說了這個網站\n的騙局。現在我重新發布，沒有任何信息，所以請不要要求它。\n無論如何，該網站現在已經被刪除，所以你不能看到任何東西。\n\n我擁有一個電報組，今天早上一個用戶進入該組，告訴大家...",
      "title": "以下是我如何揭露一個詐騙幣的創造者，並讓他在推出前幾分鐘放棄詐騙。"
    }
  ]
}