{
  "author": "kayaarr",
  "the_new_excerpt": "Online finance start-up SoFi ($IPOE) is lowering the barrier for amateur\ninvestors to buy shares of companies as they go public.\n\nThese IPO shares have historically been set aside for Wall Street’s\ninstitutional investors or high-net worth individuals. Retail traders don’t have\na way to buy into…",
  "original_created_utc": 1616765516,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在线金融初创公司SoFi（$IPOE）正在降低淘客门槛\n投资者在公司上市时购买其股票。\n\n这些IPO股票历史上一直是为华尔街的\n机构投资者或高净值个人。散户交易者没有\n买进的方式...",
      "title": "SoFi打破华尔街传统，让业余投资者提前进入IPO市场"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在線金融初創公司SoFi（$IPOE）正在降低淘客門檻\n投資者在公司上市時購買其股票。\n\n這些IPO股票歷史上一直是爲華爾街的\n機構投資者或高淨值個人。散戶交易者沒有\n買進的方式...",
      "title": "SoFi打破華爾街傳統，讓業餘投資者提前進入IPO市場"
    }
  ],
  "title": "SoFi to give amateur investors early access to IPOs in break from Wall Street tradition",
  "created_utc": 1616774952,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Online finance start-up SoFi ($IPOE) is lowering the barrier for amateur investors to buy shares of companies as they go public.</p>\n\n<p>These IPO shares have historically been set aside for Wall Street’s institutional investors or high-net worth individuals. Retail traders don’t have a way to buy into newly listed companies until those shares begin actually trading on the exchange. By that time, the price has often gapped higher.</p>\n\n<p>“Main Street will have access to investing in a way they wouldn’t have before,” SoFi CEO Anthony Noto said in a phone interview. “It gives more differentiation, and more access so people can build diversified portfolios.</p>\n\n<p>SoFi itself will be an underwriter in these deals, meaning it works with companies to determine a share price, buys securities from the issuer then sells them back to certain investors. It’s common for brokerage firms to get a portion of IPO shares in that process. But they don’t typically offer them to the everyday investor. </p>\n\n<p><a href=\"https://www.cnbc.com/2021/03/26/sofi-to-give-amateur-investors-early-access-to-ipos-in-break-from-wall-street-tradition-.html\">Source</a></p>\n</div><!-- SC_ON -->",
  "score": 193,
  "permalink": "/r/stocks/comments/mdoppt/sofi_to_give_amateur_investors_early_access_to/",
  "subreddit": "stocks",
  "id": "mdoppt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357141519
}