{
  "author": "GroundbreakingLack78",
  "the_new_excerpt": "Was just sitting at my couch, watching my retro TV with my pizza and beers as\nalways, when I heard one guy speaking about investing in general and the\ndiscussion came to cryptocurrency.\n\nHe’s got nice tuxedo, conditioned hair, teeth were kinda like popcorn etc etc..\nall things that typical big brain…",
  "original_created_utc": 1616495698,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "只是坐在我的沙发上，看我的复古电视与我的比萨饼和啤酒，因为。\n一直以来，当我听到一个人讲到投资一般的投资和\n讨论到了加密货币。\n\n他有漂亮的燕尾服，有条件的头发，牙齿有点像爆米花等等等等。\n都是典型的大脑袋...",
      "title": "我的国家出了点问题。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "只是坐在我的沙發上，看我的復古電視與我的比薩餅和啤酒，因爲。\n一直以來，當我聽到一個人講到投資一般的投資和\n討論到了加密貨幣。\n\n他有漂亮的燕尾服，有條件的頭髮，牙齒有點像爆米花等等等等。\n都是典型的大腦袋...",
      "title": "我的國家出了點問題。"
    }
  ],
  "title": "Something is wrong in my country.",
  "created_utc": 1616525075,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Was just sitting at my couch, watching my retro TV with my pizza and beers as always, when I heard one guy speaking about investing in general and the discussion came to cryptocurrency.</p>\n\n<p>He’s got nice tuxedo, conditioned hair, teeth were kinda like popcorn etc etc.. all things that typical big brain talker wants to have when they have a wheat in their head. Fake figure.</p>\n\n<p>I turned on the volume, he had some good lines about it, but then I froze. I heard him say that Bitcoin will never have a value like gold has just because you can mine gold infinitely. He said that gold is an infinite resource. That his supply is INFINITE. He said that BTC is one big bubble because it’s limited and GOLD is de way because of it infinite supply. What the fuck is he smoking? I just threw my crocs into screen and now I’m watching through the window.</p>\n\n<p>I thought that this guy because of all of his diplomas and weird things before his name would mean and know something but he is totally delirious. Spitting shit on live TV, well, school really isn’t everything.</p>\n\n<p>Fuck me, that’s even worse than “The 1/2 Hour News Hour” show.</p>\n</div><!-- SC_ON -->",
  "score": 222,
  "permalink": "/r/CryptoCurrency/comments/mbbrjn/something_is_wrong_in_my_country/",
  "subreddit": "CryptoCurrency",
  "id": "mbbrjn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752816919
}