{
  "author": "Justryan95",
  "the_new_excerpt": "My little brother came up to me and showed me an ad asking if he got hacked\nbecause it's showing him some legitimate porn and he's all worried and stuff\nbecause that's inappropriate for him to see.\n\nHe's 6. And all he watches is Minecraft videos. Yet the first advertisement has\na thumbnail of some…",
  "original_created_utc": 1611846684,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我的小弟走过来给我看了一个广告，问他是不是被黑了？\n因为它给他看了一些合法的色情片，他很担心什么的\n因为那不适合他看\n\n他才6岁，看的都是Minecraft视频。然而第一个广告有\n缩略图的一些...",
      "title": "什么是与YouTube允许随机的印度频道广告与软核色情？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的小弟走過來給我看了一個廣告，問他是不是被黑了？\n因爲它給他看了一些合法的色情片，他很擔心什麼的\n因爲那不適合他看\n\n他才6歲，看的都是Minecraft視頻。然而第一個廣告有\n縮略圖的一些...",
      "title": "什麼是與YouTube允許隨機的印度頻道廣告與軟核色情？"
    }
  ],
  "title": "What is up with YouTube allowing random Indian channels to advertise with softcore pornography?",
  "created_utc": 1611862792,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My little brother came up to me and showed me an ad asking if he got hacked because it&#39;s showing him some legitimate porn and he&#39;s all worried and stuff because that&#39;s inappropriate for him to see.</p>\n\n<p>He&#39;s 6. And all he watches is Minecraft videos. Yet the first advertisement has a thumbnail of some Indian girls breast with clothing thats basically not there with how transparent it is. You can clearly see her nipples. Its so clear you could count the bumps on her nipples. After closing that out and going to a new video its an Indian girl bent over with her cleavage just hanging. I click on the ad so I can report the account and its some Indian dude doing extremely bad covers and THERE NO WAY TO REPORT THE ADS. All I get is &quot;Stop seeing these ads.&quot; I do that and i still get the ads.Wtf YouTube..</p>\n\n<p>Is there anyway I can report this to the government or something because it breaches COPA. Its unfair that Youtubers I watch get demonized because they talk about the history of WW2 or talk about liberation of concentration camps but then they apparently show children soft core porn so kids can watch some Indian dude sing bad covers.</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/NoStupidQuestions/comments/l6z725/what_is_up_with_youtube_allowing_random_indian/",
  "subreddit": "NoStupidQuestions",
  "id": "l6z725",
  "is_self": true,
  "media": null,
  "is_video": false
}