{
  "author": "sugar_sugar_falls",
  "original_created_utc": 1636397707,
  "title": "Not holding Ether right now is like not holding Apple in 2010",
  "created_utc": 1636420390,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Literally every single decentralized application is built on Ethereum. It is the App Store of crypto currencies. Now that the supply is limited, not holding Ether is insanity. There is only 120m Ether and that number will only decrease. To put things in perspective, there is only 0.015 ETH for each human alive. For a comparison, there is $150 per person alive (M1 money supply / 8 billion humans). If Ether becomes one of the backbones of the worldwide internet economy - and who on this subreddit doubts it will at this point? - then it will reach 1000x its current market cap, over the next decade.</p>\n\n<p>I see people here buying all sorts of shitcoins - almost all living in Ethereum - but not Ethereum itself. That is like buying stocks of that old Candle App or Beer App on iOS, but not buying Apple stocks. How is that not utterly stupid?</p>\n</div><!-- SC_ON -->",
  "score": 456,
  "permalink": "/r/CryptoCurrency/comments/qpkdxk/not_holding_ether_right_now_is_like_not_holding/",
  "subreddit": "CryptoCurrency",
  "id": "qpkdxk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Literally every single decentralized application is built on Ethereum. It is the\nApp Store of crypto currencies. Now that the supply is limited, not holding\nEther is insanity. There is only 120m Ether and that number will only decrease.\nTo put things in perspective, there is only 0.015 ETH for each…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "文字通り、すべての分散型アプリケーションがイーサリアム上で構築されています。イーサリアムは\n暗号通貨のApp Storeです。供給が限られている今、イーサを保有しないのは\nEtherを保有しないのは狂気の沙汰です。イーサは1億2000万個しかなく、その数は減る一方です。\n視点を変えてみると、1枚の紙幣には0.015ETHしかありません。",
      "title": "今、イーサを持っていないのは、2010年にアップルを持っていないのと同じです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "从字面上看，每一个去中心化的应用程序都是建立在以太坊上。它是\n加密货币的应用商店。现在供应有限，不持有\n以太币是疯狂的。目前只有1.2亿个以太币，而且这个数字只会减少。\n从这个角度来看，每一个以太坊只有0.015个ETH...",
      "title": "现在不持有以太币就像在2010年不持有苹果一样"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "從字面上看，每一個去中心化的應用程序都是建立在以太坊上。它是\n加密貨幣的應用商店。現在供應有限，不持有\n以太幣是瘋狂的。目前只有1.2億個以太幣，而且這個數字只會減少。\n從這個角度來看，每一個以太坊只有0.015個ETH...",
      "title": "現在不持有以太幣就像在2010年不持有蘋果一樣"
    }
  ]
}