{
  "author": "invinci-2",
  "original_created_utc": 1629012652,
  "title": "Should I be concerned if my girlfriend of six months asked me to transfer money to someone without an explanation?",
  "created_utc": 1629028311,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>She&#39;s currently schooling in a different country so she said she didn&#39;t have an account in our own country&#39;s currency and asked me to help. She told me to transfer the money with a screenshot and my own account number so &quot;her dad will transfer the money back&quot; (But the person I was supposed to transfer it to wasn&#39;t her dad. Plus her dad doesn&#39;t know I exist) And her only explanation was &quot;it&#39;s urgent&quot;. I was kinda feeling a bit uneasy the way she kept asking me to send it.\nI&#39;m even more suspicious by the fact that it looks like her WhatsApp (which is what we text on) seems to have been recently deleted and reinstalled, so I don&#39;t know if someone has hacked her phone and duped me. I&#39;ve heard a lot of funny scam stories and I hope this isn&#39;t one of them... Sorry if this is long, I&#39;m just a bit naive and came here looking for opinions to see if I&#39;m not the only one that feels something strange is going on.</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/TooAfraidToAsk/comments/p4p4lz/should_i_be_concerned_if_my_girlfriend_of_six/",
  "subreddit": "TooAfraidToAsk",
  "id": "p4p4lz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "She's currently schooling in a different country so she said she didn't have an\naccount in our own country's currency and asked me to help. She told me to\ntransfer the money with a screenshot and my own account number so \"her dad will\ntransfer the money back\" (But the person I was supposed to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "彼女は今、別の国で学校に通っているので、自分の国の通貨の口座を持っていないと言っていました。\n自国の通貨の口座を持っていないというので、私に助けを求めてきました。彼女は私に\nスクリーンショットと自分の口座番号を添えて送金するように言われたので、「彼女のお父さんから\n振り込むように言われました。",
      "title": "半年間付き合っている彼女が、何の説明もなく誰かにお金を振り込んでほしいと言ってきたら、心配するべきでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "她目前在一个不同的国家上学，所以她说她没有我们国家的货币账户。\n她说她没有我们国家的货币账户，让我帮忙。她告诉我\n她让我用截图和我自己的账户号码转账，这样 \"她爸爸就会\n转账\"（但我要转的人是...",
      "title": "如果我六个月的女友在没有解释的情况下让我给别人转钱，我应该担心吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "她目前在一個不同的國家上學，所以她說她沒有我們國家的貨幣賬戶。\n她說她沒有我們國家的貨幣賬戶，讓我幫忙。她告訴我\n她讓我用截圖和我自己的賬戶號碼轉賬，這樣 \"她爸爸就會\n轉賬\"（但我要轉的人是...",
      "title": "如果我六個月的女友在沒有解釋的情況下讓我給別人轉錢，我應該擔心嗎？"
    }
  ]
}