{
  "author": "TNGSystems",
  "the_new_excerpt": "It was one of the high-points of the Bear Market of 2018 and one that made me\nglad to be in the Crypto Space, where it seems like you don't need to be a\nruthless sociopath to get rich.\n\nPine, as she goes by, earned so much money she was \"past the point of satiety\"\nand decided to donate the rest. In…",
  "original_created_utc": 1621855812,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "それは2018年のベアマーケットの高得点の一つであり、私を喜ばせてくれたものです。\n金持ちになるために冷酷な社会病質者である必要はないと思われるCrypto Spaceにいることを嬉しく思いました。\n金持ちになるために冷酷な社会病質者である必要はないと思えるからです。\n\n通称パインは、あまりにも多くのお金を稼ぎすぎて \"飽きが来た \"ので\n残りのお金を寄付することにしました。で...",
      "title": "トップ250のBTC保有者が5,104BTCを現金化して5,500万ドルを得て、そのほとんどを匿名で世界中の慈善団体に寄付した、2018年の「パイナップルファンド」を覚えている人はいるだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是2018年熊市的高点之一，也是让我\n很高兴来到加密货币领域，在这里，你似乎不需要成为一个无情的反社会者就能发财。\n无情的反社会分子才能致富。\n\n她的名字叫Pine，她赚了很多钱，\"已经过了饱食的阶段\"\n并决定把剩下的钱捐出去。在...",
      "title": "谁还记得2018年的 \"菠萝基金\"，一个排名前250位的BTC持有者以5500万美元套现了5104个BTC，并匿名将其中大部分捐给了世界各地的慈善机构？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是2018年熊市的高點之一，也是讓我\n很高興來到加密貨幣領域，在這裏，你似乎不需要成爲一個無情的反社會者就能發財。\n無情的反社會分子才能致富。\n\n她的名字叫Pine，她賺了很多錢，\"已經過了飽食的階段\"\n並決定把剩下的錢捐出去。在...",
      "title": "誰還記得2018年的 \"菠蘿基金\"，一個排名前250位的BTC持有者以5500萬美元套現了5104個BTC，並匿名將其中大部分捐給了世界各地的慈善機構？"
    }
  ],
  "title": "Who remembers the \"Pineapple Fund\" of 2018, where a top 250 BTC holder cashed out 5,104 BTC for $55 Million, and anonymously donated most of it to charities worldwide?",
  "created_utc": 1621866638,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It was one of the high-points of the Bear Market of 2018 and one that made me glad to be in the Crypto Space, where it seems like you don&#39;t need to be a ruthless sociopath to get rich.  </p>\n\n<p>Pine, as she goes by, earned so much money she was &quot;past the point of satiety&quot; and decided to donate the rest. In total, she donated 5,104 BTC worth $55,000,000,   </p>\n\n<p><a href=\"http://pineapplefund.org/\">http://pineapplefund.org/</a>  </p>\n\n<p>She scoured the web and took suggestions, donating thousands to millions of dollars to verified charities.  </p>\n\n<p>These are the kinds of people we should hold up with praise. I have absolutely no beef with rich or the super rich, but I do think if you earn so much money you can&#39;t possibly spend it, you are a special kind of asshole if you don&#39;t at least engage in some philanthropy to re-distribute your abundance of wealth.  </p>\n\n<p>EDIT: It&#39;s a GURL.</p>\n</div><!-- SC_ON -->",
  "score": 2401,
  "permalink": "/r/CryptoCurrency/comments/njvs8f/who_remembers_the_pineapple_fund_of_2018_where_a/",
  "subreddit": "CryptoCurrency",
  "id": "njvs8f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197385283
}