{
  "author": "nikon_nomad",
  "original_created_utc": 1638041396,
  "title": "Crypto.com is what mass adoption looks like. Their greatest trick is answering the question \"Why should I be interested in crypto?\" for the average consumer",
  "created_utc": 1638055959,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The more I think about it, the more amazed I am by what Crypto.com has done and is doing.</p>\n\n<p>The crazy good marketing and ideal domain name are obviously <strong>huge</strong> things, but they receive almost all of the attention. The product itself is where CDC truly excels and why it will become the biggest exchange.</p>\n\n<p>To offer a card that gives you free Spotify and Netflix is absolutely genius. In one single swoop it cuts away all other reasons needed to explain to someone what the hell crypto is about and why on earth should they be interested in it.</p>\n\n<p>It doesn&#39;t get any more understandable than &quot;Free Netflix and Spotify&quot;. That&#39;s the hook that makes people perk up and listen, because they <em>get it</em>. And then they&#39;re ready to hear about some of the other benefits. &quot;So you&#39;re telling me it&#39;s like a bank except <strong>they&#39;re</strong> the ones paying <strong>me</strong>?&quot;</p>\n\n<p>It also puts Crypto.com in great company by association. Because &quot;We&#39;re the Netflix/Spotify of cryptocurrency&quot; is precisely the position they want to be in and are marching towards.</p>\n\n<p>CDC and its advertising will bring hundreds of millions of people to cryptocurrency. Add in the forced staking, another stroke of genius, and they&#39;ll have hundreds of billions of dollars in the vaults. This company will be like the whole world&#39;s crypto bank if it succeeds.</p>\n\n<p>People compare BNB to CRO and think BNB&#39;s market cap is close to the max CRO can reach, but with the vast hordes of new users about to enter the game, I think CRO will far surpass BNB in the coming years.</p>\n\n<p>Yes, you could say I&#39;m bullish on this one. I&#39;m also scared about the giant being built (please don&#39;t be evil), but for now this one seems like a very obvious investment.</p>\n</div><!-- SC_ON -->",
  "score": 265,
  "permalink": "/r/CryptoCurrency/comments/r3kx2x/cryptocom_is_what_mass_adoption_looks_like_their/",
  "subreddit": "CryptoCurrency",
  "id": "r3kx2x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The more I think about it, the more amazed I am by what Crypto.com has done and\nis doing.\n\nThe crazy good marketing and ideal domain name are obviously huge things, but\nthey receive almost all of the attention. The product itself is where CDC truly\nexcels and why it will become the biggest…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "考えれば考えるほど、Crypto.comがしてきたこと、やっていることには驚かされます。\nしています。\n\n非常に優れたマーケティングと理想的なドメイン名は明らかに大きな意味を持ちますが\nほとんどすべての注目を集めています。製品自体はCDCが本当に優れているところであり\n卓越しているところであり、なぜそれが最大の...",
      "title": "Crypto.comは大量採用のようなものです。彼らの最大の仕掛けは、一般消費者の「なぜ暗号に興味を持たなければならないのか」という疑問に答えることです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我越是这样想，就越是对Crypto.com已经和正在做的事情感到惊讶。\n正在做的事情。\n\n疯狂的好的营销和理想的域名显然是巨大的事情，但是\n它们几乎得到了所有的关注。产品本身才是CDC真正的优势所在\n擅长的地方，也是它将成为全球最大的互联网公司的原因。",
      "title": "Crypto.com是大规模采用的模样。他们最大的诀窍是为普通消费者回答 \"我为什么要对加密货币感兴趣 \"的问题。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我越是這樣想，就越是對Crypto.com已經和正在做的事情感到驚訝。\n正在做的事情。\n\n瘋狂的好的營銷和理想的域名顯然是巨大的事情，但是\n它們幾乎得到了所有的關注。產品本身才是CDC真正的優勢所在\n擅長的地方，也是它將成爲全球最大的互聯網公司的原因。",
      "title": "Crypto.com是大規模採用的模樣。他們最大的訣竅是爲普通消費者回答 \"我爲什麼要對加密貨幣感興趣 \"的問題。"
    }
  ]
}