{
  "author": "kryptonxenon345",
  "original_created_utc": 1642253132,
  "title": "Is long-Covid specific to Covid infection only, or can you get something similar from a regular cold?",
  "created_utc": 1642260612,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I can see how long-Covid can be debilitating for people, but why is it that we don&amp;#39;t hear about the long haul sequelae of a regular cold?&lt;/p&gt;\n\n&lt;p&gt;Edit: If long-Covid isn&amp;#39;t specific for Covid only, why is it that scientists and physicians talk about it but not about post-regular cold symptoms?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 176,
  "permalink": "/r/askscience/comments/s4k9wd/is_longcovid_specific_to_covid_infection_only_or/",
  "subreddit": "askscience",
  "id": "s4k9wd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I can see how long-Covid can be debilitating for people, but why is it that we\ndon't hear about the long haul sequelae of a regular cold?\n\nEdit: If long-Covid isn't specific for Covid only, why is it that scientists and\nphysicians talk about it but not about post-regular cold symptoms?",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "長引くコビトが人々を衰弱させるのはわかりますが、なぜ私たちは\n普通の風邪の長期にわたる後遺症は、あまり聞きませんね。\n\n編集部：もし長引く風邪が風邪だけに特化したものでないのなら、なぜ科学者や\n医師はそれについて話すが、通常の風邪の後遺症については話さないのか？",
      "title": "ロングコビットはコビットの感染のみに特化したものなのか、それとも普通の風邪でも似たようなものができるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道长效感冒会使人变得虚弱，但为什么我们没有听说过普通感冒的长期后遗症呢？\n没有听说过普通感冒的长期后遗症？\n\n编辑：如果long-Covid不是只针对Covid的，为什么科学家和医生会谈论它，而不是普通感冒的后遗症呢？\n医生谈论它，而不是谈论普通感冒后的症状？",
      "title": "长沙市是否只针对长沙市的感染，还是可以从普通感冒中得到类似的东西？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道長效感冒會使人變得虛弱，但爲什麼我們沒有聽說過普通感冒的長期後遺症呢？\n沒有聽說過普通感冒的長期後遺症？\n\n編輯：如果long-Covid不是隻針對Covid的，爲什麼科學家和醫生會談論它，而不是普通感冒的後遺症呢？\n醫生談論它，而不是談論普通感冒後的症狀？",
      "title": "長沙市是否只針對長沙市的感染，還是可以從普通感冒中得到類似的東西？"
    }
  ]
}