{
  "author": "Salmon-Warrior",
  "original_created_utc": 1633675619,
  "title": "how is pediphillia a mental disorder but homosexuality isn't?",
  "created_utc": 1633696596,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This question sounds either extremely creepy or extremely homophobic. I&#39;m neither of those. I&#39;m just curious.</p>\n\n<p>If pedophillia is considered a mental disorder (which it should) why isn&#39;t homosexuality one? (I&#39;m not saying it should) just for the sole fact that their definitions are so similar makes me wonder this. The vast difference between these is that one is absurd and fucked up and the other is completely normal by today&#39;s standards. Is it because of social acceptance to homosexuality?</p>\n\n<p>I don&#39;t know if I should even post this. It just sounds wrong</p>\n</div><!-- SC_ON -->",
  "score": 126,
  "permalink": "/r/TooAfraidToAsk/comments/q3saji/how_is_pediphillia_a_mental_disorder_but/",
  "subreddit": "TooAfraidToAsk",
  "id": "q3saji",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This question sounds either extremely creepy or extremely homophobic. I'm\nneither of those. I'm just curious.\n\nIf pedophillia is considered a mental disorder (which it should) why isn't\nhomosexuality one? (I'm not saying it should) just for the sole fact that their\ndefinitions are so similar makes…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この質問は、非常に気持ち悪いというか、非常に同族嫌悪的に聞こえます。私は\nそのどちらでもない。ただ、興味があるだけです。\n\nもし小児性愛が精神障害とみなされるなら（みなされるべきですが）、なぜ同性愛は精神障害ではないのでしょうか？\n同性愛は精神疾患ではないのでしょうか？(そうすべきだとは言いませんが）ただ、その定義がとても似ているという事実だけです。\n定義が非常に似ているという事実だけで...",
      "title": "小児麻痺は精神疾患で、同性愛は精神疾患ではないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这个问题听起来要么是极其令人毛骨悚然，要么是极其仇视同性恋。我不是\n都不是。我只是很好奇。\n\n如果恋童癖被认为是一种精神障碍（应该如此），为什么同性恋就不是呢？\n同性恋不是吗？(我不是说它应该是），只是因为他们的定义如此相似的唯一事实\n定义是如此的相似，这让...",
      "title": "为什么小儿麻痹症是一种精神障碍，而同性恋却不是？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個問題聽起來要麼是極其令人毛骨悚然，要麼是極其仇視同性戀。我不是\n都不是。我只是很好奇。\n\n如果戀童癖被認爲是一種精神障礙（應該如此），爲什麼同性戀就不是呢？\n同性戀不是嗎？(我不是說它應該是），只是因爲他們的定義如此相似的唯一事實\n定義是如此的相似，這讓...",
      "title": "爲什麼小兒麻痹症是一種精神障礙，而同性戀卻不是？"
    }
  ]
}