{
  "author": "acovados",
  "original_created_utc": 1637103245,
  "title": "What to say to my grandpa for our “final goodbye”",
  "created_utc": 1637114009,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My grandpa is expected to pass away in the next 24 hours. I live out of the country, but we’ve remained close, and I visit and call whenever I can. He’s been physically sick for nearly a decade, but his mind and personality are intact. In a few hours, we’re going to have a video call, which likely will be the last time we’ll be able to talk. </p>\n\n<p>I’ve never talked to someone on their deathbed before, and I could really use some advice. What can I possibly say?</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/NoStupidQuestions/comments/qvkibp/what_to_say_to_my_grandpa_for_our_final_goodbye/",
  "subreddit": "NoStupidQuestions",
  "id": "qvkibp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My grandpa is expected to pass away in the next 24 hours. I live out of the\ncountry, but we’ve remained close, and I visit and call whenever I can. He’s\nbeen physically sick for nearly a decade, but his mind and personality are\nintact. In a few hours, we’re going to have a video call, which likely…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私のおじいちゃんは24時間以内に亡くなる予定です。私は外国に住んでいますが\n私は国外に住んでいますが、ずっと仲良くしていて、できる限り訪問したり電話したりしています。おじいちゃんは\n身体的には10年近く病気を患っていますが、心や性格はとても穏やかです。\n無傷です。数時間後、私たちはビデオ通話をすることになっていますが、おそらく...",
      "title": "おじいちゃんとの \"最後のお別れ \"に何を言うべきか"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我爷爷预计将在未来24小时内去世。我住在国外\n我住在国外，但我们的关系一直很好，只要有机会我就会去看望和打电话。他已经\n他的身体已经病了近十年了，但他的思想和人格仍然\n完整无缺。几个小时后，我们将进行一次视频通话，这很可能...",
      "title": "在我们的 \"最后告别 \"中，该对我的爷爷说些什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我爺爺預計將在未來24小時內去世。我住在國外\n我住在國外，但我們的關係一直很好，只要有機會我就會去看望和打電話。他已經\n他的身體已經病了近十年了，但他的思想和人格仍然\n完整無缺。幾個小時後，我們將進行一次視頻通話，這很可能...",
      "title": "在我們的 \"最後告別 \"中，該對我的爺爺說些什麼？"
    }
  ]
}