{
  "author": "Many_Scratch2269",
  "original_created_utc": 1642667454,
  "title": "This is not even close to a bear market yet, and you shouldn't lose hope in the market.",
  "created_utc": 1642693175,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For a bear market to happen, it would take a lot more than just -42% over a period of 2 months. We&amp;#39;ve seen as much as -41% being wiped off the market in 2017 in a matter of weeks, yet the bull run kept continuing for months. It is not unrealistic to expect the same thing could happen now in 2022.&lt;/p&gt;\n\n&lt;h1&gt;Comparing the May correction to the current one&lt;/h1&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/5ks3gv1qtsc81.jpg?width=1247&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=0fbf56939bbe923c429c47518b6f608fe18a7ebb\"&gt;https://preview.redd.it/5ks3gv1qtsc81.jpg?width=1247&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=0fbf56939bbe923c429c47518b6f608fe18a7ebb&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Bitcoin has also hit a pretty significant support level and is refusing to go below it. This is the same support level that Bitcoin held in late September before hitting a new all-time high.&lt;/p&gt;\n\n&lt;p&gt;The bearish price action we&amp;#39;re seeing is still nothing compared to what happened from May - July.  In June/July almost everyone was calling for a bear market, but Bitcoin still recovered within a few months. &lt;/p&gt;\n\n&lt;h1&gt;Hash rate shows market is undervalued rather than overvalued&lt;/h1&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/q3oxrse2ysc81.png?width=1273&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=f764e0eea23cb0b849bbe263a3456f9ec3d57033\"&gt;https://preview.redd.it/q3oxrse2ysc81.png?width=1273&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=f764e0eea23cb0b849bbe263a3456f9ec3d57033&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Moreover, a bear market usually comes when the entire market is overvalued, which seems far from the truth considering Bitcoin hit a new hash rate high. If Bitcoin was overvalued, hash rates reaching new highs would be completely irrational as Bitcoin is not cheap to mine. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TLDR&lt;/strong&gt;: There is still hope in the market because there&amp;#39;s still a high likelihood of the market bouncing back like it did in July and September. A -42% loss over a 2 month period is more of a correction than a bear market, and the metrics also show only one thing, and that is we are still far from a bear market.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 307,
  "permalink": "/r/CryptoCurrency/comments/s8e9p7/this_is_not_even_close_to_a_bear_market_yet_and/",
  "subreddit": "CryptoCurrency",
  "id": "s8e9p7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "For a bear market to happen, it would take a lot more than just -42% over a\nperiod of 2 months. We've seen as much as -41% being wiped off the market in\n2017 in a matter of weeks, yet the bull run kept continuing for months. It is\nnot unrealistic to expect the same thing could happen now in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ベアマーケットが起こるには、-42%だけでなく、もっと多くのことが必要でしょう。\n2ヶ月間 私たちは、-41%もの市場が一掃されるのを、2ヶ月の間に見てきました。\n2017年は数週間のうちに、それでも数ヶ月間ブルランが継続されました。それは\n今、同じことが起こるかもしれないと予想することは非現実的ではありません。",
      "title": "まだベアマーケットというほどではないので、マーケットに希望を失ってはいけない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对于熊市的发生，需要的不仅仅是两个月内的-42%。\n2个月的时间。我们已经看到，在2017年的几周内，市场被抹去了多达-41%的损失。\n2017年，在短短几周内就被抹去了41%，但牛市运行却持续了几个月。这就是\n预计同样的事情现在可能发生在...",
      "title": "现在还没有到熊市的程度，你不应该对市场失去希望。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對於熊市的發生，需要的不僅僅是兩個月內的-42%。\n2個月的時間。我們已經看到，在2017年的幾周內，市場被抹去了多達-41%的損失。\n2017年，在短短几周內就被抹去了41%，但牛市運行卻持續了幾個月。這就是\n預計同樣的事情現在可能發生在...",
      "title": "現在還沒有到熊市的程度，你不應該對市場失去希望。"
    }
  ]
}