{
  "author": "SirRettfordIII",
  "original_created_utc": 1632701896,
  "title": "How were mercenaries hired during medieval times?",
  "created_utc": 1632749490,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I understand that during large wars and campaigns many kingdoms hired out mercenaries to bolster their forces alongside trained knights and conscripted peasants, but how were those mercenaries hired or selected to fight in those wars? Were they already know to kingdoms through some sort of guild registration? Did someone from the kingdom go around asking for mercenary companies looking for work? In various video games and fantasy novels, there is usually a Adventurer&#39;s Guild where adventurers/heros for hire/mercenaries can register for quests, was it something like this?</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/pw5ptf/how_were_mercenaries_hired_during_medieval_times/",
  "subreddit": "AskHistorians",
  "id": "pw5ptf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I understand that during large wars and campaigns many kingdoms hired out\nmercenaries to bolster their forces alongside trained knights and conscripted\npeasants, but how were those mercenaries hired or selected to fight in those\nwars? Were they already know to kingdoms through some sort of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "大規模な戦争やキャンペーンの際には、多くの王国が傭兵を雇って、トレーニーと一緒に部隊を強化していたことを理解しています。\n傭兵を雇って、訓練された騎士や徴兵された農民と一緒に戦力を増強していたことは理解できます。\nしかし、その傭兵はどのようにして雇われ、選ばれたのでしょうか？\n傭兵はどのようにして雇われたのでしょうか？傭兵はどのようにして選ばれたのでしょうか？",
      "title": "中世の傭兵はどのようにして雇われたのですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "据我所知，在大型战争和战役中，许多王国都会雇用\n雇佣兵，以加强他们的部队，同时还有训练有素的骑士和应征的\n农民，但这些雇佣兵是如何被雇用或挑选出来参加这些战争的？\n战争？他们是否已经通过某种方式为王国所知？",
      "title": "在中世纪时期，雇佣兵是如何被雇用的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "據我所知，在大型戰爭和戰役中，許多王國都會僱用\n僱傭兵，以加強他們的部隊，同時還有訓練有素的騎士和應徵的\n農民，但這些僱傭兵是如何被僱用或挑選出來參加這些戰爭的？\n戰爭？他們是否已經通過某種方式爲王國所知？",
      "title": "在中世紀時期，僱傭兵是如何被僱用的？"
    }
  ]
}