{
  "author": "Major_BD",
  "the_new_excerpt": "Hello all,\n\nI’m curious to hear what other redditor’s opinions are on the current market. Do\nyou see it continue to rise within the next year? Do you expect a crash? A\ncorrection? What are your thoughts on the state of the housing market over the\nnext two years? How bad of a hit do you expect…",
  "original_created_utc": 1621146990,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さんこんにちは。\n\n現在の市場について、他のredditorの意見を聞いてみたいと思います。あなたは\n今後1年以内に上昇し続けると思いますか？暴落すると思いますか？A\n訂正？今後2年間の住宅市場の状況について、どのようにお考えですか？\n今後2年間の住宅市場の状況についてどうお考えですか？どの程度の打撃を予想していますか...",
      "title": "株式市場の一般的な感覚はどうでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。\n\n我很想听听其他redditor对目前市场的看法是什么。你认为在未来一年内，市场是否会继续上升？\n你认为它在未来一年内会继续上涨吗？你预计会出现崩溃吗？A\n修正？你对未来两年的住房市场状况有什么看法？\n未来两年的房地产市场状况？你预计会有多大的冲击？",
      "title": "人们对股市的普遍看法是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。\n\n我很想聽聽其他redditor對目前市場的看法是什麼。你認爲在未來一年內，市場是否會繼續上升？\n你認爲它在未來一年內會繼續上漲嗎？你預計會出現崩潰嗎？A\n修正？你對未來兩年的住房市場狀況有什麼看法？\n未來兩年的房地產市場狀況？你預計會有多大的衝擊？",
      "title": "人們對股市的普遍看法是什麼？"
    }
  ],
  "title": "What is the general sentiment about the stock market?",
  "created_utc": 1621175309,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello all,</p>\n\n<p>I’m curious to hear what other redditor’s opinions are on the current market. Do you see it continue to rise within the next year? Do you expect a crash? A correction? What are your thoughts on the state of the housing market over the next two years? How bad of a hit do you expect stocks/housing to take when rates eventually go up. </p>\n\n<p>I understand this all speculation and no one knows what will happen, just curious to see if anyone has any opinions and why, based on what you’re seeing.</p>\n\n<p>I personally believe stocks will keep going up with a few corrections but no big crash. I think the big one will happen within the next 5-10 years due to a financial crisis. As for the housing frenzy, I believe that will burn out in a couple years and drive prices down ~20%.</p>\n\n<p>Your thoughts?</p>\n</div><!-- SC_ON -->",
  "score": 133,
  "permalink": "/r/stocks/comments/ndib9g/what_is_the_general_sentiment_about_the_stock/",
  "subreddit": "stocks",
  "id": "ndib9g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590804455
}