{
  "author": "KodiakTheKing",
  "the_new_excerpt": "I know that there are a lot of people who are going to try to make fun of me\nhere... You will say things like “men can’t get raped” or “was she hot”? Please\nrefrain from making unhelpful comments. This is how I lost my virginity. It had\nhad everlasting psychological effects on me, albeit not major…",
  "original_created_utc": 1618410512,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私のことを馬鹿にしようとする人がたくさんいるのはわかっていますが\nここでは・・・。男はレイプされない」とか「彼女はセクシーだったのか」などと言うでしょう。お願い\n役に立たないコメントはご遠慮ください。これが私の処女喪失の方法です。それは\n大したことではないのですが、心理的な影響がずっと残っていました...。",
      "title": "私は38歳の男性で、14歳の時に友人の姉に薬漬けにされ、レイプされました。私はそのことを考えないようにしていますが、彼女は最近、フェイスブックで私と友達になろうとしています。私は無視していましたが、彼女と向き合うべきでしょうか？彼女は現在43歳で、お互いに家庭や生活を持っています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道有很多人都会试图取笑我。\n这里... 你会说 \"男人不可能被强奸 \"或者 \"她很性感 \"之类的话吗？请你告诉我\n不要做无益的评论。我就是这样失去了我的处女之身。它有\n对我产生了持久的心理影响，虽然不是很大... ...",
      "title": "我是一个38岁的男人，14岁的时候被朋友的姐姐下药强奸。我尽量不去想它，但她最近试图在Facebook上加我好友。我已经忽略了，但我应该面对她吗？她现在43岁，我们都有自己的家庭/生活。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道有很多人都會試圖取笑我。\n這裏... 你會說 \"男人不可能被強姦 \"或者 \"她很性感 \"之類的話嗎？請你告訴我\n不要做無益的評論。我就是這樣失去了我的處女之身。它有\n對我產生了持久的心理影響，雖然不是很大... ...",
      "title": "我是一個38歲的男人，14歲的時候被朋友的姐姐下藥強姦。我儘量不去想它，但她最近試圖在Facebook上加我好友。我已經忽略了，但我應該面對她嗎？她現在43歲，我們都有自己的家庭/生活。"
    }
  ],
  "title": "I am a 38 year old guy who was drugged and raped by a friend’s older sister when I was 14. I try not to think about it, but she recently tried friending me on Facebook. I have ignored, but should I confront her? She is now 43 and we both have families/lives of our own.",
  "created_utc": 1618423445,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I know that there are a lot of people who are going to try to make fun of me here... You will say things like “men can’t get raped” or “was she hot”? Please refrain from making unhelpful comments. This is how I lost my virginity. It had had everlasting psychological effects on me, albeit not major ones. Always too afraid to ask, but really need help me thinking this through..</p>\n</div><!-- SC_ON -->",
  "score": 111,
  "permalink": "/r/TooAfraidToAsk/comments/mqrqm2/i_am_a_38_year_old_guy_who_was_drugged_and_raped/",
  "subreddit": "TooAfraidToAsk",
  "id": "mqrqm2",
  "is_self": true,
  "media": null,
  "is_video": false
}