{
  "author": "HotelThrowaway2234",
  "original_created_utc": 1635412794,
  "title": "If you were staying in a hotel room with your SO for a week, what would you bring / wish you brought?",
  "created_utc": 1635435073,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Basically my SO and I are long distance, and they are coming down to visit. I live with my parents, so we&#39;re renting a hotel for the week. I have the luxury of preparing a lot of creature comforts such as snacks and blankets. So I was wondering if anyone had any suggestions for things to bring to make our stay more comfortable. Things that maybe some of the travelers of the subreddit wished they had during their stays. NSFW answers welcome, as we&#39;re both new there too and anything that can make our stay more comfortable and relaxing is welcome.</p>\n</div><!-- SC_ON -->",
  "score": 137,
  "permalink": "/r/NoStupidQuestions/comments/qhj0zn/if_you_were_staying_in_a_hotel_room_with_your_so/",
  "subreddit": "NoStupidQuestions",
  "id": "qhj0zn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Basically my SO and I are long distance, and they are coming down to visit. I\nlive with my parents, so we're renting a hotel for the week. I have the luxury\nof preparing a lot of creature comforts such as snacks and blankets. So I was\nwondering if anyone had any suggestions for things to bring to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "基本的に私とSOは遠距離恋愛中で、彼らが遊びに来ることになっています。I\n私は両親と同居しているので、一週間ホテルを借りています。私には贅沢なことに\nお菓子や毛布などの快適なものをたくさん用意しています。そこで、どなたか\nどなたかお勧めの持ち物を教えてください。",
      "title": "もし、あなたがSOと一緒にホテルの部屋に1週間滞在するとしたら、何を持って行きますか／持って行きたいですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "基本上我和我的SO是异地恋，他们要来拜访。I\n我和我的父母住在一起，所以我们租了一个星期的酒店。我有足够的时间\n我可以准备很多舒适的东西，如零食和毯子。所以我在想\n所以我在想，如果有人有什么建议，可以带些什么东西来。",
      "title": "如果你和你的SO在酒店房间里住一个星期，你会带/希望带什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "基本上我和我的SO是異地戀，他們要來拜訪。I\n我和我的父母住在一起，所以我們租了一個星期的酒店。我有足夠的時間\n我可以準備很多舒適的東西，如零食和毯子。所以我在想\n所以我在想，如果有人有什麼建議，可以帶些什麼東西來。",
      "title": "如果你和你的SO在酒店房間裏住一個星期，你會帶/希望帶什麼？"
    }
  ]
}