{
  "author": "Many_Scratch2269",
  "original_created_utc": 1630810367,
  "title": "Ethereum just had it's first ever deflationary day.",
  "created_utc": 1630824075,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is huge. Ethereum just closed the day burning more Ethereum than mined. Just so you know, Ethereum is now one of the few deflationary currencies on the planet.</p>\n\n<p>If this keeps going on, Ethereum will be an even stronger asset than it is currently. It just shows the plans the team had for Ethereum is now paying off. </p>\n\n<p>Once Ethereum 2.0 is complete god knows how far this can take us. Just the London Upgrade itself spurred a new bull run. Keep your Ethereum safe. Remember: we are still early! </p>\n\n<p>People are already expecting 10k Ethereum this year alone. Ethereum turning deflationary is extremely bullish for the price. Especially in the long term.</p>\n</div><!-- SC_ON -->",
  "score": 167,
  "permalink": "/r/CryptoCurrency/comments/pi532z/ethereum_just_had_its_first_ever_deflationary_day/",
  "subreddit": "CryptoCurrency",
  "id": "pi532z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is huge. Ethereum just closed the day burning more Ethereum than mined.\nJust so you know, Ethereum is now one of the few deflationary currencies on the\nplanet.\n\nIf this keeps going on, Ethereum will be an even stronger asset than it is\ncurrently. It just shows the plans the team had for…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは大きいですね。イーサリアムは採掘された数よりも多くのイーサリアムを燃やして一日を終えました。\nご存知のように、イーサリアムは今や地球上で数少ないデフレ通貨の一つです。\n地球上で数少ないデフレ通貨です。\n\nこの状態が続けば、イーサリアムは現在よりもさらに強い資産となるでしょう。\nになるでしょう。これは、チームの計画を示すものです。",
      "title": "イーサリアムは史上初のデフレの日を迎えました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是巨大的。以太坊刚刚关闭了一天，燃烧的以太坊比开采的以太坊多。\n就像你知道的那样，以太坊现在是地球上少数几个通货紧缩的货币之一。\n的少数通缩货币之一。\n\n如果这种情况继续下去，以太坊将成为比现在更强大的资产。\n目前。这只是显示了该团队的计划...",
      "title": "以太坊刚刚经历了它有史以来的第一个通货紧缩日。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是巨大的。以太坊剛剛關閉了一天，燃燒的以太坊比開採的以太坊多。\n就像你知道的那樣，以太坊現在是地球上少數幾個通貨緊縮的貨幣之一。\n的少數通縮貨幣之一。\n\n如果這種情況繼續下去，以太坊將成爲比現在更強大的資產。\n目前。這只是顯示了該團隊的計劃...",
      "title": "以太坊剛剛經歷了它有史以來的第一個通貨緊縮日。"
    }
  ]
}