{
  "author": "dal2k305",
  "the_new_excerpt": "Do to recent events there has been a large influx of new investors and traders.\nAll these new people is a good thing for the market. More people= more money in\nthe market which is good for all of us. But due to this new growth of investors\na lot of the new people don’t understand certain strategies…",
  "original_created_utc": 1613576637,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "由于最近发生的事件，有大量新的投资者和交易者涌入。\n所有这些新的人对市场来说是一件好事。更多的人=更多的钱在\n的市场，这对我们所有人都是好事。但由于这种新的投资者的增长\n很多新人不懂某些策略...",
      "title": "均线下跌是危险的，用错了股票。接住落刀。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "由於最近發生的事件，有大量新的投資者和交易者湧入。\n所有這些新的人對市場來說是一件好事。更多的人=更多的錢在\n的市場，這對我們所有人都是好事。但由於這種新的投資者的增長\n很多新人不懂某些策略...",
      "title": "均線下跌是危險的，用錯了股票。接住落刀。"
    }
  ],
  "title": "Averaging down is dangerous with the wrong stock. Catching the falling knife.",
  "created_utc": 1613583429,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Do to recent events there has been a large influx of new investors and traders. All these new people is a good thing for the market. More people= more money in the market which is good for all of us. But due to this new growth of investors a lot of the new people don’t understand certain strategies and are being misled by other selfish investors into making huge mistakes.</p>\n\n<p>Bringing your cost basis down is a strategy that a lot of investors use when they buy into a stock that sells off after. Generally you will see this when someone makes a large purchase leading up to an earnings report or some news event and things don’t pan out. The stock sells off 10% and they buy the dip to bring their cost basis down. This only works when the company you’re investing in is strong financially and fundamentally and when the macro conditions are conducive for a bull market.</p>\n\n<p>Why doesn’t this apply to the lot of meme stocks that exploded last month? Because their value was never based on anything financial or fundamental. What I am seeing now is people lowering their cost basis based on cosmetic appearance alone. $300 costs basis looks much worse than $100 costs basis when the stock is trading at $50 right ??? Wrong! it really comes down to how many shares you own for example:\nInvestor A buys 1 share of GME at $300 and the stock is currently trading at $50 their costs basis is $300 and they’re down $250. Investor B purchased 1 share at $300 and then 10 shares at $200 and another 10 shares at $100. Their cost basis is $157 but since they own 21 shares and the share price is $50 they’re down $2,247. </p>\n\n<p>Investor B has a much lower cost basis ($157) than investor A  ($300) but is down a lot more money ($2247 vs $300) When you chase after a parabolic stock that is not tied to fundamentals or finances and it eventually crashes you’re not supposed to buy the dip. This is called trying to catch a falling knife. Buying the dip is a fundamentals play, it’s a belief in the companies long term prospects and finances. What happened last month was the opposite of fundamentals.</p>\n\n<p>TLDR lowering your costs basis “averaging down”\nIs dangerous with the wrong stock. It is a fundamentals play and cannot be applied to the non-fundamental moves in meme stocks last month. Don’t try and catch the falling knife.</p>\n</div><!-- SC_ON -->",
  "score": 504,
  "permalink": "/r/stocks/comments/llxb6m/averaging_down_is_dangerous_with_the_wrong_stock/",
  "subreddit": "stocks",
  "id": "llxb6m",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728625107
}