{
  "author": "unfonfortable",
  "the_new_excerpt": "The Fed recently announced they might move their timeline up to increase\ninterest rates sooner. In theory, that would be more profitable for banks since\nthey can charge more on loans. However, all the big bank stocks went down a\npretty significant amount today. Why are bank stocks down today after…",
  "original_created_utc": 1623971270,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "先日、FRBは金利引き上げの時期を早める可能性があることを発表しました。\nより早く利上げを行う可能性があると発表しました。理論的には、その方が銀行にとっては利益になります。\n理論的には、銀行にとっては利益になる。しかし、大手銀行の株価はすべて下がりました。\nしかし、今日は大手の銀行株がすべてかなりの額を下げた。なぜ、今日は銀行株が下がっているのでしょうか...",
      "title": "FRBが早期の利上げを発表したばかりなのに、なぜ今日は銀行株が全部下がったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "美联储最近宣布，他们可能会将时间表提前，以更快地提高\n更快地提高利率。从理论上讲，这对银行来说是更有利的，因为\n他们可以对贷款收取更多费用。然而，所有大型银行股今天都下跌了\n今天的跌幅相当大。为什么银行股今天下跌，在...",
      "title": "如果美联储刚刚宣布他们会更早加息，为什么今天所有的银行股都下跌了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "美聯儲最近宣佈，他們可能會將時間表提前，以更快地提高\n更快地提高利率。從理論上講，這對銀行來說是更有利的，因爲\n他們可以對貸款收取更多費用。然而，所有大型銀行股今天都下跌了\n今天的跌幅相當大。爲什麼銀行股今天下跌，在...",
      "title": "如果美聯儲剛剛宣佈他們會更早加息，爲什麼今天所有的銀行股都下跌了？"
    }
  ],
  "title": "If the Fed just announced they'll raise interest rates sooner, why did all the bank stocks go down today?",
  "created_utc": 1623978967,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The Fed recently announced they might move their timeline up to increase interest rates sooner. In theory, that would be more profitable for banks since they can charge more on loans. However, all the big bank stocks went down a pretty significant amount today. Why are bank stocks down today after the Fed announced they might be raising interest rates sooner?</p>\n</div><!-- SC_ON -->",
  "score": 1236,
  "permalink": "/r/stocks/comments/o2ajxm/if_the_fed_just_announced_theyll_raise_interest/",
  "subreddit": "stocks",
  "id": "o2ajxm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009745410
}