{
  "author": "Wonderboi1995",
  "the_new_excerpt": "Our father Autist Michael Burry (Burry if you read that don't be offended, we\nmean it as a term of endearment. You are our hero). Has called the next crisis.\nHe posted a book on twitter that I will link here. I have just finished reading\nthe book: The dying of money. Here I will attempt to summarise…",
  "original_created_utc": 1614158324,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我们的父亲自闭症患者迈克尔-伯里（Burry如果你读到这句话，不要生气，我们是自闭症患者。\n意思是它作为一个术语的爱称。你是我们的英雄）。) 已经叫下一次危机。\n他在微博上发了一本书，我将在这里链接。我刚刚读完\n的书。\"金钱的消亡 在此，我将尝试总结... ...",
      "title": "为什么伯里神父要叫大空头2.0--我已经把他的信息翻译成了一种语言，你们这些自闭症患者也许经过努力，能够理解。三个字： 通货膨胀"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們的父親自閉症患者邁克爾-伯裏（Burry如果你讀到這句話，不要生氣，我們是自閉症患者。\n意思是它作爲一個術語的愛稱。你是我們的英雄）。) 已經叫下一次危機。\n他在微博上發了一本書，我將在這裏鏈接。我剛剛讀完\n的書。\"金錢的消亡 在此，我將嘗試總結... ...",
      "title": "爲什麼伯裏神父要叫大空頭2.0--我已經把他的信息翻譯成了一種語言，你們這些自閉症患者也許經過努力，能夠理解。三個字： 通貨膨脹"
    }
  ],
  "title": "Why Father Burry is calling the big short 2.0 - I have translated his message into a language you autists may, with effort, be able to understand. Three words: Inflation.",
  "created_utc": 1614177050,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Our father Autist Michael Burry (Burry if you read that don&#39;t be offended, we mean it as a term of endearment. You are our hero). Has called the next crisis. He posted a book on twitter that I will link here. I have just finished reading the book: The dying of money. Here I will attempt to summarise why he says the end is nigh.</p>\n\n<p>I read the book so you didn&#39;t have to.</p>\n\n<p>&#x200B;</p>\n\n<p>Unfortunately I need to first explain some simple economics: but here goes... Most of you already know many of this stuff...you can skip a bit ahead. This first bit is for all the new retards we have recruited.</p>\n\n<p>&#x200B;</p>\n\n<p>In order to stimulate the economy, America, and other governments, by way of their Central banks ‘print money’. They do this by buying their own governments bonds in the open market. They sometimes, as during the COVID crisis, buy corporate debt too. They actually, literally, ‘buy’ this money with money they ‘digitally print’. That money comes from nowhere. (They add a liability and an asset to their balance sheet and boom- printed money).</p>\n\n<p>Their intention is to stimulate the economy by reducing interest rates. When you buy a bond, you push it’s price up, which then decreases it’s yield – if that relationship confuses you, here is an example. A 1-year bond is trading in the market at 98$ (this bond has a par value of 100$), so you can buy the bond at 98$ wait a year and receive 100$. A nice 2/98 = 2%~ yield.</p>\n\n<p>Below, fed buys bonds, yields go lower.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/k5c2gmio6ej61.png?width=554&amp;format=png&amp;auto=webp&amp;s=f2519e2a3c5964b329dda0de9e05d03316876656\">Yields fall as government buys bonds.</a></p>\n\n<p>If interest rates go down, businesses borrow more money to invest, and jobs are created because investments create jobs. But, if an economy is running at 2% interest rates then even investments yielding a meagre 2.5% would be invested in, because they can earn the difference ~0.5%...</p>\n\n<p><strong>Why doesn’t the printing of money, by way of decreasing interest rates, cause inflation immediately?</strong> Well, actually, it does. It creates inflation immediately in stock prices. The ‘printed’ money doesn’t go to your average citizen, it goes to corporations who sell their debt to the Central Bank. It goes to big investors who sell their government bonds back to the Central Bank because they can earn more in stocks this way. They are clever, they know a   stock yielding even a stable 3% will earn them more than the current bond which only yields 2%.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/xvtnb39w6ej61.png?width=553&amp;format=png&amp;auto=webp&amp;s=093073729951c00917ffd9a974cb5974ba76c39b\">Stonks go up when fed prints. Relationship is dumb simple.</a></p>\n\n<p>&#x200B;</p>\n\n<h1>START READING HERE SMART AUTISTS!!!!!!!!!</h1>\n\n<p><strong>When does printing become a problem?</strong></p>\n\n<p>The central bank looks at food prices, general household items, petrol prices, housing and other goods that the average you and me purchase almost every week. Bundle these together and call them CPI (Consumer price index) – inflation. Inflation in <strong>certain</strong> goods.</p>\n\n<p>Now let’s imagine a scenario. You have 100 people in an economy. 2 people are stinking rich and the rest get by fine but don’t have much extra to invest or save each month. They use their savings to purchase mediocre goods, a new bicycle, or a new TV. Why would they invest that extra $100, it’s too little a sum to have any affect, even in the long run, on their lives.</p>\n\n<p>Now we look at the rich, they already have the TV, the car, a wife and a girlfriend and maybe a few houses. Where does their extra savings go? Straight into stocks. And maybe a new car every so often. Fine-dining and other sorts of things which <strong>are not in the CPI (consumer price index)</strong> basket.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>WATCH THIS:</strong></p>\n\n<p>Mr Central banker comes along and prints an extra $1000. Give this money to the Rich man what will he do? He already has the car; he already has the houses. He will invest it straight into the market. Bam! Stock market inflation, stock market goes up. This is what has been happening since 2008 (you will see a graph further below that displays this process).</p>\n\n<p>The extra 1000$ does not affect the CPI basket…The rich man is not going to suddenly eat twice as much or buy 10 more TV’s. The “stimulus” money from the Central bank inflates only the stock market.</p>\n\n<p>Give this 1000$ to the poor-normal man, what will he do? He may treat his wife to dinner, buy his kid a bicycle that he couldn’t afford. Fill up his truck. Pay his rent. It is not that he is wrong to do this, this is most likely his best option. A meagre 1000$ in the stock market will have no effect on his life, even in the long term.</p>\n\n<p>The point here, is that Central Bank ‘Printing’ does cause inflation, it causes inflation immediately in the stock market- because that’s where the money goes. Only when that money ‘spills’ into public hands (Think stimulus checks) does inflation in the ‘CPI’ sense of the word, unveil itself.</p>\n\n<p><strong>Inflation becomes a problem.</strong></p>\n\n<p>Inflation becomes a problem when it isn’t accompanied by its good friend economic growth. Inflation, has an interesting effect of raising bond yields. Investors don’t want 2% bond yield if inflation is at 3%. So, they simple do this- they don’t buy bonds. What happens when someone doesn’t want to buy your house? You lower the price. No one is buying bonds? Bond prices go lower, and therefore yields rise. – Remember if no one buys the bond the prices go from 98$ to 95$ (supply demand). At the end of the bond’s life, you get 100$, so the yield rises as the price falls.</p>\n\n<p><strong>The inflation problem occurs</strong> when the average man got his hands on some of that sweet government money. The poor man was able to effect CPI because he will actually purchase goods in the CPI basket. Give every poor man in America 1000$ they will go out and buy from a limited supply of goods. A limited supply of goods, supply demand and prices rise. Inflation – CPI.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>What do we do?</strong></p>\n\n<p>There are basically only two outcomes to this scenario:</p>\n\n<ol>\n<li>If inflation in CPI, caused by the average American’s stimulus check, opening of the economy, increasing oil and commodity prices, gathers momentum, it will finally unleash the latent inflation potential of America. Everyone who holds dollars, or dollar denominated debt – meaning every single country. Will pay for America’s inflationary sins. Fortunately, poorer countries who are indebted to America should actually benefit from this.</li>\n</ol>\n\n<p>Under this scenario inflation will need to increase by this much (look at red line in graph):</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/zp2yb1r57ej61.png?width=463&amp;format=png&amp;auto=webp&amp;s=3ab58d80429b169749c0d3b868007983fb5889f5\">The red gap is the inflationary potential- The inflation that has not yet been realised but it does exist and needs to be realised eventually</a></p>\n\n<p>You can see that in 2008 the Central government began its shenanigans. In a stable economy, money supply should increase sort of in line with GDP. As you can see above money supply has increased far more than that. That gap, indicated by the red line, is inflationary potential. It now basically just sits in stocks.</p>\n\n<p>Under this scenario, by my calculations, money supply needs to come back down to real GDP. The Central Bank won’t do this. They won’t tighten. That would hurt too much. But the naturally forces of inflation will do it for them. And prices in the economy will inflate to catch up with the money supply.</p>\n\n<p>2) Scenario 2: A highly probable outcome: Japanification.</p>\n\n<p>Japan has been doing QE for a much longer time than America. The reason why they haven’t blown up in an atomic bomb of inflation is because this money never reached the hands of the middle class or the poor. So that inflation couldn’t occur in CPI.</p>\n\n<p>However, inflation did occur everywhere where the rich were. As it was them who had more access to this money.</p>\n\n<p>America’s Central Bank could, by way of printing even more money, buy more bonds and push down yields. They could let inflation run for a little while and hope it doesn’t gain momentum. If inflation gains real momentum, which it could because they are giving money to the middle and lower classes, then they cannot follow Japans lead. If inflation remains muted and low. The real issues of wealth inequality will only persist and worsen.</p>\n\n<p>&#x200B;</p>\n\n<p>It is not to say that the managers of these governments are inherently sinister in their motives to conduct QE, which disproportionately benefits the rich. It may just be the only way they know. And by human nature people would rather be instantly gratified, leaving future generations to pay for inflationary sins.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>What happens in scenario 1 summary:</strong></p>\n\n<p>Inflation goes out of control (CPI inflation, stock inflation has already had its turn). Yields rise, Central Bank get’s spooked and tries to raise rates a little. Economy tanks due to raised rates. 6 months later or maybe a year later and the currency has found equilibrium by depreciating around 70% relative to the price of real goods- not relative to the price of other currencies. Or the currency has found equilibrium because they removed that money from the system-highly unlikely.</p>\n\n<p>Stocks fall because yields rose. And everyone has the next best opportunity to invest into the stock market.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>What happens in scenario 2 summary:</strong></p>\n\n<p>Inflation rises a bit due to stimulus checks. Central bank remains unconvinced that inflation will gain momentum. If inflation does not gain momentum the Central Bank will continue to print until they see GDP growth. Stocks go up but until the wealth gap is too extreme and a revolution takes place. This could take 10 years or 100 years.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/soxtt7dm7ej61.png?width=602&amp;format=png&amp;auto=webp&amp;s=247b3ccb7cb0c36c3a51064517ae66099b86ab80\">Inflation only becomes a problem when the poor get to buy normal goods that exist in the CPI.</a></p>\n\n<p>&#x200B;</p>\n\n<p>TL:DR - You don&#39;t deserve to benefit in this crash. It is a well known secret that the real autists on this forum can read, and read well.</p>\n\n<p>&#x200B;</p>\n\n<p>One more thing- Warren Buffett, and Michael Burry, both filed their 13-F recently. They are holding a LOT of inflation hedged stocks. Telecommunications, real estate, consumer goods.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://recision.files.wordpress.com/2010/12/jens-parsson-dying-of-money-24.pdf\">https://recision.files.wordpress.com/2010/12/jens-parsson-dying-of-money-24.pdf</a> The book he posted. Read it, it&#39;s bloody enlightening. May even cure your autism</p>\n</div><!-- SC_ON -->",
  "score": 19283,
  "permalink": "/r/wallstreetbets/comments/lr8h1v/why_father_burry_is_calling_the_big_short_20_i/",
  "subreddit": "wallstreetbets",
  "id": "lr8h1v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332901572
}