{
  "author": "turtleflax",
  "the_new_excerpt": "Does bullish sentiment on social media give you confidence? Maybe it shouldn't\n\nhttps://np.reddit.com/r/CryptoCurrency/comments/7jle54/be_careful_out_there/\n\nhttps://np.reddit.com/r/CryptoMarkets/comments/7jla1s/be_careful_out_there/\n\nThis was posted at $16,500. 4 days later bitcoin's price would…",
  "original_created_utc": 1621103091,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ソーシャルメディア上の強気のセンチメントは自信につながるか？そうすべきではないかもしれません\n\nhttps://np.reddit.com/r/CryptoCurrency/comments/7jle54/be_careful_out_there/\n\nhttps://np.reddit.com/r/CryptoMarkets/comments/7jla1s/be_careful_out_there/\n\nこれは16,500ドルで投稿されたものです。4日後、ビットコインの価格は...",
      "title": "私は2017年にトップを呼んで、そのためにローストされました。最後のブルランのセンチメントについての展望を得るために、それらの返信を読むことを強くお勧めします"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "社交媒体上的看涨情绪是否给了你信心？也许它不应该\n\nhttps://np.reddit.com/r/CryptoCurrency/comments/7jle54/be_careful_out_there/\n\nhttps://np.reddit.com/r/CryptoMarkets/comments/7jla1s/be_careful_out_there/\n\n这是在16,500美元时发布的。4天后比特币的价格将...",
      "title": "我在2017年叫过顶，并因此受到了抨击。我强烈建议阅读这些回复，以获得对上一次牛市中情绪的看法。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "社交媒體上的看漲情緒是否給了你信心？也許它不應該\n\nhttps://np.reddit.com/r/CryptoCurrency/comments/7jle54/be_careful_out_there/\n\nhttps://np.reddit.com/r/CryptoMarkets/comments/7jla1s/be_careful_out_there/\n\n這是在16,500美元時發佈的。4天后比特幣的價格將...",
      "title": "我在2017年叫過頂，並因此受到了抨擊。我強烈建議閱讀這些回覆，以獲得對上一次牛市中情緒的看法。"
    }
  ],
  "title": "I called the top in 2017 and got roasted for it. I highly recommend reading those replies to gain perspective about sentiment in the last bullrun",
  "created_utc": 1621117942,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Does bullish sentiment on social media give you confidence?  Maybe it shouldn&#39;t</p>\n\n<p><a href=\"https://np.reddit.com/r/CryptoCurrency/comments/7jle54/be_careful_out_there/\">https://np.reddit.com/r/CryptoCurrency/comments/7jle54/be_careful_out_there/</a></p>\n\n<p><a href=\"https://np.reddit.com/r/CryptoMarkets/comments/7jla1s/be_careful_out_there/\">https://np.reddit.com/r/CryptoMarkets/comments/7jla1s/be_careful_out_there/</a></p>\n\n<p>This was posted at $16,500.  4 days later bitcoin&#39;s price would spike to its final peak and crypto winter began.  It wouldn&#39;t see a price of $16,500 again for 3 years. I&#39;d like to highlight the bullishness, confidence, and even hostility of some of the replies.  This encapsulates the mania phase perfectly.  Keep in mind your biases and don&#39;t trade on emotion.  FOMO is well known but there is also <a href=\"https://en.wikipedia.org/wiki/Optimism_bias\">optimism bias</a> which was paraphrased in The Big Short as &quot;people tend to underestimate the chances of bad things happening&quot;.  Don&#39;t be caught having to catch a falling knife.</p>\n\n<blockquote>\n<p>be fearful when others are greedy, and greedy when others are fearful</p>\n</blockquote>\n\n<p>-Warren Buffett</p>\n\n<p>This is the <a href=\"https://static.seekingalpha.com/uploads/2018/1/23/48558512-15167626365862508_origin.png\">market bubble cycle</a> that was referenced.  It describes very generally what a bubble looks like and what factors are part of it.  A market bubble describes short term price increase and then a significant correction.  It is not saying crypto will fail or will not continue to go up in the long term.</p>\n\n<p>As the chart and past bull runs have shown, there are certain participants and driving forces of a bubble that may help you identify when you&#39;re in one.  Media attention?  Check.  Public enthusiasm of course follows.  I&#39;m sure we all have people talking to us about crypto who never have before (or only during a bubble).  One of the replies in 2017 was &quot;We are in the Awareness phase.  Grandma Betty just learned what Bitcoin was last week.&quot;  Grandma Betty is NOT the awareness phase and that is not a bullish signal.  As the saying goes &quot;<a href=\"https://www.barrypopik.com/index.php/new_york_city/entry/when_even_shoeshine_boys_are_giving_you_stock_tips_its_time_to_sell_joseph\">When even shoeshine boys are giving you stock tips, it’s time to sell</a>&quot;</p>\n\n<p>Now for the greed and delusion, I see lots of new, dumb money pouring in every time, often with celebrities leading them with market manipulation.  It happened in 2017 with ICOs led by celebs and low-cap, low unit-price coins led by McAfee.  It&#39;s happening again with elon and meme coins.  This new money is the weak hands who throw their money at trash and are easily panicked, so people try to manipulate them into holding.  Most of these people are not strong supporters who will weather a multi-year bear market.  </p>\n\n<p>You also see the same patterns in crypto.  Bitcoin leads the market in gains first, then it&#39;s dominance drops as ETH catches up and alt season begins.  Alt season includes every alt, including scams and dead projects, mooning.  The gains attract more and more new money until it runs out and momentum stops.  Once alts even plateau too much, let alone drop, weak hands panic and flee the market and things begin crashing</p>\n\n<p>Other signals leading up to the peak historically:</p>\n\n<ul>\n<li>Crypto social media engagement goes parabolic</li>\n<li>Crypto search engine activity hits new ATH</li>\n<li>Exchanges hit the top of the app store</li>\n<li>FUD ramps up (environmentalism currently, which is valid in my view)</li>\n<li>Scams increase exponentially to prey on the new investors</li>\n</ul>\n\n<p>So are we at the peak?  I don&#39;t know, but we&#39;ve got every ingredient for a correction.  It could go up another 50k before the correction or we could already be on the way down.  Be aware of your emotions, bias, and tax responsibilities.  Be careful and don&#39;t be afraid to take profits.  It&#39;s not anti-crypto to sell high and buy more when it&#39;s low</p>\n</div><!-- SC_ON -->",
  "score": 561,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/0FHbyFxI90WlGO1ZI1reQbMf9ZNHnWAtcISS5jg5ihg.png?auto=webp&s=a2127706f4df3fee803d1f2c2b7984aa921cc79e",
          "width": 720,
          "height": 482
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/0FHbyFxI90WlGO1ZI1reQbMf9ZNHnWAtcISS5jg5ihg.png?width=108&crop=smart&auto=webp&s=2815e349786c4179f2082477f9bcd7edbb6fbc64",
            "width": 108,
            "height": 72
          },
          {
            "url": "https://external-preview.redd.it/0FHbyFxI90WlGO1ZI1reQbMf9ZNHnWAtcISS5jg5ihg.png?width=216&crop=smart&auto=webp&s=b7055e4b85516285b146e3064f3945838a5900df",
            "width": 216,
            "height": 144
          },
          {
            "url": "https://external-preview.redd.it/0FHbyFxI90WlGO1ZI1reQbMf9ZNHnWAtcISS5jg5ihg.png?width=320&crop=smart&auto=webp&s=d8d84673cc62b49faca61009c43d865c4314d472",
            "width": 320,
            "height": 214
          },
          {
            "url": "https://external-preview.redd.it/0FHbyFxI90WlGO1ZI1reQbMf9ZNHnWAtcISS5jg5ihg.png?width=640&crop=smart&auto=webp&s=05ce893af0eec8d0ec30a0f2c3599a9b0c1c4a10",
            "width": 640,
            "height": 428
          }
        ],
        "variants": {},
        "id": "PDP0ay9Xmmf1IikFZRprXTXvD8F_gGfm7vAhuXK53eE"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/nd56x1/i_called_the_top_in_2017_and_got_roasted_for_it_i/",
  "subreddit": "CryptoCurrency",
  "id": "nd56x1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590798342
}