{
  "author": "The_Estranger_0001",
  "original_created_utc": 1658138916,
  "title": "In a few years, many will say all Bitcoin multi-millionaires are just lucky; but I say, it’s very tough and you earn it!",
  "created_utc": 1658227070,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Russian war, inflation, recession, regulations, haters, politicians, and reckless platforms and exchanges; adding to the fact we are still early and BTC still fluctuates a lot and thus testing you everyday: when BTC goes down, should I sell to cut lost, keep dca or buy more? When BTC goes up, should I sell to take profit, if I buy more now am I FOMO or sticking with the facts … &lt;/p&gt;\n\n&lt;p&gt;So, for all you stackers and hodlers, when you are a Bitcoin multi-millionaire, tell yourself, you worked hard for it and you worth it!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 307,
  "permalink": "/r/Bitcoin/comments/w1vn2g/in_a_few_years_many_will_say_all_bitcoin/",
  "subreddit": "Bitcoin",
  "id": "w1vn2g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Russian war, inflation, recession, regulations, haters, politicians, and\nreckless platforms and exchanges; adding to the fact we are still early and BTC\nstill fluctuates a lot and thus testing you everyday: when BTC goes down, should\nI sell to cut lost, keep dca or buy more? When BTC goes up,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ロシア戦争、インフレ、不況、規制、嫌われ者、政治家、そして\n無謀なプラットフォームや取引所など。\nBTCが下がったら、売るべきか？\nBTCが下がったとき、損失を減らすために売るべきか、DCAを維持すべきか、それとももっと買うべきか？BTCが下がったら、売って損切りするか、dcaを維持するか、それとも買い増しか？",
      "title": "数年後には、ビットコインのマルチミリオネアはみんな運がいいだけだと言う人が多いでしょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "俄罗斯战争、通货膨胀、经济衰退、法规、仇视者、政治家和\n不计后果的平台和交易所；再加上我们仍处于早期，BTC\n仍然波动很大，因此每天都在考验你：当BTC下跌的时候，我应该\n我应该卖出以减少损失，保留DCA还是买入更多？当BTC上涨时，...",
      "title": "几年后，很多人会说所有的比特币千万富翁都只是运气好而已；但我说，这非常艰难，是你自己挣来的！\"。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "俄羅斯戰爭、通貨膨脹、經濟衰退、法規、仇視者、政治家和\n不計後果的平臺和交易所；再加上我們仍處於早期，BTC\n仍然波動很大，因此每天都在考驗你：當BTC下跌的時候，我應該\n我應該賣出以減少損失，保留DCA還是買入更多？當BTC上漲時，...",
      "title": "幾年後，很多人會說所有的比特幣千萬富翁都只是運氣好而已；但我說，這非常艱難，是你自己掙來的！\"。"
    }
  ]
}