{
  "author": "smissner",
  "original_created_utc": 1632631091,
  "title": "How did middle age empires keep control of disconnected territories?",
  "created_utc": 1632649551,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>An example of what I&#39;m talking about would be something like  <a href=\"https://www.zum.de/whkmla/histatlas/germany/prussia17011740.gif\">Prussia in the early 17th century</a>, where you have multiple, somewhat large enclave states entirely disconnected from the main state with not even naval access to connect them. How would troops be moved into these areas to maintain their control and in what way were the people in those enclaves beholden to this far away government? Basically, I&#39;m asking why did these enclaved states not just split off and join the larger states that surrounded them, and why the those larger states not at least take them by force?</p>\n</div><!-- SC_ON -->",
  "score": 123,
  "permalink": "/r/AskHistorians/comments/pvmx2v/how_did_middle_age_empires_keep_control_of/",
  "subreddit": "AskHistorians",
  "id": "pvmx2v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "An example of what I'm talking about would be something like Prussia in the\nearly 17th century\n[https://www.zum.de/whkmla/histatlas/germany/prussia17011740.gif], where you\nhave multiple, somewhat large enclave states entirely disconnected from the main\nstate with not even naval access to connect…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "例を挙げると、17世紀初頭のプロイセンのようなものです。\n17世紀初頭のプロイセン\n[https://www.zum.de/whkmla/histatlas/germany/prussia17011740.gif]では\n複数の、ある程度大きな飛び地国家が、本国から完全に切り離されていて\n国から完全に切り離された複数の大規模な飛び地があり、海路でも繋ぐことができない...",
      "title": "中世の帝国は、バラバラになった領土をどのようにコントロールしていたのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我所说的一个例子是像17世纪初的普鲁士这样的国家。\n17世纪初\n[https://www.zum.de/whkmla/histatlas/germany/prussia17011740.gif]，其中你\n你有多个有点大的飞地国家，完全与主要国家脱节。\n甚至没有海军通道来连接......",
      "title": "中世纪的帝国是如何保持对不相连的领土的控制的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我所說的一個例子是像17世紀初的普魯士這樣的國家。\n17世紀初\n[https://www.zum.de/whkmla/histatlas/germany/prussia17011740.gif]，其中你\n你有多個有點大的飛地國家，完全與主要國家脫節。\n甚至沒有海軍通道來連接......",
      "title": "中世紀的帝國是如何保持對不相連的領土的控制的？"
    }
  ]
}