{
  "author": "shortyafter",
  "the_new_excerpt": "\"The future is better foretold in the streets than in the morning news\"\n\nOne thing I'm exploring lately is how people on the ground tend to have a better\nread on things than \"experts\". Obviously this is not always the case, and I\nthink when it comes to things like Covid and stuff it's best just to…",
  "original_created_utc": 1622650761,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "\"未来は朝のニュースよりもストリートで予言される\"\n\n私が最近探求していることのひとつに、「専門家」よりも「現場の人々」のほうが物事をよく読んでいる傾向があるということがあります。\n専門家」よりも現場の人間のほうが物事をよく見ている傾向があるということです。もちろん、常にそうだとは限りません。\nCovidのようなものに関しては、ただ...と思う。",
      "title": "知識の見せかけ：私の熊のテーゼ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "\"在街头预言未来比在早间新闻中预言更好\"\n\n我最近正在探索的一件事是，在当地的人往往比 \"专家 \"对事情有更好的理解。\n比 \"专家 \"更了解事情。显然，情况并非总是如此。\n我认为当涉及到像Covid之类的事情时，最好是...",
      "title": "知识的幌子：我的熊论文。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "\"在街頭預言未來比在早間新聞中預言更好\"\n\n我最近正在探索的一件事是，在當地的人往往比 \"專家 \"對事情有更好的理解。\n比 \"專家 \"更瞭解事情。顯然，情況並非總是如此。\n我認爲當涉及到像Covid之類的事情時，最好是...",
      "title": "知識的幌子：我的熊論文。"
    }
  ],
  "title": "The pretense of knowledge: my bear thesis.",
  "created_utc": 1622692493,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong><em>&quot;The future is better foretold in the streets than in the morning news&quot;</em></strong></p>\n\n<p>One thing I&#39;m exploring lately is how people on the ground tend to have a better read on things than &quot;experts&quot;.  Obviously this is not always the case, and I think when it comes to things like Covid and stuff it&#39;s best just to follow the restrictions and what not.  But immunology is deeply rooted in science, and is easily testable.</p>\n\n<p>I have a degree in economics, so I&#39;m not one to sling the profession through the mud.  But I think that some economists are attempting to bring a degree to certainty to the field that simply is not realistic.  F.A. Hayek talked about this.  Economist William White, who predicted the &#39;08 crash, also talked about this.  I&#39;m not the only one saying it.</p>\n\n<p>I recently read in a book, <em>The Shadow of the Wind,</em> by Carlos Ruis Zafón, a passage that struck me.  I will provide the original text in Spanish, for those who speak it, as his words are far more beautiful than my subpar translation:</p>\n\n<p><em>&quot;Era un buen lector de la historia y sabía que el futuro se leía en las calles, las factorías y los cuarteles con más claridad que en la prensa de la mañana&quot;</em></p>\n\n<p><em>&quot;He had a good read on the future, and he knew that the future was better foretold in the streets, in the factories, and in the troop quarters than in the morning news.&quot;</em></p>\n\n<p>&#x200B;</p>\n\n<p><strong>The &#39;08 Crisis</strong></p>\n\n<p>When the real estate bubble burst in &#39;06, and the financial system came toppling down in &#39;07-&#39;08, economists and central bankers were left scratching their head.  They would eventually say that it was impossible to see this coming, but in the <a href=\"https://www.govinfo.gov/content/pkg/GPO-FCIC/pdf/GPO-FCIC.pdf\">Federal Crisis Inquiry Commission report</a>, they debunked this, and said that there was plenty of warning.</p>\n\n<p>People on the ground at mortgage originator firms saw it coming.  Consumer advocacy groups saw it coming.  People at ratings agencies saw it coming.  But at all levels they were ignored.  There was an assumption that somehow, via technology and financial engineering, we had beaten the system and unlocked a new paradigm.</p>\n\n<p>But Michael J. Burry saw it coming.  He was a bit of an outsider, and it&#39;s no surprise to me that he would be the one to take a wider look at things and say, &quot;wait a minute&quot;.</p>\n\n<p>Peter Schiff saw it coming.  I have mixed feelings about him, as he has strong (and oftentimes incorrect, IMO) political views.  But what I like about Schiff is that he doesn&#39;t pull any punches.  He didn&#39;t buy it when Bernanke said &quot;subprime is contained&quot;.  A lot of people did.  The market did.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>2021 - Anecdotes from the ground</strong></p>\n\n<p>My mom traded in her car yesterday and she told me she was surprised that the were willing to give her $11,000 for it.  It wasn&#39;t in bad condition, but this amount was surprisingly high to both of my parents.</p>\n\n<p>She told me that a year or so ago they took the car into the shop because it was making a funny noise.  They paid a lot of money to have it checked out, but no problem or solution was found.  My mom mentioned this to the people at the dealership, and they even took it for a test drive.  No problem.  They were willing to give her the full $11,000, no more questions asked.</p>\n\n<p>To me this looks like speculative behavior.  Used car prices are going through the roof due to, not only decreased supply, but more importantly to <em>increased demand</em>, with so much free money sloshing around in the system. And since prices keep going up and up, the dealers were eager to buy her car so that they could later flip it, regardless of the state it was in.  Sound familiar?</p>\n\n<p>How about Warren Buffet saying he&#39;s seeing massive price increases all across the board?</p>\n\n<p>What about the boom in that which shall not be named in this sub? Look at the meme stocks.  Look at Archegos.  Look at Tesla.  Speculation is running rampant right now.  Last night I heard Josh Brown on CNBC say &quot;let&#39;s not overcomplicate it, it&#39;s goin&#39; north!&quot;  Ie, the trend is up right now, so it&#39;s going to keep going up.  What in the world kind of analysis is that?</p>\n\n<p>In addition, the S+P 500 hasn&#39;t had a serious downturn since 2008... remember, stocks always go up, right?  Covid doesn&#39;t count.  It barely scratched the market, and the rebound has been insane.</p>\n\n<p>I follow a channel on YouTube called Everything Money (highly recommended, this sub won&#39;t let me link it).  The main analyst, Paul, has been investing since just before the dot-com bubble.  He knows that it&#39;s NOT normal for stocks to always go up.  This guy isn&#39;t an economist.  He&#39;s not a new investor.  He&#39;s not some pundit.  He&#39;s an investor who has been battle-tested.  He&#39;s a guy on the ground.  He knows this isn&#39;t normal.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>The Stubbornness of Ineffective Paradigms</strong></p>\n\n<p>In my own job as an English-as-a-foreign-language teacher, I have seen how many teachers stubbornly cling to ineffective methods that don&#39;t work.  I had one friend today tell me that &quot;this is coming from a place of ignorance, but I don&#39;t think their method of focusing on grammar works&quot;. I told him, in this case, your ignorance is more insightful than their &quot;expert&quot; methodology.  He is correct, as my best students are those who do less grammar and have more exposure to real English.</p>\n\n<p>It is the teachers who think they have to micromanage their students&#39; learning who simply end up getting in the way.  We can&#39;t engineer the ability to speak a foreign language... all we can do is provide contact to it, and just like a baby learning their native tongue, eventually it starts happening.  Yet teachers cling to the false notion that it is through their deliberate efforts that students will learn.</p>\n\n<p>And if such an ineffective paradigm can persist so stubbornly in this environment, why not in others?  How about the war on drugs?  Can we simply force people to stop taking drugs?  Does it make any sense?  No.  But people don&#39;t like to change their views - they cling to them.  And I believe economists, the Fed, and the market are clinging to the view that we can predict the market, and as long as we make the right adjustments (via QE and fiscal policy), we will be OK.</p>\n\n<p>F.A. Hayek would call this &quot;the pretense of knowledge&quot;.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Conclusion</strong></p>\n\n<p>I don&#39;t know what&#39;s going to happen, and hey, I could be wrong.  Maybe stocks will always go up and we&#39;ll just avoid any major crises from here on out.  It could happen.</p>\n\n<p>The issue is that the bulls and the central bankers never even seem to posit the idea that &quot;hey, I could be wrong&quot;.  To them it&#39;s science.  Physics.  Math.  That&#39;s the economy; that&#39;s the market.</p>\n\n<p>But the market is not science.  We can do our best to try and understand it, but IMO, part of having a true understanding of it is realizing that we will never be able to figure it out entirely, and then planning our policies in such a way that takes into account our limitations.</p>\n\n<p>I&#39;m predicting that this situation is not sustainable, and I&#39;m predicting that we are going to see some sort of crisis in some ways comparable to 2008.  I believe that ultra-easy monetary policy and the resulting extraordinary levels of public and private debt are going to end up causing some sort of crisis.  I also believe that inflation will be a problem, and perhaps a serious one.</p>\n\n<p>I&#39;m not shorting anything because I recognize that I could be wrong.  I&#39;m still learning and developing my theory every day.  But I am playing things very, very conservatively.</p>\n\n<p>I am going to take the step to post this, because by taking a position I will either learn through being correct, or learn by being proven wrong.   The worst thing anyone can do is take no position at all and neither succeed nor fail at anything, and thus guarantee that they never learn or advance in any way whatsoever.</p>\n\n<p>Good luck to everyone.</p>\n</div><!-- SC_ON -->",
  "score": 62,
  "permalink": "/r/stocks/comments/nqplrb/the_pretense_of_knowledge_my_bear_thesis/",
  "subreddit": "stocks",
  "id": "nqplrb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804301793
}