{
  "author": "alpha_investor",
  "the_new_excerpt": "Alibaba is trading way below fair price. They are the only e-commerce giant in\nChina that actually makes a reliable profit, and even if growth slows down with\nthe Chinese government giving the industry more scrutiny, a decent discounted\ncash flow calculation still makes Alibaba easily worth at least…",
  "original_created_utc": 1621605054,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アリババは適正価格よりはるかに低い価格で取引されています。アリババは中国で唯一、確実に利益を上げているEコマース企業です。\n中国で唯一確実に利益を上げている電子商取引の大手企業であり、中国政府が産業界に与えた規制によって成長が鈍化したとしても\n中国政府が業界をより厳しくチェックするようになって成長が鈍化したとしても、適切な割引キャッシュフロー計算をすれば、Alibabaには少なくとも価値がある。\nまともな割引キャッシュフロー計算をすれば、アリババには少なくとも...の価値があると言えるでしょう。",
      "title": "アリババ（BABA"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "阿里巴巴的交易价格远远低于公平价格。他们是中国唯一的电子商务巨头\n他们是中国唯一一个真正能赚取可靠利润的电子商务巨头，即使增长速度放缓，但由于中国政府对该行业进行了更严格的审查。\n中国政府对该行业进行了更多的审查，一个体面的折现\n现金流的计算仍然使阿里巴巴很容易就值至少...",
      "title": "阿里巴巴 (BABA)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "阿里巴巴的交易價格遠遠低於公平價格。他們是中國唯一的電子商務巨頭\n他們是中國唯一一個真正能賺取可靠利潤的電子商務巨頭，即使增長速度放緩，但由於中國政府對該行業進行了更嚴格的審查。\n中國政府對該行業進行了更多的審查，一個體面的折現\n現金流的計算仍然使阿里巴巴很容易就值至少...",
      "title": "阿里巴巴 (BABA)"
    }
  ],
  "title": "Alibaba (BABA)",
  "created_utc": 1621679344,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Alibaba is trading way below fair price. They are the only e-commerce giant in China that actually makes a reliable profit, and even if growth slows down with the Chinese government giving the industry more scrutiny, a decent discounted cash flow calculation still makes Alibaba easily worth at least $300/share (nearly 50% upside from the current price). With a price-to-book of only 4.03, p/e of only 24.98, high returns on capital, and a discounted cash flow analysis that points to a $300+ valuation, BABA stock is a steal right now.</p>\n</div><!-- SC_ON -->",
  "score": 47,
  "permalink": "/r/stocks/comments/nht0ky/alibaba_baba/",
  "subreddit": "stocks",
  "id": "nht0ky",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197388322
}