{
  "author": "SuperNirvana64",
  "original_created_utc": 1636901093,
  "title": "Was there ever a point in history that a colonial empire “lost” a colony? As in forgot they had it, or where it was located, or bailed without telling the settlers?",
  "created_utc": 1636929438,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I guess I’m just curious, one of my friends was talking about pirates and I was thinking “woah what if you were a colonist or something similar back when maps weren’t as good and communication took much longer and your empire/sponsor/lifeline just lost some paperwork or the people who knew where you were just up and died and people just forgot you were there? That would kinda suck, maybe they should become pirates and steal to survive” and now I want to know if something like that ever actually happened.</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/qtr8ex/was_there_ever_a_point_in_history_that_a_colonial/",
  "subreddit": "AskHistorians",
  "id": "qtr8ex",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I guess I’m just curious, one of my friends was talking about pirates and I was\nthinking “woah what if you were a colonist or something similar back when maps\nweren’t as good and communication took much longer and your\nempire/sponsor/lifeline just lost some paperwork or the people who knew where\nyou…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "友人が海賊の話をしていたので、「もしも海賊がいたらどうしよう」と思ったのがきっかけです。\n地図が整備されておらず、通信にも時間がかかっていた時代に入植者などになったとしたらどうだろう」と考えました。\n帝国/スポンサー/ライフラインが、地図が整備されておらず、通信にも時間がかかり\n帝国やスポンサー、ライフラインが書類を紛失したり、自分の居場所を知っている人がいなくなったりしたら......。\nあなた...",
      "title": "歴史上、植民地帝国が植民地を「失った」ということがあったでしょうか。植民地を持っていたことやその場所を忘れてしまったとか、入植者に伝えずに手を引いてしまったとか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想我只是好奇，我的一个朋友在谈论海盗，我在想\n我在想：\"如果你是一个殖民者或类似的人，在地图还没有那么好的时候，沟通需要更长的时间，而你是一个殖民者，那会怎么样？\n如果你是一个殖民者或类似的人，当地图还没有那么好，沟通需要更长的时间，而你的\n你的帝国/赞助者/生命线只是失去了一些文书工作或知道你在哪里的人。\n你......\"。",
      "title": "历史上是否曾有过一个殖民帝国 \"失去 \"一个殖民地的情况？就像忘记了他们拥有它，或者它的位置，或者没有告诉定居者就离开了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想我只是好奇，我的一個朋友在談論海盜，我在想\n我在想：\"如果你是一個殖民者或類似的人，在地圖還沒有那麼好的時候，溝通需要更長的時間，而你是一個殖民者，那會怎麼樣？\n如果你是一個殖民者或類似的人，當地圖還沒有那麼好，溝通需要更長的時間，而你的\n你的帝國/贊助者/生命線只是失去了一些文書工作或知道你在哪裏的人。\n你......\"。",
      "title": "歷史上是否曾有過一個殖民帝國 \"失去 \"一個殖民地的情況？就像忘記了他們擁有它，或者它的位置，或者沒有告訴定居者就離開了？"
    }
  ]
}