{
  "author": "Dan8357",
  "the_new_excerpt": "Full disclosure, I already entered my position last Friday mornings dip after\nresearching charts for my next swing trading move the night before.\n\nI noticed BP's 3 month chart was at its previously tested resistance levels, and\ndug a little deeper noticing rocketing crude oil prices and found that…",
  "original_created_utc": 1612745352,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "充分说明，我上周五上午跌停后已经进仓了。\n研究图表，为我的下一个波段交易行动在前一天晚上。\n\n我注意到BP的3个月图表处于之前测试过的阻力位，并且。\n深挖一下注意到原油价格的火箭式上涨，发现... ...",
      "title": "原油价格处于疫情前以来的最高水平，在我看来，BP是最超卖、最被低估的玩法。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "充分說明，我上週五上午跌停後已經進倉了。\n研究圖表，爲我的下一個波段交易行動在前一天晚上。\n\n我注意到BP的3個月圖表處於之前測試過的阻力位，並且。\n深挖一下注意到原油價格的火箭式上漲，發現... ...",
      "title": "原油價格處於疫情前以來的最高水平，在我看來，BP是最超賣、最被低估的玩法。"
    }
  ],
  "title": "Crude oil prices at highest level since pre-pandemic, BP in my opinion is the most oversold and undervalued play.",
  "created_utc": 1612763005,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Full disclosure, I already entered my position last Friday mornings dip after researching charts for my next swing trading move the night before.</p>\n\n<p>I noticed BP&#39;s 3 month chart was at its previously tested resistance levels, and dug a little deeper noticing rocketing crude oil prices and found that bp just reported their first loss in earnings in a decade.</p>\n\n<p>Hardly surprising.</p>\n\n<p>I looked at Royal Dutch Shell and Exxon too and out of the 3 companies BP looked to me to be the most undervalued and thats why I&#39;m in. Wouldn&#39;t be at all surprised to see this one up 10% by the end of the week and &gt;50% by the beginning of summer. BP have a large dividend coming mid-feb too.</p>\n\n<p>Exxon and Shell rallied last Friday while BP lost a further 1%. BP is out of favour with Oil company investors for their green energy commitments which in my opinion just makes them even more of a bargain right now for the short to mid-term trader. Demand for oil will soon be back and I can&#39;t see crude oil prices slowing down just yet.</p>\n\n<p>Would be interested to hear anyones thoughts.</p>\n</div><!-- SC_ON -->",
  "score": 77,
  "permalink": "/r/investing/comments/lf02ot/crude_oil_prices_at_highest_level_since/",
  "subreddit": "investing",
  "id": "lf02ot",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123199867
}