{
  "author": "Patient_Gas9560",
  "original_created_utc": 1626349214,
  "title": "Why the fuck does George Floyd have murals dedicated to him as well as statues?",
  "created_utc": 1626368839,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I always hear stuff like &quot;We don&#39;t worship Floyd&quot;, &quot;We aren&#39;t saying Floyd is a saint&quot;.</p>\n\n<p>Well why on earth does he have things such as murals and statues which are things you often dedicate to heroes? What has he actually done that was good? He was an awful person in reality, how can the people who say things like &quot;columbus shouldn&#39;t have a statue because he was an awful person&quot; then say &quot;Floyd should have a statue, we should ignore his personal life and highlight what he did&quot; all in the same breath.</p>\n\n<p>I&#39;m lost here, someone make me understand.</p>\n</div><!-- SC_ON -->",
  "score": 189,
  "permalink": "/r/TooAfraidToAsk/comments/okr34w/why_the_fuck_does_george_floyd_have_murals/",
  "subreddit": "TooAfraidToAsk",
  "id": "okr34w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I always hear stuff like \"We don't worship Floyd\", \"We aren't saying Floyd is a\nsaint\".\n\nWell why on earth does he have things such as murals and statues which are\nthings you often dedicate to heroes? What has he actually done that was good? He\nwas an awful person in reality, how can the people who…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私たちはフロイドを崇拝しているわけではありません」「フロイドが聖人だと言っているわけではありません」などの言葉をいつも耳にします。\n聖人だと言っているわけではありません」。\n\nでは、なぜ彼は壁画や銅像など、英雄に捧げるものを持っているのでしょうか？\nなぜ彼は壁画や像のようなヒーローに捧げるものを持っているのでしょうか？彼が実際に行った善行とは？彼は\n実際のところ、彼はひどい人間だったのです。",
      "title": "なぜジョージ・フロイドには銅像だけでなく壁画もあるのだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我总是听到诸如 \"我们不崇拜弗洛伊德\"、\"我们并不是说弗洛伊德是一个\n圣人\"。\n\n那么，究竟为什么他有壁画和雕像这样的东西呢？\n献给英雄的东西？他到底做了什么好事？他\n他在现实中是一个可怕的人，那些人怎么能...",
      "title": "为什么乔治-弗洛伊德会有专门为他创作的壁画以及雕像？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我總是聽到諸如 \"我們不崇拜弗洛伊德\"、\"我們並不是說弗洛伊德是一個\n聖人\"。\n\n那麼，究竟爲什麼他有壁畫和雕像這樣的東西呢？\n獻給英雄的東西？他到底做了什麼好事？他\n他在現實中是一個可怕的人，那些人怎麼能...",
      "title": "爲什麼喬治-弗洛伊德會有專門爲他創作的壁畫以及雕像？"
    }
  ]
}