{
  "author": "bearsgotoalaskanstfu",
  "the_new_excerpt": "The streaming industry is getting a lot of exposure lately with all the news\nfrom Disney+ and HBO max. Looking for a pure play in the streaming service I\ncame across CuriosityStream. Basically the platform offers documentaries about\nscience, history, politics, etc... and they have over 3000+ titles…",
  "original_created_utc": 1609257283,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "流媒体行业最近通过所有的新闻获得了大量的曝光率\n来自迪士尼+和HBO MAX。在流媒体服务中寻找纯粹的机会\n偶然发现了好奇心溪流。基本上，该平台提供关于以下内容的纪录片\n科学、历史、政治等。他们有3,000多种图书…",
      "title": "已经有1300万付费订户的CuriosityStream(流媒体平台)价值5.5亿美元，是不是被严重低估了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "流媒體行業最近通過所有的新聞獲得了大量的曝光率\n來自迪士尼+和HBO MAX。在流媒體服務中尋找純粹的機會\n偶然發現了好奇心溪流。基本上，該平臺提供關於以下內容的紀錄片\n科學、歷史、政治等。他們有3,000多種圖書…",
      "title": "已經有1300萬付費訂戶的CuriosityStream(流媒體平臺)價值5.5億美元，是不是被嚴重低估了？"
    }
  ],
  "title": "Is CuriosityStream (streaming platform) grossly undervalued at $550M with already 13M paying subscribers?",
  "created_utc": 1609271310,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The streaming industry is getting a lot of exposure lately with all the news from Disney+ and HBO max. Looking for a pure play in the streaming service I came across CuriosityStream. Basically the platform offers documentaries about science, history, politics, etc...  and they have over 3000+ titles in the platform. The founder is John Hendricks, founder and former chairman of Discovery.</p>\n\n<p>After digging a little bit I was surprised to see that despite having 13M subscribers total revenue for Q3 was only $8.9M, giving an ARPU of only $0.15 which seems ridiculous for the amount of value you are getting. It seems like a good amount of the subscriber base comes from bundled packages at a heavy discount. They are looking for exposure while growing at all costs. Here are some key point:</p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>The company has no debt and $180M cash in the balance sheet.</li>\n<li><strong>The company went from 2M bundled subscriptions  in Q1 2019 to 13M in Q3 2020</strong></li>\n<li>Over 60% gross margin</li>\n<li>They project 10x growth by 2025 with $400M in revenues</li>\n</ul>\n\n<p>Giving the uncertainty of the current market environment it seems pretty safe to buy something that sells $1 a month subscriptions and is disrupting an industry, targeting a more sophisticated  costumers instead of the average becky who likes stranger things. The last time John Hendricks created something (Discovery) he turned a $5M investment into a $32B company before stepping down and creating CuriosityStream.</p>\n\n<p>I would like to hear your thoughts on the comment section and discuss if in fact CuriosityStream is already fairly valued, undervalued or maybe overvalued.</p>\n\n<p>&#x200B;</p>\n\n<p><strong><em>Side note:</em></strong> John Hendricks has been buying shares this month increasing his position by 21%.</p>\n</div><!-- SC_ON -->",
  "score": 395,
  "permalink": "/r/investing/comments/kmgwmt/is_curiositystream_streaming_platform_grossly/",
  "subreddit": "investing",
  "id": "kmgwmt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609495334773
}