{
  "author": "frstrtd_ndrd_dvlpr",
  "original_created_utc": 1640598447,
  "title": "How to NOT get scammed out of you hard-earned investment in 2022",
  "created_utc": 1640630889,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s been a lot of reported scamming/&lt;del&gt;hacking&lt;/del&gt; &lt;del&gt;this year&lt;/del&gt;.~~ I refuse to use the term hacking here, since I feel like it is being used wrongly a lot in this sub and in the crypto scene in general. It&amp;#39;s giving a bad rep for actual hackers.&lt;/p&gt;\n\n&lt;p&gt;This year billions if not millions worth of crypto went to these bad people&amp;#39;s wallets, and mostly this is 90% the fault of the users themselves. It&amp;#39;s not like every hacker out there writes codes in an undetectable assembly language level scripts that bypasses antimalware/antivirus detectors or some 300 IQ shit. &lt;em&gt;&lt;del&gt;Hackers&lt;/del&gt;&lt;/em&gt; Scammers these days rely more on social engineering and phishing attacks, requiring the user&amp;#39;s participation.&lt;/p&gt;\n\n&lt;p&gt;We are experiencing a mass adoption of crypto, we should expect naive young bloods in the scene and with that more scammers out there. Experience is the best teacher, but we can educate ourselves as much as possible to mitigate inevitable losses along the way.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;ALWAYS double, triple check the current URL of the website you are using whenever you are having crypto transactions.&lt;/strong&gt; Check the domain first and foremost, then the following parts of the URL - the spelling, the subdirectories. You have to make sure you are using the right site. Also, USE BOOKMARKS IN WEBSITES YOU FREQUENT!&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Check if the connection is secure&lt;/strong&gt;. Check if there&amp;#39;s lock icon on the left side of the address bar in most browsers click it and should say &amp;quot;Connection Secure&amp;quot;, and yes I&amp;#39;m aware that not all websites uses https BUT nowadays almost all of services now uses https. This doesn&amp;#39;t mean that if the website uses https it equates to it being safe already. You can also check the SSL certificate of a website by using some online tools around, it&amp;#39;s one google search away.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Don&amp;#39;t use public wifi to access websites requiring entry of your credentials&lt;/strong&gt;. You never know, you might get redirected to a malicious site imitating the website you&amp;#39;re trying to access.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Don&amp;#39;t give your passphrase to anyone or to any website that is asking for it&lt;/strong&gt;. Never ever put it in a website or anything connected to the internet for saving purposes or whatever. Put it somewhere safe offline. This is your lifeline to your wallet, imagine giving someone a direct access to your lifeline.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Beware of fake mobile apps&lt;/strong&gt;. Logo looks off? Misspellings? Other obvious errors? Don&amp;#39;t leisurely install apps from external sources, do a bit of a research about the company or about the app you are trying to use/install. Also, even if it&amp;#39;s in the app store or app store doesn&amp;#39;t mean it&amp;#39;s legit. Google and Apple have been known to be pretty lax at what goes in their app stores at times, of course official entities (binance, coinbase, etc.) can quickly find fake apps and get them remove from the app store, but still better to be cautious.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Don&amp;#39;t click on suspicious emails/messages&lt;/strong&gt;. Check the email domain, it&amp;#39;s quite easy to spot phishing emails. If it asks for sensitive information then it&amp;#39;s a red flag, even support agents from companies don&amp;#39;t ask for sensitive information.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Don&amp;#39;t touch coins that you know nothing about&lt;/strong&gt;. Sometimes you may see some coins in your wallet out of nowhere, looking at thousands or millions worth of coins in your wallet is tempting, but do not ever touch it. It maybe a dusting attack or worse you&amp;#39;ll be giving wallet access to the hacker.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;If you&amp;#39;re following influences, youtubers, news site etc. be sure to check if they are the real thing&lt;/strong&gt;. Just like phishing attacks there can be fake accounts imitating famous personalities that may give some advice or send out links promising this and that.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Never trust anyone online&lt;/strong&gt;. I don&amp;#39;t think this is being extreme at this point. If you get a personal message out of nowhere then be cautious. Most social engineering starts here, the first contact. If he/she is offering to help you and give some links or software, that should really your awareness more. It&amp;#39;s fine talking to people but always assume that he/she is after something.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Keep your mouth shut, limit your exposure&lt;/strong&gt;. Even simply your name, address, birthday etc. can be used to get a hold of your accounts or YOU yourself. These can be used to reset a password or change an email or even sim swapping. You can also be attacked physically, knife in your gut or your passphrase? Don&amp;#39;t be stupid and avoid discussing so much on a public forum.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Beware of softwares you install/trying to install&lt;/strong&gt;. It may have some malwares coupled with it or a mining script in some cases.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Multifactor authentication&lt;/strong&gt;. Use an offline authenticator, don&amp;#39;t use an SMS one since it is prone to swim swapping. I personally use Authy, some use google authenticator, it&amp;#39;s up to you. Look for something that will satisfy you.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Distribute your holdings to multiple exchanges/wallets&lt;/strong&gt;. Don&amp;#39;t put all your eggs in one basket. This is more of a mitigation.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Setup a kill switch&lt;/strong&gt;. Had your mobile phone/laptop stolen? Wipe the data off of it right away. There are softwares/apps now that do this with a single click even if you&amp;#39;re on other side of the globe.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Everything here boils down to basically &amp;quot;keep your mouth shut&amp;quot; and &amp;quot;If it&amp;#39;s good to be true, then it &lt;del&gt;probably&lt;/del&gt; is&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 170,
  "permalink": "/r/CryptoCurrency/comments/rpjzg4/how_to_not_get_scammed_out_of_you_hardearned/",
  "subreddit": "CryptoCurrency",
  "id": "rpjzg4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "There's been a lot of reported scamming/hacking this year.~~ I refuse to use the\nterm hacking here, since I feel like it is being used wrongly a lot in this sub\nand in the crypto scene in general. It's giving a bad rep for actual hackers.\n\nThis year billions if not millions worth of crypto went to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今年は詐欺・ハッキングが多く報告されていますね～～～～～～～～～～～～～～～～～～～～～～～～～～～～～～～～～～～～～～～～～～～～。\nハッキングという言葉は、このサブタイトルでは間違って使われているような気がします。\nと暗号のシーン全般において。実際のハッカーに悪い評判を与えています。\n\n今年は数十億ドルもの暗号が...",
      "title": "2022年、せっかく稼いだ投資金を詐欺に遭わないために"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今年有很多关于诈骗/黑客的报道~~我拒绝使用黑客一词。\n我拒绝在这里使用黑客这个词，因为我觉得它在这个子里被错误地使用了很多。\n和一般的加密货币场景中被错误地使用。这给真正的黑客带来了不好的印象。\n\n今年，价值几十亿甚至几百万的加密货币都被转移到其他地方。",
      "title": "如何在2022年不被骗走你辛苦挣来的投资？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今年有很多關於詐騙/黑客的報道~~我拒絕使用黑客一詞。\n我拒絕在這裏使用黑客這個詞，因爲我覺得它在這個子裏被錯誤地使用了很多。\n和一般的加密貨幣場景中被錯誤地使用。這給真正的黑客帶來了不好的印象。\n\n今年，價值幾十億甚至幾百萬的加密貨幣都被轉移到其他地方。",
      "title": "如何在2022年不被騙走你辛苦掙來的投資？"
    }
  ]
}