{
  "author": "jed_dowling",
  "original_created_utc": 1627897702,
  "title": "Reminder - we need to be nice to the newcomers",
  "created_utc": 1627907531,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I see a lot of newcomers to this sub, which is an amazing thing for them and broader adoption of crypto. However, because of their lack of experience, they sometimes ask questions or make statements which are... interesting. When I think back though, I once asked and said stupid shit like this too. It is all a part of the learning process. While some of the responses by more experienced members can be very, very funny, they ultimately don&#39;t help these newcomers learn and, in turn, become more knowledgable about crypto (the very purpose of this sub). </p>\n\n<p>Sure, inexperienced holders can be very excited seeing green in their portfolios, but they naturally get scared when the market plummets. Getting salty when they ask questions about the bear market doesn&#39;t help anyone. We are on the rollercoaster of crypto as a team. Let&#39;s stick together</p>\n</div><!-- SC_ON -->",
  "score": 155,
  "permalink": "/r/CryptoCurrency/comments/owbaks/reminder_we_need_to_be_nice_to_the_newcomers/",
  "subreddit": "CryptoCurrency",
  "id": "owbaks",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I see a lot of newcomers to this sub, which is an amazing thing for them and\nbroader adoption of crypto. However, because of their lack of experience, they\nsometimes ask questions or make statements which are... interesting. When I\nthink back though, I once asked and said stupid shit like this too.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブシステムには多くの新規参入者がいますが、彼らにとっては素晴らしいことです。\n暗号の普及に貢献しています。しかし、彼らは経験がないため、時々質問や発言が...\n興味深い質問や発言をすることがあります。思い返してみると\n思い返せば、私もこんなバカげた質問や発言をしたことがあります....",
      "title": "リマインダー - 新入社員には親切にしなければならない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我看到有很多新人加入这个子，这对他们来说是件了不起的事情，也是加密货币更广泛的采用。\n更广泛地采用加密货币。然而，由于他们缺乏经验，他们\n有时会问一些问题或发表一些......有趣的言论。当我\n回想起来，我曾经问过也说过这样的蠢话，....",
      "title": "提醒--我们需要对新来的人好一点"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到有很多新人加入這個子，這對他們來說是件了不起的事情，也是加密貨幣更廣泛的採用。\n更廣泛地採用加密貨幣。然而，由於他們缺乏經驗，他們\n有時會問一些問題或發表一些......有趣的言論。當我\n回想起來，我曾經問過也說過這樣的蠢話，....",
      "title": "提醒--我們需要對新來的人好一點"
    }
  ]
}