{
  "author": "ValueMaverick",
  "the_new_excerpt": "Disclosure I own shares at $10.50.\n\nBarkBox is a spac that today approved the merger. The Ticker $stic will be $bark\non June 2nd.\n\nMany of these subscription box companies get a bad reputation because there were\nso many grocery ones that lose billions for years and the pet ones made no money\nbecause…",
  "original_created_utc": 1622228290,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ディスクロージャー 私は10.50ドルで株式を所有しています。\n\nBarkBoxは、今日、合併を承認したスパックです。ティッカーの$sticは$barkになります。\nになります。\n\nこれらのサブスクリプションボックス企業の多くは悪い評判を受けています。\nこのようなサブスクリプションボックス企業の多くが悪い評判を受けています。\nなぜなら...",
      "title": "なぜ私が$STIC soon to be $BARK aka BarkBoxを好きなのか リスクの範囲は$7から$30です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "披露我拥有10.5美元的股票。\n\nBarkBox是一个spac，今天批准了合并。股票代码$stic将变成$bark\n6月2日。\n\n许多这样的订阅盒公司得到了不好的声誉，因为有\n许多杂货公司多年来亏损数十亿，而宠物公司没有赚到钱\n因为...",
      "title": "为什么我喜欢$STIC即将成为$BARK aka BarkBox 风险范围是7美元到30美元。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "披露我擁有10.5美元的股票。\n\nBarkBox是一個spac，今天批准了合併。股票代碼$stic將變成$bark\n6月2日。\n\n許多這樣的訂閱盒公司得到了不好的聲譽，因爲有\n許多雜貨公司多年來虧損數十億，而寵物公司沒有賺到錢\n因爲...",
      "title": "爲什麼我喜歡$STIC即將成爲$BARK aka BarkBox 風險範圍是7美元到30美元。"
    }
  ],
  "title": "Why I like $STIC soon to be $BARK aka BarkBox Risk range is $7 to $30.",
  "created_utc": 1622266730,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Disclosure I own shares at $10.50. </p>\n\n<p>BarkBox is a spac that today approved the merger. The Ticker $stic will be $bark on June 2nd.</p>\n\n<p>Many of these subscription box companies get a bad reputation because there were so many grocery ones that lose billions for years and the pet ones made no money because all they did was get existing products and package them where the margins were horrible. </p>\n\n<p>Nevertheless, barkbox is different. They own all of the products they put in the box, we call that vertically integrated. Have a retail store and sell the products at target and other online and offline stores. So, given the higher Margins, vertical integration, new revenue channels and fast growth I think the valuation should be more expensive than chewy on a price to sales multiple. Lets not discount that the subscription model will evolve over time churn is around 5% to 6% which is excellent. </p>\n\n<p>The company actually has a few revenue channels: </p>\n\n<p>buy subscription (you can customize as well), </p>\n\n<p>add on products to the box, </p>\n\n<p>dental (medical and preventative is new and will grow), </p>\n\n<p>meal plan (sends you monthly box of daily meals; crazy but people/dogs can be picky about food), </p>\n\n<p>ecommerce/retail where they sell the products on amazon, pet stores etc. this is an interesting business because it is not just ecommerce or subscription because they own a lot of the products they sell as their brand where they have exclusive supplychain and distribution agreements. They also have licensing with plush toys with NBA (example). They realized customers are crazy and treat dogs like people so do stuff accordingly. </p>\n\n<p>No doubt they will sell clothes, costumers, more medical stuff like fleak tick products to help keep the customes within the ecosystem. </p>\n\n<p>The ceo is actually new started in september 2020 and has options priced at $16 a share. He came from amazon and ebay and before that consultant at infosys. I think the management hire was an excellent decision as it allows then to scale their ecommerce business and get new customers into the ecosystem via subscriptions or not. I see the subscription revenue as potentially amazon prime stuff where people will just fill it up with what they need and not just junk all the time and people will be happy with that and some add-ons here and there. </p>\n\n<p>The pet business is a fantastic long-term business as boomers age, etc. strategy for this is to buy and either hold or sell when it hits $20 to $30 if there becomes too much hype. This range of valuation is based in Price to Sales. The bottom I used was 2 times given Its growth rate and almost double the gross margin of chewy and even pet supermarket stores. The guidance for this year has room for upside </p>\n\n<p>I built a ten year model and see then becoming profitable by 2023, however, all of their cash flow is going into growing the business as I think they can sustain a 30% revenue per year for a few years. I do think there are some potential risks such that the Barkeats business could do poorly if the pricing is not competitive or people change the product mix of the box to less profitable products or cancel all together. </p>\n\n<p>Interested in hearing your thoughts on this below.</p>\n</div><!-- SC_ON -->",
  "score": 83,
  "permalink": "/r/investing/comments/nn4wvf/why_i_like_stic_soon_to_be_bark_aka_barkbox_risk/",
  "subreddit": "investing",
  "id": "nn4wvf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804299117
}