{
  "author": "jumbeldor",
  "original_created_utc": 1640717624,
  "title": "As my New Year's resolution I am going to be sifting through all the new cryptocurrencies, so that you don't have to.",
  "created_utc": 1640766786,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Coinmarketcap and coingecko list new cryptocurrencies every day. For the past year I have been checking those listings almost everyday. Majority of them are low-effort, poorly created, and pathetically named copy-paste coins. After a year of practice, I have become fairly good at sifting through the scam-shit-coins. &lt;/p&gt;\n\n&lt;p&gt;Now before you&amp;#39;ll jump the gun, I&amp;#39;d like to explain &lt;strong&gt;why&lt;/strong&gt; I do this.\n1. I&amp;#39;m broke, with responsibilities. I don&amp;#39;t have more than $100 to invest. I&amp;#39;m in college and won&amp;#39;t start a proper job until next year.\n2. I want to get a &lt;strong&gt;good, low to midcap project&lt;/strong&gt; in it&amp;#39;s early phase so that I have a chance at high growth.\n3. I will definitely start DCAing and HODLing the top coins like btc, eth, algo etc. once I start with my job and earn regular, fixed income. &lt;/p&gt;\n\n&lt;p&gt;Coming back to the title, I have not come across many open discussions on new projects in this sub. So I have decided that I&amp;#39;ll be posting my finds on this sub daily/weekly. It includes research on &lt;em&gt;every&lt;/em&gt; new coin cmc enlists.&lt;/p&gt;\n\n&lt;p&gt;I will be posting the &lt;strong&gt;red flags&lt;/strong&gt; of coins as well.&lt;/p&gt;\n\n&lt;p&gt;This might help the new people not to fall into traps of scam/shit coins. &lt;/p&gt;\n\n&lt;p&gt;I will also be posting my research on possible &lt;strong&gt;good projects&lt;/strong&gt;.&lt;/p&gt;\n\n&lt;p&gt;This way, I can get the input of all the experienced people on this sub and hopefully, together we can find some really cool gems.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 162,
  "permalink": "/r/CryptoCurrency/comments/rqmsfx/as_my_new_years_resolution_i_am_going_to_be/",
  "subreddit": "CryptoCurrency",
  "id": "rqmsfx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Coinmarketcap and coingecko list new cryptocurrencies every day. For the past\nyear I have been checking those listings almost everyday. Majority of them are\nlow-effort, poorly created, and pathetically named copy-paste coins. After a\nyear of practice, I have become fairly good at sifting through…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Coinmarketcapとcoingeckoは、毎日新しい暗号通貨をリストアップしています。過去に\nこの1年間、私はほぼ毎日、これらのリストをチェックしてきました。その大半は\n低労力で、お粗末な、そして哀れな名前のコピーペーストコイン。1年後\n1年間練習して、選別するのがかなり上手になりました。",
      "title": "新年の抱負として、私は新しい暗号通貨をすべて選別するつもりです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Coinmarketcap和coingecko每天都会列出新的加密货币。在过去的\n一年来，我几乎每天都在查看这些列表。他们中的大多数是\n努力程度低，创造能力差，而且名字可悲的复制粘贴币。经过一年的\n经过一年的实践，我已经相当擅长筛选...",
      "title": "作为我的新年决议，我将在所有新的加密货币中进行筛选，这样你就不必去做。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Coinmarketcap和coingecko每天都會列出新的加密貨幣。在過去的\n一年來，我幾乎每天都在查看這些列表。他們中的大多數是\n努力程度低，創造能力差，而且名字可悲的複製粘貼幣。經過一年的\n經過一年的實踐，我已經相當擅長篩選...",
      "title": "作爲我的新年決議，我將在所有新的加密貨幣中進行篩選，這樣你就不必去做。"
    }
  ]
}