{
  "author": "gimme_that_tea",
  "original_created_utc": 1632215808,
  "title": "If the vagina doesn't stretch or change as a result of sex, why does my doctor need to know if I am a virgin in order to know which size of speculum to use during a smear test?",
  "created_utc": 1632246259,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I am a virgin, and when it has come to arranging a smear test I have been asked if I am a virgin, so that they can adapt their approach and use a smaller speculum. This confused me, as it was my understanding that the vagina merely stretches and then goes back to its original size, so there wouldn&#39;t be any physical difference between me and a non-virgin, other than maybe a torn hymen (though that is not always a given as the hymen can take many shapes, and can stretch during sex too).</p>\n\n<p>What is the physical difference being accounted for when I am being asked this question?</p>\n\n<p>(I have also since learned that I don&#39;t need to take smear tests at all due to the fact that I haven&#39;t been sexually active, so it&#39;s not really an issue for me anymore).</p>\n</div><!-- SC_ON -->",
  "score": 120,
  "permalink": "/r/TooAfraidToAsk/comments/psf61p/if_the_vagina_doesnt_stretch_or_change_as_a/",
  "subreddit": "TooAfraidToAsk",
  "id": "psf61p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So I am a virgin, and when it has come to arranging a smear test I have been\nasked if I am a virgin, so that they can adapt their approach and use a smaller\nspeculum. This confused me, as it was my understanding that the vagina merely\nstretches and then goes back to its original size, so there…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は処女ですが、検診の際には「処女ですか」と聞かれます。\n処女であるかどうかを聞かれますが、その場合は、より小さな検鏡を使用して\nと聞かれます。膣は単に伸びて元に戻ると理解していたので、これには戸惑いました。\n私の理解では、膣は単に伸びて元の大きさに戻るだけだと思っていたので、これには戸惑いました...",
      "title": "膣がセックスによって伸びたり変化したりしないのであれば、なぜ医師は、中傷検査の際に使用する鏡のサイズを知るために、私が処女であるかどうかを知る必要があるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我是一个处女，当安排涂片检查时，我被问到我是否是处女，以便他们能够调整他们的方法，使用较小的尺寸。\n他们问我是否是处女，这样他们就可以调整他们的方法，使用较小的\n窥器。这让我很困惑，因为我的理解是阴道只是\n我的理解是，阴道只是拉伸，然后又恢复到原来的大小，所以......",
      "title": "如果阴道不因性生活而伸展或改变，为什么我的医生需要知道我是否是处女，以便知道在涂片检查中使用哪种尺寸的窥器？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我是一個處女，當安排塗片檢查時，我被問到我是否是處女，以便他們能夠調整他們的方法，使用較小的尺寸。\n他們問我是否是處女，這樣他們就可以調整他們的方法，使用較小的\n窺器。這讓我很困惑，因爲我的理解是陰道只是\n我的理解是，陰道只是拉伸，然後又恢復到原來的大小，所以......",
      "title": "如果陰道不因性生活而伸展或改變，爲什麼我的醫生需要知道我是否是處女，以便知道在塗片檢查中使用哪種尺寸的窺器？"
    }
  ]
}