{
  "author": "L_Cranston_Shadow",
  "original_created_utc": 1632936346,
  "title": "Require minimum post and comment body length of 50 characters to qualify for moons",
  "created_utc": 1633016663,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Summary</strong> </p>\n\n<p>My proposal is that text posts and comments must have a body length of at least 50 characters to qualify to earn moons.</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Why this is needed</strong></p>\n\n<p>As has been brought up in multiple recent discussions, there has been analysis done of moon payouts that shows the prevalence of short low effort comments being disproportionately over-represented in Moon payouts. They also have a strong link to abusive moon farming, and a huge imbalance in moon payouts to a small number of accounts hitting the cap by posting these comments. Luckily, the solution is simple. Don&#39;t disallow short posts (outside of already existing rules regarding spammy comments), but eliminate the incentive to abuse and spam them for easy moons.</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Proposed solutions</strong></p>\n\n<p>Text posts and comments must have a body length of at least 50 characters to qualify to earn moons. This would not apply to posts or comments that only consist of images with no text content. The mods can remove any post that they feel is padded (has content added with the main or sole goal of reaching the character limit) pursuant to this and existing rules that cover rule manipulation and evasion.</p>\n\n<p>&nbsp;    </p>\n\n<p><strong>Reference info</strong></p>\n\n<p>This here is an example comment with 50 characters</p>\n\n<p>Emojis are typically ~2 characters and gif code is about 15. As this proposal is written, gif comments without additional text would no longer earn moons</p>\n\n<p><a href=\"https://www.reddit.com/poll/py08w1\">View Poll</a></p>\n</div><!-- SC_ON -->",
  "score": 211,
  "permalink": "/r/CryptoCurrency/comments/py08w1/require_minimum_post_and_comment_body_length_of/",
  "subreddit": "CryptoCurrency",
  "id": "py08w1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Summary\n\nMy proposal is that text posts and comments must have a body length of at least\n50 characters to qualify to earn moons.\n\n \n\nWhy this is needed\n\nAs has been brought up in multiple recent discussions, there has been analysis\ndone of moon payouts that shows the prevalence of short low effort…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "概要\n\n私の提案は、テキストの投稿とコメントは最低でも本文の長さが50文字以上でなければなりません。\n50文字以上でないとムーンを獲得できないというものです。\n\n \n\nなぜ必要なのか\n\n最近の複数の議論で取り上げられているように、ムーンの支払いに関する分析が行われています。\n最近の議論でも取り上げられていますが、ムーンの支払いについての分析が行われており、それによると、労力のかからない短い...",
      "title": "投稿やコメントの本文の長さを50文字以上にすることで、ムーンの対象となります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "摘要\n\n我的建议是，文本帖子和评论的正文长度必须至少为\n50个字符才有资格获得月亮。\n\n \n\n为什么需要这样做\n\n在最近的多次讨论中，有人分析过\n月亮报酬的分析，显示了短小精悍的文章的盛行。",
      "title": "要求帖子和评论正文长度至少为50个字符，才有资格获得月票"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "摘要\n\n我的建議是，文本帖子和評論的正文長度必須至少爲\n50個字符纔有資格獲得月亮。\n\n \n\n爲什麼需要這樣做\n\n在最近的多次討論中，有人分析過\n月亮報酬的分析，顯示了短小精悍的文章的盛行。",
      "title": "要求帖子和評論正文長度至少爲50個字符，纔有資格獲得月票"
    }
  ]
}