{
  "author": "juunhoad",
  "original_created_utc": 1652037516,
  "title": "For being into crypto since 2017, I'm kinda disappointed what it achieved.",
  "created_utc": 1652060982,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello all,&lt;/p&gt;\n\n&lt;p&gt;I really thought we would encounter at least some greater real world usage by now, but atm we only have ponzi like DeFi Apps, NFT that suck all the &amp;quot;usage&amp;quot; and copycats all over the place. I seriously thought crypto would have a better impact by now or at least some useful usage, kinda disappointed.&lt;/p&gt;\n\n&lt;p&gt;Most tokens feel so useless, a lot are just made for governance, but really how is that decentralized? A centralized system where everyone can only vote once is way more fair than a decentralized governance where the biggest whales dictate everything.&lt;/p&gt;\n\n&lt;p&gt;And if they are not only made for governance, they are made for staking/farming aka ponzi like tactics, which is very short term. Most of the DeFi apps can function well without the token and just use the native token they operate on, but the team behind it just wants to milk as much as possible so they create a token and give high APY to make it &amp;quot;useful&amp;quot;. High APY where they give the same token you stake is never going to end well. Don&amp;#39;t ever hold these tokens long term.&lt;/p&gt;\n\n&lt;p&gt;Then we have all the copycats. If you have one dApp or chain that&amp;#39;s &amp;quot;successful&amp;quot;, everyone is copycatting it. Just look at the amount of EVM compatible smart contract chains, it&amp;#39;s getting out of hand. Or STEPN which attracted a decent chunk of users, got copied straight after and so many more examples...&lt;/p&gt;\n\n&lt;p&gt;Pretty much all smart contact chains have the same dApps trying to milk every DeFi user there is. Most unique dApps still come from Ethereum and they all get copied to the cheaper chains.&lt;/p&gt;\n\n&lt;p&gt;Crypto projects like STEPN are P2E games, all these games are made for short term. Enjoy the gains while it lasts, because the unlimited high emission is going to kill every P2E game. They also attract a TON of bots, so you pretty much are competing with perfect human like players.&lt;/p&gt;\n\n&lt;p&gt;Then we have countries that are pretty much dictatorships that &amp;quot;adopt&amp;quot; bitcoin, while in reality they just buy bitcoin with the money they steal from their country. Statistics already show these countries aren&amp;#39;t adopting bitcoin in anyway. Also very funny how you see a posts here in front page about some house being sold for BTC for the first time in a country. Like really? Bitcoin has been around for so long and we are proud because of one single private transaction? Lmao.&lt;/p&gt;\n\n&lt;p&gt;So really, what did crypto achieve that&amp;#39;s really something to show off with? Curious to see others opinion.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 473,
  "permalink": "/r/CryptoCurrency/comments/ul8z4r/for_being_into_crypto_since_2017_im_kinda/",
  "subreddit": "CryptoCurrency",
  "id": "ul8z4r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hello all,\n\nI really thought we would encounter at least some greater real world usage by\nnow, but atm we only have ponzi like DeFi Apps, NFT that suck all the \"usage\"\nand copycats all over the place. I seriously thought crypto would have a better\nimpact by now or at least some useful usage, kinda…"
}