{
  "author": "jdefgh",
  "original_created_utc": 1627917842,
  "title": "Just accepted my first payment in Bitcoin!",
  "created_utc": 1627936948,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I own a small coffee shop and recently I started accepting payments in Bitcoin. Today, first person used Bitcoin to buy a cup of coffee. They opened up their wallet, scanned the address from QR Code and pushed the transaction. I didn&#39;t want them to scam me, so I decided not to give them the coffee until the transaction shows up in my wallet. The next block was mined just 2 minutes later (SO LUCKY!!). Unfortunately the transaction wasn&#39;t included in this block, after waiting for 9 minutes, another block was mined, this time it included the transaction. But I wasn&#39;t sure if this block was legitimate, so I decided to wait for 3 confirmations, we waited 32 minutes, but eventually the transaction was confirmed. This went really fast, they paid only $20 for a transaction confirmed in 43 minutes. I finally handed them over the cup of coffee, it was still warmer than the room temperature. </p>\n\n<p>Bitcoin is the future of payments.</p>\n</div><!-- SC_ON -->",
  "score": 185,
  "permalink": "/r/CryptoCurrency/comments/owgrm2/just_accepted_my_first_payment_in_bitcoin/",
  "subreddit": "CryptoCurrency",
  "id": "owgrm2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I own a small coffee shop and recently I started accepting payments in Bitcoin.\nToday, first person used Bitcoin to buy a cup of coffee. They opened up their\nwallet, scanned the address from QR Code and pushed the transaction. I didn't\nwant them to scam me, so I decided not to give them the coffee…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は小さなコーヒーショップを経営していますが、最近、ビットコインでの支払いを受け付け始めました。\n今日、初めての人がビットコインを使ってコーヒーを買いました。彼らは自分のウォレットを開き\nウォレットを開き、QRコードからアドレスをスキャンして、取引を進めました。私は彼らに詐欺にあってほしくなかったので\n詐欺にあってほしくないので、コーヒーは渡さないことにしました...。",
      "title": "ビットコインでの初めての支払いを受け入れました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我拥有一家小咖啡店，最近我开始接受比特币支付。\n今天，第一个人用比特币买了一杯咖啡。他们打开了他们的\n钱包，扫描二维码上的地址，然后推送了交易。我不想\n我不想让他们骗我，所以我决定不给他们咖啡...",
      "title": "刚刚接受了我的第一笔比特币付款!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我擁有一家小咖啡店，最近我開始接受比特幣支付。\n今天，第一個人用比特幣買了一杯咖啡。他們打開了他們的\n錢包，掃描二維碼上的地址，然後推送了交易。我不想\n我不想讓他們騙我，所以我決定不給他們咖啡...",
      "title": "剛剛接受了我的第一筆比特幣付款!"
    }
  ]
}