{
  "author": "Ehralur",
  "the_new_excerpt": "(RTTNews) - Toyota Motor Corp. (TYT.L,TM) said Wednesday that it is committed to\nmaking battery electric vehicles or BEVs. It expects to sell about 8 million\nelectrified vehicles globally by 2030, of which 2 million will be battery\nelectric vehicles and fuel cell electric vehicles.\n\nThe company…",
  "original_created_utc": 1620897449,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "(RTTNews) - トヨタ自動車株式会社（以下、「トヨタ」という。トヨタ自動車株式会社(TYT.L,TM)は、バッテリー式電気自動車(BEV)の製造に取り組んでいると発表しました。\nトヨタ自動車株式会社（TYT.L,TM）は、バッテリー式電気自動車（BEV）の製造に全力を尽くすと発表しました。2030年までに約800万台の電動車両を世界で販売する予定です。\n2030年までにグローバルで約800万台の電動車両を販売し、そのうち200万台をバッテリー\nそのうち200万台は、バッテリー電気自動車と燃料電池電気自動車となります。\n\n同社は...",
      "title": "トヨタ、2030年までに電動車両を世界で約800万台販売する見込み"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "(RTTNews)--丰田汽车公司(TYT.L,TM)周三表示，该公司承诺将在未来几年内，在全球范围内，以 \"一带一路 \"建设为契机，继续推进 \"一带一路 \"建设。(TYT.L,TM)周三表示，它致力于生产电池电动车或BEV。\n生产电池电动车或BEVs。它预计到2030年将在全球销售约800万辆\n该公司预计到2030年在全球范围内销售约800万辆电气化汽车，其中200万辆将是电池电动汽车和燃料电池电动汽车。\n电动汽车和燃料电池电动汽车。\n\n该公司...",
      "title": "丰田预计到2030年全球将销售约800万辆电气化汽车"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "(RTTNews)--豐田汽車公司(TYT.L,TM)週三表示，該公司承諾將在未來幾年內，在全球範圍內，以 \"一帶一路 \"建設爲契機，繼續推進 \"一帶一路 \"建設。(TYT.L,TM)週三表示，它致力於生產電池電動車或BEV。\n生產電池電動車或BEVs。它預計到2030年將在全球銷售約800萬輛\n該公司預計到2030年在全球範圍內銷售約800萬輛電氣化汽車，其中200萬輛將是電池電動汽車和燃料電池電動汽車。\n電動汽車和燃料電池電動汽車。\n\n該公司...",
      "title": "豐田預計到2030年全球將銷售約800萬輛電氣化汽車"
    }
  ],
  "title": "Toyota Expects To Sell About 8 Million Electrified Vehicles Globally By 2030",
  "created_utc": 1620909467,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><em>(RTTNews) - Toyota Motor Corp. (TYT.L,TM) said Wednesday that it is committed to making battery electric vehicles or BEVs. It expects to sell about 8 million electrified vehicles globally by 2030, of which 2 million will be battery electric vehicles and fuel cell electric vehicles.</em></p>\n\n<p><em>The company expects battery electric vehicles and fuel cell electric vehicles will make up 15% of U.S. sales by 2030, and along with the company&#39;s hybrids and plug-in hybrids, 70% of the Toyota and Lexus combined sales mix will be electrified by 2030.</em></p>\n\n<p><em>Earlier in 2021, Lexus unveiled the LF-Z, a conceptual look at the future of BEVs in the luxury segment. That was followed by the debut of the Toyota bZ4X concept, a battery electric SUV that will go into production in 2022.</em></p>\n\n<p>Source:\n<a href=\"https://www.nasdaq.com/articles/toyota-expects-to-sell-about-8-million-electrified-vehicles-globally-by-2030-2021-05-12\">https://www.nasdaq.com/articles/toyota-expects-to-sell-about-8-million-electrified-vehicles-globally-by-2030-2021-05-12</a></p>\n\n<hr/>\n\n<p>Two million EVs AND fuel cell vehicles in 2030 is an absolutely shockingly low number. Also, who do they think they will be selling these 6 million hybrid vehicles to? By 2030, EVs will be significantly cheaper than hybrid cars due to the expected battery cost decline of 60-80% this decade. Why would 75% of their customers pay more for a worse product?</p>\n\n<p>How big do you guys think the chance is that Toyota - currently the largest automaker in the world - will become the next Nokia? Personally, I&#39;m starting to think that it&#39;s incredibly likely they will go bankrupt or be just a shell of their former self.</p>\n</div><!-- SC_ON -->",
  "score": 218,
  "permalink": "/r/stocks/comments/nbchqt/toyota_expects_to_sell_about_8_million/",
  "subreddit": "stocks",
  "id": "nbchqt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590803281
}