{
  "author": "Godszn",
  "the_new_excerpt": "**TL;DR: Short term COVID play with great long term potential in CAR-T therapy\n(and more). Lenzilumab's recent P3 results cements it as the #1 current\ntherapeutic in hospitalized COVID patients. Application submission for emergency\nuse authorization (EUA) will come any day now (maybe today!) and…",
  "original_created_utc": 1619693417,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "**TL;DR： CAR-T療法で長期的には大きな可能性を秘めたCOVIDの短期的なプレイ\n(and more). Lenzilumabの最近のP3結果は、入院中のCOVID患者における現在の治療法の第1位となった\n入院中のCOVID患者の現在の治療法の第1位となる。緊急使用許可（EUA）の申請を\nEUA（緊急時使用許可）の申請はもうすぐ（たぶん今日！）、そして...",
      "title": "UPDATE: $HGEN (Humanigen) - CAR-T癌治療（その他！）で長期的に大きな可能性を秘めたCOVIDの短期的なプレイ。5倍以上の潜在的ROI"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "**TL;DR：短期的COVID游戏在CAR-T疗法中具有巨大的长期潜力\n还有更多）。Lenzilumab最近的P3结果使其成为目前住院COVID患者的第一大治疗方法。\n住院的COVID患者的第一治疗方法。提交紧急使用许可的申请\n紧急情况下使用授权（EUA）的申请随时会到来（也许是今天！），并且...",
      "title": "更新：$HGEN (Humanigen) - 短期COVID游戏，在CAR-T癌症治疗方面有巨大的长期潜力（以及更多！）。5倍以上的潜在投资回报率"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "**TL;DR：短期的COVID遊戲在CAR-T療法中具有巨大的長期潛力\n還有更多）。Lenzilumab最近的P3結果使其成爲目前住院COVID患者的第一大治療方法。\n住院的COVID患者的第一治療方法。提交緊急使用許可的申請\n緊急情況下使用授權（EUA）的申請隨時會到來（也許是今天！），並且...",
      "title": "更新：$HGEN (Humanigen) - 短期COVID遊戲，在CAR-T癌症治療方面有巨大的長期潛力（以及更多！）。5倍以上的潛在投資回報率"
    }
  ],
  "title": "UPDATE: $HGEN (Humanigen) - Short term COVID play w/ great long term potential in CAR-T cancer therapy (and more!). 5x+ potential ROI",
  "created_utc": 1619706857,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>**TL;DR:</strong> Short term COVID play with great long term potential in CAR-T therapy (and more). Lenzilumab&#39;s recent P3 results cements it as the #1 current therapeutic in hospitalized COVID patients. Application submission for emergency use authorization (EUA) will come any day now (maybe today!) and cause a greater spike than when it went from $14-&gt;$29 following P3 topline data release. &gt;5x ROI based on potential COVID sales and CAR-T implications is very possible. Great entry point currently at $18.60 (1bil market cap).</p>\n\n<p>You may or may not have seen my original post on Mar. 25 (copy and pasted below) talking about Humanigen&#39;s variant agnostic COVID drug Lenzilumab, which is primed to have a significant role in hospitalized COVID patients, CAR-T (cancer therapy), and more! Since my post, there have been plenty of positive catalysts:</p>\n\n<ol>\n<li>Humanigen released positive topline data in it&#39;s <a href=\"https://s27.q4cdn.com/938944131/files/doc_presentations/Lenzilumab-Phase-3-Results-v8-RXMD-032921-0555h.pdf\">phase 3 clinical trial</a> studying Lenzilumab in hospitalized COVID patients. Lenzilumab met the studies primary endpoint (ventilator free survival through day 28) with a <strong>54% relative improvement</strong> in VFS over and above current standard of care (remdesevir and/or steroids). Tocilizumab, a significantly inferior (but similar - works downstream of GM-CSF) immunomodulator is currently used often in hospitalized COVID patients. It only produced a <strong>18%</strong> relative improvement in VFS, and yet has made Roche a <a href=\"https://www.fiercepharma.com/manufacturing/novartis-inks-third-covid-19-production-pact-time-for-roche-s-arthritis-med-actemra\">boatload of money</a> and continues to be produced for COVID treatment. The drug generated 2.9bil in sales, which is a 32% increase from last year, and that increase is largely due to COVID. Simply put, this study has shown that Lenzilumab is currently the <strong>best therapeutic for hospitalized COVID patients.</strong> Next step is to file for EUA application, which will c<strong>ome any day now</strong>. For reference, the last COVID therapeutic (Eli lilly&#39;s baricitinib) took just over a month from topline P3 data release to EUA submission. Also, Merck&#39;s (now discontinued) COVID therapeutic was given the stop sign by the FDA approx. 20 days after P3 data release saying that they needed more data before submission. Basically, if there was an issue w/ Lenzilumab, I expect we would&#39;ve heard by now. <strong>I expect successful application submission and eventual approval</strong></li>\n<li>Humanigen reported positive phase 1b) results w/ Lenzilumab in it&#39;s CAR-T study <a href=\"https://www.businesswire.com/news/home/20210419005250/en/Humanigen-Reports-Positive-Data-With-Lenzilumab-in-the-ZUMA-19-CAR-T-Phase-1b-Study-in-DLBCL-and-Plans-to-Initiate-a-Potential-Registrational-Study\">Zuma-19</a>. One big issue with CAR-T is its side effects - cytokine release syndrome and severe neurotoxicity. Lenzilumab prevents this, and the results of this study showed that. All 6 patients had an objective response rate (4 of them being complete), and no patients had severe CRS or NT at the recommended phase 2 dose. Given the promising results, $HGEN terminated their collaboration with KITE and plans to initiate a phase 2 study with <strong>all commercially available</strong> CD19 CAR-T therapies in diffuse large b-cell lymphoma (DLBCL).</li>\n<li>Following the Zuma news, Humanigen brought on <a href=\"https://www.businesswire.com/news/home/20210421005213/en/Humanigen-Appoints-Dr.-Adrian-Kilcoyne-to-the-role-of-Chief-Medical-Officer\">Dr. Adrian Kilcoyne</a> to be their CMO. Dr. Kilcoyne has a long history with big pharma (and was previously working for AstraZeneca), and has had extensive experience in CAR-T. Interestingly, he worked for Celgene corporation when they were acquired by Bristol-Myer Squibb. He oversaw the development of a DLBCL drug and was the US lymphoma CAR-T lead supporting the clinical development and launch preparation of Breyzani. Extremely bullish move for an expert in CAR-T to leave his cushy big pharma job and join Humanigen (his first small biotech company venture) following promising CAR-T clinical trial results imo.</li>\n<li>More CAR-T news: <a href=\"https://imgur.com/a/8ZiAr74\">Recent Abstract</a> released (both CEO and CSO are authors) showing CAR-T cells w/ GM-CSF knock out ameliorates CAR-T cell early activation, reduces activation-induced cell death, and enhances antitumor activity. This is good. Another article <a href=\"https://www.nature.com/articles/s41421-021-00255-4\">(published in nature</a>) shows that GM-CSF knockout in CAR-T cells significantly improves side effects and maintains good efficacy: 0/3 patients exhibited neurotoxicity, and no CRS was observed in 2 patients (the third had grade 2 CRS). All 3 patients had complete responses. As I mentioned, Humanigen has a massive IP portfolio in GM-CSF neutralization, including GM-CSF knock out cells (<a href=\"https://money.cnn.com/news/newsfeeds/articles/globenewswire/7673719.htm\">exclusive license w/ Mayo Clinic</a>). ARK investments believes the cellular therapy TAM is <a href=\"https://twitter.com/TrumanFalkner/status/1382747618913046528\">absolutely massive</a></li>\n<li>Eversana, one of Humanigen&#39;s partners, is actively recruiting for account manager positions across the United States for commercialization of Lenzilumab. (search on Lin$%^#%.com)</li>\n<li><a href=\"https://twitter.com/humanigen/status/1380556227302854660?s=20\">Milestone payment</a> from KPM Tech and Telcon RF Pharma (HGEN&#39;s Phillipines/Korean partner) for their successful P3 results</li>\n<li><a href=\"https://www.clinicaltrials.gov/ct2/show/NCT04583969\">NIH ACTIV-5 trial</a> has added recruitment sites since release of P3 data</li>\n<li>Humanigen also announced <a href=\"https://www.businesswire.com/news/home/20210409005083/en/Humanigen-Announces-Positive-Results-From-Phase-1-Study-of-Ifabotuzumab-in-Glioblastoma-Multiforme\">positive phase 1 results</a> for their solid tumor targeting drug (different drug!) Ifabotuzumab in glioblastoma. Additional studies are planned to evaluate ifabotuzumab as an antibody-drug conjugate in solid tumor patients.</li>\n<li><a href=\"https://www.nasdaq.com/market-activity/stocks/hgen/short-interest\">8.5mil shares short as of April 15</a>. About 25% of the float and approx. 6 days to cover given the low volume trading. Given the illiquidity, there is a bit of a short squeeze potential.</li>\n<li>The <a href=\"https://www.wsj.com/market-data/quotes/HGEN/research-ratings\">average price target</a> of analysts for $HGEN is $34.29 ($21-$43)</li>\n</ol>\n\n<p>After P3 results were released Mar. 29, HGEN shot up to $29 dollars and eventually settled around $22 dollars. HGEN then had a 5m share offering at $18.50 to increase funds for manufacturing. This dilution, along with a rough downtrend for the biotech market and the susceptibility to shorting given it&#39;s low volume, HGEN fell to around $13 dollars (admittedly, I was very wrong about the response to P3 data release in my original post). It has since rebounded and is still at a <strong>great entry point</strong> at $18.60 (anything sub-20 is a steal imo), close to it&#39;s recent offering. As mentioned in my original post, Humanigen has consistently stated the goal to produce 100k doses in the next year with an approximate $1bil revenue. This doesn&#39;t include stockpiling or potential ex-US partnerships. With a current market cap of about $1bil, Humanigen <strong>can absolutely 5x their current value</strong> based on COVID sales alone, and CAR-T implications massively increases $HGEN&#39;s ceiling as a long term hold. Humanigen is also a prime buyout target and their CEO Dr. Durrant specializes in these turnarounds. Given the market response to the P3 release, I expect the successful filing of EUA application to cause an even greater spike in the <strong>$40ish+ range.</strong></p>\n\n<p><a href=\"https://www.reddit.com/u/weentown/\">u/weentown</a> also posted some great DD yesterday about $HGEN: <a href=\"https://www.reddit.com/r/wallstreetbetsOGs/comments/n0hhzn/hgen_humanigen_due_diligence/\">https://www.reddit.com/r/wallstreetbetsOGs/comments/n0hhzn/hgen_humanigen_due_diligence/</a></p>\n\n<p>Other catalysts to watch out for: News regarding government orders of Lenzilumab, full release of P3 data in a peer-reviewed journal, ACTIV-5 updates, CAR-T updates</p>\n\n<p>-----------------------------------------------------------------------------------------------------------------------------------------------Originally posted Mar. 25 on <a href=\"https://old.reddit.com/r/stocks\">r/stocks</a>: Humanigen ($HGEN), led by CEO Cameron Durant and CSO Dale Chappell, is a clinical stage biopharmaceutical company currently trading at $13.76 (market cap approx $740 million) that most notably makes the Anti-GM-CSF drug **Lenzilumab. It&#39;s phase 3 study for severe COVID has been completed and results will be out by end of march. With a successful phase 3 trial, Humanigen will apply and likely be granted Emergency Use authorization (EUA) for production and use of Lenzilumab</p>\n\n<p><strong>**What is it?**:</strong> Lenzilumab is a proprietary ( +100 Patents in GM-CSF, CAR-T, CRS, GvHD) Humaneered® anti-human granulocyte macrophage-colony stimulating factor (GM-CSF) monoclonal antibody that is designed to prevent and treat an immune hyper-response called cytokine storm, a complication considered to be a leading cause of COVID-19 death. Lenzilumab targets severe COVID – patients hospitalized w/ COVID and O2 saturation &lt;94% on room air (90% of hospitalized patients).</p>\n\n<p><strong>**How does it work?**:</strong> GM-CSF is an inflammatory signaling protein that causes a multitude of downstream effects. Blah blah blah, the details don’t matter, but what does matter is that this shit kills people with COVID. Here’s a recent bombshell article from <a href=\"https://immunology.sciencemag.org/content/6/57/eabg9873\">Science Immunology</a> that shows the distinct role of GM-CSF in severe COVID-19. What’s also very important is that this is produced by OUR BODIES. Not the virus. Lenzilumab doesn’t target the virus – it is not susceptible to resistance from mutant strains (#variantagnostic). From the article: “GM-CSF is elevated early, scaled with severity, and is central to the inflammatory response in COVID-19.”… “Our findings support therapeutic targeting of GM-CSF, as previously suggested on theoretical grounds”</p>\n\n<p>Here’s another recent study that further implicated GM-CSF in COVID: <a href=\"https://jlb.onlinelibrary.wiley.com/doi/full/10.1002/JLB.3COVCRA0920-628RR\">Journal of Leukocyte Biology</a>. From the article: &quot;Our findings fully support the emerging notion that GM‐CSF might be a key feature of SARS‐CoV‐2‐induced cytokine storm in COVID‐19 patients&quot;</p>\n\n<p><strong>**Does it work?**:</strong> We will find out soon. The company consistently stated Phase 3 results will be released by end of March. 60 days from last date of patient enrollment will be Mar. 29, and with some secondary endpoints being at the 60 day mark, I would not be surprised if data is released on the Monday. Until that day comes, there has been a lot of evidence suggesting that it will be successful. I’ve already talked about GM-CSF and studies implicating it&#39;s involvement and role in severe COVID lung pathology, and here&#39;s more:</p>\n\n<ol>\n<li><a href=\"https://www.mayoclinicproceedings.org/article/S0025-6196(20\">Open-label study published by the Mayo Clinic</a>30989-7/fulltext) --&gt; Study showed Clinical Improvement (defined as improvement of at least 2 points on the 8-point ordinal clinical endpoints scale) in 11 of 12 (91.7%) patients treated with lenzilumab and 22 of 27 (81.5%) untreated patients. The time to clinical improvement was significantly shorter for the lenzilumab-treated group compared with the untreated cohort with a median of 5 days versus 11 days (<em>P</em>=.006)</li>\n<li>An interim analysis of HGEN’s Phase 3 RCT (<a href=\"https://clinicaltrials.gov/ct2/show/NCT04351152\">NCT04351152</a>) showed promising results – with a 37% increase in recovery rate at Day 28 vs. Standard of care treatment. Study size (small sizes being an issue w/ many COVID therapeutics thus far) was increased to help maintain power of the study at 90% based on these results. <a href=\"https://www.biospace.com/article/releases/humanigen-announces-positive-interim-phase-3-data-of-lenzilumab-in-patients-hospitalized-with-covid-19/\">Source</a>.</li>\n<li>Otilimab – a drug from $GSK that also targets GM-CSF – recently failed their Phase 3 study. How is that good? Well, despite it being severely underdosed (single 90mg dose w/ shorter half life vs. 1800mg total dose of lenzilumab w/ longer half life) and including patients already on mechanical ventilation (further in disease course), they STILL proved statistical significance in their age 70+ group of patients. Lenzliumab has approx.. 45% of their patients age 65+ (which have a 35-80x risk of hospitalization and 1100-7900x risk of death compared to adolescents as per CDC) as per their interim phase 3 report as compared to 22% in the otilimab trial. The increased dose, greater drug half-life, and better patient population bodes very well for Lenzilumab’s chance of success</li>\n<li>Here’s a recent bullish letter to the editor from [<a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7833532/?fbclid=IwAR3RqXf3i6T9xPnFja_mb5b6p86rLF51SyOXOGimPD5Kgoij0QpBJW87tBs\">Mayo Clinic</a>]: “Aware of the good safety profile of lenzilumab in this current study and previous analysis, the treatment is feasible and safe and the ongoing randomized phase III trial will extensively confirm the lymphocyte recovery in SARS-CoV-2 infection and the impact of the drug on coronavirus disease 2019 clinical improvement”</li>\n<li>ACTIV-5 / Big Effect Trial (BET-B) for the Treatment of COVID (NCT04583969): Funded and selected by the NIH – this studies Lenzilumab combined with Remdesvir for the treatment of COVID. Not hard evidence of lenzilumab’s efficacy, but evidence that Lenzilumab has showed enough promise to warrant being chosen for such a trial<strong>Competition</strong>- There is none right now. All COVID therapeutics that target severe COVID have been dropping like flies. It’s all for the taking if this phase 3 study succeeds and Emergency Use approval Is granted</li>\n</ol>\n\n<p><strong>COVID – getting worse:</strong> As many of you might’ve heard, COVID isn’t going away. In fact, there are multiple new variants that are more infectious, more deadly, and more resistant to current vaccinations. Across the globe, COVID cases are rising again and certain areas are being hit especially hard. <a href=\"https://www.ctvnews.ca/health/coronavirus/india-detects-double-mutant-coronavirus-variant-1.5360271\">CTV news article re: India w/ it’s new double mutant variant</a>, <a href=\"https://www.cnn.com/2021/03/19/europe/coronavirus-europe-third-wave-intl/index.html\">CNN</a> re: Europe dealing with a surge in cases, and <a href=\"https://globalnews.ca/news/7720211/brazil-record-cases-covid-19/\">global news</a> re: Brazil hitting record number COVID cases, to name a few. New COVID cases in the US remain pretty low, but between lax restriction and the rise of variant strains <a href=\"https://www.nature.com/articles/d41586-021-00564-4\">as this nature article shows</a>, we could be seeing another wave in the US as well. How deadly are these new strains? Still much to be learned, but it’s looking like current vaccines leave a lot to be desired. <a href=\"https://www.nejm.org/doi/full/10.1056/NEJMc2100362\">Here’s a study from the New England Journal of Medicine</a>, which studied viral neutralization of some new variants w/ our current vaccines (refer to Table 1). $PFE has decreased (in vitro) efficacy by 2x, 6.7x, &lt;6.5x vs. B117, P1, 501YV2 variants. $MRNA vaccine has decreased efficacy by 1.8x, 4.5x, &lt;8.6xGoogle cases worldwide and you will see the # of new COVID cases/day have started to rise after hitting a trough in mid-Feb. Between COVID fatigue and places easing restrictions and the new variants mentioned above, COVID is here to stay and will be for years to come. <a href=\"https://www.nature.com/articles/d41586-021-00396-2\">Here’s an article from nature</a>, which talks about COVID being a endemic virus that we will be dealing with on a year to year basis. Unfortunately, the market is huge for #lenzilumab</p>\n\n<p><strong>Partnerships</strong></p>\n\n<ol>\n<li>Humanigen was the only micro cap company chosen for <strong>Operation Warp Speed</strong> (an initiative to facilitate and accelerate the development, manufacturing, and distribution of COVID-19 vaccines, therapeutics, and diagnostics) -&gt; <a href=\"https://ir.humanigen.com/news/news-details/2020/Humanigen-Announces-Cooperative-Research-and-Development-Agreement-with-the-US-government-to-Develop-Lenzilumab-for-COVID-19/default.aspx\">Source</a>. Humanigen in collaboration with BARDA to increase manufacturing capacity</li>\n<li>License agreement with KPM Tech/Telcon RF Pharamceutical company for Lenzilumab production in South Korea and the Phillipines. [<a href=\"https://www.businesswire.com/news/home/20201103005167/en/Humanigen-Executes-Licensing-Agreement-for-Lenzilumab%E2%84%A2-in-COVID-19-with-KPM-TechTelcon-RF-Pharmaceutical-for-South-Korea-and-the-Philippines\">Source</a>]</li>\n<li>Partnership with Thermo Fisher to scale up manufacturing. [<a href=\"https://www.fiercepharma.com/manufacturing/humanigen-thermo-fisher-reach-agreement-to-scale-up-manufacturing-monoclonal-antibody\">Source</a>]</li>\n<li>Partnership with Emergent Biosolutions for development and manufacturing. [<a href=\"https://investors.emergentbiosolutions.com/news-releases/news-release-details/humanigen-and-emergent-biosolutions-announce-contract-0\">Source</a>]</li>\n<li>Partnership w/ Avid Bioservices for manufacturing agreement. [<a href=\"https://www.businesswire.com/news/home/20210203005204/en/Humanigen-and-Avid-Bioservices-Enter-Into-cGMP-Manufacturing-Agreement-for-COVID-19-Therapeutic-Candidate-Lenzilumab-in-Support-of-Potential-EUA-Filing\">Source</a>]</li>\n<li>Not a partnership, but $HGEN recently announced an $80million loan w/ Hercules Capital on Mar. 10 to support manufacturing and commercialization. Bullish move close to P3 data release imo. [<a href=\"https://www.businesswire.com/news/home/20210310005879/en/Humanigen-Announces-80-Million-Loan-Facility-from-Hercules-Capital\">Source</a>]</li>\n</ol>\n\n<p><strong>TL;DR - lots of partnerships and agreements in place for manufacturing if EUA approval granted</strong></p>\n\n<p><strong>The Market:</strong> Here’s a PDF PowerPoint of $HGEN corporate presentation: <a href=\"https://ir.humanigen.com/events-and-presentations/default.aspx\">Humanigen</a>. The whole presentation gives a great overview of the company and I recommend a look through, but skip to slide 18 and you can get a rough sense of the market potential. There are 3 sources of incomes:</p>\n\n<ol>\n<li>Stockpiling – US and ex-US</li>\n<li>US market</li>\n<li>Outside the US market</li>\n</ol>\n\n<p>US market: Conservative estimates from the company believes there will be 1,000,000+ hospitalizations in the US this year, with approximately 100,000 patients as a market for Lenzilumab treatment. At 10k per dose, an approximate 1bil of revenue is up for the takingOutside the US market:</p>\n\n<ol>\n<li>The market is there with cases numbers rising across the globe</li>\n<li>Humanigen has been in discussion with ex-US governments already about production of lenzilumab (skip to 24:00 on the <a href=\"https://ir.humanigen.com/events-and-presentations/default.aspx\">Mar 16 fireside chat webcast</a>)</li>\n</ol>\n\n<p><strong>Price forecasting:Conservative estimates from the company project 100k doses for the US alone in 2021 if given EUA approval. This gives approximate revenue of 1bil. This doesn’t include any non-US sales or stockpiling.With positive phase 3 trial data, I see the price share easily shooting up to 50-60+. The next step would be applying for Emergency Use Approval, with acceptance likely if P3 study is successful. If granted, and going by the very conservative estimate of $1billion in revenue, I think $HGEN’s market cap will easily be $5bil+, giving it a PPS of roughly $100+</strong></p>\n\n<p><strong>BONUS -&gt; HIGH SHORT INTEREST: $HGEN short interest has almost doubled from Feb 26-&gt;Mar 15!!!. Yahoo finance estimates a 26% short interest as of Mar 15 w/ a Short ratio of 4.12 given the stock’s low trading volume. With the recent drop in price the past couple days, I would not be surprised if this number was higher. TL;DR -&gt; more fuel for the rocket ships</strong></p>\n\n<p><strong>BONUS BONUS – CAR-T implications and more:</strong></p>\n\n<p>Lenzilumab is a cytokine storm drug, not a COVID drug. It is also in a phase 1b/2 study (ZUMA-19) where it is paired w/ a CAR-T drug Yescarta (by $GILD) for the treatment of relapsed/refractory Large B-Cell lymphoma. Car-T therapy is basically genetically engineered T-cells that can target a specific protein, or cancer. The main issue with CAR-T therapy is that it has significant side effects via cytokine storm and neurologic toxicity. Early studies have already shown that Lenzilumab significantly reduces cytokine storm side effects in CAR-T and actually IMPROVES overall efficacy. The readout for this study is planned for this year and there is precedent for CAR-T FDA approval based on phase 2 studies. I don’t have the energy to go into detail so I will leave it at that, but this has HUGE long term possibilities and gives $HGEN significant long term value outside of COVID</p>\n\n<p>**Edit to expand on CAR-T a bit more: I don’t want to downplay this, I think it’s very promising and I’m very bullish on it, but I’m admittedly not as researched on the minutia and writing up covid stuff tired me out XD. There’s 3 main players in the Car-T space and Lenzilumab (which has the patent for preventing Cytokine storm and neurotoxicity related to T cell therapy) could be the missing piece to make this therapy safer. $GILD had dropped another anti-GM-CSF drug from $KNSA and decided to go ahead with just lenzilumab, as well.</p>\n\n<p>Lenzilumab also is in a phase 2/3 study for preventing/treating acute GvHD and also CMML phase 2.</p>\n\n<p>$HGEN also has ifabotuzumab, a drug for treating solid tumors, which is currently in phase 1</p>\n\n<p><strong>**TL;DR: Short term covid play w/ ++high upside (potential 5-10x ROI) and high short-interest w/ long term CAR-T potential.*\\</strong>*</p>\n\n<p>Imo, $HGEN is a very appealing short term, high risk phase 3 COVID trial play with extremely high reward. With successful P3 studies, I see the PPS skyrocketing to 60+ and w/ EUA to 100+ (5bil+ market cap) as a conservative estimate. With stockpiling and ex-USA partnerships, the PPS will soar past 100 and w/ CAR-T the potential is even greater. Of course, the downside is a failed trial and price plummets to around $6 I think. Given the stocks low float and low trading volume, it is very volatile and subject to easy price manipulation. It has dropped approx. 25% the past month down to $13.76 and is extremely appealing at this price range. There is downside, but the upside is much much greater.</p>\n\n<p>POSITION: 1250 @ $16.30</p>\n</div><!-- SC_ON -->",
  "score": 91,
  "permalink": "/r/stocks/comments/n11qxi/update_hgen_humanigen_short_term_covid_play_w/",
  "subreddit": "stocks",
  "id": "n11qxi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380966994
}