{
  "author": "chrisdh79",
  "the_new_excerpt": "Tesla’s stock price soared during Monday trading following the report of\nimpressive Q1 2021 delivery and production numbers last Friday. Bullish analyst\nDan Ives of Wedbush, who boosted his outlook on Tesla stock to “Outperform” from\na “Hold” rating following the Q1 figures, believes that the stock…",
  "original_created_utc": 1617798027,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "テスラの株価は月曜日の取引で急上昇しました。\n2021年第1四半期の出荷台数と生産台数が発表され、月曜日の取引で株価が急上昇しました。強気のアナリスト\nWedbush社のDan Ives氏は、Tesla社の株価の見通しを「ホールド」から「アウトパフォーム」に引き上げました。\nWedbush社の強気のアナリスト、ダン・アイブスは、第1四半期の数字を受けて、テスラの株価の見通しを「ホールド」から「アウトパフォーム」に引き上げました。",
      "title": "テスラの株価見通しが1,300ドルに急上昇、バイデン氏のEV税控除10kドルが追い風に"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "特斯拉的股价在周一的交易中大涨，在报道后，特斯拉的。\n上周五公布了令人印象深刻的2021年第一季度交付和生产数据。看涨分析师\nWedbush的Dan Ives，他将特斯拉股票的前景从 \"优于大盘 \"提升至 \"优于大盘\"。\n一季度数据后给予 \"增持 \"评级，认为该股...",
      "title": "受拜登1万电动车税收优惠政策推动，特斯拉股票前景飙升至每股1300美元。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "特斯拉的股價在週一的交易中大漲，在報道後，特斯拉的。\n上週五公佈了令人印象深刻的2021年第一季度交付和生產數據。看漲分析師\nWedbush的Dan Ives，他將特斯拉股票的前景從 \"優於大盤 \"提升至 \"優於大盤\"。\n一季度數據後給予 \"增持 \"評級，認爲該股...",
      "title": "受拜登1萬電動車稅收優惠政策推動，特斯拉股票前景飆升至每股1300美元。"
    }
  ],
  "title": "Tesla stock outlook soars to $1,300 per share, driven by Biden’s $10k EV tax credit",
  "created_utc": 1617803586,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Tesla’s stock price soared during Monday trading following the report of impressive Q1 2021 delivery and production numbers last Friday. Bullish analyst Dan Ives of Wedbush, who boosted his outlook on Tesla stock to “Outperform” from a “Hold” rating following the Q1 figures, believes that the stock could cross the $1,300 mark in the coming months, especially if Presiden Joe Biden’s planned EV tax credit is pushed through. Wedbush sources indicate that the previously thought $7,000 credit could be increased to $10,000, further incentivizing car buyers to purchase electric powertrains instead of gas-powered ones.</p>\n\n<p><a href=\"https://www.teslarati.com/tesla-stock-1300-per-share-biden-10k-ev-credit/\">https://www.teslarati.com/tesla-stock-1300-per-share-biden-10k-ev-credit/</a></p>\n</div><!-- SC_ON -->",
  "score": 76,
  "permalink": "/r/stocks/comments/mm0t8m/tesla_stock_outlook_soars_to_1300_per_share/",
  "subreddit": "stocks",
  "id": "mm0t8m",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961880360
}