{
  "author": "PhilipShaunDunphy",
  "original_created_utc": 1651185076,
  "title": "Are Amber Heard's lawyers really that bad or does it just go to show how easily they thought they could paint a man as an abuser?",
  "created_utc": 1651200682,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Yes I am serious.  Using bullshit &amp;#39;proof&amp;#39; like &amp;quot;He drank a lot/did drugs&amp;quot; and &amp;quot;We have a video of him slamming cabinets to prove he can be aggressive&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;I think they may have thought this would be a simple cut and dry case and that Amber would win by a landslide simply because DV cases tend to be so one sided and even with a baseless accusation a woman will usually be believed.&lt;/p&gt;\n\n&lt;p&gt;What we are witnessing is a changing of the tide; the problem for her lawyers is that it&amp;#39;s changing in real time for them and they aren&amp;#39;t adequately prepared to actually present a case, but those are just my thoughts.&lt;/p&gt;\n\n&lt;p&gt;What say you?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 205,
  "permalink": "/r/NoStupidQuestions/comments/ue73tc/are_amber_heards_lawyers_really_that_bad_or_does/",
  "subreddit": "NoStupidQuestions",
  "id": "ue73tc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Yes I am serious. Using bullshit 'proof' like \"He drank a lot/did drugs\" and \"We\nhave a video of him slamming cabinets to prove he can be aggressive\".\n\nI think they may have thought this would be a simple cut and dry case and that\nAmber would win by a landslide simply because DV cases tend to be so…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "はい......本気です。彼はたくさん飲んだ/ドラッグをやっていた」「我々はビデオを持っている」など、でたらめな「証拠」を使う。\nキャビネットをバタンと倒したビデオで、攻撃的な性格であることを証明しています」。\n\n彼らはこの事件が単純明快なものだと思っていたのでしょう。\nアンバーが圧勝すると思ったのでしょう。",
      "title": "アンバー・ハードの弁護士はそんなに悪いのか、それとも、いかに簡単に男を虐待者として描けると思っていたかを示しているのだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "是的，我是认真的。使用诸如 \"他喝了很多酒/吸毒 \"和 \"我们有一个他摔柜子的视频来证明他可以攻击性 \"这样的狗屁 \"证据\"。\n我们有一个他猛击橱柜的视频，以证明他可以具有攻击性\"。\n\n我认为他们可能认为这将是一个简单的干脆的案件，并且\n琥珀会以压倒性优势获胜，因为家庭暴力案件往往是如此......",
      "title": "安柏-赫德的律师真的那么糟糕吗？还是说这只是表明他们认为可以很容易地把一个男人描绘成一个虐待者？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "是的，我是認真的。使用諸如 \"他喝了很多酒/吸毒 \"和 \"我們有一個他摔櫃子的視頻來證明他可以攻擊性 \"這樣的狗屁 \"證據\"。\n我們有一個他猛擊櫥櫃的視頻，以證明他可以具有攻擊性\"。\n\n我認爲他們可能認爲這將是一個簡單的乾脆的案件，並且\n琥珀會以壓倒性優勢獲勝，因爲家庭暴力案件往往是如此......",
      "title": "安柏-赫德的律師真的那麼糟糕嗎？還是說這只是表明他們認爲可以很容易地把一個男人描繪成一個虐待者？"
    }
  ]
}