{
  "author": "3sides2everyStory",
  "the_new_excerpt": "8 years from now you'll be kicking yourself for not buying more at these levels.\n\nI know it's easy to compare to previous cycles or even last year. Of course, it\nseems high in the mid-stages of a bull market. But investing is about looking\nforward not backward. Do your research and choose your entry…",
  "original_created_utc": 1621184107,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "8年後には、このレベルでもっと買わなかったことを後悔することになるでしょう。\n\n前のサイクルや去年と比較するのは簡単なことですが。もちろん\nもちろん、強気相場の最中には高く見えます。しかし、投資とは後ろを見るのではなく\n振り返るのではなく、前を見ることです。リサーチをして、エントリーを選んで...。",
      "title": "4年後には、このレベルでもっと買っておけばよかったと思うでしょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "8年后，你会为没有在这些水平上购买更多的东西而自责。\n\n我知道与以前的周期甚至去年相比很容易。当然，这\n在牛市的中期阶段似乎很高。但投资是关于向前看而不是向后看。\n向前看而不是向后看。做好你的研究，选择你的进入...",
      "title": "4年后，你会希望你在这些水平上买得更多。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "8年後，你會爲沒有在這些水平上購買更多的東西而自責。\n\n我知道與以前的週期甚至去年相比很容易。當然，這\n在牛市的中期階段似乎很高。但投資是關於向前看而不是向後看。\n向前看而不是向後看。做好你的研究，選擇你的進入...",
      "title": "4年後，你會希望你在這些水平上買得更多。"
    }
  ],
  "title": "4 years from now you'll wish you bought more at these levels.",
  "created_utc": 1621240994,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>8 years from now you&#39;ll be kicking yourself for not buying more at these levels. </p>\n\n<p>I know it&#39;s easy to compare to previous cycles or even last year. Of course, it seems high in the mid-stages of a bull market. But investing is about looking forward not backward. Do your research and choose your entry points. Buy with Limit orders and let the dips come to you. Have an exit strategy and stick to it. </p>\n\n<p>There&#39;s still time to stuff more coin in your moon bags.</p>\n</div><!-- SC_ON -->",
  "score": 209,
  "permalink": "/r/CryptoCurrency/comments/ndsjhs/4_years_from_now_youll_wish_you_bought_more_at/",
  "subreddit": "CryptoCurrency",
  "id": "ndsjhs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590799665
}