{
  "author": "BigLongFootDoctor",
  "original_created_utc": 1634262841,
  "title": "How can I earn some extra crypto daily? Like $5?",
  "created_utc": 1634297827,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I live in Mexico and 5 dollars a day is about 100 pesos, or rent money for a 2 bedroom house a month so it&#39;s definitely a big deal. However, being in Mexico I cannot do most of the options available to those in America/Canada. What I do have available like Brave browser only earns about 1 BAT per month since the region has less advertisers. </p>\n\n<p>I hear about playing crypto games early on being a potential moonshot. Maybe something like that, just looking for suggestions? Cause $5 a day would be amazing!</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/q8e03z/how_can_i_earn_some_extra_crypto_daily_like_5/",
  "subreddit": "CryptoCurrency",
  "id": "q8e03z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I live in Mexico and 5 dollars a day is about 100 pesos, or rent money for a 2\nbedroom house a month so it's definitely a big deal. However, being in Mexico I\ncannot do most of the options available to those in America/Canada. What I do\nhave available like Brave browser only earns about 1 BAT per…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はメキシコに住んでいますが、1日5ドルは約100ペソで、2LDKの家の家賃に相当します。\n1ヶ月で2LDKの家の家賃に相当するので、とても大きな金額です。しかし、メキシコにいると、アメリカやカナダでは\nアメリカやカナダでできるようなことはほとんどできません。私ができること\nブレイブブラウザのように、1回あたり1BAT程度の収入しか得られないものもあります。",
      "title": "どうすれば毎日余分なcryptoを稼ぐことができますか？例えば5ドルとか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我住在墨西哥，每天5美元大约是100比索，也就是一个两居室房子一个月的租金。\n卧室的房子，所以这绝对是个大问题。然而，由于我在墨西哥\n不能像美国/加拿大的人那样做大部分的选择。我所做的\n像勇敢的浏览器，每小时只能赚取大约1 BAT。",
      "title": "我如何才能每天赚取一些额外的加密货币？比如5美元？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我住在墨西哥，每天5美元大約是100比索，也就是一個兩居室房子一個月的租金。\n臥室的房子，所以這絕對是個大問題。然而，由於我在墨西哥\n不能像美國/加拿大的人那樣做大部分的選擇。我所做的\n像勇敢的瀏覽器，每小時只能賺取大約1 BAT。",
      "title": "我如何才能每天賺取一些額外的加密貨幣？比如5美元？"
    }
  ]
}