{
  "author": "Caramal76",
  "the_new_excerpt": "Particularly how did various philosophers like Thomas Aquinas reconcile the idea\nof a purely actual being with Yahweh as described in the Bible?\n\nYahweh doesn’t seem to be a being that lacks potentiality or contingency at all.\nFor a few examples:\n\n1.) Yahweh performs actions (like striking Ananias…",
  "original_created_utc": 1615492134,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "特别是像托马斯-阿奎那这样的哲学家是如何调和的\n与《圣经》中描述的耶和华纯粹的实际存在？\n\n耶和华似乎根本不是一个缺乏潜在性或偶然性的存在。\n举几个例子。\n\n1.) 耶和华执行行动（如打亚拿尼亚......）。",
      "title": "基督教哲学家是如何将哲学上的上帝观念与圣经上的耶和华观念相协调的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "特別是像托馬斯-阿奎那這樣的哲學家是如何調和的\n與《聖經》中描述的耶和華純粹的實際存在？\n\n耶和華似乎根本不是一個缺乏潛在性或偶然性的存在。\n舉幾個例子。\n\n1.) 耶和華執行行動（如打亞拿尼亞......）。",
      "title": "基督教哲學家是如何將哲學上的上帝觀念與聖經上的耶和華觀念相協調的。"
    }
  ],
  "title": "How did Christian philosophers reconcile philosophical notions of God with Biblical notions of Yahweh.",
  "created_utc": 1615531860,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Particularly how did various philosophers like Thomas Aquinas reconcile the idea of a purely actual being with Yahweh as described in the Bible? </p>\n\n<p>Yahweh doesn’t seem to be a being that lacks potentiality or contingency at all. For a few examples:</p>\n\n<p>1.) Yahweh performs actions (like striking Ananias and Sapphira dead after they lied about money) that are clearly contingent upon the actions of the third party. </p>\n\n<p>2.) Yahweh becomes pleased with the faithful and angry with the unfaithful. We see a change in the Biblical Yahweh that is contingent upon the behavior of others.</p>\n\n<p>3.) On a few occasions (like with Moses for example) Yahweh speaks in conversation with individuals. This obviously displays contingency as responses God gives are prompted by the specific things asked by his conversational partner. Had Moses asked something different, Yahweh would have responded differently to him.</p>\n\n<p>I am aware that many Christians might say many Biblical stories are not literally true events that literally took place (although I’m not sure of many that would deny all the three examples I gave). But, if I understand correctly, people like Augustine, Aquinas, etc. would have believed these stories as true tellings of events. How would they reconcile these issues? </p>\n\n<p>It doesn’t seem coherent to propose a God lacking potentiality and contingency that somehow interacts with people and the world. How can you interact with a human being without your responses being contingent upon the actions of the human?</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/askphilosophy/comments/m2z1n3/how_did_christian_philosophers_reconcile/",
  "subreddit": "askphilosophy",
  "id": "m2z1n3",
  "is_self": true,
  "media": null,
  "is_video": false
}