{
  "author": "PopDukesBruh",
  "original_created_utc": 1630960500,
  "title": "750,000 Evictions predicted as the eviction ban is lifted in the US",
  "created_utc": 1630980078,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>These evictions will probably have a large impact on the markets of all kind, but how will it affect the crypto markets?</p>\n\n<p>If the evictions don’t pop the real estate bubble I feel like crypto will continue to be seen as a value, a great place to keep money, and a possible hedge against inflation. That could mean a lot of these bullish predictions we’ve been reading could come to fruition. 100k/20k/etc.</p>\n\n<p>If the Real Estate bubble does pop like it did in 08-09 we may see a crypto exodus as people pile into real estate. We could even see another crypto winter. Real estate and land have become increasingly expensive and scarce the last 3 years or so. There will be a lot of folks who will drop their holdings in the markets to buy some real estate.</p>\n\n<p>Trying to look ahead as we ride this all rising crypto wave right now. It’s the moves you make in preparation that make all the difference. The game as they say is won and lost in preparation not by YOLOing.\nENJOY YOUR GAINS! but have one eye on your next moves at all times! Have a bronzer weekend Internet friends!</p>\n</div><!-- SC_ON -->",
  "score": 318,
  "permalink": "/r/CryptoCurrency/comments/pj7wd7/750000_evictions_predicted_as_the_eviction_ban_is/",
  "subreddit": "CryptoCurrency",
  "id": "pj7wd7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "These evictions will probably have a large impact on the markets of all kind,\nbut how will it affect the crypto markets?\n\nIf the evictions don’t pop the real estate bubble I feel like crypto will\ncontinue to be seen as a value, a great place to keep money, and a possible\nhedge against inflation.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これらの立ち退きは、おそらくあらゆる種類の市場に大きな影響を与えるでしょう。\nしかし、暗号市場にはどのような影響があるのでしょうか？\n\n立ち退きが不動産バブルの崩壊につながらなければ、暗号は価値あるもの、お金を保管するのに最適な場所、そして可能性のあるものとして見られ続けると思います。\n価値があり、お金を保管するのに最適な場所であり、インフレに対するヘッジの可能性があると見られ続けていると思います。\nインフレに対するヘッジの可能性....",
      "title": "米国で立ち退きが解禁され、750,000件の立ち退きが予測される"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这些驱逐可能会对所有种类的市场产生很大影响。\n但它将如何影响加密货币市场？\n\n如果拆迁没有刺破房地产泡沫，我觉得加密货币将\n将继续被视为一种价值，一个保存资金的好地方，以及一个可能的\n对冲通货膨胀....",
      "title": "美国取消拆迁禁令，预计将有75万户拆迁户。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這些驅逐可能會對所有種類的市場產生很大影響。\n但它將如何影響加密貨幣市場？\n\n如果拆遷沒有刺破房地產泡沫，我覺得加密貨幣將\n將繼續被視爲一種價值，一個保存資金的好地方，以及一個可能的\n對沖通貨膨脹....",
      "title": "美國取消拆遷禁令，預計將有75萬戶拆遷戶。"
    }
  ]
}