{
  "author": "morecoffeemore",
  "the_new_excerpt": "Michael Burry is saying index funds are a bubble - they pump up equity values\nthrough passive investing which is disconnected from any kind of analysis, thus\nforming a bubble.\n\nNot saying he is correct, or not, but assuming he is correct what's a good way\nto achieve diversification (so you can 'set…",
  "original_created_utc": 1621328621,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Michael Burry氏は、インデックスファンドはバブルだと言っていますが、それは分析から切り離されたパッシブな投資によって株式価値を押し上げるものです。\n分析から切り離されたパッシブな投資によって株式価値を押し上げ、バブルを形成している。\nバブルを形成しています。\n\n彼が正しいかどうかはわかりませんが、仮に彼が正しいとすると、分散投資を実現するための良い方法は何でしょうか？\n分散投資を実現するための良い方法は何でしょうか（そうすれば、「セット...",
      "title": "もしBurry氏がインデックスファンドバブルについて正しいとしたら、代替となる良いファンドは何か？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "迈克尔-伯里说，指数基金是一个泡沫--它们通过与任何形式的分析脱节的被动投资来提高股票价值\n通过与任何类型的分析脱节的被动投资，从而\n形成一个泡沫。\n\n我不是说他是正确的，也不是说他不正确，但假设他是正确的，有什么好办法\n来实现多样化（所以你可以 \"设置...",
      "title": "如果Burry对指数基金泡沫的看法是正确的，那么有什么好的替代方案？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "邁克爾-伯裏說，指數基金是一個泡沫--它們通過與任何形式的分析脫節的被動投資來提高股票價值\n通過與任何類型的分析脫節的被動投資，從而\n形成一個泡沫。\n\n我不是說他是正確的，也不是說他不正確，但假設他是正確的，有什麼好辦法\n來實現多樣化（所以你可以 \"設置...",
      "title": "如果Burry對指數基金泡沫的看法是正確的，那麼有什麼好的替代方案？"
    }
  ],
  "title": "If Burry is right about the index fund bubble what's a good alternative?",
  "created_utc": 1621343721,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Michael Burry is saying index funds are a bubble - they pump up equity values through passive investing which is disconnected from any kind of analysis, thus forming a bubble. </p>\n\n<p>Not saying he is correct, or not, but assuming he is correct what&#39;s a good way to achieve diversification  (so you can &#39;set it and forget it&#39; just using dollar coast averaging and rebalancing) without resorting to purchasing index funds?</p>\n\n<p><a href=\"https://www.bnnbloomberg.ca/the-big-short-s-michael-burry-explains-why-index-funds-are-like-subprime-cdos-1.1310874\">&#39;It will be ugly&#39;: The Big Short&#39;s Michael Burry on why index funds are like subprime CDOs - BNN Bloomberg</a></p>\n</div><!-- SC_ON -->",
  "score": 1034,
  "permalink": "/r/investing/comments/nf5rgc/if_burry_is_right_about_the_index_fund_bubble/",
  "subreddit": "investing",
  "id": "nf5rgc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590803267
}