{
  "author": "Davinter30",
  "original_created_utc": 1644696332,
  "title": "No one wants to talk to you. Sorry but you're being scammed",
  "created_utc": 1644733904,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I know, there are warnings everywhere about scams, but I just don&amp;#39;t understand how some people fall for these types of scams. &lt;/p&gt;\n\n&lt;p&gt;A lot of scams begin with a simple conversation. If a random stranger just send you a private message saying &amp;quot;hi&amp;quot;, theres already a 99.9999% chance its a scammer. I&amp;#39;m sorry but no one wants to talk to you, you&amp;#39;re not special, you&amp;#39;re not the lucky winner who is going to test a new project. You&amp;#39;re being scammed. You would think everyone knows that but if they are doing it, its because it works.&lt;/p&gt;\n\n&lt;p&gt;Also, no exchange or bank is ever going to ask you for your password. So please, be smart and never trust anyone, if you have the slightest doubt about the legitimacy of something, call your exchange, call your bank, make a post, but dont take any risk!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 316,
  "permalink": "/r/CryptoCurrency/comments/sqzyuq/no_one_wants_to_talk_to_you_sorry_but_youre_being/",
  "subreddit": "CryptoCurrency",
  "id": "sqzyuq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I know, there are warnings everywhere about scams, but I just don't understand\nhow some people fall for these types of scams.\n\nA lot of scams begin with a simple conversation. If a random stranger just send\nyou a private message saying \"hi\", theres already a 99.9999% chance its a\nscammer. I'm sorry…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "詐欺の警告が至る所にあるのは知っていますが、私には理解できません。\nこの手の詐欺に引っかかる人がいるんですね。\n\n多くの詐欺は簡単な会話から始まります。もし、見ず知らずの人が\nプライベートメッセージで「ハーイ」と言ったら、99.9999%の確率でその人は\n詐欺師 すみません...",
      "title": "誰もあなたと話したがらない。申し訳ありませんが、あなたは詐欺に遭っています"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道，到处都有关于诈骗的警告，但我就是不明白\n有些人怎么会被这些类型的骗局所骗。\n\n很多骗局都是从一个简单的对话开始的。如果一个随机的陌生人只是给你发了一条私信\n说 \"你好\"，那就已经有99.9999%的机会是骗子了。\n诈骗者。我很抱歉...",
      "title": "没有人愿意和你说话。对不起，你被骗了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道，到處都有關於詐騙的警告，但我就是不明白\n有些人怎麼會被這些類型的騙局所騙。\n\n很多騙局都是從一個簡單的對話開始的。如果一個隨機的陌生人只是給你發了一條私信\n說 \"你好\"，那就已經有99.9999%的機會是騙子了。\n詐騙者。我很抱歉...",
      "title": "沒有人願意和你說話。對不起，你被騙了"
    }
  ]
}