{
  "author": "TrueBirch",
  "original_created_utc": 1625839342,
  "title": "How did office workers goof off before computers?",
  "created_utc": 1625861412,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m an American office drone. When I want to take a break from work, I can pull up anything on the internet. News, games, social media, etc. How did people goof off at the office before computers were common? If you want more focus, we can limit the question to the United States between 1900 and 1980.</p>\n\n<p>Since this is a proper history sub, here&#39;s a reference. William Manchester&#39;s controversial Death of a President says that some people in offices secretly had personal radios at their desks.</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/ogw74a/how_did_office_workers_goof_off_before_computers/",
  "subreddit": "AskHistorians",
  "id": "ogw74a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm an American office drone. When I want to take a break from work, I can pull\nup anything on the internet. News, games, social media, etc. How did people goof\noff at the office before computers were common? If you want more focus, we can\nlimit the question to the United States between 1900 and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はアメリカのオフィスのドローンです。仕事の息抜きをしたいときは、インターネットで何でも調べられます。\nインターネットで何でも調べられます。ニュース、ゲーム、ソーシャル・メディアなど。コンピュータが普及する前、人々はどのようにして\nパソコンが普及する前の人は、オフィスでどのようにグズグズしていたのでしょうか？もっと焦点を当てたいのであれば、次のようにします。\n1900年から...の間のアメリカに質問を限定することもできます。",
      "title": "パソコンがない時代、サラリーマンはどうやってグータッチをしていたのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个美国办公室的无人机。当我想从工作中休息一下时，我可以在互联网上拉出\n在互联网上查找任何东西。新闻、游戏、社交媒体，等等。在电脑普及之前，人们是如何在办公室里打发时间的呢？\n在电脑普及之前，人们是如何在办公室里打发时间的？如果你想更有针对性，我们可以\n将问题限定在1900年至......之间的美国。",
      "title": "在电脑出现之前，上班族是如何胡闹的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個美國辦公室的無人機。當我想從工作中休息一下時，我可以在互聯網上拉出\n在互聯網上查找任何東西。新聞、遊戲、社交媒體，等等。在電腦普及之前，人們是如何在辦公室裏打發時間的呢？\n在電腦普及之前，人們是如何在辦公室裏打發時間的？如果你想更有針對性，我們可以\n將問題限定在1900年至......之間的美國。",
      "title": "在電腦出現之前，上班族是如何胡鬧的？"
    }
  ]
}