{
  "author": "Two_Pickachu_One_Cup",
  "original_created_utc": 1653035844,
  "title": "Litecoins privacy upgrade has just activated without issue. This is a major milestone for Litecoin and privacy generally.",
  "created_utc": 1653057488,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s official, litecoins major privacy upgrade MWEB has now activated. Shortly you should see major exchanges rolling it out in the coming weeks.&lt;/p&gt;\n\n&lt;p&gt;Litecoin will have now has an optional privacy feature which will allow users to hide their address and crypto amounts when transferring (In addition to other features). This is a game changer for litecoin and a positive for those who like privacy in general, as it&amp;#39;s optional privacy feature allows it to be exchange friendly.&lt;/p&gt;\n\n&lt;p&gt;Due to the fact litecoin is available on most exchanges, it will be highly accessible and easy to use it&amp;#39;s privacy features.&lt;/p&gt;\n\n&lt;p&gt;In addition to the above, Litecoin will be one of the only coins to have smart contracts, nfts (omnilite upgrade) store of value (only 84 million to exist) brand recognition, has lasted 10 years survived multiple bear markets and to top it all off 100 percent uptime with low transaction fees. Not only that it is accepted everywhere bitcoin is accepted and has a growing not decreasing userbase.&lt;/p&gt;\n\n&lt;p&gt;This is a historic day for litecoin and privacy advocates. The day MWEB activated.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 304,
  "permalink": "/r/CryptoCurrency/comments/utoqtu/litecoins_privacy_upgrade_has_just_activated/",
  "subreddit": "CryptoCurrency",
  "id": "utoqtu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "It's official, litecoins major privacy upgrade MWEB has now activated. Shortly\nyou should see major exchanges rolling it out in the coming weeks.\n\nLitecoin will have now has an optional privacy feature which will allow users to\nhide their address and crypto amounts when transferring (In addition to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ライトコインのプライバシーに関するメジャーアップグレードMWEBが正式に稼動しました。間もなく\n主要な取引所では今後数週間のうちに導入される予定です。\n\nライトコインには、オプションでプライバシー機能が追加され、ユーザーは以下のことができるようになります。\n送金時にアドレスや暗号の量を隠すことができます。",
      "title": "ライトコインのプライバシーのアップグレードが問題なく作動しました。これはライトコインと一般的なプライバシーにとって大きなマイルストーンです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是官方的，litecoins的主要隐私升级MWEB现在已经激活。短期内\n你应该看到主要交易所在未来几周内推出它。\n\n利特币现在有了一个可选的隐私功能，这将允许用户在转账时\n在转移时隐藏他们的地址和加密货币金额（除了...",
      "title": "Litecoins的隐私升级刚刚激活，没有问题。这对利特币和隐私来说是一个重要的里程碑。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是官方的，litecoins的主要隱私升級MWEB現在已經激活。短期內\n你應該看到主要交易所在未來幾周內推出它。\n\n利特幣現在有了一個可選的隱私功能，這將允許用戶在轉賬時\n在轉移時隱藏他們的地址和加密貨幣金額（除了...",
      "title": "Litecoins的隱私升級剛剛激活，沒有問題。這對利特幣和隱私來說是一個重要的里程碑。"
    }
  ]
}