{
  "author": "Karn235",
  "the_new_excerpt": "Hi, I have been lurking here for a while now. Recently I began reading WSB more,\ncommenting, etc, because it helps numb the pain of my losses and adds some good\nlaughs. My interest in investing in $ROPE has also decreased. I just realized\nthat in my 7 years of \"investing\", I have never actually…",
  "original_created_utc": 1613136288,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "嗨，我已经在这里潜伏了一段时间了。最近我开始多看WSB。\n评论等，因为它有助于麻痹我失去的痛苦，并增加一些好的\n的笑声。我对投资$ROPE的兴趣也下降了。我才意识到\n在我7年的 \"投资 \"中，我从未真正... ...",
      "title": "有大事发生了!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嗨，我已經在這裏潛伏了一段時間了。最近我開始多看WSB。\n評論等，因爲它有助於麻痹我失去的痛苦，並增加一些好的\n的笑聲。我對投資$ROPE的興趣也下降了。我才意識到\n在我7年的 \"投資 \"中，我從未真正... ...",
      "title": "有大事發生了!"
    }
  ],
  "title": "SOMETHING BIG IS HAPPENING!",
  "created_utc": 1613153911,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi, I have been lurking here for a while now. Recently I began reading WSB more, commenting, etc, because it helps numb the pain of my losses and adds some good laughs. My interest in investing in $ROPE has also decreased. I just realized that in my 7 years of &quot;investing&quot;, I have never actually realized a profit. If my account had green, I&#39;d always think let&#39;s enjoy some gains just for a day or two, and then it would tank as soon as I&#39;d want to cash out a bit. This isn&#39;t even a casino at this point, I am simply just making charitable donations which are then gambled by other retards. I have even managed to lose money in real estate in Vancouver, where pretty much everyone and their wifes boyfriend has made money. </p>\n\n<p>I came to the realization that this is all a game and it could not possibly be real. The game isn&#39;t rigged, its fake! This must be a simulation. As soon as I click buy, the stock tanks, if I invest in a property the market tanks, even when I pick fruits/veggies at the market they expire instantly, when I hop in the shower the water turns freezing cold. Anyone else feel like this???</p>\n\n<p>If 2 retards who are experiencing this did the opposite of eachother, would one of them make money? Or would this possibly end the simulation as both aren&#39;t actually allowed to make money?</p>\n\n<p>EDIT: Thanking you guys for the advice, I am staying away from the market until I learn more, even it takes years. Enjoy the soon to come record breaking market growth!</p>\n</div><!-- SC_ON -->",
  "score": 3416,
  "permalink": "/r/wallstreetbets/comments/liaygp/something_big_is_happening/",
  "subreddit": "wallstreetbets",
  "id": "liaygp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728627607
}