{
  "author": "BerthjeTTV",
  "original_created_utc": 1633412731,
  "title": "El Salvador gets a lot of attention around mining with Geothermal energy, Iceland has been doing it since the very beginning of bitcoin mining",
  "created_utc": 1633426615,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>El Salvador gets attention as if it is the newest thing ever and that mining with geothermal energy has never been done before. Why? Iceland has been using geothermal energy to mine cryptocurrencies since 2018, That&#39;s about 3-4 years ago. </p>\n\n<p>And yes I know El Salvador is doing something about adoption of cryptocurrency (legal tender and stuff), that&#39;s good, but to me it&#39;s about why we think it&#39;s so special which has already been done 3-4 years ago.</p>\n\n<p><strong>Note: I love El Salvador and this is not an anti post or anything. I was just wondering why there is so much interest suddenly playing with geothermal energy mining.</strong></p>\n</div><!-- SC_ON -->",
  "score": 186,
  "permalink": "/r/CryptoCurrency/comments/q1og8q/el_salvador_gets_a_lot_of_attention_around_mining/",
  "subreddit": "CryptoCurrency",
  "id": "q1og8q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "El Salvador gets attention as if it is the newest thing ever and that mining\nwith geothermal energy has never been done before. Why? Iceland has been using\ngeothermal energy to mine cryptocurrencies since 2018, That's about 3-4 years\nago.\n\nAnd yes I know El Salvador is doing something about adoption…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "エルサルバドルは、あたかも最新のものであるかのように注目され、地熱を利用した採掘が\n地熱を利用した採掘はこれまでにないものであるかのように注目されています。なぜでしょう？アイスランドは、地熱を利用して\n地熱エネルギーを使って暗号通貨をマイニングしているのは2018年からで、That's about 3-4 years\n前ですね。\n\nそうそうエルサルバドルが採用について何かしているのは知っていますが...。",
      "title": "エルサルバドルでは地熱を利用したマイニングが注目されていますが、アイスランドではビットコインのマイニングが始まった当初から行っています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "萨尔瓦多受到关注，仿佛它是有史以来最新的事物，而且利用地热能源进行采矿是前所未有的。\n地热能源的开采是前所未有的。为什么呢？冰岛一直在利用\n自2018年以来，冰岛一直在使用地热能源来开采加密货币，这大约是3-4年的时间\n前。\n\n是的，我知道萨尔瓦多正在做一些关于采用...",
      "title": "萨尔瓦多在利用地热能源采矿方面得到了很多关注，冰岛从比特币开采的一开始就在做这件事。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "薩爾瓦多受到關注，彷彿它是有史以來最新的事物，而且利用地熱能源進行採礦是前所未有的。\n地熱能源的開採是前所未有的。爲什麼呢？冰島一直在利用\n自2018年以來，冰島一直在使用地熱能源來開採加密貨幣，這大約是3-4年的時間\n前。\n\n是的，我知道薩爾瓦多正在做一些關於採用...",
      "title": "薩爾瓦多在利用地熱能源採礦方面得到了很多關注，冰島從比特幣開採的一開始就在做這件事。"
    }
  ]
}