{
  "author": "colbysnumberonefan",
  "original_created_utc": 1653417991,
  "title": "Am I, a 21-year-old male, weird for dating an 18-year-old female (who was just under 18 when we first met)?",
  "created_utc": 1653447738,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;We met online a couple months before she turned 18. We ended up meeting in real life a couple months after she turned 18. I am 21, in my first year of university. She is 18, just graduated HS and about to start university.&lt;/p&gt;\n\n&lt;p&gt;A couple of my close friends know but I have not told most people because I feel like this is a taboo thing. For extra context, we are in Europe where the drinking age is 18 (personally I think the drinking age of 21 in America is weirdly high, as is the general consensus in Europe). &lt;/p&gt;\n\n&lt;p&gt;The age of consent where we live is 16, but even if it was 18 that would be fine because like I said, we didn&amp;#39;t actually meet until after she turned 18 (although we clearly knew we liked each other when she was a month or two away from 18). I am not worried about the legality because I know for a fact there are no legal issues here, I am worried about the ethics of it in the eyes of society.&lt;/p&gt;\n\n&lt;p&gt;Do you think I will I be seen as a creep by most people? Some people? Hardly any people? Just looking to get some opinions here.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 113,
  "permalink": "/r/TooAfraidToAsk/comments/uwxxfq/am_i_a_21yearold_male_weird_for_dating_an/",
  "subreddit": "TooAfraidToAsk",
  "id": "uwxxfq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "We met online a couple months before she turned 18. We ended up meeting in real\nlife a couple months after she turned 18. I am 21, in my first year of\nuniversity. She is 18, just graduated HS and about to start university.\n\nA couple of my close friends know but I have not told most people because I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "彼女が18歳になる数ヶ月前にネットで知り合いました。結局はリアルで会うことになったのですが\n彼女が18歳になってから数ヶ月後に現実の世界で会うことになりました。私は21歳、大学1年です。\n大学1年です。彼女は18歳で、高校を卒業したばかりで、これから大学に入学するところです。\n\n私の親しい友人の何人かは知っていますが、私はほとんどの人に言っていません。",
      "title": "21歳男性の私が18歳女性（最初に会った時は18歳弱）と付き合うのは変なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们是在她18岁前的几个月在网上认识的。我们最终在现实生活中见面\n在她18岁之后的几个月，我们在现实生活中相遇。我今年21岁，正在读大学一年级。\n大学一年级。她18岁，刚从高中毕业，即将开始上大学。\n\n我的几个亲密朋友知道，但我没有告诉大多数人，因为我...",
      "title": "我，一个21岁的男性，和一个18岁的女性（我们第一次见面时她还不到18岁）约会，是不是很奇怪？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們是在她18歲前的幾個月在網上認識的。我們最終在現實生活中見面\n在她18歲之後的幾個月，我們在現實生活中相遇。我今年21歲，正在讀大學一年級。\n大學一年級。她18歲，剛從高中畢業，即將開始上大學。\n\n我的幾個親密朋友知道，但我沒有告訴大多數人，因爲我...",
      "title": "我，一個21歲的男性，和一個18歲的女性（我們第一次見面時她還不到18歲）約會，是不是很奇怪？"
    }
  ]
}