{
  "author": "KND_DNK",
  "original_created_utc": 1634408831,
  "title": "What can a man do if a girl suddenly changes her mind and wants to keep the baby?",
  "created_utc": 1634424215,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It’s something I think about fairly often and it’s a scary thought. I’m only 21 and no where near planning or ready for a kid, and with the shit you sometimes read on the internet, you just start considering avoiding sex - woman lied about being on the pill, guy has to pay child support, woman didn’t want a kid but changed her mind - guy has to pay child support. </p>\n\n<p>It’s messed up and I want to know whether there is anything (I’m UK based) that can actually ‘protect’ you from this, apart from condoms (which are obvious) and undergoing surgery (vasectomy).</p>\n\n<p>Edit - because people are misinterpreting something VERY fucking important - IN THE MENTIONED SCENARIOS, I WOULD BE WEARING A CONDOM.</p>\n</div><!-- SC_ON -->",
  "score": 115,
  "permalink": "/r/NoStupidQuestions/comments/q9hmq7/what_can_a_man_do_if_a_girl_suddenly_changes_her/",
  "subreddit": "NoStupidQuestions",
  "id": "q9hmq7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It’s something I think about fairly often and it’s a scary thought. I’m only 21\nand no where near planning or ready for a kid, and with the shit you sometimes\nread on the internet, you just start considering avoiding sex - woman lied about\nbeing on the pill, guy has to pay child support, woman…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "かなりの頻度で考えることですが、怖いですよね。私はまだ21歳で\nまだ21歳で、子供を作る計画も準備もしていませんが、インターネットで時々読むクソ記事を見ると\n女性はピルを飲んでいると嘘をついた、男性は子供の養育費を払わなければならない、など。\n女はピルを飲んでいると嘘をつき、男は養育費を払わなければならず、女は...。",
      "title": "女の子が急に「産みたい」と気が変わったら、男性はどうすればいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是我经常思考的问题，这是个可怕的想法。我只有21岁\n我只有21岁，还没有计划或准备好要孩子，而且你有时会在互联网上读到的那些东西\n你会开始考虑避免性行为--女人谎称自己在服用避孕药，男人必须支付孩子的费用。\n女方谎称服用了避孕药，男方必须支付孩子的抚养费，女方......。",
      "title": "如果一个女孩突然改变主意，想保留孩子，男人能做什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是我經常思考的問題，這是個可怕的想法。我只有21歲\n我只有21歲，還沒有計劃或準備好要孩子，而且你有時會在互聯網上讀到的那些東西\n你會開始考慮避免性行爲--女人謊稱自己在服用避孕藥，男人必須支付孩子的費用。\n女方謊稱服用了避孕藥，男方必須支付孩子的撫養費，女方......。",
      "title": "如果一個女孩突然改變主意，想保留孩子，男人能做什麼？"
    }
  ]
}