{
  "author": "The_Manchurian",
  "original_created_utc": 1650979520,
  "title": "To what extent would modern Judaism be recognisable to a Jew from 1000 years ago? What about 2000 years ago?",
  "created_utc": 1650999524,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My impression is that a Jew of the Second Temple period would find a Judaism not revolving around the Temple and its priests quite strange, but I wondered what else would be different, and whether there would be the same difference between a Jew one thousand years later (so also long after the destruction of the temple) and today.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/uccivd/to_what_extent_would_modern_judaism_be/",
  "subreddit": "AskHistorians",
  "id": "uccivd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "My impression is that a Jew of the Second Temple period would find a Judaism not\nrevolving around the Temple and its priests quite strange, but I wondered what\nelse would be different, and whether there would be the same difference between\na Jew one thousand years later (so also long after the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の印象では、第二神殿時代のユダヤ人は、神殿や祭司を中心としないユダヤ教を\nしかし、それ以外に何が違うのだろうか。\n他に何が違うのだろうか、また、あるユダヤ人とあるユダヤ人の間に同じような違いがあるのだろうか、と。\n千年後のユダヤ人（つまり、第二神殿の時代からずっと後のユダヤ人）。",
      "title": "現代のユダヤ教は、1000年前のユダヤ人にどこまで認識されるのでしょうか。2000年前ならどうでしょう？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的印象是，一个第二圣殿时期的犹太人会发现犹太教不是\n我的印象是，第二圣殿时期的犹太人会觉得不围绕圣殿及其祭司的犹太教很奇怪，但我想知道还有什么不同？\n但我想知道还有什么不同，以及一千年后的犹太人（所以也是在《圣经》之后很久）是否也会有同样的不同。\n一千年后的犹太人（所以也是很久以前的事了）是否有同样的区别？",
      "title": "对于1000年前的犹太人来说，现代犹太教能在多大程度上被认出？那么2000年前呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的印象是，一個第二聖殿時期的猶太人會發現猶太教不是\n我的印象是，第二聖殿時期的猶太人會覺得不圍繞聖殿及其祭司的猶太教很奇怪，但我想知道還有什麼不同？\n但我想知道還有什麼不同，以及一千年後的猶太人（所以也是在《聖經》之後很久）是否也會有同樣的不同。\n一千年後的猶太人（所以也是很久以前的事了）是否有同樣的區別？",
      "title": "對於1000年前的猶太人來說，現代猶太教能在多大程度上被認出？那麼2000年前呢？"
    }
  ]
}