{
  "author": "goodfella27",
  "the_new_excerpt": "Wanted to share some of my research on Digital Turbine, which in my view isn’t\ngetting enough attention. The company owns a monopoly in the pre-load app space,\nhas a lot of exciting growth opportunities, and is a great long-term buy. The\nstock is up over 650% over the past 12 months, so the…",
  "original_created_utc": 1611593715,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "想和大家分享一下我对数字透平的一些研究，在我看来，数字透平不是\n得到足够的关注。该公司在预装应用领域拥有垄断地位。\n有很多令人兴奋的增长机会，是一个很好的长期买点。该\n股价在过去12个月里上涨了650%以上，所以... ...",
      "title": "全力以赴的帖子：DIGITAL TURBINE($APPS)1年内+650%，暗藏垄断。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "想和大家分享一下我對數字透平的一些研究，在我看來，數字透平不是\n得到足夠的關注。該公司在預裝應用領域擁有壟斷地位。\n有很多令人興奮的增長機會，是一個很好的長期買點。該\n股價在過去12個月裏上漲了650%以上，所以... ...",
      "title": "全力以赴的帖子：DIGITAL TURBINE($APPS)1年內+650%，暗藏壟斷。"
    }
  ],
  "title": "Full Diligence Post on DIGITAL TURBINE ($APPS) +650% in 1 year and a Hidden Monopoly",
  "created_utc": 1611616109,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Wanted to share some of my research on <strong>Digital Turbine,</strong> which in my view isn’t getting enough attention. The company owns a monopoly in the pre-load app space, has a lot of exciting growth opportunities, and is a great <strong>long-term</strong> buy. The stock is up over 650% over the past 12 months, so the valuation does seem stretched, but I could see the stock going to $100 within the next 6-12 months if the next few earnings calls don’t disappoint. </p>\n\n<p>Super long post, TLDR on the bottom. </p>\n\n<p><strong>What Does Digital Turbine Do?</strong> </p>\n\n<ul>\n<li>Digital Turbine has created digital software called <strong>Ignite</strong> and its flagship product <strong>Dynamic Installs</strong> (70% of revenue) automatically pre-loads apps onto the phone for the Android market ONLY. Basically, if you buy a new Android device and you see Uber or Starbucks installed when you first boot up the phone, Digital Turbine is likely the company behind that.</li>\n<li>Digital Turbine has <strong>additional products (30% of revenue)</strong> including: \n\n<ul>\n<li><strong>Wizard</strong> - a pop-up menu that shows up and asks users if they want to add apps onto their phone when booting up a new phone </li>\n<li><strong>SingleTap</strong> - a patented digital ad technology that allows users to frictionlessly download apps with one-click instead of having to go through multiple steps on the App Store </li>\n<li><strong>Notifications</strong> that pop on the user’s home screen recommending apps or content </li>\n</ul></li>\n</ul>\n\n<p><strong>Business Model</strong> </p>\n\n<ul>\n<li>The power of Digital Turbine’s business model comes from its <strong>extensive partnerships.</strong> The company has multi-year <strong>EXCLUSIVE</strong> contracts with many of the major phone <strong>carriers</strong> like Verizon and AT&amp;T, <strong>OEMs</strong> like Samsung and LG, and advertisers which consist of <strong>70% of the top apps</strong> on Google Play. </li>\n<li>To give you an example of how Digital Turbine makes money, let’s imagine Lyft wants to gain users on Android devices. Lyft could spend $100 marketing on Facebook or Snapchat to get new users but then they’re competing with the hundreds of thousands of other apps spending on ads, OR they could approach Digital Turbine and get a guaranteed number of pre-loaded apps onto phones for that same $100. Digital Turbine touts this to give companies a <strong>much better ROI.</strong> \n\n<ul>\n<li>Roughly a third of the revenue paid by an advertiser goes to the carrier, a third to the OEM, and a third to Digital Turbine </li>\n</ul></li>\n<li>Carriers and OEMs earn money from advertisers <strong>without much work on their end,</strong> while app developers are able to <strong>access millions of Android devices</strong> as long as their app is a good fit for the phone buyer </li>\n<li>To give you a sense of scale for the business, Digital Turbine to date has delivered <strong>4.2 billion apps,</strong> has its software on more than <strong>500 million phones,</strong> and is adding more than <strong>20 million new devices each month</strong> </li>\n</ul>\n\n<p><strong>Growth Prospects</strong> </p>\n\n<ul>\n<li>Macroeconomic / secular trends \n\n<ul>\n<li>Though most US users love their iPhones the Android market actually dominates with an <strong>80%+ market share worldwide,</strong> and this is not likely to change any time soon </li>\n<li>Due to COVID-19, a lot of retail stores had to shut down, which resulted in less new phone sales, which means less revenue for Digital Turbine. With the return of the economy and with <strong>the next wave of 5G phones</strong> which will push customers to upgrade phones, the next few years look favorable for the company </li>\n</ul></li>\n<li>Mobile Posse\n\n<ul>\n<li>The company acquired Mobile Posse, which provides carriers like Verizon and OEMs like Samsung the ability to show phone users third party content through two products: \n\n<ul>\n<li><strong>firstAPP</strong> which aggregates different media content and is shown right when a user unlocks the phone </li>\n<li><strong>firstPAGE</strong> which shows media content when a user opens the browser </li>\n</ul></li>\n<li>The transaction closed in February 2020 and is a great complementary add to Digital Turbine for 3 reasons: \n\n<ul>\n<li>The deal was extremely fair in price. Mobile Posse was acquired for $66 million but $24.5 million of that is an estimated earn-out. With the company having generated $59 million in 2019 revenue, the company was purchased <strong>just over 1x revenue which in my opinion is a steal</strong> considering the company has a 5-year CAGR of 48% and is profitable </li>\n<li>This acquisition makes Digital Turbine’s entire ecosystem more attractive to its partners by <strong>extending its product offerings throughout the life of the phone by being able to constantly show users content and ads.</strong> Mobile Posse’s content products will now consist of around a third of Digital Turbine’s revenue which is great because it decreases the company’s dependence on app pre-loads.  </li>\n<li>One of Mobile Posse’s primary carrier partners is <strong>T-Mobile</strong> which recently merged with <strong>Sprint</strong>, and this is the <strong>last major US carrier</strong> that Digital Turbine doesn’t have major business with. According to the latest earnings call, the CEO remains upbeat about signing T-Mobile and Sprint as partners, and the acquisition of Mobile Posse helps makes Digital Turbine more likely to sign on the carrier, which means more devices and an even stronger partnership network. </li>\n</ul></li>\n</ul></li>\n<li>International expansion \n\n<ul>\n<li>The third and most powerful opportunity for growth is international expansion. Currently, North America revenue accounts for roughly 65% of the company’s sales, but the <strong>real golden opportunity lies beyond in developing countries where Android is the dominant player.</strong> </li>\n<li>In December 2018, Digital Turbine signed on Samsung as a partner, which paved the way for the company to sign on Telefonica, Telecom Italia, America Movil, Millicom, and AT&amp;T Mexico in the past 1-2 years. Basically, this means Digital Turbine now <strong>partners with 2/3 of the OEMs in Latin America and an estimated 80% of mobile subscribers through carriers</strong> </li>\n<li>The company also has a partnership with Reliance Jio, which covers 25% of the 1 billion mobile subscribers in <strong>India</strong> and has a partnership with Xiaomi which could lead to partnerships in <strong>China</strong> </li>\n<li>All of this is to say that Digital Turbine is truly in the beginning stages of its international expansion, and I believe as investors are starting to see the company successfully execute, it’s beginning to draw more attention and hence why it’s stock has shot up over the past year </li>\n</ul></li>\n</ul>\n\n<p><strong>Financials</strong> </p>\n\n<ul>\n<li>In the latest quarterly earnings report, the company reported <strong>quarter over quarter revenue that is up 116%</strong> which is inflated due to the Mobile Posse acquisition but on a <strong>combined company basis, sales grew by 53%.</strong> </li>\n<li>The company also grew <strong>recurring revenue from 10% in the previous year to 40%</strong> which is a really good sign because it means revenue will be more reliable moving forward </li>\n<li>The company also reported <strong>43% gross margin</strong> in the quarter as compared to 39% in the previous year, another great sign </li>\n<li>Company has just about as much debt as cash (~$17mm) and is <strong>profitable and cash-flow positive</strong> </li>\n</ul>\n\n<p><strong>Risks &amp; mitigations</strong> </p>\n\n<ul>\n<li>First, is the <strong>valuation</strong>. Digital Turbine has experienced some explosive growth over the past year and in order to justify its share price, the company needs to execute well especially with its international expansion which is always tricky    \n\n<ul>\n<li>However, I do think the management team has shown that it has been making all the right moves and I think the path to future growth as I laid out earlier in the video will lead to some nice surprise developments in the next few years </li>\n</ul></li>\n<li>Second, in its 10K, one of the biggest risks is that <strong>carriers or OEMs may start building their own services</strong> to work with advertisers, and if a big customer like Verizon or AT&amp;T were to pull out their contracts, that would really hurt the company like when TikTok pulled from Fastly. \n\n<ul>\n<li>I think Digital Turbine is aware of this risk and that’s why it’s working hard to diversify its revenue stream by strengthening its product offerings through the acquisition of Mobile Posse and expanding internationally </li>\n</ul></li>\n<li>Lastly, there’s some criticism that Digital Turbine products are <strong>bloatware</strong>, and this would only be a problem if customers actually were turning away from devices because of the pre-loaded apps and home screen products Digital Turbine provides \n\n<ul>\n<li>Customers can always turn off any of Digital Turbine’s products and delete pre-loaded apps but more often than not, customers end up utilizing the company’s products in one form or another </li>\n</ul></li>\n</ul>\n\n<p><strong>What I’m Doing</strong> </p>\n\n<ul>\n<li>I’ve started a small position in the company a few weeks ago and plan to <strong>hold for the next few years</strong> </li>\n<li>Valuation looks a bit overstretched so I wouldn’t bet the farm on it at these prices but if the stock does have any major dips, I am going to treat them as major buying opportunities </li>\n<li><strong>Company’s earnings report is on February 3rd,</strong> which will be really interesting to see what happens. Last quarter, the company reported strong earnings but the stock dropped 16% and rebounded quickly </li>\n<li><strong>If the stock dips to the $30s or $40s, that would be an ideal great time to buy</strong> </li>\n</ul>\n\n<p><strong>Resources I looked at:</strong></p>\n\n<ul>\n<li><a href=\"https://content.equisolve.net/_30d071bd27396fdaf289982a9fa87921/digitalturbine/db/199/1906/pdf/Investor+Presentation+November+2020.pdf\">Latest investor presentation</a></li>\n<li><a href=\"https://www.bamsec.com/companies/317788/digital-turbine-inc\">10Qs and 10Ks</a></li>\n<li><a href=\"https://content.equisolve.net/_30d071bd27396fdaf289982a9fa87921/digitalturbine/db/199/1884/pdf/Mobile+Posse+Investor+Summary+FINAL.pdf\">Mobile Posse acquisition presentation</a></li>\n<li><a href=\"https://www.youtube.com/watch?v=MvDojDJFfvc\">Company presentation from a Digital Turbine director at a conference</a></li>\n</ul>\n\n<p><strong>TLDR:</strong> Company owns a monopoly in the Android pre-load app space with partnerships with the largest carriers and OEMs in the world not named Apple; lots of good growth prospects including its recent acquisition + international expansion. Expensive stock fundamentally right now but good one to keep an eye on if there are any major dips. Strong buy in the $30s-40s. Medium buy in the $50s. Earnings call on February 3rd should materially move the stock either up or down so will be important to pay attention to that.</p>\n</div><!-- SC_ON -->",
  "score": 68,
  "permalink": "/r/investing/comments/l4rxg4/full_diligence_post_on_digital_turbine_apps_650/",
  "subreddit": "investing",
  "id": "l4rxg4",
  "is_self": true,
  "media": null,
  "is_video": false
}