{
  "author": "1FlawedHumanBeing",
  "original_created_utc": 1645501596,
  "title": "Why does anyone even like dj khaled? All he does is awkwardly shout annoying things to ruin other people's music",
  "created_utc": 1645540626,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Maybe seeing him for the first time at the all star weekend NBA performance was a bad first impression? But he looks like a spherical chump, he can&amp;#39;t sing and he just awkwardly shouts while other people are trying to perform.  &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s like someone&amp;#39;s drunk uncle hopped on stage and tried to join in with the real musician you hired for the party, but just got on the way...&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t get it.  Why is this guy popular...?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/TooAfraidToAsk/comments/sydhn5/why_does_anyone_even_like_dj_khaled_all_he_does/",
  "subreddit": "TooAfraidToAsk",
  "id": "sydhn5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Maybe seeing him for the first time at the all star weekend NBA performance was\na bad first impression? But he looks like a spherical chump, he can't sing and\nhe just awkwardly shouts while other people are trying to perform.\n\nIt's like someone's drunk uncle hopped on stage and tried to join in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "オールスター・ウィークエンドのNBAパフォーマンスで初めて彼を見たのは、もしかしたら\n第一印象が悪い？でも、見た目は球体のチョンボ、歌は下手、そして\n他の人が演奏している間、彼はただぎこちなく叫んでいるだけです。\n\nまるで誰かの酔っ払ったおじさんがステージに飛び乗って参加しようとしてるみたい...。",
      "title": "なぜ皆、DJキャレドが好きなんだ？彼がやっていることは、他人の音楽を台無しにするような迷惑なことを不器用に叫んでいるだけだ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "也许第一次看到他在全明星周末的NBA表演是一个不好的第一印象。\n糟糕的第一印象？但他看起来像个球形的矮子，他不会唱歌，而且\n他只是笨拙地喊叫，而其他人正在努力表演。\n\n这就像某人喝醉了的叔叔跳上舞台并试图加入进来...",
      "title": "为什么会有人喜欢DJ KHALID？他所做的只是尴尬地喊出恼人的东西来破坏别人的音乐。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "也許第一次看到他在全明星週末的NBA表演是一個不好的第一印象。\n糟糕的第一印象？但他看起來像個球形的矮子，他不會唱歌，而且\n他只是笨拙地喊叫，而其他人正在努力表演。\n\n這就像某人喝醉了的叔叔跳上舞臺並試圖加入進來...",
      "title": "爲什麼會有人喜歡DJ KHALID？他所做的只是尷尬地喊出惱人的東西來破壞別人的音樂。"
    }
  ]
}