{
  "author": "203860CT",
  "original_created_utc": 1644458818,
  "title": "Spoke to my local congressman, and now he actually wants me to provide him with reputable sources on why crypto could help my state.",
  "created_utc": 1644482671,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The title says it generally, I had a rare opportunity to actually SPEAK to my elected representative, and he said the only things hes heard about cryptocurrency are “concerning”. Im looking for help on putting together a good list of reputable sources that i could provide to him so that he could see the value that the cryptocurrency and blockchain industries could bring to my state. I really would appreciate help on this matter as he really seemed to listen and i dont want to miss my opportunity to potentially put a good word in for cryptocurrency! Thanks!\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nEdit: I live in Connecticut and the representative is a Democrat! Forgot to mention that! Thank you so much to everyone who has replied so far this is exactly why i came to this sub!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 364,
  "permalink": "/r/CryptoCurrency/comments/soukpv/spoke_to_my_local_congressman_and_now_he_actually/",
  "subreddit": "CryptoCurrency",
  "id": "soukpv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The title says it generally, I had a rare opportunity to actually SPEAK to my\nelected representative, and he said the only things hes heard about\ncryptocurrency are “concerning”. Im looking for help on putting together a good\nlist of reputable sources that i could provide to him so that he could…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルの通りなのですが、実際に自分の担当者と話すという貴重な機会を得ました。\n彼は、自分が聞いたことのある唯一のことは、\"next \"だと言っていました。\n暗号通貨は「気になる」。私は、良いものをまとめる助けを求めています。\nこのような場合、私は彼に提供することができる評判の良いソースのリスト...",
      "title": "地元の下院議員に話をしたら、暗号がなぜ私の州を助けることができるのか、信頼できる情報源を提供するようにと言われました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "标题说得很清楚，我有一个难得的机会与我的民选代表实际交谈。\n我的当选代表，他说他唯一听到的关于\n加密货币是 \"令人担忧的\"。我想寻求帮助，把一个好的\n我想寻求帮助，把我可以提供给他的有信誉的来源的清单，以便他可以...",
      "title": "与我当地的国会议员交谈，现在他实际上希望我向他提供有信誉的来源，说明为什么加密货币可以帮助我的国家。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "標題說得很清楚，我有一個難得的機會與我的民選代表實際交談。\n我的當選代表，他說他唯一聽到的關於\n加密貨幣是 \"令人擔憂的\"。我想尋求幫助，把一個好的\n我想尋求幫助，把我可以提供給他的有信譽的來源的清單，以便他可以...",
      "title": "與我當地的國會議員交談，現在他實際上希望我向他提供有信譽的來源，說明爲什麼加密貨幣可以幫助我的國家。"
    }
  ]
}