{
  "author": "Always_Question",
  "original_created_utc": 1632328119,
  "title": "Urge Your Local Representative to Vote NO on the Infrastructure Bill",
  "created_utc": 1632353786,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The U.S. Congress is set to vote on Monday whether to pass the infrastructure bill, which includes multiple provisions that are damaging to Bitcoin and the LN. If passed, it could drive jobs and wealth overseas. It is bad for America. If you are American, you can make a difference by calling or emailing your local representative and urging them to vote NO on the infrastructure bill because it includes multiple provisions that are hostile toward Bitcoin.</p>\n\n<p><a href=\"https://www.house.gov/representatives/find-your-representative\">https://www.house.gov/representatives/find-your-representative</a></p>\n</div><!-- SC_ON -->",
  "score": 185,
  "permalink": "/r/Bitcoin/comments/ptb7vg/urge_your_local_representative_to_vote_no_on_the/",
  "subreddit": "Bitcoin",
  "id": "ptb7vg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The U.S. Congress is set to vote on Monday whether to pass the infrastructure\nbill, which includes multiple provisions that are damaging to Bitcoin and the\nLN. If passed, it could drive jobs and wealth overseas. It is bad for America.\nIf you are American, you can make a difference by calling or…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "米国議会は月曜日にインフラ法案を通過させるかどうかの投票を行う予定です。\n法案には、ビットコインやLNにダメージを与える複数の条項が含まれています。\nLNです。可決されれば、雇用や富を海外に追いやる可能性があります。それはアメリカにとって悪いことです。\nあなたがアメリカ人であれば、電話や...で変化を起こすことができます。",
      "title": "インフラ法案にNOを突きつけるよう、地元議員に働きかけよう"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "美国国会将于周一投票决定是否通过基础设施法案。\n法案，其中包括对比特币和LN有损害的多项规定。\nLN。如果通过，它可能将工作和财富推向海外。这对美国是不利的。\n如果你是美国人，你可以通过打电话或...",
      "title": "敦促您的当地代表对基础设施法案投反对票"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "美國國會將於週一投票決定是否通過基礎設施法案。\n法案，其中包括對比特幣和LN有損害的多項規定。\nLN。如果通過，它可能將工作和財富推向海外。這對美國是不利的。\n如果你是美國人，你可以通過打電話或...",
      "title": "敦促您的當地代表對基礎設施法案投反對票"
    }
  ]
}