{
  "author": "artisticdragon96",
  "the_new_excerpt": "They are the forefront in the AI Autonomous cyber security software market,\nthere is no other competitors besides Google, but does not have the patents and\nbroad variety of software that BB provides. Partnerships with the 19 of the top\n25 EV companies which make up 61% of the EV market. Not to…",
  "original_created_utc": 1612845342,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "他们是AI自主网络安全软件市场的佼佼者。\n除了谷歌，没有其他竞争对手，但没有专利和。\n种类繁多的软件，BB提供。与19个顶级的合作伙伴关系\n25家电动车企业，占据了电动车市场61%的份额。不到...",
      "title": "BB不是电话公司。这里有一些DD。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "他們是AI自主網絡安全軟件市場的佼佼者。\n除了谷歌，沒有其他競爭對手，但沒有專利和。\n種類繁多的軟件，BB提供。與19個頂級的合作伙伴關係\n25家電動車企業，佔據了電動車市場61%的份額。不到...",
      "title": "BB不是電話公司。這裏有一些DD。"
    }
  ],
  "title": "BB is not a phone company. Here’s some DD.",
  "created_utc": 1612851764,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>They are the forefront in the AI Autonomous cyber security software market, there is no other competitors besides Google, but does not have the patents and broad variety of software that BB provides. Partnerships with the 19 of the top 25 EV companies which make up 61% of the EV market. Not to mention the recent deal with ticker: BIDU to provide their QNX System to over 175 million EV’s. They’ve successfully moved on from their product sales of phones and at most majority of revenue comes from the software they provide to homes, stations, and EVs. </p>\n\n<p>They have completely wiped their department, obviously bringing in the Almighty papa chen who’s know for reviving software companies and who also announced today they signed a contract to provide power and cyber security to ISS for the next moon landing.</p>\n\n<p>If you look at the analytics of their department, they revamped the company completely. By browsing linkedin they have a 3:1 ratio of engineers to sales, which means they are keen on developing their product and not so worried about sales. </p>\n\n<p>Edit: I also want to point out by looking at the TA from February 2nd, BB is the only stock with a higher moving average to that of GME AMC and NOK. Throughout last week we can see it breaking the meme trend and acting on its own. Sorry I’m not sure how to add pictures but if you have the resources, you’ll see if you overlay all 4 stocks, they move very similar, but BB is the only one that breaks out right before market close. </p>\n\n<p>EOY target is $60</p>\n\n<p>BB Literally to the moon </p>\n\n<p>17c 3/5 @20</p>\n</div><!-- SC_ON -->",
  "score": 5348,
  "permalink": "/r/stocks/comments/lfuoe9/bb_is_not_a_phone_company_heres_some_dd/",
  "subreddit": "stocks",
  "id": "lfuoe9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123203793
}