{
  "author": "marshmallowcritter",
  "original_created_utc": 1629029099,
  "title": "What is the science behind Fomite transmission and Covid-19?",
  "created_utc": 1629041066,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My husband is still incredibly concerned of the likelihood of getting Covid via fomite transmission - we still remove all our grocieries from packages and place them in reusable containers, freezer bags, etc. Almost no outside packages are allowed inside the home unless completely sanitized, etc.</p>\n\n<p>I am looking for the science behind fomite transmission and covid-19 - how likely is it to catch covid via fomite transmission, how viable is the virus, etc? </p>\n\n<p>Thank you.</p>\n</div><!-- SC_ON -->",
  "score": 146,
  "permalink": "/r/askscience/comments/p4s7nl/what_is_the_science_behind_fomite_transmission/",
  "subreddit": "askscience",
  "id": "p4s7nl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My husband is still incredibly concerned of the likelihood of getting Covid via\nfomite transmission - we still remove all our grocieries from packages and place\nthem in reusable containers, freezer bags, etc. Almost no outside packages are\nallowed inside the home unless completely sanitized, etc.\n\nI…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の夫は、コヴィドの感染について非常に心配しています。\n私たちは今でもパッケージからすべての食料品を取り出し、再利用可能な容器やフリーザーバッグなどに入れています。\n食料品はすべてパッケージから取り出し、再利用可能な容器やフリーザーバッグなどに入れています。完全に衛生的でない限り、外からの荷物はほとんどありません。\n完全に消毒されていない限り、外の荷物はほとんど家の中に入れません。\n\nI...",
      "title": "Fomiteの感染とCovid-19の科学的根拠は何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我丈夫仍然非常担心通过虫媒传播感染Covid的可能性。\n我们仍然把所有的食品从包装中取出，放在可重复使用的容器、冷冻袋等中。\n放在可重复使用的容器、冷冻袋中，等等。几乎没有外面的包裹是\n除非完全消毒，否则几乎不允许在家里使用。\n\nI...",
      "title": "Fomite传播和Covid-19背后的科学是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我丈夫仍然非常擔心通過蟲媒傳播感染Covid的可能性。\n我們仍然把所有的食品從包裝中取出，放在可重複使用的容器、冷凍袋等中。\n放在可重複使用的容器、冷凍袋中，等等。幾乎沒有外面的包裹是\n除非完全消毒，否則幾乎不允許在家裏使用。\n\nI...",
      "title": "Fomite傳播和Covid-19背後的科學是什麼？"
    }
  ]
}