{
  "author": "Geddy87",
  "original_created_utc": 1632764652,
  "title": "Anyone else feel like crypto is there ONLY CHANCE?",
  "created_utc": 1632778364,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have worked my butt off most my life and don’t have much to show for it, injuries and illness have taken there toll and bad choices didn’t help achieve most goals . My paycheques cover my bills but don’t really offer much in the means of security ,and when I’ve had an injury or I’ve gotten sick ; any savings has been depleted rather quickly. I invest in crypto not only cause I believe in it but because that hope that it can give me a better quality of life is really something I need. Anyone else feel like they will never get ahead unless their  investments pay off or they hit the lottery or something?</p>\n</div><!-- SC_ON -->",
  "score": 301,
  "permalink": "/r/CryptoCurrency/comments/pwmbzk/anyone_else_feel_like_crypto_is_there_only_chance/",
  "subreddit": "CryptoCurrency",
  "id": "pwmbzk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I have worked my butt off most my life and don’t have much to show for it,\ninjuries and illness have taken there toll and bad choices didn’t help achieve\nmost goals . My paycheques cover my bills but don’t really offer much in the\nmeans of security ,and when I’ve had an injury or I’ve gotten sick ;…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は人生の大半を懸命に働いてきましたが、それを示すものはあまりありません。\n怪我や病気に悩まされたり、間違った選択をしたりして、ほとんどの目標を達成できませんでした。\n目標を達成することができませんでした。給料は生活費をまかなってくれますが、安心感という意味ではあまりありません。\n怪我をしたり、病気になったりしたときには...。",
      "title": "暗号が唯一のチャンスだと感じている人はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我大半辈子都在拼命工作，但却没有什么可炫耀的。\n伤病让我付出了代价，错误的选择也无助于实现我的大部分目标。\n大多数目标。我的工资可以支付我的账单，但并没有真正提供多少保障。\n当我受伤或生病时；......",
      "title": "还有人觉得加密货币是唯一的机会吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我大半輩子都在拼命工作，但卻沒有什麼可炫耀的。\n傷病讓我付出了代價，錯誤的選擇也無助於實現我的大部分目標。\n大多數目標。我的工資可以支付我的賬單，但並沒有真正提供多少保障。\n當我受傷或生病時；......",
      "title": "還有人覺得加密貨幣是唯一的機會嗎？"
    }
  ]
}