{
  "author": "wuzzgucci",
  "original_created_utc": 1637292433,
  "title": "What's the next metaverse play with high ROI left in it? Here's my research from today.",
  "created_utc": 1637311389,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Okay just did a ton of research… I have $3k to spend tomorrow and I kind of want to invest in the metaverse at a low entry that still hasn’t had a huge run up for some nice ROI (I know that means more risk…). The bullet list is what I&#39;m thinking… what do you guys think? How would you invest it?</p>\n\n<p>Once most of these games release, they prob will have another run up huh? Then they will all consolidate/rise long term based on what people actually enjoy playing.</p>\n\n<p>I’m looking at going all in on <strong>ROSE</strong>. They just partnered with Facebook/Meta yesterday. It&#39;s on KuCoin.</p>\n\n<p>Also, even though the narrative is around metaverse, what projects are actually looking to be used in VR? I know VRChat is another popular metaverse but isn’t on the blockchain to invest in.</p>\n\n<ul>\n<li><strong>MANA / DECENTRALAND</strong> - The obvious leader in a decentralized metaverse, I’d say like the bitcoin equivalent.</li>\n<li><strong>SANDBOX</strong> - Prob a better play now for ROI, the ethereum equivalent. Brands buying virtual real estate here. It’s still only 2.6 billion in market cap compared to MANA’s 5 billion market cap. Lots of room to grow still yeah?</li>\n<li><strong>OASIS/ROSE</strong> - They just announced their partnership with Facebook/Meta. Their name is also the same Oasis from Ready Player One...</li>\n<li><strong>NTVRK</strong> - Just went through the dip a bit… You can buy space, land, ads, nfts, staking. Focus on virtual reality and augmented reality. They’re not just focused in the game side version of metaverse but the roadmap extends into virtual and augmented reality where the metaverse will start evolving into. MANA is only 2D.</li>\n<li><strong>CUBE</strong> - Metaverse that actually has VR capabilities.</li>\n<li><strong>WILDER WORLD</strong> - Graphics look dope. The price does seem extremely volatile. Not yet released.</li>\n<li><strong>STAR ATLAS</strong> - High budget looking space exploration game. Not yet released. Built on Solana… could have a nice run up.</li>\n<li><strong>GALA</strong> - They create blockchain games. Still only 7 cents. Price is moving slow.</li>\n<li><strong>ILLUVIUM</strong> - Built on the ethereum blockchain. Turned based game. Not yet released.</li>\n<li><strong>MVI</strong> - A metaverse index with a bunch of metaverse based projects. Seems like the safest investment. Slow and steady.</li>\n<li><strong>RNDR</strong> - Graphics engine built for the metaverse.</li>\n<li><strong>BLOK</strong> - Cyberpunk skyscraper. Still not released. Graphics look a bit meh… It’s highest was 16 cents and been on a downtrend since then.</li>\n<li><strong>REDFOX</strong> - Just went through a big dip so it has a good entry price right now. Possible potential for gains.</li>\n<li><strong>ENJ</strong> - Could be the safest long term play. Might not have the momentum for gains anymore though. Fundamentally it’ll be useful for centralized and decentralized games to create NFTS. Less niche and more longer play.</li>\n<li><strong>SHIRYO INU</strong> - Fantasy NFT trading card game. Super early entry. Fractions of a cent.</li>\n<li><strong>MERIT CIRCLE</strong> - Partnering with Illuvium, Star Atlas, and Axie Infinity. Seems like it could be vital for gaming and play to earn.</li>\n<li><strong>UFO</strong> - Fractions of a cent.. not yet super accessible to buy. Community owned.</li>\n<li><strong>VRA</strong> - Currently 7 cents, could hit 25 cents?</li>\n<li><strong>OVR</strong> - Mapping the real world virtually that you can scan the world with your phone.</li>\n<li><strong>METAHERO</strong> - Trending on Tiktok. Another thing that scans real world objects.</li>\n<li><strong>KALAO</strong> - Avalanches metaverse.</li>\n</ul>\n\n<p>Where do you guys think the metaverse narrative is going? I think there will be that high budget metaverse that Meta/Facebook is creating, but there might be a group of people that would prefer a decentrilized/community made version of that like Decentraland (MANA) and The Sandbox (SAND).I think some people will think this metaverse is something you need to live in from an outside perspective but in reality it really isn&#39;t. Personally VR for me has been about games; where if something dope comes out, I&#39;ll play that game till it&#39;s done like if I were playing it on a flat screen and then I&#39;m done. Entertainment for the moment rather than living for it.</p>\n\n<p>Isn&#39;t metaverse just basically what VRChat is? I think the metaverse will basically make Facebook more &quot;present&quot; than posting a status which is &quot;passive&quot;. But beyond that stage, what if the metaverse evolves into something that is functional and day to day where it dissolves into the background of your daily routine through augmented reality? Once it gets to a point where you can wear Ray Bans and people don&#39;t know you&#39;re connected to the augmented reality metaverse seems like the next level.</p>\n\n<p>Going about your day you usually do but with a holographic layer so the real world integrates with the metaverse with the internet of things. What if it gets to a point where you can close your glasses for full immersion (VR) and then open your glasses for AR?</p>\n</div><!-- SC_ON -->",
  "score": 280,
  "permalink": "/r/CryptoCurrency/comments/qx73x6/whats_the_next_metaverse_play_with_high_roi_left/",
  "subreddit": "CryptoCurrency",
  "id": "qx73x6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Okay just did a ton of research… I have $3k to spend tomorrow and I kind of want\nto invest in the metaverse at a low entry that still hasn’t had a huge run up\nfor some nice ROI (I know that means more risk…). The bullet list is what I'm\nthinking… what do you guys think? How would you invest…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "明日3,000ドルの予算があるので、メタバースに投資したいと思っています。\nメタバースに投資したいのですが、まだ大きく上昇していない低価格のエントリーで\nいいROIが得られるように。箇条書きのリストは私が考えていることです。\n皆さんはどう思いますか？あなたならどうやって投資しますか...？",
      "title": "高いROIが残されている次のメタバースの遊びとは？今日の私の調査結果です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，我刚刚做了大量的研究......我明天有3千美元要花，我有点想\n我想在一个低价位投资元数据，而且还没有大的涨幅。\n以获得不错的投资回报率（我知道这意味着更多的风险...）。这张清单是我的想法。\n你们怎么想的？你会如何投资...",
      "title": "下一个有高投资回报率的元数据游戏是什么？这是我今天的研究。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，我剛剛做了大量的研究......我明天有3千美元要花，我有點想\n我想在一個低價位投資元數據，而且還沒有大的漲幅。\n以獲得不錯的投資回報率（我知道這意味着更多的風險...）。這張清單是我的想法。\n你們怎麼想的？你會如何投資...",
      "title": "下一個有高投資回報率的元數據遊戲是什麼？這是我今天的研究。"
    }
  ]
}