{
  "author": "PunPryde",
  "original_created_utc": 1629612419,
  "title": "Bitcoin is on the verge of closing out 5 green weeks in a row. Last time this happened BTC went from $10K to $64K. We may be at the start of a new bull super cycle.",
  "created_utc": 1629621615,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If Bitcoin holds above $44K today it will close out the 5th green week in a row. The last time this happened was in October-November 2020. After that the price went from $10K to it&#39;s ATH of $64K. Now we are tracking in the same direction and this could be the start of a new bull cycle that takes us back to ATH and maybe even to $100,000 Bitcoin. </p>\n\n<p>If you missed out buying in July 2021 at the very start of this bull run, the second best time to buy is now. Last time BTC ran for 7 weeks in a row and it was only the start of a huge 600%+ rally. So even buying now may only be the start of the bull cycle. Stack those sats while you can!</p>\n</div><!-- SC_ON -->",
  "score": 228,
  "permalink": "/r/CryptoCurrency/comments/p97acv/bitcoin_is_on_the_verge_of_closing_out_5_green/",
  "subreddit": "CryptoCurrency",
  "id": "p97acv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "If Bitcoin holds above $44K today it will close out the 5th green week in a row.\nThe last time this happened was in October-November 2020. After that the price\nwent from $10K to it's ATH of $64K. Now we are tracking in the same direction\nand this could be the start of a new bull cycle that takes us…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコインが今日44Kドル以上を維持すれば、5回目のグリーンウィークを連続して締めくくることになる。\nこれが最後に起こったのは、2020年10月から11月だった。その後、価格は\n10,000ドルから最高値の64,000ドルまで上昇しました。今は同じ方向に追跡しています\nそして、これは私たちを連れて行く新しいブルサイクルの始まりかもしれません...",
      "title": "ビットコインは5週連続でグリーンウィークを締めくくる寸前だ。前回このようなことが起こったとき、BTCは10Kドルから64Kドルになりました。私たちは新しいブル・スーパーサイクルの始まりかもしれない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果比特币今天保持在4.4万美元以上，它将连续第五周保持绿色。\n上一次发生这种情况是在2020年10-11月。在那之后，价格\n从1万美元涨到了6.4万美元的最高价。现在我们正朝着同一方向追踪\n这可能是一个新的牛市周期的开始，将带领我们......",
      "title": "比特币即将连续收出5个绿色星期。上一次发生这种情况时，BTC从10K美元涨到了64K美元。我们可能正处于一个新的牛市超级周期的开始。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果比特幣今天保持在4.4萬美元以上，它將連續第五週保持綠色。\n上一次發生這種情況是在2020年10-11月。在那之後，價格\n從1萬美元漲到了6.4萬美元的最高價。現在我們正朝着同一方向追蹤\n這可能是一個新的牛市週期的開始，將帶領我們......",
      "title": "比特幣即將連續收出5個綠色星期。上一次發生這種情況時，BTC從10K美元漲到了64K美元。我們可能正處於一個新的牛市超級週期的開始。"
    }
  ]
}