{
  "author": "Many_Arm7466",
  "original_created_utc": 1634591597,
  "title": "What to do when wife has really expensive taste?",
  "created_utc": 1634604538,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As the title says I have a bit of a wife problem...</p>\n\n<p>I am trying to DCA my way into an early retirement and have our mortgage payed off but my wife has insanely expensive taste. And this is really impacting the amount I have to DCA into Crypto every week. </p>\n\n<p>I am the primary income maker for my family but she is by far the biggest spender. She always wants to go out to expensive places to eat, has really expensive up keep costs such as her hair and nails done. She is addicted to designer handbags, shopping and clothing, and is angry that we don’t go on vacation enough(we go once a year) and of course all of this is at my expense. And to be Frank I’m not quite sure what to do.</p>\n\n<p>I have tried explaining to her the importance of Crypto investments and it could fast track our financial goals but she doesn’t seem to care. Then most recently she has been bothering me about a new car and insists I take profits from my portfolio(mistake showing her how much I’m up).</p>\n\n<p>So how are you guys dealing with your wives? Are they in support or against your DCA efforts? And any advice for my situation?</p>\n</div><!-- SC_ON -->",
  "score": 284,
  "permalink": "/r/CryptoCurrency/comments/qaw2v0/what_to_do_when_wife_has_really_expensive_taste/",
  "subreddit": "CryptoCurrency",
  "id": "qaw2v0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As the title says I have a bit of a wife problem...\n\nI am trying to DCA my way into an early retirement and have our mortgage payed\noff but my wife has insanely expensive taste. And this is really impacting the\namount I have to DCA into Crypto every week.\n\nI am the primary income maker for my family…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルにあるように、私にはちょっとした妻の問題があります...。\n\n私は早期退職に向けてDCAを実践し、住宅ローンを完済しようとしています。\nしようとしているのですが、妻の趣味がめちゃくちゃ高いんです。このことが、私がCryのためにDCAを回す金額に影響を与えています。\n私が毎週暗号化しなければならない量に影響を与えています。\n\n私は家族の主な収入源ですから...。",
      "title": "奥さんの趣味がすごく高い場合はどうしたらいい？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "正如标题所说，我有一个妻子的问题......。\n\n我正试图用DCA的方式提前退休，并将我们的抵押贷款付清。\n但我妻子的品味太高了。这真的影响了\n我每周必须向加密货币投入的金额。\n\n我是家庭的主要收入来源...",
      "title": "当妻子的品味非常昂贵时，该怎么办呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "正如標題所說，我有一個妻子的問題......。\n\n我正試圖用DCA的方式提前退休，並將我們的抵押貸款付清。\n但我妻子的品味太高了。這真的影響了\n我每週必須向加密貨幣投入的金額。\n\n我是家庭的主要收入來源...",
      "title": "當妻子的品味非常昂貴時，該怎麼辦呢？"
    }
  ]
}