{
  "author": "dragondude4",
  "original_created_utc": 1636321465,
  "title": "Crypto.com has been doing a great job with marketing campaigns bringing crypto to the mainstream. If they upgrade their interface and lower their fees, they could easily be a top exchange.",
  "created_utc": 1636333948,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Crypto.com has been going insane with its marketing. From Formula 1 to Twitch to the UFC and Matt Damon. So many people see their logo on the daily. It’s probably been the reason why CRO has been rallying recently. It’s great to see crypto adoption spreading in the mainstream and Crypto.com has been spending a lot of money to make that happen. </p>\n\n<p>I think Crypto.com has the potential to be one of the best and largest exchange out there, I just wish they would spend some of that marketing money to improve their exchange. Get more trading pairs, a better interface, lower fees, easier fiat onramps and they could easily beat Binance. They also have a kickass debit card program. </p>\n\n<p>Hope they use this opportunity to become a great exchange.</p>\n</div><!-- SC_ON -->",
  "score": 302,
  "permalink": "/r/CryptoCurrency/comments/qoyltl/cryptocom_has_been_doing_a_great_job_with/",
  "subreddit": "CryptoCurrency",
  "id": "qoyltl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Crypto.com has been going insane with its marketing. From Formula 1 to Twitch to\nthe UFC and Matt Damon. So many people see their logo on the daily. It’s\nprobably been the reason why CRO has been rallying recently. It’s great to see\ncrypto adoption spreading in the mainstream and Crypto.com has been…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Crypto.comは、そのマーケティングに非常に大きな影響を与えています。F1からTwitch、そして\nUFCやマット・デイモンまで。多くの人が毎日のように彼らのロゴを目にしています。それが\nそれがCROの最近の上昇の理由だと思います。これは素晴らしいことです。\nまた、Crypto.comは...",
      "title": "Crypto.comは、暗号を主流にするためのマーケティングキャンペーンで素晴らしい仕事をしています。インターフェイスをアップグレードして手数料を下げれば、トップの取引所になることは間違いありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Crypto.com在营销方面一直处于疯狂状态。从一级方程式到Twitch到\nUFC和Matt Damon。这么多的人每天都看到他们的标志。这可能是\n可能是CRO最近一直在反弹的原因。很高兴看到\n很高兴看到加密货币的采用在主流中蔓延，Crypto.com一直在...",
      "title": "Crypto.com在营销活动方面一直做得很好，将加密货币带入主流。如果他们升级他们的界面并降低他们的费用，他们可以很容易地成为一个顶级交易所。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Crypto.com在營銷方面一直處於瘋狂狀態。從一級方程式到Twitch到\nUFC和Matt Damon。這麼多的人每天都看到他們的標誌。這可能是\n可能是CRO最近一直在反彈的原因。很高興看到\n很高興看到加密貨幣的採用在主流中蔓延，Crypto.com一直在...",
      "title": "Crypto.com在營銷活動方面一直做得很好，將加密貨幣帶入主流。如果他們升級他們的界面並降低他們的費用，他們可以很容易地成爲一個頂級交易所。"
    }
  ]
}