{
  "author": "veryeducatedinvestor",
  "original_created_utc": 1624391273,
  "title": "I hate to be that guy, but don't get overly excited until we are trending up for multiple weeks or longer.",
  "created_utc": 1624404832,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It literally takes just a few hours of green candles for everyone to go ape shit about how the bull run is resuming and start saying &quot;I told you so.&quot;</p>\n\n<p>We don&#39;t have any idea whether the green will continue, or if this is just another false flag.</p>\n\n<p>June 12 to June 15 we went from 1.4T to 1.7T and things were looking pretty sweet. That was promptly followed by a bloodbath retrace to 1.1T this morning.</p>\n\n<p>Keep your head on straight and stick to your plan.</p>\n</div><!-- SC_ON -->",
  "score": 191,
  "permalink": "/r/CryptoCurrency/comments/o5vker/i_hate_to_be_that_guy_but_dont_get_overly_excited/",
  "subreddit": "CryptoCurrency",
  "id": "o5vker",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It literally takes just a few hours of green candles for everyone to go ape shit\nabout how the bull run is resuming and start saying \"I told you so.\"\n\nWe don't have any idea whether the green will continue, or if this is just\nanother false flag.\n\nJune 12 to June 15 we went from 1.4T to 1.7T and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "文字通り、緑のローソクが数時間続いただけで、誰もが「ブルランが再開された」と大騒ぎして\nブルランが再開され、\"I told you so \"と言い始めるまでには、ほんの数時間しかかかりません。\n\n緑が続くのか、それともこれがただの偽旗なのか、見当もつきません。\n偽旗ではないかと思います。\n\n6月12日から6月15日にかけて、1.4Tから1.7Tになり、そして...。",
      "title": "こんなことは言いたくありませんが、複数週以上にわたって上昇トレンドが続くまでは、過度な期待は禁物です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "仅仅需要几个小时的绿色蜡烛，每个人都会大吃一惊。\n说牛市运行如何恢复，并开始说 \"我告诉过你\"。\n\n我们不知道绿色是否会继续，或者这只是\n另一个假标志。\n\n6月12日至6月15日，我们从1.4T到1.7T，并且...",
      "title": "我不想成为这样的人，但是在我们连续多周或更长时间呈上升趋势之前，不要过度兴奋。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "僅僅需要幾個小時的綠色蠟燭，每個人都會大喫一驚。\n說牛市運行如何恢復，並開始說 \"我告訴過你\"。\n\n我們不知道綠色是否會繼續，或者這只是\n另一個假標誌。\n\n6月12日至6月15日，我們從1.4T到1.7T，並且...",
      "title": "我不想成爲這樣的人，但是在我們連續多周或更長時間呈上升趨勢之前，不要過度興奮。"
    }
  ]
}