{
  "approved_at_utc": null,
  "subreddit": "wallstreetbets",
  "selftext": "Ever since GME happened I have learned _so much_ about the world of finance from all of the incredibly well-researched, intelligent, and informed DD posted by apes on reddit. Of course at this point everybody knows about DRSing your shares because it's the only way to actually own your shares and that everybody else in the entire financial market who _doesn't_ DRS their shares is an idiot. We know that.\n\nBut I'm not sure all of you understand just how deep this all goes.\n\nIt's one thing for **them** to pull this funny money crap with _stocks_, which are barely even a real thing anyway. But did you know that **they** are even pulling tricks with your hard-earned _cash_???\n\nThat's right, you might think that cold hard cash is a simple thing to keep track of. And of course the typical normie thinks that when you deposit your cash in a bank account the bank holds the cash in your name. BUT I HAVE UNCOVERED THAT THIS IS NOT THE CASE!! The very same bank that _you_ are currently trusting with your cash is currently doing things like:\n\n* Mixing it with all their other cash and showing it on their balance sheets  \n* Lending that cash out - to just anybody! - even the hedgies who are currently shorting your shares  \n* Earning interest which doesn't all come back to you\n\n**Do you know where your cash is right now?** You may think you do, but you don't. It could be anywhere, it could even be going to Citadel or something. That's right. What an atrocity.\n\nI know this is a lot for me to dump on you here, but don't worry - I have a solution. That's right. I am starting the first-ever service where ANY fellow ape can **Direct Register Your Cash**.\n\nALL you have to do is send me a DM with your full name, social security number and bank account number to initiate the process. Then, call up your bank and demand to send _all_ of your cash via a wire transfer to my new company. The rep on the phone may ask you questions like \"do you know who you're sending your money to\" and \"are you aware that this transfer is not reversible?\" Don't worry - it's just a script that they have to read because the damn hedgies are desperate to keep their scam going.\n\nOnce you've sent me your cash, I promise to _personally_ register every bill and coin in _your_ name by stamping each one with all the personal info you send me, thereby ensuring that you are directly in control of your cash. For a small fee, I will send you a picture of your stamped cash, and for an additional small fee, you can continue to acquire more cash and send it to your account with me.\n\nI know that things out there are stacked against us, but if all of us can band together and direct register our cash, we can suck the energy out of the system that these damn hedgies are using to keep us down. Tell your friends, tell your family, and _definitely_ tell all the apes you know: direct register your cash today!!!",
  "author_fullname": "t2_4mxot",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Do you all realize how deep this goes???",
  "link_flair_richtext": [
    {
      "e": "text",
      "t": "Shitpost"
    }
  ],
  "subreddit_name_prefixed": "r/wallstreetbets",
  "hidden": false,
  "pwls": 7,
  "link_flair_css_class": "shitpost",
  "downs": 0,
  "thumbnail_height": null,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_rcy65r",
  "quarantine": false,
  "link_flair_text_color": "light",
  "upvote_ratio": 0.79,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 1352,
  "total_awards_received": 13,
  "media_embed": {},
  "thumbnail_width": null,
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Shitpost",
  "can_mod_post": false,
  "score": 1352,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "self",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {
    "gid_1": 1
  },
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1639104373,
  "link_flair_type": "richtext",
  "wls": 7,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.wallstreetbets",
  "allow_live_comments": true,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Ever since GME happened I have learned &lt;em&gt;so much&lt;/em&gt; about the world of finance from all of the incredibly well-researched, intelligent, and informed DD posted by apes on reddit. Of course at this point everybody knows about DRSing your shares because it&amp;#39;s the only way to actually own your shares and that everybody else in the entire financial market who &lt;em&gt;doesn&amp;#39;t&lt;/em&gt; DRS their shares is an idiot. We know that.&lt;/p&gt;\n\n&lt;p&gt;But I&amp;#39;m not sure all of you understand just how deep this all goes.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s one thing for &lt;strong&gt;them&lt;/strong&gt; to pull this funny money crap with &lt;em&gt;stocks&lt;/em&gt;, which are barely even a real thing anyway. But did you know that &lt;strong&gt;they&lt;/strong&gt; are even pulling tricks with your hard-earned &lt;em&gt;cash&lt;/em&gt;???&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s right, you might think that cold hard cash is a simple thing to keep track of. And of course the typical normie thinks that when you deposit your cash in a bank account the bank holds the cash in your name. BUT I HAVE UNCOVERED THAT THIS IS NOT THE CASE!! The very same bank that &lt;em&gt;you&lt;/em&gt; are currently trusting with your cash is currently doing things like:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Mixing it with all their other cash and showing it on their balance sheets&lt;br/&gt;&lt;/li&gt;\n&lt;li&gt;Lending that cash out - to just anybody! - even the hedgies who are currently shorting your shares&lt;br/&gt;&lt;/li&gt;\n&lt;li&gt;Earning interest which doesn&amp;#39;t all come back to you&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;Do you know where your cash is right now?&lt;/strong&gt; You may think you do, but you don&amp;#39;t. It could be anywhere, it could even be going to Citadel or something. That&amp;#39;s right. What an atrocity.&lt;/p&gt;\n\n&lt;p&gt;I know this is a lot for me to dump on you here, but don&amp;#39;t worry - I have a solution. That&amp;#39;s right. I am starting the first-ever service where ANY fellow ape can &lt;strong&gt;Direct Register Your Cash&lt;/strong&gt;.&lt;/p&gt;\n\n&lt;p&gt;ALL you have to do is send me a DM with your full name, social security number and bank account number to initiate the process. Then, call up your bank and demand to send &lt;em&gt;all&lt;/em&gt; of your cash via a wire transfer to my new company. The rep on the phone may ask you questions like &amp;quot;do you know who you&amp;#39;re sending your money to&amp;quot; and &amp;quot;are you aware that this transfer is not reversible?&amp;quot; Don&amp;#39;t worry - it&amp;#39;s just a script that they have to read because the damn hedgies are desperate to keep their scam going.&lt;/p&gt;\n\n&lt;p&gt;Once you&amp;#39;ve sent me your cash, I promise to &lt;em&gt;personally&lt;/em&gt; register every bill and coin in &lt;em&gt;your&lt;/em&gt; name by stamping each one with all the personal info you send me, thereby ensuring that you are directly in control of your cash. For a small fee, I will send you a picture of your stamped cash, and for an additional small fee, you can continue to acquire more cash and send it to your account with me.&lt;/p&gt;\n\n&lt;p&gt;I know that things out there are stacked against us, but if all of us can band together and direct register our cash, we can suck the energy out of the system that these damn hedgies are using to keep us down. Tell your friends, tell your family, and &lt;em&gt;definitely&lt;/em&gt; tell all the apes you know: direct register your cash today!!!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "d609e434-b97f-11ea-a39e-0ea715edff61",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2th52",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#7a5901",
  "id": "rcy65r",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "TheHiveMindSpeaketh",
  "discussion_type": null,
  "num_comments": 215,
  "send_replies": true,
  "whitelist_status": "some_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/wallstreetbets/comments/rcy65r/do_you_all_realize_how_deep_this_goes/",
  "parent_whitelist_status": "some_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/wallstreetbets/comments/rcy65r/do_you_all_realize_how_deep_this_goes/",
  "subreddit_subscribers": 11301074,
  "created_utc": 1639149381,
  "num_crossposts": 1,
  "media": null,
  "is_video": false,
  "original_created_utc": 1639104373,
  "the_new_excerpt": "Ever since GME happened I have learned so much about the world of finance from\nall of the incredibly well-researched, intelligent, and informed DD posted by\napes on reddit. Of course at this point everybody knows about DRSing your shares\nbecause it's the only way to actually own your shares and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "GME以来、私は金融の世界について多くのことを学びました。\nによって投稿された、信じられないほどよく研究された、知的で、情報豊富なDDのすべて。\napes on reddit. もちろん、この時点で誰もが自分の株をDRSすることについて知っています。\nなぜなら、それが実際に自分の株を所有する唯一の方法だからです。",
      "title": "みんな、この深さがわかっているのかな？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "自从GME发生以来，我从所有的人那里学到了很多关于金融世界的知识。\n猿人在reddit上发布的所有令人难以置信的经过充分研究的、聪明的、有见地的DD。\n猿人在reddit上发布的所有令人难以置信的精心研究、聪明和知情的DD。当然，在这一点上，每个人都知道DRSing你的股票\n因为这是真正拥有你的股票的唯一方法，而且......",
      "title": "你们都知道这有多深吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "自從GME發生以來，我從所有的人那裏學到了很多關於金融世界的知識。\n猿人在reddit上發佈的所有令人難以置信的經過充分研究的、聰明的、有見地的DD。\n猿人在reddit上發佈的所有令人難以置信的精心研究、聰明和知情的DD。當然，在這一點上，每個人都知道DRSing你的股票\n因爲這是真正擁有你的股票的唯一方法，而且......",
      "title": "你們都知道這有多深嗎？"
    }
  ],
  "source_updated_at": 1639734121832
}