{
  "author": "shortyafter",
  "the_new_excerpt": "I posted this as a comment in response to someone who said the whole GME saga\n\"made them sick\". I thought it was worth posting here. Not posting in the GME\nrelated subs because they probably won't like the fact that I'm not holding. I\nbelieve this is related to the broader topic of stocks and stock…",
  "original_created_utc": 1618608440,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは、GMEの一連の騒動を「気分が悪くなった」と言った人へのコメントとして投稿したものです。\n\"病気になった」と言った人へのコメントとして投稿しました。ここに掲載する価値があると思いました。GME関連のサブサイトに投稿しないのは\nGME関連のサブサイトに投稿しないのは、私が保有していないという事実がおそらく気に入らないだろうからです。I\nこれは株の話題にも関連していると思うのですが・・・。",
      "title": "GMEは重要な瞬間でした。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我发这个帖子是为了回应有人说整个GME传奇的评论。\n\"让他们恶心\"。我觉得值得在这里发帖。不在GME发帖\n相关的子，因为他们可能不会喜欢我不持有的事实。I\n相信这与更广泛的股票和股票的话题有关，...",
      "title": "GME是一个重要的时刻。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我發這個帖子是爲了迴應有人說整個GME傳奇的評論。\n\"讓他們噁心\"。我覺得值得在這裏發帖。不在GME發帖\n相關的子，因爲他們可能不會喜歡我不持有的事實。I\n相信這與更廣泛的股票和股票的話題有關，...",
      "title": "GME是一個重要的時刻。"
    }
  ],
  "title": "GME was an important moment.",
  "created_utc": 1618613597,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><em>I posted this as a comment in response to someone who said the whole GME saga &quot;made them sick&quot;.  I thought it was worth posting here.  Not posting in the GME related subs because they probably won&#39;t like the fact that I&#39;m not holding.  I believe this is related to the broader topic of stocks and stock trading.  Not sure if this will be deleted.  Disclosure: I hold 0 GME currently.</em></p>\n\n<p>&#x200B;</p>\n\n<p>I&#39;m gonna explain this because I think it&#39;s worth explaining, and you&#39;re free to your opinions on GME and on anything, but I am detecting some dickishness on your part and I think it deserves to be called out.</p>\n\n<p>GME was cool because it showed that retail investors can win at this game, too. So big hedge funds like Melvin Capital can hope to multiply their wealth by shorting a dying firm into the ground, yeah? But the people who are just trying to make ends meet working at a company like Gamestop or similar from 9-5 have no hope of ever participating in that kind of play. And in fact they often see their very livelihood threatened by these hedge funds and other financial entities.</p>\n\n<p>Take the case of 2008 for example. Wall Street banks can profit off of unethical practices, normal people can&#39;t. And when the music stops, not only do the Wall Street firms get bailed out, they also take down the whole Main Street economy with them.</p>\n\n<p>People are tired of Wall Street and the wealthy always having the upper hand. They almost always win, and most of the time they win big. When they don&#39;t win, they can&#39;t lose, because the government&#39;s there to bail them out.</p>\n\n<p>My degree is in economics. I know the bailout was necessary to save the economy. But it doesn&#39;t change the fact that the common people are fed up with this dynamic. They are fed up with it, and they have every reason in the world to be. People&#39;s livelihoods were dramatically, dramatically effected by this sort of behavior.</p>\n\n<p>GME represented the first time that retail could win in a big way. And even then, they didn&#39;t win. Robinhood cut off the trading. But still, it was a major breakthrough. Average Joes showed that via social media the odds have been evened a bit. Now it&#39;s not just hedge funds and mega financial entities that can win at these big plays... retailers have a shot, too.</p>\n\n<p>Some people look at it is &quot;bringing the Hedgies down&quot;, &quot;death to the 1%&quot;, etc. I&#39;m not necessarily part of that crowd. But no matter what side of the political spectrum you&#39;re on, if you&#39;re a retail investor, just an Average Joe, you can be proud of what happened with GME. It was a victory for us. It meant a leveling of the playing field, if only ever so slightly.</p>\n\n<p>I for one am happy that I profited on the long end of things. I really believed in what I was doing, thus why I bought in on the way up the first time, and continued holding. I had never invested in stocks before. But I soon realized that the moment had passed, and that losing money wasn&#39;t much of a way to make a statement. So on the way up the second time I cashed out and made small profits.</p>\n\n<p>If you wanna short it, that&#39;s fine. Like I said, you&#39;re not making much of a statement by losing money. I for one wouldn&#39;t want to short it. I really believed in that movement, no matter how small or insignificant my contribution was. It may not have mattered in the grand scheme of things, but it mattered to <em>me</em>.</p>\n\n<p>But still. You wanna short it? That&#39;s fine. But the part about it &quot;making you sick&quot;. I think that&#39;s on you, man.</p>\n</div><!-- SC_ON -->",
  "score": 1973,
  "permalink": "/r/stocks/comments/mscxvp/gme_was_an_important_moment/",
  "subreddit": "stocks",
  "id": "mscxvp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171526128
}