{
  "author": "ThrowRA2931",
  "original_created_utc": 1625592757,
  "title": "Does anyone else constantly have a semi-blocked nose that's especially difficult when trying to sleep?",
  "created_utc": 1625618607,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It&#39;s not like boogers or anything, just like gunk that makes it unpleasant to breathe through the nose. Blowing the nose doesn&#39;t make these things disappear either.</p>\n\n<p>I have allergies but I feel this way all year long almost everyday. It&#39;s easier to deal with when I&#39;m up and doing things but when I start tilting my head for whatever (like sitting at a desk and looking down or sleeping on my side) I feel like I can never get enough oxygen and just end up breathing through my mouth.</p>\n\n<p>If this isn&#39;t normal, does anyone have any possible explanations and maybe some remedies? If you need more detail, let me know.</p>\n\n<p>Thanks!</p>\n</div><!-- SC_ON -->",
  "score": 138,
  "permalink": "/r/NoStupidQuestions/comments/oezrz5/does_anyone_else_constantly_have_a_semiblocked/",
  "subreddit": "NoStupidQuestions",
  "id": "oezrz5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It's not like boogers or anything, just like gunk that makes it unpleasant to\nbreathe through the nose. Blowing the nose doesn't make these things disappear\neither.\n\nI have allergies but I feel this way all year long almost everyday. It's easier\nto deal with when I'm up and doing things but when I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ブヨブヨした感じではなく、鼻で息をするのが嫌になるような塊のようなものです。\n鼻で息をするのが嫌になるようなものです。鼻をかんでも、これらのものが消えるわけではない。\nもあります。\n\n私はアレルギー体質ですが、1年中ほとんど毎日このような状態になります。その方が\n起きて何かをしているときは対処しやすいのですが......。",
      "title": "常に鼻が半開きになっていて、寝ようとすると特につらいという人はいませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "它不像鼻屎或任何东西，只是像垃圾，使人不愉快地通过鼻子呼吸。\n通过鼻子呼吸。擤鼻涕并不能使这些东西消失\n也不会消失。\n\n我有过敏症，但我一年到头几乎每天都有这种感觉。这比较容易\n当我站起来做事情的时候比较容易处理，但是当我...",
      "title": "是否有人经常有半阻塞的鼻子，在试图睡觉时特别困难？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "它不像鼻屎或任何東西，只是像垃圾，使人不愉快地通過鼻子呼吸。\n通過鼻子呼吸。擤鼻涕並不能使這些東西消失\n也不會消失。\n\n我有過敏症，但我一年到頭幾乎每天都有這種感覺。這比較容易\n當我站起來做事情的時候比較容易處理，但是當我...",
      "title": "是否有人經常有半阻塞的鼻子，在試圖睡覺時特別困難？"
    }
  ]
}