{
  "author": "WillieMunchright",
  "original_created_utc": 1630107801,
  "title": "Was there a real life equivalent to \"Dungeons and Dragons Adventurers\"?",
  "created_utc": 1630165694,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So in table top roleplaying games you have a party of adventurers who travel from place to place and complete quests. They explore dungeons, hunt down monsters, and sometimes just go around killing and looting everything they find. (Refered to as &quot;Murder Hobos&quot;)</p>\n\n<p>Was there instances in the past of people who teamed up with others and traveled as adventurers and completed quests?? Or would this simply be covered as people who are mercenaries?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/pcyxby/was_there_a_real_life_equivalent_to_dungeons_and/",
  "subreddit": "AskHistorians",
  "id": "pcyxby",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So in table top roleplaying games you have a party of adventurers who travel\nfrom place to place and complete quests. They explore dungeons, hunt down\nmonsters, and sometimes just go around killing and looting everything they find.\n(Refered to as \"Murder Hobos\")\n\nWas there instances in the past of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "テーブルトップのロールプレイングゲームでは、冒険者のパーティが各地を旅して、クエストをこなしていきます。\nあちこちを旅して、クエストをこなしていきます。ダンジョンを探検したり、モンスターを狩ったり\n時には、見つけたものすべてを殺して略奪することもあります。\n(Murder Hobos」と呼ばれています。)\n\n過去には......ありましたか？",
      "title": "ダンジョンズ＆ドラゴンズの冒険者たち」に相当するものが現実にあったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，在桌面角色扮演游戏中，你有一队冒险者，他们从一个地方到另一个地方旅行并完成任务。\n从一个地方到另一个地方并完成任务。他们探索地下城，追捕\n怪物，有时只是到处杀人和掠夺他们发现的一切。\n(被称为 \"杀人游民\")\n\n在过去是否有这样的例子...",
      "title": "现实生活中是否有相当于 \"龙与地下城的冒险者\"？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，在桌面角色扮演遊戲中，你有一隊冒險者，他們從一個地方到另一個地方旅行並完成任務。\n從一個地方到另一個地方並完成任務。他們探索地下城，追捕\n怪物，有時只是到處殺人和掠奪他們發現的一切。\n(被稱爲 \"殺人遊民\")\n\n在過去是否有這樣的例子...",
      "title": "現實生活中是否有相當於 \"龍與地下城的冒險者\"？"
    }
  ]
}