{
  "author": "coburn24",
  "original_created_utc": 1635022864,
  "title": "Coinbase charges a 25% commission fee on your staking rewards",
  "created_utc": 1635057049,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I wanted to share this with you all because I’m just finding this out after 6 months of staking with them. My fault for not reading the fine print before staking but 25% seems like an outrageously high commission fee. </p>\n\n<p>They seem like some greedy assholes stealing 1/4 of your staking rewards.  I’ve looked into Celsius and BlockFi and their staking rewards are in line with coinbases. Never read anything about a commission fee but may have just missed it. How does 25% compare across the other exchanges you can stake with?</p>\n\n<p>Anyone else been staking with coinbase and unaware of this? I’m staking ETH but regardless of what your staking I wanted to open up a discussion on where to find the best staking rewards with the lowest commission fee</p>\n</div><!-- SC_ON -->",
  "score": 155,
  "permalink": "/r/CryptoCurrency/comments/qedg58/coinbase_charges_a_25_commission_fee_on_your/",
  "subreddit": "CryptoCurrency",
  "id": "qedg58",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I wanted to share this with you all because I’m just finding this out after 6\nmonths of staking with them. My fault for not reading the fine print before\nstaking but 25% seems like an outrageously high commission fee.\n\nThey seem like some greedy assholes stealing 1/4 of your staking rewards.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このことを皆さんと共有したいと思いました。なぜなら、私は6ヶ月後にこのことを知ったからです。\nこのことを知ったのは、6ヶ月間この会社で賭けをした後です。賭けをする前に細かい文字を読まなかった私の責任です。\n25%の手数料は法外に高いと思います。\n\n彼らはあなたのステークの報酬の1/4を盗む貪欲な馬鹿者のようです....",
      "title": "コインベースでは、賭け金の報酬に対して25％の手数料がかかります"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想与大家分享这一点，因为我是在与他们合作6个月后才发现的。\n与他们合作了6个月后才发现。是我的错，因为我在下注之前没有看清楚细则。\n但25%的佣金费用似乎高得离谱。\n\n他们似乎是一些贪婪的混蛋，偷了你1/4的赌注，....。",
      "title": "Coinbase对你的赌注奖励收取25%的佣金费用"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想與大家分享這一點，因爲我是在與他們合作6個月後才發現的。\n與他們合作了6個月後才發現。是我的錯，因爲我在下注之前沒有看清楚細則。\n但25%的佣金費用似乎高得離譜。\n\n他們似乎是一些貪婪的混蛋，偷了你1/4的賭注，....。",
      "title": "Coinbase對你的賭注獎勵收取25%的佣金費用"
    }
  ]
}