{
  "author": "waynebest",
  "the_new_excerpt": " It is not a brand new shitcoin by any means. It is a platform called Emblem Vault which allows you to create a sort of ‘vault’ which can contain and allow you to trade “as many tokens as you want at the same time” and this extends to both NFTs and crypto coins.\n\n So for example you could create a…",
  "original_created_utc": 1616284213,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": " 这绝不是一个全新的屎币。它是一个名为Emblem Vault的平台，它允许你创建一种 \"金库\"，它可以包含并允许你交易 \"你想在同一时间交易多少代币\"，这延伸到NFT和加密币。\n\n 因此，例如你可以创建一个...",
      "title": "我自己对Emblem Vault的体验"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": " 這絕不是一個全新的屎幣。它是一個名爲Emblem Vault的平臺，它允許你創建一種 \"金庫\"，它可以包含並允許你交易 \"你想在同一時間交易多少代幣\"，這延伸到NFT和加密幣。\n\n 因此，例如你可以創建一個...",
      "title": "我自己對Emblem Vault的體驗"
    }
  ],
  "title": "My own experience with Emblem Vault",
  "created_utc": 1616304626,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><pre><code> It is not a brand new shitcoin by any means. It is a platform called Emblem Vault which allows you to create a sort of ‘vault’ which can contain and allow you to trade “as many tokens as you want at the same time” and this extends to both NFTs and crypto coins.\n\n So for example you could create a trade-able vault containing 60% BTC, 20% Eth 10% Ada &amp; 10% Polkadot... it is essentially a way to move liquidity of various forms under one container and they are compatible with a lot of different products.\n\n Another example is you could add say 5 different NFTs into one trade-able “asset” aka vault. This is both very on-trend for what&#39;s going on with NFTs but also has numerous future use cases to be explored and developed. They have an amazing looking website, a solid roadmap, a very active team (you can check their twitter @ CircuitsOfValue.\n\n A very unique and useful product that works (you can check out their app too, through their website and overall huge potential for growth.\n\n Also important to add, they are by no means a brand new, 1 week old project like some of the meme coins posted on here, but are still in the very beginning (and only about 60 million market cap). And just 600k total liquidity on Uniswap.\n\n To do more research and for a link to buy on Uniswap, you can find all the info through their website www.CircuitsOfValue.com and the coin is called COVAL.\n\n It has gone up about 211% in the last 7 days but still hasnt even come close to the 2018 all time high, not to mention its potential and/or use case around the NFTs trend alone. I highly suggest you check this project out, and DYOR of course.\n</code></pre>\n</div><!-- SC_ON -->",
  "score": 471,
  "permalink": "/r/CryptoCurrency/comments/m9jdw0/my_own_experience_with_emblem_vault/",
  "subreddit": "CryptoCurrency",
  "id": "m9jdw0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752816898
}