{
  "author": "Life-is-beautiful-",
  "the_new_excerpt": "I've started to invest in ETFs only of-late, (mostly targeting VTI, VTEB, VUG,\nCMF) in my taxable account. And I have close to 800k worth of stocks, 30-40% of\nit being AAPL, which I have been holding since around 2010. Most of my other\nholdings are also stable holdings like JNJ, PFE, FB, NFLX, AMZN,…",
  "original_created_utc": 1622178711,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近はETFだけに投資するようになりました（主にVTI、VTEB、VUGを対象にしています）。\nCMF）を課税口座に入れています。また、私は80万円相当の株式を持っていますが、そのうち30～40％は\nAAPLは2010年頃から保有しています。他のほとんどの\nJNJ、PFE、FB、NFLX、AMZN、...といった安定した銘柄を保有しています。",
      "title": "株式からETFへの移行 - Do or don't?"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近开始只投资于ETF，（主要针对VTI、VTEB、VUG。\nCMF）在我的应税账户中。我有价值近80万的股票，其中30-40%是AAPL。\n其中30-40%是AAPL，我从2010年左右就一直持有。我的其他大部分\n也都是稳定的持股，如JNJ、PFE、FB、NFLX、AMZN等。",
      "title": "从股票转向ETF--做还是不做？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近開始只投資於ETF，（主要針對VTI、VTEB、VUG。\nCMF）在我的應稅賬戶中。我有價值近80萬的股票，其中30-40%是AAPL。\n其中30-40%是AAPL，我從2010年左右就一直持有。我的其他大部分\n也都是穩定的持股，如JNJ、PFE、FB、NFLX、AMZN等。",
      "title": "從股票轉向ETF--做還是不做？"
    }
  ],
  "title": "Moving from stocks to ETFs - Do or don't?",
  "created_utc": 1622203431,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve started to invest in ETFs only of-late, (mostly targeting VTI, VTEB, VUG, CMF) in my taxable account. And I have close to 800k worth of stocks, 30-40% of it being AAPL, which I have been holding since around 2010. Most of my other holdings are also stable holdings like JNJ, PFE, FB, NFLX, AMZN, DIS, MSFT, CVX, XOM, V, MA etc. 10% of the portfolio is speculative.</p>\n\n<p>I live in CA, and I&#39;m already in a higher tax bracket. In my mid 40s, hoping to taper work down in another 8-10 years.</p>\n\n<p>I want to move away from individual stocks to ETFs. But, I&#39;m afraid of the tax hit I might have to take. Should I just leave them as is, as I expect most of these companies to survive 8-10 years and worry about it later, when my income might go down, or is there a better strategy to migrate?</p>\n</div><!-- SC_ON -->",
  "score": 50,
  "permalink": "/r/Bogleheads/comments/nmqekh/moving_from_stocks_to_etfs_do_or_dont/",
  "subreddit": "Bogleheads",
  "id": "nmqekh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804299106
}