{
  "author": "Rusky82",
  "original_created_utc": 1632307036,
  "title": "Why do so many people in America not know how freedom of speech works even though they constantly shout about it?",
  "created_utc": 1632318986,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>OK so freedom of speech in terms of the US Article 10 protects your right to hold your own opinions and to express them freely without government interference.  Basically the government can&#39;t pass laws or punish you for what you say - its a great thing to have!</p>\n\n<p>But I see it all the time someone says something to a person working for a company that gets them kicked out or barred from using the company service and there will always be tens of comments <em>&quot;but its their free speech rights!&quot;</em> which doesn&#39;t apply because it&#39;s a private company. </p>\n\n<p>Example today just seen a video of a woman being refused travel on American Airlines because she called a staff member a bitch, and in the comments nearly 50% were <em>&quot;that&#39;s illegal she has free speech say what she wants&quot;</em> but it&#39;s not how it works, freedom of speech =/= freedom from consequences especially from private companies.</p>\n\n<p>Is it just they don&#39;t know or am I actually wrong and it is somehow free speech and I have missed something?  Thanks.</p>\n</div><!-- SC_ON -->",
  "score": 124,
  "permalink": "/r/NoStupidQuestions/comments/pt4qx4/why_do_so_many_people_in_america_not_know_how/",
  "subreddit": "NoStupidQuestions",
  "id": "pt4qx4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "OK so freedom of speech in terms of the US Article 10 protects your right to\nhold your own opinions and to express them freely without government\ninterference. Basically the government can't pass laws or punish you for what\nyou say - its a great thing to have!\n\nBut I see it all the time someone says…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "米国の第10条では、言論の自由は、政府の干渉を受けずに自分の意見を持ち、それを自由に表現する権利を保護しています。\n自分の意見を持ち、それを政府の干渉を受けずに自由に表現する権利を\n表現する権利を保護しています。基本的に政府は、あなたの発言に対して法律を制定したり、罰したりすることはできません。\nこれは素晴らしいことです。\n\nこれは素晴らしいことです！しかし、私がよく目にするのは、誰かがこう言うことです。",
      "title": "アメリカでは言論の自由が叫ばれていますが、なぜ多くの人がその仕組みを知らないのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，就美国的第10条而言，言论自由保护你的权利\n持自己的观点，并在没有政府干预的情况下自由表达自己的观点。\n干预。基本上，政府不能通过法律或因你所说的话而惩罚你。\n你说的话--这是一件很好的事情。\n\n但我经常看到有人说...",
      "title": "为什么在美国有那么多人不知道言论自由是如何运作的，尽管他们不断地喊着言论自由？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，就美國的第10條而言，言論自由保護你的權利\n持自己的觀點，並在沒有政府幹預的情況下自由表達自己的觀點。\n干預。基本上，政府不能通過法律或因你所說的話而懲罰你。\n你說的話--這是一件很好的事情。\n\n但我經常看到有人說...",
      "title": "爲什麼在美國有那麼多人不知道言論自由是如何運作的，儘管他們不斷地喊着言論自由？"
    }
  ]
}