{
  "author": "nonamesleft314159",
  "the_new_excerpt": "I'm a long term hodler and in January 2020 I started a non-tax exempt brokerage\naccount in my daughter's name to start saving for college. I did this as opposed\nto a 529 so I could buy GBTC since I thought it would more than offset the tax\nbenefit. In less than 14 months I was able to save enough to…",
  "original_created_utc": 1613572286,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个长期的草根，2020年1月，我开始了一家非免税的经纪公司。\n账户在我女儿的名下，开始为大学储蓄。我这样做是为了反对\n到529，所以我可以购买GBTC，因为我认为它将超过抵消税款。\n效益。在不到14个月的时间里，我就攒够了... ...",
      "title": "谢谢比特币，我给女儿存完了大学学费，她已经1岁半了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個長期的草根，2020年1月，我開始了一家非免稅的經紀公司。\n賬戶在我女兒的名下，開始爲大學儲蓄。我這樣做是爲了反對\n到529，所以我可以購買GBTC，因爲我認爲它將超過抵消稅款。\n效益。在不到14個月的時間裏，我就攢夠了... ...",
      "title": "謝謝比特幣，我給女兒存完了大學學費，她已經1歲半了。"
    }
  ],
  "title": "Thank you Bitcoin, I finished saving for my daughter's college tuition and she is 1.5 years old",
  "created_utc": 1613583425,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m a long term hodler and in January 2020 I started a non-tax exempt brokerage account in my daughter&#39;s name to start saving for college. I did this as opposed to a 529 so I could buy GBTC since I thought it would more than offset the tax benefit. In less than 14 months I was able to save enough to pay for 4 years of tuition at a private university because of the dramatic rise in Bitcoin&#39;s price. My assumption is that I will get a 9% average return from now until she goes to college and that the cost of tuition will rise at 3%. I obviously still need to deal with paying taxes and want to build a buffer, but it is a nice milestone to hit.</p>\n</div><!-- SC_ON -->",
  "score": 2338,
  "permalink": "/r/Bitcoin/comments/llvqpj/thank_you_bitcoin_i_finished_saving_for_my/",
  "subreddit": "Bitcoin",
  "id": "llvqpj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728614533
}