{
  "author": "megacurl",
  "the_new_excerpt": "Goldman Sachs is close to offering its first investment vehicles for bitcoin and\nother digital assets to clients of its private wealth management group, CNBC has\nlearned exclusively.\n\nThe bank aims to begin offering investments in the emerging asset class in the\nsecond quarter, according to Mary…",
  "original_created_utc": 1617198775,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "高盛即将为比特币和提供首批投资工具。\n向其私人财富管理集团的客户提供其他数字资产，CNBC已\n独家获悉。\n\n该行的目标是在今年开始提供新兴资产类别的投资。\n第二季度，根据玛丽...",
      "title": "高盛接近向其财富管理客户提供比特币和其他数字资产。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "高盛即將爲比特幣和提供首批投資工具。\n向其私人財富管理集團的客戶提供其他數字資產，CNBC已\n獨家獲悉。\n\n該行的目標是在今年開始提供新興資產類別的投資。\n第二季度，根據瑪麗...",
      "title": "高盛接近向其財富管理客戶提供比特幣和其他數字資產。"
    }
  ],
  "title": "Goldman Sachs is close to offering bitcoin and other digital assets to its wealth management clients",
  "created_utc": 1617200749,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Goldman Sachs is close to offering its first investment vehicles for bitcoin and other digital assets to clients of its private wealth management group, CNBC has learned exclusively.</p>\n\n<p>The bank aims to begin offering investments in the emerging asset class in the second quarter, according to Mary Rich, who was recently named global head of digital assets for Goldman’s private wealth management division.</p>\n\n<p>″We are working closely with teams across the firm to explore ways to offer thoughtful and appropriate access to the ecosystem for private wealth clients, and that is something we expect to offer in the near term,” Rich said in an interview this week.</p>\n\n<p>Goldman is looking at ultimately offering a “full spectrum” of investments in bitcoin and digital assets, “whether that’s through the <strong>physical bitcoin, derivatives or traditional investment vehicles</strong>,” she said.</p>\n\n<p>The move means that soon, clients of two of the world’s preeminent investment banks – Goldman and Morgan Stanley – will have access to a nascent asset class that has intrigued billionaires and digital currency believers alike. Earlier this month, Morgan Stanley told its financial advisors that <strong>they could place clients into bitcoin funds starting in April</strong>, CNBC was first to report.</p>\n\n<p>It is the latest sign of the staying power of blockchain-related assets including bitcoin, a new kind of money that emerged out of the wreckage of the 2008 financial crisis and whose exact origins are still unknown. Until now, big U.S. banks have mostly shunned bitcoin, deeming it too speculative and volatile for clients.</p>\n\n<p>But the industry capitulated after the latest boom in bitcoin’s price. The surge has drawn in institutional investors, corporations and fintech players, and the infrastructure to hold digital assets is continuing to mature. In the end, it was client demand that won out, according to Rich.</p>\n\n<p>“There’s a contingent of clients who are looking to this asset as a hedge against inflation, and the macro backdrop over the past year has certainly played into that,” Rich said. “There are also a large contingent of clients who feel like we’re sitting at the dawn of a new Internet in some ways and are looking for ways to participate in this space.”</p>\n\n<p>Goldman’s private wealth management business mostly targets individuals, families and endowments <strong>with at least $25 million to invest</strong>.</p>\n\n<p>The bank may offer bitcoin investment funds, similar to those that Morgan Stanley will have, as well as other ways to invest that are “more akin to the underlying asset class which trades 24-7 globally,” Rich said. Some cryptofunds, such as the Galaxy Bitcoin Fund, can only be sold or bought once per quarter, she said.</p>\n\n<p>“We’re still in the very nascent stages of this ecosystem; no one knows exactly how it will evolve or what shape it will be,” Rich said. “But I think it’s fairly safe to expect it will be part of our future.”</p>\n\n<p><a href=\"https://www.cnbc.com/2021/03/31/bitcoin-goldman-is-close-to-offering-bitcoin-to-its-richest-clients.html\">https://www.cnbc.com/2021/03/31/bitcoin-goldman-is-close-to-offering-bitcoin-to-its-richest-clients.html</a></p>\n</div><!-- SC_ON -->",
  "score": 1799,
  "permalink": "/r/investing/comments/mh6l6f/goldman_sachs_is_close_to_offering_bitcoin_and/",
  "subreddit": "investing",
  "id": "mh6l6f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357140069
}