{
  "author": "WirelessOperatorSOE",
  "original_created_utc": 1648798476,
  "title": "I am an SOE wireless operator, broadcasting from occupied Paris. Ask me anything before my broadcasting window closes!",
  "created_utc": 1648842139,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;... --- ...&lt;/p&gt;\n\n&lt;p&gt;Greetings! This message is coming to you over the airwaves from a secret location in Nazi-occupied Paris. I can&amp;#39;t stay broadcasting for too long before the Gestapo track me down, so get your questions in before I have to go off air and hide.&lt;/p&gt;\n\n&lt;p&gt;edit: I will decode these at the end of today but in the meantime you can use &lt;a href=\"https://www.dcode.fr/double-transposition-cipher\"&gt;this website&lt;/a&gt; to try and crack it - if you can guess the key words!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/ttl2vn/i_am_an_soe_wireless_operator_broadcasting_from/",
  "subreddit": "AskHistorians",
  "id": "ttl2vn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "... --- ...\n\nGreetings! This message is coming to you over the airwaves from a secret\nlocation in Nazi-occupied Paris. I can't stay broadcasting for too long before\nthe Gestapo track me down, so get your questions in before I have to go off air\nand hide.\n\nedit: I will decode these at the end of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "... --- ...\n\nご挨拶 このメッセージは、電波を通して、秘密の場所\nナチス占領下のパリにある 長くは放送していられないので\nゲシュタポに追われる前に、質問をどうぞ。\nと隠れます。\n\nedit: これを解読するのは最後に...",
      "title": "私はSOEの無線通信士で、占領下のパリから放送しています。私の放送枠が閉まる前に、何でも聞いてくださいね。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "... --- ...\n\n大家好! 这个消息是通过电波从纳粹占领的巴黎的一个秘密地点传给你的\n在被纳粹占领的巴黎的一个秘密地点为您播报。我不能在广播中停留太长时间，因为\n在盖世太保找到我之前，我不能在广播中停留太久，所以请在我停止广播之前提出你的问题\n并躲起来。\n\n编辑：我将在最后对这些问题进行解码...",
      "title": "我是一名SOE无线操作员，在被占领的巴黎进行广播。在我的广播窗口关闭之前，请向我提出任何问题!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "... --- ...\n\n大家好! 這個消息是通過電波從納粹佔領的巴黎的一個祕密地點傳給你的\n在被納粹佔領的巴黎的一個祕密地點爲您播報。我不能在廣播中停留太長時間，因爲\n在蓋世太保找到我之前，我不能在廣播中停留太久，所以請在我停止廣播之前提出你的問題\n並躲起來。\n\n編輯：我將在最後對這些問題進行解碼...",
      "title": "我是一名SOE無線操作員，在被佔領的巴黎進行廣播。在我的廣播窗口關閉之前，請向我提出任何問題!"
    }
  ]
}