{
  "author": "doogiedc",
  "original_created_utc": 1649466189,
  "title": "Are there any philosophy subreddits or forums outside of reddit with less stringency, less moderation by professional academics, and more openness to amateurs interested in philosophy?",
  "created_utc": 1649512718,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I enjoy philosophy but I am not an academic. My perspective of both the &lt;a href=\"/r/philosophy\"&gt;r/philosophy&lt;/a&gt; and &lt;a href=\"/r/askphilosophy\"&gt;r/askphilosophy&lt;/a&gt; subreddits is that it is mainly populated by individuals with either college degrees in philosophy or academics who are actively publishing papers or faculty at postsecondary institutions. It is not the place for an &amp;quot;off the cuff&amp;quot; opinion or one with rudimentary philosophical argument looking for help. I&amp;#39;d like a place to discuss philosophy where the standards were not quite so rigorous. I&amp;#39;m not criticizing the existence of &lt;a href=\"/r/philosophy\"&gt;r/philosophy&lt;/a&gt; and its identity embodying such elite standards. Of course, such a place with those standards has a need to exist. I&amp;#39;m not necessarily saying I&amp;#39;m looking for a total free-for-all, but more of a marketplace or bazaar of ideas rather than a walled garden with security guards and surveillance cameras. I suppose ironically, I fear this post itself getting moderated and kicked off in which case it is what it is.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/askphilosophy/comments/tzhxzu/are_there_any_philosophy_subreddits_or_forums/",
  "subreddit": "askphilosophy",
  "id": "tzhxzu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I enjoy philosophy but I am not an academic. My perspective of both the\nr/philosophy [/r/philosophy] and r/askphilosophy [/r/askphilosophy] subreddits\nis that it is mainly populated by individuals with either college degrees in\nphilosophy or academics who are actively publishing papers or faculty…"
}