{
  "author": "emergent_convergence",
  "original_created_utc": 1648482688,
  "title": "Why is the mediocre more successful?",
  "created_utc": 1648552902,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;YouTube videos, Twitch streams, Blogs, Social Media has changed my views on what kind of content &lt;em&gt;makes it&lt;/em&gt;. There&amp;#39;s nothing special or unique about what they do, they seem to have won the lottery and became famous superstars. They&amp;#39;re the ones making a living.&lt;/p&gt;\n\n&lt;p&gt;Often, I stumble across some well researched and insightful content but they&amp;#39;re nowhere near as popular. These content creators make a couple of dollars rather than thousands. I wonder why more people are not looking or reading these kinds of work. There&amp;#39;s so much more passion poured into them.&lt;/p&gt;\n\n&lt;p&gt;I find interesting Twitch streams where I&amp;#39;m the only viewer. Documentary quality and lengthy YouTube videos which have less than a thousand views. Or perhaps a blogger that celebrates 100 unique views per month.&lt;/p&gt;\n\n&lt;p&gt;The more popular content tends to be from popularizers who have a blog about their normal views taken from a cellphone camera. Plenty of make up artists who are sponsored by expensive cosmetic products showing the same tips that hundreds of others people have purported.&lt;/p&gt;\n\n&lt;p&gt;Knowingly, there is a big survivorship bias playing a role here, but I have the impression that there&amp;#39;s more to it than that. I value quality but it&amp;#39;s hard to find because the popular stuff takes over the first results page.&lt;/p&gt;\n\n&lt;p&gt;Why?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 107,
  "permalink": "/r/TrueAskReddit/comments/tqccrw/why_is_the_mediocre_more_successful/",
  "subreddit": "TrueAskReddit",
  "id": "tqccrw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "YouTube videos, Twitch streams, Blogs, Social Media has changed my views on what\nkind of content makes it. There's nothing special or unique about what they do,\nthey seem to have won the lottery and became famous superstars. They're the ones\nmaking a living.\n\nOften, I stumble across some well…"
}