{
  "author": "sugarfoot_123",
  "original_created_utc": 1627384194,
  "title": "I still regularly hold my dad's hand . Is this weird?",
  "created_utc": 1627422950,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I&#39;m 14 and really just do this out of habit I think. My mom died giving birth to me so my daddy raised me pretty much on his own until recently where he got engaged to the woman who is now my stepmom (whom I love! She&#39;s always seen me as her own and cares about me deeply). It was just us against the world for years. Sure we&#39;ve had our ups and downs, some times really bad downs, but he&#39;s always made me feel safe and happy at the end of the day. </p>\n\n<p>So if we&#39;re ever in a situation where it&#39;s just us, either sitting on the couch, driving somewhere, walking together in the mall, etc, I usually hold his hand the whole time and just don&#39;t even think about it. I didn&#39;t know if this would be considered weird given my age.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/oskrk6/i_still_regularly_hold_my_dads_hand_is_this_weird/",
  "subreddit": "TooAfraidToAsk",
  "id": "oskrk6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So I'm 14 and really just do this out of habit I think. My mom died giving birth\nto me so my daddy raised me pretty much on his own until recently where he got\nengaged to the woman who is now my stepmom (whom I love! She's always seen me as\nher own and cares about me deeply). It was just us against…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は14歳ですが、本当に習慣的にやっているだけだと思います。私の母は私を産んで死んだので\n私を産んで死んだので、父はほとんど一人で私を育ててくれました。\n今の義理のお母さんと婚約しました（大好きです！）。彼女はいつも私を自分のものとして見ていて\n彼女はいつも私を自分の子供のように見ていて、私のことをとても大切にしてくれています）。) それは私たち二人だけのことでした...",
      "title": "私は今でも定期的に父の手を握っています。 これは変ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我14岁了，真的只是出于习惯而这样做，我想。我妈妈生我的时候死了\n所以我爸爸几乎是自己把我养大的，直到最近他和一个女人订了婚。\n他和现在的继母订婚了（我爱她！）。她一直把我当做自己的孩子看待\n她一直视我为己出，对我关怀备至）。) 当时只有我们两个人对抗...",
      "title": "我仍然经常握着我父亲的手，这很奇怪吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我14歲了，真的只是出於習慣而這樣做，我想。我媽媽生我的時候死了\n所以我爸爸幾乎是自己把我養大的，直到最近他和一個女人訂了婚。\n他和現在的繼母訂婚了（我愛她！）。她一直把我當做自己的孩子看待\n她一直視我爲己出，對我關懷備至）。) 當時只有我們兩個人對抗...",
      "title": "我仍然經常握着我父親的手，這很奇怪嗎？"
    }
  ]
}