{
  "author": "fortifier22",
  "the_new_excerpt": "Alright fellow apes, in light of everything going on with our glorious meme\nstonks, we need to take some time to reflect upon our financial literacy and\nhealth. This is so that when we’re able to squeeze the big boys out of their\nbillions, our gains will actually matter.\n\nIt is a fact that the vast…",
  "original_created_utc": 1614530542,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "好了，猿族同胞们，鉴于一切都在进行中 我们的光荣纪念品\n石头，我们需要花点时间来反思自己的金融知识和。\n健康。这样，当我们能够把大佬们从他们的\n亿，我们的收益将真正重要。\n\n事实上，广大...",
      "title": "只有当你拥有良好的财务健康状况时，大的收益才会重要"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好了，猿族同胞們，鑑於一切都在進行中 我們的光榮紀念品\n石頭，我們需要花點時間來反思自己的金融知識和。\n健康。這樣，當我們能夠把大佬們從他們的\n億，我們的收益將真正重要。\n\n事實上，廣大...",
      "title": "只有當你擁有良好的財務健康狀況時，大的收益纔會重要"
    }
  ],
  "title": "Big gains will only matter when you have good financial health",
  "created_utc": 1614556463,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Alright fellow apes, in light of everything going on with our glorious meme stonks, we need to take some time to reflect upon our financial literacy and health. This is so that when we’re able to squeeze the big boys out of their billions, our gains will actually matter.</p>\n\n<p><a href=\"https://www.washingtonpost.com/outlook/five-myths/five-myths-about-the-lottery/2019/12/27/742b9662-2664-11ea-ad73-2fd294520e97_story.html\">It is a fact that the vast majority of lottery winners lose all their winnings, even go bankrupt, within a few years of receiving their winnings.</a></p>\n\n<p>In other words, if we don’t use our gains wisely, they’re just going to go back to the big guys that are screwing us over.</p>\n\n<p>So here’s some simple yet solid financial advice from rich people that can help you keep and grow whatever gains you’ll be getting within these next few months;</p>\n\n<h1>1.) Have a strict budget.</h1>\n\n<p>One of the most common budgets for wealthy people is this ;</p>\n\n<p><strong>50%</strong> of their money goes towards <strong>necessities</strong> (rent/board/mortgage, groceries, utilities, insurance, transportation, etc.)</p>\n\n<p><strong>20-30%</strong> goes into <strong>investments</strong></p>\n\n<p><strong>10-20%</strong> goes into an <strong>emergency fund</strong> they can access quickly</p>\n\n<p><strong>10%</strong> goes towards <strong>wants</strong> (entertainment, restaurants, treats, etc.)</p>\n\n<p>Again, not everyone can follow this budget to a T, and some don’t have to. But it will be important to budget your income and gains into these four separate categories in whichever way works best for you so that you can have strong financial health.</p>\n\n<h1>2.) Prepare for taxes</h1>\n\n<p>If your gains are big enough, and unless you’re going to keep them all in a tax-free account, you’re going to have to study up on what tax rates will apply to you and your gains.</p>\n\n<p>For example, if you get $1.5M, and the tax rate for those sort of gains is 33%, only use the $1M and save aside the other $0.5M solely for taxes.</p>\n\n<h1>3.) If your gains are big enough, hire a financial advisor from a trusted institute</h1>\n\n<p>Anyone who makes huge amounts of money will be wise to hire someone that can help them understand what to do with it.</p>\n\n<p>So if your gains are too overwhelming for you, and your first instincts are to instantly buy all the things you’ve ever wanted, you will actually be wise to calm yourself down and do your research on who you can trust with your money.</p>\n\n<p>DO NOT follow the financial advice of anyone that comes to you. YOU must go to THEM.</p>\n\n<p>This leads me to my next point;</p>\n\n<h1>4.) Expect scammers, beggars, and family to come out of the woodwork if you make your gains public</h1>\n\n<p>There are people who dedicate their lives to manipulating others to get what they want. And if you make your wealth public by either telling everyone about your gains, or flashing your wealth around, you will become a prime target to some of the scummiest, two-faced con artists on Earth.</p>\n\n<p>Even family and friends can suddenly show up and subtly ask you for money. They may not be doing this on purpose or out of sheer selfish desire; it’s just human nature.</p>\n\n<p>This also leads me into my final point;</p>\n\n<h1>5.) Prepare for your entire life to change.</h1>\n\n<p>Your personal, relationship, and work life will all change whether you like it or not with your new big gains.</p>\n\n<p>Prepare for the transition to be stressful, to challenge everything you know and are, and for you to need to re-evaluate your relationships with others as well as your purpose in life.</p>\n\n<p>Again, the vast majority of people live most of their lives working hard just to get by. Now that money is less of an issue, that changes everything.</p>\n\n<h1>6.) Don’t forget that you’re still human</h1>\n\n<p>You are not a genius or a God now that you have this wealth. You can still bleed, and you will die just like everyone else will.</p>\n\n<p>This also means that your greatest satisfaction and joys in life will not come from your wealth or the things you can now buy that most can only dream about buying.</p>\n\n<p>It comes from the little things.</p>\n\n<p>It comes from giving.</p>\n\n<p>It comes from living in and for love.</p>\n\n<p>And if you forget about it, you’ll only become the very kind of people that we’re fighting against.</p>\n</div><!-- SC_ON -->",
  "score": 4430,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/yJa14hX6M9-b1cYBpeW5lnlxAloxN3H5RLmEo2UN2Z0.jpg?auto=webp&s=43b17aac720df5da7389fcb07d28ba675e508cc5",
          "width": 1440,
          "height": 961
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/yJa14hX6M9-b1cYBpeW5lnlxAloxN3H5RLmEo2UN2Z0.jpg?width=108&crop=smart&auto=webp&s=7c6a65d1b67a74f1a2b75a068ae8adf358a6a6ad",
            "width": 108,
            "height": 72
          },
          {
            "url": "https://external-preview.redd.it/yJa14hX6M9-b1cYBpeW5lnlxAloxN3H5RLmEo2UN2Z0.jpg?width=216&crop=smart&auto=webp&s=15a9a314993e61098730d5a5706ef0b51a42f90b",
            "width": 216,
            "height": 144
          },
          {
            "url": "https://external-preview.redd.it/yJa14hX6M9-b1cYBpeW5lnlxAloxN3H5RLmEo2UN2Z0.jpg?width=320&crop=smart&auto=webp&s=32e857a3e02170cc5f808c9b08b79d9dae556672",
            "width": 320,
            "height": 213
          },
          {
            "url": "https://external-preview.redd.it/yJa14hX6M9-b1cYBpeW5lnlxAloxN3H5RLmEo2UN2Z0.jpg?width=640&crop=smart&auto=webp&s=2d0ca1b882f3b90d8bd010b7e76bba8024f581a7",
            "width": 640,
            "height": 427
          },
          {
            "url": "https://external-preview.redd.it/yJa14hX6M9-b1cYBpeW5lnlxAloxN3H5RLmEo2UN2Z0.jpg?width=960&crop=smart&auto=webp&s=ccc1e1565cb23ed3ca3be3bfe5546621dc649d0e",
            "width": 960,
            "height": 640
          },
          {
            "url": "https://external-preview.redd.it/yJa14hX6M9-b1cYBpeW5lnlxAloxN3H5RLmEo2UN2Z0.jpg?width=1080&crop=smart&auto=webp&s=3e6e2e1bbfcc16d89e50bcde844a361a50e932c9",
            "width": 1080,
            "height": 720
          }
        ],
        "variants": {},
        "id": "yckyd-5mGFv16aWpW6zp4On_JQyYX6g_9jnbSwYdxfE"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/wallstreetbets/comments/luk9jx/big_gains_will_only_matter_when_you_have_good/",
  "subreddit": "wallstreetbets",
  "id": "luk9jx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937752786
}