{
  "author": "The_Manchurian",
  "original_created_utc": 1626293258,
  "title": "I'm a rich 4th century Roman and I've decided to convert to the cool new religion of Christianity, just like the Emperor. Outside of actual religious ceremonies, what changes am I likely to make to my behaviour?",
  "created_utc": 1626312896,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Do I have to stop beating and sexually abusing my slaves? Stop going to the Coliseum? Or is that all still quite acceptable? (Or for that matter, something that by this time pagan aristocrats don&#39;t do either.) Those are two more colourful examples, but what else might change? Diet, day-to-day practices, how I treat my wife and kids, etc, etc.</p>\n</div><!-- SC_ON -->",
  "score": 123,
  "permalink": "/r/AskHistorians/comments/okch5e/im_a_rich_4th_century_roman_and_ive_decided_to/",
  "subreddit": "AskHistorians",
  "id": "okch5e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Do I have to stop beating and sexually abusing my slaves? Stop going to the\nColiseum? Or is that all still quite acceptable? (Or for that matter, something\nthat by this time pagan aristocrats don't do either.) Those are two more\ncolourful examples, but what else might change? Diet, day-to-day…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "奴隷を殴ったり、性的に虐待したりするのをやめなければならないのか？コロシアムに行くのを\nコロセウムに行くのをやめなければならないのか？それとも、それはまだ十分に許容できることなのでしょうか？(それどころか、この時代の異教の貴族がやっていないことも\nこの時代の異教徒の貴族もやっていないことだが）。) それらは、さらに2つの\n他に何が変わるだろうか？食生活、日々の生活...。",
      "title": "私は4世紀のローマ人の金持ちで、皇帝のようにクールな新宗教であるキリスト教に改宗することにしました。実際の宗教儀式以外では、私の行動にどのような変化があるでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我必须停止殴打和性虐待我的奴隶吗？不要再去\n竞技场？还是说这一切还是很容易接受的？(或者就这个问题而言，一些\n到了这个时候，异教贵族也不做了）。) 这又是两个\n丰富多彩的例子，但还有什么可能改变呢？饮食、日常...",
      "title": "我是一个富有的4世纪罗马人，我决定像皇帝一样皈依很酷的新宗教--基督教。在实际的宗教仪式之外，我的行为可能会有什么变化？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我必須停止毆打和性虐待我的奴隸嗎？不要再去\n競技場？還是說這一切還是很容易接受的？(或者就這個問題而言，一些\n到了這個時候，異教貴族也不做了）。) 這又是兩個\n豐富多彩的例子，但還有什麼可能改變呢？飲食、日常...",
      "title": "我是一個富有的4世紀羅馬人，我決定像皇帝一樣皈依很酷的新宗教--基督教。在實際的宗教儀式之外，我的行爲可能會有什麼變化？"
    }
  ]
}