{
  "author": "yunggod6966",
  "original_created_utc": 1640466230,
  "title": "Merry christmas/post a coin and we roast it",
  "created_utc": 1640484778,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Merry christmas everybody.  I had a great time with yall this year. I hope everyone is having a great christmas. I&amp;#39;m stuck at work for my christmas today and business has been slow so I figured we could play a game to pass the time. I know alot of you are busy with your family and stuff but maybe some of you are by yourselves and need a little distraction or something&lt;/p&gt;\n\n&lt;p&gt;Anyways rules are simple: post a coin you are bullish on or that you hate or whatever and we will try to roast it.&lt;/p&gt;\n\n&lt;p&gt;I hope everyone made their money this year and if you got in late just be patient your time will come if you compare cryptos global market cap to the equity markets or money markets or real estate we have huge room to grow. Yes bitcoin is one of the bigger assets in the world but the market as a whole is tiny&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 156,
  "permalink": "/r/CryptoCurrency/comments/rohfg8/merry_christmaspost_a_coin_and_we_roast_it/",
  "subreddit": "CryptoCurrency",
  "id": "rohfg8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Merry christmas everybody. I had a great time with yall this year. I hope\neveryone is having a great christmas. I'm stuck at work for my christmas today\nand business has been slow so I figured we could play a game to pass the time. I\nknow alot of you are busy with your family and stuff but maybe…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、メリークリスマス。今年も皆さんと楽しい時間を過ごすことができました。今年もよろしくお願いします。\n皆さん、素敵なクリスマスをお過ごしでしょうか。私は今日からクリスマスで会社に缶詰です。\nということで、暇つぶしにゲームでもしようかと。I\n皆さんは家族で忙しいと思いますが、もしかしたら...。",
      "title": "メリークリスマス／コインを投稿して焼こう"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家圣诞快乐。今年我和大家一起度过了美好的时光。我希望\n大家都有一个美好的圣诞节。今天的圣诞节我被困在了工作岗位上\n生意不景气，所以我想我们可以玩个游戏来打发时间。I\n我知道你们很多人都在忙于家庭和其他事情，但也许...",
      "title": "圣诞快乐/投个硬币我们就烤了它"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家聖誕快樂。今年我和大家一起度過了美好的時光。我希望\n大家都有一個美好的聖誕節。今天的聖誕節我被困在了工作崗位上\n生意不景氣，所以我想我們可以玩個遊戲來打發時間。I\n我知道你們很多人都在忙於家庭和其他事情，但也許...",
      "title": "聖誕快樂/投個硬幣我們就烤了它"
    }
  ]
}