{
  "author": "psychotrader00",
  "the_new_excerpt": "PsychoMarket Recap - Tuesday, April 13, 2021\n\nStocks traded mixed on Tuesday, with the S&P 500 (SPY) and tech-heavy Nasdaq\n(QQQ) gaining while the Dow Jones (DIA) fell modestly. Market participants are\nclosely monitoring the pace of vaccine distribution after US federal health\nofficials called for…",
  "original_created_utc": 1618347565,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "サイコ・マーケット・リカップ - 2021年4月13日（火\n\n株式は火曜日に混合して取引され、S&P 500(SPY)とハイテク株の多いNasdaq\nQQQ）が上昇する一方、ダウ平均（DIA）は小幅に下落しました。市場参加者は\n市場参加者は、米国の連邦保健当局がワクチンの配給ペースを注視しています。\n市場参加者は、米国の連邦保健当局がワクチンの配布を...",
      "title": "本日2021年4月13日（火）のマーケット・リカップをご紹介します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "心理市场回顾--2021年4月13日，星期二。\n\n周二股市交投不一，标普500指数(SPY)和科技股重镇纳斯达克指数\n(QQQ)上涨，而道琼斯指数(DIA)小幅下跌。市场参与者\n密切关注疫苗发放的步伐，美国联邦卫生\n官员呼吁...",
      "title": "以下是2021年4月13日星期二的市场回顾。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "心理市場回顧--2021年4月13日，星期二。\n\n週二股市交投不一，標普500指數(SPY)和科技股重鎮納斯達克指數\n(QQQ)上漲，而道瓊斯指數(DIA)小幅下跌。市場參與者\n密切關注疫苗發放的步伐，美國聯邦衛生\n官員呼籲...",
      "title": "以下是2021年4月13日星期二的市場回顧。"
    }
  ],
  "title": "Here is a Market Recap for today Tuesday, April 13, 2021",
  "created_utc": 1618366642,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>PsychoMarket Recap - Tuesday, April 13, 2021</strong></p>\n\n<p>Stocks traded mixed on Tuesday, with the S&amp;P 500 (SPY) and tech-heavy Nasdaq (QQQ) gaining while the Dow Jones (DIA) fell modestly. Market participants are closely monitoring the pace of vaccine distribution after US federal health officials called for the pause in the rollout of the Johnson &amp; Johnson (JNJ) coronavirus vaccine and the upcoming earnings season.</p>\n\n<p>In a joint statement posted to Twitter <a href=\"https://twitter.com/US_FDA/status/1381925612743499778\">(check out the thread here</a>), The US Food and Drug Administration (FDA) and the Center for Disease Control and Prevention (CDC) called for a pause in the rollout of the JNJ vaccine following reports of rare blood clots in people who received the vaccine. The agencies are reviewing data over six reported U.S. cases of a severe blood clot in individuals after receiving the vaccine, and have recommended the pause &quot;out of an abundance of caution,&quot; the FDA said in a Twitter post. To date, roughly 6.8 million doses of the single-dose JNJ vaccine have been administered.</p>\n\n<p>In a statement, JNJ said it has been “working closely with medical experts and health authorities, and we strongly support the open communication of this information to healthcare professionals and the public” and added “In addition, we have been reviewing these cases with European health authorities. We have made the decision to proactively delay the rollout of our vaccine in Europe.” During a press briefing, Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, said the J&amp;J vaccine review would likely take “days to weeks, rather than weeks to months”, in order to resolve.”</p>\n\n<p>As earnings season kicks off, a slew of recent promising economic data has suggested corporate profits will jump in tandem with the recovering economy, especially in the sectors most heavily affected by the pandemic. Over the past several weeks, analysts have raised their earnings estimates by record levels with the expectation that recent economic growth will drive corporate earnings higher. According to FactSet, first-quarter <a href=\"https://insight.factset.com/record-high-increase-in-sp-500-eps-estimates-for-q1\">earnings estimates were increased by a record margin of 6%</a> over the past several weeks, as analysts adjusted their forecasts for the much stronger-than-expected economic rebound seen so far.</p>\n\n<p><strong>Highlights</strong></p>\n\n<ul>\n<li>Earnings season is kicking off Wednesday pre-market, with many big banks reporting earnings.</li>\n<li>Coinbase is set to go public tomorrow. This direct listing is going to be huge, with the company rumored to debut with a market cap of roughly $140 billion. For context, that is $30 billion more than the market cap of Goldman Sachs (GS) and Square (SQ)</li>\n<li>Brian Angiolet was <a href=\"https://draftkings.gcs-web.com/news-releases/news-release-details/draftkings-expands-executive-team-first-chief-media-officer-hire\">announced </a>as the new chief media officer for Draftkings (DKNG). In the new role, Angiolet will oversee and optimize content creation and media strategy with a team. He previously worked as the senior vice-president and chief business officer at Verizon (VZ)</li>\n<li>Apple Inc. scheduled an April 20 event dubbed &quot;Spring Loaded,&quot; the tech giant&#39;s latest virtual gathering to unveil new gadgets. The company is expected to show off new iPads, among other possible additions to its product lineup, analysts say.</li>\n<li>Morgan Stanley said on Tuesday it would seek to encourage an additional $750 billion worth of spending on low-carbon solutions by 2030 under a scheme which two years ago targeted $250 billion in investment.</li>\n<li>Chinese electric vehicle maker Nio confirmed its long-awaited partnership with China Petroleum &amp; Chemical Corporation to set up battery swap stations at Sinopec’s gas filling stations. Sinopec is the largest supplier of refined oil products and petrochemicals as well as the second-largest oil and gas producer in China. The company has more than 30,000 gas stations, ranking it second in the world.</li>\n<li><strong>**Please note that current stock price was written premarket and does not reflect intraday activity*\\</strong>*</li>\n<li>(AGCO) target raised by Deutsche Bank from $145 to $164 at Buy. Stock currently around $149</li>\n<li>Cleveland-Cliffs (CLF) target raised by B. Riley from $21 to $22 at Buy. Stock currently around $17.50</li>\n<li>LivaNova (LIVN) target raised by Piper Sandler from $81 to $92 at Overweight. Stock currently around $81</li>\n<li>Nvidia (NVDA) with a host of target raises. Consensus price target $675 at Outperform. Stock currently around $609.</li>\n<li>Oshkosh (OSK) target raised by Deutsche Bank from $111 to $135 at Buy. Stock currently around $121</li>\n<li>Starbucks (SBUX) target raised by Argus from $116 top $132 at Buy. Stock currently around $114</li>\n<li>Square (SQ) target raised by Needham &amp; Co from $300 to $310 at Buy. Stock currently around $265</li>\n</ul>\n\n<p>“The past is history, the future is a mystery, but today is a gift. That is why it‘s called the present” - Master Oogway</p>\n</div><!-- SC_ON -->",
  "score": 149,
  "permalink": "/r/stocks/comments/mqbg6o/here_is_a_market_recap_for_today_tuesday_april_13/",
  "subreddit": "stocks",
  "id": "mqbg6o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566618931
}