{
  "author": "FeynmansRazor",
  "original_created_utc": 1626758305,
  "title": "The Bull Run Ended in February 2021. What the whales DON'T want you to know.",
  "created_utc": 1626763727,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The bull run didn&#39;t end in May. </p>\n\n<p>And no, we <em>didn&#39;t</em> start going down because of Elon or China FUD.</p>\n\n<p>The truth is, the bears took control in February.  When BTC was at $47K.</p>\n\n<p>Now, I know 2021 brought a lot of new people to Crypto. A lot of you guys don&#39;t know anything about technical analysis, so I&#39;ll break it down for you. There&#39;s an indicator traders like to use called the RSI or Relative Strength Index, which is used to track price momentum.</p>\n\n<p>The crucial bit of information is that the RSI for BTC was overbought in February and started to decline each month, despite the price continuing to rise. This is called bearish divergence, which occurs when prices goes up but our oscillator prints a lower high. </p>\n\n<p>Smart money knows about this, because that&#39;s what makes them smart. That&#39;s why when BTC went from $47K, to $57K and higher, they were taking profits on the way up. Smart money moved their profits into stable coin at the top. If they were really smart, they shorted down to $30K as well.</p>\n\n<p>The point is, that&#39;s how whales play the game. That&#39;s how they can buy the dip. It&#39;s why they have capital to deploy at $28K and below. Crypto is not broken. We don&#39;t need to come up theories like S2F or lengthening cycles. The warning signs were there in February. Anyone who doesn&#39;t understand that and is complaining how we didn&#39;t go to $200,000 this year was simply asking to get rekt. </p>\n\n<p>You won&#39;t hear this on YouTube or Twitter. Looking at most of the shitposts on this sub, I expect this analysis will get buried. I&#39;m interested to see how well a genuinely informative post does. Let&#39;s see. Maybe this helps someone be smarter next time. </p>\n\n<p>Not FA, just TA.</p>\n</div><!-- SC_ON -->",
  "score": 221,
  "permalink": "/r/CryptoCurrency/comments/onvkug/the_bull_run_ended_in_february_2021_what_the/",
  "subreddit": "CryptoCurrency",
  "id": "onvkug",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The bull run didn't end in May.\n\nAnd no, we didn't start going down because of Elon or China FUD.\n\nThe truth is, the bears took control in February. When BTC was at $47K.\n\nNow, I know 2021 brought a lot of new people to Crypto. A lot of you guys don't\nknow anything about technical analysis, so I'll…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ブルランは5月に終わったわけではない。\n\nまた、イーロンや中国のFUDのせいで下降し始めたわけでもありません。\n\n本当は、2月にベアが主導権を握ったのです。BTCが47Kドルになったときです。\n\nさて、2021年には多くの新しい人々が暗号に興味を持ったことは知っています。あなた方の多くは、テクニカル分析を知らない。\nテクニカル分析を知らない人も多いでしょうから...",
      "title": "2021年2月にブルランが終了。クジラがあなたに知られたくないこと。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "牛市运行并没有在5月结束。\n\n而且，我们并没有因为埃隆或中国的恐惧症而开始下跌。\n\n事实是，熊市在2月份控制了局面。当BTC在47K美元的时候。\n\n现在，我知道2021年给Crypto带来了很多新的人。你们中的很多人并不\n对技术分析一无所知，所以我...",
      "title": "2021年2月，牛市运行结束。鲸鱼不想让你知道的事。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "牛市運行並沒有在5月結束。\n\n而且，我們並沒有因爲埃隆或中國的恐懼症而開始下跌。\n\n事實是，熊市在2月份控制了局面。當BTC在47K美元的時候。\n\n現在，我知道2021年給Crypto帶來了很多新的人。你們中的很多人並不\n對技術分析一無所知，所以我...",
      "title": "2021年2月，牛市運行結束。鯨魚不想讓你知道的事。"
    }
  ]
}