{
  "author": "[deleted]",
  "original_created_utc": 1655984239,
  "title": "Why is it a bad thing for your best friend to date your ex?",
  "created_utc": 1656055821,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Personally this has never happened to me, but if it did, I really wouldn&amp;#39;t mind. I&amp;#39;d even be happy for my best friend. I&amp;#39;ve noticed that people around my age consider it to be girl code, but I never understood why. &lt;/p&gt;\n\n&lt;p&gt;My reasoning is this—there&amp;#39;s a reason an ex is an ex, emotions/feelings can&amp;#39;t be helped, and why worry about a relationship that I&amp;#39;m not even in anymore? &lt;/p&gt;\n\n&lt;p&gt;If there was cheating involved it would be a different story, but if my partner breaks up with me bc they claim to have caught feelings for my best friend, that would be totally fine?? I mean, I&amp;#39;d rather be told upfront to save the trouble lol&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/viuuuy/why_is_it_a_bad_thing_for_your_best_friend_to/",
  "subreddit": "TooAfraidToAsk",
  "id": "viuuuy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Personally this has never happened to me, but if it did, I really wouldn't mind.\nI'd even be happy for my best friend. I've noticed that people around my age\nconsider it to be girl code, but I never understood why.\n\nMy reasoning is this—there's a reason an ex is an ex, emotions/feelings can't…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "個人的にはこんなことは一度もなかったが、もしそうなったら、本当に気にしない。\n親友のために喜んでいるようなものだ。同年代の人たちは\nでも、その理由がわからないんです。\n\n元彼が元彼である理由があるんです。",
      "title": "なぜ、親友が元彼と付き合うのは悪いことなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "就我个人而言，这从未发生在我身上，但如果发生了，我真的不会介意。\n我甚至会为我最好的朋友感到高兴。我注意到，在我这个年龄段的人\n认为这是女孩的准则，但我从来不明白为什么。\n\n我的理由是这样的--前任是前任是有原因的，情感/感情不能...",
      "title": "为什么你最好的朋友和你的前任约会是一件坏事？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "就我個人而言，這從未發生在我身上，但如果發生了，我真的不會介意。\n我甚至會爲我最好的朋友感到高興。我注意到，在我這個年齡段的人\n認爲這是女孩的準則，但我從來不明白爲什麼。\n\n我的理由是這樣的--前任是前任是有原因的，情感/感情不能...",
      "title": "爲什麼你最好的朋友和你的前任約會是一件壞事？"
    }
  ]
}