{
  "author": "Saphire1964",
  "the_new_excerpt": "Like many of you long time followers of this subreddit, within the last year I\nhave seen a total shift of not only posts but also discussions.\n\nThis subreddit has become literally the lite version of a certain other\nsubreddit.\n\nAll discussion upvoted now are about these nearly bankrupt, non…",
  "original_created_utc": 1611116115,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "就像你们中的许多人长期关注这个次元，在过去的一年里，我。\n已经看到了一个总的转变，不仅帖子，而且讨论。\n\n这个subreddit已经成为某个其他子社区的精简版。\n子reddit。\n\n现在所有的讨论上票都是关于这些几近破产，非...",
      "title": "现在是时候解决房间里的大象了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "就像你們中的許多人長期關注這個次元，在過去的一年裏，我。\n已經看到了一個總的轉變，不僅帖子，而且討論。\n\n這個subreddit已經成爲某個其他子社區的精簡版。\n子reddit。\n\n現在所有的討論上票都是關於這些幾近破產，非...",
      "title": "現在是時候解決房間裏的大象了。"
    }
  ],
  "title": "It’s about time we address the elephant in the room.",
  "created_utc": 1611122685,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Like many of you long time followers of this subreddit, within the last year I have seen a total shift of not only posts but also discussions.</p>\n\n<p>This subreddit has become literally the lite version of a certain other subreddit.</p>\n\n<p>All discussion upvoted now are about these nearly bankrupt, non-profitable, rich man penny stocks, and I just cringe at the actually upvoted comments that goes into promoting them.</p>\n\n<p>This is a major problem that needs fixed. That one subreddit that I won’t name in fear of this post being flagged is funny since it literally is where this gaudy behavior originated, but I’d like to think this subreddit is reserved for thoughtful discussion that is rooted in either wanting to learn how to invest in stocks OR reasonable analysis on companies.</p>\n\n<p>All I ask is this: mods, please, let’s start a discussion around the state of this sub and really get a pulse on whether or not we should continue to allow this obvious hype-induced behavior.</p>\n</div><!-- SC_ON -->",
  "score": 730,
  "permalink": "/r/stocks/comments/l11gj7/its_about_time_we_address_the_elephant_in_the_room/",
  "subreddit": "stocks",
  "id": "l11gj7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1611311219654
}