{
  "author": "TheProphesizer",
  "original_created_utc": 1647479661,
  "title": "Why do people hate excuses so much even though they just explain the situation?",
  "created_utc": 1647499215,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;People always seem to shame excuses and talk down about their very existence, but why?&lt;br/&gt;\nIf I get a flat tire on my way to work, how are you going to bitch at me about it as if that&amp;#39;s just me being lazy? If my dog runs away and it&amp;#39;s causing me to be late, am I supposed to just leave it run? If my kid is throwing up all over the place and can&amp;#39;t go to daycare, what the fuck do you expect me to do? Just leave him home by himself all day?  &lt;/p&gt;\n\n&lt;p&gt;Even when I was in school i&amp;#39;ve heard teachers bitch about kids who had excuses, but like how is the bus being late in their control? Or if their parents give them rides but they&amp;#39;re late from waiting on their parents, that&amp;#39;s a completely valid reason to be late.  &lt;/p&gt;\n\n&lt;p&gt;People get so mad at others who have excuses, but there&amp;#39;s nothing wrong with excuses. Seems like the worse scenario is if there *wasn&amp;#39;t* an excuse and they were late &amp;quot;because fuck you&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 110,
  "permalink": "/r/NoStupidQuestions/comments/tfyc9q/why_do_people_hate_excuses_so_much_even_though/",
  "subreddit": "NoStupidQuestions",
  "id": "tfyc9q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "People always seem to shame excuses and talk down about their very existence,\nbut why?\nIf I get a flat tire on my way to work, how are you going to bitch at me about\nit as if that's just me being lazy? If my dog runs away and it's causing me to\nbe late, am I supposed to just leave it run? If my kid…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "人はいつも言い訳を恥じ、その存在そのものを悪く言うようです。\nが、なぜ？\nもし私が通勤途中にパンクしたら、どう文句を言うつもりなのでしょう？\nまるで私が怠惰なだけであるかのように。飼い犬が逃げ出して、そのせいで私は\n遅刻しても放っておけというのか？もし、私の子供が...",
      "title": "状況を説明するだけなのに、なぜ人はこんなに言い訳を嫌うのだろう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "人们似乎总是羞于找借口，对他们的存在说三道四。\n但为什么呢？\n如果我在上班的路上爆胎了，你怎么会对我发牢骚？\n就好像那只是我在偷懒一样？如果我的狗跑了，导致我迟到了\n迟到，我就应该让它跑掉吗？如果我的孩子...",
      "title": "为什么人们如此讨厌借口，尽管它们只是解释了情况？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "人們似乎總是羞於找藉口，對他們的存在說三道四。\n但爲什麼呢？\n如果我在上班的路上爆胎了，你怎麼會對我發牢騷？\n就好像那只是我在偷懶一樣？如果我的狗跑了，導致我遲到了\n遲到，我就應該讓它跑掉嗎？如果我的孩子...",
      "title": "爲什麼人們如此討厭藉口，儘管它們只是解釋了情況？"
    }
  ]
}