{
  "author": "mortimers52",
  "the_new_excerpt": "Spoke to an investment advisor in my area at an outing. This man has been an\ninvestment advisor for over a decade and is very well known in the community,\nprobably the most popular local option in our area. He is a very nice gentleman\nand we have many mutual friends. I genuinely have no problem with…",
  "original_created_utc": 1623979751,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "外出先で地元の投資顧問会社と話す。この人は10年以上も投資顧問をやっていて\nこの人は10年以上も投資顧問をやっていて、地域ではとても有名な人です。\n私たちの地域では、おそらく最も人気のある地元の選択肢だと思います。彼はとても素敵な紳士です。\n共通の友人もたくさんいます。私は純粋に、何の問題もなく...",
      "title": "ジャック・ボーグルを知らない投資アドバイザーもいました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在一次郊游中与我所在地区的一位投资顾问交谈过。这个人已经做了十多年的\n投资顾问超过十年，在社区非常有名。\n可能是我们地区最受欢迎的当地选择。他是一位非常好的绅士\n而且我们有很多共同的朋友。我真的没有问题...",
      "title": "投资顾问甚至不知道杰克-博格是谁......"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在一次郊遊中與我所在地區的一位投資顧問交談過。這個人已經做了十多年的\n投資顧問超過十年，在社區非常有名。\n可能是我們地區最受歡迎的當地選擇。他是一位非常好的紳士\n而且我們有很多共同的朋友。我真的沒有問題...",
      "title": "投資顧問甚至不知道傑克-博格是誰......"
    }
  ],
  "title": "Investment Advisor didn't even know who Jack Bogle is...",
  "created_utc": 1623982928,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Spoke to an investment advisor in my area at an outing. This man has been an investment advisor for over a decade and is very well known in the community, probably the most popular local option in our area. He is a very nice gentleman and we have many mutual friends. I genuinely have no problem with the guy but I couldn&#39;t help but judge him harshly when I asked him about Jack Bogle and the Bogle philosophy of indexing. &quot;Bogle? I am not familiar with him.&quot; I couldn&#39;t believe it! How could you give investment advice for a living and not know? (didn&#39;t say that to him) Maybe this is me being a bit of a prick but I was stunned. I know this is a bit of tangent from what you normally see on this sub but though I would share it.</p>\n</div><!-- SC_ON -->",
  "score": 131,
  "permalink": "/r/Bogleheads/comments/o2dacf/investment_advisor_didnt_even_know_who_jack_bogle/",
  "subreddit": "Bogleheads",
  "id": "o2dacf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009742334
}