{
  "author": "Silvergrl1994",
  "original_created_utc": 1639649741,
  "title": "Why do some overweight people seem angry that I have lost weight?",
  "created_utc": 1639670094,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;They often say things like &amp;quot;you can do whatever because you&amp;#39;re skinny now. \n(I still have to lose at least 20 pounds more to be the highest range for normal weight)&lt;/p&gt;\n\n&lt;p&gt;Or at worst they will try and push extra work onto me, the kind that takes more energy because\n&amp;quot;Well were fat so its just easier for you we arnt privileged to be able to lose weight like you are. &lt;/p&gt;\n\n&lt;p&gt;Note ive taken 3 years of slow weight loss going from 225 to 165. \nIt hasnt been easy it takes dedication. \nIve even offered to help them lose weight of they wanted.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/rhntid/why_do_some_overweight_people_seem_angry_that_i/",
  "subreddit": "NoStupidQuestions",
  "id": "rhntid",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "They often say things like \"you can do whatever because you're skinny now. (I\nstill have to lose at least 20 pounds more to be the highest range for normal\nweight)\n\nOr at worst they will try and push extra work onto me, the kind that takes more\nenergy because \"Well were fat so its just easier for…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "よく「痩せたから何でもできるんだよ」とか言われるんですけどね。(I\n正常値の最高値になるには、まだ少なくともあと20ポンドは痩せなければならない。\n体重)\n\nまた、最悪の場合、より多くの仕事を私に押し付けようとします。\nというのも、「太っているのだから、もっと簡単に......」というわけです。",
      "title": "なぜ、太っている人の中には、私が痩せたことを怒っているように見える人がいるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "他们经常说 \"你可以做任何事情，因为你现在很瘦 \"之类的话。(I\n我仍然必须再减掉至少20磅才能达到正常体重的最高范围\n体重）。\n\n或者在最坏的情况下，他们会试图把额外的工作推给我，就是那种需要更多精力的工作。\n因为 \"我们很胖，所以更容易......\"。",
      "title": "为什么有些超重的人似乎对我的减肥很生气？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "他們經常說 \"你可以做任何事情，因爲你現在很瘦 \"之類的話。(I\n我仍然必須再減掉至少20磅才能達到正常體重的最高範圍\n體重）。\n\n或者在最壞的情況下，他們會試圖把額外的工作推給我，就是那種需要更多精力的工作。\n因爲 \"我們很胖，所以更容易......\"。",
      "title": "爲什麼有些超重的人似乎對我的減肥很生氣？"
    }
  ]
}