{
  "author": "InconspicuousCapy",
  "original_created_utc": 1655642281,
  "title": "If I ask this cute guy out who is my co-worker, is that against dating rules?",
  "created_utc": 1655719766,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This guy at work is very attractive to me and anytime he talks to me I feel so happy. Literally the first crush I’ve had in a while. I’m a very straightforward person and want to tell him how attractive he is but am worried that since we work together I’m like not supposed to? Pls help.&lt;/p&gt;\n\n&lt;p&gt;(Edit: I asked him out to go get some snacks with me, wish me luck!)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/vfuafl/if_i_ask_this_cute_guy_out_who_is_my_coworker_is/",
  "subreddit": "TooAfraidToAsk",
  "id": "vfuafl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "This guy at work is very attractive to me and anytime he talks to me I feel so\nhappy. Literally the first crush I’ve had in a while. I’m a very straightforward\nperson and want to tell him how attractive he is but am worried that since we\nwork together I’m like not supposed to? Pls help.\n\n(Edit: I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "職場の男性がとても魅力的で、話しかけられるととても幸せな気持ちになります。\n幸せな気分になります。文字通り、久しぶりのときめきです。私はとても素直な性格なので\nいので、彼にその魅力を伝えたいと思うのですが、職場が同じであ\nを伝えたいのですが、一緒に仕事をしているので、伝えてはいけないのでしょうか？と思っています。\n\n(編集：私...",
      "title": "同僚のかわいい男性を誘ったら、デートのルールに反しますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "工作中的这个人对我很有吸引力，无论什么时候他和我说话，我都觉得很有吸引力。\n快乐。从字面上看，这是我最近一段时间以来的第一次暗恋。我是一个非常直率的人\n想告诉他他有多大的吸引力，但又担心既然我们在一起工作，就不应该告诉他。\n我担心既然我们在一起工作，我就不应该这样做？请帮助我。\n\n(Edit: I...",
      "title": "如果我把这个可爱的家伙约出来，他是我的同事，这是否违反约会规则？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "工作中的這個人對我很有吸引力，無論什麼時候他和我說話，我都覺得很有吸引力。\n快樂。從字面上看，這是我最近一段時間以來的第一次暗戀。我是一個非常直率的人\n想告訴他他有多大的吸引力，但又擔心既然我們在一起工作，就不應該告訴他。\n我擔心既然我們在一起工作，我就不應該這樣做？請幫助我。\n\n(Edit: I...",
      "title": "如果我把這個可愛的傢伙約出來，他是我的同事，這是否違反約會規則？"
    }
  ]
}