{
  "author": "MasonAFK1",
  "the_new_excerpt": "I will be putting $1000 into a single high dividend through my broker and\nletting it sit till retirement with dividends going right back in. I've had a\nhard time finding a high dividend stock I'm optimistic about. All the online\nrecommendations I have seen have been becoming less and less valuable…",
  "original_created_utc": 1618451095,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、ブローカーを通じて1,000ドルを単一の高配当に投資し、退職するまで放置して配当金を戻すつもりです。\nそれを退職するまで放置して、配当金はすぐに戻ってくるようにしています。楽観的な高配当銘柄を見つけるのに苦労しています。\n楽観できる高配当銘柄を見つけるのに苦労しています。私が見たすべてのオンライン\n私が見たオンラインの推奨銘柄は、ますます価値がなくなってきています...。",
      "title": "1000ドルを高配当株に投入"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我将通过我的经纪商投入1000元的单笔高额分红，并。\n让它坐下来，直到退休 与红利去右后卫。我有一个\n很难找到一只我看好的高股息股票。所有的在线\n我看到的推荐已经越来越不值钱了... ...",
      "title": "1000元投入高股息股票"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我將通過我的經紀商投入1000元的單筆高額分紅，並。\n讓它坐下來，直到退休 與紅利去右後衛。我有一個\n很難找到一隻我看好的高股息股票。所有的在線\n我看到的推薦已經越來越不值錢了... ...",
      "title": "1000元投入高股息股票"
    }
  ],
  "title": "$1000 to put into a High Dividend Stock",
  "created_utc": 1618485872,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I will be putting $1000 into a single high dividend through my broker and letting it sit till retirement with dividends going right back in. I&#39;ve had a hard time finding a high dividend stock I&#39;m optimistic about. All the online recommendations I have seen have been becoming less and less valuable year after year (ex: AT&amp;T). If I&#39;m going to put it and forget it I want a stock that has a history of consistent growth or at least trending upward.</p>\n\n<p>Any suggestions?</p>\n\n<p><em>Currently have two shares of $SCHD and one share of $O in my Roth IRA</em></p>\n</div><!-- SC_ON -->",
  "score": 47,
  "permalink": "/r/stocks/comments/mr5028/1000_to_put_into_a_high_dividend_stock/",
  "subreddit": "stocks",
  "id": "mr5028",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171526121
}