{
  "author": "benaffleks",
  "the_new_excerpt": "Sup dudes.\n\nI joined this sub pre 700k subs, and like many of you, got completely drawn into\nthe culture and language. Especially since we live in an era where anything can\noffend anyone, calling each other retards and autists... it's literally a breath\nof fresh air.\n\nThere's no other place on…",
  "original_created_utc": 1611275724,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "Sup帅哥。\n\n我加入了这个子70万前的子，和你们很多人一样，完全被吸引到了。\n的文化和语言。尤其是我们生活在一个什么都可以的时代\n冒犯了任何人，称对方为弱智和自闭症患者... ... 这简直是一口气。\n的新鲜空气。\n\n没有其他地方... ...",
      "title": "Twitter是结束的开始"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Sup帥哥。\n\n我加入了這個子70萬前的子，和你們很多人一樣，完全被吸引到了。\n的文化和語言。尤其是我們生活在一個什麼都可以的時代\n冒犯了任何人，稱對方爲弱智和自閉症患者... ... 這簡直是一口氣。\n的新鮮空氣。\n\n沒有其他地方... ...",
      "title": "Twitter是結束的開始"
    }
  ],
  "title": "Twitter is the beginning of the end",
  "created_utc": 1611288329,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Sup dudes. </p>\n\n<p>I joined this sub pre 700k subs, and like many of you, got completely drawn into the culture and language. Especially since we live in an era where anything can offend anyone, calling each other retards and autists... it&#39;s literally a breath of fresh air.</p>\n\n<p>There&#39;s no other place on earth, where we can talk to each other like this, whilst still having the same level of respect for one another. </p>\n\n<p>Communities like this is fucking precious. It&#39;s like taking a time capsule back to 2000, where calling someone or something &quot;retarded&quot; conveyed a message that wasn&#39;t offensive, but still got a particular point across. Ya know what I mean retards?</p>\n\n<p>The only reason this community can still exist, is because we&#39;re a subreddit. It&#39;s like a niche community inside a larger community. </p>\n\n<p>It&#39;s safe. We aren&#39;t exposed to the outside world. We belong inside this cave of retardation, and it&#39;s&#39; good for us.</p>\n\n<p>Having this twitter account, puts a face, name and voice to WSB. </p>\n\n<p>It&#39;s not fucking good. </p>\n\n<p>It&#39;s been like, 48 hours right? There&#39;s already some absolute cringey material on there, where I don&#39;t want to be associated with this. It&#39;s way too public. It&#39;s drawing too much attention to this community, where we already have enough attention. A healthy dose.</p>\n\n<p>A public twitter account is literally not what this sub needs.</p>\n</div><!-- SC_ON -->",
  "score": 8343,
  "permalink": "/r/wallstreetbets/comments/l2bw46/twitter_is_the_beginning_of_the_end/",
  "subreddit": "wallstreetbets",
  "id": "l2bw46",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1611311230482
}