{
  "author": "Grandma-Willow",
  "the_new_excerpt": "I'm currently working on a small research project about prohibition in Finland\n(1919-1932), and during my reseach, I quickly found that similar prohibitionist\nlaws were in force in a lot of other roughly around the same time :\n\n- The famous USA one (1920-1933)\n- In some Canadian Provinces (but not…",
  "original_created_utc": 1618995209,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は現在、フィンランドの禁酒法（1919-1932）に関する小さな研究プロジェクトに取り組んでいます。\n(1919-1932)についての小さな研究プロジェクトを行っていますが、研究を進めていくうちに、ほぼ同時期に他の多くの国で同様の禁酒法が\n同時期に他の多くの国でも同じような禁酒法が施行されていたことがわかりました。\n\n- 有名なアメリカの禁酒法（1920～1933年\n- カナダのいくつかの州（...ではない）では",
      "title": "1900年代初頭、欧米で起きた禁酒令の波の原因は何だったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我目前正在做一个关于芬兰禁酒的小型研究项目\n(1919-1932)，在我的研究过程中，我很快发现类似的禁酒令\n在我的研究过程中，我很快发现，类似的禁酒法在很多其他国家也大致在同一时期生效了。\n\n- 著名的美国（1920-1933）。\n- 在加拿大的一些省份（但不是...",
      "title": "是什么导致了20世纪初西方世界的禁酒浪潮？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我目前正在做一個關於芬蘭禁酒的小型研究項目\n(1919-1932)，在我的研究過程中，我很快發現類似的禁酒令\n在我的研究過程中，我很快發現，類似的禁酒法在很多其他國家也大致在同一時期生效了。\n\n- 著名的美國（1920-1933）。\n- 在加拿大的一些省份（但不是...",
      "title": "是什麼導致了20世紀初西方世界的禁酒浪潮？"
    }
  ],
  "title": "What caused the alcohol prohibition wave in the Western world in the early 1900's?",
  "created_utc": 1619047513,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m currently working on a small research project about prohibition in Finland (1919-1932), and during my reseach, I quickly found that similar prohibitionist laws were in force in a lot of other roughly around the same time :</p>\n\n<p>- The famous USA one (1920-1933)<br/>\n- In some Canadian Provinces (but not Québec)<br/>\n- In the Faroes Islands (1902-1992 according to the all-mighty Wikipedia)<br/>\n- In Iceland (1915 - gradually legalizing wine, spirit, then beer until 1989)<br/>\n- In Norway, where it affected only distilled drinks and so-called &quot;fortified&quot; wine and beer (1916-1927)<br/>\n- In Finland (1919-1932)</p>\n\n<p>Seeing this list, I couldn&#39;t help but notice they were all largely Protestant countries (please note the cahtolic Québec exception in Canada), but since I&#39;m a total ignorant in religion related stuff, I thought I would as people&#39;s mind here. So, do you think protestantism is linked to the prohibitionnist movement or is it just a coincidence? If yes, though, how?<br/>\nAlso, women&#39;s access to voting rights (at least in Finland, I don&#39;t know about the rest of the countries) is often held as one of the major reasons for suchs laws. If one of you has knowledge about that, I&#39;m also interested to hear their points of view.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/mvbipg/what_caused_the_alcohol_prohibition_wave_in_the/",
  "subreddit": "AskHistorians",
  "id": "mvbipg",
  "is_self": true,
  "media": null,
  "is_video": false
}