{
  "author": "veganic11",
  "the_new_excerpt": "This argument is being used, naively or deceitfully, to divert attention from\nwhat's being produced from the electricity. Electricity is being converted into\nhard money that can't be printed out of thin air. That's why it has value. You\nwant Bitcoin, you pay in electricity or you buy it. This…",
  "original_created_utc": 1613001142,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这一论点被天真地或欺骗性地用来转移人们的注意力。\n什么是由电产生的。电能被转化为\n不能凭空印刷的硬通货。所以它才有价值。你\n想要比特币，就得用电费支付，否则就得买。这个...",
      "title": "不要被浪费电力的FUD所迷惑。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這一論點被天真地或欺騙性地用來轉移人們的注意力。\n什麼是由電產生的。電能被轉化爲\n不能憑空印刷的硬通貨。所以它纔有價值。你\n想要比特幣，就得用電費支付，否則就得買。這個...",
      "title": "不要被浪費電力的FUD所迷惑。"
    }
  ],
  "title": "Don't fall for the electricity waste FUD",
  "created_utc": 1613039892,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This argument is being used, naively or deceitfully, to divert attention from what&#39;s being produced from the electricity. Electricity is being converted into hard money that can&#39;t be printed out of thin air. That&#39;s why it has value. You want Bitcoin, you pay in electricity or you buy it. This incentive has the side effect of keeping the blockchain score decentralised and secure.</p>\n\n<p>Let&#39;s consider the current financial system. Let&#39;s sum up all the electricity used by all the physical banks, all the server rooms, all the office spaces. Would you rather use the electricity to power a centralised corrupt system?</p>\n\n<p>People who use this argument still don&#39;t understand the value that&#39;s being generated and secured by the Bitcoin network. </p>\n\n<p>Fascism is super efficient. But we all rather live under democracies as they are fairer systems. Can&#39;t put it in any simpler terms.</p>\n</div><!-- SC_ON -->",
  "score": 267,
  "permalink": "/r/Bitcoin/comments/lh7lq9/dont_fall_for_the_electricity_waste_fud/",
  "subreddit": "Bitcoin",
  "id": "lh7lq9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728612304
}