{
  "author": "DanMards",
  "original_created_utc": 1641643939,
  "title": "Just stake your assets and calm the f**k down.",
  "created_utc": 1641667358,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I understand that the greed &amp;amp; fear meter is all the way down to 10.&lt;/p&gt;\n\n&lt;p&gt;I also understand this dip is not what people expected after so many ExPeRtS claimed BTC would reach 100k and ETH 10k lmfao&lt;/p&gt;\n\n&lt;p&gt;I also also do understand that any newcomer will be scared af if they just put their Xmas money into crypto.&lt;/p&gt;\n\n&lt;p&gt;What I have learnt though is, if you got any kind of crypto rewards based on staking, then please just lock it up for some solid good months or years and forget about this. It helps you mentally and also it is in my opinion the best call for a long term hodler.&lt;/p&gt;\n\n&lt;p&gt;In my case, I have been sipping coffee watching Reddit go nuts and keeping calm as hell because I have Ethereum staked, CRO staked for the card and in their DeFi Earn (all locked) and the rest of coins I have them staked and all these secured with a hardware wallet which I genuinely find it too much of a hassle to get to start using again for the sake of panic selling.&lt;/p&gt;\n\n&lt;p&gt;It is just better to watch the world burn while you know it will eventually heal up again.&lt;/p&gt;\n\n&lt;p&gt;Stake your coins, earn interest and lock it up for a while. It will help you A LOT mentally.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;NOTE: any PoW hodlers (unstakable coins obviously), try to get them into a DeFi earning system like Compound or Aave. Any centralised ones can be Nexo&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 330,
  "permalink": "/r/CryptoCurrency/comments/ryyj5w/just_stake_your_assets_and_calm_the_fk_down/",
  "subreddit": "CryptoCurrency",
  "id": "ryyj5w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I understand that the greed & fear meter is all the way down to 10.\n\nI also understand this dip is not what people expected after so many ExPeRtS\nclaimed BTC would reach 100k and ETH 10k lmfao\n\nI also also do understand that any newcomer will be scared af if they just put\ntheir Xmas money into…"
}