{
  "author": "Soapy_Illusion_13",
  "original_created_utc": 1658787850,
  "title": "What is it like to have religious or cultural heritage?",
  "created_utc": 1658869062,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been watching a few shows lately that showcase people of different cultural background.  It got me thinking about myself, and how I literally have no culture to speak of.  I was born in the US and have a pretty generic name.  I&amp;#39;m white as a ghost and I don&amp;#39;t really know anything about my cultural roots, and I have never been religious.  It was interesting watching these shows about how many people come together over one significant cultural theme, either by nationality or religion.&lt;/p&gt;\n\n&lt;p&gt;To be honest, outside of my very small family, I don&amp;#39;t really have any other family or friends that I really associate with.  I can&amp;#39;t imagine what it would be like to have a ton of people that share your national heritage or religion.  To me I don&amp;#39;t think it matters, as I really don&amp;#39;t like to attach labels on myself.  I don&amp;#39;t really understand the feeling of wanting to know your ancestry or where you are from, as if that defines you.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not sure if this is a question that could truly be answered, but I&amp;#39;d like to get some responses if I can.  What does it feel like belonging to a culture?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/TrueAskReddit/comments/w8266o/what_is_it_like_to_have_religious_or_cultural/",
  "subreddit": "TrueAskReddit",
  "id": "w8266o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've been watching a few shows lately that showcase people of different cultural\nbackground. It got me thinking about myself, and how I literally have no culture\nto speak of. I was born in the US and have a pretty generic name. I'm white as a\nghost and I don't really know anything about my cultural…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、異なる文化の人々を紹介する番組をいくつか見ています。\nを紹介する番組をいくつか見ています。自分自身について考えさせられました。\nということを考えさせられました。私はアメリカで生まれ、ごく一般的な名前を持っています。私は白人のように\n自分の文化について何も知らないんです。",
      "title": "宗教的・文化的な遺産を持つということはどういうことですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近在看一些展示不同文化背景的人的节目。\n背景的人。这让我想到了我自己，以及我如何在字面上没有文化\n说的。我出生在美国，有一个很普通的名字。我是个白人\n我对自己的文化一无所知......",
      "title": "拥有宗教或文化遗产是一种什么样的感觉？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近在看一些展示不同文化背景的人的節目。\n背景的人。這讓我想到了我自己，以及我如何在字面上沒有文化\n說的。我出生在美國，有一個很普通的名字。我是個白人\n我對自己的文化一無所知......",
      "title": "擁有宗教或文化遺產是一種什麼樣的感覺？"
    }
  ]
}