{
  "author": "babossa77",
  "original_created_utc": 1654171222,
  "title": "Investing in Luna 2.0 is like sending a scammer money so he can send you your previously stolen money back",
  "created_utc": 1654180295,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;You know that classic attempt from a scammer to grab more money by asking their victims to send him more money, so he can send them their previously stolen money back?&lt;/p&gt;\n\n&lt;p&gt;This is exactly what the whole Luna 2.0 situation feels like. People lost millions and now they are investing in a shitcoin in the hope to get that millions back.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;But there was an airdrop!? So they do&amp;#39;nt invest?!&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Yea, but in order for the coin to be worth something, other people will have to invest and put money into it, and there are people that are actively doing so. These are most likely the same people that already were invested in Luna before and want to make more gains to cover their losses.&lt;/p&gt;\n\n&lt;p&gt;But they are gonna lose all of it. And there are already people celebrating the new blockchain by making claims like &lt;em&gt;biggest airdrop ever&lt;/em&gt; or &lt;em&gt;most decentralized blockchain&lt;/em&gt; etc. People will never learn...&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 720,
  "permalink": "/r/CryptoCurrency/comments/v378h0/investing_in_luna_20_is_like_sending_a_scammer/",
  "subreddit": "CryptoCurrency",
  "id": "v378h0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "You know that classic attempt from a scammer to grab more money by asking their\nvictims to send him more money, so he can send them their previously stolen\nmoney back?\n\nThis is exactly what the whole Luna 2.0 situation feels like. People lost\nmillions and now they are investing in a shitcoin in the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "詐欺師が被害者にもっとお金を送るように頼んで、もっとお金を取ろうとする典型的な試みを知っている。\n被害者にもっと金を送れ、そうすれば前に盗んだ金を送り返すことができる。\nを送り返すというものです。\n\nルナ2.0の状況は、まさにこれと同じような感じです。人々が失った\n何百万ドルも失って、今、彼らはクソコインに投資している...",
      "title": "Luna 2.0に投資することは、詐欺師にお金を送って、前に盗まれたお金を返してもらうようなものだ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你知道，诈骗者为了攫取更多的钱财，要求受害者给他寄更多的钱，这是典型的企图。\n受害者给他寄更多的钱，这样他就可以把之前偷来的钱寄给他们。\n的钱？\n\n这正是整个Luna 2.0情况的感觉。人们失去了\n数百万，现在他们正在投资一个狗屎币，在...",
      "title": "投资Luna 2.0就像给骗子送钱，这样他就能把你之前偷来的钱送回去。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你知道，詐騙者爲了攫取更多的錢財，要求受害者給他寄更多的錢，這是典型的企圖。\n受害者給他寄更多的錢，這樣他就可以把之前偷來的錢寄給他們。\n的錢？\n\n這正是整個Luna 2.0情況的感覺。人們失去了\n數百萬，現在他們正在投資一個狗屎幣，在...",
      "title": "投資Luna 2.0就像給騙子送錢，這樣他就能把你之前偷來的錢送回去。"
    }
  ]
}