{
  "author": "bikbar1",
  "original_created_utc": 1641728528,
  "title": "This down market shows why hamsters are better investors than most humans.",
  "created_utc": 1641749621,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Mr Goxx the crypto trading hamster had performed better than most human investors at the same time period.&lt;/p&gt;\n\n&lt;p&gt;How did a fukin hamster was able to bit your average crypto investors ? What&amp;#39; the secret ?&lt;/p&gt;\n\n&lt;p&gt;Just look at the reactions of most cryptonuts of this sub during the ongoing market carsh and you will find your answer.&lt;/p&gt;\n\n&lt;p&gt;A hamster can&amp;#39;t read and so doesn&amp;#39;t know anything about bull markets, bear markets or crab markets. Unlike humans their investment process is not emotionally hampered by the fear and greed.&lt;/p&gt;\n\n&lt;p&gt;Hamsters are not suceptible to FUD fear, uncertainty and doubt. They are not going to YOLO their lifesavings to buy a pupcum coin at ATH because of FOMO.&lt;/p&gt;\n\n&lt;p&gt;Unlike most of us hamsters don&amp;#39;t buy high and sell low because of FOMO and fear.&lt;/p&gt;\n\n&lt;p&gt;Be like a hamster and free yourself from the emotions caused by regular checking charts and watching too much YouTube influencers.&lt;/p&gt;\n\n&lt;p&gt;You know that having a good strategy and following it religiously is the only way that can do better than a fookin hamster.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 313,
  "permalink": "/r/CryptoCurrency/comments/rzpxwr/this_down_market_shows_why_hamsters_are_better/",
  "subreddit": "CryptoCurrency",
  "id": "rzpxwr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Mr Goxx the crypto trading hamster had performed better than most human\ninvestors at the same time period.\n\nHow did a fukin hamster was able to bit your average crypto investors ? What'\nthe secret ?\n\nJust look at the reactions of most cryptonuts of this sub during the ongoing\nmarket carsh and you…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号取引ハムスターのGoxx氏は、ほとんどの人間よりも優れた業績を上げていました。\n同じ時期の投資家。\n\nなぜ、ハムスターが一般の暗号投資家に噛みついたのか？それは\nその秘密は？\n\nこのサブのほとんどのcryptonutsの反応を見れば、現在進行中の\n市場大混乱の中、あなたは...",
      "title": "この下げ相場を見ると、ハムスターが人間よりも優れた投資家である理由がよくわかります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Goxx先生这只加密货币交易仓鼠在同一时期的表现比大多数人类投资者更好。\n在同一时期的投资者。\n\n一只该死的仓鼠是如何能够咬住你的普通加密货币投资者的？什么\n秘密是什么？\n\n只要看看这个子的大多数加密投资者在持续的\n市场的反应，你就...",
      "title": "这个下跌的市场显示了为什么仓鼠比大多数人类更适合投资。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Goxx先生這隻加密貨幣交易倉鼠在同一時期的表現比大多數人類投資者更好。\n在同一時期的投資者。\n\n一隻該死的倉鼠是如何能夠咬住你的普通加密貨幣投資者的？什麼\n祕密是什麼？\n\n只要看看這個子的大多數加密投資者在持續的\n市場的反應，你就...",
      "title": "這個下跌的市場顯示了爲什麼倉鼠比大多數人類更適合投資。"
    }
  ]
}