{
  "author": "bikbar1",
  "original_created_utc": 1641728528,
  "title": "This down market shows why hamsters are better investors than most humans.",
  "created_utc": 1641749621,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Mr Goxx the crypto trading hamster had performed better than most human investors at the same time period.&lt;/p&gt;\n\n&lt;p&gt;How did a fukin hamster was able to bit your average crypto investors ? What&amp;#39; the secret ?&lt;/p&gt;\n\n&lt;p&gt;Just look at the reactions of most cryptonuts of this sub during the ongoing market carsh and you will find your answer.&lt;/p&gt;\n\n&lt;p&gt;A hamster can&amp;#39;t read and so doesn&amp;#39;t know anything about bull markets, bear markets or crab markets. Unlike humans their investment process is not emotionally hampered by the fear and greed.&lt;/p&gt;\n\n&lt;p&gt;Hamsters are not suceptible to FUD fear, uncertainty and doubt. They are not going to YOLO their lifesavings to buy a pupcum coin at ATH because of FOMO.&lt;/p&gt;\n\n&lt;p&gt;Unlike most of us hamsters don&amp;#39;t buy high and sell low because of FOMO and fear.&lt;/p&gt;\n\n&lt;p&gt;Be like a hamster and free yourself from the emotions caused by regular checking charts and watching too much YouTube influencers.&lt;/p&gt;\n\n&lt;p&gt;You know that having a good strategy and following it religiously is the only way that can do better than a fookin hamster.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 313,
  "permalink": "/r/CryptoCurrency/comments/rzpxwr/this_down_market_shows_why_hamsters_are_better/",
  "subreddit": "CryptoCurrency",
  "id": "rzpxwr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Mr Goxx the crypto trading hamster had performed better than most human\ninvestors at the same time period.\n\nHow did a fukin hamster was able to bit your average crypto investors ? What'\nthe secret ?\n\nJust look at the reactions of most cryptonuts of this sub during the ongoing\nmarket carsh and you…"
}