{
  "author": "olderfucker1",
  "original_created_utc": 1635158675,
  "title": "How even Reddit has changed their mind on Moons Recently, If this doesn't get you Bullish I don't know what will!",
  "created_utc": 1635172441,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The real OG&#39;s of moons know how Reddit has been cracking down on several X sites on moons and also how strict they are with the <strong>TOS</strong> and if you guys dont know what tos is, i gotcha -</p>\n\n<p>This is from 2 months ago -  This directly comes from reddit remember</p>\n\n<blockquote>\n<p>T Moons is against the terms of service. To deter this activity, we have removed several subreddits dedicated to T Moons and will continue to monitor for similar subreddits.</p>\n</blockquote>\n\n<p>this is the words from TOS</p>\n\n<blockquote>\n<p>Community Points have no monetary value (i.e., are not a cash account or equivalent), cannot be S to other users, and cannot be X for cash or for any other goods and services outside of Reddit’s virtual goods or services.</p>\n</blockquote>\n\n<p>yall read that? <strong>YOU SHOULD BECAUSE THIS IS VERY IMPORTANT</strong></p>\n\n<p>Now onto the change ---- you guys might have known about new community points launching for sub hiphop and while this topic was raised in the CC telegram group yesterday, a new revised version of community points pdf was uploaded and it had lot of bullish changes --</p>\n\n<p>here comes the big deal --- <em>drumrolls please</em></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/ej4sp4i5skv71.png?width=718&amp;format=png&amp;auto=webp&amp;s=010d2811e098bb7fd28c5ec6eb786967896dcdd2\">https://preview.redd.it/ej4sp4i5skv71.png?width=718&amp;format=png&amp;auto=webp&amp;s=010d2811e098bb7fd28c5ec6eb786967896dcdd2</a></p>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>Community Points are ERC-20 Ethereum tokens. Over time, as Community Points migrate out  </p>\n\n<p>of beta to the main Ethereum blockchain, you can use your Community Points anywhere your  </p>\n\n<p>community hangs out and anywhere they’re supported. They are built to be compatible with  </p>\n\n<p>major crypto wallets and usable on other apps and websites.  </p>\n\n<p>You can create custom tools for Community Points in novel ways because they are based on  </p>\n\n<p>the ERC-20 Ethereum standard. For example, <strong>you can accept Points as proof of Reddit</strong>  </p>\n\n<p><strong>reputation on your site, create private spaces for Points holders, or accept Points in exchange</strong>  </p>\n\n<p><strong>for goods and services.</strong></p>\n</blockquote>\n\n<p>I dont need to explain anything on this now you guys know it,</p>\n\n<p>and i think its time to take away the restriction on posting about *X sites on the sub,</p>\n</div><!-- SC_ON -->",
  "score": 201,
  "permalink": "/r/CryptoCurrency/comments/qfdym4/how_even_reddit_has_changed_their_mind_on_moons/",
  "subreddit": "CryptoCurrency",
  "id": "qfdym4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The real OG's of moons know how Reddit has been cracking down on several X sites\non moons and also how strict they are with the TOS and if you guys dont know\nwhat tos is, i gotcha -\n\nThis is from 2 months ago - This directly comes from reddit remember\n\n> T Moons is against the terms of service. To…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ムーンの本物のOGたちは、Redditがムーンに関するいくつかのXサイトを取り締まっていることを知っています。\nまた、TOSがどれだけ厳しいかということも知っています。\nTOSとは何かを知らない人は、私に任せてください。\n\nこれは2ヶ月前のものです - これは直接redditから来ています。\n\n> Tムーンは利用規約違反です。To...",
      "title": "最近では、Redditでも月に対する考え方が変わってきています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "真正的月亮OG们知道Reddit是如何打击几个X站点的。\n和他们对TOS的严格要求，如果你们不了解\n什么是TOS，我知道了\n\n这是从2个月前开始的 - 这直接来自reddit记得\n\n> T Moons是违反服务条款的。为了...",
      "title": "最近，连Reddit都改变了对月球的看法，如果这还不能让你看涨，我不知道什么能让你看涨。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "真正的月亮OG們知道Reddit是如何打擊幾個X站點的。\n和他們對TOS的嚴格要求，如果你們不瞭解\n什麼是TOS，我知道了\n\n這是從2個月前開始的 - 這直接來自reddit記得\n\n> T Moons是違反服務條款的。爲了...",
      "title": "最近，連Reddit都改變了對月球的看法，如果這還不能讓你看漲，我不知道什麼能讓你看漲。"
    }
  ]
}