{
  "author": "imawfullyaverage",
  "the_new_excerpt": "Let me preface this by saying I have made bank off DOGE (bought 925k at ~0.023,\ncheck my last post) and that I love the memes and the community.\n\nAs you all probably know, DOGE has now hit the mainstream media big-time and is\nmaking waves in the financial space, drawing in new faces by the…",
  "original_created_utc": 1612724781,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我先说一下，我在DOGE上赚了钱（在约0.023的时候买了925k。\n查看我的上一篇文章），我喜欢这个备忘录和社区。\n\n大家可能都知道，DOGE现在已经在主流媒体上大放异彩，并且是\n在金融领域掀起波澜，吸引新的面孔，由...",
      "title": "不受欢迎的意见。DOGE很好玩，但却在积极地将加密领域非法化。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我先說一下，我在DOGE上賺了錢（在約0.023的時候買了925k。\n查看我的上一篇文章），我喜歡這個備忘錄和社區。\n\n大家可能都知道，DOGE現在已經在主流媒體上大放異彩，並且是\n在金融領域掀起波瀾，吸引新的面孔，由...",
      "title": "不受歡迎的意見。DOGE很好玩，但卻在積極地將加密領域非法化。"
    }
  ],
  "title": "Unpopular opinion: DOGE is fun, but is actively delegitimizing the crypto space",
  "created_utc": 1612749372,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Let me preface this by saying I have made bank off DOGE (bought 925k at ~0.023, check my last post) and that I love the memes and the community.</p>\n\n<p>As you all probably know, DOGE has now hit the mainstream media big-time and is making waves in the financial space, drawing in new faces by the thousands. This is fun and all, but I&#39;m worried it&#39;s detrimental to the overall health of the cryptocurrency space, and might also have something to do with the correction we&#39;re currently in.</p>\n\n<p>For most of you regulars in here, DOGE is simply a meme that is fun to trade, but for a lot of people, DOGE is a genuine investment. I have already had discussions with several people about the potential price targets for DOGE, where they&#39;re trying to make the case for a $100 price target, which even long-term is extremely unlikely. Other people that are new to crypto in facebook groups genuinely ask what we think about DOGE as a long-term investment, like they would for BTC, ETH and other solid projects. <a href=\"https://imgur.com/a/KYvEOmi\">Here</a>&#39;s an example of someone genuinely believing the technology behind DOGE is &quot;fantastic&quot;. People are risking their family savings investing in DOGE, not knowing it&#39;s likely to dump once the hype staves off. </p>\n\n<p>Presumably most here would know that DOGE has no maximum supply or halving mechanism, so it&#39;ll keep printing coins into infinity, essentially reducing the value of the coins held by hodlers as soon as the demand lowers. It has no inherent value beyond its memes and community, and so for long-time traders seeing that DOGE is still rallying while everything else is dropping, is creating major uncertainty. Additionally, various celebrities are actively tweeting about DOGE, skyrocketing its price, rendering technical analysis completely obsolete. How are you supposed to make good buys if fundamentals and technical analysis no longer matters? </p>\n\n<p>Also, at this point, <a href=\"https://www.coinexplorer.net/DOGE/richlist\">one single hodler currently sits on 28,72% of all DOGE in circulation</a>. The top 16 bagholders have over 50% of all DOGE. That is an issue. </p>\n\n<p>Make of this what you will, but for me, I think that this is a major issue that we need to address. I want cryptocurrencies to succeed as they&#39;re precisely what we need in the world right now. As opposed to Robinhood, cryptocurrencies <em>actually</em> democratize finance, and thus the world, so it&#39;s extremely important we do our best to make sure cryptocurrencies are taken seriously.</p>\n</div><!-- SC_ON -->",
  "score": 598,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/V7NIdGaUs6AiiNOQfWSAPj1A4kG0AFCa2B275LhR2Co.jpg?auto=webp&s=3c6350ace0a5de27f7c75ea458e5866ac86a05c4",
          "width": 585,
          "height": 193
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/V7NIdGaUs6AiiNOQfWSAPj1A4kG0AFCa2B275LhR2Co.jpg?width=108&crop=smart&auto=webp&s=dcc9f0a14c4a39f043edd3b3722664e238d44981",
            "width": 108,
            "height": 35
          },
          {
            "url": "https://external-preview.redd.it/V7NIdGaUs6AiiNOQfWSAPj1A4kG0AFCa2B275LhR2Co.jpg?width=216&crop=smart&auto=webp&s=024dee35466e12a0231914e32eeee9c6450c51ab",
            "width": 216,
            "height": 71
          },
          {
            "url": "https://external-preview.redd.it/V7NIdGaUs6AiiNOQfWSAPj1A4kG0AFCa2B275LhR2Co.jpg?width=320&crop=smart&auto=webp&s=e776984f2db25c0a063e62b4361f7bf20707e64b",
            "width": 320,
            "height": 105
          }
        ],
        "variants": {},
        "id": "3Vq0UWtusHO8KRwuMh_n90ZydM3rv2n1LN3eT-DZLRY"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/let0nc/unpopular_opinion_doge_is_fun_but_is_actively/",
  "subreddit": "CryptoCurrency",
  "id": "let0nc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123195575
}