{
  "author": "AskScienceModerator",
  "the_new_excerpt": "Rare diseases and genetics: Rare diseases affect more than 300 million people\nglobally, but few have approved treatments. Because the majority of rare\ndiseases are genetic, gene-based approaches offer promise for developing new\ntherapies. In observance of Rare Disease…",
  "original_created_utc": 1614081620,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "罕见病与遗传学。罕见病影响3亿多人\n在全球范围内，但获得批准的治疗方法却很少。因为大多数罕见的\n疾病是遗传性的，基于基因的方法为开发新产品提供了希望。\n疗法。为纪念罕见病...",
      "title": "AskScience AMA系列。我们是美国国立卫生研究院的罕见病专家和主任，有什么问题都可以问我们!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "罕見病與遺傳學。罕見病影響3億多人\n在全球範圍內，但獲得批准的治療方法卻很少。因爲大多數罕見的\n疾病是遺傳性的，基於基因的方法爲開發新產品提供了希望。\n療法。爲紀念罕見病...",
      "title": "AskScience AMA系列。我們是美國國立衛生研究院的罕見病專家和主任，有什麼問題都可以問我們!"
    }
  ],
  "title": "AskScience AMA Series: We are rare disease experts and directors with the NIH, ask us anything!",
  "created_utc": 1614103988,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Rare diseases and genetics: Rare diseases affect more than 300 million people globally, but few have approved treatments. Because the majority of rare diseases are genetic, gene-based approaches offer promise for developing new therapies. In observance of <a href=\"https://ncats.nih.gov/news/events/rdd\">Rare Disease Day</a> coming up on February 28, we&#39;re a team of experts here raising awareness of rare diseases, advancing clinical research on them and providing resources to the rare diseases community. We&#39;ll be here at 1 p.m. (ET, 18 UT), ask us anything!</p>\n\n<ul>\n<li><a href=\"https://www.nih.gov/about-nih/who-we-are/nih-director/biographical-sketch-francis-s-collins-md-phd\">Dr. Francis Collins</a>, NIH Director</li>\n<li><a href=\"https://ncats.nih.gov/director/bio\">Dr. Christopher Austin</a>, Director, National Center for Advancing Translational Sciences (NCATS)</li>\n<li><a href=\"https://ncats.nih.gov/staff/pariserar\">Dr. Anne Pariser</a>, Director, Office of Rare Diseases Research at NCATS</li>\n</ul>\n\n<p>Username: <a href=\"/u/NIHGov\">/u/NIHGov</a></p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/askscience/comments/lqgs7a/askscience_ama_series_we_are_rare_disease_experts/",
  "subreddit": "askscience",
  "id": "lqgs7a",
  "is_self": true,
  "media": null,
  "is_video": false
}