{
  "author": "StefansLair",
  "original_created_utc": 1645478767,
  "title": "BEGINNERS GUIDE to CRYPTOCURRENCY - All You Need to Know if You're Just Starting Out!",
  "created_utc": 1645497447,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi all! This is going to be a &lt;strong&gt;VERY&lt;/strong&gt; long post, I did my best to explain the things I struggled with at the beginning of my Crypto journey. I am not an expert by any means, but I feel I can provide valuable information to those newer than me who are trying to get started but are overwhelmed by the amount of information on the internet.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;I also have a Crypto/Finance &lt;a href=\"https://www.youtube.com/channel/UCZPtriLb37Vth1KQ2u7PmGw\"&gt;Youtube Channel&lt;/a&gt; and the text below is the transcript of my video. If you will gain some useful knowledge and have some time, I would &lt;strong&gt;really&lt;/strong&gt; appreciate if you&amp;#39;d take a look. :) &lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TOPICS I COVER IN THIS POST&lt;/strong&gt;:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Cryptocurrency&lt;/li&gt;\n&lt;li&gt;Centralized vs Decentralized&lt;/li&gt;\n&lt;li&gt;Distributed Ledger&lt;/li&gt;\n&lt;li&gt;Blockchain&lt;/li&gt;\n&lt;li&gt;Satoshi&lt;/li&gt;\n&lt;li&gt;Bitcoin&lt;/li&gt;\n&lt;li&gt;White Paper&lt;/li&gt;\n&lt;li&gt;Proof of Work&lt;/li&gt;\n&lt;li&gt;Mining&lt;/li&gt;\n&lt;li&gt;Proof of Stake&lt;/li&gt;\n&lt;li&gt;Ethereum&lt;/li&gt;\n&lt;li&gt;Smart Contracts&lt;/li&gt;\n&lt;li&gt;Coin vs Token&lt;/li&gt;\n&lt;li&gt;Tokenomic&lt;/li&gt;\n&lt;li&gt;Exchanges&lt;/li&gt;\n&lt;li&gt;Wallets&lt;/li&gt;\n&lt;li&gt;Mnemonic Phrases&lt;/li&gt;\n&lt;li&gt;Types of Crypto&lt;/li&gt;\n&lt;li&gt;DEFI&lt;/li&gt;\n&lt;li&gt;DEXs&lt;/li&gt;\n&lt;li&gt;Lending and Borrowing DAPPs&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;h1&gt;1. Cryptocurrency&lt;/h1&gt;\n\n&lt;p&gt;Let’s start from ground zero: cryptocurrencies. &lt;/p&gt;\n\n&lt;p&gt;Everyone has heard of this term, but few know what it means. It derives from two words: cryptography and currency. &lt;strong&gt;Cryptography&lt;/strong&gt; is at the basis of all cryptocurrencies as all of them depend on it to secure transaction records, to control the creation of additional coins, to verify the transfer of coins, and most importantly, to make them decentralized.&lt;/p&gt;\n\n&lt;p&gt;Secondly, they’re called &lt;strong&gt;currency&lt;/strong&gt; because well, cryptos are a currency.. &lt;del&gt;for the most part&lt;/del&gt;.&lt;/p&gt;\n\n&lt;p&gt;Now, a cryptocurrency is a form of digital asset, so online, based on a network that is distributed across a vast number of computers, and they are based on something referred to as a distributed ledger, or, more specifically, blockchain technology.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;h1&gt;2. Centralized and Decentralized&lt;/h1&gt;\n\n&lt;p&gt;The difference between centralized and decentralized is that in a centralized system, as the name suggests, the power and control are in the hands of a central authority, usually it’s a very small and limited group of individuals, such as the owner of a business, or the director of bank, whereas a decentralized system is controlled by everyone who partakes in that system. In the case of crypto, it can be you, me, and everyone else.&lt;/p&gt;\n\n&lt;p&gt;The main point of cryptocurrencies is that they are decentralized, which contrasts with the traditional monetary payment systems such as banks and financial institutions, which are heavily centralized.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;h1&gt;3. Distributed Ledger&lt;/h1&gt;\n\n&lt;p&gt;A distributed ledger is a &lt;strong&gt;PUBLIC&lt;/strong&gt; decentralized database that is shared and synchronized by multiple people who have equal access to all the information shared across that network and can own an identical copy of it. Nobody is cut out, and everyone who wishes to partake in it, can do so.&lt;/p&gt;\n\n&lt;p&gt;One of the types of these distributed ledger databases is none other than blockchain, which is what cryptocurrencies are fundamentally based on.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;h1&gt;4. Blockchain&lt;/h1&gt;\n\n&lt;p&gt;A blockchain is a database that is shared among the participants, also called computers or nodes, of a network, and it stores information digitally. They are best known for their crucial role in cryptocurrency systems for maintaining a secured and decentralized record of transactions.&lt;/p&gt;\n\n&lt;p&gt;The mind-blowing innovation is that this technology guarantees the security of the data stored in it, without the need for a trusted third party, in other words not only there will be no need to have a central authority, but this technology was designed to be entirely public to anyone. You don’t see a bank’s internal transaction, you don’t see a company’s financial statements, but you see each Bitcoin user’s balance and transactions.&lt;/p&gt;\n\n&lt;p&gt;Another key difference between a typical database and a blockchain is how the data is structured. A blockchain, collects information together in groups, known as blocks, that hold sets of information together. These digital blocks, which are blocks just metaphorically speaking but not in the literal sense, have certain storage capacities, for example, each Bitcoin’s block is &lt;strong&gt;1MB&lt;/strong&gt; and can contain on average &lt;strong&gt;2500 transactions&lt;/strong&gt;.&lt;/p&gt;\n\n&lt;p&gt;When a block is filled and completed, it is linked to the previous completed block in a way we’ll see shortly, effectively forming a chain of blocks containing data, known as a blockchain.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;h1&gt;5. Satoshi&lt;/h1&gt;\n\n&lt;p&gt;This brings us to the first and most famous cryptocurrency that everyone knows, Bitcoin. It was created in &lt;strong&gt;January 2009&lt;/strong&gt; by the pseudonymous &lt;strong&gt;Satoshi Nakamoto&lt;/strong&gt;. No one to this day knows who he is, and people have been speculating about his identity for over a decade with speculations ranging from, for example, that he may have been a group of people rather than a single individual, or perhaps even one of the three letter agencies. There are a few valid candidates, but no one knows for sure.&lt;/p&gt;\n\n&lt;p&gt;One thing however that is for sure is Satoshi’s hatred for banks and for the people at the top who hold the power to control financial systems to the point where they can willingly cause citizens to lose their livelihoods, homes, and sometimes, even lives through financial crashes, without any repercussion, such as the 2008 housing market crash.&lt;/p&gt;\n\n&lt;p&gt;Satoshi is said to own close to &lt;strong&gt;1 million Bitcoins&lt;/strong&gt; divided in multiple addresses, which would place him at a net worth of 40 billion dollars today if it’s true, and IF he is still alive, and those are two big ifs.&lt;/p&gt;\n\n&lt;h1&gt;6. White Paper&lt;/h1&gt;\n\n&lt;p&gt;Satoshi published the white paper of BTC in &lt;strong&gt;October 2008.&lt;/strong&gt; A white paper, in cryptocurrency, is a document released by a project’s funders, not only in the case of Bitcoin, but in the case of any &lt;del&gt;serious&lt;/del&gt; crypto project.&lt;/p&gt;\n\n&lt;p&gt;A white paper gives technical information about a project and its future roadmap. Satoshi’s vision for Bitcoin was quote “A purely peer-to-peer version of electronic cash would allow online payments to be sent directly from one party to another without going through a financial institution&amp;quot;. He wanted people to have the means to make payments with a currency, Bitcoin, without being under the control of the big guys at the top while doing so.&lt;/p&gt;\n\n&lt;p&gt;But then begs the question.. how is consensus achieved? How do all the participants agree which transactions are valid and which are not, in a situation where everything is public and everyone, including bad people, can see everything?&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;h1&gt;7. Consensus Mechanism&lt;/h1&gt;\n\n&lt;p&gt;Here comes into play the part of consensus mechanisms. It is the process through which the nodes in charge of a blockchain database achieve consensus on the validity of each transaction and decide if to proceed with it, or not.&lt;/p&gt;\n\n&lt;p&gt;Being that everyone can take part in a blockchain we needed something to prevent any malicious user trying to hijack the network, for example, by creating fake transactions where he gives himself all the Bitcoins in existence and becomes the richest person in the world. This is also known as the double spending problem, and Bitcoin was the first system to solve it.&lt;/p&gt;\n\n&lt;p&gt;To solve this, cryptocurrencies need some type of consensus method, through which, everyone taking part in the system, comes to a mutual agreement. There are multiple types of consensus mechanisms, &lt;strong&gt;the two main ones are Proof of Work and Proof of Stake&lt;/strong&gt;.&lt;/p&gt;\n\n&lt;h1&gt;8. Proof of Work&lt;/h1&gt;\n\n&lt;p&gt;Proof of Work (PoW) is a decentralized consensus mechanism that requires all the participants of a network to spend computational power, solving a complex mathematical equation, commonly referred to as mining, to prevent anybody from manipulating the system.&lt;/p&gt;\n\n&lt;p&gt;Now, let’s start with an example to make things easier.&lt;/p&gt;\n\n&lt;p&gt;There are two friends, Bob and Alice. Each have $20 worth of Bitcoin and Bob sends Alice $10 of those $20, in a Bitcoin transaction. The transaction is placed in a block together with about 2500 other transactions, the block then gets confirmed and recorded into the blockchain. Now, Bob effectively has $10 worth of BTC, and Alice has $30 worth of BTC.&lt;/p&gt;\n\n&lt;p&gt;To avoid Bob claiming he never sent that $10 worth of Bitcoin in the original block, there was let’s call it a code, more specifically &lt;strong&gt;hash&lt;/strong&gt;, placed in that block and it looked like this:&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;000000000019d6689c085ae165831e934ff763ae46a2a6c172b3f1b60a8ce26f&lt;/strong&gt; &lt;/p&gt;\n\n&lt;p&gt;(First Bitcoin&amp;#39;s Block Hash)&lt;/p&gt;\n\n&lt;p&gt;That hash uniquely identified the block which got filled with Bob and Alice’s transaction. It was created through an algorithm, and it was a sort of summary of all those unique 2500 transactions that took place in that block.&lt;/p&gt;\n\n&lt;p&gt;The following block will not only have its own unique hash as well, but that hash will merge with Bob and Alice’s block’s hash, forming a final hash and connecting the two blocks together, effectively creating a chain of linked blocks where each new block is connected to the previous one.&lt;/p&gt;\n\n&lt;p&gt;The third block will again have its own hash merged with the hash of the second block, which was merged with the hash of Bob and Alice’s block.&lt;/p&gt;\n\n&lt;p&gt;The catch point is, if just 1 of those 2500 transactions in each block is altered, the entire hash for that block will change, even if the other 2499 transactions are intact. This will inevitably cause the second block to be invalid as its hash wouldn’t match with the first block’s hash, which will cause the third block to not match with the hash of the second one and so on, and so on, effectively creating a chain  of events. &lt;del&gt;I know, this joke was not funny at all, but I wanted to say it.&lt;/del&gt;&lt;/p&gt;\n\n&lt;p&gt;Do you see where I am getting with this?&lt;/p&gt;\n\n&lt;p&gt;The transactions are in the blocks, and all the blocks are linked together.&lt;/p&gt;\n\n&lt;p&gt;If Bob would alter his original transaction, the hash of the block in which the transaction was placed would change and would make all the following blocks with all the transactions in them, invalid. To successfully fake or alter a transaction, he would need to control a majority, at least 51%, of the entire computing power of the Bitcoin blockchain, to manipulate the following blocks quicker than the honest participants of the network.&lt;/p&gt;\n\n&lt;p&gt;All of this, finally brings us to mining.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;h1&gt;9. Mining&lt;/h1&gt;\n\n&lt;p&gt;Mining, which is applied to any cryptocurrency based on Proof of Work such as Bitcoin, Ethereum (for now), Dogecoin, Litecoin and many more, is the process by which new coins enter in circulation. It is also the way a network confirms new transactions, and it is a critical component of a blockchain ledger&amp;#39;s maintenance and development.&lt;/p&gt;\n\n&lt;p&gt;Participants need to use their computational power through specific mining hardware, called application-specific integrated circuit, or &lt;strong&gt;ASIC&lt;/strong&gt;s, to solve a complex and random mathematical equation in order to create a new block.&lt;/p&gt;\n\n&lt;p&gt;Put in simple terms, those very powerful machines have to guess a certain number. The more computer power you have, the higher the chances to guess that number before anyone else does are.&lt;/p&gt;\n\n&lt;p&gt;Whoever guesses it first, will effectively create a new block and new Bitcoins (or any other crypto that is mined) into existence, and those Bitcoins will be rewarded to them as a reward for the time and effort they had to put in to sustain the network.&lt;/p&gt;\n\n&lt;p&gt;This process allows for the removal of bad players from the ecosystem, as taking part in it requires huge amounts of resources such as space, electricity, and especially the costs of mining hardware.&lt;/p&gt;\n\n&lt;p&gt;You need to know however that not all Proof of Work cryptos require ASIC card to be mined. It depends on the algorithm on which a crypto is built on. Any mineable crypto can be mined in one of two ways, either through ASIC cards or normal GPUs such as Nvidia or AMD cards.&lt;/p&gt;\n\n&lt;p&gt;For example, to mine Ethereum, the second largest crypto, you can do it from your computer’s graphics card and does not require you to buy any additional components, and that’s why all Nvidia’s new 3000 series GPUs are always sold out.&lt;/p&gt;\n\n&lt;p&gt;Mining has extensively been up to debate as it consumes a lot of electricity due to the huge power consumption of graphics cards. Back in the day, you could mine Bitcoin from your laptop, but those days are long gone now. &lt;/p&gt;\n\n&lt;p&gt;Now. Here is where the genius of Satoshi comes into place, which is applied to any proof of work cryptocurrency, not just Bitcoin.&lt;/p&gt;\n\n&lt;p&gt;The more powerful GPUs get, the more difficult it will become to solve this mathematical equation and create new blocks.&lt;/p&gt;\n\n&lt;p&gt;Wait.. what? Shouldn’t it become faster rather than slower, if more powerful components become available? &lt;/p&gt;\n\n&lt;p&gt;Bitcoin was programmed so that one block would be mined every 10 minutes on average, and every 2016 blocks, or about two weeks, or the algorithm calculates how long it took to mine those blocks. If it took more than 14 days it means that it was too difficult and the difficulty will decrease, if it took less than 14 days it means that it was too easy, and the difficulty will increase. The more people enter the network and start mining, the more difficult mining becomes to obtain the same results and the more powerful GPU’s will be required to produce those same results.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Each Bitcoin block rewards 6.25 Bitcoins to the winner. This reward is cut in half approximately every 4 years and it is called halving.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;At the beginning, the reward was 50 BTC per block. The first halving happened in 2012 and it reduced the block reward to 25 BTC. The second halving was in 2016 and it reduced the reward to 12.5 BTC, and finally, the last halving happened in May 2020 which brought the reward to 6.25BTC per block. The next one will be in 2024 and it will drop the reward to 3.125 BTC.&lt;/p&gt;\n\n&lt;p&gt;On a final note, mining crypto on your own, especially in the case of Bitcoin, is close to impossible unless you are considerably wealthy, because it would require an absurd amount of capital just to have a small chance to mine a block, that’s why there are networks called mining pools, made of thousands if not tens of thousands of people combining their computing power to mine one specific crypto together and proportionally split the block rewards. The vast majority of mining pools are either in Bitcoin or Ethereum.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;h1&gt;10. Proof of Stake&lt;/h1&gt;\n\n&lt;p&gt;As the second most used consensus mechanism, we have Proof of Stake. The holders of a Proof of Stake crypto will deposit and lock up, called staking, the coins of that crypto that they own, and &lt;strong&gt;become a validator&lt;/strong&gt;. By doing this, they will get the chance to be chosen to validate the next block, and whoever does it, will be rewarded the block reward.&lt;/p&gt;\n\n&lt;p&gt;Whether a validator will get chosen to validate the next block will depend on different factors, two of the main ones are randomness and how many coins they staked. This cuts out the gigantic energy and resources consumption that happens with Proof of Work as with Proof of Stake you do not require any sort of specific computer hardware.&lt;/p&gt;\n\n&lt;p&gt;At the same time however, people argue that this consensus mechanism tends to reward those already wealthy, as the more coins you have, the more likely the chances to be randomly selected and earn the block rewards are.&lt;/p&gt;\n\n&lt;p&gt;Some argue that this makes the ecosystem more centralized as wealthier individuals become even wealthier, however, the same argument can also be applied to Proof of Work, as if you have more capital you can afford to buy more mining equipment which in contrast will generate more revenue. &lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;h1&gt;11. Ethereum&lt;/h1&gt;\n\n&lt;p&gt;This connects us to Ethereum. The second largest cryptocurrency by market cap since its creation in 2016, second only to Bitcoin.&lt;/p&gt;\n\n&lt;p&gt;Ethereum has always been on POW just like Bitcoin, but it is currently migrating to POS to solve several issues such as transaction fees, called gas fees, and transactions per second.&lt;/p&gt;\n\n&lt;p&gt;The main difference from Bitcoin, is that Ethereum features a key technology called “smart contracts”.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;h1&gt;12. Smart Contracts&lt;/h1&gt;\n\n&lt;p&gt;Smart contracts are automated programs, built on the Ethereum blockchain, or any other blockchain with smart contract capabilities. &lt;strong&gt;They are fully controlled by code&lt;/strong&gt; and once deployed on the blockchain, they cannot be changed or altered. They allow you to build multiple programmable functions on top of them, to be executed once a criteria is met.&lt;/p&gt;\n\n&lt;p&gt;With Bitcoin, for example, all you can do is transfer the coin as a means of payment and you cannot build anything on top of its blockchain. With Ethereum however, besides transferring its main coin, Ether, you can build and create all sorts of applications on it.&lt;/p&gt;\n\n&lt;p&gt;And no, Ether and Ethereum are not quite exactly the same thing. Ethereum is the blockchain, the network, the foundation, whereas Ether is the native coin of the blockchain.&lt;/p&gt;\n\n&lt;p&gt;The most famous examples of smart contracts by far, are well, NFTs, and it shouldn’t really come at a surprise.&lt;/p&gt;\n\n&lt;p&gt;On the other hand, however, there are also useful smart contracts that provide real financial services, such as crypto lending and borrowing, decentralized exchanges, liquidity pools, insurance services, and much more, but we will get into that a bit later.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;h1&gt;13. Coin vs Token&lt;/h1&gt;\n\n&lt;p&gt;Now. All of them are cryptocurrencies, but not all of them are coins or tokens. Many people call them coins when in reality, they are tokens or call them tokens when in reality, they are coins.&lt;/p&gt;\n\n&lt;p&gt;The difference is that &lt;strong&gt;a coin is native to its own blockchain&lt;/strong&gt;, Ether is a coin native to its own blockchain called Ethereum. Bitcoin is a coin native to its own blockchain called Bitcoin. Shiba inu, however, is a token because it is built on Ethereum’s blockchain. Creating a fully operable blockchain is way more difficult than creating a token on an already established blockchain.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;h1&gt;14. Tokenomics&lt;/h1&gt;\n\n&lt;p&gt;Now, let’s get into how the value of a cryptocurrency is derived and its tokenomics, which is simply a term that indicates the economics of a crypto.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Supply&lt;/strong&gt; - The first and most important thing of any given cryptocurrency is the supply. This can be further divided into three categories:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Maximum Supply&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Total Supply&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Circulating Supply&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;em&gt;Maximum Supply&lt;/em&gt; - It is the amount of tokens or coins of a crypto that will ever exist, including the ones that will be created through mining, staking, or made available in the future. Bitcoin&amp;#39;s maximum supply is 21,000,000 coins which will only be reached in over 100 years from now. Ethereum, on the other hand, has an unlimited max supply.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Total Supply&lt;/em&gt; – It is the amount of coins or tokens of a crypto currently in existence, including the ones that may not be publicly available, such as those locked in an escrow or held by the team, but without counting the coins or tokens yet to be created and put into existence through mining, staking etc.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Circulating Supply&lt;/em&gt; - Circulating supply is the amount of a crypto in circulation in the present moment and in the hands of the general public, EXCLUDING the coins or tokens of that crypto, that are locked or held by entities such as the team behind the project.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Market Cap&lt;/strong&gt; – Market capitalization, or market cap for short, is the dollar value of all the coins or tokens of a crypto combined and it is calculated by multiplying the total supply by the last price a single coin or token was sold for. In the case of Bitcoin, there are approximately 18,950,000 Bitcoins, and with about $40,000 per coin, it would place the market cap at around 750 billion dollars.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;h1&gt;15. Exchanges&lt;/h1&gt;\n\n&lt;p&gt;Now, However, begs the question, where are these cryptocurrencies bought from and how do you store them safely?&lt;/p&gt;\n\n&lt;p&gt;Cryptocurrencies are generally bought from what are called &lt;strong&gt;centralized exchanges&lt;/strong&gt;. They are regulated companies which provide you the service of acting as a trusted middlemen between the people who want to sell a specific crypto, and the people who want to buy it.&lt;/p&gt;\n\n&lt;p&gt;They decide which cryptos to list and there is no exchange that has all the cryptos in existence listed. It is a decision up to them. There are exchanges which list as many cryptos as possible to earn as much as they can, and exchanges known for listing as few as possible, but when they do, it’s all over the news &lt;del&gt;*cough* Coinbase *cough*&lt;/del&gt;.&lt;/p&gt;\n\n&lt;p&gt;The way they stay in business is by charging a small commission on each trade. The typical commission fee averages between 0.05% and 0.1%, and the larger your order will be, the lesser you will pay in fees.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;h1&gt;16. Wallets&lt;/h1&gt;\n\n&lt;p&gt;After you purchase a cryptocurrency on an exchange, the next step is always choosing how to store it safely. There are two main types of crypto storages. Custodial and non-custodial wallets.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Custodial Wallets -&lt;/strong&gt; Someone else retains custody of your assets. You do not own your cryptos but they do, on your behalf. These are mostly the previously mentioned exchanges, and this is where the famous phrase in the crypto community “not your keys, not your coins” comes from.&lt;/p&gt;\n\n&lt;p&gt;By giving up custody of your funds, you have a better peace of mind because you do not bear the responsibility of securing your assets and all the risks involved with it.&lt;/p&gt;\n\n&lt;p&gt;The Crypto community however has mixed feelings on whether holding your cryptos on an exchange is worth it due to previous exchange hacks which resulted in stolen and lost funds on multiple occasions. On top of that, it totally ruins the goal of crypto: to escape from the control of centralized entities and aiming to be our own banks.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Non-Custodial Wallets&lt;/strong&gt; - These are the wallets that you personally own and hold your crypto in. They can be mainly divided into two categories: hot wallets and cold wallets.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Hot Wallets&lt;/strong&gt; - They are software, usually apps you can download on your phone, such as the Trust wallet, Exodus or Coinbase wallet. They do offer a fantastic grade of protection and are free to use. You are the only owner of your assets and under most circumstances they are more than enough to protect what you hold, but if your device becomes compromised, you can lose everything. &lt;/p&gt;\n\n&lt;p&gt;The most famous hot wallet by far is Metamask. It’s an Ethereum based wallet that comes as a web browser extension and every Ethereum compatible blockchain, such as Binance Smart Chain, Polygon and Avalanche, plus all the decentralized applications built on those blockchains, are compatible with Metamask. They also have a mobile app, but it’s not used as often.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Cold Wallets&lt;/strong&gt; - They are offline physical devices such as the Ledger Nano and the Trezor. You usually connect them to the computer through a cable and use a specific program to access them.&lt;/p&gt;\n\n&lt;p&gt;The difference is that you will have to write your mnemonic phrase, we’ll get into what it is shortly, and approve transactions from the device itself which cannot get accessed unless someone has physical access to it, and as it is offline it can’t be hacked. They offer a way higher grade of protection because they do not rely on the security of your mobile phone or computer and that’s why they cost from around $60 to $200 to buy, depending on the type and features. For this reason, it isn’t the best option if you do not have much money to begin investing with. &lt;/p&gt;\n\n&lt;p&gt;Broadly speaking, most crypto holders, including myself, tend to agree that if you have a small capital to invest, it might be better to keep it on an established exchange, especially if it is in Ethereum, and transferring those coins out would cost a fortune in transaction fees.&lt;/p&gt;\n\n&lt;p&gt;The most important thing to know if you decide to buy a hardware wallet, is to &lt;strong&gt;ALWAYS&lt;/strong&gt; buy it from the official company’s website and not from a third-party seller, even if you might find it discounted. This is because you would increase the risk of receiving a tampered device, which is by no means worth it just to save a few dollars.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;h1&gt;17. Mnemonic Phrases&lt;/h1&gt;\n\n&lt;p&gt;Now, mnemonic phrases. All you need to know to keep your crypto safe is that when you create a so called “account” on a wallet, you are given a random set of 12-18-24 words which is called a mnemonic phrase. This combination of words will act as a password to access all your crypto. These words are randomly chosen from a specific list of 2048 words, and each word can all be identified by the first four letters. This technology was designed so that we could have a human readable “password” instead of a random set of numbers and letters.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;THE MOST IMPORTANT THING&lt;/strong&gt; you need to understand is that your crypto will &lt;strong&gt;NOT&lt;/strong&gt; be stored in that mobile app or ledger device, but on the blockchain. The wallets are just a gateway, like an intermediary, that provide an easy-to-use interface for everyone.  The one and only thing you must carefully store, is the mnemonic phrase.&lt;/p&gt;\n\n&lt;p&gt;If you lose your phone with a hot wallet installed, or a hardware device like the ledger nano, nothing will happen to your crypto as long as you still have access to the mnemonic phrase, which you can use to restore your crypto on a new wallet.&lt;/p&gt;\n\n&lt;p&gt;You absolutely &lt;strong&gt;MUST&lt;/strong&gt; write down on at least two pieces of paper those words, &lt;strong&gt;NEVER&lt;/strong&gt; take pictures or screenshots of them, store them safely and never tell anyone where they are.&lt;/p&gt;\n\n&lt;p&gt;Do not try to bury your ledger nano 10 feet under the ground, the only thing that matters is the mnemonic phrase which can be restored on any wallet, both hot and cold. &lt;/p&gt;\n\n&lt;p&gt;As you can imagine, the difficulty with self-custody is evident. If you lose access to both your seed phrase and to the device where it was connected, your crypto will be lost forever. Hacking a mnemonic phrase is impossible, and 99% of those “hacking” claims you see online are simply because people’s phones or computers were either compromised or they accidentally screenshotted or emailed themselves the mnemonic phrase, or sometimes even both, for the sake of comfort, and it got leaked.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;h1&gt;18. Types of Cryptocurrencies&lt;/h1&gt;\n\n&lt;p&gt;Going back to Cryptos. There are many types of cryptocurrencies, but only about eight are the most common:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Store of Values&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Smart Contracts&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Stablecoins&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Payments&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Privacy&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Exchange Tokens or Coins&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Governance tokens&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Sh*tcoins&lt;/strong&gt; &lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;em&gt;Store of Value&lt;/em&gt; - They are designed to hold their value and purchasing power over time. The only crypto which is arguably considered to be one is Bitcoin because it has always tremendously increased in value over time since its inception rather than losing value like our beloved fiat currencies. People believe it is an effective hedge against inflation and that’s why Bitcoin is sometimes referred to as digital gold.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Smart Contract&lt;/em&gt; - They are designed to be programmable and allow building applications on their blockchain, for different purposes. The most famous and used one, is Ethereum. This brought to the creation of Decentralized finance, or DEFI, in which we’ll get into in a minute. Other examples of smart contract cryptos are Binance Smart Chain, Avalanche and Solana.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Stablecoins&lt;/em&gt; - They are usually pegged to fiat currencies, mostly, to the US dollar. They hold all the properties of any other crypto, but their value is… stable. For example, when a stablecoin is indeed pegged to the dollar, the goal will always be to maintain and hold the value of one dollar per coin. They aim to eliminate price volatility and to provide a stable medium of exchange without the need to cash out, or, in other words, without the need to withdraw those dollars to your bank account. Examples are: USDT (to avoid), USDC, BUSD and DAI&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Payment&lt;/em&gt; - They are very fast and cost very little to transact with. They are exceptionally good for transferring money quickly and cheaply. However, they tend to be more centralized as they require powerful machines to run them which normal people have no access to.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Privacy&lt;/em&gt; - They have.. well, privacy. You see, the thing with Bitcoin that not many understand is that it is pseudonymous. All the transactions, addresses and balances are nameless, but public. Everything can be easily tracked, but nobody knows which address you own. If, however, someone finds it out, they will immediately see how much you own, who you sent crypto to, and all your transactions. There are cryptos, however, that offer full privacy and anonymity of balances and transactions. Examples are Monero and Zcash.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Exchange Tokens or Coins&lt;/em&gt; - They are created by the exchanges from which you can purchase crypto. They offer you perks such as fee discounts if you hold their coin or token and use it to pay for the fees. The most famous one is by far Binance, and its coin, Binance coin. If you paid attention I said coin, and that is because Binance also created its own blockchain called Binance Smart Chain, with BNB as the native coin, just like ETH is the native coin of Ethereum.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Governance Tokens&lt;/em&gt; - They grant voting and management powers to their users. They are very important in DeFi ecosystems such as Uniswap.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Memecoins, also called Sh\\&lt;/em&gt;tcoins* - They are always created on other blockchains, just like Shiba Inu is on Ethereum. The only major exception is Dogecoin, which has its own blockchain. They serve no purpose or utility and people just buy them in the hopes of making money, which sometimes works, don’t get me wrong, otherwise we wouldn’t be hearing about them, but the best way to describe them, is gambling.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;h1&gt;19. DeFi&lt;/h1&gt;\n\n&lt;p&gt;Now that we covered the basics of the basics, and I know it’s lot, especially if you’re a beginner, let’s get into the final part with a bit more complex stuff.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;DeFi&lt;/strong&gt; - As we mentioned, smart contracts are automated programs that are built to follow a specific function, such as if I give you X amount of ETH, I receive X amount of a token built on Ethereum. Once deployed on a blockchain, these smart contracts cannot be changed, hence they are decentralized.&lt;/p&gt;\n\n&lt;p&gt;If you combine multiple smart contracts into something more complex, you get decentralized finance, or DeFi, with decentralized applications, or &lt;strong&gt;DAPPs&lt;/strong&gt;.&lt;/p&gt;\n\n&lt;p&gt;DeFi is a collective term for financial products and services that are built on a blockchain and are accessible to anyone. These services are always open and there are no centralized authorities who can block payments or deny you access to something, as everything is fully based on code.&lt;/p&gt;\n\n&lt;p&gt;In other words, DeFi cuts out the middleman and offers financial services to everyone, and unlike banks, it does so without discrimination. Let’s get now into a couple of examples of real world use cases.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Decentralized Exchanges&lt;/strong&gt; - They are simply exchanges where you can trade cryptocurrencies, with the difference that they are decentralized. They are built on one or multiple blockchains and you can trade any token built on that blockchain (or blockchains). These can range from stablecoins, to governance tokens, to meme coins.&lt;/p&gt;\n\n&lt;p&gt;The main pros of using a decentralized exchange is the fact that you do not need to create an account or share your personal information, everything is done in a completely anonymous way. You usually just need to create a Metamask wallet, and you are good to go.&lt;/p&gt;\n\n&lt;p&gt;On the downside however, if you want to trade Ethereum based tokens, you will pay astronomical transaction fees, and on top of that, you will be the only person responsible for any loss of funds.&lt;/p&gt;\n\n&lt;p&gt;The most famous example is Uniswap, and you can use it to trade any token built on Ethereum.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Lending and Borrowing&lt;/strong&gt; - I’ll start this one with an example. Let’s say you own 2000$ worth of ETH and you believe that it is going to go to the moon soon. Let’s also hypothetically say that you find yourself in a real-life emergency situation and you need 1000$.&lt;/p&gt;\n\n&lt;p&gt;You will now have two options. You can either sell half of your ETH and call it a day, but miss out on an eventual price appreciation, or you can lock up your ETH as collateral in a lending and borrowing decentralized application and borrow 1000$ worth of a stable coin against the collateral that you just deposited. This way, you will end up with keeping your position in ETH and be able to ride it and you will also get the $1000 you need.&lt;/p&gt;\n\n&lt;p&gt;To get back your ETH you would obviously need to pay back your debt of $1000 plus the occurring borrowing fees.&lt;/p&gt;\n\n&lt;p&gt;Respectively, if you wish to earn passive income, you can lock up your Crypto with the ability to withdraw it anytime (zoom face) and lend it to those interested in borrowing it just like in our previous example. In exchange, you will earn an interest, which is way higher than the 0.5% that a bank’s savings account gives you, while the inflation rate for 2021 rose up 7%.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;h1&gt;20. Conclusion&lt;/h1&gt;\n\n&lt;p&gt;If you had the patience to read through these ~5500 words, thank you so much and I hope you gained some value!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 319,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/nCxi-tIPYUj74zrm__M12u6Afh3KfxYpS1SMAfLILmY.jpg?auto=webp&amp;s=e05e283193ca959abafa11d76897beee73020ab4",
          "width": 900,
          "height": 900
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/nCxi-tIPYUj74zrm__M12u6Afh3KfxYpS1SMAfLILmY.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=2ec4676e5cae866f8e12900bae17d520c6e1bd3b",
            "width": 108,
            "height": 108
          },
          {
            "url": "https://external-preview.redd.it/nCxi-tIPYUj74zrm__M12u6Afh3KfxYpS1SMAfLILmY.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=598a28913cb0245c12738ff65d1df6be5dfd9ecb",
            "width": 216,
            "height": 216
          },
          {
            "url": "https://external-preview.redd.it/nCxi-tIPYUj74zrm__M12u6Afh3KfxYpS1SMAfLILmY.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=36946f1d6b966388138c539638dce35247e80b00",
            "width": 320,
            "height": 320
          },
          {
            "url": "https://external-preview.redd.it/nCxi-tIPYUj74zrm__M12u6Afh3KfxYpS1SMAfLILmY.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=95629593c588b8765ac6d28d0b89614b978ec689",
            "width": 640,
            "height": 640
          }
        ],
        "variants": {},
        "id": "1XlvBhFy3U6Qx3waDd5PZK7Z1p5N_bbg3KN3wlkih98"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/sy4y4g/beginners_guide_to_cryptocurrency_all_you_need_to/",
  "subreddit": "CryptoCurrency",
  "id": "sy4y4g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hi all! This is going to be a VERY long post, I did my best to explain the\nthings I struggled with at the beginning of my Crypto journey. I am not an\nexpert by any means, but I feel I can provide valuable information to those\nnewer than me who are trying to get started but are overwhelmed by the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。これはとても長い投稿になりそうですが、私は最善を尽くして説明しました。\n私がCryptoの旅を始めたころに苦労したこと。私は\n専門家というわけではありませんが、このような方に貴重な情報を提供できると思います。\n私よりも新しい人で、始めようとしているが、圧倒されている人...",
      "title": "ビギナーズガイド・トゥ・クリプトカーレンシー - これから始めるなら知っておきたいこと!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好! 这将是一个非常长的帖子，我尽我所能来解释\n在我的加密货币之旅开始时，我挣扎的事情。我不是一个\n专家，但我觉得我可以为那些需要帮助的人提供有价值的信息。\n比我更年轻的人提供有价值的信息，他们正试图开始，但却被各种问题所困扰。",
      "title": "CRYPTOCENCY初学者指南--如果你刚刚开始，你需要知道的一切"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好! 這將是一個非常長的帖子，我盡我所能來解釋\n在我的加密貨幣之旅開始時，我掙扎的事情。我不是一個\n專家，但我覺得我可以爲那些需要幫助的人提供有價值的信息。\n比我更年輕的人提供有價值的信息，他們正試圖開始，但卻被各種問題所困擾。",
      "title": "CRYPTOCENCY初學者指南--如果你剛剛開始，你需要知道的一切"
    }
  ]
}