{
  "author": "Milkshakebuckaroo2",
  "the_new_excerpt": "Even though I work as an engineer and make a decent living, I am going to work\nthis weekend washing windows to make extra money. Why? Because I want to make\nextra money while Bitcoin is cheap so I can buy more. Why? Because I want to buy\nan honest currency that can’t be inflated into oblivion by…",
  "original_created_utc": 1619235615,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はエンジニアとして働いており、それなりの生活をしているにもかかわらず、今週は仕事に行くことになりました。\n今週末は窓拭きをしてお金を稼ごうと思います。なぜかって？それは、ビットコインが\nビットコインが安いうちに余分なお金を稼いで、もっと買えるようにしたいからです。なぜか？なぜなら、私が買いたいのは\n誠実な通貨を買いたいからです。",
      "title": "ビットコインはハードワークを奨励する"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "尽管我是一名工程师，生活还算过得去，但我还是要去工作。\n这个周末去洗窗户，以赚取额外的钱。为什么？因为我想在比特币发行时赚取\n趁着比特币便宜的时候赚点外快，这样我就可以买更多的比特币了。为什么呢？因为我想买\n一个诚实的货币，它不能被......膨胀到忘乎所以。",
      "title": "比特币鼓励努力工作"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "儘管我是一名工程師，生活還算過得去，但我還是要去工作。\n這個週末去洗窗戶，以賺取額外的錢。爲什麼？因爲我想在比特幣發行時賺取\n趁着比特幣便宜的時候賺點外快，這樣我就可以買更多的比特幣了。爲什麼呢？因爲我想買\n一個誠實的貨幣，它不能被......膨脹到忘乎所以。",
      "title": "比特幣鼓勵努力工作"
    }
  ],
  "title": "Bitcoin encourages hard work",
  "created_utc": 1619282872,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Even though I work as an engineer and make a decent living, I am going to work this weekend washing windows to make extra money. Why? Because I want to make extra money while Bitcoin is cheap so I can buy more. Why? Because I want to buy an honest currency that can’t be inflated into oblivion by some bloated inefficient government or central bank.I want to provide for my family the best I possibly can because I love them. Bitcoin is a hard currency that I believe in. It makes me want to earn more, save more, and work harder. Bitcoin is awesome!</p>\n</div><!-- SC_ON -->",
  "score": 185,
  "permalink": "/r/Bitcoin/comments/mxbxlh/bitcoin_encourages_hard_work/",
  "subreddit": "Bitcoin",
  "id": "mxbxlh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776204239
}