{
  "author": "lucacha",
  "the_new_excerpt": "After the overwhelming enthusiasm you’ve expressed last week on my post,\n[https://www.reddit.com/r/stocks/comments/kumtz1/i_built_a_program_that_spots_buzzing_stocks_on/?utm_source=share&utm_medium=web2x&context=3]\nI thought I’d share with you the new weekly picks from my program that scrapes\nReddit…",
  "original_created_utc": 1610900884,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在上周你对我的文章表示出极大的热情之后。\n[https://www.reddit.com/r/stocks/comments/kumtz1/i_built_a_program_that_spots_buzzing_stocks_on/?utm_source=share&utm_medium=web2x&context=3]\n我想和大家分享一下我节目中的每周新选题，刮刮乐。\nReddit...",
      "title": "我在Reddit和Twitter上发现新兴股票的程序又回来了。以下是本周的结果。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在上週你對我的文章表示出極大的熱情之後。\n[https://www.reddit.com/r/stocks/comments/kumtz1/i_built_a_program_that_spots_buzzing_stocks_on/?utm_source=share&utm_medium=web2x&context=3]\n我想和大家分享一下我節目中的每週新選題，刮刮樂。\nReddit...",
      "title": "我在Reddit和Twitter上發現新興股票的程序又回來了。以下是本週的結果。"
    }
  ],
  "title": "My program that spots emerging stocks on Reddit and Twitter is back. Here are this week's results.",
  "created_utc": 1610905322,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>After the overwhelming enthusiasm you’ve expressed last week on <a href=\"https://www.reddit.com/r/stocks/comments/kumtz1/i_built_a_program_that_spots_buzzing_stocks_on/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">my post,</a> I thought I’d share with you the new weekly picks from my program that scrapes Reddit and Twitter for emerging stocks.</p>\n\n<p>As always, please do not consider any of those picks as buy signals nor recommendations. I am a programmer, not a financial analyst. My goal is to share with you the results my program provides, not recommend any buys.</p>\n\n<p><strong>Here’s how to interpret the stock picks.</strong></p>\n\n<ul>\n<li>The percentage increase (+%) is based on a WoW (week on week) analysis. I also use MoM and YoY data to inform the picks.</li>\n<li>The “Reasoning” I provide is based on a light DD I run before highlighting any of the program’s picks in order to understand why they’re generating conversation. If I find out that they are based on a PnD, I filter the stocks out.</li>\n</ul>\n\n<p><strong>Enough said, here’s the list!</strong></p>\n\n<p><strong>TPG Pace Beneficial Finance Corp. (TPGY) - +834%</strong></p>\n\n<p>Market Cap: 1b</p>\n\n<p>EVBox, the undisputed leader of EV charging in Europe is going public through a merger with blank-check company TPG Pace Beneficial Finance Corp.</p>\n\n<p>Reasoning: The company has installed over 190,000 charging ports all across Europe, from Spain (3,000 ports delivered) to Germany (40,000 ports delivered) to the UK (7,000 ports delivered) to the Nordics (10,000 ports delivered). EVBox already counts multiple big companies as customers – such as Avis, McDonald’s, IKEA, and Amazon. Kristof Vereenooghe, President and CEO, will present on Wednesday, January 13, 2021, at the 23rd Annual ICR Conference. EVBox is expected to be listed on the New York Stock Exchange (NYSE) by late Q1 2021.</p>\n\n<p><strong>Precision BioSciences, Inc. (DTIL) - +546%</strong></p>\n\n<p>Market Cap: 635,5m</p>\n\n<p>Precision BioSciences, Inc., a genome editing company, develops therapeutic products in the United States. It offers ARCUS, a genome-editing platform to cure cancers and genetic disorders.</p>\n\n<p>Reasoning: Precision Biosciences has their own proprietary platform, ARCUS, which allows for gene editing free of patents and licenses. Compared to CRISPR, ARCUS uses a different enzyme called I-Crel to splice genes and because of its properties, it allows more precise cuts to the DNA strands that results into a less error prone process than CRISPR. They recently signed strategic partnerships with high profile companies, such as Eli Lilly in Nov. 2020. Check out this <a href=\"https://www.reddit.com/r/stocks/comments/kxwq2t/continuing_our_investing_journey_from_pltr_to_dtil/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">thorough DD</a> from fellow <a href=\"/r/stocks\">r/stocks</a> member, <a href=\"/u/kotsumu\">u/kotsumu</a> to learn more.</p>\n\n<p><strong>Disclaimer</strong>: I do not currently own any shares in DTIL. I own shares in TPGY.</p>\n\n<p><strong>Due to the nature of this sub, I wasn’t able to share all the picks my program surfaced this week. If you want to learn more about them, feel free to check out my sub :)</strong></p>\n\n<p>If you guys found these insights useful and/or have any questions/feedback, please let me know! Always appreciated :)</p>\n</div><!-- SC_ON -->",
  "score": 311,
  "permalink": "/r/stocks/comments/kz9gm0/my_program_that_spots_emerging_stocks_on_reddit/",
  "subreddit": "stocks",
  "id": "kz9gm0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1611311218333
}