{
  "author": "dotdotdoots",
  "the_new_excerpt": "This is embarrassing but hey thats what this thread is for.\n\nMy parents never really engraved a routine for brushing our teeth to me and my\nsiblings. They taught us how and when but they never really enforced it - like\nI've seen / heard most parents do - and so I never got into the frequent…",
  "original_created_utc": 1620787687,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは恥ずかしいことですが、このスレッドはそのためにあります。\n\n私の両親は、私や私の兄弟に歯磨きの習慣を教えてくれませんでした。\n私の両親は、私や兄弟に歯磨きの習慣を教えてくれませんでした。方法と時間は教えてくれましたが、それを強制することはありませんでした。\n私は多くの親がそうしているのを見聞きしたことがありますが、だから私は頻繁にはしませんでした...。",
      "title": "歯磨きの習慣をつけるにはどうしたらいいですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这很让人尴尬，但这就是这个话题的意义所在。\n\n我的父母从来没有给我和我的兄弟姐妹刻下过刷牙的习惯。\n兄弟姐妹们。他们教我们如何刷牙，何时刷牙，但他们从未真正执行过--例如\n我看到/听到大多数父母这样做--所以我从来没有进入频繁的......",
      "title": "如何养成刷牙的习惯？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這很讓人尷尬，但這就是這個話題的意義所在。\n\n我的父母從來沒有給我和我的兄弟姐妹刻下過刷牙的習慣。\n兄弟姐妹們。他們教我們如何刷牙，何時刷牙，但他們從未真正執行過--例如\n我看到/聽到大多數父母這樣做--所以我從來沒有進入頻繁的......",
      "title": "如何養成刷牙的習慣？"
    }
  ],
  "title": "How do you get into a tooth brushing routine?",
  "created_utc": 1620829637,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is embarrassing but hey thats what this thread is for.</p>\n\n<p>My parents never really engraved a routine for brushing our teeth to me and my siblings. They taught us how and when but they never really enforced it - like I&#39;ve seen / heard most parents do - and so I never got into the frequent or steady habit. I don&#39;t know about my siblings.</p>\n\n<p>But because of this, plus my family&#39;s really trash diet, I&#39;ve always gotten a lot of cavities.. tooth aches. Jaw aches. Bleeding gums. You name it. So as I&#39;m growing older, I want to get into a more routine habit of brushing teeth. </p>\n\n<p>Other than frequency, I&#39;m worried about honestly getting into that frequency. I go to bed late from work and schooling, but I&#39;m usually so wiped that I don&#39;t want to.</p>\n\n<p>How do I get into this habit?\nHow have you guys maintained this habit or at least do it relatively frequently?\nAny tips for brushing teeth you wanna share or weird methods ya got?</p>\n</div><!-- SC_ON -->",
  "score": 110,
  "permalink": "/r/NoStupidQuestions/comments/naeo6y/how_do_you_get_into_a_tooth_brushing_routine/",
  "subreddit": "NoStupidQuestions",
  "id": "naeo6y",
  "is_self": true,
  "media": null,
  "is_video": false
}