{
  "author": "Set1Less",
  "original_created_utc": 1643206997,
  "title": "El Salvador holds less than 2% of its reserves in BTC, they hold more GOLD than BTC. People are spreading the false narrative that they are recklessly gambling with people's money. 2% allocation is a decent risk:reward. Even Fidelity allocates 2% to BTC in their flagship Balanced Fund.",
  "created_utc": 1643215354,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Lots of people here keep spreading the narrative that El Salvador is &amp;quot;gambling recklessly&amp;quot; with people&amp;#39;s savings and what not. &lt;/p&gt;\n\n&lt;p&gt;Reading those posts one would think their entire reserves is now in BTC.&lt;/p&gt;\n\n&lt;p&gt;But the fact is that just 2% of their reserves are even allocated in BTC. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://bitcointreasuries.net/\"&gt;El Salvador holds around $70m worth BTC&lt;/a&gt;. This is literally nothing for a country. They hold 1691 BTC, in comparison , Microstrategy and Tesla hold over 120,000 BTC  and 40,000 BTC respectively. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://data.worldbank.org/indicator/FI.RES.TOTL.CD?locations=SV\"&gt;El Salvador&amp;#39;s total foreign exchange reserves is pegged at $3.3 BN&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://tradingeconomics.com/el-salvador/foreign-exchange-reserves\"&gt;https://tradingeconomics.com/el-salvador/foreign-exchange-reserves&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Less than 2% of their reserves are in BTC.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://timesofindia.indiatimes.com/business/cryptocurrency/bitcoin/bukele-reveals-el-salvadors-gold-reserves-and-benefits-of-bitcoin-over-gold/articleshow/88142021.cms\"&gt;El Salvador holds more in GOLD than in BTC&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;According to this article, they hold $79m worth GOLD, but just $70m \nworth BTC. &lt;/p&gt;\n\n&lt;p&gt;People are spreading the false narrative as if he has moved the entire supply of reserves to BTC, which is far away from whats going on.\nThey have just been making small purchases over time. They literally bought like 2 BTC in the end of Dec. Peanuts for a country.&lt;/p&gt;\n\n&lt;p&gt;A 2% allocation in a risky asset class is not a gamble by any means. It is a decent risk reward play for individuals, and countries as well. &lt;/p&gt;\n\n&lt;p&gt;If you consult with a financial advisor, they may suggest a portfolio allocation of 2% towards emerging asset classes like crypto. Infact, thats what Fidelity suggests as well. &lt;a href=\"https://www.investmentexecutive.com/news/products/fidelity-to-add-bitcoin-exposure-to-portfolio-funds/\"&gt;Recently, they added a 2% BTC allocation to their flagship All in one Balanced / Growth funds&lt;/a&gt;. These are mom and pop funds that are held mostly by conservative investors. &lt;/p&gt;\n\n&lt;p&gt;Its been around a year since El Salvador announced their Bitcoin Law and around 6 months since it went active. In this period, they have allocated a small portion of their reserves towards BTC. This is not a gamble, but a solid  and well planned asset allocation strategy. Meanwhile, they have already started mining BTC and over time, this industry has the potential to add to their GDP. &lt;/p&gt;\n\n&lt;p&gt;What did people think bitcoin/crypto adoption would be like, one fine day every country across the world will just start accepting BTC out of the blue? Just like that it would become legal tender without any struggle? &lt;/p&gt;\n\n&lt;p&gt;These are small steps and it will be risky. Nothing happened overnight, let alone moving from USD to a decentralised currency like Bitcoin.&lt;/p&gt;\n\n&lt;p&gt;Its shameful that people here want adoption of BTC and crypto, but the first time a large sovereign power has tried to adopt BTC, the same people who want crypto adoption go out of their way to attack them with baseless allegations. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Muhh adoption should be in accordance with my terms, otherwise its not adoption. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;These people are just privileged bottom feeders who want to enjoy success without any risks whatsoever.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 835,
  "permalink": "/r/CryptoCurrency/comments/sd73gz/el_salvador_holds_less_than_2_of_its_reserves_in/",
  "subreddit": "CryptoCurrency",
  "id": "sd73gz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Lots of people here keep spreading the narrative that El Salvador is \"gambling\nrecklessly\" with people's savings and what not.\n\nReading those posts one would think their entire reserves is now in BTC.\n\nBut the fact is that just 2% of their reserves are even allocated in BTC.\n\nEl Salvador holds…"
}