{
  "author": "robis87",
  "original_created_utc": 1628485721,
  "title": "Ted Cruz: Crypto Just \"Got Screwed\" in US Senate",
  "created_utc": 1628502068,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Senator Ted Cruz (R-TX) on TW: <em>Crypto got screwed tonight. There’s a partisan disagreement on spending, so Dems objected to ALL further amendments. That means NO vote on Wyden-Lummis to lessen the damage this bill will do to crypto, &amp; NO vote on the Cruz amd. to repeal the new crypto rules altogether.</em></p>\n\n<p><em>The result? The Senate’s going to inflict billions of dollars of damage on the growing &amp; exciting crypto industry &amp; drive much of it overseas. There aren’t 5 Senators who understand much of anything about crypto.</em></p>\n\n<p><em>What the Senate said tonight: Let’s tax the hell out of something we know nothing about, so we can pass a giant bill we haven’t read, and spend the American people’s money on stuff we can’t afford.   It’s reckless &amp; harmful.</em></p>\n</div><!-- SC_ON -->",
  "score": 164,
  "permalink": "/r/CryptoCurrency/comments/p0utct/ted_cruz_crypto_just_got_screwed_in_us_senate/",
  "subreddit": "CryptoCurrency",
  "id": "p0utct",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Senator Ted Cruz (R-TX) on TW: Crypto got screwed tonight. There’s a partisan\ndisagreement on spending, so Dems objected to ALL further amendments. That means\nNO vote on Wyden-Lummis to lessen the damage this bill will do to crypto, & NO\nvote on the Cruz amd. to repeal the new crypto rules…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "テッド・クルーズ上院議員（R-TX） on TW: 今夜、Cryptoがねじ込まれた。支出に関して党派間で意見の相違があり\n支出に関する党派的な意見の相違があり、民主党はすべての修正案に反対しました。それはつまり\nこの法案が暗号に与えるダメージを軽減するためのワイデン・ランミス法案は否決、そして\n新しい暗号規則を廃止するためのクルーズの修正案も採決されないということになります。",
      "title": "テッド・クルーズ 米上院で暗号は「ねじ伏せられた」だけ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "参议员特德-克鲁兹（R-TX）在TW：今晚加密货币被搞砸了。有一个党派\n在支出方面存在分歧，所以民主党反对所有进一步的修正案。这意味着\n对Wyden-Lummis减轻该法案对加密货币的损害的修正案不投票，也不投票。\n对克鲁兹关于废除新的加密货币规则的修正案没有投票权...",
      "title": "特德-克鲁兹。加密货币刚刚在美国参议院 \"被搞砸了\""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "參議員特德-克魯茲（R-TX）在TW：今晚加密貨幣被搞砸了。有一個黨派\n在支出方面存在分歧，所以民主黨反對所有進一步的修正案。這意味着\n對Wyden-Lummis減輕該法案對加密貨幣的損害的修正案不投票，也不投票。\n對克魯茲關於廢除新的加密貨幣規則的修正案沒有投票權...",
      "title": "特德-克魯茲。加密貨幣剛剛在美國參議院 \"被搞砸了\""
    }
  ]
}