{
  "author": "Agony-and-Despair",
  "original_created_utc": 1658250617,
  "title": "How do I ask my boyfriend to stop raging in games?",
  "created_utc": 1658287954,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;TW maybe? &lt;/p&gt;\n\n&lt;p&gt;A bit of backstory, I 19f, am living with my bf 19m, and we both really enjoy gaming. The only issue is, that he rages relatively frequently, wich includes banging on his table. I don&amp;#39;t mind the rest, but since I was regularly physically abused (he knows this), the sound of him beating the table really scares me and I almost start crying every time he does it. \nI don&amp;#39;t want him to stop gaming or pit limits on him, so I wanna know how I could bring this up without me feeling like I&amp;#39;m putting a leash on him. I have no doubts that ge&amp;#39;d stop immediately if I told him, I just don&amp;#39;t know how to bring it up...\nThanks in advance for your help&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/TrueAskReddit/comments/w2xvpj/how_do_i_ask_my_boyfriend_to_stop_raging_in_games/",
  "subreddit": "TrueAskReddit",
  "id": "w2xvpj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "TW maybe?\n\nA bit of backstory, I 19f, am living with my bf 19m, and we both really enjoy\ngaming. The only issue is, that he rages relatively frequently, wich includes\nbanging on his table. I don't mind the rest, but since I was regularly\nphysically abused (he knows this), the sound of him beating…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "TWかな？\n\n私は19歳で、19mの彼氏と一緒に住んでいて、二人ともゲームが好きです。\nゲームをしています。ただ一つ問題なのは、彼が比較的頻繁に暴れることです。\nテーブルを叩いたりすることです。私は他のことは気にならないのですが、私は日頃から身体的な虐待を受けていたので\n彼はそれを知っています）、彼が叩く音は...。",
      "title": "彼氏にゲームで暴れるのをやめてもらうにはどうしたらいいですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "也许是TW？\n\n说一下背景，我19岁，和我19岁的男朋友住在一起，我们都非常喜欢\n游戏。唯一的问题是，他经常发火，包括\n敲打他的桌子。我不介意其他方面，但由于我经常\n但由于我经常受到身体虐待（他知道这一点），他打人的声音......",
      "title": "我如何要求我的男朋友停止在游戏中发怒？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "也許是TW？\n\n說一下背景，我19歲，和我19歲的男朋友住在一起，我們都非常喜歡\n遊戲。唯一的問題是，他經常發火，包括\n敲打他的桌子。我不介意其他方面，但由於我經常\n但由於我經常受到身體虐待（他知道這一點），他打人的聲音......",
      "title": "我如何要求我的男朋友停止在遊戲中發怒？"
    }
  ]
}