{
  "author": "TaxShield",
  "the_new_excerpt": "Microsoft is developing dedicated streaming hardware that people will be able to\nhook up to their TVs to use its Netflix-like cloud gaming service.\n\nThe company is betting the future of video games will be a subscription-based\nmodel where people pay a certain amount of money each month to get access…",
  "original_created_utc": 1623343467,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "マイクロソフトは、テレビに接続してNetflixのようなクラウドゲーミングを利用できる、ストリーミング専用のハードウェアを開発しています。\nNetflixのようなクラウドゲーミングサービスを利用するために、テレビに接続できる専用のストリーミングハードウェアを開発しています。\n\n同社は、ビデオゲームの未来は、毎月一定額を支払うサブスクリプション型のモデルになると考えています。\n同社は、ビデオゲームの未来が、毎月一定の金額を支払うことで、ゲームにアクセスできる定額制モデルになると考えています。",
      "title": "マイクロソフトは、「Netflix for games」サービスをテレビで提供するための新しいハードウェアを開発しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "微软正在开发专用的流媒体硬件，人们将能够将其连接到电视上，使用类似于Netflix的云游戏服务。\n将其连接到电视上，以使用类似Netflix的云游戏服务。\n\n该公司打赌，视频游戏的未来将是一种基于订阅的模式。\n该公司打赌视频游戏的未来将是一种基于订阅的模式，人们每月支付一定数量的钱来获得访问权...",
      "title": "微软正在开发新的硬件，将其 \"游戏的Netflix \"服务带到电视上"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "微軟正在開發專用的流媒體硬件，人們將能夠將其連接到電視上，使用類似於Netflix的雲遊戲服務。\n將其連接到電視上，以使用類似Netflix的雲遊戲服務。\n\n該公司打賭，視頻遊戲的未來將是一種基於訂閱的模式。\n該公司打賭視頻遊戲的未來將是一種基於訂閱的模式，人們每月支付一定數量的錢來獲得訪問權...",
      "title": "微軟正在開發新的硬件，將其 \"遊戲的Netflix \"服務帶到電視上"
    }
  ],
  "title": "Microsoft is developing new hardware to bring its ‘Netflix for games’ service to TVs",
  "created_utc": 1623353416,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Microsoft is developing dedicated streaming hardware that people will be able to hook up to their TVs to use its Netflix-like cloud gaming service.</p>\n\n<p>The company is betting the future of video games will be a subscription-based model where people pay a certain amount of money each month to get access to a plethora of titles.</p>\n\n<p>Its Xbox Game Pass service does exactly that, offering access to a library of games developed both in-house and by third-party studios.</p>\n\n<p>That’s mostly digital downloads, but last year streaming was added with Microsoft publicly releasing Xbox Cloud Gaming. The feature is sort of like a “Netflix for games,” allowing gamers to play games that are hosted on remote servers and then streamed to users over the internet.</p>\n\n<p>A number of other companies have launched similar game-streaming services, including Google with Stadia and Amazon with Luna.</p>\n\n<p>Now, Microsoft is aiming to push its cloud gaming product to other platforms. It started rolling out Xbox Cloud Gaming to some users via a web browser on iPhones, iPads and PCs in April (Microsoft couldn’t launch a proper mobile app for cloud gaming on Apple devices due to a dispute over App Store policies). And on Thursday, the company announced it wants to expand the service to TVs as well.</p>\n\n<p>One way it plans to do that is by partnering with manufacturers to add cloud gaming to smart TVs. But Microsoft is also developing streaming devices which users can plug into their TV or computer monitor to stream games from the cloud. The company didn’t elaborate on what those devices could look like, though it’s reminiscent of Amazon’s Fire TV and Google’s Chromecast dongles, both of which now support cloud gaming.</p>\n\n<p>In addition, Microsoft says it is working with mobile carriers like Telstra in Australia to offer new Xbox subscription models. It’s also expanding cloud gaming to four new countries — Australia, Brazil, Mexico and Japan —  later this year, and aims to publicly launch the browser-based version of the software to all members of its $15-a-month Xbox Game Pass Ultimate subscription in the coming weeks.</p>\n\n<p>Microsoft said it plans to add cloud gaming to its new Xbox Series X console, which launched last November to compete with Sony’s PlayStation 5. In the next few weeks, the company will also upgrade the servers that power its cloud gaming service from its old Xbox One hardware to the Xbox Series X.</p>\n\n<p>Microsoft competes aggressively with Sony when it comes to gaming. But it’s taking a different strategy to its Japanese counterpart. While Sony is known for blockbuster exclusives that can only be played on a PlayStation console, Microsoft is focusing on embedding its Xbox services onto multiple platforms, including mobile and PC.</p>\n\n<p>Microsoft has been stepping up its investments in gaming, buying the iconic studio Bethesda for $7.5 billion in its biggest video game-related acquisition yet.</p>\n\n<p>The company is holding a joint event with Bethesda on Sunday as part of the E3 gaming conference to show off new games, with fans speculating they will reveal some details about a hotly-anticipated sci-fi game called Starfield.</p>\n\n<p><a href=\"https://www.cnbc.com/2021/06/10/e3-microsoft-xbox-cloud-gaming-tv.html\">https://www.cnbc.com/2021/06/10/e3-microsoft-xbox-cloud-gaming-tv.html</a></p>\n</div><!-- SC_ON -->",
  "score": 2928,
  "permalink": "/r/stocks/comments/nws8lb/microsoft_is_developing_new_hardware_to_bring_its/",
  "subreddit": "stocks",
  "id": "nws8lb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009743443
}