{
  "author": "saffron1990",
  "the_new_excerpt": "It's amazing how often I'm browsing this sub and I see people asking when is a\ngood time to exit back into fiat or when is a good time to sell.\n\nIt makes me realise just how many people still don't understand what is\nhappening right now.\n\nBitcoin is the exit strategy!\n\nWhen you buy it you are…",
  "original_created_utc": 1618441674,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブサイトを見ていると、「いつフィアットに戻るのがいいのか」「いつ売るのがいいのか」という質問をよく目にします。\nこのサイトを見ていると、フィアットに戻るにはいつ頃がいいのか、売るにはいつ頃がいいのかという質問をよく見かけます。\n\n今起きていることをどれだけの人がまだ理解していないかを実感します。\n今、何が起こっているのかを理解していない人がいかに多いかを実感します。\n\nビットコインは出口戦略なのです。\n\nビットコインを購入すると、あなたは...",
      "title": "ビットコインは出口戦略"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在浏览这个子的时候，经常看到有人问什么时候是一个\n退出回到菲亚特的好时机，或者说什么时候是卖出的好时机。\n\n这让我意识到，有多少人仍然不明白什么是\n现在正在发生.\n\n比特币是退出策略!\n\n当你买入它的时候你就...",
      "title": "比特币是退出策略"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在瀏覽這個子的時候，經常看到有人問什麼時候是一個\n退出回到菲亞特的好時機，或者說什麼時候是賣出的好時機。\n\n這讓我意識到，有多少人仍然不明白什麼是\n現在正在發生.\n\n比特幣是退出策略!\n\n當你買入它的時候你就...",
      "title": "比特幣是退出策略"
    }
  ],
  "title": "Bitcoin is the exit strategy",
  "created_utc": 1618471831,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It&#39;s amazing how often I&#39;m browsing this sub and I see people asking when is a good time to exit back into fiat or when is a good time to sell.</p>\n\n<p>It makes me realise just how many people still don&#39;t understand what is happening right now.</p>\n\n<p>Bitcoin is the exit strategy!</p>\n\n<p>When you buy it you are leaving the old world and entering the new. </p>\n\n<p>When I see these posts I always think of a person using a digital computer and someone asking them when are they are going to go back to using an analog typewriter. </p>\n\n<p>Money is slowly becoming digital and decentralised. Most people don&#39;t realise it yet but you are lucky to be at forefront of it. You have a front row seat to this revolution.</p>\n\n<p>The world of fiat and centralised banks is slowly dying. The people who adopt the new system will be rewarded the most and the people who stick with the old will lose out.</p>\n</div><!-- SC_ON -->",
  "score": 277,
  "permalink": "/r/CryptoCurrency/comments/mr2dxz/bitcoin_is_the_exit_strategy/",
  "subreddit": "CryptoCurrency",
  "id": "mr2dxz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566616778
}