{
  "author": "isabellamadison",
  "original_created_utc": 1646888380,
  "title": "Can a relationship survive cheating?",
  "created_utc": 1646896756,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I recently found out my boyfriend of 10 years has been cheating on me for about a month. I just don’t know what to do. I thought we were going to get engaged soon. He is the only person I have ever romantically loved. He is the only person I have ever been with physically. I have been with him since I was 15. Will I ever be able to be with him after this? I feel like I will never be able to look at him the same. I’m 25 and I am scared to start over again. I love him with my whole heart and I thought he loved me too. How can you do something like this to someone you love? Has anyone had their relationship survive or even improve after cheating? He is everything to me, but I just don’t see how this can be fixed. We have never broken up before and I have never cheated. I love his family and I loved our life together. I just don’t understand how he could do this to us. He says he wants to fix it but I don’t know.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 153,
  "permalink": "/r/TooAfraidToAsk/comments/taqzq8/can_a_relationship_survive_cheating/",
  "subreddit": "TooAfraidToAsk",
  "id": "taqzq8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I recently found out my boyfriend of 10 years has been cheating on me for about\na month. I just don’t know what to do. I thought we were going to get engaged\nsoon. He is the only person I have ever romantically loved. He is the only\nperson I have ever been with physically. I have been with him…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、10年付き合っている彼氏が浮気していることがわかりました。\n1ヶ月です。どうしたらいいのかわからないんです。婚約すると思っていたのに\nもうすぐです。彼は私が今まで恋愛で愛した唯一の人です。彼は唯一\n肉体関係を持ったことがある人。今まで一緒にいたのは...",
      "title": "浮気をしても関係は続くのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近发现我的十年男友对我不忠，大约有一个月了。\n一个月了。我只是不知道该怎么做。我以为我们很快就会订婚\n很快。他是我唯一曾经浪漫地爱过的人。他是唯一\n他是唯一与我有过身体接触的人。我一直和他在一起...",
      "title": "一段关系能否在出轨中生存？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近發現我的十年男友對我不忠，大約有一個月了。\n一個月了。我只是不知道該怎麼做。我以爲我們很快就會訂婚\n很快。他是我唯一曾經浪漫地愛過的人。他是唯一\n他是唯一與我有過身體接觸的人。我一直和他在一起...",
      "title": "一段關係能否在出軌中生存？"
    }
  ]
}