{
  "author": "RTHD20",
  "the_new_excerpt": "This isn’t some grand money making advice, but might help out a few people (like\nme) who want to be invested in crypto but don’t have a ton of capital.\n\nSo most people know about the Coinbase earn program, where you can complete\nactivities that give you free crypto (usually $3-$5). However, they…",
  "original_created_utc": 1622939702,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは金儲けのための大げさなアドバイスではありませんが、何人かの人の助けになるかもしれません（例えば\n私のように）暗号に投資したいが、大量の資本を持っていない人に役立つかもしれません。\n\nほとんどの人はCoinbase earn programを知っています。\n無料の暗号（通常は3～5ドル）がもらえる活動を行うことができます。しかし、彼らは...",
      "title": "Noob tip: ディップ時のCoinbaseの報酬獲得を完了させる"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这不是什么宏大的赚钱建议，但可能会帮助一些想投资加密货币但没有大量资本的人（比如我）。\n我）想投资加密货币，但没有大量的资金。\n\n因此，大多数人都知道Coinbase的赚钱计划，在那里你可以完成\n活动，给你免费的加密货币（通常是3-5美元）。然而，他们...",
      "title": "新手提示：完成Coinbase在下跌时赚取奖励"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這不是什麼宏大的賺錢建議，但可能會幫助一些想投資加密貨幣但沒有大量資本的人（比如我）。\n我）想投資加密貨幣，但沒有大量的資金。\n\n因此，大多數人都知道Coinbase的賺錢計劃，在那裏你可以完成\n活動，給你免費的加密貨幣（通常是3-5美元）。然而，他們...",
      "title": "新手提示：完成Coinbase在下跌時賺取獎勵"
    }
  ],
  "title": "Noob tip: complete Coinbase earn rewards during dips",
  "created_utc": 1623002149,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This isn’t some grand money making advice, but might help out a few people (like me) who want to be invested in crypto but don’t have a ton of capital. </p>\n\n<p>So most people know about the Coinbase earn program, where you can complete activities that give you free crypto (usually $3-$5). However, they don’t pay out in terms of crypto, they pay in the current dollar amount of crypto. So no matter what price a certain crypto is currently trading at, you will earn $3 of the crypto at the current price.</p>\n\n<p>Because of this, you should only complete these tasks during dips because you will get more coins and therefore have more room for growth. Hope this helps somebody!</p>\n\n<p>Edit: Some people have pointed out that the awards expire after a certain time/number of people completing it. So maybe the only real tip is, if you see that the market is down one day, use it as an excuse to do any rewards you can, cuz it’s a good time to do them :)</p>\n</div><!-- SC_ON -->",
  "score": 193,
  "permalink": "/r/CryptoCurrency/comments/nt9i15/noob_tip_complete_coinbase_earn_rewards_during/",
  "subreddit": "CryptoCurrency",
  "id": "nt9i15",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404882860
}