{
  "author": "peenguu",
  "original_created_utc": 1645959667,
  "title": "Why do people come in to break fights between men and women only after the guy decides to hit, while the women in many cases keeps on hitting the dude for a while before he hits back?",
  "created_utc": 1645993048,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve come across multiple videos of documented fight videos, general freakouts etc in which sometimes a guy and a girl are fighting.&lt;/p&gt;\n\n&lt;p&gt;I all most all cases there is a scenario where the girl repeatedly hits the dude, uses violence and provocation while everyone watching does nothing.\nBut after certain time when the dude decides to hit back or in some cases just protect himself, suddenly from the group watching some immediately step in to stop the fight.&lt;/p&gt;\n\n&lt;p&gt;Why is it considered okay and sometimes even funny when the guy is being hit, punched, kicked etc while the women gets away with it without crowd confronting her / both and the guy just gets either stopped, or even hit back by the group as soon as he retaliates&lt;/p&gt;\n\n&lt;p&gt;What kind of mentality in society leads to this&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/t2lwwd/why_do_people_come_in_to_break_fights_between_men/",
  "subreddit": "TooAfraidToAsk",
  "id": "t2lwwd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've come across multiple videos of documented fight videos, general freakouts\netc in which sometimes a guy and a girl are fighting.\n\nI all most all cases there is a scenario where the girl repeatedly hits the\ndude, uses violence and provocation while everyone watching does nothing. But\nafter…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、複数の格闘のドキュメントビデオ、一般的なフリークアウトのビデオに出会いました。\n男女が喧嘩をしていることがあります。\n\n私は、ほとんどの場合、少女が何度も殴るというシナリオがあります。\nを使用し、暴力と挑発を行い、見ている人は何もしない。しかし\nその後",
      "title": "なぜ、男女の喧嘩の仲裁に入る人は、男が殴ると決めた後だけで、女は殴られる前にしばらく殴り続けるケースが多いのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我遇到过多个有据可查的打架视频，一般的抓狂事件\n等，其中有时是一个男人和一个女孩在打架。\n\n在大多数情况下，都会出现这样一种情况：女孩反复打男人，使用暴力和挑衅，而观看的人却什么都不做。\n花花公子，使用暴力和挑衅，而观看的人却什么都不做。但是\n后...",
      "title": "为什么人们只在男人决定打人之后才来制止男女之间的争斗，而在许多情况下，女人在男人还击之前就一直在打他，而且打了好一阵子。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我遇到過多個有據可查的打架視頻，一般的抓狂事件\n等，其中有時是一個男人和一個女孩在打架。\n\n在大多數情況下，都會出現這樣一種情況：女孩反覆打男人，使用暴力和挑釁，而觀看的人卻什麼都不做。\n花花公子，使用暴力和挑釁，而觀看的人卻什麼都不做。但是\n後...",
      "title": "爲什麼人們只在男人決定打人之後纔來制止男女之間的爭鬥，而在許多情況下，女人在男人還擊之前就一直在打他，而且打了好一陣子。"
    }
  ]
}