{
  "author": "enigmazweb24",
  "the_new_excerpt": "This has been on my mind lately because I've recently started dating a girl\nwhose family is significantly wealthy (at least from my perspective).\n\nShe grew up in the Connecticut suburbs. Her family's money is old. It comes from\nthe heyday of NYC advertising. She and her siblings attended separate…",
  "original_created_utc": 1615915957,
  "localize": [
    {
      "locale": "zh",
      "title": "为什么有钱人不知道自己是有钱人？",
      "the_new_excerpt": "最近我一直在想这个问题 因为我最近开始和一个女孩约会了\n其家庭明显富裕（至少从我的角度来看）。\n\n她在康涅狄格州的郊区长大。她家的钱是旧的。它来自于\n纽约市广告业的鼎盛时期。她和她的兄弟姐妹分别参加了... ..."
    },
    {
      "locale": "zh-Hant",
      "title": "爲什麼有錢人不知道自己是有錢人？",
      "the_new_excerpt": "最近我一直在想這個問題 因爲我最近開始和一個女孩約會了\n其家庭明顯富裕（至少從我的角度來看）。\n\n她在康涅狄格州的郊區長大。她家的錢是舊的。它來自於\n紐約市廣告業的鼎盛時期。她和她的兄弟姐妹分別參加了... ..."
    }
  ],
  "title": "Why don't rich people know they're rich?",
  "created_utc": 1615938877,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This has been on my mind lately because I&#39;ve recently started dating a girl whose family is significantly wealthy (at least from my perspective).</p>\n\n<p>She grew up in the Connecticut suburbs. Her family&#39;s money is old. It comes from the heyday of NYC advertising. She and her siblings attended separate private boarding schools growing up, and they pay for everything with their own cards attached to their parent&#39;s accounts. Their private college is paid for in full as well.</p>\n\n<p>I myself am from a working class background. I grew up in rural Pennsylvania and I am the first and only person so far in my family to attend college. I grew up living in trailer courts and eventually, a modest 3 bd 1 bath house. </p>\n\n<p>My gf and I have been together for about 4 months, and she has been consistently tight-lipped (as most wealthy people are) regarding her family&#39;s lifestyle and exactly how much money they have. But I&#39;m very observant and it doesn&#39;t take a rocket scientist to figure out when someone is heavily privileged compared to yourself.</p>\n\n<p>This weekend, I had the pleasure of traveling with my gf to Connecticut to meet her parents for the first time. Let me just say: Holy shit. I was right. </p>\n\n<p>Her family is clearly wealthy. I mean, they don&#39;t own private jets or anything, but the house is a massive 6 bedroom, 6 bathroom place located on a huge piece of property with an incredibly nice courtyard, pool area, etc.</p>\n\n<p>In the weeks leading up to this visit, I was a nervous wreck about how a poor kid like me might come off to them. They aren&#39;t snobby people or anything, but I was really nervouse because of the class difference, and I vaguely told my gf this a few times before we went up.</p>\n\n<p>When we got there, I must&#39;ve looked like a deer in the headlights. The place was easily the most gorgeous home I&#39;ve ever been in. I was blown away.</p>\n\n<p>Shortly after we arrived and we had a minute to ourselves, my gf came up to me, gave me a kiss and a hug and said, sincere as could be:</p>\n\n<p>&quot;See? I told you were worried for nothing. My family isn&#39;t even rich, as you can clearly see.&quot;</p>\n\n<p>So my question is....how and why are rich people so out of touch about how rich they really are???</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/m6ei7t/why_dont_rich_people_know_theyre_rich/",
  "subreddit": "TooAfraidToAsk",
  "id": "m6ei7t",
  "is_self": true,
  "media": null,
  "is_video": false
}