{
  "author": "Techvarius",
  "original_created_utc": 1645171854,
  "title": "Kraken CEO Jesse Powell: \" If you worried about your assets being frozen don't keep your funds with any centralized/regulated custodian. We cannot protect you, cash out and only trade p2p.\"",
  "created_utc": 1645180863,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;There was a post by Kraken founder about new Canadian legislation and I saw one very interesting and alarming reply on the comments. One of his followers just replied Jesse that Kraken may be put in position to freeze our assets without judicial consent and will probably comply to that request. Jesse just 100% agreed with that person and on top of that suggested to keep funds away centralized exchanges.&lt;/p&gt;\n\n&lt;p&gt;I think it&amp;#39;s the first time we see any CEX CEO suggesting  to move away our funds from centralized custodians.  We should definitely appreciate the man for raising alarm and being so honest even though it may harm his business.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/6adhek7tuji81.png?width=711&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=82fdebbba0cb5ea86b4bebcdfa220c8c596304d3\"&gt;https://preview.redd.it/6adhek7tuji81.png?width=711&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=82fdebbba0cb5ea86b4bebcdfa220c8c596304d3&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 321,
  "permalink": "/r/CryptoCurrency/comments/svcqaj/kraken_ceo_jesse_powell_if_you_worried_about_your/",
  "subreddit": "CryptoCurrency",
  "id": "svcqaj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "There was a post by Kraken founder about new Canadian legislation and I saw one\nvery interesting and alarming reply on the comments. One of his followers just\nreplied Jesse that Kraken may be put in position to freeze our assets without\njudicial consent and will probably comply to that request.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "カナダの新しい法律に関するKrakenの創始者の投稿があり、私はあるものを見ました。\nコメント欄には、非常に興味深く、また憂慮すべき返信がありました。彼のフォロワーの一人が\nKrakenは、私たちの資産を凍結する立場に置かれるかもしれないとジェシーに返信した。\n司法の同意を得て、その要求に応じるのでしょう・・・。",
      "title": "Kraken CEO ジェシー・パウエル。「もしあなたの資産が凍結されることを心配しているのなら、中央集権的/規制されたカストディアンに資金を預けるべきではない。私たちはあなたを保護することはできません、キャッシュアウトしてP2P取引だけにしてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Kraken的创始人有一个关于加拿大新立法的帖子，我看到一个\n我在评论中看到一个非常有趣和令人震惊的答复。他的一个追随者刚刚\n回复Jesse说，Kraken可能会在未经司法同意的情况下冻结我们的资产。\n司法同意，并可能会遵守这一要求....。",
      "title": "Kraken首席执行官Jesse Powell。\" 如果你担心你的资产被冻结，不要把你的资金放在任何中央/监管的托管机构。我们不能保护你，把现金取出来，只进行P2P交易。\""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Kraken的創始人有一個關於加拿大新立法的帖子，我看到一個\n我在評論中看到一個非常有趣和令人震驚的答覆。他的一個追隨者剛剛\n回覆Jesse說，Kraken可能會在未經司法同意的情況下凍結我們的資產。\n司法同意，並可能會遵守這一要求....。",
      "title": "Kraken首席執行官Jesse Powell。\" 如果你擔心你的資產被凍結，不要把你的資金放在任何中央/監管的託管機構。我們不能保護你，把現金取出來，只進行P2P交易。\""
    }
  ]
}