{
  "author": "rainforest11",
  "the_new_excerpt": "Long post ahead, but I encourage you to read the whole thing. (This is a re-post\nand an updated version of a GME DD that reached the front page of WSB and many\nrequested it to be pinned. I am re-posting for visibility and because I believe\nthe message should be shared, particularly at this junction…",
  "original_created_utc": 1612712449,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "前面的文章很长，但我鼓励你读完。(这是一篇转贴\n和GME DD的更新版本，上了WSB的头版和许多人的网站\n要求将其钉住。我重发是为了提高知名度，同时也是因为我相信。\n信息应该共享，尤其是在这个路口... ...",
      "title": "证据表明，GME Shorts并没有覆盖，而是假装覆盖（通过使用期权非法 \"覆盖 \"合成多头股），以打破挤压。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "前面的文章很長，但我鼓勵你讀完。(這是一篇轉貼\n和GME DD的更新版本，上了WSB的頭版和許多人的網站\n要求將其釘住。我重發是爲了提高知名度，同時也是因爲我相信。\n信息應該共享，尤其是在這個路口... ...",
      "title": "證據表明，GME Shorts並沒有覆蓋，而是假裝覆蓋（通過使用期權非法 \"覆蓋 \"合成多頭股），以打破擠壓。"
    }
  ],
  "title": "Evidence points to GME Shorts not having covered but pretending they did (via the use of options to illegally \"cover\" with synthetic long shares) to break the squeeze",
  "created_utc": 1612726390,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Long post ahead, but I encourage you to read the whole thing. <em>(This is a re-post and an updated version of a GME DD that reached the front page of WSB and many requested it to be pinned. I am re-posting for visibility and because I believe the message should be shared, particularly at this junction in time. If you&#39;ve seen this post before, I would appreciate an upvote for visibility)</em></p>\n\n<p>TLDR: <strong>Data points strongly point to Hedge Funds using tricks to appear as if they covered their shorts when they haven&#39;t truly covered, specifically an illegal method/loophole to &quot;cover&quot; their shorts with synthetic long shares generated from the use of options</strong>. Full version below.</p>\n\n<p>There’s an insightful piece on <a href=\"https://tradesmithdaily.com/investing-strategies/the-drop-in-gamestop-short-interest-could-be-real-or-deceptive-market-manipulation/\">TradeSmithDaily</a> that identifies two ways for both short interest and price to fall quickly.</p>\n\n<p>The first scenario is from retail investors not holding the line and panic selling, driving the price down further, releasing into the market more of the float and enabling shorts to cover/buy back shares at progressively lower levels.</p>\n\n<p>**</p>\n\n<p>From TradeSmithDaily:</p>\n\n<p>Plummeting short interest along with a plummeting GME share price, in other words, could indicate that the Reddit army is headed for the hills, and the longs were selling early, giving the shorts a means to cover, as the longs got out… Important to note that if the long holders of GME shares did not break ranks and sell en masse, it would have been impossible for the share price to fall and hedge fund short interest to fall at the same time. because, without a critical mass of long-side holders selling into the market, the hedge funds covering their shorts would have nobody to buy from as they covered (bought back) their short positions.</p>\n\n<p>**</p>\n\n<p>The second scenario is where hedge fund short interest in GME didn’t really dissipate but instead they played a trick to make it seem like it did, demoralizing the retail side and further “breaking the squeeze.”</p>\n\n<p>**</p>\n\n<p>From TradeSmithDaily:</p>\n\n<p>The way the hedge funds could have done this — made it appear as if they covered their shorts, even when they really didn’t — involves trickery in the options market.</p>\n\n<p>The tactics involved are not a secret. In fact, the Securities and Exchange Commission (SEC) knows all about such tactics, and published a “risk alert” memo on the topic in August 2013.</p>\n\n<p>The SEC memo is titled “Strengthening Practices for Preventing and Detecting Illegal Options Trading Used to Reset Reg SHO Close-out Obligations.” You can <a href=\"https://www.sec.gov/about/offices/ocie/options-trading-risk-alert.pdf\">read it here via the SEC website</a>.</p>\n\n<p>The memo contains a dozen pages of highly technical language, but here’s a quick rundown:</p>\n\n<ul>\n<li>If short sellers are facing a squeeze because shares are hard to buy, or scrutiny for holding an illegal short position, they can create an appearance of having closed their short position through the use of deceptive options trades.</li>\n<li>A hedge fund that is short a stock can write call options on a stock — meaning they are now “short” the call options, having sold the call options to someone else (typically a market maker) — and simultaneously buy shares against the call options.</li>\n<li>The shares bought against the call options could be “synthetic” longs — meaning they are not part of the original share float of the stock — as sold to the hedge fund by the market maker that takes the other side of the options trade.</li>\n<li>This works because, if a market maker buys options from an options writer, the market maker has legal privileges to do a version of “naked shorting” as part of their hedging function. This is necessary, under the current rules and the current system, for market makers to protect themselves when facilitating options trades.</li>\n<li>As a result of the above transaction, the hedge fund that sold short calls was able to buy synthetic long shares against the calls. (A synthetic share is one that has a long on one side and a short on the other but wasn’t part of the original float.) The synthetic long shares are the other side of the naked shorts, legally initiated by the market maker, so the market maker can hedge.</li>\n<li>The hedge fund that bought the shares can now report that they have “bought back” their short position via buying long shares — except they actually haven’t! The synthetic shares they bought are canceled out against the short call positions they initiated, a necessity of the maneuver by way of the market maker’s hedging of the call position they bought from the hedge fund.</li>\n</ul>\n\n<p>It gets very complicated, very fast. But the gist is that <strong>hedge funds can use tricks to make it look like they’ve covered their shorts — even if they haven’t truly covered, and can’t, for lack of available float — by way of exploiting loopholes</strong> that exist due to an interplay of reporting rule delays, market maker naked shorting exceptions, and legal practices of synthetic share creation (new longs and shorts made from thin air) relating to market-making.</p>\n\n<p>Below is a section of the SEC memo (from page 8) that gets to the heart of it:</p>\n\n<p><strong><em>“Trader A may enter a buy-write transaction, consisting of selling deep-in-the-money calls and buying shares of stock against the call sale. By doing so, Trader A appears to have purchased shares to meet the broker-dealer’s close-out obligation for the fail to deliver that resulted from the reverse conversion. In practice, however, the circumstances suggest that Trader A has no intention of delivering shares, and is instead re-establishing or extending a fail position.</em></strong><strong>”</strong></p>\n\n<p>**</p>\n\n<p>In short (no pun intended) these tricks “help hedge funds maintain short positions that, legally speaking, they weren’t supposed to have because the shares were never properly located”. Which triggers alarm bells when we consider the extraordinarily high amount of FTIDs/Failed to Deliver Shares (<a href=\"https://wherearetheshares.com/\">https://wherearetheshares.com/</a>) and Michael Burry’s (now deleted tweet viewable here <a href=\"https://web.archive.org/web/20210130030954/https://twitter.com/michaeljburry?lang=en\">https://web.archive.org/web/20210130030954/https://twitter.com/michaeljburry?lang=en</a>) about how when he called back shares he lent out, brokers took weeks to actually find them with the implication they could not be located.</p>\n\n<p>These factors lend credence to the idea that shorts weren’t really covered but were given the impression of being covered with trickery using options, in order to “cover” short positions they shouldn’t have had to begin with because shares were never properly located.</p>\n\n<p>If this is true, and as explained earlier there are signs that indicate it is, this would allow short side funds to prolong their short positions indefinitely. This inspires a thought experiment, <strong>if funds are able to prolong their short positions with this method, wouldn&#39;t it make more financial sense for them to prolong their shorts rather than truly cover and close out their shorts at a -500% to -5000% loss</strong> when prices were at 300-400 last week (when they supposedly closed out a majority/large amount of short positions)? The saying for stocks goes\n&quot;its only a loss when you sell.&quot; The version for shorts would be &quot;its only a loss if you close out your short positions.&quot;</p>\n\n<p>Another factor to consider is there are well reasoned arguments <a href=\"https://www.reddit.com/r/wallstreetbets/comments/ledjwa/how_there_is_no_mathematical_way_shorts_were/\">here</a> and <a href=\"https://pastebin.com/AuhuKJu4\">here</a> (now a pastebin, originally a popular post from a reddit user) that, mathematically speaking, demonstrate shorts could not have afforded to truly cover the majority of their positions. Based on this train of logic, if shorts could not have afforded to truly cover most of their positions, it may have made the most sense for shorts to only cover their most underwater positions and prolong the majority of remainder shorts positions with the help of synthetic longs. The end goal being to wait for retail interest and stock price to go back down before truly closing all their positions (though FTID/phantom shares caused by the synthetic longs may be another complication for shorts to close their positions.) I&#39;ve read experiences that support the hypothesis of shorts only closing their most underwater positions last week and won&#39;t post them as they&#39;re anecdotal, but if you&#39;ve witnessed similar experiences feel free to share them in the comments.</p>\n\n<p>Another point to consider is if a large amount of short positions were indeed truly covered, there would theoretically be immensely strong buy pressure to drive the price of the stock up. Instead, during the time that shorts supposedly covered, price of the stock somehow went into a free fall in the past week. Why? Something to think about.</p>\n\n<p>In considering the potential use of synthetic longs by shorts to prolong their positions we must factor in the possibility that shorts might no longer be under as much pressure as they were before to cover. What can retail investors do in that case?</p>\n\n<p><strong>A) One recourse retail investors could have would be to encourage GME to issue a reverse stock split as it forces borrowers to return shares back to their holders, which in theory would put the naked short sellers in a compromised position. (If you care about forcing the issue, you can follow the instructions <a href=\"https://www.reddit.com/r/wallstreetbets/comments/lcpwh0/how_gme_can_still_be_a_great_play/gm2tsnw/%20and%20make%20a%20difference\">here</a>.</strong></p>\n\n<p><strong>B) Another recourse would be to bring the matter to the SEC&#39;s attention for investigation, which you can do at <a href=\"https://www.sec.gov/tcr\">https://www.sec.gov/tcr</a></strong></p>\n\n<p>Sidenote: On the subject of synthetic long shares, another instance where they came into the story recently was when S3 Partners released it&#39;s GME short interest % calculations last week, from a short interest from on 122% on 1/28 Thursday to 113% on 1/29 Friday) to 55% on 1/31 Sunday, which many found to be suspicious. Later it was discovered that number of 55% was calculated using the same data set that yielded 113% short interest percentage, but with the significant difference of including synthetic long shares into the short float equation, which is against standard practice but which S3 abruptly decided on Sunday to make their new main metric of SI%. Many questioned logic and timing of this decision. One consequence of this decision was that the media picked up on the &quot;new&quot; short interest percentage of 55% and spread it as a new narrative during market open on the morning of 2/1 Monday. Whether this influenced subsequent buy/sell behavior, and if so, to what degree is something to consider.</p>\n\n<p>If you think about GME as a battle between short side funds and retail investors (there are likely other players involved but for the purpose of this analysis we&#39;ll focus on these two), information plays a major role and there is an information asymmetry on the retail investor&#39;s side. For example, hedge funds know the positions they&#39;re in and can share data with each other whereas retail investors are in the dark about many important data points. An example of an information asymmetry on the retail investor&#39;s side is the unavailability and general inaccessibility of of true real-time short interest percentage. A lot of retail investors are waiting for the short interest report on February 9th to help inform them of their next moves, but while this report is a data point, the data in the the report will still be two weeks old. With that said, examples of what investors have available for estimating the immediate short term interest are things like short interest borrow rate and calculated inferences from other data points.</p>\n\n<p>There&#39;s an adage oft repeated on WSB that retail investors can be irrational longer than funds can stay solvent. The &quot;paper hand&quot; sell off earlier this week in part appears to contradict that statement. To explore it from another perspective, if you consider the possibility that short side funds are taking a long term play (on their short positions by extending them with synthetic long shares), then so far it would seem that funds can stay solvent longer than paper hands can stay patient (case in point being the retail sell-off when the price started dropping.) </p>\n\n<p>At least one lesson that could be draw from this is that the better retail investors understand how hedge funds think and operate, the better it will benefit them in navigating this situation intelligently. An analysis of events of the the past week leads me to believe hedge funds deployed at least three tactics from the Art of War:</p>\n\n<ul>\n<li><strong>&quot;Deceiving and confusing the enemy is a more effective path to victory than openly fighting with them.&quot;</strong> I personally believe the press release from Melvin Capital on 1/27 about closing their short positions was an example of this, they wanted us to believe their short positions were closed thus ending justification for the short squeeze.</li>\n<li><strong>&quot;If you know your enemies and know yourself, you will not be imperiled in a hundred battles.&quot;</strong> Hedge funds knew the weakness of the retail side was the lack of cohesion and leadership (by nature the lack of leadership was a disadvantage for any leader to the movement may be accused of manipulating retail buyers and scapegoated) and they knew that if price drops low enough many retail buyers will panic sell, so all they needed to do was attempt to drive the price down via whatever methods at their disposal whether thats through misinformation or Short Ladder Attacks which are and potentially other methods (there&#39;s arguments on whether Short Ladder Attacks really exist and I won&#39;t get into it here but I encourage you to do your own research)</li>\n<li><strong>&quot;If his forces are united, separate them&quot;</strong> aka divide and conquer. Upon driving &quot;weak-hands&quot; to sell-off this divides the retail buying group and creates bears out of some of those who held, who then spread their views and further the divide. Another example is the silver fake news/manipulation and the very real possibility or reality of bots sent into this sub to push a message and sow division.</li>\n</ul>\n\n<p>I will leave you with that and a reminder to do your own research as well, for as investors we do not have all the information. The most we can do is intelligently speculate with as much data and logic as we can gather. I wrote this post because I spotted some inconsistencies within the GME stock that in my opinion, once brought to awareness, would either be irresponsible or willfully ignorant to not examine further. If you agree with the ideas explored in this post, feel free to share with whomever you&#39;d like, and thank you for your part in raising awareness.</p>\n\n<p><em>To provide context for the timeline of events described in this post, this post was originally written on Thursday 2/4/21 and updated on Sunday 2/7/21.</em></p>\n\n<p><em>For liability purposes, everything in this post is simply a thought experiment. I am not a financial advisor and no part of what is written constitutes as financial advice.</em></p>\n\n<p>If you&#39;d like to read more into the subject of synthetic long shares and how it could be currently misused in the context of GME:</p>\n\n<p><a href=\"https://www.reddit.com/r/wallstreetbets/comments/ldjbg1/analysis_on_why_hedge_funds_didnt_reposition_last/\">https://www.reddit.com/r/wallstreetbets/comments/ldjbg1/analysis_on_why_hedge_funds_didnt_reposition_last/</a></p>\n\n<p><a href=\"https://www.reddit.com/r/wallstreetbets/comments/lalucf/i_suspect_the_hedgies_are_illegally_covering/\">https://www.reddit.com/r/wallstreetbets/comments/lalucf/i_suspect_the_hedgies_are_illegally_covering/</a></p>\n\n<p><a href=\"https://www.reddit.com/r/wallstreetbets/comments/l97ykd/the_real_reason_wall_street_is_terrified_of_the/\">https://www.reddit.com/r/wallstreetbets/comments/l97ykd/the_real_reason_wall_street_is_terrified_of_the/</a></p>\n\n<p><a href=\"https://www.reddit.com/r/wallstreetbets/comments/lanf94/gme_is_a_time_bomb_and_its_highlighting_a_severe/\">https://www.reddit.com/r/wallstreetbets/comments/lanf94/gme_is_a_time_bomb_and_its_highlighting_a_severe/</a></p>\n\n<p><a href=\"https://www.reddit.com/r/wallstreetbets/comments/lag1d3/why_gme_short_interest_appears_to_have_fallen/\">https://www.reddit.com/r/wallstreetbets/comments/lag1d3/why_gme_short_interest_appears_to_have_fallen/</a></p>\n\n<p><a href=\"https://www.reddit.com/r/wallstreetbets/comments/l9rk78/sec_doj_60_minutes_public_data_suggests_massive/\">https://www.reddit.com/r/wallstreetbets/comments/l9rk78/sec_doj_60_minutes_public_data_suggests_massive/</a></p>\n\n<p><a href=\"https://www.reddit.com/r/wallstreetbets/comments/l9z88h/evidence_of_massive_naked_short_selling_fraud_in/\">https://www.reddit.com/r/wallstreetbets/comments/l9z88h/evidence_of_massive_naked_short_selling_fraud_in/</a></p>\n\n<p><a href=\"https://www.reddit.com/r/wallstreetbets/comments/lbydkz/s3_partners_s3_si_of_float_metric_is_total/\">https://www.reddit.com/r/wallstreetbets/comments/lbydkz/s3_partners_s3_si_of_float_metric_is_total/</a></p>\n\n<p>For a perspective on why the squeeze has not squoze you can read <a href=\"https://www.reddit.com/r/wallstreetbets/comments/le235t/gme_institutions_hold_177_of_float_why_the/\">this</a></p>\n</div><!-- SC_ON -->",
  "score": 22664,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/ir3vp-di9IhCcm4kh4tFMGWog48JPY-tkBKMaOucql8.jpg?auto=webp&s=282519a29a4a6a1090f78d8c4e6cf8432e1ce061",
          "width": 670,
          "height": 354
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/ir3vp-di9IhCcm4kh4tFMGWog48JPY-tkBKMaOucql8.jpg?width=108&crop=smart&auto=webp&s=dd5b49ad91139665c162d330d9fc53fe2ee7476e",
            "width": 108,
            "height": 57
          },
          {
            "url": "https://external-preview.redd.it/ir3vp-di9IhCcm4kh4tFMGWog48JPY-tkBKMaOucql8.jpg?width=216&crop=smart&auto=webp&s=23955673f0807e2831196f78a609cbb70cb41267",
            "width": 216,
            "height": 114
          },
          {
            "url": "https://external-preview.redd.it/ir3vp-di9IhCcm4kh4tFMGWog48JPY-tkBKMaOucql8.jpg?width=320&crop=smart&auto=webp&s=57638a0e7426d6147c624503ec875f6d1a3088e7",
            "width": 320,
            "height": 169
          },
          {
            "url": "https://external-preview.redd.it/ir3vp-di9IhCcm4kh4tFMGWog48JPY-tkBKMaOucql8.jpg?width=640&crop=smart&auto=webp&s=b7612cc973f1197f3222fe5494c37166995229f4",
            "width": 640,
            "height": 338
          }
        ],
        "variants": {},
        "id": "Ljnm1p7Cku1GfSM41RTSNwhXa6gHOBGUnfkWw9bt7r0"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/wallstreetbets/comments/leorks/evidence_points_to_gme_shorts_not_having_covered/",
  "subreddit": "wallstreetbets",
  "id": "leorks",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123215629
}