{
  "author": "JitterySuperCoffee",
  "original_created_utc": 1657109677,
  "title": "Not sure if this is the right place but, why is/ was pre-clovis culture so controversial?",
  "created_utc": 1657125444,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Pretty much the title. I’ve recently been down an pre-clovis rabbit hole and pretty much every story has the line “this archeologist/ palaeontologist was launched out of the room until they were vindicated 20/30 years later. It still seems, from my very limited perspective, that “clovis firsters” are dead set against recognising anything older than 13,000 years.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/vsolxr/not_sure_if_this_is_the_right_place_but_why_is/",
  "subreddit": "AskHistorians",
  "id": "vsolxr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Pretty much the title. I’ve recently been down an pre-clovis rabbit hole and\npretty much every story has the line “this archeologist/ palaeontologist was\nlaunched out of the room until they were vindicated 20/30 years later. It still\nseems, from my very limited perspective, that “clovis firsters”…",
  "localize": [
    {
      "locale": "ja",
      "title": "ここでいいのかどうかわかりませんが、クロヴィス以前の文化は、なぜこれほどまでに議論を呼ぶのでしょうか？",
      "the_new_excerpt": "かなりタイトルが 最近、クロヴィス以前のウサギの穴に入ってみたのですが\nこの考古学者・古生物学者は部屋から追い出された」という台詞があります。\n20～30年後に正当性が証明されるまで、部屋から追い出された。それでも\n私の限られた視点からは、「クロヴィス第一主義者」が..."
    },
    {
      "locale": "zh",
      "the_new_excerpt": "差不多是这个题目。我最近进入了一个前克洛维斯时代的兔子洞，几乎每个故事都有一句话：\"这个考古学家/古生物学家是个疯子。\n几乎每个故事都有这样一句话：\"这个考古学家/古生物学家被推出房间，直到\n直到20/30年后他们被平反，才被赶出房间。它仍然\n从我非常有限的角度来看，似乎 \"克洛维第一人\"...",
      "title": "不确定这是否是正确的地方，但是，为什么前克洛维斯文化是/曾经是如此有争议？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "差不多是這個題目。我最近進入了一個前克洛維斯時代的兔子洞，幾乎每個故事都有一句話：\"這個考古學家/古生物學家是個瘋子。\n幾乎每個故事都有這樣一句話：\"這個考古學家/古生物學家被推出房間，直到\n直到20/30年後他們被平反，才被趕出房間。它仍然\n從我非常有限的角度來看，似乎 \"克洛維第一人\"...",
      "title": "不確定這是否是正確的地方，但是，爲什麼前克洛維斯文化是/曾經是如此有爭議？"
    }
  ]
}