{
  "author": "hanmayrobyou",
  "the_new_excerpt": "How do they find out it's going to be safe without first potentially putting\nsomeone in danger? I get they can probably test on animals first, but then\nsurely there's still some small risk when it goes to humans?\n\nSorry if I've picked the wrong flair. It was covid that inspired the question,\nbut I'd…",
  "original_created_utc": 1616576269,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "他们如何发现它将是安全的，而不首先可能把\n有人遇险？我知道他们可能会先在动物身上做测试，但随后... ...\n当然，到了人类身上，肯定还是有一些小风险的？\n\n如果我选错了天赋，对不起。是covid启发了我的问题。\n但我...",
      "title": "孕妇如何对疫苗进行伦理检测？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "他們如何發現它將是安全的，而不首先可能把\n有人遇險？我知道他們可能會先在動物身上做測試，但隨後... ...\n當然，到了人類身上，肯定還是有一些小風險的？\n\n如果我選錯了天賦，對不起。是covid啓發了我的問題。\n但我...",
      "title": "孕婦如何對疫苗進行倫理檢測？"
    }
  ],
  "title": "How are vaccines tested for pregnant women in an ethical way?",
  "created_utc": 1616628756,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>How do they find out it&#39;s going to be safe without first potentially putting someone in danger? I get they can probably test on animals first, but then surely there&#39;s still some small risk when it goes to humans?</p>\n\n<p>Sorry if I&#39;ve picked the wrong flair. It was covid that inspired the question, but I&#39;d like to know how they went through the process for other vaccines too (if there&#39;s a difference)</p>\n\n<p>Edit: If anyone&#39;s reading this now, I&#39;d recommend having a good read through all the comments: lots of expertise to be found. There&#39;s also a couple of links to organisations that track pregnant women who have chosen to have the vaccinations, a process which, I think, should answer my question. Off the top of my head: V-SAFE in the US, and the UKOSS/UKTIS study in the UK. Feel free to correct me if I&#39;m wrong.</p>\n</div><!-- SC_ON -->",
  "score": 2971,
  "permalink": "/r/askscience/comments/mc14pl/how_are_vaccines_tested_for_pregnant_women_in_an/",
  "subreddit": "askscience",
  "id": "mc14pl",
  "is_self": true,
  "media": null,
  "is_video": false
}