{
  "author": "002timmy",
  "original_created_utc": 1660077184,
  "title": "Someone is using Tornado Cash to send ETH to Doxxed Wallets",
  "created_utc": 1660088388,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It appears there&amp;#39;s still some chaotic good left in the world.  Earlier today, someone or a group of individuals began using tornado cash to send ETH to known wallets of celebrities.  Recipients included Donald Trump, Jimmy Fallon, Beeple, Shaq, Brian Armstrong, Randi Zuckerberg, BitBoy and many more.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/i6ppnxs70rg91.jpg?width=828&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=1a9f5214310bde915513de3ba1c50bbc611ca9fc\"&gt;https://preview.redd.it/i6ppnxs70rg91.jpg?width=828&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=1a9f5214310bde915513de3ba1c50bbc611ca9fc&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Basically, what this does is create a situation where &amp;quot;if everyone is guilty, then no one is.&amp;quot; Either the U.S. actually imposes sanctions on innocent and &amp;quot;guilty&amp;quot; recipients, or none at all, because good luck proving someone actually intended to receive the ETH from TC. &lt;/p&gt;\n\n&lt;p&gt;And yes, in all likelihood it will be easy to show you were a part of a dusting attack, but now exchanges can&amp;#39;t simply blacklist any wallet that interacted with Tornado Cash.  Wealthy groups could even use TC to take down competitors.  For example, if I don&amp;#39;t like a DAO, I can simply send it a few ETH from TC and then watch them struggle to off-ramp their treasury.&lt;/p&gt;\n\n&lt;p&gt;This type of attack was pretty obvious to crypto users from the beginning, but you can be sure congress never expected this to happen.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 614,
  "permalink": "/r/CryptoCurrency/comments/wkdwj8/someone_is_using_tornado_cash_to_send_eth_to/",
  "subreddit": "CryptoCurrency",
  "id": "wkdwj8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "It appears there's still some chaotic good left in the world. Earlier today,\nsomeone or a group of individuals began using tornado cash to send ETH to known\nwallets of celebrities. Recipients included Donald Trump, Jimmy Fallon, Beeple,\nShaq, Brian Armstrong, Randi Zuckerberg, BitBoy and many…"
}