{
  "author": "notaselfdrivingcar",
  "the_new_excerpt": "Earlier I received a DM from a stranger on Reddit, I thought it was one of those\nscammers trying to get me to invest in their shitty exchange.\n\nBut it was a stranger who wanted help with something I faced too while sending\nNano from Kraken to my Exodus wallet.\n\nI helped them, and they were so happy…",
  "original_created_utc": 1620403240,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "以前、Redditで見知らぬ人からDMを受け取りました。\n詐欺師の一人かと思いました。\n\nしかし、それは私が送信中に直面したことについて助けを求めている見知らぬ人でした。\nクラーケンからエクソダスのウォレットにナノを送っている間に、私も直面したことについて助けを求めていました。\n\n私は彼らを助け、彼らはとても幸せだった...",
      "title": "私はここで見知らぬ人がKrakenから保留中のトランザクションを受け取るのを助け、彼らは私に10ドル相当のcryptoをチップしました。驚きました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "早些时候，我在Reddit上收到一个陌生人的DM，我以为是那些\n骗子想让我投资他们的低劣交易所。\n\n但这是一个陌生人，他想帮助我解决我在发送Nano到我的Exodus钱包时也遇到的问题。\n从Kraken向我的Exodus钱包发送纳米币时，也遇到了一些问题。\n\n我帮助了他们，他们非常高兴...",
      "title": "我帮助这里的一个陌生人从Kraken收到了一笔待定交易，他们给了我价值10美元的加密货币小费。我很惊讶。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "早些時候，我在Reddit上收到一個陌生人的DM，我以爲是那些\n騙子想讓我投資他們的低劣交易所。\n\n但這是一個陌生人，他想幫助我解決我在發送Nano到我的Exodus錢包時也遇到的問題。\n從Kraken向我的Exodus錢包發送納米幣時，也遇到了一些問題。\n\n我幫助了他們，他們非常高興...",
      "title": "我幫助這裏的一個陌生人從Kraken收到了一筆待定交易，他們給了我價值10美元的加密貨幣小費。我很驚訝。"
    }
  ],
  "title": "I helped a stranger here receive a pending transaction from Kraken, And they tipped me 10$ worth of crypto. I'm Amazed.",
  "created_utc": 1620412973,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Earlier I received a DM from a stranger on Reddit, I thought it was one of those scammers trying to get me to invest in their shitty exchange.</p>\n\n<p>But it was a stranger who wanted help with something I faced too while sending Nano from Kraken to my Exodus wallet.</p>\n\n<p>I helped them, and they were so happy that they tipped me 1 Nano, which is the equivalent of 10$ right now.</p>\n\n<p>I&#39;m happy, Amazed, and glad I could help him with his transaction.</p>\n</div><!-- SC_ON -->",
  "score": 349,
  "permalink": "/r/CryptoCurrency/comments/n71vwe/i_helped_a_stranger_here_receive_a_pending/",
  "subreddit": "CryptoCurrency",
  "id": "n71vwe",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985988848
}