{
  "author": "Temperlord",
  "original_created_utc": 1640014166,
  "title": "Is there a specific reason why crypto is continuously falling at the moment?",
  "created_utc": 1640025582,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Is this still a bear market? Is it a fucked bull market? What is even going on? When searching for possible reasons as to why it’s happening, most sources seem to suggest that it’s due to the uncertainty around a new covid variant. But wasn’t this kind of danger/threat always present? And why is going down „slowly“ compared to a harsher „crash“ like just a few weeks ago? My tactic is to HODL and DCA my coins/tokens anyway so it doesn’t affect me as much I feel, but I’m getting curious as to why my portfolio is seeing mainly red for a while now.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 282,
  "permalink": "/r/CryptoCurrency/comments/rkpsxs/is_there_a_specific_reason_why_crypto_is/",
  "subreddit": "CryptoCurrency",
  "id": "rkpsxs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Is this still a bear market? Is it a fucked bull market? What is even going on?\nWhen searching for possible reasons as to why it’s happening, most sources seem\nto suggest that it’s due to the uncertainty around a new covid variant. But\nwasn’t this kind of danger/threat always present? And why is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これはまだ弱気相場なのでしょうか？めちゃくちゃな強気相場なのか？何が起こっているのか？\nなぜこのようなことが起こっているのか、考えられる理由を探してみると、ほとんどの情報源は、このようなことが起こっているようです。\n新種のコビドをめぐる不確実性が原因だと指摘しています。しかし\nこのような危険・脅威は常に存在していたのではないのか？そして、なぜ...",
      "title": "現在、暗号が継続的に下落しているのは、何か特別な理由があるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这仍然是一个熊市吗？这是一个该死的牛市吗？到底发生了什么？\n当搜索为什么会发生这种情况的可能原因时，大多数消息来源似乎表明，这是由于周围的不确定性。\n暗示这是由于新的covid变体的不确定性造成的。但是\n这种危险/威胁不是一直存在吗？而且为什么...",
      "title": "目前加密货币连续下跌有什么具体原因吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這仍然是一個熊市嗎？這是一個該死的牛市嗎？到底發生了什麼？\n當搜索爲什麼會發生這種情況的可能原因時，大多數消息來源似乎表明，這是由於周圍的不確定性。\n暗示這是由於新的covid變體的不確定性造成的。但是\n這種危險/威脅不是一直存在嗎？而且爲什麼...",
      "title": "目前加密貨幣連續下跌有什麼具體原因嗎？"
    }
  ]
}