{
  "author": "dexdox",
  "original_created_utc": 1638525792,
  "title": "Why are some impressions of accents considered racist and others aren't?",
  "created_utc": 1638558882,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Why is it considered racist or bigoted when someone does a Mexican or Chinese accent (or anything that sounds super foreign to our colonizer ears) but it isn&amp;#39;t considered racist when people do British, French, Italian, etc. accents? I saw a person get called out pretty heavily on tiktok a couple months ago for doing a Mexican accent but they did both a Mexican and British accent in the same video and didn&amp;#39;t get any sort of call out on the latter.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/NoStupidQuestions/comments/r7vtnl/why_are_some_impressions_of_accents_considered/",
  "subreddit": "NoStupidQuestions",
  "id": "r7vtnl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Why is it considered racist or bigoted when someone does a Mexican or Chinese\naccent (or anything that sounds super foreign to our colonizer ears) but it\nisn't considered racist when people do British, French, Italian, etc. accents? I\nsaw a person get called out pretty heavily on tiktok a couple…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "なぜ、メキシコ人や中国人の真似をすると、人種差別や偏見とみなされるのでしょうか？\n訛り（あるいは植民地化した私たちの耳には超異国風に聞こえるもの）ではなく\nイギリス、フランス、イタリアなどの訛りは人種差別とみなされないのですか？I\n以前、tiktokで激しく罵倒された人がいましたね...。",
      "title": "訛りの印象が差別的とされるものとそうでないものがあるのはなぜですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "为什么当有人用墨西哥或中国口音（或任何听起来超级陌生的东西）时，就被认为是种族主义者或偏执者？\n口音（或任何对我们的殖民者来说听起来超级陌生的口音），但它不是\n而当人们操着英国、法国、意大利等国的口音时却不被认为是种族主义者？I\n我看到一个人在tiktok上被骂得很厉害，有几次...",
      "title": "为什么有些口音的印象被认为是种族主义的，而有些则不是？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "爲什麼當有人用墨西哥或中國口音（或任何聽起來超級陌生的東西）時，就被認爲是種族主義者或偏執者？\n口音（或任何對我們的殖民者來說聽起來超級陌生的口音），但它不是\n而當人們操着英國、法國、意大利等國的口音時卻不被認爲是種族主義者？I\n我看到一個人在tiktok上被罵得很厲害，有幾次...",
      "title": "爲什麼有些口音的印象被認爲是種族主義的，而有些則不是？"
    }
  ]
}