{
  "author": "moneytobemade8",
  "the_new_excerpt": "As the Title Suggests, No One can accurately predict when the market is at the\ntop or when it will crash. If people knew, they certainly wouldn't share on\nReddit because they would be earning millions or billions of dollars.\n\nTiming the market is impossible and it's better to ride out the ups and…",
  "original_created_utc": 1620244102,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルが示すように、市場がいつ頂点に達するのか、いつ暴落するのかを正確に予測することは誰にもできません。\nいつ暴落するかを正確に予測することはできません。もし人々が知っていたとしても、Redditで共有することはないでしょう。\n何百万ドル、何十億ドルも稼いでいるでしょうから。\n\n市場のタイミングを計ることは不可能であり、上昇や下降を乗り切る方が良いのではないでしょうか。",
      "title": "市場の頂点は誰にもわからない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "正如标题所暗示的，没有人能够准确地预测市场何时处于顶部或何时崩溃。\n或何时会崩溃。如果人们知道，他们肯定不会在\nReddit上分享，因为他们会赚取数百万或数十亿美元。\n\n掌握市场时机是不可能的，最好是在涨跌中度过。",
      "title": "没有人知道市场何时处于顶部"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "正如標題所暗示的，沒有人能夠準確地預測市場何時處於頂部或何時崩潰。\n或何時會崩潰。如果人們知道，他們肯定不會在\nReddit上分享，因爲他們會賺取數百萬或數十億美元。\n\n掌握市場時機是不可能的，最好是在漲跌中度過。",
      "title": "沒有人知道市場何時處於頂部"
    }
  ],
  "title": "No One Knows When The Market Is At The Top",
  "created_utc": 1620330640,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As the Title Suggests, No One can accurately predict when the market is at the top or when it will crash. If people knew, they certainly wouldn&#39;t share on Reddit because they would be earning millions or billions of dollars.</p>\n\n<p>Timing the market is impossible and it&#39;s better to ride out the ups and downs. In many cases, most of your stock gains come from a few days of big gains. Imagine trying to time a stock and in a few days, it goes up 15%. Most of my gains have come from a few strong days.</p>\n\n<p>One of my favorite quote is: &quot;The Markets Can Remain Irrational Longer Than You Can Remain Solvent&quot;.</p>\n\n<p>Sure the market can be &quot;overvalued&quot; (I am not saying it is), but the market may be like this for the next few years and stocks may keep going up. Just because you were trying to time the market, you missed out on these years of gains.</p>\n\n<p>Good luck investing!</p>\n</div><!-- SC_ON -->",
  "score": 37,
  "permalink": "/r/stocks/comments/n5osas/no_one_knows_when_the_market_is_at_the_top/",
  "subreddit": "stocks",
  "id": "n5osas",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985995600
}