{
  "author": "CertifiedNerdyGirl",
  "original_created_utc": 1628746465,
  "title": "What's so bad about socialism anyway?",
  "created_utc": 1628780236,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Please don&#39;t drag me through the mud, I&#39;m seeking to understand better. I&#39;ve lived in the US my whole life and, frankly, capitalism seems to only work for a few people in this country. People say &quot;I don&#39;t wanna pay for someone else&#39;s bills&quot; but they already do. Whether it&#39;s welfare or higher insurance premiums from uninsured ER visits. So it just feels like, if capitalism means the majority of the money goes to the rich and never really trickles down, isn&#39;t it time to try a new system? </p>\n\n<p>I&#39;d love to hear anyone&#39;s thoughts on this. I took a basic economics course in college but that&#39;s about it. Thanks in advance for your input.</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/TooAfraidToAsk/comments/p2tj00/whats_so_bad_about_socialism_anyway/",
  "subreddit": "TooAfraidToAsk",
  "id": "p2tj00",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Please don't drag me through the mud, I'm seeking to understand better. I've\nlived in the US my whole life and, frankly, capitalism seems to only work for a\nfew people in this country. People say \"I don't wanna pay for someone else's\nbills\" but they already do. Whether it's welfare or higher…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はもっと理解したいと思っているので、泥沼に引き込まないでください。私は\n率直に言って、資本主義は一部の人にしか通用しないようです。\n率直に言って、資本主義はこの国の一部の人々のためにしか機能していないようです。人々は「他人の請求書にお金を払いたくない」と言いますが、彼らはすでに払っているのです。\nと言いますが、彼らはすでに支払っているのです。それが生活保護であろうと、高い給料であろうと...。",
      "title": "社会主義の何が悪いのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "请不要把我拖入泥潭，我在寻求更好的理解。我\n坦率地说，资本主义似乎只对少数人有效。\n这个国家的少数人。人们说 \"我不想为别人的账单买单\"，但他们已经这样做了。\n账单\"，但他们已经这样做了。无论是福利还是更高的...",
      "title": "社会主义到底有什么不好？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "請不要把我拖入泥潭，我在尋求更好的理解。我\n坦率地說，資本主義似乎只對少數人有效。\n這個國家的少數人。人們說 \"我不想爲別人的賬單買單\"，但他們已經這樣做了。\n賬單\"，但他們已經這樣做了。無論是福利還是更高的...",
      "title": "社會主義到底有什麼不好？"
    }
  ]
}