{
  "author": "GG-Enterprises",
  "original_created_utc": 1641328135,
  "title": "dont be like your parents.. INVEST NOW, so your kids can grow up with money and become the douche bags you always hated",
  "created_utc": 1641371897,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been in crypto for a while and no im not rich yet. but what i been noticing besides the price flux lol, is the amount of people that is getting into crypto as a whole. if its not investing its NFT games, or using it to buy something at a discount at somewhere like the Dallas Mavericks stadium, or people are just seeing ads or companies that produce products they use, get into it.&lt;/p&gt;\n\n&lt;p&gt;the other day on the train i seen many train carts with AVAX (Avalanche blockchain) ads all over the inside of the train cart in NYC ( you can imagine the excitement i felt lol) , i also seen ads for Upland ( a crypto real estate game)&lt;/p&gt;\n\n&lt;p&gt;this is our chance to really get invested and wait for things to get better. I know there&amp;#39;s a chance the market will collapse in a spectacle of people pulling their hair out and jumping out windows, but with the amount of institutions and big companies getting involved, i doubt it. the amount of users they will bring on to what ever networks they decide to work with will def help the case.&lt;/p&gt;\n\n&lt;p&gt;every time the internet upgrades a good handful of people get rich, and yes alot of people lose money also ( but those are the impatient people or the people who put in too much and end up having to pull out )&lt;/p&gt;\n\n&lt;p&gt;even look at this video from after skool is all about crypto. ( mainly ether and bitcoin ) but they are a youtube channel that makes videos about mental health and life&lt;/p&gt;\n\n&lt;p&gt;VIDEO: &lt;a href=\"https://www.youtube.com/watch?v=qGHMyxYSa58\"&gt;https://www.youtube.com/watch?v=qGHMyxYSa58&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;if they are making videos about it, i know this is def not going anywhere and who ever chooses the best chains to invest in will change their life for the better or worse if you only want hookers and cocaine... your choice and youre money&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;So for the love of MONEY,&lt;/strong&gt; just DYOR and Invest&lt;/p&gt;\n\n&lt;p&gt;HODEL&amp;gt; PROFIT&amp;gt; CREATE&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 307,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/CaZiAkPCfkpg4Cet28XCsiYH9jbAV2FpIZwaPYDZ29s.jpg?auto=webp&amp;s=a35f46d132c2d41d76ee666f5a6040899a08e12b",
          "width": 480,
          "height": 360
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/CaZiAkPCfkpg4Cet28XCsiYH9jbAV2FpIZwaPYDZ29s.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=3824b1d88c9ad740579e22f8b09bac859e914f4d",
            "width": 108,
            "height": 81
          },
          {
            "url": "https://external-preview.redd.it/CaZiAkPCfkpg4Cet28XCsiYH9jbAV2FpIZwaPYDZ29s.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=995eb414dac7a2be458760dd85262b985be47a17",
            "width": 216,
            "height": 162
          },
          {
            "url": "https://external-preview.redd.it/CaZiAkPCfkpg4Cet28XCsiYH9jbAV2FpIZwaPYDZ29s.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=0254fbd62f6b8b535ae661cbcc6245cde3bfa960",
            "width": 320,
            "height": 240
          }
        ],
        "variants": {},
        "id": "1ZI1J9nnmrbKbXhuFaE3TgqryrDyvPcbktezR9sSAA4"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/rw3vsz/dont_be_like_your_parents_invest_now_so_your_kids/",
  "subreddit": "CryptoCurrency",
  "id": "rw3vsz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've been in crypto for a while and no im not rich yet. but what i been noticing\nbesides the price flux lol, is the amount of people that is getting into crypto\nas a whole. if its not investing its NFT games, or using it to buy something at\na discount at somewhere like the Dallas Mavericks stadium,…"
}