{
  "author": "rdpGuy",
  "original_created_utc": 1646478224,
  "title": "Do girls also lose interest in sex right after an orgasm as guys do?",
  "created_utc": 1646486978,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Most guys would agree that sex instantly becomes the least interesting thing in the world right after ejaculation. I wonder if girls ever experience this to the same extent. I&amp;#39;ve heard that girls also have the refractory period but since many of them can have multiple orgasms it looks like they&amp;#39;re not as hard-wired to lose interest in sex after an orgasm, at least not as instantly and abruptly as we do. I wonder if there&amp;#39;s a woman who have experienced this exact abrupt and instant loss of libido after an orgasm.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 159,
  "permalink": "/r/TooAfraidToAsk/comments/t777fw/do_girls_also_lose_interest_in_sex_right_after_an/",
  "subreddit": "TooAfraidToAsk",
  "id": "t777fw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Most guys would agree that sex instantly becomes the least interesting thing in\nthe world right after ejaculation. I wonder if girls ever experience this to the\nsame extent. I've heard that girls also have the refractory period but since\nmany of them can have multiple orgasms it looks like they're…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ほとんどの男は、セックスが瞬時に最も興味のないものになることに同意するだろう。\n射精直後の世界。女の子はこのような経験をしたことがあるのだろうか。\n同じ程度です。女の子にも不応期があると聞いたことがあります。\n何度もオーガズムを感じることができる人が多いようですが、それは......。",
      "title": "女の子も男の人と同じようにオーガズムの直後はセックスに興味がなくなるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大多数人都会同意，在射精后，性爱会立即成为世界上最无趣的事情。\n在射精后，性生活立即变成了世界上最无趣的事情。我不知道女孩们是否也有这样的经历\n同样的程度。我听说女孩也有难言之隐，但由于她们中的许多人可以有多次高潮，所以看起来她们也有。\n但由于她们中的许多人可以有多次高潮，看起来她们...",
      "title": "女生也会像男生一样在高潮过后马上失去对性的兴趣吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大多數人都會同意，在射精後，性愛會立即成爲世界上最無趣的事情。\n在射精後，性生活立即變成了世界上最無趣的事情。我不知道女孩們是否也有這樣的經歷\n同樣的程度。我聽說女孩也有難言之隱，但由於她們中的許多人可以有多次高潮，所以看起來她們也有。\n但由於她們中的許多人可以有多次高潮，看起來她們...",
      "title": "女生也會像男生一樣在高潮過後馬上失去對性的興趣嗎？"
    }
  ]
}