{
  "author": "A_Shitty_Username_",
  "the_new_excerpt": "India didn't even have nukes at that time, they were more towards the side of\nthe USSR during the cold war and Portugal who was in NATO was attacked by India,\nyet there wasn't a response from NATO. I am aware the USA wanted European\ncountries to decolonize and Goa was a colony but India who was an…",
  "original_created_utc": 1620658124,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "当時、インドは核を持っていませんでしたし、冷戦時代はソ連側にいました。\nNATOに加盟していたポルトガルがインドに攻撃されました。\nNATOに加盟していたポルトガルがインドに攻撃されましたが、NATOからは何の反応もありませんでした。アメリカがヨーロッパ諸国に脱植民地化を求めていたことは知っています。\nアメリカはヨーロッパ諸国の脱植民地化を望んでいて、ゴアは植民地でしたが、インドは...",
      "title": "1961年、当時ポルトガルの植民地であったゴアがインドに攻撃されました。このときポルトガルはNATOに加盟していましたが、アメリカやNATOはポルトガルを助けず、インドにも侵攻しませんでした。これはなぜでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "印度当时甚至没有核弹，他们在冷战期间更倾向于站在苏联一边。\n在冷战期间，他们更多的是站在苏联一边，而作为北约成员国的葡萄牙却被印度袭击了。\n但北约并没有作出反应。我知道美国希望欧洲\n我知道美国希望欧洲国家实现非殖民化，果阿是一个殖民地，但印度是一个殖民地。",
      "title": "1961年，当时葡萄牙的殖民地果阿被印度袭击，事发时葡萄牙是北约成员，但美国和北约却没有帮助葡萄牙或入侵印度，这是为什么，全球对此的反应是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "印度當時甚至沒有核彈，他們在冷戰期間更傾向於站在蘇聯一邊。\n在冷戰期間，他們更多的是站在蘇聯一邊，而作爲北約成員國的葡萄牙卻被印度襲擊了。\n但北約並沒有作出反應。我知道美國希望歐洲\n我知道美國希望歐洲國家實現非殖民化，果阿是一個殖民地，但印度是一個殖民地。",
      "title": "1961年，當時葡萄牙的殖民地果阿被印度襲擊，事發時葡萄牙是北約成員，但美國和北約卻沒有幫助葡萄牙或入侵印度，這是爲什麼，全球對此的反應是什麼？"
    }
  ],
  "title": "In 1961, Goa, a colony of Portugal at the time was attacked by India, Portugal was a member of NATO when this happened, yet the USA and NATO didn't help Portugal or invade India, why is this and what was the global reaction to this?",
  "created_utc": 1620667994,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>India didn&#39;t even have nukes at that time, they were more towards the side of the USSR during the cold war and Portugal who was in NATO was attacked by India, yet there wasn&#39;t a response from NATO. I am aware the USA wanted European countries to decolonize and Goa was a colony but India who was an ally of the USSR was the one who would annex it. And as far as i am aware the reason the USA and USSR wanted the Europeans to decolonize was so they could have more influence in newly independent countries. Goa wouldn&#39;t even be a new country for the USA to ally with, the USA had a habit of launching coups in countries that weren&#39;t behaving in their interest. Am i missing something? So why didn&#39;t the USA and the rest of NATO help the Portuguese? And what was the public reaction of the people in the USA, Portugal, the USSR and India? Thanks</p>\n</div><!-- SC_ON -->",
  "score": 174,
  "permalink": "/r/AskHistorians/comments/n96n2b/in_1961_goa_a_colony_of_portugal_at_the_time_was/",
  "subreddit": "AskHistorians",
  "id": "n96n2b",
  "is_self": true,
  "media": null,
  "is_video": false
}