{
  "author": "Cato_the_Cognizant",
  "original_created_utc": 1632249303,
  "title": "If a Roman soldier from the 2nd century were to awake one morning and suddenly find himself serving during the reign of Diocletian or Constantine, what major differences would he immediately notice?Which aspects of his military service would change the most?",
  "created_utc": 1632273272,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Beyond differences in equipment, would he still recognize the basic practices, tactics, and structure of the army? Or would it mostly all seem new to him? </p>\n\n<p>From his perspective, would the overall training and discipline of the army appeared to have changed much, and if so, to what extent?</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/psoxq7/if_a_roman_soldier_from_the_2nd_century_were_to/",
  "subreddit": "AskHistorians",
  "id": "psoxq7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Beyond differences in equipment, would he still recognize the basic practices,\ntactics, and structure of the army? Or would it mostly all seem new to him?\n\nFrom his perspective, would the overall training and discipline of the army\nappeared to have changed much, and if so, to what extent?",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "装備の違いを超えて、彼は基本的な慣習や戦術、構造を理解しているだろうか。\n軍隊の基本的な慣習、戦術、構造を理解しているでしょうか？それとも、ほとんどすべてが初めての経験になるのでしょうか？\n\n彼の視点から見ると、軍隊の全体的な訓練と規律は変化しているだろうか？\n彼の視点から見ると、軍隊の全体的な訓練と規律は大きく変わったと思われるだろうか。",
      "title": "もし、2世紀のローマの兵士が、朝起きたら突然、ディオクレティアヌスやコンスタンティヌスの時代に仕えていたとしたら、どのような大きな違いにすぐに気づくでしょうか。また、軍務のどのような点が最も変わるでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "除了装备上的差异，他是否还能认出军队的基本做法、战术和结构？\n战术和军队的结构？还是对他来说，这一切都显得很新鲜？\n\n从他的角度来看，军队的整体训练和纪律是否会\n似乎发生了很大变化，如果是这样，变化程度如何？",
      "title": "如果一个二世纪的罗马士兵某天早上醒来，突然发现自己在戴克里先或君士坦丁统治时期服役，他会立即注意到哪些主要的不同？他的军事服务的哪些方面会发生最大的变化？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "除了裝備上的差異，他是否還能認出軍隊的基本做法、戰術和結構？\n戰術和軍隊的結構？還是對他來說，這一切都顯得很新鮮？\n\n從他的角度來看，軍隊的整體訓練和紀律是否會\n似乎發生了很大變化，如果是這樣，變化程度如何？",
      "title": "如果一個二世紀的羅馬士兵某天早上醒來，突然發現自己在戴克裏先或君士坦丁統治時期服役，他會立即注意到哪些主要的不同？他的軍事服務的哪些方面會發生最大的變化？"
    }
  ]
}