{
  "author": "EatYourMeats",
  "the_new_excerpt": "Are you making stock purchases based on opinions from analysts, CNBC, stock\npickers, and everything in between?\n\nConsider this: They make money off headlines.\n\nThe entire flock is preying on news-worthy quips like vultures on a corpse. Tom\nLee at Fundstrat would be bullish during the apocalypse,…",
  "original_created_utc": 1619155271,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アナリストやCNBC、ストックピッカーなどの意見を鵜呑みにして株を買っていませんか？\nアナリスト、CNBC、ストックピッカー、その他あらゆる人の意見を参考にしていませんか？\n\n考えてみてください。彼らはヘッドラインで稼いでいるのです。\n\n彼らは、死体を狙うハゲタカのように、ニュースになるような言葉を捕らえているのです。トム\nファンドストラット社のリー氏は、黙示録の中では強気になるだろうと...",
      "title": "普通の男からのアドバイスで、うまくいけばもっとお金を稼げるようになる...。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你是否根据分析师、CNBC、选股者的意见来购买股票？\n挑选者，以及两者之间的一切？\n\n考虑一下这个问题。他们靠头条新闻赚钱。\n\n整群人都在捕食有新闻价值的调侃，就像秃鹰捕食尸体一样。汤姆\nFundstrat的李会在世界末日期间看涨，...",
      "title": "一个普通人的一些建议，希望能让你赚更多的钱......"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你是否根據分析師、CNBC、選股者的意見來購買股票？\n挑選者，以及兩者之間的一切？\n\n考慮一下這個問題。他們靠頭條新聞賺錢。\n\n整羣人都在捕食有新聞價值的調侃，就像禿鷹捕食屍體一樣。湯姆\nFundstrat的李會在世界末日期間看漲，...",
      "title": "一個普通人的一些建議，希望能讓你賺更多的錢......"
    }
  ],
  "title": "Some advice from a regular dude that will hopefully make you more money...",
  "created_utc": 1619160366,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Are you making stock purchases based on opinions from analysts, CNBC, stock pickers, and everything in between?</p>\n\n<p><em>Consider this: They make money off headlines.</em></p>\n\n<p>The entire flock is preying on news-worthy quips like vultures on a corpse. Tom Lee at Fundstrat would be bullish during the apocalypse, Gordon won&#39;t ever raise his price target, Cramer cuts coke deals with the CEOs he&#39;s in love with, and the whole bunch likes to hear themselves talk (like giving stock advice rapid fire).</p>\n\n<p>So how do you truly figure out <strong>what stocks are hot... or not?</strong></p>\n\n<p><em>Research the macro situation surrounding the company, to name a few:</em></p>\n\n<ul>\n<li>Sector Tailwinds</li>\n<li>Economics</li>\n<li>Current and projected financials</li>\n<li>Leadership</li>\n</ul>\n\n<p>Then invest in companies:</p>\n\n<ul>\n<li><em>you believe in—hopefully, not always—with healthy balance sheets vs. their competitors.</em></li>\n<li><em>Whose products and services ticket you.</em></li>\n<li>You <em>could sell to your neighbor.</em></li>\n</ul>\n\n<p>Determine <strong>the investment thesis</strong>—the key reasons you believe in this investment—and create a narrative. Positive and negative. Know the outcomes of both scenarios, write them down, and evaluate the risk.</p>\n\n<p>Then? Jump blindly.</p>\n\n<p><em>kidding</em></p>\n\n<p>Adjust based on your preferences, but starting positions with a 1/4th to 1/2 of your total allocation works well. You can do some quick math and figure out what portfolio percentage you want to allocate to a new position. <strong>Ease into it, slow and steady.</strong></p>\n\n<p>Buy the dips with the remainder, and don&#39;t chase stocks upwards, only down (within reason). And don&#39;t listen to anyone who tells you that &quot;diversifying&quot; is the only way, when you put in the work, you know <strong>which sectors have favorable tailwinds AND are fairly valued</strong>.</p>\n\n<p>There&#39;s news everywhere out there, and we crave its presence—telling us something about stocks or companies we don&#39;t know. However, most of it is fluff—buy this, sell that—how would you ever know if you don&#39;t dig the hole yourself?</p>\n</div><!-- SC_ON -->",
  "score": 1979,
  "permalink": "/r/investing/comments/mwo3ha/some_advice_from_a_regular_dude_that_will/",
  "subreddit": "investing",
  "id": "mwo3ha",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776214679
}