{
  "author": "NerdyOldMan",
  "the_new_excerpt": "I think I just set a new high watermark for how much of a clueless middle aged\nwhite guy I truly am.\n\nI've been researching the idea of putting some assets into Cryptocurrency as a\nhedge against what I think will be an upcoming market correction (my\nunverifyable \"gut\" is telling me a 40%-50%…",
  "original_created_utc": 1613587621,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我想我刚刚设定了一个新的高水位，对于一个无能的中年人来说，是多么的无能啊\n小白我真的是。\n\n我一直在研究把一些资产投入到Cryptocurrency中作为\n对冲我认为即将到来的市场调整（我的）。\n无法证实的 \"直觉 \"告诉我，40% -50%... ...",
      "title": "一个中年男人研究加密货币的快乐意外。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想我剛剛設定了一個新的高水位，對於一個無能的中年人來說，是多麼的無能啊\n小白我真的是。\n\n我一直在研究把一些資產投入到Cryptocurrency中作爲\n對沖我認爲即將到來的市場調整（我的）。\n無法證實的 \"直覺 \"告訴我，40% -50%... ...",
      "title": "一箇中年男人研究加密貨幣的快樂意外。"
    }
  ],
  "title": "The Happy Accident of a Middle Aged Guy researching Cryptocurrency.",
  "created_utc": 1613655284,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I think I just set a new high watermark for how much of a clueless middle aged white guy I truly am.  </p>\n\n<p>I&#39;ve been researching the idea of putting some assets into Cryptocurrency as a hedge against what I think will be an upcoming market correction (my unverifyable &quot;gut&quot; is telling me a 40%-50% correction before the end of this year) and I have been seeing some very compelling discussions about crypto being a virtual version of other &quot;hard assets&quot;. (i.e. it&#39;s the millennial version of &quot;gold bugs&quot;)  </p>\n\n<p>So I look around and see articles saying that for the true completely inexperience novice (me in a nutshell) Coinbase is a good starting point, but with slightly higher fees. So I go to coinbase to take a look, figure I will create an account and look around. I click on log in and... wait... lastpass filled in an account name.  </p>\n\n<p>Turns out I have a coinbase account already...  </p>\n\n<p>Turns out I did experiment in the past (3/19)..  </p>\n\n<p>Turns out I bought $150 in BTC then... (thinking back I think it was the proceeds from a decent Poker night with some friends, which I had completely forgotten about)  </p>\n\n<p>Turns out I have around $2k in crypto already.  </p>\n\n<p>I&#39;m an old.... who just found $2000 in the virtual couch cushions of the interwebs.</p>\n</div><!-- SC_ON -->",
  "score": 162,
  "permalink": "/r/Bitcoin/comments/lm1k19/the_happy_accident_of_a_middle_aged_guy/",
  "subreddit": "Bitcoin",
  "id": "lm1k19",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332870748
}