{
  "author": "mike8787",
  "original_created_utc": 1632010964,
  "title": "In \"The Parent Trap\" (1961), the plot hinges on the two parents amicably divorcing about 14 years prior. Yet, no-fault divorce would not exist for almost a decade. Did couples amicably divorce at this time? And, would this plot point have been scandalous to moviegoers at the time?",
  "created_utc": 1632021103,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have recently rewatched the original Parent Trap, which was made in 1961 by Walt Disney. The premise of the film is that two twins are separated by their parents shortly after their birth, due to divorce, with one daughter raised by each parent in isolation; they discover one another 14 years later. That puts the timing of the parents&#39; divorce at around 1947 or 1948.</p>\n\n<p>It is my understanding that no-fault divorce did not exist in the United States until 1969. Until then (and, when this movie was released), all divorce was fault-based -- adultery, insanity, abandonment, neglect/cruelty, etc. In the film, we don&#39;t get a hint any such thing occurred, just that both parents fell out of love and divorced (the mother simply says they &quot;just [didn&#39;t] get on together.&quot;)</p>\n\n<p>Was it reasonable to expect that couples would have been able to divorce without cause at this time (or, perhaps, that they lied)? I&#39;ve heard stories of couples feigning adultery to justify a divorce, though that is from TV and films. Would a couple divorcing in 1948 or so have had to produce evidence of the grounds of divorce--meaning the couple in Parent Trap would&#39;ve either had to have real grounds to divorce, or fabricated them?</p>\n\n<p>Separately, did moviegoers at the time reacted negatively to this plot because it was based on divorce? And, would moviegoers have accepted the idea that the divorce was amicable, or felt it implied they lied to get a fault-based divorce? This seems like a potentially controversial topic for Disney, and I&#39;m curious if they got any flack for a movie about divorce from conservative viewers.</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/pqxqib/in_the_parent_trap_1961_the_plot_hinges_on_the/",
  "subreddit": "AskHistorians",
  "id": "pqxqib",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I have recently rewatched the original Parent Trap, which was made in 1961 by\nWalt Disney. The premise of the film is that two twins are separated by their\nparents shortly after their birth, due to divorce, with one daughter raised by\neach parent in isolation; they discover one another 14 years…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、1961年にウォルト・ディズニーが製作したオリジナルの「ペアレント・トラップ」を再見しました。\nウォルト・ディズニーが1961年に作ったものです。この映画の設定は、双子の娘が生まれてすぐに離婚して両親に引き離され、一人の娘は両親に育てられるというものです。\n双子の双子が生まれてすぐに離婚して両親に引き離され、一人の娘がそれぞれの両親に育てられているというものです。\nそして、14年後にお互いを発見します。",
      "title": "親の罠」（1961年）では、約14年前に両親が円満に離婚していることが筋書きになっています。しかし、無過失離婚が成立するのは約10年後のことである。この時代、夫婦は円満に離婚していたのだろうか？また、このプロットは当時の映画ファンにとってスキャンダラスなものだったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近重新观看了原版的《父母的陷阱》，该片是1961年由\n华特-迪斯尼制作的。这部电影的前提是，两对双胞胎在出生后不久就被父母分开了。\n在他们出生后不久，由于离婚，他们的父母就分开了，其中一个女儿由父母各自抚养。\n他们在14年后发现了彼此......",
      "title": "在《父母的陷阱》（The Parent Trap）（1961年）中，剧情的关键是父母双方在14年前友好地离婚了。然而，无过错离婚在近十年内都不会存在。这时的夫妻是否友好地离婚？而且，这个情节对当时的电影观众来说会不会是丑闻？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近重新觀看了原版的《父母的陷阱》，該片是1961年由\n華特-迪斯尼製作的。這部電影的前提是，兩對雙胞胎在出生後不久就被父母分開了。\n在他們出生後不久，由於離婚，他們的父母就分開了，其中一個女兒由父母各自撫養。\n他們在14年後發現了彼此......",
      "title": "在《父母的陷阱》（The Parent Trap）（1961年）中，劇情的關鍵是父母雙方在14年前友好地離婚了。然而，無過錯離婚在近十年內都不會存在。這時的夫妻是否友好地離婚？而且，這個情節對當時的電影觀衆來說會不會是醜聞？"
    }
  ]
}