{
  "author": "CountSnort",
  "original_created_utc": 1658775284,
  "title": "What is the smartest anti crypto argument you've ever heard?",
  "created_utc": 1658811422,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Since crypto winter is here and I&amp;#39;m still waiting for quality post I figured why not uno-reverse a question from today?&lt;/p&gt;\n\n&lt;p&gt;I have been told that one thing you should always do in investing, is to look for reasons not to invest in something. &lt;/p&gt;\n\n&lt;p&gt;The best argument for me is that it is too complicated for mass adoption. One mistake and your coins/tokens are gone. I know that&amp;#39;s no issue for a lot of people, but it is an issue for mass adoption imo.&lt;/p&gt;\n\n&lt;p&gt;Since I&amp;#39;m an idiot and can&amp;#39;t come up with something better, I ask you, what might be the best argument against crypto?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 346,
  "permalink": "/r/CryptoCurrency/comments/w7x06g/what_is_the_smartest_anti_crypto_argument_youve/",
  "subreddit": "CryptoCurrency",
  "id": "w7x06g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Since crypto winter is here and I'm still waiting for quality post I figured why\nnot uno-reverse a question from today?\n\nI have been told that one thing you should always do in investing, is to look\nfor reasons not to invest in something.\n\nThe best argument for me is that it is too complicated for…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号の冬が来て、私はまだ品質のポストを待っているので、私はなぜ考え出した。\n今日から質問を取り消すことはできませんか？\n\n私は、あなたが投資で常に行うべきことの一つは、投資しない理由を探すことであると言われています。\n何かに投資しない理由を探しています。\n\n私のための最高の引数は、それがためにあまりにも複雑であるということです...",
      "title": "今まで聞いた中で最も賢い反暗号論は何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "由于加密货币的冬天已经到来，我仍然在等待高质量的帖子，我想为什么\n为什么不把今天的一个问题解开呢？\n\n有人告诉我，在投资中，有一件事你应该一直做，就是寻找\n找出不投资的理由。\n\n对我来说，最好的理由是它太复杂了。",
      "title": "你听过的最聪明的反加密货币论点是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "由於加密貨幣的冬天已經到來，我仍然在等待高質量的帖子，我想爲什麼\n爲什麼不把今天的一個問題解開呢？\n\n有人告訴我，在投資中，有一件事你應該一直做，就是尋找\n找出不投資的理由。\n\n對我來說，最好的理由是它太複雜了。",
      "title": "你聽過的最聰明的反加密貨幣論點是什麼？"
    }
  ]
}