{
  "author": "seebz69",
  "the_new_excerpt": "From Wrigley Chewing Gum to Gummies\n\nYesterday, Chewing gum heir William “Beau” Wrigley Jr., the CEO of Atlanta-based\nParallel, struck a mammoth deal\n[https://www.newcannabisventures.com/wrigley-led-cannabis-mso-parallel-to-go-public-via-spac-valued-at-1-9-billion/]\nwith an entertainment mogul to…",
  "original_created_utc": 1614134963,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "从箭牌口香糖到口香糖\n\n昨天，口香糖继承人威廉-\"博\"-小箭牌，亚特兰大的首席执行官。\n平行，达成了一个庞大的交易。\n[https://www.newcannabisventures.com/wrigley-led-cannabis-mso-parallel-to-go-public-via-spac-valued-at-1-9-billion/]\n与娱乐大亨一起...",
      "title": "从箭牌口香糖->口香糖（平行线通过19亿美元交易上市）。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "從箭牌口香糖到口香糖\n\n昨天，口香糖繼承人威廉-\"博\"-小箭牌，亞特蘭大的首席執行官。\n平行，達成了一個龐大的交易。\n[https://www.newcannabisventures.com/wrigley-led-cannabis-mso-parallel-to-go-public-via-spac-valued-at-1-9-billion/]\n與娛樂大亨一起...",
      "title": "從箭牌口香糖->口香糖（平行線通過19億美元交易上市）。"
    }
  ],
  "title": "From Wrigley Chewing Gum —> Gummies (Parallel goes public via $1.9 billion deal)",
  "created_utc": 1614147965,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>From Wrigley Chewing Gum to Gummies</strong></p>\n\n<p>Yesterday, Chewing gum heir William “Beau” Wrigley Jr., the CEO of Atlanta-based Parallel, struck a mammoth <a href=\"https://www.newcannabisventures.com/wrigley-led-cannabis-mso-parallel-to-go-public-via-spac-valued-at-1-9-billion/\">deal</a> with an entertainment mogul to take the cannabis multistate operator public through a transaction that values the company at $1.9 billion.</p>\n\n<blockquote>\n<p>Transaction values Parallel at an implied enterprise value of US$1.884 billion</p>\n\n<p>Investors commit to an over-subscribed US$225 million private placement at closing; combined public company expected to have US$430 million cash balance at closing</p>\n</blockquote>\n\n<p><em>&quot;We believe Parallel is ideally positioned for its next phase of growth, as we continue to build our presence in strategic markets and invest in innovation, R&amp;D and the customer experience. Today&#39;s milestone announcement is a testament to Parallel&#39;s impressive growth to date, the strength of our business fundamentals, strong balance sheet, and above all, our unwavering commitment to further developing and enhancing our portfolio of cannabinoid products.”</em></p>\n\n<p><em>This transaction will enable Parallel to accelerate existing investments to transform not only our company but also the cannabis industry, as we seek to disrupt the more traditional beverage alcohol and healthcare spaces. We look forward to working with the Ceres team and benefiting from Scooter Braun&#39;s expertise and extensive influencer network to reach our diverse consumers with creative omnichannel approaches that will fuel Parallel&#39;s leadership in the cannabis industry.</em></p>\n\n<p><a href=\"http://www.ceresacquisition.com/\">Ceres Acquisition Corp</a> ($CERAF)</p>\n\n<p>a special purpose acquisition company (SPAC) co-founded by Scott “Scooter” Braun – will buy Parallel, allowing the new company to go public by taking on Ceres’ listing on Canada’s NEO Exchange.</p>\n\n<blockquote>\n<p>A group of investors, led by existing Ceres and Parallel investors, have committed to the deal through an oversubscribed private investment in public equity (PIPE) of $225 million at a price of $10 per share at closing, according to a news release.</p>\n</blockquote>\n\n<p>Other investors include institutions and private family offices in the United States and Canada.</p>\n\n<p>Ceres&#39; deep cannabis and consumer experience, coupled with Scooter&#39;s powerful network, makes Ceres an ideal partner for a well-positioned, well-led, high growth cannabis company like Parallel.</p>\n\n<p><a href=\"https://www.liveparallel.com/\">Parallel</a></p>\n\n<p>Parallel is the latest large marijuana business to go public. Parallel changed its corporate name from Surterra Wellness in 2019 but still uses the Surterra brand in Florida and Texas.</p>\n\n<p>Wrigley will continue to serve as Parallel’s chair and CEO, while Braun – who has managed notable acts such as Justin Bieber and Ariana Grande – will serve as a special advisor.</p>\n\n<blockquote>\n<p>The deal is expected to close this summer.</p>\n</blockquote>\n\n<p>It must be approved by shareholders of both companies, U.S. and Canadian regulators as well as the NEO Exchange and over-the-counter markets, where Ceres currently trades as CERE and CERAF, respectively.</p>\n\n<p>Parallel has 42 dispensaries in five states –-Florida, Pennsylvania, Massachusetts, Nevada and Texas – and forecasts $447 million in 2021 net revenue, according to the release.</p>\n\n<p>Parallel also announced that it intends to enter into a partnership with <a href=\"https://cookies.co/\">Cookies</a>, a cannabis company from California’s Bay Area that has established itself as a recognizable flower brand in several states.</p>\n\n<p>The release said the collaboration – subject to the approval of the Nevada Cannabis Compliance Board – will strengthen Parallel’s presence in Las Vegas.</p>\n\n<blockquote>\n<p>“As a public company, we will have access to capital to grow our national footprint through new licenses and M&amp;A, improve our cultivation and production capacity, expand our established retail footprint, develop and launch rare cannabinoids products with therapeutic benefits, and conduct important clinical research in partnership with the University of Pittsburgh School of Medicine.”</p>\n</blockquote>\n\n<p><strong>Management</strong></p>\n\n<ul>\n<li><p>Marina Bozilenko, </p>\n\n<blockquote>\n<p>who has over 30 years of investment banking and other healthcare industry expertise and currently serves as Strategic Advisor to William Blair and Company, where she previously served as Managing</p>\n</blockquote></li>\n<li><p>Kevin Douglas, <em>Director and Head of Biotech &amp; Pharma;</em> </p>\n\n<blockquote>\n<p>M.D., a biopharmaceutical professional with over 15 years of U.S. and international industry experience, who currently serves as Medical Director of U.S. Rheumatology and Study Designated Physician/Therapeutic Medical Director at Abbvie, Inc.;\nSarah Hassan, who was a founding partner of IM HealthScience and acting CFO through the sale of the company to Nestlé HealthScience in 2020</p>\n</blockquote></li>\n<li><p>Linda McGoldrick, <em>venture capital partner &amp; fund manager;</em></p>\n\n<blockquote>\n<p>a global business strategy leader and policy expert in healthcare, who has spent her entire 30-year career working in senior executive and advisory roles, including as CEO and independent board member of numerous healthcare and life sciences companies;</p>\n</blockquote></li>\n<li><p>Joe Crouthers, <em>Chairman and CEO of Ceres Acquisition Corp.</em></p>\n\n<blockquote>\n<p>a seasoned cannabis investor and entrepreneur who previously worked as a commodities trader and portfolio manager at Goldman Sachs; and</p>\n</blockquote></li>\n<li><p>Phil Harris, <em>current General Counsel at Parallel</em></p>\n\n<blockquote>\n<p>has experience as a partner across several Chicago based global law firms, where he served as a practice leader and on the management and diversity committees.</p>\n</blockquote></li>\n</ul>\n\n<p><a href=\"https://www.prnewswire.com/news-releases/parallel-and-ceres-acquisition-corp-announce-business-combination-to-create-a-publicly-traded-us-cannabis-well-being-company-301232236.html\">https://www.prnewswire.com/news-releases/parallel-and-ceres-acquisition-corp-announce-business-combination-to-create-a-publicly-traded-us-cannabis-well-being-company-301232236.html</a></p>\n\n<p><a href=\"https://mjbizdaily.com/wrigley-chewing-gum-heir-to-take-cannabis-mso-parallel-public-via-1-9-billion-deal/amp/\">https://mjbizdaily.com/wrigley-chewing-gum-heir-to-take-cannabis-mso-parallel-public-via-1-9-billion-deal/amp/</a></p>\n\n<p><em>I am not a financial advisor, so please do your own DD</em></p>\n</div><!-- SC_ON -->",
  "score": 166,
  "permalink": "/r/investing/comments/lr1raa/from_wrigley_chewing_gum_gummies_parallel_goes/",
  "subreddit": "investing",
  "id": "lr1raa",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332883605
}