{
  "author": "AlbibiG",
  "the_new_excerpt": "Introduction\n\n“Vuzix [https://en.wikipedia.org/wiki/Vuzix] is an American multinational\ntechnology firm headquartered in Rochester, New York. Founded in 1997 by Paul\nTravers, Vuzix is a supplier of wearable display technology, virtual reality and\naugmented reality. Vuzix manufactures and sells…",
  "original_created_utc": 1616194819,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "介紹\n\n\"Vuzix\"[https://en.wikipedia.org/wiki/Vuzix]是美国一家跨国企业。\n技术公司，总部设在纽约州的罗切斯特。1997年由Paul\nTravers，Vuzix是一家可穿戴显示技术、虚拟现实和的供应商。\n增强现实。Vuzix制造和销售...",
      "title": "Vuzix ($VUZI) DD"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "介紹\n\n\"Vuzix\"[https://en.wikipedia.org/wiki/Vuzix]是美國一家跨國企業。\n技術公司，總部設在紐約州的羅切斯特。1997年由Paul\nTravers，Vuzix是一家可穿戴顯示技術、虛擬現實和的供應商。\n增強現實。Vuzix製造和銷售...",
      "title": "Vuzix ($VUZI) DD"
    }
  ],
  "title": "Vuzix ($VUZI) DD",
  "created_utc": 1616243642,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Introduction</strong></p>\n\n<p>“<a href=\"https://en.wikipedia.org/wiki/Vuzix\">Vuzix</a> is an American multinational technology firm headquartered in Rochester, New York. Founded in 1997 by Paul Travers, Vuzix is a supplier of wearable display technology, virtual reality and augmented reality. Vuzix manufactures and sells computer display devices and software. Vuzix personal display devices are used for mobile and immersive augmented reality applications, such as 3D gaming, manufacturing training, and military tactical equipment. On January 5, 2015, Intel acquired 30% of Vuzix&#39;s stock for $24.8 million [but has recently sold their stake as of January 2021].” </p>\n\n<p><strong>Product</strong></p>\n\n<p><a href=\"https://www.vuzix.com/products/blade-smart-glasses-upgraded\">Vuzix Blade Upgraded Smart Glasses-</a></p>\n\n<p>These ANSI Z87.1 certified glasses come in two variants, prescription and non-prescription, for use in manufacturing, construction, and any other scenario where safety glasses are required.</p>\n\n<p>Starting at $800, these glasses have an autofocusing HD camera, stereo speakers in the temples, noise cancelling microphone, color display on the right eye, wifi and bluetooth connectivity, microSD expansion, a touchpad, English and Japanese support, micro USB connection, and full UV protection and safety certification.</p>\n\n<p>The prescription allows the wearer to not have to rely on contact lenses. All that is needed is your pupillary distance, sphere and cylinder of your eyes, and a copy of a valid prescription with a physician’s information. </p>\n\n<p>M-Series-</p>\n\n<p>There are currently three M-Series glasses: M4000, M400, and M300XL. The M-Series is primarily used in warehouse logistics, tele-medicine, manufacturing, and field service.</p>\n\n<p>The <a href=\"https://www.vuzix.com/products/m400-smart-glasses\">M400</a> starts at $1,800. These have a full color OLED display, flashlight, 64GB internal storage, wifi and bluetooth, GPS, camera capable of taking 12.8MP photos, 4K30 video, barcode scanning, USB C connection, three noise-cancelling microphones, IP67 rating, drop tested up to 2 meters, and supports six languages, along with support to be mounted on hard hats, headbands, headphones, and safety glasses.</p>\n\n<p>The <a href=\"https://www.vuzix.com/products/m4000-smart-glasses\">M4000</a> is the successor to the M400 and carries many of the same features, except uses a DLP display instead of OLED, integrated speakers, drop tested up to 1 meter, and Waveguide optics (which allow for viewing past the “screen”). These start at $2,500.</p>\n\n<p>The <a href=\"https://www.vuzix.com/products/m300xl-smart-glasses\">M300XL</a> starts at only $800 (originally priced at almost $1,100) and are the entry-level smart glasses to the M-Series lineup. It has standard USB connections, a 10MP camera, 1080p24 video, LED display, wifi and bluetooth, speaker, dual noise-cancelling microphones, flashlight, and six languages. </p>\n\n<p><a href=\"https://www.vuzix.com/products/smart-swim\">Vuzix Labs Smart Swim-</a></p>\n\n<p>Starting at only $200, Smart Swim is a HUD for swimmers that provides workout status and information for indoor swimming or open water. They have GPS capabilities, bluetooth, wifi, full-color display, 9 motion sensors, and micro-B USB connection.</p>\n\n<p><a href=\"https://ir.vuzix.com/sec-filings/all-sec-filings##document-24822-0001558370-21-003001-1\">Other AR-</a></p>\n\n<p>According to the company’s 10K, they plan to release more AR products by the end of 2021. These new glasses will have increased resolution and FOV, MicroLED displays, and a more powerful computer.</p>\n\n<p><a href=\"https://www.vuzix.com/products/accessories\">Accessories-</a></p>\n\n<p>There are a myriad of accessories from power banks, mounting options, carrying cases, and photo lenses with prices ranging from $10 to $200.</p>\n\n<p><a href=\"https://www.vuzix.com/vuzix-remote\">Services-</a></p>\n\n<p>Vuzix provides a Remote Assist service that allows you to connect to remote experts through the glasses themselves for real time assistance. This is advertised as a way to cut training time and improve fix rates by allowing the user to connect directly to an expert and allows the expert to view exactly what the user is viewing. This service starts at $150 per month for 3 users and scales to $4,000 per month for 200 users. It also includes a 60-day free trial.</p>\n\n<p><a href=\"https://www.vuzix.com/appstore\">Apps-</a></p>\n\n<p>There are apps, both paid and free, on the Vuzix app store. These apps are developed by both Vuzix themselves and third-parties in an attempt to grow the ecosystem.</p>\n\n<p><a href=\"https://ir.vuzix.com/sec-filings/all-sec-filings##document-24822-0001558370-21-003001-1\"><strong>Financials and Growth</strong></a></p>\n\n<p>All numbers rounded to two decimals</p>\n\n<p>Sales- 73.6% increase</p>\n\n<ul>\n<li>2020: $11.58 million</li>\n<li>2019: $6.67 million</li>\n</ul>\n\n<p>Cost of Sales- 12.9% decrease</p>\n\n<ul>\n<li>2020: $9.65 million</li>\n<li>2019: $11.08 million</li>\n</ul>\n\n<p>Gross Profit- </p>\n\n<ul>\n<li>2020: $1.93 million</li>\n<li>2019: -$4.41 million</li>\n</ul>\n\n<p>Operating Expenses- 20.7% decrease</p>\n\n<ul>\n<li>2020: $21.06 million</li>\n<li>2019: $26.57 million</li>\n</ul>\n\n<p>Roughly one-third of operating expenses are attributed to R&amp;D, one-third attributed to General and Administrative, and one-third from Selling and Marketing + Depreciation.</p>\n\n<p>Net Loss- 32.2% decrease</p>\n\n<ul>\n<li>2020: $17.95 million</li>\n<li>2019: $26.48 million</li>\n</ul>\n\n<p>Common Stockholder Loss- 29.6% decrease</p>\n\n<ul>\n<li>2020: $20.01 million</li>\n<li>2019: $28.41 million</li>\n</ul>\n\n<p>EPS- </p>\n\n<ul>\n<li>2020: -$0.53</li>\n<li>2019: -$0.94</li>\n</ul>\n\n<p><strong>Competition</strong></p>\n\n<p>There are competitors in the field of AR glasses, but none come close to the size that Vuzix has as Vuzix is a field leader. Most competitors sell inferior products (either heavier/thicker, provide inadequate support, or use inferior technology). Vuzix is also a market leader in revenue for AR glasses. </p>\n\n<p>This is a very niche environment that few have been able to enter, so Vuzix has a strong grasp on future growth.</p>\n\n<p>More can be read about their competitors on their <a href=\"https://ir.vuzix.com/sec-filings/all-sec-filings##document-24822-0001558370-21-003001-1\">10K</a> beginning at the end of page 9.</p>\n\n<p><a href=\"https://ir.vuzix.com/corporate-governance/board-of-directors\"><strong>Management</strong></a> <strong>and</strong> <a href=\"https://whalewisdom.com/stock/vuzi#listings_table-sticky-header\"><strong>Investors</strong></a></p>\n\n<p>Paul J. Travers, CEO, President, and Director</p>\n\n<p>Original founder of Vuzix in 1997 and has served as a board member starting November of the same year. Prior to Vuzix, Travers founded e-Tek Labs (acquired by Belkin in 1999) and Forte Technologies. 30+ years in consumer electronics and 25 years in VR. He also owns roughly 6.2% of the company and is the largest individual shareholder.</p>\n\n<p>Grant Russell, CFO, Executive Vice President, Treasurer, and Director</p>\n\n<p>Has served as CFO since 2000 and as a member of the board since April 2009. Between 1997 to 2004, Russell developed a software firm, computer store and cyber cafe, which he sold. In 1984, he co-founded Advanced Gravis Computer, which became the largest joystick manufacturer with sales of $44 million worldwide. Gravis was listed on the NASDAQ and Toronto Stock Exchange, then, in 1996, it was acquired by a Fortune 100 company.</p>\n\n<p>Timothy Harned, Director</p>\n\n<p>The newest member of the board having joined in June 2017, Harned has experience in investment banking, corporate development, and financial advisory with 30+ years of experience in mergers and acquisitions. He also has 20+ years of experience in technology fields and 10 years in consumer and industrial companies. Harned’s resume in financials is in-depth with experience at Lehman Brothers, Bank of America, and Morgan Stanley.</p>\n\n<p>State Street Corp owns roughly 4.8 million shares.</p>\n\n<p>Vanguard owns roughly 2 million shares.</p>\n\n<p>Blackrock owns roughly 800,000 shares.</p>\n\n<p><strong>Analysts and Estimates</strong></p>\n\n<p>Vuzi is currently rated a Buy with an average target price of $31.67 (low of $30 and high of $35). An EPS estimate of -$0.27 is given for next year, which would half the current EPS.</p>\n\n<p><a href=\"https://finance.yahoo.com/quote/VUZI/analysis/\">https://finance.yahoo.com/quote/VUZI/analysis/</a></p>\n\n<p><strong>Risks</strong></p>\n\n<p>Although not likely, they can dilute their shares again if needed. They are currently sitting on over $40 million in cash, so they won’t need to, but it is definitely a possibility in the future.</p>\n\n<p>As Vuzix is not a startup and is still cash flow negative by a large margin, they need to improve their scalability and increase profits to be seen as a viable company for future investors.</p>\n\n<p>As Vuzix has not made a profit, rising interest rates could hurt them when they need to take out loans to maintain business (not likely as they have plenty of cash on hand).</p>\n\n<p><strong>Technical Analysis</strong></p>\n\n<p>This is my own analysis, so take with however much salt you like.</p>\n\n<p>Vuzi has been on an explosive uptrend the last few days after having been beaten the past few weeks. They have maintained themselves in the upper BB for quite some time (although it is widening), and their 10 EMA and 20 EMA has held very steadily. The MACD signal line crossed mid-February signalling a buy and it has maintained a healthy divergence. Their recent price action increase has them slightly overbought, but not necessarily a sell (at least not to me). </p>\n\n<p>Current support and resistance around $29.50, $25, $23.80, $21, and $19 (although will most likely not be maintained). More realistic support and resistance around $26, $22, $21, $19.50, $18, and $15.50.</p>\n\n<p>Another thing I noticed is their volume fluctuation on drastic green days vs drastic red days. Drastic green day volume typically has twice the volume of normal and high red days, but red days have a much steeper price change on lower volume. Not sure what to make of that. Maybe people are holding? Maybe the volume is being diluted across multiple days? Not sure.</p>\n\n<p>My buy range is between $18 and $23 (this does not mean it will reach these prices again, and does not mean it will rebound once it does). My current rating is a hold until (if) it reaches these prices again.</p>\n\n<p><strong>Final Thoughts/TL;DR</strong></p>\n\n<p>Vuzix is a long-term buy for me, but not at the current price. AR glasses are the future, and I believe they are able to establish themselves in this niche sector. Their products, although not revolutionary, are far beyond the competition and provide excellent ROI for the companies that utilize them. Once they&#39;re able to scale up, they will be worth much more than they are now.</p>\n\n<p>I have a current rating of hold until (if) it reaches my buy range of $18-$23 where I plan to buy more. I do believe a pullback from the recent jump is due, but not necessarily guaranteed. I strongly believe in this company and its experienced and well-vested board to increase revenue and push the company into a multi-billion dollar state compared to its current valuation of around $1 billion.</p>\n\n<p>I currently hold 25 shares at $23.50 that I’ve been holding for a month (talk about bad timing) as a means to include it into my portfolio and continuously check the price.</p>\n</div><!-- SC_ON -->",
  "score": 46,
  "permalink": "/r/stocks/comments/m8tkm8/vuzix_vuzi_dd/",
  "subreddit": "stocks",
  "id": "m8tkm8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752821006
}