{
  "author": "OStateDeadHead",
  "original_created_utc": 1635176496,
  "title": "Does the rainfall from once-in-a-lifetime storms help drought conditions?",
  "created_utc": 1635201314,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Yesterday, the bomb cyclone that hit California dropped record rainfall on many locations in the state. My question is whether this record rainfall is as beneficial to overall drought conditions as a year that gets higher than average rainfall over a period of months? Like is this water able to enter the water table or does it just runoff into streams/rivers and eventually the ocean without being usable for consumers?</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/askscience/comments/qfjibo/does_the_rainfall_from_onceinalifetime_storms/",
  "subreddit": "askscience",
  "id": "qfjibo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Yesterday, the bomb cyclone that hit California dropped record rainfall on many\nlocations in the state. My question is whether this record rainfall is as\nbeneficial to overall drought conditions as a year that gets higher than average\nrainfall over a period of months? Like is this water able to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昨日、カリフォルニア州を襲った爆弾サイクロンは、各地で記録的な大雨を降らせました。\n記録的な大雨となりました。疑問なのは、この記録的な降雨が、平均的な降雨量が多い年に比べて\nこの記録的な雨は、平均以上の雨が降った年と同じように、全体の干ばつ状態に有益なのかどうか。\n疑問なのは、この記録的な降雨は、数ヶ月にわたって平均以上の降雨があった年と同じように、全体的な干ばつ状態に有益なのかということです。例えば、この水は...",
      "title": "一生に一度の嵐による降雨は、干ばつ状態を改善するのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "昨天，袭击加州的炸弹气旋在该州许多地方降下了创纪录的降雨量。\n该州的许多地方。我的问题是，这个创纪录的降雨量是否像去年一样\n对整体干旱状况的好处，是否像一年中几个月内获得高于平均水平的\n的降雨量一样有利？比如这些水是否能够...",
      "title": "千载难逢的暴风雨带来的降雨是否有助于干旱状况？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "昨天，襲擊加州的炸彈氣旋在該州許多地方降下了創紀錄的降雨量。\n該州的許多地方。我的問題是，這個創紀錄的降雨量是否像去年一樣\n對整體乾旱狀況的好處，是否像一年中幾個月內獲得高於平均水平的\n的降雨量一樣有利？比如這些水是否能夠...",
      "title": "千載難逢的暴風雨帶來的降雨是否有助於乾旱狀況？"
    }
  ]
}