{
  "author": "WednesdayThrowItAway",
  "original_created_utc": 1658397892,
  "title": "I've got a general question about historiography. How do Historians know when to stop? As in, how do they choose where to define the limits for a particular topic? To my layman mind it seems almost impossible.",
  "created_utc": 1658428571,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a tabletop wargamer and I&amp;#39;ve always had an amateur interest in military history. Recently I&amp;#39;ve started doing some research into The Crusades. Because this is an area I&amp;#39;ve always had a casual interest in, but I&amp;#39;ve really dug into it with any depth.&lt;/p&gt;\n\n&lt;p&gt;I started off gathering some books and documents about the origins of The Crusades. Initially I wanted to learn about the political and religious layout of Europe during the late 11th Century. Obviously the Eastern Roman Empire is a major player in Europe and Christianity as a whole at this time so I decided to look back a bit further to really understand what was going on with the Eastern Empire during these events.&lt;/p&gt;\n\n&lt;p&gt;You can&amp;#39;t really understand what&amp;#39;s going on with Rome at the time without understanding how Rome got to that point, so I guess I need to read up on late antiquity and the fall of the Western Empire to &lt;em&gt;really&lt;/em&gt; understand what caused the Eastern Empire to go in the direction it did. And the history of Christianity is intimately linked with the history of Rome so in order to understand the Crusades as a pivotal moment in Christianity I &lt;em&gt;need&lt;/em&gt; to understand the other pivotal moments in Christianity first.&lt;/p&gt;\n\n&lt;p&gt;Well of course you can&amp;#39;t start a story at the &lt;em&gt;end&lt;/em&gt;. It&amp;#39;s gonna be difficult to understand the world of late antiquity without understanding the history that shaped late antiquity so I guess I need some books that are going to give me an overview of Roman History first so I can &lt;em&gt;truly&lt;/em&gt; understand where the Eastern Roman Empire found itself in the 11th century.&lt;/p&gt;\n\n&lt;p&gt;Right, that&amp;#39;s all good.  I&amp;#39;m about to sit down and start my journey into the history of the First Crusade. The first book I&amp;#39;m going to read is....&lt;em&gt;Plutarch&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;Hmm.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s not to mention that Rome is only one player in the history of The Crusades. The Islamic world and Western European Christendom have centuries of history that positioned them where they were in the 11th century so I guess I need to read into the Carolingians and the Arab Conquests and maybe even the Sassasinids and....you can see where this is going.&lt;/p&gt;\n\n&lt;p&gt;And obviously this applies to &lt;em&gt;every&lt;/em&gt; major historical event. How can you &lt;em&gt;truly&lt;/em&gt; understand the Second World War if you start in 1939? The war &amp;quot;started&amp;quot; in 1939 but it didn&amp;#39;t &lt;em&gt;really&lt;/em&gt; did it? The Sino-Japanese war was raging for years before that and could arguably be considered as the point that hostilities truly broke out, and then the First World War is crucial to understanding the nature of Europe in 1939 but to understand the First World War you really need to look at the formation of Germany as a nation and you can&amp;#39;t truly understand that without going back to Napoleon&amp;#39;s time and even before that!&lt;/p&gt;\n\n&lt;p&gt;Where do you draw the line? History isn&amp;#39;t a sequence of discreet events. It&amp;#39;s a long, interwoven and interconnected tapestry leading back to the origin of man. And each point in time is influenced by and connected to thousands of points in time that each played a part in shaping the fabric of history. &lt;/p&gt;\n\n&lt;p&gt;As historians. When you sit down to write your paper or your book or whatever it is. Where do you place the arbitrary point on the line where you say &amp;quot;this is the start of my topic&amp;quot;? How do you avoid completely getting lost in the rabbit hole?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/w4cu25/ive_got_a_general_question_about_historiography/",
  "subreddit": "AskHistorians",
  "id": "w4cu25",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm a tabletop wargamer and I've always had an amateur interest in military\nhistory. Recently I've started doing some research into The Crusades. Because\nthis is an area I've always had a casual interest in, but I've really dug into\nit with any depth.\n\nI started off gathering some books and…"
}