{
  "author": "Nostalg33k",
  "original_created_utc": 1640695959,
  "title": "The truth is, for a lot of people, leaving their coin on a big CEX is the best solution.",
  "created_utc": 1640713322,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Yo, I know, Cold Wallets provide the most security. &lt;/p&gt;\n\n&lt;p&gt;But for a lot of people, between fees and risk mishandling their crypto addresses, forgetting to do their test transaction and all. Leaving the crypto in CEX is better. &lt;/p&gt;\n\n&lt;p&gt;As long as you use 2FA and you are not in the tens of thousands, I feel like CEX offer the best solution for beginners. I also feel like this is against what crypto is supposed to be but I&amp;#39;m just thinking about convenience right now. &lt;/p&gt;\n\n&lt;p&gt;Even Staking can be scary when you hear about DeFi exploits every other day. &lt;/p&gt;\n\n&lt;p&gt;What is, according to you, the best way to handle your crypto for beginners ??&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 168,
  "permalink": "/r/CryptoCurrency/comments/rqf7nx/the_truth_is_for_a_lot_of_people_leaving_their/",
  "subreddit": "CryptoCurrency",
  "id": "rqf7nx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Yo, I know, Cold Wallets provide the most security.\n\nBut for a lot of people, between fees and risk mishandling their crypto\naddresses, forgetting to do their test transaction and all. Leaving the crypto\nin CEX is better.\n\nAs long as you use 2FA and you are not in the tens of thousands, I feel like…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "よーするに、コールドウォレットは最も安全性が高いということですね。\n\nしかし、多くの人にとって、手数料や暗号を誤操作するリスクの間に\nのアドレス、テストトランザクションのし忘れなど。クリプトを残す\nのCEXの方が良い。\n\n2FAを使って、万単位でない限りは...という感じです。",
      "title": "実は、多くの人にとって、コインを大きなCEXに預けることは最良の解決策なのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "哟，我知道，冷钱包提供了最多的安全性。\n\n但对很多人来说，在费用和风险之间，错误地处理他们的加密货币\n地址，忘记做测试交易等等。将加密货币\n在CEX中是更好的。\n\n只要你使用2FA，而且你不是数以万计的人，我觉得...",
      "title": "事实是，对很多人来说，把他们的硬币留在大的CEX上是最好的解决方案。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "喲，我知道，冷錢包提供了最多的安全性。\n\n但對很多人來說，在費用和風險之間，錯誤地處理他們的加密貨幣\n地址，忘記做測試交易等等。將加密貨幣\n在CEX中是更好的。\n\n只要你使用2FA，而且你不是數以萬計的人，我覺得...",
      "title": "事實是，對很多人來說，把他們的硬幣留在大的CEX上是最好的解決方案。"
    }
  ]
}