{
  "author": "bastard_swine",
  "original_created_utc": 1660325905,
  "title": "Do philosophers ever intentionally obfuscate their own writing in order to protect it from criticism?",
  "created_utc": 1660377926,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll preface this by saying that I know a lot of academic writing isn&amp;#39;t intended for the general populace and so a lot of philosophical dialogue can seem really impenetrable to the average reader, when really it&amp;#39;s just a continual dialogue among philosophers using jargon that they themselves are already clued in on. That being said, I&amp;#39;ve noticed in reading the biographies of some prominent philosophers that it&amp;#39;s not uncommon to find them remarking that nobody ever really understood what they were trying to say. Off the top of my head, I&amp;#39;ve seen this said by Wittgenstein and Derrida, and I know there are many others.&lt;/p&gt;\n\n&lt;p&gt;Anecdotally, I remember taking a class on literary criticism in undergrad where we studied figures like Foucault, Derrida, Stanley Fish, Terry Eagleton, etc. The professor taught the class well in that he didn&amp;#39;t spoon-feed us the content and challenged us to understand it through our own mental effort. That said, this professor clearly identified with these figures, and though I started out disagreeing with them, once what they were saying &amp;quot;clicked&amp;quot; with me I was swayed by their perspective. But now that I look back on it, I can&amp;#39;t help but feel that there was an implied &amp;quot;These guys are tough to understand, but if you&amp;#39;re smart enough, you&amp;#39;ll see things from their point of view&amp;quot; tint to the class.&lt;/p&gt;\n\n&lt;p&gt;Which leads me to wonder if obfuscation in philosophical writing serves two purposes in protecting it from criticism. 1) If one&amp;#39;s writing is difficult to penetrate, the philosopher can always just say &amp;quot;you don&amp;#39;t understand&amp;quot; to critics. And 2) By making it difficult to penetrate it elevates the writing to a place of intellectual superiority where we&amp;#39;re inclined to accept it must be true because it was difficult to understand and thus only a genius could have written it.&lt;/p&gt;\n\n&lt;p&gt;I understand the nature of this question is partially speculative and may turn out to be more of a discussion piece than a question with a clear answer, but I&amp;#39;m curious if anyone has any experience with academics acknowledging that this happens in philosophical discourse.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/askphilosophy/comments/wmr71i/do_philosophers_ever_intentionally_obfuscate/",
  "subreddit": "askphilosophy",
  "id": "wmr71i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'll preface this by saying that I know a lot of academic writing isn't intended\nfor the general populace and so a lot of philosophical dialogue can seem really\nimpenetrable to the average reader, when really it's just a continual dialogue\namong philosophers using jargon that they themselves are…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "学術的な文章の多くは、意図して書かれたものではないということを、先に言っておきます。\n哲学的な対話は、一般の読者には理解しがたいと思われることがあります。\n一般読者には理解しがたいと思われるかもしれません。\n哲学者たちが専門用語を駆使して対話を続けているだけなのです。",
      "title": "哲学者は、自分の書いたものを批判から守るために、意図的に難解にすることがあるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想先说一下，我知道很多学术著作并不是为普通人准备的\n哲学对话可能看起来非常不切实际，因为它不是为普通人准备的。\n对普通读者来说是难以理解的，而实际上这只是哲学家之间用他们自己的术语进行的持续对话。\n哲学家之间的持续对话，使用的是他们自己的行话...",
      "title": "哲学家们是否曾经故意混淆自己的写作，以保护它不受批评？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想先說一下，我知道很多學術著作並不是爲普通人準備的\n哲學對話可能看起來非常不切實際，因爲它不是爲普通人準備的。\n對普通讀者來說是難以理解的，而實際上這只是哲學家之間用他們自己的術語進行的持續對話。\n哲學家之間的持續對話，使用的是他們自己的行話...",
      "title": "哲學家們是否曾經故意混淆自己的寫作，以保護它不受批評？"
    }
  ]
}