{
  "author": "Invnsbl123",
  "the_new_excerpt": "tl;dr: not this time. I see many people asking how/where to find new\nmulti-bagger stocks, well I think this might be it. Below is reasoning why I\nbelieve this might be the case. There is plenty of time to board the ship as IPO\nwas just few days ago (5th of Feb). Also, this won’t give you any quick…",
  "original_created_utc": 1612714830,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "tl;dr：这次不是。我看到很多人问如何/在哪里找到新的。\n多包股，好吧，我觉得可能就是这个。以下是推理，为什么我\n相信可能是这样的。在IPO上市之际，有足够的时间登船。\n是几天前（2月5日）。另外，这不会给你任何快速...",
      "title": "$EVAX - Evaxion生物技术公司全额DD"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "tl;dr：這次不是。我看到很多人問如何/在哪裏找到新的。\n多包股，好吧，我覺得可能就是這個。以下是推理，爲什麼我\n相信可能是這樣的。在IPO上市之際，有足夠的時間登船。\n是幾天前（2月5日）。另外，這不會給你任何快速...",
      "title": "$EVAX - Evaxion生物技術公司全額DD"
    }
  ],
  "title": "$EVAX - Evaxion Biotech full DD",
  "created_utc": 1612720184,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>tl;dr: not this time. I see many people asking how/where to find new multi-bagger stocks, well I think this might be it. Below is reasoning why I believe this might be the case. There is plenty of time to board the ship as IPO was just few days ago (5th of Feb). Also, this won’t give you any quick gains to write home about. It’s more like casino where you can make an informed bet – and here is the info I could find. It should go without saying, but <strong>I’m not a financial advisor and this is not investment advice!</strong> Just opinion and invite for discussion.</p>\n\n<p>(<strong>Sources in comments</strong>)</p>\n\n<p>I’ve posted a shorter version of my DD last Friday. Will use some of the same sources, so this one could be stand-alone DD.</p>\n\n<p><a href=\"https://s26.q4cdn.com/889291935/files/doc_presentations/Evaxion_Corporate_Roadshow_January_2021_for-website.pdf\">Source 1</a> - The main source I’ll use is presentation published by Evaxion Biotech. I recommend to go through it to get a picture on how big are things there are working on. It does much better job, than what you will ready below.</p>\n\n<p><strong>Premise</strong>: We as society are collecting more and more data about everything and that includes <em>DNA</em> data. Our AI data analytics technology is getting more robust every day. Combine loads of <em>DNA</em> data with AI capabilities and we might get the following:</p>\n\n<p>· Highly personalized treatment. We all know that each one of us is slightly different and those differences are coded in our genetics. For example, most vaccines are safe for like 99.9% of people and are beneficial for whole community as it stops spread of disease by heard immunity. In my opinion it would be completely ethical to let that 0.1% slide if based of their <em>DNA</em> composition it’s clear that vaccine might have side effects. It wouldn’t impact success of vaccinations, but would reduce unfortunate events that fuel some of the conspiracies.</p>\n\n<p>· Better understanding of allergies and food reaction. We all react differently to the same food and this depends mostly on our gut biome (sometimes that gang can be very picky!). By analyzing humongous amounts of data AI systems could predict specific reactions to treatments and suggest the best options.</p>\n\n<p>· Aging. Some scientists say that aging is a disease as any other and it might be cured. If this is true, then how we age is, again, coded in our genetics. Amount of data stored there is probably not really comprehendible for most of us, but using a bunch of cleverly written algorithms it does become a ‘crackable’ task, thus there should be a lot of room for advancements.</p>\n\n<p>· Machine learning advances. Most of the algorithms are available publicly at hat helps to advance entire field forward. AI driven medical solutions are getting more and more traction, which attracts big money and that in return spirals even more advances in the field as it becomes profitable and self-propelling thing.</p>\n\n<p>If you want to read more about how AI and big data works together to provide remarkable analytic abilities, antigen and phenotype detection, predicting prognosis and treatment outcomes – check <strong>Source 2</strong>.</p>\n\n<p>Obviously, there are many huge companies working on AI driven immunotherapy solutions (Intel, Microsoft, NEC, most large medical companies aka ‘big pharma’). Evaxion Biotech probably is not going to outcompete them, but they target specific areas of expertise and already have 8 issued patents with 46 pending applications. I wanted to have a closer look and here it is.</p>\n\n<p><strong>Company</strong>: Evaxion Biotech A/S, a clinical-stage artificial intelligence-immunology platform company, identifies and develops novel immunotherapies for the treatment of various cancers, bacterial diseases, and viral infections. The company develops therapies using PIONEER, an immuno-oncology platform; EDEN, a bacterial disease platform; and RAVENTM, a viral disease platform.</p>\n\n<p>Here is what those platforms are actually used for (<strong>Source 3</strong>):</p>\n\n<p><strong>PIONEER</strong> platform for the identification of patient-specific neoepitopes to potentially transform the immuno-oncology treatment landscape. <strong>Advantages</strong>: Identification of Therapeutic Neoepitopes, Speed, Identification of Therapeutic Patient-Specific Neoepitopes, Identification of Multiple Neoepitopes, Strong Clinical Applicability, Potential for Repeat Use Over Lifetime of Patient’s Cancer Treatment, Favorable Safety Profile, Continuous Improvement.</p>\n\n<p><strong>EDEN</strong> platform for the identification of broadly protective antigens for use against bacterial diseases. <strong>Advantages</strong>: Highly Efficient and Reduced Attrition, Identification of Novel and Unbiased Targets, Data Driven Precision, Ability to Provide Broad Protection, Optimizes Antigen Design, Speed, Scalability.</p>\n\n<p><strong>RAVEN</strong> platform for the rapid response to future pandemic viral diseases. <strong>Advantages</strong>: Promiscuous T-cell Epitopes, Multiple Hits on Target, Coverage of Entire Viral Cycle, Mutation Proof, Neutralizing Focused, Broadly Applicable.</p>\n\n<p><strong>People</strong>: Copenhagen where Evaxion Biotech is based has high concentration huge medical companies. It’s sometimes called a ‘Medicon Valley’ <strong>(source 4</strong>). All of which meaning that concentration of expertise is there and that reflects on composition of company (<strong>source 1</strong>)</p>\n\n<p>Also check out who is on their board of directors and advisors panel. There’s even a guy who’s a member of the Nobel Award Panel.</p>\n\n<p><strong>Research</strong>: Development of pipeline candidates including lead programs EVX01, EVX-02 and EVX-B1, enhancement of proprietary platform technologies. What are all these codes about you can find in Source 1. I told you, this one is good.</p>\n\n<p><strong>Upcoming Catalysts</strong>: FY2020 results (4/26/21); Q12021 results (5/13/21); shareholders meeting (5/25/21); EVX-01 Phase 1/2a Clinical Trial readout anticipated in first half of 2021 <strong>(Source 1</strong>); EVX-02 Phase 1/2a Clinical Trial preliminary data readout expected first half of 2021 (<strong>Source 1</strong>); EVX-03 Initiation of toxicology studies and submission of regulatory filing H2 2021 (this is for SSTI vaccine – it doesn’t exist at the moment).</p>\n\n<p>This is sneak peak on preliminary data from EVX-01 clinical trial (more in <strong>Source 1</strong> and fist dose info – <strong>Source 5</strong>). </p>\n\n<p><strong>Industry Catalysts</strong>: Artificial Intelligence (AI) in Healthcare Market Size Worth $61.59 Billion By 2027 | CAGR of 43.6% (<strong>Source 7</strong>). People like charts, so there’s couple of them in (<strong>Source 10</strong>).</p>\n\n<p>I don’t know about you, but for me it looks like ‘dolla, dolla, bill ya&#39;ll’. In general healthcare industry is robust to various economic impacts – we all get sick, we all age, doesn’t matter if economy is up or down.</p>\n\n<p><strong>Summary</strong>: it’s important to understand that all clinical trials face the same risks, just because they go through the same process and we can assign some probabilities here using data about success rate of those trials. This is how all phases of research looks (<strong>Source 6</strong>, more data on success rate of therapeutic areas – <strong>source 8</strong>):</p>\n\n<p>Phase 1: Several months, approximately 70% of drugs move to the next phase;</p>\n\n<p>Phase 2: Several months to 2 years, approximately 33% of drugs move to the next phase;</p>\n\n<p>Phase 3: 1 to 4 years, approximately 25-30% of drugs move to the next phase. <strong>This where approval of FDA or their equivalent takes place.</strong></p>\n\n<p>Phase 4: Phase IV clinical trials happen after the FDA has approved medication. This phase involves thousands of participants and can last for many years.</p>\n\n<p>Now all above is for a standard clinical research. Evaxion Biotech comes into play with AI driven clinical research and that helps a lot to streamline whole process. Read more on AI impact on clinical trials in <strong>Source 9</strong>.</p>\n\n<p>As mentioned in tl;dr, given all the info above I believe $EVAX could explode once results of current clinical research starts rolling out. This might be that chance to get in something at the very beginning and enjoy the results in couple of years. Place your bets responsibly!</p>\n\n<p>My position: 50 @ 9.65 (contemplating going deeper on Monday and looking for some affirmation or challenge in comments)</p>\n\n<p>That’s it. Now do your own DD. I’m not a financial advisor and this is not investment advice.</p>\n\n<p>Share if you know what&#39;s stock performance of similar companies.</p>\n</div><!-- SC_ON -->",
  "score": 73,
  "permalink": "/r/investing/comments/lepjey/evax_evaxion_biotech_full_dd/",
  "subreddit": "investing",
  "id": "lepjey",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123199864
}