{
  "author": "DawgPound98",
  "the_new_excerpt": "I’m so sick of short sellers like Citron and Hindenburg to the point where I’ve\ndecided to load up on shares and calls on Hindenburg’s latest target, Lordstown\nMotors.\n\nIf you haven’t heard of Hindenburg Research, they are a group of 5 dudes who\nwork out of an apartment in NY. They take large short…",
  "original_created_utc": 1616028265,
  "localize": [
    {
      "locale": "zh",
      "title": "兴登堡研究中心要被人搭便车了",
      "the_new_excerpt": "我对雪铁龙和兴登堡这样的卖空者感到厌恶，以至于我已经\n决定买入兴登堡的最新目标Lordstown的股票和看涨期权。\n汽车。\n\n如果你没听说过兴登堡研究中心，他们是由5个花花公子组成的小组，他们的目标是：\n在纽约的一间公寓里工作。他们采取大的短..."
    },
    {
      "locale": "zh-Hant",
      "title": "興登堡研究中心要被人搭便車了",
      "the_new_excerpt": "我對雪鐵龍和興登堡這樣的賣空者感到厭惡，以至於我已經\n決定買入興登堡的最新目標Lordstown的股票和看漲期權。\n汽車。\n\n如果你沒聽說過興登堡研究中心，他們是由5個花花公子組成的小組，他們的目標是：\n在紐約的一間公寓裏工作。他們採取大的短..."
    }
  ],
  "title": "Hindenburg Research is about to get taken for a $RIDE",
  "created_utc": 1616030930,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m so sick of short sellers like Citron and Hindenburg to the point where I’ve decided to load up on shares and calls on Hindenburg’s latest target, Lordstown Motors.</p>\n\n<p>If you haven’t heard of Hindenburg Research, they are a group of 5 dudes who work out of an apartment in NY. They take large short positions in companies and then release research reports to the public to slander them for their own financial gain.</p>\n\n<p>They are primarily known for their hit-piece on Nikola last year – which I think anyone could have called out. Nikola had no factory or means of production for several years.. pretty easy to expose them especially once their stock ran up to $80/share.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Hindenburg Attacks Lordstown With Multiple Inaccurate Claims</strong></p>\n\n<p>Last Friday, Hindenburg went after Lordstown Motors saying they have no “sellable product” and that they are “3-4 years away” from production (according to “former employees”)</p>\n\n<p>Well – Lordstown had an investor call earlier today confirming that production is beginning THIS September (in 6 months), and they also provided <a href=\"https://twitter.com/LordstownMotors/status/1372178838063570944?s=20\">video evidence</a> that they are currently in the beta phase (think of beta as essentially 97% of the finalized vehicle).</p>\n\n<p>Additionally, Texas-based E-Squared Energy CEO <a href=\"https://www.cfo.com/capital-markets/2021/03/lordstown-motors-responds-to-short-seller/\">came to the defense of Lordstown</a> after the short report explaining that they intend to fill all 14,000 orders over a 2-3 year period. Lordstown is targeting fleet customers initially, so they will be selling a lot of vehicles to service partners like E-Squared Energy (who then sell to actual fleets).</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Hindenburg was right about Nikola.. Aren’t they probably right about Lordstown too?</strong></p>\n\n<p>Nope. I live in Ohio near the enormous Lordstown facility, and that parking lot has been packed every day with workers for about 2 years now. I also know first-hand what this company means to the state of Ohio. Lordstown is in the final due diligence phase for the <a href=\"https://investor.lordstownmotors.com/news-releases/news-release-details/lordstown-motors-reports-fourth-quarter-and-full-year-2020\">Advanced Technology Vehicle Manufacturing (“ATVM”) loan opportunity</a> – which is a very big deal for any company, especially a start-up. They have over 500 employees and over 200 consultants working there currently. The number of workers will be double by production in September.</p>\n\n<p>Lordstown’s flagship <em>Endurance</em> truck will be <a href=\"https://businessjournaldaily.com/lordstown-motors-unveils-truck-for-race-in-mexican-desert/\">shown in action as a proof of concept</a> next month in one of the toughest races ever designed, the San Felipe 250. You can also see numerous other videos of their truck via their YouTube channel.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Brief history on Lordstown Motors:</strong></p>\n\n<p>Lordstown Motors acquired a <a href=\"https://www.cnbc.com/2020/11/17/lordstown-motors-races-to-revive-shuttered-ohio-gm-plant.html\">6.2 million square foot facility back in 2019</a> – this facility now has a replacement value of ~ $3 billion, but they received it for pennies on the dollar due to <a href=\"https://www.freep.com/story/money/cars/general-motors/2020/08/03/gm-invest-ev-maker-lordstown-motors/5571007002/\">GM’s desire to invest</a> in Lordstown. Within their massive production facility, they have carved out an <a href=\"https://lordstownmotors.com/blogs/news/lordstown-motors-releases-business-updates-prepares-ohio-factory-to-begin-building-betas-next-month\">800,000 square foot area for their propulsion facility</a> – which will house production lines for advanced battery packs and hub motors.</p>\n\n<p>Lordstown’s CEO, Steve Burns, is an entrepreneur who has always been ahead of his time. Over 15 years ago, he created a startup called MobileVoiceControl—a predecessor to Siri. The technology patents that Burns developed were then sold and <a href=\"https://www.cincinnatimagazine.com/article/steve-burns-wants-lordstown-motors-to-build-the-worlds-best-electric-pickup-truck/\">used to help Apple create Siri</a>.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Summary of Lordstown’s investor call from 4:30pm EST today:</strong></p>\n\n<ol>\n<li><p>It was confirmed that production will begin this September – which will make the <em>Endurance</em> the first ever <em>full-size</em> electric pick-up truck to hit the road. This will allow them first-mover advantage into the massive light duty truck market.</p></li>\n<li><p>The development mule that caught fire a few months ago was a result of human error – this was a human-made prototype, and the Betas that are currently being produced are being welded by robots (Betas are basically 97% of the actual finished product – so these will be a much more accurate depiction of the final vehicle than the development mules were several months ago).</p></li>\n<li><p>In the coming weeks, as betas come off the production line, the vehicles will be sent for durability, crash, validation, and lighting testing with various partners and to early initial customers for feedback.</p></li>\n<li><p>The fleet vehicle market is unique – which is why pre-order numbers are more based on calculated estimates from service partners like E-Squared Energy (mentioned earlier) and <a href=\"https://investor.lordstownmotors.com/news-releases/news-release-details/lordstown-motors-and-holman-enterprises-announce-co-marketing\">Holman Enterprises</a>. Holman manages 2 million vehicles including 600K pick-ups. These service partners buy from Lordstown and then sell directly to fleets. It’s important to build relationships early-on with these service partners especially since Lordstown is going to be first-to-market in 6 months.</p></li>\n<li><p>Demand remains very strong amongst service partners, government agencies, and commercial fleets. </p></li>\n</ol>\n\n<p>&#x200B;</p>\n\n<p><strong>This is all great, but how in the world will a company from small-town Ohio scale across the whole country?</strong></p>\n\n<p>To help scale and increase a country-wide presence, <a href=\"https://www.globenewswire.com/news-release/2020/12/16/2146315/0/en/Camping-World-and-Lordstown-Motors-Partner-to-Establish-Nationwide-EV-Service-Network-Announce-Plans-to-Develop-Electric-Solutions-for-the-RV-Industry.html\">LM recently partnered with Camping World</a>. This partnership will allow Lordstown to leverage over 170 Service and Collision Centers across the US, with thousands of technicians and service bays via Camping World’s footprint.</p>\n\n<p>Marcus Lemonis is the CEO of Camping World and a successful businessman and entrepreneur featured on “The Profit.” This man would not enter a long-term strategic partnership with a company unless it was the <strong>real deal</strong>, and I can tell you with 100% confidence that he’s been <a href=\"https://twitter.com/marcuslemonis/status/1327013275821891585?lang=en\">all-in on Lordstown</a> since last year. I highly recommend visiting Marcus’ twitter and looking through all of the videos and tweets pertaining to Lordstown.</p>\n\n<p><a href=\"https://lordstownmotors.com/blogs/news/work-for-it-joe-burrow\">Joe Burrow</a> is on board too!</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Anything else besides their Endurance truck?</strong></p>\n\n<p>They announced today that they will do a demonstration of their <a href=\"https://www.greencarreports.com/news/1131108_lordstown-electric-van-lg-chem-batteries-endurance-pickup\">electric van</a> this summer, and it will begin production next year. Their 3rd vehicle will likely be a large SUV.</p>\n\n<p>Keep in mind that as of 2021, the <a href=\"https://www.grandviewresearch.com/industry-analysis/light-duty-vehicles-market\">global light duty vehicles market size is valued at over $600 billion</a> – creating a lot of space for companies like Lordstown to come in and disrupt the industry with their advanced technology and a low price point ($45,000 after federal tax credit).</p>\n\n<p>But given all of that, I think $RIDE’s current <em>market cap</em> is currently wayyyy too low especially relative to others in the EV industry. </p>\n\n<p>&#x200B;</p>\n\n<p><strong>What is a market cap?</strong></p>\n\n<p>Market cap—or market capitalization—refers to the total value of all a company&#39;s shares of stock. It is calculated by multiplying the price of a stock by its total number of outstanding shares. </p>\n\n<p>Market cap allows investors to understand the relative size of one company versus another. It effectively measures what a company is worth on the open market, as well as the market&#39;s perception of its future prospects.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Why are you talking about market cap?</strong></p>\n\n<p>Because I think it is important to look at Lordstown’s market cap in comparison with two of the other most popular start-up EV truck companies based in the US. <em>These numbers were from 3pm EST earlier today</em>:</p>\n\n<p><em>Nikola $NKLA - $5.9 billion market cap</em></p>\n\n<p><em>Canoo $GOEV - $3.9 billion market cap</em></p>\n\n<p><strong>What is Lordstown’s market cap?</strong></p>\n\n<p><em>Lordstown $RIDE - $2.3 billion market cap</em></p>\n\n<p>Listen.. I’m just making the point that Lordstown has one of the <strong>biggest factories</strong> in the country and also will be able to produce <a href=\"https://www.news5cleveland.com/news/local-news/shutdown-in-lordstown/lordstown-motors-seeks-state-waiver-to-sell-future-vehicles-directly-to-consumers-in-ohio\"><strong>600,000 vehicles annually</strong></a> in a couple of years’ time. </p>\n\n<p>Lordstown is only 6 months away from <strong>mass producing</strong> (not hand-making) the world’s first ever <em>full size</em> electric pick-up truck. An <em>Endurance</em> will be coming off the production line every 6 minutes in September, and then every 4 minutes beginning in 2022. This is a very big deal, and I think it’s only a matter of time until the stock is accurately-priced especially relative to its peers.</p>\n\n<p>Companies like Nikola, Canoo, and many other EV start-ups are year(s) away from mass production. And I can’t even imagine the 10’s of billions of dollars it will cost those companies to get to market – meanwhile, Lordstown acquired their state-of-the-art facility for <a href=\"https://www.mbtmag.com/home/news/21244850/lordstown-motors-to-finish-first-electric-truck-prototypes-in-march\">$40 million</a> (and then a couple hundred million in re-tooling the facility). But seriously – this is basically pennies compared to what other EV players like Rivian are paying for their production facilities.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Is this just a pump and dump DD post?</strong></p>\n\n<p>Nope – I’m actually holding mostly January 2023 calls (LEAPS) - meaning that I believe in the long-term growth story here. I have 10 January 2023 call contracts at a $40 strike price. My price target for January 2023 is $150/share, which would mean a market cap of ~ $20 billion. This is a very volatile stock if you look at the 6-month chart, which is why I think holding onto shares or LEAPS is the smartest approach. It is also worth noting that the average price target between the 5 analysts that cover the stock is $30.</p>\n\n<p>Additionally, I hate Hindenburg, and seeing that “report” last Friday set me off. That’s what caused me to do so much research into Lordstown over the past week.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Summary:</strong></p>\n\n<p>To quote Warren Buffett, “You should be greedy when others are fearful”</p>\n\n<p>Hindenburg Research putting out a hit-piece against $RIDE has created some fear for investors. This fear has caused a sell-off and an increasingly high short interest in the stock – I think Hindenburg and the remaining shorts are going to have to cover by the end of this week before they get burned really badly. This company is very real and it is now in the public-eye more than it has ever been.</p>\n\n<p>And to the doubters and bears that will appear in the comments - you’re going to come back and look at this post in about a year when $RIDE is valued about 3-4x of its current price and wish you would have loaded up on these cheap shares ;)</p>\n\n<p>&#x200B;</p>\n\n<p><strong>TL;DR</strong></p>\n\n<p>Citron and Hindenburg can go straight to hell. Load the boat on shares of $RIDE – this chart is poised for a breakout. Read my whole post if you want to see why Lordstown is legit and Hindenburg isn’t.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>EDIT:</strong> </p>\n\n<p>CEO Steve Burns will be on CNBC at 8:20am EST tomorrow morning.</p>\n</div><!-- SC_ON -->",
  "score": 441,
  "permalink": "/r/stocks/comments/m7f4h7/hindenburg_research_is_about_to_get_taken_for_a/",
  "subreddit": "stocks",
  "id": "m7f4h7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147384046
}