{
  "author": "praj18",
  "the_new_excerpt": "I don't want to burst anyone's bubble but lately its all been posts about how\ncryptocurrency has helped someone or how someone is suffering in their country\nand moons helped them out. Where are the good old days when we used to talk\nabout news related to cryptocurrencies rather than personal…",
  "original_created_utc": 1618821415,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "誰かのバブルを壊すつもりはありませんが、最近は暗号通貨が誰かを助けたとか、誰かが自分の国で苦しんでいるという記事ばかりです。\n暗号通貨が誰かを助けたとか、誰かが国で苦しんでいてムーンが助けてくれたとか、そんな記事ばかりです。\nムーンが助けてくれたという記事ばかりです。暗号通貨に関連するニュースを話していた古き良き時代はどこへ行ってしまったのでしょうか？\n個人的なことよりも暗号通貨に関連するニュースについて話していた昔はどうだったのでしょうか？",
      "title": "昔のr/Cryptocurrencyが懐かしい"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不想打破任何人的泡沫，但最近其所有的帖子如何\n加密货币帮助了某个人，或者某个人在他们的国家是如何受苦的。\n和月亮帮助他们。我们过去常说的好日子在哪里？\n关于加密货币相关的新闻，而不是个人... ...",
      "title": "错过了旧的r/Cryptocurrency"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不想打破任何人的泡沫，但最近其所有的帖子如何\n加密貨幣幫助了某個人，或者某個人在他們的國家是如何受苦的。\n和月亮幫助他們。我們過去常說的好日子在哪裏？\n關於加密貨幣相關的新聞，而不是個人... ...",
      "title": "錯過了舊的r/Cryptocurrency"
    }
  ],
  "title": "Missing the old r/Cryptocurrency",
  "created_utc": 1618832072,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I don&#39;t want to burst anyone&#39;s bubble but lately its all been posts about how cryptocurrency has helped someone or how someone is suffering in their country and moons helped them out. Where are the good old days when we used to talk about news related to cryptocurrencies rather than personal benefits? I don&#39;t mean to be rude but the purpose of this subreddit was to educate people about what&#39;s going on in the crypto world, I mean, it even says so in the community description.</p>\n\n<p><em>The official source for CryptoCurrency News, Discussion &amp; Analysis.</em></p>\n\n<p>But lately, it has been none of that and doesn&#39;t quite provide any useful information regarding crypto but instead we have posts about how it helped someone from a third world country undergo a penis enlargement surgery after selling all the moons they made.</p>\n\n<p>Edit: I know that we&#39;re all in this together and we should help each other out. But someone who asks for moons because it&#39;ll help their financial situation is not more deserving of it than someone who brings in useful information to this subreddit. I believe that it&#39;ll also motivate people to do more thorough research and make better contributions to this society.</p>\n</div><!-- SC_ON -->",
  "score": 1713,
  "permalink": "/r/CryptoCurrency/comments/mtw8q6/missing_the_old_rcryptocurrency/",
  "subreddit": "CryptoCurrency",
  "id": "mtw8q6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171521470
}