{
  "author": "ExtensionFeeling",
  "original_created_utc": 1655519192,
  "title": "Is it actually true that Stalin pulled The Grapes of Wrath from Soviet theaters because it gave citizens a positive impression of America?",
  "created_utc": 1655592129,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The story goes that Stalin released The Grapes of Wrath in Soviet theaters because it would show workers and peasants the flaws of capitalism. He removed it, though, once they saw that even the poorest of Americans could still afford a car. &lt;/p&gt;\n\n&lt;p&gt;Is this true?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/vew92r/is_it_actually_true_that_stalin_pulled_the_grapes/",
  "subreddit": "AskHistorians",
  "id": "vew92r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The story goes that Stalin released The Grapes of Wrath in Soviet theaters\nbecause it would show workers and peasants the flaws of capitalism. He removed\nit, though, once they saw that even the poorest of Americans could still afford\na car.\n\nIs this true?",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "スターリンが「怒りの葡萄」をソ連の劇場で公開したという話\n労働者や農民に資本主義の欠点を見せるということで しかし\nしかし、アメリカの最貧困層でさえ車を買うことができることを知ると、彼はそれを撤去した。\nしかし、アメリカの最貧困層でも車を買うことができることを知ると、彼はこの映画を削除したのです。\n\n本当だろうか？",
      "title": "スターリンが「怒りの葡萄」をソ連の映画館から撤去したのは、市民にアメリカに対する好感を与えたからだというのは本当ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "据说，斯大林在苏联影院发行《愤怒的葡萄》，因为它可以向工人和农民展示资本主义的缺陷。\n因为它将向工人和农民展示资本主义的缺陷。不过，他在一次\n不过，一旦他们看到即使是最贫穷的美国人也能买得起汽车，他就把它拿掉了。\n一辆汽车。\n\n这是真的吗？",
      "title": "斯大林将《愤怒的葡萄》从苏联影院撤下，因为它给公民带来了对美国的正面印象，这究竟是不是真的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "據說，斯大林在蘇聯影院發行《憤怒的葡萄》，因爲它可以向工人和農民展示資本主義的缺陷。\n因爲它將向工人和農民展示資本主義的缺陷。不過，他在一次\n不過，一旦他們看到即使是最貧窮的美國人也能買得起汽車，他就把它拿掉了。\n一輛汽車。\n\n這是真的嗎？",
      "title": "斯大林將《憤怒的葡萄》從蘇聯影院撤下，因爲它給公民帶來了對美國的正面印象，這究竟是不是真的？"
    }
  ]
}