{
  "author": "Jase82",
  "original_created_utc": 1635987774,
  "title": "How many of you plan to hold for 5+ years and aren't even thinking of selling during this bull run?",
  "created_utc": 1635996646,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Many people view their crypto buys as long term investments and many people are in it for the quick sexy gains. </p>\n\n<p>But looking back, those who bought BTC in 2016 and didn&#39;t sell are doing incredibly well with their initial investment. </p>\n\n<p>However with the potential insane short term gains in this market, most people sell after a relatively short period or buy and sell chasing pumps.</p>\n\n<p>We&#39;ve seen tons of posts about when to sell and nailing the exact right time. How many of you won&#39;t be selling at all this bull run?</p>\n</div><!-- SC_ON -->",
  "score": 430,
  "permalink": "/r/CryptoCurrency/comments/qm93so/how_many_of_you_plan_to_hold_for_5_years_and/",
  "subreddit": "CryptoCurrency",
  "id": "qm93so",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Many people view their crypto buys as long term investments and many people are\nin it for the quick sexy gains.\n\nBut looking back, those who bought BTC in 2016 and didn't sell are doing\nincredibly well with their initial investment.\n\nHowever with the potential insane short term gains in this market,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "多くの人は、暗号の購入を長期的な投資と考えていますが、多くの人は手っ取り早くセクシーな利益を得るために\n早くセクシーな利益を得るために参加しています。\n\nしかし、振り返ってみると、2016年にBTCを買って売らなかった人たちは、次のようにしています。\n初期投資で信じられないほどうまくいっています。\n\nしかし、この市場では非常識な短期的な利益を得る可能性があるため、...",
      "title": "5年以上の保有を予定し、このブルランの間に売却することを考えていない人はどれくらいいるだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "许多人将他们的加密货币购买视为长期投资，而许多人是为了快速的性感收益。\n是为了快速的性感收益。\n\n但回顾一下，那些在2016年买入BTC并且没有卖出的人正在做\n他们的初始投资做得非常好。\n\n然而，随着这个市场潜在的疯狂的短期收益，...",
      "title": "你们中有多少人打算持有5年以上，甚至没有考虑在这轮牛市中卖出？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "許多人將他們的加密貨幣購買視爲長期投資，而許多人是爲了快速的性感收益。\n是爲了快速的性感收益。\n\n但回顧一下，那些在2016年買入BTC並且沒有賣出的人正在做\n他們的初始投資做得非常好。\n\n然而，隨着這個市場潛在的瘋狂的短期收益，...",
      "title": "你們中有多少人打算持有5年以上，甚至沒有考慮在這輪牛市中賣出？"
    }
  ]
}