{
  "author": "z_tranquil",
  "the_new_excerpt": "I was looking through the history of the House of Representatives and the\nmajority party by year and found something a little bit odd. From 1933 to\nmid-'90s Democrats have almost never lost the majority position and even got\nsupermajority sometimes. The only time that they've lost the majority…",
  "original_created_utc": 1613224168,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我在翻阅众议院的历史和\n按年份划分的多数党，发现了一个有点奇怪的事情。从1933年到\n九十年代中期，民主党几乎从未失去过多数席位，甚至还获得了胜利。\n超级多数有时。唯一的一次，他们已经失去了大多数... ...",
      "title": "民主党为什么能从20世纪30年代到90年代中期一直保持在众议院的多数席位？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在翻閱衆議院的歷史和\n按年份劃分的多數黨，發現了一個有點奇怪的事情。從1933年到\n九十年代中期，民主黨幾乎從未失去過多數席位，甚至還獲得了勝利。\n超級多數有時。唯一的一次，他們已經失去了大多數... ...",
      "title": "民主黨爲什麼能從20世紀30年代到90年代中期一直保持在衆議院的多數席位？"
    }
  ],
  "title": "How did Democratic party manage to retain the majority in the house for so long from 1930's until mid- 90's?",
  "created_utc": 1613255917,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was looking through the history of the House of Representatives and the majority party by year and found something a little bit odd. From 1933 to mid-&#39;90s Democrats have almost never lost the majority position and even got supermajority sometimes. The only time that they&#39;ve lost the majority during that time period was 80th congress (1947-1949), 83rd (1953-1955) during Harry Truman&#39;s presidency. Even when assuming house election favors the opposition party, they didn&#39;t lose majority during the LBJ&#39;s presidency, and Carter&#39;s presidency so my questions are</p>\n\n<p>1) How were they able to retain majority for such a long time</p>\n\n<p>2) How did the Republican presidents such as Ronald Regan, Richard Nixon, Dwight D. Eisenhower able to push their agenda despite not having house approval? Were there a lot of bipartisan bills introduced during that time period?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/Ask_Politics/comments/lj0v6d/how_did_democratic_party_manage_to_retain_the/",
  "subreddit": "Ask_Politics",
  "id": "lj0v6d",
  "is_self": true,
  "media": null,
  "is_video": false
}