{
  "author": "life_is_oof",
  "the_new_excerpt": "I know it sounds crazy to call Siberia densely populated but compared to other\nplaces with similar climates like northern Canada and Greenland it is actually\nvery well populated. There are many major cities like Novosibirsk\n[https://en.wikipedia.org/wiki/Novosibirsk],…",
  "original_created_utc": 1624242438,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "シベリアを人口密集地と呼ぶのはおかしいと思いますが、カナダ北部やグリーンランドなど、同じような気候の場所と比べると\nカナダ北部やグリーンランドなど、気候が似ている他の地域と比べると、実際には非常に恵まれています。\nシベリアは人口密度が高いです。ノボシビルスク[]のような多くの大都市があります。\n[https://en.wikipedia.org/wiki/Novosibirsk],...",
      "title": "なぜシベリアは、同じように厳しい気候の他の地域に比べて、これほどまでに人が集まっているのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道把西伯利亚称为人口稠密的地方听起来很疯狂，但与其他气候相似的地方如加拿大北部和格陵兰岛相比\n与加拿大北部和格陵兰岛等气候相似的地方相比，它实际上是\n人口非常丰富。有许多主要城市，如新西伯利亚\n[https://en.wikipedia.org/wiki/Novosibirsk]，...",
      "title": "为什么西伯利亚与其他具有类似恶劣气候的地区相比，定居情况如此良好？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道把西伯利亞稱爲人口稠密的地方聽起來很瘋狂，但與其他氣候相似的地方如加拿大北部和格陵蘭島相比\n與加拿大北部和格陵蘭島等氣候相似的地方相比，它實際上是\n人口非常豐富。有許多主要城市，如新西伯利亞\n[https://en.wikipedia.org/wiki/Novosibirsk]，...",
      "title": "爲什麼西伯利亞與其他具有類似惡劣氣候的地區相比，定居情況如此良好？"
    }
  ],
  "title": "Why is Siberia so well settled compared to other areas with a similarly harsh climate?",
  "created_utc": 1624255010,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I know it sounds crazy to call Siberia densely populated but compared to other places with similar  climates like northern Canada and Greenland it is actually very well populated. There are many major cities like <a href=\"https://en.wikipedia.org/wiki/Novosibirsk\">Novosibirsk</a>, <a href=\"https://en.wikipedia.org/wiki/Omsk\">Omsk</a>, <a href=\"https://en.wikipedia.org/wiki/Krasnoyarsk\">Krasnoyarsk</a>, <a href=\"https://en.wikipedia.org/wiki/Irkutsk\">Irkutsk</a>, <a href=\"https://en.wikipedia.org/wiki/Barnaul\">Barnaul</a>, <a href=\"https://en.wikipedia.org/wiki/Kemerovo\">Kemerovo</a>, <a href=\"https://en.wikipedia.org/wiki/Tyumen\">Tyumen</a>, <a href=\"https://en.wikipedia.org/wiki/Tomsk\">Tomsk</a>, <a href=\"https://en.wikipedia.org/wiki/Novokuznetsk\">Novokuznetsk</a>, <a href=\"https://en.wikipedia.org/wiki/Khabarovsk\">Khabarovsk</a>, <a href=\"https://en.wikipedia.org/wiki/Vladivostok\">Vladivostok</a> and arguably <a href=\"https://en.wikipedia.org/wiki/Chelyabinsk\">Chelyabinsk</a> and <a href=\"https://en.wikipedia.org/wiki/Yekaterinburg\">Yekaterinburg</a>, all of which have populations over 500,000 (Novosibirsk, Omsk, Krasnoyarsk, Chelyabinsk and Yekaterinburg  each have over 1,000,000), and so many more with 100,000+. Most of these places have very long and brutal winters, comparable to <a href=\"https://en.wikipedia.org/wiki/Whitehorse\">Whitehorse</a> or <a href=\"https://en.wikipedia.org/wiki/Winnipeg\">Winnipeg</a>, Canada&#39;s only city with similar population and climate to the Siberian cities, and colder than <a href=\"https://en.wikipedia.org/wiki/Nuuk\">Nuuk</a>. (except Vladivostok which is comparable to wonderfully warm <a href=\"https://en.wikipedia.org/wiki/Duluth,_Minnesota\">Duluth,_Minnesota</a>) There are even cities with populations in the hundreds of thousands (ie. <a href=\"https://en.wikipedia.org/wiki/Yakutsk\">Yakutsk</a>, <a href=\"https://en.wikipedia.org/wiki/Norilsk\">Norilsk</a>) that have some truly insane winters that are colder than any other cities in the world and comparable to and often even colder than Arctic research stations. In comparison. northern Canada&#39;s largest city, Whitehorse, on;y has a population of around 25,000 and the Yukon, Northwest and Nunavut territories together only add up to just over 100,000 people. Greenland only has ~56,000.  Why does Siberia have so many large cities in such inhospitable climates?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/o4kxvs/why_is_siberia_so_well_settled_compared_to_other/",
  "subreddit": "AskHistorians",
  "id": "o4kxvs",
  "is_self": true,
  "media": null,
  "is_video": false
}