{
  "author": "ThePeoplesBard",
  "the_new_excerpt": "Both sides have held their positions for a decade plus, at a complete stalemate.\nThe trench warfare has led to distinct cultures and ways of life.\n\nShorting hedge fund managers and their progeny now have a cult like worship of\nblack holes. They believe the slow dissolve of their multi-generational…",
  "original_created_utc": 1612067598,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "双方坚守阵地十多年，完全处于僵持状态。\n壕沟战导致了不同的文化和生活方式。\n\n做空的对冲基金经理和他们的后代现在对黑洞有一种邪教般的崇拜。\n黑洞的崇拜。他们相信，他们的多代人的缓慢消亡......",
      "title": "这一年是2037年。GME是320美元的份额。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "雙方堅守陣地十多年，完全處於僵持狀態。\n壕溝戰導致了不同的文化和生活方式。\n\n做空的對沖基金經理和他們的後代現在對黑洞有一種邪教般的崇拜。\n黑洞的崇拜。他們相信，他們的多代人的緩慢消亡......",
      "title": "這一年是2037年。GME是320美元的份額。"
    }
  ],
  "title": "The year is 2037. GME is $320 share.",
  "created_utc": 1612152131,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Both sides have held their positions for a decade plus, at a complete stalemate. The trench warfare has led to distinct cultures and ways of life.</p>\n\n<p>Shorting hedge fund managers and their progeny now have a cult like worship of black holes. They believe the slow dissolve of their multi-generational wealth to interest rates is their holy birthright. Eventually they, like blessed light, will be absorbed entirely by the One True Lender Bank, and they will come out the other side clean and pure. They must not hasten the process, though, just as light cannot hasten its black hole rebirth. It was born with a direction and held it firmly, for eons.</p>\n\n<p>GME shareholders now live in a caste system. Citizens wear physical symbols of their number of shares, like pieces of flair. Children inherit their parents’ flair, and weddings are arranged so as to strategically join the shares and average price of two families. The vehicle of choice is a Tesla Short Bus, and everyone prays to Deep Fucking Value each night. He answers their prayers by holding, and they honor him by doing the same.</p>\n</div><!-- SC_ON -->",
  "score": 29990,
  "permalink": "/r/wallstreetbets/comments/l94kur/the_year_is_2037_gme_is_320_share/",
  "subreddit": "wallstreetbets",
  "id": "l94kur",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518552839
}