{
  "author": "TheIenzo",
  "original_created_utc": 1631872173,
  "title": "Why did industrialization under the Song Dynasty a thousand years ago in China not develop industrial capitalism like Europe did in the 17th-19th centuries?",
  "created_utc": 1631887889,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The economy of the Song Dynasty smelted a LOT of steel and harnessed the power of coal. They had money, the ultimate commodity that exchanges different use-values with each other, suggesting they had commodity production. Yet despite features of industrialization and commodity production, China was quite late in terms of capitalist development centuries after the Song Dynasty. Why is this so? Why did capitalism not develop in China a thousand years ago despite the existence of industrialization and commodity production?</p>\n</div><!-- SC_ON -->",
  "score": 111,
  "permalink": "/r/AskHistorians/comments/ppx472/why_did_industrialization_under_the_song_dynasty/",
  "subreddit": "AskHistorians",
  "id": "ppx472",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The economy of the Song Dynasty smelted a LOT of steel and harnessed the power\nof coal. They had money, the ultimate commodity that exchanges different\nuse-values with each other, suggesting they had commodity production. Yet\ndespite features of industrialization and commodity production, China was…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "宋の時代の経済は、たくさんの鉄を溶かし、石炭の力を利用していました。\n石炭の力を利用した。彼らは、異なる使用価値を互いに交換する究極の商品である貨幣を持っていました。\n貨幣があったということは、商品生産があったということです。しかし\n工業化と商品生産の特徴にもかかわらず、中国は...",
      "title": "千年前の中国、宋の時代の工業化では、なぜ17〜19世紀のヨーロッパのような産業資本主義が発達しなかったのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "宋朝的经济发展，冶炼了大量的钢铁，利用了煤炭的力量。\n煤的力量。他们有货币，这种最终的商品可以交换不同的\n价值的终极商品，这表明他们有商品生产。然而\n尽管有工业化和商品生产的特点，但中国还是...",
      "title": "为什么一千年前中国宋朝的工业化没有像欧洲在17-19世纪那样发展工业资本主义？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "宋朝的經濟發展，冶煉了大量的鋼鐵，利用了煤炭的力量。\n煤的力量。他們有貨幣，這種最終的商品可以交換不同的\n價值的終極商品，這表明他們有商品生產。然而\n儘管有工業化和商品生產的特點，但中國還是...",
      "title": "爲什麼一千年前中國宋朝的工業化沒有像歐洲在17-19世紀那樣發展工業資本主義？"
    }
  ]
}