{
  "author": "notmattdamon1",
  "the_new_excerpt": "There are lots of success stories around here, and sometimes an \"how did you get\nrekt?\" thread. But have you consistently been so bad at crypto that it made you\nlaugh out loud and call yourself a dummy? So I thought it'd be cathartic to go\ndown memory lane and write down my painful crypto story,…",
  "original_created_utc": 1610707967,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这里有很多成功的案例，有时也会有 \"你是怎么得到的？\nrekt？\"线。但是，你是否一直在加密技术上如此糟糕，以至于让你\n笑出声来，还说自己是哑巴？所以我想，如果我去了，会是一种宣泄。\n沿着记忆的轨迹，写下我痛苦的加密故事，... ...",
      "title": "一个加密白痴的行程"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這裏有很多成功的案例，有時也會有 \"你是怎麼得到的？\nrekt？\"線。但是，你是否一直在加密技術上如此糟糕，以至於讓你\n笑出聲來，還說自己是啞巴？所以我想，如果我去了，會是一種宣泄。\n沿着記憶的軌跡，寫下我痛苦的加密故事，... ...",
      "title": "一個加密白癡的行程"
    }
  ],
  "title": "Itinerary of a crypto idiot",
  "created_utc": 1610719610,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There are lots of success stories around here, and sometimes an &quot;how did you get rekt?&quot; thread. But have you consistently been so bad at crypto that it made you laugh out loud and call yourself a dummy? So I thought it&#39;d be cathartic to go down memory lane and write down my painful crypto story, which, as the post title says, is pretty much a textbook guide of what NOT to do. You can read, laugh and who knows, maybe even learn something.</p>\n\n<p>&nbsp;</p>\n\n<p>1) I bought the literal top in December 2017. You know that running joke in crypto how a coin tanks as soon as you buy it? My first BTC buy was on December 16th 2017. Check the charts. I sometimes wonder if I single-handedly fucked the market.</p>\n\n<p>2) I initially bought BTC and ETH. As I was an early adopter of the &quot;buy high sell low&quot; philosophy, I panic sold my BTC shortly after. Then I proceeded to use my precious ETH to chase pumps and shilled shitcoins, signing up left and right on obscure exchanges in the process, and you guessed it, again always buying the top of trending alts. To name a few of my shiny early acquisitions: BNTY, DBC, PRL. Thanks <a href=\"/r/cryptocurrency\">/r/cryptocurrency</a> daily discussions!</p>\n\n<p>3) In my everlasting quest to being a super early adopter and smarter than everyone, I had an ICO phase. What&#39;s an ICO phase you ask? That&#39;s when you share a photo of your passport and your face with complete strangers on the Internet (KYC process, for those unfamiliar), in order to obtain the privilege to invest in their Initial (Shit)Coin Offering, supposedly at bottom price, before they&#39;re listed on any exchanges, with little to no guarantees that they&#39;re even legit. \nI did however always do diligent research: I ensured the project websites had cool animations and logos, that they used words like &quot;industry-disruptive&quot;, and that their subreddit top 10 posts of all times had at least 9 hysterical price predictions. What do I have to show for it? The pride to have sponsored the lavish lifestyle of some &quot;blockchain entrepreneurs&quot;, and that my passport is probably used nowadays to rent hookers in Moldova.</p>\n\n<p>4) I stayed too long involved in idealistic and promising, but dying projects (Elastos, Elix, HorizonState, FunFair, Babb). I am ashamed just writing those names down.</p>\n\n<p>5) I bought literal scams, like XTRABYTES and SUBSTRATUM. I&#39;m only missing BITCONNECT for scam bingo. If you guys have a bridge to sell, let me know, I might be interested.</p>\n\n<p>6) The few successes I had, I was too greedy and didn&#39;t cash out any profits. I saw NANO do an 8X, then watched it crash back to below my buy price, with a surprised pikachu face all the way up, and all the way down. I by the way almost lost all my Railblocks in the Bitgrail disaster, but thankfully transferred them right before it happened (possibly my &quot;smartest&quot; move to date).</p>\n\n<p>7) I screwed up some decimals when placing orders on IDEX, buying for way higher than market price.</p>\n\n<p>8) I placed some buy orders that never filled because I had set them as Limit instead of Market. God I&#39;ve done this so many times. I was once even so dumb that I contacted Binance customer service to ask why the order didn&#39;t fill…</p>\n\n<p>9) During a coin swap process, I lost private wallet keys, and wrongly updated my passphrase.</p>\n\n<p>10) I wasted so much in transfer fees moving coins in and out of MEW and between exchanges back and forth, most of the time for no good reason.</p>\n\n<p>11) I signed up for all kinds of worthless airdrops that only filled my mailbox with spam.</p>\n\n<p>12) And last but not least, the grand finale: I bought a ledger, but never used it! That&#39;s right, I was going be a millionaire, you see, I had to get ready to store all that digital gold. It&#39;s still in its plastic wrapping, in my bedside table drawer, staring at me like the disappointed cricket fan meme every time I open it.</p>\n\n<p>&nbsp;</p>\n\n<p>Now, what I did right (I think):</p>\n\n<p>&nbsp;</p>\n\n<ul>\n<li><p>I DCAed for a while after the early 2018 crash. As it kept crashing, I eventually stopped throwing good money after bad.</p></li>\n<li><p>Whatever shitcoins I had that still had value, I converted them to serious projects like ETH and VET, and I held.</p></li>\n<li><p>I fucking stopped trading. How I thought this was something I could do, having literally zero experience on financial markets, is hilarious in retrospect.</p></li>\n<li><p>During the long winter bear, I looked at prices only weekly, and kept up to date with general news, but without obsessing. A bit like polishing your meat to an ex-girlfriend you stayed in good terms with, but without the tears.</p></li>\n<li><p>I did a lot of reading on crypto throughout the whole ordeal. It&#39;s fascinating and despite my financial misfortunes, I&#39;m a firm believer in the future of crypto.</p></li>\n<li><p>I bought some ETH when it dropped to $150 early 2020.</p></li>\n<li><p>I&#39;m the proud owner of 5000 DOGE.</p></li>\n</ul>\n\n<p>&nbsp;</p>\n\n<p>Where am I now? Almost breaking even. It took more than three years in the red, but thanks to DCA, holding, and sticking to solid projects, I stayed afloat and it will eventually, hopefully, make up for all the stupid mistakes I made. When I finally break even, I&#39;ll reduce my position, keep some ETH, post on crypto forums what a boss I am for being in the green, and that will be the end of a rather long and agonizing learning experience.</p>\n\n<p>&nbsp;</p>\n\n<p>Thank you for reading :]</p>\n</div><!-- SC_ON -->",
  "score": 1898,
  "permalink": "/r/CryptoCurrency/comments/kxs9er/itinerary_of_a_crypto_idiot/",
  "subreddit": "CryptoCurrency",
  "id": "kxs9er",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1611311214966
}