{
  "author": "lebrokholic",
  "the_new_excerpt": "I have a feeling that after gaining so much attention, u/deepfuckingvalue\n[/u/deepfuckingvalue] is in a trap of his own popularity and has problems any\npublic person might have, especially when a lot of people’s wealth is dependent\non his decisions.\n\nThere must be a dilemma for him: he sells too…",
  "original_created_utc": 1612241972,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我有一种感觉，在获得如此多的关注之后，u/deepfuckingvalue。\n[/u/deepfuckingvalue]陷入了自己的人气陷阱，有问题的任何\n公众可能拥有的，特别是当很多人的财富都是依赖的时候。\n对他的决定。\n\n他一定有一个两难的选择：他卖的太...",
      "title": "DVF是自己人气的受害者吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我有一種感覺，在獲得如此多的關注之後，u/deepfuckingvalue。\n[/u/deepfuckingvalue]陷入了自己的人氣陷阱，有問題的任何\n公衆可能擁有的，特別是當很多人的財富都是依賴的時候。\n對他的決定。\n\n他一定有一個兩難的選擇：他賣的太...",
      "title": "DVF是自己人氣的受害者嗎？"
    }
  ],
  "title": "Is DVF a victim of his own popularity?",
  "created_utc": 1612295259,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have a feeling that after gaining so much attention, <a href=\"/u/deepfuckingvalue\">u/deepfuckingvalue</a> is in a trap of his own popularity and has problems any public person might have, especially when a lot of people’s wealth is dependent on his decisions.</p>\n\n<p>There must be a dilemma for him: he sells too early - he gets money, but crashes the momentum, gets tons of hate, looses his WSB reputation and influence on retail (might be even institutional) investors; he sells too late - he looses dozens of millions of dollars.</p>\n\n<p>I have an impression that DFV is a smart guy who is a good value investor, so genuinely he deserves a freedom of making any decisions on GME he wants, but I am concerned of his position. Given that WSB has a few inadequate members who might threaten DFV’s safety, if something goes wrong. As DFV just became a public person and his name and other personal details are widely known, this becomes even trickier.</p>\n\n<p>I might be downvoted, but a fact that I saw people in WSB calling a little kid who sold his GME shares (from the recent news) “a little c*nt” just pisses me off as this crosses all the borders.</p>\n\n<p>Hope, nothing terrible happens to DFV and he pulls out from GME at the right time without raising to much hate from his followers. I guess loosing his reputation is also something that he might not want, but are millions a good price for being called a legend of a Reddit community?</p>\n\n<p>What would you do if you were in his shoes?</p>\n\n<p>Edit: made a typo in the title, supposed to be DFV</p>\n</div><!-- SC_ON -->",
  "score": 70,
  "permalink": "/r/stocks/comments/lanxjg/is_dvf_a_victim_of_his_own_popularity/",
  "subreddit": "stocks",
  "id": "lanxjg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518541042
}