{
  "author": "bkcrypt0",
  "original_created_utc": 1660395397,
  "title": "Friendly reminder: As market goes up so do predictions that markets will go up. No one knows future price (unless they’re a time traveler)",
  "created_utc": 1660423337,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The sub is getting that tingly feeling again. &lt;/p&gt;\n\n&lt;p&gt;BTC and ETH have hit 30 day highs. The merge is nearly upon us. Surely winter must be thawing. &lt;/p&gt;\n\n&lt;p&gt;But buyer beware. &lt;/p&gt;\n\n&lt;p&gt;There will be a ton of “smart” sounding posts with all kinds of technical predictions that make it sound like gains are guaranteed. &lt;/p&gt;\n\n&lt;p&gt;The FOMO is coming. &lt;/p&gt;\n\n&lt;p&gt;It’s the same every time. No one knows the future no matter how much math they use to “prove” this breakout or that resistance. &lt;/p&gt;\n\n&lt;p&gt;And the Youtube shucksters will be out in full force too, pumping this coin or that as the next 10x, 100x gain if only you got in early enough (shh, don’t tell everyone, while they tell everyone.)&lt;/p&gt;\n\n&lt;p&gt;No one is giving out free info to make mad profits or crazy high yields if they don’t have something to gain/sell/manipulate. &lt;/p&gt;\n\n&lt;p&gt;It’s your hard earned money at risk. &lt;/p&gt;\n\n&lt;p&gt;Buyer beware (and enjoy the ride!)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 345,
  "permalink": "/r/CryptoCurrency/comments/wndwy2/friendly_reminder_as_market_goes_up_so_do/",
  "subreddit": "CryptoCurrency",
  "id": "wndwy2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The sub is getting that tingly feeling again.\n\nBTC and ETH have hit 30 day highs. The merge is nearly upon us. Surely winter\nmust be thawing.\n\nBut buyer beware.\n\nThere will be a ton of “smart” sounding posts with all kinds of technical\npredictions that make it sound like gains are guaranteed.\n\nThe…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "サブは、またあのヒリヒリした感覚を味わっています。\n\nBTCとETHが30日高値を更新しました。マージはもうすぐです。きっと冬が\n解凍されるに違いない。\n\nしかし、買い手は要注意だ。\n\nしかし、買い手には注意が必要です。\n技術的な予測で、まるで利益が保証されているかのような、「賢い」投稿がたくさんあります。\n\nその...",
      "title": "親切な注意喚起 市場が上がれば、市場が上がるという予測も上がる。未来の値段は誰にもわからない（タイムトラベラーでない限り）。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "子又有了那种刺痛的感觉。\n\nBTC和ETH已经达到了30天的高点。合并几乎已经来临。当然，冬天\n一定是解冻了。\n\n但买家要小心。\n\n将会有一大堆听起来很 \"聪明 \"的帖子，有各种技术性的\n预测，使其听起来好像收益得到保证。\n\n这是对的。",
      "title": "友情提醒。随着市场的上涨，对市场将上涨的预测也在不断增加。没有人知道未来的价格（除非他们是一个时间旅行者）。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "子又有了那種刺痛的感覺。\n\nBTC和ETH已經達到了30天的高點。合併幾乎已經來臨。當然，冬天\n一定是解凍了。\n\n但買家要小心。\n\n將會有一大堆聽起來很 \"聰明 \"的帖子，有各種技術性的\n預測，使其聽起來好像收益得到保證。\n\n這是對的。",
      "title": "友情提醒。隨着市場的上漲，對市場將上漲的預測也在不斷增加。沒有人知道未來的價格（除非他們是一個時間旅行者）。"
    }
  ]
}