{
  "author": "gdanon929",
  "original_created_utc": 1630469753,
  "title": "I’m a 24 year old virgin who has never had a serious relationship, experienced love, or even had a first kiss yet. Am I as much of a loser as I think I am?",
  "created_utc": 1630488134,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m 24 years old, a college student, and have lived in Philly my whole life. I’ve always had a good amount of friends, both male and female. I’m well liked by almost anyone, I’m personable, funny, and sociable. I can have a conversation with just about anyone I meet. As for appearance, I’m about 6ft, 230lbs. Definitely overweight but not “crazy big” (I’m working to lose weight too) I consider myself a decent looking guy. I have good hair, nice eyes, a nice beard. I’m not a very confident guy, but I know I’m better looking than a lot of guys I see with girlfriends.</p>\n\n<p>That brings me to my point, even with considering myself to have a great personality and decent looks.. I can not for the life of me get a girl to show interest in me. To be fair, I’ve never tried much. I have “shot my shot” only once in real life, it didnt go well.. So since then I’ve just done the typical dating app bs which never leads to anything. It just seems like EVERYONE around me just magically ends up finding someone.. whether hookups or relationships. I go out all the time, and have friends. It just doesn’t happen for me. Literally some of the most socially awkward guys I know who couldn’t hold a conversation with a therapist somehow end up with these great girls… I can’t even get a girl to like me enough to go on a date, let  alone a kiss, and god forbid sex…</p>\n\n<p>I also have MAJOR worries that if one day I find a girl I like, she will be really turned off by the fact that I have no experience with women. Relationship wise, sex wise, etc. It seems that all women want a experienced man, I don’t blame them either.. I think it’s part of the reason why I’m so intimidated to really approach women.</p>\n\n<p>My birthday was last month and I became really depressed thinking about all of this. It is extremely rare for someone to be 24 and still haven’t had any of these things. Am I a lost cause? Maybe it’s just not meant to be for me. It’s really taken a toll on me recently. </p>\n\n<p>Is there anyone out there like me? Am I as much of a loser as I think I am?</p>\n</div><!-- SC_ON -->",
  "score": 118,
  "permalink": "/r/TooAfraidToAsk/comments/pfmbj5/im_a_24_year_old_virgin_who_has_never_had_a/",
  "subreddit": "TooAfraidToAsk",
  "id": "pfmbj5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m 24 years old, a college student, and have lived in Philly my whole life.\nI’ve always had a good amount of friends, both male and female. I’m well liked\nby almost anyone, I’m personable, funny, and sociable. I can have a conversation\nwith just about anyone I meet. As for appearance, I’m about…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は24歳の大学生で、生まれてからずっとフィリーに住んでいます。\n昔から男女問わず友達が多いです。私は誰からも好かれます。\n人当たりがよく、面白くて、社交的なんだ。誰とでも会話をすることができる。\n誰とでも会話ができます。容姿については、私は約...",
      "title": "私は24歳の童貞で、真剣交際や恋愛経験はもちろん、ファーストキスもまだしたことがありません。私は自分が思っているほど負け犬なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我今年24岁，是一名大学生，在费城生活了一辈子。\n我一直都有很多朋友，包括男性和女性。我很喜欢\n几乎任何人都喜欢我，我很有个性，幽默，善于交际。我可以和我遇到的任何人进行交谈\n我几乎可以和我遇到的任何人进行交谈。至于外表，我大约...",
      "title": "我是一个24岁的处女，从来没有过一段严肃的关系，没有经历过爱情，甚至还没有过初吻。我是不是像我认为的那样是个失败者？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我今年24歲，是一名大學生，在費城生活了一輩子。\n我一直都有很多朋友，包括男性和女性。我很喜歡\n幾乎任何人都喜歡我，我很有個性，幽默，善於交際。我可以和我遇到的任何人進行交談\n我幾乎可以和我遇到的任何人進行交談。至於外表，我大約...",
      "title": "我是一個24歲的處女，從來沒有過一段嚴肅的關係，沒有經歷過愛情，甚至還沒有過初吻。我是不是像我認爲的那樣是個失敗者？"
    }
  ]
}