{
  "author": "XorFish",
  "the_new_excerpt": "This is a good video if you think you want to invest in ARK funds.\n\nThere have been plenty of funds that did at some point did well. The question is\nif they continue to do so. What does history and the academic research tell us\nabout such funds?\n\n> Seeing people around you pouring money into a hot…",
  "original_created_utc": 1614432135,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "如果你认为你想投资ARK基金，这是一个很好的视频。\n\n已经有很多基金，确实在某些时候做得很好。问题是\n如果他们继续这样做。历史和学术研究告诉我们什么？\n关于此类基金？\n\n> 看到身边的人把钱投进了一个热...",
      "title": "追逐顶级基金经理"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你認爲你想投資ARK基金，這是一個很好的視頻。\n\n已經有很多基金，確實在某些時候做得很好。問題是\n如果他們繼續這樣做。歷史和學術研究告訴我們什麼？\n關於此類基金？\n\n> 看到身邊的人把錢投進了一個熱...",
      "title": "追逐頂級基金經理"
    }
  ],
  "title": "Chasing Top Fund Managers",
  "created_utc": 1614449674,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is a good video if you think you want to invest in ARK funds.</p>\n\n<p>There have been plenty of funds that did at some point did well. The question is if they continue to do so. What does history and the academic research tell us about such funds?</p>\n\n<blockquote>\n<p>Seeing people around you pouring money into a hot fund that only seems to get hotter can make sticking with any previously well-thought-out investing strategy difficult. As if your diversified portfolio only returned 10% last year when you could have earned 200% in the best fund. While each hot fund manager will seem brilliant at their peak, the phenomenon of star fund managers, including their powerful narratives, huge returns, and media adoration, is nothing new, and it’s not a story that tends to end well for investors.</p>\n</blockquote>\n\n<p><a href=\"https://www.youtube.com/watch?v=p6HrepdLSu4\">https://www.youtube.com/watch?v=p6HrepdLSu4</a></p>\n</div><!-- SC_ON -->",
  "score": 130,
  "permalink": "/r/investing/comments/lto0qc/chasing_top_fund_managers/",
  "subreddit": "investing",
  "id": "lto0qc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937740750
}