{
  "author": "Mizzick",
  "original_created_utc": 1645987468,
  "title": "Does eating pussy always taste like hell?",
  "created_utc": 1645996628,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So.. yeah. Giving head to my girl is okay, but becomes significantly worse when my tongue breaches the inside of her vagina. It&amp;#39;s tolerable when I&amp;#39;m playing with the lips and clip, but as soon as she starts opening up and my tongue grazes anything else I find it disgusting, salty, mucousy, mess. &lt;/p&gt;\n\n&lt;p&gt;Is this the same with all women? Am I being immature? Is my girlfriend not washing down there  , properly? It would be helpful to know that everyone goes through this.&lt;/p&gt;\n\n&lt;p&gt;We 69 the other day and I had less control of where my tongue was hitting, all while staring at her brown eye, and it killed the mood so hard I&amp;#39;m still trying to recover from it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 211,
  "permalink": "/r/TooAfraidToAsk/comments/t2usme/does_eating_pussy_always_taste_like_hell/",
  "subreddit": "TooAfraidToAsk",
  "id": "t2usme",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So.. yeah. Giving head to my girl is okay, but becomes significantly worse when\nmy tongue breaches the inside of her vagina. It's tolerable when I'm playing\nwith the lips and clip, but as soon as she starts opening up and my tongue\ngrazes anything else I find it disgusting, salty, mucousy,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そう...そう 俺の女に頭突きするのはいいんだが、かなり悪くなるのは\n舌で膣内を刺激する。弄っているときは我慢できるのですが\n唇とクリップで、しかし、彼女が開き始めるとすぐに私の舌が\nそれ以外の部分に触れると、塩辛い、粘液質、などなど、嫌な感じがするんです。",
      "title": "マンコを食べるといつも地獄の味がするのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以......是的。给我的女孩头是好的，但当我的舌头进入她的阴道时，情况就会明显恶化。\n但当我的舌头进入她的阴道内部时，情况就会明显恶化。当我玩弄嘴唇和夹子时，还可以忍受。\n但一旦她开始开放，我的舌头就会擦到其他地方。\n一旦她开始开放，我的舌头擦过其他地方，我就觉得很恶心，有咸味，有粘液，...",
      "title": "吃阴部的味道总是像地狱一样吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以......是的。給我的女孩頭是好的，但當我的舌頭進入她的陰道時，情況就會明顯惡化。\n但當我的舌頭進入她的陰道內部時，情況就會明顯惡化。當我玩弄嘴脣和夾子時，還可以忍受。\n但一旦她開始開放，我的舌頭就會擦到其他地方。\n一旦她開始開放，我的舌頭擦過其他地方，我就覺得很噁心，有鹹味，有粘液，...",
      "title": "喫陰部的味道總是像地獄一樣嗎？"
    }
  ]
}