{
  "author": "dkbowl02",
  "original_created_utc": 1632850499,
  "title": "Whenever DIABLO II starts play to earn, that’s my final days",
  "created_utc": 1632922241,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Yep. The moment that Blizzard entertainment looks up from the table and realizes that then can make soo much money from NFt markets and blockchain, I’m done for.  </p>\n\n<p>I will spend every waking moment doing Mephisto Runs and Baal runs.  I’ll literally live in the secret Cow level and collect Wirts leg.<br/>\nI’ll chase deckard Cain all over Tristram for a couple SOJs.  A Windforce NFT would be totally rockin !</p>\n\n<p>Thankfully they haven’t jumped into that market yet, and I haven’t bought the Remasterd Diablo 2 game yet.  Hopefully I won’t have too. It will be the end of me.  </p>\n\n<p>Anyone else spend their teens playing the shit out of those games?  I even tried EverQuest and Wow for a bit.  Those games would be dangerous if they were utilizing NfTs.   I’d be a millionaire by now.   </p>\n\n<p>That’s my rant for the day. Thanks for your time. Lol</p>\n</div><!-- SC_ON -->",
  "score": 166,
  "permalink": "/r/CryptoCurrency/comments/pxbhh4/whenever_diablo_ii_starts_play_to_earn_thats_my/",
  "subreddit": "CryptoCurrency",
  "id": "pxbhh4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Yep. The moment that Blizzard entertainment looks up from the table and realizes\nthat then can make soo much money from NFt markets and blockchain, I’m done for.\n\nI will spend every waking moment doing Mephisto Runs and Baal runs. I’ll\nliterally live in the secret Cow level and collect Wirts…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "うん。Blizzard Entertainmentがテーブルから顔を上げた瞬間に、「このゲームは大金を稼げる」と気づく。\nNFt市場やブロックチェーンで大金を稼げることに気付いた瞬間、俺は終わりだ。\n\n起きている間中、Mephisto RunとBaal Runをして過ごすことになるだろう。私は\n文字通り秘密の牛のレベルに住んで、Wirtsを集めます...",
      "title": "DIABLO IIが稼げるようになったら、それが私の最後の日です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "是的。当暴雪娱乐公司从桌子上抬起头并意识到\n能从NFt市场和区块链中赚到这么多钱，我就完蛋了。\n\n我将把每一个清醒的时刻都用来做Mephisto Runs和Baal Runs。我将\n我真的会住在秘密的 \"牛 \"层，收集 \"羊毛\"...。",
      "title": "每当DIABLO II开始播放赚取，那就是我最后的日子。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "是的。當暴雪娛樂公司從桌子上擡起頭並意識到\n能從NFt市場和區塊鏈中賺到這麼多錢，我就完蛋了。\n\n我將把每一個清醒的時刻都用來做Mephisto Runs和Baal Runs。我將\n我真的會住在祕密的 \"牛 \"層，收集 \"羊毛\"...。",
      "title": "每當DIABLO II開始播放賺取，那就是我最後的日子。"
    }
  ]
}