{
  "author": "chiran1234",
  "original_created_utc": 1633268969,
  "title": "How to increase your local audience reach in less than a day's work",
  "created_utc": 1633311493,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey there <a href=\"/r/SideProject\">r/SideProject</a></p>\n\n<p>Every now and then I do a full-on guide for small businesses on matters relating to SEO and Digital Marketing. This one is going to be a bit long but trust me when I say that you can tackle the majority of the points I am going to discuss within a day. I tested all of the points I am going to discuss and I&#39;ve seen results varying from 200% to up to 350% increase on local audience sales within the first month.</p>\n\n<p><strong><em>As by the rules I will not enclose any URLs to my personal website.</em></strong></p>\n\n<p>Since the original article is around 20 pages long I will try to minimize the contents to make it more readable for you. If you have any questions please feel free to ask them in the comments below and I will do my best to answer them all.</p>\n\n<p>First some statistics -</p>\n\n<ul>\n<li>46% of all Google searches are local-related searches</li>\n<li>78% of local related searches result in offline conversions </li>\n<li>88% of customers call or visit a store within a day of searching from their mobile device</li>\n<li>72% of users who performed a Google search visited a store within 8km of where they performed the search</li>\n<li>56% of local businesses have not claimed their Google My Business (GMB)</li>\n</ul>\n\n<p>Few things you are going to learn from this -</p>\n\n<ul>\n<li>How to claim your “Google My Business” profile and optimize it to always comes first in Search Engine Result Pages</li>\n<li>How to claim your Bing for Business profile</li>\n<li>What is important to have on your website (or how to create one if you don’t have one yet)</li>\n<li>How to build local links pointing to your business (with examples of proven techniques used by me)</li>\n<li>What NAP is, why it’s important, and how to keep it updated in multiple locations with ease.</li>\n<li>How Google ranks local businesses </li>\n<li>and many more little bits and pieces that will help you and your business succeed</li>\n</ul>\n\n<p>Step 1 - Claim your &quot;Google My Business&quot;</p>\n\n<p>Claiming your “<a href=\"https://www.google.com.au/business/sign-up/index.html\">Google My Business</a>” (GMB) is the most significant step you can take today to improve your local SEO strategy. Businesses that claim their GMB have increased chances of appearing in local searches and Google Maps. </p>\n\n<p>I have a full step by step guide on how to claim your GMB in the original article but in order to make this short I will leave this part out. The link above is really intuitive and you won&#39;t have any trouble following through the Google Wizard. If you do please post your questions below.</p>\n\n<p>Step 2 - Picking the correct category in GMB</p>\n\n<p>Picking the right category might sound a bit low value but it&#39;s one of the most important factors when it comes to local SEO as well as the number of categories you are going to use. Make sure to pick as few as possible (one would work best) and as close to your industry as possible. Google provides a vast amount of categories that you could choose from.</p>\n\n<blockquote>\n<p><em>Use as few categories as possible to describe your overall core business from the provided list.Choose categories that are as specific as possible, but representative of your main business.Do not use categories solely as keywords or to describe attributes of your business.Do not use categories that pertain to other businesses that are nearby or related, such as a business physically contained within your business or an entity that contains your business.</em><a href=\"https://support.google.com/business/answer/3038177?hl=en\"><em>https://support.google.com/business/answer/3038177?hl=en</em></a></p>\n</blockquote>\n\n<p>Step 3 - Add Photos &amp; Videos</p>\n\n<p>It feels weird to say it since it&#39;s 2020 and everyone is carrying a smartphone in their pocket but visual assets such as Photos and Videos, greatly increase CTR (click-through rates). Don&#39;t use stock photos or videos, you don&#39;t have to be a photographer or digital assets specialists. All you need to do is capture a few photos and a video every now and then and post them within your GMB and social media.</p>\n\n<p>Sound is not important. <a href=\"https://digiday.com/media/silent-world-facebook-video/\">Studies</a> show that more than 80% of people watching videos on mobile have their phones on mute.</p>\n\n<p>Step 4 - Accurate Hours</p>\n\n<p>Keep your hours accurate. You won&#39;t rank higher if you set your hours to something extreme, and users won&#39;t really appreciate traveling to your location to find your doors shut. Keep your hours accurate on holidays, weekends, or even... a pandemic. Google gives you the tools to do so.</p>\n\n<p>Step 5 - Bing Places for Business</p>\n\n<p>Not everyone appreciates Bing but no matter your personal preferences make sure to utilize the tools they give for local businesses. Bing controls a reasonable amount of the search engine share. Not to mention that statistics show that it&#39;s been used by higher-income people, professionals, and a lot of marketers. You could change your entire business if you come up first at Bing and that is what really matters. Check out some statistics <a href=\"https://about.ads.microsoft.com/en-us/insights/planning-tools/microsoft-search-network-data?Market=GLOBAL\">here</a>.</p>\n\n<p>Step 6 - Number of positive reviews</p>\n\n<p>It&#39;s simple really. The number of positive reviews matter for rankings. Try to always give 110% to your clients/users and kindly remind them to leave a review if they enjoyed your service. Keep in mind that it’s against Google’s guidelines to ask users to provide a positive review in exchange for services or products. Reviews must be genuine and from real users.</p>\n\n<p>Step 7 - Respond to reviews (positive and negative)</p>\n\n<p>There is not a lot to add here. Google has stated that they promote local businesses that respond to reviews. Positive and negative. I would argue that replying to the negative sentiment reviews have a greater effect both on engines and on users. I don&#39;t appreciate reading only good reviews with replies and bad reviews with no reply from the owner. It always smells fishy.</p>\n\n<p>Step 8 - Social Media for Business</p>\n\n<p>It&#39;s essential for your business to be present everywhere your users are. If you have a local cafe then maybe Instagram and Facebook could work better for you and if you are a lawyer then maybe Facebook and Linkedin could work best but no matter what you do you must create those profiles today.</p>\n\n<p>People are searching in different ways and seeing your brand when they search in a couple of places increases the trust they have with your name.</p>\n\n<p>Not to mention that engines pick up social signals and boost your local rankings!</p>\n\n<p>Here are a few pages that will be useful for you in order to create business profiles for known social media platforms</p>\n\n<ul>\n<li><a href=\"https://www.facebook.com/help/104002523024878\">Facebook Business Page</a></li>\n<li><a href=\"https://help.instagram.com/502981923235522\">Instagram Business Profile</a></li>\n<li><a href=\"https://business.twitter.com/en/basics/create-a-twitter-business-profile.html\">Twitter Business Profile</a></li>\n<li><a href=\"https://www.linkedin.com/help/linkedin/answer/710/create-a-linkedin-page?lang=en\">LinkedIn Business Profile</a></li>\n</ul>\n\n<p>Step 9 - Consistent NAP</p>\n\n<p>This one is a vital step. You need to make sure that the NAP or else Name, Address, Phone is always up to date and matching on all sites. Google will &quot;penalize&quot; your rankings if they find inconsistent NAP on the sites you create for your business. There are tools that can help you with your local presence if you search for them. I will not advertise them in this article.</p>\n\n<p>Conclusion</p>\n\n<p>These are a few steps that you can literally take today within a few hours without breaking a sweat, to increase your organic local reach. There are obviously more in-depth technical key factors as well but they are less crucial than the simple ones that I added above.</p>\n\n<p>Check <a href=\"https://www.reddit.com/user/samvirtualservices/comments/ofek3i/the_single_most_badass_executive_assistantonline/\">this post</a> out if you want to make your &quot;<strong>4 hour work week</strong>&quot; dream a reality.</p>\n\n<p>I hope you found this useful and you are willing to give this a thumbs up for more people to see.</p>\n</div><!-- SC_ON -->",
  "score": 5,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/0s2Df4T4TUFKXNOV1Z2ZUj4VuvImsOXFSnBhFzZexiE.jpg?auto=webp&s=7b56c44cf18abe60d8e937a12621a949c307ac7d",
          "width": 516,
          "height": 604
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/0s2Df4T4TUFKXNOV1Z2ZUj4VuvImsOXFSnBhFzZexiE.jpg?width=108&crop=smart&auto=webp&s=8e9c5bb6e07fe57ad17474e3387bf69a747ee908",
            "width": 108,
            "height": 126
          },
          {
            "url": "https://external-preview.redd.it/0s2Df4T4TUFKXNOV1Z2ZUj4VuvImsOXFSnBhFzZexiE.jpg?width=216&crop=smart&auto=webp&s=200d50348aa036f0461961f9004f13106453885c",
            "width": 216,
            "height": 252
          },
          {
            "url": "https://external-preview.redd.it/0s2Df4T4TUFKXNOV1Z2ZUj4VuvImsOXFSnBhFzZexiE.jpg?width=320&crop=smart&auto=webp&s=8038a5c4a9a162d6638134d3f1b9ec7053bfc991",
            "width": 320,
            "height": 374
          }
        ],
        "variants": {},
        "id": "nEQTQvUOrkP3m_RnjxG5mjga3CMwDRIDvF9H8KZPS0A"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/SideProject/comments/q0i3vu/how_to_increase_your_local_audience_reach_in_less/",
  "subreddit": "SideProject",
  "id": "q0i3vu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hey there r/SideProject [/r/SideProject]\n\nEvery now and then I do a full-on guide for small businesses on matters relating\nto SEO and Digital Marketing. This one is going to be a bit long but trust me\nwhen I say that you can tackle the majority of the points I am going to discuss\nwithin a day. I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは、r/SideProject [/r/SideProject]です。\n\n時々、私は中小企業のために、SEOとデジタルマーケティングに関連した事項の完全なガイドをしています。\nに関連する事柄について、中小企業のための完全なガイドをしています。このガイドは少し長くなりますが、私を信じてください。\n今回は少し長くなりますが、これから説明するポイントの大半は1日で取り組めます。\n一日で解決できます。I...",
      "title": "1日もかからずにローカルオーディエンスへのリーチを拡大する方法"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嗨，r/SideProject [/r/SideProject] 。\n\n每隔一段时间，我都会为小企业做一个完整的指南，内容涉及与\n指南，其中包括SEO和数字营销。这篇文章会有点长，但请相信我\n当我说，你可以在一天之内解决我将要讨论的大部分问题时\n在一天之内解决。I...",
      "title": "如何在不到一天的时间内提高你的本地受众覆盖率"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嗨，r/SideProject [/r/SideProject] 。\n\n每隔一段時間，我都會爲小企業做一個完整的指南，內容涉及與\n指南，其中包括SEO和數字營銷。這篇文章會有點長，但請相信我\n當我說，你可以在一天之內解決我將要討論的大部分問題時\n在一天之內解決。I...",
      "title": "如何在不到一天的時間內提高你的本地受衆覆蓋率"
    }
  ]
}