{
  "author": "Supercharmeleon",
  "original_created_utc": 1647781368,
  "title": "Trust me, you don't want to be the 'crypto guy' your friend group or family.",
  "created_utc": 1647847893,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is just my experience, but I&amp;#39;ve found that it&amp;#39;s usually better to keep your crypto leaning to yourself, and not discuss it with your close friends and family. Being the &amp;#39;crypto guy&amp;#39; is a good way to become the loser or the annoying guy in the group.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know what it is about crypto that makes people who devote their whole persona and personality to it such annoying douchebags. It&amp;#39;s much more prominent with NFT guys online, but it&amp;#39;s true for crypto as well. It just gives you a bad name, and I don&amp;#39;t think being the crypto guy is conductive to anything good in social situations. It just makes you look like a loser, and more often than not you are one if you make crypto your whole personality.&lt;/p&gt;\n\n&lt;p&gt;Just my two cents. Some people could really stand to calm down a bit with crypto as their personality.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 303,
  "permalink": "/r/CryptoCurrency/comments/tikl6x/trust_me_you_dont_want_to_be_the_crypto_guy_your/",
  "subreddit": "CryptoCurrency",
  "id": "tikl6x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "This is just my experience, but I've found that it's usually better to keep your\ncrypto leaning to yourself, and not discuss it with your close friends and\nfamily. Being the 'crypto guy' is a good way to become the loser or the annoying\nguy in the group.\n\nI don't know what it is about crypto that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これはあくまでも私の経験ですが、通常、自分のことを\n暗号に傾倒していることは、自分自身の中だけに留めておき、親しい友人には相談しないようにしましょう。\n家族 暗号の男」になることは、敗者や迷惑な存在になる良い方法です。\nグループ内の人\n\n暗号の何がいいのかわからない・・・。",
      "title": "友人や家族の中で「暗号に弱い人」になってはいけないと思うのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这只是我的经验，但我发现，通常情况下，最好将你的\n倾向于自己，而不是与你的亲密朋友和家人讨论它。\n家人讨论。作为一个 \"加密货币的人 \"是成为团体中的失败者或讨厌的人的好方法。\n的人。\n\n我不知道加密货币是什么...",
      "title": "相信我，你不会想成为你的朋友圈或家庭的 \"加密人\"。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這只是我的經驗，但我發現，通常情況下，最好將你的\n傾向於自己，而不是與你的親密朋友和家人討論它。\n家人討論。作爲一個 \"加密貨幣的人 \"是成爲團體中的失敗者或討厭的人的好方法。\n的人。\n\n我不知道加密貨幣是什麼...",
      "title": "相信我，你不會想成爲你的朋友圈或家庭的 \"加密人\"。"
    }
  ]
}