{
  "author": "traderbabe22",
  "the_new_excerpt": "TL/DR: Forbes can suck it. This is my rant. NOT FINANCIAL ADVICE\n\nI've reconsidered the Forbes article that came out Friday. The more I think\nabout it, the more pissed I've become about the subtle, manipulative, and just\nplain evil condescension.\n\nThe writer sounded like they were writing a piece…",
  "original_created_utc": 1615168808,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "TL/DR：福布斯可以吸它。这是我的咆哮。不是金融建议\n\n我重新考虑了周五出炉的福布斯文章。我越想\n关于它，我越是生气的微妙，操纵，和只是\n纯粹的邪恶的高傲。\n\n作者听起来像是在写一篇... ...",
      "title": "福布斯文章。WTF？我是掠夺者吗？不，我是一只熊妈妈。我是一个熊妈妈，只想为她的孩子们提供，并偶尔为自己挥霍一下。这要求是不是太高了????。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "TL/DR：福布斯可以吸它。這是我的咆哮。不是金融建議\n\n我重新考慮了週五出爐的福布斯文章。我越想\n關於它，我越是生氣的微妙，操縱，和只是\n純粹的邪惡的高傲。\n\n作者聽起來像是在寫一篇... ...",
      "title": "福布斯文章。WTF？我是掠奪者嗎？不，我是一隻熊媽媽。我是一個熊媽媽，只想爲她的孩子們提供，並偶爾爲自己揮霍一下。這要求是不是太高了????。"
    }
  ],
  "title": "Forbes Article: WTF?? Am I a Predator??? NO. I'm a Momma Bear Who Just wants to Provide For Her Kids, and Splurge on herself once in a while. Is that too much to ask????",
  "created_utc": 1615185268,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>TL/DR: Forbes can suck it. This is my rant. NOT FINANCIAL ADVICE</p>\n\n<p>I&#39;ve reconsidered the Forbes article that came out Friday. The more I think about it, the more pissed I&#39;ve become about the subtle, manipulative, and just plain evil condescension.</p>\n\n<p>The writer sounded like they were writing a piece complimenting us on our astute comprehension of the numbers. Basically said we weren&#39;t just the ignorant peasants that many experts are trying to portray.</p>\n\n<p>Well, it was just another headfake, y&#39;all. The writer was framing US as the Goliath, not as the underdog, as the David fighting AGAINST the Goliath.</p>\n\n<p>Its disgusting. These media shills, including FORBES, are just spewing their own GME panic propaganda. And all the so called &#39;experts&#39; that say retail investors are &#39;colluding together&#39; have lost their souls.</p>\n\n<p>When corrupt leaders at Big Hedgies break the law, and swindle the whole world out of their hard earned dollars...when THEY actually collude to destroy companies, and drive down their stock into bankruptcy for their own profit.....guess what. Crickets.</p>\n\n<p>NOBODY says or does anything about it. Not the media, not the SEC, not the FBI, not the DTCC, an definitely not Congress. The ONLY reason anyone is &#39;looking&#39; at it, is because us regular people are now AWAKE to the manipulations and the corruption in every segment of our government and financial sectors. They have to &#39;look like&#39; they are interested in holding somebody accountable. But they aren&#39;t really going after the hedgies. They are going after YOU. ME. DFV. Anyone who dares pull back the curtain.</p>\n\n<p>But when regular people see a good opportunity, and want to invest, LEGALLY, they lose their shit.</p>\n\n<p>I don&#39;t know ANY of you. I don&#39;t take advice from anyone here. I read and research and then make my own decisions.</p>\n\n<p>But dammit, I see a good opportunity, so I&#39;ve jumped in the deep end of the pool. I&#39;ve jumped on the proverbial train. And I will ride it to the end of the line.</p>\n\n<p>I&#39;m gonna be honest, I&#39;m just tired. I&#39;m tired of living on the edge of broke for years.</p>\n\n<p>I just want to be able to finally get my kid braces. To buy myself my good vehicle, or at least fix the one we have. It has 148K miles and is definitely dont feel safe to travel on roadtrips. I dont even like to drive across Houston, just in case the engine light goes on again.</p>\n\n<p>My credit is not great, so I cant finance a car. (Don&#39;t say it. I&#39;ve already tried. Twice in 18 months. Every time I try again, it tanks my credit further) And since I&#39;m self employed, I don&#39;t have a JOB that pays me a regular paycheck. Therefore the &quot;Your job is your credit&quot; financing isnt an option either. So YA, Momma wants a car.</p>\n\n<p>I want to take a family vacation. Hell I want to take a weekend with my husband every once in a while.</p>\n\n<p>I want to do fun things, and important things like help my kids go to college, IF they want to.</p>\n\n<p>I want to be able to give a $100 tip to the struggling server, or even provide a fabulous Christmas for some family in need.</p>\n\n<p>If this makes me a greedy Bitch, I guess I&#39;m a greedy bitch.</p>\n\n<p>But it DOESNT make me a criminal. It DOESNT mean I am &#39;scheming&#39; to manipulate the stock market. OR that I am part of a &quot;premeditated, predatory take-down of a cornered and defenseless counterparty.&quot; as FORBES claims. ell, WE are the cornered, defenseless counterparty, NOT the multi BILLION DOLLAR Hedge funds!</p>\n\n<p>Are you friggin&#39; KIDDING ME??? My shares, and even ALL the shares we hold as retail investors do NOT have the power to MOVE the market. The BIG institutions are the ones with the power to actually tank the stock or lift the price.</p>\n\n<p>WE, the reddit investors, are just little ants on a log; riding the roaring waters of the market, hanging on for dear life! And if we HANG ON, then we can make it to the end of this crazy ride, safe and DRY.</p>\n\n<p>We SEE the end of the journey and are willing to take that journey. Who are these people to say that we are greedy for just jumping on board and risking our money, even maybe our lives, to arrive at the end of that beautiful run?</p>\n\n<p>Who are they to say we are greedy for just tagging along, for playing THEIR game, the RIGHT way?</p>\n\n<p>Truth is, these hedge funds hold the investments of millions of innocent investors in their hands. And THEY are the ones who have risked these people&#39;s fortunes, their very LIVES, playing a rigged game. THEIR greed and corruption has been revealed.</p>\n\n<p>And I&#39;m sorry if they are freaking out. But its just what happens when you GET CAUGHT.</p>\n\n<p>TO BE CLEAR: My goal is not to crash the market or to destroy hedge funds, even tho I think some people should go to jail for their illegal activities.</p>\n\n<p>I just want to ride the rapids. To take the risk and get the payout I know is coming. Not because I know I&#39;m so deserving, but because I know the numbers don&#39;t lie. That&#39;s not criminal. Its not even shady. Its SMART.</p>\n\n<p>I will end up in a calm, peaceful lake, surrounded by big beautiful mountains. I will finally be able to enjoy the view. I will send my kids to college, buy those braces, buy safe car, and even go on a beautiful vacation.</p>\n\n<p>And hey Forbes, hey Cramer. Hey all you crooks investigating DFV.....listen up.</p>\n\n<p>THATS not greedy. Its INEVITABLE.</p>\n\n<p>(NOT FINANCIAL ADVICE. DO WHATEVER THE HELL YOU WANNA DO. I LIKE THE STOCK)</p>\n\n<p>EDIT:</p>\n\n<p>Seriously tho. We are bonded together by a common goal and common struggles. No matter our color, gender, race, religion or political ideology, the real war is against evil and corruption. For the right to pursue our own destinies and our own version of happiness.</p>\n\n<p>&#x200B;</p>\n\n<p>&quot;We wrestle not against flesh and blood, but against principalities, against powers, against the rulers of the darkness of this world, against spiritual wickedness in high places.&quot; - Ephesians 6:12 KJV</p>\n</div><!-- SC_ON -->",
  "score": 7362,
  "permalink": "/r/wallstreetbets/comments/m057ab/forbes_article_wtf_am_i_a_predator_no_im_a_momma/",
  "subreddit": "wallstreetbets",
  "id": "m057ab",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542586484
}