{
  "author": "kaless_",
  "original_created_utc": 1629306818,
  "title": "what is it about coronavirus that we have to keep getting vaccine shots?",
  "created_utc": 1629335117,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I hope this doesn&#39;t coming all &quot;covid ain&#39;t real&quot;-y. I had covid, I got my vaccine shots, I wear my mask n wash my hands all that stuff. but I am no scientist, and I&#39;m curious what makes this virus so different from viruses such as polio tthat you only get a shot for once a lifetime, that we have to keep getting another shot for covid, a third or possibly a fourth in the future? is it the DNA, is it because it&#39;s a newer virus?</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/askscience/comments/p6vlt9/what_is_it_about_coronavirus_that_we_have_to_keep/",
  "subreddit": "askscience",
  "id": "p6vlt9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I hope this doesn't coming all \"covid ain't real\"-y. I had covid, I got my\nvaccine shots, I wear my mask n wash my hands all that stuff. but I am no\nscientist, and I'm curious what makes this virus so different from viruses such\nas polio tthat you only get a shot for once a lifetime, that we have to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これが「コヴィッドは本物じゃない」ということにならなければいいのですが。私はコヴィドに感染し、ワクチンを接種しました。\nワクチンも打ったし、マスクも手洗いもしている。\nしかし、私は科学者ではありませんし、このウイルスがポリオやスズキなどのウイルスと何が違うのか興味があります。\nポリオのように一生に一度しか予防接種を受けられないようなウイルスとは何が違うのか、私たちは・・・。",
      "title": "コロナウイルスは、なぜワクチンを打ち続けなければならないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我希望这不会成为 \"科维德不是真的 \"的说法。我得过Covid，打过疫苗针，戴过口罩，洗过手。\n疫苗注射，我戴口罩和洗手，但我不是科学家。\n但我不是科学家，我很好奇这种病毒与脊髓灰质炎等病毒有什么不同？\n如小儿麻痹症，你一生只打一次针，我们必须...",
      "title": "冠状病毒是什么让我们不得不继续注射疫苗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我希望這不會成爲 \"科維德不是真的 \"的說法。我得過Covid，打過疫苗針，戴過口罩，洗過手。\n疫苗注射，我戴口罩和洗手，但我不是科學家。\n但我不是科學家，我很好奇這種病毒與脊髓灰質炎等病毒有什麼不同？\n如小兒麻痹症，你一生只打一次針，我們必須...",
      "title": "冠狀病毒是什麼讓我們不得不繼續注射疫苗？"
    }
  ]
}