{
  "author": "shlammyjohnson",
  "original_created_utc": 1634316174,
  "title": "Crypto is going to go parabolic soon and I'm not sure everyone is ready. Please have a plan.",
  "created_utc": 1634344719,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Would you be ready to make some difficult financial decisions in a few months after your investment potentially returns 10x what you initially put in?</p>\n\n<p>Is it actually safe sitting there wherever you&#39;ve parked it? </p>\n\n<p>There are an incredible amount of scams out there especially when the crypto market is pumping up. Do you think your holdings are secure sitting around on your phone or some seedy &quot;high yield&quot; site?</p>\n\n<p>Are you informed on your local tax laws and regulations regarding capital gains?</p>\n\n<p>You don&#39;t want the tax man knocking at your door a year or so after you potentially made quite a bit of money (and they will want interest)</p>\n\n<p>Figure out what things will be the best for you to invest in your life. It could be a car, or maybe a house, or maybe money for school and college or a trade.</p>\n\n<p>I want to see the majority of you here succeed but it can be quite daunting controlling your own money where if you misstep it could all go away instantly.</p>\n\n<p>I see us testing new ATH&#39;s like crazy and those &quot;insane&quot; price predictions may not look so wild in a couple months. I&#39;ve been in the space for a long time and this run has a lot of room to grow especially considering what&#39;s happening in the wider legacy markets and housing.</p>\n\n<p>Stay informed and smart friends! There are some great things cooking up for you if you stay level headed and make a plan.</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/q8sbh4/crypto_is_going_to_go_parabolic_soon_and_im_not/",
  "subreddit": "CryptoCurrency",
  "id": "q8sbh4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Would you be ready to make some difficult financial decisions in a few months\nafter your investment potentially returns 10x what you initially put in?\n\nIs it actually safe sitting there wherever you've parked it?\n\nThere are an incredible amount of scams out there especially when the crypto\nmarket is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "数ヶ月後には、当初の投資額の10倍のリターンが得られる可能性があるのに\nあなたの投資が10倍になった後、数ヶ月後に難しい決断をする準備ができていますか？\n\nどこに保管していても本当に安全なのでしょうか？\n\n世の中には信じられないほど多くの詐欺があります。\n特に暗号化市場が...",
      "title": "Cryptoはすぐにパラボリックになるだろうし、みんなが準備できているかどうかわからない。計画を立ててください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你是否准备好在几个月内做出一些困难的财务决定？\n在你的投资有可能获得10倍于你最初投入的回报之后，你是否准备好做出一些艰难的财务决定？\n\n无论你把它停在哪里，它真的安全吗？\n\n外面有大量的骗局，特别是当加密货币\n市场的时候更是如此。",
      "title": "加密货币很快就会出现抛物线，我不确定每个人都已经准备好了。请有一个计划。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你是否準備好在幾個月內做出一些困難的財務決定？\n在你的投資有可能獲得10倍於你最初投入的回報之後，你是否準備好做出一些艱難的財務決定？\n\n無論你把它停在哪裏，它真的安全嗎？\n\n外面有大量的騙局，特別是當加密貨幣\n市場的時候更是如此。",
      "title": "加密貨幣很快就會出現拋物線，我不確定每個人都已經準備好了。請有一個計劃。"
    }
  ]
}