{
  "author": "andysvillage",
  "the_new_excerpt": "I am in the US. Wouldn’t voting on actual policies mean more instead of these\nwack job politicians. For example, why not have get it down to two or three\ndifferent options for major talking points and let the people vote on it? This\ndoesn’t seem like a democracy if we don’t even get a say at the…",
  "original_created_utc": 1621913807,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はアメリカにいます。このようなおかしな政治家ではなく、実際の政策に基づいて投票することはもっと意味があるのではないでしょうか。\n実際の政策に投票したほうがいいのではないでしょうか。例えば、主要な論点を2つか3つの選択肢に絞って\n国民に投票してもらってはどうでしょうか？これでは\n私たちに発言権がないなんて、民主主義とは思えません。",
      "title": "なぜ私たちは政治家に投票するのか、なぜ実際の政策ではなく、政治家に投票するのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是在美国。对实际政策的投票不是更有意义，而不是这些\n而不是这些古怪的政客。比如说，为什么不把主要的谈话要点压缩到两到三个\n不同的选择，然后让人民投票决定。这\n如果我们甚至没有发言权，这就不像是一个民主。",
      "title": "我们为什么要投票给政治家，为什么不投票给实际的政策？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是在美國。對實際政策的投票不是更有意義，而不是這些\n而不是這些古怪的政客。比如說，爲什麼不把主要的談話要點壓縮到兩到三個\n不同的選擇，然後讓人民投票決定。這\n如果我們甚至沒有發言權，這就不像是一個民主。",
      "title": "我們爲什麼要投票給政治家，爲什麼不投票給實際的政策？"
    }
  ],
  "title": "Why do we vote for politicians, why not the actual policies?",
  "created_utc": 1621931031,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am in the US. Wouldn’t voting on actual policies mean more instead of these wack job politicians. For example, why not have get it down to two or three different options for major talking points and let the people vote on it? This doesn’t seem like a democracy if we don’t even get a say at the policies that are put in place.</p>\n\n<p>EDIT:  I meant 2-3 different laws for every major talking point. If that makes more sense. So like 3 law options to vote for for gun control. And so on…</p>\n</div><!-- SC_ON -->",
  "score": 115,
  "permalink": "/r/NoStupidQuestions/comments/nkg6qj/why_do_we_vote_for_politicians_why_not_the_actual/",
  "subreddit": "NoStupidQuestions",
  "id": "nkg6qj",
  "is_self": true,
  "media": null,
  "is_video": false
}