{
  "author": "Iestwyn",
  "original_created_utc": 1635524928,
  "title": "The fantasy trope of a \"city guard\" was largely nonexistent during the European Middle Ages; was there a premodern society that DID have city guards?",
  "created_utc": 1635537353,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>To be clear: the form of the trope that I&#39;m referring to describes a primitive professional police force that would enforce civil and criminal laws. This is usually in concert with jails and a judiciary system. Fairness and corruption vary between settings, but these are the basic considerations I&#39;m thinking of.</p>\n\n<p>I am <em>not</em> a scholar, but to my knowledge, these sorts of things didn&#39;t exist at all in the European Middle Ages. Villages had a general tradition called the &quot;hue and cry,&quot; where someone in distress would make an undefined call and everyone nearby was duty-bound to respond and deal with the assailant. Cities might have something vaguely similar, but this was mostly to keep violent incidents from escalating and not to enforce common laws. Part of the issue was that there wasn&#39;t a defined concept of the rule of law, and most laws were civil (harm against another person) rather than criminal (harm against society in general).</p>\n\n<p>Again, the previous paragraph is based on my limited research; I am very much an amateur.</p>\n\n<p>What I&#39;m wondering is whether the trope described in the first paragraph existed <em>anywhere</em> in the premodern world. The Roman Empire? Han China? The American Empires? There are lots of civilizations that I don&#39;t know about, and I wouldn&#39;t be surprised if I&#39;ve missed something.</p>\n\n<p>Thanks in advance!</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/AskHistorians/comments/qignt7/the_fantasy_trope_of_a_city_guard_was_largely/",
  "subreddit": "AskHistorians",
  "id": "qignt7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "To be clear: the form of the trope that I'm referring to describes a primitive\nprofessional police force that would enforce civil and criminal laws. This is\nusually in concert with jails and a judiciary system. Fairness and corruption\nvary between settings, but these are the basic considerations I'm…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "はっきりさせておきたいのは、私が言及している形は、原始的な\n市民法や刑法を執行するプロの警察を描いたものです。これは\nこれは通常、刑務所や司法制度と連携しています。公平性と腐敗\n設定によって異なりますが、これらは私が考える基本的な考慮事項です。",
      "title": "ヨーロッパの中世には、「市警」というファンタジーの要素はほとんど存在しませんでしたが、市警が存在した前近代社会はあったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "说白了：我指的是这个套路的形式，描述了一个原始的\n专业警察部队，负责执行民事和刑事法律。这\n通常与监狱和司法系统配合。公平和腐败\n在不同的环境中有所不同，但这些是我的基本考虑。",
      "title": "在欧洲中世纪，\"城市卫士 \"这一幻想特例基本不存在；是否有一个前现代社会确实有城市卫士？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "說白了：我指的是這個套路的形式，描述了一個原始的\n專業警察部隊，負責執行民事和刑事法律。這\n通常與監獄和司法系統配合。公平和腐敗\n在不同的環境中有所不同，但這些是我的基本考慮。",
      "title": "在歐洲中世紀，\"城市衛士 \"這一幻想特例基本不存在；是否有一個前現代社會確實有城市衛士？"
    }
  ]
}