{
  "author": "juststocks",
  "the_new_excerpt": "The New York Stock Exchange on Tuesday set a reference price of $45 for shares\nof U.S. gaming platform Roblox Corp on the eve of its public market debut,\nimplying a market value for the company of around $30 billion. San Mateo,\nCalifornia-based Roblox is among the world's most popular gaming sites…",
  "original_created_utc": 1615349090,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "纽约证券交易所周二将股票的参考价格定为45美元。\n的美国游戏平台Roblox公司在公开市场首发前夕。\n意味着该公司的市场价值约为300亿美元。圣马特奥。\n总部位于加州的Roblox是全球最受欢迎的游戏网站之一... ...",
      "title": "Roblox参考股价定在纽交所首发前的45美元。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "紐約證券交易所週二將股票的參考價格定爲45美元。\n的美國遊戲平臺Roblox公司在公開市場首發前夕。\n意味着該公司的市場價值約爲300億美元。聖馬特奧。\n總部位於加州的Roblox是全球最受歡迎的遊戲網站之一... ...",
      "title": "Roblox參考股價定在紐交所首發前的45美元。"
    }
  ],
  "title": "Roblox reference share price set at $45 ahead NYSE debut",
  "created_utc": 1615358235,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The New York Stock Exchange on Tuesday set a reference price of $45 for shares of U.S. gaming platform Roblox Corp on the eve of its public market debut, implying a market value for the company of around $30 billion. San Mateo, California-based Roblox is among the world&#39;s most popular gaming sites for children and offers a host of games across mobile devices and gaming consoles. The reference price is not an offering price to purchase shares but rather will be a performance benchmark for when Roblox&#39;s stock starts trading on the stock exchange on Wednesday. The opening public price will be determined by buy and sell orders collected by the NYSE from broker-dealers. Roblox has opted to go public through a direct listing rather than a traditional initial public offering (IPO). This means the company is not selling any shares in advance of its market debut, as is the case with IPOs. Direct listings are still relatively rare, though they are becoming increasingly popular way to go public amid criticism that investment banks underwriting IPOs underprice shares being sold to help create a first-day trading &quot;pop&quot; for the benefit of their big trading clients. Reuters reported last week that U.S. grocery delivery app Instacart is considering going public through a direct listing, concerned that it could leave money on the table through an IPO. Roblox said in January it had raised around $520 million in a new Series H private fundraising round in a deal which valued it at $29.5 billion, more than seven times the $4 billion the company was valued at in its Series G round 11 months earlier. U.S. demand for video games has surged as consumers seek home entertainment while living under lockdown measures to curb the spread of COVID-19. - Reuters</p>\n\n<p>**No link to post in this subreddit for some reason so I copied and pasted the article for anyone interested in $RBLX.</p>\n</div><!-- SC_ON -->",
  "score": 1951,
  "permalink": "/r/stocks/comments/m1owvy/roblox_reference_share_price_set_at_45_ahead_nyse/",
  "subreddit": "stocks",
  "id": "m1owvy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542577981
}