{
  "author": "dikgumdur",
  "original_created_utc": 1634585783,
  "title": "China's handling of Bitcoin could easily be the biggest geopolitical blunder of this decade with lasting impacts well into the future",
  "created_utc": 1634608351,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It&#39;s only 2021 and you&#39;ve already got COVID being mishandled, Afghanistan (two decades in the making, to be fair) and China says &quot;Hold my beer.&quot; Amazing. </p>\n\n<p>This isn&#39;t even the first time China has fumbled around with its currency. They were a huge player in the silver market from about 15th to 19th centuries. Then as the world was moving to the gold standard, they insisted on a silver standard, obviously losing on this strategy.</p>\n\n<p>Now China has the most gold reserves in the world by a long shot and intend to roll out and back (perhaps unofficially) their digital Yuan with gold. You can&#39;t fix authoritarian communism; it just ends itself in due course.</p>\n\n<p>Aside from the government officially not holding Bitcoin, of course much of the wealthy and elite class in China has Bitcoin. So you&#39;re leaking money through unofficial channels and you&#39;re driving away your productive and wealthy class by making it known that their wealth is a threat to the state.</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/Bitcoin/comments/qau71u/chinas_handling_of_bitcoin_could_easily_be_the/",
  "subreddit": "Bitcoin",
  "id": "qau71u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It's only 2021 and you've already got COVID being mishandled, Afghanistan (two\ndecades in the making, to be fair) and China says \"Hold my beer.\" Amazing.\n\nThis isn't even the first time China has fumbled around with its currency. They\nwere a huge player in the silver market from about 15th to 19th…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "まだ2021年だというのに、COVIDが誤って処理されたり、アフガニスタン（20年前の話ですが）や中国が「ビールを待ってくれ」と言ったりしています。\n中国は「私のビールを持っていて」と言っています。驚きです。\n\n中国が通貨で失敗したのはこれが初めてではありません。彼らは\n彼らは15日から19日頃まで銀市場で大きな役割を果たしていました。",
      "title": "中国のビットコインへの対応は、この10年で最大の地政学的失策となり、その影響は将来にまで及ぶ可能性があります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "现在只是2021年，你已经有了COVID被错误地处理，阿富汗（公平地说，二十年来\n公平地讲，已经有二十年的时间了），中国说 \"拿着我的啤酒\"。令人惊讶。\n\n这甚至不是中国第一次对其货币进行摸索。他们\n从第15届到第19届，他们在白银市场上是一个巨大的参与者......",
      "title": "中国对比特币的处理可能很容易成为本十年最大的地缘政治失误，并对未来产生持久影响"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "現在只是2021年，你已經有了COVID被錯誤地處理，阿富汗（公平地說，二十年來\n公平地講，已經有二十年的時間了），中國說 \"拿着我的啤酒\"。令人驚訝。\n\n這甚至不是中國第一次對其貨幣進行摸索。他們\n從第15屆到第19屆，他們在白銀市場上是一個巨大的參與者......",
      "title": "中國對比特幣的處理可能很容易成爲本十年最大的地緣政治失誤，並對未來產生持久影響"
    }
  ]
}