{
  "author": "Some1fromReddit",
  "original_created_utc": 1634355712,
  "title": "Without Ethereum, crypto adoption wouldn't be a 10th what it is now.",
  "created_utc": 1634388548,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Likely even <a href=\"/r/cc\">r/cc</a> would only have 300K Max members.  It made possible the glorified ERC-20 token, and protocols to make creating your own crypto stupid cheap. From an investment standpoint. </p>\n\n<p>The amount of shitcoins that used it as tokenized shares for whatever vaporized miracle they were claiming to be apart of is unfathomable.</p>\n\n<p>The quick profits and unimaginable turn around on creating shitcoins drove more hype to create more shitcoins, and the end around caused an explosion of gossip, and rumors that lead to bullrun on crypto.</p>\n\n<p>The machine just didn&#39;t stop there. Smart contracts led to NFTs.   It kept going.</p>\n\n<p>We really owe a big portion of our existence around cryptocurrency to Vitalek Buterin, and the genius investors that helped him make it happen. </p>\n\n<p>.</p>\n</div><!-- SC_ON -->",
  "score": 162,
  "permalink": "/r/CryptoCurrency/comments/q945qy/without_ethereum_crypto_adoption_wouldnt_be_a/",
  "subreddit": "CryptoCurrency",
  "id": "q945qy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Likely even r/cc [/r/cc] would only have 300K Max members. It made possible the\nglorified ERC-20 token, and protocols to make creating your own crypto stupid\ncheap. From an investment standpoint.\n\nThe amount of shitcoins that used it as tokenized shares for whatever vaporized\nmiracle they were…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "おそらくr/cc [/r/cc]でもMax30万人しかいないだろう。それによって可能になったのが\n栄光のERC-20トークンを実現し、独自の暗号を作るためのプロトコルを\n安いです。投資の観点からも。\n\nそれをトークン化された株式として利用したクソコインの量は、気化した何かのために\n奇跡のようなものでした...",
      "title": "イーサリアムがなければ、暗号の普及は今の10分の1もなかったでしょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "可能即使是r/cc [/r/cc]也只有30万的最大成员。它使\n荣耀的ERC-20代币，以及使创建你自己的加密货币的协议变得愚蠢的\n便宜。从投资的角度来看。\n\n使用它作为代币化股份的狗屎币的数量，为任何蒸发的\n奇迹，他们是...",
      "title": "如果没有以太坊，加密货币的采用就不会是现在的十分之一。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "可能即使是r/cc [/r/cc]也只有30萬的最大成員。它使\n榮耀的ERC-20代幣，以及使創建你自己的加密貨幣的協議變得愚蠢的\n便宜。從投資的角度來看。\n\n使用它作爲代幣化股份的狗屎幣的數量，爲任何蒸發的\n奇蹟，他們是...",
      "title": "如果沒有以太坊，加密貨幣的採用就不會是現在的十分之一。"
    }
  ]
}