{
  "author": "Compensate1995",
  "original_created_utc": 1634991675,
  "title": "Why can't 18-20 y/o drink if they're considered adults and have the accompanying privileges and duties?",
  "created_utc": 1635023643,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It seems unclear to me why 18 year-olds (and 19 and 20 y/o as well) can get married, have kids, be totally independent financially-wise, live by themselves, start a profitable (and non-profitable) business, buy a house, drive and live nearly every aspect of adulthood. Yet they can&#39;t buy their own drinks and cigarettes until they are precisely 21. In my native country 18 counts as the age of major, which increases my disbelief. I think that if someone can start a family, study prestigious majors at college, live an utterly autonomous life, he is able to drink an occasional drink. What&#39;s the logic here? Parents can do the full parental duties and then when they&#39;re offered a drink by their peers they have to decline since they&#39;re underage? As an avid drinker myself it seems unfathomable. Is this law really implemented and enforced?</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/qe3vqi/why_cant_1820_yo_drink_if_theyre_considered/",
  "subreddit": "TooAfraidToAsk",
  "id": "qe3vqi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It seems unclear to me why 18 year-olds (and 19 and 20 y/o as well) can get\nmarried, have kids, be totally independent financially-wise, live by themselves,\nstart a profitable (and non-profitable) business, buy a house, drive and live\nnearly every aspect of adulthood. Yet they can't buy their own…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "なぜ18歳（19歳、20歳も）が結婚して子供を持ち、経済的に完全に自立して一人暮らしができるのか、私には理解できません。\n結婚し、子供を持ち、経済的に完全に自立し、一人暮らしをし、収益性のある（または収益性のない）ビジネスを始め、家を買う。\n儲かる（儲からない）ビジネスを始めたり、家を買ったり、車を運転したり、大人になるためのほぼすべての要素を備えています。\n大人になるためのほぼすべての面で。しかし、彼らは自分の家を買うことができません...。",
      "title": "18歳から20歳の若者は、成人とみなされ、それに伴う特権や義務があるのに、なぜ飲んではいけないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我似乎不清楚为什么18岁的人（以及19岁和20岁的人）可以结婚生子。\n结婚，生孩子，在经济上完全独立，自己生活。\n创办盈利（或不盈利）的企业，买房子，开车和生活。\n几乎成年的所有方面。然而，他们却不能购买自己的...",
      "title": "如果他们被认为是成年人并有相应的特权和义务，为什么18-20岁的人不能喝酒？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我似乎不清楚爲什麼18歲的人（以及19歲和20歲的人）可以結婚生子。\n結婚，生孩子，在經濟上完全獨立，自己生活。\n創辦盈利（或不盈利）的企業，買房子，開車和生活。\n幾乎成年的所有方面。然而，他們卻不能購買自己的...",
      "title": "如果他們被認爲是成年人並有相應的特權和義務，爲什麼18-20歲的人不能喝酒？"
    }
  ]
}