{
  "author": "Acceptable_Novel8200",
  "original_created_utc": 1643274709,
  "title": "Fear and Greed index is now at \"I don't fucking care anymore\"",
  "created_utc": 1643283322,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So,Fear and Greed Index shows the rough idea of market sentiments at any given time. &lt;/p&gt;\n\n&lt;p&gt;After tremendous rise in Crypto prices past year, the index went to the levels of extreme greed then to extreme fear within few weeks. &lt;/p&gt;\n\n&lt;p&gt;But after sharp fall in Crypto prices this month,i can see the index at a whole new level I. E. \n&amp;quot;I don&amp;#39;t fucking care anymore&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;This would be the best description at present levels of prices I guess! When you stop caring, it might calm your nerves a bit. Eventually the prices will rise not today, not tomorrow but in longer duration of time they will.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 359,
  "permalink": "/r/CryptoCurrency/comments/sduahs/fear_and_greed_index_is_now_at_i_dont_fucking/",
  "subreddit": "CryptoCurrency",
  "id": "sduahs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So,Fear and Greed Index shows the rough idea of market sentiments at any given\ntime.\n\nAfter tremendous rise in Crypto prices past year, the index went to the levels\nof extreme greed then to extreme fear within few weeks.\n\nBut after sharp fall in Crypto prices this month,i can see the index at a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "つまり、Fear and Greed Indexは、その時々の市場心理を大まかに示しているのです。\nとなります。\n\n昨年、Cryptoの価格が驚異的に上昇した後、この指数は次のレベルに達しました。\n数週間のうちに極端な強欲になり、極端な恐怖になった。\n\nしかし、今月の暗号通貨の急激な下落の後、私はこの指数を見ることができます...",
      "title": "恐怖と欲の指数が「もうどうでもいい」に"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，恐惧和贪婪指数显示了在任何特定时间市场情绪的大致情况。\n时候的市场情绪。\n\n在去年加密货币价格大幅上涨之后，该指数在几周内就上升到了\n极度贪婪的水平，然后在几周内变成极度恐惧。\n\n但在本月加密货币价格急剧下降后，我可以看到该指数处于一个较低的水平。",
      "title": "恐惧和贪婪指数现在是 \"我他妈的不再关心了\""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，恐懼和貪婪指數顯示了在任何特定時間市場情緒的大致情況。\n時候的市場情緒。\n\n在去年加密貨幣價格大幅上漲之後，該指數在幾周內就上升到了\n極度貪婪的水平，然後在幾周內變成極度恐懼。\n\n但在本月加密貨幣價格急劇下降後，我可以看到該指數處於一個較低的水平。",
      "title": "恐懼和貪婪指數現在是 \"我他媽的不再關心了\""
    }
  ]
}