{
  "author": "Iiau_",
  "the_new_excerpt": "I was just scrolling through old bitcointalk threads in 2015 and everyone was\ntalking about how they owned whole bitcoins like it was nothing and talks of\nwhales were seen in a less dramatic way than today.\n\nIsn't it crazy now that someone is held as well invested if they just had 1\nbitcoin? Bitcoin…",
  "original_created_utc": 1619748234,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2015年のbitcointalkの古いスレッドをスクロールしていたら、誰もが\nビットコインを丸ごと所有していることを何事もないように話していたし、クジラの話も今ほど劇的ではなかった。\nクジラの話も今ほど劇的ではありませんでした。\n\n今では、誰かが1ビットコインを持っているだけで、投資しているのと同じように保有されているのはおかしいと思いませんか？\nビットコイン...。ビットコイン...",
      "title": "ある日、私たちは0.01BTCを見て「じぇじぇじぇ、大金のようだ」と思うかもしれません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我刚刚翻阅了2015年的比特币话题，每个人都在谈论他们如何拥有整个比特币，就像什么都没有一样。\n谈论他们是如何拥有整个比特币的，就像什么都不是一样。\n鲸鱼是以一种没有今天这么夸张的方式出现的。\n\n现在不是很疯狂吗，如果一个人只有1个比特币，那么他的投资就会很好。\n比特币？比特币...",
      "title": "有一天，我们可能会看到0.01BTC，并认为 \"天啊，这听起来像是很多钱\"。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我剛剛翻閱了2015年的比特幣話題，每個人都在談論他們如何擁有整個比特幣，就像什麼都沒有一樣。\n談論他們是如何擁有整個比特幣的，就像什麼都不是一樣。\n鯨魚是以一種沒有今天這麼誇張的方式出現的。\n\n現在不是很瘋狂嗎，如果一個人只有1個比特幣，那麼他的投資就會很好。\n比特幣？比特幣...",
      "title": "有一天，我們可能會看到0.01BTC，並認爲 \"天啊，這聽起來像是很多錢\"。"
    }
  ],
  "title": "One day, we might see 0.01 BTC and think \"jeez, that sounds like a lot of money\".",
  "created_utc": 1619790045,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was just scrolling through old bitcointalk threads in 2015 and everyone was talking about how they owned whole bitcoins like it was nothing and talks of whales were seen in a less dramatic way than today.</p>\n\n<p>Isn&#39;t it crazy now that someone is held as well invested if they just had 1 bitcoin? Bitcoin is only going to get more and more incredibly scarce in the future, as people send to non-existent addresses, get locked out of their wallets, forget, etc. And when we realize that most of the world still hasn&#39;t caught up on crypto yet, we should come to appreciate that we found out about crypto sooner than the others, and our small stacks may not be so small in the future.</p>\n</div><!-- SC_ON -->",
  "score": 235,
  "permalink": "/r/CryptoCurrency/comments/n1jxsb/one_day_we_might_see_001_btc_and_think_jeez_that/",
  "subreddit": "CryptoCurrency",
  "id": "n1jxsb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380961453
}