{
  "author": "ManyArtichoke",
  "the_new_excerpt": "There are so many projects that are better suited for fast and cheap\ntransactions than a massively bloated proof-of-work blockchain.\n\nIf Bitcoin was the only cryptocurrency in the world I think you could make a\ndecent argument that the block size should be increased. However, the invention\nof…",
  "original_created_utc": 1613665682,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "有这么多项目，更适合快速和廉价的项目\n而不是一个庞大的工作证明区块链。\n\n如果比特币是世界上唯一的加密货币，我想你可以做一个\n体面的论点，认为应该增加块的大小。然而，本发明\n的...",
      "title": "回想起来，比特币开发者不增加区块大小的决定是100%正确的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有這麼多項目，更適合快速和廉價的項目\n而不是一個龐大的工作證明區塊鏈。\n\n如果比特幣是世界上唯一的加密貨幣，我想你可以做一個\n體面的論點，認爲應該增加塊的大小。然而，本發明\n的...",
      "title": "回想起來，比特幣開發者不增加區塊大小的決定是100%正確的。"
    }
  ],
  "title": "In retrospect, Bitcoin developers were 100% correct in their decision not to increase the block size.",
  "created_utc": 1613687733,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There are so many projects that are better suited for fast and cheap transactions than a massively bloated proof-of-work blockchain. </p>\n\n<p>If Bitcoin was the only cryptocurrency in the world I think you could make a decent argument that the block size should be increased. However, the invention of Bitcoin opened the door to so many other possibilities of what a cryptocurrency can be and what it can look like. That allowed Bitcoin to effectively offload the responsibility of enabling fast and cheap transactions to other projects. This in turn sparked an incredible amount of innovation and new projects that never would have existed otherwise. </p>\n\n<p>Now Bitcoin can fully embrace it&#39;s role as digital gold, the best store of value the world has ever seen, and eventually, a global reserve currency. </p>\n\n<p>I&#39;ve never understood why some people mock Bitcoin for &quot;only&quot; being a store of value. Do you have any idea how earth shattering it would be if the global economy started to build itself around a decentralized, permissionless monetary network that no goverment has the ability to control? It would truly change the world.</p>\n</div><!-- SC_ON -->",
  "score": 291,
  "permalink": "/r/CryptoCurrency/comments/lmqmj7/in_retrospect_bitcoin_developers_were_100_correct/",
  "subreddit": "CryptoCurrency",
  "id": "lmqmj7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332875931
}