{
  "author": "TheRealDietGlue",
  "original_created_utc": 1638321924,
  "title": "Why am I repulsed by the idea of me being pregnant?",
  "created_utc": 1638394000,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m a 17 year old girl and I’ve always been disgusted by the idea of pregnancy. When I was little and used to play house, I never wanted to pretend to be pregnant because I thought it was repulsive. Even seeing pictures of my mom pregnant brought me deep shame and sadness for both me and her. I thought that I’d eventually outgrow it but I never did. I’ve had two dream about being pregnant this week and both have been traumatizing and disgusting. It was awful, and I think it’s because I still see myself as a child (idk just a guess). I don’t want to see myself in that way, and I don’t understand why. Is this normal?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 2233,
  "permalink": "/r/NoStupidQuestions/comments/r62wup/why_am_i_repulsed_by_the_idea_of_me_being_pregnant/",
  "subreddit": "NoStupidQuestions",
  "id": "r62wup",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m a 17 year old girl and I’ve always been disgusted by the idea of pregnancy.\nWhen I was little and used to play house, I never wanted to pretend to be\npregnant because I thought it was repulsive. Even seeing pictures of my mom\npregnant brought me deep shame and sadness for both me and her. I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は17歳の女の子ですが、妊娠というものにずっと嫌悪感を抱いていました。\n小さい頃、おままごとをするとき、絶対に妊娠したふりをしたくなかったんです。\n妊娠は嫌なものだと思っていましたから。母の写真を見ても\n妊娠していることは、私にとっても彼女にとっても、深い羞恥心と悲しみをもたらすものでした。I...",
      "title": "なぜ私が妊娠することに反発するのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个17岁的女孩，我一直对怀孕的想法感到厌恶。\n在我小的时候，我经常玩过家家，我从来没有想过要假装成\n因为我认为那是令人厌恶的。即使看到我妈妈怀孕的照片\n怀孕的照片都会给我和她带来深深的羞耻感和悲伤。I...",
      "title": "为什么我对自己怀孕的想法感到厌恶？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個17歲的女孩，我一直對懷孕的想法感到厭惡。\n在我小的時候，我經常玩過家家，我從來沒有想過要假裝成\n因爲我認爲那是令人厭惡的。即使看到我媽媽懷孕的照片\n懷孕的照片都會給我和她帶來深深的羞恥感和悲傷。I...",
      "title": "爲什麼我對自己懷孕的想法感到厭惡？"
    }
  ]
}