{
  "author": "huge_dingus",
  "original_created_utc": 1638519458,
  "title": "\"Bitcoin is no longer decentralized because banks and hedge funds are involved\"",
  "created_utc": 1638541900,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I see this stupid argument even in &lt;a href=\"/r/bitcoin\"&gt;/r/bitcoin&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Banks, hedge funds, and corps don&amp;#39;t control the issuance or total supply. Rich people buying Bitcoin doesn&amp;#39;t mean it&amp;#39;s co-opted. The promise of Bitcoin was never that nobody else would have more money than you.&lt;/p&gt;\n\n&lt;p&gt;It was created with a supply that can&amp;#39;t be manipulated &amp;amp; devalued like what&amp;#39;s been happening with every fiat currency.&lt;/p&gt;\n\n&lt;p&gt;The goal is for everyone to use Bitcoin and that includes bankers and CEOs.&lt;/p&gt;\n\n&lt;p&gt;If you own 1 BTC you own 1/21million of the total monetary supply and nobody can change that. Stop worrying about what other people have, and be glad that Bitcoin is the first asset that prevents anyone from taking what you have.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 227,
  "permalink": "/r/Bitcoin/comments/r7u9tx/bitcoin_is_no_longer_decentralized_because_banks/",
  "subreddit": "Bitcoin",
  "id": "r7u9tx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I see this stupid argument even in /r/bitcoin\n\nBanks, hedge funds, and corps don't control the issuance or total supply. Rich\npeople buying Bitcoin doesn't mean it's co-opted. The promise of Bitcoin was\nnever that nobody else would have more money than you.\n\nIt was created with a supply that can't…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "r/bitcoinでもこんなアホな論調を見かけます。\n\n銀行、ヘッジファンド、大企業は、発行や総供給量をコントロールしていない。金持ちは\nがビットコインを買っても、それが共同利用されたことにはならない。ビットコインの約束は\n誰もあなたよりお金を持っていないなんてことはないんです。\n\nそれは、できない供給で作成されました...",
      "title": "\"ビットコインは銀行やヘッジファンドが関与しているため、もはや非中央集権的ではない\""
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我甚至在/r/bitcoin看到这种愚蠢的说法\n\n银行、对冲基金和公司并不控制发行量或总供应量。有钱人\n有钱人购买比特币并不意味着它被控制了。比特币的承诺是\n从来没有人比你有更多的钱。\n\n它被创造出来的供应量不能...",
      "title": "\"比特币不再是去中心化的，因为银行和对冲基金都参与其中\""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我甚至在/r/bitcoin看到這種愚蠢的說法\n\n銀行、對沖基金和公司並不控制發行量或總供應量。有錢人\n有錢人購買比特幣並不意味着它被控制了。比特幣的承諾是\n從來沒有人比你有更多的錢。\n\n它被創造出來的供應量不能...",
      "title": "\"比特幣不再是去中心化的，因爲銀行和對沖基金都參與其中\""
    }
  ]
}