{
  "author": "Gusbert22",
  "the_new_excerpt": "Hello all you sexy little hodl’ers!\n\nI’m hoping that sharing this will be of value to some in the community.\n\nI recently decided to scroll back through my coinbase buying history. I bought\nmy first 11 Bitcoins at $184! The date was jan 14th, 2015. Like many others, I\nsold them a year later at (what…",
  "original_created_utc": 1616041981,
  "localize": [
    {
      "locale": "zh",
      "title": "我花了184美元买了一个比特币!",
      "the_new_excerpt": "各位性感的小荷包们，你们好!\n\n我希望分享这个能对社区里的一些人有价值。\n\n最近我决定翻阅一下我的币基购买历史。我买了\n我的第一个11个比特币184美元! 日期是2015年1月14日。和很多人一样，我\n一年后卖给了他们（什么..."
    },
    {
      "locale": "zh-Hant",
      "title": "我花了184美元買了一個比特幣!",
      "the_new_excerpt": "各位性感的小荷包們，你們好!\n\n我希望分享這個能對社區裏的一些人有價值。\n\n最近我決定翻閱一下我的幣基購買歷史。我買了\n我的第一個11個比特幣184美元! 日期是2015年1月14日。和很多人一樣，我\n一年後賣給了他們（什麼..."
    }
  ],
  "title": "I bought a Bitcoin for $184!",
  "created_utc": 1616081495,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello all you sexy little hodl’ers! </p>\n\n<p>I’m hoping that sharing this will be of value to some in the community. </p>\n\n<p>I recently decided to scroll back through my coinbase buying history. I bought my first 11 Bitcoins at $184! The date was jan 14th, 2015. Like many others, I sold them a year later at (what i considered, at the time) a considerable gain. Looking back, of course I wish I still had the coins. </p>\n\n<p>The point being... no one knew! Lots of people sold around this time. You simply cannot beat yourself up for cashing out when it felt right. You can’t dwell on the past. </p>\n\n<p>In late 2017, I started building my btc holdings back up. I have been buying consistently for the last 4 years and have yet to sell a single satoshi! </p>\n\n<p>This time around is different! I’m glad to say, I feel good about my portfolio. However, it’s worth mentioning that we are in the early stages of this new world! </p>\n\n<p>I have many friends who reach out saying “I wish I had bought years ago, now it’s $60,000 a coin”. I try to explain.. when it’s $1,000,000 per coin, I would hate to hear you say.. “I wish I had bought when it was $60,000”.</p>\n\n<p>This truly is early days. We are only now starting to see institutional adoption. Dollar cost average and don’t get left behind. </p>\n\n<p>Love this community and appreciate y’all!</p>\n</div><!-- SC_ON -->",
  "score": 285,
  "permalink": "/r/Bitcoin/comments/m7j4z9/i_bought_a_bitcoin_for_184/",
  "subreddit": "Bitcoin",
  "id": "m7j4z9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752812174
}