{
  "author": "Graphene_Hands",
  "the_new_excerpt": "There have been a few other long-term HODLers sharing their stories recently and\nI've greatly enjoyed reading them and reminiscing about Bitcoin's past. Here's\nmy story - I hope it's as entertaining as the others.\n\n---\n\nEvery number between 0 cents and the current ATH has been, by definition,…",
  "original_created_utc": 1609462450,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "最近还有其他一些长期从事HODL的人分享了他们的故事\n我非常喜欢阅读它们，回忆比特币的过去。这是\n我的故事-我希望它和其他人一样有趣。\n\n\n\n根据定义，介于0美分和当前ath之间的每个数字都是…",
      "title": "我在2011年买下了ATH：十年的摸索"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近還有其他一些長期從事HODL的人分享了他們的故事\n我非常喜歡閱讀它們，回憶比特幣的過去。這是\n我的故事-我希望它和其他人一樣有趣。\n\n\n\n根據定義，介於0美分和當前ath之間的每個數字都是…",
      "title": "我在2011年買下了ATH：十年的摸索"
    }
  ],
  "title": "I bought the ATH in 2011: A decade of HODLing",
  "created_utc": 1609480010,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There have been a few other long-term HODLers sharing their stories recently and I&#39;ve greatly enjoyed reading them and reminiscing about Bitcoin&#39;s past. Here&#39;s my story - I hope it&#39;s as entertaining as the others.</p>\n\n<p>---</p>\n\n<p>Every number between 0 cents and the current ATH has been, by definition, the all-time-high at one point. Don&#39;t let that prevent you from taking a risk in something you believe in. Extend your time horizon to a decade and lock your coins away.</p>\n\n<p>---</p>\n\n<p>I&#39;ve been a libertarian since I was a teenager. The expanding role of the State is something that I&#39;ve been worrying about for most of my life. While learning about the immorality of the existence of the State, at some point I learned about monetary policy and how inflation is robbing everyone on an unprecedented scale. I tucked this knowledge away and was determined to figure out a way around it when I started making my own money. (This paragraph is the only one involving political philosophy, go ahead and continue reading)</p>\n\n<p>I first heard of Bitcoin in 2010 on one of the many forums I frequented in my libertarian internet circle. It was an interesting concept to me, but I didn&#39;t pursue it at all. Again I tucked this knowledge away for future use.</p>\n\n<p>I heard of it again several months later (2010). This time I decided to try it out. I remember downloading and syncing the reference wallet and using a BTC faucet to send coins to my wallet. I forget exactly how many it was... 5, maybe? That&#39;s as far as I went with it though. At some point I deleted the wallet and the downloaded blockchain - probably to make room for a Steam game or something. Those coins are gone.</p>\n\n<p>That&#39;s right - Steam. I have been a gamer for most of my life as well. I owned a powerful graphics card at the time: The Radeon 5970.</p>\n\n<p>The third time I heard about Bitcoin was in May 2011. I had heard that the price was lifting off and people were making a lot of money from it. This time I decided to dive in and see what I could figure out.</p>\n\n<p>This was where I fell into the deep rabbit hole of Bitcoin. I remember getting so absorbed in it that I didn&#39;t sleep some nights. I was working my day job, going home and learning all that I could about Bitcoin. Learning about how addresses were generated, how wallets worked, how mining worked, how the difficulty adjustment worked, everything that I possibly could.</p>\n\n<p>After a week or two of obsessing and reading about Bitcoin, I decided that this was the most important invention since the internet - the most perfect form of money ever created. One of the most ingenious systems ever designed by man - and NO ONE KNOWS ABOUT IT YET.</p>\n\n<p>I can&#39;t recall if any other coins existed at the time, but between 2011-2012 I remember other coins like Namecoin, Peercoin, Feathercoin, and some others. I don&#39;t hear about any of those other coins these days... besides LTC and XRP, of course.</p>\n\n<p>I decided that I wanted in. I needed to get some Bitcoin. I needed it NOW!! This would be like buying stock in the Internet itself but better - no counterparty risk, and I could be my own bank!</p>\n\n<p>I wasn&#39;t making a lot of money at the time, so putting money towards anything discretionary wasn&#39;t going to be friendly to my budget. Yes, I owned a badass gaming rig, but that was my only luxury in life. I knew I was going to buy for the long term, so I decided to put aside $500 and go for it. I was going to buy Bitcoin.</p>\n\n<p>At the time, Mt Gox was the only game in town that I can remember. I don&#39;t think BTC-e existed yet, or maybe I just hadn&#39;t heard of it.</p>\n\n<p>I signed up for a Gox account and figured out how to fund it. There were a few ways to do this, one of which was another app called Dwolla. So I signed up for Dwolla and got verified. I then deposited my $500 and initiated the ACH transfer to Gox. BTC price at the time: $3.</p>\n\n<p>I had initiated the transfer on a Tuesday evening after work. I was informed that the transfer would arrive at Gox on Friday.</p>\n\n<p>I watched agonizingly as the price climbed hour after hour, day after day. $3.50. $4. $5. $6. I was missing the boat!!! By Thursday evening the price had doubled.</p>\n\n<p>At work on Friday, I checked my email on my phone practically every five minutes. The transfer didn&#39;t go through the entire work day. I had plans with friends that evening - damn it, I was going to have to try and do this on my phone while hanging with my friends?!</p>\n\n<p>I ended up making my first BTC purchase while sitting in a movie theater. I bought 50 Bitcoin for $10 each - during an all-time-high.</p>\n\n<p>I still hodl every one of these coins today.</p>\n\n<p>(The movie, for the curious: X-Men: First Class)</p>\n\n<p>I couldn&#39;t stop there, though. The more I learned, the more I had to know. The more I had to DO. That&#39;s when I got into GPU mining.</p>\n\n<p>This was a time before ASICs. I believe GPU mining was relatively new -- before this, miners were only using CPUs (which were in 2011 -- like GPUs in 2020 -- obsolete for SHA256 mining).</p>\n\n<p>The next day I dove headfirst into Bitcoin mining. I downloaded the software and set up an account on Slush Pool. I ran my 5970 on full blast for a while and went out with some friends. When I got back, my bedroom was noticeably hotter than it was when I left. So that&#39;s what I was going to be dealing with? Ok, fine.</p>\n\n<p>I also couldn&#39;t play any demanding video games while the miner was running. I&#39;d have to dial the hashrate down, or disable it completely. Ok, I guess I can manage that.</p>\n\n<p>After a few days of dealing with that, I decided to buy another 5970. If I got bored of Bitcoin, it would still make The Witcher 2 run better!</p>\n\n<p>All told, between mining with Slush Pool and BTCGuild for a month, I managed to mine an additional 50BTC that month.</p>\n\n<p>I still hodl every one of these coins today.</p>\n\n<p>One day, my electric bill came. $350. For my 1BR apartment? That can&#39;t be right...</p>\n\n<p>I called up the electric company and told them they double-billed me.</p>\n\n<p>&quot;Nope, that amount is accurate. That&#39;s what you owe for this month. Have a nice day!&quot;</p>\n\n<p>And that was the day I stopped Bitcoin mining.</p>\n\n<p>I had been telling all my friends and gamer friends about Bitcoin the entire time. They laughed at me. I told them they wouldn&#39;t be laughing when I was a millionaire.</p>\n\n<p>Soon after, Bitcoin crashed -- HARD. Dropping from $32 at its peak to $2 over the next few months -- one of the largest price drops in its history.</p>\n\n<p>I was dejected. I stopped talking about it with my friends. The gamer communities I was a member of made fun of me relentlessly, trashing Bitcoin every day. News articles celebrating Bitcoin&#39;s death popped up everywhere. It was the first major public crash, and I felt all alone.</p>\n\n<p>I uninstalled the Bitcoin price widget from my phone. I moved on with my life and tried to forget about Bitcoin. I left the wallet on my PC, but deleted my copy of the blockchain.</p>\n\n<p>I barely thought about Bitcoin for the next two years. Any time someone brought it up at work or in my friend group, I changed the subject. I was completely demoralized and thought I had fallen for the biggest scam of all time.</p>\n\n<p>After this unbearable TWO YEAR period... Bitcoin came back.</p>\n\n<p>One day I opened <a href=\"/r/Bitcoin\">r/Bitcoin</a> and saw utter elation all over the front page. What the hell was going on?</p>\n\n<p>Bitcoin had surpassed the last all-time-high and was climbing still. $50... $100. And it was still going!!!</p>\n\n<p>I snapped out of my multi-year funk right then and there. Somehow my paper financial loss had clouded my judgment and made me forget about the fundamentals that made me interested in Bitcoin in the first place.</p>\n\n<p>&quot;Bitcoin was back?&quot; It had never left. It was still the same decentralized, unforgeable, instantly transferrable miracle asset that I had fallen in love with.</p>\n\n<p>I got back into mining again, but I didn&#39;t leave my GPUs running 24/7 like I had before. Eventually, ASICs started coming out and obsoleted GPU miners, so I had to start mining LTC instead and selling them for BTC. I mined on a site called give-me-ltc and did my trades on BTC-e.</p>\n\n<p>Eventually I got tired of managing my miners, paying extra for electricity, and dealing with switching stuff around for gaming. I stopped mining again and moved on to other things.</p>\n\n<p>I exited this phase with an additional 30BTC and over 400LTC. I still hodl every one of these coins today.</p>\n\n<p>Eventually, BTC hit $1000. I watched this live on <a href=\"https://bitcoinity.org\">bitcoinity.org</a>. I remember this day vividly.</p>\n\n<p>The graphic shown on bitcoinity for every price point was usually some sort of funny gif - someone dancing, someone acting crazy, someone making a funny face, Mr. Bean watching signposts fly past his car. This time, the gif was different - it was serious.</p>\n\n<p>It was an astronaut on the moon. A flag was planted behind him bearing the Bitcoin logo.</p>\n\n<p>Tears welled up in my eyes. This was significant. Bitcoin was being recognized for what it was - the most perfect form of money ever created.</p>\n\n<p>My stack was now worth enough to pay off all of my six-figure student loan debt. I had thought that I would be paying this debt off for the rest of my life. Bitcoin meant potential financial freedom to me.</p>\n\n<p>I didn&#39;t sell a single satoshi.</p>\n\n<p>Of course, $1000 didn&#39;t last, and paying off all my loans with my stack was no longer a possibility. The price did not recover for almost FOUR years -- even longer than the previous crypto winter. During this time I bought a few more coins through Coinbase.</p>\n\n<p>The 2017 run-up was a blur -- except for one day...</p>\n\n<p>The day I became a crypto millionaire.</p>\n\n<p>My family didn&#39;t grow up with a ton of money. I never had the latest clothes, toys -- well, anything. We weren&#39;t poor, but we scraped by. I didn&#39;t have a great education in personal finance.</p>\n\n<p>Being a crypto millionaire went straight to my head.</p>\n\n<p>Driving to work on that day, I remember thinking I was the most badass person on Earth. Somehow I had managed to manipulate some computer numbers around that were now worth over a million dollars!!</p>\n\n<p>I couldn&#39;t help it - I told everyone at work. I was a crypto millionaire. I couldn&#39;t shut up about it. I told my family. I told my friends. I told everyone.</p>\n\n<p>I went to the store to grab a few things. Walking the aisles, I couldn&#39;t stop thinking about it. &quot;These people have no idea they&#39;re standing next to a MILLIONAIRE.&quot;</p>\n\n<p>Of course, my crypto millionaire status didn&#39;t last long.</p>\n\n<p>This time, though, I SODL a few coins at the peak. I bought a house and a car.</p>\n\n<p>A month or two later, I was no longer a crypto millionaire.</p>\n\n<p>Seeing the altcoin season was kind of crazy to me. For a few months, you literally could not pick a losing coin. Everyone was a winner. It was sheer insanity. I picked up a few ETH to get some exposure, even though I didn&#39;t (and still don&#39;t) believe in it long term.</p>\n\n<p>I&#39;m doing pretty well these days. I am numb to any price activity at this point. The last time I bought was the dip down to $4000 in March. I don&#39;t know how anyone could have resisted that one.</p>\n\n<p>Other than what I SODL in 2017, I still hodl all of my coins.</p>\n\n<p>You may be able to see a pattern here. There&#39;s always going to be another all-time-high. There&#39;s always going to be a crash or a correction. You&#39;re probably going to feel stupid more than a handful of times being a HODLer. But eventually these feelings go away.</p>\n\n<p>I have a few more anecdotes and random thoughts to share, so I&#39;ll make them bullet points below:</p>\n\n<p>&#x200B;</p>\n\n<p>- I held on to my BCH for a while. I will admit that I was TERRIFIED during the flippening. 6-12 months later, I sold them all for BTC.</p>\n\n<p>- I immediately sold all my BSV for LTC.</p>\n\n<p>- I hold BTC, LTC, and ETH. That&#39;s it.</p>\n\n<p>- I don&#39;t believe in any of these centralized or &quot;new and improved&quot; shitcoins. I&#39;m a BTC maximalist through-and-through. The only other coin I&#39;d consider at this point would be Monero. I know almost nothing about it and I haven&#39;t done any research on it, so I don&#39;t hold any.</p>\n\n<p>&#x200B;</p>\n\n<p>FUNNY</p>\n\n<p>- I gave $5 of BTC to a friend in 2013. They forgot about it. I reminded them about it this year. They sold it for $175.</p>\n\n<p>- I gave $30 of BTC to a friend in 2013. They sold it in 2017 for $750.</p>\n\n<p>- I solo mined IxCoin (literal who?) for a few days because I wanted to feel what it was like to solo mine a block. I did not solo mine a block.</p>\n\n<p>- My favorite Bitcoin meme is &quot;This is gentlemen.&quot; Why don&#39;t people say that anymore?</p>\n\n<p>&#x200B;</p>\n\n<p>REMINISCING</p>\n\n<p>- Wallets I used: Bitcoin core -&gt; Armory Offline (airgapped with TAILS) -&gt; Electrum Offline (airgapped with TAILS) -&gt; trezor</p>\n\n<p>- Armory was flaky as fuck. I moved on to Electrum after the 20th time Armory failed to sync the blockchain. I remember having to manually export the private keys using some Python script because I couldn&#39;t get the wallet synced.</p>\n\n<p>- Reddit is too slow for BTC sometimes, so I would go to the BTC-e trollbox to get some realtime action. Now that BTC-e is gone, I typically hang out in /biz/ when Reddit is boring.</p>\n\n<p>&#x200B;</p>\n\n<p>REGRETS</p>\n\n<p>- Not buying more. Not mining more.</p>\n\n<p>- Not selling BCH for BTC immediately. That one still stings.</p>\n\n<p>- Focusing a little too much on paying down debt vs buying more BTC.</p>\n\n<p>- Buying precious metals in 2013. What a waste.</p>\n\n<p>- Selling in 2017. But, I wanted a house and a car. Regretting taking profit is stupid, but I can&#39;t help it.</p>\n\n<p>&#x200B;</p>\n\n<p>THOUGHTS</p>\n\n<p>- I never once tried to convince anyone to buy Bitcoin, despite how much I talked about it. I tried to convince people of the potential and that the Fed was evil, but I never once said, &quot;You should buy Bitcoin&quot; to anyone.</p>\n\n<p>- I see another 10x for BTC. Just buy BTC. Don&#39;t buy anything else. Just buy BTC and fucking HODL.</p>\n\n<p>- HODL through these crashes. They make you stronger. After a few of them, nothing will faze you. Be a fucking man and HODL on to your coins!!!!!</p>\n\n<p>- People just don&#39;t understand the network effect of the BTC protocol. No one cares that another coin has better features. No one cares that there are better internet protocols. They use what has the most infrastructure and support. Don&#39;t fall for these shitcoins.</p>\n\n<p>- People don&#39;t understand the layering concept. Increasing blocksize simply isn&#39;t the solution to scaling Bitcoin - second layer and beyond is the solution.</p>\n\n<p>- Taxation is theft.</p>\n\n<p>&#x200B;</p>\n\n<p>Hopefully this was at least mildly entertaining.</p>\n\n<p>Happy New Year!!!!!</p>\n</div><!-- SC_ON -->",
  "score": 1820,
  "permalink": "/r/Bitcoin/comments/ko1wk3/i_bought_the_ath_in_2011_a_decade_of_hodling/",
  "subreddit": "Bitcoin",
  "id": "ko1wk3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610100739502
}