{
  "author": "RowanHarley",
  "the_new_excerpt": "Article:\nhttps://finance.yahoo.com/news/palantir-announces-double-click-demo-114500595.html\n\nCopy and Paste of Article for those of you lazy enough: Palantir Technologies\n(NYSE:PLTR) today announced that it will hold the first in a series of \"Double\nClick\" demo events on Wednesday, April 14, 2021,…",
  "original_created_utc": 1615469198,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "文章。\nhttps://finance.yahoo.com/news/palantir-announces-double-click-demo-114500595.html\n\n文章复制粘贴，供够懒的你参考。Palantir技术\n(NYSE:PLTR)今天宣布，将举行 \"双十一 \"活动。\n点击》演示活动于2021年4月14日（周三），...",
      "title": "Palantir宣布4月21日举办 \"双击 \"演示活动"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "文章。\nhttps://finance.yahoo.com/news/palantir-announces-double-click-demo-114500595.html\n\n文章複製粘貼，供夠懶的你參考。Palantir技術\n(NYSE:PLTR)今天宣佈，將舉行 \"雙十一 \"活動。\n點擊》演示活動於2021年4月14日（週三），...",
      "title": "Palantir宣佈4月21日舉辦 \"雙擊 \"演示活動"
    }
  ],
  "title": "Palantir announces \"Double Click\" demo event on April 21st",
  "created_utc": 1615482932,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Article: <a href=\"https://finance.yahoo.com/news/palantir-announces-double-click-demo-114500595.html\">https://finance.yahoo.com/news/palantir-announces-double-click-demo-114500595.html</a></p>\n\n<p>Copy and Paste of Article for those of you lazy enough:\nPalantir Technologies (NYSE:PLTR) today announced that it will hold the first in a series of &quot;Double Click&quot; demo events on Wednesday, April 14, 2021, at 11:00am ET.</p>\n\n<p>Palantir software is used by customers across 40 industries worldwide. Double Click is Palantir&#39;s series of software demo events that showcase how the company&#39;s platforms are used across these industries and customers.</p>\n\n<p>The first event will feature in-depth demonstrations of Palantir Foundry for life sciences and industrials. Palantir’s customers in these verticals include Merck, NIH, NHS, 3M, bp, PG&amp;E, LANXESS, Doosan, and others. The software demos at Double Click will showcase how customers can use Archetypes, Palantir’s solution to deploy end-to-end use cases in a matter of clicks, on top of Foundry, including:</p>\n\n<p>Life Sciences: harmonized patient view, clinical and observational data curation, prognostic model management, accelerated discovery via scientific research collaboration</p>\n\n<p>Industrials: end-to-end quality assurance, production optimization, high-scale IoT analytics, supply chain optimization</p>\n\n<p>Advance registration is required, and is available at <a href=\"https://palantir.events/doubleclick\">https://palantir.events/doubleclick</a>. Capacity is limited, and registration will close 24 hours prior to the event. For any questions regarding the event, please email <a href=\"mailto:double-click@palantir.com\">double-click@palantir.com</a>.</p>\n\n<p>Didn&#39;t see anyone post about it yesterday, so I thought I&#39;d create a thread and see what people have to say. I think these kinds of demo events will only boost PLTR, especially in the long-term.</p>\n</div><!-- SC_ON -->",
  "score": 447,
  "permalink": "/r/stocks/comments/m2q0v6/palantir_announces_double_click_demo_event_on/",
  "subreddit": "stocks",
  "id": "m2q0v6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147381381
}