{
  "author": "Randomized_Emptiness",
  "original_created_utc": 1636634270,
  "title": "Reality check: There aren't thousands of 10000x gems waiting for you",
  "created_utc": 1636652231,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This may be more of a rant. But honestly, the posts asking for the next 1000x coin, the posts of telling people to DYOR, in order to get in early on some low capped gem, are truly misleading.</p>\n\n<p>The whole cryptoverse is expanding and rapidly evolving, so there will be new cryptos, especially in the smart-contract ecosystem, however, to tell new people just DYOR and you&#39;ll find that next 1000x gem, or conversely to tell them, they didn&#39;t DYOR when they don&#39;t find that coin, is just setting expectations unrealistically high. </p>\n\n<p>The crypto market has brought out two major contenders: Bitcoin, as a store of value, a hedge against inflation, and a means of transaction via lightning network, and Ethereum, as the goto chain for all things DeFi. Most of the other cryptos are highly speculative and could just as easily be replaced by something else.</p>\n\n<p>The general uptrend will likely continue, due to increasing adoption, increasing capabilities, DEX, supply-chain-tracking, DIDs, and simply the nature of having deflationary crypto making it increasingly rare. So it&#39;s likely to be a good investment, regardless.</p>\n\n<p>In summary, finding the next SHIB with 100,000,000% gains is highly unlikely. Please don&#39;t encourage people to search for this. It will lead to a bunch of bad decisions and frustration.</p>\n</div><!-- SC_ON -->",
  "score": 230,
  "permalink": "/r/CryptoCurrency/comments/qrke8n/reality_check_there_arent_thousands_of_10000x/",
  "subreddit": "CryptoCurrency",
  "id": "qrke8n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This may be more of a rant. But honestly, the posts asking for the next 1000x\ncoin, the posts of telling people to DYOR, in order to get in early on some low\ncapped gem, are truly misleading.\n\nThe whole cryptoverse is expanding and rapidly evolving, so there will be new\ncryptos, especially in the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これはどちらかというと暴言に近いかもしれません。しかし、正直なところ、次の1000倍のコインを求める書き込みや\n次の1000倍のコインを求める書き込みや、上限の低い宝石を早く手に入れるためにDYORするように言う書き込みは、本当に誤解を招くものです。\nこれは本当に誤解を招く恐れがあります。\n\nクリプトバース全体が拡大し、急速に進化しているので、新しいクリプトが出てくるでしょう。\nそのため、新しいクリプト、特に...",
      "title": "現実を見てください。何千もの10000倍の宝石があなたを待っているわけではない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这可能更像是一种咆哮。但说实话，那些要求获得下一个1000倍的\n币的帖子，告诉人们为了早日获得一些低价的\n帽的宝石，这确实是一种误导。\n\n整个加密世界正在扩大并迅速发展，所以会有新的\n币，尤其是在...",
      "title": "现实的检验。没有成千上万的10000倍宝石在等着你"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這可能更像是一種咆哮。但說實話，那些要求獲得下一個1000倍的\n幣的帖子，告訴人們爲了早日獲得一些低價的\n帽的寶石，這確實是一種誤導。\n\n整個加密世界正在擴大並迅速發展，所以會有新的\n幣，尤其是在...",
      "title": "現實的檢驗。沒有成千上萬的10000倍寶石在等着你"
    }
  ]
}