{
  "author": "Two_Pickachu_One_Cup",
  "original_created_utc": 1652100430,
  "title": "What we are experiencing now, is the start of a global recession and there is no need to panic.",
  "created_utc": 1652117646,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Unless you are living under a rock, cryptocurrencies and the stock market are taking a beating with worse to come in the short term.&lt;/p&gt;\n\n&lt;p&gt;The likely explanation is that investors are moving money away from stocks and crypto into fiat, precious metals and other low risk options. &lt;/p&gt;\n\n&lt;p&gt;Rising inflation, rates, supply shortages, war, a pandemic are all combining to create a perfect storm.&lt;/p&gt;\n\n&lt;p&gt;I am confident that in the long term we will see crypto roar back as it always does. So long as you stick to holding through the storm (even if you are at a significant loss) the charts historically show that you will come out on top in the long run.&lt;/p&gt;\n\n&lt;p&gt;Let&amp;#39;s be honest though, it&amp;#39;s easier said than done. As crypto is so volatile and the majority of holders are sitting on significant losses, it might be tempting to panic sell at a loss.&lt;/p&gt;\n\n&lt;p&gt;But I firmly believe if we hold, DCA with whatever spare change we have, we will all come out much wealthier when crypto inevitably bounces back.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 312,
  "permalink": "/r/CryptoCurrency/comments/ulqg7o/what_we_are_experiencing_now_is_the_start_of_a/",
  "subreddit": "CryptoCurrency",
  "id": "ulqg7o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Unless you are living under a rock, cryptocurrencies and the stock market are\ntaking a beating with worse to come in the short term.\n\nThe likely explanation is that investors are moving money away from stocks and\ncrypto into fiat, precious metals and other low risk options.\n\nRising inflation,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "岩の下で暮らしているのでなければ、暗号通貨と株式市場は\n短期的にはさらに悪化する可能性があります。\n\n投資家が株式や暗号通貨から資金を移動させていることが原因だと思われます。\n投資家が株式や暗号通貨から、不換紙幣、貴金属、その他の低リスクのオプションに資金を移動させていることが考えられます。\n\nインフレ率の上昇、...",
      "title": "今、私たちが経験しているのは世界的な不況の始まりであり、パニックになる必要はない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "除非你生活在岩石下，否则加密货币和股票市场正在遭受打击，并且在短期内会更加糟糕。\n在短期内会有更大的打击。\n\n可能的解释是，投资者正在将资金从股票转移至\n加密货币进入法币、贵金属和其他低风险选项。\n\n通货膨胀上升，...",
      "title": "我们现在所经历的，是全球经济衰退的开始，没有必要恐慌。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "除非你生活在岩石下，否則加密貨幣和股票市場正在遭受打擊，並且在短期內會更加糟糕。\n在短期內會有更大的打擊。\n\n可能的解釋是，投資者正在將資金從股票轉移至\n加密貨幣進入法幣、貴金屬和其他低風險選項。\n\n通貨膨脹上升，...",
      "title": "我們現在所經歷的，是全球經濟衰退的開始，沒有必要恐慌。"
    }
  ]
}