{
  "author": "drtywlf",
  "the_new_excerpt": "As soon as it is decriminalized federally (which it will be due to the massive\nupset in Georgia), interstate commerce can commence as well as international\ntrade with our neighbors to the north and south, who have also legalized (Mexico\nrecently). It will sky rocket and all the “conservatives” will…",
  "original_created_utc": 1609986429,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "一旦它在联邦上非刑事化(这将是由于大规模的\n佐治亚州的混乱)，州际商业可以像国际贸易一样开始\n与我们北方和南方的邻国进行贸易，他们也已合法化(墨西哥\n最近)。它会像火箭一样飞涨，所有的“保守派”都会…",
      "title": "现在就买大麻吧！"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "一旦它在聯邦上非刑事化(這將是由於大規模的\n佐治亞州的混亂)，州際商業可以像國際貿易一樣開始\n與我們北方和南方的鄰國進行貿易，他們也已合法化(墨西哥\n最近)。它會像火箭一樣飛漲，所有的“保守派”都會…",
      "title": "現在就買大麻吧！"
    }
  ],
  "title": "Buy Cannabis Now!",
  "created_utc": 1610009539,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As soon as it is decriminalized federally (which it will be due to the massive upset in Georgia), interstate commerce can commence as well as international trade with our neighbors to the north and south, who have also legalized (Mexico recently). It will sky rocket and all the “conservatives” will wonder how all the potheads got so rich suddenly.</p>\n\n<p>Biden and Harris have admitted to their error in voting against cannabis in the past. I also believe that Biden will tout legalizing cannabis as one of his major achievements for his first 100 days. Which means they will pressure all those around them to vote to pass.</p>\n\n<p>Plus, why not legalize and tax it federally? We are kinda in the middle of a pandemic and the economy needs all the help it can get.</p>\n\n<p>The only ones who don’t want it legalized are crusty old farts. Support is huge for the green. </p>\n\n<p>Jump in now!</p>\n\n<p>Edit: Suggested Stocks</p>\n\n<p>TLRY - Recent merger has it set to blow</p>\n\n<p>GRWG - Has grow operations and sells equipment to growers.</p>\n\n<p>MJ - ETF of Cannabis stocks</p>\n\n<p>SNDL - Canadian company, but who doesn’t love a long call on a penny stock.</p>\n</div><!-- SC_ON -->",
  "score": 189,
  "permalink": "/r/stocks/comments/ks3gjc/buy_cannabis_now/",
  "subreddit": "stocks",
  "id": "ks3gjc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610100749685
}