{
  "author": "erdal_mutlu",
  "original_created_utc": 1624711285,
  "title": "Mass Influx of Bitcoin Miners are Coming to Texas",
  "created_utc": 1624743034,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The Chinese government&#39;s call to crack down on bitcoin mining and trading has triggered a phenomenon known as &quot;mining migration&quot; in the encryption circle.</p>\n\n<p>Texas in the United States is an ideal destination for miners, thanks to its abundant solar and wind resources, an unregulated market, and a political stance friendly to cryptocurrency.</p>\n\n<p>Despite the lack of energy reserves that led to power outages for several days last winter, Texas has one of the lowest energy prices in the world, and its share of renewable energy is growing, with 20% of the state&#39;s electricity coming from wind as of 2019. It has a loosely regulated grid that allows customers to choose between power suppliers and, most importantly, its political leaders are very supportive of encryption - the ideal condition for a miner to find a popular and cheap source of energy.</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/CryptoCurrency/comments/o8a1sk/mass_influx_of_bitcoin_miners_are_coming_to_texas/",
  "subreddit": "CryptoCurrency",
  "id": "o8a1sk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The Chinese government's call to crack down on bitcoin mining and trading has\ntriggered a phenomenon known as \"mining migration\" in the encryption circle.\n\nTexas in the United States is an ideal destination for miners, thanks to its\nabundant solar and wind resources, an unregulated market, and a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "中国政府がビットコインの採掘と取引を取り締まると発表したことで\n中国政府がビットコインの採掘や取引を取り締まることを発表したことで、暗号化の世界では「マイニング・マイグレーション」と呼ばれる現象が起きています。\n\n米国のテキサス州は、豊富な太陽光発電と風力発電の資源、規制のない市場、そして......と、採掘者にとって理想的な移住先です。\n米国テキサス州は、豊富な太陽光と風力の資源、規制のない市場、そして...",
      "title": "大量のビットコイン採掘者がテキサスにやってくる"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "中国政府呼吁打击比特币挖矿和交易，引发了加密圈内的 \"挖矿移民 \"现象。\n引发了一个在加密圈内被称为 \"采矿迁移 \"的现象。\n\n美国的德克萨斯州是矿工们的理想目的地，因为它拥有\n丰富的太阳能和风能资源，一个不受管制的市场，以及一个...",
      "title": "大批比特币矿工涌入德州"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "中國政府呼籲打擊比特幣挖礦和交易，引發了加密圈內的 \"挖礦移民 \"現象。\n引發了一個在加密圈內被稱爲 \"採礦遷移 \"的現象。\n\n美國的德克薩斯州是礦工們的理想目的地，因爲它擁有\n豐富的太陽能和風能資源，一個不受管制的市場，以及一個...",
      "title": "大批比特幣礦工湧入德州"
    }
  ]
}