{
  "author": "i_post_gibberish",
  "the_new_excerpt": "I know what it celebrates, and of course I know Juneteenth is a portmanteau of\nJune and nineteenth, but why is it just named after the date rather than being\nEmancipation Day or Liberation Day or something? And why is it the celebration\nof emancipation, rather than the date of the Emancipation…",
  "original_created_utc": 1624023110,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "何を祝う日なのかは知っているし、もちろんJuneteenthが6月と19日のポートマンテウであることも知っている。\nしかし、なぜ「奴隷解放の日」や「解放の日」ではなく、単に日付にちなんだ名前なのでしょうか？\n解放記念日」とか「解雇記念日」とかではなく、なぜ日付だけの名前なのでしょうか？そして、なぜ奴隷解放を祝う日なのでしょうか？\nそして、なぜ奴隷解放の日ではなく、奴隷解放を祝う日なのでしょうか...。",
      "title": "なぜこの祝日が \"Juneteenth \"と呼ばれているのか、また、テキサス州以外ではどのように祝われるようになったのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道它庆祝的是什么，当然我也知道六一儿童节是六月和十九日的组合词。\n但为什么它只是以日期命名，而不是以解放日或解放日命名？\n解放日或解放日什么的？而且为什么它是庆祝\n庆祝解放，而不是庆祝解放日...",
      "title": "为什么这个节日被称为 \"六一\"，它是如何在德克萨斯州以外的地区被庆祝的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道它慶祝的是什麼，當然我也知道六一兒童節是六月和十九日的組合詞。\n但爲什麼它只是以日期命名，而不是以解放日或解放日命名？\n解放日或解放日什麼的？而且爲什麼它是慶祝\n慶祝解放，而不是慶祝解放日...",
      "title": "爲什麼這個節日被稱爲 \"六一\"，它是如何在德克薩斯州以外的地區被慶祝的？"
    }
  ],
  "title": "Why is the holiday called “Juneteenth”, and how did it come to be celebrated outside of Texas?",
  "created_utc": 1624041192,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I know <em>what</em> it celebrates, and of course I know Juneteenth is a portmanteau of June and nineteenth, but why is it just named after the date rather than being Emancipation Day or Liberation Day or something? And why is it <em>the</em> celebration of emancipation, rather than the date of the Emancipation Proclamation or the Thirteenth Amendment or something?</p>\n\n<p>I’m Canadian, so forgive me if this stuff is already widely-known in the US; Wikipedia doesn’t seem to have anything.</p>\n</div><!-- SC_ON -->",
  "score": 108,
  "permalink": "/r/AskHistorians/comments/o2p66g/why_is_the_holiday_called_juneteenth_and_how_did/",
  "subreddit": "AskHistorians",
  "id": "o2p66g",
  "is_self": true,
  "media": null,
  "is_video": false
}