{
  "author": "pichusine",
  "original_created_utc": 1632513218,
  "title": "Why do gay people talk like that?",
  "created_utc": 1632533640,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I don&#39;t mean this in any way to be homophobic or hateful. I&#39;m just curious. Almost every person that talks like that, I immediately think are gay, and most times I&#39;ve been right.</p>\n\n<p>This also isn&#39;t a race thing, as I&#39;ve heard white and black people talk the same way. </p>\n\n<p>So back to the question. Do you all talk like that on purpose or is that how you have always talked.</p>\n\n<p>Again this post is not meant to hate, its just a curious question I&#39;ve been thinking about. Continue being happy :)</p>\n</div><!-- SC_ON -->",
  "score": 180,
  "permalink": "/r/TooAfraidToAsk/comments/pur9pt/why_do_gay_people_talk_like_that/",
  "subreddit": "TooAfraidToAsk",
  "id": "pur9pt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I don't mean this in any way to be homophobic or hateful. I'm just curious.\nAlmost every person that talks like that, I immediately think are gay, and most\ntimes I've been right.\n\nThis also isn't a race thing, as I've heard white and black people talk the same\nway.\n\nSo back to the question. Do you…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "決して同族嫌悪や憎悪を込めているわけではありません。ただ、興味があるだけです。\nそのようなことを言う人のほとんどは、すぐにゲイだと思ってしまいますし、ほとんどの人は\nそして、ほとんどの場合、私は正しかったのです。\n\nこれは人種の問題ではなく、白人と黒人が同じように話すのを聞いたことがあるからです。\n話すのを聞いたことがあります。\n\nでは、質問に戻ります。あなたは...",
      "title": "なぜゲイの人たちはそんなことを言うの？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的意思是，这绝不是恐同或仇恨的意思。我只是很好奇。\n几乎每一个这样说话的人，我都会立即认为是同性恋，而且大多数时候我都是对的。\n大多数时候我都是对的。\n\n这也不是种族问题，因为我听过白人和黑人说过同样的话。\n方式。\n\n所以回到问题上。你是否...",
      "title": "为什么同性恋者会这样说话？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的意思是，這絕不是恐同或仇恨的意思。我只是很好奇。\n幾乎每一個這樣說話的人，我都會立即認爲是同性戀，而且大多數時候我都是對的。\n大多數時候我都是對的。\n\n這也不是種族問題，因爲我聽過白人和黑人說過同樣的話。\n方式。\n\n所以回到問題上。你是否...",
      "title": "爲什麼同性戀者會這樣說話？"
    }
  ]
}