{
  "author": "GuatemalanSinkhole",
  "original_created_utc": 1647790551,
  "title": "Men who have been to prison... is the \"don't drop the soap\" myth real?",
  "created_utc": 1647796502,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This was literally a shower thought as I actually dropped the soap, though I was showering by myself.&lt;/p&gt;\n\n&lt;p&gt;I guess the point of my question is: I&amp;#39;ve heard this phrase as a joke more than anything, but is there really a tangible risk of getting penetrated in the anal cavity in the prison shower if you drop the soap? Is it an urban legend, or are inmates actually careful to not drop the soap while showering?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 551,
  "permalink": "/r/TooAfraidToAsk/comments/tino7p/men_who_have_been_to_prison_is_the_dont_drop_the/",
  "subreddit": "TooAfraidToAsk",
  "id": "tino7p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "This was literally a shower thought as I actually dropped the soap, though I was\nshowering by myself.\n\nI guess the point of my question is: I've heard this phrase as a joke more than\nanything, but is there really a tangible risk of getting penetrated in the anal\ncavity in the prison shower if you…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは、実際に石鹸を落としてしまったので、文字通りシャワーのような思いでした、が。\n一人でシャワーを浴びている。\n\n質問のポイントは、このフレーズを冗談で聞いたことがあるということです。\nしかし、肛門を貫通される危険は本当にあるのでしょうか？\n刑務所のシャワーで、もし...",
      "title": "刑務所経験者の男性たち...「石鹸を落とすな」神話は本当なのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这简直是洗澡时的想法，因为我真的掉了肥皂，虽然我是\n我是一个人在洗澡。\n\n我想我的问题是：我听过这句话，更多的是作为一个笑话。\n但是，如果在监狱里洗澡，肛门真的有被插入的风险吗？\n但在监狱里洗澡时，肛门真的有被插入的实际风险吗，如果你...",
      "title": "坐过牢的男人...... \"不掉肥皂 \"的神话是真的吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這簡直是洗澡時的想法，因爲我真的掉了肥皂，雖然我是\n我是一個人在洗澡。\n\n我想我的問題是：我聽過這句話，更多的是作爲一個笑話。\n但是，如果在監獄裏洗澡，肛門真的有被插入的風險嗎？\n但在監獄裏洗澡時，肛門真的有被插入的實際風險嗎，如果你...",
      "title": "坐過牢的男人...... \"不掉肥皂 \"的神話是真的嗎？"
    }
  ]
}