{
  "author": "ultron290196",
  "the_new_excerpt": "The technology in the Cryptocurrency space will continually evolve and there\nwill always be a next \"Bitcoin killer\" or a \"Better Bitcoin\". Then there will a\nkiller of the \"Bitcoin Killer\". This can go on forever and we'll be lost on the\nway.\n\nThe true value of the first Bitcoin lies in the legacy…",
  "original_created_utc": 1621117519,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号通貨分野の技術は常に進化し続けています。\n次の「ビットコインキラー」や「より良いビットコイン」が必ず出てきます。そして、そこには\nBitcoin Killer」のキラー。これは永遠に続く可能性があり、私たちは途中で迷ってしまう\n途中でね。\n\n最初のビットコインの真の価値は、レガシーにある...。",
      "title": "BTCをバカにしている人は、サトシ・ナカモトがやったことは再現できないということを理解すべきだ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "加密货币领域的技术将不断发展，总会有下一个 \"B\"。\n总是会有下一个 \"比特币杀手 \"或 \"更好的比特币\"。然后会有一个\n比特币杀手 \"的杀手。这可能会一直持续下去，而我们会在途中迷失。\n路。\n\n第一个比特币的真正价值在于它的遗产...",
      "title": "贬低BTC的人应该明白这一点，中本聪所做的一切是无法重现的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "加密貨幣領域的技術將不斷髮展，總會有下一個 \"B\"。\n總是會有下一個 \"比特幣殺手 \"或 \"更好的比特幣\"。然後會有一個\n比特幣殺手 \"的殺手。這可能會一直持續下去，而我們會在途中迷失。\n路。\n\n第一個比特幣的真正價值在於它的遺產...",
      "title": "貶低BTC的人應該明白這一點，中本聰所做的一切是無法重現的。"
    }
  ],
  "title": "People who belittle BTC should understand this, what Satoshi Nakamoto did cannot be recreated.",
  "created_utc": 1621129875,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The technology in the Cryptocurrency space will continually evolve and there will always be a next &quot;Bitcoin killer&quot; or a &quot;Better Bitcoin&quot;. Then there will a killer of the &quot;Bitcoin Killer&quot;. This can go on forever and we&#39;ll be lost on the way.</p>\n\n<p>The true value of the first Bitcoin lies in the legacy and it has intrinsic factors that can not be recreated again. What Satoshi invented would be impossible today. There is no CEO. There is no founder. There is no single attack point. Same cannot be said for the rest of the next generation cryptos. </p>\n\n<p>The value of this cannot be understated.</p>\n</div><!-- SC_ON -->",
  "score": 2475,
  "permalink": "/r/CryptoCurrency/comments/nda2wg/people_who_belittle_btc_should_understand_this/",
  "subreddit": "CryptoCurrency",
  "id": "nda2wg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590798344
}