{
  "author": "NWheelspin",
  "the_new_excerpt": "At the height of the dot-com boom in '99, investors were so caught up in the\nrise of a new industry that they threw money at anything with a website,\nregardless of the fundamentals. With the incredible rise of TSLA, I think we are\nat risk for a similar phenomenon with EV startups. It seems like…",
  "original_created_utc": 1610420326,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在99年网络股热潮的高峰期，投资者们是如此地被卷入了\n兴起的一个新行业，他们把钱扔在任何有网站的地方。\n无论基本面如何。随着TSLA的不可思议的崛起，我认为我们是\n有可能出现类似的电动车创业公司现象。似乎...",
      "title": "PSA：现在是对电动车初创企业持怀疑态度的好时机。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在99年網絡股熱潮的高峯期，投資者們是如此地被捲入了\n興起的一個新行業，他們把錢扔在任何有網站的地方。\n無論基本面如何。隨着TSLA的不可思議的崛起，我認爲我們是\n有可能出現類似的電動車創業公司現象。似乎...",
      "title": "PSA：現在是對電動車初創企業持懷疑態度的好時機。"
    }
  ],
  "title": "PSA: This is a good time to be skeptical of EV startups",
  "created_utc": 1610502911,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>At the height of the dot-com boom in &#39;99, investors were so caught up in the rise of a new industry that they threw money at anything with a website, regardless of the fundamentals. With the incredible rise of TSLA, I think we are at risk for a similar phenomenon with EV startups. It seems like everyone and their dog has an EV company right now. If you have a website and a flashy design concept, there is a lot of money to be made with investor cash.</p>\n\n<p><strong>I am not saying don&#39;t invest in these startups, but there are a few things to keep in mind:</strong></p>\n\n<ul>\n<li>It&#39;s incredibly difficult and capital-intensive to start a car company. History is littered with failures in this industry (See Fisker, Faraday Future, Delorean, etc.).</li>\n<li>Elon Musk is a savvy businessman, shrewd technologist, and a master of publicity. He is the exception among startup CEOs, not the rule. He built Tesla with a diligent plan; and even then barely made it at times (See original roadster launch issues, Model 3 production issues). He is Tesla&#39;s greatest asset and we shouldn&#39;t assume that his success can be easily replicated.</li>\n<li>Traditional car companies have been slow to start, but they now realize EVs are the future and are starting to come out with their own models. While EV technology may be new to them, they have a huge advantage in terms of manufacturing infrastructure and expertise that will make it even harder for EV startups to gain foothold in the market.</li>\n</ul>\n\n<p>The bottom line here is that investors should have realistic expectations about the chance of a new company&#39;s success. Investors who missed out on TSLA will be driven by FOMO to throw money at anything with four wheels and a battery. This can attract scammers (See Theranos) who want some of that easy capital. It&#39;s smart to be vigilant when there is so much hype around a particular industry.</p>\n\n<p><strong>TLDR</strong> - Invest in whatever makes sense for you, but be cautious and don&#39;t let FOMO take control.</p>\n</div><!-- SC_ON -->",
  "score": 446,
  "permalink": "/r/stocks/comments/kvirkw/psa_this_is_a_good_time_to_be_skeptical_of_ev/",
  "subreddit": "stocks",
  "id": "kvirkw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706381341
}