{
  "author": "the_ent_in_student",
  "original_created_utc": 1639426675,
  "title": "If a random person has the resources available and decides to build a rocket in their backyard to permanently move to the moon, building a home there and sending resupply ships at regular intervals, would any government try to stop them? How would a situation like this be handled?",
  "created_utc": 1639437237,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I know this scenario is unlikely, but let&amp;#39;s assume the person tells no one and just does it. They make it to the moon and start to build their home, with food, water and oxygen tanks coming regularly. They&amp;#39;ve successfully moved to the moon on their own accord, claiming no nation but that of humankind.&lt;/p&gt;\n\n&lt;p&gt;Is it illegal? If so, under who&amp;#39;s jurisdiction would this fall? I&amp;#39;d assume the easiest thing to do would be to stop the resupply ships and cut off food/oxygen, but let&amp;#39;s assume the ships launch from random locations that can&amp;#39;t be found until they&amp;#39;re already launched.&lt;/p&gt;\n\n&lt;p&gt;Would someone try to bring them back to Earth? What if they refuse to go back? I think it would be a cool movie idea but wonder what would ACTUALLY happen or if there&amp;#39;s a protocol for something like this.&lt;/p&gt;\n\n&lt;p&gt;Edit: Folks are pointing out that it&amp;#39;s not possible to build a rocket undetected. This is a very fair point. For the sake of fun, let&amp;#39;s assume a tech billionaire with existing rockets and infrastructure goes rogue and stays on the moon indefinitely, lying about what was supposed to be a three hour tour.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 129,
  "permalink": "/r/NoStupidQuestions/comments/rfozxy/if_a_random_person_has_the_resources_available/",
  "subreddit": "NoStupidQuestions",
  "id": "rfozxy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I know this scenario is unlikely, but let's assume the person tells no one and\njust does it. They make it to the moon and start to build their home, with food,\nwater and oxygen tanks coming regularly. They've successfully moved to the moon\non their own accord, claiming no nation but that of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このシナリオはありえないとは思いますが、その人が誰にも言わずに\nを実行するだけです。彼らは月にたどり着き、家を建て始めます。食料もあります。\n水と酸素ボンベは定期的にやってくる。彼らは月への移住に成功した\n自分たちの意志で、国も主張せず...",
      "title": "もし、ある人が資源を持っていて、裏庭でロケットを作って月に永久に移住し、そこに家を建て、定期的に補給船を送ることを決めたら、政府はそれを止めようとするでしょうか？このような状況にはどのように対処しますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道这种情况不太可能，但我们假设这个人没有告诉任何人，而是\n就这样做。他们到了月球，并开始建造他们的家，有食物。\n水和氧气罐定期到来。他们已经成功地搬到了月球\n在他们自己的意愿下，没有要求任何国家，但...",
      "title": "如果一个随机的人拥有可用的资源，并决定在他们的后院建造一个火箭，永久地搬到月球上，在那里建造一个家，并定期发送补给船，任何政府会试图阻止他们吗？像这样的情况会如何处理？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道這種情況不太可能，但我們假設這個人沒有告訴任何人，而是\n就這樣做。他們到了月球，並開始建造他們的家，有食物。\n水和氧氣罐定期到來。他們已經成功地搬到了月球\n在他們自己的意願下，沒有要求任何國家，但...",
      "title": "如果一個隨機的人擁有可用的資源，並決定在他們的後院建造一個火箭，永久地搬到月球上，在那裏建造一個家，並定期發送補給船，任何政府會試圖阻止他們嗎？像這樣的情況會如何處理？"
    }
  ]
}