{
  "author": "roberthonker",
  "the_new_excerpt": "This sub has been growing like crazy lately, and the majority of this is people\nlooking to make some money, whether from crypto itself or from moons. I totally\nget being attracted to crypto with the dreams of buying a new car or whatever,\nthis is what got me into it as well.\n\nHowever, I think…",
  "original_created_utc": 1619651549,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブサイトは最近非常に成長していますが、その大半は、クリプトそのものやムー\n儲けようとしている人たちで、暗号そのものからでも、ムーンからでも。私は完全に\n新しい車を買うなどの夢を持ってcryptoに惹かれるのはよくわかります。\n私もそれで夢中になりました。\n\nしかし、私が思うに...",
      "title": "お金のために暗号に参加しているのなら、時間をかけて技術について学んでください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这个子项目最近一直在疯狂增长，其中大部分是人们\n想赚点钱，无论是从加密货币本身还是从月球。我完全\n我完全理解被加密货币所吸引，梦想着买一辆新车或其他东西。\n这也是让我进入其中的原因。\n\n然而，我认为...",
      "title": "如果你是为了钱而加入加密货币，那就花点时间了解一下技术。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個子項目最近一直在瘋狂增長，其中大部分是人們\n想賺點錢，無論是從加密貨幣本身還是從月球。我完全\n我完全理解被加密貨幣所吸引，夢想着買一輛新車或其他東西。\n這也是讓我進入其中的原因。\n\n然而，我認爲...",
      "title": "如果你是爲了錢而加入加密貨幣，那就花點時間瞭解一下技術。"
    }
  ],
  "title": "If you’re in crypto for the money, take some time to learn about the tech.",
  "created_utc": 1619692232,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This sub has been growing like crazy lately, and the majority of this is people looking to make some money, whether from crypto itself or from moons. I totally get being attracted to crypto with the dreams of buying a new car or whatever, this is what got me into it as well. </p>\n\n<p>However, I think <strong>everyone</strong> should take some time to understand basic crypto principles. Watch some YouTube videos, browse some guides on this sub, read a book (I hear the Bitcoin standard is good). I promise that it’s not as boring as it sounds, and it will really open your eyes to the potential that crypto has. Thanks for reading!</p>\n</div><!-- SC_ON -->",
  "score": 171,
  "permalink": "/r/CryptoCurrency/comments/n0rdzg/if_youre_in_crypto_for_the_money_take_some_time/",
  "subreddit": "CryptoCurrency",
  "id": "n0rdzg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380959891
}