{
  "author": "blothhundrr",
  "original_created_utc": 1634223755,
  "title": "It is officially FOMO time!",
  "created_utc": 1634236243,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The market&#39;s on a tear. </p>\n\n<p>Pretty much everything is up, following BTC&#39;s recent run. DOT went bonanza over Parachain news from yesterday, and ETH looking like it&#39;s not gonna let its rival runaway with it. Both seemingly on course to new ATHs. </p>\n\n<p>Everything else is decently up too, even LINK recovering from its slump this week. BNB back in top 3 (unfortunately, apparently, cause I don&#39;t know shit about fuck). </p>\n\n<p>ALGO Governance is about an hour away, with many anticipating it will shoot ALGO straight to the fucking moon (doubt it). </p>\n\n<p>Basically everything is up except for.... SHIB (fuck yea!).  Not down enough, of course. More like moving sideways, which tbh is troubling to see in a shitcoin. </p>\n\n<p>Like hay fever during the spring, and hail the size of the balls of God himself during summer here in Aussie, no other outcome from this market is more inevitable than FOMO. And I&#39;m experiencing all 3 today, in that order. </p>\n\n<p>Somebody please talk me out of FOMO-ing. And to make things worse, I&#39;ve got about $1k fiat just sitting in my exchange, originally meant for a dip. Give me one good reason why I shouldn&#39;t throw all that in. </p>\n\n<p>Or better yet, give me suggestions as to what I should throw my money at.</p>\n\n<p>Maybe it is FOMO time. Or maybe it&#39;s Lambo time, am I right?</p>\n</div><!-- SC_ON -->",
  "score": 171,
  "permalink": "/r/CryptoCurrency/comments/q81is4/it_is_officially_fomo_time/",
  "subreddit": "CryptoCurrency",
  "id": "q81is4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The market's on a tear.\n\nPretty much everything is up, following BTC's recent run. DOT went bonanza over\nParachain news from yesterday, and ETH looking like it's not gonna let its rival\nrunaway with it. Both seemingly on course to new ATHs.\n\nEverything else is decently up too, even LINK recovering…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "市場は絶好調だ。\n\nBTCの最近の動きを受けて、かなり多くのものが上昇しています。DOTはボナンザを超えた\nDOTは昨日のParachainのニュースで大当たりし、ETHはライバルのiBookの暴走を許さないようだ。\nETHはライバルの暴走を許さないようだ。どちらも新たなATHを目指しているようだ。\n\nLINKも回復してきているし、他のものもちゃんと上がっているし...。",
      "title": "これは公式にFOMOタイムです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "市场在不断发展。\n\n几乎所有的东西都在上涨，继BTC最近的运行之后。DOT在昨天的新闻中大放异彩\n昨天的消息，ETH看起来不会让它的竞争对手\n逃之夭夭。两者似乎都在向新的ATH迈进。\n\n其他的东西也都有不错的涨幅，甚至LINK也在恢复......",
      "title": "现在是正式的FOMO时间!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "市場在不斷髮展。\n\n幾乎所有的東西都在上漲，繼BTC最近的運行之後。DOT在昨天的新聞中大放異彩\n昨天的消息，ETH看起來不會讓它的競爭對手\n逃之夭夭。兩者似乎都在向新的ATH邁進。\n\n其他的東西也都有不錯的漲幅，甚至LINK也在恢復......",
      "title": "現在是正式的FOMO時間!"
    }
  ]
}