{
  "author": "Zeen454545",
  "the_new_excerpt": "I kind of glanced at their financials after ordering pizza online while waiting\nfor the delivery, I didn't go too in depth so maybe I am missing something,\nmaybe their negative equity is a result of accounting tricks. I know they have\nbeen profitable every year since 2005, I looked as far back as…",
  "original_created_utc": 1619670675,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "オンラインでピザを注文した後、配達を待っている間に、彼らの財務状況をちょっと見てみた。\n深くは見ていないので、もしかしたら何か見逃しているかもしれません。\nもしかしたら、彼らのネガティブ・エクイティは、会計上のトリックの結果かもしれません。彼らが2005年以降、毎年利益を上げていることは知っています。\n2005年以降、毎年利益を出していることは知っています。私は過去にさかのぼって調べましたが...。",
      "title": "ドミノ・ピザは、2005年の時点でバランスシートにマイナスの資本を抱えていたにもかかわらず、どのようにして株式としての価値を高めてきたのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在网上订了比萨饼后，在等待送餐的过程中瞥了一眼他们的财务状况。\n我没有深入研究，所以也许我错过了什么。\n也许他们的负资产是会计技巧的结果。我知道他们自2005年以来\n自2005年以来，他们每年都是盈利的，我最远看了......",
      "title": "尽管多米诺披萨公司的资产负债表上早在2005年就出现了负资产，但该公司的股票却表现良好。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在網上訂了比薩餅後，在等待送餐的過程中瞥了一眼他們的財務狀況。\n我沒有深入研究，所以也許我錯過了什麼。\n也許他們的負資產是會計技巧的結果。我知道他們自2005年以來\n自2005年以來，他們每年都是盈利的，我最遠看了......",
      "title": "儘管多米諾披薩公司的資產負債表上早在2005年就出現了負資產，但該公司的股票卻表現良好。"
    }
  ],
  "title": "How has dominos pizza done well as a stock despite the company having negative equity as far back as 2005 on their balance sheet",
  "created_utc": 1619713612,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I kind of glanced at their financials after ordering pizza online while waiting for the delivery, I didn&#39;t go too in depth so maybe I am missing something, maybe their negative equity is a result of accounting tricks. I know they have been profitable every year since 2005, I looked as far back as 2005 on macro trends since that is the earliest It allows. Their cash from operations is positive and they buy back shares, Maybe I don&#39;t fully understand what negative equity means, but as far as I know this means the business should fail and the shareholders have claim to nothing, any explanations?</p>\n</div><!-- SC_ON -->",
  "score": 82,
  "permalink": "/r/investing/comments/n0wtio/how_has_dominos_pizza_done_well_as_a_stock/",
  "subreddit": "investing",
  "id": "n0wtio",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380965862
}