{
  "author": "TNGSystems",
  "the_new_excerpt": "Do any of these symptoms sound familiar?\n\n * Low gaming or PC performance?\n * Sluggish Windows performance?\n * PC has stopped going to sleep when idle?\n   \n * CPU temps are too hot?\n   \n\nIf so, you may have some Cryptocurrency mining Malware on your PC.\n\nThis happened to me a couple years ago, I'm…",
  "original_created_utc": 1619435690,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これらの症状に心当たりはありませんか？\n\n * ゲームやPCのパフォーマンスが低い？\n * Windowsのパフォーマンスが低下していませんか？\n * PCはアイドル時にスリープ状態にならなくなった？\n   \n * CPUの温度が高すぎる？\n   \n\nもしそうなら、あなたのPCには暗号通貨を採掘するマルウェアがあるかもしれません。\n\nこれは数年前に私に起こったことで、私は...",
      "title": "より多くの人に知ってもらうためにここに掲載します。あなたのPCでは、気づかないうちに賢い小さなCrypto-minerが実行されているかもしれません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这些症状中是否有听起来很熟悉的？\n\n *游戏或PC性能低下？\n *Windows性能低下？\n *电脑在闲置时不再进入睡眠状态？\n   \n * CPU温度太高？\n   \n\n如果是这样，你的电脑上可能有一些加密货币挖掘恶意软件。\n\n这种情况几年前发生在我身上，我...",
      "title": "在这里发帖是为了提高知名度--你可能有一个聪明的小Crypto-miner在你的电脑上运行，甚至不知道它。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這些症狀中是否有聽起來很熟悉的？\n\n *遊戲或PC性能低下？\n *Windows性能低下？\n *電腦在閒置時不再進入睡眠狀態？\n   \n * CPU溫度太高？\n   \n\n如果是這樣，你的電腦上可能有一些加密貨幣挖掘惡意軟件。\n\n這種情況幾年前發生在我身上，我...",
      "title": "在這裏發帖是爲了提高知名度--你可能有一個聰明的小Crypto-miner在你的電腦上運行，甚至不知道它。"
    }
  ],
  "title": "Posting here for more visibility - you may have a clever little Crypto-miner running on your PC and not even know it.",
  "created_utc": 1619454788,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Do any of these symptoms sound familiar?  </p>\n\n<ul>\n<li>Low gaming or PC performance?</li>\n<li>Sluggish Windows performance? </li>\n<li>PC has stopped going to sleep when idle?<br/></li>\n<li>CPU temps are too hot?<br/></li>\n</ul>\n\n<p>If so, you may have some Cryptocurrency mining Malware on your PC.  </p>\n\n<p>This happened to me a couple years ago, I&#39;m very tech savvy and don&#39;t usually have PC problems. Anything that goes wrong hardware I can fix and on the rare occurrence I get a software problem a quick bit of Google-Fu is all I need to get back on track. However, this one stumped me.  </p>\n\n<p>I noticed my PC wasn&#39;t sleeping any more. I&#39;d leave it idle and when I came back hours later, it wasn&#39;t off. I usually set it to turn off after 30 minutes, but it would stay on, sometimes all night etc. I also noticed that my process was not running at it&#39;s Idle clockspeed (FYI, your processor runs slower when it&#39;s not doing anything to save power)  and finally, I noticed using HWMonitor that my CPU temps should be at about 40c at idle, were instead about 60-70c!  </p>\n\n<p>I looked through Task Manager to identify if there were any strange looking .exe&#39;s and after googling all the application names I did not immediately recognise, I thought to download MalwareBytes and run a scan.  </p>\n\n<p>Straight away it identified I had a cryptocurrency miner on my PC, and this is the part that impresses me, it actually de-activated itself if I went into Task Manager, then re-activated itself when I left. <em>Clever girl.</em>  </p>\n\n<p>Some quick googling told me it was a Monero Crypto miner malware. God knows how it got on my PC, probably a drive by from a dodgy Crypto newsfeed website. I don&#39;t make a habit of downloading and running strange programs nor opening emails I don&#39;t trust, so I&#39;m a bit stumped how it got there, but it was running for weeks! Think of all that Monero I mined! The bastards.  </p>\n\n<p>Anyway, MalwareBytes is free to download and use, it will probably pester you to buy it so there&#39;s no harm in downloading it, checking your PC and then uninstalling it.</p>\n\n<p>Hopefully this helps someone out.</p>\n</div><!-- SC_ON -->",
  "score": 336,
  "permalink": "/r/CryptoCurrency/comments/myvaj3/posting_here_for_more_visibility_you_may_have_a/",
  "subreddit": "CryptoCurrency",
  "id": "myvaj3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776210471
}