{
  "author": "teh-monk",
  "original_created_utc": 1629546645,
  "title": "Sold all my crypto and paid off a 360k student loan",
  "created_utc": 1629556240,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey guys! I have been a crypto enthusiast since mid 2017. I went to a school in the US and graduated with 360k in student loans for my doctorate. </p>\n\n<p>I averaged in to BTC, ETH, and LTC during 2017 and  started seeing some nice gains. Then I got heavy into altcoins, specifically raiblocks (now Nano). My small investment of about 10k went to 70k very quickly. This was an amazing feeling that only a crypto investor can understand. I was young and about 27. Greed combined with euphoria became a part of me. &quot;This can&#39;t drop and if it does it can&#39;t drop much, this is the future!&quot; I told myself repeatedly.</p>\n\n<p>Sure enough I held through the bear market. God damn was that hard. I lost about 95% of my 70k portfolio in a matter of months. Red day after red day. A constant bloodbath.</p>\n\n<p>I never stopped believing in crypto. Bought more in 2019 and kept adding slowly. Meanwhile I was also aggressively paying down my loan with 4.5k a month and living with my in-laws to save where I could. </p>\n\n<p>The recent parabolic rise to 65k was amazing. I began to feel the ultimate sign of a potential top, euphoria. I knew this feeling well and experienced it on that New Years Eve of 2017. Things are going great and I have a potentially life changing amount of money.   </p>\n\n<p>I told myself not this time around. I refuse to hold through another bear market, this euphoria is a sign. So I sold it all; about 2 Bitcoin for 120k. With my hard work and aggressive stance on loan payback I paid off my entire loan of 360k in five years and crypto was a huge part of that.</p>\n\n<p>This is a success story and hopefully it can reach someone that needs to hear this when your time comes. I am so sad to not have those bitcoins but when you can change your life make the difficult and mature decision, do it.</p>\n\n<p>Cheers.</p>\n</div><!-- SC_ON -->",
  "score": 383,
  "permalink": "/r/Bitcoin/comments/p8q3br/sold_all_my_crypto_and_paid_off_a_360k_student/",
  "subreddit": "Bitcoin",
  "id": "p8q3br",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hey guys! I have been a crypto enthusiast since mid 2017. I went to a school in\nthe US and graduated with 360k in student loans for my doctorate.\n\nI averaged in to BTC, ETH, and LTC during 2017 and started seeing some nice\ngains. Then I got heavy into altcoins, specifically raiblocks (now Nano).…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。私は2017年半ばからクリプト愛好家になりました。の学校に通っていました。\nアメリカの学校に通い、博士号を取得するために360kの学生ローンを抱えて卒業しました。\n\n私は2017年にBTC、ETH、LTCに平均的に参加し、いくつかの素晴らしい利益を見始めました。\n利益を得ました。その後、私はアルトコインに重きを置き、具体的にはraiblocks（現在はNano）....。",
      "title": "保有する暗号をすべて売却し、36万円の学生ローンを完済しました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嘿，伙计们！我是一个加密货币爱好者。我从2017年年中开始成为一名加密货币的爱好者。我去了美国的一所学校\n美国的一所学校，毕业时有36万的学生贷款，用于我的博士学位。\n\n我在2017年期间平均加入了BTC、ETH和LTC，并开始看到一些不错的\n收益。然后，我开始大量进入altcoins，特别是raiblocks（现在的Nano）....",
      "title": "卖掉了我所有的加密货币，还清了36万的学生贷款"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嘿，夥計們！我是一個加密貨幣愛好者。我從2017年年中開始成爲一名加密貨幣的愛好者。我去了美國的一所學校\n美國的一所學校，畢業時有36萬的學生貸款，用於我的博士學位。\n\n我在2017年期間平均加入了BTC、ETH和LTC，並開始看到一些不錯的\n收益。然後，我開始大量進入altcoins，特別是raiblocks（現在的Nano）....",
      "title": "賣掉了我所有的加密貨幣，還清了36萬的學生貸款"
    }
  ]
}