{
  "author": "Layneeeee",
  "original_created_utc": 1627391439,
  "title": "The top 50 Cryptocurrencies, each explained with one sentence: the updated version",
  "created_utc": 1627399824,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It&#39;s been 6 months since my previous <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/lg1yhv/for_the_newcomers_the_top_50_cryptocurrencies/\">post</a> trying to sum up the biggest cryptos in a few words. I feel like an updated version is long due and so here we are.</p>\n\n<p>As usual, if something is wrong or you would like to make a correction, feel free to comment. It&#39;s obviously hard to sum up each project in a few words, but I tried my best.</p>\n\n<p>Terms used:</p>\n\n<ul>\n<li>If I refer to layer-2 solutions, that means a protocol or framework built on top of an existing blockchain and trying to increase transaction speed or scaling.</li>\n<li><a href=\"https://en.wikipedia.org/wiki/Proof_of_work\">PoW</a>: Proof of Work</li>\n<li><a href=\"https://en.wikipedia.org/wiki/Proof_of_stake\">PoS</a>: Proof of Stake</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<ol>\n<li><strong>Bitcoin (BTC):</strong> the original cryptocurrency. The first Bitcoin was mined on January 3, 2009 and since then it has become much more of a Store of Value than a currency, given its scarcity and high security, although layer 2 solutions like the Lightning network allows for fast and cheap transactions.</li>\n<li><strong>Ethereum (ETH):</strong> the coin of the Ethereum blockchain, the first smart contract platform and the one having the biggest ecosystem of decentralized applications around: since ETH price is used to pay fees to interact with the network, a bigger ecosystem means higher demand. It is (and will be) used for staking in Ethereum 2.0 (which is PoS).</li>\n<li><strong>Tether (USDT):</strong> the most discussed stablecoin around, pegged to the dollar price although many believe it is not fully backed: for this reason its market cap has been decreasing for the first time ever and other stablecoins are gaining traction.</li>\n<li><strong>Binance Coin (BNB):</strong> the official Binance coin and the one used to pay fees on the Binance Smart Chain, a blockchain like Ethereum but less decentralized and with cheaper fees (not counting any layer 2 solutions).</li>\n<li><strong>Cardano (ADA):</strong> the coin of the PoS blockchain Cardano, created by the Ethereum co-founder Charles Hoskinson and developed strictly following peer-reviewed research, which slowed down development. Lots of partnerships and a big community make it one of the biggest ETH contenders.</li>\n<li><strong>Ripple (XRP):</strong> a centralized coin trying to redefine online payments, has had a rough time after the SEC went after it but seemingly it&#39;s coming out on top.</li>\n<li><strong>USD Coin (USDC):</strong> another stablecoin tied to the dollar and managed by the company Circle. Considered more trustworthy than Tether, it&#39;s been growing non-stop adoption-wise.</li>\n<li><strong>Dogecoin (DOGE):</strong> such wow, even higher ranking than last time. <em>sigh</em></li>\n<li><strong>Polkadot (DOT):</strong> it&#39;s the coin of Polkadot, a multichain protocol aiming to connect different chains, both public and private, allowing to transfer data between one another or to create new custom blockchains. ChainLink&#39;s oracle pallet and Kusama are examples of projects built on top of it.</li>\n<li><strong>Binance USD (BUSD):</strong> another stablecoin pegged to the dollar, managed by Binance in partnership with Paxos.</li>\n<li><strong>Uniswap (UNI):</strong> the first token on the list, it&#39;s used to govern the decentralized trading protocol Uniswap, probably the biggest and most known DeFi application built on Ethereum.</li>\n<li><strong>Bitcoin Cash (BCH):</strong> a fork of Bitcoin trying to increase scalability and lower transaction fees increasing the blockchain block size, which achieves these features but reduces <a href=\"https://www.lexology.com/library/detail.aspx?g=f32dac47-a7a6-4e5d-af5b-28e4f1d87287\">decentralization</a>.</li>\n<li><strong>Litecoin (LTC):</strong> Bitcoin younger brother, been around since 2011. It&#39;s based on the Bitcoin code but with some tweaks, lowering transaction speed and cost, many sees it as the &quot;silver&quot; of crypto since it&#39;s been around for so long.</li>\n<li><strong>Chainlink (LINK):</strong> between one Ganon and the other Link is also the official token of ChainLink, a network that basically bridges off-chain data with smart contracts: an example is Synthetix, a derivatives protocol that uses Chainlink to get the price feed of a certain asset on their smart contract.</li>\n<li><strong>Solana (SOL):</strong> one of the latest Ethereum contenders, launched in 2020 and offering possibly the highest layer-1 thoughput of all (50k transaction per second!), but is still somewhat centralized (although this is being addressed) and has yet to build a competitive ecosystem.</li>\n<li><strong>Wrapped Bitcoin (WBTC):</strong> it&#39;s a tokenized version of Bitcoin so it can be used on the Ethereum network and in DeFi applications.</li>\n<li><strong>Polygon (MATIC):</strong> the most popular layer-2 solution for Ethereum, Matic is the official coin of Polygon and used to pay fees on it: many Ethereum applications are moving there but it&#39;s still not easy to use with few exchanges supporting it directly.</li>\n<li><strong>Ethereum Classic (ETC):</strong> native token of the Ethereum Classic blockchain, a hard fork of Ethereum that claims to be more tied to Ethereum original plan. It has suffered various 51% attacks in the past years.</li>\n<li><strong>Stellar (XLM):</strong> created by an ex-Ripple founder, its aim is to become a currency and to allow to trade assets in a cheap and fast way. Last time I joked it was a 40c stablecoin, now I wished that held true.</li>\n<li><strong>THETA (THETA):</strong>  The token of THETA, a decentralized video delivery network (in a p2p fashion), used mainly for governance.</li>\n<li><strong>DAI (DAI):</strong> the biggest stablecoin not pegged 1-to-1 (or at least not claiming to) to the dollar, but soft-pegged and using cryptocurrencies deposited in smart contracts to collaterize the newly minted tokens.</li>\n<li><strong>Internet Computer (ICP):</strong> after its disastrous launch earlier this year, it almost overthrew Dogecoin as the biggest meme in the space. Jokes aside, it&#39;s a blockchain aiming to revolutionize the current internet, claiming to run at the same speed as the current web.</li>\n<li><strong>VeChain (VET):</strong>  Once everyone&#39;s favorite coin in this sub, was hit hard in the May crash and only lately recovering. Vechain is a blockchain focusing on business use-cases and supply chain management, VET (and VTHO) are the blockchain&#39;s official coins.</li>\n<li><strong>Filecoin (FIL):</strong>  the most popular IPFS (Interplentary File System), a peer-to-peer storage network without having to rely on cloud storage companies.</li>\n<li><strong>TRON (TRX):</strong> have you seen Silicon Valley, when they try to create a decentralized internet? Yeah, Tron&#39;s founder Justin Sun is like Jian-Yang, great at repackaging other projects (thanks to <a href=\"/u/fbslo\">u/fbslo</a> on the last post). Jokes aside, it&#39;s a blockchain platform for decentralized applications more focused on content sharing and entertainment.</li>\n<li><strong>Monero (XMR):</strong>  Monero&#39;s goal is  to allow transactions to take place privately and with anonymity. Even though it’s commonly thought that BTC can conceal a person’s identity, Monero obscures even senders and recipients whereas BTC doesn&#39;t. </li>\n<li><strong>Aave (AAVE):</strong> a lending-borrowing decentralized protocol on Ethereum (and Polygon), the AAVE token grants discounted fees on the platform and act as a governance token.</li>\n<li><strong>TERRA (LUNA):</strong> Terra is a blockchain protocol offering a variety of applications, from stablecoins to synthetic assets and stocks. LUNA is the native token used to stabilize the price of UST (the TERRA stablecoin) and peg it to the dollar, and can be used to pay fees on the network.</li>\n<li><strong>EOS (EOS):</strong> another PoS blockchain launched in 2018, aimed at being highly scalable for commercial use. It is designed to make it as straightforward as possible for programmers to embrace the blockchain technology. </li>\n<li><strong>Crypto.com Coin (CRO):</strong> the native token of the Crypto.com chain and the Crypto.com exchange. Similar to the BNB token, it is closely tied to the success of the exchange.</li>\n<li><strong>AMP (AMP):</strong> it&#39;s an Ethereum token and it&#39;s used as collateral on the Flexa network, covering any financial transactions that fail if the need arises.</li>\n<li><strong>Axie Infinity (AXS):</strong> without a doubt the most popular blockchain game, a mix of Pokémon and Tamagotchi that follows the Play-To-Earn model. AXS is the token used for governance and soon staking.</li>\n<li><strong>PancakeSwap (CAKE):</strong> the most popular decentralized exchange on the Binance Smart Chain, it started off as a copy of the Uniswap AMM model to then provide a variety of services.</li>\n<li><strong>FTX Token (FTT):</strong> the native token of the FTX platform, specialized in trading derivatives. It can be used as collateral or for discounts on trading fees.</li>\n<li><strong>Bitcoin BEP2 (BTCB):</strong> another tokenized version of Bitcoin, this time on the Binance Smart Chain.</li>\n<li><strong>The Graph (GRT):</strong>  It is an indexing protocol for querying networks like Ethereum and IPFS like Filecoin. Basically simplyfing the retrieval of data on blockchains for developers and applications.</li>\n<li><strong>Algorand (ALGO):</strong> founded by the MIT professor Silvio Micali, it&#39;s a PoS blockchain supporting smart contracts, with low fees and high throughput of operations.</li>\n<li><strong>UNUS SED LEO (LEO):</strong>  A utility token related to the iFinex ecosystem which allows you to save money on trading fees in Bitfinex. </li>\n<li><strong>Maker (MKR):</strong> Maker is a token on the ethereum blockchain use for governance of the MakerDAO and Maker protocol, the organization behind the DAI stablecoin.</li>\n<li><strong>Cosmos (ATOM):</strong> dubbed the &quot;internet of blockchains&quot; by its founders, it solves the problem of interoperability between blockchains and provides tools to developers to build their own blockchains. Atom is the coin powering the platform and some notable projects built on top of it are Terra and Crypto.com chain.</li>\n<li><strong>SHIBA INU (SHIB):</strong> a meme coin that exploded in May, recently ShibaSwap was launched to give some sort of use-case to the coin which got a 3% score by DeFi Safety (later updated to 35%).</li>\n<li><strong>Bitcoin SV (BSV):</strong> a hard fork of a hard fork (BCH), it claims to be the true Satoshi Nakamoto vision of Bitcoin with an even bigger block size. Can&#39;t come up with a better joke than last time, I&#39;m sorry.</li>\n<li><strong>Tezos (XTZ):</strong> another PoS Ethereum competitor. XTZ is the official coin used for governance and staking. One characteristic is that it is unforkable: it&#39;s impossible to create duplicates as instead happened with Bitcoin and Ethereum.</li>\n<li><strong>Klaytn (KLAY):</strong> a blockchain using a hybrid design between public and private chains, allowing anyone to create their own chain easily and without any technical knowledge, trying to appeal to companies and institutions mainly.</li>\n<li><strong>NEO (NEO):</strong>  <em>Noone can be told what it is, you&#39;ll have to see if for yourself.</em> Just kidding: launched in early 2014, it&#39;s a blockchain not too different from Ethereum where NEO is the coin used for governance. It has a Smart Economy System using digital assets (linked to a physical one) and verificable digital identities on smart contracts. </li>\n<li><strong>IOTA (MIOTA):</strong>  open-source decentralized cryptocurrency engineered for the Internet of Things,  it uses a inventive blockless blockchain where users and verifiers of transactions are the same, with zero transactions fees and good scalability.</li>\n<li><strong>Compound (COMP):</strong> it&#39;s the governance token of Compound, a borrowing and lending platform not too different from Aave, launched in 2018 and with one of the biggest locked value of DeFi applications.</li>\n<li><strong>TerraUSD (UST):</strong> it&#39;s a decentralized algorithmic stablecoin pegged to the US dollar. It is available in different blockchains and it&#39;s getting more and more adoption, rising the price of Luna (which is directly tied to the demand for UST).</li>\n<li><strong>Avalanche (AVAX):</strong>  open-source platform aiming to become a global asset exchange. With an high throughput and good scalability, anyone can launch any form of asset and control it in a decentralized way with smart contracts. </li>\n<li><strong>Theta Fuel (TFUEL):</strong> it&#39;s another native token of the Theta blockchain, it acts as a gas token to power the operations on the blockchain and is used for payments to relayers (users sharing their computing power).</li>\n</ol>\n\n<p>If you got this far, thanks for reading. Hope you found it useful in some way.</p>\n</div><!-- SC_ON -->",
  "score": 262,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/XHcAMV1KeNfOFN9zQX6DrAj2gssprqoaduDfIsg24OM.jpg?auto=webp&s=7de2ac1db1d6bb7282cbe94e515ec9f552b9804d",
          "width": 550,
          "height": 151
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/XHcAMV1KeNfOFN9zQX6DrAj2gssprqoaduDfIsg24OM.jpg?width=108&crop=smart&auto=webp&s=14a6ba845e6e1c0308baad1504125fe51ac2626e",
            "width": 108,
            "height": 29
          },
          {
            "url": "https://external-preview.redd.it/XHcAMV1KeNfOFN9zQX6DrAj2gssprqoaduDfIsg24OM.jpg?width=216&crop=smart&auto=webp&s=d0a3c1f766e9f7f9a118c68feba4276b54122735",
            "width": 216,
            "height": 59
          },
          {
            "url": "https://external-preview.redd.it/XHcAMV1KeNfOFN9zQX6DrAj2gssprqoaduDfIsg24OM.jpg?width=320&crop=smart&auto=webp&s=8591045b335d6da4c8df935cdecb2f4fbfc2def9",
            "width": 320,
            "height": 87
          }
        ],
        "variants": {},
        "id": "U2qV4wYciLj8h_eKuehMY3i1qBQLtEcbZcCFV4Z7FcQ"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/osmj8v/the_top_50_cryptocurrencies_each_explained_with/",
  "subreddit": "CryptoCurrency",
  "id": "osmj8v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It's been 6 months since my previous post\n[https://www.reddit.com/r/CryptoCurrency/comments/lg1yhv/for_the_newcomers_the_top_50_cryptocurrencies/]\ntrying to sum up the biggest cryptos in a few words. I feel like an updated\nversion is long due and so here we are.\n\nAs usual, if something is wrong or…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "前回の投稿から6ヶ月が経過しました。\n[https://www.reddit.com/r/CryptoCurrency/comments/lg1yhv/for_the_newcomers_the_top_50_cryptocurrencies/]\n最大のクリプトを一言でまとめてみました。最新版が必要だと感じています。\n更新されたバージョンが待ち望まれていたので、ここに紹介します。\n\nいつものように、もし何か間違っていたり...。",
      "title": "暗号通貨トップ50、それぞれを一文で解説：アップデート版"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "距离我的上一篇文章已经过去6个月了\n[https://www.reddit.com/r/CryptoCurrency/comments/lg1yhv/for_the_newcomers_the_top_50_cryptocurrencies/]\n试图用几个字来总结最大的加密货币。我觉得一个更新的\n版本是早就应该的，所以我们就在这里。\n\n像往常一样，如果有什么不对或...",
      "title": "前50种加密货币，每一种都用一句话来解释：最新版本"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "距離我的上一篇文章已經過去6個月了\n[https://www.reddit.com/r/CryptoCurrency/comments/lg1yhv/for_the_newcomers_the_top_50_cryptocurrencies/]\n試圖用幾個字來總結最大的加密貨幣。我覺得一個更新的\n版本是早就應該的，所以我們就在這裏。\n\n像往常一樣，如果有什麼不對或...",
      "title": "前50種加密貨幣，每一種都用一句話來解釋：最新版本"
    }
  ]
}