{
  "author": "cyclist2001",
  "the_new_excerpt": "My conversation with my wife's uncle this weekend, I'm preaching Bitcoin. Then\nhe states, \"but Bitcoin isn't real.\" To which I ask. \"Tell me when you got your\nstimulus from Uncle Sam how did you receive it?\" He says, \"direct deposit.\nWhy?\". To which I respond, \"how do you know it's real? You didn't…",
  "original_created_utc": 1617901707,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今週末の妻の叔父との会話では、ビットコインを説いています。すると\n彼は \"でもビットコインは本物ではない \"と言いました。それに対して私は尋ねました。\"アンクルサムから景気刺激策を受けたとき、どうだったか教えてくれないか？\nどうやって受け取ったんだ？\" と聞くと 彼は「直接預金」と答えました。\nなぜですか」。それに対して私は、「どうしてそれが本物だとわかるんですか？あなたは...",
      "title": "実際の会話では、\"でもビットコインは実在しない\""
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这个周末我和老婆舅舅的对话，我在讲比特币。然后\n他说，\"但比特币不是真的。\" 我问他. \"告诉我你什么时候有了你的\n\"山姆大叔给你的刺激 你是怎么收到的？\" 他说，\"直接存款。\n为什么？\" 我回答说：\"你怎么知道它是真的？你没有...",
      "title": "实际对话，\"但比特币不是真的\"。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個週末我和老婆舅舅的對話，我在講比特幣。然後\n他說，\"但比特幣不是真的。\" 我問他. \"告訴我你什麼時候有了你的\n\"山姆大叔給你的刺激 你是怎麼收到的？\" 他說，\"直接存款。\n爲什麼？\" 我回答說：\"你怎麼知道它是真的？你沒有...",
      "title": "實際對話，\"但比特幣不是真的\"。"
    }
  ],
  "title": "Actual conversation, \"but Bitcoin isn't real.\"",
  "created_utc": 1617924651,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My conversation with my wife&#39;s uncle this weekend, I&#39;m preaching Bitcoin.  Then he states, &quot;but Bitcoin isn&#39;t real.&quot; To which I ask. &quot;Tell me when you got your stimulus from Uncle Sam how did you receive it?&quot; He says, &quot;direct deposit. Why?&quot;. To which I respond, &quot;how do you know it&#39;s real? You didn&#39;t receive actual dollars, just a credit to your account.  How do we know there are enough physical dollars to cover all the direct deposits?&quot;.  He says, &quot;we don&#39;t.&quot;. I ask again, &quot;So again how do we know it&#39;s real?  They just added some zeros to the ballance sheet and accredited everyone&#39;s account. Sure you can withdraw it but  Now there is magically more money.  And every dollar you have is now worth less because of it. Where as Bitcoin there will only ever be 21million full bitcoins&quot;. He didn&#39;t respond but I could see the light come on.  So I just left the subject there for him to wash rinse and repeat in his mind. I&#39;m sure he&#39;ll come around I just hope it&#39;s not too late when he does.</p>\n</div><!-- SC_ON -->",
  "score": 455,
  "permalink": "/r/Bitcoin/comments/mmwecd/actual_conversation_but_bitcoin_isnt_real/",
  "subreddit": "Bitcoin",
  "id": "mmwecd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566610327
}