{
  "author": "thefriendlycanadian",
  "original_created_utc": 1625563417,
  "title": "Milestone achieved! $1,000 passive income earned from daily interest payments!",
  "created_utc": 1625581841,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I began staking (lending technically in my case) my crytos at the end of May after the big dip. I wanted a way to earn passive income on my BTC, ETH, BNB and some other large holdings I own. I&#39;m not comfortable staking my ETH towards 2.0 at this time. I wanted an option that paid out daily and it was important I could remove my funds anytime. I found a solution I love.</p>\n\n<p>I&#39;m thrilled that a few days ago I officially passed the $1000 interest mark! That&#39;s right, $1000 earned from doing absolutely nothing. $1000 that is compounding and earning interest now too!</p>\n\n<p>The funny thing, my friends all laughed at the APR rates (6.5-12%) when I told them about the solution I found. I believe one friend said &quot;Those are weak returns man...&quot; Well, those weak returns can pay a few mortgage payments if I decided to liquidate...</p>\n\n<p>There is something gloriously amazing about earning a passive income from your crypto. It&#39;s addicting.</p>\n\n<p>Make sure you have your crypto working for you! Don&#39;t be afraid of staking / lending. Start researching it and ask questions. So many amazing redditors are here to help.</p>\n\n<p>//EDIT - LFG!!!! Due to the market pump, my interest payments have reached ATH of $1197 which I just converted to USDT. Win win baby!</p>\n</div><!-- SC_ON -->",
  "score": 195,
  "permalink": "/r/CryptoCurrency/comments/oerft4/milestone_achieved_1000_passive_income_earned/",
  "subreddit": "CryptoCurrency",
  "id": "oerft4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I began staking (lending technically in my case) my crytos at the end of May\nafter the big dip. I wanted a way to earn passive income on my BTC, ETH, BNB and\nsome other large holdings I own. I'm not comfortable staking my ETH towards 2.0\nat this time. I wanted an option that paid out daily and it…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は5月末に自分のクライトをステーク（私の場合は技術的に貸すこと）し始めました。\n大暴落の後です。私は、BTC、ETH、BNB、その他の大量の保有資産から受動的な収入を得る方法を求めていました。\n私は自分のBTC、ETH、BNBやその他の大量の保有物から受動的な収入を得る方法を探していました。現時点でETHを2.0に向けて賭けることには抵抗があります。\n現時点では。私は、毎日支払われるオプションが欲しかったのですが、それは...",
      "title": "マイルストーン達成! 毎日の利払いで1,000ドルのパッシブインカムを獲得!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在五月底开始为我的加密货币做抵押（在我看来是技术上的借贷）。\n大跌之后。我想用我的BTC、ETH、BNB等赚取被动收入。\n我所拥有的一些其他大型资产的被动收入。我不愿意把我的ETH押在2.0上。\n的时候。我想要一个每日支付的期权，而且它...",
      "title": "取得了里程碑式的成就! 从每日利息支付中获得1000美元的被动收入!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在五月底開始爲我的加密貨幣做抵押（在我看來是技術上的借貸）。\n大跌之後。我想用我的BTC、ETH、BNB等賺取被動收入。\n我所擁有的一些其他大型資產的被動收入。我不願意把我的ETH押在2.0上。\n的時候。我想要一個每日支付的期權，而且它...",
      "title": "取得了里程碑式的成就! 從每日利息支付中獲得1000美元的被動收入!"
    }
  ]
}