{
  "author": "gorays21",
  "the_new_excerpt": "NVIDIA today announced at its annual Investor Day that first quarter revenue for\nfiscal 2022 is tracking above its previously provided outlook, with\noutperformance in each of its market platforms.\n\n“While our fiscal 2022 first quarter is not yet complete, Q1 total revenue is\ntracking above the $5.30…",
  "original_created_utc": 1618253749,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "エヌビディアは本日、年次投資家デーにおいて、2022年度第1四半期の収益が従来の見通しを上回ったことを発表しました。\n2022年度の第1四半期の収益は、以前に発表した見通しを上回りました。\n各市場プラットフォームにおいて、より高いパフォーマンスを達成しました。\n\n\"2022年度の第1四半期はまだ終わっていませんが、第1四半期の総売上高は\n第1四半期の総売上高は、前回発表した5.30ドルを上回りました。",
      "title": "NVIDIA、2022年度第1四半期の収益が見通しを上回ったことを発表"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "英伟达公司今天在其年度投资者日上宣布，英伟达公司第一季度营收为1.5亿美元。\n2022财年的业绩高于其之前提供的展望，其中包括\n在其每个市场平台上都有出众的表现。\n\n\"虽然我们的2022财年第一季度还没有完成，但第一季度的总收入是\n追踪5. 30美元以上...",
      "title": "英伟达宣布2022财年第一季度营收跟踪高于预期水平"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "英偉達公司今天在其年度投資者日上宣佈，英偉達公司第一季度營收爲1.5億美元。\n2022財年的業績高於其之前提供的展望，其中包括\n在其每個市場平臺上都有出衆的表現。\n\n\"雖然我們的2022財年第一季度還沒有完成，但第一季度的總收入是\n追蹤5. 30美元以上...",
      "title": "英偉達宣佈2022財年第一季度營收跟蹤高於預期水平"
    }
  ],
  "title": "NVIDIA Announces First Quarter Fiscal 2022 Revenue Tracking Above Outlook",
  "created_utc": 1618270302,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>NVIDIA today announced at its annual Investor Day that first quarter revenue for fiscal 2022 is tracking above its previously provided outlook, with outperformance in each of its market platforms.</p>\n\n<p>“While our fiscal 2022 first quarter is not yet complete, Q1 total revenue is tracking above the $5.30 billion outlook provided during our fiscal year-end earnings call. We are experiencing broad-based strength, with all our market platforms driving upside to our initial outlook,” said Colette Kress, executive vice president and chief financial officer of NVIDIA.</p>\n\n<p><a href=\"https://www.google.com/amp/s/finance.yahoo.com/amphtml/news/nvidia-announces-first-quarter-fiscal-180700090.html\">https://www.google.com/amp/s/finance.yahoo.com/amphtml/news/nvidia-announces-first-quarter-fiscal-180700090.html</a></p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/stocks/comments/mpkmub/nvidia_announces_first_quarter_fiscal_2022/",
  "subreddit": "stocks",
  "id": "mpkmub",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566618923
}