{
  "author": "Crypthomie",
  "original_created_utc": 1628420487,
  "title": "Speculation: I believe that Kraken is considering Moon being a solid project as they already made a hidden page to explain its concept.",
  "created_utc": 1628447438,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I learned today that Kraken already made a webpage to explain everything about Moon. Honestly, I thought it was BS at first so I went to check myself.</p>\n\n<p>I can&#39;t link the address here, so to find it, just type Kraken <a href=\"/r/cryptocurrency\">r/cryptocurrency</a> on google search and it will appear at the top.</p>\n\n<p>What does it mean for the future of Moon?</p>\n\n<p>Well first of all, Kraken is one of the most reputable exchange that ever been made since the existence of crypto, and they really choose what they add to their list of coin being traded.</p>\n\n<p>From my point of view, I think they consider Moon a solid project, and I would not be surprised if they listed it soon after the mainnet release.</p>\n\n<p>It would definitely propulse the price to a new level that I can&#39;t imagine right now and also open the gate to real liquidity and easy access to buy it!</p>\n\n<p>It would be followed by plenty exchanges and make Moon a legitimate crypto amongst other cryptos.</p>\n\n<p>Why do I say that it&#39;s an hidden page at the moment?</p>\n\n<p>Because it doesn&#39;t appear yet on the list they made to learn more about certain coins, but it&#39;s here, you just have to google it for now, and maybe it will be officially added once they list it.</p>\n\n<p>It&#39;s all speculation guys, but it really excites me for the future of moon!</p>\n\n<p>Edit: it’s actually not hidden, and can be found in the section &quot;crypto guides&quot;. It’s actually an even better news.</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/p0cowj/speculation_i_believe_that_kraken_is_considering/",
  "subreddit": "CryptoCurrency",
  "id": "p0cowj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So I learned today that Kraken already made a webpage to explain everything\nabout Moon. Honestly, I thought it was BS at first so I went to check myself.\n\nI can't link the address here, so to find it, just type Kraken r/cryptocurrency\n[/r/cryptocurrency] on google search and it will appear at the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日、KrakenがMoonの全てを説明するウェブページを既に作っていることを知りました。\n月についてのすべてを説明するページを作っていることを知りました。正直なところ、最初はBSだと思っていたので、自分で確認してみました。\n\nアドレスをここにリンクすることはできないので、見つけるにはKraken r/cryptocurrencyと入力してください。\n[/r/cryptocurrency]とgoogle検索で入力すると、表示されます。",
      "title": "憶測です。Krakenは、Moonのコンセプトを説明する隠しページを作っているので、Moonを確実なプロジェクトと考えているのではないでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我今天了解到，Kraken已经做了一个网页来解释关于月亮的一切\n关于月亮。说实话，我一开始以为是BS，所以我自己去查了。\n\n我不能在这里链接地址，所以要找到它，只要在谷歌搜索上输入Kraken r/cryptocurrency\n[/r/cryptocurrency] 在谷歌搜索上，它将出现在...",
      "title": "猜测。我相信Kraken认为Moon是一个可靠的项目，因为他们已经做了一个隐藏页面来解释其概念。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我今天瞭解到，Kraken已經做了一個網頁來解釋關於月亮的一切\n關於月亮。說實話，我一開始以爲是BS，所以我自己去查了。\n\n我不能在這裏鏈接地址，所以要找到它，只要在谷歌搜索上輸入Kraken r/cryptocurrency\n[/r/cryptocurrency] 在谷歌搜索上，它將出現在...",
      "title": "猜測。我相信Kraken認爲Moon是一個可靠的項目，因爲他們已經做了一個隱藏頁面來解釋其概念。"
    }
  ]
}