{
  "author": "KlutzyMathematician7",
  "original_created_utc": 1633176866,
  "title": "In Egypt Napoleon told his army, \"Soldiers, from the summit of these pyramids forty centuries look down upon you.\" How did he know the age of the pyramids?",
  "created_utc": 1633182768,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>When Napoleon supposedly said this, the three pyramids of Giza would have been 4300-4400 years old (by modern radiocarbon dates), making Napoleon&#39;s estimate remarkably close, allowing poetic license for round numbers. And whether or not the quote is invented, a cursory Googling of the quote gives me <a href=\"https://en.wikisource.org/wiki/Napoleon%27s_Addresses/Introduction\">this source</a>, making it at least as old as 1897, well before modern radiocarbon dating.</p>\n\n<p>There&#39;s also the wider historiographical question of how much a learned person of Napoleon&#39;s time knew about Bronze Age civilizations in the first place, and what they would have thought of them (if any). He would have definitely known the Roman Empire existed 1800 years before him and Hannibal 2000 years before, but that begs the question of why he would make the leap to a date 2000 years before what was ancient history even to him.</p>\n</div><!-- SC_ON -->",
  "score": 147,
  "permalink": "/r/AskHistorians/comments/pzu0z0/in_egypt_napoleon_told_his_army_soldiers_from_the/",
  "subreddit": "AskHistorians",
  "id": "pzu0z0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "When Napoleon supposedly said this, the three pyramids of Giza would have been\n4300-4400 years old (by modern radiocarbon dates), making Napoleon's estimate\nremarkably close, allowing poetic license for round numbers. And whether or not\nthe quote is invented, a cursory Googling of the quote gives me…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ナポレオンがこのように言ったとされる時、ギザの3つのピラミッドは4300～4400年前（現代の放射性炭素年代測定による）のものであった。\n4300-4400年前（現代の放射性炭素年代測定法による）であり、ナポレオンの推定値は非常に近い。\nナポレオンの推定値は非常に近いものとなります。また、引用の有無にかかわらず\nこの引用が創作であろうとなかろうと、グーグルでざっと調べてみると...。",
      "title": "エジプトでナポレオンは軍隊に「兵士たちよ、このピラミッドの頂上から40世紀が君たちを見下ろしている」と言った。彼はどうやってピラミッドの年代を知ったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当拿破仑说这句话的时候，吉萨的三座金字塔应该是\n4300-4400年（根据现代放射性碳测定），使拿破仑的估计\n使得拿破仑的估计非常接近，允许对整数进行诗意的许可。不管这句话是不是\n这句话是否被发明了，在谷歌上粗略地搜索了一下这句话，我发现......",
      "title": "在埃及，拿破仑对他的军队说：\"士兵们，从这些金字塔的山顶上，40个世纪都在看着你们。\" 他是如何知道金字塔的年龄的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當拿破崙說這句話的時候，吉薩的三座金字塔應該是\n4300-4400年（根據現代放射性碳測定），使拿破崙的估計\n使得拿破崙的估計非常接近，允許對整數進行詩意的許可。不管這句話是不是\n這句話是否被髮明瞭，在谷歌上粗略地搜索了一下這句話，我發現......",
      "title": "在埃及，拿破崙對他的軍隊說：\"士兵們，從這些金字塔的山頂上，40個世紀都在看着你們。\" 他是如何知道金字塔的年齡的？"
    }
  ]
}