{
  "author": "Fmtservices",
  "the_new_excerpt": "I’m always hearing the same things in this sub: “Binance locked me out” “Binance\nis a centralized exchange” “CZ bad”\n\nObviously I’m not knocking on the validity of these claims. However, in my\npersonal experience I enjoy using Binance more than CB or CB pro. I’ve been able\nto buy into low cap alts…",
  "original_created_utc": 1619374876,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブではいつも同じことを聞いています。\"Binanceにロックアウトされた」「Binanceは中央集権的な取引所」「CZは悪い\nは中央集権的な取引所だ」「CZが悪い」。\n\nもちろん、これらの主張の正当性を非難しているわけではありません。しかし、私の個人的な経験では\n個人的な経験では、CBやCB proよりもBinanceを使うことを楽しんでいます。私はローキャップのアルトを買うことができました。\nローキャップのアルトを買うことができました...",
      "title": "人気のない意見。BInanceは、アメリカに住んでいない限り、素晴らしい。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在这个子里总是听到同样的话。\"Binance把我锁在外面\" \"Binance\n是一个中心化的交易所\"\"CZ不好\"\n\n显然，我不是在敲打这些说法的正确性。然而，在我\n我喜欢使用Binance多于CB或CB pro。我已经能够\n买入低市值的alts...",
      "title": "不受欢迎的意见。只要你不居住在美国，BInance就很好。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在這個子裏總是聽到同樣的話。\"Binance把我鎖在外面\" \"Binance\n是一箇中心化的交易所\"\"CZ不好\"\n\n顯然，我不是在敲打這些說法的正確性。然而，在我\n我喜歡使用Binance多於CB或CB pro。我已經能夠\n買入低市值的alts...",
      "title": "不受歡迎的意見。只要你不居住在美國，BInance就很好。"
    }
  ],
  "title": "Unpopular Opinion: BInance is great as long as you don’t reside in the US.",
  "created_utc": 1619405424,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m always hearing the same things in this sub:\n“Binance locked me out”\n“Binance is a centralized exchange”\n“CZ bad”</p>\n\n<p>Obviously I’m not knocking on the validity of these claims. However, in my personal experience I enjoy using Binance more than CB or CB pro. I’ve been able to buy into low cap alts prior to their uplistings into other exchanges. The UI is pretty slick and for the most part I’ve never had an issue with them. I feel like a lot of these issues encountered could be attributed to the User. \nThe reality is that Binance has been doing a pretty decent job of being a crypto exchange. \nI’ve never had an issue moving funds in and out of the app since I set up all of my 2FA.</p>\n\n<p>I can’t be the only person who uses this exchange on the regular with zero problems.</p>\n\n<p><em>I’m not a Binance US user so I can’t attest to whatever’s been going on in that neck of the woods</em></p>\n</div><!-- SC_ON -->",
  "score": 240,
  "permalink": "/r/CryptoCurrency/comments/mye4zo/unpopular_opinion_binance_is_great_as_long_as_you/",
  "subreddit": "CryptoCurrency",
  "id": "mye4zo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776210457
}