{
  "author": "Liquid_Padpo",
  "the_new_excerpt": "A lot of people are posting through this sub saying how they had losses on GME,\nor other meme stocks, and you’re not alone. These people go on to say that they\nhave learned a lot from this experience and losing money on it taught them a\nvalue lesson. For me, it did too. I lost around $500 from GME…",
  "original_created_utc": 1612367814,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "很多人通过这个子发帖，说自己在GME上如何亏损。\n或其他备忘录股票，你并不孤单。这些人继续说，他们\n从这次经历中学到了很多东西，赔钱也让他们学会了很多东西\n价值课。对我来说，也是如此。我从GME上损失了大约500美元... ...",
      "title": "在GME、AMC或任何其他备忘录股票上赔钱，可能是你对自己最好的财务投资。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "很多人通過這個子發帖，說自己在GME上如何虧損。\n或其他備忘錄股票，你並不孤單。這些人繼續說，他們\n從這次經歷中學到了很多東西，賠錢也讓他們學會了很多東西\n價值課。對我來說，也是如此。我從GME上損失了大約500美元... ...",
      "title": "在GME、AMC或任何其他備忘錄股票上賠錢，可能是你對自己最好的財務投資。"
    }
  ],
  "title": "Losing money on GME, AMC or any other meme stocks may have been the best financial investment in yourself you’ve ever made.",
  "created_utc": 1612373188,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A lot of people are posting through this sub saying how they had losses on GME, or other meme stocks, and you’re not alone. These people go on to say that they have learned a lot from this experience and losing money on it taught them a value lesson. For me, it did too. I lost around $500 from GME exclusively, pocket change for some, make or brake cash for others! Regardless of what takeaways you had- this might just be a great investment in of itself if you now know some more self-control and due diligence. We learn a lot from our mistakes it’s how things go! So I hope that someone who might be down about losing money on this gig (if you’re out) will possibly look at this from a different angle! Anyways, back to what I know best from here! </p>\n\n<p>Thanks for reading!</p>\n</div><!-- SC_ON -->",
  "score": 313,
  "permalink": "/r/stocks/comments/lbqn9n/losing_money_on_gme_amc_or_any_other_meme_stocks/",
  "subreddit": "stocks",
  "id": "lbqn9n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518543321
}