{
  "author": "slvbtc",
  "original_created_utc": 1644703535,
  "title": "Cash app activating lightning is the biggest game changer. It is the tipping point. Exponentially accelerating adoption begins now.",
  "created_utc": 1644741174,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Cash app now enables its 70 million active users to send money internationally using lightning to any other lightning compatible wallet. Not only can users send funds instantly and for free to any other cash app user but also to any strike user or lightning wallet on earth. &lt;/p&gt;\n\n&lt;p&gt;This is how network effects start. Now all cash app users are compatible with all strike users and LN wallet users. Once venmo plugs into lightning all venmo users will be compatible with all cash app, strike and LN wallet users. At this point if you use any other app like paypal or transferwise or wechat or your banks online banking app you are not part of the network. You are not part of the group of people all connected to each other on lightning, and you are stuck within your one single app unable to interact with all of the people on the open lightning network. All you can do is send money to other people who happen to use the exact app you are using. Thats like only being able to send email to people who use the same email provider you use.&lt;/p&gt;\n\n&lt;p&gt;One by one apps plug into lightning and network effects take hold. If you don&amp;#39;t offer lightning compatibility you are essentially cut off from the world.&lt;/p&gt;\n\n&lt;p&gt;All of a sudden 10 of the largest financial and social apps and their 2 billion users are all on the lightning network and all freely transferring money between each other instantly and at no cost. If you are a merchant do you keep only accepting visa essentially alienating anyone using any financial app? Or do you download a lightning compatible POS app so any of those 2 billion people can pay you from their app of choice. You are a business person so you figure out how those 2 billion people can pay you from whatever app they use by making sure your business POS system is lightning compatible. All of a sudden people are paying you using messenger twitter whatsapp IG venmo cashapp and strike and you no longer need to pay visas extortionate 2% transaction fees so your profit margin doubles.&lt;/p&gt;\n\n&lt;p&gt;Its at this point anyone accepting visa looks like a dinosaur trying to only accept checks.&lt;/p&gt;\n\n&lt;p&gt;This all plays out within the next 24 to 36 months.&lt;/p&gt;\n\n&lt;p&gt;The world is about to change for the better.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 313,
  "permalink": "/r/Bitcoin/comments/sr2i2l/cash_app_activating_lightning_is_the_biggest_game/",
  "subreddit": "Bitcoin",
  "id": "sr2i2l",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Cash app now enables its 70 million active users to send money internationally\nusing lightning to any other lightning compatible wallet. Not only can users\nsend funds instantly and for free to any other cash app user but also to any\nstrike user or lightning wallet on earth.\n\nThis is how network…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "キャッシュアプリで7000万人のアクティブユーザーが国際送金を可能にしました。\nを使用して、Lightning対応の他のウォレットに接続することができます。ユーザーができること\n他のキャッシュアプリユーザーに無料で即座に資金を送ることができます。\nスト・ユーザーや地球上のLightningウォレットが対象です。\n\nこのように、ネットワーク...",
      "title": "キャッシュアプリのアクティベートライトニングが最大のゲームチェンジャーです。転換点なのです 指数関数的に加速する普及が今始まる。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "现金应用程序现在使其7000万活跃用户能够使用闪电在国际上汇款\n使用闪电向任何其他闪电兼容的钱包汇款。用户不仅可以\n用户不仅可以立即免费向其他任何现金应用程序用户发送资金，还可以向全球任何\n罢工用户或地球上的闪电钱包。\n\n这就是网络...",
      "title": "现金应用激活闪电是最大的游戏改变者。它是转折点。指数级加速的采用从现在开始。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "現金應用程序現在使其7000萬活躍用戶能夠使用閃電在國際上匯款\n使用閃電向任何其他閃電兼容的錢包匯款。用戶不僅可以\n用戶不僅可以立即免費向其他任何現金應用程序用戶發送資金，還可以向全球任何\n罷工用戶或地球上的閃電錢包。\n\n這就是網絡...",
      "title": "現金應用激活閃電是最大的遊戲改變者。它是轉折點。指數級加速的採用從現在開始。"
    }
  ]
}