{
  "author": "juarezweiss",
  "original_created_utc": 1652264740,
  "title": "Now it's not the time to be careless with your words - let's please have some empathy",
  "created_utc": 1652272993,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;em&gt;Disclaimer: I was invested in LUNA and UST so I&amp;#39;m talking from experience here&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;I just want to say to everyone using crypto social media in this past day, please please be very gentle with your words. There are &lt;strong&gt;a lot&lt;/strong&gt; of posts on Reddit talking about people losing their life savings, feeling &amp;quot;weirdly detached&amp;quot; from seeing their money vanish in thin air, and everyone panicking...&lt;/p&gt;\n\n&lt;p&gt;... and even then, you see other people commenting stuff like &amp;quot;I feel better about reading these posts, I would never trade leverage, my funds are safe&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;This is not the time to boast about your good decisions in other people&amp;#39;s misery posts.&lt;/strong&gt; People are attempting suicide. With people in this state, all it takes is a single comment reinforcing their &amp;quot;dumb&amp;quot; decisions for someone to take their lives away.&lt;/p&gt;\n\n&lt;p&gt;Please, please be gentle with your words during this time. Offer help, offer your presence if they need to talk.&lt;/p&gt;\n\n&lt;p&gt;We can talk about strategies and good/bad decisions after the fire is put off. For now, let&amp;#39;s just be human beings and support whoever is feeling lost in this shitstorm.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 419,
  "permalink": "/r/CryptoCurrency/comments/un6plb/now_its_not_the_time_to_be_careless_with_your/",
  "subreddit": "CryptoCurrency",
  "id": "un6plb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Disclaimer: I was invested in LUNA and UST so I'm talking from experience here\n\nI just want to say to everyone using crypto social media in this past day,\nplease please be very gentle with your words. There are a lot of posts on Reddit\ntalking about people losing their life savings, feeling…"
}