{
  "author": "BodomDeth",
  "the_new_excerpt": "What if this is the new standard?\n\nWhat if with COVID, people realized they had a lot of unused money laying around\nand they decided to invest it in stock, bitcoin, gold and even collectibles\n(pokémon, magic and figures have seen huge spikes on extra-rare items).\n\nOf course, there is the side of…",
  "original_created_utc": 1611629497,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "如果这是新的标准呢？\n\n如果有了COVID，人们意识到他们有很多闲置的钱，怎么办？\n他们决定将其投资于股票、比特币、黄金甚至收藏品上\n(pokémon、魔法和人偶的特级品出现了巨大的飙升)。\n\n当然，还有一方面是...",
      "title": "如果这不是泡沫--而是价格修正呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果這是新的標準呢？\n\n如果有了COVID，人們意識到他們有很多閒置的錢，怎麼辦？\n他們決定將其投資於股票、比特幣、黃金甚至收藏品上\n(pokémon、魔法和人偶的特級品出現了巨大的飆升)。\n\n當然，還有一方面是...",
      "title": "如果這不是泡沫--而是價格修正呢？"
    }
  ],
  "title": "What if this was not a bubble - but a price correction?",
  "created_utc": 1611690164,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>What if this is the new standard? </p>\n\n<p>What if with COVID, people realized they had a lot of unused money laying around and they decided to invest it in stock, bitcoin, gold and even collectibles (pokémon, magic and figures have seen huge spikes on extra-rare items).</p>\n\n<p>Of course, there is the side of people getting free checks and the government money printing. However, people who were getting free money were not the people who have a lot of buying power.</p>\n\n<p>People with buying power became those who substituted money from transport to benefitting from tax relief for their romote work (electricity, internet, etc).</p>\n\n<p>I can only see a crash happening when COVID is over and everything reopens (I thought this would&#39;ve already happened but look at where we are now). Then again, would people start selling off their stock/investments to go to the restaurant or to the bar?</p>\n</div><!-- SC_ON -->",
  "score": 49,
  "permalink": "/r/investing/comments/l54gji/what_if_this_was_not_a_bubble_but_a_price/",
  "subreddit": "investing",
  "id": "l54gji",
  "is_self": true,
  "media": null,
  "is_video": false
}