{
  "author": "Remoon101",
  "the_new_excerpt": "TL;DR Downvote bots, shills and media FUD are an obvious sledgehammer for\npaperhands. Amplifying naturally negative sentiment, misleading DD/posts and\ndivisive comments are a hidden knife in the dark trying to chip at diamond\nhands.\n\nFirst time posting here but I just wanted to go through my basic…",
  "original_created_utc": 1616326077,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "TL;DR Downvote机器人，shills和媒体FUD是一个明显的大锤，对于\n纸手。放大自然负面情绪，误导DD/贴吧和。\n分裂性言论是暗中的一把刀子，想削掉钻石。\n手。\n\n第一次在这里发帖，但我只是想通过我的基本...",
      "title": "反转FUD或为什么我在GME的一切YOLO'ing+关注。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "TL;DR Downvote機器人，shills和媒體FUD是一個明顯的大錘，對於\n紙手。放大自然負面情緒，誤導DD/貼吧和。\n分裂性言論是暗中的一把刀子，想削掉鑽石。\n手。\n\n第一次在這裏發帖，但我只是想通過我的基本...",
      "title": "反轉FUD或爲什麼我在GME的一切YOLO'ing+關注。"
    }
  ],
  "title": "Inversing the FUD or Why I'm YOLO'ing everything at GME + Concerns",
  "created_utc": 1616333528,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>TL;DR Downvote bots, shills and media FUD are an obvious sledgehammer for paperhands.  Amplifying naturally negative sentiment, misleading DD/posts and divisive comments are a hidden knife in the dark trying to chip at diamond hands.</strong></p>\n\n<p>First time posting here but I just wanted to go through my basic reasoning on why I&#39;m still in this and still holding 69 @ 420 (to fuck with datamining) despite doubts here and there.</p>\n\n<p>As a quick summary, I heard of WSB from my brother and from some occasional <a href=\"/r/all\">/r/all</a> posts about the shenanigans before GME happened and generally dismissed it as people yeet&#39;ing their life savings away and either winning big or going broke.  I was not aware at the time that there were potentially wrinkled brain people putting solid DD or smooth-brained people putting shitty DD and getting called out by the more wrinkly ones.</p>\n\n<p>GME popped off and I saw it in <a href=\"/r/all\">/r/all</a> and decided to try to catch the train after it already left with RH pulling its shit and bought in $1000 at $135 on the way down.  It was a calculated gamble of what I could afford to lose and seeing hundreds evaporate made me go &quot;okay, that was stupid, lesson learned, let&#39;s look at index funds for my other $1000&quot;</p>\n\n<p>GME popped back up to $185 and I saw my portfolio go green with several hundreds of potential profit and for the first time when it went back down I really had wanted to paper hand and not lose what I thought was a dying last breath of GME.  I figured $1000 still lost, nothing changed</p>\n\n<p>When it started rising for the THIRD time I got serious about doing my DD, reading every single scrap I could find, analyzing the FUD and following DFV&#39;s and Cohen&#39;s movements and potential sentiments about the stock.</p>\n\n<p><strong>Here&#39;s my personal reasoning for HODL&#39;ing</strong></p>\n\n<ol>\n<li>DFV, the man who took us all here in the first place, is still holding.  That man has done more research than any of us with over a year&#39;s worth.  That alone is telling.</li>\n<li>Business transformation DD, all the signs seem positive that Gamestop is going to turn into something that&#39;s worth at least $200 if not more in the future.  It&#39;s a safe long-term hold post-squeeze given I bought in early enough.</li>\n<li>Media FUD on such huge levels that would make you sound like a conspiracy theorist pointing it out.  The silence on up-swings and clamor at down-swings is one of the biggest reasons I&#39;m HODL&#39;ing.  There is no reason to spend millions on something that you aren&#39;t worried about.  Obviously someone&#39;s sweating.</li>\n<li>Actual data and analysis (not the Big Dipper Astrology TA I see flying around) with bullish indicators including price manipulation showing that there is institutional interest long-side.</li>\n</ol>\n\n<p><strong>The reason I felt like writing this up was because I&#39;ve seen subtler manipulation potentially going on in WSB and I&#39;m starting to feel like I&#39;m going crazy seeing things that aren&#39;t there.</strong></p>\n\n<ol>\n<li>WSB vs RKT/UWMC/etc. manipulation.  Early on when RKT was popping off there was a rise in antagonistic sentiments between holders of both stocks.  I&#39;m not 100% sure but I believe this was proven to be manipulation to cause discord and dissent.  Ape no fight ape and all that.</li>\n<li>That one shill who would post positive things to get upvotes (Rocket emojis) and then edit them in post to seem like people were up-voting anti-GME sentiment.  I don&#39;t have the user to link at this time but it&#39;s clever and I won&#39;t doubt that there might be similar users out there using like tricks.</li>\n<li>Options 101 for apes to send money to Citadel.  One user noted that a lot of tutorials on how to use calls, puts, etc. came out of nowhere around the same time.  This was potentially manipulation to get new-found suckling apes to send money to MM&#39;s in poorly informed and dumb option plays (800c&#39;s anybody?) to send premium right to the other side.</li>\n<li>Anti-GME sentiment amplification in WSB.  I&#39;m not saying that there isn&#39;t actual complaints about the influx of users or the cult-like mentality of many holding GME.  But I believe that the people behind Melvin and Citadel aren&#39;t actually retarded.  They will have people trawling this subreddit looking for any kind of sentiment that can be inflamed or used, or have algorithims doing the same.  I&#39;ve seen comments trailing off of &quot;DAE tired of apes ruining the good ol&#39; WSB&quot; saying &quot;I&#39;m selling my $1600 GME because fuck those damn apes ruining OUR WSB&quot;</li>\n</ol>\n\n<p>All in all Reddit is not immune to influence both belligerent and subtle; there are foreign powers that spend millions to influence users outside of WSB in the greater site as a whole.  I believe that if mainstream media, downvote bots and basic shills are the sledgehammer against paper-hands, that subtler influence, negative sentiment amplification, and other less-noisy tools are the knife in the dark trying to pry off hesitant or on-the-fence hands.</p>\n\n<p>I may be going crazy connecting un-related dots, but if there&#39;s one thing you should never do it&#39;s never underestimate the enemy and beware of an animal cornered.  <strong>As stupid of a large strategic decision it was to over-short Gamestop, there are still dangerous and brilliant minds working under the umbrella of short-side hedgefunds and market makers.</strong>  Be careful out there, everyone.  I&#39;ll continue to hold.</p>\n</div><!-- SC_ON -->",
  "score": 8298,
  "permalink": "/r/wallstreetbets/comments/m9uq3i/inversing_the_fud_or_why_im_yoloing_everything_at/",
  "subreddit": "wallstreetbets",
  "id": "m9uq3i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752829065
}