{
  "author": "mrdoggiedog",
  "original_created_utc": 1639923112,
  "title": "A community which I don’t want to mention is planning on buying and owning 51% of Reddit when it goes public",
  "created_utc": 1639931952,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So one of the biggest most influential communities on Reddit so now talking about literally buying and owning 51% of Reddit once it goes public. Is Reddit going public a dangerous thing as a whole? I read about buying a DAO on here but was a little confused, what do y’all think will happen? Lots of people are worried that Reddit will get less user friendly with more ads coming in, I really love this community and all the information we share to help each other out. Ideally creating a decentralized Reddit on a block chain would probably be a great idea to have a second place to gather and communicate, especially since it will push crypto into more real world use cases.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 212,
  "permalink": "/r/CryptoCurrency/comments/rjxipy/a_community_which_i_dont_want_to_mention_is/",
  "subreddit": "CryptoCurrency",
  "id": "rjxipy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So one of the biggest most influential communities on Reddit so now talking\nabout literally buying and owning 51% of Reddit once it goes public. Is Reddit\ngoing public a dangerous thing as a whole? I read about buying a DAO on here but\nwas a little confused, what do y’all think will happen? Lots of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Redditで最も影響力のあるコミュニティの1つで、今話題の\nRedditが上場した暁には、その51％を買収して所有するということです。Redditは\n上場することは、全体として危険なことなのでしょうか？DAOを買うというのはここで読みましたが\nは少し混乱しました。皆さんはどうなると思いますか？たくさんの...",
      "title": "あるコミュニティは、Redditが上場した暁には、その51％を買収して所有しようと考えています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，Reddit上最大的最有影响力的社区之一，现在正在谈论\n一旦Reddit上市，他们将购买并拥有51%的Reddit股份。Reddit是否\n上市是一件危险的事情吗？我在这里读到了关于购买DAO的消息，但是\n我在这里读到了关于购买DAO的消息，但有点困惑，你们都认为会发生什么？很多...",
      "title": "一个我不想提及的社区正计划在Reddit上市时购买并拥有其51%的股份。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，Reddit上最大的最有影響力的社區之一，現在正在談論\n一旦Reddit上市，他們將購買並擁有51%的Reddit股份。Reddit是否\n上市是一件危險的事情嗎？我在這裏讀到了關於購買DAO的消息，但是\n我在這裏讀到了關於購買DAO的消息，但有點困惑，你們都認爲會發生什麼？很多...",
      "title": "一個我不想提及的社區正計劃在Reddit上市時購買並擁有其51%的股份。"
    }
  ]
}