{
  "author": "SkinnyJimmyuk",
  "the_new_excerpt": "Let me start by saying r/stocks [/r/stocks] seems a lot more civilized than WSB\n- I feel like i'll get an informed answer here.\n\nI'll be honest and admit yesterday i got rather excited around the AMC hype and\nbought 50 shares at 13.50.\n\nPre-market is looking fairly bleak however with the constant…",
  "original_created_utc": 1612271487,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "首先我要说的是r/stocks[/r/stocks]似乎比WSB文明多了。\n- 我觉得我在这里会得到一个明智的答案。\n\n老实说，我承认昨天我对AMC的炒作颇为兴奋，而且我也不知道该怎么办。\n在13.50买入50股。\n\n前市场看起来相当黯淡，然而随着不断...",
      "title": "AMC的现状？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先我要說的是r/stocks[/r/stocks]似乎比WSB文明多了。\n- 我覺得我在這裏會得到一個明智的答案。\n\n老實說，我承認昨天我對AMC的炒作頗爲興奮，而且我也不知道該怎麼辦。\n在13.50買入50股。\n\n前市場看起來相當黯淡，然而隨着不斷...",
      "title": "AMC的現狀？"
    }
  ],
  "title": "Current situation with AMC?",
  "created_utc": 1612315817,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Let me start by saying <a href=\"/r/stocks\">r/stocks</a> seems a lot more civilized than WSB - I feel like i&#39;ll get an informed answer here.</p>\n\n<p>I&#39;ll be honest and admit yesterday i got rather excited around the AMC hype and bought 50 shares at 13.50.</p>\n\n<p>Pre-market is looking fairly bleak however with the constant talk of &#39;ladder attacks&#39; and the short squeeze, should i be feeling fairly confident? As well as this people keep saying that the shorts have to cover by Thursday, is there any actual documentation that proves this, or this is just speculation?</p>\n\n<p>I knew that the investment wasn&#39;t an overnight thing and was always happy to play the long-term game.</p>\n\n<p>Again I have to admit that I am a novice and would love an informed insight into the current climate of AMC, is this just the beginning, or has the ship already sailed?</p>\n\n<p>TIA x</p>\n\n<p>&#x200B;</p>\n\n<p>EDIT: I can&#39;t see your comments, how do i fix that?</p>\n</div><!-- SC_ON -->",
  "score": 68,
  "permalink": "/r/stocks/comments/lav4vg/current_situation_with_amc/",
  "subreddit": "stocks",
  "id": "lav4vg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518541045
}