{
  "author": "FlutterCordLove",
  "original_created_utc": 1645053242,
  "title": "Why do so many people think it’s wholesome to see a mentally disabled person in a normal person position? Why don’t we just see it as people being people?",
  "created_utc": 1645059741,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m mentally disabled and I feel like a lot of people often see us as incapable of many things, then when you see someone with Down’s syndrome, for example, having a job or in a relationship, people see it as wholesome, when it shouldn’t be. It should just be seen as normal people in normal people situations. &lt;/p&gt;\n\n&lt;p&gt;Idk it pisses me off tbh. We are normal people. Would you find some random people in a relationship or having a job AS “wholesome” as someone who is mentally disabled? Probably not. Why are we treated like this?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/NoStupidQuestions/comments/su9cqg/why_do_so_many_people_think_its_wholesome_to_see/",
  "subreddit": "NoStupidQuestions",
  "id": "su9cqg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m mentally disabled and I feel like a lot of people often see us as incapable\nof many things, then when you see someone with Down’s syndrome, for example,\nhaving a job or in a relationship, people see it as wholesome, when it shouldn’t\nbe. It should just be seen as normal people in normal people…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は知的障害者ですが、多くの人が私たちのことを「できない人」と見ているように感じます。\nダウン症の人など、いろいろな人がいますよね。\n仕事を持っていたり、恋愛をしていたりすると、健全なことだと思われがちですが、そうではありません。\nである。普通の人の中の普通の人と見るべきで...。",
      "title": "なんで知的障害者が健常者の立場にいるのを見ると健全だと思う人が多いんだろう？なぜ人が人であることを見ようとしないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是智障人士，我觉得很多人经常把我们看成是没有能力的人\n很多事情，那么当你看到有唐氏综合症的人，比如说。\n有工作或恋爱的时候，人们就会认为这是健康的，而这不应该是\n是这样的。它应该只是被看作是正常人中的正常人......",
      "title": "为什么这么多人认为看到一个智障人士处于正常人的位置是健康的？为什么我们不把它看作是人与人之间的关系呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是智障人士，我覺得很多人經常把我們看成是沒有能力的人\n很多事情，那麼當你看到有唐氏綜合症的人，比如說。\n有工作或戀愛的時候，人們就會認爲這是健康的，而這不應該是\n是這樣的。它應該只是被看作是正常人中的正常人......",
      "title": "爲什麼這麼多人認爲看到一個智障人士處於正常人的位置是健康的？爲什麼我們不把它看作是人與人之間的關係呢？"
    }
  ]
}