{
  "author": "KingOfOwls1224",
  "original_created_utc": 1654119250,
  "title": "Was the 80's really as nice as Stranger Things makes it out to be? Or is it just that way for entertainment?",
  "created_utc": 1654134675,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m only 21, so I wasn&amp;#39;t born in the 80&amp;#39;s. But I love the general aesthetic of the 80&amp;#39;s in general, there&amp;#39;s just something oddly nostalgic about it even though I&amp;#39;m not from the era? Like the way shows portray that time period, there was a much bigger sense of community, and people acted like humans. I don&amp;#39;t want to be like, &amp;quot;Oh wow I hate technology&amp;quot; because I actually love it, but I feel like maybe I wouldn&amp;#39;t have had such a hard time connecting with folk if I was born around then, if that makes sense? Because now it&amp;#39;s like, you can&amp;#39;t live without a phone. And I don&amp;#39;t really enjoy being glued to my screen 24/7. Most people my age seem like they&amp;#39;d rather stay in than go out and do things, and lately i&amp;#39;ve been the complete opposite, I always want to go and *do something* i just never quite know what that &amp;quot;something&amp;quot; is. It&amp;#39;s very aggravating.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 205,
  "permalink": "/r/NoStupidQuestions/comments/v2s3bm/was_the_80s_really_as_nice_as_stranger_things/",
  "subreddit": "NoStupidQuestions",
  "id": "v2s3bm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm only 21, so I wasn't born in the 80's. But I love the general aesthetic of\nthe 80's in general, there's just something oddly nostalgic about it even though\nI'm not from the era? Like the way shows portray that time period, there was a\nmuch bigger sense of community, and people acted like…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はまだ21歳なので、80年代生まれではないのですが。でも、80年代の美意識は全般的に好きです。\n80年代の美学は全般的に好きで、その時代の人間ではないのに、何か妙にノスタルジックな感じがするんです。\n私はその時代の人間ではないのですが。その時代を描く番組には、もっと大きな意味がありました。\nその時代の番組で描かれるような、より大きな共同体意識、そして人々の行動...",
      "title": "ストレンジャー・シングスが言うように、80年代は本当に素敵な時代だったのでしょうか？それとも、エンターテイメントとしてそういうものなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我只有21岁，所以我不是在80年代出生的。但我喜欢80年代的总体审美。\n但我喜欢80年代的总体审美，尽管我不是那个时代的人，但有一种奇怪的怀旧感。\n我不是那个时代的人？就像节目中对那个时代的描述一样，有一种更大的社区意识。\n社区意识更强，人们的行为就像......",
      "title": "80年代真的像《陌生人》所描述的那样美好吗？还是只是为了娱乐而这样？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我只有21歲，所以我不是在80年代出生的。但我喜歡80年代的總體審美。\n但我喜歡80年代的總體審美，儘管我不是那個時代的人，但有一種奇怪的懷舊感。\n我不是那個時代的人？就像節目中對那個時代的描述一樣，有一種更大的社區意識。\n社區意識更強，人們的行爲就像......",
      "title": "80年代真的像《陌生人》所描述的那樣美好嗎？還是隻是爲了娛樂而這樣？"
    }
  ]
}