{
  "author": "luu_t_nhung",
  "the_new_excerpt": "As title has said, I myself and plenty girls that I know usually skip the guys\nwho post shirtless pics on dating app, unless there are other things on the\nprofile that are super interesting to me.\n\nI guess it has a lot to do with personal preferences and what we are looking for\non these apps so I…",
  "original_created_utc": 1612384838,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "正如标题所说，我自己和很多我认识的女孩通常都会跳过那些男人\n谁张贴赤裸裸的照片约会的应用程序，除非有其他的东西上的\n的个人资料，对我来说是超级有趣的。\n\n我想这和个人的喜好以及我们所要寻找的东西有很大的关系吧\n在这些应用程序，所以我...",
      "title": "30楼]我一般会对在交友软件上发裸照的男生左刷。你们在看女性的交友资料时，有没有什么等价的交易方式？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "正如標題所說，我自己和很多我認識的女孩通常都會跳過那些男人\n誰張貼赤裸裸的照片約會的應用程序，除非有其他的東西上的\n的個人資料，對我來說是超級有趣的。\n\n我想這和個人的喜好以及我們所要尋找的東西有很大的關係吧\n在這些應用程序，所以我...",
      "title": "30樓]我一般會對在交友軟件上發裸照的男生左刷。你們在看女性的交友資料時，有沒有什麼等價的交易方式？"
    }
  ],
  "title": "[30F] I usually swipe left on guys who post shirtless pics on dating apps. Is there any eqivalent dealbreakers that you guys have when looking at women's dating profiles?",
  "created_utc": 1612394727,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As title has said, I myself and plenty girls that I know usually skip the guys who post shirtless pics on dating app, unless there are other things on the profile that are super interesting to me.</p>\n\n<p>I guess it has a lot to do with personal preferences and what we are looking for on these apps so I don&#39;t want to generalise anything. </p>\n\n<p>I&#39;m just curious about whether you have any equivalent dealbreakers when looking at women&#39;s dating profiles?</p>\n\n<p>What do you think about very sexy bikini or revealing pics?</p>\n\n<p>Edit: grammar mistakes</p>\n</div><!-- SC_ON -->",
  "score": 111,
  "permalink": "/r/AskMen/comments/lbxnix/30f_i_usually_swipe_left_on_guys_who_post/",
  "subreddit": "AskMen",
  "id": "lbxnix",
  "is_self": true,
  "media": null,
  "is_video": false
}