{
  "author": "Mother_Welder_5272",
  "original_created_utc": 1653618572,
  "title": "For nearly all of human civilization we've tried to make things easier and eagerly adapted when less effort is required of us. In the past century or so, prevailing wisdom is that we need to go out of our way to exert extraneous effort (exercising, hiking). Isn't that really strange?",
  "created_utc": 1653677400,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I can understand intellectually about how humanity has evolved to a point where average every day life for someone in a developed Western culture can be counterproductive to both physical and mental health. I can understand how we&amp;#39;ve lost touch with nature, and don&amp;#39;t move around as much. I get why we need to exercise and how fulfilling it is to go to a National Park and hike and exert yourself.&lt;/p&gt;\n\n&lt;p&gt;But I can&amp;#39;t shake the feeling that there&amp;#39;s really something funny about it. It reminds me of the story about how Michael Jackson was so famous that he couldn&amp;#39;t go out in public. And he paid a crowd of people to pretend to shop in a grocery store, so he could shop in the grocery store and feel like a normal person. Whenever that comes up in &lt;a href=\"/r/todayilearned\"&gt;/r/todayilearned&lt;/a&gt;, the comments always talk about how sad and eerie that is.&lt;/p&gt;\n\n&lt;p&gt;I kind of feel the same way whenever I drive my 21st century miracle automobile to a nature preserve, and get out, and start walking. Not like my ancestors, because I&amp;#39;m getting water, or following a hunt, or walking to my farm with fertile soil, or going to a city center to sell my wares. But because we&amp;#39;ve become so efficient at doing what those activities are meant for. An efficiency that they would probably kill for. And I need to temporarily forsake that efficiency to cosplay as someone who needs to be exerting this extra effort, or else it won&amp;#39;t be good for my health. In those moments, I feel like regular people pitying Michael Jackson at the supermarket, except at myself.&lt;/p&gt;\n\n&lt;p&gt;Is it weird to feel this way? Isn&amp;#39;t it oddly weird that for countless generations, they&amp;#39;ve been struggling to make things easier, and all of us happen to be born literally within about a generation or two where we&amp;#39;ve made things so easy that it&amp;#39;s actually not good for us?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/TrueAskReddit/comments/uynyab/for_nearly_all_of_human_civilization_weve_tried/",
  "subreddit": "TrueAskReddit",
  "id": "uynyab",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I can understand intellectually about how humanity has evolved to a point where\naverage every day life for someone in a developed Western culture can be\ncounterproductive to both physical and mental health. I can understand how we've\nlost touch with nature, and don't move around as much. I get why…"
}