{
  "author": "shortyafter",
  "the_new_excerpt": "I understand supply and demand. If we think Amazon is going to have high\nearnings in the future, that looks like a good company to invest in, right?\nDemand increases. Price increases. But Amazon doesn't pay dividends. So how do I\nactually make money off of Amazon stock, apart from buying low and…",
  "original_created_utc": 1613361147,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我理解供求关系。如果我们认为亚马逊会有高\n未来的收益，这看起来是一家很好的投资公司，对吗？\n需求增加。价格上涨。但是亚马逊不发红利。那我该怎么做\n其实赚钱的亚马逊股票，除了买低和... ...",
      "title": "我不明白盈利/基本面如何影响股价。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我理解供求關係。如果我們認爲亞馬遜會有高\n未來的收益，這看起來是一家很好的投資公司，對嗎？\n需求增加。價格上漲。但是亞馬遜不發紅利。那我該怎麼做\n其實賺錢的亞馬遜股票，除了買低和... ...",
      "title": "我不明白盈利/基本面如何影響股價。"
    }
  ],
  "title": "I don't understand how earnings / fundamentals affect stock price.",
  "created_utc": 1613385694,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I understand supply and demand.  If we think Amazon is going to have high earnings in the future, that looks like a good company to invest in, right?  Demand increases.  Price increases.  But Amazon doesn&#39;t pay dividends.  So how do I actually make money off of Amazon stock, apart from buying low and selling high (market forces)?</p>\n\n<p>Do I actually have any right, as a shareholder, to Amazon&#39;s earnings?</p>\n\n<p>There&#39;s no way I can &quot;cash in&quot; the value of my share with Amazon, right?  Any money I make off of the stock must necessarily be made by selling it to another trader.</p>\n\n<p>So why are fundamentals/earnings even important?  I think I&#39;m missing something but at the moment it seems to be all based 100% off perception of fundamentals rather than the fundamentals themselves.</p>\n</div><!-- SC_ON -->",
  "score": 95,
  "permalink": "/r/stocks/comments/lk51gr/i_dont_understand_how_earnings_fundamentals/",
  "subreddit": "stocks",
  "id": "lk51gr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728624073
}