{
  "author": "Reactionaryhistorian",
  "original_created_utc": 1648359171,
  "title": "How did the French Monarchy justify having royal mistress be an official acknowledged position given the fact that Christianity was such an important part of its ideology?",
  "created_utc": 1648386932,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Apparently, the position of chief royal Mistress was an official one in the French court.&lt;/p&gt;\n\n&lt;p&gt;The French Monarchs regarded Christianity as important enough that they had the title of &amp;quot;Most Christian King&amp;quot;. Needless to say Christianity in general does not look kindly on mistresses. &lt;/p&gt;\n\n&lt;p&gt;It doesn&amp;#39;t really surprise me, of course, that powerful Monarchs should be a little morally flexible in this regard and take mistresses anyway. But it does strike me as odd that they could have Royal Mistresses be officially acknowledged. Once you have royal mistress as an official position it seems to me you are basically keeping a royal harem. How was this officially justified? Did the position of Maîtresse-en-titre involve less scandalous official duties? Did the whole thing ever get condemned by the more religious? Wasn&amp;#39;t it seen as a problem for the King to be living in officially acknowledged sin?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 134,
  "permalink": "/r/AskHistorians/comments/tpde07/how_did_the_french_monarchy_justify_having_royal/",
  "subreddit": "AskHistorians",
  "id": "tpde07",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Apparently, the position of chief royal Mistress was an official one in the\nFrench court.\n\nThe French Monarchs regarded Christianity as important enough that they had the\ntitle of \"Most Christian King\". Needless to say Christianity in general does not\nlook kindly on mistresses.\n\nIt doesn't really…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "では、チーフ・ロイヤル・ミストレスという役職が正式なものだったらしい。\nフランス宮廷\n\nフランスの君主は、キリスト教を重要視しており、そのため、彼らは\n最もキリスト教的な王」という称号がある。言うまでもなく、一般的なキリスト教は\n愛人には好意的である。\n\nそれは本当に...",
      "title": "フランス王室は、そのイデオロギーの中でキリスト教が重要な位置を占めていたのに、王室愛人を公認の地位に置くことをどのように正当化したのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "显然，首席王室女主人的职位是一个官方职位。\n法国宫廷的官方职位。\n\n法国君主认为基督教非常重要，以至于他们有 \"最基督教国王 \"的称号。\n他们有 \"最虔诚的国王 \"的称号。不用说，一般来说，基督教对情妇并不友好。\n对情妇的态度不友善。\n\n它并没有真正...",
      "title": "鉴于基督教是其意识形态中如此重要的一部分，法国君主制是如何证明让王室情妇成为官方承认的职位的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "顯然，首席王室女主人的職位是一個官方職位。\n法國宮廷的官方職位。\n\n法國君主認爲基督教非常重要，以至於他們有 \"最基督教國王 \"的稱號。\n他們有 \"最虔誠的國王 \"的稱號。不用說，一般來說，基督教對情婦並不友好。\n對情婦的態度不友善。\n\n它並沒有真正...",
      "title": "鑑於基督教是其意識形態中如此重要的一部分，法國君主制是如何證明讓王室情婦成爲官方承認的職位的？"
    }
  ]
}