{
  "author": "DumplingGoddessTe",
  "the_new_excerpt": "I wasn’t sure which flair to use.\n\nAs the title says I have a trading bot which I spent a long while developing.\n\nThere are two batches of codes which I run alongside each other.\n\nBatch 1 and Batch 2.\n\nBatch 1 uses some of the judgement of myself and calculations to gather stock.\n\nBatch 2 is just…",
  "original_created_utc": 1610344104,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我不知道该用哪种天赋。\n\n正如标题所说，我有一个我花了很长时间开发的交易机器人。\n\n我有两批代码，它们是并排运行的。\n\n批次1和批次2。\n\n第一批使用我自己的一些判断和计算来收集库存。\n\n批次2只是…",
      "title": "我有一个折扣交易机器人，每天给出(好的，每小时的股票市场折扣)。以下是机器人在折扣公司项下的声明。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不知道該用哪種天賦。\n\n正如標題所說，我有一個我花了很長時間開發的交易機器人。\n\n我有兩批代碼，它們是並排運行的。\n\n批次1和批次2。\n\n第一批使用我自己的一些判斷和計算來收集庫存。\n\n批次2只是…",
      "title": "我有一個折扣交易機器人，每天給出(好的，每小時的股票市場折扣)。以下是機器人在折扣公司項下的聲明。"
    }
  ],
  "title": "I have a discount trading bot which gives out daily (well hourly discounts for the stock market). Here’s what the bot stated under discounted companies...",
  "created_utc": 1610363002,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I wasn’t sure which flair to use. </p>\n\n<p>As the title says I have a trading bot which I spent a long while developing. </p>\n\n<p>There are two batches of codes which I run alongside each other. </p>\n\n<p>Batch 1 and Batch 2. </p>\n\n<p>Batch 1 uses some of the judgement of myself and calculations to gather stock. </p>\n\n<p>Batch 2 is just purely calculations which release values which say if it’s worth doing a call, or not worth doing a call. </p>\n\n<p>Past few days the top picks with NVDA, and a small cap  I can post this daily if you guys are interested. </p>\n\n<p>This the data which I have acquired on Sunday (NY) 10th of January 2021, based on the close of the last business day. </p>\n\n<p>Here’s an update to my trading bot. QS looks tempting but I think I can hold off until tomorrow a better company I understand comes on sight. </p>\n\n<p>Only invest in companies you know and have a understanding of and can see they have a future, to lessen any potential losses via trading. </p>\n\n<p><strong>Code Batch 1:</strong></p>\n\n<ul>\n<li><p>Quantumscape Corp (QS) - Hype stock, Solid State Battery - High Risk</p></li>\n<li><p>AYI Acuity Brands, Inc.</p></li>\n<li><p>ADS Alliance Data Systems Corporation</p></li>\n</ul>\n\n<p><strong>Code Batch 2:</strong></p>\n\n<p>Call:</p>\n\n<ul>\n<li><p>FedEx Corporation (FDX) - Has been dropping for a while.</p></li>\n<li><p>Lockheed Martin Corporation LMT</p></li>\n<li><p>FedEx Corporation FDX</p></li>\n<li><p>Kimberly Clark Corp KMB</p></li>\n<li><p>Campbell Soup Company CPB</p></li>\n<li><p>Conagra Brands Inc CAG</p></li>\n<li><p>General Mills, Inc. GIS</p></li>\n<li><p>Braemar Shipping Services plc BMS</p></li>\n<li><p>Beyond Meat Inc BYND</p></li>\n</ul>\n\n<p>Potentially a call:</p>\n\n<ul>\n<li><p>United Parcel Service, Inc. UPS</p></li>\n<li><p>Air Transport Services Group Inc. ATSG</p></li>\n<li><p>Atlas Air Worldwide Holdings, Inc. AAWW</p></li>\n<li><p>Facebook, Inc. Common Stock FB</p></li>\n<li><p>Inovio Pharmaceuticals Inc INO</p></li>\n<li><p>L3Harris Technologies Inc LHX</p></li>\n<li><p>Northrop Grumman Corporation NOC</p></li>\n<li><p>United Parcel Service, Inc. UPS</p></li>\n<li><p>Alliant Energy Corporation LNT</p></li>\n<li><p>American Electric Power Company Inc AEP</p></li>\n<li><p>Consolidated Edison, Inc. ED</p></li>\n<li><p>Dominion Energy Inc D</p></li>\n<li><p>Entergy Corporation ETR</p></li>\n<li><p>WEC Energy Group Inc WEC</p></li>\n<li><p>Atmos Energy Corporation ATO</p></li>\n<li><p>NVR, Inc. NVR</p></li>\n<li><p>Church and Dwight Co., Inc. CHD</p></li>\n<li><p>Ball Corporation BLL</p></li>\n<li><p>CenterPoint Energy Inc CNP</p></li>\n<li><p>CMS Energy Corporation CMS</p></li>\n<li><p>DTE Energy Co DTE</p></li>\n<li><p>NiSource Inc. NI</p></li>\n<li><p>Sempra Energy SRE</p></li>\n<li><p>Boston Properties, Inc. BXP</p></li>\n<li><p>Hormel Foods Corp HRL</p></li>\n<li><p>Kellogg Company K</p></li>\n<li><p>Atmos Energy Corporation ATO</p></li>\n<li><p>Church and Dwight Co., Inc. CHD</p></li>\n<li><p>Hormel Foods Corp HRL</p></li>\n</ul>\n\n<p>Edit 1: there might be companies which you haven’t heard of, this is due to me adding the SPY 500 companies into it to increase data output.</p>\n\n<p>EDIT 2: I’m not charging anyone for this data and no you cannot buy it - I worked too hard to get it right. I’ll be giving daily updates for it.</p>\n\n<p>Edit 3: My goal is to do 400 successful trades with minimum losses before I say everything perfect.</p>\n\n<p>Edit 4: I will not be posting this hourly. It just too long to load everything up maybe in the future. </p>\n\n<p>Edit 5: Hahaha but really you guys who did the 13 upvotes have made my day! I’m happy I’m helping you guys out.</p>\n\n<p>Edit 6: Holy I made it to 50 votes, you guys are honestly the best. I didn’t even realise this would help this many people but honestly thank you. I will not fail you.</p>\n\n<p>Edit 7: No I don’t have a paid site where you can get this data. Please do not sell this data to anyone it’s free information. I know there’s discord/telegram admin of paid groups who would try and monetise it. Please do not.</p>\n\n<p>Edit 8: Over 100 people have seen this, I feel like it’s my birthday. I love you guys. I just want everyone to be well off and have money.</p>\n\n<p>Edit 9: 168 upvotes I just can’t imagine I would’ve ever got this, you guys are amazing. But please just invest in companies you know and are confident about. That’s all I ask, I’m waiting for a big tech company to be discounted enough to show up that’s where I would drop 20-40k into it. Only invest in the things you are personally confident about. I’ll be posting this everyday, stocks are a waiting game keep in mind.</p>\n\n<p>Edit 10: 200 UPVOTES WHAT THATS CRAZY!!!  Thank you so much for all the awards, you guys really don’t have to, please spend that money on stocks and such. It’s very expensive.</p>\n\n<p>Edit 11: 453 upvotes I just don’t know what to say you guys are amazing I’m trying to perfect everything for you guys, but please don’t rush to do trades everyday only trades which you are confident on. Thank you WSB I will be a loyal member to the community.</p>\n\n<p>Edit 12: I just ate and came back and it’s almost at a thousand. You guys have just made my day especially the upvotes and awards which I given. You guys are the absolute best and I don’t know what I’d do without you. Please read my messages above carefully. I don’t want you guys to lose money and PLEASEEE AWARDS ARE EXPENSIVE DONT WASTE MONEY ON ME PUT IT TOWARDS STOCKS INSTEAD HAHAHA BUT HONESTLY THANK YOU GUYS.</p>\n</div><!-- SC_ON -->",
  "score": 3925,
  "permalink": "/r/wallstreetbets/comments/kuwg1e/i_have_a_discount_trading_bot_which_gives_out/",
  "subreddit": "wallstreetbets",
  "id": "kuwg1e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706385302
}