{
  "author": "whowhatwhy124",
  "original_created_utc": 1651142920,
  "title": "Why does body positivity seem so toxic?",
  "created_utc": 1651154964,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I haven’t really seen this on Reddit (might not follow the right subs, or the people I’m\nTalking about don’t use Reddit), but I have very much seen this on TikTok&lt;/p&gt;\n\n&lt;p&gt;There are some very obese women (this seem to be mostly women this happens with) posting TikTok’s about their body, how they’re beautiful no matter what and all that. Nothing about attaining a healthy weight or just being healthy in general, it’s always just about just being fat is ok. And the comments always seem to be so supportive of them.  &lt;/p&gt;\n\n&lt;p&gt;On the other side healthy looking women (again this is mainly women from what I see) are always shat on, told to go eat, breathe and how their lives are wasted. It’s honestly rather upsetting to read sometimes. &lt;/p&gt;\n\n&lt;p&gt;And I don’t get how anyone can think it’s ok to hype obese people up and tell them they’re perfect as they are, all bodies are beautiful and all that, while on the other hand bully actually heathy people for being healthy. &lt;/p&gt;\n\n&lt;p&gt;I get body positivity, you should be happy, as that is the way to get to a healthy weight, but telling people that obese is the right thing is just damaging. &lt;/p&gt;\n\n&lt;p&gt;So why has bodypositivity turned from helping people getting into shape and not be unhealthy, while also accepting that some people are more comfortable as chubby, into a toxic hellscape where obese is right and healthy is worse than hell?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 124,
  "permalink": "/r/TooAfraidToAsk/comments/uds6ci/why_does_body_positivity_seem_so_toxic/",
  "subreddit": "TooAfraidToAsk",
  "id": "uds6ci",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I haven’t really seen this on Reddit (might not follow the right subs, or the\npeople I’m Talking about don’t use Reddit), but I have very much seen this on\nTikTok\n\nThere are some very obese women (this seem to be mostly women this happens with)\nposting TikTok’s about their body, how they’re…"
}