{
  "author": "13redle",
  "original_created_utc": 1633654746,
  "title": "As of today, what are your top 5 long-term crypto investments and why?",
  "created_utc": 1633675368,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The crypto world of today as we all know is teeming with so many coins. So many that it can be very difficult to keep track of them all. The staggering amount can often dissuade one from trying to do extensive research. I for one know that I’m one of these individuals.</p>\n\n<p>So, in an easily digestible nutshell, what are your long-term top 5?</p>\n\n<p>There are no right or wrong answers here, this is purely opinion. Ultimately, I would like to find out if there are any projects out there that we as traditional retail investors should know about. And perhaps do additional research.</p>\n</div><!-- SC_ON -->",
  "score": 223,
  "permalink": "/r/CryptoCurrency/comments/q3mxnq/as_of_today_what_are_your_top_5_longterm_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "q3mxnq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The crypto world of today as we all know is teeming with so many coins. So many\nthat it can be very difficult to keep track of them all. The staggering amount\ncan often dissuade one from trying to do extensive research. I for one know that\nI’m one of these individuals.\n\nSo, in an easily digestible…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ご存知のように、今日の暗号の世界には非常に多くのコインが溢れています。非常に多くの\nそのすべてを把握するのは非常に難しいことです。驚異的な量のため\n膨大な量のために、人は広範な研究をしようとしないことがよくあります。私もその一人です。\n私もその一人です。\n\nそこで、簡単に理解できるように、...",
      "title": "今日の時点で、長期的な暗号投資のトップ5とその理由を教えてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "众所周知，当今的加密货币世界充斥着如此多的硬币。如此之多\n以至于很难将它们全部记录下来。惊人的数量\n往往使人不愿意做广泛的研究。我就知道\n我就是这些人中的一员。\n\n因此，在一个容易消化的...",
      "title": "截至目前，你的五大长期加密货币投资是什么，为什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "衆所周知，當今的加密貨幣世界充斥着如此多的硬幣。如此之多\n以至於很難將它們全部記錄下來。驚人的數量\n往往使人不願意做廣泛的研究。我就知道\n我就是這些人中的一員。\n\n因此，在一個容易消化的...",
      "title": "截至目前，你的五大長期加密貨幣投資是什麼，爲什麼？"
    }
  ]
}