{
  "author": "hello-world-foo-bar",
  "the_new_excerpt": "To everyone that held, you’ve leveled to diamond-hand generals. In game theory,\nthe only way you could have maximized your gains was if you all stuck together,\nand you did! They had counted on you guys scattering, and that’s why they took\nout new shorts on GME.\n\nGME was on the cusp of a short…",
  "original_created_utc": 1612016147,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "敬告大家，你已经等级到钻石手将了。在游戏理论中。\n唯一能让你们的收益最大化的方法就是你们一起坚持下去。\n而你们做到了！他们指望着你们分散开来，所以他们才会拿下了\n在GME上出新的短线。\n\nGME正处于短线的风口浪尖上...",
      "title": "GME｜第二幕｜保证金追缴解释｜AMC及其他高短息股票。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "敬告大家，你已經等級到鑽石手將了。在遊戲理論中。\n唯一能讓你們的收益最大化的方法就是你們一起堅持下去。\n而你們做到了！他們指望着你們分散開來，所以他們纔會拿下了\n在GME上出新的短線。\n\nGME正處於短線的風口浪尖上...",
      "title": "GME｜第二幕｜保證金追繳解釋｜AMC及其他高短息股票。"
    }
  ],
  "title": "GME | Second Act | Margin Call Explained | AMC & Other High Short Interest Stocks",
  "created_utc": 1612025623,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>To everyone that held, you’ve leveled to diamond-hand generals. In game theory, the only way you could have maximized your gains was if you all stuck together, and you did! They had counted on you guys scattering, and that’s why they took out new shorts on GME.</p>\n\n<p>GME was on the cusp of a short squeeze on Wednesday, before they closed off all buying, and did the short ladder attack.</p>\n\n<p>It shows that they’ve learned nothing since the Great Financial Crisis (GFC). They play by one primary rule: Heads we win. Tails you lose. And they can change the other rules last minute to drive to the primary rule.</p>\n\n<p>Next, they will try to block/limit buying across RH and more brokerages so there’s not enough volume to drive to the short squeeze. Meanwhile Hedge Funds are free to buy/sell unlimited amount of shares and create short ladder attacks [1]. Different rules for different players in this game!</p>\n\n<p>But let’s move back to the whiteboard.</p>\n\n<p><em>Disclaimer: I am not a financial advisor. This entire post represents my personal views and opinions, and should not be taken as financial advice (or advice of any kind whatsoever). I encourage you to do your own research, take anything I write with a grain of salt, and hold me accountable for any mistakes you may catch.</em></p>\n\n<p>Today, I’ll describe what a margin call is and explain a High Short Interestt trading strategy around it. In Particular, I’ll use Melvin Capital presumed short book as a case study.</p>\n\n<p>Note: I’m not a financial advisor, this is just me whiteboarding.</p>\n\n<h1>Long/Short Strategy</h1>\n\n<p>In the Hedge Fund industry they have a strategy called long/short. They go long on momentum stocks and short undesirable ones.</p>\n\n<p>Ie buying Apple and shorting Gamestop.</p>\n\n<p>This trade is profitable if Apple’s stock price rises and Gamestop’s (GME) share price decline.</p>\n\n<p>However, let say the trade doesn’t go their way and Gamestop share prices dramatically because of a short squeeze. In this case their net position is negative. Let’s say 30% negative. If it becomes large, their brokers calls them up and ask them to put more cash. Then they raise 30% more cash or sell stocks that been paid off to meet the reserve requirement. This is why you see the general stock market deep red, while GME moons. Hedge funds are selling their winning longs to raise cash for the margin requirement.</p>\n\n<p>When GME short squeezes, they may have to liquidate (sell off all their longs) and cover their existing short position. Moreover, they have other leverage short positions that are also highly shorted (&gt; 50% of the float). This becomes what’s known as an arbitrage trade. I’ll call it the High Short Interest (HSI) Trade. It’s a high risk trade but with potential for very high profits/returns should it go your way.</p>\n\n<h1>The High Short Interest Trade</h1>\n\n<p>Should Hedge funds start to cover short positions because of a margin call or liquidate, they will be forced to buy up shares in the open market. However, if those shares are scares, it will create a huge short squeeze in which they will have to pay higher prices to meet their obligation to return shares.</p>\n\n<p>I’ll use Melvin Capital as a case study because they have publicly declared they had a high short interest in GME, so most likely be margin called or liquidiated, should the GME short squeeze happen.</p>\n\n<p>Furthermore, I’ll analyze their possible short position to justify why the squeeze may happen. Again, this is all conjecture and thinking out a possible trading strategy</p>\n\n<p>In this case study, a high short interest stock is defined as one in which the short interest is greater than 50%. The reason why we will focus on these stock is because of the difficult of buy back all the shares before the market discovers how these shares are valuable because you have to buy them back at any price to meet contractual obligations.</p>\n\n<p>Going forward, everything I write is based on conjecture but backed up by evidence. Shorting is a opaque dark art and it’s hard to get concrete data. But it shouldn’t block us in this whiteboarding session.</p>\n\n<p>Here is a Melvin Capital possible short interest based on their sec filing of put positions [2]</p>\n\n<ol>\n<li>Gamestop (GME)</li>\n<li>AMC Networks (AMC)</li>\n<li>Dillards (DDS)</li>\n<li>Bed Bath &amp; Beyond (BBBY)</li>\n<li>The Macerich Company (MAC)</li>\n<li>Tanger Factory Outlet Center (SKT)</li>\n</ol>\n\n<p>I’ll analyze short interest based on data from ortex.com [3]. Ortex data is show in the imgur links. This data is not confirmed but estimate and such has a possibility for high errors. However, ortex has been very reliable in the past.</p>\n\n<h1>AMC</h1>\n\n<p><a href=\"https://imgur.com/a/s48vgAV\">https://imgur.com/a/s48vgAV</a></p>\n\n<p>Estimate Short Interest: 63M</p>\n\n<p>Float: 102M</p>\n\n<p>% of float shorted 62%</p>\n\n<h1>Dillards (DDS)</h1>\n\n<p><a href=\"https://imgur.com/a/smZwIeB\">https://imgur.com/a/smZwIeB</a></p>\n\n<p>Estimate Short Interest: 4.2M</p>\n\n<p>Float: 5.5M</p>\n\n<p>% of float shorted: 76%</p>\n\n<h1>Bed Bath and Beyond (BBBY)</h1>\n\n<p><a href=\"https://imgur.com/a/DI18mYL\">https://imgur.com/a/DI18mYL</a></p>\n\n<p>Estimate Short Interest: 58M</p>\n\n<p>Float: 109M</p>\n\n<p>% of float shorted: 54%</p>\n\n<h1>MAC</h1>\n\n<p><a href=\"https://imgur.com/a/JpXcPrP\">https://imgur.com/a/JpXcPrP</a></p>\n\n<p>Estimate Short Interest: 71M</p>\n\n<p>Float: 113M</p>\n\n<p>% of float shorted: 63%</p>\n\n<h1>SKT</h1>\n\n<p><a href=\"https://imgur.com/a/mcyDYuE\">https://imgur.com/a/mcyDYuE</a></p>\n\n<p>Estimate Short Interest: 48M</p>\n\n<p>Float: 90M</p>\n\n<p>% of float shorted: 53%</p>\n\n<p>As you can see all these positions are heavily shorted, and should this hedge fund need to acquire shares of them on the market because of liquidation, it may have trouble to close out its short position. Hence, a very high likelihood of a short squeeze.</p>\n\n<h1>Short Ladder Attack</h1>\n\n<p>A common maneuver Hedge fund deploy to vacuum up shares is a short ladder attack [1]. They do this to drop the price and scoop up shares. For hedge funds with big short positions this is effective because it makes it seem like the shares aren’t valuable when they are.</p>\n\n<p>Usually, they will borrow 1-3% of shares and short, causing people to panic sell. If they do this repeatedly after like 10 days, they can close out 30% of their short position before the market notices. Do you see now how they can leverage 1% to scoop up 30% of the shares with this attack? It’d be difficult for them to vacuum up all the shares at once without the price increasing or the market knowing, so they manipulate the price lower and do it over a period of time.</p>\n\n<p>That is why you’ll see the days to cover metric. Based on the volume, it suggest how many days they can get away with this before they are whole. However, should people realize that their short interest is too high, they can HOLD and buy more to force hedge funds to buy the shares at a higher price.</p>\n\n<p>But you can see that the volume is increasing, so the market is aware of a potential short squeeze.</p>\n\n<h1>Short Squeeze Precedent</h1>\n\n<p>In the week of March 20, 2020, Blue Apron had a short interest of about 50%. And then they experienced a short squeeze which led the price to climb 1000% in a week. So you can see how explosive the share price can climb, should a short squeeze occur, for stocks with a short interest of 50% or greater.</p>\n\n<p>Never trade more than you’re willing to lose. Diamond hands.</p>\n\n<p>References</p>\n\n<p>[1] <a href=\"https://www.reddit.com/r/wallstreetbets/comments/l72r36/what_is_a_short_ladder_attack/\">https://www.reddit.com/r/wallstreetbets/comments/l72r36/what_is_a_short_ladder_attack/</a></p>\n\n<p>[2] <a href=\"https://www.sec.gov/Archives/edgar/data/1628110/000090571820001111/xslForm13F_X01/infotable.xml\">https://www.sec.gov/Archives/edgar/data/1628110/000090571820001111/xslForm13F_X01/infotable.xml</a></p>\n\n<p>[3] <a href=\"http://ortex.com\">http://ortex.com</a></p>\n</div><!-- SC_ON -->",
  "score": 1546,
  "permalink": "/r/stocks/comments/l8mk8v/gme_second_act_margin_call_explained_amc_other/",
  "subreddit": "stocks",
  "id": "l8mk8v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518537975
}