{
  "author": "Dry-Yogurtcloset6207",
  "original_created_utc": 1644234810,
  "title": "Can cats have a favorite person?",
  "created_utc": 1644259105,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I (18M) live with my father full time (divorced parents, I got to choose). We got a cat about 9 months ago. 3-year-old orange dude with huge cheeks. Split custody so my younger siblings are here every other week, and when they are gone so is my father, on business meetings and such. Therefore, I spend the most time with the cat. He will not leave my side. Ever.&lt;/p&gt;\n\n&lt;p&gt;I go to work, come back and he is waiting by the door.&lt;/p&gt;\n\n&lt;p&gt;He wants to eat my food, no matter what room I&amp;#39;m in.&lt;/p&gt;\n\n&lt;p&gt;He is constantly purring around me.&lt;/p&gt;\n\n&lt;p&gt;He watches me play video games. For hours.&lt;/p&gt;\n\n&lt;p&gt;He seems to enjoy my music?! (I might just be an idiot for thinking this)&lt;/p&gt;\n\n&lt;p&gt;He always wants to be pet.&lt;/p&gt;\n\n&lt;p&gt;He sleeps next to my face every night. He even pulls all-nighters with me when I have to do schoolwork.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not sure what I&amp;#39;ve done for him to give me this much attention. He doesn&amp;#39;t do this for any of my family members.&lt;/p&gt;\n\n&lt;p&gt;Back to the question, can cats have a favorite person, and am I that person?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 112,
  "permalink": "/r/NoStupidQuestions/comments/smogfb/can_cats_have_a_favorite_person/",
  "subreddit": "NoStupidQuestions",
  "id": "smogfb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I (18M) live with my father full time (divorced parents, I got to choose). We\ngot a cat about 9 months ago. 3-year-old orange dude with huge cheeks. Split\ncustody so my younger siblings are here every other week, and when they are gone\nso is my father, on business meetings and such. Therefore, I…"
}