{
  "author": "tightnips",
  "the_new_excerpt": "I love you all, really I do.\n\nThe issue here is that the creation of a single identity will be our\ndestruction. There's people framing us as if we prop up stocks, or are\nattempting to (as if we make gains?). They're exploiting our collective strength\nand we're playing right into it. I heard He-Who…",
  "original_created_utc": 1611236039,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我爱你们，真的。\n\n这里的问题是，创造一个单一的身份将是我们的。\n破坏。有人诬陷我们，好像我们是支撑股票，或者是\n企图（好像我们取得了收益？他们在利用我们的集体力量\n我们正在玩的权利进入它。我听到了 \"他-谁\"...",
      "title": "一个身份会害死我们"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我愛你們，真的。\n\n這裏的問題是，創造一個單一的身份將是我們的。\n破壞。有人誣陷我們，好像我們是支撐股票，或者是\n企圖（好像我們取得了收益？他們在利用我們的集體力量\n我們正在玩的權利進入它。我聽到了 \"他-誰\"...",
      "title": "一個身份會害死我們"
    }
  ],
  "title": "An Identity will kill us",
  "created_utc": 1611250154,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I love you all, really I do.</p>\n\n<p>The issue here is that the creation of a single identity will be our destruction. There&#39;s people framing us as if we prop up stocks, or are attempting to (as if we make gains?). They&#39;re exploiting our collective strength and we&#39;re playing right into it. I heard He-Who-Must-Not-Be-Named saying that we are going to &quot;attack&quot; Citron with a planned surge of purchasing right after their livestream.</p>\n\n<p>While this is fun to think about, and it&#39;s amazing we can go against the best, they&#39;re just setting us up to get taken down. I don&#39;t want WSB to be seen as an organized entity, which we really aren&#39;t. We need to stay loose like my wife after my mom&#39;s boyfriend is done with her. I&#39;m worried that the spotlight we&#39;re getting with the strength we&#39;ve developed will really just be the end of something amazing.</p>\n\n<p>SO what can we do?</p>\n\n<p>STOP saying stupid shit.</p>\n\n<p>STOP acting as if we actually affect the market.</p>\n\n<p>and comment on this thread what you think</p>\n\n<p>EDIT: Citron you mess with the bull you get the horns </p>\n</div><!-- SC_ON -->",
  "score": 8461,
  "permalink": "/r/wallstreetbets/comments/l1yj1a/an_identity_will_kill_us/",
  "subreddit": "wallstreetbets",
  "id": "l1yj1a",
  "is_self": true,
  "media": null,
  "is_video": false
}