{
  "author": "scoumoune",
  "original_created_utc": 1629674848,
  "title": "Algorand, and why I chose it",
  "created_utc": 1629740154,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Every day there are posts that tout one new currency/token, or another. Usually they are the same copy/paste or direct links to some fly-by-night &quot;news&quot; article that talks only about how great the new technology is while lacking any real substance. For the most part this is Cardano or Ripple. Of course, there are always the typical Bitcoin meme posts every time the price is marginally in the green. I&#39;m going to start with a general overview and then get in to why I am a new advocate of <a href=\"https://www.algorand.com/\">Algorand</a>, while really trying my best not to single out any particular coin that I feel is shit.</p>\n\n<p>Most of these new coins (and a majority of old coins), in my opinion, either have no practical use or are little more than templated marketing web pages with loads of false claims. The problem is that the community is ever-growing and many of the new cryptocurrency &#39;users&#39;, and even a lot of the &#39;OG&#39; users, really do not understand the underlying technology that all of these currencies are based on. To be fair, it&#39;s not an easy topic to grasp, especially if you don&#39;t work in software. With people&#39;s relative inability or lack of desire to do legitimate research, along with the urge most every human has of wanting to make an amount of money that sees them more comfortable than they ever thought they reasonably would be, and you have a recipe for the perfect shit-storm.  </p>\n\n<p>Historically big money has been made by people that started a new coin or token. In some cases the success was merited; the coin/tech brought some new function or greatly improved on an existing paradigm. In other cases, marketing and crowd sales spreading from person-to-person wanting to get in early or hearing great things from a friend has led to success that really was not or is not merited. Of the 10,000 or more coins, the reality is that all but perhaps 100 of them will fail in the short term. Short term here being 2-5 years.</p>\n\n<p>Of the coins actively being marketed (shilled) in this sub, many do not have formal white papers, or, if they do, they are hidden so well that most never make it to see the 1-2 page disappointing document that claims in not much more than some lengthened marketing-speak as to why the coin is great. There are false claims trying to get people to believe this one in particular is truly revolutionary (from a currency released in September of 2017):</p>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>... is the first blockchain platform to evolve out of a scientific philosophy and a research-first driven approach. It is being designed for function and scale right from the start.</p>\n</blockquote>\n\n<p>&#x200B;</p>\n\n<p>And there are others that are geared so heavily towards the financial sector that it leaves me, for one, wondering what the use of it is to begin with (other than simply trying to capture investors). After all, the origin story of cryptocurrency found in Bitcoin&#39;s <a href=\"https://bitcoin.org/bitcoin.pdf\">whitepaper</a> was a rather positive and forward-thinking perspective on a digital currency that was decentralized, allowing complete separation from ones&#39; own finances and banking control mechanisms. Bitcoin itself has deviated a bit and does not <em>currently</em> fulfill the original promise in its own whitepaper, but it had one- and not only that, but it outlined the proposed use as well as contained fairly straight-forward math to back it up.  </p>\n\n<p>This leads me to Algorand. For the most part when I see a post or hear a friend/coworker mention a particular coin that I haven&#39;t heard of, I assume it is a shitcoin. I make that assumption knowing that to prove otherwise I would need to do a fair amount of research, including reading the white paper (which could take several hours) and forming my own opinion about whether or not the particular technology is useful. I assumed the exact same thing about Algorand.   </p>\n\n<p>Once I looked into it my initial concerns about it being just-another Ethereum replacement went away. As someone in software I was immediately relieved to see that the founder, Silvio Micali, is not only technical, but he is a professor at MIT with one of his focuses being cryptography. This is crucial for me, because not only is he in the Computer Science field, but his area of research and expertise is in the core technology of all cryptocurrencies. Looking further into him, I saw that he has several awards in academia- chief of which is the Turing Award. From that point I knew that he was more than just a professor of some unrelated discipline who had figured out how to start his own cryptocurrency. He also has a background in economics, with many research papers written on that topic as well.   </p>\n\n<p>It was time to look at the <a href=\"https://arxiv.org/pdf/1607.01341.pdf\">whitepaper</a>. Not surprisingly, or surprisingly compared to other cryptocurrencies, the white paper was easy to find. Not only that, but it is <em>extremely</em> detailed. It contains comparisons to Proof of Work currencies and lessons that have been learned from them, in-depth explanation of how the components of Algorand work- from encryption, signing, consensus and election, to fault tolerance. In addition to all of this there is also formal mathematic notation to go along with the more technical aspects of how Algorand works. This whitepaper from May of 2017 outlines every mechanism involved and how they work, and it is obvious that this particular cryptocurrency has formal beginnings in <em>research, cryptography, Computer Science,</em> and <em>economics</em>. Further whitepaper&#39;s exist on the <a href=\"https://dl.acm.org/doi/10.1145/3132747.3132757\">Byzantine Agreement protocol</a>, <a href=\"https://eprint.iacr.org/2018/377.pdf\">Algorand&#39;s Byzantine</a> implementation, <a href=\"https://eprint.iacr.org/2018/269.pdf\">Fast Boostrapping of Algorand</a> that outlines the time and space savings over existing currencies, and the multi-signature consensus approach they dubbed <a href=\"https://eprint.iacr.org/2019/514.pdf\">Pixel</a>. And yes, it has a fixed supply of 10B coins that were pre-minted.  </p>\n\n<p>If you haven&#39;t already, or even if you have, I encourage you to check out Algorand. It&#39;s a Proof of Stake coin that has many active partnerships as well as active research. It also has ~5-6% staking directly on Ledger with no tiered-token approach for rewards. Some coins might out-perform Algorand in terms of price on a given day, but I don&#39;t believe the awareness of Algorand has even scratched the surface. It may be beat today or tomorrow by Shitcoin A or B with respect to price, but given a short-medium amount of time my money is on Algorand.</p>\n\n<p>To summarize, I heavily value this type of solid technical background and active research. When most people say they are &quot;bullish&quot; on a particular coin it usually means they are bullish on that coins marketing campaign. I happen to be bullish on intelligence. Because of that, I&#39;m going to stick with Algorand.</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/p9ni04/algorand_and_why_i_chose_it/",
  "subreddit": "CryptoCurrency",
  "id": "p9ni04",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Every day there are posts that tout one new currency/token, or another. Usually\nthey are the same copy/paste or direct links to some fly-by-night \"news\" article\nthat talks only about how great the new technology is while lacking any real\nsubstance. For the most part this is Cardano or Ripple. Of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "毎日のように、新しい通貨やトークンを紹介する記事があります。たいていは\n同じようなコピー＆ペーストや、新技術がいかに素晴らしいかを語るだけで、実際には何の情報もない、空前絶後の「ニュース」記事への直接リンクだったりします。\nその新技術がいかに素晴らしいかを語るだけで、実質的な内容は何もありません。\n中身がない。ほとんどの場合、これはカルダノやリップルです。その中でも特に...",
      "title": "アルゴランド、そしてそれを選んだ理由"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "每天都有一些帖子兜售一种新的货币/代币，或另一种。通常情况下\n它们都是同样的复制/粘贴或直接链接到一些蝇头小利的 \"新闻 \"文章\n这些文章只谈及新技术如何伟大，而缺乏任何真正的\n实质内容。在大多数情况下，这是Cardano或Ripple。其中...",
      "title": "阿尔戈兰，以及我为什么选择它"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "每天都有一些帖子兜售一種新的貨幣/代幣，或另一種。通常情況下\n它們都是同樣的複製/粘貼或直接鏈接到一些蠅頭小利的 \"新聞 \"文章\n這些文章只談及新技術如何偉大，而缺乏任何真正的\n實質內容。在大多數情況下，這是Cardano或Ripple。其中...",
      "title": "阿爾戈蘭，以及我爲什麼選擇它"
    }
  ]
}