{
  "author": "BFalkmk3",
  "original_created_utc": 1637986015,
  "title": "I have more invested than I'm willing to lose, at this moment",
  "created_utc": 1638016248,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The ol&#39; adage goes &quot;don&#39;t invest more than your willing to lose&quot;, right? Well I did that. I invested 5% of my savings account back in 2020, and that amount, today, has turned into ~40% of my life savings. I&#39;ve taken profits during rips and used the same funds to buy the dips. I don&#39;t have all of that money into coins right now but a fair amount of it in BTC/ETH with relatively low buy ins.</p>\n\n<p>The way I see it, there are quite a few options on how to proceed:</p>\n\n<ol>\n<li><p>Leave my funds where they are (wallets, buying power on exchanges, etc.) and just keep doing what I&#39;m doing. I haven&#39;t been DCA&#39;ing since about July 2021 since I have buying power waiting. </p></li>\n<li><p>Same as 1, but no matter what, DCA</p></li>\n<li><p>Take profits and stick to the original 5% invested or so? (Gains are exponential, so I don&#39;t think I wanna do this)</p></li>\n<li><p>Take my original investment and return it into my savings account. Then it&#39;s basically &quot;house money&quot; that&#39;s invested.</p></li>\n<li><p>Something else that might be suggested here, except buying ADA, obviously</p></li>\n</ol>\n\n<p>What say ye?</p>\n</div><!-- SC_ON -->",
  "score": 169,
  "permalink": "/r/CryptoCurrency/comments/r34wg7/i_have_more_invested_than_im_willing_to_lose_at/",
  "subreddit": "CryptoCurrency",
  "id": "r34wg7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The ol' adage goes \"don't invest more than your willing to lose\", right? Well I\ndid that. I invested 5% of my savings account back in 2020, and that amount,\ntoday, has turned into ~40% of my life savings. I've taken profits during rips\nand used the same funds to buy the dips. I don't have all of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昔からの格言に「失う覚悟以上の投資はするな」というのがありますよね。さて、私は\nしました。2020年に預貯金の5％を投資しましたが、その額は今日、私の人生の貯金の40％になりました。\n今日では、私の人生の貯蓄の40％にもなっています。暴騰時に利益を出したこともありますし\n同じ資金でディップを買いました。私はすべてを持っていない...",
      "title": "私は今、失いたくないものよりも多くのものを投資しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "谚语说 \"不要投资超过你愿意失去的东西\"，对吗？嗯，我\n就这样做了。我在2020年投资了我储蓄账户的5%，而这个数额。\n今天，已经变成了我一生储蓄的~40%。我在暴跌时获利\n并用同样的资金来买入下跌的股票。我没有所有的...",
      "title": "此时此刻，我的投资比我愿意失去的要多。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "諺語說 \"不要投資超過你願意失去的東西\"，對嗎？嗯，我\n就這樣做了。我在2020年投資了我儲蓄賬戶的5%，而這個數額。\n今天，已經變成了我一生儲蓄的~40%。我在暴跌時獲利\n並用同樣的資金來買入下跌的股票。我沒有所有的...",
      "title": "此時此刻，我的投資比我願意失去的要多。"
    }
  ]
}