{
  "author": "TinyLadySender",
  "original_created_utc": 1659056245,
  "title": "If we soon need to start giving everyone smallpox shots would they still be using the same huge needle that they used to?",
  "created_utc": 1659085539,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So, all my shots that I have had in the last 10 years have been teeny tiny needles where you hardly feel them go in. I never got smallpox as it was &lt;strong&gt;eradicated&lt;/strong&gt; long before I was born. &lt;/p&gt;\n\n&lt;p&gt;If they needed to start up with this, would they have to use that same huge ass 2 pronged needle or would they be able to utilize new needle developments?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 111,
  "permalink": "/r/askscience/comments/waqq5m/if_we_soon_need_to_start_giving_everyone_smallpox/",
  "subreddit": "askscience",
  "id": "waqq5m",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So, all my shots that I have had in the last 10 years have been teeny tiny\nneedles where you hardly feel them go in. I never got smallpox as it was\neradicated long before I was born.\n\nIf they needed to start up with this, would they have to use that same huge ass\n2 pronged needle or would they be…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "だから、この10年間に私が受けた注射は、すべて10代の小さな\n針で、ほとんど刺さった感じがしない。天然痘はずいぶん前に根絶されたので、私は一度もかかっていません。\n天然痘は私が生まれるずっと前に根絶されたからです。\n\nもし、この注射を始めるとしたら、同じように巨大な2本針の注射器を使わなければならないのだろうか。\n2本の針で刺すのだろうか？",
      "title": "もし、天然痘の予防接種が必要になっても、今までと同じように大きな注射針を使うのだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，我在过去10年里打的所有针都是很小的。\n针头，你几乎感觉不到它们的进入。我从未得过天花，因为它在我出生前很久就已经被消灭了。\n因为它在我出生前就已经被根除了。\n\n如果他们需要用这个来启动，他们是否必须使用同样巨大的屁股？\n双管齐下的针头，或者他们会不会...",
      "title": "如果我们很快就需要开始给每个人注射天花疫苗，他们还会像以前那样使用巨大的针头吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，我在過去10年裏打的所有針都是很小的。\n針頭，你幾乎感覺不到它們的進入。我從未得過天花，因爲它在我出生前很久就已經被消滅了。\n因爲它在我出生前就已經被根除了。\n\n如果他們需要用這個來啓動，他們是否必須使用同樣巨大的屁股？\n雙管齊下的針頭，或者他們會不會...",
      "title": "如果我們很快就需要開始給每個人注射天花疫苗，他們還會像以前那樣使用巨大的針頭嗎？"
    }
  ]
}