{
  "author": "dwaynegibbous",
  "the_new_excerpt": "Some of the traders I follow say things like \"over $125 can see $132\" or \"over\n$367 stock XYZ can explode.\" More often than not, the price action plays out\njust as predicted.\n\nIn these examples, are the prices being referenced just major resistance levels?\nIf this is the case, are these levels…",
  "original_created_utc": 1618102326,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私がフォローしているトレーダーの中には、「125ドルを超えれば132ドルも見えてくる」とか「367ドルを超えれば株XYZは爆発する」などと言う人がいます。\n367ドルを超えるとXYZの株は爆発する」などと言います。多くの場合、予測通りの値動きをします。\n予測通りになることが多いです。\n\nこれらの例では、参照されている価格は単なる主要な抵抗レベルでしょうか？\nもしそうだとしたら、そのレベルは...",
      "title": "\"Stock needs over price x to see price y\" - これらの価格は単なる抵抗線でしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我关注的一些交易员说：\"超过125美元可以看到132美元 \"或 \"超过\n367美元的股票XYZ可以爆发。\" 更多的时候，价格走势表现为\n就像预测的那样。\n\n在这些例子中，被参考的价格是否只是主要阻力位？\n如果是这样，这些水平... ...",
      "title": "\"股票需要超过价格x才能看到价格y\"--这些价格只是阻力位吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我關注的一些交易員說：\"超過125美元可以看到132美元 \"或 \"超過\n367美元的股票XYZ可以爆發。\" 更多的時候，價格走勢表現爲\n就像預測的那樣。\n\n在這些例子中，被參考的價格是否只是主要阻力位？\n如果是這樣，這些水平... ...",
      "title": "\"股票需要超過價格x才能看到價格y\"--這些價格只是阻力位嗎？"
    }
  ],
  "title": "\"Stock needs over price x to see price y\" - are these prices just resistance levels?",
  "created_utc": 1618140328,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Some of the traders I follow say things like &quot;over $125 can see $132&quot; or &quot;over $367 stock XYZ can explode.&quot;  More often than not, the price action plays out just as predicted.</p>\n\n<p>In these examples, are the prices being referenced just major resistance levels?  If this is the case, are these levels determined just by looking at price action and/or a volume profile?</p>\n\n<p>When I draw these levels on charts, sometimes the prices are obvious support/resistance or inflection points (that I could probably have identified myself).  Other times they&#39;re not and so it made me curious what I could be missing.</p>\n\n<p>Thanks to anyone who can share insight!</p>\n</div><!-- SC_ON -->",
  "score": 48,
  "permalink": "/r/stocks/comments/mogxnp/stock_needs_over_price_x_to_see_price_y_are_these/",
  "subreddit": "stocks",
  "id": "mogxnp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566618910
}