{
  "author": "VannguardAnon",
  "original_created_utc": 1635597430,
  "title": "One shitcoin moons to infinity and beyond, and suddenly this sub turns into r/cryptomoonshots",
  "created_utc": 1635604406,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It&#39;s amazing how it only took SHIB to go parabolic for everyone here to start shilling shitcoins, asking what the next shitcoin is and praising SHIB and DOGE.</p>\n\n<p>I know this will probably get downvoted to oblivion and beyond, but not even a month ago, people on <a href=\"/r/CryptoCurrency\">r/CryptoCurrency</a> would recommend not gambling on shitcoins, and now everyone is here for the shitcoin casino.</p>\n\n<p>If you can&#39;t beat them, join them, I guess.</p>\n\n<p>Just remember that you only hear about shitcoins, if they start mooning. The rugpulls and the coins that never moon are countless, and if you shoot in the dark, you will most likely miss.</p>\n\n<p>I&#39;m even wondering if I should tag this as an unpopular opinion post.</p>\n\n<p>Edit: This is tagged Moons, because if you type &quot;moons&quot; in the title, it auto tags it. It was not on purpose.</p>\n</div><!-- SC_ON -->",
  "score": 191,
  "permalink": "/r/CryptoCurrency/comments/qj0m96/one_shitcoin_moons_to_infinity_and_beyond_and/",
  "subreddit": "CryptoCurrency",
  "id": "qj0m96",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It's amazing how it only took SHIB to go parabolic for everyone here to start\nshilling shitcoins, asking what the next shitcoin is and praising SHIB and DOGE.\n\nI know this will probably get downvoted to oblivion and beyond, but not even a\nmonth ago, people on r/CryptoCurrency [/r/CryptoCurrency]…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "驚くべきことに、SHIBがパラボリックになっただけで、ここにいる誰もが\n次のクソコインは何かと質問したり、SHIBやDOGEを賞賛したりして、クソコインを売り込んでいるのは驚きです。\n\nこの話はおそらく忘却の彼方にまでダウングレードされると思いますが、1ヶ月も前にr/Crypto.\n1ヶ月前、r/CryptoCurrency [/r/CryptoCurrency]の人々は...",
      "title": "1つのシットコインムーンが無限の彼方へ、そして突然このサブがr/cryptomoonshotsに変わります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "令人惊讶的是，仅仅在SHIB出现抛物线时，这里的每个人就开始\n兜售狗屎币，询问下一个狗屎币是什么，并赞扬SHIB和DOGE。\n\n我知道这可能会被降权，甚至被遗忘，但甚至不到一个月\n一个月前，人们在r/CryptoCurrency [/r/CryptoCurrency]...",
      "title": "一个狗屎币的月亮到无限远的地方，突然这个子就变成了r/cryptomoonshots"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "令人驚訝的是，僅僅在SHIB出現拋物線時，這裏的每個人就開始\n兜售狗屎幣，詢問下一個狗屎幣是什麼，並讚揚SHIB和DOGE。\n\n我知道這可能會被降權，甚至被遺忘，但甚至不到一個月\n一個月前，人們在r/CryptoCurrency [/r/CryptoCurrency]...",
      "title": "一個狗屎幣的月亮到無限遠的地方，突然這個子就變成了r/cryptomoonshots"
    }
  ]
}