{
  "author": "GiraffeGrad",
  "original_created_utc": 1637012259,
  "title": "This discussion about meme coins needs to be had.",
  "created_utc": 1637088300,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>**Note**: I will use acronyms instead of the token name to avoid issues with the mods. Which I am flabbergasted that posting about certain cryptocurrencies in a cryptocurrency reddit is prohibited.</p>\n\n<p>Disclaimer: This is a self story. I am a working professional with money - look at my previous post history for evidence. I have $30,000 invested in DB and can provide receipts. I purchased it at these prices, I am not an OG holder. I treat this as an investment - I made the conscious decision to buy DB. Why? I am investing in the future of a community with a potential of claiming high social stature, a community that makes me laugh and bonus points if I make a ton of money.</p>\n\n<p>We all know that 2021 was the year of meme coins. I watched DOGE and SHIB pass me by. Just as I watched $GME, $AMC and $TSLA pass me by. I have always thought to myself, there is no way in the world those investors make any money. Of course not, they are not doing it correctly, you are supposed to go to college and work 80 hour weeks, or create a startup and shill it to old investors who then give you the right of passage. Or you are supposed to stay up all day and night analyzing academic papers on blockchain technologies to find the next best &quot;real&quot; crypto investment. Yet, here we are.</p>\n\n<p>I started to ask myself, why are these meme coins valuable? DOGE is a currency based on the original Doge meme. SHIB was marketed as the DOGE killer. There has to be more to it than that. Anyways, I heard faint whispers of a new currency called DB and decided I was not going to be a bystander anymore. I wanted to learn more. I joined the Telegram and observed for weeks and lo&#39; and behold, I got the answer I was looking for: I found myself in the trenches amongst a team of professional marketers, software engineers and &quot;memers&quot;. A lone wolf in the Telegram decided to spend $30,000 on a billboard in NYC. I ventured to Penn Station and saw the billboard with my own eyes. Marketing geniuses started to market DB across social media in creative ways. I saw the currency grow from 8000 holders to 24,000 holders right before my very eyes and I knew why. Companies pay six figures to assemble teams as dedicated, enthusiastic and creative. Not to mention, they <em>are</em> funny. On the Discord there is a team of software engineers working for <strong>FREE</strong> to create open source apps for this currency such as a meme generator - mind you, apps that companies pay software engineers six figures to create. Yet, here was a group of misfits, accomplishing things industry professionals often times could not.</p>\n\n<p>Why are they doing this? Based on my observations, their goals were three-fold:</p>\n\n<ol>\n<li>Entertain by pulling off social stunts.</li>\n<li>Entertain by spreading ridiculous memes.</li>\n<li>Use blockchain technology in creative ways to provide utility.</li>\n</ol>\n\n<p>I also found that many of these people shunned by the internet were kind. Another DB holder pledged and made good on his promise to donate $10,000 to St Jude&#39;s Research Hospital. None of my co-workers nor myself do that and mind you, I get paid a lot.</p>\n\n<p>This community (among other meme coin communities) is teaching me a great deal about life and I think you should start paying attention too. I do not care if I lose my investment, I am not recommending you invest in DB, this is not financial advice. I am merely sharing my story. Having said that, if this team can pull off the social campaigns they plan to, my money will multiply in ways I cannot attain as a graduate from a top 10 U.S. university working in one of the most profitable industries in the world. There is a reason for that, money is reserved for certain people, it is not for everyone and memecoins are essentially a revolution.</p>\n\n<p>Some memes I like:</p>\n\n<p><a href=\"https://preview.redd.it/nd8413b6wtz71.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;s=5a6633088566138387a91634a980dfd33f8a3207\">Case and point 1</a></p>\n\n<p><a href=\"https://preview.redd.it/wlfsx3e7wtz71.jpg?width=640&amp;format=pjpg&amp;auto=webp&amp;s=9a01782a4ff1ef0d7e65b467681e1f41bbf5001c\">Case and point 2</a></p>\n\n<p>Like who is even creating these?</p>\n\n<p>TLDR: Meme coins are the real deal and in my opinion will be regulated soon and new memecoin crypto millionaires will not be minted anymore. Why must we relive the same stale story over and over again? Meme coins with social potential are created, people hate on them and shun the community, they take off to levels people never imagined and then the same people who were hating post screenshots of how they regret selling.</p>\n</div><!-- SC_ON -->",
  "score": 164,
  "permalink": "/r/CryptoCurrency/comments/qur4nq/this_discussion_about_meme_coins_needs_to_be_had/",
  "subreddit": "CryptoCurrency",
  "id": "qur4nq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "**Note**: I will use acronyms instead of the token name to avoid issues with the\nmods. Which I am flabbergasted that posting about certain cryptocurrencies in a\ncryptocurrency reddit is prohibited.\n\nDisclaimer: This is a self story. I am a working professional with money - look\nat my previous post…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "**注**。modsとの問題を避けるため、トークン名の代わりに頭文字を使用します。\nmods. 特定の暗号通貨について、暗号通貨のredditに投稿することが禁止されていることには、はっとさせられます。\ncryptocurrency redditで特定の暗号通貨について投稿することは禁止されています。\n\n免責事項：これは自分語りです。私はお金を持っている社会人です。\n私の前の投稿を見てください...",
      "title": "このミームコインについての議論は必要です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "**注意**。我将使用首字母缩写而不是代名词，以避免与修改者发生问题。\n修改的问题。我很惊讶，在加密货币网站上发布关于某些加密货币的信息是被禁止的。\n我很惊讶，在加密货币红点上发布某些加密货币是被禁止的。\n\n免责声明：这是一个自我故事。我是一个有钱的职业人--看看\n看我以前的帖子...",
      "title": "这种关于纪念币的讨论需要进行。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "**注意**。我將使用首字母縮寫而不是代名詞，以避免與修改者發生問題。\n修改的問題。我很驚訝，在加密貨幣網站上發佈關於某些加密貨幣的信息是被禁止的。\n我很驚訝，在加密貨幣紅點上發佈某些加密貨幣是被禁止的。\n\n免責聲明：這是一個自我故事。我是一個有錢的職業人--看看\n看我以前的帖子...",
      "title": "這種關於紀念幣的討論需要進行。"
    }
  ]
}