{
  "author": "PunPryde",
  "original_created_utc": 1628075807,
  "title": "Where to watch the London hard fork countdown live and track amount of ETH burned",
  "created_utc": 1628091034,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>People keep asking when exactly the London hard fork is happening and where they can follow it. So I put together this quick list of resources for everyone that may help!     </p>\n\n<p>The London hard fork does not happen at a specific time but at a specific Ethereum block height (12,965,000) which is estimated to happen at around Thursday, August 5 at 1:41pm (BST) or 12:41pm (UTC).   </p>\n\n<p>You can track the countdown in real-time on the two following sites. After the upgrade happens they will also show live the amount of ETH that has been burned:   </p>\n\n<ul>\n<li><p><a href=\"https://watchtheburn.com/\">https://watchtheburn.com/</a>    </p></li>\n<li><p><a href=\"https://ethernodes.org/london\">https://ethernodes.org/london</a>   </p></li>\n<li><p><a href=\"https://www.etherchain.org/burn\">https://www.etherchain.org/burn</a> </p></li>\n</ul>\n\n<p>There are also watch parties out there you can join if you want to hangout with a bunch of ETH fans and devs for the countdown and upgrade. They usually have some games and prizes too. ETHstaker usually hosts the biggest and best one, you can find that here: <a href=\"https://youtu.be/afAFQY--GlI\">https://youtu.be/afAFQY--GlI</a></p>\n</div><!-- SC_ON -->",
  "score": 177,
  "permalink": "/r/CryptoCurrency/comments/oxqi84/where_to_watch_the_london_hard_fork_countdown/",
  "subreddit": "CryptoCurrency",
  "id": "oxqi84",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "People keep asking when exactly the London hard fork is happening and where they\ncan follow it. So I put together this quick list of resources for everyone that\nmay help!\n\nThe London hard fork does not happen at a specific time but at a specific\nEthereum block height (12,965,000) which is estimated…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ロンドンのハードフォークがいつ行われるのか、どこでフォローできるのかという質問が絶えません。\n聞かれます。そこで私は、ロンドンのハードフォークに興味を持っている人のために、リソースのクイックリストを作成しました。\n役に立つかもしれません。\n\nロンドンのハードフォークは特定の時間に起こるのではなく、特定の時間に起こります。\nイーサリアムのブロックハイト（12,965,000）が推定されています...",
      "title": "ロンドンのハードフォークのカウントダウンをライブで見て、燃やされたETHの量を追跡する場所"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "人们一直在问，伦敦硬分叉到底什么时候发生？\n可以关注它。所以我把这个快速资源清单放在一起，供大家参考。\n可能会有帮助!\n\n伦敦硬分叉并不是在一个特定的时间发生，而是在一个特定的\n以太坊区块高度（12,965,000），估计...",
      "title": "在哪里可以看到伦敦硬分叉倒计时的实况并跟踪ETH的燃烧量"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "人們一直在問，倫敦硬分叉到底什麼時候發生？\n可以關注它。所以我把這個快速資源清單放在一起，供大家參考。\n可能會有幫助!\n\n倫敦硬分叉並不是在一個特定的時間發生，而是在一個特定的\n以太坊區塊高度（12,965,000），估計...",
      "title": "在哪裏可以看到倫敦硬分叉倒計時的實況並跟蹤ETH的燃燒量"
    }
  ]
}