{
  "author": "Fleegalicious",
  "original_created_utc": 1627395526,
  "title": "I’m going to use some gains from my crypto portfolio to pay for my dog’s surgery.",
  "created_utc": 1627418234,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My poor pup tore his ACL and has been walking on just 3 legs ever since, (I’ve been lovingly calling him tripod since it started). It unfortunately won’t heal on its own and the surgery is around $2500 USD which is not something I’d normally be able to afford (I start grad school in a month and am generally living paycheck to paycheck). </p>\n\n<p>HOWEVER, the investments I’d made in some altcoins some time ago has turned a profit, even with the big sell off in May, and I’m able to start to cover the expenses because of the info I got in this sub. </p>\n\n<p>This sub really helped me to get into crypto awhile back and now I’m actually able to do something really constructive with it. My dog turned 11 in June and I know he’s getting older but he’s been there for me when I needed him most, and I feel I owe the many anonymous people in this sub a thank you for giving me a chance to help him get back to a pain free life.</p>\n\n<p>Edit: thank you so much for the words of encouragement!!! I will be doing the following:</p>\n\n<ol>\n<li><p>Updating this post with how the surgery goes (the soonest I can schedule it is a month out).</p></li>\n<li><p>Sending pics of my good boy to anyone who sends me a message asking, I literally have hundreds and I’d love to share!</p></li>\n</ol>\n\n<p>Thank you so much for the awards also! I’ve never really gotten those before haha. God bless!</p>\n</div><!-- SC_ON -->",
  "score": 165,
  "permalink": "/r/CryptoCurrency/comments/osnqcq/im_going_to_use_some_gains_from_my_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "osnqcq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My poor pup tore his ACL and has been walking on just 3 legs ever since, (I’ve\nbeen lovingly calling him tripod since it started). It unfortunately won’t heal\non its own and the surgery is around $2500 USD which is not something I’d\nnormally be able to afford (I start grad school in a month and am…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私のかわいそうな子犬はACLを断裂してしまい、それ以来3本足で歩いています。\nそれ以来、愛を込めて三脚と呼んでいます）。) 残念ながら自然には治りません。\n手術費用は約2500ドルで、通常では考えられない金額です。\n私は1ヶ月後に大学院に入学するため、通常では買えない金額です（...",
      "title": "暗号ポートフォリオから得た利益を犬の手術代に充てるつもりです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我可怜的小狗撕裂了他的十字韧带，从那时起就一直用三条腿走路。\n从那时起，我就亲切地称它为 \"三脚架\"。) 不幸的是，它不会自行痊愈\n而手术费大约是2500美元，这不是我通常能够负担得起的。\n这不是我通常能够负担得起的（我在一个月内开始读研究生，而且我...",
      "title": "我打算用我的加密货币投资组合的一些收益来支付我的狗的手术费。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我可憐的小狗撕裂了他的十字韌帶，從那時起就一直用三條腿走路。\n從那時起，我就親切地稱它爲 \"三腳架\"。) 不幸的是，它不會自行痊癒\n而手術費大約是2500美元，這不是我通常能夠負擔得起的。\n這不是我通常能夠負擔得起的（我在一個月內開始讀研究生，而且我...",
      "title": "我打算用我的加密貨幣投資組合的一些收益來支付我的狗的手術費。"
    }
  ]
}