{
  "author": "jurble",
  "original_created_utc": 1636645251,
  "title": "People of Iranian ancestry seem over-represented as authors of early Islamic religious texts and historical works. I've heard that this is because Iran had a literary culture while the Arabs did not. But I've also heard very little Sassanian writing exists. Are there 'lost' Sassanian works?",
  "created_utc": 1636717640,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Moreover, based on a Twitter thread I saw once, Khurasanis are over-represented amongst the Iranian authors.</p>\n\n<p>And how valid is the argument that Arabs lacked a literary culture when they definitely have had writing for centuries?</p>\n\n<p>So really several questions I guess:</p>\n\n<ol>\n<li><p>Why so many Iranian-ancestry authors relative to Arabs?</p></li>\n<li><p>Did the Sassanian dynasty have significantly more extensive literature than has survived to the present?</p></li>\n<li><p>What&#39;s the deal with so many Khurasani-ancestry authors?</p></li>\n</ol>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/qrnz35/people_of_iranian_ancestry_seem_overrepresented/",
  "subreddit": "AskHistorians",
  "id": "qrnz35",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Moreover, based on a Twitter thread I saw once, Khurasanis are over-represented\namongst the Iranian authors.\n\nAnd how valid is the argument that Arabs lacked a literary culture when they\ndefinitely have had writing for centuries?\n\nSo really several questions I guess:\n\n 1. Why so many Iranian…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "また、以前見たツイッターのスレッドによると、イラン人作家の中ではクラサニ人が多いそうです。\nイランの作家の中ではクラサニ人が多い。\n\nまた、アラブ人には文学的な文化がなかったという議論がどれほど有効なのか。\nまた、アラブ人は何世紀にもわたって文字を書いてきたのに、文学文化がなかったという議論はどれほど有効なのでしょうか？\n\nというわけで、いくつかの質問をしてみます。\n\n 1. なぜ多くのイラン人が...",
      "title": "初期イスラムの宗教書や歴史書の著者には、イラン系の人が多いようです。これは、イランには文学文化があり、アラブにはなかったからだと聞いたことがあります。しかし、ササン朝の書物はほとんど存在しないとも聞いています。失われた」ササン朝の作品はあるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "此外，根据我曾经看到的一个推特话题，胡拉桑人在伊朗作家中的比例过高。\n在伊朗作家中的比例过高。\n\n说阿拉伯人缺乏文学文化的说法有多大意义呢？\n几个世纪以来，阿拉伯人肯定有写作。\n\n所以我想有几个问题。\n\n 1. 为什么这么多伊朗人...",
      "title": "有伊朗血统的人似乎在早期伊斯兰宗教文本和历史作品的作者中占了很大比例。我听说，这是因为伊朗有文学文化，而阿拉伯人没有。但我也听说很少有萨珊王朝的文字存在。是否有 \"失落的 \"萨珊人作品？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "此外，根據我曾經看到的一個推特話題，胡拉桑人在伊朗作家中的比例過高。\n在伊朗作家中的比例過高。\n\n說阿拉伯人缺乏文學文化的說法有多大意義呢？\n幾個世紀以來，阿拉伯人肯定有寫作。\n\n所以我想有幾個問題。\n\n 1. 爲什麼這麼多伊朗人...",
      "title": "有伊朗血統的人似乎在早期伊斯蘭宗教文本和歷史作品的作者中佔了很大比例。我聽說，這是因爲伊朗有文學文化，而阿拉伯人沒有。但我也聽說很少有薩珊王朝的文字存在。是否有 \"失落的 \"薩珊人作品？"
    }
  ]
}