{
  "author": "ShotBot",
  "original_created_utc": 1649766710,
  "title": "USD Inflation surges to 8.5% on an annual basis, highest since 1981 (according to newly released CPI Report)",
  "created_utc": 1649788658,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;The Consumer Price Index for All Urban Consumers (CPI-U) increased 1.2 percent in March on a seasonally adjusted basis after rising 0.8 percent in February, the U.S. Bureau of Labor Statistics reported today. Over the last 12 months, the all items index increased 8.5 percent before seasonal adjustment.   &lt;/p&gt;\n\n&lt;p&gt;Increases in the indexes for gasoline, shelter, and food were the largest contributors to the seasonally adjusted all items increase. The gasoline index rose 18.3 percent in March and accounted for over half of the all items monthly increase; other energy component indexes also increased. The food index rose 1.0 percent and the food at home index rose 1.5 percent.  &lt;/p&gt;\n\n&lt;p&gt;The index for all items less food and energy rose 0.3 percent in March following a 0.5-percent increase the prior month. The shelter index was by far the biggest factor in the increase, with a broad set of other indexes also contributing, including those for airline fares, household furnishings and operations, medical care, and motor vehicle insurance. In contrast, the index for used cars and trucks fell 3.8 percent over the month.    &lt;/p&gt;\n\n&lt;p&gt;The all items index continued to accelerate, rising 8.5 percent for the 12 months ending March, the largest 12-month increase since the period ending December 1981. The all items less food and energy index rose 6.5 percent, the largest 12-month change since the period ending August 1982. The energy index rose 32.0 percent over the last year, and the food index increased 8.8 percent, the largest 12-month increase since the period ending May 1981.  &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.bls.gov/news.release/cpi.nr0.htm\"&gt;https://www.bls.gov/news.release/cpi.nr0.htm&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 359,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/1JYBhVJnbTYfqNlInD5-YEHzqPvX6811h3aqxkNBSzw.jpg?auto=webp&amp;s=e0feb26e71d4a790d4619fc7e39abfcfdd7d9f41",
          "width": 128,
          "height": 128
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/1JYBhVJnbTYfqNlInD5-YEHzqPvX6811h3aqxkNBSzw.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=d8852901354996c4fda2e4766d1ac5c2da695d85",
            "width": 108,
            "height": 108
          }
        ],
        "variants": {},
        "id": "duUY1wLBBjN1jOxy3I-D4uIKy4rDPzL2db0Fk42zDf4"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/Bitcoin/comments/u1xzic/usd_inflation_surges_to_85_on_an_annual_basis/",
  "subreddit": "Bitcoin",
  "id": "u1xzic",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "> The Consumer Price Index for All Urban Consumers (CPI-U) increased 1.2 percent\n> in March on a seasonally adjusted basis after rising 0.8 percent in February,\n> the U.S. Bureau of Labor Statistics reported today. Over the last 12 months,\n> the all items index increased 8.5 percent before seasonal…"
}