{
  "author": "OldHanBrolo",
  "original_created_utc": 1633770650,
  "title": "I’m not an anti vaxxer but do think people should be allowed to choose for themselves, am I a bad person?",
  "created_utc": 1633786498,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have my moderna vaccination and had got it back in March when I first could. I am very pro science. I do understand there is a lot of misinformation leading people to choose not get the vaccine, however I still believe it’s there choice. It’s there body it should be there choice. I believe this just the same as I believe with abortion the women should get to decide since it is there body. Why does it seem like people don’t approve of allowing people to do what they want with there bodies? Where does that self righteousness come from that makes a person think they should be able to force people to get it?</p>\n</div><!-- SC_ON -->",
  "score": 117,
  "permalink": "/r/TooAfraidToAsk/comments/q4hpn8/im_not_an_anti_vaxxer_but_do_think_people_should/",
  "subreddit": "TooAfraidToAsk",
  "id": "q4hpn8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I have my moderna vaccination and had got it back in March when I first could. I\nam very pro science. I do understand there is a lot of misinformation leading\npeople to choose not get the vaccine, however I still believe it’s there choice.\nIt’s there body it should be there choice. I believe this…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はモデナの予防接種を受けていますが、3月に初めて受けた時にも受けていました。I\n私は非常に科学を支持しています。多くの誤った情報が、人々にワクチンを受けないように導いていることは理解しています。\nしかし、私はそれが彼らの選択であると信じています。\nそれは彼らの体であり、彼らの選択であるべきです。私はこれを信じています...",
      "title": "私は反バクサーではありませんが、人々は自分で選択することが許されるべきだと考えています。私は悪い人間でしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我有我的modernna疫苗，而且早在3月我第一次可以得到它。I\n我非常支持科学。我知道有很多错误的信息导致人们选择不接种疫苗。\n然而，我仍然相信这是他们的选择。\n这是他们的身体，应该是他们的选择。我相信这...",
      "title": "我不是一个反对打疫苗的人，但确实认为应该允许人们自己选择，我是一个坏人吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我有我的modernna疫苗，而且早在3月我第一次可以得到它。I\n我非常支持科學。我知道有很多錯誤的信息導致人們選擇不接種疫苗。\n然而，我仍然相信這是他們的選擇。\n這是他們的身體，應該是他們的選擇。我相信這...",
      "title": "我不是一個反對打疫苗的人，但確實認爲應該允許人們自己選擇，我是一個壞人嗎？"
    }
  ]
}