{
  "author": "unholyfire",
  "original_created_utc": 1635632742,
  "title": "A magnetic storm is coming. I'm shielding my hardware wallets from it, in my microwave.",
  "created_utc": 1635680304,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As you may have heard, a magnetic storm is inbound to hit earth between now and tomorrow evening. The possibilities of how this may affect our hardware wallets is frightening, to put it mildly. So, I&#39;ve done some research and decided that the best course of action is to fight fire with fire. I&#39;ll be stashing my hardware wallets in my microwave, as well as wearing my custom tinfoil hat (magnetic sensory amplifier), and when I get a tingle, I&#39;m hitting full-send on microwave to protect my assets!</p>\n\n<p>Don&#39;t be a sucker, grab your magnetic sensory amplifier hats, prepare your microwave, and hit start AS SOON as you feel an anvil approaching your face at 1000 mph due to the suns magnetic malevolence.</p>\n\n<p>Stay vigilant my friends!</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/qjc3jz/a_magnetic_storm_is_coming_im_shielding_my/",
  "subreddit": "CryptoCurrency",
  "id": "qjc3jz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As you may have heard, a magnetic storm is inbound to hit earth between now and\ntomorrow evening. The possibilities of how this may affect our hardware wallets\nis frightening, to put it mildly. So, I've done some research and decided that\nthe best course of action is to fight fire with fire. I'll be…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ご存知かもしれませんが、今から明日の夜にかけて磁気嵐が地球を直撃します。\n明日の夕方までに地球を襲う予定です。これが私たちのハードウェアのお財布にどのような影響を与えるのか\n控えめに言っても、恐ろしいことです。そこで、私はいくつかの調査を行い、次のように判断しました。\n毒をもって毒を制すというのが最善の行動だと思います。私は...",
      "title": "磁気嵐がやってくる。電子レンジでハードウェアウォレットを遮蔽しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你可能已经听说了，从现在到明天，一场磁暴将袭击地球。\n明天晚上。这可能会影响我们的硬件钱包\n的可能性是令人恐惧的，可以说是温和的。因此，我做了一些研究并决定\n最好的行动方案是以毒攻毒。我将会...",
      "title": "一场磁暴即将来临。我正在用微波炉屏蔽我的硬件钱包。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你可能已經聽說了，從現在到明天，一場磁暴將襲擊地球。\n明天晚上。這可能會影響我們的硬件錢包\n的可能性是令人恐懼的，可以說是溫和的。因此，我做了一些研究並決定\n最好的行動方案是以毒攻毒。我將會...",
      "title": "一場磁暴即將來臨。我正在用微波爐屏蔽我的硬件錢包。"
    }
  ]
}