{
  "author": "KSInvestor",
  "the_new_excerpt": "G1 Theraputics\n\nHistory:\n\nG1 Theraputics is a newer drug company that develops and commercializes various\ntherapies primarily relating to the treatment of cancer and cancer related\nsymptoms. It was founded in 2008 and went public in May 2017.\n\nG1 has three main drub candidates; lerociclib,…",
  "original_created_utc": 1622842262,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "G1 セラピューティック\n\n沿革\n\nG1 Theraputics社は、主に癌や癌関連の治療に関する様々な治療法を開発・商業化している新薬メーカーです。\n主に、がんおよびがんに関連する症状の治療に関連する様々な治療法を開発・商業化している新しい製薬会社です。\n症状を対象としています。2008年に設立され、2017年5月に上場しました。\n\nG1は、3つの主要なドラブ候補を持っています。",
      "title": "GTHX a DD; note this DD is about 3 months ago, no change for events of the past 3 months"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "G1治疗学\n\n历史。\n\nG1 Theraputics是一家较新的药物公司，开发和商业化各种\n疗法，主要与治疗癌症和癌症相关症状有关。\n症状。它成立于2008年，于2017年5月上市。\n\nG1有三个主要的候选药物；lerociclib，...",
      "title": "GTHX是一个DD；注意这个DD大约是3个月前的，过去3个月的事件没有改变。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "G1治療學\n\n歷史。\n\nG1 Theraputics是一家較新的藥物公司，開發和商業化各種\n療法，主要與治療癌症和癌症相關症狀有關。\n症狀。它成立於2008年，於2017年5月上市。\n\nG1有三個主要的候選藥物；lerociclib，...",
      "title": "GTHX是一個DD；注意這個DD大約是3個月前的，過去3個月的事件沒有改變。"
    }
  ],
  "title": "GTHX a DD; note this DD is about 3 months old, no changes have been made for events of the past 3 months",
  "created_utc": 1622887676,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>G1 Theraputics</p>\n\n<p>History:</p>\n\n<p>G1 Theraputics is a newer drug company that develops and commercializes various therapies primarily relating to the treatment of cancer and cancer related symptoms. It was founded in 2008 and went public in May 2017.  </p>\n\n<p>G1 has three main drub candidates; lerociclib, rintodestrant and trilaciclib; plus one newer as yet unnamed drug. </p>\n\n<p>Lerociclib (a drug with no current assignable value, but possible future payments):</p>\n\n<p>The first drug candidate, lerociclib is being tested for multiple possible uses, however G1 has entered into agreements with EQRx, Inc and Genor Biopharma Co. Inc, such that these companies with test and commercialize the drug. Genor Biopharma Co. Inc has rights to commercialize this drug in the Asia Pacific region, including Japan; while EQRx Inc has rights to the rest of the world, including the USA. In return for ceding the testing and commercialization of lerociclib, G1 received payments of 26 million and could receive up to $330 million in additional milestone payments in the future. </p>\n\n<p>It is unclear at this stage in G1 will ever receive future payments for this drug, it is unclear when these payments might occur, and furthermore the amount of money under consideration ($330 million) is fairly small when compared to the possible funds from G1&#39;s other drug candidates.  However, the companies that purchased the rights to the drug did already pay 26 million for those rights, so its likely they see significant possible future value in the drug.</p>\n\n<p>Thus, taking all these pieces of info into account, this report assigns this drug a fairly conservative future value of 20-30% of the possible future payments, or 67 to 133 million dollars. This payment must be discounted as it may not start for 3-5 years and would likely continue over several years. So, if this possible future revenue is discounted by 8% for 8 years (0.54 multiplier) this gives a current value to G1 of 36 to 72 million dollars.</p>\n\n<p>Rintodestrant (G1&#39;s 2nd drug, some possible future value):</p>\n\n<p>With regards to the 2nd drug candidate, rintodestrant, G1 is currently testing this drug for use in patients with  ER+ or HER2- breast cancer. Beast cancer accounts for about 30% of all cancers in females, in the USA.  About 65% of breast cancer is ER+, which means that estrogen mistakenly signals the cancer to grow and sometimes even protects the cancer from the body&#39;s own immune system. To combat this there are several possible treatments but for many of the cancers, a class of drugs called SERD&#39;s has proven to be very effective often when other treatments fail.  SERD&#39;s promote ER degradation which can have many anti-tumor effects, again primarily in use with cancers that have shown a resistance to other drugs.</p>\n\n<p>Currently only one SERD, fluvestrant (a competing drug sold by AstraZeneca) is approved for use though several other SERD&#39;s, including the G1 candidate, rintodestrant, are being tested.  G1 began a phase I test of rintodestrant in 2018 and presented data from this test in 2019 and 2020. Based on the results of the phase I test, rintodestrant is likely (though as yet, not proven) to be more potent in binding and degrading ER, which would lead to faster and more complete degradation of tumors.  Additionally, rintodestrant has been observed to have a lower incidence of adverse effects, no severe side effects as well as no observed toxicity or bradycardia (bradycardia refers to an abnormally lowered heart rate). Furthermore, rintodestrant is easier to administer as it can be given orally (fluvestrant is administered by injection).</p>\n\n<p>Based on the successful phase I results, G1 is now conducting a phase II trial of rintodestrant when used in combination with another drug, Palbociclib.   Palbociclib is a drug developed by Pfizer and the trial is of course being conducted with agreement from Pfizer.  The results of this trial should be made public in the 2nd quarter of 2021 ie within a few months.</p>\n\n<p>Regarding assessment of the current value of rintodestrant, there are several problems.  First off, there is a competing drug, fluvestrant, currently being used and other competing drugs currently being tested. While rintodestrant appears to have various advantages over fluvestrant, the main possible advantage would be that its is more potent and though rintodestrant does appear to be more potent (based on the completed phase I trial), this has yet to be fully proven. Additionally further testing of rintodestrant will take several more years and finally, the current testing of rintodestrant is for use in combination with another drug, Palbociclib, and its unclear how revenue would be shared between these 2 drugs if any revenue ever occurs.</p>\n\n<p>The current drug being used in these cases of breast cancer, fluvestrant, had 2020 worldwide sales of 580 million.  In a best case scenario, rintodestrant would take over most of these sales, and these sales have room to grow. However, even in the best case this would not occur for 3-5 years or more, and much of the sales would likely still go to Pfizer if their drug, palbociclib, was used in combination with rintodestrant.  </p>\n\n<p>It seems likely that rintodestrant is a more potent drug than fluvestrant (based on the phase I trial) and also seems likely that rintodestrant has no major side effects and fewer side effects than fluvestrant. It thus seems fairly likely that rintodestrant would eventually replace fluvestrant in large part if not completely, if no additional drugs show up that are even more potent than rintodestrant.</p>\n\n<p>Thus I am estimating an optimistic assessment of the future income stream for this drug (if there ever is one) at about 350 million per year starting in 3-5 years. This represents the current revenue stream (with room to grow),  but discounted for the possibility that the income is shared to some degree with Pfizer.  I am further estimating the likelihood that G1 is able to realize this income stream at about 30% (of course there is also a strong possibility they will realize a lesser amount of income).  This 30% represents the chance that rintodestrant is more effective than fluvestrant (it probably is), is well received and able to mostly or partially replace fluvestrant (it probably will, if it is proven to be a better drug), and finally that no competing drugs quickly emerge that are still more effective than rintodestrant (unlikely, but who knows).</p>\n\n<p>Thus, 30% of 350 million means a expected future income stream of about 105 million, starting in 3-5 years or more, but of course, taking some years for the income stream to reach full strength even if everything goes well.  Discounting the income stream at 8% for 6 years (0.63 multiplier) leads to a present value of the income stream of about 66 million, which equates to a current value to G1 of between 133 million and 200 million (assuming a revenue multiplier of 2 to 3).</p>\n\n<p>Trilaciclib (G1&#39;s third drug which has far higher potential)</p>\n\n<p>Though G1 has a few other possible drug candidates (one in particular) they are considering, its difficult to assign any value to these currently untested drugs. Thus, G1&#39;s third and final drug of note is Trilaciclib. </p>\n\n<p>Trilaciclib has been tested and continues to be tested as a drug to be used to reduce myelosuppression (ie protecting the bone marrow which can be greatly suppressed by chemo) in patients receiving chemotherapy to combat diagnosed cancers in the body.  Trilaciclib has already been fully tested (thru phase 3) and proven to be effective in reducing myelosuppression in SCLC (small cell lung cancer) patients. Based on this SCLC testing, G1 has received from the FDA a positive PDUFA decision on February 21, 2021 (3 weeks ago).  This means that patients receiving chemotherapy treatment for SCLC can now receive Trilciclib (which is marketed under the tradename Cosela) as part of their treatment.</p>\n\n<p>Regarding the positive effects of triciclib as proved through testing, by protecting the bone marrow from chemotherapy, triciclib reduces the rate of hematologic adverse events including neutropenia (a condition caused by a reduction in certain types of white blood cells which in turn reduces the body&#39;s ability to fight infection), anemia (reduction of red blood cells), and thrombocytopenia (reduction of platelets in the blood).  This means patients can receive longer duration chemotherapy treatments and often still have fewer side effects. Also, the immune system functions better than chemotherapy without triciclib and thus the body&#39;s own immune system is sometimes better able to help combat the invasive cancer and its effects.  Also, the reduction of chemotherapy side effects equates to generally shorter hospital stays with fewer problems which can save considerable money for the patients and insurance providers.</p>\n\n<p>To see how widely used triciclib would likely be, G1 interviewed prescribers and found that 77% were extremely enthusiastic, very enthusiastic, or somewhat enthusiastic about the possibility of using triciclib with their patients.  </p>\n\n<p>In their testing, G1 found that patients living with SCLC and receiving Cosela took 100% to 200% longer to report adverse symptoms including extreme fatigue (7 months with Cosela versus 2.3 months with a placebo), tested anemia (7.2 months with Cosela versus 3.8 months with a placebo) and overall functional well being (7.6 months with Cosela versus 3.8 months with a placebo).</p>\n\n<p>Finally, the average treatment cost for a patient with chemotherapy who does not experience a grade 3/4 hematological event is a whopping $67,800; while the cost with a grade 3/4 event is approximately $90,100 (with Thrombocytopenia), $96,000 (with Anemia) and $131,000 (with neutropenia).  Thus, the helpful effects of Cosela might be such that the insurance companies would be happy to pay $8500 (the approximate cost each cycle of chemo) for the Cosela treatment to hopefully greatly reduce the average treatment cost and the incidence of a grade 3/4 hematological event which carries even greater costs which are enumerated above.</p>\n\n<p>Regarding the approved SCLC treatment for triciclib and the income G1 can expect from it.  Approximately 30,000 patients are diagnosed with SCLC every year and of this number about 22,000 receive chemotherapy treatment. Patients who receive chemotherapy need an average of 4 cycles of chemotherapy treatment.  Cosela costs $1417 per vial, but patients require 2 vials per dose, 3 doses per chemotherapy cycle, and 4 chemotherapy cycles, on average. Thus, the total cost is $8502 for the average patient for one cycle of chemotherapy, which equates to $34,008 total average cost (with the average 4 cycles of chemo), per patient. With about 22,000 people being treated for SCLC, this equates to a potential income stream of about 770 million per year (this assumes most SCLC patients will eventually be using Triciclib which is what G1 appears to be projecting or at least hoping will come to pass).  This, in turn, equates to an approximate value to G1 of between 1.54 billion to 2.31 billion assuming a revenue to value multiplier from 2 to 3 (which might be a very conservative multiplier considering the drug is approved and sales have commenced).</p>\n\n<p>In addition to approval for use in patients with SCLC, G1 is now testing, or has announced testing, for triciclib with patients of several other types of cancer including first line colorectal cancer, triple negative breast cancer, neoadjuvant breast cancer, bladder cancer, and non small cell lung cancer. Some of these tests are well underway, some are recently started and some have been approved but not yet started.  </p>\n\n<p>Though G1 has to test its drug on each type of cancer seperately, the mechanism by which triciclib protects the bone marrow is the same regardless of the type of cancer and for almost all types of cancer (and all types that G1 is currently testing) the drug functions in a completely different part of the body (the bone marrow) as where the cancer is located. Thus, if triciclib works well for SCLC cancer, then it is likely it has approximately the same effects and symptoms as with other types of cancer, with the exception of cancer which is specifically located in the red bone marrow - a small subset of all cancer types.</p>\n\n<p>Furthermore, since G1 has already received approval for triciclib with one type of cancer, testing on cancers in other parts of the body can be somewhat sped up as some of the results/ information from the SCLC testing can be easily applied to testing for other types of cancer. Thus, so long as G1 tests carefully and receives no unexpected results (again they know what the results will probably be from the SCLC testing), it will probably be easier to get future approvals for use with other types of cancer.  Essentially G1 has to simply run similar trials to what they ran for SCLC and prove that they get similar results, but its already expected that this will be the case since the functioning of the drug should have nothing to do with the type of cancer being tested (so long as the cancer is not in the bone marrow, where the drug functions).</p>\n\n<p>Currently, G1 is in phase 3 testing for one type of cancer (colorectal).  They have recently begun or will soon begin (within the next 3 months) two separate phase 3 tests for 2 types of breast cancer. They are in phase 2 testing for an additional type of breast cancer, and they recently began or will soon begin phase 2 testing for bladder cancer and Non-SCLC lung cancer.  Several other studies, for more types of cancer are planned for 2021.  Though some of these studies (at least the one for colorectal cancer) will likely complete in 2021, drug approval and thus revenue from these studies may not begin until 2022, but all of these studies may be completed and approved within 3 years, possibly less.</p>\n\n<p>In aggregate these trials that are underway or soon to be underway are for cancers diagnosed far more frequently than SCLC, with patients of these types of cancers receive chemo at the rate of about 470k per year, while SCLC patients receive chemo at a rate of about 22k per year.  However, its not clear that all patients receiving treatment for these cancers would qualify for treatment via triciclib and other problems could emerge so to be safe it would be best to ut this number by about 1/3rd, so 313 thousand patients per year. Thus, the potential revenue stream from these other types of cancer, combined would be about 313.33/22 = 14.24 times as large as the potential revenue stream from SCLC alone. This could (using the same numbers as for SCLC) eventually amount to income of 10.96 billion per year which would in turn equate to a value to G1 of between 21.92 and 32.88 billion.  </p>\n\n<p>Finally, people in other parts of the world also get cancer, and G1 has many patents and several agreements with other companies for these companies to commercialize triciclib in other parts of the world, though G1 themselves still have the rights for most of the world, outside the USA.  It will likely be years before triciclib reaches much of the rest of the world, in fact it will be years before triciclib is accepted for most types of cancer in the USA, assuming this approval even comes.  Still, there is huge potential for this drug outside the USA, as well.</p>\n\n<p>Other G1 Data</p>\n\n<p>Looking at other data beyond G1&#39;s current drugs, G1 had 207.3 million cash on hand at the beginning of 2021 and said that they expected their cash on hand to last them through 2022. Of course, if triciclib sales are well underway for SCLC by the end of 2021 then they may never need to raise additional cash.  G1 has also raised some licensing revenue in 2021 and this would further reduce chances they need to raise additional cash, down the road. Because the entire 207.3 million will likely be used to fund future drug testing, no credit will be given for it in this analysis of the value of G1, but this does mean there may be no concern about G1 having to raise more money and dilute there stock in the future.</p>\n\n<p>One other interesting item of note regarding G1.  Some of the earlier founders of the company have moved on to pursue other goals and the whole process of getting their first drug approved has taken years (G1 was founded in 2008, and went public in 2017). Thus G1 may be open to a takeover from a larger drug company, though G1 must realize the vast potential of triciclib. So, there is a chance that G1 could be taken over by a larger drug company, though G1 shareholders might actually be better served if that never happened, possibly making far more money by simply holding on and waiting for the revenue from triciclib to start arriving.</p>\n\n<p>Valuation Summary</p>\n\n<p>So, in summary, G1 has an estimated value of $169 million to $272 million from lerociclib and rintodestrant.  They have an estimate value of 1.54 billion to 2.31 billion from the approved use of their primary drug, triciclib, though sales of this drug just started so it make take a year, or so, for this revenue to show up.  </p>\n\n<p>However G1 has future potential future value of between 21.92 and 32.88 billion from the additional currently underway tests for triciclib, though they probably won&#39;t receive any additional revenue from these other types of cancer for a year, possibly more, and won&#39;t realize this entire revenue stream for 3 years, possibly more.  They have even more potential revenue from still more testing of their drug with other types of cancer and from commercialization of their drug overseas.</p>\n\n<p>G1 has a current share price of $20.43 and a current market cap of $857 million.  Assuming a 1 year value of 1.7 billion to 2.58 billion (the estimated current value for lerociclib, rintodestrant plus revenue from the SCLC approval for triciclib at a multiplier of 2 to 3), this computes to a current stock value of about $40.50 to 61.50, within about a year (as the revenue for use of triciclib with SCLC starts coming in).  So, about a 98% to 201% return in 1 year. </p>\n\n<p>However, if all current triciclib tests go well and everything moves along without problem, then G1 may be able to grow triciclib&#39;s revenue such that their stock value is from 21.92 and 32.88 billion in 5 to 7 years (assuming about 3-4 years to complete all testing and an additional 2-3 years for revenue to reach its full potential).  Additional revenue from overseas sales is possible but that would just be icing on the cake and its difficult to make an educated guess at what that revenue might be within 5 to 7 years. This gives G1&#39;s stock an estimated 5 to 7 year value of about 25.6 to 38.4 times its current value (857 market cap divided by estimated future stock value).  </p>\n\n<p>This last number may actually be conservative, but there are also quite a few things that can go wrong in 5 to 7 years.  Also, there is a decent chance the company will be taken over which would mean an excellent short term return, but nowhere close to a 25.6 to 38.4 bagger.</p>\n\n<p>Possible Near and Distant Catalyst to G1&#39;s stock price going up.</p>\n\n<p>At any time they could be taken over by a larger company that sees potential in their Triciclib drug (and other drugs to a lesser extent).  Longer term (1 year) they should see revenue growth from their one approval for Triciclib. Down the road (probably 5 to 7 years) they may get approval for Triciclib for many other types of Cancer and could see massive revenue from this which could cause their stock to go up many times over its current price.</p>\n\n<p>There are risks to this investment as with any other and there will be up&#39;s and down&#39;s and its not clear if any price movement will occur for as much as 9 months, or more, but I personally think this stock will eventually rise to many times its current valuation, if everything goes well.  You do need a 5-7 year time horizon (possibly more) for this one, and even then its a risk.</p>\n\n<p>Disclosure: I have taken a long position in GTHX.  I could be some idiot who knows nothing about anything so do your own DD.</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/stocks/comments/nsg2cm/gthx_a_dd_note_this_dd_is_about_3_months_old_no/",
  "subreddit": "stocks",
  "id": "nsg2cm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404886631
}