{
  "author": "LWOS101",
  "original_created_utc": 1628183176,
  "title": "90% of advice given out here is advice you should not take.",
  "created_utc": 1628202643,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Take advice on this subreddit with a massive grain of salt. All the time I’m seeing bad advice given out. You have no idea who is behind a profile, you could literally be receiving advice from a 15 year old. Also just because other people agree with what someone is saying does not mean they are right, if someone acts confident people will believe them. I have seen someone saying it’s best to store your seed phrase on your computer or online which is literally the worst thing to do, yet people were upvoting and praising this. Also to the new people, do whatever you feel comfortable doing do not delve into the unknown just because someone scared you into thinking you have to own a hardware wallet or else you’ll lose everything. It’s a learning experience, it’s best to start slow. Stay safe and smart out there guys.</p>\n</div><!-- SC_ON -->",
  "score": 241,
  "permalink": "/r/CryptoCurrency/comments/oymu2q/90_of_advice_given_out_here_is_advice_you_should/",
  "subreddit": "CryptoCurrency",
  "id": "oymu2q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Take advice on this subreddit with a massive grain of salt. All the time I’m\nseeing bad advice given out. You have no idea who is behind a profile, you could\nliterally be receiving advice from a 15 year old. Also just because other people\nagree with what someone is saying does not mean they are…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブレディットでのアドバイスは、大目に見てください。いつも、私は\n悪いアドバイスを目にします。プロフィールの背後に誰がいるのかわからないので、文字通り\n文字通り15歳の若者からアドバイスを受けているかもしれません。また、他の人が\n誰かが言っていることに他の人が同意しているからといって、その人が...",
      "title": "ここに書かれているアドバイスの90％は、あなたが取るべきではないアドバイスです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在这个分论坛上的建议，要用大量的盐来衡量。一直以来，我都在\n看到一些不好的建议。你根本不知道谁是个人资料背后的人，你可以\n你可能从一个15岁的孩子那里得到建议。此外，仅仅因为其他人\n同意某人的说法并不意味着他们是......",
      "title": "这里给出的90%的建议都是你不应该接受的建议。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在這個分論壇上的建議，要用大量的鹽來衡量。一直以來，我都在\n看到一些不好的建議。你根本不知道誰是個人資料背後的人，你可以\n你可能從一個15歲的孩子那裏得到建議。此外，僅僅因爲其他人\n同意某人的說法並不意味着他們是......",
      "title": "這裏給出的90%的建議都是你不應該接受的建議。"
    }
  ]
}