{
  "author": "oddity_satellite",
  "the_new_excerpt": "Lately I've discovered that people think that sleeping with someone already in a\nrelationship and being aware of that fact is OK because you don't have any\nobligations and therefore you did nothing wrong\n\nI personally think it's wrong, all parties except the partner getting cheated in\nare doing…",
  "original_created_utc": 1623921411,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近わかったのは、すでに付き合っている人と、そのことを意識して寝るのは、何もしていないからOKだと思われていること。\nその事実を知っていても、何の義務もなく、何も悪いことをしていないので\n義務がないから、何も悪くない」と考えている人がいることを発見しました。\n\n私は個人的には間違っていると思います、浮気された相手以外の全ての当事者が\nしているのですから。",
      "title": "すでに他の人と交際していて、その事実を認識している人とセックスした場合、あなたは間違っていないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近我发现，人们认为与已经有关系的人上床并知道这一事实是可以的，因为你没有任何关系。\n关系并知道这一事实是可以的，因为你没有任何义务。\n义务，因此你没有做错什么\n\n我个人认为这是不对的，除了被骗的一方之外，其他各方都在做。\n是在做...",
      "title": "如果你与已经与别人有承诺关系的人发生性关系，而且你知道这一事实，你就没有错了吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近我發現，人們認爲與已經有關係的人上牀並知道這一事實是可以的，因爲你沒有任何關係。\n關係並知道這一事實是可以的，因爲你沒有任何義務。\n義務，因此你沒有做錯什麼\n\n我個人認爲這是不對的，除了被騙的一方之外，其他各方都在做。\n是在做...",
      "title": "如果你與已經與別人有承諾關係的人發生性關係，而且你知道這一事實，你就沒有錯了嗎？"
    }
  ],
  "title": "If you have sex with someone already in a committed relationship to someone else and you are aware of that fact, are you not in the wrong?",
  "created_utc": 1623939160,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Lately I&#39;ve discovered that people think that sleeping with someone already in a relationship and being aware of that fact is OK because you don&#39;t have any obligations and therefore you did nothing wrong</p>\n\n<p>I personally think it&#39;s wrong, all parties except the partner getting cheated in are doing something immoral. It&#39;s a different issue with open relationships, I&#39;m not even including them. </p>\n\n<p>But idk,  maybe I&#39;m just old fashioned.</p>\n</div><!-- SC_ON -->",
  "score": 110,
  "permalink": "/r/NoStupidQuestions/comments/o1sx6a/if_you_have_sex_with_someone_already_in_a/",
  "subreddit": "NoStupidQuestions",
  "id": "o1sx6a",
  "is_self": true,
  "media": null,
  "is_video": false
}