{
  "author": "akwardgorilla",
  "original_created_utc": 1633201998,
  "title": "When cuddling, how do I prevent getting a boner. Is it bad?",
  "created_utc": 1633224116,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I [17m] have recently got together with my gf, and we are both taking it slow since non of us have been in a relationship before. We decided to have a movie night and cuddle together on Friday. The thing is, to me, she is the most beautiful person I&#39;ve ever seen (including people I&#39;ve seen from the internet), so I can get a boner from just holding hands, or hugging her. I pretty sure that she haven&#39;t noticed. So I&#39;m positive that I will get a boner when cuddling, and for me that seems super awkward. Is it bad? If so, how can I prevent it?? I&#39;m nervous.</p>\n</div><!-- SC_ON -->",
  "score": 174,
  "permalink": "/r/TooAfraidToAsk/comments/q01f5u/when_cuddling_how_do_i_prevent_getting_a_boner_is/",
  "subreddit": "TooAfraidToAsk",
  "id": "q01f5u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I [17m] have recently got together with my gf, and we are both taking it slow\nsince non of us have been in a relationship before. We decided to have a movie\nnight and cuddle together on Friday. The thing is, to me, she is the most\nbeautiful person I've ever seen (including people I've seen from the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私[17m]は最近彼女と一緒になったのですが、二人ともこれまでに付き合ったことがないので、ゆっくりと進めています。\n二人ともこれまでに付き合ったことがないので、ゆっくりとしたペースで進んでいます。私たちは映画を見て、一緒に寝ることにしました。\n金曜日に映画を見て、一緒に寝ることにしました。私にとって、彼女は今まで見た中で最も美しい人です。\n僕が今まで見た中で一番美しい人です。",
      "title": "抱き合っているときに、勃起しないようにするにはどうしたらいいですか？悪いことですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我[17岁]最近和我的女朋友在一起，我们都在慢慢适应。\n因为我们之前都没有谈过恋爱。我们决定在星期五看电影\n我们决定在星期五一起看电影并拥抱在一起。问题是，对我来说，她是我见过的最\n她是我见过的最漂亮的人（包括我在《中国日报》上见过的人）。",
      "title": "拥抱的时候，我如何防止勃起。这样做不好吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我[17歲]最近和我的女朋友在一起，我們都在慢慢適應。\n因爲我們之前都沒有談過戀愛。我們決定在星期五看電影\n我們決定在星期五一起看電影並擁抱在一起。問題是，對我來說，她是我見過的最\n她是我見過的最漂亮的人（包括我在《中國日報》上見過的人）。",
      "title": "擁抱的時候，我如何防止勃起。這樣做不好嗎？"
    }
  ]
}