{
  "author": "IamNoblesHairline",
  "original_created_utc": 1632268077,
  "title": "99% of this sub needs to stop giving investment advice",
  "created_utc": 1632285054,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The amount of awful investment advice I see on this sub is making me question how much the community knows about finance, economics and how market works.</p>\n\n<p>No, there isn&#39;t just ONE way to profit off a dip. DCA isn&#39;t &quot;the only way&quot;. Neither is selling now and jumping back in when it drops another 30%. Nor is swing trading while it dips further and further. Or even HODLing.</p>\n\n<p>They all work. If you haven&#39;t invested more than you can lose, and you aren&#39;t an emotional investor, there are TONS of ways to profit from this dip. There are also tons of ways to hedge against a further dip.</p>\n\n<p>The more you keep telling people &quot;don&#39;t do x, do y&quot;, the stupider you look. But you keep telling people &quot;HODL&quot; and &quot;DCA&quot; because it&#39;s the only things you&#39;ve heard parroted to you.</p>\n\n<p>Stop giving investment advice and telling people there&#39;s only one way to go. Every tactic works if you aren&#39;t an idiot. The markets can still dip another 50% overnight. Fuck, crypto might not even exist in 5 years. There is no &quot;right way&quot;. There is only one wrong way, and that&#39;s selling or holding without a plan.</p>\n\n<p>Also, take the emotion out of your trades. All money in crypto should already be considered gone. If you aren&#39;t practising risk management and getting emotional, you&#39;ve already lost.</p>\n\n<p>Edit: <a href=\"/u/Wess-L\">u/Wess-L</a> also brings up a point I missed. Don&#39;t buy now just because retards spam &quot;BUY THE DIP&quot;. You could wake up tomorrow with an extra 40% dip and you&#39;ll just be sick with regret. Wait out for the V shape recovery and don&#39;t get greedy.</p>\n</div><!-- SC_ON -->",
  "score": 202,
  "permalink": "/r/CryptoCurrency/comments/psv8cb/99_of_this_sub_needs_to_stop_giving_investment/",
  "subreddit": "CryptoCurrency",
  "id": "psv8cb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The amount of awful investment advice I see on this sub is making me question\nhow much the community knows about finance, economics and how market works.\n\nNo, there isn't just ONE way to profit off a dip. DCA isn't \"the only way\".\nNeither is selling now and jumping back in when it drops another 30%.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブサイトで見かけるひどい投資アドバイスの量には、コミュニティが金融や経済、市場の仕組みについてどれだけ知っているのか疑問を感じます。\nこのコミュニティが金融、経済、市場の仕組みについてどれだけ知っているのか疑問に思います。\n\nディップから利益を得る方法は一つだけではありません。DCAは「唯一の方法」ではありません。\n今売って、あと30％下がったらまた入るというのもダメです....",
      "title": "このサブの99％は、投資アドバイスをするのをやめた方がいい。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在这个子网站上看到的大量糟糕的投资建议让我怀疑\n社区对金融、经济和市场运作的了解有多少。\n\n不，并不是只有一种方法可以从下跌中获利。DCA并不是 \"唯一的方法\"。\n现在卖出，等它再跌30%时再跳回来，也不是唯一的办法....。",
      "title": "这个子99%的人需要停止提供投资建议"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在這個子網站上看到的大量糟糕的投資建議讓我懷疑\n社區對金融、經濟和市場運作的瞭解有多少。\n\n不，並不是只有一種方法可以從下跌中獲利。DCA並不是 \"唯一的方法\"。\n現在賣出，等它再跌30%時再跳回來，也不是唯一的辦法....。",
      "title": "這個子99%的人需要停止提供投資建議"
    }
  ]
}