{
  "author": "CVV1",
  "original_created_utc": 1642862457,
  "title": "I will never trust any of you cowards ever again!",
  "created_utc": 1642876808,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I trusted all of you. You said you would HODL. &lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Instead you SODL.  &lt;/p&gt;\n\n&lt;p&gt;Your bloodlines will be forgotten in history. The gene pool will weed you out as inadequate. The future generations, while they last, will be poor and dumb.   &lt;/p&gt;\n\n&lt;p&gt;Is that what you want for your children and their children? Poor and dumb? Too bad, that&amp;#39;s what they&amp;#39;re going to be. All because you sold during the bear market in a moment of weakness.  &lt;/p&gt;\n\n&lt;p&gt;We were brothers and sisters in arms. A valiant group of individuals hellbent on changing the world. It turns out there are only a few of us. with true strength, both mentally and physically. We&amp;#39;ve been stabbed in the back by short sighted individuals who are scared easily into selling at a loss.  &lt;/p&gt;\n\n&lt;p&gt;Take this as a call to arms. A wake-up call. I am insisting that you all HODL. We will defeat the bears and feast on their flesh and blood on a glorious round table with the finest mutton, mead, and life changing profits. Our future generations will be smart, rich, and attractive.  &lt;/p&gt;\n\n&lt;p&gt;We will become stronger than ever if only you have the courage.  &lt;/p&gt;\n\n&lt;p&gt;HODL.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 448,
  "permalink": "/r/CryptoCurrency/comments/sa3wfm/i_will_never_trust_any_of_you_cowards_ever_again/",
  "subreddit": "CryptoCurrency",
  "id": "sa3wfm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I trusted all of you. You said you would HODL.\n\n\n\nInstead you SODL.\n\nYour bloodlines will be forgotten in history. The gene pool will weed you out as\ninadequate. The future generations, while they last, will be poor and dumb.\n\nIs that what you want for your children and their children? Poor and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はあなた方を信じていた。HODLすると言ったのに\n\n\n\nその代わり SODL\n\nお前らの血統は歴史から忘れ去られるだろう 遺伝子プールはあなたを除外する\n不十分である。未来の世代は、存続している間は、貧しく、間抜けになる。\n\nそれが、あなたの子供やその子供たちに望むことでしょうか？貧しく...",
      "title": "お前らみたいな卑怯者は二度と信用しない！"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我信任你们所有人。你说过你会HODL。\n\n\n\n相反，你是在做梦。\n\n你们的血统将被遗忘在历史中。基因库会把你们淘汰掉，因为\n不够。未来的几代人，只要他们还在，就会是贫穷和愚蠢的。\n\n这就是你想让你的孩子和他们的孩子得到的吗？贫穷和...",
      "title": "我再也不会相信你们这些懦夫了!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我信任你們所有人。你說過你會HODL。\n\n\n\n相反，你是在做夢。\n\n你們的血統將被遺忘在歷史中。基因庫會把你們淘汰掉，因爲\n不夠。未來的幾代人，只要他們還在，就會是貧窮和愚蠢的。\n\n這就是你想讓你的孩子和他們的孩子得到的嗎？貧窮和...",
      "title": "我再也不會相信你們這些懦夫了!"
    }
  ]
}