{
  "author": "UselessAsExpected",
  "original_created_utc": 1657285468,
  "title": "I want to start exercising and try to lose some weight. Which one is better for me, 10 minutes of walking on a treadmill, or an hour of swimming?",
  "created_utc": 1657291651,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m 17M, and have gained a bit of weight in the last couple of months, and I would like to lose that. I do NOT want to be fat, in any circumstance. My brother is 7 years smaller than me, but has the same weight as me, and he can&amp;#39;t run properly without falling. It scares me enough to motivate me to go to the gym.&lt;/p&gt;\n\n&lt;p&gt;Also another question: What would be the best exercise for me, as the gym next to me doesn&amp;#39;t have a lot of equipment. It has a treadmill, 2 cycling things( one which moves your hand as well, and one that just moves your legs), the thing which you pull down at different weights as per your choice, and something ehich you push with your legs(same as the one with your hands)&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m extremely sorry if I couldn&amp;#39;t explain things well, I&amp;#39;m not too learned about gym equipment and stuff, and english isn&amp;#39;t my first language. Also, sorry if this question doesn&amp;#39;t fit this sub, I couldn&amp;#39;t find any other. Good evening!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 108,
  "permalink": "/r/TooAfraidToAsk/comments/vuabqx/i_want_to_start_exercising_and_try_to_lose_some/",
  "subreddit": "TooAfraidToAsk",
  "id": "vuabqx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm 17M, and have gained a bit of weight in the last couple of months, and I\nwould like to lose that. I do NOT want to be fat, in any circumstance. My\nbrother is 7 years smaller than me, but has the same weight as me, and he can't\nrun properly without falling. It scares me enough to motivate me to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は17Mで、ここ数ヶ月で少し体重が増えましたし\nを失いたいと思っています。私はどんな状況でも、太りたくないのです。私の\n弟は私より7歳小さいのですが、体重は私と同じで、転ばないとまともに走れないんです。\n転ばずにまともに走れない。それが怖くて、やる気が出ないんです...。",
      "title": "運動を始めて、少しでも体重を落とせるようにしたい。ルームランナーで10分歩くのと、水泳を1時間するのと、どちらがいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是17M，在过去几个月里体重增加了一些，我\n我想减掉它。我不想变胖，在任何情况下都不想变胖。我的\n我哥哥比我小7岁，但体重和我一样，他不能\n他不能正常跑步而不摔倒。这让我感到害怕，足以促使我...",
      "title": "我想开始锻炼身体，并尝试减轻一些体重。在跑步机上走10分钟，还是游泳一小时，哪个更适合我？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是17M，在過去幾個月裏體重增加了一些，我\n我想減掉它。我不想變胖，在任何情況下都不想變胖。我的\n我哥哥比我小7歲，但體重和我一樣，他不能\n他不能正常跑步而不摔倒。這讓我感到害怕，足以促使我...",
      "title": "我想開始鍛鍊身體，並嘗試減輕一些體重。在跑步機上走10分鐘，還是游泳一小時，哪個更適合我？"
    }
  ]
}