{
  "author": "LucyLovesALot",
  "original_created_utc": 1653642982,
  "title": "Is it wrong to be upset my fiance wants a open relationship?",
  "created_utc": 1653675886,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The title says it all my fiance said she feels like she&amp;#39;s missing out on life and wants to be able to see other people even with us starting slow so she had time before we got official to do all that.. She didn&amp;#39;t really like me saying no and kept asking to at least flirt with and lead guys on even after me saying no. This has really sent me into a mental down spiral because now I have the constant feeling I&amp;#39;m not enough and she is just stuck being unhappy with me.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 2847,
  "permalink": "/r/TooAfraidToAsk/comments/uyu9r5/is_it_wrong_to_be_upset_my_fiance_wants_a_open/",
  "subreddit": "TooAfraidToAsk",
  "id": "uyu9r5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The title says it all my fiance said she feels like she's missing out on life\nand wants to be able to see other people even with us starting slow so she had\ntime before we got official to do all that.. She didn't really like me saying no\nand kept asking to at least flirt with and lead guys on even…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルの通りなのですが、婚約者が「人生を損しているような気がする」と言い出しました。\nと言っていました。\nをする時間があったんだ。彼女は私がノーと言うのがあまり好きではなく\n私が断るのが嫌で、せめてイチャイチャして男を誘いたいと言い続けていた...。",
      "title": "フィアンセがオープンな関係を望んでいることに腹を立てるのは間違っているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "标题说明了一切，我的未婚夫说她觉得自己错过了人生。\n并希望能与其他人见面，即使我们开始得很慢，但她有\n在我们正式结婚之前有时间做这些事情。她不太喜欢我说不\n并一直要求至少与男人调情，甚至引导男人......",
      "title": "对我的未婚夫想建立开放式关系感到不安是错误的吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "標題說明了一切，我的未婚夫說她覺得自己錯過了人生。\n並希望能與其他人見面，即使我們開始得很慢，但她有\n在我們正式結婚之前有時間做這些事情。她不太喜歡我說不\n並一直要求至少與男人調情，甚至引導男人......",
      "title": "對我的未婚夫想建立開放式關係感到不安是錯誤的嗎？"
    }
  ]
}