{
  "author": "oilers169",
  "the_new_excerpt": "Disclaimer: this is only advice for long term investors. Most of the best stocks\nI’ve bought were at all time highs or close to. In bull market it feels like a\ngreat buy if pull back comes like last few months you question why you bought\ntoo high or why you even bought it. If you bought something…",
  "original_created_utc": 1616917963,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "免责声明：这只是对长线投资者的建议。大多数最好的股票\n我买过的都是在历史高点或接近高点。在牛市中，感觉就像一个\n伟大的购买，如果回调像过去几个月，你质疑为什么你买了\n太高了，或者你为什么要买它。如果你买的东西...",
      "title": "不抓落水刀，不在历史高点买入，不在估值过高买入，等待跌停。是一种错误的策略，应该被忽略。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "免責聲明：這只是對長線投資者的建議。大多數最好的股票\n我買過的都是在歷史高點或接近高點。在牛市中，感覺就像一個\n偉大的購買，如果回調像過去幾個月，你質疑爲什麼你買了\n太高了，或者你爲什麼要買它。如果你買的東西...",
      "title": "不抓落水刀，不在歷史高點買入，不在估值過高買入，等待跌停。是一種錯誤的策略，應該被忽略。"
    }
  ],
  "title": "Don’t catch falling knife, don’t buy at all time highs, don’t buy over valued, wait for dip. Is a false strategy and should be ignored.",
  "created_utc": 1616931499,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Disclaimer: this is only advice for long term investors.\nMost of the best stocks I’ve bought were at all time highs or close to. In bull market it feels like a great buy if pull back comes like last few months you question why you bought too high or why you even bought it.\nIf you bought something planning to hold for years just get in if you like the price. Chalk it up to bad timing because buying dip at bottom is rare.\nBuying stocks when market is red for weeks and down 30-40% isn’t easy. Buying on way up sounds easy but who knows if it’s just a good week.</p>\n\n<p>Point is, covid crash taught us you can’t time it, buying at those prices seems no brainer today. But also seeing your gains gone and dumping more  money into market a month into pandemic seems like suicide then.</p>\n\n<p>If you like a company long, get in. If you were correct on the  company the price 5 years from now won’t matter.</p>\n</div><!-- SC_ON -->",
  "score": 257,
  "permalink": "/r/stocks/comments/mex0xd/dont_catch_falling_knife_dont_buy_at_all_time/",
  "subreddit": "stocks",
  "id": "mex0xd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357141543
}