{
  "author": "relaxxed_",
  "original_created_utc": 1634213022,
  "title": "Man throws away hard drive containing 7500 BTC. Today his wallet would be worth more than $432.000.000.",
  "created_utc": 1634221917,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In 2013, a man named James Howells threw away his hard drive containing 7500 bitcoins which he mined from back in the days. Those Bitcoins are estimated to be worth approximately $433.837.500,00 as from today.</p>\n\n<p>James started as early as 2009 and was one of the first persons to mine BTC but eventually stopped because his (ex)girlfriend started complaining about the noise his laptop would make during the process. He sold his laptop on Ebay and stored his hard drive in his desk.</p>\n\n<p>After clearing out his house in 2013 he mistakenly threw away his hard drive which he later found out was the one containing the private keys to his 7500 Bitcoins. </p>\n\n<p>Til this day he firmly believes that he could retrieve the lost hard drive but needs a permission from his local council to search the garbage dump in an attempt to recover his lost keys. Unfortunately James Howells gets a repeated “no” for his request to search out the dump after all these years. His local council states that access is being denied due to environmental concerns without having the guarantee that the lost hard drive will be recovered.</p>\n\n<p>Satoshi Nakamoto quoted the following about lost Bitcoins.</p>\n\n<p>“Lost coins only make everyone else&#39;s coins worth slightly more. Think of it as a donation to everyone.”</p>\n\n<p>Can I get a bold F for our fallen soldier and what would you do in this exact situation?</p>\n</div><!-- SC_ON -->",
  "score": 283,
  "permalink": "/r/CryptoCurrency/comments/q7yafl/man_throws_away_hard_drive_containing_7500_btc/",
  "subreddit": "CryptoCurrency",
  "id": "q7yafl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In 2013, a man named James Howells threw away his hard drive containing 7500\nbitcoins which he mined from back in the days. Those Bitcoins are estimated to\nbe worth approximately $433.837.500,00 as from today.\n\nJames started as early as 2009 and was one of the first persons to mine BTC…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2013年、James Howellsという男性が、7500個の\nビットコインが入ったハードディスクを捨ててしまいました。これらのビットコインは\n今日の時点で約4332億3750万ドルの価値があると推定されています。\n\nJamesは、2009年に早くもビットコインの採掘を開始し、BTCを採掘した最初の人物の一人でした。",
      "title": "7500BTCの入ったハードドライブを捨てた男。今日、彼の財布は432,000,000ドル以上の価値があるだろう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在2013年，一个名叫詹姆斯-豪威尔斯的人扔掉了他的硬盘，里面有7500个\n比特币，这是他当年挖到的。这些比特币估计有\n价值约为433.837.500美元，从今天起。\n\n詹姆斯早在2009年就开始了，他是第一批开采BTC的人之一...",
      "title": "男子扔掉装有7500BTC的硬盘。今天他的钱包的价值将超过432.000.000美元。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在2013年，一個名叫詹姆斯-豪威爾斯的人扔掉了他的硬盤，裏面有7500個\n比特幣，這是他當年挖到的。這些比特幣估計有\n價值約爲433.837.500美元，從今天起。\n\n詹姆斯早在2009年就開始了，他是第一批開採BTC的人之一...",
      "title": "男子扔掉裝有7500BTC的硬盤。今天他的錢包的價值將超過432.000.000美元。"
    }
  ]
}