{
  "author": "yoyololbbb",
  "original_created_utc": 1646522523,
  "title": "Jasmy Token - RUG PULL WARNING",
  "created_utc": 1646566233,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This coin is a slow rug pull where the devs are bleeding out the coin. They have been selling BILLIONS of coins over the past few months, straight onto the market. The coin has gone from $5 to 1.3c as is still continuing to drop 50% every week, this is dangerous as it is listed on a few big exchanges.&lt;/p&gt;\n\n&lt;p&gt;You want proof?&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://etherscan.io/token/0x7420B4b9a0110cdC71fB720908340C03F9Bc03EC#balances\"&gt;https://etherscan.io/token/0x7420B4b9a0110cdC71fB720908340C03F9Bc03EC#balances&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Take a look at the top wallet holders. A single Binance wallet has almost 4billion coins, that is supposedly 80% of the 4.7b total supply? How does that happen? I’ll tell you how, the circulating supply of 4.7b is a total lie! &lt;/p&gt;\n\n&lt;p&gt;If you add up the holding wallets, it easily passes 20billion in circulating supply!&lt;/p&gt;\n\n&lt;p&gt;Want more proof?&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://etherscan.io/token/0x7420B4b9a0110cdC71fB720908340C03F9Bc03EC?a=0x318f51f82d2f0f4ed9c51f53b4666bd1e260b3e1\"&gt;https://etherscan.io/token/0x7420B4b9a0110cdC71fB720908340C03F9Bc03EC?a=0x318f51f82d2f0f4ed9c51f53b4666bd1e260b3e1&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;This is the latest of many wallets that are just constantly dumping in batches of 500m tokens. I have been tracking these wallets and they continue to release coins in batches of 500m into the market, maybe to cover their tracks?&lt;/p&gt;\n\n&lt;p&gt;Every few days 500m coins are dumped in the market. There are about 25 of these 500m wallets, only about 12 have been released, so they will be releasing another 6.5 Billion coins in the coming months or even weeks!&lt;/p&gt;\n\n&lt;p&gt;Want further proof? Have a look at their latest announcements. They are always riddled with spelling and graphical errors. The kicker? They couldn’t even spell their own product name correctly. I am not making this up, look at it yourself! And when you look into the content of their announcements? It’s all meaningless fluff that chucks in a few buzz words here and there, an absolute joke!&lt;/p&gt;\n\n&lt;p&gt;They recently hosted an AMA. Normally an AMA would be someone from the team. Instead it was an absolutely random person with a fake identity hosting it, the person doesn’t even exist! It was cut off early due to “technical difficulties”. I am assuming they realised too many people caught on.&lt;/p&gt;\n\n&lt;p&gt;This is an obvious scam that needs to be delisted! Make this known to protect innocent people from losing their hard earned money! This price has dropped 99.5% and the scam community still tells people to buy into it! &lt;/p&gt;\n\n&lt;p&gt;DO NOT BUY THIS COIN!&lt;/p&gt;\n\n&lt;p&gt;Edit - this has been cross posted on the JASMY reddit and they are downvoting this post! Don’t let them hide the truth.&lt;/p&gt;\n\n&lt;p&gt;Edit - Take directly from the JASMY website and translated.&lt;/p&gt;\n\n&lt;p&gt;“Precautions regarding solicitation regarding cryptographic assets (virtual currency), etc. from the Company or a person who claims to be an affiliated company of the Company&lt;/p&gt;\n\n&lt;p&gt;Recently, we have been inquired that there is a person who sells crypto assets (virtual currency) by deceiving our name.&lt;/p&gt;\n\n&lt;p&gt;Although it has already been reported in the media, the Consumer Affairs Agency, Financial Services Agency, and Police Agency are calling attention to the increase in troubles related to so-called &amp;quot;cryptocurrencies (virtual currency)&amp;quot; that are traded electronically via the Internet.&lt;/p&gt;\n\n&lt;p&gt;We or our affiliated companies do not sell crypto assets (virtual currency). In addition, we do not make inquiries to customers. The seller of crypto assets (virtual currency) that masquerades as our company has nothing to do with us. Please be careful not to pay the purchase price or other money of crypto assets (virtual currency).&lt;/p&gt;\n\n&lt;p&gt;In addition, the seminars and information dissemination by Jasmy&amp;#39;s official supporters and groups / associations that claim to be the community, and the act of selling cryptographic assets (virtual currency) have nothing to do with our company.&lt;/p&gt;\n\n&lt;p&gt;Since February 2020, the only one that we have officially operated or authorized to operate is the developer support IoT service co-creation community &amp;quot;Jasmy League&amp;quot; posted on our website. We monitor the activities of the informal community that has been officially recognized by Jasmy in a timely manner, and take appropriate measures for the detected items in accordance with our information agency.”&lt;/p&gt;\n\n&lt;p&gt;Seems like the Rug pull is in its final stages, now they are claiming that there is no Jasmy token. &lt;/p&gt;\n\n&lt;p&gt;I tried my best to warn everyone.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 314,
  "permalink": "/r/CryptoCurrency/comments/t7lk8z/jasmy_token_rug_pull_warning/",
  "subreddit": "CryptoCurrency",
  "id": "t7lk8z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "This coin is a slow rug pull where the devs are bleeding out the coin. They have\nbeen selling BILLIONS of coins over the past few months, straight onto the\nmarket. The coin has gone from $5 to 1.3c as is still continuing to drop 50%\nevery week, this is dangerous as it is listed on a few big…"
}