{
  "author": "Berisha11",
  "original_created_utc": 1651327052,
  "title": "BTC has held its ground at close to $40,000 for the last couple of months while everything is crashing and going to shit, this is insane and the fact that many of you don't appreciate it shows how new you are.",
  "created_utc": 1651350724,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The stock market is crashing, inflation is at a record 40 year-high, there&amp;#39;s a war at the moment between two of the world&amp;#39;s major countries, supply chain issues, interest rates are going up, etc... AND while all of this is happening, btc has held its ground at close to 40k as possible for the last couple of months. All time highs is at +60k, and we&amp;#39;re staying steady at almost 40k here. If you don&amp;#39;t recognize how insane this is, then you must be new and must have joined during this crazy bull market where everything just went up and up. and you weren&amp;#39;t here before, you weren&amp;#39;t here during the crypto boom in 2017, the crash in 2018 and even before. If you were here from that time, then you understand how lucky we are that btc is still holding its ground and staying this high while everything is going to shit. The fact that it&amp;#39;s not worse means we are extremely lucky and we should appreciate this.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 415,
  "permalink": "/r/CryptoCurrency/comments/ufbmig/btc_has_held_its_ground_at_close_to_40000_for_the/",
  "subreddit": "CryptoCurrency",
  "id": "ufbmig",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The stock market is crashing, inflation is at a record 40 year-high, there's a\nwar at the moment between two of the world's major countries, supply chain\nissues, interest rates are going up, etc... AND while all of this is happening,\nbtc has held its ground at close to 40k as possible for the last…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "株式市場は暴落し、インフレは40年ぶりの高水準、そこに\n世界の主要国2カ国による戦争、サプライチェーンの問題など、さまざまな問題があります。\nサプライチェーンの問題、金利の上昇などなど...。そして、これらすべてが起こっている間\nBTCはこのところ40Kに限りなく近い水準で踏ん張っている...",
      "title": "BTCはここ数ヶ月、すべてがクラッシュしてクソになる中、$40,000近くで踏ん張っています。これは正気の沙汰ではなく、多くの人がそれを評価しないということは、あなたがいかに新しいかということを表しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "股票市场正在崩溃，通货膨胀率创下40年来的新高，有一个\n目前，世界上两个主要国家之间的战争，供应链问题，国际贸易问题，以及其他问题。\n问题，利率正在上升，等等...。而在这一切发生的时候。\n在过去的一段时间里，BTC一直坚守在接近40K的位置上，尽可能的...",
      "title": "在过去的几个月里，BTC一直坚守在接近40000美元的位置，而所有的东西都在崩溃，都在走下坡路，这太疯狂了，你们中的许多人不懂得欣赏，这表明你们是多么的新。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "股票市場正在崩潰，通貨膨脹率創下40年來的新高，有一個\n目前，世界上兩個主要國家之間的戰爭，供應鏈問題，國際貿易問題，以及其他問題。\n問題，利率正在上升，等等...。而在這一切發生的時候。\n在過去的一段時間裏，BTC一直堅守在接近40K的位置上，儘可能的...",
      "title": "在過去的幾個月裏，BTC一直堅守在接近40000美元的位置，而所有的東西都在崩潰，都在走下坡路，這太瘋狂了，你們中的許多人不懂得欣賞，這表明你們是多麼的新。"
    }
  ]
}