{
  "author": "xRegretNothing",
  "the_new_excerpt": "The current volatility is attributed to various industry rotations in portfolios\n(especially in retirement accounts, which get rebalanced near the end of every\nquarter) and heavy-growth sectors. While a lot of people like to avert attention\nto a (obviously inevitable, but untimely) bubble, the…",
  "original_created_utc": 1614820733,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "目前的波动是由于投资组合的各种行业轮换造成的。\n(尤其是退休账户，每到年底都会进行重新平衡。)。\n季度）和重增长行业。虽然很多人都喜欢避重就轻地关注\n到（显然是不可避免的，但不合时宜的）泡沫，...。",
      "title": "关于市场和总体预期的一点见解。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "目前的波動是由於投資組合的各種行業輪換造成的。\n(尤其是退休賬戶，每到年底都會進行重新平衡。)。\n季度）和重增長行業。雖然很多人都喜歡避重就輕地關注\n到（顯然是不可避免的，但不合時宜的）泡沫，...。",
      "title": "關於市場和總體預期的一點見解。"
    }
  ],
  "title": "A little insight on what's going on with the markets & general expectations",
  "created_utc": 1614846522,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The current volatility is attributed to various industry rotations in portfolios (especially in retirement accounts, which get rebalanced near the end of every quarter) and heavy-growth sectors. While a lot of people like to avert attention to a (obviously inevitable, but untimely) bubble, the largest group, FAANG, has not seen a move for the past 1/2 year despite QE and expected economic production. There are definitely companies highly over-valued like EV or renewables (especially solar power) - their stock performance fits the profile of a bubble.</p>\n\n<p>You&#39;ll notice more funds rotating into cyclical industries as the economy drastically recovers, as people are itching to regain some semblance of normal life. The shift to airlines, hotels, tech, and retail leans on the back of vaccine progression.</p>\n\n<p>Powell&#39;s biggest takeaway from his testimony last week was to ensure everyone was vaccinated. Fiscal (Treasury stimulus) and monetary (Fed) support will continue to remain in place, which may - as he noted - temporarily increase inflation, but within a tolerable band for the Fed. Emerging markets equities could be interesting now as the USD continues to weaken. My personal favorites are Taiwan + Latin / South America.</p>\n\n<p>The biggest fear macro-economically (probably more than a year from now) seems to be the lack of investing in energy infrastructure. Energy needs could lead to supply issues, but this seems to be an afterthought for a lot of infrastructure budgets. Thinking on the larger scale, underinvestment in this segment can materialize into an energy crisis, ergo market meltdown (pun intended).</p>\n</div><!-- SC_ON -->",
  "score": 70,
  "permalink": "/r/investing/comments/lx98sc/a_little_insight_on_whats_going_on_with_the/",
  "subreddit": "investing",
  "id": "lx98sc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937740769
}