{
  "author": "rot_flower",
  "the_new_excerpt": "I know not much of you guys care as I’m just a stranger over the internet but I\njust really wanted someone to vent this to as I don’t have many people I can\ntalk about this in irl with! I hope this is the right sub for this\n\nBeing only 20’s years old and working full time since 15 while I have been…",
  "original_created_utc": 1617860504,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はインターネット上のただの見知らぬ人なので、皆さんはあまり気にしないと思いますが、私はただ、誰かに吐き出して欲しかったのです。\nただ、このことを誰かに話したかっただけなんです。\n空気中でこのことを話せる人があまりいないからです ここがそのための適切なサブであることを願っています\n\n私はまだ20代で、15歳からフルタイムで働きながら...",
      "title": "暗号のおかげで、給料日までの生活がようやく落ち着いた"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道你们不怎么关心我，因为我只是一个网络上的陌生人，但我。\n只是真的很想有人发泄这一点，因为我没有很多人，我可以。\n谈谈这个在IRL与! 我希望这是对的子\n\n作为只有20岁的人，从15岁就开始全职工作，而我一直... ...",
      "title": "Crypto终于阻止了我的生活，从薪水到薪水。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道你們不怎麼關心我，因爲我只是一個網絡上的陌生人，但我。\n只是真的很想有人發泄這一點，因爲我沒有很多人，我可以。\n談談這個在IRL與! 我希望這是對的子\n\n作爲只有20歲的人，從15歲就開始全職工作，而我一直... ...",
      "title": "Crypto終於阻止了我的生活，從薪水到薪水。"
    }
  ],
  "title": "Crypto finally stopped me living from paycheck to paycheck",
  "created_utc": 1617881999,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I know not much of you guys care as I’m just a stranger over the internet but I just really wanted someone to vent this to as I don’t have many people I can talk about this in irl with! I hope this is the right sub for this </p>\n\n<p>Being only 20’s years old and working full time since 15 while I have been fully supporting myself since 17, I thought my future looked grim. It took me almost a whole year to have a savings of $1,000 back in 2018. </p>\n\n<p>The concept of owning land or buying a DECENT car that’s more than 2k was unimaginable. I had no idea how I was ever going to not always struggle with money. After a huge move across country with my partner we found slightly better jobs but still lacked any real financial freedom. Covid made things even more difficult and i lost my old job and was unemployed for months. My partner who has been throughly invested in crypto.  Got me and him to start investing seriously just this winter. Using every spare penny and time to do research and invest effectively between working full time. </p>\n\n<p>We managed just in these last few months from winter to spring to be amazed by having 1-2k in savings together to having over 50k saved together! I don’t care what anyone says but this is a life changing amount of money for us in such a short amount of time! </p>\n\n<p>Crypto has finally gave us the ability to have financial breathing room and lifted us out of financial stress. My whole life has changed within months. </p>\n\n<p>Even though we won’t be touching the savings for years! Crypto has actually given me a future that looks brighter besides working myself to death till I’m 60. We even have enough money now to have a savings that can grow and accumulate on its own.</p>\n\n<p>I am forever thankful for crypto currency.</p>\n</div><!-- SC_ON -->",
  "score": 370,
  "permalink": "/r/CryptoCurrency/comments/mml1mb/crypto_finally_stopped_me_living_from_paycheck_to/",
  "subreddit": "CryptoCurrency",
  "id": "mml1mb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566612878
}