{
  "author": "rootpl",
  "original_created_utc": 1644763192,
  "title": "NFTs are ruining crypto's reputation.",
  "created_utc": 1644777344,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;NFTs are ruining crypto&amp;#39;s reputation.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Game developers such as UbiSoft are shoving NFTs down gamer&amp;#39;s throats, and they hate it, gamers ridicule it saying it&amp;#39;s the worst thing that ever happened to video games in recent history,&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Turns out Melania Trump sold her own NFT to herself to boost the price giving NFTs a bad rep,&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Majority of regular people when asked about NFTs say they are stupid, and most of them don&amp;#39;t even understand what NFTs are, don&amp;#39;t believe me? Ask your coworkers on Monday about what they think about NFTs,&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Even big YT channels such as Linus Tech Tips make fun of NTFs almost in every single episode of Tech Linked,&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;General population is fed up with NFTs,&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Even South Park makes fun of NFTs. If you are in a South Park episode you should know you&amp;#39;ve messed up big time,&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;People use NFTs to make a quick buck congesting the networks all the time increasing fees,&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Right now we have thousands of different NFT collections and 99% of them are a worthless pieces of crap.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Crypto space has become a laughing stock due to NFTs. It was cool and awesome when people were just buying cute meme coins for lols, but NFTs pushed it too hard and now people are fed up with them and start to hate them and start to hate the entire crypto space in general. &lt;/p&gt;\n\n&lt;p&gt;The biggest enemy of crypto space is the crypto space.&lt;/p&gt;\n\n&lt;p&gt;Change my mind.&lt;/p&gt;\n\n&lt;p&gt;Edit: To clarify, the tech itself is great, but it should be used to verify medical records, house ownership, verifying votes, verifying IDs etc. but not for selling pictures of rocks. It just makes crypto space looks childish and nobody will take us seriously until a real-world use case can be provided.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 313,
  "permalink": "/r/CryptoCurrency/comments/srk0w9/nfts_are_ruining_cryptos_reputation/",
  "subreddit": "CryptoCurrency",
  "id": "srk0w9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "NFTs are ruining crypto's reputation.\n\n * Game developers such as UbiSoft are shoving NFTs down gamer's throats, and\n   they hate it, gamers ridicule it saying it's the worst thing that ever\n   happened to video games in recent history,\n\n * Turns out Melania Trump sold her own NFT to herself to…"
}