{
  "author": "HomeQueenChannel",
  "original_created_utc": 1625405641,
  "title": "I just charged my apartment rent in BTC",
  "created_utc": 1625417514,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I rent apartment for tourists during summer time. Today a couple came and didn&#39;t have enough cash. I told them they can pay in crypto if they wanted to and in a sec the guy was thrilled. I gave him my adress, he scanned the QR code and BTC was in my wallet in 15 min.\nI won&#39;t exchange it. I&#39;ll just wait for it to be worth much more.</p>\n\n<p>I love crypto</p>\n\n<p>Edit: It is like B&amp;B, people change every couple of days. This guy is on a vacation</p>\n\n<p>And edit: People assume they can pay with credit card but in my apartment it is not an option. Also it is quite expenisive!</p>\n</div><!-- SC_ON -->",
  "score": 236,
  "permalink": "/r/CryptoCurrency/comments/odkjzr/i_just_charged_my_apartment_rent_in_btc/",
  "subreddit": "CryptoCurrency",
  "id": "odkjzr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I rent apartment for tourists during summer time. Today a couple came and didn't\nhave enough cash. I told them they can pay in crypto if they wanted to and in a\nsec the guy was thrilled. I gave him my adress, he scanned the QR code and BTC\nwas in my wallet in 15 min. I won't exchange it. I'll just…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "夏の間、観光客向けにアパートを貸しています。今日、一組のカップルが来ましたが、現金が足りませんでした。\nていましたが、十分な現金を持っていませんでした。私は彼らに、もし彼らが望むなら、暗号で支払うことができると言った。\nすぐにその人は感激していました。私は彼に私の住所を教え、彼はQRコードをスキャンし、BTCが15分で私の財布に\nが15分後には私の財布に入っていました。交換はしません。私はただ...",
      "title": "アパートの家賃をBTCでチャージしたところ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在夏季为游客出租公寓。今天有一对夫妇来了，但没有\n有足够的现金。我告诉他们，如果他们愿意，可以用加密货币支付。\n瞬间，那人就很兴奋。我给了他我的地址，他扫描了二维码，BTC\n15分钟就到了我的钱包里。我不会交换它。我只是...",
      "title": "我刚刚用BTC收取了我的公寓租金"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在夏季爲遊客出租公寓。今天有一對夫婦來了，但沒有\n有足夠的現金。我告訴他們，如果他們願意，可以用加密貨幣支付。\n瞬間，那人就很興奮。我給了他我的地址，他掃描了二維碼，BTC\n15分鐘就到了我的錢包裏。我不會交換它。我只是...",
      "title": "我剛剛用BTC收取了我的公寓租金"
    }
  ]
}