{
  "author": "AskScienceModerator",
  "the_new_excerpt": "\"We\" are part of REN21 [https://www.ren21.net/]'s team, a network made up of\nacademia, NGOs, industry, govt and individuals who are supporting the world to\ntransition to renewable energy.\n\nToday we released the Renewables 2021 Global Status Report so we're hosting an\nAMA to talk about renewables,…",
  "original_created_utc": 1623754820,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "\"私たちは、REN21 [https://www.ren21.net/] のチームの一員であり、学界、NGO、産業界、政府からなるネットワークです。\n学界、NGO、産業界、政府、個人で構成されたネットワークで、世界の再生可能エネルギーへの移行を支援しています。\n再生可能エネルギーへの移行を支援しています。\n\n本日、「Renewables 2021 Global Status Report」を発表したので、AMAを開催します。\nAMAを開催し、再生可能エネルギーについて語り合います。",
      "title": "AskScience AMAシリーズ。再生可能エネルギーとエネルギー転換に関する60年以上の経験があります。何でも聞いてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "\"我们 \"是REN21[https://www.ren21.net/]团队的一部分，这个网络由以下方面组成\n由学术界、非政府组织、工业界、政府和个人组成的网络，他们支持世界的发展。\n向可再生能源过渡。\n\n今天，我们发布了《2021年可再生能源全球状况报告》，因此，我们将举办一次AMA，讨论可再生能源问题。\nAMA来讨论可再生能源，...",
      "title": "AskScience AMA系列。我们在可再生能源和能源转型方面有超过60年的经验。向我们提出任何问题!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "\"我們 \"是REN21[https://www.ren21.net/]團隊的一部分，這個網絡由以下方面組成\n由學術界、非政府組織、工業界、政府和個人組成的網絡，他們支持世界的發展。\n向可再生能源過渡。\n\n今天，我們發佈了《2021年可再生能源全球狀況報告》，因此，我們將舉辦一次AMA，討論可再生能源問題。\nAMA來討論可再生能源，...",
      "title": "AskScience AMA系列。我們在可再生能源和能源轉型方面有超過60年的經驗。向我們提出任何問題!"
    }
  ],
  "title": "AskScience AMA Series: We have 60+ years of experience with renewable energy & the energy transition. Ask us anything!",
  "created_utc": 1623779678,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>&quot;We&quot; are part of <a href=\"https://www.ren21.net/\">REN21</a>&#39;s team, a network made up of academia, NGOs, industry, govt and individuals who are supporting the world to transition to renewable energy.</p>\n\n<p>Today we released the Renewables 2021 Global Status Report so we&#39;re hosting an AMA to talk about renewables, energy, the future and everything in between.</p>\n\n<p>Multiple people from the team are joining including:</p>\n\n<ul>\n<li>Rana Adib (RA): our Executive Director and the one with the most experience in renewable energy - over 20 years.</li>\n<li>Duncan Gibb (DG): produces the annual Renewables Global Status Report and is our go-to person for anything building or heating/cooling related.</li>\n<li>Thomas Andre (TA): Research Analyst turned Director of Operations, Thomas is our expert in anything investment-finance-economy related.</li>\n<li>Hannah Murdock (HM): coordinates the Renewables Global Status Report and is our policy and transport go-to person.</li>\n<li>Lea Ranalder (LR): coordinates the Renewables in Cities Global Status Report so is our expert on anything cities related.</li>\n</ul>\n\n<p>We&#39;ll be going live from 11am ET (15 UT), so ask us anything!</p>\n\n<p>Username: <a href=\"/u/ren21community\">/u/ren21community</a></p>\n\n<hr/>\n\n<p>EDIT: Chetna Hareesh Kumar (CHK) is joining us, and unfortunately Hannah had a last minute thing so she can&#39;t make it. Chetna has been instrumental in working on the report we just released and is very knowledgeable about China&#39;s investment in coal, and she also wrote a great article on what<a href=\"https://www.ren21.net/net-zero-basics/\">net zero actually means</a>.</p>\n</div><!-- SC_ON -->",
  "score": 112,
  "permalink": "/r/askscience/comments/o0bncs/askscience_ama_series_we_have_60_years_of/",
  "subreddit": "askscience",
  "id": "o0bncs",
  "is_self": true,
  "media": null,
  "is_video": false
}