{
  "author": "steavus",
  "the_new_excerpt": "It took a bit more time than expected but i collected information about\nregulations over 43 countrys/nations. It started out fun, but became quite some\nwork. Lets see what countrys are crypto regulated and which are less or not. I\nsearched on the government websites and other legal advice website.…",
  "original_created_utc": 1616069244,
  "localize": [
    {
      "locale": "zh",
      "title": "43个国家及其加密货币法规清单",
      "the_new_excerpt": "虽然花了比预期更多的时间，但我还是收集了一些关于\n43个国家/民族的条例。开始时很有趣，但后来变得相当\n工作。让我们来看看哪些国家的加密监管，哪些国家的加密监管较少或没有。I\n在政府网站等法律咨询网站上搜索到....。"
    },
    {
      "locale": "zh-Hant",
      "title": "43個國家及其加密貨幣法規清單",
      "the_new_excerpt": "雖然花了比預期更多的時間，但我還是收集了一些關於\n43個國家/民族的條例。開始時很有趣，但後來變得相當\n工作。讓我們來看看哪些國家的加密監管，哪些國家的加密監管較少或沒有。I\n在政府網站等法律諮詢網站上搜索到....。"
    }
  ],
  "title": "A list of 43 countrys and their cryptocurrency regulations",
  "created_utc": 1616081495,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It took a bit more time than expected but i collected information about regulations over 43 countrys/nations. It started out fun, but became quite some work. Lets see what countrys are crypto regulated and which are less or not. I searched on the government websites and other legal advice website. Please if you have more information, let me know. </p>\n\n<p><strong>Legal tender:</strong> Legal tender is anything recognized by law as a means to settle a public or private debt or meet a financial obligation, including tax payments, contracts, and legal fines or damages. </p>\n\n<h1>Argentina</h1>\n\n<p>Bitcoins are not legal currency strictly speaking, since they are not issued by the government monetary authority and are not legal tender.  Therefore, they may be considered money but not legal currency, since they are not a mandatory means of cancelling debts or obligations.  Although bitcoins are not specifically regulated, they are increasingly being used in Argentina, a country that has strict control over foreign currencies.  According to some experts a bitcoin may be considered a good or a thing under the Civil Code, and transactions with bitcoins may be governed by the rules of the sale of goods under the Civil Code</p>\n\n<h1>Australia</h1>\n\n<p>In 2017, with the legalization of cryptocurrency, it had recognized such items as property and is subject to their Capital Gains Tax (CGT). This has made Australia one of the industry leaders, with the fintech community gaining a favorable position in commerce. </p>\n\n<p>In 2018, digital currency exchange providers were placed under new regulations from AUSTRAC, the country’s intelligence and anti-money laundering and counter-terrorism financing (AML/CTF), which seeks to prevent the use of these systems for money laundering or to finance crime and terrorism. All DCEs operating within the country must register with AUSTRAC. A registration helps gain the consumer’s confidence and protect the country from adverse manipulation to benefit crime. Registered entities are required to implement a process to identify and verify their customers. They will also have to monitor and report suspicious activities taking place on their platform.</p>\n\n<h1>Belgium</h1>\n\n<p>There are no specific laws or regulations regarding Bitcoin in Belgium.</p>\n\n<p>Virtual currencies are defined by the European Central Bank (ECB) as &#39;a digital representation of value, not issued by a central bank, credit institution or e-money institution, which, in some circumstances, can be used as an alternative to money&#39;. It clarifies that even though they can be used as an alternative to money, virtual currencies are not money or currency from a legal perspective. It provides further clarification by proposing three subcategories of virtual currencies that are classified according to their interaction with legal tender (or similar instruments) and on their ability to be used to purchase tangible goods and services.</p>\n\n<h1>Brazil</h1>\n\n<p>Cryptocurrencies have yet to be regulated in Brazil.  The Brazilian Central Bank has issued statements regarding the risks posed by this type of currency and its lack of guarantee by the monetary authorities, and has advised that companies that trade in virtual currencies are not regulated, supervised, or licensed to operate by the Bank.  Recently, the Brazilian Securities and Exchange Commission issued a statement saying, among other things, that cryptocurrencies could not be classified as financial assets and could not be acquired by investment funds.  A bill of law currently under analysis in the Brazilian Chamber of Deputies seeks to include virtual currencies and air mileage programs under the supervision of the Brazilian Central Bank.</p>\n\n<p>On October 9, 2013, Brazil enacted Law No. 12,865, which created the possibility for the normalization of mobile payment systems and the creation of electronic currencies, including the bitcoin.  The Law provides, among other things, for the payment arrangements and payment institutions that comprise the Brazilian Payment System (Sistema de Pagamentos Brasileiro, SPB).</p>\n\n<p>Law No. 12,865 defines “payment arrangement” as a set of rules and procedures that regulate the rendering of a particular service to the public that is accepted by more than one recipient, through direct access by end users, payers, and recipients.  “Payment institution” is defined as a legal entity that, by adhering to one or more payment arrangements, has as a principal or secondary activity, alternatively or cumulatively, one of the activities listed in article 6(III).  “Electronic currency” is defined as resources stored on a device or electronic system that allow the end user to perform a payment transaction.</p>\n\n<h1>Canada</h1>\n\n<p>Canada allows the use of digital currencies, including cryptocurrencies. However, cryptocurrencies are not considered legal tender in Canada. Canada’s tax laws and rules, including the Income Tax Act, also apply to cryptocurrency transactions. The Canada Revenue Agency has characterized cryptocurrency as a commodity and stated that the use of cryptocurrency to pay for goods or services should be treated as a barter transaction.</p>\n\n<p>Canada allows the use of cryptocurrencies. According to the Government of Canada webpage on digital currencies, “[y]ou can use digital currencies to buy goods and services on the Internet and in stores that accept digital currencies. You may also buy and sell digital currency on open exchanges, called digital currency or cryptocurrency exchanges.” However, cryptocurrencies are not considered legal tender in Canada. According to the Financial Consumer Agency of Canada, “[o]nly the Canadian dollar is considered official currency in Canada.” The Currency Act defines “legal tender” as “bank notes issued by the Bank of Canada under the Bank of Canada Act” and “coins issued under the Royal Canadian Mint Act.”</p>\n\n<h1>China</h1>\n\n<p>China does not recognize cryptocurrencies as legal tender and the banking system is not accepting cryptocurrencies or providing relevant services. The government has taken a series of regulatory measures to crack down on activities related to cryptocurrencies for purposes of investor protection and financial risk prevention. Those measures include announcing that initial coin offerings are illegal, restricting the primary business of cryptocurrency trading platforms, and discouraging Bitcoin mining. In the meantime, China’s central bank is reportedly considering issuing its own digital currency.</p>\n\n<p>China has not passed any legislation regulating cryptocurrencies.  Regulators are not recognizing cryptocurrencies as legal tender or a tool for retail payments, and the Chinese banking system is not accepting any existing cryptocurrencies or providing relevant services. In a 2013 circular, the government defined Bitcoin as a virtual commodity, but while warning citizens about the risks of virtual commodities allowed them to freely participate in the online trading of such commodities.</p>\n\n<p>In recent years, especially since September 2017, however, the government has taken a series of regulatory measures to crack down on activities related to cryptocurrencies, mainly due to the concern over financial risks associated with such currencies. </p>\n\n<h1>Croatia</h1>\n\n<p>The National Bank of Croatia adheres to the following idea: the assets forming cryptocurrency cannot be considered financial, but the circulation of electronic money in the country cannot be considered illegal, cryptocurrency exchanges are not prohibited.</p>\n\n<p>The absolute majority of Croatian financial experts consider it necessary to introduce regulatory procedures at the legislative level and even licensing of ICO activities.</p>\n\n<p>Currently, a license for cryptocurrency in Croatia is not issued, and there are no legislative acts regulating the operation of various crypto-projects. Considering the views of the National Bank of Croatia and the Central Administration of Tax Administration that bitcoin is not a financial equivalent, but merely an instrument, the government is slow in coordinating measures.It is worth noting that parliamentarians positively assess the course of cloud assets in the local business environment, but licensing a cryptocurrency exchange in Croatia is in the future.</p>\n\n<h1>Denmark</h1>\n\n<p>Denmark has not adopted legislation that specifically deals with cryptoassets. A crypoasset transaction may fall under Danish regulatory authority, depending on whether the cryptoasset is considered a form of payment (currency), capital asset (investment), or financial service.</p>\n\n<p>The Danish Financial Supervisory Authority has stated that the use of cryptocurrencies as payment is generally not regulated by the Authority, but the applicability of Danish securities law will depend on the specifics of the initial coin offering (ICO). ICOs that are similar to initial public offerings (IPOs) are subject to securities law, and the issuing corporation must publish a prospectus in connection with the ICO.</p>\n\n<p>Denmark generally treats cryptocurrencies as capital property for tax purposes, taxing gains and allowing for deductions on losses. However, losses may not be deducted as a business expense when the value of cryptocurrencies that have been received as payment for goods or services has decreased.</p>\n\n<h1>Estonia</h1>\n\n<p>In Estonia, the use of bitcoins is not regulated or otherwise controlled by the government.  Because of the Bitcoin service’s growing popularity and increasing use by the country’s population, however, the Bank of Estonia (the nation’s central bank) monitors financial arrangements that use Bitcoin.According to Google’s search statistics, Estonia is the country with the second largest number of Internet searches for the term “Bitcoin”; Russia has the most such searches.</p>\n\n<p>When Estonia introduced a license specifically for cryptocurrency exchanges in November 2017 it was groundbreaking, and Estonian cryptocurrency licenses, issued by the Estonian Financial Intelligence Unit or FIU for short, continue to be sought after, since the government is extremely supportive of the cryptocurrency industry in general, allowing many companies within the industry to really thrive and for truly innovative thinking.</p>\n\n<h1>European Union</h1>\n\n<p>The European Commission recognises the importance of legal certainty and a clear regulatory regime in areas pertaining to blockchain-based applications.</p>\n\n<p>The EU strongly supports a pan-European framework and hopes to avoid legal and regulatory fragmentation. With the view to increase investments and to ensure consumer and investor protection, the Commission on 24 September adopted a comprehensive package of legislative proposals for the regulation of crypto-assets, updating certain financial market rules for crypto-assets, and creating a legal framework for regulatory sandboxes of financial supervisors in the EU for using blockchains in the trading and post trading of securities.</p>\n\n<p>A digital Euro</p>\n\n<p>The European Central Bank (ECB) and the European Commission services are jointly reviewing at technical level a broad range of policy, legal and technical questions emerging from a possible introduction of a digital euro, taking into account their respective mandates and independence provided for in the Treaties.</p>\n\n<p>More information: Joint statement by the European Commission and the ECB on their cooperation on a digital euro (19 January 2021).</p>\n\n<p>Proposal for a new EU law on crypto-assets</p>\n\n<p>Crypto-assets qualifying as “financial instruments” under the Markets in Financial Instruments Directive (e.g.: tokenised equities or tokenised bonds) have already in the past been subject to EU securities markets legislation. However, these rules predated the emergence of crypto-assets and DLT. This could hamper innovation. On 24 September 2020 the Commission therefore proposed a pilot regime for market infrastructures that wish to try to trade and settle transactions in financial instruments in crypto-asset form. The <strong>PILOT</strong> regime allows for exemptions from existing rules and allows regulators and companies to test innovative solutions utilising blockchains.</p>\n\n<p>For other crypto-assets that do not qualify as “financial instruments” such as utility tokens or payment tokens, the Commission on 24 September proposed a specific new framework that would replace all other EU rules and national rules currently governing the issuance, trading and storing of such crypto assets. This <strong>Markets in Crypto-Assets Regulation - MiCA  - will support innovation while protecting consumers and the integrity of crypto-currency exchanges</strong> (no insider trading, front running etc). The proposed regulation covers not only entities issuing crypto-assets but also firms providing services around these crypto-assets such as and firms  operating digital wallets, as well as cryptocurrency exchanges.</p>\n\n<h1>Finland</h1>\n\n<p>The Finish Tax Authority, Vero Skatt, has issued instructions for the taxation of virtual currencies, including the bitcoin.  When transferred to another currency, the rules on taxation of capital gains apply.  When the currency is used as a form of payment for goods and services, it is treated as a trade, and the increase in value that the currency might have gained after it was obtained is taxable.  The sale of bitcoins at a loss in value compared to the original purchase price is not deductible under the Finish Income Taxation Act, because such a loss in value is not specifically described as deductible in the Act.</p>\n\n<h1>France</h1>\n\n<p>Cryptocurrencies remain largely unregulated in France.  So far, only two ordinances containing provisions on blockchain technology have been issued, but their applicability remains very narrow.  However, the government has set up several fact-finding missions and is actively working to establish a regulatory framework. French regulatory authorities are generally wary of cryptocurrencies, due to their high volatility and unregulated nature, but appear enthusiastic about the underlying blockchain technology.  Additionally, French authorities have issued some limited guidance with regard to the tax treatment of cryptocurrencies, instructing that any profits from their sale is taxable, and that their value is to be taken into account when calculating the wealth tax.</p>\n\n<p>Cryptocurrencies remain largely unregulated in France, with two ordinances on blockchain technology being the only legislative action taken so far.  However, the French government is actively studying the cryptocurrency phenomenon and moving towards establishing a regulatory regime.  Statements from various quarters of the French government show that while many are wary of cryptocurrencies, there appears to be a real enthusiasm for the underlying blockchain technology.</p>\n\n<h1>Germany</h1>\n\n<p>On January 1, 2020, Germany joined a small but growing number of countries with a specific regulatory regime for crypto assets. ‘Goldplating’ the European requirements under the Fifth Anti-Money Laundering Directive (AMLD5), the German legislator reformed the national regulatory rules for crypto-related activities: The ‘Act on the Implementation of the Amendment Directive to the Fourth EU Money Laundering Directive’ (<em>Gesetz zur Umsetzung der Änderungsrichtlinie zur Vierten EU-Geldwäscherichtlinie</em>) (i) affects existing licensing requirements under the German Banking Act (<em>Kreditwesengesetz</em> – KWG) by defining a new category of financial instruments and (ii) additionally introduces a new licensing requirement for custody services</p>\n\n<h1>Iceland</h1>\n\n<p>Although Iceland is home to some of the largest Bitcoin mining facilities in the world, the Icelandic government made the following decision on Bitcoin (released in 2013 but it’s seen to be a residual effect of legislation to address the 2008 crisis), “<em>It is prohibited to engage in foreign exchange trading with the electronic currency Bitcoin, according to the Icelandic Foreign Exchange Act. A written response from the Central Bank of Iceland to Morgunblaðið states that the Foreign Exchange Act specifies general restrictions on foreign exchange trading and capital movements between countries.</em></p>\n\n<p>These rules seemed to allow for Icelandic citizens to own bitcoin and allow for the mining of bitcoin in Iceland. What they&#39;re designed to do, however, is to stop the capital flight of funds (in the form of bitcoin) out of the country. This essentially means that bitcoin is not a currency according to Icelandic law.</p>\n\n<h1>India</h1>\n\n<p>There appears to be no explicit legal framework that regulates, restricts, or bans bitcoins in India.  However, India’s central bank recently cautioned the public about the possible risks of cybersecurity attacks and money laundering related to the use of this virtual currency.  At this moment there is no crypto regulation in India. However, buying Bitcoin is absolutely legal in India. There is no law prohibiting Indians from buying/selling cryptocurrencies in India.</p>\n\n<p><strong>But:</strong> India will propose a law banning cryptocurrencies, fining anyone trading in the country or even holding such digital assets, a senior government official told Reuters in a potential blow to millions of investors piling into the red-hot asset class.</p>\n\n<h1>Indonesia</h1>\n\n<p>A spokesman for Bank Indonesia reportedly issued a statement on Bitcoin in December 2013, saying that “[b]itcoin is a potential payment method, but it’s different than ordinary currency. . . . It is not regulated by the central bank so there are risks. . . . At the moment, we’re studying bitcoin and we have no plan to issue a regulation on it.”</p>\n\n<p>Indonesia’s commodity futures trading regulator, Bappebti, recently issued regulations that provide the legal framework for the trading of cryptoassets as commodities that can be subject to futures trading. The regulations contain requirements related to the approval of cryptoassets that can be traded, traders, exchanges, clearing houses, and storage providers. These include technical, structural, and security requirements, as well as requirements for entities to maintain certain levels of paid-up and closing capital. Exchanges are also subject to anti-money laundering obligations.</p>\n\n<p>It appears that, despite these regulatory developments, Bank Indonesia continues to prohibit the use of cryptocurrency as a means of payment in the country. In addition, financial services institutions regulated by the Financial Services Authority appear to be prohibited from engaging in activities related to cryptocurrencies.</p>\n\n<h1>Ireland</h1>\n\n<p>There is no specific cryptocurrency regulation in Ireland, but there is also no specific prohibition in Ireland on any activities related to cryptocurrency.</p>\n\n<p>The investors who want to open a company in Ireland in this industry will be required to register for taxation with the Irish Revenue for capital gains (just like in the case of any other legal entity operating in this country) and with Central Bank of Ireland (CBI) for Anti-Money Laundering purposes.</p>\n\n<p>The CBI (Central Bank of Ireland) is the competent authority in Ireland for the regulation of financial services including electronic money, payment services and securities law.</p>\n\n<h1>Israel</h1>\n\n<p>In accordance with regulations issued in 2016, virtual currency is considered a “financial asset” in Israel, for which the provision of financial services requires a license. As a financial asset, trade in virtual currency is subject to capital gains taxation.</p>\n\n<p>In 2014 the Bank of Israel (Israel’s central bank), together with several regulatory agencies, issued a warning about the dangers associated with the use of virtual currency, including bitcoin. In a statement made by the Bank in January 2018 it clarified that it does not recognize virtual currencies as actual currencies, but rather as a financial asset. Although virtual currencies are not recognized as actual currency by the Bank of Israel, the Israel Tax Authority has proposed that the use of virtual currencies should be considered as a “means of virtual payment” and subject to taxation.</p>\n\n<p>The legitimacy of a bank’s refusal to provide banking services to a company that trades in bitcoin is currently under review by the Israeli Supreme Court. The Court has issued a temporary injunction against the bank’s complete blockage of the company’s activities in the account.</p>\n\n<h1>Italy</h1>\n\n<p>Italy is one of the few countries in the world where cryptocurrencies and blockchain technologies are regulated at the legislative level. In 2017, Legislative Act № 90 was issued, according to which service providers in the cryptocurrency market are classified as ordinary currency exchange operators. In other words, we can say that this document equates cryptocurrency with traditional currency. In addition, this Act directs the Ministry of Finance and Economy to issue a decree that would regulate the mechanism of operations with cryptocurrency, the work on which was completed on February 2, 2018. In it, the Italian government expressed the opinion that cryptocurrencies are the most suitable instrument among others for laundering funds obtained by criminal means and the financing of terrorism, in connection with which legal regulation should make it impossible to use them for criminal purposes. The regulation gives the following definition of cryptocurrency: it is a virtual currency used as a medium of exchange for goods or services. At the same time, cryptocurrency is not issued by the central bank and is in no way correlated with other currencies, therefore, it is not a means of payment.</p>\n\n<h1>Japan</h1>\n\n<p>Since April 2017, cryptocurrency exchange businesses operating in Japan have been regulated by the Payment Services Act.  Cryptocurrency exchange businesses must be registered, keep records, take security measures, and take measures to protect customers, among other things. Cryptocurrency exchanges are also subject to money laundering regulations.</p>\n\n<h1>Malaysia</h1>\n\n<p>In January 2019, the Securities Commission Malaysia (SC) issued an order that sets out the characteristics of “digital currency” and “digital tokens” that are prescribed as being securities for the purposes of Malaysia’s securities law. It subsequently issued amendments to its recognized market guidelines, which now include a framework for operators of digital asset platforms to be approved by the SC as recognized market operators. This includes requirements related to an entity’s structure and governance, risk management processes, client asset protection, transparency, and market integrity.</p>\n\n<p>In March 2019, the SC published a consultation paper on its proposed approach to regulating initial coin offerings (ICOs). This approach would include approval of the ICO by the SC based on various criteria and the registration of a disclosure document that meets certain requirements.</p>\n\n<p>Digital currency exchanges were previously made subject to Malaysia’s anti-money laundering and counter-financing of terrorism system, which is overseen by the central bank. The Inland Revenue Board has also previously indicated that income earned through cryptocurrency trading is subject to the Income Tax Act 1967, although it has not yet issued any specific guidance on this issue.</p>\n\n<h1>Malta</h1>\n\n<p>Malta has taken a very progressive approach to cryptocurrencies, positioning itself as a global leader in crypto regulation.</p>\n\n<p>While cryptocurrencies are not legal tender, they are recognized by the government as “a medium of exchange, a unit of account, or a store of value”. Malta has no specific cryptocurrency tax legislation, nor is VAT currently applicable to transactions exchanging fiat currency for crypto.</p>\n\n<p><strong>Cryptocurrencies:</strong> Not legal tender<strong>Cryptocurrency exchanges:</strong> Legal, regulated under the VFA Act</p>\n\n<p>Cryptocurrency exchanges are legal in Malta and, in 2018, the Maltese government introduced landmark legislation to define a new regulatory framework for cryptocurrencies and address AML/CFT concerns. The legislation comprised of three separate bills which set a global precedent by establishing a regulatory regime applicable to crypto exchanges, ICOs, brokers, wallet providers, advisers, and asset managers.</p>\n\n<p>The three bills are:</p>\n\n<p>· Malta Digital Innovation Authority Act</p>\n\n<p>· Innovative Technological Arrangement and Services Act</p>\n\n<p>· Virtual Financial Asset Act</p>\n\n<p>Netherlands</p>\n\n<p>For retailinvestors there are no regulations for owning cryptocurrency.</p>\n\n<p>As of May 21 (2020), the implementation of EU&#39;s 5th anti-money laundering Directive obliges providers of cryptocurrency exchanges and/or wallets to register themselves in the Netherlands. Such registration depends among others on having adequate procedures and measures of compliance with EU and Dutch sanctions laws in place, effectively making sanctions compliance more important than ever for crypto service providers in the Netherlands.</p>\n\n<h1>New Zealand</h1>\n\n<p>New Zealand currently does not have specific legislation related to cryptocurrencies. Guidance provided by the Financial Markets Authority states that various activities related to cryptocurrencies could be considered financial services, which are subject to the “fair dealing” requirements in the Financial Markets Conduct Act 2013. Other laws may also be applicable if the entity involved is based in New Zealand and services are offered to retail clients. In addition, if the tokens offered to retail investors in New Zealand are considered financial products under the Act (including securities, derivatives, or interests in managed investment schemes), further licensing, governance, and disclosure requirements would apply. Whether a token is a particular type of financial product will depend on its individual characteristics.</p>\n\n<p>Where no financial product or financial service is involved, communications related to offers of cryptocurrencies are subject to the fair dealing requirements in the Fair Trading Act 1986.</p>\n\n<p>Cryptocurrency exchanges appear to be considered “money changers” that are subject to the Anti-Money Laundering and Counter-Terrorism Financing Act 2009.</p>\n\n<p>Cryptocurrency is treated as property for purposes of income tax legislation. Where a person acquires cryptocurrency for the purpose of disposal, the proceeds from selling it are taxable.</p>\n\n<h1>Norway</h1>\n\n<p>Norway requires everyone who offers a marketplace for cryptocurrencies or a wallet to register with the Norwegian Financial Supervisory Authority. It has implemented the European Union’s Fifth Anti-Money Laundering Directive, and in its implementing legislation specifically provides that anti-money laundering requirements also apply in relation to cryptocurrency transactions.</p>\n\n<p>Norway taxes cryptoassets depending on their nature either as capital property income, other income (mined income), or business income (mined income on a larger scale). The sale of cryptocurrencies is not subject to value-added tax.  </p>\n\n<h1>Poland</h1>\n\n<p>At present there are no precise regulations on the taxation of cryptocurrency in Poland. In the future, however, taxes will be paid on profits generated by virtual currencies. The government has tabled a legislative proposal to this effect. Due to the lack of regulations so far, the income of persons trading in crypto currencies could even be taxed at the rate of 32 percent, so many companies trading in virtual currency have relocated their activities to other countries. Since January 2019, revenues from cryptocurrency trading have been allocated according to revenues from cash capital (EStG-PL) or revenues from investment income (KStG-PL). The income from the sale of virtual currency against payment is taxed at 19 percent.</p>\n\n<h1>Portugal</h1>\n\n<p>There are no specific laws in Portugal regarding virtual assets, cryptocurrency exchanges, e-wallets &amp; virtual asset operators. However, that doesn’t necessarily mean that there’s no regulation in the market of virtual asset</p>\n\n<h1>Russia</h1>\n\n<p>On July 31, 2020, the president of the Russian Federation, Vladimir Putin, signed Federal Law No. 259-FZ on Digital Financial Assets and Digital Currencies. This law regulates relations concerning the issuance, recording, and circulation of digital financial assets (DFAs). (Federal Law No. 259-FZ, art.1, §§ 1, 2 &amp; 3.)</p>\n\n<p>Under the new law, DFAs are digital rights that can be viewed as analogues of issued securities but placed through a blockchain. DFAs include monetary claims, the ability to exercise rights to securities (including the rights to demand their transfer), and the right to participate in the capital of non-public stock companies. (Art. 1, § 2.) The law also considers Security (Utility) Tokens to be digital financial assets and requires that they be treated as such.</p>\n\n<p>Among other provisions, the law defined digital currency as a digital code used as a means of payment and as a savings tool (an investment). (Art. 3.) However, residents of the Russian Federation are not allowed to receive digital currencies as payment for goods, work, or services. (Art. 14, § 5.) In addition, the law prohibits distributing any information about possible settlements in digital currencies; offering and accepting digital currency as a payment for transferred goods, rendered work, or services; or using any other method of paying in digital currency. According to the law, digital currency is not legal tender for payments in Russia, and the Russian ruble remains the only official monetary unit. (Art. 14, § 7.)</p>\n\n<p>The law prohibits exchange operations with cryptocurrency on the territory of the Russian Federation, and makes judicial protection of claims related to such operations and/or transactions possible only if the digital currency possessions or transactions were declared in accordance with this law. (Art. 14, § 6.) Most of the provisions of the law will take effect on January 1, 2021.</p>\n\n<h1>Singapore</h1>\n\n<p>In Singapore, cryptocurrency exchanges and trading are legal, and the city-state has taken a friendlier position on the issue than regional neighbors.</p>\n\n<p>Although cryptocurrencies are not considered a legal tender, Singapore’s tax authority treats Bitcoins as ‘goods’ and so applies Goods and Services Tax (Singapore’s version of Value Added Tax).</p>\n\n<p>Slovenia</p>\n\n<p>At present, Slovenia treats cryptocurrencies as virtual currencies, which means that they are neither recognized as financial instruments nor monetary assets under the Slovenian Law on Payment Services and Systems. For the purposes of anti-money laundering regulations, Slovenia has a vague definition of a cryptocurrency, which represents a “digital form of a value, not being issued or backed by a central bank or any other public authority and is not necessarily linked to an officially recognized fiat currency. In the absence of legally recognized status as a currency or monetary asset, cryptocurrencies are accepted by natural or legal persons as a means of exchange, which can be transferred, stored and exchanged electronically.”  </p>\n\n<p>The country’s officials have deemed that it is legal to own or use bitcoin or other cryptocurrencies.</p>\n\n<h1>Spain</h1>\n\n<p>There is no specific regulation for cryptocurrencies in Spain. They are only not treated as legal tender, as this is exclusively reserved for the euro as the national currency.According to Spanish law, virtual currency cannot be considered either as a financial instrument (promissory note, derivative, etc.) or as a currency (domestic or foreign). In some cases, however, they can be treated as securities in the case of a public offer, or as goods or commodities if they are traded individually.</p>\n\n<p>To the extent that they can be regarded as securities, STOs may fall under the requirements of the prospectus file of the Spanish Stock Market Act (LMV), as the definition of financial instruments and tradable securities is very broad (Article 2 LMV). The Spanish Government may add new types of securities on its own initiative without the need to amend the law if agreed under EU law.</p>\n\n<h1>South Korea</h1>\n\n<p>On 5 March 2020, South Korea passed an amendment to the Act on the Reporting and Use of Specific Financial Transaction Information. It will come into effect in March 2021 and extend AML/CTF rules to virtual asset service providers. How can you prepare for the changes? Let’s take a look at some important aspects.</p>\n\n<p>Who is affected</p>\n\n<p>The new law covers the activity of virtual asset service providers (VASP) who are involved in the following business activities:</p>\n\n<p>· the selling or buying of cryptocurrencies</p>\n\n<p>· crypto-to-crypto exchanges</p>\n\n<p>· the transferring of cryptocurrencies</p>\n\n<p>· the storage or management of virtual assets</p>\n\n<p>These activities mainly relate to cryptocurrency exchanges, custodian wallet providers and Initial Coin Offering (ICO) projects.</p>\n\n<h1>Sweden</h1>\n\n<p>There is no cryptocurrency-specific regulation in Sweden. However, the Finansinspektionen, Sweden’s Financial Supervisory Authority, is of the opinion that bitcoins are subject to its authority, as trade in bitcoins (i.e., offering a site where bitcoins can be bought and sold similar to an exchange) is a financial service and thus subject to mandatory reporting requirements. Furthermore, the Riksbank, Swedish Central Bank, has ruled that “bitcoins are not money.” The announcement explained that cryptocurrencies are not seen by Sweden as equivalent to traditional currencies, referencing a new financial report on cryptocurrencies written by the Central Bank of Sweden staff (March 2018).</p>\n\n<h1>Taiwan</h1>\n\n<p>So far no Taiwanese laws or regulations have been promulgated or amended to formally regulate “virtual currencies” or “cryptocurrencies”; therefore, currently, virtual currencies/cryptocurrencies cannot be considered “legal tender”, “currencies” or a generally accepted “medium of exchange” in Taiwan. Further, currently there exists no required licence in Taiwan for (a) operating the services of exchange between virtual currencies or virtual currencies with fi at currencies, or (b) acting as a “money transmitter” and the like in Taiwan.</p>\n\n<h1>Thailand</h1>\n\n<p>Although cryptocurrencies are not a lawful currency, and do not have legal tender status in Thailand, there was a case in 2018 in which a Thai fintech company successfully raised funds from the public by using digital tokens, and Thai laws and regulations had not been enacted to govern such activities at the time. This development with respect to cryptocurrencies and digital tokens could have potentially affected both the general public and financial stability, causing the Royal Enactment on Digital Asset Businesses BE 2561 (REDA), 2018, to be promulgated, which has been effective from 14 May 2018 onward, and aims to regulate the offering of digital assets and businesses undertaking digital asset-related activities in order to be equipped to facilitate and support the technological innovations driving the economy and society, including protecting against any schemes designed for deceiving the general public.</p>\n\n<h1>Turkey</h1>\n\n<p>Currently, the BDDK has provided an indication that Cryptocurrency does not fall within the scope of Law no. 6439 on Payment Securities Settlement Systems, Payment Services, and Electronic Money Institutions. There is currently no legislation that specifically refers to Cryptocurrency and therefore it is not entirely accurate to declare this type of business activity is lawful or unlawful in Turkey. Cryptocurrency is not recognized under Turkish law however they are utilized in Cryptocurrency Activities in practice.</p>\n\n<h1>United Kingdom</h1>\n\n<p>UK cryptocurrencies regulations allow users to buy and sell cryptocurrencies – but due to recent regulatory moves by the UK’s financial regulatory, the FCA, trading of cryptocurrency derivatives are banned.</p>\n\n<p>Cryptocurrency Regulations in the UK Key Takeaways;</p>\n\n<p>· Cryptocurrencies not classed as legal tender</p>\n\n<p>· VASPs apply to FCA for licence (e-money as the exception)</p>\n\n<p>· Taxes based on activities, entities &amp; tokens</p>\n\n<p>· Ban on derivatives offering</p>\n\n<p>· FCA, Treasury &amp; BoE make up Cryptoassets Taskforce</p>\n\n<p>· 8 Cryptoasset Market ‘Actors’</p>\n\n<p>· FCA responsible for AML/CFT of cryptoassets</p>\n\n<p>Regulations on UK VASPs (Virtual Asset Service Providers) have been created so as to not stifle innovation whilst maintaining the integrity of the wider financial system. To operate in the United Kingdom, crypto exchanges need to register with the Financial Conduct Authority – unless they have applied for an e-money licence.</p>\n\n<p>UK-based VASPs must additionally adhere to a number of compliance rules. Those include regulations around KYC (Know-Your-Customer), AML (Anti-Money Laundering) and CFT (Combatting the Financing of Terrorism).</p>\n\n<h1>United States</h1>\n\n<p>The U.S. maintains a generally positive outlook on the use of Bitcoin and other cryptocurrencies, though few formal rules have actually been introduced. Most of the regulatory discussion surrounding blockchain has been at the agency level, including the Department of Treasury, Securities and Exchange Commission (SEC), Federal Trade Commission (FTC), Internal Revenue Service (IRS) and Financial Crimes Enforcement Network (FinCEN) — all of which hold differ in their definitions of &quot;cryptocurrency,&quot; as well as their stances on how regulation should be applied. </p>\n\n<p>While FinCEN does not consider cryptocurrency to be legal tender, it does consider exchanges as money transmitters subject to their jurisdiction. Meanwhile, the IRS has begun considering cryptocurrencies property, and has issued tax guidance accordingly. </p>\n\n<p>In June 2015, New York became the first state in the U.S. to regulate virtual currency companies through state agency rulemaking. As of 2019, 32 states have introduced legislation accepting or promoting the use of Bitcoin and blockchain distributed ledger technology (DLT), while a few have already passed them into law. Some of these states have also established task forces to study the technology&#39;s use further.  </p>\n\n<p>Bitcoin took a major step in 2017, when it was granted the same financial safeguards as traditional assets. The FTC gave cryptocurrency trading platform operator LedgerX approval to become the first federally regulated digital currency options exchange and clearinghouse in the U.S.</p>\n\n<p>Additionally, in June 2019, SEC-registered clearing and execution company Apex Clearing launched a trading platform for brokers-dealers and financial advisors to help their clients trade the four major cryptocurrencies - Bitcoin, Bitcoin cash, Ethereum, and Litecoin - through its subsidiary Apex Crypto.</p>\n\n<p><a href=\"https://www.loc.gov/\">Source</a></p>\n\n<p><a href=\"https://www.businessinsider.com/blockchain-cryptocurrency-regulations-us-global?international=true&amp;r=US&amp;IR=T\">Source</a></p>\n</div><!-- SC_ON -->",
  "score": 975,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/sy99BMqiM13j2Cc__AoRYjtYIKLAGxkXWb6eYDF9vTY.jpg?auto=webp&s=97bb3f3f07f692bb18a06f4db8560798b7f3159e",
          "width": 1200,
          "height": 630
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/sy99BMqiM13j2Cc__AoRYjtYIKLAGxkXWb6eYDF9vTY.jpg?width=108&crop=smart&auto=webp&s=8653552ce2b0758caa949d09eee993cd9148a0f2",
            "width": 108,
            "height": 56
          },
          {
            "url": "https://external-preview.redd.it/sy99BMqiM13j2Cc__AoRYjtYIKLAGxkXWb6eYDF9vTY.jpg?width=216&crop=smart&auto=webp&s=8d9a18557fafe0e45614984572594b60d50f004d",
            "width": 216,
            "height": 113
          },
          {
            "url": "https://external-preview.redd.it/sy99BMqiM13j2Cc__AoRYjtYIKLAGxkXWb6eYDF9vTY.jpg?width=320&crop=smart&auto=webp&s=f4ae8a6605b49bd1ec23117307bbd0634a22882b",
            "width": 320,
            "height": 168
          },
          {
            "url": "https://external-preview.redd.it/sy99BMqiM13j2Cc__AoRYjtYIKLAGxkXWb6eYDF9vTY.jpg?width=640&crop=smart&auto=webp&s=015b907f53634535a5fe4b7b0b0e4067ccc65d4f",
            "width": 640,
            "height": 336
          },
          {
            "url": "https://external-preview.redd.it/sy99BMqiM13j2Cc__AoRYjtYIKLAGxkXWb6eYDF9vTY.jpg?width=960&crop=smart&auto=webp&s=03cdb167c2ee7375171bbd34df7b7334de782cef",
            "width": 960,
            "height": 504
          },
          {
            "url": "https://external-preview.redd.it/sy99BMqiM13j2Cc__AoRYjtYIKLAGxkXWb6eYDF9vTY.jpg?width=1080&crop=smart&auto=webp&s=f6a819169fa04931ee647de77ca2c94fe8bdb610",
            "width": 1080,
            "height": 567
          }
        ],
        "variants": {},
        "id": "Bbdjbd7Nt6D3Zwp57fgd5OZ9_foit4Il2pWjAXvIrWk"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/m7pd7j/a_list_of_43_countrys_and_their_cryptocurrency/",
  "subreddit": "CryptoCurrency",
  "id": "m7pd7j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752815279
}