{
  "author": "seebz69",
  "the_new_excerpt": "Aphria & Tilray Merger\n\nAphria and Tilray Combine to Create Largest Global Cannabis Company With Pro\nForma Revenue of C$874 Million\n\nhttps://www.businesswire.com/news/home/20201216005519/en/\n\n> Under the terms of the Arrangement, the shareholders of Aphria will receive\n> 0.8381 shares of Tilray for…",
  "original_created_utc": 1612237600,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "Aphria和Tilray合并\n\nAphria和Tilray联合创建全球最大的大麻公司，并提供专业服务。\n基本收入8.74亿加元\n\nhttps://www.businesswire.com/news/home/20201216005519/en/\n\n> 根据该安排的条款，Aphria的股东将获得以下收益。\n> 0.8381股Tilray为...",
      "title": "Aphria/Tilray--欧洲巨无霸"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Aphria和Tilray合併\n\nAphria和Tilray聯合創建全球最大的大麻公司，並提供專業服務。\n基本收入8.74億加元\n\nhttps://www.businesswire.com/news/home/20201216005519/en/\n\n> 根據該安排的條款，Aphria的股東將獲得以下收益。\n> 0.8381股Tilray爲...",
      "title": "Aphria/Tilray--歐洲巨無霸"
    }
  ],
  "title": "Aphria/Tilray - The European Giant",
  "created_utc": 1612263897,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Aphria &amp; Tilray Merger</p>\n\n<p>Aphria and Tilray Combine to Create Largest Global Cannabis Company With Pro Forma Revenue of C$874 Million </p>\n\n<p><a href=\"https://www.businesswire.com/news/home/20201216005519/en/\">https://www.businesswire.com/news/home/20201216005519/en/</a></p>\n\n<blockquote>\n<p>Under the terms of the Arrangement, the shareholders of Aphria will receive 0.8381 shares of Tilray for each Aphria common share, while holders of Tilray shares will continue to hold their Tilray shares with no adjustment to their holdings. Upon the completion of the Arrangement, Aphria Shareholders will own approximately 62 percent of the outstanding Tilray Shares on a fully diluted basis, resulting in a reverse acquisition of Tilray, representing a premium of 23 percent based on the share price at market close on December 15, 2020 to Tilray shareholders. On a pro forma basis for the last twelve months reported by each company, the Combined Company would have had revenue of C$874 million (US$685 million).</p>\n</blockquote>\n\n<p>The cannabis industry as a whole has extreme growth potential. I recently made a <a href=\"https://www.reddit.com/r/investing/comments/l8ogt7/the_green_rush_weedstocks_us_legalization/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf\">post</a> illustrating my views on US Legalization &amp; the opportunity with long term plays. We have entered the <del>roaring</del> rolling 20’s, where cannabis regulations will ease dramatically.</p>\n\n<p>While the media picks up on US Legalization, Aphria &amp; Tilray are slowly taking over Europe. </p>\n\n<p>On January 27th, 2021 the CFO of Aphria, Carl Merton did an <a href=\"https://www.reddit.com/r/TheCannalysts/comments/l2wxoa/aphria_inc_ama_january_27_2021/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf\">AMA</a> in which he highlights the challenges Aphria/Tilray face to create desired synergies.</p>\n\n<blockquote>\n<p>More importantly and something I think too many people fail to completely comprehend; we bring a distribution system to Tilray in Europe. Currently, Tilray pays a third party to distribute their product in Europe. That means they are only recording the sale of cannabis from the producer to the distributor and are incurring a cost to do it. By running the Tilray sale through CC Pharma, not only do we remove the distribution expense from Tilray’s operations, but the combined entity will now record the sale from the distributor to the pharmacy, effectively moving up market in our share of wallet with the consumer.</p>\n</blockquote>\n\n<p><strong>What is CC Pharma?</strong></p>\n\n<p>CC Pharma is a leading German Pharmaceutical and Medical Cannabis Distributor that was <a href=\"https://www.prnewswire.com/news-releases/aphria-completes-acquisition-of-cc-pharma-leading-german-pharmaceutical-and-medical-cannabis-distributor-300775086.html\">acquired</a> by Aphria in 2019. </p>\n\n<p>Last week, CC Pharma <a href=\"https://www.newswire.ca/news-releases/amp-german-cannabis-group-and-aphria-s-subsidiary-cc-pharma-gmbh-enter-into-strategic-co-promotion-agreement-for-the-sale-of-medical-cannabis-in-germany-897696119.html\">inked a deal</a> with AMP German Cannabis Group.</p>\n\n<blockquote>\n<p>AMP will organize with the support of CC Pharma, &quot;information events&quot; in Germany to market Aphria branded products to doctors and pharmacists; Dr. Stefan Feuerstein, Director and President of AMP, commented, &quot;We are proud to partner with Aphria and CC Pharma GmbH. Our sole focus is to sell medical cannabis in Germany, which makes us an ideal partner to co-promote and sell the Aphria brand.</p>\n</blockquote>\n\n<p><strong>Tilray &amp; France</strong></p>\n\n<p>The same day Aphria &amp; CC Pharma gobble up market share in Germany, Tilray was selected by French National Agency to Supply GMP-Certified Medical Cannabis Products in <a href=\"https://www.businesswire.com/news/home/20210126005149/en/Tilray%C2%AE-Selected-by-French-National-Agency-to-Supply-GMP-Certified-Medical-Cannabis-Products-in-France\">France</a> </p>\n\n<blockquote>\n<p>the French National Agency for the Safety of Medicines and Health Products (ANSM) to supply Good Manufacturing Processes (GMP) certified medical cannabis products for experimentation in France. Tilray will supply GMP-produced medical cannabis products to serve patients in need for the duration of the French experiment (18-24 months), due to begin in the first quarter of 2021.</p>\n</blockquote>\n\n<p>The cannabis will be exported to France from Tilray&#39;s facility in <a href=\"https://www.businesswire.com/news/home/20210201005184/en/Tilray%C2%AE-Receives-the-First-and-Only-Market-Authorization-to-Offer-Medical-Cannabis-Products-in-Portugal\">Portugal</a> </p>\n\n<blockquote>\n<p>In May 2020, Tilray received its third and complete Good Manufacturing Practice (GMP) certification for Tilray Portugal. The complete GMP-certification allows Tilray to manufacture medical cannabis extracts in-house and export GMP-produced finished medical cannabis products, both dried flower, and oil, from Portugal throughout the European Union and other international markets with authorized national medical cannabis programs.</p>\n</blockquote>\n\n<p>The amount of untapped growth potential in Europe is eyeopening &amp; Aphria/Tilray will be first in line to benefit. I highly recommend doing your own DD and deepdiving the management. Irwin Simon moves quickly and has a great track record. I believe this company is poised to be the best. </p>\n\n<p>Stay safe &amp; GLTA</p>\n\n<p><em>I am not a Financial Advisor, so please do your own DD. In my opinion, Aphria &amp; Tilray are poised for significant growth</em></p>\n</div><!-- SC_ON -->",
  "score": 170,
  "permalink": "/r/investing/comments/lammyc/aphriatilray_the_european_giant/",
  "subreddit": "investing",
  "id": "lammyc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518534786
}