{
  "author": "Current87",
  "the_new_excerpt": "He lost the majority of his value in a hard earned portfolio (he legit grew up\nin a Florida trailer) during the first recession of the millennium. You know\nwhat he did? Freaked out, sold at a massive loss, and developed such a bad\ndrinking problem he would sit on the couch at 2 am, wobbling his head…",
  "original_created_utc": 1614930877,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "他在辛辛苦苦赚来的投资组合中损失了大部分价值（他合法地长大了）。\n在佛罗里达州的一辆拖车里），在千年的第一次衰退中。你知道吗？\n他做了什么？吓坏了，卖出了大量的亏损，并发展到了如此糟糕的程度\n酗酒的问题，他会在凌晨两点坐在沙发上，摇头晃脑... ...",
      "title": "PSA：不要做我的继父。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "他在辛辛苦苦賺來的投資組合中損失了大部分價值（他合法地長大了）。\n在佛羅里達州的一輛拖車裏），在千年的第一次衰退中。你知道嗎？\n他做了什麼？嚇壞了，賣出了大量的虧損，並發展到了如此糟糕的程度\n酗酒的問題，他會在凌晨兩點坐在沙發上，搖頭晃腦... ...",
      "title": "PSA：不要做我的繼父。"
    }
  ],
  "title": "PSA: Don't be my stepdad",
  "created_utc": 1614936707,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>He lost the majority of his value in a hard earned portfolio (he legit grew up in a Florida trailer) during the first recession of the millennium. You know what he did? Freaked out, sold at a massive loss, and developed such a bad drinking problem he would sit on the couch  at 2 am, wobbling his head and groaning - he drank, and continues to drink, close to a handle of whiskey a night. It ruined his marriage and destroyed our family. All because his stonks went red. Don&#39;t be a bitch like my stepdad, set a few smart stop loss orders, and go enjoy a hobby you set aside because you had to adult. </p>\n\n<p>I try to learn from other people&#39;s hard lessons and watching him crumble has definitely helped me hold on when my investments fluctuated. </p>\n\n<p>Tldr; keep your chins up, gentleman.</p>\n</div><!-- SC_ON -->",
  "score": 733,
  "permalink": "/r/stocks/comments/ly71nh/psa_dont_be_my_stepdad/",
  "subreddit": "stocks",
  "id": "ly71nh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542576945
}