{
  "author": "IameIion",
  "original_created_utc": 1658180450,
  "title": "I got wrote up at my job because I was not working by 2:55pm, but my shift starts at 3pm. I’m new. I’ve only been there for two weeks and this was my first tardy. Honest opinions please. Am I just being sensitive and need to just take my punishment or is this micromanagement?",
  "created_utc": 1658203699,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Edit: I forgot to specify that I was there and working at 3pm. Also, I am not in the system yet so I cannot clock in manually, but it seems like they’re paying me for coming here early. I have 42 minutes of over time on top of my 40 hours. Now, I do work 6 days a week and I have since I started. I don’t know what the pay period is so this isn’t automatically evidence that I’m being stolen from. However, I will do some digging to make sure everything is in order.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/NoStupidQuestions/comments/w2b2aa/i_got_wrote_up_at_my_job_because_i_was_not/",
  "subreddit": "NoStupidQuestions",
  "id": "w2b2aa",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Edit: I forgot to specify that I was there and working at 3pm. Also, I am not in\nthe system yet so I cannot clock in manually, but it seems like they’re paying\nme for coming here early. I have 42 minutes of over time on top of my 40 hours.\nNow, I do work 6 days a week and I have since I started. I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "編集部：15時に現地入りして仕事をしていたことを明記するのを忘れていました。また、私は\nまだシステムに入っていないので、手動で出勤することができませんが、早く来た分\nまた、まだシステム化されていないので、手動で出勤することはできませんが、早く来た分、お金をもらっているようです。私は40時間に加えて42分の時間外労働をしています。\n今、私は週6日働いていますが、始めたときからそうでした。I...",
      "title": "バイト先で14時55分までに出勤していなかったため、書類送検されましたが、私のシフトは15時からです。私は新人です。まだ2週間しか経ってないのに、初めての遅刻でした。正直な意見をお願いします。私はただ敏感なだけで、罰を受ける必要があるのでしょうか、それともこれはマイクロマネジメントなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "编辑：我忘了说明我在那里，而且是在下午3点工作。另外，我还没有进入\n我还没有进入系统，所以我不能手动打卡，但看起来他们在支付\n我早早来到这里。在我的40小时之外，我还有42分钟的超时时间。\n现在，我确实每周工作6天，自从我开始工作以来，我一直在工作。I...",
      "title": "我在工作中被记过，因为我在下午2点55分之前没有工作，但我的班在下午3点开始。我是新人。我只在那里工作了两个星期，这是我第一次迟到。请发表诚实的意见。我是不是太敏感了，需要接受惩罚，还是这属于微观管理？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "編輯：我忘了說明我在那裏，而且是在下午3點工作。另外，我還沒有進入\n我還沒有進入系統，所以我不能手動打卡，但看起來他們在支付\n我早早來到這裏。在我的40小時之外，我還有42分鐘的超時時間。\n現在，我確實每週工作6天，自從我開始工作以來，我一直在工作。I...",
      "title": "我在工作中被記過，因爲我在下午2點55分之前沒有工作，但我的班在下午3點開始。我是新人。我只在那裏工作了兩個星期，這是我第一次遲到。請發表誠實的意見。我是不是太敏感了，需要接受懲罰，還是這屬於微觀管理？"
    }
  ]
}