{
  "author": "LorenzoApophis",
  "original_created_utc": 1635742849,
  "title": "Why was pederasty so (relatively) common in past societies given that sexual attraction to children is so rare?",
  "created_utc": 1635790156,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I don&#39;t think it requires much research to tell that pedophilia, whether considered a harmful mental disorder or not, is extremely uncommon. So why was it apparently considered normal in societies like those of ancient Greece and Rome? Even if it wasn&#39;t viewed as sexual abuse, you would expect such people to make up a very small and thus unusual minority.</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/qk6v3s/why_was_pederasty_so_relatively_common_in_past/",
  "subreddit": "AskHistorians",
  "id": "qk6v3s",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I don't think it requires much research to tell that pedophilia, whether\nconsidered a harmful mental disorder or not, is extremely uncommon. So why was\nit apparently considered normal in societies like those of ancient Greece and\nRome? Even if it wasn't viewed as sexual abuse, you would expect such…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ペドフィリアは、そのように考えられているかどうかにかかわらず、多くの研究を必要としないと思います。\n有害な精神疾患であるかどうかにかかわらず、非常に珍しいことです。では、なぜ\n古代ギリシャやローマのような社会では普通のことだと思われていたのでしょうか？\n古代ギリシャやローマのような社会では、なぜそれが普通だと思われていたのか。仮に性的虐待とみなされていなかったとしても、そのような...",
      "title": "子供に性的魅力を感じることは非常に稀であるにもかかわらず、なぜ過去の社会ではペデロスが（比較的）一般的であったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我认为不需要太多的研究就可以知道，恋童癖，无论是否被认为是一种有害的精神障碍\n无论是否被认为是一种有害的精神障碍，都是极其不常见的。那么为什么\n在古希腊和古罗马这样的社会中，它显然被认为是正常的。\n罗马这样的社会中，恋童癖显然被认为是正常的？即使它不被看作是性虐待，你也会期望这种...",
      "title": "既然对儿童的性吸引如此罕见，为什么鸡奸在过去的社会中如此（相对）普遍？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我認爲不需要太多的研究就可以知道，戀童癖，無論是否被認爲是一種有害的精神障礙\n無論是否被認爲是一種有害的精神障礙，都是極其不常見的。那麼爲什麼\n在古希臘和古羅馬這樣的社會中，它顯然被認爲是正常的。\n羅馬這樣的社會中，戀童癖顯然被認爲是正常的？即使它不被看作是性虐待，你也會期望這種...",
      "title": "既然對兒童的性吸引如此罕見，爲什麼雞姦在過去的社會中如此（相對）普遍？"
    }
  ]
}