{
  "author": "velocipedic",
  "original_created_utc": 1635014430,
  "title": "Wearing crypto \"merch\" or \"swag\" can make you a target for robbery or worse.",
  "created_utc": 1635046860,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As crypto is gaining popularity and people are realizing the potential for monetary value, I&#39;m seeing more and more news articles about people that are getting robbed and/or murdered for their holdings. </p>\n\n<p><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/qe81mg/19_year_old_french_man_killed_for_owning_200k_in/\">Link to relevant Reddit post/comments: Man Killed for $200k in ETH</a></p>\n\n<p>You wouldn&#39;t tell others how much you have in the bank, would you? You wouldn&#39;t tell people the size of your IRA either. <strong>So why would you tell anyone how much crypto you have?</strong> It is literally an asset that can be sent instantly and irreversibly to a criminal... with a knife to your throat.</p>\n\n<p>Crypto &quot;merch&quot; advertises to the world that you have some of the asset and almost certainly <strong><em>more of other crypto assets.</em></strong> </p>\n\n<hr/>\n\n<p>There are two reasons that I hear from people for why they have crypto swag.</p>\n\n<p><strong>&quot;I want to spread awareness&quot;</strong></p>\n\n<p>The people who would buy a crypto after seeing it on a t-shirt are the wrong <del>idiots</del> people to get into crypto. They&#39;re going to call it a scam every time the price goes below their purchase price. Generally, if you do anything because a t-shirt says to... you&#39;re an idiot.</p>\n\n<p>&nbsp;</p>\n\n<p><strong>&quot;I&#39;m proud of it and involved in the community and I want people to see that.&quot;</strong></p>\n\n<p>People will either think you&#39;re a nerd.</p>\n\n<p>Or people will think you&#39;re rich.</p>\n\n<p>Do you really want the people who see you to think any combination of those things about you? Robbers see someone with a crypto t-shirt and probably think to themselves, &quot;This guy is a rich nerd; a perfect target for me.&quot; </p>\n\n<p>&nbsp;</p>\n\n<p>TL;DR - Your crypto &quot;merch&quot; makes you a target to all of the wrong people. Wear with caution if you do wear crypto merch at all. Don&#39;t advertise to the public that you hold <del>crypto</del> anything of value, whether by speech or &quot;logo.&quot;</p>\n</div><!-- SC_ON -->",
  "score": 160,
  "permalink": "/r/CryptoCurrency/comments/qeaqgc/wearing_crypto_merch_or_swag_can_make_you_a/",
  "subreddit": "CryptoCurrency",
  "id": "qeaqgc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As crypto is gaining popularity and people are realizing the potential for\nmonetary value, I'm seeing more and more news articles about people that are\ngetting robbed and/or murdered for their holdings.\n\nLink to relevant Reddit post/comments: Man Killed for $200k in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号が人気を博し、人々が貨幣価値の可能性に気づくにつれ\n貨幣価値の可能性に人々が気づくにつれ、保有している暗号のために強盗や殺人に遭っている人々のニュース記事を目にする機会が増えています。\n奪われたり、殺されたりするニュース記事を目にする機会が増えています。\n\n関連するRedditの投稿/コメントへのリンクです。20万ドルで殺された男性...",
      "title": "暗号の「商品」や「スワッグ」を身につけていると、強盗などの標的になることがあります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "随着加密货币越来越受欢迎，人们开始意识到其潜在的货币价值。\n货币价值，我看到越来越多关于人们被抢劫和/或谋杀的新闻报道。\n越来越多的新闻报道了人们因持有的货币而被抢劫和/或被谋杀。\n\n链接到相关的Reddit帖子/评论。男子为20万美金被杀...",
      "title": "佩戴加密货币的 \"商品 \"或 \"礼品 \"会使你成为抢劫或更坏的目标。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "隨着加密貨幣越來越受歡迎，人們開始意識到其潛在的貨幣價值。\n貨幣價值，我看到越來越多關於人們被搶劫和/或謀殺的新聞報道。\n越來越多的新聞報道了人們因持有的貨幣而被搶劫和/或被謀殺。\n\n鏈接到相關的Reddit帖子/評論。男子爲20萬美金被殺...",
      "title": "佩戴加密貨幣的 \"商品 \"或 \"禮品 \"會使你成爲搶劫或更壞的目標。"
    }
  ]
}