{
  "author": "1078Garage",
  "original_created_utc": 1625120465,
  "title": "This sub loves Algorand and I'm starting to question all my crypto life choices now",
  "created_utc": 1625168121,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My altcoins are mainly ADA, UNI, LINK, DOT and VET. The amount of Algorand love here though has me wondering if it&#39;s not a project I&#39;ve overlooked and this could be early days with a lot more growth to come. What are the specific Algorand features or potential upsides that make it unique? I know you&#39;re not my real Crypto Dad but can you an argument for Algorand versus the alts I&#39;m into already? Thanks guys.</p>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/CryptoCurrency/comments/obfr2b/this_sub_loves_algorand_and_im_starting_to/",
  "subreddit": "CryptoCurrency",
  "id": "obfr2b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My altcoins are mainly ADA, UNI, LINK, DOT and VET. The amount of Algorand love\nhere though has me wondering if it's not a project I've overlooked and this\ncould be early days with a lot more growth to come. What are the specific\nAlgorand features or potential upsides that make it unique? I know…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私のアルトコインは主にADA、UNI、LINK、DOT、VETです。ここでのAlgorandへの愛の大きさは\n私が見落としていたプロジェクトではないかと考えています。\nこれは初期の段階で、これからもっと成長する可能性があります。具体的にはどのような\nアルゴランドの特徴や潜在的な長所は何ですか？そうですね...。",
      "title": "このサブはAlgorandが大好きで、私は今、自分の暗号化された人生の選択に疑問を持ち始めています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的altcoins主要是ADA, UNI, LINK, DOT和VET。这里对Algorand的喜爱程度\n我在想，这是不是我忽略了一个项目，而这\n这可能是早期的项目，还有更多的增长。哪些是具体的\nAlgorand有哪些具体特点或潜在的优势，使其独一无二？我知道...",
      "title": "这个子喜欢Algorand，我现在开始质疑我所有的加密货币生活选择了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的altcoins主要是ADA, UNI, LINK, DOT和VET。這裏對Algorand的喜愛程度\n我在想，這是不是我忽略了一個項目，而這\n這可能是早期的項目，還有更多的增長。哪些是具體的\nAlgorand有哪些具體特點或潛在的優勢，使其獨一無二？我知道...",
      "title": "這個子喜歡Algorand，我現在開始質疑我所有的加密貨幣生活選擇了"
    }
  ]
}