{
  "author": "greentommm",
  "the_new_excerpt": "In my opinion the EU and especially Germany (electricity prices are the highest\nin the world for consumers) are in for a rude awakening for the need of some\nform of energy production/storage system to cover their base load.\nBatteries are not suitable for this task and other forms are…",
  "original_created_utc": 1618064163,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の意見では、EU、特にドイツ（消費者にとって電気料金は世界で最も高い）は、何らかの対策が必要であることに気づかされます。\nEU、特にドイツ（消費者にとって電気料金は世界で最も高い）は、何らかの形でのエネルギープロパティーの必要性について、失礼な目覚めをしていると思います。\n私の意見では、EU、特にドイツ（電力価格が世界で最も高い消費国）は、ベースロードをカバーするために何らかのエネルギー生産/貯蔵システムの必要性を痛感している。\n電池はこのタスクには適しておらず、他の形態が必要です...",
      "title": "原子力で地球を救う。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在我看来，欧盟，尤其是德国（电价是最高的）。\n在世界范围内，对于消费者来说，他们会因为一些需要而被粗暴地唤醒。\n能源生产/存储系统的形式，以满足其基本负荷。\n电池不适合于这项任务，其他形式的能源生产/储存系统...",
      "title": "拯救地球的核电。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在我看來，歐盟，尤其是德國（電價是最高的）。\n在世界範圍內，對於消費者來說，他們會因爲一些需要而被粗暴地喚醒。\n能源生產/存儲系統的形式，以滿足其基本負荷。\n電池不適合於這項任務，其他形式的能源生產/儲存系統...",
      "title": "拯救地球的核電。"
    }
  ],
  "title": "Nuclear Power to save the planet.",
  "created_utc": 1618073587,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In my opinion the EU and especially Germany (electricity prices are the highest in the world for consumers) are in for a rude awakening for the need of some form of energy production/storage system to cover their base load.<br/>\nBatteries are not suitable for this task and other forms are highly geographically dependent (Hydropower in Norway for example).<br/>\nThis leaves natural gas and nuclear power on the table.<br/>\nGreen Parties in the north of Europe seem to find a new liking to nuclear power and i think others will follow.<br/>\nSo my question is, what are the best ways to participate in a possible increase in the usage of nuclear power in your opinion?</p>\n</div><!-- SC_ON -->",
  "score": 1610,
  "permalink": "/r/investing/comments/mo5ii4/nuclear_power_to_save_the_planet/",
  "subreddit": "investing",
  "id": "mo5ii4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566616794
}