{
  "author": "Jalsavrah",
  "the_new_excerpt": "Am I going to ask her to be my gf? Will we go steady? Do I need to marry her\nfirst? Is there friends with benefits on the table? Was being girlfriend and\nboyfriend even a thing?\n\nAlternatively, feel free to answer this if the fancy is also a boy. I'm aware\nthe Greeks did not have a concept of…",
  "original_created_utc": 1613056672,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我是不是要请她做我的gf？我们会稳定发展吗？我需要和她结婚吗？\n先说说？是否有朋友的好处摆在桌面上？做女朋友是否和\n男朋友也就算了？\n\n另外，如果看中的也是一个男生，也可以随意回答。我知道\n希腊人没有一个概念... ...",
      "title": "我是一个低等的古希腊青少年/青年男子。在Polis/village的另一边有一个和我阶级相近的女孩，她正是我喜欢的类型，我想和她结为夫妻。有什么浪漫的约定，是我应该考虑和规划的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是不是要請她做我的gf？我們會穩定發展嗎？我需要和她結婚嗎？\n先說說？是否有朋友的好處擺在桌面上？做女朋友是否和\n男朋友也就算了？\n\n另外，如果看中的也是一個男生，也可以隨意回答。我知道\n希臘人沒有一個概念... ...",
      "title": "我是一個低等的古希臘青少年/青年男子。在Polis/village的另一邊有一個和我階級相近的女孩，她正是我喜歡的類型，我想和她結爲夫妻。有什麼浪漫的約定，是我應該考慮和規劃的？"
    }
  ],
  "title": "I'm a low class Ancient Greek adolescent/young adult man. There's this girl of similar class on the other side of the polis/village to me who's just my type, and I'd like to get conjugal with her. What romantic conventions are there that i should be thinking about and planning?",
  "created_utc": 1613073245,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Am I going to ask her to be my gf? Will we go steady? Do I need to marry her first? Is there friends with benefits on the table? Was being girlfriend and boyfriend even a thing?</p>\n\n<p>Alternatively, feel free to answer this if the fancy is also a boy. I&#39;m aware the Greeks did not have a concept of homosexuality, so what concepts regarding courting and premarital romance/sex were there?</p>\n\n<p>Any period of Greek antiquity, but let&#39;s say Classical for sake of example.</p>\n\n<p>Many thanks.</p>\n</div><!-- SC_ON -->",
  "score": 112,
  "permalink": "/r/AskHistorians/comments/lhmsym/im_a_low_class_ancient_greek_adolescentyoung/",
  "subreddit": "AskHistorians",
  "id": "lhmsym",
  "is_self": true,
  "media": null,
  "is_video": false
}