{
  "author": "Set1Less",
  "original_created_utc": 1637688124,
  "title": "Massive crypto crash in India. Most coins down 25% in just hours as crackpot dictator Modi plans to ban all crypto",
  "created_utc": 1637695842,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>India has just released agenda of parliament session, where it seeks to ban all &quot;private&quot; crypto currencies.</p>\n\n<p>As soon as the news broke out, many are trying to sell and exit and the market has crashed 25% in a matter of minutes. Many are facing massive losses as the result of this fucking government. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/q9m81t2qpd181.jpg?width=917&amp;format=pjpg&amp;auto=webp&amp;s=274646e72cf5376529af3f0ee8105eb78520117e\">Massive crash all across the board</a></p>\n\n<p>Most coins are down anywhere from 15 to 25%. Altcoins have been impacted the most. Even stablecoins have crashed 10% as people are selling that for INR. </p>\n\n<p>Modi has show to be an incompetent ruler, just this week he rolled back farm laws that seeked to destroy farmers livelihood in favour of his industrial buddies who fund his election campaign. Over 100 farmers died due to protests across the country, and then Modi meekly rolled back the laws.</p>\n\n<p>Now he is attacking crypto and seeking to shut this market down.</p>\n</div><!-- SC_ON -->",
  "score": 734,
  "permalink": "/r/CryptoCurrency/comments/r0i8fr/massive_crypto_crash_in_india_most_coins_down_25/",
  "subreddit": "CryptoCurrency",
  "id": "r0i8fr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "India has just released agenda of parliament session, where it seeks to ban all\n\"private\" crypto currencies.\n\nAs soon as the news broke out, many are trying to sell and exit and the market\nhas crashed 25% in a matter of minutes. Many are facing massive losses as the\nresult of this fucking…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "インドが国会の議題を公開しました。そこでは、すべての映画を禁止することを求めています。\n「私的な」暗号通貨をすべて禁止しようとしています。\n\nこのニュースが出るやいなや、多くの人が売り抜けようとし、市場は数分で25％も暴落しました。\n数分のうちに25％もの大暴落となりました。多くの人が巨額の損失に直面しています。\nこのクソッタレの結果...",
      "title": "インドで大規模な暗号の暴落。大半のコインがわずか数時間で25％下落 狂気の独裁者モディが全ての暗号を禁止する計画を発表"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "印度刚刚公布了议会会议的议程，它试图禁止所有的\n\"私人 \"加密货币。\n\n消息一出，许多人都试图卖出并退出，市场\n在几分钟内暴跌了25%。许多人正面临巨大的损失，因为\n这个该死的结果...",
      "title": "印度大规模的加密货币崩溃。大多数硬币在短短几个小时内下跌25%，因为疯子独裁者莫迪计划禁止所有加密货币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "印度剛剛公佈了議會會議的議程，它試圖禁止所有的\n\"私人 \"加密貨幣。\n\n消息一出，許多人都試圖賣出並退出，市場\n在幾分鐘內暴跌了25%。許多人正面臨巨大的損失，因爲\n這個該死的結果...",
      "title": "印度大規模的加密貨幣崩潰。大多數硬幣在短短几個小時內下跌25%，因爲瘋子獨裁者莫迪計劃禁止所有加密貨幣"
    }
  ]
}