{
  "author": "Starchild20xx",
  "original_created_utc": 1628126995,
  "title": "Help! Is my cat purposely putting me to sleep?",
  "created_utc": 1628162092,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My cat and I are always together. My room is her room. My bed is her bed. She&#39;ll run around or watch the rabbits from the window, but she always ends up nestling herself on my bed eventually. And whenever I lie down with her to take a break and watch TV or something, she&#39;ll start purring and begging me to give her affection. So I do. She&#39;ll just lie there purring loudly, and watching me.</p>\n\n<p>&#x200B;</p>\n\n<p>AND NEXT THING I KNOW, I WAKE UP AND IT&#39;S 2 OR 3 IN THE MORNING. It keeps happening, dammit. Like, when I lie in bed with her, I&#39;m not even tired. And I don&#39;t even feel myself dozing off. There&#39;s no warning. The minute I get into bed, and she starts purring, I open my eyes and it&#39;s the middle of the night.</p>\n\n<p>Like yeah, okay.. Maybe I&#39;m just lazy. Maybe I drink too much caffeine.</p>\n\n<p>Or <em>maybe.</em> Just <em>maybe. SHE&#39;S DOING IT ON PURPOSE.</em> Like some sort of evil sleep witch. <em>MAYBE</em> she knows exactly what she&#39;s doing. So I lie down, wanting to take just a five minute break.. And five minutes turns into five bloody hours.</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/NoStupidQuestions/comments/oy77xu/help_is_my_cat_purposely_putting_me_to_sleep/",
  "subreddit": "NoStupidQuestions",
  "id": "oy77xu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My cat and I are always together. My room is her room. My bed is her bed. She'll\nrun around or watch the rabbits from the window, but she always ends up nestling\nherself on my bed eventually. And whenever I lie down with her to take a break\nand watch TV or something, she'll start purring and begging…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "愛猫と私はいつも一緒です。私の部屋は彼女の部屋。私のベッドは彼女のベッド。彼女は\n走り回ったり、窓からウサギを見たりしていますが、いつも最終的には私のベッドの上に\n結局は私のベッドに寄り添っている。そして、私が彼女と一緒に横になって一休みしたり、テレビを見たりすると\n一緒に横になってテレビを見ていると、ゴロゴロと鳴いておねだりしてきます...。",
      "title": "助けてください。私の猫はわざと私を眠らせているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的猫和我总是在一起。我的房间就是她的房间。我的床就是她的床。她会\n她会跑来跑去，或从窗口看兔子，但她最后总是依偎在\n她最终都会躺在我的床上。每当我和她一起躺下休息时\n看电视或什么的时候，她就会开始打呼噜和哀求......",
      "title": "帮助! 我的猫是在故意让我睡觉吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的貓和我總是在一起。我的房間就是她的房間。我的牀就是她的牀。她會\n她會跑來跑去，或從窗口看兔子，但她最後總是依偎在\n她最終都會躺在我的牀上。每當我和她一起躺下休息時\n看電視或什麼的時候，她就會開始打呼嚕和哀求......",
      "title": "幫助! 我的貓是在故意讓我睡覺嗎？"
    }
  ]
}