{
  "author": "JewsEatFruit",
  "original_created_utc": 1639448681,
  "title": "My female friend is leaving incarceration after 11 months, and she asked me to hook her up with a guy so she can get laid on Dec 17, her first day of unsupervised leave from the halfway house. How the hell do I even go about this? Friends and co-workers are off-limits for obv reasons.",
  "created_utc": 1639463653,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Like that&amp;#39;s all there is to say. I need to know how to find a guy to bang her. It won&amp;#39;t be me because I have a GF.&lt;/p&gt;\n\n&lt;p&gt;Her friends/family is 800Km away and she has no access to the internet, is not allowed personal electronics.&lt;/p&gt;\n\n&lt;p&gt;Can&amp;#39;t believe she asked me this today when I visited because nothing like this has ever been asked of me.&lt;/p&gt;\n\n&lt;p&gt;But I can understand why she would want to get laid after a year of being around nothing but women prisoners, and I get why she needs help.&lt;/p&gt;\n\n&lt;p&gt;Ok Reddit... tell me how to get this woman some dick.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 113,
  "permalink": "/r/NoStupidQuestions/comments/rfwrqw/my_female_friend_is_leaving_incarceration_after/",
  "subreddit": "NoStupidQuestions",
  "id": "rfwrqw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Like that's all there is to say. I need to know how to find a guy to bang her.\nIt won't be me because I have a GF.\n\nHer friends/family is 800Km away and she has no access to the internet, is not\nallowed personal electronics.\n\nCan't believe she asked me this today when I visited because nothing like…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "それしかないみたいな。どうやったら彼女とヤレる男を見つけられるのか知りたい。\n俺にはGFがいるから無理だな。\n\n彼女の友人や家族は800キロも離れていて、インターネットにもアクセスできない。\n電子機器の持ち込みを禁止しています。\n\n今日、私が訪問したとき、彼女がこんなことを聞くなんて信じられない......だって、何もないんだもの。",
      "title": "私の女友達が11ヶ月ぶりに刑務所を出るのですが、12月17日のハーフウェイハウスからの監視なしの休暇の初日にヤレるように男を紹介してくれと頼まれました。いったいどうすればいいのでしょうか？友人や同僚は、当然の理由で禁止されています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "好像这就是要说的全部内容。我需要知道如何找到一个男人来和她上床。\n这不会是我，因为我有一个GF。\n\n她的朋友/家人在800公里以外，她不能上网，不允许使用个人电子产品。\n允许使用个人电子产品。\n\n不敢相信，今天我去拜访她的时候，她问了我这个问题，因为没有任何像...",
      "title": "我的女性朋友在11个月后就要离开监狱了，她让我给她介绍一个男人，这样她就可以在12月17日，也就是她离开中途之家的第一天，在没有监督的情况下上床了。我到底该怎么做呢？朋友和同事是禁区，原因很明显。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好像這就是要說的全部內容。我需要知道如何找到一個男人來和她上牀。\n這不會是我，因爲我有一個GF。\n\n她的朋友/家人在800公里以外，她不能上網，不允許使用個人電子產品。\n允許使用個人電子產品。\n\n不敢相信，今天我去拜訪她的時候，她問了我這個問題，因爲沒有任何像...",
      "title": "我的女性朋友在11個月後就要離開監獄了，她讓我給她介紹一個男人，這樣她就可以在12月17日，也就是她離開中途之家的第一天，在沒有監督的情況下上牀了。我到底該怎麼做呢？朋友和同事是禁區，原因很明顯。"
    }
  ]
}