{
  "author": "DaddySkates",
  "original_created_utc": 1649154619,
  "title": "Decentralized Reddit on blockchain is one step closer to realization",
  "created_utc": 1649187135,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve written about this a few months ago when I found out that a developer Esteban Abaora is working on a fully blown decentralized Reddit. To put it short, it&amp;#39;s a decentralized Reddit alternative that will use public key based addressing and p2p subnetwork to operate. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s pretty crazy alright. &lt;/p&gt;\n\n&lt;p&gt;Esteban believes that this design would solve the problems of a serverless, adminless decentralized Reddit alternative. It would allow unlimited amounts of the so-called subplebbits (subreddits), users, posts, comments and votes. This is achieved by not caring about the order or availability of old data. It would allow users to post for free using an Reddit like interface. It would allow subplebbit owners to moderate spam semi-automatically using their own captcha service over peer-to-peer pubsub. It would allow for all features that make Reddit addictive: upvotes, replies, notifications, awards, and a chance to make the &amp;quot;front page&amp;quot;. All this without any fears of illegal content as it wont allow any media hosting. &lt;/p&gt;\n\n&lt;p&gt;So technically, &lt;a href=\"https://plebbit.eth.limo/\"&gt;Plebbit&lt;/a&gt; client developers to serve an unlimited amount of users, without any server, legal, advertising or moderation infrastructure. PLEB is their native token which will be used for the Plebbit similar to the what reddit does with it&amp;#39;s community points if you will. &lt;/p&gt;\n\n&lt;p&gt;His &lt;a href=\"https://github.com/plebbit/whitepaper/discussions/2\"&gt;github&lt;/a&gt; has been constantly updated for a while with a lot of work and he seems really dedicated. &lt;/p&gt;\n\n&lt;p&gt;I took some info from their &lt;a href=\"https://medium.com/@plebbit\"&gt;Medium&lt;/a&gt; article.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 310,
  "permalink": "/r/CryptoCurrency/comments/twruhj/decentralized_reddit_on_blockchain_is_one_step/",
  "subreddit": "CryptoCurrency",
  "id": "twruhj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've written about this a few months ago when I found out that a developer\nEsteban Abaora is working on a fully blown decentralized Reddit. To put it\nshort, it's a decentralized Reddit alternative that will use public key based\naddressing and p2p subnetwork to operate.\n\nIt's pretty crazy…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "数ヶ月前に書いたことがあるのですが、ある開発者が\nEsteban Abaoraは、本格的な分散型Redditの開発に取り組んでいます。簡単に言うと\nつまり、Redditの代替となる分散化されたもので、公開鍵ベースの\nアドレス指定とp2pサブネットワークで運用します。\n\nかなりクレイジーです...",
      "title": "ブロックチェーン上の分散型Redditが実現に一歩近づく"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "几个月前我就写过这个，当时我发现一个开发者\nEsteban Abaora正在开发一个完全去中心化的Reddit。简而言之\n简而言之，这是一个去中心化的Reddit替代品，它将使用基于公钥的\n地址和p2p子网络来运作。\n\n这是很疯狂的...",
      "title": "区块链上的去中心化Reddit离实现又近了一步"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "幾個月前我就寫過這個，當時我發現一個開發者\nEsteban Abaora正在開發一個完全去中心化的Reddit。簡而言之\n簡而言之，這是一個去中心化的Reddit替代品，它將使用基於公鑰的\n地址和p2p子網絡來運作。\n\n這是很瘋狂的...",
      "title": "區塊鏈上的去中心化Reddit離實現又近了一步"
    }
  ]
}