{
  "author": "evanfghfghgfh",
  "original_created_utc": 1642836591,
  "title": "The truth is Crypto prices will go even more down.",
  "created_utc": 1642851272,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This crash is triggered by many factors. Bitcoin is already at 35k$.&lt;/p&gt;\n\n&lt;p&gt;We are yet to see Feds increasing the interest rates which they have to increase to curb the inflation&lt;/p&gt;\n\n&lt;p&gt;Prediction is that this decision will come by march so during Feb to March the chances that crypto prices will increase during this time is negligible. Now imagine cryto prices declining(Or being stable) till march and then feds will decide to increase the interest rate. Imagine the amount of panic selling that would be there.&lt;/p&gt;\n\n&lt;p&gt;Also when interest rates will be increased there would be less money in circulation so naturally less people will invest in crypto so it will go even more down&lt;/p&gt;\n\n&lt;p&gt;I am scared to say this that it may reach 20k$ or even less. Then only it can go up&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 324,
  "permalink": "/r/CryptoCurrency/comments/s9x2ar/the_truth_is_crypto_prices_will_go_even_more_down/",
  "subreddit": "CryptoCurrency",
  "id": "s9x2ar",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "This crash is triggered by many factors. Bitcoin is already at 35k$.\n\nWe are yet to see Feds increasing the interest rates which they have to increase\nto curb the inflation\n\nPrediction is that this decision will come by march so during Feb to March the\nchances that crypto prices will increase…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このクラッシュは、さまざまな要因で引き起こされる。ビットコインはすでに35k$に達しています。\n\nFRBは金利を上げなければならないのに、まだ上げていません。\nインフレを抑制するために\n\n予測では、この決定は3月までに下されると思われるので、2月から3月にかけては\n暗号の価格が上昇する可能性があります...",
      "title": "本当はCryptoの価格はもっと下がるんですよ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这种崩溃是由许多因素引发的。比特币已经到了35000美元。\n\n我们还没有看到美联储提高利率，他们必须提高利率\n来抑制通货膨胀\n\n预测这一决定将在3月前做出，因此在2月至3月期间\n所以，在2月至3月期间，加密货币的价格有可能会上升...",
      "title": "事实是，加密货币价格将更加下跌。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這種崩潰是由許多因素引發的。比特幣已經到了35000美元。\n\n我們還沒有看到美聯儲提高利率，他們必須提高利率\n來抑制通貨膨脹\n\n預測這一決定將在3月前做出，因此在2月至3月期間\n所以，在2月至3月期間，加密貨幣的價格有可能會上升...",
      "title": "事實是，加密貨幣價格將更加下跌。"
    }
  ]
}