{
  "author": "SkitZa",
  "original_created_utc": 1624810895,
  "title": "It's so funny how Unpopular crypto is.",
  "created_utc": 1624822528,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I love strolling through reddit and reading all the crazy shit people make up about crypto as a whole they have zero clue on, all the same bullshit FUD you hear day in day out, we&#39;re so far from main stream it&#39;s crazy.</p>\n\n<p>If you ever think you&#39;re late, you really aren&#39;t, it&#39;s amazing how many people actually despise just us as people who enjoy or understand a bit about crypto.</p>\n\n<p>I don&#39;t give a shit what crypto you&#39;re into, Blockchains are going to change the world.</p>\n</div><!-- SC_ON -->",
  "score": 197,
  "permalink": "/r/CryptoCurrency/comments/o90a3f/its_so_funny_how_unpopular_crypto_is/",
  "subreddit": "CryptoCurrency",
  "id": "o90a3f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I love strolling through reddit and reading all the crazy shit people make up\nabout crypto as a whole they have zero clue on, all the same bullshit FUD you\nhear day in day out, we're so far from main stream it's crazy.\n\nIf you ever think you're late, you really aren't, it's amazing how many…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はredditを散策して、人々が作るすべてのクレイジーなクソを読むのが好きです。\n暗号全体について何の手掛かりもなく、毎日のように聞かされているでたらめなFUDを全部読んでいます。\n毎日のように耳にするでたらめなFUDですが、私たちはメインストリームとはかけ離れているので、クレイジーです。\n\n自分が遅れていると思っていても、実際にはそうではありません。",
      "title": "暗号がUnpopularなのはとても面白いですね。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我喜欢漫步在reddit上，阅读人们编造的所有疯狂的东西。\n关于整个加密货币，他们没有任何线索，所有的废话FUD你每天都听到。\n我们离主流太远了，这太疯狂了。\n\n如果你认为你迟到了，你真的没有，它是惊人的，有多少人...",
      "title": "这很有趣，加密货币是多么的不受欢迎。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我喜歡漫步在reddit上，閱讀人們編造的所有瘋狂的東西。\n關於整個加密貨幣，他們沒有任何線索，所有的廢話FUD你每天都聽到。\n我們離主流太遠了，這太瘋狂了。\n\n如果你認爲你遲到了，你真的沒有，它是驚人的，有多少人...",
      "title": "這很有趣，加密貨幣是多麼的不受歡迎。"
    }
  ]
}