{
  "author": "Apprehensive-Pop2119",
  "original_created_utc": 1638028952,
  "title": "How to handle my husband?",
  "created_utc": 1638055954,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My husband has an anger problem. I absolutely adore him but the only emotion he knows when something bothers him is anger and it’s crushing to me. He would never lay a hand on me although sometimes I think that might be nicer than the things he says to me. And, he’s incredibly stubborn so his apologies are often few and far between. What’s more, he often takes 2 or 3 days to fully calm down before he can have a open conversation. He has very rigid thinking and ultimately doesn’t have higher level thinking skills (beyond factual, concrete concepts). I’ve begged him to go to counseling but since I’m the only one that makes him this angry he doesn’t think he has a problem. I don’t know what to do anymore. Otherwise, he’s a phenomenal husband. Any kind words would be much appreciated.</p>\n</div><!-- SC_ON -->",
  "score": 282,
  "permalink": "/r/TooAfraidToAsk/comments/r3ghjv/how_to_handle_my_husband/",
  "subreddit": "TooAfraidToAsk",
  "id": "r3ghjv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My husband has an anger problem. I absolutely adore him but the only emotion he\nknows when something bothers him is anger and it’s crushing to me. He would\nnever lay a hand on me although sometimes I think that might be nicer than the\nthings he says to me. And, he’s incredibly stubborn so his…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の夫は、怒りの問題を抱えています。私は彼をとても尊敬していますが、彼は何か問題が起きたときの唯一の感情は怒りです。\n私は彼をとても愛していますが、彼が何かに悩んでいるときに知る唯一の感情は怒りであり、それは私を打ちのめすものです。彼は私には\n彼は私に手をかけることはありませんが、時々、彼が私に言うことよりもいいかもしれないと思うことがあります。\n彼が私に言うことよりもいいかもしれないと思うことがあります。そして、彼は非常に頑固なので、彼の...",
      "title": "夫をどう扱うか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我丈夫有愤怒的问题。我绝对崇拜他，但他唯一知道的情绪是\n他唯一知道的情绪就是愤怒，这对我来说是一种压迫。他不会\n他不会对我动手动脚，尽管有时我认为这可能比他对我说的那些话要好。\n他对我说的那些话。而且，他非常固执，所以他的...",
      "title": "如何处理我的丈夫？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我丈夫有憤怒的問題。我絕對崇拜他，但他唯一知道的情緒是\n他唯一知道的情緒就是憤怒，這對我來說是一種壓迫。他不會\n他不會對我動手動腳，儘管有時我認爲這可能比他對我說的那些話要好。\n他對我說的那些話。而且，他非常固執，所以他的...",
      "title": "如何處理我的丈夫？"
    }
  ]
}