{
  "author": "HolyyShib",
  "original_created_utc": 1641771588,
  "title": "This dip is a blessing for those who believe in ₿Itcoin’s long term value",
  "created_utc": 1641810880,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;If you actually believe in ₿Itcoin’s inherit value in a world of infinitely printed fiat with a user-base growing at twice the speed of the internet’s user-base growth, a majority of all are dollar cost averaging their income of infinitely printed fiat into ₿Itcoin’s finite Satoshi supply, then you love these dips. &lt;/p&gt;\n\n&lt;p&gt;“The ignorance of the majority is your opportunity.”&lt;/p&gt;\n\n&lt;p&gt;There are corporations and nations adopting it. This is bigger than any sights I saw of Bitcoin’s potential of success ten years ago, so I’m even more excited about its future now than I was then buying the dips and subscribing to this model of though. So take advantage and buy while the world is ignorance. All this now means today is that you’re still plenty early.&lt;/p&gt;\n\n&lt;p&gt;When Bitcoin’s drops are only ten percent from its all time highs, that’s when you know you’ll be late ish and it’s returns long term will be no where near where it’s long term returns are today&lt;/p&gt;\n\n&lt;p&gt;Satoshi speed new guys and OGs. Let’s use the world’s ignorance today to our advantage and stack the sats that they’re too ignorant to today to value&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 322,
  "permalink": "/r/Bitcoin/comments/s051aw/this_dip_is_a_blessing_for_those_who_believe_in/",
  "subreddit": "Bitcoin",
  "id": "s051aw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "If you actually believe in ₿Itcoin’s inherit value in a world of infinitely\nprinted fiat with a user-base growing at twice the speed of the internet’s\nuser-base growth, a majority of all are dollar cost averaging their income of\ninfinitely printed fiat into ₿Itcoin’s finite Satoshi supply, then you…"
}