{
  "author": "Purple-Intern9790",
  "original_created_utc": 1633602892,
  "title": "Just sold all my position on Tesla",
  "created_utc": 1633638792,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>At this point in time I’ve come to realise that the hype around Elon being god is starting to die down in the stock market.</p>\n\n<p>People have stopped throwing money into Tesla believing that they are going to be the biggest company of the planet.</p>\n\n<p>Therefore I’m taking my earnings and I’m going to DCA into mostly BTC but also into AlGO.</p>\n\n<p>I’m seeing BTC mentioned daily in regards to countries slowly adopting as official currency, I see crypto as the next big thing, I believe the next 5 years will be an eye opener for us!</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/Bitcoin/comments/q36819/just_sold_all_my_position_on_tesla/",
  "subreddit": "Bitcoin",
  "id": "q36819",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "At this point in time I’ve come to realise that the hype around Elon being god\nis starting to die down in the stock market.\n\nPeople have stopped throwing money into Tesla believing that they are going to\nbe the biggest company of the planet.\n\nTherefore I’m taking my earnings and I’m going to DCA…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この時点で私は、イーロンが神であるという宣伝文句が、株式市場では沈静化し始めていることに気づきました。\n株式市場では、Elonが神であるという誇大広告が消え始めています。\n\n人々は、テスラが地球上で最大の企業になると信じて資金を投じるのをやめました。\n地球上で最大の企業になると信じて、Teslaに資金を投じるのをやめました。\n\nですから、私は収益を得て、DCAに行くことにしました...",
      "title": "テスラのポジションをすべて売却しました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在这个时候，我已经意识到，围绕埃隆是神的炒作\n在股票市场上已经开始平息了。\n\n人们已经不再向特斯拉投钱，认为他们将成为\n成为地球上最大的公司。\n\n因此，我带着我的收入，去DCA...",
      "title": "刚刚卖掉了我在特斯拉的所有头寸"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在這個時候，我已經意識到，圍繞埃隆是神的炒作\n在股票市場上已經開始平息了。\n\n人們已經不再向特斯拉投錢，認爲他們將成爲\n成爲地球上最大的公司。\n\n因此，我帶着我的收入，去DCA...",
      "title": "剛剛賣掉了我在特斯拉的所有頭寸"
    }
  ]
}