{
  "author": "shwaaboy",
  "the_new_excerpt": "I saw a post over in r/relationships [/r/relationships] where a woman saw her\nfriend, the bride to be, blow the male stripper at a Bachelorette party. As you\ncan imagine, 100% of respondents are saying that she should tell the groom to be\nthat his bride to be cheated on her.\n\nHaving said that, I’ve…",
  "original_created_utc": 1621942972,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "r/relationships [/r/relationships]で、ある女性が独身最後のパーティーで友人の花嫁が男性ストリッパーをフェラしているのを見たという投稿を見ました。\n友人の新婦がバチェロレッテ・パーティで男性ストリッパーをフェラしているのを見たという投稿がありました。ご想像の通り\n想像できると思いますが、100％の回答者が、彼女は新郎となるべき人に\n新婦が浮気したことを新郎に伝えるべきだと答えています。\n\nそうは言っても、私は...。",
      "title": "バチェラー・パーティーは手に負えなくなっている？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在r/relationships [/r/relationships]上看到一个帖子，一个女人看到她的\n一个女人看到她的朋友，即将成为新娘的人，在一个单身派对上给男脱衣舞者吹箫。正如你所想象的那样\n可以想象，100%的受访者都说她应该告诉新郎\n说他的准新娘欺骗了她。\n\n说到这里，我已经...",
      "title": "单身派对是否已经失控了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在r/relationships [/r/relationships]上看到一個帖子，一個女人看到她的\n一個女人看到她的朋友，即將成爲新娘的人，在一個單身派對上給男脫衣舞者吹簫。正如你所想象的那樣\n可以想象，100%的受訪者都說她應該告訴新郎\n說他的準新娘欺騙了她。\n\n說到這裏，我已經...",
      "title": "單身派對是否已經失控了？"
    }
  ],
  "title": "Are bachelor parties getting out of hand?",
  "created_utc": 1621954581,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I saw a post over in <a href=\"/r/relationships\">r/relationships</a> where a woman saw her friend, the bride to be, blow the male stripper at a Bachelorette party. As you can imagine, 100% of respondents are saying that she should tell the groom to be that his bride to be cheated on her. </p>\n\n<p>Having said that, I’ve been to many ‘typical’ bachelor parties where the female strippers do all sorts of stuff to the men including rubbing the bachelor’s hands all over her breasts and genitals, squatting over his face while the bachelor holds a dildo in his mouth, motorboating, eating strawberries out of her pussy, dominating behaviour and pouring hot wax on them, etc. </p>\n\n<p>While I’m heavily against this sort of behaviour, most of the time this seems to be the norm and is socially acceptable to the rest of the male audience, who eggs them on the entire time. </p>\n\n<p>Why is it considered ok and would women be ok with it if they knew or are they just turning a blind eye to it?</p>\n</div><!-- SC_ON -->",
  "score": 115,
  "permalink": "/r/TooAfraidToAsk/comments/nknplv/are_bachelor_parties_getting_out_of_hand/",
  "subreddit": "TooAfraidToAsk",
  "id": "nknplv",
  "is_self": true,
  "media": null,
  "is_video": false
}