{
  "author": "throwaway838279",
  "original_created_utc": 1643326317,
  "title": "Why are men more likely to find racist, sexist, homophobic, etc. jokes funny compared to women?",
  "created_utc": 1643347127,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Like there are quite a bit of men that I know that just find those jokes funny and call it &amp;quot;dark humor&amp;quot; when it&amp;#39;s not that funny at all. I know hardly any woman that finds any of those types of jokes funny.&lt;/p&gt;\n\n&lt;p&gt;Edit: Y&amp;#39;all, I&amp;#39;m not talking about these jokes being found offensive. I can take an offensive joke. I&amp;#39;m talking about how they&amp;#39;re just not funny.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/sec1hj/why_are_men_more_likely_to_find_racist_sexist/",
  "subreddit": "TooAfraidToAsk",
  "id": "sec1hj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Like there are quite a bit of men that I know that just find those jokes funny\nand call it \"dark humor\" when it's not that funny at all. I know hardly any\nwoman that finds any of those types of jokes funny.\n\nEdit: Y'all, I'm not talking about these jokes being found offensive. I can take\nan…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の知る限りでは、そのようなジョークを面白がる男性もかなりいるようです。\nを「ダーク・ユーモア」と呼んでいます。私はほとんど知りません。\nを、「面白い」と感じる女性はいません。\n\n編集部：皆さん、私はこれらのジョークが不快に感じられるという話をしているのではありません。私は\nを...",
      "title": "なぜ男性は女性に比べて、人種差別、性差別、同性愛などのジョークを面白いと思う傾向があるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我认识的很多男人都觉得这些笑话很有趣\n并称其为 \"黑色幽默\"，其实根本就不好笑。我知道几乎没有任何\n女人觉得这些类型的笑话有趣。\n\n编辑：各位，我说的不是这些笑话被认为具有攻击性。我可以接受\n一个...",
      "title": "为什么与女性相比，男性更容易发现种族主义、性别歧视、恐同症等笑话很有趣？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我認識的很多男人都覺得這些笑話很有趣\n並稱其爲 \"黑色幽默\"，其實根本就不好笑。我知道幾乎沒有任何\n女人覺得這些類型的笑話有趣。\n\n編輯：各位，我說的不是這些笑話被認爲具有攻擊性。我可以接受\n一個...",
      "title": "爲什麼與女性相比，男性更容易發現種族主義、性別歧視、恐同症等笑話很有趣？"
    }
  ]
}