{
  "approved_at_utc": null,
  "subreddit": "wallstreetbets",
  "selftext": "In this Gay Pride Month due diligence, prepare for a [sack-rubbed finish](https://www.google.com/search?q=sack+rubbed+finish) as you learn about this load-bearing home builder that reports tomorrow.\n\nA brief overview: Housing demand is at 2005 levels, during a major housing shortage that will take a decade to sort out. Commodity prices don't matter -- buyers are paying. Evidence? Data says so, CEOs say so, and LEN just blew out earnings and went up 10%. **KBH earnings are coming up Wednesday and it tends to roll with LEN, so I'm rolling the dice with KBH on July/Aug calls, plus commons because gay pride.**\n\nAnnoyingly long TLDR below, then I get gay.\n\n\\-----------\n\nThe residential construction market is hot, despite high prices:\n\n* Demand is insane. **We are essentially in 2005**: High housing market index. High housing starts. High orders.\n* High commodity costs are a non-issue -- **prices get passed on to buyers.**\n* KBH caters to the exact demographic with the highest demand: first-time buyers, west + central.\n* Residential construction stocks are down from Mid-may due to The Great Inflation Scare, and haven't recovered yet.\n* Real estate is generally thought of as an \"inflation proof\" investment.\n* Whether or not there is inflation, people are going to buy houses at record pace for the foreseeable future.\n\nAll signs point to a great KBH earnings report (Wednesday after close):\n\n* All of the above.\n* LEN has the same earnings calendar. They reported last Wed (Jun 16). Result? Blowout. Popped up 10% in two sessions.\n* LEN had no problem building homes, taking orders, and increasing margins despite high costs.\n* KBH tracks LEN share price rather consistently -- and KBH hasn't moved yet. I see 10% upside, easy.\n* I scraped a housing review site. Results are inconclusive, but if you squint they look bullish.\n* Commodities may be entering a bear market, which may cause higher guidance (lower commodity prices == higher margin).\n\nI Like The Stock:\n\n* Massive cashflow, massive backlog of orders, massive orders getting added.\n* In the right place at the right time: West and central regions.\n* CEO made the news when he called neighbor Kathy Griffin a \"bald dyke\" and \"cunt\" after she made a noise complaint on his 3 grandchildren swimming in his pool. Bullish.\n\nJuly/Aug calls:\n\n* A bet on positive earnings Wednesday, following in LEN's footsteps.\n* A bet on a \\~10% catch-up to LEN, as they generally track one-another and LEN is up.\n* Housing market is clearly bullish and I see no reason it will slow down.\n* Many builders report in July, so Aug calls could bang.\n* Risk/reward seems solid.\n\n\\-----------\n\n# I. Housing Supply Shortage, and Historic Demand Levels\n\nThe current housing situation, for builders, is better than any erection drawing they've ever seen:\n\n* The supply of homes was already at a shortage -- about 5.5 million houses too few.\n* People were already moving out of cities and into suburbs.\n* Then COVID caused the move-to-suburbs trend to massively accelerate, leading to a surge in home demand.\n* COVID dampened the ability to construct homes, causing even more supply deficit.\n* **So we now have massive demand, and short supply.**\n* The people moving tend to have a lot of money, and they're buying despite high costs.\n* We are now at \\~2005 levels: housing starts, orders, sentiment; all skyrocketing.\n* It may take a full decade to build enough houses to satisfy the current demand.\n\n## SUPPLY: The Great Housing Shortage\n\nCOVID caused construction to slow. Everybody had to quarantine and wear masks and shit. Unprecedented times. It was a really hard period that has changed us all forever and bla bla bla.\n\nAll that matters for us is: **home construction slowed, during a period where people increasingly wanted to move into houses, and after a period where there weren't enough houses already.**\n\nOn June 18th, The National Association of Realtors released a report titled \"Underbuilding Left America Short 5.5M to 6.8M Homes\", [it's here (but behind a paywall)](https://www.bankerandtradesman.com/nar-underbuilding-left-america-short-5-5m-to-6-8m-homes/). You may choose not to believe NAR, which could be described as a lobbying group, in which case you can [read this discussion on Reddit](https://www.reddit.com/r/realestateinvesting/comments/o1458f/why_does_the_media_treat_the_national_association/).\n\nThat NAR report is behind a paywall, but [the WSJ wrote a piece about it here](https://www.wsj.com/articles/u-s-housing-market-needs-5-5-million-more-units-says-new-report-11623835800), which I'll quote just to give you an idea of how severe the supply shortage is:\n\n**Shortage existed Pre-COVID:**\n\n>The report also says that from 2010 to 2020, new-home construction fell 6.8 million units short of what was needed to meet household-formation growth and replace units that were aging or destroyed by natural disasters.\n\n**Housing prices are up, but demand is still bottlenecked by supply:**\n\n>Limited supply has been a recent driver of rising housing prices for renters and home buyers, alongside robust demand.  \n>  \n>The supply shortage became especially acute in the past year. Builders slowed construction in some regions last spring and delayed land purchases because of the Covid-19 pandemic. In addition, low mortgage-interest rates and an increase in remote work led to a surge in demand for single-family housing. And many homeowners delayed or canceled plans to list their homes for sale.  \n>  \n>Builders ramped up the pace in 2020 in response to robust demand. **Housing starts, a measure of home-building activity, rose last year to 1.38 million units, the highest rate since 2006. But shortages of labor, ready-to-build land and materials have limited the pace of construction growth, builders say.**\n\nWhat do you reckon will happen to KBH if/when they announce better access to labor and materials? Have you noticed that lumber and copper have gone down significantly since May?\n\n**Builders will need to build at an incredible rate:**\n\n>To shrink the supply deficit, builders would need to exceed the long-term historical average pace of 1.5 million units a year, according to the NAR report. At 2.1 million units a year, near the level reached in 2005, it would take a decade to close a gap of 5.5 million units, the report says.\n\nSo there you have it: **not enough homes, and a surge in demand.** Builders have a lot of [back-filling](https://www.google.com/search?q=back+filling) to do, and believe me, they are happy to do it. **This construction boom is going to last.**\n\n## DEMAND: The Great Migration\n\nIt's no secret that COVID jump-started a massive migration out of cities. Arguably, COVID just accelerated an already occuring trend of people leaving cities (most evident in SF and NYC). **What's important here is where people are moving, and who is moving. Keep in mind KBH targets first-time home buyers and is largely based in CA, WA, CO, and TX.**\n\n## Where are people moving? (West + Central)\n\n[This article from Bloomberg (April 26, 2021)](https://www.bloomberg.com/graphics/2021-citylab-how-americans-moved/) provides some amazing infographics and far more information than I can fit into my smooth, [butt-glazed](https://www.google.com/search?q=butt+glazed) brain. But my takeaway is this:\n\n&#x200B;\n\n[People are moving out of cities, and into suburban counties.](https://preview.redd.it/hrm3gakywu671.png?width=1204&format=png&auto=webp&s=ecc673a4c2d78979a91a7e4596d30d25617ca1e3)\n\nThis quote says it all:\n\n>82% of urban centers saw more people moving out then in. 91% of suburban counties saw more people moving in than out.\n\nCities are seeing some serious [shrinkage](https://www.google.com/search?q=wood+shrinkage), while suburbs are [rising damp](https://en.wikipedia.org/wiki/Rising_damp_(structural)).\n\n[This article from CNBC (April 15, 2021)](https://www.cnbc.com/2021/04/15/millennials-moving-out-of-big-cities-where-they-are-going-smartasset.html) highlights where millennials are moving to the most:\n\n* Denver (CO)\n* Seattle (WA)\n* Phoenix (AZ)\n* Austin (TX)\n* Colorado City (CO)\n\nNotice anything? **KBH operates in six states -- and all of them are on this list. KBH also caters to first-time buyers (millennials).**\n\n## Who is moving?\n\n[This Bloomberg article](https://www.bloomberg.com/news/articles/2021-05-14/rich-americans-likelier-to-move-house-reversing-pre-covid-data) provides insight:\n\n&#x200B;\n\nhttps://preview.redd.it/xsqnmxqzwu671.png?width=649&format=png&auto=webp&s=4cddf1958ef4c02c778ccc1c987074aa95f662c6\n\nSome quotes:\n\n>High-earning Americans are now likelier to move house than low earners in a reversal of the usual pattern, according to new research, as the pandemic offers remote-work opportunities to white-collar employees.  \n>  \n>The biggest jump in residential migration has come among workers earning more than $150,000, according to analysis by Apartmentlist.com based on Census Bureau surveys. About 16% of that group relocated in the past year, up from 11.5% in 2019.\n\nThey were already moving before. Now they're really moving.\n\nDo not misconstrue this as \"the rich are the *only* people moving\" -- they're just moving at higher rates than previously. As costs go up, there is plenty of demand willing to pay.\n\nThat's great they are moving -- but does this equate to new house purchases? Keep reading.\n\n## Sentiment (HMI): Up (esp. West + Central)\n\nThis is one of those index numbers that comes out each month, and when it does the market sometimes goes batshit crazy and pumps or dumps real estate related stocks. Values >50 are bullish, <50 are bearish. Lately it's been on the [wac track](https://www.google.com/search?q=wac+track) upwards.\n\n>The NAHB/Wells Fargo Housing Market Index (HMI) is based on a monthly survey of NAHB members designed to take the pulse of the single-family housing market. The survey **asks respondents to rate market conditions for the sale of new homes at the present time and in the** ***next six months*** as well as the traffic of prospective buyers of new homes.\n\n[Here are the latest numbers](https://www.nahb.org/-/media/NAHB/news-and-economics/docs/housing-economics/hmi/202106/t1-nahb-wellsfargo-national-and-regional-hmi-202106.xls), released Jun 15th. Historical data is found [here](https://www.nahb.org/news-and-economics/housing-economics/indices/housing-market-index). But don't worry, I'll break it down for you retards.\n\n**We're at all time highs.**\n\n&#x200B;\n\n[HMI numbers at all-time highs.](https://preview.redd.it/il6qwpv0xu671.png?width=699&format=png&auto=webp&s=794457786899453d0212feebde97ae3ccb888aab)\n\nAnd how does this break out, regionally?\n\n&#x200B;\n\n[Recent HMI numbers by region \\(KBH Q2 highlighted\\)](https://preview.redd.it/qu8063b2xu671.png?width=666&format=png&auto=webp&s=6123485dad7d7c5743b2bf2cb434da681842e002)\n\nNotice which regions have the highest numbers for Q2? I made it bluer than your balls just for you. That's right, you stud, South + West. Keep in mind, \"South\" basically means \"Texas\", which KBH would consider \"Central\". **So we have record high sentiments in West and Central during Q2. Can you remember in which regions KBH builds?**\n\nSo, yeah, **demand is at historic levels, particularly in the regions KBH caters to, despite prices being high.**\n\n## Housing starts: Up (esp. West + Central)\n\nIs this *real* demand, or just, people saying: \"Yeah, I want a house. The Wendy's parking lot just isn't doing it for me.\"\n\nIt's real.\n\n&#x200B;\n\n[Housing starts in the last year. Up.](https://preview.redd.it/sedtyfe3xu671.png?width=709&format=png&auto=webp&s=5a17f07e5bc920baa6ecf8e63ea8c661e2706534)\n\nThis data is from census.gov. Big brother tracks building permit numbers categorized as: authorized, started, under construction, and completed. [Recent data here](https://www.census.gov/construction/nrc/index.html). [Historical data here](https://www.census.gov/construction/nrc/historical_data/index.html).\n\nYou can see the \"started\" numbers are going up and up, **despite the price of commodities rising since at least October.**\n\nLet's zoom out, and once again take a look at *where* all this building is taking place:\n\n&#x200B;\n\n[Housing starts by region since 1990 alongside HPI.](https://preview.redd.it/r6puw6r9xu671.png?width=780&format=png&auto=webp&s=b12fd23f12b324e1a0762a2cf737705197a60a65)\n\nI added the housing price index to this graph:\n\n>The FHFA HPI serves as a timely, accurate indicator of house price trends at various geographic levels.\n\nIt doesn't adjust for inflation. In fact, some would argue it's a pretty good measurement of inflation. **Regardless, you can houses are being built at 2003 levels despite the high prices.**\n\nAnd where are they being built? West and South (aka Texas, aka KBH's \"Central\")? West and Central, again.\n\nSo there you have it. Record demand, and skyrocketing building rates, without a fuck given about prices. **KBH must be salivating at the thought of all that oozing caulk.**\n\n\\-----------\n\n# II. The Commodities Boogeyman (High prices don't matter)\n\nOk, so you have a picture of the crazy demand and crazy short supply of houses. Now let's address the boogeyman on everyone's mind: the spike in commodity prices.\n\nDo not fear high commodity prices. **The spike in commodity prices is a direct result of the boom in residential construction (and surge in demand) -- prices are high because the market is willing to pay.**\n\n**TLDR:**  Houses use a lot of lumber and copper. High lumber and copper prices are a *consequence* of the insane demand for houses, are passed on to the consumer, and do not impact margins. As commodity prices fall, builders stand to increase their margins. Bullish. As. Fuck.\n\n## Lumber and Copper\n\nThe same shit that happened to home building happened to lumber and copper. Shut downs in production from COVID, but an increase in demand afterward -- largely driven by residential construction.\n\nFrom [this source](https://www.copper.org/education/c-facts/home/), residential construction accounts for a full 1/3rd of the usage of copper.\n\nResidential construction also accounts for some massive percentage of lumber usage. I can't be arsed to look it up, but just think of all the [rim joists](https://www.google.com/search?q=rim+joist), [batter boards](https://www.google.com/search?q=batter+board), etc, that go into a house. My point: **the surge in home building, where the demand is so high, means copper and lumber get bid up**.\n\n**The costs get passed on to the buyers**, and the market will show you as much. Look: lumber and copper prices skyrocket, but KBH and LEN stocks barely flinch.\n\n&#x200B;\n\n[KBH and LEN don't care about commodity prices](https://preview.redd.it/cnalsz78xu671.png?width=1828&format=png&auto=webp&s=f4eaa9bb6afea1196f74af2e4aa3b559c1af9593)\n\nI will cover the price dip that occurred in May in section III.\n\nSo don't worry about high commodity costs -- the demand for them is high from housing, but the supply is taking time to catch up from COVID. **Despite commodity prices going higher, demand is still insane and houses are getting built.**\n\n## Increasing deliveries, increasing home starts\n\nYou might still be unconvinced that high commodity prices don't matter to home purchasers. Even after I already fucking explained how high demand is, how high HMI numbers are, and that the rampant rush on building houses is what is actually causing the high commodity prices in the first place.\n\nIf you don't believe me, take that [sex bolt](https://en.wikipedia.org/wiki/Sex_bolt) out of your [stud pocket](https://www.google.com/search?q=stud+pocket) and look at the charts below.\n\n&#x200B;\n\n[Orders, deliveries, and house starts. Up and up.](https://preview.redd.it/ht704fcdxu671.png?width=653&format=png&auto=webp&s=e323ae8d31d3f06440c61e33f6ac0947c515fdaa)\n\n(Note: Q1 for these companies is: Dec, Jan, and Feb)\n\nLook at the light blue bars. Does it look like inflation and commodity prices are of any concern to the people ordering homes?\n\n\\-----------\n\n# III. The Great Inflation Scare of May\n\nLet me recap what happened in mid May: People emptied their [weep holes](https://www.google.com/search?q=weephole) due to inflation. Their [butt-welds](https://www.google.com/search?q=buttweld) simply burst from fears the world was ending.\n\nLEN got [bush hammered](https://en.wikipedia.org/wiki/Bush_hammer) from $51 down to $44, and now hovers at $43 as there's some rotation back to tech and the market circles in a landing pattern with no conviction of where to land.\n\n**Yet.. conditions for builders have only improved since May**:\n\n* KBH has stated costs could be passed on to buyers.\n* LEN has proven costs could be passed on to buyers in Q2, and actually increased their margins in Q2.\n* **Copper and Lumber costs have tumbled since May, which will further increase margin.**\n\nInflation or not, KBH is printing money hand over fist, will reveal this in Q2 earnings, and will continue to crush Q3 and Q4 aided by lower prices of commodities and continued strong demand and shortage in supply.\n\n## Buyers will pay, CEOs say.\n\nYou don't have to trust fancy graphs and those squiggly whatsits... numbers. You can see what LEN and KBH execs have openly said about the effects of rising commodity prices. Well, *you* personally probably won't, but I did.\n\n## KBH Q1 transcript (March 24)\n\n>So no, I'm not overly concerned at this point. In fact, we've been confident enough and thought about the year favorably enough to lift the margin guidance as we go. So **we're actually even feeling a little bit better about our profitability than we were three months ago.**\n\nHigher lumber costs... and yet higher profitability? How's that possible? Oh, right. People want to live in homes rather than in the Wendy's parking lot, and will pay for it.\n\n## KBH CEO (May 6)\n\nTaken from [here](https://www.cnn.com/2021/05/05/business/lumber-prices-home-building-costs/index.html).\n\n>**While lumber prices have gone up, we have been able to pass it on to the consumer with higher prices for homes.** \\- KBH CEO Jerffrey Mezger\n\nThat pretty much says it all.\n\n## LEN Q2 earnings transcript (Jun 17)\n\nNo need for conjecture -- let's see how this quarter *actually* panned out for LEN so far, which just reported earnings last week.\n\n>Q4 of 2020 is when we saw the first significant increase in lumber costs, which impacted primarily our Q2 deliveries. The lumber increases, which occurred in Q1 and Q2, will mostly flow through our deliveries in the second half of the year. But as we noted and Diane will cover more detail, we believe that Lennar's pricing power will more than offset this and we expect to deliver stronger gross margins.\n\nThe true test will be Q3 and Q4, where the high prices of lumber will have had the largest impact.  But as for now, yeah, **their margins actually increased**. I think we will hear the same story with KBH on Wednesday.\n\nAlso from this transcript:\n\n>Looking forward, we expect to see some limited relief on our lumber costs for our July starts as more expensive lumber works its way through the system. And if the current downward trend holds, we'll see a more significant benefit for August starts.\n\nYou catch that? Margins managed to increase during high lumber prices in Q2. So what will happen in Q3 and Q4 if lumber continues to decrease? (It peaked in May). Yeah. More margin, creating an [ultimate load](https://en.wikipedia.org/wiki/Ultimate_load) of profit.\n\n## Expect a recovery from Q2 and beyond\n\n**The stock price has yet to recover from May. I'm betting it will.**\n\nThere is no reason these stocks should be cheaper than they were in May. There is every indication they are doing *better* than they were in May:\n\n* Inflation or not, people are buying houses\n* More orders\n* More housing starts\n* Higher HMI sentiment\n* LEN proved costs don't matter, they increased their margins\n* And, now: there's LOWER cost of material\n\n\\-----------\n\n# IV: Canary in the Tendies Kitchen - Where LEN goes, KBH follows.\n\nBoth LEN and KBH share the same weird corporate calendar where their quarters are set back a month. So, Q1 is Dec/Jan/Feb, and Q2 is Mar/Apr/May.\n\nLEN posted earnings last week. They crushed it and surged 10% in the two trading sessions afterward. So to the extent that market conditions are working in the favor of LEN, they are most likely working in favor of KBH as well.\n\nAlso from the LEN Q2 Earnings Call (Jun 17):\n\n>The strongest market in the United States today is Austin. Notwithstanding outmigration from parts of California, the markets in California are strong. Driven by the state's severe housing shortage, there is more demand and supply, making housing the No. 1 agenda item for the governor.\n\nOk guys.. same quiz: Where does KBH do most of their business? Say it with me class: West and Central.\n\nWhat else did LEN Q2 earnings reveal?\n\n* LEN says demand is still strong.\n* LEN says lumber costs not an issue -- they get passed on to the buyers.\n* LEN delivered more houses than last quarter.\n* LEN took more orders than last quarter.\n* LEN increased margin their margin.\n\nBasically, they are building as fast as possible and still continuing to grow their backlog. Looking good for KBH.\n\n**Now, take a look at this chart showing the relationship between LEN and KBH.**\n\n&#x200B;\n\n[LEN up, will KBH follow?](https://preview.redd.it/cbltxfmgxu671.png?width=1828&format=png&auto=webp&s=559a0ff34f6386101ce95f2850c92f8f6aa21c43)\n\nDo you see what I see? **Where LEN leads, KBH follows. And LEN just gapped up.**\n\nThis isn't a sure-fire bet -- LEN could simply retrace downwards or the LEN/KBH spread can persist for awhile, or just fail to be a thing in the future. However, I'm a gambling man, and I'm betting on this.\n\n## Housing Starts and Deliveries\n\nLet's compare LEN's houses ordered and delivered (vs census.gov housing starts) to KBH.\n\n&#x200B;\n\n[They're both kicking ass.](https://preview.redd.it/runaqdfixu671.png?width=653&format=png&auto=webp&s=8cb342969f75cc842f6256404019754a85888cfb)\n\nThe key stat here is as housing starts increase, so do homes delivered. And housing starts have indeed increased. **Housing starts hit 4,814 in KBH-calendar Q2, which is a 3-month total not seen since... October 2006.**\n\nNow maybe you want to think of yourself as some sort of clever Steve Carrell character, and that we're in a housing bubble. Or maybe you think you're that retarded glass-eye drummer dude. You do you, and sit there and whine about how the market is going to crash. I'll be that rich asshole asian guy at the restaurant whose net worth exceeds yours... because I'm betting big on KBH.\n\nFor real though, there aren't really any signs there is a bubble. This is purely demand outstripping supply.\n\nIf that many housing starts were issued, then builders were at it full force. I see no reason why KBH would be excluded from the frenzy. I think their deliveries will be up, and their orders up, further increasing their insane backlog. I also think their margins will increase, just like LEN's. They have pricing power.\n\n**I'll take the bet that KBH blows out earnings just like LEN.**\n\n\\-----------\n\n# V: Scraping a Reviews Website\n\nOn the topic of trying to predict deliveries -- I found [a website that allows homebuyers to write reviews](https://www.newhomesource.com/builder/kb-home/reviews/5). Perhaps there's a correlation between how many reviews are written, and how many houses KBH ends up delivering?\n\n**So I set up a scraper and pulled all the reviews.** The dates, locations, scores, everything, for three major builders: LEN, PHM, and KBH.\n\n## Average review scores by quarter\n\nKBH is absolutely killing it:\n\n|Quarter|KBH - Avg Score|LEN - Avg Score|PHM - Avg Score|\n|:-|:-|:-|:-|\n|2021Q2|4.61|4.19|4.00|\n|2021Q1|4.61|3.84|4.18|\n|2020Q4|4.59|4.00|4.15|\n|2020Q3|4.51|3.71|3.85|\n|2020Q2|4.50|3.68|3.98|\n|2020Q1|4.56|3.45|3.84|\n\n## Correlation between review count and homes delivered?\n\nNext, I tallied the number of reviews per quarter. Yes, I was careful to match the review date to the proper quarter, given LEN and KBH's weird quarterly schedule (eg: Q1 = Dec, Jan, Feb). I also took each review day and subtracted 7 days from it, to better estimate the day the house was actually delivered, since there is likely a delay between completion and writing a review.\n\nI plotted this against the actual number of homes delivered, as reported on quarterly earnings. The theory here: **Perhaps there's a correlation between the number of reviews written, and how many houses get delivered?** That would allow us to predict this quarter's numbers.\n\n&#x200B;\n\n[If you squint, maybe there's a correlation](https://preview.redd.it/y0ex0lzjxu671.png?width=719&format=png&auto=webp&s=2be1d6126ed161679e35c37d99aa17dbf60d6e20)\n\nIt doesn't look like there is any strong correlation.\n\nHowever, if you omit Q1 data, it looks pretty good:\n\n* Anytime review count decreases, homes built decreases.\n* Anytime review count increases, homes built increases.\n* Review count, if anything, *underestimates* the amount of homes built.\n\n**There's a spike in Q2 reviews, so I'd like to believe that will put the number of homes built at or above 3,500. But, honestly, I wouldn't bet on it just from this data.**\n\n\\-----------\n\n# VI: The Company\n\nIf you read the entire post up to here, you're a fucking dumbass. You could have just read the TLDRs. Needless to say, it's pretty obvious that residential construction is going insane right now. I'd be happy to own pretty much any residential construction stocks over the junk you guys have been shilling lately. Green beans? Wrestling? Seriously? Who the fuck are you people.\n\nThis is a short term play -- I'll be in and out by August, maybe September -- but whatever... let's go over some basic shit about this company. I'll use this section to be a wise ass since I've been holding back for most of this DD and I've written you all a novel at this point.\n\n**Seriously, though, you should read** [**their Q1 investor presentation**](https://s27.q4cdn.com/984711554/files/doc_presentations/2021/FINAL-Q1-2021-KBH-IR-Presentation-revised-4-13-2021.pdf)**. It is very compelling.** Yeah, I know, I'm lazy. Cut me some slack.\n\nHere are some highlights:\n\n## The right place at the right time\n\nKBH is home residential construction company that builds using the \"build-to-order\" model. The come up with house models, then let you select how balls deep you want to go with the upgrades. I won't go into the details of BTO (it's in the presentation), but suffice it to say they are really good at efficiently nailing your mom's drywalls.\n\n&#x200B;\n\n[From the presentation deck. Go read it.](https://preview.redd.it/99op5a1mxu671.png?width=835&format=png&auto=webp&s=0fde082909e67eee6c8b285eb235af665ecba755)\n\nA key aspect of this company is where they do business. Yes, again, WEST AND CENTRAL. **66% of their deliveries and 72% of their revenues are from CA, WA, TX, and CO.** They're right in the middle of where the highest demand is, and as such, I believe this gives them an advantage in capturing higher average costs and margins than their competitors.\n\nAnother advantage is their early earnings schedule, which is a full month before basically the rest of the industry (except LEN). I believe the market is slow to adjust prices on the whole industry until they see the bigger guys (DHI, PHM, NVR, TOL) report first. Luckily, LEN reported before KHR and the results were exceptional. That's enough for me.\n\nResidential construction is currently going through a *generational* boom right now, and though a rising tide lifts all ships... I'm putting my chips on KBH for now.\n\n## Billions in the backlog\n\nLook at this beautiful backlog grow, and look at the quarterly orders grow.\n\n&#x200B;\n\n[Backlog and orders up and to the right. In the billions.](https://preview.redd.it/cydnqjnnxu671.png?width=532&format=png&auto=webp&s=ead36155d9fccd21e31dcadb7bbcd951756afd76)\n\n## ESG Crap - EnergyStar\n\nThis plays to their soy boy customer base (millennial first time buyers). They won the \"EnergyStar 2021 Partner of the Year\". Yeah, there are actually like thirty companies that win this every year, but nonetheless the stats are kind of neat:\n\n>Apr 13, 2001: KB Home (NYSE: KBH) today announced that it has been named an ENERGY STAR Partner of the Year â€“ Sustained Excellence Award Winner for an unprecedented 11th consecutive year by the U.S. Environmental Protection Agency (EPA). KB Home has built over 150,000 ENERGY STAR certified homes, more than any other homebuilder in the nation. These high-performance, energy-saving homes are estimated to have cumulatively reduced utility bills for their homeowners by $800 million and CO2 emissions by 5.6 billion pounds, the equivalent of removing nearly 557,000 cars from the road for one year.\n\nIt's kind of suspicious that they measure CO2 emissions in pounds, because it's a gas so I have no idea how they managed to put it all on a scale. But, anyway, apparently all of the high-tech environmentally friendly crap they put in their houses cuts monthly expenses from $343 to $130 per month, meaning their houses basically pay for themselves in 195 years or so.\n\n## ESG Crap - School Supplies\n\nI found this touching photo in their investment deck. It's truly heartwarming that they send school supplies to poor schools -- it's probably the least they can do as they migrate high-tax-paying individuals out of cities and leave *those* schools desperately needing funding.\n\n&#x200B;\n\n[Look, we give money to poor students after we lure their school's tax dollars away](https://preview.redd.it/1igqxc1pxu671.png?width=679&format=png&auto=webp&s=08c4c2c936e4e4befb6308d5e07807be40de0875)\n\n## The [King Stud](https://www.google.com/search?tbm=isch&as_q=king%20stud) (CEO)\n\nHere's a fun story. Back in Sep 2017 KBH CEO Jeffrey Mezger was recorded [verbally destroying Kathy Griffin and her boyfriend Randy \"No Dick\" Bick](http://www.huffingtonpost.com/entry/kathy-griffin-jeffrey-mezger-kb-home_us_59c145aee4b0186c22061a67) after they called police multiple times to report a noise complaint against him. The noise? Mezger's three grandchildren playing in the pool.\n\nIn the audio you can hear Mezger declare war, tell Mr. Bick he's stuck with a \"bald dyke cunt\" (apparently Griffin shaved her head?), and other fun shit.\n\nApparently Ms. Griffin and Mr. Bick had called police between 7 to 10 times in the past, and in each case the complaints were dismissed with no further action required. One of the times they called a noise complaint due to music being played during a ceremony where Mezger's niece, who has stage-4 cancer, was renewing her vows.\n\nDue to the Griffin incident, KBH ended up cutting Mezger's salary by 25%. He never apologized, though he \"regrets losing his temper and the language he used.\" He also added \"Why the fuck would you record it and submit it to Huffington Post you insignificant attention whore?\"\n\nHere's the [WSJ's coverage of the ordeal](https://www.wsj.com/articles/kb-home-cuts-ceos-bonus-over-kathy-griffin-tape-1505993665).  The top comment:\n\n>He deserves an award not a punishment\n\nDon't fuck with Mezger.\n\n\\-----------\n\n# VII. The Bet\n\nWelcome to my DD. You probably just skipped down to here, so let me summarize things for you.\n\n## TLDR (again)\n\nHousing demand is at 2005 levels, during a major housing shortage that will take a decade to sort out. Commodity prices don't matter -- buyers are paying, and in fact that's what's costs so high. Evidence? HMI index at all time highs. Housing starts at 2005 levels. Orders way up. And CEOs are saying costs are getting passed on without an issue.\n\nThe kicker: LEN and KBH report a full month before all the other builders. LEN reported last week, and they blew out earnings and went up 10% (and their margins *went up* despite commodity prices increasing). The market didn't give KBH a similar boost, and their earnings are coming up Wednesday -- which I can only assume will kick ass. I've also noticed that KBH tends to highly correlate with LEN and catches up to rather quickly.\n\nThe second kicker: Builders peaked in share prices in May, but got dumped down due to The Great Inflation Scare in mid-May. The thing is, homes are considered inflation proof. And literally every sign has pointed to better conditions now than in mid-May. Higher sentiment, more starts, and LEN crushed it Q2 (Mar, Apr, May). There is no end in sight to the demand. These stocks are due for a repricing.\n\n**Like LEN, I think KBH built a lot of houses this quarter, took record numbers of orders, and increased margins despite high commodity prices -- I think the market might get all excited after their earnings Wednesday (after close).** If not then, then in mid/late July when all other builders report.\n\n## Catalysts\n\n* Wednesday, 10am: [June new home sales report comes out](https://www.census.gov/construction/nrs/pdf/newressales.pdf). Will it continue to smash? Yes. Will the market react? I don't know.\n* KBH Q2 Earnings (Wed after market close): There is every indication home building was insane this quarter. Highest 3-month building starts since 2005. All time high buyer sentiment. And LEN crushed it.\n* Time elapses: LEN and KBH have been tethered together for awhile, and LEN just leaped up 10%. I think KBH will follow. (Section IV)\n\nThroughout July and August, various residential construction companies report earnings. A continued stream of positive earnings could be what the nervous market is waiting for before diving back in, as they seem rather hesitant since mid-May:\n\n* July 22nd: DHI Q2 earnings.\n* July 22nd (est): PHM Q2 earnings.\n* July 22nd (est): MTH Q2 earnings.\n* July 23rd (est): NVR Q2 earnings.\n* July 26th (est): MDC Q2 earnings.\n* July 28th (est): BZH Q2 earnings.\n* Aug 15 (est): TOL Q2 earnings.\n\nLonger term, there could be more COVID; there are concerns about the delta variant. While another surge of corona could cause some panic in the market, it would serve to bolster demand further (if that's even possible). KBH crushed it during COVID, so I expect they'd crush COVID-2.0.\n\n## Bets\n\nThis is not financial advice and I'm gay and retarded. I'm into all sorts of crazy shit. [Single hung](https://www.google.com/search?q=single+hung+window), yeah... [double hung](https://www.google.com/search?q=single+hung+window), better. [Tongue and groove](https://en.wikipedia.org/wiki/Tongue_and_groove), [male couplings](https://www.google.com/search?q=male+couplings), [spider nuts](https://www.google.com/search?q=spider+nuts), I love it all. So you should really question my judgement and do your own research.\n\nOnce again, I advise caution. Do not YOLO. Check prices/IVs and wait for good entries. If you can't snatch July calls at a decent price, wait for things to calm down and go for August. Or, just celebrate pride month with some commons.\n\n## July Calls\n\nThere are no FDs, but July calls are fine. They give some leeway for the market to understand commodity prices don't matter, inflation doesn't matter, and that people are ordering and building houses at an astounding rate and will continue to do so.\n\nIn my opinion, the IVs are reasonable in the mid 40s. If the stock hits $50, which I see as entirely possible, it's multi-bagger.\n\n## August Calls\n\nSuitable if you do not have faith KBH will catch up to LEN short term, or if you do not have faith the earnings will play favorably.\n\nThis allows you an extra month to capture the wave of builder earnings coming in July, which could provide the sufficient confirmation of \"they are building a lot despite commodities and inflation\" that the market needs to send these stocks up.\n\nThere's also some rotation of growth-to-value potential here.\n\n## Shares\n\nThe backlog is massive and growing faster and faster. COVID-2.0 or not, inflation or not, people are buying homes and KBH stands to run alongside this current housing bull run. I think shares are a pretty safe play at least until $50.\n\n## My positions\n\n* Jul 16 calls $44-48\n* Aug 20 Calls $50\n* Lots of commons (gay pride month)",
  "author_fullname": "t2_rx33rz7",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 3,
  "clicked": false,
  "title": "$KBH - There's No Place Like Homo",
  "link_flair_richtext": [
    {
      "e": "text",
      "t": "DD"
    }
  ],
  "subreddit_name_prefixed": "r/wallstreetbets",
  "hidden": false,
  "pwls": 7,
  "link_flair_css_class": "dd",
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "media_metadata": {
    "hrm3gakywu671": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 78,
          "x": 108,
          "u": "https://preview.redd.it/hrm3gakywu671.png?width=108&crop=smart&auto=webp&s=54de9e66764156fb63d32744c8d85def9820e459"
        },
        {
          "y": 156,
          "x": 216,
          "u": "https://preview.redd.it/hrm3gakywu671.png?width=216&crop=smart&auto=webp&s=43e32e1d07315e1678942ddd6a5ba4f50aa9643e"
        },
        {
          "y": 232,
          "x": 320,
          "u": "https://preview.redd.it/hrm3gakywu671.png?width=320&crop=smart&auto=webp&s=d8dabdceaba06e0468a6249c6b2b8dc1425a9aa6"
        },
        {
          "y": 464,
          "x": 640,
          "u": "https://preview.redd.it/hrm3gakywu671.png?width=640&crop=smart&auto=webp&s=5a50ef80686759f6443cdd844333e2fd601dc266"
        },
        {
          "y": 696,
          "x": 960,
          "u": "https://preview.redd.it/hrm3gakywu671.png?width=960&crop=smart&auto=webp&s=4387e1c25d32a16fe1bb6fa3697bb024becdc053"
        },
        {
          "y": 783,
          "x": 1080,
          "u": "https://preview.redd.it/hrm3gakywu671.png?width=1080&crop=smart&auto=webp&s=9ce548b23de6e8b763a3b47a19eab14467e5a2bc"
        }
      ],
      "s": {
        "y": 874,
        "x": 1204,
        "u": "https://preview.redd.it/hrm3gakywu671.png?width=1204&format=png&auto=webp&s=ecc673a4c2d78979a91a7e4596d30d25617ca1e3"
      },
      "id": "hrm3gakywu671"
    },
    "qu8063b2xu671": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 36,
          "x": 108,
          "u": "https://preview.redd.it/qu8063b2xu671.png?width=108&crop=smart&auto=webp&s=99a6dbd9d7f465c9690ebc090ea281395d4a7095"
        },
        {
          "y": 72,
          "x": 216,
          "u": "https://preview.redd.it/qu8063b2xu671.png?width=216&crop=smart&auto=webp&s=98a86add4e7a0e7e2b69daaa10313e955ba2bdfc"
        },
        {
          "y": 107,
          "x": 320,
          "u": "https://preview.redd.it/qu8063b2xu671.png?width=320&crop=smart&auto=webp&s=d44836825e07e483c381e306b90db261950bf790"
        },
        {
          "y": 214,
          "x": 640,
          "u": "https://preview.redd.it/qu8063b2xu671.png?width=640&crop=smart&auto=webp&s=1106b2d155f4b8d1129386cee2ee29e30a2ff040"
        }
      ],
      "s": {
        "y": 223,
        "x": 666,
        "u": "https://preview.redd.it/qu8063b2xu671.png?width=666&format=png&auto=webp&s=6123485dad7d7c5743b2bf2cb434da681842e002"
      },
      "id": "qu8063b2xu671"
    },
    "xsqnmxqzwu671": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 64,
          "x": 108,
          "u": "https://preview.redd.it/xsqnmxqzwu671.png?width=108&crop=smart&auto=webp&s=ee7784c6956f9b394cffb416360637e2c303b684"
        },
        {
          "y": 128,
          "x": 216,
          "u": "https://preview.redd.it/xsqnmxqzwu671.png?width=216&crop=smart&auto=webp&s=cf809981aff474de896d2204e20b6439baf4e724"
        },
        {
          "y": 190,
          "x": 320,
          "u": "https://preview.redd.it/xsqnmxqzwu671.png?width=320&crop=smart&auto=webp&s=2abaa278db0b33f7b60900b6384e5510a782ed6e"
        },
        {
          "y": 381,
          "x": 640,
          "u": "https://preview.redd.it/xsqnmxqzwu671.png?width=640&crop=smart&auto=webp&s=926f33be3de058fb3f03c660e8c27371aca0d763"
        }
      ],
      "s": {
        "y": 387,
        "x": 649,
        "u": "https://preview.redd.it/xsqnmxqzwu671.png?width=649&format=png&auto=webp&s=4cddf1958ef4c02c778ccc1c987074aa95f662c6"
      },
      "id": "xsqnmxqzwu671"
    },
    "runaqdfixu671": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 94,
          "x": 108,
          "u": "https://preview.redd.it/runaqdfixu671.png?width=108&crop=smart&auto=webp&s=e8a48088784b0b18ef2ede8715da972d916e2fa2"
        },
        {
          "y": 188,
          "x": 216,
          "u": "https://preview.redd.it/runaqdfixu671.png?width=216&crop=smart&auto=webp&s=c56695f917a2c62185867dcc9a29928e1cdcabcf"
        },
        {
          "y": 279,
          "x": 320,
          "u": "https://preview.redd.it/runaqdfixu671.png?width=320&crop=smart&auto=webp&s=9a426dcb74bc3b149b83a02a8beec83dc8aad198"
        },
        {
          "y": 558,
          "x": 640,
          "u": "https://preview.redd.it/runaqdfixu671.png?width=640&crop=smart&auto=webp&s=b03b4db8db2a09d16237dead67f2455f093f6730"
        }
      ],
      "s": {
        "y": 570,
        "x": 653,
        "u": "https://preview.redd.it/runaqdfixu671.png?width=653&format=png&auto=webp&s=8cb342969f75cc842f6256404019754a85888cfb"
      },
      "id": "runaqdfixu671"
    },
    "ht704fcdxu671": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 94,
          "x": 108,
          "u": "https://preview.redd.it/ht704fcdxu671.png?width=108&crop=smart&auto=webp&s=f9fdb0570db5ee82f947b39c92dbac7055466906"
        },
        {
          "y": 188,
          "x": 216,
          "u": "https://preview.redd.it/ht704fcdxu671.png?width=216&crop=smart&auto=webp&s=b47a53a79898b503015136c987e78077ba8e5001"
        },
        {
          "y": 279,
          "x": 320,
          "u": "https://preview.redd.it/ht704fcdxu671.png?width=320&crop=smart&auto=webp&s=6ada303615a7e07a61a224d8257b2b13ccc5e932"
        },
        {
          "y": 558,
          "x": 640,
          "u": "https://preview.redd.it/ht704fcdxu671.png?width=640&crop=smart&auto=webp&s=e325424303af0a2e05025b19c5c7e86030ed6f22"
        }
      ],
      "s": {
        "y": 570,
        "x": 653,
        "u": "https://preview.redd.it/ht704fcdxu671.png?width=653&format=png&auto=webp&s=e323ae8d31d3f06440c61e33f6ac0947c515fdaa"
      },
      "id": "ht704fcdxu671"
    },
    "99op5a1mxu671": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 43,
          "x": 108,
          "u": "https://preview.redd.it/99op5a1mxu671.png?width=108&crop=smart&auto=webp&s=7b45eca3f1828db7d97b52a85b5ed311be58950d"
        },
        {
          "y": 86,
          "x": 216,
          "u": "https://preview.redd.it/99op5a1mxu671.png?width=216&crop=smart&auto=webp&s=97fbd6bc2eed60721421fd890418fc3377350d82"
        },
        {
          "y": 128,
          "x": 320,
          "u": "https://preview.redd.it/99op5a1mxu671.png?width=320&crop=smart&auto=webp&s=4b90683e15e995a4a1987bb7f11ea27d58f237e3"
        },
        {
          "y": 257,
          "x": 640,
          "u": "https://preview.redd.it/99op5a1mxu671.png?width=640&crop=smart&auto=webp&s=239fd5b4a4d7dbf376f27ea5ce88ba1ef1cfcfd0"
        }
      ],
      "s": {
        "y": 336,
        "x": 835,
        "u": "https://preview.redd.it/99op5a1mxu671.png?width=835&format=png&auto=webp&s=0fde082909e67eee6c8b285eb235af665ecba755"
      },
      "id": "99op5a1mxu671"
    },
    "y0ex0lzjxu671": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 64,
          "x": 108,
          "u": "https://preview.redd.it/y0ex0lzjxu671.png?width=108&crop=smart&auto=webp&s=e3351876a009b5ae9f3a616468928005c82e4e1d"
        },
        {
          "y": 129,
          "x": 216,
          "u": "https://preview.redd.it/y0ex0lzjxu671.png?width=216&crop=smart&auto=webp&s=0555ee779d04fc8e1a810cb9facfecc932eb4e24"
        },
        {
          "y": 191,
          "x": 320,
          "u": "https://preview.redd.it/y0ex0lzjxu671.png?width=320&crop=smart&auto=webp&s=e50d883d1ed1474fc116a1a4957a89657117c9c2"
        },
        {
          "y": 382,
          "x": 640,
          "u": "https://preview.redd.it/y0ex0lzjxu671.png?width=640&crop=smart&auto=webp&s=6d9a65846c40d207a26dba2874ef771c3d746a8b"
        }
      ],
      "s": {
        "y": 430,
        "x": 719,
        "u": "https://preview.redd.it/y0ex0lzjxu671.png?width=719&format=png&auto=webp&s=2be1d6126ed161679e35c37d99aa17dbf60d6e20"
      },
      "id": "y0ex0lzjxu671"
    },
    "cnalsz78xu671": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 47,
          "x": 108,
          "u": "https://preview.redd.it/cnalsz78xu671.png?width=108&crop=smart&auto=webp&s=6caf45db508b4380dc4c371d133f313b08487629"
        },
        {
          "y": 94,
          "x": 216,
          "u": "https://preview.redd.it/cnalsz78xu671.png?width=216&crop=smart&auto=webp&s=6c24f49b455528d9d4b4fd0776383ddda7c7d635"
        },
        {
          "y": 140,
          "x": 320,
          "u": "https://preview.redd.it/cnalsz78xu671.png?width=320&crop=smart&auto=webp&s=b46f50554751528b90549901cc0410318ebeb683"
        },
        {
          "y": 281,
          "x": 640,
          "u": "https://preview.redd.it/cnalsz78xu671.png?width=640&crop=smart&auto=webp&s=bf932097c0981fd5ffe296ea0fe10c361887544c"
        },
        {
          "y": 421,
          "x": 960,
          "u": "https://preview.redd.it/cnalsz78xu671.png?width=960&crop=smart&auto=webp&s=e49d97914637a11454fa09528d964cb80dd303ba"
        },
        {
          "y": 474,
          "x": 1080,
          "u": "https://preview.redd.it/cnalsz78xu671.png?width=1080&crop=smart&auto=webp&s=c216fd774adb572ea0ed8d9b70bb32acc43e77d1"
        }
      ],
      "s": {
        "y": 803,
        "x": 1828,
        "u": "https://preview.redd.it/cnalsz78xu671.png?width=1828&format=png&auto=webp&s=f4eaa9bb6afea1196f74af2e4aa3b559c1af9593"
      },
      "id": "cnalsz78xu671"
    },
    "cydnqjnnxu671": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 65,
          "x": 108,
          "u": "https://preview.redd.it/cydnqjnnxu671.png?width=108&crop=smart&auto=webp&s=022b0b176e98478dbd07aa22ec7a9f4552b61a29"
        },
        {
          "y": 131,
          "x": 216,
          "u": "https://preview.redd.it/cydnqjnnxu671.png?width=216&crop=smart&auto=webp&s=bae97d3e23756289153842b10a13c50c7c871bea"
        },
        {
          "y": 195,
          "x": 320,
          "u": "https://preview.redd.it/cydnqjnnxu671.png?width=320&crop=smart&auto=webp&s=d56a2e1b05ddad18862350034146ed70bff6c6a1"
        }
      ],
      "s": {
        "y": 325,
        "x": 532,
        "u": "https://preview.redd.it/cydnqjnnxu671.png?width=532&format=png&auto=webp&s=ead36155d9fccd21e31dcadb7bbcd951756afd76"
      },
      "id": "cydnqjnnxu671"
    },
    "1igqxc1pxu671": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 79,
          "x": 108,
          "u": "https://preview.redd.it/1igqxc1pxu671.png?width=108&crop=smart&auto=webp&s=7d40936ed5d214f6d16474f7b0b636bab13a3e50"
        },
        {
          "y": 158,
          "x": 216,
          "u": "https://preview.redd.it/1igqxc1pxu671.png?width=216&crop=smart&auto=webp&s=f2a972bb8718c28cb7a120cc6069339e624b6eba"
        },
        {
          "y": 235,
          "x": 320,
          "u": "https://preview.redd.it/1igqxc1pxu671.png?width=320&crop=smart&auto=webp&s=04a04d3c5b3317dd4e65125bd3c265b2c3d35fcc"
        },
        {
          "y": 470,
          "x": 640,
          "u": "https://preview.redd.it/1igqxc1pxu671.png?width=640&crop=smart&auto=webp&s=5075abfc5018b017062d4891d111f67b9c0f2ca4"
        }
      ],
      "s": {
        "y": 499,
        "x": 679,
        "u": "https://preview.redd.it/1igqxc1pxu671.png?width=679&format=png&auto=webp&s=08c4c2c936e4e4befb6308d5e07807be40de0875"
      },
      "id": "1igqxc1pxu671"
    },
    "r6puw6r9xu671": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 56,
          "x": 108,
          "u": "https://preview.redd.it/r6puw6r9xu671.png?width=108&crop=smart&auto=webp&s=fad7162d82c82adabcf821a35302a577534fb317"
        },
        {
          "y": 112,
          "x": 216,
          "u": "https://preview.redd.it/r6puw6r9xu671.png?width=216&crop=smart&auto=webp&s=6a7f1b7424530842558175be115e1e1dfc854573"
        },
        {
          "y": 166,
          "x": 320,
          "u": "https://preview.redd.it/r6puw6r9xu671.png?width=320&crop=smart&auto=webp&s=898029492e4d894badb9e2fc94cfee771b640362"
        },
        {
          "y": 332,
          "x": 640,
          "u": "https://preview.redd.it/r6puw6r9xu671.png?width=640&crop=smart&auto=webp&s=c6aa0a58ed0fa01db3281df3b301a384ccf6793b"
        }
      ],
      "s": {
        "y": 405,
        "x": 780,
        "u": "https://preview.redd.it/r6puw6r9xu671.png?width=780&format=png&auto=webp&s=b12fd23f12b324e1a0762a2cf737705197a60a65"
      },
      "id": "r6puw6r9xu671"
    },
    "il6qwpv0xu671": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 58,
          "x": 108,
          "u": "https://preview.redd.it/il6qwpv0xu671.png?width=108&crop=smart&auto=webp&s=7b29c47db2df25fa81180ca0ad5e4df63c3b97cd"
        },
        {
          "y": 116,
          "x": 216,
          "u": "https://preview.redd.it/il6qwpv0xu671.png?width=216&crop=smart&auto=webp&s=b977569fab6a128b277bd169c62d185e2c27a54c"
        },
        {
          "y": 173,
          "x": 320,
          "u": "https://preview.redd.it/il6qwpv0xu671.png?width=320&crop=smart&auto=webp&s=af15f62ce40cb0db571cb4978cf31e46b0466d55"
        },
        {
          "y": 346,
          "x": 640,
          "u": "https://preview.redd.it/il6qwpv0xu671.png?width=640&crop=smart&auto=webp&s=5e8ab16a986a6e7eff1096889dfcc6c4cced2a7a"
        }
      ],
      "s": {
        "y": 378,
        "x": 699,
        "u": "https://preview.redd.it/il6qwpv0xu671.png?width=699&format=png&auto=webp&s=794457786899453d0212feebde97ae3ccb888aab"
      },
      "id": "il6qwpv0xu671"
    },
    "cbltxfmgxu671": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 50,
          "x": 108,
          "u": "https://preview.redd.it/cbltxfmgxu671.png?width=108&crop=smart&auto=webp&s=998f06856cdf53d51bd1bc2bb722439d18346b5a"
        },
        {
          "y": 101,
          "x": 216,
          "u": "https://preview.redd.it/cbltxfmgxu671.png?width=216&crop=smart&auto=webp&s=e914c5d8453db859dc6ebee6679ea24786cc631d"
        },
        {
          "y": 149,
          "x": 320,
          "u": "https://preview.redd.it/cbltxfmgxu671.png?width=320&crop=smart&auto=webp&s=da6178301027019140bb1a543c8d3477874c1f91"
        },
        {
          "y": 299,
          "x": 640,
          "u": "https://preview.redd.it/cbltxfmgxu671.png?width=640&crop=smart&auto=webp&s=3aba15a608068d30d82305d6be5f781ca1740f8a"
        },
        {
          "y": 449,
          "x": 960,
          "u": "https://preview.redd.it/cbltxfmgxu671.png?width=960&crop=smart&auto=webp&s=51b7c4e5cad150d73d9b06e10b0681cc7b9f6ed0"
        },
        {
          "y": 505,
          "x": 1080,
          "u": "https://preview.redd.it/cbltxfmgxu671.png?width=1080&crop=smart&auto=webp&s=1c11dc4b59a09f646b065228d2f5141dd8a77d93"
        }
      ],
      "s": {
        "y": 856,
        "x": 1828,
        "u": "https://preview.redd.it/cbltxfmgxu671.png?width=1828&format=png&auto=webp&s=559a0ff34f6386101ce95f2850c92f8f6aa21c43"
      },
      "id": "cbltxfmgxu671"
    },
    "sedtyfe3xu671": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 51,
          "x": 108,
          "u": "https://preview.redd.it/sedtyfe3xu671.png?width=108&crop=smart&auto=webp&s=04cab373b34e6903b7f1a54d853de462eadbbe7e"
        },
        {
          "y": 102,
          "x": 216,
          "u": "https://preview.redd.it/sedtyfe3xu671.png?width=216&crop=smart&auto=webp&s=d6af3be4030dfc59599570dd20fe03ff56b55484"
        },
        {
          "y": 151,
          "x": 320,
          "u": "https://preview.redd.it/sedtyfe3xu671.png?width=320&crop=smart&auto=webp&s=ad2b28f479d4d0ba53c53f3d020215bbfc65f70f"
        },
        {
          "y": 303,
          "x": 640,
          "u": "https://preview.redd.it/sedtyfe3xu671.png?width=640&crop=smart&auto=webp&s=9fe1bc9a205413d4a362c4871e5a3ba357cb2e88"
        }
      ],
      "s": {
        "y": 336,
        "x": 709,
        "u": "https://preview.redd.it/sedtyfe3xu671.png?width=709&format=png&auto=webp&s=5a17f07e5bc920baa6ecf8e63ea8c661e2706534"
      },
      "id": "sedtyfe3xu671"
    }
  },
  "name": "t3_o5tbpf",
  "quarantine": false,
  "link_flair_text_color": "light",
  "upvote_ratio": 0.84,
  "author_flair_background_color": "",
  "subreddit_type": "public",
  "ups": 1880,
  "total_awards_received": 54,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "DD",
  "can_mod_post": false,
  "score": 1880,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": true,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {
    "gid_1": 7,
    "gid_2": 3,
    "gid_3": 1
  },
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1624414109,
  "link_flair_type": "richtext",
  "wls": 7,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.wallstreetbets",
  "allow_live_comments": true,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In this Gay Pride Month due diligence, prepare for a <a href=\"https://www.google.com/search?q=sack+rubbed+finish\">sack-rubbed finish</a> as you learn about this load-bearing home builder that reports tomorrow.</p>\n\n<p>A brief overview: Housing demand is at 2005 levels, during a major housing shortage that will take a decade to sort out. Commodity prices don&#39;t matter -- buyers are paying. Evidence? Data says so, CEOs say so, and LEN just blew out earnings and went up 10%. <strong>KBH earnings are coming up Wednesday and it tends to roll with LEN, so I&#39;m rolling the dice with KBH on July/Aug calls, plus commons because gay pride.</strong></p>\n\n<p>Annoyingly long TLDR below, then I get gay.</p>\n\n<p>-----------</p>\n\n<p>The residential construction market is hot, despite high prices:</p>\n\n<ul>\n<li>Demand is insane. <strong>We are essentially in 2005</strong>: High housing market index. High housing starts. High orders.</li>\n<li>High commodity costs are a non-issue -- <strong>prices get passed on to buyers.</strong></li>\n<li>KBH caters to the exact demographic with the highest demand: first-time buyers, west + central.</li>\n<li>Residential construction stocks are down from Mid-may due to The Great Inflation Scare, and haven&#39;t recovered yet.</li>\n<li>Real estate is generally thought of as an &quot;inflation proof&quot; investment.</li>\n<li>Whether or not there is inflation, people are going to buy houses at record pace for the foreseeable future.</li>\n</ul>\n\n<p>All signs point to a great KBH earnings report (Wednesday after close):</p>\n\n<ul>\n<li>All of the above.</li>\n<li>LEN has the same earnings calendar. They reported last Wed (Jun 16). Result? Blowout. Popped up 10% in two sessions.</li>\n<li>LEN had no problem building homes, taking orders, and increasing margins despite high costs.</li>\n<li>KBH tracks LEN share price rather consistently -- and KBH hasn&#39;t moved yet. I see 10% upside, easy.</li>\n<li>I scraped a housing review site. Results are inconclusive, but if you squint they look bullish.</li>\n<li>Commodities may be entering a bear market, which may cause higher guidance (lower commodity prices == higher margin).</li>\n</ul>\n\n<p>I Like The Stock:</p>\n\n<ul>\n<li>Massive cashflow, massive backlog of orders, massive orders getting added.</li>\n<li>In the right place at the right time: West and central regions.</li>\n<li>CEO made the news when he called neighbor Kathy Griffin a &quot;bald dyke&quot; and &quot;cunt&quot; after she made a noise complaint on his 3 grandchildren swimming in his pool. Bullish.</li>\n</ul>\n\n<p>July/Aug calls:</p>\n\n<ul>\n<li>A bet on positive earnings Wednesday, following in LEN&#39;s footsteps.</li>\n<li>A bet on a ~10% catch-up to LEN, as they generally track one-another and LEN is up.</li>\n<li>Housing market is clearly bullish and I see no reason it will slow down.</li>\n<li>Many builders report in July, so Aug calls could bang.</li>\n<li>Risk/reward seems solid.</li>\n</ul>\n\n<p>-----------</p>\n\n<h1>I. Housing Supply Shortage, and Historic Demand Levels</h1>\n\n<p>The current housing situation, for builders, is better than any erection drawing they&#39;ve ever seen:</p>\n\n<ul>\n<li>The supply of homes was already at a shortage -- about 5.5 million houses too few.</li>\n<li>People were already moving out of cities and into suburbs.</li>\n<li>Then COVID caused the move-to-suburbs trend to massively accelerate, leading to a surge in home demand.</li>\n<li>COVID dampened the ability to construct homes, causing even more supply deficit.</li>\n<li><strong>So we now have massive demand, and short supply.</strong></li>\n<li>The people moving tend to have a lot of money, and they&#39;re buying despite high costs.</li>\n<li>We are now at ~2005 levels: housing starts, orders, sentiment; all skyrocketing.</li>\n<li>It may take a full decade to build enough houses to satisfy the current demand.</li>\n</ul>\n\n<h2>SUPPLY: The Great Housing Shortage</h2>\n\n<p>COVID caused construction to slow. Everybody had to quarantine and wear masks and shit. Unprecedented times. It was a really hard period that has changed us all forever and bla bla bla.</p>\n\n<p>All that matters for us is: <strong>home construction slowed, during a period where people increasingly wanted to move into houses, and after a period where there weren&#39;t enough houses already.</strong></p>\n\n<p>On June 18th, The National Association of Realtors released a report titled &quot;Underbuilding Left America Short 5.5M to 6.8M Homes&quot;, <a href=\"https://www.bankerandtradesman.com/nar-underbuilding-left-america-short-5-5m-to-6-8m-homes/\">it&#39;s here (but behind a paywall)</a>. You may choose not to believe NAR, which could be described as a lobbying group, in which case you can <a href=\"https://www.reddit.com/r/realestateinvesting/comments/o1458f/why_does_the_media_treat_the_national_association/\">read this discussion on Reddit</a>.</p>\n\n<p>That NAR report is behind a paywall, but <a href=\"https://www.wsj.com/articles/u-s-housing-market-needs-5-5-million-more-units-says-new-report-11623835800\">the WSJ wrote a piece about it here</a>, which I&#39;ll quote just to give you an idea of how severe the supply shortage is:</p>\n\n<p><strong>Shortage existed Pre-COVID:</strong></p>\n\n<blockquote>\n<p>The report also says that from 2010 to 2020, new-home construction fell 6.8 million units short of what was needed to meet household-formation growth and replace units that were aging or destroyed by natural disasters.</p>\n</blockquote>\n\n<p><strong>Housing prices are up, but demand is still bottlenecked by supply:</strong></p>\n\n<blockquote>\n<p>Limited supply has been a recent driver of rising housing prices for renters and home buyers, alongside robust demand.  </p>\n\n<p>The supply shortage became especially acute in the past year. Builders slowed construction in some regions last spring and delayed land purchases because of the Covid-19 pandemic. In addition, low mortgage-interest rates and an increase in remote work led to a surge in demand for single-family housing. And many homeowners delayed or canceled plans to list their homes for sale.  </p>\n\n<p>Builders ramped up the pace in 2020 in response to robust demand. <strong>Housing starts, a measure of home-building activity, rose last year to 1.38 million units, the highest rate since 2006. But shortages of labor, ready-to-build land and materials have limited the pace of construction growth, builders say.</strong></p>\n</blockquote>\n\n<p>What do you reckon will happen to KBH if/when they announce better access to labor and materials? Have you noticed that lumber and copper have gone down significantly since May?</p>\n\n<p><strong>Builders will need to build at an incredible rate:</strong></p>\n\n<blockquote>\n<p>To shrink the supply deficit, builders would need to exceed the long-term historical average pace of 1.5 million units a year, according to the NAR report. At 2.1 million units a year, near the level reached in 2005, it would take a decade to close a gap of 5.5 million units, the report says.</p>\n</blockquote>\n\n<p>So there you have it: <strong>not enough homes, and a surge in demand.</strong> Builders have a lot of <a href=\"https://www.google.com/search?q=back+filling\">back-filling</a> to do, and believe me, they are happy to do it. <strong>This construction boom is going to last.</strong></p>\n\n<h2>DEMAND: The Great Migration</h2>\n\n<p>It&#39;s no secret that COVID jump-started a massive migration out of cities. Arguably, COVID just accelerated an already occuring trend of people leaving cities (most evident in SF and NYC). <strong>What&#39;s important here is where people are moving, and who is moving. Keep in mind KBH targets first-time home buyers and is largely based in CA, WA, CO, and TX.</strong></p>\n\n<h2>Where are people moving? (West + Central)</h2>\n\n<p><a href=\"https://www.bloomberg.com/graphics/2021-citylab-how-americans-moved/\">This article from Bloomberg (April 26, 2021)</a> provides some amazing infographics and far more information than I can fit into my smooth, <a href=\"https://www.google.com/search?q=butt+glazed\">butt-glazed</a> brain. But my takeaway is this:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/hrm3gakywu671.png?width=1204&amp;format=png&amp;auto=webp&amp;s=ecc673a4c2d78979a91a7e4596d30d25617ca1e3\">People are moving out of cities, and into suburban counties.</a></p>\n\n<p>This quote says it all:</p>\n\n<blockquote>\n<p>82% of urban centers saw more people moving out then in. 91% of suburban counties saw more people moving in than out.</p>\n</blockquote>\n\n<p>Cities are seeing some serious <a href=\"https://www.google.com/search?q=wood+shrinkage\">shrinkage</a>, while suburbs are <a href=\"https://en.wikipedia.org/wiki/Rising_damp_(structural\">rising damp</a>).</p>\n\n<p><a href=\"https://www.cnbc.com/2021/04/15/millennials-moving-out-of-big-cities-where-they-are-going-smartasset.html\">This article from CNBC (April 15, 2021)</a> highlights where millennials are moving to the most:</p>\n\n<ul>\n<li>Denver (CO)</li>\n<li>Seattle (WA)</li>\n<li>Phoenix (AZ)</li>\n<li>Austin (TX)</li>\n<li>Colorado City (CO)</li>\n</ul>\n\n<p>Notice anything? <strong>KBH operates in six states -- and all of them are on this list. KBH also caters to first-time buyers (millennials).</strong></p>\n\n<h2>Who is moving?</h2>\n\n<p><a href=\"https://www.bloomberg.com/news/articles/2021-05-14/rich-americans-likelier-to-move-house-reversing-pre-covid-data\">This Bloomberg article</a> provides insight:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/xsqnmxqzwu671.png?width=649&amp;format=png&amp;auto=webp&amp;s=4cddf1958ef4c02c778ccc1c987074aa95f662c6\">https://preview.redd.it/xsqnmxqzwu671.png?width=649&amp;format=png&amp;auto=webp&amp;s=4cddf1958ef4c02c778ccc1c987074aa95f662c6</a></p>\n\n<p>Some quotes:</p>\n\n<blockquote>\n<p>High-earning Americans are now likelier to move house than low earners in a reversal of the usual pattern, according to new research, as the pandemic offers remote-work opportunities to white-collar employees.  </p>\n\n<p>The biggest jump in residential migration has come among workers earning more than $150,000, according to analysis by Apartmentlist.com based on Census Bureau surveys. About 16% of that group relocated in the past year, up from 11.5% in 2019.</p>\n</blockquote>\n\n<p>They were already moving before. Now they&#39;re really moving.</p>\n\n<p>Do not misconstrue this as &quot;the rich are the <em>only</em> people moving&quot; -- they&#39;re just moving at higher rates than previously. As costs go up, there is plenty of demand willing to pay.</p>\n\n<p>That&#39;s great they are moving -- but does this equate to new house purchases? Keep reading.</p>\n\n<h2>Sentiment (HMI): Up (esp. West + Central)</h2>\n\n<p>This is one of those index numbers that comes out each month, and when it does the market sometimes goes batshit crazy and pumps or dumps real estate related stocks. Values &gt;50 are bullish, &lt;50 are bearish. Lately it&#39;s been on the <a href=\"https://www.google.com/search?q=wac+track\">wac track</a> upwards.</p>\n\n<blockquote>\n<p>The NAHB/Wells Fargo Housing Market Index (HMI) is based on a monthly survey of NAHB members designed to take the pulse of the single-family housing market. The survey <strong>asks respondents to rate market conditions for the sale of new homes at the present time and in the</strong> <strong><em>next six months</em></strong> as well as the traffic of prospective buyers of new homes.</p>\n</blockquote>\n\n<p><a href=\"https://www.nahb.org/-/media/NAHB/news-and-economics/docs/housing-economics/hmi/202106/t1-nahb-wellsfargo-national-and-regional-hmi-202106.xls\">Here are the latest numbers</a>, released Jun 15th. Historical data is found <a href=\"https://www.nahb.org/news-and-economics/housing-economics/indices/housing-market-index\">here</a>. But don&#39;t worry, I&#39;ll break it down for you retards.</p>\n\n<p><strong>We&#39;re at all time highs.</strong></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/il6qwpv0xu671.png?width=699&amp;format=png&amp;auto=webp&amp;s=794457786899453d0212feebde97ae3ccb888aab\">HMI numbers at all-time highs.</a></p>\n\n<p>And how does this break out, regionally?</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/qu8063b2xu671.png?width=666&amp;format=png&amp;auto=webp&amp;s=6123485dad7d7c5743b2bf2cb434da681842e002\">Recent HMI numbers by region (KBH Q2 highlighted)</a></p>\n\n<p>Notice which regions have the highest numbers for Q2? I made it bluer than your balls just for you. That&#39;s right, you stud, South + West. Keep in mind, &quot;South&quot; basically means &quot;Texas&quot;, which KBH would consider &quot;Central&quot;. <strong>So we have record high sentiments in West and Central during Q2. Can you remember in which regions KBH builds?</strong></p>\n\n<p>So, yeah, <strong>demand is at historic levels, particularly in the regions KBH caters to, despite prices being high.</strong></p>\n\n<h2>Housing starts: Up (esp. West + Central)</h2>\n\n<p>Is this <em>real</em> demand, or just, people saying: &quot;Yeah, I want a house. The Wendy&#39;s parking lot just isn&#39;t doing it for me.&quot;</p>\n\n<p>It&#39;s real.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/sedtyfe3xu671.png?width=709&amp;format=png&amp;auto=webp&amp;s=5a17f07e5bc920baa6ecf8e63ea8c661e2706534\">Housing starts in the last year. Up.</a></p>\n\n<p>This data is from census.gov. Big brother tracks building permit numbers categorized as: authorized, started, under construction, and completed. <a href=\"https://www.census.gov/construction/nrc/index.html\">Recent data here</a>. <a href=\"https://www.census.gov/construction/nrc/historical_data/index.html\">Historical data here</a>.</p>\n\n<p>You can see the &quot;started&quot; numbers are going up and up, <strong>despite the price of commodities rising since at least October.</strong></p>\n\n<p>Let&#39;s zoom out, and once again take a look at <em>where</em> all this building is taking place:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/r6puw6r9xu671.png?width=780&amp;format=png&amp;auto=webp&amp;s=b12fd23f12b324e1a0762a2cf737705197a60a65\">Housing starts by region since 1990 alongside HPI.</a></p>\n\n<p>I added the housing price index to this graph:</p>\n\n<blockquote>\n<p>The FHFA HPI serves as a timely, accurate indicator of house price trends at various geographic levels.</p>\n</blockquote>\n\n<p>It doesn&#39;t adjust for inflation. In fact, some would argue it&#39;s a pretty good measurement of inflation. <strong>Regardless, you can houses are being built at 2003 levels despite the high prices.</strong></p>\n\n<p>And where are they being built? West and South (aka Texas, aka KBH&#39;s &quot;Central&quot;)? West and Central, again.</p>\n\n<p>So there you have it. Record demand, and skyrocketing building rates, without a fuck given about prices. <strong>KBH must be salivating at the thought of all that oozing caulk.</strong></p>\n\n<p>-----------</p>\n\n<h1>II. The Commodities Boogeyman (High prices don&#39;t matter)</h1>\n\n<p>Ok, so you have a picture of the crazy demand and crazy short supply of houses. Now let&#39;s address the boogeyman on everyone&#39;s mind: the spike in commodity prices.</p>\n\n<p>Do not fear high commodity prices. <strong>The spike in commodity prices is a direct result of the boom in residential construction (and surge in demand) -- prices are high because the market is willing to pay.</strong></p>\n\n<p><strong>TLDR:</strong>  Houses use a lot of lumber and copper. High lumber and copper prices are a <em>consequence</em> of the insane demand for houses, are passed on to the consumer, and do not impact margins. As commodity prices fall, builders stand to increase their margins. Bullish. As. Fuck.</p>\n\n<h2>Lumber and Copper</h2>\n\n<p>The same shit that happened to home building happened to lumber and copper. Shut downs in production from COVID, but an increase in demand afterward -- largely driven by residential construction.</p>\n\n<p>From <a href=\"https://www.copper.org/education/c-facts/home/\">this source</a>, residential construction accounts for a full 1/3rd of the usage of copper.</p>\n\n<p>Residential construction also accounts for some massive percentage of lumber usage. I can&#39;t be arsed to look it up, but just think of all the <a href=\"https://www.google.com/search?q=rim+joist\">rim joists</a>, <a href=\"https://www.google.com/search?q=batter+board\">batter boards</a>, etc, that go into a house. My point: <strong>the surge in home building, where the demand is so high, means copper and lumber get bid up</strong>.</p>\n\n<p><strong>The costs get passed on to the buyers</strong>, and the market will show you as much. Look: lumber and copper prices skyrocket, but KBH and LEN stocks barely flinch.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/cnalsz78xu671.png?width=1828&amp;format=png&amp;auto=webp&amp;s=f4eaa9bb6afea1196f74af2e4aa3b559c1af9593\">KBH and LEN don&#39;t care about commodity prices</a></p>\n\n<p>I will cover the price dip that occurred in May in section III.</p>\n\n<p>So don&#39;t worry about high commodity costs -- the demand for them is high from housing, but the supply is taking time to catch up from COVID. <strong>Despite commodity prices going higher, demand is still insane and houses are getting built.</strong></p>\n\n<h2>Increasing deliveries, increasing home starts</h2>\n\n<p>You might still be unconvinced that high commodity prices don&#39;t matter to home purchasers. Even after I already fucking explained how high demand is, how high HMI numbers are, and that the rampant rush on building houses is what is actually causing the high commodity prices in the first place.</p>\n\n<p>If you don&#39;t believe me, take that <a href=\"https://en.wikipedia.org/wiki/Sex_bolt\">sex bolt</a> out of your <a href=\"https://www.google.com/search?q=stud+pocket\">stud pocket</a> and look at the charts below.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/ht704fcdxu671.png?width=653&amp;format=png&amp;auto=webp&amp;s=e323ae8d31d3f06440c61e33f6ac0947c515fdaa\">Orders, deliveries, and house starts. Up and up.</a></p>\n\n<p>(Note: Q1 for these companies is: Dec, Jan, and Feb)</p>\n\n<p>Look at the light blue bars. Does it look like inflation and commodity prices are of any concern to the people ordering homes?</p>\n\n<p>-----------</p>\n\n<h1>III. The Great Inflation Scare of May</h1>\n\n<p>Let me recap what happened in mid May: People emptied their <a href=\"https://www.google.com/search?q=weephole\">weep holes</a> due to inflation. Their <a href=\"https://www.google.com/search?q=buttweld\">butt-welds</a> simply burst from fears the world was ending.</p>\n\n<p>LEN got <a href=\"https://en.wikipedia.org/wiki/Bush_hammer\">bush hammered</a> from $51 down to $44, and now hovers at $43 as there&#39;s some rotation back to tech and the market circles in a landing pattern with no conviction of where to land.</p>\n\n<p><strong>Yet.. conditions for builders have only improved since May</strong>:</p>\n\n<ul>\n<li>KBH has stated costs could be passed on to buyers.</li>\n<li>LEN has proven costs could be passed on to buyers in Q2, and actually increased their margins in Q2.</li>\n<li><strong>Copper and Lumber costs have tumbled since May, which will further increase margin.</strong></li>\n</ul>\n\n<p>Inflation or not, KBH is printing money hand over fist, will reveal this in Q2 earnings, and will continue to crush Q3 and Q4 aided by lower prices of commodities and continued strong demand and shortage in supply.</p>\n\n<h2>Buyers will pay, CEOs say.</h2>\n\n<p>You don&#39;t have to trust fancy graphs and those squiggly whatsits... numbers. You can see what LEN and KBH execs have openly said about the effects of rising commodity prices. Well, <em>you</em> personally probably won&#39;t, but I did.</p>\n\n<h2>KBH Q1 transcript (March 24)</h2>\n\n<blockquote>\n<p>So no, I&#39;m not overly concerned at this point. In fact, we&#39;ve been confident enough and thought about the year favorably enough to lift the margin guidance as we go. So <strong>we&#39;re actually even feeling a little bit better about our profitability than we were three months ago.</strong></p>\n</blockquote>\n\n<p>Higher lumber costs... and yet higher profitability? How&#39;s that possible? Oh, right. People want to live in homes rather than in the Wendy&#39;s parking lot, and will pay for it.</p>\n\n<h2>KBH CEO (May 6)</h2>\n\n<p>Taken from <a href=\"https://www.cnn.com/2021/05/05/business/lumber-prices-home-building-costs/index.html\">here</a>.</p>\n\n<blockquote>\n<p><strong>While lumber prices have gone up, we have been able to pass it on to the consumer with higher prices for homes.</strong> - KBH CEO Jerffrey Mezger</p>\n</blockquote>\n\n<p>That pretty much says it all.</p>\n\n<h2>LEN Q2 earnings transcript (Jun 17)</h2>\n\n<p>No need for conjecture -- let&#39;s see how this quarter <em>actually</em> panned out for LEN so far, which just reported earnings last week.</p>\n\n<blockquote>\n<p>Q4 of 2020 is when we saw the first significant increase in lumber costs, which impacted primarily our Q2 deliveries. The lumber increases, which occurred in Q1 and Q2, will mostly flow through our deliveries in the second half of the year. But as we noted and Diane will cover more detail, we believe that Lennar&#39;s pricing power will more than offset this and we expect to deliver stronger gross margins.</p>\n</blockquote>\n\n<p>The true test will be Q3 and Q4, where the high prices of lumber will have had the largest impact.  But as for now, yeah, <strong>their margins actually increased</strong>. I think we will hear the same story with KBH on Wednesday.</p>\n\n<p>Also from this transcript:</p>\n\n<blockquote>\n<p>Looking forward, we expect to see some limited relief on our lumber costs for our July starts as more expensive lumber works its way through the system. And if the current downward trend holds, we&#39;ll see a more significant benefit for August starts.</p>\n</blockquote>\n\n<p>You catch that? Margins managed to increase during high lumber prices in Q2. So what will happen in Q3 and Q4 if lumber continues to decrease? (It peaked in May). Yeah. More margin, creating an <a href=\"https://en.wikipedia.org/wiki/Ultimate_load\">ultimate load</a> of profit.</p>\n\n<h2>Expect a recovery from Q2 and beyond</h2>\n\n<p><strong>The stock price has yet to recover from May. I&#39;m betting it will.</strong></p>\n\n<p>There is no reason these stocks should be cheaper than they were in May. There is every indication they are doing <em>better</em> than they were in May:</p>\n\n<ul>\n<li>Inflation or not, people are buying houses</li>\n<li>More orders</li>\n<li>More housing starts</li>\n<li>Higher HMI sentiment</li>\n<li>LEN proved costs don&#39;t matter, they increased their margins</li>\n<li>And, now: there&#39;s LOWER cost of material</li>\n</ul>\n\n<p>-----------</p>\n\n<h1>IV: Canary in the Tendies Kitchen - Where LEN goes, KBH follows.</h1>\n\n<p>Both LEN and KBH share the same weird corporate calendar where their quarters are set back a month. So, Q1 is Dec/Jan/Feb, and Q2 is Mar/Apr/May.</p>\n\n<p>LEN posted earnings last week. They crushed it and surged 10% in the two trading sessions afterward. So to the extent that market conditions are working in the favor of LEN, they are most likely working in favor of KBH as well.</p>\n\n<p>Also from the LEN Q2 Earnings Call (Jun 17):</p>\n\n<blockquote>\n<p>The strongest market in the United States today is Austin. Notwithstanding outmigration from parts of California, the markets in California are strong. Driven by the state&#39;s severe housing shortage, there is more demand and supply, making housing the No. 1 agenda item for the governor.</p>\n</blockquote>\n\n<p>Ok guys.. same quiz: Where does KBH do most of their business? Say it with me class: West and Central.</p>\n\n<p>What else did LEN Q2 earnings reveal?</p>\n\n<ul>\n<li>LEN says demand is still strong.</li>\n<li>LEN says lumber costs not an issue -- they get passed on to the buyers.</li>\n<li>LEN delivered more houses than last quarter.</li>\n<li>LEN took more orders than last quarter.</li>\n<li>LEN increased margin their margin.</li>\n</ul>\n\n<p>Basically, they are building as fast as possible and still continuing to grow their backlog. Looking good for KBH.</p>\n\n<p><strong>Now, take a look at this chart showing the relationship between LEN and KBH.</strong></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/cbltxfmgxu671.png?width=1828&amp;format=png&amp;auto=webp&amp;s=559a0ff34f6386101ce95f2850c92f8f6aa21c43\">LEN up, will KBH follow?</a></p>\n\n<p>Do you see what I see? <strong>Where LEN leads, KBH follows. And LEN just gapped up.</strong></p>\n\n<p>This isn&#39;t a sure-fire bet -- LEN could simply retrace downwards or the LEN/KBH spread can persist for awhile, or just fail to be a thing in the future. However, I&#39;m a gambling man, and I&#39;m betting on this.</p>\n\n<h2>Housing Starts and Deliveries</h2>\n\n<p>Let&#39;s compare LEN&#39;s houses ordered and delivered (vs census.gov housing starts) to KBH.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/runaqdfixu671.png?width=653&amp;format=png&amp;auto=webp&amp;s=8cb342969f75cc842f6256404019754a85888cfb\">They&#39;re both kicking ass.</a></p>\n\n<p>The key stat here is as housing starts increase, so do homes delivered. And housing starts have indeed increased. <strong>Housing starts hit 4,814 in KBH-calendar Q2, which is a 3-month total not seen since... October 2006.</strong></p>\n\n<p>Now maybe you want to think of yourself as some sort of clever Steve Carrell character, and that we&#39;re in a housing bubble. Or maybe you think you&#39;re that retarded glass-eye drummer dude. You do you, and sit there and whine about how the market is going to crash. I&#39;ll be that rich asshole asian guy at the restaurant whose net worth exceeds yours... because I&#39;m betting big on KBH.</p>\n\n<p>For real though, there aren&#39;t really any signs there is a bubble. This is purely demand outstripping supply.</p>\n\n<p>If that many housing starts were issued, then builders were at it full force. I see no reason why KBH would be excluded from the frenzy. I think their deliveries will be up, and their orders up, further increasing their insane backlog. I also think their margins will increase, just like LEN&#39;s. They have pricing power.</p>\n\n<p><strong>I&#39;ll take the bet that KBH blows out earnings just like LEN.</strong></p>\n\n<p>-----------</p>\n\n<h1>V: Scraping a Reviews Website</h1>\n\n<p>On the topic of trying to predict deliveries -- I found <a href=\"https://www.newhomesource.com/builder/kb-home/reviews/5\">a website that allows homebuyers to write reviews</a>. Perhaps there&#39;s a correlation between how many reviews are written, and how many houses KBH ends up delivering?</p>\n\n<p><strong>So I set up a scraper and pulled all the reviews.</strong> The dates, locations, scores, everything, for three major builders: LEN, PHM, and KBH.</p>\n\n<h2>Average review scores by quarter</h2>\n\n<p>KBH is absolutely killing it:</p>\n\n<table><thead>\n<tr>\n<th align=\"left\">Quarter</th>\n<th align=\"left\">KBH - Avg Score</th>\n<th align=\"left\">LEN - Avg Score</th>\n<th align=\"left\">PHM - Avg Score</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">2021Q2</td>\n<td align=\"left\">4.61</td>\n<td align=\"left\">4.19</td>\n<td align=\"left\">4.00</td>\n</tr>\n<tr>\n<td align=\"left\">2021Q1</td>\n<td align=\"left\">4.61</td>\n<td align=\"left\">3.84</td>\n<td align=\"left\">4.18</td>\n</tr>\n<tr>\n<td align=\"left\">2020Q4</td>\n<td align=\"left\">4.59</td>\n<td align=\"left\">4.00</td>\n<td align=\"left\">4.15</td>\n</tr>\n<tr>\n<td align=\"left\">2020Q3</td>\n<td align=\"left\">4.51</td>\n<td align=\"left\">3.71</td>\n<td align=\"left\">3.85</td>\n</tr>\n<tr>\n<td align=\"left\">2020Q2</td>\n<td align=\"left\">4.50</td>\n<td align=\"left\">3.68</td>\n<td align=\"left\">3.98</td>\n</tr>\n<tr>\n<td align=\"left\">2020Q1</td>\n<td align=\"left\">4.56</td>\n<td align=\"left\">3.45</td>\n<td align=\"left\">3.84</td>\n</tr>\n</tbody></table>\n\n<h2>Correlation between review count and homes delivered?</h2>\n\n<p>Next, I tallied the number of reviews per quarter. Yes, I was careful to match the review date to the proper quarter, given LEN and KBH&#39;s weird quarterly schedule (eg: Q1 = Dec, Jan, Feb). I also took each review day and subtracted 7 days from it, to better estimate the day the house was actually delivered, since there is likely a delay between completion and writing a review.</p>\n\n<p>I plotted this against the actual number of homes delivered, as reported on quarterly earnings. The theory here: <strong>Perhaps there&#39;s a correlation between the number of reviews written, and how many houses get delivered?</strong> That would allow us to predict this quarter&#39;s numbers.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/y0ex0lzjxu671.png?width=719&amp;format=png&amp;auto=webp&amp;s=2be1d6126ed161679e35c37d99aa17dbf60d6e20\">If you squint, maybe there&#39;s a correlation</a></p>\n\n<p>It doesn&#39;t look like there is any strong correlation.</p>\n\n<p>However, if you omit Q1 data, it looks pretty good:</p>\n\n<ul>\n<li>Anytime review count decreases, homes built decreases.</li>\n<li>Anytime review count increases, homes built increases.</li>\n<li>Review count, if anything, <em>underestimates</em> the amount of homes built.</li>\n</ul>\n\n<p><strong>There&#39;s a spike in Q2 reviews, so I&#39;d like to believe that will put the number of homes built at or above 3,500. But, honestly, I wouldn&#39;t bet on it just from this data.</strong></p>\n\n<p>-----------</p>\n\n<h1>VI: The Company</h1>\n\n<p>If you read the entire post up to here, you&#39;re a fucking dumbass. You could have just read the TLDRs. Needless to say, it&#39;s pretty obvious that residential construction is going insane right now. I&#39;d be happy to own pretty much any residential construction stocks over the junk you guys have been shilling lately. Green beans? Wrestling? Seriously? Who the fuck are you people.</p>\n\n<p>This is a short term play -- I&#39;ll be in and out by August, maybe September -- but whatever... let&#39;s go over some basic shit about this company. I&#39;ll use this section to be a wise ass since I&#39;ve been holding back for most of this DD and I&#39;ve written you all a novel at this point.</p>\n\n<p><strong>Seriously, though, you should read</strong> <a href=\"https://s27.q4cdn.com/984711554/files/doc_presentations/2021/FINAL-Q1-2021-KBH-IR-Presentation-revised-4-13-2021.pdf\"><strong>their Q1 investor presentation</strong></a><strong>. It is very compelling.</strong> Yeah, I know, I&#39;m lazy. Cut me some slack.</p>\n\n<p>Here are some highlights:</p>\n\n<h2>The right place at the right time</h2>\n\n<p>KBH is home residential construction company that builds using the &quot;build-to-order&quot; model. The come up with house models, then let you select how balls deep you want to go with the upgrades. I won&#39;t go into the details of BTO (it&#39;s in the presentation), but suffice it to say they are really good at efficiently nailing your mom&#39;s drywalls.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/99op5a1mxu671.png?width=835&amp;format=png&amp;auto=webp&amp;s=0fde082909e67eee6c8b285eb235af665ecba755\">From the presentation deck. Go read it.</a></p>\n\n<p>A key aspect of this company is where they do business. Yes, again, WEST AND CENTRAL. <strong>66% of their deliveries and 72% of their revenues are from CA, WA, TX, and CO.</strong> They&#39;re right in the middle of where the highest demand is, and as such, I believe this gives them an advantage in capturing higher average costs and margins than their competitors.</p>\n\n<p>Another advantage is their early earnings schedule, which is a full month before basically the rest of the industry (except LEN). I believe the market is slow to adjust prices on the whole industry until they see the bigger guys (DHI, PHM, NVR, TOL) report first. Luckily, LEN reported before KHR and the results were exceptional. That&#39;s enough for me.</p>\n\n<p>Residential construction is currently going through a <em>generational</em> boom right now, and though a rising tide lifts all ships... I&#39;m putting my chips on KBH for now.</p>\n\n<h2>Billions in the backlog</h2>\n\n<p>Look at this beautiful backlog grow, and look at the quarterly orders grow.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/cydnqjnnxu671.png?width=532&amp;format=png&amp;auto=webp&amp;s=ead36155d9fccd21e31dcadb7bbcd951756afd76\">Backlog and orders up and to the right. In the billions.</a></p>\n\n<h2>ESG Crap - EnergyStar</h2>\n\n<p>This plays to their soy boy customer base (millennial first time buyers). They won the &quot;EnergyStar 2021 Partner of the Year&quot;. Yeah, there are actually like thirty companies that win this every year, but nonetheless the stats are kind of neat:</p>\n\n<blockquote>\n<p>Apr 13, 2001: KB Home (NYSE: KBH) today announced that it has been named an ENERGY STAR Partner of the Year â€“ Sustained Excellence Award Winner for an unprecedented 11th consecutive year by the U.S. Environmental Protection Agency (EPA). KB Home has built over 150,000 ENERGY STAR certified homes, more than any other homebuilder in the nation. These high-performance, energy-saving homes are estimated to have cumulatively reduced utility bills for their homeowners by $800 million and CO2 emissions by 5.6 billion pounds, the equivalent of removing nearly 557,000 cars from the road for one year.</p>\n</blockquote>\n\n<p>It&#39;s kind of suspicious that they measure CO2 emissions in pounds, because it&#39;s a gas so I have no idea how they managed to put it all on a scale. But, anyway, apparently all of the high-tech environmentally friendly crap they put in their houses cuts monthly expenses from $343 to $130 per month, meaning their houses basically pay for themselves in 195 years or so.</p>\n\n<h2>ESG Crap - School Supplies</h2>\n\n<p>I found this touching photo in their investment deck. It&#39;s truly heartwarming that they send school supplies to poor schools -- it&#39;s probably the least they can do as they migrate high-tax-paying individuals out of cities and leave <em>those</em> schools desperately needing funding.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/1igqxc1pxu671.png?width=679&amp;format=png&amp;auto=webp&amp;s=08c4c2c936e4e4befb6308d5e07807be40de0875\">Look, we give money to poor students after we lure their school&#39;s tax dollars away</a></p>\n\n<h2>The <a href=\"https://www.google.com/search?tbm=isch&amp;as_q=king%20stud\">King Stud</a> (CEO)</h2>\n\n<p>Here&#39;s a fun story. Back in Sep 2017 KBH CEO Jeffrey Mezger was recorded <a href=\"http://www.huffingtonpost.com/entry/kathy-griffin-jeffrey-mezger-kb-home_us_59c145aee4b0186c22061a67\">verbally destroying Kathy Griffin and her boyfriend Randy &quot;No Dick&quot; Bick</a> after they called police multiple times to report a noise complaint against him. The noise? Mezger&#39;s three grandchildren playing in the pool.</p>\n\n<p>In the audio you can hear Mezger declare war, tell Mr. Bick he&#39;s stuck with a &quot;bald dyke cunt&quot; (apparently Griffin shaved her head?), and other fun shit.</p>\n\n<p>Apparently Ms. Griffin and Mr. Bick had called police between 7 to 10 times in the past, and in each case the complaints were dismissed with no further action required. One of the times they called a noise complaint due to music being played during a ceremony where Mezger&#39;s niece, who has stage-4 cancer, was renewing her vows.</p>\n\n<p>Due to the Griffin incident, KBH ended up cutting Mezger&#39;s salary by 25%. He never apologized, though he &quot;regrets losing his temper and the language he used.&quot; He also added &quot;Why the fuck would you record it and submit it to Huffington Post you insignificant attention whore?&quot;</p>\n\n<p>Here&#39;s the <a href=\"https://www.wsj.com/articles/kb-home-cuts-ceos-bonus-over-kathy-griffin-tape-1505993665\">WSJ&#39;s coverage of the ordeal</a>.  The top comment:</p>\n\n<blockquote>\n<p>He deserves an award not a punishment</p>\n</blockquote>\n\n<p>Don&#39;t fuck with Mezger.</p>\n\n<p>-----------</p>\n\n<h1>VII. The Bet</h1>\n\n<p>Welcome to my DD. You probably just skipped down to here, so let me summarize things for you.</p>\n\n<h2>TLDR (again)</h2>\n\n<p>Housing demand is at 2005 levels, during a major housing shortage that will take a decade to sort out. Commodity prices don&#39;t matter -- buyers are paying, and in fact that&#39;s what&#39;s costs so high. Evidence? HMI index at all time highs. Housing starts at 2005 levels. Orders way up. And CEOs are saying costs are getting passed on without an issue.</p>\n\n<p>The kicker: LEN and KBH report a full month before all the other builders. LEN reported last week, and they blew out earnings and went up 10% (and their margins <em>went up</em> despite commodity prices increasing). The market didn&#39;t give KBH a similar boost, and their earnings are coming up Wednesday -- which I can only assume will kick ass. I&#39;ve also noticed that KBH tends to highly correlate with LEN and catches up to rather quickly.</p>\n\n<p>The second kicker: Builders peaked in share prices in May, but got dumped down due to The Great Inflation Scare in mid-May. The thing is, homes are considered inflation proof. And literally every sign has pointed to better conditions now than in mid-May. Higher sentiment, more starts, and LEN crushed it Q2 (Mar, Apr, May). There is no end in sight to the demand. These stocks are due for a repricing.</p>\n\n<p><strong>Like LEN, I think KBH built a lot of houses this quarter, took record numbers of orders, and increased margins despite high commodity prices -- I think the market might get all excited after their earnings Wednesday (after close).</strong> If not then, then in mid/late July when all other builders report.</p>\n\n<h2>Catalysts</h2>\n\n<ul>\n<li>Wednesday, 10am: <a href=\"https://www.census.gov/construction/nrs/pdf/newressales.pdf\">June new home sales report comes out</a>. Will it continue to smash? Yes. Will the market react? I don&#39;t know.</li>\n<li>KBH Q2 Earnings (Wed after market close): There is every indication home building was insane this quarter. Highest 3-month building starts since 2005. All time high buyer sentiment. And LEN crushed it.</li>\n<li>Time elapses: LEN and KBH have been tethered together for awhile, and LEN just leaped up 10%. I think KBH will follow. (Section IV)</li>\n</ul>\n\n<p>Throughout July and August, various residential construction companies report earnings. A continued stream of positive earnings could be what the nervous market is waiting for before diving back in, as they seem rather hesitant since mid-May:</p>\n\n<ul>\n<li>July 22nd: DHI Q2 earnings.</li>\n<li>July 22nd (est): PHM Q2 earnings.</li>\n<li>July 22nd (est): MTH Q2 earnings.</li>\n<li>July 23rd (est): NVR Q2 earnings.</li>\n<li>July 26th (est): MDC Q2 earnings.</li>\n<li>July 28th (est): BZH Q2 earnings.</li>\n<li>Aug 15 (est): TOL Q2 earnings.</li>\n</ul>\n\n<p>Longer term, there could be more COVID; there are concerns about the delta variant. While another surge of corona could cause some panic in the market, it would serve to bolster demand further (if that&#39;s even possible). KBH crushed it during COVID, so I expect they&#39;d crush COVID-2.0.</p>\n\n<h2>Bets</h2>\n\n<p>This is not financial advice and I&#39;m gay and retarded. I&#39;m into all sorts of crazy shit. <a href=\"https://www.google.com/search?q=single+hung+window\">Single hung</a>, yeah... <a href=\"https://www.google.com/search?q=single+hung+window\">double hung</a>, better. <a href=\"https://en.wikipedia.org/wiki/Tongue_and_groove\">Tongue and groove</a>, <a href=\"https://www.google.com/search?q=male+couplings\">male couplings</a>, <a href=\"https://www.google.com/search?q=spider+nuts\">spider nuts</a>, I love it all. So you should really question my judgement and do your own research.</p>\n\n<p>Once again, I advise caution. Do not YOLO. Check prices/IVs and wait for good entries. If you can&#39;t snatch July calls at a decent price, wait for things to calm down and go for August. Or, just celebrate pride month with some commons.</p>\n\n<h2>July Calls</h2>\n\n<p>There are no FDs, but July calls are fine. They give some leeway for the market to understand commodity prices don&#39;t matter, inflation doesn&#39;t matter, and that people are ordering and building houses at an astounding rate and will continue to do so.</p>\n\n<p>In my opinion, the IVs are reasonable in the mid 40s. If the stock hits $50, which I see as entirely possible, it&#39;s multi-bagger.</p>\n\n<h2>August Calls</h2>\n\n<p>Suitable if you do not have faith KBH will catch up to LEN short term, or if you do not have faith the earnings will play favorably.</p>\n\n<p>This allows you an extra month to capture the wave of builder earnings coming in July, which could provide the sufficient confirmation of &quot;they are building a lot despite commodities and inflation&quot; that the market needs to send these stocks up.</p>\n\n<p>There&#39;s also some rotation of growth-to-value potential here.</p>\n\n<h2>Shares</h2>\n\n<p>The backlog is massive and growing faster and faster. COVID-2.0 or not, inflation or not, people are buying homes and KBH stands to run alongside this current housing bull run. I think shares are a pretty safe play at least until $50.</p>\n\n<h2>My positions</h2>\n\n<ul>\n<li>Jul 16 calls $44-48</li>\n<li>Aug 20 Calls $50</li>\n<li>Lots of commons (gay pride month)</li>\n</ul>\n</div><!-- SC_ON -->",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "5692ce02-b860-11e5-b542-0edc7016bbd3",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": "",
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2th52",
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#365b8c",
  "id": "o5tbpf",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "pennyether",
  "discussion_type": null,
  "num_comments": 264,
  "send_replies": true,
  "whitelist_status": "some_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": "",
  "permalink": "/r/wallstreetbets/comments/o5tbpf/kbh_theres_no_place_like_homo/",
  "parent_whitelist_status": "some_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/wallstreetbets/comments/o5tbpf/kbh_theres_no_place_like_homo/",
  "subreddit_subscribers": 10574440,
  "created_utc": 1624404836,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1624385309,
  "the_new_excerpt": "In this Gay Pride Month due diligence, prepare for a sack-rubbed finish\n[https://www.google.com/search?q=sack+rubbed+finish] as you learn about this\nload-bearing home builder that reports tomorrow.\n\nA brief overview: Housing demand is at 2005 levels, during a major housing\nshortage that will take aâ€¦",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ã“ã®ã‚²ã‚¤ãƒ»ãƒ—ãƒ©ã‚¤ãƒ‰ãƒ»ãƒžãƒ³ã‚¹ã®ãƒ‡ãƒ¥ãƒ¼ãƒ‡ãƒªã‚¸ã‚§ãƒ³ã‚¹ã§ã¯ã€ã‚µãƒƒã‚¯ãƒªã¨ã—ãŸä»•ä¸ŠãŒã‚Šã«ãªã‚‹ã‚ˆã†ã«æº–å‚™ã—ã¾ã™\n[https://www.google.com/search?q=sack+rubbed+finish]ã“ã®æ˜Žæ—¥å ±å‘Šã™ã‚‹è€åŠ›ã®ã‚ã‚‹ãƒ›ãƒ¼ãƒ ãƒ“ãƒ«ãƒ€ãƒ¼ã«ã¤ã„ã¦å­¦ã¶ã€‚\næ˜Žæ—¥ã®ãƒ¬ãƒãƒ¼ãƒˆã§ã¯ã€ã“ã®è€åŠ›ã®ã‚ã‚‹ä½å®…ãƒ¡ãƒ¼ã‚«ãƒ¼ã«ã¤ã„ã¦ã”ç´¹ä»‹ã—ã¾ã™ã€‚\n\nç°¡å˜ã«æ¦‚è¦ã‚’èª¬æ˜Žã—ã¾ã™ã€‚ä½å®…éœ€è¦ã¯2005å¹´ã®æ°´æº–ã«é”ã—ã¦ã„ã¾ã™ãŒã€ãã®ä¸€æ–¹ã§å¤§ããªä½å®…ä¸è¶³ãŒç¶šã„ã¦ã„ã¾ã™ã€‚\nä½å®…éœ€è¦ã¯2005å¹´ã®æ°´æº–ã§ã‚ã‚Šã€ä»Šå¾Œã‚‚ç¶šãã§ã‚ã‚ã†å¤§è¦æ¨¡ãªä½å®…ä¸è¶³ã®ä¸­ã§...",
      "title": "$KBH - There's No Place Like Homo"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "åœ¨è¿™ä¸ªåŒæ€§æ‹è‡ªè±ªæœˆçš„å°½èŒè°ƒæŸ¥ä¸­ï¼Œè¯·å‡†å¤‡å¥½ä¸€ä¸ªéº»è¢‹å¼çš„ç»“å±€\n[https://www.google.com/search?q=sack+rubbed+finish]ï¼Œå› ä¸ºä½ äº†è§£åˆ°è¿™ä¸ª\næ˜Žå¤©æŠ¥å‘Šçš„æ‰¿é‡æˆ¿å±‹å»ºç­‘å•†ã€‚\n\nç®€å•ä»‹ç»ä¸€ä¸‹ã€‚ä½æˆ¿éœ€æ±‚å¤„äºŽ2005å¹´çš„æ°´å¹³ï¼Œåœ¨ä¸€ä¸ªé‡å¤§çš„ä½æˆ¿çŸ­ç¼ºæœŸé—´\nå¤„äºŽä¸€ä¸ªé‡å¤§çš„ä½æˆ¿çŸ­ç¼ºæ—¶æœŸ...",
      "title": "$KBH - æ²¡æœ‰ä»€ä¹ˆåœ°æ–¹æ¯”HOMOæ›´é€‚åˆäº†"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "åœ¨é€™å€‹åŒæ€§æˆ€è‡ªè±ªæœˆçš„ç›¡è·èª¿æŸ¥ä¸­ï¼Œè«‹æº–å‚™å¥½ä¸€å€‹éº»è¢‹å¼çš„çµå±€\n[https://www.google.com/search?q=sack+rubbed+finish]ï¼Œå› çˆ²ä½ çž­è§£åˆ°é€™å€‹\næ˜Žå¤©å ±å‘Šçš„æ‰¿é‡æˆ¿å±‹å»ºç¯‰å•†ã€‚\n\nç°¡å–®ä»‹ç´¹ä¸€ä¸‹ã€‚ä½æˆ¿éœ€æ±‚è™•æ–¼2005å¹´çš„æ°´å¹³ï¼Œåœ¨ä¸€å€‹é‡å¤§çš„ä½æˆ¿çŸ­ç¼ºæœŸé–“\nè™•æ–¼ä¸€å€‹é‡å¤§çš„ä½æˆ¿çŸ­ç¼ºæ™‚æœŸ...",
      "title": "$KBH - æ²’æœ‰ä»€éº¼åœ°æ–¹æ¯”HOMOæ›´é©åˆäº†"
    }
  ],
  "source_updated_at": 1624614204507
}