{
  "author": "CoinLenders_net",
  "original_created_utc": 1644427332,
  "title": "Earn interest on crypto and stablecoins: begginer to advanced guide, DeFi, LP, staking, lending",
  "created_utc": 1644474905,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Generating yield on crypto is a booming thing. There are many ways to boost your gains, this includes lending, staking, liquidity providing, etc. You can do this with CeFi and DeFi. This is an updated attempt to provide guide for begginers, but even experieneced user might find some useful tips.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;First let get some terms right:&lt;/strong&gt;&lt;br/&gt;\n&lt;em&gt;Staking&lt;/em&gt; - refers to generating income by block generation on Proof of Stake (PoS) blockchains. The term is heavily misused everywhere, so nowadays it can mean anything from staking to liquidity providing&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Lending&lt;/em&gt; - you lend your crypto and get interest. Counterparty does anything it want with it and hopefully pays back some day.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Liquidity providing (LP)&lt;/em&gt; - you provide two (sometimes even more) cryptocurrencies to a DEX (decentralized exchange), so people can trade. You get your share of trading fees.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;CeFi&lt;/em&gt; - centralized companies, you can lend them your coins, they pay you interest.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;DeFi&lt;/em&gt; - decentralized (well, at least in theory) applications like DEXes, lending apps etc&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Risks&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;There are obviously risks that come with all this, so beware. CeFi can get hacked, can scam you, can bankrupt. DeFi can get hacked, can scam you and its happening a lot. With staking you can get slashed (happens rarely), but if you delegate your funds to a validator, he can misbehave (depends on specific chain what he can or cant do). When doing LP, you face impermanent loss, in addition to all the DeFi risks.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;How to get yield&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Now lets get to generating some money, starting from the simplest options.&lt;/p&gt;\n\n&lt;h1&gt;CeFi&lt;/h1&gt;\n\n&lt;p&gt;Probably easiest thing to do is to lend your coins to a big CeFi lender, like Celsius. They have been around for a while, have $20B in assets under management and among CeFi its as safe as it gets. But their rates are somewhat lower than what competitors can pay you. Rates for different coins are a lot different and every CeFi lender has different rates for the coin, so you can optimize by using several CeFi. When deciding between platforms these are important things to consider: rates, security, jurisdiction, withdrawal fees, how customer support works. Also not every lender will be available in your country.&lt;br/&gt;\nWhere to find best rates:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;a href=\"https://coinlenders.net/\"&gt;https://coinlenders.net&lt;/a&gt; - this a is site i put together myself, you can search for rates among several CeFi and DeFi lending platforms. Just select a coin and see what your options are.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Note that most of the CeFi platforms have tiered system, meaning you can get best rate on limited amount - if that affects you, consider splitting funds between multiple platforms to get best value. It also helps with diversification.&lt;br/&gt;\nStakingIf you have Proof of Stake coins, than very likely staking will be safest option with great return. Many CeFi providers will just stake the coin for you and take their cut for doing this, so consider doing it yourself.&lt;/p&gt;\n\n&lt;p&gt;Typical yield for stablecoins is 10-12%, 5-6% on bitcoin and ether.&lt;/p&gt;\n\n&lt;p&gt;There are services that promise a way bigger yield than this, but i don&amp;#39;t find them trustworthy enough for sharing. But just in case you want to gamble, know that if you look, you can find yields like 15-30% on btc - but dont be suprised if you end up with nothing...&lt;/p&gt;\n\n&lt;h1&gt;DeFi&lt;/h1&gt;\n\n&lt;p&gt;Moving to DeFi. First of all try to eliminate unnecessary risks by obtaining HW wallet. Ledger or Trezor. Chose wisely according to the chains you wanna use, not all chains are supported. If possible, go for the Nano X or Model T, as these support all the modern stuff. Learn to use Metamask with you HW wallet, it will work well for all the EVM chains.&lt;/p&gt;\n\n&lt;h1&gt;DeFi lending&lt;/h1&gt;\n\n&lt;p&gt;Just like CeFi, you can just lend you coin with some lending protocol like AAVE, Compound etc. Most of the DeFi protocols issue its own token, and sometimes they will give some as incentives to lenders, borrowers or liquidity providers. This is additional yield, sometimes these rewards are locked for some time, so there is a risk of the incentive token losing lot of value before you can sell. Interest rates are usually adjusted to current market situation and change a lot, so you need to monitor it.&lt;br/&gt;\nWhere to find good rates?&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;a href=\"https://coinlenders.net/defi-lending\"&gt;https://coinlenders.net/defi-lending&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;&lt;a href=\"https://coindix.com/?kind=single\"&gt;https://coindix.com/?kind=single&lt;/a&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;h1&gt;DeFi - liquidity providing&lt;/h1&gt;\n\n&lt;p&gt;Liquidity providing is another great way to generate yield. You provide some liquidity to a DEX, in return you get fees and sometimes also incentive tokens. Usually you need to provide two assets in 50:50 ratio, which makes it more complicated. Understand, that by providing liquidity you are basically putting you assets for sale and you no longer have direct exposure to their price, so if the price in the pair changes, you will find that you own different amount of tokens and always, you will own more of the worse one.&lt;br/&gt;\nThis is called impermanent loss, but there is nothing really impermanent about it, its quite normal loss. To avoid impermanent loss you can chose a pool with currencies of equal or correlated value, like USDC-USDT. Also note that due to the impermanent loss, if one token loses 100% of value, you lose everything in the pool not just half - because you will be left with with 100% of the worthless one, due to arbitrage. Sometimes with the LP pools you will see ridiculous APYs like 1000000%, that does not mean you are getting rich. The reason for these crazy APYs is usually one of these:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;its a new platform and it will go down quickly as more liquidity is added&lt;/li&gt;\n&lt;li&gt;You need to but hyperinflating token which will lose a lot of value over time, negating the gains&lt;/li&gt;\n&lt;li&gt;Its very unsecure/untrustworthy platform with high risk of getting robbed&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Where to find the best pools? Here are some resources to help:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;a href=\"https://coindix.com/\"&gt;https://coindix.com&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;&lt;a href=\"https://kingdata.com/\"&gt;https://kingdata.com&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;&lt;a href=\"https://app.apy.vision/liquidity-pools\"&gt;https://app.apy.vision/liquidity-pools&lt;/a&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;How to handle incentive tokens/rewards&lt;/strong&gt;&lt;br/&gt;\nYou usually will want to sell it and add to your lending/LP positions to get compounding effects. These incentive tokens are normally very inflationary and are losing value quickly, especially when the protocol is new. Claiming the rewards and swapping it on DEX are transactions which can cost you tx fees, so if this is on expensive chain like Ethereum, this is only profitable for whales basically. Solution is to use automatic compounders, like Autofarm, more on this later. When the reward is locked for some time, it may go down a lot during this period, and your yield will be smaller than expected. Be sure to include this in your risk assessment.&lt;/p&gt;\n\n&lt;h1&gt;Advanced strategies&lt;/h1&gt;\n\n&lt;p&gt;When you get familiar with DeFi, you might want to try some advanced stuff, combining multiple protocols together to boost your yields even further. These come with more risk and usually involve some kind of leverage, so be careful. There are plenty of options, lets check some usual or popular options.Some of these strategies:  &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Recursive lending&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;This is when you lend your asset to a DeFi protocol and borrow it right back, then supply it into the same protocol. You can do the loop several time until limit is reached, the limit is a function of collateral factor. So lets say you deposit $1k and collateral factor is 80%, you can max you position to 1/(1-CF), so to $5k deposit and $4k borrow position. There will be a lot of transactions doing this, so you need cheap chain or big deposit to be worthy. This strategy is profitable if deposit interest is bigger than borrow interest, which is possible when incentive token rewards are high. But you will need to do constant compounding to avoid liquidation (without it your debt grows). You need to monitor the incentive token price and the APYs, so you can recognize when its no longer profitable.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;a href=\"https://www.tranquil.finance/\"&gt;https://www.tranquil.finance/&lt;/a&gt; is one place this is possible at this moment&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Lend and borrow, then put into LP&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Some protocols do not allow recursive lending, you can maybe circumvent this with multiple accounts, or you can do something else, like deposit USDT, borrow USDC, sell half of the USDC for USDT and put it in LP pool. Again, you need high incentive token rewards to make it profitable.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Automated compounding&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;As compounding on some platforms is costly due to blockchain fees, solution is to use automated compounder, like Autofarm, which does all the work for you in optimal way. You add some risk by doing this, if the auto compounding protocol gets compromised, you also lose your deposit.Examples:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Autofarm: &lt;a href=\"https://autofarm.network/\"&gt;https://autofarm.network/&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;Beefy: &lt;a href=\"https://beefy.finance/\"&gt;https://beefy.finance/&lt;/a&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;Leveraged yield farming&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Basically you provide liquidity, while borrowing additional money to get more yield. You pay interest to lenders, but you earn more of the incentive tokens and fees. You put your money as collateral. Examples: &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Alpaca: &lt;a href=\"https://app.alpacafinance.org/farm\"&gt;https://app.alpacafinance.org/farm&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;Tulip: &lt;a href=\"https://tulip.garden/leverage\"&gt;https://tulip.garden/leverage&lt;/a&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;Anchor+Mirror&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Anchor protocol is one of the most favorite places to earn interest on stablecoins, with stable 19.5% its a no brainer. But you can get more when combining with Mirror protocol. This is covered in depth in many articles, so i am not going to repeat it: just google Anchor Mirror delta neutral strategy.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;a href=\"https://www.anchorprotocol.com/\"&gt;https://www.anchorprotocol.com/&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;&lt;a href=\"https://mirrorprotocol.app\"&gt;https://mirrorprotocol.app&lt;/a&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;Anchor+MIM leverage&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Another thing people have been doing is basically leveraging your position. You borrow MIM against your aUST tokens (representing your deposit), sell MIM for UST, deposit again. I have never done this though, &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;a href=\"https://www.anchorprotocol.com/\"&gt;https://www.anchorprotocol.com/&lt;/a&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;Nexus&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Next generation of these combined strategies is automated. Nexus Protocol is a great example: you deposit LUNA or ETH(PoS version) to nexus, it uses it as collateral in Anchor to borrow UST, deposits the UST to Anchor for additional yield, it monitors and maintains your LTV to ensure you are not liquidated, sell you profits for LUNA/ETH and it results in safer and higher yield. &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Check it out: &lt;a href=\"https://nexusprotocol.app/\"&gt;https://nexusprotocol.app/&lt;/a&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;h1&gt;Moving funds between chains&lt;/h1&gt;\n\n&lt;p&gt;If you are going the DeFi way, you may need to move funds between chains a lot. Especially valid for stablecoins and WBTC. Some tips to do this effectively:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Register on exchanges which support withdrawals and depostits to multiple chains: Binance, Bitfinex, Crypto. com - you can deposit with one chain, withdraw with other, usually paying some withdrawal fees&lt;/li&gt;\n&lt;li&gt;For swapping one stablecoin for another, use Binance rather than DEX, as fees are way lower. (if low cost is a priority, understandably for some of you priorites might be different, or you dont have binance available etc.)&lt;/li&gt;\n&lt;li&gt;Learn how to use multichain router: &lt;a href=\"https://app.multichain.org/#/router\"&gt;https://app.multichain.org/#/router&lt;/a&gt; for cheap cross chain transfers&lt;/li&gt;\n&lt;li&gt;For larger amounts, avoid services which charge percentual fees&lt;/li&gt;\n&lt;li&gt;Swapping to one crypto and than back for cross chain transafers is sometimes possible, but usually not very cheap and might trigger taxable event. Sometimes it might be only option though.&lt;/li&gt;\n&lt;li&gt;Ethereum bridges are usually the most expensive way to do this, unless you are handling very large amounts&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;Some additional tips:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;If you just starting with few hundreds dollars, don&amp;#39;t bother with DeFi. You will get crushed by blockchain fees. Use some CeFi lender with free withdrawals to accumulate, when you have more, you can start with DeFi. Also these CeFis will often give you nice sign-up bonuses, which will probably be worth a lot more than the interest, so be sure to get it. You can even jump between several CeFis to collect more of it. If still want to do DeFi, use a cheap chain. Harmony and Solana come to mind. Avoid Ethereum.&lt;/li&gt;\n&lt;li&gt;Don&amp;#39;t get attached to a specific chain, good opportunities appear on different chains every time, it does not make sense to limit yourself to one favorite. Of course, if you are hodling SOL token, you will probably find best opportunities on Solana network, but with universal assets like stablecoins or BTC, it can be anywhere.&lt;/li&gt;\n&lt;li&gt;Always monitor your gains. If something doesn&amp;#39;t add up, investigate and be prepared to move your funds.&lt;/li&gt;\n&lt;li&gt;Depending on your jurisdiction, you might have to pay taxes on your lending/staking/LP gains. &lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;My favorite CeFi products:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Hodlnaut.com&lt;/li&gt;\n&lt;li&gt;Ledn.io&lt;/li&gt;\n&lt;li&gt;Celsius&lt;/li&gt;\n&lt;li&gt;FTX&lt;/li&gt;\n&lt;li&gt;Less known, but very promising: Vauld&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;My favorite DeFi products:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Anchor Protocol - note that Anchor Yield reserve is bleeding rapidly, its possible that yield will go down. &lt;/li&gt;\n&lt;li&gt;Tranquil.finance on Harmony (+Mimas clone from the same team on Cronos)&lt;/li&gt;\n&lt;li&gt;TraderJoe on Avalanche&lt;/li&gt;\n&lt;li&gt;Sovryn on RSK&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Note: this is an updated post from January, update includes: some more strategies a tips, more specific examples. Added cross-chain transfers tips.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 303,
  "permalink": "/r/CryptoCurrency/comments/soiu05/earn_interest_on_crypto_and_stablecoins_begginer/",
  "subreddit": "CryptoCurrency",
  "id": "soiu05",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Generating yield on crypto is a booming thing. There are many ways to boost your\ngains, this includes lending, staking, liquidity providing, etc. You can do this\nwith CeFi and DeFi. This is an updated attempt to provide guide for begginers,\nbut even experieneced user might find some useful…"
}