{
  "author": "yagebo99",
  "original_created_utc": 1645457835,
  "title": "Is it honest to say that you have \"read\" a book when you actually only listened to the audiobook?",
  "created_utc": 1645466474,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I love listening to audiobooks in my free time, it&amp;#39;s one of my favorite hobbies! The reason I prefer them to conventional books is because I suffer from dyslexia, and reading plain text can get cumbersome on my eyes after extended periods of time. &lt;/p&gt;\n\n&lt;p&gt;A friend one time told me that it is not true to tell other people that I have &amp;quot;read&amp;quot; a certain book if I have only listened to the audiobook associated with it. Other than the fact that I literally did not read the book in question, one supposedly does not comprehend the content as well when merely listening. Is that true?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 112,
  "permalink": "/r/NoStupidQuestions/comments/sxweet/is_it_honest_to_say_that_you_have_read_a_book/",
  "subreddit": "NoStupidQuestions",
  "id": "sxweet",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I love listening to audiobooks in my free time, it's one of my favorite hobbies!\nThe reason I prefer them to conventional books is because I suffer from\ndyslexia, and reading plain text can get cumbersome on my eyes after extended\nperiods of time.\n\nA friend one time told me that it is not true to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は空き時間にオーディオブックを聴くのが大好きです！私の趣味の一つです。\nなぜ、従来の本よりオーディオブックが好きなのかというと、私は \"本 \"が苦手だからです。\nディスレクシア（難読症）なので、普通の文字を読むと目が疲れることがあります。\nということです。\n\nある時、友人から「そんなことはない」と言われ...",
      "title": "オーディオブックを聴いただけなのに、「読んだ」と言うのは正直なところでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我喜欢在空闲时间听有声书，这是我最喜欢的爱好之一！我喜欢听有声书而不是传统的书。\n我喜欢听有声书而不是传统书籍的原因是我患有\n阅读障碍症，长时间阅读纯文本会让我的眼睛感到很累。\n时间后，我的眼睛会变得很累。\n\n有一次，一位朋友告诉我，这并不是真的...",
      "title": "如果说你 \"读 \"了一本书，而实际上你只听了有声书，这是否诚实？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我喜歡在空閒時間聽有聲書，這是我最喜歡的愛好之一！我喜歡聽有聲書而不是傳統的書。\n我喜歡聽有聲書而不是傳統書籍的原因是我患有\n閱讀障礙症，長時間閱讀純文本會讓我的眼睛感到很累。\n時間後，我的眼睛會變得很累。\n\n有一次，一位朋友告訴我，這並不是真的...",
      "title": "如果說你 \"讀 \"了一本書，而實際上你只聽了有聲書，這是否誠實？"
    }
  ]
}