{
  "author": "Professional_Mall_95",
  "the_new_excerpt": "Hi!\n\nI have recently been the recipient of a $10M+ windfall. Eventually, my plan is\nto deploy a simple 3-fund strategy (probably using DCA), rebalanced ~yearly, and\nlive off the returns (I am in my early 40s).\n\nI am very analytical, and have previously managed large-ish amounts of…",
  "original_created_utc": 1623707222,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは。\n\n私は最近、1000万円以上の大金を手にしました。最終的に私が考えているのは\nシンプルな3つのファンド戦略（おそらくDCAを使用）を展開し、年に1回リバランスして\nそのリターンで生活することです（私は40代前半です）。\n\n私は非常に分析的で、以前は大規模なファンドを運用していました。",
      "title": "3ファンド展開の風穴と実務面"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好!\n\n我最近获得了1000多万美元的意外之财。最终，我的计划是\n部署一个简单的3个基金策略（可能使用DCA），每年重新平衡一次，然后\n靠收益过活（我已经40岁出头了）。\n\n我的分析能力很强，以前曾管理过大量的资金。",
      "title": "3个基金部署的风向标和实际问题"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好!\n\n我最近獲得了1000多萬美元的意外之財。最終，我的計劃是\n部署一個簡單的3個基金策略（可能使用DCA），每年重新平衡一次，然後\n靠收益過活（我已經40歲出頭了）。\n\n我的分析能力很強，以前曾管理過大量的資金。",
      "title": "3個基金部署的風向標和實際問題"
    }
  ],
  "title": "Windfall and practical aspects of 3-fund deployment",
  "created_utc": 1623719935,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi!</p>\n\n<p>I have recently been the recipient of a $10M+ windfall. Eventually, my plan is to deploy a simple 3-fund strategy (probably using DCA), rebalanced ~yearly, and live off the returns (I am in my early 40s).</p>\n\n<p>I am very analytical, and have previously managed large-ish amounts of money professionally, though it was not mine then.</p>\n\n<p>I have read the windfall article on Bogleheads&#39; wiki, and did my fair amount of research. However I still have a few questions:</p>\n\n<h3>A) Brokerage Account:</h3>\n\n<p>In this day and age, most brokerage offer free trades. If one is going to simply buy some Vanguard ETFs (VTI, BND and VXUS), what would be wrong with just using the brokerage service associated with my bank (e.g. BoA or Wells Fargo)?</p>\n\n<p>What would be the main downside? If I look at the &quot;Cons&quot; on <a href=\"https://www.brokerage-review.com/investing-firm/assets-under-management/wells-fargo-aum.aspx\">https://www.brokerage-review.com/investing-firm/assets-under-management/wells-fargo-aum.aspx</a>, none look like it would have any impact on a 3-fund strategy with occasional rebalancing.</p>\n\n<p>Also, would it make sense to split the stock/ETF holdings into separate brokerage account for risk management purposes (like one should split cash accounts when cash &gt; 250K)? or using one brokerage firm is fine?</p>\n\n<h3>B) FDIC</h3>\n\n<p>If one keeps more than 250K in cash, should one automatically just split it into different accounts? Once again, if one uses a national bank such as BoA, Chase etc... is it really necessary? If yes, should I just ask a banker to open 10 accounts if you want to store $2.5M in cash?</p>\n\n<h3>C) None taxable accounts</h3>\n\n<p>By now, I won&#39;t be able to make any contributions to IRA or 401K accounts... the common advise on BogleHeads is to put all the bonds in there (BND) to avoid paying short term capital gain. Putting aside the potential change of treatment of long term capital gain, does it really matter now?</p>\n\n<p>Should I just move all the non-taxable stuff (about $200K) to BND none the less? or is this a red herring?</p>\n\n<h3>D) Do I need a Financial Advisor?</h3>\n\n<p>I just have a very hard time giving away 1% or even 0.5% for what appears to be nothing. But given the size of the windfall, do I need someone? It feels like the only thing worthy would be paying an estate and/or tax attorney (with fiduciary duty) for estate planning and maybe some tax advices.</p>\n\n<p>Besides hiring a CPA to deal with my taxes, am I missing anybody else as far professional help goes?</p>\n\n<p>&#x200B;</p>\n\n<p>Thanks a lot for y&#39;alls help!</p>\n</div><!-- SC_ON -->",
  "score": 31,
  "permalink": "/r/Bogleheads/comments/nzxxqm/windfall_and_practical_aspects_of_3fund_deployment/",
  "subreddit": "Bogleheads",
  "id": "nzxxqm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009741229
}