{
  "author": "normie_sama",
  "the_new_excerpt": "As I understand it, the Kingdom of Bohemia and Slovakia under the Kingdom of\nHungary would have been administered separately, not to mention that until the\n16th century Hungary itself was independent. Was there any sort of \"national\nconsciousness\" transcending these boundaries? How did the two…",
  "original_created_utc": 1620613042,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の理解では、ハンガリー王国傘下のボヘミア王国とスロバキアは別々に管理されていました。\nハンガリー王国の下にあるボヘミア王国とスロバキアは別々に管理されていただろうし、言うまでもなく16世紀まではハンガリー自体が独立していた。\n16世紀まではハンガリー自体が独立していたのですから。境界を越えた「民族意識」のようなものはあったのでしょうか？\n境界を越えた「民族意識」はあったのか？2つの国はどのように...",
      "title": "ハプスブルク帝国の崩壊後、チェコ人とスロバキア人は、すぐには個々の国民国家を形成せず、単一の国家であるチェコスロバキアに合併されました。なぜでしょうか？また、チェコスロバキアの成立にはどのような歴史的背景があったのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "根据我的理解，波西米亚王国和斯洛伐克在匈牙利王国的统治下，本来是分开管理的。\n匈牙利本来是分开管理的，更不用说直到16世纪匈牙利本身还是独立的。\n更不用说直到16世纪匈牙利本身还是独立的。是否存在任何形式的 \"民族\n有没有超越这些边界的 \"民族意识\"？这两个国家是如何...",
      "title": "哈布斯堡帝国灭亡后，捷克人和斯洛伐克人被合并为一个国家，即捷克斯洛伐克，而不是立即形成个别民族国家。为什么？捷克斯洛伐克的形成背后的历史背景是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "根據我的理解，波西米亞王國和斯洛伐克在匈牙利王國的統治下，本來是分開管理的。\n匈牙利本來是分開管理的，更不用說直到16世紀匈牙利本身還是獨立的。\n更不用說直到16世紀匈牙利本身還是獨立的。是否存在任何形式的 \"民族\n有沒有超越這些邊界的 \"民族意識\"？這兩個國家是如何...",
      "title": "哈布斯堡帝國滅亡後，捷克人和斯洛伐克人被合併爲一個國家，即捷克斯洛伐克，而不是立即形成個別民族國家。爲什麼？捷克斯洛伐克的形成背後的歷史背景是什麼？"
    }
  ],
  "title": "After the fall of the Habsburg Empire, the Czechs and Slovaks were amalgamated into a single state, Czechoslovakia, rather than immediately forming individual nation-states. Why? What was the historical context behind the formation of Czechoslovakia?",
  "created_utc": 1620628420,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As I understand it, the Kingdom of Bohemia and Slovakia under the Kingdom of Hungary would have been administered separately, not to mention that until the 16th century Hungary itself was independent. Was there any sort of &quot;national consciousness&quot; transcending these boundaries? How did the two ethnic groups see themselves in comparison to each other and the outside world?</p>\n</div><!-- SC_ON -->",
  "score": 126,
  "permalink": "/r/AskHistorians/comments/n8ten2/after_the_fall_of_the_habsburg_empire_the_czechs/",
  "subreddit": "AskHistorians",
  "id": "n8ten2",
  "is_self": true,
  "media": null,
  "is_video": false
}