{
  "author": "spritecut",
  "the_new_excerpt": "Cyber criminals have increasingly turned to social engineering because it is a\nhighly-effective and subtle way to gain credentials and access to troves of\nvaluable assets.\n[https://www.social-engineer.org/social-engineering/social-engineering-infographic/]\n\nHere are some statistics you need to know…",
  "original_created_utc": 1624078141,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "サイバー犯罪者がソーシャルエンジニアリングを利用するようになったのは、ソーシャルエンジニアリングが非常に効果的かつ巧妙な方法であるためです。\nサイバー犯罪者がソーシャル・エンジニアリングに目を向けるようになったのは、認証情報や大量の貴重な資産へのアクセスを得るための効果的かつ巧妙な方法だからです。\nソーシャルエンジニアリングを利用するようになりました。\n[https://www.social-engineer.org/social-engineering/social-engineering-infographic/]\n\n知っておきたい統計データをご紹介します。",
      "title": "ハッキングの90%はソーシャルエンジニアリングとフィッシング攻撃によるもの"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "网络犯罪分子越来越多地转向社会工程，因为它是一种高度有效和微妙的方式来获取证书和访问大量的信息。\n因为它是一种高度有效和微妙的方式来获得证书和访问大量的有价值的资产。\n有价值的资产。\n[https://www.social-engineer.org/social-engineering/social-engineering-infographic/]\n\n这里有一些你需要知道的统计数据...",
      "title": "90%的黑客都是社会工程和网络钓鱼攻击造成的"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "網絡犯罪分子越來越多地轉向社會工程，因爲它是一種高度有效和微妙的方式來獲取證書和訪問大量的信息。\n因爲它是一種高度有效和微妙的方式來獲得證書和訪問大量的有價值的資產。\n有價值的資產。\n[https://www.social-engineer.org/social-engineering/social-engineering-infographic/]\n\n這裏有一些你需要知道的統計數據...",
      "title": "90%的黑客都是社會工程和網絡釣魚攻擊造成的"
    }
  ],
  "title": "90% of All Hacks are Due to Social Engineering and Phishing Attacks",
  "created_utc": 1624113264,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Cyber criminals have increasingly turned to social engineering because it is a highly-effective and subtle way to gain  credentials and access to troves of valuable assets<a href=\"https://www.social-engineer.org/social-engineering/social-engineering-infographic/\">.</a> </p>\n\n<p>Here are some statistics you need to know about social engineering...and how to protect yourselves.</p>\n\n<h3>- 55% of all emails are spam. (Symantec)</h3>\n\n<p>Considering the sheer volume of emails that many of us receive each day, this statistic is important. You may be able to spot more common red flags or obvious spam, but this constant flow of messages wears down your ability to spot the more subtle tricks embedded in messages that are just a few degrees off.</p>\n\n<h3>- Only about 3% of malware tries to exploit an exclusively technical flaw. The other 97% instead targets users through Social Engineering. (KnowBe4)</h3>\n\n<p>Cyber criminals know that people are often the gateway to valuable credentials and databases or account details. With a simple trick or digital slight of hand on a bad day, they know you could be an easier target than running every username-password combination in a data dump until they get a hit.</p>\n\n<h3>- 91% of attacks by sophisticated cyber criminals start through email. (Mimecast)</h3>\n\n<p>We must pay more attention to the emails we send and receive! Take the extra time to communicate sensitive information in person, if possible. Be careful about what information you share with a stranger over email, or what information you put about yourself on social media. Sophisticated phishing scams have been known to use information about your networks and position through LinkedIn or Facebook to gain just enough details about you to seem plausible, or pique your curiosity.</p>\n\n<h2>This may be the most important information of all!</h2>\n\n<h3>- The top emotional motivators behind successful phishes are entertainment, social, and reward or recognition. (PhishMe)</h3>\n\n<p>As more companies adopt preventative measures, the older motivators like fear and curiosity have caused fewer successful phishing scams. This means that &#39;consumer scams&#39; targeting employees personally while on the job have increased in frequency. The lines can become blurry when employees are using personal devices for work or checking their social or news notifications whilst taking a break. Improving endpoint device security is one way to combat this shift in phishing tactics. Be careful what you click on.</p>\n\n<p>Here’s a fascinating infographic - \n<a href=\"https://www.dailymotion.com/video/x6b3kz\">https://www.social-engineer.org/wp-content/uploads/2014/04/SocialEngineeringInfographic.jpg </a> </p>\n\n<h3>Stay Safe out there and never give up information!</h3>\n</div><!-- SC_ON -->",
  "score": 172,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/K5evbPoX8VImcZgxDXbJDk2DXD5-C0A8peu2TDiia40.jpg?auto=webp&s=35b130e8d8ecdf047bd202aeb522d281821d7816",
          "width": 618,
          "height": 531
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/K5evbPoX8VImcZgxDXbJDk2DXD5-C0A8peu2TDiia40.jpg?width=108&crop=smart&auto=webp&s=d33e8552276442841f771b0774037315bdb0b1f7",
            "width": 108,
            "height": 92
          },
          {
            "url": "https://external-preview.redd.it/K5evbPoX8VImcZgxDXbJDk2DXD5-C0A8peu2TDiia40.jpg?width=216&crop=smart&auto=webp&s=05d2ab508d36fa7c8412351562c2ffa8104a248b",
            "width": 216,
            "height": 185
          },
          {
            "url": "https://external-preview.redd.it/K5evbPoX8VImcZgxDXbJDk2DXD5-C0A8peu2TDiia40.jpg?width=320&crop=smart&auto=webp&s=a52752b526cf6720c25fb477c35bea733da5d178",
            "width": 320,
            "height": 274
          }
        ],
        "variants": {},
        "id": "HBYDwW_P8pIHsraR0eV_MpHFchAIYUxHrChAHhF0YQI"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/o38fxw/90_of_all_hacks_are_due_to_social_engineering_and/",
  "subreddit": "CryptoCurrency",
  "id": "o38fxw",
  "is_self": true,
  "media": null,
  "is_video": false
}