{
  "author": "bergonie",
  "original_created_utc": 1640803057,
  "title": "Do you rehearse conversations?",
  "created_utc": 1640876405,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I paid attention to how many times in one day I go over conversations out loud to myself and... it&amp;#39;s A LOT. I rehearse conversations I&amp;#39;m about to have, I re-do conversations I just had, I practice anecdotes, I will talk as though someone asked me a question and answer it. These aren&amp;#39;t big or important things either, and most of the time I never end up talking about this stuff because it&amp;#39;s all in my head. Imagine all the things I could do if I dedicated half my brain power to something else. Sometimes it makes me feel inauthentic because if I&amp;#39;m talking to someone for real, it feels weird because it isn&amp;#39;t a genuine reaction - I&amp;#39;ve probably gone over and over this moment already. Am I the only one?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/rrf5qu/do_you_rehearse_conversations/",
  "subreddit": "TooAfraidToAsk",
  "id": "rrf5qu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I paid attention to how many times in one day I go over conversations out loud\nto myself and... it's A LOT. I rehearse conversations I'm about to have, I re-do\nconversations I just had, I practice anecdotes, I will talk as though someone\nasked me a question and answer it. These aren't big or…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "一日のうちに何回、会話を声に出して確認するか、注意してみました。\n自分自身に......それはとても多い。これからする会話のリハーサルをしたり、やり直しをしたり\n今したばかりの会話、逸話の練習、誰かに言われたように話す。\nと質問され、それに答える。これらは大げさでもなんでもなく...",
      "title": "会話のリハーサルはしているのですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我注意到我在一天内大声地复述了多少次对话\n的次数，而且......很多。我预演了我将要进行的对话，我重新做了一遍\n我练习轶事，我会说得好像有人问我问题一样，然后回答。\n我会说得好像有人问了我一个问题并回答了它。这些都不是大的或...",
      "title": "你是否排练过对话？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我注意到我在一天內大聲地複述了多少次對話\n的次數，而且......很多。我預演了我將要進行的對話，我重新做了一遍\n我練習軼事，我會說得好像有人問我問題一樣，然後回答。\n我會說得好像有人問了我一個問題並回答了它。這些都不是大的或...",
      "title": "你是否排練過對話？"
    }
  ]
}