{
  "author": "sgtslaughterTV",
  "the_new_excerpt": "Forenote / Disclaimer: this thread is designed for you to not lose money but\nalso shouldn't be taken as financial advice. I am telling you what NOT to buy.\nShow this to your friends who want to \"get rich overnight.\"\n\nThere are quite a few users who have spilt over in to our subreddit…",
  "original_created_utc": 1612221845,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "前注/免责声明：本主题是为了让你不亏损，但\n也不应该被当作理财建议。我是在告诉你哪些东西不要买。\n给想 \"一夜暴富 \"的朋友看看。\n\n有不少用户已经溢出到我们的子社区... ...",
      "title": "这个帖子是给所有在Dogecoin、XRP上亏损的人看的，也是为了防止下一个大的PUMP和DUMP。阅读这个帖子以避免损失金钱!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "前注/免責聲明：本主題是爲了讓你不虧損，但\n也不應該被當作理財建議。我是在告訴你哪些東西不要買。\n給想 \"一夜暴富 \"的朋友看看。\n\n有不少用戶已經溢出到我們的子社區... ...",
      "title": "這個帖子是給所有在Dogecoin、XRP上虧損的人看的，也是爲了防止下一個大的PUMP和DUMP。閱讀這個帖子以避免損失金錢!"
    }
  ],
  "title": "This thread is for everyone who lost money on Dogecoin, XRP and to prevent the NEXT BIG PUMP AND DUMP. Read this thread to avoid losing money!",
  "created_utc": 1612298010,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Forenote / Disclaimer: this thread is designed for you to not lose money but also shouldn&#39;t be taken as financial advice. I am telling you what NOT to buy. Show this to your friends who want to &quot;get rich overnight.&quot;</strong>               </p>\n\n<p>There are quite a few users who have spilt over in to our subreddit from wallstreetbets and the dogecoin sub and god knows where else. After seeing this not only happen with a coin that was designed as a MEME and nothing more and then happening with XRP, I feel like there is an elephant in the room that needs to be addressed.                 </p>\n\n<p><a href=\"https://np.reddit.com/r/CryptoCurrency/comments/kp6s43/inside_a_pumpanddump_group_the_deception_the_con/\">please read this thread</a> on how a pump and dump group operates. If you don&#39;t have time, the TL;DR is - they buy tokens / coins anywhere from a few minutes to a few hours before the head of the group tells everyone to pump a coin. Then they dump their coins without telling you. They claim you get &quot;insider&quot; information if you give them 0.01 BTC or invite 30 people to the group.                  </p>\n\n<h1><strong>Pay attention to these fundamentals:</strong></h1>\n\n<ol>\n<li>It doesn&#39;t actually matter if there is a cryptocurrency that is more efficient, more secure, faster, or better in general because....<br/></li>\n<li>You will not see people who mined bitcoin for nearly free in 2010, or bought it at 10 cents each, 1 dollar each, 10 dollars each, 100 dollars each, or 1000 dollars each dumping at 34,000 USD for a token that almost no one has heard of. Even if such a thing existed, you couldn&#39;t get everyone to agree on when / how to dump their bitcoin for &quot;something better&quot;, this was tried with bitcoin cash and the market has spoken.<br/></li>\n<li>Financial institutions aren&#39;t interested in anything except bitcoin right now (and are <strong>much less interested in something the SEC has legal issues with</strong>) because it functions as a hedge against inflation and it has verifiable scarcity.<br/></li>\n<li>You need to pay attention to <strong>market capitalization</strong> (market cap for short) of a cryptocurrency. Go to coingecko.com. Check out the market cap of your &quot;coin&quot; and then compare it to bitcoin&#39;s marketcap. In order for it to surpass ethereum it needs to get 130 billion USD of fresh capital quickly. If it wants to get past bitcoin, it needs to get at least 600 billion USD of new capital. with that in mind...<br/></li>\n<li>If your token is under 50 cents but it&#39;s in the top 100, do the math and figure out how / what it would need to get &quot;past bitcoin&quot;. Just because it&#39;s &quot;cheaper than bitcoin&quot; doesn&#39;t mean everyone wants to buy it.<br/></li>\n</ol>\n\n<p>Hopefully this thread has been helpful. That is all. Thank you for reading. Show it to a friend who doesn&#39;t know what he or she is doing.</p>\n</div><!-- SC_ON -->",
  "score": 161,
  "permalink": "/r/CryptoCurrency/comments/lahezu/this_thread_is_for_everyone_who_lost_money_on/",
  "subreddit": "CryptoCurrency",
  "id": "lahezu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518530876
}