{
  "author": "Many_Scratch2269",
  "original_created_utc": 1635044577,
  "title": "The US Dollar has to devaluate significantly in order for the US to pay off its debt. If you don't invest in Crypto soon, you will regret it later.",
  "created_utc": 1635061032,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The US debt currently sits at more than 28 Trillion dollars. This is 140% of the US GDP. There is absolutely no way the US can pay this much debt off without devaluating the dollar. The US has already printed more than 50% of its dollar supply in the last 2 years alone. We are already seeing supply shocks happening and inflation rising.</p>\n\n<p>It won&#39;t be stopping anytime soon either. The US keeps touching its debt ceiling faster and faster and the debt is rising exponentially. </p>\n\n<p><a href=\"https://preview.redd.it/o0bl8z7u8bv71.jpg?width=910&amp;format=pjpg&amp;auto=webp&amp;s=7f9110b2bca502cfdb3d2ddc7f37801609f4f6f2\">https://preview.redd.it/o0bl8z7u8bv71.jpg?width=910&amp;format=pjpg&amp;auto=webp&amp;s=7f9110b2bca502cfdb3d2ddc7f37801609f4f6f2</a></p>\n\n<p>Just in case you forgot earlier, in order to pay this debt, the US will have to devaluate the dollar significantly. Guess what happens when the US dollar devaluate? Other countries will also follow. </p>\n\n<p><strong>Currencies pegged with the US dollar</strong>: Aruban florin, Bahamian dollar, Bahraini Dinar, Barbadian dollar, Belize dollar, Bermudian dollar, Cayman Islands dollar, Cuban convertible peso, Djiboutian franc, East Caribbean dollar, East Timor centavo coin, Eritrean Nakfa, Hong Kong dollar, Jordanian dinar, Lebanese pound, Netherlands Antillean guilder, Omani rial, Panamian balboa, Qatari riyal, Saudi riyal, United Arab Emirates dirham, Venezuelan bolivar.</p>\n\n<p>The takeaway from this is that Cryptocurrencies are going to be extremely valuable in the future. You probably already know this, but Crypto is going to be more valuable than what you currently think because not only is there significant inflation already, it is only going to get worse as countries have to pay off their debt. </p>\n\n<p>The US isn&#39;t alone in their debt crisis however. Almost every country has to inflate away their debt. The inflation we are seeing currently is nothing considering what might come in the future.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/hbjxq4ahbbv71.png?width=560&amp;format=png&amp;auto=webp&amp;s=1c57542af8aacf7ada28e9cb35a5273601f70875\">*significantly more as of Q4 21</a></p>\n\n<p>How do you think the world is going to pay all this debt off? Short answer, it can&#39;t. Inflation is going to be huge. Crypto is currently the best way to avoid inflation. Crypto literally has deflationary currencies right now while some countries are facing severe inflation. Crypto is one of your only bets to survive the coming inflation. The inflation we are seeing currently is severely underestimated as the CPI doesn&#39;t count the housing market and other assets that have ballooned in the last 2 years alone.</p>\n\n<p>TLDR: Countries are going to have to inflate their currencies to pay off their debt (especially after the pandemic, we are already seeing a huge inflation rise) and one of the only ways you can avoid inflation and take advantage of the situation is to invest in Crypto. Invest while you can because inflation will ruin your financial condition in the future if you keep holding your wealth in fiat.</p>\n</div><!-- SC_ON -->",
  "score": 186,
  "permalink": "/r/CryptoCurrency/comments/qejlw6/the_us_dollar_has_to_devaluate_significantly_in/",
  "subreddit": "CryptoCurrency",
  "id": "qejlw6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The US debt currently sits at more than 28 Trillion dollars. This is 140% of the\nUS GDP. There is absolutely no way the US can pay this much debt off without\ndevaluating the dollar. The US has already printed more than 50% of its dollar\nsupply in the last 2 years alone. We are already seeing supply…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "米国の負債は現在、28兆ドルを超えています。これは米国のGDPの140％に相当します。\nアメリカのGDPの140％にあたります。ドルの価値を下げずに、米国がこれだけの負債を返済することは絶対に不可能です。\nドルを切り下げることなく、これだけの負債を返済することはできません。米国は過去2年間で、ドル供給量の50％以上を刷っています。\nこの2年間だけで、アメリカはすでにドルの供給量の50％以上を刷っています。私たちはすでに、供給が...",
      "title": "アメリカが借金を返済するためには、米ドルが大幅に切り下げられなければならない。早くCryptoに投資しないと、後で後悔することになります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "美国的债务目前超过了28万亿美元。这相当于美国GDP的140%。\n美国国内生产总值的140%。美国绝对不可能在不使美元贬值的情况下偿还这么多债务。\n美元贬值。美国已经印制了超过50%的美元\n仅仅在过去的两年里，美国已经印制了超过50%的美元供应。我们已经看到供应...",
      "title": "美元必须大幅贬值，以使美国能够偿还其债务。如果你不尽快投资于加密货币，你以后会后悔的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "美國的債務目前超過了28萬億美元。這相當於美國GDP的140%。\n美國國內生產總值的140%。美國絕對不可能在不使美元貶值的情況下償還這麼多債務。\n美元貶值。美國已經印製了超過50%的美元\n僅僅在過去的兩年裏，美國已經印製了超過50%的美元供應。我們已經看到供應...",
      "title": "美元必須大幅貶值，以使美國能夠償還其債務。如果你不盡快投資於加密貨幣，你以後會後悔的。"
    }
  ]
}