{
  "author": "FaceofMoe",
  "original_created_utc": 1629223211,
  "title": "Considering Muhammad had several wives who were well-educated and scholarly, how did sects of Islam become so hostile to educating women?",
  "created_utc": 1629230878,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Upon reading about the wives of Muhammad, I was taken aback by how active and well educated many of his wives appeared to be. Particularly the scholarly background of Aisha bint Abu Bakr. Given that foundation, how then did certain sects of Islam come to demonize the education of women?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/p68sm4/considering_muhammad_had_several_wives_who_were/",
  "subreddit": "AskHistorians",
  "id": "p68sm4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Upon reading about the wives of Muhammad, I was taken aback by how active and\nwell educated many of his wives appeared to be. Particularly the scholarly\nbackground of Aisha bint Abu Bakr. Given that foundation, how then did certain\nsects of Islam come to demonize the education of women?",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ムハンマドの妻たちについての記事を読んで、私は彼の妻たちの多くが活発で教養があることに驚かされました。\n私は、ムハンマドの妻たちがいかに活発で教養があるかに驚かされました。特に、学者としての\n特にアイシャ・ビント・アブ・バクルの学者としての素養には驚かされました。このような基盤があるにもかかわらず、イスラム教の一部の宗派は、なぜ\n女性の教育を悪者扱いするようになったのでしょうか？",
      "title": "ムハンマドには教養のある学者の妻が何人もいたことを考えると、イスラムの各宗派はなぜ女性の教育を敵視するようになったのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在阅读关于穆罕默德的妻子们的文章时，我对他的许多妻子的活跃和受教育程度感到吃惊。\n他的许多妻子似乎都受过良好的教育。特别是艾莎-艾布-伯克尔的学术背景\n艾莎-宾特-艾布-贝克尔的学术背景。鉴于这种基础，那么某些\n伊斯兰教的某些教派是如何将妇女的教育妖魔化的？",
      "title": "考虑到穆罕默德有几个妻子都受过良好的教育和学术研究，伊斯兰教的各个教派怎么会对教育妇女的行为如此敌视？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在閱讀關於穆罕默德的妻子們的文章時，我對他的許多妻子的活躍和受教育程度感到喫驚。\n他的許多妻子似乎都受過良好的教育。特別是艾莎-艾布-伯克爾的學術背景\n艾莎-賓特-艾布-貝克爾的學術背景。鑑於這種基礎，那麼某些\n伊斯蘭教的某些教派是如何將婦女的教育妖魔化的？",
      "title": "考慮到穆罕默德有幾個妻子都受過良好的教育和學術研究，伊斯蘭教的各個教派怎麼會對教育婦女的行爲如此敵視？"
    }
  ]
}