{
  "author": "anetanetanet",
  "the_new_excerpt": "I was watching Benefits Britain - which honestly is pretty skewed to make people\non benefits look like lazy moochers... And that's a huge issue in and of itself.\n\nBut still, the question stands. What the hell is up with these people? Like\nthere's no way you can't think of using protection EVER, why…",
  "original_created_utc": 1623754657,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は「Benefits Britain」を見ていたのですが、これは正直なところ、給付を受けている人を怠け者のように見せるためにかなり偏っています。\n正直なところ、給付金を受け取っている人々を怠惰な拝金主義者のように見せるために、かなり偏った見方をしています...。これは、それ自体が大きな問題です。\n\nしかし、それでも疑問は残ります。この人たちはいったい何なんだろう？とか\nプロテクションを使うことを考えないなんてありえない、なぜ...。",
      "title": "なぜ先進国では11人もの子供を育てる余裕がない人がいるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在看《英国福利》--老实说，这本书很偏向于让领取福利的人看起来像懒惰的乞丐。\n领取福利的人看起来像懒惰的揩油者...... 而这本身就是一个巨大的问题。\n\n但是，问题仍然存在。这些人到底是怎么了？就像\n你不可能永远不考虑使用保护措施，为什么...",
      "title": "为什么发达国家的人有像11个孩子，他们没有能力抚养？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在看《英國福利》--老實說，這本書很偏向於讓領取福利的人看起來像懶惰的乞丐。\n領取福利的人看起來像懶惰的揩油者...... 而這本身就是一個巨大的問題。\n\n但是，問題仍然存在。這些人到底是怎麼了？就像\n你不可能永遠不考慮使用保護措施，爲什麼...",
      "title": "爲什麼發達國家的人有像11個孩子，他們沒有能力撫養？"
    }
  ],
  "title": "Why are there people in developed countries who have like 11 kids they can't afford to raise?",
  "created_utc": 1623819605,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was watching Benefits Britain - which honestly is pretty skewed to make people on benefits look like lazy moochers... And that&#39;s a huge issue in and of itself. </p>\n\n<p>But still, the question stands. What the hell is up with these people? Like there&#39;s no way you can&#39;t think of using protection EVER, why would you choose that for yourself? \nI just don&#39;t understand. Those kids never really get everything they need. And if you can&#39;t afford your current 2 kids, why would you give birth to like six more?! I can understand not being able to get an abortion at some point or some mishap that got you pregnant, but that might happen once or twice - definitely not enough to make a whole football team lol</p>\n\n<p>Have you ever met a family like this? What was their reasoning? Sorry if this questions sounds ignorant but I just want to understand. I just think it&#39;s so selfish to do this to those poor children..</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/NoStupidQuestions/comments/o0blll/why_are_there_people_in_developed_countries_who/",
  "subreddit": "NoStupidQuestions",
  "id": "o0blll",
  "is_self": true,
  "media": null,
  "is_video": false
}