{
  "author": "Shkmstr",
  "original_created_utc": 1635546884,
  "title": "Cashing out 7+ figure portfolios?",
  "created_utc": 1635561891,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Apologies if this has been answered before, I did my best to search but didn’t come up with much. Disclosure, I don’t have this money (I wish I did) but I have a theoretical question. For all the over night Shiba millionaire and billionaires, are they able to cash out? I understand there are fees and taxes but if someone’s $2000 investment was worth $100,000,000 could they just transfer it to another coin and cash it? Could they cash directly from Shiba and would it be worth the value that shows in their portfolio? I have a high school acquaintance on Facebook who had $3000 invested and he’s now flaunting it all over social media calling himself a billionaire showing screenshots of his wallet. Is he really? Thanks for any info.</p>\n</div><!-- SC_ON -->",
  "score": 251,
  "permalink": "/r/CryptoCurrency/comments/qio427/cashing_out_7_figure_portfolios/",
  "subreddit": "CryptoCurrency",
  "id": "qio427",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Apologies if this has been answered before, I did my best to search but didn’t\ncome up with much. Disclosure, I don’t have this money (I wish I did) but I have\na theoretical question. For all the over night Shiba millionaire and\nbillionaires, are they able to cash out? I understand there are fees…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "以前に回答されていたら申し訳ありません。一生懸命検索したのですが、あまり出てきませんでした。\nあまり出てきませんでした。公開すると、私はこのお金を持っていませんが（持っていれば良かったのですが）、理論的な質問があります。\n理論的な質問です。柴犬で億万長者になった人たちは、現金化できているのでしょうか？\n億万長者は、キャッシュアウトできるのでしょうか？手数料がかかることは理解していますが...。",
      "title": "7桁以上のポートフォリオをキャッシュアウトする？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果以前有人回答过这个问题，请原谅，我尽力搜索了一下，但没有找到什么\n但没有发现什么。披露一下，我没有这笔钱（我希望我有），但是我有一个\n一个理论上的问题。对于所有一夜之间成为芝罘区百万富翁和\n亿万富翁，他们能够兑现吗？我知道有一些费用...",
      "title": "兑现7位数以上的投资组合？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果以前有人回答過這個問題，請原諒，我盡力搜索了一下，但沒有找到什麼\n但沒有發現什麼。披露一下，我沒有這筆錢（我希望我有），但是我有一個\n一個理論上的問題。對於所有一夜之間成爲芝罘區百萬富翁和\n億萬富翁，他們能夠兌現嗎？我知道有一些費用...",
      "title": "兌現7位數以上的投資組合？"
    }
  ]
}