{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "There's a quote from Warren Buffett in the preface to *The Intelligent Investor*. \"To invest successfully over a lifetime does not take a stratospheric IQ, unusual business insights, or inside information. What's needed is a sound intellectual framework and the ability to keep emotions from corroding that framework. This book describes the proper framework. You must supply the emotional discipline.\"\n\nPut simply, the Motley Fools are not emotionally disciplined. Or rather, they train us as readers to not be disciplined. Every day, I was bombarded with emails: \"5 new stocks to buy now!\" \"Here's why WXYZ stock dropped today!\"\n\nA long-term investor who believes in a business should not care about why a stock added or dropped in 10% in a day. We should not be trying to time the market with 5 new stocks. We should probably not even care about a quarterly earnings report. As Buffett says, \"My favorite holding period is forever\".\n\nWhat's more, I don't particularly trust the dynamic of withholding \"rule-breaking\" or \"everlasting\" stocks from readers. It's hard enough to get returns that regularly outperform the market. The fact that there are different \"services\" makes me feel as if when I pay for the \"advisor\" subscription, my \"advisor\" is not working as hard as he can on my portfolio. He's withholding information from me. That seems very shady.\n\nIt's possible that the Fools have made 400% over the past 20 years. And it's possible they could continue to make 400%. And I understand they need to upsell to keep their business. But as *The Intelligent Investor* makes clear, you shouldn't wrap your net worth in a speculative account. Most of your money should be in index funds. And if the Fools are going to be pounding at my psyche every day, grinding down my emotional discipline, it doesn't matter how good the picks are. I'm going to make bad decisions.\n\nIdk what all your thoughts are on this sub but that's my feeling on TMF. Probably also my feeling on all the other stock-picking services.",
  "author_fullname": "t2_zdckf",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "I cancelled my membership with Motley Fool today. Their marketing made me do it.",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": "discussion",
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": true,
  "name": "t3_u9ktez",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.87,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 65,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Industry Discussion",
  "can_mod_post": false,
  "score": 65,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": 1650651058,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1650650804,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s a quote from Warren Buffett in the preface to &lt;em&gt;The Intelligent Investor&lt;/em&gt;. &amp;quot;To invest successfully over a lifetime does not take a stratospheric IQ, unusual business insights, or inside information. What&amp;#39;s needed is a sound intellectual framework and the ability to keep emotions from corroding that framework. This book describes the proper framework. You must supply the emotional discipline.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Put simply, the Motley Fools are not emotionally disciplined. Or rather, they train us as readers to not be disciplined. Every day, I was bombarded with emails: &amp;quot;5 new stocks to buy now!&amp;quot; &amp;quot;Here&amp;#39;s why WXYZ stock dropped today!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;A long-term investor who believes in a business should not care about why a stock added or dropped in 10% in a day. We should not be trying to time the market with 5 new stocks. We should probably not even care about a quarterly earnings report. As Buffett says, &amp;quot;My favorite holding period is forever&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;What&amp;#39;s more, I don&amp;#39;t particularly trust the dynamic of withholding &amp;quot;rule-breaking&amp;quot; or &amp;quot;everlasting&amp;quot; stocks from readers. It&amp;#39;s hard enough to get returns that regularly outperform the market. The fact that there are different &amp;quot;services&amp;quot; makes me feel as if when I pay for the &amp;quot;advisor&amp;quot; subscription, my &amp;quot;advisor&amp;quot; is not working as hard as he can on my portfolio. He&amp;#39;s withholding information from me. That seems very shady.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s possible that the Fools have made 400% over the past 20 years. And it&amp;#39;s possible they could continue to make 400%. And I understand they need to upsell to keep their business. But as &lt;em&gt;The Intelligent Investor&lt;/em&gt; makes clear, you shouldn&amp;#39;t wrap your net worth in a speculative account. Most of your money should be in index funds. And if the Fools are going to be pounding at my psyche every day, grinding down my emotional discipline, it doesn&amp;#39;t matter how good the picks are. I&amp;#39;m going to make bad decisions.&lt;/p&gt;\n\n&lt;p&gt;Idk what all your thoughts are on this sub but that&amp;#39;s my feeling on TMF. Probably also my feeling on all the other stock-picking services.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "8acd2324-65e6-11e5-a263-122ab0778f8b",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#4f8ef7",
  "id": "u9ktez",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "SinceSevenTenEleven",
  "discussion_type": null,
  "num_comments": 42,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/u9ktez/i_cancelled_my_membership_with_motley_fool_today/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/u9ktez/i_cancelled_my_membership_with_motley_fool_today/",
  "subreddit_subscribers": 3930575,
  "created_utc": 1650654363,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1650650804,
  "the_new_excerpt": "There's a quote from Warren Buffett in the preface to The Intelligent Investor.\n\"To invest successfully over a lifetime does not take a stratospheric IQ,\nunusual business insights, or inside information. What's needed is a sound\nintellectual framework and the ability to keep emotions from corroding…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "賢明なる投資家』の序文に、ウォーレン・バフェットの言葉がある。\n「生涯にわたって投資を成功させるためには、成層圏のIQが必要なわけではありません。\n内部情報を得る必要はない。必要なのは、健全な\nを蝕むような感情を抑える能力である...」。",
      "title": "今日、Motley Foolの会員を解約しました。彼らのマーケティングがそうさせたのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在《聪明的投资者》的序言中，有一段沃伦-巴菲特的话。\n\"要在一生中成功地进行投资，并不需要有平流层的智商。\n不寻常的商业洞察力，或内部信息。所需要的是一个健全的\n需要的是一个健全的智力框架和保持情绪不被腐蚀的能力......",
      "title": "我今天取消了Motley Fool的会员资格。他们的营销让我这样做。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在《聰明的投資者》的序言中，有一段沃倫-巴菲特的話。\n\"要在一生中成功地進行投資，並不需要有平流層的智商。\n不尋常的商業洞察力，或內部信息。所需要的是一個健全的\n需要的是一個健全的智力框架和保持情緒不被腐蝕的能力......",
      "title": "我今天取消了Motley Fool的會員資格。他們的營銷讓我這樣做。"
    }
  ]
}