{
  "author": "fcuk_the_banks",
  "the_new_excerpt": "The last post about this topic got removed by the mods, not sure why. Possibly I\nhave used some wrong language, I will try to fix that with this post. In any\ncase, this is important news for all AMC holders:\n\nAMC has issued almost all of their shares (they've got only 46,124 shares left).\nAnd they…",
  "original_created_utc": 1622774025,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このトピックに関する最後の投稿は、理由はわかりませんが、modsによって削除されました。もしかしたら私が\n誤った言葉を使ってしまったのかもしれませんが、今回の投稿で修正してみます。いずれにせよ\nいずれにしても、これはすべてのAMCホルダーにとって重要なニュースです。\n\nAMCはほぼすべての株式を発行しました（残りは46,124株のみ）。\nそして、彼らは...",
      "title": "AMCの発行済み株式数は46,124株で、2021年には追加発行しない予定"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "关于这个话题的最后一个帖子被管理员删除了，不知道为什么。可能是我\n使用了一些错误的语言，我将尝试在这篇文章中解决这个问题。在任何情况下\n无论如何，这对所有AMC持有者来说是一个重要的消息。\n\nAMC已经发行了几乎所有的股票（他们只剩下46,124股）。\n而且他们...",
      "title": "AMC只剩下46,124股可以发行，他们不会在2021年增发任何股票。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "關於這個話題的最後一個帖子被管理員刪除了，不知道爲什麼。可能是我\n使用了一些錯誤的語言，我將嘗試在這篇文章中解決這個問題。在任何情況下\n無論如何，這對所有AMC持有者來說是一個重要的消息。\n\nAMC已經發行了幾乎所有的股票（他們只剩下46,124股）。\n而且他們...",
      "title": "AMC只剩下46,124股可以發行，他們不會在2021年增發任何股票。"
    }
  ],
  "title": "AMC has only 46,124 shares left to issue, and they will NOT issue any additional shares in 2021",
  "created_utc": 1622797363,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The last post about this topic got removed by the mods, not sure why. Possibly I have used some wrong language, I will try to fix that with this post. In any case, this is important news for all AMC holders:</p>\n\n<p>AMC has issued almost all of their shares (they&#39;ve got only 46,124 shares left). And they will NOT issue any additional shares in 2021, according to them. This is good news, as it can certainly help the stock price to move higher.</p>\n\n<p>They issued some shares today, and raised cash. For the company this is a good thing. They are well capitalized now. They asked for permission to issue 25 Million shares sometimes in 2022 - But we can talk about that when it is important, in 2022 their business could be a 110% again, and issuing new shares won&#39;t be necessary anymore.</p>\n\n<p>This is the important part of their statement:</p>\n\n<p>&quot;As of today,  in our efforts to best position AMC for a successful recovery from the  pandemic, we have issued or reserved substantially all but 46,124 of the  shares that were previously authorized. &quot;</p>\n\n<p>Full statement:<a href=\"https://investor.amctheatres.com/newsroom/news-details/2021/AMC-Entertainment-Holdings-Inc.-Files-Preliminary-Proxy-Statement-Voting-to-Begin-June-16-2021/default.aspx\">https://investor.amctheatres.com/newsroom/news-details/2021/AMC-Entertainment-Holdings-Inc.-Files-Preliminary-Proxy-Statement-Voting-to-Begin-June-16-2021/default.aspx</a></p>\n</div><!-- SC_ON -->",
  "score": 5315,
  "permalink": "/r/wallstreetbets/comments/nrujso/amc_has_only_46124_shares_left_to_issue_and_they/",
  "subreddit": "wallstreetbets",
  "id": "nrujso",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404890220
}