{
  "author": "SameThingHappened2Me",
  "original_created_utc": 1625341838,
  "title": "If you're still thinking about cryptocurrency as being only about currency, you haven't had the \"aha\" moment that's coming. It's like thinking of cellphones as being purely about phone calls (circa 2004) and not understanding the potential of smart phones.",
  "created_utc": 1625348381,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>You hear a lot of a certain breed of maxi being very dismissive of smart contracts.  It&#39;s the 2004 equivalent of saying, &quot;okay, but so what?  I can play a glorified version of &#39;snake&#39; on an iPhone.  Nokia still has market dominance.&quot;</p>\n\n<p>The full picture of what it means to make a blockchain a turing-complete computer is beyond all our imaginations.  It&#39;s not a single feature.  It&#39;s the millions of yet-to-be-invented applications that will change the world.  </p>\n\n<p>When smart phones first came around, there wasn&#39;t all that much to &quot;do&quot; with them either.  The first real &quot;killer app&quot; of the smart phone market was email.  The idea of combining it with our phone was so handy it couldn&#39;t be denied.  And we already have our first killer app of smart contract platforms: DeFi.    The benefit of getting yield on your crypto is undeniable.  It&#39;s also clunky still, but that&#39;ll change.  The interfaces will get smoother, simpler, and less confusing.  And after DeFi, it&#39;ll be the next thing then the next, then the next.  Metaverse?  Decentralized Web?  Who knows.  But the point is it&#39;s coming.</p>\n\n<p>You hear people argue, &quot;but that isn&#39;t the <em>point</em> of cryptocurrency.  The <em>point</em> is to be a currency.&quot;  Technology doesn&#39;t care what things started as.  Is there anyone left whose primary use of their cellphone is to make phone calls?</p>\n</div><!-- SC_ON -->",
  "score": 238,
  "permalink": "/r/CryptoCurrency/comments/od51r8/if_youre_still_thinking_about_cryptocurrency_as/",
  "subreddit": "CryptoCurrency",
  "id": "od51r8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "You hear a lot of a certain breed of maxi being very dismissive of smart\ncontracts. It's the 2004 equivalent of saying, \"okay, but so what? I can play a\nglorified version of 'snake' on an iPhone. Nokia still has market dominance.\"\n\nThe full picture of what it means to make a blockchain a turing…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ある種のマキシは、スマート・コントラクトを非常に嫌っているという話をよく聞きます。\nスマートコントラクトを非常に否定するある種のマキシをよく耳にします。2004年の時点では、「わかった、でもそれが何だ？と言っているようなものです。\niPhoneで『スネーク』の栄光版をプレイできる。ノキアはまだ市場を支配している」ということです。\n\nブロックチェーンをチューリングにするとはどういうことか、その全貌は...。",
      "title": "もし、あなたがまだ暗号通貨を通貨だけのものだと考えているなら、あなたはまだ「ハッ」とするような瞬間を迎えていません。それは、2004年頃に携帯電話を「電話だけ」と考えていた人が、スマートフォンの可能性を理解していないのと同じです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你会听到很多某种类型的麦克斯坦人对智能合约非常不屑一顾。\n合同。这相当于在2004年说，\"好吧，但那又怎样？我可以在iP上玩一个\n我可以在iPhone上玩荣耀版的 \"蛇\"。诺基亚仍然有市场支配地位。\"\n\n让区块链成为图灵的全貌...",
      "title": "如果你仍然认为加密货币只与货币有关，那么你还没有经历过即将到来的 \"aha \"时刻。这就像把手机想成是纯粹的电话（2004年左右），而不理解智能手机的潜力。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你會聽到很多某種類型的麥克斯坦人對智能合約非常不屑一顧。\n合同。這相當於在2004年說，\"好吧，但那又怎樣？我可以在iP上玩一個\n我可以在iPhone上玩榮耀版的 \"蛇\"。諾基亞仍然有市場支配地位。\"\n\n讓區塊鏈成爲圖靈的全貌...",
      "title": "如果你仍然認爲加密貨幣只與貨幣有關，那麼你還沒有經歷過即將到來的 \"aha \"時刻。這就像把手機想成是純粹的電話（2004年左右），而不理解智能手機的潛力。"
    }
  ]
}