{
  "author": "DangerStranger138",
  "the_new_excerpt": "Costco Stock Is an Easy Buy on the Dip COST stock is one of the best in the\nmarket – and it's now on sale\n[https://investorplace.com/moneywire/2021/03/cost-stock-costco-easy-buy-on-the-dip/]\n\nCOST stock has declined over 9% so far in 2021. It’s down 12% from late November\nhighs.\n\nBut for a name like…",
  "original_created_utc": 1614664135,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "Costco股票是一个轻松的买入在Dip COST股票是一个最好的在\n市场--现在正在销售\n[https://investorplace.com/moneywire/2021/03/cost-stock-costco-easy-buy-on-the-dip/]\n\n2021年至今，科创板股价下跌超过9%。从11月底开始下跌了12%。\n高。\n\n但是，对于一个名字像...",
      "title": "好市多股票是一个简单的购买在Dip COST股票是最好的投资在未来的股息市场之一，现在它的销售。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Costco股票是一個輕鬆的買入在Dip COST股票是一個最好的在\n市場--現在正在銷售\n[https://investorplace.com/moneywire/2021/03/cost-stock-costco-easy-buy-on-the-dip/]\n\n2021年至今，科創板股價下跌超過9%。從11月底開始下跌了12%。\n高。\n\n但是，對於一個名字像...",
      "title": "好市多股票是一個簡單的購買在Dip COST股票是最好的投資在未來的股息市場之一，現在它的銷售。"
    }
  ],
  "title": "Costco Stock Is an Easy Buy on the Dip COST stock is one of the best in the market for investing in future dividends– and it's now on sale",
  "created_utc": 1614671055,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://investorplace.com/moneywire/2021/03/cost-stock-costco-easy-buy-on-the-dip/\">Costco Stock Is an Easy Buy on the Dip\nCOST stock is one of the best in the market – and it&#39;s now on sale</a></p>\n\n<p>COST stock has declined over 9% so far in 2021. It’s down 12% from late November highs.</p>\n\n<p>But for a name like Costco, a 12% move is rather significant. It’s not just significant – it’s a buying opportunity.</p>\n\n<p>Costco did take a modest hit during the pandemic, in part due to store closures. For instance, in April same-store sales excluding gasoline and foreign currency effects were flat. That’s a huge disappointment by Costco’s high standards.</p>\n\n<p>But as stores reopened, Costco immediately got back on track. In June, for instance, same-store sales rose 14% on the same basis. For the third quarter (ending May 10), Costco drove 4.8% same-store growth. In Q4, the figure accelerated to better than 11%. Growth in December and January averaged better than 8%.</p>\n\n<p>There’s not much in the numbers to suggest anything has changed. The pandemic caused a bit of volatility, yes, but Costco still grew adjusted same-store sales 9% in FY2020 and 6% the year before.\nAs far as e-commerce goes, the pandemic has given Costco a chance to build out its own business. E-commerce revenue grew 50% in FY2020 and climbed another 18% through the first 22 weeks of FY2021.</p>\n\n<p>Remember that Costco’s profit comes largely from membership fees. In FY2020, for instance, membership fees were about 65% of operating profit. which was actually down from 71% the year before. Essentially, Costco turns about 1% of its sales into operating profit, then tacks on membership revenue.</p>\n\n<p>That membership revenue is benefiting from customers acquired last year. Most are going to stick around for the long haul. The boost here isn’t like that of, say, a grocery store, whose sales will return to pre-pandemic levels as normalcy returns.</p>\n\n<p>Remember also that membership revenue is part of why COST stock is expensive – and has been for years. Yes, this is a fantastically well-run company. But the model’s reliance on membership fees creates faster growth as well.</p>\n\n<p>An extra dollar in membership fees drops to the operating profit line at huge margins. And so Costco can grow earnings faster than most any other brick-and-mortar retailer.</p>\n</div><!-- SC_ON -->",
  "score": 128,
  "permalink": "/r/investing/comments/lvv33p/costco_stock_is_an_easy_buy_on_the_dip_cost_stock/",
  "subreddit": "investing",
  "id": "lvv33p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937740760
}