{
  "author": "NoctemEmpress",
  "original_created_utc": 1645839889,
  "title": "Why do some men consider a woman’s vagina loose if she sleeps with multiple men but not if she sleeps with the same man multiple times?",
  "created_utc": 1645846176,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The title pretty much says it all. I’ve noticed online lately that some men who will say that a woman’s vagina will get loose (implying she’s a wh*re) and she’s now undesirable because she slept with multiple men. We all know that’s not how Vaginas work but why do they think this way?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 118,
  "permalink": "/r/NoStupidQuestions/comments/t1kmq2/why_do_some_men_consider_a_womans_vagina_loose_if/",
  "subreddit": "NoStupidQuestions",
  "id": "t1kmq2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "The title pretty much says it all. I’ve noticed online lately that some men who\nwill say that a woman’s vagina will get loose (implying she’s a wh*re) and she’s\nnow undesirable because she slept with multiple men. We all know that’s not how\nVaginas work but why do they think this way?",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルが全てを物語っていますね。最近ネットで気づいたのですが、一部の男性で\n女性のアソコが緩くなる（売春婦という意味）とか、その女性は\n複数の男性と寝たので、今は望ましくない。私たちは皆、それがどのような方法でないかを知っています。\nしかし、なぜこのように考えるのでしょうか？",
      "title": "複数の男性と寝ると女性のアソコが緩むのに、同じ男性と何度も寝ると緩まないと考える男性がいるのはなぜでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这个标题几乎说明了一切。我最近在网上注意到，有些男人\n会说一个女人的阴道会变得松弛（暗示她是个妓女），她现在是不受欢迎的，因为她和男性上床。\n现在不受欢迎了，因为她和多个男人睡过。我们都知道这不是\n阴道的工作原理，但为什么他们会有这种想法？",
      "title": "为什么有些男人认为，如果一个女人和多个男人上床，她的阴道就会松弛，但如果她和同一个男人多次上床，就不会松弛？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個標題幾乎說明了一切。我最近在網上注意到，有些男人\n會說一個女人的陰道會變得鬆弛（暗示她是個妓女），她現在是不受歡迎的，因爲她和男性上牀。\n現在不受歡迎了，因爲她和多個男人睡過。我們都知道這不是\n陰道的工作原理，但爲什麼他們會有這種想法？",
      "title": "爲什麼有些男人認爲，如果一個女人和多個男人上牀，她的陰道就會鬆弛，但如果她和同一個男人多次上牀，就不會鬆弛？"
    }
  ]
}