{
  "author": "alttoby",
  "the_new_excerpt": "Today's premarket was definitely... interesting to say the least. I opened up my\nYahoo finance app and saw literally all of the holdings in my speculative\nportfolio down anywhere from 4-12 percent. Specifically both $OPEN and $PLTR\nwere down more than 10 percent (PLTR down that much initially after…",
  "original_created_utc": 1620752216,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日のプレマーケットは確かに...控えめに言っても面白かった。私はYahooファイナンスアプリを開いて\nヤフーファイナンスのアプリを開いてみると、私の投機的なポートフォリオの保有株が文字通りすべて下落していました。\n4～12％の下落を記録しました。具体的には$OPENと$PLTRの両方が10%以上下がっていました。\nは10％以上下落していました（PLTRは最初、...",
      "title": "今日の気になるPre-market。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今天的盘前交易绝对是......至少可以说是有趣的。我打开了我的\n雅虎金融应用程序，看到我的投机性投资组合中的所有持股\n跌幅在4-12%之间。特别是$OPEN和$PLTR\n都下跌了10%以上（PLTR最初下跌了那么多，后来...",
      "title": "今天有趣的前期市场。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天的盤前交易絕對是......至少可以說是有趣的。我打開了我的\n雅虎金融應用程序，看到我的投機性投資組合中的所有持股\n跌幅在4-12%之間。特別是$OPEN和$PLTR\n都下跌了10%以上（PLTR最初下跌了那麼多，後來...",
      "title": "今天有趣的前期市場。"
    }
  ],
  "title": "Today's interesting Pre-market.",
  "created_utc": 1620766707,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Today&#39;s premarket was definitely... interesting to say the least. I opened up my Yahoo finance app and saw literally all of the holdings in my speculative portfolio down anywhere from 4-12 percent. Specifically both $OPEN and $PLTR were down more than 10 percent (PLTR down that much initially after the earnings report). </p>\n\n<p>Lo and behold, the market opens and everything immediately is up way higher than in pre-market. Now obviously futures are only indicative to some extent and don&#39;t actually reflect at which price-point stocks will open but it still leaves you wondering how PLTR can drop more than 10 percent in pre-market off the earningsreport and currently later in the day is trading up more than 8 percent. </p>\n\n<p>I don&#39;t buy all of the tin-foil hat theories that people have come up with since the whole GME saga but damn this is still kinda sus. I mean someone with premarket access could&#39;ve scooped up some palantir shares this morning in pre-market and be up more than 20 percent within a matter of hours. </p>\n\n<p>What are your thoughts on this?</p>\n</div><!-- SC_ON -->",
  "score": 111,
  "permalink": "/r/stocks/comments/na1ok6/todays_interesting_premarket/",
  "subreddit": "stocks",
  "id": "na1ok6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985996882
}