{
  "author": "omgyouresexy",
  "original_created_utc": 1656000234,
  "title": "How long would it take a drop of water to flow from Parting of the Waters to the Atlantic Ocean?",
  "created_utc": 1656039224,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I just got done watching a video about Parting of the Waters in Moran, WY. There is a unique feature here in which a creek running along the continental divide splits and half runs to the Pacific while the other half runs to the Atlantic. The title of the video is &amp;quot;The Creek that Flows to Two Different Oceans&amp;quot; if anyone wants to check it out for more context.&lt;/p&gt;\n\n&lt;p&gt;Anyway, it got me thinking: Assuming no evaporation, absorption into the soil, or any other means of exiting the continuous flow, how long would it take a drop of water to flow from that location all the way to the Atlantic Ocean?&lt;/p&gt;\n\n&lt;p&gt;There are overlapping issues like estimating actual path lengths of the creeks and rivers, different flow rates that depend on precipitation and water levels, fluid dynamics, and I&amp;#39;m sure a bunch other stuff I&amp;#39;m not even thinking of. Seems like such a cool multi-disciplinary problem. Is it possible to simplify it enough to get a rough answer? I&amp;#39;d love to hear everyone&amp;#39;s take!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 434,
  "permalink": "/r/askscience/comments/vj0c3d/how_long_would_it_take_a_drop_of_water_to_flow/",
  "subreddit": "askscience",
  "id": "vj0c3d",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I just got done watching a video about Parting of the Waters in Moran, WY. There\nis a unique feature here in which a creek running along the continental divide\nsplits and half runs to the Pacific while the other half runs to the Atlantic.\nThe title of the video is \"The Creek that Flows to Two…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "WY州MoranのParting of the Watersについてのビデオを見終わったところです。ここには\n大陸分水嶺を流れる小川が、半分が太平洋に、もう半分が大西洋に流れ込むという\n半分が太平洋に、もう半分が大西洋に流れているのです。\nビデオのタイトルは「The Creek that Flows to Two...」。",
      "title": "パーティング・オブ・ザ・ウォーターズ」から大西洋まで、1滴の水が流れるのに何年かかるか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我刚刚看完一个关于在WY的Moran的Parting of the Waters的视频。这里有\n这里有一个独特的特点，一条沿着大陆分界线运行的小溪\n分裂，一半流向太平洋，另一半流向大西洋。\n该视频的标题是 \"流向两个国家的小河\"。",
      "title": "一滴水从分水岭流到大西洋需要多长时间？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我剛剛看完一個關於在WY的Moran的Parting of the Waters的視頻。這裏有\n這裏有一個獨特的特點，一條沿着大陸分界線運行的小溪\n分裂，一半流向太平洋，另一半流向大西洋。\n該視頻的標題是 \"流向兩個國家的小河\"。",
      "title": "一滴水從分水嶺流到大西洋需要多長時間？"
    }
  ]
}