{
  "author": "MasterCookSwag",
  "the_new_excerpt": "Honestly, I didn’t want to post this myself since there’s probably two dozen of\nthese posts in the queue, but all of the recent ones look like they’re written\nby 8 year olds.\n\nNormally this belongs in the daily advice thread, but because of recent events\nand concerns over Robinhood’s ability to…",
  "original_created_utc": 1612019568,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "说实话，我自己也不想发这个帖子，因为可能有二十几个人的\n这些帖子在队列中，但所有最近的帖子看起来像他们写的。\n由8岁的孩子。\n\n通常这属于日常咨询主题，但由于最近发生的事件。\n以及对Robinhood能力的担忧... ...",
      "title": "应大众要求：官方 \"我讨厌Robinhood，想要一个新的经纪人线\""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "說實話，我自己也不想發這個帖子，因爲可能有二十幾個人的\n這些帖子在隊列中，但所有最近的帖子看起來像他們寫的。\n由8歲的孩子。\n\n通常這屬於日常諮詢主題，但由於最近發生的事件。\n以及對Robinhood能力的擔憂... ...",
      "title": "應大衆要求：官方 \"我討厭Robinhood，想要一個新的經紀人線\""
    }
  ],
  "title": "By popular demand: official “I hate Robinhood and want a new broker thread”",
  "created_utc": 1612025623,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Honestly, I didn’t want to post this myself since there’s probably two dozen of these posts in the queue, but all of the recent ones look like they’re written by 8 year olds. </p>\n\n<p>Normally this belongs in the daily advice thread, but because of recent events and concerns over Robinhood’s ability to serve customer(I been telling y’all for years) we can have a thread in it</p>\n\n<p>So here we are: recommend and discuss brokers, fees, features, mobile apps, whatever.  In general I think everyone is best served by Fidelity, Schwab, or Vanguard.  TD is another major player but for those unaware they are in the process of being acquired by schwab.  All three of those actually have phone numbers where you can call and speak to a person about your account.</p>\n\n<p>For the younger crowd; a phone call is similar to voice to text, but instantaneous. </p>\n\n<p>Also, feel free to chat apps or whatever too,</p>\n\n<p>E: <a href=\"https://reddit.com/r/investing/comments/l7t4pg/an_explanation_of_why_robinhoodapp_nonnefariously/\">here is an overview of what happened with Robinhood</a>.  No conspiracy theories or anything included, just a technical explanation. </p>\n\n<p>Also, <a href=\"https://reddit.com/r/investing/comments/l7qlfh/_/gl88dzj/?context=1\">my comment and subsequent conversation around liquidity concerns at Robinhood</a></p>\n\n<p>Please note - I don’t have any special insight here, this is strictly my and others interpretation of the tea leaves.  Feel free to discuss, and explore other interpretations.  Whatever broker choice you make is up to you, the important thing is that it is an educated choice since it’s ultimately your money. </p>\n\n<h1><strong>No referral codes. Posting a referral code will result in an immediate no questions asked permanent ban</strong></h1>\n\n<p>Thanks.</p>\n</div><!-- SC_ON -->",
  "score": 6825,
  "permalink": "/r/investing/comments/l8nntv/by_popular_demand_official_i_hate_robinhood_and/",
  "subreddit": "investing",
  "id": "l8nntv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518534771
}