{
  "author": "Voynich1024",
  "original_created_utc": 1629177977,
  "title": "Do you usually ask sexual partners about sexual health and how do they usually react?",
  "created_utc": 1629203793,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>First of I have never had sex so far (F23). I would love to, and I would even be down for casual sex if someone attractive asked me. But on the other hand I&#39;m kind of concerned about sexual health. Like, if you have casual sex with someone you just met, you don&#39;t know their dating history and you can&#39;t really be sure if they&#39;d even tell you if they had an sti. Sure, you can&#39;t really ever be sure, but I feel like with casual sex it&#39;s more risky.</p>\n\n<p>How do you go on about this. Do you just ask them if they did a check-up recently? If so, how do they usually react? I feel like if someone reacts badly to this question you might even have dodged a bullet there. But I&#39;d still like to know how how you guys go about that :)</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/p5xilg/do_you_usually_ask_sexual_partners_about_sexual/",
  "subreddit": "TooAfraidToAsk",
  "id": "p5xilg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "First of I have never had sex so far (F23). I would love to, and I would even be\ndown for casual sex if someone attractive asked me. But on the other hand I'm\nkind of concerned about sexual health. Like, if you have casual sex with someone\nyou just met, you don't know their dating history and you…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "まず、これまで一度もセックスをしたことがない（F23）。やってみたいし、魅力的な人に誘われたら、カジュアル・セックスでもいいと思う。\nしたいし、魅力的な人に誘われたらカジュアル・セックスもしてみたい。しかし一方で、私は\nでも一方で、性的健康についてはちょっと心配です。例えば、出会ったばかりの人とカジュアル・セックスをすると\n出会ったばかりの人とカジュアル・セックスをしたら、その人のデートの履歴を知らないし...。",
      "title": "普段、性的パートナーに性的健康について尋ねることがありますか、そして彼らは通常どのように反応しますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "首先，到目前为止我还没有过性生活（F23）。我很想，而且我甚至愿意\n如果一个有吸引力的人问我，我甚至可以接受随意的性行为。但另一方面，我又\n担心性健康问题。比如，如果你和刚认识的人随便发生性关系\n你不知道他们的约会历史，你...",
      "title": "你通常会向性伴侣询问性健康问题吗，他们通常有什么反应？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，到目前爲止我還沒有過性生活（F23）。我很想，而且我甚至願意\n如果一個有吸引力的人問我，我甚至可以接受隨意的性行爲。但另一方面，我又\n擔心性健康問題。比如，如果你和剛認識的人隨便發生性關係\n你不知道他們的約會歷史，你...",
      "title": "你通常會向性伴侶詢問性健康問題嗎，他們通常有什麼反應？"
    }
  ]
}