{
  "author": "poison_ivey",
  "the_new_excerpt": "A colleague just started trading. I recommended a strong stock I’ve done good DD\non but cautioned it will take awhile to see any gains.\n\nA few weeks later it increased 20% on some good news and then dropped 5% for net\n15%. He’s texting me days later “wtf poison_ivey this stock blows, when is…",
  "original_created_utc": 1613319250,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "一个同事刚开始交易。我推荐了一只我做得不错的强势股DD\n上，但警告说需要一段时间才能看到任何收益。\n\n几周后，由于一些好消息，它增加了20％，然后下降了5％的净利润。\n15%. 几天后他给我发短信 \"wtf poison_ivey这只股票炸了，什么时候...\"。",
      "title": "如果你想成功就不要贪心。记住，牛市赚钱，熊市赚钱，但猪会被宰。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "一個同事剛開始交易。我推薦了一隻我做得不錯的強勢股DD\n上，但警告說需要一段時間才能看到任何收益。\n\n幾周後，由於一些好消息，它增加了20％，然後下降了5％的淨利潤。\n15%. 幾天後他給我發短信 \"wtf poison_ivey這隻股票炸了，什麼時候...\"。",
      "title": "如果你想成功就不要貪心。記住，牛市賺錢，熊市賺錢，但豬會被宰。"
    }
  ],
  "title": "If you want to be successful don’t get greedy. Remember that bulls make money, bears make money, but pigs get slaughtered.",
  "created_utc": 1613324228,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A colleague just started trading.  I recommended a strong stock I’ve done good DD on but cautioned it will take awhile to see any gains.</p>\n\n<p>A few weeks later it increased 20% on some good news and then dropped 5% for net 15%.  He’s texting me days later “wtf poison_ivey this stock blows, when is it going to take off??”</p>\n\n<p>With all the recent hype some people are looking for X00% overnight and expect massive gains with no effort.  It’s also really hard to sell when something you own is on a crazy run and FOMO creeps in.</p>\n\n<p>The key success here is don’t get greedy.   Take your profits and protect your capital core.  Every stock is different and nothing is ever a sure bet.  Lululemon used to be a really strong buy but took a huge dip a few years back because of allegations against the founder</p>\n\n<p>My average annual return is 20%.  It’s not as sexy as making infinite gains on shorts but it means I will retire a lot sooner than I thought I ever could.  If one of my tickers hits bigger than I thought I reassess value and often I take my book value and use the gravy to ride that train the rest of the way</p>\n\n<p>If you could afford to invest $1k per year you could retire w over a million, and way more if you can increase your annual investment more each year.</p>\n\n<p>Compound interest at a rate of return of 20% after\n20 years = $275k ($20k invested @ $1k per year.\n25 years = $775k ($25k invested @$1k per year).\n30 years = $1.3M ($30k invested @$1k per year).</p>\n\n<p>After 30 years you could retire and earn an annual income of $78k with a passive 6% interest without eroding that core $1.3M.</p>\n\n<p>Start small and be patient.  Decide what percentage of your capital you are willing to go YOLO on and what amount you need to protect to avoid that “holy crap what have I done I’ve lost everything and I’m going to vomit” feeling.</p>\n</div><!-- SC_ON -->",
  "score": 14978,
  "permalink": "/r/stocks/comments/ljr9dr/if_you_want_to_be_successful_dont_get_greedy/",
  "subreddit": "stocks",
  "id": "ljr9dr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728623068
}