{
  "author": "Disappointless",
  "the_new_excerpt": "Look, I love crypto. I love the idea of a decentralized financial system. I can\nsee what is wrong with banks. But people here are spitting on banks and other\nfinancial institutions because they are these huge greedy monsters that only\nwant to take everybody's money.\n\nAt the same time everyone is…",
  "original_created_utc": 1619365874,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "いいですか、私は暗号が大好きです。非中央集権的な金融システムのアイデアが大好きです。私には\n銀行の何が悪いのかはわかります。しかし、ここにいる人たちは、銀行や他の金融機関に唾を吐いています。\n銀行や他の金融機関に唾を吐くのは、彼らが皆のお金を奪いたいだけの巨大で貪欲なモンスターだからです。\nなぜなら、銀行や他の金融機関は巨大で貪欲なモンスターであり、みんなのお金を奪いたいだけだからです。\n\nそれと同時に、みんなは...。",
      "title": "人気のない意見：ここにいる人たちは、嫌いな銀行と同じくらい貪欲です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "听着，我喜欢加密货币。我喜欢去中心化的金融系统的想法。我可以\n看到银行有什么问题。但这里的人都在吐槽银行和其他\n金融机构，因为他们是这些巨大的贪婪的怪物，只想拿走所有人的钱。\n想拿走每个人的钱。\n\n同时，每个人都在...",
      "title": "不受欢迎的观点：这里的人和他们所讨厌的银行一样贪婪"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "聽着，我喜歡加密貨幣。我喜歡去中心化的金融系統的想法。我可以\n看到銀行有什麼問題。但這裏的人都在吐槽銀行和其他\n金融機構，因爲他們是這些巨大的貪婪的怪物，只想拿走所有人的錢。\n想拿走每個人的錢。\n\n同時，每個人都在...",
      "title": "不受歡迎的觀點：這裏的人和他們所討厭的銀行一樣貪婪"
    }
  ],
  "title": "Unpopular opinion: people in here are as greedy as the banks they hate",
  "created_utc": 1619386842,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Look, I love crypto. I love the idea of a decentralized financial system. I can see what is wrong with banks. But people here are spitting on banks and other financial institutions because they are these huge greedy monsters that only want to take everybody&#39;s money.</p>\n\n<p>At the same time everyone is jumping into every single fucking scam-, pump- or memecoin hoping they can make thousands of dollars in a day. Some even say scams are not a problem because &quot;yes they are scams but if you get out in time you can still make profit&quot;. Crypto is a zero-sum game: every single dollar you potentially gain, is lost by someone else.</p>\n\n<p>It&#39;s ridiculous and hypocrite how some people here don&#39;t even realize they are showing the exact greedy behaviour they are accusing the banks of, at the cost of others.</p>\n\n<p>&#x200B;</p>\n\n<p>EDIT: To be clear, I&#39;m not a saint. Obviously I&#39;m also here for the money like everyone else. But my point isn&#39;t so much judging greed, it&#39;s judging hypocrisy. It is about being a hypocrit when you judge banks for taking peoples money without caring that they get fucked, while at the same time massively pumping and supporting scams just to take peoples money without caring that they get fucked.</p>\n</div><!-- SC_ON -->",
  "score": 910,
  "permalink": "/r/CryptoCurrency/comments/myb0dk/unpopular_opinion_people_in_here_are_as_greedy_as/",
  "subreddit": "CryptoCurrency",
  "id": "myb0dk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776210454
}