{
  "author": "tsnud",
  "the_new_excerpt": "Ethereum 2.0 will change the security of the network from proof of work (POW,\nmining) to proof of stake (POS). People can run a validator node to contribute,\nbut you need to stake 32 ETH. If your validator 'behaves', you can earn ETH in\nthe process (somewhere between 5-12% per year). If your node is…",
  "original_created_utc": 1617416444,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "Ethereum 2.0将改变网络的安全性，从工作证明（POW。\n挖矿）到股权证明（POS）。人们可以运行一个验证器节点来贡献。\n但您需要投注32 ETH。如果您的验证器 \"表现良好\"，您就可以通过以下方式赚取ETH\n的过程（每年5-12%之间）。如果你的节点是...",
      "title": "以ETH的ATH来说，现在你要自己掏出近7万美金来运行一个验证器节点来押注......"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Ethereum 2.0將改變網絡的安全性，從工作證明（POW。\n挖礦）到股權證明（POS）。人們可以運行一個驗證器節點來貢獻。\n但您需要投注32 ETH。如果您的驗證器 \"表現良好\"，您就可以通過以下方式賺取ETH\n的過程（每年5-12%之間）。如果你的節點是...",
      "title": "以ETH的ATH來說，現在你要自己掏出近7萬美金來運行一個驗證器節點來押注......"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "イーサリアム2.0では、ネットワークのセキュリティをプルーフ・オブ・ワーク（POW,\nマイニング）からPOS（プルーフオブステーク）に変更されました。人々は、貢献するためにバリデータノードを実行することができます。\nしかし、32ETHをステークする必要があります。あなたのバリデータが「動作」すれば、その過程でETHを獲得できます。\nを得ることができる（年率5～12％の間）。もしあなたのノードが...",
      "title": "ETHのATHでは、自分でステークするためのバリデータノードを稼働させるために、7万ドル近くの費用が必要になりました...。"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "イーサリアム2.0では、ネットワークのセキュリティをプルーフ・オブ・ワーク（POW,\nマイニング）からPOS（プルーフオブステーク）に変更されました。人々は、貢献するためにバリデータノードを実行することができます。\nしかし、32ETHをステークする必要があります。あなたのバリデータが「動作」すれば、その過程でETHを獲得できます。\nを得ることができる（年率5～12％の間）。もしあなたのノードが...",
      "title": "ETHのATHでは、自分でステークするためのバリデータノードを稼働させるために、7万ドル近くの費用が必要になりました...。"
    }
  ],
  "title": "With the ATH of ETH, you now have to cough up almost 70k USD to run a validator node to stake on your own...",
  "created_utc": 1617475940,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Ethereum 2.0 will change the security of the network from proof of work (POW, mining) to proof of stake (POS). People can run a validator node to contribute, but you need to stake 32 ETH. If your validator &#39;behaves&#39;, you can earn ETH in the process (somewhere between 5-12% per year). If your node is a bad node, you will get slashed and lose ETH and eventually get expelled from the network.</p>\n\n<p>When this system was introduced, the value of ETH was way below 1k USD. With the current increase in value, you now have to stake almost 70k USD to run a node...</p>\n\n<p>Can we discuss what that means? Average Joe will have trouble coughing up that much. Will whales control the network? Will centralized services get too much power? Will this be bad for decentralization? Please let me know what you think!</p>\n\n<p>Edit: Yes I know that you can stake less than 32 ETH, but then you have to use a service and will not be able to contribute to the security and the decentralization of the network.</p>\n\n<p>&#x200B;</p>\n\n<p>PS: This post was automatically removed by a bot before, the reason &#39;no more than 5 posts covering the topic ETH in the top 50&#39;. I think this is a very interesting topic, and the ~20 replies in the 15 minutes before the post got removed shows that there is some interest.</p>\n</div><!-- SC_ON -->",
  "score": 165,
  "permalink": "/r/CryptoCurrency/comments/mizce5/with_the_ath_of_eth_you_now_have_to_cough_up/",
  "subreddit": "CryptoCurrency",
  "id": "mizce5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961875622
}