{
  "author": "Jenniferk45",
  "original_created_utc": 1627806275,
  "title": "Is it unusual for a woman to think her own miscarriages aren’t a big deal?",
  "created_utc": 1627818899,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve had three children plus three miscarriages, all pretty early. The latest was 10 weeks.  I love my born children, but I seriously wasn’t very upset over the miscarriages. I think I cried once over the first one and that was it. But when I’ve talked with other women and mentioned it, they are so, so sorry. Like it was a tragedy. And some of them said they grieved for years over their lost children. One even kept her 9 week embryo in her freezer, waiting to save the money for cremation.</p>\n\n<p>I was thinking “dude, I just flushed the toilet.” Okay, one came out with a giant cramp, and I felt it in my underwear so I rinsed it off and examined it because it was interesting. Then I flushed it.</p>\n\n<p>For reference, I adore my children. I take good care of them, love them, breastfed them, and now I’m sad my two teenagers may move out in the next couple years. So it’s not like I’m heartless.</p>\n\n<p>But am I heartless? I get grieving a pregnancy that is lost later on, but 10 weeks or less? I don’t understand why it seems to be expected.</p>\n</div><!-- SC_ON -->",
  "score": 130,
  "permalink": "/r/TooAfraidToAsk/comments/ovog65/is_it_unusual_for_a_woman_to_think_her_own/",
  "subreddit": "TooAfraidToAsk",
  "id": "ovog65",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’ve had three children plus three miscarriages, all pretty early. The latest\nwas 10 weeks. I love my born children, but I seriously wasn’t very upset over\nthe miscarriages. I think I cried once over the first one and that was it. But\nwhen I’ve talked with other women and mentioned it, they are so,…",
  "localize": [
    {
      "locale": "ja",
      "title": "自分の流産を大したことないと思っている女性は珍しいのでしょうか？",
      "the_new_excerpt": "私は3人の子供に加えて3回の流産を経験しましたが、いずれもかなり早い時期でした。最新のものは\n10週目でした。生まれた子供たちを愛していますが、流産してもあまり動揺しませんでした。\n流産してもあまり動揺しませんでした。最初の流産では一度だけ泣いたことがありますが、それだけでした。でも\n他の女性と話していて、その話をすると、彼女たちはとても...。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我已经有了三个孩子，外加三次流产，都很早。最近的一次\n是10周。我爱我出生的孩子，但说真的，我并没有因为流产而感到非常沮丧。\n流产。我想我为第一个孩子哭过一次，仅此而已。但是\n当我与其他妇女交谈并提及此事时，她们是如此，...",
      "title": "一个女人认为自己的流产不是什么大事，这很不正常吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我已經有了三個孩子，外加三次流產，都很早。最近的一次\n是10周。我愛我出生的孩子，但說真的，我並沒有因爲流產而感到非常沮喪。\n流產。我想我爲第一個孩子哭過一次，僅此而已。但是\n當我與其他婦女交談並提及此事時，她們是如此，...",
      "title": "一個女人認爲自己的流產不是什麼大事，這很不正常嗎？"
    }
  ]
}