{
  "author": "cidadefalcao",
  "original_created_utc": 1636403010,
  "title": "How to live off your bitcoin without ever selling them and without having to take loans against them",
  "created_utc": 1636423639,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Much is discussed about when to sell your bitcoins. Most of the time, the usual bitcoiner response is &quot;never&quot;. However, if you never sell, then how can you ever enjoy the profits? This is where things diverge. So far, I have never seen anyone mentioning an alternative to the following option:</p>\n\n<p>Take a loan against your BTC and let &quot;inflation&quot; do the job. If BTC is $1 million and you take a loan of $100k against 0.1 of your BTC, when BTC gets to $10 million your loan will be just 0.01BTC+interest, tending to zero as BTC goes to infinity. Fine. But that assumes BTC do go to infinity, or appreciate forever. Probably it will. But will it in your life time, or when the loan is due? You don&#39;t know that.</p>\n\n<p>A second option I see almost nobody talking about is:</p>\n\n<p><strong>Write call options on your bitcoin.</strong></p>\n\n<p>Yes. Find a strike price and a time frame for which you would be comfortable letting the upside go to the option holder, short the option, and let time do the job. I find relying on time much better because <strong>time, differently from price, only goes in one direction: forward</strong>, while price can go up or down. If the bitcoin price ends below the strike price (any price, even $0.01), you will earn the premium. If it ends above, then you will lose the part of the upside that is above the strike price only. Example (with <strong>real trading prices as of right now</strong>):</p>\n\n<p>Imagine you own 1 bitcoin and you are ok with sacrificing all upside above a $300K price by Sep 30th, 2022. The price of a 300K call option due at this date on Deribit is 0.042 BTC (ask price). This means that if you short this option, you get paid 0.042 BTC after 326 days for any price BTC ends, as long as it is below 300K.</p>\n\n<p>BTC is 50K in 326 days = you earn 0.042 BTC per option sold. You still have all your BTC plus that.</p>\n\n<p>BTC is 150K in 326 days = you earn 0.042 BTC per option sold. You still have all your BTC plus that.</p>\n\n<p>BTC is 250K in 326 days = you earn 0.042 BTC per option sold. You still have all your BTC plus that.</p>\n\n<p>Now, what if you want to lock-in the dollar value of the 0.042BTC instead? Because, for example, you are concerned that bitcoin may go down so if it goes to 10K, you want 0.042 BTC at the current price of 65K, not at 10K price. <strong>Great, you can do that</strong>! Short 0.042 BTC worth of futures expiring in September-2022, and you can lock-in, today, a dollar value of 0.042*73000 = $3,066. Then</p>\n\n<p>BTC is 50K in 326 days = you earn $3,066 per option sold. You still have all your BTC plus that.</p>\n\n<p>BTC is 150K in 326 days = you earn $3,066 per option sold. You still have all your BTC plus that.</p>\n\n<p>BTC is 250K in 326 days = you earn $3,066 per option sold. You still have all your BTC plus that.</p>\n\n<p>Of course, all these &quot;gains&quot; come at a price: if the price explodes above 300K, then you are left with 300K per coin, plus the premium.</p>\n\n<p>BTC is 350K in 326 days = you earn 0.042 BTC per option sold. But you have 300/350 = 0.857 BTC per each BTC you had.</p>\n\n<p>BTC is 600K in 326 days = you earn 0.042 BTC per option sold. But you have 300/600 = 0.50 BTC per each BTC you had.</p>\n\n<p>And so on. If you had shorted future contracts to lock-in the 0.042 BTC, just replace 0.042BTC by $3,066 in the computations above.</p>\n\n<p>Is this a &quot;risky&quot; trade? Yes. But the risk you incur is a different type of risk than when you take a loan against your bitcoin. When you take a loan against your bitcoin, you have a type of risk called &quot;wrong way&quot; risk: the more BTC goes down, the more poor you are (because the value of your bitcoin holdings go down) and the more likely you are to default on your loan (because your collateral is less valuable and you will have to sell more bitcoin to pay it). The advantage of taking this risk is that you have no upside limitations. BTC can go to a gazillion dollars and you would have a ridiculously small debt to pay, which you can do by selling a very tiny amount of bitcoin. However, I believe that most of those holding bitcoins want to preserve their wealth once acquired, and avoid taking unnecessary risks once bitcoin get to a certain dollar amount. In that case, it might be more appropriate to take this other kind of risk, where the situation where you &quot;lose&quot; is actually the situation where bitcoin goes up too much too fast, and you lose some of the upside. Sure, you probably will be sad that you could have more by doing nothing, if this happens, but even if this happens, you still enjoyed a nice capital gain and earned a premium.</p>\n\n<p>Edit: In the example I gave you get a 4.2% return over a 326 days period. That&#39;s more than the 4% annualized interest you get in these lending platforms like Nexo, Celsius, BlockFi, etc. With a very important <strong>advantage:</strong> you don&#39;t need to post a full bitcoin as margin for each option sold, so the <strong>counterparty risk is considerably lower</strong>. On Deribit, the margin for shorting an option is around 0.10-0.12 BTC. So if you hold 5 BTC and want to short 5 call options, you just need to deposit 0.6BTC on Deribit, and can leave the other 4.4 BTC in cold storage. If you face a margin call (your maintenance margin is near 100%) then, and only then (if it ever happens), you will need to deposit more.</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/Bitcoin/comments/qpmakw/how_to_live_off_your_bitcoin_without_ever_selling/",
  "subreddit": "Bitcoin",
  "id": "qpmakw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Much is discussed about when to sell your bitcoins. Most of the time, the usual\nbitcoiner response is \"never\". However, if you never sell, then how can you ever\nenjoy the profits? This is where things diverge. So far, I have never seen\nanyone mentioning an alternative to the following option:\n\nTake…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコインの売却時期については多くの議論がなされています。たいていの場合、ビットコイナーは\nビットコイナーは「絶対に」と答えます。しかし、もし売らないのであれば、どうやって利益を得ることができるでしょうか？\n利益を得ることができるでしょうか？ここからが本題です。今のところ、次のような選択肢を挙げている人を見たことがありません。\n今のところ、次のような選択肢を挙げている人は見たことがありません。\n\nTake...",
      "title": "ビットコインを売ることなく、また、ビットコインに対してローンを組むことなく生活する方法"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "关于何时出售你的比特币，讨论得很多。大多数时候，通常的\n比特币持有者的反应是 \"永远不要\"。然而，如果你不卖，那么你怎么能\n享受利润？这就是事情的分歧之处。到目前为止，我还没有看到\n有人提到了下面这个选项的替代方案。\n\n以...",
      "title": "如何在不卖出比特币的情况下依靠比特币生活，而不必拿比特币做抵押贷款"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "關於何時出售你的比特幣，討論得很多。大多數時候，通常的\n比特幣持有者的反應是 \"永遠不要\"。然而，如果你不賣，那麼你怎麼能\n享受利潤？這就是事情的分歧之處。到目前爲止，我還沒有看到\n有人提到了下面這個選項的替代方案。\n\n以...",
      "title": "如何在不賣出比特幣的情況下依靠比特幣生活，而不必拿比特幣做抵押貸款"
    }
  ]
}