{
  "author": "scatterblooded",
  "the_new_excerpt": "This comparison is probably older than Reddit itself, but for investors who have\ndecided to buy into only one fund and forget about it, why'd you pick that one?\n\nSure, the difference between these ETFs is in the diversification: top 500 US\ncompanies vs. whole US market vs. whole world market. But…",
  "original_created_utc": 1623550859,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この比較は、おそらくReddit自体よりも古いものだと思いますが、1つのファンドだけを購入して忘れると決めている投資家にとっては\nこの比較はRedditよりも古いかもしれませんが、1つのファンドだけを購入してそれを忘れようと決めた投資家にとって、なぜそのファンドを選んだのでしょうか？\n\n確かに、これらのETFの違いは、分散されていることです。\n全米トップ500企業 vs 全米市場 vs 全世界市場。でも...。",
      "title": "今後30年間のVOO vs. VTI vs. VT"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这种比较可能比Reddit本身更古老，但对于那些决定只买一个基金的投资者来说\n决定只买一个基金，然后忘掉它，你为什么要选那个？\n\n当然，这些ETF之间的区别在于多样化：美国前500家公司与整个美国市场的差异。\n公司与整个美国市场与整个世界市场。但是...",
      "title": "未来30年的VOO与VTI与VT的关系"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這種比較可能比Reddit本身更古老，但對於那些決定只買一個基金的投資者來說\n決定只買一個基金，然後忘掉它，你爲什麼要選那個？\n\n當然，這些ETF之間的區別在於多樣化：美國前500家公司與整個美國市場的差異。\n公司與整個美國市場與整個世界市場。但是...",
      "title": "未來30年的VOO與VTI與VT的關係"
    }
  ],
  "title": "VOO vs. VTI vs. VT for the next 30 years",
  "created_utc": 1623561868,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This comparison is probably older than Reddit itself, but for investors who have decided to buy into only one fund and forget about it, why&#39;d you pick that one?</p>\n\n<p>Sure, the difference between these ETFs is in the diversification: top 500 US companies vs. whole US market vs. whole world market. But with so many of the top US companies operating internationally, and such a globally connected economy in 2021, is VOO not diversified enough to reliably protect my money?</p>\n\n<p>I understand that past performance is just that, and want to avoid recency bias, but I have no reason to believe that the US market will suddenly start underperforming the rest of the world any time soon. Without such a thesis, VOO just makes the most sense to me. </p>\n\n<p>Today, my money is invested in VOO, but I&#39;m curious to hear thoughts from others. Which fund do you invest in, and why not the others?</p>\n</div><!-- SC_ON -->",
  "score": 541,
  "permalink": "/r/investing/comments/nymmk3/voo_vs_vti_vs_vt_for_the_next_30_years/",
  "subreddit": "investing",
  "id": "nymmk3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009742342
}