{
  "author": "MolotovCollective",
  "original_created_utc": 1631728484,
  "title": "A common view of the Napoleonic Wars can be summarized as Napoleon beating the pants off Europe for years until the British swoop in and save the day with a smaller, better army. How true is this and how much may be unintentional bias due to British sources being more accessible to English speakers?",
  "created_utc": 1631746627,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m very skeptical that this is not the view held by most people in say, France, Germany, Austria, or Russia, but due to me not speaking those languages, I can’t look up their perspectives.</p>\n\n<p>Similarly, in looking up primary sources on the subject, I’m immediately struck by the quick realization that there’s no shortage of published British primary sources, whether from Wellington or Nelson themselves, other officers, or soldier diaries, journals, and books. I have to look very hard for any other perspectives. I found a few translated French sources from some of Napoleon’s marshals, but these are far fewer in number and at a much higher level than the varied points of view of British soldiers. I suspect that if I based my opinion on these sources alone, I’d get an extremely skewed bias in favor of the British, and get the view of the other allied powers as a mere side cast of characters.</p>\n\n<p>To be clear, I’d like to point out that I don’t believe this issue to be present among actual scholars, but unfortunately when as I search for things online as a lay person, more often than not what I find are not scholars, but Wikipedia articles, Quora questions, and YouTube videos, which while entertaining, I have a hard time fully accepting, and this is where I’m worried these biases may shine through the most. </p>\n\n<p>I’ve actually bought two books on the Napoleonic Wars, but I haven’t had the chance to start them yet because I feel like to understand those wars I need to understand the French Revolution and the French Revolutionary Wars, which I’ve also bought books on and I’m reading those first.</p>\n\n<p>And also to be more specific, I’m curious more about the performance of these soldiers on the tactical level. I’m aware of strategic factors like the failed invasion of Russia, but that says more to me about the state of command than it does about the performance of the soldiers involved.</p>\n</div><!-- SC_ON -->",
  "score": 108,
  "permalink": "/r/AskHistorians/comments/pov9p9/a_common_view_of_the_napoleonic_wars_can_be/",
  "subreddit": "AskHistorians",
  "id": "pov9p9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m very skeptical that this is not the view held by most people in say, France,\nGermany, Austria, or Russia, but due to me not speaking those languages, I can’t\nlook up their perspectives.\n\nSimilarly, in looking up primary sources on the subject, I’m immediately struck\nby the quick realization that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "フランス、ドイツ、オーストリア、ロシアなどの多くの人々がこのような考え方をしていないのではないかと私は非常に疑っています。\nフランス、ドイツ、オーストリア、ロシアなどの多くの人々がこのような見解を持っていないことに非常に疑問を感じています。\nしかし、私はそれらの言語を話せないので、彼らの見解を調べることはできません。\n\n同様に、この問題に関する一次資料を調べてみると、すぐに気づかされます。\nとすぐに気づかされます・・・。",
      "title": "ナポレオン戦争についての一般的な見方は、ナポレオンが何年にもわたってヨーロッパを叩きのめし、その間にイギリスが小規模で優れた軍隊をもって急襲して窮地を脱する、というものです。これはどの程度真実なのでしょうか？また、イギリスの資料が英語圏の人々にとってより身近なものであることによる意図しないバイアスはどの程度あるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我非常怀疑这不是法国等国大多数人的观点。\n德国、奥地利或俄罗斯的大多数人都持这种观点，但由于我不会说这些语言，我无法\n查阅他们的观点。\n\n同样，在查找有关这个问题的原始资料时，我立即被以下事实所震惊\n迅速意识到，...",
      "title": "对拿破仑战争的普遍看法可以概括为拿破仑在欧洲打了好几年，直到英国人带着一支更小、更好的军队猛攻过来，挽救了局面。这有多真实，又有多少可能是由于讲英语的人更容易获得英国的资料而产生的无意偏见？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我非常懷疑這不是法國等國大多數人的觀點。\n德國、奧地利或俄羅斯的大多數人都持這種觀點，但由於我不會說這些語言，我無法\n查閱他們的觀點。\n\n同樣，在查找有關這個問題的原始資料時，我立即被以下事實所震驚\n迅速意識到，...",
      "title": "對拿破崙戰爭的普遍看法可以概括爲拿破崙在歐洲打了好幾年，直到英國人帶着一支更小、更好的軍隊猛攻過來，挽救了局面。這有多真實，又有多少可能是由於講英語的人更容易獲得英國的資料而產生的無意偏見？"
    }
  ]
}