{
  "author": "mj_moonwalker_03",
  "original_created_utc": 1655007588,
  "title": "Do some people literally not wipe or clean their ass after using the toilet?",
  "created_utc": 1655031667,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Every now and then I visit the restroom and I find people have left their dung in the toilet (this has happened in both single-gendered and unisex). You can already tell that the person who used prior doesn’t even have the sense to flush the damn toilet, but it’s even worse when there isn’t any toilet paper in the bowl. How the fuck did you clean yourself??? I highly doubt people are walking around with portable bidet bulbs.  I knew that some men consider washing their ass in the shower “gay” or something (because apparently cleanliness isn’t masculine?), but now I’m extra worried about how many people are walking around with shitty butts. I ask because I’m a germ freak and actual diseases can come from a lack of proper sanitation &amp;amp; cleanliness.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 113,
  "permalink": "/r/TooAfraidToAsk/comments/vae3vb/do_some_people_literally_not_wipe_or_clean_their/",
  "subreddit": "TooAfraidToAsk",
  "id": "vae3vb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Every now and then I visit the restroom and I find people have left their dung\nin the toilet (this has happened in both single-gendered and unisex). You can\nalready tell that the person who used prior doesn’t even have the sense to flush\nthe damn toilet, but it’s even worse when there isn’t any…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "たまにトイレに行くと、人が糞をしたままになっていることがあります。\nをトイレに残していることがある（これは男女兼用でも起こったこと）。これは、男女兼用でも同じです。\nを流そうという意識がないことがわかる。\nしかし、それがない場合はなおさらだ...。",
      "title": "トイレを使った後、文字通りお尻を拭かない、きれいにしない人がいるのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "每当我去洗手间的时候，我发现人们把粪便留在马桶里。\n在马桶里（这种情况在单性别和非单性别厕所都有发生）。你可以\n你已经可以看出，之前用过的人甚至没有意识到要冲掉该死的马桶。\n但如果没有马桶，那就更糟糕了......",
      "title": "有些人在上完厕所后真的不擦拭或清洁他们的屁股吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "每當我去洗手間的時候，我發現人們把糞便留在馬桶裏。\n在馬桶裏（這種情況在單性別和非單性別廁所都有發生）。你可以\n你已經可以看出，之前用過的人甚至沒有意識到要衝掉該死的馬桶。\n但如果沒有馬桶，那就更糟糕了......",
      "title": "有些人在上完廁所後真的不擦拭或清潔他們的屁股嗎？"
    }
  ]
}