{
  "author": "goobdude",
  "original_created_utc": 1654348384,
  "title": "Do any of you \"rehearse\" hypothetical conversations throughout the day or am I just crazy?",
  "created_utc": 1654363335,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey all, for as long as I can remember I&amp;#39;ve been a &amp;quot;think out loud&amp;quot; type when I&amp;#39;m on my own (or even a mutter if people are slightly in earshot.)&lt;/p&gt;\n\n&lt;p&gt;The thing is that usually it goes a step further and I&amp;#39;m kind of monologuing my thoughts, as if I&amp;#39;m rehearsing my part of a conversation, but it&amp;#39;s a conversation that I know isn&amp;#39;t going to take place. What I mean by that is usually it&amp;#39;s not something like &amp;quot;ok let me practice for this upcoming job interview&amp;quot; but instead &amp;quot;here is a hypothetical conversation I would have with my brother about blah blah blah.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I feel like it might be a way to blow off steam, or organize my thoughts, or even just me trying to be prepared for things to go down, but it&amp;#39;s difficult to not think that I&amp;#39;m just crazy. Do any of you do something similar?&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d like to also add that I&amp;#39;ve been involved with theatre since middle school, so maybe I&amp;#39;m &amp;quot;rehearsing scenes&amp;quot; to get my thoughts organized. I don&amp;#39;t really know.&lt;/p&gt;\n\n&lt;p&gt;Edit: alright, good to know I&amp;#39;m not alone in this! Thanks for taking the time to answer; at the very least I can cross off one of the many reasons I might be crazy 🤣&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 112,
  "permalink": "/r/NoStupidQuestions/comments/v4omgf/do_any_of_you_rehearse_hypothetical_conversations/",
  "subreddit": "NoStupidQuestions",
  "id": "v4omgf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hey all, for as long as I can remember I've been a \"think out loud\" type when\nI'm on my own (or even a mutter if people are slightly in earshot.)\n\nThe thing is that usually it goes a step further and I'm kind of monologuing my\nthoughts, as if I'm rehearsing my part of a conversation, but it's…"
}