{
  "author": "mentalist_mental",
  "the_new_excerpt": "I had a dream last night which involved a new sport, which is basically boxing\nplus swimming. It was called boxwimming, and involved two fighters, treading\nwater/swimming in a deep swimming pool, fighting until the one of them was\nknocked unconscious. In the dream, the losing fighter sank in the…",
  "original_created_utc": 1615121850,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我昨晚做了一个梦，梦到了一项新的运动，基本上就是拳击。\n加上游泳。它被称为盒式游泳，并涉及到两个战士，踩着。\n水/在一个深邃的游泳池里游泳，战斗，直到他们中的一个人被。\n被打晕了。在梦中，输了的拳手沉在... ...",
      "title": "\"拳击游泳\"--这项新运动会不会把所有输掉的人都杀掉？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我昨晚做了一個夢，夢到了一項新的運動，基本上就是拳擊。\n加上游泳。它被稱爲盒式游泳，並涉及到兩個戰士，踩着。\n水/在一個深邃的游泳池裏游泳，戰鬥，直到他們中的一個人被。\n被打暈了。在夢中，輸了的拳手沉在... ...",
      "title": "\"拳擊游泳\"--這項新運動會不會把所有輸掉的人都殺掉？"
    }
  ],
  "title": "\"Boxwimming\" - would this new sport just kill everyone who lost?",
  "created_utc": 1615136457,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I had a dream last night which involved a new sport, which is basically boxing plus swimming.  It was called boxwimming, and involved two fighters, treading water/swimming in a deep swimming pool, fighting until the one of them was knocked unconscious.  In the dream, the losing fighter sank in the pool, and scuba medics who were on standby dived down and retrieved the fighter, who was fine once he reached the surface of the water.</p>\n\n<p>But if this were to happen in reality, if someone was knocked unconscious and went underwater, would they immediately inhale water into the lungs (and therefore drown)?  Or would the dive reflex kick in to prevent them from attempting to breathe whilst underwater?</p>\n\n<p>If anyone else has any thoughts about the practicalities of this hypothetical sport, I&#39;d love to hear them.  Thanks!</p>\n</div><!-- SC_ON -->",
  "score": 110,
  "permalink": "/r/NoStupidQuestions/comments/lzq6d5/boxwimming_would_this_new_sport_just_kill/",
  "subreddit": "NoStupidQuestions",
  "id": "lzq6d5",
  "is_self": true,
  "media": null,
  "is_video": false
}