{
  "author": "freebird348",
  "original_created_utc": 1624841561,
  "title": "There are studies shown that workers who stay loyal to companies make 50% less money overtime. Why don't companies incentivize employees to stay at their company with drastically higher raises instead of finding new talent?",
  "created_utc": 1624848127,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is something I&#39;ve thought about a lot but have never understood. I just got a few new job offers and the salary for most of them is almost double what I&#39;m making now (and one of the offer the salary IS double). </p>\n\n<p>We have a culture of switching jobs every 2-3 years but it makes sense from the employers standpoint cause they can make more money that way. However, why is it that if I work at Company A and get paid $100k a year, then I can switch to Company B at the same title and get paid 120k, and then Company A will backfill that position with a salary of 120k? It makes no sense to me. </p>\n\n<p>Also, if you stay at a company awhile you have SOO much institutional knowledge which is helpful at your role and saves the company way more time. You would have to pay lower costs for recruiting and signing bonuses if you just give people drastically bigger raises. I feel that if I have 5 years of experience at Company A and someone else has 5 years of experience at a different company, but just got hired at Company A, I should be paid more since I&#39;ve stayed at the company longer and am better at that specific job. </p>\n\n<p>Anyone else have a good counter to this?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/NoStupidQuestions/comments/o99kba/there_are_studies_shown_that_workers_who_stay/",
  "subreddit": "NoStupidQuestions",
  "id": "o99kba",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is something I've thought about a lot but have never understood. I just got\na few new job offers and the salary for most of them is almost double what I'm\nmaking now (and one of the offer the salary IS double).\n\nWe have a culture of switching jobs every 2-3 years but it makes sense from…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは私が何度も考えてきたことですが、理解できませんでした。私はちょうど\nほとんどの仕事の給料は、今の私の給料のほぼ2倍です。\n2倍の給料をもらっています（そのうちの1つは給料が2倍です）。\n\n私たちは2～3年ごとに転職する文化を持っていますが、それが意味を持つのは...",
      "title": "企業に忠誠を誓った労働者は、残業代が50％減るという研究結果があります。なぜ企業は、新しい人材を見つける代わりに、大幅に高い昇給で従業員に会社に留まるようインセンティブを与えないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是我经常思考的问题，但一直不明白。我刚刚收到\n几份新的工作机会，其中大部分的工资几乎是我现在工资的两倍（其中一份工作的工资是两倍）。\n的两倍（其中一份工作的薪水是两倍）。\n\n我们有一种每2-3年换一次工作的文化，但这是有道理的。",
      "title": "有研究表明，对公司保持忠诚的工人，加班费用会减少50%。为什么公司不通过大幅提高加薪来激励员工留在公司，而不是寻找新的人才？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是我經常思考的問題，但一直不明白。我剛剛收到\n幾份新的工作機會，其中大部分的工資幾乎是我現在工資的兩倍（其中一份工作的工資是兩倍）。\n的兩倍（其中一份工作的薪水是兩倍）。\n\n我們有一種每2-3年換一次工作的文化，但這是有道理的。",
      "title": "有研究表明，對公司保持忠誠的工人，加班費用會減少50%。爲什麼公司不通過大幅提高加薪來激勵員工留在公司，而不是尋找新的人才？"
    }
  ]
}