{
  "author": "brokensilence32",
  "original_created_utc": 1633128447,
  "title": "Were Roman gladiatorial fights ever \"worked\" like professional wrestling matches?",
  "created_utc": 1633189673,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I would imagine that two gladiators might want to work out a winner and rough outline beforehand so that neither of them would be seriously injured or killed, as they might in a legitimate contest. I&#39;ve heard that carnival wrestlers back in the day worked their matches because they would wrestle every night and a worked match would be easier and safer to do, and that&#39;s sort of how pro wrestling started. Why wouldn&#39;t gladiators do the same thing? As long as the crowd is happy and sees some blood, wouldn&#39;t it be a good idea?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/pzj00r/were_roman_gladiatorial_fights_ever_worked_like/",
  "subreddit": "AskHistorians",
  "id": "pzj00r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I would imagine that two gladiators might want to work out a winner and rough\noutline beforehand so that neither of them would be seriously injured or killed,\nas they might in a legitimate contest. I've heard that carnival wrestlers back\nin the day worked their matches because they would wrestle…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "二人のグラディエーターは、事前に勝敗や大まかな概要を決めておいて、どちらも本気にならないようにするのではないかと想像しています。\n二人の剣闘士は、どちらも大怪我をしたり殺されたりしないように、事前に勝敗と大まかな概要を決めておきたいと思うでしょう。\n正当な試合の場合と同じようにね。その昔、カーニバルのレスラーたちは\nその昔、カーニバルのレスラーが試合をしたのは、彼らがレスリングをするためだと聞いたことがあります...。",
      "title": "ローマ時代の剣闘士の試合は、プロレスのように「仕事」をしていたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我可以想象，两个角斗士可能希望事先制定出一个赢家和大致的\n纲，这样他们中的任何一个人都不会受重伤或死亡。\n就像他们在一场合法的比赛中一样。我听说以前的狂欢节摔跤手\n我听说当年的狂欢节摔跤手在比赛时都是这样的，因为他们会摔跤......",
      "title": "罗马角斗士的战斗是否曾经像职业摔跤比赛那样 \"有效\"？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我可以想象，兩個角鬥士可能希望事先制定出一個贏家和大致的\n綱，這樣他們中的任何一個人都不會受重傷或死亡。\n就像他們在一場合法的比賽中一樣。我聽說以前的狂歡節摔跤手\n我聽說當年的狂歡節摔跤手在比賽時都是這樣的，因爲他們會摔跤......",
      "title": "羅馬角鬥士的戰鬥是否曾經像職業摔跤比賽那樣 \"有效\"？"
    }
  ]
}