{
  "author": "Due_Kiwi627",
  "original_created_utc": 1659864875,
  "title": "Where do people actually buy drugs from?",
  "created_utc": 1659887693,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;OK, so the one thing I learned growing up with D.A.R.E. (which is a program that supposedly keeps kids off drugs but had the opposite effect), is that at ANY moment someone was going to offer me drugs.  They&amp;#39;d be on every street corner.  Keep vigilant.  Etc.&lt;/p&gt;\n\n&lt;p&gt;I am nearing 41, but I have never been offered anything stronger than weed.  So how the hell does everyone actually find drugs?&lt;/p&gt;\n\n&lt;p&gt;Edit: Thank you for answering.  It genuinely never dawned on me that it&amp;#39;s a networking thing.&lt;/p&gt;\n\n&lt;p&gt;Edit 2:  to the people messaging me, I do not want drugs.  I had addicts in the family, but because I was such an introverted nerd, I just never came across this stuff growing up.  I got to thinking about it last night when I was picking up Gavascon online.  I&amp;#39;m still just an introverted nerd and was curious.  Also, I&amp;#39;m old.  I&amp;#39;m not 20 anymore, all my friends have kids.  Never dawned on me to just ask them if they knew anyone.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 143,
  "permalink": "/r/NoStupidQuestions/comments/wibsbp/where_do_people_actually_buy_drugs_from/",
  "subreddit": "NoStupidQuestions",
  "id": "wibsbp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "OK, so the one thing I learned growing up with D.A.R.E. (which is a program that\nsupposedly keeps kids off drugs but had the opposite effect), is that at ANY\nmoment someone was going to offer me drugs. They'd be on every street corner.\nKeep vigilant. Etc.\n\nI am nearing 41, but I have never been…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私がD.A.R.E.で学んだことのひとつは、子供たちを薬物から守るためのプログラムであることです。\nD.A.R.E.（子供を麻薬から守るためのプログラムですが、逆効果でした）で育った私が学んだことは、いつ何時でも誰かが私に麻薬を勧めてくるということです。\nいつ何時、誰かが私にドラッグを勧めてくるということです。どの街角にもいるんです。\n警戒を怠らないように。などなど。\n\n私はもうすぐ41歳になりますが、今まで一度も...",
      "title": "実際に薬を買う人はどこから買っているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，所以我在D.A.R.E.成长过程中了解到的一件事（这是一个据说可以让孩子们远离毒品的项目）。\n这是一个据说可以让孩子们远离毒品的项目，但效果却恰恰相反），就是在任何时候都会有人向我提供毒品。\n任何时候都会有人向我提供毒品。他们会在每个街角出现。\n保持警惕。等等。\n\n我已经接近41岁了，但我从来没有...",
      "title": "人们究竟从哪里购买毒品？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，所以我在D.A.R.E.成長過程中瞭解到的一件事（這是一個據說可以讓孩子們遠離毒品的項目）。\n這是一個據說可以讓孩子們遠離毒品的項目，但效果卻恰恰相反），就是在任何時候都會有人向我提供毒品。\n任何時候都會有人向我提供毒品。他們會在每個街角出現。\n保持警惕。等等。\n\n我已經接近41歲了，但我從來沒有...",
      "title": "人們究竟從哪裏購買毒品？"
    }
  ]
}