{
  "author": "alexisaacs",
  "the_new_excerpt": "There's a lot of talk about DCAing (dollar cost averaging) and \"buying the dip\"\nso I wanted to share a few strategies that I rarely, if ever, see posted on\nhere.\n\nThe thing is, it makes almost no sense to just tell people to DCA into markets\nor to \"buy the dip.\"\n\nThere are nuances that make or break…",
  "original_created_utc": 1619206858,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "DCA（ドル・コスト平均法）や \"ディップを買う \"ということがよく言われています。\nそこで、このサイトではめったに見られない戦略をご紹介したいと思います。\nをご覧ください。\n\nただ、市場にDCAを導入しなさいとか、「ディップを買いなさい」と言っても、ほとんど意味がありません。\n\"ディップを買え \"と言っても、ほとんど意味がありません。\n\nニュアンスの違いによって、相場を左右するのは...",
      "title": "ディップ買い戦略と暗号でリアルマネーを稼ぐための親切な注意喚起"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有很多关于DCAing（美元成本平均法）和 \"买跌 \"的讨论\n所以我想与大家分享一些策略，这些策略我很少，甚至从来没有在这里看到过。\n这里。\n\n问题是，仅仅告诉人们以平均成本法进入市场或 \"买入下跌 \"几乎没有意义。\n或 \"买入下跌 \"几乎没有意义。\n\n有一些细微的差别，使或破坏了...",
      "title": "友好提醒：跌停板购买策略和在加密货币中赚取真正的钱"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有很多關於DCAing（美元成本平均法）和 \"買跌 \"的討論\n所以我想與大家分享一些策略，這些策略我很少，甚至從來沒有在這裏看到過。\n這裏。\n\n問題是，僅僅告訴人們以平均成本法進入市場或 \"買入下跌 \"幾乎沒有意義。\n或 \"買入下跌 \"幾乎沒有意義。\n\n有一些細微的差別，使或破壞了...",
      "title": "友好提醒：跌停板購買策略和在加密貨幣中賺取真正的錢"
    }
  ],
  "title": "Friendly reminder on dip buying strategy and making REAL money in crypto",
  "created_utc": 1619235450,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There&#39;s a lot of talk about DCAing (dollar cost averaging) and &quot;buying the dip&quot; so I wanted to share a few strategies that I rarely, if ever, see posted on here.</p>\n\n<p>The thing is, it makes almost no sense to just tell people to DCA into markets or to &quot;buy the dip.&quot; </p>\n\n<p>There are nuances that make or break the strategy.</p>\n\n<p>First off - <strong>YOU CAN DCA OUT OF A MARKET THE SAME WAY YOU DCA INTO IT.</strong></p>\n\n<p>But more importantly, you can take profits, and then reinvest them during the dips.</p>\n\n<p><em>And rest assured, even if the market doesn&#39;t crash, local corrections ALWAYS happen. Bitcoin can reach 10 million USD by the end of the year, and on the way there we will still see plenty of 10-30% corrections.</em></p>\n\n<p>What you should be asking yourself is are you ready to act when these corrections happen?</p>\n\n<p>And are you ready to act when your random altcoin goes 2x or 3x?</p>\n\n<p>Here is some food for thought:</p>\n\n<ol>\n<li><p>Set sell orders for your alt coins. I target my sell orders at 1.5-3x the current price, depending on the volatility of said coin. </p></li>\n<li><p>I set my sell order for 10% - 50% depending on two things: How much I believe in the coin (For example I would sell 90% of my stack for something like Doge or Safemoon if I hit a 3x or 5x) &amp; My sell order target (for example if I set it for 1.5x the current price, I might only sell 15% of my stack at that target, but if I hit my 2x price target I might sell 30%) </p></li>\n<li><p>Sell orders are important for alts because they can randomly pump &amp; dump and you want to try to hit the top of those wicks.</p></li>\n<li><p>You&#39;ll rarely hit your target perfectly, but for example the other day Nano pumped to $17 on my exchange from $5. I had a sell order set for $15 and it triggered. No, I didn&#39;t get the top of the wick but had I not placed that sell order, I wouldn&#39;t have been able to sell until Nano was already back down to $9 which is when I noticed it was pumping.</p></li>\n<li><p>Once you sell, your only job is to wait for a local dip to buy back in.</p></li>\n</ol>\n\n<h2>But what does buying a dip actually look like?</h2>\n\n<ul>\n<li><p>In a bullish momentum, it might be as simple as buying coins that dumped the most from their ATH (assuming there wasn&#39;t any crazy news like rugpulls on Safemoon)</p></li>\n<li><p>However, what I want to discuss is buying the dip in BEARISH momentum, which is what we are in right now.</p></li>\n<li><p>I define bearish momentum as a sentimental change in crypto. When instead of feeling like the next pump is coming, we all feel like another 20-30% dump is on its way.</p></li>\n</ul>\n\n<p>Buying the dip in bearish momentum causes people a lot of anxiety because we all think &quot;what if it keeps crashing? What if this is the end of the bull market?&quot;</p>\n\n<p>Here&#39;s the thing about the bull market ending...</p>\n\n<p><strong>The same way that local dips ALWAYS happen in a crazy bull run, local pumps ALWAYS happen in a bear market.</strong></p>\n\n<p>Often times we call these a &quot;dead cat bounce.&quot;</p>\n\n<p>And this is where we make our money when there is a lot of bearish momentum.</p>\n\n<p>I&#39;ll give you an example that I played a few months ago with XRP.</p>\n\n<p>I bought XRP at an average cost of about 55 cents.</p>\n\n<p>When the SEC news hit, I sold my entire stack at 48 cents for a sizeable loss.</p>\n\n<p>But here&#39;s the catch.</p>\n\n<p>It kept dipping, in fact it crashed all the way to like 17 cents.</p>\n\n<h2>And I bought the dip</h2>\n\n<p>It went back up to about 36 cents and I managed to sell the top of that wick because I was watching the charts all day at that point.</p>\n\n<p>Then it crashed back down.</p>\n\n<p>While most people were freaking out about losses, I turned my loss into big gains by buying the dip...</p>\n\n<p><strong>AND THEN SELLING THE DEAD CAT BOUNCE.</strong></p>\n\n<p>Why did I sell the bounce instead of just holding? </p>\n\n<p><em>Bearish momentum.</em></p>\n\n<p>The sentiment change about XRP and its lawsuit + exchange delisting meant that the opportunity cost of holding it was too high, especially when I just made thousands of dollars on riding the dead cat bounce upward.</p>\n\n<p><em>&quot;But <a href=\"/u/alexisaacs\">/u/alexisaacs</a>, if you had just held XRP for 5 months you would have made even more money!&quot;</em></p>\n\n<p>And therein lies the mentality that loses people their life savings.</p>\n\n<p>Yes, eventually XRP pumped to $1.70+</p>\n\n<p>But what guarantee did I have that the lawsuit would go well?</p>\n\n<p>How could I guess the bull market would continue? </p>\n\n<p>How could I know that we&#39;d have an alt season?</p>\n\n<p>The risk vs reward was too much, but I knew ONE thing for certain.</p>\n\n<p>IF XRP EVER PUMPED AGAIN, IT WOULD BE IN AN ALT SEASON WHERE EVERYTHING PUMPS.</p>\n\n<p>So I sold the dead cat bounce, bought a ton of other alts + eth, and made way more money holding those than I could have by just holding XRP and &quot;buying the dip.&quot;</p>\n\n<p>tl;dr: </p>\n\n<ol>\n<li><p>DCA out of the market when you make crazy gains, use sell orders</p></li>\n<li><p>Buy the dip and HODL when the momentum is very bullish</p></li>\n<li><p>Buy the dip and sell the dead cat bounce when the momentum is bearish</p></li>\n<li><p>If you get fucked by short term moves up or down, remember that there will ALWAYS be local dips and local crashes.</p></li>\n</ol>\n\n<p>Lastly...</p>\n\n<ol>\n<li>Stop worrying about the USD price of a coin, and pay attention to % changes.</li>\n</ol>\n\n<p>EXAMPLE:</p>\n\n<p>You buy Harmony One @ .01.</p>\n\n<p>You sell Harmony One @ .02</p>\n\n<p>Harmony One keeps pumping to .05</p>\n\n<p>You start panicking, but instead you should pay attention to the chart because...</p>\n\n<p>Harmony One eventually has a local correction to .03</p>\n\n<p>Yep that&#39;s way above what you sold it for but...</p>\n\n<p>Buying at .03 is buying the local dip, and in a bull market it could easily pump back up and even if it never goes above .04 again, you can sell at .04 and enjoy 33% gains.</p>\n\n<p>I hope this all made sense and helps some traders. Just thought I&#39;d share a strategy I rarely see posted in the daily thread here.</p>\n</div><!-- SC_ON -->",
  "score": 559,
  "permalink": "/r/CryptoCurrency/comments/mx3cu9/friendly_reminder_on_dip_buying_strategy_and/",
  "subreddit": "CryptoCurrency",
  "id": "mx3cu9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776208807
}