{
  "author": "palomdude",
  "original_created_utc": 1641481856,
  "title": "What is the end game for Covid?",
  "created_utc": 1641525150,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;No one ever seems to talk about how and when the pandemic will end. I don&amp;#39;t think Covid will ever be eliminated. We are way past that point. It is too widespread. Are we just waiting and hoping it will mutate into a less dangerous strain and then it will become just a flu and then we stop caring who catches it? Are we just waiting for everyone to catch it and then the people who die, unfortunately, just die and the rest of the population continues on? It sort of seems like that and the government just wants to slow the spread so the hospitals don&amp;#39;t get overwhelmed. I feel like the morbid nature of the question is why no one is talking about it, but I think it&amp;#39;s pretty important.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/rxgscs/what_is_the_end_game_for_covid/",
  "subreddit": "TooAfraidToAsk",
  "id": "rxgscs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "No one ever seems to talk about how and when the pandemic will end. I don't\nthink Covid will ever be eliminated. We are way past that point. It is too\nwidespread. Are we just waiting and hoping it will mutate into a less dangerous\nstrain and then it will become just a flu and then we stop caring…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "パンデミックがいつどのように終わるかについては、誰も語らないようです。私は\nコビットが無くなることはないと思います。私たちはその時期をはるかに過ぎています。あまりにも\nが広がっています。私たちはただ、危険の少ないものに変異するのを待つだけなのでしょうか？\nそして、ただのインフルエンザになり、私たちは気にしなくなるのです...。",
      "title": "Covidの最終目的は何でしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "似乎从来没有人谈论过这一流行病将如何以及何时结束。我不认为\n我认为Covid将永远被消除。我们已经远远超过了这一点。它太\n广泛存在。我们是否只是在等待，并希望它能变异成一个不那么危险的\n然后它就会变成普通的流感，然后我们就不再关心了......",
      "title": "Covid的最终游戏是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "似乎從來沒有人談論過這一流行病將如何以及何時結束。我不認爲\n我認爲Covid將永遠被消除。我們已經遠遠超過了這一點。它太\n廣泛存在。我們是否只是在等待，並希望它能變異成一個不那麼危險的\n然後它就會變成普通的流感，然後我們就不再關心了......",
      "title": "Covid的最終遊戲是什麼？"
    }
  ]
}