{
  "author": "kravintsky",
  "original_created_utc": 1638138369,
  "title": "Why do adults act condescending to kids and still expect kids to like them?",
  "created_utc": 1638159759,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>THIS. I&#39;ve never in my life understood why adults act condescending towards children and don&#39;t see how that is simply not the way to go about things. I mean, don&#39;t they remember what&#39;s like being a child? I witness this far too many times, like how older relatives talk to younger relatives (and I&#39;m talking about pre-teens here) as if they are stupid. Using that voice that you use to talking to pets, not treating them as equals in a conversation, constant interruptions, not taking their ideas seriously... the list goes on. Later they&#39;re left wondering why the kids don&#39;t like interacting with them.</p>\n\n<p>Man, I remember DESPISING that behavior from grownups as a kid. It just made me hate them, so I&#39;ve always been confused when people do that and act as if it won&#39;t have any negative consequences. To be frank, I don&#39;t like kids that much but I&#39;m usually a kid magnet at social events and I&#39;ve noticed that it might be because I treat them like I treat any other person and they seem to respect and like me way more than they do with other adults. So if you&#39;re trying to interact positively with a kid (or your own) why not treat them like humans, no better or worse than yourself? It&#39;s not rocket science, <strong>kids see RIGHT through your bullshit, just saying.</strong></p>\n</div><!-- SC_ON -->",
  "score": 117,
  "permalink": "/r/TooAfraidToAsk/comments/r4g5hq/why_do_adults_act_condescending_to_kids_and_still/",
  "subreddit": "TooAfraidToAsk",
  "id": "r4g5hq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "THIS. I've never in my life understood why adults act condescending towards\nchildren and don't see how that is simply not the way to go about things. I\nmean, don't they remember what's like being a child? I witness this far too many\ntimes, like how older relatives talk to younger relatives (and I'm…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "THIS 大人が子供を見下すような態度をとるのは、これまでの人生で一度も理解できませんでした。\nそれは単に物事を進める方法ではないということがわかりません。I\nつまり、彼らは子供であることがどのようなものであるかを覚えていないのです。私はあまりにも多くのことを目の当たりにしてきました。\n年上の親戚が年下の親戚に話しかけるのを何度も目撃しています。",
      "title": "なぜ大人は子供を見下すような態度をとり、それでも子供に好かれようとするのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这个。我这辈子都不明白为什么成年人要对孩子采取居高临下的态度\n儿童，也不明白这根本不是处理事情的方式。I\n我的意思是，难道他们不记得小时候是什么样子吗？我目睹了太多这样的事情\n次，比如年长的亲戚如何与年轻的亲戚交谈（我是...",
      "title": "为什么成年人对孩子们表现得居高临下，还指望孩子们喜欢他们？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個。我這輩子都不明白爲什麼成年人要對孩子採取居高臨下的態度\n兒童，也不明白這根本不是處理事情的方式。I\n我的意思是，難道他們不記得小時候是什麼樣子嗎？我目睹了太多這樣的事情\n次，比如年長的親戚如何與年輕的親戚交談（我是...",
      "title": "爲什麼成年人對孩子們表現得居高臨下，還指望孩子們喜歡他們？"
    }
  ]
}