{
  "author": "ChristianSpoon",
  "original_created_utc": 1640602205,
  "title": "Investing in bitcoin for an initial $300",
  "created_utc": 1640630889,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I know it isn’t big, but it’s money I earned from a side job I have. I wanted to use it for investing in crypto since my savings from my actual job is going to my EF. I don’t really know how stocks work even if I wanted to try it, so I thought maybe I could just use the money to buy BTC.&lt;/p&gt;\n\n&lt;p&gt;I don’t really have a specific goal right now, but I want to be able to be financially independent before I turn 30 (I’m just 22 years old) and I know being smart with my investments will be a key factor.&lt;/p&gt;\n\n&lt;p&gt;Though is it okay to start investing with just that amount? Or do I need to have more in order to begin? Also what platforms do you use to buy?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 182,
  "permalink": "/r/Bitcoin/comments/rpky4k/investing_in_bitcoin_for_an_initial_300/",
  "subreddit": "Bitcoin",
  "id": "rpky4k",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I know it isn’t big, but it’s money I earned from a side job I have. I wanted to\nuse it for investing in crypto since my savings from my actual job is going to\nmy EF. I don’t really know how stocks work even if I wanted to try it, so I\nthought maybe I could just use the money to buy BTC.\n\nI don’t…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "大きくはないですが、私が持っている副業で稼いだお金です。を作りたかったんです。\n本業での貯蓄は暗号への投資に回しているので、暗号への投資に使います。\n私のEF 株はやってみたくても仕組みがよくわからないので\nそのお金でBTCを買えばいいのかなと思いました。\n\n私は...",
      "title": "初期費用300ドルでビットコインに投資する場合"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道这不是大数目，但这是我从我的一份副业中赚来的钱。我想\n我想用它来投资加密货币，因为我从实际工作中获得的储蓄将用于\n我的EF。即使我想尝试，我也不知道股票是如何运作的，所以我想也许我可以用这些钱来投资加密货币。\n所以我想也许我可以用这些钱来购买BTC。\n\n我不...",
      "title": "以最初的300美元投资于比特币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道這不是大數目，但這是我從我的一份副業中賺來的錢。我想\n我想用它來投資加密貨幣，因爲我從實際工作中獲得的儲蓄將用於\n我的EF。即使我想嘗試，我也不知道股票是如何運作的，所以我想也許我可以用這些錢來投資加密貨幣。\n所以我想也許我可以用這些錢來購買BTC。\n\n我不...",
      "title": "以最初的300美元投資於比特幣"
    }
  ]
}