{
  "author": "nops-90",
  "original_created_utc": 1636147667,
  "title": "Let's talk about Algorand fundamentals",
  "created_utc": 1636180259,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Many of you know about ALGO, but I want to enlighten those who are new to this great L1 chain. Some quick facts about Algorand: </p>\n\n<ul>\n<li>4 second transaction finality (it&#39;s fast)</li>\n<li>Transactions cost is ~ $0.002 (it&#39;s cheap) </li>\n<li>1000 TPS currently, growing to ~ 20,000 TPS in 2022 (it&#39;s scalable)</li>\n<li>Full NFT minting support</li>\n<li>It doesn&#39;t fork (great for NFTs)</li>\n<li>Full Smart Contract features (stateful and state-less)</li>\n<li>ASA and side-chain support (easily create tokens and CBDCs)</li>\n<li>Transactions can add up to 1kb of arbitrary text data (great for dApps)</li>\n<li>It&#39;s uses a new PPoS algorithm to select and validate blocks (it&#39;s decentralized)</li>\n<li>PPoS means no mining (it&#39;s good for the envoronment, and already carbon neutral)</li>\n<li>Great developer ecosystem (lots of SDKs, documentation, IDE plugins, and an <em>excellent</em> indexer to easily search the blockchain)</li>\n<li>Bourgening market for dApps and NFTs (lots of room to grow)</li>\n<li>Anyone can set up a node and participate (it&#39;s open)</li>\n<li>Excellent mobile wallet that works with WalletConnect (it&#39;s usable and simple)</li>\n<li>Governance voting mechanism means we can upgrade the protocol over time (it&#39;s future proof)</li>\n<li>It has a great team (MIT backed + lots of investment cash) </li>\n</ul>\n\n<p>And finally, let me dispel some myths: </p>\n\n<ul>\n<li><p>&quot;The tokenomics are bad&quot; - Accelerated Vesting has ended, which means the artificial downward price pressure is relaxing. Fixed supply that will dry up in about 2030 (but probably earlier), so prices will rise as more dApps use it and it becomes scarcer. </p></li>\n<li><p>&quot;There&#39;s only so many relay nodes, so it&#39;s centralized&quot; - To run a relay node, it requires a large amount of computing power. So the Algorand foundation limits relay nodes to operators who can afford it. There are ~ 100 relay node operators, so that&#39;s still fairly decentralized. This will grow in time. See this post for more info - <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/pq8bgn/how_are_algorands_relay_nodes_centralized/\">https://www.reddit.com/r/CryptoCurrency/comments/pq8bgn/how_are_algorands_relay_nodes_centralized/</a> </p></li>\n<li><p>&quot;There&#39;s no dApps&quot; - The chain is only 2 years old, and we already have exciting projects like Tinyman, Yieldly, and Lofty.ai. <em>Many</em> more exist or are in development </p></li>\n<li><p>&quot;There&#39;s clawback and freezing features&quot; - Yes, but only for 3rd party ASAs and CBDCs that opt-into it. Clawback and freezing does not exist on the main ALGO chain. Your keys, your tokens. </p></li>\n</ul>\n\n<p>And there&#39;s a ton more features and benefits to this chain that I don&#39;t have room to list here (Silvio!). But overall, Algorand is a bright new blockchain with a ton of growth and potential. Check it out if you&#39;re a developer or looking for a solid medium to long-term play.</p>\n</div><!-- SC_ON -->",
  "score": 166,
  "permalink": "/r/CryptoCurrency/comments/qnl3h6/lets_talk_about_algorand_fundamentals/",
  "subreddit": "CryptoCurrency",
  "id": "qnl3h6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Many of you know about ALGO, but I want to enlighten those who are new to this\ngreat L1 chain. Some quick facts about Algorand:\n\n * 4 second transaction finality (it's fast)\n * Transactions cost is ~ $0.002 (it's cheap)\n * 1000 TPS currently, growing to ~ 20,000 TPS in 2022 (it's scalable)\n * Full…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ALGOをご存知の方は多いと思いますが、この素晴らしいL1チェーンを初めて知った方にも知っていただきたいと思います。\nこの偉大なL1チェーンを初めて知る方にも知っていただきたいと思います。アルゴランドについての簡単な事実を紹介します。\n\n * 4秒でトランザクションが終了する（速い）\n * トランザクションコストは$0.002（安い）。\n * 現在1000TPS、2022年には20,000TPSまで成長（スケーラブル）。\n * フル...",
      "title": "アルゴランドの基礎知識についてお話します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你们中的许多人都知道ALGO，但我想让那些刚接触这个伟大的L1连锁店的人了解一下。\n伟大的L1连锁店。关于Algorand的一些简单事实。\n\n * 4秒的交易终结（它很快速）\n * 交易成本是~0.002美元（它很便宜）\n * 目前有1000个TPS，在2022年将增长到~20000个TPS（它是可扩展的）\n * 完整的...",
      "title": "让我们来谈谈Algorand的基本原理"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你們中的許多人都知道ALGO，但我想讓那些剛接觸這個偉大的L1連鎖店的人瞭解一下。\n偉大的L1連鎖店。關於Algorand的一些簡單事實。\n\n * 4秒的交易終結（它很快速）\n * 交易成本是~0.002美元（它很便宜）\n * 目前有1000個TPS，在2022年將增長到~20000個TPS（它是可擴展的）\n * 完整的...",
      "title": "讓我們來談談Algorand的基本原理"
    }
  ]
}