{
  "author": "RedactedxRedacted",
  "original_created_utc": 1631078616,
  "title": "Anybody else not even flinch today?",
  "created_utc": 1631090575,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Late night thoughts here. I&#39;ve gotten so immune to volatility and dips that I honestly could care less the my portfolio dropped 25% today.</p>\n\n<p>I just rummage around the ole couch cushions for some change to buy more.</p>\n\n<p>Not sure if this desensitization is a good thing or a problem. I guess since I&#39;m in it for the long run it&#39;s a good thing. </p>\n\n<p>Anywho gonna type some more words so I can get around the character limit. Hopefully all you late night owls have a good night and for those waking up elsewhere in the world. Have a great day.</p>\n</div><!-- SC_ON -->",
  "score": 281,
  "permalink": "/r/CryptoCurrency/comments/pk49ng/anybody_else_not_even_flinch_today/",
  "subreddit": "CryptoCurrency",
  "id": "pk49ng",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Late night thoughts here. I've gotten so immune to volatility and dips that I\nhonestly could care less the my portfolio dropped 25% today.\n\nI just rummage around the ole couch cushions for some change to buy more.\n\nNot sure if this desensitization is a good thing or a problem. I guess since I'm\nin…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "深夜の感想です。ボラティリティやディップに免疫ができてしまったので\n今日、自分のポートフォリオが25％下落したとしても、正直、気になりません。\n\nただ、もっと買うための小銭を求めてソファのクッションを物色しています。\n\nこの鈍感さが良いことなのか、問題なのかはわかりません。思うに、私は\n私は...",
      "title": "今日はひるまなかった人はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这里是深夜的想法。我已经对波动和下跌有了很大的免疫力，以至于我\n老实说，我可以不在乎我的投资组合今天下跌25%。\n\n我只是在沙发坐垫上翻找一些零钱来买更多的东西。\n\n不知道这种脱敏现象是好事还是问题。我想既然我在\n在...",
      "title": "今天还有人没有退缩吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這裏是深夜的想法。我已經對波動和下跌有了很大的免疫力，以至於我\n老實說，我可以不在乎我的投資組合今天下跌25%。\n\n我只是在沙發坐墊上翻找一些零錢來買更多的東西。\n\n不知道這種脫敏現象是好事還是問題。我想既然我在\n在...",
      "title": "今天還有人沒有退縮嗎？"
    }
  ]
}