{
  "author": "RowanHarley",
  "the_new_excerpt": "https://www.reuters.com/business/wall-st-week-ahead-blow-out-us-earnings-suggest-market-has-room-run-2021-04-30/\n\nArticle for those who want to scroll through quickly:\n\nU.S. companies are leaping above expectations on first-quarter earnings, giving\ninvestors stronger confirmation that profit growth…",
  "original_created_utc": 1619912185,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "https://www.reuters.com/business/wall-st-week-ahead-blow-out-us-earnings-suggest-market-has-room-run-2021-04-30/\n\n素早くスクロールしたい人のための記事。\n\n米国企業の第1四半期の業績は予想を上回り、投資家の皆様に大きな衝撃を与えています。\n米国企業の第1四半期の業績は予想を大きく上回っており、投資家は利益成長率の低下を強く実感している。",
      "title": "S&P社の約87%の企業がアナリスト予想を上回り、1994年以来、過去最高の予測達成率となる"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "https://www.reuters.com/business/wall-st-week-ahead-blow-out-us-earnings-suggest-market-has-room-run-2021-04-30/\n\n为那些想快速滚动浏览的人准备的文章。\n\n美国公司第一季度的盈利超过预期，给投资者带来了更强的信心。\n投资者更有力地确认，利润增长...",
      "title": "标准普尔指数中约有87%的公司超出了分析师的估计，这将是自1994年以来最高的超出率记录。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "https://www.reuters.com/business/wall-st-week-ahead-blow-out-us-earnings-suggest-market-has-room-run-2021-04-30/\n\n爲那些想快速滾動瀏覽的人準備的文章。\n\n美國公司第一季度的盈利超過預期，給投資者帶來了更強的信心。\n投資者更有力地確認，利潤增長...",
      "title": "標準普爾指數中約有87%的公司超出了分析師的估計，這將是自1994年以來最高的超出率記錄。"
    }
  ],
  "title": "About 87% of Companies in the S&P have beaten analyst estimates, set to be the higgest beat rate on record since 1994",
  "created_utc": 1619971095,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.reuters.com/business/wall-st-week-ahead-blow-out-us-earnings-suggest-market-has-room-run-2021-04-30/\">https://www.reuters.com/business/wall-st-week-ahead-blow-out-us-earnings-suggest-market-has-room-run-2021-04-30/</a></p>\n\n<p>Article for those who want to scroll through quickly:</p>\n\n<p>U.S. companies are leaping above expectations on first-quarter earnings, giving investors stronger confirmation that profit growth will be able to support the market this year.</p>\n\n<p>A big piece of that growth is coming once again from technology and growth companies, which suggests greater durability in companies that underperformed more economically focused value names for months.</p>\n\n<p>Earnings are rebounding from last year&#39;s pandemic-fueled lows. With results in from more than half of the S&amp;P 500 companies, earnings are now expected to have risen 46% in the first quarter from the previous year, compared with forecasts of 24% growth at the start of the month, according to IBES data from Refinitiv.</p>\n\n<p>About 87% of reports have come in ahead of analysts&#39; estimates for earnings per share, putting the quarter on track to have the highest beat rate on record going back to 1994, when Refinitiv began tracking the data.</p>\n\n<p>Some strategists say the stronger-than-expected earnings could drive a richly valued market higher still. The benchmark S&amp;P 500 (.SPX) is trading at about 23 times forward earnings, above the long-average of about 15, based on Refinitiv&#39;s data.</p>\n\n<p>&quot;The earnings results are really not being fully priced in yet, and that&#39;s because you&#39;re seeing estimates for the back half of the year start to pick up now in response to this better-than expected environment. That says to us there&#39;s still more room,&quot; said Eric Freedman, chief investment officer at U.S. Bank Wealth Management.</p>\n\n<p>The high percentage of beats also follows many quarters where companies were holding off on giving guidance on the future, making it harder for analysts to estimate results for this year.</p>\n\n<p>Citing stronger earnings, Jonathan Golub, chief U.S. equity strategist and head of quantitative research at Credit Suisse Securities, on Friday raised his 2021 S&amp;P 500 price target to 4,600 from 4,300. The S&amp;P 500 index (.SPX) was last at about 4,180.</p>\n\n<p>Stocks have had little reaction to results overall so far. The S&amp;P 500 is up more than 11% since Dec. 31. The index is up less than 2% since mid-April when the earnings period kicked in to high gear, but remains near record highs.</p>\n\n<p>Earnings also are raising some fresh questions in the debate over growth versus value. After a decade of steadily under-performing the overall market, value has been a favorite among some investors as a bet on the reopening of the economy.</p>\n\n<p>However, &quot;tech is showing an ability ... to still create as good, if not superior, sales growth to cyclicals. That&#39;s what I find amazing,&quot; said David Bianco, Americas chief investment officer for DWS.</p>\n\n<p>&quot;Tech is as much as of a reopening play as everybody else,&quot; he said.</p>\n\n<p>Investors will be watching reports in the weeks ahead to see if the trend continues. Results are expected next week from a wide range of companies including Activision Blizzard (ATVI.O), Cummins Inc (CMI.N), ConocoPhillips (COP.N) and Pfizer Inc (PFE.N).</p>\n\n<p>The first-quarter results come after a months-long rally in value stocks as investors bet on the reopening of businesses as COVID-19 vaccines became more available.</p>\n\n<p>Value has outperformed growth names that include heavily weighted technology stocks, and for the year so far, the Russell 1000 value index (.RLV) remains up about 15%, while the Russell 1000 growth index (.RLG) is up about 8% in that time.</p>\n\n<p>Technology-related companies as well as banks - value trade favorites - have had the largest percentage point contribution to estimated first-quarter S&amp;P 500 earnings, with JPMorgan Chase &amp; Co (JPM.N) and Apple Inc (AAPL.O) at the top of the list, based on Refinitiv&#39;s data.</p>\n\n<p>Tech (.SPLRCT) is also among the strongest sectors for year-over-year sales growth for the quarter, Bianco noted.</p>\n\n<p>While the risks of higher inflation and possibly higher taxes have given some investors reason to become more cautious on growth shares, earnings may make them think twice about avoiding the group.</p>\n\n<p>&quot;It pays for a lot of investors to be balanced between value and growth,&quot; said Sameer Samana, senior global market strategist at Wells Fargo Investment Institute in St. Louis.</p>\n\n<p>&quot;We&#39;re actually carving out a third group ... defensives,&quot; he said, adding that those are the areas for investors to avoid for now. </p>\n\n<p>Its hard to find a bearish view on the current market situation when so many companies are beating earnings. Maybe in the short term we&#39;ll see some volatility as we finish getting through earnings season, but I don&#39;t think we&#39;ll see much more falling, if any.</p>\n</div><!-- SC_ON -->",
  "score": 55,
  "permalink": "/r/stocks/comments/n2ud90/about_87_of_companies_in_the_sp_have_beaten/",
  "subreddit": "stocks",
  "id": "n2ud90",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380967013
}