{
  "author": "TrifectaOmega",
  "the_new_excerpt": "My wife and I make a decent salary that's higher than the average in our area\nbut we noticed a lot of basic things like groceries, services, and appliances\nhave been jumping higher and higher in price. Don't even get me started on\nhousing - we're pretty much stuck renting for life.\n\nI know people…",
  "original_created_utc": 1621541681,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私たち夫婦は、地域の平均よりも高いそこそこの給料をもらっています。\nしかし、食料品やサービス、家電製品などの基本的なものの多くが、価格がどんどん高くなっていることに気づきました。\nしかし、食料品やサービス、家電製品などの基本的なものの価格がどんどん高くなっていることに気づきました。住まいについては、まだ考えていません。\n私たちは一生賃貸で過ごすことになりそうです。\n\n私は人々を知っている...",
      "title": "物価が恐ろしく高くなっていると感じるのは私だけでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的妻子和我的工资很高，高于我们地区的平均水平。\n但我们注意到很多基本的东西，如杂货、服务和电器\n的价格越来越高了。甚至不要让我开始谈论\n住房--我们几乎是一辈子都在租房。\n\n我知道人们...",
      "title": "是我的问题，还是东西变得很贵/买不起了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的妻子和我的工資很高，高於我們地區的平均水平。\n但我們注意到很多基本的東西，如雜貨、服務和電器\n的價格越來越高了。甚至不要讓我開始談論\n住房--我們幾乎是一輩子都在租房。\n\n我知道人們...",
      "title": "是我的問題，還是東西變得很貴/買不起了？"
    }
  ],
  "title": "Is it just me or are things becoming scarily expensive/unaffordable?",
  "created_utc": 1621555104,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My wife and I make a decent salary that&#39;s higher than the average in our area but we noticed a lot of basic things like groceries, services, and appliances have been jumping higher and higher in price. Don&#39;t even get me started on housing - we&#39;re pretty much stuck renting for life.</p>\n\n<p>I know people are blaming inflation, but our salaries have been relatively the same for the last few years yet some things like have nearly double/tripled/quadrupled in price. Saving up has always been tricky (we rarely eat out, spend on luxury items, etc.), but now it&#39;s starting to seem like any form of retirement won&#39;t be an option for us and we&#39;re really concerned.</p>\n\n<p>Is anyone else feeling the same?</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/TooAfraidToAsk/comments/nhaaxr/is_it_just_me_or_are_things_becoming_scarily/",
  "subreddit": "TooAfraidToAsk",
  "id": "nhaaxr",
  "is_self": true,
  "media": null,
  "is_video": false
}