{
  "author": "Artyloo",
  "the_new_excerpt": "I have never used a TA indicator to make a decision, be it my own broker's or\nMorningstar's or TradingView's.\n\nFor those who don't know what I'm talking about, this\n[https://imgur.com/a/MgUEUpu] is it.\n\nMy own common sense tells me that if these tools were accurate, at lot of people\nwould be a lot…",
  "original_created_utc": 1618277884,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、自分のブローカーのものであろうと、モーニングスターやTradingViewのものであろうと、意思決定のためにTAインジケーターを使ったことはありません。\nMorningstarやTradingViewのものであってもです。\n\n私が何を言っているのかわからない人のために、この\n[https://imgur.com/a/MgUEUpu]がそれです。\n\n私自身の常識では、もしこれらのツールが正確であれば、多くの人が\nだろうと思います。",
      "title": "もし、証券会社のTA「Buy or Sell」指標だけを使ってトレードしたらどうなるでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我从来没有用TA指标来做决定，不管是我自己的经纪商的还是。\n晨星的或TradingView的。\n\n对于那些不知道我在说什么的人，这个\n[https://imgur.com/a/MgUEUpu]是这样的。\n\n我自己的常识告诉我，如果这些工具是准确的，在很多的人\n会是很多...",
      "title": "如果你只用经纪商的TA \"买入或卖出 \"指标进行交易会怎样？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我從來沒有用TA指標來做決定，不管是我自己的經紀商的還是。\n晨星的或TradingView的。\n\n對於那些不知道我在說什麼的人，這個\n[https://imgur.com/a/MgUEUpu]是這樣的。\n\n我自己的常識告訴我，如果這些工具是準確的，在很多的人\n會是很多...",
      "title": "如果你只用經紀商的TA \"買入或賣出 \"指標進行交易會怎樣？"
    }
  ],
  "title": "What would happen if you traded only using brokers' TA \"Buy or Sell\" indicators?",
  "created_utc": 1618304352,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have never used a TA indicator to make a decision, be it my own broker&#39;s or Morningstar&#39;s or TradingView&#39;s.</p>\n\n<p>For those who don&#39;t know what I&#39;m talking about, <a href=\"https://imgur.com/a/MgUEUpu\">this</a> is it.</p>\n\n<p>My own common sense tells me that if these tools were accurate, at lot of people would be a lot richer than they are right now.</p>\n\n<p>What if you set up a paper trade where you bought stock only based on one of these tools? Buy the stock when Tradingview&#39;s needle says buy, diligently sell when it says sell. Do the same for all the other sites.</p>\n\n<p>Something tells me the answer is &quot;you&#39;d lose a ton of money, those indicators are only meant to aide your decision, not rely 100% on them!&quot; and that&#39;s probably right.</p>\n\n<p>At the same time, I already consider them worthless so it&#39;d be fun to do a little experiment.</p>\n\n<p>What are your thoughts?</p>\n</div><!-- SC_ON -->",
  "score": 60,
  "permalink": "/r/stocks/comments/mpsbz1/what_would_happen_if_you_traded_only_using/",
  "subreddit": "stocks",
  "id": "mpsbz1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566618926
}