{
  "author": "HaMEZSmiff",
  "the_new_excerpt": "I think we all know by now all of weed stocks have been soaring since November.\nNow full disclosure I currently own, CRON, TIL, APHA, and a small position in\nACB. I have no clue who the winner will be, but I’m confident there can be\nmultiple winners in the game.\n\nNow totally agree the merger between…",
  "original_created_utc": 1612531691,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我想大家都知道现在所有的杂草股自11月以来一直在飙升。\n现在全面披露，我目前拥有，CRON，TIL，APHA，和一个小的位置，在\nACB。我不知道谁会是赢家，但我相信可以有。\n游戏中的多个赢家。\n\n现在完全同意合并之间...",
      "title": "杂草优势之争。CRON的案例"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想大家都知道現在所有的雜草股自11月以來一直在飆升。\n現在全面披露，我目前擁有，CRON，TIL，APHA，和一個小的位置，在\nACB。我不知道誰會是贏家，但我相信可以有。\n遊戲中的多個贏家。\n\n現在完全同意合併之間...",
      "title": "雜草優勢之爭。CRON的案例"
    }
  ],
  "title": "battle for weed dominance. Case for CRON",
  "created_utc": 1612555278,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I think we all know by now all of weed stocks have been soaring since November. Now full disclosure I currently own, CRON, TIL, APHA, and a small position in ACB. I have no clue who the winner will be, but I’m confident there can be multiple winners in the game. </p>\n\n<p>Now totally agree the merger between APHA and TIL will be huge because that gives tilray access to all of Aphira’s secrets in terms of how they’ve been able to maintain profitability and increases the scale of the combined operation.</p>\n\n<p>However, Altria invested in CRON which has an extensive supply chain in US already for delivering cigarettes around the US. Now it may be an unpopular business but supply and demand is steady for that industry as of now. I think that they will continue to leverage their advantage in distribution and supply chain moving forward, especially as the market grows and hopefully is allowed throughout the entire US not to long from now.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/investing/comments/ld73y0/battle_for_weed_dominance_case_for_cron/",
  "subreddit": "investing",
  "id": "ld73y0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123198812
}