{
  "author": "anonymousaccount183",
  "original_created_utc": 1634912909,
  "title": "Is all of adulthood just living in misery?",
  "created_utc": 1634922135,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m 21 so I guess I&#39;m new to being an adult. But everything ahead seems so bleek. And it looks like most people feel the same way. My coworkers even have a suicide pact running joke and are always going on about how miserable life is. Everyone always seems to be &quot;joking&quot; about jumping off bridges. And I feel exactly the same way as them.</p>\n\n<p>I don&#39;t enjoy existing. It&#39;s lonely, and tiring, and everything is so stressful, and overwhelming, and takes so much money.</p>\n</div><!-- SC_ON -->",
  "score": 173,
  "permalink": "/r/TooAfraidToAsk/comments/qdi3wq/is_all_of_adulthood_just_living_in_misery/",
  "subreddit": "TooAfraidToAsk",
  "id": "qdi3wq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm 21 so I guess I'm new to being an adult. But everything ahead seems so\nbleek. And it looks like most people feel the same way. My coworkers even have a\nsuicide pact running joke and are always going on about how miserable life is.\nEveryone always seems to be \"joking\" about jumping off bridges.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は21歳なので、大人になるのは初めてだと思います。でも、この先のことを考えると\n暗い気持ちになります。そして、ほとんどの人が同じように感じているようです。私の同僚は、自殺協定をネタにしています。\n私の同僚は自殺行為を冗談にして、人生がいかに悲惨かをいつも話しています。\n誰もが橋から飛び降りることをいつも「冗談」にしているようです....",
      "title": "大人になってからの人生は、ただ不幸に生きているだけなのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我今年21岁，所以我想我是第一次成为一个成年人。但未来的一切似乎都很\n黯淡无光。而且看起来大多数人都有同样的感觉。我的同事们甚至有一个\n我的同事甚至有一个自杀协议的笑话，并且总是在说生活是多么的悲惨。\n每个人似乎总是在 \"开玩笑 \"说要跳桥....。",
      "title": "成年后的生活都是在痛苦中度过吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我今年21歲，所以我想我是第一次成爲一個成年人。但未來的一切似乎都很\n黯淡無光。而且看起來大多數人都有同樣的感覺。我的同事們甚至有一個\n我的同事甚至有一個自殺協議的笑話，並且總是在說生活是多麼的悲慘。\n每個人似乎總是在 \"開玩笑 \"說要跳橋....。",
      "title": "成年後的生活都是在痛苦中度過嗎？"
    }
  ]
}