{
  "author": "iiiiiiiiiiiiiliiiii",
  "original_created_utc": 1628346722,
  "title": "Anyone else don't care about news and just DCA and chill?",
  "created_utc": 1628372307,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>When you finally understand the value and technology behind cryptocurrencies you know that in the end it is is here to stay, every dip thanks to FUD by the banks or government is just an opportunity to catch up with the rest.</p>\n\n<p>Got into crypto a year ago where I was constantly watching predictions, news and worrying every-time there was FUD or the price crashed. But after some of those experiences now got to the point to not care about watching the news or predictions anymore, crashes and pumps in crypto are impossible to predict and FUD is just FUD. I only have alerts for when price goes down to DCA and be there with the community.</p>\n\n<p>Anyone else has had the same experience?</p>\n</div><!-- SC_ON -->",
  "score": 202,
  "permalink": "/r/CryptoCurrency/comments/ozubmv/anyone_else_dont_care_about_news_and_just_dca_and/",
  "subreddit": "CryptoCurrency",
  "id": "ozubmv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "When you finally understand the value and technology behind cryptocurrencies you\nknow that in the end it is is here to stay, every dip thanks to FUD by the banks\nor government is just an opportunity to catch up with the rest.\n\nGot into crypto a year ago where I was constantly watching predictions,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号通貨の価値と技術を理解したとき、あなたは最終的に暗号通貨がここに残ることを知るでしょう。\n銀行や政府の不信感による下落は、他のものに追いつくチャンスに過ぎないのです。\n銀行や政府の不安による下落は、他に追いつくためのチャンスに過ぎません。\n\n1年前に暗号通貨に参入した私は、常に予測や...",
      "title": "ニュースは気にせず、DCAでゆっくりしたいという人はいませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当你最终了解加密货币背后的价值和技术时，你就会知道\n你就会知道，最终它将继续存在，每一次下跌都要归功于银行的恐惧症。\n每一次由于银行或政府的恐惧而导致的下跌，都只是一个追赶其余的机会。\n\n一年前，我进入加密货币，在那里我不断观察预测，...",
      "title": "还有人不关心新闻，只关心DCA和寒风吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當你最終了解加密貨幣背後的價值和技術時，你就會知道\n你就會知道，最終它將繼續存在，每一次下跌都要歸功於銀行的恐懼症。\n每一次由於銀行或政府的恐懼而導致的下跌，都只是一個追趕其餘的機會。\n\n一年前，我進入加密貨幣，在那裏我不斷觀察預測，...",
      "title": "還有人不關心新聞，只關心DCA和寒風嗎？"
    }
  ]
}