{
  "author": "lildaemon",
  "original_created_utc": 1642817776,
  "title": "Looking to find people to work on side projects with.",
  "created_utc": 1642845115,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m kind of bored working on side projects by myself. I really enjoy discussing strategy and problem solving together. I&amp;#39;ve worked on side projects with people in the past and it is just way way more fun.&lt;/p&gt;\n\n&lt;p&gt;My background: phd physics, former google engineer. My experience is primarily in full stack engineering and data science. I&amp;#39;ve also done some product management--I&amp;#39;ve conducted over 30 customer/product discovery interviews.&lt;/p&gt;\n\n&lt;p&gt;If you have something you want to work on, or just want to reach out to brainstorm ideas, please feel free to PM me, or reply here.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 5,
  "permalink": "/r/SideProject/comments/s9rl2t/looking_to_find_people_to_work_on_side_projects/",
  "subreddit": "SideProject",
  "id": "s9rl2t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm kind of bored working on side projects by myself. I really enjoy discussing\nstrategy and problem solving together. I've worked on side projects with people\nin the past and it is just way way more fun.\n\nMy background: phd physics, former google engineer. My experience is primarily\nin full stack…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "一人でサイドプロジェクトに取り組むのは、なんだか退屈なんです。議論するのが楽しい\n戦略や問題解決を一緒に考える。人と一緒にサイドプロジェクトに取り組んだことがある\nの方がずっと楽しい。\n\n経歴：物理学博士、元グーグルエンジニア。私の経験は主に\nフルスタックで...",
      "title": "一緒にサイドプロジェクトに取り組む仲間を探している。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一个人做副业有点无聊。我非常喜欢讨论\n战略和解决问题。我曾经和别人一起做副业\n在过去，它只是方式方法更有趣。\n\n我的背景：物理学博士，前谷歌工程师。我的经验主要是\n在全堆栈...",
      "title": "想找人一起做副业。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一個人做副業有點無聊。我非常喜歡討論\n戰略和解決問題。我曾經和別人一起做副業\n在過去，它只是方式方法更有趣。\n\n我的背景：物理學博士，前谷歌工程師。我的經驗主要是\n在全堆棧...",
      "title": "想找人一起做副業。"
    }
  ]
}