{
  "author": "DarkBe4Dawn",
  "original_created_utc": 1624577692,
  "title": "As a man, is it okay to want to be the sub in the relationship?",
  "created_utc": 1624583733,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In all of my previous relationships I&#39;ve had to be the dominant one but deep down I actually really prefer to be the submissive. However I feel extremely uncomfortable opening up about it to any partners because I&#39;m scared of how it will be perceived for a guy to admit he likes being the sub in the couple.\nI guess this comes from the whole social expectation for the guy to be in charge and on top but I&#39;m scared I&#39;m MASSIVELY limiting my potential future partners by pursuing this want.\nI don&#39;t want my need to be a sub to stop me from every finding someone to be with romantically</p>\n\n<p>I just thought I&#39;d throw this question out there to make sure I&#39;m not alone and that there are women out there who see it as okay for their man to be a bit subby</p>\n</div><!-- SC_ON -->",
  "score": 320,
  "permalink": "/r/TooAfraidToAsk/comments/o7bp89/as_a_man_is_it_okay_to_want_to_be_the_sub_in_the/",
  "subreddit": "TooAfraidToAsk",
  "id": "o7bp89",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In all of my previous relationships I've had to be the dominant one but deep\ndown I actually really prefer to be the submissive. However I feel extremely\nuncomfortable opening up about it to any partners because I'm scared of how it\nwill be perceived for a guy to admit he likes being the sub in the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今までの恋愛では、私は支配者でなければなりませんでしたが、心の底では\n本当は従順であることを望んでいるのです。しかし、そのことを相手に打ち明けるのは非常に抵抗があります。\nしかし、このことをパートナーに打ち明けるのは非常に気が引けるのです。\nなぜなら、男性がサブであることが好きだと認めることは、どのように受け取られるかが怖いからです。",
      "title": "男性として、関係性の中でサブの立場になりたいと思うことは問題ないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在我以前所有的关系中，我不得不成为主导者，但在内心深处\n但在内心深处，我其实更愿意做一个顺从的人。然而，我感到非常\n因为我很害怕，如果一个男人承认他喜欢做下属，会被人认为是 \"不务正业\"。\n因为我害怕一个人承认他喜欢做下属，会被人认为是不公平的。",
      "title": "作为一个男人，想成为关系中的次要人物可以吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在我以前所有的關係中，我不得不成爲主導者，但在內心深處\n但在內心深處，我其實更願意做一個順從的人。然而，我感到非常\n因爲我很害怕，如果一個男人承認他喜歡做下屬，會被人認爲是 \"不務正業\"。\n因爲我害怕一個人承認他喜歡做下屬，會被人認爲是不公平的。",
      "title": "作爲一個男人，想成爲關係中的次要人物可以嗎？"
    }
  ]
}