{
  "author": "juanjux",
  "the_new_excerpt": "I started investing in crypto in 2017 (I did some daytrading before that, but\nnever HODL). Didn't invest much, but it was a significant amount for me. I saw\nHUGE gains. Like 33x. When it went crashing down and after some bad decisions\n(Bitgrail...), I lost almost everything. I was stressed and angry…",
  "original_created_utc": 1614685693,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我从2017年开始投资加密技术（之前我也做过一些日间交易，但。\n从来没有HODL）。) 虽然没有投资多少，但对我来说是一笔不小的数目。我看到\n巨大的收益。像33倍。当它去崩溃了，经过一些错误的决定\n(Bitgrail...)，我几乎失去了一切。我的压力和愤怒...",
      "title": "PSA：如果你看到的是巨大的收益，就拿点利润，收回你的初始投资。这将有助于你的心态平和!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我從2017年開始投資加密技術（之前我也做過一些日間交易，但。\n從來沒有HODL）。) 雖然沒有投資多少，但對我來說是一筆不小的數目。我看到\n巨大的收益。像33倍。當它去崩潰了，經過一些錯誤的決定\n(Bitgrail...)，我幾乎失去了一切。我的壓力和憤怒...",
      "title": "PSA：如果你看到的是巨大的收益，就拿點利潤，收回你的初始投資。這將有助於你的心態平和!"
    }
  ],
  "title": "PSA: If you're seeing huge gains, take some profit, recover your initial investment. It will help with your peace of mind!",
  "created_utc": 1614699476,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I started investing in crypto in 2017 (I did some daytrading before that, but never HODL). Didn&#39;t invest much, but it was a significant amount for me. I saw HUGE gains. Like 33x. When it went crashing down and after some bad decisions (Bitgrail...), I lost almost everything. I was stressed and angry but calmed down after some months and started accumulating slowly again using the almighty DCA. </p>\n\n<p>Now, we&#39;re in another bull run and the first thing I did as soon as BTC went over 50k was to recover all the money I had invested since 2017 plus a little more for some toys (new GPU and tablet, car tires, some other little things). I still have 90% of my stack but now I&#39;m much calmer with the price swings because no matter what happens, I won&#39;t lose any invested money and even if it crashes mighty like in 2018 I have most of my crypto, all my invested money AND my new toys from this bull run so I won&#39;t feel like an idiot.</p>\n</div><!-- SC_ON -->",
  "score": 1527,
  "permalink": "/r/CryptoCurrency/comments/lw077x/psa_if_youre_seeing_huge_gains_take_some_profit/",
  "subreddit": "CryptoCurrency",
  "id": "lw077x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937738014
}