{
  "author": "Khwarezm",
  "original_created_utc": 1626909954,
  "title": "Why are the Caucasus so incredibly diverse, especially linguistically?",
  "created_utc": 1626945836,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Apparently in the region of the Caucasus mountains there are at least 50 notable ethnic groups with considerable differences between each other in terms of things like religion, language and customs.</p>\n\n<p>The linguistic diversity seems particularly pronounced with dozens of languages and dialects spoken there represented by all kinds of language groups from Indo-European, to Turkic, to languages completely unrelated to any others outside the region like the Kartvelian and Circassian languages. There&#39;s even the last remaining speakers of languages possibly descended from the ancient Scythian tongue with Ossetian.</p>\n\n<p>I&#39;m curious about what factors contributed to this state of affairs, my uninformed gut tells me it might be related to the rugged mountainous terrain letting communities maintain their independent identities, but its not like the Caucasus are the only mountainous places on Earth and other regions don&#39;t seem to be quite comparable. I&#39;d very much welcome an explanation from somebody better informed than me.</p>\n</div><!-- SC_ON -->",
  "score": 111,
  "permalink": "/r/AskHistorians/comments/op1p6e/why_are_the_caucasus_so_incredibly_diverse/",
  "subreddit": "AskHistorians",
  "id": "op1p6e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Apparently in the region of the Caucasus mountains there are at least 50 notable\nethnic groups with considerable differences between each other in terms of\nthings like religion, language and customs.\n\nThe linguistic diversity seems particularly pronounced with dozens of languages\nand dialects spoken…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "コーカサス山脈の地域には、少なくとも50の主要な民族が存在しているようです。\n宗教、言語、習慣などにかなりの違いがある。\n宗教、言語、習慣などの面でかなりの違いがある。\n\n特に言語の多様性は顕著で、何十もの言語や方言が話されている。\n言語の多様性は特に顕著で、何十もの言語や方言が話されています...。",
      "title": "コーカサス地方は、なぜこれほどまでに多様性に富んでいるのか、特に言語的にはどうなのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "显然，在高加索山脉地区，至少有50个著名的\n族裔群体，彼此之间在宗教、语言和习俗等方面存在着相当大的差异。\n诸如宗教、语言和习俗等方面的差异。\n\n语言的多样性似乎特别明显，有几十种语言\n和方言...",
      "title": "为什么高加索地区会有如此令人难以置信的多样性，尤其是在语言方面？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "顯然，在高加索山脈地區，至少有50個著名的\n族裔羣體，彼此之間在宗教、語言和習俗等方面存在着相當大的差異。\n諸如宗教、語言和習俗等方面的差異。\n\n語言的多樣性似乎特別明顯，有幾十種語言\n和方言...",
      "title": "爲什麼高加索地區會有如此令人難以置信的多樣性，尤其是在語言方面？"
    }
  ]
}