{
  "author": "Greasy_Lung",
  "original_created_utc": 1626301471,
  "title": "Does anybody else think that labels are just getting ridiculous?",
  "created_utc": 1626316931,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m sexually attracted to both women and men, but I don’t feel the need to say I’m bisexual, because it just… means nothing To me? I don’t understand why people need to put labels on everything. </p>\n\n<p>I really started to think about how annoying it was when I was out with a friend, he was explaining the American 2020 election to me (We’re British and he does politics at uni so I didn’t know much about the details) and he said to me something along the lines of “Moderate black Christians voted this way and it really helped ‘x’ candidate secure that state”. All I could think was wtf? Why the hell is that a label? Moderate black Christians? Are they a subset hive-mind of the population? Like why are people banded together like that? </p>\n\n<p>Or when registering for something official and it says “white British” “Black British”, gay straight etc. Like am I being stupid thinking this shit is dumb and just divides people for no reason?</p>\n</div><!-- SC_ON -->",
  "score": 118,
  "permalink": "/r/TooAfraidToAsk/comments/okf8o0/does_anybody_else_think_that_labels_are_just/",
  "subreddit": "TooAfraidToAsk",
  "id": "okf8o0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m sexually attracted to both women and men, but I don’t feel the need to say\nI’m bisexual, because it just… means nothing To me? I don’t understand why\npeople need to put labels on everything.\n\nI really started to think about how annoying it was when I was out with a\nfriend, he was explaining the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は女性にも男性にも魅力を感じますが、それを言う必要はありません。\nバイセクシャルだと言う必要性を感じません。なぜなら、それは私にとって何の意味もないからです。なぜ人は\n人は何にでもラベルを貼る必要があるのか\n\n友達と一緒に出かけたときに、彼が私たちのことを説明していたときに、どれだけ迷惑だったかを本当に考え始めました。\n友達と出かけた時、彼が説明していたのは...",
      "title": "ラベルがバカバカしくなってきたと思う人はいませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我对女人和男人都有性吸引力，但我觉得没有必要说我是双性恋。\n我是双性恋，因为......这对我来说毫无意义？我不明白为什么\n人们需要给一切事物贴上标签。\n\n我真的开始思考，当我和一个朋友出去的时候，他在解释\n他在解释...",
      "title": "还有人认为标签越来越荒唐了吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我對女人和男人都有性吸引力，但我覺得沒有必要說我是雙性戀。\n我是雙性戀，因爲......這對我來說毫無意義？我不明白爲什麼\n人們需要給一切事物貼上標籤。\n\n我真的開始思考，當我和一個朋友出去的時候，他在解釋\n他在解釋...",
      "title": "還有人認爲標籤越來越荒唐了嗎？"
    }
  ]
}