{
  "author": "LandComprehensive742",
  "original_created_utc": 1637605491,
  "title": "My boyfriend (20M) cuddled his friend (girl) and got a boner, I'm (20F) not fine with it. Is this normal?",
  "created_utc": 1637651432,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey, this is my first reddit question. I&#39;m currently in a serious relationship with my boyfriend for almost 4 years. Recently, he went on a vacation with his friends and his friends got super drunk and horny. My boyfriend was tipsy and he was also horny. One of his friend which is a girl, wanted to have sex or something. So my boyfriend decided to cuddle with her telling her this is the closest she can get to sex. During the cuddling, he got a boner from that but he did not cheat on me or something. The next morning, they cuddled again and he got a boner again.</p>\n\n<p>&#x200B;</p>\n\n<p>The next day, he told me about this. To me, cuddling another girl other than your girlfriend is cheating and he knows that. So, I reacted differently and I started crying. I explained how I felt. But he said he had no choice. And he also told me it was his body reacting. Is this normal? for a guy to cuddle with their girl friends other than their girl friend? And is it normal for them to get boner? Or am I just overreacting?</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/NoStupidQuestions/comments/qzs0rb/my_boyfriend_20m_cuddled_his_friend_girl_and_got/",
  "subreddit": "NoStupidQuestions",
  "id": "qzs0rb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hey, this is my first reddit question. I'm currently in a serious relationship\nwith my boyfriend for almost 4 years. Recently, he went on a vacation with his\nfriends and his friends got super drunk and horny. My boyfriend was tipsy and he\nwas also horny. One of his friend which is a girl, wanted to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ねえ、これは私の最初のredditの質問です。私は現在、約4年前から彼氏と真剣に付き合っています。\n彼氏とは約4年の付き合いになります。最近、彼は友人と休暇に行きました。\n友達と一緒に旅行に行ったのですが、友達はすごく酔っ払っていてムラムラしていました。私の彼氏はほろ酔いで、彼氏も\n私の彼氏もほろ酔いでムラムラしていました。彼の友人の一人（女の子）が、彼に...",
      "title": "彼氏(20M)が友達(女の子)を抱きしめて勃起した、私(20F)は平気ではない。これは普通のことですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嘿，这是我第一个reddit问题。我目前正处于一段严肃的关系中\n和我的男朋友在一起快4年了。最近，他和他的朋友们去度假了\n他的朋友们喝得酩酊大醉，欲火焚身。我的男朋友喝醉了，他\n也很饥渴。他的一个朋友是个女孩，她想和我的男朋友一起喝酒。",
      "title": "我的男朋友（20M）搂着他的朋友（女孩），然后勃起了，我（20F）对此不以为然。这正常吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嘿，這是我第一個reddit問題。我目前正處於一段嚴肅的關係中\n和我的男朋友在一起快4年了。最近，他和他的朋友們去度假了\n他的朋友們喝得酩酊大醉，慾火焚身。我的男朋友喝醉了，他\n也很飢渴。他的一個朋友是個女孩，她想和我的男朋友一起喝酒。",
      "title": "我的男朋友（20M）摟着他的朋友（女孩），然後勃起了，我（20F）對此不以爲然。這正常嗎？"
    }
  ]
}