{
  "author": "just_lick_my_ass",
  "the_new_excerpt": "I swear almost every day I see some article about how BB has gotten some award\nor recognition for its software. Then there's the Amazon/IVY contract which will\nsurely bring revenue. Also talk that their software will be used for drones.\nWhat that means, I don't know- sounds like money though! Oh,…",
  "original_created_utc": 1615011202,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我发誓几乎每天我都会看到一些关于BB如何获得一些奖项的文章。\n或对其软件的认可。还有就是亚马逊/IVY的合同，将。\n肯定会带来收益。还说他们的软件将用于无人机。\n这意味着什么，我不知道--虽然听起来像钱! 哦，...",
      "title": "我从来没有见过一只股票的反应如此糟糕的好消息，像BB一样"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我發誓幾乎每天我都會看到一些關於BB如何獲得一些獎項的文章。\n或對其軟件的認可。還有就是亞馬遜/IVY的合同，將。\n肯定會帶來收益。還說他們的軟件將用於無人機。\n這意味着什麼，我不知道--雖然聽起來像錢! 哦，...",
      "title": "我從來沒有見過一隻股票的反應如此糟糕的好消息，像BB一樣"
    }
  ],
  "title": "I've never seen a stock react so poorly to good news like BB does",
  "created_utc": 1615020009,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I swear almost every day I see some article about how BB has gotten some award or recognition for its software. Then there&#39;s the Amazon/IVY contract which will surely bring revenue. Also talk that their software will be used for drones. What that means, I don&#39;t know- sounds like money though! Oh, almost forgot, partnership with Bidu for driving software in China. None of this seems to make the stock move.</p>\n\n<p>I don&#39;t get it. It&#39;s maddening. You have stupid news like SPCE announcing a &quot;flight window&quot; for their overpriced &quot;space flights&quot; and the stock moves like crazy. You have partnerships with legit, in Amazon case, trillion dollar company, and the stock sits right at $10. </p>\n\n<p>What&#39;s it going to take for this thing to start moving? It&#39;s absolutely infuriating.</p>\n</div><!-- SC_ON -->",
  "score": 3117,
  "permalink": "/r/stocks/comments/lyvk37/ive_never_seen_a_stock_react_so_poorly_to_good/",
  "subreddit": "stocks",
  "id": "lyvk37",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542576959
}