{
  "author": "ImReellySmart",
  "the_new_excerpt": "This is excluding new companies specialising in EV such as Tesla as they will\nnaturally grow as they enter the market.\n\nBut for the likes of let's say Volkswagen or Ford...\n\nPeople seem to dive at the chance to invest in these companies when they\nannounce their move into the EV market.\n\nHowever the…",
  "original_created_utc": 1619890546,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは、テスラのようなEVに特化した新しい企業を除いて、市場に参入すると自然に成長するためです。\nこれは、テスラのようなEVに特化した新会社は、市場に参入することで自然に成長するので除外します。\n\nしかし、例えばフォルクスワーゲンやフォードのような会社は......。\n\nこれらの企業がEV市場に参入すると発表すると、人々は投資のチャンスに飛びつくようです。\nEV市場への参入を発表すると、人々は投資に飛びつくようです。\n\nしかし...",
      "title": "近い将来、すべての自動車メーカーがEVに特化することになるでしょう。なぜ人々はこれを、当該企業の価値が高まる兆候と見るのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这不包括专门从事电动车的新公司，如特斯拉，因为它们会在进入市场后自然增长。\n随着他们进入市场而自然增长。\n\n但是对于像大众或福特这样的公司...\n\n当这些公司宣布进入电动车市场时，人们似乎都会抓住机会投资于这些公司。\n宣布进入电动车市场的时候，人们似乎都跃跃欲试。\n\n然而...",
      "title": "很快，所有的汽车制造商都将完全采用电动车。为什么人们把这看作是上述公司将变得更有价值的标志？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這不包括專門從事電動車的新公司，如特斯拉，因爲它們會在進入市場後自然增長。\n隨着他們進入市場而自然增長。\n\n但是對於像大衆或福特這樣的公司...\n\n當這些公司宣佈進入電動車市場時，人們似乎都會抓住機會投資於這些公司。\n宣佈進入電動車市場的時候，人們似乎都躍躍欲試。\n\n然而...",
      "title": "很快，所有的汽車製造商都將完全採用電動車。爲什麼人們把這看作是上述公司將變得更有價值的標誌？"
    }
  ],
  "title": "Soon all car manufacturers are going to be exclusively EV. Why do people see this as a sign that said companies will become more valuable?",
  "created_utc": 1619908387,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is excluding new companies specialising in EV such as Tesla as they will naturally grow as they enter the market.</p>\n\n<p>But for the likes of let&#39;s say Volkswagen or Ford...</p>\n\n<p>People seem to dive at the chance to invest in these companies when they announce their move into the EV market. </p>\n\n<p>However the way I see it, these companies already sell cars and will simply begin to sell cars that are powered differently. Petrol/ diesel powered vehicles will soon be discontinued so it isnt necessarily a case where they will have a larger customer base.</p>\n</div><!-- SC_ON -->",
  "score": 124,
  "permalink": "/r/stocks/comments/n2n4gh/soon_all_car_manufacturers_are_going_to_be/",
  "subreddit": "stocks",
  "id": "n2n4gh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380967011
}