{
  "author": "iphonexmas",
  "original_created_utc": 1629899574,
  "title": "Is anyone here really “in it for the tech”?",
  "created_utc": 1629916361,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For those who don’t know, it’s a recurring joke where everytime there’s a plunge, people say they’re “in it for the tech.” Basically in boom times, everyone’s excited about making insane amounts of money but when the market is dumping, we can justify being in the red by saying that we’re in it for the tech, decentralization, censorship-free transactions, and all.</p>\n\n<p>Are you in it for the tech? Or is it just that we want financial freedom and it seems that Crypto can take us there?</p>\n\n<p>Personally I’m in it for both to be honest. Making money and the idea of building a financial system that’s open and which routes around traditional power centers excites the f out of me!</p>\n</div><!-- SC_ON -->",
  "score": 223,
  "permalink": "/r/CryptoCurrency/comments/pbbo86/is_anyone_here_really_in_it_for_the_tech/",
  "subreddit": "CryptoCurrency",
  "id": "pbbo86",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "For those who don’t know, it’s a recurring joke where everytime there’s a\nplunge, people say they’re “in it for the tech.” Basically in boom times,\neveryone’s excited about making insane amounts of money but when the market is\ndumping, we can justify being in the red by saying that we’re in it for…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "知らない人もいるかもしれませんが、これは何度も繰り返されるジョークで、突っ込みどころがあるたびに\n人々は \"技術のために参加している \"と言います。基本的に好景気の時は\n誰もが大金を手にすることに興奮しますが、市場が暴落しているときは\nしかし、市場が暴落しているときには、赤字であることを正当化するために、「...のために参加している」と言います。",
      "title": "ここには本当に「技術のため」の人がいるのだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对于那些不知道的人来说，这是一个反复出现的笑话，每当有一个暴跌，人们就说他们是 \"为了技术\"。\n暴跌，人们就说他们是 \"为了技术\"。基本上在繁荣时期。\n每个人都在为赚取大量的钱而兴奋，但当市场被抛售时\n但当市场下跌时，我们可以通过说我们是为了......来证明自己处于亏损状态。",
      "title": "这里有人真的是 \"为技术而来 \"吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對於那些不知道的人來說，這是一個反覆出現的笑話，每當有一個暴跌，人們就說他們是 \"爲了技術\"。\n暴跌，人們就說他們是 \"爲了技術\"。基本上在繁榮時期。\n每個人都在爲賺取大量的錢而興奮，但當市場被拋售時\n但當市場下跌時，我們可以通過說我們是爲了......來證明自己處於虧損狀態。",
      "title": "這裏有人真的是 \"爲技術而來 \"嗎？"
    }
  ]
}