{
  "author": "SgtPepperAUS",
  "the_new_excerpt": "Stem Inc - Due Diligence\n\nStem Inc (ticker STPK) was established in 2009 and is a provider of battery\nstorage and AI optimisation software to Utilities and Large Corporates\n(including Amazon, Facebook and UPS) in the US, Canada and Japan.\n\nTotal Addressable Market and Market Position\n\nStem is the…",
  "original_created_utc": 1618916639,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ステム社 - デューデリジェンス\n\nStem Inc（ティッカー：STPK）は2009年に設立され、電力会社や大企業向けにバッテリーストレージや\n蓄電池とAI最適化ソフトウェアを米国、カナダ、日本の公共施設や大企業（Amazon、Facebook、UPSなど）に提供しています。\n米国、カナダ、日本の公共施設や大企業（Amazon、Facebook、UPSなど）に蓄電池やAI最適化ソフトウェアを提供しています。\n\n総対処可能市場とマーケットポジション\n\nステムは、...",
      "title": "Stem Inc ($STPK) DD"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Stem Inc - 尽职调查\n\nStem Inc（股票代码：STPK）成立于2009年，是一家为公用事业和大型企业提供电池存储和人工智能优化软件的供应商。\n是一家为美国、加拿大和日本的公用事业和大型企业（包括亚马逊、Facebook和UPS）提供电池存储和人工智能优化软件的供应商。\n包括亚马逊、Facebook和UPS）。\n\n可解决的总市场和市场地位\n\nStem公司是美国最大的电池生产商。",
      "title": "Stem Inc ($STPK) DD"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Stem Inc - 盡職調查\n\nStem Inc（股票代碼：STPK）成立於2009年，是一家爲公用事業和大型企業提供電池存儲和人工智能優化軟件的供應商。\n是一家爲美國、加拿大和日本的公用事業和大型企業（包括亞馬遜、Facebook和UPS）提供電池存儲和人工智能優化軟件的供應商。\n包括亞馬遜、Facebook和UPS）。\n\n可解決的總市場和市場地位\n\nStem公司是美國最大的電池生產商。",
      "title": "Stem Inc ($STPK) DD"
    }
  ],
  "title": "Stem Inc ($STPK) DD",
  "created_utc": 1618925733,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Stem Inc - Due Diligence</strong></p>\n\n<p>Stem Inc (ticker STPK) was established in 2009 and is a provider of battery storage and AI optimisation software to Utilities and Large Corporates (including Amazon, Facebook and UPS) in the US, Canada and Japan.</p>\n\n<p><strong>Total Addressable Market and Market Position</strong></p>\n\n<p>Stem is the market leader in the fast-growing energy storage market. Wood Mackenzie forecast a Total Addressable Market for energy storage of $1.2 trillion by 2050, and for the battery storage market to increase by 25x by 2030. The size of Stem’s market is rapidly expanding due to:</p>\n\n<ol>\n<li>The declining cost of batteries, driving increased adoption. This is already happening with Electric Vehicle batteries, and the same economies of scale are benefiting Stem. Batteries are now increasingly being installed with solar and wind to reduce their intermittency</li>\n<li>Stem is expecting to see the introduction of a standalone investment tax credit in the US for clean energy storage, allowing storage to be eligible for tax concessions (matching the concessions available to solar &amp; wind). This is expected to open up a variety of new markets in the US.</li>\n<li>The Biden administration has proposed a $100 billion investment to transform the energy grid, putting the US on a path to achieving 100% carbon free electricity. Batteries and smart software are required to manage renewable’s intermittency.</li>\n<li>Broader Clean Energy / ESG mandate from large corporates and governments worldwide. There will be plenty of macro catalysts for Stem in the coming years</li>\n</ol>\n\n<p>Stem is the market leader with 75% market share in the Californian battery storage market (larger than their next 4 competitors combined), with California being the largest market in the US. Stem has a first mover advantage, as they’re already operating with over 40 utilities, 5 grid operators, for a cumulative total of more than 20 million run-time hours. This is the equivalent to Stem already operating 12 gas peaker plants (1 GWH).</p>\n\n<p>Stem sources batteries from Tier 1 manufacturers, including LG, Tesla and Samsung. They are one of the largest purchasers of utility grade batteries in the US, and are agnostic on who’s batteries they install – their software can attach to nearly any battery. In terms of their supplier’s bargaining power, they see Tesla as operating in a different market to them. Tesla is seen as doing much larger projects, such as the Australian ‘Big Battery’. They also see Tesla as primarily a manufacturer, who’s trying to scale their output (similar to how Foxconn is a manufacturer to Apple). They’re also not dependent upon Tesla batteries, as they can switch to other suppliers. Interestingly, they believe they introduced Tesla to the Japanese market!</p>\n\n<p><strong>Stem’s Competitive Advantage – Athena AI</strong></p>\n\n<p>Essentially Stem’s business model is supplying and installing a Battery and AI Software bundle. Stem’s AI software, called Athena, is their competitive advantage over other battery providers.</p>\n\n<p>Athena is a propriety, patented, AI optimisation software which Stem bundle with battery installation. Athena analyses large data sets (over 700,000 data points per second) in real time to optimise electricity flows. It takes into account energy prices, grid dynamics, weather, and customer usage patterns to lower their electricity costs by up to 30%.</p>\n\n<p>It does this, by example, by taking advantage of electricity price fluctuations. Very simply, Athena will instruct batteries to charge when prices are low (say during the day when solar panels are generating lots of surplus power) and discharge into the grid when prices are high (say during the evening when solar is off). This electricity market participation creates value for their customers and for Stem. There are 13 ways in which Athena creates value for customers, with this just being a simple example of a price arbitrage scenario.</p>\n\n<p>I believe Athena has a strong competitive ‘moat’ due to:</p>\n\n<ol>\n<li>Athena is attached to 100% of Stem’s battery sales, and at no point has a customer ever asked for the software to be removed. Stem has 75% market share of the Californian battery storage market, illustrating the strong demand for Athena</li>\n<li>Athena generates 80% Gross Margins, which demonstrates both the lack of substitute software solutions and the value that customers place on Athena</li>\n<li>Athena gets better with more use. There are more than 950 systems operating or contracted with Athena, which have collectively generated more than 20 million runtime hours of data, generating a wealth of data to train and improve Athena. This data itself is a source of competitive advantage, with battery suppliers reportedly seeking to purchase this data from Stem. Competitors simply don’t have this data, don’t have a market leading position to generate this data, and don’t have the luxury of time to make up the shortfall.</li>\n</ol>\n\n<p><strong>Strengthened Balance sheet</strong></p>\n\n<p>The main tangible benefit of the merger with Star Peak Energy Transition Corp (ticker STPK) is the cash – Stem has a war chest of $525m to pursue growth. Stem is going to use these funds to grow in 4 tangible ways</p>\n\n<ol>\n<li>Reduction in Working Capital. Prior to its strengthened balance sheet, Stem had to pay 100% for batteries up-front, and wouldn’t get paid by the customer until the project was complete. This meant Stem had to fund the holding cost of the battery purchase for several months, which curtailed their growth. With its stronger balance sheet, Stem expects to negotiate better deals with its supplier’s, driving a $100m improvement in working capital over the next 24 months</li>\n<li>Bid on larger projects. Multiple times in the past, large utility owners have curtailed Stem’s level of participation on projects due to a lack of balance sheet strength. This cut Stem’s project participation to just 30%, 40% or 50%. However, going forward with the stronger balance sheet, they expect to land larger opportunities</li>\n<li>Further investment in Athena, to extend its market leading position</li>\n<li>International expansion</li>\n</ol>\n\n<p><strong>Valuation</strong></p>\n\n<p>Stem has provided guidance to 2026, with a Revenue CAGR of 80% from 2020 to 2026. 2021 revenue is expected to be 4.5x 2020 revenue. 2021’s revenue is already secured by signed customer contracts – Stem is actively is executing on these. Further confidence in revenue forecasts comes from a contracted backlog of $200m (as of 17 January 2021).</p>\n\n<p>Revenue quality is underpinned by Stem’s contracting model - Athena is provided on a 10 to 20 year subscription term in conjunction with the battery sale. This provides significant and predictable long term cash flows beyond just an upfront battery sale.</p>\n\n<p>A Discount Cash Flow analysis of their Free Cash Flow forecast, plus their $525m cash, equates to <strong>$47.80/share</strong> (8% discount rate, 2.5% perpetual growth rate), representing substantial upside from the current stock price. Upside to this target is possible from market expansion and government policy changes, including:</p>\n\n<ol>\n<li>Movement into residential properties. This is an untapped market, with Stem actively considering how best to enter this market. Entry into the residential market is not included in their FCF</li>\n<li>Upside from the proposed energy storage investment tax credit. Stem’s FCF forecast was released in December 2020, before Biden took office</li>\n<li>Upside from Biden’s proposed $100 billion investment to transform the energy grid. Similarly, Stem’s FCF forecast was released in December 2020, before Biden took office</li>\n</ol>\n\n<p><strong>Sources</strong></p>\n\n<p>Click on “Register Now”. <a href=\"http://ipo-edge.com/2021/04/08/ipo-edge-to-host-fireside-chat-with-star-peak-chairman-and-stem-ceo-on-april-12-to-discuss-merger/?fbclid=IwAR3S5YGYT0mL_j8lRvv7Ch8zriZezEcVXQwTQhTXTAlfLNzjm1B_4_s4fQ0\">http://ipo-edge.com/2021/04/08/ipo-edge-to-host-fireside-chat-with-star-peak-chairman-and-stem-ceo-on-april-12-to-discuss-merger/?fbclid=IwAR3S5YGYT0mL_j8lRvv7Ch8zriZezEcVXQwTQhTXTAlfLNzjm1B_4_s4fQ0</a></p>\n\n<p><a href=\"https://3zkqyz2t3xwi492ll518psvq-wpengine.netdna-ssl.com/wp-content/uploads/2020/12/Stem-Star-Peak-Investor-Presentation_Dec2020.pdf\">https://3zkqyz2t3xwi492ll518psvq-wpengine.netdna-ssl.com/wp-content/uploads/2020/12/Stem-Star-Peak-Investor-Presentation_Dec2020.pdf</a></p>\n\n<p>&#x200B;</p>\n\n<p>Disclaimer: I am not a financial advisor, do your own Due Diligence</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/stocks/comments/munvr5/stem_inc_stpk_dd/",
  "subreddit": "stocks",
  "id": "munvr5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171527438
}