{
  "author": "A-Candle-In-The-Dark",
  "the_new_excerpt": "Why do occultism and exotericism of the 19th and 20th centuries have such strong\nties to fascism, racism and traditionalism?\n\nI'm thinking for example about Blavatsky's view on race, Guenon's doctrine of\nPerennialism, Evola's self described \"superfascism\". Is there something inherent\nin exoterical…",
  "original_created_utc": 1623849382,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "19世紀から20世紀にかけてのオカルティズムやエキゾテリシズムは、なぜファシズムや人種差別、伝統主義と強い結びつきがあるのか。\nファシズム、人種差別、伝統主義との強い結びつきがあるのはなぜでしょうか？\n\n例えば、ブラヴァツキーの人種観、ゲノンの多年主義の教義、エヴォラの自称「エヴォラ」などが挙げられます。\nエヴォラの自称「スーパーファシズム」などです。何か本質的なものがあるのでしょうか？\nあるのでしょうか？",
      "title": "なぜオカルトはファシズムと強い結びつきがあるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "为什么19世纪和20世纪的神秘主义和外在主义与法西斯主义和传统主义有如此紧密的联系？\n与法西斯主义、种族主义和传统主义有如此紧密的联系？\n\n我在想，例如布拉瓦茨基的种族观、盖农的 \"常年主义 \"学说、埃沃拉自称的 \"法西斯主义 \"学说等。\nPerennialism，Evola自称的 \"超级法西斯主义\"。是否有一些内在的\n外在的东西...",
      "title": "为什么神秘主义总是与法西斯主义有如此紧密的联系？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "爲什麼19世紀和20世紀的神祕主義和外在主義與法西斯主義和傳統主義有如此緊密的聯繫？\n與法西斯主義、種族主義和傳統主義有如此緊密的聯繫？\n\n我在想，例如布拉瓦茨基的種族觀、蓋農的 \"常年主義 \"學說、埃沃拉自稱的 \"法西斯主義 \"學說等。\nPerennialism，Evola自稱的 \"超級法西斯主義\"。是否有一些內在的\n外在的東西...",
      "title": "爲什麼神祕主義總是與法西斯主義有如此緊密的聯繫？"
    }
  ],
  "title": "Why has occultism always had such strong connections to fascism?",
  "created_utc": 1623902276,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Why do occultism and exotericism of the 19th and 20th centuries have such strong ties to fascism, racism and traditionalism?</p>\n\n<p>I&#39;m thinking for example about Blavatsky&#39;s view on race, Guenon&#39;s doctrine of Perennialism, Evola&#39;s self described &quot;superfascism&quot;. Is there something inherent in exoterical doctrines which leads to fascism, or am I just making spurious connections judging from a few cherry picked examples?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/o14mpx/why_has_occultism_always_had_such_strong/",
  "subreddit": "AskHistorians",
  "id": "o14mpx",
  "is_self": true,
  "media": null,
  "is_video": false
}