{
  "author": "boostedCLowNs",
  "the_new_excerpt": "First of all, sorry for my German potato English. I am relatively new to this\nretarded sub, started lurking in it around December 2020 I think, because that\nwas when I started \"investing\".\n\nThat's also why I don't want to talk about the trading/financial aspects of this\nwhole meme stock situation,…",
  "original_created_utc": 1614604744,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "首先，对不起，我的德国土豆英语。我是比较新的\n弱智子，大约在2020年12月开始潜伏其中吧，因为那是\n是我开始 \"投资 \"的时候。\n\n这也是为什么我不想谈论交易/财务方面的原因。\n整个备忘录股票的情况下，...",
      "title": "为更多关于GME的基于事实的、冷静的、深思熟虑的行为而发牢骚"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，對不起，我的德國土豆英語。我是比較新的\n弱智子，大約在2020年12月開始潛伏其中吧，因爲那是\n是我開始 \"投資 \"的時候。\n\n這也是爲什麼我不想談論交易/財務方面的原因。\n整個備忘錄股票的情況下，...",
      "title": "爲更多關於GME的基於事實的、冷靜的、深思熟慮的行爲而發牢騷"
    }
  ],
  "title": "Rant for more fact based, calm and thoughtful behavior regarding GME",
  "created_utc": 1614635055,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>First of all, sorry for my German potato English. I am relatively new to this retarded sub, started lurking in it around December 2020 I think, because that was when I started &quot;investing&quot;. </p>\n\n<p>That&#39;s also why I don&#39;t want to talk about the trading/financial aspects of this whole meme stock situation, but want to take a look at the general behavior and use of language the past two months.</p>\n\n<p>After deeply following the discussions about the effects of fake news, filter bubbles, the radicalization of individuals through social media and the laws and regulations regarding these topics in the past years (including research on these topics for an essay I wrote as a law student, which I still am), there are certain key words or phrases that have been established in the discussions and DDs regarding GME etc. that either make me really angry, frustrated or irritated. In the past couple of weeks, I had these thoughts swirling around, and wanted to share them:</p>\n\n<p>- I know confirmation bias is strong in all of us, me included, but that doesn&#39;t mean we shouldn&#39;t allow and discredit different opinions. A civilized discussion, where every argument/fact backed standpoint is heared and respected, is what brings the best results and answers, regardless the topic. </p>\n\n<p>- &quot;CNBC FAKE NEWS&quot;, &quot;THE MEDIA IS BOUGHT BY HFs&quot; etc. I totally see where these claims are coming from (the strange amount of articles regarding SLV etc.), but endlessly repeating these phrases has not a single positive effect. In my opinion, these phrases aren&#39;t apolitical at all, and hence shouldn&#39;t even be allowed in this sub. I&#39;ll explain why: Not only in the US, but also in Germany, these phrases, portraying established media outlets as &quot;fake&quot;, &quot;controlled by XY&quot;, &quot;biased towards left/right&quot;, are predominantly used by populist groups and people with tendencies towards the conspiracy scene. Based on this, I can&#39;t read these phrases in a non political way, especially with all the discussions of the past years in mind. That&#39;s why I find it irritating to read these phrases over and over again not only in the daily discussion and GME threads, but also in popular posts on the hot page of wsb. </p>\n\n<p>- In addition to the previous point, I&#39;d like to introduce you to the concept of ambiguity (in-)tolerance.  </p>\n\n<p>&quot;Intolerance of ambiguity may be defined as ‘the tendency to perceive (i.e. interpret) ambiguous situations as sources of threat’; tolerance of ambiguity as ‘the tendency to perceive ambiguous situations as desirable&quot; <a href=\"https://en.wikipedia.org/wiki/Ambiguity_tolerance%E2%80%93intolerance\">Wikipedia</a></p>\n\n<p>A phenomenon of social media &quot;discussions&quot; nowadays is the find, that many people are lacking the ability to accept different opinions and to accept the fact, that an event or a fact, (e.g. GME stock price, short %) may have more than one possible reason or explanation, especially if you prefer on of the reasons over the others. </p>\n\n<p>Regarding our situation, this often leads to people down voting, hating on and even threatening users who try to show different possible perspectives on the events surrounding the GME craze instead of having an open discussion and being thankful for a broader look on the situation. </p>\n\n<p>- &quot;short ladder attacks&quot; This term, which was used more and more often during the first weeks of February after GME hit its high, resurfaced in the past couple of days in many threads and posts, even though we had many very solid DDs on why this term and concept is wrong and shouldn&#39;t be used. I don&#39;t know why, but I can&#39;t read any post with that term in it without a strange feeling in my guts, regardless of the overall quality of the post. </p>\n\n<p>Some additional points:</p>\n\n<p>- Since GME settled at around 40$, we had a new trending post setting a fixed event or date as the &quot;MOON TIME&quot; almost every day. and correct me if I&#39;m wrong, but as far as I remember not a single one of these theories became true. Most of the time it even felt like it had the opposite effect of letting the stock price drop once reaching the predicted date. That&#39;s why I stopped trusting these kinds of posts and hyping myself up for then being let down once again. The next &quot;big date&quot; is the 19th of March, with many people hoping for that to be the rocket launch. And as much as I too wish for it to be true, I really don&#39;t think we should continue to name fixed dates for a liftoff. </p>\n\n<p>Regarding that you always have to remember, that everything written here can be and most probably is read by not only us little idiot sandwiches, but by every single HF social media guy, every journalist and every other person who feels the need to waste some time on here. </p>\n\n<p>My conclusion is, that every hype that arises, also attracts people who bet on the bursting of it.</p>\n\n<p>- That leads to another point I want to make: not every chart action that happens is an evil strategy of a Bond villain like HF Manager. As I understand, it is a long known and &quot;popular&quot; strategy to invert the trending stock actions (buys/sells) of WSB users for profit. So keep in mind that every post with for example a solid theory for the next liftoff of GME or a DD for a stock that reaches the hot page, attracts many users who try to bet against it, which is completely normal. After all we are a bunch of individuals. In the end of the day everyone has his own profit in mind, and not a collective greater good. And that&#39;s not a bad thing, but the inner core of this sub, which made it what it is today. </p>\n\n<p>So all in all, think about what you read, try to understand different perspectives, engage in meaningful discussions, ask questions, and don&#39;t spend too much time on here. The squezoozle happens when it does, or maybe it won&#39;t, who knows, let the time show it.</p>\n\n<p>&#x200B;</p>\n\n<p>Be nice to each other, have a wonderful day and fuck you.</p>\n\n<p>&#x200B;</p>\n\n<p>Position: GME 3 @ 200</p>\n</div><!-- SC_ON -->",
  "score": 2553,
  "permalink": "/r/wallstreetbets/comments/lv90li/rant_for_more_fact_based_calm_and_thoughtful/",
  "subreddit": "wallstreetbets",
  "id": "lv90li",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937755480
}