{
  "author": "indian_kulcha",
  "original_created_utc": 1642578778,
  "title": "[META] General request to the mods, is there anyway we as users can recommend expansions in the sub Booklist for certain regions?",
  "created_utc": 1642606842,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The sub&amp;#39;s booklist has been of tremendous help to me (and I assume many other users as well) who are curious to learn about histories from regions quite often not our own. While this is the case, I also felt that the selection of books for the region of South Asia/the Indian Subcontinent can be considerably expanded considering the sheer amount of historical material available regarding the region and the absence of more sub-regional histories in the list, considering that many of these sub-regions such as Bengal, Punjab, the Indo-Gangetic plain, Tamil country and so on are comparable to, or are significantly larger then, many similar European countries or regions. While it could be argued that more specialised sub-regional histories can be covered through questions and answers in the sub, the sad reality is that a lot of questions regarding South Asia/ the Subcontinent remained unanswered for long with the posts eventually getting locked, leaving a noticeable gap on content regarding a very large part of world history. I speak of this region because I am most familiar with it, it is likely that similar expansions for other regions in the world can be done as well. Plus its anyway been a while since the list has been updated. Again, I must emphasise that this is not a critique as such of the current booklist as even in its current form it has been a tremendous source of knowledge for me regarding regions I knew previously very little about, this is just a suggested means of expansion.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/s7kyhq/meta_general_request_to_the_mods_is_there_anyway/",
  "subreddit": "AskHistorians",
  "id": "s7kyhq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The sub's booklist has been of tremendous help to me (and I assume many other\nusers as well) who are curious to learn about histories from regions quite often\nnot our own. While this is the case, I also felt that the selection of books for\nthe region of South Asia/the Indian Subcontinent can be…"
}