{
  "author": "Electro_Spot",
  "original_created_utc": 1636463797,
  "title": "Sold for a happy ending",
  "created_utc": 1636476010,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My wife and I had an idea to &quot;make a quick $10,000&quot; with bitcoin, easy, right? Well, we purchased $30k worth of bitcoin (at around 45k each) hoping to sell it all for $40k total(gain of $10k). We hit our goal during the rise last week but we were both busy working at the time and couldn&#39;t talk about our exit strategy. Last time we were talking about bitcoin over dinner, and I said &quot;You know, btc is close to 68&quot; and the look on her face lit up and she said &quot;So we made it???&quot; I showed her my account and it was now at $45,300. I hit sell all. Gain of +$15,300 8n a few months. Not bas for a newly wed 28 year old couple. Now we have an extra $45k in the bank on top of our regular savings. I plan on reinvestong the gains of 15k back into btc and using the 30k to help pay off our mortgage. We hugged and said &quot;We made it! $45 thousand dollars!&quot; and my 9 year old daughter sitting there says &quot;How did you guys just win $45,000?&quot; &quot;well honey, you know that thing called bitcoin I&#39;ve been talking about for a couple years now?&quot;</p>\n</div><!-- SC_ON -->",
  "score": 294,
  "permalink": "/r/Bitcoin/comments/qq3gjx/sold_for_a_happy_ending/",
  "subreddit": "Bitcoin",
  "id": "qq3gjx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My wife and I had an idea to \"make a quick $10,000\" with bitcoin, easy, right?\nWell, we purchased $30k worth of bitcoin (at around 45k each) hoping to sell it\nall for $40k total(gain of $10k). We hit our goal during the rise last week but\nwe were both busy working at the time and couldn't talk about…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私と妻は、ビットコインで「手っ取り早く1万ドルを稼ぐ」というアイデアを持っていましたが、簡単でしょう？\n30,000ドル分のビットコイン（1枚約45,000円）を購入し、全部で40,000ドル（10,000ドルの利益）で売ろうと考えました。\n全部で4万ドル（1万ドルの利益）で売ろうと思っていました。先週の上昇時に目標額を達成しましたが\nその時は二人とも仕事が忙しくて話ができなかったんだけど...。",
      "title": "ハッピーエンドのために販売"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的妻子和我有一个想法，用比特币 \"快速赚取一万美元\"，很简单，对吗？\n好吧，我们购买了价值3万美元的比特币（每个大约4.5万），希望能以4万美元的价格全部卖出。\n总共4万美元（收益为1万美元）。我们在上周的上涨中达到了我们的目标，但是\n我们当时都在忙于工作，无法谈及...",
      "title": "卖出的是一个快乐的结局"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的妻子和我有一個想法，用比特幣 \"快速賺取一萬美元\"，很簡單，對嗎？\n好吧，我們購買了價值3萬美元的比特幣（每個大約4.5萬），希望能以4萬美元的價格全部賣出。\n總共4萬美元（收益爲1萬美元）。我們在上週的上漲中達到了我們的目標，但是\n我們當時都在忙於工作，無法談及...",
      "title": "賣出的是一個快樂的結局"
    }
  ]
}