{
  "author": "JayBears",
  "original_created_utc": 1648049730,
  "title": "Historically, is there any logic behind a European sovereign being of one noble title over another? (i.e. king, duke, prince, etc.)",
  "created_utc": 1648077918,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Using Italy as an example, historically you will find that the peninsula was broken into duchies, little kingdoms, principalities, and I believe there were even a few marquistes.  Now, I don&amp;#39;t know Italian history that well, and if some of them swore allegiance to France, I can understand why they wouldn&amp;#39;t be a king, or a prince; but what would be stopping a completely sovereign prince from claiming to be a king? Why wouldn&amp;#39;t they want the prestigious title, and just name themselves king?  &lt;/p&gt;\n\n&lt;p&gt;Additionally, when the peninsula eventually unifies, why didn&amp;#39;t the king name themself emperor, like the Germans had?&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Thank you in advance!&lt;/p&gt;\n\n&lt;p&gt;Edit: It&amp;#39;s Germans, not Fermans.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/tkwn3i/historically_is_there_any_logic_behind_a_european/",
  "subreddit": "AskHistorians",
  "id": "tkwn3i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Using Italy as an example, historically you will find that the peninsula was\nbroken into duchies, little kingdoms, principalities, and I believe there were\neven a few marquistes. Now, I don't know Italian history that well, and if some\nof them swore allegiance to France, I can understand why they…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "イタリアを例にとると、歴史的には、半島は\n公国、小王国、公国、に分かれており、私は、このような国があったと考えています。\nマルキーズも。さて、私はイタリアの歴史をそれほどよく知らないのですが、もし何人かが\nフランスに忠誠を誓った人たちがいたのは理解できるけど......。",
      "title": "歴史的に見ても、ヨーロッパの君主がある貴族の爵位を持っていて、別の爵位を持っているという論理はあるのでしょうか？(王、公爵、王子など）。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "以意大利为例，在历史上你会发现，该半岛是\n被分割成公国、小王国、公国，我相信还有\n甚至有一些侯爵。现在，我对意大利的历史不是很了解，如果他们中的一些人宣誓效忠于\n如果他们中的一些人宣誓效忠法国，我可以理解他们为什么......",
      "title": "从历史上看，一个欧洲主权国家的一个贵族头衔比另一个贵族头衔的背后有什么逻辑吗？(即国王、公爵、王子等)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "以意大利爲例，在歷史上你會發現，該半島是\n被分割成公國、小王國、公國，我相信還有\n甚至有一些侯爵。現在，我對意大利的歷史不是很瞭解，如果他們中的一些人宣誓效忠於\n如果他們中的一些人宣誓效忠法國，我可以理解他們爲什麼......",
      "title": "從歷史上看，一個歐洲主權國家的一個貴族頭銜比另一個貴族頭銜的背後有什麼邏輯嗎？(即國王、公爵、王子等)"
    }
  ]
}