{
  "author": "psychotrader00",
  "the_new_excerpt": "PsychoMarket Recap - Monday, April 5, 2021\n\nStocks jumped on Monday, continuing their strong performance from last Friday,\nwith the S&P 500 (SPY) and Dow Jones (DIA) recording fresh highs. The tech-heavy\nNasdaq (QQQ) outperformed, closing the day 2% up. Market participants remain\nencouraged by…",
  "original_created_utc": 1617654022,
  "localize": [
    {
      "locale": "ja-JA",
      "the_new_excerpt": "PsychoMarket Recap - 2021年4月5日（月\n\n4月5日（月）の株式市場は、先週金曜日からの好調なパフォーマンスを維持しながら上昇した。\nS&P500(SPY)とDow Jones(DIA)は新高値を記録しました。テック系銘柄である\nナスダック(QQQ)はアウトパフォームされ、2%上昇して終了しました。市場参加者は引き続き\n市場の参加者は...",
      "title": "本日2021年4月5日（月）のマーケット・リカップをご紹介します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "心理市场回顾--2021年4月5日，星期一。\n\n周一股市跳水，延续上周五的强势表现。\n标普500指数(SPY)和道琼斯指数(DIA)录得新高。科技股重挫\n纳斯达克(QQQ)表现出色，收盘时上涨2%。市场人士仍\n鼓舞",
      "title": "以下是2021年4月5日（星期一）今天的市场回顾。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "心理市場回顧--2021年4月5日，星期一。\n\n週一股市跳水，延續上週五的強勢表現。\n標普500指數(SPY)和道瓊斯指數(DIA)錄得新高。科技股重挫\n納斯達克(QQQ)表現出色，收盤時上漲2%。市場人士仍\n鼓舞",
      "title": "以下是2021年4月5日（星期一）今天的市場回顧。"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "PsychoMarket Recap - 2021年4月5日（月\n\n4月5日（月）の株式市場は、先週金曜日からの好調なパフォーマンスを維持しながら上昇した。\nS&P500(SPY)とDow Jones(DIA)は新高値を記録しました。テック系銘柄である\nナスダック(QQQ)はアウトパフォームされ、2%上昇して終了しました。市場参加者は引き続き\n市場の参加者は...",
      "title": "本日2021年4月5日（月）のマーケット・リカップをご紹介します。"
    }
  ],
  "title": "Here is a Market Recap for today Monday, April 5, 2021",
  "created_utc": 1617696373,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>PsychoMarket Recap - Monday, April 5, 2021</strong></p>\n\n<p>Stocks jumped on Monday, continuing their strong performance from last Friday, with the S&amp;P 500 (SPY) and Dow Jones (DIA) recording fresh highs. The tech-heavy Nasdaq (QQQ) outperformed, closing the day 2% up. Market participants remain encouraged by President Biden’s recent infrastructure proposal, a better-than-expect monthly job report, and are looking ahead to a week of commentary from Federal Open Market Committee (FOMC) members. </p>\n\n<p>The March Jobs Report blew past consensus estimates to record the fastest pace of job growth since last summer. Nonfarm payrolls increased by 916,000 for the month while the unemployment rate fell to 6% (unemployment rate was 14.6% in April 2020). Economists surveyed by Dow Jones had been looking for an increase of 675,000 and an unemployment rate of 6%. Quincy Krosby, chief market strategist at Prudential Financial said, “It [the jobs report] shows that the economy is healing, that those who lost their jobs are coming back into the workforce as the recovery continues and restrictions are lifted.”</p>\n\n<p>President Biden’s plan, called the American Jobs Plan, proposes to spend $2.25 trillion over 8 years to rehabilitate and build out the nation’s transportation infrastructure, expand domestic manufacturing and workforce development, modernize the electrical grid, and fund the research, development, and implementation of clean energy technologies. See a full list of items from the bill <a href=\"https://finance.yahoo.com/news/biden-infrastructure-plan-details-113700242.html\">here</a>. </p>\n\n<p>Looking ahead, this week will be chock full of commentary from Federal Open Market Committee (FOMC) members, who will offer their assessment of the latest batch of economic data and how they will proceed. . Chicago Fed President Charles Evans, Richmond Fed President Thomas Barkin and St. Louis Fed President Jim Bullard are each slated to deliver public remarks later this week, and Fed Chair Jerome Powell will speak at an International Monetary Fund (IMF) panel regarding the global economy Thursday afternoon. In a note to client, Wells Fargo economist Sam Bullard said, “ &quot;While the consensus of the FOMC continues to suggest that the committee will wait for their forecasts to be realized before taking policy action, it will be interesting to see if there is any intense discussion about the implications of the stronger outlook, particularly around inflation. Most Fed officials expect any pick-up in inflation to be “transitory,” yet we suspect there are a few officials that are pushing back on that narrative.&quot; </p>\n\n<p><strong>Highlights</strong></p>\n\n<ul>\n<li>Shares of Gamestop (GME) sank after the company announced it may sell up to $1 billion worth of additional shares. </li>\n<li>Shares of Tesla gapped up more than 4% after the company reported better than expected March delivery numbers. Other EV companies also posted better-than-expected deliveries but didn’t rise nearly as much.</li>\n<li>Treasury Secretary Janet Yellen said during public remarks Monday that the U.S. Treasury Department was working with other major nations to agree on a global minimum corporate tax rate, which would disincentivize companies from seeking to locate to places with lower tax rates.&quot;We’re working with G20 nations to agree to a global minimum corporate tax rate that can stop the race to the bottom,&quot; Yellen said during virtual remarks with the Chicago Council on Global Affairs.</li>\n<li>South Korea&#39;s LG Electronics Inc said on Monday it will end production and sales of its loss-making smartphone division.</li>\n<li><strong>**Please note that current stock price was written premarket and does not reflect intraday changes*\\</strong>*</li>\n<li>Applied Materials (AMAT) with two target raises. Stock currently around $142</li>\n<li>American Express (AXP) target raised by Wells Fargo from $150 to $165 at Overweight. Stock currently around $145</li>\n<li>Brooks Automation (BRKS) target raised by B. Riley from $105 to $125 at Buy. Stock currently around $90</li>\n<li>Ichor (ICHR) target raised by B. Riley from $63 to $75 at Buy. Stock currently around $59</li>\n<li>- CarMax (KMX) target raised by Stephens from $130 to $154 at Overweight. Stock currently around $123fel Nicolaus from $140 to $160 at Buy</li>\n<li>- B. Riley fLam Research (LRCX) target raised by B. Riley from $670 to $800 at Buy. Stock currently around $640rom $150 to $195 at Buy</li>\n<li>Dave &amp; Busters (PLAY) with two target raises. Stock currently around $45\n\n<ul>\n<li>Deutsche Bank from $41 to $57 at Buy</li>\n<li>Loop Capital from $35 to $50 at Hold</li>\n</ul></li>\n<li>Constellation Brands (STZ) target raised by Jefferies Financial Group from $276 to $300 at Buy. Stock currently around $230 </li>\n</ul>\n\n<p>“Perseverance is not a long race; it is many short races one after the other.” - Walter Elliot</p>\n</div><!-- SC_ON -->",
  "score": 117,
  "permalink": "/r/stocks/comments/mktwex/here_is_a_market_recap_for_today_monday_april_5/",
  "subreddit": "stocks",
  "id": "mktwex",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961878997
}