{
  "author": "Many_Scratch2269",
  "original_created_utc": 1637327894,
  "title": "In September, Crypto dipped nearly -23% in 2 weeks before reaching another new ATH. Crypto is currently -16% in 11 days. We are following the exact same trend.",
  "created_utc": 1637364633,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The dip we are going through currently is absolutely nothing compared to what we&#39;ve seen before. We are about -16% down in about 11 days. If you look at the previous patterns, this time is absolutely no different! We are clearly in a rising wedge pattern without any worrying signals.</p>\n\n<p>There should be absolutely no reason to panic unless we form a lower low on the chart. You should treat this dip as just another routine buy opportunity. It&#39;s pretty clear if you zoom out and look at what happened from late July till late September. We are literally in the same pattern. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/mlzbpkikyj081.png?width=823&amp;format=png&amp;auto=webp&amp;s=1f86fbf9b38a36947d0baae2854b2cc2c6c7c0d0\">https://preview.redd.it/mlzbpkikyj081.png?width=823&amp;format=png&amp;auto=webp&amp;s=1f86fbf9b38a36947d0baae2854b2cc2c6c7c0d0</a></p>\n\n<p>The market is still incredibly strong and there is absolutely no reason to panic while in the middle of a rising wedge pattern. </p>\n\n<p>Look at last year, the market went wild in December after a small pullback in November. Buy while you can, because if the patterns are correct, we are in for huge gains in December.</p>\n</div><!-- SC_ON -->",
  "score": 158,
  "permalink": "/r/CryptoCurrency/comments/qxg166/in_september_crypto_dipped_nearly_23_in_2_weeks/",
  "subreddit": "CryptoCurrency",
  "id": "qxg166",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The dip we are going through currently is absolutely nothing compared to what\nwe've seen before. We are about -16% down in about 11 days. If you look at the\nprevious patterns, this time is absolutely no different! We are clearly in a\nrising wedge pattern without any worrying signals.\n\nThere should…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今、私たちが経験しているディップは、これまでに経験したこととは全く違うものです。\nこれまでに経験したことに比べれば、全く問題ありません。約11日間で約-16％の下落です。を見ると\n今までのパターンを見ても、今回も全く変わりません。今回のパターンも全く同じです！明らかに上昇ウェッジパターンで\n明らかに上昇ウェッジパターンで、心配なシグナルはありません。\n\nこれでは...",
      "title": "9月、Cryptoは2週間で約-23%下落し、新たなATHに到達した。現在、Cryptoは11日間で-16%となっています。全く同じ傾向を辿っています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们目前正在经历的下跌与我们以前看到的相比，绝对是小巫见大巫。\n我们之前看到的。我们在大约11天内下跌了大约-16%。如果你看一下\n以前的模式，这次绝对没有什么不同 我们显然处于一个\n上升的楔形图案，没有任何令人担忧的信号。\n\n应该有...",
      "title": "9月，Crypto在2周内下跌近-23%，然后达到另一个新的ATH。目前，Crypto在11天内下跌了16%。我们正在遵循完全相同的趋势。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們目前正在經歷的下跌與我們以前看到的相比，絕對是小巫見大巫。\n我們之前看到的。我們在大約11天內下跌了大約-16%。如果你看一下\n以前的模式，這次絕對沒有什麼不同 我們顯然處於一個\n上升的楔形圖案，沒有任何令人擔憂的信號。\n\n應該有...",
      "title": "9月，Crypto在2周內下跌近-23%，然後達到另一個新的ATH。目前，Crypto在11天內下跌了16%。我們正在遵循完全相同的趨勢。"
    }
  ]
}