{
  "author": "RacingThoughts200",
  "original_created_utc": 1643077205,
  "title": "Many non-technical founders have a misconception about building software",
  "created_utc": 1643085371,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have talked to several non-technical founders who would like to start a Software or SaaS (Software as a Service) business. However, most of them think that building software costs nothing and expect someone to do it for free or at a very little cost that can&amp;#39;t be justified. You don&amp;#39;t ask a commercial building developer to build a building for your business for free. Just like that you shouldn&amp;#39;t expect a software developer to build your software business for free. If you are not willing to invest yourself in your business, no-one else will invest in it, since it shows that you are not sure enough to put your own money in. I help some startups at an early stage with low cost development in anticipation of getting longer term work contracts once the startup succeeds, but I won&amp;#39;t be able to do it completely free as many expect.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 6,
  "permalink": "/r/SideProject/comments/sc2ilg/many_nontechnical_founders_have_a_misconception/",
  "subreddit": "SideProject",
  "id": "sc2ilg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I have talked to several non-technical founders who would like to start a\nSoftware or SaaS (Software as a Service) business. However, most of them think\nthat building software costs nothing and expect someone to do it for free or at\na very little cost that can't be justified. You don't ask a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はこれまで、技術者ではない創業者で、起業を考えている人たち数名と話をしてきました。\nソフトウェアやSaaS（Software as a Service）ビジネス。しかし、彼らの多くは、以下のように考えています。\nソフトウエアの構築には何も費用がかからないので、誰かが無料か、あるいは無料でやってくれることを期待する\n正当化できないようなわずかなコストで。あなたは",
      "title": "技術者でない創業者の多くは、ソフトウェアの構築について誤解しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我曾与几个非技术性的创始人交谈过，他们想创办一个\n软件或SaaS（软件即服务）业务。然而，他们中的大多数人认为\n构建软件不需要任何成本，并希望有人能免费或以极低的价格来做这件事。\n他们希望有人能免费或以无法证明的极低的成本来做。你不会要求一个...",
      "title": "许多不懂技术的创始人对构建软件有一个误解"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我曾與幾個非技術性的創始人交談過，他們想創辦一個\n軟件或SaaS（軟件即服務）業務。然而，他們中的大多數人認爲\n構建軟件不需要任何成本，並希望有人能免費或以極低的價格來做這件事。\n他們希望有人能免費或以無法證明的極低的成本來做。你不會要求一個...",
      "title": "許多不懂技術的創始人對構建軟件有一個誤解"
    }
  ]
}