{
  "author": "gorays21",
  "the_new_excerpt": "Shareholders finally approve NVIDIA stock split. The stock split will be payable\nin the form of a stock dividend. Each shareholder of record as of June 21 will\nreceive an additional three shares of stock for every share held. The shares\nwill be distributed after the market close on July 19, and the…",
  "original_created_utc": 1623242542,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "NVIDIAの株式分割をついに株主が承認。株式分割の効力発生は\n株式分割は、株式配当として行われます。6月21日現在の株主名簿に登録されている方は\n6月21日時点で登録されている株主は、保有する株式1株につき、さらに3株の株式を受け取ることになります。株式は\n7月19日の市場終了後に分配され、...",
      "title": "NVIDIAの株式分割を株主が承認"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "股东最终批准英伟达股票拆分。此次股票分割将以股票股利的形式支付\n以股票股息的形式支付。截至6月21日，每位在册的股东将\n每持有一股股票将额外获得三股股票。这些股票\n将在7月19日市场收盘后分配，而...",
      "title": "股东批准英伟达股票分割"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "股東最終批准英偉達股票拆分。此次股票分割將以股票股利的形式支付\n以股票股息的形式支付。截至6月21日，每位在冊的股東將\n每持有一股股票將額外獲得三股股票。這些股票\n將在7月19日市場收盤後分配，而...",
      "title": "股東批准英偉達股票分割"
    }
  ],
  "title": "Shareholders Approve NVIDIA Stock Split",
  "created_utc": 1623254264,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Shareholders finally approve NVIDIA stock split. The stock split will be payable in the form of a stock dividend. Each shareholder of record as of June 21 will receive an additional three shares of stock for every share held. The shares will be distributed after the market close on July 19, and the newly split shares will begin trading when the market opens on Tuesday, July 20. </p>\n\n<p>Existing shareholders won&#39;t have to do anything to receive the additional shares, which will be deposited directly into their brokerage accounts once the stock split takes effect. It&#39;s important to note that investors shouldn&#39;t necessarily expect the new shares to appear in their account immediately after the market close on July 19. As internal processes differ from brokerage to brokerage, it may take as many as several days for the new shares to show up in investor accounts.</p>\n\n<p>Finally, investors should remember that a stock split does nothing to change the value of the underlying business, but merely divides it into a great number of ownership portions. As an example, NVIDIA shares have lately been trading for roughly $700. This means instead of having one share worth $700, shareholders would own four shares, each worth $175.</p>\n</div><!-- SC_ON -->",
  "score": 321,
  "permalink": "/r/stocks/comments/nvv03w/shareholders_approve_nvidia_stock_split/",
  "subreddit": "stocks",
  "id": "nvv03w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404888034
}