{
  "author": "Wargizmo",
  "original_created_utc": 1653438316,
  "title": "Layer 2 explained",
  "created_utc": 1653485465,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Imagine the Ethereum blockchain is a highway, each transaction is a driver on that highway. The highway is incredibly congested and has an extremely hefty toll, which goes up the more congested it gets. However people are willing to pay to use it because, in a dystopian world full of bad agents, it&amp;#39;s the safest highway around; in fact if anyone attempts a carjacking or is about to cause an accident, their vehicle will instantly be vapourised by thousands of laser turrets (nodes) which keep watch over the highway. &lt;/p&gt;\n\n&lt;p&gt;Layer 2 protocols that use rollups, like Arbitum and Optimism, are bus services that run on the highway, they bundle up passengers (transactions) into a single vehicle (contract) and split the cost of the toll amongst everyone riding on the bus. The bus inherits the security of the highway but at a fraction of the cost to each passenger. &lt;/p&gt;\n\n&lt;p&gt;Layer 2 protocols that use side chains, like Polygon, are a rail network that services the same route as the highway, people can use the train to get to the same destination, but they don&amp;#39;t inherit the same security as the highway. There are stations that enable passengers to go between the rail network and the highway but when passengers are travelling they aren&amp;#39;t protected by the highway security. &lt;/p&gt;\n\n&lt;p&gt;Thank you for coming to my TED talk.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 306,
  "permalink": "/r/CryptoCurrency/comments/ux527h/layer_2_explained/",
  "subreddit": "CryptoCurrency",
  "id": "ux527h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Imagine the Ethereum blockchain is a highway, each transaction is a driver on\nthat highway. The highway is incredibly congested and has an extremely hefty\ntoll, which goes up the more congested it gets. However people are willing to\npay to use it because, in a dystopian world full of bad agents,…"
}