{
  "author": "Firewolfninja",
  "original_created_utc": 1628589277,
  "title": "Where does the gay accent come from?",
  "created_utc": 1628635957,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Not trying to offend anyone I&#39;m genuinely curios, like do gay people choose to talk like that or is it just natural. I have noticed that they only talk like that when they come out but the guys in the closet don&#39;t talk like that so if its natrual do they suppress it?</p>\n\n<p>(please don&#39;t say that there is not gay accent, we all know that most (not all) gay people speak in a similar sort of effeminate way)</p>\n</div><!-- SC_ON -->",
  "score": 133,
  "permalink": "/r/TooAfraidToAsk/comments/p1m2uh/where_does_the_gay_accent_come_from/",
  "subreddit": "TooAfraidToAsk",
  "id": "p1m2uh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Not trying to offend anyone I'm genuinely curios, like do gay people choose to\ntalk like that or is it just natural. I have noticed that they only talk like\nthat when they come out but the guys in the closet don't talk like that so if\nits natrual do they suppress it?\n\n(please don't say that there is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "誰かを怒らせるつもりはありませんが、純粋に興味があって、例えば、ゲイの人たちはそういう風に話すことを選んでいるのか、それとも自然なことなのか。\n選んでいるのか、それとも自然にそうなっているのか。カミングアウトした時だけそういう話し方をするようですが\nカミングアウトした時にだけそういう話をするようですが、クローゼットの中にいる人たちはそういう話をしません。\n自然なことだとしたら、彼らはそれを抑制するのでしょうか？\n\n(もしそれが自然なことであれば、彼らはそれを抑制するのでしょうか？",
      "title": "ゲイの訛りはどこから来るのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不是想冒犯任何人，我是真的很好奇，比如说同性恋者是选择这样说话还是自然而然就这样说话？\n这样说话，还是说这是自然的。我注意到，他们只有在出柜时才会这样说话\n我注意到他们只有在出柜的时候才会这样说话，但在柜子里的人却不会这样说话，所以如果\n它是自然的，他们会抑制它吗？\n\n(请不要说，有...",
      "title": "同志的口音是怎么来的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不是想冒犯任何人，我是真的很好奇，比如說同性戀者是選擇這樣說話還是自然而然就這樣說話？\n這樣說話，還是說這是自然的。我注意到，他們只有在出櫃時纔會這樣說話\n我注意到他們只有在出櫃的時候纔會這樣說話，但在櫃子裏的人卻不會這樣說話，所以如果\n它是自然的，他們會抑制它嗎？\n\n(請不要說，有...",
      "title": "同志的口音是怎麼來的？"
    }
  ]
}