{
  "author": "TheFlightCoach",
  "original_created_utc": 1639127408,
  "title": "Might have found my old pc with 12 BTC on it",
  "created_utc": 1639139905,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Around 10-11 years ago, when BTC was still a novelty, i mined it with my pc (those where the days) for a few weeks. Used to have around 12 of em if i recall correctly. Total value at that time was under ten dollar. I lost interest and did not go to the effort to cash out. Don&amp;#39;t recall where the PC went, thought it long lost. When the crypto hype really started kicking of around two years ago, i used to joke to friends how i unwittingly threw away a lot of money.&lt;/p&gt;\n\n&lt;p&gt;Until last week... when we found a few pc&amp;#39;s from that era on my grandma&amp;#39;s attic. It is very likely that my pc from back then is one of em. I need to get some legacy hardware (IDE adapters and such) to check the harddrives, so i am not sure yet and wondering if it is worth the effort. Of course... if this BTC is still on that pc or otherwiser recoverable via clues ON that pc... it would be more than worth it to go to great lenghts to recover it.&lt;/p&gt;\n\n&lt;p&gt;Problem is, i do not know where to start. I have no idea what software i used for mining, if i used a wallet online or one on the pc... or maybe left it with the pool. Anyone willing to give me some tips on where to start? Most likely i left em in the pool... does that mean it is lost after these years?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 227,
  "permalink": "/r/Bitcoin/comments/rd4pc4/might_have_found_my_old_pc_with_12_btc_on_it/",
  "subreddit": "Bitcoin",
  "id": "rd4pc4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Around 10-11 years ago, when BTC was still a novelty, i mined it with my pc\n(those where the days) for a few weeks. Used to have around 12 of em if i recall\ncorrectly. Total value at that time was under ten dollar. I lost interest and\ndid not go to the effort to cash out. Don't recall where the PC…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "10-11年前、BTCがまだ目新しかった頃、PCで採掘したことがある。\n(当時はそうでした）数週間。確か12個くらい持っていたような気がします。\nを正しく表示します。その時の総額は10ドル以下でした。私は興味を失い\nわざわざ現金化する必要はない。PCがどこにあったかは覚えていない...。",
      "title": "12BTCが入った古いPCを見つけたかもしれない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大约10-11年前，当BTC还是一个新事物的时候，我用我的电脑开采它\n(那些日子里）开采了几个星期。如果我没有记错的话，我曾经有12个左右的比特币。\n正确。当时的总价值还不到10美元。我失去了兴趣，并且\n没有去努力兑现。我不记得在哪里买的PC...",
      "title": "可能已经找到了我的旧电脑，上面有12个BTC。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大約10-11年前，當BTC還是一個新事物的時候，我用我的電腦開採它\n(那些日子裏）開採了幾個星期。如果我沒有記錯的話，我曾經有12個左右的比特幣。\n正確。當時的總價值還不到10美元。我失去了興趣，並且\n沒有去努力兌現。我不記得在哪裏買的PC...",
      "title": "可能已經找到了我的舊電腦，上面有12個BTC。"
    }
  ]
}