{
  "author": "Troct",
  "original_created_utc": 1631303912,
  "title": "Was trying to send myself .05 ETH and it was going to cost me .03 ETH, why do I even have it if I can't use it?",
  "created_utc": 1631316647,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It has been so frustrating lately, and I understand that it is a good thing over all to see this much traffic, but this is ridiculous. Imagine if you had to pay an additional 50% on every transaction at the store? The whole thing has completely put me off of Ethereum at least for now. I know I&#39;m going to get a lot of crap for this, but today I completely converted my ETH to other coins, all except what I have staking on Coinbase. Maybe I&#39;ll come back when I hear this problem has been fixed, but until then, I&#39;m moving on to other projects. I do know I can&#39;t be the only one who feels the same way though.</p>\n</div><!-- SC_ON -->",
  "score": 339,
  "permalink": "/r/CryptoCurrency/comments/plsg08/was_trying_to_send_myself_05_eth_and_it_was_going/",
  "subreddit": "CryptoCurrency",
  "id": "plsg08",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It has been so frustrating lately, and I understand that it is a good thing over\nall to see this much traffic, but this is ridiculous. Imagine if you had to pay\nan additional 50% on every transaction at the store? The whole thing has\ncompletely put me off of Ethereum at least for now. I know I'm…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近イライラしていたので、それを理解した上でのオーバー\nこれだけのトラフィックがあるのは良いことだとは思いますが、これは馬鹿げています。もし、あなたが\n50％の追加料金を支払わなければならないとしたら？このようなことがあると\n少なくとも今のところ、イーサリアムからは完全に離れています。私は...",
      "title": "自分に0.05ETHを送ろうとして、0.03ETHのコストがかかった。使えないのになぜ持っているのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近它是如此令人沮丧，我明白看到这么多流量是件好事。\n我明白看到这么多的流量是件好事，但这太荒谬了。想象一下，如果你不得不支付\n想象一下，如果你不得不在商店的每笔交易中支付额外的50%？这件事让我\n至少现在让我对以太坊完全失去了兴趣。我知道我是...",
      "title": "正想给自己发0.05个ETH，结果要花0.03个ETH，如果不能用，我为什么还要拥有它呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近它是如此令人沮喪，我明白看到這麼多流量是件好事。\n我明白看到這麼多的流量是件好事，但這太荒謬了。想象一下，如果你不得不支付\n想象一下，如果你不得不在商店的每筆交易中支付額外的50%？這件事讓我\n至少現在讓我對以太坊完全失去了興趣。我知道我是...",
      "title": "正想給自己發0.05個ETH，結果要花0.03個ETH，如果不能用，我爲什麼還要擁有它呢？"
    }
  ]
}