{
  "author": "technoandtichu",
  "the_new_excerpt": "Not day trading. Not short selling. Not pump and dumping.\n\nJust buying and holding.\n\nPlease hear me out. Even if you still decide to day trade or go nuts with XRP or\nwhatever, please still do what's written below in addition.\n\nYou're in the right place.\n\nCrypto is still in early days,…",
  "original_created_utc": 1617997286,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "デイトレードではありません。空売りでもない。パンプ＆ダンピングでもない。\n\nただ、買って持ち続けるだけです。\n\n最後まで聞いてください。デイトレードをするにしても、XRPに夢中になるにしても\n下に書かれていることも合わせてやってください。\n\nあなたは正しい場所にいます。\n\nCryptoはまだ初期の段階で、...",
      "title": "あなたがどれだけ暗号に慣れていなくても、あなたはユニークな立場にいます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "不是日间交易。不是卖空。不是抽水和抛水。\n\n只是买入并持有。\n\n请听我说完。即使你还是决定进行日间交易，或者疯狂地买入XRP或\n无论什么，请还是按照下面写的另外。\n\n你来对了。\n\n加密技术还处于早期，...",
      "title": "无论你是多么的新手，你都处于一个独特的位置！无论你是如何接触加密技术的，你都是独一无二的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不是日間交易。不是賣空。不是抽水和拋水。\n\n只是買入並持有。\n\n請聽我說完。即使你還是決定進行日間交易，或者瘋狂地買入XRP或\n無論什麼，請還是按照下面寫的另外。\n\n你來對了。\n\n加密技術還處於早期，...",
      "title": "無論你是多麼的新手，你都處於一個獨特的位置！無論你是如何接觸加密技術的，你都是獨一無二的。"
    }
  ],
  "title": "No matter how new you are to crypto, you are in a unique position!",
  "created_utc": 1618021083,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Not day trading. Not short selling. Not pump and dumping.</p>\n\n<p>Just buying and holding.</p>\n\n<p>Please hear me out. Even if you still decide to day trade or go nuts with XRP or whatever, please still do what&#39;s written below in addition.</p>\n\n<p>You&#39;re in the right place.</p>\n\n<p>Crypto is still in early days, relatively.</p>\n\n<p>Get in now. Buy a bit each week or month and just hold on to it. I recommend BTC as your backbone (50% or more of your portfolio).</p>\n\n<p>Use it as a emergency account. Don&#39;t touch it unless you need it for dire purposes.</p>\n\n<p>Get a hardware wallet. I like Ledger Nano S. Get your crypto off the exchange and onto your hardware wallet.</p>\n\n<p>Put the hardware wallet away and make sure to keep your account recovery phrase (a set of 24 words in a certain order that is the keys to your account) safe and never digital. Only analog.</p>\n\n<p>You will make a bunch of money.</p>\n\n<p>If you&#39;re overwhelmed by this, read The Bitcoin Standard by Saifedean Ammous or a Crypto Basics article from a reputable source.</p>\n\n<p>Time in the market beats timing the market.</p>\n\n<p>Don&#39;t get overly greedy. The universe will swat you back to reality. I promise.</p>\n</div><!-- SC_ON -->",
  "score": 274,
  "permalink": "/r/CryptoCurrency/comments/mnozjj/no_matter_how_new_you_are_to_crypto_you_are_in_a/",
  "subreddit": "CryptoCurrency",
  "id": "mnozjj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566614240
}