{
  "author": "Thom_Bryant",
  "original_created_utc": 1657200940,
  "title": "Why have politics in the United States become more polarized?",
  "created_utc": 1657211100,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m hoping to vote for my first presidential election in 2024 but as I&amp;#39;m looking into the candidates I&amp;#39;ve noticed there aren&amp;#39;t very many independent or middle of the road politicians and it seems like the few good ones have very little chance because nobody wants to waste their vote on anyone but a Republican or a Democrat.&lt;/p&gt;\n\n&lt;p&gt;Just frustrated and am willing to give up a few points just to have politicians that can compromise but it seems like no one else in the U.S. wants to.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/vtivr7/why_have_politics_in_the_united_states_become/",
  "subreddit": "TooAfraidToAsk",
  "id": "vtivr7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm hoping to vote for my first presidential election in 2024 but as I'm looking\ninto the candidates I've noticed there aren't very many independent or middle of\nthe road politicians and it seems like the few good ones have very little chance\nbecause nobody wants to waste their vote on anyone but a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2024年の大統領選挙に初めて投票したいと思っていますが、見ているうちに\n候補者を調べているうちに、無党派層や中道層があまりいないことに気がつきました。\nっているような気がします。\n誰も自分の票を無駄にしたくないので...",
      "title": "なぜ、米国の政治は二極化しているのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我希望能在2024年的第一次总统选举中投票，但当我在研究候选人时，我注意到没有多少独立候选人。\n我注意到没有多少独立的或中间的政治家。\n候选人，而且似乎少数优秀的政治家机会不大\n因为没有人愿意把他们的选票浪费在任何一个人身上，而不是一个......",
      "title": "为什么美国的政治变得更加两极化？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我希望能在2024年的第一次總統選舉中投票，但當我在研究候選人時，我注意到沒有多少獨立候選人。\n我注意到沒有多少獨立的或中間的政治家。\n候選人，而且似乎少數優秀的政治家機會不大\n因爲沒有人願意把他們的選票浪費在任何一個人身上，而不是一個......",
      "title": "爲什麼美國的政治變得更加兩極化？"
    }
  ]
}