{
  "author": "sponge_hitler",
  "original_created_utc": 1652359592,
  "title": "The reason why UST failed is much simpler than you think. It doesn't take any fancy attacks",
  "created_utc": 1652381921,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi,   &lt;/p&gt;\n\n&lt;p&gt;so yeah we all know that UST has drastically de-pegged.&lt;/p&gt;\n\n&lt;p&gt;most people here believe that Citadel and Gemini or whoever did a coordinated attack to lower its value because they had loans in it (basically shorting it). Not like anyone cares to provide any sort of evidence for that because &amp;quot;trust me bro&amp;quot; is more than sufficient for that.&lt;/p&gt;\n\n&lt;p&gt;other people say that LUNA and its stablecoins were always a ponzi scheme or a rugpull or whichever other words the average redditor wrongly uses as a synonym for any sort of scam, fraud, flaw or loss of value to appear smarter than the Safemoon crowd.&lt;/p&gt;\n\n&lt;p&gt;in reality LUNA and UST are just massive failures due to a pretty significant flaw in the way UST was supposed to keep its peg. thing is its not backed by real USD and its also not overcollateralized, like DAI for example.&lt;/p&gt;\n\n&lt;p&gt;the way algorithmic stablecoins keep their value (or don&amp;#39;t apparently) is that you can always burn them for $1 worth of LUNA. Not for any fixed amount of LUNA, but for whatever amount of LUNA currently has a value of $1.&lt;/p&gt;\n\n&lt;p&gt;this does have the advantage that you don&amp;#39;t rely on a centralized company or on people that take risky DeFi loans to mint the stablecoin. But this completely collapses if too many people cash out at once.&lt;/p&gt;\n\n&lt;p&gt;See you only get 1 US dollar thru that algorithmic approach if you burn 1 UST for LUNA and then sell your LUNA. This is a problem because if LUNA is being sold it is losing value and if masses of people sell it at once it could lose its value faster than you can sell your $1 worth of LUNA for $1. And in that case UST is practically no longer backed by enough value.&lt;/p&gt;\n\n&lt;p&gt;Maybe there was an attack, maybe not. That a stablecoin loses its value at any exchange for a short period of time isn&amp;#39;t a problem. That happens all the time, even if only rarely to more than one percent. But that the algorithm that gave UST its value is completely unable to let the UST holders cash out without eating each other alive always made it a ticking time bomb. There is no need for any sort of attack for UST to collapse, this was bound to happen at some point.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 306,
  "permalink": "/r/CryptoCurrency/comments/uo09a4/the_reason_why_ust_failed_is_much_simpler_than/",
  "subreddit": "CryptoCurrency",
  "id": "uo09a4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hi,\n\nso yeah we all know that UST has drastically de-pegged.\n\nmost people here believe that Citadel and Gemini or whoever did a coordinated\nattack to lower its value because they had loans in it (basically shorting it).\nNot like anyone cares to provide any sort of evidence for that because \"trust…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは。\n\nUSTが大幅にデペッグしたことは周知の事実です。\n\nほとんどの人は、シタデルとジェミニか誰かが、彼らがローンを抱えていたため、その価値を下げるために組織的な攻撃をしたと考えています。\nほとんどの人は、シタデルとジェミニが協調してUSTの価値を下げるために攻撃したと思っています。\nその証拠に、誰も \"信頼 \"のために、何らかの証拠を提供することを気にしないようだ...",
      "title": "USTが失敗した理由は、あなたが思っているよりずっと単純なことなのです。派手な攻撃は必要ないのです"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嗨。\n\n所以，我们都知道，UST已经大幅减弱了。\n\n这里的大多数人认为，Citadel和Gemini或其他什么人做了一个协调的\n攻击来降低其价值，因为他们有贷款在里面（基本上是做空）。\n没有人愿意为此提供任何形式的证据，因为 \"相信...",
      "title": "UST失败的原因比你想象的要简单得多。它不需要任何花哨的攻击"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嗨。\n\n所以，我們都知道，UST已經大幅減弱了。\n\n這裏的大多數人認爲，Citadel和Gemini或其他什麼人做了一個協調的\n攻擊來降低其價值，因爲他們有貸款在裏面（基本上是做空）。\n沒有人願意爲此提供任何形式的證據，因爲 \"相信...",
      "title": "UST失敗的原因比你想象的要簡單得多。它不需要任何花哨的攻擊"
    }
  ]
}