{
  "author": "Healthy-Cash8610",
  "the_new_excerpt": "Back in October, Callaway Golf Co announced a merger with Topgolf that was\nvalued at $2 billion. For anyone who is familiar with golf or Topgolf's venues,\nI believe this merger makes ELY's stock very undervalued and I wanted to do some\nDD and analysis to come up with a reasonable price…",
  "original_created_utc": 1610910002,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "早在10月份，卡拉威高尔夫公司就宣布了与Topgolf的合并，这就是\n估值为20亿美元。对于熟悉高尔夫或Topgolf的场地的人来说。\n我相信这次合并使得ELY的股票被非常低估，我想做一些。\n丈量和分析，得出一个合理的价格... ...",
      "title": "卡拉威高尔夫(股票代码ELY)分析和收购TopGolf后的目标价。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "早在10月份，卡拉威高爾夫公司就宣佈了與Topgolf的合併，這就是\n估值爲20億美元。對於熟悉高爾夫或Topgolf的場地的人來說。\n我相信這次合併使得ELY的股票被非常低估，我想做一些。\n丈量和分析，得出一個合理的價格... ...",
      "title": "卡拉威高爾夫(股票代碼ELY)分析和收購TopGolf後的目標價。"
    }
  ],
  "title": "Callaway Golf (Ticker ELY) Analysis and Price Target after TopGolf Acquisition",
  "created_utc": 1610976138,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Back in October, Callaway Golf Co announced a merger with Topgolf that was valued at $2 billion. For anyone who is familiar with golf or Topgolf&#39;s venues, I believe this merger makes ELY&#39;s stock very undervalued and I wanted to do some DD and analysis to come up with a reasonable price target. </p>\n\n<p>Callaway is currently projected to do $1.55B in revenue in 2020 with an expected growth rate of 10.5% for future years while Topgolf will do revenues of about $1.1B while experiencing a 30% growth rate since 2017. This 30% growth can continue for many years to come as the company is still rapidly growing and expanding its venues. Also, over half of Topgolf&#39;s customers consider themselves non-golfers so this gives Callaway a huge market to bring in new customers to their golf apparel and equipment revenue streams. Source: <a href=\"https://www.dallasnews.com/business/local-companies/2020/10/27/topgolf-is-merging-with-callaway-in-a-deal-valued-at-2-billion/\">https://www.dallasnews.com/business/local-companies/2020/10/27/topgolf-is-merging-with-callaway-in-a-deal-valued-at-2-billion/</a></p>\n\n<p>For my analysis, I projected Callaway and Topgolf&#39;s revenues out to 2025 with the above mentioned projected growth rates, and came to a combined revenue estimate of $6.63B in 2025. I then discounted this revenue back to current year at 15% to get a number of about $3.3B. With ELY currently trading at a P/S ratio of 1.51, this would imply a target market cap of about $4.98B with the discounted revenues and the current P/S ratio. The current market cap of ELY with the stock trading at $27/share is $2.54B. <strong>Based on my analysis this gives a potential upside of 96% with a price target of $52.85.</strong></p>\n\n<p>Thoughts??</p>\n</div><!-- SC_ON -->",
  "score": 54,
  "permalink": "/r/investing/comments/kzcgka/callaway_golf_ticker_ely_analysis_and_price/",
  "subreddit": "investing",
  "id": "kzcgka",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1611311217226
}