{
  "author": "joe17301",
  "original_created_utc": 1660570011,
  "title": "I read all the news on r/cc today so you don’t have to",
  "created_utc": 1660610620,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So as I was browsing &lt;a href=\"/r/cc\"&gt;r/cc&lt;/a&gt; today, I started off the day reading that the ETH merge was going to take place on Sept 15th. Which is good because I only saw it 3 times yesterday and I was beginning to doubt it’d actually happen. &lt;/p&gt;\n\n&lt;p&gt;Unfortunately, soon after that I read some rich guys said Bitcoin is poo :(&lt;/p&gt;\n\n&lt;p&gt;I was getting worried but just before I got out the old cyanide pill, I read 3 posts linking to the same article stating that [random crypto site] said we’re headed for a bullrun sometime in the next 6 years, which is just amazing news. And not even BTC 100k EOY? 300k EO6Y!&lt;/p&gt;\n\n&lt;p&gt;Continuing the good news streak, I read that the… wait for it… ETH merge is, in fact, going to happen on Sept 15th! Great! But the miners are all going to shut off all their equipment and smash it with tiny hammers because it’ll instantly be utterly useless to them.&lt;/p&gt;\n\n&lt;p&gt;Bee-tee-dubs Do Kwon is a real stinker. I know, right? Suggest only putting 50% of your money into LUNA 3 (gotta save some for other 100x projects), making use of a reasonable 10x leverage to make up for only putting 50% of your mortgage in.&lt;/p&gt;\n\n&lt;p&gt;The finale, the coup de grace, the veritable chef’s kiss news of the day is that [influencer no one trusts] is doing “big things” in crypto, and will doubtlessly be hyping up a rug pull sometime soon, which sounds fun!&lt;/p&gt;\n\n&lt;p&gt;Oh, and one more thing: Something big is happening with ETH on Sept 15th. If you want to know more, tune in tomorrow. Until then, my lips are sealed.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 323,
  "permalink": "/r/CryptoCurrency/comments/woznzx/i_read_all_the_news_on_rcc_today_so_you_dont_have/",
  "subreddit": "CryptoCurrency",
  "id": "woznzx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So as I was browsing r/cc [/r/cc] today, I started off the day reading that the\nETH merge was going to take place on Sept 15th. Which is good because I only saw\nit 3 times yesterday and I was beginning to doubt it’d actually happen.\n\nUnfortunately, soon after that I read some rich guys said Bitcoin…"
}