{
  "author": "TheOssBoss",
  "the_new_excerpt": "Obviously the actual market would only be open from 9:30am to 4pm, but what is\nstopping an outside broker/service/website from being open 24/7? Aren’t after\nhour trading hours determined by a broker and could theoretically be extended to\nall hours of the day? Or say a company/website that deals in…",
  "original_created_utc": 1609389463,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "很明显，实际的市场只会在上午9：30到下午4：00开放，但是什么是开放的呢？\n阻止外部经纪人/服务/网站全天候开放？不是在追寻\n小时交易时间由经纪人决定，理论上可以延长到\n一天中的所有时间？或者比方说一家经营…业务的公司/网站",
      "title": "从理论上讲，是什么阻止了市场全天候开放？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "很明顯，實際的市場只會在上午9：30到下午4：00開放，但是什麼是開放的呢？\n阻止外部經紀人/服務/網站全天候開放？不是在追尋\n小時交易時間由經紀人決定，理論上可以延長到\n一天中的所有時間？或者比方說一家經營…業務的公司/網站",
      "title": "從理論上講，是什麼阻止了市場全天候開放？"
    }
  ],
  "title": "What, in theory, is stopping the market from being open 24/7?",
  "created_utc": 1609422362,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Obviously the actual market would only be open from 9:30am to 4pm, but what is stopping an outside broker/service/website from being open 24/7? Aren’t after hour trading hours determined by a broker and could theoretically be extended to all hours of the day? Or say a company/website that deals in “contracts” where you can sell your right to a stock you own at any point after close and then it fills as soon as the market actually opens the next morning. The price paid for this “contract” would be what someone thinks the value of the stock is worth at that point (matched with someone selling for what they think it’s worth), the same as putting a bid on the actual stock market during open hours being matched with an ask. Theoretically if enough people join in, the price of these “contracts” would have an influence on the opening price of the stock the next day because you know what people would be theoretically willing to pay for a stock at all hours. It would be like if the stock market was open 24/7 365. In the age of the internet I don’t see a reason why this couldn’t be possible, but I would love to hear what people think about this.</p>\n</div><!-- SC_ON -->",
  "score": 76,
  "permalink": "/r/stocks/comments/knj03a/what_in_theory_is_stopping_the_market_from_being/",
  "subreddit": "stocks",
  "id": "knj03a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610100748515
}