{
  "author": "Your_Boy_Roy_",
  "the_new_excerpt": "All these “I made $368 on my BIG DICK YOLO PLAY praise my nuts and MOONY MOONY\nHOLDLD” bullshit is fucking ridiculous!\n\nHaving been here since before GameStop in January ( not by much), all of a\nsudden this sub is all about teamwork and taking down the corporate elite and\n“please we need help for…",
  "original_created_utc": 1623253801,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このような「BIG DICK YOLO PLAYで368ドル稼いだ！」というのは、私のナッツとMOONY MOONYを褒めているのです。\nHOLDLD \"なんて、とんでもないです。\n\n1月のGameStopの前からここに来ていたのに、突然このサブはチームワークと企業を倒すことばかりになってしまった。\n突然、このサブはチームワークと企業のエリートを倒すことと\n\"Please we need help for...",
      "title": "皆さん、延々と書き込みをして馬鹿にしていますが"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所有这些 \"我在我的大鸡巴YOLO游戏上赚了368美元，赞美我的坚果和MOONY MOONY\nHOLDLD \"的废话真他妈的荒唐!\n\n我从一月份的GameStop之前就在这里了（不多），突然间，这个子我就在这里了。\n忽然间，这个子就变成了关于团队合作和打倒企业精英和\n\"我们需要帮助，因为...",
      "title": "你们这些没完没了的帖子都很荒唐"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所有這些 \"我在我的大雞巴YOLO遊戲上賺了368美元，讚美我的堅果和MOONY MOONY\nHOLDLD \"的廢話真他媽的荒唐!\n\n我從一月份的GameStop之前就在這裏了（不多），突然間，這個子我就在這裏了。\n忽然間，這個子就變成了關於團隊合作和打倒企業精英和\n\"我們需要幫助，因爲...",
      "title": "你們這些沒完沒了的帖子都很荒唐"
    }
  ],
  "title": "You are all being ridiculous with these endless posts",
  "created_utc": 1623259954,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>All these “I made $368 on my BIG DICK YOLO PLAY praise my nuts and MOONY MOONY HOLDLD” bullshit is fucking ridiculous! </p>\n\n<p>Having been here since before GameStop in January ( not by much), all of a sudden this sub is all about teamwork and taking down the corporate elite and “please we need help for stock XYZ!!!” or “ignore ABC!! You fools!! It’s all about 123!!!” All from accounts that are made in the last three to four months.</p>\n\n<p>For fucks sake, this is not a team effort. This is not a bunch of masked individuals here to help you get out of the hole you dug by betting your rent money or your fucking aunt may’s entire pocket book on stocks that rise and fall by the swing of your dick! We are all here to make money and I wish everyone could remember WSB in its prime where you only posted actual shitpost memes from gladiator or some high quality material once in awhile to break up the real and massive loss/gain/yolo porn. That made it a little better when sifting through the scum of posts with ass DD to find that diamond in the rough of someone who posted something NEW or actually added info instead of repeating the same echo chamber of a false hope that “___ is the next BIG SQUEEEEZE” </p>\n\n<p>How about you gamma squeeze these nuts, shut the fuck up, and read instead of posting more bullshit for the mods to wipe clean like a triple-ply once-over clandestine shit sweep. These mods are heroes for listening to this cringy begging ape shit for months now, so try to make their lives easier and learn something in the process. </p>\n\n<p>Today was a bloodbath for memes, so welcome to fucking Valhalla you shit for brains monkeys, the keys to get out are on the next play if you managed not to lose it all or have another aunt to short squeeze. </p>\n\n<p>End rant </p>\n\n<p>Sorry for probably breaking the rules mods, you guys rock.</p>\n</div><!-- SC_ON -->",
  "score": 38142,
  "permalink": "/r/wallstreetbets/comments/nvz2p3/you_are_all_being_ridiculous_with_these_endless/",
  "subreddit": "wallstreetbets",
  "id": "nvz2p3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404895339
}