{
  "author": "Prolapsia",
  "original_created_utc": 1631551602,
  "title": "Men with high libidos who are in long term relationships with women who have low libidos, how do you cope/make it work?",
  "created_utc": 1631564419,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been married for years and up until fairly recently this hasn&#39;t been much of an issue. I&#39;ve always known my wife wasn&#39;t as into it as me but she always assured me it&#39;s not a problem. Now things have become so one sided I just can&#39;t get motivated to have sex and when it does happen I&#39;m always thinking in the back of my mind that she&#39;s not into it - pity sex. She&#39;s like &quot;Want me to just bend over?&quot; or &quot;we can just do something quick&quot;. I guess when I was younger that didn&#39;t bug me as much, now it&#39;s killing me. I feel depressed and lost. We&#39;ve talked about it and either she doesn&#39;t get how important it is to me or she doesn&#39;t think she can change. I know she cares about the issue so it&#39;s not a lack of empathy.</p>\n\n<p>So I guess my main question is, how can guys stay relatively happy with a dead bedroom? I&#39;d appreciate answers that don&#39;t involve cheating or getting divorced.</p>\n</div><!-- SC_ON -->",
  "score": 114,
  "permalink": "/r/TooAfraidToAsk/comments/pnj9xg/men_with_high_libidos_who_are_in_long_term/",
  "subreddit": "TooAfraidToAsk",
  "id": "pnj9xg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've been married for years and up until fairly recently this hasn't been much\nof an issue. I've always known my wife wasn't as into it as me but she always\nassured me it's not a problem. Now things have become so one sided I just can't\nget motivated to have sex and when it does happen I'm always…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は結婚して何年も経ちますが、かなり最近までこの問題はあまりありませんでした。\n問題ではありませんでした。妻が私ほど夢中になっていないことは知っていましたが、彼女はいつも私に「問題ない」と言っていました。\n問題ないと言ってくれていました。今では一方的になってしまったので、どうしてもセックスする気になれません。\nセックスをする気になれないし、できたとしてもいつも...",
      "title": "リビドーが高い男性が、リビドーが低い女性と長期的に交際している場合、どのように対処・工夫していますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我已经结婚多年了，直到最近，这还不是什么问题。\n的问题。我一直知道我的妻子不像我一样喜欢这个，但她总是向我保证这不是一个问题。\n她向我保证这不是一个问题。现在事情变得如此片面，我只是不能\n我无法激发性生活的动力，当它发生时，我总是......",
      "title": "性欲高的男性与性欲低的女性保持长期关系，你们是如何应对/使其发挥作用的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我已經結婚多年了，直到最近，這還不是什麼問題。\n的問題。我一直知道我的妻子不像我一樣喜歡這個，但她總是向我保證這不是一個問題。\n她向我保證這不是一個問題。現在事情變得如此片面，我只是不能\n我無法激發性生活的動力，當它發生時，我總是......",
      "title": "性慾高的男性與性慾低的女性保持長期關係，你們是如何應對/使其發揮作用的？"
    }
  ]
}