{
  "author": "Supercharmeleon",
  "original_created_utc": 1647523396,
  "title": "I think there's a correlation between this being a great time to buy crypto and so many of us not having the fiat to do so.",
  "created_utc": 1647542203,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Lately, crypto has been following the economy itself beat by beat unfortunately, which means that though this is a perfect time to DCA into crypto, a lot of us unfortunately are struggling to gather up enough fiat to do so at the moment.&lt;/p&gt;\n\n&lt;p&gt;Shit&amp;#39;s just kinda rough all around. I don&amp;#39;t know if it&amp;#39;s the economy as a whole but I feel like everyone I talk to has had financial problems lately, and we&amp;#39;ve all been trying to save up just to pay the bills lately.&lt;/p&gt;\n\n&lt;p&gt;What do y&amp;#39;all think? Might be confirmation bias, but I feel like there&amp;#39;s a good correlation between the two.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 323,
  "permalink": "/r/CryptoCurrency/comments/tga582/i_think_theres_a_correlation_between_this_being_a/",
  "subreddit": "CryptoCurrency",
  "id": "tga582",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Lately, crypto has been following the economy itself beat by beat unfortunately,\nwhich means that though this is a perfect time to DCA into crypto, a lot of us\nunfortunately are struggling to gather up enough fiat to do so at the moment.\n\nShit's just kinda rough all around. I don't know if it's the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、暗号は残念ながら経済そのものを一拍一拍追っている。\nつまり、暗号にDCAする絶好の機会であるにもかかわらず、多くの人が\n残念ながら、今はそのためのフィアットを集めるのに苦労しています。\n\nちょっと大変ですね。もしかしたら...",
      "title": "暗号を買うのに絶好のタイミングなのに、多くの人がそのためのフィアットを持っていないというのは、相関関係があると思います。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近，不幸的是，加密货币一直在跟着经济本身一拍一拍。\n这意味着，尽管现在是DCA进入加密货币的最佳时机，但我们很多人\n不幸的是，目前正在努力收集足够的法币来这样做。\n\n糟糕的是，所有的事情都有点粗糙。我不知道这是否是...",
      "title": "我认为现在是购买加密货币的大好时机，而我们这么多人没有法币来购买，这两者之间存在着关联。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近，不幸的是，加密貨幣一直在跟着經濟本身一拍一拍。\n這意味着，儘管現在是DCA進入加密貨幣的最佳時機，但我們很多人\n不幸的是，目前正在努力收集足夠的法幣來這樣做。\n\n糟糕的是，所有的事情都有點粗糙。我不知道這是否是...",
      "title": "我認爲現在是購買加密貨幣的大好時機，而我們這麼多人沒有法幣來購買，這兩者之間存在着關聯。"
    }
  ]
}