{
  "author": "CrabCommander",
  "the_new_excerpt": "I was sort of shocked I couldn't find this data basically anywhere (or where it\nwas available, it was usually only for a list of like 10 coins). So, without\nfurther ado, here is a breakdown of the current top 101 coins by market cap,\ngrouped into buckets based on their usage/purpose.\n\nNote:…",
  "original_created_utc": 1612908125,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我有点震惊，我基本上在任何地方都找不到这些数据（或者说在哪里找到的？\n是可用的，它通常只适用于像10个硬币的列表）。) 所以，如果没有\n话不多说，这里是目前市值最高的101个币的分类。\n根据它们的用途/目的，将其归入桶中。\n\n注：...",
      "title": "按用途/目的分类的前101种钱币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我有點震驚，我基本上在任何地方都找不到這些數據（或者說在哪裏找到的？\n是可用的，它通常只適用於像10個硬幣的列表）。) 所以，如果沒有\n話不多說，這裏是目前市值最高的101個幣的分類。\n根據它們的用途/目的，將其歸入桶中。\n\n注：...",
      "title": "按用途/目的分類的前101種錢幣"
    }
  ],
  "title": "Top 101 Coins Grouped by Usage/Purpose",
  "created_utc": 1612922086,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was sort of shocked I couldn&#39;t find this data basically anywhere (or where it was available, it was usually only for a list of like 10 coins).  So, without further ado, here is a breakdown of the current top 101 coins by market cap, grouped into buckets based on their usage/purpose.</p>\n\n<p><strong>Note:</strong> Inevitably some coins try to &#39;do everything&#39;.  I limited each to only being listed once, so things are grouped by whatever their perceived or advertised <em>primary</em> purpose is, even if they theoretically can do more than that.  (For example, probably 50% of the entire top 100 list has &#39;dApps&#39; listed somewhere in their description, but it is not the main point, at least currently, for many of them)</p>\n\n<h1>Store of Value</h1>\n\n<p>There&#39;s only one true asset in this category, and it&#39;s not one that intended to be here.  Bitcoin was originally designed as digital currency, but insanely high transaction fees, changes in expectation over time, etc. have really morphed it into an asset more akin to gold or other asset stores.  (AKA: It&#39;s an investment, not really for spending directly, and has limited other direct use.)</p>\n\n<pre><code>1 - Bitcoin\n</code></pre>\n\n<h1>Digital Currency</h1>\n\n<p>What Bitcoin originally wanted to be, this is a category filled with Bitcoin spin offs and new tech focused primarily on cheaper, faster transactions.  The use cases range from every-day purchases to more massive actions such as major cross-border intra-bank transfers.</p>\n\n<pre><code>5  - XRP\n8  - Litecoin\n10 - Bitcoin Cash\n12 - Stellar\n21 - Terra/Luna\n24 - NEM\n46 - Dash\n48 - Decred\n56 - Ziliqa\n65 - DigiByte\n74 - Nano\n84 - Horizen\n</code></pre>\n\n<h1>Smart Contracts/Distributed Applications</h1>\n\n<p>This is going to be a long list.  Smart contracts/dApps are pretty clearly the most exciting &#39;generic&#39; use for Blockchain/Crypto Currencies by many people&#39;s viewpoint, opening the doors for a lot of unique applications and financial structures.  Essentially everyone in this category is gunning for Ethereum&#39;s spot, and the competition is hot and heavy all the way down the top 100 list, with every entry trying to put their own spin on it.</p>\n\n<pre><code>2  - Ethereum\n4  - Cardano\n6  - Polkadot\n18 - Eos\n19 - Elrond\n20 - Tron\n27 - Tezos\n29 - Avalanche\n32 - NEO\n34 - Solana\n43 - Algorand\n53 - Ethereum Classic\n54 - Kusama\n55 - Waves\n59 - NEAR Protocol\n63 - Hedera Hashgraph\n71 - Celo\n80 - Qtum\n82 - Matic Network\n90 - Fantom\n95 - Energy Web Token\n96 - IOST\n</code></pre>\n\n<h1>Stablecoins</h1>\n\n<p>These are tokens that attempt to stay pegged to some real world kind of value (generally USD) via various methods.  Pretty straight forward, and mostly varies by what network/exchange you&#39;re on.</p>\n\n<pre><code>3  - Tether\n13 - USD Coin\n36 - Dai\n40 - Binance USD\n84 - HUSD\n89 - Ampleforth ( Peg to USD is fairly weak )\n91 - TrueUSD\n</code></pre>\n\n<h1>Exchange Tokens</h1>\n\n<p>These are tokens that primarily are associated with some kind of crypto-currency exchange, either Centralized(CEX) or Decentralized(DEX).  A few of them also try to serve other purposes (Usually as Digital Currencies), but at heart being used as an exchange token is their most notable point, and they will largely rise and fall based on the success of their related exchange.</p>\n\n<pre><code>7  - Binance Coin\n15 - Uniswap\n33 - Huobi Token\n38 - Sushiswap\n39 - FTX Token\n41 - Crypto.com Coin\n44 - UNUS SED LEO\n61 - Loopring\n64 - SwissBorg\n67 - THORChain\n68 - Curve DAO Token\n73 - PancakeSwap\n76 - Voyager Token\n81 - OKB\n92 - Alpha Finanace Lab\n100 - Bancor\n</code></pre>\n\n<h1>Alternative Exchange Tokens</h1>\n\n<p>These are tokens that are related to the crypto trading markets, but aren&#39;t really proper exchange tokens.  Basically for exchange-esque activities, or offering only a specific, narrow type of alternative trading.</p>\n\n<pre><code>25 - Synthetix ( Options Trading )\n52 - 0x ( DEX Aggregator )\n42 - UMA ( Options Trading )\n72 - 1inch ( DEX Aggregator )\n78 - HedgeTrade ( Crypto Hedge Fund Trading )\n87 - Kyber Network ( DEX Aggregator )\n</code></pre>\n\n<h1>Extra-Blockchain Communication/Transfers</h1>\n\n<p>These tokens/networks exist primarily to solve the problem of communicating between different blockchain networks/the non-blockchain world, and the transfer of assets across said barriers.  (Ex. The Oracle Problem)</p>\n\n<pre><code>9  - Chainlink\n22 - Cosmos\n60 - Ren\n75 - ICON\n77 - Quant\n99 - Ravencoin\n</code></pre>\n\n<h1>Lending/Banking/Yield Farming</h1>\n\n<p>These tokens and networks focus around making trustless lending and banking (savings accounts) possible, and yield-farming via said lending.  Generally speaking, they work via encouraging users to stake/lock up digital collateral from other networks into their own, giving the users the network&#39;s own tokens as the loan balance and/or paying the user tokens for other users borrowing their assets.</p>\n\n<pre><code>14 - Aave\n28 - Maker\n31 - Compound\n45 - Celsius\n47 - yearn.finance\n58 - Nexo\n97 - Venus\n</code></pre>\n\n<h1>Privacy Coins</h1>\n\n<p>Fairly self explanatory, these primarily exist to keep as much data about the network/transactions/wallets as anonymous as possible.  They&#39;ve obviously gotten a bad rep at times as being used often for illicit activities, but there&#39;s nothing inherently wrong with wanting privacy either.</p>\n\n<pre><code>23 - Monero\n50 - Zcash\n101 - Verge\n</code></pre>\n\n<h1>Other</h1>\n\n<p>These coins/tokens have largely unique use cases, that leave them without many/any direct competitors in the top 100.  Whether they go up or down is going to be mostly based on if their use cases actually exist and if they can succeed in filling them correctly.  A few of these are gunning towards long term moving into the more general categories, but at least currently book themselves as having a more narrow focus.</p>\n\n<pre><code>11 - Dogecoin ( Meme/Intro to Crypto )\n26 - THETA ( Distributed Video Streaming )\n30 - VeChain ( Supply Chain Logistics )\n35 - IOTA ( Internet of Things Logistics )\n37 - Filecoin ( Distributed File Hosting )\n49 - The Graph ( Distributed Search Indexing )\n51 - BitTorrent ( Blockchain-ifying the Bittorrent Protocol )\n57 - Revain ( Distributed Review Platform )\n68 - OMG Network ( Cheaper ETH Transfers )\n69 - Ontology ( Identity/Private Data Management )\n70 - Basic Attention Token ( Web Advertisement/Marketing Replacement )\n79 - Siacoin ( Distributed File Hosting )\n85 - Reserve Rights ( Stablecoin counterbalance token )\n88 - Stacks ( DApp extension onto the Bitcoin Network )\n93 - Decentraland ( Distributed Virtual-Reality Platform )\n94 - Ocean Protocol ( Data Monetization )\n98 - Enjin Coin ( Video Game Items/In-Game Economy )\n</code></pre>\n\n<h1>N/A - Wrapped Assets</h1>\n\n<p>These are &#39;wrapped&#39; versions of other assets (Bitcoin) floating around other networks for use on said networks.  There&#39;s generally limited reason to directly invest in these when you could invest in their more liquid base asset.  (Ex. You&#39;d only buy them to use them in some specific DApp/etc, not just hold them in a wallet generally)</p>\n\n<pre><code>16 - Wrapped Bitcoin\n62 - renBTC\n86 - Bitcoin BEP2\n</code></pre>\n\n<p>Cheers, thanks for the read.</p>\n</div><!-- SC_ON -->",
  "score": 1417,
  "permalink": "/r/CryptoCurrency/comments/lgeots/top_101_coins_grouped_by_usagepurpose/",
  "subreddit": "CryptoCurrency",
  "id": "lgeots",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123197361
}