{
  "author": "AphidHero",
  "original_created_utc": 1630611038,
  "title": "Is it ok to want to be alone 95% of the time?",
  "created_utc": 1630623537,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ll just be blunt, I really don’t like other people. I don’t really care to meet people or make friends. My family and a few select friends are the only ones I make an effort to talk to.   </p>\n\n<p>I don’t think I have anxiety issues. I’m polite to others but I just don’t want to be in a group. I’m a little better one on one but can’t stand small talk. I tried.  </p>\n\n<p>This frightened and desperate part of me wants to be left alone and feels the safest when nobody is around, but the true me is lonely.</p>\n</div><!-- SC_ON -->",
  "score": 108,
  "permalink": "/r/TooAfraidToAsk/comments/pgox9d/is_it_ok_to_want_to_be_alone_95_of_the_time/",
  "subreddit": "TooAfraidToAsk",
  "id": "pgox9d",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’ll just be blunt, I really don’t like other people. I don’t really care to\nmeet people or make friends. My family and a few select friends are the only\nones I make an effort to talk to.\n\nI don’t think I have anxiety issues. I’m polite to others but I just don’t want\nto be in a group. I’m a little…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "率直に言うと、私は人が好きではありません。人と会ったり、友達を作ったりすることにも興味がない。\n人と会ったり、友達を作ったりすることに興味がありません。家族と数人の選ばれた友人だけが\n話す努力をしているのは家族と数人の友人だけです。\n\n自分が不安を抱えているとは思っていません。他の人には礼儀正しいのですが、集団の中には入りたくないのです。\n集団の中には入りたくないのです。私は少し...",
      "title": "95％の確率で一人になりたいと思ってもいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我就直说了吧，我真的不喜欢别人。我并不真正关心\n见人或交朋友。我的家人和几个精选的朋友是唯一的\n我努力与之交谈的人。\n\n我不认为我有焦虑问题。我对别人很有礼貌，但我只是不想\n在一个群体中。我有点...",
      "title": "95%的时间都想一个人呆着，这可以吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我就直說了吧，我真的不喜歡別人。我並不真正關心\n見人或交朋友。我的家人和幾個精選的朋友是唯一的\n我努力與之交談的人。\n\n我不認爲我有焦慮問題。我對別人很有禮貌，但我只是不想\n在一個羣體中。我有點...",
      "title": "95%的時間都想一個人待著，這可以嗎？"
    }
  ]
}