{
  "author": "CicadaSalty",
  "original_created_utc": 1652956845,
  "title": "confidentiality in therapy is void if the counselor sees you as a threat to yourself or to others, how the heck can prospective school shooters seek help then?",
  "created_utc": 1652972771,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I believe this is the law in most countries regarding confidentiality. If someone says to their therapist that they have been fantasizing the idea of hurting other people, they might get sent to a facility, which makes the process intimidating to start with. How will they get help to prevent the actual thing from happening?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/ut0jno/confidentiality_in_therapy_is_void_if_the/",
  "subreddit": "TooAfraidToAsk",
  "id": "ut0jno",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "I believe this is the law in most countries regarding confidentiality. If\nsomeone says to their therapist that they have been fantasizing the idea of\nhurting other people, they might get sent to a facility, which makes the process\nintimidating to start with. How will they get help to prevent the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "機密保持に関しては、ほとんどの国でこのような法律があると思います。I",
      "title": "もしカウンセラーが、あなた自身や他人を脅かす存在と見なしたら、セラピーにおける機密保持は無効になります。では、学校での銃乱射事件を起こす可能性のある人たちは、いったいどうやって助けを求めるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我相信这是大多数国家关于保密的法律。如果\n如果有人对他们的治疗师说，他们一直在幻想着伤害他人的想法\n伤害他人的想法，他们可能会被送入一个机构，这使得这个过程\n这使得这个过程一开始就很吓人。他们将如何获得帮助以防止...",
      "title": "如果咨询师将你视为对自己或他人的威胁，那么治疗中的保密性就会失效，那么未来的校园枪手如何寻求帮助？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我相信這是大多數國家關於保密的法律。如果\n如果有人對他們的治療師說，他們一直在幻想着傷害他人的想法\n傷害他人的想法，他們可能會被送入一個機構，這使得這個過程\n這使得這個過程一開始就很嚇人。他們將如何獲得幫助以防止...",
      "title": "如果諮詢師將你視爲對自己或他人的威脅，那麼治療中的保密性就會失效，那麼未來的校園槍手如何尋求幫助？"
    }
  ]
}