{
  "author": "dressthrow",
  "original_created_utc": 1646672658,
  "title": "I made a website for brainstorming side project ideas",
  "created_utc": 1646685865,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://ideastrikes.com/\"&gt;https://ideastrikes.com/&lt;/a&gt; is a pretty simple website I made to help myself and (hopefully) others brainstorm new project ideas. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve always been one of the folks who can never seem to come up with the perfect idea. My biggest blocker was that I felt any new project needed to be novel and fresh. Eventually I realized that most projects don&amp;#39;t need a new idea at all. &lt;/p&gt;\n\n&lt;p&gt;A good product can be made by taking an existing product and changing it to target a new audience or niche. &lt;/p&gt;\n\n&lt;p&gt;So for me, thinking of an existing product I might want to improve on and a niche that I wanted to work with was enough to brainstorm some cool side project ideas. &lt;strong&gt;Product + customer group = idea&lt;/strong&gt;. That&amp;#39;s the basic idea with the above website. I hope others find it useful.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 5,
  "permalink": "/r/SideProject/comments/t8tw06/i_made_a_website_for_brainstorming_side_project/",
  "subreddit": "SideProject",
  "id": "t8tw06",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "https://ideastrikes.com/ is a pretty simple website I made to help myself and\n(hopefully) others brainstorm new project ideas.\n\nI've always been one of the folks who can never seem to come up with the perfect\nidea. My biggest blocker was that I felt any new project needed to be novel and\nfresh.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "https://ideastrikes.com/ は、私自身と、そして私たちを助けるために作った、とてもシンプルなウェブサイトです。\n(新しいプロジェクトのアイデア出しになればと思います。\n\n私はいつも、完璧なアイデアを思いつくことができない人の一人です。\nアイデア 私の最大の障壁は、新しいプロジェクトは斬新でなければならないと思っていたことです。\n新鮮で......。",
      "title": "サイドプロジェクトのアイデアをブレストするサイトを作りました"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "https://ideastrikes.com/ 是一个相当简单的网站，我做这个网站是为了帮助自己和\n(希望)其他人集思广益，提出新的项目想法。\n\n我一直都是那种似乎永远无法想出完美的\n的想法。我最大的障碍是，我觉得任何新项目都必须是新颖和\n新鲜....",
      "title": "我做了一个网站，用于集思广益的副业创意"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "https://ideastrikes.com/ 是一個相當簡單的網站，我做這個網站是爲了幫助自己和\n(希望)其他人集思廣益，提出新的項目想法。\n\n我一直都是那種似乎永遠無法想出完美的\n的想法。我最大的障礙是，我覺得任何新項目都必須是新穎和\n新鮮....",
      "title": "我做了一個網站，用於集思廣益的副業創意"
    }
  ]
}