{
  "author": "Nowhere_Man_Forever",
  "original_created_utc": 1659008468,
  "title": "In the Bible, the Legendary King Solomon is said to have 700 wives and 300 concubines. With that many wives, what is the purpose of distinguishing the concubines separately?",
  "created_utc": 1659019909,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Another way to ask this question would be to ask how polygamist marriage and concubinage worked in ancient Israelite nobility around the time of the writing of the Books of Kings. Obviously Solomon himself is a legendary figure and the historicity of all these wives should be taken with a grain of salt, but the fact remains that the writers assigned some special significance to having a lot of concubines in addition to all the wives. However, in other cultures where a ruler could have hundreds of wives the distinction between &amp;quot;wife&amp;quot; and &amp;quot;concubine&amp;quot; isn&amp;#39;t so distinct. &lt;/p&gt;\n\n&lt;p&gt;So I suppose the true question is-&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Was such extravagant polygamy an accepted practice among ancient Israelite rulers? (Obviously &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Why distinguish wives from concubines when there are already hundreds of wives?&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;The taking of foreign wives is seen as a flaw of Solomon&amp;#39;s, so is the taking of so many wives and the taking of concubines meant to be seen as a flaw too?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 107,
  "permalink": "/r/AskHistorians/comments/wa7ni4/in_the_bible_the_legendary_king_solomon_is_said/",
  "subreddit": "AskHistorians",
  "id": "wa7ni4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Another way to ask this question would be to ask how polygamist marriage and\nconcubinage worked in ancient Israelite nobility around the time of the writing\nof the Books of Kings. Obviously Solomon himself is a legendary figure and the\nhistoricity of all these wives should be taken with a grain of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "別の言い方をすれば、「一夫多妻制の結婚と\nもう一つの問いかけは、『列王記』が書かれたころの古代イスラエル貴族の間で、一夫多妻制と妾腹がどのように機能していたか、ということです。\nということです。ソロモン自身が伝説的人物であることは明らかであり、これらの妻たちの歴史性は\nソロモン自身は伝説上の人物であり、これらの妻たちの歴史的信憑性には疑問の余地がある...",
      "title": "聖書では、伝説の王ソロモンは700人の妻と300人の妾を持ったと言われています。それだけの数の妻がいるのに、妾を別に区別する目的は何なのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "问这个问题的另一种方式是问一夫多妻制婚姻和\n在写《列王纪》的时候，古代以色列贵族的一夫多妻制婚姻和纳妾是如何进行的？\n的时候，一夫多妻制婚姻和纳妾在古代以色列贵族中是如何运作的。显然，所罗门本人是一个传奇人物，所有这些妻子的历史性应被视为\n所有这些妻子的历史性应该被视为是有价值的。",
      "title": "在《圣经》中，传说中的所罗门王有700个妻子和300个小妾。有这么多的妻子，分别区分妻妾的目的是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "問這個問題的另一種方式是問一夫多妻制婚姻和\n在寫《列王紀》的時候，古代以色列貴族的一夫多妻制婚姻和納妾是如何進行的？\n的時候，一夫多妻制婚姻和納妾在古代以色列貴族中是如何運作的。顯然，所羅門本人是一個傳奇人物，所有這些妻子的歷史性應被視爲\n所有這些妻子的歷史性應該被視爲是有價值的。",
      "title": "在《聖經》中，傳說中的所羅門王有700個妻子和300個小妾。有這麼多的妻子，分別區分妻妾的目的是什麼？"
    }
  ]
}