{
  "author": "Nowhere_Man_Forever",
  "original_created_utc": 1659008468,
  "title": "In the Bible, the Legendary King Solomon is said to have 700 wives and 300 concubines. With that many wives, what is the purpose of distinguishing the concubines separately?",
  "created_utc": 1659019909,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Another way to ask this question would be to ask how polygamist marriage and concubinage worked in ancient Israelite nobility around the time of the writing of the Books of Kings. Obviously Solomon himself is a legendary figure and the historicity of all these wives should be taken with a grain of salt, but the fact remains that the writers assigned some special significance to having a lot of concubines in addition to all the wives. However, in other cultures where a ruler could have hundreds of wives the distinction between &amp;quot;wife&amp;quot; and &amp;quot;concubine&amp;quot; isn&amp;#39;t so distinct. &lt;/p&gt;\n\n&lt;p&gt;So I suppose the true question is-&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Was such extravagant polygamy an accepted practice among ancient Israelite rulers? (Obviously &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Why distinguish wives from concubines when there are already hundreds of wives?&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;The taking of foreign wives is seen as a flaw of Solomon&amp;#39;s, so is the taking of so many wives and the taking of concubines meant to be seen as a flaw too?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 107,
  "permalink": "/r/AskHistorians/comments/wa7ni4/in_the_bible_the_legendary_king_solomon_is_said/",
  "subreddit": "AskHistorians",
  "id": "wa7ni4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Another way to ask this question would be to ask how polygamist marriage and\nconcubinage worked in ancient Israelite nobility around the time of the writing\nof the Books of Kings. Obviously Solomon himself is a legendary figure and the\nhistoricity of all these wives should be taken with a grain of…"
}