{
  "author": "habitual_low_life",
  "original_created_utc": 1637190837,
  "title": "You don’t have to take profits or hold just because someone on Reddit tells you to",
  "created_utc": 1637203569,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve been seeing a lot of posts of people saying people need to take profit while they can and secure their gains. I’ve been against that point and trying to argue the HODL but to be fair there really is no right answer if the person I’m talking to wants something different than I do. </p>\n\n<p>At the end of the day you need to do what’s right for you and remember that <strong>everyone has their own moon</strong>. </p>\n\n<ul>\n<li>If your moon is doubling what you put in, taking out 50%, and seeing where the rest goes that’s great. </li>\n<li>If your moon is a target price you’ll cash out for to improve your life, also great.</li>\n<li>If your moon is building bags and you want to hold every coin you buy to just keep accumulating, that’s great as well.</li>\n</ul>\n\n<p>That being said - what&#39;s your strategy?</p>\n</div><!-- SC_ON -->",
  "score": 179,
  "permalink": "/r/CryptoCurrency/comments/qwblyq/you_dont_have_to_take_profits_or_hold_just/",
  "subreddit": "CryptoCurrency",
  "id": "qwblyq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’ve been seeing a lot of posts of people saying people need to take profit\nwhile they can and secure their gains. I’ve been against that point and trying\nto argue the HODL but to be fair there really is no right answer if the person\nI’m talking to wants something different than I do.\n\nAt the end of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今のうちに利益を確保しておくべきだという意見を多く目にするようになりました。\n今のうちに利益を得て、利益を確保する必要があるという書き込みをよく目にします。私はその点に反発し、HODLを主張してきました。\nHODLを主張してきましたが、相手が私とは違うことを望んでいる場合、正しい答えはありません。\n私はその点に反対し、HODLを主張しようとしてきました。\n\n最後に...",
      "title": "Redditの誰かが言ったからといって、利益を取ったりホールドしたりする必要はありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直看到很多人说人们需要趁机获利，并确保他们的收益。\n趁机获利，确保他们的收益。我一直在反对这个观点，并试图\n争论HODL的问题，但公平地说，真的没有正确的答案，如果这个人\n与我交谈的人想要的东西与我不同。\n\n在结束时...",
      "title": "你不必因为Reddit上有人告诉你就获利或持有"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直看到很多人說人們需要趁機獲利，並確保他們的收益。\n趁機獲利，確保他們的收益。我一直在反對這個觀點，並試圖\n爭論HODL的問題，但公平地說，真的沒有正確的答案，如果這個人\n與我交談的人想要的東西與我不同。\n\n在結束時...",
      "title": "你不必因爲Reddit上有人告訴你就獲利或持有"
    }
  ]
}