{
  "author": "_Captain_Retard_",
  "the_new_excerpt": "First I want to make clear that I dont think that crypto will be a \"winner takes\nall scenario\". So I think that in the future, there will be still many projects\naround. However, from time to time I contemplate to just convert everything into\nBitcoin and just let it ride.\n\nI feel like that BTC is one…",
  "original_created_utc": 1617182371,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "首先，我想说明的是，我不认为加密技术会是 \"赢家通吃 \"的。\n全场景\"。所以我认为，未来，还是会有很多项目\n左右。不过，我时常考虑把所有的东西都转化成 \"我\"。\n比特币，就任其发展。\n\n我觉得BTC是一...",
      "title": "100%BTC：有时候我只差几下就可以把所有的altcoin都兑换成比特币了，就不看了。是否还有人时常有同样的感受？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，我想說明的是，我不認爲加密技術會是 \"贏家通喫 \"的。\n全場景\"。所以我認爲，未來，還是會有很多項目\n左右。不過，我時常考慮把所有的東西都轉化成 \"我\"。\n比特幣，就任其發展。\n\n我覺得BTC是一...",
      "title": "100%BTC：有時候我只差幾下就可以把所有的altcoin都兌換成比特幣了，就不看了。是否還有人時常有同樣的感受？"
    }
  ],
  "title": "100% BTC: Sometimes I am only a few clicks away from converting all my altcoins into Bitcoin and just stop looking. Are there others who feel the same way from time to time?",
  "created_utc": 1617215430,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>First I want to make clear that I dont think that crypto will be a &quot;winner takes all scenario&quot;. So I think that in the future, there will be still many projects around. However, from time to time I contemplate to just convert everything into Bitcoin and just let it ride.</p>\n\n<p>I feel like that BTC is one of the most likely cryptocurrencies to be around in the future, because of its history, market cap and adoption as &quot;store of value&quot; from companies. On the other side, it probably wont see a 100x in the next 10 years like maybe some very few altcoins could see. But I dont really know.</p>\n\n<p>However, at least to me, it really seems hard to estimate which altcoins are good and have potential. Of course there are obvious cases where you know to stay away from them. But I noticed that my mind often wonders if I put the part of my portfolio, dedicated to altcoins, into the &quot;right&quot; altcoins. Also staying up to date with the development progress in a number of altcoins feels sometimes like a hassle to me.</p>\n\n<p>I know that there are good basic portfolios rules about allocation of BTC/ETH and altcoins like 80%/20% or 50%/30%/20%, however does anybody else have the idea to go 100% BTC from time to time?</p>\n</div><!-- SC_ON -->",
  "score": 254,
  "permalink": "/r/CryptoCurrency/comments/mh28j6/100_btc_sometimes_i_am_only_a_few_clicks_away/",
  "subreddit": "CryptoCurrency",
  "id": "mh28j6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357138674
}