{
  "author": "crazyguy28",
  "original_created_utc": 1635015184,
  "title": "How weird/creepy would it be for a grown man in his 30s, in the privacy of his own home, to play with children's toys?",
  "created_utc": 1635023643,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have a job and a house. I dont mean vinyl pops or stuff in there original packaging. I mean dollar store dinosaus and tanks and castles. I have been feeling stifled and not creative.  I miss having action figures and toys and going on adventures in my mind. I think it could maybe even help with my depression and critical thinking. </p>\n\n<p>I dont know if it would help with my self esteem though.</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/NoStupidQuestions/comments/qeazhe/how_weirdcreepy_would_it_be_for_a_grown_man_in/",
  "subreddit": "NoStupidQuestions",
  "id": "qeazhe",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I have a job and a house. I dont mean vinyl pops or stuff in there original\npackaging. I mean dollar store dinosaus and tanks and castles. I have been\nfeeling stifled and not creative. I miss having action figures and toys and\ngoing on adventures in my mind. I think it could maybe even help with…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私には仕事も家もあります。オリジナルのパッケージに入ったビニール製のポップスとかではありません。\n包装されたものではありません。つまり、1ドルショップの恐竜や戦車やお城のことです。私はずっと\n息苦しさや創造性のなさを感じています。アクションフィギュアやおもちゃを持っていて\n心の中で冒険したいと思っています。私はそれがもしかしたら助けになるかもしれないと思います...",
      "title": "30代の大人が、家の中で子供のおもちゃで遊ぶのは、どれほど奇妙で不気味なことでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我有工作，有房子。我不是指黑胶唱片或原包装的东西。\n包装的东西。我指的是一元店的恐龙、坦克和城堡。我一直\n感觉被扼杀了，没有创造力。我怀念有动作人物和玩具的日子，怀念\n在我的脑海中进行冒险。我想这也许甚至可以帮助我...",
      "title": "一个30多岁的成年男子在自己家里玩儿童玩具的隐私，会有多诡异/恐怖呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我有工作，有房子。我不是指黑膠唱片或原包裝的東西。\n包裝的東西。我指的是一元店的恐龍、坦克和城堡。我一直\n感覺被扼殺了，沒有創造力。我懷念有動作人物和玩具的日子，懷念\n在我的腦海中進行冒險。我想這也許甚至可以幫助我...",
      "title": "一個30多歲的成年男子在自己家裏玩兒童玩具的隱私，會有多詭異/恐怖呢？"
    }
  ]
}