{
  "author": "skoopaloopa",
  "original_created_utc": 1649494646,
  "title": "Is not being circumcised in the U.S. really a big deal?",
  "created_utc": 1649508961,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In the U.S. circumcision is supposedly the norm.  My husband is circumcised, and I don&amp;#39;t mind....that being said, I fought a lot with my husband about not circumcising our son. My husband was adamant that we should and felt that because he has a penis he should get to decide. &lt;/p&gt;\n\n&lt;p&gt;After a lot of debates, we eventually found compromise and decided that we will let our son decide when he is old enough to choose for himself.&lt;/p&gt;\n\n&lt;p&gt;Now a few friends/family have shared their (unsolocited) opinions that our son will have a hard time in life with girls down the road because we didnt circumcise him as a newborn, and said we did him a disservice. Were we really wrong to wait and let him decide for himself? Is circumsision really such a big deal in the United States?&lt;/p&gt;\n\n&lt;p&gt;TL/DR: We chose to wait on getting our son circumcised and let him decide when he is old enough to choose for himself. Friends keep saying our son will have a hard time living in the U.S. b/c we didn&amp;#39;t circumcise him as a newborn. Is not being circumcised really such a big deal in the U.S. ?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 125,
  "permalink": "/r/TooAfraidToAsk/comments/tzp90t/is_not_being_circumcised_in_the_us_really_a_big/",
  "subreddit": "TooAfraidToAsk",
  "id": "tzp90t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In the U.S. circumcision is supposedly the norm. My husband is circumcised, and\nI don't mind....that being said, I fought a lot with my husband about not\ncircumcising our son. My husband was adamant that we should and felt that\nbecause he has a penis he should get to decide.\n\nAfter a lot of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アメリカでは割礼が当たり前のようです。私の夫は割礼をしていますし\n私は気にしないのですが・・・そうはいっても、夫と何度も喧嘩をしましたよ。\n息子に割礼をするんです。夫は断固として割礼をするべきだと主張し、次のように感じていました。\nペニスがあるのだから、彼が決めるべきでしょう。\n\n何度も何度も...",
      "title": "アメリカで割礼をしないことは、本当に大きな問題なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在美国，包皮环切术据说是一种规范。我的丈夫接受了割礼，而且\n我不介意....，但我和我丈夫在不给儿子做包皮手术的问题上争论了很久。\n我们的儿子进行割礼。我丈夫坚持认为我们应该做，并认为\n因为他有一个阴茎，他应该决定。\n\n经过许多次的争吵，我和丈夫终于达成共识。",
      "title": "在美国不做包皮手术真的是件大事吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在美國，包皮環切術據說是一種規範。我的丈夫接受了割禮，而且\n我不介意....，但我和我丈夫在不給兒子做包皮手術的問題上爭論了很久。\n我們的兒子進行割禮。我丈夫堅持認爲我們應該做，並認爲\n因爲他有一個陰莖，他應該決定。\n\n經過許多次的爭吵，我和丈夫終於達成共識。",
      "title": "在美國不做包皮手術真的是件大事嗎？"
    }
  ]
}