{
  "author": "CMADBF",
  "the_new_excerpt": "I just wanted to take a moment to highlight Kraken as an exchange. They have\nbeen one of the most reliable, transparent, customer centered exchanges that I\nhave had the pleasure of using over the years. This bull market has really made\nme cautious of who I trust my funds with when trading. I’m not…",
  "original_created_utc": 1621135146,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この場を借りて、取引所としてのKrakenを紹介したいと思います。Krakenは\n私がこれまで利用してきた取引所の中で、最も信頼性が高く、透明性があり、顧客中心の取引所の一つです。\n長年にわたって利用させていただいています。今回の強気の市場では、私は本当に\n取引の際に資金を預ける相手には慎重になりました。私は...",
      "title": "クラーケン取引所の感謝記事"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我只是想花点时间来强调一下Kraken这个交易所。他们一直是\n他们是我多年来有幸使用的最可靠、最透明、以客户为中心的交易所之一。\n多年来，我有幸使用过的交易所之一。这个牛市真的让我\n我在交易时对信任我的资金的人持谨慎态度。我不是...",
      "title": "Kraken交易所的感谢帖"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我只是想花點時間來強調一下Kraken這個交易所。他們一直是\n他們是我多年來有幸使用的最可靠、最透明、以客戶爲中心的交易所之一。\n多年來，我有幸使用過的交易所之一。這個牛市真的讓我\n我在交易時對信任我的資金的人持謹慎態度。我不是...",
      "title": "Kraken交易所的感謝帖"
    }
  ],
  "title": "Kraken Exchange appreciation post",
  "created_utc": 1621191433,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I just wanted to take a moment to highlight Kraken as an exchange. They have been one of the most reliable, transparent, customer centered exchanges that I have had the pleasure of using over the years. This bull market has really made me cautious of who I trust my funds with when trading. I’m not here to slander other exchanges, (fuck you Binance.US) but I would just like to show love where love should he shown. Kraken has not only proven to stand the test of time, they also have one of the best customer support systems in place. Thank you Kraken for being honest and reliable amongst a sea of crooks.</p>\n</div><!-- SC_ON -->",
  "score": 183,
  "permalink": "/r/CryptoCurrency/comments/ndfapl/kraken_exchange_appreciation_post/",
  "subreddit": "CryptoCurrency",
  "id": "ndfapl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590798346
}