{
  "author": "Laughingboy14",
  "original_created_utc": 1640596531,
  "title": "Decentralisation is the ONLY point of crypto",
  "created_utc": 1640608959,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;There has been a bit of a debate on this subreddit about the role of decentralisation in crypto. I believe that decentralisation is the &lt;strong&gt;ONLY&lt;/strong&gt; point of crypto. &lt;/p&gt;\n\n&lt;p&gt;Crypto has so many comparable non-crypto centralised alternatives, which can provide the same features. Here is a small list of features that crypto can offer, and a centralised/non-crypto alternative:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Store of Value - Gold&lt;/li&gt;\n&lt;li&gt;Transfer of money - PayPal/CashApp/Payoneer&lt;/li&gt;\n&lt;li&gt;Yield products - Bonds/Some investment trusts&lt;/li&gt;\n&lt;li&gt;Investment opportunities - Stock market&lt;/li&gt;\n&lt;li&gt;NFTs - ownership papers&lt;/li&gt;\n&lt;li&gt;Privacy - Cash (admittedly weak, I’m not an XMR shill I promise)&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;I’m sure I’m missing a few, but my point is that one can access all of these features in a centralised manner. What crypto offers is the ability to access all of these features in a trustless way. I.e. You no longer rely on PayPal to “allow” you to send and withdraw money, it is all done by the network instead. The only differentiating factor between these centralised options and crypto is that crypto does not rely on companies/middle men.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;All other features of a crypto, say fast speed, low fees,  and any other great technical advancements, are just a means to make the decentralised product better, but are not the main feature by any means.&lt;/strong&gt; &lt;/p&gt;\n\n&lt;p&gt;Take BTC. It sits at #1 because it is the best store of value of any crypto, but the reason it has any value in the first place is because it is decentralised. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Decentralisation gives fundamental value, other features enhance that value.&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 213,
  "permalink": "/r/CryptoCurrency/comments/rpji8h/decentralisation_is_the_only_point_of_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "rpji8h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "There has been a bit of a debate on this subreddit about the role of\ndecentralisation in crypto. I believe that decentralisation is the ONLY point of\ncrypto.\n\nCrypto has so many comparable non-crypto centralised alternatives, which can\nprovide the same features. Here is a small list of features…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブレディットでは、以下の役割についてちょっとした議論が交わされています。\n暗号における非中央集権 私は分散化が暗号の唯一のポイントだと考えています\nクリプトです。\n\n暗号には、暗号以外の中央集権的な代替手段が非常に多くあり、それらは\n同じ機能を提供する 以下は、その機能の小さなリストです...",
      "title": "分散化こそ暗号のオンリーワンポイント"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在这个分论坛上，关于 \"去中心化 \"的作用，已经有了一些辩论。\n去中心化在加密货币中的作用。我认为，去中心化是加密货币的唯一要点。\n的唯一意义。\n\n加密货币有很多可比较的非加密货币中心化的替代品，它们可以\n提供同样的功能。下面是一个小的功能列表...",
      "title": "去中心化是加密货币的唯一要点"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在這個分論壇上，關於 \"去中心化 \"的作用，已經有了一些辯論。\n去中心化在加密貨幣中的作用。我認爲，去中心化是加密貨幣的唯一要點。\n的唯一意義。\n\n加密貨幣有很多可比較的非加密貨幣中心化的替代品，它們可以\n提供同樣的功能。下面是一個小的功能列表...",
      "title": "去中心化是加密貨幣的唯一要點"
    }
  ]
}