{
  "author": "mingkonng",
  "original_created_utc": 1637781393,
  "title": "So. I got hacked today.",
  "created_utc": 1637815614,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>EDIT: I was scammed, not hacked, as someone has pointed out.</p>\n\n<p>I got <del>hacked</del>  scammed today.  It fucking sucks.  Here&#39;s what happened - hopefully others will learn from my dumb ass mistakes.</p>\n\n<p>A week ago I moved some money into a defi protocol.  Wonderland.  While moving things around and connecting my wallet it seems I was the victim of a phishing scam and I allowed access to my wallet to a site I didn&#39;t recognize.  I was already on a few sites that had connections to my wallet and assumed it was one of them asking for something.  Apparently I clicked yes when my metamask asked for connection to another site.  I had figured it was just one of the others that I was already on... traderjoe, wonderland and abracadabra.  I also connected it to DeBank.</p>\n\n<p>This morning I found the funds were all gone and transferred to this wallet:</p>\n\n<p>0x34b58707e43904137ea1f8cd1d554571f650e8c2</p>\n\n<p>This person has been stealing funds from a lot of people it seems.</p>\n\n<p>Thankfully I only lost about 5k but it still hurts.  That&#39;s a good chunk of my hard earned money and really all the throw away cash I had for defi experiments.  It was clearly my fault.</p>\n\n<p>Security wise I do use random generated passwords stored in a bitwarden account.  I have avast and have never had a virus / malware positive hit on my computer.  I had multiple accounts on this metamask wallet but only one was looted leading me to the conclusion they did not have my passwords.  I have since disconnected the wallets to all sites now.  Unfortunately I panicked and disconnected them before I could identify which connection was the phishing attack.  If anyone has info that could help me see what it was connected to when it happened I would be thankful for that.</p>\n\n<p>I have been aware of hardware wallets for basically forever and am a total fool for not getting and using one.  I&#39;ve ordered a Ledger Nano S to help keep me safe in the future.</p>\n\n<p>Please, learn this expensive lesson from me and not from your own wallet.  Get a hardware ledger or use multisignature on your wallet.  Keep an eye on all connections and remove them when they are no longer necessary.</p>\n\n<p>This fucking sucks.  I&#39;m so angry at myself.  This is going to be a terrible thanksgiving.</p>\n\n<p>Anyway... rant over.  I hope at least someone can learn from this and not have it happen to them.  Any further advice I am happy to hear.</p>\n\n<p>Good luck out there...</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/r1ctpl/so_i_got_hacked_today/",
  "subreddit": "CryptoCurrency",
  "id": "r1ctpl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "EDIT: I was scammed, not hacked, as someone has pointed out.\n\nI got hacked scammed today. It fucking sucks. Here's what happened - hopefully\nothers will learn from my dumb ass mistakes.\n\nA week ago I moved some money into a defi protocol. Wonderland. While moving\nthings around and connecting my…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "EDIT: 誰かが指摘していたように、私はハッキングされたのではなく、詐欺にあったのです。\n\n今日、ハッキングされて詐欺にあったんだ。最悪です。何が起こったのかをご紹介します - うまくいけば\n他の人が私の馬鹿げた失敗から学んでくれることを願っています。\n\n一週間前、私はいくつかのお金をdefiプロトコルに移しました。ワンダーランドです。移動しながら\n物を移動させて、接続して...",
      "title": "今日、ハッキングされました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "编辑：我是被骗了，不是被黑了，有人指出了这一点。\n\n我今天被黑客诈骗了。这真他妈的糟透了。下面是发生的事情--希望\n其他人能从我的蠢蛋错误中学习。\n\n一个星期前，我把一些钱转到了一个defi协议中。Wonderland。在移动\n东西和连接我的...",
      "title": "所以，我今天被黑了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "編輯：我是被騙了，不是被黑了，有人指出了這一點。\n\n我今天被黑客詐騙了。這真他媽的糟透了。下面是發生的事情--希望\n其他人能從我的蠢蛋錯誤中學習。\n\n一個星期前，我把一些錢轉到了一個defi協議中。Wonderland。在移動\n東西和連接我的...",
      "title": "所以，我今天被黑了。"
    }
  ]
}