{
  "author": "Dwigt_Schroot",
  "the_new_excerpt": "Link\n[https://www.theverge.com/2021/4/12/22375759/intel-mobileye-udelv-autonomous-vehicle-delivery-2023]\n\nMobileye, the company that specializes in chips for vision-based autonomous\nvehicles, announced that it will launch a full-scale, fully driverless delivery\nservice starting in 2023. The company,…",
  "original_created_utc": 1618242555,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "リンク\n[https://www.theverge.com/2021/4/12/22375759/intel-mobileye-udelv-autonomous-vehicle-delivery-2023]\n\nビジョンベースの自律走行車用チップに特化した企業であるモービルアイは\nMobileye社は、2023年から本格的な完全無人運転の配送サービスを開始すると発表しました。\n2023年から本格的なドライバーレス配送サービスを開始すると発表しました。同社は、...",
      "title": "インテルのモービルアイは、2023年に完全なドライバーレスの配送サービスを開始する。Mobileye社はスタートアップのUdelv社と協力して3万5千台の配送車を製造している"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "链接\n[https://www.theverge.com/2021/4/12/22375759/intel-mobileye-udelv-autonomous-vehicle-delivery-2023]\n\nMobileye，是一家专门为基于视觉的自主研发芯片的公司。\n车辆，宣布将推出全面的、完全无人驾驶的送达。\n2023年开始的服务。该公司，...",
      "title": "英特尔的Mobileye将在2023年推出完全无人驾驶的送货服务。Mobileye正在与初创公司Udelv合作，制造3.5万辆送货车辆。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "鏈接\n[https://www.theverge.com/2021/4/12/22375759/intel-mobileye-udelv-autonomous-vehicle-delivery-2023]\n\nMobileye，是一家專門爲基於視覺的自主研發芯片的公司。\n車輛，宣佈將推出全面的、完全無人駕駛的送達。\n2023年開始的服務。該公司，...",
      "title": "英特爾的Mobileye將在2023年推出完全無人駕駛的送貨服務。Mobileye正在與初創公司Udelv合作，製造3.5萬輛送貨車輛。"
    }
  ],
  "title": "Intel’s Mobileye will launch a fully driverless delivery service in 2023. Mobileye is working with the startup Udelv to manufacture 35,000 delivery vehicles",
  "created_utc": 1618253274,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.theverge.com/2021/4/12/22375759/intel-mobileye-udelv-autonomous-vehicle-delivery-2023\">Link</a></p>\n\n<p>Mobileye, the company that specializes in chips for vision-based autonomous vehicles, announced that it will launch a full-scale, fully driverless delivery service starting in 2023. The company, a subsidiary of Intel, is joining forces with self-driving delivery startup Udelv to run this new service.</p>\n\n<p>Deliveries will be made using a new type of cabin-less vehicle called The Transporter. While manufacturing plans are still in flux, Mobileye and Udelv say they will produce 35,000 Transporters between 2023–2028 — a signal of their seriousness to launch a driverless delivery system at scale.</p>\n\n<p>“This is a real commercial deployment,” Jack Weast, vice president of automated vehicle standards at Mobileye, told The Verge. “Thirty-five thousand units starting in 2023 that will fully integrate our self driving system for commercial use for automated goods delivery.”</p>\n\n<p>“This is a real commercial deployment”</p>\n\n<p>Mobileye’s turn-key self-driving system features a full-sensor suite of 13 cameras, three long-range LiDARs, six short-range LiDARs, and six radar. It also includes the Israeli company’s EyeQ system-on-a-chip and a data crowdsourcing program called the Road Experience Management, or REM, which uses real-time data from Mobileye-equipped vehicles to build out a global 3D map.</p>\n\n<p>The company is also testing autonomous vehicles in a variety of cities around the world for the eventual launch of a robotaxi service and has said it would bring its technology to personally owned consumer vehicles by 2025 as well.</p>\n\n<p>“The design of our self driving systems is based on this concept called true redundancy,” Weast said. “Unlike most everyone else, where you need to have your radar, LIDAR, and camera operating in perfect unison in order to operate, we have independent subsystems between our camera systems alone, and then the radar and LIDAR subsystems alone. ...If either one of the subsystems is unable to properly detect an object, the other one will be able to. Then you can provide a better, safer experience.”</p>\n\n<p>Udelv is an interesting choice for a partner for Mobileye. One of the few AV startups that has yet to be acquired by a larger company, Udelv has been testing autonomous delivery vans in a variety of markets across the US over the last few years, including Oklahoma City, Arizona, and the Bay Area in California. Udelv said it has completed 20,000 deliveries for merchants in the cities where it has operations.</p>\n\n<p>The company currently uses retrofitted cargo vans to make its deliveries, but starting in 2023, it will start to roll out the cabin-less Transporters as part of its deal with Mobileye. The Transporter is an electric delivery vehicle without room for human drivers, similar to the drone vehicles we’ve seen from companies like Nuro and Einride. The vehicle is built on a modular electric platform, or skateboard, that can be adjusted to fit a variety of vehicle chassis.</p>\n\n<p>The Transporter is an electric delivery vehicle without room for human drivers</p>\n\n<p>Udelv isn’t releasing some pertinent specs for the Transporter, like range, battery size, or the overall weight of the vehicle. The vehicle will be compatible with DC fast charging and will have a top speed of 65 mph. A spokesperson said that Udelv will announce its manufacturing plans for the Transporter at a later date.</p>\n\n<p>While the Transporter will be fully autonomous, it won’t be completely alone in the wilderness. Udelv says the vehicle will have ultra-low-latency teleoperation capabilities, meaning a remote operator can offer a prompt to the vehicle if it gets tripped up.</p>\n\n<p>That said, Weast said the Mobileye / Udelv delivery service won’t be limited by geography when it launches in 2023 — meaning it will be able to drive wherever it needs, in all types of conditions.</p>\n\n<p>“What this announcement really underscores is the commercial maturity and readiness of the Mobileye self driving system solution,” he said. “It is ready to scale at large, across tens of thousands of vehicles, multiple states, all the retail store partners in all cities, not geofenced or limited in any way.”</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/investing/comments/mpgnog/intels_mobileye_will_launch_a_fully_driverless/",
  "subreddit": "investing",
  "id": "mpgnog",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566617805
}