{
  "author": "007happyguy",
  "original_created_utc": 1626088351,
  "title": "If you want to join me in watching metamask account get robbed by some asshole look below",
  "created_utc": 1626096645,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My metamask wallet number is 0xc97603fc31d6e96C2A145EC44B369d5263470279</p>\n\n<p>Some bustard who tricked me into clicking on a dodgy link (pretending to be tech support for SNX on discord) has taken half my wallet so far (about $130k). The rest is still there but disappearing slowly in front of my eyes.</p>\n\n<p>You can see all the transactions from this morning how he/she is cleaning up.</p>\n\n<p>Unfortunately there doesn&#39;t seem to be anything I can do other than jumping on the occasional ETH transfer they are making in so I can sweep it out.</p>\n\n<p>The only reason I haven&#39;t shared my secret phrase with the whole world is a quiet hope I might one day get it back. But if  that&#39;s never going to happen maybe I should share it with you all. After all it would amuse me if someone else steals it before @scofield#0471 takes it all.....</p>\n\n<p>EDIT: </p>\n\n<p>I can see people asking why am I not moving the coins out. The answer is I really, really, really tried. \nHowever there seems to be script which instantly transfer the coins to a different wallet, no matter what I type in for gas fees or the address. So far I failed on ALCX, on YFI, on SLP, on AAVE - so I have given up as I don’t know what to do a setting up a script myself is beyond my abilities. Whenever I add in ETH, all it does is makes its easier to the bastard to take my coins. So all I can literally do is watch right now.</p>\n\n<p>SECOND EDIT</p>\n\n<p>I was sent a link to a site which was going to validate my MM extension. The site looked real enough that I clicked on it and entered my security phrase. That was where I suddenly blew up 6 years worth of HODLing in one go….</p>\n</div><!-- SC_ON -->",
  "score": 405,
  "permalink": "/r/CryptoCurrency/comments/oip4mi/if_you_want_to_join_me_in_watching_metamask/",
  "subreddit": "CryptoCurrency",
  "id": "oip4mi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My metamask wallet number is 0xc97603fc31d6e96C2A145EC44B369d5263470279\n\nSome bustard who tricked me into clicking on a dodgy link (pretending to be tech\nsupport for SNX on discord) has taken half my wallet so far (about $130k). The\nrest is still there but disappearing slowly in front of my…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私のmetamaskウォレット番号は0xc97603fc31d6e96C2A145EC44B369d5263470279です。\n\n騙されて怪しいリンクをクリックしてしまった人がいます（discordでSNXの技術サポートのふりをして）。\nこれまでに私の財布の半分（約13万円）を奪いました。残りの\n残りはまだそこにありますが、私の目の前でゆっくりと消えていきます...。",
      "title": "私と一緒にmetamaskアカウントがどこかのアホに奪われるのを見たい方は以下をご覧ください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的metamask钱包号码是0xc97603fc31d6e96C2A145EC44B369d5263470279\n\n某个骗子骗我点击了一个可疑的链接（假装是SNX的技术\n的技术支持），到目前为止已经拿走了我一半的钱包（大约13万美金）。其余的\n剩下的还在那里，但在我面前慢慢消失了。",
      "title": "如果你想和我一起观看metamask账户被一些混蛋抢劫，请看下面的内容"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的metamask錢包號碼是0xc97603fc31d6e96C2A145EC44B369d5263470279\n\n某個騙子騙我點擊了一個可疑的鏈接（假裝是SNX的技術\n的技術支持），到目前爲止已經拿走了我一半的錢包（大約13萬美金）。其餘的\n剩下的還在那裏，但在我面前慢慢消失了。",
      "title": "如果你想和我一起觀看metamask賬戶被一些混蛋搶劫，請看下面的內容"
    }
  ]
}