{
  "author": "CrispitoDay",
  "the_new_excerpt": "I’m married to an educator at a title one school. She got her state standardized\ntest results back and actually had the highest scores amongst teachers in her\ngrade with a 48% class average. I don’t mean to sound like an old man, but\ntwenty years ago when I was her students’ age I remember vividly…",
  "original_created_utc": 1619125623,
  "title": "Why aren’t students who don’t perform at grade level held back?",
  "created_utc": 1619150502,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m married to an educator at a title one school. She got her state standardized test results back and actually had the highest scores amongst teachers in her grade with a 48% class average. I don’t mean to sound like an old man, but twenty years ago when I was her students’ age I remember vividly my teachers threatening that if we don’t pass the standardized test, we don’t move on to the next grade. Is that a thing now? You can fail as much as you want, standardized or daily curriculum, and kids will still be booted on to the next grade?</p>\n\n<p>My wife has some students who have literally not turned in a single assignment this semester. She says they will be moving forward. It’s like these kids are being rewarded for not doing any work. Some of them just submit their tests unanswered. Many are at a kindergarten or lower level of reading and show no interest in improvement. </p>\n\n<p>How is this a positive message for children? Don’t do the work and you’ll still be rewarded. Some of your peers busted their asses and did the material only to earn the same rewards as the burnouts. Doesn’t this deter kids who are trying and ultimately result in some of them not working as hard? A little fear and repercussion should be good for them. “Oh if I don’t do this assignment or care then I can’t go on to the next grade with all of my friends.”</p>\n\n<p>My wife’s reasoning is that psychologically, this can be damaging on students to be held back from their peers. But that’s exactly why I think they should be, it will incentivize students to stay together as a group. She also says the major reason is funding. That’s such bull shit if true. What makes you think a kid who can’t add or subtract properly by 6th grade is going to be able to learn prealgebra in a grade or two? I feel like it can be more psychologically damaging to force students in a class where it sounds like a foreign language to them and expect them to succeed. </p>\n\n<p>Look, I’m not trying to get a bunch of students held back. I am generally interested in why this not practiced as commonly anymore and why some believe it to be psychologically damaging. I understand school can be difficult for some individuals and may need extra help. There’s no shame on that. But what I do have a problem with are students who don’t even seem to care. The ones who turn their test in blank, the ones who refuse to do any of the work, the ones who think they can just get handed rewards for doing nothing in life, why are they allowed to move ahead? Why is holding a student back really the last thing a school wants to do when it may be the best thing for that particular student’s education?</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/TrueAskReddit/comments/mweucc/why_arent_students_who_dont_perform_at_grade/",
  "subreddit": "TrueAskReddit",
  "id": "mweucc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、タイトル1校の教育者と結婚しています。彼女は州の標準化された\nテスト結果が返ってきて、実は彼女の教師の中で一番高い点数だったのです。\n学年のクラス平均は48％でした。老害と思われるかもしれませんが\n20年前、私が彼女の生徒と同じ年頃だった頃、鮮明に覚えているのは......。",
      "title": "なぜ、学年の成績が良くない生徒を引き留めないのですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我嫁给了一所一级学校的教育工作者。她得到了她的州级标准化测试结果\n她得到了她的州标准化测试结果，实际上她的分数是她所在年级的教师中最高的。\n级的教师中得分最高，班级平均分达到48%。我不想听起来像个老头子，但\n20年前，当我和她的学生同龄时，我清楚地记得...",
      "title": "为什么那些成绩不达标的学生不被留级？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我嫁給了一所一級學校的教育工作者。她得到了她的州級標準化測試結果\n她得到了她的州標準化測試結果，實際上她的分數是她所在年級的教師中最高的。\n級的教師中得分最高，班級平均分達到48%。我不想聽起來像個老頭子，但\n20年前，當我和她的學生同齡時，我清楚地記得...",
      "title": "爲什麼那些成績不達標的學生不被留級？"
    }
  ]
}