{
  "author": "emsot",
  "original_created_utc": 1660044896,
  "title": "Why was Russian spelling reform such a high priority for the Bolsheviks?",
  "created_utc": 1660053564,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Only a few months after the Russian Revolutions of 1917, the new government totally overhauled the Russian alphabet, abolishing old letters and inconsistencies.&lt;/p&gt;\n\n&lt;p&gt;Sure, the old Russian orthography was a bit of a mess, but so is English and no one&amp;#39;s got far with that in centuries of trying.&lt;/p&gt;\n\n&lt;p&gt;Out of all the life-or-death decisions you&amp;#39;d have in the first few months of overthrowing an empire and setting up the world&amp;#39;s first Communist state, why spelling?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 138,
  "permalink": "/r/AskHistorians/comments/wk1023/why_was_russian_spelling_reform_such_a_high/",
  "subreddit": "AskHistorians",
  "id": "wk1023",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Only a few months after the Russian Revolutions of 1917, the new government\ntotally overhauled the Russian alphabet, abolishing old letters and\ninconsistencies.\n\nSure, the old Russian orthography was a bit of a mess, but so is English and no\none's got far with that in centuries of trying.\n\nOut of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1917年のロシア革命からわずか数カ月で、新政府はロシアを全面的に見直した。\nロシア語のアルファベットを全面的に見直し、古い文字や不統一なものを廃止した。\nというものだった。\n\n確かに旧ロシア語の正書法は少し乱れていたが、英語も同じである。\n何世紀もの間、誰もそれをうまく使うことができなかったのです。\n\nこのような...",
      "title": "ボルシェビキにとって、なぜロシアの綴り字の改革がこれほどまでに優先されたのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "1917年俄国革命后仅几个月，新政府就对其进行了全面改革。\n彻底修改了俄罗斯字母表，废除了旧的字母和\n不一致的地方。\n\n当然，旧的俄罗斯正字法有点乱，但英语也是如此，没有人\n几个世纪以来，没有人在这方面取得过进展。\n\n摆脱了...",
      "title": "为什么俄国的拼写改革对布尔什维克来说是一个高度优先事项？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "1917年俄國革命後僅幾個月，新政府就對其進行了全面改革。\n徹底修改了俄羅斯字母表，廢除了舊的字母和\n不一致的地方。\n\n當然，舊的俄羅斯正字法有點亂，但英語也是如此，沒有人\n幾個世紀以來，沒有人在這方面取得過進展。\n\n擺脫了...",
      "title": "爲什麼俄國的拼寫改革對布爾什維克來說是一個高度優先事項？"
    }
  ]
}