{
  "author": "wtfRichard1",
  "the_new_excerpt": "Currently wfh and when I go to the kitchen if any of my family are in there I\ncannot make anything and I just go back to work angry and hungry. I’m one who\ndoes NOT sit down and eat meals with people. Rather go upstairs to my room. It\nmakes me very uncomfortable. The sound of other people chewing…",
  "original_created_utc": 1621357659,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "現在結婚していますが、キッチンに行っても家族がいれば何も作れません。\n何も作ることができず、怒りと空腹で仕事に戻ってしまいます。私は、人と一緒に\n私は人と一緒に座って食事をすることはありません。むしろ、2階の自分の部屋に行きます。私は人と一緒に座って食事をすることができません。\nとても落ち着かないのです。他の人が噛んでいる音が...。",
      "title": "料理を作ろうとしたときに、他の人がキッチンにいるとイライラする人はいませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "目前，我有妻室，当我去厨房时，如果我的家人在那里，我就不能做任何东西，我只是生气地回去工作。\n我不能做任何东西，我只是生气和饥饿地回去工作。我是一个\n不会坐下来和别人一起吃饭。宁可上楼去我的房间。这\n这让我感到非常不舒服。其他人的咀嚼声...",
      "title": "当你试图制作食物时，其他人在厨房里，这是否会刺激到其他人？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "目前，我有妻室，當我去廚房時，如果我的家人在那裏，我就不能做任何東西，我只是生氣地回去工作。\n我不能做任何東西，我只是生氣和飢餓地回去工作。我是一個\n不會坐下來和別人一起喫飯。寧可上樓去我的房間。這\n這讓我感到非常不舒服。其他人的咀嚼聲...",
      "title": "當你試圖製作食物時，其他人在廚房裏，這是否會刺激到其他人？"
    }
  ],
  "title": "Does it irritate anyone else when you try to make food and other people are in the kitchen?",
  "created_utc": 1621395879,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Currently wfh and when I go to the kitchen if any of my family are in there I cannot make anything and I just go back to work angry and hungry. I’m one who does NOT sit down and eat meals with people. Rather go upstairs to my room. It makes me very uncomfortable. The sound of other people chewing makes me want to perish. </p>\n\n<p>Is this a normal thing? I am usually negative about my life because work sucks but when I go to make something or am already making food and someone comes to disturb me it makes me irrationally angry. Nothing else really makes me that upset. </p>\n\n<p>Not sure if it is a Hispanic thing. But the thing I despise is that every time I am making something my grandma INTERFERES every time and grabs the utensil away from me. I just give up and walk away usually. Even when it’s something she doesn’t know what it is she says I’m making it completely wrong</p>\n\n<p>When I bake anything -cookies for example- I make them chewy and they’re fully cooked and my family always puts it back in the oven for 10 more minutes and ruin my cooking by burning it!!! </p>\n\n<p>Idk.. does this upset anyone else?</p>\n</div><!-- SC_ON -->",
  "score": 110,
  "permalink": "/r/NoStupidQuestions/comments/nfg585/does_it_irritate_anyone_else_when_you_try_to_make/",
  "subreddit": "NoStupidQuestions",
  "id": "nfg585",
  "is_self": true,
  "media": null,
  "is_video": false
}