{
  "author": "Noodleboom",
  "original_created_utc": 1624961375,
  "title": "How did the police procedural/drama become such a large part of TV programming?",
  "created_utc": 1625019214,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Police procedurals/dramas are a huge proportion of TV shows, and have been for decades - from episodic shows like the countless Law and Order varieties to genre hybrids like Brooklyn 99.</p>\n\n<p>How did this start? What factors contributed to this type of show being so common? How have audience demand and network programming decisions interacted?</p>\n\n<p>I&#39;m mostly familiar with Anglosphere televison, but would love to hear about the history of cop shows in non-English television as well.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/oa5ay2/how_did_the_police_proceduraldrama_become_such_a/",
  "subreddit": "AskHistorians",
  "id": "oa5ay2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Police procedurals/dramas are a huge proportion of TV shows, and have been for\ndecades - from episodic shows like the countless Law and Order varieties to\ngenre hybrids like Brooklyn 99.\n\nHow did this start? What factors contributed to this type of show being so\ncommon? How have audience demand and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "警察の手続きやドラマは、テレビ番組の中で非常に大きな割合を占めており、何十年も前からそうでした。\n数え切れないほどの「Law and Order」のようなエピソード番組から、「Brooklyn 99」のようなジャンル融合番組まで、何十年にもわたって存在している。\nブルックリン99」のようなハイブリッドなジャンルまで。\n\nこれはどのようにして始まったのですか？この種の番組がこれほど一般的になった要因は何でしょうか？\nこの種の番組がこれほど一般的になった要因は何か？視聴者の要望と、それに応えるためにはどうすればいいのか。",
      "title": "なぜ、警察ドラマがこれほどまでにテレビ番組の一部になったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "警务程序/戏剧在电视节目中占有很大的比例，几十年来一直如此。\n几十年来一直如此--从无数的法律与秩序之类的情节性节目到布鲁克林99等类型的混合节目。\n体裁的混合体，如《布鲁克林99》。\n\n这是怎么开始的？是什么因素促成了这种类型的节目如此\n导致这种类型的节目如此普遍？听众的需求和对节目的评价如何？",
      "title": "警务程序/戏剧是如何成为电视节目的一个重要部分的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "警務程序/戲劇在電視節目中佔有很大的比例，幾十年來一直如此。\n幾十年來一直如此--從無數的法律與秩序之類的情節性節目到布魯克林99等類型的混合節目。\n體裁的混合體，如《布魯克林99》。\n\n這是怎麼開始的？是什麼因素促成了這種類型的節目如此\n導致這種類型的節目如此普遍？聽衆的需求和對節目的評價如何？",
      "title": "警務程序/戲劇是如何成爲電視節目的一個重要部分的？"
    }
  ]
}