{
  "author": "M1PY",
  "the_new_excerpt": "Well, lending your workforce to an entity and gaining money in return. Sounds\nlike proof of work? It pretty much is. Bonus points if you can check your\nexchange of choice on your phone and do the occasional trade or stake during\nyour work time.\n\nPersonally looking at it that way helped me quite a…",
  "original_created_utc": 1619104026,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "まあ、自分の労働力をある団体に貸して、その見返りとしてお金を得るということですね。まるで\n仕事の証明になる？ほとんどそうですね。選んだ取引所をスマホでチェックして、たまに取引や賭けをすることができればボーナスポイントです。\nスマホで好きな取引所をチェックして、仕事の合間にたまにトレードやステイクができるとボーナスポイント。\nボーナスポイントです。\n\n個人的にはそのような見方をすることで、かなり助けられました。",
      "title": "9時から5時までの仕事は、実質的にマイニング・フィアットである"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，把你的劳动力借给一个实体并获得金钱的回报。听起来\n像工作证明？基本上是这样。如果你能在手机上查看你的\n如果你能在手机上查看你选择的交易所，并在工作时间做偶尔的交易或押注\n你的工作时间。\n\n就我个人而言，这种方式对我有很大的帮助。",
      "title": "朝九晚五的工作实际上是在开采菲亚特"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，把你的勞動力借給一個實體並獲得金錢的回報。聽起來\n像工作證明？基本上是這樣。如果你能在手機上查看你的\n如果你能在手機上查看你選擇的交易所，並在工作時間做偶爾的交易或押注\n你的工作時間。\n\n就我個人而言，這種方式對我有很大的幫助。",
      "title": "朝九晚五的工作實際上是在開採菲亞特"
    }
  ],
  "title": "A 9-5 job is practically mining fiat",
  "created_utc": 1619111460,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Well, lending your workforce to an entity and gaining money in return. Sounds like proof of work? It pretty much is. Bonus points if you can check your exchange of choice on your phone and do the occasional trade or stake during your work time.</p>\n\n<p>Personally looking at it that way helped me quite a bit, instead of loathing going to work I now see it as a necessity to be able to invest more into crypto and reach financial freedom one day.</p>\n\n<p>Cheers to those reading this at work.</p>\n</div><!-- SC_ON -->",
  "score": 7713,
  "permalink": "/r/CryptoCurrency/comments/mw6ter/a_95_job_is_practically_mining_fiat/",
  "subreddit": "CryptoCurrency",
  "id": "mw6ter",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776207023
}