{
  "author": "OWbeginner",
  "the_new_excerpt": "I'm seeing more and more posts that are clearly written by people trying to push\nthe GME/AMC narrative. I'm not passing judgment on that narrative but I don't\nthink it's relevant to cryptocurrency and I think these posts are specifically\ndesigned to mislead. They use common marketing tricks and push…",
  "original_created_utc": 1621817293,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "明らかにGME/AMCのストーリーを推し進めようとしている人が書いたと思われる投稿が増えています。\nGME/AMCの物語を押し進めようとしている人の書き込みが増えています。その物語を批判するわけではありませんが、私は暗号通貨には関係ないと思います。\n暗号通貨には関係ないと思いますし、これらの投稿は特に誤解を招くように作られていると思います。\n誤解を招くように設計されていると思います。彼らは一般的なマーケティングのトリックを使用して、プッシュ...",
      "title": "WSBの投稿や関連コンテンツをこのsubredditで禁止することを公式に決めてもいいですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我看到越来越多的帖子，这些帖子显然是由试图推动\nGME/AMC的说法。我不是要对这种说法进行评判，但我不认为它与加密货币有关。\n我认为它与加密货币无关，我认为这些帖子是专门为\n旨在误导。他们使用常见的营销伎俩，推...",
      "title": "我们是否可以正式决定禁止在这个子目录下发布WSB帖子和相关内容？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到越來越多的帖子，這些帖子顯然是由試圖推動\nGME/AMC的說法。我不是要對這種說法進行評判，但我不認爲它與加密貨幣有關。\n我認爲它與加密貨幣無關，我認爲這些帖子是專門爲\n旨在誤導。他們使用常見的營銷伎倆，推...",
      "title": "我們是否可以正式決定禁止在這個子目錄下發布WSB帖子和相關內容？"
    }
  ],
  "title": "Can we officially decide that WSB posts and related content are banned from this subreddit?",
  "created_utc": 1621834807,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m seeing more and more posts that are clearly written by people trying to push the GME/AMC narrative. I&#39;m not passing judgment on that narrative but I don&#39;t think it&#39;s relevant to cryptocurrency and I think these posts are specifically designed to mislead. They use common marketing tricks and push a vaguely plausible analysis that doesn&#39;t hold up to scrutiny mixed in with tons of supposed due diligence that backs up their definite conclusion that the entire economy is going to hell in a handbasket.</p>\n\n<p>My point is that not only does it not relate to crypto but it also consists of posts by people with a strong agenda so that&#39;s an additional reason I think they should be banned. People who really want to read their posts can go to WSB.</p>\n</div><!-- SC_ON -->",
  "score": 1346,
  "permalink": "/r/CryptoCurrency/comments/njln72/can_we_officially_decide_that_wsb_posts_and/",
  "subreddit": "CryptoCurrency",
  "id": "njln72",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197385276
}