{
  "author": "psychotrader00",
  "the_new_excerpt": "PsychoMarket Recap - Thursday, March 25, 2021\n\nStocks rose on Thursday, shaking off three consecutive days of losses in yet\nanother volatile trading session. Market participants continue to monitor recent\ncomments from Federal Reserve Chair Jerome Powell, the Treasury yield, and the\ncoronavirus…",
  "original_created_utc": 1616705371,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "心理市场回顾--2021年3月25日，星期四。\n\n周四股市上涨，摆脱了连续三天的跌势，在未\n另一个波动的交易时段。市场参与者继续关注近期的\n美联储主席杰罗姆-鲍威尔的评论，国债收益率，以及。\n冠状病毒...",
      "title": "以下是今天2021年3月25日星期四的市场回顾。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "心理市場回顧--2021年3月25日，星期四。\n\n週四股市上漲，擺脫了連續三天的跌勢，在未\n另一個波動的交易時段。市場參與者繼續關注近期的\n美聯儲主席傑羅姆-鮑威爾的評論，國債收益率，以及。\n冠狀病毒...",
      "title": "以下是今天2021年3月25日星期四的市場回顧。"
    }
  ],
  "title": "Here is a Market Recap for today Thursday, March 25, 2021",
  "created_utc": 1616720412,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>PsychoMarket Recap - Thursday, March 25, 2021</strong></p>\n\n<p>Stocks rose on Thursday, shaking off three consecutive days of losses in yet another volatile trading session. Market participants continue to monitor recent comments from Federal Reserve Chair Jerome Powell, the Treasury yield, and the coronavirus situation in Europe. </p>\n\n<p>In an interview with NPR&#39;s Morning Edition Thursday morning, Federal Reserve Chair Jerome Powell doubled down in his assertion that the Fed remained strongly committed to targeting 2% average inflation over time, and said that any eventual pullback in Fed support would be done &quot;gradually over time, and with great transparency.&quot; This is the latest in a long string of comments from Powell and other monetary officials, like Janet Yellen, that point to the maintenance of accommodative monetary policies for the foreseeable future. </p>\n\n<p>However, despite Powell’s consistency in his statements, many market participants continue to fear that coming inflationary pressures could cause the Fed to tighten monetary policy earlier than expected. Tim Quinlan, senior economist at Wells Fargo said, “This will be the first time that every country in the world is emerging from recession simultaneously. And the Fed and other policymakers are banking on this idea that it’ll be a relatively short strain on supply chains but eventually, things get up and running again and you can get the input components to where they’re most needed.” </p>\n\n<p>The 10-year benchmark Treasury yield continues to hover around 1.6%, falling from 1.75% earlier in the week. Despite the decline, the Treasury yield remains at elevated levels compared to 12 months ago, with the expectation that the yield will continue climbing as the economy reopens and recovers. Gabriela Santos, JP Morgan global strategist said, “We think long-term bond yields are just in a pit stop here in what’s going to be a multi-year move higher. Ultimately, we do continue to think that it will harm the more speculative or expensive parts of the market like tech and really benefit the more cyclical [sectors] and especially the parts of the market that can benefit from a steepening yield curve”. We agree, after the outsized growth in growth and tech stocks last year, it’s time for cyclical and reopening stocks, many that remain well below pre-pandemic levels, to recover as the economy gradually reopens.</p>\n\n<p>We agree, rising Treasury yields hurt high-growth stocks the most because these companies require a lot of capital to fund their growth and expansion and generate most of their cash and earnings years down the road. Future cash decreases in today&#39;s dollars as rates increase partly because investors have more opportunity to earn bigger returns from assets paying higher interest and dividends right now. Higher yields make it more expensive to borrow capital. It’s important to remember that despite rising yields, the benchmark 10-year yield remains at historic lows, roughly half what it was five years ago. </p>\n\n<p>Earlier in the week, German Chancellor Angela Merken announced a new five-day lockdown over Easter. She then extended the measure for a month, citing a rise in coronavirus cases and and a reduction in the availability of ICUs. UK prime minister Boris Johnson on Tuesday said the third wave currently sweeping Europe was likely to &quot;wash up on our shores.&quot; Tough new fines to deter international travel were announced on Tuesday.</p>\n\n<p>The rise in cases comes in tandem with flaring concerns regarding the safety of the AstraZeneca vaccine. Several countries have suspended the distribution of AstraZeneca’s coronavirus vaccine following reports of blood clots. Moreover, earlier in the week the, US Data and Safety Monitoring Board said AstraZeneca may have used outdated information in their report and provided an “incomplete” assessment of the efficacy of their vaccine (<a href=\"https://apnews.com/article/astrazeneca-vaccine-reputation-missteps-01332124d4c18aba556a53b1a57bcc84\">Report by the Associated Press</a>).  In a late-night news release Wednesday, AstraZeneca said it had analyzed more data from that study and concluded the vaccine is 76% effective in preventing symptomatic COVID-19, instead of the 79% it had reported earlier in the week, <a href=\"https://apnews.com/article/astrazeneca-vaccine-strong-protection-us-rift-466726258e5e546550907f123f67763d\">insisting the vaccine was “strongly effective” against the virus. </a></p>\n\n<p><strong>Highlights</strong></p>\n\n<ul>\n<li>First-time unemployment claims fell to 684,000 last week from 781,000 a week earlier. Claims are now at the lowest point since mid-March of last year.</li>\n<li>The never-ending saga continues, with shares of Gamestop (GME) jumping more than 50% today after report less-than-stellar earnings on Tuesday. Other meme stocks like AMC also gapped up in sympathy</li>\n<li>Gamestop (GME)informed the U.S. Securities and Exchange Commission Wednesday that eight members of its board are expected to depart the company, in the companies continued push to switch their business strategy. </li>\n<li>Chinese consumers and the country&#39;s ruling party have lashed out at Western clothing companies and threatened boycotts, as brands find themselves caught in the crossfire of sanctions over alleged human- rights abuses in northwest China. Nike (NKE) stock slid 4% on Thursday while shares in fellow sporting-goods retailer Adidas (ADDYY) tumbled 6%. </li>\n<li>Lordstown Motors said on Thursday that it has received a request from the Securities and Exchange Commission for information related to its merger following a report by short-seller Hindenburg Research.</li>\n<li>British electric van and bus startup Arrival Ltd will announce investments in more &quot;micro-factories&quot; throughout 2021 as it expands its global manufacturing presence, executives said on Thursday. Electric vehicle company Arrival has staged what is believed to be the biggest ever stock market listing for a UK tech company after completing its merger. Company started trading today as well.</li>\n<li><strong>**Please note that current stock price was written in the morning and does not reflect intraday changes.*\\</strong>*</li>\n<li>Accenture (ACN) target raised by Susquehanna from $290 to $325 at Positive. Stock currently around $267</li>\n<li>Aptive (APTV) target raised by Royal Bank of Canada from $168 to $174. Stock currently around $140</li>\n<li>Boeing (BA) target raised by Susquehanna from $250 to $300 at Positive. Stock currently around $239</li>\n<li>Alibaba (BABA) target raised by Truist Securities from $326 to $330 at Buy. Stock currently around $230</li>\n<li>Chipotle (CMG) target raised by Wells Fargo from $1677 to $1775 at Overweight. Stock currently around $1422</li>\n<li>Equitable (EQH) target raised by Morgan Stanley (MS) from $34 to $44 at Overweight. Stock currently around $31</li>\n<li>Fedex (FDX) with two target raises. Stock currently around $268.\n\n<ul>\n<li>Goldman Sachs from $356 to $365 ay Buy</li>\n<li>Raymond James from $305 to $310 at Outpeform</li>\n</ul></li>\n<li>Nike (NKE) with three target raises. Stock currently around $133\n\n<ul>\n<li>Royal Bank of Canada from $160 to $165 </li>\n<li>Credit Suisse from $162 to $176</li>\n<li>JP Morgan from $170 to $176</li>\n</ul></li>\n<li>Restoration Hardware (RH) with too many target upgrades to list. Consensus price target around $600 at Outperform. Stock currently around $485</li>\n</ul>\n\n<p>“In my view, the biggest investment risk is not the volatility of prices, but whether you will suffer a permanent loss of capital. Not only is the mere drop in stock prices not risk, but it is an opportunity. Where else do you look for cheap stocks? - Li Lu</p>\n</div><!-- SC_ON -->",
  "score": 110,
  "permalink": "/r/stocks/comments/md828q/here_is_a_market_recap_for_today_thursday_march/",
  "subreddit": "stocks",
  "id": "md828q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357141511
}