{
  "author": "Mr_JerryS",
  "the_new_excerpt": "First off, if you've been living under a rock and don't know what Alibaba is,\nhere's a video about what the company does from CNN Business.\nhttps://www.cnn.com/videos/business/2021/05/21/marketplace-asia-alibaba-cainiao.cnnbusiness\n\n\n\nAlibaba, the mega-cap Chinese conglomerate has had a rough 3…",
  "original_created_utc": 1621690778,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "まず、岩の下に住んでいてアリババを知らない人のために、CNNビジネスからアリババについてのビデオを紹介します。\nCNN Businessのビデオで、アリババの活動をご覧ください。\nhttps://www.cnn.com/videos/business/2021/05/21/marketplace-asia-alibaba-cainiao.cnnbusiness\n\n\n\n中国のメガキャップコングロマリットであるアリババは、この3年間、厳しい状況に置かれていました。",
      "title": "BABAは今、50％のアップサイドを持つバリュー・ストックである。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "首先，如果你一直生活在岩石下，不知道阿里巴巴是什么。\n这里有一段来自CNN Business的关于该公司的视频。\nhttps://www.cnn.com/videos/business/2021/05/21/marketplace-asia-alibaba-cainiao.cnnbusiness\n\n\n\n阿里巴巴，这个巨大的中国企业集团有一个艰难的3年...。",
      "title": "BABA现在是一只具有50%上涨空间的价值股--是时候装上了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，如果你一直生活在岩石下，不知道阿里巴巴是什麼。\n這裏有一段來自CNN Business的關於該公司的視頻。\nhttps://www.cnn.com/videos/business/2021/05/21/marketplace-asia-alibaba-cainiao.cnnbusiness\n\n\n\n阿里巴巴，這個巨大的中國企業集團有一個艱難的3年...。",
      "title": "BABA現在是一隻具有50%上漲空間的價值股--是時候裝上了"
    }
  ],
  "title": "$BABA is Now A Value Stock with 50% Upside - Time to Load Up",
  "created_utc": 1621704978,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>First off, if you&#39;ve been living under a rock and don&#39;t know what Alibaba is, here&#39;s a video about what the company does from CNN Business. <a href=\"https://www.cnn.com/videos/business/2021/05/21/marketplace-asia-alibaba-cainiao.cnnbusiness\">https://www.cnn.com/videos/business/2021/05/21/marketplace-asia-alibaba-cainiao.cnnbusiness</a></p>\n\n<p>&#x200B;</p>\n\n<p>Alibaba, the mega-cap Chinese conglomerate has had a rough 3 months. After for CEO Jack Ma ticked off the CCP, the company was slapped with billions in anti-competitive fines and then the U.S. is pushing for all Chinese stocks on the U.S. markets be audited using U.S. standards. This has caused the stock to drop from it&#39;s highs of $319 to just $210 as of Friday. I normally stay away from Chinese stocks, but I loaded up shares at $212 after these two firms took large positions at the $225-$245 range...Generation Investment Management (founded by former VP Al Gore) and the Daily Journal (led by Charlie Munger....Warren Buffet&#39;s right hand man.)</p>\n\n<p>&#x200B;</p>\n\n<p>Why do I care about these two firms? Well Al Gore&#39;s firm based out of London mainly invests in companies that cause no harm to the environment, something I like to hear. Gore&#39;s firm nearly DOUBLED their position in $BABA in Q1. $BABA had just reported its first ever loss after the CCP slapped it with anti-competitive fines of over 18 billion yes (3.6b U.S.) causing fear that additional actions could be taken. In addition to the fines, the U.S. wants all Chinese companies listed in the U.S. to undergo audits according to U.S. accounting practices. At the time, it seemed the bad news was baked in and the behemoth had reached rock bottom. Now after the recent selloff in stocks, $BABA sits at $210, just 10% off it&#39;s 52 week low.</p>\n\n<p>&#x200B;</p>\n\n<p>Now what REALLY caused me to go all in was reading that <a href=\"https://finance.yahoo.com/news/charlie-mungers-daily-journal-buys-162550289.html?guccounter=1&amp;guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&amp;guce_referrer_sig=AQAAAANWUgsT5pGhYhcHBDH3BmAeqjyPDiJhY46k1tJyHfgxNp1KXjoNUp_RUeUxc9964F9DRudOxJfqmOg2xTb0Bce561ukNR_6nLr7xj7-zvq7G6DV89DfgNfLOnzdtlnrj47ITxpu0SSCY4sEXz9qyDqqkh7JsvoXakKYZtyYt7dK\">Munger had put in an investment that represented nearly 20% of the Daily Journal&#39;s portfolio</a>! First off, the Daily Journal only holds 5 stocks...(in order) $BAC, $WFC, $BABA, $USB, and $POSCO.  For Munger to invest (and make it his 3rd largest holding), he and his team must view that stock as EXTREMELY undervalued. For a wide-moat mega-cap stock to have a 50% upside (<a href=\"https://finance.yahoo.com/quote/BABA/\">52 analyst price targets</a>), the current price is truly insane. In their view, a company with 91% penetration in the internet services, streaming, fintech, retail, and cloud storage (they&#39;re currently investing HEAVILY into this sector...similar to Amazon) that trades at a mere 26x earnings yet is growing at a CAGR of 18% is simply too good to pass up.</p>\n\n<p>&#x200B;</p>\n\n<p>In short, there are times when investing seems easy. As Buffett says &quot;We simply attempt to be greedy when others are fearful, and fearful when others are greedy.&quot; $BABA fear has been baked in, and now I plan to back up the truck.</p>\n</div><!-- SC_ON -->",
  "score": 201,
  "permalink": "/r/stocks/comments/niiukt/baba_is_now_a_value_stock_with_50_upside_time_to/",
  "subreddit": "stocks",
  "id": "niiukt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197389724
}