{
  "author": "vjeva",
  "the_new_excerpt": "Elon this, Elon that, Elon pumps Dogecoin, Elon dumps Dogeocoin. One whale gets\nrich, 10 ordinary people get burned. Bla...Bla...Bla....\n\nIf you want to get rich fast and without any research or know-how how blockchain\nor a particular crypto project works, then rather go to the nearest casino…",
  "original_created_utc": 1620731413,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "イーロンがこれを、イーロンがあれを、イーロンがDogecoinをポンプして、イーロンがDogeocoinをダンプする。1匹のクジラが金持ちになり\n10人の普通の人が焼かれる。Bla...Bla...Bla....\n\nブロックチェーンや特定の暗号プロジェクトがどのように機能するかを研究したり、ノウハウを持たずに、早く金持ちになりたいのであれば\nや特定の暗号プロジェクトがどのように機能するかについての研究やノウハウを持たずに、手っ取り早く金持ちになりたいのであれば、むしろ近くのカジノに行きましょう...。",
      "title": "イーロンがツイートしたことで誰かが炎上したとしても気にしません。少しも気にしていません。あなたのF***ingリサーチをしてください"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "埃隆这个，埃隆那个，埃隆抽走Dogecoin，埃隆甩掉Dogeocoin。一头鲸鱼发了\n发财，10个普通人被烧死。Bla...Bla...Bla....\n\n如果你想快速致富，而且不需要研究或了解区块链的运作方式\n或某一加密货币项目的运作，那么宁愿去最近的赌场......",
      "title": "我不在乎有人因为埃隆的推特而被烧死。一点也不关心。做好你的F****研究!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "埃隆這個，埃隆那個，埃隆抽走Dogecoin，埃隆甩掉Dogeocoin。一頭鯨魚發了\n發財，10個普通人被燒死。Bla...Bla...Bla....\n\n如果你想快速致富，而且不需要研究或瞭解區塊鏈的運作方式\n或某一加密貨幣項目的運作，那麼寧願去最近的賭場......",
      "title": "我不在乎有人因爲埃隆的推特而被燒死。一點也不關心。做好你的F****研究!"
    }
  ],
  "title": "I don't care if somebody got burned because Elon tweeted about it. Not even a little. Do your F***ing Research!",
  "created_utc": 1620751576,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Elon this, Elon that, Elon pumps Dogecoin, Elon dumps Dogeocoin. One whale gets rich, 10 ordinary people get burned. Bla...Bla...Bla....</p>\n\n<p>If you want to get rich fast and without any research or know-how how blockchain or a particular crypto project works, then rather go to the nearest casino and throw your hard or easy earned money into red or black or be special and do a green all in. </p>\n\n<p>If you want to invest in crypto, learn and research. Believe me, it won&#39;t take much time. Take a month, and take each day 30-60 minutes, learn the basics, get some info. After a month you will create a list of potential coins and projects that have a future. Pick the ones that are promising and that make sense. Invest into it. </p>\n\n<p>If you love trading, then take another 30 days and 30-60min and learn the pro and cons of day trading, if that is complicated, then just please, please just HODL and thank yourself in a couple of years when you buy a Tesla from Elon.</p>\n</div><!-- SC_ON -->",
  "score": 989,
  "permalink": "/r/CryptoCurrency/comments/n9uj62/i_dont_care_if_somebody_got_burned_because_elon/",
  "subreddit": "CryptoCurrency",
  "id": "n9uj62",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985992426
}