{
  "author": "redditsgarbageman",
  "original_created_utc": 1628125573,
  "title": "I gotta say, today was a good day.",
  "created_utc": 1628134352,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m sure nobody remembers, but I posted awhile back about selling crypto for surgery. I did that, it worked out, I recovered pretty well. Not perfect, but a big improvement. In general, the last 18 months have sucked pretty bad.</p>\n\n<p>Then today happened. I woke up to an email of a new job offer. It&#39;s a good job, in the field I recently graduated for, and in a location I think I&#39;ll be happy with. Fucking awesome.</p>\n\n<p>Then I&#39;m out to lunch with my fiance to celebrate the good news and she has a surprise to show me. As a celebration for getting the job, she personally bought back a small portion of the crypto I sold. She has never used crypto, at all, and opened a coinbase wallet and bought all the coins she remembered I talked about. She didn&#39;t get them all, but again, fucking awesome.</p>\n\n<p>Then the icing on the cake was getting that sweet MOON distribution today. Feels like Christmas. With my MOON and what my fiance bought back, my crypto balance is nearly as high as it was before I sold. I haven&#39;t had this much good fortune rain on me in a single day in a very long time. </p>\n\n<p>I hope all of you are experiencing some good fortune in your life as well, and if not, hang in there. Things can turn around in an instant when you least expect it.</p>\n</div><!-- SC_ON -->",
  "score": 252,
  "permalink": "/r/CryptoCurrency/comments/oy6tby/i_gotta_say_today_was_a_good_day/",
  "subreddit": "CryptoCurrency",
  "id": "oy6tby",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm sure nobody remembers, but I posted awhile back about selling crypto for\nsurgery. I did that, it worked out, I recovered pretty well. Not perfect, but a\nbig improvement. In general, the last 18 months have sucked pretty bad.\n\nThen today happened. I woke up to an email of a new job offer. It's a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "誰も覚えていないと思いますが、私はしばらく前に、手術のために暗号を売ることについて投稿しました。\n手術をしました。私はそれを実行しましたが、うまくいき、かなり回復しました。完璧ではありませんが、大きな改善が\n大きく改善しました。一般的に、この1年半はかなりひどいものでした。\n\nそんな中、今日がやってきました。目覚めたら、新しい仕事のオファーのメールが届いていました。それは...",
      "title": "今日はいい一日だったと言わざるを得ない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我相信没有人记得，但我在前段时间发布了关于出售加密货币用于\n手术。我这样做了，成功了，我恢复得很好。不是很完美，但有\n进展很大。总的来说，过去18个月的情况非常糟糕。\n\n然后今天发生了。我一觉醒来，收到了一封新工作邀请的电子邮件。这是个...",
      "title": "我得说，今天是个好日子。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我相信沒有人記得，但我在前段時間發佈了關於出售加密貨幣用於\n手術。我這樣做了，成功了，我恢復得很好。不是很完美，但有\n進展很大。總的來說，過去18個月的情況非常糟糕。\n\n然後今天發生了。我一覺醒來，收到了一封新工作邀請的電子郵件。這是個...",
      "title": "我得說，今天是個好日子。"
    }
  ]
}