{
  "author": "Vehn2",
  "the_new_excerpt": "I wanted to show a website I've been making over the past year, that helps me\nwith both day trading and swing trading (either equity or options). I have a\nfull time job so trying to effectively day trade can be quite difficult. However\nwith this site, I can spend just ten seconds entering in a trade…",
  "original_created_utc": 1616879292,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我想展示一下我在过去一年里做的一个网站，它帮助我。\n与日间交易和波段交易（无论是股票还是期权）。我有一个\n全职工作，所以想有效地进行日间交易是相当困难的。然而\n有了这个网站，我只需要花十秒钟就可以进入交易... ...",
      "title": "我做了一个网站来帮助日间/回转交易。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想展示一下我在過去一年裏做的一個網站，它幫助我。\n與日間交易和波段交易（無論是股票還是期權）。我有一個\n全職工作，所以想有效地進行日間交易是相當困難的。然而\n有了這個網站，我只需要花十秒鐘就可以進入交易... ...",
      "title": "我做了一個網站來幫助日間/迴轉交易。"
    }
  ],
  "title": "Website I've made to help day/swing trade",
  "created_utc": 1616903073,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I wanted to show a website I&#39;ve been making over the past year, that helps me with both day trading and swing trading (either equity or options). I have a full time job so trying to effectively day trade can be quite difficult. However with this site, I can spend just ten seconds entering in a trade idea, and the site will execute it from start to finish (buying it, setting a stop market, setting limit sells, dragging stops up in profit). No more staring at charts and rapidly putting in orders throughout the day. And no more rule breaking and dealing with other emotions, as it always stops you out appropriately, and takes profit along the way, and leaves runners.</p>\n\n<p>Here is screenshot of the site, along with a description of the features - </p>\n\n<p><a href=\"https://i.ibb.co/q1X6FgG/site.png\">https://i.ibb.co/q1X6FgG/site.png</a></p>\n\n<p>Some questions I have to the community here:</p>\n\n<ul>\n<li>Does anyone have any improvements / critiques for the site? All of the features I&#39;ve both come up with myself, and developed myself, but I&#39;m sure there are many things I could implement to have it trade even better.</li>\n<li>If given the chance, would you use this on your own account (or use it on an account that paper trades to try it out)? It is NOT available now, and won&#39;t be for another several months+ (see edit below)</li>\n<li>I&#39;d be interested in getting another node.js web developer to help contribute. chat with me and we can talk more. I would estimate that only 25% of the features are implemented at this point, with the feature I most look forward to being taking trades automatically (either copying other people that you follow in the site, or copying twitter/discord/slack people that you follow). The more features that are done, the more $ the user makes.</li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 63,
  "permalink": "/r/stocks/comments/memqgs/website_ive_made_to_help_dayswing_trade/",
  "subreddit": "stocks",
  "id": "memqgs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357141540
}