{
  "author": "OlyBomaye",
  "the_new_excerpt": "I want you to understand this. Truly.\n\nI like GameStop. I like $GME. I believe in the long term plan (or what I/we\nthink is the plan, anyway). I bought a Pro Membership and have put in orders\nthrough the app I downloaded. I think they'll kill 4Q earnings in March.\n\nI THINK GAMESTOP IS A GOOD…",
  "original_created_utc": 1612766941,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我想让你明白这一点。真的\n\n我喜欢GameStop 我喜欢$GME。我相信长期计划（或者说我/我们的\n认为是计划，反正）。) 我买了一个专业的会员，并已把订单\n通过我下载的应用。我认为他们会在3月杀入4Q财报。\n\n我认为GAMESTOP是一个好... ...",
      "title": "致猿帮。为什么情绪会对你不利？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想讓你明白這一點。真的\n\n我喜歡GameStop 我喜歡$GME。我相信長期計劃（或者說我/我們的\n認爲是計劃，反正）。) 我買了一個專業的會員，並已把訂單\n通過我下載的應用。我認爲他們會在3月殺入4Q財報。\n\n我認爲GAMESTOP是一個好... ...",
      "title": "致猿幫。爲什麼情緒會對你不利？"
    }
  ],
  "title": "To Ape Gang: Why Sentiment Has Turned Against You",
  "created_utc": 1612795966,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I want you to understand this.  Truly.</p>\n\n<p>I like GameStop.  I like $GME.  I believe in the long term plan (or what I/we think is the plan, anyway).  I bought a Pro Membership and have put in orders through the app I downloaded.  I think they&#39;ll kill 4Q earnings in March.</p>\n\n<p>I THINK GAMESTOP IS A GOOD COMPANY.  I think Cohen and his team bring something to the table that will truly turn around the company.  I think CNBC and particularly Melissa Lee can go suck an egg with their dismissiveness of the bull case, which they barely even pretend to have considered.  I think the stock was and has been manipulated as fuck.</p>\n\n<p>My personal belief, which I require nobody else to share, is that Ryan Cohen and gang also still have more buying to do, and their buying alone will drive the price up.  But my belief is that they have no interest in buying at this price, or they&#39;d have done so.  I believe they&#39;re waiting for the price to fall back toward the fair market value.  And I believe they may force the issue by issuing more shares.  That&#39;s what I believe, and why I&#39;m not holding positions right now.  I probably will in the future, but my personal opinion is the time is not right.</p>\n\n<p>I wrote these posts:</p>\n\n<p><a href=\"https://www.reddit.com/r/wallstreetbets/comments/l6n4lj/on_leverage_supply_demand_how_we_got_here_gme/\">https://www.reddit.com/r/wallstreetbets/comments/l6n4lj/on_leverage_supply_demand_how_we_got_here_gme/</a></p>\n\n<p><a href=\"https://www.reddit.com/r/wallstreetbets/comments/l6rsol/heres_the_letter_i_wrote_to_my_congressman/\">https://www.reddit.com/r/wallstreetbets/comments/l6rsol/heres_the_letter_i_wrote_to_my_congressman/</a></p>\n\n<p>I want to see people make money on this.  Better yet, I WOULD LIKE TO MAKE MONEY ON THIS.</p>\n\n<p>Further, what Robinhood did, as well as Webull, Interactive Brokers, E*Trade, EToro, and tons of other brokerages did, <strong><em>was fucked up.  Everybody here agrees.</em></strong></p>\n\n<p>But you guys are actually fucking insane.  We dont have a problem with the stock.  We have a problem with YOU.</p>\n\n<p>Many of the people who have joined WSB in the past two weeks are brand new to investing.  And that&#39;s okay!  But the new people (7 million new versus 1.5 million old) have done the following:</p>\n\n<ul>\n<li>Spent weeks downvoting every single ticker besides GME, AMC, BB, and NOK\n\n<ul>\n<li>Failed to realize there is no short squeeze on BB or NOK</li>\n<li>Failed to realize the NOK spam was purely from bots\n\n<ul>\n<li>While you&#39;ve realized there were bots that were bought, you missed (probably because you were spamming rocket emojis and gorillas) that the bots were spamming NOK.</li>\n</ul></li>\n<li>Continually asked what stock WE are going to MANIPULATE next</li>\n</ul></li>\n<li>Tried to educate the crowd on terminology you just google ten minutes earlier.\n\n<ul>\n<li>I saw one person disagreeing with a long-time and well-respected poster here by telling other Apes to ignore that post, and to instead read a copied and pasted two paragraph blurb from investopedia that explained the effect of a stock split on a short position.<br/></li>\n</ul></li>\n<li>Made up securities laws and terminology that doesn&#39;t actually exist\n\n<ul>\n<li>Short ladders?  Every time a price falls from a peak it&#39;s a short ladder?  EVERY TIME?</li>\n<li>You don&#39;t think that there&#39;s a natural reversion in the balance of supply &amp; demand after a stock runs up thousands of percent in a matter of days?</li>\n</ul></li>\n<li>With zero understanding of market mechanics, explaining to others why price action is fake\n\n<ul>\n<li>&quot;Look how low volume is on this candle!  It&#39;s not a real drop!&quot;</li>\n<li><a href=\"https://www.reddit.com/r/wallstreetbets/comments/lay22q/the_dip_is_fake_look_at_how_many_people_are/\">the dip is fake</a></li>\n</ul></li>\n<li>Called people who have been involved in this play since Summer 2020 &quot;paperhand pussies&quot; for taking profits when the price of the stock went up 1,500%</li>\n<li>Turned WallStreetBets into a political activism forum</li>\n<li>Denying Reality\n\n<ul>\n<li>S3 partners is not lying to you.  They and Ortex are consistently the best sources of difficult-to-obtain information on short interest.  Just because they&#39;re reporting that short % of float is reduced FROM THE HIGHEST LEVEL THAT ANY STOCK HAS EVER HAD does not mean that they&#39;re lying to you.</li>\n</ul></li>\n<li>Spammed low-effort memes and easily-Googleable questions on the new submissions\n\n<ul>\n<li>When your posts were taken down, you posted AGAIN</li>\n</ul></li>\n<li>Accused anybody with an opposing opinion of being a hedge fund shill/bot</li>\n<li>AGGRESSIVELY spamming to find buyers to help you get out of your huge negative position</li>\n<li>I want to gag every time I see somebody write &quot;I&#39;m not a financial advisor&quot; following a post that makes that very clear</li>\n<li>Moving the goalposts\n\n<ul>\n<li>&quot;YOU ARE HERE on the VW short squeeze graph!&quot;</li>\n<li>&quot;We finished above $325!  Gamma squeeze!&quot; (Personal confession, I almost fell for this one and I&#39;m glad I sold before the plummet).</li>\n<li>&quot;Ok so there was no gamma squeeze Monday but Tuesday is the day!&quot;</li>\n<li>&quot;Ok we fell another 50% Tuesday but definitely Wednesday!&quot;</li>\n<li>&quot;Fuck it let&#39;s just harrass investor relations to help us!&quot;</li>\n</ul></li>\n<li>Accused the mods of being paid off by hedge funds for doing what they&#39;ve always done, which is remove shit-tier posts from the front page\n\n<ul>\n<li>which you then posted again\n\n<ul>\n<li>and again</li>\n</ul></li>\n</ul></li>\n<li>Completely ignored the rules of our subreddit\n\n<ul>\n<li>Market Manipulation -- </li>\n<li>No Pump &amp; Dumps -- pressuring other people to buy low float stocks (such as GME) so that you can drive up buying demand and sell when you&#39;ve decreased your losses is a scam.</li>\n<li>Political Bullshit -- If you think &quot;it&#39;s not about the money&quot; then get the fuck out because it is absolutely about the money.</li>\n<li>No Bullshitting -- There are so many of you advising others on their trades (followed by &quot;This is not financial advice, am ape&quot;) while you have no idea what the fuck you&#39;re talking about aside from something you just read on Reddit 5 minutes ago, which was posted by somebody else who had no idea what the fuck they were talking about, which was based on a tweet they read 10 minutes before that from someone who DID know what they were talking about, but OP misinterpreted the meaning.\n\n<ul>\n<li>Believe it or not, that&#39;s against the rules.  Just say you dont know.  Or say nothing.  There&#39;s actually no need to spam.</li>\n</ul></li>\n</ul></li>\n<li>Gain &amp; Loss Posts - nobody wants to see your Loss on one-third of a share of AMC.  Come on.</li>\n<li>YOLO - Your investment in one-third of a share of AMC is not a YOLO.  A YOLO is DFV leveraging up his entire $55,000 account with positions in a single ticker and letting it ride or die.\n\n<ul>\n<li><a href=\"https://www.reddit.com/r/wallstreetbets/comments/la96zj/my_amc_billboard_is_up_in_kalamazoo_mi/\">not a fucking YOLO -- it&#39;s a picture of a billboard</a></li>\n</ul></li>\n<li>Drowned out a lot of really good content on non-GME stuff\n\n<ul>\n<li><a href=\"/u/dhsmatt2\">u/dhsmatt2</a> &#39;s <a href=\"https://www.reddit.com/r/wallstreetbets/comments/lcgce1/1100000_purple_mattress_yolo_update/\">updated PRPL $1.1MM DD</a></li>\n<li><a href=\"/u/socialist_baby\">u/socialist_baby</a> &#39;s <a href=\"https://www.reddit.com/r/wallstreetbets/comments/le81ca/15m_nvta_yolo/\">$1.5MM YOLO on NVTA</a></li>\n<li>I can&#39;t even find the others that I had in mind using the search tool because the entire list of YOLO&#39;s and DD&#39;s is filled with GME and AMC karma farming.</li>\n</ul></li>\n<li>And you&#39;ve now begun brigading WSB from <a href=\"/r/GME\">r/GME</a>.</li>\n</ul>\n\n<p>You have formed a cult.  You&#39;ve now decided, amongst yourselves, that anybody who is not in on your play and wants to discuss other things is just a paid hedge fund shill.  Do you think that&#39;s a healthy mindset?</p>\n\n<p>If this is the investment that you truly want to make, and you feel you have an understanding of the risks, then fucking <strong><em>let it rip.</em></strong>  I hope it works out.  Seriously, I want you to make money.  I like Gain porn a lot more than Loss porn.</p>\n\n<p>But stop bullshitting.  Stop brigading.  Stop spamming.</p>\n\n<p>You&#39;re driving us nuts.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/h7xqt1iw97g61.jpg?width=466&amp;format=pjpg&amp;auto=webp&amp;s=bc87b50bb806d2bedbb5aa0c3fa1ff56d19660b2\">https://preview.redd.it/h7xqt1iw97g61.jpg?width=466&amp;format=pjpg&amp;auto=webp&amp;s=bc87b50bb806d2bedbb5aa0c3fa1ff56d19660b2</a></p>\n</div><!-- SC_ON -->",
  "score": 11099,
  "permalink": "/r/wallstreetbets/comments/lf657e/to_ape_gang_why_sentiment_has_turned_against_you/",
  "subreddit": "wallstreetbets",
  "id": "lf657e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123217879
}