{
  "author": "forestroad179",
  "the_new_excerpt": "While not being as overvalued as we were in 1999 is really not a hard bar to\npass, I do think it is worth mentioning as the \"gravity\" of both situations are\nentirely different.\n\nSo are we in a bubble as a whole market? Not really. Sure, we are overpriced by\nroughly 15-20%, (based on how I assess it)…",
  "original_created_utc": 1611274979,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "虽然没有像1999年那样被高估，但这确实不是一个很难的门槛。\n通，我认为值得一提的是，这两种情况的 \"严重性 \"都是。\n完全不同。\n\n那么我们整个市场是不是处于泡沫之中呢？并非如此。当然，我们的价格过高，由\n大概15-20%，（根据我的评估）... ...",
      "title": "1999年7月，标普的收益率为3%。当时的10年期债券? 大概是5%。今天，标普的盈利收益率约为2.6%。10年期债券？1.1%. 我们远没有1999年的时候那么高估。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "雖然沒有像1999年那樣被高估，但這確實不是一個很難的門檻。\n通，我認爲值得一提的是，這兩種情況的 \"嚴重性 \"都是。\n完全不同。\n\n那麼我們整個市場是不是處於泡沫之中呢？並非如此。當然，我們的價格過高，由\n大概15-20%，（根據我的評估）... ...",
      "title": "1999年7月，標普的收益率爲3%。當時的10年期債券? 大概是5%。今天，標普的盈利收益率約爲2.6%。10年期債券？1.1%. 我們遠沒有1999年的時候那麼高估。"
    }
  ],
  "title": "In July of 1999, the S&P's earnings yield was 3%. The 10-year bond at that time? Roughly 5%. Today the S&P earnings yield is ~2.6%. The 10-year bond? 1.1%. We are nowhere near as overvalued as we were in 1999.",
  "created_utc": 1611284389,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>While not being as overvalued as we were in 1999 is really not a hard bar to pass, I do think it is worth mentioning as the &quot;gravity&quot; of both situations are entirely different. </p>\n\n<p>So are we in a bubble as a whole market? Not really. Sure, we are overpriced by roughly 15-20%, (based on how I assess it) but if your outlook is beyond 10 years, it is very smart to continue to buy. And if the market dips? Buy your favorite companies at better prices.</p>\n\n<p>I&#39;ll close on this: if one could correctly time the market, they&#39;d be a trillionaire. Buy VOO if you don&#39;t know how to value stocks, and if you do, shoot for a 5% yield as your cut-off, and you will do just fine over time.</p>\n</div><!-- SC_ON -->",
  "score": 244,
  "permalink": "/r/investing/comments/l2bnxr/in_july_of_1999_the_sps_earnings_yield_was_3_the/",
  "subreddit": "investing",
  "id": "l2bnxr",
  "is_self": true,
  "media": null,
  "is_video": false
}