{
  "author": "Worried_Thylacine",
  "original_created_utc": 1638116506,
  "title": "Why do some anti-crypto people want crypto investors to lose money?",
  "created_utc": 1638148124,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I never take pleasure is seeing people lose money, whether it is from a stock I don’t like or any investment.  Even if people fall for obvious scams in real life, I never want to see that.</p>\n\n<p>But I notice a lot of anti-crypto people seem to want crypto investors to lose money?  Like they have some perverse pleasure in seeing other people lose.  It’s clearly evident on some subreddits during any dip where the lost money is locked.</p>\n\n<p>Anyone else notice that?  </p>\n\n<p>Is it just FOMO causing it?  Or some people dislike that some other people are doing better than they are?</p>\n\n<p>Edit: wow, this post blew up a bit.  I response to some of the comments.  The degree of hate in the anti-crypto crowd is much more than I ever experienced in the stock market boards I visit.  Some people may hate a stock but few cheer when it goes down (except HOOD).  And no one cheers as a whole when the stock market is down.  But many, many cheer when the entire crypto market is down.</p>\n\n<p>Edit2:  and there is “I’m jealous, this person has more than me” and then there is “I’m jealous, this person has more than me, I hope he loses it all”. The former is okay, we’ve all been there.  The latter, they is where jealously turns to hatred.  It’s ugly to see.</p>\n</div><!-- SC_ON -->",
  "score": 166,
  "permalink": "/r/CryptoCurrency/comments/r47ydr/why_do_some_anticrypto_people_want_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "r47ydr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I never take pleasure is seeing people lose money, whether it is from a stock I\ndon’t like or any investment. Even if people fall for obvious scams in real\nlife, I never want to see that.\n\nBut I notice a lot of anti-crypto people seem to want crypto investors to lose\nmoney? Like they have some…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は人が損をするのを見て楽しむことはありません。それが好きでもない株や投資であっても\n好きでもない株でも、どんな投資でも、人が損をするのを見るのは楽しいことではありません。たとえ現実に明らかな詐欺に引っかかる人がいたとしても\n私はそんな姿を見たくありません。\n\nしかし、アンチ暗号派の多くは、暗号投資家が損をすることを望んでいるようですね。\nお金を？まるで何かを...",
      "title": "なぜアンチクリプトの人たちは、クリプト投資家が損をすることを望むのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我从不以看到人们赔钱为乐，无论是从我不喜欢的股票还是任何投资中。\n或任何投资。即使人们在现实生活中落入明显的骗局\n生活中，我也不想看到这种情况。\n\n但我注意到很多反加密货币的人似乎希望加密货币投资者失去\n钱？就像他们有一些...",
      "title": "为什么一些反加密货币的人希望加密货币投资者亏钱？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我從不以看到人們賠錢爲樂，無論是從我不喜歡的股票還是任何投資中。\n或任何投資。即使人們在現實生活中落入明顯的騙局\n生活中，我也不想看到這種情況。\n\n但我注意到很多反加密貨幣的人似乎希望加密貨幣投資者失去\n錢？就像他們有一些...",
      "title": "爲什麼一些反加密貨幣的人希望加密貨幣投資者虧錢？"
    }
  ]
}