{
  "author": "megacurl",
  "the_new_excerpt": "Hedge funds plan to significantly increase their exposure to cryptocurrencies by\n2026, a new survey shows, in a major vote of confidence for digital assets after\nrecent large price falls and plans for punitive new capital rules.\n\nA survey of 100 hedge fund chief financial officers globally,…",
  "original_created_utc": 1623767428,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ヘッジファンドは、2026年までに暗号通貨へのエクスポージャーを大幅に増やす予定です。\n新しい調査によると、2026年までに暗号通貨へのエクスポージャーを大幅に増やす予定であることがわかりました。\nこれは、最近の大幅な価格下落や、懲罰的な新資本規制が計画されている中で、デジタル資産に対する大きな信頼票となっています。\n\n世界のヘッジファンドのチーフ・ファイナンシャル・オフィサー100人を対象とした調査では、...",
      "title": "ヘッジファンドは5年以内に資産の7％を暗号で保有すると予想"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对冲基金计划在2026年之前大幅增加他们对加密货币的投资。\n一项新的调查显示，在最近价格大幅下跌之后，对数字资产投下了重要的信任票。\n在最近的价格大幅下跌和惩罚性的新资本规则计划之后，这是对数字资产的一大信心。\n\n一项对全球100名对冲基金首席财务官的调查显示，他们对数字资产的信心大增。",
      "title": "对冲基金预计五年内将持有7%的加密货币资产"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對沖基金計劃在2026年之前大幅增加他們對加密貨幣的投資。\n一項新的調查顯示，在最近價格大幅下跌之後，對數字資產投下了重要的信任票。\n在最近的價格大幅下跌和懲罰性的新資本規則計劃之後，這是對數字資產的一大信心。\n\n一項對全球100名對沖基金首席財務官的調查顯示，他們對數字資產的信心大增。",
      "title": "對沖基金預計五年內將持有7%的加密貨幣資產"
    }
  ],
  "title": "Hedge funds expect to hold 7% of assets in crypto within five years",
  "created_utc": 1623775261,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hedge funds plan to significantly increase their exposure to cryptocurrencies by 2026, a new survey shows, in a major vote of confidence for digital assets after recent large price falls and plans for punitive new capital rules.</p>\n\n<p>A survey of 100 hedge fund chief financial officers globally, conducted by fund administrator Intertrust, found that executives expect to hold an average of 7.2 per cent of their assets in cryptocurrencies in five years’ time. </p>\n\n<p>If replicated across the sector, that could equate to a total of <strong>about $312bn of assets in cryptos</strong>, based on data group Preqin’s forecast for the total size of the hedge fund industry, Intertrust estimated. Seventeen per cent of respondents expected to have more than 10 per cent in crypto.</p>\n\n<p>This would represent a large increase in appetite among hedge funds. Current holdings in the sector are unclear, but a number of big-name managers have already committed small amounts to crypto assets, attracted by soaring prices and market inefficiencies that they can arbitrage.</p>\n\n<p>Man Group trades bitcoin futures in its computer-driven AHL unit, while Renaissance Technologies last year said its flagship Medallion fund could invest in bitcoin futures. Hedge fund manager Paul Tudor Jones has bought into Bitcoin, while Brevan Howard has been shifting a small portion of funds into crypto and its co-founder, billionaire Alan Howard, is a major backer of the industry.</p>\n\n<p>Bitcoin is the largest contributor to gains this year at US fund firm SkyBridge Capital, set up by former White House communications director Anthony Scaramucci, which started buying it late last year and then trimmed its holding going into April — just before the price of the token fell.</p>\n\n<p>Hedge funds “are well aware not only of the risks but also the long-term potential” of cryptos, said David Miller, executive director at Quilter Cheviot Investment Management.</p>\n\n<p>The growing enthusiasm shown by hedge funds stands in sharp contrast to widespread scepticism among more traditional asset managers, many of whom remain concerned about cryptocurrencies’ huge volatility and uncertainty over how they will be regulated.</p>\n\n<p>“For the moment, crypto investments remain limited to clients that have a high risk tolerance and, even then, investments are typically a low proportion of investable assets,” Morgan Stanley and Oliver Wyman, the consultancy, said in a recent report on asset management.</p>\n\n<p>Recommended\nRoger Svensson\nBitcoin lacks a solid foundation as an international currency</p>\n\n<p>Some hedge funds remain wary. Paul Singer’s Elliott Management wrote to investors earlier this year that cryptocurrencies could possibly become “the greatest financial scam in history” in a letter seen by the Financial Times.</p>\n\n<p>Cryptos have experienced a wild ride again this year. Bitcoin soared from less than $29,000 at the end of last year to more than $63,000 in April, but has since fallen back to just over $40,000.</p>\n\n<p>While the future regulation of cryptos remains unclear, last week the Basel Committee on Banking Supervision said they should carry the toughest bank capital rules of any asset.</p>\n\n<p>Intertrust’s survey, whose respondents include CFOs globally of funds that on average manage $7.2bn in assets, also showed that all the executives surveyed in North America, Europe and the UK expect to have at least 1 per cent of their portfolio in crypto.</p>\n\n<p>North American funds expect to have exposure of 10.6 per cent on average, while those in the UK and Europe expect 6.8 per cent on average.</p>\n\n<p><a href=\"https://www.ft.com/content/4f8044bf-8f0f-46b4-9fb7-6d0eba723017\">https://www.ft.com/content/4f8044bf-8f0f-46b4-9fb7-6d0eba723017</a></p>\n</div><!-- SC_ON -->",
  "score": 339,
  "permalink": "/r/investing/comments/o0fpjn/hedge_funds_expect_to_hold_7_of_assets_in_crypto/",
  "subreddit": "investing",
  "id": "o0fpjn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009742348
}