{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "I see so many people on this sub and other finance-related subs recommend certain stocks simply because they're great companies. A lot of people seem to fail to realize the fact that the expected growth and development of some companies is already priced into their stock price and that their investment isn't as valuable as they might think. This is especially relevant if you're in those companies for the long run, and not just trying to hedge some profits out of short term price movements.\n\nTwo major examples of those kinds of overvalued stocks (in my opinion) come to my mind: Costco ($COST) and Nvidia ($NVDA).\n\n$COST: Costco is currently trading with a P/E ratio of almost 50 (so their annual earnings are close 1/50 or 2% of their market cap). However, the average P/E ratio in the sector of consumer services is in the 20's. That doesn't directly mean that Costco is a bad investment, but it means that Costco must be expected to grow bloody rapidly within the next few years for it to be worth its current trade price. The thing is, Costco is already an established company with a limited potential for further growth as its already at the top of its sector and gives a lot of its earnings away in the form of dividends instead of reinvesting them into their development. Does that mean that Costco is overvalued at the moment? There can't be an objective answer to that, but you better have a damn good reason to think it's still worth it to invest in Costco, and not just that it's a great company.\n\n$NVDA: Nvidia is currently trading at a P/E ratio around 100 while the average P/E for tech stocks is of 35. Again, you must have a really good reason to think Nvidia, who's already at the top of the GPU market, is gonna grow rapidly within the few next years when it has competitors like AMD and Intel slowly catching up to its technlogical edge and who are slowly taking away some of its market share. Does that mean that Nvidia is overvalued? Even an insidier could have trouble telling you, but again, you must have a really solid reason to think it's still a worth it investment.\n\nLong term investing is all about value. You're trying to find best deals in the market basically. When you do your reasearch about a company, you're trying to evaluate it and compare the intrinsic value you think it has to the value it is given by the market. A good analogy would be if you had a slight preference to Burger King over McDonald's, but Burger King's food was twice as expensive as McDonald's'. Would you still eat at Burger King? No, you'd most likely go to McDonald's because Burger King might taste a bit better, but not enough to justify its way higher price.\n\nAnother thing: I see so many people recommend stocks based on the success they've had in the past with them. It's not because that stock has been great value in the past that it will still great value in the future. The thing that annoys me the most is people that recommend buying Tesla because it's been a successful company. To be clear, Tesla has been a successful company, but the increase in its stock price didn't even nearly scale proportionately to its success. With a P/E ratio of 400, it's easy to see that the increase in Tesla's stock price was caused by the faith of investors in the company's future success and not by its past feats. In brief, the fact that a lot of people believe in a company doesn't mean that it's actually as good a company as its value tells you.",
  "author_fullname": "t2_4yjpfi3i",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "P/E ratio isn't everything, but it would do a lot of good for some people to take it in consideration when investing",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_rritf4",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.88,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 43,
  "total_awards_received": 1,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 43,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": 1640813997,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {
    "gid_1": 1
  },
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1640812193,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I see so many people on this sub and other finance-related subs recommend certain stocks simply because they&amp;#39;re great companies. A lot of people seem to fail to realize the fact that the expected growth and development of some companies is already priced into their stock price and that their investment isn&amp;#39;t as valuable as they might think. This is especially relevant if you&amp;#39;re in those companies for the long run, and not just trying to hedge some profits out of short term price movements.&lt;/p&gt;\n\n&lt;p&gt;Two major examples of those kinds of overvalued stocks (in my opinion) come to my mind: Costco ($COST) and Nvidia ($NVDA).&lt;/p&gt;\n\n&lt;p&gt;$COST: Costco is currently trading with a P/E ratio of almost 50 (so their annual earnings are close 1/50 or 2% of their market cap). However, the average P/E ratio in the sector of consumer services is in the 20&amp;#39;s. That doesn&amp;#39;t directly mean that Costco is a bad investment, but it means that Costco must be expected to grow bloody rapidly within the next few years for it to be worth its current trade price. The thing is, Costco is already an established company with a limited potential for further growth as its already at the top of its sector and gives a lot of its earnings away in the form of dividends instead of reinvesting them into their development. Does that mean that Costco is overvalued at the moment? There can&amp;#39;t be an objective answer to that, but you better have a damn good reason to think it&amp;#39;s still worth it to invest in Costco, and not just that it&amp;#39;s a great company.&lt;/p&gt;\n\n&lt;p&gt;$NVDA: Nvidia is currently trading at a P/E ratio around 100 while the average P/E for tech stocks is of 35. Again, you must have a really good reason to think Nvidia, who&amp;#39;s already at the top of the GPU market, is gonna grow rapidly within the few next years when it has competitors like AMD and Intel slowly catching up to its technlogical edge and who are slowly taking away some of its market share. Does that mean that Nvidia is overvalued? Even an insidier could have trouble telling you, but again, you must have a really solid reason to think it&amp;#39;s still a worth it investment.&lt;/p&gt;\n\n&lt;p&gt;Long term investing is all about value. You&amp;#39;re trying to find best deals in the market basically. When you do your reasearch about a company, you&amp;#39;re trying to evaluate it and compare the intrinsic value you think it has to the value it is given by the market. A good analogy would be if you had a slight preference to Burger King over McDonald&amp;#39;s, but Burger King&amp;#39;s food was twice as expensive as McDonald&amp;#39;s&amp;#39;. Would you still eat at Burger King? No, you&amp;#39;d most likely go to McDonald&amp;#39;s because Burger King might taste a bit better, but not enough to justify its way higher price.&lt;/p&gt;\n\n&lt;p&gt;Another thing: I see so many people recommend stocks based on the success they&amp;#39;ve had in the past with them. It&amp;#39;s not because that stock has been great value in the past that it will still great value in the future. The thing that annoys me the most is people that recommend buying Tesla because it&amp;#39;s been a successful company. To be clear, Tesla has been a successful company, but the increase in its stock price didn&amp;#39;t even nearly scale proportionately to its success. With a P/E ratio of 400, it&amp;#39;s easy to see that the increase in Tesla&amp;#39;s stock price was caused by the faith of investors in the company&amp;#39;s future success and not by its past feats. In brief, the fact that a lot of people believe in a company doesn&amp;#39;t mean that it&amp;#39;s actually as good a company as its value tells you.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "rritf4",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "SomeKindOfSorbet",
  "discussion_type": null,
  "num_comments": 36,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/rritf4/pe_ratio_isnt_everything_but_it_would_do_a_lot_of/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/rritf4/pe_ratio_isnt_everything_but_it_would_do_a_lot_of/",
  "subreddit_subscribers": 3439297,
  "created_utc": 1640819765,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1640812193,
  "the_new_excerpt": "I see so many people on this sub and other finance-related subs recommend\ncertain stocks simply because they're great companies. A lot of people seem to\nfail to realize the fact that the expected growth and development of some\ncompanies is already priced into their stock price and that their…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブや他の金融関連のサブで、多くの人が勧めているのを見ます。\nある銘柄を「いい会社だから」という理由だけで 多くの人が\nあるものは、期待される成長と発展という事実を理解していない。\nその企業の株価はすでに織り込み済みで、その企業の...",
      "title": "PERがすべてではないが、投資する際にPERを考慮することは、一部の人々にとって非常に良いことだろう"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我看到这个子网站和其他与金融有关的子网站上有很多人推荐\n某些股票只是因为它们是伟大的公司。很多人似乎\n没有意识到这样一个事实，即一些公司的预期增长和发展已经被计入其股价。\n一些公司的预期增长和发展已经被计入他们的股票价格，而且他们的...",
      "title": "市盈率不是一切，但对一些人来说，在投资时考虑市盈率会有很大的好处"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到這個子網站和其他與金融有關的子網站上有很多人推薦\n某些股票只是因爲它們是偉大的公司。很多人似乎\n沒有意識到這樣一個事實，即一些公司的預期增長和發展已經被計入其股價。\n一些公司的預期增長和發展已經被計入他們的股票價格，而且他們的...",
      "title": "市盈率不是一切，但對一些人來說，在投資時考慮市盈率會有很大的好處"
    }
  ]
}