{
  "author": "No-Agent3586",
  "original_created_utc": 1654003020,
  "title": "Are nipples inappropriate?",
  "created_utc": 1654023237,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m a 24f. I have b cups and my nipples pierced. I used to never wear a bra (unless going to work/church/etc) and never cared if anyone looked at my nipples. They’re just nipples to me &amp;amp; everyone has them? Some men have bigger boobs than me so I just didn’t care. &lt;/p&gt;\n\n&lt;p&gt;We’ll now that I’m getting into my mid twenties I feel super self conscious about it, like if I’m offending others because of my nipples. &lt;/p&gt;\n\n&lt;p&gt;I don’t know where this came from I’m just assuming since I’m older I’m more self aware? What is Reddit’s opinion?&lt;/p&gt;\n\n&lt;p&gt;Edit: I am always wearing a bra and being respectful of how I am dressing in places of work, religion, formal occasions etc. I am simply asking if I am going to the grocery store, going to the bars, mall etc. if still not wearing a bra is inappropriate.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 110,
  "permalink": "/r/TooAfraidToAsk/comments/v1q2qx/are_nipples_inappropriate/",
  "subreddit": "TooAfraidToAsk",
  "id": "v1q2qx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m a 24f. I have b cups and my nipples pierced. I used to never wear a bra\n(unless going to work/church/etc) and never cared if anyone looked at my\nnipples. They’re just nipples to me & everyone has them? Some men have bigger\nboobs than me so I just didn’t care.\n\nWe’ll now that I’m getting into my…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は24Fです。Bカップで乳首にピアスをしています。以前はブラジャーをつけることはなく\n(をつけず、乳首を見られても気にしないようにしていました。\nを気にしたことはありませんでした。私にとってはただの乳首で、誰もが持っているものなのでしょうか？私より大きなおっぱいの男性もいます。\n私より大きなおっぱいの男性もいるので、気にしなかっただけです。\n\n今、私は自分の...",
      "title": "乳首は不適切？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是24F。我有B罩杯，我的乳头穿了孔。我以前从不穿胸罩\n(除非是去工作/教堂/等等），而且从不关心是否有人看我的\n乳头。对我来说，它们只是乳头，每个人都有乳头。有些男人的胸部比我大\n有些男人的胸部比我大，所以我就不在乎。\n\n现在，我已经进入了我的...",
      "title": "乳头是否不合适？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是24F。我有B罩杯，我的乳頭穿了孔。我以前從不穿胸罩\n(除非是去工作/教堂/等等），而且從不關心是否有人看我的\n乳頭。對我來說，它們只是乳頭，每個人都有乳頭。有些男人的胸部比我大\n有些男人的胸部比我大，所以我就不在乎。\n\n現在，我已經進入了我的...",
      "title": "乳頭是否不合適？"
    }
  ]
}