{
  "author": "henry_gindt",
  "the_new_excerpt": "While many may argue that value investing doesn't make sense anymore, a lot of\nthese rules and investment principles from Warren Buffett and Benjamin Graham\nstand the test of time, especially when you apply current nuance to these their\ninvestment rules (which are now close to a century…",
  "original_created_utc": 1613516365,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "虽然很多人可能会认为价值投资没有意义了，但很多\n巴菲特和本杰明-格雷厄姆的这些规则和投资原则。\n经得起时间的考验，特别是当你把当前的细微差别应用到这些他们的\n投资规则（现在已经接近百年...",
      "title": "巴菲特和已故本杰明-格雷厄姆的17条投资原则"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "雖然很多人可能會認爲價值投資沒有意義了，但很多\n巴菲特和本傑明-格雷厄姆的這些規則和投資原則。\n經得起時間的考驗，特別是當你把當前的細微差別應用到這些他們的\n投資規則（現在已經接近百年...",
      "title": "巴菲特和已故本傑明-格雷厄姆的17條投資原則"
    }
  ],
  "title": "17 Investment Principles from Warren Buffett and the late Benjamin Graham",
  "created_utc": 1613525647,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>While many may argue that value investing doesn&#39;t make sense anymore, a lot of these rules and investment principles from Warren Buffett and Benjamin Graham stand the test of time, especially when you apply current nuance to these their investment rules (which are now close to a century old)...</p>\n\n<p><strong>Disclaimer:</strong> The views above represent the opinions of the OP and are supported by research from Benjamin Graham&#39;s Security Analysis from 1934 and The Intelligent Investor from 1949, along with Google and Yahoo Finance and public statements from Warren Buffett and Benjamin Graham. These investment principles do not constitute investment advice, but rather are general principles one might employ in reaching his or her overall financial goals. <em>All</em> investing bears risk, including possible loss of capital.</p>\n\n<p><strong>#1 Create a healthy balance in your portfolio between risky and less risky investments</strong></p>\n\n<p>“Furthermore, a truly conservative investor will be satisfied with the gains shown on half his portfolio in a rising market, while in a severe decline he may derive much solace from reflecting how much better off he is than many of his more venturesome friends.” – quote from Benjamin Graham</p>\n\n<p>A conservative investor may have 50% of his or her portfolio in risky assets like stocks and real estate and 50% in less risky investments like US treasury bonds (which you can buy either directly from the US Treasury or through ETFs like Charles Schwab Short Term Treasuries ETF (Ticker: SCHO) as well as through investments in gold (SPDR Gold Trust (Ticker: GLD)) which tends to be a good portfolio hedge against volatile markets and inflation (at least historically).</p>\n\n<p>Benjamin Graham’s formula for calculating the percentage of assets that should be in risky vs. less-risky investments is to subtract your age from 100 and invest that percentage of your assets in risky investments (like stocks), with the rest in relatively safer assets like cash and gold. For instance, if you are 35 years old, you might invest 65% of your investible assets (not including savings) into risky assets like stocks and 35% of your investible assets in less volatile assets like cash (USD/euro or another stable currency) and gold. A 70-year-old, on the other hand, would only invest 30% (rather than 65%) of his or her assets in risky investments (like stocks) and the balance in more stable assets like cash (again, assuming the cash is in US dollar, euros or another relatively stable “low” inflation currency.)</p>\n\n<p>Benjamin Graham formula for proper investment portfolio balance:</p>\n\n<p>100 – your age = risky assets (such as stocks), with the balance in less risky assets</p>\n\n<p>Of note, most of us might categorize real estate investments as safe investments (which may be the case relative to stocks). That said, as Benjamin Graham reminded us over half a century before the 2007-2008 Great Recession, “Unfortunately, real-estate values are also subject to wide fluctuations; serious errors can be made in location, price paid, etc.” With most financial assets highly correlated these days due to the high interconnectivity of markets and economies, there are few truly uncorrelated and riskless assets. Real estate prices are as high as ever in 2021 thanks to over a decade of easy monetary policy, along with a dwindling inventory of available homes for sale in the US.</p>\n\n<p><strong>#2 Have an emergency fund</strong></p>\n\n<p>“The unexpected can strike anyone, at any age. Everyone must keep some assets in the riskless haven of cash.” Quote from Benjamin Graham</p>\n\n<p>We never know when emergencies may strike. We might be fired. Our division at work might be cut. Our spouse or child may experience a significant setback. The 2020 Year from Hell and Covid-19 should remind the world and each of us that disaster can strike at a moment’s notice. We must be prepared for these uncertainties. While volunteering at Vanderbilt University Medical Center (VUMC), a patient once inadvertently taught the author of this piece, Henry Gindt, to “always expect the unexpected.” This particular patient happened to be in the hospital following a heart attack…in his mid-40s…as a marathon runner. (As a side-note, some of the best life lessons and principles can be learned through volunteering. If 2020 taught us anything, it might be that there are plenty of our fellow men and women out there who could use a helping hand. Find a great volunteer opportunity near me.) “Emergencies” happen all the time in life. Oftentimes these emergencies spill over into the financial side of the house. Vanguard Investments suggests as a rule of thumb to maintain at least 3-6 months of income in such an emergency fund in order to cover things like food, mortgage payments/rent, credit card bills, and ongoing health insurance or COBRA in the event of a lost job. This emergency fund should not be invested except in low-risk securities like US Treasuries.</p>\n\n<p><strong>#3 Choose ETFs over individual stocks</strong></p>\n\n<p>“There are two ways to be an intelligent investor: by continually researching, selecting, and monitoring a dynamic mix of stocks, bonds, or mutual funds; or by creating a permanent portfolio that runs on autopilot and requires no further effort (but generates very little excitement).” Quote from Benjamin Graham</p>\n\n<p>Broad market ETFs can curb our emotional impulses to buy and sell to some degree as these broad market index funds are less volatile than most any single individual security. The framework around how we might build an optimal portfolio might be to create balance in your portfolio by 1) conducting ongoing and rigorous homework analyzing stocks (“active investor”) or by selecting a few ETFs and dollar-cost-averaging your investments into these funds over time (see points below). In the Intelligent Investor’s prologue, Warren Buffett reminds us that “What’s needed is a sound intellectual framework for making decisions and the ability to keep emotions from corroding that framework.”</p>\n\n<p>Step 1 might be to determine a fixed split between risky and less risky assets as part of your investment portfolio (perhaps using Graham’s formula above based on your age).</p>\n\n<p>Step 2 might then be to select a few US and world market ETFs.</p>\n\n<p>This approach might be thought of as setting your portfolio on autopilot as Graham suggests. Some example ETFs offering broad market exposure to US markets include ETFs under the tickers SPY (S&amp;P 500), QQQ (Nasdaq) and DIA (Dow Jones). You can also gain exposure to global markets and global economic growth through even broader market ETFs and mutual funds from Vanguard (ticker VTI), Charles Schwab (ticker SWTSX), and Fidelity (ticker FZROX). These ETFs can be purchased through whichever financial app you use: You Invest (JPMorgan), Fidelity, E*TRADE, TD Ameritrade, Charles Schwab, Ally Invest, or any other.</p>\n\n<p>This simple framework may likely do the trick in meeting your financial goals (as well as outperforming any active portfolio management you might pursue). See also how the KISS principle might relate to other areas of your life.</p>\n\n<p><strong>#4 If you insist on owning individual stocks (active investor) vs. ETFs (passive investor), create a well-balanced and diversified portfolio</strong></p>\n\n<p>“Graham’s guideline of owning between 10 and 30 stocks remains a good starting point for investors who want to pick their own stocks, but you must make sure that you are not overexposed to one industry.” Quote from Jason Zweig</p>\n\n<p>If you insist on picking your own stocks vs. using a basket of stocks through ETFs, try to have between 10-30 stocks to get the benefit of good diversification and do not choose all of these stocks from the same industry. A well-balanced portfolio means selecting at least 10 stocks from at least 3 or 4 different industries, according to Graham. For instance, you might balance some investments in high-growth technology sectors with conservative non-cyclical companies that likely pay dividends and have stable growth such as the best healthcare and insurance companies (what some think of as “boring” companies). Experts disagree on how many stocks you must own to have a well-diversified portfolio, but the benefits of diversification tend to experience diminishing marginal benefit as you go over 30 stocks. Additionally, your life becomes increasingly complicated if you are actively managing 30+ stocks. Hedge fund professionals spend 100% of their work time focused on tracking their investments. Do you have time to dedicate 40-60 hours+/ week on researching and monitoring your portfolio? If so, and for advanced investors, including hedge fund traders, you might read Benjamin Graham’s textbook Security Analysis. It is quite amazing how few professional investors on Wall Street and elsewhere have ever read Security Analysis. Graham reminds us that:</p>\n\n<p>There is a close logical connection between the concept of a safety margin and the principle of diversification. One is correlative with the other. Even with a margin in the investor’s favor, an individual security may work out badly. For the margin guarantees only that he has a better chance for profit than for loss—not that loss is impossible. But as the number of such commitments is increased the more certain does it become that the aggregate of the profits will exceed the aggregate of the losses. That is the simple basis of the insurance-underwriting business.</p>\n\n<p><strong>#5 Don’t overpay for stocks (or real-estate investments, cryptocurrency or any other investment)</strong></p>\n\n<p>“The investor should impose some limit on the price he will pay for an issue in relation to its average earnings over, say, the past seven years. We suggest that this limit be set at 25 times such average earnings, and not more than 20 times those of the last twelve-month period.” Quote from Benjamin Graham</p>\n\n<p>Don’t overpay for stocks just because momentum is good for the moment. In fact, Graham suggested paying an average P/E multiple of 12-13 across an intelligent investor’s portfolio with a maximum P/E of 15 for any individual security. While these P/E ratios are likely overly conservative and represent outdated valuation rules of thumb in the era of pre-rapid technology innovation/adoption and hyper-globalization, one shouldn’t simply ignore a company’s current and future earnings prospects in assigning a value. Benjamin Graham reminds us that “the time everyone decides that a given industry is ‘obviously’ the best one to invest in, the prices of its stocks [or other assets] have been bid up so high that its future returns have nowhere to go but down.” (See points below on analyzing company fundamentals including both value and growth). If you are investing in some of the latest technology stocks or household name companies like Tesla, Uber, AirBNB, Poshmark, etc., you might notice that the P/E multiple is either non-existent or extremely high. This is because the company is not yet earning much (or any) profit. Instead, the market is valuing the company based on its growth profile which, over time, assuming all goes according to plan, will turn into healthy earnings and profit. However, the second the growth assumptions are tweaked by equity research analysts on Wall St. (or a string of bad news hits the company, its industry or the market overall), the initial rosy valuation assumptions of these high-growth/loss-making companies will swiftly be revised downwards, leading to an almost immediate or rapid decline in value. The collapse in value of your securities and investments will be at least twice as painful as the pleasure from the ride up, according to world-renown psychologists Daniel Kahneman and Amos Tversky. Importantly, never forget that the rosy growth assumptions under which are investing today may experience a sharp reversal when you have ceased actively monitoring these investments months or years later. Even if you choose to become an active investor (rather than a passive investor primarily invested in ETFs), by the time the bad news hits, the damage will already be done due to the rapid price movements following breaking news.</p>\n\n<p>Graham and many other notable investors like Warren Buffett and Seth Klarman, billionaire and founder of the investment firm Baupost Group, often speak of creating “margin of safety” when making investments by buying significantly below a company’s intrinsic value. This built-in “pricing buffer” creates some wiggle room and margin for when things don’t work out as planned, as they inevitably do in both financial markets and life more generally. Graham tells us that “If the purchases are made at the average level of the market over a span of years, the prices paid should carry with them assurance of an adequate margin of safety. The danger to investors lies in concentrating their purchases in the upper levels of the market, or in buying nonrepresentative common stocks that carry more than average risk of diminished earning power.” In other words, Graham himself speaks to the value of dollar-cost-averaging, where the intelligent investor is consistently buying over time, during good times, as well as during bad times.</p>\n\n<p>The Acorns investment app is an interesting app that can help smooth the average “buy-in price” to avoid concentrating investments when markets are hot and selling when markets are depressed by trickling in investments consistently every day/week/month without any active engagement…over decades. This “dollar-cost-averaging” approach is likely a much better approach for most all of us in the long run, particularly those of us with a few decades to go until retirement. Consider using investment apps like Acorns or talk to your investment advisor about dollar-cost averaging your investments each week or month.</p>\n\n<p><strong>#6 Focus on the “fundamentals” (earnings and growth) assuming you choose to be an active investor as opposed to a passive investor</strong></p>\n\n<p>“Experience has shown that in most cases safety resides in the earning power, and if this is deficient the assets lose most of their reputed value.” Benjamin Graham</p>\n\n<p>Companies like Amazon, Google and Apple are now worth over $1 trillion each as their earnings power is so solid and market dominance so secure (for now). In the case of Google, for example, the company prints billions of dollars annually from Google Ads alone. When selecting individual stocks, focus on the earnings power and repeatability of those earnings in a normal year (“normalized earnings”). Also, pay close attention to the company’s growth prospects. Growth is a much more important factor in the 2020s due to the current pace of globalization compared with Benjamin Graham’s era where markets weren’t as interconnected and the United States market offered nearly all the great investment opportunities in his day.</p>\n\n<p>Graham’s formula for selecting growth-oriented companies (as opposed to value-oriented companies below) is Value = Current (Normal) Earnings × (8.5 plus twice the expected annual growth rate), where the annual growth rate can reasonably be expected from the company for at least 7 to 10 years. This formula might be revised to reflect current growth and technology assumptions. However, having some sort of investment formula (which perhaps you develop) as a guide might come in handy as much today as it did in 1949. If you can hold yourself to this investment formula, you might avoid serious mistakes. You might also stress test each of your stock investment ideas (or investment formula) with 2-3 trusted advisers to gain an “outside view.”</p>\n\n<p>For more value-oriented investments, Graham lists 7 key requirements:</p>\n\n<ol>\n<li>Adequate size</li>\n<li>Sufficiently strong financial condition</li>\n<li>Continued dividends for at least the past 20 years</li>\n<li>No earnings deficit in the past ten years</li>\n<li>Ten-year growth of at least one-third in per-share earnings</li>\n<li>Price of stock no more than 1½ times net asset value</li>\n<li>Price no more than 15 times average earnings of the past three years.</li>\n<li>In developing your own formula for investing in today’s markets, you might take some example key requirements above and revise them to fit your investment strategy.</li>\n</ol>\n\n<p><strong>#7 Have patience. (This is hard. Very hard. Extremely hard.)</strong></p>\n\n<p>“A defensive investor runs—and wins—the race by sitting still. Patience is the fund investor’s single most powerful ally.” Quote from Benjamin Graham.</p>\n\n<p>When markets are panicking and you don’t know what to do, do nothing. Panicking only makes matters worse as you try to sell or make other rash decisions. The Intelligent Investor is patient and knows that the best investment holding period is forever, followed by a lifetime, followed by 30 years, followed by 10 years, followed by 3-5 years, followed by at least 1 year in order to reap the capital gains tax benefits (see point below on optimizing taxes). Benjamin Graham reminds us that “In the financial markets, the worse the future looks, the better it usually turns out to be.”</p>\n\n<p><strong>#8 Set rules for when to sell</strong></p>\n\n<p>“Reversals [of fortune] will have more meaning for the active than for the passive investor. But they suggest that even defensive portfolios should be changed from time to time, especially if the securities purchased have an apparently excessive advance and can be replaced by issues much more reasonably priced.” Quote from Benjamin Graham</p>\n\n<p>It may be assumed that a stern and uniform policy of selling at 25% or 30% profit will work out best as applied to many holdings.” Quotes from Benjamin Graham</p>\n\n<p>Set rules for when to sell such as after a certain time period has elapsed (say 2-5 years) or profit goal or loss limit has been reached. Instituting rules such as selling all securities at a 30%/50%/100%/3x etc. profit (or at a 10%/30% loss to cap losses) can take some of the emotion out of investing. Make sure whatever specific goal you set when making the investment in a stock(s) or other security aligns with your long-term financial goals. Setting rules on the front-end that align well with your overall long-term financial goals should include setting rules for both downside scenarios and upside scenarios. The best financial and investment apps are pretty good about making it easy to set “stop losses” or sell at a predetermined profit level. We might also be reminded by Benjamin Graham’s most famous student, Warren Buffett, about the two key rules of avoiding loss of principal so that you can stay in the game: #1 Don’t lose money and #2 See rule #1.</p>\n\n<p>Some of the best online trading apps and investment apps include Fidelity, E*TRADE, TD Ameritrade, You Invest (JPMorgan), Charles Schwab and Ally Invest. If you don’t have time to do the arduous and consistent research required on the 10-30 stocks in your balanced investment portfolio, a better approach is to use the Acorns app which automates your investments into the most well-known and diversified ETFs from Vanguard.</p>\n\n<p><strong>#9 Don’t chase the latest shining star</strong></p>\n\n<p>“What you don’t do is as important to your success as what you do. The lesson is clear: Don’t just do something, stand there. It’s time for everyone to acknowledge that the term ‘long-term investor’ is redundant. A long-term investor is the only kind of investor there is. Someone who can’t hold on to stocks for more than a few months at a time is doomed to end up not as a victor but as a victim.” Quote from Benjamin Graham</p>\n\n<p>Don’t jump on the latest stock or other “hot” investment bandwagon. If the stock is front-page news all over the world and is skyrocketing, it is 9 times out of 10 too late to get onboard for profit. Momentum plays a big role in stock prices in the short term, but over the long run, a company is valued on its earnings and growth trajectory. Oftentimes, technology companies receive such a lofty valuation based on future growth expectations, such as Tesla’s historic rise in 2020. If growth does not end up meeting these expectations, you can expect a company’s publicly traded valuation to decline as quickly as it rose. See cryptocurrency, bitcoin and Coinbase analysis from Henry Gindt here.</p>\n\n<p><strong>#10 Ignore “the charts”</strong></p>\n\n<p>“If you look at a large quantity of data long enough, a huge number of patterns will emerge—if only by chance.” Quote from Benjamin Graham</p>\n\n<p>The only metrics you should be focused on are the fundamentals of the company (earning and growth). Many investors these days are fixated on “the charts” such as various moving averages. These are all non-sense. These charts are simply reflections of the latest emotion of an entire market consisting of billions of people reacting to the latest positive or negative news. Ignore these human emotions masquerading as indicators and charts. They will not serve you well in the end. Benjamin Graham refers frequently to the stock market as the emotional and moody “Mr. Market,” which is subject to the daily whims and emotions of…the people trading the stocks on the market. Are there market dislocations and can some investors make money by spotting those temporary market anomalies and market dislocations? Sure. Can they do so repeatedly and consistently over time such that they beat the overall stock market? Many experts think not. In fact, Barrons’ research showed that hedge funds only beat the market by an average of 1.5% annually over the past 20 years. After subtracting the 2% annual fees these investment managers charge the pensions and endowments which are their own investors, they lose money. Think you can beat the average hedge fund manager? Statistically, it’s possible. For a while. Until you don’t. See later points on automating portions (or a substantial amount) of your investments. As humans, we all like crunching data and seeking out patterns. It’s usually not wise in the realm of public markets investing.</p>\n\n<p><strong>#11 Look for large undervalued companies</strong></p>\n\n<p>The market is fond of making mountains out of molehills. If we assume that it is the habit of the market to overvalue common stocks which have been showing excellent growth or are glamorous for some other reason, it is logical to expect that it will undervalue—relatively, at least—companies that are out of favor because of unsatisfactory developments of a temporary nature. Quote from Benjamin Graham.</p>\n\n<p>Hunt for true bargains. Graham defines a true bargain as a company that is currently trading at a 50% or more discount from its inherent/intrinsic value. For instance, Facebook was a good example of an interesting investment opportunity for growth at a reasonable price (GARP) during the major market crash in 2020 and when the company made global headlines for it’s privacy issues. See the referenced two major dips on Google Finance here. The global food giant Wal-Mart provides another good example of a value-oriented investment with a healthy long-term dividend. Wal-Mart was trading in the low $80s/ share in 2018 when Amazon was soaring. Check Wal-Mart today. As conventional wisdom goes, markets tend to overcorrect during negative news cycles and overbuy/overpay when the sky is blue, the sun is out and wind behind the sails is plentiful.</p>\n\n<p><strong>#12 Expect market volatility (and have nerves of steel during this time)</strong></p>\n\n<p>“In any case the investor may as well resign himself in advance to the probability rather than the mere possibility that most of his holdings will advance, say, 50% or more from their low point and decline the equivalent one-third or more from their high point at various periods in the next five years.</p>\n\n<p>In the end, how your investments behave is much less important than how you behave.” Quotes from Benjamin Graham</p>\n\n<p>Manage your emotions. If you can’t (like most all of us), read the following two points on micromanaging investments and market volatility. Re-read them. Then, re-read them again. Jason Zweig points to the work of world-renown psychologists Daniel Kahneman and Amos Tversky, whose studies have shown that we experience negative emotions and pain from loss twice as intensely as we experience joy and pleasure from gain. This “loss aversion” principle applies not only to financial markets but to many aspects of life. You might check out Daniel Kahneman’s bestseller Thinking Fast and Slow to dig deeper into these psychological forces that influence how we react and behave every day. Markets will inevitably decline, sometimes by as much as 50% or more. Remain focused on the long-run by having nerves of steel. Remember the 2007-2008 Great Recession and the 2020 Covid-19 Global Pandemic and analyze those stock market dips in the context of current market prices. Graham reminds us that:</p>\n\n<p>For indeed, the investor’s chief problem—and even his worst enemy—is likely to be himself. (“The fault, dear [investor/Brutus], is not in our stars—[and not in our stocks]—but in ourselves….” – William Shakespeare). We have seen much more money made and kept by “ordinary people” who were temperamentally well suited for the investment process than by those who lacked this quality, even though they had an extensive knowledge of finance, accounting, and stock-market lore.</p>\n\n<p><strong>#13 Do not micromanage your investments</strong></p>\n\n<p>“It is for these reasons of human nature, even more than by calculation of financial gain or loss, that we favor some kind of mechanical method for varying the proportion of bonds (less risky) to stocks (more risky) in the investor’s portfolio.”- Quote from Benjamin Graham.</p>\n\n<p>Avoiding micromanaging of investments ties into the point above on keeping emotions in check. You might focus on rebalancing your portfolio between risky and less risky assets 1-2 times/ year rather than choosing new stocks endlessly throughout the year. Graham proposes a rule of thumb for maintaining a split in your portfolio of 100 – your age in risky assets (like stocks) and the balance in less risky assets like treasuries, cash and gold. Spending your time balancing and rebalancing your investment portfolio 1-2 times a year, for instance, is likely far better than readjusting your portfolio daily or weekly, which is a common investment mistake made by the best of us and is largely based on human emotion and current market news and headlines rather than based on sound financial analysis.</p>\n\n<p>Don’t overreact to the headlines. Everyone sees the headline and sells or buys depending on whether the headline was positive or negative. Challenge yourself to take a strong mental note (or better yet keep a log of your notes) and consider the particular headline in light of all the other news and headlines the next time you rebalance your portfolio (at most 1-2x/ year). Ben Graham reminds us that “most businesses change in character and quality over the years, sometimes for the better, perhaps more often for the worse. The investor need not watch his companies’ performance like a hawk; but he should give it a good, hard look from time to time. Basically, price fluctuations have only one significant meaning for the true investor. They provide him with an opportunity to buy wisely when prices fall sharply and to sell wisely when they advance a great deal.” In other words, you might take a contrarian approach when looking for interesting market dislocations.</p>\n\n<p><strong>#14 Automate. Automate. Automate.</strong></p>\n\n<p>“It is for these reasons of human nature, even more than by calculation of financial gain or loss, that we favor some kind of mechanical method for varying the proportion of bonds to stocks in the investor’s portfolio.” Quote from Benjamin Graham</p>\n\n<p>“If your investment horizon is long—at least 25 or 30 years—there is only one sensible approach: Buy every month, automatically, and whenever else you can spare some money.” Quote from Jason Zweig.</p>\n\n<p>Choose a financial investment app like Acorns to mechanize and automate the process of investing. If you are starting out investing in your 20s or 30s, you will have plenty of decades for the markets to work for you. You might trickle in however much you can afford in order to make these investments consistently. The beauty of Acorns is you can set up a recurring investment (of say $100 per week) without having to actively remember to invest daily/weekly/monthly. A unique feature of Acorns is that you can link your credit cards so that for every purchase you make, the “purchase amount” is rounded up to the next dollar and instantaneously invested in a broad set of index funds. Further, you can decide whether the funds are invested in broad index funds falling into a conservative, moderate, or aggressive approach, depending on your age and financial goals. Benjamin Graham explains the concept of “dollar-cost-averaging” (the approach used by the financial investment app Acorns), in the following way:</p>\n\n<p>“The third is the device of “dollar-cost averaging,” which means simply that the practitioner invests in common stocks the same number of dollars each month or each quarter. In this way he buys more shares when the market is low than when it is high, and he is likely to end up with a satisfactory overall price for all his holdings.”</p>\n\n<p>You might also consider using a personal financial app like Mint from Intuit or Plaid to manage your overall financial goals, which offer tools and features like a personal budget planner, credit monitoring, and “track my spending.”</p>\n\n<p><strong>#15 Never forget the reason for investing in the first place</strong></p>\n\n<p>“After all, the whole point of investing is not to earn more money than average, but to earn enough money to meet your own needs.” Quote from Jason Zweig.</p>\n\n<p>Many investors focus on either getting rich or making more money than their peers or simply beating the stock market averages. These investors tend to lose sight of the overall purpose of investing. Focus on your unique goals for investing as it relates to your unique financial situation. Are you trying to meet your and your family’s financial needs for this month or this year? Are you on the verge of retirement? Are you in the prime of your career? Each person’s financial situation is unique because the timing of our financial needs depends on our situation. However, all of us might benefit from reminding ourselves why we invest in the first place. Separate from investing, it’s also worth considering how much of our time we’re willing to trade in order to earn money, oftentimes to buy things we don’t need to impress people we don’t care about impressing in the first place. Time is the most valuable asset for anyone. Invest as much as you can in yourself through ongoing education, learning, and spending time with friends and family. In terms of your financial goals, specifically, see the point above on finding and using one of the best personal finance apps like Mint or Plaid.</p>\n\n<p><strong>#16 Understand the definition of the phrase “long-term” investments (as well as long-term financial goals)</strong></p>\n\n<p>“Psychologists have shown that humans have an inborn tendency to believe that the long run can be predicted from even a short series of outcomes.” Quote from Benjamin Graham</p>\n\n<p>Try to think about the “long-run” in blocks of 10/20/30/50 years from now, depending on your age. The two most glaring examples of “short-term” market disruptions in the context of true “long-term” investments or “long-term” personal or financial goals might be the 2007-2008 Great Recession or the 2020 Covid-19 Global Pandemic (see also WHO). While both crises were undoubtedly severe during the time, markets typically recover within a decade or less. Why is this? If you consider that “the stock market” is simply a marketplace for buying and selling ownership interests in companies and that you can own a small sliver of the US or world economy through broad market ETFs, it might not be surprising that over time there will be growth. The aggregate of companies nearly always grows over time because the global population of people is growing and collectively building and creating new cities, companies, patents, inventions, ideas, etc. Companies routinely collapse and fall out of the various stock market indices while other companies soar. Some recent examples include Tesla being incorporated into the S&amp;P 500 in 2020 on the one hand while GE was delisted from the S&amp;P 500 in 2018 as the last of the original members of the exchange and replaced by Walgreens on the other hand. Walgreens itself may ultimately fall (or be diminished) due to competition from Amazon, which is rolling out a healthcare platform of its own with online pharmacy delivery following the acquisition of PillPack.) You might track how some of the best consumer startups from 2021 or social media 3.0 startups are doing in the year 2030. Some of these companies may appear on the Nasdaq and be household names. Others might be totally forgotten. These concrete examples of market forces represent the most authoritative definition of American capitalism or American innovation. One of Henry Gindt’s colleagues characterized the United States as the largest business incubator the world has ever known.</p>\n\n<p>You can gain exposure to this collective economic growth in the United States through broad market ETFs like SPY (S&amp;P 500), QQQ (Nasdaq) or DIA (Dow Jones). You can also gain exposure to global economic growth through even broader market ETFs and mutual funds from Vanguard (ticker VTI), Charles Schwab (ticker SWTSX), and Fidelity (ticker FZROX) which all track the collective global stock market and have close to zero fees. Benjamin Graham tells us that “the intelligent investor has no interest in being temporarily right.”</p>\n\n<p><strong>#17 Tax optimize by holding investments for at least one year to reap benefits of the lower capital gains tax rate</strong></p>\n\n<p>Our new Constitution is now established, and has an appearance that promises permanency; but in this world nothing can be said to be certain, except death and taxes. – Quote from Benjamin Franklin in 1789</p>\n\n<p>The long-term capital gains tax rate for 2020-2021 is 15% for most single tax filers, but is 0% if annual income is below $80,000 and 20% if annual income is over $441,450. See the IRS page on capital gains for more detail. Aside from incurring high transaction costs from daily (or otherwise frequent) stock trading, when you sell an investment prior to holding that investment for at least one year, your profit will be subject to your typical income tax rate rather than the lower capital gains tax rates above.</p>\n\n<p><strong>Disclaimer:</strong> The views above represent the opinions of the OP and are supported by research from Benjamin Graham&#39;s Security Analysis from 1934 and The Intelligent Investor from 1949, along with Google and Yahoo Finance and public statements from Warren Buffett and Benjamin Graham. These investment principles do not constitute investment advice, but rather are general principles one might employ in reaching his or her overall financial goals. <em>All</em> investing bears risk, including possible loss of capital.</p>\n</div><!-- SC_ON -->",
  "score": 1694,
  "permalink": "/r/stocks/comments/llg0ke/17_investment_principles_from_warren_buffett_and/",
  "subreddit": "stocks",
  "id": "llg0ke",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728624098
}