{
  "author": "s3k2p7s9m8b5",
  "original_created_utc": 1636434250,
  "title": "Breaking News (REUTERS): \"El Salvador is Using Bitcoin Profits to Build a Border Wall to Stop the Massive Amount of Poor Emigrating Americans. Canada to Follow Up with Similar Measures\".",
  "created_utc": 1636493644,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><blockquote>\n<p>SAN SALVADOR-- Large caravans of US citizens are crossing Mexico to go south seeking for a better life for their families after the US Dollar has been collapsing at an accelerated rate and entered into hyperinflation, just 6 months after the US Treasury and the Fed decided to start minting their &#39;Trillion Dollar&#39; coins in high-quality watter-resistant polymer.</p>\n\n<p>President Bukele urged Mexico to deport them north and strengthen their borders, even offering partial funding for their own wall on their northern border.</p>\n\n<p>&quot;...this damned &#39;gringos&#39; are coming here and stealing jobs from our people... out of compassion I just hired Donald Trump Jr. to clean our pool, but he&#39;s doing a terrible job and just keeps peeing on it...&quot; Said one wealthy resident in San Salvador.</p>\n\n<p>&quot;I was selling &#39;pupusas&#39; on the streets since 2020 and kept my BTC instead of converting it to dollars... now I have a work force of 250 Americans selling them for me, they are unreliable but what can you expect for such a cheap labor, since they are illegal here we don&#39;t pay them the mínimum wage and they accept whatever we want to pay them...&quot; Said another local millionaire.</p>\n\n<p>We don&#39;t know how this will end, but the countries that adopted Bitcoin early are the new 1st World Superpowers. China also is now one of the poorest countries after banning the decentralized world reserve digital currency multiple times.</p>\n</blockquote>\n\n<p>PS: I&#39;m a time traveler, this article was published on March 5th, 2026.</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/Bitcoin/comments/qpwcii/breaking_news_reuters_el_salvador_is_using/",
  "subreddit": "Bitcoin",
  "id": "qpwcii",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "> SAN SALVADOR-- Large caravans of US citizens are crossing Mexico to go south\n> seeking for a better life for their families after the US Dollar has been\n> collapsing at an accelerated rate and entered into hyperinflation, just 6\n> months after the US Treasury and the Fed decided to start minting…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "> サンサルバドル--米国市民の大規模なキャラバンがメキシコを横断して南下している。\n> アメリカドルが加速度的に暴落し、ハイパーインフレに突入した後、家族のためにより良い生活を求めて\n> 米国財務省とFRBが鋳造開始を決定してからわずか6ヶ月で、米ドルは加速度的に暴落し、ハイパーインフレに突入した。\n> 米国財務省とFRBが米ドルの鋳造開始を決定してからわずか6ヶ月後にはハイパーインフレに突入しました。",
      "title": "速報（REUTERS）です。\"エルサルバドルはビットコインの利益で国境の壁を作り、大量の貧しいアメリカ人の移住を止めようとしている。カナダも同様の対策で追随へ」。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "> 圣萨尔瓦多 -- 大批美国公民正在穿越墨西哥，前往南方\n> 为他们的家人寻求更好的生活，因为美元已经\n> 美元加速崩溃并进入恶性通货膨胀，仅仅6个月后，美国财政部和美联储的\n> 在美国财政部和美联储决定开始铸造美元的6个月后，大批美国公民正在穿越墨西哥，前往南方寻求更好的生活。",
      "title": "突发新闻（REUTERS）。\"萨尔瓦多正在用比特币的利润来建造边境墙，以阻止大量贫穷的美国人移民。加拿大也将采取类似措施\"。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "> 聖薩爾瓦多 -- 大批美國公民正在穿越墨西哥，前往南方\n> 爲他們的家人尋求更好的生活，因爲美元已經\n> 美元加速崩潰並進入惡性通貨膨脹，僅僅6個月後，美國財政部和美聯儲的\n> 在美國財政部和美聯儲決定開始鑄造美元的6個月後，大批美國公民正在穿越墨西哥，前往南方尋求更好的生活。",
      "title": "突發新聞（REUTERS）。\"薩爾瓦多正在用比特幣的利潤來建造邊境牆，以阻止大量貧窮的美國人移民。加拿大也將採取類似措施\"。"
    }
  ]
}