{
  "author": "2manyquestions2ask2",
  "original_created_utc": 1653395417,
  "title": "is what my dad does normal?",
  "created_utc": 1653405432,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m (21F) deeply terrified of men since I got raped and mentally abused and my dad is part of the reason, he has always ignored me but since a year or two ago he started doing a lot of gross things like touching my legs and hips, kissing my neck and ears or touching my ass while I sleep. He has stopped but now he looks way too much at me when I&amp;#39;m on shorts and few days ago he made some comments about my ass as a &amp;quot;joke&amp;quot; but after all the stuff he has done I don&amp;#39;t know what to think. I know it&amp;#39;s not normal but maybe those comments are. He doesn&amp;#39;t know anything about me getting sexually abused but still it isn&amp;#39;t normal to touch your daughter like that right? I just wanna know if those comments are normal or not&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 138,
  "permalink": "/r/TooAfraidToAsk/comments/uwppw0/is_what_my_dad_does_normal/",
  "subreddit": "TooAfraidToAsk",
  "id": "uwppw0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm (21F) deeply terrified of men since I got raped and mentally abused and my\ndad is part of the reason, he has always ignored me but since a year or two ago\nhe started doing a lot of gross things like touching my legs and hips, kissing\nmy neck and ears or touching my ass while I sleep. He has…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はレイプされ、精神的虐待を受けて以来、男性に深く怯えています。\n父もその一人で、いつも私を無視していましたが、1〜2年前から\n私の足やお尻を触ったり、首や耳にキスしたり、気持ち悪いことをたくさんするようになりました。\n首や耳にキスしたり、寝ている時にお尻を触ったり。彼は...",
      "title": "は、父がやっていることは普通なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我（21岁）自从被强奸和精神虐待后，对男人深感恐惧。\n我父亲也是其中的一个原因，他总是忽略我，但从一两年前开始\n他开始做很多恶心的事情，比如触摸我的腿和臀部，亲吻\n我的脖子和耳朵，或者在我睡觉时摸我的屁股。他有...",
      "title": "我爸爸做的事情正常吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我（21歲）自從被強姦和精神虐待後，對男人深感恐懼。\n我父親也是其中的一個原因，他總是忽略我，但從一兩年前開始\n他開始做很多噁心的事情，比如觸摸我的腿和臀部，親吻\n我的脖子和耳朵，或者在我睡覺時摸我的屁股。他有...",
      "title": "我爸爸做的事情正常嗎？"
    }
  ]
}