{
  "author": "tranceology3",
  "original_created_utc": 1655926612,
  "title": "Manipulation is strong in the sub",
  "created_utc": 1655946793,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;If you follow this sub constantly, everyday you will notice how fast the sentiment switches from bullish to bearish. This is always laughed at by people saying how bi-polar it is in here. &lt;/p&gt;\n\n&lt;p&gt;However, like everything in social media, I believe there are agendas from bots/paid actors, multi accounts that deliberately push to sentiment here in a bullish/bearish direction for their financial gain. They could be either shorting or going long with heavy positions. When the market shifts directions.&lt;/p&gt;\n\n&lt;p&gt;I have never interacted with so many experts that say crypto is dead now, and only meant for scams/ponzis - the tech is all BS. I also have received many downvotes for stating that crypto, mainly BTC is fine and will rebound - but when crypto is climbing, its filled with upvotes. This heavy sentiment shift leads me to believe there is an agenda to attack indecisive investor emotions to either sell or buy, so they can profiit.&lt;/p&gt;\n\n&lt;p&gt;So don&amp;#39;t forget, when there are profits to made that can leverage off the public, the people you are talking to here or other platforms with their crypto advice could actually just be trying to move the market in one direction. In other words they could ultimately believe in BTC but just want to talk crap so you sell, and they scoop up more cheap BTC.&lt;/p&gt;\n\n&lt;p&gt;Stick to your plan no matter what people say who just want you to follow the sentiment.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 319,
  "permalink": "/r/CryptoCurrency/comments/vidgkd/manipulation_is_strong_in_the_sub/",
  "subreddit": "CryptoCurrency",
  "id": "vidgkd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "If you follow this sub constantly, everyday you will notice how fast the\nsentiment switches from bullish to bearish. This is always laughed at by people\nsaying how bi-polar it is in here.\n\nHowever, like everything in social media, I believe there are agendas from\nbots/paid actors, multi accounts…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブを常に追っていると、毎日、いかに速く\nを感じることでしょう。このことは、いつも人々に笑われています。\nと笑われます。\n\nしかし、ソーシャルメディアのすべてがそうであるように、私は、ボット/有料俳優、マルチプレイヤーからの意図があると信じています。\nボット/有料アクター、マルチアカウント...",
      "title": "操作性はサブで強い"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你经常关注这个子，你会注意到每天从看涨到看跌的情绪转换有多快。\n情绪从看涨转为看跌。这总是被人们嘲笑\n说这里是多么的两极化。\n\n然而，就像社会媒体中的一切一样，我相信有一些来自于\n机器人/有偿演员，多个账户......",
      "title": "操纵性很强的子"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你經常關注這個子，你會注意到每天從看漲到看跌的情緒轉換有多快。\n情緒從看漲轉爲看跌。這總是被人們嘲笑\n說這裏是多麼的兩極化。\n\n然而，就像社會媒體中的一切一樣，我相信有一些來自於\n機器人/有償演員，多個賬戶......",
      "title": "操縱性很強的子"
    }
  ]
}