{
  "author": "Enormouslypoor",
  "the_new_excerpt": "In the future we’ll hear lots of bullshit about bitcoiners from politicians and\nall kinds of parasites. They will say we were lucky. They will say we were\nselling drugs and stolen organs to get bitcoins. They will say we don’t deserve\nto be rich.\n\nThey won’t talk about us spending countless hours…",
  "original_created_utc": 1614815909,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在未来我们会听到很多关于比特币玩家的废话，从政客和\n各种各样的寄生虫。他们会说我们很幸运 他们会说我们是\n贩卖毒品和偷来的器官来获取比特币. 他们会说我们不值得\n变得富有。\n\n他们不会说我们花了无数的时间... ...",
      "title": "现在他们笑了，然后他们就会来找我们的比特币了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在未來我們會聽到很多關於比特幣玩家的廢話，從政客和\n各種各樣的寄生蟲。他們會說我們很幸運 他們會說我們是\n販賣毒品和偷來的器官來獲取比特幣. 他們會說我們不值得\n變得富有。\n\n他們不會說我們花了無數的時間... ...",
      "title": "現在他們笑了，然後他們就會來找我們的比特幣了"
    }
  ],
  "title": "Now they laugh, then they will come after our bitcoins",
  "created_utc": 1614854588,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In the future we’ll hear lots of bullshit about bitcoiners from politicians and all kinds of parasites. They will say we were lucky. They will say we were selling drugs and stolen organs to get bitcoins. They will say we don’t deserve to be rich.</p>\n\n<p>They won’t talk about us spending countless hours studying something new, while they were wasting their time. They won’t talk about the sacrifices we made to buy bitcoins, while they were wasting their money. They won’t talk about how we saw our portfolios drop in value by 80% while they were “safely” keeping their money in the bank. They won’t talk about how everyone laughed at us when we said we were buying bitcoins or when we asked sellers if they accepted them as a payment method. </p>\n\n<p>We will be their target. Get ready to hear lots of bullshit about inequality and about making bitcoin illegal or stealing bitcoins from ants to “redistribute” them among grasshoppers.</p>\n</div><!-- SC_ON -->",
  "score": 270,
  "permalink": "/r/Bitcoin/comments/lx7v4q/now_they_laugh_then_they_will_come_after_our/",
  "subreddit": "Bitcoin",
  "id": "lx7v4q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542567854
}