{
  "author": "NiccyCage",
  "the_new_excerpt": "So as most know the motley fool is some trash. I have no problem admitting I\npaid the $100 yearly subscription as I just wanted to see the difference between\ntheir free articles and paid.\n\nWell I quickly found out they are just as annoying and clickbait as the free\narticles and to be honest I don't…",
  "original_created_utc": 1618644914,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ご存知の通り、Motley foolはゴミのような存在です。私は問題なく認めます。\n年間100ドルの購読料を払ったのは、無料記事と有料記事の違いを確認したかったからです。\n無料記事と有料記事の違いを知りたかったからです。\n\nすぐにわかったのは、無料記事と同じようにうっとうしいクリックベイトだということ。\n正直に言うと、私は...",
      "title": "Motley Fool = Absolute F*ck Heads"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以大多数人都知道杂牌军是一些垃圾。我没有问题承认我\n付了100美元的年费，因为我只是想看看之间的差异。\n其免费文章和付费。\n\n好吧，我很快就发现，他们是一样烦人和点击诱饵，因为免费的。\n文章，说实话，我不... ...",
      "title": "莫特利愚人节=绝对的混蛋头颅"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以大多數人都知道雜牌軍是一些垃圾。我沒有問題承認我\n付了100美元的年費，因爲我只是想看看之間的差異。\n其免費文章和付費。\n\n好吧，我很快就發現，他們是一樣煩人和點擊誘餌，因爲免費的。\n文章，說實話，我不... ...",
      "title": "莫特利愚人節=絕對的混蛋頭顱"
    }
  ],
  "title": "Motley Fool = Absolute F*ck Heads",
  "created_utc": 1618647450,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So as most know the motley fool is some trash. I have no problem admitting I paid the $100 yearly subscription as I just wanted to see the difference between their free articles and paid. </p>\n\n<p>Well I quickly found out they are just as annoying and clickbait as the free articles and to be honest I don&#39;t care what other services they have. The articles say enough. </p>\n\n<p>I chalked up the $100 as an L and said fuck it until tonight. The whole &quot;wE doNt recOMmeNd XYZ sTocK, CLicK hEre tO sEE oUr 5 FaVorItE sTockS&quot; or whatever it is got me to try to cancel my subscription. Well, let&#39;s just say you cant cancel it very easily. I had to write them a godddamn letter to request my account closed. Some bullshit if you ask me. </p>\n\n<p>It was easier stealing the Declaration of Independence....smh</p>\n</div><!-- SC_ON -->",
  "score": 817,
  "permalink": "/r/stocks/comments/msmeyk/motley_fool_absolute_fck_heads/",
  "subreddit": "stocks",
  "id": "msmeyk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171526129
}