{
  "author": "A_Few_Kind_Words",
  "original_created_utc": 1624535893,
  "title": "Why do people get so offended by swear words?",
  "created_utc": 1624556768,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>To preface, I am neurodivergent and really struggling with swearing, to me it is simply emphasis or expression using the words available to me.</p>\n\n<p>Don&#39;t get me wrong, I understand calling someone an unpleasant name brings insult, I&#39;m not talking about that. </p>\n\n<p>What I don&#39;t understand is why people get so offended by the words &quot;shit&quot; or &quot;fuck&quot; (or similar words), to me they are nothing more than words that lend emphasis, but my mother gets embarrassed and my father gets annoyed. I&#39;ve seen others get irate or upset over &quot;swearing&quot; too.</p>\n\n<p>To me swear words are just that, they&#39;re words, they hold no inherent power or added nastiness. I <em>am</em> trying to stop using so called swear words because my parents don&#39;t much like it (I don&#39;t live at home and I am old enough and ugly enough to look after myself) but it frustrates me to no end that they would allow something so stupid to have such control over their emotions and feelings, I don&#39;t understand why anyone would allow anyone else to control their mental state in such a way with such a simple thing as saying &quot;fuck&quot; or &quot;shit&quot;.</p>\n\n<p>Words only hold what power we give them, so why do people give such words the power to offend when they can choose not to? Why would anyone <em>choose</em> to get pissy over a 4 letter arrangement that holds no inherent power on its own?</p>\n\n<p>It is incredibly frustrating that I can&#39;t get my head around this, it seems inherently ridiculous to grant others the power to control your emotional state so easily, please help. Thanks.</p>\n\n<p>Edit: Thanks to everyone that has commented, I genuinely really appreciate the time folk are taking to explain this to me and to challenge my views, it has helped me massively! Special thanks to <a href=\"/u/Freepurrs\">/u/Freepurrs</a> who has managed to nail it down to (at least in one major part) a matter of perspective, I genuinely believe I am getting a much better understanding here and that goes a long way to being able to break this habit and understand why people react the way they do to words that, to me, seem completely harmless.</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/o6zeg5/why_do_people_get_so_offended_by_swear_words/",
  "subreddit": "NoStupidQuestions",
  "id": "o6zeg5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "To preface, I am neurodivergent and really struggling with swearing, to me it is\nsimply emphasis or expression using the words available to me.\n\nDon't get me wrong, I understand calling someone an unpleasant name brings\ninsult, I'm not talking about that.\n\nWhat I don't understand is why people get…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "前置きが長くなりましたが、私は神経衰弱で、悪口には本当に苦労しています。\n私にとって悪口とは、単に自分が使える言葉を使って強調したり表現したりすることです。\n\n誤解しないでほしいのですが、誰かを不快な名前で呼ぶと侮辱になることは理解しています。\n侮辱になることは理解しています。\n\n私が理解できないのは、人々がなぜ...",
      "title": "なぜ、人は汚い言葉に腹を立てるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "先说一下，我是个神经分裂症患者，对说脏话真的很纠结，对我来说就是\n对我来说，它只是用我能用的词来强调或表达。\n\n不要误会我的意思，我知道叫别人不愉快的名字会带来侮辱。\n侮辱，我不是在说这个。\n\n我不明白的是为什么人们会...",
      "title": "为什么人们对脏话如此反感？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "先說一下，我是個神經分裂症患者，對說髒話真的很糾結，對我來說就是\n對我來說，它只是用我能用的詞來強調或表達。\n\n不要誤會我的意思，我知道叫別人不愉快的名字會帶來侮辱。\n侮辱，我不是在說這個。\n\n我不明白的是爲什麼人們會...",
      "title": "爲什麼人們對髒話如此反感？"
    }
  ]
}