{
  "author": "toyume",
  "original_created_utc": 1638431183,
  "title": "Can we take time to recognize original and helpful posts that actually took effort to research and write? Here are good examples of great DD, research, and educational posts in the last 30 days",
  "created_utc": 1638441177,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I love me some joke posts and popular &amp;quot;unpopular&amp;quot; opinions as much as the next guy, but a lot of them should&amp;#39;ve been a comment in the thread it&amp;#39;s reacting to instead of a full post.  &lt;/p&gt;\n\n&lt;p&gt;The good news is, we have fellow redditors here who took the time time to research, understand, and actually make a writeup to help and educate others.&lt;/p&gt;\n\n&lt;p&gt;Unfortunately, their original work often gets buried by joke and crypto showerthoughts.&lt;/p&gt;\n\n&lt;p&gt;Here are some of the most helpful posts I personally encountered in the past month alone:&lt;/p&gt;\n\n&lt;h1&gt;1. &lt;a href=\"https://np.reddit.com/r/CryptoCurrency/comments/qtmm1n/how_to_create_and_sell_nfts_for_free_no_gas_fees/\"&gt;How to create and sell NFTs for free&lt;/a&gt;&lt;/h1&gt;\n\n&lt;p&gt;The OP made a step-by-step tutorial on how to mint your own NFTs using Opensea - without spending on gas fees. All the way from connecting your Eth wallet to uploading your art to laying down prices.&lt;/p&gt;\n\n&lt;h1&gt;2. &lt;a href=\"https://np.reddit.com/r/CryptoCurrency/comments/r3do0f/several_resources_and_websites_to_help_dyor/\"&gt;Resources and Websites to Help DYOR&lt;/a&gt;&lt;/h1&gt;\n\n&lt;p&gt;A lot of people always say DYOR, but let&amp;#39;s face it, how many of us actually know how? Here the OP lists several websites and resources to put you up to speed on any coin. Now you can&amp;#39;t claim plausible deniability when you lose money!&lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s an additional &lt;a href=\"https://np.reddit.com/r/CryptoCurrency/comments/qmisp5/most_of_people_just_say_dyor_before_investing_but/\"&gt;how to DYOR guide&lt;/a&gt; by another user.&lt;/p&gt;\n\n&lt;h1&gt;3. &lt;a href=\"https://np.reddit.com/r/CryptoCurrency/comments/r218s7/the_most_important_piece_of_regulation_on/\"&gt; I read through all 405 pages of the “Proposal for EU Regulation on Markets in Crypto-Assets” so you don’t have to&lt;/a&gt;&lt;/h1&gt;\n\n&lt;p&gt;Is this crypto regulation that actually looks to develop technology? Gasp. The OP breaks down the major points of one of the most important piece of legislation so far. Warning: you might get a hard on.&lt;/p&gt;\n\n&lt;h1&gt;4. &lt;a href=\"https://np.reddit.com/r/CryptoCurrency/comments/r4umf2/i_had_made_a_post_few_days_ago_asking_users_where/\"&gt;I made a post few days ago asking users where they get their crypto information. This is the compilation of the responses.&lt;/a&gt;&lt;/h1&gt;\n\n&lt;p&gt;OP compiled a huge list of reliable sources including coin trackers, reputable influencers, mainstream media, and non pump and dump Youtube channels.&lt;/p&gt;\n\n&lt;h1&gt;5. &lt;a href=\"https://np.reddit.com/r/CryptoCurrency/comments/qpel21/a_short_guide_to_understanding_bridges_wrapped/\"&gt;A short guide to understanding bridges, wrapped tokens, and interoperability platforms&lt;/a&gt;&lt;/h1&gt;\n\n&lt;p&gt;After a few weeks in crypto, you&amp;#39;re bound to encounter people hyping up bridges and interoperability functions. The OP explains why this is a big deal, how to make sense of all of it, and what coins to invest in. Spoiler alert: DOT, CKB, ATOM, and QNT.&lt;/p&gt;\n\n&lt;h1&gt;6. &lt;a href=\"https://np.reddit.com/r/CryptoCurrency/comments/r2zliv/i_accidentally_rug_pulled_myself/\"&gt;I accidentally rug pulled myself&lt;/a&gt;&lt;/h1&gt;\n\n&lt;p&gt;A hilarious short story and great guide on how to make your own coin and how NOT to scam yourself.&lt;/p&gt;\n\n&lt;h1&gt;7. &lt;a href=\"https://np.reddit.com/r/CryptoCurrency/comments/quvhd5/are_you_a_crypto_newbie_heres_an_updated_list_of/\"&gt;Are you a crypto newbie? Here&amp;#39;s an updated list of scams you will 100% encounter on Reddit and Twitter&lt;/a&gt;&lt;/h1&gt;\n\n&lt;p&gt;An updated list of the most common crypto scams today. Learn how to identify them and save yourself the emotional distress.&lt;/p&gt;\n\n&lt;h1&gt;8. &lt;a href=\"https://np.reddit.com/r/CryptoCurrency/comments/qtacz9/a_few_reasons_why_doge_is_misunderstood_and_has/\"&gt;A few reasons why Doge is misunderstood and has better Tokenomics than you thought&lt;/a&gt;&lt;/h1&gt;\n\n&lt;p&gt;Op argues about a few of the “myths” surrounding Dogecoin and why it probably isn’t as “bad” as you thought.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 403,
  "permalink": "/r/CryptoCurrency/comments/r726xf/can_we_take_time_to_recognize_original_and/",
  "subreddit": "CryptoCurrency",
  "id": "r726xf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I love me some joke posts and popular \"unpopular\" opinions as much as the next\nguy, but a lot of them should've been a comment in the thread it's reacting to\ninstead of a full post.\n\nThe good news is, we have fellow redditors here who took the time time to\nresearch, understand, and actually make a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、ジョーク投稿や人気のある「不人気」な意見も大好きです。\nしかし、その多くは、そのスレッドに反応するコメントであるべきでした。\nを、完全な記事としてではなく\n\n良いニュースとしては、ここには時間をかけて\n調査し、理解し、実際に作る...",
      "title": "実際にリサーチや執筆に努力した、オリジナルで役立つ投稿を評価する時間を取れないでしょうか？この30日間に投稿されたDD、研究、教育関連の優れた記事の例を以下に示します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我和其他人一样喜欢一些笑话帖子和流行的 \"不受欢迎 \"的意见。\n但其中很多都应该是它所反应的主题中的一个评论\n而不是一个完整的帖子。\n\n好消息是，我们这里的红客们花了时间去\n研究，理解，并实际做出了一个...",
      "title": "我们能不能花点时间认可那些真正花心思研究和写作的原创和有益的帖子？以下是过去30天内伟大的DD、研究和教育帖子的好例子"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我和其他人一樣喜歡一些笑話帖子和流行的 \"不受歡迎 \"的意見。\n但其中很多都應該是它所反應的主題中的一個評論\n而不是一個完整的帖子。\n\n好消息是，我們這裏的紅客們花了時間去\n研究，理解，並實際做出了一個...",
      "title": "我們能不能花點時間認可那些真正花心思研究和寫作的原創和有益的帖子？以下是過去30天內偉大的DD、研究和教育帖子的好例子"
    }
  ]
}