{
  "author": "ProtoJoe",
  "original_created_utc": 1627922311,
  "title": "I've never been to the Eiffel Tower. How can I know for sure it exists?",
  "created_utc": 1627986613,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I hope this is the right subreddit to ask.</p>\n\n<p>Using the tower as an example, how can I know its real without physically being there? Its highly unlikely but not completely impossible that all pictures and videos I&#39;ve seen of it are fabrications. Or if someone tells me they&#39;ve been there they&#39;re lying.</p>\n\n<p>Basically, can a person truly verify the existence of something without personal experience of it? And is there anything in philosophy thats similar to these thoughts?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/askphilosophy/comments/owibjm/ive_never_been_to_the_eiffel_tower_how_can_i_know/",
  "subreddit": "askphilosophy",
  "id": "owibjm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I hope this is the right subreddit to ask.\n\nUsing the tower as an example, how can I know its real without physically being\nthere? Its highly unlikely but not completely impossible that all pictures and\nvideos I've seen of it are fabrications. Or if someone tells me they've been\nthere they're…",
  "localize": [
    {
      "locale": "ja",
      "title": "私はエッフェル塔に行ったことがありません。どうやって存在を確認すればいいのでしょうか？",
      "the_new_excerpt": "このサブレディットで質問するのが正しいことを願います。\n\n塔を例にとると、実際にそこにいなくても、その塔が本物だとどうやって知ることができますか？\n知ることができますか？私が見たタワーの写真やビデオが全て作り物である可能性は極めて低いですが、完全に不可能ではありません。\n可能性は低いですが、不可能ではありません。あるいは、誰かが私に「行ったことがある」と言ったとしても\n誰かがそこに行ったことがあると言っても、それは..."
    },
    {
      "locale": "zh",
      "title": "我从来没有去过埃菲尔铁塔。我怎么能确定它的存在？",
      "the_new_excerpt": "我希望这是个正确的分论坛，可以问。\n\n以塔为例，如果我没有亲身经历，怎么能知道它是真实的呢？\n么？它的可能性很小，但也不是完全不可能，我看到的所有图片和视频\n我所看到的所有图片和视频都是捏造的。或者如果有人告诉我他们去过\n在那里，他们是..."
    },
    {
      "locale": "zh-Hant",
      "title": "我從來沒有去過埃菲爾鐵塔。我怎麼能確定它的存在？",
      "the_new_excerpt": "我希望這是個正確的分論壇，可以問。\n\n以塔爲例，如果我沒有親身經歷，怎麼能知道它是真實的呢？\n麼？它的可能性很小，但也不是完全不可能，我看到的所有圖片和視頻\n我所看到的所有圖片和視頻都是捏造的。或者如果有人告訴我他們去過\n在那裏，他們是..."
    }
  ]
}