{
  "author": "Atlas_Unknown",
  "original_created_utc": 1639279064,
  "title": "I don't understand staking or the risks involved. Really hope someone can please help me",
  "created_utc": 1639313577,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi, I am very new to Crypto. I&amp;#39;ve been asking around and doing some research. I am thinking about staking, but I don&amp;#39;t really understand it, or the risk involved. Is there risk of losing my Crypto? It seems like there&amp;#39;s decent reward, but I just don&amp;#39;t understand the risk, or what I&amp;#39;m even doing. I kinda feel like I&amp;#39;m just putting money into a coin and hoping for a return. I guess that sounds really stupid. But if anyone could please help me by explaining staking and the risk involved I&amp;#39;d really appreciate it. &lt;/p&gt;\n\n&lt;p&gt;I think I may be too stupid for crypto. Hopefully that&amp;#39;ll work in my favor......&lt;/p&gt;\n\n&lt;p&gt;I hope this question is ok and I&amp;#39;m posting correctly.&lt;/p&gt;\n\n&lt;p&gt;Edit: Thank you to everyone for being so nice and for all your help and advice. I was really nervous about even asking. You&amp;#39;re all awesome people. Thank you so much!!!!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 160,
  "permalink": "/r/CryptoCurrency/comments/refrxn/i_dont_understand_staking_or_the_risks_involved/",
  "subreddit": "CryptoCurrency",
  "id": "refrxn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi, I am very new to Crypto. I've been asking around and doing some research. I\nam thinking about staking, but I don't really understand it, or the risk\ninvolved. Is there risk of losing my Crypto? It seems like there's decent\nreward, but I just don't understand the risk, or what I'm even doing. I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは、私はCryptoの超初心者です。いろいろ聞いたり、調べたりしています。I\nステーキングを考えていますが、よく理解できていませんし、リスクもわかりません。\nを含む。Cryptoを失うリスクはありますか？ちゃんとあるような気がするのですが\nしかし、私はそのリスクを理解していませんし、自分が何をしているのかさえも理解していません。I...",
      "title": "ステーキングやそのリスクを理解していない。誰かが私を助けてくれることを願っています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好，我对加密货币非常陌生。我一直在打听并做一些研究。I\n我正在考虑赌注，但我并不真正了解它，也不了解它的风险。\n所涉及的风险。是否有损失我的加密货币的风险？它看起来像有体面的\n奖励，但我只是不明白风险，或者我甚至在做什么。I...",
      "title": "我不懂押注，也不懂其中的风险。真的希望有人能帮助我"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好，我對加密貨幣非常陌生。我一直在打聽並做一些研究。I\n我正在考慮賭注，但我並不真正瞭解它，也不瞭解它的風險。\n所涉及的風險。是否有損失我的加密貨幣的風險？它看起來像有體面的\n獎勵，但我只是不明白風險，或者我甚至在做什麼。I...",
      "title": "我不懂押注，也不懂其中的風險。真的希望有人能幫助我"
    }
  ]
}