{
  "author": "Pupulikjan",
  "original_created_utc": 1638510365,
  "title": "CNN Business: Inflation can actually be good for everyday Americans and bad for rich peopple.",
  "created_utc": 1638536077,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m curious whether people buy this shit. Inflation is good for the poor but bad for the rich lmao. Who writes this nonsense. “You see, you broke already; it doesn’t matter if you more broke now, it’s a double negative and shit when you multiply two negatives it becomes positive. If you are rich, it’s a positive, and since inflation is negative when you multiply, it becomes a negative. So you see, it’s basic mathinomics, and if you question it, you prolly just stupid. Respectfully.” &lt;/p&gt;\n\n&lt;p&gt;Being in debt before the hit of inflation works to your advantage because technically, you now owe less money. Financially educated, wealthy people know how to use debt to their advantage. Broke people use debt to get into more debt. The rich can borrow against their own money and skip taxes; they can also pay back fast, so no need to pay the interest rates. Broke people pay the minimum, not realizing that their interest rate compounds against them. That&amp;#39;s how you get those videos on YouTube of students crying because they have been paying their student loans for three years and end up owing more than what they started with, lol.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 158,
  "permalink": "/r/CryptoCurrency/comments/r7rufe/cnn_business_inflation_can_actually_be_good_for/",
  "subreddit": "CryptoCurrency",
  "id": "r7rufe",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm curious whether people buy this shit. Inflation is good for the poor but bad\nfor the rich lmao. Who writes this nonsense. “You see, you broke already; it\ndoesn’t matter if you more broke now, it’s a double negative and shit when you\nmultiply two negatives it becomes positive. If you are rich,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このクソゲーを買う人がいるのか気になる。インフレは貧乏人には良いが、悪い\n金持ちのために......笑 誰がこんなくだらないことを書くんだ。\"ほら、あなたはもう破産した。\n今より一文無しになっても問題ない、二重のマイナスで糞の役にも立たない。\n2つのマイナスを掛け合わせるとプラスになる。もしあなたがお金持ちなら",
      "title": "CNNビジネス インフレは、実際には、日常のアメリカ人には良く、金持ちには悪いことがある。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我很好奇人们是否会买这种狗屎。通货膨胀对穷人有利，对富人不利\n对富人来说是坏事，笑死我了。谁写的这些废话。\"你看，你已经破产了；如果你现在更破产了，那也没关系。\n你看，你已经破产了；如果你现在更破产了，那也没有关系，这是一个双负数，而当你把两个负数相乘时，就会变成宝。\n两个负数相乘就会变成正数。如果你很有钱，...",
      "title": "CNN业务。通货膨胀实际上对普通美国人有利，对富人不利。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我很好奇人們是否會買這種狗屎。通貨膨脹對窮人有利，對富人不利\n對富人來說是壞事，笑死我了。誰寫的這些廢話。\"你看，你已經破產了；如果你現在更破產了，那也沒關係。\n你看，你已經破產了；如果你現在更破產了，那也沒有關係，這是一個雙負數，而當你把兩個負數相乘時，就會變成寶。\n兩個負數相乘就會變成正數。如果你很有錢，...",
      "title": "CNN業務。通貨膨脹實際上對普通美國人有利，對富人不利。"
    }
  ]
}