{
  "author": "rootpl",
  "original_created_utc": 1642015258,
  "title": "The mass adoption won't happen until \"Apple\" of crypto comes along.",
  "created_utc": 1642023891,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s pretty simple really. To get mass adoption to the levels we want, we need an iPhone style event into the market, by some massive and already well-established company. Sure LG and other companies made touch screen phones before Apple did, but Apple did it better and they made it much more simple to use. They&amp;#39;ve dumbed down the whole thing, so even half-trained monkey could do it.&lt;/p&gt;\n\n&lt;p&gt;This is what we need in crypto. Right now all we have is a crap-ton of different chains, bridges, multiple ecosystems, multiple wallets etc. it&amp;#39;s just too much for the average Joe. Heck, even for myself it was truly difficult to sell one coin the other day (not gonna shill here any names). It took me around 12 different steps, moving between bridges, converters and so on etc. before I was finally able to cash it out to FIAT without destroying myself with high fees to make it worthwhile. Sure, I could just cash out via traditional methods, but I&amp;#39;d lose like 15% of my coins doing that. This stuff should be automated a long time ago.&lt;/p&gt;\n\n&lt;p&gt;But this will take time, a lot of time. The true adoption will start when we are allowed to just add crypto to our Google Pay or Apple Pay by scanning a quick QR code from our crypto wallet, without thinking two secs or giving a single fuck if our coins are going to disappear because we&amp;#39;ve mistyped one or two letters in the wallet. Or because your wallet supports coins X, Y, Z but not coins A, B, C. Until then &amp;quot;mass adoption&amp;quot; is just an empty slogan that won&amp;#39;t happen for another 10 years or more.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 487,
  "permalink": "/r/CryptoCurrency/comments/s2eh5i/the_mass_adoption_wont_happen_until_apple_of/",
  "subreddit": "CryptoCurrency",
  "id": "s2eh5i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "It's pretty simple really. To get mass adoption to the levels we want, we need\nan iPhone style event into the market, by some massive and already\nwell-established company. Sure LG and other companies made touch screen phones\nbefore Apple did, but Apple did it better and they made it much more…"
}