{
  "author": "AllSeeing33",
  "the_new_excerpt": "In the UK I used a service called Ombudsman who contacted Coinbase on by behalf.\nWithin 24 hours of Oms notifying Coinbase after six months of support tickets my\naccount verified and restored with full funds.\n\nI provided them with all of my ticket IDs and screenshots showing the automated\nclosure…",
  "original_created_utc": 1622889008,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "英国ではOmbudsmanというサービスを利用しました。Ombudsmanは私に代わってCoinbaseに連絡してくれました。\nOmsがコインベースに通知してから24時間以内に、6ヶ月間のサポートチケットを経て、私のアカウントは検証され、全額返金されました。\n私のアカウントは検証され、全額が復元されました。\n\n私はすべてのチケットIDと自動閉鎖を示すスクリーンショットを提供しました。\n閉鎖...",
      "title": "(UK) 私がCoinbaseアカウントを返してもらった方法。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在英国，我使用了一个叫Ombudsman的服务，他们代表我联系了Coinbase。\n在Oms通知Coinbase的24小时内，经过六个月的支持票，我的\n我的账户被核实并恢复了全额资金。\n\n我向他们提供了我所有的票据ID和显示自动关闭的截图。\n关闭...",
      "title": "(英国)我是如何让我的Coinbase账户退回的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在英國，我使用了一個叫Ombudsman的服務，他們代表我聯繫了Coinbase。\n在Oms通知Coinbase的24小時內，經過六個月的支持票，我的\n我的賬戶被覈實並恢復了全額資金。\n\n我向他們提供了我所有的票據ID和顯示自動關閉的截圖。\n關閉...",
      "title": "(英國)我是如何讓我的Coinbase賬戶退回的。"
    }
  ],
  "title": "(UK) How I got my Coinbase account returned.",
  "created_utc": 1622944514,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In the UK I used a service called Ombudsman who contacted Coinbase on by behalf. Within 24 hours of Oms notifying Coinbase after six months of support tickets my account verified and restored with full funds.</p>\n\n<p>I provided them with all of my ticket IDs and screenshots showing the automated closure and ignored formal complaints. They then sent this directly to them and like magic the pending limitations were removed.</p>\n\n<p>Thank you to Ombudsman for the assistance.</p>\n\n<p>I hope this helps those whom have had their accounts randomly pending verification. Mine was several years old when this happened.</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/nssu8u/uk_how_i_got_my_coinbase_account_returned/",
  "subreddit": "CryptoCurrency",
  "id": "nssu8u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404881322
}