{
  "author": "dropdx",
  "the_new_excerpt": "I have boring 3-fund setups for retirement and brokerage over at Vanguard, but\nthis post is more regarding the amount I put towards \"play money\". I use\nRobinhood for this account, I know people dog on it, but it works for me for\nthis.\n\nBut, I'm not sure how I should handle this account. My goal is…",
  "original_created_utc": 1623296257,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はバンガードで退職金と証券会社のためにつまらない3つのファンドを設定しています。\n今回の投稿は、私が「プレイマネー」に充てている金額についてです。私はこの口座に\nこの口座にはRobinhoodを使っています。人々がそれに異議を唱えるのは知っていますが、これは私にとっては有効です。\nこれは。\n\nしかし、この口座をどのように扱えばいいのかわかりません。私の目標は...",
      "title": "誰もが何があっても一定の割合で利益を得ることができますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在Vanguard为退休和经纪业务设置了无聊的3个基金，但是\n这个帖子更多的是关于我投入 \"游戏资金 \"的数额。我使用\n这个账户使用Robinhood，我知道人们对它很反感，但它对我来说很有用\n这个。\n\n但是，我不确定我应该如何处理这个账户。我的目标是...",
      "title": "是否有人无论如何都要在某些百分比上获利？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在Vanguard爲退休和經紀業務設置了無聊的3個基金，但是\n這個帖子更多的是關於我投入 \"遊戲資金 \"的數額。我使用\n這個賬戶使用Robinhood，我知道人們對它很反感，但它對我來說很有用\n這個。\n\n但是，我不確定我應該如何處理這個賬戶。我的目標是...",
      "title": "是否有人無論如何都要在某些百分比上獲利？"
    }
  ],
  "title": "Does anyone just take profit at certain percentages no matter what?",
  "created_utc": 1623324560,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have boring 3-fund setups for retirement and brokerage over at Vanguard, but this post is more regarding the amount I put towards &quot;play money&quot;. I use Robinhood for this account, I know people dog on it, but it works for me for this.</p>\n\n<p>But, I&#39;m not sure how I should handle this account. My goal is to just make some side money, big or small. For example, I&#39;m up about 15% ($500) on BARK right now. Honestly, I haven&#39;t been very lucky with this account, and I&#39;ll usually get out of a position about break-even if I don&#39;t like the way it&#39;s going or I watch the price go up and back down, I guess I&#39;m a cautious casino player.</p>\n\n<p>But I was curious if anyone out there just takes profit at 5%, or 10%, etc no matter what? Just to take that profit no matter what at a set percentage? If so, how does it work out for you?</p>\n\n<p>Hopefully this is OK to post here, I was just thinking about it and got curious.</p>\n</div><!-- SC_ON -->",
  "score": 100,
  "permalink": "/r/investing/comments/nwe3qn/does_anyone_just_take_profit_at_certain/",
  "subreddit": "investing",
  "id": "nwe3qn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009742335
}