{
  "author": "DrNanno",
  "original_created_utc": 1629956948,
  "title": "Is it okay to attend christian events as an atheist?",
  "created_utc": 1629978749,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I’m new to my university and struggling to make new friends and this christian club was giving out flyers on campus and they have events for new people and stuff where they give free food and prizes. This last week they had a meeting to get to know each other and I won a bag of snacks (juice, some vegetables, and chips) but I gave it to a homeless man afterwards. This next week they’re going to have more events with more free stuff and though I’ve told some of them I’m an atheist, most of the club members think I’m a christian. Is this wrong?</p>\n</div><!-- SC_ON -->",
  "score": 112,
  "permalink": "/r/NoStupidQuestions/comments/pbtboy/is_it_okay_to_attend_christian_events_as_an/",
  "subreddit": "NoStupidQuestions",
  "id": "pbtboy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So I’m new to my university and struggling to make new friends and this\nchristian club was giving out flyers on campus and they have events for new\npeople and stuff where they give free food and prizes. This last week they had a\nmeeting to get to know each other and I won a bag of snacks (juice,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は大学に入学したばかりで、新しい友達を作るのに苦労しています。\nキリスト教系のクラブがキャンパスでチラシを配っていて、新入生向けのイベントをやっていて\n無料の食べ物や賞品を提供するイベントを行っています。先週は、お互いを知るためのミーティングがありました。\n先週、彼らはお互いを知るためのミーティングを行い、私はスナックの袋（ジュース、...）を獲得しました。",
      "title": "無神論者としてキリスト教のイベントに参加してもいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我刚到我的大学，正在努力结交新朋友。\n这个基督教俱乐部在校园里散发传单，他们为新人举办了一些活动。\n他们为新人举办活动，并提供免费食物和奖品。上周他们举行了一次\n我赢得了一袋零食（果汁，...",
      "title": "作为无神论者参加基督教活动可以吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我剛到我的大學，正在努力結交新朋友。\n這個基督教俱樂部在校園裏散發傳單，他們爲新人舉辦了一些活動。\n他們爲新人舉辦活動，並提供免費食物和獎品。上週他們舉行了一次\n我贏得了一袋零食（果汁，...",
      "title": "作爲無神論者參加基督教活動可以嗎？"
    }
  ]
}