{
  "author": "jam-hay",
  "the_new_excerpt": "The human race has exchanged many forms of his and services throughout the ages\nand Bitcoin is just another harmless example.\n\nIf a country stops or restricts you from exchanging digital units of\ncryptographically data for goods or services.. this should be viewed as an\ninfringement of the very…",
  "original_created_utc": 1619006278,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "人類は昔から様々な形で彼やサービスを交換してきました。\nビットコインもその一例にすぎません。\n\nもしある国が、暗号化されたデータのデジタル単位を商品やサービスと交換するのを止めたり制限したりしたら、それは\n暗号化されたデータのデジタル単位を商品やサービスと交換することを止めたり制限したりする国があれば、それはVer.5.0の侵害とみなすべきです。\nこれは、まさに...の侵害と見るべきです。",
      "title": "もしトルコのような政府が、あなたが使用することを許される価値交換の手段を指示するならば、通貨ではなく、政府を変えるべき時です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "古往今来，人类已经交换了许多形式的物品和服务。\n而比特币只是另一个无害的例子。\n\n如果一个国家阻止或限制你用数字单位的加密数据交换商品或服务。\n如果一个国家阻止或限制你用加密数据的数字单位交换商品或服务，这应被视为\n这应该被看作是侵犯了非常...",
      "title": "如果像土耳其这样的政府规定你只能使用哪种价值交换媒介，那么是时候改变你的政府了，而不是你的货币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "古往今來，人類已經交換了許多形式的物品和服務。\n而比特幣只是另一個無害的例子。\n\n如果一個國家阻止或限制你用數字單位的加密數據交換商品或服務。\n如果一個國家阻止或限制你用加密數據的數字單位交換商品或服務，這應被視爲\n這應該被看作是侵犯了非常...",
      "title": "如果像土耳其這樣的政府規定你只能使用哪種價值交換媒介，那麼是時候改變你的政府了，而不是你的貨幣。"
    }
  ],
  "title": "If a government like Turkey dictates what median of exchange of value you're only allowed to use.. it's time to change your government, not your currency.",
  "created_utc": 1619019131,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The human race has exchanged many forms of his and services throughout the ages and Bitcoin is just another harmless example.</p>\n\n<p>If a country stops or restricts you from exchanging digital units of cryptographically data for goods or services.. this should be viewed as an infringement of the very liberty and freedom that make us human.</p>\n</div><!-- SC_ON -->",
  "score": 1868,
  "permalink": "/r/Bitcoin/comments/mve36j/if_a_government_like_turkey_dictates_what_median/",
  "subreddit": "Bitcoin",
  "id": "mve36j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171517781
}