{
  "author": "Harucifer",
  "the_new_excerpt": "The Bitcoin network fees are absolutely ridiculous at this point, and devs are\nsucking their thumbs not realizing this could very well kill the asset. Why do\ny'all think we have over 4000 thousand different cryptoassets? It's because\nneither of them are solving the very simple problem of being fast…",
  "original_created_utc": 1619008033,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコインのネットワーク手数料は現時点では非常に馬鹿げており、開発者たちはこのことが資産を消滅させる可能性があることに気づかずに\n開発者は、これが資産を消滅させる可能性があることに気づかず、親指をしゃぶっています。なぜ\n4000以上の異なる暗号資産があると思いますか？それは\nどちらも「速い」という非常にシンプルな問題を解決していないからです...。",
      "title": "手数料がハンパない。ビットコインの価値を動かすのに58.44ドル？これは冗談ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在这一点上，比特币的网络费用是绝对荒谬的，而开发者们正在吸吮他们的拇指，没有意识到这很可能会扼杀资产。\n吮吸他们的拇指，没有意识到这很可能会扼杀这种资产。为什么\n你们都认为我们有超过4000种不同的加密资产？这是因为\n它们都没有解决非常简单的快速问题......",
      "title": "这些费用是很可怕的。58.44美元可以移动任何比特币的价值？这是个笑话吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在這一點上，比特幣的網絡費用是絕對荒謬的，而開發者們正在吸吮他們的拇指，沒有意識到這很可能會扼殺資產。\n吮吸他們的拇指，沒有意識到這很可能會扼殺這種資產。爲什麼\n你們都認爲我們有超過4000種不同的加密資產？這是因爲\n它們都沒有解決非常簡單的快速問題......",
      "title": "這些費用是很可怕的。58.44美元可以移動任何比特幣的價值？這是個笑話嗎？"
    }
  ],
  "title": "The fees are attrocious. $58.44 to move any value in Bitcoin? Is this a joke?",
  "created_utc": 1619030828,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The Bitcoin network fees are absolutely ridiculous at this point, and devs are sucking their thumbs not realizing this could very well kill the asset. Why do y&#39;all think we have over 4000 thousand different cryptoassets? It&#39;s because neither of them are solving the very simple problem of being fast and cheap to use (which are two of the very fundamental things a CURRENCY needs to be). Add to that Coinbase fees, conversion fees, selling fees, fees for breathing... This is not how crypto should be. <a href=\"https://ycharts.com/indicators/bitcoin_average_transaction_fee#:%7E:text=Bitcoin%20Average%20Transaction%20Fee%20is,K%25%20from%20one%20year%20ago\">$60 to move my bitcoin is absurd</a>, and $31 to move Ethereum is breathtaking. I can transfer money from bank to bank with ZERO USD in fees.. It’s ridiculous and it will start to take notice It’s slowing down usage, which slows down adoption and it&#39;s frustrating the hell out of people, myself included.</p>\n\n<p>This needs a fix. ASAP.</p>\n\n<p>&#x200B;</p>\n\n<p>EDIT: the shit-coin shilling in comments is pretty cringe.</p>\n</div><!-- SC_ON -->",
  "score": 995,
  "permalink": "/r/CryptoCurrency/comments/mvekwy/the_fees_are_attrocious_5844_to_move_any_value_in/",
  "subreddit": "CryptoCurrency",
  "id": "mvekwy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171523341
}