{
  "author": "jesusvsaquaman",
  "original_created_utc": 1630719291,
  "title": "Anyone still getting scammed by Robinhood probably deserves it at this point.",
  "created_utc": 1630741074,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If you’re dumb enough to see all the scandals and manipulation around Robinhood and keep investing in it, then I wouldn’t give two f#cks about what happens to you. People like this have it coming for them. They’re practically asking for it.</p>\n\n<p>Honestly, people should just invest in dexes instead they’re a much safer alternative. Some of them like MerryMen even fight Robinhood’s market manipulation. Me, I got scr#wed way back in the GME incident and pulled out ASAP! I knew the moment they got off the hook with zero consequences that they’re gonna do this again. And now look at AMC and GME stock traders there, they’re getting rekt.</p>\n</div><!-- SC_ON -->",
  "score": 186,
  "permalink": "/r/CryptoCurrency/comments/phib6q/anyone_still_getting_scammed_by_robinhood/",
  "subreddit": "CryptoCurrency",
  "id": "phib6q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "If you’re dumb enough to see all the scandals and manipulation around Robinhood\nand keep investing in it, then I wouldn’t give two f#cks about what happens to\nyou. People like this have it coming for them. They’re practically asking for\nit.\n\nHonestly, people should just invest in dexes instead…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もしあなたが、Robinhoodのスキャンダルや操作を見て、投資を続けるほどの馬鹿ならば\n投資を続けるような愚か者ならば、あなたに何が起ころうと私は気にしないでしょう。\nあなたのことは気にしません。このような人は自業自得です。彼らは事実上それを求めている\nそうですね。\n\nぶっちゃけ、みんなDEXに投資したほうがいいんじゃないかな...。",
      "title": "まだRobinhoodに騙されている人は、この時点で自業自得でしょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你足够愚蠢，看到所有的丑闻和围绕Robinhood的操纵行为\n并继续投资于它，那么我不会给两个f#cks关于发生在你身上的东西。\n你。像这样的人是咎由自取。他们实际上是自找的\n它。\n\n说实话，人们应该投资于德克士，而不是......",
      "title": "任何仍然被Robinhood欺骗的人，在这一点上可能是活该。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你足夠愚蠢，看到所有的醜聞和圍繞Robinhood的操縱行爲\n並繼續投資於它，那麼我不會給兩個f#cks關於發生在你身上的東西。\n你。像這樣的人是咎由自取。他們實際上是自找的\n它。\n\n說實話，人們應該投資於德克士，而不是......",
      "title": "任何仍然被Robinhood欺騙的人，在這一點上可能是活該。"
    }
  ]
}