{
  "author": "theepicone111",
  "the_new_excerpt": "Curious to see others highest conviction stocks regarding tech. I’m talking the\nAmazon, Facebook, Microsoft , apple , Netflix etc.\n\nPersonally I see Apple and Amazon with the highest upside at the moment.\nMicrosoft and google coming close.\n\nFor me, Apple having a 2t market cap where half their…",
  "original_created_utc": 1616328948,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "很想看看别人关于科技的信念最高的股票。我说的是\n亚马逊，Facebook，微软 ，苹果 ，Netflix等。\n\n我个人认为苹果和亚马逊目前上升空间最大。\n微软和谷歌接近。\n\n对我来说，苹果有2t的市值，其中一半的...",
      "title": "你最喜欢的大盘科技股？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "很想看看別人關於科技的信念最高的股票。我說的是\n亞馬遜，Facebook，微軟 ，蘋果 ，Netflix等。\n\n我個人認爲蘋果和亞馬遜目前上升空間最大。\n微軟和谷歌接近。\n\n對我來說，蘋果有2t的市值，其中一半的...",
      "title": "你最喜歡的大盤科技股？"
    }
  ],
  "title": "Your favourite large cap tech stocks?",
  "created_utc": 1616340990,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Curious to see others highest conviction stocks regarding tech. I’m talking the Amazon, Facebook, Microsoft , apple , Netflix etc. </p>\n\n<p>Personally I see Apple and Amazon with the highest upside at the moment. Microsoft and google coming close. </p>\n\n<p>For me, Apple having a 2t market cap where half their revenue is from a single product (iPhone) means they have a lot of potential to increase revenue from other streams. For years people have been saying people will stop buying iPhones and apple continuously proves them wrong. I believe they will substantially increase their revenues in 2021/2022 with their new Mac chips. They have a very loyal customer base and it’s very tempting to buy another apple product once you’ve become accustomed to one of them. Product line up is still relatively small so plenty of room to grow there too. IMO we could see 3t market cap easily this year assuming no catastrophic macro economic events. </p>\n\n<p>Amazon and Microsoft arguably have a better business model than apple. Plenty of revenue streams and margins are great. </p>\n\n<p>My top 3 would be Amazon, Microsoft, Apple. What would yours be?</p>\n</div><!-- SC_ON -->",
  "score": 97,
  "permalink": "/r/stocks/comments/m9vgk3/your_favourite_large_cap_tech_stocks/",
  "subreddit": "stocks",
  "id": "m9vgk3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752821011
}