{
  "author": "xadiant",
  "original_created_utc": 1637751303,
  "title": "This browser game should not be worth 8.8 Billion $",
  "created_utc": 1637768356,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Any gamers here? I have a rant to make.</p>\n\n<p>Decentraland. Probably everyone here heard of it. And many also bought and sell MANA. But how many of you actually even visited the website? It is now worth 4.87$ a token, with over 8.8 billion market cap. Now, I know how hard it is to make a game, and the fact that market cap doesn&#39;t reflect a realistic value for a blockchain game.</p>\n\n<p>However, the game is utterly shit. It is a browser game to start with. In my 10 minutes of gameplay, there is one annoying background music playing on a loop. The graphics are of course bad as expected. I don&#39;t think they even bothered to properly texture some stuff.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/e9dauy3dui181.png?width=1486&amp;format=png&amp;auto=webp&amp;s=2ea576f435f0267726c0bb3f16c099b55dc96f00\">The character creating screen</a></p>\n\n<p>You have two shapes and a bunch of free stuff to use. I think you can buy NFTs (worth probably thousands!) as avatars, which is cool I guess.  </p>\n\n<p><a href=\"https://preview.redd.it/qwr7d77pui181.png?width=1492&amp;format=png&amp;auto=webp&amp;s=d378818e5b739f02fac67231d22448f1bba78ea5\">The Main Menu</a></p>\n\n<p>This is where you start. There are a bunch of places you can teleport and a gaping blue asshole in the middle.</p>\n\n<p><a href=\"https://preview.redd.it/v46e3ly6vi181.png?width=1514&amp;format=png&amp;auto=webp&amp;s=9dc2a234e497681f19fb78d189aebc93e6a7658d\">Emotes I guess</a></p>\n\n<p>Not much to talk about.  </p>\n\n<p><a href=\"https://preview.redd.it/otjmbockvi181.png?width=1524&amp;format=png&amp;auto=webp&amp;s=26266a79efe4537813d22f2c36a7e242f69c9265\">The \\&quot;Casino\\&quot;</a></p>\n\n<p>At first I thought the &quot;casino&quot; was an empty shell. But it turns out there are invisible desks I can&#39;t interact with. Not sure if these didn&#39;t load in my computer or something else happened. I think there are like 3 casinos on the map.  </p>\n\n<p><a href=\"https://preview.redd.it/ygeorn7mwi181.png?width=1486&amp;format=png&amp;auto=webp&amp;s=ca0b3312f85209814f06e262aecc1a9104df9e1b\">Mining Minigame</a></p>\n\n<p>I have no idea how this works since I am on a guest account. You can pay 10 mana and buy 100 coins on a stand you can accidentally left click too.</p>\n\n<p>Decentraland in its core is a glorified casino game which was heavily influenced by second life. I don&#39;t think any adult who buys and sells thousands would legitimately play this game. The bubble is expanding as I write this post. What do you think, fellow cryptocurrency members?</p>\n</div><!-- SC_ON -->",
  "score": 172,
  "permalink": "/r/CryptoCurrency/comments/r12jz1/this_browser_game_should_not_be_worth_88_billion/",
  "subreddit": "CryptoCurrency",
  "id": "r12jz1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Any gamers here? I have a rant to make.\n\nDecentraland. Probably everyone here heard of it. And many also bought and sell\nMANA. But how many of you actually even visited the website? It is now worth\n4.87$ a token, with over 8.8 billion market cap. Now, I know how hard it is to\nmake a game, and the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ゲーマーの方はいらっしゃいますか？私は暴言を吐くことがあります。\n\nDecentraland。おそらくここにいる全員が聞いたことがあると思います。また、多くの人が購入・販売している\nMANAです。しかし、実際にホームページを見たことがある人はどれくらいいるでしょうか？現在、MANAの価値は\n1トークン4.87ドル、時価総額は88億円以上です。ゲームを作るのがどれだけ大変かは知っています。\nゲームを作ることがどれだけ難しいか、そして...",
      "title": "このブラウザゲームに88億ドルの価値があってはならない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这里有游戏玩家吗？我有一句话要讲。\n\nDecentraland。可能这里的每个人都听说过它。而且很多人也买过和卖过\nMANA。但是你们有多少人真正访问过这个网站？它现在的价值是\n4.87美元一个代币，市值超过88亿。现在，我知道做一个游戏有多难\n制作一个游戏有多难，而且...",
      "title": "这个浏览器游戏不应该价值88亿美元。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這裏有遊戲玩家嗎？我有一句話要講。\n\nDecentraland。可能這裏的每個人都聽說過它。而且很多人也買過和賣過\nMANA。但是你們有多少人真正訪問過這個網站？它現在的價值是\n4.87美元一個代幣，市值超過88億。現在，我知道做一個遊戲有多難\n製作一個遊戲有多難，而且...",
      "title": "這個瀏覽器遊戲不應該價值88億美元。"
    }
  ]
}