{
  "author": "clodhopper88",
  "the_new_excerpt": "I understand that smart investment decisions are gold mines, and timing the\nmarket correctly is golden.\n\nThat being said, reminding people about how much they would've made if they\ninvested X amount of dollars in a certain project then, only leads to people\nmaking poor financial decisions…",
  "original_created_utc": 1616287549,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我明白，聪明的投资决策是金矿，而时机的把握是\n正确的市场是黄金。\n\n话说回来，提醒人们，如果他们能赚到多少钱\n在某一项目上投资了X美元，那么，只会导致人\n做出错误的财务决定...",
      "title": "请看在上帝的份上，没有必要告诉人们错过的机会。每个人都完全知道，如果他们将X金额投资到X币--他们就会变得富有....。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我明白，聰明的投資決策是金礦，而時機的把握是\n正確的市場是黃金。\n\n話說回來，提醒人們，如果他們能賺到多少錢\n在某一項目上投資了X美元，那麼，只會導致人\n做出錯誤的財務決定...",
      "title": "請看在上帝的份上，沒有必要告訴人們錯過的機會。每個人都完全知道，如果他們將X金額投資到X幣--他們就會變得富有....。"
    }
  ],
  "title": "Please for the love of God, there no need to tell people about missed opportunities. Everyone is completely aware that if they'd have invested X amount into X coin - they'd be rich....",
  "created_utc": 1616298271,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I understand that smart investment decisions are gold mines, and timing the market correctly is golden. </p>\n\n<p>That being said, reminding people about how much they would&#39;ve made if they invested X amount of dollars in a certain project <strong>then</strong>, only leads to people making poor financial decisions <strong>now</strong>.</p>\n\n<p>Believe me, I would&#39;ve loved to keep my stacks of 0.08 cents ENJ that I bought back in 2018, and I&#39;m fully aware of what they&#39;d be worth now.... I know my opportunity may come again - but for newcomers they may feel pressured into making poor decisions by &quot;chasing the Crypto dragon&quot;.</p>\n\n<p>Remember, time in the market is better than timing in the market. There&#39;s no need to feel like you missed out because you didn&#39;t invest at the right time. </p>\n\n<p>Stick to the fundamentals, and you&#39;ll be just fine.... Don&#39;t be made to feel bad or feel as if you missed out because an opportunity slips through your fingers.</p>\n</div><!-- SC_ON -->",
  "score": 4768,
  "permalink": "/r/CryptoCurrency/comments/m9kfkf/please_for_the_love_of_god_there_no_need_to_tell/",
  "subreddit": "CryptoCurrency",
  "id": "m9kfkf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752816900
}