{
  "author": "Competitive_Pomelo27",
  "original_created_utc": 1655537294,
  "title": "[Unpopular opinion] You guys have been too caught up in crypto speculation that you have lost any reasonable way to logically think about why bitcoin/alts might go up or down.",
  "created_utc": 1655559888,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Seriously,   All i see all day are you degenerates literally speculating, &amp;quot;surely  it  wont go below 20k&amp;quot;, &amp;quot;its already hit the bottom&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;And   look what happens every single day. Bitcoin just keeps falling. Like   you guys gotta stop being in your own bubble pretending everything is   okay.&lt;/p&gt;\n\n&lt;p&gt;If you come over the to the   stock side (which is much less risky btw) you will see that we are able   to actually be intellectual when stocks are down. We know the reason   that stocks are red and we keep investing in stocks logically for   reasons like the company has good fundamentals and has equity and low   debt to get through a recession.&lt;/p&gt;\n\n&lt;p&gt;Some   of you just need to snap out of it and realize that bitcoin is so much   more riskier than any other form of investment, and if you speculate  you  just make it worse.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 305,
  "permalink": "/r/Bitcoin/comments/vf0xdp/unpopular_opinion_you_guys_have_been_too_caught/",
  "subreddit": "Bitcoin",
  "id": "vf0xdp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Seriously, All i see all day are you degenerates literally speculating, \"surely\nit wont go below 20k\", \"its already hit the bottom\".\n\nAnd look what happens every single day. Bitcoin just keeps falling. Like you\nguys gotta stop being in your own bubble pretending everything is okay.\n\nIf you come…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "真面目な話、私が一日中見ているのは、文字通り憶測で「きっと2万ドル以下にはならない」「もう底を打った」と\n2万ドル以下にはならない」「もう底を打った」。\n\nそして毎日何が起こるか見てみましょう。ビットコインは下がり続けてる お前らみたいな\nお前らみたいなバブルをやめろ すべてがうまくいってるふりをしろ\n\nもしあなたが...",
      "title": "[不評】あなた方は暗号投機に夢中になりすぎて、なぜビットコインやアルトが上がるのか、下がるのか、論理的に考える合理的な方法を失ってしまったのではありませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "说真的，我整天看到的都是你们这些堕落的人在猜测，\"肯定不会低于2万\"，\"已经触底了\"。\n它不会低于2万\"，\"它已经跌到了谷底\"。\n\n看看每一天都发生了什么。比特币一直在下跌。就像你们\n你们必须停止在自己的泡沫中假装一切都很好。\n\n如果你来...",
      "title": "[不受欢迎的意见]你们已经被加密货币的投机所吸引，以至于你们失去了任何合理的方式来逻辑地思考为什么比特币/美元可能上涨或下跌。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "說真的，我整天看到的都是你們這些墮落的人在猜測，\"肯定不會低於2萬\"，\"已經觸底了\"。\n它不會低於2萬\"，\"它已經跌到了谷底\"。\n\n看看每一天都發生了什麼。比特幣一直在下跌。就像你們\n你們必須停止在自己的泡沫中假裝一切都很好。\n\n如果你來...",
      "title": "[不受歡迎的意見]你們已經被加密貨幣的投機所吸引，以至於你們失去了任何合理的方式來邏輯地思考爲什麼比特幣/美元可能上漲或下跌。"
    }
  ]
}