{
  "author": "pseudoHappyHippy",
  "original_created_utc": 1639262134,
  "title": "Does it surprise you that it's technically possible for a $1 purchase of an asset to shoot the market cap up by a trillion dollars, or for a $100 billion purchase to not move the price by a single penny? Many misunderstand the mechanism that actually drives price movements. Let me explain.",
  "created_utc": 1639273631,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;h1&gt;Intro&lt;/h1&gt;\n\n&lt;p&gt;A lot of people seem to have misconceptions like thinking if x dollars flow into an asset, its market cap will go up by x dollars. In fact, it is not possible to determine how much money has been put in to an asset based on its market cap, or conversely how much a market cap will move when some amount of money flows into or out of the asset.&lt;/p&gt;\n\n&lt;p&gt;Price is simply a function of the current state of the order books across all markets that list the asset.&lt;/p&gt;\n\n&lt;p&gt;Consider this: let&amp;#39;s say the current price of BTC on Binance is 50k. What does that really mean? It simply means that the very cheapest limit sell order currently on their order books is for 50k. That&amp;#39;s what price means definitionally, right? Price is just the amount you have to pay to buy something, so on a CEX price is always simply the current cheapest limit sell.&lt;/p&gt;\n\n&lt;h1&gt;Example 1: Huge Purchase with No Effect on Market Cap&lt;/h1&gt;\n\n&lt;p&gt;Let&amp;#39;s say that the current price of BTC on Binance is $50k, and the person currently willing to sell at 50k (and who is thus the person currently defining the Binance price of BTC) is a whale who is offering 1000 BTC at 50k. Let&amp;#39;s say I am a whale buyer and I am put in a market order for 999 BTC. Well, I will end up buying all 999 from the whale seller, leaving them with 1 BTC still for sale at 50k. Since they are still selling 1 BTC at 50k, the price of BTC on Binance is still 50k. So I just bought nearly $50 million worth of BTC but the price (and therefore the market cap) didn&amp;#39;t move by even a penny.&lt;/p&gt;\n\n&lt;h1&gt;Example 2: Tiny Purchase with Huge Impact on Market Cap&lt;/h1&gt;\n\n&lt;p&gt;Now imagine another scenario. The current price of BTC on Binance is 50k, because the current cheapest limit sell is someone selling 0.01 BTC at the price of 50k. Let&amp;#39;s say I decide to buy 0.02 BTC. Well, half of that will come from the person selling 0.01 at 50k, which means I will consume that seller. The price of BTC on Binance will now teleport to whatever the next cheapest limit order is for (this is the mechanism by which price goes up when people buy). Since BTC is very high liquidity (which means lots of limit orders on the books packed densely across the price spectrum), the next cheapest limit sell after the 0.01 BTC at 50k would probably be at like 50.00001k. But, for the sake of the example, let&amp;#39;s imagine a more extreme scenario in which BTC liquidity is extremely low so the next cheapest offer after the 0.01 at 50k is at 50.5k, fully 1% more expensive. Ok, well, I end up getting 0.01 BTC at 50k, and another 0.01 BTC at 50.5k, fulfilling my market order and leaving the price of BTC on Binance at 50.5k. So, I have spent about $1000, but I moved the price of BTC by 1%, which means my purchase of $1000 increased the BTC market cap by nearly $10 billion.&lt;/p&gt;\n\n&lt;h1&gt;Example 3: Large Price Movement with No Trades Executed&lt;/h1&gt;\n\n&lt;p&gt;Price can even move without any trades executing at all. Let&amp;#39;s say the current price of BTC on Binance is 50k because the cheapest limit sell on the books is 1 BTC at 50k. Imagine that nobody is buying right now (who knows, maybe the biggest FUD ever just landed and everyone is too scared to buy) and imagine the seller is super impatient, so they suddenly move their 1 BTC limit sell down to $25k. Well, the price of BTC on Binance would thus be cut in half (since the price is always just the cheapest sell offer), which means the market cap would be too. This guy just singlehandedly cut the price of BTC on Binance in half just by moving his little limit sell for a single BTC. Of course, if this actually happened, his 1 BTC offer at $25k would be instantaneously consumed by limit buys, so the price would recover in milliseconds up to presumably around 50k where the next limit sells are at. So, in the end, this would just cause a humongous and brief wick down. But hopefully this example illustrates how it isn&amp;#39;t even necessary for trades to execute in order for prices to move. If every seller suddenly agreed to sell BTC for half of what they are currently offering, then the price of BTC would instantaneously be cut in half without a single sale happening (and in this case the price would actually stay there, since all the sell liquidity would have moved down together, rather than a single seller causing a wick).&lt;/p&gt;\n\n&lt;h1&gt;Closing Thoughts&lt;/h1&gt;\n\n&lt;p&gt;Now, I have been sort of glossing over the fact that for BTC and most cryptos, they are listed on many independent order books at once (one for each CEX), so an asset technically has as many different prices as markets that list it. So, if you caused a -50% wick on Binance for a hot second by placing a super cheap limit sell, you didn&amp;#39;t actually cut BTC market cap in half for a moment, you just cut the market cap of Binance BTC in half for a moment. Since there are dozens of markets that list BTC, there are dozens of different prices of BTC, and therefore dozens of different partial market caps of BTC. &amp;quot;The&amp;quot; market cap of BTC is just all the different BTC market caps on all markets added up. In reality, all the things I have described in this post are happening independently in every market for one asset like BTC, and then the prices across these markets are kept in sync due to arbitrage.&lt;/p&gt;\n\n&lt;p&gt;There are also markets that list BTC without using the order book structure. These are called DEXes (decentralized exchanges), and are the bread and butter of DeFi. If you&amp;#39;d like to know in detail how prices work with DEXes and liquidity pools, you can read my post on that topic &lt;a href=\"https://np.reddit.com/r/CryptoCurrency/comments/p7dhbn/but_how_does_defi_actually_work_a_guide_to/\"&gt;here&lt;/a&gt;. For the context of this post, though, all you need to know is that DEX prices are kept in line with CEX prices due to arbitrage traders trading liquidity pools against CEX prices. So, basically, CEX order books do 99% of the primary moving of prices, and then DEX prices are basically a reflection of CEX prices.&lt;/p&gt;\n\n&lt;p&gt;There you have it, that is how prices actually move. It&amp;#39;s not possible to know how much a given buy or sell will move a market cap unless you know the exact state of the order books at that moment on the exchange you&amp;#39;re selling on, as well as the amount of arbitrage friction between all markets.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 190,
  "permalink": "/r/CryptoCurrency/comments/realf2/does_it_surprise_you_that_its_technically/",
  "subreddit": "CryptoCurrency",
  "id": "realf2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "INTRO\n\nA lot of people seem to have misconceptions like thinking if x dollars flow into\nan asset, its market cap will go up by x dollars. In fact, it is not possible to\ndetermine how much money has been put in to an asset based on its market cap, or\nconversely how much a market cap will move when…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "イントロ\n\n多くの人が誤解しているようですが、「○○円が流れ込めば、○○円になる」というような\nを使えば、その資産の時価総額はXXドル上がる。実は、このようなことは\nある資産にどれだけの資金が投入されたかを時価総額で判断したり、あるいは\n逆に言えば、ある銘柄の時価総額がどの程度変動するのか。",
      "title": "1ドルの買い物で時価総額が1兆ドルになったり、1,000億ドルの買い物で価格が1円も動かなかったりすることが技術的に可能であることに驚きを感じますか？多くの人は、実際に価格が動くメカニズムを誤解しています。説明しましょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "简介\n\n很多人似乎都有一些误解，比如认为如果有x美元流入一项资产，其市值就会上升x美元。\n就会使它的市值上升X美元。事实上，我们不可能\n根据一项资产的市值来确定有多少资金被投入，或\n反过来说，当一个资产的市值发生变化时，它的市值会有多大变化？",
      "title": "从技术上讲，购买1美元的资产可以使市值上涨一万亿美元，或者购买1000亿美元的资产却不能使价格上涨一分钱，这是否让你感到惊讶？许多人误解了实际推动价格变动的机制。让我解释一下。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "簡介\n\n很多人似乎都有一些誤解，比如認爲如果有x美元流入一項資產，其市值就會上升x美元。\n就會使它的市值上升X美元。事實上，我們不可能\n根據一項資產的市值來確定有多少資金被投入，或\n反過來說，當一個資產的市值發生變化時，它的市值會有多大變化？",
      "title": "從技術上講，購買1美元的資產可以使市值上漲一萬億美元，或者購買1000億美元的資產卻不能使價格上漲一分錢，這是否讓你感到驚訝？許多人誤解了實際推動價格變動的機制。讓我解釋一下。"
    }
  ]
}