{
  "author": "Controversialthr0w",
  "original_created_utc": 1644869967,
  "title": "Why aren't cops held to a higher standard? (Police vs Military)",
  "created_utc": 1644889668,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I guess I just don&amp;#39;t understand why cops have extra leeway instead of stricter standards.&lt;/p&gt;\n\n&lt;p&gt;The only similar institution (the military) literally has its own legal code, which makes military members subject to twice the amount of laws.&lt;/p&gt;\n\n&lt;p&gt;If the powers that be thought that we don&amp;#39;t want military members to abuse their power...Surely someone must have thought about that for police officers?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 143,
  "permalink": "/r/TooAfraidToAsk/comments/ssk97n/why_arent_cops_held_to_a_higher_standard_police/",
  "subreddit": "TooAfraidToAsk",
  "id": "ssk97n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I guess I just don't understand why cops have extra leeway instead of stricter\nstandards.\n\nThe only similar institution (the military) literally has its own legal code,\nwhich makes military members subject to twice the amount of laws.\n\nIf the powers that be thought that we don't want military…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、なぜ警官がより厳格になる代わりに、特別な余裕を持つのか理解できないのだと思います。\nという基準を設けています。\n\n唯一類似した機関（軍隊）には、文字通り独自の法規範があります。\nそのため、軍人は2倍の法律の適用を受けることになります。\n\nもし権力者が「軍人はいらない」と思っていたら...。",
      "title": "なぜ警官はもっと高い水準に達しないのでしょうか？(警察と軍隊の比較)"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想我只是不明白为什么警察有额外的回旋余地而不是更严格的\n标准。\n\n唯一类似的机构（军队）实际上有自己的法律准则。\n这使得军队成员受到两倍的法律约束。\n\n如果当权者认为我们不希望军队...",
      "title": "为什么警察不以更高的标准要求自己？(警察与军队)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想我只是不明白爲什麼警察有額外的迴旋餘地而不是更嚴格的\n標準。\n\n唯一類似的機構（軍隊）實際上有自己的法律準則。\n這使得軍隊成員受到兩倍的法律約束。\n\n如果當權者認爲我們不希望軍隊...",
      "title": "爲什麼警察不以更高的標準要求自己？(警察與軍隊)"
    }
  ]
}