{
  "author": "nxb123",
  "the_new_excerpt": "*First off, this is my opinion based on the facts available. This is by no means\nfinancial advice. I am not a financial advisor*\n\nIf you are not familiar with EDGAR, it is the SEC’s database for various types\nof company filings. One of those filings is called the 13G.\n\n*“The Securities and Exchange…",
  "original_created_utc": 1612741130,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "*首先，这是我根据现有事实提出的意见。这绝不是\n财务建议。我不是财务顾问*\n\n如果你对EDGAR不熟悉，它是美国证券交易委员会的数据库，对各类\n的公司备案。其中一份文件被称为13G。\n\n*证券交易...",
      "title": "GME75%的股票怎么还被做空。S3是错的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "*首先，這是我根據現有事實提出的意見。這絕不是\n財務建議。我不是財務顧問*\n\n如果你對EDGAR不熟悉，它是美國證券交易委員會的數據庫，對各類\n的公司備案。其中一份文件被稱爲13G。\n\n*證券交易...",
      "title": "GME75%的股票怎麼還被做空。S3是錯的。"
    }
  ],
  "title": "How 75% of GME Shares Are Still Shorted. S3 is Wrong.",
  "created_utc": 1612761207,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>*First off, this is my opinion based on the facts available. This is by no means financial advice. I am not a financial advisor*</p>\n\n<p>If you are not familiar with EDGAR, it is the SEC’s database for various types of company filings. One of those filings is called the 13G. </p>\n\n<p>*“The Securities and Exchange Commission (SEC) Schedule 13G form is an alternative filing for the Schedule 13D form and is used to report a party&#39;s ownership of stock which exceeds 5% of a company&#39;s total stock issue. Schedule 13G is a shorter version of Schedule 13D with fewer reporting requirements.”*</p>\n\n<p>When a company decides to dispose of beneficial ownership of stock, and holds more then 5% of shares available, they are required to AMEND the filing 13G, making it the 13G/A. When these documents are submitted, they are filed under both the beneficial owner and issuer of stock in EDGAR. </p>\n\n<p>In the case of GameStop’s “short squeeze”, and understanding the exchange of shares during that time period, BlackRock Inc. (BLK) was the only institutional holder, owning over 5% of shares, that liquidated their position SO FAR. BlackRock Inc. liquidated 9,217,335 shares of GameStop on 1/26/2021.</p>\n\n<p><a href=\"https://www.sec.gov/edgar/search/?r=el#/dateRange=custom&amp;ciks=0001364742&amp;entityName=BlackRock%2520Inc.%2520(BLK\">https://www.sec.gov/edgar/search/?r=el#/dateRange=custom&amp;ciks=0001364742&amp;entityName=BlackRock%2520Inc.%2520(BLK)%2520(CIK%25200001364742)&amp;startdt=2016-01-26&amp;enddt=2021-01-27&amp;page=5</a>%2520(CIK%25200001364742)&amp;startdt=2016-01-26&amp;enddt=2021-01-27&amp;page=5)</p>\n\n<p>^control-f: GameStop</p>\n\n<p>BlackRock is the SECOND largest institutional holder of GME, behind FMR LLC with 9,534,090 shares, according to Yahoo Finance. So… you are probably wondering, “How many shares of GME do The Top 10 Institutions hold combined ?”</p>\n\n<p><a href=\"https://finance.yahoo.com/quote/GME/holders?p=GME\">https://finance.yahoo.com/quote/GME/holders?p=GME</a></p>\n\n<p>Let’s Count:</p>\n\n<p>*FMR LLC*   9,534,090</p>\n\n<p>*BlackRock Inc*    - 9,217,335 (According to 13G/A)</p>\n\n<p>*Vanguard Group Inc.* 5,288,507</p>\n\n<p>*Susquehanna International Group LLP* 4,444,128</p>\n\n<p>*Dimensional Fund Advisors LP*  3,948,114</p>\n\n<p>*Senvest Management LLC*  3,225,740</p>\n\n<p>*State Street Corporation* 2,609,487</p>\n\n<p>*Morgan Stanley* 1,995,842</p>\n\n<p>*Paradice Investment Management LLC* 1,832,526</p>\n\n<p>*Norges Bank Investment Management* 1,811,792</p>\n\n<p>Total: 25,472,891 Shares of GME or 25.473/46.89 = <strong>54% of Float Shares</strong></p>\n\n<p>&#x200B;</p>\n\n<p>On the same Yahoo Finance page where we found ‘Top Institutional Holder’ data, if you scroll down, you can see ‘Top Mutual Fund Holders’. Combined, these funds hold 18.75/46.89 = <strong>40%</strong> of float shares.</p>\n\n<p>*Note that two of these mutual funds own over 5% of shares, meaning they would need to file with the SEC if they were to sell. These two mutual funds hold <strong>22%</strong> of float shares. *</p>\n\n<p>Accounting for BlackRock’s liquidation, <strong>54</strong>% of shares are held by the Top 10 Institutional Holders at the moment. Lets say, worst case scenario, only the two biggest mutual funds are left holding shares, making that <strong>22%</strong> of float shares. So far, we have accounted for <strong>76%</strong> of all shares. </p>\n\n<p>The last data we have on short interest is ~<strong>122%</strong> of float shares. The media has reported numbers as low as <strong>33%</strong> short interest post squeeze<strong>,</strong> according to S3 partners. Mathematically, this is impossible. </p>\n\n<p>If short interest is truly <strong>33%,</strong> that means these institutional holders would have filed a 13G/A…. But they didn’t…..meaning they did not sell. This means that there is still, <strong>at a minimum, 76% of float shares shorted.</strong>  This is VERY high and could cause another squeeze.</p>\n\n<p><strong>TL:DR</strong></p>\n\n<p>As you know, lots of bagholders around the world are not selling. It just so happens that we are not alone. We have some of the BIGGEST institutions bagholding with us; <strong>minimum</strong> <strong>76% of float shares in fact</strong>. If you thought that we were the only greedy and vengeful mfs out there, you are sorrily mistaken. These institutions (i.e. Fidelity, Vanguard, Morgan Stanley) want to see this second squeeze just as much as you. Until then, HOLD THE LINE!!!</p>\n\n<p>Edit: I made a mistake. The 13G/A that BlackRock Inc filed on 1/26/2021 was a statement of ownership form, declaring that their position of GME was 9,217,335 shares. Their was no liquidation of shares.</p>\n</div><!-- SC_ON -->",
  "score": 8710,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/966iDtrJcLGWwK3ExeZ29af_WhuuCbf7JgjJIFs98nk.jpg?auto=webp&s=258b2aa4ecdcbc5e365d0ac10462d66c7c138422",
          "width": 206,
          "height": 204
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/966iDtrJcLGWwK3ExeZ29af_WhuuCbf7JgjJIFs98nk.jpg?width=108&crop=smart&auto=webp&s=bc6c04a4e04694478d7b80ac13c3da62cef72e5f",
            "width": 108,
            "height": 106
          }
        ],
        "variants": {},
        "id": "w8sM8HOcYwiCaSLW4ohd6k1vGjnBpH4ZJHdERI6HUWc"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/wallstreetbets/comments/leyrrr/how_75_of_gme_shares_are_still_shorted_s3_is_wrong/",
  "subreddit": "wallstreetbets",
  "id": "leyrrr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123217875
}