{
  "author": "Brokendresser123",
  "the_new_excerpt": "The movement in the market, especially with the nasdaq and tech stocks has been\nDIRECTLY related to treasury note rates, that’s what started this correction\nwe’re in last month. I won’t go into the macroeconomics, there are plenty of\nposts that talk about the trillions injected, money velocity, m2,…",
  "original_created_utc": 1615121808,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "市场的走势，尤其是纳斯达克和科技股的走势，一直是\n与国债利率直接相关，这才是这次调整的开始。\n我们在上个月。宏观经济我就不多说了，有很多。\n谈论万亿注入、货币速度、m2的帖子，...",
      "title": "本周实际决定股价的是什么，财资拍卖。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "市場的走勢，尤其是納斯達克和科技股的走勢，一直是\n與國債利率直接相關，這纔是這次調整的開始。\n我們在上個月。宏觀經濟我就不多說了，有很多。\n談論萬億注入、貨幣速度、m2的帖子，...",
      "title": "本週實際決定股價的是什麼，財資拍賣。"
    }
  ],
  "title": "What will actually determine stock prices this week, TREASURY AUCTIONS",
  "created_utc": 1615130826,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The movement in the market, especially with the nasdaq and tech stocks has been DIRECTLY related to treasury note rates, that’s what started this correction we’re in last month. I won’t go into the macroeconomics, there are plenty of posts that talk about the trillions injected, money velocity, m2, inflation....</p>\n\n<p>This week, over 200 billion of US debt is being auctioned to institutions (foreign and domestic).  Unless someone or some country or some institution wants to buy US debt for rates that won’t even match inflation, t-note rates must go up, the market will KEEP GOING DOWN. </p>\n\n<p><a href=\"https://www.treasurydirect.gov/instit/instit.htm?upcoming\">https://www.treasurydirect.gov/instit/instit.htm?upcoming</a></p>\n\n<p>With all the money being printed, most buyers have scoffed at the rate of returns on US debt, they’ll only buy if the rates are HIGHER. Thats what caused the rates to go up FASTER and HIGHER than what JPow or Yellen expected. No one wants to buy US debt at low return rates, especially with 5trillion injected in the last year into the open wallets of people and businesses that will certainly cause (already started) inflation.</p>\n\n<p>The stimulus itself passing won’t move the institutions, banks, or even hedge funds. The passing of that legislation was assumed in November elections, then fully confirmed after GA runoffs, and then again validated with dropping of the $15min wage. This legislation has been priced in. Don’t be surprised with more corrective days ahead as the treasury auctions happen this week and plan accordingly. </p>\n\n<p>TLDR; no one wants to buy US debt that we’re trying to sell from Covid stimulus spending we’re doing for cheap returns -&gt; tech or growth stocks go down.</p>\n</div><!-- SC_ON -->",
  "score": 2386,
  "permalink": "/r/stocks/comments/lzq5zr/what_will_actually_determine_stock_prices_this/",
  "subreddit": "stocks",
  "id": "lzq5zr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542576979
}