{
  "author": "Set1Less",
  "original_created_utc": 1652296093,
  "title": "A stablecoin implosion is not even over, yet Poloniex (owned by Justin Sun) is already calling USDD stablecoin as \"trustable\". USDD is virtually build with same ponzinomics, except its run on Tron. Pathetic.",
  "created_utc": 1652330665,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;What should a crypto exchange do right at the time a top 10 stablecoin is imploding with billions of dollars vanishing and people losing all their savings? &lt;/p&gt;\n\n&lt;p&gt;Surely not shill another algorithmic stablecoin that almost uses the same design as the one imploding...&lt;/p&gt;\n\n&lt;p&gt;Thats what Poloniex is doing. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/1evrx53tawy81.jpg?width=1096&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=8cdfadf4cde11232ddaae06ac9e0a276956b0adc\"&gt;USDD = trustable, according to Poloniex. And apparently better than the one imploding :/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;USDD has already lost its peg for a while, it was down to 0.99 instead of $1.&lt;/p&gt;\n\n&lt;p&gt;Poloniex is ofcourse owned by Tron/Justin Sun, who are now using it to push their own instable &amp;quot;stablecoin&amp;quot; at a time when the paint of a stablecoin collapsing is not even dry. &lt;/p&gt;\n\n&lt;p&gt;I really dont want regulators to get involved in this space and put an end to everything, but it seems the large actors in this space are inviting the regulators with a red carpet...&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 321,
  "permalink": "/r/CryptoCurrency/comments/unhdhw/a_stablecoin_implosion_is_not_even_over_yet/",
  "subreddit": "CryptoCurrency",
  "id": "unhdhw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "What should a crypto exchange do right at the time a top 10 stablecoin is\nimploding with billions of dollars vanishing and people losing all their\nsavings?\n\nSurely not shill another algorithmic stablecoin that almost uses the same design\nas the one imploding...\n\nThats what Poloniex is doing.\n\nUSDD…"
}