{
  "author": "Henry_V_Rex",
  "the_new_excerpt": "It hast come to Oure notice þat a grette traytour known as \"Mel Gibson\" hast\ngenerated a \"film\" þat ys nothyng but calumnye towardes Oure grette auncestrie.\nTo witte: he hast villiche disclaundre þe firste and secounde Eduoards of Oure\nline and misrewarded þe outlaue William Wallas. Þis wole not…",
  "original_created_utc": 1617255745,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我们注意到一个叫 \"梅尔-吉布森 \"的漂亮的旅行团已经到了。\n创作了一部 \"电影\"，其中除了诽谤之外，没有其他内容，但却对我们伟大的祖国进行了诽谤。\n在此，我想说的是：他对我们的第一和第二所学校进行了彻底的否定。\n线，并误伤了威廉-瓦拉斯。这不是...",
      "title": "[评论]我们对梅尔-吉布森和他的变态电影 \"勇敢的心 \"的诽谤进行了报道。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們注意到一個叫 \"梅爾-吉布森 \"的漂亮的旅行團已經到了。\n創作了一部 \"電影\"，其中除了誹謗之外，沒有其他內容，但卻對我們偉大的祖國進行了誹謗。\n在此，我想說的是：他對我們的第一和第二所學校進行了徹底的否定。\n線，並誤傷了威廉-瓦拉斯。這不是...",
      "title": "[評論]我們對梅爾-吉布森和他的變態電影 \"勇敢的心 \"的誹謗進行了報道。"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "メル・ギブソン \"と呼ばれる一人の男が、\"映画 \"を制作していたことがわかりました。\nこの映画は、私たちの友人たちを誹謗中傷するものでしかありません。\nつまり、彼はイギリスの第一、第二のEduoardsの情報を隠していたのです。\nまた、アウトローのWilliam Wallasを不当に評価している。しかし、このようなことはありません。",
      "title": "レビュー】メル・ギブソンと彼の変態映画『ブレイブハート』を誹謗中傷している。"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "メル・ギブソン \"と呼ばれる一人の男が、\"映画 \"を制作していたことがわかりました。\nこの映画は、私たちの友人たちを誹謗中傷するものでしかありません。\nつまり、彼はイギリスの第一、第二のEduoardsの情報を隠していたのです。\nまた、アウトローのWilliam Wallasを不当に評価している。しかし、このようなことはありません。",
      "title": "レビュー】メル・ギブソンと彼の変態映画『ブレイブハート』を誹謗中傷している。"
    }
  ],
  "title": "[Review]Yn whiche We inproue þa calumnye of þa traytour Mel Gibson and hys pervers film \"Braveheart\"",
  "created_utc": 1617274181,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It hast come to Oure notice þat a grette traytour known as &quot;Mel Gibson&quot; hast generated a &quot;film&quot; þat ys nothyng but calumnye towardes Oure grette auncestrie. To witte: he hast villiche disclaundre þe firste and secounde Eduoards of Oure line and misrewarded þe outlaue William Wallas. Þis wole not stonde!</p>\n\n<p>Item firste, Wallas was an outlaue and a robbour bifor þe tresoun of þe Scottes.</p>\n\n<p>Item secounde, þe schirref of Lanark dude notte sclee Wallas&#39; wyf and þe skek was ontrewe. Moreouer, notte all Englisch were scleen, for Thomas Grey dude remaynyd.</p>\n\n<p>Item þred, þeir was a pounte atte Stirling.</p>\n\n<p>Item fowre, Oure prodessessour, þe secounde Eduoard, though a sodomyte and an unworþi kynge, was a perexcellent knyʒt, bolde and mightiful.</p>\n\n<p>Item fyfþe, Oure alde mode, Isabella of Fraunce, was but þre when Gibson deceyuously pretenden þat Wallas got þe þred Eduoard on her.</p>\n\n<p>Item sexte , Oure prodessessour, þe firste Eduoard, dude not sclee hys ouen putayle, for þat wulde be completely folisshe.</p>\n\n<p>It ys clere þat þis &quot;Mel Gibson&quot; ys a traytour werkynge for þe Scottes and We shall haf hym drawn, hanged hedyd, quartered, and in diuers Counreys hure quarteres I-hanged vp in tokyn here of þis tresoun.</p>\n</div><!-- SC_ON -->",
  "score": 112,
  "permalink": "/r/AskHistorians/comments/mhomku/reviewyn_whiche_we_inproue_þa_calumnye_of_þa/",
  "subreddit": "AskHistorians",
  "id": "mhomku",
  "is_self": true,
  "media": null,
  "is_video": false
}