{
  "author": "ChubbyHistorian",
  "original_created_utc": 1638032708,
  "title": "I teach on land seized from Coast Salish and Chinook peoples. Kids always want to know “how they did x or y”. What are good resources to learn what their everyday life was like? (Routines, families, sleeping, sport, etc.)",
  "created_utc": 1638043458,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Edit: Our school does do work with native tribes and we have elders come every year. I’m asking for resources to supplement that, because my personal relationship isn’t (yet) one where I am comfortable asking them to do much labor for me</p>\n</div><!-- SC_ON -->",
  "score": 109,
  "permalink": "/r/AskHistorians/comments/r3hsis/i_teach_on_land_seized_from_coast_salish_and/",
  "subreddit": "AskHistorians",
  "id": "r3hsis",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Edit: Our school does do work with native tribes and we have elders come every\nyear. I’m asking for resources to supplement that, because my personal\nrelationship isn’t (yet) one where I am comfortable asking them to do much labor\nfor me",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "編集部：私たちの学校では、先住民族との共同作業を行っており、毎年、長老たちに来てもらっています。\n毎年来てもらっています。それを補うためのリソースを求めているのです。\n私の個人的な関係では、彼らに多くの労働力を求めることは（まだ）できません。\n私のために",
      "title": "私が教えているのは、コースト・セイリッシュ族やチヌーク族から伝わった土地の伝承です。子供たちはいつも「どうやってxやyをしたのか」を知りたがります。彼らの日常生活がどのようなものであったかを知るための良い資料はありますか？(日常生活、家族、睡眠、スポーツなど）。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "编辑：我们的学校确实与土著部落合作，每年都有长者来\n每年都有长老来。我要求提供资源来补充这一点，因为我的个人\n因为我的个人关系并不适合让他们为我做很多劳动。\n为我做很多工作",
      "title": "我在海岸萨利什人和奇努克人缴获的土地上授课。孩子们总是想知道 \"他们是如何做X或Y的\"。有什么好的资源可以了解他们的日常生活是什么样的？(例行公事、家庭、睡眠、运动等）。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "編輯：我們的學校確實與土著部落合作，每年都有長者來\n每年都有長老來。我要求提供資源來補充這一點，因爲我的個人\n因爲我的個人關係並不適合讓他們爲我做很多勞動。\n爲我做很多工作",
      "title": "我在海岸薩利什人和奇努克人繳獲的土地上授課。孩子們總是想知道 \"他們是如何做X或Y的\"。有什麼好的資源可以瞭解他們的日常生活是什麼樣的？(例行公事、家庭、睡眠、運動等）。"
    }
  ]
}