{
  "author": "Appropriate_Bowl_829",
  "original_created_utc": 1635849409,
  "title": "Was the condition Dwarfism named after the fantasy race of Dwarves or were Dwarves named after the condition of Dwarfism?",
  "created_utc": 1635880824,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I just woke up suddenly at 5am with this thought in my head and I can&#39;t figure it out and I can&#39;t get back to sleep now. </p>\n\n<p>Cause like, Dwarfism has likely been around for a long time, probably a lot longer than the idea of Dwarves, but like at the same time there&#39;s some truly ancient bits of folklore. </p>\n\n<p>Did the condition inspire the fantasy race or had someone come up with Dwarves before the condition had become common knowledge? I have so many questions and can&#39;t find any answers. </p>\n\n<p>(Also let me know if any of this comes off as rude or offensive, I didn&#39;t mean anything like that. If I used the wrong terminology or anything let me know and I&#39;ll change it asap!)</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/ql1d00/was_the_condition_dwarfism_named_after_the/",
  "subreddit": "NoStupidQuestions",
  "id": "ql1d00",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I just woke up suddenly at 5am with this thought in my head and I can't figure\nit out and I can't get back to sleep now.\n\nCause like, Dwarfism has likely been around for a long time, probably a lot\nlonger than the idea of Dwarves, but like at the same time there's some truly\nancient bits of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "朝5時に急に目が覚めて、この考えが頭の中に浮かんできて、理解できないんです。\n謎が解けず、今も眠れません。\n\nなぜなら、小人症はおそらく長い間、ドワーフの概念よりもはるかに長い間、存在していたからです。\nドワーフの概念よりもずっと昔からあったと思われます。\nしかし、同時にいくつかの古代のビットの...",
      "title": "ドワーフ症という症状は、ファンタジーの種族であるドワーフから名付けられたのか、それともドワーフがドワーフ症という症状から名付けられたのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我只是在早上5点突然醒来，脑子里有这个想法，我想不出来\n我想不明白，我现在无法继续睡下去。\n\n因为，侏儒症可能已经存在了很长时间，可能比侏儒的概念要长得多。\n可能比矮人的概念要长得多，但与此同时，也有一些真正的\n古代的一些...",
      "title": "侏儒症是以幻想中的矮人种族命名的，还是矮人以侏儒症的状况命名的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我只是在早上5點突然醒來，腦子裏有這個想法，我想不出來\n我想不明白，我現在無法繼續睡下去。\n\n因爲，侏儒症可能已經存在了很長時間，可能比侏儒的概念要長得多。\n可能比矮人的概念要長得多，但與此同時，也有一些真正的\n古代的一些...",
      "title": "侏儒症是以幻想中的矮人種族命名的，還是矮人以侏儒症的狀況命名的？"
    }
  ]
}