{
  "author": "DaddySkates",
  "original_created_utc": 1634466534,
  "title": "It really grinds my gears when people tell me I’m too poor to invest in crypto",
  "created_utc": 1634474003,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Im told that Im too poor to invest into crypto by my relatives a lot. Mind you that my relatives are quite well off and Im the black sheep of the family since Im a single dad with not so respectable job and in their eyes Im a lazy little man-child. </p>\n\n<p>Last time that we had lunch together they asked me if I still “do cryptocurrencies” and I said that yeah I save just a little at the end of the month by not buying myself drinks or fast food or stupid things. Its a 2 digit number in the very low end but still they gave me shit for that because Im “too poor to invest “ especially in “grey market such as crypto”. I smiled but didnt appreciate that at all. Then I was asked why am I using that little money that I have to invest in crypto instead of spending it on my children. </p>\n\n<p>I was pretty damn angry. I do everything for my kiddos, work 2 jobs and still some people give me shit cause I put a tenner in at the end of month. </p>\n\n<p>Crypto is for everyone regardless how poor they are. Dont let anyone tell you different!</p>\n</div><!-- SC_ON -->",
  "score": 199,
  "permalink": "/r/CryptoCurrency/comments/q9w6gp/it_really_grinds_my_gears_when_people_tell_me_im/",
  "subreddit": "CryptoCurrency",
  "id": "q9w6gp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Im told that Im too poor to invest into crypto by my relatives a lot. Mind you\nthat my relatives are quite well off and Im the black sheep of the family since\nIm a single dad with not so respectable job and in their eyes Im a lazy little\nman-child.\n\nLast time that we had lunch together they asked me…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の親戚からは、暗号に投資するには貧しすぎるとよく言われます。留意点\n私の親戚はかなり裕福で、私は家族の黒い羊なので\n私は立派な仕事をしていないシングルファーザーで、彼らの目には私は怠け者の小さな男児に映ります。\n子供のようです。\n\n前回、一緒に昼食をとったとき、彼らは私に尋ねました...",
      "title": "貧乏だから暗号に投資できないと言われると、本当に腹が立ちます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的亲戚经常告诉我，我太穷了，不能投资于加密货币。请注意\n我的亲戚们都很富裕，而我是家里的害群之马，因为我是个单亲爸爸，有一份不那么体面的工作。\n我是个单亲爸爸，有一份不那么体面的工作，在他们眼里，我是个懒惰的小家伙。\n在他们眼里，我是个懒惰的小家伙。\n\n上次我们一起吃午饭的时候，他们问我...",
      "title": "当人们告诉我，我太穷了，不能投资加密货币时，这真的让我很不爽。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的親戚經常告訴我，我太窮了，不能投資於加密貨幣。請注意\n我的親戚們都很富裕，而我是家裏的害羣之馬，因爲我是個單親爸爸，有一份不那麼體面的工作。\n我是個單親爸爸，有一份不那麼體面的工作，在他們眼裏，我是個懶惰的小傢伙。\n在他們眼裏，我是個懶惰的小傢伙。\n\n上次我們一起喫午飯的時候，他們問我...",
      "title": "當人們告訴我，我太窮了，不能投資加密貨幣時，這真的讓我很不爽。"
    }
  ]
}