{
  "author": "Gossipmang",
  "original_created_utc": 1627316292,
  "title": "Be honest, how many of you have invested in an ALT coin after only reading a handful of comments in 30 mins or less?",
  "created_utc": 1627331685,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>About 10-20% of my portfolio at any given time is based on trends/up-tick in comments for certain coins. Usually I&#39;ll go through the whole &quot;do your own DD process&quot; reading the white paper, reviewing historical posts,  etc. But every once in a while I&#39;ll throw a small amount of cash at top 100 coin I start seeing mentioned more often in hopes of the reddit herd mentality causing a surge in price.</p>\n\n<p>I&#39;m just curious what percentage of your portfolio has been thoroughly researched vs a couple dozen upvotes swaying your investment decisions?</p>\n</div><!-- SC_ON -->",
  "score": 195,
  "permalink": "/r/CryptoCurrency/comments/os23ny/be_honest_how_many_of_you_have_invested_in_an_alt/",
  "subreddit": "CryptoCurrency",
  "id": "os23ny",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "About 10-20% of my portfolio at any given time is based on trends/up-tick in\ncomments for certain coins. Usually I'll go through the whole \"do your own DD\nprocess\" reading the white paper, reviewing historical posts, etc. But every\nonce in a while I'll throw a small amount of cash at top 100 coin I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私のポートフォリオの約10～20％は、特定のコインのトレンドやアップティックに基づいています。\nコメントに基づいています。通常、私はホワイトペーパーを読み、過去の投稿を確認するなど、「自分でDDを行う」プロセスを経ます。\n白書を読んだり、過去の投稿を見たりします。しかし、たまには\nしかし、たまにはトップ100のコインに少額の現金を投じることもあります。",
      "title": "正直なところ、30分以内に一握りのコメントを読んだだけでALTコインに投資した人が何人いるでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在任何时候，我的投资组合中大约有10-20%是基于某些硬币的趋势/涨势的评论。\n某些硬币的评论。通常情况下，我会通过整个 \"做你自己的DD\n过程\"，阅读白皮书，回顾历史帖子，等等。但每\n偶尔我也会在前100名的硬币上投下少量的现金，我...",
      "title": "说实话，你们中有多少人在30分钟或更短的时间内只看了几条评论就投资了ALT币？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在任何時候，我的投資組合中大約有10-20%是基於某些硬幣的趨勢/漲勢的評論。\n某些硬幣的評論。通常情況下，我會通過整個 \"做你自己的DD\n過程\"，閱讀白皮書，回顧歷史帖子，等等。但每\n偶爾我也會在前100名的硬幣上投下少量的現金，我...",
      "title": "說實話，你們中有多少人在30分鐘或更短的時間內只看了幾條評論就投資了ALT幣？"
    }
  ]
}