{
  "author": "Colombian_Meatsmoker",
  "original_created_utc": 1641632432,
  "title": "Bitcoin as a retirement account?",
  "created_utc": 1641693630,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am 31, and wondering if anyone else around this age has chosen to not put money into a retirement account at work and instead put it into Bitcoin instead? Obviously this isn’t a very traditional or risk-off approach but I believe in this thing and I think it could work. It’s been amazing watching Bitcoin transcend into society over the past year. Or if not retirement, do you do anything against the grain or that is not very common with Bitcoin that you don’t know anyone else does?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 303,
  "permalink": "/r/Bitcoin/comments/ryvni4/bitcoin_as_a_retirement_account/",
  "subreddit": "Bitcoin",
  "id": "ryvni4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I am 31, and wondering if anyone else around this age has chosen to not put\nmoney into a retirement account at work and instead put it into Bitcoin instead?\nObviously this isn’t a very traditional or risk-off approach but I believe in\nthis thing and I think it could work. It’s been amazing watching…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は31歳なのですが、このくらいの年齢の方で、お金を入れないという選択をされた方はいらっしゃいますか？\n会社の退職金口座にお金を入れて、その代わりにビットコインにお金を入れていますか？\nもちろん、これは非常に伝統的な、またはリスクを回避するアプローチではありませんが、私は信じています。\nこのことは、うまくいくかもしれないと思っています。素晴らしいことです...",
      "title": "ビットコインを老後資金に？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我今年31岁，我想知道是否有其他人在这个年龄段选择不把钱存入工作的退休账户，而把钱存入比特币？\n帐户，而把钱投入到比特币中？\n很明显，这不是一个非常传统或风险较小的方法，但我相信\n但我相信这个东西，我认为它可以成功。看着这一切，我很惊讶...",
      "title": "比特币作为一个退休账户？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我今年31歲，我想知道是否有其他人在這個年齡段選擇不把錢存入工作的退休賬戶，而把錢存入比特幣？\n帳戶，而把錢投入到比特幣中？\n很明顯，這不是一個非常傳統或風險較小的方法，但我相信\n但我相信這個東西，我認爲它可以成功。看着這一切，我很驚訝...",
      "title": "比特幣作爲一個退休賬戶？"
    }
  ]
}