{
  "author": "theFoot58",
  "the_new_excerpt": "As someone who witnessed several close friends get massacred by the end of year\ntax traps during the Internet bubble burst, hear me out.\n\nIf you make any dramatic move prior to the end of the year, and lock in any\nprofits, for the love of god please calculate the tax liability then and there,\nand…",
  "original_created_utc": 1608771372,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "作为一个目睹了几个亲密朋友在年底被屠杀的人\n泡沫上网期间税收陷阱爆了，听我说完。\n\n如果你在年底前做出任何戏剧性的举动，并锁定任何\n利润，看在上帝的份上，请当场计算一下税负，\n和…",
      "title": "年底的税收陷阱"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "作爲一個目睹了幾個親密朋友在年底被屠殺的人\n泡沫上網期間稅收陷阱爆了，聽我說完。\n\n如果你在年底前做出任何戲劇性的舉動，並鎖定任何\n利潤，看在上帝的份上，請當場計算一下稅負，\n和…",
      "title": "年底的稅收陷阱"
    }
  ],
  "title": "Tax traps at end of year",
  "created_utc": 1608809422,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As someone who witnessed several close friends get massacred by the end of year tax traps during the Internet bubble burst,  hear me out.</p>\n\n<p>If you make any dramatic move prior to the end of the year,  and lock in any profits,  for the love of god <strong><em>please</em></strong> calculate the  tax liability then and  there,  and put the money to pay those taxes aside in a safe place.</p>\n\n<p>Here is how my best friend f&#39;d up.  We worked at Sun.  He had ESOP shares  that he sold when he thought the market was peaked , late in the year.  Early the next year,  Sun dipped,  he took the entirety of his &#39;winnings&#39; and put it all back into Sun.  Then the bubble burst,  Sun stock plummeted,  but he  owed  tax on the prior years enormous profit.  He waited and waited as the April 15th deadline approached,  hoping  Sun would recover,  it didn&#39;t,  it  actually got noticeably worse as tax day approached.  My friend had to sell very low, to pay  his tax bill,  and was still $ 200K short!.    It took him many years  to recover.</p>\n</div><!-- SC_ON -->",
  "score": 67,
  "permalink": "/r/CryptoCurrency/comments/kj5ena/tax_traps_at_end_of_year/",
  "subreddit": "CryptoCurrency",
  "id": "kj5ena",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609495330257
}