{
  "author": "JamieOvechkin",
  "the_new_excerpt": "I’m trying to figure out which the better investment would have been over the\nlast 20 years.\n\nAn S&P 500 Index Fund, for example: SPY, or a property in San Francisco: lets\nassume average price across the whole city over the same time frame.\n\nIf two identical people had taken all of their disposable…",
  "original_created_utc": 1619482918,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "過去20年間でどちらが良い投資だったのかを考えています。\n過去20年間でどちらが良い投資だったかを考えています。\n\n例えば、S&P 500 Index Fund。SPY、またはサンフランシスコの不動産。\n同じ期間の都市全体の平均価格を想定してみましょう。\n\nもし、2人の同じ人間が、自分の使い捨てのお金をすべて使ったとしたら...。",
      "title": "過去20年間、どちらのリターンが良いか。S&P500のインデックスファンドとサンフランシスコの不動産では、どちらの方がリターンが良いか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想知道在过去的20年里，哪种投资方式更好。\n过去20年中哪种投资更好。\n\n例如，一个标准普尔500指数基金。SPY，或在旧金山的房产：让我们\n假设整个城市在同一时间段的平均价格。\n\n如果两个相同的人把他们所有可支配的...",
      "title": "在过去的20年里，哪一个有更好的回报。标准普尔500指数基金和旧金山房地产？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想知道在過去的20年裏，哪種投資方式更好。\n過去20年中哪種投資更好。\n\n例如，一個標準普爾500指數基金。SPY，或在舊金山的房產：讓我們\n假設整個城市在同一時間段的平均價格。\n\n如果兩個相同的人把他們所有可支配的...",
      "title": "在過去的20年裏，哪一個有更好的回報。標準普爾500指數基金和舊金山房地產？"
    }
  ],
  "title": "Which had better returns over the last 20 years: An S&P 500 Index Fund or San Francisco Real Estate?",
  "created_utc": 1619501491,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m trying to figure out which the better investment would have been over the last 20 years.</p>\n\n<p>An S&amp;P 500 Index Fund, for example: SPY, or a property in San Francisco: lets assume average price across the whole city over the same time frame.</p>\n\n<p>If two identical people had taken all of their disposable income and savings and one put it into SF property and the other SPY, who would have come out ahead?</p>\n\n<p>For the sake of concreteness, lets say the one investing in SF Real Estate lived in the house, whereas the one investing in SPY paid an equal amount of rent to the Mortgage of the SF property, but without Property taxes.</p>\n\n<p>To be clear, this is not asking what a viable investment strategy is, or if it&#39;s smart to invest like in the examples above. </p>\n\n<p>This is strictly asking about the outcome value-wise of the above two options</p>\n</div><!-- SC_ON -->",
  "score": 229,
  "permalink": "/r/investing/comments/mzc3x4/which_had_better_returns_over_the_last_20_years/",
  "subreddit": "investing",
  "id": "mzc3x4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776214682
}