{
  "author": "Adnanzzz",
  "the_new_excerpt": "GET protocol is going to have an AMA tomorrow in this subreddit (14th April 4PM\nUTC / 12PM ET) . Let me give you an introduction and why it's worth paying\nattention to this AMA.\n\n\n\n> Website: https://get-protocol.io [https://get-protocol.io/]\n> \n> Artists who use GET\n> [https://medium.com/get…",
  "original_created_utc": 1618315460,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "GETプロトコルは、明日、このサブレディットでAMAを行う予定です（14th April 4PM\nutc / 12pm et) . このAMAに注目する価値があることを紹介しておきます。\nAMAに注目する価値があるかを紹介します。\n\n\n\n> ウェブサイト： https://get-protocol.io [https://get-protocol.io/]\n> \n> GETを使用しているアーティスト\n> [https://medium.com/get...",
      "title": "r / cryptocurrencyの明日のGETプロトコルAMAに注目すべき理由"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "GET协议明天将在这个子reddit上进行AMA（4月14日下午4点）。\nUTC / 12PM ET） 。让我来给你介绍一下，为什么它值得支付\n关注本次AMA。\n\n\n\n> 网站：https://get-protocol.io [https://get-protocol.io/]\n> \n> 使用GET的艺术家\n> [https://medium.com/get...",
      "title": "为什么你要关注明天的GET协议AMA在r /加密货币中的应用？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "GET協議明天將在這個子reddit上進行AMA（4月14日下午4點）。\nUTC / 12PM ET） 。讓我來給你介紹一下，爲什麼它值得支付\n關注本次AMA。\n\n\n\n> 網站：https://get-protocol.io [https://get-protocol.io/]\n> \n> 使用GET的藝術家\n> [https://medium.com/get...",
      "title": "爲什麼你要關注明天的GET協議AMA在r /加密貨幣中的應用？"
    }
  ],
  "title": "Why you should pay attention to tomorrow's GET protocol AMA in r / cryptocurrency",
  "created_utc": 1618368926,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>GET protocol is going to have an AMA tomorrow in this subreddit (14th April 4PM UTC / 12PM ET) . Let me give you an introduction and why it&#39;s worth paying attention to this AMA.</p>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>Website: <a href=\"https://get-protocol.io/\">https://get-protocol.io</a>  </p>\n\n<p><a href=\"https://medium.com/get-protocol/a-continuous-list-of-artists-event-organizers-who-have-used-guts-tickets-e11881c3bc85\">Artists who use GET</a>  </p>\n\n<p><a href=\"https://www.youtube.com/watch?v=cjXSeElvbss&amp;list=PLX2hedfGtH6-7sVJcxPYfwBqopLlsXcz9&amp;index=1\">GET explainer video</a>  </p>\n\n<p>Tradeable on: <a href=\"https://uniswap.info/token/0x8a854288a5976036a725879164ca3e91d30c6a1b\">https://uniswap.info/token/0x8a854288a5976036a725879164ca3e91d30c6a1b</a>  </p>\n\n<p>As well as Bittrex, Coinone, Liquid, Hotbit and Bilaxy</p>\n</blockquote>\n\n<p>&#x200B;</p>\n\n<p>In my humble opinion GET protocol is <strong>a very undervalued</strong> project when it comes to fundamentals, adoption, tokenomics and potential. Let me explain why:</p>\n\n<p>&#x200B;</p>\n\n<h1>GET protocol solves an enormous problem: ticket scalping</h1>\n\n<p>I think we&#39;re all tired of the practices in the ticketing space: bots buy up tickets instantly and then resell them 2x, 5x, 10x or even more the original ticket price. Fans lose, artists lose, venues lose, ... while the money ends up in the pocket of scalpers who don&#39;t add any value to the process.</p>\n\n<p><a href=\"https://bigthink.com/politics-current-affairs/scalping\">The secondary ticketing market is worth $15 billion. How long will fans have to pay?</a></p>\n\n<p><strong>GET protocol elminates ticket scalping</strong> by linking the ticket to your mobile phone. This means that at entry to a concert, sports game, ... you are only permitted entry with your mobile phone.</p>\n\n<p><strong>This is how it works:</strong></p>\n\n<blockquote>\n<p>The ticket is linked to your phone and simcard with a dynamic qr code that changes every 5-10 seconds.The NFT&#39;s can only be claimed and released in your wallet when the ticket for the event has been scanned. This makes sense as otherwise you could just send it to a potential buyer and operate as a scalper.Check this example of a sold out event:<a href=\"https://guts.events/knzvi8-guus-actie-final/h8fm6a\">https://guts.events/knzvi8-guus-actie-final/h8fm6a</a>if you go to &quot;ticketmarket&quot; you can see the tickets offered in the secondary market. This is the only way and place to sell your ticket (the event organizer determines at which rules). So you can buy a ticket from a (to you anonymous) buyer or as a seller sell it back into the system and the ticket is sold once the system finds a matching buyer. You remain anonymous to eachother..After scanning the ticket, the NFT of the ticket can be claimed and can be held as collectible, sold on rarible, ... artists will release special NFT tickets with special metadata in them.</p>\n</blockquote>\n\n<p>They have <strong>sold over 600k tickets</strong> and not one was &quot;scalped&quot;</p>\n\n<p>An example is famous Dutch artist Jochem Myjer who uses GET protocol integrator GUTS tickets:</p>\n\n<p><a href=\"https://twitter.com/jochemmyjer/status/1118589335060848641\">https://twitter.com/jochemmyjer/status/1118589335060848641</a></p>\n\n<blockquote>\n<p>“Weird how some venues still don’t get how great GUTS is. And are afraid of change. It’s easier for the audience. For artists there is no more reselling. And maaaany other advantages. #GoWithTheTimes”</p>\n</blockquote>\n\n<p>The ticketing space is one where <strong>no one trusts another</strong> in terms of how many tickets were issued, what the original price was, ... It has been proven that even Ticketmaster themselves are involved in the scalping business. That&#39;s why <strong>blockchain</strong> is vital in all of this. The tickets are all <strong>registered on the blockchain</strong> as a mean of <strong>transparency</strong> and <strong>accountability</strong>. This means that fans can check <strong>ticket authenticity</strong> whenever they want and make sure that they aren&#39;t being taken for a ride.</p>\n\n<p>&#x200B;</p>\n\n<p>Besides scalping it offers many more advantages to integrators:</p>\n\n<ul>\n<li><strong>Interaction</strong> with the ticket holders</li>\n<li>Extra <strong>marketing</strong> tools</li>\n<li><strong>Data</strong> collection</li>\n<li><strong>Dynamic price</strong> setting</li>\n<li><strong>Merging</strong> of the primary and secondary market</li>\n<li>...</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<h1>GET protocol has a lot of adoption</h1>\n\n<p>As stated above, GUTS has sold 600k tickets using GET protocol. In the meanwhile more ticketing companies have started using it:</p>\n\n<p><strong>GUTS</strong></p>\n\n<p>Runs fully on the GET protocol and has sold over <strong>600.000</strong> <strong>tickets</strong>. Has grown into the biggest ticketeer in the Netherlands.<a href=\"https://guts.tickets/\">https://guts.tickets</a></p>\n\n<p><strong>ITIX</strong></p>\n\n<p>Established in 2009 and sells <strong>2 million tickets/year</strong>. Is fully integrated in the GET protocol and will start selling GET-fueled tickets soon.<a href=\"https://www.itix.nl/\">https://www.itix.nl</a></p>\n\n<p><strong>getTicket</strong></p>\n\n<p>A new ticketing company in <strong>South Korea</strong> that will run fully on the GET protocol. They already have deals with <strong>kpop</strong> stars to sell tickets for.<a href=\"http://getticket.kr/\">http://getticket.kr</a></p>\n\n<p><strong>TecTix</strong></p>\n\n<p>A Germany based ticketing company that will sell GET fueled tickets with a focus on the <strong>sports industry</strong>.<a href=\"https://tec-tix.com/\">https://tec-tix.com</a></p>\n\n<p><strong>Wicket</strong></p>\n\n<p>The last to join is an <strong>Italian</strong> ticketing company. Despite being new they have already ticketed the <strong>Milano Wine festival</strong> in 2020 and will do so in 2021 as well. In 2019 this festival atracted more than 300.000 visitors.<a href=\"https://www.wicketevents.com/\">https://www.wicketevents.com</a></p>\n\n<p><strong>Integrating</strong> an existing ticketing company is a <strong>low investment move</strong> (only the GET token is needed) that offers traditional ticketing companies several benefits. With the whitelabel that has just been released, which makes it easy for any ticketing company to start using GET, I expect many ticketing companies to integrate and GET to <strong>scale quickly</strong>.</p>\n\n<p>The team said in a recent AMA that they receive 3 requests on average every single day from ticketeers around the world wanting to integrate GET:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/v0wkb4u2lxs61.jpg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=9497b6b4545d25509dbc18ae2df78c6d5beb5918\">https://preview.redd.it/v0wkb4u2lxs61.jpg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=9497b6b4545d25509dbc18ae2df78c6d5beb5918</a></p>\n\n<h1>GET tokenomics</h1>\n\n<p>The GET <strong>tokenomics</strong> are built so that for every ticket issued <strong>0,28€ (or 0,34$) worth of GET is needed by the ticketeers</strong>. They buy most of this from <strong>exchanges</strong> and some new clients in the beginning receive GET, subsidized from the User Grotwh Fund.</p>\n\n<p>In 2020 ticketing volume in general was down like 90–99% due to corona. Yet GET managed to sell over <strong>236k</strong> tickets. Or an <strong>increase</strong> of <strong>27%</strong> compared to 2019.</p>\n\n<p>This is a major indicator of their <strong>usecase</strong> being <strong>needed</strong>: despite covid19 they grew a lot and conquered a lot of marketshare from traditional ticketeers.</p>\n\n<p><strong>Tokenomics to push the price</strong></p>\n\n<p>If GUTS was able to sell 236k tickets in a year where ticketing volume is down at least 90% then I think it’s safe to assume that they’ll sell <strong>over 3 million tickets/year</strong> once everything is allowed again.</p>\n\n<p>Add the <strong>new ticketing companies</strong> that integrated GET recently (getticket in <strong>Korea</strong>, Wicket Events in <strong>Italy</strong> and Tectix in <strong>Germany</strong>) and the team announced that several will be joining in the coming weeks then you’ll understand that we’ll be seeing millions of tickets processed by the GET protocol.</p>\n\n<p>I’m willing to bet that we’ll see at least 10 million tickets in 2022:</p>\n\n<blockquote>\n<p><em>10 million \\</em> 0,34$ = 3.400.000$ in buybacks or close to 300.000 $ every month*</p>\n</blockquote>\n\n<p>You can imagine what <strong>buybacks of 300k $ each month</strong> will do to the price, especialy considering that all this bought GET is <strong>burned after usage</strong>.</p>\n\n<p>Of course with such an increase in buybacks &amp; burns, GET will be recognised as <strong>truely deflationary through real world usage</strong>.</p>\n\n<p>&#x200B;</p>\n\n<h1>NFT tickets that will revolutionise ticketing</h1>\n\n<p><em>All tickets issued by the GET protocol are NFT&#39;s right now</em></p>\n\n<p>This is a usecase <strong>endorsed</strong> by several <strong>entrepreneurs</strong> and yet <strong>overlooked</strong> in the <strong>crypto space</strong>. It&#39;s probably one of those very rare cases where crypto people are sleeping on something while entrepreneurs are not only endorsing it but expressing their desire to use it:</p>\n\n<blockquote>\n<p>Ted Leonsis sees a blockchain future in ticketing  </p>\n\n<p>Mark Cuban Says Dallas Mavericks Are &#39;Talking About&#39; Blockchain for NBA Ticketing  </p>\n\n<p>Barry Ritholtz: &quot;Smart Tickets: Creators Capturing Secondary Market Sales&quot;</p>\n</blockquote>\n\n<p>These are just a few examples of NFT ticketing being endorsed as the future of ticketing. The fun part: <strong>GET protocol has no competition in this regard!</strong></p>\n\n<p><a href=\"https://medium.com/get-protocol/get-protocol-the-ticket-nft-production-line-9d4e1329f16f\">GET Protocol — The ticket NFT production line</a></p>\n\n<h1>Here&#39;s my take on why GET protocol&#39;s smart and blockchain registered tickets becoming NFT&#39;s will revolutionize the ticketing industry.</h1>\n\n<p>After the DeFi hype we’ve witnessed last year, the next hype in crypto that seems to be developing are <strong>NFT’s</strong>. In this case it isn’t about riding the hype. Tickets being NFT’s on the blockchain really <strong>makes sense</strong> and it will <strong>change ticketing</strong> as we know it. Let me explain…</p>\n\n<p>So what’s a NFT exactly? NFT stands for <strong>non fungible token</strong>. This is a token that’s <strong>unique</strong> on the blockchain and <strong>not mutually interchangeable</strong>. This in contrast to for example Bitcoin where it doesn’t matter which Bitcoin you have (1 BTC = 1 BTC). <strong>Every ticket</strong> issued by the GET protocol will become a <strong>getNFT</strong>.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/kwromrs5lxs61.png?width=700&amp;format=png&amp;auto=webp&amp;s=cba261dc3f5e90fdd09c9248339077a3f48b3746\">https://preview.redd.it/kwromrs5lxs61.png?width=700&amp;format=png&amp;auto=webp&amp;s=cba261dc3f5e90fdd09c9248339077a3f48b3746</a></p>\n\n<p><strong>getNFTs</strong> are <strong>indivisible</strong>, meaning that a getNFT can only be held by 1 address at the same time. This ensures that whoever owns a certain NFT will be the <strong>only one</strong> to decrypt the QR code.</p>\n\n<p>Eventhough GET’s NFT’s will be the <strong>most used, bought &amp; traded</strong> NFT’s in the <strong>crypto space</strong> the goal isn’t to ride the hype. <strong>Ticketing + NFT = a match made in heaven</strong>. And here’s why:</p>\n\n<p>As every ticket on the blockchain will become a NFT and thus unqiue, it will allow <strong>non custodial ownership of the ticket asset</strong>. This gives many interesting <strong>advantages</strong> but 2 stand out for me personally: <strong>P2P ticket trading &amp; DeFi event financing</strong>.</p>\n\n<p><strong>P2P ticket trading</strong>NFT’s will allow P2P ticket trading and GET’s almost done building it! Peer to peer ticket trading means that everyone who owns a getNFT ticket will be able to trade it with another “peer”. This will happen in a <strong>closed</strong> and <strong>regulated ecosystem</strong>. This means that certain <strong>rules</strong> can be set by the event organizer. For example:</p>\n\n<ul>\n<li>The ticket can be sold for only x% profit</li>\n<li>x% of the trade profit goes to the event organizer</li>\n<li>a certain trading fee goes to the event organizer</li>\n<li>…</li>\n</ul>\n\n<p>This will be the <strong>first</strong> and <strong>only</strong> ticketing system that will allow ticket trading while at the same time making <strong>scalping impossible</strong>. Regulators have been struggling for a long time to solve this problem and what seemed impossible to achieve will be made possible by <strong>smart contracts</strong>! The <strong>impact</strong> of this will be <strong>huge</strong> and will <strong>change the ticketing space</strong> for the better.Additionally and not unimportantly it will give the event organizer an <strong>extra revenue stream</strong>. The money that right now for a large part goes to scalpers (the secondary ticket market is worth $15B) will be <strong>tapped into by the event organizers.</strong></p>\n\n<p><a href=\"https://bigthink.com/politics-current-affairs/scalping\">Why this is important</a></p>\n\n<p>The advantage for GET holders is twofold:</p>\n\n<ol>\n<li>The P2P market will atract <strong>more users</strong> (artists, venues, ticketing companies) of the GET protocol (= more GET needed in the primary market)</li>\n<li>every ticket exchanged in the secondary market is an <strong>additional statechange</strong> (= more GET needed)</li>\n</ol>\n\n<p><strong>Event financing</strong>Without a doubt one of the most promising and exciting things to look forward to in 2021 is the introduction of <strong>decentralized event financing</strong> to GET Protocol.Event organizers often struggle to get <strong>financing</strong> for their events. This doesn’t only apply to starting artists, but even to famous stars. The artists need to have a lot of <strong>capital in advance</strong> as they have to pay for the venues, organisation, … <strong>upfront</strong> while only receiving the money <strong>after the show is over</strong>. Enter GET’s DeFi solution!</p>\n\n<blockquote>\n<p><em>The pre-financing of events for event-organizers is not a solution looking for a problem; it’s a widely known and used tool that enables event organizers to make the investments needed to get their shows or festivals off the ground.In the past we have encountered Event Organizers who select their ticketing partner solely based on the amount of money and loan conditions that they are offered up front.</em></p>\n</blockquote>\n\n<p>Thanks to getNFT tickets you’ll be able to <strong>pre-finance</strong> events of <strong>your choice</strong>. You can <strong>choose</strong> to finance new artists (more risk/more APY) or established kpop stars (less risk/less APY).</p>\n\n<p>This is how it will work:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/rjsr3r36lxs61.png?width=700&amp;format=png&amp;auto=webp&amp;s=f8ee866a0e9c359b9c1235a8de374dcff614713b\">https://preview.redd.it/rjsr3r36lxs61.png?width=700&amp;format=png&amp;auto=webp&amp;s=f8ee866a0e9c359b9c1235a8de374dcff614713b</a></p>\n\n<p><em>If the concept seems complicated, here’s what you need to understand about GET’s decentralized financing solution:1.) Event organizers will be able to easily pre-finance their events. (Something they desperately crave.)2.) Investors will be able to invest in events of their choice, at a risk &amp; reward level that they feel comfortable with.3.) The $GET token is an integral part of the financing process, as it is required for ‘skin in the game’ from</em></p>\n\n<p>The <strong>advantage</strong> event financing for GET token holders will bring is again twofold:</p>\n\n<ol>\n<li>As a GET holder you’ll be able to finance events and <strong>share in the profit of the ticket sales</strong>. This means that GET will allow you to profit without selling = <strong>passive income</strong>. An important note is that this is profit <strong>without inflation</strong>. While other DeFi projects give you returns by increasing the supply (and thus decreasing the value of the token) the returns here will not increase the GET supply, as the returns <strong>come from real profit</strong>(ticket sales).</li>\n<li>As the GET token will be an <strong>integral</strong> part of this process, it will:- increase the <strong>buy pressure</strong> of the GET token (everyone who wants to participate will need GET)- <strong>decrease</strong> the <strong>supply</strong> (everyone who participates will have to locks his GET tokens).</li>\n</ol>\n\n<p>For a deeper insight I recommend the blog below:</p>\n\n<p><a href=\"https://medium.com/get-protocol/decentralizing-event-financing-liquidity-x-defi-x-nfts-975f028135f5\">https://medium.com/get-protocol/decentralizing-event-financing-liquidity-x-defi-x-nfts-975f028135f5</a></p>\n\n<h1>GET protocol will be decentralised</h1>\n\n<p>The endgoal of the GET protocol is to become <strong>open source and decentralised</strong>. There will be a <strong>governance model</strong> where changes to the protocol will be determined by GET token holders. That’s why I expect ticketing companies to <strong>acquire a lot of GET</strong> in time as their <strong>revenue relies</strong> on the direction of the protocol.</p>\n\n<p>The first steps towards decentralisation have already been taken: last week 10 million GET from the stability fund have been burned and the remaining 2,6 million have been put into a DAO treasury which will be governed by the community.</p>\n\n<p>So Mark Cuban, Ted Leonsis and other entrepreneurs can acquire a share in the GET protocol simply by buying the tokens. It would probably be a better strategy than building everything from scratch as GET has been stress tested over 600.000 times and proven to work and to end scalping.</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/kHGVjrr1cYduNHimFRTtByZRJE8jlW9eiWAjOUA0_Zo.jpg?auto=webp&s=7d047a3bd32fa44bd51ae325c6af639801b8c60d",
          "width": 1080,
          "height": 821
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/kHGVjrr1cYduNHimFRTtByZRJE8jlW9eiWAjOUA0_Zo.jpg?width=108&crop=smart&auto=webp&s=597b33878576f3a300d222a2251c154682e12fec",
            "width": 108,
            "height": 82
          },
          {
            "url": "https://external-preview.redd.it/kHGVjrr1cYduNHimFRTtByZRJE8jlW9eiWAjOUA0_Zo.jpg?width=216&crop=smart&auto=webp&s=9667036975ec1f33946706bfff5a4c6be7b4ab79",
            "width": 216,
            "height": 164
          },
          {
            "url": "https://external-preview.redd.it/kHGVjrr1cYduNHimFRTtByZRJE8jlW9eiWAjOUA0_Zo.jpg?width=320&crop=smart&auto=webp&s=881844118b26b87b14213cf16f1d82d2326638ce",
            "width": 320,
            "height": 243
          },
          {
            "url": "https://external-preview.redd.it/kHGVjrr1cYduNHimFRTtByZRJE8jlW9eiWAjOUA0_Zo.jpg?width=640&crop=smart&auto=webp&s=9180fa1e5deaa17a8505aa92763c622eac9aafc6",
            "width": 640,
            "height": 486
          },
          {
            "url": "https://external-preview.redd.it/kHGVjrr1cYduNHimFRTtByZRJE8jlW9eiWAjOUA0_Zo.jpg?width=960&crop=smart&auto=webp&s=0a32a70e356a4d26d9a05568385d6e3376fc2f06",
            "width": 960,
            "height": 729
          },
          {
            "url": "https://external-preview.redd.it/kHGVjrr1cYduNHimFRTtByZRJE8jlW9eiWAjOUA0_Zo.jpg?width=1080&crop=smart&auto=webp&s=9cfbf2702b7879180247910c6cdf5a790e474ac8",
            "width": 1080,
            "height": 821
          }
        ],
        "variants": {},
        "id": "4Kz304rOFxgf9V351siiNw7Ge4SZDzAENjZyiTNay5g"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/mq0u74/why_you_should_pay_attention_to_tomorrows_get/",
  "subreddit": "CryptoCurrency",
  "id": "mq0u74",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566615662
}