{
  "author": "Working-Mistake-6700",
  "the_new_excerpt": "I am 25 in the USA making 12.55 an hour at 40 hours a week. I live with my\nmother which helps costs. I had alot of health problems which stopped me from\nfinishing my college degree however I'm planning on getting it soon and getting\na better career. I have medical debt but I payed off all the other…",
  "original_created_utc": 1623591662,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はアメリカで25歳、週に40時間働いて時給12.55円です。母と一緒に住んでいます。\n母と同居しているので、費用面では助かっています。私は健康上の問題を抱えていて、大学を卒業することができませんでした。\nしたが、近いうちに学位を取得して、より良いキャリアを積むつもりだよ。\nより良いキャリアを積むつもりです。私は医療費の借金がありますが、他の借金はすべて返済しました...",
      "title": "投資はよくわからない。読むべき本はありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在美国25岁，每周工作40小时，每小时12.55美元。我和我的母亲住在一起\n我和我的母亲住在一起，这有助于降低成本。我有很多健康问题，使我无法完成我的大学学位。\n然而，我正计划尽快获得大学学位并获得更好的职业。\n一个更好的职业。我有医疗债务，但我已经还清了所有其他债务。",
      "title": "我不了解投资。有什么书是我应该读的吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在美國25歲，每週工作40小時，每小時12.55美元。我和我的母親住在一起\n我和我的母親住在一起，這有助於降低成本。我有很多健康問題，使我無法完成我的大學學位。\n然而，我正計劃儘快獲得大學學位並獲得更好的職業。\n一個更好的職業。我有醫療債務，但我已經還清了所有其他債務。",
      "title": "我不瞭解投資。有什麼書是我應該讀的嗎？"
    }
  ],
  "title": "I don't understand investing. Are there books I should read?",
  "created_utc": 1623599666,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am 25 in the USA making 12.55 an hour at 40 hours a week. I live with my mother which helps costs. I had alot of health problems which stopped me from finishing my college degree however I&#39;m planning on getting it soon and getting a better career. I have medical debt but I payed off all the other debt I had. Stimulus checks for the win. I put 5% of my pay into my 401k which is matched by my company. I am buying some silver every month. I have 1000 in my savings account and 1000 in my checking. I would like to understand money better, I need to get debt free I know, however it will take years to pay off and I&#39;m about to except more debt because I have to have surgery again. Should I just keep up what I am doing or are there other ways to try and grow my money? Are there books I can read?</p>\n</div><!-- SC_ON -->",
  "score": 179,
  "permalink": "/r/investing/comments/nywkil/i_dont_understand_investing_are_there_books_i/",
  "subreddit": "investing",
  "id": "nywkil",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009742343
}