{
  "author": "jetmax25",
  "original_created_utc": 1643991399,
  "title": "It doesn’t matter if you agree with your government or not. PAY YOUR TAXES",
  "created_utc": 1643999978,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Tax Fraud is serious &lt;/p&gt;\n\n&lt;p&gt;First of all no government is perfect there will always be some degree of corruption and wasteful spending. As for actually agreeing with how your government spends money, most people don’t, that’s why there are differing political parties. &lt;/p&gt;\n\n&lt;p&gt;Live in a third world dictatorship full of corruption, well fuck pay your taxes anyway so you don’t get arrested. &lt;/p&gt;\n\n&lt;p&gt;Most of the sub lives in the United States, a democracy with 538 people fighting on where money is spent every day. If you don’t like it vote differently. I know crypto has a big libertarian base, but your views do not justify cheating the system. &lt;/p&gt;\n\n&lt;p&gt;“I’d rather donate the money”, Do it then! Guess what, tax deductions for charities exist if you want to donate your profits. Put your money where your mouth is and stop making excuses&lt;/p&gt;\n\n&lt;p&gt;If you hide your crypto profits you are no better than millionaires with offshore accounts&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;wow some of you are incapable of civil discussion and feel the need to insult anyone with a different opinion than you&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 375,
  "permalink": "/r/CryptoCurrency/comments/skh83b/it_doesnt_matter_if_you_agree_with_your/",
  "subreddit": "CryptoCurrency",
  "id": "skh83b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Tax Fraud is serious\n\nFirst of all no government is perfect there will always be some degree of\ncorruption and wasteful spending. As for actually agreeing with how your\ngovernment spends money, most people don’t, that’s why there are differing\npolitical parties.\n\nLive in a third world dictatorship…"
}