{
  "author": "zjz",
  "the_new_excerpt": "We have grown to the kind of size we only dreamed of in the time it takes to get\na bad nights sleep. We've got so many comments and submissions that we can't\npossibly even read them all, let alone act on them as moderators. We wrote\nsoftware to do most of the moderation for us but that software…",
  "original_created_utc": 1611794162,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我们已经成长到了那种我们梦寐以求的规模，在这段时间里，我们已经有了很大的发展。\n晚上睡不好。我们已经得到了这么多的意见和意见书，我们不能。\n甚至可能全部阅读，更不用说作为版主采取行动了。我们写了\n软件为我们做了大部分节制工作，但该软件... ...",
      "title": "我们该何去何从，谁会站出来帮助我们？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們已經成長到了那種我們夢寐以求的規模，在這段時間裏，我們已經有了很大的發展。\n晚上睡不好。我們已經得到了這麼多的意見和意見書，我們不能。\n甚至可能全部閱讀，更不用說作爲版主採取行動了。我們寫了\n軟件爲我們做了大部分節制工作，但該軟件... ...",
      "title": "我們該何去何從，誰會站出來幫助我們？"
    }
  ],
  "title": "Where do we go from here and who is going to step up to help us?",
  "created_utc": 1611799789,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We have grown to the kind of size we only dreamed of in the time it takes to get a bad nights sleep. We&#39;ve got so many comments and submissions that we can&#39;t possibly even read them all, let alone act on them as moderators. We wrote software to do most of the moderation for us but that software isn&#39;t allowed to read the Reddit new feed fast enough and submit responses, and the admins haven&#39;t given us special access despite asking for it.</p>\n\n<p>We&#39;re suffering from success and our Discord was the first casualty. You know as well as I do that if you gather 250k people in one spot someone is going to say something that makes you look bad. That room was golden and the people that run it are awesome. We blocked all bad words with a bot, which should be enough, but apparently if someone can say a bad word with weird unicode icelandic characters and someone can screenshot it you don&#39;t get to hang out with your friends anymore. Discord did us dirty and <strong>I am not impressed with them destroying our community</strong> instead of stepping in with the wrench we may have needed to fix things, especially after we got over 1,000 server boosts. That is pretty unethical.</p>\n\n<p>To add to this, people are co-opting our name on twitter. I won&#39;t mention their accounts, but lots of handles with &quot;wsb&quot; and &quot;wallstreetbets&quot; in them are pretending to speak for us. They&#39;re saying things that we don&#39;t agree with, driving traffic to derivative communities and shitty pixelated merch stores, and generally making it harder for us to define who we are. There&#39;s also too much political bullshit in a community that was never <em>ever</em> political. The only way I want to occupy Wall St is in a suit myself or rent-free in the mind of a blown up short.</p>\n\n<p>That is why I&#39;m throwing my support behind the Twitter handle in general. We need a way to PUBLICLY reach out to the staff of the infrastructure that is failing us so the world can see that we aren&#39;t doing anything wrong here if they don&#39;t respond. We need to be able to respond directly to a reporter that is lying to the world about our clubhouse. We can&#39;t be expected to meet any expectations when we aren&#39;t given the tools we need.</p>\n\n<p>That&#39;s not to say I approve of every message or will even be in the loop for all of them, but it&#39;s clear to me we can&#39;t do nothing and we need a megaphone.</p>\n\n<p><strong><a href=\"http://twitter.com/wsbmod\">http://twitter.com/wsbmod</a></strong> aka <strong>@wsbmod</strong> is the only Twitter handle whose statements are directly from some part of the team.</p>\n\n<p>We&#39;ll do our best not to pretend to speak for you, but to try to speak with the volume our name now seems to command to get shit done for us.</p>\n</div><!-- SC_ON -->",
  "score": 68078,
  "permalink": "/r/wallstreetbets/comments/l6j4r9/where_do_we_go_from_here_and_who_is_going_to_step/",
  "subreddit": "wallstreetbets",
  "id": "l6j4r9",
  "is_self": true,
  "media": null,
  "is_video": false
}