{
  "author": "Evil____",
  "the_new_excerpt": "First of all, I am incredibly privileged. When my grandpa passed away in March,\nI inherited $30,000. I had $10,000 saved up as well from working the prior\nsummer and that $10,000 was already invested in the stock market. In high school\nI found out about stocks in my economics class and the day I…",
  "original_created_utc": 1608838536,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "首先，我有令人难以置信的特权。当我爷爷在三月份去世的时候，\n我继承了3万美元。我从之前的工作中也省下了10,000美元\n而且那10,000美元已经投资到了股票市场。在高中的时候\n我是在我的经济课上发现股票的，那天我…",
      "title": "我在19岁时的11.2万美元的气候变化投资组合&我学到了什么"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，我有令人難以置信的特權。當我爺爺在三月份去世的時候，\n我繼承了3萬美元。我從之前的工作中也省下了10,000美元\n而且那10,000美元已經投資到了股票市場。在高中的時候\n我是在我的經濟課上發現股票的，那天我…",
      "title": "我在19歲時的11.2萬美元的氣候變化投資組合&我學到了什麼"
    }
  ],
  "title": "My $112,000 climate change portfolio at the age of 19 & what I've learned",
  "created_utc": 1608845799,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>First of all, I am incredibly privileged. When my grandpa passed away in March, I inherited $30,000. I had $10,000 saved up as well from working the prior summer and that $10,000 was already invested in the stock market. In high school I found out about stocks in my economics class and the day I turned 18 I invested every penny I had. </p>\n\n<p>Once again, I am privileged to be able to invest this money at all.. I have a college fund to pay my tuition, I don’t have to worry about when my next meal is coming, and I have the freedom to spend my money as I choose. </p>\n\n<p>Anyways, in March &amp; April when the market crashed I decided it was time to really dive into the stock market. I spent about 5 hours every day researching companies and I’m here to share what I’ve learned. </p>\n\n<p>In my opinion, <strong>the</strong> <strong>companies</strong> <strong>you</strong> <strong>invest</strong> <strong>in</strong> <strong>should</strong> <strong>be</strong> <strong>an</strong> <strong>extension</strong> <strong>of</strong> <strong>your</strong> <strong>worldview.</strong> Where do you think the world will be in 10 years+ and what industries will prosper from the change. As I was raised in a liberal family and hold these values, I’m quite concerned with <strong>Climate</strong> <strong>Change</strong>. I’ve taken college classes in this realm since and learned more about the risks we face. I believe that any company whose mission revolves around mitigating the climate crisis will prosper in the coming decades. </p>\n\n<hr/>\n\n<p>That being said, I’ll list the companies I hold and a very brief synopsis of what they do and why I hold their stock. <strong>Please</strong> <strong>do</strong> <strong>your</strong> <strong>own</strong> <strong>research</strong>; this is only meant to introduce young investors to a certain mindset that I hold and the companies that I choose to support. </p>\n\n<hr/>\n\n<p>1) <strong>Tesla</strong> <strong>(TSLA)</strong> </p>\n\n<p>portfolio weight: <strong>22.86%</strong></p>\n\n<p>gain/loss <strong>1026%</strong> <strong>gain</strong></p>\n\n<p>You guys all know what Tesla is about. They are the premier EV company with goals of cutting battery costs by 56% and producing 20,000,000+ cars in the decade. They also have a growing energy business with solar roofs, panels, battery storage and an autobidder software. Tesla is priced insanely high by traditional metrics. If these metrics are your investing style then it’s not for you. If you’re like me, and you look for companies to hold for decades then I believe Tesla is one of the best investments out there. What other company will benefit from the transition to renewables in response to climate change and changing political conditions?</p>\n\n<hr/>\n\n<p>2) <strong>MP</strong> <strong>Materials</strong> <strong>(MP)</strong></p>\n\n<p>portfolio weight: <strong>12.68%</strong></p>\n\n<p>gain/loss: <strong>197%</strong>  <strong>gain</strong></p>\n\n<p>MP is the only active rare earth mineral miner in the U.S. They produce neodymium concentrates which are important components in NDPR magnets; used in EV motors, wind turbines, electronics &amp; much more. </p>\n\n<p>I bought MP during their early pre-merger days and have already seen considerable profits in a few months. I’ve been shaving this position to keep it around 10% because it is a commodity play which can be quite risky. That being said, rare earths are expected to appreciate substantially in price as EV demand increases. Furthermore, MP is moving downstream to refine their rare earths themselves, as they currently ship them to China to be refined, and in the future they plan on manufacturing their own NDPR batteries. This will increase their margins greatly. </p>\n\n<hr/>\n\n<p>3) <strong>Planet</strong> <strong>13</strong> <strong>(PLNHF)</strong></p>\n\n<p>portfolio weight <strong>5.35%</strong></p>\n\n<p>gain/loss: <strong>147.71%</strong> <strong>gain</strong></p>\n\n<p>This one is a MJ stock and I’m focusing mostly on my Climate Change investments on this post so I’ll keep it brief. They own a superstore in Vegas and have their own brands. I believe the MJ industry is going to explode soon and PLNHF will benefit. </p>\n\n<hr/>\n\n<p>4) <strong>Jinko</strong> <strong>Solar</strong> <strong>(JKS)</strong></p>\n\n<p>portfolio weight: <strong>4.91%</strong></p>\n\n<p>gain/loss: <strong>268.88%</strong> <strong>gain</strong></p>\n\n<p>Jinko Solar is a leading solar panel manufacturer in China. They’ve seen market consolidation in China and are poised to benefit from increasing demand and incentives around solar energy. Specifically, South East Asia is expected to see dramatic growth in renewables as China/India are responsible for a large portion of global emissions and are also seeing considerable growth in GDP and population. It’s a play on the South East Asian economy and renewable industry. </p>\n\n<hr/>\n\n<p>5) <strong>SolarEdge</strong> <strong>(SEDG)</strong>:</p>\n\n<p>portfolio weight: <strong>4.89%</strong></p>\n\n<p>gain/loss: <strong>108.5%</strong> <strong>gain</strong></p>\n\n<p>SolarEdge is the global leader in panel inverters, which turn the sun’s D.C. current into usable electricity for households (A.C. current). The inverter space is a much more consolidated industry with higher margins than panels. They trade at a more expensive multiple and are expected to see dramatic top and bottom line growth in the coming years. Solar panels need inverters to perform; simple as that. With fewer companies focused on this space, I expect the top players to have a large market share and grow along with the solar energy market. SEDG is also expanding into the energy storage and EV charging markets with recent acquisitions. </p>\n\n<hr/>\n\n<p>6) <strong>Enphase</strong> <strong>Energy</strong> <strong>(ENPH)</strong></p>\n\n<p>portfolio weight: <strong>4.43%</strong> </p>\n\n<p>gain/loss: <strong>203.08%</strong> <strong>gain</strong></p>\n\n<p>Enphase is also in the inverter market, with their differentiated microinverters. Micro Inverters are generally used in smaller systems and optimal for residential solar. Everything said above about the inverter market is true for Enphase as well. Enphase’s business goes beyond inverters though. They are targeting a full residential energy ecosystem, with storage and their “Enlighten” software App, which will manage home energy usage and sell excess energy back to the grid. Enphase is very much a play on a future decentralized microgrid, with homes trading energy to each other as prices fluctuate. </p>\n\n<hr/>\n\n<p>7) <strong>Canadian</strong> <strong>Solar</strong> <strong>(CSIQ)</strong></p>\n\n<p>portfolio weight: <strong>4.42%</strong></p>\n\n<p>gain/loss: <strong>118.32%</strong> <strong>gain</strong></p>\n\n<p>Canadian Solar is another panel manufacturing company. They are also seeing growth in market share as smaller players struggle during the pandemic. CSIQ is a low cost producer with residential, commercial and grid level projects. They are planning on expanding their recurring revenue stream through full and partial ownership of solar projects. You can read more about this on the IR page. CSIQ is a pure solar play with an international footprint and vast management expertise. They will certainly benefit from any movement towards renewables, especially if legislation is passed to set a price on carbon. </p>\n\n<hr/>\n\n<p>8) <strong>Lemonade</strong> <strong>(LMND)</strong> </p>\n\n<p>portfolio weight: <strong>3.93%</strong></p>\n\n<p>gain/loss: <strong>112.52</strong> <strong>gain</strong></p>\n\n<p>Lemonade is not a climate change related investment. It’s highly speculative but I think their management team and business model is really cool so I put some money in (and quickly more than doubled it). I’ll be brief here, but basically they are a home/renter/pet insurance company that takes a flat 25% cut of premiums as revenue and uses the remaining money to pay out claims. They aim to align incentives by donating anything left over beyond the 25% to a charity of customers choosing. Also, their use of AI makes the registration and claims process seamless and “delights” customers. </p>\n\n<hr/>\n\n<p>9) <strong>TPI</strong> <strong>Composites</strong> <strong>(TPIC)</strong></p>\n\n<p>portfolio weight: <strong>3.73%</strong></p>\n\n<p>gain/loss: <strong>153.99%</strong> <strong>gain</strong></p>\n\n<p>TPIC manufacturers wind blade composites. They supply the top five wind turbine companies outside of China. I wrote about them on prior posts so I’ll just copy &amp; paste here:</p>\n\n<h2>63% of total wind blade manufacturing is outsourced to companies like TPI and they are the market leader in this space with about 20% market share globally. The business currently has low margins, but they target a 12% EBITDA margin for the future, and they trade at a measly 0.74 P/S ratio currently. They are also expanding into EV composite manufacturing and have a contract with Workhorse to manufacture vehicle parts for them.</h2>\n\n<p>10) <strong>Skyworks</strong> <strong>Solutions</strong> <strong>(SWKS)</strong></p>\n\n<p>portfolio weight: <strong>2.83%</strong></p>\n\n<p>gain/loss: <strong>60.57%</strong> <strong>gain</strong></p>\n\n<p>Skyworks is a semiconductor focused on connectivity chips for all kinds of devices. They aren’t climate change related which is the point of this post so I’ll leave it at that.</p>\n\n<hr/>\n\n<p>11) <strong>Tattooed</strong> <strong>Chef</strong> <strong>(TTCF)</strong></p>\n\n<p>portfolio weight: <strong>2.65%</strong></p>\n\n<p>gain/loss: <strong>55.90%</strong> <strong>gain</strong></p>\n\n<p>Tattooed Chef is a play on the rising plant-based food trend. They make a variety of frozen food items, widely available in Walmart, Costco and Target. They are expanding into Whole Foods, Trader Joe’s and many more stores, where I expect them to be very successful. The plant based market is exploding for a couple of reasons. Firstly, there is more research on the health benefits of a plant based diet, with athletes such as Chris Paul &amp; Todd Gurley endorsing these brands. Also, consumers are becoming increasingly aware of the threat of climate change and how avoiding red meat can have a positive impact on the planet. I expect TTCF to benefit off of these trends and continue innovating in the plant-based space. I bought in 3 weeks ago and the price has exploded since then. </p>\n\n<hr/>\n\n<p>12) <strong>Workhorse</strong> <strong>(WKHS)</strong></p>\n\n<p>portfolio weight: <strong>2.60%</strong></p>\n\n<p>gain/loss: <strong>35.90%</strong> <strong>gain</strong></p>\n\n<p>Workhorse is an electric delivery van company. They manufacture last mile electric vehicles and are developing drones to further decrease last mile delivery costs. They are a play on the e-commerce industry and electrification of vehicles. I’m invested in them because last mile delivery is responsible for a large chunk of transportation carbon emissions and in desperate need of electrification. I also believe that Workhorse will get a large chunk of the upcoming USPS contract which will provide a stable revenue stream.</p>\n\n<hr/>\n\n<p>13) <strong>Aphria</strong> <strong>(APHA)</strong></p>\n\n<p>portfolio weight: <strong>2.45%</strong></p>\n\n<p>gain/loss: <strong>53%</strong> <strong>gain</strong></p>\n\n<p>Aphria is another MJ play for me. Once again they aren’t a climate change investment so I’ll keep it brief. They just finalized a merger with Tilray, making them the biggest cannabis producer in the world. They are based in Canada and I believe they will be the market leader in Europe, due to their infrastructure advantage through owning CC Pharma.</p>\n\n<hr/>\n\n<p>14) <strong>Vestas</strong> <strong>Wind</strong> <strong>Systems</strong> <strong>(VWDRY)</strong></p>\n\n<p>portfolio weight: <strong>2.40%</strong></p>\n\n<p>gain/loss: <strong>197.44%</strong> <strong>gain</strong></p>\n\n<p>Vestas is the global leader in wind turbine manufacturing and installation. They are one of the few pure wind plays in the stock market, making them an attractive choice for anybody looking to get exposure to wind. A big driver if future growth will be their service and maintainace business, which their management team has been focused on in recent quarters. This is a higher margin business with consistent recurring revenues. </p>\n\n<hr/>\n\n<p>15) <strong>Facebook</strong> <strong>(FB)</strong></p>\n\n<p>portfolio weight: <strong>2.38%</strong></p>\n\n<p>gain/loss: <strong>20.61%</strong> <strong>gain</strong></p>\n\n<p>I’m selling out of FB very soon but I still hold them for now. FB is an incredible business and I’m sure they’ll see growth in the future, but it just isn’t for me (anymore). I consider ethics a lot in my investments, which many of you may consider stupid but idc. </p>\n\n<hr/>\n\n<p>16) <strong>Hannon</strong> <strong>Armstrong</strong> <strong>(HASI)</strong></p>\n\n<p>portfolio weight: <strong>2.18%</strong></p>\n\n<p>gain/loss: <strong>57.40%</strong> <strong>gain</strong></p>\n\n<p>HASI is a REIT, which solely makes climate change related investments. They invest in the land under solar projects, energy efficient buildings and much more. HASI is a great dividend play and I expect their stock price to appreciate as climate change worries are exacerbated in the future. </p>\n\n<hr/>\n\n<p>17) <strong>Beyond</strong> <strong>Meat</strong> <strong>(BYND)</strong></p>\n\n<p>portfolio weight: <strong>2.10%</strong></p>\n\n<p>gain/loss: <strong>21.24%</strong> <strong>gain</strong></p>\n\n<p>I made a post with some DD earlier this year on Beyond so I’ll just link that below:</p>\n\n<p><a href=\"https://www.reddit.com/r/stocks/comments/if9tmj/beyond_meat_bynd_fundamental_analysis_with_my/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf\">https://www.reddit.com/r/stocks/comments/if9tmj/beyond_meat_bynd_fundamental_analysis_with_my/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf</a></p>\n\n<hr/>\n\n<p>18) <strong>Brookefield</strong> <strong>Renewable</strong> <strong>Partners</strong> <strong>(BEPC)</strong></p>\n\n<p>portfolio weight: <strong>2.06%</strong></p>\n\n<p>gain/loss: <strong>87.23%</strong> <strong>gain</strong></p>\n\n<p>BEPC owns and operates a portfolio of renewable energy assets. Earlier this year they completed a merger with Terraform Power, expanding their solar &amp; wind footprint. They are also the primer owner of hydroelectric power plants, which produce a consistent source of electricity. BEPC has a strong management team and owns valuable assets that will greatly appreciate in value as government incentives expand around renewable energy consumption. They also pay a nice dividend. </p>\n\n<hr/>\n\n<p>19) <strong>Disney</strong> <strong>(DIS)</strong></p>\n\n<p>portfolio weight: <strong>2.03%</strong></p>\n\n<p>gain/loss: <strong>50.06%</strong> <strong>gain</strong> </p>\n\n<p>I’m invested in Disney mostly for some portfolio diversity. I’m a big fan of their streaming platform and business strategy revolving around that. This one isn’t climate change related so I’ll leave it at that.</p>\n\n<hr/>\n\n<p>20) <strong>First</strong> <strong>Solar</strong> <strong>(FSLR)</strong></p>\n\n<p>portfolio weight: <strong>1.84%</strong></p>\n\n<p>gain/loss: <strong>70.47%</strong> <strong>gain</strong></p>\n\n<p>First Solar is an American based panel manufacturer and projects operator. They used differentiated technology with Cadmoum Telluride panels, which are supposed to increase output and lifetime at a higher cost. FSLR is just another play on the growing solar industry, and being U.S. based seems to reward them a higher earnings multiple in the market than their peers. They also have a beautiful balance sheet. </p>\n\n<hr/>\n\n<p>21) <strong>Trulieve</strong> <strong>Cannabis</strong> <strong>(TCNFF)</strong></p>\n\n<p>portfolio weight: <strong>1.44%</strong></p>\n\n<p>gain/loss: <strong>5.33%</strong> <strong>gain</strong></p>\n\n<p>Trulieve is another Cannabis play. This one based in the U.S. with a large medical market in Florida. Nuff said. (Do your own research) </p>\n\n<hr/>\n\n<p>22) <strong>Star</strong> <strong>Peak</strong> <strong>Energy</strong> <strong>Transition</strong> <strong>(STPK)</strong></p>\n\n<p>portfolio weight <strong>1.43%</strong></p>\n\n<p>gain/loss: <strong>55.45%</strong> <strong>gain</strong></p>\n\n<p>Star peak is a brand new holding for me and already shot up like crazy. It’s one of these merger companies (the word is censored on this subreddit). merging with Stem energy storage. Stem is involved in the battery storage industry, with mostly grid level storage systems. They currently have an even larger market share than Tesla and my reason for holding this stock is mostly as a hedge against Tesla’s energy business. </p>\n\n<hr/>\n\n<p>23) <strong>Shopify</strong> <strong>(SHOP)</strong></p>\n\n<p>portfolio weight: <strong>1.10%</strong></p>\n\n<p>gain/loss: <strong>18.19%</strong> <strong>gain</strong></p>\n\n<p>Shopify is an eCommerce platform, which allows customers to seamlessly design their own website and process payments. I’ve used Shopify in the past and am a big fan of the business, which is a big part of why I’m invested. They have a steep valuation but I plan on holding for 10+ years. </p>\n\n<hr/>\n\n<p>Total gain: <strong>181.52%</strong></p>\n\n<p>(Note: I’ve taken some profits on a few of my stocks so the unrealized gain from my current holdings is less than my “total” gain by a few % points.)</p>\n\n<hr/>\n\n<p>Yes, I’m young and idealistic and have a lot to learn but I do know a few things. Here’s some of the lessons I’ve learned along my 1 and a half year journey in the market. </p>\n\n<hr/>\n\n<ol>\n<li><p>By investing in a company, you are supporting them financially. Buying pressure on companies’ stocks increases the price and allows them to raise capital more efficiently. It might be hard to hear, but <strong>when</strong> <strong>you</strong> <strong>buy</strong> <strong>Exxon</strong> <strong>stock</strong>, <strong>you</strong> <strong>are</strong> <strong>helping</strong> <strong>them</strong> <strong>destroy</strong> <strong>our</strong> <strong>planet</strong>. The same is true vice versa.  </p></li>\n<li><p><strong>Don’t</strong> <strong>listen</strong> to** <strong>anybody</strong> <strong>on</strong> <strong>reddit</strong>. Seriously. Nobody here knows any better than you. Do your own research, form your own judgements. If you’re gonna pick individual stocks then following advice on reddit is not the way to go. Reading through investor relations pages is the best way to go. Watch videos and read articles about both sides of the story with different companies. Don’t take these videos as facts though, just absorb what other people think and judge the validity of the information for yourself. It’s important to <strong>become</strong> <strong>an</strong> <strong>independent</strong> <strong>thinker</strong>. This is a slow process but eventually you’ll get the hang of things.</p></li>\n<li><p><strong>Invest</strong> <strong>with</strong> <strong>a</strong> <strong>10+</strong> <strong>year</strong> <strong>timeline</strong>. This is especially true if you’re young like myself. Don’t concern yourself with daily or even monthly swings in a stock. Ask yourself if the company will be worth substantially more in a decade. If not, then say, if so then buy and hold. Don’t try to time the market or swing trade. You’re just bringing on unnecessary risk. Buy and hold and buy some more. </p></li>\n<li><p><strong>Assess</strong> <strong>your</strong> <strong>own</strong> <strong>risk</strong> <strong>tolerance</strong>. As I’m sure several people will point out, my portfolio is incredibly speculative and risky from a traditional viewpoint. I have a really fucking high risk tolerance, so I invest with a “riskier” mindset. If I were to lose all my money tomorrow, I’d be fine. I’m going to have a college degree in a couple years and I’m not worried about being able to find a job. My reason for investing is about having the financial freedom to do whatever I want in life, and not worry about money in the future. If you’re investing for retirement or to pay off student loans, then I recommend taking a more conservative approach and maybe buying some index funds. However, if you’re young and have a stomach for risk like myself, then go crazy.</p></li>\n</ol>\n\n<hr/>\n\n<p>In conclusion, I’ve had an incredible year or so in the market. I don’t expect to have even close to these same returns in the future, but I’ve learned a thing or two and I’m here to share this information. You may disagree with everything I said and all the stocks I own and that’s okay! Don’t copy my portfolio and take everything I say with a grain of salt, however I hope you find some wisdom from this post!</p>\n</div><!-- SC_ON -->",
  "score": 4184,
  "permalink": "/r/stocks/comments/kjlbx7/my_112000_climate_change_portfolio_at_the_age_of/",
  "subreddit": "stocks",
  "id": "kjlbx7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609495334781
}