{
  "author": "Ermingardia",
  "original_created_utc": 1631652764,
  "title": "Crypto scammer got in touch with me. He didn't know I used to be a scambaiter. It didn't end well for him.",
  "created_utc": 1631658745,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I had often heard that if you mention you are new to crypto, lots of scammers will DM you and offer to trade for you. But the thing is, I hadn&#39;t received any of those DMs so far, and I was looking forward to, because I was once a scambaiter and I missed the good old days.</p>\n\n<p>Well, this &quot;crypto trader&quot; contacted me out of the blue three weeks ago, and I happened to have some free time in my hands. He stole the pictures of some real guy who works with blockchain technologies. He really wanted to talk about crypto, but I tried to deviate from this topic and tried to flirt with him instead. I provided some fake info about myself, and acted like I was very lonely and very happy to finally talk to someone. I wanted to waste his time, but he kept asking about crypto.</p>\n\n<p>Day by day, I tried to gain his trust. I acted very naive and grateful for his advice. I even told him someone had DM&#39;ed me to discuss crypto, and that I suspected it could be a scam. He instructed me to block those people as soon as possible. One day, I asked to do a voice call, but he couldn&#39;t because apparently that would disrupt his crypto signals, whatever that means. He claimed to be from the US, which I&#39;m sure he wasn&#39;t, judging by the way he expressed himself.</p>\n\n<p>He wanted my crypto asap. He was going to trade it for free because he loves me so much. I told him I was going to receive an inheritance in crypto, but that my attorney was the one managing it. I asked whether I should tell the attorney about our &quot;relationship&quot; and how he was going to trade for me. He ordered me not to tell anyone about &quot;us&quot;. Unfortunately for the scammer, the &quot;attorney&quot; would be back around the second week of September. This bought me some extra time to keep wasting his.</p>\n\n<p>I never thought I would end up pulling this off, but what I did has all the characteristics of an advance-fee scam:</p>\n\n<ol>\n<li>The &quot;attorney&quot;, who was the custodian of my crypto inheritance, told me he was holding 2.74 BTC on my behalf.</li>\n<li>I went to see the attorney and signed some documents, where I gave him permission to transfer all my crypto to the scammer. I gave scammer a made-up case id and asked him to contact the attorney.</li>\n<li>Scammer contacted the attorney but didn&#39;t provide the id. This delayed things (also because I was busy in real life). Id was requested again.</li>\n<li>Scammer provided the id and his address for the transfer to take place.</li>\n<li>Attoney informed scammer that, to avoid scams, and to pay for administration costs, he would have to transfer 0.05% fee in advance (0.00137 BTC).</li>\n<li>I woke up to a formerly empty wallet that now contains the 0.00137 BTC, I couldn&#39;t believe it! This is <a href=\"https://www.blockchain.com/btc/tx/d5a2c2c2802c9e2d630c51cbf62450155cf6263067f586a96650777910b8a3a4\">the transaction</a>.</li>\n</ol>\n\n<p>Now, I have this weird feeling, because I hold BTC that might have been stolen from someone else. I might hold it for a few months and then donate it to the food bank or something, I don&#39;t know. At least I hope he learned a lesson and will devote his time to something other than scamming people.</p>\n\n<p>Here are some images with the highlights of our 3 weeks of interaction:  <a href=\"https://imgur.com/a/mnFJhj1\">https://imgur.com/a/mnFJhj1</a></p>\n\n<p>By the way, Reddit does not allow you to report a profile, all I could do was report the pictures he stole from someone else, and I also warned that someone else.</p>\n\n<p>Edit:  After getting the fees, the attorney told him that his activity was suspicious so the fees had been frozen and he was going to be investigated for fraud and impersonation.</p>\n\n<p>Hours later, I messaged him as myself telling him the attorney had called me  and that he had found out he was a scammer. I said I couldn&#39;t believe he had betrayed me like that! The last thing he said was that he loved me. </p>\n</div><!-- SC_ON -->",
  "score": 459,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/Udp7q7olGkaC1Uynvo-D-D0p0ee7aMPgth59QNjNBH8.jpg?auto=webp&s=d0b7ef8cc944d773cfaf7c235a5dec7939fc8ea5",
          "width": 190,
          "height": 59
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/Udp7q7olGkaC1Uynvo-D-D0p0ee7aMPgth59QNjNBH8.jpg?width=108&crop=smart&auto=webp&s=b3009bdacc948fb48321fcd8d28509628d38fbdb",
            "width": 108,
            "height": 33
          }
        ],
        "variants": {},
        "id": "s675PFDCOOKZqyZYHKQcgLDy4dzM7O6QdjjRz2f2hzM"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/pobe0r/crypto_scammer_got_in_touch_with_me_he_didnt_know/",
  "subreddit": "CryptoCurrency",
  "id": "pobe0r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I had often heard that if you mention you are new to crypto, lots of scammers\nwill DM you and offer to trade for you. But the thing is, I hadn't received any\nof those DMs so far, and I was looking forward to, because I was once a\nscambaiter and I missed the good old days.\n\nWell, this \"crypto trader\"…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号の初心者だと言うと、多くの詐欺師がDMを送ってきて取引を持ちかけてくるという話をよく聞きました。\nがDMを送ってきて、あなたのために取引を申し出てくるとよく聞いていました。しかし、そのようなDMを受け取ったことはありませんでした。\nしかし、私はこれまでそのようなDMを受け取ったことがありませんでしたが、私は楽しみにしていました。\nというのも、私はかつて詐欺師であり、古き良き時代を懐かしんでいたからです。\n\nさて、この「暗号トレーダー」...",
      "title": "暗号詐欺師から連絡が来た。彼は私がかつて詐欺師であったことを知りませんでした。彼にとっては良い結果にはなりませんでした。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我经常听说，如果你提到你是加密货币的新手，很多骗子\n会给你发DM，并提出为你交易。但问题是，我还没有收到任何\n但问题是，到目前为止，我还没有收到这些DM，我很期待，因为我曾经是一个\n诈骗者，我怀念过去的美好时光。\n\n那么，这个 \"加密货币交易员\"...",
      "title": "低成本的骗子与我取得了联系。他不知道我曾经是一个诈骗者。这对他来说不是什么好事。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我經常聽說，如果你提到你是加密貨幣的新手，很多騙子\n會給你發DM，並提出爲你交易。但問題是，我還沒有收到任何\n但問題是，到目前爲止，我還沒有收到這些DM，我很期待，因爲我曾經是一個\n詐騙者，我懷念過去的美好時光。\n\n那麼，這個 \"加密貨幣交易員\"...",
      "title": "低成本的騙子與我取得了聯繫。他不知道我曾經是一個詐騙者。這對他來說不是什麼好事。"
    }
  ]
}