{
  "author": "Jase82",
  "original_created_utc": 1637457991,
  "title": "If you don't know about using Brave Browser to earn free BAT, come learn!",
  "created_utc": 1637487554,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Many people know about the Brave web browser, but as we are gaining more and more crypto newcomers  I&#39;m sure there are many who don&#39;t know about it or understand it fully. </p>\n\n<p>The Brave web browser pays it&#39;s users a small amount of BAT, Basic Attention Token, for viewing ads on the platform. Just having the ad pop up and swiping it away without clicking on it counts as an ad view.</p>\n\n<p>So for doing basically nothing other than browsing the web, you can get somewhere around 1/4 BAT a day. This can add up over time and if you are on the internet a lot as we all are, it can be a substantial amount. </p>\n\n<p>Make sure to go to the setting and turn off auto contribute. And you can change the amount of ads to 10 an hour now! They upgraded it from 5. </p>\n\n<p>Good luck with your internet, crypto journey!</p>\n</div><!-- SC_ON -->",
  "score": 165,
  "permalink": "/r/CryptoCurrency/comments/qyjtvq/if_you_dont_know_about_using_brave_browser_to/",
  "subreddit": "CryptoCurrency",
  "id": "qyjtvq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Many people know about the Brave web browser, but as we are gaining more and\nmore crypto newcomers I'm sure there are many who don't know about it or\nunderstand it fully.\n\nThe Brave web browser pays it's users a small amount of BAT, Basic Attention\nToken, for viewing ads on the platform. Just having…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "多くの人がBraveウェブブラウザを知っていますが、私たちはますます多くのクリプト初心者を獲得しています。\n暗号の初心者が増えてきているので、知らない人やよくわからない人が多いと思います。\n完全に理解していない人も多いと思います。\n\nBraveウェブブラウザは、ユーザーが広告を閲覧すると、少量のBAT、Basic Attention\nトークン）を支払う仕組みになっています。持つだけで...",
      "title": "Brave Browserを使って無料のBATを獲得することを知らない人は、ぜひ学びに来てください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "很多人都知道Brave网络浏览器，但随着我们获得越来越多的\n越来越多的加密货币新人，我相信有很多人不知道或不完全了解它。\n完全了解它。\n\nBrave网络浏览器向其用户支付少量的BAT，基本关注\n代币，用于观看平台上的广告。只要有...",
      "title": "如果你不知道使用Brave浏览器来赚取免费的BAT，那就来学习吧!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "很多人都知道Brave網絡瀏覽器，但隨着我們獲得越來越多的\n越來越多的加密貨幣新人，我相信有很多人不知道或不完全瞭解它。\n完全瞭解它。\n\nBrave網絡瀏覽器向其用戶支付少量的BAT，基本關注\n代幣，用於觀看平臺上的廣告。只要有...",
      "title": "如果你不知道使用Brave瀏覽器來賺取免費的BAT，那就來學習吧!"
    }
  ]
}