{
  "author": "Accomplished-Design7",
  "original_created_utc": 1636934609,
  "title": "The clam before the storm",
  "created_utc": 1636961446,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A few days have passed and nothing much has happened. For those of you who are going to say there was a massive dip just a few days ago. No, that was not a dip that was just a healthy pullback. In the past, I would call that a dip too but after the May crash, FUDs, hopiums, and many more. What has been happing lately is too little for me to pour out any emotions. </p>\n\n<p>So right now, we are experiencing a really clam stage of crypto. This is what I would like to call the &quot;calm before the storm&quot;. Judging from all the previous charts from 2013 and 2017, we have yet to see the parabolic run. But once we see it massive FOMO will kick in and people will go nuts about crypto. So what am I doing now? Well, I am preparing myself mentally. I would not want my emotions to get the better of me and buy near ATHs and be left with holding the bags. I have set my targets to sell and set an amount of my portfolio to HODL indefinitely. </p>\n\n<p>This is the time to recoup your thoughts and your exit and entry strategy. The parabolic run will come and I will take my profits, because when the bear comes and I do want to have some cash flow so I can buy them crypto cheap. </p>\n\n<p>Thanks for coming to my TedTalk.</p>\n</div><!-- SC_ON -->",
  "score": 162,
  "permalink": "/r/CryptoCurrency/comments/qu34ba/the_clam_before_the_storm/",
  "subreddit": "CryptoCurrency",
  "id": "qu34ba",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "A few days have passed and nothing much has happened. For those of you who are\ngoing to say there was a massive dip just a few days ago. No, that was not a dip\nthat was just a healthy pullback. In the past, I would call that a dip too but\nafter the May crash, FUDs, hopiums, and many more. What has…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "数日経っても特に何も起こらない。あなた方は\nほんの数日前に大きなディップがあったと言う人のために。いや、あれはディップではなく\n健全なプルバックに過ぎません。以前であれば、私もディップと呼んでいましたが\n5月の暴落の後、FUD、ホピウム、その他もろもろ。何が...",
      "title": "嵐の前のアサリ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "几天过去了，没有发生什么事。对于那些\n要说几天前就有一个巨大的跌落。不，那不是跌落\n那只是一次健康的回调。在过去，我也会把这称为下跌，但是\n在5月的暴跌之后，FUDs、hopiums，还有更多。有什么...",
      "title": "暴风雨前的蛤蜊"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "幾天過去了，沒有發生什麼事。對於那些\n要說幾天前就有一個巨大的跌落。不，那不是跌落\n那只是一次健康的回調。在過去，我也會把這稱爲下跌，但是\n在5月的暴跌之後，FUDs、hopiums，還有更多。有什麼...",
      "title": "暴風雨前的蛤蜊"
    }
  ]
}