{
  "author": "ultron290196",
  "the_new_excerpt": "I've been in the Cryptocurrency scene since the bull run of 2017. Started off\nwith a modest buy in and HODLed through the peak of the bullrun. I was tempted\nto sell at 20k, but my expectations for gains made me miss the peak and then it\ncrashed to 4k.\n\nSince I invested only an amount I could afford…",
  "original_created_utc": 1618846788,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2017年のブルランから暗号通貨のシーンに入っています。最初は\n控えめな買いでスタートし、ブルランのピーク時にはHODLしていました。私は20kで売りたいと思いました。\n20kで売ろうと思ったが、利益を期待していたためにピークを逃してしまい、その後は\n4kまで暴落しました。\n\n余裕のある金額だけ投資したので...。",
      "title": "暗号を買ってHODLするつもりなら、最初の6ヶ月が一番大変だということを理解しておいてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "从2017年的牛市开始，我就进入了币圈。开始的时候\n以适度的买入，并在牛市的高峰期HODLed。我很想\n要在2万的时候卖出，但我对收益的预期让我错过了高峰期，然后就是\n崩盘到4千。\n\n由于我只投资了我能承受的金额... ...",
      "title": "如果你已经买了加密货币，并且你打算HODL，你应该明白，前6个月是最难的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "從2017年的牛市開始，我就進入了幣圈。開始的時候\n以適度的買入，並在牛市的高峯期HODLed。我很想\n要在2萬的時候賣出，但我對收益的預期讓我錯過了高峯期，然後就是\n崩盤到4千。\n\n由於我只投資了我能承受的金額... ...",
      "title": "如果你已經買了加密貨幣，並且你打算HODL，你應該明白，前6個月是最難的。"
    }
  ],
  "title": "If you've bought crypto and you plan to HODL, you should understand that the first 6 months is the hardest.",
  "created_utc": 1618858398,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been in the Cryptocurrency scene since the bull run of 2017. Started off with a modest buy in and HODLed through the peak of the bullrun. I was tempted to sell at 20k, but my expectations for gains made me miss the peak and then it crashed to 4k. </p>\n\n<p>Since I invested only an amount I could afford to lose, I learnt to let go and forget about it. I focused on my life for the next 3 years and just kept my coins safely. </p>\n\n<p>It wasn&#39;t until this bullrun that I came back into the scene. With gains of almost 800%.</p>\n\n<p>The lesson: Invest the amount you can afford to lose and learn to ride it out. The first 6 months will occupy your mental energy in cryptocurrency and you will change your mood at the whim of the market. Don&#39;t make cryptocurrency your whole life.</p>\n</div><!-- SC_ON -->",
  "score": 3166,
  "permalink": "/r/CryptoCurrency/comments/mu3chn/if_youve_bought_crypto_and_you_plan_to_hodl_you/",
  "subreddit": "CryptoCurrency",
  "id": "mu3chn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171521485
}