{
  "author": "Rutabaga-",
  "original_created_utc": 1650121657,
  "title": "How did terms 'first, second and third world country' completely change their meaning?",
  "created_utc": 1650147719,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As most of you probably know, these terms were originally meant to represent the alignment during the Cold War.&lt;/p&gt;\n\n&lt;p&gt;First world being NATO countries, second world being countries of the Warsaw pact and third world were those who were unaligned with either side.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://i.imgur.com/aTVVaP4.png\"&gt;Here&amp;#39;s a map&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;The term third world country, which was applicable to countries such as Switzerland, Austria, Sweden, Finland, Ireland, which are all in the top 20 countries worldwide for GDP per capita, has since changed its meaning to represent an impoverished/developing country, while first world was used to signify a high standard of living.&lt;/p&gt;\n\n&lt;p&gt;Obviously, these two definitions have absolutely nothing to do with each other. So who decided to take a term and make it mean something completely unrelated to it?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 115,
  "permalink": "/r/AskHistorians/comments/u4zqus/how_did_terms_first_second_and_third_world/",
  "subreddit": "AskHistorians",
  "id": "u4zqus",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "As most of you probably know, these terms were originally meant to represent the\nalignment during the Cold War.\n\nFirst world being NATO countries, second world being countries of the Warsaw\npact and third world were those who were unaligned with either side.\n\nHere's a map…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ご存知の方も多いと思いますが、これらの用語は、もともと\n冷戦時代の整列\n\n第一世界はNATO諸国、第二世界はワルシャワ条約加盟国です。\n第三世界とは、どちらにも属さない人たちのことです。\n\n地図はこちら...",
      "title": "第一世界、第二世界、第三世界という言葉は、どのようにしてその意味を完全に変えてしまったのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "正如你们大多数人可能知道的那样，这些术语最初是为了代表\n冷战期间的结盟。\n\n第一世界是指北约国家，第二世界是指华沙条约国家，第三世界是指那些不与任何一方结盟的国家。\n第三世界是那些不与任何一方结盟的国家。\n\n这里有一张地图...",
      "title": "第一、第二和第三世界国家 \"这些术语是如何完全改变其含义的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "正如你們大多數人可能知道的那樣，這些術語最初是爲了代表\n冷戰期間的結盟。\n\n第一世界是指北約國家，第二世界是指華沙條約國家，第三世界是指那些不與任何一方結盟的國家。\n第三世界是那些不與任何一方結盟的國家。\n\n這裏有一張地圖...",
      "title": "第一、第二和第三世界國家 \"這些術語是如何完全改變其含義的？"
    }
  ]
}