{
  "author": "Simple_Somewhere_564",
  "original_created_utc": 1645851891,
  "title": "Why does the US ignore George Washington and the founding father’s warnings in his Farewell Address?",
  "created_utc": 1645878294,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In his farewell address, George Washington and a few founding fathers warned the US to- \n1. Not to put their regional and sectional interests above the interests of the nation as a whole.  Regions such as North, South, East and West should see their common interests rather than their differences.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Do not vote according to political party rather than comment interest. Washington feared it would foster a “spirit of revenge,” and enable the rise of “cunning, ambitious, and unprincipled men” who would “usurp for themselves the reins of government; destroying afterwards the very engines, which have lifted them to unjust dominion.”  &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Danger of Foreign Entanglements. A foreign policy based on neutrality was the safest way to maintain national unity, and stability, in the United States.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Basically, the US government is doing everything he warned us not to do. Why isn’t the government course correcting?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/t1oppf/why_does_the_us_ignore_george_washington_and_the/",
  "subreddit": "TooAfraidToAsk",
  "id": "t1oppf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In his farewell address, George Washington and a few founding fathers warned the\nUS to- 1. Not to put their regional and sectional interests above the interests\nof the nation as a whole. Regions such as North, South, East and West should see\ntheir common interests rather than their differences.\n\n…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ジョージ・ワシントンと数人の建国の父たちは、告別式の演説の中で次のように警告しました。\n米国は、1.地域的、部門的な利益を優先させないこと。\n国家全体としての 北、南、東、西などの地域は、国全体として見るべきである。\nその違いよりも、むしろ共通の利益を\n\n...",
      "title": "なぜアメリカはジョージ・ワシントンと建国の父による「告別の辞」での警告を無視するのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "乔治-华盛顿和几位开国元勋在其告别演说中告诫美国\n不要把他们的地区和宗派利益置于国家整体利益之上。\n不要把自己的地区和部门利益置于整个国家的利益之上。北部、南部、东部和西部等地区应该看到他们的共同利益，而不是他们的分歧。\n他们的共同利益而不是他们的分歧。\n\n...",
      "title": "为什么美国无视乔治-华盛顿和开国元勋在其告别演说中的警告？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "喬治-華盛頓和幾位開國元勳在其告別演說中告誡美國\n不要把他們的地區和宗派利益置於國家整體利益之上。\n不要把自己的地區和部門利益置於整個國家的利益之上。北部、南部、東部和西部等地區應該看到他們的共同利益，而不是他們的分歧。\n他們的共同利益而不是他們的分歧。\n\n...",
      "title": "爲什麼美國無視喬治-華盛頓和開國元勳在其告別演說中的警告？"
    }
  ]
}