{
  "author": "Old_Man_Papa",
  "the_new_excerpt": "The current economic data being released combined with recent statements from\nlarge corporations about pricing should be ringing inflation alarm bells. It’s\nnot just meme stocks that are mooning, the price of everything is going thru the\nroof. Could it be that the inevitable hangover from the money…",
  "original_created_utc": 1619820118,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "現在発表されている経済データや、大企業の価格に関する最近の発言を見ると\n大企業の価格設定に関する最近の発言は、インフレに警鐘を鳴らすべきです。それは\nミーム株が高騰しているだけではなく、あらゆるものの価格が高騰しているのです。\nそうです。もしかしたら、マネーの二日酔いは避けられないのかもしれません...",
      "title": "インフレ国家"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "目前公布的经济数据与最近大公司关于定价的声明相结合，应该为通货膨胀敲响警钟。\n大公司关于定价的声明应该敲响通货膨胀的警钟。这不是\n不仅仅是纪念性股票，所有东西的价格都在飞速上涨。\n屋顶。会不会是钱多的时候不可避免的宿醉...",
      "title": "通胀国家"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "目前公佈的經濟數據與最近大公司關於定價的聲明相結合，應該爲通貨膨脹敲響警鐘。\n大公司關於定價的聲明應該敲響通貨膨脹的警鐘。這不是\n不僅僅是紀念性股票，所有東西的價格都在飛速上漲。\n屋頂。會不會是錢多的時候不可避免的宿醉...",
      "title": "通脹國家"
    }
  ],
  "title": "INFLATION NATION",
  "created_utc": 1619904999,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The current economic data being released combined with recent statements from large corporations about pricing should be ringing inflation alarm bells. It’s not just meme stocks that are mooning, the price of everything is going thru the roof. Could it be that the inevitable hangover from the money printer going BRRRRR is approaching? I have no idea, but the numbers are staggering.</p>\n\n<p>Let’s look past the bullshit CPI which registered 2.6% for the March reading. The everyday items you and I consume are going up by much larger amounts than the FEDs favorite inflation gauge. Take housing prices for example, which everyone knows are going up at a crazy rate. February year over year increase was 12% nationally and shows no sign of slowing down. In my area, houses are selling in days at 20-25% over list. But the CPI doesn’t reflect this. The CPI tries to estimate housing inflation using “owner equivalent rent” which is what a homeowner would pay to rent their own house. The cost of the house is ignored in this equation, the focus being on the cost of the shelter it provides instead. That’s great, unless you want to buy a house. </p>\n\n<p>The prices of just about everything that it takes to build that house are going up too. The price of a new lot to build on is up 11% YOY and will likely continue to climb as supply of new lots is down 20% in that same period. The materials that make up the home are up as follows:</p>\n\n<p>Lumber: +67% YTD</p>\n\n<p>Copper: +27% YTD</p>\n\n<p>Gypsum: +7% YOY</p>\n\n<p>Steel Mill Products: +18% YOY</p>\n\n<p>Add in a shortage of construction workers, a national push for higher wages and ultra-low interest rates and housing shows no signs of becoming more affordable anytime soon. </p>\n\n<p>Fulfilment costs are going up across the board as well, due to numerous factors. Disruptions in the global shipping markets have led to price increases of 25-50% on shipping containers. A shortage of U.S. truck drivers will also lead to higher shipping costs, as well as having the add on affect of raising the cost of gas. Typically, 10% of U.S. tanker capacity is idle, currently it is 20-25% idle due to the shortage. Summer driving season is approaching. This may cause a feedback loop of higher gas prices as supply struggles to keep up with demand, negatively impacting consumers and businesses alike. </p>\n\n<p>To compound the aforementioned issues, the prices of the commodities and inputs used to produce a broad range of goods are also increasing rapidly. Look at these increases in just the last month alone:</p>\n\n<p>Cocoa: +2.5%</p>\n\n<p>Coffee: +12.7%</p>\n\n<p>Sugar: +13.6%</p>\n\n<p>Lean Hogs: +6.3%</p>\n\n<p>Rough Rice: +3.6%</p>\n\n<p>Oats: +7.4%</p>\n\n<p>Soybeans: +7.7%</p>\n\n<p>Wheat: +18%</p>\n\n<p>Corn: +18.5%</p>\n\n<p>Farmers are now substituting wheat grown for human consumption as animal feed due to the huge increase in the price of corn. This feedstock inflation can trickle thru the butcher block and dairy isle and potentially increase prices of meat, chicken, milk, eggs and cheese, just to name a few. </p>\n\n<p>In the recent earnings calls of several multi-national corporations the topic of pricing and supply chain issues was highlighted. Coke and Pepsi are both going to raise prices, and if you look at the price of sugar, the reason is obvious. P&amp;G and Mondelez both announced intentions to do the same, and Kraft spoke about rising costs across it supply chains. Selling a smaller amount for the same price isn’t gonna cut it this time anymore. Prices are going up. </p>\n\n<p>So, inflation appears to be working its way thru commodities markets and supply chains and will soon be knocking on the door. Printer’s days of going BRRRR may be catching up with us. Don’t worry though, you likely won’t be affected. Unless you live inside, drive, eat, drink coffee or pop, shop online or have anything to do with those industries, you’ll be just fine!</p>\n</div><!-- SC_ON -->",
  "score": 1173,
  "permalink": "/r/wallstreetbets/comments/n24jla/inflation_nation/",
  "subreddit": "wallstreetbets",
  "id": "n24jla",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380970812
}