{
  "author": "Balth89",
  "the_new_excerpt": "Hi, I am looking for a good read on monetary systems and policies, central\nbanking, financial systems and banking, how money is created, how it is loaned\nto banking houses, how ordinary people get it, etc\n\nAny good suggestion?\n\nI´ve seen some recommendation for the following book but i´m not sure it…",
  "original_created_utc": 1624092151,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "金融システムと政策、中央銀行、金融システムと銀行、お金はどのようにして作られ、どのようにして貸し出されるのか。\n金融システムと政策、中央銀行、金融システムと銀行、お金はどのように作られ、どのように銀行に貸し出され\nどのようにしてお金が作られ、どのようにして銀行に貸し出され、一般の人々はどのようにしてお金を手に入れるのかなど\n\n何か良い提案はありますか？\n\n次のような本を推薦しているのを見たことがありますが、私にはよくわかりません...",
      "title": "中央銀行、金融政策、金利、金融システム全体について学ぶのに良い本はありますか？"
    },
    {
      "locale": "zh",
      "title": "有什么学习中央银行、货币政策、利率和整个金融系统的好书吗？",
      "the_new_excerpt": "你好，我正在寻找一本关于货币体系和政策、中央银行、金融体系和银行业务的好书。\n币制度和政策、中央银行业务、金融系统和银行业务、货币如何创造、如何贷款、如何使用等方面的内容。\n贷给银行，普通人如何得到它，等等。\n\n有什么好的建议吗？\n\n我看到有人推荐下面这本书，但我不确定它是否合适。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好，我正在尋找一本關於貨幣體系和政策、中央銀行、金融體系和銀行業務的好書。\n幣制度和政策、中央銀行業務、金融系統和銀行業務、貨幣如何創造、如何貸款、如何使用等方面的內容。\n貸給銀行，普通人如何得到它，等等。\n\n有什麼好的建議嗎？\n\n我看到有人推薦下面這本書，但我不確定它是否合適。",
      "title": "有什麼學習中央銀行、貨幣政策、利率和整個金融系統的好書嗎？"
    }
  ],
  "title": "Any good books for learning about central banks, monetary policies, interest rates and the financial system as whole?",
  "created_utc": 1624142995,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi, I am looking for a good read on monetary systems and policies, central banking, financial systems and banking, how money is created, how it is loaned to banking houses, how ordinary people get it, etc</p>\n\n<p>Any good suggestion?</p>\n\n<p>I´ve seen some recommendation for the following book but i´m not sure it will have what I’m looking for:</p>\n\n<p>· The End of Alchemy: Money, Banking, and the Future of the Global Economy Paperback – March 7, 2017</p>\n\n<p>by Mervyn King (Author)</p>\n\n<p>· The Ascent of Money: A Financial History of the World Paperback – 4 July 2019</p>\n\n<p>by Niall Ferguson (Author)</p>\n\n<p>· What Has Government Done to Our Money? Paperback – Large Print, May 27, 2015</p>\n\n<p>by Murray N. Rothbard (Author)</p>\n\n<p>Thanks :)</p>\n</div><!-- SC_ON -->",
  "score": 41,
  "permalink": "/r/investing/comments/o3bla9/any_good_books_for_learning_about_central_banks/",
  "subreddit": "investing",
  "id": "o3bla9",
  "is_self": true,
  "media": null,
  "is_video": false
}