{
  "author": "Brothanogood",
  "the_new_excerpt": "Roblox said earlier this week that it raised $520 million in private capital\nahead of a direct listing.\n\nThe company originally planned to go public in December but delayed its debut\nafter DoorDash and Airbnb soared more than expected out of the gates.\n\nThe company will trade on the New York Stock…",
  "original_created_utc": 1610149736,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "Roblox本周早些时候表示，它通过私人资本筹集了5.2亿美元\n在直接上市之前。\n\n该公司原计划在12月上市，但推迟了首次亮相。\nDoorDash和Airbnb的涨幅超出预期。\n\n该公司将在纽约证券交易所(New York Stock…)交易。",
      "title": "Roblox预计2月份在纽约证交所直接上市"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Roblox本週早些時候表示，它通過私人資本籌集了5.2億美元\n在直接上市之前。\n\n該公司原計劃在12月上市，但推遲了首次亮相。\nDoorDash和Airbnb的漲幅超出預期。\n\n該公司將在紐約證券交易所(New York Stock…)交易。",
      "title": "Roblox預計2月份在紐約證交所直接上市"
    }
  ],
  "title": "Roblox expects direct listing on NYSE in February",
  "created_utc": 1610178980,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Roblox said earlier this week that it raised $520 million in private capital ahead of a direct listing.</p>\n\n<p>The company originally planned to go public in December but delayed its debut after DoorDash and Airbnb soared more than expected out of the gates.</p>\n\n<p>The company will trade on the New York Stock Exchange under ticker symbol &quot;RBLX.&quot;</p>\n\n<p>Roblox said on Friday in an updated prospectus that it plans to go public through a direct listing next month, after the online game company delayed its debut in December.</p>\n\n<p>Earlier this week, Roblox disclosed that it raised $520 million in a private financing round ahead of a direct listing. By taking this route to the public markets instead of a traditional IPO, Roblox is following Spotify, Slack, Palantir and Asana, sidestepping a share sale and instead allowing existing stakeholders and employees to sell stock to new investors right away.</p>\n\n<p>The latest funding round, at $45 a share, valued Roblox at $29.5 billion. In the updated filing, Roblox said an independent valuation report in December placed the shares at $41.52 apiece. By raising some money before going public, Roblox was able to pad its balance sheet and preserve the ability to bring in more capital through a secondary sale later this year.</p>\n\n<p>Under the direct listing, the NYSE will set a reference price for the stock the night before Roblox&#39;s debut, but no shares will be traded at that price. In the morning, the market makers will match buyers and sellers to determine the opening price and the stock will be available to the broader market under the ticker symbol &quot;RBLX.&quot;</p>\n\n<p>Roblox had been considering a more traditional IPO, but tabled its plans last month after DoorDash and Airbnb popped on consecutive days, leading to concern that the company risked leaving too much money on the table.</p>\n\n<p>&quot;Due to market volatility and the performance of other recent underwritten initial public offerings, we have elected to file this prospectus as an amendment to the registration statement and pursue a direct listing to permit determination of the opening public price of our Class A common stock on the NYSE by buy and sell orders collected by the NYSE from broker-dealers,&quot; Roblox said in the prospectus.</p>\n\n<p>Because it&#39;s not doing an IPO, Roblox no longer requires underwriters. The company said Goldman Sachs and Morgan Stanley will stay on as financial advisers, but JPMorgan, Bank of America and RBC Capital Markets were removed from the filing.</p>\n\n<p>Roblox, which first released its service in 2006, is hitting the public market following a year of dramatic growth as kids, who were forced to stay home during the pandemic, spent more time playing games.</p>\n\n<p>Revenue in the third quarter jumped 91% from a year earlier to $242.2 million. Daily active users almost doubled in the period ended September to 36.2 million and &quot;hours engaged&quot; more than doubled to 8.7 billion.</p>\n\n<p>On Roblox&#39;s app, users create an avatar that they can move between millions of different games. They&#39;re all free to play, but users buy virtual currency called Robux for advanced features or to build their character.</p>\n\n<p>The games are created by outside developers, who share the revenue with Roblox. The company said in the updated filing that in the first three quarters of 2020, the platform had about 3,800 developers, who earned $215 million. That&#39;s up from a year earlier, when 2,400 developers made $72.2 million.</p>\n\n<p>While many game creators cash out into real world currency, &quot;some choose to reinvest their Robux into developer tools, promote their experiences through our internal ad network, or spend the Robux as any other user would,&quot; the company said.</p>\n\n<p><a href=\"https://www.cnbc.com/2021/01/08/roblox-expects-direct-listing-on-nyse-in-february.html\">Source</a></p>\n</div><!-- SC_ON -->",
  "score": 77,
  "permalink": "/r/stocks/comments/ktf2ah/roblox_expects_direct_listing_on_nyse_in_february/",
  "subreddit": "stocks",
  "id": "ktf2ah",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706380968
}