{
  "author": "thedardur",
  "the_new_excerpt": "Sorry if this violates any of the sub's rules, I just wanted to share and\nthought of nowhere better than asking my fellow mates about it.\n\n\n\nI just realized how much I crave and miss real intimacy.\n\n\n\nI saw a girl at work I really fancied and really got an attraction vibe from,\nshe left kind of…",
  "original_created_utc": 1612106699,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "对不起，如果这违反了任何子的规则，我只是想分享和。\n想到哪里都比不上问我的同伴们。\n\n\n\n我才知道自己是多么的渴望和怀念真正的亲密关系。\n\n\n\n我在工作中看到一个女孩，我真的很喜欢，而且真的有一种吸引人的感觉。\n她离开了那种...",
      "title": "如何应对对亲密关系的渴望？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對不起，如果這違反了任何子的規則，我只是想分享和。\n想到哪裏都比不上問我的同伴們。\n\n\n\n我才知道自己是多麼的渴望和懷念真正的親密關係。\n\n\n\n我在工作中看到一個女孩，我真的很喜歡，而且真的有一種吸引人的感覺。\n她離開了那種...",
      "title": "如何應對對親密關係的渴望？"
    }
  ],
  "title": "How do I cope with craving intimacy?",
  "created_utc": 1612114226,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Sorry if this violates any of the sub&#39;s rules, I just wanted to share and thought of nowhere better than asking my fellow mates about it.</p>\n\n<p>&#x200B;</p>\n\n<p>I just realized how much I crave and miss real intimacy.</p>\n\n<p>&#x200B;</p>\n\n<p>I saw a girl at work I really fancied and really got an attraction vibe from, she left kind of early while I was busy so I didn&#39;t really have any chance to speak to her too much and figure out if she&#39;s available in any way or try to get her number.</p>\n\n<p>&#x200B;</p>\n\n<p>It got me thinking and I realized it&#39;s been so long since I had any real intimacy, and it broke me.</p>\n\n<p>It&#39;s not like I didn&#39;t have sex since my ex and I broke up, it&#39;s been two years already and I&#39;ve been with plenty women since, but after thinking about it I don&#39;t remember the last time I&#39;ve had intimate intercourse with a women who was as attracted to me as I was to her, with which I&#39;ve had a real love connection.</p>\n\n<p>&#x200B;</p>\n\n<p>Heck, it&#39;s been so long I don&#39;t even remember if I had that connection and intimacy with my ex when we slept together.</p>\n\n<p>&#x200B;</p>\n\n<p>I&#39;m fine with my life but jesus, do I wish I could have that connection soon.</p>\n\n<p>&#x200B;</p>\n\n<p>Do you ever get the feeling you&#39;re missing that kind of intimacy? How the hell do I cope with it?</p>\n\n<p>Thanks for listening my friends</p>\n</div><!-- SC_ON -->",
  "score": 258,
  "permalink": "/r/AskMen/comments/l9edv7/how_do_i_cope_with_craving_intimacy/",
  "subreddit": "AskMen",
  "id": "l9edv7",
  "is_self": true,
  "media": null,
  "is_video": false
}