{
  "author": "cbus20122",
  "the_new_excerpt": "Read the article here:\nhttps://www.wsj.com/articles/beijings-squeeze-on-fragile-real-estate-developers-is-getting-real-11619682390\n\nGetting completely lost in the current wild bull market is the fact that China's\nmarkets and economy have been starting to once again show cracks and signs of\nweakness.…",
  "original_created_utc": 1619722719,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "記事はこちらから\nhttps://www.wsj.com/articles/beijings-squeeze-on-fragile-real-estate-developers-is-getting-real-11619682390\n\n現在の乱高下した強気の市場の中で、中国の市場と経済に再び亀裂と兆候が現れ始めているという事実は、完全に見落とされています。\n中国の市場と経済が、再び亀裂と兆候を見せ始めているという事実です。\n弱さを見せ始めている。....",
      "title": "脆弱な不動産開発業者に対する北京の締め付けは現実味を帯びてきた - Wall Street Journalの記事"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在这里阅读这篇文章。\nhttps://www.wsj.com/articles/beijings-squeeze-on-fragile-real-estate-developers-is-getting-real-11619682390\n\n在当前疯狂的牛市中，人们完全忽略了这样一个事实，即中国的市场和经济一直在发展。\n市场和经济已经开始再次出现裂痕和迹象。\n弱点....",
      "title": "北京对脆弱的房地产开发商的挤压正在变得真实 - 华尔街日报文章"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在這裏閱讀這篇文章。\nhttps://www.wsj.com/articles/beijings-squeeze-on-fragile-real-estate-developers-is-getting-real-11619682390\n\n在當前瘋狂的牛市中，人們完全忽略了這樣一個事實，即中國的市場和經濟一直在發展。\n市場和經濟已經開始再次出現裂痕和跡象。\n弱點....",
      "title": "北京對脆弱的房地產開發商的擠壓正在變得真實 - 華爾街日報文章"
    }
  ],
  "title": "Beijing’s Squeeze on Fragile Real-Estate Developers Is Getting Real - Wall Street Journal Article",
  "created_utc": 1619749539,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Read the article here: <a href=\"https://www.wsj.com/articles/beijings-squeeze-on-fragile-real-estate-developers-is-getting-real-11619682390\">https://www.wsj.com/articles/beijings-squeeze-on-fragile-real-estate-developers-is-getting-real-11619682390</a></p>\n\n<p>Getting completely lost in the current wild bull market is the fact that China&#39;s markets and economy have been starting to once again show cracks and signs of weakness. A lot of that is a product of the government starting to restrict their stimulus efforts in an attempt to keep the growth in debt and leverage in check. China has been the first market to really pull back stimulus, which probably isnt surprising since they were the first to be hit by and recover from Covid.</p>\n\n<p>In the above linked article, there are some very.... interesting happenings relating to the Chinese property market. I don&#39;t for one second believe that China would ever purposefully burst their property bubble, since that would be a self-inflicted wound that would do a massive amount of damage.</p>\n\n<p>That being said, as with any credit-fueled bubble, you tend to see these catch-22 situations pop up where regulators are forced to decide between:</p>\n\n<ol>\n<li>Allowing the bubble to grow larger and larger, losing any type of control over how it behaves and worsening the fallout when the bubble inevitably bursts.</li>\n<li>Clamping down on credit expansion, preventing the bubble from growing larger, but also risking being the pin that pops the bubble itself.</li>\n</ol>\n\n<p>They seem to be going for option 2 right now. China recently tried to curb credit growth in 2018, and that played a major role in the markets that year, where both bonds and stock indexes saw a mild decline on the year. Despite the impact, China didn&#39;t even end up actually reducing the debt in the system, but just slowed the level of growth.... until Covid hit and the floodgates were once again reopened to credit growth.</p>\n\n<p>Obviously, the thing to watch for is whether China can walk the tightrope of reducing leverage growth without triggering a cascading failure of the very fragile economy. One thing to keep in mind here is that China has greater ability to manage debt issues like this due to their economy not really being market-based, and the level of control the Gov&#39;t has over all the pieces in the puzzle. That&#39;s not to say that&#39;s all good - the ability to stall a forced deleveraging also means that the problems tend to metastasize quicker and to a far greater extent since the cans typically just get kicked down the road further. It&#39;s the classic moral hazard dilemma.</p>\n\n<p><strong>Good Twitter Thread On This Article</strong></p>\n\n<p>Quoting from Michael Pettis, who is always astute, and is a reasonably non-biased source on China&#39;s economy. <a href=\"https://twitter.com/michaelxpettis/status/1387831939353153537\">Read thread here</a>.</p>\n\n<blockquote>\n<p>&quot;Important article by <a href=\"https://twitter.com/Birdyword/\">@Birdyword</a>, who discusses the shift from bank loans to buyers&#39; deposits in the liabilities of Chinese property developers. As usual I&#39;m especially interested in the balance-sheet impact: as long as things are going well, the shift barely matters, but it matters a great deal if the developer ever gets into trouble and is unable to finish a project.  </p>\n\n<p>This creates at least two problems. First, a default by a large developer can cause what is effectively a &quot;run on the bank&quot; as other buyers around the country become reluctant to put up further deposits with other property developers.  </p>\n\n<p>This process can be highly self-reinforcing as it forces property developers to cut back further on operations, and so alienate even more deposits. Of course the more developers rely on deposits to fund their operations, the more likely it is that a problem with one large developer spreads to other developers around the country. Regulators can force banks to lend, but they can&#39;t force households to put up deposits.  </p>\n\n<p>Second, Beijing will have to choose either to let households take the loss or to force banks to step in and make them whole. The former seems politically unlikely, but the latter means that what had looked like a reduction in banks&#39; exposure to real estate developers was never a meaningful reduction at all but rather the conversion of direct liabilities into contingent liabilities. For all the regulatory agitation, in other words, there was never an improvement in financial-sector risk.  </p>\n\n<p>For many years we&#39;ve seen that &quot;deleveraging&quot; in China has meant reducing leverage in one part of the economy while increasing it in another. This isn&#39;t incidental. It is fundamental to the way the growth model works. &quot;</p>\n</blockquote>\n\n<p><strong>Some other general thoughts &amp; notes</strong></p>\n\n<ul>\n<li>The Shanghai Composite index is down 6% in RMB terms (ASHR etf is down 13% in US markets). In general, there has been emerging weakness in Chinese indexes compared to US stock indexes. Obviously this can reverse, but it&#39;s worth noting the divergence.</li>\n<li>The USDCNY exchange rate reversed in February for the first time since Covid hit in any meaningful way before starting it&#39;s fall again in recent weeks. Could be a sign that a durable trend reversal is coming, which tends to signal Chinese economic weakness from a market perspective.</li>\n<li>China has been putting curbs on developers for a little while now ( since end of 2020) due to excessive speculation &amp; credit growth - <a href=\"https://www.ft.com/content/5bdab1f8-3285-41ca-b964-bf3ce6b2c7fb\">read more here on some of the details</a></li>\n<li>Chinese property is the primary means of savings for Chinese citizens.</li>\n<li>Beijing recently reduced restrictions on capital being allowed to leave their borders. This may potentially have an effect on property values and the exchange rate, although it&#39;s tough to say if and how much this will matter.</li>\n</ul>\n\n<p>Discuss Below</p>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/investing/comments/n1bg9z/beijings_squeeze_on_fragile_realestate_developers/",
  "subreddit": "investing",
  "id": "n1bg9z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380965862
}