{
  "author": "-Z-3-R-0-",
  "the_new_excerpt": "Because red being your favorite color is an opinion you hold about the color,\nbut at the same time that statement is a true fact about the speaker, because it\nis a fact that red is their favorite color. I think it would only work as being\na fact regarding ones self, as like a personal belief you…",
  "original_created_utc": 1617766966,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "なぜなら、赤が一番好きな色であるということは、その色についてのあなたの意見だからです。\nしかし同時に、この発言は発言者の真実の事実でもあります。\nなぜなら、赤が彼らの好きな色であることは事実だからです。私は、これは自分自身に関する事実としてのみ機能すると思います。\n自分自身に関する事実としてのみ機能すると思います。",
      "title": "例えば、「赤は私の好きな色だ」という発言は、事実であると同時に意見でもあるのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因为红色是你最喜欢的颜色，是你对这个颜色的一种看法。\n但同时这句话也是关于说话人的真实事实，因为它\n是一个事实，红色是他们最喜欢的颜色。我想，只有作为被\n一个关于自己的事实，就像你的个人信仰一样... ...",
      "title": "比如 \"红色是我最喜欢的颜色 \"这句话能不能既是事实又是观点？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因爲紅色是你最喜歡的顏色，是你對這個顏色的一種看法。\n但同時這句話也是關於說話人的真實事實，因爲它\n是一個事實，紅色是他們最喜歡的顏色。我想，只有作爲被\n一個關於自己的事實，就像你的個人信仰一樣... ...",
      "title": "比如 \"紅色是我最喜歡的顏色 \"這句話能不能既是事實又是觀點？"
    }
  ],
  "title": "Could a statement, for example, \"red is my favorite color\" be both fact and opinion at the same time?",
  "created_utc": 1617814286,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Because red being your favorite color is an opinion you hold about the color, but at the same time that statement is a true fact about the speaker, because it is a fact that red is their favorite color. I think it would only work as being a fact regarding ones self, as like a personal belief you hold regarding something, and stating that you hold that belief/opinion is the same thing as stating a fact, that you do, hold those beliefs. But then wouldn&#39;t that suggest that the fact stated is in a separate realm than the opinion stated? Because the opinion stated is that red is your favorite color, and the fact is that you hold that belief, and not necessarily related to the opinion itself. </p>\n\n<p>This is all very confusing, please help lol</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/askphilosophy/comments/mltgbm/could_a_statement_for_example_red_is_my_favorite/",
  "subreddit": "askphilosophy",
  "id": "mltgbm",
  "is_self": true,
  "media": null,
  "is_video": false
}