{
  "author": "yettithmettith",
  "the_new_excerpt": "The same people who put out these articles are deeply invested in unsustainable\ncommodities and don't give a fuck so long as it benefits them. Don't be fooled\nby the media; while I agree that some coins are more innovative in how they\nmine, bitcoin is still the one that's going mainstream and that's…",
  "original_created_utc": 1614884379,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "发表这些文章的人也是深陷在不可持续的\n商品，只要对他们有利，就不屑一顾。不要被骗了\n媒体的报道；虽然我同意有些钱币的创新方式更多。\n我的，比特币还是那个主流，那是... ...",
      "title": "每天我都会看到另一篇关于比特币对环境有多坏的文章，说实话，这是我见过的最虚伪的废话。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "發表這些文章的人也是深陷在不可持續的\n商品，只要對他們有利，就不屑一顧。不要被騙了\n媒體的報道；雖然我同意有些錢幣的創新方式更多。\n我的，比特幣還是那個主流，那是... ...",
      "title": "每天我都會看到另一篇關於比特幣對環境有多壞的文章，說實話，這是我見過的最虛僞的廢話。"
    }
  ],
  "title": "Every day I see another article on how bad bitcoin is for the environment, and it's honestly the most hypocrital bullshit I've ever seen.",
  "created_utc": 1614906077,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The same people who put out these articles are deeply invested in unsustainable commodities and don&#39;t give a fuck so long as it benefits them. Don&#39;t be fooled by the media; while I agree that some coins are more innovative in how they mine, bitcoin is still the one that&#39;s going mainstream and that&#39;s what scares the hell out of them.</p>\n\n<p>Why are they so scared? Bitcoin is step one in curbing wealth inequality since it will be a lot more difficult for any institution to manipulate. They won&#39;t be able to just turn on the money printer to pump their stocks, meaning that we will no longer see the stock market grow while the consumer price index stays relatively stable (basically what I&#39;m saying is that they put more money in the stock market while the money supply of everyday people stays the same, increasing wealth inequality). </p>\n\n<p>Back to my main point; bitcoin mining isn&#39;t being run off of oil and coal like all of these other companies news agencies don&#39;t seem to have a problem with. They&#39;re scared for different reasons.</p>\n\n<p>Edit: I just realized that I misspelled hypocritical in the title, but can&#39;t change it. I&#39;m well aware of it though.</p>\n</div><!-- SC_ON -->",
  "score": 812,
  "permalink": "/r/Bitcoin/comments/lxs9za/every_day_i_see_another_article_on_how_bad/",
  "subreddit": "Bitcoin",
  "id": "lxs9za",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542567857
}