{
  "author": "ulallume",
  "original_created_utc": 1650809149,
  "title": "With respect to Gödel's first incompleteness theorem: given a consistent formal system, what are the cardinalities of the set of true-and-provable theorems and the set of true-but-unprovable theorems?",
  "created_utc": 1650837445,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have an undergraduate degree in math but I’m more of an enthusiast. I’ve always been interested in Gödel&amp;#39;s incompleteness theorems since I read the popular science book Incompleteness by Rebecca Goldstein in college and I thought about this question the other day.&lt;/p&gt;\n\n&lt;p&gt;Ultimately, I’m wondering if, given a consistent formal system, are almost all true statements unprovable? How would one even measure the cardinality of the set of true-but-unprovable theorems? Is this even a sensible question to pose?&lt;/p&gt;\n\n&lt;p&gt;My knowledge of this particular area is limited so explainations-like-I’m-an-undergrad would be most appreciated!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/askscience/comments/uavhrr/with_respect_to_gödels_first_incompleteness/",
  "subreddit": "askscience",
  "id": "uavhrr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I have an undergraduate degree in math but I’m more of an enthusiast. I’ve\nalways been interested in Gödel's incompleteness theorems since I read the\npopular science book Incompleteness by Rebecca Goldstein in college and I\nthought about this question the other day.\n\nUltimately, I’m wondering if,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は数学の学部を卒業していますが、どちらかというとマニアックな方です。私は\nゲーデルの不完全性定理には、大学時代にレベッカ・ゴールドスタイン著の科学書『不完全性』を読んで以来、ずっと興味を持っていました。\n大学時代にレベッカ・ゴールドスタインの『不完全性』を読んで以来、ゲーデルの不完全性定理にはずっと興味がありました。\n先日、この疑問について考えてみました。\n\n結局のところ、私は、、、、、、、、、、、、、、、、、、、、、、、、、、、、、、、、、。",
      "title": "ゲーデルの第一不完全性定理に関して、無矛盾な形式システムが与えられたとき、真で証明可能な定理の集合と真で証明不可能な定理の集合の基数はどうなるか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我有一个数学的本科学位，但我更像是一个爱好者。我一直\n我一直对哥德尔不完备性定理感兴趣，因为我在大学时读过丽贝卡-戈尔茨坦写的科普书《不完备性》。\n我一直对哥德尔不完备性定理感兴趣，因为我在大学时读了丽贝卡-戈尔茨坦的科普书《不完备性》，而且我\n有一天我想到了这个问题。\n\n归根结底，我在想，如果，...",
      "title": "关于哥德尔的第一个不完备性定理：给定一个一致的形式系统，真实且可证明的定理集和真实但不可证明的定理集的卡值是多少？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我有一個數學的本科學位，但我更像是一個愛好者。我一直\n我一直對哥德爾不完備性定理感興趣，因爲我在大學時讀過麗貝卡-戈爾茨坦寫的科普書《不完備性》。\n我一直對哥德爾不完備性定理感興趣，因爲我在大學時讀了麗貝卡-戈爾茨坦的科普書《不完備性》，而且我\n有一天我想到了這個問題。\n\n歸根結底，我在想，如果，...",
      "title": "關於哥德爾的第一個不完備性定理：給定一個一致的形式系統，真實且可證明的定理集和真實但不可證明的定理集的卡值是多少？"
    }
  ]
}