{
  "author": "freemarketdaddy",
  "the_new_excerpt": "Let me first start out by thanking this subreddit, as it truly has changed my\nlife. The information sharing and passion found in this community is something\nthat is awe inspiring.\n\nJust a little background - I graduated with an applied economics degree and have\nbeen working in finance for over 10…",
  "original_created_utc": 1609974537,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "首先让我感谢这个子编辑，因为它确实改变了我的\n生活。在这个社区中发现的信息共享和激情是\n这是令人敬畏的。\n\n只有一点背景-我毕业于应用经济学学位，并拥有\n我在金融领域工作了10多年…",
      "title": "将应用经济学用于比特币，以及它为什么重要。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先讓我感謝這個子編輯，因爲它確實改變了我的\n生活。在這個社區中發現的信息共享和激情是\n這是令人敬畏的。\n\n只有一點背景-我畢業於應用經濟學學位，並擁有\n我在金融領域工作了10多年…",
      "title": "將應用經濟學用於比特幣，以及它爲什麼重要。"
    }
  ],
  "title": "Using Applied Economics to Bitcoin and why it matters.",
  "created_utc": 1609992144,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Let me first start out by thanking this subreddit, as it truly has changed my life. The information sharing and passion found in this community is something that is awe inspiring. </p>\n\n<p>Just a little background - I graduated with an applied economics degree and have been working in finance for over 10 years. I first heard about Bitcoin from a friend during the 2017 run up to the previous ATH and told him he was a fool to invest in it. I advised him to go read up about tulip mania and get back to me. I also felt pretty vindicated when it eventually “crashed” in 2018. The problem I had was that I only looked at Bitcoin and cryptos in general, from a very surface level perspective. I also was worried about no central authority, network security, and no regulations. Fast forward to 2020 and I’m now literally begging my friends and family to buy some before it’s too late. </p>\n\n<p>What changed? My fears about the global economy has been growing rapidly the last few years. We are at a time when an estimated 17 trillion dollars worth of debt is producing a negative yield (I don’t want to get too technical  here, but trust me this is insane). Meanwhile we have 28 trillion dollars in US debt alone - with that number growing rapidly ever year. We are getting to a point in which every dollar the government receives in a year will go to paying interest on that debt. The federal reserve can’t raise interest rates, basically ever at this point, because they will bankrupt the government with higher interest rates on those debt payments. So the only way for the fed to pay our debt is to print more money to meet those obligations. We are truly at a moment of no return (please don’t listen to the MMT crowd, as they are a bunch of ass hats). The dollar being used as the global reserve currency is where this massive problem comes into play. </p>\n\n<p>What does this have to do with Bitcoin? Since inflation is inevitable, where do you put your money to preserve it’s value? Of course there is gold, and that was my first thought. But then sometime in June I ran across an article about Bitcoin, that led me to this subreddit and then down a rabbit hole that I will never escape. Bitcoin is superior to gold in every way, so it truly is the most logical choice. But in economic terms Bitcoin is a pristine piece of collateral that honestly will become the new global base collateral for all of finance. In the financial world Bitcoin solves a ton of problems: everyone can audit it, it is immutable, no double spend of collateral (trust me this happens all the time with government bonds today), the entire system is deflationary, it has a fixed total amount, and a massive amount of value can be sent across the globe in minutes (try taking self custody of gold and sending 100 million dollars of it anywhere). </p>\n\n<p>Let me stop here because I could go on and on...but can hear my wife in my head right now saying just stop there and let them digest this post. If for some reason this post is worthy of your attention, then I would love to do a second one about how I see this space growing from an economic standpoint. </p>\n\n<p>You all are amazing and I really do hope my first post on Reddit is of value. I promised I wasn’t going to say it...To the Moon ladies and gents!!!!</p>\n</div><!-- SC_ON -->",
  "score": 1045,
  "permalink": "/r/Bitcoin/comments/krzo9s/using_applied_economics_to_bitcoin_and_why_it/",
  "subreddit": "Bitcoin",
  "id": "krzo9s",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610100743645
}