{
  "author": "Gen_NumbNuts",
  "the_new_excerpt": "From what I know of ancient Roman restrooms they were simple rooms with wooden,\nand sometimes stone, benches for people to sit on. These simple rooms offered no\nprivacy aside from the tunics that restroom-goers wore. Some places had buckets\nwith communal sponges on sticks for any wiping that may be…",
  "original_created_utc": 1623943031,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "古代ローマのトイレについて私が知っている限りでは、彼らは木製、時には石製のベンチを備えた簡素な部屋でした。\n時には石造りのベンチが置かれていました。この簡素な部屋にはプライバシーはなく\nトイレに行く人が着ているチュニックを除けば、プライバシーはありません。ある場所では、バケツ\n共同で使うスポンジが棒についていて、それで拭くことができるようになっていました。",
      "title": "共和国時代のローマでは、公衆トイレはどのように使われていたのでしょうか。また、共同トイレにまつわる汚名や文化的なニュアンスはあったのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "根据我对古罗马厕所的了解，它们都是简单的房间，有木制的，有时是石制的，供人坐的。\n有时是石凳，供人们坐着。这些简单的房间没有提供\n除了上厕所的人所穿的外衣外，这些简单的房间没有任何隐私。有些地方有水桶\n桶，里面装着公共海绵，用于擦拭任何可能需要的东西。",
      "title": "共和国罗马的公共厕所是什么样子的，是否有任何与公共厕所相关的污名或文化上的细微差别？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "根據我對古羅馬廁所的瞭解，它們都是簡單的房間，有木製的，有時是石制的，供人坐的。\n有時是石凳，供人們坐着。這些簡單的房間沒有提供\n除了上廁所的人所穿的外衣外，這些簡單的房間沒有任何隱私。有些地方有水桶\n桶，裏面裝着公共海綿，用於擦拭任何可能需要的東西。",
      "title": "共和國羅馬的公共廁所是什麼樣子的，是否有任何與公共廁所相關的污名或文化上的細微差別？"
    }
  ],
  "title": "What was the public toilet experience in Republican Rome and were there any stigmas or cultural nuances associated with communal restrooms?",
  "created_utc": 1623982914,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>From what I know of ancient Roman restrooms they were simple rooms with wooden, and sometimes stone, benches for people to sit on.  These simple rooms offered no privacy aside from the tunics that restroom-goers wore.  Some places had buckets with communal sponges on sticks for any wiping that may be required. </p>\n\n<p>Were restrooms of this time considered unclean or unsatisfactory since people were required to &quot;take care of business&quot; in such an open setting?  Did the fact that communal sponges play any sort of role in people&#39;s desire to use public restrooms?  Did Romans even consider these points an issue?  Were restrooms operated and maintained by the city or were they mostly managed by private individuals similar to Crassus and his fire brigades?</p>\n\n<p>Any sort of enlightening information would be welcomed!</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/o1zp77/what_was_the_public_toilet_experience_in/",
  "subreddit": "AskHistorians",
  "id": "o1zp77",
  "is_self": true,
  "media": null,
  "is_video": false
}