{
  "author": "mA1yA",
  "original_created_utc": 1646496875,
  "title": "How does the language in which we think change?",
  "created_utc": 1646503758,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So at one time the language my brain uses to express thought changed from one language into another and I can’t understand the process behind that. (At that time I lived in another country for some time and was not confronted a lot with my first language.)&lt;/p&gt;\n\n&lt;p&gt;How does that happen? My brain made all these associations throughout my life doesn’t it have to “reboot” all the information? Isn’t it difficult to translate everything I remember? Why does my conscious mind do that, even though I understand my first language better?&lt;/p&gt;\n\n&lt;p&gt;As you can tell, I have a VERY rudimentary understanding of neuroscience. Do these questions make sense?&lt;/p&gt;\n\n&lt;p&gt;Language is so fundamental to how we think. I am just confused about how this drastic change happens.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 147,
  "permalink": "/r/askscience/comments/t7crof/how_does_the_language_in_which_we_think_change/",
  "subreddit": "askscience",
  "id": "t7crof",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So at one time the language my brain uses to express thought changed from one\nlanguage into another and I can’t understand the process behind that. (At that\ntime I lived in another country for some time and was not confronted a lot with\nmy first language.)\n\nHow does that happen? My brain made all…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "つまり、ある時、私の脳が思考を表現するために使う言語が、ある言語から変化したのです。\nその背景がわからないんです。(その時\n私はしばらく外国に住んでいたので、あまり接することがなかったのです。\n私の第一言語)\n\nどうしてそうなるのでしょうか？私の脳はすべて...",
      "title": "考える言語はどのように変化するのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，我的大脑用来表达思想的语言一度从一种语言变成了另一种语言。\n变成了另一种语言，我不明白这背后的过程。(在那个时候\n当时我在另一个国家生活了一段时间，没有经常面对我的第一语言）。\n我的第一语言）。\n\n这是怎么发生的？我的大脑让所有...",
      "title": "我们思考的语言是如何变化的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，我的大腦用來表達思想的語言一度從一種語言變成了另一種語言。\n變成了另一種語言，我不明白這背後的過程。(在那個時候\n當時我在另一個國家生活了一段時間，沒有經常面對我的第一語言）。\n我的第一語言）。\n\n這是怎麼發生的？我的大腦讓所有...",
      "title": "我們思考的語言是如何變化的？"
    }
  ]
}