{
  "author": "Goldy_thesupp",
  "original_created_utc": 1639409180,
  "title": "Whales are trying to liquidate leverage people right now",
  "created_utc": 1639423897,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;We all know the risk of leveraging, and today is a day that most alts and even BTC are going to see major players trying to hold the market down and push it in order to provide liquidations. Some of these may even be from the exchanges itself, or investment firms trying to predate individual investors before taxation changes and ways to regulate then are placed.&lt;/p&gt;\n\n&lt;p&gt;Dont try to fight against it, scale your leverage down, don&amp;#39;t leverage today, and if not leveraging just hold. After that we may expect a short squeeze, same motivation, big players are even taking hits in order to assure huge gains for themselves or for the exchanges. It&amp;#39;s NOT a day to be bold, it&amp;#39;s a day to relax, reduce risk and be calm.&lt;/p&gt;\n\n&lt;p&gt;BEWARE WITH THE ORDERBOOK it lies, whales are putting huge orders to bait small fish and then removing it to sell.&lt;/p&gt;\n\n&lt;p&gt;EditLol nice to see a lot of you hate leverage, but the post means something else: This is an opportunity to buy crypto in a low price, especially if you believe we are in a bull market. ;)&lt;/p&gt;\n\n&lt;p&gt;This is probably a good day to put in some of the money you saved to DCA, but not all of it, keep calm, keep carefull. In the long run whales can&amp;#39;t do this kind of manipulation and the market tend to become stable again.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 185,
  "permalink": "/r/CryptoCurrency/comments/rfi6je/whales_are_trying_to_liquidate_leverage_people/",
  "subreddit": "CryptoCurrency",
  "id": "rfi6je",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "We all know the risk of leveraging, and today is a day that most alts and even\nBTC are going to see major players trying to hold the market down and push it in\norder to provide liquidations. Some of these may even be from the exchanges\nitself, or investment firms trying to predate individual…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "レバレッジのリスクは誰もが知っていることで、今日はほとんどのアルト、さらには\nBTCは、大手プレイヤーが市場を押さえつけて、押し目買いをしようとするので\n清算を提供するためです。その中には、取引所から\nあるいは投資会社が個人を先取りして...。",
      "title": "クジラは今、テコ入れをしようとしている"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们都知道杠杆的风险，而今天是大多数alts甚至是\nBTC都会看到主要玩家试图压制市场并将其推入\n以提供清算。其中一些甚至可能是来自交易所\n本身，或投资公司试图抢占个人...",
      "title": "鲸鱼现在正试图对杠杆人进行清算"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們都知道槓桿的風險，而今天是大多數alts甚至是\nBTC都會看到主要玩家試圖壓制市場並將其推入\n以提供清算。其中一些甚至可能是來自交易所\n本身，或投資公司試圖搶佔個人...",
      "title": "鯨魚現在正試圖對槓桿人進行清算"
    }
  ]
}