{
  "author": "fullsends",
  "the_new_excerpt": "I have been following crypto for some time now. I've flown to the highs and\nendured the lows. It has been anything but a smooth ride but here we are, we\nmade it.\n\nThere's one thing I can't seem to figure out about cryptocurrencies. How do I\nmake it rain at the club if all my money is digital? Are…",
  "original_created_utc": 1618341444,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はこれまで、暗号を追いかけてきました。高値に飛びつき、安値に耐えてきました。\n安値にも耐えてきました。順調とは言えませんでしたが、ここに来て、私たちは成功しました。\n実現しました。\n\nしかし、暗号通貨についてどうしてもわからないことがあります。どうすれば\nクラブで雨を降らせるには？それは...",
      "title": "すべての暗号通貨には、1つの大きな欠点があります...。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我关注加密技术已经有一段时间了。我已经飞到了高点和\n忍受了低谷。这一路走来并非一帆风顺，但我们在这里，我们。\n做到了。\n\n关于加密货币，有一件事我似乎想不通。我怎么\n如果我所有的钱都是数字的，就可以在俱乐部里下雨？是...",
      "title": "所有的加密货币都有一个重大缺陷..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我關注加密技術已經有一段時間了。我已經飛到了高點和\n忍受了低谷。這一路走來並非一帆風順，但我們在這裏，我們。\n做到了。\n\n關於加密貨幣，有一件事我似乎想不通。我怎麼\n如果我所有的錢都是數字的，就可以在俱樂部裏下雨？是...",
      "title": "所有的加密貨幣都有一個重大缺陷..."
    }
  ],
  "title": "There is one major flaw with all cryptocurrencies...",
  "created_utc": 1618356632,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have been following crypto for some time now. I&#39;ve flown to the highs and endured the lows. It has been anything but a smooth ride but here we are, we made it. </p>\n\n<p>There&#39;s one thing I can&#39;t seem to figure out about cryptocurrencies. How do I make it rain at the club if all my money is digital? Are strippers going to have QR codes tattooed on them? Even so, I will surely want to throw a mega stack of bills and watch them float through the air. What can replace this feeling? Can cryptos issue certificates to show that I own them? maybe I can make it rain certs. Nonetheless, enjoy the new highs and may your gains be as firm as my uncle Sal on half price lap dance Tuesdays.</p>\n\n<p>Godspeed.</p>\n</div><!-- SC_ON -->",
  "score": 561,
  "permalink": "/r/CryptoCurrency/comments/mq9e9q/there_is_one_major_flaw_with_all_cryptocurrencies/",
  "subreddit": "CryptoCurrency",
  "id": "mq9e9q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566615669
}