{
  "author": "HighTurning",
  "original_created_utc": 1634689125,
  "title": "Three simple tools that can help you know the state of the bullrun",
  "created_utc": 1634726051,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So, for everyone that&#39;s new or looking for a simple guidance on how to see where we are on the bullrun, these three tools might be of help, and if not at least knowing they are around is a good idea. </p>\n\n<h1>The Basics of the cycle</h1>\n\n<p>Basically the bullrun on crypto usually follows a cycle, accumulation, BTC goes to ATH, then the retail investors jump in(For example RobinHood gets a huge influx of average Joes buying), as BTC rips ATHs people start fearing that the bullrun is over and think that BTC has gained too much and they go into altcoins, because they &quot;have more potential for growth&quot;, and we enter ALT Season.</p>\n\n<h1>Tools:</h1>\n\n<h2>Bitcoin Rainbow Chart</h2>\n\n<p><a href=\"https://www.blockchaincenter.net/bitcoin-rainbow-chart/\">This is the rainbow chart</a>, even though it looks like a clownish concept, it has been pretty decent at showing where in the bullrun we are, for example if you check the March/April prices related to the chart, you see that bitcoin was entering the reddish regression lines, which as the chart says, it&#39;s where <strong>FOMO Intensifies</strong>, after that we went into the 50% crash during may.</p>\n\n<p><a href=\"https://imgur.com/STXThVc\">Link to the pic of the April chart</a></p>\n\n<p>The chart itself consists of logarithmic regression lines, that are assigned to colors of the rainbow. The closer to red color, the closer to the peak we are, it shows that it was quite accurate on the peak back in 2018, but again, this should just tell you good pointers to where we are at. </p>\n\n<h2>The fear an greed Index</h2>\n\n<p><a href=\"https://alternative.me/crypto/fear-and-greed-index/\">Link to the index</a> </p>\n\n<p>This one is pretty simple, it&#39;s based on measuring the emotions on crypto investors, and as we get quite emotional when we are near the ATH, things are fuzzy now, we are at a pretty high Greed index, but it can also show you how is the FUD going when we are going into the market. It&#39;s important to note, that this index can swing quite fast, so it won&#39;t tell you much in the long run, mostly focused on local highs, as a single day where bitcoin goes into a minor dip can cause the index to drop into FUD quite fast. </p>\n\n<h2>Altcoin Season Index:</h2>\n\n<p>This index is based on how well are altcoins performing against BTC, this one is important because as I said, people tend to jump into another boats when BTC is too high, as they are exploring alts which can have higher returns. So knowing when is it altseason, or when to jump into alts is important if you want to have a nice run. </p>\n\n<p><a href=\"https://www.blockchaincenter.net/altcoin-season-index/\">Link to the index</a></p>\n\n<p>Overall those are the tools, they can sure help you know a bit of where we are, and take more informed decisions, crypto can be a wild ride, but there are certain patterns that can&#39;t be ignored, ignore them only if you are in for the long run.</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/aRC45eIjMF94n8wB9b4sPLaPVv4vFlYj7IVgQg4UvxE.jpg?auto=webp&s=a41b68bc4536694dccc2cc49f5bc1ff6e58a3be2",
          "width": 600,
          "height": 315
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/aRC45eIjMF94n8wB9b4sPLaPVv4vFlYj7IVgQg4UvxE.jpg?width=108&crop=smart&auto=webp&s=02f1da3b134d8db70888c9313923e6a2bfdab508",
            "width": 108,
            "height": 56
          },
          {
            "url": "https://external-preview.redd.it/aRC45eIjMF94n8wB9b4sPLaPVv4vFlYj7IVgQg4UvxE.jpg?width=216&crop=smart&auto=webp&s=3b5425a68ef5c51be5e12644cb906cce2d7775f9",
            "width": 216,
            "height": 113
          },
          {
            "url": "https://external-preview.redd.it/aRC45eIjMF94n8wB9b4sPLaPVv4vFlYj7IVgQg4UvxE.jpg?width=320&crop=smart&auto=webp&s=b2b03b6c5da792da1ff73b374665b3c54a254aff",
            "width": 320,
            "height": 168
          }
        ],
        "variants": {},
        "id": "ej5zTp1096mGCclVd8y_8mhJxZkY8cpvshlvLBvcRwU"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/qbooz0/three_simple_tools_that_can_help_you_know_the/",
  "subreddit": "CryptoCurrency",
  "id": "qbooz0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So, for everyone that's new or looking for a simple guidance on how to see where\nwe are on the bullrun, these three tools might be of help, and if not at least\nknowing they are around is a good idea.\n\n\nTHE BASICS OF THE CYCLE\n\nBasically the bullrun on crypto usually follows a cycle, accumulation,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "だから、初めての人や、ブルランでの位置を確認するための簡単なガイダンスを探している人には、この3つのツールが役に立つかもしれない。\nこの3つのツールが役に立つかもしれません。\n少なくとも、これらのツールの存在を知っておくことは良いアイデアだと思います。\n\n\nサイクルの基本\n\n基本的に、暗号のブルランは通常、蓄積、...というサイクルに従います。",
      "title": "ブルランの状態を知ることができる3つのシンプルなツール"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，对于每一个新的或正在寻找一个简单指导的人来说，如何看到我们在牛市上的位置，这三个工具可能会有帮助。\n我们在牛市的位置，这三个工具可能会有帮助，如果没有，至少\n知道它们的存在也是一个好主意。\n\n\n周期的基本原理\n\n基本上，加密货币的牛市运行通常遵循一个周期，积累，...",
      "title": "三个简单的工具可以帮助你了解公牛的运行状况"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，對於每一個新的或正在尋找一個簡單指導的人來說，如何看到我們在牛市上的位置，這三個工具可能會有幫助。\n我們在牛市的位置，這三個工具可能會有幫助，如果沒有，至少\n知道它們的存在也是一個好主意。\n\n\n週期的基本原理\n\n基本上，加密貨幣的牛市運行通常遵循一個週期，積累，...",
      "title": "三個簡單的工具可以幫助你瞭解公牛的運行狀況"
    }
  ]
}