{
  "author": "NEEDAUSERNAME10",
  "the_new_excerpt": "You've all heard of the $Becky Index, well may I present to you, the Karen\nIndex. Companies and products used by Karens. I'm going to continue my DD as to\nwhether this could be a good hedge or for bears as Karen's love returning stuff\nto retailers for a refund. However, Karen's tend to have more…",
  "original_created_utc": 1614142141,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "你们都听说过 \"贝基指数\"，那我就给你们介绍一下 \"凯伦指数\"。\n索引。凯伦使用的公司和产品。我要继续我的DD，至于\n这是否是一个很好的篱笆或熊，因为凯伦的爱返回的东西。\n零售商的退款。然而，凯伦的往往有更多的... ...",
      "title": "女士们，先生们，我给你们介绍，凯伦指数。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你們都聽說過 \"貝基指數\"，那我就給你們介紹一下 \"凱倫指數\"。\n索引。凱倫使用的公司和產品。我要繼續我的DD，至於\n這是否是一個很好的籬笆或熊，因爲凱倫的愛返回的東西。\n零售商的退款。然而，凱倫的往往有更多的... ...",
      "title": "女士們，先生們，我給你們介紹，凱倫指數。"
    }
  ],
  "title": "Ladies and Gentlemen, I give you, the $Karen Index",
  "created_utc": 1614149860,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>You&#39;ve all heard of the $Becky Index, well may I present to you, the Karen Index. Companies and products used by Karens. I&#39;m going to continue my DD as to whether this could be a good hedge or for bears as Karen&#39;s love returning stuff to retailers for a refund. However, Karen&#39;s tend to have more disposable income than Becky&#39;s and I truly believe this could out perform the SP 500</p>\n\n<p>- $KSS: Kohl&#39;s Corporation, Karen&#39;s love Big Box Stores, and Kohl&#39;s is no different.</p>\n\n<p>- $GM: Karen&#39;s love big SUV&#39;s and well, GM sells numerous large SUV&#39;s: Chevy Tahoe and Suburban, The Cadillac Escalade and the GMC Yukon/Denali.</p>\n\n<p>- $RGS: Regis Corp, owns numerous chain hair salons such as SuperCuts.</p>\n\n<p>- $OR:PA: L&#39;Oreal Paris, what do Karen&#39;s need to maintain those haircuts? Hairspray and lots of it. L&#39;Oreal comes to the rescue for our Karens having a bad hair day.</p>\n\n<p>- $TJX: TJ Maxx, another big box retailer Karen&#39;s love</p>\n\n<p>- $RCL: Karen&#39;s love cruises for vacations, screw experiencing the raw culture that comes with visiting cities or countries, give this Karen bottomless Mimosa&#39;s on the endless drink &amp; beverage package, and she&#39;s a very happy lady, until she gets cut off.</p>\n\n<p>- $DIS: Karen&#39;s tend to have children, and kid&#39;s love Disney. If they&#39;re not passed out on a sun chair on the deck of the Oasis of the Seas they&#39;re nursing a hangover in Disney World, putting on a brave face for the kids.</p>\n\n<p>- $YELP: Where do Karens go to when they can&#39;t complain in public? YELP!</p>\n\n<p>- $DRI: owner of Olive Garden, creator of endless breadsticks.</p>\n\n<p>- $FB: When you want your friends and family to hear your grievances with the world, where do you go? Facebook.</p>\n\n<p>- $WMT: Walmart, same as TJX.</p>\n\n<p>- $TM OR $HMC: Toyota Motor Company or Honda Motor Company, If Karen&#39;s don&#39;t have a Suburban in the driveway, then they have a Sienna or Odyssey to ferry their Mason&#39;s and Jessyca&#39;s around in.</p>\n\n<p>- $MCD: When Karen&#39;s are in a rush home from dance recital or soccer practice and Mason and Jessyca are hungry, you best believe she&#39;s stopping at McD&#39;s to yell at the drive thru cashier.</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/investing/comments/lr40sr/ladies_and_gentlemen_i_give_you_the_karen_index/",
  "subreddit": "investing",
  "id": "lr40sr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332883606
}