{
  "author": "Rare-Ganache6001",
  "original_created_utc": 1642421916,
  "title": "If I suck at explaining things, does that mean I don’t really understand what I’m trying to explain?",
  "created_utc": 1642479120,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;There’s times where I know exactly how to execute what I’m trying to explain, I just suck at explaining it. It’s like I can do it but I can’t explain it in a good enough way that people understand. People usually get confused and then I just want to show them what I mean or just do the thing I’m explaining. It makes sense to me in my head but becomes word salad when trying to explain.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/askphilosophy/comments/s62qrs/if_i_suck_at_explaining_things_does_that_mean_i/",
  "subreddit": "askphilosophy",
  "id": "s62qrs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "There’s times where I know exactly how to execute what I’m trying to explain, I\njust suck at explaining it. It’s like I can do it but I can’t explain it in a\ngood enough way that people understand. People usually get confused and then I\njust want to show them what I mean or just do the thing I’m…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "説明したいことをどう実行すればいいのか、よくわかるときがあります。\n説明するのが下手なんです。できるんだけど、うまく説明できないというか。\n理解されるには十分な方法です。みんなはたいてい混乱し、そして私は\nただ、私が言っていることを見せたい、あるいは私がやっていることをやってみたい...。",
      "title": "説明が下手ということは、自分が何を説明しようとしているのか、本当に理解していないということなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有的时候，我完全知道如何执行我所要解释的内容，我只是\n只是解释起来很糟糕。这就像我能做到，但我不能以足够好的方式解释它。\n足够好的方式让人们理解。人们通常会感到困惑，然后我\n然后我就想给他们看我的意思，或者直接做我正在做的事情...。",
      "title": "如果我的解释很糟糕，是否意味着我并不真正理解我所要解释的东西？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有的時候，我完全知道如何執行我所要解釋的內容，我只是\n只是解釋起來很糟糕。這就像我能做到，但我不能以足夠好的方式解釋它。\n足夠好的方式讓人們理解。人們通常會感到困惑，然後我\n然後我就想給他們看我的意思，或者直接做我正在做的事情...。",
      "title": "如果我的解釋很糟糕，是否意味着我並不真正理解我所要解釋的東西？"
    }
  ]
}