{
  "author": "ModernAustralopith",
  "original_created_utc": 1644354158,
  "title": "In 1974, the CIA recovered the bodies of six Soviet sailors as part of a top-secret operation. The remains were buried at sea with at least an approximation of full Soviet military honours. Are there any other examples of Cold War adversaries treating 'enemy' dead with similar respect?",
  "created_utc": 1644364473,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In Project Azorian, part of the wreckage of the nuclear submarine K-129 was raised in secret by the CIA, in the hope of gaining information about Soviet nuclear technology or secret codes. The operation was only partially successful, with the submarine breaking in two while it was being raised, with only about one-third of the wreckage being recovered. In the portion that was raised they found the remains of six Soviet sailors, three of whom they were able to identify.&lt;/p&gt;\n\n&lt;p&gt;The remains couldn&amp;#39;t be returned to their homeland without exposing the secrecy of the operation; instead, they were buried at sea with a formal ceremony. The ceremony included the use of the Soviet flag, playing the US and Soviet national anthems, prayers (or at least benedictions) in Russian, and so on. The video of the ceremony was released in the 90s, and there does seem to be at least a good-faith effort to show proper respect for the men who died aboard the submarine.&lt;/p&gt;\n\n&lt;p&gt;It got me thinking - was this standard procedure during the Cold War? Are there other examples of similar actions, on either side, or was this an extraordinary occurrence that wasn&amp;#39;t repeated?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 107,
  "permalink": "/r/AskHistorians/comments/snurvx/in_1974_the_cia_recovered_the_bodies_of_six/",
  "subreddit": "AskHistorians",
  "id": "snurvx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In Project Azorian, part of the wreckage of the nuclear submarine K-129 was\nraised in secret by the CIA, in the hope of gaining information about Soviet\nnuclear technology or secret codes. The operation was only partially successful,\nwith the submarine breaking in two while it was being raised,…"
}