{
  "author": "ModernAustralopith",
  "original_created_utc": 1644354158,
  "title": "In 1974, the CIA recovered the bodies of six Soviet sailors as part of a top-secret operation. The remains were buried at sea with at least an approximation of full Soviet military honours. Are there any other examples of Cold War adversaries treating 'enemy' dead with similar respect?",
  "created_utc": 1644364473,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In Project Azorian, part of the wreckage of the nuclear submarine K-129 was raised in secret by the CIA, in the hope of gaining information about Soviet nuclear technology or secret codes. The operation was only partially successful, with the submarine breaking in two while it was being raised, with only about one-third of the wreckage being recovered. In the portion that was raised they found the remains of six Soviet sailors, three of whom they were able to identify.&lt;/p&gt;\n\n&lt;p&gt;The remains couldn&amp;#39;t be returned to their homeland without exposing the secrecy of the operation; instead, they were buried at sea with a formal ceremony. The ceremony included the use of the Soviet flag, playing the US and Soviet national anthems, prayers (or at least benedictions) in Russian, and so on. The video of the ceremony was released in the 90s, and there does seem to be at least a good-faith effort to show proper respect for the men who died aboard the submarine.&lt;/p&gt;\n\n&lt;p&gt;It got me thinking - was this standard procedure during the Cold War? Are there other examples of similar actions, on either side, or was this an extraordinary occurrence that wasn&amp;#39;t repeated?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 107,
  "permalink": "/r/AskHistorians/comments/snurvx/in_1974_the_cia_recovered_the_bodies_of_six/",
  "subreddit": "AskHistorians",
  "id": "snurvx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In Project Azorian, part of the wreckage of the nuclear submarine K-129 was\nraised in secret by the CIA, in the hope of gaining information about Soviet\nnuclear technology or secret codes. The operation was only partially successful,\nwith the submarine breaking in two while it was being raised,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アゾリアン計画では、原子力潜水艦K-129の残骸の一部が\nソ連に関する情報を得るために、CIAが極秘に調達した。\n核技術や秘密の暗号など この作戦は部分的に成功しただけだった。\n引き上げ中に潜水艦が真っ二つに割れてしまい...。",
      "title": "1974年、CIAは極秘作戦の一環として、6人のソ連人船員の遺体を回収した。遺体は、少なくともソ連軍に準じた形で海中に埋葬された。冷戦時代の敵対国が、「敵」の死者に同様の敬意を払った例は他にあるのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在 \"阿佐里安计划 \"中，K-129号核潜艇的部分残骸被中情局秘密提出。\n的部分残骸被中央情报局秘密提出，希望获得有关苏联核技术或秘密合作的信息。\n希望获得有关苏联核技术或秘密密码的信息。这项行动只是部分成功。\n潜艇在被升起时断成两截，...",
      "title": "1974年，作为一项绝密行动的一部分，中央情报局找到了六名苏联水手的尸体。遗体被埋葬在海上，至少有近似于完整的苏联军事荣誉。还有其他冷战对手以类似的尊重对待 \"敌人 \"死者的例子吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在 \"阿佐裏安計劃 \"中，K-129號核潛艇的部分殘骸被中情局祕密提出。\n的部分殘骸被中央情報局祕密提出，希望獲得有關蘇聯核技術或祕密合作的信息。\n希望獲得有關蘇聯核技術或祕密密碼的信息。這項行動只是部分成功。\n潛艇在被升起時斷成兩截，...",
      "title": "1974年，作爲一項絕密行動的一部分，中央情報局找到了六名蘇聯水手的屍體。遺體被埋葬在海上，至少有近似於完整的蘇聯軍事榮譽。還有其他冷戰對手以類似的尊重對待 \"敵人 \"死者的例子嗎？"
    }
  ]
}