{
  "author": "hassdog18",
  "original_created_utc": 1639271986,
  "title": "How do I break up with my girlfriend of 4 years?",
  "created_utc": 1639307395,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m a 25 y/o male and have been dating my SO for 4 years. I’m so torn about this because she has been so good to me and doesn’t deserve the heartbreak. For various reasons I know she is not the one I want to spend the rest of my life with but I really don’t want to hurt her. She is 23 but we are at super different stages in our life. I really just want to do my own thing for awhile and not have to weigh anyone else’s opinion while I’m starting to get my life together (move away, buying a house etc.). I feel very selfish for wanting to break things off. I’m not sure how to go about this so naturally I will ask strangers on the internet.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/NoStupidQuestions/comments/rednzh/how_do_i_break_up_with_my_girlfriend_of_4_years/",
  "subreddit": "NoStupidQuestions",
  "id": "rednzh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m a 25 y/o male and have been dating my SO for 4 years. I’m so torn about this\nbecause she has been so good to me and doesn’t deserve the heartbreak. For\nvarious reasons I know she is not the one I want to spend the rest of my life\nwith but I really don’t want to hurt her. She is 23 but we are at…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は25歳の男性で、SOと付き合って4年目になります。私はこのことについてとても悩んでいます。\nなぜなら、彼女は私にとても良くしてくれたので、傷心に値しないからです。なぜなら\n様々な理由から、彼女は私の残りの人生を過ごす相手ではないとわかっています。\nでも、彼女を傷つけたくはない。彼女は23歳ですが、私たちは...",
      "title": "4年付き合った彼女と別れるにはどうしたらいいですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个25岁的男性，和我的妻子已经交往了4年。我很纠结这个问题\n因为她一直对我很好，不值得我心碎。对于\n由于各种原因，我知道她不是我想要度过余生的人。\n但我真的不想伤害她。她今年23岁，但我们在...",
      "title": "如何与交往4年的女友分手？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個25歲的男性，和我的妻子已經交往了4年。我很糾結這個問題\n因爲她一直對我很好，不值得我心碎。對於\n由於各種原因，我知道她不是我想要度過餘生的人。\n但我真的不想傷害她。她今年23歲，但我們在...",
      "title": "如何與交往4年的女友分手？"
    }
  ]
}