{
  "author": "SoupSpiller1969",
  "original_created_utc": 1654304416,
  "title": "Was porn produced in and/or by the Soviet Union? Did they ever use porn as a form of agitprop internally? Did they ever use porn as part of their active measures campaign in America in the 60s and 70s?",
  "created_utc": 1654318627,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Or maybe to broaden things what is the history of porn financing and distribution being used as a form of subversive psyop?  &lt;/p&gt;\n\n&lt;p&gt;I’ve basically been investigating alleged Russian oligarchy financing of specific subversive porn genres over the last 8 years-15 years that appears to be tied to their general Foundations of Geopolitics strategy to agitate and encourage Americans to radicalize against each other and cause the western alliance to collapse.  Incest and step-family porn over the last 8 years has seen a huge amount of dark financing coming from Russia and is basically everywhere now, from an active measures warfare perspective this normalizes and rewards antisocial ideas and increases the chance that some pervert turns it into antisocial behavior and sexually assaults a family member.  Financing blacked.com and then subversive marketing for it on websites like 4chan full of disaffected virginal “rootless white males” to get them hatebating to it privately, which causes them to overcompensate publicly and behaviorally radicalized them towards being increasingly more openly racist and reactionary. &lt;/p&gt;\n\n&lt;p&gt;Stuff like that is what is happening now, but I’m trying to figure out when it started.  When did weaponizing the financing and distribution of subversive porn either at your enemies or your own people first become a thing?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 108,
  "permalink": "/r/AskHistorians/comments/v4dkru/was_porn_produced_in_andor_by_the_soviet_union/",
  "subreddit": "AskHistorians",
  "id": "v4dkru",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Or maybe to broaden things what is the history of porn financing and\ndistribution being used as a form of subversive psyop?\n\nI’ve basically been investigating alleged Russian oligarchy financing of\nspecific subversive porn genres over the last 8 years-15 years that appears to\nbe tied to their…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "あるいは、ポルノの資金調達の歴史はどうなっているのか、など、いろいろなことが考えられると思います。\n破壊的サイコパスとして使われた歴史は？\n\n私は基本的に過去8年から15年に渡って ロシアン・オリガルキーが 特定の破壊的ポルノジャンルに資金を 提供した疑惑を調査してきた\n特定の破壊的なポルノジャンルへの資金提供について過去8年から15年調査してきました。\n関連してる...",
      "title": "ポルノはソビエト連邦で、あるいはソビエト連邦によって制作されたのか？ソ連がポルノを国内でアジト宣伝に使用したことはありますか？60年代から70年代にかけてのアメリカにおける積極的な対策キャンペーンの一環としてポルノを使用したことはありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "或者，为了扩大范围，色情融资的历史是什么？\n分发被用作一种颠覆性的psyop形式？\n\n我基本上一直在调查据称是俄罗斯寡头集团资助的\n在过去的8年-15年里，我一直在调查俄罗斯寡头对特定的颠覆性色情流派的资助。\n与他们的...",
      "title": "色情制品是在苏联和/或由苏联生产的吗？他们是否曾在内部使用色情制品作为一种煽动性的宣传方式？在60年代和70年代，他们是否曾使用色情作为他们在美国的积极措施运动的一部分？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "或者，爲了擴大範圍，色情融資的歷史是什麼？\n分發被用作一種顛覆性的psyop形式？\n\n我基本上一直在調查據稱是俄羅斯寡頭集團資助的\n在過去的8年-15年裏，我一直在調查俄羅斯寡頭對特定的顛覆性色情流派的資助。\n與他們的...",
      "title": "色情製品是在蘇聯和/或由蘇聯生產的嗎？他們是否曾在內部使用色情製品作爲一種煽動性的宣傳方式？在60年代和70年代，他們是否曾使用色情作爲他們在美國的積極措施運動的一部分？"
    }
  ]
}