{
  "author": "Level_Affect_7951",
  "original_created_utc": 1626590575,
  "title": "Ladies, how much concern do you really put toward your \"body count\"?",
  "created_utc": 1626630420,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m going to preface this by saying that I&#39;m not putting forth any moral judgement toward anyone one way or another. It&#39;s just, recently, I&#39;ve been thinking about my own body count and how it feels as though society holds women to a different standard than men when it comes to how many people we get horizontal with. </p>\n\n<p>It seems as though this philosophy has become more unspoken in recent years, but it still feels as if there is a silent expectation that women remain more chaste than our male counterparts. What are your thoughts on this?</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/AskWomen/comments/omlcv0/ladies_how_much_concern_do_you_really_put_toward/",
  "subreddit": "AskWomen",
  "id": "omlcv0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm going to preface this by saying that I'm not putting forth any moral\njudgement toward anyone one way or another. It's just, recently, I've been\nthinking about my own body count and how it feels as though society holds women\nto a different standard than men when it comes to how many people we…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "前置きが長くなりましたが、私は誰に対しても道徳的な判断を下しているわけではありません。\n判断しているわけではありません。ただ、最近、私は自分の体の数について考えていました。\n自分の体の数について考えていて、社会が女性を男性とは違う基準で見ているような気がして\n社会は女性を男性とは違う基準で見ているような気がして...",
      "title": "女性の皆さんは、自分の「体の数」をどれくらい気にしていますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在这之前，我要说的是，我并没有对任何人提出任何道德上的判断。\n对任何人进行某种判断。只是，最近，我一直在思考我自己的身体状况，以及社会对女性的看法。\n思考我自己的身体状况，以及感觉社会对女性的要求似乎与男性不同。\n在涉及到我们有多少人的时候，社会对女性的标准与男性不同。",
      "title": "女士们，你们对自己的 \"身价 \"到底有多少关注？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在這之前，我要說的是，我並沒有對任何人提出任何道德上的判斷。\n對任何人進行某種判斷。只是，最近，我一直在思考我自己的身體狀況，以及社會對女性的看法。\n思考我自己的身體狀況，以及感覺社會對女性的要求似乎與男性不同。\n在涉及到我們有多少人的時候，社會對女性的標準與男性不同。",
      "title": "女士們，你們對自己的 \"身價 \"到底有多少關注？"
    }
  ]
}