{
  "author": "any-mystic",
  "original_created_utc": 1653947629,
  "title": "Unable to make any decisions. Feels like I need someone to manage my life for me. How should I tackle this situation?",
  "created_utc": 1653984860,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;(30M).&lt;/p&gt;\n\n&lt;p&gt;I lack motivation to do most of the things. I am a software engineer who is pretty good at his job so I have gotten myself in a position of responsibility with a good salary.&lt;/p&gt;\n\n&lt;p&gt;Problem being, I am unable to do most normal things. I feel like I desperately need handholding to do even minor things like Getting an LPG connection, getting my bike serviced.. etc.. I postpone it for later. To be honest it feels if someone could just stand and order me around on what needs to be done I&amp;#39;ll probably do it.&lt;/p&gt;\n\n&lt;p&gt;But when push comes to shove, I am actually able to do these things ( that&amp;#39;s how I am able to proceed with my life ). But this pushes me into a loop where I am always working on the edge. This leads to extreme stress.&lt;/p&gt;\n\n&lt;p&gt;Also, I end up spending a lot of time on reddit/playing games when I should rather spend my time elsewhere.&lt;/p&gt;\n\n&lt;p&gt;All of this may sound stupid, but I don&amp;#39;t know  how to resolve this situation.&lt;/p&gt;\n\n&lt;p&gt;Any resource, recommendation etc is much appreciated.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/NoStupidQuestions/comments/v1aw43/unable_to_make_any_decisions_feels_like_i_need/",
  "subreddit": "NoStupidQuestions",
  "id": "v1aw43",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "(30M).\n\nI lack motivation to do most of the things. I am a software engineer who is\npretty good at his job so I have gotten myself in a position of responsibility\nwith a good salary.\n\nProblem being, I am unable to do most normal things. I feel like I desperately\nneed handholding to do even minor…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "(30M).\n\nほとんどのことに意欲がわかない。私はソフトウェアエンジニアで\n私はソフトウェアエンジニアで、仕事がかなりできるため、責任ある立場で、それなりの給料をもらっている。\nています。\n\n問題は、私はほとんどの普通のことができないことです。些細なことでも\n些細なことでも手を貸してほしい。",
      "title": "何も決断できない。誰かに自分の人生を管理してもらわないといけないと感じている。このような場合、どのように対処したらよいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "(30M).\n\n我缺乏动力去做大部分的事情。我是一名软件工程师，在工作上相当出色\n我是一名软件工程师，在工作上相当出色，所以我已经得到了一个有责任感的职位\n有着不错的薪水。\n\n问题是，我无法做大多数正常的事情。我觉得我极度需要\n我觉得我非常需要别人的帮助来做哪怕是小事...",
      "title": "无法做出任何决定。感觉我需要有人为我管理我的生活。我应该如何处理这种情况？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "(30M).\n\n我缺乏動力去做大部分的事情。我是一名軟件工程師，在工作上相當出色\n我是一名軟件工程師，在工作上相當出色，所以我已經得到了一個有責任感的職位\n有着不錯的薪水。\n\n問題是，我無法做大多數正常的事情。我覺得我極度需要\n我覺得我非常需要別人的幫助來做哪怕是小事...",
      "title": "無法做出任何決定。感覺我需要有人爲我管理我的生活。我應該如何處理這種情況？"
    }
  ]
}