{
  "author": "Su1k0n",
  "original_created_utc": 1653246082,
  "title": "Ate out a stripper yesterday, could I possibly be fine?",
  "created_utc": 1653262408,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;(18M) So yesterday was my 18th birthday, and it had been the plan for over 2 years that me and my squad would all go to a strip club when I turned 18. Got there, everybody from the bouncer to the dancers were extra nice, ordered a bottle of ciroc (this is important for later) and we started talking to the girls. One of the dancers that was sitting with us offered me a private dance, and since it was my birthday, my friends paid for me. Anyways, we got up there, she got naked and started giving me that dance. After 3 or maybe 4 songs, I was getting really handy, and she offered me to eat her out. Now, in a sober state of mind I would obviously never accept this, but I was skiing real fucking hard and the liquor on top of that made it seem like the hottest thing in the world (which, to be fair, she was really fucking hot). So, I get to it, also realised that she was actually into it as well which made me feel even better, and leave the room shortly after she (allegedly) cums. Now, the reason why I think ciroc might be an mvp here. I woke up this morning obviously stressed as fuck, knowing that I just put my whole mouth on some less than unsafe spot. Yet, not a single pimple or iritation to be found. She was probably safe, but my question is: if she wasnt, could it be that drinking so much strong alcohol in such a short period of time (I drank half the bottle in under 4h) would actually sanitize my mouth in a way? I know this is super long winded for no reason but I just wanted to ask wether it was possible or not.&lt;/p&gt;\n\n&lt;p&gt;Tldr: ate out a stripper and I think that drinking a lot of strong alcohol might have sanitized my mouth🥴&lt;/p&gt;\n\n&lt;p&gt;Edit: just confirmed my appointment for screening this thursday, my fault for the beyond far fetched theory I just really didnt wanna accept that I fucked up lmao. The comments made me chuckle, yall stay safe🤣&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 107,
  "permalink": "/r/TooAfraidToAsk/comments/uvhmxe/ate_out_a_stripper_yesterday_could_i_possibly_be/",
  "subreddit": "TooAfraidToAsk",
  "id": "uvhmxe",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "(18M) So yesterday was my 18th birthday, and it had been the plan for over 2\nyears that me and my squad would all go to a strip club when I turned 18. Got\nthere, everybody from the bouncer to the dancers were extra nice, ordered a\nbottle of ciroc (this is important for later) and we started talking…"
}