{
  "author": "Nzwiebach",
  "the_new_excerpt": "I searched through Peter Schiff’s entire history for every time he posted an\norigional tweet targeting bitcoin and no others. The criteria was that it could\nnot contain an @, it had to be an origional tweet, it had to call for the\nfailure of bitcoin in some fashion. The content could not be about…",
  "original_created_utc": 1616874813,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我搜索了彼得-希夫的整个历史，每一次他发布了一个\n针对比特币的原创推文，没有其他。标准是它可以\n不包含@，它必须是一个原始的推特，它必须调用的。\n比特币在某种程度上的失败。内容不可能是关于...",
      "title": "我研究了希夫比特币牛市理论。这是我的发现。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我搜索了彼得-希夫的整個歷史，每一次他發佈了一個\n針對比特幣的原創推文，沒有其他。標準是它可以\n不包含@，它必須是一個原始的推特，它必須調用的。\n比特幣在某種程度上的失敗。內容不可能是關於...",
      "title": "我研究了希夫比特幣牛市理論。這是我的發現。"
    }
  ],
  "title": "I looked into the Schiff Bitcoin bull theory. These are my findings.",
  "created_utc": 1616909669,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I searched through Peter Schiff’s entire history for every time he posted an origional tweet targeting bitcoin and no others. The criteria was that it could not contain an @, it had to be an origional tweet, it had to call for the failure of bitcoin in some fashion. The content could not be about alternate characters such as GameStop investors or Tesla Buyers, for example. </p>\n\n<p>There are only a TOTAL of 30 of these origional tweets. The past 10 days he has posted at least one origional anti-bitcoin tweet every day. I excluded this data for now, as it’s the most he has ever tweeted these origional posts. The last lone standing day Schiff posted about BTC is Feb 20 2021.</p>\n\n<p>Of the twenty tweets I analyzed, I found an average return of 718%. Price was measured from the high of the day, to the current price. The lowest return tweet was 20 Feb 2021 with negative 3%. The highest return was his second on  11 Aug 2016 at 9,325%. </p>\n\n<p>If an investor had bought $1000 of Bitcoin for every one of his original tweets, their cost would be $20,000. The value of that sum today is $160,370.</p>\n\n<p>Not only are the returns great, but only 6 tweets have experience a lower price than their initial cost basis. The largest dip would have been 63% due to the covid deflationary crash. The second lowest was in 2019 of a downside on his fourth tweet of 22%. Talk about low volatility to the downside!</p>\n\n<p>Counter HODL Peter Schiff may be the greatest play of your life. What happens following the last 10 days he’s tried to call a top? Did you buy?</p>\n</div><!-- SC_ON -->",
  "score": 223,
  "permalink": "/r/Bitcoin/comments/mel92p/i_looked_into_the_schiff_bitcoin_bull_theory/",
  "subreddit": "Bitcoin",
  "id": "mel92p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357133935
}