{
  "author": "helpamonkpls",
  "original_created_utc": 1659123418,
  "title": "Robinhood steals from the poor and gives to the rich",
  "created_utc": 1659163584,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Robinhood, the app, quite literally takes from the poor and gives to the rich.&lt;/p&gt;\n\n&lt;p&gt;In case you are too young to know the story of Robin Hood, it&amp;#39;s the story of a man who stole from the rich and gave to the poor.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s tragically funny, honestly. Their app name is Robin Hood and they screw you, the retail investor, to fill the bags of hedge funds.&lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re not sure what I&amp;#39;m talking about;&lt;/p&gt;\n\n&lt;p&gt;Robinhood collects trade data and sells to hedge funds, who use high-frequency trading to buy positions according to YOUR (and other&amp;#39;s) data and then sell it after it spikes.&lt;/p&gt;\n\n&lt;p&gt;So say you buy some bitcoin on Robinhood and coincidentally 1000&amp;#39;s of others are buying bitcoin too in that exact same moment, the hedgefund servers receive this data from Robinhood and instantly buys bitcoin BEFORE your order goes through and as your orders go through and the price spikes because of the volume, creating momentum, the hedge funds will sell the orders again, dumping the price. This happens CONSTANTLY. As in real-time constantly.&lt;/p&gt;\n\n&lt;p&gt;This is not some conspiracy either, they&amp;#39;ve faced civil suits over the practice. It&amp;#39;s free because you are the product.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 335,
  "permalink": "/r/CryptoCurrency/comments/wbdpcf/robinhood_steals_from_the_poor_and_gives_to_the/",
  "subreddit": "CryptoCurrency",
  "id": "wbdpcf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Robinhood, the app, quite literally takes from the poor and gives to the rich.\n\nIn case you are too young to know the story of Robin Hood, it's the story of a\nman who stole from the rich and gave to the poor.\n\nIt's tragically funny, honestly. Their app name is Robin Hood and they screw\nyou, the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Robinhoodというアプリは、まさに文字通り、貧しい者から奪い、富める者に与えるものです。\n\nロビン・フッドの物語をご存じない方のために説明しますと\n金持ちから盗んで、貧乏人に与えた男の話です。\n\n正直言って、悲劇的なほど面白いです。彼らのアプリの名前はロビン・フッドで、彼らはねじ込みます。\nあなた、その...",
      "title": "ロビンフッドは貧乏人から盗んで金持ちに与える"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Robinhood这个应用程序，从字面上看是取之于贫、用之于富。\n\n如果你太年轻，不知道罗宾汉的故事，它是一个关于\n他从富人那里偷东西，把钱给穷人。\n\n说实话，这很悲惨，很有趣。他们的应用程序的名字是罗宾汉，他们拧\n你，...",
      "title": "罗宾逊从穷人那里偷来的钱，给了富人。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Robinhood這個應用程序，從字面上看是取之於貧、用之於富。\n\n如果你太年輕，不知道羅賓漢的故事，它是一個關於\n他從富人那裏偷東西，把錢給窮人。\n\n說實話，這很悲慘，很有趣。他們的應用程序的名字是羅賓漢，他們擰\n你，...",
      "title": "羅賓遜從窮人那裏偷來的錢，給了富人。"
    }
  ]
}