{
  "author": "thedudeabides80",
  "original_created_utc": 1633115056,
  "title": "If you’re ever having a bad day think about the bear that got liquidated today to the tune of $9.7 Million",
  "created_utc": 1633124067,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Imagine being sat at dinner and having a lovely conversation with your partner. Maybe the kids are chatting about school and telling you about their day. Then there’s a lull in the conversation as your wife goes to get pudding. I’ll just check the charts you think… I can’t remember the stop-loss on my multi-million dollar position… wait a minute…. What’s this giant green FUCKING DILDO DOING ON MY SCREEN! The room spins, your stomach knots… ‘Daddy?! Daddy are you ok?!’ you hear distantly… you whisper quietly as you stand on unsteady legs to leave the table… no Timmy, no I’m not, and Christmas is cancelled this year. You stare out the window at the Lambo that’s about to be repossessed as a tear slowly trickles down your cheek. Poor rekt bear.</p>\n</div><!-- SC_ON -->",
  "score": 194,
  "permalink": "/r/CryptoCurrency/comments/pzerug/if_youre_ever_having_a_bad_day_think_about_the/",
  "subreddit": "CryptoCurrency",
  "id": "pzerug",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Imagine being sat at dinner and having a lovely conversation with your partner.\nMaybe the kids are chatting about school and telling you about their day. Then\nthere’s a lull in the conversation as your wife goes to get pudding. I’ll just\ncheck the charts you think… I can’t remember the stop-loss on…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "夕食の席で、パートナーと素敵な会話をしているところを想像してみてください。\n子供たちが学校の話をしているかもしれないし、自分の一日を話しているかもしれない。そして\n奥さんがプリンを取りに行くと、会話が途切れてしまいます。私はただ\nチャートをチェックしてみようかな...ストップロスを覚えていないな...。",
      "title": "もしあなたが嫌なことがあったら、今日清算された970万ドルのクマのことを考えてみてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "想象一下，当你坐在晚餐时，与你的伴侣进行愉快的交谈。\n也许孩子们在聊学校的事情，并告诉你他们的一天。然后\n当你的妻子去拿布丁时，谈话出现了停顿。我只是\n检查一下图表，你想......我不记得止损是在......。",
      "title": "如果你有一天心情不好，想想今天被清算的那只熊，价值970万美元。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "想象一下，當你坐在晚餐時，與你的伴侶進行愉快的交談。\n也許孩子們在聊學校的事情，並告訴你他們的一天。然後\n當你的妻子去拿布丁時，談話出現了停頓。我只是\n檢查一下圖表，你想......我不記得止損是在......。",
      "title": "如果你有一天心情不好，想想今天被清算的那隻熊，價值970萬美元。"
    }
  ]
}