{
  "author": "ArthurSalim",
  "original_created_utc": 1640531361,
  "title": "The History of How Bitcoin made an individual ungovernable",
  "created_utc": 1640579848,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Picture this, it was the 2015s, internet was starting to get fast, computers were starting to get truly smart. And bitcoin was starting to become well... bitcoin actually.&lt;/p&gt;\n\n&lt;p&gt;However as some early adopter were starting to pay attention to the cryptocurrency they quickly realized than more than a value reserve or a trustworthy currency, crypto could be used to avoid goverment restrictions and to survive lawsuits by shady individuals. The first of wich was a Brazilian youtuber names Daniel Fraga.&lt;/p&gt;\n\n&lt;p&gt;Daniel Fraga career began quite small, he was an anarchocapitalist youtuber with a camera and a confrontational personality with two goals. To get people started into what he tought was the next currency in the name of bitcoin and to denounce goverment corruption and mismanagement.&lt;/p&gt;\n\n&lt;p&gt;Video by video the young ancap began to build an audience, he was one of the first to make portuguese tutorials on how to buy and store bitcoins. And he was also extremely anti state, constantly making videos about corruption scandals, how to avoid taxation and actively calling Brazilian IRS officials and politicians &amp;quot;thieves and robbers&amp;quot; for their role both in seizing people&amp;#39;s assets as well as their participation in corruption scandals.&lt;/p&gt;\n\n&lt;p&gt;It didnt take long for these people to notice the now sizeable videos agaisnt them, videos in wich even exposed politicians about their mishandling.&lt;/p&gt;\n\n&lt;p&gt;Angry about being called out by a guy who was just a youtuber back in the time where youtubers werent even seen as a professional, these politicians and IRS agents began to fight back. They began to file multiple slapsuits agaisnt the youtuber, demanding that he would take down his videos and pay back for his &amp;quot;slanders&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Ever an ANCAP, Mr Fraga refused to even receive the police officers carrying his court summon. Telling them to shove the lawsuit on his backyard and leave.\nThe man even refused to show up in court, not acknowledging the state justice authority in a case that he saw was an attempt by authorities to silence him.&lt;/p&gt;\n\n&lt;p&gt;Without defence Brazil courts began to award the ones filing lawsuits agaisnt him. 2 IRS workers wered awarded thousands of USD in compensation, and a politician was even awarded 400k USD in &amp;quot;damages&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;And this would have been it for the man, he would have been bankrupted by the state and forced to take his video down.\nThat is...if bitcoin wasnt a thing.&lt;/p&gt;\n\n&lt;p&gt;Rather, Mr Fraga had a brilliant idea, rather than fatten the pocket lines of politicians he decided to gamble it all. He sold every single one of his assets, his house, cars, personal belongings and dumped all into BTC.&lt;/p&gt;\n\n&lt;p&gt;And then the absolute chad of a man, made a last youtube video, mocking the judge and daring him to find a way to seize his BTC wallet.&lt;/p&gt;\n\n&lt;p&gt;To his credit the judges and lawyers tried, they searched up and down for any seizable asset, they visited dozens of addresses and went after anything he could ever own. And after years searching they found absolutely nothing.&lt;/p&gt;\n\n&lt;p&gt;Finally without finding a single cent (well they did find around 200USD on a google account that was being used to pay for some really old process for google), the judge and lawyers gave up. They proclaimed the debt could not be payed and abandoned the search.&lt;/p&gt;\n\n&lt;p&gt;Daniel Fraga then dissapeared, vanished from public view with his bitcoins still stored in his wallet. And was never seen again.&lt;/p&gt;\n\n&lt;p&gt;Small updates on his youtube channel (such as a link of him promoting BCH) show that he is still alive. But for the man who had won thr battle agaisnt an entire state, it seems all he wished for was to rest in his (presumably insanely large) wealth.&lt;/p&gt;\n\n&lt;p&gt;And thus end the story of how BTC allowed a man to stand up to politicians, judges, lawyers and police officers. His reasons of his own volition, but his story filled with an insane tale of risk taking and protesting.&lt;/p&gt;\n\n&lt;p&gt;I tought this was an important tale to tell, for since it happend in Brazil, very few know about it. And that it comes to show how Bitcoin can help individuals to stand up to the state and repression.&lt;/p&gt;\n\n&lt;p&gt;I do not know if Mr Fraga reasons were correct, or if what he did was right. But i admire his dedication to a cause to the point of gambling his life on the promess of crypto, back in the day where most still tought crypto was a pyramid scheme.&lt;/p&gt;\n\n&lt;p&gt;As a law student myself its still a tale that fascinates me. How one guy managed to defeat the state.&lt;/p&gt;\n\n&lt;p&gt;Sources: (sadly in portuguese, i wish i could get you guys good english sources but i cant :( )&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://cointimes.com.br/daniel-fraga-pioneiro-do-bitcoin-divulga-novo-site-e-gera-polemica/amp/\"&gt;https://cointimes.com.br/daniel-fraga-pioneiro-do-bitcoin-divulga-novo-site-e-gera-polemica/amp/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://portaldobitcoin.uol.com.br/pioneiro-do-bitcoin-daniel-fraga-da-sinal-de-vida-no-youtube/\"&gt;https://portaldobitcoin.uol.com.br/pioneiro-do-bitcoin-daniel-fraga-da-sinal-de-vida-no-youtube/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://portaldobitcoin.uol.com.br/justica-nao-encontra-daniel-fraga-e-arquiva-processo-de-deputada-que-pedia-r-1-milhao/\"&gt;https://portaldobitcoin.uol.com.br/justica-nao-encontra-daniel-fraga-e-arquiva-processo-de-deputada-que-pedia-r-1-milhao/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://portaldobitcoin.uol.com.br/justica-caca-daniel-fraga-o-pioneiro-do-bitcoin-no-brasil-mas-nao-consegue-encontra-lo/\"&gt;https://portaldobitcoin.uol.com.br/justica-caca-daniel-fraga-o-pioneiro-do-bitcoin-no-brasil-mas-nao-consegue-encontra-lo/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;*EDIT: Changed the date text soo its clearer when it happened (around 2015).&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 160,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/6hSwtQlEXzBausrcPKcrJdCGudcN0BzFE71CW3Z1qSc.jpg?auto=webp&amp;s=6539c5ac77bc8e53f5230cde6f8851dad8a99914",
          "width": 1639,
          "height": 809
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/6hSwtQlEXzBausrcPKcrJdCGudcN0BzFE71CW3Z1qSc.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=54cb3701938bb2eb7ee6522796cb0e1472e65923",
            "width": 108,
            "height": 53
          },
          {
            "url": "https://external-preview.redd.it/6hSwtQlEXzBausrcPKcrJdCGudcN0BzFE71CW3Z1qSc.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=9b7202387c747b2d636baeeea33780454aa49567",
            "width": 216,
            "height": 106
          },
          {
            "url": "https://external-preview.redd.it/6hSwtQlEXzBausrcPKcrJdCGudcN0BzFE71CW3Z1qSc.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=1152b31ca347d62af1817b8c6840fd83f83536fe",
            "width": 320,
            "height": 157
          },
          {
            "url": "https://external-preview.redd.it/6hSwtQlEXzBausrcPKcrJdCGudcN0BzFE71CW3Z1qSc.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=1535fa445ab980a0d0ac0e0cc56b950c735a7ec2",
            "width": 640,
            "height": 315
          },
          {
            "url": "https://external-preview.redd.it/6hSwtQlEXzBausrcPKcrJdCGudcN0BzFE71CW3Z1qSc.jpg?width=960&amp;crop=smart&amp;auto=webp&amp;s=ec260142212e951adc2731226ee600bc7b3d69c9",
            "width": 960,
            "height": 473
          },
          {
            "url": "https://external-preview.redd.it/6hSwtQlEXzBausrcPKcrJdCGudcN0BzFE71CW3Z1qSc.jpg?width=1080&amp;crop=smart&amp;auto=webp&amp;s=6c36adfe069475735fcbe24022480c5a20ed0811",
            "width": 1080,
            "height": 533
          }
        ],
        "variants": {},
        "id": "hlkWf2rDSFU3rqo9HCWUWN6IqUkCgafCx-XffY_wM9o"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/Bitcoin/comments/royp5i/the_history_of_how_bitcoin_made_an_individual/",
  "subreddit": "Bitcoin",
  "id": "royp5i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Picture this, it was the 2015s, internet was starting to get fast, computers\nwere starting to get truly smart. And bitcoin was starting to become well...\nbitcoin actually.\n\nHowever as some early adopter were starting to pay attention to the\ncryptocurrency they quickly realized than more than a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2015年代、インターネットが高速化し、コンピュータが普及し始めた頃です。\n本当に賢くなり始めていたのです。そしてビットコインが普及し始め...\nビットコインになりつつありました。\n\nしかし、一部のアーリーアダプターは、このビットコインに注目し始めていました。\n暗号通貨は、その名の通り、\"暗号 \"なのです。",
      "title": "ビットコインが個人を無統制にした歴史"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "想象一下，那是2015年代，互联网开始变得快速，计算机\n开始变得真正智能。而比特币也开始变得......。\n实际上是比特币。\n\n然而，当一些早期采用者开始关注这个\n加密货币，他们很快就意识到，比起一个...",
      "title": "比特币如何让一个人变得不可理喻的历史"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "想象一下，那是2015年代，互聯網開始變得快速，計算機\n開始變得真正智能。而比特幣也開始變得......。\n實際上是比特幣。\n\n然而，當一些早期採用者開始關注這個\n加密貨幣，他們很快就意識到，比起一個...",
      "title": "比特幣如何讓一個人變得不可理喻的歷史"
    }
  ]
}