{
  "author": "Klaasiker",
  "original_created_utc": 1634556829,
  "title": "New scamming method.",
  "created_utc": 1634571813,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There are scammers out there with a new scam that I&#39;ve already fallen for!</p>\n\n<p>This is how the trick works:</p>\n\n<p>2 very good looking, 21 year old girls, walk into a bar and start some small talk. When you mention that you own cryptocurrencies, they quickly become really attached to you. They then ask you stuff about Cryptosafety and where you keep those things in store. After you finish your drinks, they drive you home to your place and you end up having a nice threesome. But when you wake up the morning after, you find that your wallet has been hacked and emptied.</p>\n\n<p>My Shiba Inu wallet was hacked this way last Monday, Wednesday, Friday and Saturday! Thank goodness there was only 1 to 3 euros in it.</p>\n\n<p>So watch out!</p>\n</div><!-- SC_ON -->",
  "score": 264,
  "permalink": "/r/CryptoCurrency/comments/qaku4f/new_scamming_method/",
  "subreddit": "CryptoCurrency",
  "id": "qaku4f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "There are scammers out there with a new scam that I've already fallen for!\n\nThis is how the trick works:\n\n2 very good looking, 21 year old girls, walk into a bar and start some small\ntalk. When you mention that you own cryptocurrencies, they quickly become really\nattached to you. They then ask you…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "世の中には、私がすでに引っかかってしまった新手の詐欺師がいるのです\n\nその手口はこうだ。\n\n見た目のいい21歳の女の子2人が、バーに入って世間話を始める。\n話す。あなたが暗号通貨を所有していることを話すと、彼女たちはすぐにあなたに夢中になります。\nあなたに夢中になります。そして、彼女たちはあなたに...",
      "title": "新しい詐欺の手法です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有骗子在外面搞了一个新的骗局，我已经上当了!\n\n这个骗局是这样的。\n\n两个非常漂亮的21岁的女孩，走进一家酒吧，开始一些小的谈话。\n谈话。当你提到你拥有加密货币时，她们很快就变得非常\n对你产生好感。然后她们问你...",
      "title": "新的诈骗方法。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有騙子在外面搞了一個新的騙局，我已經上當了!\n\n這個騙局是這樣的。\n\n兩個非常漂亮的21歲的女孩，走進一家酒吧，開始一些小的談話。\n談話。當你提到你擁有加密貨幣時，她們很快就變得非常\n對你產生好感。然後她們問你...",
      "title": "新的詐騙方法。"
    }
  ]
}