{
  "author": "Maxsh",
  "the_new_excerpt": "I WARN YOU THAT THIS WILL BE QUITE THE LONG READ, BUT ONE THAT YOU WILL\nHOPEFULLY THANK ME FOR.\n\nAnother day, another EV play. TSLA and NIO are both examples of EV companies\nthat have capitalized on the gains resulting from being early to the party for\nelectric cars.\n\nAwesome. But there is a whole…",
  "original_created_utc": 1610544767,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我警告你，这将是一个相当长的阅读，但你会\n希望能感谢我。\n\n又是一天，又是一个EV的游戏。TSLA和NIO都是电动汽车公司的例子。\n利用早早参加聚会所带来的收益，以获取更多的利益。\n电动汽车。\n\n厉害啊 但有一个整体...",
      "title": "狮子电器。他们是谁，为什么你会对他们感兴趣？长长的DD帖。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我警告你，這將是一個相當長的閱讀，但你會\n希望能感謝我。\n\n又是一天，又是一個EV的遊戲。TSLA和NIO都是電動汽車公司的例子。\n利用早早參加聚會所帶來的收益，以獲取更多的利益。\n電動汽車。\n\n厲害啊 但有一個整體...",
      "title": "獅子電器。他們是誰，爲什麼你會對他們感興趣？長長的DD帖。"
    }
  ],
  "title": "Lion Electric: Who they are and why they should be of interest to you. Long DD post.",
  "created_utc": 1610615815,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h1>I warn you that this will be quite the long read, but one that you will hopefully thank me for.</h1>\n\n<p>Another day, another EV play. TSLA and NIO are both examples of EV companies that have capitalized on the gains resulting from being early to the party for electric cars.</p>\n\n<p>Awesome. But there is a whole other dimension to the automobile industry other than cars that HAS NOT been electrified yet, and that this company has a first-mover advantage on (just like NIO and TSLA did): <strong>The medium-heavy duty vehicles.</strong></p>\n\n<p>Today, I present you with an opportunity to be early to this party featuring the sleeping giant that is:</p>\n\n<h1>LION ELECTRIC ($NGA)</h1>\n\n<p>It is currently trading under the SPAC ticker $NGA with a merger completion set for the end of Q1. </p>\n\n<p><strong>That’s right, by buying 1 share of $NGA right now, you are effectively buying 1 share of Lion Electric. For anyone who wants to better understand SPACs, I highly recommend a quick search on Investopedia.</strong> </p>\n\n<p>Let me preface this post by saying that <a href=\"https://thelionelectric.com/en\">Lion Electric</a> has been working on their vehicles, battery technology, and charging grids since 2010 and ALREADY HAS VEHICLES ON THE ROAD. So no, they are not some shambolic ponzi scheme of an EV company (looking at you NKLA). In fact, it literally has the <a href=\"https://www.prnewswire.com/news-releases/largest-zero-emission-school-bus-fleet-in-north-america-bolstered-by-10-bus-delivery-from-lion-electric-301194935.html#:%7E:text=The%20Lion%20Electric%20Co.&amp;amp;amp;amp;text=With%20these%20new%20buses%2C%20Twin,school%20buses%20in%20its%20fleet.\">largest fleet of electified school buses</a> on the road in North America as we speak. </p>\n\n<h1><a href=\"https://pages.thelionelectric.com/wp-content/uploads/2020/11/Investor-Presentation_20203011.pdf\">Here is the link to their investor presentation where they are already forecasting a positive EBITDA by the end of 2021. Highly recommend skimming over it, but I will highlight the main points later on in the post for yall anyways.</a></h1>\n\n<h1><em>So why haven&#39;t I heard about this &quot;Lion Electric&quot; company?</em></h1>\n\n<p>Simple answer: it&#39;s a Canadian company located in Quebec. No company outside of America or China can be of interest right? <strong><em>RIGHT????</em></strong> Well, the EV credits and subsidies in Quebec are great, but other than that you are right. The good thing is that it ain&#39;t gonna be Canadian-based much longer. Lion is going to reveal its new U.S. manufacturing facility any day now, rumored to be in <a href=\"https://www.prnewswire.com/news-releases/the-lion-electric-co-to-deliver-michigans-first-11-electric-school-buses-as-part-of-the-volkswagen-mitigation-settlement-300917333.html\">Michigan</a> where it delivered the state&#39;s first ever 100% electric school buses. Lion Electric, in fact, are already <a href=\"https://michigan-company.com/co/the-lion-electric-co-usa-inc\">registered as a business</a> in Michigan. Oh, and it just so happens that the rumored factory location is right in between two Amazon factories, and is not a mere coincidence (see more below on why this is pertinent). Anyhow, their future clearly lies in the United States, and they are uplisting as LEV on the NYSE when the <a href=\"https://www.businesswire.com/news/home/20210104005149/en/Northern-Genesis-Acquisition-Corp.-Announces-Filing-by-The-Lion-Electric-Company-of-a-Preliminary-Registration-Statement-on-SEC-Form-F-4-in-Connection-With-Their-Proposed-Business-Combination\">merger</a> with NGA closes in March, as per the CEO. Seriously, look at how many job listings are posted across America by Lion Electric by clicking <a href=\"https://emploislion.com/en/jobs\">here</a>.</p>\n\n<h1><em>So, why should I care?</em></h1>\n\n<p><strong>Because Jeff Bezos and Joe Biden care.</strong> </p>\n\n<p>News silently broke last week that <strong>AMAZON</strong> has come to an agreement to purchase up to 500 of Lions class-6 and class-8 delivery trucks per year from 2021-2025 (or up to 2500 over 5 years). Emphasis on &#39;silently&#39; because this company, unlike many, lets their results do the talking rather than a slimy PR team. Oh yeah, I almost forgot to mention that Amazon has the option to purchase at least <strong>2500 trucks per year (conservative number), or 1.1b worth</strong> for the five years following 2025, with a possibility of acquiring up to <a href=\"https://stnonline.com/news/school-bus-production-to-benefit-from-amazon-agreement-lion-electric/\">15.8% of the company</a>. </p>\n\n<p><strong>Yup. Amazon are in bed with Lion Electric, and you should be too.</strong> </p>\n\n<p>And, before anyone asks, the Tesla semi-truck serves entirely different purposes. No point in comparing apples to oranges. Tesla&#39;s truck is specialized for a single purpose: long distance delivery from warehouse to retail. <strong>The Lion-8 and Lion-6 delivery trucks are much more versatile, will be used by Amazon to deliver between Amazon&#39;s facilities, and most importantly they are ready for MASS SCALE PRODUCTION</strong>. So, no, they are not competing against the Tesla semi and will fill different voids in the market. <a href=\"https://imgur.com/nJiXzp8\">See here how diversified their truck lineup really is.</a></p>\n\n<h1><em>And what about Joe Biden?</em></h1>\n\n<p><strong>Sleepy Joe and his Clean Energy Plan have vowed to <a href=\"https://thenextweb.com/shift/2020/11/14/what-bidens-environmental-plans-mean-for-electric-vehicles-syndication/\">electrify 500,000 school buses</a> over the next 4 years</strong></p>\n\n<p>NO COMPANY better positioned to take a huge piece of that pie than Lion Electric. If that seems like a stretch to you, consider this: the CEO of Lion, Marc Bedard, will be speaking at a virtual event on the future of E-mobility this Wednesday (Jan 13), <a href=\"https://my.demio.com/ref/vFksZ11nZGvHsaxG\">where the Co-chair of Biden&#39;s Infrastructure Committee will be in attendance</a>. Their client from Twin Rivers Unified School District went as far as labelling Lion&#39;s electric buses as the <strong>[Rolls Royce and Tesla of school buses]</strong>(<a href=\"https://www.youtube.com/watch?v=StpnGrItO4E&amp;t=45s\">https://www.youtube.com/watch?v=StpnGrItO4E&amp;t=45s</a>). </p>\n\n<p>I’m sure many of you will be aware of the merger completed today with Proterra, another electric bus manufacturer. Awesome right? <a href=\"https://www.sec.gov/Archives/edgar/data/1820630/000121390021001584/ea133141ex99-2_arclight.htm?fbclid=IwAR0X17En3iZX-fZhuNAneJG2lDvOX_pT-OcKlXVbKWmnAMFtuNbUsrqA4M0\">A real shame that, in their investors presentation, they did not compare their revenue projections to Lion&#39;s past the year 2021, as they would&#39;ve admitted to being second best.</a> </p>\n\n<p><strong>Proterra are also exclusively a bus play, while Lion expects nearly 90% of its revenue by 2024 to be from trucks. In fact, Lion&#39;s revenue from their trucks ALONE in 2024 is projected to trump Proterra&#39;s entire revenue in 2025.</strong></p>\n\n<p>Anyhow, none of these companies have anywhere near the capacity to electrify 25% of the American school bus fleet by themselves in 4 years. So I assure you that Lion will be providing buses to Biden over the next 4 years, as will Proterra probably, since there are only 3 players that are READY in the industry to be in on this.</p>\n\n<h1><em>Why should I be buying NOW?</em></h1>\n\n<p><strong>Because today may very well be the last chance to get in $NGA under 30$.</strong></p>\n\n<p>Jim Cramer is inviting Marc (the CEO) onto <strong>Mad Money</strong> <a href=\"https://i.redd.it/ucl54g5avaa61.jpg\">TODAY most likely</a> after it was initially scheduled last week, but the events in Washington forced a postponement. A blessing in disguise for everyone really, and a final chance to get in before this it takes off. NGA is still trading at a measly 1B valuation, with Amazon ALONE forecasted to purchase more than 1b worth of trucks per year come 2025. Marc is going to pump Lion to the best of abilities on Mad Money, and Cramer is going to eat all of it up, as this company is the real deal. </p>\n\n<p><strong>How do I know $NGA will get pumped so hard?</strong> The CEO of Lion featured on a <a href=\"https://www.fm93.com/audio/361623/marc-bedard-pdg-de-lion-amazon-dispose-a-acheter-des-camions-du-producteur-quebecois?fbclid=IwAR1N4Kr0eX-nLjr2-VThUCUVcGIwRlL0ZpC7Abpic7fQY7In4BbJqz7Y7jE\">local news podcast</a> last week and boasted about the Amazon deal as well as their advantage over competition in electrifying buses and trucks, <strong>comparing Lion to Tesla in the process</strong>. Unfortunately, he said all of this in French, which I&#39;m sure quite a few of you won&#39;t understand. But once he regurgitates it all in English to Jim Cramer, the significant deal with Amazon and its similarities to Tesla in its infancy will wreak havoc in the market. </p>\n\n<p><strong>Oh yeah, and, by the way, the last time Cramer hosted a CEO from an up and coming EV merger acquisition (CIIC), that stock went from 21$-37$ in the two following trading sessions.</strong></p>\n\n<h1><em>But why should I pick Lion Electric over all the other EV stocks that get spammed in here?</em></h1>\n\n<p><strong>Because Lion Electric offers much more than just prototypes, ideas, and false hopes</strong></p>\n\n<p>· There are currently 7 different <a href=\"https://imgur.com/L1cu6oS\">trucks and buses</a> <strong>available for purchase</strong></p>\n\n<p>· They already have <strong>300+ vehicles on the road</strong> today with over \n  6mil miles between them </p>\n\n<p>· Multi-year deal agreement for <strong>Amazon</strong> to purchase up to \n  2500 vehicles (Lion6 and Lion8) 2021-2025, with even bigger \n  and more lucrative opportunities afterwards</p>\n\n<p>· <strong>CN (huge Canadian transporter)</strong> recently Purchased 50 \n  trucks - with a chance to increase size of order later</p>\n\n<p>· <strong>Government-backed</strong>: <a href=\"https://imgur.com/xoJ9Kze\">Canada&#39;s prime minister Justin \n  Trudeau supports the company</a>, \n  while nationalized companies like Hydro Quebec and SAQ have \n  purchase agreements in place that provide a strong foundation \n  for Lion&#39;s business</p>\n\n<p>· <strong>Produce their own batteries:</strong> on top of already having suppliers for their batteries, Lion is \n  building a facility to and immunize themselves against potential shortages as they upscale \n  production, set to be completed in 2022</p>\n\n<p>· <strong>V2G technology</strong> ready for the batteries, and implemented \n  into their school buses</p>\n\n<p>· Deals with <strong>BMW, ChargePoint, Nuvve, and Romeo Power</strong></p>\n\n<p>· <strong><a href=\"https://imgur.com/dFFTczt\">8 NEW vehicles</a></strong> to be produced between 2021-2022 \n  including: Ambulance, bucket truck, Class 5 and Class 7 trucks</p>\n\n<p>· <a href=\"https://imgur.com/wFbrle5\">USA expansion</a> completed by \n  2022, will give them a <strong>&quot;Made in America&quot;</strong> image</p>\n\n<p>· NKLA <em>obviously</em> had to <a href=\"https://www.cnn.com/2020/12/23/tech/nikola-garbage-truck-%20%0A%20%20canceled/index.html\">scrap their deal on the table with Republic Services</a> to \n  provide them with up to <strong>5000 garbage disposal trucks</strong> just a \n  few weeks ago. Who could possibly fill the void and has a ZERO EMISSION\n  refuse truck ready for purchase? Lion Electric, that&#39;s \n  who. <a href=\"https://www.youtube.com/watch?v=lAsNQwjXDP4\">See the truck in action here.</a></p>\n\n<h1><em>How about their financials??</em></h1>\n\n<h1><a href=\"https://imgur.com/uLp1pf3\">Well, here are their financials and revenue projections</a></h1>\n\n<p>· Projected revenue of <strong>3.6 billion $</strong> by 2024</p>\n\n<p>· <strong>Cash flow positive</strong> in 2023</p>\n\n<p>· <strong>EBITDA positive by end of 2021</strong>, with EBITDA growth of \n  approximately 16% YOY afterwards</p>\n\n<p>· Cost reduction of 50% by 2024 <strong>(better profit margins)</strong></p>\n\n<h1><strong>TL;DR:</strong></h1>\n\n<p>Undervalued EV company tied to Amazon that has product labelled as the &quot;Tesla of school buses&quot;. CEO will appear on Mad Money today most likely, and $NGA will fly past 30$. </p>\n\n<h1><strong>POSITIONS:</strong></h1>\n\n<p><a href=\"https://imgur.com/L4gr51J\">Here.</a> 700 $NGA shares and 1k warrants, with an extra 500 shares in a separate account. Would not recommend options on this one.</p>\n</div><!-- SC_ON -->",
  "score": 49,
  "permalink": "/r/investing/comments/kwghg9/lion_electric_who_they_are_and_why_they_should_be/",
  "subreddit": "investing",
  "id": "kwghg9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706379518
}