{
  "author": "Fightz_",
  "the_new_excerpt": "I've been thinking about strategies to grow stock positions over time and have\nbeen reading about different strategies.\n\nI'm trying to work out the best way to continually invest in my positions over\ntime to ensure that I'm building my positions over time while limiting the\ndownside.\n\nThe two…",
  "original_created_utc": 1608005440,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我一直在考虑随着时间的推移增加股票头寸的策略，并\n一直在读关于不同策略的文章。\n\n我正在努力找出持续投资于我的头寸的最佳方式。\n时间来确保我随着时间的推移建立我的头寸，同时限制\n不利的一面。\n\n两个…",
      "title": "逢低买入还是干脆买入--随着时间的推移建立头寸的策略"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直在考慮隨着時間的推移增加股票頭寸的策略，並\n一直在讀關於不同策略的文章。\n\n我正在努力找出持續投資於我的頭寸的最佳方式。\n時間來確保我隨着時間的推移建立我的頭寸，同時限制\n不利的一面。\n\n兩個…",
      "title": "逢低買入還是乾脆買入--隨着時間的推移建立頭寸的策略"
    }
  ],
  "title": "Buy the dip or just buy - strategies for building a position over time",
  "created_utc": 1608080329,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been thinking about strategies to grow stock positions over time and have been reading about different strategies.</p>\n\n<p>I&#39;m trying to work out the best way to continually invest in my positions over time to ensure that I&#39;m building my positions over time while limiting the downside.</p>\n\n<p>The two strategies that I&#39;m thinking about are; buying the dip (every time a stock hit a negative, add to the position) or, just adding to each position each day irrespective of whether the stock is up or down.</p>\n\n<p>I found this article which put some math behind these strategies - <a href=\"https://theirrelevantinvestor.com/2020/02/24/what-happens-when-you-buy-the-dip/\">https://theirrelevantinvestor.com/2020/02/24/what-happens-when-you-buy-the-dip/</a></p>\n\n<p>I&#39;m still not sure which one suits me best and am interested in hearing how other medium/long term investors do this.</p>\n\n<p>Initially I was going to buy a set amount (let&#39;s just say $20 to each position where I&#39;m down 1.00%) until I&#39;m not down less than 1%). There&#39;s an obvious flaw here, as the position grows the amount ($20) becomes less and less as a percentage and will have less of an effect over time.</p>\n\n<p>What strategy do you use to grow your positions over time and increase the chances of profitability while reducing the chances of making a loss? What rules do you set/stick to?</p>\n</div><!-- SC_ON -->",
  "score": 98,
  "permalink": "/r/investing/comments/kdegdp/buy_the_dip_or_just_buy_strategies_for_building_a/",
  "subreddit": "investing",
  "id": "kdegdp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609260493062
}