{
  "author": "JazzyJayKarr",
  "the_new_excerpt": "Remember, everyone is a genius as long as the prices keep going up. All it takes\nis one whale to liquidate a few million in bitcoin to give us another double\ndigit negative day.\n\nI always know I’m in trouble when I start to throw money at coins I have no idea\nabout just because everything else is up…",
  "original_created_utc": 1618505189,
  "localize": [
    {
      "locale": "ja",
      "title": "このブルランでは、あまり調子に乗らないようにしましょう。",
      "the_new_excerpt": "価格が上昇し続ける限り、誰もが天才であることを忘れないでください。必要なのは\n一人のクジラが数百万ビットコインを清算することで、また2倍以上の価値が生まれます。\n桁のマイナスの日。\n\n私はいつも、全く知らないコインにお金をつぎ込み始めると、大変なことになると思っています。\n他が上がっているからということで...。"
    },
    {
      "locale": "zh",
      "title": "不要在这次牛市中太过嚣张!",
      "the_new_excerpt": "记住，只要价格不断上涨，每个人都是天才。所需要的是\n只要有一只鲸鱼清空了几百万的比特币，就会给我们带来另一个两位数的负数日\n负数的一天。\n\n当我开始把钱扔到我不知道的硬币上时，我总是知道我有麻烦了。\n就因为其他东西都在上涨......"
    },
    {
      "locale": "zh-Hant",
      "title": "不要在這次牛市中太過囂張!",
      "the_new_excerpt": "記住，只要價格不斷上漲，每個人都是天才。所需要的是\n只要有一隻鯨魚清空了幾百萬的比特幣，就會給我們帶來另一個兩位數的負數日\n負數的一天。\n\n當我開始把錢扔到我不知道的硬幣上時，我總是知道我有麻煩了。\n就因爲其他東西都在上漲......"
    }
  ],
  "title": "Don’t get too cocky in this bull run!",
  "created_utc": 1618551109,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Remember, everyone is a genius as long as the prices keep going up. All it takes is one whale to liquidate a few million in bitcoin to give us another double digit negative day. </p>\n\n<p>I always know I’m in trouble when I start to throw money at coins I have no idea about just because everything else is up 10%, this coin should go up too. </p>\n\n<p>With that being said, just a few words of advice. </p>\n\n<p>-Don’t go all in on a single coin. Diversify. \n-Move profits to a stable coin that gives good APY\n-Always have money available for buying dips. \n-If a coin is mooning, sell half your position and hold the other half. \n-Be smart and don’t FOMO. Have set goals in mind before opening a position. \n-Watch out for phishing scams! They are ramping up a lot this week! </p>\n\n<p>Happy crypto trading people! Let’s continue building our portfolios!</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/CryptoCurrency/comments/mriot3/dont_get_too_cocky_in_this_bull_run/",
  "subreddit": "CryptoCurrency",
  "id": "mriot3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171517795
}