{
  "author": "AceAdversary",
  "the_new_excerpt": "*This is NOT Financial advice. This is strictly an opinion based post*\n\nTLDR, post-GME, WSB became a pack of brainless wolves who hunt down penny stocks\nand spam the yahoo conversations with the same tired \"LeT's tAkE tHiS sToCk tO\n100!!11!!\"\n\nThe group retardation is exponential when you also hear…",
  "original_created_utc": 1613069262,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "*这不是财务建议。这完全是一个基于意见的帖子*。\n\nTLDR，GME之后，WSB成了一群追杀仙股的无脑狼。\n和垃圾邮件的雅虎对话与相同的累累 \"LeT的TakE他的StoCk到\"。\n100!!11!!\"\n\n群体弱智是指数级的，当你也听到...",
      "title": "SNDL和对所有细价股期货的警告，GME炒作后。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "*這不是財務建議。這完全是一個基於意見的帖子*。\n\nTLDR，GME之後，WSB成了一羣追殺仙股的無腦狼。\n和垃圾郵件的雅虎對話與相同的累累 \"LeT的TakE他的StoCk到\"。\n100!!11!!\"\n\n羣體弱智是指數級的，當你也聽到...",
      "title": "SNDL和對所有細價股期貨的警告，GME炒作後。"
    }
  ],
  "title": "SNDL and a Warning to all Penny Stocks Futures, post GME hype",
  "created_utc": 1613147728,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>*This is NOT Financial advice. This is strictly an opinion based post*  </p>\n\n<p>TLDR, post-GME, WSB became a pack of brainless wolves who hunt down penny stocks and spam the yahoo conversations with the same tired &quot;LeT&#39;s tAkE tHiS sToCk tO 100!!11!!&quot;  </p>\n\n<p>The group retardation is exponential when you also hear shit like &quot;I&#39;m down 100k but w/e we&#39;re still going to the moon&quot;. Not only retarded, but gluttons for punishment. It&#39;s as if losing money somehow temporarily &quot;boosts&quot; your group think morale before you reality sets in and you realize there&#39;s no way back out.   </p>\n\n<p>Do you even know how a company is valuated? You can artificially pump all you want, it doesn&#39;t actually MAKE the company worth what you&#39;ve inflated it to. I can&#39;t believe I have to explain this, but for serious investors in this who have done their DD, would project to sell at a set point (if they&#39;re risk averse). Anything beyond that point is pure volatility. a stock like SNDL would NEVER organically hit $100 with the current state of their business. Even with you retards pumping it up artificially, it would never hit $100 anyway because any reasonable person would start dumping once they see the kind of manipulation is at play. Case and point, the events of SNDL this fucking morning. Do you still think it&#39;ll go to $100?   </p>\n\n<p>I used to take the word &quot;retard&quot; being thrown around here in jest; but now I&#39;m pretty convinced that the folks ( as mentioned in my previous example above) are un-ironically retarded. </p>\n\n<p>Is this going to be the new thing now? Every Penny stock going to be pumped and dumped? You realize by doing this, you&#39;re no fucking better than the hedge funds you purportedly hate. You&#39;re acting as a hive mind to inflate then dump. This is why I think post GME, WSB has and will continue to decline unless something is done about this. </p>\n\n<p>So, for those actually looking to invest wisely here, if you ever see a penny stock being posted with no DD or futures to back it up, do yourself a favour and avoid the risk. Yes, you can probably get real lucky and ride the short term wave then dump, but if you&#39;re wanting to be a SERIOUS investor, just ignore the bullshit posted here.   </p>\n\n<p>Making money is fun until you lose it all.  </p>\n\n<p>On a more sober note, SNDL&#39;s futures are somewhat hopeful (my personal opinion) based on some POTENTIAL acquisitions, so I will be sticking around for a little bit. Am I taking a risk? Yes. This is still a speculative stock, and fortunately I don&#39;t gamble away a mortgage for something like this.</p>\n</div><!-- SC_ON -->",
  "score": 1360,
  "permalink": "/r/wallstreetbets/comments/lhrirw/sndl_and_a_warning_to_all_penny_stocks_futures/",
  "subreddit": "wallstreetbets",
  "id": "lhrirw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728627473
}