{
  "author": "InevitableCriticism",
  "original_created_utc": 1658031478,
  "title": "I once dated a guy who needed to “pop his penis” before he could finish. Is this normal?",
  "created_utc": 1658039171,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This got removed from &lt;a href=\"/r/askmen\"&gt;r/askmen&lt;/a&gt;. So, I’m asking here. He would have to stop before he came and push down on his erect penis and it made a loud “pop” sound - like cracking your knuckles - and then he was able to finish. Is that normal? I’ve never heard of that before. It looked painful to me. But according to him, it was the only way.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 154,
  "permalink": "/r/NoStupidQuestions/comments/w0yrd0/i_once_dated_a_guy_who_needed_to_pop_his_penis/",
  "subreddit": "NoStupidQuestions",
  "id": "w0yrd0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "This got removed from r/askmen [/r/askmen]. So, I’m asking here. He would have\nto stop before he came and push down on his erect penis and it made a loud “pop”\nsound - like cracking your knuckles - and then he was able to finish. Is that\nnormal? I’ve never heard of that before. It looked painful to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "r/askmen [/r/askmen]から削除されました。だからここで聞いているのです。彼はイク前に\nイク前に止めて、勃起したペニスを押し下げると、大きな「ポン」という音がします。\nという音--拳を砕くような音--をさせてから、フィニッシュすることができたのです。これは\nは普通ですか？今まで聞いたことがありません。痛そうだったのですが・・・。",
      "title": "私はかつて、「ペニスを弾く」ことが必要な男性と付き合ったことがあります。これって普通なんですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这被从r/askmen [/r/askmen]中删除。所以，我在这里问。他将不得不\n他必须在射精前停下来，然后把勃起的阴茎往下压，就会发出 \"啪 \"的一声巨响。\n声音--就像敲击你的指关节--然后他就能完成。这是否\n正常吗？我以前从未听说过这种情况。它看起来很痛苦，以...",
      "title": "我曾经和一个家伙约会，他需要在完成之前 \"弹出他的阴茎\"。这正常吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這被從r/askmen [/r/askmen]中刪除。所以，我在這裏問。他將不得不\n他必須在射精前停下來，然後把勃起的陰莖往下壓，就會發出 \"啪 \"的一聲巨響。\n聲音--就像敲擊你的指關節--然後他就能完成。這是否\n正常嗎？我以前從未聽說過這種情況。它看起來很痛苦，以...",
      "title": "我曾經和一個傢伙約會，他需要在完成之前 \"彈出他的陰莖\"。這正常嗎？"
    }
  ]
}