{
  "author": "lanwaker22",
  "original_created_utc": 1643385974,
  "title": "Today, I just bought 2000$ of Bitcoin at $61500.00",
  "created_utc": 1643395464,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Beginning of november last year, I had the brillant idea of enrolling my mother into crypto. Besides all the warnings from /cc subs, I&amp;#39;ve decided that my mother need&amp;#39;s to be part of this crazy FOMO, because, well I was up high in the GREEN and it was impossible to stop that train. &amp;quot;Don&amp;#39;t worry mom, I&amp;#39;ll put a sell order, you will never lose your investment and I&amp;#39;ll keep your Sats in my wallet, bla bla bla&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;Winter came and as you know, prices keep falling and falling.. I was getting worried, not for my personnal stash, but for my dear fragile mom. What if she decided to check the price today? &amp;quot;Nah, she will not look, she never look&amp;quot; I said to myself... But guilt was hanging over my head. &lt;/p&gt;\n\n&lt;p&gt;Today, I&amp;#39;ve had enough, i&amp;#39;ve pulled the plug. I took a 2000$ personnal loan at 12% interest and transfered the total cash amount to her checking account. &amp;quot;Yeah mom, Bitcoin is down, but I&amp;#39;ve sold it before, hehe!!  Sorry it didn&amp;#39;t went up, here&amp;#39;s your investment. Love you, mom&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;And voilà! 😑                                                                     Follow me for more stupid transactions.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 301,
  "permalink": "/r/CryptoCurrency/comments/seu4gm/today_i_just_bought_2000_of_bitcoin_at_6150000/",
  "subreddit": "CryptoCurrency",
  "id": "seu4gm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Beginning of november last year, I had the brillant idea of enrolling my mother\ninto crypto. Besides all the warnings from /cc subs, I've decided that my mother\nneed's to be part of this crazy FOMO, because, well I was up high in the GREEN\nand it was impossible to stop that train. \"Don't worry mom,…"
}