{
  "author": "Qtredit",
  "original_created_utc": 1637485146,
  "title": "Which coins would still matter in 5 years?",
  "created_utc": 1637509218,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There are hundreds of famous coins right now.\nObviously, in 5 years most of them won&#39;t matter.</p>\n\n<p>I&#39;m sure Bitcoin and Ethereum (and no, I don&#39;t think there&#39;s an Ethereum killer) are here to stay, but which other cryptos will still be relevant in the future? </p>\n\n<ul>\n<li><p>For example, do you think ADA and XRP would last?</p></li>\n<li><p>How about Meme coins such as SHIB or Doge? </p></li>\n<li><p>How about Solana or Matic? Maybe LRC? </p></li>\n</ul>\n\n<p>Many projects have run their course and some have just started.</p>\n\n<p>Will Ethereum&#39;s sharding destroy some of the coin&#39;s future&#39;s? </p>\n\n<p><strong>So who&#39;s here to stay?</strong></p>\n</div><!-- SC_ON -->",
  "score": 225,
  "permalink": "/r/CryptoCurrency/comments/qyr1yf/which_coins_would_still_matter_in_5_years/",
  "subreddit": "CryptoCurrency",
  "id": "qyr1yf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "There are hundreds of famous coins right now. Obviously, in 5 years most of them\nwon't matter.\n\nI'm sure Bitcoin and Ethereum (and no, I don't think there's an Ethereum killer)\nare here to stay, but which other cryptos will still be relevant in the future?\n\n * For example, do you think ADA and XRP…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今、有名なコインは何百種類もあります。明らかに5年後にはそれらのほとんどが\n重要ではないでしょう。\n\n私は、ビットコインとイーサリアム（そして、イーサリアムキラーはいないと思いますが）\nしかし、他のどのような暗号が将来的に重要になるでしょうか？\n\n * 例えば、ADAとXRPは、あなたが考える...",
      "title": "5年後にも重要なコインは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "现在有数百种著名的硬币。显然，在5年内，他们中的大多数\n将不再重要。\n\n我相信比特币和以太坊（不，我不认为有以太坊杀手）会继续存在。\n在这里停留，但还有哪些加密货币在未来仍会有意义？\n\n * 例如，你认为ADA和XRP...",
      "title": "哪些钱币在5年后仍然重要？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "現在有數百種著名的硬幣。顯然，在5年內，他們中的大多數\n將不再重要。\n\n我相信比特幣和以太坊（不，我不認爲有以太坊殺手）會繼續存在。\n在這裏停留，但還有哪些加密貨幣在未來仍會有意義？\n\n * 例如，你認爲ADA和XRP...",
      "title": "哪些錢幣在5年後仍然重要？"
    }
  ]
}