{
  "author": "Dialent",
  "original_created_utc": 1657981453,
  "title": "Following the French Revolution, the other nations of Europe were shocked and outraged by death of Louis XVI, resulting in military intervention. 150 years prior, Charles I of England was similarly executed by his own people, but no foreign intervention occurred. Why were the reactions so different?",
  "created_utc": 1657989828,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Sorry for the poorly worded title, I had trouble getting the whole question in with the character limit. I want to know why the European monarchies reacted so harshly to the French Revolution (resulting in the French Revolutionary Wars), but did not have similar reactions to the English Civil War, which seems to have mostly been met with apathy from what I can tell, with the French and Spanish recognising the new republic in 1653.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/w0hu7n/following_the_french_revolution_the_other_nations/",
  "subreddit": "AskHistorians",
  "id": "w0hu7n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Sorry for the poorly worded title, I had trouble getting the whole question in\nwith the character limit. I want to know why the European monarchies reacted so\nharshly to the French Revolution (resulting in the French Revolutionary Wars),\nbut did not have similar reactions to the English Civil War,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "質問の全体像がつかめず、言葉足らずのタイトルで申し訳ありません\n文字数制限に引っかかってしまいました。ヨーロッパの君主制はなぜあれほどまでに反発したのでしょうか。\nフランス革命に対して、ヨーロッパの君主制はなぜあれほどまでに厳しい反応を示したのか（その結果、フランス革命戦争が起こった）。\nイギリスの内戦では同じような反応をしなかったのか、、、。",
      "title": "フランス革命後、ルイ16世の死にヨーロッパ諸国は衝撃を受け、軍事介入を行った。その150年前、イギリスのチャールズ1世も同じように自国民によって処刑されたが、外国の介入はなかった。なぜ、このように反応が違うのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对不起，我的标题用词不当，我很难把整个问题写进去。\n的字数限制。我想知道为什么欧洲的君主国对法国大革命的反应如此\n对法国大革命（导致法国革命战争）的反应如此激烈。\n但对英国内战却没有类似的反应，...",
      "title": "法国大革命后，欧洲其他国家对路易十六的死亡感到震惊和愤怒，从而进行了军事干预。此前150年，英国的查理一世也同样被自己的人民处决，但没有发生外国干预。为什么反应会如此不同？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對不起，我的標題用詞不當，我很難把整個問題寫進去。\n的字數限制。我想知道爲什麼歐洲的君主國對法國大革命的反應如此\n對法國大革命（導致法國革命戰爭）的反應如此激烈。\n但對英國內戰卻沒有類似的反應，...",
      "title": "法國大革命後，歐洲其他國家對路易十六的死亡感到震驚和憤怒，從而進行了軍事幹預。此前150年，英國的查理一世也同樣被自己的人民處決，但沒有發生外國干預。爲什麼反應會如此不同？"
    }
  ]
}