{
  "author": "FinsT00theleft",
  "original_created_utc": 1652328443,
  "title": "Are prices about to fall off a cliff?",
  "created_utc": 1652344783,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Stock prices are supported by something in the real world - corporate assets and earnings.  Crypto prices are supported entirely by investor (speculator) confidence.   I think a lot of whales and little guys have been massively burned over the last 6 months.  The little guys don&amp;#39;t have money to put in now and have lost their nerve anyway.  The institutional whales are going to be reigned in by their Boards of Directors.  &lt;/p&gt;\n\n&lt;p&gt;I wouldn&amp;#39;t be surprised if prices languish where we are now for a LONG time.  I also wouldn&amp;#39;t be surprised if 90% of cryptos go tits up in the next year, because lets face it, the world doesn&amp;#39;t need 3,000 cryptos, most of which do nothing useful.  And I wouldn&amp;#39;t be surprised if BTC, ETH and the other bigger cryptos lose 80% of their current value because these are investment (or gambling) vehicles unlike any other and we&amp;#39;re in uncharted territory here.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 318,
  "permalink": "/r/CryptoCurrency/comments/unscze/are_prices_about_to_fall_off_a_cliff/",
  "subreddit": "CryptoCurrency",
  "id": "unscze",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Stock prices are supported by something in the real world - corporate assets and\nearnings. Crypto prices are supported entirely by investor (speculator)\nconfidence. I think a lot of whales and little guys have been massively burned\nover the last 6 months. The little guys don't have money to put in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "株価は現実世界の何かに支えられている - 企業資産と\n収益によって支えられています。暗号の価格は、投資家（投機家）の自信によって完全に支えられています。\n信頼感です。多くのクジラと小市民がこの6ヶ月で大火傷を負ったと思います。\nこの6ヶ月の間に チビは入れるお金がない・・・。",
      "title": "価格は崖っぷちになるのか？"
    },
    {
      "locale": "zh",
      "title": "价格是否即将跌落悬崖？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "株価は現実世界の何かに支えられている - 企業資産と\n収益によって支えられています。暗號の価格は、投資家（投機家）の自信によって完全に支えられています。\n信頼感です。多くのクジラと小市民がこの6ヶ月で大火傷を負ったと思います。\nこの6ヶ月の間に チビは入れるお金がない・・・。",
      "title": "價格是否即將跌落懸崖？"
    }
  ]
}