{
  "author": "partymsl",
  "original_created_utc": 1639247532,
  "title": "Today the fear Index is at 16 'extreme fear' one month ago it was at 'extreme greed'. And in one month we will back at extreme greed. That's crypto.",
  "created_utc": 1639273631,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The fear Index just slipped down further to 16 the lowest since September. It&amp;#39;s because investors are getting impatient waiting for a recovery to over 50k. But just one month ago it was at extreme greed as many were euphoric believing at a 100k BTC just this year and some even in just Nov.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s the cycle that always continues no matter what. I&amp;#39;m 100% sure in a month or so we will be back at extreme greed an everyone will forget this days where they calling a 20% drop a crypto winter.&lt;/p&gt;\n\n&lt;p&gt;Also 16 is pretty much the bottom last time in September it also bottomed at about the same range, that&amp;#39;s about as low as it can go no matter what so a jump back up is inevitable.&lt;/p&gt;\n\n&lt;p&gt;No one here should get scared or so just remember what goes down must also go up....&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 162,
  "permalink": "/r/CryptoCurrency/comments/re5qr4/today_the_fear_index_is_at_16_extreme_fear_one/",
  "subreddit": "CryptoCurrency",
  "id": "re5qr4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The fear Index just slipped down further to 16 the lowest since September. It's\nbecause investors are getting impatient waiting for a recovery to over 50k. But\njust one month ago it was at extreme greed as many were euphoric believing at a\n100k BTC just this year and some even in just Nov.\n\nThat's…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "恐怖指数はさらに低下し、9月以降で最低の16となった。これは\n投資家は5万ドル以上への回復を待つことに焦りを感じているからです。しかし\nほんの1ヶ月前までは、多くの人が「このままではダメだ！」と陶酔し、欲が極限に達していました。\n今年中に10万BTC、中には11月中に10万BTCになる人もいます。\n\nそれは...",
      "title": "今日の恐怖指数は16の「極度の恐怖」で、1ヶ月前は「極度の強欲」でした。そして、1ヶ月後には「極度の強欲」に戻っています。それが暗号です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "恐惧指数刚刚进一步下滑到16，是9月以来的最低值。这是因为\n因为投资者对等待恢复到5万以上已经不耐烦了。但是\n就在一个月前，它还处于极端贪婪的状态，因为许多人欣喜若狂地相信在\n100k BTC就在今年，有些人甚至在11月就能实现。\n\n这就是...",
      "title": "今天的恐惧指数是16'极端恐惧'，一个月前是'极端贪婪'。而在一个月后，我们将回到极端贪婪的状态。这就是加密货币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "恐懼指數剛剛進一步下滑到16，是9月以來的最低值。這是因爲\n因爲投資者對等待恢復到5萬以上已經不耐煩了。但是\n就在一個月前，它還處於極端貪婪的狀態，因爲許多人欣喜若狂地相信在\n100k BTC就在今年，有些人甚至在11月就能實現。\n\n這就是...",
      "title": "今天的恐懼指數是16'極端恐懼'，一個月前是'極端貪婪'。而在一個月後，我們將回到極端貪婪的狀態。這就是加密貨幣。"
    }
  ]
}