{
  "author": "ExaltedCustoms",
  "original_created_utc": 1640368770,
  "title": "It’s time to Warren Buffet your Crypto Portfolio.",
  "created_utc": 1640410423,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;(Edit: My post has received a fair amount of questions and certainly some distaste- Which I actually appreciate, but please bare in mind that I am always looking for more information and sometimes speculation towards my picks, meaning they could change as the world around us changes or if you share the details as to why my picks are god awful)  &lt;/p&gt;\n\n&lt;p&gt;Now that we are heading out of purgatory, we can refocus on the longevity of these coins. &lt;/p&gt;\n\n&lt;p&gt;I’m personally putting time aside during this 3 day weekend to thoroughly narrow my goals pertaining to crypto long term. For perspective: I’m 21 and I’m fond of the idea of decentralized currency for the mere sense you don’t have to rely on your nation’s currency to hold value over time &amp;amp; instead a currency you have more faith in, with utility outside of simply holding value. &lt;/p&gt;\n\n&lt;p&gt;Warren Buffet has infamously preached for you to put together a list of 10-20 investments you would make if they were the only investments you’re allowed for your entire life. This is what we need to be doing with crypto ESPECIALLY. &lt;/p&gt;\n\n&lt;p&gt;It’s fun to have a bag in a shitcoin trust me I got to Shib at .0000015 and i love it.&lt;/p&gt;\n\n&lt;p&gt;BUT- It’s time to put together your list of Blue Chip Coins for 20 years down the line. &lt;/p&gt;\n\n&lt;p&gt;My top 5 positions in order:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;AMP&lt;/li&gt;\n&lt;li&gt;CRO&lt;/li&gt;\n&lt;li&gt;ALGO&lt;/li&gt;\n&lt;li&gt;ADA &lt;/li&gt;\n&lt;li&gt;BTC&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 154,
  "permalink": "/r/CryptoCurrency/comments/rnref9/its_time_to_warren_buffet_your_crypto_portfolio/",
  "subreddit": "CryptoCurrency",
  "id": "rnref9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "(Edit: My post has received a fair amount of questions and certainly some\ndistaste- Which I actually appreciate, but please bare in mind that I am always\nlooking for more information and sometimes speculation towards my picks, meaning\nthey could change as the world around us changes or if you share…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "(編集: 私の投稿は、かなりの量の質問と、確かにいくつかの質問を受けました。\nしかし、私はいつでも、このようなことを望んでいることを心に留めておいてください。\nより多くの情報を求め、時には憶測で選んだということです。\n周りの環境の変化や、あなたの意見で変わるかもしれません。",
      "title": "今こそウォーレン・バフェットがあなたの暗号ポートフォリオを構築する時です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "(编辑：我的帖子收到了相当多的问题，当然还有一些\n厌恶--其实我很感激，但请记住，我一直在寻找更多的信息。\n我一直在寻找更多的信息，有时还会对我的选择进行推测，这意味着\n他们可能会随着我们周围世界的变化而改变，或者如果你分享......",
      "title": "是时候让沃伦-巴菲特（Warren Buffet）来管理你的加密货币投资组合了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "(編輯：我的帖子收到了相當多的問題，當然還有一些\n厭惡--其實我很感激，但請記住，我一直在尋找更多的信息。\n我一直在尋找更多的信息，有時還會對我的選擇進行推測，這意味着\n他們可能會隨着我們周圍世界的變化而改變，或者如果你分享......",
      "title": "是時候讓沃倫-巴菲特（Warren Buffet）來管理你的加密貨幣投資組合了。"
    }
  ]
}