{
  "author": "Syscrush",
  "original_created_utc": 1658248256,
  "title": "What's the most massive black hole that could strike the earth without causing any damage?",
  "created_utc": 1658266035,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;When I was in 9th grade in the mid-80&amp;#39;s, my science teacher said that if a black hole with the mass of a mountain were to strike Earth, it would probably just oscillate back and forth inside the Earth for a while before settling at Earth&amp;#39;s center of gravity and that would be it.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve never forgotten this idea - it sounds plausible but as I&amp;#39;ve never heard the claim elsewhere I suspect it is wrong. Is there any basis for this?&lt;/p&gt;\n\n&lt;p&gt;If it is true, then what&amp;#39;s the most massive a black hole could be to pass through the Earth without causing a commotion?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/askscience/comments/w2wxto/whats_the_most_massive_black_hole_that_could/",
  "subreddit": "askscience",
  "id": "w2wxto",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "When I was in 9th grade in the mid-80's, my science teacher said that if a black\nhole with the mass of a mountain were to strike Earth, it would probably just\noscillate back and forth inside the Earth for a while before settling at Earth's\ncenter of gravity and that would be it.\n\nI've never…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "80年代半ば、私が中学3年生のとき、理科の先生が「もし、黒人の人が\n山のような質量のブラックホールが地球に衝突しても、しばらくは地球内部で振動して\nしばらくは地球の中を行ったり来たりして、地球の重心に収まるだろう。\nと言っていました。\n\n私は一度も...",
      "title": "地球に衝突しても被害が出ない最も巨大なブラックホールとは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当我在80年代中期上9年级时，我的科学老师说，如果一个黑人\n我的科学老师说，如果有一个质量像山一样大的黑洞撞击地球，它可能只是\n它可能会在地球内部来回摆动一段时间，然后在地球的重力中心定居下来。\n在地球的引力中心安顿下来，就这样了。\n\n我从来没有...",
      "title": "能够撞击地球而不造成任何损害的最大规模的黑洞是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當我在80年代中期上9年級時，我的科學老師說，如果一個黑人\n我的科學老師說，如果有一個質量像山一樣大的黑洞撞擊地球，它可能只是\n它可能會在地球內部來回擺動一段時間，然後在地球的重力中心定居下來。\n在地球的引力中心安頓下來，就這樣了。\n\n我從來沒有...",
      "title": "能夠撞擊地球而不造成任何損害的最大規模的黑洞是什麼？"
    }
  ]
}