{
  "author": "tabshiftescape",
  "the_new_excerpt": "Today's WSJ has an article regarding high frequency traders using hollow-core\nfiber optic cables to shave milliseconds off their transaction latencies. It's\nbehind a paywall, but if you have an account you can read it here:\n\nhttps://www.wsj.com/articles/high-frequency-traders-push-closer-to-light…",
  "original_created_utc": 1608142822,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "今天的“华尔街日报”有一篇关于使用空芯的高频交易员的文章。\n光纤电缆可将其交易延迟缩短数毫秒。它是\n在付费墙后面，但如果你有账户，可以在这里阅读：\n\nhttps://www.wsj.com/articles/high-frequency-traders-push-closer-to-light…",
      "title": "空芯光缆或：再次提醒个人投资者不应试图与机构投资者竞争"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天的“華爾街日報”有一篇關於使用空芯的高頻交易員的文章。\n光纖電纜可將其交易延遲縮短數毫秒。它是\n在付費牆後面，但如果你有賬戶，可以在這裏閱讀：\n\nhttps://www.wsj.com/articles/high-frequency-traders-push-closer-to-light…",
      "title": "空芯光纜或：再次提醒個人投資者不應試圖與機構投資者競爭"
    }
  ],
  "title": "Hollow-core fiber optic cables or: another reminder that individual investors shouldn't try to compete with institutional investors",
  "created_utc": 1608183306,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Today&#39;s WSJ has an article regarding high frequency traders using hollow-core fiber optic cables to shave milliseconds off their transaction latencies. It&#39;s behind a paywall, but if you have an account you can read it here:</p>\n\n<p><a href=\"https://www.wsj.com/articles/high-frequency-traders-push-closer-to-light-speed-with-cutting-edge-cables-11608028200\">https://www.wsj.com/articles/high-frequency-traders-push-closer-to-light-speed-with-cutting-edge-cables-11608028200</a></p>\n\n<p>If you can&#39;t read the article, the general takeaway is that high frequency trading firms are spending millions of dollars to add 33% faster fiber optic cables to their arsenal of Bloomberg terminals, field programmable gate arrays, and highly optimized arbitrage detection algorithms, shaving off milliseconds from their order execution times. </p>\n\n<p>This most recent addition to the ever-widening gulf between individual and institutional investor illustrates how much the everyday investor&#39;s attempts to time the market or pull out of volatility on top really might as well be a bunch of little leaguers taking the field against the MLB All-Stars. </p>\n\n<p>Now I know most of us aren&#39;t day trading, let alone trading with the frequency that would qualify us as &quot;high-frequency traders,&quot; but this certainly serves as a final nail in the coffin for any aspirations I had in building and running my own algorithmic trading system.</p>\n</div><!-- SC_ON -->",
  "score": 56,
  "permalink": "/r/investing/comments/keela5/hollowcore_fiber_optic_cables_or_another_reminder/",
  "subreddit": "investing",
  "id": "keela5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609260493069
}