{
  "author": "shinyhappypeoplee",
  "original_created_utc": 1647974477,
  "title": "Why don’t adults play more? Why don’t I ever see people over 40 climbing trees or mucking around on childrens pkaygrounds?",
  "created_utc": 1647979785,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m 32(F) and my idea of a good time is arcades, bowling alleys, fun fairs, and anything that really makes me feel like a big kid. I’d prefer to do the above over drinking in a bar. I play Xbox and love both modern and retro games. If I’m walking in the woods and I see a cool tree, I climb it, whether I’m alone or with friends/bf. I like fun silly dates. If I pass an empty playground and I’m with someone, I like swinging on swing sets and spinning on roundabouts til I wanna puke. These are things that bring me joy but I feel like I pretty much never see other people my age, and definitely never see people over 40, doing these things. Why not?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 133,
  "permalink": "/r/NoStupidQuestions/comments/tk9vp0/why_dont_adults_play_more_why_dont_i_ever_see/",
  "subreddit": "NoStupidQuestions",
  "id": "tk9vp0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m 32(F) and my idea of a good time is arcades, bowling alleys, fun fairs, and\nanything that really makes me feel like a big kid. I’d prefer to do the above\nover drinking in a bar. I play Xbox and love both modern and retro games. If I’m\nwalking in the woods and I see a cool tree, I climb it,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "32歳(女)、私の考える楽しい時間とは、アーケード、ボーリング場、ファンフェア、そして\n子供みたいな気分になれるものなら何でもいいんです。上記のようなことをしたい\nバーでお酒を飲みながら Xboxをプレイしていて、最近のゲームもレトロなゲームも大好きです。もし私が\n森を歩いていて、かっこいい木があったら登ってみたり...。",
      "title": "なぜ、大人はもっと遊ばないのか？40歳以上の人が木に登ったり、子供用の公園で遊んだりしているのを見たことがないのはなぜでしょう？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我今年32岁，我对美好时光的想法是拱廊、保龄球馆、游乐场，以及任何真正让我感觉像个大孩子的东西。\n任何能让我感觉像个大孩子的东西。我更愿意做上述事情\n而不是在酒吧里喝酒。我玩Xbox，喜欢现代和复古游戏。如果我\n在树林里散步，看到一棵很酷的树，我会爬上去，...",
      "title": "为什么成年人不多玩呢？为什么我从来没有看到过40岁以上的人爬树或在儿童游乐场里捣乱？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我今年32歲，我對美好時光的想法是拱廊、保齡球館、遊樂場，以及任何真正讓我感覺像個大孩子的東西。\n任何能讓我感覺像個大孩子的東西。我更願意做上述事情\n而不是在酒吧裏喝酒。我玩Xbox，喜歡現代和復古遊戲。如果我\n在樹林裏散步，看到一棵很酷的樹，我會爬上去，...",
      "title": "爲什麼成年人不多玩呢？爲什麼我從來沒有看到過40歲以上的人爬樹或在兒童遊樂場裏搗亂？"
    }
  ]
}