{
  "author": "isaac_horstmeier",
  "original_created_utc": 1627959046,
  "title": "I sort by new, 90% of the time.",
  "created_utc": 1627972247,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>And you should too, helping others was never easier thanks to Moons. </p>\n\n<p>Also, you can be getting awesome info first hand, so you can make better decisions. \nI strongly believe that information changes situations, so if you can have free access to (sometimes) great information, why wouldn’t you do it? And why not be one of the people who help others to make that information visible by commenting or upvoting, so the redditors who don’t sort by new, can also get good information on the long run.\nTake a moment to make someones’s life better, sometime on the coming future.</p>\n</div><!-- SC_ON -->",
  "score": 164,
  "permalink": "/r/CryptoCurrency/comments/owu9im/i_sort_by_new_90_of_the_time/",
  "subreddit": "CryptoCurrency",
  "id": "owu9im",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "And you should too, helping others was never easier thanks to Moons.\n\nAlso, you can be getting awesome info first hand, so you can make better\ndecisions. I strongly believe that information changes situations, so if you can\nhave free access to (sometimes) great information, why wouldn’t you do it?…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Moonsのおかげで他の人を助けることがより簡単になりました。\n\nまた、素晴らしい情報を直接手に入れることができるので、より良い判断をすることができます。\n判断できるようになります。私は情報が状況を変えると強く信じているので、もしあなたが（時には）素晴らしい情報に無料でアクセスできるなら\n情報が状況を変えると強く信じているので、もしあなたが（時には）素晴らしい情報に無料でアクセスできるなら、なぜそれをしないのでしょうか？",
      "title": "私は、90％の確率で、新しい順に並べています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你也应该这样做，由于月球的存在，帮助他人从未如此简单。\n\n此外，你可以获得第一手的精彩信息，所以你可以做出更好的\n决定。我坚信，信息可以改变情况，所以如果你能\n能免费获得（有时）伟大的信息，你为什么不这样做呢？",
      "title": "我在90%的时间里都是按新的来分类。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你也應該這樣做，由於月球的存在，幫助他人從未如此簡單。\n\n此外，你可以獲得第一手的精彩信息，所以你可以做出更好的\n決定。我堅信，信息可以改變情況，所以如果你能\n能免費獲得（有時）偉大的信息，你爲什麼不這樣做呢？",
      "title": "我在90%的時間裏都是按新的來分類。"
    }
  ]
}