{
  "author": "Stray14",
  "the_new_excerpt": "Title basically explains it all. I’ve been In This space for many many years and\nhave learnt that half internet literate people, like myself can easily back\nengineer your username to gather details about you.\n\nThis leads to email phishing attacks, doxing, scripted links being downloaded to\ncomputers…",
  "original_created_utc": 1615935939,
  "localize": [
    {
      "locale": "zh",
      "title": "各位，请不要再参与有关持股、最大损失、最大交易赢利等帖子。你是在把自己变成别人的靶子。",
      "the_new_excerpt": "标题基本说明了一切。我在这个空间里已经呆了很多很多年了，而且。\n已经了解到，像我这样半懂网络的人，很容易背\n工程化你的用户名来收集关于你的细节。\n\n这将导致电子邮件钓鱼攻击、投毒、脚本链接被下载到您的网站。\n电脑..."
    },
    {
      "locale": "zh-Hant",
      "title": "各位，請不要再參與有關持股、最大損失、最大交易贏利等帖子。你是在把自己變成別人的靶子。",
      "the_new_excerpt": "標題基本說明了一切。我在這個空間裏已經呆了很多很多年了，而且。\n已經瞭解到，像我這樣半懂網絡的人，很容易背\n工程化你的用戶名來收集關於你的細節。\n\n這將導致電子郵件釣魚攻擊、投毒、腳本鏈接被下載到您的網站。\n電腦..."
    }
  ],
  "title": "Everybody, Please stop engaging with the posts regarding holdings, largest losses, biggest trade wins etc . YOU ARE MAKING YOURSELF A TARGET TO OTHERS.",
  "created_utc": 1615963642,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Title basically explains it all. I’ve been In This space for many many years and have learnt that half internet literate people, like myself can easily back engineer your username to gather details about you.</p>\n\n<p>This leads to email phishing attacks, doxing, scripted links being downloaded to computers to fuck with copy paste wallet attachments. Sim swaps...</p>\n\n<p>THE LIST GOES ON AND ON AND ON.</p>\n\n<p>Please, for the sake of crypto, your hard earned money, your enthusiasm to towards this amazing arena; stop telling people how much you’ve made, had, hold.</p>\n\n<p>It’s a fully ego driven response that opens you up to bad actors. </p>\n\n<p>This is a public forum where many people lurk, the good, the bad and the ugly.</p>\n\n<p>Stay safe guys, protect your identity and don’t let your ego jump in for a quick comment.</p>\n\n<p>Assume you are always being monitored, it was change the way you interact with this sud and others alike.</p>\n\n<p>Sorry for the lecturing post but it needs to be addressed. </p>\n\n<p>Sadly there will continue to be posts saying that funds were stolen or I was phished.</p>\n\n<p>Scrub details on your Reddit account, setup burner emails etc. Be smart, be reserved and be aware.</p>\n\n<p>Long live crypto and long live a community that protects each other not exploits each other.</p>\n</div><!-- SC_ON -->",
  "score": 386,
  "permalink": "/r/CryptoCurrency/comments/m6lzkm/everybody_please_stop_engaging_with_the_posts/",
  "subreddit": "CryptoCurrency",
  "id": "m6lzkm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147378436
}