{
  "author": "MoiJaimeLesCrepes",
  "original_created_utc": 1657608155,
  "title": "How are boundaries between colors defined? Are they a cultural/linguistic/anthropological phenomenon stricto sensu, or are there biological/neurological bases behind color definition?",
  "created_utc": 1657630389,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A friend and I were arguing about the color of a car. I said it was pink. He said it was purple. I&amp;#39;m not a native speaker of English, so I wondered if that had perhaps something to do with it - perhaps my mother tongue delimited pink and purple differently than English. But asking some Americans, I found out that actually the jury was split. This got me thinking...  &lt;/p&gt;\n\n&lt;p&gt;- Are some color boundaries fuzzier / more ambiguous than others? For instance, yellow might not be as contentious a color as others, but that is just my impression. &lt;/p&gt;\n\n&lt;p&gt;- If some color boundaries are fuzzier than others, is that consistent across languages? For instance, is the boundary between green and blue always fuzzy?&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;- Are there any biological bases for color definitions, anchored perhaps in color perception and processing?  &lt;/p&gt;\n\n&lt;p&gt;I realize that this question straddles many disciplines, so I flaired it with Psychology but it could as well have been linguistic, anthropological etc.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/askscience/comments/vx4mql/how_are_boundaries_between_colors_defined_are/",
  "subreddit": "askscience",
  "id": "vx4mql",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "A friend and I were arguing about the color of a car. I said it was pink. He\nsaid it was purple. I'm not a native speaker of English, so I wondered if that\nhad perhaps something to do with it - perhaps my mother tongue delimited pink\nand purple differently than English. But asking some Americans, I…"
}