{
  "author": "MoiJaimeLesCrepes",
  "original_created_utc": 1657608155,
  "title": "How are boundaries between colors defined? Are they a cultural/linguistic/anthropological phenomenon stricto sensu, or are there biological/neurological bases behind color definition?",
  "created_utc": 1657630389,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A friend and I were arguing about the color of a car. I said it was pink. He said it was purple. I&amp;#39;m not a native speaker of English, so I wondered if that had perhaps something to do with it - perhaps my mother tongue delimited pink and purple differently than English. But asking some Americans, I found out that actually the jury was split. This got me thinking...  &lt;/p&gt;\n\n&lt;p&gt;- Are some color boundaries fuzzier / more ambiguous than others? For instance, yellow might not be as contentious a color as others, but that is just my impression. &lt;/p&gt;\n\n&lt;p&gt;- If some color boundaries are fuzzier than others, is that consistent across languages? For instance, is the boundary between green and blue always fuzzy?&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;- Are there any biological bases for color definitions, anchored perhaps in color perception and processing?  &lt;/p&gt;\n\n&lt;p&gt;I realize that this question straddles many disciplines, so I flaired it with Psychology but it could as well have been linguistic, anthropological etc.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/askscience/comments/vx4mql/how_are_boundaries_between_colors_defined_are/",
  "subreddit": "askscience",
  "id": "vx4mql",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "A friend and I were arguing about the color of a car. I said it was pink. He\nsaid it was purple. I'm not a native speaker of English, so I wondered if that\nhad perhaps something to do with it - perhaps my mother tongue delimited pink\nand purple differently than English. But asking some Americans, I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "友人と車の色について議論していた。私はピンクだと言った。彼は\n紫だと言った。私は英語が母国語ではないので、もしかしたら、そのことが\nもしかしたら、私の母国語は英語と違ってピンクと紫を区別しているのかもしれない。\n母国語は英語と違ってピンクと紫を区別しているのかもしれません。でも、アメリカ人に聞いてみると......。",
      "title": "色と色の境界はどのように決まるのですか？文化的・言語的・人類学的な現象なのか、それとも生物学的・神経学的な背景があるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我和一个朋友在为一辆车的颜色争论不休。我说那是粉红色。他\n说是紫色。我不是一个以英语为母语的人，所以我想知道这是否\n也许与此有关--也许我的母语对粉色和紫色的界定与英语不同。\n和紫色的划分方式与英语不同。但是问了一些美国人，我...",
      "title": "颜色之间的界限是如何界定的？它们是严格意义上的文化/语言/人类学现象，还是颜色定义背后有生物学/神经学的基础？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我和一個朋友在爲一輛車的顏色爭論不休。我說那是粉紅色。他\n說是紫色。我不是一個以英語爲母語的人，所以我想知道這是否\n也許與此有關--也許我的母語對粉色和紫色的界定與英語不同。\n和紫色的劃分方式與英語不同。但是問了一些美國人，我...",
      "title": "顏色之間的界限是如何界定的？它們是嚴格意義上的文化/語言/人類學現象，還是顏色定義背後有生物學/神經學的基礎？"
    }
  ]
}