{
  "author": "Underrated321",
  "original_created_utc": 1652123255,
  "title": "You are delusional if you believe that we are not in the bear market. And I am not talking about the last few weeks.",
  "created_utc": 1652139861,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;First of all, there is a 0% chance that we are in a bull market like this dumbass &lt;a href=\"https://www.reddit.com/r/CryptoCurrency/comments/udrns8/ive_been_here_since_2013_and_sorry_but_the_bull/\"&gt;post&lt;/a&gt; with 1k upvotes stated. &lt;/p&gt;\n\n&lt;p&gt;Second of all, we ARE in a bear market. And I am not talking about the last few weeks. Crypto is on a steady decline for &lt;strong&gt;7 MONTHS&lt;/strong&gt;, and people want to still argue that this isn&amp;#39;t a bear market?&lt;/p&gt;\n\n&lt;p&gt;By definition, a bull market occurs when securities are on the rise, while a bear market occurs when securities &lt;strong&gt;fall for a sustained period of time&lt;/strong&gt;. If 210 days of steady decline isn&amp;#39;t a sustained period of time, I don&amp;#39;t know what is.&lt;/p&gt;\n\n&lt;p&gt;Personally, I haven&amp;#39;t invested in the last few months for various reasons. The main one was that all altcoins were -70% down from ATH, while BTC was still at 40k. Now tell me what would happen if BTC reached 28k like it did last year? Altcoins would be most likely down -85%.&lt;/p&gt;\n\n&lt;p&gt;The rate hike, inflation, the Ukraine war and the stock market being in a bubble for almost 2 years now are just some other reasons.&lt;/p&gt;\n\n&lt;p&gt;So when will bull market start again in my opinion? Sadly, I believe it will happen only after a market crash. There will be a nice reset, investing going back to normal and people buying the dips, potentially war being over or even getting inflation under control. &lt;/p&gt;\n\n&lt;p&gt;Currently, no investor will ever go all-in with their money if there are so many risk factors.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 380,
  "permalink": "/r/CryptoCurrency/comments/ulynqb/you_are_delusional_if_you_believe_that_we_are_not/",
  "subreddit": "CryptoCurrency",
  "id": "ulynqb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "First of all, there is a 0% chance that we are in a bull market like this\ndumbass post\n[https://www.reddit.com/r/CryptoCurrency/comments/udrns8/ive_been_here_since_2013_and_sorry_but_the_bull/]\nwith 1k upvotes stated.\n\nSecond of all, we ARE in a bear market. And I am not talking about the last…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "まず、このような強気相場になる可能性は0％です\nまぬけポスト\n[https://www.reddit.com/r/CryptoCurrency/comments/udrns8/ive_been_here_since_2013_and_sorry_but_the_bull/]\n1k upvotesで述べた。\n\n第二に、我々は弱気市場にある。そして、私は最後の話ではない...",
      "title": "弱気相場でないと思っているならば、それは妄想だ。そして、私はここ数週間のことを話しているのではありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "首先，我们处于这样的牛市的可能性是0%。\n傻子的帖子\n[https://www.reddit.com/r/CryptoCurrency/comments/udrns8/ive_been_here_since_2013_and_sorry_but_the_bull/]\n说的那样，我们处于牛市的可能性为0。\n\n其次，我们确实处于熊市。我不是在说上一次的熊市。",
      "title": "如果你相信我们不在熊市中，那就是妄想了。而且我说的不是过去几周的情况。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，我們處於這樣的牛市的可能性是0%。\n傻子的帖子\n[https://www.reddit.com/r/CryptoCurrency/comments/udrns8/ive_been_here_since_2013_and_sorry_but_the_bull/]\n說的那樣，我們處於牛市的可能性爲0。\n\n其次，我們確實處於熊市。我不是在說上一次的熊市。",
      "title": "如果你相信我們不在熊市中，那就是妄想了。而且我說的不是過去幾周的情況。"
    }
  ]
}