{
  "author": "Jakeron",
  "the_new_excerpt": "Trying to time the market and make money is a great method to lose your crypto.\nReading t-charts and analytics won't get you anywhere in this volatile market.\n\nYou can't treat crypto like stocks. The market moves to quickly and is too\nunpredictable. Experienced traders will lose money here trying to…",
  "original_created_utc": 1613070610,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "试图为市场计时并赚钱是一种失去你的加密货币的好方法。\n阅读t图和分析不会让你在这个波动的市场中得到任何好处。\n\n你不能像对待股票一样对待加密技术。市场变化太快，太\n不可预知的。有经验的交易者会在这里赔钱，试图...",
      "title": "你不是日内交易员! 选择好的项目，坚持下去，你会赚到更多的钱。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "試圖爲市場計時並賺錢是一種失去你的加密貨幣的好方法。\n閱讀t圖和分析不會讓你在這個波動的市場中得到任何好處。\n\n你不能像對待股票一樣對待加密技術。市場變化太快，太\n不可預知的。有經驗的交易者會在這裏賠錢，試圖...",
      "title": "你不是日內交易員! 選擇好的項目，堅持下去，你會賺到更多的錢。"
    }
  ],
  "title": "You're not a day trader! You'll make more money by picking good projects and holding onto them",
  "created_utc": 1613093891,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Trying to time the market and make money is a great method to lose your crypto.  Reading t-charts and analytics won&#39;t get you anywhere in this volatile market.  </p>\n\n<p>You can&#39;t treat crypto like stocks.  The market moves to quickly and is too unpredictable.  <strong>Experienced traders will lose money here trying to use strategies that may work in other markets, and so will you.</strong> No one has crypto figured out.</p>\n\n<p>If you want to make money in crypto, pick projects that show value and that are of interest to you and hold them.  Don&#39;t sell them for the latest craze.  If you do your own research and pick crypto&#39;s that legitimately have value, you&#39;ll be in good shape.  It may take time before you start to see great ROI but that&#39;s ok.  Don&#39;t be fooled into thinking you can time the market.</p>\n\n<p>I have tried to time the market multiple times thinking that I could sell a crypto as it was going down and then buy more of it when it bottomed out.  Each time I was wrong and would have made much more money just holding.  </p>\n\n<p>Pick those projects you see value in and hodl.</p>\n</div><!-- SC_ON -->",
  "score": 313,
  "permalink": "/r/CryptoCurrency/comments/lhs1lp/youre_not_a_day_trader_youll_make_more_money_by/",
  "subreddit": "CryptoCurrency",
  "id": "lhs1lp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728615769
}