{
  "author": "roberthonker",
  "the_new_excerpt": "No matter how much money you have invested, you’re doing a great job. I know it\ncan make you feel insignificant when you hear how much other people have, don’t\nworry about that. Just because someone has invested more than you that doesn’t\nmake them more important.\n\nYou’re thinking about your future,…",
  "original_created_utc": 1624150630,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "どれだけの資金を投入しても、素晴らしい仕事をしています。他の人がいくら持っているかを聞くと\n他の人がどれだけ持っているかを聞いて、自分は取るに足らない存在だと感じることもあるでしょうが、そんなことは気にしないでください。\n気にすることはありません。誰かがあなたよりも多く投資しているからといって、その人が偉いわけではありません。\n自分より多く投資しているからといって、その人が重要になるわけではありません。\n\nあなたは将来のことを考えているのですから...。",
      "title": "投資額が10ドルでも10000ドルでも関係ありません。自分の将来を考えていることは素晴らしいことです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "不管你投资了多少钱，你都做得很好。我知道\n当你听到别人有多少钱时，会让你觉得自己很渺小，不要\n不要担心这个问题。仅仅因为有人的投资比你多，这并不意味着\n使他们更重要。\n\n你考虑的是你的未来，...",
      "title": "如果你投资了10美元或10000美元，这并不重要。你在为你的未来着想，这很了不起。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不管你投資了多少錢，你都做得很好。我知道\n當你聽到別人有多少錢時，會讓你覺得自己很渺小，不要\n不要擔心這個問題。僅僅因爲有人的投資比你多，這並不意味着\n使他們更重要。\n\n你考慮的是你的未來，...",
      "title": "如果你投資了10美元或10000美元，這並不重要。你在爲你的未來着想，這很了不起。"
    }
  ],
  "title": "It doesn’t matter if you’ve invested 10$ or 10000$. You’re thinking about your future and that’s amazing.",
  "created_utc": 1624170636,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>No matter how much money you have invested, you’re doing a great job. I know it can make you feel insignificant when you hear how much other people have, don’t worry about that. Just because someone has invested more than you that doesn’t make them more important.</p>\n\n<p>You’re thinking about your future, which is something that many people fail to do.</p>\n\n<p><strong>Be proud of what you own, don’t let anyone take that away from you.</strong></p>\n</div><!-- SC_ON -->",
  "score": 175,
  "permalink": "/r/CryptoCurrency/comments/o3u2p1/it_doesnt_matter_if_youve_invested_10_or_10000/",
  "subreddit": "CryptoCurrency",
  "id": "o3u2p1",
  "is_self": true,
  "media": null,
  "is_video": false
}