{
  "author": "ilikethetech_100",
  "original_created_utc": 1627952572,
  "title": "If you are \"Moonless\" please start contributing! I was tipped my first moon and it got me more involved in this sub!",
  "created_utc": 1627965898,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Like the title says I was tipped my first moon and it got me more involved in this sub. After occurring 1k moons I then proceeded to tip 100 moons out to the moonless (moons have 3x since then). I got suspended for a week due to this practice of tipping out moons (without mod approval). So now I just try and get people to open their Reddit Vault (which is an Ethereum wallet) and contribute to the community to earn these tasty moons!!</p>\n\n<p>P.S. Moons to the moon!!</p>\n</div><!-- SC_ON -->",
  "score": 287,
  "permalink": "/r/CryptoCurrency/comments/owsdkk/if_you_are_moonless_please_start_contributing_i/",
  "subreddit": "CryptoCurrency",
  "id": "owsdkk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Like the title says I was tipped my first moon and it got me more involved in\nthis sub. After occurring 1k moons I then proceeded to tip 100 moons out to the\nmoonless (moons have 3x since then). I got suspended for a week due to this\npractice of tipping out moons (without mod approval). So now I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルにもあるように、私は最初の月にチップをもらい、それがきっかけでこのサブカルチャーに\nこのサブシステムにもっと夢中になりました。1,000個の月が発生した後、100個の月を無月齢の人に向けて発信しました。\nそれ以来、月は3倍になりました）。これが原因で、1週間の停職処分を受けました。\n1週間の停止処分を受けました。それで、今は...",
      "title": "もしあなたが \"Moonless \"であれば、ぜひ貢献を始めてください。私は最初の月にチップをもらって、それでこのサブにもっと参加するようになりました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "就像标题所说的那样，我的第一个月亮就得到了小费，这让我更多地参与到这个子项目中。\n这个子。在发生了1000个月亮后，我又继续给100个月亮的小费。\n无月（从那时起，月球有3倍）。由于这个原因，我被停职了一个星期\n的做法，我被停职了一个星期（没有经过MOD批准）。所以现在我...",
      "title": "如果你是 \"无月\"，请开始贡献你的力量! 我的第一个月亮就得到了小费，这让我更多地参与到这个子项目中来!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "就像標題所說的那樣，我的第一個月亮就得到了小費，這讓我更多地參與到這個子項目中。\n這個子。在發生了1000個月亮後，我又繼續給100個月亮的小費。\n無月（從那時起，月球有3倍）。由於這個原因，我被停職了一個星期\n的做法，我被停職了一個星期（沒有經過MOD批准）。所以現在我...",
      "title": "如果你是 \"無月\"，請開始貢獻你的力量! 我的第一個月亮就得到了小費，這讓我更多地參與到這個子項目中來!"
    }
  ]
}