{
  "author": "ConsiderationFew3336",
  "original_created_utc": 1649595220,
  "title": "Why do so many people want to live in LA despite it being a concrete heat trap with no public transport, too many cars and too much pollution?",
  "created_utc": 1649601254,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I (from Europe) just visited LA for the first time and why there is many cool things about it, I felt no regret to leave. In my opinion, there are so many cons to LA that would outweigh all the benefits. Starting from the air quality, but also the lack of public transport, the traffic, the lack of cycling lanes, the non-walkability or the fact that most cafes/restaurants/houses are next to a large street that is always noisy. And then all the homless people. Or the rubbish lying around.&lt;/p&gt;\n\n&lt;p&gt;Considering the high prices of living in LA, I don&amp;#39;t understand why anyone would want them for themselves.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 120,
  "permalink": "/r/TooAfraidToAsk/comments/u0gzl3/why_do_so_many_people_want_to_live_in_la_despite/",
  "subreddit": "TooAfraidToAsk",
  "id": "u0gzl3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I (from Europe) just visited LA for the first time and why there is many cool\nthings about it, I felt no regret to leave. In my opinion, there are so many\ncons to LA that would outweigh all the benefits. Starting from the air quality,\nbut also the lack of public transport, the traffic, the lack of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は（ヨーロッパから）初めてロサンゼルスを訪れましたが、なぜ多くのクールな\nがあり、帰るのが名残惜しいくらいでした。私の意見では、多くの\nLAの短所は、すべての長所を凌駕するものです。まず、空気の質。\nしかし、公共交通機関の少なさ、交通渋滞、...",
      "title": "公共交通機関もなく、車も多く、公害も多いコンクリートのヒートトラップであるにもかかわらず、なぜ多くの人がロサンゼルスに住みたがるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我（来自欧洲）刚刚第一次访问了洛杉矶，为什么它有很多很酷的东西？\n的事情，我觉得不后悔离开。在我看来，洛杉矶有很多\n弊，超过了所有的好处。从空气质量开始。\n但也缺乏公共交通，交通，缺乏...。",
      "title": "为什么这么多人想住在洛杉矶，尽管它是一个没有公共交通的混凝土热阱，有太多的汽车和太多的污染。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我（來自歐洲）剛剛第一次訪問了洛杉磯，爲什麼它有很多很酷的東西？\n的事情，我覺得不後悔離開。在我看來，洛杉磯有很多\n弊，超過了所有的好處。從空氣質量開始。\n但也缺乏公共交通，交通，缺乏...。",
      "title": "爲什麼這麼多人想住在洛杉磯，儘管它是一個沒有公共交通的混凝土熱阱，有太多的汽車和太多的污染。"
    }
  ]
}