{
  "author": "TooDriven",
  "original_created_utc": 1626771415,
  "title": "[Meta] Why are so many questions here so specific?",
  "created_utc": 1626789163,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Not sure if this is allowed to ask here but I&#39;m genuinely curious: I&#39;ve visited this sub a few times in the last year or so and the questions seem to be becoming increasingly specific, i.e. focused on a very tiny fragment of history, often something you have never thought about. This is of course interesting and legitimate etc.</p>\n\n<p>Still, I feel like these types of questions get a lot more attention and gain more traction (upvotes, responses etc.) than all the &quot;big history&quot; or &quot;big why&quot; questions (which personally, I find more interesting, but that&#39;s just subjective of course).</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/onyb2d/meta_why_are_so_many_questions_here_so_specific/",
  "subreddit": "AskHistorians",
  "id": "onyb2d",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Not sure if this is allowed to ask here but I'm genuinely curious: I've visited\nthis sub a few times in the last year or so and the questions seem to be\nbecoming increasingly specific, i.e. focused on a very tiny fragment of history,\noften something you have never thought about. This is of course…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここで質問していいのかどうかわかりませんが、純粋に疑問に思っています。\nここ1年ほどの間に何度かこのサブサイトを訪れましたが、質問の内容がだんだん具体的になってきているような気がします。\n歴史のごく一部に焦点を当てているように見えます。\nつまり、非常に小さな歴史の断片に焦点を当てているのです。もちろん、これは...",
      "title": "[Meta] ここでの質問は、なぜこんなにも具体的なものが多いのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不知道这是否允许在这里提问，但我真的很好奇：在过去的一年里，我曾多次访问过这个子网站。\n在过去一年左右的时间里，我曾多次访问过这个子网站，问题似乎越来越多。\n变得越来越具体，也就是说，集中在一个非常小的历史片段上。\n往往是你从来没有想过的东西。这当然是...",
      "title": "[Meta] 为什么这里的很多问题都很具体？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不知道這是否允許在這裏提問，但我真的很好奇：在過去的一年裏，我曾多次訪問過這個子網站。\n在過去一年左右的時間裏，我曾多次訪問過這個子網站，問題似乎越來越多。\n變得越來越具體，也就是說，集中在一個非常小的歷史片段上。\n往往是你從來沒有想過的東西。這當然是...",
      "title": "[Meta] 爲什麼這裏的很多問題都很具體？"
    }
  ]
}