{
  "author": "ItWouldBeGrand",
  "original_created_utc": 1637813464,
  "title": "The original gameboy Pokémon would make the perfect fully-blockchained game.",
  "created_utc": 1637872848,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Honestly a lot of classic Nintendo games which are still wildly popular would be amazing on blockchain. Legend of Zelda is another one I can think of.</p>\n\n<p>But Pokémon would be incredible — and gameplay quality on chain would be pretty comparable to offchain play.</p>\n\n<p>Most of the time in Pokémon you’re roaming the map, looking for Pokémon…easy enough for offchain play.</p>\n\n<p>Then you enter a building, run into a person, or a Pokémon: boom turn-based on chain play. But you actually own the Pokémon you find, buy, or win. That would be incredible…and you’d get millions of players.</p>\n\n<p>Are there any similar games right now built on chain that actually work? Defi kingdoms maybe?</p>\n\n<p><em>Edit for some fanfic:</em></p>\n\n<p>Tl;dr: Becoming a professional Pokémon Trainer becomes the NFT equivalent of becoming a professional poker player.</p>\n\n<p>Fanfic begins:</p>\n\n<p>You walk into your local coffee shop. Your Pokédex  DeFi Wallet app pings you:</p>\n\n<p>“5 trainers in vicinity. Open challenge?” [Modern web/app tech]</p>\n\n<p>“Yes.” </p>\n\n<p>“Wager?”</p>\n\n<p>“Yes?”</p>\n\n<p>“Wager amount or ‘Play-for-keeps’?” [specify transaction details]</p>\n\n<p>“Play-for-keeps.” [Unsigned transaction]</p>\n\n<p>“Opening challenge…\n…\n…\n…OrangeMochaFrappucino Accepts challenge! Initiate?” [confirm/sign transaction?]</p>\n\n<p>“Yes” [sign transaction]</p>\n\n<p>“Prepare for Battle!”</p>\n\n<p>“Choose Pokémon” [web tech]</p>\n\n<p>“Charizard…”</p>\n\n<p>“Random Number Generator decides player OrangeMocha goes first.”</p>\n\n<p>…</p>\n\n<p><em>End Fanfic</em></p>\n\n<p>Limited global Pokémon supply makes your NFT Pokémon increasingly valuable. And the more you train, the more valuable they become. Pokémon can only be found, won, or bought in special circumstances—but these are NFTs so there’s an aftermarket!!! </p>\n\n<p>Man I’m jacked on this idea. The potential is limitless. Hey Nintendo: if you’re out there. Let’s do this thing!!!</p>\n</div><!-- SC_ON -->",
  "score": 190,
  "permalink": "/r/CryptoCurrency/comments/r1nl2d/the_original_gameboy_pokémon_would_make_the/",
  "subreddit": "CryptoCurrency",
  "id": "r1nl2d",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Honestly a lot of classic Nintendo games which are still wildly popular would be\namazing on blockchain. Legend of Zelda is another one I can think of.\n\nBut Pokémon would be incredible — and gameplay quality on chain would be pretty\ncomparable to offchain play.\n\nMost of the time in Pokémon you’re…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "正直なところ、今でも人気のある任天堂のクラシックゲームの多くは\nブロックチェーンでは素晴らしいものになるでしょう。ゼルダの伝説などがそうですね。\n\nしかし、ポケモンは素晴らしいものになるでしょう。そして、チェーン上でのゲームプレイの質は、オフチェーンでのプレイに匹敵します。\nチェーン上でのゲームプレイの質は、オフチェーンでのプレイに匹敵します。\n\nポケモンでは、ほとんどの場合、あなたは...",
      "title": "初代ゲームボーイのポケモンは、完全にブロックチェーン化されたゲームとして最適です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "说实话，很多仍在疯狂流行的经典任天堂游戏在区块链上将是令人惊叹的。\n在区块链上的表现是惊人的。塞尔达传说》是我能想到的另一个。\n\n但神奇宝贝将是令人难以置信的--而且链上的游戏质量将与链下的游戏相当。\n与链外游戏相媲美。\n\n在《神奇宝贝》中，大部分时间你都在...",
      "title": "最初的Gameboy Pokémon将成为完美的全区块链游戏。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "說實話，很多仍在瘋狂流行的經典任天堂遊戲在區塊鏈上將是令人驚歎的。\n在區塊鏈上的表現是驚人的。塞爾達傳說》是我能想到的另一個。\n\n但神奇寶貝將是令人難以置信的--而且鏈上的遊戲質量將與鏈下的遊戲相當。\n與鏈外遊戲相媲美。\n\n在《神奇寶貝》中，大部分時間你都在...",
      "title": "最初的Gameboy Pokémon將成爲完美的全區塊鏈遊戲。"
    }
  ]
}