{
  "author": "Randrufer",
  "original_created_utc": 1635068529,
  "title": "Shiba Inu makes me hate myself, Crypto and others who actually bought it. And I don't like it",
  "created_utc": 1635089842,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I did the correct thing! I diversified into projects that have strong fundamentals like SOL and LINK and MATIC. The biggest chunk of my shit consists of &quot;Blue Chips&quot; like Bitcoin and ETH. I have some obscure coins like ADA, BNB and NANO just in case. </p>\n\n<p>WHAT I DON&#39;T HAVE, BECAUSE DADDY TOLD ME NOT TO BUY IT, IS AN UTTER AND COMPLETE SHITCOIN LIKE SHIBA INU.</p>\n\n<p>And I felt very smart. Shitcoin. No usecase. Kept alive by sheer hype and the occasional Elon Musk Post. The higher it went, the SMARTER I felt because surely it would come down aaaaaaaany second now.</p>\n\n<p>I wanted to throw 100 Dollar Lottery Money into it at the very beginning.  I didn&#39;t. Sex isn&#39;t fun anymore.  Food has lost its taste. I can SENSE the parallel universe where I quit my job by deliberately giving me diarrhea and shit into my colleagues desk. That old hag.</p>\n\n<p>If I had made a different decision some months ago, I&#39;d be in that other train. But I&#39;m in THIS train.</p>\n\n<p>And that&#39;s why I started to hate everything.  I&#39;m grumpy. But I still won&#39;t buy Shiba Inu. It will come down at some point.  But if it doesn&#39;t,  and becomes THE world currency, I hope my other crypto will be worth enough for the rope I need to buy for sexual asphyxiation. (Not gonna kill myself but I&#39;ll need hard stuff then.  Also don&#39;t do it.  It&#39;s hellishly dangerous)</p>\n</div><!-- SC_ON -->",
  "score": 241,
  "permalink": "/r/CryptoCurrency/comments/qeoy20/shiba_inu_makes_me_hate_myself_crypto_and_others/",
  "subreddit": "CryptoCurrency",
  "id": "qeoy20",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I did the correct thing! I diversified into projects that have strong\nfundamentals like SOL and LINK and MATIC. The biggest chunk of my shit consists\nof \"Blue Chips\" like Bitcoin and ETH. I have some obscure coins like ADA, BNB\nand NANO just in case.\n\nWHAT I DON'T HAVE, BECAUSE DADDY TOLD ME NOT TO…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は正しいことをしました。私はSOLやLINK、MATICのような強力な\nSOLやLINK、MATICのようなファンダメンタルズの強いプロジェクトに分散しました。私の資金の大部分は\nビットコインやETHのような「ブルーチップ」です。ADA、BNB、NANOのような無名のコインも念のため持っています。\nNANOなどの無名のコインも念のため持っています。\n\n私が持っていないもの、それはパパが持ってはいけないと言ったからです...",
      "title": "柴犬を見ていると、自分やCrypto、そして実際に買った人たちが憎くなります。そして、私はそれが好きではない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我做了正确的事情! 我分散投资于那些具有强大\n像SOL、LINK和MATIC这样的基本面。我最大的一笔资金包括\n蓝筹股\"，如比特币和ETH。我还有一些不知名的硬币，如ADA、BNB\n和NANO，以备不时之需。\n\n我没有的东西，因为爸爸告诉我不要......",
      "title": "Shiba Inu让我恨我自己、Crypto和其他真正买它的人。我也不喜欢它"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我做了正確的事情! 我分散投資於那些具有強大\n像SOL、LINK和MATIC這樣的基本面。我最大的一筆資金包括\n藍籌股\"，如比特幣和ETH。我還有一些不知名的硬幣，如ADA、BNB\n和NANO，以備不時之需。\n\n我沒有的東西，因爲爸爸告訴我不要......",
      "title": "Shiba Inu讓我恨我自己、Crypto和其他真正買它的人。我也不喜歡它"
    }
  ]
}