{
  "author": "Trenton778",
  "original_created_utc": 1630157599,
  "title": "Banks should not get bailout out when they intentionally degrade our economy by betting unrealistically against Crypto’s progress.",
  "created_utc": 1630211426,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Instead of trying to adapt to Crypto currency’s place in the financial community, banks are breaking their own rules and certain federal laws by trying to destabilize and discredit this new form of banking alternative. Everyone knows banks are one of the biggest scams forced on the working class. It’s time to BLOCKBUSTER the majority of them. Whenever we have a moment we should start calling or emailing ( which is better)our state representatives and senators to put them on notice that we’re completely against bank bailout, especially if there aren’t any lengthy prison sentences.</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/CryptoCurrency/comments/pd9ulf/banks_should_not_get_bailout_out_when_they/",
  "subreddit": "CryptoCurrency",
  "id": "pd9ulf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Instead of trying to adapt to Crypto currency’s place in the financial\ncommunity, banks are breaking their own rules and certain federal laws by trying\nto destabilize and discredit this new form of banking alternative. Everyone\nknows banks are one of the biggest scams forced on the working class.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "金融界における暗号通貨の位置づけに適応しようとするのではなく\n銀行は、自分たちのルールや特定の連邦法を破り、この新しい銀行の代替手段を不安定にし、信用を落とそうとしています。\n銀行は、自分たちのルールや連邦法を破って、この新しい銀行の代替手段を不安定にし、信用を失墜させようとしています。誰もが\n銀行が労働者階級に強いられた最大の詐欺の一つであることは誰もが知っています....",
      "title": "銀行は、暗号の進歩に対して非現実的な賭けをして意図的に経済を悪化させても、救済措置を受けるべきではありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "银行非但没有努力适应加密货币在金融界的地位\n相反，银行正在违反自己的规则和某些联邦法律，试图\n试图破坏这种新的银行替代形式的稳定和信誉。每个人都知道\n都知道银行是强加给工人阶级的最大骗局之一....。",
      "title": "当银行通过不切实际地押注反对加密货币的发展而故意贬低我们的经济时，他们不应该得到救助。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "銀行非但沒有努力適應加密貨幣在金融界的地位\n相反，銀行正在違反自己的規則和某些聯邦法律，試圖\n試圖破壞這種新的銀行替代形式的穩定和信譽。每個人都知道\n都知道銀行是強加給工人階級的最大騙局之一....。",
      "title": "當銀行通過不切實際地押注反對加密貨幣的發展而故意貶低我們的經濟時，他們不應該得到救助。"
    }
  ]
}