{
  "author": "BritishBoyRZ",
  "original_created_utc": 1635606925,
  "title": "This is why the banks are doomed - Crypto doesn't steal from your family",
  "created_utc": 1635655380,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Recently, I have adopted crypto in a way that is saving me and my family so much money, almost instantly. I&#39;ve been invested in crypto for a while but I&#39;ve never actually used it in the real world. It&#39;s going to change everything! It&#39;s just a matter of time </p>\n\n<p>Context: I currently reside in Canada. Most of my family live in Lebanon. You may know, but my home country has been getting destroyed. COVID, the August 2020 Beirut explosion, mass civil unrest and hyperinflation decimating my beautiful homeland. </p>\n\n<p>The economy is fucked up there, and every dollar goes a very long way in surviving there at the moment. My mother is financially dependent on me and I send $600 every month to her. Up until this month, I&#39;d been sending her this amount through TransferWise using CAD fiat. I&#39;d pay TransferWise a fee (albeit the cheapest out of all fx payment providers), and then the banks would take their cut. She&#39;d get 570 after I send about 615 with fees. About 7.5% shaved, a sort of tax, just to send her money to live on. </p>\n\n<p>I&#39;ve discovered there, since I visited recently, a business (and more popping up) of people there accepting USDT crypto, and then giving USD cash after deducting just 1%. Now I send approx $610 USD including fees, for her to receive $600- and it&#39;s same day! With the banks it&#39;s 3-4 business days. </p>\n\n<p>This has literally improved her quality of life significantly because right now those $30 that she was being robbed of before are worth a lot in Lebanon! $30 will get her 600,000 LBP (local currency) which is the equivalent of 40L of petrol or 4 huge 2-person dinners at a beach restaurant (per month!) </p>\n\n<p>Thank you crypto!!</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/CryptoCurrency/comments/qj3j0k/this_is_why_the_banks_are_doomed_crypto_doesnt/",
  "subreddit": "CryptoCurrency",
  "id": "qj3j0k",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Recently, I have adopted crypto in a way that is saving me and my family so much\nmoney, almost instantly. I've been invested in crypto for a while but I've never\nactually used it in the real world. It's going to change everything! It's just a\nmatter of time\n\nContext: I currently reside in Canada.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、私は暗号を採用して、私と私の家族のお金を大幅に節約しています。\nほとんど即座にお金を節約することができます。私はしばらくの間、暗号に投資していましたが、実際には使ったことがありませんでした。\n実際に使ったことはありませんでした。これですべてが変わります! それはただの\n時間の問題\n\nコンテキストです。私は現在、カナダに住んでいます....",
      "title": "銀行が破滅する理由 - 暗号はあなたの家族から盗まない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近，我采用了加密货币的方式，为我和我的家人节省了很多东西。\n钱，几乎是瞬间的事。我投资加密货币有一段时间了，但我从未在现实世界中真正使用过它。\n实际上在现实世界中使用它。它将会改变一切! 这只是一个\n时间问题\n\n语境。我目前居住在加拿大....",
      "title": "这就是银行注定要失败的原因--加密货币不会从你的家庭中偷走东西"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近，我採用了加密貨幣的方式，爲我和我的家人節省了很多東西。\n錢，幾乎是瞬間的事。我投資加密貨幣有一段時間了，但我從未在現實世界中真正使用過它。\n實際上在現實世界中使用它。它將會改變一切! 這只是一個\n時間問題\n\n語境。我目前居住在加拿大....",
      "title": "這就是銀行註定要失敗的原因--加密貨幣不會從你的家庭中偷走東西"
    }
  ]
}