{
  "author": "DeLaGrandTerre",
  "original_created_utc": 1653442718,
  "title": "Identifying my relatives clothing from the 1920s in Louisiana--traditional Mexican or just standard southern?",
  "created_utc": 1653496738,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi all,&lt;/p&gt;\n\n&lt;p&gt;I recently did a deep dive into my matrilineal line and after finding a few old photos of my mom&amp;#39;s family, I started to wonder about the clothing. The family was from Louisiana, and these photos are taken there in the 1920s.  The woman is my great grand mother (the man on the other side of the photo is her brother)  and the third photo is her wedding day.&lt;/p&gt;\n\n&lt;p&gt;Are these pretty standard dresses for the time period or are they something more traditional?  And if they are traditional of some kind, what culture would they likely be stemming from? &lt;/p&gt;\n\n&lt;p&gt;Thanks so much for your insight!&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;ETA: her brother is in some kind of a military uniform--that I do know&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://imgur.com/a/KKJtrPx\"&gt;https://imgur.com/a/KKJtrPx&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/ux6enr/identifying_my_relatives_clothing_from_the_1920s/",
  "subreddit": "AskHistorians",
  "id": "ux6enr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hi all,\n\nI recently did a deep dive into my matrilineal line and after finding a few old\nphotos of my mom's family, I started to wonder about the clothing. The family\nwas from Louisiana, and these photos are taken there in the 1920s. The woman is\nmy great grand mother (the man on the other side of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。\n\n最近、自分の母系を深く調べていて、母方の古い写真をいくつか見つけたのですが\nを発見し、服装が気になりだしました。その家族は\nこの写真は1920年代にルイジアナで撮られたものです。この女性は\n私の曾祖母（反対側の男性は...",
      "title": "1920年代のルイジアナ州の親族の服装を確認したいのですが、伝統的なメキシカンか、それとも普通の南部か？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。\n\n我最近对我的母系血统进行了深入研究，在找到一些我母亲家族的老照片之后\n在找到我妈妈家的几张老照片后，我开始想知道衣服的问题。这个家庭\n来自路易斯安那州，这些照片是20世纪20年代在那里拍摄的。这个女人是\n我的曾祖母（另一边的男人是...",
      "title": "识别我的亲戚在路易斯安那州20世纪20年代的服装--传统的墨西哥人或只是标准的南方人？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。\n\n我最近對我的母系血統進行了深入研究，在找到一些我母親家族的老照片之後\n在找到我媽媽家的幾張老照片後，我開始想知道衣服的問題。這個家庭\n來自路易斯安那州，這些照片是20世紀20年代在那裏拍攝的。這個女人是\n我的曾祖母（另一邊的男人是...",
      "title": "識別我的親戚在路易斯安那州20世紀20年代的服裝--傳統的墨西哥人或只是標準的南方人？"
    }
  ]
}