{
  "author": "Jose__Manuel",
  "original_created_utc": 1641915879,
  "title": "Does anyone else think that the worst part of a dream, is when you have a companion within said dream, have a great time with them, but when you wake up you can't remember what they look like?",
  "created_utc": 1641966089,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I swear this&amp;#39;ll have me thinking ALL day trying to figure out who this mystery person was.&lt;/p&gt;\n\n&lt;p&gt;Edit: still thinking about my mystery dream person.  But thanks everyone for the responses!  I loved reading different experiences and viewpoints on dreams!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/NoStupidQuestions/comments/s1fvjk/does_anyone_else_think_that_the_worst_part_of_a/",
  "subreddit": "NoStupidQuestions",
  "id": "s1fvjk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I swear this'll have me thinking ALL day trying to figure out who this mystery\nperson was.\n\nEdit: still thinking about my mystery dream person. But thanks everyone for the\nresponses! I loved reading different experiences and viewpoints on dreams!",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この謎の人物が誰なのか、一日中考えることになりそうです。\nという人がいました。\n\n編集：まだ謎の夢の人物について考えています。でも、みなさん、ありがとうございました。\n回答 夢に対する様々な経験や視点を読むことができ、とても楽しかったです",
      "title": "夢で一番嫌なのは、夢の中に仲間がいて、一緒に楽しい時間を過ごしたのに、目が覚めたらその仲間の顔を思い出せないことだと思う人はいませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我发誓这将使我思考一整天，试图找出这个神秘的人是谁。\n人是谁。\n\n编辑：仍在思考我的神秘梦中人。但是感谢大家的\n回应！我喜欢阅读关于梦境的不同经验和观点。我喜欢阅读关于梦境的不同经验和观点!",
      "title": "是否有人认为，梦境中最糟糕的部分，是当你在梦中有一个同伴，与他们相处得很愉快，但当你醒来时，却不记得他们的样子？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我發誓這將使我思考一整天，試圖找出這個神祕的人是誰。\n人是誰。\n\n編輯：仍在思考我的神祕夢中人。但是感謝大家的\n回應！我喜歡閱讀關於夢境的不同經驗和觀點。我喜歡閱讀關於夢境的不同經驗和觀點!",
      "title": "是否有人認爲，夢境中最糟糕的部分，是當你在夢中有一個同伴，與他們相處得很愉快，但當你醒來時，卻不記得他們的樣子？"
    }
  ]
}