{
  "author": "ilai_reddead",
  "the_new_excerpt": "I was very interested in finding the rhetoric and overall feel of the dot com\nbubble so I searched by date before 2000 and here what I found.\n\n\"Not long ago I asked the officer of a regional investment banking firm why the\nprice-earnings ratio for a small publicly held company was so high. “After…",
  "original_created_utc": 1613240879,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我很想找到点点网的言论和整体感觉。\n泡沫，所以我按2000年以前的日期搜索，在这里我发现了什么。\n\n\"不久前，我问一家地区性投资银行公司的官员，为什么会出现\n一家小型上市公司的市盈率如此之高。\"经过...",
      "title": "找到了一些早在网络泡沫破灭时的文章，它们非常相似。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我很想找到點點網的言論和整體感覺。\n泡沫，所以我按2000年以前的日期搜索，在這裏我發現了什麼。\n\n\"不久前，我問一家地區性投資銀行公司的官員，爲什麼會出現\n一家小型上市公司的市盈率如此之高。\"經過...",
      "title": "找到了一些早在網絡泡沫破滅時的文章，它們非常相似。"
    }
  ],
  "title": "Found some articles dated back to the dot-com bust, and they are eerily similar",
  "created_utc": 1613248448,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was very interested in finding the rhetoric and overall feel of the dot com bubble so I searched by date before 2000 and here what I found.</p>\n\n<p>&quot;<strong>Not long ago I asked the officer of a regional investment banking firm why the price-earnings ratio for a small publicly held company was so high. “After all,” I said, “this company has the potential to grow since it’s in the dental equipment industry. It seems to me it warrants a high ratio.” Don’t you know,” my friend replied, somewhat puzzled, “that that company is mainly a machine shop? That puts it into a low-growth industry classification.”</strong> this is so eerily similar to tesla, not only does the guy say a p/e ratio is obsolete when it&#39;s not, but he also tries to make an argument that a dental shop is not a low growth industry when it is, very similar to how people say Tesla isn&#39;t a car company and price it differently because of that.</p>\n\n<p>another interesting quote that I found was</p>\n\n<p><strong>&quot;It was once the job of analysts to tell investors at what price a stock should trade. But now, some analysts say investors are calling the shots, even when it comes to big stocks with predictable earnings growth. Sure, the fine art of rationalizing high stock prices has long been on display for tiny, unproven Internet ventures without earnings. After all, it&#39;s hard to value a new company using traditional methods when it has no earnings.&quot;</strong> even after reading this I still could be fooled that this was written today, the way he says that traditional metrics don&#39;t matter or don&#39;t work anymore is strikingly similar, also the phrase &quot;<strong>But now, some analysts say investors are calling the shots&quot;</strong> is also bringing some bells in my head after this whole retail revolution.</p>\n\n<p>and the final one I have is also the most striking</p>\n\n<p><strong>&quot;For day traders armed with Power E*trade accounts and limitless optimism, the Internet is a revolution that has blown away all the old rules about how the stock market works.&quot;</strong> this is just so striking to what I hear today, replace e-trade with Robin and boom I would say this was written right now. and also how they say all of the old rules are obsolete the next paragraph also very eerie &quot;<strong>For more seasoned investors, however, the Internet rally looks suspiciously like a beast they&#39;ve seen rear its head time and again in an overripe bull market: a stock market bubble, fed by young, greedy investors for whom a 20% annual return on investments is a mark of defeat.&quot;.</strong> this is almost an exact repeat of the dot com bubble, I never thought it was this similar but wow, I think I will begin to hedge my portfolio and I would caution against saying this times is different.</p>\n\n<p>here are some sources</p>\n\n<p>also if you would like to find more articles like this search, before:YYYY-MM-DD (search term)</p>\n\n<p><a href=\"https://www.forbes.com/1999/01/14/mu3.html?sh=1f3103254aea\">https://www.forbes.com/1999/01/14/mu3.html?sh=1f3103254aea</a></p>\n\n<p><a href=\"https://www.wsj.com/articles/SB955485845794159366\">https://www.wsj.com/articles/SB955485845794159366</a></p>\n</div><!-- SC_ON -->",
  "score": 956,
  "permalink": "/r/stocks/comments/lj62rp/found_some_articles_dated_back_to_the_dotcom_bust/",
  "subreddit": "stocks",
  "id": "lj62rp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728623045
}