{
  "author": "SmallTlMEtrader",
  "original_created_utc": 1648204019,
  "title": "Everyone was for decentralisation until Russia wanted to sell Gas for bitcoin, now people around this sub are crying about it with comments like \"I would rather lose money and the price tanks than Russia making money from Bitcoin\"",
  "created_utc": 1648214599,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;First of all, as someone from a third world country that&amp;#39;s been sanctioned, all sanctions do is bring a famine to a country. (Looking at Syria, Venezuela.. etc) All those thinking they sit on a moral high ground calling for the hunger of millions of people are disgusting double standard subhumans that have no empathy for their fellow human. I&amp;#39;ve seen people dying of hunger in the streets and guess what ? The governments are still strong and standing cause this isn&amp;#39;t a fairy tail where the good side always wins.&lt;/p&gt;\n\n&lt;p&gt;Double standard cause the US have done far worse than this in literally every war they financed and/or were directly involved with, yet if anyone mentions this they&amp;#39;re accused of being Putin apologists.&lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t fathom how cruel some people can get and calling for the hunger of a whole nation because of the actions of their fucked up dictator ! Do you (americans) think that you, your families and tour children deserve to suffer and famined because of your government&amp;#39;s actions in the middle east, Latin America and around the world ? Do you ?&lt;/p&gt;\n\n&lt;p&gt;Fuck every single government. Power to the people.&lt;/p&gt;\n\n&lt;p&gt;You don&amp;#39;t understand the basics of decentralisation, it&amp;#39;s NOT hooray decentralisation unless some with a different belief system is using it. God I hate this sub lately&lt;/p&gt;\n\n&lt;p&gt;Edit : I mentioned the US doing far worse to point out that the American people DON&amp;#39;T deserve living in a famine for their government&amp;#39;s actions, same like the Russian people or any other nation&amp;#39;s people for that matter. Not because I&amp;#39;m pro-dictatorship like people are accusing me of.. but I think I won&amp;#39;t defend myself anymore cause some people are so agenda oriented and so blind to the truth even if you hit them in the face with it, and will always see anyone who speaks out against the state media points as &amp;quot;Puting apologist&amp;quot; or &amp;quot;pro-dictator&amp;quot; or whatever new trendy name is used for public shaming anyone who thinks outside the flock&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 1041,
  "permalink": "/r/CryptoCurrency/comments/tniwhf/everyone_was_for_decentralisation_until_russia/",
  "subreddit": "CryptoCurrency",
  "id": "tniwhf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "First of all, as someone from a third world country that's been sanctioned, all\nsanctions do is bring a famine to a country. (Looking at Syria, Venezuela.. etc)\nAll those thinking they sit on a moral high ground calling for the hunger of\nmillions of people are disgusting double standard subhumans…"
}