{
  "author": "SmallTlMEtrader",
  "original_created_utc": 1648204019,
  "title": "Everyone was for decentralisation until Russia wanted to sell Gas for bitcoin, now people around this sub are crying about it with comments like \"I would rather lose money and the price tanks than Russia making money from Bitcoin\"",
  "created_utc": 1648214599,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;First of all, as someone from a third world country that&amp;#39;s been sanctioned, all sanctions do is bring a famine to a country. (Looking at Syria, Venezuela.. etc) All those thinking they sit on a moral high ground calling for the hunger of millions of people are disgusting double standard subhumans that have no empathy for their fellow human. I&amp;#39;ve seen people dying of hunger in the streets and guess what ? The governments are still strong and standing cause this isn&amp;#39;t a fairy tail where the good side always wins.&lt;/p&gt;\n\n&lt;p&gt;Double standard cause the US have done far worse than this in literally every war they financed and/or were directly involved with, yet if anyone mentions this they&amp;#39;re accused of being Putin apologists.&lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t fathom how cruel some people can get and calling for the hunger of a whole nation because of the actions of their fucked up dictator ! Do you (americans) think that you, your families and tour children deserve to suffer and famined because of your government&amp;#39;s actions in the middle east, Latin America and around the world ? Do you ?&lt;/p&gt;\n\n&lt;p&gt;Fuck every single government. Power to the people.&lt;/p&gt;\n\n&lt;p&gt;You don&amp;#39;t understand the basics of decentralisation, it&amp;#39;s NOT hooray decentralisation unless some with a different belief system is using it. God I hate this sub lately&lt;/p&gt;\n\n&lt;p&gt;Edit : I mentioned the US doing far worse to point out that the American people DON&amp;#39;T deserve living in a famine for their government&amp;#39;s actions, same like the Russian people or any other nation&amp;#39;s people for that matter. Not because I&amp;#39;m pro-dictatorship like people are accusing me of.. but I think I won&amp;#39;t defend myself anymore cause some people are so agenda oriented and so blind to the truth even if you hit them in the face with it, and will always see anyone who speaks out against the state media points as &amp;quot;Puting apologist&amp;quot; or &amp;quot;pro-dictator&amp;quot; or whatever new trendy name is used for public shaming anyone who thinks outside the flock&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 1041,
  "permalink": "/r/CryptoCurrency/comments/tniwhf/everyone_was_for_decentralisation_until_russia/",
  "subreddit": "CryptoCurrency",
  "id": "tniwhf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "First of all, as someone from a third world country that's been sanctioned, all\nsanctions do is bring a famine to a country. (Looking at Syria, Venezuela.. etc)\nAll those thinking they sit on a moral high ground calling for the hunger of\nmillions of people are disgusting double standard subhumans…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "まず、制裁を受けた第三国の人間として、すべての\n制裁は、その国に飢饉をもたらす。(シリア、ベネズエラ...などを見ていると）。\n道徳的な高みにいるつもりの人たちが、自分たちの飢餓を訴えているのです。\n何百万人もの人々が、最低のダブルスタンダードな亜人である...",
      "title": "ロシアがビットコインでガスを売ろうとするまで、誰もが分散化に賛成していました。今、このサブの人々は、\"ロシアがビットコインでお金を稼ぐより、お金を失って価格が暴落する方がましだ \"といったコメントで泣いているのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "首先，作为一个来自被制裁的第三世界国家的人，所有的制裁都会给一个国家带来饥荒。\n制裁所做的就是给一个国家带来饥荒。(看看叙利亚、委内瑞拉......等等）。\n所有那些认为自己站在道德制高点上呼吁让数百万人挨饿的人都是令人厌恶的双重标准。\n所有那些认为自己站在道德制高点上，呼吁让数百万人挨饿的人，都是令人厌恶的双重标准的亚人......",
      "title": "每个人都支持去中心化，直到俄罗斯想要出售天然气来换取比特币，现在这个子的人们都在为这个问题哭泣，他们的评论是 \"我宁愿赔钱，价格下跌，也不愿意俄罗斯从比特币中赚钱\""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，作爲一個來自被制裁的第三世界國家的人，所有的制裁都會給一個國家帶來饑荒。\n制裁所做的就是給一個國家帶來饑荒。(看看敘利亞、委內瑞拉......等等）。\n所有那些認爲自己站在道德制高點上呼籲讓數百萬人捱餓的人都是令人厭惡的雙重標準。\n所有那些認爲自己站在道德制高點上，呼籲讓數百萬人捱餓的人，都是令人厭惡的雙重標準的亞人......",
      "title": "每個人都支持去中心化，直到俄羅斯想要出售天然氣來換取比特幣，現在這個子的人們都在爲這個問題哭泣，他們的評論是 \"我寧願賠錢，價格下跌，也不願意俄羅斯從比特幣中賺錢\""
    }
  ]
}