{
  "author": "SweatyElk1",
  "the_new_excerpt": "What is DxSale?\n\nDxSale $SALE is a blockchain agnostic decentralized launchpad where anyone can\nlaunch their new project and the Devs have little to no control over launches.\nThey also have DxLocker which is another product on their platform where anyone\ncan lock their tokens, so devs can lock…",
  "original_created_utc": 1619077937,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "DxSaleとは？\n\nDxSale $SALEは、ブロックチェーンにとらわれない分散型ローンチパッドで、誰でも新しいプロジェクトを立ち上げることができます。\n誰でも新しいプロジェクトを立ち上げることができ、開発者はローンチをほとんどコントロールできません。\nまた、DxLockerという製品もあります。\nトークンをロックすることができ、開発者はトークンをロックすることができます。",
      "title": "SafeMoon、FairSafe、SafeMars、SafeFairMoon？これらのコインは何ですか？これらのコインはすべて、分散型ローンチパッドであるDxSaleから来ています。私は最初からこれを観察して見ていたので、ここですべてを説明します"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "什么是DxSale？\n\nDxSale $SALE是一个区块链不可知的去中心化发布平台，任何人都可以在这里发布他们的新项目，而开发者对发布项目几乎没有控制权。\n在这里，任何人都可以发布他们的新项目，而开发者对发布几乎没有任何控制。\n他们也有DxLocker，这是他们平台上的另一个产品，任何人都可以锁定他们的代币。\n可以锁定他们的代币，所以开发者可以锁定...",
      "title": "安全月、公平安全、安全火星、安全公平月？这些都是什么币！？这些币都来自于一个去中心化的发射台，DxSale，我从一开始就在观察和关注这个问题，我在这里解释这一切!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "什麼是DxSale？\n\nDxSale $SALE是一個區塊鏈不可知的去中心化發佈平臺，任何人都可以在這裏發佈他們的新項目，而開發者對發佈項目幾乎沒有控制權。\n在這裏，任何人都可以發佈他們的新項目，而開發者對發佈幾乎沒有任何控制。\n他們也有DxLocker，這是他們平臺上的另一個產品，任何人都可以鎖定他們的代幣。\n可以鎖定他們的代幣，所以開發者可以鎖定...",
      "title": "安全月、公平安全、安全火星、安全公平月？這些都是什麼幣！？這些幣都來自於一個去中心化的發射臺，DxSale，我從一開始就在觀察和關注這個問題，我在這裏解釋這一切!"
    }
  ],
  "title": "SafeMoon, FairSafe, SafeMars, SafeFairMoon? What are all these coins! These coins are all coming from a decentralized launchpad, DxSale, I’ve been observing and watching this from the beginning and I’m here to explain it all!",
  "created_utc": 1619091849,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>What is DxSale?</strong></p>\n\n<p>DxSale $SALE is a blockchain agnostic decentralized launchpad where anyone can launch their new project and the Devs have little to no control over launches. They also have DxLocker which is another product on their platform where anyone can lock their tokens, so devs can lock tokens on a vesting schedule, liquidity tokens can be locked, and if you wanted to prevent yourself from panic selling you could even lock your tokens. They also have plans to create farming and NFT platforms in the future. Their short term plans are a bridge to BSC, their token is live on BSC now and was originally only ether, once that is implemented they plan to launch DxSaleV3 to bring a ton of improvements for presales, then integrate $Zil to their platform. Currently they have Ether, BSC, and Matic/Polygon integrated.</p>\n\n<p><strong>Launches</strong></p>\n\n<p>There are two parts of the launchpad standard token launch or DeFi launches. Standard token launches are pre-defined contracts where DxSale retains ownership of the contract and compare to the DeFi launchpad are relatively safe. The action however is really going on in the DeFi launchpad. This is where anyone can launch their DeFi project and where we seen SafeMoon etc. launch. They can emergency cancel launches at certain points but the general gist is DYOR. Like I said I’ve been invested since early February back when only Ether was available and there were almost 0 launches. Then Binance smart chain launched. The devs implemented BSC onto their platform in a little over 2 weeks (Devs are great and why I am invested in their token). This platform has exploded, last I checked a couple days ago there have been over 1500 attempted launches with over 700 presales successfully launched.</p>\n\n<p><strong>DxSale&#39;s cut</strong></p>\n\n<p>DxSale takes a cut of every presale with a fee to list (.6 BNB) and they take a portion of every presale launch’s revenue (2%), and a portion of their tokens (2%). The original plan for DxSale was to stake $SALE (their token) and stakers would receive tokens from every presale. They are no longer doing that because as it is blockchain agnostic it was near impossible to implement and a lot of presales are dogshit. If they did do that I’d have 7million USD worth of SafeMoon tokens… so yea a little salty about that lol. Their plan now is to use the revenue from the platform to purchase DxSale tokens from pre-sale revenue and then buy-back $SALE and burn it, increasing token price from the buy and then deflating the supply. The crazy thing to me is SafeMoon reached 5billion market cap…. DxSale is at 6million. Projects are launching on DxSale and surpassing their market-cap in days, crazy times.</p>\n\n<p><strong>Scams Ponzi etc.</strong></p>\n\n<p>Now of course anything being decentralized means there is no central gatekeeper which I personally love. This also however introduces the risk of scams. Let’s define a couple types of scams.</p>\n\n<p>Rugpull – This has become a catch all term but has a specific definition. Rugpull is when whoever has access to the tokens in the liquidity pool pulls the liquidity from the pool. This leaves investors unable to sell the token as there is no liquidity. DxSale makes every sale lock liquidity to prevent this in DxLocker however this does not prevent the scams below. </p>\n\n<p>Dumping/exitscam – This is when Devs control a significant amount of tokens relative to the supply, the Devs will then wait for the price to pump on false promises and then proceed to dump all their tokens making money for themselves but then crashing the price </p>\n\n<p>Minting – This is coded into a smart contract, a minting function will allow a dev to mint as many tokens as they want which they can then sell. Basically like The Fed</p>\n\n<p><strong>SafeMoon</strong></p>\n\n<p>So SafeMoon launched back in March on DxSale and implemented an interesting feature. Originally RFIII introduced the concept of reflection, this is where transactions are taxed and you get tokens simply for holding your tokens in your wallet. This has been cloned by other tokens like SafeMoon, Grumpy Cat, etc. Then SafeMoon built on that concept and introduced their liquidity adding function. This adds an additional tax which will then take those tokens and place them in the contract, the contract at a certain level will then execute a sell order for half of those tokens, the BNB proceeds and the token will then be placed into the liquidity pool. This in effect gives investors increased confidence they will be able to sell their tokens as liquidity is added, and contributes to the deflationary metrics as these tokens are now only in the LP pool and not held by buyers/seller.</p>\n\n<p>SafeMoon ‘clones’ </p>\n\n<p>Like I said SafeMoon built off RFIII and launched on DxSale. This spawned a slew of SafeMoon clones where with little alterations besides supply, name, and taxing functions. These have all been launching on DxSale as they made the process extremely easy.</p>\n\n<p><strong>Are ALL these coins Ponzi Schemes?</strong></p>\n\n<p>It depends… There are a lot of tokens that are. SafeMoon for example has 0 product but plan to launch a DEX… in Q4. They have blown up mostly off stellar marketing from paid Youtubers, Tik Tokers, etc. There are SafeMoon clones that also have zero product but promises to build one. For example RiskHorizon was planning on building their own IDO launched and showed off a fancy UI. They however abandoned the project yesterday because they had the front end put together but could not find a Dev to actually build the backend… you know the most important part. There are others however that are actually trying to build something. </p>\n\n<p>SafeFairMoon for instance saw the nefarious activities of FairMoon and WarOnRugs, <a href=\"https://safefairmoon.medium.com/exposing-suspicious-transaction-activity-in-fairmoon-token-d989b5d019e7\">which you can read here in this medium article</a> and decided they can help make the community safer by doing audits. They do quick checks of contracts when they can and post comments on DxSale pages warning of scams, but they also do audits of other Tokens for projects that want to give their investors confidence and to point out any scam potential as we defined above. Their plan is to then use revenues to buy back their token and burn it increasing token value like DxSale’s new plan. (Full Disclosure I hold some)</p>\n\n<p><strong>Should I invest in presales?</strong></p>\n\n<p>I am not going to tell anyone what to do with their money. It is up to you whether or not you want to take the risk of investing in presales. The rewards could be staggering, or you could lose your money. As always the motto is DYOR. If you feel you’re not experienced enough to, don’t understand contract code, and have no clue what liquidity is or Tokenomics then I would recommend you stay far away. For those that do engage, happy hunting.</p>\n</div><!-- SC_ON -->",
  "score": 331,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/siiXLFK0sWw7n0YCfbhMyvaNmMmjk0xAfpANbF7TL9E.jpg?auto=webp&s=8565e041f172453ce2ef3f5707f6f1fd52f8238f",
          "width": 1141,
          "height": 566
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/siiXLFK0sWw7n0YCfbhMyvaNmMmjk0xAfpANbF7TL9E.jpg?width=108&crop=smart&auto=webp&s=0a9cc2b4c363db5d433f7f094adaa6d94729567e",
            "width": 108,
            "height": 53
          },
          {
            "url": "https://external-preview.redd.it/siiXLFK0sWw7n0YCfbhMyvaNmMmjk0xAfpANbF7TL9E.jpg?width=216&crop=smart&auto=webp&s=6cf6d94a6c4f3ab1500bfb5bfd5f643c20008bd2",
            "width": 216,
            "height": 107
          },
          {
            "url": "https://external-preview.redd.it/siiXLFK0sWw7n0YCfbhMyvaNmMmjk0xAfpANbF7TL9E.jpg?width=320&crop=smart&auto=webp&s=e775deaa18bb58b14cb6d43cdeffda05bd76a4f2",
            "width": 320,
            "height": 158
          },
          {
            "url": "https://external-preview.redd.it/siiXLFK0sWw7n0YCfbhMyvaNmMmjk0xAfpANbF7TL9E.jpg?width=640&crop=smart&auto=webp&s=d26c03b72221b77a131a69730e30bfc242914087",
            "width": 640,
            "height": 317
          },
          {
            "url": "https://external-preview.redd.it/siiXLFK0sWw7n0YCfbhMyvaNmMmjk0xAfpANbF7TL9E.jpg?width=960&crop=smart&auto=webp&s=726a4f549a23030daaffba16703fece1870d7384",
            "width": 960,
            "height": 476
          },
          {
            "url": "https://external-preview.redd.it/siiXLFK0sWw7n0YCfbhMyvaNmMmjk0xAfpANbF7TL9E.jpg?width=1080&crop=smart&auto=webp&s=b8ee03ce35170c34b7a570bcfb74d83e9fcfc573",
            "width": 1080,
            "height": 535
          }
        ],
        "variants": {},
        "id": "9LGfZs2A9TIIjZWIRaFShI3QPulzvb7W2PZXllkYIrg"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/mvzuv6/safemoon_fairsafe_safemars_safefairmoon_what_are/",
  "subreddit": "CryptoCurrency",
  "id": "mvzuv6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776207016
}