{
  "author": "GuardingxCross",
  "original_created_utc": 1652727247,
  "title": "Is our government really gonna just ignore 4 mass shootings in one weekend?",
  "created_utc": 1652735645,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m tired man honesty. I’m not anti-gun I’m not anti conservatives or any of that but I am anti people getting slaughtered for no reason.&lt;/p&gt;\n\n&lt;p&gt;This can’t be ignored and I’m just so afraid that it will be. &lt;/p&gt;\n\n&lt;p&gt;Most times a mass shooting happens it’s usually one at a time so Tucker Carlson has time to spin the story and make it sound okay and then congress can ignore it but times it’s 4. This CAN NOT be ignored…can it?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/TooAfraidToAsk/comments/ur350n/is_our_government_really_gonna_just_ignore_4_mass/",
  "subreddit": "TooAfraidToAsk",
  "id": "ur350n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m tired man honesty. I’m not anti-gun I’m not anti conservatives or any of\nthat but I am anti people getting slaughtered for no reason.\n\nThis can’t be ignored and I’m just so afraid that it will be.\n\nMost times a mass shooting happens it’s usually one at a time so Tucker Carlson\nhas time to spin…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "疲れた男正直者。私は銃反対派でもなければ、保守派でもない。\nしかし、理由もなく人々が虐殺されることには反対だ。\n\nこれは無視できないし、そうなることを恐れているんだ。\n\n銃乱射事件が起きるときはたいてい一人ずつなので、タッカー・カールソン\nを回転させる時間が...",
      "title": "週末に4件の銃乱射事件が起きたが、政府は本当に無視するつもりなのだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我已经厌倦了男人的诚实。我不反对枪支，也不反对保守派或任何其他东西。\n但我反对人们无缘无故地被屠杀。\n\n这不能被忽视，我只是很害怕会这样。\n\n大多数时候，大规模枪击事件发生时，通常是一次一个，所以塔克-卡尔森\n有时间来转...",
      "title": "我们的政府真的会对一个周末内发生的4起大规模枪击事件视而不见吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我已經厭倦了男人的誠實。我不反對槍支，也不反對保守派或任何其他東西。\n但我反對人們無緣無故地被屠殺。\n\n這不能被忽視，我只是很害怕會這樣。\n\n大多數時候，大規模槍擊事件發生時，通常是一次一個，所以塔克-卡爾森\n有時間來轉...",
      "title": "我們的政府真的會對一個週末內發生的4起大規模槍擊事件視而不見嗎？"
    }
  ]
}