{
  "author": "plokij24",
  "the_new_excerpt": "What people need to realise is that when you become aware of a pump and dump IT\nIS TOO LATE TO BUY.\n\nThe way a successful pump and dump works is this:\n\n 1. A very small group of people decide to PnD a coin.\n\n 2. This group of people buy significant amounts of said coin, usually without\n    moving…",
  "original_created_utc": 1612062968,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "人们需要意识到的是，当你意识到一个泵和倾倒的IT\n是为时已晚的购买。\n\n一个成功的抽水机的工作方式是这样的。\n\n 1. 一小群人决定PnD一个币。\n\n 2. 这群人购买了大量的所述硬币，通常不\n    动人...",
      "title": "只需简单的一步，就能将您的泵和倾倒损失降到最低!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "人們需要意識到的是，當你意識到一個泵和傾倒的IT\n是爲時已晚的購買。\n\n一個成功的抽水機的工作方式是這樣的。\n\n 1. 一小羣人決定PnD一個幣。\n\n 2. 這羣人購買了大量的所述硬幣，通常不\n    動人...",
      "title": "只需簡單的一步，就能將您的泵和傾倒損失降到最低!"
    }
  ],
  "title": "Minimize your pump and dump losses in one simple step!",
  "created_utc": 1612100236,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>What people need to realise is that when you become aware of a pump and dump IT IS TOO LATE TO BUY.</p>\n\n<p>The way a successful pump and dump works is this:</p>\n\n<ol>\n<li><p>A very small group of people decide to PnD a coin.</p></li>\n<li><p>This group of people buy significant amounts of said coin, usually without moving the price too much.</p></li>\n<li><p>This group creates hype around the coin and convinces people that &#39;it will be the next to pump&#39; or even give a specific time (which is one of the most ridiculous things to believe anyway).</p></li>\n<li><p>As the hype builds people try to ride the pump, buying at inflated prices.</p></li>\n<li><p>The same people who organised the PnD have already started selling their coins. The coins YOU are buying are them selling at the inflated price.</p></li>\n<li><p>By the time the coin hits the top, every single coin from every single person who organised it has been sold... to you.</p></li>\n<li><p>You&#39;re left with bags, desperately selling while the price tanks.</p></li>\n<li><p>Oh what&#39;s this? The price has started to climb again! This is due to other bag holders desperately creating hype so they can get out with smaller losses.</p></li>\n<li><p>Oh the price is dumping even harder now and you got greedy. You&#39;ve now lost even more and not even to the original organisers. They&#39;re long gone.</p></li>\n</ol>\n\n<p>So please remember, if you know of a pump and dump you have long missed the boat.</p>\n</div><!-- SC_ON -->",
  "score": 294,
  "permalink": "/r/CryptoCurrency/comments/l9368k/minimize_your_pump_and_dump_losses_in_one_simple/",
  "subreddit": "CryptoCurrency",
  "id": "l9368k",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518528886
}