{
  "author": "UncleDrip2000",
  "original_created_utc": 1643252807,
  "title": "I got half my family into crypto before the crash. This is my story.",
  "created_utc": 1643265694,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is a &lt;strong&gt;true&lt;/strong&gt; story.&lt;/p&gt;\n\n&lt;p&gt;Ah yes, the holidays. A time for feasting, partying, reconnecting, and yes, &lt;strong&gt;financial advice&lt;/strong&gt;. After being in crypto for a few years, I decided this holiday season was the time I would finally come out of the crypto closet to my family. I told them about the fundamentals of DeFi. I told them about specific projects I am invested in. I suggested to them to invest also.&lt;/p&gt;\n\n&lt;p&gt;Well, some of them did invest, and they’ve been staring at the same red dildos for the past month as the rest of us. Having bought in before the crash and with no bear market experience, some of them even sold at a loss. Tbh I think they aped with all their holiday checks and a few months savings.&lt;/p&gt;\n\n&lt;p&gt;The other half who didn’t buy refrained from doing so because they think I’m an idiot for buying crypto. It’s fair to say they think I’m more of an idiot now.&lt;/p&gt;\n\n&lt;p&gt;TL/DR: The half of my family who bought in wants to burn my house down, and the other half thinks I’m a clown with my magic internet money. Hooray for me.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 379,
  "permalink": "/r/CryptoCurrency/comments/sdo6aw/i_got_half_my_family_into_crypto_before_the_crash/",
  "subreddit": "CryptoCurrency",
  "id": "sdo6aw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "This is a true story.\n\nAh yes, the holidays. A time for feasting, partying, reconnecting, and yes,\nfinancial advice. After being in crypto for a few years, I decided this holiday\nseason was the time I would finally come out of the crypto closet to my family.\nI told them about the fundamentals of…"
}