{
  "author": "UncleDrip2000",
  "original_created_utc": 1643252807,
  "title": "I got half my family into crypto before the crash. This is my story.",
  "created_utc": 1643265694,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is a &lt;strong&gt;true&lt;/strong&gt; story.&lt;/p&gt;\n\n&lt;p&gt;Ah yes, the holidays. A time for feasting, partying, reconnecting, and yes, &lt;strong&gt;financial advice&lt;/strong&gt;. After being in crypto for a few years, I decided this holiday season was the time I would finally come out of the crypto closet to my family. I told them about the fundamentals of DeFi. I told them about specific projects I am invested in. I suggested to them to invest also.&lt;/p&gt;\n\n&lt;p&gt;Well, some of them did invest, and they’ve been staring at the same red dildos for the past month as the rest of us. Having bought in before the crash and with no bear market experience, some of them even sold at a loss. Tbh I think they aped with all their holiday checks and a few months savings.&lt;/p&gt;\n\n&lt;p&gt;The other half who didn’t buy refrained from doing so because they think I’m an idiot for buying crypto. It’s fair to say they think I’m more of an idiot now.&lt;/p&gt;\n\n&lt;p&gt;TL/DR: The half of my family who bought in wants to burn my house down, and the other half thinks I’m a clown with my magic internet money. Hooray for me.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 379,
  "permalink": "/r/CryptoCurrency/comments/sdo6aw/i_got_half_my_family_into_crypto_before_the_crash/",
  "subreddit": "CryptoCurrency",
  "id": "sdo6aw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "This is a true story.\n\nAh yes, the holidays. A time for feasting, partying, reconnecting, and yes,\nfinancial advice. After being in crypto for a few years, I decided this holiday\nseason was the time I would finally come out of the crypto closet to my family.\nI told them about the fundamentals of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは実話です。\n\nああ、そうだ、休日だ。ごちそうを食べ、パーティーをし、人と人とのつながりを取り戻す時、そして、そう。\n経済的なアドバイス 数年間暗号に携わった後、私はこのホリデーに決心しました。\nこの時期、私はついに暗号のクローゼットから家族の前に姿を現すことになりました。\n私は、彼らに暗号の基礎について話した...",
      "title": "私は暴落前に家族の半分を暗号に入れました。これは私の物語です"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是一个真实的故事。\n\n啊，是的，假期。这是一个盛宴、聚会、重新联系的时刻，也是。\n金融建议。在做了几年的加密货币后，我决定在这个节日里\n季节是我最终向我的家人走出加密货币柜的时候。\n我向他们讲述了加密货币的基本原理。",
      "title": "我让我的一半家人在崩盘前进入加密货币。这是我的故事。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是一個真實的故事。\n\n啊，是的，假期。這是一個盛宴、聚會、重新聯繫的時刻，也是。\n金融建議。在做了幾年的加密貨幣後，我決定在這個節日裏\n季節是我最終向我的家人走出加密貨幣櫃的時候。\n我向他們講述了加密貨幣的基本原理。",
      "title": "我讓我的一半家人在崩盤前進入加密貨幣。這是我的故事。"
    }
  ]
}