{
  "author": "CT1914Clutch",
  "original_created_utc": 1640843297,
  "title": "Should I feel bad about saying no when asked to work on days I’m not scheduled?",
  "created_utc": 1640878472,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey everyone &lt;/p&gt;\n\n&lt;p&gt;So I started my first job at a major drug store three months ago. With the holidays being extremely busy for us I’ve had more hours than I normally would, and I would be asked a few times a week to come in extra days when someone else calls out or they need extra help. I actually volunteered to stay an extra hour while working the night shift when someone else went home sick (not Covid related). &lt;/p&gt;\n\n&lt;p&gt;The last month has been extremely overwhelming for me, as on top of an extremely busy work I just got through finals for college. Now that college is over, they are starting to give me many more hours than I would normally work, even scheduling me on the day I said I couldn’t work when I had classes. &lt;/p&gt;\n\n&lt;p&gt;Due to being really busy, I’ve been asked to come in a lot more on days I’m not scheduled for. I last worked Monday morning (my first opening shift as I usually work nights) and I was asked by the manager to work Tuesday from 7AM-3PM. I said yes out of the fear of upsetting the manager but, still feeling overwhelmed from the last few weeks and really looking forward to the three days off I was supposed to have this week, I asked a few minutes later if I could give that shift a pass, and she seemed pretty upset. &lt;/p&gt;\n\n&lt;p&gt;This isn’t the first time I’ve turned down a request to come in when I wasn’t scheduled. I said no when I was asked to work on a day I had a final, and the day after I got my booster when I wasn’t feeling well the morning after, and also said no when I was asked to work an extra hour on Christmas even and the day after Christmas.&lt;/p&gt;\n\n&lt;p&gt;I’m worried that saying no too often to coming in on days I’m not scheduled for might make me look bad to my mangers and I feel like I’m letting them down when they need me. They have been extremely flexible with my schedule so I also feel really bad. Should I start saying yes more often and should I be feeling bad about this? I’d love to hear some different perspectives. Thanks!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/rrtzoh/should_i_feel_bad_about_saying_no_when_asked_to/",
  "subreddit": "TooAfraidToAsk",
  "id": "rrtzoh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hey everyone\n\nSo I started my first job at a major drug store three months ago. With the\nholidays being extremely busy for us I’ve had more hours than I normally would,\nand I would be asked a few times a week to come in extra days when someone else\ncalls out or they need extra help. I actually…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。\n\nというわけで、3ヶ月前に大手ドラッグストアで初仕事を始めました。この\nこの連休は非常に忙しく、普段より勤務時間が長くなってしまいました。\nまた、週に数回、誰かの都合で臨時出勤をお願いされることがありました。\nという声が聞こえてきそうです。実は...",
      "title": "予定がない日に仕事を頼まれたとき、断るのは気が引けるのですが？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好\n\n三个月前，我在一家大型药店开始了我的第一份工作。随着\n我的工作时间比平时要长。\n我每周都会被要求加班几天，当别人打电话给我或他们需要我的时候。\n当有人打电话给我或他们需要额外的帮助时，我会被要求每周多来几天。实际上，我...",
      "title": "当有人要求我在没有安排的日子里工作时，我是否应该为拒绝而感到难过？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好\n\n三個月前，我在一家大型藥店開始了我的第一份工作。隨着\n我的工作時間比平時要長。\n我每週都會被要求加班幾天，當別人打電話給我或他們需要我的時候。\n當有人打電話給我或他們需要額外的幫助時，我會被要求每週多來幾天。實際上，我...",
      "title": "當有人要求我在沒有安排的日子裏工作時，我是否應該爲拒絕而感到難過？"
    }
  ]
}