{
  "author": "afriendlystone",
  "original_created_utc": 1631787650,
  "title": "Every time i see a token with a price like 0.0000006 or something like that i run away ,do you too?",
  "created_utc": 1631818000,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Projects with quinitllion tokens seems so fishy mostly for one main reason - they lure in people who know jackshit about investing and use big numbers to make them think they actually have a lot of it .</p>\n\n<p>I&#39;ve seen this with lots of projects the last few From SHIB to Shield network. Big numbers are big red alerts to stay away from those projects. I&#39;d rather have 0.1 coins worth a dollar than 100000000000 coins worth the same.</p>\n\n<p>Do you ? Do big numbers entice you ?If yes why do you try to lie to yourself they are never getting to 0.01 a coin.</p>\n</div><!-- SC_ON -->",
  "score": 175,
  "permalink": "/r/CryptoCurrency/comments/ppakcp/every_time_i_see_a_token_with_a_price_like/",
  "subreddit": "CryptoCurrency",
  "id": "ppakcp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Projects with quinitllion tokens seems so fishy mostly for one main reason -\nthey lure in people who know jackshit about investing and use big numbers to\nmake them think they actually have a lot of it .\n\nI've seen this with lots of projects the last few From SHIB to Shield network.\nBig numbers are…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "キニトリオントークンを使ったプロジェクトが怪しいのは、主に次の1つの理由からです。\n投資について何も知らない人たちを誘い、大きな数字を使って\n投資について全く知らない人を誘い、大きな数字を使って、実際に大量に持っていると思わせる。\n\nここ数年、SHIBからShield Networkまで、多くのプロジェクトでこれを見てきました。\n大きな数字は...",
      "title": "私は0.0000006などの価格のトークンを見るたびに逃げ出してしまいますが、あなたもそうですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有五角大楼代币的项目看起来很可疑，主要有一个原因 --\n他们引诱那些对投资一窍不通的人，用大的数字让他们以为自己有很多钱。\n让他们以为自己真的有很多钱。\n\n在过去的几个项目中，我已经看到了这一点，从SHIB到Shield network。\n大数字是...",
      "title": "每当我看到价格为0.0000006之类的代币时，我就会逃跑，你也是吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有五角大樓代幣的項目看起來很可疑，主要有一個原因 --\n他們引誘那些對投資一竅不通的人，用大的數字讓他們以爲自己有很多錢。\n讓他們以爲自己真的有很多錢。\n\n在過去的幾個項目中，我已經看到了這一點，從SHIB到Shield network。\n大數字是...",
      "title": "每當我看到價格爲0.0000006之類的代幣時，我就會逃跑，你也是嗎？"
    }
  ]
}