{
  "author": "Set1Less",
  "original_created_utc": 1643651554,
  "title": "GoFundMe has frozen $4.5 Million in funds collected by protesting Canadian Truckers. Why anti-government protestors use centralised censorable payment systems over decentralised platforms is beyond me",
  "created_utc": 1643664799,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Canadian trucker convoy raised over $4.5m but all of that was frozen by GoFundMe.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://vancouver.citynews.ca/2022/01/25/canada-trucker-convoy-gofundme-frozen/\"&gt;https://vancouver.citynews.ca/2022/01/25/canada-trucker-convoy-gofundme-frozen/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Centralised payment rails can easily be censored by governments. Using them is literally asking to get de-platformed. Not just this time around, GoFundMe has a history of freezing users funds for a number of reasons. Its just similar to PayPal where you have to jump through hoops just to access the funds sent for your cause. They may not overtly admit it, but a company like GoFundMe must be under a lot of pressure by governments to freeze funds that are meant for anti-government protestors. &lt;/p&gt;\n\n&lt;p&gt;If crypto is too volatile for them, they can use decentralised stablecoins to raise funds. Something like DAI can be most useful in this scenario - it cannot be frozen, and can be easily exchanged for fiat. Protests are completely legal in most jurisdictions and these protestors have said they will be using the funds for fuel, food and lodgings in taking part in the convoy - all of which is legal. With a crypto credit card, they can spend their DAI or any other coin for all their activities. &lt;/p&gt;\n\n&lt;p&gt;Why they dont prefer using crypto payment rails over GoFundMe is bewildering. Maybe crypto platforms need more awareness.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 436,
  "permalink": "/r/CryptoCurrency/comments/sh7cks/gofundme_has_frozen_45_million_in_funds_collected/",
  "subreddit": "CryptoCurrency",
  "id": "sh7cks",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Canadian trucker convoy raised over $4.5m but all of that was frozen by\nGoFundMe.\n\nhttps://vancouver.citynews.ca/2022/01/25/canada-trucker-convoy-gofundme-frozen/\n\nCentralised payment rails can easily be censored by governments. Using them is\nliterally asking to get de-platformed. Not just this…"
}