{
  "author": "Set1Less",
  "original_created_utc": 1643651554,
  "title": "GoFundMe has frozen $4.5 Million in funds collected by protesting Canadian Truckers. Why anti-government protestors use centralised censorable payment systems over decentralised platforms is beyond me",
  "created_utc": 1643664799,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Canadian trucker convoy raised over $4.5m but all of that was frozen by GoFundMe.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://vancouver.citynews.ca/2022/01/25/canada-trucker-convoy-gofundme-frozen/\"&gt;https://vancouver.citynews.ca/2022/01/25/canada-trucker-convoy-gofundme-frozen/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Centralised payment rails can easily be censored by governments. Using them is literally asking to get de-platformed. Not just this time around, GoFundMe has a history of freezing users funds for a number of reasons. Its just similar to PayPal where you have to jump through hoops just to access the funds sent for your cause. They may not overtly admit it, but a company like GoFundMe must be under a lot of pressure by governments to freeze funds that are meant for anti-government protestors. &lt;/p&gt;\n\n&lt;p&gt;If crypto is too volatile for them, they can use decentralised stablecoins to raise funds. Something like DAI can be most useful in this scenario - it cannot be frozen, and can be easily exchanged for fiat. Protests are completely legal in most jurisdictions and these protestors have said they will be using the funds for fuel, food and lodgings in taking part in the convoy - all of which is legal. With a crypto credit card, they can spend their DAI or any other coin for all their activities. &lt;/p&gt;\n\n&lt;p&gt;Why they dont prefer using crypto payment rails over GoFundMe is bewildering. Maybe crypto platforms need more awareness.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 436,
  "permalink": "/r/CryptoCurrency/comments/sh7cks/gofundme_has_frozen_45_million_in_funds_collected/",
  "subreddit": "CryptoCurrency",
  "id": "sh7cks",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Canadian trucker convoy raised over $4.5m but all of that was frozen by\nGoFundMe.\n\nhttps://vancouver.citynews.ca/2022/01/25/canada-trucker-convoy-gofundme-frozen/\n\nCentralised payment rails can easily be censored by governments. Using them is\nliterally asking to get de-platformed. Not just this…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "カナダのトラック運転手の輸送隊は450万ドル以上を集めたが、そのすべてが凍結された。\nGoFundMeです。\n\nhttps://vancouver.citynews.ca/2022/01/25/canada-trucker-convoy-gofundme-frozen/\n\n中央集権的な決済レールは、政府によって簡単に検閲されます。それを利用することは\n文字通り、脱プラットフォームを要求しているのです。これだけではありません...",
      "title": "GoFundMeは、カナダのトラック運転手に抗議して集められた450万ドルの資金を凍結しました。なぜ反政府デモ参加者が分散型プラットフォームではなく、中央集権的な検閲可能な決済システムを使うのか、私には理解できない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "加拿大卡车司机车队筹集了超过450万美元的资金，但所有这些资金都被冻结了。\nGoFundMe冻结。\n\nhttps://vancouver.citynews.ca/2022/01/25/canada-trucker-convoy-gofundme-frozen/\n\n集中式支付轨道很容易被政府审查。使用它们就是\n字面意思是要求被取消平台。不仅仅是这个...",
      "title": "GoFundMe已经冻结了抗议的加拿大卡车司机所募集的450万美元资金。我不明白为什么反政府抗议者使用可审查的中心化支付系统而不是去中心化的平台"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "加拿大卡車司機車隊籌集了超過450萬美元的資金，但所有這些資金都被凍結了。\nGoFundMe凍結。\n\nhttps://vancouver.citynews.ca/2022/01/25/canada-trucker-convoy-gofundme-frozen/\n\n集中式支付軌道很容易被政府審查。使用它們就是\n字面意思是要求被取消平臺。不僅僅是這個...",
      "title": "GoFundMe已經凍結了抗議的加拿大卡車司機所募集的450萬美元資金。我不明白爲什麼反政府抗議者使用可審查的中心化支付系統而不是去中心化的平臺"
    }
  ]
}