{
  "author": "BushyOreo",
  "original_created_utc": 1647973189,
  "title": "Coinbase add a subscription service. 0 trading fees + $1 million account protection, and 24/7 phone support",
  "created_utc": 1647988947,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Just logged into my app to check the charts like I do every 5 minutes and this just came up. &lt;/p&gt;\n\n&lt;p&gt;Currently it is in beta and not offered to all users. It is a subscription service that costs $29.99/month and will waive all trading fees on the app(still could be effected by spread) and it will protect your account against unauthorized access up to $1,000,000 worth. It also says 24/7 customer phone support too.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t see myself using this since I hardly buy on the app and use cb pro for my crypto buys. Even with the 0.5% fee and spread fee I would need to be buying at least $6000 in non stablecoin crypto to make it worth the monthly subscription fee.&lt;/p&gt;\n\n&lt;p&gt;The added protection is a good selling point though that makes me consider it since I mainly keep about $2000 in USDC on there to pay my bills with their coinbase card for the 4% cashback. Knowing that my card/funds are safe from unauthorized hacks is nice. I&amp;#39;m not one to be hacked though and haven&amp;#39;t had any issues with my CB account in the 4-5 years I have had it and the 9~ months I have had the card&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 305,
  "permalink": "/r/CryptoCurrency/comments/tk9e7s/coinbase_add_a_subscription_service_0_trading/",
  "subreddit": "CryptoCurrency",
  "id": "tk9e7s",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Just logged into my app to check the charts like I do every 5 minutes and this\njust came up.\n\nCurrently it is in beta and not offered to all users. It is a subscription\nservice that costs $29.99/month and will waive all trading fees on the app(still\ncould be effected by spread) and it will protect…"
}