{
  "author": "blindnarcissus",
  "original_created_utc": 1624321012,
  "title": "Is there a name for this experience?",
  "created_utc": 1624358362,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I don’t know where else to ask so bear with me please.</p>\n\n<p>When I was really young, I used to intentionally put myself into this mental state.</p>\n\n<p>I used to start looking around the room and ask “what is this?” And if I did it repeatedly, the object would look absurd, meaningless, and eerie. If I could do this a couple of times in a row, I would experience this strange feeling of everything being alien and confusing. The only way I know how to describe it is perhaps dissociation/deconditioning caused by deep reflection on the absurd, though it’s not exactly the same. </p>\n\n<p>It got progressively harder to get in that state as I grew older. </p>\n\n<p>I’m wondering, is there a name for this phenomenon? Are there any philosophers/psychologists that explored it?</p>\n\n<p>Edit: I should add that I did it because I was fascinated by the feeling and how elusive it was. Every time I tried to make it last longer. It wasn’t driven by trauma or stress.</p>\n\n<p>Edit 2: The reason why I don’t think this is  a type of dissociation is because things continue to be “real”. Just nameless. Absurd. Alien.</p>\n\n<p>Edit 3: the post is locked now but I wanted to share something that was send to me via DM for those interested: “Jamais vu”</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/askphilosophy/comments/o59km7/is_there_a_name_for_this_experience/",
  "subreddit": "askphilosophy",
  "id": "o59km7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I don’t know where else to ask so bear with me please.\n\nWhen I was really young, I used to intentionally put myself into this mental\nstate.\n\nI used to start looking around the room and ask “what is this?” And if I did it\nrepeatedly, the object would look absurd, meaningless, and eerie. If I could…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "他にどこに聞けばいいのかわからないので、我慢してください。\n\n私は若い頃、意図的に自分をこのような精神状態にしていました。\n状態にしていました。\n\n部屋の中を見回して \"これは何だろう？\"と考えていました。それを繰り返していると\n繰り返すと、その物体は不条理で無意味で不気味なものに見えてくる。できれば・・・。",
      "title": "この経験に名前はありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不知道还能在哪里问，所以请忍耐一下。\n\n在我非常年轻的时候，我曾经故意让自己进入这种精神状态\n状态。\n\n我习惯于开始环顾房间，问 \"这是什么\"？如果我这样做\n反复这样做，这个物体就会看起来很荒谬，毫无意义，而且很阴森。如果我可以...",
      "title": "这种经历有什么名称吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不知道還能在哪裏問，所以請忍耐一下。\n\n在我非常年輕的時候，我曾經故意讓自己進入這種精神狀態\n狀態。\n\n我習慣於開始環顧房間，問 \"這是什麼\"？如果我這樣做\n反覆這樣做，這個物體就會看起來很荒謬，毫無意義，而且很陰森。如果我可以...",
      "title": "這種經歷有什麼名稱嗎？"
    }
  ]
}