{
  "author": "saxesun",
  "the_new_excerpt": "A girl said that by my age (28) i should have something to show for it (a house,\ngood job, etc.) but that I don’t offer enough stability for her and so she\ndoesn’t want to keep up a relationship. (we dated for about 2 months) I’m not\nsure how to take this, it stings and it’s motivating at the same…",
  "original_created_utc": 1610712354,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "一个女孩说，到了我这个年龄（28岁），我应该有一些东西可以展示（房子。\n好的工作等），但我没有为她提供足够的稳定性，所以她。\n不想再维持一段关系。(我们交往了大约2个月)我不是。\n确定如何采取这个，它的刺痛和它的激励在同一... ...",
      "title": "你怎么回应那些因为你不提供 \"经济保障 \"而不愿意和你约会的女孩？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "一個女孩說，到了我這個年齡（28歲），我應該有一些東西可以展示（房子。\n好的工作等），但我沒有爲她提供足夠的穩定性，所以她。\n不想再維持一段關係。(我們交往了大約2個月)我不是。\n確定如何採取這個，它的刺痛和它的激勵在同一... ...",
      "title": "你怎麼迴應那些因爲你不提供 \"經濟保障 \"而不願意和你約會的女孩？"
    }
  ],
  "title": "How do you respond to girls that wouldn’t date you because you don’t offer “financial security” ?",
  "created_utc": 1610730161,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A girl said that by my age (28) i should have something to show for it (a house, good job, etc.) but that I don’t offer enough stability for her and so she doesn’t want to keep up a relationship. (we dated for about 2 months) I’m not sure how to take this, it stings and it’s motivating at the same time but i don’t know if i would ever want to date a girl just because i can offer her money, or because i have my life together in some type of way that she expects but at the same time i don’t want to date a girl that isn’t working hard and enjoying life (someone who inspires me). idk kinda lost on this one. i have a vision, i don’t make a lot right now as a snowboard instructor (covid)but i speak four languages, i went back to college, and i am studying for my real estate license, i’m a musician, and i try to do good things for other people. idk is having a good job a fair standard when looking for a mate?</p>\n</div><!-- SC_ON -->",
  "score": 128,
  "permalink": "/r/AskMen/comments/kxt9oo/how_do_you_respond_to_girls_that_wouldnt_date_you/",
  "subreddit": "AskMen",
  "id": "kxt9oo",
  "is_self": true,
  "media": null,
  "is_video": false
}