{
  "author": "mightyTheowl",
  "original_created_utc": 1653912974,
  "title": "Do you open people's fridges when you're visiting their house?",
  "created_utc": 1653938033,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Growing up my mother taught me that if my visiting someone&amp;#39;s home, to never open and grab stuff from their fridge, because it could be considered rude. However, as an adult, I realize not everyone was taught this rule. &lt;/p&gt;\n\n&lt;p&gt;My friend, for example, any time she&amp;#39;s at my place, she has no issues looking through my fridge for something to eat. The first time she did this, I was a bit shocked because honestly I thought it was a sign of lack of manners. Likewise, any time I&amp;#39;m at her place, and I&amp;#39;m hungry, she orders me to search her fridge, which is always a little odd for me given my upbringing. &lt;/p&gt;\n\n&lt;p&gt;Were you guys taught the same thing growing up? Or, do you have no issues searching people&amp;#39;s fridges?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/TooAfraidToAsk/comments/v0ywxx/do_you_open_peoples_fridges_when_youre_visiting/",
  "subreddit": "TooAfraidToAsk",
  "id": "v0ywxx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Growing up my mother taught me that if my visiting someone's home, to never open\nand grab stuff from their fridge, because it could be considered rude. However,\nas an adult, I realize not everyone was taught this rule.\n\nMy friend, for example, any time she's at my place, she has no issues…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "子供の頃、母から「人の家を訪ねるときは、絶対に家のものを開けてはいけない」と教えられました。\n冷蔵庫の中のものを取ってくるのは失礼にあたるから。しかし\n大人になってから、誰もがこのルールを教わっているわけではないことに気づきました。\n\n私の友人は、例えば、彼女が私の場所にいるときはいつでも、彼女は何の問題もありません...",
      "title": "人の家にお邪魔した時に、人の冷蔵庫を開けるんですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在我的成长过程中，我的母亲教导我，如果我去拜访某人的家，千万不要打开\n并从他们的冰箱里拿东西，因为这可能被认为是不礼貌的。然而。\n作为一个成年人，我意识到并非每个人都被教导过这一规则。\n\n例如，我的朋友，任何时候她在我的地方，她都没有问题......",
      "title": "你在访问别人家的时候会打开他们的冰箱吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在我的成長過程中，我的母親教導我，如果我去拜訪某人的家，千萬不要打開\n並從他們的冰箱裏拿東西，因爲這可能被認爲是不禮貌的。然而。\n作爲一個成年人，我意識到並非每個人都被教導過這一規則。\n\n例如，我的朋友，任何時候她在我的地方，她都沒有問題......",
      "title": "你在訪問別人家的時候會打開他們的冰箱嗎？"
    }
  ]
}