{
  "author": "dutchyfke",
  "original_created_utc": 1635079897,
  "title": "When do we consider something colonization and when is it territorial expansion?",
  "created_utc": 1635132149,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is something I&#39;ve been thinking about for a while as we&#39;ve been discussing colonization in my classes. We don&#39;t typically see the westward expansion of the United States as colonizing, but as a territorial expansion, same with Germany pushing eastward in World War II. So are there specific guidelines to what is colonizing and what is territorial expansion? Especially since the occupation of the Phillipines by the US is sometimes seen as colonizing, but is that not just a further extension westwards? Is it only colonization if you need a boat to get there?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/qerk4l/when_do_we_consider_something_colonization_and/",
  "subreddit": "AskHistorians",
  "id": "qerk4l",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is something I've been thinking about for a while as we've been discussing\ncolonization in my classes. We don't typically see the westward expansion of the\nUnited States as colonizing, but as a territorial expansion, same with Germany\npushing eastward in World War II. So are there specific…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは私が以前から考えていたことです。\n植民地化について授業で議論していて、ずっと考えていたことです。私たちは通常、アメリカの西への進出を植民地化とは見ていません。\n第二次世界大戦でドイツが東進したのと同じように、アメリカの西進は植民地化ではなく、領土の拡大だと考えます。\n第二次世界大戦でドイツが東に向かって突き進んだのと同じです。では、具体的にどのような...",
      "title": "どのような場合に植民地化と考え、どのような場合に領土拡大と考えるのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是我想了很久的事情，因为我们一直在讨论\n在我的课堂上讨论殖民化问题时，我一直在思考这个问题。我们通常不会把美国的西进扩张视为\n我们通常不把美国的西扩看作是殖民化，而是看作是领土扩张。\n在第二次世界大战中向东推进。那么，是否有具体的...",
      "title": "我们什么时候认为是殖民化，什么时候认为是领土扩张？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是我想了很久的事情，因爲我們一直在討論\n在我的課堂上討論殖民化問題時，我一直在思考這個問題。我們通常不會把美國的西進擴張視爲\n我們通常不把美國的西擴看作是殖民化，而是看作是領土擴張。\n在第二次世界大戰中向東推進。那麼，是否有具體的...",
      "title": "我們什麼時候認爲是殖民化，什麼時候認爲是領土擴張？"
    }
  ]
}