{
  "author": "juliamhass",
  "original_created_utc": 1625242620,
  "title": "How did the sidewalk lemonade stand become a childhood staple?",
  "created_utc": 1625276491,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So this is a question I&#39;ve had for ages and have never found a proper answer to: when did lemonade stands become a sort of cliché thing kids did to earn pocket change, and how? I can find lots about the history of lemonade stands being an industry that popped up in cities for adults or young immigrants when they left school, the way hotdog or roasted nut or ice cream stands did. I also can find a lot on the logic of why lemonade stands - lemonade is cheap and easy for kids to make, even without adult supervision. My question is, how did it move from an adult or teenaged thing in urban areas to the suburban or even rural staple of a sidewalk and posterboard sign that we think of today? How did it become a trope in children&#39;s books (I&#39;m a library assistant and there are SO MANY books about lemonade stands) or Peanuts strips or a meme about childhood entrepreneurship?</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/ocdg6t/how_did_the_sidewalk_lemonade_stand_become_a/",
  "subreddit": "AskHistorians",
  "id": "ocdg6t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So this is a question I've had for ages and have never found a proper answer to:\nwhen did lemonade stands become a sort of cliché thing kids did to earn pocket\nchange, and how? I can find lots about the history of lemonade stands being an\nindustry that popped up in cities for adults or young…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは私が長年抱いてきた疑問で、適切な答えを見つけられずにいました。\nレモネードスタンドはいつから、子供たちがお小遣いを稼ぐための決まりきったものになったのでしょうか？\nいつ、どのようにして？レモネードスタンドが、都市部に出現した小遣い稼ぎの産業であったという歴史については、たくさんの情報があります。\nレモネードスタンドの歴史については、大人や若者のために都市部に出現した産業であることはたくさんありますが...。",
      "title": "歩道のレモネードスタンドは、どのようにして子供の頃の定番になったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是一个我想了很久的问题，但一直没有找到一个合适的答案。\n柠檬水摊什么时候成了孩子们为赚取零花钱而做的一种陈词滥调的事情？\n赚取零花钱，是怎么做到的？我可以找到很多关于柠檬水摊的历史。\n我可以找到很多关于柠檬水摊的历史，它是在城市中为成年人或年轻人而出现的行业。",
      "title": "人行道上的柠檬水摊怎么会成为童年的主食？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是一個我想了很久的問題，但一直沒有找到一個合適的答案。\n檸檬水攤什麼時候成了孩子們爲賺取零花錢而做的一種陳詞濫調的事情？\n賺取零花錢，是怎麼做到的？我可以找到很多關於檸檬水攤的歷史。\n我可以找到很多關於檸檬水攤的歷史，它是在城市中爲成年人或年輕人而出現的行業。",
      "title": "人行道上的檸檬水攤怎麼會成爲童年的主食？"
    }
  ]
}