{
  "author": "Gordon_Law",
  "the_new_excerpt": "Hi Reddit, I'm Andrew Gordon, a tax attorney & CPA who's been practicing\ncryptocurrency tax law since 2014. I help investors with their tax returns,\naudit representation, and tax debt resolution, as well as helping businesses\nadopt and report crypto. \n\nYou may have seen or heard that the 2020 tax…",
  "original_created_utc": 1611748843,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "嗨，Reddit，我是安德鲁-戈登，是一名税务律师和注册会计师，他一直在执业。\n自2014年以来，加密货币税法。我帮助投资者进行税务申报。\n审计代理、税务债务解决，以及帮助企业解决以下问题\n采用并报告加密。 \n\n你可能已经看到或听说，2020年的税...",
      "title": "我是一名加密税务律师。AMA今天，1月27日，美国东部时间上午10点开始!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嗨，Reddit，我是安德魯-戈登，是一名稅務律師和註冊會計師，他一直在執業。\n自2014年以來，加密貨幣稅法。我幫助投資者進行稅務申報。\n審計代理、稅務債務解決，以及幫助企業解決以下問題\n採用並報告加密。 \n\n你可能已經看到或聽說，2020年的稅...",
      "title": "我是一名加密稅務律師。AMA今天，1月27日，美國東部時間上午10點開始!"
    }
  ],
  "title": "I'm a crypto tax attorney. AMA today, Jan. 27, starting at 10 am EST!",
  "created_utc": 1611796210,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi Reddit, I&#39;m Andrew Gordon, a tax attorney &amp; CPA who&#39;s been practicing cryptocurrency tax law since 2014. I help investors with their tax returns, audit representation, and tax debt resolution, as well as helping businesses adopt and report crypto. </p>\n\n<p>You may have seen or heard that the 2020 tax return has a <a href=\"https://gordonlawltd.com/1040-crypto-question/\">yes-or-no question about cryptocurrency</a> on the very front page. This is just one of SEVERAL measures the IRS has taken in recent years to ensure crypto income is accurately reported.</p>\n\n<p>But crypto tax returns can get really complicated. That&#39;s why I&#39;m here. Ask me anything about cryptocurrency tax law in the United States!</p>\n\n<p><a href=\"https://preview.redd.it/vwomwn327vd61.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=f797c0f2687c806b69e7637fe7566f67dd5db28d\">https://preview.redd.it/vwomwn327vd61.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=f797c0f2687c806b69e7637fe7566f67dd5db28d</a></p>\n\n<p><em>Disclaimer: Information contained in this post and in the comments is intended for general informational and educational purposes and does not constitute legal advice. Contact a tax attorney for legal advice regarding your specific situation.</em></p>\n</div><!-- SC_ON -->",
  "score": 168,
  "permalink": "/r/CryptoCurrency/comments/l631oq/im_a_crypto_tax_attorney_ama_today_jan_27/",
  "subreddit": "CryptoCurrency",
  "id": "l631oq",
  "is_self": true,
  "media": null,
  "is_video": false
}