{
  "author": "Defiant_Chemistry966",
  "the_new_excerpt": "The name of this subreddit is WallStreetBETS. Not WallStreet-Long-Term-Holds.\nNot WallStreet-Societal-Change-Needed. Not WallStreet-Stick-It-to-the-Man. Not\nWallStreet-Down-with-Hedge-Funds.\n\nIt is WallStreetBETS. This sub was started to discuss and trade FD’s. If you\ndon’t know what that means,…",
  "original_created_utc": 1623339311,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブレディットの名前は「WallStreetBETS」です。WallStreet-Long-Term-Holdではありません。\nWallStreet-Societal-Change-Needではありません。WallStreet-Stick-It-to-the-Manではありません。ではなく\nWallStreet-Down-with-Hedge-Fundsではない。\n\nそれは、WallStreetBETSです。このサブは、FDの議論と取引のために始められました。もしあなたが\nその意味が分からない場合は...",
      "title": "WallStreetBetsです。それは何か、そして何ではないか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这个子版块的名称是WallStreetBETS。不是华尔街-长期持有。\n不是华尔街-社会-变革-需要。不是华尔街--坚持到底的人。不是\n华尔街--与对冲基金一起沉沦。\n\n它是华尔街赌注。这个子项目是为了讨论和交易FD。如果你\n不知道这意味着什么，...",
      "title": "WallStreetBets。它是什么；它又不是什么。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個子版塊的名稱是WallStreetBETS。不是華爾街-長期持有。\n不是華爾街-社會-變革-需要。不是華爾街--堅持到底的人。不是\n華爾街--與對沖基金一起沉淪。\n\n它是華爾街賭注。這個子項目是爲了討論和交易FD。如果你\n不知道這意味着什麼，...",
      "title": "WallStreetBets。它是什麼；它又不是什麼。"
    }
  ],
  "title": "WallStreetBets. What it is; and What it isn't.",
  "created_utc": 1623360215,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The name of this subreddit is WallStreet<strong>BETS</strong>. Not WallStreet-Long-Term-Holds. Not WallStreet-Societal-Change-Needed. Not WallStreet-Stick-It-to-the-Man. Not WallStreet-Down-with-Hedge-Funds.</p>\n\n<p>It is WallStreet<strong>BETS</strong>. This sub was started to discuss and trade FD’s. If you don’t know what that means, then you probably don’t belong here. This sub was dedicated to 0dte puts &amp; calls. Again, if that term is unfamiliar to you, then you probably shouldn&#39;t be here. This sub discusses strategies and plays on high-risk, short-duration, option contracts on stocks, stock indexes, ETF’s, and related securities, namely <strong>dailies</strong>. This sub’s idea of a long-term investment strategy is buying weeklies. This sub is most likely made up of people with ADHD, who can’t see past tomorrow, and have already forgotten what they had for breakfast.</p>\n\n<p>Occasionally, the play may be to buy and hold a stock for a short duration, but that is an exception, not the rule.</p>\n\n<p>If you want to buy and hold a security to effect change, or to stick it to the hedge funds, or to shake your fist at the Wall Street elite, then there are other subreddits for that. That is not <strong>THIS</strong> subreddit’s mantra.</p>\n\n<p>This sub has only one mantra: that is to make money daily. Period. We measure wins &amp; losses in 24-hr increments. And the only thing that counts is the amount in your account at the end of the day.</p>\n\n<p>This sub is not a “get-rich-quick” scheme. That kind of thinking leads to “get-poor-quick” results.</p>\n\n<p>This sub views the stock market as a casino. Like any casino, there are strategies you can employ to improve your odds. And that is what is (or should be) discussed here.</p>\n\n<p>And like a casino, there is a high degree of risk; including risk of total loss. Do not be fooled, you should expect losses. The stock market is a “zero-sum-game”. For every winner, there must be a loser. It takes two (2) people to effect a trade. For every buyer, there is a seller. For every “+”, there is a “-“.</p>\n\n<p>This sub is <strong>NOT</strong> a collective. Collective action is tantamount to collusion, which can lead to market manipulation, and that is <strong>NOT</strong> what this sub is about. That shit will get you 10 years in ClubFed.</p>\n\n<p>And lastly, for God’s sake, we are <strong>NOT</strong> apes. If anything, we are <strong>nerds</strong>. Math nerds. Numbers nerds. And damn proud of it. We discuss the Greek’s. And if you don’t know what that means, then really, <strong>REALLY</strong>, you don’t belong here.</p>\n\n<p>If you want to lurk here and learn, then by all means, please do. Ask questions. We will most likely make fun of you, but ask. Someone nice will answer your question.</p>\n\n<p><strong>EDITORS NOTE</strong>: Please excuse my very short account life. I am not an OG WSB, but I do get what the intention of this sub was, and I’m getting tired of reading off-topic posts and comments. I came here to make money, not to rise up against the establishment.</p>\n\n<p><strong>TL;DR</strong> : This is <strong>NOT</strong> a collective, this is a <strong>CASINO</strong>.</p>\n\n<p><strong>EDIT #1</strong>: I stand corrected on one critical point. An OG WSB graciously pointed out that daily&#39;s, weekly&#39;s, monthly&#39;s, LEAPS, and swing trades on stocks have always been welcomed here. But the point being, these are bets, not investments.</p>\n</div><!-- SC_ON -->",
  "score": 3614,
  "permalink": "/r/wallstreetbets/comments/nwqlb9/wallstreetbets_what_it_is_and_what_it_isnt/",
  "subreddit": "wallstreetbets",
  "id": "nwqlb9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009745421
}