{
  "author": "Zeeblackbaron",
  "original_created_utc": 1633789541,
  "title": "A 30 year old book predicted the rise of cryptocurrencies and the economic collapse of the USA",
  "created_utc": 1633807992,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In 1992 Neal Stephenson published a book called <strong>Snow Crash</strong></p>\n\n<p>The book is set in a decentralized economically collapsed USA in the 21st century. The dollar (as well as most other fiat currencies) has hyperinflated (quadrillion dollar notes are considered “small”), people use cryptocurrencies to buy things. The federal government tries to act tough but has no real power to do everything. Concepts like franchising, individual sovereignty, and private vehicles reign supreme.</p>\n\n<p>This is crazy guys! This book was considered science fiction 30 years ago and today looks like its turning into reality. The US govt is trying to crack down on cryptocurrencies right now but I doubt they’ll succeed. If they introduce the digital dollar, they’ll probably hyperinflate it like the book says.</p>\n</div><!-- SC_ON -->",
  "score": 196,
  "permalink": "/r/CryptoCurrency/comments/q4md6w/a_30_year_old_book_predicted_the_rise_of/",
  "subreddit": "CryptoCurrency",
  "id": "q4md6w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In 1992 Neal Stephenson published a book called Snow Crash\n\nThe book is set in a decentralized economically collapsed USA in the 21st\ncentury. The dollar (as well as most other fiat currencies) has hyperinflated\n(quadrillion dollar notes are considered “small”), people use cryptocurrencies\nto buy…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1992年、ニール・スティーブンソンは『スノークラッシュ』という本を出版しました。\n\nこの本は、経済的に崩壊した21世紀のアメリカを舞台にした分散型の\n世紀のアメリカを舞台にしています。ドル（および他のほとんどの不換紙幣）はハイパーインフレを起こしています。\n(ドル（およびその他のほとんどの不換紙幣）がハイパーインフレを起こし（4兆ドル札が「小さい」とみなされる）、人々は暗号通貨を使って\nを購入しています...",
      "title": "30年前の本が暗号通貨の台頭とアメリカの経済破綻を予言していた"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "1992年，尼尔-斯蒂芬森出版了一本名为《雪崩》的书。\n\n该书以21世纪经济崩溃的美国为背景，讲述了一个分散的、经济崩溃的美国。\n世纪的美国。美元（以及大多数其他法定货币）已经过度膨胀了\n(四百万美元的纸币被认为是 \"小 \"的)，人们使用加密货币\n来购买...",
      "title": "一本30年前的书预测了加密货币的崛起和美国的经济崩溃"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "1992年，尼爾-斯蒂芬森出版了一本名爲《雪崩》的書。\n\n該書以21世紀經濟崩潰的美國爲背景，講述了一個分散的、經濟崩潰的美國。\n世紀的美國。美元（以及大多數其他法定貨幣）已經過度膨脹了\n(四百萬美元的紙幣被認爲是 \"小 \"的)，人們使用加密貨幣\n來購買...",
      "title": "一本30年前的書預測了加密貨幣的崛起和美國的經濟崩潰"
    }
  ]
}