{
  "author": "a14alo",
  "the_new_excerpt": "Many doge investors have been lynching Barry Silbert for his tweet. And the same\npeople worship Elon when he tweets and manipulates the market. Some can say, it\nis because one is helping doge, and the other is hurting it. I genuinely think\nthis is also wrong. Elon doesn't help doge, doge helps Elon.…",
  "original_created_utc": 1620545547,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "多くのドゲ投資家が、バリー・シルバートのツイートをリンチしている。そして、同じ\nイーロンがツイートして市場を操作すると、同じ人々がイーロンを崇拝する。ある人は、それは\n一方がdogeを助け、他方がdogeを傷つけているからだとも言えます。私は純粋にそう思います。\nこれも間違っていると思います。イーロンはdogeを助けず、dogeはイーロンを助ける....",
      "title": "つぶやくだけで市場を操作する億万長者が嫌いなんですね。ならば、つぶやくだけで市場を操作する億万長者に頼らないでください"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "许多狗仔队的投资者因为巴里-西尔伯特的推文而被动用了私刑。而同样的\n当埃隆发推特并操纵市场时，同样有人崇拜他。有些人可以说，这\n因为一个人在帮助Doge，而另一个人在伤害它。我真的认为\n这也是错误的。埃隆没有帮助狗仔队，狗仔队帮助埃隆....。",
      "title": "所以，你不喜欢那些只靠发推特就能操纵市场的亿万富翁？那么就不要依赖那些通过推特操纵市场的亿万富翁。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "許多狗仔隊的投資者因爲巴里-西爾伯特的推文而被動用了私刑。而同樣的\n當埃隆發推特並操縱市場時，同樣有人崇拜他。有些人可以說，這\n因爲一個人在幫助Doge，而另一個人在傷害它。我真的認爲\n這也是錯誤的。埃隆沒有幫助狗仔隊，狗仔隊幫助埃隆....。",
      "title": "所以，你不喜歡那些只靠發推特就能操縱市場的億萬富翁？那麼就不要依賴那些通過推特操縱市場的億萬富翁。"
    }
  ],
  "title": "So, you don't like billionaires who manipulate the market just by tweeting? Then do not rely upon billionaires who manipulate the market just by tweeting",
  "created_utc": 1620563779,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Many doge investors have been lynching Barry Silbert for his tweet. And the same people worship Elon when he tweets and manipulates the market. Some can say, it is because one is helping doge, and the other is hurting it. I genuinely think this is also wrong. Elon doesn&#39;t help doge, doge helps Elon. It is not simply doge that gains popularity, it is mostly Elon who gains popularity. And don&#39;t forget! In this market if you win, others lose and vice versa, so the majority of the community (if there is one) will lose money. So if you vote for a manipulator, it is likely that you will be the one who is being manipulated.</p>\n\n<p>Btw I&#39;m neither a Doge investor nor a hater. I can see Doge&#39;s popularity can help the crypto space, but I can also see the danger of it. Thıs post is not about doge, it is about populists, manipulators.</p>\n</div><!-- SC_ON -->",
  "score": 1226,
  "permalink": "/r/CryptoCurrency/comments/n896u9/so_you_dont_like_billionaires_who_manipulate_the/",
  "subreddit": "CryptoCurrency",
  "id": "n896u9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985990906
}