{
  "author": "Trevigol",
  "original_created_utc": 1626957804,
  "title": "Do you remember when I said I worked in a bank and they told us to not buy or talk about crypto? Now they officially forced all employees to sell our crypto",
  "created_utc": 1626978916,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I made a post few months ago saying I work in one of the top 10 banks in Europe and they made some new rules saying we shouldn&#39;t buy crypto and we shouldn&#39;t even talk about it on social media.</p>\n\n<p>At the beginning they said it was to avoid bad advertising for the bank, because they consider crypto a dangerous investment and if a bank employee talks about it, clients could think the bank support crypto.</p>\n\n<p>Now they updated the internal regulations for employees: <strong>they officially forbid us to buy any crypto and we must sell all our crypto assets before the end of the year.</strong></p>\n\n<p>By the way, the internal regulations is confidential so I&#39;m not allowed to say it publicly.</p>\n\n<p>Now I&#39;m worried because I obviously won&#39;t give away my crypto, but I don&#39;t know how to avoid to get fired.</p>\n\n<p>I hope binance and crypto.com don&#39;t share their info with my bank (has anyone any news about it?), but I need also a way to keep buying crypto without using my bank account, clearly they can easily discover that I send money to exchanges from my bank account. </p>\n\n<p>Edit:\nI cannot share publicly the document, however here is the translation of the part about crypto:</p>\n\n<p><strong>Personal transactions in financial instruments and virtual currencies</strong>\n1. Recipients are prohibited from operating on financial instruments in counterpart with customers, even through a third party.<br/>\n2. Employees, non-employee Financial Advisors and Agents are also prohibited from carrying out operations and / or operating strategies with highly speculative characteristics and / or those which, due to their size or risk profile, could compromise the financial position of the person concerned, such as: \n- carry out purchase and sale transactions (or vice versa) of the same currency and / or the same financial instruments on the same day;  </p>\n\n<ul>\n<li>carry out transactions in <strong>virtual currencies;</strong></li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 963,
  "permalink": "/r/CryptoCurrency/comments/opd294/do_you_remember_when_i_said_i_worked_in_a_bank/",
  "subreddit": "CryptoCurrency",
  "id": "opd294",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I made a post few months ago saying I work in one of the top 10 banks in Europe\nand they made some new rules saying we shouldn't buy crypto and we shouldn't\neven talk about it on social media.\n\nAt the beginning they said it was to avoid bad advertising for the bank, because\nthey consider crypto a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "数ヶ月前にヨーロッパでトップ10に入る銀行で働いているという投稿をしました。\nの銀行で働いているのですが、その銀行が新しいルールを作って、暗号を買ってはいけない、ソーシャ ルメディアで暗号の話をしてはいけないと言ってきました。\nソーシャルメディアでその話をしてはいけないという新しいルールができました。\n\n最初は、銀行の悪い宣伝を避けるためだと言っていました。\n彼らは暗号を...",
      "title": "私が銀行で働いていると言ったら、暗号を買ったり話したりするなと言われたのを覚えていますか？今、彼らは公式にすべての従業員に暗号を売るように強制しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在几个月前发了一个帖子，说我在欧洲十大银行之一工作。\n他们制定了一些新的规则，说我们不应该购买加密货币，也不应该\n甚至在社交媒体上谈论它。\n\n一开始他们说这是为了避免银行的不良广告，因为\n他们认为加密货币是...",
      "title": "你还记得我说我在银行工作，他们告诉我们不要购买或谈论加密货币吗？现在他们正式强迫所有员工出售我们的加密货币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在幾個月前發了一個帖子，說我在歐洲十大銀行之一工作。\n他們制定了一些新的規則，說我們不應該購買加密貨幣，也不應該\n甚至在社交媒體上談論它。\n\n一開始他們說這是爲了避免銀行的不良廣告，因爲\n他們認爲加密貨幣是...",
      "title": "你還記得我說我在銀行工作，他們告訴我們不要購買或談論加密貨幣嗎？現在他們正式強迫所有員工出售我們的加密貨幣"
    }
  ]
}