{
  "author": "WhoAmIEven2",
  "original_created_utc": 1644472325,
  "title": "Why do many Americans, both left and right, believe that Sweden is socialist?",
  "created_utc": 1644493955,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;We are not socialist. We are a social democracy which hasn&amp;#39;t been connected to socialism for 100 years, and is a capitalist ideology nowdays with strong focus on social politics as well. A mixed economy that very much believes in the free market for 99% of businesses (liquor is the only thing that is only sold by the state to reduce alcoholism). &lt;/p&gt;\n\n&lt;p&gt;Why do people like republicans and Bernie Sanders say we are socialist, when we are not?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/NoStupidQuestions/comments/soz3xa/why_do_many_americans_both_left_and_right_believe/",
  "subreddit": "NoStupidQuestions",
  "id": "soz3xa",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "We are not socialist. We are a social democracy which hasn't been connected to\nsocialism for 100 years, and is a capitalist ideology nowdays with strong focus\non social politics as well. A mixed economy that very much believes in the free\nmarket for 99% of businesses (liquor is the only thing that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私たちは社会主義者ではありません。私たちは社会民主主義者です。\n100年前から社会主義であり、現在は資本主義のイデオロギーであり、強い焦点となっています。\n社会政治についても 自由経済を信奉する混合経済です。\n99％のビジネスで市場（酒類は唯一...",
      "title": "なぜ、右も左も多くのアメリカ人が、スウェーデンは社会主義だと信じているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们不是社会主义者。我们是一个社会民主主义，100年来没有与社会主义相联系。\n社会主义已经有100年了，现在是一种资本主义的意识形态，也非常注重社会政治。\n在社会政治方面也是如此。一个混合型经济，非常相信自由市场。\n99%的企业都相信自由市场（酒类是唯一的自由市场）。",
      "title": "为什么许多美国人，无论是左派还是右派，都认为瑞典是社会主义？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們不是社會主義者。我們是一個社會民主主義，100年來沒有與社會主義相聯繫。\n社會主義已經有100年了，現在是一種資本主義的意識形態，也非常注重社會政治。\n在社會政治方面也是如此。一個混合型經濟，非常相信自由市場。\n99%的企業都相信自由市場（酒類是唯一的自由市場）。",
      "title": "爲什麼許多美國人，無論是左派還是右派，都認爲瑞典是社會主義？"
    }
  ]
}