{
  "author": "freely_radical",
  "original_created_utc": 1628781466,
  "title": "Arguing for the existence of “God” and arguing that a specific religion is true feel like two completely different things to me.",
  "created_utc": 1628820741,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I took one philosophy class in college 15 years ago, please forgive me.  And I’m sorry if that’s actually discussed a lot here but I couldn’t find anything.</p>\n\n<p>It always seems to be that the person arguing for the existence of god also happens to be arguing for the existence of the god they believe in.  ..and also “evidence” that their god exists reinforces every other belief they have associated with that god.  (Probably a total assumption on my part but that’s what it seems)</p>\n\n<p>Not for lack of trying but I’ve never heard these two things discussed as separate…issues.  The existence of “God”, an ambiguous term for a unifying force that spawned our existence and “God” the figurehead of a religion.  Is there anything out there I could read or watch that covers this?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/askphilosophy/comments/p31xzi/arguing_for_the_existence_of_god_and_arguing_that/",
  "subreddit": "askphilosophy",
  "id": "p31xzi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I took one philosophy class in college 15 years ago, please forgive me. And I’m\nsorry if that’s actually discussed a lot here but I couldn’t find anything.\n\nIt always seems to be that the person arguing for the existence of god also\nhappens to be arguing for the existence of the god they believe in.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "15年前に大学で哲学の授業を1回受けただけですが、ご容赦ください。そして、私は\nここで何度も議論されていたら申し訳ないのですが、何も見つけられませんでした。\n\nいつも思うのですが、神の存在を主張している人は、たまたまその神の存在も主張しているような気がします。\nたまたま自分が信じている神の存在を主張しているだけのようです....",
      "title": "神」の存在を主張することと、特定の宗教が真実であることを主張することは、私には全く別のことのように感じられます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我15年前在大学里上过一堂哲学课，请原谅我。而且我很\n对不起，如果这里真的有很多讨论，但我找不到任何东西。\n\n似乎总是争论神的存在的人也\n恰好也在论证他们所信仰的神的存在....。",
      "title": "论证 \"上帝 \"的存在和论证一个特定的宗教是真实的，对我来说是两件完全不同的事情。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我15年前在大學裏上過一堂哲學課，請原諒我。而且我很\n對不起，如果這裏真的有很多討論，但我找不到任何東西。\n\n似乎總是爭論神的存在的人也\n恰好也在論證他們所信仰的神的存在....。",
      "title": "論證 \"上帝 \"的存在和論證一個特定的宗教是真實的，對我來說是兩件完全不同的事情。"
    }
  ]
}