{
  "author": "00100101011010",
  "the_new_excerpt": "Edit: I apologize for the misleading title, I don’t mean to discredit Uniswap or\nEthereum (I love them both). This is a problem with decentralization that we as\na community need to step up to the plate and address.\n\nI’m not quite sure how to flair this but I think this is an important\nconversation…",
  "original_created_utc": 1612332174,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "编辑：我为标题的误导性表示歉意，我并不是要诋毁Uniswap或\nEthereum（我喜欢它们两个）。这是一个去中心化的问题，我们作为。\n一个社会需要站出来解决这个问题。\n\n我不太确定该如何表达，但我认为这是一个重要的。\n谈话...",
      "title": "Uniswap比我们想象的更危险吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "編輯：我爲標題的誤導性表示歉意，我並不是要詆譭Uniswap或\nEthereum（我喜歡它們兩個）。這是一個去中心化的問題，我們作爲。\n一個社會需要站出來解決這個問題。\n\n我不太確定該如何表達，但我認爲這是一個重要的。\n談話...",
      "title": "Uniswap比我們想象的更危險嗎？"
    }
  ],
  "title": "Is Uniswap more dangerous than we think?",
  "created_utc": 1612362856,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Edit: I apologize for the misleading title, I don’t mean to discredit Uniswap or Ethereum (I love them both). This is a problem with decentralization that we as a community need to step up to the plate and address.</p>\n\n<p>I’m not quite sure how to flair this but I think this is an important conversation to have and I don’t see anyone having it.</p>\n\n<p>The more I dig into Uniswap the more fake erc20 tokens I’m finding... im not going to list them all here but I’ve accounted over $50,000,000 in liquidity for FAKE tokens. For the sake of this discussion let’s focus on just one, DOGE-ETH. Go ahead and check the pair on Uni and take a look at the “DOGE” ETH contract. For those unaware, DOGE runs on its own chain and it isn’t a erc20 token. My only explanation is that someone created an ETH token, called it DOGE and deployed it to Uniswap?</p>\n\n<p>I’m an experienced trader, I’ve used Ethereum for many years and even I caught myself one click away from buying a substantial amount of a fake token I thought was legitimate (Polymath).</p>\n\n<p>What’s bizarre is these fake tokens exist period.  They follow the prices of the actual assets and I’ve yet to see a rug pull on one of them. To me this feels extremely unhealthy and makes me uneasy about Uniswap in general. It’s like a house of cards ready to collapse and I’d hate to see the market devastated by the longer term repercussions on these fake tokens.</p>\n\n<p>What’s even worse is that I’ve been actively reporting these tokens I find in the official subs of these projects I’ve discovered to be fake. Nobody seems to care. I’ve sent lengthy and detailed reports to multiple crypto journalists and editors. Not a single response and not a single article warning users about this.</p>\n\n<p>I’ve posted many times right here only to hear crickets. Literally, nobody seems to have any concern.</p>\n\n<p>I don’t want to come off as a white knight here but I feel that people need to be aware of this phenomenon.</p>\n\n<p>Am I completely alone here, does anybody think this needs more attention?</p>\n\n<p>Fake doge pair: <a href=\"https://info.uniswap.org/pair/0xc0067d751fb1172dbab1fa003efe214ee8f419b6\">https://info.uniswap.org/pair/0xc0067d751fb1172dbab1fa003efe214ee8f419b6</a></p>\n\n<p>Fake doge contract: 0x4206931337dc273a630d328da6441786bfad668f</p>\n\n<p>Top holder appears to be slowly accumulating ETH by selling the fake doge minted to this address: <a href=\"https://etherscan.io/address/0xe77199646fe90725cbf01444813cdc4461e7102c\">https://etherscan.io/address/0xe77199646fe90725cbf01444813cdc4461e7102c</a></p>\n</div><!-- SC_ON -->",
  "score": 259,
  "permalink": "/r/CryptoCurrency/comments/lbh2u1/is_uniswap_more_dangerous_than_we_think/",
  "subreddit": "CryptoCurrency",
  "id": "lbh2u1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518532599
}