{
  "author": "Embarrassed_dad66",
  "original_created_utc": 1649995636,
  "title": "What happens to my custody payments if my ex quit her job?",
  "created_utc": 1650032583,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not sure where to ask this but a judge court ordered my ex wife to pay me child support starting May 1st with two months back pay.&lt;/p&gt;\n\n&lt;p&gt;I found out she quit her job of over 8 years and I think it&amp;#39;s so she doesn&amp;#39;t have to pay me. Will this delay my payments before they even start?&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m already contemplating a super high interest loan to get my son fed, clothing, ect ect after I got emergency but now permanent custody.&lt;/p&gt;\n\n&lt;p&gt;Should I notice the court that she quit her job?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/u3zk3e/what_happens_to_my_custody_payments_if_my_ex_quit/",
  "subreddit": "TooAfraidToAsk",
  "id": "u3zk3e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm not sure where to ask this but a judge court ordered my ex wife to pay me\nchild support starting May 1st with two months back pay.\n\nI found out she quit her job of over 8 years and I think it's so she doesn't\nhave to pay me. Will this delay my payments before they even start?\n\nI'm already…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "どこで聞けばいいのかわからないのですが、元妻に支払うよう判決が出ました。\n5月1日からの養育費と2ヶ月分のバックペイ。\n\n彼女が8年以上勤めた会社を辞めたことがわかったのですが、それは彼女が仕事を辞めないためだと思います。\nを支払う必要があります。これでは、支払いが始まる前に、支払いが遅れてしまうのではないでしょうか？\n\n私はもう...",
      "title": "元夫が仕事を辞めた場合、私の親権料の支払いはどうなりますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不知道该在哪里问这个问题，但法官在法庭上命令我的前妻支付给我\n从5月1日开始支付孩子的抚养费，并补发两个月的工资。\n\n我发现她辞去了8年多的工作，我想这是为了让她不用给我钱。\n必须支付给我。这是否会耽误我的付款，甚至开始之前？\n\n我已经...",
      "title": "如果我的前妻辞职，我的监护权付款会发生什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不知道該在哪裏問這個問題，但法官在法庭上命令我的前妻支付給我\n從5月1日開始支付孩子的撫養費，並補發兩個月的工資。\n\n我發現她辭去了8年多的工作，我想這是爲了讓她不用給我錢。\n必須支付給我。這是否會耽誤我的付款，甚至開始之前？\n\n我已經...",
      "title": "如果我的前妻辭職，我的監護權付款會發生什麼？"
    }
  ]
}