{
  "author": "01Cloud01",
  "the_new_excerpt": "Hello all I have seemingly been on a endless missions on trying to find brokers\nthat allow auto buying for individual stocks. It seems most them do mutual funds\nonly and deny you the opportunity to build your own portfolio of stocks. I’m\naware that M1 offers something like this but I really don’t…",
  "original_created_utc": 1623470347,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。私は、個別銘柄の自動購入を可能にするブローカーを見つけるために、果てしない使命を負っているようです。\n株の自動売買ができる証券会社を探しています。ほとんどの証券会社は投資信託しか扱っていないようで\n自分で株のポートフォリオを作る機会を与えてくれません。私は\n私はM1がこのようなものを提供していることを知っていますが、私は実際には...",
      "title": "ドルコスト平均法のための自動株買いを提供している証券会社"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好，我似乎一直在无休止地努力寻找允许自动购买个人股票的经纪商\n允许自动购买个别股票。似乎他们大多数人只做共同基金\n而剥夺了你建立自己的股票组合的机会。我知道\n我知道M1提供这样的服务，但我真的不...",
      "title": "提供自动买入股票以实现美元成本平均化的经纪公司"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好，我似乎一直在無休止地努力尋找允許自動購買個人股票的經紀商\n允許自動購買個別股票。似乎他們大多數人只做共同基金\n而剝奪了你建立自己的股票組合的機會。我知道\n我知道M1提供這樣的服務，但我真的不...",
      "title": "提供自動買入股票以實現美元成本平均化的經紀公司"
    }
  ],
  "title": "Brokerage firms that offer auto stock buying for dollar cost averaging",
  "created_utc": 1623493748,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello all I have seemingly been on a endless missions on trying to find brokers that allow auto buying for individual stocks. It seems most them do mutual funds only and deny you the opportunity to build your own portfolio of stocks. I’m aware that M1 offers something like this but I really don’t like there interface. Robinhood has this service but I’m not really hearing good things about them either does anyone know of any other brokers that offer this service?</p>\n</div><!-- SC_ON -->",
  "score": 275,
  "permalink": "/r/investing/comments/nxxzz1/brokerage_firms_that_offer_auto_stock_buying_for/",
  "subreddit": "investing",
  "id": "nxxzz1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009742339
}