{
  "author": "3STmotivation",
  "the_new_excerpt": "Something different as opposed to my usual uranium post, but in my opinion the\nopportunity that is presented in silver is worthy of a post on its own and as I\nmentioned before in my broad commodities post, it is my second favorite\ninvestment asset in the current market.\n\nSo what makes silver so…",
  "original_created_utc": 1610459703,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "与我平时的铀帖不同的是，在我看来\n白银所带来的机会值得我们单独写一篇文章，而且正如我\n之前在我的大宗商品文章中提到过，它是我第二喜欢的。\n的投资资产，在当前的市场上。\n\n那么是什么让白银如此...",
      "title": "白银，不仅仅是一种贵金属，更是一个不可思议的投资机会。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "與我平時的鈾帖不同的是，在我看來\n白銀所帶來的機會值得我們單獨寫一篇文章，而且正如我\n之前在我的大宗商品文章中提到過，它是我第二喜歡的。\n的投資資產，在當前的市場上。\n\n那麼是什麼讓白銀如此...",
      "title": "白銀，不僅僅是一種貴金屬，更是一個不可思議的投資機會。"
    }
  ],
  "title": "Silver, way more than just a precious metal and an incredible investment opportunity",
  "created_utc": 1610502911,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Something different as opposed to my usual uranium post, but in my opinion the opportunity that is presented in silver is worthy of a post on its own and as I mentioned before in my broad commodities post, it is my second favorite investment asset in the current market.</p>\n\n<p>So what makes silver so compelling, even after it already ran up a lot between the March lows  of roughly 12 dollars per ounce and the subsequent rise to above 28 dollars a few months later. Since that moment, silver corrected and has been trading mostly sideways, looking to be building a base for the next leg up. Today it is trading at around half what it was at the previous peak of 50 dollars and I believe we will reach that all time high again, or at the very least get close to it, perhaps even as soon as the end of Q2 2021. Having said that, I will not rule out a final dip before this run commences (more on that later) and this should in my opinion be viewed as an opportunity for those wanting to invest into the silver market.</p>\n\n<p>So why would silver run up more than it already has? Because of two reasons. The first reason has to do with the fact that silver is looked upon as a precious metal, a monetary metal even, that people purchase as a hedge against inflation. In that regard, it serves the same goal as purchasing gold would. With a Biden presidency now on the horizon, it has been clear that their immediate objective is to provide new stimulus. Joe Biden has publicly stated that he thinks 600 dollars per person is not nearly enough and that is should be upped to around 2000 dollars. The massive amount of stimulus will help fuel the next run in commodities and the general stock market, but especially gold and silver, because it devalues the dollar even further (which has been on a downward trajectory).</p>\n\n<p>Now, given what was stated above, why don’t I just buy gold instead? Isn’t it the better monetary metal and an ever better hedge against inflation? Some might argue that it is, but the hedge part is only part of the reason I have added silver miners to my portfolio. The other reason has to do with the two things everyone on this sub loves so much: Electrical vehicles and renewable energy. The thing these two investment assets have in common, is that they require silver and a decent amount of it as well. Unlike gold, 60% of all silver demand comes from industrial usage. The amount of silver used by the auto industry alone will reach an around 70 million ounces by 2030, up from 45 million ounces back in 2017. Silver is very important for the renewed focus on electric vehicles, as is further elaborated upon in <a href=\"http://www.lbma.org.uk/assets/Alchemist/Alchemist_90/Alch90OConnell.pdf\">this document</a> .</p>\n\n<p>Now, as for renewable energy and specifically solar, <a href=\"https://towardsdatascience.com/why-green-silver-just-might-be-the-new-black-gold-1694ac5562bf\">this article</a> put it best. We need silver for renewable energy and for solar energy it can be reduced should it get too expensive, but definitely not fully replaced because of its unique properties. We will need <em>a lot</em> of silver for things like the green new deal and the focus it puts on solar power generation and reliance on batteries.</p>\n\n<p>There are also other drivers, like the fact most pieces of the technology which have become integral to the way we go about living our lives also hold silver in various amounts. As you can see, silver is a very important metal. Not just as a hedge against inflation, but mainly as an industrial metal. Demand is increasing, but supply can’t be scaled up as easily as most might think. The reason for this, is that there are actually relatively few pure silver mines as opposed to copper or gold mines. Silver is often a byproduct produced from other mines. This makes it a lot harder to scale up the silver supply to meet the demand side. What also doesn’t help is that silver, like any commodity, has been through a cyclical downturn that ended around 2017 and has been slowly building momentum since. Before that however, there has been severe underinvestment into the sector, which translates into heavily reduced exploration and development of silver projects. Sure, now that silver prices are higher, they are starting this process again, but this takes time. Only a handful of projects ever properly make it into production and this can take several years, meaning that the cyclical downturn between 2011 and 2017 still weighs heavily on the sector today. This bull market still has plenty of legs and I believe it could run with the broad commodities bull market for several more years.</p>\n\n<p>Lastly, for those who value technical analysis as well, silver just bounced off of the 200 day moving average and has backtested the previous resistance level from the recent highs. If this support holds, it confirms that the lows are in and that the next leg up can begin. There is however a chance that there is one final plunge before that leg commences. In that timeframe the dollar could have a small bounce, coinciding with the drop in silver, but will continue its downtrend quickly after that. Both from a technical as well as a fundamental standpoint, silver looks to be much higher by the time Q3 of this year rolls around.</p>\n\n<p>TLDR: In summary silver is both a hedge against the devaluation of the dollar and a play on increased industrial demand due to prevailing macro trends around the world in the form of electric vehicles, renewable energy and other technology (phones, computers, batteries etc.). With increasing demand and a supply side which can’t be scaled up easily, price of silver looks set to go much higher from this point onwards. For every dollar that is added to the silver price, silver companies will move significantly more than that as their margins and free cash flow increases. I predict 40-50 dollar silver by the time we go into Q3 2021 and a significant increase in the share price of the underlying equities, with the disclaimer that in the very near term (this month) it could take one final plunge downwards before moving up like it did between March and August of last year.</p>\n\n<p>Disclaimer: I hold shares in PAAS and AG. For new investors that want exposure to this market, but don’t want the risk of owning an individual company, I would advise to look at the ETF SILJ, which holds silver juniors and looks to be the best positioned ETF to take advantage of this bull market. Make sure to always do your own research, I am merely here to present an investment case for a metal I believe to be undervalued relative to where it can go in the near future. Good luck to everyone and have a good day people!</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/investing/comments/kvs2ow/silver_way_more_than_just_a_precious_metal_and_an/",
  "subreddit": "investing",
  "id": "kvs2ow",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706379516
}