{
  "author": "topgear9123",
  "original_created_utc": 1630383977,
  "title": "People who where old enough to grow up without digital technology, how do you think it has impacted humanity",
  "created_utc": 1630458356,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was born in 1999, so some form of digital tech has always been around me in some shape or form. However when I was younger I remember catching the tail end of what I will call a more normal relationship with technology. I did not use computers daily in my childhood, did not have a cell phone and even remember going to a video store. However around middle school It seems like everything changed. </p>\n\n<p>-my first hand experience</p>\n\n<p>Most of my generation is dependent on a device to do their most basic tasks. We never learned to read a map, use an encyclopedia exe. Just about every workplace expects you to keep up with work at home now, so work can be never ending. And the cherry on top is people use their devices to escape from any and all perceived border. It feels aquward sitting in a waiting room not scrolling through my Instagram feed. Ive noticed many of my peers struggle with communication and socialization as well as have shorter attention spams and overall a diminished mental health. </p>\n\n<p>I would be curious to see the input of people who lived without all this digital technology for many years and weather or not you agree with my perspective. I feel kind of lost in my own generation, a lot of my friends are getting addicted to the internet with the tik tok stuff.</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/TrueAskReddit/comments/peyozr/people_who_where_old_enough_to_grow_up_without/",
  "subreddit": "TrueAskReddit",
  "id": "peyozr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was born in 1999, so some form of digital tech has always been around me in\nsome shape or form. However when I was younger I remember catching the tail end\nof what I will call a more normal relationship with technology. I did not use\ncomputers daily in my childhood, did not have a cell phone and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は1999年生まれなので、デジタル技術は常に私の周りにありました。\n何らかの形で。しかし、私が若い頃、私は、以下のような事柄の端緒をつかんだことを覚えています。\nというのも、私はテクノロジーとより正常な関係を築きたいと考えているからです。私は\n子供の頃は毎日パソコンを使っていたし、携帯電話も持っていなかったし...。",
      "title": "デジタル技術のない時代に育った人たちは、デジタル技術が人類にどのような影響を与えたと思いますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我出生于1999年，所以某种形式的数字技术一直以某种形式存在于我身边。\n某种形状或形式的数字技术。然而，当我年轻的时候，我记得我抓住了一个尾巴。\n我将其称为与技术更正常的关系。在我的童年，我并没有每天使用电脑，也没有\n在我的童年，我没有每天使用电脑，也没有手机，而且我也不知道该怎么办。",
      "title": "在没有数字技术的情况下长大的人，你认为它对人类有什么影响？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我出生於1999年，所以某種形式的數字技術一直以某種形式存在於我身邊。\n某種形狀或形式的數字技術。然而，當我年輕的時候，我記得我抓住了一個尾巴。\n我將其稱爲與技術更正常的關係。在我的童年，我並沒有每天使用電腦，也沒有\n在我的童年，我沒有每天使用電腦，也沒有手機，而且我也不知道該怎麼辦。",
      "title": "在沒有數字技術的情況下長大的人，你認爲它對人類有什麼影響？"
    }
  ]
}