{
  "author": "Qtredit",
  "original_created_utc": 1635688583,
  "title": "Tell me about your biggest fails in the crypto world so I don't feel stupid alone",
  "created_utc": 1635723376,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I never join the hype but I decided to buy some MANA, and two seconds later it tanked.</p>\n\n<p>The description seemed legit:\n&quot;Decentraland is a decentralized VR (virtual reality) world that is powered by the Ethereum blockchain. In this virtual world, you can purchase land, build it, monetize, and immerse into the applications and content that is built by other users. What distinguishes Decentraland from other VR projects is its decentralized nature.&quot; </p>\n\n<p>And yet, I was too quick to make the trade and became part of this pump and dump.</p>\n\n<p><strong>So what are your biggest crypto fails?</strong></p>\n</div><!-- SC_ON -->",
  "score": 188,
  "permalink": "/r/CryptoCurrency/comments/qjq0ja/tell_me_about_your_biggest_fails_in_the_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "qjq0ja",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I never join the hype but I decided to buy some MANA, and two seconds later it\ntanked.\n\nThe description seemed legit: \"Decentraland is a decentralized VR (virtual\nreality) world that is powered by the Ethereum blockchain. In this virtual\nworld, you can purchase land, build it, monetize, and immerse…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は誇大広告に参加したことはありませんが、MANAを買ってみようと思い、その2秒後には\n2秒後に暴落しました。\n\n説明を読む限りでは、合法的に思えました。「DecentralandはEthereumのブロックチェーンを利用した分散型のVR（仮想現実）の世界です。\nリアリティ）の世界であり、イーサリアムのブロックチェーンを利用しています。この仮想世界では\nこの仮想世界では、土地を購入し、建設し、収益化し、没頭することができます...",
      "title": "暗号の世界での最大の失敗を教えてください。そうすれば、私は一人で愚かな思いをしなくてすみます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我从来没有加入炒作，但我决定买一些MANA，两秒钟后它就\n就倒下了。\n\n描述似乎是合法的。\"Decentraland是一个去中心化的VR（虚拟现实）世界。\n现实）世界，由以太坊区块链驱动。在这个虚拟\n世界中，你可以购买土地，建造土地，实现货币化，并沉浸在其中。",
      "title": "告诉我你在加密货币世界中最大的失败，这样我就不会独自感到愚蠢了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我從來沒有加入炒作，但我決定買一些MANA，兩秒鐘後它就\n就倒下了。\n\n描述似乎是合法的。\"Decentraland是一個去中心化的VR（虛擬現實）世界。\n現實）世界，由以太坊區塊鏈驅動。在這個虛擬\n世界中，你可以購買土地，建造土地，實現貨幣化，並沉浸在其中。",
      "title": "告訴我你在加密貨幣世界中最大的失敗，這樣我就不會獨自感到愚蠢了。"
    }
  ]
}