{
  "author": "DrixGod",
  "the_new_excerpt": "I decided to make this post since this community basically changed my life in\nthe last 6 months.\n\nWhat this money means to me\n\nFor context of this post, I'm not from USA, I live in a country where minimum\nwage is 300$/month and the average wage is around 700$/month. So 50k is A LOT of\nmoney here. I…",
  "original_created_utc": 1620896673,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私がこの投稿をしようと思ったのは、このコミュニティがこの6年間で私の人生を大きく変えたからです。\n私の人生を変えてくれました。\n\n私にとってのこのお金の意味\n\nこの投稿の背景として、私はアメリカ出身ではなく、最低賃金が月300ドル、平均賃金が月700ドル程度の国に住んでいます。\n最低賃金が月300ドル、平均賃金が月700ドル程度の国に住んでいます。だから5万円は大金だよ。\nお金です。I...",
      "title": "主にペニーストック/ミームストックで10kを50kにした方法、コスト、そしてなぜETFに移行することにしたのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我决定发这个帖子，因为这个社区在过去六个月里基本上改变了我的生活。\n在过去6个月里改变了我的生活。\n\n这些钱对我意味着什么\n\n关于这个帖子的背景，我不是来自美国，我住在一个国家，那里的最低工资是300美元/月，平均工资是700美元/月。\n我住在一个最低工资为300美元/月，平均工资约为700美元/月的国家。所以5万块钱在这里是很大的一笔钱。\n钱。I...",
      "title": "我是如何将1万变成5万的，主要是仙股/美股，花了多少钱，为什么我决定转向ETF？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我決定發這個帖子，因爲這個社區在過去六個月裏基本上改變了我的生活。\n在過去6個月裏改變了我的生活。\n\n這些錢對我意味着什麼\n\n關於這個帖子的背景，我不是來自美國，我住在一個國家，那裏的最低工資是300美元/月，平均工資是700美元/月。\n我住在一個最低工資爲300美元/月，平均工資約爲700美元/月的國家。所以5萬塊錢在這裏是很大的一筆錢。\n錢。I...",
      "title": "我是如何將1萬變成5萬的，主要是仙股/美股，花了多少錢，爲什麼我決定轉向ETF？"
    }
  ],
  "title": "How I turned 10k into 50k with mainly pennystocks/meme stocks, what did it cost and why I decided to move to an ETF",
  "created_utc": 1620901870,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I decided to make this post since this community basically changed my life in the last 6 months.</p>\n\n<p><strong>What this money means to me</strong></p>\n\n<p>For context of this post, I&#39;m not from USA, I live in a country where minimum wage is 300$/month and the average wage is around 700$/month. So 50k is A LOT of money here. I work in SWE so I already earn around top 5% in my country, but not even close to what SWEs in America earn.</p>\n\n<p><strong>August 2019</strong></p>\n\n<p>I started trading in August 2019 with 500$ in my broker. I was buying the most vanilla stocks I could (KO, AAPL, MSFT, DIS) and got hooked once when my portofolio was up 10% at some point and I sold everything, banking 50$. I went out to a restaurant and basically payed it all with money I made &quot;tapping some buttons on my phone&quot;. To me, that was game changing. It was like gambling, but with way less risk. Like, What are the chances that those 4 companies would disappear and I would lose all my money overnight? Basically 0.</p>\n\n<p>Fast forward to 2020. I was adding money monthly to my account and traded vanilla stocks for little profit. I was reading <a href=\"/r/wallstreetbets\">/r/wallstreetbets</a> daily but didn&#39;t bother gambling all my money on meme stocks. Untill I decided to give it a try and bought RCL based on some DDs that it will recover during summer and ships will start sailing again. I placed all my money in this stock and held for a week. It went up ~30% and I made 2k dollars. I made more than my monthly salary by, again, &quot;tapping buttons on my phone&quot;. This is when I knew I&#39;d become a degenerate gambler.</p>\n\n<p><strong>2019-2020</strong></p>\n\n<p>Up until november 2020 I continued gambling with meme stocks from WSB while also adding money monthly. Gambled with SPCE, PLTR, PRPL and all the hot shit at that time. I was basically breaking even since I&#39;d make 10% this week and lose 10% next week. My friend got into trading at this time. I had 10k in my account, he had 200$. So, since he had little money, he started dabbling with pennystocks.</p>\n\n<p>December 2020: I was talking to my friend daily about penny stocks and he bought AIpine 4 technologies worth all his money and that 200$ in one month turned into 2k$. He made 1000% in one month. I&#39;ve never heard of a stock moving 1000% in a month in my life before. Only meme coins would do that. So, being the degenerate I am, I moved to penny stocks.</p>\n\n<p><strong>December 2020</strong></p>\n\n<p>I had 10k$ to start with. I was reading this sub daily and throwing my money to random tickers that were mentioned every day. AßML was the first big money I made. I was reading the DD on this sub, crosschecking with other people on stocktwits/yahoo finance. Checking out myself the website etc (what everyone told you to do, not blindly follow random DDS) and in the end deciding to buy or not. I made 8k in December 2020. From 10k to 18k. </p>\n\n<p><strong>January 2021</strong></p>\n\n<p>This was the month. The peak of my performance and decline of my mental health. I was less and less curious about checking if the DD is good or not. I was looking at an upvoted post, checking the top comment and throwing ~5k into that stock. I was reading this sub, the S -P -A -C -S subreddit, following dozen youtubers and was basically doing this 10-12 hrs a day. While at work, I&#39;d check the premarket all day, refreshing every sub on new, looking at marketwatch and preparing my moves. It got to the point where I would not sleep at night because all I could think about were stocks. I was buying tickers that I didn&#39;t even know what the acronym standed for, based on someone that posted a lenghty DD and got 5 upvotes. My highest moment was saying &quot;brb&quot; in a meeting at work to throw 20k into a stock that was about to &quot;go to the moon&quot; and in 2 minutes sell it for a 5k gain. I made 5k$ in 2 minutes while in a meeting at work. You know I couldn&#39;t give a fuck about that meeting anymore.</p>\n\n<p>While all this happened my mental health was suffering. I didn&#39;t sleep because of the obsession, all I wanted to talk with people were stocks (so they naturally talked less with me). I lost the value of money. Talking about prices of an Airbnb with my mom and I said this one costs 100$/night but it has a jacuzzi her face dropped. She was like &quot;100$ per night? Are you insane? that&#39;s A LOT&quot; (remember, minimum wage is 300$/month). In my mind that was like nothing. I made 5k in 2 minutes. What is 100$ even gonna cost?</p>\n\n<p>I was already dreaming that in 1 year I&#39;m buying a lambo. My performance at work dropped, my relationships suffered and I was stressed 90% of the time. Some days where I would make money I&#39;d still be pissed because I could have made more. It was NEVER ENOUGH.</p>\n\n<p>January 2021: 18k -&gt; 40k.</p>\n\n<p><strong>February 2021 (first half)</strong></p>\n\n<p>February started the same. I got up to 50k in the first week since everything was so easy. Just read all the subs and figure out what to buy. I made bank on CClV and whenever I sold something, I couldn&#39;t just let my money sit. I&#39;d have to buy something again. &quot;Hey look I made 1k today. Maybe let the money sit, since there&#39;s nothing more to be bought&quot;. Fuck that, buy random tickers that are already up 300% the last 5 days. What could go wrong?</p>\n\n<p>February 2021 (first half): 40k -&gt; 50k.</p>\n\n<p><strong>February 2021 (second half)</strong></p>\n\n<p>We all know what happened here. The stock market crashed hard. Pennystocks, S -P -A -Cs and all speculative stocks dropped like 30-50% in this period. My portofolio went from 50k to 40k. 10k Loss in half a month. That was a wake up call. I had days when I would lose what is my monthly salary and didn&#39;t even flinch. I knew I was in deep trouble and that I need to stop. Talked with people and forced myself to delete the app. Hardest moment of the year.</p>\n\n<p>February 2020 (second half): 50k -&gt; 40k.</p>\n\n<p><strong>March 2020</strong></p>\n\n<p>I took a one month break. It was hell. I would still check the subs daily and see mostly bad posts like &quot;everything is crashing, we are all gonna go bankrupt&quot;. I was smiling cus I was not in it now. But still, even in this sea of red, some stocks would still do 100-200% in a day. Mainly biopharma pennys. So whenever I&#39;d see someone making bank I would feel the urge again. But I said I will stop and I did. I would start looking less and less at the subs. From checking it 10 times a day to once a day. To checking it every other day. In the last week of march I didn&#39;t bother reading anything anymore. I was not making money, but I felt FREE. It was such a relief to sleep more than 3 hours a night, not feel constant stress and panic attacks due to the market. I was recovering from an addiction.</p>\n\n<p><strong>April 2021 - present</strong></p>\n\n<p>Since I couldn&#39;t let my money sit in my bank and do nothing, just lose value due to inflation I decided I should still invest, but in a safer approach. Took 5k out to spoil myself with a new bike, a 2 week trip this summer and left some as an emergency.</p>\n\n<p>The rest of the money, 5k I invested in some space S -P -A -Cs that I will hold long term. The rest (30k) I placed in VUSA (Vanguard version of S&amp;P 500). Now when the ETF drops 1% a day I&#39;m not even moved. The volatility is still high in these markets but it&#39;s nothing compared to what it was before.</p>\n\n<p>I shared my story in hopes that other people can relate to this, or learn something from my experience with pennystocks, gambling, addiction and mental health.</p>\n</div><!-- SC_ON -->",
  "score": 316,
  "permalink": "/r/stocks/comments/nbcb96/how_i_turned_10k_into_50k_with_mainly/",
  "subreddit": "stocks",
  "id": "nbcb96",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590803280
}