{
  "author": "God_Hand_9764",
  "original_created_utc": 1655643442,
  "title": "So, serious question... if this crash is how Bitcoin responds to a looming macro downturn/recession, where the heck are we safe to put our money?",
  "created_utc": 1655678496,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been in Bitcoin since 2014.  I&amp;#39;ve seen the ups and downs and rode the rollercoaster all this time.  This crash has me a little bit spooked though, I will admit.&lt;/p&gt;\n\n&lt;p&gt;Bitcoin was made to have strong and incorruptible monetary policy, in the face of easy money.  With the way things are going, it seems like we&amp;#39;re seeing things unravel in the global economy pretty much as Bitcoiners have been predicting since the beginning.&lt;/p&gt;\n\n&lt;p&gt;And yet the price of Bitcoin takes a massive shit as this drama unfolds, and we&amp;#39;re all wondering where the bottom is, if it can be found at all.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s as if you have Rocky training for years and years for the big fight, endless montage, he&amp;#39;s fucking shredded and ready to rumble.  But when he gets in the ring, he shits his pants and cries.&lt;/p&gt;\n\n&lt;p&gt;It just seems like these are the conditions that we&amp;#39;ve all been preparing for, but it&amp;#39;s just not going well so far.  We put our money into Bitcoin to have strength in the face of a financial downturn, but if you are holding Bitcoin right now, it&amp;#39;s hard to find other investments that have been hit harder.&lt;/p&gt;\n\n&lt;p&gt;I guess this is my whiny panic post.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 326,
  "permalink": "/r/Bitcoin/comments/vfumqz/so_serious_question_if_this_crash_is_how_bitcoin/",
  "subreddit": "Bitcoin",
  "id": "vfumqz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've been in Bitcoin since 2014. I've seen the ups and downs and rode the\nrollercoaster all this time. This crash has me a little bit spooked though, I\nwill admit.\n\nBitcoin was made to have strong and incorruptible monetary policy, in the face\nof easy money. With the way things are going, it seems…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2014年からビットコインを始めています。浮き沈みを経験し、乗ってきました。\nこの間ずっとジェットコースターに乗ってきました。今回の暴落で、私は少し怖気づきましたが\nは認めます。\n\nビットコインは、強力で腐敗しない金融政策を持つように作られました。\nこのままでは このままでは...",
      "title": "そこで真面目な質問ですが、もしこの暴落が迫り来るマクロの景気後退に対するビットコインの反応だとしたら、一体どこにお金を預ければ安全なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我从2014年开始从事比特币投资。我见证了比特币的起起落落，坐过山车的过程。\n过山车。虽然这次暴跌让我有点惊慌失措，我\n我得承认。\n\n比特币的诞生是为了拥有强大和不可侵犯的货币政策，在面对\n的宽松货币。以现在的情况来看，似乎...",
      "title": "那么，严肃的问题是......如果这次崩盘是比特币对迫在眉睫的宏观经济下滑/衰退的反应，那么我们把钱放在哪里才是安全的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我從2014年開始從事比特幣投資。我見證了比特幣的起起落落，坐過山車的過程。\n過山車。雖然這次暴跌讓我有點驚慌失措，我\n我得承認。\n\n比特幣的誕生是爲了擁有強大和不可侵犯的貨幣政策，在面對\n的寬鬆貨幣。以現在的情況來看，似乎...",
      "title": "那麼，嚴肅的問題是......如果這次崩盤是比特幣對迫在眉睫的宏觀經濟下滑/衰退的反應，那麼我們把錢放在哪裏纔是安全的？"
    }
  ]
}