{
  "author": "AsbestosDude",
  "original_created_utc": 1632670907,
  "title": "Every single person who has bought and held Safemoon since April 17 is down on their purchase",
  "created_utc": 1632692236,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Safemoon is continuing to fall now down to  <strong>0.00000135</strong> which is <strong>87% down</strong> from it&#39;s all time high. This shows the true risk of these ponzi coins. The fervor has ended, the get rich quick delusions around this product are dead. This is why you can&#39;t look to these projects to make you rich.</p>\n\n<p>&#x200B;</p>\n\n<p>When people talk about a project going &quot;To the moon&quot; they mean they mean the 100x that brought safemoon to it&#39;s ATH, the same with SHIB when it spiked to it&#39;s ATH. However what people really need to be made aware is if a project went from 0.0001 to 0.1 that is mooning, the same as 0.000000001 to 0.000001 is mooning.</p>\n\n<p>Look at the graph of shiba or safemoon, if it&#39;s shot way up and fallen back down, the moon shot is lost and you are probably going to lose money. </p>\n\n<p>Please stop letting the size of the number trick you into buying something because it&#39;s &quot;cheap&quot; </p>\n\n<p>&#x200B;</p>\n\n<p>TL;DR Safemoon proves itself as a Ponzi coin with no real value and continues to fall.</p>\n</div><!-- SC_ON -->",
  "score": 158,
  "permalink": "/r/CryptoCurrency/comments/pvwav8/every_single_person_who_has_bought_and_held/",
  "subreddit": "CryptoCurrency",
  "id": "pvwav8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Safemoon is continuing to fall now down to 0.00000135 which is 87% down from\nit's all time high. This shows the true risk of these ponzi coins. The fervor\nhas ended, the get rich quick delusions around this product are dead. This is\nwhy you can't look to these projects to make you rich.\n\n\n\nWhen…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Safemoonは現在、史上最高値から87%減の0.00000135まで下落を続けています。\n史上最高値から87%下落しています。これは、これらのポンジコインの真のリスクを示しています。熱狂は終わりました。\nこの商品の熱狂は終わり、一攫千金の妄想は死んだのです。これが\nこれが、これらのプロジェクトがあなたを豊かにすることを期待できない理由です。\n\n\n\nいつ...",
      "title": "4月17日からセーフムーンを買って持っていた人は、一人残らず買い下がっています"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Safemoon正在继续下跌，现在跌至0.00000135，比历史最高点下跌了87%。\n它的历史最高点下降了87%。这显示了这些庞氏币的真正风险。热潮\n已经结束，围绕这个产品的快速致富妄想已经破灭。这就是\n这就是为什么你不能指望这些项目来使你致富。\n\n\n\n当...",
      "title": "自4月17日以来，每一个买入并持有Safemoon的人都在下跌中买入"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Safemoon正在繼續下跌，現在跌至0.00000135，比歷史最高點下跌了87%。\n它的歷史最高點下降了87%。這顯示了這些龐氏幣的真正風險。熱潮\n已經結束，圍繞這個產品的快速致富妄想已經破滅。這就是\n這就是爲什麼你不能指望這些項目來使你致富。\n\n\n\n當...",
      "title": "自4月17日以來，每一個買入並持有Safemoon的人都在下跌中買入"
    }
  ]
}