{
  "author": "lucy5478",
  "the_new_excerpt": "I was recently reading a lot of historical resources on the LGBTQ rights\nmovement to learn more about the history of my identity in activism, and one\nthing that struck me was just how radical the major gay rights organizations\nwere in the 1960s and 1970s in comparison to those of the 1990s and into…",
  "original_created_utc": 1622153960,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は最近、LGBTQの権利に関する歴史的資料を読み漁っていました。\n活動における自分のアイデンティティの歴史を知るために、LGBTQ権利運動に関する歴史的資料をたくさん読んでいました。\n印象的だったのは、1960年代から1970年代にかけて、主要な同性愛者の権利を守る団体がどれほど過激だったかということです。\n1960年代、1970年代の主要なゲイ権利団体は、1990年代以降の団体と比較して、いかに過激であったかということでした...",
      "title": "LGBTQの権利運動が脱過激化し、ゲイ・リベレーションからよりメインストリームな目標や態度へとシフトした原因は何だったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近正在阅读大量关于LGBTQ权利的历史资源\n运动的历史资源，以了解更多关于我在活动中的身份的历史。\n让我印象深刻的是，与20世纪90年代及以后的同性恋权利组织相比，60年代和70年代的主要同性恋权利组织是多么的激进。\n在20世纪60年代和70年代的主要同性恋权利组织与20世纪90年代及以后的组织相比，是多么的激进。",
      "title": "是什么导致了LGBTQ权利运动的去极端化，以及从同性恋解放向更主流的目标和态度的转变？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近正在閱讀大量關於LGBTQ權利的歷史資源\n運動的歷史資源，以瞭解更多關於我在活動中的身份的歷史。\n讓我印象深刻的是，與20世紀90年代及以後的同性戀權利組織相比，60年代和70年代的主要同性戀權利組織是多麼的激進。\n在20世紀60年代和70年代的主要同性戀權利組織與20世紀90年代及以後的組織相比，是多麼的激進。",
      "title": "是什麼導致了LGBTQ權利運動的去極端化，以及從同性戀解放向更主流的目標和態度的轉變？"
    }
  ],
  "title": "What caused the de-radicalization of the LGBTQ rights movement and the shift away from gay liberation towards more mainstream goals and attitudes?",
  "created_utc": 1622170843,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was recently reading a lot of historical resources on the LGBTQ rights movement to learn more about the history of my identity in activism, and one thing that struck me was just how radical the major gay rights organizations were in the 1960s and 1970s in comparison to those of the 1990s and into the present. </p>\n\n<p>The Gay Liberation Front, the Combahee River Collective, other organizations, etc. were almost all explicitly anti-capitalist, very left wing, and in many cases rejected the nuclear family and marriage itself, far from desiring to earn marriage rights as the modern gay marriage movement sought. Many of these organizations main goals revolved around restructuring society itself rather than law changes within the already extant structures of society.</p>\n\n<p>By the 1990s however, much of the modern movement, like the Human Rights Campaign, had become highly integrated with a capitalist and centrist (Democratic) political party and their demands were generally centered around law changes and in particular gay marriage.</p>\n\n<p>What caused this shift? Were COINTELPRO or similar government programs utilized to disrupt the gay liberation movement in the same way as they were on the Black Power movement? Was the AIDS crises influential in killing the previous generation of radical leadership? Was the incorporation of the movement into the non-profit structure and government/business funding sources a reason for the rightward shift (I.e. Gay Inc. book)? The question particularity interests me as a gay leftist who draws a lot of inspiration from the early gay liberation groups.</p>\n\n<p>Any explanation or even sources for reading are appreciated.  Thanks in advance.</p>\n</div><!-- SC_ON -->",
  "score": 129,
  "permalink": "/r/AskHistorians/comments/nmj7dh/what_caused_the_deradicalization_of_the_lgbtq/",
  "subreddit": "AskHistorians",
  "id": "nmj7dh",
  "is_self": true,
  "media": null,
  "is_video": false
}