{
  "author": "throwawaysandy00",
  "original_created_utc": 1652028430,
  "title": "I was mistakenly arrested for child porn charges 20 years ago and charges were dropped, will that appear on background check?",
  "created_utc": 1652054545,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In college, I shared an apartment with several people. Everyone used my computer. One day someone went somewhere they should not have on the internet and &amp;quot;it&amp;quot; happened.&lt;/p&gt;\n\n&lt;p&gt;Since the computer was mine, I was charged. But during the investigation, I was able to prove it wasn&amp;#39;t me because I was out of the state at the time it occurred. The charges were then dropped.&lt;/p&gt;\n\n&lt;p&gt;Just the arrest itself took a huge toll on me and my family. My name was spread around the community and it was all over the news. Obviously, I thought about killing myself, but I couldn&amp;#39;t think of a painless way to do it, so I chickened out (which I am thankful for). What made things worse is that I work in healthcare, so I had to go in front of a board and plead with them to let me prove my innocence. Miraculously, it worked. They gave me a chance and, as I already mentioned, the charges were dropped.&lt;/p&gt;\n\n&lt;p&gt;Fast forward 20 years, I am happily married with 2 kids and a house, etc. Most days go by and I don&amp;#39;t even think about it anymore.&lt;/p&gt;\n\n&lt;p&gt;Recently, there have been some major changes at the place I have been working for over a decade and they&amp;#39;re trying to force us &amp;quot;old-timers&amp;quot; out. Most have already left and I am on-board with leaving.&lt;/p&gt;\n\n&lt;p&gt;The particular field I am in is highly specialized and is in very high demand. For instance, most of my co-workers got employment in less than 2 weeks, yet I have gotten turned down for several opportunities despite being well qualified for the jobs. Of course, they don&amp;#39;t mention the past arrest being the cause of denial (or even if it is appearing on their background check), but I am beginning to suspect the arrest is the culprit.&lt;/p&gt;\n\n&lt;p&gt;I used Goodhire to background check myself and it came up clean. Nothing at all. But I read deeper and it seems Goodhire follows &lt;a href=\"https://en.m.wikipedia.org/wiki/Equal_Employment_Opportunity_Commission\"&gt;EEOC&lt;/a&gt; guidelines and doesn&amp;#39;t report arrests with dismissals.&lt;/p&gt;\n\n&lt;p&gt;I know there are deeper (level 2?) background checks that can be done on potential employees. Is it possible these hospitals and healthcare organizations are doing those types of checks without gathering my fingerprints?&lt;/p&gt;\n\n&lt;p&gt;I know the most common answer to this is post will be that I need to get a lawyer. But get a lawyer for what? Sue the hospital for not hiring me? Would I really want to work there afterwards??&lt;/p&gt;\n\n&lt;p&gt;Also, I don&amp;#39;t think I can get it expunged because I think it is labeled a sex crime.&lt;/p&gt;\n\n&lt;p&gt;I just feel lost and defeated and not sure where to go with this. I have a family now that I need to care for and I am beginning to get worried that I won&amp;#39;t be able to provide for them. My wife knows of my history, but downplays it and doesn&amp;#39;t think it has anything to do with what&amp;#39;s going on with not being able to find new employment.&lt;/p&gt;\n\n&lt;p&gt;Does anyone here have experience with background checks or stories they can share? Anyone that works in HR can anonymously comment on how you would handle a situation like this? Just so confused and looking for more information.&lt;/p&gt;\n\n&lt;p&gt;Tl;dr: I have an arrest earlier in life that I am afraid will haunt me forever.0&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/NoStupidQuestions/comments/ul5sov/i_was_mistakenly_arrested_for_child_porn_charges/",
  "subreddit": "NoStupidQuestions",
  "id": "ul5sov",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In college, I shared an apartment with several people. Everyone used my\ncomputer. One day someone went somewhere they should not have on the internet\nand \"it\" happened.\n\nSince the computer was mine, I was charged. But during the investigation, I was\nable to prove it wasn't me because I was out of…"
}