{
  "author": "arnaudmrtn",
  "original_created_utc": 1632406839,
  "title": "My son is my moon : I will sell my sats to get my little son and I a cosy and confortable flat.",
  "created_utc": 1632418508,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi all,</p>\n\n<p>I&#39;m a Bitcoin believer since 2016. I&#39;ve DCA&#39;d every month into Bitcoin only and I&#39;ve promised myself to never sell my sats unless there is an emergency situation.</p>\n\n<p>I&#39;ve had a very good and pleasant life so far : I&#39;ve been with my wife for 7 years and we have the pleasure to have a wonderful 10 months old little boy. Also, we bought a nice house together last year with a 25 years loan that we pay back every months ever since.</p>\n\n<p>Unfortunately, my wife has decided to break up with me recently.. We will therefore have to sell our house and move to separate flats. But my only salary will not be enough to buy a new flat in the neighbourhood I desire.</p>\n\n<p>Be sure that i consider Bitcoin as a thing of beauty, and I&#39;m sure it is the best asset we can own today.</p>\n\n<p>But today, as my portfolio has gone up in value, I will sell a good chunk of my stack to buy the perfect spot so my little son and I will be happy in this new chapter of our life. He is and will always be my priority : he is my moon.</p>\n\n<p>I will keep DCA into Bitcoin whatever I can tho. Cheers, and see you guys soon!</p>\n</div><!-- SC_ON -->",
  "score": 178,
  "permalink": "/r/Bitcoin/comments/ptwawg/my_son_is_my_moon_i_will_sell_my_sats_to_get_my/",
  "subreddit": "Bitcoin",
  "id": "ptwawg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi all,\n\nI'm a Bitcoin believer since 2016. I've DCA'd every month into Bitcoin only and\nI've promised myself to never sell my sats unless there is an emergency\nsituation.\n\nI've had a very good and pleasant life so far : I've been with my wife for 7\nyears and we have the pleasure to have a wonderful…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さんこんにちは。\n\n私は2016年からビットコインの信者になりました。私は毎月、ビットコインのみにDCAしており\n緊急事態でもない限り、サットは絶対に売らないと心に誓っています。\nの状況になっています。\n\n私はこれまで非常に良い、楽しい人生を送ってきました：私は妻と7年間一緒にいて\n妻とは7年目になりますが、素晴らしい家族に恵まれています。",
      "title": "私の息子は私の月です：私は小さな息子と私のために、居心地の良い快適なフラットを手に入れるために、サットを売ります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。\n\n我从2016年开始就是一个比特币的信徒。我每个月都会把自己的钱存入比特币中，而且\n我向自己保证，除非有紧急情况，否则绝不出售我的比特币。\n情况。\n\n到目前为止，我有一个非常好的和愉快的生活：我和我的妻子在一起已经有7年了。\n我和我的妻子在一起7年了，我们很高兴能有一个美好的家庭。",
      "title": "我的儿子就是我的月亮：我将卖掉我的学费，为我和我的小儿子买一套舒适的公寓。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。\n\n我從2016年開始就是一個比特幣的信徒。我每個月都會把自己的錢存入比特幣中，而且\n我向自己保證，除非有緊急情況，否則絕不出售我的比特幣。\n情況。\n\n到目前爲止，我有一個非常好的和愉快的生活：我和我的妻子在一起已經有7年了。\n我和我的妻子在一起7年了，我們很高興能有一個美好的家庭。",
      "title": "我的兒子就是我的月亮：我將賣掉我的學費，爲我和我的小兒子買一套舒適的公寓。"
    }
  ]
}