{
  "author": "BuckethatWithOatmeal",
  "original_created_utc": 1633989324,
  "title": "How do I cope with the fact that I'm only average intelligence? All of my life's ambitions are competitive in nature and for the cognitively capable.",
  "created_utc": 1634004707,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For context: I want to become a world class cybersecurity expert and compete at the international level in prestigious hacking competitions. I am 19 years old and have absolutely zero work ethic or conscientiousness, it feels daunting because everyone else who does great at this field of work and play are very bright mentally and can just understand and connect the concepts much faster than I can.</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/NoStupidQuestions/comments/q66ude/how_do_i_cope_with_the_fact_that_im_only_average/",
  "subreddit": "NoStupidQuestions",
  "id": "q66ude",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "For context: I want to become a world class cybersecurity expert and compete at\nthe international level in prestigious hacking competitions. I am 19 years old\nand have absolutely zero work ethic or conscientiousness, it feels daunting\nbecause everyone else who does great at this field of work and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "文脈から 世界的なサイバーセキュリティの専門家になって、権威あるハッキング大会で国際的に活躍したい。\n世界的なサイバーセキュリティの専門家になり、権威あるハッキング大会で国際的に活躍したいと思っています。私は19歳です。\nの私には、仕事に対する意欲や良心の呵責は全くありませんが、これは大変なことです。\nなぜなら、この分野の仕事で素晴らしい成果を上げている人たちは皆、...",
      "title": "自分が平均的な知能しか持っていないという事実にどう対処したらいいのか？私の人生の野望はすべて、本質的に競争的なものであり、認知能力の高い人のためのものです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "为了说明情况。我想成为一名世界级的网络安全专家，并在国际层面上参与竞争。\n在国际上参加著名的黑客竞赛。我今年19岁\n而且完全没有职业道德和自觉性，这让我感到很害怕\n因为其他人在这个领域的工作都做得很好，而且...",
      "title": "我如何应对我只有一般智力的事实？我所有的人生志向都是竞争性质的，而且是为认知能力强的人服务。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "爲了說明情況。我想成爲一名世界級的網絡安全專家，並在國際層面上參與競爭。\n在國際上參加著名的黑客競賽。我今年19歲\n而且完全沒有職業道德和自覺性，這讓我感到很害怕\n因爲其他人在這個領域的工作都做得很好，而且...",
      "title": "我如何應對我只有一般智力的事實？我所有的人生志向都是競爭性質的，而且是爲認知能力強的人服務。"
    }
  ]
}