{
  "author": "CryptoMaximalist",
  "original_created_utc": 1630444869,
  "title": "Moon Week 17 begins tomorrow. See rule reminders and schedule information here",
  "created_utc": 1630506721,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello everyone, Moon Week for Round 17 is upon us.  The snapshot and polls will be posted in the next ~24 hours.  They will then all be compiled into a pinned Moon Week post on Thursday, which will remain until the distribution is posted next Wednesday (September 8th).  </p>\n\n<p>For more information about Moons, see <a href=\"https://www.reddit.com/r/CryptoCurrency/wiki/moons_wiki\">the Moons Wiki here</a></p>\n\n<p>We&#39;d also like to remind everyone about a few rules that are relevant to Moon Week:</p>\n\n<ul>\n<li>Rule 3 - Do not mislead voters, tell people how to vote, or campaign outside of a poll&#39;s comment section.<br/></li>\n<li>Rule 3 - Do not brigade governance polls.  To encourage someone to vote, link to the Moon Week post so they can participate in all polls and see important information about the voting process</li>\n<li>Rule 4/8 - No derailing the comment section of a post, for example by attacking the author of a poll or raising unrelated topics </li>\n</ul>\n\n<p>Today&#39;s post is not the typical reminder to post governance polls by Thursday because we have been working to <a href=\"https://www.reddit.com/r/CryptoCurrencyMeta/comments/p9lmi5/proposed_rcc_governance_framework/\">formalize the governance process</a> and I have already privately coordinated with the authors of all approved polls.  Please do continue to submit your ideas to <a href=\"/r/CryptoCurrencyMeta\">r/CryptoCurrencyMeta</a> if they have not been discussed before</p>\n</div><!-- SC_ON -->",
  "score": 196,
  "permalink": "/r/CryptoCurrency/comments/pff5w7/moon_week_17_begins_tomorrow_see_rule_reminders/",
  "subreddit": "CryptoCurrency",
  "id": "pff5w7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hello everyone, Moon Week for Round 17 is upon us. The snapshot and polls will\nbe posted in the next ~24 hours. They will then all be compiled into a pinned\nMoon Week post on Thursday, which will remain until the distribution is posted\nnext Wednesday (September 8th).\n\nFor more information about…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは！第17戦のムーンウィークがやってきました。スナップショットとポールは\nは、今後24時間以内に掲載される予定です。そして、それらはすべてピン留めされた\n木曜日のムーンウィークの記事は、配信が行われるまで残ります。\n来週の水曜日（9月8日）です。\n\n詳しくは...",
      "title": "明日から月17週が始まります。ルールリマインダとスケジュール情報はこちら"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好，第17轮的月亮周已经来临。快照和民意调查将\n将在接下来的24小时内发布。然后，它们都将被编入一个钉子式的\n月亮周的帖子，该帖子将一直保留到分发完毕。\n下周三（9月8日）。\n\n关于更多信息...",
      "title": "月亮第17周明天开始。请看这里的规则提醒和日程信息"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好，第17輪的月亮周已經來臨。快照和民意調查將\n將在接下來的24小時內發佈。然後，它們都將被編入一個釘子式的\n月亮周的帖子，該帖子將一直保留到分發完畢。\n下週三（9月8日）。\n\n關於更多信息...",
      "title": "月亮第17周明天開始。請看這裏的規則提醒和日程信息"
    }
  ]
}