{
  "author": "gilgamesh_20",
  "original_created_utc": 1633269265,
  "title": "Newbies need to understand that you don't need a whole coin to make profits. Even though you can own fractions, invest in good projects. Don't buy shitcoins just cause you can get millions of crypto for a small amount.",
  "created_utc": 1633282237,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was in college the other day and heard this one guy talk about shiba inu, and was like how he invested $100 in it. In my country $100 is a huge amount. </p>\n\n<p>This is what he was saying &quot;guys, if Shiba inu goes for even $0.01 we&#39;ll be rich af.&quot;, &quot;bitcoin is expensive so buying this is good&quot;.</p>\n\n<p>I want to explain to him that he&#39;s wrong and teach him about market cap and stuff but ik he&#39;s the kind of person who won&#39;t listen to others and I&#39;d end up being a laughing stock.</p>\n\n<p>This is very common mistake. Everyone thinks big coins are expensive. You can buy crypto in fractions. If you buy $100 worth some coin and that coin goes up 10%, your $100 also gets 10% rise.</p>\n</div><!-- SC_ON -->",
  "score": 165,
  "permalink": "/r/CryptoCurrency/comments/q0i70p/newbies_need_to_understand_that_you_dont_need_a/",
  "subreddit": "CryptoCurrency",
  "id": "q0i70p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was in college the other day and heard this one guy talk about shiba inu, and\nwas like how he invested $100 in it. In my country $100 is a huge amount.\n\nThis is what he was saying \"guys, if Shiba inu goes for even $0.01 we'll be rich\naf.\", \"bitcoin is expensive so buying this is good\".\n\nI want to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "先日、大学で柴犬の話をしている人がいました。\nどうやって100ドルを投資したのかという感じでした。私の国では、100ドルはとても大きな金額です。\n\n僕の国では100ドルはとても大きな金額です。\naf.」「ビットコインは高いから、これを買うのはいいことだ」と言っていました。\n\n私は...",
      "title": "初心者の方は、利益を出すためにはコインが全部必要ではないことを理解する必要があります。たとえ端数を所有していても、良いプロジェクトに投資しましょう。少額で何百万もの暗号が手に入るからといって、クソコインを買ってはいけません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有一天，我在大学里听到一个人在谈论柴犬，他说他在柴犬身上投资了100美元。\n他说他如何投资了100美元。在我的国家，100美元是一个巨大的数字。\n\n他是这样说的：\"伙计们，如果芝罘区的价格哪怕是0.01美元，我们就会发财了。\naf.\"，\"比特币很贵，所以买这个很好\"。\n\n我想...",
      "title": "新手们需要明白，你不需要整个硬币就能获利。即使你可以拥有零头，也要投资于好的项目。不要因为你可以用少量的钱得到几百万的加密货币就购买狗屎币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有一天，我在大學裏聽到一個人在談論柴犬，他說他在柴犬身上投資了100美元。\n他說他如何投資了100美元。在我的國家，100美元是一個巨大的數字。\n\n他是這樣說的：\"夥計們，如果芝罘區的價格哪怕是0.01美元，我們就會發財了。\naf.\"，\"比特幣很貴，所以買這個很好\"。\n\n我想...",
      "title": "新手們需要明白，你不需要整個硬幣就能獲利。即使你可以擁有零頭，也要投資於好的項目。不要因爲你可以用少量的錢得到幾百萬的加密貨幣就購買狗屎幣。"
    }
  ]
}