{
  "author": "emptycagenowcorroded",
  "original_created_utc": 1638590028,
  "title": "Tsar Nicholas II had a massive tattoo of a dragon covering his whole lower forearm, which he got as a youth on a trip to Japan. Irony of a Japanese tattoo aside, what would people have thought of the Tsar with a dragon tattoo?",
  "created_utc": 1638604734,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In Tsar Nicholas II’s wikipedia page we have this passage: &lt;/p&gt;\n\n&lt;p&gt;“In 1890 Nicholas, his younger brother George, and their cousin Prince George of Greece, set out on a world tour, although Grand Duke George fell ill and was sent home partway through the trip. Nicholas visited Egypt, India, Singapore, and Siam (Thailand), receiving honors as a distinguished guest in each country. During his trip through Japan, Nicholas had a large dragon tattooed on his right forearm by Japanese tattoo artist Hori Chyo.[27] His cousin George V of England had also received a dragon tattoo from Hori in Yokohama years before.”&lt;/p&gt;\n\n&lt;p&gt;My mind is really blown about the idea of royals getting tattoos back then. Especially something as trashy as a whole forearm covering dragon tattoo. &lt;/p&gt;\n\n&lt;p&gt;How would that have been seen in contemporary Russian society? &lt;/p&gt;\n\n&lt;p&gt;How would something so esoteric and, basically, “foreign” have been talked about? &lt;/p&gt;\n\n&lt;p&gt;Was it seen as poor judgement or was everyone running out and copying his Japanese dragon tattoos in late 1890s Russia??&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/r8gw31/tsar_nicholas_ii_had_a_massive_tattoo_of_a_dragon/",
  "subreddit": "AskHistorians",
  "id": "r8gw31",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In Tsar Nicholas II’s wikipedia page we have this passage:\n\n“In 1890 Nicholas, his younger brother George, and their cousin Prince George of\nGreece, set out on a world tour, although Grand Duke George fell ill and was\nsent home partway through the trip. Nicholas visited Egypt, India, Singapore,\nand…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ニコライ2世のウィキペディアのページに、こんな一節がある。\n\n「1890年、ニコライと弟のジョージ、そして従兄弟のジョージ皇太子の3人が\nしかし、ジョージ大公は病気で倒れてしまい、その翌日から世界一周の旅に出ました。\n旅の途中で帰国させた。ニコラスはエジプト、インド、シンガポールを訪問した。\nそして...",
      "title": "皇帝ニコライ2世は、若い頃に日本に旅行した際に入れた、前腕下部全体を覆う巨大な龍のタトゥーを持っていました。日本の刺青という皮肉はさておき、竜の刺青を入れたツァーリを人々はどう思っただろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在沙皇尼古拉二世的维基百科页面中，我们有这样一段话。\n\n\"1890年，尼古拉和他的弟弟乔治，以及他们的表弟希腊的乔治亲王，开始了世界巡演。\n希腊的乔治亲王，开始了世界之旅，尽管乔治大公病倒了，在旅行途中被送回了家。\n在旅行途中被送回了家。尼古拉访问了埃及、印度、新加坡。\n和...",
      "title": "沙皇尼古拉二世有一个巨大的龙形纹身，覆盖了他的整个前臂下部，这是他年轻时去日本旅行时得到的。抛开日本纹身的讽刺意味，人们会怎么看待有龙形纹身的沙皇呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在沙皇尼古拉二世的維基百科頁面中，我們有這樣一段話。\n\n\"1890年，尼古拉和他的弟弟喬治，以及他們的表弟希臘的喬治親王，開始了世界巡演。\n希臘的喬治親王，開始了世界之旅，儘管喬治大公病倒了，在旅行途中被送回了家。\n在旅行途中被送回了家。尼古拉訪問了埃及、印度、新加坡。\n和...",
      "title": "沙皇尼古拉二世有一個巨大的龍形紋身，覆蓋了他的整個前臂下部，這是他年輕時去日本旅行時得到的。拋開日本紋身的諷刺意味，人們會怎麼看待有龍形紋身的沙皇呢？"
    }
  ]
}