{
  "author": "LSDkiller",
  "original_created_utc": 1625998581,
  "title": "How are insane temperatures in fusion reactors measured?",
  "created_utc": 1626027430,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There was a headline recently that china had cracked a fusion heat record and produced a plasma three times hotter than the sun. How are these temperatures measured? Wouldn&#39;t any device that could do it be destroyed? Is it just like an assumption that is made based on how much energy is put into the system? How do they know that it is &quot;really&quot; that heat and that there aren&#39;t other factors (like inefficiency or problems with the insulation materials) that cause the heat to be different?</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/askscience/comments/oi1xts/how_are_insane_temperatures_in_fusion_reactors/",
  "subreddit": "askscience",
  "id": "oi1xts",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "There was a headline recently that china had cracked a fusion heat record and\nproduced a plasma three times hotter than the sun. How are these temperatures\nmeasured? Wouldn't any device that could do it be destroyed? Is it just like an\nassumption that is made based on how much energy is put into the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、中国が核融合の熱記録を破り、太陽の3倍の温度のプラズマを生成したという見出しがあった。\n太陽の3倍の温度のプラズマを生成したというニュースがありました。この温度はどのようにして\n測定するのでしょうか？そんなことができる装置は破壊されてしまうのではないか？それは、まるで\n仮定のようなもので、どれだけのエネルギーが投入されているかによって...",
      "title": "核融合炉の非常識な温度はどのようにして測るのですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近有一个头条新闻，说中国已经打破了核聚变的热量记录，产生了比太阳热三倍的等离子体。\n产生了比太阳热三倍的等离子体。这些温度是如何\n测量的？任何能做到这一点的设备难道不会被摧毁吗？这是否就像一个\n假设是基于有多少能量被投入到...。",
      "title": "聚变反应堆中的疯狂温度是如何测量的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近有一個頭條新聞，說中國已經打破了核聚變的熱量記錄，產生了比太陽熱三倍的等離子體。\n產生了比太陽熱三倍的等離子體。這些溫度是如何\n測量的？任何能做到這一點的設備難道不會被摧毀嗎？這是否就像一個\n假設是基於有多少能量被投入到...。",
      "title": "聚變反應堆中的瘋狂溫度是如何測量的？"
    }
  ]
}