{
  "author": "luminous__oo",
  "original_created_utc": 1642443129,
  "title": "Am I the only parent that finds it rude when guys keep staring at my daughter’s cleavage the entire time we’re standing?!",
  "created_utc": 1642470230,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So my daughter is 18, so she’s a young adult in control of how she dresses of course (she wear low cut shirts mostly). But I’ve noticed that guys automatically keeping staring at her breasts blatantly and without even considering the fact that I’m right there and can see them do it. She’s a size 44DD so people are bound to give her attention but I wasn’t expecting it to be to that extent. Should I not feel annoyed that they keep doing that?&lt;/p&gt;\n\n&lt;p&gt;disclaimer: While I’d highly appreciate your insight on this, I’m wouldn’t expect nor need anyone to necessarily believe my concerns here. It’s immaterial.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 165,
  "permalink": "/r/TooAfraidToAsk/comments/s6akk4/am_i_the_only_parent_that_finds_it_rude_when_guys/",
  "subreddit": "TooAfraidToAsk",
  "id": "s6akk4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So my daughter is 18, so she’s a young adult in control of how she dresses of\ncourse (she wear low cut shirts mostly). But I’ve noticed that guys\nautomatically keeping staring at her breasts blatantly and without even\nconsidering the fact that I’m right there and can see them do it. She’s a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の娘は18歳なので、若い大人として服装を管理することができます。\nもちろん、ローカットのシャツを着ることが多いです。しかし、私は、男たちが\n自動的に彼女の胸をあからさまに、かつ、何の気なしに見続けている。\n私がすぐそこにいて、彼らがそうしているのを見ることができるという事実を考えてみてください。彼女は...",
      "title": "立ち話をしている間中、男が娘の胸の谷間を見つめ続けるのを失礼だと思う親は、私だけでしょうか!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的女儿今年18岁，所以她是一个年轻的成年人，当然可以控制自己的穿着。\n当然（她主要穿低胸衬衫）。但我注意到，男人\n自动一直公然盯着她的胸部，甚至不考虑我就在那里，可以看到她的胸部。\n考虑到我就在那里，可以看到他们这样做的事实。她是一个...",
      "title": "难道我是唯一一个认为男人在我们站着的时候一直盯着我女儿的乳沟是不礼貌的家长吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的女兒今年18歲，所以她是一個年輕的成年人，當然可以控制自己的穿着。\n當然（她主要穿低胸襯衫）。但我注意到，男人\n自動一直公然盯着她的胸部，甚至不考慮我就在那裏，可以看到她的胸部。\n考慮到我就在那裏，可以看到他們這樣做的事實。她是一個...",
      "title": "難道我是唯一一個認爲男人在我們站着的時候一直盯着我女兒的乳溝是不禮貌的家長嗎？"
    }
  ]
}