{
  "author": "jrjocham",
  "original_created_utc": 1631215346,
  "title": "Did store clerks really have the authority to cut up a person's bank card?",
  "created_utc": 1631285855,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A random question for those who might be old enough to remember this. A common thing to see in movies and TV made before the mid 2000s, was that when your credit card was declined, it would be destroyed. The clerk at the grocery store would pull out a big pair of scissors and cut your card in half. Or your waitress returns to your table with your card cut up into little tiny pieces...</p>\n\n<p>Did that actually happen? It seems like the ultimate dick move on the part of the business you&#39;re shopping at. If I&#39;m shopping at your store and discover in that moment that my account is overdrawn, or that I need to move some money around in my bank accounts to put more money on that card, how is cutting up my card nessecery? You just took a small issue of having to pay a bill, or transfer money around, and turned it into a bigger hassle. Now I have to order a new card and wait for it to arrive in the mail. ...and once I get it, I&#39;m certainly not going to use this new card at that store that felt they had the authority over my finances to destroy my bank card.</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/pl4mm0/did_store_clerks_really_have_the_authority_to_cut/",
  "subreddit": "AskHistorians",
  "id": "pl4mm0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "A random question for those who might be old enough to remember this. A common\nthing to see in movies and TV made before the mid 2000s, was that when your\ncredit card was declined, it would be destroyed. The clerk at the grocery store\nwould pull out a big pair of scissors and cut your card in half.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これを覚えている年配の方にランダムに質問します。よくあること\n2000年代半ば以前の映画やテレビでよく見られたのが、クレジットカードを使うと\nクレジットカードが使えなくなると、カードが破棄されるというものでした。スーパーの店員さんが\n店員さんが大きなハサミを取り出して、カードを真っ二つに切ります。....",
      "title": "店員が人の銀行カードを切る権限を持っていたのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对于那些可能年长到记得这个的人来说，一个随机的问题。一个常见的\n在2000年代中期以前的电影和电视中，经常可以看到这样的情景：当你的\n信用卡被拒绝时，它将被销毁。杂货店的店员\n会掏出一把大剪刀，把你的卡剪成两半....。",
      "title": "商店店员真的有权力切掉一个人的银行卡吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對於那些可能年長到記得這個的人來說，一個隨機的問題。一個常見的\n在2000年代中期以前的電影和電視中，經常可以看到這樣的情景：當你的\n信用卡被拒絕時，它將被銷燬。雜貨店的店員\n會掏出一把大剪刀，把你的卡剪成兩半....。",
      "title": "商店店員真的有權力切掉一個人的銀行卡嗎？"
    }
  ]
}