{
  "author": "restricteddata",
  "the_new_excerpt": "Hello /r/AskHistorians! I am Alex Wellerstein [https://alexwellerstein.com/], a\nregular contributor here, and this week my first book RESTRICTED DATA: THE\nHISTORY OF NUCLEAR SECRECY IN THE UNITED STATES\n[http://book.nuclearsecrecy.com/] (University of Chicago Press, 2021) is finally\navailable for…",
  "original_created_utc": 1617974757,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは、/r/AskHistorians! 私はアレックス・ウェラースタイン[https://alexwellerstein.com/]です。\n今週、私の最初の本「RESTRICTED DATA: THE history of nuclear secrecy in the United States」を出版しました。\nHistory of Nuclear Secrecy in the United States（米国における核の秘密の歴史\n[http://book.nuclearsecrecy.com/] (University of Chicago Press, 2021)がついに\nに発売されました。",
      "title": "AMA：私は科学史家であり、新刊「RESTRICTED DATA: THE HISTORY OF NUCLEAR SECRECY IN THE UNITED STATES」の著者であるアレックス・ウェラースタインです - 核の歴史や政府の秘密について何でも聞いてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好/r/AskHistorians! 我是Alex Wellerstein [https://alexwellerstein.com/]，是一个。\n经常在这里撰稿，而本周我的第一本书《限制数据》：The\n美国的核秘密历史\n[http://book.nuclearsecrecy.com/](芝加哥大学出版社，2021年)终于是\n可供...",
      "title": "AMA：我是亚历克斯-韦勒斯坦，科学史学家，新书《限制数据：美国核机密史》的作者--问我任何关于核历史或政府机密的问题。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好/r/AskHistorians! 我是Alex Wellerstein [https://alexwellerstein.com/]，是一個。\n經常在這裏撰稿，而本週我的第一本書《限制數據》：The\n美國的核祕密歷史\n[http://book.nuclearsecrecy.com/](芝加哥大學出版社，2021年)終於是\n可供...",
      "title": "AMA：我是亞歷克斯-韋勒斯坦，科學史學家，新書《限制數據：美國核機密史》的作者--問我任何關於核歷史或政府機密的問題。"
    }
  ],
  "title": "AMA: I am Alex Wellerstein, historian of science, author of the new book RESTRICTED DATA: THE HISTORY OF NUCLEAR SECRECY IN THE UNITED STATES — ask me anything about nuclear history or government secrecy",
  "created_utc": 1617979834,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello <a href=\"/r/AskHistorians\">/r/AskHistorians</a>! I am <a href=\"https://alexwellerstein.com/\">Alex Wellerstein</a>, a regular contributor here, and this week my first book <strong><a href=\"http://book.nuclearsecrecy.com/\">RESTRICTED DATA: THE HISTORY OF NUCLEAR SECRECY IN THE UNITED STATES</a></strong> (University of Chicago Press, 2021) is finally available for purchase! Note that if you are interested in buying a <em>signed and inscribed</em> copy (for no additional cost, but it will be slower than ordering it normally, as I will be signing them all individually), <a href=\"http://blog.nuclearsecrecy.com/2021/04/05/restricted-data-the-history-of-nuclear-secrecy-in-the-united-states-now-available/\">see the instructions here</a>.</p>\n\n<p>I&#39;ve spend some 15 years researching the <strong>history of nuclear technology</strong> (mostly weapons, but some power topics, especially where the two categories intersect) and researching the <strong>history of governmental and scientific secrecy</strong> in the United States. I am presently an Assistant Professor (recently promoted to Associate with tenure, starting in August) at the Stevens Institute of Technology in Hoboken, New Jersey. I am best-known on the internet for being the creator of the <a href=\"https://nuclearsecrecy.com/nukemap/\">NUKEMAP</a> online nuclear weapons effects simulator.</p>\n\n<p><em>RESTRICTED DATA</em> covers the attempt in the United States by scientists, government administrators, and the military to try to control the spread of nuclear weapons technology through the spread of <em>information</em> about how said technology works. Here is the relevant &quot;summary of the book&quot; paragraph from the Introduction:</p>\n\n<blockquote>\n<p>The American nuclear secrecy “regime” has evolved several times from its emergence in the late 1930s through our present moment in the early twenty-first century. Each chapter of this book explores a key shift in how nuclear secrecy was conceived of, made real in the world, and challenged. Roughly speaking, one can divide the history of American nuclear secrecy into three major parts: the birth of nuclear secrecy, the solidification of the Cold War nuclear secrecy regime, and the challenges to the regime that began in the late Cold War and continue into the present.</p>\n\n<p>Part I (chapters 1–3) narrates the origins of nuclear secrecy in the context of World War II. This was a secrecy initially created as an informal “self-censorship”\ncampaign run by a small band of refugee nuclear physicists who feared that any publicized research into the new phenomena of nuclear fission would spark a weapons program in Nazi Germany. As the possibility of nuclear weapons becoming a reality grew, and official government interest increased, this informal approach was transmuted into something more rigid, but still largely run by scientists: a secrecy of “scientist-administrators” created by Vannevar Bush and James Conant, two powerful wartime scientists, that gradually put in place a wide variety of secrecy practices surrounding the weapons. When the work was put into the hands of the US Army Corps of Engineers, and became the Manhattan Project, these efforts expanded exponentially as the project grew into a virtual empire. And for all of the difficulty of attempting to control a workforce in the hundreds of thousands, the thorniest questions would come when these scientific, military, and civilian administrators tried to contemplate how they would balance the needs for “publicity” with the desires of secrecy as they planned to use their newfound weapon in war.</p>\n\n<p>Part II (chapters 4–6) looks at this wartime secrecy regime as it was transformed from what was largely considered a temporary and expedient program into something more permanent and lasting. Out of late-wartime and postwar debates about the “problem of secrecy,” a new system emerged, centered on the newly created Atomic Energy Commission and “Restricted Data,” a novel and unusually expansive legal category that applied only to nuclear secrets. This initial approach was characterized by a continued sense that it needed reform and liberalization, but these efforts were dashed by three terrific shocks at the end of the decade: the first Soviet atomic bomb test, the hydrogen bomb debate, and the revelation of Soviet atomic espionage. In the wake of these events, which reinforced the idea of a totemic “secret” of the bomb while at the same time emphasizing a nuclear American vulnerability, a new, bipolar approach to secrecy emerged. This “Cold War regime” simultaneously held that to release an atomic secret inappropriately was to suffer consequences as extreme as death, but that once atomic information had been deemed safe (and perhaps, profitable), it ought to be distributed as widely as possible.</p>\n\n<p>Part III (chapters 7–9) chronicles the troubles that this new Cold War mindset about secrecy encountered from the 1960s through the present. Many of these were problems of its own making: embodying both the extremes of constraint and release, the Cold War approach to nuclear secrecy fundamentally rested on the dubious assertion that the technology it governed could be divided into simple categories of safety and danger, despite its inherently dual-use nature. These inherent conflicts were amplified by the rise of a powerful anti-secrecy politics in the 1970s, which motivated a wide spectrum of people—ranging from nuclear weapons designers to college students and anti-war activists— to attempt to dismantle the system in whole or in part. The end of the Cold War brought only brief respite, as initial efforts to reform the system faltered in the face of partisan politics and new fears from abroad.</p>\n</blockquote>\n\n<p>Overall, I argue that one of the things that makes American nuclear secrecy so interesting is that it sits at a very interesting nexus of belief in the power of scientific knowledge, the desire for control and security, and the underlying cultural and legal values of openness and transparency. These at times mutually contradictory forces produced deep tensions that ensured that nuclear secrecy was, from the beginning, incredibly controversial and always contentious, and we live with these tensions today.</p>\n\n<p>So please, Ask Me Anything! I&#39;m happy to answer any questions you might have about the history of nuclear weapons generally, but especially anything that relates to the topic of my book, or its creation. </p>\n\n<p><strong>I will be on and off all day and try to answer all serious questions.</strong> I have some meetings throughout the day that will draw me away for a few hours but I&#39;ll be back after them — feel free to post questions until I declare that I am done answering them. :-)</p>\n</div><!-- SC_ON -->",
  "score": 123,
  "permalink": "/r/AskHistorians/comments/mnh5dy/ama_i_am_alex_wellerstein_historian_of_science/",
  "subreddit": "AskHistorians",
  "id": "mnh5dy",
  "is_self": true,
  "media": null,
  "is_video": false
}