{
  "author": "Many_Scratch2269",
  "original_created_utc": 1630362306,
  "title": "Reminder: Open your vault while you can.",
  "created_utc": 1630377454,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>You get moons every month, and it is nearly that time of the month where everyone gets moons. You might ignore this post today because moons are not worth much, but let me remind you there are only going to be so many moons in circulation. The moons are distributed less and less, and the price of each moon is only going up from here.</p>\n\n<p>Oh, and did I mention they are also going on the mainnet? This probably means some exchanges will list moons on their websites causing the price to go up. A vault takes a few clicks to open. Just like the old Bitcoin faucet used to give you 5 whole Bitcoins for a few clicks a decade ago.</p>\n\n<p>Open your vaults before it&#39;s too late.</p>\n</div><!-- SC_ON -->",
  "score": 173,
  "permalink": "/r/CryptoCurrency/comments/pespqy/reminder_open_your_vault_while_you_can/",
  "subreddit": "CryptoCurrency",
  "id": "pespqy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "You get moons every month, and it is nearly that time of the month where\neveryone gets moons. You might ignore this post today because moons are not\nworth much, but let me remind you there are only going to be so many moons in\ncirculation. The moons are distributed less and less, and the price of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "毎月のように月が出てきて、そろそろみんなが月を出す季節になってきましたね。\n誰もが月を手にする時期になりました。今日のこの記事を無視するかもしれませんが、月にはあまり価値がないので\n今日のこの記事を無視するかもしれませんが、循環する月の数は限られていることをお伝えしておきます。\n循環しています。ムーンの流通量は少なくなり、価格も...",
      "title": "リマインダーです。金庫は今のうちに開けておきましょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你每个月都有月亮，现在几乎是每月的那个时候，每个人都有月亮。\n每个人都会有月亮。你可能会忽略今天这个帖子，因为月亮并不值钱。\n价值，但让我提醒你，只有这么多的月亮在\n流通。月亮的分布越来越少，价格也...",
      "title": "提醒您。趁机打开你的金库。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你每個月都有月亮，現在幾乎是每月的那個時候，每個人都有月亮。\n每個人都會有月亮。你可能會忽略今天這個帖子，因爲月亮並不值錢。\n價值，但讓我提醒你，只有這麼多的月亮在\n流通。月亮的分佈越來越少，價格也...",
      "title": "提醒您。趁機打開你的金庫。"
    }
  ]
}