{
  "author": "step11234",
  "original_created_utc": 1635266233,
  "title": "PSA: You do not get 20% bonus MOONS for holding in your vault, you get a 20% bonus to your KARMA if you hold them.",
  "created_utc": 1635273052,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>&quot;If you hold moons in your vault you get a 20% bonus on the next distribution!!&quot;</strong></p>\n\n<p>Seen this before? Or something similar? I&#39;ve seen this at least 4-5 times in highly upvoted posts in just the last 2 or 3 days and it&#39;s NOT accurate and, imo, is pretty misleading for new people.</p>\n\n<p>It can be taken in one of two ways:</p>\n\n<ol>\n<li>You get 20% bonus on moons you earned for the month from upvotes. Turning 1000 moons into 1200 moons. This is <em>technically</em> accurate since you do get a bonus on karma and 20% more karma will mean 20% more moons!</li>\n<li>For holding 1000 moons in your vault, you will get 200 bonus moons JUST for holding. This is NOT accurate and I&#39;ve seen multiple misunderstandings of this.</li>\n</ol>\n\n<p>How it actually works is that if you hold the last distribution of moons in your vault you will receive a 20% bonus to the karma calculation for the upcoming snapshot. Let&#39;s have a look at an example:</p>\n\n<p>We&#39;ll use a very basic example of 1000 karma accumulated for the 28 day period from upvotes including all other bonuses (apart from the 20% from hodling). And I&#39;m going to assume that the moon karma ratio is 0.25.</p>\n\n<p>Using 1000*0.25 to calculate our moon amount, we would receive 250 moons for our <del>shitposting</del> hard work!</p>\n\n<p>But if we held our last distribution, we would get a 20% bonus, which would net us 1200 karma total. This would equal 1200*0.25 for a total of 300 moons. While this is 20% extra moons when all is said and done, it is distinctly different from saying &quot;we get 20% bonus moons for hodling&quot;, which I&#39;ve seen numerous people mistake for something akin to staking.</p>\n\n<p>Please be more specific in the language you use and let&#39;s not mislead people with false information.</p>\n\n<p>EDIT: As <a href=\"/u/fan_of_hakiksexydays\">/u/fan_of_hakiksexydays</a> pointed out rightfully, the moon distribution amount is fixed per distribution, so the only time you would REALLY get a 20% bonus to moons is if you were the only one who hodled the previous distribution.</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/CryptoCurrency/comments/qgaeds/psa_you_do_not_get_20_bonus_moons_for_holding_in/",
  "subreddit": "CryptoCurrency",
  "id": "qgaeds",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "\"If you hold moons in your vault you get a 20% bonus on the next distribution!!\"\n\nSeen this before? Or something similar? I've seen this at least 4-5 times in\nhighly upvoted posts in just the last 2 or 3 days and it's NOT accurate and,\nimo, is pretty misleading for new people.\n\nIt can be taken in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "\"金庫に月を入れておくと、次の配信で20％のボーナスがもらえる！\"\n\nこれ、見たことありますか？それとも似たようなもの？この2、3日の間に、少なくとも4、5回、投票率の高い投稿で見ました。\nこの2～3日の間に、投票率の高い投稿で少なくとも4～5回見ましたが、正確ではありません。\nこれは正確ではありませんし、初めての人にとってはかなり誤解を招くものだと思います。\n\nそれは、以下のように受け取ることができます。",
      "title": "PSA: 金庫に保持することで20%のボーナスMOONが得られるのではなく、保持することで自分のKARMAに20%のボーナスが得られるのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "\"如果你在你的金库中持有月亮，你将在下一次分配中获得20%的奖金！！\"\n\n以前见过这个吗？或者类似的东西？在过去的两三天里，我至少看到过4-5次这样的帖子\n在过去的2、3天里，我至少看到过4-5次这样的帖子，而且都是高票通过的，这并不准确，而且。\n我认为，这对新人来说是相当大的误导。\n\n它可以被视为...",
      "title": "PSA：你在金库中持有的月球并没有得到20%的奖励，如果你持有它们，你会得到20%的KARMA奖励。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "\"如果你在你的金庫中持有月亮，你將在下一次分配中獲得20%的獎金！！\"\n\n以前見過這個嗎？或者類似的東西？在過去的兩三天裏，我至少看到過4-5次這樣的帖子\n在過去的2、3天裏，我至少看到過4-5次這樣的帖子，而且都是高票通過的，這並不準確，而且。\n我認爲，這對新人來說是相當大的誤導。\n\n它可以被視爲...",
      "title": "PSA：你在金庫中持有的月球並沒有得到20%的獎勵，如果你持有它們，你會得到20%的KARMA獎勵。"
    }
  ]
}