{
  "author": "c12mintz",
  "the_new_excerpt": "BUY: NMCI (Navios Containers) NMM (Navios Partners) DAC (Danaos Corp)\n\nI posted here on Monday morning\n[https://www.reddit.com/r/investing/comments/l9unrf/containership_boom_ongoing/]\non these stocks, but news is quickly improving even further, so it merits yet\nanother update. Since last Friday, my…",
  "original_created_utc": 1612546413,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "买入：NMCI(Navios Containers) NMCI (Navios Containers) NMM (Navios Partners) DAC (Danaos Corp)\n\n我星期一早上在这里发过帖子\n[https://www.reddit.com/r/investing/comments/l9unrf/containership_boom_ongoing/]\n在这些股票上，但消息很快就会进一步改善，所以值得再次\n另一个更新。从上周五开始，我的...",
      "title": "集装箱船热潮：最新情况--运价急剧上升。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "買入：NMCI(Navios Containers) NMCI (Navios Containers) NMM (Navios Partners) DAC (Danaos Corp)\n\n我星期一早上在這裏發過帖子\n[https://www.reddit.com/r/investing/comments/l9unrf/containership_boom_ongoing/]\n在這些股票上，但消息很快就會進一步改善，所以值得再次\n另一個更新。從上週五開始，我的...",
      "title": "集裝箱船熱潮：最新情況--運價急劇上升。"
    }
  ],
  "title": "Container Ship Boom: Update - Rates Surging Higher",
  "created_utc": 1612617194,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>BUY: NMCI (Navios Containers) NMM (Navios Partners) DAC (Danaos Corp)</strong></p>\n\n<p>I posted here on <a href=\"https://www.reddit.com/r/investing/comments/l9unrf/containership_boom_ongoing/\">Monday morning</a> on these stocks, but news is quickly improving even further, so it merits yet another update. Since last Friday, my top 3 picks in the container sector have moved up by a range of 24% to 27%:</p>\n\n<p>· DAC: +24%</p>\n\n<p>· NMCI: +25%</p>\n\n<p>· NMM: +27%</p>\n\n<p>As I noted last week, rates for containerships (the ships which carry thousands of the 20-40’ boxes you see on railroads and trucks) have been going ballistic the past 4-5 months, but some of the stocks have stalled out and still trade at remarkably cheap valuations. For instance NMCI trades in the neighborhood of 2x my expectations for their 2021 earnings.</p>\n\n<p>Link to the latest containership rates: <a href=\"https://harpex.harperpetersen.com/harpexVP.do\">https://harpex.harperpetersen.com/harpexVP.do</a></p>\n\n<p>The latest Harpex rates are posted each Friday morning. The new update that came out about 2 hours ago has them up another 13.2% for the midsize Panamax segment. This is a daily rate of $30,000 for the ships that hold 4,250 TEU (i.e. the ship can carry 4,250 20-foot boxes or a little more than 2,000 40-foot boxes). Remember the trains? Those are usually 40&#39; on top of another 40&#39; per each car.</p>\n\n<p>As I mentioned earlier, I&#39;m currently long about every name possible in the sector. The names remain cheap. However, obviously if stocks keep surging, I will take profits in a responsible manner on the way up. &quot;Diam hands&quot; is a funny/cute meme, but it&#39;s really quite dumb for investors. Do your own due diligence, figure out what you believe something is worth, and don&#39;t get greedy!</p>\n\n<p>The 13%+ increase in mid-sized container rates exemplifies the strength for a firm like NMCI (which owns 25 of these &#39;Panamax&#39; ships!), but we should also look at Danaos Corp, which just announced a <a href=\"https://www.danaos.com/news-and-media/press-release-details/2021/Danaos-Corporation-Announces-Pricing-of-Senior-Notes-Offering/default.aspx\">comprehensive refinancing</a> for the whole company.</p>\n\n<p>This is a massive turnaround from a company, which was on the verge of bankruptcy just a year ago. After the refinancing DAC has a very streamlined balance sheet with no major maturities until 2028. Don&#39;t just take my view of it! Randy Giveans, analyst at Jefferies, and a guy I can personally vouch for as a competent analyst with strong integrity, <strong><em>just upgraded them to $40.00/sh</em></strong>. I think he might even be too conservative on them...</p>\n\n<p>I believe we&#39;re potentially just in the 4th or 5th inning of this run.</p>\n\n<p><strong>Bottom Line:</strong> Bullish on containership names, really the entire sector, but most specifically DAC, NMCI, and NMM. NMM will likely be acquiring NMCI via a merger at 0.39 ratio in the next few weeks.</p>\n\n<p><strong>Questions/Pushback:</strong></p>\n\n<ol>\n<li>Aren&#39;t these rates just in a massive bubble and will crash soon?</li>\n</ol>\n\n<p>The rates appear to be quite strong compared to the past 10 years, but if you look at a 20-year average and the strength of the 2000s, you&#39;ll see they aren&#39;t that far out of line. The past decade, and 2013-2018 in particular, was a horrible time for container ships. These are cyclical stocks sort of like automakers or airlines or mining. Furthermore, the rates we quote and discuss are rates for 1-year and oftentimes 2-3 year deals are being signed at similar levels of strength. These aren&#39;t just 1-2 month type &#39;spot&#39; rates.</p>\n\n<p>2) Is this like &quot;tankers?&quot; I got burned there and I believe shipping sucks!?</p>\n\n<p>Tankers were earning literal all-time record highs last Spring, but these were just for 30-80 day voyages. Unlike containers, the rates were record highs, no prior precedent for long-term duration. Also, unlike containers, the duration was 30-80 days, not 1-3 years. Finally, unlike containers, the tanker rates were driven by a very short-term arbitrage due to collapsing oil prices. Containers were already strong in late-2019 on a major cyclical upswing before temporarily being interrupted by COVID.</p>\n\n<p>3) Isn&#39;t all this rate strength only due to COVID-19 and will go away soon?</p>\n\n<p>Containerships were already in a massive upturn during 2019 and into the very start of 2020. Then COVID interrupted all this and rates briefly collapsed. Yes, port delays and other issues from COVID are helping keep rates higher, but this isn&#39;t just a temporary dislocation like tankers, the rates were already strong without COVID.</p>\n\n<p>4) I like NMCI, but my understanding is NMM is buying them, how to choose?</p>\n\n<p>In my *personal opinion,* the best thing is to buy whatever is cheaper. So I take NMM and multiply by 0.39 and buy the cheaper one. As I&#39;m writing this, NMCI is much cheaper than NMM by about 3-5%. Why? I believe it&#39;s mostly because people can buy NMM and sell $17.50 or $20.00 (or higher) covered calls against it for a premium. NMCI doesn&#39;t have a liquid options market. This is a temporary spread and I believe it will close within 3-6 weeks when the merger is (likely) completed.</p>\n\n<p>5) Shipping is a horrible sector and nobody can every make money in it!</p>\n\n<p>I hear this a lot. It&#39;s just not true if you have access to good research and are nimble with your positions. I&#39;ve beaten the industry average for 6 of 6 years (2015-2021 YTD) and I&#39;ve beaten the Russell 2000 for 5 of 6 years (all except for 2020 where underperformed). It is important to watch out for governance. DryShips (DRYS) was one example of a horribly managed firm.</p>\n\n<p>6) Won&#39;t liners just order more ships and destroy this amazing market?</p>\n\n<p>The average delivery window for new ships ordered today is between mid-2023 and mid-2024. They can order them sure, and some have been, but this won&#39;t make much of any impact on current rates/balance. The shipping world erroneously believed that midsize tonnage was obsolete (i.e. either go huge for big scale or go really small for niche coastal trades), but that turned out to be completely wrong. Therefore there were almost zero midsized ships ordered between 2012-2020 and the fleet is fairly middleaged to older on average. Fleet growth might even be negative in some areas.</p>\n\n<p><strong><em>Disclosure:</em></strong> I’m long nearly every name in the space- ATCO CPLP DAC MPCC (Oslo) NMCI NMM ZIM. I have a medium-term to longer-term constructive view on this space, but I do take profits to rationalize my portfolio when things surge. &quot;Diam hands&quot; is a dumb meme. If there&#39;s a lot of volatility, I might be a seller or switch positions (for example, I just sold CMRE this morning and rolled it into ZIM).</p>\n\n<p>I have about 10% of my wealth in $NMCI/$NMM. Average basis in NMCI is in the lower-$1s after buying a lot this summer at 70-80c. I previously sold 20% on 4 January at $4.44 and I sold 20% on 14 January at $5.49. I will probably sell another 15-20% in the $7s. I disclose all of my positions and trades in real-time (or as real-time as possible) on my research platform.</p>\n\n<p><strong><em>Nothing in this post constitutes investment advice in ANY fashion.</em></strong> I&#39;m just a guy sharing my positions and research and talking about what I like and what I own. Don&#39;t be dumb.</p>\n</div><!-- SC_ON -->",
  "score": 56,
  "permalink": "/r/investing/comments/ldcdr7/container_ship_boom_update_rates_surging_higher/",
  "subreddit": "investing",
  "id": "ldcdr7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123198817
}