{
  "author": "cm2_0",
  "the_new_excerpt": "WHAT IS SHIBA INU TOKEN\n\nFrom their website:\n\n> SHIB is an experiment in decentralized spontaneous community building. SHIB\n> token is our first token and allows users to hold Billions or even Trillions\n> of them.  Nicknamed the DOGECOIN KILLER, this ERC-20 ONLY token can remain\n> well under a penny…",
  "original_created_utc": 1620662350,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "柴犬トークンとは\n\nウェブサイトより\n\n> SHIBは分散型の自発的なコミュニティ形成の実験です。SHIB\n> トークンは私たちの最初のトークンであり、ユーザーは何十億、何兆ものト\n> を保有することができます。  DOGECOIN KILLERと呼ばれるこのERC-20専用トークンは、1ペニー以下で\n> 1ペニー以下で購入することができます。",
      "title": "SHIBA INUトークンをFOMOintoしようとしている人は、まずこの記事を読んでください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "什么是柴犬信物\n\n来自他们的网站。\n\n> SHIB是一个去中心化自发社区建设的实验。SHIB\n> 代币是我们的第一个代币，允许用户持有数十亿甚至上万亿的\n>的。  绰号为DOGECOIN KILLER，这种ERC-20唯一的代币可以保持在\n>远低于1分钱...",
      "title": "如果你要FOMO进SHIBA INU的代币，请先阅读这篇文章。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "什麼是柴犬信物\n\n來自他們的網站。\n\n> SHIB是一個去中心化自發社區建設的實驗。SHIB\n> 代幣是我們的第一個代幣，允許用戶持有數十億甚至上萬億的\n>的。  綽號爲DOGECOIN KILLER，這種ERC-20唯一的代幣可以保持在\n>遠低於1分錢...",
      "title": "如果你要FOMO進SHIBA INU的代幣，請先閱讀這篇文章。"
    }
  ],
  "title": "If you are about to FOMOinto SHIBA INU token, please read this post first",
  "created_utc": 1620672618,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h1>What is SHIBA INU token</h1>\n\n<p>From their website:</p>\n\n<blockquote>\n<p>SHIB is an experiment in decentralized spontaneous community building. SHIB token is our first token and allows users to hold Billions or even Trillions of them.  Nicknamed the DOGECOIN KILLER, this ERC-20 ONLY token can remain well under a penny and still outpace Dogecoin in a small amount of time (relatively speaking). Popular worldwide, and already up thousands of percent, Shiba token ($Shib) is the first cryptocurrency token to be listed and incentivized on ShibaSwap, our decentralized exchange.</p>\n</blockquote>\n\n<p>So, It’s an <strong>ERC-20 token</strong>. It is a token created on the Ethereum blockchain. That means that to send the tokens to another wallet or just to transfer those tokens from an exchange to your wallet, you’d have to pay the transaction fees with ETH. And do you know how high are the fees on the Ethereum blockchain right now? They are are pretty high. So, that’s the first red flag for me. But let’s continue.</p>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>We locked the 50% of the total supply to Uniswap and threw away the keys!  The remaining 50% was burned to Vitalik Buterin and we were the first project following this path, so everyone has to buy on the open market, ensuring a fair and complete distribution where devs don&#39;t own team tokens they can dump on the community.</p>\n</blockquote>\n\n<p>I don’t know whatever the fuck this means. I understand that 50% of the total supply (500 trillion) is gone. So since the total supply is 1 quadrillion, the remaining 50%, have been sent to the wallet of V<strong>italik Buterin. I honestly don’t understand why, but SHIB TO THE MOON, right? Right guys?</strong></p>\n\n<h1>Tokenomics</h1>\n\n<p>So, now to analyze the tokenomics of SHIB, I’ll need some help from my dear friend. His name is math and some people hate him because he always speaks the truth. So, if you want an in-depth explanation about why the price doesn’t matter, read this <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/n5wkwq/will_doge_be_worth_100_a_coin_can_it_become_as/\">post</a>. Here, I’ll just analyze the tokenomics of SHIB.</p>\n\n<p><strong>Total supply</strong>: since the 50% of the total supply is gone, let&#39;s say the total supply is 500 trillion.</p>\n\n<p><strong>Circulating supply</strong>: 394 trillion (39% of the total supply)</p>\n\n<p><strong>Price</strong>: 0.000028</p>\n\n<p><strong>Market cap:</strong> 11.1731504753274 billion</p>\n\n<p>So, if SHIB actually replaces DOGE and goes to the market cap of DOGE (64.26173717196869 billion), THE 4% OF THE ENTIRE CRYPTO MARKET, a SHIB would be worth .000163 cents. So it&#39;s mathematically impossible that SHIB goes to 0.1. Sorry.</p>\n\n<p>That said, chill, learn, be patient and don’t fucking chase pumps.</p>\n\n<p>EDIT1: grammar. Also thanks for the awards, guys! </p>\n</div><!-- SC_ON -->",
  "score": 1206,
  "permalink": "/r/CryptoCurrency/comments/n98l7w/if_you_are_about_to_fomointo_shiba_inu_token/",
  "subreddit": "CryptoCurrency",
  "id": "n98l7w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985992422
}