{
  "author": "Creepy_Amoeba5596",
  "original_created_utc": 1637831885,
  "title": "Exposing a Scammer on this Subreddit",
  "created_utc": 1637875823,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Very recently I found a suspicious <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/r13ebf/this_app_rewards_with_free_crypto_of_your_choice/\">post</a> about an app that gives you free crypto when you shop. It was advertised as a cash back app, but instead of getting money, you would get crypto. However, the shilly nature of the post had me seeing red flags everywhere. The instant I read through it, it felt like I was reading a sponsored ad rather than an actual post to reddit.</p>\n\n<p>So, I started looking into the person who made this suspicious post, <a href=\"/u/Fast_Midnight381\">u/Fast_Midnight381</a>.</p>\n\n<p>I begun to notice a range of unusual ”coincidences” surrounding this user</p>\n\n<ol>\n<li>At the time of their post, they were the moderator and only member of <a href=\"/r/tuktukcrypto\">r/tuktukcrypto</a>. Tuktuk  Crypto was the app they were shilling. However, they have now left the moderator position of that subreddit since I flagged this in a comment the initial post</li>\n<li>While their account is about a year old, they only started posting and commenting frequently about 20 days ago, which was the same time <a href=\"/r/tuktukcrypto\">r/tuktukcrypto</a> was created.  It seems like they booted up their old reddit account for the sole purpose of shilling this app</li>\n<li>They have an insane number of posts in their history shilling this platform. I think around half of their posts are shilling this app. The other half is farming karma and trying to get laid, lol.</li>\n</ol>\n\n<p>Here is a list of some of the posts I found, all of which never fail to mention the Tuktuk app. Some of the posts have been removed by moderators or deleted, but I tried to mostly include the ones still visible.</p>\n\n<ol>\n<li><a href=\"https://www.reddit.com/r/BitcoinBeginners/comments/r1qr0j/how_to_maximize_purchasing_bitcoins_as_a_regular/\">How To Maximize Purchasing Bitcoins As A Regular Joe?</a></li>\n<li><a href=\"https://www.reddit.com/r/btc/comments/r1f69n/here_is_a_collection_of_best_effective_ways_to/\">Here Is A Collection Of Best, Effective Ways To Earn Free BTC</a></li>\n<li><a href=\"https://www.reddit.com/r/fiaustralia/comments/qmh7n9/fellow_aussies_what_are_your_some_of_the_favorite/\">Fellow Aussies, what are your some of the favorite apps to save, earn rewards and cashbacks?</a></li>\n<li><a href=\"https://www.reddit.com/r/BitcoinBeginners/comments/r1j02l/effective_ways_to_earn_free_bitcoin_for_beginners/\">Effective Ways To Earn Free Bitcoin For Beginners</a></li>\n<li><a href=\"https://www.reddit.com/r/SHIBArmy/comments/r1r12u/this_rewards_app_lets_you_earn_free_shib/\">This Rewards App Lets You Earn Free $SHIB</a></li>\n</ol>\n\n<p>After all this, you‘re probably thinking, this person is clearly incredibly dodgy. In the best case scenario, they they may have created this app or are being paid to shill it. At the very worst case, they are attempting to scam people out of their money using reddit. Either way, I don’t think anyone would go near this app after reading this. However, that’s because you got the privilege of reading through what I already found. Crazily enough, the initial reaction to the post was actually somewhat positive, before I left a scathing comment. It was only after my comment that people started to see it  as a dodgy ad.</p>\n\n<p>Here are some of the comments left on the post</p>\n\n<ul>\n<li>”Cashback is such a great concept, it should be more casually used!”</li>\n<li>“Recently I came up with the idea of ​​creating such a site looking at the popularity of Cashback sites .. and there is something like that. Thanks for the info”</li>\n<li>”No disrespect but I don&#39;t like its name lol. Nice app though, will share.”</li>\n</ul>\n\n<p>Luckily the post didn’t gain much traction, so I don’t think anyone actually took the bait. But, here is the daily reminder to be careful what you see on this subreddit. There are lots of scammers hanging around, ready to pounce. Don’t believe everything you see online, think critically and DYOR.</p>\n</div><!-- SC_ON -->",
  "score": 159,
  "permalink": "/r/CryptoCurrency/comments/r1snro/exposing_a_scammer_on_this_subreddit/",
  "subreddit": "CryptoCurrency",
  "id": "r1snro",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Very recently I found a suspicious post\n[https://www.reddit.com/r/CryptoCurrency/comments/r13ebf/this_app_rewards_with_free_crypto_of_your_choice/]\nabout an app that gives you free crypto when you shop. It was advertised as a\ncash back app, but instead of getting money, you would get crypto.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ごく最近、怪しい投稿を見つけました\n[https://www.reddit.com/r/CryptoCurrency/comments/r13ebf/this_app_rewards_with_free_crypto_of_your_choice/]\n買い物をすると無料で暗号をくれるアプリについて キャッシュバックアプリとして宣伝されていましたが\nキャッシュバックアプリとして宣伝されていましたが、お金をもらうのではなく、暗号をもらうことができました....",
      "title": "このSubredditでの詐欺師の暴露"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近我发现一个可疑的帖子\n[https://www.reddit.com/r/CryptoCurrency/comments/r13ebf/this_app_rewards_with_free_crypto_of_your_choice/]\n关于一个在你购物时给你免费加密货币的应用程序。它被宣传为\n现金返还应用，但你得到的不是钱，而是加密货币....。",
      "title": "揭露本分站的诈骗者"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近我發現一個可疑的帖子\n[https://www.reddit.com/r/CryptoCurrency/comments/r13ebf/this_app_rewards_with_free_crypto_of_your_choice/]\n關於一個在你購物時給你免費加密貨幣的應用程序。它被宣傳爲\n現金返還應用，但你得到的不是錢，而是加密貨幣....。",
      "title": "揭露本分站的詐騙者"
    }
  ]
}