{
  "author": "HashtagAvocado",
  "original_created_utc": 1630645771,
  "title": "Is anyone else not doing the best emotionally/mentally because of the world/society right now?",
  "created_utc": 1630660916,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Kind of straightforward, but given the general state of- <em>gestures to everything</em> -I know <em>I’m</em> not doing the best right this second (especially as an American woman in a state just itching to take my autonomy away). </p>\n\n<p>I’ve talked to friends, and they’ve mentioned feeling off as well, but is anyone else feeling this  internal existential dread from Covid/climate change/abortion laws/the economy? My therapist keeps telling me “everything will be fine, focus on xyz” and it feels a little patronizing to me. Like there’s some serious stuff going on right now and you just want me to like what, check my email and shit?</p>\n\n<p>I can’t be alone in this, right?</p>\n</div><!-- SC_ON -->",
  "score": 112,
  "permalink": "/r/NoStupidQuestions/comments/pgyl1t/is_anyone_else_not_doing_the_best/",
  "subreddit": "NoStupidQuestions",
  "id": "pgyl1t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Kind of straightforward, but given the general state of- gestures to everything\n-I know I’m not doing the best right this second (especially as an American\nwoman in a state just itching to take my autonomy away).\n\nI’ve talked to friends, and they’ve mentioned feeling off as well, but is anyone\nelse…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "簡単なことですが、一般的な状況を考えると......すべてに身振り手振りをつけます。\n-私は今、ベストな状態ではないと思っています（特に、自治権を奪おうとしている国のアメリカ人女性として）。\n特に、アメリカ人女性として、私の自主性を奪おうとしている国で）。)\n\n友人に聞いてみたところ、彼らも同様に気分が悪いと言っていましたが、他に誰か\n他には...",
      "title": "今の世の中・社会のせいで、感情的・精神的にベストな状態ではない人はいませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有点直截了当，但考虑到总体状况--对一切事物的手势\n-我知道我现在做的不是最好的（尤其是作为一个美国女人，在一个急于夺走我的自主权的国家里）。\n尤其是作为一个美国女人，在一个急于夺走我的自主权的国家）。)\n\n我和朋友们谈过，他们也提到了我的感受，但是否有人\n其他人...",
      "title": "还有人因为现在的世界/社会而在情感/精神上做得不尽如人意吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有點直截了當，但考慮到總體狀況--對一切事物的手勢\n-我知道我現在做的不是最好的（尤其是作爲一個美國女人，在一個急於奪走我的自主權的國家裏）。\n尤其是作爲一個美國女人，在一個急於奪走我的自主權的國家）。)\n\n我和朋友們談過，他們也提到了我的感受，但是否有人\n其他人...",
      "title": "還有人因爲現在的世界/社會而在情感/精神上做得不盡如人意嗎？"
    }
  ]
}