{
  "author": "UnexperiencedIT",
  "original_created_utc": 1636460947,
  "title": "I have my own fear and I call it FOTP - fear of taking profits",
  "created_utc": 1636471854,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So my biggest fear is actually taking profits. It sounds silly but bear with me.</p>\n\n<p>Most of the time when I did that the price continued rising and I would start sweating, watching the charts all the time, cursing myself for selling, buying at a higher price and it kinda left an impact on me.</p>\n\n<p>I was hodling in May and June 2021, without any panic, fear, fud or anything similar to that.</p>\n\n<p>I was fine with all of it because in the worst case scenario I was thinking that I will just lose the money that I can afford to lose, and in the best case scenario the prices will rise again and I will earn more then I invested. I invested my money in good projects and that made me super calm about the whole situation.</p>\n\n<p>But now I have a feeling that we are closer and closer to get some good gains and my fear is starting to mess with me again. I need a better exit strategy honestly, but it is so hard. I was thinking to start DCAing out bit by bit, and if the price goes down just buy it again. DCA in, DCA out, but still, I will be honest, I am terrified when it comes to selling.</p>\n</div><!-- SC_ON -->",
  "score": 380,
  "permalink": "/r/CryptoCurrency/comments/qq2mk5/i_have_my_own_fear_and_i_call_it_fotp_fear_of/",
  "subreddit": "CryptoCurrency",
  "id": "qq2mk5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So my biggest fear is actually taking profits. It sounds silly but bear with me.\n\nMost of the time when I did that the price continued rising and I would start\nsweating, watching the charts all the time, cursing myself for selling, buying\nat a higher price and it kinda left an impact on me.\n\nI was…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "だから一番怖いのは、実際に利益を出すことです。バカバカしいと思うかもしれませんが、ご理解ください。\n\n大抵の場合、そうすると価格は上昇し続け、私は汗をかき始めます。\n汗をかき、チャートをずっと見ていて、高値で売ったり買ったりした自分を呪ったものです。\n高値で売ったり買ったりした自分を呪ったりして、ちょっとした衝撃を受けました。\n\n私は...",
      "title": "私には自分なりの恐怖心があり、それをFOTP（利益を得ることの恐怖）と呼んでいます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，我最害怕的是实际获利。这听起来很傻，但请容忍我。\n\n大多数时候，当我这样做的时候，价格继续上涨，我就会开始\n汗，一直看着图表，诅咒自己在更高的价格卖出、买入。\n在一个更高的价格买入，这对我来说有点影响。\n\n我当时...",
      "title": "我有自己的恐惧，我称之为FOTP--对获利的恐惧。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，我最害怕的是實際獲利。這聽起來很傻，但請容忍我。\n\n大多數時候，當我這樣做的時候，價格繼續上漲，我就會開始\n汗，一直看着圖表，詛咒自己在更高的價格賣出、買入。\n在一個更高的價格買入，這對我來說有點影響。\n\n我當時...",
      "title": "我有自己的恐懼，我稱之爲FOTP--對獲利的恐懼。"
    }
  ]
}