{
  "author": "FractalImagination",
  "original_created_utc": 1635689135,
  "title": "If you're patient, you will make money.",
  "created_utc": 1635712590,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I know... we all want to become rich and ride Lamborghini  super cars next month. We are tired of a 9 to 5 and the meaninglessness of modern day life. </p>\n\n<p>Do you think the guy who bought squid tokens for thousands of dollars only to now try and cash out and find out he can&#39;t doesn&#39;t wish he took more time to research?</p>\n\n<p>How about all the people who bought doge at ATH and are still holding their bags waiting for it to go back even?</p>\n\n<p>And shiba inu? Same shit.. </p>\n\n<p>You hear of success stories and only focus on the idea that you will be that guy who made millions. \nDo you ever put yourself in the shoes of the guy who put in thousands and lost it all in the crash?</p>\n\n<p>Now, veterans here know that if you put money in the safest crypto.. like BTC, ETH, LINK, MATIC.. or what ever floats your boat.. you will make money gradually if you just hold.. so do that.. </p>\n\n<p>I&#39;ve already seen posts on here about people who got left holding the bag on shiba.. do you want to lose money in a gamble of have for sure returns but slower? </p>\n\n<p>You chose..</p>\n</div><!-- SC_ON -->",
  "score": 158,
  "permalink": "/r/CryptoCurrency/comments/qjq79d/if_youre_patient_you_will_make_money/",
  "subreddit": "CryptoCurrency",
  "id": "qjq79d",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I know... we all want to become rich and ride Lamborghini super cars next month.\nWe are tired of a 9 to 5 and the meaninglessness of modern day life.\n\nDo you think the guy who bought squid tokens for thousands of dollars only to\nnow try and cash out and find out he can't doesn't wish he took more…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "分かっています...私たちは皆、来月にはお金持ちになってランボルギーニのスーパーカーに乗りたいと思っています。\n9時から5時までの生活や、現代の無意味な生活には飽き飽きしています。\n\n数千ドルでイカトークンを買った男が、今になってキャッシュアウトしようとしたら、自分のことを知ってしまったと思いますか？\nキャッシュアウトしようとしてもできないことがわかり、もっと取っておけばよかったと思わないのでしょうか...。",
      "title": "辛抱すれば儲かる。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道......我们都想在下个月成为富人，并乘坐兰博基尼超级跑车。\n我们厌倦了朝九晚五的生活和现代生活的无意义。\n\n你认为那个花了几千美元购买乌贼代币的人，现在想套现却发现自己的钱已经花光了吗？\n现在试图兑现，却发现自己无法兑现，难道他不希望自己拿更多......",
      "title": "如果你有耐心，你会赚钱的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道......我們都想在下個月成爲富人，並乘坐蘭博基尼超級跑車。\n我們厭倦了朝九晚五的生活和現代生活的無意義。\n\n你認爲那個花了幾千美元購買烏賊代幣的人，現在想套現卻發現自己的錢已經花光了嗎？\n現在試圖兌現，卻發現自己無法兌現，難道他不希望自己拿更多......",
      "title": "如果你有耐心，你會賺錢的。"
    }
  ]
}