{
  "author": "Numerous_Sport_2774",
  "original_created_utc": 1642740565,
  "title": "Over the next 24-48 hours don’t make any rash decisions and sleep on your trade plans.",
  "created_utc": 1642768298,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The sub is blowing up as BTC has dropped to a low we were not expecting etc etc.. FUD is dropping from left right and center and we are expecting a further contraction in the global markets. &lt;/p&gt;\n\n&lt;p&gt;Yes the BTC $100k dream is long dead for now but that doesn’t mean your investment isn’t a good one. You still have the same amount of coins which historically should again achieve the price you bought them at.&lt;/p&gt;\n\n&lt;p&gt;People need to try and stay calm, if you plan on doing a trade it would be advisable to think about it, maybe delay 24h and see if it still feels like the right decision. Emotion trading often leads to bad decisions.&lt;/p&gt;\n\n&lt;p&gt;If you are feeling down definitely talk to family and friends for support.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 305,
  "permalink": "/r/CryptoCurrency/comments/s92lhb/over_the_next_2448_hours_dont_make_any_rash/",
  "subreddit": "CryptoCurrency",
  "id": "s92lhb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The sub is blowing up as BTC has dropped to a low we were not expecting etc\netc.. FUD is dropping from left right and center and we are expecting a further\ncontraction in the global markets.\n\nYes the BTC $100k dream is long dead for now but that doesn’t mean your\ninvestment isn’t a good one. You…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "BTCが予想外の安値になったので、サブが爆発しているなど\nなどなど。FUDが右往左往しており、さらなる事態が予想されます\n世界市場は縮小している。\n\n確かにBTC10万ドルの夢はとうに終わっていますが、だからといって、あなたの\n投資することは良いことではありません。あなた...",
      "title": "今後24～48時間は軽率な判断をせず、取引計画を寝かせましょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "由于BTC跌到了我们意料之外的低点，该子系统正在爆炸，等等。\n等等。恐惧症正在从左、右和中间掉下来，我们预计全球市场将进一步收缩。\n全球市场的收缩。\n\n是的，BTC 10万美元的梦想现在早已破灭，但这并不意味着你的\n投资不是一个好的投资。你...",
      "title": "在接下来的24-48小时内，不要做出任何草率的决定，在你的交易计划上睡觉。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "由於BTC跌到了我們意料之外的低點，該子系統正在爆炸，等等。\n等等。恐懼症正在從左、右和中間掉下來，我們預計全球市場將進一步收縮。\n全球市場的收縮。\n\n是的，BTC 10萬美元的夢想現在早已破滅，但這並不意味着你的\n投資不是一個好的投資。你...",
      "title": "在接下來的24-48小時內，不要做出任何草率的決定，在你的交易計劃上睡覺。"
    }
  ]
}