{
  "author": "Skip143091",
  "original_created_utc": 1650472450,
  "title": "Class action lawsuit against Plaid: if you used crypto exchanges such as Coinbase or Gemini last year, Plaid stored and sold your bank info",
  "created_utc": 1650490461,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Just a heads up for those of you who may be unaware, perhaps you haven&amp;#39;t been getting the emails, or ignoring them as spam, like me. Coinbase, Gemini, and Public are just three exchanges I use, and ALL are affected by this (others include Robinhood and Venmo). When you initially make an account with one of these exchanges, they use the third-party company Plaid to connect to your bank account and verify.&lt;/p&gt;\n\n&lt;p&gt;Well, Plaid was accessing everyone&amp;#39;s bank info, including transactions, &amp;quot;anonymizing&amp;quot; the data, and selling it. This is what the class action lawsuit is about. Anyone who connected their bank to an exchange or other service using Plaid before November 2021 should file a claim right now, your personal data was illegally sold. Again, you might not even remember it, you did not have to make an account with Plaid, this is just the 20 second process of using them to connect your bank. Over 5,000 apps used Plaid.&lt;/p&gt;\n\n&lt;p&gt;This is my first time involving myself with a class action lawsuit, it&amp;#39;s actually very easy. If you cannot remember or are unsure what apps used Plaid, first go to &lt;a href=\"https://my.plaid.com/\"&gt;https://my.plaid.com/&lt;/a&gt; and make an account with Plaid. When you make an account, it will tell you what connections associated with your phone number are on file. Click to view that list of connected apps that you&amp;#39;ve used Plaid with.&lt;/p&gt;\n\n&lt;p&gt;Next, go to the settlement website: &lt;a href=\"https://plaidsettlement.com/submit-claim.php\"&gt;https://plaidsettlement.com/submit-claim.php&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Fill out the form, it takes just a minute. On section two, fill out the boxes using information you got from Plaid: Bank account connected/app used (coinbase, gemini, etc)/ and approximate date of connection. Plaid will not give you an exact date, but your best guess should be good enough, anything prior to November of 2021 is valid. At the end, you can select a method to receive your settlement payout. Paypal and direct deposit into your bank are accepted.&lt;/p&gt;\n\n&lt;p&gt;Exact payout amounts and dates are not known, but Plaid has had to establish a settlement fund of $58 million to be divided among everyone. I can imagine that the more connections you had, the more you will get.&lt;/p&gt;\n\n&lt;p&gt;The final court hearing appears to be set for May 12th. Again, make sure you file your claim before April 28th of THIS MONTH. Get your money from these scummy fucks.&lt;/p&gt;\n\n&lt;p&gt;E: Since there are a lot of comments asking, this is unfortunately for US citizens only, as it is being settled in a US court. A class action suit would need to be filed in your respective countries for action there.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 385,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/CdfAfs_q9Kj5ydDsKF3kqpDCqNR7GjdypZHJpFrY9Zs.jpg?auto=webp&amp;s=ff8b800ffcf66a539a1ea4ba48359a0d368c6f14",
          "width": 1200,
          "height": 627
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/CdfAfs_q9Kj5ydDsKF3kqpDCqNR7GjdypZHJpFrY9Zs.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=bfba1de3a0257e9c98fa378c010a758537ddf7b0",
            "width": 108,
            "height": 56
          },
          {
            "url": "https://external-preview.redd.it/CdfAfs_q9Kj5ydDsKF3kqpDCqNR7GjdypZHJpFrY9Zs.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=027443146e02911448769fd015983a051d41c530",
            "width": 216,
            "height": 112
          },
          {
            "url": "https://external-preview.redd.it/CdfAfs_q9Kj5ydDsKF3kqpDCqNR7GjdypZHJpFrY9Zs.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=03a9a2cb939605b6c932844b2c2491ad37cafe89",
            "width": 320,
            "height": 167
          },
          {
            "url": "https://external-preview.redd.it/CdfAfs_q9Kj5ydDsKF3kqpDCqNR7GjdypZHJpFrY9Zs.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=f98d078c4128b84fa0115cb457237b0da292ec05",
            "width": 640,
            "height": 334
          },
          {
            "url": "https://external-preview.redd.it/CdfAfs_q9Kj5ydDsKF3kqpDCqNR7GjdypZHJpFrY9Zs.jpg?width=960&amp;crop=smart&amp;auto=webp&amp;s=4d7aa0b52a54ee5ba6da2afe4c3e238567613e13",
            "width": 960,
            "height": 501
          },
          {
            "url": "https://external-preview.redd.it/CdfAfs_q9Kj5ydDsKF3kqpDCqNR7GjdypZHJpFrY9Zs.jpg?width=1080&amp;crop=smart&amp;auto=webp&amp;s=1ffc2729cbfb310436f5e178eb99bd75e6851346",
            "width": 1080,
            "height": 564
          }
        ],
        "variants": {},
        "id": "QKtWVfDAt0aNxSEDboi2K_xMgHf4KLDNN5Lj36k7WMM"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/u80jkw/class_action_lawsuit_against_plaid_if_you_used/",
  "subreddit": "CryptoCurrency",
  "id": "u80jkw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Just a heads up for those of you who may be unaware, perhaps you haven't been\ngetting the emails, or ignoring them as spam, like me. Coinbase, Gemini, and\nPublic are just three exchanges I use, and ALL are affected by this (others\ninclude Robinhood and Venmo). When you initially make an account…"
}