{
  "author": "Aguilaaa",
  "the_new_excerpt": "FOMO - fear of missing out: when a coin goes up and you are afraid you will miss\nthe bull run so you buy at a high price\n\nDCA - dollar cost averaging: investing a certain amount of money in certain\ncoins every month, for example every month $200 ETH, $100 BTC, $50 ADA\n\nHODL - started as a typo of a…",
  "original_created_utc": 1621394988,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "FOMO（fear of missing out）：コインが上昇したときに、ブルランに乗り遅れることを恐れて\n恐れて高値で購入すること。\n\nDCA - ドルコスト平均法：毎月一定の金額を特定のコインに投資すること。\n例えば、毎月200ドルのETH、100ドルのBTC、50ドルのADAのように、毎月一定額を特定のコインに投資すること。\n\nHODL - 始まりは「...」のタイプミス。",
      "title": "略語ばかりでわからない初心者の方へ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "FOMO - 害怕错过：当一个硬币上涨时，你害怕你会错过\n牛市，所以你在高价位买入。\n\nDCA--美元成本平均法：每月投资一定数量的钱在某些币上。\n币，例如每个月投资200美元ETH、100美元BTC、50美元ADA。\n\nHODL--开始是一个打字的...",
      "title": "对于那些不理解所有缩写的新手来说"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "FOMO - 害怕錯過：當一個硬幣上漲時，你害怕你會錯過\n牛市，所以你在高價位買入。\n\nDCA--美元成本平均法：每月投資一定數量的錢在某些幣上。\n幣，例如每個月投資200美元ETH、100美元BTC、50美元ADA。\n\nHODL--開始是一個打字的...",
      "title": "對於那些不理解所有縮寫的新手來說"
    }
  ],
  "title": "To the newbies who don't understand all the abbreviations",
  "created_utc": 1621420233,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>FOMO - fear of missing out: when a coin goes up and you are afraid you will miss the bull run so you buy at a high price</p>\n\n<p>DCA - dollar cost averaging: investing a certain amount of money in certain coins every month, for example every month $200 ETH, $100 BTC,  $50 ADA</p>\n\n<p>HODL - started as a typo of a famous guy on a bitcoinplatform, over te it took following meaning: hold on for dear life: mainly you don&#39;t sell even when it goes down</p>\n\n<p>TLDR - too long didn&#39;t read: exactly what it says</p>\n\n<p>WP - white paper: paper where the company behind the cryptocoins explains their intentions mainly</p>\n\n<p>POW - proof of work: mining goes trough expensive gpu-mining. Meaning you use a shitload of graphic cards to mine</p>\n\n<p>POS- proof of stake: mining goes trough staking a coin. Meaning you buy a coin and as an appreciation you get a certain percentage of that coin on top, paid out weekly</p>\n\n<p>FUD - fear, uncertainty, doubt: HODL your coins despite the FUD of the paperhands during crashes</p>\n\n<p>BTFD - Buy the Fucking Dip: you buy whenever there is a sale!</p>\n\n<p>DeFi - Decentralized finance: a blockchain-based form of finance that does not rely on central financial intermediaries such as brokerages, exchanges, or banks to offer traditional financial instruments, and instead utilizes smart contracts on blockchains (source: Wikipedia. Didn&#39;t know how to explain in less than 1000 words)</p>\n\n<p>SAFU - Secure asset fund for users: it&#39;s an emergency reserve to protect any invested asset. This is mostly used in case of a hack that resulted into users losing their assets... Watch, this is only till a certain amount and not every platform has this.</p>\n\n<p>DYOR - Do your own research: this is very important. There&#39;s nothing wrong with asking advice to friends but their advice is based on their opinion and therefore subjective. It might not be in line with your strategy so ALWAYS DYOR, no matter what they say</p>\n\n<p>KYC - Know your client: obligated by law in many countries. When you make an account on a cryptoplatform you have to pass a process where you have to fill in certain data of yourself and scan your ID.  This is the KYC.</p>\n\n<p>TA - technical analysis</p>\n\n<p>ATH - All time high: the highest position the coin has ever been</p>\n\n<p>AMA - ask me anything</p>\n\n<p>ICO - initial coin offering:  ICO trading platforms, investors receive unique cryptocurrency “tokens” in exchange for their monetary investment in the business.</p>\n\n<p>NFT - non-fungible token: a generally one of a kind digital asset that represents an object from the real world like videos, music, art, and so on. They are bought and sold with crypto on the blockchain.</p>\n\n<p>SYSC-Stop Yoloing Shit Coin ( this one is off the record but just too epic to forget)</p>\n\n<p>FIAT: Currencies which have been declared to be legal tender, backed by governments. ( Not an abbreviation but handy to know because you&#39;ll see it a lot)</p>\n\n<p>Paperhands: not an abbreviation but necessary to understand: someone who panic sells when there&#39;s a dip because of FUD.</p>\n\n<p>Diamond hands: the opposite of paperhands, people who can HODL, no matter what. completely FUD-proof</p>\n\n<p>If I forgot any, please put them in the comments, i will add them. I know there are many more but please the ones you see passing by on this subreddit</p>\n\n<p>EDIT: Thanks to all the people who helped me completing this list!!!</p>\n</div><!-- SC_ON -->",
  "score": 1123,
  "permalink": "/r/CryptoCurrency/comments/nfus48/to_the_newbies_who_dont_understand_all_the/",
  "subreddit": "CryptoCurrency",
  "id": "nfus48",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590801363
}