{
  "author": "wokeinthematrix",
  "the_new_excerpt": "But it just so happened to skyrocket to $15-$16+ a share (but seems to be\nfalling already now?)\n\nI was going to ask if I should sell now, as I conveniently happen to have 100\nshares, and it unexpectedly skyrocketed.\n\nI was actually counting on BB massively growing 5-10+ years from now due to…",
  "original_created_utc": 1622845680,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "しかし、たまたま1株あたり15～16ドル以上に高騰した（しかし、今はもう下がっているようだ）。\n今はもう下がっているようですが？)\n\nたまたま都合よく100株持っていたので、今売るべきかどうか聞いてみようと思っていたところ\nと聞いていたのですが、予想に反して急騰しました。\n\n本当は5～10年以上先にBBが大量に成長することを期待していたのですが、その理由は・・・。",
      "title": "たまたまBBを1株9.21ドルで100株購入し、長期保有を計画・期待していた......。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "但它恰好暴涨到每股15-16美元以上（但现在似乎已经在下跌？\n现在已经下跌了？)\n\n我本来想问我是否应该现在卖出，因为我正好有100\n股，而它意外地暴涨了。\n\n我实际上是指望BB在5-10年以上的时间里大规模增长，因为...",
      "title": "我碰巧以每股9.21美元的价格买了100股BB公司的股票，计划并期望长期持有，......。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "但它恰好暴漲到每股15-16美元以上（但現在似乎已經在下跌？\n現在已經下跌了？)\n\n我本來想問我是否應該現在賣出，因爲我正好有100\n股，而它意外地暴漲了。\n\n我實際上是指望BB在5-10年以上的時間裏大規模增長，因爲...",
      "title": "我碰巧以每股9.21美元的價格買了100股BB公司的股票，計劃並期望長期持有，......。"
    }
  ],
  "title": "I happened to buy 100 shares of BB at $9.21 a share, with the plan and expectation of holding it for the long-term......",
  "created_utc": 1622858464,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>But it just so happened to skyrocket to $15-$16+ a share (but seems to be falling already now?)</p>\n\n<p>I was going to ask if I should sell now, as I conveniently happen to have 100 shares, and it unexpectedly skyrocketed.</p>\n\n<p>I was actually counting on BB massively growing 5-10+ years from now due to them shifting to cybersecurity, AI, self driving cars, etc. But they definitely don’t have a huge competitive advantage over the big established giants like Apple, Samsung, Google, etc.</p>\n\n<p>So I figured I might be best off taking advantage of this little short squeeze (that I know can’t reach anywhere NEAR GME levels, but it was still going above what I paid) now, and either saving that money or reinvesting into another stock or coin, but now it looks like it’s already crashing.</p>\n\n<p>I learned from GME that crashing hard doesn’t prevent the rocket from taking off again, but at the same time BB isn’t being betted against anywhere NEAR as much as GME.</p>\n</div><!-- SC_ON -->",
  "score": 732,
  "permalink": "/r/stocks/comments/nsh96m/i_happened_to_buy_100_shares_of_bb_at_921_a_share/",
  "subreddit": "stocks",
  "id": "nsh96m",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404886632
}