{
  "author": "uw888",
  "the_new_excerpt": "Was their tourism from Alexandria and other parts? Were their conservation\nefforts and reverence for the past? I know Cleopatra ruled from Alexandria, and\nwas also wondering if there's any evidence that she visited the great pyramids\nat Giza and what type of ceremonies if any would she have attended…",
  "original_created_utc": 1620126109,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "彼らの観光はアレキサンドリアなどからだったのでしょうか？自然保護や過去への敬意があったか\n過去への敬意と保護の努力は？クレオパトラがアレキサンドリアを統治していたことは知っていますが\nクレオパトラはアレクサンドリアを支配していましたが、彼女がアレクサンドリアの大ピラミッドを訪れたという証拠があるのかどうかも疑問でした。\nまた、ギザの大ピラミッドを訪れたという証拠はあるのでしょうか、もしあればどのような儀式に出席したのでしょうか...。",
      "title": "クレオパトラの時代には、ピラミッドやスフィンクスはすでに真の古代遺跡となっていました。これらのモニュメントが当時どのような姿をしていたのか、つまり、元々の華やかで色鮮やかな光沢のある外観を保っていたのか、また、王族や民衆にどのように受け止められていたのか、私たちは知っているでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "他们的旅游是来自亚历山大和其他地区吗？他们的保护工作是否\n努力和对过去的敬畏？我知道克利奥帕特拉是在亚历山大港统治的，并且\n我还想知道是否有任何证据表明她参观过吉萨的大金字塔？\n如果有的话，她会参加什么类型的仪式？",
      "title": "在克利奥帕特拉时代，金字塔和斯芬克斯已经是真正的古代遗迹。我们是否知道这些纪念碑在当时的样子，换句话说，它们是否还具有原来辉煌、多彩和闪亮的外表，以及皇室和人民是如何看待它们的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "他們的旅遊是來自亞歷山大和其他地區嗎？他們的保護工作是否\n努力和對過去的敬畏？我知道克利奧帕特拉是在亞歷山大港統治的，並且\n我還想知道是否有任何證據表明她參觀過吉薩的大金字塔？\n如果有的話，她會參加什麼類型的儀式？",
      "title": "在克利奧帕特拉時代，金字塔和斯芬克斯已經是真正的古代遺蹟。我們是否知道這些紀念碑在當時的樣子，換句話說，它們是否還具有原來輝煌、多彩和閃亮的外表，以及皇室和人民是如何看待它們的？"
    }
  ],
  "title": "At the time of Cleopatra, the pyramids and the Sphynx were already truly ancient monuments. Do we know what these monuments looked like at that time, in other words did they still have the original glorious, colourful and shiny exterior and how were they perceived by the royalty and the people?",
  "created_utc": 1620140714,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Was their tourism from Alexandria and other parts? Were their conservation efforts and reverence for the past? I know Cleopatra ruled from Alexandria, and was also wondering if there&#39;s any evidence that she visited the great pyramids at Giza and what type of ceremonies if any would she have attended at the site? Would she have been recognised by the priesthood as the successor of the great pharaos? Or was there no priesthood there by that time? </p>\n\n<p>More importantly, would they (the priests, the scholars of her time) have known what the pyramids were built for originally? Was Cleopatra aware they were burial monuments and would she have known who was buried there? Or would they have thought they were ancient temples, perhaps built by the gods? Did they find them perhaps mysterious and inscrutable, as they did not have access to archaeology? Or alternatively, was oral and written tradition stable, strong and continuous in a way that they would have known even much more than we do,  although thousands of years have passed? What do the historians of her time tell us about these ancient monuments, if not Egyptian historians then at least Roman and Greek ones?</p>\n</div><!-- SC_ON -->",
  "score": 110,
  "permalink": "/r/AskHistorians/comments/n4ljtv/at_the_time_of_cleopatra_the_pyramids_and_the/",
  "subreddit": "AskHistorians",
  "id": "n4ljtv",
  "is_self": true,
  "media": null,
  "is_video": false
}