{
  "author": "KamikazeKash",
  "the_new_excerpt": "I remember it being touted as the biggest corporate fraud case in decades, when\nit happened in late 2019.\n\nI skimmed through his team's 169 page report, watched videos summarizing the\nreport. A lot of it seemed credible.\n\nThere were also other smoking guns: the CFO preemptively retires after…",
  "original_created_utc": 1619450952,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "数十年に一度の大規模な企業不正事件として注目されていたのを覚えています。\n2019年末に起きた\n\n私は彼のチームの169ページの報告書にざっと目を通し、その報告書を要約したビデオを見ました。\n報告書を見ました。その多くは信憑性があるように思えた。\n\n他にも決定的な証拠がありました。CFOが先回りして退職した後...",
      "title": "ハリー・マルコポロス（バーニー・マドフの内部告発者）が告発したGEの不正事件はどうなったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我记得它被吹捧为几十年来最大的公司欺诈案，当时\n它发生在2019年底。\n\n我粗略浏览了他的团队的169页报告，观看了总结报告的视频\n报告。其中很多内容似乎是可信的。\n\n还有其他的烟幕弹：首席财务官先发制人，退休后...",
      "title": "哈里-马可波罗斯（Bernie Madoff的告密者）指控的通用电气的欺诈案发生了什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我記得它被吹捧爲幾十年來最大的公司欺詐案，當時\n它發生在2019年底。\n\n我粗略瀏覽了他的團隊的169頁報告，觀看了總結報告的視頻\n報告。其中很多內容似乎是可信的。\n\n還有其他的煙幕彈：首席財務官先發制人，退休後...",
      "title": "哈里-馬可波羅斯（Bernie Madoff的告密者）指控的通用電氣的欺詐案發生了什麼？"
    }
  ],
  "title": "What happened to GE's fraud case as accused by Harry Markopolos (Bernie Madoff whistleblower)?",
  "created_utc": 1619458438,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I remember it being touted as the biggest corporate fraud case in decades, when it happened in late 2019. </p>\n\n<p>I skimmed through his team&#39;s 169 page report, watched videos summarizing the report. A lot of it seemed credible. </p>\n\n<p>There were also other smoking guns: the CFO preemptively retires after the report drops, the share price drops 300% and holds there. There is an overhaul of upper management. They publicly admitted that they don&#39;t entirely adhere to GAAP. </p>\n\n<p>But what&#39;s happened since? Why isn&#39;t there more mainstream coverage about this? Were Harry&#39;s accusations right? What&#39;s SEC legal stance and actions on this? </p>\n\n<p>I don&#39;t wanna seem conspiratorial but it&#39;d seem that most institutional investors have a vested interest in holding GE. </p>\n\n<p>More worryingly, the only coverage about the aftermath I can find, seems to be taken down: <a href=\"https://www.bloomberg.com/news/articles/2019-10-25/it-s-almost-like-the-shock-ge-short-thesis-never-happened\">https://www.bloomberg.com/news/articles/2019-10-25/it-s-almost-like-the-shock-ge-short-thesis-never-happened</a></p>\n\n<p>Conversely, if there were nothing to this case and Markopolos had immense conflict of interest with the hedge fund, as the GE management claims, why this stock holding at the dropped price?</p>\n</div><!-- SC_ON -->",
  "score": 628,
  "permalink": "/r/investing/comments/mz0ahw/what_happened_to_ges_fraud_case_as_accused_by/",
  "subreddit": "investing",
  "id": "mz0ahw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776214681
}