{
  "author": "getupforwhat",
  "original_created_utc": 1643747291,
  "title": "It will never sit right with me this double tax thing",
  "created_utc": 1643769892,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;9-5 people, perhaps not living paycheck to paycheck, but someone who&amp;#39;s not more than half a year of unemployment away from having their life turned on its head - These people are not going to get much better off by working, nor by saving money in the bank. They don&amp;#39;t have wealthy relatives so there&amp;#39;s no large inheritance coming their way and they definitely don&amp;#39;t have the money for a downpayment on a permanent residence of their own.&lt;/p&gt;\n\n&lt;p&gt;These individuals know this.&lt;/p&gt;\n\n&lt;p&gt;So they put a little money into crypto, hoping to make it grow a bit, hoping to take charge a bit. This is money they&amp;#39;ve already been taxed on. It is a risky endeavor but they&amp;#39;re assuming all the risk. It happens that they grow their $2000 worth of crypto into $5000 worth of crypto and they&amp;#39;re ecstatic! - but here comes the government, it needs a cut.&lt;/p&gt;\n\n&lt;p&gt;Why? Why now? Have they not already paid taxes on this money? The government assumed no risk. The money is still in crypto. Those $5000 can turn to $500 in a hurry. What happens then? Can they deduct it? Maybe, it depends on where you live. At best you can deduct only a small percentage of your loss each year.&lt;/p&gt;\n\n&lt;p&gt;So, they have to pay taxes on the money they&amp;#39;ve made from the money they had already paid taxes on, even if they still risk losing all of it (+ taxes now).&lt;/p&gt;\n\n&lt;p&gt;--&lt;/p&gt;\n\n&lt;p&gt;If the government must tax crypto gains they had no stake in, make it happen ONLY when the gains go back to fiat or when they&amp;#39;re exchanged into some other real-world asset like a car.&lt;/p&gt;\n\n&lt;p&gt;Until then, it is play money, an unrealized gain (or loss) that the government has no business putting their noses in. Poker chips that have not yet been exchanged for cash.&lt;/p&gt;\n\n&lt;p&gt;Sure, as India did, remove their ability to deduct anything. It&amp;#39;s fine. As long as you don&amp;#39;t try to tax their unrealized gains. Or do something stupid like taxing transactions...&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Edit - I know they only pay taxes on their gains, not their initial.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 327,
  "permalink": "/r/CryptoCurrency/comments/si4p19/it_will_never_sit_right_with_me_this_double_tax/",
  "subreddit": "CryptoCurrency",
  "id": "si4p19",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "9-5 people, perhaps not living paycheck to paycheck, but someone who's not more\nthan half a year of unemployment away from having their life turned on its head\n- These people are not going to get much better off by working, nor by saving\nmoney in the bank. They don't have wealthy relatives so…"
}