{
  "author": "strutterfifs",
  "original_created_utc": 1642707945,
  "title": "I built a stock screener providing real-time trading alerts and research data!",
  "created_utc": 1642734097,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi all,&lt;/p&gt;\n\n&lt;p&gt;I have been building a stock screener and research platform over the last year focusing on momentum and low float stocks trading and would like to share the results with the community!&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Background:&lt;/strong&gt; After realizing that most traders spend a lot of time, money and energy trying to identify opportunities using complex screeners and research tools, we decided to build an “all-in-one” platform to solve that problem.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Solution:&lt;/strong&gt; Our mission is to empower people to become better traders by turning trading strategies, technical and fundamental indicators and financial data into easy to understand, actionable trading alerts. Essentially, our algorithms screen markets during extended trading hours to provide you with real-time alert notifications for low-float stocks before they breakout or while doing so. In addition, we provide access to key research data about each stock (fundamental, technical and newsflow) to help you make fast, informed trading decisions to seize opportunities.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Product:&lt;/strong&gt; &lt;a href=\"https://www.edgewall.io/\"&gt;https://www.edgewall.io&lt;/a&gt;. You can sign-up for a free trial account (no need for credit card) to discover the platform! It would be great to have your feedback!&lt;/p&gt;\n\n&lt;p&gt;Let me know if you have any questions and feel free to join our social channels to start the discussion and follow our updates.&lt;/p&gt;\n\n&lt;p&gt;Thank you and kind regards!&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/1hvcbpcadwc81.png?width=3200&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=9d748362081a24d8c9a207f403ed9c6a174f2e0f\"&gt;https://preview.redd.it/1hvcbpcadwc81.png?width=3200&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=9d748362081a24d8c9a207f403ed9c6a174f2e0f&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 5,
  "permalink": "/r/SideProject/comments/s8r9hc/i_built_a_stock_screener_providing_realtime/",
  "subreddit": "SideProject",
  "id": "s8r9hc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hi all,\n\nI have been building a stock screener and research platform over the last year\nfocusing on momentum and low float stocks trading and would like to share the\nresults with the community!\n\nBackground: After realizing that most traders spend a lot of time, money and\nenergy trying to identify…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。\n\n私は、昨年から株式スクリーナーとリサーチ・プラットフォームを構築しています。\nモメンタム株や低浮動株取引に焦点を当てて、共有したいと思います。\nの結果をコミュニティで共有することができます。\n\n背景 ほとんどのトレーダーは、多くの時間、お金、そして、自分の利益を犠牲にしている。\nを識別するためにエネルギーを費やしています。",
      "title": "リアルタイムの取引アラートとリサーチデータを提供する株式スクリーナーを作りました"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。\n\n在过去的一年里，我一直在建立一个股票筛选器和研究平台。\n专注于动量和低浮动股票交易，并希望与社区分享\n与大家分享我的成果\n\n背景。在意识到大多数交易者花费了大量的时间、金钱和精力来识别...\n在意识到大多数交易者花费大量的时间、金钱和精力去识别...",
      "title": "我建立了一个提供实时交易提醒和研究数据的股票筛选器"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。\n\n在過去的一年裏，我一直在建立一個股票篩選器和研究平臺。\n專注於動量和低浮動股票交易，並希望與社區分享\n與大家分享我的成果\n\n背景。在意識到大多數交易者花費了大量的時間、金錢和精力來識別...\n在意識到大多數交易者花費大量的時間、金錢和精力去識別...",
      "title": "我建立了一個提供實時交易提醒和研究數據的股票篩選器"
    }
  ]
}