{
  "author": "20njbytes",
  "original_created_utc": 1639961995,
  "title": "I'm Not Looking at My Portfolio Balances Again Until 2022",
  "created_utc": 1639971167,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m done for the holidays.  I&amp;#39;m optimistic long term on crypto and have all the positions I want for the immediate future.  But this current multi week slide is just exhausting and there is no reason for me to keep watching it.&lt;/p&gt;\n\n&lt;p&gt;The market is going to do what the market will do.  &lt;/p&gt;\n\n&lt;p&gt;All these predictions about 4 year market cycles, blow off tops, etc. have been completely wrong and nobody knows......you know the rest of the saying.  &lt;/p&gt;\n\n&lt;p&gt;So Merry Christmas, Happy Hanukkah, Happy Kwanzaa or just Happy New Year if you don&amp;#39;t celebrate any of those.  &lt;/p&gt;\n\n&lt;p&gt;Looking forward to seeing my balances on Jan 1.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 179,
  "permalink": "/r/CryptoCurrency/comments/rkanda/im_not_looking_at_my_portfolio_balances_again/",
  "subreddit": "CryptoCurrency",
  "id": "rkanda",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm done for the holidays. I'm optimistic long term on crypto and have all the\npositions I want for the immediate future. But this current multi week slide is\njust exhausting and there is no reason for me to keep watching it.\n\nThe market is going to do what the market will do.\n\nAll these…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "連休はもう終わりです。私は暗号を長期的に楽観視しており、すべての暗号を保有しています。\n目先のポジションは欲しいところ。しかし、現在のこの数週間のスライドは\nこのまま見続ける理由はない。\n\nマーケットはマーケットがすることをするのです。\n\nこれら全ては...",
      "title": "2022年まで自分のポートフォリオ残高を再び見ることはない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我已经过完了假期。我对加密货币持长期乐观态度，并拥有我想要的所有近期头寸。\n仓位，我想在不久的将来。但目前这种多周的下滑是\n我没有理由继续关注它。\n\n市场要做市场要做的事。\n\n所有这些...",
      "title": "2022年前我不会再看我的投资组合余额了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我已經過完了假期。我對加密貨幣持長期樂觀態度，並擁有我想要的所有近期頭寸。\n倉位，我想在不久的將來。但目前這種多周的下滑是\n我沒有理由繼續關注它。\n\n市場要做市場要做的事。\n\n所有這些...",
      "title": "2022年前我不會再看我的投資組合餘額了"
    }
  ]
}