{
  "author": "No-Cantaloupe-31",
  "original_created_utc": 1626451136,
  "title": "Deepfaking the Dead (ethics)",
  "created_utc": 1626487528,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In a new documentary about the life and death of Anthony Bourdain, there are a few lines of dialogue in Bourdain’s voice that he might not have ever said out loud. Filmmaker Morgan Neville admitted using AI technology to digitally re-create Anthony Bourdain’s voice and have the software synthesize the audio of three quotes from him. The filmmaker later says rather glibly  “We can have a documentary-ethics panel about it later,” </p>\n\n<p>Oh really? Ethics <em>after</em> we do something seems to preference when we do anything with technology these days.</p>\n\n<p>So is it ethical to deepfake the dead? Does it matter that its a public figure such as Bourdain? Can deepfakes be justified under &quot;creative&quot; or &quot;artistic license&quot;?</p>\n\n<p>Article here:</p>\n\n<p><a href=\"https://www.theverge.com/2021/7/15/22578707/anthony-bourdain-documentary-deepfake-voice\">New Anthony Bourdain documentary deepfakes his voice - The Verge</a> </p>\n\n<p>&#x200B;</p>\n\n<p>Baseline on Deepfakes here</p>\n\n<p><a href=\"https://en.wikipedia.org/wiki/Deepfake#:%7E:text=Deepfake.%20Deepfake%2C%20a%20portmanteau%20of%20%22%20deep%20learning,create%20fake%20celebrity%20pornographic%20videos%20or%20revenge%20porn.\">Deepfake - Wikipedia</a></p>\n</div><!-- SC_ON -->",
  "score": 111,
  "permalink": "/r/askphilosophy/comments/oljqjr/deepfaking_the_dead_ethics/",
  "subreddit": "askphilosophy",
  "id": "oljqjr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In a new documentary about the life and death of Anthony Bourdain, there are a\nfew lines of dialogue in Bourdain’s voice that he might not have ever said out\nloud. Filmmaker Morgan Neville admitted using AI technology to digitally\nre-create Anthony Bourdain’s voice and have the software synthesize…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アンソニー・ボーデインの生と死を描いた新しいドキュメンタリーの中で、ボーデインの声には、彼が決して口にしなかったであろういくつかの台詞があります。\nブルデインの声には、彼が口に出して言わなかったであろう台詞がいくつか含まれています。\n大声で。映画監督のMorgan Nevilleは、AI技術を使ってAnthony Bourdainの声をデジタルで再現したことを認めています。\nAI技術を使って、アンソニー・ボーデインの声をデジタルで再現し、ソフトウェアに合成させたことを認めています。",
      "title": "ディープフェイキング・ザ・デッド（倫理"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在一部关于安东尼-布尔丹生与死的新纪录片中，有几句布尔丹的对话，他可能从未说过。\n布尔丹的几句对话，他可能从未大声说过。\n大声说出来。电影制片人摩根-内维尔承认使用人工智能技术以数字方式\n重新创造安东尼-布尔丹的声音，并让软件合成...",
      "title": "深度假死（伦理学"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在一部關於安東尼-布爾丹生與死的新紀錄片中，有幾句布爾丹的對話，他可能從未說過。\n布爾丹的幾句對話，他可能從未大聲說過。\n大聲說出來。電影製片人摩根-內維爾承認使用人工智能技術以數字方式\n重新創造安東尼-布爾丹的聲音，並讓軟件合成...",
      "title": "深度假死（倫理學"
    }
  ]
}