{
  "author": "NoggenfoggerDreams",
  "original_created_utc": 1658778257,
  "title": "Can't wait to buy the panic sell",
  "created_utc": 1658806590,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Bitcoin is touching a major support line that hasn&amp;#39;t been broken very often over the years. It&amp;#39;s unlikely it will dip much more and at this point I&amp;#39;m just enjoying buying this panic sell.&lt;/p&gt;\n\n&lt;p&gt;Plus, I see no reason to cash out at this point, especially into an inflating asset like fiat currencies. I&amp;#39;ll just continue to DCA with my monthly pay and sit back and sip margaritas waiting for my golden rocket to ride into the sunset.&lt;/p&gt;\n\n&lt;p&gt;Does anyone else feel the same? This is truly dumb territory to be selling not unless you&amp;#39;re really desperate for cash to pay bills and buy essentials.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 362,
  "permalink": "/r/CryptoCurrency/comments/w7y97q/cant_wait_to_buy_the_panic_sell/",
  "subreddit": "CryptoCurrency",
  "id": "w7y97q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Bitcoin is touching a major support line that hasn't been broken very often over\nthe years. It's unlikely it will dip much more and at this point I'm just\nenjoying buying this panic sell.\n\nPlus, I see no reason to cash out at this point, especially into an inflating\nasset like fiat currencies. I'll…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコインは、これまであまり破られることのなかった主要なサポートラインに触れている以上\nこのラインは何年も破られたことがありません。これ以上落ち込むことはないでしょうし、この時点で私はこのパニック売りを買って楽しんでいます。\nこのパニック売りを買って楽しんでいます。\n\nさらに、私はこの時点で、特に不換紙幣のようなインフレ資産にキャッシュアウトする理由が見当たりません。\n特に不換紙幣のような膨張性資産に。私は...",
      "title": "パニックセルを早く買いたい"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "比特币正在触及一个主要的支撑线，这个支撑线在过去并不经常被打破。\n多年来一直没有被打破。它不太可能再下挫了，在这一点上，我只是\n喜欢购买这种恐慌性抛售。\n\n此外，我认为没有理由在这个时候套现，尤其是套入像法定货币这样的通货膨胀资产。\n资产，如法定货币。我将...",
      "title": "迫不及待地想买下恐慌性的销售"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "比特幣正在觸及一個主要的支撐線，這個支撐線在過去並不經常被打破。\n多年來一直沒有被打破。它不太可能再下挫了，在這一點上，我只是\n喜歡購買這種恐慌性拋售。\n\n此外，我認爲沒有理由在這個時候套現，尤其是套入像法定貨幣這樣的通貨膨脹資產。\n資產，如法定貨幣。我將...",
      "title": "迫不及待地想買下恐慌性的銷售"
    }
  ]
}