{
  "author": "reckle3ss",
  "the_new_excerpt": "Just a reminder of what a coincidence it was that we had 4-5 massive FUD bombs\ndropped within days of eachother. They literally brought the boat back.\n\nOne day later billionaires are endorsing bitcoin again after their bags got\nstuffed.\n\nStop worshipping ANYBODY and stop being such a fuckin pussy of…",
  "original_created_utc": 1621891444,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "数日のうちに4～5個の巨大なFUD爆弾が投下されたのは、いかに偶然であったかを思い出させてくれる。\n数日のうちに4～5個の巨大なFUD爆弾が投下されたのは、いかに偶然だったかを思い出させてくれます。彼らは文字通り、船を取り戻したのです。\n\n一日後、億万長者はバッグに詰め込まれた後、再びビットコインを支持しています。\n詰め込まれました。\n\n誰かを崇拝するのはやめて、そんなクソッタレなことはやめて...",
      "title": "それは、あなたのビットコインに対する組織的な攻撃でした...次の機会に忘れないでください"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "只是提醒我们，这是一个多么巧合的事情，我们有4-5个大规模的FUD炸弹在几天内被投下\n在几天内被投下。他们简直是把船带回来了。\n\n一天之后，亿万富翁们又开始支持比特币了，因为他们的袋子被塞满了\n塞满了。\n\n不要再崇拜任何人了，不要再像个娘娘腔一样了。",
      "title": "这是对你的比特币的一次精心策划的攻击......下次别忘了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "只是提醒我們，這是一個多麼巧合的事情，我們有4-5個大規模的FUD炸彈在幾天內被投下\n在幾天內被投下。他們簡直是把船帶回來了。\n\n一天之後，億萬富翁們又開始支持比特幣了，因爲他們的袋子被塞滿了\n塞滿了。\n\n不要再崇拜任何人了，不要再像個娘娘腔一樣了。",
      "title": "這是對你的比特幣的一次精心策劃的攻擊......下次別忘了"
    }
  ],
  "title": "It was an orchestrated assault on your bitcoin... do not forget next time",
  "created_utc": 1621900229,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Just a reminder of what a coincidence it was that we had 4-5 massive FUD bombs dropped within days of eachother. They literally brought the boat back.</p>\n\n<p>One day later billionaires are endorsing bitcoin again after their bags got stuffed. </p>\n\n<p>Stop worshipping ANYBODY and stop being such a fuckin pussy of a human by following their every word. Elon will return to bitcoin and Micheal Saylor WILL eventually turn on us.... they are in talks right now as this is being posted. They want your coins and these billionaires could care less about you and your family.</p>\n\n<p>The Wyckoff strategy was deployed and it still might not be over, but shame on you if you make the same mistake twice. Use your brain and learn to think for yourself.</p>\n</div><!-- SC_ON -->",
  "score": 1239,
  "permalink": "/r/Bitcoin/comments/nk8tcv/it_was_an_orchestrated_assault_on_your_bitcoin_do/",
  "subreddit": "Bitcoin",
  "id": "nk8tcv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197380049
}