{
  "author": "Aware-Moment6667",
  "original_created_utc": 1638723931,
  "title": "I’m LGBT but don’t understand how someone decides they are non binary?",
  "created_utc": 1638740189,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Can I ask a genuine question? &lt;/p&gt;\n\n&lt;p&gt;As someone who’s sex is female. I grew up wanting to be a boy. I wanted my breasts to not be there because they ruined the aesthetic I wanted. I had feelings for girls from a young age. I felt far more comfortable around boys and felt uncomfortable around girls. Being strong physically has always been a value of mine. I have never had any maternal desire to either give birth or be a mother. As I got older I struggled accepting all these masculine traits about myself due to feeling like I had to conform to my parents ideologies and societies expectations. I feel like I can really really relate to a lot of the non binary experience.&lt;/p&gt;\n\n&lt;p&gt;Now that I’m in my 30’s I accept my masculine side fully but I also love my feminine qualities. I am still envious of the male form and I doubt that will ever change. It just took me a long time to realise that i was no less of a woman even though I related so strongly to males/male traits and the lack of wanting to be a mother. It was my own feelings about what a woman should be and what a man should be that caused my distress and confusion. Once I stopped caring about society’s views and  realised that I was no less of a woman everything fell into place. &lt;/p&gt;\n\n&lt;p&gt;I have no need to disagree with the biological science. There has been research that states that the level of masculinity and likelyhood of a woman being a tomboy comes down to how much testosterone they are exposed to after conception. This suggests that biology does in fact contribute to gender and possibly expression. I fully accept that I am a woman both biologically and in gender even though I express myself in masculine ways, for example, the way I dress or even sit. &lt;/p&gt;\n\n&lt;p&gt;I feel like had I had that education and definitely therapy or at least some who I could trust to talk to then I could have understood and accepted far quicker. It would have saved me a lot of misery. &lt;/p&gt;\n\n&lt;p&gt;This is where I struggle to understand and would really like an open minded response. What is the difference between me and someone that feels the need to go one step further to identify as non binary, use terms such as AFAB, AMAB(which to me suggests the view that doctors determine sex and gender not biology), and go on to create pronouns?&lt;/p&gt;\n\n&lt;p&gt;Is it reasonable to suggest that a person who identifies as non binary is locked in their own beliefs about what a man should be and what a woman should be. therefore because they can’t accept their own personal anomalies within their gender or lack therapy to work through their beliefs, they then feel forced to look for alternative solutions such as the labels of non binary and gender fluid. &lt;/p&gt;\n\n&lt;p&gt;I’m not looking to upset anyone. Please don’t respond unless you want a mature open and honest conversation.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/TooAfraidToAsk/comments/r9k2of/im_lgbt_but_dont_understand_how_someone_decides/",
  "subreddit": "TooAfraidToAsk",
  "id": "r9k2of",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Can I ask a genuine question?\n\nAs someone who’s sex is female. I grew up wanting to be a boy. I wanted my\nbreasts to not be there because they ruined the aesthetic I wanted. I had\nfeelings for girls from a young age. I felt far more comfortable around boys and\nfelt uncomfortable around girls. Being…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "純粋な質問をしてもいいのでしょうか？\n\n性別が女性である人間として。男の子になりたいと思いながら育ちました。自分の\n胸があると美的感覚が損なわれるので、ない方がいい。私は\n幼い頃から女の子が好きだった。男の子と一緒にいる方がずっと居心地がよくて\n女の子に違和感を覚えた。それは...",
      "title": "私はLGBTですが、自分がノンバイナリーであると判断する人の気持ちがわかりません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我可以问一个真正的问题吗？\n\n作为一个性别为女性的人。我从小就想成为一个男孩。我希望我的\n因为它们破坏了我想要的美感。我从小就有\n从很小的时候就对女孩有感觉。我觉得和男孩在一起要舒服得多，和女孩在一起则感到不舒服。\n在女孩身边感到不自在。作为...",
      "title": "我是LGBT，但不明白有人如何决定他们是非二元的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我可以問一個真正的問題嗎？\n\n作爲一個性別爲女性的人。我從小就想成爲一個男孩。我希望我的\n因爲它們破壞了我想要的美感。我從小就有\n從很小的時候就對女孩有感覺。我覺得和男孩在一起要舒服得多，和女孩在一起則感到不舒服。\n在女孩身邊感到不自在。作爲...",
      "title": "我是LGBT，但不明白有人如何決定他們是非二元的？"
    }
  ]
}