{
  "author": "lifeofthefff",
  "original_created_utc": 1648193018,
  "title": "Do you actually judge fat people eating in public places?",
  "created_utc": 1648214586,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been fat my whole life and I feel like everybody is judging me when I eat in public places. Like if I&amp;#39;m eating something healthy they look at me and go &amp;quot;Look at this girl, acting like she got this big by eating these!&amp;quot; Or if I eat fast food they go &amp;quot;Look at her, so fat and still keeps eating fast food!&amp;quot;\nDo you actually think something like that?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 183,
  "permalink": "/r/TooAfraidToAsk/comments/tngjep/do_you_actually_judge_fat_people_eating_in_public/",
  "subreddit": "TooAfraidToAsk",
  "id": "tngjep",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've been fat my whole life and I feel like everybody is judging me when I eat\nin public places. Like if I'm eating something healthy they look at me and go\n\"Look at this girl, acting like she got this big by eating these!\" Or if I eat\nfast food they go \"Look at her, so fat and still keeps eating…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はずっと太っているので、食事をすると皆に批判されるような気がします。\n公共の場での 私が健康的なものを食べていると、彼らは私を見て、次のように言います。\n\"見ろよこの女、これを食べて大きくなったみたいだ！\" あるいは、もし私が\nファストフードは「見ろよ、こんなに太っているのに、まだ食べ続けている...」と言われます。",
      "title": "実際、公共の場で食事をしているデブを批判するのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一生都很胖，当我在公共场所吃饭时，我觉得每个人都在评判我。\n在公共场所。如果我吃的是健康的东西，他们会看着我说\n\"看看这个女孩，表现得好像她是靠吃这些东西才长这么大的！\" 或者如果我吃了\n快餐，他们就会说：\"看看她，这么胖还在不停地吃......",
      "title": "你真的会评判在公共场所吃饭的胖子吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一生都很胖，當我在公共場所喫飯時，我覺得每個人都在評判我。\n在公共場所。如果我喫的是健康的東西，他們會看着我說\n\"看看這個女孩，表現得好像她是靠喫這些東西才長這麼大的！\" 或者如果我吃了\n快餐，他們就會說：\"看看她，這麼胖還在不停地喫......",
      "title": "你真的會評判在公共場所喫飯的胖子嗎？"
    }
  ]
}