{
  "author": "Strong_Woodpecker634",
  "original_created_utc": 1656910953,
  "title": "Vauld has paused withdrawls",
  "created_utc": 1656957035,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://www.vauld.com/blog/corporate-statement/\"&gt;https://www.vauld.com/blog/corporate-statement/&lt;/a&gt; &lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;The Vauld management wishes to inform that we are facing financial challenges despite our best efforts. This is due to a combination of circumstances such as the volatile market conditions, the financial difficulties of our key business partners inevitably affecting us, and the current market climate which has led to a significant amount of customer withdrawals in excess of a $197.7 m since 12 June 2022 when the decline of the cryptocurrency market was triggered by the collapse of Terraform Lab’s UST stablecoin, Celsius network pausing withdrawals, and Three Arrows Capital defaulting on their loans.&lt;/li&gt;\n&lt;li&gt;As such, we have considered that it would be in the best interests of stakeholders to take immediate action in the circumstances. In furtherance of this, we have engaged the services of Kroll Pte Limited as our financial advisor, as well as Cyril Amarchand Mangaldas and Rajah &amp;amp; Tann Singapore LLP as our legal advisors in India and Singapore respectively.&lt;/li&gt;\n&lt;li&gt;Our management remains fully committed to working with our financial and legal advisors to the best of our abilities to explore and analyse all possible options, including potential restructuring options, that would best protect the interests of Vauld’s stakeholders.&lt;/li&gt;\n&lt;li&gt;We are currently in discussions with potential investors into the Vauld group of companies. We intend to apply to the Singapore courts for a moratorium i.e. a suspension of the commencement or continuation of any proceedings against the relevant companies so as to give us breathing space to carry out the proposed restructuring exercise.    &lt;/li&gt;\n&lt;li&gt;We are confident that, with the advice of our financial and legal advisors, we will be able to reach a solution that will best protect the interests of Vauld’s customers and stakeholders.&lt;/li&gt;\n&lt;li&gt;In the meantime, we have made the difficult decision to suspend all withdrawals, trading and deposits on the Vauld platform with immediate effect. We believe that this will help to facilitate our exploration of the suitability of potential restructuring options, together with our financial and legal advisors. We seek the understanding of customers of the Vauld platform that we will not be in a position to process any new or further requests or instructions in this regard. Specific arrangements will be made for customer deposits as may be necessary for certain customers to meet margin calls in connection with collateralised loans. &lt;/li&gt;\n&lt;li&gt;Further updates on material developments will be provided at the appropriate juncture. We seek your understanding and patience in the meantime. Should you have any queries, please submit them at &lt;a href=\"mailto:enquiries@vauld.com\"&gt;enquiries@vauld.com&lt;/a&gt;. We will endeavour to address them as soon as practicable.&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 306,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/ybmUp1KrQYWlMRGRUVq1Jzpk4VhNcZISKjvmigT96JI.jpg?auto=webp&amp;s=f7cc5cabe324818b45964a853691e3ea0e538983",
          "width": 96,
          "height": 96
        },
        "resolutions": [],
        "variants": {},
        "id": "Z_Vl8lwbuK5inPymDHF2YjIHOgyQXgOH5FiVZXtK4-c"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/vqzo4u/vauld_has_paused_withdrawls/",
  "subreddit": "CryptoCurrency",
  "id": "vqzo4u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "https://www.vauld.com/blog/corporate-statement/\n\n\n\n 1. The Vauld management wishes to inform that we are facing financial\n    challenges despite our best efforts. This is due to a combination of\n    circumstances such as the volatile market conditions, the financial\n    difficulties of our key…"
}