{
  "author": "jasonluxton",
  "the_new_excerpt": "All jokes of pinning the suicide hotline might be funny to you when you have\n$100 in your portfolio, but for some people these dips are catastrophic. We\nshould be here to support those that could be susceptible to depression/suicidal\nthoughts.\n\nI know a lot of the times these comments are made with…",
  "original_created_utc": 1621420280,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "自殺ホットラインをピンポイントで狙うジョークは、ポートフォリオに100ドルあるときには面白いかもしれません。\nしかし、ある人にとっては、このような落ち込みは壊滅的です。私たちは\n私たちは、うつ病や自殺願望を持つ可能性のある人たちをサポートするためにここにいるべきです。\n私たちは、うつ病や自殺願望に陥りやすい人たちをサポートすべきです。\n\nこのようなコメントがなされるのは、多くの場合...。",
      "title": "自殺ホットライン／これは一部の人が思っているような冗談ではない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当你有100美元的投资组合时，所有关于钉子自杀热线的笑话对你来说可能很有趣。\n100美元的时候，对你来说可能很有趣，但对一些人来说，这些下跌是灾难性的。我们\n我们应该在这里支持那些可能易受抑郁症/自杀想法影响的人。\n的想法。\n\n我知道很多时候，这些评论是以...",
      "title": "自杀热线/这并不像你们中的一些人认为的那样是一个笑话"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當你有100美元的投資組合時，所有關於釘子自殺熱線的笑話對你來說可能很有趣。\n100美元的時候，對你來說可能很有趣，但對一些人來說，這些下跌是災難性的。我們\n我們應該在這裏支持那些可能易受抑鬱症/自殺想法影響的人。\n的想法。\n\n我知道很多時候，這些評論是以...",
      "title": "自殺熱線/這並不像你們中的一些人認爲的那樣是一個笑話"
    }
  ],
  "title": "Suicide hotline / this isn’t a joke like some of you think it is",
  "created_utc": 1621429073,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>All jokes of pinning the suicide hotline might be funny to you when you have $100 in your portfolio, but for some people these dips are catastrophic. We should be here to support those that could be susceptible to depression/suicidal thoughts. </p>\n\n<p>I know a lot of the times these comments are made with no ill intention, but I can’t help getting a sour taste seeing 100’s of comments in the daily laughing at how the suicide hotline will get posted. </p>\n\n<p>Try losing a loved one to suicide and see how funny you find it then.</p>\n</div><!-- SC_ON -->",
  "score": 3862,
  "permalink": "/r/CryptoCurrency/comments/ng26pp/suicide_hotline_this_isnt_a_joke_like_some_of_you/",
  "subreddit": "CryptoCurrency",
  "id": "ng26pp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590801369
}