{
  "author": "thekiyote",
  "the_new_excerpt": "To start off by addressing the elephant in the room, I’m sure a lot of you\ncheered when you heard the SEC was suing Ripple, claiming they were selling an\nunregistered security. I don’t think there’s a more polarizing cryptocurrency\nout there than XRP, and the number of people who cried out it was a…",
  "original_created_utc": 1608866491,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "首先，我相信在座的很多人都会对着房间里的大象讲话。\n当你听说SEC正在起诉Ripple，声称他们正在出售\n未注册的证券。我认为没有比这更两极分化的加密货币了\n比xrp更多的人喊出这是一个…",
      "title": "如果你是加密货币的粉丝，你应该害怕SEC-Ripple诉讼。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，我相信在座的很多人都會對着房間裏的大象講話。\n當你聽說SEC正在起訴Ripple，聲稱他們正在出售\n未註冊的證券。我認爲沒有比這更兩極分化的加密貨幣了\n比xrp更多的人喊出這是一個…",
      "title": "如果你是加密貨幣的粉絲，你應該害怕SEC-Ripple訴訟。"
    }
  ],
  "title": "If you are a fan of cryptocurrency, you should be afraid of the SEC-Ripple lawsuit.",
  "created_utc": 1608885425,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>To start off by addressing the elephant in the room, I’m sure a lot of you cheered when you heard the SEC was suing Ripple, claiming they were selling an unregistered security.  I don’t think there’s a more polarizing cryptocurrency out there than XRP, and the number of people who cried out it was a “centralized shitcoin” was huge.</p>\n\n<p>I’ll be honest, while I definitely count myself on the pro-XRP side of things, if you were to ask me what the biggest risk of XRP was, it would be how much sat in Ripple’s hands after the founders of XRP essentially became the founders of Ripple.  After all, the reason why Ethereum and Bitcoin were considered exempt because they are “decentralized” due to mining.  The flip side of this was I also thought that Ripple was one of the few businesses that was actively trying to build a cryptocurrency ecosystem that had <em>real</em> utility, outside of just speculation, but maybe that utility building wouldn’t be enough.</p>\n\n<p>Imagine my surprise, when reading the SEC’s 71 page filing, after mentioning the generation of XRP once in a timeline, a good chunk of Section 2 and Section 3 could have been lifted directly from <a href=\"/r/Ripple\">/r/Ripple</a> or XRP Chat, going into detail all the positive things Ripple was doing for both XRP and the larger ecosystem, making sure the market stayed healthy, building liquidity, donating XRP and proceeds to charity, working on, and eventually creating, a product that uses XRP and funding other companies.</p>\n\n<p>The reason why the SEC did this is to develop a case that if Ripple was building use cases and markets, that would mean that those use cases didn’t already exist.  Therefore, XRP was speculative and people were investing in the common enterprise of <em>building</em> a use case (Section IV, “XRP Was a Security Throughout the Offering”).  </p>\n\n<p><strong>And this line of reasoning should scare the shit out of everybody in the cryptocurrency space.</strong></p>\n\n<p>Let’s be 100% clear, the entire cryptocurrency market right now is speculative.  This is all a very cool tech in search of an application.  In the meantime, people are trading on the speculation that a use case will come.  Even saying BTC’s use a “store of value” is just another way of saying “I think that BTC’s value will either stay the same or rise,” which makes it a speculative investment.  Ether is being bought and sold not to run dapps, but on the <em>speculation</em> that dapps will become a significant thing.</p>\n\n<p>Effectively, this shuts out any companies from doing any development of real use cases for any current or future cryptocurrencies.  The second they do, by the SEC’s definition, part of people’s speculation will be on that use case’s success.  From the way they described why XRP was a Ripple security, even mined cryptocurrencies could be considered to be securities, provided a single organization was making enough waves.  </p>\n\n<p>So, if you are a company who wants to develop on top of a cryptocurrency, you are stuck waiting on a special blessing from the SEC before you’re able to use a cryptocurrency.  Right now, that’s BTC and Ethereum (and not tokens that sit on top of it), with no method of <em>actually</em> getting approved.  </p>\n\n<p>Also, good luck seeing any non-SEC blessed tokens listed on exchanges.  No exchange wants to be accused of marketing unregistered securities.  </p>\n\n<p>We would have all been much better off, XRP investors included, if the SEC stuck with the “decentralization” argument with XRP.   If they did, XRP could be poisoned so bad that it would be untradeable, and I would be sad to lose a cryptocurrency that was making actual traction towards real utilization, but at least it wouldn’t have been an existential crisis for cryptocurrencies in the US.</p>\n</div><!-- SC_ON -->",
  "score": 99,
  "permalink": "/r/CryptoCurrency/comments/kjs6m4/if_you_are_a_fan_of_cryptocurrency_you_should_be/",
  "subreddit": "CryptoCurrency",
  "id": "kjs6m4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609495331375
}