{
  "author": "presidentsenpai",
  "the_new_excerpt": "So needless to say, I bought into the hype and ate it all up. I didn't invest\nmoney I can't afford to lose thought I did put in a reasonable amount. I even\nconvinced some other people to jump in with me believing it would be the next\nGME. Needless to say I have lost money but I still believe in the…",
  "original_created_utc": 1612395987,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "所以不用说，我也相信了炒作，吃尽了苦头。我没有投资\n我不能失去的钱，以为我确实投入了合理的金额。我甚至\n说服了其他一些人和我一起加入，相信这将是下一个。\nGME。不用说我已经亏损了，但我还是相信... ...",
      "title": "关于AMC的严重问题"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以不用說，我也相信了炒作，吃盡了苦頭。我沒有投資\n我不能失去的錢，以爲我確實投入了合理的金額。我甚至\n說服了其他一些人和我一起加入，相信這將是下一個。\nGME。不用說我已經虧損了，但我還是相信... ...",
      "title": "關於AMC的嚴重問題"
    }
  ],
  "title": "Serious questions about AMC",
  "created_utc": 1612419882,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So needless to say, I bought into the hype and ate it all up. I didn&#39;t invest money I can&#39;t afford to lose thought I did put in a reasonable amount. I even convinced some other people to jump in with me believing it would be the next GME. Needless to say I have lost money but I still believe in the cause and I still think it will make money at least in the long run so I am currently holding.</p>\n\n<p>The more I read, the more I believed in the cause. So first I want to talk about the things that have me convinced, although I know most of this comes from what people are referring to as &#39;an echo chamber&#39;:</p>\n\n<ul>\n<li><a href=\"https://www.reddit.com/r/wallstreetbets/comments/lbagpn/2221_blackrock_discloses_owning_62m_shares_of_amc/\">black rock has gotten in the fray with a huge investment</a>,</li>\n<li><a href=\"https://www.foxbusiness.com/markets/barstools-portnoy-invests-amc-stock-losing-700k-gamestop\">Dave Portnoy</a> jumped in again after posting about pulling his previous meme stock.</li>\n<li>I keep seeing the <a href=\"https://www.reddit.com/user/PalpitationSimilar67/comments/lar78f/amc_amcstock_hold/\">same sentiment thrown around of WHY</a> we are doing this</li>\n<li>Accusations of short laddering and naked shorting I (Cant post YouTube link because mods) are thrown around, while others here say its actually just normal and people on WSB are being delusional</li>\n<li>On top of this we get to stick it to the hedge funds during a time when wealth inequality is unparalleled in the country, what&#39;s not to like?</li>\n<li>I actually do believe in this stock I think theatres will come back after the vaccine and their reopening.</li>\n</ul>\n\n<p>As someone completely new and here during an unprecedented time, this is alot to take in for me.</p>\n\n<p>I began to realize just how many people believe in this, and was kinda dumb struck when I realized they might all be being played. Myself included. Next I want to talk about the reasons I feel like I should worry:</p>\n\n<ul>\n<li>GME and AMC fell off a cliff on Monday. Are people really losing interest? It seems to me like the movement is gaining momentum. What IS going on? Is it <em>really</em> market manipulation?</li>\n<li>A reddit post from here earlier today, talking about the SEC was investigating people. Not anyone from WSB, <a href=\"https://www.reddit.com/r/stocks/comments/lbyve5/clarifying_the_secs_investigation_of_social_media/\">but someone who may have used the frenzy to manipulate people on social media</a>.</li>\n</ul>\n\n<p>Clearly nobody knows what&#39;s actually going on since it seems no outlet can truly be trusted, but I would like to hear from anyone not spamming rocket ship emojis who feel like you have an actual stance on this.</p>\n</div><!-- SC_ON -->",
  "score": 91,
  "permalink": "/r/stocks/comments/lc1wnx/serious_questions_about_amc/",
  "subreddit": "stocks",
  "id": "lc1wnx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518543324
}