{
  "author": "Candelus",
  "original_created_utc": 1647184665,
  "title": "In American historical movies we never see wind mills while they were common in most of Europe, is this historically correct? If so, how did 16-19th century Americans mill grain and corn?",
  "created_utc": 1647218827,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is something I&amp;#39;ve been wondering about.&lt;/p&gt;\n\n&lt;p&gt;In American movies, set in times ranging from early colonist times , revolutionary war, civil war, westerns,... plenty of rural villages are featured but as far as I know there&amp;#39;s never a windmill.&lt;br/&gt;\nEven remote mining villages in a desert would need a way to grind wheat as flour only keeps well for a few days/weeks and must be made locally.   They were also used to crush oats, oil, malt,... &lt;/p&gt;\n\n&lt;p&gt;As the Americas were colonized by Europeans, one would expect they&amp;#39;d bring wind mills with them. Especially since there was a lot of rural activity going on.&lt;br/&gt;\nPost mills are essentially portable and were moved and reassembled regularly in Europe (even today), it would have been easy to build and ship them over. &lt;/p&gt;\n\n&lt;p&gt;I did see some references of the English shipping windmills across the Atlantic.  And the Dutch built some windmills in their colonies.    But other than that there pretty much aren&amp;#39;t many references of windmills in the US or Canada.   (Or Mexico as Spain also had windmills) &lt;/p&gt;\n\n&lt;p&gt;So, if this is a true representation of early America? If so, how did people manage to grind wheat and corn?&lt;br/&gt;\nI know water mills exist, but these aren&amp;#39;t feasible in many locations as you need water and some elevation.&lt;br/&gt;\nThere&amp;#39;s also horse mills but these were mostly used (here in Belgium) in big city centers or as a sort of back-up when there was no wind for extended periods.  &lt;/p&gt;\n\n&lt;p&gt;(I love Breughel the elder, &lt;a href=\"https://upload.wikimedia.org/wikipedia/commons/8/8f/Jan_Brueghel_I_-_Landscape_with_windmills_-_M.Ob.1060_-_National_Museum_in_Warsaw.jpg\"&gt;this is his depiction of 16th century countryside&lt;/a&gt; , knowing most villages here in Belgium had one or more wind mills it probably not too far from the truth. Granted, this is the low countries, but I assume the Americas also have flat plains and deltas that look similar to the low countries.)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 110,
  "permalink": "/r/AskHistorians/comments/td91em/in_american_historical_movies_we_never_see_wind/",
  "subreddit": "AskHistorians",
  "id": "td91em",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "This is something I've been wondering about.\n\nIn American movies, set in times ranging from early colonist times ,\nrevolutionary war, civil war, westerns,... plenty of rural villages are featured\nbut as far as I know there's never a windmill.\nEven remote mining villages in a desert would need a way…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは、私が不思議に思っていることです。\n\nアメリカ映画では、植民地時代初期から......時代を舞台にしたものが多い。\n革命戦争、南北戦争、西部劇...たくさんの田舎の村が登場します。\nしかし、私の知る限り、風車は一度もありません。\n砂漠の中の人里離れた鉱山村でさえも、風車は必要なのです...",
      "title": "アメリカの歴史映画では、ヨーロッパのほとんどの国で風車が使われていたのに、風車は出てきませんね。また、16-19世紀のアメリカ人はどのように穀物やトウモロコシを製粉していたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是我一直想知道的事情。\n\n在美国电影中，从早期的殖民主义时代到革命战争、内战、西部片......都有大量的村庄。\n革命战争、内战、西部片......都有很多农村的特色。\n但据我所知，从未出现过风车。\n即使是沙漠中的偏远采矿村，也需要一种方法...",
      "title": "在美国的历史电影中，我们从未见过风车，而风车在欧洲大部分地区很常见，这在历史上是否正确？如果是这样，16-19世纪的美国人是如何磨制谷物和玉米的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是我一直想知道的事情。\n\n在美國電影中，從早期的殖民主義時代到革命戰爭、內戰、西部片......都有大量的村莊。\n革命戰爭、內戰、西部片......都有很多農村的特色。\n但據我所知，從未出現過風車。\n即使是沙漠中的偏遠採礦村，也需要一種方法...",
      "title": "在美國的歷史電影中，我們從未見過風車，而風車在歐洲大部分地區很常見，這在歷史上是否正確？如果是這樣，16-19世紀的美國人是如何磨製穀物和玉米的？"
    }
  ]
}