{
  "author": "Candelus",
  "original_created_utc": 1647184665,
  "title": "In American historical movies we never see wind mills while they were common in most of Europe, is this historically correct? If so, how did 16-19th century Americans mill grain and corn?",
  "created_utc": 1647218827,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is something I&amp;#39;ve been wondering about.&lt;/p&gt;\n\n&lt;p&gt;In American movies, set in times ranging from early colonist times , revolutionary war, civil war, westerns,... plenty of rural villages are featured but as far as I know there&amp;#39;s never a windmill.&lt;br/&gt;\nEven remote mining villages in a desert would need a way to grind wheat as flour only keeps well for a few days/weeks and must be made locally.   They were also used to crush oats, oil, malt,... &lt;/p&gt;\n\n&lt;p&gt;As the Americas were colonized by Europeans, one would expect they&amp;#39;d bring wind mills with them. Especially since there was a lot of rural activity going on.&lt;br/&gt;\nPost mills are essentially portable and were moved and reassembled regularly in Europe (even today), it would have been easy to build and ship them over. &lt;/p&gt;\n\n&lt;p&gt;I did see some references of the English shipping windmills across the Atlantic.  And the Dutch built some windmills in their colonies.    But other than that there pretty much aren&amp;#39;t many references of windmills in the US or Canada.   (Or Mexico as Spain also had windmills) &lt;/p&gt;\n\n&lt;p&gt;So, if this is a true representation of early America? If so, how did people manage to grind wheat and corn?&lt;br/&gt;\nI know water mills exist, but these aren&amp;#39;t feasible in many locations as you need water and some elevation.&lt;br/&gt;\nThere&amp;#39;s also horse mills but these were mostly used (here in Belgium) in big city centers or as a sort of back-up when there was no wind for extended periods.  &lt;/p&gt;\n\n&lt;p&gt;(I love Breughel the elder, &lt;a href=\"https://upload.wikimedia.org/wikipedia/commons/8/8f/Jan_Brueghel_I_-_Landscape_with_windmills_-_M.Ob.1060_-_National_Museum_in_Warsaw.jpg\"&gt;this is his depiction of 16th century countryside&lt;/a&gt; , knowing most villages here in Belgium had one or more wind mills it probably not too far from the truth. Granted, this is the low countries, but I assume the Americas also have flat plains and deltas that look similar to the low countries.)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 110,
  "permalink": "/r/AskHistorians/comments/td91em/in_american_historical_movies_we_never_see_wind/",
  "subreddit": "AskHistorians",
  "id": "td91em",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "This is something I've been wondering about.\n\nIn American movies, set in times ranging from early colonist times ,\nrevolutionary war, civil war, westerns,... plenty of rural villages are featured\nbut as far as I know there's never a windmill.\nEven remote mining villages in a desert would need a way…"
}