{
  "author": "lunargrover",
  "original_created_utc": 1633151695,
  "title": "If you guys want to *actually* post an “unpopular opinion,” try thinking of things that will *actually* be unpopular. For example….",
  "created_utc": 1633159836,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>ALGO is a lost cause. It has no future and will never be worth more than $2.50 if you’re lucky because of the shit tokenomics. </p>\n\n<p>It is amazing how FAST your favorite shitcoin completes transactions because NO ONE EVER USES IT. </p>\n\n<p>Moons are pointless and have no use case. Sell them now while they’re actually worth something for some stupid reason.  </p>\n\n<p>No one gives a flying fuck about NANO anymore.   </p>\n\n<p>Tether is totally legit; you’re either just being paranoid or creating FUD. </p>\n\n<p>High gas fees means ETH is ACTUALLY BEING USED. It also means that it’s cheaper and faster to just transfer money with a bank. </p>\n\n<p>Oh, you think because you bought a coin it’s going to dip, and because you sold, it’s going to moon? No. It has nothing to do with you. You are meaningless.  </p>\n\n<p>Time in the market &gt; Timing the market? No, you are just stupid and don’t know what the fuck you’re doing.  </p>\n\n<p>Nobody gives a fuck about LINK anymore. </p>\n\n<p>Take a break from the charts. We don’t give a shit.  </p>\n\n<p>Bitcoin maxis are wearing blinders. Alt coins are equally important.  </p>\n\n<p>Alt coins aren’t shit without Bitcoin. Bitcoin is the gold standard upon which all alt coins are valued against.  </p>\n\n<p>Your love of hating Elon Musk is what fuels his lithium-ion batteries. </p>\n\n<p>CKB is a pump and dump scamcoin promoted by con-artists. Cardio Kick Boxing will not survive a bear market.  </p>\n\n<p>Not your keys, not your coins? Well, if you forget your seed phrase, they’re not your coins either, dumbass.  </p>\n\n<p>Wallets, staking, governance, transferring, mining, smart contracts, candlesticks, hard forks, market cap, seed phrases, protocol, TA, FA, halvings, FUD, DeFi, NFT, ETF, FOMO, DEX, APY, DCA, DYOR, USDC, POS, POW, CBDCs…you seriously expect this shit to go mainstream? Good fucking luck!  </p>\n\n<p>Maybe China was right all along.  </p>\n\n<p>HODL is what we do when we don’t know what to do.  </p>\n\n<p>Michael Saylor just wants you to pump his bags.  </p>\n\n<p>Everyone that you’ve been seeking advice from  on <a href=\"/r/Cryptocurrency\">r/Cryptocurrency</a> has invested a grand total of $75 and is 16-19 years old and living in their parent’s basement.  </p>\n\n<p>Charles Hoskinson is a lovable teddy bear and/or Rush Limbaugh incarnate.  </p>\n\n<p>Vitalik Buterin is the sexiest man in crypto. And that’s not saying much.  </p>\n\n<p>Bitcoin may be king, but have you heard about regicide?</p>\n\n<p>You should have put all your money into Ethereum Classic and Bitcoin Cash.  </p>\n\n<p>Bulls suck. Bears suck. We all suck.  </p>\n\n<p>You only wish you could afford ramen.  </p>\n\n<p>Many smart people have made a lot of money with DOGE and SHIB. SHIB is the third most held coin by ETH whales.  What’s that all about, huh?  Feel stupid because you missed out? You should.  </p>\n\n<p>The market cap for all of crypto is less than Apple because the iPhone 13 is more innovative than 5000 invisible coins.  </p>\n\n<p>Nobody really uses crypto. It’s not undervalued, it’s overvalued. This is all one big meaningless exercise in futility.  </p>\n\n<p>You are not early. You are LATE.  </p>\n\n<p>You’ll never be rich. You suck.  </p>\n\n<p>Your mother never loved you. </p>\n\n<p>Now it’s your turn. Say something that is <strong>actually</strong> unpopular, even if you don’t believe in what you say, and we promise not to downvote you.</p>\n</div><!-- SC_ON -->",
  "score": 305,
  "permalink": "/r/CryptoCurrency/comments/pzoym7/if_you_guys_want_to_actually_post_an_unpopular/",
  "subreddit": "CryptoCurrency",
  "id": "pzoym7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "ALGO is a lost cause. It has no future and will never be worth more than $2.50\nif you’re lucky because of the shit tokenomics.\n\nIt is amazing how FAST your favorite shitcoin completes transactions because NO\nONE EVER USES IT.\n\nMoons are pointless and have no use case. Sell them now while they’re…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ALGOは迷走しています。未来はなく、2.5ドル以上の価値はないでしょう。\n運が良ければ2.5ドル以上の価値になるでしょう。\n\nあなたのお気に入りのクソコインがどれだけ早く取引を完了するかは驚くべきことです。\n誰も使っていないからです。\n\nムーンは無意味で、ユースケースがありません。今のうちに売りましょう。",
      "title": "もし皆さんが「不評な意見」を投稿したいと思っているなら、「実際に不評になること」を考えてみてください。例えば、...."
    },
    {
      "locale": "zh",
      "the_new_excerpt": "ALGO是一个失败的事业。它没有前途，价值永远不会超过2.5美元。\n如果你运气好的话，因为狗屁tokenomics的关系。\n\n令人惊讶的是，你最喜欢的狗屎币完成交易的速度是如此之快，因为没有人使用它。\n没有人使用它。\n\n月球是毫无意义的，没有任何使用案例。趁现在卖掉它们...",
      "title": "如果你们想*真正*发表 \"不受欢迎的意见\"，请试着想一想会*真正*不受欢迎的事情。例如：...."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "ALGO是一個失敗的事業。它沒有前途，價值永遠不會超過2.5美元。\n如果你運氣好的話，因爲狗屁tokenomics的關係。\n\n令人驚訝的是，你最喜歡的狗屎幣完成交易的速度是如此之快，因爲沒有人使用它。\n沒有人使用它。\n\n月球是毫無意義的，沒有任何使用案例。趁現在賣掉它們...",
      "title": "如果你們想*真正*發表 \"不受歡迎的意見\"，請試着想一想會*真正*不受歡迎的事情。例如：...."
    }
  ]
}