{
  "author": "Eluchel",
  "original_created_utc": 1626809971,
  "title": "Ask me about any crypto in the top 100 and I will tell you why it is a terrible buy and what you should get instead. Every answer guaranteed unique or you get your money back!",
  "created_utc": 1626823839,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>With all this negative news lately I think we all could use a laugh. So ask me about any crypto in the top 100 and I will tell you why it is terrible and what you should get instead. Every answer guaranteed to be unique or you get your money back! </p>\n\n<p>Disclaimer: this is a joke and is not financial advice. I am guaranteed to be invested in some of the coins I roast, this is all for the fun of it</p>\n\n<p>Edit: wow this blew up. I will answer everything as soon as I can!\nEdit 2: <em>chuckles</em> I didn&#39;t expect this many comments. I will answer everything as soon as I can but it could take a couple days to get through everything. \nI am really enjoying this though, thanks for relaxing with me here! :)</p>\n</div><!-- SC_ON -->",
  "score": 196,
  "permalink": "/r/CryptoCurrency/comments/oo9eji/ask_me_about_any_crypto_in_the_top_100_and_i_will/",
  "subreddit": "CryptoCurrency",
  "id": "oo9eji",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "With all this negative news lately I think we all could use a laugh. So ask me\nabout any crypto in the top 100 and I will tell you why it is terrible and what\nyou should get instead. Every answer guaranteed to be unique or you get your\nmoney back!\n\nDisclaimer: this is a joke and is not financial…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近はネガティブなニュースが多いので、みんなで笑いたいと思います。そこで、私に\n聞くと、なぜそれが悪いのか、何を買えばいいのかを教えます。\n代わりに何を買えばいいかを教えます。すべての回答がユニークであることを保証します。\nお金をお返しします。\n\n免責事項：これはジョークであり、金融ではありません...",
      "title": "トップ100に入っている暗号について私に尋ねれば、それがひどい買い物である理由と、代わりに何を買えばいいかを教えます。すべての回答がユニークであることを保証します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近有这么多负面新闻，我想我们都需要笑一笑。所以问我\n关于前100名中的任何加密货币，我会告诉你为什么它很糟糕，以及你应该买什么。\n你应该买什么。每个答案都保证是独特的，否则你会得到你的\n钱退还给你!\n\n免责声明：这是个笑话，不是金融...",
      "title": "问我关于前100名中的任何加密货币，我会告诉你为什么它是一个糟糕的买点，以及你应该买什么来代替。每一个答案都保证是独一无二的，否则你会得到退款!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近有這麼多負面新聞，我想我們都需要笑一笑。所以問我\n關於前100名中的任何加密貨幣，我會告訴你爲什麼它很糟糕，以及你應該買什麼。\n你應該買什麼。每個答案都保證是獨特的，否則你會得到你的\n錢退還給你!\n\n免責聲明：這是個笑話，不是金融...",
      "title": "問我關於前100名中的任何加密貨幣，我會告訴你爲什麼它是一個糟糕的買點，以及你應該買什麼來代替。每一個答案都保證是獨一無二的，否則你會得到退款!"
    }
  ]
}