{
  "author": "Guigamuck",
  "original_created_utc": 1635245321,
  "title": "Brazil and bitcoin adoption - Crypto Purchased by Brazilian Citizens Eclipsed $4B in 2021",
  "created_utc": 1635280531,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>While everyone in the space is talking about El Salvador and its crypto adoption - which I&#39;m really excited about since it&#39;s great that they are taking important steps towards the adoption of cryptocurrencies, did you know brazilians buy bitcoin because our currency, The Brazilian Real (BRL), has been losing value? In the last twelve months 1 USD cost about 3.90 BRL and today it&#39;s rated at 5.70 BRL per USD. A loss of over 25%.</p>\n\n<p>In Brazil, we don&#39;t buy Bitcoin because it is the best investment in the world (which is most likely true) but also to protect ourselves against hyperinflation - this year alone the cost of gasoline and diesel went up over 40%. However with our national currency deteriorating at an alarming rate; many people want protection for their money by investing in cryptocurrencies.</p>\n</div><!-- SC_ON -->",
  "score": 163,
  "permalink": "/r/Bitcoin/comments/qg3pau/brazil_and_bitcoin_adoption_crypto_purchased_by/",
  "subreddit": "Bitcoin",
  "id": "qg3pau",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "While everyone in the space is talking about El Salvador and its crypto adoption\n- which I'm really excited about since it's great that they are taking important\nsteps towards the adoption of cryptocurrencies, did you know brazilians buy\nbitcoin because our currency, The Brazilian Real (BRL), has…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "世間ではエルサルバドルとその暗号化採用について話題になっていますが\n- 私は、彼らが暗号通貨の導入に向けて重要な一歩を踏み出すことは素晴らしいことだと思い、とても興奮しています。\nブラジル人がビットコインを購入するのは、通貨であるブラジル・レアル（BRL）が...。\nブラジル人がビットコインを買うのは、ブラジルの通貨であるブラジルレアル（BRL）が...",
      "title": "ブラジルとビットコインの普及 - ブラジル国民が購入した暗号は2021年に40億ドルを突破"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当这个领域的每个人都在谈论萨尔瓦多和它的加密货币应用时\n- 我真的很兴奋，因为他们正在采取重要的步骤来采用加密货币，这很好。\n他们在采用加密货币方面迈出了重要的一步，你知道巴西人购买\n你知道巴西人购买比特币是因为我们的货币巴西雷亚尔（BRL）已经...",
      "title": "巴西和比特币的采用 - 巴西公民购买的加密货币在2021年突破40亿美元"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當這個領域的每個人都在談論薩爾瓦多和它的加密貨幣應用時\n- 我真的很興奮，因爲他們正在採取重要的步驟來採用加密貨幣，這很好。\n他們在採用加密貨幣方面邁出了重要的一步，你知道巴西人購買\n你知道巴西人購買比特幣是因爲我們的貨幣巴西雷亞爾（BRL）已經...",
      "title": "巴西和比特幣的採用 - 巴西公民購買的加密貨幣在2021年突破40億美元"
    }
  ]
}