{
  "author": "Dachshundlover91",
  "the_new_excerpt": "I have a job delivering for a local sandwich shop. About an hour ago, I\ndelivered a cash order of a single sandwich (the entire order came to be about\n$12 including tax and delivery fee) to an apartment, and an adult man with\nDown's syndrome answered the door. He handed me a bill that was folded…",
  "original_created_utc": 1611279584,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我有一份为当地一家三明治店送货的工作。大约一个小时前，我\n递送了一个单人三明治的现金订单（整个订单大约是1,000美元）。\n12美元（含税和送货费）的公寓，以及一名成年男子与。\n唐氏综合症患者应门。他递给我一张折叠的钞票... ...",
      "title": "给一个唐氏综合症患者送去12元的食品订单，他们支付了100元，这种情况下我应该怎么做？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我有一份爲當地一家三明治店送貨的工作。大約一個小時前，我\n遞送了一個單人三明治的現金訂單（整個訂單大約是1,000美元）。\n12美元（含稅和送貨費）的公寓，以及一名成年男子與。\n唐氏綜合症患者應門。他遞給我一張摺疊的鈔票... ...",
      "title": "給一個唐氏綜合症患者送去12元的食品訂單，他們支付了100元，這種情況下我應該怎麼做？"
    }
  ],
  "title": "Delivered $12 food order to a person with Down Syndrome and they paid $100, what should I have done in this situation?",
  "created_utc": 1611295331,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have a job delivering for a local sandwich shop. About an hour ago, I delivered a cash order of a single sandwich (the entire order came to be about $12 including tax and delivery fee) to an apartment, and an adult man with Down&#39;s syndrome answered the door. He handed me a bill that was folded into an origami crane. When I unfolded it (back in my car), it turned out to be an $100 bill.</p>\n\n<p>Now my anxiety is through the roof because I&#39;m afraid that the man may not have known the value of the bill and that by accepting it, I would be taking advantage of him. </p>\n\n<p>My friend said that he probably knew the value and just wanted to give me an $80+ tip, but even that feels wrong to accept... am I just overthinking the entire situation?</p>\n\n<p>Edit: I just asked my boss about it and he said, &quot;If his family members are giving him $100 bills, that means he knows the value of them. So he probably knew what he was doing.&quot;</p>\n</div><!-- SC_ON -->",
  "score": 19728,
  "permalink": "/r/NoStupidQuestions/comments/l2d2ba/delivered_12_food_order_to_a_person_with_down/",
  "subreddit": "NoStupidQuestions",
  "id": "l2d2ba",
  "is_self": true,
  "media": null,
  "is_video": false
}