{
  "author": "Ergheis",
  "original_created_utc": 1629135408,
  "title": "How exactly does training for muscle hypertrophy work? Why do muscles grow the best at a certain intensity and certain volume?",
  "created_utc": 1629174780,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The general rule of training for hypertrophy - as opposed to training for strength - is something like 70% your maximum, 10 repetitions per set. Those are generalized numbers, I&#39;m not being accurate and this is broscience, but the core advice given is &quot;less intensity and more repetitions will increase the size of your muscles instead of the strength.&quot;</p>\n\n<p>Alot of sites explain how but not why the muscles respond that way. Why at that amount and duration?</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/askscience/comments/p5ky0k/how_exactly_does_training_for_muscle_hypertrophy/",
  "subreddit": "askscience",
  "id": "p5ky0k",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The general rule of training for hypertrophy - as opposed to training for\nstrength - is something like 70% your maximum, 10 repetitions per set. Those are\ngeneralized numbers, I'm not being accurate and this is broscience, but the core\nadvice given is \"less intensity and more repetitions will…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "筋力増強のためのトレーニングではなく、肥大化のためのトレーニングの一般的なルールは、最大値の70％、1セット10回といったところです。\n筋力増強のためのトレーニングではなく、肥大化のためのトレーニングの一般的なルールは、最大値の70％、1セット10回というようなものです。これは一般的な数字です。\nこれは一般的な数字であり、正確ではありませんし、一般的な科学でもあります。\nこれは一般的な数字であり、正確ではありません。",
      "title": "筋肥大のためのトレーニングとは、具体的にどのようなものなのでしょうか？なぜ筋肉は一定の強度、一定の量で最も成長するのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "肥大训练的一般规则--相对于力量训练而言\n力量训练的一般规则是70%的最大限度，每组重复10次。这些是\n这些都是笼统的数字，我并不准确，而且这也是兄弟科学，但核心的\n但给出的核心建议是 \"更少的强度和更多的重复将...",
      "title": "肌肉肥大的训练究竟是如何进行的？为什么肌肉在一定强度和一定量的情况下生长得最好？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "肥大訓練的一般規則--相對於力量訓練而言\n力量訓練的一般規則是70%的最大限度，每組重複10次。這些是\n這些都是籠統的數字，我並不準確，而且這也是兄弟科學，但核心的\n但給出的核心建議是 \"更少的強度和更多的重複將...",
      "title": "肌肉肥大的訓練究竟是如何進行的？爲什麼肌肉在一定強度和一定量的情況下生長得最好？"
    }
  ]
}