{
  "author": "TheDeanWebb",
  "original_created_utc": 1655598724,
  "title": "I made an app, called Rose, to help people learn simplified Chinese. Currently in open beta on android.",
  "created_utc": 1655612000,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Firstly, I would like to thank everyone that have used and tested my app so far and have given me feedback. It has been hugely appreciated and has helped me to find flaws I would never have noticed.&lt;/p&gt;\n\n&lt;p&gt;My idea for the app was to focus it heavily around customisability, allowing people to learn the way they want to. That might be from wanting to find the right pinyin for the hanzi displayed in a game of multiple choice, or matching up english, pinyin and hanzi in a card match game. You are able to adjust the difficulty to what you prefer, such as the amount of questions you want to answer or the amount of choices you have to choose from. You are even able to choose what themes you want to study, for example if you want to focus on animals and numbers, a few clicks will allow you to do just that. You can even focus on groups such as new words, words you have commonly got incorrect, or even just words that you have picked out yourself.&lt;/p&gt;\n\n&lt;p&gt;Currently the app is only available on android, so unfortunately you will need an android device in order to use it. But if you want to try out the beta version, follow the link, &lt;a href=\"https://play.google.com/store/apps/details?id=com.DeanWebb.Rose\"&gt;Rose&lt;/a&gt;. If you wish to be a part in the closed alpha, which will be getting more frequent updates, message me.&lt;/p&gt;\n\n&lt;p&gt;Finally, I thank you all for reading this and I wish you all the best with your learning.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 5,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/gIWk5z49_QWyjtzmtaLhJzJxDj3ztF2-hdb21Kbjr9k.jpg?auto=webp&amp;s=082ad617dadc3858d8b484edd3517fd12d29088e",
          "width": 512,
          "height": 512
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/gIWk5z49_QWyjtzmtaLhJzJxDj3ztF2-hdb21Kbjr9k.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=deae3e0902929d7ab46a8d484631de7289bd7503",
            "width": 108,
            "height": 108
          },
          {
            "url": "https://external-preview.redd.it/gIWk5z49_QWyjtzmtaLhJzJxDj3ztF2-hdb21Kbjr9k.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=467d9e70c34488ee2e87d20e0d70db7e5cb03539",
            "width": 216,
            "height": 216
          },
          {
            "url": "https://external-preview.redd.it/gIWk5z49_QWyjtzmtaLhJzJxDj3ztF2-hdb21Kbjr9k.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=22709ac644a38f81875078860360c4ef7d321c4e",
            "width": 320,
            "height": 320
          }
        ],
        "variants": {},
        "id": "kCJnIaSEjJzZbaIy6B9zQRxsVNZg29uCNaLIBpCbWn8"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/SideProject/comments/vfj84j/i_made_an_app_called_rose_to_help_people_learn/",
  "subreddit": "SideProject",
  "id": "vfj84j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Firstly, I would like to thank everyone that have used and tested my app so far\nand have given me feedback. It has been hugely appreciated and has helped me to\nfind flaws I would never have noticed.\n\nMy idea for the app was to focus it heavily around customisability, allowing\npeople to learn the…"
}