{
  "author": "0toHeroInvesting",
  "the_new_excerpt": "In this post we are going to go through an in-depth analysis of AMD, we are\ngoing to take a look at their fundamental value, their DCF, do a little\ntechnical analysis and set some price targets for the near future and for the\nlong term\n\n~Very Long Post~ [Do NOT Read if you don't like comprehensive…",
  "original_created_utc": 1612269629,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在这篇文章中，我们将通过对AMD的深入分析，我们是\n要看一下他们的基本价值，他们的DCF，做一个小小的\n技术分析，并设定了一些近期的价格目标，以及对。\n长期\n\n~非常长的帖子~ [如果你不喜欢全面的，请不要读...",
      "title": "AMD完整的股票分析及价格目标预测"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在這篇文章中，我們將通過對AMD的深入分析，我們是\n要看一下他們的基本價值，他們的DCF，做一個小小的\n技術分析，並設定了一些近期的價格目標，以及對。\n長期\n\n~非常長的帖子~ [如果你不喜歡全面的，請不要讀...",
      "title": "AMD完整的股票分析及價格目標預測"
    }
  ],
  "title": "AMD Complete Stock Analysis & Price Target Prediction",
  "created_utc": 1612280172,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In this post we are going to go through an in-depth analysis of AMD, we are going to take a look at their fundamental value, their DCF, do a little technical analysis and set some price targets for the near future and for the long term</p>\n\n<p>~Very Long Post~ [Do NOT Read if you don&#39;t like comprehensive analysis]</p>\n\n<p>Hello everyone! Let’s start by talking a little about <a href=\"https://ibb.co/d0cPRrj\">AMD</a>, they are one of the biggest semiconductor companies in the world, and they operate in multiple segments like Computing, Gaming, Enterprise, Semi-Custom and many more with some of the most important products for the company being microprocessors and GPUs both for personal use like (gaming consoles &amp; PCs) while also offering products for professional use like data centers.</p>\n\n<p>The company was founded more than 50 years ago and have more than 11K employees, with the company overperforming recently as they have seen a more than 80% rise in the last year.</p>\n\n<p>So, guys, let’s go a little through the 4th quarter &amp; yearly <a href=\"https://ibb.co/f0CLSF7\">results</a> for AMD. The company reported a revenue of $3.24B in the 4th quarter, with a 53% growth since last year, while for the full year they earned almost $10B as they more than doubled they quarterly and full year net income, which resulted in a $1.29 earnings/share for the year.</p>\n\n<p>The <a href=\"https://ibb.co/TY6trfs\">company</a> has 2 major income segments in Computing &amp; Graphics which brought in sales of over $6.4B for the year and an operating income of $1.26B and the Enterprise, Embedded and Semi-Custom segment which brought in $3.3B in revenues and almost $400M in operating income. They also provide an additional segment that doesn’t bring in any revenues but which represents costs that can’t be associated with any of the other 2 segments, but also includes stock-based compensations and acquisitions related costs.</p>\n\n<p>Both of these 2 <a href=\"https://ibb.co/qdfVyrK\">segments</a> have seen huge increases in the past year with operating income doubling for the computing &amp; graphics segment and increasing by almost 50% for the EEC segment.</p>\n\n<p><a href=\"https://ibb.co/tYmkPwg\">AMD</a> didn’t have such a big capital expenditure in 2020, with only $294M but this can increase depending on the demand of their products while they also <a href=\"https://ibb.co/hCtfk2k\">adjusted</a> their income with $312M in depreciation &amp; amortizations. Both of these numbers have increased by 40 to 50% in the past years and will be important in the DCF valuation.</p>\n\n<p>They have also managed to increase the gross profit margin to 45%, up 2% from 2019 as their earnings before interest &amp; tax or <a href=\"https://ibb.co/xDptyzW\">EBIT</a> stood at $1.37B.</p>\n\n<p>The company has seen a continued earnings per share <a href=\"https://ibb.co/FhLj0Y7\">growth</a> overall, despite the first 2 quarters of 2020 coming in lower than previous, but that was to be expected as this was impacted by the reduced <a href=\"https://ibb.co/QdjCvnx\">revenues</a> in Q1 &amp; Q2 before things started to pick up back again, as they finished with a huge increase overall in the 4th quarter.</p>\n\n<p>Their product <a href=\"https://ibb.co/YkjNDbY\">portfolio</a> has become a great challenge to Intel’s market share and is continuing to evolve, as Intel is still struggling to regain momentum with their products.</p>\n\n<p><a href=\"https://ibb.co/XX3h4CD\">AMD</a> announced the world’s best processors for laptop and an enterprise variant that is expected to be available in the first half of 2021.</p>\n\n<p>They have also launched the fastest <a href=\"https://ibb.co/fQQnFj4\">AMD</a> gaming graphics card ever while also working with big companies like Amazon on their AWS cloud offerings &amp; Microsoft Azure which are planning to use their upcoming 3rd generation EPYC processors.</p>\n\n<p>AMD is also involved in supercomputers which indicates that they are continuing to innovate and develop products that will be in high demand for the foreseeable future</p>\n\n<p>The one big thing that can propel AMD even more in the future is the proposed acquisition or more rather merger with Xilinx , which also beat earnings expectations the other day, with revenues of over $800M for the quarter and a Free Cash Flow of 44% of their revenues. Xilinx has a market cap of over $32B, and the combination of the 2 companies would create synergies. They are targeting an all-stock transaction which will have implications on my projections, but as time has gone, the $35B price tag is only a 10% premium for Xilinx. The one hurdle the companies have to pass is the regulatory procedures. We will have to wait and see if the deal goes through or not, as it’s expected the deal should be finished by the end of the year, with AMD shareholders retaining 74% of the new group shares and Xilinx holding the remaining 26%.</p>\n\n<p>AMD also offered great <a href=\"https://ibb.co/n649gFm\">guidance</a> for 2021 as they expect the strength of their product <a href=\"https://ibb.co/Xbx5TV4\">portfolio</a> to push AMD revenues up 37% over 2020 and also expect their gross margin to increase to 47%, while they expect an effective tax rate for next year of 15%, well belove the 21% US corporate tax rate.</p>\n\n<p>I have made some predictions based on the growth rate of the company, the latest plans announced by them and used some estimates and expectations. So, keep in mind this are only projections and are calculated by myself, this is not an investment advice and you should do your own research and so on…</p>\n\n<p>So, let’s start with the Unleveraged discounted free cash flow <a href=\"https://ibb.co/hKFMswn\">projections</a> to see what the current valuation of the company is.</p>\n\n<p>I used their total revenues projections that we will discuss later on in the long-term projection and the net income for 2020 to which I added back the Depreciation &amp; Amortization costs they had in 2020 and got to a $1.68B EBITDA.</p>\n\n<p>For the next years I used 1% increase in EBIT margin which I think they can achieve pretty easy and an increase in capex of 10%/year in order to maintain an increased production capacity while also applying a 15% decrease in their net working capital.</p>\n\n<p>So, for an 8% discount rate, which is pretty much the Average SP500 return, we get a $9.7B Discounted Free Cash Flow by 2025.</p>\n\n<p>Now there are 2 methods of doing the valuation, either the perpetuity method or the EBITDA multiple method, but for both of them we do have to subtract or add the net assets or debt, which in this case stands $5.75B in assets. I personally think a use of the average is better suited for most companies, though some of the companies trade largely on the EBITDA approach and other on the growth approach.</p>\n\n<p>If we use the growth approach, we can see that AMD is pretty fairly valued right now, as this implies a loss of 2%, while on the other hand the EBITDA multiple approach gives us a valuation of over $112, meaning an almost 30% undervaluation of the company. But as I said, I think a use of the average is best, so, my current price target for AMD in 2021 is $98.82, implying a 13.5% return from the last price.</p>\n\n<p>And now let’s move on to a longer-term valuation of the company based on the growth projections I have for AMD.</p>\n\n<p>For my <a href=\"https://ibb.co/cx8pfhr\">projections</a> I actually just used their full year results and implied different growth rates for each revenue stream. I think we can continue to see 50% growth rate in the EEC segment for 2021 and then implying a gradual slowing of their growth, while for the Computing &amp; Graphics segment I implied a 35% growth, way lower than the over 100% they saw in 2020, also implying a gradual slowdown of the trend by 2025.</p>\n\n<p>I think these growth implications are pretty reasonable giving the high demand the company has seen for their entire product line, especially as gaming revenues have continued to increase, and also taking into account the need for their products in data centers, cloud usage &amp; digital currency mining.</p>\n\n<p>For their cost of <a href=\"https://ibb.co/cx8pfhr\">sales</a>, I started from the current ones which stand at 80% for the Computing &amp; Graphics segment and implied a 1% improvement each year, while for the EEC segment I started from the 88% expense margin right now and implied a gradual 2% improvement. I also maintained their other expense regarding to the cost of sales to 3% of their total revenues, in-line with the previous years.</p>\n\n<p>This means for <a href=\"https://ibb.co/swQfJgf\">2025</a> we would get just over $33B in revenues and $26B in expenses, resulting in a gross profit of almost $7B. I also maintained the same capex as in the DCF and also <a href=\"https://ibb.co/SshLk4K\">substracted</a> the interest &amp; other expenses for which I implied a 5% annual growth, thus leading us to a $6.28B in earnings before tax.</p>\n\n<p>I <a href=\"https://ibb.co/SshLk4K\">maintained</a> their 15% effective tax rate projections and also diluted their shares by 1% each year accounting for some dilution in the stock.</p>\n\n<p>So, for the $5.3B in 2025 revenues after tax and accounting for 1.27B shares, that would mean a $4.21 earnings/share, meaning the <a href=\"https://ibb.co/HYzfCkz\">stock</a> is trading at 20 times forward price to earnings for 2025.</p>\n\n<p>I like to base my future projections on Forward/PE valuations so, with the current projected PE and depending on what PE you assume for the stock between 25 and 40, the stock can trade between $105 and almost $168.</p>\n\n<p>So, after all these estimates what are my price targets? <a href=\"https://ibb.co/SyN8bn9\">HERE</a> are my actual price targets</p>\n\n<p>I think the 2025 bear case price we can see AMD trade at is $115 which would imply a return of almost 33% , while my base case and my pretty safe assumption is that AMD will trade at 137$/share by the end of 2025, implying a 57% return on the current price. But my most bullish case would see the company trading at $158, which would imply a return of over 81%. So yeah guys, these are my Overall price targets for 2025, my bear case is an average of the 25 &amp; 30 PE ratio, while the normal case is the average between the 30 and 35 PE’s with the most bullish case valuing the company between a PE of 35-40.</p>\n\n<p>So <a href=\"https://docs.google.com/spreadsheets/d/1rkJLAXxwqbo6WEfR9NfPEKZagiW4EVbRsz58ejqTVEI\">HERE</a> is the full spreadsheet that I have projected for AMD by 2025, if you do have another opinion or a suggestion please leave a comment down below, I think I have been conservative in most of my projections, but feel free to give your opinion.</p>\n\n<p>I think these are pretty reasonable <a href=\"https://ibb.co/9NTJYmP\">targets</a>, as the semiconductors industry will keep on booming in the next decade, as the world will need more &amp; more chips that also keep advancing in technology.</p>\n\n<p>The company also has very good financials, with almost $9B in assets vs just $3.1B in total liabilities, which can be easily paid by just the current assets.</p>\n\n<p>And let’s also take a look at what the estimates are from the <a href=\"https://ibb.co/G0QpnrW\">analysts</a>. We can only see EPS estimates until 2023 of $3.22, which I think is safe to say can grow an additional dollar by 2025, so my projections are pretty in-line with what other experts anticipate.</p>\n\n<p>So, what do I expect in the next couple of days, weeks and months for AMD?</p>\n\n<p>Let’s look at this <a href=\"https://ibb.co/wQw6CQP\">CHART</a>, the stock just broke below the long-term uptrend but has seen good support at the $86-87 levels, which is where the next support should stand. We saw AMD pushing towards $100 in the beginning of the year, but it hit major resistance once Intel also announced a change in their leadership, as they brought in the WMWare CEO Gelsinger, but it’s very hard to see him turn around Intel in a very short time. Intel will need some years &amp; a lot of capital expenditure to turn things around, if they do manage to do it at all.</p>\n\n<p>AMD hasn’t been overbought since August, and currently has an RSI near 41, which is pretty oversold for a good company, so I expect to see them regaining some momentum in the near-term, but I guess the market is very busy with the current short-squeezes. AMD will se a lot of resistance breaking through the $100 level, not because of something fundamental with the company, but I guess it’s a psychological resistance rather.</p>\n\n<p>And let’s take a quick look at what 24 <a href=\"https://ibb.co/bKRQwXP\">analysts</a> on Wall Street are saying. They mostly have a buy call on the company with an average price target of $100 and a high price target of $135. So, I think the analyst are pretty spot on with AMD, but my PT are slightly lower as it’s always better to undershoot and overperform rather than the other way around.</p>\n\n<p>So, what would I do? Well, I own AMD stock and I believe it still has plenty of room to grow, so I would start building a position right now and add on any weakness, and I would especially buy more if the stock drops even lower than 80$.</p>\n\n<p>One last thing to mention about AMD is that they also have a very big % of their shares held by institutions, with over 74% of the float being held by big funds like Vanguard &amp; Blackrock which does significantly reduce the sell-off possibilities.</p>\n\n<p>So, this are my projections and my expectations for the company, I think Lisa SU has done a terrific job since becoming the CEO, and has driven AMD to a renewed approach to their business, as the company has been booming in the past 5 years, growing more than twice as much as Nvidia and crushing the SP500 and Intel’s performance.</p>\n\n<p>Thank you everyone for reading! Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market! Have a great day and see you next time!</p>\n</div><!-- SC_ON -->",
  "score": 712,
  "permalink": "/r/stocks/comments/laulsh/amd_complete_stock_analysis_price_target/",
  "subreddit": "stocks",
  "id": "laulsh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518541044
}