{
  "author": "Floofyboy",
  "the_new_excerpt": "People seem to think because we had 2 big crash close together in 2000 and 2008,\nwe are bound to have one soon.\n\nI want to remind people before the year 2000, we had a 20 years bullish run. Its\ntotally not impossible we get to 2030 with no crash, especially now that the\nfeds baby sit the…",
  "original_created_utc": 1614396223,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "人们似乎认为，因为我们在2000年和2008年有2次大的崩盘相近。\n我们很快就会有一个。\n\n我想提醒大家在2000年之前，我们有20年的牛市。其\n我们到2030年也不是不可能的，尤其是在现在，我们已经有了足够的时间和精力来处理这些问题。\n联邦调查局的保姆...",
      "title": "我看好未来"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "人們似乎認爲，因爲我們在2000年和2008年有2次大的崩盤相近。\n我們很快就會有一個。\n\n我想提醒大家在2000年之前，我們有20年的牛市。其\n我們到2030年也不是不可能的，尤其是在現在，我們已經有了足夠的時間和精力來處理這些問題。\n聯邦調查局的保姆...",
      "title": "我看好未來"
    }
  ],
  "title": "I am bullish about the future",
  "created_utc": 1614400227,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>People seem to think because we had 2 big crash close together in 2000 and 2008, we are bound to have one soon.</p>\n\n<p>I want to remind people before the year 2000, we had a 20 years bullish run. Its totally not impossible we get to 2030 with no crash, especially now that the feds baby sit the market.</p>\n\n<p>Secondly, we have extremely nice upcoming market conditions. Stimulus checks will either get people to spend money to stimulate the economy, or get them to invest, both will help the stock market. The media is somehow trying to make us believe this is bad, but i think its just bullshit. Inflation has been ultra low for way too long, and feds actually want it to increase. They said many times they won&#39;t increase rates before 2023.</p>\n\n<p>Thirdly, i also think we have more upcomming money sources coming into the market than ever. People from other countries invest in US stock market. With all the GME hype, more people than ever are joining in. Again media trying to twist this to say its &quot;bad&quot;, but obviously it isn&#39;t bad.</p>\n\n<p>Another point is, crashes usually happen for a reason, its not random. You can google any of past market crash and find the exact reason it happened. None of these factors are happening right now.</p>\n\n<p>Another point is, there is a key difference between today and 2000. In 2000, the overvalued .com companies which had PE ratios of 200.... were literally worth nothing! These companies had never made a single profit! Once people realized they invested massively in a .com web site worth jackshit... they sold it obviously. They had no reason to hold their shares.</p>\n\n<p>Now check this image about Nasdaq&#39;s PE Ratios: <a href=\"https://i2.cdn.turner.com/money/dam/assets/150305131443-nasdaq-pe-780x439.jpg\">https://i2.cdn.turner.com/money/dam/assets/150305131443-nasdaq-pe-780x439.jpg</a></p>\n\n<p>Obviously, you can see the 2000&#39;s pe ratios were stupid. This graph is from 2015 when it was at 31.7. What is it today? Nasdaq PE ratio as of February 25, 2021 is 22.74!!!! LOWER THAN 2015. 10x lower than the 2000s. <a href=\"https://www.macrotrends.net/stocks/charts/NDAQ/nasdaq/pe-ratio\">https://www.macrotrends.net/stocks/charts/NDAQ/nasdaq/pe-ratio</a></p>\n\n<p>Its irrelevant if the big hedge funds remove their money from apple and want to scare you into selling your shares. Apple is a massive amazing company that is really worth a lot, and they do make tons of profits. Its not comparable in any ways to the dot com bubble. If other people are stupid and sell their shares, SO WHAT? You will just be able to buy into this amazing company for cheaper.</p>\n\n<p>So hold your shares and stop worrying about a 2000 level crash, its not happening.</p>\n\n<p>A correction? Maybe. But who cares, this just slows us down a little. Corrections are healthy and help us avoid a real crash.</p>\n</div><!-- SC_ON -->",
  "score": 2755,
  "permalink": "/r/stocks/comments/ltf3iq/i_am_bullish_about_the_future/",
  "subreddit": "stocks",
  "id": "ltf3iq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937742116
}