{
  "author": "whothefuckisjackk",
  "original_created_utc": 1636440393,
  "title": "Why is human life so valuable, when every other living thing is killed in bulk everyday ?",
  "created_utc": 1636461407,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I understand that humans are the most aware and conscious animals…\nBut still,\nWhy do we spend decades mourning over the loss of our mother or brother or friend when we take away a mother’s child everyday to slaughter and EAT.\nLike imagine if a higher being was doing that to us as humans…\nAgain I get it we’re on a different level than most animals but still, statistics show pigs are up there with the smartest of animals and you’re probably reading this as you consume a bacon cheeseburger.\nAgain, no judgment…but I need to know why humans are so much more valuable when we slaughter our fellow animals all day long?!\nI feel I’ve gone mad by thinking this</p>\n</div><!-- SC_ON -->",
  "score": 113,
  "permalink": "/r/TooAfraidToAsk/comments/qpxwhg/why_is_human_life_so_valuable_when_every_other/",
  "subreddit": "TooAfraidToAsk",
  "id": "qpxwhg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I understand that humans are the most aware and conscious animals… But still,\nWhy do we spend decades mourning over the loss of our mother or brother or\nfriend when we take away a mother’s child everyday to slaughter and EAT. Like\nimagine if a higher being was doing that to us as humans… Again I get…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "人間が最も意識の高い動物であることは理解していますが...。\n母親や兄弟、友人を失ったことを何十年もかけて嘆くのに\n毎日母親の子供を奪って屠殺して食べているのに、なぜ母親や兄弟や友人を失って何十年も嘆くのでしょうか。例えば\nもし、高次の存在が人間である私たちにそのようなことをしていたとしたら...と想像してみてください...。",
      "title": "他のすべての生物が毎日大量に殺されているのに、なぜ人間の命はそんなに貴重なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我明白，人类是最有意识的动物......但仍然。\n为什么我们要花几十年时间为失去母亲、兄弟或朋友而哀悼？\n朋友，而我们却每天把母亲的孩子拿去宰杀和食用。就像\n想象一下，如果一个更高的生命对我们人类这样做......我再次明白......",
      "title": "为什么人的生命如此宝贵，而其他所有生物每天都被大量杀害？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我明白，人類是最有意識的動物......但仍然。\n爲什麼我們要花幾十年時間爲失去母親、兄弟或朋友而哀悼？\n朋友，而我們卻每天把母親的孩子拿去宰殺和食用。就像\n想象一下，如果一個更高的生命對我們人類這樣做......我再次明白......",
      "title": "爲什麼人的生命如此寶貴，而其他所有生物每天都被大量殺害？"
    }
  ]
}