{
  "author": "autentilo",
  "original_created_utc": 1649165523,
  "title": "Accidentally gave my boyfriend head with a cold sore, how worried should we be?",
  "created_utc": 1649171535,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Yesterday morning I got elbowed in the face and my lips were really tender. By midday a painful lump started forming on my lip, but I was still chalking it up to getting elbowed. Last night, I performed unprotected oral sex on my boyfriend--just for a couple minutes, and he didn&amp;#39;t cum.&lt;/p&gt;\n\n&lt;p&gt;This morning that little bump has revealed itself to be a cold sore.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sick to my stomach that I might have just given my boyfriend genital herpes by sucking him off. How worried should I/we really be?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 117,
  "permalink": "/r/TooAfraidToAsk/comments/twv138/accidentally_gave_my_boyfriend_head_with_a_cold/",
  "subreddit": "TooAfraidToAsk",
  "id": "twv138",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "Yesterday morning I got elbowed in the face and my lips were really tender. By\nmidday a painful lump started forming on my lip, but I was still chalking it up\nto getting elbowed. Last night, I performed unprotected oral sex on my\nboyfriend--just for a couple minutes, and he didn't cum.\n\nThis…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昨日の朝、顔に肘鉄を食らい、唇がとても柔らかくなりました。そして\n昼過ぎに唇に痛々しいしこりができ始めましたが、まだそのせいにしていました。\n肘鉄を食らったから。昨夜は無防備な状態でオーラルセックスをしました。\n彼氏は数分間だけで、イクことはなかった。\n\nこれは...",
      "title": "うっかり冷え症の彼氏に頭をぶつけてしまった！どの程度心配すればいいの？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "昨天早上，我的脸被肘击了一下，嘴唇真的很嫩。到了\n中午时分，我的嘴唇上开始形成一个疼痛的肿块，但我仍然把它归咎于\n被肘击的原因。昨晚，我在没有保护措施的情况下对我的男朋友进行了口交。\n只做了几分钟，他没有射精。\n\n这...",
      "title": "不小心给我男朋友头上长了个冷疮，我们应该有多担心？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "昨天早上，我的臉被肘擊了一下，嘴脣真的很嫩。到了\n中午時分，我的嘴脣上開始形成一個疼痛的腫塊，但我仍然把它歸咎於\n被肘擊的原因。昨晚，我在沒有保護措施的情況下對我的男朋友進行了口交。\n只做了幾分鐘，他沒有射精。\n\n這...",
      "title": "不小心給我男朋友頭上長了個冷瘡，我們應該有多擔心？"
    }
  ]
}