{
  "author": "fluffkomix",
  "original_created_utc": 1646107090,
  "title": "Can you \"work out\" your intraocular (eye) muscles the same way you work out other muscles in our bodies? Is there a difference in the type of muscle or its function that would affect their exercise?",
  "created_utc": 1646141259,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve found many exercises online related to exercising your intraocular muscles, and the wording of most of these exercises seem to imply a &amp;quot;stiff&amp;quot; or &amp;quot;tight&amp;quot; muscle if you have near/farsightedness. One example being the 20/20/20 rule, of looking at something 20 feet away for 20 seconds every 20 minutes, used to train up your intraocular muscles if you&amp;#39;re staring at a screen for too long. You can experience muscle imbalance in the rest of your body from repetitious work that requires similar stretching to correct, is that what&amp;#39;s being done with your eyes?&lt;/p&gt;\n\n&lt;p&gt;My understanding is that ignoring any inherent defect (such as cataracts), your eyes&amp;#39; ability to focus is wholly dependent on these intraocular muscles. Is it possible to work them out the same way you would other muscles? Could it be approached with a similar regimen to stretching or endurance, with sets and reps, and the goal of regaining a youthful level of vision? Those attempting to become more flexible at a later age can never achieve a hyperflexible body that children can develop, are there similar age-related limitations to your eyes?&lt;/p&gt;\n\n&lt;p&gt;Basically, is there any notable difference between the intraocular muscles and the rest of your body&amp;#39;s muscles that changes how we perform our physical upkeep and is it possible to sculpt the most swole eyes this side of venice beach?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/askscience/comments/t3yp0t/can_you_work_out_your_intraocular_eye_muscles_the/",
  "subreddit": "askscience",
  "id": "t3yp0t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've found many exercises online related to exercising your intraocular muscles,\nand the wording of most of these exercises seem to imply a \"stiff\" or \"tight\"\nmuscle if you have near/farsightedness. One example being the 20/20/20 rule, of\nlooking at something 20 feet away for 20 seconds every 20…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "眼筋を鍛えることに関連したエクササイズをネット上でたくさん見かけました。\nこれらのエクササイズのほとんどは、「硬い」または「きつい」ことを意味するような表現になっています。\n近視・遠視の場合、筋肉が弱くなります。例えば、「20/20/20の法則」というのがあります。\n20フィート先のものを20秒おきに見る。",
      "title": "眼球内の筋肉は、体の他の筋肉を鍛えるのと同じように「鍛える」ことができるのでしょうか？筋肉の種類や働きに違いがあって、鍛え方が変わるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在网上找到了许多与锻炼眼内肌肉有关的练习。\n而这些练习的措辞似乎暗示着如果你有近视/远视，你的肌肉就会 \"僵硬 \"或 \"紧张\"\n如果你有近视/远视，肌肉就会 \"僵硬 \"或 \"紧张\"。其中一个例子是20/20/20规则，即\n每隔20分钟看20英尺远的东西20秒......",
      "title": "你能像锻炼我们身体的其他肌肉一样 \"锻炼 \"你的眼内（眼球）肌肉吗？肌肉的类型或其功能是否有差异，会影响其锻炼？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在網上找到了許多與鍛鍊眼內肌肉有關的練習。\n而這些練習的措辭似乎暗示着如果你有近視/遠視，你的肌肉就會 \"僵硬 \"或 \"緊張\"\n如果你有近視/遠視，肌肉就會 \"僵硬 \"或 \"緊張\"。其中一個例子是20/20/20規則，即\n每隔20分鐘看20英尺遠的東西20秒......",
      "title": "你能像鍛鍊我們身體的其他肌肉一樣 \"鍛鍊 \"你的眼內（眼球）肌肉嗎？肌肉的類型或其功能是否有差異，會影響其鍛鍊？"
    }
  ]
}