{
  "author": "fluffkomix",
  "original_created_utc": 1646107090,
  "title": "Can you \"work out\" your intraocular (eye) muscles the same way you work out other muscles in our bodies? Is there a difference in the type of muscle or its function that would affect their exercise?",
  "created_utc": 1646141259,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve found many exercises online related to exercising your intraocular muscles, and the wording of most of these exercises seem to imply a &amp;quot;stiff&amp;quot; or &amp;quot;tight&amp;quot; muscle if you have near/farsightedness. One example being the 20/20/20 rule, of looking at something 20 feet away for 20 seconds every 20 minutes, used to train up your intraocular muscles if you&amp;#39;re staring at a screen for too long. You can experience muscle imbalance in the rest of your body from repetitious work that requires similar stretching to correct, is that what&amp;#39;s being done with your eyes?&lt;/p&gt;\n\n&lt;p&gt;My understanding is that ignoring any inherent defect (such as cataracts), your eyes&amp;#39; ability to focus is wholly dependent on these intraocular muscles. Is it possible to work them out the same way you would other muscles? Could it be approached with a similar regimen to stretching or endurance, with sets and reps, and the goal of regaining a youthful level of vision? Those attempting to become more flexible at a later age can never achieve a hyperflexible body that children can develop, are there similar age-related limitations to your eyes?&lt;/p&gt;\n\n&lt;p&gt;Basically, is there any notable difference between the intraocular muscles and the rest of your body&amp;#39;s muscles that changes how we perform our physical upkeep and is it possible to sculpt the most swole eyes this side of venice beach?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/askscience/comments/t3yp0t/can_you_work_out_your_intraocular_eye_muscles_the/",
  "subreddit": "askscience",
  "id": "t3yp0t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've found many exercises online related to exercising your intraocular muscles,\nand the wording of most of these exercises seem to imply a \"stiff\" or \"tight\"\nmuscle if you have near/farsightedness. One example being the 20/20/20 rule, of\nlooking at something 20 feet away for 20 seconds every 20…"
}