{
  "author": "AirborneRodent",
  "original_created_utc": 1625158815,
  "title": "[Meta] When and why did historians start using terms like \"enslaver\" and \"colonizer\"?",
  "created_utc": 1625190216,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In the past few years I&#39;ve noticed a linguistic shift among historians, including and especially flaired users on this sub. In writeups regarding the antebellum South, the term &quot;enslaver&quot; is increasingly being used instead of &quot;slave owner&quot;, and regarding western colonialism, the term &quot;colonist&quot; is falling out of fashion in favor of &quot;colonizer&quot;. Prior to a few years ago, the only place I ever saw these two terms was in African-American literature.</p>\n\n<p>I want to stress up front that I&#39;m not criticizing or arguing with the usage. They&#39;re accurate terms; I have no problem with them. But it&#39;s interesting to me to watch a cultural &amp; linguistic shift happening in real time, and I wanted to ask about it.</p>\n\n<p>Is this happening organically as BIPOC-authored historical texts become more mainstream? Have there been discussions within circles of historians to start using these terms more often? Or is my entire premise flawed, and these terms have been in mainstream usage far longer than I realized?</p>\n</div><!-- SC_ON -->",
  "score": 112,
  "permalink": "/r/AskHistorians/comments/obq407/meta_when_and_why_did_historians_start_using/",
  "subreddit": "AskHistorians",
  "id": "obq407",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In the past few years I've noticed a linguistic shift among historians,\nincluding and especially flaired users on this sub. In writeups regarding the\nantebellum South, the term \"enslaver\" is increasingly being used instead of\n\"slave owner\", and regarding western colonialism, the term \"colonist\" is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここ数年、歴史学者の間で言語的な変化が見られるようになりました。\n特にこのサブのフレアードユーザーを含めて。前世紀南部に関する記事では\n前bellum Southに関する記述では、「slave owner」の代わりに「enslaver」という言葉が使われるようになってきています。\n\"また、西欧の植民地主義については、\"colonist \"という言葉が...",
      "title": "Meta] 歴史学者が「enslaver」や「colonizer」といった言葉を使い始めたのはいつ頃で、なぜなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在过去的几年里，我注意到历史学家的语言转变。\n包括，特别是这个子上的耀眼的用户。在写关于\n前的南方，\"奴隶主 \"一词越来越多地被使用，而不是 \"奴隶主\"。\n\"奴隶主\"，而关于西方殖民主义，\"殖民者 \"这个词被...",
      "title": "[Meta]历史学家何时以及为何开始使用 \"奴役者 \"和 \"殖民者 \"这样的术语？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在過去的幾年裏，我注意到歷史學家的語言轉變。\n包括，特別是這個子上的耀眼的用戶。在寫關於\n前的南方，\"奴隸主 \"一詞越來越多地被使用，而不是 \"奴隸主\"。\n\"奴隸主\"，而關於西方殖民主義，\"殖民者 \"這個詞被...",
      "title": "[Meta]歷史學家何時以及爲何開始使用 \"奴役者 \"和 \"殖民者 \"這樣的術語？"
    }
  ]
}