{
  "author": "UranusisGolden",
  "original_created_utc": 1628201972,
  "title": "I am a multi millionaire once again",
  "created_utc": 1628212482,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://imgur.com/a/QW3q0vb\">https://imgur.com/a/QW3q0vb</a></p>\n\n<p>I knew about bitcoin because of a magazine from IEEE talking about digital money. Basically the future of money and technologies that move us away from cash. </p>\n\n<p>In 2013 I started investing in Tesla but then after selling at a loss and learning about wash rack sales I considered bitcoin and Google. I talked to my family 3 days and chose google.</p>\n\n<p>I joined the military in 2014. And in 2017 I was in South Korea dating a local girl. In one of those dates she asked me if she should invest in bitcoin. This was around spring. I said no because the risk is too high and she owes like 15k at the time from college loans but I had savings of maybe 70k and I could run those risks. </p>\n\n<p>At the end of 2017 I reenlisted and figured as long as I am in the military I will have a barracks room or housing allowance. I will have access to a dining facility or a subsistence allowance. </p>\n\n<p>I jumped in bitcoin with a wire transfer of 35k. I called my mom and she said im insane even though I explained bitcoin in 2013. Anyway, 20 mins into that call I was already up 2k which was the salary I made monthly in the military. </p>\n\n<p>It didn&#39;t take me long that I learned about ethereum and the rest was history. I moved everything to ethereum and never looked back. I bought at 850s the first few times and up to 1400. </p>\n\n<p>Then everything crashed. I saw the potential in crypto to be a revolution. In my opinion it is either worth 0 or a full revolution. I can&#39;t put an accurate price on it but I guarantee it isn&#39;t worth 0. I doubled down. For years after the crash I have been patiently buying. I dont necessarily DCA. I save money and make buys when I consider it is appropriate. My last buy was at 2k because I considered the upside had a better chance than the downside chance. </p>\n\n<p>Last year it started to go back up and the rest has been a wild ride. We have been on a massive bull run that took me from under 200k to over 3M back to 1.3M and now 2M.</p>\n\n<p>I want you all to know that you cannot be in this space with shaky legs. Day trading is a thing but not that great when you consider fees and capital gains taxes. I do not pay any of those since I hold. I invested money after all my bills were paid and I don&#39;t owe anyone anything. So I buy hold and forget. I check the price a few times a day like everyone else. </p>\n\n<p>I don&#39;t believe in random shitcoins. I don&#39;t get distracted by the promise of other projects offering crazy returns. I think the future belongs to ETH and they have an advantage that is hard to overcome by being the first mover smart contracts chain and also better technology than anyone else.</p>\n</div><!-- SC_ON -->",
  "score": 426,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/_owxO8Y673bvE3uOVo6_Td_gUo4cQT7MhgXEht-k8EQ.jpg?auto=webp&s=4685c97e9765c01567cb7fa304c386d7dbba0292",
          "width": 1080,
          "height": 1720
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/_owxO8Y673bvE3uOVo6_Td_gUo4cQT7MhgXEht-k8EQ.jpg?width=108&crop=smart&auto=webp&s=9f4334fdbf7a31277b2849c437ea160ffd5742b3",
            "width": 108,
            "height": 172
          },
          {
            "url": "https://external-preview.redd.it/_owxO8Y673bvE3uOVo6_Td_gUo4cQT7MhgXEht-k8EQ.jpg?width=216&crop=smart&auto=webp&s=92b2a14d31248bc5268989352f1c9b959534778e",
            "width": 216,
            "height": 344
          },
          {
            "url": "https://external-preview.redd.it/_owxO8Y673bvE3uOVo6_Td_gUo4cQT7MhgXEht-k8EQ.jpg?width=320&crop=smart&auto=webp&s=975061e46a480a275d8f4f0adc414b6e8597655b",
            "width": 320,
            "height": 509
          },
          {
            "url": "https://external-preview.redd.it/_owxO8Y673bvE3uOVo6_Td_gUo4cQT7MhgXEht-k8EQ.jpg?width=640&crop=smart&auto=webp&s=e18e94199aa630a41aacd76ade98640e8f013c64",
            "width": 640,
            "height": 1019
          },
          {
            "url": "https://external-preview.redd.it/_owxO8Y673bvE3uOVo6_Td_gUo4cQT7MhgXEht-k8EQ.jpg?width=960&crop=smart&auto=webp&s=b906ce268be6c68888add34c5807742238cf819d",
            "width": 960,
            "height": 1528
          },
          {
            "url": "https://external-preview.redd.it/_owxO8Y673bvE3uOVo6_Td_gUo4cQT7MhgXEht-k8EQ.jpg?width=1080&crop=smart&auto=webp&s=46921e4cfa230b5a19e64da12ebd05709e80a791",
            "width": 1080,
            "height": 1720
          }
        ],
        "variants": {},
        "id": "orvVLywk5iJ43GFUcXg_FRsNhppRohtbj02qtA7CS9Q"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/oyta07/i_am_a_multi_millionaire_once_again/",
  "subreddit": "CryptoCurrency",
  "id": "oyta07",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "https://imgur.com/a/QW3q0vb\n\nI knew about bitcoin because of a magazine from IEEE talking about digital\nmoney. Basically the future of money and technologies that move us away from\ncash.\n\nIn 2013 I started investing in Tesla but then after selling at a loss and\nlearning about wash rack sales I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "https://imgur.com/a/QW3q0vb\n\nビットコインを知ったのは、IEEEの雑誌でデジタルマネーの話をしていたからです。\nマネーについて語っていたからです。基本的には、お金の未来と、現金から離れるための技術です。\n現金から離れる技術のことです。\n\n2013年、私はテスラに投資を始めましたが、その後、損失を出して売却したことや\nウォッシュラックセールのことを知って...",
      "title": "私は再びマルチミリオネアになった"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "https://imgur.com/a/QW3q0vb\n\n我知道比特币是因为IEEE的一本杂志谈到了数字货币。\n货币。基本上是货币的未来和使我们远离现金的技术。\n现金。\n\n在2013年，我开始投资特斯拉，但在亏损卖出后，了解到洗车机的销售情况后，我开始投资特斯拉。\n了解到洗车架销售后，我...",
      "title": "我又一次成为了百万富翁"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "https://imgur.com/a/QW3q0vb\n\n我知道比特幣是因爲IEEE的一本雜誌談到了數字貨幣。\n貨幣。基本上是貨幣的未來和使我們遠離現金的技術。\n現金。\n\n在2013年，我開始投資特斯拉，但在虧損賣出後，瞭解到洗車機的銷售情況後，我開始投資特斯拉。\n瞭解到洗車架銷售後，我...",
      "title": "我又一次成爲了百萬富翁"
    }
  ]
}