{
  "author": "mxsfitss",
  "the_new_excerpt": "Specifically subsaharan African countries. I'm aware that during the 17-1800's\n(I think) there were a lot of power struggles between European countries over\nwho could colonise what area in Africa. North Africa probably has a larger white\npopulation I'm assuming partly because it is quite close to…",
  "original_created_utc": 1622905278,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "特にサブサハラ・アフリカ諸国です。私は、17〜1800年代（だったと思う）に、ヨーロッパ諸国の間で\nアフリカのどの地域を誰が植民地にするかを巡って、ヨーロッパ諸国の間で権力闘争が繰り広げられたことは知っています。\n誰がアフリカのどの地域を植民地にするかで、ヨーロッパの国々の間で権力争いがあったことを知っています。北アフリカは、おそらく白人の人口が多いと思います。\n北アフリカは白人の人口が多いと思いますが、それは北アフリカに非常に近いからではないでしょうか。",
      "title": "なぜ南アフリカはアフリカで唯一、白人が多く住む国なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "特别是撒哈拉以南的非洲国家。我知道，在17-1800年期间\n我想）欧洲国家之间有很多权力斗争，争夺谁能在非洲的哪个地区进行殖民统治。\n谁能在非洲的哪个地区进行殖民统治。北非可能有更多的白人\n我假设部分原因是它非常接近......",
      "title": "为什么南非是唯一拥有大量白人人口的非洲国家？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "特別是撒哈拉以南的非洲國家。我知道，在17-1800年期間\n我想）歐洲國家之間有很多權力鬥爭，爭奪誰能在非洲的哪個地區進行殖民統治。\n誰能在非洲的哪個地區進行殖民統治。北非可能有更多的白人\n我假設部分原因是它非常接近......",
      "title": "爲什麼南非是唯一擁有大量白人人口的非洲國家？"
    }
  ],
  "title": "Why is South Africa the only African country with a large white population?",
  "created_utc": 1622950598,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Specifically subsaharan African countries. I&#39;m aware that during the 17-1800&#39;s (I think) there were a lot of power struggles between European countries over who could colonise what area in Africa. North Africa probably has a larger white population I&#39;m assuming partly because it is quite close to Europe, but the only other country I know of is South Africa. Why is this when almost every other country was also colonised to some degree?</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/nsxmcf/why_is_south_africa_the_only_african_country_with/",
  "subreddit": "AskHistorians",
  "id": "nsxmcf",
  "is_self": true,
  "media": null,
  "is_video": false
}