{
  "author": "misium500",
  "the_new_excerpt": "This one is very theoretical. If you don't know what Im talking about please\nresearch this or reread this.\n\nOkay, we know the heavily shorted stock mentioned came off the Threshold list on\nFeb 3rd. That means they covered almost all of their FTD's (faild to deliver).\nMany of these were bought in the…",
  "original_created_utc": 1613476030,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这个是非常理论化的。如果你不知道我在说什么请\n研究这个或重读这个。\n\n好吧，我们知道，所提到的重仓股从门槛列表中脱颖而出，在\n2月3日。这意味着他们几乎覆盖了所有的FTD(未能交货)。\n其中很多都是买在...",
      "title": "玩市场Fvckery... ... 第3页......玩ETF的游戏，为eee eemeeeee"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個是非常理論化的。如果你不知道我在說什麼請\n研究這個或重讀這個。\n\n好吧，我們知道，所提到的重倉股從門檻列表中脫穎而出，在\n2月3日。這意味着他們幾乎覆蓋了所有的FTD(未能交貨)。\n其中很多都是買在...",
      "title": "玩市場Fvckery... ... 第3頁......玩ETF的遊戲，爲eee eemeeeee"
    }
  ],
  "title": "Playing The Market Fvckery... Pt. 3... playing the etf game for gee eeemeeeeeee",
  "created_utc": 1613493044,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This one is very theoretical. If you don&#39;t know what Im talking about please research this or reread this.</p>\n\n<p>Okay, we know the heavily shorted stock mentioned came off the Threshold list on Feb 3rd. That means they covered almost all of their FTD&#39;s (faild to deliver). Many of these were bought in the open market at high prices, however many people have speculated that it doesn&#39;t seem to be enough. The market Volume was very low and the sellers to buyers ratio was also very low. could that be enough? They were on the threshold list for 39 days straight and they covered it all in just a few days? Maybe. But what if it wasn&#39;t enough? Where did they get the rest of the shares they needed? Remember, if they don&#39;t deliver in 13 days after the 3 day settlement period is up, then they lose the right to short sell forever. That is why they have to buy at the higher prices and that is the main reason, along with the hype, that the stock price spiked. </p>\n\n<p>Now lets introduce another player into the game called the etfs.  There are several ETF&#39;s that have the geemee stock as part of their portfolio. I have only looked at one. you can  check out the other ones  too. Apparently there are 79 ETF&#39;s which hold the stock.  I checked out ex are tee. Their chart looks very similar to the chart of  the stock mentioned And it is one of their main stocks that make up part of their fund. Maybe Coincidence? </p>\n\n<p>Now, the etf went ON the threshold list on January  29th and has remained there to this very day! IT did not appear on the securities threshold list a single day this year before jan 29th That is the same day that the the short sellers supposedly covered most of their short positions and the geemee spike started to drop as well as about the same time the brokers stopped letting people trade!  This etf currently sits at 190% short float. Peaking on 2/1 at over 800% short float!  As of 11feb2021, they also only hold 454,595 shares(3.36% of the fund) of the mentiopned stock, coming down from a high of roughly 19%.</p>\n\n<p><a href=\"https://preview.redd.it/fcfu9kpisth61.png?width=647&amp;format=png&amp;auto=webp&amp;s=f5484039e4707243d234da8a633f8f5c3af844e1\">outstanding shares of the etf</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/b6aalo74sth61.png?width=354&amp;format=png&amp;auto=webp&amp;s=98c590c3113485e44c1839fe748be0918f582c17\">Shares shorted of the etf</a></p>\n\n<p>There is a possibility that  the ETF&#39;s that had shares of geemeee were used to cover the failed short positions so that it would come off the threshold list. This would create the image that the opportunity is over, however then  the ETF&#39;s involved would be now in the exact same position that the stock was in just before the spike. This would  just move the crisis from one place to another. </p>\n\n<p>This procedure can be mainly done by naked shorting the stock.  If a manager wants to short a single stock, but they don&#39;t want to go to the extent of borrowing and disclosing the short, they would short an ETF that holds the stock, and simultaneously buy long the underlying holdings that they don&#39;t want to short. This Naked shorting ETFs is generally acceptable due to arbitrage, but if one goes long on the remainder of the holdings (not many in the mentioned etf), one can naked short the stock without doing any arbitrage on the ETF. This, when coupled with synthetic longs via options, gives the appearance of shorts covering when they haven&#39;t, takes the heavily shorted stock off the threshold security list when it shouldn&#39;t be, and provides the ability to naked short the stock again.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/hrg8gx2lrth61.png?width=691&amp;format=png&amp;auto=webp&amp;s=01cba928637efebe0e584c2796ea04e46bd52056\">Comparison of the ETF short positions and the underlying stock</a></p>\n\n<p>This is a likely scenario how geemeee could actually be shorted without appearing so. This solves the NYSE threshold securities issue and the ability to drive the stock down outside of buying puts. Theres list of etfs holding this stock. They can all be used in the same way. Thats a theory right now. All figures indicated that the % of shorts went down without any real price movement that should have reflected this. This would be the explanation.</p>\n\n<p>For all the retards rubbing their hands now: It&#39;s very unlikely to squeeze an ETF because managers will just buy more shares of the underlying and issue more shares of the ETF. They don&#39;t need shareholder approval or prior announcement to issue new shares as do single companies. And other banks and funds can buy shares of the underlying and create more shares of the ETF themselves as APs. </p>\n\n<p>I am not a professional.. I am not advocating any action on the part of anyone else when it comes to buying, selling, or holding stocks. I didn&#39;t mention any ticker. You should also not mention any ticker in the comments. You are responsible for your own actions in the stock market. </p>\n\n<p>Let&#39;s see what will happen in part 4.</p>\n</div><!-- SC_ON -->",
  "score": 2225,
  "permalink": "/r/wallstreetbets/comments/ll26ij/playing_the_market_fvckery_pt_3_playing_the_etf/",
  "subreddit": "wallstreetbets",
  "id": "ll26ij",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728635225
}