{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "Buckle in.\n\nInvesting isn't easy, and yet people are--and always will--try to act like it is. Just like every other period in stock market history, retail 'investors' are being lazy and emotional and valuing businesses based off the direction their prices are heading rather than long term fundamentals. Volatility is the price you pay for performance. Thinking it's time to sell tech and buy Kellogg, with corporate profits RISING, will get you into deep trouble. \n\nNo, being a good investor has absolutely nothing to do with being 'contrarian'. It just so happens that retail is too lazy and emotional to notice that prices tend to head fake away from where people should be buying at any given timeframe. Sometimes these head fakes point to different asset classes, other times to different assets within any given class. \n\nRight now, it's both. \n\nPeople think tech is in 2001 territory strictly because of price action, when we are in literally the opposite place outside a handful of overvalued and overhyped names; and people think bond yields are becoming attractive, when bonds are in the worst bear market in years (though this could change at any time considering the overreaction we've seen in Fed rate predictions). **This is precisely when you should be buying reasonably priced tech with strong cash flows, pricing power, quality earnings growth, barriers to entry (either a difficult industry to break into or an outright moat, which is very rare and hard to predict but** ***Facebook has one*****), network effects, and demand inelasticity.** Your stocks don't have to have all of these elements, but the more, the merrier. \n\n**\\*\\*\\***\n\n**Here's some oversimplified but VERY true deductive reasoning that 99% of 'investors' fail to heed:**\n\n\\-Companies with higher earnings growth deserve higher valuations  \n\\-Companies with better pricing power deserve higher valuations  \n\\-Companies with higher quality earnings growth deserve higher valuations  \n\\-Netflix and Facebook are still growth companies, their earnings quality is only improving, and they have IMMENSE pricing power that they've only begun to tap into  \n\\-Proctor &amp; Gamble has a 40% higher relative valuation than Netflix  \n\\-CAMPBELL'S SOUP has a higher valuation than Facebook  \n\\-So-called 'investors' firmly believe that staples are the place to be right now, because 'interest rates' and 'inflation'. \n\n**Okay...**\n\n\\-Corporate profits drive stock prices--literally in lock step--over the long run  \n\\-Inflation is good for corporate profits  \n\\-Inflation requires higher interest rates  \n\\-Higher interest rates are a headwind for stocks  \n\\-Higher interest rates ARE A LITERAL CATASTROPHE FOR BONDS  \n\\-Holding cash *is basically taking a financial gun and pointing it at your face and pulling the trigger*  \n\\-The answer is to own quality assets, which are companies with strong cash flows, moats, network effects, etc.\n\n**Millions of retail investors are absolutely convinced that tech is overvalued--but it's not because of poor fundamentals. Honestly, it's not even because of inflation, interested rates, or Ukraine. It's simply because prices are going down.** Do yourself a favor. Look at sentiment from one year ago today. Facebook to $600 was a done deal. Netflix was overpriced, and I wouldn't have bought it at near $700, but if anyone thought we would be below $230, we'd be minting new billionaires by the second because of their OTM puts. Amazon is more underpriced than I've maybe ever seen based off what we can easily see (the market has never understood Amazon, and AWS ALONE is clearly a multitrillion dollar valuation by 2030). \n\n**FACTS:**\n\n\\-**Amazon** PE is lowest ever while its future core businesses--AWS and ads (they are doing more ad revenue than YOUTUBE now, and AWS brings in more profit than any business line now, so if you think Amazon is a retail business you should be buying index funds...)--are growing at 40% or more.   \n\\-**Facebook** PE is lowest ever--last time this happened was three years ago, their stock price crashed to $131, and with this incredible overreaction they're STILL up 54% since then.   \n\\-And now to my favorite part: **Netflix** is at its lowest valuation since the 2000s and perhaps ever--who cares before then, it wasn't Netflix, it was a frickin' mail-order DVD company. Its PEG is .84. Its earnings have plateaued on SEVERAL occasions only to leap, over and over again. Just like Facebook, they were bound to hit a plateau for their core use base at some point. But if you think that means they're done growing out earnings--not to mention expanding other business lines, like Amazon did with AWS and ads, and Microsoft did with Azure--you need to ask yourself whether you have enough knowledge and experience here. \n\nIn a way, investing really isn't that hard. **You just have to actually buy businesses and not obsess over the value of your portfolio every day**. If you do that, you're smart enough to see that tech could fall another 30% right now--and it would only present an even better buying opportunity with even more upside. As Buffett said after 2008, he might've been early, but he still got rich. And trust me, buying now might be early, but it will be INSANELY lucrative. \n\nSO SO SO many companies are just dirt cheap. People think DropBox is a shitty cloud business, when its top line is growing double digits and they're priced like Campbell's f'kn Soup. People think GoPro is a shitty camera business when it has begun adding software with INCREDIBLE margins and is growing rapidly again. Upstart is literally the only company in the market with the triple crown--triple digit growth, massively profitable, and BUYING BACK STOCK--yet its price was cut by 80%. There are just so many tech companies getting caught up in this indiscriminate selling, as if they're DoorDash or Rivian or Nikola or Snowflake, or any of the incredibly overpriced businesses, good or bad, that deserved to be cut in half.  \n\nPeople calling this tech bubble 2.0 are either too young to understand what the tech bubble was, or too stupid to understand what it was. This is the literal opposite of the tech bubble. We have companies with tens of billions in FCF being repriced as if they're going out of business. Earnings are GROWING. We are in a BOOM cycle--IN TECH. You are being fooled--AGAIN. During the tech bubble, it's not that companies weren't making money...**THEY WEREN'T EVEN BRINGING IN REVENUE. DO YOU UNDERSTAND THE DIFFERENCE?** Not even the most overvalued companies today (aside from Rivian and Nikola) can attest to such an atrocity. \n\nI pity the people who need to see instant green in their portfolios, and I hope to see your sea of !Remind Me! posts for five to ten years from now. **For those of you who take anything away from this post, here's putting my money where my mouth is:**\n\nHere's my portfolio weighted by notional impact--i.e. ITM calls carry more leverage despite moving the same amount as 100 shares of a stock, or ATM short puts I've written to buy at a lower cost basis or just hold the premium. (**I plan on opening a Netflix position at some point soon.**)\n\n**$UPST:** **16.9%** (Pretty much the perfect stock: AI lending company that's barely unaffected by rates and loan origination volume; already profitable by a mile; reinvesting capital into massive TAMs; and already has permission from the board to buy back stock. Hope you don't judge a stock by its PE because that's how you miss pretty much every single winner, from Amazon to Salesforce to Netflix.)  \n**$CIM:** **7.7%** (Retracing like a tech stock right now with fortress balance sheet and 12% dividend yield--and climbing. Chimera did even better following the pandemic after cutting its dividend yield, which made for the perfect time to buy.)  \n**$OSTK:** **7.54%** (Retail furniture business that's stealing market share from Wayfair and growing rapidly yet with a stock price selling as if it's going out of business--oh yeah, and they've got Medici Ventures, which is priced at zero.)  \n**$Z: 6.56%** (Vertically integrated media business of which people seem to have zero understanding. It's literally in the best shape it's ever been: shed of its worst business segment and raising capital from home inventory; growing at over 20%; and selling at a 75%+ discount...yet people hate it infinitely more than when it was up near $200...LOL)  \n**$AMZN: 5.97%** (Enough said above. This is a multitrillion dollar business that checks every box listed above selling at less than half its true value.)   \n**$APPS:** **5.25%** (Growing triple digits, profitable, and with insane barriers to entry--not quite Upstart, but this is a 5x play.)  \n**$URI:** **5.12%** (Picks and shovels play for infrastructure boom ahead. Someone will pass a version of build back better, and this company is a gem even without government subsidy. Also, United Rentals helps balance out my insanely tech-weighted portfolio just a tad bit, though that's not at all why I bought it--because I could care less how much money I lose in the short term to maximize long term gains.)  \n**$FB:** **5.2%** (The greatest network company of all time--a company whose business model will never be repeated--is trading at a multiple 7% lower than the Campbell f'kin Soup Company. Enough said.)  \n**$CLSK:** **4.71%** (One of the fastest growing companies in the world; already profitable; ESG sustainable Bitcoin miner; QUADRUPLE DIGIT GROWTH on the top line; trading at a SINGLE DIGIT forward PE--crashing as if both they and Bitcoin are going to zero.)  \n**$STNE:** **4.37%** (A big boo-boo in their long book and concerns about the Brazilian economy are apparently enough to crash the stock over 90%. Like several other stocks on this list, earnings give a HUGE temporary boost because of how incredibly strong they are, only to watch the gains wither away because of indiscriminate selling in the tech space.)  \n**$AMAT: 3.14%** (Picks and shovels play for the semiconductor bull market that will last for decades to come. Probably the only company on this list that I'd call fairly valued, but it's such a great company it's worth every penny.)  \n**$PLTR: 3.09%** (It's apparently fun to hate Palantir because it was a meme stock. But if you can do math, 30% compound interest for 10 years does not a meme stock make. Probably the only stock on this list that I might even call *over*priced, but I also think it's worth every penny with a smaller position.)  \n**$AMD: 2.97%** (Trading as if China is going to invade, tear down TSM, collapse the market for chips, and send interest rates to 50%. Beyond idiotically cheap.)  \n**$MU: 2.85%** (Micron's pricing power is unmatched in this industry. Very few companies do what they do and none do it as well--and they're trading for pennies on the dollar.)  \n**$DBX: 2.66%** (Apparently it's cool to hate Drew Houston? I don't know, but in addition to what was mentioned above, this company is set to buy back half it's MFing float. Like, are you kidding me?)  \n**$NVDA: 2.61%** (Only reason I don't have a bigger allocation is because NVIDIA puts my total semi allocation at around 9%. I also owned Intel for a hot second before I rolled it into other plays. Think The whole space is going to continue to skyrocket, but no one has the creativity or talent that NVIDIA does.)  \n**$BNTX: 2.6%** (The market thinks that this company stumbled upon vaccines, that covid is ending tomorrow, and that they have no other pipeline. The reality is that BioNTech is set to sell billions more in vaccines for a long time coming, and all of this is an incredibly massive tailwind to their rare diseases pipeline.)  \n**$WBD: 2.22%** (It's always funny when some jackoff at BoA comes out with a report about how the merger between Discovery and Warner Brothers will create synergies that make this a $45 stock--6 months after the deal is announced. The stock rocketed above $30, then was indiscriminately sold off back to where it started--for no reason. The market is so efficient.)  \n**$GPRO: 2.2%** (As mentioned above, this has become a software company with total control over its market and prices. 96% of action cameras in America are GoPros. The recurring revenue on that software makes this at least a $30 stock. But nobody wants to own it because RemEmBEr tHat TiME WheN iT SolD OfF?)  \n**$NOK: 2.1%** (5G is them and some other guy. Enough said.)  \n**$CRM: 1.81%** (This company does not stop growing. One of the best companies in the world and there is no end in sight. Personally think the Slack purchase is being totally swept under the rug. It's just that time of the cycle when you're supposed to doubt Benioff.)  \n**$NLST: 1.33%** (Very unknown memory company with massive lawsuits against a bevy of huge companies and great prospects outside those lawsuits. They settled the lawsuit with SK Hynix and still have pending cases for patent infringement against the likes of Samsung, Micron, and Google--all of which are entirely legitimate.)  \n**$AMRS: 0.8%** (A deep future play for molecules-as-a-function. This one is very nuanced and I'm getting tired of writing. You'd have to look into this one yourself to truly understand the importance of synthetic, sustainable molecules used in the place of limited and/or endangered organics at far cheaper prices across the cost spectrum.)  \n**$SFT: 0.29%** (Kind of a random little lottery bet on a company with a market cap lower than its fourth quarter revenue alone. But with no path to profitability in sight, that's all it is: a lottery ticket with a VERY small amount of AUM allocated.) \n\n*It's not possible to create a perfect weighting with options in your portfolio, especially short puts, but I've done the best I can. For example, notionally, I could be tied to even more* ***Upstart*** *than I've represented here. But Upstart would have to be ITM across three separate strikes (70, 80, and 100) by January 2023, which nobody can predict. (What I can say is that anything under $100 is DIRT cheap for Upstart, so I'm more than happy to own it at about $51, $55, and $66, which would be the breakeven prices at each strike, respectively, when including the outrageous premium I was paid for writing these puts.) I split the notional values of being assigned each put in half to represent the fact that Upstart is currently ITM for my 100 puts, ATM for the 80, and OTM for 70. Arbitrary, but so is anything in this case, even if you'd use Black Scholes somehow.*",
  "author_fullname": "t2_j5bj5l5j",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Tech Stocks Are Absurdly Cheap Now: putting my money where my mouth is",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_u8fb6r",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.67,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 881,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 881,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1650515580,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Buckle in.&lt;/p&gt;\n\n&lt;p&gt;Investing isn&amp;#39;t easy, and yet people are--and always will--try to act like it is. Just like every other period in stock market history, retail &amp;#39;investors&amp;#39; are being lazy and emotional and valuing businesses based off the direction their prices are heading rather than long term fundamentals. Volatility is the price you pay for performance. Thinking it&amp;#39;s time to sell tech and buy Kellogg, with corporate profits RISING, will get you into deep trouble. &lt;/p&gt;\n\n&lt;p&gt;No, being a good investor has absolutely nothing to do with being &amp;#39;contrarian&amp;#39;. It just so happens that retail is too lazy and emotional to notice that prices tend to head fake away from where people should be buying at any given timeframe. Sometimes these head fakes point to different asset classes, other times to different assets within any given class. &lt;/p&gt;\n\n&lt;p&gt;Right now, it&amp;#39;s both. &lt;/p&gt;\n\n&lt;p&gt;People think tech is in 2001 territory strictly because of price action, when we are in literally the opposite place outside a handful of overvalued and overhyped names; and people think bond yields are becoming attractive, when bonds are in the worst bear market in years (though this could change at any time considering the overreaction we&amp;#39;ve seen in Fed rate predictions). &lt;strong&gt;This is precisely when you should be buying reasonably priced tech with strong cash flows, pricing power, quality earnings growth, barriers to entry (either a difficult industry to break into or an outright moat, which is very rare and hard to predict but&lt;/strong&gt; &lt;strong&gt;&lt;em&gt;Facebook has one&lt;/em&gt;&lt;/strong&gt;&lt;strong&gt;), network effects, and demand inelasticity.&lt;/strong&gt; Your stocks don&amp;#39;t have to have all of these elements, but the more, the merrier. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;**\\&lt;/strong&gt;*&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Here&amp;#39;s some oversimplified but VERY true deductive reasoning that 99% of &amp;#39;investors&amp;#39; fail to heed:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;-Companies with higher earnings growth deserve higher valuations&lt;br/&gt;\n-Companies with better pricing power deserve higher valuations&lt;br/&gt;\n-Companies with higher quality earnings growth deserve higher valuations&lt;br/&gt;\n-Netflix and Facebook are still growth companies, their earnings quality is only improving, and they have IMMENSE pricing power that they&amp;#39;ve only begun to tap into&lt;br/&gt;\n-Proctor &amp;amp; Gamble has a 40% higher relative valuation than Netflix&lt;br/&gt;\n-CAMPBELL&amp;#39;S SOUP has a higher valuation than Facebook&lt;br/&gt;\n-So-called &amp;#39;investors&amp;#39; firmly believe that staples are the place to be right now, because &amp;#39;interest rates&amp;#39; and &amp;#39;inflation&amp;#39;. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Okay...&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;-Corporate profits drive stock prices--literally in lock step--over the long run&lt;br/&gt;\n-Inflation is good for corporate profits&lt;br/&gt;\n-Inflation requires higher interest rates&lt;br/&gt;\n-Higher interest rates are a headwind for stocks&lt;br/&gt;\n-Higher interest rates ARE A LITERAL CATASTROPHE FOR BONDS&lt;br/&gt;\n-Holding cash &lt;em&gt;is basically taking a financial gun and pointing it at your face and pulling the trigger&lt;/em&gt;&lt;br/&gt;\n-The answer is to own quality assets, which are companies with strong cash flows, moats, network effects, etc.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Millions of retail investors are absolutely convinced that tech is overvalued--but it&amp;#39;s not because of poor fundamentals. Honestly, it&amp;#39;s not even because of inflation, interested rates, or Ukraine. It&amp;#39;s simply because prices are going down.&lt;/strong&gt; Do yourself a favor. Look at sentiment from one year ago today. Facebook to $600 was a done deal. Netflix was overpriced, and I wouldn&amp;#39;t have bought it at near $700, but if anyone thought we would be below $230, we&amp;#39;d be minting new billionaires by the second because of their OTM puts. Amazon is more underpriced than I&amp;#39;ve maybe ever seen based off what we can easily see (the market has never understood Amazon, and AWS ALONE is clearly a multitrillion dollar valuation by 2030). &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;FACTS:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;-&lt;strong&gt;Amazon&lt;/strong&gt; PE is lowest ever while its future core businesses--AWS and ads (they are doing more ad revenue than YOUTUBE now, and AWS brings in more profit than any business line now, so if you think Amazon is a retail business you should be buying index funds...)--are growing at 40% or more.&lt;br/&gt;\n-&lt;strong&gt;Facebook&lt;/strong&gt; PE is lowest ever--last time this happened was three years ago, their stock price crashed to $131, and with this incredible overreaction they&amp;#39;re STILL up 54% since then.&lt;br/&gt;\n-And now to my favorite part: &lt;strong&gt;Netflix&lt;/strong&gt; is at its lowest valuation since the 2000s and perhaps ever--who cares before then, it wasn&amp;#39;t Netflix, it was a frickin&amp;#39; mail-order DVD company. Its PEG is .84. Its earnings have plateaued on SEVERAL occasions only to leap, over and over again. Just like Facebook, they were bound to hit a plateau for their core use base at some point. But if you think that means they&amp;#39;re done growing out earnings--not to mention expanding other business lines, like Amazon did with AWS and ads, and Microsoft did with Azure--you need to ask yourself whether you have enough knowledge and experience here. &lt;/p&gt;\n\n&lt;p&gt;In a way, investing really isn&amp;#39;t that hard. &lt;strong&gt;You just have to actually buy businesses and not obsess over the value of your portfolio every day&lt;/strong&gt;. If you do that, you&amp;#39;re smart enough to see that tech could fall another 30% right now--and it would only present an even better buying opportunity with even more upside. As Buffett said after 2008, he might&amp;#39;ve been early, but he still got rich. And trust me, buying now might be early, but it will be INSANELY lucrative. &lt;/p&gt;\n\n&lt;p&gt;SO SO SO many companies are just dirt cheap. People think DropBox is a shitty cloud business, when its top line is growing double digits and they&amp;#39;re priced like Campbell&amp;#39;s f&amp;#39;kn Soup. People think GoPro is a shitty camera business when it has begun adding software with INCREDIBLE margins and is growing rapidly again. Upstart is literally the only company in the market with the triple crown--triple digit growth, massively profitable, and BUYING BACK STOCK--yet its price was cut by 80%. There are just so many tech companies getting caught up in this indiscriminate selling, as if they&amp;#39;re DoorDash or Rivian or Nikola or Snowflake, or any of the incredibly overpriced businesses, good or bad, that deserved to be cut in half.  &lt;/p&gt;\n\n&lt;p&gt;People calling this tech bubble 2.0 are either too young to understand what the tech bubble was, or too stupid to understand what it was. This is the literal opposite of the tech bubble. We have companies with tens of billions in FCF being repriced as if they&amp;#39;re going out of business. Earnings are GROWING. We are in a BOOM cycle--IN TECH. You are being fooled--AGAIN. During the tech bubble, it&amp;#39;s not that companies weren&amp;#39;t making money...&lt;strong&gt;THEY WEREN&amp;#39;T EVEN BRINGING IN REVENUE. DO YOU UNDERSTAND THE DIFFERENCE?&lt;/strong&gt; Not even the most overvalued companies today (aside from Rivian and Nikola) can attest to such an atrocity. &lt;/p&gt;\n\n&lt;p&gt;I pity the people who need to see instant green in their portfolios, and I hope to see your sea of !Remind Me! posts for five to ten years from now. &lt;strong&gt;For those of you who take anything away from this post, here&amp;#39;s putting my money where my mouth is:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s my portfolio weighted by notional impact--i.e. ITM calls carry more leverage despite moving the same amount as 100 shares of a stock, or ATM short puts I&amp;#39;ve written to buy at a lower cost basis or just hold the premium. (&lt;strong&gt;I plan on opening a Netflix position at some point soon.&lt;/strong&gt;)&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;$UPST:&lt;/strong&gt; &lt;strong&gt;16.9%&lt;/strong&gt; (Pretty much the perfect stock: AI lending company that&amp;#39;s barely unaffected by rates and loan origination volume; already profitable by a mile; reinvesting capital into massive TAMs; and already has permission from the board to buy back stock. Hope you don&amp;#39;t judge a stock by its PE because that&amp;#39;s how you miss pretty much every single winner, from Amazon to Salesforce to Netflix.)&lt;br/&gt;\n&lt;strong&gt;$CIM:&lt;/strong&gt; &lt;strong&gt;7.7%&lt;/strong&gt; (Retracing like a tech stock right now with fortress balance sheet and 12% dividend yield--and climbing. Chimera did even better following the pandemic after cutting its dividend yield, which made for the perfect time to buy.)&lt;br/&gt;\n&lt;strong&gt;$OSTK:&lt;/strong&gt; &lt;strong&gt;7.54%&lt;/strong&gt; (Retail furniture business that&amp;#39;s stealing market share from Wayfair and growing rapidly yet with a stock price selling as if it&amp;#39;s going out of business--oh yeah, and they&amp;#39;ve got Medici Ventures, which is priced at zero.)&lt;br/&gt;\n&lt;strong&gt;$Z: 6.56%&lt;/strong&gt; (Vertically integrated media business of which people seem to have zero understanding. It&amp;#39;s literally in the best shape it&amp;#39;s ever been: shed of its worst business segment and raising capital from home inventory; growing at over 20%; and selling at a 75%+ discount...yet people hate it infinitely more than when it was up near $200...LOL)&lt;br/&gt;\n&lt;strong&gt;$AMZN: 5.97%&lt;/strong&gt; (Enough said above. This is a multitrillion dollar business that checks every box listed above selling at less than half its true value.)&lt;br/&gt;\n&lt;strong&gt;$APPS:&lt;/strong&gt; &lt;strong&gt;5.25%&lt;/strong&gt; (Growing triple digits, profitable, and with insane barriers to entry--not quite Upstart, but this is a 5x play.)&lt;br/&gt;\n&lt;strong&gt;$URI:&lt;/strong&gt; &lt;strong&gt;5.12%&lt;/strong&gt; (Picks and shovels play for infrastructure boom ahead. Someone will pass a version of build back better, and this company is a gem even without government subsidy. Also, United Rentals helps balance out my insanely tech-weighted portfolio just a tad bit, though that&amp;#39;s not at all why I bought it--because I could care less how much money I lose in the short term to maximize long term gains.)&lt;br/&gt;\n&lt;strong&gt;$FB:&lt;/strong&gt; &lt;strong&gt;5.2%&lt;/strong&gt; (The greatest network company of all time--a company whose business model will never be repeated--is trading at a multiple 7% lower than the Campbell f&amp;#39;kin Soup Company. Enough said.)&lt;br/&gt;\n&lt;strong&gt;$CLSK:&lt;/strong&gt; &lt;strong&gt;4.71%&lt;/strong&gt; (One of the fastest growing companies in the world; already profitable; ESG sustainable Bitcoin miner; QUADRUPLE DIGIT GROWTH on the top line; trading at a SINGLE DIGIT forward PE--crashing as if both they and Bitcoin are going to zero.)&lt;br/&gt;\n&lt;strong&gt;$STNE:&lt;/strong&gt; &lt;strong&gt;4.37%&lt;/strong&gt; (A big boo-boo in their long book and concerns about the Brazilian economy are apparently enough to crash the stock over 90%. Like several other stocks on this list, earnings give a HUGE temporary boost because of how incredibly strong they are, only to watch the gains wither away because of indiscriminate selling in the tech space.)&lt;br/&gt;\n&lt;strong&gt;$AMAT: 3.14%&lt;/strong&gt; (Picks and shovels play for the semiconductor bull market that will last for decades to come. Probably the only company on this list that I&amp;#39;d call fairly valued, but it&amp;#39;s such a great company it&amp;#39;s worth every penny.)&lt;br/&gt;\n&lt;strong&gt;$PLTR: 3.09%&lt;/strong&gt; (It&amp;#39;s apparently fun to hate Palantir because it was a meme stock. But if you can do math, 30% compound interest for 10 years does not a meme stock make. Probably the only stock on this list that I might even call &lt;em&gt;over&lt;/em&gt;priced, but I also think it&amp;#39;s worth every penny with a smaller position.)&lt;br/&gt;\n&lt;strong&gt;$AMD: 2.97%&lt;/strong&gt; (Trading as if China is going to invade, tear down TSM, collapse the market for chips, and send interest rates to 50%. Beyond idiotically cheap.)&lt;br/&gt;\n&lt;strong&gt;$MU: 2.85%&lt;/strong&gt; (Micron&amp;#39;s pricing power is unmatched in this industry. Very few companies do what they do and none do it as well--and they&amp;#39;re trading for pennies on the dollar.)&lt;br/&gt;\n&lt;strong&gt;$DBX: 2.66%&lt;/strong&gt; (Apparently it&amp;#39;s cool to hate Drew Houston? I don&amp;#39;t know, but in addition to what was mentioned above, this company is set to buy back half it&amp;#39;s MFing float. Like, are you kidding me?)&lt;br/&gt;\n&lt;strong&gt;$NVDA: 2.61%&lt;/strong&gt; (Only reason I don&amp;#39;t have a bigger allocation is because NVIDIA puts my total semi allocation at around 9%. I also owned Intel for a hot second before I rolled it into other plays. Think The whole space is going to continue to skyrocket, but no one has the creativity or talent that NVIDIA does.)&lt;br/&gt;\n&lt;strong&gt;$BNTX: 2.6%&lt;/strong&gt; (The market thinks that this company stumbled upon vaccines, that covid is ending tomorrow, and that they have no other pipeline. The reality is that BioNTech is set to sell billions more in vaccines for a long time coming, and all of this is an incredibly massive tailwind to their rare diseases pipeline.)&lt;br/&gt;\n&lt;strong&gt;$WBD: 2.22%&lt;/strong&gt; (It&amp;#39;s always funny when some jackoff at BoA comes out with a report about how the merger between Discovery and Warner Brothers will create synergies that make this a $45 stock--6 months after the deal is announced. The stock rocketed above $30, then was indiscriminately sold off back to where it started--for no reason. The market is so efficient.)&lt;br/&gt;\n&lt;strong&gt;$GPRO: 2.2%&lt;/strong&gt; (As mentioned above, this has become a software company with total control over its market and prices. 96% of action cameras in America are GoPros. The recurring revenue on that software makes this at least a $30 stock. But nobody wants to own it because RemEmBEr tHat TiME WheN iT SolD OfF?)&lt;br/&gt;\n&lt;strong&gt;$NOK: 2.1%&lt;/strong&gt; (5G is them and some other guy. Enough said.)&lt;br/&gt;\n&lt;strong&gt;$CRM: 1.81%&lt;/strong&gt; (This company does not stop growing. One of the best companies in the world and there is no end in sight. Personally think the Slack purchase is being totally swept under the rug. It&amp;#39;s just that time of the cycle when you&amp;#39;re supposed to doubt Benioff.)&lt;br/&gt;\n&lt;strong&gt;$NLST: 1.33%&lt;/strong&gt; (Very unknown memory company with massive lawsuits against a bevy of huge companies and great prospects outside those lawsuits. They settled the lawsuit with SK Hynix and still have pending cases for patent infringement against the likes of Samsung, Micron, and Google--all of which are entirely legitimate.)&lt;br/&gt;\n&lt;strong&gt;$AMRS: 0.8%&lt;/strong&gt; (A deep future play for molecules-as-a-function. This one is very nuanced and I&amp;#39;m getting tired of writing. You&amp;#39;d have to look into this one yourself to truly understand the importance of synthetic, sustainable molecules used in the place of limited and/or endangered organics at far cheaper prices across the cost spectrum.)&lt;br/&gt;\n&lt;strong&gt;$SFT: 0.29%&lt;/strong&gt; (Kind of a random little lottery bet on a company with a market cap lower than its fourth quarter revenue alone. But with no path to profitability in sight, that&amp;#39;s all it is: a lottery ticket with a VERY small amount of AUM allocated.) &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;It&amp;#39;s not possible to create a perfect weighting with options in your portfolio, especially short puts, but I&amp;#39;ve done the best I can. For example, notionally, I could be tied to even more&lt;/em&gt; &lt;strong&gt;&lt;em&gt;Upstart&lt;/em&gt;&lt;/strong&gt; &lt;em&gt;than I&amp;#39;ve represented here. But Upstart would have to be ITM across three separate strikes (70, 80, and 100) by January 2023, which nobody can predict. (What I can say is that anything under $100 is DIRT cheap for Upstart, so I&amp;#39;m more than happy to own it at about $51, $55, and $66, which would be the breakeven prices at each strike, respectively, when including the outrageous premium I was paid for writing these puts.) I split the notional values of being assigned each put in half to represent the fact that Upstart is currently ITM for my 100 puts, ATM for the 80, and OTM for 70. Arbitrary, but so is anything in this case, even if you&amp;#39;d use Black Scholes somehow.&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "u8fb6r",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "FastAssSister",
  "discussion_type": null,
  "num_comments": 110,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/u8fb6r/tech_stocks_are_absurdly_cheap_now_putting_my/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/u8fb6r/tech_stocks_are_absurdly_cheap_now_putting_my/",
  "subreddit_subscribers": 3924044,
  "created_utc": 1650530100,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1650515580,
  "the_new_excerpt": "Buckle in.\n\nInvesting isn't easy, and yet people are--and always will--try to act like it\nis. Just like every other period in stock market history, retail 'investors' are\nbeing lazy and emotional and valuing businesses based off the direction their\nprices are heading rather than long term…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "腰を据えて\n\n投資は簡単ではありません それでも人々は - そしてこれからも - そのように振る舞おうとしています\nしています。株式市場の歴史における他の時代と同じように、個人「投資家」は怠惰で感情的であり、自分の方向性に基づいて企業を評価しています。\nを評価し、長期的な視点ではなく、価格の方向性に基づいて企業を評価する。\n個人投資家は怠惰で感情的で、長期的な視点ではなく、価格が向かっている方向に基づいて企業を評価している。",
      "title": "ハイテク株は今、異常に安い：私のお金を私の口に置くこと"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "扣好安全带。\n\n投资并不容易，但人们--而且总是会--试图表现得像它一样\n是。就像股市历史上的其他时期一样，散户 \"投资者 \"正在懒惰和情绪化，根据他们的方向对企业进行估值。\n懒惰和情绪化，根据企业的价格方向来评估企业的价值。\n价格走向而不是长期的...",
      "title": "科技股现在便宜得离谱：把我的钱放在我的嘴里"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "扣好安全帶。\n\n投資並不容易，但人們--而且總是會--試圖表現得像它一樣\n是。就像股市歷史上的其他時期一樣，散戶 \"投資者 \"正在懶惰和情緒化，根據他們的方向對企業進行估值。\n懶惰和情緒化，根據企業的價格方向來評估企業的價值。\n價格走向而不是長期的...",
      "title": "科技股現在便宜得離譜：把我的錢放在我的嘴裏"
    }
  ],
  "source_updated_at": 1650620674914
}