{
  "author": "dynamite2277",
  "original_created_utc": 1640273213,
  "title": "What have you purchased with your crypto gains?",
  "created_utc": 1640314329,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This bull run has been fantastic I got him back in march and I&amp;#39;ve seen some great gains. I know a lot of people have bought more crypto with the profits they have made. But I&amp;#39;m just curious to hear what people have purchased with their crypto grains that&amp;#39;s not crypto related. For me it was a fairly expensive book that helped me with a PhD application. I wanted to buy something that would better me as a person and where I want to take my career. But a close friend of mine used some of his crypto gains to decrote their house and pay for a small extension. I do plan to buy some art work from an artist that I have liked for years.&lt;/p&gt;\n\n&lt;p&gt;I know a lot of people will HODL until they die but for the ones who have used their gains to treat themselves or others. What did you get and why?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 159,
  "permalink": "/r/CryptoCurrency/comments/rmy0t4/what_have_you_purchased_with_your_crypto_gains/",
  "subreddit": "CryptoCurrency",
  "id": "rmy0t4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This bull run has been fantastic I got him back in march and I've seen some\ngreat gains. I know a lot of people have bought more crypto with the profits\nthey have made. But I'm just curious to hear what people have purchased with\ntheir crypto grains that's not crypto related. For me it was a fairly…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この強気な動きは素晴らしいものです。\n大きな利益を得ることができました。多くの人がその利益で暗号を買い増ししているのは知っています。\nということです。しかし、私は、人々が何を購入したかを聞きたいと思っています。\n暗号粒は暗号に関係ないものです。私の場合、かなり...",
      "title": "暗号の利益で何を購入したのですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这头公牛的表现非常好，我在3月份得到了它，我已经看到了一些\n巨大的收益。我知道很多人已经用他们赚到的利润买了更多的加密货币。\n他们已经赚了。但我只是好奇地想听听人们用他们的加密货币购买了什么？\n他们的加密货币谷物购买了哪些与加密货币无关的东西。对我来说，这是一个相当...",
      "title": "你用你的加密货币收益购买了什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這頭公牛的表現非常好，我在3月份得到了它，我已經看到了一些\n巨大的收益。我知道很多人已經用他們賺到的利潤買了更多的加密貨幣。\n他們已經賺了。但我只是好奇地想聽聽人們用他們的加密貨幣購買了什麼？\n他們的加密貨幣穀物購買了哪些與加密貨幣無關的東西。對我來說，這是一個相當...",
      "title": "你用你的加密貨幣收益購買了什麼？"
    }
  ]
}