{
  "author": "smeggletoot",
  "the_new_excerpt": "Once upon a time we were all alone in the world of crypto currencies. There were\nno alts to get caught up on and no big businesses involved in the space, and\ndefinitely no Twitter or YouTube talking heads to distract anyone from the\nmission.\n\nIt was a super fun and exciting time where there was a…",
  "original_created_utc": 1621124494,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昔々、私たちは暗号通貨の世界で孤独でした。それは\nアルトに追いつくこともなく、この分野に関わる大企業もなく、TwitterやYouTubeで\nツイッターやユーチューブで話題になるような人もいませんでした。\n使命に気を取られるようなツイッターやユーチューバーもいませんでした。\n\n当時はとても楽しく、エキサイティングな時代でした。",
      "title": "ビットコインのルーツを知る"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "曾几何时，在加密货币的世界里，我们都是孤独的。那时候\n没有代理人，也没有大企业参与到这个领域中来，而\n绝对没有Twitter或YouTube上的话题人物来分散人们的注意力。\n任务。\n\n那是一个超级有趣和令人兴奋的时代，在那里有一个...",
      "title": "铭记比特币的根源"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "曾幾何時，在加密貨幣的世界裏，我們都是孤獨的。那時候\n沒有代理人，也沒有大企業參與到這個領域中來，而\n絕對沒有Twitter或YouTube上的話題人物來分散人們的注意力。\n任務。\n\n那是一個超級有趣和令人興奮的時代，在那裏有一個...",
      "title": "銘記比特幣的根源"
    }
  ],
  "title": "Remembering Bitcoin's Roots",
  "created_utc": 1621175820,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Once upon a time we were all alone in the world of crypto currencies. There were no alts to get caught up on and no big businesses involved in the space, and definitely no Twitter or YouTube talking heads to distract anyone from the mission.</p>\n\n<p>It was a super fun and exciting time where there was a real sense of its “us against the world”. It was full of creative out of the box thinkers and techies in love with this idea of digital money.</p>\n\n<p>We’d get excited by people building bitcoin matrix screensavers and sites like sounds of bitcoin. There were no apps to download, no flashy charts, no coindesk and barely any exchanges… All we had was bitcoinity.org. No-one cared much about the price. Rather, threads in here and on bitcointalk were abuzz with ideas about all the cool stuff we could actually build with programmable money (we did the first NFTs on bitcoin, for instance, wayyy back in 2014 btw).</p>\n\n<p>We didn’t have to go cap in hand to VCs to get an idea off the ground. We went to each other and we just made it happen.</p>\n\n<p>Of course we yearned for the technology to one day become mainstream - many of us felt it was capable of saving the planet, after all. Although we were wise enough to understand it was most certainly not going to be a panacea for all the world&#39;s ills. But that maybe, just maybe, it could help make the world a better place.</p>\n\n<p>Our most powerful traits as a community were our altruism and kindness, our willingness to share ideas, and our desire to see others doing well in the world… we would be constantly rallying together to help people during the many crises happening in the outside world as a result of the financial shockwaves that followed the 2008 crisis. We were NICE people.</p>\n\n<p>There were no cyber hornets causing mayhem (well, maybe a little :p). All in all we were rather humble and gentle sweet little community of misfits and weirdos deeply troubled by the things going on in the world and united behind a technology we had decided ought be able to help tip the balance in favour of the underdogs, if only for a short while.</p>\n\n<p>And we very funny at times. We’d put up stupid billboard ads with <a href=\"https://media.wired.com/photos/5932fe704cd5ce6f96c0bfab/191:100/w_1280,c_limit/honeybadger.jpg\">honey badgers</a> and this reddit was dominated by little mom and pop businesses all over the globe posting pictures of their “bitcoin accepted” signs.</p>\n\n<p>The world back then wasn’t dominated by bitcoin billboard ads that had come out of a marketing PR agency, sponsored by the latest exchange.</p>\n\n<p>We also used to make really good art and memes in this reddit that truly inspired people around the world. Zhou Tonged made that stunning <a href=\"https://www.youtube.com/watch?v=yc6Hp_Zq3rU\">“Cyprus Anthem”</a> during the Cyprus Bail-in which really hammered home the “Why?” of bitcoin.</p>\n\n<p>Later, during the Greek riots when capital controls were put in place, I remember developing our <a href=\"https://www.reddit.com/r/Bitcoin/comments/3a86kf/time_for_plan_b_v2_greek_translation/\">Plan B Greece meme</a> in a thread on here. An idea that just grew organically, and we figured out as a community how to perfect.</p>\n\n<p>I checked reddit the next evening to see a CEO of a bitcoin company in the U.S. had flown all the way over to Athens, had the meme printed out on thousands of flyers, and was stood on the parliament steps there handing it out to ordinary people affected by the crisis.</p>\n\n<p>That evening bitcoiners organised a meet for 100s of people in the town hall, where they were introduced to the tech and given free bitcoins, and we all bought pizza for the locals - paid for by tips sent through the reddit tip bot.  There was a real sense that &quot;wow!  we&#39;re really bringing people together and spreading hope&quot; and doing so in a totally decentralised way.  And there wasn&#39;t a single tech giant CEO in sight calling the shots.</p>\n\n<p>One of the many moments that bought tears to my eyes was that trailer of ‘<a href=\"https://www.youtube.com/watch?v=-H6QuIv8OSI\">the rise and rise of bitcoin</a>’ where the little kid says “I”m going to college because my Dad mined bitcoin!”. Ahhhh, those lovely days when ordinary people could mine bitcoin on their own computers, back before it got taken over by big business mining cartels.</p>\n\n<p>And you know what? During those times, there was barely a single price post here (we’d send people to <a href=\"/r/bitcoinmarkets\">r/bitcoinmarkets</a> for that kind of chat) and there was never any posts of twitter talking heads or news posts about billionaires saying this or that, leading us all like little lambs into their Wall St. divide and conquer market manipulation games.</p>\n\n<p>As far as we were concerned if billionaires were that good at managing the world and technology, there never would have been a need for bitcoin in the first place, right? So we really didn’t pay much attention to what they had to say about an internet technology they had no qualifications to be commenting about it.</p>\n\n<p><strong>What about all those alts?</strong></p>\n\n<p>Those of us who have been around building things on the internet and involved in bitcoin since the beginning were never against alts. That’s the entire point of building an open source protocol - to allow the ecosystem to go create a bunch more versions and try things in a different way, enabling the wider crypto movement to gain in strength and diversity from the many moving parts. Imagine if there’d only been one flavour of Linux allowed to compete… no doubt it would have turned out to be as broken and lacking in innovation as Windows…</p>\n\n<p>It was bitcoiners that funded Vitalik (via the world’s first ICO) to go make his Turing complete smart contract ‘world computer’ a reality. Vitalik had been a major part of bitcoin and bitcoinmagazine. And those of us who enjoy seeing others succeed, wished him the absolute best with his new project. A bunch of us did pretty well out of that ICO too, thanks to all the hard work Vitalik and friends put into it.</p>\n\n<p>We were happy to see the Doggy people funding things like Jamaican bobsleds and bringing us all much needed light relief with their silly “much wow!” stuff. Real bitcoiners who remember the “Why?” of all this are over the moon to see a resurgence in their gentle little community of late, and people doing well from it all. It is we, after all, that made it all possible.</p>\n\n<p>Things only started going downhill when big business Wall St. billionaire investors - who have never built anything of importance on the internet - swooped in and started calling the shots, coupled with a bunch of cyberhornet maximalists who forgot that bigger picture open source “Why?” and decided all this had to be a zero sum game. Exactly what Wall St. wanted to happen of course, divide and conquer being the perfect strategy to separate an otherwise perfectly harmonious crypto community that could and should get along perfectly well given we all have far more in common with each other than we differences.</p>\n\n<p>Truth is those investors and hardcore maximalists (themselves now multi-millionaires) don’t give a damn about things like the open source “information wants to be free” ethic the web (and bitcoin) was founded upon, and many have now forgotten our very humble beginnings.</p>\n\n<p>Proof once again that power and money corrupts and how much we - as a community - have diverged from our original roots, divided by twitter talking heads and big business bullshit as we share celebratory articles from economics magazines about how banks are going to be adopting bitcoin.</p>\n\n<p>This is the gentrification of bitcoin; the inevitability of mainstream success. We are now seen as “Boomer Coin” by younger generations. And that’s okay, because that old world needed to get its foot in the door and stop fighting all this. And truth is, bitcoin is very old now. A strong and stable, reliable workhorse being run by billionaires.</p>\n\n<p>But a happy, vibrant community of strong willed philanthropic individuals that will fly out to Greece without a moments hesitation to go help locals in trouble, we are no more.</p>\n\n<p>If we were, this reddit right now would be full of posts of people helping out in the Covid crisis in India and Brazil. Instead it’s full of billionaire tweets and price movements. As if the chart is the only thing that matters.</p>\n\n<p><strong><em>&quot;It’s called a changeover, the movie goes on and nobody in the audience notices a thing.&quot; - The Narrator</em></strong></p>\n\n<p>We are now a plaything of billionaire investors who have made a bigger, faster, stronger version of the hedge fund “greed is good” capitalism we set out to disrupt, to be assimilated into the SWIFT and Visa network so that old system can continue to chug along as if nothing happened.</p>\n\n<p>Satoshi knew it would come to this of course, he always said at best bitcoin would only be able to buy us a little time in that ‘war’.</p>\n\n<p>There’s no need to be sad about any of this... Like towns that were once shitholes full of dodgy night clubs and drug dealers, which artists and misfits move into and manage to transform through their art and music…. eventually they get gentrified, cleansed, and the money people move in making it nice and safe… Same happened with vast swathes of the internet of course.</p>\n\n<p>In many ways the fact that banks are adopting bitcoin and posts in here celebrate institutions and billionaires like Michael Sailor coming onboard (he was very much against bitcoin at the outset)… it means, well, we have succeeded.</p>\n\n<p>But it’s high time we stopped pretending this is a movement of the people, for the people. It’s not and probably never can be now.</p>\n\n<p>It’s likely going to be a nice, clean, safe little currency that the vast majority of Western populaces and banking institutions can rely on as a secure store of value, and most people will probably be using it to do everyday transactions via SWIFT and Visa without even knowing they’re using layer 2/3 of bitcoin.  So in some weird, perverse way, that &quot;and then they join you&quot; phase has worked.  Just not how we expected it to.  Best laid plans of mice and men, eh?</p>\n\n<p>None of that changes the fact that there is all this art and beauty in the world that bitcoin inspired and hundreds of thousands of ordinary people we managed to elevate out of poverty back at the beginning... Nor does it change the fact that somewhere out there, there’s a kid in the world who is graduating from college this year because his Dad once mined bitcoin.</p>\n</div><!-- SC_ON -->",
  "score": 181,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/73YMJlFsaNfsCZLocpG9tbPGXrzjSePbZT69SK5oEPU.jpg?auto=webp&s=a3a7b94b60341468e715e5a7ff429f91c5dee0a2",
          "width": 1280,
          "height": 670
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/73YMJlFsaNfsCZLocpG9tbPGXrzjSePbZT69SK5oEPU.jpg?width=108&crop=smart&auto=webp&s=2371e3f949b53cbbdcf385ef87dc191bed17b69d",
            "width": 108,
            "height": 56
          },
          {
            "url": "https://external-preview.redd.it/73YMJlFsaNfsCZLocpG9tbPGXrzjSePbZT69SK5oEPU.jpg?width=216&crop=smart&auto=webp&s=0fd6f8ff9ba095a6a82d4031efb9bb4c6b03de3f",
            "width": 216,
            "height": 113
          },
          {
            "url": "https://external-preview.redd.it/73YMJlFsaNfsCZLocpG9tbPGXrzjSePbZT69SK5oEPU.jpg?width=320&crop=smart&auto=webp&s=bf5f6e27dbf781e204c0701ad71bea442cb78865",
            "width": 320,
            "height": 167
          },
          {
            "url": "https://external-preview.redd.it/73YMJlFsaNfsCZLocpG9tbPGXrzjSePbZT69SK5oEPU.jpg?width=640&crop=smart&auto=webp&s=810d35bba0e2ed9e540d1f244d9609d2d08e8fbd",
            "width": 640,
            "height": 335
          },
          {
            "url": "https://external-preview.redd.it/73YMJlFsaNfsCZLocpG9tbPGXrzjSePbZT69SK5oEPU.jpg?width=960&crop=smart&auto=webp&s=e43e0e1d2ea1643294e924991de2004ca9132d07",
            "width": 960,
            "height": 502
          },
          {
            "url": "https://external-preview.redd.it/73YMJlFsaNfsCZLocpG9tbPGXrzjSePbZT69SK5oEPU.jpg?width=1080&crop=smart&auto=webp&s=a937f1e3237a07085991165cf08b9f7163456000",
            "width": 1080,
            "height": 565
          }
        ],
        "variants": {},
        "id": "GiuTk5uezFct0jjZUp7HaVMNWJ2_ADQet-Egh76zLF8"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/Bitcoin/comments/ndcaza/remembering_bitcoins_roots/",
  "subreddit": "Bitcoin",
  "id": "ndcaza",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590794220
}