{
  "author": "gingercrash",
  "the_new_excerpt": "As the title says, I really believe moons are inevitably going to create a huge\necho chamber where people are going to be scared of saying something just in\ncase it gets downvoted.\n\nWhy risk actual money just to say to someone that nano isn't everything this sub\nsays it is, to protect someone…",
  "original_created_utc": 1615218059,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "正如标题所说，我真的相信月亮必然会产生巨大的。\n回音室，人们会害怕说些什么，只是在。\n以防被删帖。\n\n为什么要冒着实际资金的风险，只为了对别人说，纳米不是一切，这个次\n说是为了保护某人... ...",
      "title": "卫星最终会形成一个回音室"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "正如標題所說，我真的相信月亮必然會產生巨大的。\n迴音室，人們會害怕說些什麼，只是在。\n以防被刪帖。\n\n爲什麼要冒着實際資金的風險，只爲了對別人說，納米不是一切，這個次\n說是爲了保護某人... ...",
      "title": "衛星最終會形成一個迴音室"
    }
  ],
  "title": "Moons will eventually create an echo chamber",
  "created_utc": 1615239337,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As the title says, I really believe moons are inevitably going to create a huge echo chamber where people are going to be scared of saying something just in case it gets downvoted. </p>\n\n<p>Why risk actual money just to say to someone that nano isn&#39;t everything this sub says it is, to protect someone investing, if it actually costs money. Or telling someone that investing in BNB/ADA/Doge doesn&#39;t actually make you an idiot and that sometimes it&#39;s smart to buy hype if you catch it on the up.</p>\n\n<p>If it carries on we&#39;re all going to be all in a large echo chamber where new people will get hurt as it doesn&#39;t reflect the real world, which is dangerous.</p>\n\n<p>Anyways I lost my moons probably already so thought I could share this controversial opinion knowing I can&#39;t lose anymore. But it does worry me about the future of the sub. I enjoy moons and think the concept is amazing, maybe don&#39;t let it get effected by downvotes though? Surely any interaction is good interaction.</p>\n</div><!-- SC_ON -->",
  "score": 326,
  "permalink": "/r/CryptoCurrency/comments/m0ico6/moons_will_eventually_create_an_echo_chamber/",
  "subreddit": "CryptoCurrency",
  "id": "m0ico6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542573500
}