{
  "author": "johnnysalami500500",
  "original_created_utc": 1660541979,
  "title": "Should I feel ashamed for living with my parents at 25?",
  "created_utc": 1660580939,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’ve lived with my parents since I was 22, after I moved back from college. I graduated and got a job and had only planned to live with them for less than a year. Then the pandemic happened, I lost my job, but later found steady employment. Now I’m working but also going back to school part time, currently in the middle of making a career change. I would love to move out but financially it makes sense to live with my parents.&lt;/p&gt;\n\n&lt;p&gt;I could go on and on about my situation but is it “sad”, am I a loser? My parents and I have an absolutely great relationship, I have a significant other, I am also the youngest of my siblings.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 108,
  "permalink": "/r/NoStupidQuestions/comments/worh6t/should_i_feel_ashamed_for_living_with_my_parents/",
  "subreddit": "NoStupidQuestions",
  "id": "worh6t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’ve lived with my parents since I was 22, after I moved back from college. I\ngraduated and got a job and had only planned to live with them for less than a\nyear. Then the pandemic happened, I lost my job, but later found steady\nemployment. Now I’m working but also going back to school part time,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "大学から戻ってきた22歳の時から、親と同居しています。I\nを卒業し、就職して、1年足らずの間だけ同居する予定だった。\n年弱の予定でした。その後、パンデミックが起こり、私は職を失いましたが、その後、安定した仕事を見つけることができました。\n就職しました。今は働きながら、パートタイムで学校にも通っています...。",
      "title": "25歳で親と同居していることを恥じるべきでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我从22岁起就和父母住在一起，在我从大学搬回来之后。I\n我毕业后找到了一份工作，本来只打算和他们一起生活不到一年的时间。\n一年。然后发生了大流行病，我失去了工作，但后来找到了稳定的\n工作。现在我在工作，但也回到学校做兼职，...",
      "title": "我应该为25岁时与父母同住而感到羞愧吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我從22歲起就和父母住在一起，在我從大學搬回來之後。I\n我畢業後找到了一份工作，本來只打算和他們一起生活不到一年的時間。\n一年。然後發生了大流行病，我失去了工作，但後來找到了穩定的\n工作。現在我在工作，但也回到學校做兼職，...",
      "title": "我應該爲25歲時與父母同住而感到羞愧嗎？"
    }
  ]
}