{
  "author": "vjeva",
  "original_created_utc": 1629565317,
  "title": "Proof-of-Stake since 2018. Decentralized governance with a self upgrading Blockchain. Very low fees with a hight TPS rate. One of the biggest NFT Marketplaces out there, seven major updates in the last 3 years - Let's talk about TEZOS.",
  "created_utc": 1629594724,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If you want to talk about decentralization, then Tezos is one project that deserves some special attention.</p>\n\n<p>Cardano is just about to launch smart contracts, and Tezos has it running since 2018, with an increasing monhtly growth rate.</p>\n\n<p>You have the chance to delegate XTZ and earn rewards without locking it up (unlike many other projects)</p>\n\n<p>7- major updates in the last 3 years.</p>\n\n<p>An highly decentralized network with a significant number of active nodes.</p>\n\n<p>One of the biggest NFT marketplaces that is out there.</p>\n\n<p>Growing partnership base such as: Red Bull, McLaren, Societe Generale, Ubisoft, Groupe Casino etc.</p>\n\n<p>The Tezos community is not that outspoken and highly active such as in the case of Cardano, Ethereum or other Altcoins, but it&#39;s one of the most advanced and decentralized projects out there.</p>\n\n<p>This community should share some insights and I just want to give some space to a sleeping giant that definitely deserves to be in the spotlight.</p>\n</div><!-- SC_ON -->",
  "score": 160,
  "permalink": "/r/CryptoCurrency/comments/p8v2oj/proofofstake_since_2018_decentralized_governance/",
  "subreddit": "CryptoCurrency",
  "id": "p8v2oj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "If you want to talk about decentralization, then Tezos is one project that\ndeserves some special attention.\n\nCardano is just about to launch smart contracts, and Tezos has it running since\n2018, with an increasing monhtly growth rate.\n\nYou have the chance to delegate XTZ and earn rewards without…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "非中央集権の話をしたいのであれば、Tezosは注目に値するプロジェクトの一つです。\nは特別な注意を払うべきプロジェクトです。\n\nCardanoはちょうどスマートコントラクトを立ち上げようとしているところで、Tezosはそれを2018年から実行しています。\n2018年、モンハンの成長率を高めています。\n\nあなたには、XTZを委譲して、報酬を得るチャンスがあります...",
      "title": "2018年からプルーフ・オブ・ステイク 自己アップグレードするブロックチェーンによる分散型のガバナンス。高いTPS率で非常に低い手数料。最大級のNFTマーケットプレイスで、過去3年間に7回のメジャーアップデートを実施 - Let's talk about TEZOS."
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你想谈论去中心化，那么Tezos是一个值得特别关注的项目。\n值得特别关注。\n\nCardano即将推出智能合约，而Tezos自2018年以来一直在运行。\n2018年就开始运行了，而且每月的增长率都在增加。\n\n你有机会委托XTZ并获得奖励，而不需要...",
      "title": "自2018年以来，采取证明的方式。具有自我升级的区块链的去中心化治理。费用很低，TPS率很高。最大的NFT市场之一，在过去3年中有7次重大更新 - 让我们谈谈TEZOS。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你想談論去中心化，那麼Tezos是一個值得特別關注的項目。\n值得特別關注。\n\nCardano即將推出智能合約，而Tezos自2018年以來一直在運行。\n2018年就開始運行了，而且每月的增長率都在增加。\n\n你有機會委託XTZ並獲得獎勵，而不需要...",
      "title": "自2018年以來，採取證明的方式。具有自我升級的區塊鏈的去中心化治理。費用很低，TPS率很高。最大的NFT市場之一，在過去3年中有7次重大更新 - 讓我們談談TEZOS。"
    }
  ]
}