{
  "author": "ronperlmanforever69",
  "original_created_utc": 1646356388,
  "title": "Why is every 3th post here right wing complaints?",
  "created_utc": 1646365644,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Why has it become normal for this sub to have whiny  dogwhistle-title posts trending all the time?\nEvery third post is not a question but rather an underlying statement about how (white) men are oppressed and how feminism has ruined movies, also sometimes stories about how gay men are predators, with virtually zero examples given as to what makes the poster think so.\nHas this sub been hijacked by angry middle-aged single men lately?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 107,
  "permalink": "/r/TooAfraidToAsk/comments/t66vk3/why_is_every_3th_post_here_right_wing_complaints/",
  "subreddit": "TooAfraidToAsk",
  "id": "t66vk3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Why has it become normal for this sub to have whiny dogwhistle-title posts\ntrending all the time? Every third post is not a question but rather an\nunderlying statement about how (white) men are oppressed and how feminism has\nruined movies, also sometimes stories about how gay men are predators,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "なぜこのサブでは、愚痴っぽい犬笛タイトルの投稿が普通になってしまったのでしょう。\n常にトレンドになっているのでしょうか？3回に1回の投稿は質問というより\n白人の）男性がいかに虐げられているか、フェミニズムがいかに\n映画がダメになった、ゲイが捕食者だという話もたまに...。",
      "title": "なんでここの3番目の書き込みは全部右翼の文句なんだ？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "为什么在这个子网站上，抱怨性的狗皮膏药标题的帖子已经成为正常现象？\n的趋势？每三个帖子都不是一个问题，而是一个关于（白人男性）如何被压迫和女权主义者如何被压迫的潜在声明。\n潜在的声明是关于（白人）男人如何被压迫，以及女权主义如何破坏了电影。\n毁掉了电影，有时还说同性恋者是掠夺者，...",
      "title": "为什么这里每3个帖子都是右翼的抱怨？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "爲什麼在這個子網站上，抱怨性的狗皮膏藥標題的帖子已經成爲正常現象？\n的趨勢？每三個帖子都不是一個問題，而是一個關於（白人男性）如何被壓迫和女權主義者如何被壓迫的潛在聲明。\n潛在的聲明是關於（白人）男人如何被壓迫，以及女權主義如何破壞了電影。\n毀掉了電影，有時還說同性戀者是掠奪者，...",
      "title": "爲什麼這裏每3個帖子都是右翼的抱怨？"
    }
  ]
}