{
  "author": "Hanoverview",
  "original_created_utc": 1632490799,
  "title": "LPT: I Have been homeless, there is one tip i can give you if you ever get homeless \"Dont hang around with other homeless people!\"",
  "created_utc": 1632558408,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><ol>\n<li><p>Go to Church even if you dont belive and talk to people ask for help or work.</p></li>\n<li><p>If you find a place to sleep DONT TELL OTHERS!</p></li>\n<li><p>Try not to look to homeless if you can . People want to help someone &quot;down on luck&quot; not someone who has &quot;given up&quot;</p></li>\n<li><p>No alcohol ,No Drugs you are ealready in a bad place dont make getting out of it more difficult.</p></li>\n</ol>\n\n<p>EDIT: thankyou for all the storys you guys share . i try to talk to a few people where i can . Stay save whatever happens and dont give up if you are about to be homeless it will not be easy . you will have to fight but i belive in you and you got this !</p>\n\n<p>EDIT 2: to make this clear i was homeless from 16 to almost 19  i am 35 now .and i am from germany not the USA</p>\n</div><!-- SC_ON -->",
  "score": 75097,
  "permalink": "/r/LifeProTips/comments/pujzqz/lpt_i_have_been_homeless_there_is_one_tip_i_can/",
  "subreddit": "LifeProTips",
  "id": "pujzqz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": " 1. Go to Church even if you dont belive and talk to people ask for help or\n    work.\n\n 2. If you find a place to sleep DONT TELL OTHERS!\n\n 3. Try not to look to homeless if you can . People want to help someone \"down\n    on luck\" not someone who has \"given up\"\n\n 4. No alcohol ,No Drugs you are…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": " 1. 信じていなくても教会に行き、人々と話し、助けや仕事を求めましょう。\n    仕事を頼みましょう。\n\n 2. もし寝る場所を見つけても、他の人には言わないでください。\n\n 3. できればホームレスの方を見ないようにしましょう。人々は「運のない」人を助けたいと思っています。\n    あきらめている人ではなく、「運のない人」を助けたいと思うものです。\n\n 4. アルコール、薬物は使用しないでください...",
      "title": "LPT：私はホームレスになったことがあるのですが、もしホームレスになったときに言えることは、「ホームレス同士でつるまないこと！」です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": " 1. 即使你不相信，也要去教会，与人交谈，寻求帮助或工作。\n    工作。\n\n 2. 2.如果你找到了睡觉的地方，不要告诉别人。\n\n 3. 3. 如果可以的话，尽量不要去看无家可归的人。人们想帮助那些 \"运气不好 \"的人\n    运气不好 \"的人，而不是已经 \"放弃 \"的人。\n\n 4. 不喝酒，不吸毒，你是...",
      "title": "LPT: 我曾经无家可归，如果你有一天无家可归，我可以给你一个建议，\"不要和其他无家可归的人混在一起！\""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": " 1. 即使你不相信，也要去教會，與人交談，尋求幫助或工作。\n    工作。\n\n 2. 2.如果你找到了睡覺的地方，不要告訴別人。\n\n 3. 3. 如果可以的話，儘量不要去看無家可歸的人。人們想幫助那些 \"運氣不好 \"的人\n    運氣不好 \"的人，而不是已經 \"放棄 \"的人。\n\n 4. 不喝酒，不吸毒，你是...",
      "title": "LPT: 我曾經無家可歸，如果你有一天無家可歸，我可以給你一個建議，\"不要和其他無家可歸的人混在一起！\""
    }
  ]
}