{
  "author": "SameThingHappened2Me",
  "original_created_utc": 1627694359,
  "title": "Is BTC Pulling a 2013 on Us? (Some Hopium)",
  "created_utc": 1627709438,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It&#39;s July of 2013.  If you bought anywhere near the peak in April, things were looking pretty depressing, with losses as large as 70% and what seemed to be a slow, steady grind downward.  A lot of people closed out their position, giving up.  Here&#39;s the daily chart:</p>\n\n<p><a href=\"https://preview.redd.it/n3r7puf45ge71.png?width=1449&amp;format=png&amp;auto=webp&amp;s=1554651a801fabfe92d1241ebe05ce133a45da81\">2013 BTC Chart to July</a></p>\n\n<p>If you hung around &#39;till October, you got a few more months of crab movement.  August showed some positive recovery, but at the start of October, everything dumped in a day.  You&#39;re still down 70%-ish if you held from the peak, but emotionally, you might be even further down, because all the painstakingly slow recovery had dumped so quickly and you didn&#39;t have any confidence the next day wouldn&#39;t be worse.</p>\n\n<p><a href=\"https://preview.redd.it/jofjjr2r5ge71.png?width=1433&amp;format=png&amp;auto=webp&amp;s=a7c3e9ffedeaf1e4b011d5a7340685e42b4f9df6\">2013 BTC chart to Oct</a></p>\n\n<p>But if you waited another month, you would&#39;ve caught a ride up 340% from the earlier peak!  And if you bought any of that dip, you would be looking at 1400% growth.  Look how tiny that April peak looks in retrospect! </p>\n\n<p><a href=\"https://preview.redd.it/ixdk2c7m6ge71.png?width=1461&amp;format=png&amp;auto=webp&amp;s=bcb47106c3c101a80982f050714e182606085001\">2013 BTC chart to Nov</a></p>\n\n<p>So next let&#39;s look at today&#39;s chart.  I&#39;ve left some blank space for your mind to fill in the hopium:</p>\n\n<p><a href=\"https://preview.redd.it/e16456pu7ge71.png?width=1145&amp;format=png&amp;auto=webp&amp;s=c56fe24948bbbaa4068de4736ab11a414388ced7\">2021 BTC Chart with Blank Space for Hopium</a></p>\n\n<p>Can you see the parabolic green line that could happen, like it did in 2013 (and 2017)?  Do you see the hopium rocket primed for lift off?  I know I&#39;m not really saying anything new here, but thought it might be useful to look at the 2013 charts as if you were living them then, like you are now.  In retrospect, to those who aren&#39;t a part of it, it looks so easy.  Like you just punch a ticket and get rich.  But when you&#39;re living through it with your money on the line, it&#39;s actually months of torment.  You&#39;ve gotten to experience the torment (2021 edition), don&#39;t miss out on the payoff.</p>\n\n<p>And of course, usual disclaimers apply:  this is not financial advice, do your own research, don&#39;t invest more than you can afford to lose, yadda yadda yadda.</p>\n</div><!-- SC_ON -->",
  "score": 178,
  "permalink": "/r/CryptoCurrency/comments/ouy21i/is_btc_pulling_a_2013_on_us_some_hopium/",
  "subreddit": "CryptoCurrency",
  "id": "ouy21i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It's July of 2013. If you bought anywhere near the peak in April, things were\nlooking pretty depressing, with losses as large as 70% and what seemed to be a\nslow, steady grind downward. A lot of people closed out their position, giving\nup. Here's the daily chart:\n\n2013 BTC Chart to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2013年の7月です。4月のピーク時に買った人は、70％もの損失を出し、かなり落ち込んでいました。\n損失は70％にも達し、かなり落ち込んでいました。\n損失は70％にも達し、ゆっくりと着実に下降しているように見えました。多くの人が、あきらめてポジションを閉じた。\n諦めた。これが日足チャートです。\n\n2013年BTCチャートから...",
      "title": "BTCは私たちに2013年をもたらすのか？(Some Hopium)"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "现在是2013年7月。如果你在4月的高峰期附近买入，事情看起来非常令人沮丧。\n损失高达70%，而且似乎是在缓慢、稳定地下降，看起来非常令人沮丧。\n缓慢、稳定地向下攀升。很多人关闭了他们的位置，放弃了\n了。这里是日线图。\n\n2013年BTC图表到...",
      "title": "BTC是否在对我们进行2013年的改造？(一些希望)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "現在是2013年7月。如果你在4月的高峯期附近買入，事情看起來非常令人沮喪。\n損失高達70%，而且似乎是在緩慢、穩定地下降，看起來非常令人沮喪。\n緩慢、穩定地向下攀升。很多人關閉了他們的位置，放棄了\n了。這裏是日線圖。\n\n2013年BTC圖表到...",
      "title": "BTC是否在對我們進行2013年的改造？(一些希望)"
    }
  ]
}