{
  "author": "roman_axt",
  "the_new_excerpt": "Yeah, you heard it right, and you most likely know that already, but lemme give\nyou some technical rationale of how this might happen. The analysis is build\nupon fractal techniques, so that the previous price action is used for making\nthis forecast. Buckle up and eat a Crayon, fellow trader (the…",
  "original_created_utc": 1615756512,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "是的，你没听错，你很可能已经知道了，但是让我来告诉你\n你的一些技术原理，这可能会发生。分析是建立在\n在分形技术的基础上，使之前的价格走势被用来做。\n这个预测。扣扣吃蜡笔小新，同业者（该。",
      "title": "你好，Apetards！我最近一直在做一些技术分析（分形和狗屎），发现GeeMEeee将fking PENETRATE 1K下周。希望你喜欢阅读!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "是的，你沒聽錯，你很可能已經知道了，但是讓我來告訴你\n你的一些技術原理，這可能會發生。分析是建立在\n在分形技術的基礎上，使之前的價格走勢被用來做。\n這個預測。扣扣喫蠟筆小新，同業者（該。",
      "title": "你好，Apetards！我最近一直在做一些技術分析（分形和狗屎），發現GeeMEeee將fking PENETRATE 1K下週。希望你喜歡閱讀!"
    }
  ],
  "title": "Sup, apetards! I've been DOING some technical ANALysis recently (fractals and shit), and found out that GeeMEeee is going to fking PENETRATE $1K next week. Hope you enjoy the read!",
  "created_utc": 1615793018,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Yeah, you heard it right, and you most likely know that already, but lemme give you some technical rationale of how this might happen. The analysis is build upon fractal techniques, so that the previous price action is used for making this forecast. Buckle up and eat a Crayon, fellow trader (the word is used as anagram you know for what) as it will help you stay nutrated for the rest of this reading, and it might even help you with the digestion (of the information in the post).</p>\n\n<p>This is not a financial advice and I am not and a professional advisor, I just enjoy to share my knowledge and educate brainless apes occasionally.</p>\n\n<p>&quot;BuT whY dO I neEd your FARTCAL ANALizis?!1&quot;</p>\n\n<p>Well, that&#39;s a good question. When I was a young ape living free in the Steppes of Kazakhstan... JK, leave poor Vlad alone for a moment. <strong>The fractal</strong> (from Latin <em>fractus</em>) means a steady scalable design of irregular shape emerging on any data. The trade fractal in the financial market is the pattern, formed by a sequence(es) of candles, which has peculiar identifiable characteristics and a tendency to reoccur across different scales and time-frames. Fractals are simple yet important, repetitive formations used by traders to identify and to confirm a trend. Apely speaking, fartcals allow us to forecast the future price action based on the previous similar trends on a given trading instrument.</p>\n\n<p>Now that the captain is gone, let&#39;s get to business.</p>\n\n<p><a href=\"https://preview.redd.it/yge17n3k12n61.png?width=2160&amp;format=png&amp;auto=webp&amp;s=d533ec1fdbcf6443b2233142f87bb285f0c27786\">GME fartcals wroom wroom</a></p>\n\n<p>I know that you all love Crayons with all of your hearts, so I will use rare turquoise and magenta ones in this analysis. Furthermore, I did my best to simplify the method of distinguishing the fractal sequences, using simple lines, and hopefully you should need no more than one brain wrinkle to understand it.<br/>\nWhat you see on the chart (one candle represents 2 hours of price action) above is a perfect example of beautiful fractals. The chart starts from the 11th of January with the turquoise slightly downward tilted consolidation. Next you see a relatively soft magenta upward impulse (14-16 Jan), followed by another turquoise consolidation, this time slightly tilting up and lasting for about three days. Next is where the things really start to get interesting (22nd Jan), as the subsequent magenta upward impulse accelerates exponentially. This accelerection does not go quietly, erupting into a powerful gap (not as big as the one in your head, though). Finally, starting 27th of Jan we have a local endgame highlighted by a purple rectangle with the apex (pay attention to this peak, as it will be used for calculations later) on the 27th of January. &#39;What? Why purple rectangle?&#39; you may ask. Easy. REKTangles are the Horsemen of the Endgame.<br/>\nThat was only the left part of the chart. Now let&#39;s be brief for a moment. There were six main components to the fractal base: turquoise consolidation, magenta uptrend, turquoise consolidation 2, magenta impulse, gap and purple rectangle. What you see on the right, is the original base for the fractal described above meets its bigger brother. Particularly, starting 22nd Feb a very similar chain of price actions manifests. And this is how we really utilize fractals: identify the fractal sequence from the previous data (on the left), and after that apply the pattern to similar market conditions (on the right). Many of the the things look really similar on both sides of the graph, don&#39;t they? Coincidence? I think not.  </p>\n\n<p><a href=\"https://preview.redd.it/v5s6clts12n61.jpg?width=534&amp;format=pjpg&amp;auto=webp&amp;s=f7e6dcacd9509becc15e1e38a254575986e49063\">https://preview.redd.it/v5s6clts12n61.jpg?width=534&amp;format=pjpg&amp;auto=webp&amp;s=f7e6dcacd9509becc15e1e38a254575986e49063</a></p>\n\n<p>&quot;Oh fArtcaLs good Butt WEN MOON?1!&quot;  </p>\n\n<p><a href=\"https://preview.redd.it/f0u97sfv12n61.jpg?width=461&amp;format=pjpg&amp;auto=webp&amp;s=d64f1f93399d094112b49cf4170475e56ce84bc8\">Here you go boy</a></p>\n\n<p>Allrighty. I know that the energy from the Crayon you ate is running out, so lemme summarize the analysis for this intellectually limited individual with extraordinary small brain capacity that you are. What I need you to do now is what even a half brained chimpanzee is capable of. Count to six (yes, you may use your fingers). Twice.</p>\n\n<p><a href=\"https://preview.redd.it/mfnkdif022n61.png?width=2160&amp;format=png&amp;auto=webp&amp;s=9d2fd1b92e9a7bf6c2bbeb0fac0ed538ea35d96b\">Numbers and fractals simplified for dummies</a></p>\n\n<p>1 = flat line;<br/>\n2 = small magenta hill;<br/>\n3 = line as flat as your wife&#39;s girlfriend&#39;s tit;<br/>\n4 = accelerection;<br/>\n5 = your brain (aka Gap);<br/>\n6 = Valhala REKTangle / GME go BBBBRRRRRRR  </p>\n\n<p>Good boy/girl, you&#39;ve come this far. Now that your confirmation bias is reinforced, you may get some rest. Or eat another nutritious crayon my brain destitute ape friend, because we are DIVING DEEPER.</p>\n\n<p>Ok, it turned out that I needed to eat some Crayons myself, because I really got exhausted writing the post for five hours in a row. So I ate a pack this time, and I am full of GMEnergy. As is the chart below, so bullish, that we will definitely see some GMEnergy explosions in a short time to come. Now the complexity of analysis is going to increase a little bit, but the apes have to evolve at one point in history, so I really encourage you to use this opportunity.   </p>\n\n<p><a href=\"https://preview.redd.it/888zsh3c22n61.png?width=2160&amp;format=png&amp;auto=webp&amp;s=ec2c553761a27dc98efa7dae3de918da0d4f600f\">In-depth fractal forecast</a></p>\n\n<p>I hope that you got accustomed to the previous six steps for dummies explanation, and by this moment you should understand the basic principle of how the fractals play. What you see above is a little bit more advanced chart, through which I aim to explain how I came to the price predictions in the post title (finally!). Ok, 1 2 3 4 5 6 is understandable, where did A B come from? The first and most important notice, is that A-B fractals are built upon 1-2-3-4-5-6, and on the chart you can see that A measures 1-2-3-4 pattern, while B covers 5-6 steps of the sequence. A-B on the left (January run) is self explanatory, the fractals are measured as they are. A-B on the right (current price action formation) is where we need some math to get involved, particularly, when we are working with the new B movement prediction. And that is not as difficult as it may seem from a first glance. Again, the main fractal property, re-occurrence, will play on our side. Predicting the price movements, on a volatile market like this one, is one of the most ungrateful things to do, so don&#39;t go too harsh on what I am going share with you, apesters. My theory, is that it is possible to predict the amplitude of the upcoming move, using data from previous one. And here, we only need the coefficient from first A-B move. A simple ratio: dividing first B move (about $325 increase) by first A move ($131) gives us a coefficient of about 2,48. Let&#39;s apply this ratio to the currently forming fractal: that is multiplying the second A fractal completed height (about $330 based on my prediction, which is built later in this post), which will give the estimated B part of the second fractal height of about $818, landing us on the sweet $1200 dollar level through the next week. Boom, looks beautiful and promising! Fractals, baby!  </p>\n\n<p>I hope it has been an entertaining as well as mentally developing read for you so far, smoothie-brainie. But there is still one important part of the analysis left to be addressed. Particularly, it is the the sequence part number 4, where the price action stands currently. And yeah, you guessed it, almighty fractals are helping us here again. Below you will find two charts (both are 30 min charts), which are actually zoomed in the price actions of the fourth step of the two fractals analyzed above. I can&#39;t stop enjoying and appreciating fractals and below you should really see why.  </p>\n\n<p><a href=\"https://preview.redd.it/heozo1gg22n61.png?width=1646&amp;format=png&amp;auto=webp&amp;s=d637c1806d229ffad089dc6491357ce01b55207a\">GME price action 22-27 January</a></p>\n\n<p><a href=\"https://preview.redd.it/m1dydccm22n61.png?width=1646&amp;format=png&amp;auto=webp&amp;s=9724902e12d23390a6f614fe026acd4f2c4abf3d\">GME price action 5-15 March</a></p>\n\n<p>Because they look similar again! Now I will ask you to excuse me, I started to work on this analysis about ten hours ago, and I really need to get some sleep, as my brain is holding strong to the last wrinkle it has left, so this explanation will be brief. I forecasted the apex point of the current 4 using not so complicated method, and again taking inspiration from the previous price action and its underlying patterns. The magenta curly lines play as supports for both of the impulses. And these look amazingly similar in its slope and pace, but we should probably stop being surprised about that at this point. The second important fractal factor is this chainsaw in the middle of the patterns, corresponding to the severe corrections in these bull runs. Remember being in the market at those moments? Wooh, that was fun. And finally, take a look at this averaged line that looks like a string of a bow - not only it averages the price action, it also completes this bow shaped fractal pattern, allowing us to predict the potential high of the current price action ($380-ish). That&#39;s it folks, mic drop.</p>\n\n<p>TL;DR: Fractals is life fractals is love  ❤️  as is GEEEMEEE</p>\n</div><!-- SC_ON -->",
  "score": 6198,
  "permalink": "/r/wallstreetbets/comments/m54fzc/sup_apetards_ive_been_doing_some_technical/",
  "subreddit": "wallstreetbets",
  "id": "m54fzc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147392092
}