{
  "author": "DemonOfLaplace",
  "original_created_utc": 1644828654,
  "title": "Is it okay to block a close friend if they started dating your ex of 4 years?.",
  "created_utc": 1644837703,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Edit: I should have added that; 1.) Me and my Ex broke up just a few months ago. We were in a relationship for 4 years. 2) He was toxic and abusive, which I tried to deny and I thought &amp;quot;I could change him&amp;quot;. He would disregard my achievements and would make me feel bad about my appearance. He also doesn&amp;#39;t like it that I slept a lot with other guys before we got together. I ignored it cuz I thought he will be my &amp;#39;forever love&amp;#39;. 3.) This close friend of mine tried to make me meet up with her, along with my ex, so she can &amp;#39;explain&amp;#39; things and want to still be friends with me. 4.) This close friend is also one of the few friends that I confided with about my feelings. I cried on their shoulders. We went on date nights when I felt bad. Etc etc. So I felt like I was betrayed by her in some way.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 115,
  "permalink": "/r/TooAfraidToAsk/comments/ss6228/is_it_okay_to_block_a_close_friend_if_they/",
  "subreddit": "TooAfraidToAsk",
  "id": "ss6228",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Edit: I should have added that; 1.) Me and my Ex broke up just a few months ago.\nWe were in a relationship for 4 years. 2) He was toxic and abusive, which I\ntried to deny and I thought \"I could change him\". He would disregard my\nachievements and would make me feel bad about my appearance. He also…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "編集部：追記すべきでした；1．） 私と元彼はほんの数ヶ月前に別れました。\n私たちは4年間交際していました。2) 彼は毒性があり、虐待的であった。\n否定しようとしたし、「彼を変えられる」と思っていた。彼は私を無視し\n私は、自分の功績を認め、自分の外見を悪く言うようになりました。彼はまた...",
      "title": "4年付き合った元彼と付き合い始めたら、親しい友人をブロックしてもいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "编辑：我应该补充一下；1.) 我和我的前男友几个月前刚刚分手。\n我们在一起4年了。2) 他是有毒的，有虐待行为，而我\n我试图否认，我认为 \"我可以改变他\"。他无视我的\n他无视我的成就，让我对自己的外表感到难过。他还...",
      "title": "如果一个亲密的朋友开始和你4年的前男友约会，你可以屏蔽他吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "編輯：我應該補充一下；1.) 我和我的前男友幾個月前剛剛分手。\n我們在一起4年了。2) 他是有毒的，有虐待行爲，而我\n我試圖否認，我認爲 \"我可以改變他\"。他無視我的\n他無視我的成就，讓我對自己的外表感到難過。他還...",
      "title": "如果一個親密的朋友開始和你4年的前男友約會，你可以屏蔽他嗎？"
    }
  ]
}