{
  "author": "insanelylogical",
  "original_created_utc": 1656172007,
  "title": "If somatic cells can only divide up to the Hayflick limit, how do people live longer than a few decades?",
  "created_utc": 1656210410,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I know not all cell types divide that frequently, but some like skin cells divide daily. It seems that it would not be that long before all skin cells have reached the Hayflick limit and eventually our skin will cease to function. &lt;/p&gt;\n\n&lt;p&gt;Even if we replace skin cells with stem cells, I imagine that our source of stem cells is really limited.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 110,
  "permalink": "/r/askscience/comments/vkhtix/if_somatic_cells_can_only_divide_up_to_the/",
  "subreddit": "askscience",
  "id": "vkhtix",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I know not all cell types divide that frequently, but some like skin cells\ndivide daily. It seems that it would not be that long before all skin cells have\nreached the Hayflick limit and eventually our skin will cease to function.\n\nEven if we replace skin cells with stem cells, I imagine that our…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "すべての種類の細胞がそれほど頻繁に分裂するわけではないことは知っているが、皮膚細胞のようなものもある。\n毎日分裂しています。すべての皮膚細胞がヘイフリック限界に達するのはそう遠くないと思われます。\nヘイフリック限界に達し、やがて我々の皮膚は機能しなくなる。\n\n皮膚細胞を幹細胞で置き換えたとしても、私たちの...",
      "title": "もし体細胞がヘイフリック限界までしか分裂できないのなら、人はどうやって数十年以上生きることができるのだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道不是所有的细胞类型都能如此频繁地进行分裂，但有些细胞如皮肤细胞\n每天都在分裂。看来，用不了多久，所有的皮肤细胞都会达到海弗里克的极限。\n达到Hayflick极限，最终我们的皮肤将停止运作。\n\n即使我们用干细胞取代皮肤细胞，我想我们的...",
      "title": "如果体细胞只能分裂到Hayflick极限，人的寿命怎么会超过几十年？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道不是所有的細胞類型都能如此頻繁地進行分裂，但有些細胞如皮膚細胞\n每天都在分裂。看來，用不了多久，所有的皮膚細胞都會達到海弗裏克的極限。\n達到Hayflick極限，最終我們的皮膚將停止運作。\n\n即使我們用幹細胞取代皮膚細胞，我想我們的...",
      "title": "如果體細胞只能分裂到Hayflick極限，人的壽命怎麼會超過幾十年？"
    }
  ]
}