{
  "author": "Natolx",
  "original_created_utc": 1657896516,
  "title": "Is there a reason your own \"young\" bone marrow couldn't put in storage for an immune system \"restoration\" when you are older?",
  "created_utc": 1657905871,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It seems a reasonable hypothesis that a portion of the &amp;quot;problems&amp;quot; with an aging immune system come from aging stem cells in your bone marrow.&lt;/p&gt;\n\n&lt;p&gt;Obviously bone marrow extraction is very painful, but other than that hurdle, is there some reason I am not seeing that storing your own bone marrow on LN2 for later wouldn&amp;#39;t be a way to restore the &amp;quot;youth&amp;quot; of your immune system later on in life?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 123,
  "permalink": "/r/askscience/comments/vzqik5/is_there_a_reason_your_own_young_bone_marrow/",
  "subreddit": "askscience",
  "id": "vzqik5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "It seems a reasonable hypothesis that a portion of the \"problems\" with an aging\nimmune system come from aging stem cells in your bone marrow.\n\nObviously bone marrow extraction is very painful, but other than that hurdle, is\nthere some reason I am not seeing that storing your own bone marrow on LN2…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "加齢に伴う免疫系の「問題」の一部は、体内の幹細胞の老化に起因するという仮説は妥当と思われます。\n骨髄にある幹細胞の老化が原因であるという仮説は妥当だと思います。\n\n骨髄採取は非常に痛いのですが、そのハードルを除けば、何か理由があるのでしょうか？\n自分の骨髄をLN2上に保存するというのは、何か理由があるのでしょうか...？",
      "title": "自分の「若い」骨髄を、年をとってからの免疫系の「修復」のために保存しておくことができない理由があるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这似乎是一个合理的假设，即老化的 \"问题 \"有一部分来自于你体内的干细胞老化。\n免疫系统的部分 \"问题 \"来自于骨髓中老化的干细胞。\n\n显然，提取骨髓是非常痛苦的，但除了这个障碍外，是否有什么原因我没有看到存储自己的骨髓？\n有什么原因，我没有看到将自己的骨髓储存在LN2上...",
      "title": "有什么理由你自己的 \"年轻 \"骨髓不能储存起来以便在你年老时 \"恢复 \"免疫系统？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這似乎是一個合理的假設，即老化的 \"問題 \"有一部分來自於你體內的幹細胞老化。\n免疫系統的部分 \"問題 \"來自於骨髓中老化的幹細胞。\n\n顯然，提取骨髓是非常痛苦的，但除了這個障礙外，是否有什麼原因我沒有看到存儲自己的骨髓？\n有什麼原因，我沒有看到將自己的骨髓儲存在LN2上...",
      "title": "有什麼理由你自己的 \"年輕 \"骨髓不能儲存起來以便在你年老時 \"恢復 \"免疫系統？"
    }
  ]
}