{
  "author": "wcbhkids",
  "the_new_excerpt": "I'm passive investor with 5% of my portfolio in Emerging Markets (index). I've\nbeen thinking lately that it's not really worth it to invest in these stocks.\nEmerging market economies may indeed enjoy higher level of GDP growth than\ndeveloped economies, but their corporate governance is substandard,…",
  "original_created_utc": 1615503794,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我是被动型投资者，我的投资组合中有5%是新兴市场（指数）。我已经\n最近一直在想，投资这些股票真的不值得。\n新兴市场经济体的GDP增长水平可能确实比美国、加拿大、澳大利亚、新西兰等国家高。\n发达经济体，但其公司治理不达标，...",
      "title": "新兴市场和指数投资"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是被動型投資者，我的投資組合中有5%是新興市場（指數）。我已經\n最近一直在想，投資這些股票真的不值得。\n新興市場經濟體的GDP增長水平可能確實比美國、加拿大、澳大利亞、新西蘭等國家高。\n發達經濟體，但其公司治理不達標，...",
      "title": "新興市場和指數投資"
    }
  ],
  "title": "Emerging Markets and Index Investing",
  "created_utc": 1615512700,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m passive investor with 5% of my portfolio in Emerging Markets (index). I&#39;ve been thinking lately that it&#39;s not really worth it to invest in these stocks. Emerging market economies may indeed enjoy higher level of GDP growth than developed economies, but their corporate governance is substandard, corruption may be rampant, and the rule of law inconsistent. The result is that much of that growth is captured by insiders rather than by the public investors at large.</p>\n\n<p>While the market is undoubtedly aware of the problems and presumably takes them into account when setting prices, I&#39;m not confident the market can accurately price in unknown information (for example, we don&#39;t really know what goes on in China). Emerging Mkts is pehaps one of the few areas where active management makes sense. Indexing assumes the market is efficient, that assumption may not be true in some emerging markets.</p>\n\n<p>I feel index investors are better off focusing exclusively on the US and other developed markets where we will get a fair shake. Large corporations like MCD and Coke already have exposure to emerging markets, and unlike locally traded shares, their financials are not suspect.</p>\n</div><!-- SC_ON -->",
  "score": 410,
  "permalink": "/r/investing/comments/m339dm/emerging_markets_and_index_investing/",
  "subreddit": "investing",
  "id": "m339dm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147379955
}