{
  "author": "Stompya",
  "original_created_utc": 1654641693,
  "title": "List of Crypto subs sorted by number of members (Updated)",
  "created_utc": 1654677143,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is a list of the top crypto subreddits I found that are dedicated to one coin or token.  I thought checking the community size on Reddit would be interesting since a common piece of advice when evaluating a currency / token is to check the community it has supporting it.&lt;/p&gt;\n\n&lt;p&gt;I pulled most of these currencies from the top 50 on CoinMarketCap and the listing of Specific Coin Subreddits from the sidebar here.  If it looks familiar, I submitted this as a Google Sheets link yesterday but was told people would prefer not to click links.  Hopefully this comes out legible.&lt;/p&gt;\n\n&lt;p&gt;Data is current as of June 7, 2022. Stablecoin and Exchange communities are included although they may not fit perfectly in this list, but I found it interesting to know anyway. Hope some of you do too!&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/t9z6491k1a491.png?width=1018&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=76552e18b21948f27238601fd8762d524c38d9cf\"&gt;https://preview.redd.it/t9z6491k1a491.png?width=1018&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=76552e18b21948f27238601fd8762d524c38d9cf&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 317,
  "permalink": "/r/CryptoCurrency/comments/v7a0qp/list_of_crypto_subs_sorted_by_number_of_members/",
  "subreddit": "CryptoCurrency",
  "id": "v7a0qp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "This is a list of the top crypto subreddits I found that are dedicated to one\ncoin or token. I thought checking the community size on Reddit would be\ninteresting since a common piece of advice when evaluating a currency / token is\nto check the community it has supporting it.\n\nI pulled most of these…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは、私が見つけた、あるコインやトークンに特化したトップクラスの暗号サブレディッツのリストです。\nコインやトークンに特化しています。Redditでコミュニティの規模を確認するのは面白いと思います。\n通貨やトークンを評価する際によく言われるのが、その通貨やトークンをサポートしているコミュニティを確認することです。\nその通貨やトークンを評価する際の一般的なアドバイスは、その通貨をサポートしているコミュニティを確認することです。\n\nこれらのほとんどは...",
      "title": "Cryptoサブスクリプション一覧（会員数順）（更新済"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是我发现的顶级加密货币分论坛的列表，这些分论坛专门讨论一种\n币或代币。我认为检查Reddit上的社区规模将是\n因为在评估一种货币/代币时，一个常见的建议是\n检查支持它的社区。\n\n我拉出了这些社区中的大多数。",
      "title": "按成员数量排序的加密子系统列表（已更新）"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是我發現的頂級加密貨幣分論壇的列表，這些分論壇專門討論一種\n幣或代幣。我認爲檢查Reddit上的社區規模將是\n因爲在評估一種貨幣/代幣時，一個常見的建議是\n檢查支持它的社區。\n\n我拉出了這些社區中的大多數。",
      "title": "按成員數量排序的加密子系統列表（已更新）"
    }
  ]
}