{
  "author": "Stompya",
  "original_created_utc": 1654641693,
  "title": "List of Crypto subs sorted by number of members (Updated)",
  "created_utc": 1654677143,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is a list of the top crypto subreddits I found that are dedicated to one coin or token.  I thought checking the community size on Reddit would be interesting since a common piece of advice when evaluating a currency / token is to check the community it has supporting it.&lt;/p&gt;\n\n&lt;p&gt;I pulled most of these currencies from the top 50 on CoinMarketCap and the listing of Specific Coin Subreddits from the sidebar here.  If it looks familiar, I submitted this as a Google Sheets link yesterday but was told people would prefer not to click links.  Hopefully this comes out legible.&lt;/p&gt;\n\n&lt;p&gt;Data is current as of June 7, 2022. Stablecoin and Exchange communities are included although they may not fit perfectly in this list, but I found it interesting to know anyway. Hope some of you do too!&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/t9z6491k1a491.png?width=1018&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=76552e18b21948f27238601fd8762d524c38d9cf\"&gt;https://preview.redd.it/t9z6491k1a491.png?width=1018&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=76552e18b21948f27238601fd8762d524c38d9cf&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 317,
  "permalink": "/r/CryptoCurrency/comments/v7a0qp/list_of_crypto_subs_sorted_by_number_of_members/",
  "subreddit": "CryptoCurrency",
  "id": "v7a0qp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "This is a list of the top crypto subreddits I found that are dedicated to one\ncoin or token. I thought checking the community size on Reddit would be\ninteresting since a common piece of advice when evaluating a currency / token is\nto check the community it has supporting it.\n\nI pulled most of these…"
}