{
  "author": "dieTotenHosenFortuna",
  "original_created_utc": 1638516089,
  "title": "No town squares outside the \"west\": why is that?",
  "created_utc": 1638538398,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This only hit me when I was driving through Turkey&amp;#39;s Cappadocia region: town after town &lt;strong&gt;without  a single  town square&lt;/strong&gt;. We were driving and trying to find where  these towns center were located (we&amp;#39;d guess a town square), but we simply failed to find one. &lt;/p&gt;\n\n&lt;p&gt;Even in Istanbul there are no really important squares -- like Taksim square is located in an important area, but it does not have the role of the of squares elsewhere in Europe or in the Americas. &lt;/p&gt;\n\n&lt;p&gt;More examples: in Yogyakarta (city in Java, Muslim-majority Indonesian Island), people hang out in the sidewalks instead of squares, because there aren&amp;#39;t any. Same for Japan: towns have parks, but no squares.&lt;/p&gt;\n\n&lt;p&gt;Does anyone know why there are no squares  outside the &amp;quot;west&amp;quot;, as in the main place  where where town folks socialize?&lt;/p&gt;\n\n&lt;p&gt;Ancient Rome cities had a Forum, the area where people socialized and may be analogous to a town square. But Ancient Rome extended way over Turkey, where I could not find town squares.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s really odd, because from Canada to Argentina, and in Europe, every small town has a square with a bar and church, and it&amp;#39;s where people socialize.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 108,
  "permalink": "/r/AskHistorians/comments/r7tf4t/no_town_squares_outside_the_west_why_is_that/",
  "subreddit": "AskHistorians",
  "id": "r7tf4t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This only hit me when I was driving through Turkey's Cappadocia region: town\nafter town without a single town square. We were driving and trying to find\nwhere these towns center were located (we'd guess a town square), but we simply\nfailed to find one.\n\nEven in Istanbul there are no really…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "トルコのカッパドキア地方を車で走ったとき、初めて実感しました。\n町の広場がひとつもない町が次から次へと。私たちは車を走らせながら\nその町の中心はどこなのか（町の広場があると思われる）。\n見つからない。\n\nイスタンブールでさえも、本当に...",
      "title": "西」以外の街の広場がないのは、なぜですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当我开车经过土耳其的卡帕多西亚地区时，我才意识到这一点：一个又一个的城镇没有一个城镇广场。\n一个又一个的小镇，没有一个城镇广场。我们一边开车一边试图找到\n这些城镇中心的位置（我们猜测是一个城镇广场），但我们根本没有找到\n没有找到。\n\n即使在伊斯坦布尔，也没有真正...",
      "title": "在 \"西部 \"之外没有城镇广场：这是为什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當我開車經過土耳其的卡帕多西亞地區時，我才意識到這一點：一個又一個的城鎮沒有一個城鎮廣場。\n一個又一個的小鎮，沒有一個城鎮廣場。我們一邊開車一邊試圖找到\n這些城鎮中心的位置（我們猜測是一個城鎮廣場），但我們根本沒有找到\n沒有找到。\n\n即使在伊斯坦布爾，也沒有真正...",
      "title": "在 \"西部 \"之外沒有城鎮廣場：這是爲什麼？"
    }
  ]
}