{
  "author": "teampsyduck",
  "original_created_utc": 1640536468,
  "title": "Advice on buying $100k in ETH",
  "created_utc": 1640547098,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Basically, I have $100k I want to invest into ETH within the next 4 months and want to hold for it for at least 6+ months. How would you recommend I go about this? To move that much money without problems and keep it safe.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Background: I&amp;#39;m pretty new to crypto, and I&amp;#39;ve been following and researching crypto for the past two months. In that time, I&amp;#39;ve only done 1 buy and sell order. I have a good idea of how I want to do this, but I want some input from the community dropping that much money down. Thanks!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 202,
  "permalink": "/r/CryptoCurrency/comments/rp0cgn/advice_on_buying_100k_in_eth/",
  "subreddit": "CryptoCurrency",
  "id": "rp0cgn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Basically, I have $100k I want to invest into ETH within the next 4 months and\nwant to hold for it for at least 6+ months. How would you recommend I go about\nthis? To move that much money without problems and keep it safe.\n\n\n\nBackground: I'm pretty new to crypto, and I've been following and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "基本的に、私は今後4ヶ月以内にETHに投資したい10万ドルを持っており\n最低でも6ヶ月以上保有したい。どのようにしたらいいでしょうか？\nこれは？それだけのお金を問題なく動かし、安全に保管するために。\n\n\n\n背景を教えてください。私は暗号の初心者ですが、今までフォローして...",
      "title": "ETHを10万ドル購入する際のアドバイス"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "基本上，我有10万美元，我想在未来4个月内投资到ETH，并且\n希望至少持有6个月以上。你建议我如何进行\n这一点？要想顺利转移这么多钱并保证其安全。\n\n\n\n背景。我对加密货币很陌生，我一直在关注和...",
      "title": "关于购买10万美元ETH的建议"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "基本上，我有10萬美元，我想在未來4個月內投資到ETH，並且\n希望至少持有6個月以上。你建議我如何進行\n這一點？要想順利轉移這麼多錢並保證其安全。\n\n\n\n背景。我對加密貨幣很陌生，我一直在關注和...",
      "title": "關於購買10萬美元ETH的建議"
    }
  ]
}