{
  "author": "f3lix735",
  "the_new_excerpt": "So today all of a sudden Nokia reaches every reddit front page, even multiple\nposts. What makes me even more suspicious is the amount of awards they got, we\nknow how rare they are here, but every Nokia post here got them and even got\nmostly the same.\n\nIt is really scarry, I think hedges realised the…",
  "original_created_utc": 1611624652,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "所以今天突然间诺基亚达到了每一个reddit的首页，甚至多个\n员额： 更让我怀疑的是他们获得的奖项数量，我们\n知道他们在这里是多么的稀少，但每一个诺基亚的帖子在这里得到了他们，甚至得到了。\n大部分都是一样的。\n\n实在是伤痕累累，我想对冲意识到了... ...",
      "title": "诺基亚抽水机"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以今天突然間諾基亞達到了每一個reddit的首頁，甚至多個\n員額： 更讓我懷疑的是他們獲得的獎項數量，我們\n知道他們在這裏是多麼的稀少，但每一個諾基亞的帖子在這裏得到了他們，甚至得到了。\n大部分都是一樣的。\n\n實在是傷痕累累，我想對沖意識到了... ...",
      "title": "諾基亞抽水機"
    }
  ],
  "title": "Nokia pump (by hedgefunds I think)",
  "created_utc": 1611633399,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So today all of a sudden Nokia reaches every reddit front page, even multiple posts. What makes me even more suspicious is the amount of awards they got, we know how rare they are here, but every Nokia post here got them and even got mostly the same.</p>\n\n<p>It is really scarry, I think hedges realised the amount of money floating around these subs and now want to take it from us or just benefit from it. Look at the Nokia Chart, went parabolic last friday with high volume. The accounts of the posters also look super suspicious.</p>\n\n<p>Maybe this is testing the water for them and the worst is yet to come, but this is a good reminder to never trust someone blindly. I hope mods can do something about it.</p>\n\n<p>Edit: Thanks for the awards (am I suspicous now? :D)</p>\n\n<p>I did not want to say that Nokia has to be a bad investment, just that this pump was very suspicious. If you want to buy Nokia listen to some counter points in the comments and compare them to other 5G players like Ericsson.</p>\n</div><!-- SC_ON -->",
  "score": 1054,
  "permalink": "/r/stocks/comments/l52yrt/nokia_pump_by_hedgefunds_i_think/",
  "subreddit": "stocks",
  "id": "l52yrt",
  "is_self": true,
  "media": null,
  "is_video": false
}