{
  "author": "sillyhands1",
  "the_new_excerpt": "Hello Everyone,\n\nWhile I hope you all make tons of money today, remember that is important to\nalso give back. As a commitment to this I pledge that if PLTR reaches $40 by the\nend of the week, I will donate $500 and upload proof (obviously). I'm not rich\n(yet), or I would happily donate more. I hope…",
  "original_created_utc": 1611570906,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "大家好\n\n虽然我希望你们今天都能赚到大量的钱，但请记住，重要的是要\n也是一种回馈。作为承诺，我承诺，如果PLTR在年底前达到40美元。\n周末，我会捐出500美元，并上传证明（显然）。我不是有钱人\n(还没有)，否则我很乐意多捐一些。我希望...",
      "title": "如果PLTR在本周结束前达到40美元，我将捐出500美元给我选择的慈善机构。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好\n\n雖然我希望你們今天都能賺到大量的錢，但請記住，重要的是要\n也是一種回饋。作爲承諾，我承諾，如果PLTR在年底前達到40美元。\n週末，我會捐出500美元，並上傳證明（顯然）。我不是有錢人\n(還沒有)，否則我很樂意多捐一些。我希望...",
      "title": "如果PLTR在本週結束前達到40美元，我將捐出500美元給我選擇的慈善機構。"
    }
  ],
  "title": "I will donate $500 to a charity of my choice if PLTR reaches $40 by end of the week.",
  "created_utc": 1611599713,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello Everyone,</p>\n\n<p>While I hope you all make tons of money today, remember that is important to also give back. As a commitment to this I pledge that if PLTR reaches $40 by the end of the week, I will donate $500 and upload proof (obviously). I&#39;m not rich (yet), or I would happily donate more. I hope you guys enjoy your day and make lots of tendies.</p>\n\n<p>Thank you,</p>\n\n<p>SillyHands</p>\n\n<p>Positions: PLTR 02/05 32C</p>\n\n<p>Edit: We were close, but I believe we will still get there end of week (fingers crossed).</p>\n\n<p>2nd Edit: My donation will be going to a local fostering and adoptive service called embrella for everyone who is curious.</p>\n</div><!-- SC_ON -->",
  "score": 2795,
  "permalink": "/r/wallstreetbets/comments/l4lcit/i_will_donate_500_to_a_charity_of_my_choice_if/",
  "subreddit": "wallstreetbets",
  "id": "l4lcit",
  "is_self": true,
  "media": null,
  "is_video": false
}