{
  "author": "BTC_Hadzija",
  "the_new_excerpt": "Just so I could tell some people \"I told you so\" and they learn their lesson\nearly on.\n\nHowever, this is not a good way of thinking - when I go a bit deeper I really\nwant all my friends to make some good cash even though they made some risky\ninvestments.\n\nI missed the train, I shouldn't be sour…",
  "original_created_utc": 1620523634,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が「だから言ったじゃないか」と何人かの人に言うことで、彼らが早い段階で教訓を得ることができるからです。\nしかし、これは良い考え方ではありません。\n\nしかし、これは良い考え方ではありません。もう少し深く考えてみると、私は本当にすべての友人に\nしかし、これは良い考え方ではありません。\n投資をしたにもかかわらず。\n\n電車に乗り遅れてしまった、悲しむべきではない...。",
      "title": "私の中のエゴイストは、これらのミームコインが今夜、その価値の80％を失うことを望んでいます...。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "只是为了让我能够告诉一些人 \"我告诉过你\"，让他们尽早吸取教训。\n尽早吸取教训。\n\n然而，这并不是一种好的思维方式--当我深入一点时，我真的\n我希望我所有的朋友都能赚到一些好的现金，尽管他们做了一些有风险的\n投资。\n\n我错过了火车，我不应该酸溜溜的......",
      "title": "我心中的利己主义者希望这些纪念币今晚失去80%的价值......"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "只是爲了讓我能夠告訴一些人 \"我告訴過你\"，讓他們儘早吸取教訓。\n儘早吸取教訓。\n\n然而，這並不是一種好的思維方式--當我深入一點時，我真的\n我希望我所有的朋友都能賺到一些好的現金，儘管他們做了一些有風險的\n投資。\n\n我錯過了火車，我不應該酸溜溜的......",
      "title": "我心中的利己主義者希望這些紀念幣今晚失去80%的價值......"
    }
  ],
  "title": "The egoist in me wants these meme-coins to lose 80% of their value tonight...",
  "created_utc": 1620536046,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Just so I could tell some people &quot;I told you so&quot; and they learn their lesson early on. </p>\n\n<p>However, this is not a good way of thinking - when I go a bit deeper I really want all my friends to make some good cash even though they made some risky investments. </p>\n\n<p>I missed the train, I shouldn&#39;t be sour about it. I&#39;d love to go back a month and go all-in on Doge and cash out right now, but I can&#39;t - and I shouldn&#39;t feel bad about that.</p>\n\n<p>I&#39;d be no different than all the non-coiners waiting for &quot;the bubble to pop&quot; so that they can tell us the same &quot;I told you so&quot;. </p>\n\n<p>So anyways, whatever you&#39;re invested in right now, whether it&#39;s a meme coin or the must cutting-edge technology underappreciated crypto project, I hope you make it and have a prosperous future ahead.</p>\n</div><!-- SC_ON -->",
  "score": 1170,
  "permalink": "/r/CryptoCurrency/comments/n83d1h/the_egoist_in_me_wants_these_memecoins_to_lose_80/",
  "subreddit": "CryptoCurrency",
  "id": "n83d1h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985990898
}