{
  "author": "Haylettc",
  "the_new_excerpt": "So, this week I was reading about the decimation of the Australian Aboriginal\npopulation partially through disease and I was suddenly struck with a question\nthat seems kind of obvious, but which I'd never considered before.\n\nWhat was it about the \"mainland\" continent that made diseases from…",
  "original_created_utc": 1621733339,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今週、オーストラリアのアボリジニの人口が病気によって減少したことについて読んでいて\n疫病によって部分的に人口が減少しているという記事を読んでいて、ある疑問に突然襲われました。\n当然のことのように思えますが、今まで考えたこともありませんでした。\n\n本土」と呼ばれる大陸の何が病気を...",
      "title": "なぜヨーロッパ人はアメリカやアボリジニの疫病に苦しめられなかったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，本周我在阅读关于澳大利亚原住民部分因疾病而消亡的文章时\n我突然想到了一个问题。\n这个问题似乎很明显，但我以前从未考虑过。\n\n究竟是什么原因使 \"大陆 \"的疾病来自于澳大利亚？",
      "title": "为什么欧洲人没有遭受美洲或原住民的瘟疫之苦？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，本週我在閱讀關於澳大利亞原住民部分因疾病而消亡的文章時\n我突然想到了一個問題。\n這個問題似乎很明顯，但我以前從未考慮過。\n\n究竟是什麼原因使 \"大陸 \"的疾病來自於澳大利亞？",
      "title": "爲什麼歐洲人沒有遭受美洲或原住民的瘟疫之苦？"
    }
  ],
  "title": "Why Didn't Europeans Suffer from American or Aboriginal Plagues?",
  "created_utc": 1621773817,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So, this week I was reading about the decimation of the Australian Aboriginal population partially through disease and I was suddenly struck with a question that seems kind of obvious, but which I&#39;d never considered before.</p>\n\n<p>What was it about the &quot;mainland&quot; continent that made diseases from Europe massively devastating to the people of the Americas (and Aboriginals and others), while no diseases were brought back to Europe which really wreaked any havoc?</p>\n\n<p>Given that Europeans would have been just as unexposed to American diseases as Native Americans were to European diseases, why was the resultant devastation so different? I&#39;ve read a decent bit about American history at this point and know that it&#39;s popularly believed that 80-90% of Native Americans were wiped out by plague.</p>\n\n<p>It just doesn&#39;t make sense that there wouldn&#39;t even be a ripple of something similar in Europe as Natives were taken back as slaves and Europeans returned from abroad. What am I missing?</p>\n\n<p>Edit: Parentheses portion added</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/AskHistorians/comments/nix23u/why_didnt_europeans_suffer_from_american_or/",
  "subreddit": "AskHistorians",
  "id": "nix23u",
  "is_self": true,
  "media": null,
  "is_video": false
}