{
  "author": "wesass",
  "the_new_excerpt": "For almost a month I have not checked crypto prices and I have barely been on\nReddit. You know what happened?\n\nNothing really. I mean I spent more time playing with my kids, went on dates\nwith my wife and even went golfing with my parents. I have always planned on\njust hodling but always felt…",
  "original_created_utc": 1622847011,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この1ヶ月間、私は暗号の価格をチェックしていませんでしたし、Redditにもほとんど行っていません。\nRedditを見ていました。何が起こったか分かりますか？\n\n特に何もありません。つまり、子供と遊んだり、妻とデートしたり、両親とゴルフに行ったりする時間が増えました。\n妻とデートしたり、両親とゴルフに行ったりしました。私はいつも、ただホドリングするつもりでした。\nただホドホドにしておこうと思っていたのですが、いつも...。",
      "title": "止めた"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "近一个月来，我没有检查加密货币的价格，我几乎没有上过\nReddit. 你知道发生了什么吗？\n\n真的没什么。我的意思是，我花了更多的时间与我的孩子玩，与我的妻子约会\n和我妻子约会，甚至和我父母去打高尔夫。我一直计划在\n但总觉得......。",
      "title": "我停止了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "近一個月來，我沒有檢查加密貨幣的價格，我幾乎沒有上過\nReddit. 你知道發生了什麼嗎？\n\n真的沒什麼。我的意思是，我花了更多的時間與我的孩子玩，與我的妻子約會\n和我妻子約會，甚至和我父母去打高爾夫。我一直計劃在\n但總覺得......。",
      "title": "我停止了"
    }
  ],
  "title": "I stopped",
  "created_utc": 1622858461,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For almost a month I have not checked crypto prices and I have barely been on Reddit. You know what happened?  </p>\n\n<p>Nothing really. I mean I spent more time playing with my kids, went on dates with my wife and even went golfing with my parents. I have always planned on just hodling but always felt compelled to check so often in fear of missing the next great coin or a dip/spike so great I had to buy or sell. You should all try it. </p>\n\n<p>That’s all nothing important sorry for wasting your time.</p>\n</div><!-- SC_ON -->",
  "score": 558,
  "permalink": "/r/CryptoCurrency/comments/nshon3/i_stopped/",
  "subreddit": "CryptoCurrency",
  "id": "nshon3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404881319
}