{
  "author": "realJonas",
  "original_created_utc": 1653398395,
  "title": "Why do people romanticise mental illness so much on TikTok?",
  "created_utc": 1653414476,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’ve been housebound for six years because of mental illness. Seeing people on TikTok saying they have it too, but having their hair and makeup done perfectly while recording themselves making jokes about it, makes me feel really uncomfortable. It’s like they’re happy to have it and show it off like a badge of honour. I might be wrong and this could be a form of gatekeeping, but it just feels weird to me.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 117,
  "permalink": "/r/TooAfraidToAsk/comments/uwqo4e/why_do_people_romanticise_mental_illness_so_much/",
  "subreddit": "TooAfraidToAsk",
  "id": "uwqo4e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’ve been housebound for six years because of mental illness. Seeing people on\nTikTok saying they have it too, but having their hair and makeup done perfectly\nwhile recording themselves making jokes about it, makes me feel really\nuncomfortable. It’s like they’re happy to have it and show it off…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "心の病で6年間家に引きこもっています。TikTokで、自分もそうだと言っている人たちを見るのは\nTikTokで、自分もそうだと言いながら、ヘアメイクもばっちりで、冗談を言いながら記録している人を見ると、本当にそうだと思います。\n自分もそうだと言いながら、ヘアメイクもばっちりで、冗談を言いながら録画している人を見ると、本当に嫌な気持ちになります。\n不快なんです。持っていることを喜んでアピールしているような...。",
      "title": "なぜTikTokでは精神疾患をロマンチックに扱うのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因为精神疾病，我已经在家里呆了6年了。看到人们在\n看到人们在TikTok上说他们也有精神疾病，但他们的头发和妆容都做得很完美\n但他们的头发和妆容却做得很完美，同时还在录制自己的笑话，这让我感到非常\n感到不舒服。就像他们很高兴有这个病，并炫耀它......",
      "title": "为什么人们在TikTok上如此浪漫地看待精神疾病？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因爲精神疾病，我已經在家裏呆了6年了。看到人們在\n看到人們在TikTok上說他們也有精神疾病，但他們的頭髮和妝容都做得很完美\n但他們的頭髮和妝容卻做得很完美，同時還在錄製自己的笑話，這讓我感到非常\n感到不舒服。就像他們很高興有這個病，並炫耀它......",
      "title": "爲什麼人們在TikTok上如此浪漫地看待精神疾病？"
    }
  ]
}