{
  "author": "PsychologicalMotor31",
  "original_created_utc": 1648572687,
  "title": "Is there a name for this kind of humor?",
  "created_utc": 1648609825,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’ve recently discovered that some of my favorite humor is when people take a word and then make a funny joke about a word that sounds similar but is ridiculous/obscure in the context. &lt;/p&gt;\n\n&lt;p&gt;Like for example I just saw a joke on here… people talking were about abortion and someone comments “my buddy’s an abortionist and he’s really a good guy. Knows everything about trees and helped me landscaped my backyard.”&lt;/p&gt;\n\n&lt;p&gt;Like I love that lmao. Is there a name for this or a subreddit? I guess maybe this is just punny/dad jokes? But it’s different. It’s like when people purposely misunderstand what you’re saying then take the conversation in a different direction that just makes no sense but is silly. Anyways I think you get the point. Any help?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 111,
  "permalink": "/r/NoStupidQuestions/comments/tr8jko/is_there_a_name_for_this_kind_of_humor/",
  "subreddit": "NoStupidQuestions",
  "id": "tr8jko",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’ve recently discovered that some of my favorite humor is when people take a\nword and then make a funny joke about a word that sounds similar but is\nridiculous/obscure in the context.\n\nLike for example I just saw a joke on here… people talking were about abortion\nand someone comments “my buddy’s…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、私が好きなユーモアは、人々が嘲笑するときであることを発見しました。\nという言葉を使って、似たような言葉でも面白い冗談を言う。\n文脈の中で馬鹿にされている、あるいは不明瞭である。\n\n例えば、ここでジョークを見たんですが、人々が中絶について話していました。\nというコメントがあり、「私の相棒は...」というコメントがありました。",
      "title": "このようなユーモアの名称はあるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近发现，我最喜欢的一些幽默是当人们把一个词\n词，然后对一个听起来很相似但在上下文中却很可笑/不明显的词开个玩笑。\n荒谬的/模糊的上下文。\n\n例如，我刚刚在这里看到一个笑话......人们谈论的是堕胎问题\n有人评论说：\"我朋友的......\"。",
      "title": "这种幽默有一个名字吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近發現，我最喜歡的一些幽默是當人們把一個詞\n詞，然後對一個聽起來很相似但在上下文中卻很可笑/不明顯的詞開個玩笑。\n荒謬的/模糊的上下文。\n\n例如，我剛剛在這裏看到一個笑話......人們談論的是墮胎問題\n有人評論說：\"我朋友的......\"。",
      "title": "這種幽默有一個名字嗎？"
    }
  ]
}