{
  "author": "BooBeef",
  "the_new_excerpt": "About 1 and 1/2 weeks ago I posted DD explaining why I speculated that EA’s\nshare value was over priced and would likely see pull back. Over the past 4 days\nEA’s share value has fallen 5.25% from its Monday high to its Friday close\n(though it’s price had dropped further then this during the…",
  "original_created_utc": 1624073275,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "約1週間半前、私はDDを投稿し、EAの株価が割高だと推測した理由を説明しました。\nの株価は割高であり、引け目を感じるだろうと推測した理由を説明したDDを掲載しました。この4日間で\nEAの株価は月曜日の高値から金曜日の終値まで5.25％下落しました。\nこの4日間でEAの株価は月曜日の高値から金曜日の終値まで5.25％下落しました。",
      "title": "エレクトロニック・アーツ（EA）のプットポジションのフォローアップ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大约一个半星期前，我发布了DD，解释我为什么猜测EA的\n股价定价过高，可能会出现回调。在过去的4天里\nEA的股价从周一的高点到周五的收盘价已经下跌了5.25%。\n(尽管它的价格在这段时间内进一步下跌。)",
      "title": "对我的电子艺界（EA）看跌头寸的跟进"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大約一個半星期前，我發佈了DD，解釋我爲什麼猜測EA的\n股價定價過高，可能會出現回調。在過去的4天裏\nEA的股價從週一的高點到週五的收盤價已經下跌了5.25%。\n(儘管它的價格在這段時間內進一步下跌。)",
      "title": "對我的電子藝界（EA）看跌頭寸的跟進"
    }
  ],
  "title": "A follow up to my Electronic Arts (EA) put position",
  "created_utc": 1624136030,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>About 1 and 1/2 weeks ago I posted DD explaining why I speculated that EA’s share value was over priced and would likely see pull back. Over the past 4 days EA’s share value has fallen 5.25% from its Monday high to its Friday close (though it’s price had dropped further then this during the week)</p>\n\n<p>Wednesday I sold my position for a realized gain of +77% (my position was worth over 100% during the dip last week after the source code hack news came out)</p>\n\n<p>Thanks for all of the helpful feedback and constructive criticism on my original post, it was very insightful!</p>\n</div><!-- SC_ON -->",
  "score": 45,
  "permalink": "/r/investing/comments/o372z8/a_follow_up_to_my_electronic_arts_ea_put_position/",
  "subreddit": "investing",
  "id": "o372z8",
  "is_self": true,
  "media": null,
  "is_video": false
}