{
  "author": "samdane7777",
  "original_created_utc": 1645243315,
  "title": "I underestimated Crypto Reddit",
  "created_utc": 1645263333,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This subreddit, and frankly reddit, and the people who come on reddit, are too anti-libertarian, too anti-cypher punk, too anti-convoy, and too pro-KYC, you make mental gymnastics that cannot be sustained coherently with crypto, it endangers the industry and the intended point of the technology, such government powers will absolutely be used on you in the future by your political opponents, only a fool would get rid of due process and allow this type of financial surveillance, but of course 20 year old progressives are predictably fools.&lt;/p&gt;\n\n&lt;p&gt;Punk 6529 made a post on twitter that got 20,000 upvotes about why the precedent Trudeau is setting is completely dangerous and unsustainable, and he did it without being bias towards the truckers. I deeply underestimated how progressive crypto reddit is. The core developers, core exchange CEO, and entire fintwitter and crypto twitter are drastically more conservative and libertarian than this, and virtually all of the infrastructure they have built is to attempt to slow down the government, any government for that matter from behaving the way in which Trudeau is now doing, &lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;yet here I see 600 comments on a thread with 1200 upvotes by someone going &amp;quot;Hey maybe Banks having this power is a bad idea&amp;quot; -- 600 comments defending KYC, defending CeFi, defending Pfizer, defending Ciphertrace &amp;amp; Chainanalysis &amp;amp; Elliptic, and defending Banks engaging in this behavior, and your willingness to trust the administrative state to not backdoor your crypto without due process, despite you literally defending the abrogation of due process. It makes me sick to my stomach. &lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;The intention of crypto was Monero, and specifically the separation of state and money, not to recreate Web 2 on chain, with thought crimes and Black Mirror surveillance like China, on chain, not for your stupid pumpanomics, not for your willingness to comply with these insanely censorious regulations that merely recreate the entire SWIFT system and US Sanctions Regime onchain, which they by the way use to do extremely imperialist, racist things on the regular. You people are utter fools.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 329,
  "permalink": "/r/CryptoCurrency/comments/sw0y2d/i_underestimated_crypto_reddit/",
  "subreddit": "CryptoCurrency",
  "id": "sw0y2d",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "This subreddit, and frankly reddit, and the people who come on reddit, are too\nanti-libertarian, too anti-cypher punk, too anti-convoy, and too pro-KYC, you\nmake mental gymnastics that cannot be sustained coherently with crypto, it\nendangers the industry and the intended point of the technology,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブレディットも、率直に言ってレディットも、レディットに来る人たちも、あまりにも\n反リバタリアン、反サイファーパンク、反コンボイ、反KYCで、あなたは\n暗号で首尾一貫して維持することができない頭の体操をする、それは\n業界や技術の狙いを危うくする...。",
      "title": "Crypto Redditを甘く見ていました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这个子版块，坦率地说，reddit，以及来到reddit的人，都太\n反自由主义者，反水晶朋克，反叛徒，支持KYC。\n你做的精神体操是无法用加密货币连贯起来的，它\n危害行业和技术的预期点，...",
      "title": "我低估了Crypto Reddit"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個子版塊，坦率地說，reddit，以及來到reddit的人，都太\n反自由主義者，反水晶朋克，反叛徒，支持KYC。\n你做的精神體操是無法用加密貨幣連貫起來的，它\n危害行業和技術的預期點，...",
      "title": "我低估了Crypto Reddit"
    }
  ]
}