{
  "author": "ISOlatedLens",
  "original_created_utc": 1637539879,
  "title": "StoneToss (political cartoonist who enjoys offending) launched his NFTs yesterday. They sold out in 22 minutes, OpenSea banned the collection within the first 6 hours after 100eth+ transactions had occurred. Rarible just banned the collection in the past hour.",
  "created_utc": 1637581147,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m relatively new to NFTs but I have been involved in the crypto sphere for a little while now and politics is my actual day-job. Someone told me the comic book creator StoneToss is releasing NFTs and so I follow it closely because he is very popular among the people who share his views and extremely infamous among those who do not. There are several different large subs dedicated to altering his comics or just making fun of and attacking him.</p>\n\n<p>While his comics are offensive often, the apparently offensive thing that had his collections banned was supposedly confederate flags appearing in the NFTs which are randomly generated. </p>\n\n<p>This is crazy though... to see communities that pride themselves on being about decentralizing and allowing anyone to do transactions, not allowing an entire group because you dislike the creator or some of the content shouldn&#39;t be grounds for deplatforming.</p>\n\n<p>In my mind it takes away from the whole purpose of cryptocurrency at it&#39;s core. Marketplaces like Amazon will appear who are so large and backed by so many big dollar interests you need to be on them to stand a chance.</p>\n\n<p>I&#39;m not advocating for or against the NFTs or the artist, my job is just to cover the news. And this is news because it shows that your ideas aren&#39;t safe on platforms who disagree with you, not even your actual content.</p>\n\n<p>What are everyone else&#39;s thoughts about the situation?</p>\n\n<p><strong>UPDATED:</strong> It looks like Rarible caved and allowed them back on the marketplace as of this moment.</p>\n</div><!-- SC_ON -->",
  "score": 166,
  "permalink": "/r/CryptoCurrency/comments/qz880e/stonetoss_political_cartoonist_who_enjoys/",
  "subreddit": "CryptoCurrency",
  "id": "qz880e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm relatively new to NFTs but I have been involved in the crypto sphere for a\nlittle while now and politics is my actual day-job. Someone told me the comic\nbook creator StoneToss is releasing NFTs and so I follow it closely because he\nis very popular among the people who share his views and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はNFTについては比較的新しいですが、少し前から暗号分野に関わっています。\n私の本業は政治ですが、少し前から暗号分野に関わっています。ある人が、漫画家のStoneTossがNFTを公開していると教えてくれました。\nある人から、漫画家のStoneTossがNFTをリリースしていると聞いて、それをよく見ています。\n彼の意見に共感する人たちの間ではとても人気がありますからね。",
      "title": "StoneToss（怒らせるのが好きな政治漫画家）は、昨日NFTを発売しました。22分で完売し、OpenSeaは100回以上の取引が行われた後、最初の6時間でコレクションを禁止しました。Raribleはこの1時間でコレクションを禁止しました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我对NFTs比较陌生，但我已经参与加密货币领域有一段时间了。\n现在，政治是我真正的日常工作。有人告诉我，漫画\n有人告诉我，漫画家StoneToss正在发布NFTs，所以我密切关注，因为他\n他在与他观点相同的人中非常受欢迎，而且...",
      "title": "StoneToss（喜欢冒犯的政治漫画家）昨天推出了他的NFTs。他们在22分钟内就卖光了，OpenSea在100多笔交易发生后的前6个小时内禁止了这个收藏。Rarible在过去的一个小时里刚刚禁止了这个系列。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我對NFTs比較陌生，但我已經參與加密貨幣領域有一段時間了。\n現在，政治是我真正的日常工作。有人告訴我，漫畫\n有人告訴我，漫畫家StoneToss正在發佈NFTs，所以我密切關注，因爲他\n他在與他觀點相同的人中非常受歡迎，而且...",
      "title": "StoneToss（喜歡冒犯的政治漫畫家）昨天推出了他的NFTs。他們在22分鐘內就賣光了，OpenSea在100多筆交易發生後的前6個小時內禁止了這個收藏。Rarible在過去的一個小時裏剛剛禁止了這個系列。"
    }
  ]
}