{
  "author": "That-Attitude6308",
  "original_created_utc": 1638096639,
  "title": "“It’s dumb nerd money that nerds use to try to rip each other off” saw this at an anti-crypto forum. Are they right? Are we just here to just get rich? Or are we here to build a fair and equitable world?",
  "created_utc": 1638109829,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We can&#39;t blame them either most crypto investors are just people looking to get rich quick while pretending to care about the economic situation as a whole. Most crypto investors are no more concerned about the dire situation of the economy than the average person. For many of those investing in cryptocurrencies, the goal is simply to get rich, not to build a better world. If you are in this for building a better world there are a hundred things you can do alongside investing crypto. How many people here are doing that?</p>\n\n<p>Crypto was created to root out corruption and untrustworthy intermediaries and to give the power back to the people. I hope we go back to the roots of the movement.</p>\n\n<p>The greatest progressive movements the world has ever seen always came from small sections of people that thought differently from the majority. I hope we, as a group, will see beyond the money and this movement will steer us back on track and make the world a better place.</p>\n</div><!-- SC_ON -->",
  "score": 192,
  "permalink": "/r/CryptoCurrency/comments/r41r9i/its_dumb_nerd_money_that_nerds_use_to_try_to_rip/",
  "subreddit": "CryptoCurrency",
  "id": "r41r9i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "We can't blame them either most crypto investors are just people looking to get\nrich quick while pretending to care about the economic situation as a whole.\nMost crypto investors are no more concerned about the dire situation of the\neconomy than the average person. For many of those investing…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "彼らを責めることはできません。ほとんどの暗号投資家は、経済状況全体を気にするふりをしながら、手っ取り早く金持ちになりたいだけの人たちです。\n経済状況全体を気にしているふりをしながら、手っ取り早く金持ちになろうとしている人たちです。\nほとんどの暗号投資家は、経済の悲惨な状況を気にしていません。\nほとんどの暗号投資家は、平均的な人よりも経済の悲惨な状況を心配していません。投資家の多くは...",
      "title": "\"オタクがお互いを騙そうとするために使う、馬鹿なオタクの金だ\" 反暗号フォーラムで見た言葉です。彼らは正しいのだろうか？我々はただ金持ちになるためにここにいるのか？それとも、公正で公平な世界を築くためにいるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们也不能责怪他们，大多数加密货币投资者只是想快速致富的人。\n迅速致富，同时假装关心整个经济形势。\n大多数加密货币投资者并不比普通人更关心经济的严峻形势。\n比普通人更关心经济状况。对于许多投资...",
      "title": "\"这是书呆子的钱，书呆子用来试图撕毁对方的东西。\"在一个反加密货币的论坛上看到这句话。他们是对的吗？我们在这里只是为了发财吗？还是我们是来建立一个公平公正的世界？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們也不能責怪他們，大多數加密貨幣投資者只是想快速致富的人。\n迅速致富，同時假裝關心整個經濟形勢。\n大多數加密貨幣投資者並不比普通人更關心經濟的嚴峻形勢。\n比普通人更關心經濟狀況。對於許多投資...",
      "title": "\"這是書呆子的錢，書呆子用來試圖撕毀對方的東西。\"在一個反加密貨幣的論壇上看到這句話。他們是對的嗎？我們在這裏只是爲了發財嗎？還是我們是來建立一個公平公正的世界？"
    }
  ]
}