{
  "author": "DarthLukas71",
  "original_created_utc": 1630734471,
  "title": "It finally clicked",
  "created_utc": 1630755068,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was having a discussion with a fellow crypto bro and it finally clicked why this shit is so attractive.</p>\n\n<p>I’m the bank now.</p>\n\n<p>Unlike stocks or mutual funds, I am not only making the normal gains through price movements, but also by staking (lending) this asset to others to utilize either as capital.</p>\n\n<p>The code cannot be erased or bankrupted by a board of directors at some bank or a greedy fund manager. I’ll always have access to it through a generic wallet. A government can’t withhold the income or stop me from accessing it by sanction or mandate.</p>\n\n<p>I’m the only one who can really fuck it up.</p>\n\n<p>That’s some real power right there, boys and girls.</p>\n</div><!-- SC_ON -->",
  "score": 189,
  "permalink": "/r/CryptoCurrency/comments/phlvap/it_finally_clicked/",
  "subreddit": "CryptoCurrency",
  "id": "phlvap",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was having a discussion with a fellow crypto bro and it finally clicked why\nthis shit is so attractive.\n\nI’m the bank now.\n\nUnlike stocks or mutual funds, I am not only making the normal gains through\nprice movements, but also by staking (lending) this asset to others to utilize\neither as…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "仲間の暗号兄弟と議論していて、なぜこのような状況になったのかをようやく理解しました。\n魅力的なんだと\n\n今や私は銀行です。\n\n株やミューチュアル・ファンドと違って、私は値動きによって通常の利益を得るだけではありません。\n価格変動による通常の利益を得るだけでなく、この資産を他の人にステークして（貸して）、利用することができます。\nとして利用することができます。",
      "title": "やっとこさクリックしました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我和一个加密货币兄弟讨论了一下，终于明白了为什么\n这玩意这么有吸引力。\n\n我现在就是银行。\n\n与股票或共同基金不同，我不仅通过价格变动获得正常收益，而且还通过押注（贷款）获得收益。\n价格变动，而且还通过押注（借出）这种资产给其他人，以利用\n或者作为...",
      "title": "它终于点击了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我和一個加密貨幣兄弟討論了一下，終於明白了爲什麼\n這玩意這麼有吸引力。\n\n我現在就是銀行。\n\n與股票或共同基金不同，我不僅通過價格變動獲得正常收益，而且還通過押注（貸款）獲得收益。\n價格變動，而且還通過押注（借出）這種資產給其他人，以利用\n或者作爲...",
      "title": "它終於點擊了"
    }
  ]
}