{
  "author": "Kemizon",
  "original_created_utc": 1646814420,
  "title": "Why do people spend thousands of dollars on a new traditional (not electric) piano when there are 10s of thousands of FREE traditional pianos out there that owners are desperate to give away?",
  "created_utc": 1646835511,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;If you look on the Facebook marketplace or just do an easy google search you can find full-sized traditional pianos that people give to you at no cost. All you have to do is go and get it! And the bonus to these free pianos is that they have rich history versus the new ones that... well have no history. Imagine getting a free piano that is 150 years old! The things it has seen and the places it has been!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/NoStupidQuestions/comments/ta3an6/why_do_people_spend_thousands_of_dollars_on_a_new/",
  "subreddit": "NoStupidQuestions",
  "id": "ta3an6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "If you look on the Facebook marketplace or just do an easy google search you can\nfind full-sized traditional pianos that people give to you at no cost. All you\nhave to do is go and get it! And the bonus to these free pianos is that they\nhave rich history versus the new ones that... well have no…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Facebookのマーケットプレイスや、Googleで簡単に検索してみると\nフルサイズの伝統的なピアノを無償で譲り受けることができます。あなたは\nは、それを取りに行くだけです。そして、このような無料のピアノの特典は、そのピアノが\n新しいものに比べて、歴史がある...いや、ない...",
      "title": "なぜ人々は新しい伝統的なピアノ（電気ピアノではない）に何千ドルも費やすのでしょうか。そこには何万台もの無料の伝統的なピアノがあり、所有者は必死に手放そうとしているのに。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你在Facebook市场上寻找，或者只是做一个简单的谷歌搜索，你可以\n你可以找到全尺寸的传统钢琴，人们会免费送给你。你所要做的\n你要做的就是去得到它! 而这些免费钢琴的好处是，它们\n有着丰富的历史，而新的钢琴......没有......。",
      "title": "为什么人们要花数千美元购买一架新的传统钢琴（而不是电动钢琴），而外面有数万架免费的传统钢琴，主人不顾一切地要把它们送出去？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你在Facebook市場上尋找，或者只是做一個簡單的谷歌搜索，你可以\n你可以找到全尺寸的傳統鋼琴，人們會免費送給你。你所要做的\n你要做的就是去得到它! 而這些免費鋼琴的好處是，它們\n有着豐富的歷史，而新的鋼琴......沒有......。",
      "title": "爲什麼人們要花數千美元購買一架新的傳統鋼琴（而不是電動鋼琴），而外面有數萬架免費的傳統鋼琴，主人不顧一切地要把它們送出去？"
    }
  ]
}