{
  "author": "GeneReddit123",
  "original_created_utc": 1645207601,
  "title": "In 1956, the Soviet Union crushed the Hungarian Revolution with 30,000 troops. In 1968, the Warsaw Pact had to use nearly 500,000 troops to invade Czechoslovakia during the Prague Spring. Why such a big discrepancy to stop what ostensibly was a \"softer\" revolution in 1968 than 1956?",
  "created_utc": 1645221269,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The Hungarian Revolution was a &amp;quot;harder&amp;quot; revolution, in the sense of overthrowing the government and desiring to leave the Soviet sphere of influence completely. Yet about 30,000 Soviet troops and KGB agents were able to suppress the revolt, inflicting massive casualties (over 3,000). &lt;/p&gt;\n\n&lt;p&gt;By comparison, the 1968 invasion of Czechoslovakia was a Bloc-wide affair, with up to 500,000 total troops (250,000 of which came from the USSR), despite it being a &amp;quot;softer&amp;quot; situation: Czechoslovakia only wanted internal reforms rather than to fully depart the Bloc, revolutionaries didn&amp;#39;t overthrow the government, Czechoslovakian troops didn&amp;#39;t formally engage the invaders, and about 150 people died - 5% as few as the amount of casualties in Hungary in 1956.&lt;/p&gt;\n\n&lt;p&gt;Why did the Soviet Union manage to crush Hungary with so much fewer troops; or, conversely, why did they use such an overwhelming force on comparatively tiny Czechoslovakia in 1968? Was it a show of force, either to other Warsaw Pact members (unity against dissent) or to the Western powers against the backdrop of the Cold War and a potential conflict in Western Europe? Was it an attempt to use overwhelming force projection to stop a more active Hungary-style revolution before it started? Is the higher troop number causally linked with a lower number of casualties compared to Hungary due to the above deterrent effect?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/svodlo/in_1956_the_soviet_union_crushed_the_hungarian/",
  "subreddit": "AskHistorians",
  "id": "svodlo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The Hungarian Revolution was a \"harder\" revolution, in the sense of overthrowing\nthe government and desiring to leave the Soviet sphere of influence completely.\nYet about 30,000 Soviet troops and KGB agents were able to suppress the revolt,\ninflicting massive casualties (over 3,000).\n\nBy…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ハンガリー革命は、打倒ハンガリーという意味で、「よりハードな」革命であった。\nソビエトの勢力圏から完全に離れることを望んでいた。\nしかし、約3万人のソ連軍とKGBのエージェントが反乱を鎮圧することができた。\n3,000人以上の死傷者を出した。\n\nその結果...",
      "title": "1956年、ソ連はハンガリー革命を3万人の軍隊で鎮圧した。1968年、ワルシャワ条約機構はプラハの春でチェコスロバキアに侵攻するために50万人近い軍隊を使わなければならなかった。表向きは1956年よりも「ソフト」な革命を1968年に止めるのに、なぜこれほど大きな差が生じたのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "匈牙利革命是一场 \"更艰难 \"的革命，即推翻政府并希望完全脱离苏联的影响。\n政府，并希望完全脱离苏联的影响范围。\n然而，大约3万名苏联军队和克格勃特工能够镇压这次起义。\n造成了巨大的伤亡（超过3000人）。\n\n通过...",
      "title": "1956年，苏联用30,000名军队粉碎了匈牙利革命。1968年，在 \"布拉格之春 \"期间，华沙条约组织不得不动用近50万军队来入侵捷克斯洛伐克。为什么在1968年阻止表面上比1956年 \"柔和 \"的革命会有如此大的差异？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "匈牙利革命是一場 \"更艱難 \"的革命，即推翻政府並希望完全脫離蘇聯的影響。\n政府，並希望完全脫離蘇聯的影響範圍。\n然而，大約3萬名蘇聯軍隊和克格勃特工能夠鎮壓這次起義。\n造成了巨大的傷亡（超過3000人）。\n\n通過...",
      "title": "1956年，蘇聯用30,000名軍隊粉碎了匈牙利革命。1968年，在 \"布拉格之春 \"期間，華沙條約組織不得不動用近50萬軍隊來入侵捷克斯洛伐克。爲什麼在1968年阻止表面上比1956年 \"柔和 \"的革命會有如此大的差異？"
    }
  ]
}