{
  "author": "Natsirk99",
  "original_created_utc": 1634574945,
  "title": "Males raised by single moms, what did you learn later in life that you wished she’d have taught you?",
  "created_utc": 1634589481,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My husband died unexpectedly in May. I’m now attempting to raise our 9yr old son and 6yr old daughter by filling in for his role as well.</p>\n\n<p>My husband’s dad died early in his life and he was raised by his mom. He shared a story of how a teacher had to explain to him he didn’t need to pull his pants down to his ankles when he used the urinal.</p>\n\n<p>So I ask, men &amp; boys, what did you learn later in life and you wished your mom had explained to you?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/NoStupidQuestions/comments/qaqd7e/males_raised_by_single_moms_what_did_you_learn/",
  "subreddit": "NoStupidQuestions",
  "id": "qaqd7e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My husband died unexpectedly in May. I’m now attempting to raise our 9yr old son\nand 6yr old daughter by filling in for his role as well.\n\nMy husband’s dad died early in his life and he was raised by his mom. He shared\na story of how a teacher had to explain to him he didn’t need to pull his…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "5月に夫が突然亡くなりました。今は、9歳の息子と6歳の娘を育てるために\n歳の息子と6歳の娘を育てています。\n\n夫は早くに父を亡くし、母に育てられました。彼は\n先生から「引っ張らなくてもいいんだよ」と説明されたという話をしていましたが...。",
      "title": "シングルマザーに育てられた男性は、後になって「この人に教えてもらいたかった」と思うことはありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的丈夫在五月意外去世。我现在正试图抚养我们9岁的儿子和6岁的女儿。\n和6岁的女儿，同时也要代替他的角色。\n\n我丈夫的父亲很早就去世了，他是由他母亲抚养长大的。他分享了\n一个故事，一个老师不得不向他解释，他不需要拉他的手。",
      "title": "由单亲妈妈抚养长大的男性，你在后来的生活中学到了什么，你希望她能教你？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的丈夫在五月意外去世。我現在正試圖撫養我們9歲的兒子和6歲的女兒。\n和6歲的女兒，同時也要代替他的角色。\n\n我丈夫的父親很早就去世了，他是由他母親撫養長大的。他分享了\n一個故事，一個老師不得不向他解釋，他不需要拉他的手。",
      "title": "由單親媽媽撫養長大的男性，你在後來的生活中學到了什麼，你希望她能教你？"
    }
  ]
}