{
  "author": "madlad50",
  "the_new_excerpt": "SoFi is a phenomenal combination of debt investing/management, retail trading\nplatform, and fin-tech. They are pending to get their bank charter right now,\nand if approved will be in your standard commercial bank offering as well. As I\nsee it, they are the new age of finance. They are a company I…",
  "original_created_utc": 1621905937,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "SoFiは、債権投資・管理、リテール取引プラットフォーム、フィンテックを組み合わせた驚異的な企業です。\nプラットフォーム、そしてフィンテックの驚異的な組み合わせです。SoFiは現在、銀行免許の取得を申請中です。\n承認されれば、通常の商業銀行としてのサービスも提供することになります。私が思うに\n私が思うに、彼らは金融の新時代だと思います。彼らは、私が...",
      "title": "SoFi ($IPOE)は長期的に見ても優れている"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "SoFi是债务投资/管理、零售交易平台和金融技术的惊人组合。\n平台，以及金融科技。他们现在正在等待获得银行执照。\n如果获得批准，也将成为标准的商业银行产品。正如我\n在我看来，他们是金融的新时代。他们是一家公司，我...",
      "title": "SoFi（$IPOE）是一个伟大的长期游戏"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "SoFi是債務投資/管理、零售交易平臺和金融技術的驚人組合。\n平臺，以及金融科技。他們現在正在等待獲得銀行執照。\n如果獲得批准，也將成爲標準的商業銀行產品。正如我\n在我看來，他們是金融的新時代。他們是一家公司，我...",
      "title": "SoFi（$IPOE）是一個偉大的長期遊戲"
    }
  ],
  "title": "SoFi ($IPOE) is a great long-term play",
  "created_utc": 1621931041,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>SoFi is a phenomenal combination of debt investing/management, retail trading platform, and fin-tech. They are pending to get their bank charter right now, and if approved will be in your standard commercial bank offering as well. As I see it, they are the new age of finance. They are a company I think we will be referring to as one of the big banking players in 5-7 years. I invested a while ago but surprised to not see more talk about it here with the official vote and ticker change coming very soon.</p>\n</div><!-- SC_ON -->",
  "score": 45,
  "permalink": "/r/stocks/comments/nkdpq6/sofi_ipoe_is_a_great_longterm_play/",
  "subreddit": "stocks",
  "id": "nkdpq6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197389736
}