{
  "author": "Mediocre-Age-5346",
  "the_new_excerpt": "While I was studying for my Finance 101 course I came to the realization that\nwhen Melvin Capital had GME at 4$, most likely their risk models made it look\nlike it was a sure bet to drive GameStop to bankruptcy. Not only did they not\naccount for the tsunami of smooth-brains YOLOing FD's,…",
  "original_created_utc": 1611692284,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "当我在学习金融101课程时，我意识到了。\n当Melvin Capital将GME定价为4美元时，很可能是他们的风险模型让它看起来像。\n就像它是一个肯定的赌注 驱动GameStop破产。他们不仅没有\n帐户的海啸顺利脑YOLOing FD的，... ...",
      "title": "WSB单枪匹马重构了风险管理模式"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當我在學習金融101課程時，我意識到了。\n當Melvin Capital將GME定價爲4美元時，很可能是他們的風險模型讓它看起來像。\n就像它是一個肯定的賭注 驅動GameStop破產。他們不僅沒有\n帳戶的海嘯順利腦YOLOing FD的，... ...",
      "title": "WSB單槍匹馬重構了風險管理模式"
    }
  ],
  "title": "WSB Has Singlehandedly Restructured Risk Management Models",
  "created_utc": 1611716881,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>While I was studying for my Finance 101 course I came to the realization that when Melvin Capital had GME at 4$, most likely their risk models made it look like it was a sure bet to drive GameStop to bankruptcy. Not only did they not account for the tsunami of smooth-brains YOLOing FD&#39;s, (spearheaded by big dick big brain ape kings like DFV) they&#39;re going bankrupt for it.</p>\n\n<p>From this day forth, every hedgefund (especially ones that short) will have to account for the Retard Factor ™. There will always be the risk of the Robinhood Autists taking their Little Johns to tendietown!</p>\n\n<p>I for one can&#39;t wait to see it in retard Jr&#39;s finance textbook in the future.</p>\n\n<p>Positions: 270 Shares @ 14.48</p>\n</div><!-- SC_ON -->",
  "score": 17019,
  "permalink": "/r/wallstreetbets/comments/l5mloj/wsb_has_singlehandedly_restructured_risk/",
  "subreddit": "wallstreetbets",
  "id": "l5mloj",
  "is_self": true,
  "media": null,
  "is_video": false
}