{
  "author": "trashcanhanson",
  "the_new_excerpt": "It’s so weird. For example: If my gf is crying because something bad happened, I\nfeel sad but I don’t feel the need to cry. If I listen to music and hear an old\nsong of a Disney movie like Tarzan I could cry like a freaking baby. Or if I\nwatch a sad scene in a show or read it in a book/comic it’s…",
  "original_created_utc": 1624025876,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "すごく変なんです。例えばですよ。彼女が何か悪いことがあって泣いていたら、私は悲しいと思います。\n悲しいと思うけど、泣きたいとは思わない。音楽を聴いていて、ディズニー映画の古い曲を聴いていたら\n音楽を聴いていて、Tarzanのようなディズニー映画の古い曲を聴くと、赤ちゃんのように泣いてしまいます。または\n番組で悲しいシーンを見たり、本や漫画で読んだりすると...。",
      "title": "現実の悲しい状況では泣けないのに、フィクションの中の懐かしさや悲劇的な場面などの理由で簡単に泣けるのは普通のことなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这真是太奇怪了。比如说。如果我的女朋友因为发生了不好的事情而哭，我就会\n我感到悲伤，但我不觉得有必要哭。如果我听音乐，听到一首迪斯尼电影的老歌\n如果我听音乐，听到像《泰山》这样的迪斯尼电影的老歌，我就会哭得像个婴儿。或者如果我\n看一个节目中的悲伤场景或在书/漫画中读到它，它就会......",
      "title": "在现实生活中遇到伤心事不哭，但由于怀旧和小说中的悲惨时刻等原因却能轻易落泪，这是否正常？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這真是太奇怪了。比如說。如果我的女朋友因爲發生了不好的事情而哭，我就會\n我感到悲傷，但我不覺得有必要哭。如果我聽音樂，聽到一首迪斯尼電影的老歌\n如果我聽音樂，聽到像《泰山》這樣的迪斯尼電影的老歌，我就會哭得像個嬰兒。或者如果我\n看一個節目中的悲傷場景或在書/漫畫中讀到它，它就會......",
      "title": "在現實生活中遇到傷心事不哭，但由於懷舊和小說中的悲慘時刻等原因卻能輕易落淚，這是否正常？"
    }
  ],
  "title": "Is it normal to not to cry in a sad real life situation but being able to cry easily due to reasons like nostalgia and tragic moments in fiction?",
  "created_utc": 1624041192,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It’s so weird. For example: If my gf is crying because something bad happened, I feel sad but I don’t feel the need to cry. \nIf I listen to music and hear an old song of a Disney movie like Tarzan I could cry like a freaking baby. Or if I watch a sad scene in a show or read it in a book/comic it’s like a knife in the heart sometimes.\nI guess if something really really bad happens irl I will cry ofc but it’s so strange for me that ‚Son of man‘ turns my eyes into waterfalls.</p>\n</div><!-- SC_ON -->",
  "score": 327,
  "permalink": "/r/TooAfraidToAsk/comments/o2q55n/is_it_normal_to_not_to_cry_in_a_sad_real_life/",
  "subreddit": "TooAfraidToAsk",
  "id": "o2q55n",
  "is_self": true,
  "media": null,
  "is_video": false
}