{
  "author": "cryptofreak194",
  "original_created_utc": 1629893211,
  "title": "Unpopular opinion: You got scammed out of your crypto? Good.",
  "created_utc": 1629927044,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There’s sooo many posts on here that warn people about all kinds of different scams where I can only shake my head in disbelief to think that some people are actually falling for this…and I know this makes me an asshole but I genuinely DONT feel bad for these people. </p>\n\n<p>I mean you joined a <strong>Telegram</strong> group that promised you 5000x on some random ass coin that nobody ever heard of? </p>\n\n<p>You actually think that YOU, an <strong>average Joe</strong>, have found the one hidden gem that’s gonna make you rich? </p>\n\n<p>You actually thought that you could send a <strong>STRANGER</strong> your crypto and he would send twice the amount back?</p>\n\n<p>You thought it would be a good idea to enter the “access code” to your money into a random ass website? </p>\n\n<p>You are the problem. Yes, I’m aware that there are cases where somebody is just really unlucky, but the majority of scams are founded on people’s stupidity, change my mind.</p>\n\n<p>EDIT: Given the amount of feedback I need to clarify that I am obviously NOT pro-scamming people. However, I stand by my point that we don’t have to sugarcoat things all the time. Life ain’t always fair and some need to learn it the hard way.</p>\n</div><!-- SC_ON -->",
  "score": 200,
  "permalink": "/r/CryptoCurrency/comments/pb9vl3/unpopular_opinion_you_got_scammed_out_of_your/",
  "subreddit": "CryptoCurrency",
  "id": "pb9vl3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "There’s sooo many posts on here that warn people about all kinds of different\nscams where I can only shake my head in disbelief to think that some people are\nactually falling for this…and I know this makes me an asshole but I genuinely\nDONT feel bad for these people.\n\nI mean you joined a Telegram…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここには、様々な種類の詐欺について人々に警告する多くの投稿があります。\n詐欺に引っかかる人がいると思うと、信じられなくて首をかしげるばかりです。\n騙されてしまう人がいると思うと、信じられない気持ちでいっぱいです。\nその人たちに申し訳ないとは思いません。\n\nつまり、あなたはテレグラムに参加して...",
      "title": "不評な意見 暗号を騙し取られた？いいですね。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这里有太多的帖子警告人们有各种不同的\n骗局，我只能摇头表示不相信，认为有些人真的是\n我知道这让我成为一个混蛋，但我真的不为这些人感到难过。\n我知道这使我成为一个混蛋，但我真的不为这些人感到难过。\n\n我的意思是，你加入了一个Telegram...",
      "title": "不受欢迎的意见。你被骗走了你的加密货币？很好。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這裏有太多的帖子警告人們有各種不同的\n騙局，我只能搖頭表示不相信，認爲有些人真的是\n我知道這讓我成爲一個混蛋，但我真的不爲這些人感到難過。\n我知道這使我成爲一個混蛋，但我真的不爲這些人感到難過。\n\n我的意思是，你加入了一個Telegram...",
      "title": "不受歡迎的意見。你被騙走了你的加密貨幣？很好。"
    }
  ]
}