{
  "author": "NoNameIsAvailable1",
  "original_created_utc": 1654702167,
  "title": "I keep watching a streamer I don't particularly enjoy because I'm her only streamer. Is this stupid or should I keep going?",
  "created_utc": 1654715788,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;She&amp;#39;s not boring, there are just a million things I&amp;#39;d prefer watching. However, I&amp;#39;m her only viewer, and I wanna give her more motivation to keep going, as she seems to really enjoy this. I can&amp;#39;t figure out if this is morally wrong or not - it&amp;#39;s a lie in a way, but one that helps. Should I keep going?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 117,
  "permalink": "/r/TooAfraidToAsk/comments/v7san0/i_keep_watching_a_streamer_i_dont_particularly/",
  "subreddit": "TooAfraidToAsk",
  "id": "v7san0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "She's not boring, there are just a million things I'd prefer watching. However,\nI'm her only viewer, and I wanna give her more motivation to keep going, as she\nseems to really enjoy this. I can't figure out if this is morally wrong or not -\nit's a lie in a way, but one that helps. Should I keep…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "彼女はつまらなくはない。ただ、私が見たいものが山ほどあるだけだ。でもね。\n私は彼女の唯一の視聴者であり、彼女が本当に楽しんでいるように見えるので、続けるためのモチベーションをもっと与えたいのです。\n本当に楽しんでいるように見える。これが道徳的に悪いことなのか、そうでないのか、よくわからない。\nある意味、嘘なんだけど、役に立つんだよね。このままでよいのでしょうか...。",
      "title": "特に面白くもないストリーマーを見続けているのは、彼女の唯一のストリーマーだからだ。これはバカなのか、それとも続けた方がいいのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "她并不无聊，只是有无数的事情我更愿意看。然而。\n我是她唯一的观众，我想给她更多的动力来继续下去，因为她\n她似乎真的很喜欢这个。我不知道这在道德上是否是错误的 --\n这在某种程度上是个谎言，但却有帮助。我是否应该继续...",
      "title": "我一直在看一个我并不特别喜欢的流媒体，因为我是她唯一的流媒体。这是不是很愚蠢，或者我应该继续下去？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "她並不無聊，只是有無數的事情我更願意看。然而。\n我是她唯一的觀衆，我想給她更多的動力來繼續下去，因爲她\n她似乎真的很喜歡這個。我不知道這在道德上是否是錯誤的 --\n這在某種程度上是個謊言，但卻有幫助。我是否應該繼續...",
      "title": "我一直在看一個我並不特別喜歡的流媒體，因爲我是她唯一的流媒體。這是不是很愚蠢，或者我應該繼續下去？"
    }
  ]
}