{
  "author": "randfyld",
  "original_created_utc": 1632305434,
  "title": "This is why you should not take advice from random redditors",
  "created_utc": 1632321189,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The past few days the subreddit was flooding with predictions on how crypto will dump because of the whole Evergrande drama.</p>\n\n<p>&quot;Get ready for big dips&quot;, &quot; you should buy the dip but not now&quot; and many other posts were spreading FUD. The funny thing is that when the chinese market actually opened, crypto not only did not went down, but it went up! Apparently Evergrande has reached an agreement (as if the chinese government would ever let them go bankrupt..)</p>\n\n<p>Nobody can predict the market. Nobody knows shit about fuck. Make your own research, invest in good project and in long term you will probably be fine. In short term nobody knows what will happen!</p>\n</div><!-- SC_ON -->",
  "score": 257,
  "permalink": "/r/CryptoCurrency/comments/pt4d7p/this_is_why_you_should_not_take_advice_from/",
  "subreddit": "CryptoCurrency",
  "id": "pt4d7p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The past few days the subreddit was flooding with predictions on how crypto will\ndump because of the whole Evergrande drama.\n\n\"Get ready for big dips\", \" you should buy the dip but not now\" and many other\nposts were spreading FUD. The funny thing is that when the chinese market\nactually opened,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここ数日、サブレディットでは、「Which」という言葉のせいで暗号がどのように暴落するかという予測が氾濫していました。\nEvergrandeのドラマのせいで、cryptoがどのように下落するかの予測であふれていました。\n\n\"Get ready for big dips\", \"you should buy the dip but not now\" など、多くの投稿がFUDを広めていました。\nといった投稿がFUDを広めていました。面白いことに、中国の市場が実際に開いたとき、...\n笑えるのは、中国の市場が実際に開かれたとき、...",
      "title": "これが、ランダムなredditorsからのアドバイスを受けてはいけない理由です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在过去的几天里，subreddit上充斥着关于加密货币将如何\n因为整个恒大事件而抛售。\n\n\"为大跌做好准备\"，\"你应该买入跌停板，但不是现在 \"以及许多其他\n帖子都在散布恐惧症。有趣的是，当中国市场\n实际开盘时，...",
      "title": "这就是为什么你不应该听从随机红客的建议"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在過去的幾天裏，subreddit上充斥着關於加密貨幣將如何\n因爲整個恆大事件而拋售。\n\n\"爲大跌做好準備\"，\"你應該買入跌停板，但不是現在 \"以及許多其他\n帖子都在散佈恐懼症。有趣的是，當中國市場\n實際開盤時，...",
      "title": "這就是爲什麼你不應該聽從隨機紅客的建議"
    }
  ]
}