{
  "author": "fan_of_hakiksexydays",
  "original_created_utc": 1653410436,
  "title": "Refuting the latest anti-Bitcoin list of points from r/buttcoin (the anti-Bitcoin sub).",
  "created_utc": 1653428518,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Recently, &lt;a href=\"/r/buttcoin\"&gt;r/buttcoin&lt;/a&gt; posted a list of all the main problems they have with Bitcoin and crypto.&lt;/p&gt;\n\n&lt;p&gt;It kind of looked like it could be their manifesto:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://np.reddit.com/r/Buttcoin/comments/uvz90h/to_the_rbitcoiners_that_keep_coming_to_this_sub/\"&gt;https://np.reddit.com/r/Buttcoin/comments/uvz90h/to_the_rbitcoiners_that_keep_coming_to_this_sub/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;(Please, remember Reddit&amp;#39;s rules, and don&amp;#39;t go brigade it).&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll cover each point here, objectively and rationally.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;1.No Intrinsic Value: You can tell whether or not something has  “intrinsic value”, by seeing where it fits in Maslow’s Hierarchy of  Needs.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Intrinsic value is always a tricky one, since there is no clear cut definition of &amp;quot;intrinsic value&amp;quot;. I always thought when it comes to tech, value comes from the problems it can solve. So software can have intrinsic value.&lt;/p&gt;\n\n&lt;p&gt;But going by OP&amp;#39;s definition about intrinsic value having to do with filling our basic needs, of acquiring food shelter etc...Isn&amp;#39;t that what money does? It pays for those things?&lt;/p&gt;\n\n&lt;p&gt;And crypto is money, and arguably, the way money should have been done from the beginning.&lt;/p&gt;\n\n&lt;p&gt;Even in Mesopotamia, they realized coins, seashells, gold, wasn&amp;#39;t what money was really about. It&amp;#39;s really about the ledger.&lt;/p&gt;\n\n&lt;p&gt;Keeping track of how money interacts, and who has what. All in one efficient place.&lt;/p&gt;\n\n&lt;p&gt;They started using tablets to keep track of transactions, who owed what, how much, etc... It was the ancestor to banking.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/atmcpvjvag191.jpg?width=522&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=bb3fc540b94e5d71e3f9f0ec4634088bcc38c88f\"&gt;Ancestor to the blockchain: 5,000 years ago, the Mesopotamian ledger created an indisputable record of transactions, instead of using money.&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Today, our money has really become all digital, and about the ledger again.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s a computer accounting system.&lt;/p&gt;\n\n&lt;p&gt;When we transfer money from our HSBC account to our credit card, then to the vendor on Amazon who sold us our lube, it&amp;#39;s all electronic and on a ledger.&lt;/p&gt;\n\n&lt;p&gt;HSBC doesn&amp;#39;t send a truck of cash to Amazon.&lt;/p&gt;\n\n&lt;p&gt;But that system is still inefficient, has too many parties and different companies involved in the process. With too many weak links. Poor security. Too many IOUs instead of real transactions. And having so many different elements you have to trust. Along with the employees in each company.&lt;/p&gt;\n\n&lt;p&gt;My credit card number is going through so many hands.&lt;/p&gt;\n\n&lt;p&gt;This is where crypto comes in. It takes out all the weak links, that complicated inefficient system, and most of all, removes the issue of always having to trust so many people.&lt;/p&gt;\n\n&lt;p&gt;The only thing between my money, and the guy who sells me lube, is a blockchain controlled by a decentralized consensus, and cryptography.&lt;/p&gt;\n\n&lt;p&gt;Seem like the system we were meant to have since the days of Mesopotamia, but didn&amp;#39;t have the technology yet.&lt;/p&gt;\n\n&lt;p&gt;At the end of the day, you can make the argument for both intrinsic and non-intrinsic.&lt;/p&gt;\n\n&lt;p&gt;You can say there&amp;#39;s no intrinsic value, if you keep the definition more narrow, and not include tech or software as solutions or having any value. And with a more narrow definition, I can agree that at the very least, intrinsic value is not strong.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;2.Useless “Tech”:  Blockchain is not innovative tech, it was inefficient and outdated the  day “Satoshi” created it and is even more so now, over a decade later.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s a bit overlooking the hundreds of companies around the world already adopting blockchain technology.&lt;/p&gt;\n\n&lt;p&gt;Check out what IBM is doing for instance, and tell me if you think it&amp;#39;s useless: &lt;a href=\"https://www.ibm.com/topics/hyperledger\"&gt;https://www.ibm.com/topics/hyperledger&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;With smart contracts, you can now code anything you want and have it protected by not only cryptography, but a decentralized consensus system.&lt;/p&gt;\n\n&lt;p&gt;You can use blockchain to ensure anything from information, to scientific research, to legal contracts, are not corrupted, and remove centralized consensus.&lt;/p&gt;\n\n&lt;p&gt;And it&amp;#39;s not just blockchain. It&amp;#39;s cryptocurrencies. They&amp;#39;re not limited to just solving money problems, they can also be used to help create better systems for supply chains, like with VeChains for example.&lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s a quick summary of how it works:&lt;a href=\"https://www.youtube.com/watch?v=__yfks8BK2A\"&gt;https://www.youtube.com/watch?v=__yfks8BK2A&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;If you value decentralized consensus, traceability, efficiency, speed, reduced cost, being able to chose either strong transparency or strong anonymity, and security, then blockchain is something you&amp;#39;ll find valuable.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/0oofbs51bg191.jpg?width=1022&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=3d5dc102a5323c770a78072e759d75fb71363587\"&gt;https://preview.redd.it/0oofbs51bg191.jpg?width=1022&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=3d5dc102a5323c770a78072e759d75fb71363587&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;3.Overly Complicated: Crypto is too complicated, slow and inefficient to  ever be used for anything. Your mom and grandparents WILL NEVER USE A  STSTEM where they need to remember a complicated seed phrase and  password and&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You don&amp;#39;t actually have to memorize your seed phrase. But you have the extra option to, which can let you cross borders with your money in your brain.&lt;/p&gt;\n\n&lt;p&gt;My dad is in his 70s, and not only uses crypto, but trades it.&lt;/p&gt;\n\n&lt;p&gt;Back before 2019, when I still used my local crypto ATM, I asked the guy in the shop what kind of people used the ATM. And he said that surprisingly, a lot of people are grandmas buying Bitcoin as a gift.&lt;/p&gt;\n\n&lt;p&gt;Of course, all this is anecdotal. But this is no different than people saying email was too complicated to use, back in the 90s.&lt;/p&gt;\n\n&lt;p&gt;Now our grandparents are all using it.&lt;/p&gt;\n\n&lt;p&gt;In fact, setting up a wallet on your phone is as easy as setting up any other app. Setting up a Coinbase account is the same as setting up a new online bank account.&lt;/p&gt;\n\n&lt;p&gt;Making a transfer is as easy as copying and pasting an address or scanning a QR code.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;4.Pollution: Already mentioned, wasting real resources that could power  an entire country for a useless excel spreadsheet Ponzi scheme.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This one I agree is an issue that needs to be seriously addressed.&lt;/p&gt;\n\n&lt;p&gt;But things are going in the right direction. Increasingly more projects are going for proof of stake, instead of the heavy consuming proof of work. And Bitcoin miners are going for more energy efficient hardware, and try to use more renewable energy. They have to, it&amp;#39;s in their best interest to cut the cost.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;5.It’s a Scam:  You are caught up in a worldwide delusional Ponzi, MLM scam that is already collapsing and ruining millions of lives.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s partially true. Some of these crypto projects are straight up disgusting scams.&lt;/p&gt;\n\n&lt;p&gt;And on this sub, we always try to warn people about them.&lt;/p&gt;\n\n&lt;p&gt;Wherever there is money involved, people are gonna try to scam you.&lt;/p&gt;\n\n&lt;p&gt;Whether they try to phish for your seed phrase, or the entire project is a scam, as we&amp;#39;ve seen with everything from Bitconnect to Safemoon.&lt;/p&gt;\n\n&lt;p&gt;And some of the tech may not be a scam, but total jokes used to dupe people, like NFTs.&lt;/p&gt;\n\n&lt;p&gt;But things like Bitcoin, by definition, are not Ponzi scams. I explain why the term is incorrect in more details here:&lt;a href=\"https://np.reddit.com/r/CryptoCurrency/comments/u8rc0g/i_sometimes_see_people_call_bitcoin_a_ponzi/\"&gt;https://np.reddit.com/r/CryptoCurrency/comments/u8rc0g/i_sometimes_see_people_call_bitcoin_a_ponzi/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;What I think people try to say when they call it Ponzi, is it&amp;#39;s a greater fool scheme.&lt;/p&gt;\n\n&lt;p&gt;If you don&amp;#39;t believe Bitcoin has intrinsic value, then you can accurately say that it&amp;#39;s a greater fool scheme. Where you have an asset of no real underlying value, and you&amp;#39;re trying to find a greater idiot to buy it from you, for more than you paid for.&lt;/p&gt;\n\n&lt;p&gt;Of course, Ponzi sounds a lot more dramatic.&lt;/p&gt;\n\n&lt;p&gt;If you managed to get this far, thanks for for actually reading all this! I hope you learned something. Or it at least opened your mind to do a little more research.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 327,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/9hME-X9InWBIyW665hcfBhTHicKOXUelgVMHvkXxiOM.jpg?auto=webp&amp;s=e2ec23a63f26071f53bf04a7ae1138d1085b713a",
          "width": 3168,
          "height": 2113
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/9hME-X9InWBIyW665hcfBhTHicKOXUelgVMHvkXxiOM.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=b86d9e220ea13f8b8fb9823a4855d1836a73baba",
            "width": 108,
            "height": 72
          },
          {
            "url": "https://external-preview.redd.it/9hME-X9InWBIyW665hcfBhTHicKOXUelgVMHvkXxiOM.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=386a11eac9fecae888d0de7399075cf549012c43",
            "width": 216,
            "height": 144
          },
          {
            "url": "https://external-preview.redd.it/9hME-X9InWBIyW665hcfBhTHicKOXUelgVMHvkXxiOM.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=4ec883ed02c6f26674dab1cbdca69e95a030ba1b",
            "width": 320,
            "height": 213
          },
          {
            "url": "https://external-preview.redd.it/9hME-X9InWBIyW665hcfBhTHicKOXUelgVMHvkXxiOM.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=32ebf1250af715c69dfc8e16ebb6b00085d9b4df",
            "width": 640,
            "height": 426
          },
          {
            "url": "https://external-preview.redd.it/9hME-X9InWBIyW665hcfBhTHicKOXUelgVMHvkXxiOM.jpg?width=960&amp;crop=smart&amp;auto=webp&amp;s=a42fea0cc231a8a05f2fe95920261e17bdfcf577",
            "width": 960,
            "height": 640
          },
          {
            "url": "https://external-preview.redd.it/9hME-X9InWBIyW665hcfBhTHicKOXUelgVMHvkXxiOM.jpg?width=1080&amp;crop=smart&amp;auto=webp&amp;s=be598a14265cf0d8e1eb824177627bcac399d39d",
            "width": 1080,
            "height": 720
          }
        ],
        "variants": {},
        "id": "EgQkw85dB5xM_hpg9TvKRUGLpHRcLSGgjIDITtI_6J8"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/uwv2yv/refuting_the_latest_antibitcoin_list_of_points/",
  "subreddit": "CryptoCurrency",
  "id": "uwv2yv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Recently, r/buttcoin [/r/buttcoin] posted a list of all the main problems they\nhave with Bitcoin and crypto.\n\nIt kind of looked like it could be their manifesto:\n\nhttps://np.reddit.com/r/Buttcoin/comments/uvz90h/to_the_rbitcoiners_that_keep_coming_to_this_sub/\n\n(Please, remember Reddit's rules, and…"
}