{
  "author": "Swissy14",
  "the_new_excerpt": "I hear alot of times people use the words sexual tension. I'm wondering if this\nis real? Recently people have been saying that about me and this woman. We don't\nnecessarily know a ton about each other just stuff here and there we've heard\nfrom others we are close to. Yet we're both too stubborn and…",
  "original_created_utc": 1620226403,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "性的緊張という言葉をよく耳にします。私はこれが\n本当なのかな？最近、僕とある女性についてそう言われることがあるんだ。私たちは、必ずしも多くのことを知っているわけではありません。\n私たちは必ずしもお互いのことをたくさん知っているわけではなく、親しい人たちから聞いた話をあちこちでしているだけです。\n親しい人から聞いた話をあちこちでしているだけだ。それなのに、二人とも頑固で...。",
      "title": "好きではなさそうな二人の間に、性的緊張は存在するのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我听到很多时候人们使用性紧张这个词。我在想这是否\n是真的吗？最近人们一直在说我和这个女人的事。我们并不\n我们不一定知道对方的情况，只是在这里和那里听说了一些我们亲近的人的事情。\n从其他亲近的人那里听说的。然而，我们都太固执了，...",
      "title": "在两个似乎不喜欢对方的人之间，性紧张是一件真实的事情吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我聽到很多時候人們使用性緊張這個詞。我在想這是否\n是真的嗎？最近人們一直在說我和這個女人的事。我們並不\n我們不一定知道對方的情況，只是在這裏和那裏聽說了一些我們親近的人的事情。\n從其他親近的人那裏聽說的。然而，我們都太固執了，...",
      "title": "在兩個似乎不喜歡對方的人之間，性緊張是一件真實的事情嗎？"
    }
  ],
  "title": "Is sexual tension a real thing between two people who seem to not like each other?",
  "created_utc": 1620251342,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I hear alot of times people use the words sexual tension. I&#39;m wondering if this is real?  Recently people have been saying that about me and this woman. We don&#39;t necessarily know a ton about each other just stuff here and there we&#39;ve heard from others we are close to. Yet we&#39;re both too stubborn and prideful to actually to try and talk to each other. I know for a fact she&#39;s really attractive and I wouldn&#39;t mind getting to know her if she was willing to get to know me as well. I also get this weird and not good feeling about her almost in a negative way that makes me not want to like her or give her a chance. I also noticed thatam at times she gives me the cold shoulder or act like she doesn&#39;t see me. Then other times she like close by and does things to be noticed. Is this a case of sexual tension?</p>\n</div><!-- SC_ON -->",
  "score": 115,
  "permalink": "/r/TooAfraidToAsk/comments/n5hrxf/is_sexual_tension_a_real_thing_between_two_people/",
  "subreddit": "TooAfraidToAsk",
  "id": "n5hrxf",
  "is_self": true,
  "media": null,
  "is_video": false
}