{
  "author": "Sobersinc",
  "original_created_utc": 1632881353,
  "title": "El Salvador has started mining Bitcoin using the renewable energy from Volcanoes",
  "created_utc": 1632893434,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A government mining Bitcoin with clean volcanic energy. Am I dreaming? It’s incredible how ahead of everyone else President Bukele is. El Salvador is at a massive advantage as Bitcoin spreads across the world at an exponential pace. </p>\n\n<p>Most politicians are all talk and no action. So, pleasantly surprised. The rest of the world will understand the importance of this.</p>\n\n<p>The video of Bitcoin mining with volcanic energy was posted by president Nayib Bukele on Twitter. </p>\n\n<p>Here is the link: <a href=\"https://twitter.com/nayibbukele/status/1442949756993490945?s=09\">https://twitter.com/nayibbukele/status/1442949756993490945?s=09</a></p>\n\n<p>El Salvador moving towards being Richest country in the world.</p>\n\n<p>More adoptions are likely going to follow in future.</p>\n</div><!-- SC_ON -->",
  "score": 341,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/3uZviWY_bEt8ugiyzyvjrFAQFHcvWXoyDC9TGCMLtEw.jpg?auto=webp&s=7aa0200d44f6965f8cc19613d3c802140e1bec15",
          "width": 140,
          "height": 78
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/3uZviWY_bEt8ugiyzyvjrFAQFHcvWXoyDC9TGCMLtEw.jpg?width=108&crop=smart&auto=webp&s=7ede6f895b9a016c137cdf476b08583bf01660dc",
            "width": 108,
            "height": 60
          }
        ],
        "variants": {},
        "id": "tz5Y5AKwOZYCgUeswkR31qJcslc7b00Gi-VHkauAJW0"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/pxlioc/el_salvador_has_started_mining_bitcoin_using_the/",
  "subreddit": "CryptoCurrency",
  "id": "pxlioc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "A government mining Bitcoin with clean volcanic energy. Am I dreaming? It’s\nincredible how ahead of everyone else President Bukele is. El Salvador is at a\nmassive advantage as Bitcoin spreads across the world at an exponential pace.\n\nMost politicians are all talk and no action. So, pleasantly…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "クリーンな火山エネルギーでビットコインを採掘する政府。私は夢を見ているのでしょうか？驚くべきことに\nブケレ大統領は他の誰よりも先を行っています。エルサルバドルは\n世界中にビットコインが急激に広がる中、エルサルバドルは大きなアドバンテージを持っています。\n\nほとんどの政治家は口先だけで行動しません。だから、嬉しいことに...",
      "title": "エルサルバドルでは、火山の再生可能エネルギーを利用してビットコインの採掘を開始しました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "一个政府用清洁的火山能源开采比特币。我是在做梦吗？这真是\n令人难以置信的是，布克尔总统是多么领先于其他人。萨尔瓦多正处于一个\n随着比特币以指数级的速度在世界范围内传播，萨尔瓦多拥有巨大的优势。\n\n大多数政治家都是只说不做。所以，令人愉快的是...",
      "title": "萨尔瓦多已开始利用火山的可再生能源开采比特币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "一個政府用清潔的火山能源開採比特幣。我是在做夢嗎？這真是\n令人難以置信的是，布克爾總統是多麼領先於其他人。薩爾瓦多正處於一個\n隨着比特幣以指數級的速度在世界範圍內傳播，薩爾瓦多擁有巨大的優勢。\n\n大多數政治家都是隻說不做。所以，令人愉快的是...",
      "title": "薩爾瓦多已開始利用火山的可再生能源開採比特幣"
    }
  ]
}