{
  "author": "ComeHereDevilLog",
  "the_new_excerpt": "I sat here for a while trying to find a good way of asking this question. I\nwould imagine things could get sort of messy. Do you have to plan extra\ncarefully if you know you’re hooking up with someone? Like... are most people in\nthe gay community just chill with poop being involved?\n\nI apologize…",
  "original_created_utc": 1617744247,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はこの質問をするのに、良い方法を見つけようとしばらくここに座っていました。I\n何かと面倒なことが多いと思います。誰かと付き合っていることを知っている場合、特に慎重に計画を立てる必要がありますか？\n誰かと付き合っていることを知っている場合、特別に慎重に計画する必要がありますか？例えば...ゲイコミュニティのほとんどの人は\nウンチがあっても平気なの？\n\n申し訳ありません...",
      "title": "ゲイの方へ セックスの前にしばらく食べずにトイレに行ったり、ウンチを処理するだけですか？自発的なセックスはどのようにしていますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在这里坐了一会儿，想找一个好的方法来问这个问题。I\n我想事情可能会变得有点乱。你必须计划额外的\n如果你知道你在和别人勾搭，你会小心翼翼吗？就像... 大多数人在\n同性恋社区只是冷静与大便被卷入？\n\n我道歉...",
      "title": "男同性恋者。你是暂时不吃东西，做爱前上厕所，还是直接处理大便？你的自发性爱是如何进行的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在這裏坐了一會兒，想找一個好的方法來問這個問題。I\n我想事情可能會變得有點亂。你必須計劃額外的\n如果你知道你在和別人勾搭，你會小心翼翼嗎？就像... 大多數人在\n同性戀社區只是冷靜與大便被捲入？\n\n我道歉...",
      "title": "男同性戀者。你是暫時不喫東西，做愛前上廁所，還是直接處理大便？你的自發性愛是如何進行的？"
    }
  ],
  "title": "Gay men: Do you just not eat for a while and go to the bathroom before sex, or do you just deal with the poop? How does spontaneous sex work for you?",
  "created_utc": 1617762668,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I sat here for a while trying to find a good way of asking this question. I would imagine things could get sort of messy. Do you have to plan extra carefully if you know you’re hooking up with someone? Like... are most people in the gay community just chill with poop being involved?</p>\n\n<p>I apologize again for the bluntness of the question. I mean no offense, I’ve genuinely always wondered this. Forgive any ignorance attached to the question, please!</p>\n</div><!-- SC_ON -->",
  "score": 137,
  "permalink": "/r/TooAfraidToAsk/comments/mlm47t/gay_men_do_you_just_not_eat_for_a_while_and_go_to/",
  "subreddit": "TooAfraidToAsk",
  "id": "mlm47t",
  "is_self": true,
  "media": null,
  "is_video": false
}