{
  "author": "thatonefriendwhodies",
  "original_created_utc": 1625393424,
  "title": "Does anybody else really enjoy lying down on the floor in random places at home? Like, I don't know what it is. If I'm playing with my dog and I lie down next to him, I'm not moving for 20 minutes. There's just something about lying on your back on the floor that gets me weirdly relaxed..",
  "created_utc": 1625397354,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m not even sure if this is fit for this subreddit, but I just need to know if I&#39;m alone in this lmao</p>\n\n<p>I&#39;ve always found that whenever I lie down on the floor at home, not on a blanket or mattress, my body and mind <strong><em>instantly</em></strong> relaxes and I fall in a near-sleep/nap state even though I&#39;m fully awake. And I find it to be weird enough that I never do it unless I&#39;m home alone. It&#39;s sort of a habit for me. It also doesn&#39;t really matter if I&#39;m on my back, side or stomach, it&#39;s equally relaxing.. Should I buy a slab of marble and throw out my bed? Nah but seriously, am I alone in this?</p>\n</div><!-- SC_ON -->",
  "score": 209,
  "permalink": "/r/TooAfraidToAsk/comments/odhju1/does_anybody_else_really_enjoy_lying_down_on_the/",
  "subreddit": "TooAfraidToAsk",
  "id": "odhju1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm not even sure if this is fit for this subreddit, but I just need to know if\nI'm alone in this lmao\n\nI've always found that whenever I lie down on the floor at home, not on a\nblanket or mattress, my body and mind instantly relaxes and I fall in a\nnear-sleep/nap state even though I'm fully awake.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これがこのサブレディットに適しているかどうかもわかりませんが、私はただ以下のことを知りたいのです。\n私だけなのか知りたいのです。\n\n私はいつも、家で床に横になると、その時には必ず\n毛布やマットレスの上ではなく、家の床の上に横になると、体と心が瞬時にリラックスして、ほとんど眠っているような状態になります。\n起きているのに寝ているような状態になります。....",
      "title": "家の中で適当な場所に床を敷いて寝るのが好きな人はいますか？それが何なのかはわかりませんが。犬と遊んでいて、犬の隣に横になると、20分は動かないんですよ。ただ、床に仰向けになると何か変にリラックスできるんですよね。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我甚至不知道这是否适合这个分论坛，但我只想知道是否\n我是一个人在做这件事。\n\n我总是发现，每当我在家里躺在地板上，而不是躺在毯子或床垫上时，我的身体和思想就会立即放松，我就会陷入困境。\n毯子或床垫，我的身体和头脑就会立即放松，进入一种\n即使我是完全清醒的，也会陷入近乎睡眠/打盹的状态....",
      "title": "还有人真的喜欢在家里随意躺在地板上吗？就像，我不知道这是什么。如果我和我的狗一起玩，我躺在它旁边，我就会有20分钟不动。仰卧在地板上的感觉就是让我奇怪地放松。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我甚至不知道這是否適合這個分論壇，但我只想知道是否\n我是一個人在做這件事。\n\n我總是發現，每當我在家裏躺在地板上，而不是躺在毯子或牀墊上時，我的身體和思想就會立即放鬆，我就會陷入困境。\n毯子或牀墊，我的身體和頭腦就會立即放鬆，進入一種\n即使我是完全清醒的，也會陷入近乎睡眠/打盹的狀態....",
      "title": "還有人真的喜歡在家裏隨意躺在地板上嗎？就像，我不知道這是什麼。如果我和我的狗一起玩，我躺在它旁邊，我就會有20分鐘不動。仰臥在地板上的感覺就是讓我奇怪地放鬆。"
    }
  ]
}