{
  "author": "the_mirror_viewer01",
  "the_new_excerpt": "Hey everyone,\n\nSo we recently got NIO's 2020 Q4 and full year financial results. Some\nhighlights include:\n\n1) $2.5 billion reached for annual revenue\n\n2) Gross margins grew to 17.2%\n\n3) Positive full year operating cash flow\n\n4) $6.5 billion in the war chest as of 31st of December 2020\n\n5) Q1…",
  "original_created_utc": 1614740473,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "嘿，大家好。\n\n所以最近我们拿到了NIO的2020年Q4和全年财报。一些\n亮点包括\n\n1）年收入达到25亿元\n\n2）毛利率增长至17.2%。\n\n3）全年经营性现金流为正\n\n4）截至2020年12月31日，战备箱内有65亿美元。\n\n5) Q1…",
      "title": "来自NIO的好消息；但也有人希望你不这么想。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嘿，大家好。\n\n所以最近我們拿到了NIO的2020年Q4和全年財報。一些\n亮點包括\n\n1）年收入達到25億元\n\n2）毛利率增長至17.2%。\n\n3）全年經營性現金流爲正\n\n4）截至2020年12月31日，戰備箱內有65億美元。\n\n5) Q1…",
      "title": "來自NIO的好消息；但也有人希望你不這麼想。"
    }
  ],
  "title": "Good news from NIO; but there are some who want you to think otherwise.",
  "created_utc": 1614750862,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey everyone,</p>\n\n<p>So we recently got NIO&#39;s 2020 Q4 and full year financial results. Some highlights include:</p>\n\n<p>1) $2.5 billion reached for annual revenue </p>\n\n<p>2) Gross margins grew to 17.2%</p>\n\n<p>3) Positive full year operating cash flow </p>\n\n<p>4) $6.5 billion in the war chest as of 31st of December 2020</p>\n\n<p>5) Q1 deliveries expected to be above 20,000 EVs </p>\n\n<p>Overall, NIO has shown amazing improvements; they&#39;ve definitely come a long way, and to anyone who can look at the results honestly, it&#39;s evident that NIO will be much higher in the future. One of the reasons I say this is because of what we&#39;re seeing from the media trying to spin this situation negatively; and while it is true that anxiety regarding semiconductors and batteries can limit NIO&#39;s production, from the information we have, it doesn&#39;t appear it will have much of an effect.</p>\n\n<p>In the earnings call, NIO&#39;s CEO Willie Li Bin (NIOgang&#39;s homeboy) said that NIO will be producing 7,500 EVs in the second quarter 2021 until July wherein the production capacity will increase to 12,500--meaning an annual 150,000 EV production; it&#39;s also knows that this will potentially double again to 300,000 in 2022--meaning 25,000 NIO EVs produced a month.</p>\n\n<p>It should also be knows that yes NIO&#39;s deliveries were down in February, but this is due to the Lunar new year holiday; literally people were not at work. But interestingly, NIO delivered 5,578 in February, beatings Xpeng&#39;s 2,223. </p>\n\n<p>If you go to some of the forums like Stocktwits or Twitter, there&#39;s bears/shorts deliberately trying to scare people to sell--as if what&#39;s written above is bad news. Here&#39;s the <a href=\"https://www.cnbc.com/2021/03/02/chinese-tesla-rival-nio-chip-shortage-will-hit-electric-car-production.html\">link</a> for the &#39;bad news&#39; these fearmongers are dragging out. </p>\n\n<p>Take the supposed EPS miss by NIO: as the analyst Edison Yu points out, the EPS miss is misleading because it was actually due to the FX loss (the weak USD hurting NIO&#39;s cash balance). Basically not NIO&#39;s fault. Here&#39;s the <a href=\"https://twitter.com/edison__yu/status/1366538414271660032\">link</a> to his statement. </p>\n\n<p>The fact that NIO is ramping up production (remember that even at 7,500 this is more than their monthly deliveries in 2020); the fact that NIO has openly said they&#39;re entering Europe in H2 (<a href=\"https://www.benzinga.com/news/21/03/19912404/nio-to-begin-exporting-evs-to-europe-in-second-half-of-2021-report\">link</a>); the fact they have $6.5 billion now; the fact that production will be 12,500 from July, and 25,000 in 2022--all of these show how much of a winner NIO is, and why NIOgang will stay strong. </p>\n\n<p>But watching all the negativity, it definitely reminds me of last year around this time, before NIO went up over 1,000%. I think it could happen again. I think about it while I&#39;m at work; and I remember that it was Reddit where I first found NIO, and NIOgang</p>\n\n<p>We&#39;ve gotten fantastic news recently; don&#39;t let the haters drag us down. </p>\n\n<p>I like the stock.</p>\n</div><!-- SC_ON -->",
  "score": 320,
  "permalink": "/r/stocks/comments/lwjk7s/good_news_from_nio_but_there_are_some_who_want/",
  "subreddit": "stocks",
  "id": "lwjk7s",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937744948
}