{
  "author": "mygallows",
  "original_created_utc": 1643604539,
  "title": "As a young adult, I view crypto as one of the only ways to potentially own a house/property in the future.",
  "created_utc": 1643618518,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I just turned 21 a week ago today. &lt;/p&gt;\n\n&lt;p&gt;I’ve been investing in crypto for just about a year now, but more seriously the past 7 or so months. No I’m not investing significantly large amounts of money, but I am allocating a fair percentage of my income into crypto. &lt;/p&gt;\n\n&lt;p&gt;Why?&lt;/p&gt;\n\n&lt;p&gt;Because buying a house, owning some property, or even renting a place has seen prices increase substantially; especially here in Canada, where housing prices jumped over 26% last year. &lt;/p&gt;\n\n&lt;p&gt;I’m not investing on a whim; I take the time to learn the fundamentals and do my research. I buy solid crypto that I personally believe in for the long term. I’m fine waiting, practicing patience, and accumulating over time. &lt;/p&gt;\n\n&lt;p&gt;I don’t expect to become rich, and I know damn well I won’t wakeup a millionaire one day. However, I have faith and am optimistic about the future of some projects I hold, like CRO and ALGO for example. (ETH and BTC too, of course). &lt;/p&gt;\n\n&lt;p&gt;Good things come to those who wait. May we all prosper!&lt;/p&gt;\n\n&lt;p&gt;Little edit: the feedback I’m receiving is exactly why I love this community so much, thank you all for the kind words! I genuinely hope you all find financial freedom one day.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 376,
  "permalink": "/r/CryptoCurrency/comments/sgsnu3/as_a_young_adult_i_view_crypto_as_one_of_the_only/",
  "subreddit": "CryptoCurrency",
  "id": "sgsnu3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I just turned 21 a week ago today.\n\nI’ve been investing in crypto for just about a year now, but more seriously the\npast 7 or so months. No I’m not investing significantly large amounts of money,\nbut I am allocating a fair percentage of my income into crypto.\n\nWhy?\n\nBecause buying a house, owning…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1週間前の今日、21歳になったばかりです。\n\n暗号への投資を始めてちょうど1年になりますが、より真剣に取り組んでいるのがここ\nこの7ヶ月ほど。いいえ、私は著しく大きな金額を投資しているわけではありません。\nしかし、私は自分の収入のかなりの割合を暗号に割り当てています。\n\nなぜか？\n\nなぜなら、家を買うこと、所有すること...",
      "title": "若い世代の私は、暗号を、将来的に家や不動産を所有する可能性のある唯一の方法としてとらえています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "一周前的今天我刚满21岁。\n\n我投资加密货币大约有一年时间了，但更严重的是在过去的7年或8年里，我一直在投资加密货币。\n过去7个月左右。不，我没有投资大量的资金。\n但我将我收入的相当大比例分配给了加密货币。\n\n为什么？\n\n因为买房子，拥有...",
      "title": "作为一个年轻的成年人，我把加密货币视为未来可能拥有房子/房产的唯一途径之一。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "一週前的今天我剛滿21歲。\n\n我投資加密貨幣大約有一年時間了，但更嚴重的是在過去的7年或8年裏，我一直在投資加密貨幣。\n過去7個月左右。不，我沒有投資大量的資金。\n但我將我收入的相當大比例分配給了加密貨幣。\n\n爲什麼？\n\n因爲買房子，擁有...",
      "title": "作爲一個年輕的成年人，我把加密貨幣視爲未來可能擁有房子/房產的唯一途徑之一。"
    }
  ]
}