{
  "author": "Tedi_Westside",
  "the_new_excerpt": "Company Description:\n\nBeyond Meat is one of the fastest growing food companies in the United States\nand offers consumers a range of various plant-based meats. This company’s\nmission is to build meat directly from plants and have their final product\nconsist of the same attributes as actual meat…",
  "original_created_utc": 1620399812,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "会社の説明\n\nビヨンド・ミートは、米国で最も急成長している食品会社のひとつです。\nで、消費者に様々な植物性の肉を提供しています。この会社の\nこの会社の使命は、植物から直接肉を作り、その最終製品を実際の肉と同じ属性にすることです。\n植物から直接肉を作り、最終製品を実際の肉と同じ属性にすることがミッションです...",
      "title": "ビヨンド・ミート(BYND)は最近のディップで買いか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "公司介绍。\n\nBeyond Meat是美国发展最快的食品公司之一。\n并为消费者提供各种植物性肉类。这家公司的\n该公司的使命是直接从植物中制造肉类，并使其最终产品具有与实际肉类相同的属性。\n包括与实际肉类相同的属性...",
      "title": "在最近的下跌之后，Beyond Meat（BYND）是否可以买入？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "公司介紹。\n\nBeyond Meat是美國發展最快的食品公司之一。\n併爲消費者提供各種植物性肉類。這家公司的\n該公司的使命是直接從植物中製造肉類，並使其最終產品具有與實際肉類相同的屬性。\n包括與實際肉類相同的屬性...",
      "title": "在最近的下跌之後，Beyond Meat（BYND）是否可以買入？"
    }
  ],
  "title": "Is Beyond Meat (BYND) a buy after the recent dip?",
  "created_utc": 1620453308,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Company Description:</strong></p>\n\n<p>Beyond Meat is one of the fastest growing food companies in the United States and offers consumers a range of various plant-based meats. This company’s mission is to build meat directly from plants and have their final product consist of the same attributes as actual meat products. Beyond Meat’s products are designed to be more nutritional than that of regular meat, although the nutritional aspects of plant-based meats have been questioned. While plant-based meats may or may not be more nutritional than regular meat, by shifting to plant-based meats people can positively affect growing global issues. The issues which this company is trying to address include human health, climate change, constraints on natural resources, and animal welfare. Their products consist of the Beyond Burger, meatballs, sausage, beef, and more. Besides certain Beyond Crumbles, all of their products are certified Kosher and Halal. As of December 2021, you can find Beyond Products available at approximately 122,000 retailer and foodservice outlets in more than 80 countries. In addition, Beyond Meat has an e-commerce site which offers consumers bulk packs, mixed product bundles, and trial packs. This company is constantly innovating and their R&amp;D as a percentage of revenue is higher than some of the biggest food companies (Nestle, Kroger, etc.) at 7.8%. Their state-of-the-art innovation center is a 30,000 sq. foot building located in El Segundo California. This company’s mission is simple to understand, through a unique and innovative approach make the best product that gets as close as possible to real meat all while benefiting the planet.</p>\n\n<p><strong>Total Addressable Market</strong> (TAM)</p>\n\n<p>In 2020 the plant-based meat market was estimated to be valued at $4.3 billion and is projected to reach $8.3 billion by 2025. All that growth registers a compounded annual growth rate (CAGR) of 14%. Much of the growth that we are witnessing is due to the growing vegan, vegetarian, and health conscious trends people are adopting. Also, many people are becoming more aware of the additives that are in the foods that they eat and the environmental problems that come with meat products. All of these factors make Beyond Meat products appealing as not only do people enjoy knowing they are eating healthy, but they can do their part toward slowing down environmental problems. While the plant-based market may not be the largest, Beyond Meat said they are going after the global meat industry. The global meat industry is valued at $1.2 trillion and had a CAGR of 2.4% between 2015 and 2019. Perhaps the biggest discrepancy between these two industries besides how the various products are made and consist of is price. Beyond Meat’s Beyond Sausage sells for $10.30 a pound, that is about 70% more than regular pork sausage. One pound of factory-farmed beef burgers at Walmart run somewhere around $3/pound, while one pound of Beyond Meat’s Beef Burger will run you around $6.25/pound. While the difference in pricing is certainly a lot, that doesn’t mean that people don’t buy Beyond Meat products. Going forward we’ll have to see how much of a disrupter this company is to the global meat market.</p>\n\n<p><strong>Recent Developments/Acquisitions</strong></p>\n\n<p><strong>The new Beyond Burger launches at grocery stores nationwide (April 27, 2021) –</strong> Beyond Meat recently introduced their new Beyond Burger which has 35% less fat and saturated fat, and fewer calories than 80/20 beef. This new iteration will hit grocery store shelves beginning the week of May 3rd. It will be available in a 2-pack, the brand’s first ever value 4-pack, and a 1lb Beyond Beef pack. Dariush Ajami, the Chief Innovation Officer at Beyond Meat, said ” We are continuously working on understanding beef flavor at a deeper level to ensure our plant-based beef platform delivers a delicious and satisfying sensory experience. The new Beyond Burger’s rich flavor profile resembles that of ground beef, and extensive testing with our consumers validated this new flavor direction with likeability scoring on-par with 80/20 ground beef burgers.” According to the University of Michigan’s 2018 Life Cycle Assessment, when compared to traditional 80/20 beef burgers, the Beyond Burger has 99% less impact on water scarcity, 93% less impact on land use, requires 46% less energy, and generates 90% fewer greenhouse gas emissions.</p>\n\n<p><strong>Beyond Meat announces major retail expansions throughout Europe (April 12, 2021) –</strong> Beyond Meat announced that they will be significantly increasing product distribution within thousands of European locations. The plant-based foods market in Europe has seen sales grow by 49% over the last two years. In the U.K, Sainsbury’s said they would double their distribution of the Beyond Burger nationwide. Also, Waitrose launched the Beyond Burger and Beyond Sausage. The retailers together increased Beyond Meat’s presence in 445 stores. In Germany, Beyond Meat will be expanding their product offering in over 1,000 German retail stores through Kaufland, Tegut, Famila, and Real. In Austria, the Beyond Meat product selection will be expanded at SPAR and BILLA locations to a total of 1,500 retail stores. Migros stores in Switzerland will expand Beyond Mince distribution to 155 stores. Nearly 1,000 Albert Heijn and Jumbo stores in the Netherlands will now offer Beyond Mince. Chuck Muth, the Chief Growth Officer at the company, said “These new and expanded retail partnerships throughout the continent serve as strong proof points that Europe’s appetite for plant-based meat and Beyond Meat products in particular is on the rise.” Moreso, in June 2020 Beyond Meat announced its first co-manufacturing facility in Europe in partnership with Zandbergen World’s Finest Meats in Zoeterwoude Netherland.</p>\n\n<p><strong>Beyond Meat opens manufacturing facility in China to accelerate localized production and innovation (April 7, 2021) –</strong> Earlier last month Beyond Meat opened a new advanced manufacturing facility in the Jiaxing Economic and Technological Development Zone located near Shanghai. Ethan Brown, CEO, said “The opening of our dedicated plant-based meat facility in China marks a significant milestone in Beyond Meat’s ability to effectively compete in one of the world’s largest meat markets. We are committed to investing in China as a region for long-term growth, and we believe this new manufacturing facility will be instrumental in advancing our pricing and sustainability metrics as we seek to provide Chinese consumers with delicious plant-based proteins that are good for both people and planet.” Just a little over a year ago, Beyond Meat entered mainland China through a nationwide partnership with Starbucks. In addition to Starbucks, Beyond Meat has partnered with multiple other food services such as KFC, Pizza Hut, Jindingxuan, GangLi Beijing, Slow Boat Brewery, Hema, METRO China and more. Beyond Meat has been expanding so heavily in China that they’ve even made a product specifically for the Chinese Market, Beyond Pork.</p>\n\n<p><strong>What could go wrong</strong></p>\n\n<p><strong>Foodservice doesn’t pick up –</strong> Beyond Meat has a number of strategic partnerships with restaurant chains in various countries. In the past we’ve seen that whenever they announce a new partnership with a food chain their stock jumps dramatically, only to fall back to where it was before a few days after. Beyond Meat has partnered with the likes of Pizza Hut, Taco Bell, McDonald’s, KFC, and a number of other restaurants. Looking at the foodservice side of their business, they’ve seen tremendous YoY growth. While Covid has impacted their business significantly in terms of foodservice sales, many investors still remain optimistic that this side of their business will bounce back. While they will likely continue seeing growth going forward, I remain skeptical as to how all these strategic partnerships will play out. Impossible foods is their main competitor and they’ve partnered with the likes of Burger King, White Castle, Red Robin, and others. These partnerships with respect to both companies have played out well as shown by the YoY growth in foodservice revenue. The questions that remain to be asked are, in the long-run, how many of these restaurants will create their own meat alternative products or stop doing business with Impossible foods or Beyond Meat? Taco Bell has already begun testing their own plant-based protein products and how many others will follow? Furthermore, Beyond Meat has been relying on new partnerships to boost foodservice sales. There might be a point to where the growth in foodservice revenue stops as a result of their not being worthy partnerships with restaurant chains and what happens then? Nonetheless, I remain optimistic for the time being that Beyond Meat will see their foodservice revenue increase rapidly for the next couple years.</p>\n</div><!-- SC_ON -->",
  "score": 57,
  "permalink": "/r/stocks/comments/n70krq/is_beyond_meat_bynd_a_buy_after_the_recent_dip/",
  "subreddit": "stocks",
  "id": "n70krq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985995614
}