{
  "author": "NFTfuture1",
  "the_new_excerpt": "In March, Citibank (top 4 US bank) published a report on Bitcoin, called\nBitcoin: At the Tipping Point. It is an extensive 108 page report that examines\nBitcoin in detail and alleges that it is currently at a tipping point and we\ncould be at the start of massive transformation of cryptocurrency into…",
  "original_created_utc": 1619893563,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "3月、シティバンク（米国のトップ4の銀行）は、ビットコインに関するレポートを発表しました。\nBitcoin: At the Tipping Point」というレポートを発表しました。このレポートは、108ページにわたる大規模なもので、ビットコインを詳細に調査し\nこのレポートは108ページに及ぶ大規模なもので、ビットコインを詳細に調査し、現在ビットコインは転換点にあり、我々は大変革の始まりを迎えていると主張しています。\nビットコインは現在、転換期にあり、暗号通貨が大規模な変化を遂げている可能性があるとしています...",
      "title": "シティバンクは、ビットコインが世界的な取引に適した通貨になるための最適な位置にあるかもしれないと述べています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "3月，花旗银行（美国排名前四的银行）发表了一份关于比特币的报告，名为\n比特币：处于转折点。这是一份长达108页的报告，详细研究了\n并声称目前比特币正处于一个转折点，而我们\n可能正处于加密货币大规模转型的开始。",
      "title": "花旗银行称比特币可能处于最佳位置，成为全球贸易的首选货币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "3月，花旗銀行（美國排名前四的銀行）發表了一份關於比特幣的報告，名爲\n比特幣：處於轉折點。這是一份長達108頁的報告，詳細研究了\n並聲稱目前比特幣正處於一個轉折點，而我們\n可能正處於加密貨幣大規模轉型的開始。",
      "title": "花旗銀行稱比特幣可能處於最佳位置，成爲全球貿易的首選貨幣"
    }
  ],
  "title": "Citibank says Bitcoin may be optimally positioned to become the preferred currency for global trade",
  "created_utc": 1619933630,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In March, Citibank (top 4 US bank) published a report on Bitcoin, called Bitcoin: At the Tipping Point. It is an extensive 108 page report that examines Bitcoin in detail and alleges that it is currently at a tipping point and we could be at the start of massive transformation of cryptocurrency into the mainstream.</p>\n\n<p>According to Citibank, Bitcoin is in prime position to become the currency of choice for international trade, because it is immune from both fiscal and monetary policy, avoids the need for cross-border foreign exchange (FX) transactions, enables near instantaneous payments, and eliminates concerns about defaults or cancellations.</p>\n\n<p>They also envision a system where individuals and businesses would have digital wallets holding a variety of cryptocurrencies, stablecoins, and CBDCs just like they today have checking, savings, and treasury accounts. Connectivity between the traditional fiat currency economy, public cryptocurrency networks, and private stablecoin communities would become fully enabled.</p>\n\n<p>Since we&#39;ve all been hearing so much about how Bitcoin is not a currency but a store of value, it is very interesting that a top level bank would envision it as a currency for global trade.</p>\n\n<p>What do you think?</p>\n\n<p>In case you want to read the report: <a href=\"https://ir.citi.com/%5C_tpHpW8MfaZ1QXwGmP1JGMGXXI95qXm3IMJzUJScLMb6XIjtOls6EbDehXMR3B%5C_o9Opi7mdc5tQ%3D\">https://ir.citi.com/\\_tpHpW8MfaZ1QXwGmP1JGMGXXI95qXm3IMJzUJScLMb6XIjtOls6EbDehXMR3B\\_o9Opi7mdc5tQ%3D</a></p>\n</div><!-- SC_ON -->",
  "score": 192,
  "permalink": "/r/CryptoCurrency/comments/n2o5vn/citibank_says_bitcoin_may_be_optimally_positioned/",
  "subreddit": "CryptoCurrency",
  "id": "n2o5vn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380962678
}