{
  "author": "KuyaNickNick",
  "original_created_utc": 1631935570,
  "title": "A warning to my fellow Bitcoin enthusiasts: If you mistype coinbase into your browser, you will get bit-jacked.",
  "created_utc": 1631950236,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was trying to login to Coinbase from a fairly new laptop. </p>\n\n<p>The site looked right. But for some reason my auto-fill wasn&#39;t working. I thought this wasn&#39;t right, but it was a fairly new laptop... So I manually typed in my login and 2fa. Then I got a text that I changed my 2fa. I didn&#39;t do that! So I tried to login to coinbase again. My 2fa code wasn&#39;t working. uhoh. I opened coinbase app on my phone and saw 2000 was purchased in Bitcoin. OMG! I disabled my account immediately.  My mobile app was signed out. Then I got the email for the 2000 purchase. I dont think the attacker had enough time to send my funds out. Then I looked at my browser history. I guess I went to coinbasi dot pro by typing coinbasr dot com instead of coinbase!  Then I emailed support @ coinbase my issue, what happened step by step, a screenshot of my browser history, my IP address, and a message that any activity not from my IP address was unauthorized. Mrrr. I plan on traveling internationally and was going to sell some coin to add to my bank balance, instead two grand was siphoned. I might have to change my departure date now. I&#39;m definitely calling my bank in the morning. I&#39;m nervous because anytime I email coinbase support it takes like a week to get an answer back. Ugh.</p>\n</div><!-- SC_ON -->",
  "score": 189,
  "permalink": "/r/Bitcoin/comments/pqevsl/a_warning_to_my_fellow_bitcoin_enthusiasts_if_you/",
  "subreddit": "Bitcoin",
  "id": "pqevsl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was trying to login to Coinbase from a fairly new laptop.\n\nThe site looked right. But for some reason my auto-fill wasn't working. I\nthought this wasn't right, but it was a fairly new laptop... So I manually typed\nin my login and 2fa. Then I got a text that I changed my 2fa. I didn't do that!\nSo I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "かなり新しいノートパソコンからCoinbaseにログインしようとしました。\n\nサイトは正しく表示されました。しかし、なぜか自動入力がうまくいかなかったのです。I\nこれはおかしいと思いましたが、かなり新しいノートパソコンだったので...。そこで、私は手入力で\nと入力してみました。すると、2faを変更したというテキストが表示されました。私はそんなことをしていません!\nそれで私は...",
      "title": "ビットコインを愛する仲間たちへの警告です。ブラウザにcoinbaseと誤入力すると、ビットジャックされてしまいます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我试图从一台相当新的笔记本电脑上登录Coinbase。\n\n该网站看起来不错。但由于某些原因，我的自动填表功能不工作了。I\n我想这是不对的，但这是一台相当新的笔记本电脑... 于是我手动输入了\n输入我的登录名和2fa。然后我收到一条短信，说我改变了我的2fa。我没有这么做\n所以我...",
      "title": "对我的比特币爱好者们的警告。如果你在浏览器中错误地输入coinbase，你会被劫持。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我試圖從一臺相當新的筆記本電腦上登錄Coinbase。\n\n該網站看起來不錯。但由於某些原因，我的自動填表功能不工作了。I\n我想這是不對的，但這是一臺相當新的筆記本電腦... 於是我手動輸入了\n輸入我的登錄名和2fa。然後我收到一條短信，說我改變了我的2fa。我沒有這麼做\n所以我...",
      "title": "對我的比特幣愛好者們的警告。如果你在瀏覽器中錯誤地輸入coinbase，你會被劫持。"
    }
  ]
}