{
  "author": "TheMeanCanadianx",
  "original_created_utc": 1627744160,
  "title": "Which side of the road did allied forces drive on during World War 2?",
  "created_utc": 1627815368,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This thought occurred to me while playing an online WW2 game. I crashed my truck into an allied tank and yelled at them for driving on the wrong side of the road. They yelled back at me in thick European accents that it was me who was driving on the wrong side. It occurred to me at that moment that similar incidents must have occurred during the real war.</p>\n\n<p>What side of the road did allied forces drive on during World War 2? Did differences in road laws cause any significant or notable incidents? Was this a source of contention between different allied forces?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/ov8tmv/which_side_of_the_road_did_allied_forces_drive_on/",
  "subreddit": "AskHistorians",
  "id": "ov8tmv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This thought occurred to me while playing an online WW2 game. I crashed my truck\ninto an allied tank and yelled at them for driving on the wrong side of the\nroad. They yelled back at me in thick European accents that it was me who was\ndriving on the wrong side. It occurred to me at that moment that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そんなことを思ったのは、WW2のオンラインゲームをプレイしているときでした。トラックをぶつけて\n味方の戦車にぶつかり、逆走したと怒鳴られた。\n道路 彼らは分厚いヨーロッパ訛りの声で、私が悪いのだと怒鳴り返しました。\n逆走しているのです。その時、ふと思ったんです...。",
      "title": "第二次世界大戦中、連合軍はどちら側を走っていたのでしょう？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在玩一个在线二战游戏时想到了这个问题。我把我的卡车撞上了\n撞上了一辆盟军的坦克，并对他们大喊大叫，因为他们在道路的错误一侧行驶。\n路上。他们用浓重的欧洲口音回骂我说是我\n是我开错了边。在那一刻，我想到了...",
      "title": "在第二次世界大战期间，盟军在道路的哪一边行驶？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在玩一個在線二戰遊戲時想到了這個問題。我把我的卡車撞上了\n撞上了一輛盟軍的坦克，並對他們大喊大叫，因爲他們在道路的錯誤一側行駛。\n路上。他們用濃重的歐洲口音回罵我說是我\n是我開錯了邊。在那一刻，我想到了...",
      "title": "在第二次世界大戰期間，盟軍在道路的哪一邊行駛？"
    }
  ]
}