{
  "author": "HeIioz",
  "original_created_utc": 1628145127,
  "title": "Governance Poll: Staggered Daily Discussions",
  "created_utc": 1628163037,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I want to participate in the daily discussion myself, but it gets posted at 4am in my country. By the time I wake up, there&#39;s already 10k comments. Now the daily is partially active regardless of time, but a large chunk of the activity is during the first few hours. Currently, all of Africa, the entirety of Europe, the whole of the Middle East and east Asia is asleep when the daily is posted.</p>\n\n<p>I propose posting the daily discussion 4 hours apart every day of the week. It would look like this:</p>\n\n<pre><code>Sunday: GMT+4 \nMonday: GMT+8 \nTuesday: GMT+12 \nWednesday: GMT+16 \nThursday: GMT+20 \nFriday: GMT+0 \nSaturday: GMT+0 \n</code></pre>\n\n<p>This way, There&#39;s at least 4 days a week where a person can comment early(assuming you&#39;re awake for 16 hours) and 5 days for Americans. The previous daily discussion only gets taken down once the new daily is posted. There will be a daily discussion up at all times.</p>\n\n<p><a href=\"https://www.reddit.com/poll/oybteq\">View Poll</a></p>\n</div><!-- SC_ON -->",
  "score": 266,
  "permalink": "/r/CryptoCurrency/comments/oybteq/governance_poll_staggered_daily_discussions/",
  "subreddit": "CryptoCurrency",
  "id": "oybteq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I want to participate in the daily discussion myself, but it gets posted at 4am\nin my country. By the time I wake up, there's already 10k comments. Now the\ndaily is partially active regardless of time, but a large chunk of the activity\nis during the first few hours. Currently, all of Africa, the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私も毎日の議論に参加したいのですが、私の国では朝4時に投稿されてしまうので\n私の国では午前4時に投稿されます。私が起きた時には、すでに10kのコメントがついています。今やデイリーは\nデイリーは時間に関係なく部分的に活動していますが、活動の大部分は最初の数時間にあります。\nは最初の数時間に集中しています。現在、アフリカ全体では、...",
      "title": "Governance Poll: Staggered Daily Discussions"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我自己也想参加每天的讨论，但在我的国家，它是在凌晨4点发布的。\n在我的国家。当我醒来的时候，已经有10千条评论了。现在\n现在，无论什么时候，日报都是部分活跃的，但是很大一部分的活动\n是在最初的几个小时。目前，整个非洲，...",
      "title": "治理投票：每天交错讨论"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我自己也想參加每天的討論，但在我的國家，它是在凌晨4點發布的。\n在我的國家。當我醒來的時候，已經有10千條評論了。現在\n現在，無論什麼時候，日報都是部分活躍的，但是很大一部分的活動\n是在最初的幾個小時。目前，整個非洲，...",
      "title": "治理投票：每天交錯討論"
    }
  ]
}