{
  "author": "DNASnatcher",
  "original_created_utc": 1647639845,
  "title": "[META] Please, please, please stop with the straw man attacks in responses",
  "created_utc": 1647658307,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I want to comment on a recent trend I’ve noticed on this sub (one of my favorite subs on all of Reddit) in this hopes that it will stop. It goes like this:&lt;/p&gt;\n\n&lt;p&gt;OP posts a question asking for clarification or verification of a claim that happens to relate to a social justice issue. People will offer scholarly, well-cited responses, but their scholastics are mixed with some sharp criticism of OP for questioning this social justice issue. If that were the whole story, I’d be happy to assume that I’m just reading the tone of the responses differently than others and leave it at that. Criticism isn&amp;#39;t necessarily a bad thing, after all. But increasingly I’ve seen the responses actually make straw man attacks on OP. Asking that a claim be verified is not the same thing as denying that the claim is true, and it’s certainly not the same thing as taking a philosophical stance on a social justice issue.&lt;/p&gt;\n\n&lt;p&gt;I’m speaking in generalities because I don’t want to call out any particular person, and because I’ve seen this multiple times on multiple different issues. I am not referring to instances in which OP is a troll or to questions asked in bad faith. And not that it should matter, but I am a progressive person who is extremely in favor of social justice. But the value of questioning the veracity of claims should be nakedly obvious, particularly to people who are liberal-minded.&lt;/p&gt;\n\n&lt;p&gt;I know there are trolls on Reddit, and it’s not always easy to read someone’s intent. But lets assume it’s positive. Or at the very least, please don&amp;#39;t assume that questioning a specific detail is the same thing as promoting inequality (or whatever). I’d argue that the very careful moderation of this sub makes civility even more important. Many of the questions here only get one response, and if that response features straw man attacks and other nastiness the sub becomes a lot less fun for everyone.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/thfyx6/meta_please_please_please_stop_with_the_straw_man/",
  "subreddit": "AskHistorians",
  "id": "thfyx6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I want to comment on a recent trend I’ve noticed on this sub (one of my favorite\nsubs on all of Reddit) in this hopes that it will stop. It goes like this:\n\nOP posts a question asking for clarification or verification of a claim that\nhappens to relate to a social justice issue. People will offer…"
}