{
  "author": "sidebet1",
  "the_new_excerpt": "United Wholesale Mortgage is going ex div on June 9th. The current payout is\nover 4%. I know dividend stocks fall after payout but this one is on a strong\nuptrend and it shouldn't take long to recover the 4% drop after the payout. I\nhave been holding 750 shares for 4 months. I bought some dips and…",
  "original_created_utc": 1622943127,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "United Wholesale Mortgageは、6月9日にex divideします。現在の配当率は\n4％を超えている。配当銘柄が配当後に下落することは知っているが、この銘柄は強い上昇トレンドにある。\nしていて、配当後の4％の下落を回復するのに時間はかからないはずだ。I\n4ヶ月前から750株を保有している。私は4ヶ月間750株を保有しており、いくつかのディップを購入しましたが...",
      "title": "UWMC 6月9日 EX DIV"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "联合批发抵押贷款公司将于6月9日除息。目前的派息率是\n超过4%。我知道派息股在派息后会下跌，但这只股票正处于强劲的上升趋势中。\n上升趋势，应该不会花很长时间来恢复派息后的4%跌幅。I\n已经持有750股4个月了。我买了一些跌停板和...",
      "title": "华大基因6月9日除权"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "聯合批發抵押貸款公司將於6月9日除息。目前的派息率是\n超過4%。我知道派息股在派息後會下跌，但這隻股票正處於強勁的上升趨勢中。\n上升趨勢，應該不會花很長時間來恢復派息後的4%跌幅。I\n已經持有750股4個月了。我買了一些跌停板和...",
      "title": "華大基因6月9日除權"
    }
  ],
  "title": "UWMC June 9 ex div",
  "created_utc": 1623013716,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>United Wholesale Mortgage is going ex div on June 9th. The current payout is over 4%. I know dividend stocks fall after payout but this one is on a strong uptrend and it shouldn&#39;t take long to recover the 4% drop after the payout. I have been holding 750 shares for 4 months. I bought some dips and now have a good avg. If the price dips that just increases the dividend %. For me it&#39;s a good long term hold but there is room to make money for the short term people also. Not financial advice, just hoping my 14 June 18th 10$ calls cash itm! Park some money I&#39;m UWMC! Do some DD and you&#39;ll fall in love!</p>\n</div><!-- SC_ON -->",
  "score": 54,
  "permalink": "/r/stocks/comments/ntaivw/uwmc_june_9_ex_div/",
  "subreddit": "stocks",
  "id": "ntaivw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404886633
}