{
  "author": "SuspiciousFruitBat",
  "original_created_utc": 1649530779,
  "title": "Are there any reddit communities new users without karma can post in",
  "created_utc": 1649537348,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I almost feel stupid for even asking because I&amp;#39;ve never had to ask this for any other social media platform.&lt;/p&gt;\n\n&lt;p&gt;Who designed this ridiculously bad catch 22 system anyway.&lt;/p&gt;\n\n&lt;p&gt;Edit: ironically I can post here, hurray, so I guess I&amp;#39;ll rephrase a little, what communities do you know of, that let, evil new users like myself, participate even though we&amp;#39;ve committed the sin of being new to the platform?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/NoStupidQuestions/comments/tzzt0a/are_there_any_reddit_communities_new_users/",
  "subreddit": "NoStupidQuestions",
  "id": "tzzt0a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I almost feel stupid for even asking because I've never had to ask this for any\nother social media platform.\n\nWho designed this ridiculously bad catch 22 system anyway.\n\nEdit: ironically I can post here, hurray, so I guess I'll rephrase a little,\nwhat communities do you know of, that let, evil new…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このようなことを聞くのは初めてなので、聞くのが馬鹿らしくなりそうです。\n他のソーシャルメディアプラットフォーム\n\nとにかくこのとんでもなく悪いキャッチ22システムを設計したのは誰なんだ。\n\n編集：皮肉にも私はここに投稿することができます、万歳、だから私は少し言い直すと思います。\nこのようなコミュニティがあることをご存知ですか？",
      "title": "カルマのない新規ユーザーが投稿できるredditのコミュニティはありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我甚至觉得问这个问题很愚蠢，因为我从来没有为任何其他社交媒体平台问过这个问题。\n其他社交媒体平台。\n\n到底是谁设计了这个可笑的、糟糕的 \"22条 \"系统。\n\n编辑：具有讽刺意味的是，我可以在这里发帖，万岁，所以我想我要重新表述一下。\n你知道有哪些社区，让邪恶的新...",
      "title": "是否有任何reddit社区，没有因果关系的新用户可以在其中发帖？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我甚至覺得問這個問題很愚蠢，因爲我從來沒有爲任何其他社交媒體平臺問過這個問題。\n其他社交媒體平臺。\n\n到底是誰設計了這個可笑的、糟糕的 \"22條 \"系統。\n\n編輯：具有諷刺意味的是，我可以在這裏發帖，萬歲，所以我想我要重新表述一下。\n你知道有哪些社區，讓邪惡的新...",
      "title": "是否有任何reddit社區，沒有因果關係的新用戶可以在其中發帖？"
    }
  ]
}