{
  "author": "Yossi25",
  "original_created_utc": 1629394562,
  "title": "Why doesn't Fauci or the CDC heavily recommend Americans to exercise and eat right?",
  "created_utc": 1629480628,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I see a lot of data on how covid hits obese and vitamin D deficient Americans the most.  The data for this is extremely clear and non controversial.  No other way to interpret it.</p>\n\n<p>Why don&#39;t they tell people to exercise an hour a day (walk, jog, cycle, swim, lift, get some sunlight, jump rope, whatever?)  Like why doesn&#39;t Fauci go on air right now and tell people that?</p>\n\n<p>Instead the only thing I hear from them is mask up and hunker down.</p>\n\n<p>Edit: Please don&#39;t crucify my soul.  It&#39;s just an honest question.  As someone who works out an hour a day, I feel like Coronavirus is significantly less dangerous to me compared to someone who doesn&#39;t exercise at all.</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/TooAfraidToAsk/comments/p7jld2/why_doesnt_fauci_or_the_cdc_heavily_recommend/",
  "subreddit": "TooAfraidToAsk",
  "id": "p7jld2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I see a lot of data on how covid hits obese and vitamin D deficient Americans\nthe most. The data for this is extremely clear and non controversial. No other\nway to interpret it.\n\nWhy don't they tell people to exercise an hour a day (walk, jog, cycle, swim,\nlift, get some sunlight, jump rope,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "肥満とビタミンD不足のアメリカ人にコヴィドが効いているというデータがたくさん出ています。\n肥満とビタミンD不足のアメリカ人に最も影響を与えるというデータをよく目にします。このデータは極めて明確で、議論の余地もありません。他には\nそれ以外の解釈はありません。\n\n1日1時間の運動（ウォーキング、ジョギング、サイクリング、水泳、リフティング、日光浴、縄跳びなど）をしなさいというのはどうでしょうか。\n太陽の光を浴びる、縄跳びをする......。",
      "title": "ファウチ氏やCDCは、なぜアメリカ人に運動や正しい食事をするよう強く勧めないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我看到了很多关于科维德如何打击肥胖和维生素D缺乏的美国人的数据\n是最多的。这方面的数据是非常清楚的，而且是没有争议的。没有其他\n方式来解释。\n\n他们为什么不告诉人们每天锻炼一小时（散步、慢跑、骑自行车、游泳。\n举重，晒太阳，跳绳，...",
      "title": "为什么Fauci或CDC不大力推荐美国人锻炼和正确饮食？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到了很多關於科維德如何打擊肥胖和維生素D缺乏的美國人的數據\n是最多的。這方面的數據是非常清楚的，而且是沒有爭議的。沒有其他\n方式來解釋。\n\n他們爲什麼不告訴人們每天鍛鍊一小時（散步、慢跑、騎自行車、游泳。\n舉重，曬太陽，跳繩，...",
      "title": "爲什麼Fauci或CDC不大力推薦美國人鍛鍊和正確飲食？"
    }
  ]
}