{
  "author": "madcapmax",
  "the_new_excerpt": "I liked CCL and other other cruise line stocks as a re-opening play, there is\nobvious pent-up demand, but after seeing how the stocks reacted to 2 positive\ntests (on a supposed 100% vaccinated ship)... there is simply no way these\nstocks are going to be able to get any traction. The news media will…",
  "original_created_utc": 1623441698,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "CCLをはじめとするクルーズラインの銘柄は、明らかに需要があり、再開のためのプレイとして気に入っていました。\nしかし、2つのポジティブ・テスト（想定される10％のテスト）に株が反応したのを見て\nしかし、（100％ワクチンを接種したはずの船で）2つの陽性反応が出たことに株が反応した後では......これらの株が牽引役になることはないでしょう。\nしかし、2つの陽性反応（100％ワクチンを接種したとされる船）に株がどう反応したかを見た後では、これらの株が支持されることはないでしょう。ニュースメディアは...",
      "title": "COVIDの2つの陽性反応に人々が興奮しているなら、クルーズ株はほぼ絶望的だ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我喜欢CCL和其他邮轮公司的股票作为重新开放的游戏，有明显的压抑需求。\n但在看到这些股票对两次阳性测试的反应之后\n但在看到这些股票对两次阳性测试（在一艘所谓100%接种疫苗的船上）的反应后......这些股票根本不可能得到任何牵引力。\n这些股票将能够得到任何牵引力。新闻媒体将...",
      "title": "如果人们因为两次COVID测试呈阳性而惊慌失措，那么游轮股票基本上就完蛋了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我喜歡CCL和其他郵輪公司的股票作爲重新開放的遊戲，有明顯的壓抑需求。\n但在看到這些股票對兩次陽性測試的反應之後\n但在看到這些股票對兩次陽性測試（在一艘所謂100%接種疫苗的船上）的反應後......這些股票根本不可能得到任何牽引力。\n這些股票將能夠得到任何牽引力。新聞媒體將...",
      "title": "如果人們因爲兩次COVID測試呈陽性而驚慌失措，那麼遊輪股票基本上就完蛋了"
    }
  ],
  "title": "If People Are Freaking Out Over 2 Positive COVID Tests, The Cruise Stocks Are Pretty Much Doomed",
  "created_utc": 1623452077,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I liked CCL and other other cruise line stocks as a re-opening play, there is obvious pent-up demand, but after seeing how the stocks reacted to 2 positive tests (on a supposed 100% vaccinated ship)... there is simply no way these stocks are going to be able to get any traction. The news media will jump on literally every case to fear monger, and every ship is going to have at least one positive COVID test, I almost guarantee it.  </p>\n\n<p>If you had to test for airlines, I guarantee you&#39;d find a ton of positive COVID people flying right now as well, but that isn&#39;t required so the news media will not get ahold of it.</p>\n</div><!-- SC_ON -->",
  "score": 265,
  "permalink": "/r/stocks/comments/nxotu8/if_people_are_freaking_out_over_2_positive_covid/",
  "subreddit": "stocks",
  "id": "nxotu8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009743450
}