{
  "author": "A_Chicken_Dino",
  "original_created_utc": 1655575914,
  "title": "Keeping a parachute in my high rise apartment.",
  "created_utc": 1655585836,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m moving into a new high rise apartment soon. Before this, all I’ve ever lived in was low level condos. My apartment is on the 31st level so it’s pretty high up. &lt;/p&gt;\n\n&lt;p&gt;I was just telling my friend how I want to bring a parachute with me to my new place. On the news I’ve heard of a lot stories about fires happening in the upper levels of high rises and most exits being cut off and people being trapped. I figured that if this ever happened I could use a parachute to get safely to the ground. &lt;/p&gt;\n\n&lt;p&gt;My friend laughed and called that stupid. Is it actually stupid? Would it not work?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 121,
  "permalink": "/r/NoStupidQuestions/comments/vfbvq6/keeping_a_parachute_in_my_high_rise_apartment/",
  "subreddit": "NoStupidQuestions",
  "id": "vfbvq6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m moving into a new high rise apartment soon. Before this, all I’ve ever lived\nin was low level condos. My apartment is on the 31st level so it’s pretty high\nup.\n\nI was just telling my friend how I want to bring a parachute with me to my new\nplace. On the news I’ve heard of a lot stories about…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もうすぐ新しい高層マンションに引っ越します。それまでは、低層マンションしか住んだことがなかったのですが\n低層マンションに住んでいました。私のマンションは31階なので、かなり高いところです。\n上です。\n\nパラシュートを持って行きたいねと友達に言っていたところです。\nと話していました。ニュースでは、いろいろな話を聞いたが......。",
      "title": "高層マンションにパラシュートを置いていること。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我很快就要搬到一个新的高层公寓。在这之前，我所住过的\n都是低层公寓。我的公寓是在第31层，所以它很高\n了。\n\n我刚刚告诉我的朋友，我想带着降落伞去我的新家。\n的地方。在新闻中，我听说了很多关于...",
      "title": "在我的高楼公寓里放一个降落伞。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我很快就要搬到一個新的高層公寓。在這之前，我所住過的\n都是低層公寓。我的公寓是在第31層，所以它很高\n了。\n\n我剛剛告訴我的朋友，我想帶着降落傘去我的新家。\n的地方。在新聞中，我聽說了很多關於...",
      "title": "在我的高樓公寓裏放一個降落傘。"
    }
  ]
}