{
  "author": "Valynna",
  "original_created_utc": 1633532452,
  "title": "The Panama Papers and Pandora Papers are proof that crypto's primary use is *NOT* tax evasion.",
  "created_utc": 1633555883,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The truth is that tax evasion via legal loopholes is well established both in the developing and in the fully developed world (looking at you Mr. Bezos). </p>\n\n<p>&#x200B;</p>\n\n<p>Cryptocurrency is absolutely not essential, nor used for this purpose, and the recent leaks over the past few years have proved, unequivocally, that tax evasion is NOT the primary function of cryptocurrency. </p>\n\n<p>&#x200B;</p>\n\n<p>I&#39;m very bullish about this, because it hints at actual adoption, speculation, market viability, and true tokenomics outside of shady / grey-market goods. Even the most common purported coin - Monero - which might be used for illicit activities, represents a very small share of the total crypto market cap, and further demonstrates that the true value in crypto is not grey or black market, but truly above board investment, speculation, value storage, and adoption. </p>\n\n<p>&#x200B;</p>\n\n<p>If this isn&#39;t the best news we&#39;ve gotten about crypto in a long time, I don&#39;t know what is.</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/CryptoCurrency/comments/q2m8tx/the_panama_papers_and_pandora_papers_are_proof/",
  "subreddit": "CryptoCurrency",
  "id": "q2m8tx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The truth is that tax evasion via legal loopholes is well established both in\nthe developing and in the fully developed world (looking at you Mr. Bezos).\n\n\n\nCryptocurrency is absolutely not essential, nor used for this purpose, and the\nrecent leaks over the past few years have proved, unequivocally,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "実際のところ、法的な抜け道を利用した脱税は、発展途上国でも先進国でもよく行われています。\n途上国でも先進国でも、法の抜け道を使った脱税はよく行われています（ベゾス氏を見ていると）。\n\n\n\n暗号通貨は絶対に必要ではないし、そのために使われるものでもありません。\nここ数年のリーク情報で、はっきりと証明されています...。",
      "title": "パナマ文書やパンドラ文書は、暗号の主な用途が脱税ではないことを証明しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "事实是，通过法律漏洞逃税的现象在发展中国家和发达国家都很普遍。\n发展中国家和完全发达的世界都是如此（看着你，贝佐斯先生）。\n\n\n\n加密货币绝对不是必要的，也不是用于这一目的，而且\n过去几年中最近的泄密事件已经明确地证明，...",
      "title": "巴拿马文件和潘多拉文件证明，加密货币的主要用途是*不*逃税。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "事實是，通過法律漏洞逃稅的現象在發展中國家和發達國家都很普遍。\n發展中國家和完全發達的世界都是如此（看着你，貝佐斯先生）。\n\n\n\n加密貨幣絕對不是必要的，也不是用於這一目的，而且\n過去幾年中最近的泄密事件已經明確地證明，...",
      "title": "巴拿馬文件和潘多拉文件證明，加密貨幣的主要用途是*不*逃稅。"
    }
  ]
}