{
  "author": "jonasunic0",
  "original_created_utc": 1625174143,
  "title": "What's one coin that's going to probably have a rug pull soon?",
  "created_utc": 1625193650,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I invested $150 into SHIB during its early days. Money I can afford to lose. The good news is that at least my money has doubled even in this bear market. It was a gamble to invest in SHIB. If I lost, I lost $150. If it moons, I get a lot back.</p>\n\n<p>As much as I&#39;d like to continue having high hopes for SHIB, I don&#39;t think it&#39;s going anywhere at this point and a rug pull is imminent. Here are a few points:</p>\n\n<p>&#x200B;</p>\n\n<ol>\n<li>The highly anticipated SHIBASWAP has been in the &quot;soon&quot; phase since April.</li>\n<li>The recent CERTIK AMA really didn&#39;t do much to kill the FUD. All the devs present had answers for questions we already know answers from.</li>\n<li>There&#39;s a huge lack of transparency and accountability from the perspective of the developers.</li>\n<li>The entire ecosystem seems to be ran by a bunch of kids who didn&#39;t expect to coin to become this big so now they&#39;re trying to take it seriously.</li>\n</ol>\n\n<p>On top of all that, the community is toxic as fuck. State facts and they&#39;ll call you out immediately and gang up on you. They also believe that every damn mention or picture of a Shiba Inu dog is about them. Both the coin&#39;s community and devs are hopeless at this point.</p>\n\n<p>I&#39;m giving the coin up until the end of August before a rug pull. A turnaround is welcome though but now, I&#39;m okay with seeing my $150 wasted.</p>\n</div><!-- SC_ON -->",
  "score": 188,
  "permalink": "/r/CryptoCurrency/comments/obvfqu/whats_one_coin_thats_going_to_probably_have_a_rug/",
  "subreddit": "CryptoCurrency",
  "id": "obvfqu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I invested $150 into SHIB during its early days. Money I can afford to lose. The\ngood news is that at least my money has doubled even in this bear market. It was\na gamble to invest in SHIB. If I lost, I lost $150. If it moons, I get a lot\nback.\n\nAs much as I'd like to continue having high hopes for…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はSHIBの初期に150ドルを投資しました。失っても構わないお金です。しかし\n良いニュースは、この弱気な市場でも、少なくとも私の資金は2倍になったことです。それは\nSHIBに投資するのはギャンブルでした。負ければ150ドルの損失。それが月になれば、私は多くを取り戻す\n戻ってきます。\n\nこれからも期待したいところですが・・・。",
      "title": "近いうちにラグプルが起こりそうなコインは何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在SHIB的早期，我向其投资了150美元。这笔钱我输得起。好消息是\n好消息是，即使在这个熊市中，我的钱至少也翻了一番。这是\n投资于SHIB是一场赌博。如果我输了，我输了150美元。如果是月球，我可以得到很多\n回来。\n\n尽管我很想继续对它寄予厚望。",
      "title": "有哪一种硬币可能很快就会出现地毯式下跌？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在SHIB的早期，我向其投資了150美元。這筆錢我輸得起。好消息是\n好消息是，即使在這個熊市中，我的錢至少也翻了一番。這是\n投資於SHIB是一場賭博。如果我輸了，我輸了150美元。如果是月球，我可以得到很多\n回來。\n\n儘管我很想繼續對它寄予厚望。",
      "title": "有哪一種硬幣可能很快就會出現地毯式下跌？"
    }
  ]
}