{
  "author": "AccountToUseHigh",
  "original_created_utc": 1635091942,
  "title": "\"If I had bought BTC in the early at 1 dollar, I would be rich now\". Truth is that you would have sold long before BTC reached even this recent ATH.",
  "created_utc": 1635115177,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Nobody was aware in early phases of crypto that there would be big exchanges, ads, financial firms investing in crypto etc. Nobody didn&#39;t see that coming. Only few people hold from early days. Only few people saw the true potential and understanded it. </p>\n\n<p>But now people are seeing sings that this is future. If you are reading this now. You are early. Things have changed. People now see it as store of value or digital gold. There many great projects now.</p>\n\n<p>Don&#39;t feel bad for that you didn&#39;t bought BTC at dollar or less. You can buy some now. </p>\n\n<p>Invest in projects you believe. Invest only they money you afford to lose. Crypto has so much potential.</p>\n\n<hr/>\n\n<p>EDIT: Added four lines of hopium here to get character limit done.</p>\n\n<p>EDIT 2: It doesn&#39;t show the lines but post got through.</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/CryptoCurrency/comments/qev960/if_i_had_bought_btc_in_the_early_at_1_dollar_i/",
  "subreddit": "CryptoCurrency",
  "id": "qev960",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Nobody was aware in early phases of crypto that there would be big exchanges,\nads, financial firms investing in crypto etc. Nobody didn't see that coming.\nOnly few people hold from early days. Only few people saw the true potential and\nunderstanded it.\n\nBut now people are seeing sings that this is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号の初期段階では、大きな取引所ができることを誰も知らなかった。\n広告、金融会社が暗号に投資することなど、初期の段階では誰も気づいていませんでした。誰もそれを予想していませんでした。\n初期の頃から保持している人はわずかです。真の可能性を見抜き、それを理解していたのはごく少数の人だけです。\n理解していました。\n\nしかし今、人々はこれが...というingsを見ています。",
      "title": "\"初期にBTCを1ドルで買っていたら、今頃はお金持ちだった\"。本当は、BTCが最近の最高値に達するよりもずっと前に売っていたはずです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在加密货币的早期阶段，没有人意识到会有大的交易所。\n广告、金融公司投资加密货币等等。没有人没有看到这一点。\n只有少数人从早期就持有。只有少数人看到了真正的潜力和\n了解了它。\n\n但现在人们看到的是唱，这是...",
      "title": "\"如果我在早期以1美元的价格买入BTC，我现在会很富有\"。事实是，在BTC达到最近的ATH之前，你就已经卖掉了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在加密貨幣的早期階段，沒有人意識到會有大的交易所。\n廣告、金融公司投資加密貨幣等等。沒有人沒有看到這一點。\n只有少數人從早期就持有。只有少數人看到了真正的潛力和\n瞭解了它。\n\n但現在人們看到的是唱，這是...",
      "title": "\"如果我在早期以1美元的價格買入BTC，我現在會很富有\"。事實是，在BTC達到最近的ATH之前，你就已經賣掉了。"
    }
  ]
}