{
  "author": "coopeygfvv",
  "original_created_utc": 1634530106,
  "title": "What are your top coins to invest in for passive income?",
  "created_utc": 1634546641,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Just as the title says what coin or coins are your favorite for passive income. With there being thousands of coins all earning different APY percentages it can be hard to choose which coin my be the best. </p>\n\n<p>When I first learned about staking I thought It would be great to invest in coins with 90% APY like CAKE, but is that 90% going to be a better option than staking something like ETH or BTC at a much smaller amount like 5-7% that may have a better chance for growth and not as risky as an invest. </p>\n\n<p>Through my crypto journey so far I have found a few coins I believe in for the long term not just because of their APY I am earning but they also have a purpose. </p>\n\n<p>So far some of my favorites that I am earning passive income on is ETH, ATOM, DOT, ALGO, XTZ, MATIC, ONE and XPR. </p>\n\n<p>What are some your favorite projects your staking?</p>\n</div><!-- SC_ON -->",
  "score": 161,
  "permalink": "/r/CryptoCurrency/comments/qaf04u/what_are_your_top_coins_to_invest_in_for_passive/",
  "subreddit": "CryptoCurrency",
  "id": "qaf04u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Just as the title says what coin or coins are your favorite for passive income.\nWith there being thousands of coins all earning different APY percentages it can\nbe hard to choose which coin my be the best.\n\nWhen I first learned about staking I thought It would be great to invest in\ncoins with 90%…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトル通り、パッシブインカムに適したコインを教えてください。\n何千種類ものコインがあり、それぞれのコインには異なるAPYが設定されています。\nどのコインが一番いいのかを選ぶのは大変です。\n\n私が初めてstakingを知ったとき、90%のコインに投資できたらいいなと思いました。\n90%のコインに投資するのは素晴らしいことだと思いました...",
      "title": "パッシブ・インカムのために投資するコインの中で、あなたが一番気に入っているものは何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "正如标题所说，你最喜欢哪种或哪几种硬币的被动收入。\n由于有数以千计的硬币，其年收益率各不相同，因此很难选择哪种硬币是最好的。\n很难选择哪种钱币是最好的。\n\n当我第一次了解赌注时，我认为投资于90%的硬币会很好。\n90%的硬币。",
      "title": "你最想投资的被动收入的硬币是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "正如標題所說，你最喜歡哪種或哪幾種硬幣的被動收入。\n由於有數以千計的硬幣，其年收益率各不相同，因此很難選擇哪種硬幣是最好的。\n很難選擇哪種錢幣是最好的。\n\n當我第一次瞭解賭注時，我認爲投資於90%的硬幣會很好。\n90%的硬幣。",
      "title": "你最想投資的被動收入的硬幣是什麼？"
    }
  ]
}