{
  "author": "Additional-Apple-492",
  "original_created_utc": 1655412113,
  "title": "I can’t wait until Bitcoin is under 19K so people can stop saying it doesn’t go past ATH’s",
  "created_utc": 1655436237,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;People are blindly following TA on an asset that’s the most speculative bet of all time.  Bitcoin will do what it wants and will shake out the non believers.  It will humble you.  It might not even drop below 20K to humble me.  It would be healthy for Bitcoin to drop to covid bottoms of 3K.     ARK, square, shopify, Netflix have already done this.  The average person can finally become a full coiner and the grifters can sell at a loss.  Bitcoin is here to stay and will reward those who can stomach the 95 percent drops.  This is bitcoins second true test.  It’s survived a pandemic.  It will survive a recession.  It will just destroy your soul and belief along the way.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 369,
  "permalink": "/r/CryptoCurrency/comments/vdvfoh/i_cant_wait_until_bitcoin_is_under_19k_so_people/",
  "subreddit": "CryptoCurrency",
  "id": "vdvfoh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "People are blindly following TA on an asset that’s the most speculative bet of\nall time. Bitcoin will do what it wants and will shake out the non believers. It\nwill humble you. It might not even drop below 20K to humble me. It would be\nhealthy for Bitcoin to drop to covid bottoms of 3K. ARK,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "人々は、最も投機的な賭けである資産のTAに盲目的に従っているのです。\nTAに盲従しています。ビットコインはやりたい放題で、信者でない人たちを振り落とすでしょう。それは\nを謙虚にすることでしょう。私を謙虚にするために20Kを下回ることもないかもしれません。それは\nビットコインは3Kのコビドボトムまで落ちるのが健全です。ARK,...",
      "title": "ビットコインが19K以下になるまで待てない。そうすれば、ATHを超えないと言う人がいなくなる。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "人们盲目地追随TA购买一种资产，而这种资产是最具有投机性的赌注。\n的资产上盲目追随TA，而这是有史以来最具投机性的赌注。比特币将做它想做的事，并将震出不相信的人。它\n会让你感到羞愧。它甚至可能不会跌到20K以下来羞辱我。这将是\n比特币跌到3K的谷底才是健康的。ARK，...",
      "title": "我等不及了，直到比特币低于19K，这样人们就可以不再说它不会超过ATH了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "人們盲目地追隨TA購買一種資產，而這種資產是最具有投機性的賭注。\n的資產上盲目追隨TA，而這是有史以來最具投機性的賭注。比特幣將做它想做的事，並將震出不相信的人。它\n會讓你感到羞愧。它甚至可能不會跌到20K以下來羞辱我。這將是\n比特幣跌到3K的谷底纔是健康的。ARK，...",
      "title": "我等不及了，直到比特幣低於19K，這樣人們就可以不再說它不會超過ATH了。"
    }
  ]
}