{
  "author": "hooman_or_whatever",
  "the_new_excerpt": "Hello Reddit,\n\nGME is not a question of a business model in the future, it is a question of\nright now. I understand the need for numbers and figures, I do. Technical and\nfundamental research is viable and necessary, but one very over looked method of\nanalysis is philosophical. We have seen DD after…",
  "original_created_utc": 1607580925,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "你好，Reddit，\n\nGME不是未来商业模式的问题，而是\n现在就来。我明白需要数字和数字，真的。技术和\n基础研究是可行的，也是必要的，但一种非常被忽视的方法\n分析是哲学的。我们已经看到了…之后的DD",
      "title": "GME要么被挤兑，要么被摘牌--谁会赢，谁会被挤兑？这里的预测"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好，Reddit，\n\nGME不是未來商業模式的問題，而是\n現在就來。我明白需要數字和數字，真的。技術和\n基礎研究是可行的，也是必要的，但一種非常被忽視的方法\n分析是哲學的。我們已經看到了…之後的DD",
      "title": "GME要麼被擠兌，要麼被摘牌--誰會贏，誰會被擠兌？這裏的預測"
    }
  ],
  "title": "GME Either Squeezes or Gets Delisted - Who Will Win Short or Squeeze? Predictions here",
  "created_utc": 1607945298,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello Reddit,</p>\n\n<p>GME is not a question of a business model in the future, it is a question of right now. I understand the need for numbers and figures, I do. Technical and fundamental research is viable and necessary, but one very over looked method of analysis is philosophical. We have seen DD after DD talking about the numbers and the business model. But I want to share some thoughts with you of my logical thinking and would love to see counter points.</p>\n\n<p><strong>First Let&#39;s Recap</strong></p>\n\n<p><strong>Pre-Earnings (Aug-Dec)</strong></p>\n\n<p>Already was running up and then <a href=\"/r/wallstreetbets\">r/wallstreetbets</a> massive hype of a short squeeze and Cohen letters leads to a run-up followed by a sell-off due to overbuying.</p>\n\n<p><strong>During Earnings (12/7):</strong></p>\n\n<p><a href=\"https://www.fool.com/earnings/call-transcripts/2020/12/09/gamestop-gme-q3-2020-earnings-call-transcript/\">Earnings Call Transcript</a></p>\n\n<p>The conversation and presentation actually had good content. Their balance sheet looks fantastic; eliminated debt, reduced costs, making changes towards the digital transformation, e-commerce way up, console sales upcoming, new inventory and other positives they didn&#39;t even mention like the <a href=\"https://news.microsoft.com/2020/10/08/gamestop-announces-multiyear-strategic-partnership-with-microsoft/\">Microsoft deal</a>. But the stock plummets...why?</p>\n\n<p>There were two pieces of &quot;bad news&quot;: &quot;missed revenue&quot; and &quot;shelf offering&quot; which PR blasted in a very negative light taking it completely out of context. Revenue missed was expected, not just because it&#39;s GME but because of COVID-19 effects on a retail business.</p>\n\n<p>Revenue: Loss was expected, not just because it&#39;s GME but because of COVID-19 effects on a retail business.</p>\n\n<p>Shelf offering: $100M and has two years to be used.</p>\n\n<p>First comment was by Jim Bell: &quot;&quot;However, as a pragmatic matter initiating this program provides us with the maximum flexibility and optionality to further bolster our balance sheet and liquidity position and increase flexibility gives us the ability to leverage opportunities to accelerate our transformational strategies, such as increasing the speed at which we elevate expand our omni-channel strategy while further ensuring minimal disruption from any potential further pandemic impacts around the world.&quot;</p>\n\n<p>When asked by William Reuter from BoA. &quot;OK. And then, in terms of the new shelf, you know, I saw that you mentioned general corporate purposes. Would you consider issuing stocks to repay debt under that program?&quot;</p>\n\n<p>George Sherman responded: &quot;No, that&#39;s absolutely not the intent. The intent here is to simply optimize flexibility and optionality. Period. There is a lot of unknowns going on in the marketplace with respect to this pandemic, ongoing flex of cases across the world, the impacts on our own businesses.&quot;</p>\n\n<p>My thought: It&#39;s a defense mechanism to attempt to do one of three things:</p>\n\n<ol>\n<li>Help combat against a Cohen takeover</li>\n<li>Collect profits on their way out because they know a short squeeze is imminent</li>\n<li>They truly want to use it as they said</li>\n</ol>\n\n<p>My issue with 3 and what they said when asked by William Reuter, is that they have significantly improved the balance sheet and COVID-19 vaccinations have begun, not to mention they are intending on shifting focus on e-commerce, so it just struck me as a very odd reasons for a shelf offer.</p>\n\n<p>Nonetheless, during this call the share price absolutely plummets, but why? We received a lot of good news and two pieces of &quot;bad news&quot;. One was expected (revenue loss) and one was addressed during the call (shelf offering). There was no intent on share dilution at least not anytime soon.</p>\n\n<p>My thoughts: Only thing I can think is PR putting a negative spin, but more-so it was the bears using the negative PR to their advantage to drive the price down. $14 was the floor by the end of AH.</p>\n\n<p><strong>Post Earnings (12/9):</strong></p>\n\n<p>A war rages over $14 keeping it nearly level the entire day.</p>\n\n<p>My thoughts: Bears expected much lower yet the bulls fought hard. On a bleeding red day where bulls clearly had the disadvantaged portfolios, they were able to support and actually start a small uptrend.</p>\n\n<p>#WeWantCohen starts trending and Ryan Cohen puts out a <a href=\"https://twitter.com/ryancohen/status/1336775515101949963\">cryptic Tweet</a>.</p>\n\n<p>My thoughts: He is completely dissatisfied with management and their ability to address his concerns outline in the letter. After ER the PR that went out and thoughts on the future of the company could have been beautiful if addressed and pitched correctly. Management did not provide comfort in the eyes of anyone and the stock price reflects that as does the PR.</p>\n\n<p><strong>What&#39;s Next?</strong></p>\n\n<p>The moment you&#39;ve all been waiting for. Let&#39;s gather some facts.</p>\n\n<ol>\n<li>Individuals own 9.87%</li>\n<li>Cohen (RC) owns 9.98%</li>\n<li>Michael Burry ( Scion) owns 2.44%</li>\n<li>GameStop Market Cap $890.11 Million</li>\n<li>Cohen net worth $600 Million</li>\n</ol>\n\n<p>Cohen could either purchase enough shares to have majority vote or he can outright make an offer to buy the company. So why hasn&#39;t he?</p>\n\n<p>There are two current possibilities:</p>\n\n<ol>\n<li>He conducts a hostile takeover.</li>\n<li>He has no plans to conduct a hostile takeover.</li>\n</ol>\n\n<p>Reason 1 probable timing and outcome: If you were about to make a large purchase, wouldn&#39;t you want to get it at the best price possible? He&#39;s waiting until he feels like we are actually at the floor before making a move. Truthfully, all he has to do is speak. If he even mentions an intent of acquisition the shorts will run and the bulls will pile in triggering the squeeze. <strong>Bulls win</strong></p>\n\n<p>Reason 2 is interesting because why would he own 10% of a company where he clearly doesn&#39;t believe in current management? So, if a hostile takeover isn&#39;t the reason, then what is?</p>\n\n<p>I can think of two possibilities:</p>\n\n<ol>\n<li>There is already something happening behind the scenes to peacefully put Cohen into a position of power. <strong>Bulls win</strong></li>\n<li>He thought being 10% owner would give him a large enough voice to be convincing, when he realized the board does not share his vision, he pulls out. <strong>Bears win</strong></li>\n</ol>\n\n<p>Now, this is interesting.</p>\n\n<p>Reason 1 seems highly unlikely to me simply due to his tweet today. If there were plans for a peaceful transition of power, I don&#39;t think he would add fuel to the fire of bad PR clearly doubting managements skills.</p>\n\n<p>Reason 2 is juicy. Between RC, Scion and Individual investors who all want to see Cohen at the helm, that accounts for 22.29% of the company. If RC pulls out, the rest follow, no bulls left to fight the bears, the institutions pull out and GME becomes a penny stock.</p>\n\n<p>My overall prediction is the <strong>bulls win.</strong> The reason being, I can chart one path to victory for the bears but many paths to victory for the bulls. Also, I do not think we will need to wait until Q4ER to see the squeeze. From each scenario I could think of, Cohen would act sooner rather than later if he intends on purchasing or accumulating enough shares for proxy in order to get the best price possible.</p>\n\n<p>Notice how nothing I said has to do with the future of the business or the business model as a whole? That&#39;s because that doesn&#39;t matter. Q4 earnings will boost the price high enough for bulls to profit a little and then get out if they don&#39;t believe in the company. The overall longevity of the company is a completely different debate.</p>\n\n<p>Feel free to counter-point in the comments.</p>\n\n<p><strong>TLDR:</strong> You should read.</p>\n\n<p><strong>EDIT:</strong> The title says delisted but perhaps should say “drops to $0”</p>\n</div><!-- SC_ON -->",
  "score": 440,
  "permalink": "/r/stocks/comments/kaa2qh/gme_either_squeezes_or_gets_delisted_who_will_win/",
  "subreddit": "stocks",
  "id": "kaa2qh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609260493099
}