{
  "author": "uhsauh",
  "original_created_utc": 1626377045,
  "title": "Just Released! The latest issue of my newsletter sharing tips to elevate your design and marketing",
  "created_utc": 1626411410,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi everyone! I write a free newsletter called <a href=\"https://fonts.substack.com/\">FontDiscovery.</a>Every week I create a digestible visual guide about fonts, marketing, and design ideas to help founders and markers step up their marketing and get creative.</p>\n\n<p>This week, I share tips about how to elevate visuals and communicate modern. if you have to create designs, try these and let me know what you think!</p>\n\n<p><strong>A useful font to communicate modern:  Daubenton</strong></p>\n\n<p>Daubenton is inspired by the engraved letters found in the Museum. its inspiration was a traditional serif with a natural, calligraphic touch. The designer upgraded this traditional sensibility by decreasing the contrast in the strokes and exaggerating the geometric aspects. This resulted in an eclectic style that communicates modernity and elevation. It can be used for logos and branding.</p>\n\n<p><strong>Design idea: elevate visuals with  Dynamic Diagonal</strong> </p>\n\n<p>Ellen Lupton, the senior curator at Smithsonian Design Museum, published a book explaining the magic behind what makes posters work as visuals.  </p>\n\n<p><strong>Her key findings?</strong> A majority of poster compositions relied on diagonals to cut across the composition to create eye-catching details. Diagonal lines make our eyes scan across a visual with ease and have a more engaging way of breaking up the negative and positive spaces. If you want to spice up your visual, consider creating diagonal lines in your design.</p>\n\n<p>I share tips like this weekly, you can <a href=\"https://fonts.substack.com/\">subscribe</a> if you feel like. If you would like to read the original post, you can see it at fonts.substack.com.</p>\n\n<p><a href=\"https://preview.redd.it/7vkb3m94gfb71.png?width=1518&amp;format=png&amp;auto=webp&amp;s=73f9c175227b8a45695fb83f39d3106563c057fb\">https://preview.redd.it/7vkb3m94gfb71.png?width=1518&amp;format=png&amp;auto=webp&amp;s=73f9c175227b8a45695fb83f39d3106563c057fb</a></p>\n</div><!-- SC_ON -->",
  "score": 5,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/a5PhFETfqFctRXwGV7ZYGJjIbXlG0-xXnOxTSm9iMWE.jpg?auto=webp&s=7cb4631efd5b5fb2cb1f03b8831e740a5dd043e6",
          "width": 256,
          "height": 256
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/a5PhFETfqFctRXwGV7ZYGJjIbXlG0-xXnOxTSm9iMWE.jpg?width=108&crop=smart&auto=webp&s=44376c0332eeaf37e85d2d72ce732d50b824b34a",
            "width": 108,
            "height": 108
          },
          {
            "url": "https://external-preview.redd.it/a5PhFETfqFctRXwGV7ZYGJjIbXlG0-xXnOxTSm9iMWE.jpg?width=216&crop=smart&auto=webp&s=d7e295db37c60badb471dba68e9caff870519131",
            "width": 216,
            "height": 216
          }
        ],
        "variants": {},
        "id": "fdyDtJTz813SqxfOP2HvhQ53H5s8ngGWGLg-L_0gKNQ"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/SideProject/comments/okzxme/just_released_the_latest_issue_of_my_newsletter/",
  "subreddit": "SideProject",
  "id": "okzxme",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi everyone! I write a free newsletter called FontDiscovery.\n[https://fonts.substack.com/]Every week I create a digestible visual guide about\nfonts, marketing, and design ideas to help founders and markers step up their\nmarketing and get creative.\n\nThis week, I share tips about how to elevate…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。私はFontDiscoveryという無料のニュースレターを書いています。\n[https://fonts.substack.com/]毎週、フォントやマーケティング、デザインのアイデアについて、消化しやすいビジュアルガイドを作成しています。\nフォント、マーケティング、デザインのアイデアについて、消化しやすいビジュアルガイドを作成しています。\n創始者やマーカーがマーケティングを強化し、クリエイティブになるのを助けるために。\n\n今週は、フォントをより良くするためのヒントをご紹介します...",
      "title": "発売しました。あなたのデザインとマーケティングを向上させるためのヒントを共有する私のニュースレターの最新号です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好! 我写了一份名为FontDiscovery的免费通讯。\n[https://fonts.substack.com/]每周我都会创建一个关于字体、营销和设计理念的可消化的视觉指南，以帮助创始人和标记者提高他们的工作效率。\n字体、营销和设计理念，以帮助创始人和标记者加强他们的\n营销并获得创意。\n\n本周，我分享了关于如何提升字体的技巧。",
      "title": "刚刚发布! 我的最新一期通讯，分享提升你的设计和营销的技巧"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好! 我寫了一份名爲FontDiscovery的免費通訊。\n[https://fonts.substack.com/]每週我都會創建一個關於字體、營銷和設計理念的可消化的視覺指南，以幫助創始人和標記者提高他們的工作效率。\n字體、營銷和設計理念，以幫助創始人和標記者加強他們的\n營銷並獲得創意。\n\n本週，我分享了關於如何提升字體的技巧。",
      "title": "剛剛發佈! 我的最新一期通訊，分享提升你的設計和營銷的技巧"
    }
  ]
}