{
  "author": "WoiLou",
  "the_new_excerpt": "Netflix reported 208 million global subscribers as of the end of the first\nquarter, missing its own prediction for 210 million.\n\nThe streaming giant did beat financial targets, though with earnings per share\nof $3.75 coming in well ahead of Wall Street analysts’ expectations. Revenue of\n$7.16…",
  "original_created_utc": 1619006842,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Netflixは、第1四半期末時点の全世界の加入者数が2億800万人であると発表しました。\nNetflixは、第1四半期末時点の世界の加入者数を2億800万人と発表しました。\n\nしかし、1株当たり利益は3.75ドルとなり、ウォール街のアナリストの予想を大きく上回りました。\n1株当たり利益は3.75ドルとなり、ウォール街のアナリストの予想を大きく上回りました。売上高は\n$7.16...",
      "title": "Netflix、Covid-19問題の影響で第1四半期の加入者数目標を下回るも、財務予測は上回る"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Netflix报告说，截至第一季度末，全球有2.08亿用户。\n季度，没有达到其自己预测的2.1亿。\n\n这个流媒体巨头确实超越了财务目标，但其每股收益\n3.75美元，远远超过华尔街分析师的预期。收入为\n$7.16...",
      "title": "Netflix未能达到第一季度的用户目标，归咎于Covid-19问题，但超过了财务预测。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Netflix報告說，截至第一季度末，全球有2.08億用戶。\n季度，沒有達到其自己預測的2.1億。\n\n這個流媒體巨頭確實超越了財務目標，但其每股收益\n3.75美元，遠遠超過華爾街分析師的預期。收入爲\n$7.16...",
      "title": "Netflix未能達到第一季度的用戶目標，歸咎於Covid-19問題，但超過了財務預測。"
    }
  ],
  "title": "Netflix Misses Q1 Subscriber Targets, Blaming Covid-19 Issues, But Beats Financial Forecasts",
  "created_utc": 1619012542,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Netflix reported 208 million global subscribers as of the end of the first quarter, missing its own prediction for 210 million.</p>\n\n<p>The streaming giant did beat financial targets, though with earnings per share of $3.75 coming in well ahead of Wall Street analysts’ expectations. Revenue of $7.16 billion also topped the Street.</p>\n\n<p>The subscriber shortfall, which caused the stock to drop more than 10% in after-hours trading, was blamed on issues related to the coronavirus. Simply put, the pandemic gaveth, but also taketh away. “We believe paid membership growth slowed due to the big Covid-19 pull forward in 2020 and a lighter content slate in the first half of this year, due to Covid-19 production delays,” the company said in its quarterly letter to shareholders. “We continue to anticipate a strong second half with the return of new seasons of some of our biggest hits and an exciting film lineup.”</p>\n\n<p>Net cash from operations surged to $777 million in the quarter from $260 million and free cash flow of $692 million was up from $162 million. Netflix confirmed a key metric — that it’s on track to free cash flow break even this year and doesn’t need outside financing anymore to fund day-to-day business. That was a milestone affirmed in the company’s January report, and only reaffirmed the bull thesis as the entire entertainment business continues its shift to streaming.</p>\n\n<p>&nbsp;</p>\n\n<p>Continues here - <a href=\"https://deadline.com/2021/04/netflix-misses-q1-subscriber-targets-first-quarter-2021-covid-19-streaming-1234739802/\">https://deadline.com/2021/04/netflix-misses-q1-subscriber-targets-first-quarter-2021-covid-19-streaming-1234739802/</a></p>\n</div><!-- SC_ON -->",
  "score": 1405,
  "permalink": "/r/investing/comments/mve8vh/netflix_misses_q1_subscriber_targets_blaming/",
  "subreddit": "investing",
  "id": "mve8vh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171524775
}