{
  "author": "Suwon",
  "original_created_utc": 1641907904,
  "title": "It's the 1880s. I'm a Russian school teacher and I want to buy a copy of The Brothers Karamazov. How much does it cost? Do I need to travel to a large city to find a bookstore? How easily can I find this (or any) particular book for sale?",
  "created_utc": 1641920109,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Or if this question is too specific, generally speaking, what was the book market like in the late 19th century in Europe?  Would a literate person of modest means (e.g, a teacher or store clerk) be able to easily afford and shop for contemporary books?  Or were books still a bit of a luxury at this time?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 122,
  "permalink": "/r/AskHistorians/comments/s1cyuu/its_the_1880s_im_a_russian_school_teacher_and_i/",
  "subreddit": "AskHistorians",
  "id": "s1cyuu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Or if this question is too specific, generally speaking, what was the book\nmarket like in the late 19th century in Europe? Would a literate person of\nmodest means (e.g, a teacher or store clerk) be able to easily afford and shop\nfor contemporary books? Or were books still a bit of a luxury at this…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "あるいは、この質問があまりに具体的であれば、一般的に、書籍はどのようなものであったか\n19世紀末のヨーロッパ市場はどうだったのでしょうか。識字率の高い人が\n教師や店員など、ささやかな身分の人が簡単に購入し、買い物をすることができたのでしょう。\n現代の書籍のために？それとも、この時代、本はまだ少し贅沢品だったのでしょうか？",
      "title": "1880年代のことだ。私はロシア人学校の教師ですが、『カラマーゾフの兄弟』を買いたいのです。値段はいくらですか？書店を探すには大きな都市に行く必要がありますか？この本（あるいは他の本）が売られているところを簡単に見つけることができますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果这个问题太具体，一般来说，19世纪末欧洲的图书市场是怎样的？\n19世纪末欧洲的图书市场是什么样的？一个识字不多的人（如教师或店员）是否能够轻易地买得起书，并能在商店里购物？\n一个经济条件一般的人（如教师或店员）能够轻易地买得起和买到当代书籍吗？\n购买当代书籍？或者说，在这个时候，书籍仍然是一种奢侈品......",
      "title": "现在是19世纪80年代。我是一名俄罗斯学校教师，我想买一本《卡拉马佐夫兄弟》。它的价格是多少？我需要到大城市去找一家书店吗？我如何能轻易找到这本（或任何）特定的书来出售？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果這個問題太具體，一般來說，19世紀末歐洲的圖書市場是怎樣的？\n19世紀末歐洲的圖書市場是什麼樣的？一個識字不多的人（如教師或店員）是否能夠輕易地買得起書，並能在商店裏購物？\n一個經濟條件一般的人（如教師或店員）能夠輕易地買得起和買到當代書籍嗎？\n購買當代書籍？或者說，在這個時候，書籍仍然是一種奢侈品......",
      "title": "現在是19世紀80年代。我是一名俄羅斯學校教師，我想買一本《卡拉馬佐夫兄弟》。它的價格是多少？我需要到大城市去找一家書店嗎？我如何能輕易找到這本（或任何）特定的書來出售？"
    }
  ]
}