{
  "author": "634425",
  "original_created_utc": 1631863824,
  "title": "In the song, 'Good 'Ol Rebel,' the speaker says he \"hates the Constitution\" and \"hates the Declaration of Independence\" Did any Confederates actually reject the American experiment outright?",
  "created_utc": 1631910064,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I know that for the most the Confederates revered the founding fathers and the revolutionary generation, and accused the north of trampling on the founding principles, and even put George Washington on their national seal. </p>\n\n<p>However, there are a few scattered anecdotes and bits of trivia that seem to suggest another strain of thought--one that spurned the American legacy outright. </p>\n\n<p>For example,</p>\n\n<p>There&#39;s a pretty well-known/popular song from after the war called <a href=\"https://www.youtube.com/watch?v=3uRZYNcYR-w\">&quot;The Good &#39;Ol Rebel.&quot;</a>. It&#39;s a lament of the southern defeat, but includes the following lyrics: </p>\n\n<blockquote>\n<p>I hates the Constitution, this great republic, too...I hates the Declaration of Independence, too!</p>\n</blockquote>\n\n<p>This strikes me as interesting because it seems to indicate a rejection not only of the contemporary (1865 contemporary, that is) federal government, but of even the earliest symbols of the American republic.</p>\n\n<p>I get that the song is a little tongue in cheek, but it&#39;s still a long list of things associated with the &quot;north&quot; that a the author imagines a stereotypical &#39;reb&#39; might hate, so it still seems telling to me that he throws in the Constitution and the Declaration. </p>\n\n<p>Alexander Stephens&#39; infamous Cornerstone Speech seems to recapitulate some of the same ideas in a more sophisticated fashion, particularly when he says:</p>\n\n<blockquote>\n<p>Our new government is founded upon exactly the opposite [of Thomas Jefferson&#39;s] ideas</p>\n</blockquote>\n\n<p>According to Don H. Doyle&#39;s, <em>The Cause of All Nations</em>:</p>\n\n<blockquote>\n<p>South Carolina’s leading men seemed especially eager to let Russell\nknow of their feelings of kinship with the European aristocracy, whose landed wealth and habits of mastery alone bred the proper requisites for public leadership. Russell was fascinated by their repeated expressions “of regret for the rebellion of 1776 and the desire that if it came to the worst England would receive back her erring children or give them a prince under whom they could secure a monarchical form of government.” (Louisianans, he later learned in his travels, preferred reunion with their former  “mother country,” France.) There was general agreement that this desire for reunion with Britain could not be practically gratified, at least not until independence was secured, Russell told his readers, “but the admiration for monarchical institutions on the English model, for privileged classes, and for a landed aristocracy and gentry, is undisguised and apparently genuine.”</p>\n</blockquote>\n\n<p>So how prevalent was the sentiment among Confederates that &quot;this whole thing was a mistake--let&#39;s start over&quot;? Was it common or almost negligible?</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/ppvkl4/in_the_song_good_ol_rebel_the_speaker_says_he/",
  "subreddit": "AskHistorians",
  "id": "ppvkl4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I know that for the most the Confederates revered the founding fathers and the\nrevolutionary generation, and accused the north of trampling on the founding\nprinciples, and even put George Washington on their national seal.\n\nHowever, there are a few scattered anecdotes and bits of trivia that seem…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "連合国側は、ほとんどの場合、建国の父や革命世代を敬い、北側が建国を踏みにじっていると非難していたことは知っています。\n盟約者団は建国の父や革命世代を尊敬し、北側が建国の理念を踏みにじっていると非難した。\nジョージ・ワシントンを国璽に採用したこともあります。\n\nしかし、いくつかの逸話やトリビアが散見され、それらは...",
      "title": "Good 'Ol Rebel」という曲の中で、話者は「憲法が嫌い」「独立宣言が嫌い」と言っていますが、実際にアメリカの実験を真っ向から否定した南部連合の人々はいたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道，在大多数情况下，南方人崇尚开国元勋和革命一代。\n革命的一代，并指责北方践踏了建国原则。\n践踏建国原则，甚至把乔治-华盛顿放在他们的国玺上。\n\n然而，有一些零散的轶事和琐事，似乎...",
      "title": "在《善良的反叛者》这首歌中，演讲者说他 \"憎恨宪法 \"和 \"憎恨独立宣言\"，是否有任何邦联人真的彻底拒绝美国的实验？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道，在大多數情況下，南方人崇尚開國元勳和革命一代。\n革命的一代，並指責北方踐踏了建國原則。\n踐踏建國原則，甚至把喬治-華盛頓放在他們的國璽上。\n\n然而，有一些零散的軼事和瑣事，似乎...",
      "title": "在《善良的反叛者》這首歌中，演講者說他 \"憎恨憲法 \"和 \"憎恨獨立宣言\"，是否有任何邦聯人真的徹底拒絕美國的實驗？"
    }
  ]
}