{
  "author": "hotchocolate216",
  "original_created_utc": 1644156889,
  "title": "Do people really think black people can’t be racist?",
  "created_utc": 1644168897,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I saw a black man (age 30) post on Facebook that black people can’t be racist, only prejudice. I was so confused and had to say something. I told him ANY race can be racist. There was some back and forth and he ended it by calling me delusional because I gave the definition of racism. &lt;/p&gt;\n\n&lt;p&gt;Logically, he didn’t make sense and he kept saying “they” (referring to white people) change the definition of racism, which also sounded crazy.&lt;/p&gt;\n\n&lt;p&gt;I am a black woman (28). Unfortunately, my dad is the most racist man I know. For clarity, he is also black.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/TooAfraidToAsk/comments/slxmmn/do_people_really_think_black_people_cant_be_racist/",
  "subreddit": "TooAfraidToAsk",
  "id": "slxmmn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I saw a black man (age 30) post on Facebook that black people can’t be racist,\nonly prejudice. I was so confused and had to say something. I told him ANY race\ncan be racist. There was some back and forth and he ended it by calling me\ndelusional because I gave the definition of racism.\n\nLogically,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "黒人（30歳）がFacebookで「黒人は人種差別をすることはできない」と投稿しているのを見た。\n偏見しかない。私はとても混乱し、何か言わなければと思いました。私は彼に、どのような人種でも\nは人種差別主義者になりうる。少しやり取りがありましたが、最後に彼は私をこう呼びました。\n私が人種差別の定義を述べたからです。\n\n論理的には...",
      "title": "黒人は人種差別をしないとでも思っているのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我看到一个黑人（30岁）在Facebook上发帖说，黑人不可能是种族主义者。\n只有偏见。我很困惑，不得不说些什么。我告诉他，任何种族\n都可以是种族主义者。大家来来回回地讨论，最后他说我\n妄想，因为我给出了种族主义的定义。\n\n从逻辑上讲，..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到一個黑人（30歲）在Facebook上發帖說，黑人不可能是種族主義者。\n只有偏見。我很困惑，不得不說些什麼。我告訴他，任何種族\n都可以是種族主義者。大家來來回回地討論，最後他說我\n妄想，因爲我給出了種族主義的定義。\n\n從邏輯上講，...",
      "title": "黒人は人種差別をしないとでも思っているのだろうか。"
    }
  ]
}