{
  "author": "JONUTUNIVERSALU",
  "original_created_utc": 1635606419,
  "title": "This subreddit is a big reason of why we're seeing Cat Coins pump, and you can't deny it. The people have asked for them, and they were delivered",
  "created_utc": 1635633639,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Specifically <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/qhm7w1/why_is_there_a_lack_of_cat_coins_in_the_crypto/\">this post that has been removed for some reason</a> is one of the first results you get when searching for &quot;cat coins&quot; or &quot;crypto cat coins&quot; on Google. It&#39;s massive, it got so much attention that most dead cat coin projects came back to life and others were born.</p>\n\n<p>Not only that, but because of how popular the post was, the daily discussions are being flooded with people shilling their favorite cat coins and arguing whether or not it is going to be the next big thing after the dog coins. </p>\n\n<p>Twitter is going crazy with all these different Cat coins and I&#39;ve seen one of them be on the trending.</p>\n\n<p>Now very important, let&#39;s take a look at how has this affected the prices of Cat coins recently:</p>\n\n<ol>\n<li>Catgirl($CATGIRL) - up +750% in the last 7 days with an estimated volume of 30 million dollars in the last 24h</li>\n<li>Catecoin($CATE) - up +337% in the last 7 days, +80% in the last 24h with an estimated volume of 6 million dollars in the last 24h and a market cap of 110 million dollars</li>\n<li>CatzCoin ($CATZ) - up +5357.3%  in the last 7 days, +2086.2% in the last 24h with an estimated volume of 4 million dollars in the last 24h </li>\n<li>Kitty Inu($KITTY) - up +3000% in the last 5 days (newly released) with an estimated volume of 5 million dollars in the last 24h </li>\n</ol>\n\n<p>I know this subreddit has a hate for shitcoins with no real utility, but we can&#39;t deny the fact that these meme coins make people tons of money. If you can&#39;t beat them, join them, right? (not financial advice)</p>\n\n<p>What are your thoughts on this? Will cat coins survive and prosper like the dog coins, or not?</p>\n</div><!-- SC_ON -->",
  "score": 169,
  "permalink": "/r/CryptoCurrency/comments/qj3d4e/this_subreddit_is_a_big_reason_of_why_were_seeing/",
  "subreddit": "CryptoCurrency",
  "id": "qj3d4e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Specifically this post that has been removed for some reason\n[https://www.reddit.com/r/CryptoCurrency/comments/qhm7w1/why_is_there_a_lack_of_cat_coins_in_the_crypto/]\nis one of the first results you get when searching for \"cat coins\" or \"crypto\ncat coins\" on Google. It's massive, it got so much…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "具体的には、なぜか削除されてしまったこの投稿\n[https://www.reddit.com/r/CryptoCurrency/comments/qhm7w1/why_is_there_a_lack_of_cat_coins_in_the_crypto/]\nは、Googleで「cat coins」や「crypto」を検索した際に最初に表示される結果の一つです。\ncat coins」をGoogleで検索したときの最初の検索結果です。大量に出てきて、こんなにも...",
      "title": "このサブレディットは、私たちがCat Coinsのポンプを見ている大きな理由であり、それを否定することはできません。人々はそれらを求めており、それらは配信されました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "特别是这个因某种原因被删除的帖子\n[https://www.reddit.com/r/CryptoCurrency/comments/qhm7w1/why_is_there_a_lack_of_cat_coins_in_the_crypto/]\n是你在谷歌上搜索 \"猫币 \"或 \"加密货币 \"时得到的第一个结果之一。\n猫币 \"时得到的第一个结果。它的规模很大，它得到了这么多...",
      "title": "这个分论坛是我们看到猫币抽水的一个重要原因，你不能否认。人们要求它们，而它们被送到了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "特別是這個因某種原因被刪除的帖子\n[https://www.reddit.com/r/CryptoCurrency/comments/qhm7w1/why_is_there_a_lack_of_cat_coins_in_the_crypto/]\n是你在谷歌上搜索 \"貓幣 \"或 \"加密貨幣 \"時得到的第一個結果之一。\n貓幣 \"時得到的第一個結果。它的規模很大，它得到了這麼多...",
      "title": "這個分論壇是我們看到貓幣抽水的一個重要原因，你不能否認。人們要求它們，而它們被送到了。"
    }
  ]
}