{
  "author": "The_Book_of_Life",
  "original_created_utc": 1640508977,
  "title": "Why web3 will change the rules of the game and kick start a crypto currency super cycle",
  "created_utc": 1640525573,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Maybe, some of you have seen the SOS drop to OpenSea users. For everyone not being aware of what happened, here&amp;#39;s the TL;DR: &amp;quot;A new project (OpenDAO) did an airdrop of their SOS-tokens to everyone that was using OpenSea in the past. Users who used it more and had higher transaction volumes, received more tokens.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Now, what&amp;#39;s so exciting about that? First, this airdrop was only possible because of the transparancy of a Blockchain. Without it, the OpenDAO would not have been able to verify which person is eligible to how many tokens. Second, they didn&amp;#39;t have to ask OpenSea whether they could have this data but just took it from the Blockchain itself. Third, they reached critical mass within a few hours.&lt;/p&gt;\n\n&lt;p&gt;In this new world, there will be no gatekeepers and de facto entry barriers into a new market (as we have with today&amp;#39;s platform business models in the digital space). With a single line of code (well, it were a bit more) OpenDAO reached every single OpenSea user overnight. If they would - for example - create a better marketplace for NFTs, people can switch over to them with one click (it&amp;#39;s not yet that easy because OpenSea fucked up the &amp;quot;saving&amp;quot; of the NFT data). It doesn&amp;#39;t matter on which &amp;quot;platform island&amp;quot; you are. They&amp;#39;re all connected via bridges with each other.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s like if a random guy could come along, program an Instagram-like social media application in a more decentralized and fair way, then all the current Instagram users would receive tokens from this new project which makes them owner of the service they actually use (and not the product). Then, they could switch in one click, take all their data with them and start on this new and fairer platform. Guys, this is HUGE!!!&lt;/p&gt;\n\n&lt;p&gt;PS: Watch out. In the coming weeks there will be a lot of similar projects &amp;quot;doing the same thing&amp;quot; but only trying to scam you out of your hard earned money.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 162,
  "permalink": "/r/CryptoCurrency/comments/rot7ul/why_web3_will_change_the_rules_of_the_game_and/",
  "subreddit": "CryptoCurrency",
  "id": "rot7ul",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Maybe, some of you have seen the SOS drop to OpenSea users. For everyone not\nbeing aware of what happened, here's the TL;DR: \"A new project (OpenDAO) did an\nairdrop of their SOS-tokens to everyone that was using OpenSea in the past.\nUsers who used it more and had higher transaction volumes,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もしかしたら、OpenSeaユーザーへのSOS投下をご覧になった方もいらっしゃるかもしれませんね。そうでない方のために\n新しいプロジェクト(OpenDAO)が、このようなことを行いました。\nSOSトークンを、過去にOpenSeaを使用していた人たち全員にエアドロップしました。\nより多く使用し、取引量の多いユーザーは、...",
      "title": "Web3がゲームのルールを変え、暗号通貨のスーパーサイクルを開始する理由"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "也许，你们中的一些人已经看到了SOS下降到OpenSea用户。对于每个人都没有\n的人来说，这里是TL;DR：\"一个新项目（OpenDAO）做了一个\n空投他们的SOS代币给过去使用OpenSea的所有人。\n那些使用OpenSea较多、交易量较大的用户，...",
      "title": "为什么web3将改变游戏规则并启动加密货币的超级周期？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "也許，你們中的一些人已經看到了SOS下降到OpenSea用戶。對於每個人都沒有\n的人來說，這裏是TL;DR：\"一個新項目（OpenDAO）做了一個\n空投他們的SOS代幣給過去使用OpenSea的所有人。\n那些使用OpenSea較多、交易量較大的用戶，...",
      "title": "爲什麼web3將改變遊戲規則並啓動加密貨幣的超級週期？"
    }
  ]
}