{
  "author": "Quirky_Analysis7336",
  "original_created_utc": 1635066759,
  "title": "What is the current accepted risk of Covid-19 infection through fomite transmission?",
  "created_utc": 1635095567,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I apologize in advance because I know this has been asked before, but I would just like some clarification if someone is willing to give it. I have read the [CDC update that came out earlier this year which detailed how the virus is spread primarily through respiratory droplets and not surface transmission, which said the chance was around 1 in 10,000 for every infected touch](<a href=\"https://www.cdc.gov/coronavirus/2019-ncov/more/science-and-research/surface-transmission.html\">https://www.cdc.gov/coronavirus/2019-ncov/more/science-and-research/surface-transmission.html</a>). After doing a little more digging though, I saw that [some of the studies tested outside objects, like traffic light buttons](<a href=\"https://pubs.acs.org/doi/10.1021/acs.estlett.0c00966\">https://pubs.acs.org/doi/10.1021/acs.estlett.0c00966</a>). I&#39;m wondering then, is the risk really considered that much higher without accounting for environmental factors like wind? The reason I ask is because I work at a grocery store that has basically done away with some of the early Covid safety precautions of last year. I go about my day touching self checkout screens, money, and even produce likely hundreds of times a day. I wash my hands frequently and use hand sanitizer a lot as well, but am I still putting people at risk?</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/askscience/comments/qeolk9/what_is_the_current_accepted_risk_of_covid19/",
  "subreddit": "askscience",
  "id": "qeolk9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I apologize in advance because I know this has been asked before, but I would\njust like some clarification if someone is willing to give it. I have read the\n[CDC update that came out earlier this year which detailed how the virus is\nspread primarily through respiratory droplets and not surface…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "前にも聞かれたことがあると思うので先に謝っておきます。\nもし誰かが教えてくれるならば、少しでも明確にしたいと思います。私が読んだのは\n[今年の初めに発表されたCDCのアップデートを読みました。\n主に呼吸器系の飛沫を介して感染し、表面には出てきません。",
      "title": "擬態感染によるCovid-19感染のリスクについて、現在認められているものは何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我提前表示歉意，因为我知道以前有人问过这个问题，但我想\n如果有人愿意的话，我只是想得到一些澄清。我已经阅读了\n[今年早些时候CDC的更新，其中详细说明了该病毒是如何\n主要通过呼吸道飞沫而不是表面传播。",
      "title": "目前公认的通过虫媒传播感染Covid-19的风险是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我提前表示歉意，因爲我知道以前有人問過這個問題，但我想\n如果有人願意的話，我只是想得到一些澄清。我已經閱讀了\n[今年早些時候CDC的更新，其中詳細說明了該病毒是如何\n主要通過呼吸道飛沫而不是表面傳播。",
      "title": "目前公認的通過蟲媒傳播感染Covid-19的風險是什麼？"
    }
  ]
}