{
  "author": "Budget-Grass177",
  "original_created_utc": 1645643606,
  "title": "is it normal to have less friends as you get older?",
  "created_utc": 1645679057,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In high school i found it much easier to have a friend group and have many friends that i could ask to hang out at any time. Now i (F,21) find it so much harder to sustain a group of friends and i have been having really bad anxiety around having only a few close friends in my town with more long distance friends. Just wondering if this is a normal experience to have less friends as you get older? Thanks :)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/NoStupidQuestions/comments/szpc3a/is_it_normal_to_have_less_friends_as_you_get_older/",
  "subreddit": "NoStupidQuestions",
  "id": "szpc3a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In high school i found it much easier to have a friend group and have many\nfriends that i could ask to hang out at any time. Now i (F,21) find it so much\nharder to sustain a group of friends and i have been having really bad anxiety\naround having only a few close friends in my town with more long…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "高校生の時は、友達を作るのが簡単で、たくさんの友達を持つことができました。\nいつでも遊ぼうと誘える友達。今、私(F,21)は、いつでも遊びに誘えるような友達を\n友人グループを維持することが難しくなり、本当にひどい不安を抱えています。\n私の町には親しい友人が数人しかおらず、もっと長い付き合いの友人がいることで、...",
      "title": "年をとると友達が少なくなるのは普通なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在高中时，我发现拥有一个朋友圈要容易得多，有很多朋友可以随时约出来玩。\n有很多朋友，我可以在任何时候邀请他们一起出去玩。现在，我（女，21岁）发现要维持一个朋友群要难得多。\n现在，我（女，21岁）发现要维持一个朋友群要难得多，而且我一直有非常严重的焦虑。\n围绕着在我的城市里只有几个亲密的朋友和更多的长辈。",
      "title": "随着年龄的增长，朋友越来越少，这是否正常？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在高中時，我發現擁有一個朋友圈要容易得多，有很多朋友可以隨時約出來玩。\n有很多朋友，我可以在任何時候邀請他們一起出去玩。現在，我（女，21歲）發現要維持一個朋友羣要難得多。\n現在，我（女，21歲）發現要維持一個朋友羣要難得多，而且我一直有非常嚴重的焦慮。\n圍繞着在我的城市裏只有幾個親密的朋友和更多的長輩。",
      "title": "隨着年齡的增長，朋友越來越少，這是否正常？"
    }
  ]
}