{
  "author": "AlcoholicShinobi",
  "original_created_utc": 1634136633,
  "title": "Thanks to crypto, I can now live luxuriously until I die",
  "created_utc": 1634142909,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I normally wouldn&#39;t like to share my financial achievements with other people. However, I had this strong feeling that I should let everyone know about what crypto did for me.</p>\n\n<p>Not to brag or anything, I can now live luxuriously until I die because of crypto. I can just play video games all day, watch anime whenever I want to, and eat expensive food for breakfast, lunch, and dinner. I can do whatever I want, and it is all thanks to cryptocurrency. </p>\n\n<p>I am now capable of being financially successful until I die. </p>\n\n<p>Assuming that I&#39;ll die three days from now.</p>\n</div><!-- SC_ON -->",
  "score": 1092,
  "permalink": "/r/CryptoCurrency/comments/q7ctib/thanks_to_crypto_i_can_now_live_luxuriously_until/",
  "subreddit": "CryptoCurrency",
  "id": "q7ctib",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I normally wouldn't like to share my financial achievements with other people.\nHowever, I had this strong feeling that I should let everyone know about what\ncrypto did for me.\n\nNot to brag or anything, I can now live luxuriously until I die because of\ncrypto. I can just play video games all day,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "本来であれば、自分の経済的な実績を他人と共有することはしたくありません。\nしかし、私のために暗号がしてくれたことをみんなに知らせるべきだという強い気持ちがありました。\n自慢したいわけではありません。\n\n自慢するわけではありませんが、私が死ぬまで贅沢に暮らせるようになったのは\n自慢でも何でもなく、私が死ぬまで贅沢に暮らせるのはcryptoのおかげです。一日中ビデオゲームをしていても...",
      "title": "暗号のおかげで、死ぬまで贅沢に暮らせるようになった。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我通常不喜欢与其他人分享我的财务成就。\n然而，我有这种强烈的感觉，我应该让大家知道什么是\n加密货币为我带来的好处。\n\n不是吹牛或什么，我现在可以奢侈地生活，直到我死，因为\n密码货币。我可以整天玩电子游戏，...",
      "title": "多亏了加密货币，我现在可以奢侈地生活到死。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我通常不喜歡與其他人分享我的財務成就。\n然而，我有這種強烈的感覺，我應該讓大家知道什麼是\n加密貨幣爲我帶來的好處。\n\n不是吹牛或什麼，我現在可以奢侈地生活，直到我死，因爲\n密碼貨幣。我可以整天玩電子遊戲，...",
      "title": "多虧了加密貨幣，我現在可以奢侈地生活到死。"
    }
  ]
}