{
  "author": "Chikkin1013",
  "original_created_utc": 1627263462,
  "title": "Remember, if you didn't buy 5 hours ago, you probably shouldn't buy now.",
  "created_utc": 1627271110,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Remember when BTC was crawling literally 5 hours ago? Did you buy then?</p>\n\n<p>If you didn&#39;t, you probably didn&#39;t buy now. You&#39;ve missed out on 6 to 10% of profit in the last few hours, but don&#39;t come in now and get burned. Don&#39;t go &quot;see i told you. It&#39;s a scam&quot; after your mistiming. If you were scared back just then, now&#39;s worse for you.</p>\n\n<p>If you did, good job! You&#39;re on your ride. Take smart profits and enjoy the upward rise!</p>\n\n<p>Edit: never been on hot before. Thank you all!</p>\n\n<p>Edit 2: also, this is not an advice post but a word of rationality against massive FOMO. You&#39;re welcome to listen or to not.</p>\n</div><!-- SC_ON -->",
  "score": 361,
  "permalink": "/r/CryptoCurrency/comments/oroqj3/remember_if_you_didnt_buy_5_hours_ago_you/",
  "subreddit": "CryptoCurrency",
  "id": "oroqj3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Remember when BTC was crawling literally 5 hours ago? Did you buy then?\n\nIf you didn't, you probably didn't buy now. You've missed out on 6 to 10% of\nprofit in the last few hours, but don't come in now and get burned. Don't go\n\"see i told you. It's a scam\" after your mistiming. If you were scared…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "5時間前にBTCが文字通りクロールしていたのを覚えていますか？その時に買いましたか？\n\nもし買わなかったら、今も買わなかったでしょう。この数時間で6～10％の利益を逃したことになります。\nこの数時間で6～10％の利益を逃していますが、今来て火傷しないでください。やめましょう。\n\"See I told you. これは詐欺だよ」と言ってはいけません。もしあなたが怖かったら...。",
      "title": "5時間前に買わなかった人は、今買わないほうがいいということを覚えておいてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "还记得5小时前BTC在爬行的时候吗？你当时买了吗？\n\n如果你没有，你可能现在也没有买。你已经错过了6-10%的\n的利润，但不要现在就进来，否则会被烧死。不要说\n\"看我告诉你了。这是个骗局\"，在你错失时机之后。如果你害怕...",
      "title": "记住，如果你5小时前没有买，你现在可能也不应该买。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "還記得5小時前BTC在爬行的時候嗎？你當時買了嗎？\n\n如果你沒有，你可能現在也沒有買。你已經錯過了6-10%的\n的利潤，但不要現在就進來，否則會被燒死。不要說\n\"看我告訴你了。這是個騙局\"，在你錯失時機之後。如果你害怕...",
      "title": "記住，如果你5小時前沒有買，你現在可能也不應該買。"
    }
  ]
}