{
  "author": "GabenFanClub",
  "the_new_excerpt": "As I see it:\n\n1) The yield is already starting to become attractive major foreign buyers.\nJapanese institutions are the biggest foreign buyers and are continuing to add\nmore.\n\ninvesting.com/news/economic-indicators/foreigners-raise-holdings-of-us-treasuries-for-second-month-in-january-data…",
  "original_created_utc": 1615972004,
  "localize": [
    {
      "locale": "zh",
      "title": "担心10y收益率失控的人应该认清一些事情。",
      "the_new_excerpt": "在我看来\n\n1）收益率已经开始成为吸引国外主要买家的因素。\n日本机构是最大的国外买家，并且在持续增发。\n更多。\n\ninvesting.com/news/economic-indicators/foreigners-raise holdings-ofus-treasuries for second month in January-data..."
    },
    {
      "locale": "zh-Hant",
      "title": "擔心10y收益率失控的人應該認清一些事情。",
      "the_new_excerpt": "在我看來\n\n1）收益率已經開始成爲吸引國外主要買家的因素。\n日本機構是最大的國外買家，並且在持續增發。\n更多。\n\ninvesting.com/news/economic-indicators/foreigners-raise holdings-ofus-treasuries for second month in January-data..."
    }
  ],
  "title": "People worried about the 10y yield going out of control should recognise some things.",
  "created_utc": 1615985999,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As I see it:</p>\n\n<p>1) The yield is already starting to become attractive major foreign buyers. Japanese institutions are the biggest foreign buyers and are continuing to add more.</p>\n\n<p>investing.com/news/economic-indicators/foreigners-raise-holdings-of-us-treasuries-for-second-month-in-january-data-2447322</p>\n\n<p>2) Fear of China selling USTs to cause chaos needs to be seen in the right context. While technically this might be possible, consider the fact that China just had a record $ 100 Billion trade surplus two months vs the US.</p>\n\n<p>To continue to keep their own currency competitive in this humongous inflow of $s, while simutaneously not buying USTs further, they inevitably have turned to buying JGBs. Going on for a while now, and also why the Japanese became the largest holders of USTs.</p>\n\n<p><a href=\"https://www.cnbc.com/2020/10/14/why-china-is-buying-up-more-japanese-government-bonds.html\">https://www.cnbc.com/2020/10/14/why-china-is-buying-up-more-japanese-government-bonds.html</a></p>\n\n<p>So what do the gigantosaurous Japanese pension funds do in this instance of massive inflows? They buy even more USTs, which ties back into point 1.</p>\n\n<p>3) With the Fed continuing to buy monthly, a serious lack of treasuries is becoming a thing (believe it or not), expecially in the repo markets.</p>\n\n<p>Overnight rates going -ve .4 for the 2 year, for instance. [On a related note, Fed&#39;s &quot;operation twist&quot; might actually kill two birds with one stone. That is, restock the front end of the curve with enough bonds, and pull some out of the back end]</p>\n\n<p>4) Also, while &quot;inflation expectations&quot; have certainly gone up, we are yet to see proper inflation data (cpi, ppi, etc) reflect this. And given the recent Feb retail sale numbers turning out worse than expected, I&#39;m not sure we are about to get some crazy inflation any time soon.</p>\n</div><!-- SC_ON -->",
  "score": 312,
  "permalink": "/r/investing/comments/m6w7uv/people_worried_about_the_10y_yield_going_out_of/",
  "subreddit": "investing",
  "id": "m6w7uv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147381370
}