{
  "author": "BuyMeWhiteChocolate",
  "original_created_utc": 1626687128,
  "title": "My friend said the fact that I’m disabled is the only reason women react nicely to this. Do you think that’s really true?",
  "created_utc": 1626718095,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m a disabled guy with Cerebral Palsy. My emotionally abusive dad never let me date. Soon I’ll be free! In the meantime I walk up to women at my uni, tell them “I just wanted to say you’re really pretty! Have a good day!” and walk off.</p>\n\n<p>It gives me hope and I love spreading positive vibes!</p>\n\n<p>My friend said the fact that I’m disabled is the only reason girls react nicely to this. Do you think that’s really true?</p>\n</div><!-- SC_ON -->",
  "score": 124,
  "permalink": "/r/NoStupidQuestions/comments/onanj1/my_friend_said_the_fact_that_im_disabled_is_the/",
  "subreddit": "NoStupidQuestions",
  "id": "onanj1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m a disabled guy with Cerebral Palsy. My emotionally abusive dad never let me\ndate. Soon I’ll be free! In the meantime I walk up to women at my uni, tell them\n“I just wanted to say you’re really pretty! Have a good day!” and walk off.\n\nIt gives me hope and I love spreading positive vibes!\n\nMy…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は脳性麻痺の障害者です。感情的な虐待を受けた父は、私にデートをさせてくれませんでした。\nデートもさせてもらえない。もうすぐ僕は自由になれるんだ! それまでの間、僕は大学で女性に近づき、こう言います。\n\"君は本当にきれいだね！と言いたかったんだ。良い一日を！」と言って去っていきます。\n\n希望が持てますし、ポジティブな雰囲気を醸し出すのが好きなんです。\n\n私の...",
      "title": "私の友人は、私が障害者であることが、女性の反応を良くする唯一の理由だと言っていました。それは本当に正しいと思いますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个患有脑性麻痹的残疾人。我那在感情上受虐待的父亲从来不让我\n约会。很快我就会自由了。在这期间，我在大学里走到女人面前，告诉她们\n\"我只是想说，你真的很美! 祝你有个愉快的一天！\"然后就走了。\n\n这给我带来了希望，我喜欢传播积极的氛围！\"。\n\n我的...",
      "title": "我的朋友说，我是残疾人这一事实是女性对此反应良好的唯一原因。你认为这真的是事实吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個患有腦性麻痹的殘疾人。我那在感情上受虐待的父親從來不讓我\n約會。很快我就會自由了。在這期間，我在大學裏走到女人面前，告訴她們\n\"我只是想說，你真的很美! 祝你有個愉快的一天！\"然後就走了。\n\n這給我帶來了希望，我喜歡傳播積極的氛圍！\"。\n\n我的...",
      "title": "我的朋友說，我是殘疾人這一事實是女性對此反應良好的唯一原因。你認爲這真的是事實嗎？"
    }
  ]
}