{
  "author": "totaluggo",
  "original_created_utc": 1627125704,
  "title": "Is it sexual assault if you ask your partner not to cum inside you and they do it anyway?",
  "created_utc": 1627131206,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My monogamous partner (m) and I (m) would have unprotected sex but he was exclusively a top and didn’t understand how bottoming, including the preparation and potential… aftermath… worked at all. We both got tested regularly and remained monogamous, but I didn’t always want to deal with the messy reality of condomless post-anal cleaning. On a handful of occasions I asked him not to cum inside me, and he would violate that demand and laugh like it was a mistake after (like, “oh it felt so good I just couldn’t control myself”). I was irked and always knew it was a violation of my consent. But I just had a horrific dream about a similar situation, albeit it was truly terrifying in the dream whereas I was only irritated in my waking real experience. I woke up crying though, and am now thinking about how much I downplayed the actual lived experiences because I didn’t want to come off as overdramatic. I’m wondering if this would be considered assault, and how I can go about reconciling these painful memories. It’s left me with some trust issues in my sex life (compounded with some other non-consensual encounters with other men). Any advice on healing? Am I being dramatic?</p>\n</div><!-- SC_ON -->",
  "score": 382,
  "permalink": "/r/TooAfraidToAsk/comments/oqo4me/is_it_sexual_assault_if_you_ask_your_partner_not/",
  "subreddit": "TooAfraidToAsk",
  "id": "oqo4me",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My monogamous partner (m) and I (m) would have unprotected sex but he was\nexclusively a top and didn’t understand how bottoming, including the preparation\nand potential… aftermath… worked at all. We both got tested regularly and\nremained monogamous, but I didn’t always want to deal with the messy…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "一夫一婦制のパートナー(m)と私(m)は、無防備なセックスをすることもありますが、彼は\n彼はもっぱらトップで、ボトムがどのように機能するのか、その準備と可能性を含めて全く理解していませんでした。\n準備や潜在的な...余韻...など、ボトムの仕組みを全く理解していませんでした。私たちは二人とも定期的に検査を受けて\n一夫一婦制を維持していましたが、私はいつも面倒なことに対処したくありませんでした...",
      "title": "相手に中出ししないようにお願いして、相手が中出しした場合は性的暴行になるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的一夫一妻制伴侣（m）和我（m）会有无保护措施的性行为，但他是完全的上位者，不了解下位者的情况，包括准备工作。\n完全是一个上位者，不理解下位者如何，包括准备和潜在的......后果。\n和潜在的......后遗症......根本不明白。我们都定期接受检测，并保持一夫一妻制。\n保持一夫一妻制，但我并不总是想处理混乱的......",
      "title": "如果你要求你的伴侣不要在你体内射精，而他们还是这样做了，这算不算性侵犯？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的一夫一妻制伴侶（m）和我（m）會有無保護措施的性行爲，但他是完全的上位者，不瞭解下位者的情況，包括準備工作。\n完全是一個上位者，不理解下位者如何，包括準備和潛在的......後果。\n和潛在的......後遺症......根本不明白。我們都定期接受檢測，並保持一夫一妻制。\n保持一夫一妻制，但我並不總是想處理混亂的......",
      "title": "如果你要求你的伴侶不要在你體內射精，而他們還是這樣做了，這算不算性侵犯？"
    }
  ]
}