{
  "author": "UnderwaterDialect",
  "original_created_utc": 1647155885,
  "title": "Why is fantasy set in the Middle Ages? Where does that connection come from?",
  "created_utc": 1647168446,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Today fantasy work is synonymous with the Middle Ages. I’m curious where that came from? That specific sort of interpretation of the Middle Ages as a time when magic existed, and blended with fantasy races like orcs and elves. &lt;/p&gt;\n\n&lt;p&gt;It seems like it could plausibly be set at any time period, but it is almost fused with the Middle Ages. &lt;/p&gt;\n\n&lt;p&gt;Why is that, and where did it come from?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 110,
  "permalink": "/r/AskHistorians/comments/td1j2w/why_is_fantasy_set_in_the_middle_ages_where_does/",
  "subreddit": "AskHistorians",
  "id": "td1j2w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Today fantasy work is synonymous with the Middle Ages. I’m curious where that\ncame from? That specific sort of interpretation of the Middle Ages as a time\nwhen magic existed, and blended with fantasy races like orcs and elves.\n\nIt seems like it could plausibly be set at any time period, but it is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "現在、ファンタジー作品といえば中世の代名詞のようなものです。それはどこから来ているのでしょうか。\nは、どこから来たのですか？中世というのは、そのような特殊な解釈をすることで\n魔法が存在し、オークやエルフといったファンタジーの種族と融合していた時代。\n\nどの時代を舞台にしてももっともらしく思えるのですが、それは......。",
      "title": "なぜファンタジーは中世が舞台なのか？そのつながりはどこから来るのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今天，奇幻作品是中世纪的代名词。我很好奇这一点从何而来？\n是从何而来？将中世纪作为一个时代的那种特殊解释\n当魔法存在的时候，并与兽人和精灵等幻想种族相融合。\n\n它似乎可以合理地设置在任何时间段，但它是...",
      "title": "为什么幻想的背景是在中世纪？这种联系从何而来？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天，奇幻作品是中世紀的代名詞。我很好奇這一點從何而來？\n是從何而來？將中世紀作爲一個時代的那種特殊解釋\n當魔法存在的時候，並與獸人和精靈等幻想種族相融合。\n\n它似乎可以合理地設置在任何時間段，但它是...",
      "title": "爲什麼幻想的背景是在中世紀？這種聯繫從何而來？"
    }
  ]
}