{
  "author": "Worried-Boot-1508",
  "original_created_utc": 1651801200,
  "title": "Ancient Roman elites and historians discussed alt!history scenarios where Alexander the Great turned west instead of east, and fought against Rome. (Unsurprisingly, the consensus was that the Romans would defeat him.) Are there any other ancient examples of alt!history discussion and speculation?",
  "created_utc": 1651846046,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Roman war-gaming and speculations about fighting an alt!history war against Alexander and the Macedonian Empire is discussed in Barnett, G. (2017) &amp;quot;Emulating Alexander: How Alexander the Great’s Legacy Fuelled Rome’s Wars With Persia&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/ujci8l/ancient_roman_elites_and_historians_discussed/",
  "subreddit": "AskHistorians",
  "id": "ujci8l",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Roman war-gaming and speculations about fighting an alt!history war against\nAlexander and the Macedonian Empire is discussed in Barnett, G. (2017)\n\"Emulating Alexander: How Alexander the Great’s Legacy Fuelled Rome’s Wars With\nPersia\".",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ローマ帝国の戦争ゲームと、オルト！ヒストリーの戦争を戦うことについての憶測\nアレクサンダーとマケドニア帝国については、Barnett, G. (2017)で述べられています。\n\"アレキサンダーをエミュレートする。How Alexander the Great's Legacy Fuelled Rome's Wars With\nPersia \"がある。",
      "title": "古代ローマのエリートや歴史家たちは、アレキサンダー大王が東ではなく西に向かい、ローマと戦うというオルト！ヒストリーのシナリオを議論した。(当然のことながら、コンセンサスはローマがアレキサンダー大王を打ち負かすというものでした）他に古代のオルト！ヒストリーの議論や推測の例はありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "罗马人的战争游戏和关于与亚历山大和马其顿帝国打一场另类历史战争的猜测被讨论。\n亚历山大和马其顿帝国的战争，在Barnett, G. (2017)中讨论。\n\"模仿亚历山大。亚历山大大帝的遗产如何助长罗马的战争？\n波斯的战争\"。",
      "title": "古罗马的精英们和历史学家们讨论了亚历山大大帝转向西方而不是东方，并与罗马作战的另类历史情景。(不足为奇的是，人们一致认为罗马人将打败他。）还有其他古代历史讨论和猜测的例子吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "羅馬人的戰爭遊戲和關於與亞歷山大和馬其頓帝國打一場另類歷史戰爭的猜測被討論。\n亞歷山大和馬其頓帝國的戰爭，在Barnett, G. (2017)中討論。\n\"模仿亞歷山大。亞歷山大大帝的遺產如何助長羅馬的戰爭？\n波斯的戰爭\"。",
      "title": "古羅馬的精英們和歷史學家們討論了亞歷山大大帝轉向西方而不是東方，並與羅馬作戰的另類歷史情景。(不足爲奇的是，人們一致認爲羅馬人將打敗他。）還有其他古代歷史討論和猜測的例子嗎？"
    }
  ]
}