{
  "author": "Maverick_WC",
  "the_new_excerpt": "A little bit about myself, I used to work as a pastry kitchen assistant since I\nwas 16 while studying to put myself through school because my dad objected to my\nchoice of studies. I used to spend a lot on games and Uber because the income at\nthat time was a lot for a kid, I earned about 1.6-1.8k USD…",
  "original_created_utc": 1617213420,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "关于我自己，我曾经是一名西点厨房的助理，因为我\n16岁的时候，一边学习一边供自己上学，因为我爸反对我。\n学的选择。我曾经在游戏和Uber上花了很多钱，因为收入在。\n那段时间对一个孩子来说是很多的，我赚了大约1.6-1.8千美元... ...",
      "title": "如果你的净资产在10万以下，改变消费习惯可能比你想象的更有帮助。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "關於我自己，我曾經是一名西點廚房的助理，因爲我\n16歲的時候，一邊學習一邊供自己上學，因爲我爸反對我。\n學的選擇。我曾經在遊戲和Uber上花了很多錢，因爲收入在。\n那段時間對一個孩子來說是很多的，我賺了大約1.6-1.8千美元... ...",
      "title": "如果你的淨資產在10萬以下，改變消費習慣可能比你想象的更有幫助。"
    }
  ],
  "title": "If your net worth is under 100k, changing spending habits may help more than you think",
  "created_utc": 1617218700,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A little bit about myself, I used to work as a pastry kitchen assistant since I was 16 while studying to put myself through school because my dad objected to my choice of studies. I used to spend a lot on games and Uber because the income at that time was a lot for a kid, I earned about 1.6-1.8k USD a month based on the USD rates ten years ago. Still managed to save quite a bit, but I wished I could have saved more. When I got to 21 years old, I was pretty much set on a simple index fund portfolio of IWDA/EIMI (I have since switched to VWRA). I have some individual stocks investment but its never &gt;20% of my entire portfolio, this is because I know for a fact that I won’t be able to tolerate downturns in the market and I’ll probably sell and take losses if it gets very bad. ( Years ago I bought TEVA after they got into a shitload of debt but was restructuring under new management, they were doing well until they had to pay settlements to all 50 states (i think) for price fixing drugs with other large pharma, sold at a loss, but fortunately it wasn’t much)</p>\n\n<p>However at that age I realised that it was more beneficial to revisit my spending habits as opposed to just putting money into ETFs every month. Here’s why.</p>\n\n<p>Assuming you have 50k invested growing at a rate of 7% per year with ETFs, that’s about $3500 profit. However, if you revise your spending habits and save an extra $300 a month, you would have saved $3600. When your net worth is little at the beginning, I believe that it is very important to check your spending habits for two reasons:</p>\n\n<p>1) You are probably very young (I’m 27, not old, but not super young), and financial literacy at a young age will enable you to get used to that habit for life, you will save money with very little difficulty once you get used to it.</p>\n\n<p>2) While it is great to DCA any excess money and it is highly encouraged, the fact is that a low starting capital isn’t going to snowball efficiently. 10% of 10k is just $1000. If you save more, you can invest more and let compounding interest (for ETFs) or whatever capital invested in individual stocks work harder for your money. </p>\n\n<p>Financial literacy is not a side effect of wealth, it is the other way round.</p>\n\n<p>Wealth is a side effect of financial literacy. </p>\n\n<p>You don’t need a reason to save money.</p>\n\n<p>You will also find yourself being happier when you understand the concept of having enough.</p>\n\n<p>I’m working as a flight attendant for several years, the income isn’t too bad, usually about 4k USD a month (for the last year, probably half but I work part-time elsewhere for now to sustain as much as I can, but the air travel industry has taken a hit I don’t expect to recover soon) and I usually throw 1.5k into ETFs and save the remainder as cash. Factoring in promotions to the highest rank will probably net me 6-8k a month as I go up the ladder, which I find entirely sufficient. I have many friends who are working in great jobs, but I work in a job that I love and I work about 85 hours on average per month pre covid. That’s about 10 days of work a month when you convert it to a 9-5 working cycle. I enjoy going out in different countries and sightseeing, as well as doing a great deal of reading (mainly history and economics). I could find a higher paying job with my education, but I’m able to do this because I believe that I have enough in my life. Everything else is a bonus. </p>\n\n<p>Please stay mentally healthy and I wish you guys all the best in your investing path, be it active or passive investors.</p>\n\n<p>Edit: I understand that this isn’t about stocks, but I believe it is important as it is relevant to potential returns of stocks when you also make your savings more efficient, it’s at least more useful that the daily reminder to hold during a red day and to go out for a walk.</p>\n</div><!-- SC_ON -->",
  "score": 1099,
  "permalink": "/r/stocks/comments/mhbqr2/if_your_net_worth_is_under_100k_changing_spending/",
  "subreddit": "stocks",
  "id": "mhbqr2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357142683
}