{
  "author": "gnarley_quinn",
  "original_created_utc": 1642839548,
  "title": "If you're in for the long term, then these prices should be making you fucking ecstatic.",
  "created_utc": 1642854725,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;If you are in the tech for the future, and are building for several years, a drop of 20% should be celebrated. It&amp;#39;s weird to think about it, and can even be difficult to look at the sea of red, but its true.   &lt;/p&gt;\n\n&lt;p&gt;Whether its caused by cascading liquidations rippling across the entire market, or a ban from a foreign country, its irrelevant. If you believe crypto is the future and your greatest chance to financial freedom, then &lt;strong&gt;you should be absolutely cheering at this point&lt;/strong&gt;. &lt;/p&gt;\n\n&lt;p&gt;Call it a dip, a fall, a crash, a fucking doped up junkie grizzly bear carrying a scythe wearing a black executioners hood. Call it whatever you want, compared to the ATH in Novembers, the tech you believe in &lt;strong&gt;is now selling at a &amp;#39;buy one get one free&amp;#39; pricepoint.&lt;/strong&gt; &lt;/p&gt;\n\n&lt;p&gt;People riot over price discounts that big on Black Friday sales. Why should this be any different?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 302,
  "permalink": "/r/CryptoCurrency/comments/s9xsdg/if_youre_in_for_the_long_term_then_these_prices/",
  "subreddit": "CryptoCurrency",
  "id": "s9xsdg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "If you are in the tech for the future, and are building for several years, a\ndrop of 20% should be celebrated. It's weird to think about it, and can even be\ndifficult to look at the sea of red, but its true.\n\nWhether its caused by cascading liquidations rippling across the entire market,\nor a ban…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "将来を見据えて技術的に、数年単位で構築しているのであれば、このような\n20％の低下は喜ぶべきことです。このことを考えるのは奇妙なことであり、また、そうすることで\n赤い海を見るのは難しいが、それは真実だ。\n\nその原因が、市場全体に波及する連鎖的な清算であろうと。\nまたは禁止...",
      "title": "長期的な視点に立つなら、この価格には大喜びするはずだ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你是从事未来的技术工作，并且正在建设几年，那么下降20%就应该庆祝。\n20%的下降应该得到庆祝。想到这一点很奇怪，甚至可能是\n困难，但这是事实。\n\n无论它是由波及整个市场的连环清算造成的。\n还是禁令...",
      "title": "如果你是长期投资，那么这些价格应该会让你他妈的欣喜若狂。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你是從事未來的技術工作，並且正在建設幾年，那麼下降20%就應該慶祝。\n20%的下降應該得到慶祝。想到這一點很奇怪，甚至可能是\n困難，但這是事實。\n\n無論它是由波及整個市場的連環清算造成的。\n還是禁令...",
      "title": "如果你是長期投資，那麼這些價格應該會讓你他媽的欣喜若狂。"
    }
  ]
}