{
  "author": "sickcynic",
  "original_created_utc": 1632335389,
  "title": "Why does the popular narrative focus so much on taxing the rich, instead of what the government is doing with the tax money they already collect?",
  "created_utc": 1632339786,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ll preface this by saying I firmly believe the ultra-rich aren&#39;t paying their fair share of taxes, and I think Biden&#39;s tax reforms don&#39;t go far enough. </p>\n\n<p>But let&#39;s say we get to a point where we have an equitable tax system, and Bezos and Musk pay their fair share. What happens then? What stops that money from being used inefficiently and to pay for dumb things the way it is now? </p>\n\n<p>I would argue that the government already has the money to make significant headway into solving the problems that most people complain about. </p>\n\n<p>But with the DoD having a budget of $714 billion, why do we still have homeless vets and a VA that&#39;s painful to navigate? Why has there never been an independent audit of a lot of things the government spends hundreds billions on? </p>\n\n<p>Why is tax evasion such an obvious crime to most people, but graft and corruption aren&#39;t?</p>\n</div><!-- SC_ON -->",
  "score": 126,
  "permalink": "/r/TooAfraidToAsk/comments/ptdsd4/why_does_the_popular_narrative_focus_so_much_on/",
  "subreddit": "TooAfraidToAsk",
  "id": "ptdsd4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'll preface this by saying I firmly believe the ultra-rich aren't paying their\nfair share of taxes, and I think Biden's tax reforms don't go far enough.\n\nBut let's say we get to a point where we have an equitable tax system, and Bezos\nand Musk pay their fair share. What happens then? What stops…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "前置きが長くなりましたが、私は、超富裕層の方々は、自分たちの生活に必要なお金を払っていないと確信しています。\nバイデン氏の税制改革は十分ではないと思います。\n\nしかし、もし私たちが公平な税制を手に入れて、ベゾスやマスクが公平な負担をするようになったとしましょう。\nやMuskが公平な負担をするようになったとしましょう。するとどうなるでしょう？何かが止まる...",
      "title": "なぜ人気のあるシナリオは、金持ちへの課税に集中し、政府がすでに集めた税金で何をしているかについては触れないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我首先要说的是，我坚信超级富豪并没有支付他们应有的税款。\n我认为拜登的税收改革还不够深入。\n\n但是，假设我们达到一个点，我们有一个公平的税收制度，而且贝佐斯\n和马斯克支付他们公平的份额。然后会发生什么？是什么阻止了...",
      "title": "为什么流行的说法如此关注对富人征税，而不是政府对他们已经收取的税款做了什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我首先要說的是，我堅信超級富豪並沒有支付他們應有的稅款。\n我認爲拜登的稅收改革還不夠深入。\n\n但是，假設我們達到一個點，我們有一個公平的稅收制度，而且貝佐斯\n和馬斯克支付他們公平的份額。然後會發生什麼？是什麼阻止了...",
      "title": "爲什麼流行的說法如此關注對富人徵稅，而不是政府對他們已經收取的稅款做了什麼？"
    }
  ]
}