{
  "author": "Many_Scratch2269",
  "original_created_utc": 1634505604,
  "title": "Don't keep your entire wealth in fiat. Inflation is making Crypto skyrocket while your fiat money is being eroded.",
  "created_utc": 1634553316,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Inflation is already becoming a major issue almost everywhere on the planet. There is a huge energy crisis in Europe and Asia as well with prices for gas and electricity skyrocketing. Bitcoin went from a couple dollars to 60,000 dollars in 10 years.  Couple this with inflation and it wont be surprising if Bitcoin becomes worth at least a couple million dollars in the near future. </p>\n\n<p>The fact is, in the future we&#39;re definitely going to see terrible inflation numbers. The US is increasing its dollar supply by 50% in a matter of 2 years. Inflation is the consequence and it&#39;s not going to go. It&#39;s not just fiat nowadays that&#39;s affected by inflation. The housing market is also very abnormal. There is absolutely something wrong going on in the economy. The US has been sitting at 0.25% interest rate almost the entire time since 2008. It&#39;s not just the US either, almost the entire world is having price increases and an electricity crisis.</p>\n\n<p>No matter what is happening, you should invest your future and buy some Crypto. Not only is this money going to be a cushion against inflation, Crypto is also going to be one of the most reliable safety nets in case shit hits the fan.</p>\n\n<p>TLDR: Keep some money in Crypto. Even if you don&#39;t have an interest in Crypto or you dislike it, in a few years you will thank yourself for buying it.</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/CryptoCurrency/comments/qa7zq4/dont_keep_your_entire_wealth_in_fiat_inflation_is/",
  "subreddit": "CryptoCurrency",
  "id": "qa7zq4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Inflation is already becoming a major issue almost everywhere on the planet.\nThere is a huge energy crisis in Europe and Asia as well with prices for gas and\nelectricity skyrocketing. Bitcoin went from a couple dollars to 60,000 dollars\nin 10 years. Couple this with inflation and it wont be…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "インフレはすでに地球上のほとんどの場所で大きな問題となっています。\nヨーロッパやアジアでもエネルギー危機が叫ばれており、ガスや電気の価格が高騰しています。\nガスや電気の価格が急上昇しています。ビットコインは10年で数ドルから6万ドルになりました。\n10年で6万ドルになりました。これにインフレが加われば......。",
      "title": "全財産を不換紙幣で保管しないでください。インフレでCryptoが高騰している一方で、あなたの不換紙幣は侵食されています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "通货膨胀已经成为地球上几乎所有地方的一个主要问题。\n在欧洲和亚洲也有一场巨大的能源危机，天然气和电力的价格飞涨。\n电价暴涨。比特币在10年内从几美元涨到了60,000美元\n在10年内。再加上通货膨胀，它不会是...",
      "title": "不要把你的全部财富放在法币中。通货膨胀正在使加密货币暴涨，而你的法币正在被侵蚀。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "通貨膨脹已經成爲地球上幾乎所有地方的一個主要問題。\n在歐洲和亞洲也有一場巨大的能源危機，天然氣和電力的價格飛漲。\n電價暴漲。比特幣在10年內從幾美元漲到了60,000美元\n在10年內。再加上通貨膨脹，它不會是...",
      "title": "不要把你的全部財富放在法幣中。通貨膨脹正在使加密貨幣暴漲，而你的法幣正在被侵蝕。"
    }
  ]
}