{
  "author": "DIOs_w0rld",
  "the_new_excerpt": " 1. Since according to IBKR and their boss, last spike was only due to gamma,\n    means most of them weren’t even covering at the time.\n 2. Remember that they had to inject 33 MILLION SHARES(MINIMUM) just to keep the\n    price down last Friday, alone that’s 66% SI if you think that they actually\n   …",
  "original_created_utc": 1614511593,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": " 1. 因为据IBKR和他们的老板说，上次的暴涨只是因为伽马。\n    意味着他们中的大多数人在当时甚至没有覆盖。\n 2. 请记住，他们不得不注入33 MILLION SHARES(MINIMUM)，只是为了保持。\n    上周五价格下跌，单单是这66%的SI，如果你认为他们其实是。\n   …",
      "title": "挤压要比以前大得多。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": " 1. 因爲據IBKR和他們的老闆說，上次的暴漲只是因爲伽馬。\n    意味着他們中的大多數人在當時甚至沒有覆蓋。\n 2. 請記住，他們不得不注入33 MILLION SHARES(MINIMUM)，只是爲了保持。\n    上週五價格下跌，單單是這66%的SI，如果你認爲他們其實是。\n   …",
      "title": "擠壓要比以前大得多。"
    }
  ],
  "title": "The squeeze is going to be way bigger than before.",
  "created_utc": 1614539885,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><ol>\n<li>Since according to IBKR and their boss, last spike was only due to gamma, means most of them weren’t even covering at the time.</li>\n<li>Remember that they had to inject 33 MILLION SHARES(MINIMUM) just to keep the price down last Friday, alone that’s 66% SI if you think that they actually covered all that shit last time. (But if you thought that, that begs the question why did the price spike again, and why are they still using every dirty tactic to keep it down below strike prices? I.E. Cramer, short ladders, crying hedgies)</li>\n<li>Many say that the 50 million volume during the spike was the squeeze but if you believed at least premise 2 which is backed up by data that is being monitored and cannot be avoided by hedgies. Then we had 140% SI at start, got down to 40% SI if they covered at all, and jumped to 106% SI last Friday on their push to &lt;100\nTLDR: Hedgies are fucked even in the worst case scenario we are 106% SI still. We ain’t finished yet boys. They could still play the long game and cover before key strike and sell prices are met though. What does that mean??? They know 800 was an important target for us so they might only cover till it jumps to 700. They know 1000 is where a lot of us may start shaving off so they might cut it at 900. 69420 is a popular price they think people will pull out so they pull out at 60-65. \nIn conclusion: they may think their pullout game is good enough to avoid getting the ass blast of a century, but if that were true, they wouldn’t have gotten buttfucked to begin with.</li>\n</ol>\n\n<p>Edit:\nForgot to add 20@ 85. Waiting till 40-70 to reload</p>\n</div><!-- SC_ON -->",
  "score": 3138,
  "permalink": "/r/wallstreetbets/comments/ludpwy/the_squeeze_is_going_to_be_way_bigger_than_before/",
  "subreddit": "wallstreetbets",
  "id": "ludpwy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937752782
}