{
  "author": "whitecastle3",
  "original_created_utc": 1628568361,
  "title": "Soooooo, I'm in a bit of a pickle and I'm now starting to get concerned. I've never really had diarrhea before, but in past 2 days, I've visited the toilet at least 50 times. I've gone 16 times in the past 2 and a half hours. I don't know what to do? I really don't want to go to the hospital",
  "created_utc": 1628639153,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>update : currently at an Urgent Care center waiting to be seen. The blood was getting worse, so I finally came.</p>\n\n<p>update 2 : probable gastroenteritis, got prescribed ondansetron (zofran) got a rectal exam (reason I didn&#39;t wanna go in the first place) found blood. Got a referral to see a GI if symptons continue after 7 days</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/TooAfraidToAsk/comments/p1hpvv/soooooo_im_in_a_bit_of_a_pickle_and_im_now/",
  "subreddit": "TooAfraidToAsk",
  "id": "p1hpvv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "update : currently at an Urgent Care center waiting to be seen. The blood was\ngetting worse, so I finally came.\n\nupdate 2 : probable gastroenteritis, got prescribed ondansetron (zofran) got a\nrectal exam (reason I didn't wanna go in the first place) found blood. Got a\nreferral to see a GI if…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "update : 現在、Urgent Careセンターで診察を待っています。血の状態が悪くなってきたので\n血の状態が悪くなってきたので、やっと来ました。\n\nupdate 2 : 胃腸炎の可能性が高く、オンダンセトロン（ゾフラン）を処方された。\n直腸検査（最初に行きたくなかった理由）で血が出た。血が出た。\nGIに診てもらうように紹介状を書いてもらいました。",
      "title": "困ったもので、心配になってきました。今まで下痢をしたことはなかったのですが、この2日間で少なくとも50回はトイレに行っています。この2時間半の間に16回も行っています。どうしたらいいんでしょうか？病院には行きたくありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "更新：目前在一个紧急护理中心等待就诊。血的情况\n越来越严重，所以我终于来了。\n\n更新2：可能是肠胃炎，开了昂丹司琼（Zofran）的处方，做了一个直肠检查（我没去的原因）。\n直肠检查（我一开始不想去的原因）发现有血。得到了一个\n转介去看消化科医生，如果...",
      "title": "我遇到了一些麻烦，我现在开始担心了。我以前从未真正腹泻过，但在过去的两天里，我至少上了50次厕所。在过去的两个半小时里，我已经去了16次。我不知道该怎么做？我真的不想去医院。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "更新：目前在一個緊急護理中心等待就診。血的情況\n越來越嚴重，所以我終於來了。\n\n更新2：可能是腸胃炎，開了昂丹司瓊（Zofran）的處方，做了一個直腸檢查（我沒去的原因）。\n直腸檢查（我一開始不想去的原因）發現有血。得到了一個\n轉介去看消化科醫生，如果...",
      "title": "我遇到了一些麻煩，我現在開始擔心了。我以前從未真正腹瀉過，但在過去的兩天裏，我至少上了50次廁所。在過去的兩個半小時裏，我已經去了16次。我不知道該怎麼做？我真的不想去醫院。"
    }
  ]
}