{
  "author": "anakanin",
  "original_created_utc": 1632055186,
  "title": "People like BitBoy are here for one reason. To leech off your losses.",
  "created_utc": 1632069458,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The channel &quot;BitBoy Crypto&quot; is unfortunately one of the biggest channels about Crypto on YouTube. He has many videos about CryptoCurrency which seem to be decent but don&#39;t get fooled. This channel seems to be causing many Pump and Dumps and it is a source of a lot of FUD and misinformation.</p>\n\n<p>His Phantasma video was the first thing I noticed.</p>\n\n<p>MCap of Phantasma coin doubled during 24 hours before the BitBoy released his shilling video. It went from 35 million to over 80 million. The price of token doubled in a matter of hours. Once the video was released the Phantasma started to dump in price losing ALL profit in under an hour.</p>\n\n<p>His meltdown on Twitter a couple months ago after losing a poll to Guy from CoinBureau will show you his true character.</p>\n\n<p>&#x200B;</p>\n\n<p>There are also rumors (?)  that (quoting)</p>\n\n<blockquote>\n<p>he also bribes to shill shitcoins; the current rate is anywhere between 15 and 25 thousand dollars. So when he comes up with his next suggestion to buy and watch moon, realize that he was paid to pump it. </p>\n</blockquote>\n\n<p>Now BitBoy is starting to FUD on BTC.</p>\n\n<p>Do not listen to people like this. They are here to leech off your losses. Be smarter than they are. The bar isn&#39;t high :)</p>\n</div><!-- SC_ON -->",
  "score": 298,
  "permalink": "/r/CryptoCurrency/comments/pr76fe/people_like_bitboy_are_here_for_one_reason_to/",
  "subreddit": "CryptoCurrency",
  "id": "pr76fe",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The channel \"BitBoy Crypto\" is unfortunately one of the biggest channels about\nCrypto on YouTube. He has many videos about CryptoCurrency which seem to be\ndecent but don't get fooled. This channel seems to be causing many Pump and\nDumps and it is a source of a lot of FUD and misinformation.\n\nHis…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "BitBoy Crypto」というチャンネルは、残念ながら、YouTube上のCryptoに関する最大のチャンネルのひとつです。\nYouTubeのCryptoに関する最大のチャンネルの一つです。彼は、CryptoCurrencyに関する多くのビデオを持っています。\nまともに見えますが、騙されないでください。このチャンネルは、多くのPump and Dumpsを引き起こしているようです。\nDump and Dumpsの原因となっているようで、多くのFUDと誤報の原因となっています。\n\n彼の...",
      "title": "BitBoyのような人がここにいる理由はひとつ。あなたの損失から搾取するためです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "不幸的是，\"BitBoy Crypto \"频道是YouTube上关于加密货币的最大频道之一。\n在YouTube上的加密货币。他有许多关于加密货币的视频，看起来似乎是\n但不要被愚弄。这个频道似乎造成了许多泵和\n倾销，它是很多虚假信息和错误信息的来源。\n\n他的...",
      "title": "像BitBoy这样的人在这里有一个原因。榨取你的损失。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不幸的是，\"BitBoy Crypto \"頻道是YouTube上關於加密貨幣的最大頻道之一。\n在YouTube上的加密貨幣。他有許多關於加密貨幣的視頻，看起來似乎是\n但不要被愚弄。這個頻道似乎造成了許多泵和\n傾銷，它是很多虛假信息和錯誤信息的來源。\n\n他的...",
      "title": "像BitBoy這樣的人在這裏有一個原因。榨取你的損失。"
    }
  ]
}