{
  "author": "Smemseg",
  "the_new_excerpt": "Hear me out...\n\nLet's say you receive an unwanted and poorly composed shot of someone's junk\n(I'll also assume you're a lady, since they get the vast majority of them).\n\nDon't delete that thing - mint it as an NFT and credit the sender as the\noriginal artist.\n\nThen, send them an invite to buy their…",
  "original_created_utc": 1616528324,
  "localize": [
    {
      "locale": "zh",
      "title": "NFTs是一个潜在的游戏规则改变未经请求的d*ck图片？",
      "the_new_excerpt": "听我说完...\n\n比方说，你收到一张不受欢迎的照片，而且构图很差，拍的是别人的垃圾。\n(我也假设你是个女士，因为他们得到了绝大部分)。\n\n不要删掉那东西--把它作为NFT铸币，并把发件人的名字记为\n原创艺术家。\n\n然后，向他们发出邀请，购买他们的... ..."
    },
    {
      "locale": "zh-Hant",
      "title": "NFTs是一個潛在的遊戲規則改變未經請求的d*ck圖片？",
      "the_new_excerpt": "聽我說完...\n\n比方說，你收到一張不受歡迎的照片，而且構圖很差，拍的是別人的垃圾。\n(我也假設你是個女士，因爲他們得到了絕大部分)。\n\n不要刪掉那東西--把它作爲NFT鑄幣，並把發件人的名字記爲\n原創藝術家。\n\n然後，向他們發出邀請，購買他們的... ..."
    }
  ],
  "title": "Are NFTs a potential game changer for unsolicited d*ck pics?",
  "created_utc": 1616535130,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hear me out...</p>\n\n<p>Let&#39;s say you receive an unwanted and poorly composed shot of someone&#39;s junk (I&#39;ll also assume you&#39;re a lady, since they get the vast majority of them).</p>\n\n<p>Don&#39;t delete that thing - mint it as an NFT and credit the sender as the original artist. </p>\n\n<p>Then, send them an invite to buy their art and remove it from the blockchain. If they don&#39;t, their name and nads will exist forever more in the very public blockchain, for all to see. </p>\n\n<p>The best part is there&#39;s only like, what, 3.75 billion d*cks on the planet, and if men get discouraged from sending them, they become SCARCE. </p>\n\n<p>The market cap potential is enormous. I&#39;ve done some analysis, and predict d*ck pic NFTs could hit $1 million in the next 5 years. </p>\n\n<p>Now is the time to get involved and start DCA (d*ck, camera, action!) into this exciting new project.</p>\n</div><!-- SC_ON -->",
  "score": 10492,
  "permalink": "/r/CryptoCurrency/comments/mbmvm1/are_nfts_a_potential_game_changer_for_unsolicited/",
  "subreddit": "CryptoCurrency",
  "id": "mbmvm1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752816927
}