{
  "author": "Nuewim",
  "original_created_utc": 1650809647,
  "title": "If you want to be in top 10% of crypto investors you shouldn't follow advices of other 90%.",
  "created_utc": 1650832535,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Most people in crypto will never be very successful and this is unrelated to luck, it is just stats, in math we call it normal distribution  otherwise known as Laplace - Gauss distribution. You most likely had it on math in school or saw those memes about IQ distribution. Generally minority of people (not only people, cause this apply to literally everything in life) are terrible at something, most are average and minority are very good. &lt;/p&gt;\n\n&lt;p&gt;You, me and almost everyone else is average within standard deviation. Simply everyone can&amp;#39;t be very good and never will be. 70 - 80%  will always be &amp;quot;average&amp;quot; in the bell curve. 10 - 15% will be the worst and another  10-15% will be the best. Let&amp;#39;s say you are not total degenerate, in bottom 10%, that gamble their last $100 they should spend on rent on some shitcoin  or took loans to invest.&lt;/p&gt;\n\n&lt;p&gt;You are most likely average crypto investor listening to other average crypto investors. What will be result of this? Your crypto portfolio will always will be average unless you will have some dumb luck. To be better than average you need to find better strategies, create your own investing style and have confidence in it. And most importantly follow advices of other good investors, not average investors or god forbid... some influencers. Sometimes hard to distinguish real, successful investors from scammers, shillers or other shitheads, but it is your homework  if you want to be better than most people.\n It will took time and effort, but it is not impossible by any means, actually quite easy. After few months you will see at first sight who have  idea what they talk about and who just talk bullshit like that one  drunk uncle. It just require self education and regularity. No one become one of best overnight.&lt;/p&gt;\n\n&lt;p&gt;I do not count top 1%, because those most often either are already filthy rich or had dumb luck. But being top 10% or maybe even top 5%, if you will work hard enough, is possible and most likely will be enough to achieve your financial goals. Many people are afraid that being better than average is impossible, but remember most other people think the same way. Difference is that vast majority never change anything. That is why most people always will be just average and complain about it instead of getting better.&lt;/p&gt;\n\n&lt;p&gt;It also doesn&amp;#39;t mean general crypto strategies are completly wrong, basics are the same. Just most people actually don&amp;#39;t follow them well enough and don&amp;#39;t try to learn to be better. Everyone can cook or kick a ball. But not everyone will be chef or football player. In theory everyone follow the same steps, but those subtle diffrences, experience and improvement make enormous quality differences. This rule apply to crypto too. All of us are crypto investors, but most never will be successful enough to impress anyone, even themselves.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 393,
  "permalink": "/r/CryptoCurrency/comments/uavnkv/if_you_want_to_be_in_top_10_of_crypto_investors/",
  "subreddit": "CryptoCurrency",
  "id": "uavnkv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Most people in crypto will never be very successful and this is unrelated to\nluck, it is just stats, in math we call it normal distribution otherwise known\nas Laplace - Gauss distribution. You most likely had it on math in school or saw\nthose memes about IQ distribution. Generally minority of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号のほとんどの人は決して大成功しないし、これは無関係である\nこれは運とは無関係で、ただの統計学です。数学では正規分布と呼びますが、そうでなければ、ラプラス-ガウス分布と\nラプラス-ガウス分布として知られています。あなたは、ほとんどの場合、学校の数学でそれを持っていたか、または見た\nIQ分布についてのこれらのミーム。一般的に少数派の...",
      "title": "もしあなたが暗号投資家の上位10％に入りたいなら、他の90％のアドバイスに従うべきではありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大多数从事加密货币的人永远不会非常成功，这与\n运气，这只是统计数字，在数学上我们称之为正态分布，也称为\n也就是拉普拉斯-高斯分布。你很可能在学校的数学课上看到过它，或者看到过\n那些关于智商分布的备忘录。一般来说，少数人的...",
      "title": "如果你想成为前10%的加密货币投资者，你不应该听从其他90%的人的建议。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大多數從事加密貨幣的人永遠不會非常成功，這與\n運氣，這只是統計數字，在數學上我們稱之爲正態分佈，也稱爲\n也就是拉普拉斯-高斯分佈。你很可能在學校的數學課上看到過它，或者看到過\n那些關於智商分佈的備忘錄。一般來說，少數人的...",
      "title": "如果你想成爲前10%的加密貨幣投資者，你不應該聽從其他90%的人的建議。"
    }
  ]
}