{
  "author": "pigeon011",
  "original_created_utc": 1633908827,
  "title": "If I cease to exist someday, then what I have to live for?",
  "created_utc": 1633978002,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If I can’t take any memories with myself, if my being will be destroyed into pieces without ever being able to recognize I have existed, then what does it all mean? Why do anything? </p>\n\n<p>We don’t destruct ourselves because we only have this chance to be ourselves or we are in hopes that something infinite remains about us? Because if we don’t matter at all, if none of these are infinite, then why not end it now?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/askphilosophy/comments/q5jex9/if_i_cease_to_exist_someday_then_what_i_have_to/",
  "subreddit": "askphilosophy",
  "id": "q5jex9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "If I can’t take any memories with myself, if my being will be destroyed into\npieces without ever being able to recognize I have existed, then what does it\nall mean? Why do anything?\n\nWe don’t destruct ourselves because we only have this chance to be ourselves or\nwe are in hopes that something…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "思い出を持ち帰ることができず、自分が存在していたことを認識できないまま粉々になってしまうのであれば\n自分が存在していたことを認識できないまま粉々になってしまうとしたら、それは何を意味するのでしょうか。\nその意味は？なぜ何かをするのか？\n\n私たちが自分自身を破壊しないのは、私たちが自分自身でいられる唯一のチャンスがあるからです。\nあるいは、何かを期待して...",
      "title": "いつか自分が存在しなくなったら、何のために生きればいいのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果我不能带走任何记忆，如果我的存在将被摧毁成碎片，而无法承认我的存在。\n如果我的存在将被摧毁成碎片，而无法承认我的存在，那么这一切又意味着什么呢？\n都意味着什么？为什么要做任何事？\n\n我们不毁灭自己，因为我们只有这个机会做自己，或\n我们希望有些东西...",
      "title": "如果有一天我不存在了，那我还有什么可活的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果我不能帶走任何記憶，如果我的存在將被摧毀成碎片，而無法承認我的存在。\n如果我的存在將被摧毀成碎片，而無法承認我的存在，那麼這一切又意味着什麼呢？\n都意味着什麼？爲什麼要做任何事？\n\n我們不毀滅自己，因爲我們只有這個機會做自己，或\n我們希望有些東西...",
      "title": "如果有一天我不存在了，那我還有什麼可活的？"
    }
  ]
}