{
  "author": "break_yo_self",
  "the_new_excerpt": "To those calling for regulation, ask yourself: what would Satoshi say?\n\nThis may get downvoted to obscurity, but I have to get it off my chest.\n\nAll this clamoring for regulation of crypto markets is really sticking in my\ncraw. Both in this sub and other online crypto spaces over the past few…",
  "original_created_utc": 1622846406,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "規制を求めている人は、「サトシは何と言うだろうか？\n\nこれは、無名になるまでダウンブレートされるかもしれませんが、私は胸の内を明かさなければなりません。\n\n暗号市場への規制を求める声は、私にとっては非常に心苦しいものです。\nしいです。このサブサイトでも、他のオンライン暗号スペースでも、過去数...",
      "title": "規制はあなたの味方ではない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对于那些呼吁监管的人，问问自己：中本聪会怎么说？\n\n这句话可能会被降权到不为人知，但我必须把它说出来。\n\n所有这些对加密货币市场监管的喧嚣，真的让我很不爽\n了。在过去的几年里，无论是在这个子网站还是在其他在线加密货币空间，都是如此。",
      "title": "监管不是你的朋友"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對於那些呼籲監管的人，問問自己：中本聰會怎麼說？\n\n這句話可能會被降權到不爲人知，但我必須把它說出來。\n\n所有這些對加密貨幣市場監管的喧囂，真的讓我很不爽\n了。在過去的幾年裏，無論是在這個子網站還是在其他在線加密貨幣空間，都是如此。",
      "title": "監管不是你的朋友"
    }
  ],
  "title": "Regulation is not your friend",
  "created_utc": 1622874626,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>To those calling for regulation, ask yourself: what would Satoshi say?</strong></p>\n\n<p>This may get downvoted to obscurity, but I have to get it off my chest. </p>\n\n<p>All this clamoring for regulation of crypto markets is really sticking in my craw. Both in this sub and other online crypto spaces over the past few weeks (and loads today) there have been countless statements calling for regulation/complaining about lack of regulation. Ppl upset bc they believe this or that is market manipulation and that &quot;they shouldnt be able to do that&quot;. <strong>This is an anti-crypto mindset</strong>, and needs to change if the vision of the founders of crypto will ever be truly realized.</p>\n\n<p>The whole motivation behind the pioneers and early adopters of bitcoin - the people who built it and tested it and believed in it - was a currency to free them and their fellow man from reliance on fiat currencies. <strong>Satoshi Nakamoto didn&#39;t make bitcoin so that ppl could toss a few month&#39;s rent from their savings into it to hopefully 2 or 3x their gains in a year and sell back into fiat.</strong> The whole point of bitcoin was that you would use it as the currency. You&#39;d be selling <em>into</em> bitcoin to lock in profits, not selling <em>out</em> of it.</p>\n\n<p>Why did they want this? Ever since the death of the gold standard, governments have played with their fiat currencies like gods and in many cases ruined the currency as a result of their hubris/ignorance/greed/all of the above. The people in the early crypto space knew this, and they wanted to build something that was immune to government - centralized power - control, precisely because of this shoddy track record (and the immense costs in human suffering as a result of fiat currency failures).</p>\n\n<p>That idea, nurtured by a small community of cryptographers and libertarians and tech geeks, blossomed and bitcoin took off. Eventually new ideas utilizing the blockchain were birthed. Today, the space is teeming with amazing concepts and brilliant ideas. But almost all of these new crypto projects still embraced the core motivation of bitcoin: they&#39;re fundamentally built around around decentralization. The true power of crypto is the power to disintermediate everything, reduce our reliance on the government and market markers to trade or exchange ideas with one another. The government is the damn reason Satoshi made bitcoin in the first place.</p>\n\n<p>Why would someone who believes in this original vision of crypto be calling for regulation? Well, naturally, they shouldnt. So it begs the question, why <em>are</em> so many calling for it? If you&#39;ve read this far I think it&#39;s pretty clear that I think these voices aren&#39;t true crypto believers, just individuals here to make some easy gains and flip back to fiat when the party ends. And, if I&#39;m right, this really bums me out. Because <strong>the true power of crypto</strong> - that ability to eliminate centralization across industries and nations - <strong>will never be possible until the majority of ppl stop thinking in terms of fiat and start thinking in terms of crypto</strong>.</p>\n\n<p>Look, I get the frustration. I&#39;m staring at red over the past two weeks and find myself getting pissed like the rest of you. I even blew my wad buying on the first dip and loaded up on cryptos at prices that are still underwater. So Im just as invested in wanting to see the market get back to running towards new ATH&#39;s as anyone else in this sub. But I will not be joining the chorus of voices bleating about how we need more regulation just bc I&#39;m feeling the heat in my portfolio. And not only because I&#39;m a patient man. Because thinking that regulation will help here, that maybe if it had been in place maybe BTC would still be at 55k, is wrong and is anti crypto.</p>\n\n<p>You might not like that BTC has dropped like a lead balloon lately. And you can be forgiven for thinking that regulation would help here. You&#39;ve been taught to think that way. But shake yourself out of it! Regulation won&#39;t solve the irrationality of human minds when it comes to shiny things anyway, all it will do is allow the government to exert more control over the crypto markets and throttle our liberty and potentially crypto innovation. </p>\n\n<p><strong>If the crypto market cap really did drop only bc of Elon shaking confidence, not the underlying fundamentals, than either: a) the market was overvalued, b) the current price is undervalued, or c) too many people have weak hands bc they only view crypto as a get rich quick scheme. Nature will reach equilibrium regardless of how you feel about her, and that applies to market prices too.</strong> And, in case you haven&#39;t noticed, governments do a shit job trying to control nature anyway.</p>\n\n<p>Its illogical to look at the way the government has handled fiat currencies and think that&#39;s a problem, but turn around and beg that same entity for help in the crypto markets when things arent going your way. It&#39;s tough to hear, but you just have to let it go. You knew this was a volatile market when you invested. Now you see what that meant. High beta means big upswings, and it also means big downswings. Buy the dip and hodl, if you have money lying around. Or don&#39;t, maybe itll go down again tomorrow. Alternatively: maybe it will moon. </p>\n\n<p>The truth is, if more people believed in bitcoin as a store of value than a get rich quick scheme, Elon wouldn&#39;t be able to tank the market with a mere tweet, and bitcoin would have a much more stable price. So maybe, next time youre thinking about tweeting about how crypto needs regulation, you&#39;ll consider that we need to kill that mindset for crypto to flourish.</p>\n</div><!-- SC_ON -->",
  "score": 264,
  "permalink": "/r/CryptoCurrency/comments/nshhjv/regulation_is_not_your_friend/",
  "subreddit": "CryptoCurrency",
  "id": "nshhjv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404881319
}