{
  "author": "lobdale",
  "original_created_utc": 1625965868,
  "title": "What is the deal with the weird style in which Snow White sings during the famous Disney movie? Was the \"warble\" en vogue in 1938? When did it go out of fashion to vocalize like this?",
  "created_utc": 1625992851,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As I watch Snow White and the Seven Dwarfs with my kid I&#39;m struck by how unusual the style of singing is that Snow White uses (particularly during the &quot;Some Day My Prince Will Come&quot; song). </p>\n\n<p>This style of singing is one of the two things that catches my wife and I off guard as we watch it with her, and I can&#39;t help but wonder if it was popular in music at the time or where it came from and where it went away--you virtually never see anyone sing in this way today. </p>\n\n<p>For reference, and for those who haven&#39;t seen the movie, here&#39;s a video. Many thanks to any historians of film, music, and pop culture who might have a take to offer!</p>\n\n<p><a href=\"https://www.youtube.com/watch?v=HLQ2sYxktMQ\">https://www.youtube.com/watch?v=HLQ2sYxktMQ</a></p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/ohuy68/what_is_the_deal_with_the_weird_style_in_which/",
  "subreddit": "AskHistorians",
  "id": "ohuy68",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As I watch Snow White and the Seven Dwarfs with my kid I'm struck by how unusual\nthe style of singing is that Snow White uses (particularly during the \"Some Day\nMy Prince Will Come\" song).\n\nThis style of singing is one of the two things that catches my wife and I off\nguard as we watch it with her,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "子供と一緒に「白雪姫と7人の小人たち」を見ていると、白雪姫の歌い方がとても変わっていることに気がつきます。\n白雪姫の歌い方がとても変わっていることに気がつきました（特に「Some Day\n特に「いつか王子様が」の歌）。)\n\nこの歌い方は、私と妻が待ち時間に不意をつかれた2つのことのうちの1つです。\nこの歌い方は、私と妻が一緒に見ていて気になる点の一つです。",
      "title": "有名なディズニー映画で白雪姫が歌うときの奇妙なスタイルはどうなっているのでしょうか？1938年に \"ウォーブリング \"は流行っていたのでしょうか？いつからこのような発声が流行したのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当我和我的孩子一起观看《白雪公主与七个小矮人》时，我对白雪公主使用的唱法（特别是在 \"我的孩子 \"的时候）是多么不寻常感到震惊。\n白雪公主使用的歌唱风格是如此不同寻常（尤其是在 \"有一天\n我的王子会来 \"这首歌）。)\n\n这种唱法是我和我妻子在和她一起看这部电影时感到惊讶的两件事之一。\n当我们和她一起看的时候，这种唱法是让我和妻子措手不及的两件事之一。",
      "title": "在著名的迪士尼电影中，白雪公主唱歌的奇怪风格是怎么回事？在1938年，\"颤音 \"是流行的吗？像这样发声的方式什么时候过时了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當我和我的孩子一起觀看《白雪公主與七個小矮人》時，我對白雪公主使用的唱法（特別是在 \"我的孩子 \"的時候）是多麼不尋常感到震驚。\n白雪公主使用的歌唱風格是如此不同尋常（尤其是在 \"有一天\n我的王子會來 \"這首歌）。)\n\n這種唱法是我和我妻子在和她一起看這部電影時感到驚訝的兩件事之一。\n當我們和她一起看的時候，這種唱法是讓我和妻子措手不及的兩件事之一。",
      "title": "在著名的迪士尼電影中，白雪公主唱歌的奇怪風格是怎麼回事？在1938年，\"顫音 \"是流行的嗎？像這樣發聲的方式什麼時候過時了？"
    }
  ]
}