{
  "author": "testicular_torsion12",
  "the_new_excerpt": "I've always done this since it's a cheap alternative for enjoying different\nparts of the world when traveling there isn't feasible, but I've noticed that\nI'm doing this a lot more often now during quarantine. I'd be sitting in front\nmy screen doing some boring, pointless assignment and would at some…",
  "original_created_utc": 1613662605,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我总是这样做，因为它是一个廉价的选择，享受不同的\n但我注意到，在世界范围内，当旅行不可行的时候。\n我现在在检疫期间经常这样做。我会坐在前面\n我的屏幕做一些无聊的，毫无意义的任务，会在一些... ...",
      "title": "你们中是否有人有时会在谷歌地图中 \"旅行 \"到不同的异国情调的地方，在街景中四处张望，希望自己能被传送到那里几个小时？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我總是這樣做，因爲它是一個廉價的選擇，享受不同的\n但我注意到，在世界範圍內，當旅行不可行的時候。\n我現在在檢疫期間經常這樣做。我會坐在前面\n我的屏幕做一些無聊的，毫無意義的任務，會在一些... ...",
      "title": "你們中是否有人有時會在谷歌地圖中 \"旅行 \"到不同的異國情調的地方，在街景中四處張望，希望自己能被傳送到那裏幾個小時？"
    }
  ],
  "title": "Do any of you sometimes \"travel\" to different exotic locations in Google Maps and look around in street view, wishing you could just be teleported there for a few hours?",
  "created_utc": 1613672976,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve always done this since it&#39;s a cheap alternative for enjoying different parts of the world when traveling there isn&#39;t feasible, but I&#39;ve noticed that I&#39;m doing this a lot more often now during quarantine. I&#39;d be sitting in front my screen doing some boring, pointless assignment and would at some point instinctively open Google Maps and start exploring the gorgeous landscapes in Cape Verde/Chile/Australia/wherever. After a few minutes I would melancholically stare at the screen and just imagine being instantly transported there for a few hours, aimlessly walking around and enjoying the peace and quiet away from all the mindless, numbing bullshit of everyday life. At this point it&#39;s like a weird escapist addiction for me.</p>\n</div><!-- SC_ON -->",
  "score": 204,
  "permalink": "/r/NoStupidQuestions/comments/lmpfuk/do_any_of_you_sometimes_travel_to_different/",
  "subreddit": "NoStupidQuestions",
  "id": "lmpfuk",
  "is_self": true,
  "media": null,
  "is_video": false
}