{
  "author": "TiredRightNowALot",
  "the_new_excerpt": "Hi all! For those who didn't see the post yesterday (not a lot did!) I have been\ncompiling a list of terms that are used in crypto with some basic explanations\nof what they are. The purpose of this is to have a way to explain the\nterminology without scaring people off. I've watched many people try…",
  "original_created_utc": 1623980275,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。昨日の投稿をご覧にならなかった方のために（多くの方はご覧になっていないと思いますが！）、私は\n暗号で使われている用語のリストと、それらが何であるかの基本的な説明をまとめています。\nしています。この目的は、一般の人を怖がらせることなく用語を説明する方法を持つことです。\nこの目的は、人々を怖がらせることなく用語を説明する方法を持つことです。私は、多くの人が...",
      "title": "更新しました～初心者のための暗号通貨解説書"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好! 对于那些没有看到昨天的帖子的人（不是很多人看到了！），我一直在\n汇编了一份加密货币中使用的术语清单，并对其进行了一些基本解释。\n它们是什么。这样做的目的是为了有一个方法来解释\n术语而不至于把人吓跑。我已经看到许多人试图...",
      "title": "更新--面向初学者的加密货币解释"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好! 對於那些沒有看到昨天的帖子的人（不是很多人看到了！），我一直在\n彙編了一份加密貨幣中使用的術語清單，並對其進行了一些基本解釋。\n它們是什麼。這樣做的目的是爲了有一個方法來解釋\n術語而不至於把人嚇跑。我已經看到許多人試圖...",
      "title": "更新--面向初學者的加密貨幣解釋"
    }
  ],
  "title": "Updated - Cryptocurrency Explanations for Beginners",
  "created_utc": 1624009712,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi all! For those who didn&#39;t see the post yesterday (not a lot did!) I have been compiling a list of terms that are used in crypto with some basic explanations of what they are. The purpose of this is to have a way to explain the terminology without scaring people off. I&#39;ve watched many people try to explain crypto in real life to have the recipient start to gloss over - usually right around when the word blockchain, or decentralized, or mining for hashes come up.</p>\n\n<p>I&#39;ve copied the list so far below. Please comment a few things.</p>\n\n<ol>\n<li>Is this worth updating and continuing (I&#39;m happy to do so!)</li>\n<li>Are there any explanations you could provide feedback on so that they could be better, more accurate or easier to understand</li>\n<li>Would you see value in a website being hosted to promote some of these ideas to help with newcomers to the space? I&#39;d be happy to purchase and maintain said website (no donations or anything needed, just happy to do it).</li>\n</ol>\n\n<p>thanks for checking it out</p>\n\n<p>For the definitions that start with an asterisk (*), they are not complete and may not be included going forward. In fact, a few of these may not make the cut as I tried to avoid words that had a negative connotation, and also any terms that may make people question the legitimacy of cryptocurrency in general.</p>\n\n<p>___________________________________________________________________________</p>\n\n<h1>Cryptocurrency - what is it?</h1>\n\n<p>Cryptocurrency is a currency similar to any other that you have used or heard of.  Quite simply put; it’s a value associated with a digital coin, or token.  When you purchase cryptocurrency [crypto], you have purchased the ownership of a token that exists on the ‘blockchain’.  This will be associated with your digital wallet until you sell your token, purchase an item using your token, trade for another token or move to a different digital wallet.</p>\n\n<h1>Blockchain</h1>\n\n<p>Blockchain is a ledger or record of all the transactions that have taken place with the crypto that it is associated with.  For example, if you purchased Bitcoin, then you would own the digital token at a particular location on the blockchain.  This transaction (the purchase of coin, and storage of said coin in your wallet) would be recorded at a particular point on the blockchain that would remain forever associated with the transaction forever.  A blockchain does not erase transactions when there are sales, transfers, or usage of tokens.  The blockchain stores that information and blockchain ‘workers’ validate that transaction indefinitely.  This validation of transactions is what makes the blockchain secure and cryptocurrency extraordinarily safe from malicious attempts to gain control of your cryptocurrency.</p>\n\n<p>If you have ever kept track of your own purchases either through an accounting software, or even balancing a chequebook, this is similar to how blockchain works.  It records each transaction and when a new transaction takes place, the original ‘block’ will then point to the new block with an updated balance.</p>\n\n<p>Because the blockchain is not stored in a central location (think: bank), it is decentralized.  This is a very common word and explanation in the digital world.  Decentralization shifts control away from one single person or company and gives that control to the people who own the cryptocurrency.  Because the currency is decentralized, it is less susceptible to manipulation from a higher level (government, corporations, etc).</p>\n\n<h1>Wallets</h1>\n\n<p>As mentioned, cryptocurrency is stored on the blockchain. The wallet will hold the keys (or reference) to the coin and that is then associated with your wallet. A wallet is something that you will download to your computer (or store on a digital exchange), and like any wallet, you can look at it to see how much crypto you own.  It is important to note that you can not see all of the different types of cryptocurrency in one wallet.  You will need to get the wallet that matches the currency you have purchased, or are going to purchase.</p>\n\n<p>A comparison to traditional money is your debit card.  You have a debit card that has money associated with it, but that money is stored in the bank and referenced to your account number.  When you log on to your online banking, you see a balance that is associated with your account and debit card when you want to spend it.  Although blockchain, crypto, wallets, and keys sound a little more daunting; it’s very similar to what you have already experienced with a debit card.</p>\n\n<p>If you wanted to purchase Bitcoin, you would go to the official Bitcoin site and choose the wallet that best suit your needs.  Wallets will typically have light versions and regular versions. Don’t be surprised if you download a wallet and it takes a day or two to ‘sync to the network’.  What’s happening here is that you are downloading every single transaction that has ever happened with the cryptocurrency and storing the ledger (records) on your computer.  This can sound like a scary thing for sure, but you’re actually becoming part of the secure network as mentioned before.  Because you have all the transactions, and everyone else has all the transactions this is what makes the blockchain secure.  To change the records at a particular point in time, you would have to change the records on every single computer hosting that wallet, at the same time.</p>\n\n<p>A light wallet gives you the ability to store the information at the current time for your own records.  It does not download all of the transactions in history to the computer.  It’s faster to get going on your own computer, which is always nice!</p>\n\n<p>A third option is using a digital exchange and letting this exchange host your wallet.  This is explained below with some other details about exchanges.</p>\n\n<h1>Digital Exchange</h1>\n\n<p>A digital exchange is a place where you go to purchase cryptocurrency.  Depending on the value of what you would like to purchase, you <em>should</em> need to register yourself, using government ID (this depends on the regulations in your country) and answering a set of questions to validate who you are.  Picking the right exchange is very important.  An exchange that requires no information from you to proceed might sound good, but it might also be a low-budget operation that is susceptible to fraud, malicious intrusions or other issues where you might end up losing your cryptocurrency and any investment that you may have on the website.</p>\n\n<p>Before you sign up with an exchange, you will need to do some research for your particular area and see what has a good reputation, proper security measures in place and also the ability to buy/sell the cryptocurrency that you are most interested in.  If you want to buy Bitcoin, just about any exchange will service this.  If you wanted to buy another coin like Dogecoin for example, not all exchanges offer this ability.  There are usually ways to figure this out by purchasing a currency that is available and then trading for another currency (purchase Bitcoin, then trade that for dogecoin either on the same website, or transfer to another website) but this can be subject to exchange fees which you will want to research in the first place.</p>\n\n<p>If this sounds daunting or complicated, it’s best to think of it just like exchanging for another currency when travelling.  I personally live in Canada and when I vacation in Florida, Mexico or Cuba, I always change my Canadian dollars to US Dollars.  I either go into the bank and do this, or visit an exchange booth in the mall or airport.  Then I get my exchange done and enjoy my vacation.  Sometimes on vacation, I’ll end up with local currency which I exchange while on vacation to USD and then when I return home I can either exchange back to CAD, or leave in USD for the next vacation.  That’s not too dissimilar to cryptocurrency exchanges.  I can leave in one currency or exchange to another depending on what my goals are.</p>\n\n<p>At this point, you’re best to establish what your goals are before you start purchasing and exchanging back and forth.  This is when transaction fees or exchange fees can start to add up.</p>\n\n<h1>Transaction Fees</h1>\n\n<p>As mentioned above, there are transaction fees on digital exchanges, just like if you were moving money in a traditional bank.  It would be impossible to cover specifics as each exchange will have a different setup for their transactions, but this is something that you will want to be aware of and make sure that you have factored into your own calculations as you start to invest into cryptocurrency. </p>\n\n<p>At the time of writing, I pay a 2% transaction fee on my exchange.  Because of this, I try to do less trading and more investing.  I don’t want to be paying that fee continually as it will eat away at my investment.</p>\n\n<h1>Security</h1>\n\n<p>The safety and security of the blockchain and cryptocurrency in general is extraordinarily high.  Because of the things that we have already listed above with the blockchain and how it is constantly validated by a large number of sources, we can be confident that the transactions are secure, next to impossible to ‘fake’ and we are able to confidently store our cryptocurrency without worry of attempts to steal our funds.  Like all things in life; you are only as strong as your weakest link.</p>\n\n<p>This is where the onus falls upon us as the users to protect our own information.  You may have heard of people being scammed for their digital currencies in the past; perhaps their computer was hacked, or something else happened where they lost their investment.  This is a possibility, just like it would be if I didn’t have a strong password for my online bank.  If I were to write down my password for online banking and someone was to see it, I could have a problem.  If I were to install a program on my computer that had a virus, I could be open to a malicious attack for my online banking as well.  Just like with traditional banking, you must secure your computer and your funds to take care of your end of the crypto transaction.</p>\n\n<p>From what we have talked about already, downloading the digital wallet is an area that could leave some people open to issues.  It is extremely important that you don’t download a wallet that was sent to you by someone on the internet.  Always download the wallet from the proper source, whether that be the official site for the cryptocurrency you are thinking of purchasing (bitcoin.org if you wanted Bitcoin, for example) or another trusted website such as Github.  You will want to ensure you have an Antivirus program running on your computer, and it’s up to date.  Again, if this sounds scary, this is what you should already be doing considering the amount of information that’s typically running through our computers from online banking to personal EMails, to working from home.</p>\n\n<p>One basic piece of security that I would suggest for cryptocurrency is installing the official wallet for whatever currency you hold, and then sending that currency from the exchange where you have purchased it to yourself.  Store this on your  personal computer and make sure that you are secure (good password, antivirus, etc).  </p>\n\n<h1>What is “mining”?</h1>\n\n<p>First, we will want to think of mining in the traditional sense.  Someone (typically) with a large machine is boring through the earth looking for minerals.  This machine will do a great deal of work, pushing away rock and sediment to find the ore, gem, or whatever it has been tasked to find.  A group of miners uncover earth that carried ancient waters and pushed gold sediment into pockets.  They sort and sift that earth through large machines to find gold deposits.  Tiny little specks of gold that after some processing become large nuggets or bars of gold that are then sold into the open market and eventually processed to become pieces of jewelry for purchase by the end user.</p>\n\n<p>Mining a cryptocurrency is not too dissimilar from the explanation above.  This process is how new ‘blocks’ of information are created or discovered for the blockchain.  These blocks are then tied into a value of the cryptocurrency that is being mined (a Bitcoin, for example) and this new bitcoin becomes part of the ledger and records that are associated with all of the pieces of bitcoin available to the world.</p>\n\n<p>But what is the machine mining?  The computers that are mining for cryptocurrency are solving complex math problems.  These problems get increasingly more difficult to solve as the cryptocurrency gets older, which helps regulate supply as new coins or tokens are created.  But what are the computers solving?  For us; they aren’t solving anything of value.  The computers aren’t solving specific problems (i.e. a cure for a disease or an equation for automated investing!)  but rather just incredibly difficult equations that are designed to make the computer work to get a solution.  Although there is a lot more to what the computers are trying to solve in order to unlock a new block, we will leave this definition as is.  In a future document, we can cover this in more detail as to what the computers are trying to solve (or in fact, guess).</p>\n\n<p>As you can imagine, a large amount of computational power is being used to solve these problems in order to release a new coin onto the blockchain.  This is one of the areas of concern with cryptocurrency; so much energy use and for what purpose?</p>\n\n<p>Once the block is solved however, the coin is released to the computer, or team of computers, who solved the hash problem and then that coin is stored in a digital wallet, or sold on a cryptocurrency exchange for profit. </p>\n\n<p>The above example of mining is what is called “Proof of Work”, but as discussed below, this is not the only way to mine a cryptocurrency.  There are three other types (Proof of Stake, Delegated Proof of Stake and Proof of Authority), the most popular are covered below (Proof of Work and Proof of Stake)</p>\n\n<h1>Proof of Work (PoW)</h1>\n\n<p>Essentially, proof of work is when a computer or group of computers work together to solve an equation to unlock a new piece of the blockchain.  Bitcoin uses proof of work to validate transactions, create new coins and continue to grow as a currency.  Proof of work is considered to be a high consumer of energy and has been in the news for some time regarding this.  As more miners join the network, the energy use continues to grow.</p>\n\n<p>When computers solve a complex mathematical equation (or riddle!) this is considered proof of work.  “I solved your puzzle, here is my proof!”.</p>\n\n<h1>Proof of Stake (PoS)</h1>\n\n<p>Proof of stake is a practice where mining happens not just by solving huge computational problems using powerful computers, but rather where mining or validation takes place based on how many digital coins you hold.  The more coins you have to use for mining, the more power you have.  Because of this, PoS mining is typically done in pools.  Similar to PoW, there is mining and hashing involved, but instead of being able to purchase more and more hardware, drawing more and more energy, users ‘stake’ their own cryptocurrency to mine new blocks.  Again, this is typically done in a pool to provide more changes of unlocking the block and therefore receiving a share of the newly created currency.</p>\n\n<p>PoS is extremely secure.  Staking your coins is also practically risk-free with reputable coins and servers as you still maintain full control of your coins in whatever wallet you are using (you can stake coins on an exchange, or even from a wallet stored on your personal computer).  Because you would need to increase your share of the cryptocurrency in order to increase your chances of winning the next block, there is a lot less chance of someone trying to manipulate or ‘cheat’ their way to new coins/tokens.  If someone were to try and break the system, they would devalue all of their own coins in the process.</p>\n\n<h1>Mining pools</h1>\n\n<p>A mining pool is a group of computers who have joined together to increase their computing power and therefore increase their chances of solving a block through hashing.  Mining combines the power of all computers, increasing the speed at which the hashes are created in an effort to solve the hash (string of information) to unlock the next block.  When successful, the cryptocurrency is distributed throughout all the participants in the mining pool.</p>\n\n<p>As a single miner it will either be very costly to get enough hardware to put together a system that generates a high enough hash rate (speed) to have a good chance of solving a hash and getting a reward (cryptocurrency payment).  This simply means that solo-mining has a low chance of getting any reward.  You could try to solve the hash for years without reward.  Joining a pool let’s the average user utilize their existing processing power (it’s still recommended to have a good graphics card) and increase the chance of receiving at least something for their efforts.</p>\n\n<h1>What is “staking”?</h1>\n\n<p>Staking is a very interesting part of cryptocurrency that helps solve some of the challenges around power consumption through Proof of Work systems.  To stake your crypto, you would be holding a Proof of Stake coin and therefore, you could join a staking group to try and unlock the next reward on the blockchain.</p>\n\n<p>Staking is defined as the act of ‘locking’ up your coins to help validate the network (blockchain) and in turn, keep the network secure.  There is little to no risk while staking (no risk when you are using a legitimate coin and software that was downloaded from a reputable site as mentioned before).  Although it sounds like you are giving your coin to someone else to use as a proof of stake, you maintain full control of your coins during this process.  That said, if you use an online wallet, then you are at risk if the exchange site has a data breach.  With many coins however, you can stake directly from the wallet on your personal computer.</p>\n\n<p>When we discussed Proof of Work, the chances of solving or unlocking the next block were increased by the sheer amount of processing power you were dedicating to solving the hash.  In Proof of Stake, the blockchain assigns a particular coin the ability to unlock the next hash.  The person with the correct coin gets to unlock the reward.  The more coins you have staked, the greater your chances of being selected.  So, joining a staking pool is the best way to increase your chances of winning.</p>\n\n<p>Have you ever played the lottery?  A number will be chosen to win the lottery at each drawing.  If you have one ticket, you have a low chance of holding the correct numbers.  If you have 1000 tickets, you have a better chance.  This is the same as staking your coins and trying to win the right to unlock the next reward.</p>\n\n<h1>*Smart Contracts</h1>\n\n<p>Smart contracts are a very interesting part of cryptocurrency’s development over time.  They have been available at least back to the early days of Bitcoin, but they have been more popular (or simply discussed more) in recent years.  A smart contract is an agreement between two parties to do a particular thing when conditions are met.  In basic computer speak it’s like saying “if this happens, then you need to do that”.</p>\n\n<p>One basic (and very useful) function of a smart contract is that they are immutable.  This basically means that they can not be changed.  If you enter an agreement with someone with a particular arrangement, it is not subject to change.  You will get what you agreed upon.</p>\n\n<p>One basic (and very practical) example of a smart contract would be a retail transaction.  If someone agrees to purchase a product from you, a smart contract can be set in place to pay the seller upon receipt of the product.  Another example would be if you had agreed to pay someone $500 / week for work complete, you could have a smart contract set to pay the employee at a specific interval of time.</p>\n\n<h1>How many cryptocurrencies are there?</h1>\n\n<p>There are thousands of cryptocurrencies in existence. One count in early 2021 put that number at over 5,000.  This is one thing to remember while looking at the different currencies and thinking about which ones you might want to purchase, or research.  You can research the different coins on popular sites with  [reddit] , or you can find a listing of the top currencies at [coinmarketcap]</p>\n\n<h1>How do I know the price at any given time?</h1>\n\n<p>For general information, you can use a site like [coinmarketcap] to see the most popular and most valuable cryptocurrencies.  You will be able to see prices for all coins listed here.  One thing to remember is that you may not be able to actually purchase all of the coins listed here.  It would be important to remember to check your cryptocurrency exchange of choice to figure out which coins are available to you, and how much they are at any given time.  For example, if you were to use [binance]  as your exchange, then you would be able to purchase any of the coins listed on the site, and therefore you would be able to find the most recent prices on the market listing or trade execution screen.</p>\n\n<h1>How do I sell cryptocurrency?</h1>\n\n<p>This will depend on where you have signed up for your cryptocurrency exchange.  Typically it’s as easy as logging in, finding your wallet or holdings and then executing a sell order.  You should keep in mind that depending on where you live, you may be subject to income tax, capital gains tax or other legislation around cryptocurrency.</p>\n\n<h1>What is DeFi?</h1>\n\n<p>DeFi is a term that you will hear a lot about during research for cryptocurrencies.  It simply stands for Decentralized Finance and covers a wide range of ways to invest in coins.  Being decentralized, it simply means that a number of entities will hold the information about the transactions at hand which gives no one person or corporation control of the transactions.</p>\n\n<p>DeFi can be used in a wide variety of applications, such as loans.  Through different exchange servers, you can take out loans of cryptocurrency, or even put your own crypto into the server to be loaned out and make some interest on your funds.  DeFi can also set the platform for sports betting (using smart contracts).  For example; if you wanted to bet on a hockey game it could be as simple as if team XYZ beats team ABC, then payout at the following rate.  </p>\n\n<h1>Is cryptocurrency legal?</h1>\n\n<p>For the most part, yes.  However, you will need to check with your local and national government for clarity around the rules and regulations for your specific country.  In most places, cryptocurrency is completely legal and subject to taxes.  However, new rules and regulations do come about frequently due to the infant nature of cryptocurrency (it’s not <strong><em>that</em></strong> old compared to traditional money).  </p>\n\n<h1>Why is blockchain considered a transparent record of sales?</h1>\n\n<p>Because you can see all of the transactions back to the beginning of the blockchain, then you can actually follow coins with relative certainty in many cases.  With all of the miners, owners of digital wallets, stakers, etc. being on the blockchain to validate every single transaction (including transactions before the wallet joined the network, for example) then you can not modify a transaction in the past.</p>\n\n<p>Imagine a government running on blockchain.  You know that $1,000,000 was allocated to a project and it was then associated with wallet XYZ.  You could follow all transactions associated with that wallet, and see where those transactions were sent to.  You know that part of the project was tendering a bid to companies in the local market for refurnishing an office but where did that money go?  With blockchain, you can see where it landed, how much was spent at that time and if something looks ‘off’ or a mystery charge shows up, then the proper people can be held accountable.</p>\n\n<p>Not everyone would necessarily know where the money went (the address isn’t typically plain english), but someone on the oversight committee (for example) would be able to follow the transactions and quickly hold people accountable if needed.  Potentially; not more $50,000 toilet bowls being installed in an office just to use up some funds. </p>\n\n<h1>*Gas Fees</h1>\n\n<p>Something that you will start to see as you begin to research cryptocurrency and explore different forums on the internet, watch different investors online, etc. will be “Gas Fees”.  This term gets thrown around a lot as if everyone knows what it means immediately; which is impossible for a new investor in crypto.</p>\n\n<p>Gas fees are specifically part of the Ethereum network and are a fee that is associated with the work that is required (computational power) to validate a transaction.  This is paid to the computer/computer pool who is working hard on the network to validate the work done on the Ethereum network.</p>\n\n<h1>*How is a new cryptocurrency created?</h1>\n\n<p>Before we start this portion; I am not advising anyone to start their own cryptocurrency.  Rather, provide some basic answers to what really goes into creating a cryptocurrency and to provide some clarity in the differences of the two main types of currencies (coins and tokens).  So far, I’ve only used the word token, but there is a distinct difference between a coin and a token that can be explained easily.</p>\n\n<p>So, if you were following the creation of a cryptocurrency, a new coin would be built on a new and distinct blockchain (such as Bitcoin or Etherum were created) and a token would be built to use that same blockchain to validate their own transactions (such as Litecoin or Dogecoin, for example).  In many cases, these new tokens are designed to enhance the original blockchain technology, but sometimes they’re just designed as an alternate coin that exists distinctly from the other, but with no real enhancements or long term technology planned to support future development.</p>\n\n<p>The main point of this explanation is to provide some caution about getting into the next big coin.  You can create your own cryptocurrency in minutes just by copying to code from an existing coin.  On the plus side, you get a lot of security features and benefits (all the original benefits from the coin, including even Bitcoin), but on the downside, there’s no reason to purchase or use a coin that has no new features or enhancements.  To get a new cryptocurrency to grow and be properly promoted, you need extensive programming knowledge to ensure you can develop and add to the features already in existence - otherwise, what’s the point of the new currency?  With this in mind, you must do some research into a coin before adding it to your portfolio or collection.</p>\n\n<p>To create a token, you will utilize the blockchain of an existing cryptocurrency (such as Ethereum) and you will benefit from the development team that is already in existence.  You wouldn’t need as much programming experience or know-how.  </p>\n\n<h1>dApps</h1>\n\n<p>A dApp or Decentralised Application is an application that is developed on top of a decentralised platform. You know how there are iOS developers that are trained in specific languages and frameworks so they can develop apps for the iPhone? Or Android developers trained to develop apps for the Google Play Store? Well just like that, we have dApp developers who create applications for a decentralised platform like Ethereum.</p>\n\n<p>The front end of a dApp (the bit that you, the user, interacts with) can be on a website, in a mobile app, or any other system that can interact with the backend. The backend (what&#39;s &#39;under the hood&#39; so to speak) runs on the decentralised platform of choice (like Ethereum) and the records are stored on the blockchain itself.</p>\n\n<p>You might think that it&#39;s simply a matter of platform - like choosing to develop for an Apple iPhone or a Google Pixel. But it actually goes beyond that. dApps are often open-source, meaning developers from around the world can contribute. This means more ideas, quicker fixes, better testing - and an all-round higher quality app. It also improves security because dApps come with the security benefits of the blockchain baked in.</p>\n\n<p>_________________________________________</p>\n\n<p>Links have been removed as per auto-moderator for subreddit.</p>\n</div><!-- SC_ON -->",
  "score": 168,
  "permalink": "/r/CryptoCurrency/comments/o2dgbp/updated_cryptocurrency_explanations_for_beginners/",
  "subreddit": "CryptoCurrency",
  "id": "o2dgbp",
  "is_self": true,
  "media": null,
  "is_video": false
}