{
  "author": "shlammyjohnson",
  "original_created_utc": 1636758879,
  "title": "In less than 200 blocks, the taproot upgrade will activate on the bitcoin network.",
  "created_utc": 1636774960,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We&#39;re currently sitting at block 709,436.</p>\n\n<p>The activation block is set to be mined at 709,632.</p>\n\n<p>At the current hash rate, we can expect to see the activation go live in just over 24 hours, sometime during this coming weekend.</p>\n\n<p>Assuming everything goes off without a hitch, this network upgrade will increase network efficiency as well as security utilizing the ability to use a &quot;master key&quot; to sign for multiple transactions rather than one-per-one, which is why it&#39;s harder to track.</p>\n\n<p>Historically price action after upgrades is fairly significant, with huge percentage increases since the last segwit upgrade in 2017, which also created the spin off coin &quot;bitcoin cash&quot; for the group that refused.</p>\n\n<p>Im very excited to see where this upgrade takes us, and I hope we get even more network growth and efficiency in the coming future!</p>\n</div><!-- SC_ON -->",
  "score": 208,
  "permalink": "/r/CryptoCurrency/comments/qsniqp/in_less_than_200_blocks_the_taproot_upgrade_will/",
  "subreddit": "CryptoCurrency",
  "id": "qsniqp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "We're currently sitting at block 709,436.\n\nThe activation block is set to be mined at 709,632.\n\nAt the current hash rate, we can expect to see the activation go live in just\nover 24 hours, sometime during this coming weekend.\n\nAssuming everything goes off without a hitch, this network upgrade will…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "現在のブロック数は709,436です。\n\n活性化ブロックは709,632で採掘されるように設定されています。\n\n現在のハッシュレートでは、24時間以内にアクティベーションが開始されることになります。\n現在のハッシュレートであれば、24時間後、つまり今週末のうちにアクティベーションが開始されることになります。\n\nすべてが順調に進んだ場合、今回のネットワークアップグレードは...",
      "title": "200ブロック以下で、タップルートのアップグレードがビットコインネットワーク上で有効になります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们目前正处于区块709,436。\n\n激活区块将在709,632被开采。\n\n按照目前的哈希率，我们可以期待看到激活区块在短短的\n超过24小时，在这个周末的某个时间。\n\n假设一切顺利，这次网络升级将...",
      "title": "在不到200个区块内，taproot的升级将在比特币网络上激活。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們目前正處於區塊709,436。\n\n激活區塊將在709,632被開採。\n\n按照目前的哈希率，我們可以期待看到激活區塊在短短的\n超過24小時，在這個週末的某個時間。\n\n假設一切順利，這次網絡升級將...",
      "title": "在不到200個區塊內，taproot的升級將在比特幣網絡上激活。"
    }
  ]
}