{
  "author": "Bobdadriver",
  "the_new_excerpt": "I see a lot of posts about ev being the future. In todays thinking yes I can see\nthat, but there are a few skeletons in the closet and hurdles to overcome from\nmy point of view.\n\n 1. Electric motors contain cobalt.... look up to see how its processed who\n    processes it and you'll see it's a dirty…",
  "original_created_utc": 1616333083,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我看到很多帖子说EV是未来。在今天的思维中，是的，我可以看到\n但是，在这一点上，我们还需要克服一些壁垒和障碍。\n我的观点\n\n 1. 电动机含钴....，查查看它的加工方式是谁的。\n    你会发现这是一个肮脏的... ...",
      "title": "试图在电动车上动脑筋。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到很多帖子說EV是未來。在今天的思維中，是的，我可以看到\n但是，在這一點上，我們還需要克服一些壁壘和障礙。\n我的觀點\n\n 1. 電動機含鈷....，查查看它的加工方式是誰的。\n    你會發現這是一個骯髒的... ...",
      "title": "試圖在電動車上動腦筋。"
    }
  ],
  "title": "Trying to wrap my brain around electric vehicles",
  "created_utc": 1616347622,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I see a lot of posts about ev being the future.  In todays thinking yes I can see that, but there are a few skeletons in the closet and hurdles to overcome from my point of view. </p>\n\n<ol>\n<li><p>Electric motors contain cobalt.... look up to see how its processed who processes it and you&#39;ll see it&#39;s a dirty dirty process and not awesome countries to deal with.</p></li>\n<li><p>Lithium...same as above plus Incedibly dirty to recycle.  Rare earth metals.  If China decides to cut supply...uh o spaghetti o.</p></li>\n<li><p>The power grid. Current projection is even with major renovations the power grid is inadequate at best for just standard usage . Thats not including charging your 2.5 cars every night. </p></li>\n</ol>\n\n<p>3a. The power grid. Where does said power come from. Natural gas  power plants nukes? Solar without a breakthrough is as efficient as its gonna get. Battery power is at its limit without technology breakthrough. </p>\n\n<p>So what&#39;s the timeframe for sustainable ev&#39;s. Should investing at this point still be more speculative than value oriented?</p>\n</div><!-- SC_ON -->",
  "score": 51,
  "permalink": "/r/stocks/comments/m9wmmk/trying_to_wrap_my_brain_around_electric_vehicles/",
  "subreddit": "stocks",
  "id": "m9wmmk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752821012
}