{
  "author": "cyber_bully__",
  "original_created_utc": 1637001743,
  "title": "A Bitcoin Explosion: El Salvador Now Has More Digital Wallets Than Traditional Bank Accounts",
  "created_utc": 1637019243,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>During September 2021 El Salvator formally started accepting Bitcoin as legal tender and continues to be on the forefront of the move to mass crypto adoption. Today, President Nayib Bukele announced that Bitcoins presence in his country is so prolific that the number of citizens using digital wallets has outgrown those that have traditional bank accounts.</strong></p>\n\n<p>By Andrew Senior<br/>\nNovember 15th, 2021</p>\n\n<p>During the initial stages of the transition to Bitcoin as a legally accepted currency, the Central American nation was the target of heavy criticism. Many leaders around the globe warned El Salvador that there would be monetary consequences of his country’s foray into digital currencies. President Burkele doubled down in the face of doubt and cited the large portion of his country’s populace without access to any form of a banking system, over 70% at the time, as his main motivation for supporting the switch to Bitcoin. </p>\n\n<p>The transition to Bitcoin was not immediately seen as a victory by the citizens of El Salvador as protests, some violent, arose in opposition to Bitcoins adoption, but things quickly changed and the country and its people have rapidly seen the benefits of adopting Bitcoin as a financial tool to empower the masses. </p>\n\n<p>El Salvador has ramped up its efforts to add additional features to its Bitcoin network and has already deployed hundreds of Bitcoin ATMs. The country has also been aggressive in buying any dips to Bitcoin’s price, adding over 800 Bitcoins when the valuation fell into the $30k-$40k range. Bitcoin’s price quickly recovered from the previously stated lows allowing El Salvador the financial flexibility to redistribute its earnings to construct new schools and hospitals while improving its infrastructure. </p>\n\n<p>Other countries around the world have taken notice of El Salvador’s approach to take its financial future into its own hands via digital currencies and are quickly taking notes. While other nations are adding the ability to blend cryptocurrencies into their existing financial ecosystems, El Salvador remains the prime example of the benefits that Bitcoin can have as a vehicle to re-engineer the finances of an entire country. </p>\n\n<p>As most of the world’s superpowers continue to show their support for Bitcoin and cryptocurrencies as a whole, it’s entirely possible that more nations decide to follow suit with El Salvador’s strategy of building wealth. </p>\n\n<p>Disclaimer: The information above does not constitute investment, financial, trading or any other sort of advice and you should not treat any of the content on this site such. We do not recommend the purchase, sale, or holding of any cryptocurrency or other product. None of our content should be deemed as an offer to purchase, sell, or hold a cryptocurrency or other product or service. Please consider doing your own research and prioritize consulting a certified financial professional before making any investment decisions.</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/CryptoCurrency/comments/qun90s/a_bitcoin_explosion_el_salvador_now_has_more/",
  "subreddit": "CryptoCurrency",
  "id": "qun90s",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "During September 2021 El Salvator formally started accepting Bitcoin as legal\ntender and continues to be on the forefront of the move to mass crypto adoption.\nToday, President Nayib Bukele announced that Bitcoins presence in his country is\nso prolific that the number of citizens using digital…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2021年9月、エルサルバドルはビットコインを法定通貨として正式に受け入れ始めました。\n大規模な暗号の導入に向けた動きの最前線に立ち続けています。\n本日、ネイブ・ブケレ大統領は、自国におけるビットコインの存在が非常に大きいことを発表しました。\n普及しており、デジタル通貨を使用する国民の数は...",
      "title": "ビットコインの爆発。エルサルバドルでは、従来の銀行口座よりもデジタルウォレットの方が多くなった"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "2021年9月，萨尔瓦多正式开始接受比特币作为法定货币。\n并继续走在大规模采用加密货币的前列。\n今天，Nayib Bukele总统宣布，比特币在他的国家的存在是\n越来越多的公民使用数字货币。",
      "title": "一个比特币的爆炸。萨尔瓦多现在的数字钱包比传统银行账户还多"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "2021年9月，薩爾瓦多正式開始接受比特幣作爲法定貨幣。\n並繼續走在大規模採用加密貨幣的前列。\n今天，Nayib Bukele總統宣佈，比特幣在他的國家的存在是\n越來越多的公民使用數字貨幣。",
      "title": "一個比特幣的爆炸。薩爾瓦多現在的數字錢包比傳統銀行賬戶還多"
    }
  ]
}