{
  "author": "Ilovesweets8",
  "original_created_utc": 1658043914,
  "title": "As a black man, why should I have to speak one way around white people and another way around other black people?",
  "created_utc": 1658059196,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A lot of people say I speak &amp;quot;proper&amp;quot;. I try to speak that way around both white people and black people. White people tell me I act white and black people say I speak &amp;quot;funny&amp;quot;. People act like I should &amp;quot;code switch&amp;quot;, which is something I have always hated doing. Like why can&amp;#39;t I just be myself?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/NoStupidQuestions/comments/w120h7/as_a_black_man_why_should_i_have_to_speak_one_way/",
  "subreddit": "NoStupidQuestions",
  "id": "w120h7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "A lot of people say I speak \"proper\". I try to speak that way around both white\npeople and black people. White people tell me I act white and black people say I\nspeak \"funny\". People act like I should \"code switch\", which is something I have\nalways hated doing. Like why can't I just be myself?",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "多くの人が私のことを「ちゃんとした」話し方だと言います。白人と黒人の両方に対して、そのように話すように心がけています。\nを話すようにしています。白人は私が白人のように振舞うと言い、黒人は私が「おかしい」と言う。\nおかしい」と言われます。また、私が「コード・スイッチ」をすべきかのように振舞う人がいますが、これは私が持っているものです。\nをするのが嫌でした。どうして自分らしくいられないんだろう？",
      "title": "黒人として、なぜ白人の前ではある言い方をし、他の黒人の前では別の言い方をしなければならないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "很多人说我说话 \"得体\"。我试着在白人和黑人面前都以这种方式说话\n人和黑人都是如此。白人告诉我我表现得很白，而黑人说我\n说 \"有趣\"。人们认为我应该 \"代码转换\"，这是我一直讨厌的事情。\n我总是讨厌这样做。就像我为什么不能做自己？",
      "title": "作为一个黑人，我为什么要在白人面前用一种方式说话，而在其他黑人面前用另一种方式说话？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "很多人說我說話 \"得體\"。我試着在白人和黑人面前都以這種方式說話\n人和黑人都是如此。白人告訴我我表現得很白，而黑人說我\n說 \"有趣\"。人們認爲我應該 \"代碼轉換\"，這是我一直討厭的事情。\n我總是討厭這樣做。就像我爲什麼不能做自己？",
      "title": "作爲一個黑人，我爲什麼要在白人面前用一種方式說話，而在其他黑人面前用另一種方式說話？"
    }
  ]
}