{
  "author": "GangOrcaFan",
  "original_created_utc": 1635244932,
  "title": "How to overcome the fear to ask a woman out?",
  "created_utc": 1635332797,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Dear members of the sub,  </p>\n\n<p>I was in a long relationship for nearly 10 years - started when I was 18 years and went on till I was 27. It ended unfortunately due to religious issues and opposition from parents. I am from India and I have been shy around women. It took me a while to come out of the pain from my breakup. I am now in Sweden and I see amazing people around me. I have found that I am extremely afraid to ask a woman out(inspite of my long relationship) because I feel that they will reject me straight away. How do I get over this fear?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/qg3lyf/how_to_overcome_the_fear_to_ask_a_woman_out/",
  "subreddit": "TooAfraidToAsk",
  "id": "qg3lyf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Dear members of the sub,\n\nI was in a long relationship for nearly 10 years - started when I was 18 years\nand went on till I was 27. It ended unfortunately due to religious issues and\nopposition from parents. I am from India and I have been shy around women. It\ntook me a while to come out of the pain…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "サブのメンバーの皆様。\n\n私は18歳から27歳まで10年近くお付き合いをしていました。\n27歳まで続いていました。宗教上の問題と両親の反対により、残念ながら終わりました。\n両親の反対で残念ながら終わりました。私はインド出身で、女性に対してシャイなところがあります。それは\n苦しみから抜け出すのに時間がかかりました...。",
      "title": "女性をデートに誘う恐怖心を克服するには？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "亲爱的子成员。\n\n我曾有过一段长达近10年的关系--从我18岁开始，一直到27岁。\n一直持续到我27岁。由于宗教问题和父母的反对，它不幸结束了。\n遗憾地结束了，因为宗教问题和父母的反对。我来自印度，在女性面前我一直很害羞。我花了一些时间才从女性的阴影中走出来。\n我花了一段时间才从痛苦中走出来......",
      "title": "如何克服约女人出去的恐惧？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "親愛的子成員。\n\n我曾有過一段長達近10年的關係--從我18歲開始，一直到27歲。\n一直持續到我27歲。由於宗教問題和父母的反對，它不幸結束了。\n遺憾地結束了，因爲宗教問題和父母的反對。我來自印度，在女性面前我一直很害羞。我花了一些時間才從女性的陰影中走出來。\n我花了一段時間才從痛苦中走出來......",
      "title": "如何克服約女人出去的恐懼？"
    }
  ]
}