{
  "author": "fleshsingularity",
  "original_created_utc": 1639524569,
  "title": "Can I go to a restaurant alone?",
  "created_utc": 1639553143,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have been really lonely and depressed lately and I want to take myself on a “date” to see if that can boost my spirits + just get some nice food. I just don’t know if the servers will think I’m weird, or if they would straight up just not serve me because I would be wasting a table or something? Or maybe I would just be perceived as a weirdo from everyone else in the restaurant? No idea at all, but i’d like to go if it’s possible and not a total social no-no.&lt;/p&gt;\n\n&lt;p&gt;edit: I did it! I enjoyed myself and it wasn’t as bad as I had expected even though I was super nervous. Thank you guys for all of your comments, it really helped encourage me.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/NoStupidQuestions/comments/rgkfdi/can_i_go_to_a_restaurant_alone/",
  "subreddit": "NoStupidQuestions",
  "id": "rgkfdi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I have been really lonely and depressed lately and I want to take myself on a\n“date” to see if that can boost my spirits + just get some nice food. I just\ndon’t know if the servers will think I’m weird, or if they would straight up\njust not serve me because I would be wasting a table or something?…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近本当に寂しくて落ち込んでいるので、自分を連れて行きたいと思います。\n「デートで気分転換＋美味しいものを食べに行く。ただ\nって思われないか、それともストレートに「変な人」と思われないか。\nテーブルを無駄にするから出さないとか？",
      "title": "一人でレストランに行くことはできますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近真的很孤独和沮丧，我想带自己去参加一个\n我想带自己去 \"约会\"，看看是否能提振我的精神+获得一些美味的食物。我只是\n我不知道服务员是否会认为我很奇怪，或者他们是否会直接\n他们会不会因为我浪费了一张桌子而不为我服务？",
      "title": "我可以单独去餐厅吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近真的很孤獨和沮喪，我想帶自己去參加一個\n我想帶自己去 \"約會\"，看看是否能提振我的精神+獲得一些美味的食物。我只是\n我不知道服務員是否會認爲我很奇怪，或者他們是否會直接\n他們會不會因爲我浪費了一張桌子而不爲我服務？",
      "title": "我可以單獨去餐廳嗎？"
    }
  ]
}