{
  "author": "SomeSortOfBrit",
  "the_new_excerpt": "Sup. Today I wanted to show you the shinning light that is Charles Schwab and\nwhy the good old boy is going to have a red hot few years.\n\n 1. Sellable Story\n\nLook you may not like it but an important part of having a stock rise a good\namount comes from how much attention it is going to get from…",
  "original_created_utc": 1613595909,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "燮。今天我想向大家展示的是查尔斯-施瓦布和他的光芒。\n为什么老好人这几年会红红火火？\n\n 1. 可卖的故事\n\n你看，你可能不喜欢它，但一个重要的组成部分，有一个股票上涨了一个很好的。\n数量来自于多少关注度，它将从... ...",
      "title": "查尔斯-施瓦布(schw)即将爆发。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "燮。今天我想向大家展示的是查爾斯-施瓦布和他的光芒。\n爲什麼老好人這幾年會紅紅火火？\n\n 1. 可賣的故事\n\n你看，你可能不喜歡它，但一個重要的組成部分，有一個股票上漲了一個很好的。\n數量來自於多少關注度，它將從... ...",
      "title": "查爾斯-施瓦布(schw)即將爆發。"
    }
  ],
  "title": "Charles Schwab (schw) about to explode",
  "created_utc": 1613641251,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Sup. Today I wanted to show you the shinning light that is Charles Schwab and why the good old boy is going to have a red hot few years.</p>\n\n<ol>\n<li>Sellable Story</li>\n</ol>\n\n<p>Look you may not like it but an important part of having a stock rise a good amount comes from how much attention it is going to get from potential buyers, and the more democratized the market gets the more important this is. Most fucking people aren&#39;t scraping through the bottom of the barrel to find random stocks. They&#39;re listening to the news, reading forums, and seeing what company everybody is talking about and then choosing to buy it. This means that the more you have that stock talked about the more potential buyers you have - Don&#39;t believe me it&#39;s literally just the logical extension of the Cramer Effect.</p>\n\n<p>So what Schwab&#39;s sellable story - The flood of retail investors. In case you live under an actual rock, retail investors just like you are popping up like crazy, and since everybody has got those sweet sweet stimulus checks and have only been saving for months due to the lockdown, they all got money burning a hole in their pocket. Not to mention everybody is bored so what do you do that gets the blood pumping when the most movement you get is when you walk from your bed to your desk each day? You grip it and rip it on stocks. Don&#39;t believe it look at Schwabs January 2021 Activity Report:</p>\n\n<p><a href=\"https://content.schwab.com/web/retail/public/about-schwab/schw_jan2021_press_release.pdf\">https://content.schwab.com/web/retail/public/about-schwab/schw_jan2021_press_release.pdf</a></p>\n\n<p>They added over a million new accounts in January. That&#39;s an insane number. Now I know what your thinking, but they added 14 Million in October and 1.2 Million in May! Yes that&#39;s because they acquired TD Ameritrade and USAA&#39;s investment arm in those months, this is an organic million which is bonkers. They added on a whole USAA in a month organically.</p>\n\n<p>2) Financial Outlook</p>\n\n<p>If you want to see how they have been doing here is their past financials:</p>\n\n<p><a href=\"https://content.schwab.com/web/retail/public/about-schwab/schw_q4_2020_earnings_release.pdf\">https://content.schwab.com/web/retail/public/about-schwab/schw_q4_2020_earnings_release.pdf</a></p>\n\n<p>I&#39;m not explaining it all get over it, but basically they&#39;ve been growing like an Australian fire.</p>\n\n<p>What I want to look at is how these financials will look like in a year, and to do that you have to understand one of the major ways that Schwab make its money. When you open an investment account you dump all your little coins in and you buy stock right. Well the thing is even though you put in all these coins most people don&#39;t use them all - in fact on average they leave 12% in cash in the account. Schwab then takes this 12% and invests and keeps the profit, this sort of capital acquiring strategy has been making people rich for years. This does mean there is risk if their investments go badly, in fact this is why they lost some growth in revenue in 2020, its not because they didn&#39;t grow as a company, it&#39;s because the &quot;safe&quot; investments that a firm would take with this sort of stuff got wrecked all over and stayed pretty bad during covid, now its pulling back up though.</p>\n\n<p>So what does this mean - well basically the more people you have with brokerages account the more money you can invest thats why this flood of investors is huge. Further this isnt some temporary jump in investors retail investors have been flooding the market for years and they arent leaving, because people so rarely close their investment account unless you really try to get rid of them (cough cough robinhood). This mean that they have a flood of customers that are going to stay for a long time. This is good because the older you get the more money you put into your account (on average), and according to Schwabs Winter report 53% of their clients are households with a head of house hold less than 41 and they&#39;re typically rich. This means that over time this bump will keep paying out big.</p>\n\n<p><a href=\"https://content.schwab.com/web/retail/public/about-schwab/schw_2021_winter_business_update_020221.pdf\">https://content.schwab.com/web/retail/public/about-schwab/schw_2021_winter_business_update_020221.pdf</a></p>\n\n<p>All of this combined and the bullish technicals mean only one thing - a huge earnings. Now I could go on but I&#39;ve gotten kinda bored writing this but if this is well responded to I&#39;ll give a full analysis including the financials and the technicals.</p>\n\n<p>Positions: 500 shares at 54</p>\n</div><!-- SC_ON -->",
  "score": 57,
  "permalink": "/r/investing/comments/lm4ob7/charles_schwab_schw_about_to_explode/",
  "subreddit": "investing",
  "id": "lm4ob7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728622068
}