{
  "author": "Lemonmule69",
  "original_created_utc": 1630129275,
  "title": "Update in the SEC vs ripple labs case. The SEC is refusing to hand over documents in regards to their internal trading policies. Even after being ordered by the judge….twice.",
  "created_utc": 1630146978,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>What you are seeing here is elite corruption at its highest level. The SEC is refusing to hand over internal trading policies in regards to staff and their holdings of securities.</p>\n\n<p>Basically the SEC allowed staff to own Xrp up until 2018/2019. They emailed 3rd party investors (you and me) in late 2020 and stated they had not made a determination on Xrp’s security status.</p>\n\n<p>Yet they are suing ripple, Brad and Chris for breaking securities laws from……2013. There is a hearing coming up in regards to these documents…..again. </p>\n\n<p>The SEC is nothing but a gangster organisation who litigate for fines which is their source of revenue. The Ripple lawsuit has given the public a look behind closed doors to see how utterly corrupt they are.</p>\n\n<p>Like Elon said on 60 mins</p>\n\n<p>“I have no respect for the SEC”</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/pd45jk/update_in_the_sec_vs_ripple_labs_case_the_sec_is/",
  "subreddit": "CryptoCurrency",
  "id": "pd45jk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "What you are seeing here is elite corruption at its highest level. The SEC is\nrefusing to hand over internal trading policies in regards to staff and their\nholdings of securities.\n\nBasically the SEC allowed staff to own Xrp up until 2018/2019. They emailed 3rd\nparty investors (you and me) in late…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここで見ているのは、最高レベルのエリートの腐敗です。SECは\n証券を保有している職員の内部取引方針の開示を拒否しています。\n証券を保有しています。\n\n基本的にSECは、2018/2019年までスタッフがXrpを保有することを認めていました。彼らは第三者の投資家（あなたや私）にメールで\n第三者の投資家（あなたと私）にメールを送り...",
      "title": "SECとリップルラボの訴訟についての最新情報です。SECは内部取引方針に関する文書の提出を拒否しています。裁判官から....twiceの命令を受けてもです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你在这里看到的是最高水平的精英腐败。美国证券交易委员会正在\n拒绝交出有关工作人员和他们的内部交易政策。\n持有的证券。\n\n基本上，SEC允许员工在2018/2019年之前拥有Xrp。他们向第三方发送电子邮件\n第三方投资者（你和我）在后期...",
      "title": "美国证券交易委员会对涟漪实验室案的更新。美国证券交易委员会拒绝交出有关其内部交易政策的文件。即使在法官下令....，也是如此。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你在這裏看到的是最高水平的精英腐敗。美國證券交易委員會正在\n拒絕交出有關工作人員和他們的內部交易政策。\n持有的證券。\n\n基本上，SEC允許員工在2018/2019年之前擁有Xrp。他們向第三方發送電子郵件\n第三方投資者（你和我）在後期...",
      "title": "美國證券交易委員會對漣漪實驗室案的更新。美國證券交易委員會拒絕交出有關其內部交易政策的文件。即使在法官下令....，也是如此。"
    }
  ]
}