{
  "author": "UncleZiggy",
  "the_new_excerpt": "ABBREVIATION INDEX:\n\nBB -- Blackberry\n\nAWS -- Amazon Web Services\n\nIVY -- Intelligent Vehicles Yo. I don't actually know if this stands for\nanything\n\nQNX -- Quick-Unix perhaps? It's a Unix-like embedded microkernel RTOS (real-time\noperating system)\n\nEOY -- end of year\n\nPT -- price target\n\nSP --…",
  "original_created_utc": 1613094638,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "缩略语索引。\n\nBB -- -- 黑莓\n\nAWS -- -- 亚马逊网络服务\n\nIVY--智能汽车哟。我其实也不知道这是不是代表着\n任何\n\nQNX--也许是Quick-Unix？这是一个类似Unix的嵌入式微内核实时操作系统（real-time\n操作系统)\n\nEOY - 年终\n\nPT -- -- 目标价格\n\nSP --...",
      "title": "黑莓 -- 一个休眠的巨人"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "縮略語索引。\n\nBB -- -- 黑莓\n\nAWS -- -- 亞馬遜網絡服務\n\nIVY--智能汽車喲。我其實也不知道這是不是代表着\n任何\n\nQNX--也許是Quick-Unix？這是一個類似Unix的嵌入式微內核實時操作系統（real-time\n操作系統)\n\nEOY - 年終\n\nPT -- -- 目標價格\n\nSP --...",
      "title": "黑莓 -- 一個休眠的巨人"
    }
  ],
  "title": "Blackberry -- A Dormant Giant",
  "created_utc": 1613100429,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h3><strong>Abbreviation Index:</strong></h3>\n\n<p>BB -- Blackberry</p>\n\n<p>AWS -- Amazon Web Services</p>\n\n<p>IVY -- Intelligent Vehicles Yo. I don&#39;t actually know if this stands for anything</p>\n\n<p>QNX -- Quick-Unix perhaps? It&#39;s a Unix-like embedded microkernel RTOS (real-time operating system)</p>\n\n<p>EOY -- end of year</p>\n\n<p>PT -- price target</p>\n\n<p>SP -- stock price</p>\n\n<p>EV -- electric vehicle</p>\n\n<p>SoC -- System on a Chip</p>\n\n<p>IoT -- Internet of Things</p>\n\n<hr/>\n\n<p><strong>TL;DR:</strong> Blackberry ($BB) is almost daily announcing new partnerships and new clients for their software, including new deals with companies that are just now or just this year launching autonomous vehicles that run on QNX software. The big kahuna of all these deals is BB&#39;s recent partnership with Amazon to go 50/50 into BB&#39;s software IVY, a scalable cloud-connected software platform designed for intelligent vehicle data gathering and data sharing. With Amazon&#39;s Jeff Bezos stepping down, and Andy Jassy filling his shoes, who was the CEO of AWS, BB will have some very firm support behind Amazon&#39;s new CEO. BB and Amazon are having a webinar Feb. 23rd about their partnership and IVY, which should be a strong catalyst moving forward. IVY beta earnings are projected to begin impacting BB&#39;s Q3 or Q4 earnings beginning in November this year, with IVY fully being integrated around the 2023 timeframe. Through a lot of reading and analysis, I believe BB has a four-tiered business model dating back as far as 2013 when BB&#39;s CEO John Chen was hired to begin the massive BB turnaround process. Tier 1 was development of QNX and IVY, lasting from 2013 to today and onward, however, Tier 2 overlaps Tier 1. Tier 2 was customer acquisition, primarily distributing their secure software in QNX, SecuSuite, Spark, and AtHoc. They secured 37 automakers during this time, including 9 of the top 10 automakers, over 106 governments from around the world, including all of G7 governments and 18 of G20 governments, as well as 77% of Fortune 100 companies, including partnerships with Amazon, Microsoft, Google, Sony, XPENG, XPEV, NVIDIA, Intel, Qualcomm, Baidu, IBM, LG, Samsung, and others. Well if they have such an incredible market share, why are they so undervalued? The answer is that QNX was not the end-all-be-all product. It was the base that the rest would be built on. Particularly IVY, which is the real money-maker. Tier 3 is IVY beta, and Tier 4 is IVY distribution and subscription revenue streams. So why is IVY the big deal and not QNX? They are both big deals, but QNX was never designed to be the money-maker. They are charging a one-time fee per vehicle use. There is a bigger goal here, to secure their clients as their customers for the bigger product in IVY. They also need QNX is to be a secure system in order for IVY to be trustworthy and reliable. And it certainly is secure. QNX has ISO26262 certification, as well as US government clearance, NSA clearance, and CIA clearance. The US government uses QNX and Blackberry products. Just let that sink in. That should tell you something about its security. Anyways, IVY will be used in autonomous vehicle level 4 and level 5 communication (note that QNX is level 5 certified... it has a business moat just in its security level and clearance), as well as EV and gas vehicle data collecting and AI-powered data synthesis. See below for more details on IVY. Wrapping up this TL;DR, BB is going to do well this year as IVY unfolds, but will do even better in the next 2-5 years. I have a PT of 25 by EOY and a PT of 80 by 2023 EOY, and a PT of 160+ by 2025 EOY</p>\n\n<p><strong>TL;DR: TL;DR:</strong> BB go up, but go slow for now because IVY revenue not here yet, but big fast later. Make big monies, BB is the future tech that Amazon, Microsoft, Google, etc will be building upon in the EV and IoT market</p>\n\n<hr/>\n\n<h3><strong>FAQs:</strong></h3>\n\n<p><strong>1) Why is Blackberry stock price going down?</strong></p>\n\n<p><strong>A:</strong> A few possible reasons. One, as of today the whole market is down. BB is connected to overall market swings as most companies are. Two, there may be some market manipulation by bearish financial institutions as there are a lot of calls expiring on 2/19. I would expect that BB SP to be volatile between $11 and $14 between now and then, and to move upwards after 2/19 and especially after 2/23 (Amazon + BB webinar). Three, there are bearish investors who still think BB is a phone company and don&#39;t understand the underworkings of BB&#39;s business strategy, their software, their patents, or their partners. Their revenue has been affected by coronavirus and has not been particularly phenomenal so far this year.</p>\n\n<p><strong>2) Should I invest now or later?</strong></p>\n\n<p><strong>A:</strong> First off, I&#39;m not a financial advisor, these are just my opinions. Invest at your own risk. In my opinion, BB will see a large SP growth by EOY, anywhere from 50% to 150% growth by EOY. While revenue will likely not increase much this year, the partnership with Amazon and news regarding IVY will likely create new floors for their SP much higher than the current SP right now, at around the $12 SP</p>\n\n<p><strong>3) What&#39;s stopping competitors from building a similar product and hurting BB&#39;s business?</strong></p>\n\n<p><strong>A:</strong> There&#39;s a lot of reasons why BB has a huge moat right now. One, notice the partners that BB has with QNX. They&#39;ve got all the big boys working them, aside from Apple and Tesla. Seeing as SpaceX runs on QNX, and seeing that Apple was trying to make a deal with Hyundai that did not go through, I think it is still possible that either Tesla or Apple or both companies could also make a deal with BB to use QNX as their OS system. BB worked to develop their QNX embedded microkernel OS for the last eight years or so. Anyone trying to step into the game now is far too late. Apple has the best chance of all companies, as it has its own OS and Apple knows security very well, but this still requires an entirely new system in order to work in the EV sector. Also, Apple announced recently that they would be developing their own EV, although they did not give much details beyond that statement. The likelihood that they are both working on the hardware and software side of this thing is slim given the large number of difficulties that come with certification as it relates to the cybersecurity software space. Regardless, I would suspect that either Apple or Tesla is the most likely to be competitors in this space, but neither company has successfully completed a certified OS system, particularly for the emerging sector of autonomous EVs. Tesla is currently building a Linux-based system that is having a lot of difficulty in passing certifications such as ISO26262, a struggle that has been ongoing for years now. They may achieve a product that passes these safety regulations and certifications, but the question remains whether this will be in time as the EV and autonomous market picks up speed, and whether competing companies would even be interested in using their product. In fact, any car company is unlikely to develop their own OS software because none of their competitors would be likely to use it. BB is the perfect business to license since it is not competing in the hardware sector for the EV market. This argument can also be used for Apple if they are also building an EV.</p>\n\n<p><strong>4) Why is BB&#39;s revenue so low if they have so many customers and partners?</strong></p>\n\n<p><strong>A:</strong> QNX has been licensed so far as a one-time purchase, per vehicle or IoT using their software. IVY will be a subscription-based software that also includes a one-time purchase. Thus, BB&#39;s revenue streams are somewhat unimpressive currently, but they are playing the long game. If my hypothesis is correct, it is John Chen&#39;s goal to lay low as software is developed and customer relationships are built. It&#39;s the same with the book market. It&#39;s the sequel that makes all the money, not the first book. QNX is just the first book of a series looking to hook in its customers with low costs before hitting &#39;em with the strong follow up in IVY. Additionally, in order to build a competitive business moat, it was to their advantage to not forewarn any competitors of their involvement and plans. Consider John Chen&#39;s work as a CEO in his last business Sybase. Chen worked as the CEO of Sybase for 10 years. For the first 7 years, the SP remained at around $10 a share. Three years later, the SP was at $100 a share. I suspect he is implementing a similar model with Blackberry. Chen joined Blackberry in 2013. BB stock actually dropped for most of the last 7 years, resting at a stock price of around $5. Now BB is at $12 a share. I would not be surprised if BB reaches $50 two years from now.</p>\n\n<hr/>\n\n<h3><strong>Now for the details.</strong></h3>\n\n<p>Read this for DD on BB&#39;s achievements, certifications, markets, QNX products, EV growth, Spark software and clients, BB Radar, software pricing, and BB challenges:</p>\n\n<p><a href=\"https://old.reddit.com/r/BB_Stock/comments/lc67bo/comprehensive_guide_about_bb_and_how_it_shall/\">Comprehensive Guide about BB and how it shall take off in coming years</a></p>\n\n<hr/>\n\n<h1><strong>Full List of Clients and Partners:</strong></h1>\n\n<p>Blackberry Clients and Partners</p>\n\n<p><strong>Automakers:</strong> Honda, Audi, Jeep, Mitsubishi, Ford, Hyundai, Volkswagen, Bentley, Lamboghini, Byton, Mini (cooper), Toyota, Subaru, Fiat Chrysler, Mazda, Nio, BMW, Porsche, Lexus, Kia, Land-Rover, Mercedes-Benz, Buick, Jaguar, Visteon, Skoda, Chevrolet, Nissan, Acura, Continental, General Motors, Baidu, Motional</p>\n\n<p><strong>Other:</strong> Denso, Aptiv, Bosch, Panasonic, Harman, Bugatti, LG, Vodafone, Bell, Carahsoft, CACI, Telus, iSec, KPMG, Tableau, Qlik</p>\n\n<p><strong>Major:</strong> Amazon, Google, Sony, XPENG, XPEV, Li Auto, NVIDIA, Canoo, Microsoft, Intel, Verizon, Qualcomm, IBM, LG, Samsung</p>\n\n<p><strong>Major Investors:</strong> PRIMECAP, Hamblin Watsa, Ontario Teachers’ Pension, Vanguard, Harris Associates, ETF Managers Group, Wells Capital, Arrowstreet Capital, Kahn Brothers Advisors, Norges Bank Investment</p>\n\n<p><strong>Governments:</strong> Albania, Andorra, Angola, Argentina, Australia, Austria, Bahrain, Belarus, Belgium, Benin, Bosnia and Herzegovina, Botswana, Brazil, Brunei, Bulgaria, Burkina Faso, Cameroon, Canada, Congo, Croatia, Czech Republic, DR Congo, Denmark, Egypt, Estonia, Finland, France, Gabon, Germany, Ghana, Gibraltar, Greece, Guadeloupe, Hong Kong, Hungary, Indonesia, Ireland, Italy, Japan, Kenya, Kuwait, Latvia, Lesotho, Liechtenstein, Lithuania, Luxembourg, Macau, Macedonia, Malawi, Malaysia, Mali, Malta, Marthinique, Mauritania, Mauritus, Mayotte, Mexico, Moldova, Monaco, Montenegro, Morocco, Mozambique, Namibia, Netherlands, Netherlands Antilles, New Zealand, Nigeria, Norway, Oman, Philippines, Poland, Portugal, Qatar, Romania, Russia, Réunion, Saint Barthélemy, Saint Martin, San Marino, Saudi Arabia, Senegal, Serbia, Singapore, Slovakia, Slovenia, South Africa, Spain, Swaziland, Sweden, Switzerland, Taiwan, Tanzania, Thailand, Togo, Turkey, USA, Uganda, Ukraine, United Arab Emirates, United Kingdom, Uruguay, Vatican City, Western Sahara, Zambia, Zimbabwe</p>\n\n<hr/>\n\n<h1><strong>Blackberry Current Revenues:</strong></h1>\n\n<p><a href=\"https://www.trefis.com/stock/bb/articles/472099/blackberry-revenues-how-does-blackberry-make-money/2019-09-17\">BlackBerry Revenues: How Does BlackBerry Make Money? -- Trefis</a></p>\n\n<p>--&gt; This display the biggest bearish argument to BB. Until IVY begins producing new revenue streams, BB is likely to not exponentially increase revenue streams, but only sustain moderate YoY growth</p>\n\n<hr/>\n\n<h1><strong>Blackberry Analysis Regarding Infotainment and Google and Ford Deal:</strong></h1>\n\n<p>see &quot;Blackberry (BB) Stock News Analysis | What I need to say...&quot; by Financial Live by LEYA on the forbidden video website</p>\n\n<p>--&gt; The media recently picked out a story that left out a lot of pertinent information, making it seems that BB lost Ford as a client. This is not true. QNX is designed to be a SoC. This means that other operating systems, such as Linux or Android, can be easily added to QNX. It is in fact encouraged. The Ford and Google deal was simply announcing the Ford would be using Android as their infotainment system. I believe that BB was never intended to try and be the predominant entity for all software systems in EVs or IoTs, but the backbone that connects all together, and to protect all components in a secure system. Autonomous EVs and even regular EVs in general would not be possible without a secure system protecting the product, as is true with IoTs. This is also why things like US Fighter Jets run on... you guess it, QNX. Ford is still using QNX. It is simply also now using Android that is running on top of QNX\nmore commentary on this: <a href=\"https://old.reddit.com/r/stocks/comments/ldcahf/analyzing_blackberry_bear_argument_case_no_1_ford/\">Analyzing Blackberry Bear Argument - Case No. 1: Ford Deal</a></p>\n\n<hr/>\n\n<h2><strong>Pretty Charts</strong></h2>\n\n<p><a href=\"https://stockhouse.com/companies/bullboard/t.bb/blackberry-limited?postid=32093887\">The New BlackBerry Everyone is Talking About $BB</a></p>\n\n<hr/>\n\n<h1><strong>Facebook Settlement with BB</strong></h1>\n\n<p><a href=\"https://imgur.com/GSmc5RH\">Image</a></p>\n\n<p>This is an interesting one to be sure. Facebook was being evil, like the do, and were caught using a number of BB patents. They settled in February, and the day that the settlement was finalized, John Chen (BB CEO) tweeted reminding everyone that BB is used on the ISS</p>\n\n<p><a href=\"https://twitter.com/JohnChen/status/1358853064153784321?s=20\">https://twitter.com/JohnChen/status/1358853064153784321?s=20</a></p>\n\n<p>Well, the connection and speculation here is that Blackberry is going to the moon, and that the settlement is rather significant. Someone else also dug out some information in Facebook&#39;s most recent 10-K, specifically a portion for a &#39;non-cancelable contractual commitment&#39; of an amount of $7500 million dollars. That&#39;s 7.5 billion btw. We don&#39;t know how big the settlement is, but it is worth noting that BB&#39;s entire market cap is 7.5B. I highly doubt that a settlement would reach such lofty numbers, but it could be possible that FB settled for some initial amount of $1B or so, as well as $1B in reoccurring payments over several years. We won&#39;t know until March 15th actually, so stay tuned.</p>\n\n<hr/>\n\n<h1><strong>Blackberry New Partnerships</strong></h1>\n\n<p>Within the last few weeks, Blackberry has announced a stronger partnership with Baidu (China&#39;s Google), as well as their involvement with Baidu choosing to use QNX for their autonomous vehicles that will be hitting the road, as early as this year and next. BB has also announced their involvement with Motional, a joint venture between Hyundai and Aptiv, which will use QNX for their autonomous vehicles. Motional will be partnering with Lyft to use autonomous vehicles to begin serving customers and will be deploying their vehicles in 2023. It was also announced that QNX will be working with AOSP (Android Open Source Project), as well as announcing yesterday that QNX Hypervisor 2.2 is now released, which is what allows Android and Linux to run on top of QNX.</p>\n\n<p><a href=\"https://old.reddit.com/r/BB_Stock/comments/lhpztu/a_sumup_of_all_the_recent_news_on_bb/\">A sum-up of all the recent news on $BB</a></p>\n\n<hr/>\n\n<h1><strong>BB&#39;s Technical Page on QNX Security</strong></h1>\n\n<p><a href=\"http://support7.qnx.com/download/download/26406/QNX%20OS%20Security.pdf\">Link</a></p>\n\n<p>--&gt; Very technical. But cool stuff.</p>\n\n<hr/>\n\n<h1><strong>Rumor: Blackberry Buyout? Here&#39;s why that&#39;s not happening:</strong></h1>\n\n<p>Just read this post. It&#39;s quite revealing:</p>\n\n<p><a href=\"https://old.reddit.com/r/BB_Stock/comments/lgdokd/great_day_for_bb_despite_stick_dipping/\">Great Day for BB despite stick dipping.</a></p>\n\n<p><strong>TL;DR:</strong> Amazon could have easily bought BB. Why didn&#39;t they? Well, all the big players are interested in this EV and IoT emerging sector. This is the new wave of technology that will dominate the market. First we had the dot.com boom, then the cell-phone and smart-phone market, and now we have the autonomous EV and IoT market. If Amazon were to buy BB, they would have to submit a tender offer. This would be a red flag to all the big players that Amazon were trying to buy up the best security out there. It would be a bidding war that could result in a double-digit multi-billion dollar buyout. It was much more to their advantage to create a secret alliance with BB and establish a 50/50 partnership, whose contract includes exclusivity for their use of IVY. Ouch! That&#39;s gotta hurt. This is where the importance of QNX lies. BB will be able to pull the rug out from any company that chooses to use something other than IVY. No IVY, no QNX, no EV. It will be a package deal where IVY is the big money maker. All other companies will have to build from the ground up or be forced to license QNX and make their money off of other sectors, such as the infotainment sector, as Google has already begun to do with the Ford deal. When this deal happened, the other big boys wet their pants realizing they needed to get into this space, and fast. Microsoft partnered with Cruise/GM. Apple tried to partner with Hyundai, who was so flattered, they may have initially said yes or indicated so, before realizing that they were already partnered with BB, so it was a no-go. Not sure if that is fact or fiction, but it is an interesting proposal.</p>\n\n<hr/>\n\n<h1><strong>Blackberry IVY + AWS Partnership:</strong></h1>\n\n<p>Alright, so what&#39;s the deal with IVY? Why is it going to be so profitable? Why is IVY the real money-maker, while QNX has been used as the customer-acquisition software tool? Check out this picture:</p>\n\n<p><a href=\"https://imgur.com/P3mjahD\">Image</a></p>\n\n<p>For one, IVY is designed for real-time communication between EVs or other IoTs. Autonomous driving level 5 requires vehicles to communicate with one another. This is where IVY comes in. IVY connects the different software components of an EV (which presumably are running on QNX), as well as harvesting data on those systems. The data used can be distributed for a wide-variety of uses, including, but not limited to, automakers and suppliers, app developers, consumer services, smart cities, EV charging providers, insurance companies, and vehicle maintenance providers. All of these different sectors will be willing to pay subscriptions for these data services, as well as the automakers and IoT makers who will also be willing to pay subscriptions for IVY. For instance, IVY can help share information between vehicles that will allow for a car detecting ice roads in one area so that other cars using IVY can take a different route. This results in less crashes, which helps the automakers. Insurance companies can use data from all these different data points as well, allowing them an inside-view of their clients. The list of what is possible here is inexhaustible.</p>\n\n<p>As for price points, the subscription models for multiple outside companies wanting to use the data will be create huge revenue streams for BB. With Amazon as a 50/50 partner, and with their resources and strategic management, BB will be poised to be the foundation in security and data sharing for the entire EV, and somewhat of the IoT market (the IoT market has more competitors for sure)</p>\n\n<p>see &quot;Is BlackBerry Stock Undervalued?&quot; by Wealthy Mindset on the forbidden video website</p>\n\n<p>see &quot;Roadmap to $180 a share (BlackBerry Stock)&quot; by Wealthy Mindset on the forbidden video website</p>\n\n<hr/>\n\n<h1><strong>Revenue, revenue, revenue...</strong></h1>\n\n<p>Blackberry is poised to be an industry leader in EV, government, and IoT security and data sharing with products such as QNX, IVY, Spark, and their other software products. Stock price will likely stay somewhat stunted until IVY revenue begins picking up. It is possible that more announcements and marketing related to IVY will make this growth more rapid. In my opinion, either way BB over the next 5 years will 10x. The question is whether you want to get in now at $12 / share or two years from now at $40 a share or something similar, assuming that either way this stock is going to push for that 100B market cap (it&#39;s currently at 7B). There will be bearish analysts that will continue to say that Blackberry is a worthless company until those IVY revenue streams begin to come in. It is also possible that a realistic competitor may emerge within the next three years, such as Tesla or Apple. But if Apple is seeking to create its own EV product, then both companies will have a hard time finding any way to license their software to any other company. It remains possible that Apple and/or Tesla may strikes deals with BB as well in order to be able to produce autonomous vehicles and get a bite of that market share</p>\n\n<hr/>\n\n<h1><strong>Really, no competitors?</strong></h1>\n\n<p>Well it&#39;s called a business moat for a reason. As we have recently seen, QNX is working with AOSP, and so clearly, they are not to be worried about. Tesla is not a true competitor as their OS product is not certified yet, and has demonstrated difficulty in doing so, and additionally, other automakers will not want to benefit their competitors by using their product. A third-party non-auto-maker will be much more desirable. Other companies such as VxWorks, have a lot of to prove both in security and certifications, as well as producing an OS product that is compatible with an emerging autonomous level 5 EV market. QNX&#39;s embedded microkernel RTOS is very much unique in this regard. This type of system allows for real-time processing and power distribution, while protecting the system from attacks. In an embedded microkernel system, if one part of the system is attacked, the whole system will not shut down, in layman&#39;s terms. This is essential for the security of any high-risk product that is built upon an underlying software that controls that different components of the system.</p>\n\n<hr/>\n\n<h1><strong>Conclusion:</strong></h1>\n\n<p>All eyes are turned towards Blackberry right now. People want to know what this deal with Amazon will look like, how it will work, what they will focus on, (will Amazon also use this system for a fleet of delivery drones? hmmm), what the revenue streams will look like, what are their projections, what markets and sectors are they targeting, what are their future goals, what will Amazon be doing on their end, etc, etc. The Amazon + BB webinar may answer some of those questions, or maybe they won&#39;t. Time will tell (Feb. 23rd, specifically -- here&#39;s a link to sign up and watch: <a href=\"https://onlinexperiences.com/scripts/Server.nxp?LASCmd=AI:4;F:QS!10100&amp;ShowUUID=44A51ADB-0425-420D-8A06-6ACABFCF98FF&amp;LangLocaleID=1033&amp;Referrer=https%3A%2F%2Fwww.autonews.com%2Fevents%3Fevent_type%3D64571\">Next-Gen Vehicle Architectures Unlock Unprecedented Opportunities for Automakers</a>). Also look out for that FB settlement numbers on March 15th, and Q4 earnings March 31st. I don&#39;t expect Q4 earnings to be particularly interesting unless they include the FB settlement numbers. Could those numbers instead be put into Q1 earnings for 2021? Possibly.</p>\n\n<p>Initially IVY beta is expected to begin being released late this year. I will also be looking forward to see how Apple and Tesla respond in the coming months. Ultimately, BB is a long-term play, but is poised to dominate this emerging industry with the partnerships and security focused software they have secretly been building. Now if only the could do something about their logo, some rebranding would be nice...</p>\n\n<hr/>\n\n<p><em>This is not financial advice, just my own opinions. I am not a financial advisor nor a professional. I own 14k shares in Blackberry, as well as options (10x 8/17/21 20c BB). Do your own DD and fact check me as well</em></p>\n</div><!-- SC_ON -->",
  "score": 4422,
  "permalink": "/r/stocks/comments/li0rpg/blackberry_a_dormant_giant/",
  "subreddit": "stocks",
  "id": "li0rpg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728622091
}