{
  "author": "Redditisforposers",
  "the_new_excerpt": "So uhh... I finally got around to investing in crypto on Friday. I was meaning\nto do it back in February, but I had some issues getting my accounts in order,\nand moving money around. I thought “Hey asshole, all of this shit is literally\nthe highest it has ever been, it won’t be like this for long.”…",
  "original_created_utc": 1618715129,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "金曜日にようやく暗号に投資することができました。2月にやろうと思っていたのですが\n2月にやろうと思っていたのですが、口座の整理に問題がありました。\nお金を移動させることができませんでした。私は「おい、バカ野郎、このクソみたいなものは全部、文字通り\n長くは続かないだろう」と思っていました。",
      "title": "Lo, the cryptopocalypse has begun, and I am the harbinger of its harbinger."
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以，呃......我终于在周五投资了加密技术。我的意思是\n在2月份的时候就想做了，但我的账户有些问题。\n和移动的钱。我想：\"嘿，混蛋，所有这些狗屎是字面上的\n有史以来最高的一次，它不会像这样长久的。\"...",
      "title": "哟，天启已经开始了，而我就是它的预兆。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以，呃......我終於在週五投資了加密技術。我的意思是\n在2月份的時候就想做了，但我的賬戶有些問題。\n和移動的錢。我想：\"嘿，混蛋，所有這些狗屎是字面上的\n有史以來最高的一次，它不會像這樣長久的。\"...",
      "title": "喲，天啓已經開始了，而我就是它的預兆。"
    }
  ],
  "title": "Lo, the cryptopocalypse has begun, and I am its harbinger.",
  "created_utc": 1618727545,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So uhh... I finally got around to investing in crypto on Friday. I was meaning to do it back in February, but I had some issues getting my accounts in order, and moving money around.  I thought “Hey asshole, all of this shit is literally the highest it has ever been, it won’t be like this for long.” But then I thought “I sure would like to own a yacht.” Well now you’re all fucked, you’re welcome.</p>\n\n<p>Edit: basically anything I touch turns to shit, if I wasn’t being clear enough.</p>\n</div><!-- SC_ON -->",
  "score": 462,
  "permalink": "/r/CryptoCurrency/comments/mt4wbx/lo_the_cryptopocalypse_has_begun_and_i_am_its/",
  "subreddit": "CryptoCurrency",
  "id": "mt4wbx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171519553
}