{
  "author": "Eric_Something",
  "the_new_excerpt": "Look, I get it. You see Doge going 5x in 3 days, you see XRP doubling within a\nday and you think to yourself \"It's been going up this whole time, I'll invest\nsome, wait for it to rise a bit more and then cash out\". You put your money on\nthat coin and surprise, surprise, it goes down immediately. You…",
  "original_created_utc": 1612221156,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "听着，我明白了。你看到Doge在3天内翻了5倍，你看到XRP在1天内翻了一倍。\n一天，你想：\"它一直在上涨，我将投资。\n些，等它再涨一点再套现\"。你把钱放在\n那枚硬币和惊喜，惊喜， 它立即下降。你...",
      "title": "如果你是一个新的投资者，为了爱护你的钱包，请不要进行当日交易。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "聽着，我明白了。你看到Doge在3天內翻了5倍，你看到XRP在1天內翻了一倍。\n一天，你想：\"它一直在上漲，我將投資。\n些，等它再漲一點再套現\"。你把錢放在\n那枚硬幣和驚喜，驚喜， 它立即下降。你...",
      "title": "如果你是一個新的投資者，爲了愛護你的錢包，請不要進行當日交易。"
    }
  ],
  "title": "If you're a new investor, for the love of your wallet, DO NOT day trade.",
  "created_utc": 1612251131,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Look, I get it. You see Doge going 5x in 3 days, you see XRP doubling within a day and you think to yourself &quot;It&#39;s been going up this whole time, I&#39;ll invest some, wait for it to rise a bit more and then cash out&quot;. You put your money on that coin and surprise, surprise, it goes down immediately. You think to your self &quot;Surely it won&#39;t crash immediately after I invested&quot;. Oh, but it will. You see, the moment you see the shilling about a coin going up, you already missed the pump.</p>\n\n<p>I found a couple of great articles about chasing pumps or day trading in general that I wanted to share. These were written before the shitshow that is happening in stock/crypto markets this past month, but the principals stay the same:</p>\n\n<p><em>1st article:</em>\n<a href=\"https://vantagepointtrading.com/whats-the-day-trading-success-rate-the-thorough-answer/\">https://vantagepointtrading.com/whats-the-day-trading-success-rate-the-thorough-answer/</a></p>\n\n<p>&quot;While anyone can be successful, most people who enter the trading world don’t have the discipline and patience to practice a strategy (or set of strategies) until those strategies produce a consistent profit. While people are told they won’t be successful overnight, most new traders don’t actually believe that. They have an idea in their head that they’re smarter than everyone else and will make money quickly. Nope. You may make the “standard” 10% per year or so…but it’s pretty tough to make a living on a $30,000 account making 10% a year. We Day traders need more.</p>\n\n<p>You may have heard 90% or 95% of traders lose money, or some other seemingly high statistic. From what I’ve personally seen, this is accurate. While I traded for a day trading firm, about 10 people came in every couple months for trader training, or about 60 per year. For a five-year period that means about 300 people came to the trading firm and took (or at least started) the training program. Some traders I talked with think the actual number is higher; that is was closer to 400 people.</p>\n\n<p>Only 14 (women and men, including myself) moved on to become regular traders, producing consistent profits for at least several years. That’s about a 3.5% to 4.5% success rate. Approximately another 10 made money, but not enough to keep them trading. If success is defined as just being negligibly profitable (for at least a couple months) the success rate is about 6% to 8%. But who wants to trade to just break even?&quot;</p>\n\n<p><em>2nd article</em>\n<a href=\"https://tradeciety.com/24-statistics-why-most-traders-lose-money/\">https://tradeciety.com/24-statistics-why-most-traders-lose-money/</a></p>\n\n<p>&quot;Scientist Discovered Why Most Traders Lose Money – 24 Surprising Statistics</p>\n\n<p>“95% of all traders fail” is the most commonly used trading related statistic around the internet. But no research paper exists that proves this number right. Research even suggests that the actual figure is much, much higher. In the following article we’ll show you 24 very surprising statistics economic scientists discovered by analyzing actual broker data and the performance of traders. Some explain very well why most traders lose money.</p>\n\n<p>1 - 80% of all day traders quit within the first two years.</p>\n\n<p>2 - Among all day traders, nearly 40% day trade for only one month. Within three years, only 13% continue to day trade. After five years, only 7% remain.</p>\n\n<p>3 - Traders sell winners at a 50% higher rate than losers. 60% of sales are winners, while 40% of sales are losers.</p>\n\n<p>4 - The average individual investor under performs a market index by 1.5% per year. Active traders under perform by 6.5% annually.</p>\n\n<p>5 - Day traders with strong past performance go on to earn strong returns in the future. Though only about 1% of all day traders are able to predictably profit net of fees.</p>\n\n<p>6 - Traders with up to a 10 years negative track record continue to trade. This suggest that day traders even continue to trade when they receive a negative signal regarding their ability.</p>\n\n<p>7 - Profitable day traders make up a small proportion of all traders – 1.6% in the average year. However, these day traders are very active – accounting for 12% of all day trading activity.</p>\n\n<p>8 - Among all traders, profitable traders increase their trading more than unprofitable day traders.&quot;</p>\n\n<p>(You can read the whole thing in the link I shared)</p>\n</div><!-- SC_ON -->",
  "score": 347,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/q4aLzCoziWcOBax3f0p3JOYeR1290zlac6EZtfwAb4E.jpg?auto=webp&s=bc8db4cea1f665d461eadd1f09ec309250a58f6c",
          "width": 348,
          "height": 452
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/q4aLzCoziWcOBax3f0p3JOYeR1290zlac6EZtfwAb4E.jpg?width=108&crop=smart&auto=webp&s=f213d7ca5cd32144a393a8a5656779ee5b6f5161",
            "width": 108,
            "height": 140
          },
          {
            "url": "https://external-preview.redd.it/q4aLzCoziWcOBax3f0p3JOYeR1290zlac6EZtfwAb4E.jpg?width=216&crop=smart&auto=webp&s=f4e4f6ff135cbed0c83e4c318dc39d6f9c8bca82",
            "width": 216,
            "height": 280
          },
          {
            "url": "https://external-preview.redd.it/q4aLzCoziWcOBax3f0p3JOYeR1290zlac6EZtfwAb4E.jpg?width=320&crop=smart&auto=webp&s=df89e7167d29b19b6ddb0cae3bf7b754d53f99cf",
            "width": 320,
            "height": 415
          }
        ],
        "variants": {},
        "id": "xMINiQRmuxHgseK_Yu_nmZ-iOkAAFcbZLqjC8KgTOEg"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/lah5j0/if_youre_a_new_investor_for_the_love_of_your/",
  "subreddit": "CryptoCurrency",
  "id": "lah5j0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518530875
}