{
  "author": "paulosdub",
  "the_new_excerpt": "I know it’a funny to talk about the money printer going brrrrr but aside from\nthe fact I don’t think hyperinflation will happen anytime soon in USA due to\nUSD’s reserve currency status, which is diminishing but still accounts for over\n60% of global trade, I find it laughable seeing people at times…",
  "original_created_utc": 1617265329,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我知道谈论印钞机的事很有趣，但除了... ...\n事实上，我不认为恶性通货膨胀会很快在美国发生，由于\n美元的储备货币地位，虽然在不断降低，但仍占到了美元储备货币的一半以上。\n占全球贸易的60%，我觉得很可笑，有时候看到人们... ...",
      "title": "美国的恶性通货膨胀。看到人们（尤其是美国人）对恶性通货膨胀的前景几乎是乐此不疲，尽管事实上它将彻底摧毁美国的生活方式。比特币可能会有帮助，但在我看来，它不会阻止你的生活变得更糟。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道談論印鈔機的事很有趣，但除了... ...\n事實上，我不認爲惡性通貨膨脹會很快在美國發生，由於\n美元的儲備貨幣地位，雖然在不斷降低，但仍佔到了美元儲備貨幣的一半以上。\n佔全球貿易的60%，我覺得很可笑，有時候看到人們... ...",
      "title": "美國的惡性通貨膨脹。看到人們（尤其是美國人）對惡性通貨膨脹的前景幾乎是樂此不疲，儘管事實上它將徹底摧毀美國的生活方式。比特幣可能會有幫助，但在我看來，它不會阻止你的生活變得更糟。"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "マネープリンターが壊れたという話をするのはおかしいと思いますが、それはさておき\nアメリカではハイパーインフレはすぐには起こらないと思います。\n米ドルの基軸通貨としての地位は低下していますが、それでも世界貿易の60％以上を占めています。\n世界貿易の60％以上を占める米ドルの基軸通貨としての地位が低下していることから、アメリカではすぐにハイパーインフレが起こるとは思わないということはさておき、人々が時々...笑える。",
      "title": "アメリカのハイパーインフレ 人々（特にアメリカ人）がハイパーインフレの見通しを喜んでいるのを見るのは面白い。ハイパーインフレはアメリカの生活様式を文字通り破壊するにもかかわらずだ。ビットコインは助けにはなるかもしれませんが、あなたの人生が悪い方向に変わるのを防ぐことはできないと思います。"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "マネープリンターが壊れたという話をするのはおかしいと思いますが、それはさておき\nアメリカではハイパーインフレはすぐには起こらないと思います。\n米ドルの基軸通貨としての地位は低下していますが、それでも世界貿易の60％以上を占めています。\n世界貿易の60％以上を占める米ドルの基軸通貨としての地位が低下していることから、アメリカではすぐにハイパーインフレが起こるとは思わないということはさておき、人々が時々...笑える。",
      "title": "アメリカのハイパーインフレ 人々（特にアメリカ人）がハイパーインフレの見通しを喜んでいるのを見るのは面白い。ハイパーインフレはアメリカの生活様式を文字通り破壊するにもかかわらずだ。ビットコインは助けにはなるかもしれませんが、あなたの人生が悪い方向に変わるのを防ぐことはできないと思います。"
    }
  ],
  "title": "Hyperinflation in USA. Funny seeing people (especially Americans) almost joyous about prospect of hyperinflation, despite the fact it would literally wreck america’s way of life. Bitcoin may help, but its not going to prevent your life changing for the worse in my opinion",
  "created_utc": 1617300145,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I know it’a funny to talk about the money printer going brrrrr but aside from the fact I don’t think hyperinflation will happen anytime soon in USA due to USD’s reserve currency status, which is diminishing but still accounts for over 60% of global trade, I find it laughable seeing people at times almost willing it on. I realise none of us can influence the money printing and we can only do what we can to protect ourselves, but bitcoin alone isn’t going to solve your problems if hyperinflation were to happen. Aside from the global shock causing havoc in markets worldwide, the invariable sudden drop in military spending will create opportunities for big countries and unfriendly countries potentially being more aggressive, and then there is the fact that due to the way BTC is taxed, rapid growth due to inflation will be ravaged by taxes if you try to spend it, which you’ll have to as cash will devalue too quickly. </p>\n\n<p>I want crypto to succeed and grow, but not because major western countries suffer hyper inflation as even with crypto, we all probably lose.</p>\n</div><!-- SC_ON -->",
  "score": 255,
  "permalink": "/r/CryptoCurrency/comments/mhqry8/hyperinflation_in_usa_funny_seeing_people/",
  "subreddit": "CryptoCurrency",
  "id": "mhqry8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961873807
}