{
  "author": "deathtolucky",
  "original_created_utc": 1636427911,
  "title": "LTC is up nearly 20% in a 24 hour period. I feel like a proud father.",
  "created_utc": 1636461413,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I feel like that dad who has two kids. One is an honour roll student. Always pulls down top grades, crushes all expectations, goes above and beyond in all facets of life. These are most of the alts in my portfolio. </p>\n\n<p>Then there’s LTC. They never really lived up to their potential. Slacked off but passed all the tests. Smoked weed in the basement but didn’t really get into any serious trouble. Crashed the car once but insurance paid for it and nobody was hurt. </p>\n\n<p>Well today LTC, you’re having your day in the sun. Today you aced that exam. Scored that winning goal. Got mom the present she’s always dropped hints about but nobody ever went to the trouble of buying because she’s mom. Today, you’re the golden goose. </p>\n\n<p>Dad never gave up on you. You haven’t done shit in years but today, I’m proud to call you one of my own. Way to go LTC. I couldn’t be more proud of you.</p>\n</div><!-- SC_ON -->",
  "score": 241,
  "permalink": "/r/CryptoCurrency/comments/qpujix/ltc_is_up_nearly_20_in_a_24_hour_period_i_feel/",
  "subreddit": "CryptoCurrency",
  "id": "qpujix",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I feel like that dad who has two kids. One is an honour roll student. Always\npulls down top grades, crushes all expectations, goes above and beyond in all\nfacets of life. These are most of the alts in my portfolio.\n\nThen there’s LTC. They never really lived up to their potential. Slacked off…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、2人の子供を持つ父親のように感じています。一人は優等生。いつも\n常にトップクラスの成績を収め、期待を裏切り、人生のあらゆる場面で上を行く。\n人生のすべての面で、その上を行く。これが私のポートフォリオの中のほとんどのアルトです。\n\nそして、LTCです。彼らはその潜在能力を発揮することはありませんでした。怠けていた...。",
      "title": "LTCは24時間で20％近く上昇しています。誇らしい父親のような気分だ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我觉得自己像那个有两个孩子的爸爸。一个是荣誉学生。总是\n在生活的所有方面都超越了预期。\n生活的方方面面。这些是我投资组合中的大部分资产。\n\n然后是LTC。他们从未真正发挥过他们的潜力。松懈了...",
      "title": "LTC在24小时内上涨了近20%。我觉得自己像个自豪的父亲。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我覺得自己像那個有兩個孩子的爸爸。一個是榮譽學生。總是\n在生活的所有方面都超越了預期。\n生活的方方面面。這些是我投資組合中的大部分資產。\n\n然後是LTC。他們從未真正發揮過他們的潛力。鬆懈了...",
      "title": "LTC在24小時內上漲了近20%。我覺得自己像個自豪的父親。"
    }
  ]
}