{
  "author": "Acerpacer",
  "original_created_utc": 1658609665,
  "title": "I am a very average person living in Europe during the 1490's. When and how do I find out about the newly \"discovered\" continent of America?",
  "created_utc": 1658645315,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Do I read it on some public printed newspaper equivalent? Is it something that&amp;#39;s spread through speaking with others. Or do I continue living and die in say 1530, without ever hearing about the continent? I realize the answer would differ quite a bit country to country, so any answer regarding any country is interesting!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/AskHistorians/comments/w6dw80/i_am_a_very_average_person_living_in_europe/",
  "subreddit": "AskHistorians",
  "id": "w6dw80",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Do I read it on some public printed newspaper equivalent? Is it something that's\nspread through speaking with others. Or do I continue living and die in say\n1530, without ever hearing about the continent? I realize the answer would\ndiffer quite a bit country to country, so any answer regarding any…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "どこかの公の印刷された新聞に相当するもので読めばいいのか？それは\n他の人と話すことで広がっていくものなのか。それとも、私は生き続けて、例えば、次のように死んでいくのでしょうか。\n大陸のことを聞くことなく、1530年に死んでしまうのでしょうか？その答えは\n国によってかなり違うと思いますので、どのような回答でも結構です...",
      "title": "私は1490年代のヨーロッパに住むごく普通の人間です。新しく「発見」されたアメリカ大陸について、いつ、どのように知ればいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是在一些公开印刷的报纸上读到的吗？它是通过与他人交谈\n通过与他人交谈传播。还是我继续活着，死在比如说\n1530年，而从未听说过这个大陆？我知道答案会\n差异很大，所以关于任何一个国家的答案都是一样的。",
      "title": "我是一个非常普通的人，生活在1490年代的欧洲。我何时以及如何发现新 \"发现 \"的美洲大陆？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是在一些公開印刷的報紙上讀到的嗎？它是通過與他人交談\n通過與他人交談傳播。還是我繼續活着，死在比如說\n1530年，而從未聽說過這個大陸？我知道答案會\n差異很大，所以關於任何一個國家的答案都是一樣的。",
      "title": "我是一個非常普通的人，生活在1490年代的歐洲。我何時以及如何發現新 \"發現 \"的美洲大陸？"
    }
  ]
}