{
  "author": "galacticwyandotte",
  "original_created_utc": 1630974972,
  "title": "I fantasize every day about quitting my job and working for myself or part-time, if I Win at Crypto",
  "created_utc": 1630982009,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I work my ass off in my 9-5, which is really like a 7am-7pm these days in the pandemic. I work remote and have a decent salary, which I’m grateful for. But my company has no resiliency, I have no backup, I haven’t taken a true day off in 2 years. My boss is a dumbass. Our CEO died this summer unexpectedly at the age of 43. We are a startup and we are a fucking mess.</p>\n\n<p>The stress is always there, every day. All the people in all the departments are stressed out to the max. People are having health issues, people get fired or quit very frequently. Those who stay have to do more and more each week. We’re all burned out and pissed off.</p>\n\n<p>Every day I’m dreaming of a 10x bump in my crypto portfolio. I don’t have a lot, so I can’t quit yet. And honestly it’s the same way with every job that I’ve had. They all suck. Working for someone, any company or institution, effing blows. It doesn’t matter public or private sector. I’ve done multiple in each and it’s the same story. I just want to opt out, but I’m married, and we may have a kid some day.</p>\n\n<p>All I know is, I want flexibility in life. I want to not be trapped. I want to be free in my professional career, to try new things and do what I want. I need a safety net to do that. I’m hoping crypto can do that for me. I think we still have a ways to go in this bull run. I’m hoping by mid next year I can quit my job, and start living the life that I want to live. </p>\n\n<p>Can anyone else relate? Who’s with me?</p>\n</div><!-- SC_ON -->",
  "score": 260,
  "permalink": "/r/CryptoCurrency/comments/pjc7sq/i_fantasize_every_day_about_quitting_my_job_and/",
  "subreddit": "CryptoCurrency",
  "id": "pjc7sq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I work my ass off in my 9-5, which is really like a 7am-7pm these days in the\npandemic. I work remote and have a decent salary, which I’m grateful for. But my\ncompany has no resiliency, I have no backup, I haven’t taken a true day off in 2\nyears. My boss is a dumbass. Our CEO died this summer…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は9時から5時まで一生懸命働いていますが、最近はパンデミックの影響で7時から7時までという感じです。\nパンデミックの時代ですからね。私はリモートで仕事をしていて、きちんとした給料をもらっているので、それには感謝しています。しかし、私の\n私の会社には回復力がなく、私にはバックアップもなく、2年間一度も本当の休日を取ったことがありません。\n私の上司は馬鹿です。私の上司は間抜けです。今年の夏にはCEOが亡くなりました...。",
      "title": "仕事を辞めて自営業やアルバイトをすることを毎日のように妄想していますが、もしCryptoで勝ったら"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在朝九晚五的工作中拼命工作，这些天其实就像早上7点到晚上7点的工作。\n大流行。我从事远程工作，有一份体面的薪水，对此我很感激。但我的\n但我的公司没有弹性，我没有备份，我已经两年没有真正休息过一天了。\n年没有真正休息过。我的老板是个蠢货。我们的CEO今年夏天去世了...",
      "title": "我每天都幻想着辞掉工作，为自己工作或兼职，如果我在Crypto赢的话"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在朝九晚五的工作中拼命工作，這些天其實就像早上7點到晚上7點的工作。\n大流行。我從事遠程工作，有一份體面的薪水，對此我很感激。但我的\n但我的公司沒有彈性，我沒有備份，我已經兩年沒有真正休息過一天了。\n年沒有真正休息過。我的老闆是個蠢貨。我們的CEO今年夏天去世了...",
      "title": "我每天都幻想着辭掉工作，爲自己工作或兼職，如果我在Crypto贏的話"
    }
  ]
}