{
  "author": "chamburger",
  "original_created_utc": 1627062826,
  "title": "My wife was hit by a car and killed 5 weeks ago. What are the chances her killer will be arrested for this?",
  "created_utc": 1627072879,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This happened 5 weeks ago.  She was out by herself in the everglades on a 2 lane gravel road and had her truck stopped with her hazards on. While she was walking around her truck, a car came speeding by and hit her, throwing her body about 20-30 feet from her truck. Died instantly we&#39;re told. Here is what we do know so far... her truck was running with the lights on, it was dusk, around 8:30 at night.</p>\n\n<p>Her truck was facing east, the car was heading west. The story goes, she was walking around back to her driver door, she came out of no where and the car hit her at full speed. The speed limit out there is 20, but they suspect he was doing atleast 40. His licence was revoked 3 years ago for refusing a dui test. It was not his car, it was his parents car. He also had alcohol in his system, and since he was taken to the hospital for a headache(I believe he was just trying to avoid going to jail that night) they automatically took his blood for the toxicology, which has not come back yet after 5 weeks. As of right now he is a free man still. </p>\n\n<p>Here are my concerns. This may have been 50/50 to blame here. My wife not paying attention, and this man driving too fast without a licence and some type of narcotics in his system. Whenever we are in the glades and see a parked car, we always slow down and go around them because you never know whats behind the vehicle, a deer, my wife etc.  This tragedy was 100% avoidable on his end. This is a 33 year old man who still lives at home with his parents, no car, no licence, nothing to sue over. Is he going to prison for this? Are the family liable for letting him drive their vehicle on a revoked licence?</p>\n\n<p>To add insult to injury, this man comes from a very fucked up family. Just a few years ago his brother was shot and killed by police after trying to attack a cop with a screwdriver. His family successfully sued the county it happened at and won $550,000. Yet the idiot brother kills my wife, still free from prison, and all I am getting so far is a lousy $25k from their car insurance company, which my lawyer is getting a huge chunk already. Life fucking sucks. Can anyone enlighten me and give me some hope that maybe some justice will come out of this in the end? I know the investigation is still ongoing and I am being a little impatient but I am a widowed father of two now getting royally fucked while his family can walk free and kill and sue anyone they want and get away with it.</p>\n\n<p>Edit: If this is the wrong sub for this subject, or if anyone can recomend another sub for additional info that would be greatly appreciated.</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/oq7q5u/my_wife_was_hit_by_a_car_and_killed_5_weeks_ago/",
  "subreddit": "TooAfraidToAsk",
  "id": "oq7q5u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This happened 5 weeks ago. She was out by herself in the everglades on a 2 lane\ngravel road and had her truck stopped with her hazards on. While she was walking\naround her truck, a car came speeding by and hit her, throwing her body about\n20-30 feet from her truck. Died instantly we're told. Here is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "5週間前の出来事です。彼女はエバーグレイズの2車線の砂利道を一人で走っていました。\nトラックはハザードをつけて停車していました。彼女がトラックの周りを歩いていると\nトラックの周りを歩いていると、スピードを出した車が彼女にぶつかり、彼女の体はトラックから20～30フィートのところに投げ出されました。\n彼女の体はトラックから20～30フィートのところに投げ出されました。即死だったと聞いています。ここでは...",
      "title": "私の妻は5週間前に車に轢かれて亡くなりました。彼女を殺した犯人がこの件で逮捕される可能性はどのくらいありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这发生在5周前。她一个人在沼泽地的一条2车道上\n砾石路上，她的卡车停在那里，开着危险装置。当她在卡车周围行走时\n绕过她的卡车时，一辆汽车飞速驶过，撞上了她，将她的身体抛在离她的卡车大约20-30英尺的地方。\n离她的卡车20-30英尺。据悉，她当场死亡。这里是...",
      "title": "我的妻子5周前被车撞死。杀害她的凶手被逮捕的可能性有多大？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這發生在5周前。她一個人在沼澤地的一條2車道上\n礫石路上，她的卡車停在那裏，開着危險裝置。當她在卡車周圍行走時\n繞過她的卡車時，一輛汽車飛速駛過，撞上了她，將她的身體拋在離她的卡車大約20-30英尺的地方。\n離她的卡車20-30英尺。據悉，她當場死亡。這裏是...",
      "title": "我的妻子5周前被車撞死。殺害她的兇手被逮捕的可能性有多大？"
    }
  ]
}