{
  "author": "CyroSwitchBlade",
  "the_new_excerpt": "My mother passed away. Can anyone guess what the bank did? Did they work with us\nto help us get the estate settled? No, they took this as their last opportunity\nto rip her checking account for as many overdraft fees as they could while\nrefusing to let us get the account closed. My mother was living…",
  "original_created_utc": 1619099584,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "母が亡くなりました。銀行が何をしたかわかる人はいますか？私たちと一緒になって\n遺産整理のために協力してくれたか？いいえ、彼らはこれが最後のチャンスとばかりに\n母の当座預金から出来るだけ多くの当座貸越手数料を取るために\n私たちが口座を閉鎖するのを拒否しました。私の母は...",
      "title": "F*#^バンクス!!!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的母亲去世了。谁能猜到银行做了什么？他们是否与我们合作\n帮助我们解决遗产问题？没有，他们把这当作最后的机会\n尽可能多地从她的支票账户中扣除透支费，同时拒绝让我们关闭账户。\n拒绝让我们关闭该账户。我母亲当时住在...",
      "title": "F*#^银行！！！"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的母親去世了。誰能猜到銀行做了什麼？他們是否與我們合作\n幫助我們解決遺產問題？沒有，他們把這當作最後的機會\n儘可能多地從她的支票賬戶中扣除透支費，同時拒絕讓我們關閉賬戶。\n拒絕讓我們關閉該賬戶。我母親當時住在...",
      "title": "F*#^銀行！！！"
    }
  ],
  "title": "F*#^ Banks!!!",
  "created_utc": 1619111460,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My mother passed away. Can anyone guess what the bank did? Did they work with us to help us get the estate settled? No, they took this as their last opportunity to rip her checking account for as many overdraft fees as they could while refusing to let us get the account closed. My mother was living month to month on a very small pension and disability checks. Her checking account was set to auto pay her monthly bills (mortgage, heating oil, water, electricity, internet / cable, ect.). When the income stopped, I went right to the bank and asked them to freeze the checking account and stop the bill auto-payments. The bank manager told me that they could not because I was not the executor of the estate. My aunt was the executor so she would have to contact the bank to get that taken care of (My aunt was the only person listed on the will because my mother’s will was the one that the Navy had her make before her first deployment.. which was years before I was born.) So, my aunt called the bank right away and asked for the checking account to be frozen and we would have the bills set to come in the mail to us. The bank manager said “of course” they would take care of that right away. Two weeks later.. they didn’t do anything at all and the account was in the red with over $600 of overdraft fees. That bank manager straight up lied to us saying that the account would be closed when my aunt asked. We went to the bank again to clear up their mistake and they told us that there was no mistake, and we need to settle the account right away. F*^* BANKS! I can’t wait until all banks are forgotten rubble of the past. I hope that our Cryptocurrency community grows and grows, and our freedom lights up the blockchains dooming those corrupt institutions into obscurity. I am going all in on Crypto and I cannot wait until the day comes when I won’t have to step foot in, drive past, or even look at another bank ever again.  And I will say it one more time. F^*~  BANKS!</p>\n</div><!-- SC_ON -->",
  "score": 1412,
  "permalink": "/r/CryptoCurrency/comments/mw58bp/f_banks/",
  "subreddit": "CryptoCurrency",
  "id": "mw58bp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776207022
}