{
  "author": "ifisch",
  "original_created_utc": 1637648958,
  "title": "Everything proposed by \"the metaverse\" is worse than alternatives that already exist",
  "created_utc": 1637663452,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Let&#39;s look at Zuck&#39;s <a href=\"https://www.youtube.com/watch?v=Uvufun6xer8\">pitch video</a>, for example. In the metaverse you can...</p>\n\n<ol>\n<li><strong>Play poker with your friends</strong><br/>\nThere are already plenty of ways to do this online, right in my browser. If I really want to see my friends&#39; faces, we could setup a zoom call while we play, and I can see their <em>actual</em> faces, rather than a stiff digital avatar.</li>\n<li><strong>Look at some digital art</strong><br/>\nI can already do this in a browser. I guess if it&#39;s a 3d model, rather than a 2d image, having a VR headset helps, but how often do people sit around looking at 3d models, just for the sake of it? Unless you work with them somehow, probably not very often.</li>\n<li><strong>Bring your items from one videogame to another</strong><br/>\nSounds very cool, but if this was something that game creators wanted to do, they could have already been doing it for <em>decades</em>. It&#39;s not a technological problem, but a lack of will from the game&#39;s creators. The only thing stopping me from bringing my World of Warcraft sword into Everquest or Black Desert online is the games&#39; creators willingness to implement this feature (and it actually sounds like a <em>lot</em> of work for them to support, once you start to think about it).<br/>\nAlso, would you really <em>want</em> a bunch of people bringing their Roblox items and gear into your Lord of the Rings Online server? Have these people ever actually <em>played</em> a videogame?</li>\n<li><strong>Communicate via hand gestures instead of typing</strong><br/>\nIt&#39;s really hard to imagine how waving my arms, like a caveman, is a superior form of communication to using a keyboard.</li>\n<li><strong>Watch videos with your friends, online</strong><br/>\nPlenty of ways to already do this. I don&#39;t see how donning a VR headset would improve the experience. Again, if I felt the need to look at my friend&#39;s faces, while I watched the movie, we could just start up a group video call.</li>\n<li><strong>Go to a concert together with friends</strong><br/>\nSeems like watching the concert, streamed, would be far preferable to being in a virtual stadium, where a 3d model of the performer is far away from me, and I&#39;m surrounded by a bunch of lifeless avatars, half of whom are probably AFK.</li>\n<li><strong>Attending a concert&#39;s &quot;after party&quot; in a virtual space</strong><br/>\nAgain, this sounds far inferior to just connecting to a public video chat lobby, where you could actually see faces.But if you really want to hang out with a bunch of anon 3d avatars, go play VR Chat. I&#39;m guessing you&#39;ll nope out of there within the first 5 minutes.</li>\n<li><strong>Play VR online ping pong</strong><br/>\nYou can do this right now. There are tons of really fun multiplayer online VR games you can download from Steam right now, no metaverse required. Why aren&#39;t you playing them?</li>\n<li><strong>Attend a virtual work meeting in a virtual conference room</strong><br/>\nObviously, you can already do this now, with Zoom, Google Meet, Microsoft Teams, etc, but with the ability to see your coworker&#39;s <em>actual</em> faces.<br/>\nIf Bob from accounting <em>really</em> wants to be a cartoon lion, there are plenty of video filters that already give him that ability...hooray!</li>\n<li><strong>Learn about the solar system, for a school project</strong><br/>\nObviously there are already tons of educational materials, on the internet, right now. There&#39;s Youtube, Udemy, etc, etc, etc. Incorporating 3d models into the lessons is cool, but there&#39;s nothing stopping educators from using something like WebGL to do this in a browser window, except that it takes a lot of time and expertise to create those kinds of educational materials.</li>\n<li><strong>Do your shopping from a virtual shopping mall</strong><br/>\nThis sounds a lot less convenient than just buying stuff from a website.Also, it&#39;s not realistic to think that stores will create a to-scale 3d models for most of their products, so you&#39;ll probably just end up looking at a bunch of 2d jpegs anyway.</li>\n</ol>\n\n<p>So yea, if you think this whole metaverse thing is all hype, you&#39;re not alone.</p>\n</div><!-- SC_ON -->",
  "score": 228,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/oILQIt_kws8tiiWDc2E8OTqau3QS28UwqLNcAxk3paM.jpg?auto=webp&s=825aae8991e62a74cf2bc9b6805ece44e3de562f",
          "width": 480,
          "height": 360
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/oILQIt_kws8tiiWDc2E8OTqau3QS28UwqLNcAxk3paM.jpg?width=108&crop=smart&auto=webp&s=cb112605bee1c8a3b7af37386a6e5ced860faac0",
            "width": 108,
            "height": 81
          },
          {
            "url": "https://external-preview.redd.it/oILQIt_kws8tiiWDc2E8OTqau3QS28UwqLNcAxk3paM.jpg?width=216&crop=smart&auto=webp&s=1f3c6e82df53007f105ec9217f0ac8edc2913336",
            "width": 216,
            "height": 162
          },
          {
            "url": "https://external-preview.redd.it/oILQIt_kws8tiiWDc2E8OTqau3QS28UwqLNcAxk3paM.jpg?width=320&crop=smart&auto=webp&s=5199783a5cc56f4d8aa68c508482b78346c7b210",
            "width": 320,
            "height": 240
          }
        ],
        "variants": {},
        "id": "tl2g3t6zOjAh3ychEjKAESgmyPe85R-ICyfmdCz6J6Q"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/r06vo8/everything_proposed_by_the_metaverse_is_worse/",
  "subreddit": "CryptoCurrency",
  "id": "r06vo8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Let's look at Zuck's pitch video [https://www.youtube.com/watch?v=Uvufun6xer8],\nfor example. In the metaverse you can...\n\n 1.  Play poker with your friends\n     There are already plenty of ways to do this online, right in my browser. If\n     I really want to see my friends' faces, we could setup a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Zuckのピッチビデオ[https://www.youtube.com/watch?v=Uvufun6xer8]を見てみましょう。\nを見てみましょう。メタバースでは、あなたは...\n\n 1.  友達とポーカーをする\n     これをオンラインで、ブラウザ上で行う方法はすでにたくさんあります。もし\n     友達の顔をどうしても見たい場合は、...",
      "title": "メタバース」が提案するものはすべて、すでに存在する代替案よりも悪い。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "让我们来看看Zuck的推销视频[https://www.youtube.com/watch?v=Uvufun6xer8]。\n为例。在metaverse中，你可以...\n\n 1.  与你的朋友玩扑克牌\n     在网上已经有很多方法可以做到这一点，就在我的浏览器中。如果\n     我真的想看到我朋友的脸，我们可以设置一个...",
      "title": "由 \"元空间 \"提出的一切建议都比已经存在的替代方案更糟糕"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "讓我們來看看Zuck的推銷視頻[https://www.youtube.com/watch?v=Uvufun6xer8]。\n爲例。在metaverse中，你可以...\n\n 1.  與你的朋友玩撲克牌\n     在網上已經有很多方法可以做到這一點，就在我的瀏覽器中。如果\n     我真的想看到我朋友的臉，我們可以設置一個...",
      "title": "由 \"元空間 \"提出的一切建議都比已經存在的替代方案更糟糕"
    }
  ]
}