{
  "author": "nomorefaces",
  "the_new_excerpt": "I‘m new here and don’t know too much about the inner works of most of the coins\nand projects, that’s why I joined this sub first and foremost: to learn more\nabout why to jump on board and in which projects to invest in.\n\nI bought my first crypto in January after the GME craze and was encouraged to…",
  "original_created_utc": 1624222424,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はこのサイトの新参者で、ほとんどのコインやプロジェクトの内部構造についてはあまり知りません。\nこのサブに参加した理由は、何よりもまず、なぜ投資するのか、どのプロジェクトに\nこのサブに参加したのは、なぜ参加するのか、どのプロジェクトに投資するのかをもっと知りたいからです。\n\n私はGMEブームの後、1月に初めて暗号を購入しましたが、その時に勧められたのが...",
      "title": "私は帰らない。ただ、あなたがまだここにいると言ってください"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是新来的，对大多数钱币的内部工程不是很了解\n和项目的内部工作，这也是我加入这个子的首要原因：了解更多的\n了解为什么要加入和投资哪些项目。\n\n我在一月份的GME热潮后买了我的第一个加密货币，并被鼓励...",
      "title": "我不会离开。只要告诉我你还在这里陪我"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是新來的，對大多數錢幣的內部工程不是很瞭解\n和項目的內部工作，這也是我加入這個子的首要原因：瞭解更多的\n瞭解爲什麼要加入和投資哪些項目。\n\n我在一月份的GME熱潮後買了我的第一個加密貨幣，並被鼓勵...",
      "title": "我不會離開。只要告訴我你還在這裏陪我"
    }
  ],
  "title": "I‘m not leaving. Just tell me you‘re still here with me",
  "created_utc": 1624253973,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I‘m new here and don’t know too much about the inner works of most of the coins and projects, that’s why I joined this sub first and foremost: to learn more about why to jump on board and in which projects to invest in.</p>\n\n<p>I bought my first crypto in January after the GME craze and was encouraged to do so by a lot of friends around me.  I only put in a little bit more than I could afford to and pretty much lost all gains with Elon’s first of the recent fuds. </p>\n\n<p>The little I understand so far and the shit that is happening in the stock markets all the time really strengthens my belief that we can’t be shook off this tree. This is the chance of your generation (I‘m kinda old already). </p>\n\n<p>I staked all bags that I own and haven’t sold a <em>single</em> coin. I really admire how far crypto has come and could kick my ass for not realizing this sooner. I don’t really give a shit about karma I just want to hear you say “hell yes, we ain’t leaving” and that you got my back.</p>\n\n<p>Tl, dr: don’t be like me and don’t be unsure of your decisions, if you believe in something - keep goin at it.</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/CryptoCurrency/comments/o4etsy/im_not_leaving_just_tell_me_youre_still_here_with/",
  "subreddit": "CryptoCurrency",
  "id": "o4etsy",
  "is_self": true,
  "media": null,
  "is_video": false
}