{
  "author": "milonuttigrain",
  "original_created_utc": 1632010091,
  "title": "No, your shitcoins are not likely to survive the next bear market. 72 out of top 100 coin in Dec-2017 are now out of top 100. DYOR and don't HODL blindly into hopeless projects. But there are a few gems, hard to find, but good to buy.",
  "created_utc": 1632033494,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I just review a historical snapshot on 17/12/2017 - this is the day when BTC reached the top of the last bull run at over $19,000. </p>\n\n<p>A staggering 72% of top 100 coins back then are now out of top 100. Of course looking at ranking is a relative perspective. However, even if you take market cap into account, the vast majority of these coins do not actually gain anything significant. Little upgrades, lack of funding, little innovation to keep it up with the current market needs - sending these coins into oblivion. </p>\n\n<p><strong>Top 100 back then, not now - the forgotten</strong></p>\n\n<p>18 Bitconnectttttttttttt</p>\n\n<p>19 PPT (Rank 392 now, market cap dropped from $1.75B to just $99M today)</p>\n\n<p>21 LSK (Rank 138 now, market cap dropped from $1.56B to just $480M today)</p>\n\n<p>25 STRAT (Rank 164 now, market cap dropped from $1.11B to $349M today)</p>\n\n<p>26 BTS; 27 ARDR; 28 HC; 29 BCN; 30 NXT; 31 MONA; 32 XVG; 34 ARK; 35 SNT; 37 STEEM; 38 VERI; 39 DCR; 40 EMC2; 41 SC; 42 SALT; 43 KMD; 44 REP; 45 PIVX; 46 GNT; 47 PAY; 48 GBYTE; 49 ETN; 51 VTC; 52 QASH; 54 FCT; 55 DGD; 57 KNC; 58 MAID; 59 GAS; 60 AE; 61 INK; 63 BTM; 64 POWR; 65 SYS; 66 SAN; 67 WTC; 69 BTCD; 70 ICN; 71 ZRX; 72 CNX; 73 XZC; 74 RDN; 75 GNO; 76 BTX; 77 GXC; 78 NEXUS; 79 FUN; 80 PPP; 81 DATA; 82 MCO; 83 REQ; 84 GAME; 85 DRGN; 86 DENT; 87 MTL; 88 NAV; 89 CVC; 90 ETP; 92 PURA; 93 PPC; 94 SUB; 95 EDG; 96 STORJ; 97 BLOCK; 98 REVAIN; 99 BAY; 100 COB.</p>\n\n<p><strong>The honorary mentioned</strong></p>\n\n<p>53 DGB* (now 108th). Market cap did grow from $341M to $832M now.</p>\n\n<p>62 NANO* (rank 110th now). Market cap did grow from $278M to $745M today)</p>\n\n<p><strong>The survivors - Top 100 then, still top 100 now, but not much talked about these days</strong></p>\n\n<p>9 NEM (now 70th); 11 BTG (now 90th); 17 QTUM (now 86th); 20 OMG (now 87th); 22 ZEC (now 67th); 23 WAVES (now 50th); 39 DCR (now 64th); 56 BAT (now 92nd); 68 MANA (now 75th)</p>\n\n<p><strong>The outliers</strong></p>\n\n<p>24 USDT (now 5th)</p>\n\n<p>33 DOGE (now 9th)</p>\n\n<p><strong>The gems</strong></p>\n\n<p>36 BNB (now 4th) - back then $5.76 for a BNB, now $409!</p>\n\n<p>50 VET (now 28th) - back then VEN, now VET. Market cap grows from $346M to $7.2B today!</p>\n\n<p>91 LINK (now 15th) - back then $0.42 for a token, today price is $28.36</p>\n</div><!-- SC_ON -->",
  "score": 160,
  "permalink": "/r/CryptoCurrency/comments/pqxijf/no_your_shitcoins_are_not_likely_to_survive_the/",
  "subreddit": "CryptoCurrency",
  "id": "pqxijf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I just review a historical snapshot on 17/12/2017 - this is the day when BTC\nreached the top of the last bull run at over $19,000.\n\nA staggering 72% of top 100 coins back then are now out of top 100. Of course\nlooking at ranking is a relative perspective. However, even if you take market\ncap into…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はちょうど2017年12月17日の歴史的なスナップショットを確認しています - これはBTCが\nが19,000ドル以上で最後のブルランの頂点に達した日です。\n\n当時のトップ100コインの72％という驚異的な数字が、今ではトップ100から外れています。もちろん\nもちろん、ランキングを見るのは相対的な視点です。しかし、市場規模を考慮しても\n時価総額を考慮しても...",
      "title": "いいえ、あなたが持っているシットコインは、次のベアマーケットでは生き残れないでしょう。2017年12月のトップ100コインのうち72個が今はトップ100から外れている。DYORして、絶望的なプロジェクトに盲目的にHODLしないでください。しかし、いくつかの宝石があり、見つけるのは難しいが、買うのは良い。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我只是回顾了2017年12月17日的历史快照--这一天，BTC\n达到了上一轮牛市的顶部，超过了19000美元。\n\n当年排名前100的币中，有72%的币现在已经退出了前100名，令人吃惊。当然\n看排名是一个相对的角度。然而，即使你把市场\n币值纳入...",
      "title": "不，你的狗屎币不可能在下一个熊市中生存。2017年12月排名前100的币中有72个现在已经退出了前100。躲避吧，不要盲目囤积无望的项目。但也有一些宝石，很难找到，但很好买。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我只是回顧了2017年12月17日的歷史快照--這一天，BTC\n達到了上一輪牛市的頂部，超過了19000美元。\n\n當年排名前100的幣中，有72%的幣現在已經退出了前100名，令人喫驚。當然\n看排名是一個相對的角度。然而，即使你把市場\n幣值納入...",
      "title": "不，你的狗屎幣不可能在下一個熊市中生存。2017年12月排名前100的幣中有72個現在已經退出了前100。躲避吧，不要盲目囤積無望的項目。但也有一些寶石，很難找到，但很好買。"
    }
  ]
}