{
  "author": "Far-Pie-4360",
  "original_created_utc": 1635778223,
  "title": "Let us take a moment in time to appreciate what a fantastic year Eth has had, this time last year ETH was $383!!!",
  "created_utc": 1635791749,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Let us just take a moment in time and appreciate what a fantastic year Eth has had. It is easy to lose sight, especially with all of the crazy shitcoins that are pumping and dumping lately and the Scams such as Squidcoin that is  taking up most of the headlines, but let us not forget that this time last year Eth was $383.68!!! And now 1 year on we sit at over $4300!! Let that sink in all you so called Eth killers!</p>\n\n<p>Eth has been on an absolute rocket ship for most of this year and with Eth2.0 just around the corner 2022 could be even bigger! This just goes to show investing in legitimate projects long term is almost always the best way to go. </p>\n\n<p>Eth killers be warned ⚠️  the old girl is not stopping anytime soon!</p>\n</div><!-- SC_ON -->",
  "score": 212,
  "permalink": "/r/CryptoCurrency/comments/qkfmqe/let_us_take_a_moment_in_time_to_appreciate_what_a/",
  "subreddit": "CryptoCurrency",
  "id": "qkfmqe",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Let us just take a moment in time and appreciate what a fantastic year Eth has\nhad. It is easy to lose sight, especially with all of the crazy shitcoins that\nare pumping and dumping lately and the Scams such as Squidcoin that is taking up\nmost of the headlines, but let us not forget that this time…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "イーサンの素晴らしい1年を振り返ってみましょう。\nの素晴らしい1年に感謝しましょう。特に、最近のクレイジーなクソコインや、Squidcoinのようなスキャムが注目されている中では、見失いがちです。\n特に、最近のクレイジーなシットコインや、Squidcoinのようなスキャムには目を見張るものがあります。\nしかし、忘れてはいけないのは、この時期に...",
      "title": "去年の今頃、ETHは383ドルだったんですよ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "让我们静下心来，欣赏一下Eth在这一年里所取得的辉煌成就。\n了。我们很容易忽视这一点，尤其是在最近所有的疯狂的狗屎币和诸如Squidcoin这样的骗局中。\n尤其是最近所有的疯狂的狗屎币，以及诸如Squidcoin这样的骗局，占据了大部分的头条。\n但让我们不要忘记，这次...",
      "title": "让我们花点时间来欣赏一下Eth这一年来的精彩表现，去年这个时候ETH是383美元！！。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "讓我們靜下心來，欣賞一下Eth在這一年裏所取得的輝煌成就。\n了。我們很容易忽視這一點，尤其是在最近所有的瘋狂的狗屎幣和諸如Squidcoin這樣的騙局中。\n尤其是最近所有的瘋狂的狗屎幣，以及諸如Squidcoin這樣的騙局，佔據了大部分的頭條。\n但讓我們不要忘記，這次...",
      "title": "讓我們花點時間來欣賞一下Eth這一年來的精彩表現，去年這個時候ETH是383美元！！。"
    }
  ]
}