{
  "author": "Elrondarius",
  "original_created_utc": 1653511020,
  "title": "If I wrote here one month ago that 1DOGE is more valuable than Terra, then 99% of you will laugh at me.",
  "created_utc": 1653541042,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Title. If I wrote here one month ago that 1DOGE is more valuable than Terra, then 99% of you will laugh at me. &lt;/p&gt;\n\n&lt;p&gt;Likewise, if this happened to Dogecoin, I also think that many of you would not have such sympathy for the loss of money of the people who invested and lost everything. I can totally imagine comments like: Nothing else to expect, pump &amp;amp; dump, shitcoin, elon manipulates etc ... Don&amp;#39;t think I&amp;#39;m some crypto-meme boy. I can judge which project has the technology and perspective for the future and which is shitcoin. But again, DOGECOIN has proven to be the currency of the people, and although it has essentially no use, it is an ideal cryptocurrency, for example, for low-fee payments. So yes, I&amp;#39;m a fan but of course I&amp;#39;m mainly going BTC &amp;amp; ETH. And now the main task and I will return to the beginning of this post. &lt;/p&gt;\n\n&lt;p&gt;Terra - Technology, serious company, future, popularity with crypto investors, interesting price increase for the last year and ...  during last 3 days death.&lt;/p&gt;\n\n&lt;p&gt;Dogecoin - Basically nothing, elon musk, unpopular with most underground crypto investors and ... in biggest 2022 crash still at rank 10.&lt;/p&gt;\n\n&lt;p&gt;It is funny or sad? What do you think? &lt;/p&gt;\n\n&lt;p&gt;(Also sorry for my english, it is not my primary language )&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 304,
  "permalink": "/r/CryptoCurrency/comments/uxqhvj/if_i_wrote_here_one_month_ago_that_1doge_is_more/",
  "subreddit": "CryptoCurrency",
  "id": "uxqhvj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Title. If I wrote here one month ago that 1DOGE is more valuable than Terra,\nthen 99% of you will laugh at me.\n\nLikewise, if this happened to Dogecoin, I also think that many of you would not\nhave such sympathy for the loss of money of the people who invested and lost\neverything. I can totally…"
}