{
  "author": "question-mark-clark",
  "original_created_utc": 1647009432,
  "title": "Should I confront my child's teacher?",
  "created_utc": 1647019818,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My child has dyslexia and was having trouble reading one word, it doesn&amp;#39;t happen often because she tries but unfortunately got stuck for too long. She told me that she got really embarrassed and upset because the teacher didn&amp;#39;t help and instead said &amp;quot;Learn how to read&amp;quot;, very loudly. I find it very unsettling and disrespectful but i also don&amp;#39;t want to cause unneeded waves because we just moved here.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 124,
  "permalink": "/r/NoStupidQuestions/comments/tbrhkn/should_i_confront_my_childs_teacher/",
  "subreddit": "NoStupidQuestions",
  "id": "tbrhkn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "My child has dyslexia and was having trouble reading one word, it doesn't happen\noften because she tries but unfortunately got stuck for too long. She told me\nthat she got really embarrassed and upset because the teacher didn't help and\ninstead said \"Learn how to read\", very loudly. I find it very…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の子供はディスレクシアで、一つの単語を読むのに苦労していました。\n彼女は努力はしているのですが、残念なことに、あまりに長い間、行き詰ってしまいました。彼女は私にこう言いました。\n先生が助けてくれなかったので、とても恥ずかしく、動揺してしまったそうです。\n読み方を勉強しなさい」と大声で言われました。私はそれがとても...",
      "title": "担任の先生と対立したほうがいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的孩子有阅读障碍，在阅读一个单词时遇到了困难，这种情况并不常见，因为她很努力，但不幸的是，她被卡住了太久。\n因为她很努力，但不幸的是，她被卡住的时间太长了。她告诉我\n她告诉我，她非常尴尬和不安，因为老师没有帮助她，而是说 \"学习如何阅读\"。\n而是非常大声地说 \"学会如何阅读\"。我觉得这很...",
      "title": "我是否应该与我孩子的老师对质？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的孩子有閱讀障礙，在閱讀一個單詞時遇到了困難，這種情況並不常見，因爲她很努力，但不幸的是，她被卡住了太久。\n因爲她很努力，但不幸的是，她被卡住的時間太長了。她告訴我\n她告訴我，她非常尷尬和不安，因爲老師沒有幫助她，而是說 \"學習如何閱讀\"。\n而是非常大聲地說 \"學會如何閱讀\"。我覺得這很...",
      "title": "我是否應該與我孩子的老師對質？"
    }
  ]
}