{
  "author": "gorays21",
  "the_new_excerpt": "Tesla cars have been banned from Chinese military complexes and housing\ncompounds because of concerns about sensitive data being collected by cameras\nbuilt into the vehicles.\n\nThe order, issued by the military, advises Tesla owners to park their cars\noutside of military property, according to people…",
  "original_created_utc": 1616154811,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "特斯拉汽车已被禁止进入中国的军事建筑群和住房。\n敏感数据被摄像头收集的担忧，因此在大院中\n内置在车辆中。\n\n军方发布的命令，建议特斯拉车主将车停在\n在军事财产之外，据人们...",
      "title": "特斯拉汽车被中国军方禁售，原因是担心摄像头的问题。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "特斯拉汽車已被禁止進入中國的軍事建築羣和住房。\n敏感數據被攝像頭收集的擔憂，因此在大院中\n內置在車輛中。\n\n軍方發佈的命令，建議特斯拉車主將車停在\n在軍事財產之外，據人們...",
      "title": "特斯拉汽車被中國軍方禁售，原因是擔心攝像頭的問題。"
    }
  ],
  "title": "Tesla Cars Banned by China’s Military on Concerns About Cameras",
  "created_utc": 1616162346,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Tesla cars have been banned from Chinese military complexes and housing compounds because of concerns about sensitive data being collected by cameras built into the vehicles.</p>\n\n<p>The order, issued by the military, advises Tesla owners to park their cars outside of military property, according to people familiar with the directive who asked not to be identified because the information is private. The ban, relayed to residents of military housing this week, was triggered by concerns that the world’s biggest maker of electric vehicles is collecting sensitive data via the cars’ in-built cameras in a way the Chinese government can’t see or control, one of the people said.</p>\n\n<p><a href=\"https://www.bloomberg.com/news/articles/2021-03-19/tesla-cars-banned-by-china-s-military-on-concerns-about-cameras\">https://www.bloomberg.com/news/articles/2021-03-19/tesla-cars-banned-by-china-s-military-on-concerns-about-cameras</a></p>\n</div><!-- SC_ON -->",
  "score": 590,
  "permalink": "/r/stocks/comments/m8fk2y/tesla_cars_banned_by_chinas_military_on_concerns/",
  "subreddit": "stocks",
  "id": "m8fk2y",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752820809
}