{
  "author": "Responsible-Plan",
  "the_new_excerpt": "Source: VW is said to weigh listing of Porsche sports-car division\n[https://finance.yahoo.com/news/volkswagen-said-weigh-listing-porsche-133826243.html]\n\n\"Volkswagen AG is considering a separate listing of its Porsche sports-car unit\nin a deal that could boost its valuation and bring in a…",
  "original_created_utc": 1613729947,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "来源 据说大众将考虑将保时捷跑车部门上市\n[https://finance.yahoo.com/news/volkswagen-said-weigh-listing-porsche-133826243.html]\n\n\"大众汽车公司正在考虑将旗下的保时捷跑车部门单独上市。\n的交易，这可能会提高其估值，并带来...",
      "title": "据悉，大众汽车将考虑将保时捷跑车部门上市。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "來源 據說大衆將考慮將保時捷跑車部門上市\n[https://finance.yahoo.com/news/volkswagen-said-weigh-listing-porsche-133826243.html]\n\n\"大衆汽車公司正在考慮將旗下的保時捷跑車部門單獨上市。\n的交易，這可能會提高其估值，並帶來...",
      "title": "據悉，大衆汽車將考慮將保時捷跑車部門上市。"
    }
  ],
  "title": "Volkswagen is said to weigh listing of Porsche sports-car division",
  "created_utc": 1613757248,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Source: <a href=\"https://finance.yahoo.com/news/volkswagen-said-weigh-listing-porsche-133826243.html\">VW is said to weigh listing of Porsche sports-car division</a></p>\n\n<p>&quot;Volkswagen AG is considering a separate listing of its Porsche sports-car unit in a deal that could boost its valuation and bring in a significant amount of cash, according to people familiar with the matter.</p>\n\n<p>The world’s second-largest carmaker is speaking with advisers to study the merits of a potential initial public offering or spinoff of Porsche, the people said, asking not to be identified discussing confidential information. VW could use any proceeds from a listing for acquisitions or technology investments, according to the people.</p>\n\n<p>Chief Executive Officer Herbert Diess sounded the alarm in an interview with Bloomberg News last month about how Tesla Inc. and other electric-vehicle companies are cashing in on market optimism about their growth prospects. Investors have taken a dimmer view of VW and other incumbents, who will need to spend tens of billions to develop EVs while restructuring operations that revolve around combustion engines.</p>\n\n<p>VW’s preferred shares rose as much as 6% in Frankfurt trading. At about $757 billion, Tesla’s market value is roughly seven times higher than VW’s 90 billion euros ($109 billion).</p>\n\n<p>“A Volkswagen IPO of its Porsche brand would be a bold solution to generating much-needed shareholder value,” Michael Dean, a Bloomberg Intelligence analyst, said in a note. Porsche’s plan to be almost all-electric by 2030, with the exception of the 911 model, could “attract Tesla-like multiples while generating a Ferrari-like Ebitda margin.” &quot;</p>\n</div><!-- SC_ON -->",
  "score": 75,
  "permalink": "/r/investing/comments/lncld1/volkswagen_is_said_to_weigh_listing_of_porsche/",
  "subreddit": "investing",
  "id": "lncld1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332881980
}