{
  "author": "FFpain",
  "original_created_utc": 1641527813,
  "title": "I love Crypto but it is too complicated",
  "created_utc": 1641545093,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I was fiddling with my hardware wallet today trying to move all my CRO off the exchange. I noticed a high fee for the move so I had to do some research on how not to pay so much in gas.&lt;/p&gt;\n\n&lt;p&gt;While getting slightly frustrated at the lack of simplicity i realized that the average joe is in no way going to put up with the learning curve to do simple things like transfer money.&lt;/p&gt;\n\n&lt;p&gt;There’s this 45 year old man I work with that has invested in crypto and I told him he should move his crypto off the exchange and into a software wallet. He was taken aback when setting it up and understanding crypto addresses and his private key and asked me to help him through it. I did and he grasped it well enough. But it was by no means as “simple” as a debit card.&lt;/p&gt;\n\n&lt;p&gt;Without going into a million of other examples into how complicated crypto can be, to put it simply, crypto needs to adopt a more streamlined ease-of-use interface or it will never go mainstream.&lt;/p&gt;\n\n&lt;p&gt;I love crypto, but it is too convoluted for its own good.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 482,
  "permalink": "/r/CryptoCurrency/comments/rxxz8y/i_love_crypto_but_it_is_too_complicated/",
  "subreddit": "CryptoCurrency",
  "id": "rxxz8y",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I was fiddling with my hardware wallet today trying to move all my CRO off the\nexchange. I noticed a high fee for the move so I had to do some research on how\nnot to pay so much in gas.\n\nWhile getting slightly frustrated at the lack of simplicity i realized that the\naverage joe is in no way going…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日、自分のハードウェアウォレットをいじって、自分のCROを全部移動させようとしていたのですが\n取引所 移動にかかる手数料が高いことに気づき、どうすればいいのか調べてみたところ\nガス代がかからないように。\n\nシンプルでないことに少し不満を感じつつ、私は次のことに気づきました。\n一般市民は、どう考えても...",
      "title": "Cryptoは好きだが、複雑すぎる。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我今天在摆弄我的硬件钱包，试图将我所有的CRO移出\n交易所。我注意到移动的费用很高，所以我不得不做一些研究，看看如何\n如何不付那么多的汽油费。\n\n当我对这种不简单的做法略感沮丧的时候，我意识到\n普通人是不可能...",
      "title": "我喜欢加密货币，但它太复杂了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我今天在擺弄我的硬件錢包，試圖將我所有的CRO移出\n交易所。我注意到移動的費用很高，所以我不得不做一些研究，看看如何\n如何不付那麼多的汽油費。\n\n當我對這種不簡單的做法略感沮喪的時候，我意識到\n普通人是不可能...",
      "title": "我喜歡加密貨幣，但它太複雜了"
    }
  ]
}