{
  "author": "BuddhaChrist_ideas",
  "original_created_utc": 1640671796,
  "title": "Traded some leftover LTC for ALGO and tried out their ecosystem today.",
  "created_utc": 1640701999,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I bought a few LTC back when it was around $75US - by a few, I mean 3. It&amp;#39;s worth more now than it was then, but I&amp;#39;ve been meaning to convert it to another crypto for a while - one with growth potential and newer technologies, and finally bit the bullet today. &lt;/p&gt;\n\n&lt;p&gt;After converting, I transferred everything to the Algorand wallet - for something like $0.02, and a few seconds to confirm. This was fast, and smooth.&lt;/p&gt;\n\n&lt;p&gt;I then went to check out Yieldy Finance, because I heard they were linked. Connected my wallet, in a few seconds, and could begin Staking my ALGO for various things. I staked in one of the Algo lottery pools, which gives you a return on your stake with a chance at winning mega Algos. Sounded fun, why not? The stake was higher than with the Algo wallet anyway. But, some of the LP staking there required YLDY tokens, which I didn&amp;#39;t own. &lt;/p&gt;\n\n&lt;p&gt;From there I launched the Tinyman app, and connected my Algorand wallet in the same way (wallet connect), which took another few seconds. And swapped ALGO to YLDY. Then went back over to YLDY and staked to see how it worked. &lt;/p&gt;\n\n&lt;p&gt;Having Wallet Connect to swap all of these in and out without actually copy pasting any hash addresses was a beautiful thing - intuitive to a T. The speed at which everything happened was also amazing. Plus, those sweet, sweet minimal fees. I think about .001 Algo per transfer.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m really hoping this type of architecture moves ahead to become more widely adopted. It was my first time doing most of these things - swapping, staking, LP mining. I learned a lot today, and know I&amp;#39;m just starting to scratch the surface within these functions and uses for crypto.&lt;/p&gt;\n\n&lt;p&gt;Just wanted to share my opinions!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 171,
  "permalink": "/r/CryptoCurrency/comments/rq8n1a/traded_some_leftover_ltc_for_algo_and_tried_out/",
  "subreddit": "CryptoCurrency",
  "id": "rq8n1a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So I bought a few LTC back when it was around $75US - by a few, I mean 3. It's\nworth more now than it was then, but I've been meaning to convert it to another\ncrypto for a while - one with growth potential and newer technologies, and\nfinally bit the bullet today.\n\nAfter converting, I transferred…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "それで、LTCが75ドルくらいだったころに少し買ったんだ。\n今はその時よりももっと価値がありますが、別のものに変えようと思っていました。\nしばらく前から、成長が期待され、より新しい技術を持つ暗号を使用していました。\n今日、ついに実行に移した。\n\n変換後、転送したのは...",
      "title": "余ったLTCをALGOと交換し、今日そのエコシステムを試しました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我在LTC大约75美元的时候买了一些LTC--我说的一些是指3个。\n现在比当时更值钱，但我一直想把它转换成另一种\n另一种加密货币--一种具有增长潜力和较新技术的加密货币，今天终于咬了咬牙。\n今天终于咬了咬牙。\n\n转换后，我转...",
      "title": "用一些剩余的LTC换取ALGO，并在今天试用了他们的生态系统。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我在LTC大約75美元的時候買了一些LTC--我說的一些是指3個。\n現在比當時更值錢，但我一直想把它轉換成另一種\n另一種加密貨幣--一種具有增長潛力和較新技術的加密貨幣，今天終於咬了咬牙。\n今天終於咬了咬牙。\n\n轉換後，我轉...",
      "title": "用一些剩餘的LTC換取ALGO，並在今天試用了他們的生態系統。"
    }
  ]
}