{
  "author": "Psychology_Club",
  "the_new_excerpt": "TL; DR: I invested with loan money, gained a lot, lost a lot, scammed, crashed,\ngot even, profited again. Therefore, prepared a \"Do and Do Not List\" for you.\nEnjoy the ride.\n\n\n\nFirst, I want to give a background, a context to the whole list. So, here's a\nlong background.\n\nBACKGROUND\n\nI started to…",
  "original_created_utc": 1618934863,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "TL; DR: 融資を受けたお金で投資し、たくさんの利益を得て、たくさんの損失を出し、詐欺に遭い、クラッシュしました。\n儲けて、また儲けて。そのため、あなたのために「やることリスト」と「やらないことリスト」を用意しました。\n楽しんでください。\n\n\n\nまず、このリスト全体の背景や文脈を説明したいと思います。では、ここに長い背景があります。\n長い背景です。\n\n背景\n\n私が始めたのは...",
      "title": "これまでの経験から、\"DO AND DO NOT \"リストを作成してみました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "TL; DR：我用贷款的钱投资，获得了很多，失去了很多，被骗了，崩溃了。\n扯平，再次获利。因此，为你准备了一份 \"做与不做的清单\"。\n请享受这段旅程。\n\n\n\n首先，我想给整个清单提供一个背景，一个背景。因此，这里有一个\n长的背景。\n\n背景\n\n我开始...",
      "title": "根据我到目前为止的经验，\"做和不做 \"的清单。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "TL; DR：我用貸款的錢投資，獲得了很多，失去了很多，被騙了，崩潰了。\n扯平，再次獲利。因此，爲你準備了一份 \"做與不做的清單\"。\n請享受這段旅程。\n\n\n\n首先，我想給整個清單提供一個背景，一個背景。因此，這裏有一個\n長的背景。\n\n背景\n\n我開始...",
      "title": "根據我到目前爲止的經驗，\"做和不做 \"的清單。"
    }
  ],
  "title": "\"DO and DO NOT\" List according to my experience so far.",
  "created_utc": 1618961430,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>TL; DR: I invested with loan money, gained a lot, lost a lot, scammed, crashed, got even, profited again. Therefore, prepared a &quot;Do and Do Not List&quot; for you. Enjoy the ride.</p>\n\n<p>&#x200B;</p>\n\n<p>First, I want to give a background, a context to the whole list. So, here&#39;s a long background.</p>\n\n<p><strong>BACKGROUND</strong></p>\n\n<p>I started to learn about the tech right after 2017 ATH (Because in 2012 I read the Bitcoin whitepaper &amp; comments about it and thought &quot;Nah, it&#39;s not gonna change the world; it could but it won&#39;t&quot; and lost interest as time passes. The last time I heard about BTC price, it was about $200 and in 2017 I heard it again as $20k. I was shocked and immediately started to read again). At first, I only read. Read a lot. Everyday I woke up thinking &quot;I was so dumb yesterday.&quot; Then started to engage in &quot;Crypto Twitter&quot; because I knew nothing about trading at the time; even order types or order book were new to me. Unfortunately, people were in euphoria - they were simply buying shitcoins randomly; even I was able to notice the irrational madness - and didn&#39;t learn much about trading at the time so I thought &quot;Okay, let me start with a couple bucks first, it&#39;s a decent price for an education about trading&quot; and decided to learn from the experience. Started with a local exchange and bought $100 of ETH. Notice that this action was performed in hope of &quot;an expensive lesson.&quot; I thought &quot;$100 isn&#39;t that much to learn one or two lessons about trading.&quot; Unfortunately, gained ~%50 at first few trades. Moved another $200 into crypto &quot;so I can test it better with bigger numbers.&quot; Unfortunately, gained another ~%40 of my whole portfolio in a few trades. I was impressed by the gains and the amount of time &amp; effort I spent for such gains. By the time, I was able to learn a few things and felt a bit confident so decided to throw another $2k into crypto. Unfortunately, by day-trading, my whole portfolio was doubled under 2 weeks. </p>\n\n<p>I hope you&#39;re able to see why these are <em>unfortunate</em> events even tho I profit <em>so much.</em> IMO, success after success is one of the worst things to happen to a newcomer. I felt <em>sMaRt</em> and thought &quot;Aight, I&#39;m able to get things done.&quot; </p>\n\n<p>I knew that you shouldn&#39;t invest with loan money long before that time but I just thought &quot;with these gains, I&#39;m able to cover the loan in a few weeks.&quot; So, I soothed myself with phrases like &quot;If you wanna get your financial freedom you have to take risks. Here lies the opportunity. You are single and able to take the risk.&quot; Got a loan from the bank, worth 6 months of my monthly salary and put it into crypto. Gained a few, lost a bit more and - then again - gained some more. At the time, figured that if I use much more money, I can cover the loan even quickier and have more decent profit (oh, greed). Since I&#39;m being a <em>succesful trader and a genius,</em> immediately gave the idea a go and had a chat with my mother about how I gained so much in a short time. Since she always trusted me, she lend me 1 year worth of my monthly salary. I was dreaming about surprising her with a new car which she needed for the past 2 years (sorry mom). I started to trade and did a few mistakes, lost a bit but learnt my lessons and gained more. Shortly after, I got lost in trading because I was making decent profit. Before work, after work, sometimes during work and whole night I was trading with little percentage profits. I was happily giving my whole time because in my understanding of the concept of money, money = time. I was creating time for future me. And already had a trading plan before getting loans: Double the principal money, cash out the principal money and go on trading with the profit without the unnecessary risks. <em>Flawless plan.</em> </p>\n\n<p>Of course I didn&#39;t stick to the plan. After the principal money doubled, brilliant me just thought &quot;Hey, you are making money and came all the way. Why stop there and start all over again, just go along. Your goal is closer than ever.&quot; By the time, I was getting better and better at trading. Of course I made some mistakes but those never hurt too much because I learnt to manage the risk, learnt the principals of technical analysis and always covered the lost. Set daily percentage goals and stopped after hitting the goals. Eventually, I decided it was wise to go all in. </p>\n\n<p>&#x200B;</p>\n\n<p>My portfolio became bigger and bigger; had ~11x of my original portfolio. I lost my original goal and started to dreaming about retiring in my twenties. And, with some courage I dived all in altcoins. At that time, I knew that there is gonna be a huge drop in BTC price but - of course - I would be able to manage the crisis. Because I just needed another 2x of my whole portfolio and I could gain it on those shitcoins. At the time, there was just one day that I wasn&#39;t available to check the prices but I trusted my analysis and didn&#39;t even had a stop. That day, BTC dipped to 6k and my whole portfolio dropped ~%50. It was still ~5x of my principal money but I couldn&#39;t accept the loss and all my precious lessons are forgotten. I stopped trading (with fear of a huge rise in my shitcoins) and repeated to myself &quot;If I don&#39;t sell, I won&#39;t lose money.&quot; My shitcoins contiuned to drop and eventually I was back at my principal money. That was the first time I faced the truth about me; I was greedy. At this point, I just told myself &quot;Okay, now you must wait for the next bull run. Be patient and faithful.&quot; Right after two weeks of that decision I got scammed with a phishing attack. I mean, PHISHING ATTACK! I felt miserable, dumb and despairing. I was at %50 of my principal money and was too afraid to take action. In time, it dropped to %10 of my principal money because shitcoins never stopped to drop. While these happening, I met love of  my life who is now my wife and got married. I was already decided to never spend the money in crypto but it was really hard to explain &quot;why we are not spending that money while we need it.&quot; Also it was hard to explain it to my mother or telling her &quot;be patient.&quot; Both my mother and my wife were extremely understanding with me yet the whole process was hard to take. They never understood the concept of crypto; it was only their respect and support towards me.</p>\n\n<p>Finally, the last bull season started and I saw some gains. After reaching my principal, told my wife and mother that &quot;we are OK.&quot; Then things went well while I&#39;m still not trading and still had decent profit. Nowadays, I&#39;m aware of my greedy side and I build my plans while considering it. Always sticking to the plan.  Cashed out after reaching the goal. Gonna start to trading at some point in future again.</p>\n\n<p>&#x200B;</p>\n\n<p><strong><em>DO&#39;s:</em></strong></p>\n\n<ul>\n<li>Always set your final goal before the trading. Once you reach the goal, don&#39;t hesitate or change your mind. Stick to the plan. Always.</li>\n<li>Always use &quot;stop-loss.&quot; It doesn&#39;t have to be automated, you can do it manually. A &quot;Stop-Loss&quot; means &quot;If the price drops/rises to &quot;that&quot; point, my technical analysis was wrong and I need to make a new plan.&quot; Use stop-loss or else.</li>\n<li>Have a trait for yourself with your profit to understand the power of those magic green numbers. It will help you to lower your greed.</li>\n<li>Always plan your trade before actually doing it; have your targets and stops. It will be hard (and most possibly inaccurate) planning after starting the trade. </li>\n<li>Always have a solid fundamental analysis. You need to know and understand what you are buying. </li>\n<li>Try to involve in new mechanics of the ecosystem. Real profit is lying there. Just be careful and do your fundamental analysis beforehand.</li>\n<li>Having steps to your final goal helps; regular cash outs can help you to maintain your principal money. </li>\n<li>Start with small money. You will lose small and learn big.</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p><strong><em>DO NOT&#39;s</em></strong></p>\n\n<ul>\n<li>Ever, never, ever trade while drunk or stoned. You will definitely make huge mistakes at some point (lost %20 once, because of a simple mistake - missclick). </li>\n<li>Don&#39;t trust yourself too much, especially if you are a newcomer. We are in a bull run and everything goes up. You are not <em>that</em> smart. It&#39;s the trend. </li>\n<li>Don&#39;t trade against the trend. </li>\n<li>Never invest with a loan money. Its logic is in contradiction with the idea of investment. </li>\n<li>Never put more money than you can afford to lose. Before putting in money, assume &quot;it&#39;s gone.&quot;</li>\n<li>Don&#39;t even consider margin trading before getting real professional. Even professionals get easily liquidated with margin. And this is crypto market. You don&#39;t even have a chance to get lucky multiple times. </li>\n<li>Don&#39;t trade an asset if you don&#39;t understand or know the fundamentals of it. It will lead you to fail. </li>\n<li>Don&#39;t presume about prices as &quot;that&#39;s the dip, it can&#39;t go lower.&quot; There is no dip. It can always go lower.</li>\n<li>Don&#39;t get in FOMO or FUD. Those are your enemy. They will mislead you almost everytime. </li>\n<li>Don&#39;t stick to a coin unless you really did a perfect research and made your mind. Stick to the plan. </li>\n<li>Don&#39;t copy some internet peoples trades. Most possibly they will mislead you and make profit on you.</li>\n<li>Never join pump/dump groups. You will end up losing your money or becoming a bagholder.</li>\n<li>Don&#39;t even bother to buy trading robots. A real profitable trading robot won&#39;t be sold. </li>\n<li>Don&#39;t borrow money for investing (especially from your relatives). If you lose money, it will be extremely hard to explain &quot;what really happened.&quot;</li>\n<li>Don&#39;t be greedy :) You will always be able to profit in this market unless you lose all your money. </li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p>I will add more when I have the time. Until then, with respect, </p>\n\n<p>&#x200B;</p>\n\n<p>Buy Bitcoin.</p>\n</div><!-- SC_ON -->",
  "score": 227,
  "permalink": "/r/CryptoCurrency/comments/mutrqr/do_and_do_not_list_according_to_my_experience_so/",
  "subreddit": "CryptoCurrency",
  "id": "mutrqr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171523321
}