{
  "author": "reggieoninvesting",
  "the_new_excerpt": "The Coinbase IPO is coming up on Wednesday, April 14th. There will be a lot of\nattention on it, and in the crypto markets as well. Coinbase has already\nreleased their Q1 financials. I think this is a bit unusual for a IPO. I don’t\nremember another company releasing earnings statements before an IPO.…",
  "original_created_utc": 1618254168,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "コインベースのIPOが4月14日（水）に迫ってきました。このIPOには多くの注目が集まっています。\nこのIPOは、暗号市場でも注目されています。コインベースはすでに\n第1四半期の財務状況を発表しました。これはIPOとしては少し珍しいことだと思います。私は、他の会社が\n他の会社がIPOの前に決算書を発表した記憶はありません....",
      "title": "コインベース（$COIN）の直接上場IPOは多くの市場を動かすことになる!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "4月14日星期三，Coinbase IPO即将到来。会有很多\n上的关注，而在加密市场上也是如此。Coinbase已经\n发布了他们第一季度的财务数据。我觉得这对IPO来说有点不寻常。我不\n记得还有一家公司在IPO前发布了财报....。",
      "title": "Coinbase($COIN)直接上市IPO将牵动很多市场!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "4月14日星期三，Coinbase IPO即將到來。會有很多\n上的關注，而在加密市場上也是如此。Coinbase已經\n發佈了他們第一季度的財務數據。我覺得這對IPO來說有點不尋常。我不\n記得還有一家公司在IPO前發佈了財報....。",
      "title": "Coinbase($COIN)直接上市IPO將牽動很多市場!"
    }
  ],
  "title": "The Coinbase ($COIN) Direct Listing IPO is Going to Move A Lot of Markets!",
  "created_utc": 1618266012,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The Coinbase IPO is coming up on Wednesday, April 14th. There will be a lot of attention on it, and in the crypto markets as well. Coinbase has already released their Q1 financials. I think this is a bit unusual for a IPO. I don’t remember another company releasing earnings statements before an IPO. Anyway, take a look:</p>\n\n<p>&#x200B;</p>\n\n<table><thead>\n<tr>\n<th align=\"left\"></th>\n<th align=\"left\"><strong>Q1 2021</strong></th>\n<th align=\"left\"><strong>2020</strong></th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\"><strong>Revenue</strong></td>\n<td align=\"left\">$1.8B</td>\n<td align=\"left\">$1.14B</td>\n</tr>\n<tr>\n<td align=\"left\"><strong>Net Income</strong></td>\n<td align=\"left\">$730M - $800M</td>\n<td align=\"left\">$322M</td>\n</tr>\n<tr>\n<td align=\"left\"><strong>Verified Users</strong></td>\n<td align=\"left\">56M</td>\n<td align=\"left\">43M</td>\n</tr>\n<tr>\n<td align=\"left\"><strong>Monthly Transaction Users (MTU)</strong></td>\n<td align=\"left\">6.1M</td>\n<td align=\"left\">2.8M</td>\n</tr>\n<tr>\n<td align=\"left\"><strong>Trading Volume</strong></td>\n<td align=\"left\">$335B</td>\n<td align=\"left\">$193B*</td>\n</tr>\n<tr>\n<td align=\"left\"><strong>Assets on Platform</strong>              <strong>- BTC</strong>                                        - E<strong>TH</strong>                                              - <strong>Other crypto assets</strong>                - <strong>Fiat</strong></td>\n<td align=\"left\">$223B**</td>\n<td align=\"left\">$90B***                                 70%                                                   9%                                               15%                                            6%</td>\n</tr>\n<tr>\n<td align=\"left\"><strong>Share of crypto market</strong></td>\n<td align=\"left\"></td>\n<td align=\"left\">11.1% in 2020                               8.3% in 2019                         4.5% in 2018</td>\n</tr>\n</tbody></table>\n\n<p>*$119B is from institutions.. **$112B is from institutions. ***$45B is from institutions.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Important notes from the earnings call transcript:</strong></p>\n\n<p>“Our revenue is highly correlated with the price of Bitcoin and crypto asset price volatility. We cannot forecast the price of bitcoin any better than you can and as a result, it is very difficult to accurately forecast our revenues.”</p>\n\n<p>“We forecast our retail revenue as MTUs times Average Net Revenue per User. These scenarios focus on the average MTUs over the full year 2021. To be clear, these are annual averages, or a straight average of all four quarters in 2021, including our estimated results for Q1 2021. That means there could be fluctuations on a quarter to quarter basis.”</p>\n\n<p>&#x200B;</p>\n\n<p><strong>2021 Outlook Annual Average</strong></p>\n\n<p><strong>Monthly Transaction Users</strong></p>\n\n<table><thead>\n<tr>\n<th align=\"left\">High - 7.0M</th>\n<th align=\"left\">This scenario assumes an increase in crypto market capitalization and moderate-to-high crypto asset price volatility. In this scenario, we expect MTUs to continue to grow for the remainder of 2021.</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">Mid - 5.5M</td>\n<td align=\"left\">This scenario assumes flat crypto market capitalization and low-to-moderate crypto asset price volatility. This scenario assumes a modest decline in MTUs from Q1 2021.</td>\n</tr>\n<tr>\n<td align=\"left\">Low - 3.0M</td>\n<td align=\"left\">This scenario assumes a significant decrease in crypto market capitalization, similar to the decrease observed in 2018, and low levels of crypto asset price volatility thereafter. In this scenario, we assume MTUs will decrease in a corresponding manner and end 2021 at similar levels to Q4 2020.</td>\n</tr>\n</tbody></table>\n\n<p>&#x200B;</p>\n\n<p>It’s important to note how much each of those MTU transactions bring in. “Over the last 2 years, we have seen average annual net revenue per MTU range between $34 - $45 per month, with the low end of this range occurring in 2019, a period of low Bitcoin price and low crypto asset price volatility, and the high end of the range occurring in 2020, a period of rising Bitcoin price. Given the strong performance of Q1 2021, it is likely that annual average net revenue per user will exceed this historical range.”</p>\n\n<p>&#x200B;</p>\n\n<table><thead>\n<tr>\n<th align=\"left\">General and administrative expenses (excluding stock based compensation) for 2021</th>\n<th align=\"left\">$1.3B - 1.6B</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">Sales and marketing</td>\n<td align=\"left\">12% - 15% of net revenue</td>\n</tr>\n<tr>\n<td align=\"left\">Transaction expenses</td>\n<td align=\"left\">13% - 16% of net revenue</td>\n</tr>\n<tr>\n<td align=\"left\">Direct listing (one-time expense in Q2)</td>\n<td align=\"left\">$35M</td>\n</tr>\n</tbody></table>\n\n<p>&#x200B;</p>\n\n<p>The valuation of Coinbase ranges from $20B to $200B, a telling sign these “analysts” don’t have a clue about how to value a cryptocurrency exchange. It’s not their fault. Coinbase will be the first cryptocurrency exchange to go public. If the cryptocurrency space sees a bull market every 4 years like the past two cycles have shown, then the valuation all depends on these cycle, plus the other important factor like the adoption - user growth rate, transactions, and assets. I, as many others, believe these cycles will be less volatile as the adoption increases. Cryptocurrency is still speculative as many thousands of alternative coins have no purpose or real world application. Here’s a breakdown of the approximate valuation (share price +/-$50 in relation to marketcap because no one really knows) price on IPO day:</p>\n\n<p>Coinbase IPO pricing (approximate)</p>\n\n<table><thead>\n<tr>\n<th align=\"left\"><strong>Share Price</strong></th>\n<th align=\"left\"><strong>Marketcap</strong></th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">$194</td>\n<td align=\"left\">$50,000,000,000</td>\n</tr>\n<tr>\n<td align=\"left\">$233</td>\n<td align=\"left\">$60,000,000,000</td>\n</tr>\n<tr>\n<td align=\"left\">$272</td>\n<td align=\"left\">$70,000,000,000</td>\n</tr>\n<tr>\n<td align=\"left\">$311</td>\n<td align=\"left\">$80,000,000,000</td>\n</tr>\n<tr>\n<td align=\"left\">$350</td>\n<td align=\"left\">$90,000,000,000</td>\n</tr>\n<tr>\n<td align=\"left\"><strong>$389</strong></td>\n<td align=\"left\"><strong>$100,000,000,000</strong></td>\n</tr>\n<tr>\n<td align=\"left\">$428</td>\n<td align=\"left\">$110,000,000,000</td>\n</tr>\n<tr>\n<td align=\"left\">$467</td>\n<td align=\"left\">$120,000,000,000</td>\n</tr>\n<tr>\n<td align=\"left\">$506</td>\n<td align=\"left\">$130,000,000,000</td>\n</tr>\n<tr>\n<td align=\"left\">$544</td>\n<td align=\"left\">$140,000,000,000</td>\n</tr>\n<tr>\n<td align=\"left\">$583</td>\n<td align=\"left\">$150,000,000,000</td>\n</tr>\n</tbody></table>\n\n<p>&#x200B;</p>\n\n<p>Since Coinbase will be officially going public this week, other cryptocurrency exchanges have expressed interest in doing so too, Kraken and Gemini specifically. Exchange tokens have run up a lot since the Coinbase listing date announcement on April 1st. Binance has risen from the low $300s to over $500s. Kucoin rose from $6 to a high of $19. And Huobi went from $15 to $20.</p>\n\n<p>&#x200B;</p>\n\n<table><thead>\n<tr>\n<th align=\"left\"></th>\n<th align=\"left\"><strong>April 1 (COIN date announcement)</strong></th>\n<th align=\"left\"><strong>April 11</strong></th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\"><strong>BTC</strong></td>\n<td align=\"left\">$58,350</td>\n<td align=\"left\">$59,830</td>\n</tr>\n<tr>\n<td align=\"left\"><strong>BNB</strong> Binance</td>\n<td align=\"left\">$320</td>\n<td align=\"left\">$520</td>\n</tr>\n<tr>\n<td align=\"left\"><strong>KCS</strong> KuCoin</td>\n<td align=\"left\">$6.20</td>\n<td align=\"left\">$18</td>\n</tr>\n<tr>\n<td align=\"left\"><strong>HT Huobi</strong></td>\n<td align=\"left\">$15.50</td>\n<td align=\"left\">$20</td>\n</tr>\n</tbody></table>\n\n<p>&#x200B;</p>\n\n<p>So now that Coinbase released their financials for up to March 31st, let’s look at Binance. Binance actually has the most inflows because it’s so popular in other countries. Due to the restrictions in the U.S., Binance had to create a different platform for U.S. citizens. Binance did not give out separate numbers for the U.S. but here’s a summary of their financials from their blog post back in December 2020.</p>\n\n<p>&#x200B;</p>\n\n<table><thead>\n<tr>\n<th align=\"left\"><strong>December 2020</strong></th>\n<th align=\"left\"></th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\"><strong>All-time high trading transaction</strong></td>\n<td align=\"left\">$15B</td>\n</tr>\n<tr>\n<td align=\"left\"><strong>Average daily trading volume on Binance exchange (doesn&#39;t include other platforms)</strong></td>\n<td align=\"left\">$3.88B (~$1.42T for the year)</td>\n</tr>\n<tr>\n<td align=\"left\"><strong>Total trading volume across Binance&#39;s platforms</strong></td>\n<td align=\"left\">$3T USDT</td>\n</tr>\n<tr>\n<td align=\"left\"><strong>Institutional clients</strong></td>\n<td align=\"left\">+46% YoY</td>\n</tr>\n</tbody></table>\n\n<p>Binance didn’t give out any information about their user growth but unless everyone is a whale on Binance, it’s assumed there are more users on Binance than Coinbase due to the amount of trading activity going on.</p>\n\n<p>So what’s the play here for the COIN direct listing? Well if you have been buying up BNB, that has been the play for a couple of weeks so congrats to you all. If COIN is being valued at $100B on Wendesday with some analysts saying it’s valued at $200B, it makes BNB look cheap. I know I know, BNB is a token and it doesn’t represent the value of Binance. And the BNB coin burn was the reason it went up. Well why did KCS and HT go up a lot in the same period? It’s an industry movement.</p>\n\n<p>I have been in BNB since $50s and have been buying up until the $400s. Yes it’s a ridiculous valuation but money doesn’t care about your opinions. There’s a lot of hype surrounding the crypto space and the COIN direct listing legitimizes the cryptocurrency space. There’s two things I liked so far about what Coinbase has done. 1) They were transparent with their earnings call on April 6th and 2) them doing a direct listing vs. an IPO shows the “decentralization” of their platform. Coinbase is far from perfect but they are one of a few options for U.S. citizens. If there’s any significant events, like a hack or BTC dropping, I can see Coinbase going through a lot of hell.</p>\n\n<p>“This time it’s different”. Is it? Yes and no. Well if we go through the same 4 year cycle as the previous cycles, Coinbase is going to be in a lot of hurt. The bull market ended on December 2017 and December 2013 so if that’s any indication, they’ll start to see their profits decrease then or a few months later. They’ll still collect fees when people sell. However, there’s usually more HODLers/buyers than sellers I assume. Institutional adoption and public companies (Microstrategy, Square, Tesla) have driven up the price so this a positive. It’s different this time but IMO I think we’ll see a sell-off like we have in previous cycles. When? Could be tomorrow or could be December 2021. Will we see the same 80-95% sell off as previous cycles? For Bitcoin, probably not since there’s more institutional adoption. Just don’t think it won’t happen because you can’t predict price movement no matter how much TA you do. Alt coins will get wrecked for sure in a bear market.</p>\n\n<p>TLDR Coinbase IPO has created a lot of hype for the cryptocurrency space. Exchange tokens like BNB, KCS, and HT have increase by 20%+ in the the last 11 days since the IPO date announcement. Trade at your own risk tolerance. This is not financial advice but for educational purposes only. Good luck to all! :)</p>\n</div><!-- SC_ON -->",
  "score": 59,
  "permalink": "/r/stocks/comments/mpksek/the_coinbase_coin_direct_listing_ipo_is_going_to/",
  "subreddit": "stocks",
  "id": "mpksek",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566618924
}