{
  "author": "Impromptulifer99",
  "original_created_utc": 1624677843,
  "title": "Please stop saying DYOR if you're not going to give real advice other than: \"read the whitepapers\"",
  "created_utc": 1624722199,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Trying to research crypto is hard, I&#39;ve been involved in crypto on and off since 2017 and I still don&#39;t know where to find trustworthy information. Googling crypto brings a heaping pile of FUD, rando price predictions, and mommy-blog style opinion pieces that don&#39;t do anything to educate you. Wikipedia only gives about a kindergarten level of education. And it seems like everyone who&#39;s interested in informing you is just inviting you into their echo-chamber of shameless shilling.</p>\n\n<p>Here&#39;s an example, let&#39;s say someone says ADA is overhyped, it has no live projects that and I shouldn&#39;t buy it. \nI would like to know:\nWhere do I go see what ADA has planned?\nHow scalable is ADA? \nHow do I educate myself on marketcap and see for myself if it&#39;s overhyped? \nWhat advantages does ADA have over ETH and vice versa? \nWhat else might I be missing?</p>\n\n<p>Currently, I&#39;d google each question individually, then struggle to find articles that answer my question, then try to assess which sources are trustworthy. But this takes literal hours of time I don&#39;t have. Is there any other way to find more concentrated trustworthy information?</p>\n\n<p>I&#39;m tired of sifting through nonsense hype and endless FUD. Would appreciate any recommendations!</p>\n</div><!-- SC_ON -->",
  "score": 165,
  "permalink": "/r/CryptoCurrency/comments/o82tio/please_stop_saying_dyor_if_youre_not_going_to/",
  "subreddit": "CryptoCurrency",
  "id": "o82tio",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Trying to research crypto is hard, I've been involved in crypto on and off since\n2017 and I still don't know where to find trustworthy information. Googling\ncrypto brings a heaping pile of FUD, rando price predictions, and mommy-blog\nstyle opinion pieces that don't do anything to educate you.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号を研究しようとするのは難しい、私は2017年からオンとオフで暗号に関わってきました。\n2017年から時々クリプトに関わっていますが、どこで信頼できる情報を見つけられるのか、いまだにわかりません。ググリング\ncryptoをグーグルで検索すると、FUD、乱暴な価格予測、何の役にも立たないママブログ風の意見記事などが山のように出てきます。\nスタイルの意見記事が山のように出てきて、教育には何の役にも立ちません....",
      "title": "DYORと言っても、それ以外の本当のアドバイスをするつもりがないのであれば、やめてください。\"ホワイトペーパーを読め \"以外の本当のアドバイスをしないなら、DYORと言うのはやめてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "试图研究加密货币是很难的，我从2017年开始就断断续续地参与了加密货币的研究，但我仍然不知道在哪里可以找到值得信赖的信息。\n2017年以来，我一直在断断续续地参与加密货币，但我仍然不知道在哪里可以找到值得信赖的信息。在谷歌上搜索\n带来的是一大堆恐惧症、突如其来的价格预测和妈妈博客式的观点文章，对我来说没有任何作用。\n风格的评论文章，对你的教育没有任何作用....。",
      "title": "如果你不打算给出真正的建议，请不要再说DYOR了。\"阅读白皮书\""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "試圖研究加密貨幣是很難的，我從2017年開始就斷斷續續地參與了加密貨幣的研究，但我仍然不知道在哪裏可以找到值得信賴的信息。\n2017年以來，我一直在斷斷續續地參與加密貨幣，但我仍然不知道在哪裏可以找到值得信賴的信息。在谷歌上搜索\n帶來的是一大堆恐懼症、突如其來的價格預測和媽媽博客式的觀點文章，對我來說沒有任何作用。\n風格的評論文章，對你的教育沒有任何作用....。",
      "title": "如果你不打算給出真正的建議，請不要再說DYOR了。\"閱讀白皮書\""
    }
  ]
}