{
  "author": "GringoExpress",
  "original_created_utc": 1640828223,
  "title": "Am I crazy or is CRO the most obvious, best long term hold?",
  "created_utc": 1640839636,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Crypto.com’s staking rewards are amazing. Their debit card rewards are better than literally any credit card reward program that exists, by a huge margin. CdC’s marketing is unparalleled. They likely have the backing of some serious funds considering the hundreds of millions they are spending on advertising. They appear to be completely rock solid, and on track to quickly eclipse Binance. I’m not yet invested in CRO and am still considering it at the moment, as it seems like CRO is the safest bet in all of crypto. I wouldn’t even mind buying $40,000 of it where it’s at now, using the CdC debit card as my daily driver, earn ridiculous cash back and staking rewards, and the price of CRO stay stagnant. I can’t say that about a single other coin in cryptocurrency. Every other crypto is purely about price appreciation potential. CRO’s rewards are so attractive on their own that price appreciation is almost a second thought.&lt;/p&gt;\n\n&lt;p&gt;Please give me bearish reasons not to invest in CRO. I’m genuinely looking for a reason not to invest as I rearrange my crypto portfolio.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 210,
  "permalink": "/r/CryptoCurrency/comments/rrowxq/am_i_crazy_or_is_cro_the_most_obvious_best_long/",
  "subreddit": "CryptoCurrency",
  "id": "rrowxq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Crypto.com’s staking rewards are amazing. Their debit card rewards are better\nthan literally any credit card reward program that exists, by a huge margin.\nCdC’s marketing is unparalleled. They likely have the backing of some serious\nfunds considering the hundreds of millions they are spending on…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Crypto.comのステーキングリワードはすごいです。デビットカードの報酬は\nクレジットカードのポイントプログラムよりも、はるかに大きな差で。\nCdCのマーケティングは比類がない。彼らはおそらく、いくつかの重大なバックアップを持っている\n何億円もの資金を投入していることを考えると...。",
      "title": "私がおかしいのか、それともCROが最もわかりやすく、最高の長期ホールドなのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Crypto.com的赌注奖励是惊人的。他们的借记卡奖励\n比现有的任何信用卡奖励计划都要好，幅度很大。\nCdC的营销是无可比拟的。他们可能有一些重要的资金支持\n考虑到他们花费数亿的资金......",
      "title": "是我疯了还是CRO是最明显、最好的长期持有？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Crypto.com的賭注獎勵是驚人的。他們的借記卡獎勵\n比現有的任何信用卡獎勵計劃都要好，幅度很大。\nCdC的營銷是無可比擬的。他們可能有一些重要的資金支持\n考慮到他們花費數億的資金......",
      "title": "是我瘋了還是CRO是最明顯、最好的長期持有？"
    }
  ]
}