{
  "author": "DJDierrhea",
  "original_created_utc": 1635671102,
  "title": "Can My Cat Kill Me by Chomping Down on My Jugular or Scratching at My Wrists?",
  "created_utc": 1635692316,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Look, this may be ridiculous but I get anxious anytime my kitty is near my neck or when he lays on his back and plays with my hand. His claws are fairly sharp and long and I am afraid of offering him my hand and having my wrist cut open at the vital spot - is this an actual possibility or am I overly anxious? (First time cat owner btw)  </p>\n\n<p>When searching for this, I don&#39;t find anything besides &quot;people can die from cats via allergies.&quot;</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/NoStupidQuestions/comments/qjlq9c/can_my_cat_kill_me_by_chomping_down_on_my_jugular/",
  "subreddit": "NoStupidQuestions",
  "id": "qjlq9c",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Look, this may be ridiculous but I get anxious anytime my kitty is near my neck\nor when he lays on his back and plays with my hand. His claws are fairly sharp\nand long and I am afraid of offering him my hand and having my wrist cut open at\nthe vital spot - is this an actual possibility or am I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "馬鹿げた話かもしれませんが、私は猫ちゃんが首の近くにいると不安になります。\n仰向けになって私の手で遊んでいる時も不安になります。彼の爪はかなり鋭く長いので\n手を差し出して、手首の大事なところを切られたらどうしようと思うと怖いのです。\nこれは実際に起こりうることなのか、それとも私が...。",
      "title": "猫が私の頸動脈を噛んだり、手首を引っ掻いたりして、私を殺すことができますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "听着，这可能很荒唐，但只要我的猫咪靠近我的脖子，我就会感到焦虑不安\n或当它仰卧在我的手上玩耍时，我都会感到焦虑。它的爪子相当锋利\n它的爪子相当锋利，而且很长，我害怕把我的手给它时，我的手腕会被切开。\n这是否是一种实际的可能性，还是我...",
      "title": "我的猫能通过啃咬我的颈部或抓挠我的手腕来杀死我吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "聽着，這可能很荒唐，但只要我的貓咪靠近我的脖子，我就會感到焦慮不安\n或當它仰臥在我的手上玩耍時，我都會感到焦慮。它的爪子相當鋒利\n它的爪子相當鋒利，而且很長，我害怕把我的手給它時，我的手腕會被切開。\n這是否是一種實際的可能性，還是我...",
      "title": "我的貓能通過啃咬我的頸部或抓撓我的手腕來殺死我嗎？"
    }
  ]
}