{
  "author": "mic_droo",
  "original_created_utc": 1642442053,
  "title": "I don't think the crypto.com-hack shows that you should definitely not keep any crypto on exchanges - but weirdly enough rather the opposite?",
  "created_utc": 1642455716,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;By now, we&amp;#39;ve all heard about the crypto.com hack. About 12 hours ago, they tweeted that a &amp;quot;small number of users&amp;quot; reported suspicious activity on their accounts and that they would disable withdrawals for a bit, just to be safe. Just ten minutes ago, they tweeted &amp;quot;Update: Withdrawal services have been restored. All funds are safe.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I personally have never used crypto.com specifically and therefore have no money on there. But honestly, if this had happened to one of the exchanges I use (I won&amp;#39;t say which because it&amp;#39;s not about that, but I use two of the big ones and have a relevant amount of money for me on each of them) I wouldn&amp;#39;t have been worried at all. Big exchanges have insurance, have most of their funds in cold wallets, and especially a very public exchange like crypto.com couldn&amp;#39;t afford the PR disaster of not refunding their customers if it was even remotely their own fault.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve seen a few posts and many comments saying that this proves you should never trust an exchange with cour crypto. But looking at how they reacted - immediately disabling withdrawals, communicating openly etc. - and considering they &lt;strong&gt;have&lt;/strong&gt; to react this way to avoid a PR disaster - I think if this shows anything, it&amp;#39;s rather the opposite: if you have a good password and 2FA, most likely it&amp;#39;s totally fine to leave your coins and tokens on one of the big, trustworthy exchanges.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not saying you should not use your own wallet, for many people that&amp;#39;s the better solution. But especially if you&amp;#39;re new, you&amp;#39;re much more likely to send your coins to nirvana or to lose your private keys than you are to lose your funds if you leave them on the exchange.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m pretty sure y&amp;#39;all will hate this opinion, but I wanted to get it off my chest. Let the &lt;strong&gt;NOT YOUR KEYS NOT YOUR CRYPTO!!1!&lt;/strong&gt; come!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 307,
  "permalink": "/r/CryptoCurrency/comments/s6a47p/i_dont_think_the_cryptocomhack_shows_that_you/",
  "subreddit": "CryptoCurrency",
  "id": "s6a47p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "By now, we've all heard about the crypto.com hack. About 12 hours ago, they\ntweeted that a \"small number of users\" reported suspicious activity on their\naccounts and that they would disable withdrawals for a bit, just to be safe.\nJust ten minutes ago, they tweeted \"Update: Withdrawal services have…"
}