{
  "author": "EDM117",
  "original_created_utc": 1640069664,
  "title": "Why arent there alternatives to Ice Cream Trucks? (Like selling veg/fruits)",
  "created_utc": 1640151019,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Is there a law against this type of business where only Ice Cream trucks are allowed? The reason i&amp;#39;m asking is because I remember visiting my parents home country and almost every day a guy came driving down our neighborhood ringing his bell, selling the most common fruits and vegetables, parking at the end of the neighborhood. (I think, it might also been once a week, I dont remember). What was really great was how convenient it was especially for my mother. &lt;/p&gt;\n\n&lt;h1&gt;-&lt;/h1&gt;\n\n&lt;p&gt;On a side note there are also other benefits. I think this is also much more enviromentally friendly and healthy, in terms of simply buying what you actually need and it being readily available. This reminds me of food deserts around the U.S, how many of neighborhoods dont have access to healthy foods nearby. Just an example of how our enviroment can affect us. Another example is the city of SAN CRISTÓBAL DE LAS CASAS, Mexico, the capital of Coca Cola consumption, where people have access to it everywhere they go. (Even dedicated small neighbbhodd shops just selling Coca Cola)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/TrueAskReddit/comments/rl8nu1/why_arent_there_alternatives_to_ice_cream_trucks/",
  "subreddit": "TrueAskReddit",
  "id": "rl8nu1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Is there a law against this type of business where only Ice Cream trucks are\nallowed? The reason i'm asking is because I remember visiting my parents home\ncountry and almost every day a guy came driving down our neighborhood ringing\nhis bell, selling the most common fruits and vegetables, parking…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このような、アイスクリームトラックだけの商売は法律で禁止されているのでしょうか？\nということです。なぜこのような質問をするかというと、私は両親の故郷を訪問した際に、その思い出を\n毎日毎日、近所で鳴らしながら走っているおじさんがいました。\n鈴を鳴らして、よくある野菜や果物を売り、駐車して...。",
      "title": "なぜアイスクリームトラックに代わるものがないのですか？(野菜や果物の販売など）"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "是否有法律禁止这种类型的业务，只允许冰激凌车\n允许？我问这个问题的原因是，我记得在我父母的家乡访问时\n乡，几乎每天都有一个人开着车在我们的社区里按铃。\n他的铃铛，卖最普通的水果和蔬菜，停车...",
      "title": "为什么没有冰激凌车的替代品？(比如卖蔬菜/水果)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "是否有法律禁止這種類型的業務，只允許冰激凌車\n允許？我問這個問題的原因是，我記得在我父母的家鄉訪問時\n鄉，幾乎每天都有一個人開着車在我們的社區裏按鈴。\n他的鈴鐺，賣最普通的水果和蔬菜，停車...",
      "title": "爲什麼沒有冰激凌車的替代品？(比如賣蔬菜/水果)"
    }
  ]
}