{
  "author": "StopHavingAnOpinion",
  "original_created_utc": 1644580533,
  "title": "Why is reddit getting angry at the truck protestors in Canada for being disruptive and annoying, when the general consensus across reddit in the last few years is that protests are supposed to be disruptive and annoying?",
  "created_utc": 1644585816,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A very popular quote by AOC, which many have posted across reddit,&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;&amp;quot;The whole point of protesting is to make ppl uncomfortable. Activists take that discomfort w/ the status quo &amp;amp; advocate for concrete policy changes. Popular support often starts small &amp;amp; grows. To folks who complain protest demands make others uncomfortable... that’s the point.&amp;quot;&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;I apologise if this question or topic has been done to death.&lt;/p&gt;\n\n&lt;p&gt;America and the rest of the world have been hit by several protests in the last few years, some of these protests have caused hundreds of millions of dollars in damage, and led several deaths. Some of these protests are significantly more &amp;#39;legitimate&amp;#39; in the eyes of many than others. Yet, in almost every case, there is no shortage of people who now believe that silent protesting or &amp;#39;ticketing&amp;#39; is a thing of the past. They are right though, it&amp;#39;s now normal to be an annoying asshole to get a message across. It gets attention and it is far more effective than sitting in a corner and shouting.&lt;/p&gt;\n\n&lt;p&gt;In case anyone is unaware, the trucker protests, or &amp;#39;freedom convoy&amp;#39; as they may refer to themselves, are a protest against Vaccine mandates and issues surrounding restrictions. Normally, people would oppose it on the basis of what it is about. However, I am increasingly encountering conversations about how &amp;#39;annoying&amp;#39; they are. True, there have been reports of extremist elements within the movement, but the vast majority of the complaints I am seeing are merely disruptive. As in, not complaining about who they are or what they want, but the amount of &amp;#39;damage&amp;#39; or &amp;#39;disruption&amp;#39; they are causing. Almost the entire internet is rallied against them. However, as I have said in many other conversations, they cannot have no support, as unsupported protests die in days. This trucker convoy has been going on for a month now. Whether reddit believes it or not, it is abundantly clear that they have some kind of support on the ground, whether is it direct support from new truckers, or the indifferent tolerance of the Ottawa population.&lt;/p&gt;\n\n&lt;p&gt;So, I suppose I am asking what these truckers have done that makes the &amp;#39;Protests are supposed to be annoying&amp;#39; idea moot? As far as I am aware, they haven&amp;#39;t started destructive campaigns across the city? Is the anger merely driven at what they are doing it for? Or have they done something or somethings which completely change the picture that I haven&amp;#39;t heard?&lt;/p&gt;\n\n&lt;p&gt;Thanks, and do try to remain civil in the comments. I understand that this is a controversial subject.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 213,
  "permalink": "/r/TooAfraidToAsk/comments/spxqc3/why_is_reddit_getting_angry_at_the_truck/",
  "subreddit": "TooAfraidToAsk",
  "id": "spxqc3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "A very popular quote by AOC, which many have posted across reddit,\n\n\"The whole point of protesting is to make ppl uncomfortable. Activists take that\ndiscomfort w/ the status quo & advocate for concrete policy changes. Popular\nsupport often starts small & grows. To folks who complain protest demands…"
}