{
  "author": "Ok_Barracuda_9334",
  "original_created_utc": 1626857947,
  "title": "If You Own 0.25 BTC Then You Own More Bitcoin Than 99% Of The World!",
  "created_utc": 1626882373,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is not opinion. It is mathematical fact. There is really no way around it as long as we make two assumptions.\n1.) There will be a maximum of 21,000,000 BTC ever. If there is less (which there is) this only proves my point further. 2.) The population of earth stays at 7,700,000,000 or increases. If the population were to decrease then my numbers would be off a little but it will still hold true.\nWith those assumptions, the fact is that if you own 0.25 BTC now or in the future... that you own more Bitcoin than 99% of the world.\nThis is not arguable. There are a maximum of 21,000,000 coins so let’s pretend they are all available. None are lost or in Satoshi’s wallets.\n21,000,000 / 0.25 BTC = 84,000,000\nThat means there are 84,000,000 segments of 0.25 BTC available.\n84,000,000 / 7,700,000,000 = 0.010901\nSo as long as you own 0.25 BTC you own more bitcoin than 99% of the world. You are in the top 1%!\nAnd in reality, we know that only 18.5m have been released. And 1m is in Satoshi’s wallets and they say 3m has been lost. If that’s the case then lower the 21,000,000 to 14.5 million and you would only need own 0.20 BTC to have more than 99% of the world.\nAgain, there is no getting around this. It is fact. It doesn’t matter if 1 person had the other 20,999,999.75 bitcoins. Your 0.25 BTC means you own more than 99% of the world. You would not necessarily be in the top 1% of bitcoin holders. You simply own more than 99% of the world. It is impossible for you to fall out of that number if you have a quarter bitcoin.\n0.25 and HODL</p>\n\n<p>If you have 0.25 BTC at the moment, you have the equivalent  of  8000$ in a savings account.\nThe average American has about $4,500 in savings.\nBy 2026, BTC will likely be over $100,000, putting that 0.25 BTC at $25,000.\nSo, long before all the Bitcoins are mined (around 2140), that small amount of BTC (0.25) will exceed most American savings by factors of 10 or 100.\nBy 2031 (about 10 years away), you&#39;ll likely have a comfortable nest egg for retirement ($250,000), assuming you own your own home, have a good 401k retirement plan and medical coverage.\nIf you have 0.25 BTC, you&#39;re a very lucky person. But don&#39;t let it go to your head. Live modestly, eat healthy and keep fit.\nNo one enjoys regular visits to the hospital, even if the doctor is a nubile blonde who does amazing things with her glove.</p>\n\n<p>According to markets research. “ The cryptocurrency market, this market was valued at USD 541.0 Million in 2017 and is expected to reach USD 2,902.0 Million by 2023, at a CAGR of 32.31% between 2017 and 2023. The cryptocurrency market is witnessing significant growth because of the benefits of compliance-free peer-to-peer transaction, cross-border remittance transfer, and increase in use cases, as well as some macro drivers such as volatility in the stock market and fluctuating monetary regulations in different countries. The growth of the cryptocurrency market is further propelled by the transparency and immutability of the distributed ledger technology and benefits such as faster transaction and reduction in total ownership cost.”\nThis clearly indicates that the various benefits of cryptocurrencies coupled with the fact that it acts as insurance against national economic failure has helped it find many takers. It would not be far-fetched to see cryptos fast becoming the currency of choice in 2030 as it epitomizes personal freedom.</p>\n\n<p><a href=\"https://twitter.com/0xbitdani?s=11\">https://twitter.com/0xbitdani?s=11</a></p>\n</div><!-- SC_ON -->",
  "score": 188,
  "permalink": "/r/Bitcoin/comments/oom0d6/if_you_own_025_btc_then_you_own_more_bitcoin_than/",
  "subreddit": "Bitcoin",
  "id": "oom0d6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is not opinion. It is mathematical fact. There is really no way around it\nas long as we make two assumptions. 1.) There will be a maximum of 21,000,000\nBTC ever. If there is less (which there is) this only proves my point further.\n2.) The population of earth stays at 7,700,000,000 or increases.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは意見ではありません。それは数学的な事実です。2つの仮定をする限り、これを避けることはできません。\n2つの仮定をする限りは。1.) 最大で21,000,000個の\nBTCは最大で21,000,000個になります。もしそれより少ない場合（実際にはある）、これは私の主張をさらに証明するだけです。\n2.) 地球の人口は77億人またはその増加分にとどまる....",
      "title": "もしあなたが0.25BTCを所有しているなら、世界の99％より多くのビットコインを所有していることになります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这不是意见。这是数学上的事实。真的没有办法绕过它\n只要我们做出两个假设。1.) 将有最多21,000,000人\nBTC。如果有更少（确实有），这只能进一步证明我的观点。\n2.) 地球上的人口保持在7,700,000,000或增加....。",
      "title": "如果你拥有0.25个BTC，那么你拥有的比特币比世界上99%的人都多!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這不是意見。這是數學上的事實。真的沒有辦法繞過它\n只要我們做出兩個假設。1.) 將有最多21,000,000人\nBTC。如果有更少（確實有），這隻能進一步證明我的觀點。\n2.) 地球上的人口保持在7,700,000,000或增加....。",
      "title": "如果你擁有0.25個BTC，那麼你擁有的比特幣比世界上99%的人都多!"
    }
  ]
}