{
  "author": "M00OSE",
  "original_created_utc": 1628923892,
  "title": "5 things to expect from a bull run and practical ways to prepare yourself",
  "created_utc": 1628951508,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Now before you say &quot;<em>I jinxed it</em>&quot; or, for you bears out there: &quot;<em>tHiS isN&#39;t eVeN a bULL rUn</em>&quot; yada yada yada; I&#39;m not saying this is the long awaited bull run. Heck, it could very well be a <em>fake out</em> spurred by a series of publicity-boosting events such as Amazon&#39;s rumored adoption, Ethereum&#39;s upgrades, and the crypto regulation events in the US. But since it&#39;s better to be proactive rather than reactive, here&#39;s a list of things to expect during bull runs and what to do with the information:</p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Large capped cryptos will not perform as well and that&#39;s alright.</strong> We have the <em>Alt Season Index</em> for a reason. It&#39;s been long understood that crypto investors typically move into smaller cap cryptos seeking better short-term ROI. This makes sense because of the <em>Law of Large Numbers</em> that dictates that it will be increasingly difficult to move the price as an asset grows.\n\n<ul>\n<li><strong>Tip:</strong> Adopt the right mentality when investing in cryptos. Bulls runs aren&#39;t sprints; they&#39;re marathons. People don&#39;t invest in large cap cryptos because <em>it&#39;ll get them off to the races</em>, no. People invest in them because there are most likely to be there at the end of the line.</li>\n<li><strong>Mantra:</strong> &quot;<em>The turtle will slowly but surely get to the finish line; the hare can certainly get there much faster but you aren&#39;t really sure what they&#39;re going to do before they get there (or not).</em>&quot;</li>\n</ul></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Lower capped coins will pump.</strong> From time to time, you&#39;ll see coins you&#39;ve never even heard of hit the front pages because of the hype from chartists hawking over daily percentage growth screeners. Being the biggest winner for the day, a week, or even over a couple months doesn&#39;t necessarily equate to being a &#39;good&#39; investment because when the shit hits the fan, these coins will typically also be the biggest losers*.* The true test of a &#39;good&#39; investment is time. If this isn&#39;t your definition of a good investment then you may need to take a step back and look at the bigger picture.\n\n<ul>\n<li><strong>Tip:</strong> Put down the charts and the screeners and cancel out the noise. If you&#39;re in social media, you&#39;ll see these cryptos from time to time, cancel it out—especially if you&#39;ve already settled with your investments. If you can&#39;t put down your charts or screeners, make a personalized one with the cryptos that you want to follow instead of using a global one with all the cryptos available.</li>\n<li><strong>Mantra:</strong> &quot;<em>A sprinting cheetah will hit a wall harder than a strolling elephant.</em>&quot;</li>\n</ul></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Some coins only last one run.</strong> You can do a quick internet search and find lists of cryptocurrencies that never recovered from their previous ATHs. These are cryptocurrencies that managed to gain steam because of some fleeting trend, of which there are tons during each bull run. And, they often only move with the trend. From 2020 until March, we had the Defi (mid-late 2020), NFT (Jan-Feb 2021), and memecoin (Feb-March) craze. These &#39;crazes&#39; only last a couple months and only a few make it out alive. There&#39;s also no indication that the craze will reoccur and certain projects will have another chance to reclaim their ATHs.\n\n<ul>\n<li><strong>Tip:</strong> Don&#39;t ever invest based on hype. If you hear about an opportunity to invest in the &#39;next big thing&#39; after it gets shilled to oblivion across the internet, you&#39;re probably already too late.</li>\n<li><strong>Mantra:</strong> &quot;<em>Bulls make money, bears make money, pigs get slaughtered.&quot;</em> - Jim Cramer</li>\n</ul></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>FUD, FUD, FUD, there will always be FUD.</strong> The Tether apocalypse, government ban, Defi hacks, and scammers everywhere; there will always be FUD: fear, uncertainty, and doubt. There will always be a new angle and people lurking, strategizing, and waiting to pounce.\n\n<ul>\n<li>Tip: Be a FUD master. Yes, even if it&#39;s a pile of stinky shit, inhale as much as you can. Learn everything you need to know, memorize the entire list, and look at past angles of FUD and compare it to the current FUD—it&#39;s human nature to reiterate strategies that succeeded before.\n\n<ul>\n<li>Limit your exposure to FUD even if you think it&#39;s unlikely to happen, <em>i.e.</em> avoid Tether wherever possible by opting for better options like USDC and DAI.</li>\n<li>But also, don&#39;t let the FUD limit your options, <em>i.e.</em> don&#39;t be scared of exploring Defi just because of the countless exploits and horror stories.</li>\n</ul></li>\n<li><strong>Mantra:</strong> &quot;<em>Doubt is an uncomfortable condition, but certainty is a ridiculous one</em>.” - Voltaire</li>\n</ul></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>The FOMO will be real.</strong> For example, you&#39;ll see a bunch of stories of people hitting their personal targets. If you&#39;re in crypto for the tech or for the revolution, that&#39;s great and all; but the reality of crypto is that most people are in it for the profits. And people in the community are going to come and go and that&#39;s alright.\n\n<ul>\n<li><strong>Tip:</strong> Find out what your personal targets are and stick to it. Know that whenever you&#39;ll see &quot;I bought a house with my profits&quot; or &quot;I took a vacation with my gains&quot; types of posts—and there will a lot of them at some point—just be happy for them and stick to your targets.\n\n<ul>\n<li>If you&#39;re still hodling, don&#39;t settle for less</li>\n<li>if you have yet to enter the party: don&#39;t FOMO in. Do some research and set realistic goals.</li>\n</ul></li>\n<li><strong>Mantra:</strong>  &quot;<em>One of the most important financial skills is getting the goalpost to stop moving. It’s also one of the hardest.</em>&quot; - Morgan Housel</li>\n</ul></li>\n</ul>\n\n<p><strong>BONUS</strong>: [credits: u/<a href=\"https://www.reddit.com/user/UndesirableWaffle/\">UndesirableWaffle</a>] &#39;Crypto &#39;experts&#39; and &#39;gurus&#39; will make wild claims like BTC to $1million this year! ADA to $10 soon! And so on and so on. <strong>Tip:</strong> Learn to discern the good one&#39;s from the bad ones; the good one&#39;s are the one&#39;s who don&#39;t <em>actually know shit</em> and don&#39;t claim to know either. This <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/mekhv7/crypto_youtubers_tier_list/\">list</a> is a great start.</p>\n\n<p>That&#39;s pretty much it for this short list. Let me know if I missed anything and, maybe, I can add it.</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/CryptoCurrency/comments/p4368r/5_things_to_expect_from_a_bull_run_and_practical/",
  "subreddit": "CryptoCurrency",
  "id": "p4368r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Now before you say \"I jinxed it\" or, for you bears out there: \"tHiS isN't eVeN a\nbULL rUn\" yada yada yada; I'm not saying this is the long awaited bull run.\nHeck, it could very well be a fake out spurred by a series of publicity-boosting\nevents such as Amazon's rumored adoption, Ethereum's upgrades,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "さて、「ジンクスがある」と言う前に、あるいは、そこにいる熊のために 「これが待ちに待ったブルランだとは言いません。\n私はこれが待ちに待ったブルランだとは言いません。\nこれが待ちに待ったブルランだとは言いません。\n噂されているアマゾンの採用や、イーサリアムのアップグレードなど、一連の宣伝効果の高いイベントによって駆り立てられたフェイクアウトかもしれません。",
      "title": "ブル・ランに期待する5つのことと、実践的な準備の仕方"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "现在，在你说 \"我倒霉 \"之前，或者对于外面的熊孩子来说，\"这不是一个好主意\"。\"这不是什么好东西\n牛市\"，我不是说这是期待已久的牛市。\n糟糕的是，这很可能是由一系列宣传推动的假象所刺激的\n诸如亚马逊传言的采用，以太坊的升级，等等。",
      "title": "对牛市运行的5个预期以及准备的实际方法"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "現在，在你說 \"我倒黴 \"之前，或者對於外面的熊孩子來說，\"這不是一個好主意\"。\"這不是什麼好東西\n牛市\"，我不是說這是期待已久的牛市。\n糟糕的是，這很可能是由一系列宣傳推動的假象所刺激的\n諸如亞馬遜傳言的採用，以太坊的升級，等等。",
      "title": "對牛市運行的5個預期以及準備的實際方法"
    }
  ]
}