{
  "author": "Dorothy2973oj",
  "original_created_utc": 1626296050,
  "title": "Blockchain getting hype up with investors lately",
  "created_utc": 1626316937,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Everyone wants to invest in blockchain. At least, that’s the impression one gets from the daily funding announcements that are eagerly reported by crypto news media.</p>\n\n<p>There&#39;s little doubt that digital currencies have seen remarkable growth. Spurred on by the incredible growth of bitcoin (BTC) and ether (ETH), the field of cryptocurrencies has only continued to expand. Many digital currency enthusiasts believe that these investments could produce a new batch of digital currency millionaires (or billionaires).Another common reason to invest in cryptocurrency is the desire for a reliable, long-term store of value.</p>\n\n<p>Unlike fiat money, most cryptocurrencies have a limited supply, capped by mathematical algorithms. This makes it impossible for any political body or government agency to dilute their value through inflation. Moreover, due to the cryptographic nature of cryptocurrencies, it is impossible for a government body to tax or confiscate tokens without the cooperation of the owner.</p>\n\n<p>This property makes cryptocurrency attractive to people who are worried about hyperinflationary events, bank failures, or other disaster scenarios. Bitcoin in particular has attracted attention due to its deflationary and censorship-resistant properties, leading proponents to describe it as &quot;digital gold.&quot;</p>\n\n<p>One of the most impressive and unique aspects of cryptocurrency is also a significant liability. Since cryptocurrency does not rely on a central intermediary, it falls on the user to safely store the cryptographic keys which control their blockchain address. Investors who choose to explore the digital currency space should be aware that a number of special security measures are absolutely necessary, and that even those measures may not sufficiently protect their holdings against hackers working constantly to refine their techniques. Is this all worth the hype it’s getting lately? Thoughts?</p>\n</div><!-- SC_ON -->",
  "score": 165,
  "permalink": "/r/CryptoCurrency/comments/okdfyo/blockchain_getting_hype_up_with_investors_lately/",
  "subreddit": "CryptoCurrency",
  "id": "okdfyo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Everyone wants to invest in blockchain. At least, that’s the impression one gets\nfrom the daily funding announcements that are eagerly reported by crypto news\nmedia.\n\nThere's little doubt that digital currencies have seen remarkable growth.\nSpurred on by the incredible growth of bitcoin (BTC) and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "誰もがブロックチェーンに投資したいと思っています。少なくとも、日々の資金調達の発表からはそんな印象を受けます。\n暗号ニュースメディアが熱心に報道する毎日の資金調達の発表からは、少なくともそのような印象を受けます。\n印象を受けます。\n\nデジタル通貨が著しい成長を遂げていることは間違いありません。\nビットコイン（BTC）の驚異的な成長に後押しされて、...",
      "title": "最近、投資家の間で盛んになっているブロックチェーン"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "每个人都想投资区块链。至少，这就是人们从每天的基金会议上得到的印象\n从加密货币新闻媒体热切报道的每日融资公告中得到的印象。\n媒体热衷报道的每日融资公告中得到的印象。\n\n毋庸置疑，数字货币已经有了显著的增长。\n在比特币（BTC）惊人增长的刺激下，...",
      "title": "区块链最近被投资者炒得沸沸扬扬"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "每個人都想投資區塊鏈。至少，這就是人們從每天的基金會議上得到的印象\n從加密貨幣新聞媒體熱切報道的每日融資公告中得到的印象。\n媒體熱衷報道的每日融資公告中得到的印象。\n\n毋庸置疑，數字貨幣已經有了顯著的增長。\n在比特幣（BTC）驚人增長的刺激下，...",
      "title": "區塊鏈最近被投資者炒得沸沸揚揚"
    }
  ]
}