{
  "author": "Letsmakeitawsome",
  "original_created_utc": 1635525806,
  "title": "Don’t fool yourself. Next x100 coin is not shilled here.",
  "created_utc": 1635543518,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This sub shilles coins that are already made huge returns. Why? Because general public gain access to cutting edge tech, newest crypto trends only after those coins/tokens gain momentum and make x3-10. How many times MATIC, SOL, ONE, AXIE was shilled here before they exploded? </p>\n\n<p>ADA, ALGO, BTC, ETH etc are great projects and have wonderful future but to assume that they are going to give you biggest returns <strong>in the following year</strong> is delusional. Where as long term - most probably. </p>\n\n<p>Set your priorities straight, DOYR and hodl. I’m not going to tell you which coin is going to be next x100 or more but it is obvious that following niches are going to disrupt the whole world: </p>\n\n<ol>\n<li>Decentralized identities </li>\n<li>Decentralized ticketing </li>\n<li>Metaverse </li>\n<li>Blockchain powered Gaming </li>\n<li>Social tokens </li>\n<li>Everything related to zero knowledge poof (ZKsnarks, zkrollups etc) </li>\n</ol>\n\n<p>Find reliable project in those niches and invest as much as you can afford. Wait for 1-1,5 year and watch the whole Reddit shill those coins/tokens after you already made a fortune on them.</p>\n</div><!-- SC_ON -->",
  "score": 278,
  "permalink": "/r/CryptoCurrency/comments/qigz18/dont_fool_yourself_next_x100_coin_is_not_shilled/",
  "subreddit": "CryptoCurrency",
  "id": "qigz18",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This sub shilles coins that are already made huge returns. Why? Because general\npublic gain access to cutting edge tech, newest crypto trends only after those\ncoins/tokens gain momentum and make x3-10. How many times MATIC, SOL, ONE, AXIE\nwas shilled here before they exploded?\n\nADA, ALGO, BTC, ETH…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブは、すでに大きなリターンを得ているコインを淘汰します。なぜか？なぜなら、一般\n一般の人が最先端の技術や最新の暗号トレンドにアクセスできるのは、それらのコイン/トークンが勢いを増して成功した後だからです。\n一般の人が最先端の技術や最新の暗号トレンドにアクセスするのは、それらのコインやトークンが勢いを増して3～10倍になってからだからです。MATIC、SOL、ONE、AXIEが爆発する前に何度ここで紹介されたことか。\nは爆発する前に何度ここで紹介されたでしょうか？\n\nada、algo、btc、eth...。",
      "title": "自分を騙さないでください。次のx100コインは、ここではシャレになりません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这个次的shilles硬币，已经取得了巨大的回报。为什么？因为一般人\n公众只有在这些币/代币获得势头并赚取3-10倍的利润后，才有机会接触到最先进的技术和最新的加密货币趋势。\n币/代币获得动力并赚取X3-10。有多少次MATIC, SOL, ONE, AXIE\n在它们爆炸之前，有多少次在这里被兜售？\n\nADA, ALGO, BTC, ETH...",
      "title": "不要自欺欺人。下一个x100硬币在这里没有被推销。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個次的shilles硬幣，已經取得了巨大的回報。爲什麼？因爲一般人\n公衆只有在這些幣/代幣獲得勢頭並賺取3-10倍的利潤後，纔有機會接觸到最先進的技術和最新的加密貨幣趨勢。\n幣/代幣獲得動力並賺取X3-10。有多少次MATIC, SOL, ONE, AXIE\n在它們爆炸之前，有多少次在這裏被兜售？\n\nADA, ALGO, BTC, ETH...",
      "title": "不要自欺欺人。下一個x100硬幣在這裏沒有被推銷。"
    }
  ]
}