{
  "author": "-my_reddit_username-",
  "original_created_utc": 1641816911,
  "title": "Have scientists decided what the first observation of the James Webb telescope will be once fully deployed?",
  "created_utc": 1641836657,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Once the telescope is fully deployed, calibrated and in position at L2 do scientist have something they&amp;#39;ve prioritized to observe?&lt;/p&gt;\n\n&lt;p&gt;I would imagine there is quite a queue of observations scientists want to make. How do they decide which one is the first and does it have a reason for being first?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 131,
  "permalink": "/r/askscience/comments/s0iqkg/have_scientists_decided_what_the_first/",
  "subreddit": "askscience",
  "id": "s0iqkg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Once the telescope is fully deployed, calibrated and in position at L2 do\nscientist have something they've prioritized to observe?\n\nI would imagine there is quite a queue of observations scientists want to make.\nHow do they decide which one is the first and does it have a reason for being\nfirst?",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "望遠鏡が完全に展開され、校正され、L2の定位置についたら、次のことを行います。\nサイエンティストは、何か優先して観測したいものがあるのでしょうか？\n\n科学者たちの観測したいことは、かなり列をなしているのではないでしょうか。\nその中で、どの観測を優先するかはどのように決められるのでしょうか？また、その観測を優先する理由もあるのでしょうか？\nを最初にするのでしょうか？",
      "title": "ジェームス・ウェッブ望遠鏡の最初の観測は、どのように行われるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "一旦望远镜完全展开、校准并在L2位置上，科学家们是否有优先观察的东西？\n科学家们是否有他们优先要观测的东西？\n\n我可以想象，科学家们想要进行的观测是相当多的。\n他们如何决定哪一个是第一个，它是否有理由被放在第一位？\n第一？",
      "title": "科学家们已经决定詹姆斯-韦伯望远镜完全部署后的第一次观测将是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "一旦望遠鏡完全展開、校準並在L2位置上，科學家們是否有優先觀察的東西？\n科學家們是否有他們優先要觀測的東西？\n\n我可以想象，科學家們想要進行的觀測是相當多的。\n他們如何決定哪一個是第一個，它是否有理由被放在第一位？\n第一？",
      "title": "科學家們已經決定詹姆斯-韋伯望遠鏡完全部署後的第一次觀測將是什麼？"
    }
  ]
}