{
  "author": "Tredur",
  "original_created_utc": 1635307623,
  "title": "How many times a day do you check your crypto?",
  "created_utc": 1635353295,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>After a horror story or two (hundred...) I have kept it down to about once or twice a day, usually at most.  </p>\n\n<p>There were times that I would obsessively refresh my app over and over, lock it up, restart the app, then repeat... </p>\n\n<p>Anymore, I kind of think it’s fun to see screenshots posted in my various other subs I’m a part of and not even open my apps.  </p>\n\n<p>I actually look more when prices are down a little, to gauge whether DCA would be worth it , or if being patient might yield more coin... </p>\n\n<p>Just wondering if anyone goes like weeks or months without even taking a peek... wondering if that’s my future...</p>\n\n<p>Cheers!</p>\n</div><!-- SC_ON -->",
  "score": 162,
  "permalink": "/r/CryptoCurrency/comments/qgo4ek/how_many_times_a_day_do_you_check_your_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "qgo4ek",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "After a horror story or two (hundred...) I have kept it down to about once or\ntwice a day, usually at most.\n\nThere were times that I would obsessively refresh my app over and over, lock it\nup, restart the app, then repeat...\n\nAnymore, I kind of think it’s fun to see screenshots posted in my various…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "怖い思いをしてからは、1日に1～2回程度に抑えています。\n一日に一度か二度、通常はせいぜい\n\n何度も何度もアプリを更新してはロックし、アプリを再起動してはロックし...を繰り返していたこともありました。\nロックして、アプリを再起動して......を繰り返していたこともありました。\n\nそれよりも、自分のいろいろなところにスクリーンショットが投稿されているのを見ると、なんだか楽しい気持ちになります...。",
      "title": "1日に何回、自分の暗号を確認しますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在经历了一两个可怕的故事之后（一百个......），我已经把它减少到大约一次或两次。\n一天两次，通常最多。\n\n有几次，我执着地一遍又一遍地刷新我的应用程序，锁定它\n锁定，重新启动应用程序，然后重复......\n\n总之，我觉得看到我的各种截图发布很有趣...",
      "title": "你一天要检查多少次你的加密货币？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在經歷了一兩個可怕的故事之後（一百個......），我已經把它減少到大約一次或兩次。\n一天兩次，通常最多。\n\n有幾次，我執着地一遍又一遍地刷新我的應用程序，鎖定它\n鎖定，重新啓動應用程序，然後重複......\n\n總之，我覺得看到我的各種截圖發佈很有趣...",
      "title": "你一天要檢查多少次你的加密貨幣？"
    }
  ]
}