{
  "author": "Take_Notice_Walk",
  "the_new_excerpt": "Could Shrooms be the next hot industry?\n\nMental health awareness is finally getting more recognition after Covid. Shrooms\ncan be treated to treat disorders like anxiety and depression.\n\nMind Medicine (backed by Shark Tank's Kevin O Leery) just got approved to be\nlisted on the Nasdaq next…",
  "original_created_utc": 1619195060,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Shroomsは次のホットな産業になり得るか？\n\nメンタルヘルスへの関心は、Covid以降、ようやく高まってきました。Shrooms\nは、不安や抑うつなどの障害を治療することができます。\n\nMind Medicine（Shark TankのKevin O Leeryが支援）は、次のNasdaqでの上場が承認されたばかりです。\nナスダックへの上場が承認されました。",
      "title": "シュルーム株は次の \"雑草ブーム \"となるか？(Mind Medicine Approved to be listed on Nasdaq, Peter Theilが支援するATAIも近日中にIPO予定)"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "蘑菇可能是下一个热门行业吗？\n\n继科维德之后，心理健康意识终于得到更多的认可。蘑菇\n可以用来治疗焦虑症和抑郁症等疾病。\n\nMind Medicine公司（由鲨鱼坦克的Kevin O Leery支持）刚刚被批准在纳斯达克上市。\n下一步在纳斯达克上市。",
      "title": "香菇股票会成为下一个 \"杂草热潮 \"吗？(Mind Medicine获准在纳斯达克上市，Peter Theil支持的ATAI也将很快上市)。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "蘑菇可能是下一個熱門行業嗎？\n\n繼科維德之後，心理健康意識終於得到更多的認可。蘑菇\n可以用來治療焦慮症和抑鬱症等疾病。\n\nMind Medicine公司（由鯊魚坦克的Kevin O Leery支持）剛剛被批准在納斯達克上市。\n下一步在納斯達克上市。",
      "title": "香菇股票會成爲下一個 \"雜草熱潮 \"嗎？(Mind Medicine獲准在納斯達克上市，Peter Theil支持的ATAI也將很快上市)。"
    }
  ],
  "title": "Will Shroom stocks be the next \"Weed Boom\"? (Mind Medicine Approved to be listed on Nasdaq, Peter Theil backed ATAI to IPO a soon as well).",
  "created_utc": 1619201896,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Could Shrooms be the next hot industry?</p>\n\n<p>Mental health awareness is finally getting more recognition after Covid. Shrooms can be treated to treat disorders like anxiety and depression.</p>\n\n<p>Mind Medicine (backed by Shark Tank&#39;s Kevin O Leery) just got approved to be listed on the Nasdaq next week.</p>\n\n<p>Peter Theil&#39;s backed ATAI will IPO soon as well.</p>\n\n<p>Is this industry boom just getting started or has it already boomed?</p>\n\n<p>What are your thoughts?</p>\n\n<p>I know there are plenty of pharma stocks if you want to invest in mental health. But Shrooms kinda has that &quot;oompf&quot; in a market where people chase momentum and crave stocks that are &quot;sexy&quot; (kinda like the weed stocks).</p>\n\n<p>Disclosure:</p>\n\n<p>I am long Mind Medicine and Numi Wellness and could see this go either way</p>\n</div><!-- SC_ON -->",
  "score": 2435,
  "permalink": "/r/stocks/comments/mwz1wo/will_shroom_stocks_be_the_next_weed_boom_mind/",
  "subreddit": "stocks",
  "id": "mwz1wo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776214689
}