{
  "author": "Typhoonfight1024",
  "original_created_utc": 1635430656,
  "title": "Does water count as boson, since it has even number of baryons and electrons?",
  "created_utc": 1635473834,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve read somewhere that a boson is any particle with integer spin. And alpha particle is a boson too because it consists of an even number of fermions (in this case, proton and neutron).</p>\n\n<p>So if any composite particle consists of even number of fermions, shouldn&#39;t water molecule count as boson too? Normal water has one 16-Oxygen and two 1-Hydrogens, so the baryons (which are fermions) are even, and the electrons (fermions too) are even too.</p>\n\n<p>But there&#39;s nowhere said that water is a boson, so I must be wrong somewhere…</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/askscience/comments/qho2b5/does_water_count_as_boson_since_it_has_even/",
  "subreddit": "askscience",
  "id": "qho2b5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've read somewhere that a boson is any particle with integer spin. And alpha\nparticle is a boson too because it consists of an even number of fermions (in\nthis case, proton and neutron).\n\nSo if any composite particle consists of even number of fermions, shouldn't\nwater molecule count as boson too?…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ボソンとは、整数のスピンを持つ粒子のことだとどこかで読んだことがあります。そして、アルファ\n偶数個のフェルミオン（この場合は陽子と中性子）で構成されているので、アルファ粒子もボゾンです。\n偶数個のフェルミオン（この場合は陽子と中性子）で構成されているからです。)\n\nもし、どんな複合粒子でも偶数個のフェルミオンで構成されているなら、次のようになるのではないでしょうか。\n水分子もボソンになるのでは？",
      "title": "水はバリオンと電子の数が同じなので、ボゾンとしてカウントされますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我曾在某处读到，玻色子是任何具有整数自旋的粒子。而阿尔法\n粒子也是一个玻色子，因为它由偶数的费米子（在这种情况下，质子和中子）组成。\n在这种情况下，质子和中子）。)\n\n因此，如果任何复合粒子由偶数费米子组成，难道不应该\n水分子也应该算作玻色子吗？",
      "title": "水算不算玻色子，因为它有偶数的重子和电子？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我曾在某處讀到，玻色子是任何具有整數自旋的粒子。而阿爾法\n粒子也是一個玻色子，因爲它由偶數的費米子（在這種情況下，質子和中子）組成。\n在這種情況下，質子和中子）。)\n\n因此，如果任何複合粒子由偶數費米子組成，難道不應該\n水分子也應該算作玻色子嗎？",
      "title": "水算不算玻色子，因爲它有偶數的重子和電子？"
    }
  ]
}