{
  "author": "UnderwaterCosmonaut",
  "original_created_utc": 1633449265,
  "title": "Am I a bad friend if I sometimes get annoyed with my friend talking about her depression and her therapy sessions all the time?",
  "created_utc": 1633462277,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I don&#39;t know how to explain this properly so please bear with me. English isn&#39;t my first language. For context, I&#39;m not saying being depressed is a bad thing. I support this friend in all her struggles and her battles involving her mental health and I&#39;m glad she&#39;s getting the help she needs. Whenever she needed someone to talk to, I&#39;ve always listened and done what I could to help out. I&#39;ve had these same struggles myself but I&#39;m the type who&#39;s not comfortable sharing it to other people. My friend isn&#39;t, she&#39;s been really open about it.</p>\n\n<p>I don&#39;t think it&#39;s a bad thing that she&#39;s sharing though. I think it&#39;s brave. But lately, it seems like that&#39;s all she ever talks about (like about her therapy sessions and such). But not like in a &quot;i&#39;m just feeling so lost and down, I just need a friend to talk to&quot; kind of way; more like &quot;yeah, i&#39;m just having one of those days again. The depression can really drain the energy out of me&quot; kind of way, y&#39;know? Like i get that. Being exhausted all the time sucks. Not being able to function properly like a regular human being sucks. But it seems like this is just another regular thing for her, like how we talk with our friends about how stressful our job is, or the burden of paying bills, etc.</p>\n\n<p>I&#39;ve encountered people with depression and anxiety and other similar illnesses, and they almost never openly talk about their struggles (at least not in the way my friend does it) because they&#39;re not comfortable with it either. And those times when they do start to open up, you can really tell how much their situation breaks them. Which is not what I see in my friend whenever she does it. It has come to a point when she somehow finds ways to insert this into our normal conversations, to the point when she doesn&#39;t even bother asking how her other friends are doing.</p>\n\n<p>Am I a bad friend for thinking this is really unfair? All of us in our friend group are all struggling with our own serious issues, but it all seems to be overshadowed by her just almost always talking about hers. I hate that I even feel this way, but I just can&#39;t help but feel a bit hurt. I honestly don&#39;t even remember the last time she ever asked how I was doing.</p>\n</div><!-- SC_ON -->",
  "score": 108,
  "permalink": "/r/TooAfraidToAsk/comments/q1zbxg/am_i_a_bad_friend_if_i_sometimes_get_annoyed_with/",
  "subreddit": "TooAfraidToAsk",
  "id": "q1zbxg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I don't know how to explain this properly so please bear with me. English isn't\nmy first language. For context, I'm not saying being depressed is a bad thing. I\nsupport this friend in all her struggles and her battles involving her mental\nhealth and I'm glad she's getting the help she needs.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "うまく説明できませんので、ご容赦ください。英語は第一言語ではありません。\n私の第一言語ではありません。落ち込むことが悪いことだと言っているわけではありません。I\n私はこの友人が精神的な健康に関わるすべての苦労や戦いをサポートしています。\n彼女が必要な助けを得ていることを嬉しく思っています....",
      "title": "友人が自分のうつ病やセラピーの話をずっとしていてイライラすることがあるのですが、私は悪い友人でしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不知道如何正确解释，所以请大家忍耐一下。英语并不是\n我的第一语言。就背景而言，我并不是说抑郁是一件坏事。I\n我支持这位朋友的所有挣扎和涉及她的心理健康的战斗。\n我很高兴她得到了她需要的帮助，....。",
      "title": "如果我有时对我的朋友一直谈论她的抑郁症和她的治疗课程感到厌烦，我是不是一个坏朋友？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不知道如何正確解釋，所以請大家忍耐一下。英語並不是\n我的第一語言。就背景而言，我並不是說抑鬱是一件壞事。I\n我支持這位朋友的所有掙扎和涉及她的心理健康的戰鬥。\n我很高興她得到了她需要的幫助，....。",
      "title": "如果我有時對我的朋友一直談論她的抑鬱症和她的治療課程感到厭煩，我是不是一個壞朋友？"
    }
  ]
}