{
  "author": "chance_waters",
  "original_created_utc": 1628746663,
  "title": "The cult at over at r/safemoon have been brigading any posts critical of their pyramid scheme. Not only are they muting any perma banning anybody who flags the fact the devs are dropping their bags, they are now actively brigading to hide any callouts in r/cryptocurrency.",
  "created_utc": 1628757677,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In the past few weeks I&#39;ve made a few posts highlighting the developing dangerous and cult like censorship and echo chamber forming over at <a href=\"/r/safemoon\">r/safemoon</a>. The moderators in collaboration with the devs are working to lure new investors into the pyramid by silencing any dissent, and the community aggressively downvote any form of criticism or alarm raising, even from fellow bag holders.</p>\n\n<p>This is happening against a backdrop of the developers selling off their enormous bags consistently (trillions of tokens a day) and stealing millions of dollars from the cult. The doublethink is so extreme that the community there have been duped into celebrating being left holding those bags, off the botched tokenomics and the idea of &#39;reflections&#39; - misunderstanding that the consistent downtrend in value is pulling their reflections value closer and closer to 0. They have gone so far as to believe the whales are selling their bags to help them, in some weird Q Anon style myth.</p>\n\n<p>The post which got brigaded was pointing out the fact they are celebrating these bag dumps in their top upvoted post. Off the back of it myself and all the regular <a href=\"/r/cryptocurrency\">r/cryptocurrency</a> users who commented received hundreds of cumulative downvotes, I had other posts brigaded, was sent death threats, links to suicide lines, and conspiratorial insults insinuating I was a fellow bag holder who was salty about selling. In their threads about the post multiple members actively promote downvoting critical posts on <a href=\"/r/cryptocurrency\">r/cryptocurrency</a> to take moons from commenters. Some of their new trending posts encourage brigading all Safemoon posts here with positive statements.</p>\n\n<p>This is getting super out of hand and is running exactly in parallel to what many of us saw happen with Bitconnect, I have dejavu from arguing with people during that time period and getting brigaded on socials for calling it what it was. I&#39;m not sure what steps should be taken here, but I feel genuinely bad for their userbase, and I&#39;m seeing heavily upvoted threads with new entrants selling real projects to jump in at the base of the pyramid, which is only happening because they are manufacturing a fake narrative around the status of the project.</p>\n</div><!-- SC_ON -->",
  "score": 417,
  "permalink": "/r/CryptoCurrency/comments/p2tkp9/the_cult_at_over_at_rsafemoon_have_been_brigading/",
  "subreddit": "CryptoCurrency",
  "id": "p2tkp9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In the past few weeks I've made a few posts highlighting the developing\ndangerous and cult like censorship and echo chamber forming over at r/safemoon\n[/r/safemoon]. The moderators in collaboration with the devs are working to lure\nnew investors into the pyramid by silencing any dissent, and the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この数週間、私は、発展途上にある危険でカルト的な検閲と、それを阻止するためのいくつかの記事を書いてきました。\nr/safemoonで形成されている危険でカルト的な検閲とエコーチェンバーに注目した投稿をしました。\n[/r/safemoon]. モデレーターは開発者と協力して、新しい投資家をピラミッドに誘い込むために働いています。\nこのような状況では、新しい投資家をピラミッドに誘い込むために、反対意見を封じ込めて、...",
      "title": "r/safemoonのカルト集団が、自分たちのマルチ商法に批判的な投稿をすべて制裁しています。開発者がバッグを落としていることを指摘した人をミュートしたり、永久追放したりしているだけでなく、r/cryptocurrencyでの呼びかけを隠すために積極的にブログを書いています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在过去的几周里，我发表了几篇文章，强调了正在发展的\n在r/safemoon上形成的危险和邪教般的审查制度和回音室。\n[/r/safemoon]。版主与开发者合作，正在努力吸引\n新的投资者进入金字塔，压制任何不同意见，而...",
      "title": "r/safemoon的邪教组织一直在抨击任何批评他们的金字塔计划的帖子。他们不仅对任何标明开发者正在放弃他们的袋子的永久禁言进行缄默，他们现在还在积极刷屏，以隐藏r/cryptocurrency中的任何呼声。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在過去的幾周裏，我發表了幾篇文章，強調了正在發展的\n在r/safemoon上形成的危險和邪教般的審查制度和迴音室。\n[/r/safemoon]。版主與開發者合作，正在努力吸引\n新的投資者進入金字塔，壓制任何不同意見，而...",
      "title": "r/safemoon的邪教組織一直在抨擊任何批評他們的金字塔計劃的帖子。他們不僅對任何標明開發者正在放棄他們的袋子的永久禁言進行緘默，他們現在還在積極刷屏，以隱藏r/cryptocurrency中的任何呼聲。"
    }
  ]
}