{
  "author": "itzdivz",
  "original_created_utc": 1626767251,
  "title": "Market may look scary right now, but Bitcoin is serving its true purpose in many other countries as currency for the people. It is quietly having a bullrun in many places. #hodl",
  "created_utc": 1626823839,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The situation may seem bear right now for those in the USA, Europe. But bitcoin is serving its true purpose in countries such as China and Argentina, it is becoming the currency for the people.</p>\n\n<p>Regardless of what China posting how economy is doing well and recovering well. I can tell u food prices are going through the fucking roof in China. China GDP growth reported 20%, guess what prices of food went up by 50-100% for 99% of necessary items. Majority of the banks is banning any account associated with transferring of money into crypto exchanges. Crypto is almost the only reliable way of sending money outside of the country and holding as a steady investment. China built housing for 4billion people, and population is 1.3billion. It is bubble about to burst any time. The government controls the stock market, theres pretty much no way to make money from stock market.</p>\n\n<p>My friend from Argentina say his country inflation is 50% every year the past few years. He buys bitcoin and send it back to his family monthly. It is only thing that is keeping his family afloat and not becoming dead poor. </p>\n\n<p>Inflation is killing a lot of the currencies outside of USD, euros. Bitcoin is already having its own bulllrun in those countries regardless of the USD price. It is serving its true purpose as currency of the people. Price will catch on to the rest of the world due to how greedy the governments are getting with the endless money printing. #HODL</p>\n</div><!-- SC_ON -->",
  "score": 161,
  "permalink": "/r/Bitcoin/comments/onxhx2/market_may_look_scary_right_now_but_bitcoin_is/",
  "subreddit": "Bitcoin",
  "id": "onxhx2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The situation may seem bear right now for those in the USA, Europe. But bitcoin\nis serving its true purpose in countries such as China and Argentina, it is\nbecoming the currency for the people.\n\nRegardless of what China posting how economy is doing well and recovering well.\nI can tell u food prices…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アメリカやヨーロッパの人々にとっては、今の状況は厳しいものに見えるかもしれません。しかし、ビットコインは\nは、中国やアルゼンチンなどの国々で本来の役割を果たしています。\n人々の通貨となっています。\n\n中国がどのような投稿をしようとも、経済は順調に回復しています。\n私が言えるのは、食料品の価格が...",
      "title": "今は市場が怖く見えるかもしれませんが、ビットコインは国民のための通貨として他の多くの国でその本来の目的を果たしています。多くの場所で静かにブルランしています。#hodl"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对于那些在美国、欧洲的人来说，现在的情况可能看起来很糟糕。但是比特币\n正在中国和阿根廷等国家发挥其真正的作用。\n成为人民的货币。\n\n不管中国如何发帖，经济都做得很好，恢复得很好。\n我可以告诉你，食品价格...",
      "title": "市场现在看起来很可怕，但比特币在许多其他国家作为人民的货币，正在发挥其真正的作用。它正在许多地方悄悄地进行一场牛市。#hodl"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對於那些在美國、歐洲的人來說，現在的情況可能看起來很糟糕。但是比特幣\n正在中國和阿根廷等國家發揮其真正的作用。\n成爲人民的貨幣。\n\n不管中國如何發帖，經濟都做得很好，恢復得很好。\n我可以告訴你，食品價格...",
      "title": "市場現在看起來很可怕，但比特幣在許多其他國家作爲人民的貨幣，正在發揮其真正的作用。它正在許多地方悄悄地進行一場牛市。#hodl"
    }
  ]
}